{"artist": "Angel Haze", "songs": [{"title": "No Limits", "image": "https://images.genius.com/5dc1fbfb5d3f4e2bc1ea1548dc32b8a4.313x313x1.jpg", "album": null, "lyrics": "[Intro]\nI asked you the other day to give me five major things that you are willing to let go in order to claim your victory over your life. What are the five things you are willing to let go of?\n\nMy ego. Fear. Uh...attachment to toxic things in my life. Negativity. Crutches, all of my crutches. And my past\n\n[Chorus]\nRisk being uncomfortable to become unstoppable\nI'm just different (I'm just) I'm just different\nI risk all of my fake friends just to go handle my business\nYeah I'm just different\nAy y'all bear with me, bear with me\nI risk ego, pride, fear, disguise and days spent pretending\nYeah I'm not different, but I've got ambition\nAnd I risk everything that I got\nJust to make sure y'all get it\nThat I'm so different (I'm so different)\nI don't have to fit in\nWhat the fuck is that?\n\nPower!\nSpirit!\nHealing!\nNo limits, no limits, I say\nPower!\nFeel it! (Love)\nHeal it! (Love)\nThat's no limits, that's no limits ahh!\n\n[Verse 1]\nI'm all about love\nAnd synergy focus the energy\n[?] Face what's been hindering all of my gifts\nLike I'm trapped in my centerpiece\nLife was just peaches well fuck it\nI'm Jiminy Crickets\nWhenever I ask who contending me\nI've been the best for what feels like infinities\nFeels like my heart was mountain with wildebeests\nStart cutting the weeds and now its anemone\nGod its a feeling b nothing can limit me\nHandle my gifts now im brazen not timidly\nI emit glory when u in my vicinity\nAnd i just went xena start murking my enemies\nI got the plans, God is my mans\nFuck making friends and fuck making amends\nYall gotta pay for the days that you lost in your race\nCuz you niggas just wanted advances\nFuck you!\nI do my work with my hands in\nNever got hand outs\nNever got pension\nBut Im a beast when i get on my pen shit\nI spit in cursive you niggas is scribblin'\nI swear to God I been searching for peace\nNobody scratches the surface for free\nCuz all that pretense and pretending defense for pennies\nThat shit wasn't working for me, so I\n\n[Chorus]\n\n[Verse 2]\nNow im like\nWho did it whose is it\nI need some proof with it\nI tie yo laces myself if the shoe fit it\nI got them shooters outside & the coupe tinted\nI put them chickens right back in the coop with it\nHotter than houston I chop u like screw did it\nBack on my bullshit, back in the blue fitted\nI said I was shaking hands with the devil\nA rock in a hard place stoned like a pebble\nGave all you niggas the chance to make history\nNow you just kinda gotta sit back and witness me\nChanging the tides of what u thought the shit would be\nGlory to God, a young bitch got the victory!\nYou could too if you knew what this game would do to you\nGotta have faith in what you do\nK? Dot dot dot like doo doo doo\nIm just tryna drop knowledge\nAin't go to college\nShouldn't have dropped it\nNow I'm at the bank withdrawing deposits\nI want the statements I read the clauses\nThis congregation needed a profit\nNow that they got one this is the offering (yeah!)\nI just decided to bet on me\nAnd im grateful cuz i couldve lost it all\n\n[Outro]", "year": "2017-07-17"}]}