{"songs": [{"image": "https://images.genius.com/918b4db0bc6d6cd1a89e223b72d2d53b.1000x1000x1.jpg", "title": "Evil Shit", "album": "The Pre-Fix for Death", "year": null, "lyrics": "This be some evil shit to inspire you to start a fire\nDo something illegal, only thing you require is a wire to strangle someone\nLet out your anger son, buildin' up, you're filled up with pain and anguish\nKid do you understand my insane language?\nSENSELESS, violence, psychology, apprentices of sickness learnin' the art of WHILIN', and robbery with demented instincts\nCemented in your mental is the exceptional fact that feeling sentimental for humans is detrimental\nI'm experimental in the ways of murderin' you herbs and turds with absurd words and verbs\nWould you have preferred being lured into a crucifixion scenario, where you're eaten by birds?\nThe impresario--of rude convictions--describing\nCrude descriptions\nPrescribing murder through scribes, and desecrate the bible's vibes\nMaggots crawling on this page as I write this rap\nIt's amazing, appalling, I think Satan's calling, I might snap\n\n(Hook)\nRap, stab, flesh, Jux, quick then grab your neck\nBludgeon you bloody yo buddy, you stupid? What's after death?\nPsychological with the demonic pull, reelin' you into sin peelin' your skin like a psychotic bull\n\nGod won't protect your existence, so I don't respect your religion\nVisually you reflect a pigeon, this'll be dissected by traffic\nGraphic violence the science of a bloodbath is mathematic multiplying of catastrophic dying of vinyl plastic\nOr a CD, mastered, you can't answer whether I'm making sense or not or imitating Manson\nPreaching the end of God is my mantra. Enter the pod, take a trip into the nucleus of gore where the center is scarred\nYou'll catch a barbarian beating by convicted thugs\nLeft in the sanitarium, eating prescription drugs\nForce me to brutalize you, demonstrate to you how I utilize a butcher knife to computerize your flesh, pixelate you\nTriple six degrade you. You can't quarantine the therapeutic Thorazine forever putrid horror scenes\nThat sick cleverly secluded in the origin of this cerebrum deep-rooted info for the coroner team\n\n(Hook)\nRap, stab, flesh, Jux, quick then grab your neck\nBludgeon you bloody yo buddy, you stupid? What's after death?\nPsychological with the demonic pull, reelin' you into sin peelin' your skin like a psychotic bull"}], "artist": "Necro"}