{"songs": [{"year": "2012-10-15", "album": "good kid, m.A.A.d city (Deluxe Version)", "image": "https://images.genius.com/f3db37bb8953d6e671d8bb532da2e855.220x220x1.jpg", "title": "Backseat Freestyle", "lyrics": "[Produced by Hit-Boy]\n\n[Intro]\nUh, Martin had a dream\nMartin had a dream\nKendrick have a dream\n\n[Chorus]\nAll my life I want money and power\nRespect my mind or die from lead shower\nI pray my dick get big as the Eiffel Tower\nSo I can fuck the world for seventy-two hours\n\n[Verse 1]\nGoddamn I feel amazin', damn, I'm in the Matrix\nMy mind is livin' on cloud nine and this 9 is never on vacation\nStart up that Maserati and – vroom-vroom! – I'm racin'\nPoppin' pills in the lobby and I pray they don't find her naked\nAnd I pray you niggas is hatin', shooters go after Judas\nJesus Christ, if I live life on my knees ain't no need to do this\nPark it in front of Lueders, next to that Church's Chicken\nAll you pussies is losers, all my niggas is winners, screamin'—\n\n[Chorus]\nAll my life I want money and power\nRespect my mind or die from lead shower\nI pray my dick get big as the Eiffel Tower\nSo I can fuck the world for seventy-two hours\n\n[Post-Chorus 1]\nGoddamn I got bitches, damn I got bitches\nDamn I got bitches: wifey, girlfriend and mistress\nAll my life I want money and power\nRespect my mind or die from lead showers\n\n[Verse 2]\nI've got 25 lighters on my dresser, yessir\nPut fire to that ass, body cast on a stretcher\nAnd her body got that ass that a ruler couldn't measure\nAnd it make me cum fast, but I never get embarrassed\nAnd I recognize you have what I've been wantin' since that record\nThat Adina Howard had pop it fast to impress her\nShe rollin', I'm holdin' my scrotum and posin'\nThis voice here is golden, so fuck y'all, I goes in, and—\n\n[Chorus]\nAll my life I want money and power\nRespect my mind or die from lead shower\nI pray my dick get big as the Eiffel Tower\nSo I can fuck the world for seventy-two hours\n\n[Post-Chorus 2]\nGoddamn I got bitches, damn I got bitches\nDamn I got bitches: wifey, girlfriend and mistress\nAll my life I want money and power\nRespect my mind or, nigga, it's go time\n\n[Verse 3]\nI roll in dough with a good grind\nAnd I run at ho with a baton\nThat's a relay race with a bouquet\nThey say, \"K, you goin' marry mines.\"\nBeeotch! No way, beeotch! No way\nBeeotch! No way, beeotch! Okay\nI'm never livin' life confined\nAs I feel you even if I'm blind\nI can tell you who, what, when, where\nHow to sell your game right on time\nBeeotch! Go play, beeotch! Go play\nBeeotch! Go play, beeotch! I look like OJ\nKillin' everything from pussy to a mothafuckin' Hit-Boy beat\nShe pussy poppin' and I got options like an audible, I be\nC-O-M-P-T-O-N, I win, then ball at your defeat\nC-O-M-P-T-O-N, my city, mobbin' in the street, yellin'—\n\n[Chorus]\nAll my life I want money and power\nRespect my mind or die from lead shower\nI pray my dick get big as the Eiffel Tower\nSo I can fuck the world for seventy-two hours\n\n[Post-Chorus 1]\nGoddamn I got bitches, damn I got bitches\nDamn I got bitches, wifey, girlfriend and mistress\nAll my life I want money and power\nRespect my mind or die from lead showers\n\n[Outro]\nLet it run, Ali\nMartin had a dream\nMartin had a dream\nKendrick have a dream"}], "artist": "Kendrick Lamar"}