{"songs": [{"title": "Crazy World", "lyrics": "[Verse 1]\nYeah, y'all better vote for Barrack O' Drama\nA black president and shit, nigga\nOh, oh this shit fucked up right here, nigga\nAin't no work, ain't no jobs, yeah we still got bills tho nigga\nBest believe nigga, but through it all what they want hommie, yeah?\nThey want that young shit, that dumb shit, that, where you from shit?\nThat ride around your hood all day with your gun shit\nAll I got to my name is two bricks and one felony\nYou going back to jail, that's what my conscience keep on telling me\nI really ain't buying all that bullshit they selling me\nWhen the government throwing more curves than the letter C\nI said the letter C, I guess that's for correctional\nThey tryin' to box me in, sit me still like a vegetable\nGoddamn, another trap, I think Bush is tryin' punish us\nSendin' a little message out to each and everyone of us\nReal G shit, boy that's really unheard of\nWhen you get more time for sellin' dope than murder\n(In this crazy world)\n\n[Hook]\nThis world keep spinnin', yeah my rims still spinnin'\nEven though the money slow we still spinnin' (in this crazy world)\nAs this world keep turnin', yeah, my blunt still burnin'\nSame thing different day, it's still burnin' (in this crazy world)\nSee this dope still selling and these niggas still tellin'\nWill you make it through the day? It's no tellin' (in this crazy world)\nYeah, yeah, yeah, (in this crazy world)\n\n[Verse 2]\nWhen I as 14 I turned nothin' to a quarter mil\nProbably why I never give a fuck about a record deal\nAnd I ain't never tried this shit, imagine how that white feel\nBut that don't even matter though, tryin' to pay the light bill\nLight bill, phone bill plus my granny nerve pills\nFeel like I should be takin' them, imagine how my nerves feel\nI want a new Bentley and my auntie need a kidney\nAnd if I let her pass her children never will forgive me\nGoddamn, another trap, I think Bush is tryin' punish us\nSendin' a little message out to each and everyone of us\nReal G shit, boy that's really unheard of\nWhen you get more time for sellin' dope than murder\n(In this crazy world)\n\n[Hook]\nThis world keep spinnin', yeah my rims still spinnin'\nEven though the money slow we still spinnin' (in this crazy world)\nAs this world keep turnin', yeah, my blunt still burnin'\nSame thing different day, it's still burnin' (in this crazy world)\nSee this dope still selling and these niggas still tellin'\nWill you make it through the day? It's no tellin' (in this crazy world)\nYeah, yeah, yeah, (in this crazy world)\n\n[Verse 3]\nI ain't an X-Box, so why you niggas tryin' play with me?\nI really beat the streets so what you niggas gotta say to me?\nCan't be much, can't be much, why? Cause I ain't listenin'\nI just left the hood and I'll be damned if they ain't feelin' 'em\nWanna see me fall off, guess that just the way it be\nOld school triple beam, I'm using that the way I'm being\nAnd plus I got driver that can get them thangs from A to B\nSoon as you get your money right, they hit you with conspiracy\nGoddamn, another trap, I think Bush is tryin' punish us\nSendin' a little message out to each and everyone of us\nReal G shit, boy, that's really unheard of\nWhen you get more time for sellin' dope than murder\n(In this crazy world)\n\n[Hook]\nThis world keep spinnin', yeah my rims still spinnin'\nEven though the money slow we still spinnin' (in this crazy world)\nAs this world keep turnin', yeah, my blunt still burnin'\nSame thing different day, it's still burnin' (in this crazy world)\nSee this dope still selling and these niggas still tellin'\nWill you make it through the day? It's no tellin' (in this crazy world)\nYeah, yeah, yeah, (in this crazy world)\n\n[Outro]\nThat's what I said nigga, I said yeah\nWe can't even pay our bills around this motherfucker\nYou niggas stealin' and building condos and shit nigga\nYou know, damn, here goes another\nThey just built another one, nigga\nY'all don't see it, though I say it, for real dawg\nWe're still fucked up by this misconception nigga\nAin't nothin' movin' nigga, nothin'", "album": "The Recession", "year": "2008-09-02", "image": "https://images.genius.com/1b0e8d5c8ba78942c07465f1565ca9c0.1000x1000x1.jpg"}], "artist": "Jeezy"}