{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Chorus X4]\n(Metal axe)\n(I can chop into ya body)\nI swing it to the left, and I swing it to the right (chop)\n\n[Verse 1: R.A. The Rugged Man]\nNow bust it, I got a bloody axe, let's discuss it\nIt's bloody, my bloody axe is my best buddy\nI swing it to the left, and I swing it to the right (chop)\nOff goes ya head, now you still wanna fight?\nI'm the ruggedest, hit you with the raredest\nWhy you wanna diss? You might get the, uhh, uhh, fist\nTo the ribs, a poor eating bitch with the kids\nIt's the underground crust bound Crustified Dibbs\nTo the jaw, crack, Sugar Bob dig ‘em smack\nNow you know what's up black\nAnd why you gonna try to make me stress\nWhen you know I got the high blood pressure\nAnd I might make a mess of ya\nSticks and stones get the dick, I break bones\nMicrophones, my ass crack is hanging out like Larry Holmes\nI'm more crusty than Krusty the Clown\nAnd I can sing (mruh-haa) like James Brown\nSo don't, no, never try, never try to get (BLAOW!)\nWhat's my name? R to the A, (oh, that Rugged Guy)\nI like to battle with my raps (what if you lose?)\nThen I battle with my motherfuckin' bloody axe\n\n[Chorus X4]\n\n[Verse 2: R.A. The Rugged Man]\n[?] buck shots with ya gats, but I got a bloody axe\nTo the dome, now I remember\nA friend of mine said that I offend 'em\nI'm not ya average motherhumper but I never play pretend\nI got the crust, I bust dirty dishes\nDoctor give 'em stitches, I hit 'em gettin' puss from all ya bitches\nNot a wine-o, my white ass is white like an albino\nI'd beat down Luke Perry, if I ever went to 9-0\n2-1-0 no sucker poofs which give me ills\nWhen I hit Beverly Hills, ya mama's on my dills\nKnick-knocking boots with my balls and my dingeling\nI'm not Steven King, 'coz my axe does the murdering\nSo give me props, bitch, my testicles are bendable\nI'm so unforgettable\n(What happened to that A&R man that dissed? Arghhh) I had to snuff him\n(this tape sucks) Oh yo, you think I'm bluffing?\nI axe the blood clots, I influence the dots\nTiny Toons eating pork chops grabbing on their crotch\nSo watch, I'm the greatest, and that's just the facts\n(What if they don't believe?) I get my motherfuckin' bloody axe\n\n[Chorus X4]\n\n[Verse 3: R.A. The Rugged Man]\nNow one to the check it I wreck shop\nI never got dropped and I never got stopped\n[?] got a hunch, I'm down with the hookers and the stunts\nYou're whipping down my baby in about nine months\nI got no gat, but still don't mess around\n'Coz I got the devil's hound down in my dog pound\nI pop shit like the cesspool\nNumber two stool act a fool and an axe is my tool\n(Stick up punks) I'm breaking necks and backs\nI bring a bloody axe to the court when they make me pay my tax\nThey think I'm crazy, yo, I'm sending bodies to their graves\nI'm the proof to the theory that white men come from caves\n(Ahhööuh ahourrh blouwrfg) So fuck being civilized\nThat's what I realized (rap dies)\nYou can shut the fuck up, I put a booger in ya eye\nTake a shit on ya kitchen table, as I make ya kid's cry\nTake ya wife to the bedroom\nA boom-boom mami-mami grab a piece of this salami\nI like to battle with my raps (what if you lose?)\nThen I battle with my motherfuckin' bloody axe\n\n[Chorus: (repeat x4)]\n\n[Outro: R.A. The Rugged Man]\nYo, yo, yo, this R.A\nR.A. the Rugged Man, Crustified Dibbs, haha hrouh\nYo, my balls are bigger, don't fuck around, wauuh rlauughft\n(Metal axe)\n(Metal axe)\n(I can chop into ya body)", "title": "Bloody Axe", "image": "https://images.rapgenius.com/8d31e39a274146a0ec962bb21fee1b96.252x252x1.jpg"}]}