{"songs": [{"image": "https://images.genius.com/a9dab1316a072dc685292eb0051fe88a.500x500x1.jpg", "year": "2006-11-02", "title": "Head In The Clouds", "album": "The Complex Experiment: Vol. 1", "lyrics": "[Intro] [Seven talking]:\n1, 2, 3, 4 oh! I'm not even going to say it. For real there wasn't enough time right there. It's XV and Seven. You know X, he's the rapper. I'm the DJ. For real like, I'm not a DJ though I can't DJ. You know like, he's the cool one. I'm the nerd. Basement nerd. Make all these beats. Let's go, X\n\n[Verse One]:\nSitting in the booth, don't know what to write\nFirst line should it be about the hoes or the ice?\nInstead I stole a Nas line\nSo I'm focused, I write whatever comes to my mind aiight?\nNever forced to go and hustle\nNever really struggle\nAnd momma did what she could\nIt was just the allure of the life\nDrug deals, shaved dice, thug ills, late night\nUp in the hood\nAlthough I had dreams that I never told the team\nCause I knew it was something they never understood\nI wanted to rap so I did it in the back\nBut I never let 'em hear cause I wasn't that good\nAt times I just wanted to get away\nFrom all that I chase\nGrab a pen and just drift away\nSay things that I couldn't say\nStayed in the clouds\nI'll have frequent flier miles by the time I come down\nNow\n\n[Verse Two]:\nMomma used to say I had A.D.D\nSo I learned J.D.F. before my A.B.C.s\nI was no dummy but I fooled around like a clown\nWith that added you see my absence from that cap and that gown\nNow\nI'm 'bout to be\nFeeling like Charlie and The Chocolate Factory\nI don't wanna come down\nIf it's the gene's that I get from my pops\nThat dreams I'll probably seem that I'm headed for the clouds\nDo I give off, the fact I drift off, before I lift off?\nCause if it was all in my reach with one blink I would miss y'all\nRolled with niggas who kept them loaded automatics\nTucked in their khakis, no baddies, smoked fatties and used to Crip Walk\nPlaced a mansion picture on the ceiling of my room\nThat I will be building soon if this album really gets far\nAnd if nah, then I'm headed for the clouds\nDreaming till I choose to come down\nNow"}], "artist": "XV"}