{"songs": [{"image": "https://images.genius.com/d9f99535d86a21e5fdb2adb823702fb6.500x500x1.jpg", "title": "I Do This", "album": "Slauson Boy 2", "year": "2016-05-23", "lyrics": "[Intro: Sinister Pook]\nLongwinded, running through this life like it was mine\nNever settling, but setting every goal high\nOne thousand burpees on the path to my own destruction or success\nBut what is a mistake without the lesson?\nSee, the best teacher in life is your own experience\nNone of us know who we are until we fail\nThey say every man is defined by his reaction to any given situation\nWell who would you want to define you?\nSomeone else or yourself?\nWhatever you do, homie, give your heart to it\nAnd stay strong\n\n[Verse 1: Nipsey Hussle]\nLot of niggas fail, but I won't\nLot of niggas fold, but I cope\nLot of niggas gone, but I'm home\nLot of niggas off, but I'm on\nLot of niggas lost on this road\nCouple niggas gave up their goal\nGang of niggas traded their soul\nBut me, I'm standin' on ten toes\nLookin' out my Benz window\nWonder where'd my friends all go\nScared to give my heart to this girl\nParanoid she gon' leave if my ends get low\nNo one in this game to be played\nBut I'm knowin' that this game to be changed\nI should be afraid of afraid\nI'm just tryna live up to the meanin' of my name\nI'm just tryna live up to them niggas in my gang\nI'm just tryna live up to my moment on the stage\nI'm just tryna live up to the truth in my pain\nAnd the power that they gave me in the youth of today\nI put a coupe in the safe\nAnd I shoot from the waist\nMy time is money\nAnd I ain't got a second for you flukes and you fakes\n\n[Hook: Young Thug]\nI do this shit for my woes\nI do this shit for my niggas\nI do this shit for my bros\nI do this shit for my niggas, yeah\nI do this shit for my woes\nI do this shit for my niggas\nI do this shit for my bros\nI do this shit for my niggas, yeah\n\n[Verse 2: Mozzy]\nWe've been takin' trips more than often this month\nWhen I call they pullin' up, 2, 3 stream up\nYou ain't do enough for the clan, how I feel\nIf I gotta shut it down, how the film gon' feel?\n120 in the Euro, one hand on the wheel\nI was just broke, ran through a quarter mil'\nCan't believe I'm still here, shed tears for the dead\nCubes in my 30 chain, she don't even wear\nCall my little brother up, you know we took it there\nReal nigga tellin' on me, only thing that I fear\nYeah, only thing that I fear\nReal nigga tellin' on me, only thing that I fear\nLotta niggas squeal, lotta dope in the air\nLotta niggas squeal, lotta dope in the air\nStyrofoam contaminated, got a nigga meditatin'\nYeah, I said it got a nigga meditatin'\nI can't even eat 'less I'm medicated\nI can't even sleep 'less I'm medicated\nI've been on my feet chasin' check after check\nNigga, week after week, cause I'm dedicated\nI can't even eat 'less I'm medicated\nI can't even sleep 'less I'm medicated\nI've been on my feet chasin' check after check\nNigga, week after week, cause I'm dedicated\n\n[Hook: Young Thug]\nI do this shit for my woes\nI do this shit for my niggas\nI do this shit for my bros\nI do this shit for my niggas, yeah\n\n[Verse 3: Young Thug]\nThugger!\nI do this shit for my mothafuckin' niggas\nI'm gettin' this money, yeah\nI do this shit for them Benjis\nLike you ain't real or hood, no Tommy gun\nI do this shit for my niggas\nPull up with Barettas, nigga, and just go BRRRT\nI do this shit for them bad bitches\nWearin' red bottoms and Jimmy Choo\nI do this shit for my daughter\nI do this shit for my mama\nI do this shit for my son\nI do this shit for my brother\nI do this shit for the world\nI do this shit for the globe\nI do this shit right here, nigga\nAnd I do that shit, why y'all fuck with the boy\nI'm wet like a boat\nI'm lovin' my chickens\nI smoke and I choke\nI do it for my brothers\nI do it for my folk\nGot 40s on me, yeah, yeah, yeah\nNigga shoot from the toes\nAll the way up to the top\nAll the way up to the top"}], "artist": "Nipsey Hussle"}