{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/rapper-big-pooh-fat-boy-fresh-vol-3.jpg", "title": "Happy Birthday", "album": "Fat Boy Fresh Vol. 3: Happy Birthday Thomas", "lyrics": "See, you'll always be a part of me\nI'll be good for you, wait and see...\n\n[Verse 1: Rapper Big Pooh]\nMy mama told me Thomas you should keep fighting\nThe words that I heard is you should keep writing\nBlank stare out the window, watching a plastic bag go exactly as the wind blow\nSteady is the tempo, these people think it's simple waking up every morning trying to figure out where time go\nMy thoughts ain't clear, how am I wind up here?\nNow I'm drinking a beer, it's 10 o'clock in the a.m. me and my body swaying to the mayhem\nPeople like it ain't him, staring at me like they looking at an evil twin\nHalf grin the only thing that I could muster, knowing at that exact moment my life was really flustered\nMy house flooded, career studded, me and my baby got our backs to the wall like it ain't nothing\nActually I'm breaking down though, my life's soundtrack the beautiful sounds of a piano\nPlayed by a two year old, banging on the keys\nEvery night I'm on my knees asking God mercy please help me out\nI know he hear my please without a doubt (ha)\nNow it's time for me to get out, keep pushing\nNo cushion, hungrier than ever, I'm willing to grind forever\nFuck whether I'm the postman\nThe end of the night propose a toast fam\nTrying to fake it til you make it, you dont understand\n\n[Hook: Jared Evans]\nI was never happy, but if you're here with me then we could sing a song\nHow ill would that be? If we could celebrate forever til we're gone\nWhat lies around me, is everything I need so let the candles go\n(uh huh) happy birthday ya'll, happy birthday ya'll\n\n[Verse 2: Rapper Big Pooh]\nParked the car I burned out out of second gear\nEvery year, I'm talking bout it's my year\nOn that 12th now, working on the 5th year\nTrying to navigate the world, but its rocky here\nNo Adrians, No Apollo Creeds\nI flipping soil for my future seeds\nI'm tired of flipping soil and I don't own the deeds\nIf a snakes in your yard better cut the weeds\nPreoccupied with want;s, can't afford your needs\nAnd the teacher told me I wouldn't succeed (haha)\nCan you hear me now? Margie's middle child making mama really proud\nYou can finally smile, tomorrow means a brighter day\nHappy birthday ya'll, wipe your tears away\n\n[Hook]\n\n[Bridge]\nHappy birthday ya'll, Happy birthday-birthday, yeah (3x)"}], "artist": "Rapper Big Pooh"}