{"songs": [{"year": "2005-05-31", "album": "Late Registration", "image": "https://images.rapgenius.com/883da286b51872f03a50f38c466bb2ef.500x500x1.jpg", "title": "Diamonds from Sierra Leone", "lyrics": "[Produced by Kanye West, Devo Springsteen and Jon Brion]\n\n[Intro: Shirley Bassey]\nDiamonds are forever\nThey won't leave in the night\nI've no fear that they might\nDesert me\n\n[Hook: Shirley Bassey & Kanye West]\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme\nForever ever? Forever ever? Ever, ever? Ever, ever?\nEver, ever? Ever, ever? Ever, ever?\n\n[Verse 1: Kanye West]\nClose your eyes and imagine, feel the magic\nVegas on acid, seen through Yves St. Laurent glasses\nAnd I've realized that I've arrived\n'Cause it take more than a magazine to kill my Vibe\nDoes he write his own rhymes? Well, sort of, I think 'em\nThat mean I forgot better shit than you ever thought of\nDamn, is he really that caught up?\nI ask, if you talkin' about classics, do my name get brought up?\nI remember I couldn't afford a Ford Escort\nOr even a four-track recorder\nSo it's only right that I let the top drop on a drop-top Porsche\nSpoil yourself, that's important\nIf your stripper name \"Porsche\" and you get tips from many men\nThen your fat friend, her nickname is \"Minivan\"\nExcuse me, that's just the Henny, man\nI smoke, I drink, I'm supposed to stop, I can't, because—\n\n[Hook: Shirley Bassey & Kanye West]\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme\nForever ever? Forever ever? Ever, ever? Ever, ever?\nEver, ever? Ever, ever? Ever, ever?\n\n[Verse 2: Kanye West]\nI was sick about awards, couldn't nobody cure me\nOnly playa that got robbed but kept all his jewelry\nAlicia Keys tried to talk some sense in him\nThirty minutes later seein' there's no convincin' him\nWhat more could you ask for? The international asshole\nWho complain about what he is owed?\nAnd throw a tantrum like he is three years old\nYou gotta love it though: somebody still speaks from his soul\nAnd wouldn't change by the change or the game or the fame\nWhen he came in the game, he made his own lane\nNow all I need is y'all to pronounce my name\nIt's Kanye, but some of my plaques, they still say Kayne\nGot family in the D, Kin-folk from Motown\nBack in the Chi, them Folks ain't from Moe Town\nLife movin' too fast, I need to slow down\nGirl ain't give me no ass, you need to go down\nMy father been said I need Jesus\nSo he took me to church and let the water wash over my caesar\nThe preacher said we need leaders\nRight then my body got still like a paraplegic\nYou know who you call; you got a message, then leave it\nThe Roc stand tall and you would never believe it\nTake your diamonds and throw 'em up like you bulimic\nYeah, the beat cold, but the flow is anemic\nAfter debris settles and the dust get swept off\nBig K pick up where young Hov left off\nRight when magazines wrote Kanye West off\nI dropped my new shit, it sound like the best of\nA&R's lookin' like, \"Pssh, we messed up.\"\nGrammy night, damn right, we got dressed up\nBottle after bottle 'til we got messed up\nIn the studio, with Really Doe, yeah, he next up\nPeople askin' me if I'm gon' give my chain back\nThat'll be the same day I give the game back\nYou know the next question, dog: \"Yo, where Dame at?\"\nThis track the Indian dance to bring our reign back\n\"What's up with you and Jay, man? Are y'all okay, man?\"\nThey pray for the death of our dynasty like \"Amen\"\nR-r-r-r-right here stands a man\nWith the power to make a diamond with his bare hands\n\n[Hook: Shirley Bassey & Kanye West]\nDiamonds are forever (forever, forever)\nThrow your diamonds in the sky if you feel the vibe\nDiamonds are forever (forever, forever, forever)\nThe Roc is still alive every time I rhyme\nForever ever? Forever ever? Ever, ever? Ever, ever?\nEver, ever? Ever, ever? Ever, ever?\n\n[Outro: Shirley Bassey]\nDiamonds are forever (forever, forever)\nDiamonds are forever (forever, forever, forever)"}], "artist": "Kanye West"}