{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "It's new, it's out of the ordinary\nIt's rather extrordinary\nSo yo bust this commentary\nA literary, genius, and a superior beat creator\nHave come together, and we made a\nMusical composition which we think is a remedy\nTo cure all the dance floors that's empty\nYou wanna dance? We got what you want\nJazzy Jeff and Fresh Prince bustin out with the brand new funk\nGet down brand new funk-hit it\nIt was kind of an accident, the way that it happened\nOne day I was rappin, and on the beat, Jeff was backin me up\nAnd all of a sudden, he brought in a cut And I dropped my microphone and said\n\"What the ? Hold up, Jeff, wait a minute, play it\"\nHe just smiled and said, \"Yeah def ain't it?\"\nIt was {funky} it made wanna {get, get down!} And we knew almost at once it was\nThe {brand new funk}\nSo we continued to listen to it\nAnd we knew it was def when I started rappin to it\nSo I gave a hi-five to Jeff and without hesitation popped in my cassette\nI took it home that night, and analyzed it\nRewound the tape over and over, and memorized it\nThat Friday, we went to the club And out and out cold tore it up\nYou shoulda seen the people dancin and shakin and movin and jumpin and spinnin\nAnd clappin, while the beatboxin was groovin and screamin and yellin while on\nThe microphone I was flowin\nFresh rhymes I was showin, the people say, \"Yo keep goin\" So I continued to\nRock, while Jeff was on the beatbox Special assistance from my homeboy Ready\nRock\nPeople barged just to get up front to get a bird's eye view of what we call the\nBrand new funk\nGe-Ge-Get down-hit it\nYo Jeff! {Rock the beat} Yo Jeff! {Rock the beat} Yo Jeff! {Rock the beat} *\nJazzy Jeff cuts and scratches * Yo Jeff! {Rock the beat} Yo Jeff! {Rock the\nBeat} Yo Jeff! {Rock the beat with your hands }\nJazzy Jeff cuts and scratches * Now get funky with the beat\nJeff starts spinning backwards * Now turn it all around\nThe most original, amazing, astounding, miraculous remarkable, startling\nSensational, stupendous music\nThat has ever been created is ours - but believe me it was complicated\nBut we have done it, so now we can breathe a long awaited sigh of relief\nThis isn't a publicity stunt It's the raw untouched, pure, hard brand new funk\n{Rock the beat} {Rock the beat} {Rock the beat} {Rock the beat} {Rock the beat}\n{Rock the beat} * Jazzy Jeff cuts and scratches * {Rock the beat with your\nHands } {Rock the beat} {Rock the beat} {Rock the beat} {Rock the beat} {Rock\nThe beat} {Rock the beat} * Jazzy Jeff cuts and scratches * {Rock the beat with\nYour hands }", "image": "https://images.genius.com/8624e4a6fdfb9b83008647b72d71bbee.371x371x1.jpg", "album": null, "title": "Brand New Funk"}]}