{"artist": "Plies", "songs": [{"album": "36 Ounces (A Whole Brick)", "title": "Confessions", "image": "https://images.genius.com/c517916bca78940ba7d0e0bce6685156.577x577x1.jpg", "lyrics": "[Intro: Plies]\nOkay, then\nThis Plies, the new nigga over here at Slip-n-Slide Records\nI don't even make that kind of music, homeboy\nI’ve got something I want to share with you old police ass niggas\nGo ahead and run it, dog\n\n[Chorus: Plies & Usher (Sampled)]\nYou police ass niggas know you full of (confessions)\nAnd just when I thought loyalty meant something to you niggas\nThat's when I found out it don't mean shit to you niggas (confessions)\n’Cause I done seen the realest niggas under pressure fold\nAnd run and tell them crackers everything they know (confessions)\nAnd when you pussy niggas tell it, y'all (tell it all)\nAnd how can y'all niggas live with snitching on your dog?\nThat's why I don't fuck with y'all pussy ass niggas at all\nI've be done whacked one of you fuck niggas since you full of (confessions)\n\n[Verse 1: Plies]\nIt ain't no secret, nigga, my freedom mean the world to me\nBut dying a real nigga mean a little more to me\nThat’s why I don’t fuck with y'all niggas ’cause we ain't built the same\n'Cause the fear of going to prison'll make you niggas sing\nIf I ever tell on one of my dogs, I want a bitch to kill me\n’Cause if I ever turn that flaw, a bitch need to kill me\nWhen them crackers sentence you, nigga, they gave you 35\nAnd you told on your dogs, they knock off five\nNow you got 30 left, pussy nigga, that's still alive\nAfter you niggas tell on your dog, how you niggas sleep\nWhen you done violated the main code of the street?\n\n[Chorus: Plies & Usher (Sampled)]\n(Confessions)\nAnd just when I thought loyalty meant something to you niggas\nThat's when I found out it don't mean shit to you niggas (confessions)\n'Cause I done seen the realest niggas under pressure fold\nAnd run and tell them crackers everything they know (confessions)\nAnd when you pussy niggas tell it, y'all (tell it all)\nAnd how can y'all niggas live with snitching on your dog?\nThat's why I don't fuck with y'all pussy ass niggas at all\nI've be done whacked one of you fuck niggas since you full of (confessions)\n\n[Verse 2: Plies]\nAnd I don't believe in that bullshit 'bout pressure bust a pipe\nIt ain't pressure, it's fuck niggas would bust a pipe\nWhen God made niggas, he forgot to give them loyalty\n'Cause a nigga ain't loyal to himself and these crackers know it\nThat's why these crackers went and put conspiracy in the game\nThey know if they get two of you fuck niggas, one of y'all all gon' sing\nHow the last five indictments, ain't none of 'em went to trial?\n'Cause these pussy niggas telling 'fore they even get downtown\nThese crackers send you niggas to prison without even spending money\nI'm going to trial, cracker, you at least gon' spend your money on me\nA nigga told me he snitched so he can get home to his kids\nBut when you was out, nigga, you ain't do shit for your kids\n'Cause you on 24's? Nigga, that don't impress me\nI know some niggas on 24's, that's the police\nThe nigga that took his bid, they didn't tell on his dog, that's what impressed me\nSo the next time he call you from prison, tell him Plies said\n\n[Chorus: Plies & Usher (Sampled)]\nYou police ass niggas know you full of (confessions)\nAnd just when I thought loyalty meant something to you niggas\nThat's when I found out it don't mean shit to you niggas (confessions)\n'Cause I done seen the realest niggas under pressure fold\nAnd run and tell them crackers everything they know (confessions)\nAnd when you pussy niggas tell it, y'all (tell it all)\nAnd how can y'all niggas live with snitching on your dog?\nThat's why I don't fuck with y'all pussy ass niggas at all\nI've be done whacked one of you fuck niggas since you full of (confessions)\n\n[Interlude: Plies]\nAnd there ain't no need for you looking out the window, homeboy\nOr looking off like I ain't talking to you\nIf you done snitched on a nigga, boy, I hope it hit you right in your heart, my nigga\nHow these crackers got y'all niggas telling on niggas that y'all done grew up with from the dirt?\nNiggas y'all done shot and mobbing with?\nNigga, you knew you couldn't do no motherfucking time\nWhat the fuck you got in the game for?\nI don't understand you niggas out here\nAnd for the niggas out here in the streets that call yourselves thugging:\nHow y'all ain't murking none of these fuck niggas that done did your homeboys and then told on your people?\nWhat's up, man, the streets done got soft?\nMan, this Plies, my nigga\nThe new nigga over here at Slip-N-Slide Records\nAnd I'm dropping classics on other niggas' shit\nY'all better fuck with a nigga, boy\n\n[Chorus: Plies & Usher (Sampled)]\n(Confessions)\nAnd just when I thought loyalty meant something to you niggas\nThat's when I found out it don't mean shit to you niggas (confessions)\n'Cause I done seen the realest niggas under pressure fold\nAnd run and tell them crackers everything they know (confessions)\nAnd when you pussy niggas tell it, y'all (tell it all)\nAnd how can y'all niggas live with snitching on your dog?\nThat's why I don't fuck with y'all pussy ass niggas at all\nI've be done whacked one of you fuck niggas since you full of (confessions, confessions, confessions, confessions)", "year": null}]}