{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f1ce17fdad92806e2e9b19241838f42f.1000x1000x1.jpg", "title": "Don’t Die", "year": null, "album": "R.A.P. Music", "lyrics": "[Sample: Dick Gregory]\nHow come...with the thousands of black cops in America...you ain't never picked up the paper, turned on the TV, or the news...and seen white folk crying...because this black cop...shot my loved one in the back of the head...cause he thought the cellphone was a gun. How come you don't see that?...You think black cops is...more spiritual? You think better qualified? Nah...They got enough sense to know that white folks ain't going to tolerate it...And the only reason they do to us what they do cause you tolerate it. Ok, I'm not telling you don't chastise these young men! But I ain't see you chastise the police!!\n\n[Intro]\nHahahaha Real bad guy shit\nHahaha Living like a villain\nNever chilling heavy influence on your chillun\nYeah!\n\n[Verse 1]\nI woke up this morning to a cop with a gun\nWho told me that he looking for a nigga on the run\nI thought for a second and I screwed my face\nAnd asked them dirty pigs, “Why the fuck you in my place?”\nHe said “Chill or we kill, this is a warning”\nThen I told him “Fuck you, where is the warrant?”\nThen they got to punching and kicking and macing\nThen the whole situation went Larry Davis\nThinking ’bout my lady and thinking ’bout my baby\nThinking, “Is these motherfucking pigs going crazy”\nThey wanna kill a nigga ’cause a nigga on his rap shit\nWanna leave me dead on a mattress, Hampton\nI’m a Public Enemy because I’m Cold Lampin’\nAnd I don’t give a fuck about a party in the Hamptons\nAnd I don’t give a fuck about a motherfuckin' Forbes list\nFar as I’m concerned, that’s a motherfuckin' whores list\n\n[Bridge]\nMotherfucker, my dad was a cop\nYou don’t think I know a dirty ass cop when I see one?\nShake down, take down, disrespecting-the-badge-ass-bitch!\n\n[Verse 2]\nBack to the scene going wild in the bedroom\nGrab the cop’s gun left from leaking with a head wound\nSecond cop shot, but the bullet hit his partner\nShot him in the leg and he hit a main arter\nNow the dirty cop’s looking at me\nTalking ’bout he kill a nigga if I try to flee\nShit, I’m about to lose it, so he gon’ have to prove it\nAll because the government hate rap music\nI’ve been labeled outlaw, renegade, villain\nSo was Martin King, so the system had to kill him\nA nigga with an attitude, the world gotta feel him\nEducated villain, Intent on living\nIf I gotta kill a cop just to get out the building\nThat motherfucker gettin' left dead no feelings\nYelling “Fuck him” as I buck A 45 at his fillings\nTrying to knock his brains through the motherfucking ceiling\n\n[Verse 3]\nWhen I surface on the streets I can hear the crowd yelling\nAnd see the neighborhood snitches pointing and telling\nI’m bailing like a felon or Assata Shakur\nBefore the law leave me stinking like a bag of manure\nLike Jeriko One in the movie ‘Strange Days’\nThey want a nigga dead ’cause the things that I say\nMight make the youth go and pick up an AK\nTell the government “Fuck you, no way”\nLike John Connor mama I be running everyday\n‘Cause if I get caught it’s my life they terminate\nOr stick me in a cell on Guantanamo Bay\nAll because a nigga won't submit and obey\nI’ll be an outlaw before I ever behave\nAnd die a free man before I live like a slave\nNothing changes, if they catch me today\n“Fuck the police” is still all I gotta say"}]}