{"songs": [{"year": null, "title": "Get Busy", "image": "https://s3.amazonaws.com/rapgenius/1374583262_saigon.jpg", "lyrics": "[Intro: Saigon]\nLet's take 'em back\nNow, now's the time\nThat you make yo' way to the floor\nYou know what it's hittin for\nGo Saigon (uhh) get busy (get busy)\nYardfather (yeah!) Get busy (uhh)\nGo Giddy, get busy (get busy)\nGet, yeah, get busy, ohh!\n\n[Saigon]\nI used to walk uptown to see Mario\nThat nigga sold more blow than the young Harry O\nFrom Punta Cana to Ghana to Ontario\nHe made it snow all over the whole barrio\nHis lil' brother Luigi, he was a real nigga\nHe took mushrooms, they used to make him feel bigger\nHis job was to pick up the shit like a pooper scooper\nAnd drop it off without gettin caught by the Koopa Troopa\nOne day they hit Mario on the jack\nTold him they had his bitch, want a hundred stacks to get her back\nHe thinkin \"What kind of shit is that?\nThis ain't a video game, lame, we finna go tit for tat\"\nHe lit his cigarette, took a drag of the cancer smoke\nAnd with this hit, he burnt a hole in the ransom note\nThen he wrote with ease and I quote\n\"Y'all must really want one of these in your throat\"\nHe said, \"Let my bitch go this evenin\nOr somebody won't be breathin!\nCause I'mma call Lizzy, and Lizzy'll call Giddy\nAnd uh, and Giddy gon' get busy!\"\n\n[Hook: repeat 2X]\nGo Saigon, get busy {\"Get busy!\"}\nYardfather, get busy {\"Get busy!\"}\nGo Giddy, get busy\nGet, get, get busy {\"Get busy!\"}\n\n[Saigon]\nI Get Busy like I'm muh'fuckin Sean Paul\nAnd damn right your boy's in it for the long haul\nSome niggas said, \"Saigon, you a cornball\"\nI spit a fireball, now his face upon the wall\nLord, have mercy on my foes\nCause I could get these niggas killed with my eyes closed\nGod knows I'm a gangsta to the core\nI'm very familiar, I'm not a stranger to the war\nAnd I maneuver through the sewer like human manure\nI'm like hard liquor my nigga, you a Kahlua\nI do a old school dance like the Roger Rabbit\nSoon as I hear this beat, it's like it's automatic\nUh, I get busy\nSpin around 'til a nigga get dizzy (dizzy)\nYeah, it's Giddy\nCanei, they can't deny I gets busy (gets busy)\n\n[Hook: repeat 2X]\nGo Saigon, get busy {\"Get busy!\"}\nYardfather, get busy {\"Get busy!\"}\nGo Giddy, get busy\nGet, get, get busy {\"Get busy!\"}\n\n[Saigon]\nI get up, go to the bathroom, move my bowels\nHop up out of the shower and use the towel\nPicture me not havin no new apparel\nThat's like spellin a word not usin a vowel\nThis game ain't easy, shit is a hurdle\nThey say to win I gotta get rid of the turtle\nTo show the world that I'm so sick with the verbals\nNow watch out for the bloggers, them niggas'll merk you\nAttention all haters, get off your boy dick\nTell your bitch to come here, she can play with my joystick\nUp up down down left right left right\nB, A, B, A, Start; now tear it apart (yeah!)\nBut that's a whole 'nother game so when I'm done with your dame\nI just jump in my kart and disappear in the dark\nDid I say kart? Oops, I meant Range Rover\nMatter fact, game over!", "album": null}], "artist": "Saigon"}