{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Like a Dream", "album": "Weekend Warrior", "lyrics": "[Chorus: Lil' Kal + possibly others]\nIt's like a dream, you can say what you wanna say about me\nBut at the end of the day I'll be countin my mo-ney\nIt's like a dream - yeah, it's like a dream - yeah\nCause at the end of the day I'll be countin my mo-ney\n\n[Verse One: Biz Markie]\nIt's the M-zah, A-ah, R-zah, K-ah\nLike the internet, I am here to stay-ah\nBeen a long time, I know it's been years\nOops! I did it again, like Britney Spears\nLike The Matrix and Keanu Reeves\nRinged around the collar and doo doo on the sleeves\nI'm explosive like dynamite\nI should be on \"Entertainment Tonight\"\nOr \"Access Hollywood\" or \"Soul Train\"\nI'm so on fire, I fart propane\nDon't use Rogaine, got a head full of hair\nCause the brother on the mic is so debonnaire\nI'm so cool, the Fonz say \"EYY!\"\nCause I'm the best MC from around my way\nNever listen to what haters say\nI just stay focused like Kobe in L.A\n\n[Chorus]\n\n[Verse Two: Biz Markie]\nI'mma do it like I never have done it\nNever got drunk and never got blunted\nThe Redox in my ear, they cost about a hundred\nIf the record's a hit, you know the Biz spun it\nSuper educated master rap techniquer\nIll funk freaker every day of the week-ah\nWhether it's Kim, Agnes, Monique or Tamika\nMy unique physique make 'em all weaker and weaker\nCause I'm hung, like Mighty Joe Young\nThey all get sprung, from the joy that I brung\nI drive a Hummer, I'm hot like Donna Summers\nI'm one of the first human (rum-a-pum pummers)\nNo matter what they say, I always sound flyer\nThan anyone you heard, or even de-sired\nYes it's me, I'm the Original B-I-Z\nM-A-R-K-I with the E\n\n[Chorus]\n\n[Verse Three: Biz Markie]\nThe beat don't stop 'til everybody's gone\nI'm old school like a bag of Bon Ton\nLike the Mary Jane Girls I go \"All Night Long\"\nHit you in the head like El Kabong\nMy style is masculine, far from feminine\nI got soul like James Brown and Rakim and 'em\nI don't know what you came to do\nI came to rock the house for you\nFrom sunny California to Kalamazoo!\nBeen rockin parties since ninety-two\nI know you heard that Reality Bites\nBut I'm liver than the show called \"Saturday Night\"\nI stay on, it looks like city lights\nChicks cling on me like ballerina tights\nLike Minute Mouse and Courageous Cat\nYou can't beat that with a baseball bat!\n\n[Chorus]"}], "artist": "Biz Markie"}