{"songs": [{"year": null, "album": "Kelis Was Here", "image": "https://images.genius.com/0f2642afea8e846ffcb0697ad3483a5e.640x640x1.jpg", "title": "Circus", "lyrics": "Come join our circus where we all wear masks\nLying while our fans are expected to last\nCould it be that the jig is on us?\nMasquerading like we are the one\nCan you blame us?\nIt started as fun\nDidn't know that the game must be won...\nSorry\n\nNever did I lie; never did I need a trick yall\nBut they told me this how they get rich yall\nMake a hit song, same lame lyrics, same bass, same kickdrum\nBuy the record you became a big big victim\nBitch can't front, get what I want, neck, hands and my wrist numb\nSick none, diamonds on my wristband\nWho I'm talking to? You, you and my biggest fan\nThinking that ya girl got it all, and I got the best man, best hair, best legs\nNeed a break, you in my face, asking K, what I'm putting out next year\nIs it gonna be real freaky, critics wanna come critique me\nAre you gonna be more grunge, rock and roll like back when you dropped before\nBut get back, before I get ill\nBlack love, black mask, listen to some real black love\nThat's all I have, that's all I have\n\nCome join our circus where we all wear masks\nLying while our fans are expected to last\nCould it be that the jig is on us?\nMasquerading like we are the one\nCan you blame us?\nIt started as fun\nDidn't know that the game must be won...\nSorry\n\nMusicians, magicians, tightropes, strobe lights, lion tamers, entertainers, Sold Out Nights\nDressing rooms, costumes, who's doing who? Gossip rumors\nGroupies just too much, everybody's like let's do lunch\nThat's why it doesn't matter\nThat's why I'm not a rapper\nStill spit a few bars, might never hear this song\nLabel might say hell naw, get a new female star\nShe don't have to sing, she don't have to bring anything\nGet her some new earrings, fly her off to Beijing\nBook her shows in Wyoming, David Letterman and Conan\nYour advance just alone and doesn't it all sound grand?\nNumber one on soundscan, just keep the clubs bouncing\n\nCome join our circus where we all wear masks\nLying while our fans are expected to last\nCould it be that the jig is on us?\nMasquerading like we are the one\nCan you blame us?\nIt started as fun\nDidn't know that the game must be won...\nSorry\n\nHow can I shake this circus clown?\nWhat does the ringmaster need from this clown?\nShould I dive through the circle of fire?\nNo... I'm just gonna be me\n\nCome join our circus where we all wear masks\nLying while our fans are expected to last\nCould it be that the jig is on us?\nMasquerading like we are the one\nCan you blame us?\nIt started as fun\nDidn't know that the game must be won...\nSorry"}], "artist": "Kelis"}