{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Bad Night (Capri Sun / Man Up)", "lyrics": "[Intro: Kanye West]\nWoo, woo\n\n[Chorus: Kanye West]\nSomebody\nGotta be the bad guy\nI had a bad day at work\nDon't wanna have a bad night, ayy\n\n[Verse 1: Kanye West]\nWoo! Toppin' on like I'm Nina\nWoo! Toppin' on, you gon' need one\nWoo! If I say somethin' indecent\nWoo! She gon' suck me off like a Capri-Sun\nHaan? Fuck is you talkin' 'bout, bitch, you offended me\nCheckin' 'em off when you niggas is into me\n'Fore I go turn it out, I bet I can, ah\nJumpin' up off, you better get out\nDoin' for something on that thing\nThough I'm not in my feelings, man up\n\n[Chorus: Kanye West & Young Thug]\nSomebody\nGotta be the bad guy (hey)\nI had a bad day at work (yeah, yeah)\nDon't wanna have a bad night\n\n[Refrain: Young Thug & Kanye West]\nI ain't new to this shit, fuck-nigga\nI'm trappin' from the other side\nSo get outta your seat, stand up (woo)\nStand up\nA fuck-nigga hate me while his old lady participate\nPlease tell that lil' nigga man up (lil' nigga, stand up, woo)\nStand up (lil' nigga, stand up)\nStand up (hey, hey)\nHey, hey, stand up, stand up, stand up\n\n[Verse 2: Young Thug]\nFirst of all, let me tell you somethin' (what?)\nI don't give no fuck 'bout no niggas (woo)\nI don't give no fuck, I'm not givin' two fucks (woah)\nRoll up and pop one of these niggas (blat)\nI do this shit for my woadies (woo)\nYou do this shit for your shorty, you bitch\nShut the fuck nigga, fresh out of the bottle\nThe hood be callin', sell the plug\nI'ma wipe a nigga nose, shatter like a picture\nI'ma fuck his ho like these bitches up on this missile\nI'ma keep a whole lotta lead for these pistols (what?)\nAnd my money long like the nose on a prince\nBut she gon' fuck, she write, no pen\nBut you know I'm gon' suspend her\n\n[Refrain: Young Thug]\nI ain't new to this shit, fuck-nigga\nI'm trappin' from the other side\nSo get outta your seat, stand up\nStand up\nA fuck-nigga hate me while his old lady participate\nPlease tell that lil' nigga man up (lil' nigga, stand up, woo)\nStand up (lil' nigga, stand up)\nStand up (hey, hey)\nHey, hey, stand up, stand up, stand up\n\n[Chorus: Kanye West]\nSomebody\nGotta be the bad guy\nI had a bad day at work\nDon't wanna have a bad night, ayy\n\n[Verse 3: Kanye West]\nI might have to jump from the three-point line, uh\nI can see you down up, ah, she straight lyin', uh\nShe might dumb it down up, but I know she nine\nThrow it back up on it when I know she got it, uh, sheesh\nCan't be my baby with no maybes\nCan't roll it down up with my lady\nYou know that all these niggas still crazy\nBeen two months since I talked to Jay-Z"}], "artist": "Kanye West"}