{"songs": [{"image": "https://images.genius.com/37d30cd61cc10b6c59d5e0defc23e542.500x500x1.jpg", "album": "Detroit State of Mind 4", "title": "Contra (Detroit State Of Mind 4 Version)", "lyrics": "[Sample]\n\"Now I know what I'm gonna do, I said I know\"\n\n[Verse 1]\nFrom the hood where them niggas pack fullys\nTurn an ounce of reg to a cutty\nCount money with a 10 deep flannel on\nSB's looking like they been painted on\nJeans fitting like they was made for me\nYour pants looking like, they was hand-me-downs from your Daddy\nGet at me, my fit worth a stacky\nI'm in a Caddy getting head in the back seat\nRubbing on her yakki\nThen it start raining, when I start cumming\nSo now I'm brainstorming, on how I'm gon' run it\nAnd y'all like fags – pussy? You don't want it\nGosh darn it, got heat like furnace\nAnd I raise it like thermostat\nRolling that Thundercat kush look like Panthro\nHeard you grab your ankles, take it in your manhole\nThat's so disgusting, I think I just threw up in my mouth\nCan somebody pass me a towel?\nA wetnap or something? Nigga is you fronting?\nI beat you in your face, now your head like a pumpkin\nJack-o-Lantern, I'm Danny Tanner\nWatching that white girl, you a dry jheri curl\nYou worthless piece of shit\nYour baby mama begged me to suck my dick\nAnd I ain't gon' let her, she look like Predator\nYou a gay boy like David Archuleta\nContra, where niggas pierce armor\nIt's two niggas, two guns, blowing out your conscience\nYou see them chrome 44's, in this bitch with thirty men\nY'all niggas know the code like..\n\n[Verse 2]\nFeel like I got a code in like I got 50 lives\nKnow they wanna see the Hybrid die\nBut my eyes never close to meet death's cousin\nI ain't never slipping, even when I'm buzzing\nStaying on my guard like a boxer on a rope\nYou get fucked quick tryna play me like a ho\nDon't act like you ain't know that, I flash it like Kodak\nNow your pics is on obituary\nYou a fairy that touch nigga's nuts\nThink he's been sniffing his own pixie dust\nI think Biggie said that was rule #5\nNever get high on your own supply\nBut he ain't never listened to Ready to Die\nOr Life After Death, now he sharing living space\nTell Big we love his soul\nBut right now Danny Brown \"Unbelievable\"", "year": "2010-03-08"}], "artist": "Danny Brown"}