{"songs": [{"year": "2011-10-14", "image": "https://images.genius.com/51e08c065f8aa5228164bdf2fb4e6955.1000x1000x1.jpg", "title": "Bad Girl", "album": "Bossaura", "lyrics": "[Intro]\nWir machen Sex auf dem Segelschiff\nWachen auf im Penthouse mit Meeresblick, Malibu Beach\nLieferservice auf die Honeymoon-Suite\nPlatin-Card, wir kaufen ein in der Armani-Boutique\nEr lädt dich zum Dinner bei Mäcces ein\nMuss bei dir noch Cash für das Essen leih'n\nBroke wie ein Motherfucker\nBaby, hol dir ein' ander'n Lover\nYeah, yeah, yeah, hör zu, Girl\n\n[Part 1]\nGuck mich an, Baby, Traum-Body, Beamer vor der Tür\nGuck ihn an, Baby, Lauch-Body, Fiat vor der Tür\nGuck dich an, Baby, du bist zu nice für ihn\nLass den Loser allein, du bist zu heiß für ihn\nIch schenk' dir Schuhe, (Er) er kann dir nich' ma' Schnürsenkel kaufen\nIch schenk' dir Häuser, (Er) er kann dir nich' ma' Türhenkel kaufen\nUnd du sagst, er is' gut im Bett? Okay, eine Frage (Girl)\nWarum hast du dann vier Mal im Monat deine Tage? (Haha)\nShawty, wem willst du was vorspiel'n?\nEr hat nichts drauf, bei mir kommst du schon beim Vorspiel\nBei ihm liegst du da wie'n Brett, bei mir wirst du zur Porn-Queen\nAlso schieß ihn ab, den Versager\nUnd vergiss, was deine Freundinnen mein'\nJa, er is' nett, aber nett is' whack, Baby, lass dein' Boyfriend allein\nSei ein Bad Girl, steig in den Neuwagen ein\nIch zeig' dir äußerst bescheiden meinen Koi-Karpfenteich\n\n[Hook]\nImage und Fame, Cristal-Champagne\nIch komm' mit American Express zum ersten Date\nMillions und Brands, Insider-Trends\nSteig in den Jet nach Miami, dein Outfit is' sexy\nWas kauft er dir? Nich' mal ein' Schnürsenkel\nWas kauft er dir? Nich' mal ein' Türhenkel\nWie besorgt er's dir? Du bleibst nich' wach bei ihm\nKomm vorbei, denn ich besorg's dir wie ein Rugby-Team, yeah\n\n[Part 2]\nGuck mich an, Baby, Pelzmäntel, Sportcoupés, yeah\nGuck ihn an, Baby, Geldmenge? Portemonnaie leer\nGuck dich an, Baby, du hast was Besseres verdient\nSag Bye Bye zu ihm, flieg mit mir im Jetlag nach Paris\nDann nach Malibu Beach, Sex in Honeymoon-Suites\nAm nächsten Tag shoppen, Armani-Boutiques\nMeine Crew will dich im Team, Girl\nWir tauschen deine zu billigen T-Shirts gegen True Religion-Jeans, Girl\nUnd du bist fresh, Louis-Hat, Gucci-Dress\nWenn du mit mir chillst, drück' ich am Telefon die Groupies weg\nWir machen Love während die Wellen toben\nSitzen auf schnellen Booten wie 'ne Uniform von UPS\nVor der Küste von Malaysia\nIch geb's ihr, bis der Captain schreit: \"Seid ma' leise, ja?\"\nShawty, mach dein' Drecks-Freund zum Ex-Freund\nSteig in den Black Royce, ride mit dem Bad Boy\n\n[Hook]\nImage und Fame, Cristal-Champagne\nIch komm' mit American Express zum ersten Date\nMillions und Brands, Insider-Trends\nSteig in den Jet nach Miami, dein Outfit is' sexy\nWas kauft er dir? Nich' mal ein' Schnürsenkel\nWas kauft er dir? Nich' mal ein' Türhenkel\nWie besorgt er's dir? Du bleibst nich' wach bei ihm\nKomm vorbei, denn ich besorg's dir wie ein Rugby-Team, yeah\n\n[Outro]\nUnd wenn deine Freundinnen lästern:\n\"Schau dir den doch an\nDer is' zu heiß, um einem Mädchen treu zu sein, Schwester!\"\nDann hör nich' auf sie\nIch zeig' dir die Welt, Baby\nIch hab' Geld, Baby!\nVergiss den Loser\nUnd keine Angst, ich bin kein Gee, ich bin ein seriöser Businessman!"}], "artist": "Kollegah"}