{"artist": "Vast Aire", "songs": [{"title": "Dark Metropolis", "year": "2017-10-01", "lyrics": "[Intro]\nClearly we are cut from a different cloth.... divine garments!\n\n[Verse 1]\nMy favorite element is the wind\nI don't like to brag about slaying the red dragon\nThe missing tile in the skin was unraveling\nHe inhaled then I chucked the javelin\nMy close friends call me Mister Miracle\nCause' I’m the first to escape the dark side of the physical\nPrison, this is the birth of the New Gods\nYou could call us the Crimson\nYou don't want me to concentrate\nCause' you know I got that juice that a make a planet gravitate\nHere's one to investigate\nHow do I use aerosol cans to make myself levitate\nThat's my secret identity\nMy brother is eternity and my sister is infinity\nSo that means you ain't seeing me\nAnd I just sent my knights out to clear out the whole galaxy\n\n[Chorus x2]\nFrom the New Genesis to the apocalypse (pump ya fist)\n(Where we at?) The dark metropolis!\n\n[Verse 2]\nThe Blackman is God is an understatement\nI’m a titan filled with the Holy Ghost when I’m writing\nI’m the wisdom of Solomon and Sheba\nI’m the green giant that builds with the Keebler\nWe can soar to the highest aethers\nWhere Jah will meet ya' and you ain't even have to light the reefer\nSo where we going, heaven or neither?\nI guess we'll find out when we flatline with Kiefer\nI’m surrounded by lost toys\nI know I can't see your reflection you're probably a lost boy\nBlood suckers of the poor lead 'em to hell's door\nAnd the Babylonian whore right there on the floor\nDon't make me come after ya'\nCause' I'll put your face on the grill and lean on the spatula\nIGC is spectacular\nI’m not afraid of Medusa, I just winked back at her\n\n[Chorus x2]\n\n[Verse 3]\nWhen I was born my mother had a joyful pain\nAs she said my name I took seven steps and proclaimed\nThe body's the earth the soul is the flame\nAnd the mind is a watery hurricane\nWe in the phantom zone\nAn intedimensional vortex where I spit my poems\nSome of you dudes are drones\nI feel like The Last Starfighter in Attack of the Clones\nAnd I’m ah' let it be known\nThe original man is older than any dinosaur bone\nAnd you're about to get thrown\nI fight like Nubian Moors that pushed back Rome\nI’m at ease with it, I breathe with it\nI’m the true and living God I don't need 'whip-its'\nHere's what you do to achieve it\nYou get yourself a mothership and put the key in it...", "album": "Aireplane", "image": "https://images.genius.com/cda1dc5e94558c12ffcdaf865d093862.720x720x1.jpg"}]}