{"songs": [{"year": null, "image": "https://images.genius.com/94781328b797eb49b7e4132d713efe52.1000x1000x1.jpg", "title": "Mo Milly", "album": "Pricele$$", "lyrics": "[Intro - Birdman]\nMake it so fresh: YM\nSo fly, so priceless, CMB bitch\nJust another day on the\nTop floor of the balcony bitch\nLive it how we live it\nMula, Drizzy\nYou what it is, young'un: appreciate that\nIt's big money popping baby boy\nAin't none of that lil biddy\n\n[Hook]\nMore, m-more milly\nMore, m-more milly\n\n[Verse 1 - Birdman]\nPearl-white candy paint job fly\nBig Tymer on the loose\nGot a bitch riding 5\nAnd every time I pull up, you know I'm iced up\nWhen I step up in the club I light the bitch up\nBack on my saddle throwing purple out the truck\nCandy paint, rally stripe, shining like us\nPearly white Maybach hatchback\nAutomatic straps, stash spots under the rack\nBitch, ready to spray that\nForeign grinds, hard times\nGetting mines, you know: Uptown\nBig time doing time\nYou know, Harley Davis baby\nCash money is who pay me so you pay me how it weigh, baby\nBlack gold, 100 mil off the floor\nNever told now you know how it go bitch\nOne hundred, one hundred\n\n[Hook]\n\n[Verse 2 - Drake]\nYou're now fucking with the most requested\nThe young nigga that everybody is so obsessed with\nAnd black-on-black 62 float majestic\nMe and Stunna in it, boy: I'm just so connected\nCaught up in a popularity contest\nI'm about to reach my dreams and I ain't even got my arms stretched\nThank Me Later: first week, I'm taking all bets\nBecause a million copies isn't really far-fetched\nI keep credit cards in cash knots\nI keep my darkest shades on til the flash stops\nIt's for my LA girls getting them implants\nAnd all my DC girls getting them ass shots\nGot em for a reason shorty, go ahead, bust it open\nI keep a secret, baby: nothing's heard when nothing's spoken\nHaters talk it like my buzz isn't enough promotion\nAnd I just lost a Gucci sandal in the fucking ocean\nDamn, I guess the problems of a teen star\nAre all that fuels the conversations between y'all\nAnd dogg that's funny; pay me what you owe me nigga\nAll cash money\n\n[Hook]\n\n[Verse 3 - Bun B]\nWell it's that big body nigga and his big body car\nGot a big body boppa with that million dollar jaw\nShe said: \"daddy I like sushi, so give it to me raw!\"\nI pulled out my strap condom, looked down there and said \"naw\"\nCigar full of Kush you need prescriptions to access\nLaying on the mattress with your favorite actress\nMy blunt was going out, I said \"baby, pass the matches\"\nAnd let her top me off while I'm tapping off the ashes\nClassic, but classless\nYou gassed up, but gasless\nUnleaded, yeah. Bun said it, nigga get past it\nTaking what you got, you should've passed it\nYou was moving slower that molasses\nThis time you were nasty\nGive it up to him; it's a jack\nDon't move! This is murder music, nigga\nDon't disturb this room. 2 trill Ent Cash Money and October's Own\nWe true playas down to the last chromosome"}], "artist": "Birdman"}