{"artist": "Pastor Troy", "songs": [{"album": null, "title": "And I Love You", "image": "https://images.genius.com/c8486eeacddeb24d9c9128ca7be2c332.269x269x1.jpg", "lyrics": "I remember when I met 'cha, I was only sixteen\nWho would ever thought that me and you would get the cream?\nWe took a lot of trips together, you stayed down\nRemember when we start hoppin' on that Greyhound?\n\nShe say she like to play hide and seek in the ride\nAnd sure I'll open up the trunk and hide her inside\nShe say she think I'm cheatin' wit a girl named Jane\nYou ain't just my baby, bitch, you my everything\n\nI was broke but you made things better\nAs long as me and you together, we can get this cheddar\nWhatever, her name White Sally\nI met her through my homeboy Rico out in Cali\n\nI thank Reagan for the haters when ya got hard\nYou bought me jewels, Gator shoes and some big cars\nYeah, you took me out in the hood, gave me good thangs\nNow we on a private plane eatin' chicken wings, come on\n\n(And I love you)\nYou the reason why I ride good\nYou the reason why I shop good\nDrink good, smoke good\n\n(And I love you)\nYou the reason why these hoes choose\nYou the reason why a nigga sprayed\nCandy on my old school\n\n(And I love you)\nYou the reason why I quarterback\nTook a nigga out the projects\nPut me in a cul-de-sac\n\nThat's why I get it how I live, boy\n'Cause you took me\nFrom a young broke nigga to a Rich Boy\n\nAnd I love you, baby, muah, hugs and kisses\nFuck them niggas and fuck them bitches\nBeen in this game since 1998\nNigga, take the safety and shit but I'm great\n\nMaybe it's fate, destiny, you tell me\nDamn near ten and that shit been free\nBut I'm PT so I gots to cruise, nigga\nReally ain't shit to prove to y'all niggas\n\nAll the cars, all the clothes\nWit all the stars and all the hoes\nFirst class flights, a nigga live in the lights\nBut see you in the dark, this stuff is kinda hard\n\nSee where I park, valet costs a note\nDrop another fifty just to check my coat\nProbably leave wit yo' chick, know how I do\nIt's Pastor Disaster, baby, I love you\n\n(And I love you)\nYou the reason why I ride good\nYou the reason why I shop good\nDrink good, smoke good\n\n(And I love you)\nYou the reason why these hoes choose\nYou the reason why a nigga sprayed\nCandy on my old school\n\n(And I love you)\nYou the reason why I quarterback\nTook a nigga out the projects\nPut me in a cul-de-sac\n\nThat's why I get it how I live, boy\n'Cause you took me\nFrom a young broke nigga to a Rich Boy\n\nTook me from a gun totin' nigga to a Big Boi\nToo legit to slip, now I got papers on my shit, boi\nAnd not just a weapon, I'm talkin' 'bout titles and deeds\nYou payin' rent you can't afford and can't break out of your lease\n\nI'm out of your league, I might as well be Ivy\nAll over ya ass like injections in a stripper's hiney\nRhyming is a skill that requires timing\nLike dual ejaculation while my lady's riding\n\nI'm 'bout to cum, I'm 'bout to cum at the same time\nSatisfied? I'm satisfied, that's how I slang mine\n\nA generation came up under my style\nFrom penetration of the nation when I was just a child\nNow, who's really in the critics talk 'bout me?\nAndre 3000 and three mo' niggas that's really fie\n\nLet me break it down, I get fly at that mouth\nI stay fresh to the hosiery we 'posed to be\nThem niggas from the South\nSo one to the two, the three, the fo'\nSatisfied? I'm satisfied, so I'ma get 'cha some mo'\n\n(And I love you)\nYou the reason why I ride good\nYou the reason why I shop good\nDrink good, smoke good\n\n(And I love you)\nYou the reason why these hoes choose\nYou the reason why a nigga sprayed\nCandy on my old school\n\n(And I love you)\nYou the reason why I quarterback\nTook a nigga out the projects\nPut me in a cul-de-sac\n\nThat's why I get it how I live, boy\n'Cause you took me\nFrom a young broke nigga to a Rich Boy\n\nAnd I love you\nAnd I love you\nAnd I love you\nAnd I love you\nAnd I love you", "year": null}]}