{"artist": "BONES", "songs": [{"album": "LivingSucks", "title": "(BONUS) TopChoiceMeats", "year": "2018-08-14", "lyrics": "[Intro]\nWe're here 24 hours a day! This is just what you're looking for!\n\n[Part I: Unknown House]\nAnd they're gonna fake it, Ryan... gonna float it... for, THE TOUCHDOWN!-\n\"Aww!\"\n\"Guys, we gotta go, I'm done being stuck in this den with you guys every single week, watching football!\"\n\"Man, where would we even go?\"\n\"Jamaica?\"\n\"Jamaica?!\"\n\"Yeah, let's go! Just, dudes, let's go\"\n*Plane flying sound*\nThree friends take a trip of a lifetime in search for something different\n\n[Part II: Jamaica]\n\"Welp, guys, we made it. It's beautiful out here. Look at the water, it's so clear, so-\"\nTake a chance\n\"How the fuck did we even come here?\"\n\"Man, even in Jamaica we can't get in here.\"\n\"What do you mean? Let's just keep WALKING, we're here for a couple more days, have fun-\"\nBut little did they know\n\"Wassup boys? Looking for the girl?\"\n\"...Who're you?\"\n\"Don't worry about it, man, just follow me, one time\"\n\"Come on guys, let's go.\"\n\"Sinkar, who is your friend, man?\"\n\"Oh, don't worry man, they with me.\"\n\"No. They need the tattoo.\"\n*The sound of a tattoo machine*\n\"Aaaahhhh!\"\n\"Man, what's this song? We've been hearing it ever since we've been here.\"\n\"What song is this?\"\n\"Heh, what song is this? Look at the tattoo you're getting. I take it you boys have been to Phlapepatown\"\n\"Ho-how did you know?\"\n\"Heh... Look at my arm. Yep. I've been down with Phlape for about a... say 12 years. Aaand I'm finished. There, you boys, go, I hope you guys have a good time. You like this?\"\n\"It's great\"\n\"Yeah, sick\"\n\"Thanks, man\"\n\"Of course, man\"\n\"Let's go!\"\n*Door creek*\n\"Welcome.\"\n\n[Part III: Commercial]\nHello. This is Sean Goose from Seangoose Glassware\nToday I'm here to let you know the in store specials\n100% pure jade Seangoose piece!\nThe Goose family name harkens back many years\nMy family set up the first Seangoose hut in all of America\nSo, when I say... I know a thing about Seangooses - trust me\nAnd this is our signature Seangoose shot glass\nLook at this thing, it's sleek, it's new, it freezes your drink on it's own\nAnd for the misses, a pink Seangee. And it smells good too\nSo what are you waiting for? Come on and visit us, we're located in the [?] Gomez strip mall. Right next to... Dublins\nAnd now, please... We're located right next to Dublins\n\n[Part IV: BONES Track]\n[Verse]\nSESH\nGraveyard walk to the rhythm\nYelling fuck whoever with 'em\nIf I walk in there's an issue (what)\nReversing how you feeling\nOne verse and I turn to villain\nYou're cursing me with the minutes (wait)\nMy work will never be finished\nSesh always on extra innings\nThe second I want to leave, then I go\nYou're caught in the fold\nYou thought it was gold\nNow you sippin' on fours\nJust to numb your soul\nSigned off on something you could've done on your own\nContracts italicize your life in bold\nEvery time we do a show, now they catching a cold\nBut we know how it roll, that's a victory goal\nNo mercy for those who can get it, but don't\nSympathize with those, who need help but won't\nAlone in the ocean, drilling holes in the boat\nI'm the ghost in the attic, I'm the noise in your room\nBreaking down is a habit, coming back is a curse\nKeep me out of my own head and spare me the truth\n\n[Outro]\n[?] get out of my head and spare me the truth\nWhat, wh-\n\n[Part IV: Office]\n\"Hey, man, it's pretty cool, you shoulda seen it\"\n\"You did what?!\"\n*A lot of people talking simultaneously*\n\"Oh, no, no, no, no, guys. Hey, wait a minute, wait a minute guys\nWAIT A MINUTE! WHERE IS LERON\"\n*Music starts playing*\n\"Come in. Gomer, have a seat.\"\n\"Sir, you wanted to talk to me?\"\n\"Gomez, it's about your performance. You got toxic waste all over the food department.\"\n\"If you're talking about the fork lift on Thursday, that was Rodriguez.\"\n\"Rodriguez came in here talking about you. And I have footage.\"\n\"Boss! Rodriguez is all bullshit! No brass!\"\n\"Then explain this, Gomez. Rodriguez is in a hospital. His radiation levels are off the charts.\"\n\"That's very unfortunate.\"\n\"Gomer. Are your eyes even opened?\"\nChill, brother\n\"Just a little swelling, sir. I was swimming in a pool. Lots of chlorine.\"\n\"Gimble, this is on behalf of me and the lives that were lost because of your negligence. Get out of my office and never come back.\"\nYou're FIRED\n\n[Part V: BONES track]\n[Intro]\n\"I just needed to see ya\nI'd like to a... take you out\"\n\n[Verse]\nLook, now my brain is buffering\nI'm stompin' through cathedrals from the sixteen hundreds\nHope you don't praise the stuntin'\nOut your play book look, you ain't impressing nothin'\nAnd we get it you on a whole 'nother grind\nNow let us be we risin' paintings from a whole 'nother time\nOils on the canvas, you up on my mind\nI wish we could hop in these pictures and hit rewind\nSlow dying, woods keep me grounded\nEl keep the strangers from around me\nIn the stream they drown and that's how they gon' find 'em\nIf they ever harm anybody that surround me\nTeamSESH too astoundin', BONES won't allow this game not to be ours\nCut some cards and flowers, send 'em to your door over night for you cowards\nThere's no fights in [?] a couple years ago 'fore I made a couple dollars\nNow let's put 'em on the market\nEnd this shit quick, should have never ever started, what\nSESH\nBONES", "image": "https://images.genius.com/26fee9bcaa6d7c4508ccf906f99dc46c.1000x1000x1.jpg"}]}