{"songs": [{"album": "The Shining", "year": "2006-08-22", "title": "Baby", "image": "https://images.genius.com/54eb6eceefa15d74a6754b2e310c7b08.1000x1000x1.jpg", "lyrics": "[Sample of \"BABY!\" repeats throughout the song]\n\n[J Dilla - Intro]\nLet's go!\nTurn it up...live niggas throw it up\nIt's the official, we got the bank for ya...\nGO!\n\n[Guilty Simpson]\nYou can catch Guilty Simpson at a rave with babes\nPackin a .38 snub and a razor blade, uh!\nThug shit in a major way\nI'll beat ya dog's ass like Flavor Flav\nThug niggas with guns beneath leathers\nIf you know better, keep ya bitch on tether\nNiggas got snow like cold cold weather\nAnd big money clips cause they fold dough better\n\n[J Dilla]\nYeahhh! Packin three cuties in the Hemi\nI be runnin hoes like Luke in Miami\nBefore I hit it, gotta get the hat for my jimmy\nI don't mean to pimp that hard, it's just in me\nGot a sick flow and a couple of pistols\nGot this thick chick Coco in 'Cisco\nThe same day I met her, we backstage in the bathroom\nShe got a mouth like a vacuum, uh!\nWe them boys with the chains on our neck\nE'ry five minutes we untanglin' them\nIt's Pay Jay make sure the name on the check\nJay Dee in the turnin' lane with ya ex like Los Angeles\n\n[Guilty Simpson]\n...and the nights are scandalous\nThick like big bread basket sandwiches\nChoke on that, we smoke on bats\nAnd put a hole through the horse on your Polo hat\nAnd leave the shit smokin where the logo at\nAnd the witnesses won't tell po-po jack, uh!\nThat's how it is when we fuck shit up\n(Kill it!) Keepin' hoes horny and the blunts lit up\nFEEL IT!\n\n[J Dilla]\nYup, real talk y'all\nI met this girl last night, she whispered in my ear like\n[*singing*]\nBaby, you're the one..\nBaby, take me home tonight\nBaby, lay me doooown..\nBaby, girl it's only right\nBaby, you're the one..\nBaby, you're the one for me\nBaby, (yeaaah!)\nYou should be havin my baby (Turn it up!)\nYou should be havin my baby\n\n[J Dilla]\nIt's the official, {?} make the wrist glow\nThink it's a disco when I ran Bisco\nIf you feelin' it, where your Earl Flynn at?\nCut the check, Tim tell em where to send that\nGot your feminine fat, tell me where ya friends at\nKay moved to the valet where the Benz at\nLet's be...\n\n[Guilty Simpson]\n...out ridin high\nGirls stop when they see the clique ridin by, on jock\nThey ain't invited unless they gon' drop\nYou do it how I like it and make it go pop\nIf all's agreed, we got weed\nSkatin' through the area, movin' at Mach speed\nMakin moves is a must - why bother doin it\nIf what y'all doin ain't 'bout dollars?\n\n[Madlib]\nAll my...(\"BABY!\") girls always lookin for me\nMy kids' moms always lookin for me\nThey lookin good for me\nYou what? - You gon' stick with her or me?\nDamn girl, you always givin the third degree, you still my (\"BABY!\")\nAlways keepin me up on my toes\nUnless I'm out creepin on do's or sleepin with hoes\nStill my (\"BABY!\"), cakes with cakes upon cakes\n(Ay, where my money at?) Keep a nigga spendin papes\n\n[J Dilla - Outro]\nTurn it up another notch\nYeah, that's how we doin it\nBroadcasting, LIVE from WBBE\nYou know how we do it\nWe got a special guest in the house\nHe goes by the name of Dave New York\nDave, we talkin 'bout, hip hop and radio\nDave, where you at with it?\n\n[Dave New York]\nHow do I feel about radio hip-hop?\nI think it's wack, most of the shit they play is straight GARBAGE!!...\n[*echoes*]"}], "artist": "J Dilla"}