{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/17bdb55979efe915f90e0fa67b92ad61.1000x1000x1.jpg", "title": "High All the Time", "lyrics": "[Produced by DJ Rad, Eminem & Sha Money XL]\n\n[Intro]\nHey, you wanna hit this shit?\nIt's that green tongue, Cali bud\n\n[Chorus]\nI don't need Dom Perignon, I don't need Cris\nTanqueray and Alize, I don't need shit\nNigga, I'm high all the time, I smoke that good shit\nI stay high all the time, man, I'm on some hood shit\nGive me some dro, purple haze and some chocolate\nGive me a dutch and a lighter, I'll spark shit\nAnd stay high all the time, I smoke that good shit\nI'm high all the time, man, I'm on some hood shit\n\n[Verse 1]\nEvery time I roll up, niggas holla \"Roll up!\"\nAnd I tell 'em hold up, you ain't getting money, you ain't smoking\nIn my Benzo, 20 inch Lorenzo's\nSmoking on indo, high as a motherfucker\nI be on them backstreets, niggas know I clap heat\nOnly if you got beef, man, you better holla at me\nNiggas get locked up, stabbed up, shot up\nEvery time I pop up, a lot going on in my hood\nI shoot the dice, I holla get 'em Girls\nDaddy need new shoes\nDaddy need Pirellis to look mean on 22's\nStash box, Xbox, laptop, fax machine, phone\nBulletproof this bitch and I'm gone\n2003 Suburban swerving, too many sips of Henny\nThe D's sick, they searched the whip and they can't find the semi's\nThey was just harassing me cause they know who I was\nSpent the night in Central Booking for smoking some bud\n\n[Chorus]\nI don't need Dom Perignon, I don't need Cris\nTanqueray and Alizé, I don't need shit\nNigga, I'm high all the time, I smoke that good shit\nI stay high all the time, man, I'm on some hood shit\nGive me some dro, purple haze and some chocolate\nGive me a dutch and a lighter, I'll spark shit\nAnd stay high all the time, I smoke that good shit\nI'm high all the time, man, I'm on some hood shit\n\n[Bridge]\nNow if you heard I done started some shit\nIt ain't because I be high, be high\nAnd if you heard I done let off a clip\nIt ain't because I be high, be high\nBut I twist that lye, lye lye lye\n\n[Verse 2]\nI get high as I wanna, nigga\nGo against me, for sure, you's a goner, nigga\nI don't smoke to calm my nerves, but I got beef\nFinna crush my enemies like I crush the hashish\nIf you love me, tell me you love me, don't stare at me, man\nI'd hate to be in the pen for clapping one of my fans\nLet me show you how to greet me, when you meet me, when you see me\nIf you real, my nigga, you know how to holla \"G-Unit!\"\nThere's no competition, it's just me\n50 Cent, motherfucker, I'm hot on these streets\nIf David could go against Goliath with a stone\nI can go at Nas and Jigga, both for the throne\n\n[Chorus]\nI don't need Dom Perignon, I don't need Cris\nTanqueray and Alizé, I don't need shit\nNigga, I'm high all the time, I smoke that good shit\nI stay high all the time, man, I'm on some hood shit\nGive me some dro, purple haze and some chocolate\nGive me a dutch and a lighter, I'll spark shit\nAnd stay high all the time, I smoke that good shit\nI'm high all the time, man, I'm on some hood shit\n\n[Verse 3]\nNow, who you know besides me, who write lines and squeeze nines\nAnd have hoes in the hood sniffing on white lines\nYou don't want me to be your kid's role model\nI'll teach them how to buck them .380's and load up them hollows\nHave shorty fresh off the stoop, ready to shoot\nBig blunt in his mouth, deuce-deuce in his boot\nSit in the crib sipping Guinness watching Menace, then oh Lord\nHave a young nigga bucking shit like he O-Dog\nMy team they depend on me when it's crunch time\nI eat a nigga food in broad day like it's lunchtime\nYou feeling brave nigga? Go ahead, get gully\nSee if I won't leave your brains leaking up out your skully\nI done made myself hot, so, ain't shit you can tell me\nNow niggas calling me to feature, man, fuck your money\nI ain't hurting, I'm aight, nigga, I'm doing good\nI ain't gotta write rhymes, I got bricks in the hood\n\n[Chorus]\nI don't need Dom Perignon, I don't need Cris\nTanqueray and Alizé, I don't need shit\nNigga, I'm high all the time, I smoke that good shit\nI stay high all the time, man, I'm on some hood shit\nGive me some dro, purple haze and some chocolate\nGive me a dutch and a lighter, I'll spark shit\nAnd stay high all the time, I smoke that good shit\nI'm high all the time, man, I'm on some hood shit\n\n[Outro]\nG-Unit, are you ready? G-Unit, are you ready?\nG-Unit, are you ready?\nNigga, ready or not, here I come, come, come", "year": "2003-02-06"}]}