{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "Keeps Spinnin’", "album": "Birdman", "lyrics": "[TQ]\nThey keep spinnin'\n\n[Mannie Fresh, TQ, Jazze Pha (Chorus 2x)]\nMannie: Girl there he go again and when he stop they spin\nJazze: Ain't that them stop and goes?\nMannie: Yeah that's them spinnin' rims\nJazze: And what them thangs they cost?\nMannie: I think they 'bout a house\nJazze: Now all you other wheels are played out (They keep spinnin')\n\n[Petey Pablo]\nNow girl believe me I'm coming as fast as I can\nRims spinnin' like \"rooaaaww\" like I'm a North Carolina man\nWell I can do the do's on deuce 22's\nSo make a mother fucker bowl move\nI'm sitting there holding wait a minute\n\n[T.I.]\nWe in Atlanta, pimpin', ballin'\nEvery seven days is ballin' Chevys\nSeven-four is Escalades on spinnin' blades - they sho is great\nHey Mannie tell these niggas how to hold these shoes\nWhen the car been parked and the rims keep movin' (They keep spinnin')\n\n[Mikkey]\nNow in Chi-Town\nRims picking up every block I drive down\nAnd on my lap that Desert weighing 'bout five pounds\nNow don't be playing cause I'm spraying 'bout five rounds (Gun shots)\nGet down (They keep spinnin')\n\n[Stone]\nYou see that Lexus coupe? That Benz without the roof?\nThat Cadillac on 25's with skinny tires that's baby blue\nThey on them stop and goes\nThem girls like \"Watch him go\"\nSpinnin' chrome with this Killer Stone\nOut the Magnolia with a Diablo (They keep spinnin')\n\n[Chorus 2x]\n\n[Mannie Fresh]\nWhen I get my money baby\nGotta get that big Mercedes\nBelieve me, when you see me\nIts gone be filled up with ladies\nThis here is serious stuntin'\nAnd when them brakes is pumping\nI done caused wreck, gotta catch my breath cause\n(They keep spinnin')\n\n[Baby]\nYou want this money baby\nThem there is buttons baby\nI put that mink on your body you the Bird Lady\nBur Berry furs crazy\nI spent about 80\nBirdman and them thangs (They keep spinnin')\n\n[TQ]\nMine keep spinnin', dippin'\nDabbin', slidin', California ridin'\nI rock for LA I rock for Compton and Watts\nAnd my rims keep spinnin' every time I stop\n\n[Baby]\nYou see my red Lex\nI mean my read Vette\nIn my red Benz - flew up in my liter jet\nI mean my red Beamer - its with that new (?)\nSteering wheel in the middle (They keep spinnin')\n\n[Chorus 2x]\n\n[Wolf]\nIn that H-Town heads turning\nEvery corner that I come around\nHoping niggas grin, cause they love the sound\nOf them big boys swishing\nThem diamonds I stop and go\nSometimes I stop and listen\n\n[Bizzy]\nIts big pimpin' baby\nIt ain't no sippin' baby\nI'm in that new thang sitting on them Sprewell Racings\nSo when I stop they flow\nSo nigga watch your ho\nI'm at the red light but (They keep spinnin')\n\n[Gilly]\nIts Gilly nigga\nThis Philly nigga\nI push way back with the milli trigga\nMy rock are froze - I stop and pose\nYour bitch all over my stop and goes\nThey keep on spinnin' and them hoes keep on grinnin'\nBut when my car stop my rims (They keep spinnin')\n\n[Mannie Fresh talking]\nAll right everybody look at your watch right now\nAnd pay attention to the seconds\nI'm 'bout to pull up to the red light I'm 'bout to stop\nAnd we gone see how long they gone spin (They keep spinnin')\n\n[Chorus 2x]"}], "artist": "Birdman"}