{"artist": "Wiz Khalifa", "songs": [{"year": "2016-02-05", "lyrics": "Oh\n\n[Hook]\nScared money don’t make money, so what you scared for?\nAnd real people do real things, so what you here for?\nA stand up nigga stand up for the rest of their life (Yeah)\nAnd real G’s do what they want, don’t ever think twice\n\n[Verse 1]\nUh, it go, one for the money\nTwo for the niggas gettin’ it\nThree for the niggas that be running from it\nYou gotta grind if you really want it\nDon’t hesitate\nYou came this far now finish out the whole dream\nNobody said it would be easy though, just stick to your plan\nThey don’t understand\nGoing up against the odds\nHaving no regards\nMake our own laws, you could be your own boss\nBut they don’t tell you that\nAll you need is a foundation to stand on\nAnd you can build it then the limit is the sky\nUntil then I’m with my niggas gettin' high\nAnd plus we with it you all know the business\n\n[Hook]\nScared money don’t make money, so what you scared for?\nAnd real people do real things, so what you here for?\nA stand up nigga stand up the rest of their lives\nAnd real G’s do what they want, don’t ever think twice\n\n[Verse 2]\nOh what did you think I would never get another M?\nNiggas only in the game cause we let ‘em in\nWe ain’t check they chains\nWe ain’t put ‘em on blast and expose them fools for everything\nWe ain’t tell you how they really lames\nAnd that they don’t do shit that they get on TV and say\nWe ain’t mad though, we on the coast of France for three days\nI’m tryna make a play, marijuana steam sauna\nYoung nigga from the bottom cracking lobster, eating pasta\nYou would think that he a mobster\nLa Familia, no you not familiar\nJust got a bigger safe, now it’s time to fill it up, nigga\n\n[Hook]\nScared money don’t make money, so what you scared for?\nAnd real people do real things, so what you waiting for?\nA stand up nigga stand up the rest of their lives (Stand your ass up)\nAnd real G’s do what they want, don’t ever think twice (Do something about it)", "image": "https://images.genius.com/329866c1bd0be13efe2300615c0293e5.1000x1000x1.jpg", "album": "KHALIFA", "title": "Elevated"}]}