{"songs": [{"image": "https://images.genius.com/44a8be97aef4cdd5114bd6cec02b2357.1000x1000x1.png", "title": "Blazin’", "album": "Pink Friday", "year": "2010-11-19", "lyrics": "[Chorus: Nicki Minaj]\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nFeels like I’m–\n\n[Verse 1: Nicki Minaj]\nHow could it be, little me\nHad the power to be the best B, in the league\nYeah, inevitably, but could it be little me?\nYou was heckling me, now it’s monotony winning regularly\nI catch rec on recreation, so I exceed all your expectations\nBitches ain't got it in ‘em, I kill ‘em and then I skin ‘em\nThe contract was signed, but I am the addendum\nSo wh-where my dawgs at, Randy\nMa-ma-matter fact, get off my dick bitch, Andy\nCa-ca-ca-cause everything is fine and dandy\nGo against me nooooow, I dare you, Bambi\nHalf a million dollars just to upgrade the car show\nI ain't even detonate the bombs in the arsenal\nBefore the storm comes the calm\nHope you can take the heat like LeBron\nAhh, ha hahahaha ha\nI’m the best now, anybody with some money should invest now\nSoccer moms need to organize a pep rall’\nYour game over bitch, Gatorade, wet towel\nMothafuckers ain't ready, they neva' been\nAs long as I am in the game, you’ll never win\nI’m on that different type of high, heroin\nPut on my cape and hit the sky, heroine!\n\n[Chorus: Nicki Minaj]\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nFeels like I’m–\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\n\n[Verse 2: Kanye West]\nThis is the moment, grab your Kodak\nWhile I’m flying with a flow that is\nThe greatest throwback since that Nolan Ryan\nAnd the days been crazy and the nights even wilder\nAnd the lights even brighter, baby, stand next to my fire\nOnly higher is Messiah or notes from Mariah\n‘Rari six hundred horses, that’s my chariot of fire?\nWhere we flying, they can’t find us all them broke days behind us\nI just took your whole life and redesigned it\nI think I’m Marc Jacobs, I think I’m Lagerfeld\nI think without makeup, you still bad as hell\nI'mma grab your waist then, I'mma grab your face and\nThen I'mma taste it, then I'mma blaze it\nHello all my bad girls, this just in\nYeezy hurt the beat like he fucked her best friend\nAnd she let him back in, and he just did it again\nHe crazy, he blazin, he off the deep end\nI’m blazin’, I’m flagrant, I'm crazy, I’m saying\nToo much for the World so they abbreviate him\nHis past is her fav, his stats is amaze\nHer dress is just per’, uhh\nPrada coloured beige\nIt obvi’ we the ish and I’m rolling with my Brits\nSo real, you so trill, baby, everything legit\nHow you feel? They say we crazed 'cause our styles so diff’\nThey'll be jeal' when we in the mag looking magnif’\nAs if I ain't used Magnums on your favorite bad bitch\nFuck these background niggas, I was tryna ad-lib\nAdd this, we blazin’\nNicki what you think? I got two White Russians, but we also need some drinks\n\n[Chorus: Nicki Minaj]\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nFeels like I’m–\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nFeels like I’m–\nBlazin', blazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin'\nIt feels like I’m–\nBlazin', blazin', blazin'\n\n[Outro: Nicki Minaj]\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nFeels like I’m–\nI fly, I fly high, I’m blazin', I’m blazin', feels like I’m blazin'\nI fly, I fly high, I’m blazin', I’m blazin'"}], "artist": "Nicki Minaj"}