{"artist": "E-40", "songs": [{"title": "Ballaholic", "image": "https://images.genius.com/841113c618ea11b5cbd44a43565e925e.788x768x1.jpg", "album": "Charlie Hustle: The Blueprint of a Self-Made Millionaire", "year": "1999-11-09", "lyrics": "[E-40]\nYou know my.. my whole def-a-nation is to spit straight game\nYou dig that? (Straight game) I I come from the game baby y'know\nI come from this motherfucker, you undersmell that?\nAya, and you know, it's like this nigga\nPimped-out all day you know Hillside Vallejo nigga\nYou undersmell me? Been speakin the real for many moons\nMy niggas in the 7-0-7 on down to Compton\n\nI'm in my FUBU drawers, she in her gown\nCause if some cats tryin to have at me\nI sick the canine in the background\nI'm plannin on splittin my crown but it ain't gon' be too simple\nSee I'm a baller, I got bars around the window\nRottweilers, pits, aikietas, doberman pischers tanked up in the yard\nWith a sign on the fence that reads \"warning: beware of dog!\"\nYou play the frog if you feel froggish nigga leap\nI neglect my dogs, starvin, sometimes they don't eat\nElroy speak to me about my triple-beam; officer, I got proof\nPo'-po', that's for weighin nuts and fruits\nRun with a whole bunch of rugged rowdy-ass knuckleheads, knahwhatImean?\nBig nigga, the size of a football team\nI wear these glasses so that I can look like a square\nBut if you ever see me in a fight with a bear\nDon't help me nigga, help the bear!!\nMe and my wales, we be coonin\nBut see you the type of the nigga that'll go in the backroom\nAnd beep yo'self and act like yo' pager boomin\n\nYeah man, cause a real tycoon\nGon' take this shit from the flo' to the moon\nStill Northstar ridin, six-oh strikin\nSwitch up V-S cherry chokin the wrist and the pinkie\nBut keep it loose around the neck and make sure hoes in check\nSo if you gon' fill a nigga cup, fill it up with paper\nCause we ballaholics bitch, ain't that quiet about this shit\nIf you're on it spend it like you mean it\n\nUhh, I'll have you\nEver since I was ankle low to a centipede's claw\nI always wanted to play pro-baseball\nWeepolization family, that's my favorite sport\nBut instead I'm back and forth to jail and in and out of court\nBEOTCH! Serious about my rock shrine\nI don't give a fuck how much courage juice you had\nNigga yo' mug don't mean like mine!\nI bring the noise like a cymbal {*CRASH*}\nI fuck with 40 dem, make you stick your pistol out the window\nBEOTCH! Y'all oughta see me at the state fair\nShowin off in front of my broad; tryin to win my lil' nieces\nOne of the biggest stuffed animal prizes there\nNicknamed Charlie but my street name is Earl\nBallaholic like Felix Mitchell nephew Lil' Darrell\nI know these streets like the Task Force know dope\nI am the streeets, my ghetto pass can't be revoked\nTen percent, I paid my tithes, forgive me for my sins\nSmoke an ounce of weed a day, maybe that's why I ain't go no ends\n\nYou see, you niggas real truant mayne\nRunnin around here puttin a black eye in the game\nWhen we tryin to feed y'all somethin nutritional for the brain\nAnd nourish yo' game\nYou see there's two type of niggas in this world:\nThose that eat and those that don't\nWhat type of nigga is you, you know?\nYou see we got the tycoon status\nBig hogs, tryin to pile the money up out your trash\nYou dig?\n\nYou can call me Lawry's cause I'm seasoned\nI eat crevice, but not when it's bleeding\nDon't get me wrong, I love sex but I don't play that part\nI love Virginia, but not when the Virginia's tart\nToss me good, and I might Dolce and Gabbana it\nGave yo' ass some bread, and let you go buy up some shit\nCallin yourself takin advantage of my riches\nI'm tryin to be nice to yo' ass\nI normally talk bad about you bitches\nInvested to \"Tha Hall of Game\" buggin and bein notorious\nFor slappin chickenheads upside they weave-a with my Nokia\nMayday mayday, callin all patrol cars and units\nBe on the lookout for the Hillside managler, 40-Water the Ballaholic\nI'D RATHER FLY THAN RIDE AMTRAK\nWhen I'm in Dallas I fuck with (?), and go hard black\nMake an opera singer wanna write some raps\nPapered up - like who? Like a fax BEOTCH\n\nI know you didn't say papered up like a fats\n(Yeah I did, yeah I did) Yeah, cause we do this shit\nUp off the ground on a pitcher's mound\nSlidin, to the bad catcher, able to snatch ya\nBat yo' G out the pocket\nRun it again with a nigga that's in the socket\nAnd it ain't my problem, if the ho hollerin\nWe all about dollars, and collar-poppin\n\nNigga, BEOTCH!!!\nBaller, let me explain to you, a ballaholic nigga\nUndersmell this nigga\nIf you got your ve-hi-cle in your baby's momma's name\nNigga youse a ballaholic, nigga you undersmell me?\nPlease believe in a nigga\nBallaholic nigga, you undersmell me?\nIf you sittin on gold tennis shoe slippers nigga\nYou undersmell me? Youse a ballaholic\nDon't ever get it twisted nigga, yeah\nIf you put ten thousand down on some je-wels nigga\nOver at your house nigga in Frisco nigga\nAnd go back and get it the next day, youse a ballaholic\nYou smell that nigga? Ballaholics nigga\nBallaholics fuck with Sic-Wid-It records nigga\nBallaholics listen to that mob shit nigga\nWe stick to the rules and regulations of this motherfuckin game\nYou undersmell that? Please believe it, bitch-ass niggas\nIF YOUSE A BALLAHOLIC, nigga (scream it like you mean it)\nYouse a baller, please believe that\nThat's what a ballaholic is nigga\nWe ball til we have it all you undersmell that?\nRick Rock, youse a ballaholic?\nMy nigga, my nigga D-Wiz a ballaholic\nDon't ever get it twitted nigga\nMy nigga Kaveo in the motherfucker with me you undersmell that?\nWe some fools with it\nMy nigga Steve Garvey, (??), you undersmell that?\nAnd that nigga Muggsy you know he's a fuckin ballaholic\nGold-tooth motherfuckin pretty boy Floyd ass nigga\nI love you to death motherfucker, fuck ya though\nFuck ya fuck ya fuck ya I'm in this MOTHERFUCKER FOR LIFE!\nV.. A.. L-L-H-O, L-I-C, it's me E-Feeze-E\nL-I-C, it's me E-Feeze-E\nBALLAHOLIC BEOTCH!!!!!!!!!!!!!!!!"}]}