{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/b55066a4d9c23965c80b13a93ffa9cd0.640x640x1.jpg", "title": "Fast Money", "album": "Capital Punishment", "lyrics": "[Intro: echoing dialogue between Big Pun and (someone)]\nMad stressed\n(Yo, just chill bro, chill man)\nNah, nah, I gotta get this money\n(Yo, chill you got everything going for you, man)\nI ain't got nothing, right now, man\n(Niggas calling you and all that, man)\nNah, that shit was down\n('Bout to blow soon, you know?)\nNiggas ain't for real, kid. That's a dream, kid. This is reality. This is reality. This is the real world. Nah I gotta get this fucking money, kid. Word up. Fuck that, nah, fuck that\n(Whatever, man)\n\n[Verse 1]\nI got the sweetest heist, million in cash, another three in ice\nWho can I trust? Cuban'll bust plus get beef tonight\nHere's the plan (plan), we nab the man, bring a camcorder\nGrab his fam, and run the train on his granddaughter\n\"Nah chill, that's too ill, for real I'd rather kill somethin'\nHere's the deal, we shatter his grill, and drill fuck him\nOral torture, no doubt, the shit is holocaust\nIn two minutes tops he's guaranteed to cap and give up all the morsels\"\nIt's settled, better put on your metal, foot on the pedal\nWe got a half hour before the plan sours like Amaretto\nFar from the ghetto, a rebel of chance, the devil in pants\nOut for the fast cash, level advance\nTakin' a chance, I've only got one, my hundred shot\nTommy shotguns my judge, jury and Johnny Cochran\n\n[Chorus]\nMovin' on the stash, first we get the cash\nFor the fast money, I smash the niggas' shit like a crash dummy\nAsk money where the safe, anybody move gettin' laced\nLook at my face and I'ma shoot the place\n\n[Verse 2]\nAyo the plot thickens, I'm pickin' the locks in the back entrance\nPayin' attention, not tryin' to get knocked and catch a fat sentence\nNot to mention these kids is mafioso with lots of dough so\nThey got the popo locked with a Don \"The Rock\" Muraco chokehold (oh oh)\nTheir security system's linear laser protection\nNo sweat, I brought the miniature mirrors for reflectin'\nInspectin' the vault for weapon's assault, second of course\nIt's poison, it sprays, boiled and baked in Epsom salt\nReppin' New York is the cat burglar, the fat murderer\nSlippin' the clip in the MAC, inserterer\nHurtin' your pockets, droppin' your stock to zero profit\nHoldin' heroes hostage and mansions for ransom like De Niro mob flicks\nBack to the topic at hand, the grand prize\nThe safe flies open, the shine almost blinded my eyes\nI cracked the code, enough ice to make you laugh at gold\nPassed the dough to Cuban, started movin' for the back, let's go\nThat's when I heard the sirens, hopin' that my ears was lyin'\nKnew we was dyin' when I saw the guard we tortured cryin'\nPointin' at the building screamin', \"I can see them, kill 'em!\"\nSnipers was willing but couldn't, there's too many civilians\nStill inside, nowhere to hide, nowhere to run\nCuban said, \"Fuck it, we die, we die busting our guns\"\n\n[Cuban Shouting]\nOye castigador, saca el fucking cañon\nVamos pa la guerra, vamos señarlo!\nA castigarlos!\n\n[Chorus]\nMovin' on the stash, first we get the cash\nFor the fast money, I smash the niggas' shit like a crash dummy\nAsk money where the safe, anybody move gettin' laced\nLook at my face and I'ma shoot the place\nMovin' on the stash, first we get the cash\nFor the fast money, I smash the niggas' shit like a crash dummy\nAsk money where the safe, anybody move gettin' laced\nLook at my face and I'ma shoot the place\n\n[Verse 3]\nAyo it's time to pay, and I ain't trying to give my shine away\nLet's show these pigs how much we give a fuck about the brighter day\nI cock the Eagle, Cuban drew the Glock, it was diesel\nSaid, \"See you in Hell coppers\" and started poppin' like it was legal\nWe need a plan, if we can make it to the van\nMissile launchers there with the grenade pistol I bought from Uncle Dan\nMe and my man are runnin' out of ammo, I got about a handful of Black Rhinos and two Rambos strapped to my ankles\nI trampled over one of the bodies, I grabbed the steel\nThrew the bitch over my shoulder and used her butt as a shield\nI filled the clip with the little bit of bullets remaining\nCuban said, \"Move your fat ass faster motherfucker, they gaining\"\nI gave him the case, told him, \"Go 'head, save yourself\nBlaze a L in my memory, tell the family I gave 'em Hell\"\nFor real, that's when I heard the tires screechin'\nPeeped and it was Joe the God with twenty Terror Squad niggas reachin'\n\n*conversation and gunfight to fade*"}], "artist": "Big Pun"}