{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Intro: Biz Markie]\nFunky!\nReady?\nFunky! Funky! Ahhh...\nOne two, one two\nWe came here to do the motherfucking do\nYou and the crew\nGot my man Marley Marl in the house\nCan't forget my man, Lik, y'all in the house\nGot Fric and Frac in the house\nHey-hey-hey, you got Big Daddy Kane in the house\nJuice Crew in the house\nThat's right\nAnd my name is the Biz Markie\nAnd we gonna rock a little something like this...\n\nOne, two, whatcha gonna do?\nI say yes, yes y'all, to the beat, all\nParty-having people guaranteed to be like having a ball\nH-h-h-hey, we gonna do a little something like this I say...\n\n[Verse 1: Biz Markie]\nI'm the rap promoter, I start to motor\nTour from New York to South Dakota\nDrink ginger ale or root beer soda\nNever get the girls with the underarm odor\nPut me on water, I'm a good floater\nWhen I run for prez, you best be a voter\nOnce knew a girl by the name of Rhoda\nI watched Star Wars just to see Yoda\nOr R2-D2 driving down the BQ\nWhen I buy franks, I make sure they're Hebrew\nWhen I entertain, and love to treat you\nLove to see a girl in a nightie that's see-through\nTake her to the crib, turn on the Beta\nWatch a good flick by Arnold Schwarzenegger;\nMaybe *Commando* or *The Terminator*\nPeace party people, ha ha see you later\nBig Daddy, huh huh, my man my mellow\nGet on the mic cause you know you eat Jell-O\n\n[Verse 2: Big Daddy Kane]\nCheck it out, y'all\nYou don't stop, keep on\nWell it's the Kane in the flesh, of course I'm fresh\nOh you thought that I was rotten? Huh, I beg your pardon\nTo me getting paid and getting busy fall together\nSo a man of my ambiance...never!\nCould I be weak, nah why I'm rather unique\nI got style, flavor, grace, and plus a different technique\nThat I be using and not many can manage\nSo a brother like me, I do damage\nJust by picking up the mic to go solo\nI cold turn a party on out, and oh yo\nI get physical, mystical, very artistical\nGiving party people something funky to listen to\nThat's why the other MC's can't swing long\nI stomp them out just like I was King Kong\nStepping on roaches, I get ferocious\nSupercalifragilisticexpialidocious\nI go on and on and on and\nUntil the bright Shirley Murdock morning\nCause I'mma pimp, hear the primp, yes the emp-\nEror, bringing much terror in your era\nI'm ready, willing and I'm able, so bust a move\nNever use a barbershop I got my homeboy Smooth\nCooling out with the clippers right around the way\nTo keep my fresh Cameo cut every day\nLike that y'all, it's like that y'all\nIt's like thata-the-that, it's like that y'all\nCause I'm the prosecutor, taking a stand\nAnd, I'm cross-examining you my man\nThe judge and jury, releasing my fury\nThe verdict that I reach for you is rather blurry\nYou see, the name Kane is superior to many people\nIt means King Asiatic, Nobody's Equal\nI hate to brag, but damn I'm good\nAnd if mics were a gun, I'd be Clint Eastwood\nAnd if rap was a game, I'd be MVP\nMost Valuable Poet on the M-I-C\nOr if rap was a school, I'd be the principal\nAw fuck it, the Kane is invincible\nTo be specific, I may die one day\nBut my rhymes will remain like a hieroglyphic\nIt's a certain special skill that takes much practice\nI got it good, apparently you lack this\nSo in turn, sit back and learn\nListen close, this is for your own concern\nLet me show you exactly how it's properly done\nLights, camera, action\nA rap pro, do a show, good to go, also\nCameo afro, Virgo, domino\nI go Rambo, gigolo, Romeo\nFriday night spend money on a ho-\nTel, to get a good night's sleep, I'm keeping in step\nNow do I come off? Yep", "image": "https://images.genius.com/68e6c18cf6c494ae3922e4cf38b5e4de.550x550x1.jpg", "year": "1988-06-28", "title": "Just Rhymin’ with Biz", "album": "Long Live the Kane"}]}