{"songs": [{"year": null, "title": "Street Gospel", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro]\nDo you think music has a meaning?\nOh, yeah, definitely, it’s good to be more spiritual sooner than anything.  Pretty soon, I believe that we’re gonna have to rely on music to, uh, like, get some peace of mind, or satisfaction, direction, actually, more so than politics\nUh huh.  True shit\n\n[Verse 1 – Saigon]\nStop rappin’ like a tough nigga\nStart a label, now you actin’ like you Puff, nigga?\nThat’ll get you snuffed, nigga\nI went from gangsta to good guy—you gotta love it\nAnd if I had a heart, this would come from the bottom of it\nGo ‘head talk shit on the blog, dog, I can snub it\nBut what’s gon’ happen is clappin’ when we collide in public\nIt's still conscious, but this time it’s hostile\nThis time I’m hittin’ these niggas with\n\n[Hook – P. Jericho]\nStreet gospel\nListen in with these ears, breathe me in with these nostrils (breathe in)\nI am an evangelist (teach), dream, I’ll be a realist (seek)\nI speak the truth, preach to the streets\nI’mma cut these words to the people I reach\nYou hit ‘em with a little bit of street gospel (The renegade’s renaissance)\nI’ve got the street gospel (The renegade’s renaissance)\nDo you want the street gospel? (Oh Lord, oh Lord)\nForgive me for the sins I’ve done\nMy cup runneth over with a little bit of street Gospel\n\n[Verse 2 – Saigon]\nNow that Chief Keef fly, they gon’ kiss him goodbye\nBut look how many people had to die\nLast night in my dream, I seen Mr. Jimmy Iovine\nAll that I could do is ask him why (why?)\nI said, “Jimmy, who you got speakin’ at these marketin’ meetins’?\nWhy do poor people the target they seeking?\nWhen all they promotin’ is sex and violence and this office is creepin’\nThey got the things to keep your heart from beatin’ (pow!)\nTellin’ a kid that sellin’ drugs will make his life less hard\n‘Cause he’s eatin’ like sayin' he can get through all it by cheatin’\nThis just not a reality.  Interscope’s thrivin’\n‘Cause they givin’ us swimming pools of liquor to dive in\nGave us N.W.A., Game, the gangbanging lane\nAnd now this lil’ nigga (bang bang)\nHe says, “Saigon, you got it wrong.  I’m just the guy that make it possible” (To what?)\n\n[Hook – P. Jericho]\nTo hit ‘em with a little bit of street gospel (The renegade’s renaissance)\nI’ve got the street gospel (The renegade’s renaissance)\nDo you want the street gospel? (Oh Lord, oh Lord)\nForgive me for the sins I’ve done\nMy cup runneth over with a little bit of street Gospel\n\n[Verse 3 – Saigon]\nThey said it was imperative for me to be negative\nTo make a name in the record biz and get the executives\nTo invest money in music that's infectin’ the kids\nIn this ghetto, they kids’ll never live, but mine are subjected to this?\nNah, I can’t see that happenin’\n‘Specially with a nigga like me that’s rappin’\nHe who is not packin’ is he that's lackin’\nI'm ready, if you ever wanna see that action\nGotta understand I’m not the kind of a man\nWho allow a dude to be rude and take some food outta my hand\nGot a devise a plan to show ‘em that I’mma stand\nMy ground.  Try and bring me down like tryna drown Aquaman\nAnd I can’t see that happenin’\n‘Specially with a nigga like me that’s clappin’\nSaigon graduated from your puppet to apostle\nI was born to hit my people with\n\n[Hook – P. Jericho]\nStreet gospel\nListen in with these ears, breathe me in with these nostrils (breathe in)\nI am an evangelist (teach), dream, I’ll be a realist (seek)\nI speak the truth, preach to the streets\nI’mma cut these words to the people I reach\nYou hit ‘em with a little bit of street gospel (The renegade’s renaissance)\nI’ve got the street gospel (The renegade’s renaissance)\nDo you want the street gospel? (Oh Lord, oh Lord)\nForgive me for the sins I’ve done\nMy cup runneth over with a little bit of street Gospel", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}