{"songs": [{"lyrics": "[Intro]\nPyrex whipper\nUh-huh\n\n[Chorus]\nIt feel good thumbin' through the backend, don't it?\nAin't have to make a play in three months\nGave the plug to my brother and the trap still rollin' (Let's go)\nAll my hoes freaks, yeah, she ride D\nYeah, like a goddamn pony (Yeah, yeah)\nSteady runnin' to the money, don't stop, green light\nYeah, nigga, keep goddamn goin' (Vroom)\nAnd you already goddamn know it\n\n[Verse 1]\nNeed to pull up my pants, pull my shirt down\nI make what they make in three months for a verse now (Yeah)\nI can take the backend from the show\nPut some bread on your head\nGet you muhfuckin' murked now (Uh-huh)\nGot the work so mad, ho like to blow up my phone (Brrt, brrt, brrt)\nLeave me 'lone, bitch, you dead, I'm at work now (Ha)\nGot the streets' hottest youngin'\nThat Stunna the one got your baby daddy poppin' Percs now (Four times)\nHe say he need some more stamina (Uh-huh)\nHis bitch fuckin' with me, he can't handle her (Yee)\nI only had that car for three months\nAnd I sold like 300 Ps in my Challenger (No cap)\nWanna be BDB Ent, he need help with his music\nHe need me to manage him (Uh-uh)\nWe booked up, let me check if we busy (Uh)\nYour ho like how we dress, we get jiggy\nI'm not with all the talkin', I'm with it\nLeave a mark on your ho, send her home with a hickey (Uh-huh)\nFucked around and went home smellin' like your lil main ho perfume\nMy BM tried to kill me (Damn)\nGod forbid that lil boy play with me\nHave your whole family dressed up in black like a pilgrim (Uh-huh)\nYeah, my prices went up\nYour promoter was playin, but now, bitch, we back in the buildin'\n\n[Chorus]\nIt feel good thumbin' through the backend, don't it?\nAin't have to make a play in three months\nGave the plug to my brother and the trap still rollin' (Let's go)\nAll my hoes freaks, yeah, she ride D\nYeah, like a goddamn pony (Yeah, yeah)\nSteady runnin' to the money, don't stop, green light\nYeah, nigga, keep goddamn goin' (Vroom)\nAnd you already goddamn know it\nIt feel good thumbin' through the backend, don't it?\nAin't have to make a play in three months\nGave the plug to my brother and the trap still rollin' (Let's go)\nAll my hoes freaks, yeah, she ride D\nYeah, like a goddamn pony (Yeah, yeah)\nSteady runnin' to the money, don't stop, green light\nYeah, nigga, keep goddamn goin' (Vroom)\nAnd you already goddamn know it (Talk to 'em)\n\n[Verse 2]\nI ain't have to make a play in so long, I don't even got a scale\nAnd I forgot how much a pound weigh (Uh-huh)\nBrand new car, 2019, had 57 miles (Vroom)\nHad to put it on the highway, Scat Pack (Skrrrt)\nBad bitch with a seven-year degree, but she still sellin' pussy\nMan, I wonder what her mom say (Mmm, mmm, mmm)\nUh, wonder what her dad say (Huh?)\nI don't do the slow shit, I like the fast way (Yee)\nHigh school sold reggie to my classmates\nI'm the one that taught your lil' brother what a bag weigh (No cap)\nWe was takin' niggas' shit in '09\nAnd we wasn't hidin' from ya, had to catch us on a bad day\nHit a lick and make a bad day a good day (Uh-huh)\nHe don't even pop it open, he a good play (Sweet)\nFuck around with me, a nigga gettin' remixed\nGoin' out to dinner with your money, eatin' good steak (Ha)\nFuck around take the whole gang to Ruth's Chris (Gang)\nWho that fine ho right there? My new bitch (Huh?)\nThem ho like when I smile, they be choosin' (Uh-huh)\nI put ice in my mouth, bitch, my tooth lit (Yee)\nGive a fuck 'bout who like how I do shit (Uh-huh)\nLike to ball with my dawgs, who you hoop with? (You ball?)\nProbably havin' a ball with them new niggas (Ah)\nYou ain't stay down like good bitch, you stupid\n\n[Chorus]\nIt feel good thumbin' through the backend, don't it?\nAin't have to make a play in three months\nGave the plug to my brother and the trap still rollin' (Let's go)\nAll my hoes freaks, yeah, she ride D\nYeah, like a goddamn pony (Yeah, yeah)\nSteady runnin' to the money, don't stop, green light\nYeah, nigga, keep goddamn goin' (Vroom)\nAnd you already goddamn know it\nIt feel good thumbin' through the backend, don't it?\nAin't have to make a play in three months\nGave the plug to my brother in the trap, still rollin' (Let's go)\nAll my hoes freaks, yeah, she ride D\nYeah, like a goddamn pony (Yeah, yeah)\nSteady runnin' to the money, don't stop, green light\nYeah, nigga, keep goddamn goin' (Vroom)\nAnd you already goddamn know it", "album": "Baby on Baby", "year": "2019-03-01", "title": "Pony", "image": "https://images.genius.com/be8f69860cbafafe944c022b0e2e354c.1000x1000x1.png"}], "artist": "DaBaby"}