{"songs": [{"title": "A Message", "lyrics": "[Verse 1: Akala]\nWhy are men so weak? I ain't got the answer\nAny boy can bust a nut, takes a man to be a father and a partner\nEspecially young and poor, makes it harder\nSo we fuck and flee the glee of dicks harder\nSee every man wants to be loved as much as women do\nBut we are men, who we gonna admit it to?\nEspecially in these streets when we pose like a killer do\nWhen we say they're hoes does that go for our sisters too?\nAnd I ain't saying i'm perfect, far from it\nChauvinistic pig, but shit, i'm working on\nFrom the day I woke up and realised that I hated women\nWhich is dumb 'cause I was only raised by women\nAnd I ain't saying they're perfect they would admit they ain't\nBut they ain't doing 99% of the rape\nMale supremacy got us thinking it's cool\nAnd women are just objects we do things to\n\n[Hook: Akala & Selah]\nThis is a message to my little sisters (this is a message!)\nGrowing up in this world with no father figures\nDeep down need that love from a man (from a man!)\nSo she get it anyway that she can, yo\nThis is a message to my little brothers (this-is!)\nGrowing up in this cold world with only mothers\nTrying their hardest to be a man\nGettin' the gram feed the fam only way you can (any way, yeah)\n\n[Verse 2: Akala]\nIf most mothers acted exactly like most daddies do\nThere would be an even bigger bigger bag of homeless youths\nRunnin' the streets, feeling unloved\nHow many so called tugs that grew up with only mums\nWhat if daddy stayed around, showed him what a man was about\nWhat if he wasn’t 8 when he became the man of the house\nWhere would he be now? Disciplined, smarter\nMums wouldn’t have kicked him out for lookin' just like her partner\nInstead when she glance at her son?\nIt’s a reminder of the beatings that he gave her - how he mentally enslaved her\nAll the while he was abusing she looked at him like a savior\nBut nobody but herself could save her\nAnd now her eldest son in and out of the prison and women like his daddy\nAnd daughter 15 dropping a baby on the family\n\n[Hook: Akala & Selah]\nThis is a message to my little sisters (this is a message!)\nGrowing up in this world with no father figures\nDeep down need that love from a man (from a man!)\nSo she get it anyway that she can, yo\nThis is a message to my little brothers (this-is!)\nGrowing up in this cold world with only mothers\nTrying their hardest to be a man\nGettin' the gram feed the fam only way you can (any way, yeah)\n\n[Verse 3: Akala]\nListen, what about the daughters\nWe always hear about the boys madness\nWhat about the girls born to a dad absent\nTold her she was the princess, him and mummy fell out\nEver since then? quickly just lost interest\nOn to the next piece of skirt with a thin dress\nOdd, the lessons we learn we don’t sin less\nWe leave daughters, just because we can\nAnd she after any affection she can have in a man\nSame type of girl we turn and call a slag\nI ain't sayin' I never did it i'm just sayin' its mad\nCos cuz? Been 15 and suicidal sad\nI don’t know what it was, maybe I miss my dad\nAll the things I never had, making me mad\nIn a world that says you don’t have?  You’re basically bad\nIf we have half the parents are we half the person then?\nHas it always been like this? Is this the curse of men?\nBut then again, even if they stayed together\nI don’t know if its necessarily better\nIf they’re at each other’s throats, or just plain ignore\nParents, they fuck you up they do, that’s for sure\nThen we grow up and turn up just like you\nThe question is? Can we break the cycle", "year": null, "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}