{"artist": "G-Dep", "songs": [{"title": "Shit Happens Everyday", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "[G-Dep]\nListen...I'ma tell you straight like this\nWord up! Listen...\n\n(Verse 1)\nHey yo! I walk down the block\nWit' my stomach in knots\nSpend time hustlin' runnin' from cops\nBroke as a joke, no wins at all\nCan't play ball and my Timb's are small\nCan't buy trees wit' government cheese\nI rather be where it's breeze, niggas bubblin keys\nMy moms got two jobs, one on her knees\nAnd writin' letters to the governor-\nPlease call off the deeds!\nMy baby mother wit' another brother wit' cash\nThey drive by, roll down the window and laugh\nI solve all my problems wit' indo and hash\nBought my daughter a Nintendo\nNow she callin' it dad\nMy landlord's a jerk, the water don't work\nMy little sister twelve\nAnd she bought her own skirt\nRather do Kurt than do her homework\nTalk blunts and boys and she'll jump fa' joy\nShit's twisted! Opportunity knocked\nBut I missed it, out in the park gettin' lifted\nSo now I'm sittin' here shit outta luck\nWithout a buck and it don't make a difference!\n\nSo yo! If you hear me\nCause if you don't I come up close\nAnd say it clearly. I got ta' know-I got ta' go!\nI strive fa' my pay each and every way\nBut this type of shit, it happens everyday!\n\n(Verse 2)\nIt's like I'm trapped in a maze\nWalk around in a daze\nI won't rest til' I'm paid\nAlmost down in my grave\nI wanna' look tough but my sneakers is scuffed\nEveryday passing the week is enough\nI had a little money but it came and it went\nNow it's either pay the rent or stay in a tent\nAnd it don't make sense how the shit is intense\nAnd all ya' got up in ya' pocket is lint\nYou get the hint!\nI had a cigarette fa' breakfast, just a beginner\nFries fa' my lunch and sleep fa' dinner\nTry ta' go ta' church priest call me a sinner\nThey call me everything except for a winner\nI'm walkin' in the rain wishin' things would change\nIt ain't a game and I pawned all the rings and chains\nEmotionally scarred from losin' my job\nPastor nod-nigga times is hard\n\nNow do ya' hear me?\nCause if ya' don't I come up and say it clearly\nI got ta' know-I got ta' go!\nI strive fa' my pay each and every way\nBut this type of shit, it happens everyday!\nNow would ya' check me?\nIf I was you and you was me\nWould you respect me?\nI got ta' know-I got ta' go!\nI strive fa' my pay each and every way\nBut this type of shit, it happens everyday!\n\n(Verse 3)\nYo, yo! I ain't gonna' front!\nAll I want is a blunt\nA pair of blue and yellow dunks\nAnd my hundreds in chunks\nBut people see me, put they purse to the front\nI'm wakin' up early in the first of the month\nHoneys don't respect when you callin' collect\nAnd it's twenty-five cent, you can call em' direct\nI put my life on the line, I ain't makin' a dime\nNiggas call me never mind\nMan, you're wastin' ya' time!\nHey yo! I'm livin' in the ghetto\nAnd I'm tryin' ta' survive\nAt the same time a nigga rollin' by in a five\nCan't find a job for a 9 ta' 5\nIt's like the only gettin' by\nWhen ya' feelin' the high\nAnd I ain't got no smoke, the elevator broke\nI'm at the end of my rope\nTryin' ta' find a way ta' court\nI'm sippin' on gin thinkin' how I could win\nI don't know where it begin\nBut this is where it could end\n\nNow yo! (Hook)"}]}