{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/17bdb55979efe915f90e0fa67b92ad61.1000x1000x1.jpg", "title": "Like My Style", "lyrics": "[Produced by Rockwilder]\n\n[Intro]\nI know you like my style\nYou like how I break it down\nI know you like style\nYou like how I break it down\nI know you like my style\nYou like how I break it down\nWanna get rich I'll show you how\nWanna get rich I'll show you how\n\n[Verse 1]\nOn ya mark, get set, let's go, switch the flow\nTeach ya how to turn Yayo into dough\nThe original don dada, nobody bomb harder\nYa heard what I said boy, I'm hot, I'm hot\nThe hoodrats they say \"He so crazy\"\nThe snitches they say \"He tried to spray me\"\nThat's what you get for trying to play me\nThe aftermath and my wrath is so shady\nNo matter how you try you can't stop it\nI catch ya stunting in the Bentley Coupé cockpit\nIf you a pimp why ya hoes stay outta pocket?\nFront and find out how my P-40 Glock hit\n[Yayo] \"50 you need some help?\"\nChill, Yayo I got this\nWhere I'm from the D's tryin' to knock us\nThey swear to God that it's me selling the choppers\nMan, I ain't give them little niggas no product\n\n[Hook]\nI know you like my style\nBut how much do you like my style?\nYou like how I break it down\nWanna get rich I'll show you how\n\n[Bridge]\nThe birds they say I got a way with words\nI be like \"baby girl, I like them curves\"\nIf ya not busy tonight then we can swerve\nI'mma bachelor, baby, fuck what you heard\n\n[Verse 2]\nFrom the tellie in ten minutes I'll make you a believer\nTongue touch ya, I'll have ya shakin' like you havin' a seizure\nI make hits about what I do in my leisure\nG-Unit gang, can't another clique out there see us\nNiggas lip sync the lyrics cause they wanna be us\nGroupie hoes from the hood they be trying to G us\nTrying to holla at the kid every time they see us\nGirlfriend quit pretending, I'm the nigga ya love\nAnd I ain't got to say nothing, you know that I'm thugging\nPut my hands on that ass and ya say that I'm bugging\nWe family, baby, kissing cousins\nNow look what the riff raff done drug in\nFor the cheese my degrees is hotter then ya oven\nI'm a New Yorker, but I sound Southern\nAnd we sip DP 'till the Don stop bubblin'\nAfter we play, ok, go to ya husband\n\n[Hook]\nI know you like my style\nBut how much do you like my style?\nYou like how I break it down\nWanna get rich I'll show you how\n\n[Bridge]\nEm said you gone like my style\nDre said you gone like my style\nI said you gone like my style\nYou gone like how I break it down\n\n[Outro: Tony Yayo]\nYou're not really, really ready\nThe drama will have ya ass in trauma, boy\nYou're not really, really ready\nMy knife flip open and then I gets to poking\nYou're not really, really ready\nThem shells start popping and bodies get to dropping\nYou're not really, really ready\nYou think ya ready, ya not\nReally really ready", "year": "2003-02-06"}]}