{"artist": "Prince Paul", "songs": [{"album": "The Redux", "title": "Drama Mama", "image": "https://images.genius.com/e58569cd90b518f059533fae5240c13e.1000x1000x1.jpg", "lyrics": "[Hook]\nI used to be your fool baby, but I ain't gon be your fool no more\nI used to be your fool baby, but I ain't gon be your fool no more\nI used to be your fool baby, but I ain't gon be your fool no more\n\n[Verse 1: Truth Enola]\nDrama queen, givin' a man\nBest of the sex, Worst of the stress\nHalf of the love, half the respect\nOverstand your emotional moods, it's a blank\nWhen it comes to my technical ways, gettin' bank\nFirst message on my cell, \"Daddy please come home.\"\nSecond message, \"Daddy please, I don't wanna be alone.\"\nThird message, \"I know you fuckin' them bitches out there.\"\nForth message, \"When you get home, I won't be there.\"\nLady, givin' me drama, more than my soul can accommodate\nWatch your shit miss, I need some time away\nA little liquor I'm, a little drunk I'm\nGonna wash away the way you front\nWhen you know I spend a lot right (Right)\nHit the spot right (right)\nSplit your back right, even lick your cat right\nFuckin' with you, spectacular brain\nEnd of the game, I'll probably be shackled and chained\nDrama queen\n\n[Hook]\nI used to be your fool baby, but I ain't gon be your fool no more\n\n[Verse 2: Trugoy]\nYou made me hit you once and kick you out four times\nAnd you're still in my two way lookin' for a lemon\nStay givin' me hell when all I want is peace, pussy and progress\nTo make our little [shack/Shaq?] Shaquille\nI hustle state to state, smugglin' two inches into studios\nJust to cut the dope deal\nYou stand on my moods when you got your heels\nDead center on my back, bitch get off me\nYou wanna 9 to 5 mono-typical Joe\nWell I'm a 12 to 12 stereo, extra ordinary\nYou stay with your hands in my face which makes it very\nDifficult not to reflex (reflex)\nPicture me on The Source cover\nIke Turner smile big headline \"Peaceful rapper goes wiiiild\"\nWe at it again, it ain't gon' end\nMy niggas whisperin', \"It must be the sex.\"\nShe's my drama queen\n\n[Hook]\nI used to be your fool baby, but I ain't gon be your fool no more\nI used to be your fool baby, but I ain't gon be your fool no more\n\n[Outro:???]\nLove, Life\nYou holdin' me too tight, and if you up and leave\nStill gon' be alright\n\n[Skit: Dave Chappelle]\n\"I love this shit more than... what's something a nigga really love? Yeah, I love this shit more than pussy with barbeque sauce on it nigga this is fucking delicious\"", "year": null}]}