{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse One: Big Daddy Kane]\nWhen I'm in motion it's just like the flow of the ocean\nThe weight of the words swerve and curve\nMy style flexes bigger than the state of Texas\nQuick as a Lamborghini, smooth as a Lexus\nI guess that makes me the top of the line\nOh yes I'm the most prime of all time\nCause as soon as I pick up the mic and begin and the lyrics just start\nTo flowing, ahem ahem, coughing couldn't stop me from going\nOn with the rapture, so that I capture\nYour mind with state of the art music made to adapt to\nTo knowledge the God on the groove\nBecause when my tongue moves I just love that I'm smooth\nDo it with these and in times I leave reas (reason)\nTo give em a little of the flavor that please\nAs I, school in the who in pursuin and doin and reignin again and the\nGutter and stutter and killin and chillin collectin the rent and\nJammin and slammin and damn it's\nToo much for one mind to comprehend\nA pure blend, the way that I make words mend\nAnd, the way that I be doin rappers in\nMichael Bivins couldn't make these Boyz II Men\nI display, somethin verbally, capable to murder the\nAverage MC, the tough ones I'll burn third degree\nAnd if you're thinkin that I'm takin a beatin\nYou're sure to see the Pink Panther speakin\n\n[Verse Two: Q-Tip]\nI'm a native New Yorker, I pitch a lot of porker\nWhen I get my ride, I be the grill squawker\nTip's a smooth talker, I love Alice Walker\nSo get off the dillz and step back you little hawker\nBetter yet you hooker, you wanna show I book ya\nThe highest way I took ya, is youse a good looker\nQueens is residential, I make the presidentials\nOver instrumentals, I utilize the mentals\nFirst saw Big Daddy at the place called Union Square\nIf you went in by yourself it was a terror\nSee, I could do that cause my crew is kinda phat\nOutside we had the toolies, out West you call em gats\nIt's that, oh thanks chat, well let me drop some more shit\nBring your bats and balls and please don't forfeit\nCause you won't get away, your status will be stank\nYou can ride with me G I'm goin to the bank\nTo meet up with Kane, up on Dollar Lane\nYou get the idea, cause page times is near\nSo rappers see they bug cause they really can't handle\nPosition from the rappin, cause some of them be slackin\nNot in this sport of thought we block out the devil\nThe three different flavors, you know we on the level\n\n[Verse Three: Busta Rhymes]\nCheck it out, uhh! As I come down and get dumb\nYes roughneck, swingin along with the drum\nSwimmin in the, track, retaliatin thorough is how\nI react, Busta Rhymes will attack\nAs you feel the pain, bass kick impacts to the brain\nGotta make a mega migraine\nWhattup? To the Big Daddy and Tip\nMy trip, flip the rhyme, then I dip\nHey, hip-hop, cool, bust the interlude\nWack do ya on the stage gettin booed\nThis structure it takes, bust the angle of three different flavors\nOn a young raider choc well that's my vocal fader\nKeep my volume on extra boom!\nAll the vains in my neck symbolizes that I want room\nWord up, huh! Here I am, damn\nDragon slayer stackin layer after layer\nThis jam will be ran while the record flim flam\nWiggle your front pram, to the runnin man\nSam, Busta, Rhymes, comin on time\nL.O.N.S. did, rip a new design\nFlavor one, taste the unborn baby\nFlip before you move or catch a bad one baby\nChiggy change chump, the over sized puff\nBusta pump you and the love, and then I rump\nEmotional stare point, for the wild\nBusta buckwild musically direct from Strong Isle\nUnload, catch you like smell later\nDig on your taste of the third flavor, rrrarrrRHHH\nRARRARRRRH! Direct from the lungs of the dragon, uh!", "image": "https://images.genius.com/f2f313ca094b7792e9d4a77d69784d4d.475x473x1.jpg", "year": "1991-10-29", "title": "Come on Down", "album": "Prince of Darkness"}]}