{"songs": [{"title": "F U Heard", "album": "Bay Chronicles", "year": "2019-03-29", "image": "https://images.genius.com/9b70c3f92bee5b020fb86a794b814de7.1000x1000x1.png", "lyrics": "INTRO\nYeah, yeah, yeah (Debbie, hoe)\nYeah (Let's get ittt)\nYeah (check)\n\nCHORUS (x2)\nFuck you heard?\nBout to swerve\nBut now you getting on my motherfucking nerves\nI said, \"What? That's absurd\"\nI let my squad talk bitch I don't say a word\n\nVERSE 1\nY'all bitches hate me?\nWell I hate y'all back\nTalking all that shit like your jaw don't crack\nFace shots have my knuckles all covered in glitter\nCuz I talk that shit and back it up like a stripper\n\nNow put it right, in my face\nI see them looking like they got something to say\nFrom afar, let em hate\nGet too close and I'll blow that ass away\n\nCuz I go so hard but I look so sweet\nJust lit up a blunt that's about 2 feet\nKillin this right now? I'm willing and able\nLaid back with my legs kicked up on the table\nBitch I'm a boss\nNothing less\nIt's \"Your Highness\" every time I am addressed\nFuck is you? I ain't impressed\nFake hoes like their nails, I keep em pressed\n\nCHORUS (x2)\nFuck you heard?\nBout to swerve\nBut now you getting on my motherfucking nerves\nI said, \"What? That's absurd\"\nI let my squad talk bitch I don't say a word\n\nVERSE 2\nDig a ditch for a bitch if she gon throw dirt Talking all this shit like she won't get hurt\n\"Debbie this, Debbie that, Debbie won't do shit\"\nSo Debbie went up to her, like, \"What up, bitch?\"\n\nSay my name in vain like I wouldn't appear\nAll that tough talk gone now it's nothing but fear\nAnd before the first word came out her mouth\nDebbie caught her with a right and knocked her punk ass out\nYa little hoe, this ain't a game\n(I got aim that can hit from any range?)\nAnd if your friends wanna jump\nI got a bunch of goons waiting in the cut\n\nCan't get up\nFucking leave her\nDisobedient, so I had to beat her\nThe loudest ones, they do the most\nThey get shit started, but I get results\n\nCHORUS (x2)\nFuck you heard?\nBout to swerve\nBut now you getting on my motherfucking nerves\nI said, \"What? That's absurd\"\nI let my squad talk bitch I don't say a word"}], "artist": "Lil Debbie"}