{"songs": [{"lyrics": "INTRO:\nLadies and gentlemen, homosexuals, lesbians and transvestites\nI am your platter spinnin' poppa, your whoopa whoppa, your G-mosavé from the mohavé\nSellin' weed out the alley of the anti-dope valley...\nRollin' like a tumbleweed through Pimpville, Pimpafornia...\nI'm the Hungry Hustler, Afro mutha' fuckin' M-A-N\nGivin' a shout out to all these parasites (parasites?...you understand me?)\nThese mosquitos (mosquitos), mosquite ho's\nSwarmin' around my wallet tryin' to suck me dry (hell yeah)\nBut money come too haaard...to give it all to a woman (I know that's right, hell yeah)\nWe all do stupid things....payin' too much for pussy don't have to be one of em'\nSo fellas, don't get pussy-whoopped (say what?)....\nWhoop that pussy (while yer bullshuttin'...looky here boy)\nAnd we ain't talkin' bout all women (henh)...\nBut if the maxipad fits, go ahead and wear it bitch (henh....do you undersmell me?)\n\n(Check this out loco) Babay (uhoh), you are the woman...of my dreams\n(yes you...go on an do your thang)\nAnd I really want to put a woman like you.....somewhere on my team\nYou have a sense of humor (unh..c'mon) you sexy and you smart (you so intelligent)\nBut when you tried to take my money, honey...you broke my fuckin' heart\n(c'mon cuz...where you at loco? ...You broke my fuckin' heart)\nI said baby, yeah I need you...to step on out my car\n(step on out my car....don't forget your panties and your bra)\nCuz now I know exactly what you are...\n\n(Ladies and gentlemen, fresh off parole...the Quarterpiece Quartet)\n\nCHORUS:\nYou gold diggin' bitch...usin' yer pussy tryin' to get rich...maybe\n(what you say baby? You need some what? You need some money?)\nIf your pussy ain't free...it's not for me, baby\n(you know you fucked up, don't ya? you know you fucked up, don't ya? don't ya?)\nYou's a gold diggin' bitch...usin' yer pussy tryin' to get rich...maybe\n(n-n-n-n-n-n-no...you'd...you better not skip this song, you better not skip this song)\nIf your pussy ain't free (shit)...it's not for me, (I'll be sittin' up there) baby\n(watchin' them male bashers Ricky Lake and Queen Latifah, so listen to this shit, biatch)\n\nSee, I finally figured out why these ho's be hoin'...\nPussy is the only thing a bitch got goin'\nIt must be Sunday, cuz you got no class...\nWith the G-string goin' up the crack o'yer ass (crack o'yer ass)\nYo, you didn't speak back when I spoke to you (spoke to you)\nWhy? Do I look broke to you?\nYou put your head down, baby, then you passed me (passed me)\nYou hit the dance floor and started dancin' nasty (nasty)\nAnd it's a trip when a stripper start to strip\nAll the home boys feel obligated to tip\nBaby, even though I love the way you grease your thighs\nI'm savin' my money for some chile cheese fries\nPlease! Don't make me laugh ho (laugh ho)\nTake yo gold diggin' hands off my afro (afro)\nGive you money for dancin'? Come on boo\nI wouldn't give it to you, if you let me cum on you\nOoh I never found a gold diggin' woman arousin'\nI'm a stingy black boy from the year two thousand\nPayin' a broad is preposterous...\nUnless you stick your dick down her esophagus (eww)\nAnd even if you did that, you still a trick...(still a trick)\nYou need to make the woman pay for your dick (you know..)\nYou the one huffin'\nYou the one puffin'\nShe the one layin' there, ain't doin' nuthin'\nAnd I bet you ate the pussy hopin' for good luck\nNine times outta ten you didn't get your dick sucked\nBitch too busy, thinkin' bout\nTakin' all the money out yer bank account\nSo get out my Cadillac, real slow...\nAnd go back home to your dil-do\nIf your lookin' for a trick, Miss Gold Digger...\nYou need to go talk to a old nigga\n\nYou gold diggin' bitch...usin' yer pussy tryin' to get rich...maybe\n(all these little undercover prostitutes, cuz)\nIf your pussy ain't free...it's not for me, baby\n(get to the house and the bitch stick out her hand and shit)\nYou's a gold diggin' bitch...usin' yer pussy tryin' to get rich...maybe\n(you know...I ain't tryin' to be too niggerish on the microphone, you know what I'm sayin' cuz?)\nIf your pussy ain't free...it's not for me, baby (hey, let's flip it with finesse, for the ladies)\n(Honey) Man, this girl walked up to me the other day... (you can't have my money)\nI ain't even fuckin' her...she want me to jeopardize my life...\nTake her to the wrong neighborhood way across town...\n(Honey) And got mad at me when I asked her for some money for some gas in my Cadillac\n(you can't have my money) I told her like this eyea! Bitch I ain't playin'\nIt ain't like you my woman.....you know what I'm sayin'?\nTalkin' bout a man s'posed to take care of a woman\nI told her like sugar free, I said now wait a minute baby, hold on (hold on)\nThat's drama...naw, naw, that's some shit you got from your mama\nNow I ain't fixin' to break nary fingernail goin \"oops\" upside yo head\nTalkin' bout \"take me shopping\"\nI told her like \"be legit\"...check this shit out, I say, hey man\nI said\"Hit me when your welfare check is comin'...\nAnd maybe we can go to the mall, or sumpin'...punk bitch\n(Hey what's Nate Dogg tell them bitches man? Hey let me concentrate and say..)\nCuz I-I-I (uh-oh) have never met a girl (whay you playin' me...hey comeon y'all)\nThat I love, in the whole wide world\n(What Ice Cube say, hey check it out, he say)\nLast night she sucked my dick...\nNow she kissin' Little Man...\nWon't he suck my dick and let's cut out the middleman-man-man-man-man-man-man-man", "title": "If It Ain’t Free", "album": "My Fro-losophy", "image": "https://images.genius.com/0bbd138da6ed935df988e78c78275c51.364x368x1.jpg", "year": null}], "artist": "Afroman"}