{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind (The Prequel)", "title": "When Skateboard Came", "image": "https://images.genius.com/6cd28bc24da2d71d461ba4dbf4f4dfc1.600x598x1.jpg", "lyrics": "[Chorus]\nWhen Lil' Skateboard came\nWith them big ass chains\nThem bitches like \"P, why you got that on?\"\nI'm like \"Bitch stay in your lane\nAnd give a nigga brain\"\nEverlast 'till the break of dawn\nWhen I pulled up in that big ass thing\nThat was white as cocaine\nBackpackers thought my mind was gone\nBut when I pushed the up, u-u-up,up\nBitches, bitches, bitches, bitches, bitches be like what\nStudies show...\n\n\n[Break]\nYeah\nYeah niggas\nYou hear it right? You hear it?\nThe Drama man, come on look this my shit\nYou know what I'm saying?\nThis is my shit\nYou know what I'm saying\nThis is MY shit, MY SHIT niggas, MY SHIT!\nTake this shit back\nListen, listen to what's happening right now\nListen to what's happening\nWatch this, yo\n\n[Chorus]\n\n[Verse 1]\nStudies show the eyes get damaged\nWhen you stare into the ultra violet rays like dramatic\nStudies show the eyes get damaged\nWhen you stare into the ultra violet rays be like what\nStudies show the eyes get damaged\nWhen you stare into the ultra violet rays\nAnd the ears through the glass of my Rover\nSicky that smells like the po-pah-\nPourri provided by my chauffeur\nThe chains is flooded\nThe dames they love it\nThe rock so big I'm amazed, but it's strange they cut it\nThe belt buckle frames is smothered\nDon't look to long, you might get whatted?\nOnce they scream \"What?\"\nThen they grab the gun by the butt\nSqueeze the dick\nOnce it go click\nOpen your shit\nNadle back your shit open\nThe front of your shit got a hole that's smoking\nFather forgive me I'm sorry another idiot croaking\n\"911, what's the emergency?\"\nNow they rushing that ass to get that surgery\nYou wanted to have it your way like Burger King\nFlame broiled, broil flamed\nThe royal brain\nIs ignoring you lames\nDon't make no comparisons, we ain't sort of the same\nLook at your wallet, we ain't sort of the same\nYour rocks is treated, that ain't sort of the chain\nBetter go to the back of The Source and order again\nLyrically I'm double XL, I drove you home\nThe bracelet got a vibe when I'm holding the phone\nWhen I wave, bitches call me rolling stones\n\n[Chorus]\n\n[Verse 2]\nYo\nI overlook the whole city with a nice clear view\nYou trying to call your bitch that's pretty but she can't hear you\nShe arguing with my doorman trying to get upstairs\nDescribing the prototypes to my icy airs\nThe Ice Creams make all the bitches want to fuck\nPlus the black card is something like an armoured truck\nParking lot\nSee it's an art to hot\nYou know who's who and who's quiet and who talks a lot\nSee there's money machines and those who spark it not\nThose be the type of niggas left in the dark to rot\nI park the pop-ular\nThen I get new cars\nThat's protected by rude guards\nThat'll shoot ya\nAlternate your future\nQuicker than the Wu-Tang Gutar\nBitches see my face and say \"Me gusta\"\nMama used to drive a Cougar\nBut now I drive horses with Italian names\nEquipped with a bitch with a nice stallion frame\nShe half Hatian, call her Jeanvieve and shit\nC'est pas c'est, tout n'est like she Clef and shit\nShe respect my dick\nLike it's break-fer-ast\nShe's insecure, her girl want to get with this\nThe expressed bliss\nOf what I'm blessed with\nWhen I finger fuck the track it caress the gift\nIf you study my mixtape you'll see what my method is\n\n[Chorus]", "year": "2006-04-03"}]}