{"songs": [{"year": null, "lyrics": "[B.o.B]\nThe world is a battlefield, the fight is a fireplace\nWe train to sustain, so how much pain can you tolerate\nThe goal is to dominate competition annihilate\nWe hunger for victory, it’s a dish that we gotta taste\nIt’s a good life we chasing, my shoes on I laced them\nWe don’t get complacent cause each step is greatness\nA champion we made it, it’s my road, I’ve paved it\nIf you feel like I feel, you must feel amazing\n\n[Hook:]\nYou wanna be one, with no one your side\nHow much longer till we make it now?\nWe’re all champions, we’re all champions\nThere’s no giving up, the hunger inside\nOne day we gonna make it, just …\nYou’re a champion, you gotta know\nWe’re all champions, whoa\nYeah, yeah, yeah, yeah\nWe’re all champions, we’re all champions\nWe’re all champions\nYeah, yeah, yeah, yeah\nWe’re all champions, we’re all champions\n\n[B.o.B]\nIt’s all that I’ve ever know, it’s all that I’ve ever seen\nI came here with nothing but I’m a leave with a legacy\nA brand new and better me, believe is the recipe\nAnd ain’t no second guessing when you thinking successfully\nTaking no for an answer isn’t part of the deal\nYou see the blood, sweat and tears, we leave it all on the field\nWe make our dreams reality, you can tell that it’s real\nCause I’m a champion, I live the life I said I would live\n\n[Hook:]\n[O.A.R]\nWhoa, who’s gonna tell me that it’s not my time?\nWho’s gonna tell me that the world ain’t mine?\nAll of us rise up when the time align\nLooking for nothing cause it’s all inside\nRunning away the of midnight run\nFire, fire, I’m a champion\nHigher, higher, it’s my chance\nWe’re all champions, we’re all champions\nWe’re all champions, whoa\nWe’re all champions, we’re all champions\nWe’re all champions\nWe’re all champions, we’re all champions\n\n…there’s no more life to break this\nHope is all we got …the stress, the doubt time…\nTaste the…be strong, …", "title": "Champions", "album": null, "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}