{"songs": [{"lyrics": "[Intro: Action Bronson]\nAm I rapping or what?\nI can't hear the headphones yeah\nTurn me up in the headphones\nYeah, Yeah, Yeah, Ok, alright\n\n[Verse 1: Action Bronson]\nJump tumble\nFront flips off the roof like a stunt double\nMy shorty doing kegels for her cunt muscle\nKeep her shaped up\nThe M3 all green fly like a strange duck\nMy dad was right when he said I was a deranged fuck\nNow every meal is calamari and boudin blanc\nSaddam Hussein guns\nHeld by nuns who do drugs while beige hard bottoms slide on the new rug\nPinky up\nThe joint thicker than Pinky's butt\nJust as stinky\nNick Van Exel with the handle, Helsinki\nEggs Rothko\nThe handmade suit cloth hang out the sports coat\nTwenty three and a half feet on the sports boat\nBrown vest made of suede on my torso\nClose my eyes, inhale deep, sail free\nBlind fury, hoppin' out the braille jeep\nServe me snails to eat\nNo ham and cheese\nI'm tanning\nThe 540i, color salmon\nSmoke a cannon\nPush the seat back\nPut your feet up\nRoll my weed up\n\n[Bridge]\nWhy's it feel like my life is moving fast, yo?\nGet your own, don't worry about my cash flow\nI need a chick to hide the hammer in her asshole\nI need that first class dough(x2)\n\n\n[Verse 2: Big Body Bes]\nIt's me Big Body\nWho the fuck else?\nYou gotta pardon my absence man\nI just came back off of vacay man\nJust spent the whole fucking weekend up in Orchard Beach\nLiving the fucking life\nI was out there Wildin\nHad your moms on the motherfucking boogie board\nDoing all types of stunts\nBut now I'm back though\nAin't shit changed\nJust came back, check my motherfucking emails\nGot more motherfucking deals on the table\nDon't even know what the fuck to do now\nShit\nOh my god\nYou can still see me though\nOut there on Fulton street at 3 in the morning\nBench pressin' a fiend\nAin't shit changed still loitering\n\n[Verse 3: Mac Miller]\nOk, Ok\nI'm relyin' on Viacom to keep my lights and fire on\nMade a deal with Lucifer, said, \"give me the universe\" (Every Single Planet)\nIt hurts kind of like losing your first love\nI saw the bright lights and started doing the worst drugs\nNow, I'm backtracking and hash rappin' with Action\nThrowing hand grenades at paddywagons in passing\nOld fashioned soul grabber snorting all the coke up\nThe type of shit to turn a World War into a Polka\nPolo'd up, the double RL icon\nSteppin' out the limo, tuxedos made of python\nListening to Lionel Richie, fuckin with the lights on\nRice on the table, have us going all night long (Again, and again, and again)\nRooftops, sippin on some red wine\nStart to realize I've been trippin, shit its just fine\nSo, I read a passage out the Bible as I take a bath\nDry off, Hit the Colosseum on Jamaica Ave\nBout to say fuck it and form a union\nMarch up to city hall and protest pollution. (Yes!)", "title": "Twin Peugots", "album": "Blue Chips 2", "image": "https://images.genius.com/3tkvpk6nyazea6ub0nsnj8s01.500x500x1.jpg", "year": "2013-11-01"}], "artist": "Action Bronson"}