{"songs": [{"image": "https://images.genius.com/57be53a917fb24e90b43ff41eb43b2c7.1000x1000x1.jpg", "title": "It is Hard Out Here", "album": "Nip Hussle The Great: Vol. 1", "year": "2008-08-25", "lyrics": "[Chorus: Nipsey Hussle]\nIt's so hard out here\nBut I'm still breathing\nI said it's hard out here\nBut my nigga I ain't leaving\n\n[Verse 1: Nipsey Hussle]\nLookie\nI show niggas too much love\nAnd not enough discipline\nNow look at all this backwards shit a nigga in\nHomies want my head\nThey'd rather see me dead\nThan paper'd up on BET that nigga getting bread\nWhat you thought, what you think, what that shit do?\nI heard Nipsey getting paper, is that shit true?\nYeah, he used to hussle off slauson\nType a nigga probably (feast up)(?) on a coffin\nCos homies families was hurting\nBut what's it worth when these niggas want your carcus\nYeah I know they probably smile up in your face\nBut I know you niggas phony cos there's sweat up in your shake\nNigga jealousy, how easily niggas forget\nUsed to walk thrugh the hood, nigga didn't have shit\nI just hussled off the corner, and I stacked a couple chips\nThen I hit the parking lot, with that brand new whip\nHow you love that, ain't you supposed to smile for me?\nWhy you hate that? oh you playing high for me\nThey say cut the grass and the snakes will show\nIs you niggas mad at me or do you hate my dough\nJust let me know\n\n[Chorus: Nipsey Hussle]\nIt's so hard out here\nBut I'm still breathing\nI said it's hard out here\nBut my nigga I ain't leaving\n\n[Verse 2: Nipsey Hussle]\nLookie\nWhen I was 15 my momma kicked me out and changed the locks\nHer husband used to beat on us and talk shit alot\nYou ain't my daddy, nigga I ain't gotta listen to you\nThen my momma switched sides like nigga, yeah you do\nI used to wanna stay away, used to hate to come home\nOutcasted from the family cos we wasn't his own\nNow that's scandalous, how'd you let him hit me that hard?\nNow that's scandalous, how'd you let your two kids starve?\nNo lunch money, was bummy and treated like a step child\nLet me loose on these streets, the nigga went wild\nNo direction, false concept of family\nQuick to bust the first damn burner that they handed me\nMomma these white folks'll never understand a gee\nCrying to the judge and they still reprimanded me\nUsed to wonder why you act like you always was mad at me\nWhen cuz was the issue but momma I forgive you\n\n[Chorus: Nipsey Hussle]\nIt's so hard out here\nBut I'm still breathing\nI said it's hard out here\nBut my nigga I ain't leaving"}], "artist": "Nipsey Hussle"}