{"songs": [{"year": "2016-07-12", "album": null, "image": "https://images.genius.com/89747f51a2ea47b1e099b29af353d1e0.1000x1000x1.jpg", "title": "Don’t Mind (Remix)", "lyrics": "[Intro: Pitbull & DJ Khaled]\nMr. 305 checking in\nIt's the remix\nKent Jones\nMust feel good to have a worldwide hit, huh papito?\nThis is, another one!\nWelcome to the club\nWe The Best Music!\n\n[Chorus: Kent Jones & Lil Wayne]\nKeep telling me this\nAnd telling me that (Yes, Lord)\nYou said once you take me with you, I’ll never go back (Moolah baby)\nNow I got a lesson that I want to teach ya (And this is)\nI'ma show you that where you from don’t matter to me (This is the remix, baby, yeah)\nShe said \"Hola, ¿Cómo estás?, she said \"Konnichiwa\" (This is the remix, baby)\nShe said \"Pardon my French\", I said \"Bonjour Madame\" (This is the remix, baby, yeah)\nThen she said \"Sak pase\" and I said \"N'ap boule\" (This is the remix, baby, yeah)\nNo matter where I go, you know I love 'em all\n\n[Verse 1: Pitbull]\nI'm surrounded by Caribbean queens\nI'm talkin' Cubans, Puerto Ricans and Dominican things\nI got Jamaicans and them Haitians, no un poco santi\nI got them Trini's and them Bajans and they all for me\nLet's not talk about the woman down in Mexico\nYeah they pretty but they could be cartel on the low\nSo ten cuidado, down in Brazil, they got booties for real\nThose Colombians are stunners, they got looks that could kill\nShe told me, “Ay papacito, ay mi rey\"\nShe said \"De dónde tu eres? I wanna stay\"\nI got my money for sure, got my passport for sure\nAs soon as she hit the bathroom, I hit the door\nI'm gone\n\n[Chorus: Kent Jones & Lil Wayne]\nShe said \"Hola, ¿Cómo estás?, she said \"Konnichiwa\"\nShe said \"Pardon my French\", I said \"Bonjour Madame\"\nThen she said \"Sak pase\" and I said \"N'ap boule\"\nNo matter where I go, you know I love 'em all\nShe said \"Hola, ¿Cómo estás?, she said \"Konnichiwa\"\nShe said \"Pardon my French\", I said \"Bonjour Madame\"\nThen she said \"Sak pase\" and I said \"N'ap boule\"\nNo matter where I go, you know I love 'em all\n\n[Verse 2: Lil Wayne]\nBonjour mademoiselle, je m'appelle Lil Tunechi\nMight want cover your ears, cause Young Moolah, we boomin'\nI'm a savage, I'm a beast, I have sex on the beach\nAnd my ho speak foreign, and my plug speak foreign\nI pull up in something foreign, my bitch light orange\nI'm rockin' Ralph Lauren and some Chucks like Norris\nAnd these other ducks boring, and my bucks foreign\nCodeine in my urine so I'm snoring and ignoring\nWhen she telling me this\n\n[Chorus: Kent Jones & Lil Wayne]\nKeep telling me this\nAnd telling me that (Yes, Lord)\nYou said once you take me with you, I’ll never go back (Moolah baby)\nNow I got a lesson that I want to teach ya (And this is)\nI'ma show you that where you from don’t matter to me (This is the remix, baby, yeah)\nShe said \"Hola, ¿Cómo estás?, she said \"Konnichiwa\" (This is the remix, baby)\nShe said \"Pardon my French\", I said \"Bonjour Madame\" (This is the remix, baby, yeah)\nThen she said \"Sak pase\" and I said \"N'ap boule\" (This is the remix, baby, yeah)\nNo matter where I go, you know I love 'em all\n\n[Verse 3: Kent Jones]\nLord have mercy, I can't help but keep it G\nGrab your girls if you with them\nIf you ain't take the keys and go and get them\nWhile you at it get your mom so I can thank her for your courage\n'Cause you got them family genes and I love the way you fit 'em\nShe don't wanna leave, why? 'Cause I'm a true religion\nTell your friend to be my guest, and if she smart she know the rest\nI had way too much Belaire, and I'm quiet sure you can tell it\nTo be real I forgot your name, so I'm askin' how you spell it, you keep\n\n[Outro: DJ Khaled, Pitbull & Lil Wayne]\nFelicidades\nThis the remix\nAnd this is the remix\nIt's We The Best epidemic, epic!\nAnother one"}], "artist": "Kent Jones"}