{"artist": "Cage", "songs": [{"title": "Middletown, NY (Remix)", "album": "Purple Rain Mixtape Vol. 1", "year": "2004-06-06", "image": "https://images.genius.com/c61b13836692d4b169145fab7004533b.480x360x1.jpg", "lyrics": "[Verse 1]\nStraight outta Orange County\nGive a fuck how chain stores found me\nThis is choice, just so bitches and kids flock around me!\nFuck discussion, on the brink of bustin'\nDisgusting, in the front of the club!\nWith bullets lookin' for suction\nI count dough like enemies, even out the hood!\nSee Cage with two Uzis, my paper must be good!\nSucked the nuts through the head of my dick\nWalk slanted, then got two new mayonnaise jars implanted\nHaters scapegoats with no plugs, could be legendary\nBut, stay too broke, and a client cemetery\nNewburgh!, shut it down\nMiddletown!, run it now\nPK!, they comin' out\nKingston!, Queens running mouth!\nAin't shit in Sullivan but gambling and A.I.D.S\nOnly Monticello dogs runnin' shit is at the raceway\nYour face spray out, two of these for the nine\nBefore there's Hells Winter there's Movies for the Blind\n\n[Hook]\nMiddletown, New York, where I learned to walk and talk\nAll the biggest willys been killed or caught\nYou fuckin' with music you get no support\nEven local athletes think hand to hands a sport!\nI was raised on dirt weed and cheap liquor\nWatch the same hand that shake mine peel off the sticker\nThe brand new album got hate more alive\nCause I shit on every MC in the 845\n\n[Verse 2]\nMust have been drugged in my sleep, by agents sent to edit\nWoke up underground with machines they can't rep it\nWith a PCP method I smoke the dead's misery\nThen rob the corpses to add insult to injury\nMy hand in the same evil that mark Middie\nNever seen so many fuckin' sons in a dark city\nI bark witty\nPity no soundtrack to bust cops\nSo I push the envelope like 90's dust spots\nStreet clean up, put you best team up\nY'all crack dealers trying to rock with no re-up\nIn a sedan, or coup, or truck, it's buck a Trooper\nState or local like it's yesterday, fuck the future\nChrist like anarchist, games evolve\nGet it? you want a clip but I came revolved\nClips involved? I see 'em out then quick\nThis ain't fag music, but y'all suck my albums dick!\n\n[Hook]\nMiddletown, New York, where I learned to walk and talk\nAll the biggest willys been killed or caught\nYou fuckin' with music you get no support\nEven local athletes think hand to hands a sport!\nI was raised on dirt weed and cheap liquor\nWatch the same hand that shake mine peel off the sticker\nThe brand new album got hate more alive\nCause I shit on every MC in the 845\n\n[Outro]\nI'm sayin' man, 62 counties man, only 8 is being repped!\nNYC got five, LI got 2.. Westchester county\nThat's 54 counties I'm holdin' down by myself\n'n' I ain't shittin' on y'all I got love for y'all\nIf I dare y'all to come out, I dare y'all to make records\nI got my money on misery!\n\nOff the banks!\n\nCamu Tao.."}]}