{"songs": [{"year": "2001-04-03", "image": "https://images.genius.com/ec46798fa54e4b0eead636c38046b017.300x293x1.jpg", "title": "How We Roll ’98", "album": "Endangered Species", "lyrics": "{*dice being shook up and thrown, i.e. \"Tumblin Dice\"*}\n\n[Big Pun]\nYou know I'm well known like Al Capone, fully blown like Ton' Montana\nIn a zone, sittin on chrome, stoned sippin on cham-pagna\nRollin ganja up in bible papers, see how high the lye can take us\nThrough the eyes of Christ, John, Elijah, Jacob\nI make the kind of green a hustler dream\nBustin out the custard cream Viper\nCustom piped up with the mustard seams\nClustered green Fort Knox and hard (?) medallions\nMockin God even Italians see my batallion pull out the broad\nI got the +Squad+ over-qualified, pullin over Karl Kani\nRange Rover tilted, three-wheelted hydraulic slide\nSparkin lye in the clouds and reppin my housin\nLike the Wu do in Shaolin\n\n[Hook: A. Rios, C. Rios, V. Rios, Veronica]\nThere's something I want to tell you (I want to tell you)\nThere's something I think your crew should know\nBig Pun is the largest (so large) we straight out of the projects\nThat's how we roll.. (that's how we roll..)\n\n[Big Pun]\nI keep my Desert Eagle cocked back in my tuxedo with my top hat\nWhat you broke motherfuckers know about that?\nLookin fat in Marc and Pelle leather like Fonzarelli\nSparkin Phillies with the Gods like Makaveli\nOn the celly blown Benz, chrome rims\nShinin like the stone gems on my gold rings\nI got it sewn Twinz, I can't begin to tell you the story\nThat soared me from livin poorly to a modern day Cinderfella\nI've been a killer and a drug dealer, a bugged nigga\nBut now I'm like Puffy cause money's thicker than blood player\nI'm still a threat but now I think before I flip\nCall my connects together\nAnd figure which cleaner's the best for the hit\nI get the job done, Pun's handlin business\nCandlelight dinners, havin a toast with the most glamorous bitches\nMy road to riches was no Christmas\nNow we blessed with gold Lazaruses\nSo expensive my whole family's religious\n\n[Hook]\n\n[Big Pun]\nAiyyo I want it all you can call me greedy and superficial\nLong as my crew's official and pulls they pistols soon as I whistle\nI'm tryin to triple a million and split it three ways\nJoe the God, Full Eclipse, and myself - that'll be the day\nI need a way to get it already got the ambition\nStart the ignition, watch for the NARCs in the marked Expedition\nI'm on a mission which requires a higher position\nDesire and vision keeps the fire inside of me glistenin\nI'm infinite like math, so I'm gonna last\nBut you wanna laugh all day, bullshit and sittin on your ass\nI'm all about cash and the power\nA stash with the power that lasts like hittin ass for an hour\nLet's get it locked, I want a watch with baguetted rocks\nSo I can clock hoes with the glow that never stops\nForget the cops, we got Deserts and Glocks too\nReady to rock whoever tryin to stop our cheddar from stockin forever\n\n[Hook] - 2X (*with variations*)\n\n[Big Pun]\nStraight out the PJ's Twinz, Soundview!\nCastle Hill, can't forget Bronx River\nLil Villes.. huh, the Forest Projects, Eden Wald\nBronxdale, the Bronx baby straight out the PJ's\nThat's where we from"}], "artist": "Big Pun"}