{"artist": "Yama Buddha", "songs": [{"image": "https://images.genius.com/dbaaacf046e3baf26a934e5d4881fcc7.630x630x1.jpg", "year": "2012-05-03", "album": "Ekadesh", "lyrics": "[Verse]\nMandem wanna talk shit\nBut never listen the perfect definition of what a fool is\nA ruler Yama Buddha the rudest\nI always end up winning when I lose it, mad temper\nCan’t read the tracks off a cd like a bad sector\nI’m deep like lazy, bring heat like crazy, the beat like ya baby, mother’s life, I wrecked her\nPoor shots, bad director\nYou hope to be dope could never cope with the pressure\nI’m bringing back the crack the rap resurrector\nAllow it! I’m fresher\nIf it’s on I break bones you go home on a stretcher\nYes, sir! that’s how I do\nComing at ya straight outta Kathmandu\nThink before you risk it, don’t get it twisted\nY'all pigs sick 'cause of swine flu\nMind you! the most wanted\nPlus the flow is so supersonic\nHeaded for the summit, yeah, it’s ironic\nAnything to everything you dream I done it\nYeah! I’m on it\nYou think you the guy but you miss when you try\nReal talk! ain’t done shit in ya life\nAll that you been spitting are lies\nYa vision is fucked up like dick in ya eyes\nI’m elegant, equipped with required elements\nThe most definite to make you sink like sediments\nI meditate over the beat 'til I levitate elevated to the peak\nCelebrate better state 7 days of the week, a renegade never late generating the heat\nDemonstrate better ways to resonate the spit, relegate, decimate the best in the bizz\nA delegate renovating the shit, never hesitate, devastate while taking a piss\nLook! we shut down the best of parties\nDon’t like me? I’m ya girls best artist\nWhile you ain’t making a move, you parking\nI push ignition like Sash Car Key (Karki)\nYB on a beat and it’s over\nYB acapella, still over\nBring heat like squeezing a toaster\nFeed on MCs like an eating disorder\nGet deeper than the navy be\nCouldn't suck if I wanted like a baby Bee\nYou bound to fall off like baby teeth\n'cause writing a verse takes you 80 weeks\nAnd still all you rap is ABC\nCouldn't spit sick with rabies please\nAnd since ya bitch got laid by me\nI heard now you guys barely speak\nShit! You ain’t a match\nTryna change the fact that you lame and wack\nDickriding too much got ya anus packed\nFlames I rap off the top 'til my brains is ash\nLook! I come alive in the night time\nGo hard like the fuck of a lifetime\nRock the show as you watch from the sidelines\nRun the underground flow like a pipeline\nUse my mind kinda like Einstein\nOn a doper addiction than white lines\nI thought ya crew warned you with a high sign\nI get more viewers than prime time", "title": "KTM Grime"}]}