{"artist": "Awkwafina", "songs": [{"title": "Inner Voices", "image": "https://images.genius.com/6abf1cbfe69e3cea76524b6fcfdce65d.500x500x1.jpg", "album": "In Fina We Trust", "lyrics": "I got ice on my wrist\n6 bitches in a two-seat whip\nGot yuan, got won in the grip\nI don't give a fuck, straight shitting off a ski lift\nNah\nI'm about the biz\nAll these white girls\nMan they 'bout to fizz\nBut I don't really mind so I sign some tits\nTake a pic, but bitch, why you naked in it? Uh\nAnd I got cash in the bank\nMillion dollar baby on my Hillary Swank\nOn my MK, got fuel in the tank\nGot juice in the drank, but they all shooting blanks\n\nHold up\n\n[Voice-over: Awkwafina]\nAre we alone in this world?\nAre we on the precipice of nuclear war?\nDoes Susan Boyle have feet?\n\nI got a million bitches\nIf you fuck with me, get a million stitches\nPussy so wet that it swim with fishes, grant you wishes\nPlus you know it tastes delicious\nYeah\nPussy supercharged\nDidn't want a yacht, so I bought a barge\nMoney so long, that it's extra large\nTesla cars, give a fuck who you are, whoa\n\n[Voice-over: Awkwafina]Remember that time I said I had a Tesla?\nDo you think that they know that I really don't have a Tesla?\nMatter of fact, I don't even know how to - good management skills\nI don't want to start a Roth IRA, because  I don't want to give my money to Bernie Madoff\nIsn't Bernie Madoff dead?\nHe's dead, right?\n\nNah\nThat motherfucker not dead, he in jail getting booty rammed by the feds\nGetting tossed by a dude named Big Ed\nIn a hotbed, eating ramen noodles and crying\n\nBut anyway I got a million in the bank\nNo you don't\nYes I do bitch, how the fuck would you know?\nBroke ass bitch (x4)\n\n[Voice-over: Awkwafina]\nOK, you done?\nIs this bitch done yet?\nOh shit...\n\nMeanwhile I pull up in a Caddy on Addy with a fly mixed daddy with a fatty\nAnd he loves that I'm 5'5, 103 pounds\nAnd he loves my voice, and its soothing ass sound bitch\n\n[Voice-over: Awkwafina]You are 5'2, 130 pounds\nAnd also I don't know how you're buying cars when you literally applied for a BestBuy card and got declined on the spot\nYou're a fucking asshole, ok? You're an asshole\nBitch I'd rather be an asshole than a...\n\nBroke ass bitch (x4)\n\nI fucking hate you, I hate you", "year": "2018-06-08"}]}