{"artist": "Casey Veggies", "songs": [{"title": "It’s All Good", "album": "Customized  Greatly Vol. 2", "year": "2009-08-22", "image": "https://images.genius.com/1a029e524a5e116fb4512ade4b883627.756x720x1.jpg", "lyrics": "[Verse 1]\nYou know I'm just chillin'\nYou know they can't tell me nothing\nExcept it's good and the shit I just dropped is buzzing in the hood\nYeah them niggas anxious to hear it\nFairfax nigga with an Inglewood spirit\nAnd no I never fear shit\nCuz that car hit me in the rear quick\nBut I didn't lose\nThank God for that\nI think he sent me a gift\nCuz every time I look Rogue sending me some new shit\nThey ask why I'm DTA\nCuz I look 'em in they face and I can tell that they fake\nI'm mixing up the dough cuz I'm all about the cake\nThey all about the hate\nGirls wanna date, but I got one I really love\nSo they gotta wait\nBut me and her gon' be forever so their chance will never come\nIt's just step by step, in the best I crept\nSo as I sneak up, getting messages, some dudes want a feature?\nBut I feel like Drake, man \"no means no\"\nThey say I'm a young nigga with an OG flow\nAnd the hate start building the more we grow\nAnd the better that I do man the more people, show love\nEnough is enough, the flow so dangerous\nYou weak rap cats cannot hang-hang with us\nSay my name can't budge\nThis is everywhere, yo you never there\nMan I'm right here\nSo homie where you at? Tell a hater get back\nBut I don't really care\nGet the crowd like yeah\nSo yeah let's do it, this that new shit\nY'all cats clueless\nCuz this about to happen just off rapping\nIt really got me laughing\nThink so much man I really need an aspirin\nSo what is they really asking? I got all the answers\nI got all the answers\nI said I got all the answers\nI got all the answers\nI got all the answers\n\n[Hook]\nChilling in the hood, but it's all good\nYeah it's all good\nI'm kinda misunderstood but it's all good\nYeah it's all good\nThey ask me how is the wood I'm like it's all good\nYeah it's all good\nMy girl says I don't treat her like I should but it's all good\nYeah it's all good\nI got some growing to do man, but it's all good\nI said it's all good, yeah it's all good\nI said it's all good, yeah it's all good\nIt's all good\n\n[Outro]\nMan... tired as hell\nAnd I got school tomorrow\nMan what time is it... 1:55 in the morning\nStudio\nNeed to go home, and I got homework?!\nDamn\nOh well, it's all good"}]}