{"songs": [{"album": null, "image": "https://images.genius.com/6efed4f2f043ca2d708512a157481569.720x720x1.jpg", "year": null, "title": "Bartender (feat. Akon) (Promo Only clean edit)", "lyrics": "T-Pain\nYeah...\nUh-Huh...\nYeah...\nYeah...\n\nBroke up with my girl last night so I went to the club (so I went to the club)\nPut on a fresh white suit and a Mini Coupe sitting on dubs (sitting on dubs)\nI'm just looking for somebody to talk to and show me some love (show me some love)\nIf you know what I mean... Uh-Huh...\nEverybody jockin' me as soon as I stepped in the spot (I stepped in the spot)\n200 bitches and I'm bettin' ain't none of them hot (ain't none of them hot)\n'Cept for this pretty young thang that was workin' all the way at the top (all the way at the top)\nShawty what is your name?\n\nOooo she made us drinks, to drink\nWe drunk 'em, Got drunk\nAnd then I think she thinks I'm cool\nShe gave me a wink, I winked back\nAnd then I think that, we hit it off something proper like...\n\nI like the bartender\n(Oooo If you're lookin' for me)\nI'm at the bar with her\n(Uh-huh, Ok)\nI like the bartender\n(Yeah if you're lookin' for me)\nI'm at the bar with her\n(Oooooh Uh-huh, Ok)\n\nGot a brand new girl so I'm feeling all good inside (all good inside)\nFeel like I put some brand new 24's on a brand new ride (on a brand new ride)\nTriple shot of patron on the rocks with little bit a lime (with a little bit a lime)\nI'm just keeping it real (Uh-huh)\nBaby still working at the club so I'm getting in free (so I'm getting in free)\nWednesday night I'm on the list T-Pain plus 3 (T-Pain plus 3)\nEverytime I hit the spot baby girl taking care of me (taking care of me)\nHow do you think I feel?\n\nOooo she made us drinks, to drink\nWe drunk 'em, Got drunk\nAnd now I know she thinks I'm cool\nShe gave me a wink, I winked back\nAnd then I think that, we gonna have fun at my spot tonight...\n\nI like the bartender\n(Oooo If you're lookin' for me)\nI'm at the bar with her\n(Uh-huh, Ok)\nI like the bartender\n(Yeah if you're lookin' for me)\nI'm at the bar with her\n(Oooooh Uh-huh, Ok)\n\nAkon\nShorty I'm sure you heard that I rarely ever come out (ever come out)\nUnless I'm in the M6 doing tricks freeway burnt out (freeway burnt out)\nGot a passenger side that's empty wanting it to be your spot (be your spot)\nPut you on my billboard we can act like the charts I can end up on top (end up on top)\nDon't smoke don't drink that's why I don't be by the bar baby (baby)\nJust lookin' at you from a distance looking like a goddamn star baby (baby)\nSo my girl don't see me T-Pain can I get those keys to the car? (those keys to the car?)\n'Bout to go and Bang Bang Boogie with my cutie and I'll see you tomar' (see you tomar')\n\nT-Pain & Akon\nOooo she made us drinks, to drink\nWe drunk 'em, Got drunk\nAnd now I know she thinks I'm cool\nShe gave me a wink, I winked back (Uh-huh)\nAnd then I think that, (Uh-huh) we 'gon have fun at my spot tonight... (Oh yes)\n\nT-Pain\nI like the bartender\n(Oooo If you're lookin' for me)\nI'm at the bar with her\n(Uh-huh, Ok)\nI like the bartender\n(Yeah if you're lookin' for me)\nI'm at the bar with her\n(Oooooh Uh-huh, Ok)"}], "artist": "T-Pain"}