{"songs": [{"lyrics": "[Intro: Dr. Dre and MC Ren]\nAh yeah, yo Ren, yo ready to do this shit?\nYeah, Dre, let's rip shit up\nHey yo, Yella Boy, why don't you kick me one of them funky ass beats?\nYo, we got my homeboy Eazy E in the house\nYeah, Compton's definitely in the house\nYo Ren, what we gonna call this shit? Tell 'em what yo name is\nYeah something like that\nAlright, let's kick this shit on the one\nKick it\n\n[Verse 1: MC Ren and Dr. Dre]\nBack by demand, now it's big as fuck\nBecause you as the public, you should know what's up\n\"Compton's in the House\" was more than gold, it was a hit\nCause it was based on some crazy shit\nSo our final conclusion has been permitted\nPunks made us a target and knew that we'd hit it\nBut that was a part of showbiz\nHey yo, homeboy, why don't you tell 'em what your name is\n\n[Verse 2: MC Ren and Dr. Dre]\nWell for the record it's Ren, and for the street it's villain\nAnd strapped with a gat, it's more like Matt Dillon\nOn \"Gunsmoke\", but not a man of the law\nI'm just the baddest motherfucker that you ever saw\nSee, I peep and then I creep on a fool\nGet my blood pressure high, but still stay cool\nDig a grave of a nigga lookin' up to me\nThat really had the nerve that he could fuck with me\nWho was the man in the mask, while I was waitin' to ask\nYou know, it's MC Ren kickin' mucho ass\nGettin' respect in showbiz\nHey yo homeboy, what's up?\nWhy don't you tell 'em what your name is?\n\n[Verse 3: Dr. Dre]\nDre, the motherfuckin' doctor, bitch hopper\nThe sucker-motherfucker stopper\nBack with a vocal track that's a fresh one\nSo now, let's get the motherfuckin' session\nGoin', flowin'. It's time to start throwin' - rhymes\nSo keep in mind all the suckers I'm blowin'\nCause I'm a start showin' the time\nNever sayin' I'm the best and just goin' for mine\nUnlike a lotta suckers who claim they're gettin' busy\nWhen their records only make good frisbees\nYou need to quit runnin' off the mouth\nStop and think before you put some whack bullshit out\nIt's not difficult, in fact it's kinda simple\nTo create something funky that's original\nYou either talkin' 'bout the place to be\nWho you are, what you got, or about a sucker MC\n\n[Interlude: Dr. Dre and MC Ren]\nOh yeah, that's what I'm talkin' about, Ren\nYou know what I'm sayin'?\nYeah, I know what you're sayin', Dre, but you still ain't told 'em enough, man\nAlright, alright\nWell, let's kick one more verse right here, alright\nKick it\n\n[Verse 4: MC Ren & Dr. Dre]\nThis is portable, something to fuck with yo ear\nRen and Dre will appear when the sound is clear\nTo fuck it up like we always do, and that's the trick\nSayin' some shit to make the bitches wanna suck our dicks\nBut it's an everyday thang\nCommunicating to y'all with the Compton slang\nCompton's back in the house and your appartment\nSo open your door, by the way, so we can start it\nTest the monitors and call this mic\nCause the way we feel, we're gonna fuck it up tonight\nI got my mic in my hand, with a hell of a grip\nBitches screamin' and shit, now it's a trip\nWaitin' for the grand finale, or the end\nOr stupid rhymes set by Dre and Ren\nWell, like a kid, we get new shoes and go faster\nSmilin', like hell, as we move past the\nSuckers, the motherfuckers with the ego hype\nWell we're positive and they're on a negative type\nAnd if think we're about to quit...\nMotherfucker you ain't heard shit\n\n[Dre]\nYeah, that shit was funky, you know what I'm sayin', Ren ?\n[Ren]\nI know what you're sayin', this is MC Ren and Dr.Dre\nCold kickin' it in the place\n[Dre]\nAh yeah, my mellow Eazy E in the house\nYella Boy in the house\nMy boy Ice Cube\nArabian Prince cold rockin' shit\n[Ren]\nOh yeah, hey, I'm a say whassup to my homeboys from CMW\n[Dre]\nYeah, hey, yo Ren, whatta we gonna call this shit?\n\"Tell'em what yo name is?\"\n[Ren]\nYeah something like that...", "album": "Straight Outta Compton", "year": "1988-08-08", "title": "Something Like That", "image": "https://images.genius.com/0ec6f769fde231f68fadfff699d2b94c.1000x1000x1.jpg"}], "artist": "N.W.A"}