{"songs": [{"year": null, "image": "https://images.genius.com/1b31ad67295bb0511098a70dac4665f9.700x700x1.jpg", "title": "Poet Has Come", "album": "Rewind: Deja Screw", "lyrics": "[Intro]\n\nLadies and Gentlemen, We got Queens-Bridge finest up in this motherfucka tonight\nThey just came from a war, they wanna let you know a lil' somethin' about where they come from\n\n[Verse 1: Blaq Poet]\n\nSurprise nigga, Poet laser beam spitta\nI'm from The Bridge, Queens nigga\nOne of the last real mean niggas\nBack up, I'm hype and I'm in\nI'm on some shit\nI still consider Tyson a champ\nYall niggas is puss\nType of niggas, niggas get mushed\nCan't wait to introduce ya ass to my foot\nI'm comin through like I told all my dons I would\nI'm coppin that brick, I'm makin sure them guns is good\nThat's some other shit I really shouldn't be rhymin' about\nBut fuck it, I ain't holdin' nothin' I put my time on the block\nI leave it all for my real ??? dogs to do\nWhile I, break raps in two and rep for the screw\nYear Round's the label, The logo's a calander\nI'm Blaq Poet, destroying all challengers\n\n[Hook]\n\nYa niggas better run\nIm number one don\nTime for action\nPoet has come\nYa niggas better run\nDon't matter where you from\nGo tell everyone\nPoet has come\n\nX2\n\n[Verse 2: Blaq Poet]\n\nPoet has come to do niggas dirty\nYa son of a bitches I don't like none of them niggas\nI seen 'em in the magazine frontin' in pictures\nWith them video hoes, but they ain't fuckin them bitches\nPoet has come to lead yall niggas\nHip Hop is starvin' I came to feed yall niggas\nPoet has come to show you who's the best at this\nI'm wreckin' shit\nNigga I perfected this\nI let my dog take a shit on ya front yard\nPull out the Mack, and go straight retard\nI got the bitches sayin, \"Damn, he look too hard!\"\nHe might beat the pussy up\n\"Oh child Lord!\"\nYall niggas don't understand how I'm comin' at it\nMy formula's quadratic\nContra-postive\nMy shit is too deep, even for you college kids\n[FIRE!] That's how hott it is\nThrow the shit on and watch heads bop to this\n\n[Hook]\n\nX2\n\n[Verse 3: Blaq Poet]\n\nI got Preem with me, NYG'z with me, M.O.P. with me\nTeflon, Krumb Snatcha, and Bun B with me\nWho's with me?\nGoons with me\nI fools with me\nRave Roulette\nGet drunk and act a fool with me\nNew York City we got that real grime gritty\nAnd I want yall to love me, Like yall love [Biggie]\nAin't no other kings in this rap thing is right\nThe crown is always and forever, Frank White\nSo fuck yall niggas\nPut the mask on, stick yall niggas\nThen act like, yo who stuck yall niggas?\nI'm the foulest nigga you gon' ever meet\nName bang on every street\nScrewball, who hah hold heavy heat\nYou better prey to God we don't never meet\nLeave you slumped over the wheel, blood on your leather seat\nBrains on the passenger side of the window\nFuckin' with that ho, didn't get a chance to hit the dro\nThis is for the non-believers\nNiggas want beef?\nNiggas got to meet cleavers\nNiggas want drama?\nNiggas got the street sweeper\nNiggas wanna squash it?\nFuck you, you get the finger\n\n\"The Bridge...Queensbridge...\""}], "artist": "Blaq Poet"}