{"artist": "Cardi B", "songs": [{"title": "Sauce Boyz", "album": "Gangsta Bitch Music, Vol. 1", "year": "2016-03-07", "image": "https://images.genius.com/601a7e41bb97e7847f63a7476ed08eb0.500x500x1.jpg", "lyrics": "[Intro]\nI hate when I'm using a guy and shit and they start catching feelings and like no matter what I tell them like they just don't stop liking me. Like I be like listen I'm a hoe I don't cook I don't clean like trust me you don't want me to be the mother of your kids. I don't like mother-in-laws and they just be on some sooo you don't gotta meet my mom. Like nigga you don't fucking get it though?\n\n[Chorus]\nI dont do no sauce niggas (lil bitch)\nPop a pill I abort niggas (lil bitch)\nAnd I don't save them I export niggas (lil bitch)\nYou niggas ass salad tossed niggas (lil bitch)\n(Repeat)\n\n[Verse 1]\nAlways talking about what you got so what you got\nAlways talking about you run that block nigga really what block\nAlways talking about your shooters ha, so who y'all shot?\nAlways talking about your foreign whips nigga, really what lot?\nAlways talking about y'all niggas scam okay you scam\nBut your bank account got 0 dollars, so what's the plan?\nBoy you lying using hella filters this ain't the gram\nBoy I'm hot I use you to cool me down nigga use the fan\n\n[Chorus]\nI dont do no sauce niggas (lil bitch)\nPop a pill I abort niggas (lil bitch)\nAnd I don't save them I export niggas (lil bitch)\nYou niggas ass salad tossed niggas (lil bitch)\n(Repeat)\n\n[Verse 2]\nSome of you niggas is really too soft\nI do y'all like frisbees you niggas get tossed\nAlways emotional blinging my line go find Nemo and nigga get lost\nCannot talk spicy cause you are not hot\nYou are just sauce\nYou bought me a chain, a ring, and a watch but how much it cost\nIt's not expensive then he is a not I'm cutting him off\nThey be like Cardi why you so cold nigga I don't defrost\nAnd I mean it y'all fiending why you scheming\nYou sauce you false won't comment I red beam him\n\n[Chorus]\nI dont do no sauce niggas (lil bitch)\nPop a pill I abort niggas (lil bitch)\nAnd I don't save them I export niggas (lil bitch)\nYou niggas ass salad tossed niggas (lil bitch)\n(Repeat)"}]}