{"artist": "Pusha T", "songs": [{"album": "King Push – Darkest Before Dawn: The Prelude", "title": "Darkest Before Dawn: Short Film (Script)", "image": "https://images.genius.com/456d2c1e7b1dc2d52a08c5840820861b.1000x1000x1.jpg", "lyrics": "NOT FINISHED SCRIBING!G.O.O.D. Music angel logo fades in and out. Opening credits fade in and out as scenes play, reading: \"G.O.O.D. MUSIC PRESENTS. A FILM BY: KID ART. PUSHA T. ROTIMI, NATALYA RUDAKOVA. GEORGE KATT, JOE, GIOCO, MIKE TROLL\"\n\nBlue lightning flashes. CUT TO: Lamp flashes in a dark orange room. PUSH lays on the carpet. He walks up the walls. PUSH and the PRIEST narrate elsewhere\n\nPRIEST: Nightmares again?\n\nPUSH: Yeah.\n\nPRIEST: Same one?\n\nPUSH: Same one.\n\nCUT TO TEXT: KING PUSH. DARKEST BEFORE DAWN. Thunder rumbles.\n\nCUT TO: HIDEOUT\n\nCUT TO TEXT: PRODUCED BY GRANT CURATOLA\n\nCUT TO: HIDEOUT\n\nCUT TO: television scene that displays lions.\n\nTV: At a striking distance, the movement that crossed its natural boundary. See them lose their confidence and abandon pursuits.\n\nCUT TO TEXT: \"EXECUTIVE PRODUCERS JEAN MOUGIN, SEVEN VICTOR, SHIVAM PANDYA. CO PRODUCERS CARTIER COURT, TAYLOR SHUNG. WRITTEN BY CARTIER COURT.\" Storm rumbles. \"DIRECTOR OF PHOTOGRAPH: J.J. RICHARDS\"\n\nTV:[?] they all begin to reunite\n\nPUSH and MANNY count hundred bills as ACE watches TV. TV displays a lion close-up.\n\nMANNY: (Tsk) Yo man, put the game on, man! Throwing my countin' off with all this giraffe shit, man.\n\nOn the screen, two lion cubs fight. \"PRODUCTION DESIGNER DANICA PANTIC\". A lion cub chases and bites down a bull. \"EDITED BY KID ART\".\n\nPUSH mutters numbers to himself. Thunder rumbles.\n\nMANNY: Do you not hear me, muthafucka? Oh, oh okay. So I got to go talk to...(laughs) this nigga...So I got to talk to Felicia to make sure you listen to me so you, you know, since she basically tells you-\n\nACE: Shut the fuck up, yo. Shut the fuck up...about Felicia...\n\nMANNY: Whatchu mean? You know I gotta get you guys to listen to me, you won't ever listen to me.\n\nACE: You know where the joints at, huh?\n\nMANNY: I got joints.\n\nACE: You ain't got no joints.\n\nMANNY: I got no joints?\n\nACE: They not messing with you like that right now.\n\nMANNY: So some Maria bodies for me?\n\nACE: No, Maria light-skinned. Way back then, she was...\n\nPUSH laughs and looks at screen. Screen displays two lion cubs pinning a goat.\n\nMANNY: Leave them lions alone. Make yourself useful.\n\nACE: I'm watching some information\n\nMANNY: Shit, information nigga? Ha! This nigga, you watching the same shit three times in a row, bruh\n\nACE: I'm learnin' somethin', I'm learnin' somethin' (Points at own head)\n\nMANNY: You learnin' somethin'?\n\nACE: If you get up out the house, maybe you can learn something.\n\nMANNY: Yo, ok. Alright. Feliiica! Felica!\n\nACE: Mutters something and shakes head'\n\nMANNY: You really salty. Feliii-\n\nSirens wail. MANNY, ACE, and PUSH get up and run. Cut to ACE running upstairs. \"DIRECTED BY KID ART\". Cut to a siren on the ground. Radio sounds. Someone kicks the siren.", "year": "2015-12-17"}]}