{"artist": "Cadet", "songs": [{"title": "Closure", "album": null, "year": "2018-04-13", "image": "https://images.genius.com/2e9d9fe4ddbeb0f7c5e6ab55feb3d999.939x939x1.jpg", "lyrics": "[Intro]\nAy yo, put the beat on\nBoom, pain, underrated legend, pain, pain, pain, pain\nWallahi this is all true, it's all true still\nIght, look\n\n[Verse]\nSo a big part of my life has been chicks\nI know I can't lie about that\nAnd if I keep it real\nI never thought again I'd have to write about that\nSee, word I was still in love when I wrote \"Slut\"\nJust words, them scars weren't closed up\nBut since it gave me exposure, it's only right I tell you my closure\nSlut\nMan I was so real to the page, so real to the extent that\nMan I even used real names, Cherise she text me once on a mad ting\nTara kinda treats me like a germ and the girl that done the monkey bar ting\nWell, well she's just doing her\nMan listen\nNot that same one that my last freestyle was about\nBut love from west to the south\nThought I was over the girl until I saw her out\nAnd family I was all shocked 'cause I've been thinking about this girl like every day in every way\nSo yeah of course we speak and numbers exchange and now I'm happy as fuck\nBecause now I'm back with the love of my life, doing all kind of shit like kissing on north while it was two o'clock at night\nA good guy now, I ain't hitting whenever\nEven crashed my car spitting together\nYou know when the kiss is perfect, come like puzzle pieces fitting together\nThat's when I told her \"Wait though, if we're doing this then we've gotta do this right\n\"I'ma tell you all the shit that I've been on the last couple years, there's shit you won't like\n\"But I'ma be honest and I'ma be real to the T\n\"I've gotta make sure some next girl can never come to you about me\"\nAnd that's when I started talking\nMan I told her all of the girls that I beat, all the problems with me\nThe one night stands and the girls that I met on IG\nBut when it was her turn she said \"There ain't a dream I can sell you\n\"And really my life's been boring, and there ain't nothing to tell you\"\nAnd man I believed her, maybe I was naive\nOr gassed that the girl I was thinking about for the last four years was by me\nAnd like that feeling it weren't gone away\nAnd her mum even took us on a holiday\nNow i'm deep in her an I ain't gotta ease in shit\nCouple months in, I've got the key to the crib\nBut, but then I got distant though 'cause I got that iffy vibe\nLike, I'll be catching her out telling silly lies\nLike, if you're my woman then why I gotta catch you out?\nAnd it's dumb shit, like shit you ain't even gotta lie about\nAnd this is when I turned into a fuckboy, man I can't lie man, I just weren't with it\nEven though I still loved her mad, something couldn't sit with my spirit\nNever called her beautiful once, no attention, her time I had none of it\nThe most I would do, pull up on a late night random one if I felt like cuddling\nAnd that's when I got that phone call though\nAnd you know how it goes like, like \"Blaine, there's something you should know\n\"I just took a pregnancy test, and look man, it came back positive\n\"And right now I can't have an abortion, looks like we just gotta get on with it\"\nAnd me I can't lie how I acted, it was all loose man, I started backtracking\nWhen I heard the word 'baby' I just panicked\nAnd asked her again \"Are you sure you wanna have it?\"\nAnd she said the doctors told her before that she can't have a baby\nSo the thought of having an abortion, na, na, having a yout' is all crazy now\nLook, see when a baby ain't planned\nThere's some stages you go through as a man\nThe first stage is na, she ain't having this yout', I gotta talk to her harder\nThe second stage is look man I gotta man up because I'm gonna be a father\nPull it off, I still told my mother, I'm thinking that she's gonna get mad at me\nAnd all she said was \"Blaine, do not bring a mad gyal in my family\"\nTold my sister but she weren't having it, and right now I'm excited\nBut anyway fuck that part, it's the second part that hit me like lightning\nI got a phone call out of the blue like \"Blaine where you at? And can you come round?\"\nAnd I said \"Now?\" and she said \"Now!\"\nSo I says \"fuck it\" and drove from South\nBlew until I pulled up to the crib, got in the lift, put the key through the door\nAnd all I can see is her there, with her arms around her belly on the floor\nI'm like \"Yo baby, tell me what's wrong?\" she's saying \"I've bled and my belly keeps hurting\"\nI keep phoning the ambulance over and over again but this shit ain't working\nThey pull up in what seems like forever, me I'm shocked, I don't know what it means\nWe get to the hospital, they take her blood, holding her hand waiting to be seen\nAnd then some young white lady steps in\nShe clears her throat and she looks up slow and says \"You're no longer pregnant\"\nAnd, man it kinda hit me in the worst way\n'Cause it happened like three days before my birthday\nNow, now me and her's back on track, but I can't like a real shot I ain't giving it\n'Cause I've got this feeling saying that I can't trust her, and look man, I can't get rid of it\nMan I gotta talk to her, I gotta talk to her, I'ma see her next week and that's when I'll talk to her\nI picked her up so I can drop her at airport, I said I'm tired so she can drive\nAnd I'm just there in the passenger seat and I'm looking at her square in the eyes\nAnd I say \"What I'm about to say, man I ain't tryna cuss you\n\"I really wanna make this work but I feel like I can't trust you\n\"And look I don't know what it is but I've got a feeling so deep in my ribs\n\"Months ago you was gonna have my kid and now I feel that the solution is to...\n\"Let me have a look in your phone, it might sound dumb and I might sound young but let me have a look in your phone\n\"Don't get it twisted, I'm grown but let me have a look in your phone\n\"I'll see nothing, I'll stop bugging, we'll get to trusting, we'll build something, you'll probably be cussing\n\"Like I told you there was nothing in my phone, and word on my life, I'll let that go\n\"But let me have a look in your phone\" and then she said \"No\" and I said \"Word? I swear you want me to take you serious, and word that's what I'm tryna do\n\"So, you've gotta respect how I'm tryna move\n\"Five years deep, you'll let that go, just to not let me look in your phone\"\nShe looked back with a worried and scared face and then she said \"No\"\nAnd look you see that kinda iffy, man I let that go so quickly, still went to the airport just to let her off\nAnd then I put my key right though the letter box\nLook, what was in her phone? Man I would never know\nBut nine times out of ten there was the maddest tings in her phone\nNow I get a phone call few days later, she's like \"Hi\", I'm like \"Waddup?\"\nShe's like \"Now you can look through my phone\" I'm like \"Shut up\"\nThree months after, I'm in Shoreditch, and I see her cousin\nAnd she pulls me to the side like \"I wanna talk to you about something\"\nAnd I'm like \"Calm, we can step out the bar, and me and you can go and speak in the car\"\nAnd she's like \"I don't talk to my cousin no more man, she takes things kind of far\"\nAnd I'm like \"Wait there, what do you wanna say to me?\"\nAnd she goes \"Uhm, shit, I don't know how to say this but, I don't really wanna say no dirt\n\"But when you was with her, she was chatting to a couple man, and there was this guy from work\n\"And when she was having his kid, she showed up to my crib 'cause she weren't sure like if it was yours or his\"\nAnd I said \"Wait there, how do you know?\"\nShe says \"On my daughter's life I know, and I'm only telling you because I don't speak to her anymore\"\nAnd I couldn't care about the cheating but the child shit hit me harder\nMan I got excited and I told my mum that I might not have been that father\nBut I guess I didn't know that lady\nAfter the miscarriage, shit got crazy\nShe looked back like \"Miscarriage, what?\" I said \"Yeah, she miscarried my baby\"\nShe said \"Wait there Blaine, are you sure?\"\nI said \"I saw her on the floor\n\"We both went to the hospital and they said that the child weren't there anymore\"\nAnd she said \"When this happen? Around the end of Feb?\"\nI said \"Yeah, how you know?\" she said \"Fuck man, these girls are dred\"\nI said \"Wait, what you mean?\" she said \"On my daughter's life I'm talking\n\"But in the middle of February, I took her to get an abortion\"\nSee gyal are fucked like that\nYeah man fuck up, but mans fuck ups ain't fucked like that\nAre you even clocking the play?\nSo the miscarriage and her being on the floor was all staged\nAnd then they ask why man's so bitter\nAnd man turned into your average nigga\nSaying how you can't trust these women, trust rudeboy, man it can't get realer\nBut if I learnt one thing out of this whole thing, you've gotta go with your gut\nBut you ain't gotta take my advice 'cause I'm just Cadet AKA The Slut\nYou feel me?\n\n[Outro]\nPain, Cadet Cadet Cadet Cadet, Pain\nCadet Cadet Cadet Cadet, Pain"}]}