{"artist": "Iamsu!", "songs": [{"title": "Holla At The Kid", "lyrics": "[Verse 1: IamSU!]\nI don't walk through the front no more\nLet me and all my niggas through the back\nGirl you ain't gotta front no more\nWhen you see me you know you don't know how to act\nI'm a heartbreak gangsta\nAnd I'm one of the realest niggas in the world\nAnd you know that I'm a bachelor\nLeave her alone, you know I'm goin to take yo girl\nSwitch up baby, work that body like a 9 to 5\nTalk bout money, we seein' eye to eye\nHad one way back up, but no valley high\nAnd the way I'm ballin, call me Allen Eye\nFirst I'm comin up at the risin'\nStand up, what is this the surprise?\nSaid I'm the realest one rhyming\nSince we gots to blow right by 'em\nNo lyin, niggas be playin but they can't keep up\nNice but, D cups, that's what keeps me up\n\n[Pre-Hook:]\nWhat's happenin'? I'm mackin'\nThat money, I'm stackin'\nYou know that I'm ballin'\nAnd you hate it, but don't folla, and she shakin'\n\n[Hook:]\nGo 'head and work that shit, girl work that shit\nGirl work that shit, girl work that shit\nGirl work that shit, girl work that shit\nGirl work that shit, girl work that shit\n\n[Verse 2: Jay Ant]\nHolla at the kid\nYep, it's what it do, not what it did\nUh, I've been in here for hella years\nBloodshed and the tears, uh\nMy family came from the Riches, yep\nI only came for the bitches, uh\nAnd I don't fuck around with snitches, uh\nBest believe they get stitches\nOr fuck around and die, nigga I'm fly, yep\nAnd I ain't never had to lie, uh\nWhy would I only want a slice?\nWhen I could have the whole pie\nYep! Real nigga what's happenin'?\nYou know I'm packin' what you lackin' uh\nI'm tryna get this shit smackin'\nSmoking loud, my nigga brought the whole package, yeah\n\n[Pre-Hook:]\nWhat's happenin'? I'm makin'\nThat money I'm stackin'\nYou know that I'm ballin'\nAnd you hate it but don't follla and she shakin'\n\n[Hook:]\nGo ahead and work that shit, girl work that shit\nGirl work that shit, girl work that shit\nGirl work that shit, girl work that shit\nGirl work that shit, girl work that shit\n\n[Verse 3: Mike-Dash-E]\nWork it like a pro\nBaby fuck me like an athelete\nKnow I'm getting bucks like my middle name Cashcrete\nYou ain't gotta asks, except for young girl I'm past it\nYou hit that pussy once and pass her off like bitch you last week\nGo 'head and holla at the kid, holla at the man\nI'm throwin up my 3, I'm rappin 3 up every track\nMiddle finger to these haters tryna plot, on me back\nWhy you busy speakin' on me? I proceed to check these racks\nOoooh, you forgot me, I'm a wake you up\nMy name been ringin' since the day's up\nTurn around, turn around, ain't no breakin' up\nBusy ridin' dollar, stayin' far away from takin' fucks\nNow it's time to take my cut, everything you put in bricks\nMoney money money, all I'm seein' in my vision stuck\nProphecy position, intuition never changing up\nLike every day my work, man I'm takin' up\n\n[Pre-Hook:]\n\n[Hook:]\nAYE!", "image": "https://images.genius.com/94db5c57f2d884ec0822605d037d542b.383x383x1.jpg", "album": "Stoopid ", "year": "2013-09-27"}]}