{"artist": "Inspectah Deck", "songs": [{"title": "Wooden Soldier", "lyrics": "[Intro: Inspectah Deck]\nYou know where I come from, (Know where I'm from)\n(It's that boy) Shaolin baby\n\n[Hook: Inspectah Deck]\nS.I.N.Y. 10304, S.I.N.Y. 10304\nS.I.N.Y. 10304, S.I.N.Y\n\n[Inspectah Deck]\nYes this shit is raw comin at your door\nYa start to scream out loud Wu-Tang's back for more\nYes the hours four, I told you before\nPrepare for mic fights and plus the cold war\nEverybody face down on the floor before Hell break loose\nLike Tom Hanks rushin the shore\nBrother man stay bout it for sure\nBig blades on the Escalade, Gettin paid bouncin on the law\nIt's only just a matter of time\nI'ma flat line your vital signs when I rat-a-tat with the rhyme\nDon't nah nigga do it like me, White tee matchin Nikes\nThe blue and white fifty-nine fifty\nI watch the city like my name's Bruce Wayne\nCounted loose change on a stoup hangin where my crew bang\nCertified live, Duckin the five\nWith two pipes like Wes Snipes bustin from the side\nSo serious like the Gods in Medina\nStreet sweeper buck shots, The quake off the rictor\nGotta have it, Brother Osh popped the 'matic\nSupreme team, Bags and beams, Rockin carrots\nCan't nobody stop my grind, Bottom line\nIf it's on I'll put a fool in a box for mine\nAnd I'm only gonna warn you once\nChew on this, Food for thought, Smash all your fronts\nAnd I'ma eat yall frauds for lunch\nChump ass niggas ball for stunts, We fuck broads in a bunch\nYou ain't gangst, Son your soft, It's evident\nFor my thugs doin life I'm forced to represent\nWatch the V12 sit on chrome\nThe same love I get outta town watch I get at home\nLeft shorty back blown when she hit that dome\nIt's like that when I get that jones, When I'm in that zone\nThis is for the die hard who ride hard\nIn every zip code switchin fresh cloths and fly cars\n\n[Hook]", "image": "https://images.genius.com/332d7e2910eb1b5cf57560340449c59a.698x700x1.jpg", "album": "The Resident Patient 2", "year": null}]}