{"songs": [{"year": "2016-07-03", "title": "Kanta", "image": "https://images.genius.com/bfaec1a0bac7ea0de2beca8ef167e036.500x500x1.jpg", "lyrics": "[Intro]\nYerr! kanta, kanta, kanta, kanta, kanta\nYeerr! kanta, kanta, kanta, kanta, kanta, yeerr!\n\n[Verse 1]\nHuh! Sika dɔɔso wɔ Ghana\nStill a yɛ hustle wɔ Ashaiman\nStreet foɔ ɛto Hosanna\nCos sakawa boys agye block no ɛdan ma\nMa ship-e me panamera just for summer\nCos aban sika die no koraa cause drama\n\nObi nkɔ kɔ bisa Braimah Kamoko sɛ\nNku no a ɔ use no primer\nPolitics, evil (yea)\nThey got no love for the people\nObi nse Ɔmanpanin sɛ me hia no\nSarkodie just wanna meet you\n\nSesei a deɛ cash no a lock-e\nNa companies akɛseɛ koraa mpo ɔmo a-chock-i\nNa wonhu sɛ Charterhouse koraa ɔmo a-pause-i\nMe charge-e me fees a obiaa ntumi n-sort-i\n\nThe industry, is falling\nCompany biaa eyɛ overhauling\nShatta paa first na balling\nBut sesei a ɔhu bottles koraa na dodging\n\nMe pɛ legitimate, no kuluulu\nBut after the privilege\nTo be used to the system in Ghana\nMe mia mani sɛ nka memmɔ korɔno\nBut sɛ mennyɛ a agye sɛ Yesu\n\nNow we just facing recession\nMy country is lacking progression\nSesei ah November election\nI hope sɛ the people go teach you a lesson\n\nI got love for Mahama and I’ve got love too for Nana\nYea! me respect-e leaders\nƐba bi biaa mɛka cos Sark dɔ Ghana\n\n[Interlude]\nYerr Kanta, kanta\nNow I think we gotta switch it up\nAre you ready?\nYerr…\n\n[Verse 2]\nTie! me tɔɔ dross wɔ Kanta, salmon, agushi ne hamper\nTerry me serɛ wo a bɔ mɔden a na girl na ɔkɔ ɔn-drop-e ne number\nSee me I’m far from a rapper\nMe no me swag yɛ dapper\n\nObi bɛ diss-e me a na ɛnyɛ rapper ɔde GTP ntoma pam kaba\nMe no me rap yɛ authentic\nJay-Z a ya mix-i with Kendrick\nNansa yi sɛ boys nni swag na sɛ ntaade no nnɔɔso a ɔmo claim-e afro-centric\nNtɔtɔfeefee wanna diss\nThe beat I run and push, onua wo yɛ bitch\n\nJoo na sɛ beef na wopɛ a, get your numbers up nyɛ sa a mɛ serve-e wo fish\nSmart move, ɔbɛ diss-e Obidi de a-promote-i album\nMea no me feel-i wo flow no nso ka nowerɛ wo nnwom nni kurom tesɛ Atom\nSark no go diss you for nothing\nNigga already you suffering\n\nMe n-waste-i me flow on a new beat ɛn diss-i and pay for production\nNiggas dey diss me for promo\nMaso ayɛ hye wɔ Toronto\nSee, I’ll help you for free but ɛfiri nnɛ korɔ no we [will] be working pro bono\n\nI gave you the highest retweets\nGave you some bars on the street\nI know you dey aim for my spot but you think my position be cheap\n\nOnly time you sound good is when you rap on your own\nMa feature wo twice, all you dey claim say you not in your zone\nMo ankasa mo ayɛ lucky, ma sieve me flow cos I’m grown\nNo be say n**ga no dey rap, he no dey qualify for the throne\n\nMe mete so, matwa me seven\nObidi mebɔ wo din a kyerɛ sɛ wobɛ kɔ Heaven\nFeeling na mede rap-e no na ma boy gye me di\nNti na obiaa pɛ sɛ otu amirika tesɛ me\n\nYea, TM boys Omar Sterling\nYea, we go drop the crown so God willing\n2040 na mentae nha adwene\nNti mɛyi mahenkyɛ na me da so afa adwene, hey!\n\nƐnyɛ aduro o, e be favour\nMy success go turn you into hater\nI got the keys, keys, keys, keys\nFocus and stack in your paper\n\nAt least I gave you some mileage\nJust make sure you use it\nPlease don’t you be disrespectful\nYour fans go dey always push you to prove it\n\nMa big-e wo up for the summer\nAll I need back is a thank you!\nOf course I go pass on the torch\nNigga but definitely ain’t you\n\nEi! akoa wei ne brɔfo akɛseɛ\nFa kɔ kɔ lecture wɔ Legon\nOh! punch deɛ ɔ-punch-i\nƐno ɛntɔ asaase gye kiosk wɔ Klagon\n\nYɛ a mo se Sark mpɛ beef\nYea, cos it doesn’t make sense\nHow can I rap to the world\nWhiles you, you dey rap to your friends\n\nApart from sɛ SarkNation rep-i me brand no\nNigga your fans be my fans\nTie, this is not a diss song\nI’m just tryna give you a chance\n\nSesei a madane philanthropist\nGiving you hype for free\nI made sure I show you some love\nSo say you niggas go see\nNyɛ sɛ ebia Sark is scared\nYou just don’t match up with me\nLike Ken Agyapong ne Afia Schwarzenegger\nThe beef no dey be!", "album": null}], "artist": "Sarkodie"}