{"songs": [{"album": "You Can’t See Me", "image": "https://images.genius.com/557d437bf932b93b08ec3950a791448a.600x600x1.jpg", "year": "2005-05-10", "title": "If it All Ended Tomorrow", "lyrics": "[Chorus: John Cena]\nWhat would you do if it all ended tomorrow?\nTime runnin out, ain't no more you can borrow\nSo many paths, which one you gonna follow?\nWhat would you do if it all ended tomorrow?\nWhat would you do if it all ended tomorrow?\nTime runnin out, ain't no more you can borrow\nSo many paths, which one you gonna follow?\nWhat would you do? What would you do?\n\n[Verse 1: Tha Trademarc]\nUh, this is how it go down\nI have the black-pound-silence so it don't make sound\nI pile a 150 outta town, ain't nobody around\nIm in the back seat breakin it down\nMy love has been a bad streak dawg lately I found\nOur press made us turn the radio down\nBut God bless now they talkin bout layin me down\nNow they on about shovels in the weight of the ground\nWhat now?\nPreachin on the way that they handle thing\nWatin patiently to do the 6-foot Sand Thing\nNow, so I take a second look at my life\nI made too many mistakes that I just couldn't make right\nShould've been more focused than I take things light\nWhen I'm gone this is what y'all will say I was like\nAn arrogant fool, no not that baddest or cool\nJust a big fish caught up in the shallowish pool\nNot a big name playa, in fact it's true\nNever would have been shit without the cats he knew\nHe got lucky rode the coattails of everyone's fame\nIn two weeks ain't nobody gon' rememba his name\nFuck It\nI'm ready to go, I done made records\nMade monetary off of the flow\nMore importantly though, I proved everyone wrong\nIt's all over regardless what you say when I'm gone\nWhat now?\n\n[Chorus: John Cena]\nWhat would you do if it all ended tomorrow?\nTime runnin out, ain't no more you can borrow\nSo many paths, which one you gonna follow?\nWhat would you do? What would you do?\n\n[Verse 2: John Cena]\nI want y'all to feel the wound, its the truth in my words\nI been quiet for too long, the truth should be heard\nIt was a while back, 10:20 in the morn'\nCat showed up on my lawn in a rugged uniform\nUnexpected, there's a knock on my door\nI met this fool in the club, I don' see him before\nOpen to greet him, but the second he sees me\nHis eyes buckle, his voice is uneasy\nBut it's cool, I didn't even catch it at first\nI check his shoulder, homie's rockin a purse\nNow I know something's tricky, but I'm already sittin down\nHomie pipes up, you should hear what he's spittin out\nSays I've been sleepin wit his wifey\nAnd he ain't the type of cat to take that shit lightly\nI made a move and he told me homie wait\nReached in his purse pulled a chrome 38\nHe asked me if I'm ready to die\nSaid he was gonna blow my brains all over the sky\nSaid he was leavin the country, and he was straight with the passports\nCocked the hammer, I'm thinkin my last thoughts\nI'm in a bad way, nothin could save this\nI close my eyes hopin it's painless\nJust waitin for the sound, ready to swallow too\nBut homie havin trouble with his follow through\nBy a miracle, I avoid the chalk ground\nHomie's confused, he just wanna be talked down\nHis wife is sleepin through town and he knew it\nPicked me outta the crowd but couldn't do it\nHe Squashed it, and as he's walkin away\nI realize life is short so I'm markin the day\nNow it's full speed ahead, I'll rest when I'm dead\nAnd I could give a Fuck what the next man said\nI live how I wanna live\nBuy what I wanna buy\nDo what I wanna do\nTry What I wanna try\nFear nothin, take chances\nNot afraid to fail, always makin advances\nSo when I ride on the Grim Reaper Highway\nNo regrets bitch, I did it my way\nYeah (yeah, yeah, yeah)\n\n[Chorus: John Cena]\nWhat would you do if it all ended tomorrow?\nTime runnin out, ain't no more you can borrow\nSo many paths, which one you gonna follow?\nWhat would you do? What would you do?"}], "artist": "John Cena & Tha Trademarc"}