{"songs": [{"image": "https://images.genius.com/0c2b6ab5b12521682ccf377202642c09.600x600x1.jpg", "album": "XXX", "title": "Pac Blood", "lyrics": "[Verse 1]\nThe Shakespeare of 16's, dipping my ink pen\nMade a sculpture of me but my dick was too thin\nPaint pictures of me but they never get my chin\nOne writing scriptures bringing tears to the princess\nEvery time I indent, you can see the intent\nLeave your mind bent, hanging on the every sentence\nHave no apprentice, style uninherited\nLaughing at you peasants cause my penmanship is excellence\nWhenever in the presence, eyes get wide\nI'm the town hero cause my words give them pride\nAnd what they feel inside, I say the perfect words for 'em\nSome say I'm a prophet with the visions I get cursed for\nLeave them all astonished, ride with the verbs\nMake a grown man cry with strength of the words\n\n[Chorus]\nTears to Mona Lisa, Medusa to liquid\nFlow can make Gandhi grab the burner, wanna shoot shit\nRhymes that make the Pope wanna get his dick sucked\nHad Virgin Mary doing lines in the pick-up\nMake Sarah Palin deep-throat 'til she hiccup\nHad T.D. Jakes round this bitch doing stick-ups\nRhymes so real, thought I wrote it in Pac blood\nTold me in my dreams that these niggas is not thugs\n\n[Verse 2]\nWhat's in the portfolio? Sicker than polio\nShit so personal, my mom can't listen to\nOh so original, nigga's extra-crispy\nBars so Bukowski, Soda Popinski\nLittle Macs could never be number one, your time's done\nBomb filling smelling like napalm, your day's gone\nLangston Hughes with a blew fuse and a screw loose\nMaya Angelou abused child with her notebook\nSpitting like Kipling with a tooth missing\nTongue bring torture to men, women and children\nMemoir's sacred, hid in the basement\nAwait my next piece at a formal engagement\nCrowds walk for miles just to hear that sound\nStart to get more power than the ones that wear crowns\n\n[Chorus]\nTears to Mona Lisa, Medusa to liquid\nFlow can make Gandhi grab the burner, wanna shoot shit\nRhymes that make the Pope wanna get his dick sucked\nHad Virgin Mary doing lines in the pick-up\nMake Sarah Palin deep-throat 'til she hiccup\nHad T.D. Jakes round this bitch doing stick-ups\nRhymes so real, thought I wrote it in Pac blood\nTold me in my dreams that these niggas is not thugs", "year": "2011-08-15"}], "artist": "Danny Brown"}