{"songs": [{"lyrics": "[Action Bronson]\nUh\nWaxy\nSmoking that Barbara Walters wax\nSame fucking outfit twenty days in a row I don’t give a shit\n\n[Verse 1 - Action Bronson]\nYou only came around ‘cause you thought I had some money for you\nYou got it fucked up\nThat’s for the kids\nAnd If there’s anything left I’ll cop a crib\nAnd If there’s anything left after that I’ll cop a six\nHow you think I got the art displayed on the dinner plates?\nFirst course was from the Finger Lakes\nLast course cinnamon ginger cake\nShe gave me head during the Laker game\nI got her tatted, trying to erase her name\nNo, I caught her cheating, her pussy didn’t feel the same\nShe was probably with one of the Broncos\nOr LeBron so I blew her car up\nSoon as she try to start it up, nah\nI can’t talk about that though…\nYour chance is thin like the moustache of Puerto Ricans\nShooting guns with my daughter on the weekend\nSmoke the budder same color as The Weeknd\nStashed under the sole of the sneaker *laughs\nFuck\nFuck man\nStashed under the sole of the sneaker\nSmoke the budder same color as The Weeknd\nUh\n\n[Verse 2 - Action Bronson]\nTold the driver Lenny swing me by the garden I gotta talk to Pat\nHit him with stacks\nShowed him the gat like ‘you gonna miss the finger roll right’\nFuck\nI Told the driver Lenny swing me by the garden I gotta talk to Pat\nShowed him some stacks\nThen showed him the gat like ‘you're gonna miss the finger roll right?’\nYes Mr. Baklava\nThen I cartwheeled into a aqua car\n\n[Action Bronson]\n*trails into laughter\nShit!\nIts too crazy right?\nYo\nIts just fucking nuts\nWe just talking crazy at this point\n\n[Verse 3 - Action Bronson]\nI told the driver Lenny swing me by the garden I gotta talk to Pat\nShowed him some stacks\nThen showed him the gat like ‘you're gonna miss the finger roll right?’\nYes, Mr. Baklava\nThen I cartwheeled into and aqua car\nNow I’m, sliding\nMa, your boy has made it, no more\nCrying\nThe facial reminiscent of a lion\nFuck around I’ll send you back to zion\nAnd I ain't even trying\nSwing the wood wheel like lumberjacks\nI remember back when they wouldn’t spend a stack on my rap\nNow they want to wipe my ass in the crack after I shat\nAnd I just had corn beef hash\nEw…\n\n[Verse 4 - Big Body Bes]\nYeah\nIt’s me\nMotherfucking Big Body\nI’m back for the fucking sequel, man\nYou know I had come and to spice this shit the fuck up\nMr. Fuckin Sazon himself\nI’m over here fucking wiling\nA lot of shit done motherfucking changed now\nMotherfuckers done came up\nWhole lot of different motherfucking moves are being made\nYou know what time it motherfucking is\nSo my lifestyle done changed a little bit\nAll types of shit\nThe motherfucking crib is renovated, man\nAll types of fly shit\nI got the new fucking marble floor, man\nThat shit is imported\nWe just flew that shit in from Connecticut\nMotherfuckers is out here spinning stupid shit\nBut you know me, man\nSame motherfucking body\nI’m out here wiling like I never changed man\nThis the same motherfucker you know me, man\n’98, doing stick-ups with the screw-driver\nIt’s me man\nThe last car on the fucking A train man\nI fucking live this shit\nDone came up\nPockets was always swole\nSometimes a little low but I get them back up, man\nFill them up like the fucking gas tank\nGod, man\nPsssht\nShout-outs to my fucking brother, man, Action Bronson, man\nWe out here, man\nWe motherfucking out here, man\nNot enough to say, man\nBut a motherfucking few more things that’s what to say\nShit is fucking crazy, man\nI’m out here smoking good, man\nFucking pocket, fucking stupid, fucking blunt pack with that up-town piff\nShouts to all my motherfucking Dominicans out there in the Heights\nAll of that, 172, 174\nWiling\nYou already know, man\nNah, I don’t even want a motherfucking ounce, B\nGive me motherfucking 40 dimes\nThat’s how I want it\nIn a brown fucking bag\nYeah, tato Papi, that’s how we doing it, big fucking style, man\nAnd I want that Chimi sauce dripping all over my fucking arm\nThat’s how I do it, man\nWipe it with the fucking hundred dollar bill\nI’m out here wiling man\nMy name Big Fucking Body\nShouts to motherfucking Albania\nShouts to East New York\nShouts to Lindenwood\nShouts to motherfucking Flushing\nShouts to the motherfucking Bronx, man\nAll fucking day I’m out here wiling, man\nEagles up", "title": "9.24.13", "album": "Blue Chips 2", "image": "https://images.genius.com/3tkvpk6nyazea6ub0nsnj8s01.500x500x1.jpg", "year": "2013-11-01"}], "artist": "Action Bronson"}