{"artist": "9th Prince", "songs": [{"album": "Granddaddy Flow", "lyrics": "[Kung Fu sample from \"The 8 Diagram Invincible Pole Fighter\"]\nFather, our family was always loyal\nYou traitors have betrayed our trust\nWe have been deliberately lured into this battle\nTo destroy the Yang... AWWW! Father! (yo, yo, yo, yo, yo)\n\n[RZA]\nApproach like a ghost, in a thousand men host\nPrepare for the battle, all you saw was their shadows\nSolomon's thought, was hit on fort, swords drawn\nThe king in the back, they formatted like pawns\nPrepare for the attack, heard the whips crack\nFatal guillotine's took flight, snatch heads, brought them back\nBefore they can blast, one gun, half a cal., he was done\nOne fourth was blinded by reflection of the sunlight\nOff the shield, the golden blade, golden wheel\nFive Element ninja was patrollin' the hill\nThe enemy face defeat, the reminder of his fleet tried to retreat\nTo the mountain side, it was countin' on a cage for a safe place to hide\nLocation was lurked about, brought turned about\nCalled the men, burned them out\nCapture up their leader, made him stiff like an ameba\nBroke his bat like semi cheeba\nStuck on poodle, we hold weight like a sumo\nGreat, fast, like Bruno Sammartino\nBurnin' Dominick Alovito and Angelina Lugo\n(\"Six return\") ..Yo, yo, yo, yo\nI burn mics micro rhymes of White Mike on turnpikes\nYou'll get sucked by the light\nM.C.'s get stuck up by the Bai Me nine strikes\nKeep a Tec, all up inside ya R.E.C. Room\nYa crabs, won't fall from the Sun of Neptune\nI don't fuck wit dead birds, be the true and living word\nGod's seen and heard, keep the best part preserved\nThen penetrate, ya bodies five major gates\nThe pulsatin' beat vibrates, and yo' thighs shake\nYou fruitcake, little tiny small molecular\nMiniature, minute, itty bitty, microscopic\nSubatomic, fragile, frail, timid, weak\nSoft, thuggy, Puffy the Dragon, spineless jellyfish\nCan't fuck wit this, Wu-Tang swordplay remains too crisp\nYou savage, we cripple (\"To destroy the Yang... AWW!\")\nFuck that..\n\n[9th Prince]\nYo, yo, sorid comics, swallow rhyme toxics\nPsychotic logic, insane explosives like bottle rockets\nThe 9th Prince blowin' sacrifices\nLyrical wolverine, dances wit wolves, lead by Crisis\nThe Prince wisdom is deep like black holes ultimate Abyss\nRecollect digital, that's a death wish\nI burn like flame on, Iron Palm\nRhyme in Napalm, fear the God, even to smile like Saddam\nMicrophone choreographer, picture what I vision like a photographer\nThe golden flow uno boxer, law and order, fiends warriors\nSecret Victoria, defenders of the universe\nCreepers creep, Don 10 try to peep before I hit him in his sleep\nI'm legendary like Eleven the veteran, from the Mediterranean\nWho watched the braveheart, warlord, killa stash, barbarians\nThe renegade with a hand grenade\nExplosion, front locus, will blow ya hearing aid\nCausin' those who misunderstood what I had to say to throw shit on stage\nBut I still reign, grab ya Bandaids ya rhymes cut like switchblades\nYo bring it back\n\n[Kung Fu sample from \"The 8 Diagram Invincible Pole Fighter\"]\nDeliberately lured into this battle\nTo destroy the Yang... AWW!\nAt last, in the hope\nThe last mark\nSay ya prayers\nSeven have left, six returned (x2)\nIf this is so..\nSeven have left, six returned\nForgive them my son, it's hard to relieve\nAWWW! The 5th Brother\nYou must walk\n5th Brother, 5th Brother, 5th Brother\nSeven have left, six returned (x2)\nThe 5th son left the life, follow him\nSeven have left, six returned (x2)", "year": null, "title": "Tribute to the 5th Brother", "image": "https://images.genius.com/aee759b8fa2fa70e9bb2b738d3297e33.462x462x1.jpg"}]}