{"songs": [{"image": "https://images.genius.com/75a265916a97836aa5ab08c709a44211.1000x1000x1.jpg", "album": "PSYCHODRAMA", "title": "Lesley", "lyrics": "[Verse 1: Dave]\nLook\nThey say the universe, it works in a strange way\nAnd it must be true because, we ain't from the same background or same place\nBut me and Lesley ended up on that same train\nI'm talking everyday, I used to wake up around seven or eight\nTo catch the 9:06 from Norbury Station\nTwo different worlds in the same location and-\nOne day we ended up speaking\nAnd I would talk about college, she would talk about meetings\nAnd how she's planning on leaving\nHow she hates what she does but she needs it\nI asked her what she was doing, it's the weekend\nAnd she said, she said\n\n[Chorus: Dave & Ruelle]\nI don't know myself\nI don't know myself no more\n\n[Verse 2: Dave]\nShe used to be the life of the party for true\nAnd now she going out hardly ever\nHer man got her in the yard forever\nAnd her friends wanna help but it's hard to tell her\nHard to let her know that her man's possessive and aggressive\nAnd she can't even see it, but for them it's clear as day, she's in a situation\nHer friend Hannah had a man that was manipulative\nSo, she could see it from a mile off\nTurtleneck jumpers, makeup around the eye spots\nAll the signs were there\nBut Lesley made it seem a light affair\nSaid it wasn't right to share\nHer boyfriend, he was a mystery man\nI didn't know much about him, but he's been in the can\nName's Jason, he's a bad boy with no reasoning\nTo be honest, I don't know what Les' sees in him\n'Cause she's a good girl with a sweet heart\nBut they've both got demons and a deep past\nYou know opposites attract, apparently\nI never heard her talk about her family ever, uh-uh\nHe was all that she had\nUntil they had an argument and he stopped calling her back\nAnd I don't know if there was more to the story than that\n'Cause she plays things down but according to that\nHe went missing one day in the morning he ran\nShe's doing overtime, struggling affording the flat\n'Til she, lost her job it fucked all of her plans\nCouldn't pay the rent, borrowing and calling for cash\nBut Hannah she was there for her, cared for her\nWhen I saw Les' she told me\n\n[Chorus: Dave & Ruelle]\nI don't know myself\nI don't know myself no more\n\n[Verse 3: Dave]\nLes' saying, \"I got nothing to live for\nIt's been raw, but David, I ain't never been this poor\nThere's no income, my boyfriend left me\nSo how the fuck am I going to survive when this kid's born?\"\nI said, \"It's a blessing as mad as it is\nAnd Les', I never even knew that you were having a kid\"\nBro, she's four months pregnant, young and neglected\nSingle but I don't think she wants to accept it\nSo she's still texting exes trying to get this\nBack on track but I don't think that she gets it\nIt's emotional obsession, clinical depression\nLife is a lesson\nAnd you ain't got to sit and cry\nAnd Lesley, living in this gift called life\nThere's no better gift than the gift of life\nSo, can you handle it?\n\n[Chorus: Dave & Ruelle]\nI don't know myself\nI don't know myself no more\n\n[Verse 4: Dave]\nBut that changed her perspective\nLate in December, her baby's expected to drop\nShe's accepted, excited, electric, pumped\nOnly got to wait a few months\nHer and Hannah had lunch\nTold her she's pregnant\nAnd they're the closest of bredrins\nSo she didn't stunt to tell her, I think that it's an error\nYou ain't a mum for a day, you're a mum forever\nWhatever, and you and Jason break up whenever\nIf I'm honest that's something you should have done together\nShe doesn't know that her and Jason are going out again\nAnd Jason doesn't know that Lesley's carrying a child for them\nShe had daydreams of settling down with Jason, better 'cause now they're together it's wild\nFeeling like she needs to call her friends and tell 'em 'cause while she's letting him down but most of them are never around\nShe calls Hannah the next day\nStill tryna figure out the best way to tell her that she's getting back together with an ex-flame\nSo she left her a voicemail\nLike \"Yo Hannah, it's Les' can you call me back?\nI wanna talk about the baby, you, me, Jason, all of that\nI've been feeling like I need to get my aura back\nI used to be so fucking confident\nBut these days, I swear that-\"\n\n[Chorus: Dave & Ruelle]\nI don't know my self\nI don't know myself no more\n\n[Verse 5: Dave]\nIt's 3:30 Lesley was meant to get a scan\nBut today I think she's going home early\nTryna talk to Jason, tell him 'bout the kid\nAddressing any reservations\nHave that conversation\nMiddle of the summer and it's raining\nWaiting at the train station\nHella cancellations\nSo she gets a taxi, sitting in a backseat\nBlue jean jacket and a maxi\nActually, tired and her legs are aching\nTouched the destination\nWay faster than the cab driver's estimation\nShe put the key in the door\nShe, couldn't believe what she see on the floor\nSome size five trainers, raging\nTears in her eyes, but it's cool 'cause they must be the neighbors\nAnd Jason's in the bedroom fully naked\nLesley running up the stairs but she's making noise\nAnd she can hear Jason's voice\nSaying \"Hide in the closet\"\nBut he's made his choice\nSo, she bursts in saying \"What kind of person would cheat on his pregnant girlfriend?\"\nJason, saying \"What the fuck, you're pregnant? What the fuck?\nYou weren't even gonna tell me, I mean what the fuck?\nWhat do you want from us?\nNah, you ain't in love, you just wanna love\"\nLesley telling Jason, \"I don't wanna love\nI don't want a you and I, I don't want an us\nAnd also, I don't wanna talk loads\nOne more line before I dash like Morse code\"\nOpen the wardrobe\nAnd Jason's on the edge\n\"I just wanna see if she was prettier than me, slimmer than me\nMaybe your baby's similar to me\nMaybe you wanted someone thicker than me, fitter than me\nTo satisfy you quicker than me\nI got your baby in my stomach and you did this to me\nWhat did I ever do to you for you to finish with me?\nI didn't believe my girls but they were thinking of me\nAnd give it to me, the wardrobe, give me the key\"\nI was pulling up the door but Jason's bigger than me\nLiterally, I remember viscerally\nJason pulling from behind me now he's gripping on me\nWhite flashes, eye gashes, when he's hitting me, see\nI just wanted to disappear I wasn't living for me\nPhysically I shut the fucking doors quick as can be\nHe's outside asking why I made him do what he did\nUsing a kick to open up the room that I'm in\nI'm feeling afraid, barricaded, with a chair in the handle\nI'm hearing sirens but I just wanna run away but I can't\nJason's gone by the time police are comin' they saw that ain't no one else in the house and feds are running through the door shouting \"'We have reports of an argument with a woman'\nThere's blood all over the floor and it's splattered onto the wall\nLes-ley's on the bed and she's tryna speak to the feds\nShe's deep in the stress and it's meters above her head\nIf anything, she couldn't even say anything\nBut she's got this really sharp pain where her belly is\nSo, they call an ambulance, Lesley didn't plan for this\nPolice are in the room tryna find the missing piece of the puzzle\nUntil they stumble on something that's kind of random\nIt's a phone in the wardrobe\nThey had five missed phone calls from Jason and also a couple other numbers so they thinking that it's no help\nUntil they play the voicemail like \"Yo Hannah, it's Les' can you call me back?\nI wanna talk about the baby, you, me, Jason, all of that\nI've been feeling like I need to get my aura back\nI used to be so fucking confident\nBut these days, I swear that-\"\n\n[Chorus: Dave & Ruelle]\nI don't know my self\nI don't know myself no more\n\n[Verse 6: Dave]\nShe felt sick to her stomach, she started panicking\nMind rattling, tryna understand what Hannah did\nBattling the shame 'cause the situation embarrassing\nShe's tryna fathom it betrayed by her own garrison\nMeanwhile, she's on the bed tryna manage this\nPiercing pain in the stomach, she couldn't handle it\nNow she's waiting for an ambulance\nLook\nAnd I know she's strong, but when I heard about what happened I was over-shocked\nHer nose was gone, her jaw line shattered and rocked\nThey said her baby was the reason she was holding on\nShe dozing off, doctors getting no response\nHer heart rate slowing down and they don't know what's wrong\nPicked her up, got her out the home and onto the stretcher for good measures but she's fading out, oh\nShe took damage to the brain and now she's in a coma as we speak but I ain't sure if she can make it out\nYou see this time that I'm taking out to tell you the story is more than a song or track\nIt's a message to a woman with a toxic man\nI'm begging you to get support if you're lost or trapped\nI understand that I can never understand and I ain't saying that it's easy but it must be right\nSome of your sisters, aunties, mums or wives\nAre fucked aside and they will never touch on why\nI'm touched 'cause I've seen women that I love though like-\nCry little red tears through a bloodshot eye\nThis shit's awful, no matter what culture it ain't normal\nMen try and twist it, make it seem like it's your fault\nIn that train full of people that you're taking\nHow many Lesleys are running from their Jasons?\n\n[Outro: Ruelle]\nAngel without wings\nLike the day without the night to bring her peace\nA song without a voice\nA spark without a flame\nA child without a name\nOh, it's just wrong\n\nLike an ocean without a shore\nA soldier without a war\nHow can we do this anymore?\nA song without a voice\nA spark without a flame\nA child without a name\nOh, it's just wrong\n\n[Interlude]\nWell, we've made a massive amount of progress in this last year, haven't we?\nFeels like a long journey\nAnd I must say it's been a pleasure, to watch you mature and grow in thought\nAnd in your career and life\nYou've opened up immensely\nI'd be lying if I said I wouldn't miss these sessions\nBut you know, you can never stop learning about yourself\nSo you're always welcome\nI'm just happy you're at a place now where you feel you understand your emotions\nAnd are in control", "year": "2019-03-08"}], "artist": "Dave"}