{"artist": "Cage", "songs": [{"title": "Haterama", "album": "Weatherproof", "year": "2003-04-11", "image": "https://images.genius.com/33f91d83cd03c97b17c7ddb7a47f556a.600x600x1.jpg", "lyrics": "So many faggots to swing the ax at\nWho do I shoot first?\nAnswer when I make this dead cow feel my boots hurt\nWhoever's standin' as part of the human pavement\nQuitters advance, tryin' to rap, the movement's faded\nKill like I stuck it in shit\nSold ya'll a bucket of shit\nEven Bobbito said, \"Fuck it I quit!\"\nKCR shit me out but you knew that\nReflect your crew back, to that late-'90s beat\nYou shit to shoot at\nThe biggest pop star in the world threw dirt in my engine\nBut when I say his name I look like Royce tryin' to get attention\nI know the ledge, 110 stories you been sour\nThe only Boston hits in New York was the Twin Towers\nIt's only right my raps reflect evil\nMy only wish: to trade places with them 3,000 dead people\nHindsight Halloween you begged to open up\nDaddy's Lex, coked it up, on stage chokin' up\nDropped the mic and left\nCage arrived a hour later\nCause the opening acts bore me, epecially them coward haters\nEight Jack and Cokes, 7L's gettin' lucky\nGet to the side of the stage, these groupies tryin' to touch me\nThat's a snuff, no that's a hug, my arm's small\nRichie Rich got the nerve to steal on me for pub?\nWhat was that? Bugs hit windshields harder than that\nWasted loot on rap, coulda been through Harvard and back\nI know you're salty I sold more in Beantown\nYou're obscene, now you're wasting all your label's cream now\nTrying to get violent, but gay is gay\nThe same day New Yorkers was on mourning JMJ\nYou got no respect, why give it? You don't get it\nWhat toy-ass crew can't beat up paramedics\nToo many cards showing, do you know how to play the game?\nThrowin' up consecutive bricks like it's your label's name\nOops, I guess it is, fuckin' stick to the kegs\nYour team probably front like they ain't on my dick in your face\nEnd your career? shit ain't even started\nClean up your style\nHelp out Lif, he holdin' your whole scene up\nYou see the sweat on his face, Eso\nI know you ain't sweat like that since you sent El-P a demo\nAnd his slang is outdated like, \"Look I'm butter now\"\nYou fatherfuckers still drown in my watered down\nTrue, me and your producer got a past beef\nEither his girl sucked my dick or I wouldn't rock to his trash beats\nBoth, look girls, your health's vital\nCop the Nighthawks album, bitch, it's Celph Titled\nPlayed your boys idle\nEvery tonight'll seem like you and the cops are tight\nShoot up your ankles cuz your socks are white\nGo teach your pops to fight"}]}