{"artist": "Ace Hood", "songs": [{"title": "Get Him", "album": "Gutta", "year": null, "lyrics": "[Hook]\nYou ain't comin' round here talkin' all that shit\nTalkin' bout you get all them bricks\nI'm a have to come round your way\nNigga I'm real you all too fake\nAnd a pistol where ya mamma stay\nAct like I don't know where you lay\nBetta act right fo' I get uptight\nAct up I'm a let tha automatic spray\n(Get em) boy there ya go\n(Get em) boy there ya go\nBlocka, blocka, blocka, blocka\nBoy there you go\n(Get em) boy there ya go\n(Get em) boy there ya go\nBlocka, blocka, blocka, blocka\nBoy there you go\n\n[Verse 1]\nHol' up with it, Khaled don't let me get em\nGun cocked, where his cheerin'?\nNo talk, time to get him\nFake niggas gon' make me kill him\nMake his body shiver like he naked in a river\nMatter fact I'm a leave him in the river\nCome and get him when it's winter\nNigga holla back\nI'm gutta. I done told ya that\nRock boy bitch over bags\nSay you movin' them slabs of crack\nSee nigga you a lie like Pac is back\nMan you niggas all crap\nAnd you homies won't last\nTill your somethin' like paper tags\nDon't make me slide the mask\nTo save from blast\nGet his ass\n\n[Hook]\n\n[Verse 2]\nNow let me get em when I walk up in the place\nPut the pace in ya face, tell em gimme dat K\nFuck niggas and they really don't think that I know where they lay duct tape they face\nPop pop, unload that K, then we leave em and we find em in a couple of days\nPussy niggas know where you lay actin' like I don't know where you stay\nRunnin' at ya mouth man ya niggas too fake tellin' all the niggas that you move them thangs\nWhat? Y'ain't bout dat lie\nHuh? Y'ain't got no stride\nNaww. You ain't really grind\nLeave em in tha streets till the D boys find em\nDumb niggas and they huggin' on the grind\nIn the middle of this town\nWe gon' G-G-Get em\n\n[Hook]\n\n[Verse 3]\nNow who am I? mothafuckas wanna know\nWhen I pull up in that rover\nThey know that it's over\nBig holes in ya body like coasters\nCreep, creep we deep with soldiers\nBlack holster to carry that toaster\nHot head now they callin' me folgers\nBut still creep in Adidas with the heaters, millimeters\nWanna see where yo family at\nPop pop just call me ace\nSlump niggas I'm a call you dead\nClick clack now ya T-shirt red\nHand em an tampon\nNo batteries included know that the clip be hands on\nIt'll take yo mans on\nLeave his body slumped in the damn yard\nGet em\n\n[Hook]", "image": "https://images.genius.com/02f74eceac3a595c24753bb18dfe12de.600x600x1.jpg"}]}