{"songs": [{"album": "G.O.Y.A.", "image": "https://images.genius.com/fb7ecaddc1d29cc6370534f44a6e9ae8.1000x1000x1.jpg", "year": "2013-01-01", "title": "Take My Turn", "lyrics": "[Verse 1: Termanology]\n\nKick in the door like Biggie did\nGot a variation of barrels waiting to get me rich\nYes I'm on the block with my Philly lit in the 50's whip\nWith my villains and they affiliates and we in this bitch\nUhh\nPeach, Ciroc by the bottle boy\nAnd I'm in the club with a model that you cannot avoid\nYou see that thing you do a double take\nShe ain't fucking tonight, we ain't having another date\nSwerve\nKick rocks while I take shots\nThen I'm peeling outta my muscle car with the big block\nErr\nI'm getting topped when I hit the stop light\nShawty told me, \"Stop, let me get on top\"\nWhoa\nCatch me riding through Queens\nPicking up Bronson, lighting up green\nBoth hands on the steering wheel full of rings\nNah, I ain't in a gang but I'm a Lawtown king\nGo\n\n[Hook: Jared Evan]\nWhat the fuck you trying to change me for?\nWhat kind of fool you take me for?\nI don't need anything at all\nIt's not over 'til I finally take my turn\nFinally take my turn\nFinally take my turn\n\n[Verse 2: Action Bronson]\nA thousand dollars on the jump shot\nRocking some dress shoes\nNo shirt on 'em like Bird from the corner\nShawty in the sauna\nFinest meat served off a slaughter\nRun a two minute drill, fourth quarter\nThis is every favorite uncle rap shit at a store\nWe bought the boat and extort the captain, Captain Hook\nFold you back when you fuck around with the rapping cook\nJackie Chan or Van Damme, kick with classic foot\nSee the world behind my eyes become a changed man\nOften eating lavish meals from a strange land\nLamb galore\nHummus in abundance\nRaise the glass, king is here, hear the trumpets\nBronson\nYou can find me where the bitches at\nLove a bitch who slap her pussy like a fishing hat\nWatch your ass cause this is prison rap\nBag of money, I envision that\nCause I'm a Queens king\n\n[Hook]\n\n[Verse 2: Jared Evan]\nYou won't catch me until I'm done\nThere's nothing else to wait for\nMy reign only just begun\nNo\nAnd there ain't no doubt about it\nNo\nAnd there ain't no doubt about it\nNo\nAnd there ain't no doubt about it\n\n{x4}\nTill I finally take my turn\nAnd there ain't no doubt about it\nNo"}], "artist": "Termanology"}