{"artist": "Bas", "songs": [{"lyrics": "[Produced by Cam O'bi]\n\n[Intro]\nI'm too high to riot, I'm too high to riot\nI'm just too high to riot\n\n[Verse 1]\nI never lose sight\nGot an eye on her thighs and an eye on horizons\nToo much at stake, got no time for a date\nUnless that date is with fate, got my eyes on the prize and\nIts too occupant, you want a slice but it's too hot just pie it\nYou want a steak but it's too high to buy it\nMe I be too high, I'm too high, I'm too high\nI'm too high for games and I'm too high for liars\nFuck TSA cause I'm too high for flying\nFuck NSA cause them satellites too high. they do all the spying\nFuck all the leaders that's too high off power\nThey do all the lying and treat us like prisoners\nI mean who is the enemy here?\nYou are or I am, but you are not real enough power\nDespite all the dirt that you're doing\nYou do all in hiding, but I am no better\nI can see all of your terrors\nStill remain in quiet and wonder in private and silence\nLike if I just speak on it, would the people go buy it?\nFuck it just do it for self, I am demand and supplier\nI trial by fire, I am the man\n\n[Hook]\nBut I'm too high to riot, I'm too high to riot\nI'm just too high to riot\nBas you in the city?\nBaby nah I'm on the road, Fiends\nPockets full of money left them all on the floor\n\n[Verse 2]\nProbably should have claimed all the hoes that I fucked on my customs declarations\nCheck the faces all through my crew, it's like every race\nSo to call me racist, is so fucking baseless\nBut until your nation apologize\nI fuck a European bitch for every African nation they colonize\nAnd Add us some commas there to follow my dollars sign\nAnd boost up my bottom line\nAnd you don't want to hear it fine, they used to make it a crime to fuck white women\nBut damn, better give me a lot of time\nFree love, whole world mixed up fuck boy you out of time\nSo what could brown do for you? UPS nigga\nI done flew up out the nest nigga\nThe world bigger than the block man thats why they killed Pac\nCouldn't stop us, we still looking for the rest nigga\nFiends\n\n[Hook]\nBut I'm too high to riot, I'm too high to riot\nI'm just too high to riot\nBas you in the city?\nBaby nah I'm on the road, Fiends\nPockets full of money left them all on the floor\nPockets full of money left them all on the floor\nBut I'm too high to riot, I'm too high to riot\nI'm just too high to riot", "image": "https://images.rapgenius.com/2eab702cd8dd5703dd5d34fd86f9f489.436x243x1.png", "year": "2016-03-04", "title": "Too High to Riot", "album": "Too High to Riot"}]}