{"songs": [{"title": "Work (Paid For That?)", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro]\nMy own boss\nWork\n\n[Verse 1]\nLast year I was taking them notes, ayy (Notes)\nConference room every day is the woes\nLast year at work\nI was irked, I was irked\nTryna figure out them ad buys\nThis year at work\nI been drinking with some black guys\nHey I done came up (Sho' nuff)\nLike, last year at work\nI'm like oh, that's my boss, she a bitch\nShe know this\nShe lookin' at me every day like \"Dave, where you going?\"\nI'm looking back like, \"Hoe\" (I hate your demeanor)\n\"To print some shit\" but you don't even know\nNow look what happened, now who rapping?\n\n[Pre-Hook 1]\nNow at work I ask to look at bitches' titties then this happens (Work)\nTitties looking back at me like \"Dicky, boy, what's cracking?\"\nI look back at titties like \"I need a sec, I'm rappin'\"\nTitties looking back at me like, \"take your time, you snappin'\"\nI'm like, \"woo, I'm getting paid for that?\"\n\n[Hook]\nI'm getting paid for that?\nNah, I'm getting paid for that?\nI'm getting paid for that?\nNah, I'm getting paid for that?\n(All of these hoes been on me\nI'll never go back homie)\n\n[Verse 2]\nHomie last week I was up in Miami (Great weather)\nGot paid to chill in the club\nLiterally, chilling, like not even rapping\nI think I did a good job\nSat there on Twitter, my new correspondence\nIs going through all of these wonderful compliments\nUsed to be scrutinizing  all these documents\nNow when I sign off on something, it's body parts\nTitty, booty, macking a cutie\nGot her back in the back of the room of the venue cause she copped that meet and greet\nI got them going down in their prime like Aaliyah be\nUsed to post up, on time, no brakes\nNow the Burd post up on the vine, no grapes\nUsed to have to swallow all the pride\nHad to piss out the slacks of the sack in the sweats every day\nUsed to buy brands, now the brands pay Dave\n\n[Pre-Hook 2]\nLike, I just got a box of Pumas, cause they think I'm cool\nWatch me mention StarKist Tuna, watch my fridge get full\nI used to sit and wait for Friday\nBut now my whole week like a Friday\n\n[Hook]\nI'm getting paid for that?\nNah, I'm getting paid for that?\nI'm getting paid for that?\nNah, I'm getting paid for that?\n(All of these hoes been on me\nI'll never go back homie)\n\n[Verse 3]\nLast year I'm stuck up doing shit up in a cubicle\nThey tell me what to do, I'm thinking \"fuck that shit\"\nBut y'all, I couldn't tell them what the fuck I'm thinking\nNow they're paying just to listen to this shit, I got up on my lid\nGot three or four bitches who 'bout to get the fourth down\nThat's a first, I remember when what lunch I picked was all I get\nMy bitch make that coffee, now only boss me around when we fuck (Ayy)\nWas missing college but now they bringing me back, it's still fun (Yeah)\nGod damn Dicky, you too old to be fucking all these kids\nYeah, I know, but if you can rap, it's a lot less creepy though\n\n[Pre-Hook 3]\nI'm smoking weed in public, but it never seem to matter\nDump a bottle of water on your clothes and you ecstatic\nI don't ever have to set alarms, I wake up supernatural (Work, work, work)\nI can grab a bitch's hand and she will scream \"you so attractive\"\nHow did this happen?\n\n[Hook]\nI'm getting paid for that?\nNah, I'm getting paid for that?\nI'm getting paid for that?\nNah, I'm getting paid for that?\n(All of these hoes been on me\nI'll never go back homie)\n\n[Outro]\nI used to be up in Excel every day with a bitch (Very proficient)\nNow I just suck on my dick, suck on my own dick, man\nI suck on my own dick,  every rapper do it\nJust a thing, an inside thing I learned\nIt's absurd, it's like, I'm in the industry now, so, I'm seeing shit\nEvery rapper suck they own dick, it's not just me\nSwear to God on the Bible\nI don't believe in the bible though, so I made the whole thing up\nDid you believe for a minute that the whole rap game suck their own dick?\nI hope not. That would be... an exaggeration\nI don't think anybody else sucks their own dick\nI also don't suck mine, it was a clear joke\nLike i don't think people need to be homophobic about that\nNor is there anything wrong with gay people\nI don't know like what I can or cannot say at this point\nLike what can I say? Here's what I can say\nIs that on the note of swearing on bible\nIt's crazy to me that like our whole country is run off like principles of religion\nI probably shouldn't say that either but it's like crazy\nLike a president couldn't be elected unless he was like an outgoing Christian\nThis seems like such a... You know like in 200 years no one's gonna be thinking that way\nIt's just gonna become an antiquated line of thinking\nKind of like how you look back at slavery now\nDefinitely can't say that, delete that last part\nBut it's the same you know what I mean like people\nAh, whatever"}], "artist": "Lil Dicky"}