{"songs": [{"lyrics": "[Intro: Reign Mosley, Jay-Z]\n\"You're busy?\"\n\"I wanna love you back, I, I wanna love you back, I, I wanna love you back, I love you back, the group of my fam.\"\n\nFamily first\nHonor, integrity\nR.O.C\n\n[Hook]\nHead of the family\nEl Padrino\nWelcome home to Emory\nLet's get back to this dinero\n\n[Verse 1]\nNiggas wanna kidnap wifey\nGood luck with that bruh\nYou must gonna hide your whole family\nWhat you think we wearing black for\nReady for that war, ready for that war, ready\nYou ain't ready yo, you radio, you ain't really ready\nReal shit chyea, Alpo bought his bricks here\nElvis got his records took, it's like we got our seventh gear\nNFL investigations, oh, don't make me laugh\nFBI investigation, we stood up to that\nFacts only, everything real in my raps only\nEvery nigga real in my clique really\nEveryone's a movie star you got to film me\nLa familia\n\n[Hook]\nHead of the family\nEl Padrino\nWelcome home to Emory\nLet's get back to this dinero\n\n[Bridge]\nReady for that war\nReady for that war, ready\nYou ain't ready yo, you radio\nYou ain't really ready\nHead of the Family\nEl Padrino\n\n[Verse 2]\nMy brothers is my brother like my brother is\nMy niggas is my brother like my mother kids\nNot just in good times, that's that sucka shit\nBut in war times, it's just what it is\nHead of the family, all my niggas bosses though\nY'all don't understand we? We talk that shit bosses know\nTriple fuckin' OG, what's up to my nigga Juan\nTell these niggas pull their fuckin' skirt down, I could see their ovaries\nNiggas snitching switching teams, out here telling bitches things\nIndustry talk behind your back, ain't nobody got time for that\nFacts only, everything real in my raps only\nEvery nigga real in my clique really\nEven the girls keep it two hundred and trilly\nIt's la familia\n\n[Hook]\nHead of the family\nEl Padrino\nWelcome home to Emory\nLet's get back to this dinero\n\n[Bridge]\nReady for that war\nReady for that war, ready\nYou ain't ready yo, you radio\nYou ain't really ready\nHead of the Family\nEl Padrino", "title": "La Familia", "image": "https://s3.amazonaws.com/rapgenius/MCHG_cover.jpg", "year": "2013-07-04", "album": "Magna Carta... Holy Grail"}], "artist": "JAY-Z"}