{"songs": [{"year": "2012-04-10", "image": "https://images.genius.com/bdb1ca23b418b0572caba92910aaa741.600x600x1.jpg", "title": "The Foreigner", "album": "History Will Absolve Me", "lyrics": "[Verse 1]\nTime waits for no man\nHe ain't believe till his ace boon took the stand\nShook the D.A. hand, that's that honor amongst thieves\nMy enemy's enemies are always well received\nServed hors d'oeuvres, tricks up sleeves, the hoochie grins\nBut it ain't no compromise I'm Ho Chi Minh, ruthless MC Ren\nSmall caliber close range, General Nguyen\nFeburary first '68, the best laid plans of mice and men\nFlip the coin, call it fate\nFroze like a pipe head on a crack stem when bodeans hit the gate\nNight riders in reconstruction, gentrification, crackers got suction\nRighteous among the nations\nHebrews bailed him out, co d's hit the state pen\nStaying with my ex-girl but we just friends\nGot a nigga on a strict regiment\nBlowing sour L's in pissy stairwells\nShe caught me coming home from work like \"oh hell\nNo, you gots to go\"\nFair enough, but if so, we might as well fuck\nSleepless in Seattle, don't make sense\nLike two niggas cracking jokes, with no beat and wanna call it a battle\nTakes all kinds I suppose\nThink big, young Cecil Rhodes\nYou dig the flows? come to the shows with your best dro\nUnleaded diesel petrol\nFacing a parliament of rooks I got a murder of crows\nSlayed the broad that night, murder she wrote\n\n[Verse 2]\nIn the swamp neck deep\nVigorish high, Jimmy the Greek\nEagles by three makes it a tie\nWoe unto he who believe a word these growers speak\nCrammed into OTB with the rest of the creeps\nFear reeks by noon the polocks is three sheets\nLand sharks three deep for percentages\nCompounded by the weak\nEyes blank like plainclothes police\nTell em to pick they own cotton\nThis is professional football we don't run the option\nBarry Sanders, who gives a fuck if niggas blocking?\nTop of the key white as John Stockton\nWe need this one to beat the spread\nThey keep guns to heat the lead\nBeat the odds or eat your meds\nThe force of the blast tore him to shreds\nCee-lo, when them atoms crack bet on black\nRain, radioactive, hurricane\nThe abyss beckons, I'm bettin\nThe farm subsidy\nComfortably, talking big like they ain't touching me\nSobered up trying to skip town\nDouble dutch, master's full of brown, bamboozled\nStop by her job like it's business as usual\nBut, um, can I hold something till payday?\nCan't do nothing for you man like Flava Flav\nI got problems of my own\n\nOutro Sample (from billy woods - Minimalism):\nKnown as the foreigner\nIllegal alien rap"}], "artist": "​billy woods"}