{"songs": [{"album": "Blacklight", "image": "https://images.genius.com/7024230a664e26c9a3b0c4fc89609ef5.1000x1000x1.jpg", "year": "2011-05-30", "title": "He Lives", "lyrics": "[Verse 1: Tedashii]\nYe-ye-ye-yep, yes He's Alive\nFrom the dark to the light, sunrise\nEverybody who be driven to thinkin' that He's gone\nYea they in for a big surprise\nViola, uh huh, right there before they eyes\nHe'll be back, ain't cut no slack for the cats who try to hide\nLies; that's what they say I drop, cats so lost\nCaught up with they-selves but they rebel\nYes sir they gon' be shocked-shock, clear\nThey dead now, can't live just on that bread, naw\nI took hold what He said now\nI'm His pupil, yes, no retina\nHe done preached it from the mountain and three thousand all believed it\nAnd He called me on the campus, and I answered and received Him\nFrom the witnesses that seen Him, to the heathens who not preach Him\nThe proof is in the change; unashamed, that's how we reach em'\nAnd so I stand up, I will never stand down\nWorship with my hands up, humbled by Him, man down\nYes sir, that is it, I will never call it quits\nPressin' on, that's how I know I'm His and that He lives\n\n[Hook: Jai]\nHe lives\nI-I-I am so glad He lives\nMy Savior He died, but He rose again\nR-r-rose again, He's alive\nAnd now that I'm dead to my sin\nIn me is a place He can live\nI'll serve Him until He comes back again\nB-b-b-back again, He's alive\nI'll tell em' that, I'll tell em' that He lives\n\n[Verse 2: Flame]\nWhat's that gotta do with me, huh??\nI'm just tryna stack my bread\nI ain't bother nobody or robbin' nobody like I done just got out the feds\nI heard what the preacher done said (what's that?)\nThat Jesus popped outta the grave\nBut what does that have to do with me and all of these bills that gotta get paid?\nAnd all of these mouths I gotta feed?\nPlus my old lady complainin'\nI'm tryna live kinfolk, although I see what you sayin'\nBut if you see what I'm sayin', then you would know it is\nProof positive that the God man really is, who He say He is\nTook on human flesh and hit the Earth\nLived the perfect life, first, then He took that crucifix\nThen He resurrected; that validated that He is God\nDid you say Jesus is God? Yes I said Jesus is God!\nSo, what that means is, all, human beings is\nHis creation, we should praise Him for His patience then repent\nAll you gotta do now just confess\nTurn from your sin put your soul to rest\nHe resurrected, you get forgiveness\nGive Him your all and nothing less\n\n[Hook]\n\n[Verse 3: Tedashii]\nThree days... Just enough to make these people say He gone\nHe wrong, He on His own, He left us here, we all alone\nBut naw... You got it twisted\nClear like the sky but I guess you missed it\nBut we ain't done yet, 'til there ain't one left, be\nPatient, hope you listen\nCause when He touch down, no replay\nYou should run now, no relay\nWho can turn down, what He say? Man I'm turned up\nKnow He lay out the grave, that's the reason I am saved\nNot for rules so I behave, but so I can be remade\nIn His image, I am finished, period, minus the sentence\nThrough repentance in an instant\nI'm so Him, call it Christian\nCause He lived, I know that's real\nYou sayin' prove it, peep the movement\nUnashamed 'til the end, I'll tell em' that He lives\n\n[Hook]\n\n[Outro: Tedashii & Jai]\nI'll tell em' that\nI'll tell em' that He lives\nI'll tell em' that He lives\nI'll tell em' that He lives\nI'll tell em' that, I'll tell em' that\nI'll tell em' that He lives\nI'll tell em' that He lives\nI'll tell em' that He lives\nI'll tell em' that, I'll tell em' that, I'll tell em' that He lives\nI'll tell em' that He died, I'll tell em' that He rose, and I'll tell em' He's alive\nI'll tell em' that He lives\nI'll tell em' that He lives\nI'll tell em' that He lives\nI'll tell em' that, I'll tell em' that, I'll tell em' that He lives"}], "artist": "Tedashii"}