{"songs": [{"album": "My Moment", "image": "https://images.genius.com/4161866b3d728a15c7da23a1d5d2ed02.592x582x1.png", "year": "2016-11-07", "title": "First Day Out", "lyrics": "[Intro]\nHelluva made this beat, baby\n\n[Chorus]\nThese niggas prayed on my downfall (They what?)\nThese niggas prayed on my downfall\nOn all ten, bitch, I stood tall\nShow these disloyal niggas how to ball\n\n[Verse]\nGo get a thermometer for the pot, I need this shit cooked right\nLet's keep that water 400 degrees Fahrenheit\nYou ever been inside a federal court room?\nNigga you ever went to trial and fought for your life?\nBein' broke did somethin' to my spirit\nAsked niggas to plug me, they act like they couldn't hear me\nLook at me now, drivin' German engineering\nYou don't want your baby mama fucked, keep the ho from near me\nKilroy, 'member when I used to use your L's\nTo hit the road, hit the O and make them big boy sales?\nMoo, 'member when you had them green things mailed\nWith vacuum seals tryin' not to have them green things smelled?\nFeds was on me, what you know about related through money?\nI don't know nothin', I just used to see 'em walk to the Coney\nI fuck with bitches, my body count go from Pershing to Cody\nAny further questions, you can take that up with the lawyer\nMy nigga Fenkell, J Money, Brightmo Lo, Project Joe\nWill tell you every day before school I sold a half bow\nHow you think I won best dressed with no support?\nAnd had them paid lawyers comin' in and out of court\nAyy, Dwan though, ayy, Theo ain't it a blessing?\nWe made it out Kentucky after all that happened?\nAfter the pre-trials, after the status\nAfter them impact statements, after the castle\nAyy, JR nigga, ain't it a blessing?\nWe made it out of Lansing after all that happened?\nAfter Michigan State, after Hubbard\nWhen our mans told on us, them bands they took from us\nJoy road bitch, but the money long as six mile\nBrick mile, knock your bitch down\nPick her up, knock her back down, pull her tracks out\nYes I slap girl, yes I slap dog, yes I slap loud\nYes I'll slap a pussy nigga if he act out\nYes I caught cases on the road with them killers\nBro, kill me if I snitch, 'cause if you snitch I'm gon' kill ya\nSpent a lot of time on that yard with them gorillas\nStood tall, did I let niggas ho me? Quit bein' silly\nI know for a fact your bitch pussy get wet for a nigga\n'Cause I do it better, plus I'm doin' better than niggas\nI'm at home when I'm down there in Lexington nigga\n'Bout the king, they gon' drop you and who next to you nigga\nUnc said Lil T, \"Get ahead of them niggas!\"\nWhen you take off, don't look back and try to rescue them niggas\nYou killed his mans? Then make sure you get the rest of them niggas\nDon't let them get the best of you, just get the revenue nigga\nSo let me know what you can handle, okay, come grab it\nHere go some extras, so if I'm busy you can manage\nFiends had me Blade dancin', eating sixty dollar salads\nGet it there and back, tell the feds I need a challenge\nMy first offer was 30 years, not a day lower\nI told them crackers holler at me when they sober\nOn parole, I'm a felon, you think I ain't got that blower?\nYeah you right, bro take his head off his fuckin' shoulders\n(Boom-Boom-Boom!)\nYou hear me? Hit the Rollie store with the Rollie on\nWhat was our getaway car? A Jag Portfolio\nYou hear me? Ayy, I heard I had some sneak dissers\nWhoever feelin' hot, that AR got a heat sensor\nCuz said don't entertain them hungry niggas\nI wish I would pay attention to these homeless niggas\nDon't call my phone, I don't want to do no song with niggas\nAnd tell yo bitch to tighten up before I bone her, nigga\nI don't know you niggas, fuck wrong with niggas?\nThrough these white buffs I can see the ho in niggas\nFree my nigga Parico, that boy be hoein' niggas\nShoot the smile off your face, I don't joke with niggas\nBoy, I can't trust you with that strap if you ain't got no bodies\nBoy, I can't take you on no lick if you ain't robbed nobody\nYou ain't no shooter, you can't do that shit without no molly\nI came home and had the hoes wetter than Kalahari\nThirty months ago niggas ain't think that I was comin' home\nShout out to them niggas' freaks that I been cummin' on\nGet 'em to the crib, bust 'em down, now bitch run along\nThis SK'll get to shakin' like there's somethin' wrong\nThirty bands two times, watch this money clone\nThe feds say my name hot like when the oven on\nBitch, I came home to my lil' brother gone\nNiggas say they lookin' for me, pull up in the Skuddy zone\nWho said I'm a snitch? You just heard a lie from him\nBetter check the black and white\nThat paperwork will vouch for him\nZero toleration for that nigga, take his life from him\nHe don't want that pistol play? Okay I'll Tyson him\nI ain't hear from bitches when I had them blues on\nSo soon as I'm done fuckin', put your shoes on\nI'm on parole in two states, I can't move wrong\nThe feds tryin' to build a case, I can't move wrong\nI went to trial back to back, bitch I'm 2-0\nThe state of Kentucky banned me from every jewelry store\nSay I can't even be in public with my hoodie on\nMichigan State don't want him here, they don't know what he on\n\n[Chorus]\nI know they prayed on my downfall\nI know they prayed on my downfall\nOn all ten, bitch, I stood tall\nShow these disloyal niggas how to ball"}], "artist": "Tee Grizzley"}