{"artist": "Half A Mill", "songs": [{"album": null, "lyrics": "Yeah...this that shit we bump when we outta town....\nChorus\nWhat you ridin' ridin'?\nWhat you rollin' rollin'?\nWhat you lightin' lightin'?\nWhat you smokin' smokin'?\nWhat you countin' countin'?\nWhat you holdin' holdin'?\nWho you pimpin' pimpin'?\nThem bitches hoin' hoin'\nNow once you f*ck with me bet your life is over\nI got more hoes than Tyson Botha\nBite ya shoulder, bite ya earlobe\nWeeks go by, I let my beard grow\nYa'll lookin' like ya'll tough but ya'll scared though\nThese rap cats is wierdos\nI zone where no Man would dare go\nI'm like the President, testifyin' didn't swear though\nI fear no Man, not even the Lord\nMy niggas still pumpin crack, got a reason to score\nWe made it sweet in NewYork\nSome fake Muslim niggas still eat pork\nAll I do is write the rhyme and let the weed talk\nTell it like it is\nGangster chronicles, credit the Bridge\nIronic, we keep it thugged out, it's better for kids\nThis time it's Nature shreddin' your myths, shreddin' your fame\nFake Willies gettin' settlement money step in the game\nGet their own label, first act flops, don't recruit\nNiggas records ain't hot, them niggas own loot\nNow what you gon' do?\nYo Son, we shine like tons of Platinum\nRefined minds, my guns double action\nMy Duns gettin' head, relaxin'\nI wanna see bread in fractions\nThorough reaction, vest on your chest\nMetal packin', S on your chest\nWe rip the S off\nGod forbid we have to hit them tecks off\nFlip your wig and rip the lid of your Lex off\nI'm deeper than your best thoughts\nWho the f*ck you gonna extort?\nHold trial in the streets, I'll smack the judge in front of his court\nPublic assault\nNine-point-Nine stuffed in the vault\nWe ain't lyin', we roll out on those Hawaiin resorts\nKeep your eyes on the Hawks\n'cause they spy on your corpse\nWe the best in this, private jets fly off the loft\nDeadliest, metal heavy like Isrealeans\nOn the Jersey turnpike me and the God spotted the Aliens\nI burn mics and bury ends\nWho am I?\nI'm like Y2K causin' your computer to die\nRight....\nWhile corner stores sell beers to minors\nNearsighted cops arrestin' mad niggas just 'cause they wearin' diamonds\nThey say I'm steerin' clients\nThey said they got my on tape, the Panasonic\nPut the knot to my head, my Man got it\nAnd they can't stop it\nThey never could and never will\nF*ck a misdemeanor dun, my crimes be fede-rill\nUntil we net a Mil I won't spend shit\nWon't lend shit\nI can't see shit\n'cause thugs can't keep shit\nWith buds and a weed spliff\nDrugs and the heat kid\nUp in the Precinct jakes took your G's and told you to beat it\nWhats the root of all this green shit?\nSubmachines and submarines\nThem ghetto hoes that only f*ck for cream\nHope she buffed you off before she stuck your team\nF*ck what you talk\nWe thugs from NewYork with guns that shoot off\nWhether you hard or soft you still get knocked off\nQuicker than these crills get knocked off\nMy bills still top yours\nCris' still popped off", "title": "What U Ridin - 1810509", "year": null, "image": "https://images.genius.com/252387dd73efb4059051b87e2cf9bbfa.620x474x1.png"}]}