{"songs": [{"lyrics": "Ah yeah, right about now Compton's in de mothafuckin' house [yeah do it do it]\nNWA's in full effect\nHey yo yella boy, kick me that funky-ass beat\nYeah, who's in de mothafuckin' house?\nCompton's in the mothafuckin' house!\nYeah, Compton's definetly in the house\nHey yo Ren, what we're gonna do?\n\n[MC Ren]\n\nTo the people over here\nTo the people over there\nTo the people, the people, the people, people, the people, the people\nPeople From everywhere watching the show\nPaying top dolars because they know\nWhen we're on the stage, we're in a mothafuckin' range\nSo Dre, why don't you get the 12 guage [yeah]\nAnd show 'em how Eazy-Duz-It\nSo if you punks wanna make somethin' of it\nStep up, run up, get up, what's up sucker\nYou want some of this?\nThen you're a stupid mothafucka!\nKickin' - like the kick from a kickdrum\nYella boy on the drum gettin' dumb\nProgrammin' - a beat that's hittin'\nAnd if you listen then you know we're not bullshittin'\nDope - like a pound or a key\nSo shut de fuck up and listen to me\nI make a killin\nI got money to the ceiling [why's that?]\n'cause I'm a mothafuckin' ruthless villain\nMC Ren - stomping any fool in my way\nWith some help from my homeboy Dre\n\n[Dr. Dre]\n\nNow my name iz Dre - de mothafuckin' doctor\nRippin' shit up [oh yeah] and here to rock ya\nWith some help from my homeboy E\nThe criminal of the ruthless posse\nFuckin' it up [word up] iz what we do\nThe reputation of the NWA crew\nGettin' busy because we're cold stampin'\nAnd we're born and raised\nAnd we're born and raised\nAnd we're born and raised in Compton\n\nSpeakin' of Compton, it's makin' me sick [why?]\nEverybody'z talkin' that crazy shit\nSayin' they were raised in the CPT [aha]\nJust as I was, they try to be like me\nPoppin' that shit, get the fuck out my face\nKnowin' that they never even seen the place\nClaimin' my city is my city they claim\nMothafuckaz we're about to put some salt in your game ..\n\nYeah I'm tired of these mothafuckerz runnin' around town, talkin' about\nThey're from Compton and shit, tryin' to get on the bandwagon ..\nYeah Dre, I know what you're sayin' man, but let's tell 'em who we're\nTalkin' about ..\n\nWHAT DO YOU CALL A CREW THAT CAN RAP LIKE THAT ...?\nYo NWA call 'em mothafuckaz wack..\n[yeah you know what time it iz, listen to why we call 'em wack]\n\nThey got a wacky wack record wit a wacky wack crew\nYo what about the lyrics?\nThat shit's wacky wack too\nWith a fucked up style and a fucked up show\nHey yo Ren, what about the scratchin', is it def?\nFuck no!\n\nThe mothafuckin' record is so mothafuckin' wack\nThe mothafuckin' cracka jack needs to step the fuck back ...\n\nDo you want some of this?\nHell no ..\nDre the mothafuckin' doctor\nWell for the record it's Ren and for the street it's Villain\nDre the mothafuckin' doctor\nWell for the record it's Ren and for the street it's Villain\nYella boy, why don't you kick me one of them funky-ass beats?\nMy boy .. my boy .. my boy Ice Cube\nYo we got my homeboy Eazy E in de house\nWon't you tell 'em what your name iz?\n\n[MC Ren]\n\nMC Ren is the mothafuckin' Coroner\nI'm gettin' rid of mothafuckaz as if they was a foreigner\nShow no greed to pretend when I sin\nI punch you can block it but I'm a still get in\nThis ain't a TKO in the first\nBut it's some shit from a nigga in black it's much worse\nThen a beat from Tyson 'cause Ren is not nice and\nYour ass is better off just rollin' a dice and\nFindin' you a number for luck\n'cause you all need it when you see I don't give a fuck\nMy identity, and the shit is gettin' shown\nWithout a video I'm still gettin' on\nI'm at a show then my picture is takin'\nOne click of the flash and punk niggas are breakin'\nTo the door, tryin' to join my fan club\nLipstickin' over one of my dubs\nAnd it's the minimal scratch for the moment\nUntil I fuck up the so called opponet\nThat's standing in the zone of the twilight\nSayin' how in de fuck did he get mixed up in my fight\nIt was'nt a mistake, it was a set-up\nSo until I'm finished poppin' my lyrics you should shut up\nAnd don't attempt to speak\nBecause it's bad enough you rollin' up shit quick\nWith a nigga like Ren about the hit\nNow lemme hear you mothafuckaz talk some more shit\nI'm a bust your ass in your mouth\nYo, unless you're sayin' \"Compton's in de house\"\n\n[Dr. Dre]\n\nWho realy cares - about a sucker on a take off\nBust de move, we can have a shake n' bake-off\nMe and you can go 'cause I don't care yo\nRap fight or guerilla warfare\nWe can rumble, 'cause when my lungs go in and out\nI kick rhymes in a bundle to win about\nOr scarier scaffle\nI just muffle the opposition, there's no competition\nLet 'em know that Dre is gettin' stronger\nCompton's in de house but now it's some' longer\nI won't get set-up, shut up, I'm kinda fed up\nYou can say uncle and I still won't let up\n'cause Dre is the mothafuckin' doctor\nAnd if me and Ren's on the mike it's like propaganda, no doubt\n\"Boy you should've known by now\" ..\n\nCompton's in the house\nYeah, it's time to put Compton on de map, don't ever think you can get it on\nYou stupid mothafuckaz!\n\nCompton's in the house ..", "album": null, "year": null, "title": "Compton’s n the house - live;", "image": "https://images.genius.com/627acab300f5f3fd378a3b1adf4a69f8.630x630x1.jpg"}], "artist": "N.W.A"}