{"artist": "Azealia Banks", "songs": [{"title": "Competition", "image": "https://images.genius.com/3928a7adc764ce0c58a295e374d3dedc.800x800x1.jpg", "album": null, "lyrics": "[Intro]:\n(Okay, okay, okay, okay, okay, okay)\n\n[Verse 1]:\nOkay, soon as I step in the club\nI hit up the back, show my nigga some love\nHit the restroom up when I'm finished\nI seen some bird I ain't seen in a minute\nShe's like \"Banks, where've you been honey?\"\nWhat it look like bitch? Getting this money\nBuying more clothes, I look nice right?\nYou be in that fake shit, and I seen yours twice\nYour shoes, your weave and your purse\nIf you're bad, believe that I'm worse\nYou be online doing mad research\nTryna cop some shit she's seen me in first\nYeah, I make this way too easy\nYou can watch me more than your TV\nMake sure she see, I'm the main bitch on the show like Mo\nY'all can't be missing\n\n[Chorus]:\nCause I give all them competition\nThey don't even deserve my attention\nAnd she can leave before her entrance\nI don't give a fuck bout none of y'all bitches\n(And I don't give a fuck bout none of y'all bitches)\n\n[Verse 2]:\nI wanna get drunk, I'm tryna get lit\nI wanna get fucked, I'm tryna get picked\nThese bitches looking like they wanna get hit\nRazor or the taser, take your pick\nFeeling outspoken and I'm hoping you speak\nCause my homegirl hoping she can open your cheek\nThink twice 'for you open your beak\nCause you can get buck fifty then your face'll be open for weeks\nBut that breaks no sweat, no key\nBitches always got my name up in they mouths like teeth\nBut they do treat treat in the chic boutiques\nAnd her shoes and her brows look cheap\nBaby girl hair so brown but her weave look black\nBitches on (?) cause I seen their tracks\nLip gloss caked up and her make-up baked up\nBaby girl did you just wake up?\nBitches need to get their cake up\nBut these smuts got nut in the gut and it's so, so saved up\nReal shit, she's the Krasdale version\nDust bunnies under rugs like Persian, but because\n\n[Pre-Chorus]:\nI'm here, and if you're popping that six shit\nBitch, I'm right here\nWe be sippin' and trippin', you know mine's clear\nI would let you come toast but we don't like beers\nNo, no\n\n[Chorus]:\nCause I give all them competition\nThey don't even deserve my attention\nAnd she can leave before her entrance\nI don't give a fuck bout none of y'all bitches", "year": "2018-06-10"}]}