{"songs": [{"year": null, "album": "My Life is a Movie", "image": "https://images.genius.com/0939cced5a2b8162cd5d38cb17171350.640x640x1.jpg", "title": "Blues for the Horn", "lyrics": "In a conservative form\nI wanna ask you a few things before I conform\nTo the popular belief about where I was born\nAre they still illin', still killin' poppin' the corn?\nHow's the horn, how's the love wavin' the ocean morn'?\nHow 'bout the young, do they still possess the poetry tongue?\nAnd do they still greet sincere like the depth of the lung\"\nHow's the nomad, did the herd graze well this year?\nFrom the news to what I know, the growin' gap ain't clear!\nHow's the earth, how 'bout the stars under we conversed?\nDo you still await on change like a new moon's birth?\nDoes it still flood ancient wisdom parallel with blood?\nDo you still see the pain of vision holy/only scriptkeeper?\nOr did you fight off the plight of the colonized mind?\nWhat of the rainy season, do the kids still bury seeds?\nAnd get taken with uncertainty like me scared of leavin? '\nHow are the poets, the women and the orphans torn?\nI miss 'em all like, old opportunities gone\nWhat of the elders, story tellers in abandoned homes\nMiss 'em all like, childhood, reminisce with songs\nDisputes, do they still settle 'em by bloodying shoes?\nFist rules, rather finger equipped with sick tools\nWhat of the wind, I recall it was serenity's end\nWhen the breeze would come and the trees would bend\nAnd the people would say \"look what it leads with sin\"\nAnd the air was violent and our care was silent\nAnd the only law we bore was of pair of tyrants\nMan you know, this is why I'm down in deep indigo\nAnd I sleep really poor, on the circumstance floor\nAnyway, how's stress, does it still rule your chest?\nDo the camps still rape girls with no breasts?\nOur moms, are they still screaming \"put away the arms\"?\nAnd against the dispossession of their family-owned farms\nHow are the many rivers and the lakes and the seas?\nAre they still angry with us for our poisonous deeds?\nAnd the lakes and the seas\nFor our poisonous deeds\n\n[Hook]\nThis is my blues for the horn, for the horn\nThis is my blues for the horn, for the horn\nThis is my blues for the horn, for the horn\n\nSo who's dead and who's alive, did the rates multiply?\nDid the poor fight the drought with their minimum supply?\nDid the warlords abort the wars and for supporting the peace, they force\nTo promote disease and easening 'creased divorce?\nWhat of police and courts, are they still even in force?\nLeaking pores and cheatedly to the bleeding corpse\nWhat of the kind and good, can they still, laugh intensely\nLike the, mind and word or is it, innocense lost as I understood\nAnd what of the playwrights, reflection in the scapes of great sights\nRevolution from power's the writings of brave fights\nDespite the luxury that you hear(d) we live by\nI head with refuges and niggers ain't share right, and\nDon't you play soccer by the ocean front?\nIn America, I shovel the snow while I'm smoking blunts\nYou mean to tell me that you out there still totin' guns?\nBloating sons of the hardened, hardly copin' moms\nDamn you and circumstance too I can't stand you\nYou make a mockery of our struggle like hollywood plans do\nAnd I swear to god I wish you hell, burn and bake too\nAnd I curse the Europeans who instigated you worse\nAnd I curse the Russians who impregnated the kalashnikov birth\nAnd hurts you never wake and see the destiny\nIt's like the conflict of self, submerged in satanic hate\nRemember eatin' food, walking back in hot sun from school\nBare feet, the hot sand, massaging our feet is\nCause now my mother slips on the ice and her back is weak\nAnd I feel like a failure, a mute in the age of speech\nLook at me, yo! look at me, look dead in the eyes\nDon't flinch, you are an accomplice to great white lies\nI can't even begin to express how breakdown and stressed\nI gotta live to tell, give me a bullet-proof vest\n\n[Hook]\nThis is my blues for the horn, for the horn\nThis is my blues for the horn, for the horn\nThis is my blues for the horn, for the horn"}], "artist": "K’naan"}