{"songs": [{"album": "The Seasoning", "year": null, "title": "Dig Deep", "image": "https://images.genius.com/f4f6f65df801065862f2f5cc2ad24ec5.500x500x1.jpg", "lyrics": "Let me show you they can't disguise or deceive\nEven agnostics on scribes show their unconscious belief\nNapoleons known to be a genius, this is his own thesis\nHe wrote there's got to be more to this man Jesus\n\nJosephus said that He was alive\nAnd Thallus talked about darkness covered the skies the moment Jesus was crucified\nSo how can skeptics say that He never lived\nWhen unbelievers from the first century said that He did?\n\nWell none of these dudes are biblical texts\nThey are historians that wrote about the physical facts\nSo unbelievers, I'm going keep it, outside of biblical text\nTo prove that Christ lived, died and had to have resurrected\n\n'Cause we got to give you people the truth\nEven if it means that we gotta dig deeper for the truth, He'll see us through\nAnd we can't just sit at home inside of our prayer closets\nHit the bricks man up! It's time to go spread the Gospel\nHit the bricks man up! It's time to go spread the Gospel\n\nNow they say on the cross that He never died\nAnd He faked his death but his strength was miraculously revived (uhh...)\nWell there is no way that can be\nWhen your crucified your arms stretch, your lungs drop, and there's no way you can breath\n\nDon't take it from me, ‘cause the proofs scientific\nFrom the same dudes you use for your evolutional witness\nThe truth is depicted. Their saying that the Bible has lies\nThey used ropes, and people's hands and feet were actually tied\n\nWell let's separate the fake from the real\nFor a century man was found with a stake stuck in his heel\nSo that proves that this procedure was actually used\nAnd if skeptics are the ones lying why are the Christians accused?\n\n'Cause we got to give you people the truth\nEven if it means that we gotta dig deeper for the truth, He'll see us through\nAnd we can't just sit at home inside of our prayer closets\nHit the bricks man up! It's time to go spread the Gospel\nHit the bricks man up! It's time to go spread the Gospel\n\nNow they say that he never rose from the earth\nWell if you question the resurrection explain to me that wrote to the church\nSee if Peter had denied to His face, then He had to have seen Him after the rise\nThen tell me why else would Peter die for the faith?\n\nI urge you to not be deceived\nBecause they have no proof to refute the truth in which we believe\nLuke was indeed, a historian that was great\nWouldn't make an ounce of sense to write in a incalculable faith\n\nI'm just trying to back the facts of this\nYou can't deny conclusive truth just because it is miraculous\nIf you wonder after the curtain was cracked\nIf He rised to the right hand of the Father\n\nYeah, it's certain of that\n\n'Cause we got to give you people the truth\nEven if it means that we gotta dig deeper for the truth, He'll see us through\nAnd we can't just sit at home inside of our prayer closets\nHit the bricks man up! It's time to go spread the Gospel\nHit the bricks man up! It's time to go spread the Gospel"}], "artist": "Json"}