{"artist": "Cam’ron", "songs": [{"title": "Grill Em (Remix)", "album": "Cam’Ron Presents DukeDaGod - DipSet: The Movement Moves On", "year": null, "image": "https://images.genius.com/ab7fbc8260d362511ebef8206fd74571.300x300x1.jpg", "lyrics": "[Bridge: JR Writer]\nThis that get 'em sound\nThis that get it down\nThis that 2 step, wheel shaker, spin around\nThis that pick a clown, size him up, try ya luck\nPlaya hate, grill him down, lemme see you twist ya frown\n\n[Cam'Ron]\nThey got guns, well maybe they'll squeeze\nI'm a piano I got 88 keys\nMami sniffed it, it went to baby brain\nRode the subway now I'm on the gravy train\n\nWhat you call balling, all y'all boring\nKnock his teeth on the grill, \"Paul Wall foreman\"\nAll these pricks, I took weed trips\n\"Tore the club up\", yep, on that 3 6\n\nI'm the realest of cats, and I'm still where it's at\nI been broke with the South, trill to the trap\nStealing, wheeling caps I been peeling them back (back)\nWe dealing you squealing, we killing the rats (rats!)\n\nSantana.....KILL EM KILL EM KILL EM, KILL EM!\nJ.R...GRILL EM GRILL EM GRILL EM, GRILL EM!\nI will pop you while I'm popping a pop-a-wheel\nPaid In Full not the deal...put him in Potter's Field\n\n[Hook: JR Writer]\nDON'T STOP, GRILL EM!\nDON'T STOP, GRILL EM!\nDON'T STOP, GRILL EM!\nDON'T STOP, GRILL EM!\nDON'T STOP, GRILL EM, GRILL EM, GRILL EM, GRILL EM, GRILL EM\nDON'T STOP, GRILL EM!\n\n[Hell Rell]\nMr. Ruger picture a coward confronting me\nNature's mad because the trunk is in the front of me / (foreign)\nGangsta's on In the back of me, hammer on the hip of me\nHand full of piffery, damn I know they sick of me\nThey gon' say the boy's the hardest this year\nAnd I'm a G so, I'mma eat regardless this year\nCome to the crib, yeah it's retarded in there\nBig screens, suede couches, bunch of marble in there\nDamn, undercover hating, shit just let it out\nAnd why ya hair done ma, all you gon' do is sweat it out\nGo through any nigga town and Dipset it out\nShit they'd rather set him up then just set him out\nMake these nigga's bleed, make 'em blood donors\nAnd they don't wanna let me in, smack the club owner\nGot shades on, I'm always high bitch\nYou looking at a star, I ain't even in the sky bitch\n\n[Hook]\n\n[Bridge: JR Writer]\nThis that get 'em sound\nThis that get it down\nThis that 2 step, wheel shaker, spin around\n\n[J.R Writer]\nThe sporty is foreign, shorty's adoring (all day)\nFuck if the couches are suede, my Mauries are on 'em (fuck it)\nI'm fresh head to toe check how bad the don bling\nA thousand grams, chain got a Barry Bonds swing (bling!)\nI get her with the swag, then get 'em with the Jag (errrr!)\nWhat's on my left sleeve is what get 'em to the pad\nThem chickens in a bag, you ain't fresh in my eyes\nI ain't doing nothing to her but she's letting me slide\nFrom the floor to the bathroom, hall to the backroom\nThen dog out the whore, on his balls like a vacuum\nMack 'em and duck to the back of the bus\nShe's a scraggler and yup, she ain't wack but she sucks\nIf you act like a scrap then in back is a truck (with what?)\nWhere they packing a Mac with some caps for you smucks\nHuh, I can't stand to slouch, you know what fam's about\nShe ask to see my grill so I pulled the Phantom out (look at this grill)\n\n[Hook]\n\n[Outro: JR Writer]\nThis that get 'em sound\nThis that get it down\nThis that 2 step, wheel shaker, spin around\nThis that pick a clown, size him up, try ya luck\nPlaya hate, grill him down... lemme see you twist ya frown"}]}