{"artist": "Bhad Bhabie", "songs": [{"lyrics": "[Intro]\nD.A. got that dope!\n\n[Chorus: Bhad Bhabie]\nGo bitch, go bitch, go bestie\nCan't fuck with these hoes 'cause they messy\nGo bitch, go bitch, go bestie\nCan't fuck with these hoes 'cause they messy\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend\nThat my what? That my muhfuckin' best friend\n\n[Verse 1: Kodak Black]\nAyy, shorty, she gon' ride, she gon' die for me\nYeah, I know all my niggas, they gon' slide for me\nI be goin' up when you goin' down on me\nWhen I come through, I got the four pound on me\nEvery time I'm on the scene, I be toolied up\nWhen you comin' through our city, put your jewelry up\nIn a dually truck, Doo-Doo got his toolie tucked\nI love my baby, you can't talk to her, she rude as fuck\nGo Kodak, go Kodak, get money\nI don't fuck with rap niggas, they funny\nGo Kodak, go Kodak, get money\nI don't fuck with rap niggas, they funny\n\n[Chorus: Bhad Bhabie]\nGo bitch, go bitch, go bestie (Go bestie)\nCan't fuck with these hoes 'cause they messy\nGo bitch, go bitch, go bestie (Go B)\nCan't fuck with these hoes 'cause they messy\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend\nThat my what? That my muhfuckin' best friend\n\n[Verse 2: Bhad Bhabie]\nGo best friend, that's my best friend\nThat's my main bitch, that's my fuckin' best friend (Best friend)\nIf you got a problem then we got a problem\nIf she got a problem then you got a problem (Bitch)\nShe gon' twerk, twerk, twerk, twerk, twerk that ass\nLike it's her fuckin' birthday, bitch twerk that ass (Twerk that ass)\nThat's my best friend, that's my fucking bestie\nCan't fuck with you hoes 'cause you messy\nPull up to the party, I got everybody lit\nI could brag about my best friends, everybody rich (We rich)\nDouble dutching with the money, I be playin' with the bands\nBirkin bag, Fashion Nova, Cartier on the lens\nEvery time we pull up, bitches pissed off (Pissed off)\nMake the whole club jump like Kris Kross (Kris Kross)\nI'm a bad bitch, poppin' like lip gloss (Lip gloss)\nWe be blowin' money fast like Rick Ross (Rick Ross)\n\n[Chorus: Bhad Bhabie]\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy ('Cause they messy)\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy\nGo bestie, that my muhfuckin' best friend (Go, go, go, go, go, go)\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend (Go bitch)\nGo bestie\nThat my what? That my muhfuckin' best friend (Go bitch)", "image": "https://images.genius.com/5fd5003b7556815592f312517a6a82bd.1000x1000x1.jpg", "year": "2019-01-31", "title": "Bestie", "album": "BB1*"}]}