{"songs": [{"title": "Asc Mclaren", "album": "Mr. Midnight", "year": "2019-06-29", "image": "https://images.genius.com/6659527e1d927b401e994eff3a8867ac.1000x1000x1.jpg", "lyrics": "[Intro]\nToday, fuck all the bullshit, I'm having a good day\nI don't wanna hear none of the bullshit, you know what I'm saying?\nCardo got wings\nCardo, what's happening?\nFuck it, I'ma tell you how my day went (Ay, ay, ay)\n\n[Verse]\nGot a call from a bitch I've been waiting to hit\nMy smoothie came out perfect, mhm, this hemp\nMake sure my house clean, I be sweeping and shit\nSaleen McClaren 89' ain't too many of them\nPostmates some Thai food and then I wash me a load\nI wear my white tees once so I ain't do none of those\nI keep it G with these hoes, I play the game how it goes\nI'm giving game for your soul, so write these down in your notes\nI like your style we can chill, took her out for a meal\nYou hella pretty, for real, so soft for real\nLove, I'm on my way, I just need a little minute\nSippin' on this juice with a girl named Cindy\nI told her straight up you can be my little secret\nLet her ride around through the city in my fifty\nShe always strap up the Air Max when she with me\nMy nig, I didn't learn this, it's just in me\nAll my cars bussdowns and I got plenty\nLooking like I'm fresh out the 90's moving Whitney\nSo much money in the safe, had to switch it\nUncle Larry's Orange Juice when a nigga sippin'\nWhat's happening?\n\n[Bridge]\nGood morning (Bitch ass niggas)\nAsc McClaren (My dad had this)\nI copped the 89' (I always wanted this whip)\nOnly a few of these (Only a few, for real)\nShit, I had to cop it\n\n[Chorus]\nNow a nigga slidin', gotta watch the mileage\nDope man, dope man, looking like I got it\nBend another block, a jug, jug, jug\nStill keep it in my sock, that's how dope boys do it, yeah\nNow a nigga slidin', gotta watch the mileage\nDope man, dope man, looking like I got it\nBend another block, a jug, jug, jug\nStill keep it in my sock, that's how dope boys do it, yeah"}], "artist": "Larry June"}