{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "Carolina On My Mind", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Intro]\nYea Yea, uh\nIt's Carolina, nigga\nYeah\nAy\nFayettenam\nYeah!\n\n[Verse 1]\nListen, alive and still kickin nigga\nI survived the ville\nBut a lot will not, so they wield Glocks and Bonnevilles\nNiggas lying, still get high, they ride and kill\nMoney hungry, tryna find a meal\nCan't stay inside and chill\nLittle niggas thinking: 'fuck school, I'm finna sign a deal!'\nHunting hoes, trapping niggas\nLying like they on the pill\nPreachers say we blessed\nBut all we feel is stressed, tryna deal\nIf this liquor don't help, nigga, this marijuana will\nRoll up, I take a shot for them niggas behind the steel gates\nMy mind is still- racing, I'm tryna kill- snakes\nCause niggas is fake, but wait, time reveals so\nNevermind, that real shit is what I am tryna build\nIt's kinda I'll how I'm giving y'all that Carolina feel\nA nigga so deep, you tryna find me dog, you gotta drill\nIt's kinda I'll how I'm giving y'all that Carolina feel\nA nigga so deep, you tryna find me dog, you gotta drill\nYeah\n\nYo, Coming home, y'all\nListen\nAt any given time, got the city on my mind\nThe city on my mind\nThe city on my mind\nI'm riding round feeling like the city, it is mine\nThe city, it is mine\nThe city, it is mine\nAt any given time, Carolina on my mind\nCarolina on my mind\nCarolina on my mind\nSaid \"I feel ya pain nigga, but I'm tryna go for mine,\"\nI'm tryna go for mine\nI'm tryna go for mine\n\nHey\nAy, fuck them hoes, let them bunnies be\nPerfect vision I'm 20/20 for this money, G\nSee it's funny, you get that paper, then them honeys show\nCause they know we finna blow, like a runny nose\nMoney goes, the money come\nBarely twenty-one, I'm thinking big things\nMomma in the mansion with the fish tanks\nThe Carolina way\nIf you in college then you know the crime won't pay\nLest you find a way, fuck what them niggas is tryna say\nCause in Carolina- we thorough\nMy niggas hold it down all the way from Fayettenam to the G-boro\nAnd up in Winston, and Raleigh, did I mention?\nThe Bull City got them ol' fake niggas flinchin'\nTar heels state, either you shooting or you hoopin' yo\nNiggas can't wait for them Panthers to win the Superbowl\nSo shout out to them super cold niggas up in Charlotte\nNo matter the city, man, Carolina shine, regardless!\nYea\nYo, coming home nigga!\n\n[Verse 2: Deacon]\nRiding big in an ol' school Chevy\nWith the windows down when I'm rolling through my city, like\nOoh!\nOn my way to meet up with a freak and my nigga drunk beating\nShe can hear me down the street, she like 'Ooh!'\nBlew game and I do my thing\nAin't tryna settle down, I ain't shopping for no ring\nOh no!\nRiding with my niggas for the weekend\nCarolina sounds pumping out the speakers, like\nOoh!"}], "artist": "J. Cole"}