{"songs": [{"title": "Second Chance", "lyrics": "Young Noble Verse:\n\nPeople like to wait till times is hard\nBefore they find a little time for god\nWe all grinding HARD!\nSometimes we don't even get the message\nBefore I count the paper\nI'm counting up my blessings\nDeeper then rap every verse it true\nLook around how many people doing worse then you, Yeah!\nWe still complain hide behind the pain\nWe are all worth sin in me it's all in the brain\nYoung Niggas better watch the signs\nThe good die young in these hostile times\nYou gon' wish you can turn back the hands of time\nStuck on the block and your whole life passing you by\nPay attention to your hommies before you take there advice\nAnalyze what they sayin' where they at in there life\nGet yourself around people thats a positive influence\nMake a positive change little homey and stick to it\n\n[Hook Young Noble]\n\nThe little hommies never got a second chance\nThe big hommies never got a second chance\nMy enemies never got a second chance\nThese young niggas never got a second chance\n\nBig D Verse:\n\nTraumatic flashbacks of the rain that falls black\nMy lyrical bars drop quick like sand traps\nLost Souls like Tupacs and outlawz Gang Related Soundtrack\nWise sentences venomous nemesis since the genesis\nReality turned mythical like Pegasus!\nSome took a rebels path now they watch the devil dance\nPraying for a second chance in effort to be a better man\nExchanged fetters for feathers, man\nToo many lives takin since the creation of knives\nGuns and such bombs abusive dads and f'ucked up moms\nKids that don’t understand what’s right what's wrong\nI’ve committed too many sins, witnessed to much death\nSuicidal images in my head of leaving cuts in my neck\nTalkin' tense of the past cause I feel events are destined perhaps\nPerfectionist? damned? if my life was destined in the sands\n\n[Hook Young Noble]\n\nThe little hommies never got a second chance\nThe big hommies never got a second chance\nMy enemies never got a second chance\nThese young niggas never got a second chance\n\nGrizzly Verse:\n\nMy rhymes are venomous\nInvisible infamous images\nAn intimate imagery influenced killing them elements\nMy business is limitless, stimulus, spitting my synthesis\nLyrical impetuous, surrender to my wickedness\nBuilt like pyramids, tongue made out of eloquence\nWhile I see those rappers just talking with a mouth of decadence\nTeaching little kids arrogance, limiting their excellence\nBut y'all can't reach us analysts cos were flyer than pegasus\n\nGrizz, what have you done other than Hustling?\nYour just another thug tryna' sell another gram\nHave you ever tried or worked to be a better man?\nSo tell me do u think that you deserve a second chance?\n\nNo I don't.. Cos I'm on to the streets\nBlood, sweat and tears, hustle hard for the green\nOr for a second chance cos it's not fuckin' free\nSo I take a bigger step like Godzilla feet\n\nMy kind of jungle, concrete\nNot anyone that could survive these raw streets\nI stand my ground, strong roots like palm trees\nHow could we be good when everything is not clean?!\nThe only time I could right my wrongs\nIs on a paper just to write a song\nNo father figure to show me how\nOr what to do.. When times get hard. Preach!\n\n[Hook Young Noble]\n\nThe little hommies never got a second chance\nThe big hommies never got a second chance\nMy enemies never got a second chance\nThese young niggas never got a second chance", "album": "Divine Genesis", "year": null, "image": "https://images.genius.com/381efa5c53b0545940357400ece68b6f.500x500x1.jpg"}], "artist": "Young Noble"}