{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Doin’ It Well", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Intro: Jadakiss]\nAy yo yo yo, ay yo WHAT!\nMotherfucking you know who it is, ya mean? Ya boy, the motherfuckin' everything\nI'm everything (hahahahaaa)\nBut we neither here nor there this is for ma motherfuckin' biatch!\nNicki Minaj, Sucka Free, I love you baby, you know I'm lookin for you, you be dodging me, ya mean, you be in Miami layin' songs and all dat but uhm it's all good\nYa'll Niggas make sure ya'll ch-check this shit out right here, Sucka Free, Nicki Minaj\nSpittin' that shit for y'all niggas and bitches, ya dig?\nStop hidding from me too, Sucka Free, Muthafucka WHAT!\n\n[Talking: Nicki Minaj]\nRemix\nAyo Kiss\nLook, I mean you know my aka \"sit on your favorite rapper face\" and shit, you know like, I mean you know\nThe question today is who's my favorite rapper like everybody wanna know, naw mean?\nHahaha, guess what? You're my favorite rapper\n\n[Verse: Nicki Minaj]\nListen, I'ma spit on it then I'm gon' sit on it\nYou could fuck my girls too, daddy I'ma condone it\nI'ma put my lips on ya lips, who's fatter?\nNigga, you could ask Michael Jack who's badder\nYou can lick it from the front and you can lick it from the back\nWhen I jiggle my ass you can do your little laugh (hahaha)\nYou so funny Kiss, I wanted to fuck you since you worked with that yummy bitch\nAnyway, I got a tight little honey dip\nThat's why these niggas get tight when honey dip\nNiggas know my pussy taste like mango tango\nSo they put a couple karats in my ankle bangles\nWhen my legs go back you can hear them jangle\nOnce you pop you can't stop like a can of Pringles\nLet me grab the mic while I spit ya song, six seconds Jadakiss your on...\nUh-uh on, uh-uh-uh on\nUh-uh-uh-uh-uh-uh-uh on\n\n[Hook: Nicki Minaj]\nDoin' it and doin' it and doin' it well\nI represent Queens, he was raised down in Yonkers\nDoin' it and doin' it and doin' it well\nDoin' it and doin' it and doin' it well\nDoin' it and doin' it and doin' it well\nI represent Queens, he was raised down in Yonkers"}], "artist": "Nicki Minaj"}