{"artist": "Yung Bans", "songs": [{"album": "MISUNDERSTOOD", "image": "https://images.genius.com/c55ba95243ed83d96b06d89b787e573b.1000x1000x1.png", "year": "2019-04-27", "lyrics": "[Intro]\nAnd then the smoke got me\n\n[Chorus: Yung Bans]\nAll black with a mask, feel like Bruce Wayne\nI'm on way too many drugs, it feel like Novocaine\nI can't feel no pain, no, I can't feel no pain\nMade it through the rain, think it's time to spread my wings\nI was 15, ridin' with that blicky, yeah\nIf I die today, I wonder, will they miss me?\nTurn to a demon with that fire, a hundred shells in the street, huh\nIt's a hundred shells in the street\nIt's a hundred shells in the street\nIt's a hundred shells in the street\n\n[Verse 1: Yung Bans]\nYeah, Dracs and .223's, sweep himm off his feet\nGet that pack from overseas, trap, trap gon' beat\nI got it on me, that MAC in my jeans\nI got it on me, that MAC in my jeans\nWhat you smell on my breath? Pure promethazine\nAnd you can do what you want when you poppin' when you a lil' nigga like me\nYeah, booted up, geeked, huh\nLil' bitch on fleek (Lil' bitch on fleek)\n\n[Chorus: Yung Bans]\nAll black with a mask, feel like Bruce Wayne\nI'm on way too many drugs, it feel like Novocaine\nI can't feel no pain, no, I can't feel no pain\nMade it through the rain, think it's time to spread my wings\nI was 15, ridin' with that blicky, yeah\nIf I die today, I wonder, will they miss me?\nTurn to a demon with that fire, a hundred shells in the street, huh\nIt's a hundred shells in the street\n\n[Verse 2: YNW Melly]\n.223's and Dracos, MAC-11's, lay low\nHollow tips rip through you and give your ass a halo\nShe say she like the way that a young nigga be drippin'\nI'm shootin' at your top, I don't check you with good precision\nHave your body in the casket leakin' bodily fluids\nDon't fuck 'round with my killers, yeah, we all goin' stupid\nYou say you with it, well, I'm with it too\nIf I die today, would you miss me?\nIf I die today, would you miss me?\nWhat if I'm in my casket, girl? Would you kiss me?\nYou do it, would you do it?\nHave your body in the casket leakin' bodily fluids (Yeah)\n\n[Chorus: Yung Bans & YNW Melly]\nAll black with a mask, feel like Bruce Wayne\nI'm on way too many drugs, it feel like Novocaine (Novocaine)\nI can't feel no pain, no, I can't feel no pain (No pain)\nMade it through the rain, think it's time to spread my wings (Spread my wings)\nI was 15, ridin' with that blicky, yeah (With the blicky)\nIf I die today, I wonder would they miss me? (Would they miss me?)\nTurn to a demon with that fire, a hundred shells in the street, huh (A hundred shells in the fucking street)\nIt's a hundred shells in the street\n\n[Outro: YNW Melly]\nA hundred shells in the street, Melly, baby\nYung Bans, runnin' up them Benjamins, gettin' to them bands\nHollow tips and shit, won't do no hands\nMan, y'all already know who it is, man\nThis your boy YNW Melly, bitch, I'm gon' be out of here\nShout out to all my fans, man\nYoung Nigga World, Young Nigga Way until my dying days\nStraight like that, you know what I'm saying?", "title": "100 Shells"}]}