{"songs": [{"title": "American Dream", "lyrics": "[Intro: Jeezy]\n(Cryin', cryin', cryin')\nYeah, what’s up? (Yeah! What’s up?)\nWelcome to America baby (uh)\nHome of the brave, American Dream, you know? (yeah)\nUh, yeah, yeah\nLet’s go\n\n[Chorus: Jeezy]\nI just want a big ol' bag of money when I see my jeweler\nGet a hard-on when I'm counting up that mula (what's up?)\nScarface, into living life like a king\nEvery day eating good with my team, the American Dream\nFirst, they said I wouldn't, but I knew that I would make it (I knew it nigga!)\nCopped my first pie, yeah, I knew that I could bake it (what's up?)\nScarface vision, living life like a king\nEvery day grinding hard with my team, the American Dream\n\n[Verse 1: Jeezy]\nYou either good or you great, you either real or you fake\nThat's why I stay spittin' the real because the real ones relate\nY'all must was raised by some haters, you niggas go ahead and hate\nF-F-Four car garage for the 'Rari, that bitch came with the estate\nI swear them streets get so tricky, glad I ain't fall for the bait\nSo focused and I'm determined, can see that shit in my face\nYou niggas go 'head and face it, lil' bitch, ain't shit 'bout me basic\nHit a lick on them bitches and went and iced out a bracelet\nNever let my flaws and my past come get the best of me\nTurn a two fifty to a half, I got the recipe\nFirst, my president was black, now my president is wack\nI ain't never going broke, what's American in that?\n\n[Chorus: Jeezy & J. Cole]\nI just want a big ol' bag of money when I see my jeweler (yeah)\nGet a hard-on when I'm counting up that mula (ha ha!)\nScarface, into living life like a king\nEvery day eating good with my team, the American Dream\nFirst, they said I wouldn't, but I knew that I would make it (alright)\nCopped my first pie, yeah, I knew that I could bake it (alright)\nScarface vision, living life like a king\nEvery day grinding hard with my team, the American Dream\n\n[Verse 2: J. Cole]\nGot money to make, blow out the candles then cut up the cake\nThen I put it on plate, I'm running the game, you running in place\nStill a youngin' at heart, but mentally, bitch I'm a hunnid'-and-eight\nLike Pun in the late 90s, my niggas is juggling weight\nRunning from state to state, gun in the waist for safety\nI'm on a paper chase, whatever it takes to make me\nA millionaire, silly 'cause how many really get there?\nI mean, how many niggas is Jeezy?\nY'all make this shit sound so easy\nBreezy, turn on the TV, see these niggas that trap on the CD\nMeanwhile, back home, my niggas sell crack at the BP\nHoping one day they can be thee\nNiggas is there on the screen\n'Cause that's the American Dream\nNow here go the thing, listen\nHysterical screams, coming from mothers that buried their kings\nOr the unbearable pain of watching 'em walk out with the sheriff in chains\nBecoming a number, they no longer care about the name\nWhite folks been getting rich off of cocaine\nThrough some underhanded methods, I don't got time to explain\nOut of fear that I won't reach 'em and since preaching ain't my thing\nI just drop a gem or two within a few verses I sing\nFor all my real niggas trapped inside the game\nYou know that already\n\n[Chorus: Jeezy]\nI just want a big ol' bag of money when I see my jeweler\nGet a hard-on when I'm counting up that mula (ha ha!)\nScarface, into living life like a king\nEvery day eating good with my team, the American Dream\nFirst, they said I wouldn't, but I knew that I would make it\nCopped my first pie, yeah, I knew that I could bake it\nScarface vision, living life like a king\nEvery day grinding hard with my team, the American Dream\n\n[Outro: Kendrick Lamar]\n(Yeah yuh)\nThese streets made for ballin' (yeah yuh)\nTen toes ain't for fallin' (yeah yuh)\nI hear the world callin'\nTell me if ya all in (tell me if ya all in)\nLook, look, I gotta eat, I gotta, make money with\nI gotta feast, I gotta re-ly on what is known to the travelin' man\nSet his own, got my Bible and my rifle in my hand, oh yeah\nI gotta eat, I gotta, make money with\nI gotta feast, I gotta re-ly on what is known to the travelin' man\nSet his own, got my Bible and my rifle in my hand, oh yeah", "album": "PRESSURE", "year": "2017-12-14", "image": "https://images.genius.com/645fca71831b59a881058d9b5962da87.685x685x1.png"}], "artist": "Jeezy"}