{"artist": "Fashawn", "songs": [{"year": "2016-07-29", "album": "The Land Soundtrack", "image": "https://images.genius.com/328ec34099f44f9b36eabca9b2cbe6d2.620x620x1.jpg", "lyrics": "[Intro]\nYeah, uh, uh\n\n[Verse 1]\nLivin' with the brother of his mother in the gutter of Cleveland\nSubject schemin', hustle and thievin'\nCarjackin' with a bundle of knucklehead heathens\nThey sell it for a couple hundred bucks the next evenin'\nCisco is his name, only child\nProduct of a broken home, he would (?) the wild\nHardly ever hugged his mother, her aroma was foul\nFor the dope, give you dome was the style, uh\nShe laid a overdose and left Cisco on his own\nWeight of the world, he holds it alone\nAll he got is his deck and his dogs\nAnd El Camino, some Corvettes for her son\nSupplyin' the whips, some how got to get rich\nIn the streets of Ohio, he took an obvious risk\nI watch them sell molly in an alley of six\nHe felt like he get swallowed in a bottomless pit\n\n[Hook]\nAll day long, get that dough\nFlip that pack, go back get more\nIt comes fast or it comes slow\nWhen the strip hot, he get low\nHe flaunt it though, get that dough\nFlip that pack, go back get more\nIt comes fast or it comes slow\nWhen the strip hot, hot, hot\n\n[Verse 2]\nHe was sister and brotherless\nFatherless, motherless\nBuilt the camaraderie with the posse he's runnin' with\nFamilia was somethin' he lacked\nHugged the block for so long it started hugging him back\nInnocence gone, I see it in his eyes when we meet\nI can identify he reminds me of me\nMet him all\nSince 1999 was the street\nRound the time E 1999 was released\nCisco graduated, got a crime PhD\nBlinded, can't see his own demise at his feet\nHis reality's far cry from his dreams\nOf bein' pro skater, gettin' signed to a team\nHe's becomin' someone you won't miss\nGot a price on his head in the 216\nWhat it's bout, who got that and who got this?\nYoung homie gon' move that brick\nLong live the dealer\n\n[Hook]\nAll day long, get that dough\nFlip that pack, go back get more\nIt comes fast or it comes slow\nWhen the strip hot, he get low\nHe flaunt it though, get that dough\nFlip that pack, go back get more\nIt comes fast or it comes slow\nWhen the strip hot, hot, hot\n\n[Outro]\nYo, walk with me over here, walk with me over here. Have you ever met somebody that remind you of somebody that reminds you of-of yourself? What up to my man Cisco. Where ever he is, I hope he's still grindin', my nigga. That's how it is in the streets, it happens every day -- I know a Cisco, you know a Cisco. Cisco's theme song, dedicated to all the hustlers. Long live dealer, long live the dealer, long live the dealer, long live the dealer", "title": "Cisco’s Theme"}]}