{"artist": "A$ton Matthews", "songs": [{"title": "One Time", "image": "https://images.genius.com/3d98a2eb868c1e912a73c21f9b8e7516.300x204x1.jpg", "album": null, "lyrics": "[Intro - Excerpt from film 'Menace II Society]\nAye, you know what, nigga? You acting like a little bitch right now. You acting real paranoid and shit. Now, these motherfuckers smoked your goddam cousin in front of you nigga! Blew his head off in front of your face, and you ain't gonna do shit? You acting like a little bitch right now, nigga. Man, fuck that. I ain't letting that shit ride\n\n[Chorus]\nOne time, one time, its one time, fuck the one time\n(What What)\nOne time, one time, its one time, fuck the one time\n(What What)\nNow can get a hell yeah, hell yeah, hell yeah, hell yeah\nNow can get a hell yeah, hell yeah, hell yeah, hell yeah\n\n[Verse 1]\nBurnt fiens on the curb of 223rd street\nMe and my cousin under thirteen\nHawaiian Gardens, yellow tape around the first scene\nThat I caught, fallen angels under nights watch\nMy eyes locked on a blood stained sidewalk\nWe fight for it, we die for it, the circle of life, my nerves sit on ice\nThe block hot and I done watched the birds circle it twice\nI'm searchin for Christ, he ain't answerin\nA.I. arm sleeves, where the answers is, family dinners meet candles lit\nI can still hear his momma screamin\nDaughter too young to know that her father leavin\nAnd never comin back, we the product, we come from that\nAnd they wonder why we bustin back\nBlack or Brown, Blues hate We\nBut niggas get shot everyday b\n\n[Chorus]\nOne time, one time, its one time, fuck the one time\n(What What)\nOne time, one time, its one time, fuck the one time\n(What What)\nNow can get a hell yeah, hell yeah, hell yeah, hell yeah\nNow can get a hell yeah, hell yeah, hell yeah, hell yeah\n\n[Verse 2]\nSummer '08, niggas snitchin and Ralph gone\nThe beef jumpin I'm knee deep in this hell zone\nWell known, the fiens leap for my phone\nShootin jumpers off the 860\nCamry bucket with the paint chippy\nFlame dripping, say you bangin, you lames mystery\nThem Looney Gangstas leave your names history\nThats how I'm giving it up, Its one in the head, with 8 in the cut\nThree fingers down, middle fingers is up\nTo the enimigos, co-signs we ain't never need those\nFair fades it was rare to see those\nThats why we shooting first and asking last\nThem blickers hit the stash when them badges pass\nCause it's do or die in the summer time\nIt's get back the same night if it's one of mine\nSeasons change the cycle stays, its night and day\nMomma hate the way I'm living, God can't make a brighter way\nCause them shots will leave you like a tidal wave\nAnd if its gang related you don't even see the time or day\nCause it's the life we chose, rockin since a snotty nose\nMommy knows, I was catching bodies out them sliding doors\nTook mine and young and brazy what it made me\nBut niggas get shot everyday b\n\n[Chorus]\nOne time, one time, its one time, fuck the one time\n(What What)\nOne time, one time, its one time, fuck the one time\n(What What)\nNow can get a hell yeah, hell yeah, hell yeah, hell yeah\nNow can get a hell yeah, hell yeah, hell yeah, hell yeah", "year": "2016-07-11"}]}