{"artist": "YG", "songs": [{"image": "https://images.genius.com/ba2a73211e21ff3e11eba91f3f156e9d.1000x1000x1.jpg", "year": "2014-03-18", "album": "My Krazy Life", "lyrics": "[Produced by Metro Boomin]\n\n[Intro]\nYG: Alright, come whoop me nigga, I’m right here nigga\nBang my line when you know what’s up\nUnnamed Caller: Fo sho, alright\n\n[Verse 1]\nIt was 1 in the mornin' and I was up yawnin'\nMoms asked where I'm goin', to the hood if you ain't knowin'\nPops locked up so mama couldn't stop me\nI was out the house, ASAP Rocky\nAnd it wasn't cause she couldn't control us\nWe was her babies, she just wanted to hold us\nAnd we ain't get disciplined, her friend started whisperin'\nAbout how she was a bad mama, mama said \"fuck 'em then\"\nI was in the streets stylin', nobody could tell me nothin'\nGrandpa or grandma, not my auntie or my favorite cousin\nI was buzzin'\nFuckin' all these hoes wearing no condoms, no nothin'\nI used to ditch school when the homie had the Chevy\nI used to sneak and smoke stress weed\n\n[Hook]\nBut now I'm rollin' on dubs\nHow you feel, whooptie woop, nigga, what?\nNow I'm rollin' on dubs\nHow you feel, whooptie woop, nigga, what?\nAll these hoes showin' love\nHow you feel, whooptie woop, nigga, what?\nAll these hoes showin' love\nHow you feel, whooptie woop, nigga, what?\n\n[Verse 2]\nSKKKRRRT, I was on a mission\nOn a mission to the money, sun down till it sunny\nKnow my family love me\nRidin' in the car with two niggas and a pistol\nThis ain't funny, I do it all for the money, hold up\nSlowly as I pull up to the donut stand, I already know the plan\nHop out and get on your mans and take what he got\nGo through pockets, wallets and socks, dig all the knots\nIt's a stick-up, phone ring, it's my mama\nIn the middle of some drama, so I don't pick up\nThinking I gotta get my shit up, I gotta pick my bitch up\nLet's hurry up and leave, I feel the police near us\nSo we left with a thousand dollars cash\nIt was me and my nigga, so you know I went half\nThen shit get real when niggas get greedy\nPop, pop, pop, pow, that's when he leave me", "title": "1 AM"}]}