{"artist": "The Weeknd", "songs": [{"year": null, "lyrics": "[Hook]\nYour hesitation speaks to me louder than million words per minute\nI was born to this life you're living, in this game, oh yeah\nSaid nothing will ever be... ever be the same, when you're finished\nI freed a couple of souls, just yesterday, ooh yeah\n\n[Verse 1]\nI had a good girl in my room, no tats on her skin\nI put work all in her purse, she got guilt all in her grin\nAnd I swear it be the same, every fuckin' where that I been\nAll you girls try to be saints, I’ll make you roll with a sinner, well\nYou can come to my hotel, you can bring me a friend\nYou can dress up like twins, I can teach you some French\nPaper planes full of kush, a couple cups full of gin\nDon't know what city I'm in, wake up and do it again\nAnd if you know me well, I don't like to talk\nBut when I make a move, you know it's loud as fuck\nAnd if you wanna scream, get loud as fuck baby\nI can tell you've earned a bit of deconstruction\nA little bit, a little bit, ooh yeah... ooh Lord\n\n[Hook]\nYour hesitation speaks to me louder than million words per minute\nI was born to this life you're living, in this game, oh yeah\nSaid nothing will ever be... ever be the same, when you're finished\nI freed a couple of souls, just yesterday, ooh yeah\n\n[Verse 2]\nDo you feel like you'll come back around?\nDoes it make you strong?\nDo you feel like you can take the planet on? Oh girl\nDid I seem to give you a little bit more love?\nTo your gloomy life, to your empty life\nLittle life, little lie, oh yea\nDo you feel like you got your money's worth?\nCause if you did this round's on me\nJust promise that you'll come back to me\nFeed me, baby, feed me, baby\n\n[Hook]\nYour hesitation speaks to me louder than million words per minute\nI was born to this life you're living, in this game, oh yeah\nSaid nothing will ever be... ever be the same, when you're finished\nI freed a couple of souls, just yesterday, ooh yeah", "image": "https://images.genius.com/3cd68c66d12d757c908ddbdcefb581e8.441x441x1.jpg", "album": null, "title": "Odd Look"}]}