{"songs": [{"title": "U Don’t See Me", "lyrics": "Ladies and geantle-man! You are now tuned into the very best! A jazzy finzzale! Product-shinzzale! Young Dro!Slim Thugga!\n\n(Chorus:)\nYou don't see all my jewels, You don't see how I'm ridin'\nYou don't see how i struggle, You don't see how i grind\nWhen pussy nigga hatin', tell em' to get in line\nCuz when it's grand hustle, till em that we gon' shine\nYou dont see me nigga, you dont see me. You dont see me nigga, you dont see me. You dont see me nigga, you dont see me. You dont see me nigga, you dont see me.You don't see me nigga, you dont see me!\n\n(Verse 1:)\nYoung Dro, I ride over ya\n8's nigga, Kobe-ya\nWeight come from Korea\n80K in Wachovia\nPussy-nigga-phobia\nI call em' like a Nokia\nThey know I got the juice\nCause the whip Fruitopia\nDope boy, Dopin' ya\nDuct tapin', and ropin' ya\nCleaner than a bitch\nIvory suds, is soapin' ya\nSummer, super sokin' ya\nYeah bitch, im provokin' ya\nAK to ya neck\nCool out shawty\nIt's chokin ya!\nSnipers still scopin' ya\nMy Russin killers open ya\nBust the wrong move muthaf**ka\nWe'll open ya\nApple testa rostin' ya\nI smackin vest open up\nRearrange ya face\nStick the 4-4 magnum close enough\nBlack lack Kosher bruh\nTrappin at the ocean bruh\nPopi said he ran out of white\nNow get the Opium\nNiggas drive sodium I stand up like a podium\nSmooth like linolium presidently I rolly em'\nDRO...\n\n(Chorus)\n\n(Verse 2:)\nBitch Please Shit Here Ain't New To Me\nOver Seas Water Still Blue To Me\n100 Keys They Won't Have A Clue Its Me\nI Walk Up Out The Airport Only Bad Hoes Pursue Me\nI pimp Fluently They Chase Me Like A Truancy\nYoung Dro Yea In On The Block And Im The Newest G\nYou Wana Do A G Come And Talk To A G\nYou Might Not Even Act Like That\nOnly If You Knew A G\nI Ride One Chick Paint Look Sunkist\nBest Thang Smokin Young Dro Im The One Bitch\nStay One Car Drizzle Is A Pornstar\nBet Im On The 6's I Bet Im Ridin Northstar\n\n(Chorus)\nSlim Thug:\n\n(Verse 3)\nYou don't see me candy drop top down on 4's\nYou don't see me 25 riding out in a Rolls\nYou don't see me pulling up err day dime hoe's\nYou don't see a nigga fresh from his head to his toes\nNeck and wrist froze hell yeah a player shine\nDo it big on a daily you should see me on my grind\nAll its getting mine on dem H-Town blocks\nDodgin them fake niggas and dem pussy ass cops\nYou don't see me on ya TV reppin tha H\nYou don't see me putting Texas all up in ya face\nSlim Thug a muthaf**ka You don't see me I'm a boss\nThink the ride is live you should see a nigga house\nPay tha cost to floss real heavy, got everything\nHolding from tha choppa to tha Chevy I'm ready\nF**king wit my nigga Young Dro, You don't see me\nWith the P$C wrecking on the floor Hoe\n\n(Chorus)", "album": "Best Thang Smokin’", "year": "2006-08-29", "image": "https://images.genius.com/d08a6e151064244a37d938d092fc5670.640x640x1.jpg"}], "artist": "Young Dro"}