{"artist": "​iLoveMakonnen", "songs": [{"title": "Paper Chase", "lyrics": "[Chorus]\nI don't chase paper, paper chase me (yeah)\nI don't chase paper, paper chase me (yeah)\nWhat's the fee? (what's the fee?)\nWhat's the fee? (what's the fee?)\nI don't chase paper, paper chase me (yeah)\nI don't chase paper, paper chase me (yeah)\nSo what's the fee? (yeah)\nSo what's the fee? (yeah)\n'Cause I don't chase paper, paper chase me (yeah)\n\n[Verse 1]\nIn the morning, hit my line, what's the fee? (yeah)\nWhat you need lil' baby? What you need? (yeah)\nYou know I'm postin' all of that if you can pull up (pull up)\nI know been with the shits since we were young in Pull Ups\nYeah, I keep the block, I keep the slab with the fuckin' bomb\nI keep the bags by the hall if you really want it\nNow tell your girl she can meet me down in California\nShe can meet me, she can meet me if you really want her\n\n[Chorus]\nI don't chase paper, shit, paper chase me (yeah)\nYeah, paper case me, ayy\nI don't chase paper, baby, paper chase me (yeah)\nSo tell me what's the fee? (so tell me what's the fee?)\nChasin' paper, nah, paper chasin' me (yeah)\nAin't chasin' paper, nah, paper chasin' me (yeah)\nSo what's the fee? (so what?)\nSo what's the fee? (so what's it?)\n\n[Verse 2]\nI'm overseas, yeah, I'm makin' Euros\nI make so many baby, I'm countin' plurals\nLike where you at girl, you still fuckin' state side\nYou got your passport with you, maybe we could date-night\nBut you can't so I ain't tryna flex on ya\nI'ma stay over here, just flexin' on ya\nI'm makin' cash, I'm makin' bands, I'm makin' so much\nI been doin' so many shoes, baby, I'm frow up\nBut meantime, baby still on the grind (hey)\nDon't keep no watch 'cause I'm always on time (hey)\nAnd plus my time sounds like motherfuckin' money time\nYou know what I'm on, it's like the money guide\n\n[Chorus]\n'Cause I don't chase paper, paper chase me (yeah)\nYeah, paper chase me (okay)\nListen, I don't chase paper, baby, paper chase me (yeah)\nSo tell me what's the fee? (what's the fee?)\nAin't chasin' paper, nah, paper chasin' me (ayy)\nAin't chasin' paper, nah, paper chasin' me (yeah)\nAin't chasin' paper, nah, paper chasin' me (yeah)\nTell me what's the fee? (what's the fee?)\nWhat's the fee? (what's the fee?)\nI ain't chasin' paper, paper chasin' me (yeah)\nSo what's the fee? (what's the fee?)\nSo what's the fee? (what's the fee?)\nI ain't chasin' paper, paper chasin' me (yeah)", "image": "https://images.genius.com/ec5667e4f98a403c9d8c59b16191fc4f.499x499x1.png", "album": "iLoveMakonnen x Ronny J", "year": "2018-01-24"}]}