{"artist": "Anybody Killa", "songs": [{"title": "Party at the Liquor Store", "image": "https://images.genius.com/e8235b7763da2f99c14011dff35a2d0f.400x400x1.jpg", "album": "Dirty History", "lyrics": "[Verse 1 - Anybody Killa]\nThere's a party goin' on, who's comin' with?\nTo kill the rest of that malt 40 and grab ya shit\nI hope you got some money, cause I ain't got your back\nEspecially how cheap you was on that chronic sack\nThere's a party at the liqour store, don't be claimin' broke\nActin' like a cold 40 ain't good on the throat\nWho you think that you foolin'? Cause it sure ain't me\nShould've borrowed five dollars from your old lady\nIs there anybody's cup as empty as mine?\nPile into the hoo-ride, seats recline\nStopped at the weed spot, order up another\nThis is how we do it, MUTHAFUCKA!\nCD burned full of old school tracks\nOn the corner of the party store shootin' some craps\nIf this is something that you normally see\nThen you probably live close to me\n\n[Hook]\nThere was a party at the liquor store (C'mon!)\nThere was a party at the liquor store (C'mon!)\nThere was a party (Anybody!) party (Everybody!)\nThere was a party at the liquor store (C'mon!)\n\n[Verse 2 - Blaze Ya Dead Homie]\nI showed up dro'ed up, khaki's creased\nAnd a chickenhead hangin' on either side of me\nSendin' me to the store, to cop some 40's\nAnd I take my time and make my way around the party\nSee my boy JD, the weed spot on wheels\n65 Impala drop top, he make the shit hop\nCopped it out and snatch the blunt\nWith two bitches that came through the skunk, we got fucked up!\nSeconds passed, the chickenheads came back\nNow it's off to minglin' and see who else up in the shack\nThe music started bumpin', there ain't no sign of the pigs\nIf there was, I'd pull my shit and split they fuckin' wigs\nI'm high as fuck, and stumblin' off six 40's\nBy the time I see my homie ABK up at the party\nChillin' with seven hoes in they shell toes\nOr they dream about sex and those in birthday clothes\n\n[Hook]\nThere was a party at the liquor store (C'mon!)\nThere was a party at the liquor store (C'mon!)\nThere was a party (Anybody!) Party (Everybody!)\nThere was a party at the liquor store (C'mon!)\n\n[Verse 3 - Anybody Killa]\nWhen I got there, shit was tight\nSo I rolled up a blunt of that chocolate thai\nEverybody was chillin' out front, sayin' \"What's up?\"\nWalk in to grab a 40 as I spark my stuff\nWent straight to the back where the brew be at\nGrabbed a cold 4-0 and proceeded to crack\nGotta dollar fifty sub and a bag of Better Made chips\nPhone number from the hot bottle return bitch\nIt was a good day, perfect day to party\nHot bangin' bootylicious freaks actin' horny\nMan, this party store is kinda like the club\nBesides the bums comin' in cause the beer's cheap enough\nI was gettin' my groove on, straight big pimpin'\nAisle of the party store, Bud Light sippin'\nI heard a gunshot, my drink dropped\nI coulda swore it was the fuckin' cops\n\n[Hook]\nThere was a robbery at the liquor store (What happened?)\nThere was a robbery at the liquor store (What happened?)\nThere was a robbery (A robbery?) Someone got shot (He got shot!)\nThere was a robbery at the liquor store (What happened?)", "year": "2004-07-27"}]}