{"artist": "Pimp C", "songs": [{"album": "Still Pimping", "title": "Finer Thangs", "image": "https://images.genius.com/3d5d412ed24c8c0c0e6090d935ec7bc3.500x500x1.jpg", "lyrics": "Pimp C:\nPimp C Baby, wood grain, and dome\nI mess with you girl cause you got it going on\nAnd I was locked up in here you was taking trips\nWhile them other Niggas gone, watching and shaking them hips\nNot in the club, I can see them dancing for tips\nBut they was not freaking for free, now baby ain't that a trip\nYou the Princess of the South\nAnd I gotta be the king\nSo girl you might as well get used to having finer thangs Baby\n\nBrooke Valentine:\nOooh, boy was it this way to love me, you?\nNow you, got me feenin' for the JUICE\nTaking me on shopping sprees around the world\nSo good to me, when I was just a country girl!\nCan't help the way I'm turning out\nI'm in love with him without a doubt\nAnd the boy can really turn it out\nHe got the whoole world in his hands!\nYou got me used to all the finer thangs\n(You got me) infatuated by what money brangs (Yo' money brings)\nCop Fendi, rings, and watches\nCelebrate, (everything)\nYou got me used to all the finer thangs (finer thangs)\n\nSlim Thug:\nMane, I met this chick so fine\nSo bad I had to hit one time and this bitch still sticking around\nShe was supposed to be a one night stand\nPussy was so good, shit she ended up staying\nBout one or two weeks, going at it like freaks\nEvery day, all day had me walking around weak\nGot me doing strange things like tricking out change\nPartners looking at me like\nThuggy you gone mane\nI can't the deny it, I had it, this chick's so tough\nOnly thing on my mind is trying to f*ck\nThey say do what make you happy, right?\nSo for now I'm on set mode, sleeping up with her for days\n\nBrooke Valentine:\nYou got me used to all the finer thangs\n(You, OoOoh) infatuated by what money brings\n(Oh, baby)\nCop Fendi, rings, and watches\nCelebrate (All those thangs, all those thangs)\nYou got me used to all the finer thangs (finer thangs)\n\nPimp C:\nWhen I met you, You was trying to smoke out\nGet your do' out, Got with me and I showed you how to get the dough out\nNigga told so many lies that when I told you the truth\nIt was valuable to you like I bought a GT coupe\nNot to mention, I'm USDA, I got the meat\nAnd I'm highly respected, and I'm protected in the streets\nYou representin' me, so that's why you gotta ride right\nThat's why we're slamming magic doors\nThat's what we're staying and drink tonight (It's going down)\n\nBrooke Valentine:\nYou got me used to all the finer thangs\n(Youu) infatuated by what money brings\n(I'm so infatuated!)\nCop Fendi, rings, and watches\nCelebrate, (everything)\nYou got me used to all the finer thangs (finer thangs)\nBaby that is what you do\nYou got me so used to all of the finer thangs (finer thangs)\nBaby, that is what you do\nGot me so used to, all of the finer thangs (finer thangs)\nYeah-Yeah, Yeah-Yeah, Yeah-Yeah\nOh\nIt will never change\nYou got me used to all of the finer thangs!\n(Song Fades Out with Scarface F*ck Faces beat)", "year": "2011-07-12"}]}