{"artist": "Astronautalis", "songs": [{"title": "This is Our Science", "image": "https://images.genius.com/4dd688aadb10cbb24fc4cbdb8604ecdd.1000x1000x1.jpg", "album": "This Is Our Science", "lyrics": "Touch fire, just to taste the truth\nSay \"I'm gonna die.\" So are you\nWe chase the lightning, cause we need to move\nThis is our science, we've got nothing to prove\n\nTell me where you're going with that knife in your hand, yeah\nTell me what you're thinking, boy, what do you got planned?\nSee I don't trust your smile, I know your daddy lets you run wild as the wind\nI saw you touch her eyelids and I can see you want so clearly to kiss her lips\n\nI got friend who walks the strip with a gun on his hip\nHis reason is this: if people caught a glimpse they won't be talking shit\nAnd he can rest his heavy fists, he got hands to take teeth\nHe don't need quarters to coax them from lips\n\nTo you, this is as crazy as it gets\nTo the man with the bruises on hands, it only makes sense, yeah\nAnd that's the way that he is (tooth-taker)\nAnd that's the way that I live\n\nI wasn't born in a boxcar, when I die bury me with crossed arms\nUnderneath the tree up in the back yard\nSlip that coin in my pocket, yeah, it's a lost art\nLiving what you're giving till it finally stops hearts\n\nWhen us good guys die, we hope those that survive\nCan spin a solid lie to make us look real hard\nCause we ain't tough, tell em Stef\n(We just deal with whatever comes up)\n\nThis is for those who can't take a hint, find a hundred neighbors\nAsk if they could change their life, then what would they do different\nWould it be little shifts, or would it be some hidden dream\nFrom the bitter deep that no one even knows exists\n\nTo me it makes sense\nYou can waste your time tossing blades of grass at the wind\nOr you could swing fists, and if it sinks ships\nBury me at sea with my arms crossed and a smile upon my pink lips\n\nTell me this, put up your fingertips\nIf you're living your life exactly the way that you wished, yeah\nAnd for the rest of us with our hands on our hips\nOur work is never done, we are Sisyphus\n\nTell me where you're going with that knife in your hand, yeah\nTell me what you're thinking, boy, what do you got planned?\nI don't trust your smile, I know your daddy lets you run wild, wild as the wind\nI saw you touch her eyelids and I can see you want so clearly to kiss\nKiss, kiss, kiss her lips\n\nTouch fire (touch fire)\nJust to taste the truth (just to taste the truth)\nSay \"I'm gonna die.\" (I'm gonna die)\nSo are you (so are you)\n\nWe chase the lightning (we chase the lightning)\nCause we need to move (cause we need to move)\nThis is our science (this is our science)\nWe've got nothing to prove (we've got nothing to prove)\n\nSo you touch fire (touch fire)\nJust to taste the truth (just to taste the truth)\nSay \"I'm gonna die.\" (I'm gonna die)\nSo are you (so are you)\n\nWe chase the lightning (we chase the lightning)\nCause we need to move (cause we need to move)\nThis is our science (this is our science)\nWe've got nothing to prove (we've got nothing to prove)", "year": "2011-09-13"}]}