{"artist": "Papoose", "songs": [{"album": null, "title": "Flashback", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro: Marvin Gaye]\nMother Mother, mother mother\nEverybody thinks were wrong\nMother, mother. Who are they\nTo judge us? Mother, mother\nSimply cause we wear our hair long\nMother, mother Oohhhhhhhhhhhhh\n\n[Verse 1]\nIm gonna take ya'll back on this one\nMommy make me some oatmeal\nThe mailman outside he bringin' mo' bills\nDaddy driving in his raggedy automobile\nPapoose got the cooties he killed a roach ill\n\"Mommy Toya' keep kickin' me with them old heels\"\n\"Boy stop trying to make a mountain out a mole hill\"\nI grew up in a shack just like O'Neal\nBorn and raised in the ghetto where it was so real\nBack in the days when K' was on cold chill\nWe lived on the first floor, I'm from down the hill\nWe had to duck on the floor, they shooting off steel\nThey use to have shoot outs over them dope deals\nThey say \"If he's so nice why he got no deal?\"\nI say my talent is something these labels won't steal\nI'm doing this for them rappers up out of Brownsville\nWho never went platinum they had a bad deal\n\n[Chorus: Marvin Gaye]\nOh, make you wanna holler\nThe way they do my life\nMake me wanna holler\nThe way they do my life\n\n[Verse 2]\nYo momma so fat when she walk her booty claps\nNeed gloves to eat a tootsie roll, she so black\nYou actin' like your Mom's all that\nShe's so cross sighted that when she cries tears go down her back\nWho ever stepped on the lines, yo' mother drink wine\nWho ever stepped on the cracks, yo mother smokes crack\nWe told mother jokes as if we took them for granted\nDrinking sugar water and eating a syrup sandwich\nWe threw rocks at lots, the buildings was abandoned\nFather sinners was teaching, but we ain't understand it\nPissy mattresses, we was on the block flippin'\nNeeded some school clothes so we went shoplifting\nTriple fat goose first deal big difference\nChasin' the girls, seven humps, eleven kisses\nYou slap box better than me, then I fought you\nSmacked you in yo' face, and then start screamin' \"I caught you\"\n\n[Chorus: Marvin Gaye]\nOh, make you wanna holler\nThe way they do my life\nMake me wanna holler\nThe way they do my life\n\n[Verse 3]\nI was borned to rappers back then, I was nice kid\nHad them red and black lumberjack just like Big\nOsh Kosh B'Gosh and flat tops\nBattled the human beatbox stuffed wax and skelly tops\nUsed G's favourite pants, Tyson was the champ\nStarted small time hustlin' tired of them foodstamps\nBack then the dreads use to have all the weak spots\nNiggas were scared when they used to say \"what the blood clot!\"\nBut the hood got tired of that you hood gunshots\nNiggas started to get gun butted and what not\nTomahawks, faceheads, low lives\nThe ceptic cards, black spades, lil wives\nGP, SSP, HBO, those are some of the new york gangs I knew\nMan I'm daydreamin' off the haze I blow\nI just caught a flashback, I smoked too much dro\nFlashback, Flashback, Flashback", "year": null}]}