{"artist": "B-Legit", "songs": [{"album": "Throwblock Muzic", "title": "G.A.M.E.", "lyrics": "(B-Legit, Mac Dre…\nMac Dre all day)\n\n[Mac Dre]\nShe ask and wonders, \"who's those guys?\"\n\"The words they speak, are they trues or lies?\"\nB-Lit spittin at the bitch like her ears are mics\nAre the twins, lesbians, queers or dykes?\nMmmm, I don't know and I don't care\nShe pay like she weigh and get it long as her hair\nIt's irrelevant, B-Lit tell a bitch\nTo meet us at The Magic, we elegant\n\n[B-Legit]\nMeet us at The Magic baby catch me en route\nA bass, two guppies, one shark and a trout\nYou can ask Jake Stone what this hit is about\nIn the city where they sin when them tricks come out\nIt was me and Mac Dre: Cutthroat Committee\nHoppin out the big boy Bentley, you with me?\nAt the bar, rap stars, sippin on Henny\nTryin to get it how we live, fat tall or skinny\n\n[Taj-He-Spitz]\nI got that G-A-M-E\nI've got that G-A-M-E\nI spit that G-A-M-E\nI give that G-A-M-E\nNow I know hoes that go, go\nSunshine, rain, sleet, snow, snow\nI don't sweat her, I let her know, know\nGet chips, get rich, get dough, dough\n\n[B-Legit]\nUnderstand one thing, big game I got it\nI caught her in the alley, straight aimed and shot it\nI popped it like I knew it, see I learned from Ammy\nA girl that give it to me, but still can't stand me\n\n[Mac Dre]\nCuz she don't understand me, he too flammy\nFuck an Oscar or Tony, give that nigga a Grammy\nWe somewhere in ???\nWhere the waters are blue and the beaches is sandy\nWe ridin candy, in the deuce\nI'm fuckin with B-Lit and we on gorilla juice\nTell the truth, don't you strip?\nB-Lit hook her up with the pimpin tip\n\n[Hook]\n\n[Mac Dre]\nNow we somewhere, on North Flamingo\nWhere the bitches, hoes and old folks play bingo\nWe gettin Pringles, for lames that's chips\nAnd nothing but game flames from these lips\n\n[B-Legit]\nWell show me the money like Jerry Maguire\nI'll show you a honey, hair red like fire\nI know a snow bunny, stage name Desire\nThe ho check money like the house on fire\nShe used to be with him, but your nigga he not\nI caught her in the game in the parking lot\nShe started menstruating when I started to pop\nI started this drop and headed out to the spot\n$2700 at the Mandalay Bay, $3700 Mirage the same day\nBitches really like the way The Bay play\nMe and Mac Dre, we off the ash tray\n\n[Hook]", "image": "https://images.genius.com/8efff3c4c5b53d454a48763da5d62b73.499x499x1.jpg", "year": "2007-11-20"}]}