{"songs": [{"year": "2012-03-01", "lyrics": "[Intro: B.o.B & Meek Mill]\nYeah, ayy, Bob, what up?\nMeek Milly! Ayy!\nGrand Hustle in the building! Hey!\nIt's B-O, B-O\nLil' C, on the beat, ha-ha!\n\n[Verse 1: B.o.B]\nYou know who it is without a doubt or hesitation\nIf money talks, I got my masters in communications\nBut you can’t hold a conversation\nProbably find me burning something good\nYou can call that smoking aces\nCompliment the chef in the lab making greatness\nAin’t a thing changed but the number on the statement\nNBA resume, balling's my occupation\nKush so loud I can’t hear what was you saying\nBass go so low that the freaks in the backseat\nGet a thrill off the alpine when it vibrate they ass cheeks\nI’m Bobby Ray baby an all american athlete\nI run and leap and jump in that pussy like a track meet\nYeah, that ought to do it, give it that Carl Lewis\nI got the magic baby, call me George Lucas\nI’m so prolific but my flow’s so foolish\nThese niggas making moves, my niggas making movies, wait\n\n[Verse 2: Playboy Tre]\nWild like a crazy night, clean like a baby wipe\nY'all just a momma boy, sleeping with a baby light\nMy ex say I’m a dick 'cause my mindframe cocky\nUp in Beninhana, drunk as fuck, drinking all the sake\nDamn right, I want a double fried rice, I’m getting bread\nI put my dick up in ya face, ya face’ll look like Stewie's head\nGirls call me Tre-Day, I’m looking for payday\nMy squad’s got more bottle poppin’ niggas than the AA\nLiquor and wheelbarrow, foolish as Will Ferrell\nBut I ain’t got a step brother, I fuck your step mother\nI cuss cause I like it, bitch, fuck, ho, motherfucker\nYou mad cause I’m balling (ha!), life is a motherfucker\nShort like a leprechaun, so hater, live life a little\nNew shit dropping soon, “Patron and Instrumentals”\nTil' then stay tuned, freak, and thanks for the hot gin\nIt’s Tre-Boy, my flow won’t quit til I say it ends, yeah!\n\n[Verse 3: B.o.B]\nEastside on my arm, 3 stripes on my sneakers\nDon’t roll with pussy niggas, we call them vajeenas\nThat’s why your girl choosing dawg, pray I never meet her\nI tap her on the head and tell her, \"You know the procedure\"\nYou just mad with no bitch 'cause I’m chilling with your bitch\nShe threw out your mixtape but she knows my whole disc\nMy flow’s sick, I’m a poet, Edgar Allan Poe shit\nHaters be getting defensive like 4th down, they show blitz\nBut I don’t punt it, I run it for a hundred\nEver since I was a youngin', been hungry as Paul Bunyan\nI’m the shit so fix the plumbing, I’m a beast in the game, Jumanji\nAnd if this ain’t what you call hip-hop it must be bungee jumping\nI’m smoking on hydroponic some of you call that chronic\nHennessey in my vomit cause the night before jumpin’\nLil C got that beat bumping so you can hear me coming\nAnd my name’s Bobby Ray, Eastside of the A\nJust in case anyone was wondering, bitch\n\n[Verse 4: Meek Mill]\nBoy, I’m a motherfucking beast, all my haters rest in peace\nI make a hundred on the Monday and go hard the rest of week\nPray on niggas like a Sunday, see your artist, that’s a feast\nI got like 30 in the chalk I let you pussies catch a piece\nIt's just me and Omelly in the Scaglietti\nBout to scoop these bitches cause they say they past ready\nSwagger on infinity, I think I’m Andretti\nI push it to the limit get 'em haters gassed heavy\nWait a minute I'm a menace, shout out to the winners\nJacket boy Louies like a flag before the finish\nI’m just getting started and niggas at they end\nAnd errbody say I’m hot but I’ve been hot from the beginning, uh\nI be with a bitch that looks like Kim Kardashian\nShittin' on these niggas not by purpose but by accident\nBig cribs, I be laxin' in, you niggas relaxing\nAnd the main reason I’m passing 'em like Michael Vick\nI'm faster than yo quarter back, I bring that order back\nAin't fucking with that weed, like where that water at?\nLike where them perks nigga, somebody order that\nCaught a couple cases, went to jail but I ain't going back\nFREE TIP!", "title": "Epic", "album": "E.P.I.C. (Every Play is Crucial)", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}