{"artist": "Capital STEEZ", "songs": [{"title": "Capital STEEZ", "album": "AmeriKKKan Korruption", "year": "2012-04-07", "image": "https://images.genius.com/6172be389a954926184790991e7ca0ff.500x500x1.jpg", "lyrics": "[Verse: Capital STEEZ]\nS is for the stamina, T is for the talent\nAnd then two E so you don't forget the name Excalibur\nZ's the Zip Zinger board that I'm passing you on\nYou still hoping that I pass the baton\nBut, I hope you got your cameras on\nPlus ain't no passenger surviving when the damage is done\nAll you cats can fine your damages I'm smashin' the song\nPlus your shit is outdated like the calendar's wrong, boy\nSo fall back, it's all caps, record that\nOr you can get your jaw cracked and stomped like floor mats\nPlus we're right outside your crib, doormats\nWith two niggas holding on the back, bra strap\nPlus they got the big bangers call it bra strap\nAnd leave your melon leaking like breastfeeding\nShe said she tempted but she won't let me caress the cleavage\nIt's the Khan bitch, why you need a better reason?\nClass clown, found it funny to correct my teachers\nI stand proud, but I never said my pledge allegiance\nI'm a veteran, flowing way colder than the seven seas\nOf course you be subjected to these heavy breezes\nOr check the tag miss, straight STEEZ varsity jacket\nSetting me apart from the average\nCause I'm a motherfucking star, asterisk\nFuck friends, I'm in it for the dollars like mavericks\nGet paid, get queued, get away\nDashin, take 14th to Manhattan\nSkip fashion, I'm still a chick magnet\nFor women with assets that's thicker than they accents\nShe say she got her man on a leash\nWear the pants in the relationship with panties beneath\nSo I proceed to ask if she can stand on her knees\nYou already know my capital, Capital STEEZ\n\n[Outro: Capital STEEZ]\nNo, that was too much man\nThere's some fucking clichés man\nWhy can't I be just like the other rappers and just fucking rap?\nWhy I always got to like overdo this shit man?"}]}