{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "Freedom of Speech", "year": null, "album": null, "lyrics": "[Interlude: Newscaster/Laura Schlessinger]\n\n[Newscaster]\nWell according to talkers magazine more than nine million Americans listen to doctor Laura Slezinger on the radio every week. A number of her listeners were outraged when she repeatedly used the n word on a recent broadcast\n\n[Laura Schlessinger]\n\nWell could you give me an example of a racist comment cause some times people are hyper sensitive. With out giving much thought, a lot blacks voted for Obama simply because he was half black. Didn't matter what he was gunna do in office. It was a black thing\n\n[Pre-hook x2]\n\nHell's bells, what you tryna sell\nPut it on the table 'fore we take it to jail\n\n[Verse 1]\n\nIf a nigga kill a nigga, white man let a nigga slide\nNigga kill a white man, white man make sure that nigga die\nWhite man don't hold niggas down, nigggas won't let niggas rise\nHe just let a nigga, be a nigga, nigga why\nIs it when a nigga shot, you filled up with nigga envy\nI've done it myself before, guess it's just the nigga in me\nNigga ain't a bad word, nigga is a bad thought\nThat nigga never had a dad, that nigga got a bad start\nWhite man wanna be a nigga, but never wanna be a nigga\nCause niggas wasn't never free, that's why I'm screaming free my niggas\n\n[Hook]\n\n[?] will make it seem alright\nCocaine make you grind your teeth all night\n\n[Interlude 2:]\n\nI don't think that's racist. No I think that, no, no, no. I think that. Listen, that was racist? That was funny. (How about the n word, the n words been thrown around.) Black guys use it all the time, turn on HBO, listen to a black comic and all you hear is *censored* I don't get it, if anybody that doesn't have enough melanin says it, it's a horrible thing but when black people say it, it's affectionate\n\n[Verse 2]\n\nClass is in session. Going back in\nLook shooter on my marksmanship\nI'm very calm talking to Al Sharpton on his sharpest shit\nMalcolm and Martins heart in it\nIf I said nigga to many times for you, please pardon it\nI was thought provoking for those who those who could see the art in it\nMy depiction of pimps up, hoes down\nIs people posting pics up of niggas getting hosed down\nPorch nigga, field nigga, you could chose either side\nSo we mastered drug dealing, we decided we could fly\nOn solely what we rely\nSome would say that is the streets, we was taught to believe a lie\nBut still I believe we could rise\n\n[Hook]\n\n[Interlude]\n\nCan't do much about that. (I can't believe someone like you is on the radio, using the n word and I hope every one heard it.) I didn't spew out the *censored* (you said *censored* and everybody heard it.) Right I said that's what you hear, yes they did and I'll say it again, *censored* is what you'll hear on HB- Why don't you let me finish a sentence? Don't take things out of context. Don't NAACP me"}]}