{"artist": "Wiz Khalifa", "songs": [{"year": null, "lyrics": "[Verse 1: Busta Rhymes]\nGot these niggas sayin': shit ain't even logical\nTo do the shit I do, now lets celebrate the impossible\nGlasses up, I'm respected son\nUnbelievable arsenal\nBeat the streets with bars til niggas lay in the hospital\nIn case you didn't know everything about me phenomenal\nAnd the way these niggas talk everything about it is comical\nWhats even more comical, is what you read in an article\nI broke your face for talkin', you should've been more responsible\nYou need to learn I ain't trying to stop, basically\nWatch them choke when I'm pullin' up in a space ship, see?\nWhen I float you see how we ballin' until we wasted\nMad because I poke your broad and be lettin' her taste it\nPlease appreciate this art and this Basquiat that I'm painting\nEmbrace a lot of love, but I love embracing the hatred\nYou niggas is the fuel for me\nLeaving it mutilated\nPardon my delay on all of this greatness you ever waited\n\n[Hook: Wiz Khalifa]\nNow when I'm lookin' at the game I say shit done changed\nThese niggas going out they way but I'm just staying the same\nYou probably thinking that you seen someone like me before\nBut I'm a G and they don't make em like me anymore\n\n[Verse 2: Wiz Khalifa]\nThe nerve of these niggas\nTalkin' shit about me cause I'm on the top I ain't even heard of these niggas\nSmokin' kill dressed to murder these niggas\nWant beef? Cause I got bread\nI guess you where burgers be nigga\nThey say I'm the event currently\nBut my niggas in the cut like surgery\nAnd all my breakfasts, lunch, and dinners get served to me\nYou sayin' I ain't the realest, that's perjury\nI'm smokin' out with my niggas up on the top floor of the villa lookin' out for those who be trynna copy us\nOh you ain't bout them dollars huh?\nI guess that mean we can't chop it up\nPérignon poppin'\n30k for watches\nI grinded for what I got my nigga, losings not an option\nJust look at all this new shit that I'm rockin'\nDon't know whatchu doin', you should stop then\n\n[Hook]", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg", "album": null, "title": "Different Cloth"}]}