{"songs": [{"year": "2016-08-28", "album": null, "image": "https://images.genius.com/213bb704cc500df40249efc071118e4a.600x410x1.jpg", "title": "2016 MTV VMAs Speech", "lyrics": "I am Kanye West, and that feels really great, especially to say this year. I came here to present my new video, but before that, I'ma talk. Now... Later tonight, \"Famous\" might lose to Beyoncé, but I can't be mad—I'm always wishing for Beyoncé to win, so, you know! But for people to understand just how blessed we are. It was an expression of our now. Our fame right now. Us on the inside of the TV. You know, just to put... the audacity to put Anna Wintour right next to Donald Trump... I mean, like, I put Ray J in there, bruh! This is fame, bro! Like... I see you, Amber! My wife is a G, not a lot of people's wives would let 'em say that! We came over in the same boat, now we all in the same bed. Well... maybe different boats, but you know. If you think about it, last week, it was 22 people murdered in Chicago. You know, like, people come to me like, \"Man, that's right! Tell Taylor to...\" Bro, like, I love all y'all! That's why I called her! So, I was speaking at the Art Institute last year and one kid came up to me and said, \"Three of my friends died and I don't know if I'm gonna be the next.\" And it has to... you know, you have to think like, you know when you're a senior and it's like the last month and you just don't feel like doing anymore work? If you feel like you're seeing people dying right next to you, you might feel like what's the point? You know, like, life could be, like, start to feel worthless in a way. I know times for me, I sit down and talk to older, rich people, you know -- aka white -- and uh, they tell me, \"Don't compare yourself to Steve Jobs, don't compare yourself to Walt Disney.\" And my friend Sekaya told me -- ayy, bruh, bruh!\n\nThey tell me, \"Don't compare yourself to these people,\" right? My friend Sekaya told me it's three keys to keeping people impoverished: taking away their esteem, taking away their resources, and taking away their role models. My role models are Artists Merchants. It's less than 10 I can name in history. Truman, Ford, Hughes, Disney, Jobs, West\n\n(Audience cheer) Bro! Broooo!\n\nTonight, we're here to have fun. I'm standing in front of my idol, Puff Daddy. I'm standing in front of my wife, Kim Kardashian West. I'm standing in front of the future, Chance The Rapper, 2 Chainz, Jaden Smith. Bro! We are undeniably the influence, the thought leaders. I'm gonna play y'all a piece of my art and I hope y'all have a good time"}], "artist": "Kanye West"}