{"songs": [{"year": "2000-04-04", "image": "https://images.genius.com/b70930fc56c82c3038f706c659b43fc6.500x500x1.jpg", "title": "Watch Those", "album": "Yeeeah Baby", "lyrics": "[Intro]\nEarth to Pun.. come in Pun..\n\"Look at me, I'm the Water Boy!\"\nYeah yeah yeah..\nThe levels the levels the levels be good?\nLevels is good, levels is good?\nYeah..\n\n[Hook x2]\nYou got to watch those, jokers who pop those\nYou know those, crusty-lipped snot-nosed\nEasy to spot those, actin rah rah, talkin bla-bla\nThat's ca-ca, chill pa-pa, no ah-ahh (ah-ahh)\n\n[Verse 1]\nI'm quick to dumb out, run up in yo' crib with the guns out\nSpray your peeps, smack the baby teeth out your son mouth\nWho can stop me? I told shorty I'ma shoot you papi\nCaught him in the crapper with the clapper;\nWhile he was doin caci\nI'll probably die in jail - make it through life and fry in hell\nEither way I'ma lead the way, 'cause only time'll tell\nI rhyme for real, not that imaginary vocabulary\nI really will stab you and every one of my adversaries\nThere's no remorse - fuck these thug niggas, show me the boss\nGimme a hustle worth the risk of goin' up North\nI love my freedom, and you know I love my bein'\nSo sometimes I gotta get ugh and mug for my per diem\nI'll see him in hell, we'll settle it there, better it there\nAnd no innocent bystanders to get hit with a spare\nLike I really care who catches strays from the MAC\nLike I really care who you paid to rap on your track\nNigga you wack - you ain't bringing nuttin for us\nI got songs with the Devil and Jesus singin on the chorus\nYou can't ignore us, nigga you know how we roll\nSixteen in the clip and one in the hole\n\n[Hook]\n\n[Verse 2]\nCan't no comp come at me, this battle the Bronx'll back We got the nicest niggas alive talkin bout, \"Papi's nasty\"\nCocky crafty like Rocky sassy Puerto Rock Apache\nPosse not even the cops could catch me\nI'm too fast - four-hundred pounds, but I move ass\nSoon as you spoke, I already smoked you with two jabs\nMy game is tight - you wanna play, just name your price\nFame to ice, your brains your life, the game is sheist\nAnd I'm the trifest on the field\nEven in school I was nominated the most likeliest to kill\nThis bastard steal, a full clip and a extra\nAnd I'mma blast ya til your whole click respeta\nLeave you muerta, it ain't me it's the metra\n'tate quieta, the bitch got a bad temper\nDon't surrender - you ain't got a chance\nYou be lucky to leave here half-dead, in an am-bu-lance\nSo take a chance, but expect the worst\nPut my foot so far up your ass\nThe sweat on my knee'll quench your thirst\n\n[Hook]"}], "artist": "Big Pun"}