{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/7400209c296da0734e3e84e7cc488887.640x640x1.jpg", "title": "Hello World", "year": "2014-01-07", "album": "My Own Lane", "lyrics": "[Intro]\nHello baby, guess who's back? (Yeah)\nIt's been a minute (I know you miss me, yeah)\nEgh. Kid Ink\nI said...\n\n[Verse 1: Kid Ink]\nHello baby, guess who back? It's been a minute\nI been fiending for your love like crack, from the beginning\nWhen I didn't know you quite like that, knew we would hit it off\nNow we somewhere getting lost, rockstars with no guitars\nYou ain't gotta wait no more, I got what you came for\nI said fucking with me, promise that, you'll wake up with a hangover\nChampagne, we celebrating for every day that we never ate\nIt's evident imma never change, gonna be this way forever baby\nEchelon keep elevating, bunch of bitches, hella haters\nAdd them up while I just keep it 100, estimated\nDon't blame me, the pressure made me\nTreat this game like Wrestlemania\nOff top of the ropes, so high, hit the floor like...\n\n[Hook: Kid Ink]\nHello world (what up?), know it's been a minute\nHello world (what up?), made it out the city\nHello world, been all around the map saying \"Hello baby\nGuess who back? I know you missed me.\"\nHello world (what up?), know it's been a minute\nHello world (what up?), made it out the city\nHello world, been all around the map saying \"Hello baby, guess who back? I know you missed me.\"\n\n[Verse 2: Kid Ink]\nI said hold it baby just like that, I need a picture cuz\nAin't nobody gone believe, that I was with you now\nBizzack in the room, where we beez at in the party\nAbout to kill it with one shot, you dearly departed\nT-Take off, f-first class. Still ducking the po-po\nAll this money, I still get it for the low-low\nWorld been, stone cold, so I stay, burning one\nRoll up, all night, I been running from the sun\nTrying to bring the trophy back, to the city\nWhole team going \"rah rah rah\", representing\nWe on, everything is a go, never take a T.O. (here we go)\nI know you missed me...\n\n[Hook]\nHello world (what up?), know it's been a minute\nHello world (what up?), made it out the city\nHello world, been all around the map saying \"Hello baby, guess who back? I know you missed me.\"\nHello world (what up?), know it's been a minute\nHello world (what up?), made it out the city\nHello world, been all around the map saying \"Hello baby, guess who back? I know you missed me.\"\n\n[Bridge]\nHello baby guess who back? (Guess who's back)\nYeah I know you missed me\nMade it out the city and the rest is all history\n\n[Outro]\nHello world (what up?)\nHello world (what up?)\nHello world (I said), been all around the map saying \"Hello baby guess who back? I know you missed me.\"\nHello world (what up?)\nHello world (what up?)\nHello world\nHello baby, guess who back?"}]}