{"songs": [{"title": "Wifey", "album": "I’m In the Forest EP", "year": null, "image": "https://images.genius.com/b2f70188352597276331901a076f2c09.600x600x1.jpg", "lyrics": "[Hook]x2\nI'mma wife 'er out, I'm, I'mma wife 'er out\nI'mma wife 'er out, I'ma, I'mma wife 'er out\nI'mma wife 'er out, I'm, I'mma wife 'er out\nI never wife 'em out, but I'mma wife 'er out\n\n[Lakutis]\nThey be like, \"Lex?\" (What?) \"You play Hungry Hungry Hippos?\"\nYeah, cause I like to keep it simple (Oh)\nI'm the type turn a drop into a ripple\nTurn a ripple to that crazy scene from Species in the middle (OK)\nMommy wylin', she don't know that it's a rental (one day)\nMight finna wife it out, make it official (nado)\nHomegirl said she like my kujichagulia\nRest in peace, Swayze, R.I.P. Aaliyah\nBody's like lady horses, salty like baby tortoise\nI'm in the forest, it behooves you to move towards it\nI'm in the fortress, if it soothes you see more of it\nYoung suck beast, death freak on a bitch, oops\nLet me see the trick when you get up on the dick\nOops\n\n[Hook]x2\n\n[Kool A.D.]\nNever wife 'em out, but I'mma wife her out\nGo ahead, girl, live it up, life it out\nPop it up, bring it back, walk it out, bring it back\nKnock it out, knock it off, what we talking 'bout?\nLock it down, move it all around, go to town\nYou're a soldier now, holder of a boulder now\nMoney folder now, throw the gold around\nTold and sold the sound\nYour girl told you that I ho around? No, I just go around\nYou don't need to ask me if I hold it down\nThat's a dumb question, you don't even gotta ask the next one\nAnd I don't have any more questions\nSo, what you wanna do? I know what I wanna do\n\n[Hook]x2\n\n[Heems]\nI'mma wife 'er out, tho, she be Edie Falco\nBut she look better, I'm in a dope sweater\nI'mma wife 'er out, more than pipe 'er out\nI never wife 'em out, but I like what she's about\nI like the things she's saying when they come outside her mouth\nWhat she talk and shout, I want to learn about\nMuch to like about her, so much to write about\nKiss her on the mouth, that's what life's about\nListen down south, listen when she pout\nMake me want to get a job and get up off the couch\nI don't trust nobody that like me\nGotta wife you out, but you gotta be my wifey\nFace down, hair black, spicy\nWearing nothing but her Air Max Nikes\nShe patient when I'm wilding in the streets\nWaiting like the dial-up on the beat\n[Look into her eyes, when it's going down\nDive into her bones, find a home to roam around\nGo to town, another round, rub her down, lover's sound\nLove her down, lovers rock from the kitchen to another spot (Say what?)\n\n[Hook]x2\n\nOoh ooh mommy, you know how you like it. (?)\nOoh ooh baby, to that spot doing that thing. (?)"}], "artist": "Lakutis"}