{"artist": "Badshah", "songs": [{"lyrics": "Turiya turiya jaanda, tere mode te bandook ve\nTuriya turiya jaanda, tere mode te bandook ve\nKhich ke na maari, saadi zindagi malook ve\nKhich ke na maari, saadi zindadi malook ve\n\n(BADSHAH)\nYeh jo kahani maine tum ko sunani hain\nPurani jani manni sunni kayio ki jubani hain\nBanda banta tez lekin kudrat badi siyani hain\nJisne thuka hai muh pe us ne\nMuh ki hi khani hain\nAb ghor se sun meri har ik baat\nKaam tere hi vo aayega\nTu jo bhi karega upperwala\nTere hisse main likhta jayega jo bhi khoyega\nWohi payega jo bhi boyega wohi khayega\nTu duniya ko jo dega wahi\nWapis duniya se tujhko aayega\nSukh payega jo tu jhe baat ye rat gayi\nKamyabi ka shot kat layi\nKitno ki zindagiyuhi kat gayi\nAcha acho ki g**de fat gayi\nTu kya cheej hai itna bta\nKya teri aukat hain\nAage khuda ke\nKisse bda banna chahta hain apne aapko bda bta ke\nLoot ke logo ko bna tu rich boy\nUske hatho main triggter\nNa de vo kich boy\nMeri salha tujhe bas yehi hain ke\nSoch samjh ke kario jo bhi karna\nCoz karma is a bitch boy\n\nTureya tureya janda tere modd’e te bandook ve\nKich ke na mari saddi zindagi malook ve\n\n(RAXSTAR)\nModeh tungi dunali kisse toh darda nahin\nHasda nahin, Marna nahin?\nWhat about the pistol tere dushman kol?\nHun fasgaya be\nBullet te behke londah gera\nBullet uthe naa likwaya tera\nKichke tere pichhe ohna marna while you sit there\n\nWhat you think you can hide from\nAnything that you ain't got your eyes on?\nEvery action has a reaction and that's the truth that you should base your life on\nBut you lie to yourself, take selfies and hide from yourself\nYou could try buy some help but you'll never lose karma inside your wealth\nIt'll find its way to you, I could pray for you\nFind an Angel to say that they're gonna protect you\nBut you did what you done now there's no way I ain't saving you\nWhat to do? Ki kartha tu?\nPlayer tu banna chonda si now you're screaming out I need a substitute\nWhat to do? Ki kartha tu?\nPlayer tu banna chonda si now you're screaming out I need a substitute\nGot a crew that'll rep you, enemies want to end you\nSamajh na aveh menu menu\nKuriyan sariyan kendiya tenu\n\nTuriya turiya jaanda, tere mode te bandook ve\nTuriya turiya jaanda, tere mode te bandook ve\nKhich ke na maari, saadi zindagi malook ve\nKhich ke na maari, saadi zindadi malook ve", "image": "https://images.genius.com/c7b577e452eb9d2f0ddc62423e23cc70.640x640x1.png", "year": null, "title": "Bandook", "album": null}]}