{"songs": [{"title": "Summer", "album": "OG In My System", "year": "2017-08-18", "image": "https://images.genius.com/07b927e7172e322890883117a68c58e2.1000x1000x1.jpg", "lyrics": "[Verse 1]\nTen toes down, head is in the sky though\nName another bitch going hard as I go\nI been on my job, ain't no suit and tie though\nBlow a million in a day, before I fucking die hoe\nGo bigger, pouring up the liquor\nToast up to the dreams, that we done seen\nAnd going bigger, go figure\nStone cold killer, only OG in my swisher\nIn my city I'm a pillar, pillar, pillar\n\n[Hook]\nMind in a daze, feel the fade, it's a ganja\nBitches throwing shade, that can wait for the summer\nI'ma misbehave, 'till I'm paid, see the honker\nI've been on a wave, on a wave, cowabunga\n\n[Verse 2]\nName a bitch that's tighter, name a pool that's colder\nAss getting fatter, pocket's getting swoler\nJust another way to say I'm going bigger\nVision getting clearer, still ain't never sold\nBut still a stoner!\nAll my flows be popping, all my shit is harder\nCircle for the winners, all my hoes be proper\nStarted with a vision turned it to a dollar\nTried to shut us down but now we got the power\nBlunt in my left hand, Henny on the other side\nShaking what she gave me, yeah I got it from my mother side\nNow we moving, city on my back, they screaming let me ride\nHaters used to bet they bottom dollar, holla, let me slide\nFuck that!\nBitches run they mouth, but we can't hear 'em out\nDeath to all you bitches who ain't with us, how I feel about\nAnyone who doubt us, go without us, see we necessary\nBitches ordinary, and we nothing short of legendary\nI been in the kitchen, whipping shit to get your head blown\nI been in the trenches, thirty inches in the red zone\nTouchdown, touchdown\nPass another swisher, I could bust down\nLooking for the winners, look at us now\nReal Shit!\n\n[Hook]\nMind in a daze, feel the fade, it's a ganja\nBitches throwing shade, that can wait for the summer\nI'ma misbehave, 'till I'm paid, see the honker\nI've been on a wave, on a wave, cowabunga\n\n[Verse 3]\nThey either love me, or they hate me for it\nHope there ain't a issue cause you know we for it\nBitch I never been a sucker how you paint me for it\nSame business only difference is they pay me for it\nSwaggin' only taking wins, I think you best be in\nAll we talk about is balling like ESPN\nI could probably start a riot, full of fly shit\nI'm the motherfucking pilot\nNow my diets vegetarian\nMore green, bitch we eating, give me more green\nBlow green, double cup, fill that slow lean\nDifferent city, still winning like the home team\nNothing changed, still shitting on your whole team\nLord!\nAnd I ain't even wanna have to do 'em like that\nI react, bitches hating when you moving like that\nI just found too many ways to say I'm running that shit\nHands up, like I brought a fucking gun in this bitch\nNow you see me though\n\n[Hook]\nMind in a daze, feel the fade, it's a ganja\nBitches throwing shade, that can wait for the summer\nI'ma misbehave, 'till I'm paid, see the honker\nI've been on a wave, on a wave, cowabunga"}], "artist": "Lil Debbie"}