{"artist": "Vado", "songs": [{"title": "Lonely", "year": null, "lyrics": "Baby, Yessss, I hear u, UN, Uh, Babyy please don't you leave me lonely, Never, Please, don't you leave me lonely you know the life is like my wife. Leave you? Where the do that at?\n\n[Verse 1 Vado]\nUh, GW cross Bridging, Fort Lee livin\nEdgewater, River Road, GT ignition\nMTV Cribs, Phillippe in the kitchen\nIf I can't get it, ????? in prison\nUhhuh , yaeyo Dealer the streets fiending\nConnects be 80 old niggas, Don't speak English\nGet my pay roll bigger I keep Scheeming\nSayin you a radio killer? keep dreaming\n5 dollar speak, ya talk cheap\nOn or off beat, bars up like Wall Street, YESSSS\nKnicks game floor seats, Nate Rob scores 3\nGTS Porsche jeep, big grill like Horse teeth\nHUUUUUH, Always been swag, pimp, fly\nLeather Burberry bucket with the plaid inside me\nLooking like JaRule when he crashed his ride\nWas screaming out my Boo, she look back and replied\n\n[Hook]\n\nPLease don't ypu leave me lonely I won't, I won't\nPlease don't you leave me lonely, I'm here for you baby\nPlease don't you leave me lonely, I won't, I won't\nI'm here for you mamma\n\n[Verse 2 Vado]\nYou screaming she a hottie, to me she probably luke warm\nNeed that Bugatti, page 12 out the DuPont\nHUUUUUh, clean you up like a new born\nIf I don't do Mascata, shot of Baji at the Juice Bar\nHUUUUUUUUUUUH, I got veto friends, c-notes is all I see like a Cee-lo win\nWhen I ride thru Harlem I dont need no Benz, na\nSame Jeep Duh Duh man drove Nino in\nFar from a new jack, finishes a new pack\nLike Ice T crib, one button will push your roof back\nSmooth cat, been hustlin thats a true fact\nUsed to go to school with a pocket full and loose Cracks YESSSSSS\nThe game shaky, got some loose screws\nHard to tighten when niggas providin them like who's who?\nDid the Skate King, I had a few NuNu's\nRather get hit with a .45 than a deuce deuce. whoooooo\n\n[Hook]\n\n[Verse 3 Cam'Ron]\nKIllla, V12, UN Killlla\n\nYall singin like Eric Clapton, me im forever clapping\nNever slacking, Velvet napkin Jeff ???????????????, leather action\nFuck whatever happen, .44 Beretta packing\nWhether any weather wherever, from a clever faction\nNO fiction not Nas its so written\nMy old pigeon Rodey box ?? the gold ribbion\nWhere im from check The sky, no ribbon\nDope fiends, crack houses, coke kitchens\nGo getters we go getting, we robbin with no givings\nAll this from low living, no wisdom\nSo sickening, life, death, no difference\nNo severance pay, on the road hitching\nAin't trippin, fuck a trick, Suck a dick\nFind another clique to go burn rubbers with\nI get bread, bricks, white, green, red chips\nBut when she left said thissssssssssss\n\n[Hook]", "album": "Boss Of All Bosses 2", "image": "https://images.genius.com/fedcd9a8e3e863c9a97730ca5eb017fc.500x500x1.jpg"}]}