{"artist": "Fashawn", "songs": [{"year": null, "album": "Higher Learning ", "image": "https://images.genius.com/0f9a3fd52decf556d2c5430acbf1344a.500x500x1.jpg", "lyrics": "[Intro]\n\n[Verse 1: Fashawn]\nGirls'd give an arm and a leg for a piece of my heart\nIs it my good looks or is it my art?\nIs it my charm, reason they can't stay still\nOr is it the fame, maybe it's the mass appeal\nLast year I was too short, or I was too skinny\nToo something, let's be for real\nNow you wanna hang, you know, laugh and chill\nSee me and my chick in ice grills\nHere's a cold shoulder, how it feel?\nSome emotions can't be concealed\nYou just mad cause I ain't tripping off you\nOut with the old, in with the new\n\n[Hook: Adele]\nYou grace me with your cold shoulder\nWhenever you look at me I wish I was her\nYou shower me with words made of knives\nWhenever you look at me I wish I was her\n\n[Bridge: Fashawn]\nCan't see the ex, can't leave him alone\nShe cry, she just mad because I moved on\nGirls wanting me now that didn't want me before\nI just gotta believe, just keep down on the low\n\n[Verse 2: Fashawn]\nThese days, she walks around\nAll by herself, head face-down\nYou look so blue, what happened to that smile?\nHeard I was on a row wiling out\nCity to city, so many ladies in the crowd\nTime of my life, I got no reason to frown\nGot a new chick so I ran and raved\nSee you on the streets and I don't even wave\nReason I left, you ain't know how to behave\nThis is the aftermath, what a mess we've made\nDamn, it's evident we're through\nWhen the shit gone my left, it could have been you\n\n[Hook]\n\n[Outro: Fashawn]\nYou could be next so you better behave\nI mean I could be gone today\nYou could be next so you better behave\nI don't know why, I just feel that way\nYou could be next so you better behave\nI mean I could be gone today\nYou could be next so you better behave\nI don't know why, I just feel that way\n\nSometimes, I just, I just feel that way. I don't why it is. That's just me", "title": "Cold Shoulder (Remix)"}]}