{"artist": "Papoose", "songs": [{"album": "The Boyz In The Hood", "title": "Gonna Make A Change", "image": "https://images.genius.com/ebef8842ae7f029c76a1ab0a254ce7ed.500x500x1.jpg", "lyrics": "[Micheal Jackson]\nSee the kids in the street with not enough to eat\nWho am I to be blind?\nPretending not to see their needs...\n\n[Verse 1: Papoose]\nThis remind me of the block party, back in the day we used to jam the most\nUsed to plug the music into the lampost\nI reminisce too much but if a man don't\nHe might forget where he came from and can't approach\nThe place he tryna go, a wise man won't\nI ain't at the top yet but I'm so damn close\nMy poems honest, so modest, I can't boast\nFast food I can't coat, I took home cooking for granted\nCause I couldn't imagine, These girls can't cook\nThey so into fashion, I like 'em cause I'm so into passion\nBut man when I was growin' up my mama was multi-tasking\nShe was frying chicken while holding the phone\nBetween her face and shoulder and smokin' a bone\nCombing my sister's hair, she think she's grown\nBut her hair was so nappy, it broke the comb!\n\n[Hook: Micheal Jackson]\nGonna make a change...\nFor once in my life...\nIt's gonna feel real good...\nGonna make a difference...\nGonna make it right...\n\n[Verse 2: Papoose]\nR.I.P. to Luther Vandross\nA house ain't a home without yo fam close\nI get phone calls saying: \"Pap come save me\nI hear you on the radio you're buzzing like crazy\nI'm out here in the jungle with me gun of safety\nRepping for your name, these niggas can't take me.\"\nReply: \"I'm still tryna save myself\nThe industry is all fam, don't mistake it for wealth.\"\nCouple days later, I heard somebody laid him\nThinking to myself: \"Maybe I coulda saved him?\"\nSome say they never change, but let money change them\nThey change for the worst so they start fating\nSome niggas go to jail and come home praising\nThe most high telling you he's so amazing\nSome people spend their whole life committing the same sin\nI guess it'll only take death to change them\n\n[Hook: Micheal Jackson]\nGonna make a change...\nFor once in my life...\nIt's gonna feel real good...\nGonna make a difference...\nGonna make it right...", "year": null}]}