{"artist": "Ice Cube", "songs": [{"title": "Doing Dumb Shit", "lyrics": "[O'Shea! O'Shea! Get your ass in here, boy You hear me calling you? O'Shea!]\n\nWhen I was young I used to hang with the seventh graders\nLittle bad motherfucker playing Space Invaders\nFucking with the girls in the fourth grade\nEither feeling on they butts or pulling on they braids\nWalking with the schoolhouse bully\nBy doing that, I had a lot of pull, G\nCheating on tests, making a mess\nCussing like a sailor at recess\nIt must a been a half moon\nCause you'll catch me running out the little girls' bathroom\nChewing on Good and Plenties\nGot my gamble on at lunch pitching pennies\nYo I was living like the class clown\nPulling all the hokes, making all the jokes man\nWhen you young it's hard to see\nThat it's wrong throwing rocks at the RTD\nPopping out your window with a BB gun\nBetter yet knocking on your door and run\nPlaying hide-and-go-get-it for a little stank\nEven though I was still shooting blanks\nAs soon as the dark hit\nI was stealing candy out the corner market\nUntil I got my ass whipped\nCause I was ten years old, doing dumb shit\n\nThirteen, that's how old I was\nWhen my jimmy started getting a little peach fuzz\nAnd I was looking at any butt and ass\nMe and my homies started cutting class\nGoing up to the high school\nLooking for any bitch I could lie to\nTell em I was older than I really was\nSmoked my first joint and got really buzzed\nThat's what a mack's made of\nBut when I got my first piece of pussy I fell in love\nHard as a rock the long way\nAnd then I put the rubber on the wrong way\nBut I still gotta have it\nOverexcited and fucking like a jackrabbit\nGoddamn I was hype\nA virgin but I still knew how to lay the pipe\nEven though the ho worked me\nI still knocked the boots from here to Albuquerque\nThen the shit got strange, money\nI started shaking and jimmy felt funny\nThen the nut came gushing\nI jumped up got dressed and start pushing\nCause I thought the bitch broke my dick\nCause I was still young doing dumb shit\n\nAt 17 got my first Volkswagen\nAnd mastered the life-long art of dragging\nTo the women in college\nHung out with the OG's and got some street knowledge\nBreaking in cars and all that\nHitting punk fools with a baseball bat\nFucking at a real fast rate\nTil they said that I might not graduate\nThen I said, \"Fuck the dumb shit\nCause Pops'll fuck me up quick\nIf things continue.\"\nSo I start rapping about shit I been through\nAnd I got real good\nNow I look at all the kids in the neighborhood\nTrying to be baby macks\nDoing shit that I did seven years back\nGoing through a stage\nBut before they can grow up they on the front page\nAnd they moms is having a fit\nCause they died young, doing dumb shit", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg", "album": "Death Certificate", "year": "1991-10-29"}]}