{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Here it comes...]\n\n[Since the far-off days when man first heard a scratchy noise\nOn a cylindrical drum accompanied by staccato human tones\nIt has been his aim to add breadth and depth, to give realism\nAnd spaciousness, and, even where it applies, to convey actual movement]\n\n[Verse 1]\nI start to go, my rhymes'll flow\nSo, get up and dance cause Kane said so\nIf you were lounging around it's time to get up\nPardon my expression, but I'mma tear shit up\nI appear right here, and scare and dare, a mere musketeer\nThat would dare to compare, I do declare\nGetting busy is where it's at\nBut what you're saying, you wouldn't get a point for that\nCause you're a featherweight, and your rhymes you carry light\nBut I drop bass just like Barry White\nSo how could you think that you pose a threat?\nYou say you're rocking, how many shows you get?\nAll your vocals go local on the M-I-C\nMines go a great distance, like AT&T\nI'm not new to this, I'm true to this, nothing you can do to this\nFuck around with Kane and come out black and blue for this\nSo, yo, go for what you know\nAttempt to debate so I can humiliate\nWe can go rhyme for rhyme, word for word, verse for verse\nGet you a nurse, too late, get you a hearse\nTo take you to your burial ground\nBecause the Big Daddy Kane always throws down\nCorrect, I get respect, I'm out to collect\nCash money, cause I get raw\n\n[Break]\nEverybody get up! (x4)\nKane: boy do I hate a...\nI'm coming! (x5)\n\n[Verse 2]\nHere I am, R-A-W\nA terrorist, here to bring trouble to\nPhony MC's, I move on and seize\nI just conquer and stomp another rapper with ease\nCause I'm at my apex and others are below\nNothing but a milliliter, I'm a kilo\nSecond to none, making MC's run\nSo don't try to step to me, cause I ain't the one\nI relieve rappers just like Tylenol\nAnd they know it, so I don't see why you all\nTry to front, perpetrating a stunt\nWhen you know that I'll smoke you up like a blunt\nI'm genuine like Gucci, raw like sushi\nTo stage a rage is what rap did to me\nTo make me want to create chaos and mayhem\nCold rock a party until the A.M\nI'll make a muscle, grab the mic and hustle\nWhile you stand dazed and amazed, I bust a\nLittle rhyme with authority, superiority\nAnd captivate the whole crowd's majority\nThe rhymes I use definitely amuse\nBetter than Dynasty, or Hill Street Blues\nI'm sure to score adored for more without a flaw\nCause I get raw\n\n[Break]\nEverybody get up! (x5)\n\n[Verse 3]\nGive a speech like a reverend, rappers start severing\nAnd in my lifetime, believe I've never been\nBeaten, or eaten and just tooken out\nYou know, come to think about it, I keep MC's looking out\nAnd real nervous when I'm at your service\nGive me that title, boy, you don't deserve this\nI work like a slave to become a master\nAnd when I say a rhyme, you know that it has to\nBe perfectly fitted, cause I'm committed\nThe entertainer and trainer and Kane'll get with it\nI go and flow and grow to let you know\nI damage ya I'm not an amateur but a pro-\n-fessional unquestionable without doubt superb\nSo full of action, my name should be a verb\nMy voice will float on every note\nWhen I clear my throat, that's all she wrote!\nThe minute that the Kane starts to go on\nBelieve it's gonna be smooth sailing so on\nAs I put other rappers out of their misery\nGet them in a battle and make them all history\nRuling and schooling MC's that I'm dueling\nWatch them all take a fall as I sit back cooling\nOn my throne, with a bronze microphone\nHmm, God bless the child that can hold his own\nCause I get raw\n\n[Break]\nAin't it good to you? (x3)\nDocumentary: here's an experiment to begin with...\n\n[Verse 4]\nTwenty-four sev chilling, killing like a villain\nThe meaning of raw is Ready And Willing\nTo do whatever is clever, take a loss, never\nAnd the rhymes I bust, coming off is a must\nAnd I come off hard with rhymes that are odd\nI rip the microphone and leave it scarred\nNever smoking or hitting or taking a sniff\nOnly crushing MC's that be trying to riff\nI get strong and titanic, do work like a mechanic\nMake MC's panic, they all get frantic\nAnd skeptic, like a girl on a contraceptive\nAs I rock but hey, what you expected?\nI'll get raw for you just like a warrior\nRapping like a samurai and I'll be damned if I\nEver let a Fisher-Price MC hang\nTheir rhymes are toy, nothing but yin-yang\nSo if we battle on the microphone\nBring your own casket and tombstone\nAnd I'mma preach your funeral\nTell me who in the world could ever come with more\nI get raw", "image": "https://images.genius.com/23d91f59169bb780391629dca6ffb63f.600x604x1.jpg", "year": "1988-06-28", "title": "Raw", "album": "Long Live the Kane"}]}