{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "Buc Buc Buk", "lyrics": "{*police siren*}\n[Cop]\tLicense and registration please\n\tStep out the car mister, step out the car\n\tKeep your god damn hands where we can see 'em pal!\n\tPUT YOUR HANDS IN THE AIR PAL!\n\tI'M WARNING YOU!  I WILL NOT {*unintelligible*}\n\tPUT YOUR GOD DAMN HANDS IN THE AIR!\n\tI'M WARNING YOU NIGGER!  PUT EM THERE!  PUT EM THERE!\n[Cop]\t{*continues babbling stupidly as beat starts*}\n\n[Daddy-O]\nI was riding down the turnpike (PIKE) and I got stopped\nBy a Jersey State Trooper type cop (COP)\nProceeded to pull over (OVER) showed him my credentials\nCause searchin my car just wasn't subsequential\nHe took the route like most cops do (DO)\nHarassin a black man like Little Boy Blue (BLUE)\nBut I kept cool (COOL) cause I got style (STYLE)\nAnd because I knew, that in a little while\nI'd be parlayin in New York where the niggas go BUC BUC BUK!\nCallin Cali, the niggas go BUC BUC BUK!\nAnd in Detroit, the niggas go BUC BUC BUK!\nAnd in Philly, the niggas go BUC BUC BUK!\n\nBein a bold black Brownsville Brooklyn boy (BOY)\nI rip rap records like the Real McCoy (COY)\nWhen you say you wreck shop I say that's all? (ALL)\nCause I shun the ho-hum and mash the mall (MALL)\nAnd no need to take time to stake me out (ME OUT)\nCause I'll beat your pee out and take the clout (CLOUT)\nMy crew's that thick like the GangStarr DWYCK (DWYCK)\nAnd we don't need a strike to put you out (YOU OUT)\nCause whether in Cleveland the niggas go BUC BUC BUK!\nOr in Atlanta, the niggas go BUC BUC BUK!\nOr Chicago, the niggas go BUC BUC BUK!\nAnd in Miami, the niggas go BUC BUC BUK!\n\nCheck it walkin a beat, or drivin around (ROUND)\nWhen you're in the hood you hear the same old sound (SOUND)\nOld school beats meetin new school rhymes (RHYMES)\nAnd styles, evolutin all the time (TIME)\nAnd no-no, a badge can't move the crowd (CROWD)\nAnd neither can a nightstick, that ain't slick (SLICK)\nBut Ed makes beats like a bulletproof vest (VEST)\nGive it to me, and I'll do the rest (AND I'LL DO THE REST)\nCause in North Carolina the niggas go BUC BUC BUK!\nAnd in Milwaukee, the niggas go BUC BUC BUK!\nIn Minneapolis, the niggas go BUC BUC BUK!\nAnd in Flint, the niggas go BUC BUC BUK!\nAnd in Fresno, the niggas go BUC BUC BUK!\nAnd in Houston, the niggas go BUC BUC BUK!\nAnd in Newark, the niggas go BUC BUC BUK!\nIn St. Louie, the niggas go BUC BUC BUK!\nAnd in Louisville, the niggas go BUC BUC BUK!\nAnd in Saginaw, the niggas go BUC BUC BUK!\nIn Lake Charles, the niggas go BUC BUC BUK!\nAll down in D.C., niggas gettin BUC BUC BUK!\nAnd in Oakland, the niggas get BUC BUC BUK!\nIn East New York, the niggas get BUC BUC BOOM!\n\n[Dumb Cops]\nYou'd think that we'd learn from the Rodney King verdict\n\tYeah niggers\nLeave no fuckin witnessing niggers!\n{*cops laughing.. then three shots fired*}", "year": null}], "artist": "Daddy-O"}