{"artist": "Ace Hood", "songs": [{"title": "3 Bless", "album": "Trust the Process II: Undefeated", "year": "2017-11-02", "lyrics": "[Intro]\nGod, family, my fans, and the money is the only thing that count, nigga\nYou dig?\n\n[Chorus]\nGet a deposit\nThen I divide it\nWe never had it\nSo I provide it\nI never stress\nNigga, you blessed\nBut that don't mean I won't do things that I'll regret\n\n[Bridge]\nFor all of my niggas who kept it 100, I feel I'm in debt\nFor all of my people who back in my city, I got a connect\nI'm a survivor\nLittle more wiser\nLining my chakras, 3rd eye monster\n\n[Verse 1]\nI'm on a new level, it's a loose rebel\nTo the Dom P from a wine cellar\nGot an upgrade on the time-teller\nGot some Vans on, not the Margiella's\nNeed a pallbearer, kill a nigga with a 16\nFlow came with a Windchiller, need a chinchilla, nigga, too cold\nTruth told in the rap game, I am Von Miller, nigga, beastmode\nFuck a nigga with them fake feelings, like they been with us\nYa'll weirdos\nBitch, I know I been the greatest\nYou ain't gotta state it, I'ma let the work show\nTold Meek Milly backstage, I'ma charge in through the front door\nFacts nigga\n\n[Interlude]\nWe gon' get that bag\nHefty sack, nigga\n\n[Chorus]\nGet a deposit\nThen I divide it\nWe never had it\nSo I provide it\nI never stress\nNigga, you blessed\nBut that don't mean I won't do things that I'll regret\n\n[Bridge]\nI can't forget about them times when I was broke\nI can't forget about my dawgs and all my folks\nI kept my trust and kept my faith when they lost hope\nI kept me focus, no emotions, ain't gon' show\n\n[Verse 2]\nLook at me now, I'm full grown\n'Nother shoulder with a chip on\nWack rappers in the kill zone\nPredatory, get you prayed on\nNiggas layin' on your momma' home while I'm flying in another time zone\nWe ain't talkin' money, get the dial tone\nI've been meditating, got the mind strong\nAnd I can't forget about my woes and my lil' bro\nI had some friend who switched up sides and they got ghost\nAnd I had hoes, was on my line, was doing the most\nI've been though hell, but you can't tell the way I glow\n\n[Chorus]\nGet a deposit\nThen I divide it\nWe never had it\nSo I provide it\nI never stress\nNigga, you blessed\nBut that don't mean I won't do things that I'll regret\n\n[Bridge]\nI can't forget about them times when I was broke\nI can't forget about my dawgs and all my folks\nI kept my trust and kept my faith when they lost hope\nI kept my focus, no emotions, ain't gon' show\n\n[Outro]\nAgh!\n3 Bless\nGod, family, my fans, and the money, it's the only thing that count\nDig that!", "image": "https://images.genius.com/f7b49e710a7b42cf02d24a0ec7cb9098.500x500x1.jpg"}]}