{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "Apollo", "year": null, "album": "The Tape", "lyrics": "\"I'd like to know.. are you really ready for some super dynamite soul?\n\t Then thank you, because now, it's star time!\"\n\nThe Apollo (4X)\n\n[Kid Capri]\nThe Apollo a place, where performers perform\nBefore you got on the stage you would all be warned\nAbout if you're good enough, to rock the place\nBut if you wasn't they would throw beer cans in your face\nWell it was a, amateur night, a group dressed in white\nDidn't think it was spectacular but they were alright\nKept sayin to myself, I wish it was me\nThat was on the stage doin my R-A-P\nWell uh, anyway we go back to the days\nWhen James Brown used to have, the crowd amazed\nHe used to come out, dancin, just doin his work\nAnd when he screamed, all the ladies went bezerk\nSlidin across the stage like he was runnin on oil\nShoes, shinin bright like aluminum foil\nWomen was fallin out, innocent to ?\nHe said, \"PLEASE PLEASE\" then started rappin\nYou only seen one show you couldn't stay to see another\nOf the singin Godfather Number One Soul Brother\nEvents like this happened all the time\nAt the place that was known to be, one of a kind\nIt's The Apollo\n\nThe Apollo (4X)\n[Kid]\tIt's the Apollo!\nThe Apollo (3X)\nThe Ap..\n\n[Kid Capri]\nThe Apollo yes a legend in it's time\nThe place is so fly that I wish it was mine\nI mean the line was so long but people did not care\nJust as long as they knew, they could get in there\nOn Wednesday's, amateur night was cool\nAnd you could, go to see what other artists could do\nNothin but black stars, risin to the top\nNow you see what's takin over, we call it hip-hop\nThe Apollo, no other, could ever compete\nWhen you look down and I see people movin their feet\nWhen the stage used to rise all the people went nuts\nAnd no one EVER kept their big mouth shut\nThey used to, scream and yell, raise a whole lot of hell\nHang off the balcony and sometimes they fell\nIt's a tradition, so whatta ya do?  I don't know\nYou get a ticket take yourself to the Apollo, hey\nThe Showbiz Cafe, was right next door\nLeave, from the Apollo and you party some more\nYou can go many places to have a show\nBut no matter where you went you always seemed to go\nTo the Apollo\nTo the Apollo!\nUhh.. (The Apollo) .. ..\nTo the Apollo!\nAnd let me break it down for you one time\n\nHey the A for Artist, the P for People\nO for Outstanding, L - for Legal\nAnd the other L-O is for the low-down shame\nFor the ones, that tried, to destroy the name\nSo whatever you do, you can never forget\nAbout the place, that always kept you drippin with sweat\nFrom dancin and prancin and jumpin up and down\nEverytime you turned around a new show was in town\nIt's the place, that everybody would always go\nAnd I called it, the famous Apollo\nIt's the Apollo\nIt's the Apollo! (The Apollo) UHH!\n\nThe Apollo (4X)\n[Kid]\tIt's the Apollo, come on!\nThe Apollo (3X)\n[Kid]\tUHH!\nThe Apollo (2X)\n[Kid]\tIt's the Apollo!\nThe Apollo (2X)\n\nThe Apollo.."}]}