{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "MC’s", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "[Hook]\nEmceeee's\nMaster of Ceremonie [yeah!]\nEmceeeeeeeeeeeeeeeeeee\nEmceee's\nMaster of Ceremonie, cause to me Emcee means Move the Crowd\n\n[VERSE ONE]\nYeah\nA supreme mc has lots of girls\nLets his nine go bang while he rocks the world\nYo, a cool mc stolls thru the bitches\nMight be on the run down \"THE ROAD TO THE RICHES\"\nA wise mc blazes thru\nAnd he ain't NO JOKE cause he's \"PAID IN FULL\"\nYo, a raw mc loves to blast weapons\nYou know the nigga motto, \"AIN'T NO HALF STEPPIN'\"\nA slick mc is wet off props\nHe'll tell the CHILDREN a STORY while he let off shots\nAh...a critical mc takes a stand\nIf you fear a BLACK PLANET planet c'mon raise your hands\nPeople....a hard mc got to sell\nHis MOTHER said KNOCK YOU OUT while he ROCKS THE BELLS\nBrotha...a real mc talks so brave\nAnd they also taught me how to \"WALK THIS WAY\"\nWhat!\n\n[VERSE TWO]\nYeah\nA natural mc never kicks a bad rhyme\nThe WORLD IS HIS, he be chillin at \"HALFTIME\"\nA rugged mc comes with a better plan\nAlways ready like yeah \"WHATEVA MAN\"\nMethodical mc's get the check\nAnd they got hot nickels so \"PROTECT YA NECK\"\nUh....a consistent mc will use a BLUEPRINT\nTo BIG PIMP while he schools his students\nA B.I.G. mc rolls with a M.A.F.I.A\nVersace shades, watchin' ya, like \"WHO SHOT AT YA?\"\nAn entertainin' mc is nice to me\nSo put your fuckin hands WHERE MY EYES CAN SEE\nThanks....a thug mc is just like a viking\nMake a song about you and you'll still like him\nDeep mc's is total OFF THE BOOK niggas\nMURDA MUSIK, they scare all the SHOOK niggas\n\n[Hook]\n\n[VERSE THREE]\nA SHADY mc pulls up in a mp\nWhips out a gat but the mothafuckah empty\nA crazy mc, he always wanna SHYNE\nTill he locked up in a cell doin nine, nigga why?\nA loose mc, he always wanna shoot\nHe ain't gotta do much, thats THE REASON he \"THE TRUTH\"\nA southern mc will capture you\nScreamin' out \"MOVE BITCH\" as he \"ACT A FOOL\"\nA creative mc is always official\nEven have his own language \"FA SHIZZLE MY NIZZLE\"\nHey, a clever mc locks the stress out\nHe dont give a fuck like \"KNOCK YASELF OUT\"\nA strong mc is crafty yall\nHe will catch himself \"SLIPPIN'\" like \"GET AT ME DOG\"\nArgh!...true mc's paint our hood\nWith SOUL even if it ain't \"ALL GOOD\"\nYo!\n\n[Hook]", "year": null}]}