{"songs": [{"image": "https://images.genius.com/67716a0c2034f5b43dd35f6c754adcf3.450x450x1.jpg", "year": "2009-04-24", "title": "E.T.", "album": "Please, Hold", "lyrics": "[Verse One: Mickey Factz]\nSee, I seen so many faces\nI've been to many places\nSo, I get so tired of dating\nThat, I just get tired of waiting\nI met these species of woman\nIt was nothing to keep me from looking\nSo I wondered if she was from Brooklyn\nCause she was out of this world\nI need some info about this girl\nLooking fabulous, pushing a Saturn\nI hope she take me to her planet\nIf she touch me then it'll get ugly\nIf I'm lucky, she will abduct me\nOn a spaceship and tell me she want me\nI know I got her\nNow that's what I call a close encounter\nUhh\n\n[Hook]\nThey say I'm extraterrestrial\nWhich means I'm out of this world\nYour glow is oh so sexual\nSo you should phone home to me girl\n\n[Verse Two: Harlem's Cash]\nThey say I got E.T.'s bling\n? spaceship, red or blue pills, now we in the Matrix\nForeign top models, yeah I stay with\nAn illegal alien chick stuck in immigration\nSee she from Belize\nBut just invaded South Beach\nAsked to be brought to her leader\nThey directed her to me\nThe one who bubble from the bottom like Nikes\nNow I'm moon walking niggas in my Y3s\nNot in vain/vein though, no IV\nTwin baby boys, Siamese Tyrese\nSo if it ain't about scratch, then no flees\nI'm a ? like racist, nigga please\n(6, 5, 4, 3, 2, 1)\nI'm outta this world Apollo 13\nShe Mindy I'm Mork around these Earthlings\nChampion\n? to Earth rings\nYou a Fo kid, he heard he had wings\nCash, Gordon, Mickey, me\n\n[Hook](x2):\nThey say I'm extraterrestrial\nWhich means I'm out of this world\nYour glow is oh so sexual\nSo you should phone home to me girl\n\n[Verse Three: XV]\nWorking at the Daily Planet, I manage to meet her\nTook off my glasses so I could really see her\nShe said, \"I love the Squarian demeanor\nSo Square in the Circle, put a circle around my finger.\"\nMust of had me confused, my name's Clark Kent\nAnd I landed in Kansas from a star ship\nOpen up the closet in my apartment\n\"If you ain't Superman then what do you call this?\"\nDamn\nNow she know my secret\n\"Now tell me what I gotta do to make you keep it.\"\n\"Fly me around the world and buy me Victoria Secret\nAnd I'll be so tight that I could never ever leak it.\"\n\"True dat.\" Should of knew that from jump street\nUnder the covers and then she comes sleep\nMix Master Ice on the process\nThe new UTFO, you the newest object\nPeace\n\n[Hook](x2)\nThey say I'm extraterrestrial\nWhich means I'm out of this world\nYour glow is oh so sexual\nSo you should phone home to me girl"}], "artist": "XV"}