{"songs": [{"lyrics": "\"Every time I get up to the front of the line, they push me back to the rear.\"\n\nPushed\nBack to the rear\nOpen up your ears\nAnd hear what I say\n19-9 whatever\n\n[Chorus]:\n\"I had a dream last night\"\n\"I had a dream last night\"\n\"I had a dream last night\"\n\"I had a dream last night\"\n\n[Verse One]:\nI'll never forget it\nAt the bus stop headed\nFor the bud stop, let it be a buckshot that came my way\nSo I dived imbedded between a shadow and a tree\nAin't no nigga gonna kills me\nIf I could just bust a move and get myself in a bus then I can leave\nCause I don't wanna get my cap peeled\nCause I don't wanna wear a weave\nThen the shot stopped\nAnd I seen a cop at the coffee shop, I drop\nTuck, rolled, hop to where he was at and I said, \"Yo Oc\nThe bad bwoy licka likkle shot.\"\nHe put the donut to his face and giggled\nHis partner sort of sniggled\nIt seems to me they were both a little tickled\nAnd I hated\nI didn't have my nickle\nPlated, toy steel\nWith six hot meatballs tearing out your shell\nSo I bail\nAnd then I heard the screech of an El\nCamino being tailed by a doobie\nTruly\nThis ain't the place to be so I jetted\nHeaded, to another place where I would not regret it\nThen I walked in a hardware store\nLookin' hard to find the 2 by 4 to rock his helmet\nSo I asked the cashier\n\"Looka here\nYou gotta drill bit to kill it? I feel it's near now disappear\nSplit, get back to the room in the rear and sit\nAnd I'mma count the amount I'm about to hit.\"\nYo, I was greedy for the papes\nBy the way I need some tape\nCause if he escape I'mma bust his grape\nI said, \"Old man, tell me where the tape at\nAnd I'm out.\" I was askin' for the last kid, to cover up his mouth\nHe said, \"The only tape I got is torn tape\nA little bit of duct tape\nSome ? when you're born tape\nHip hop's got tapes, a little rock and a pop tape\nLast is my fast tape, OH and my jazz tape\nYo!\"\nI said, \"Look, I DON'T WANT TROUBLE\nI'LL QUICKLY BUST YOUR BUBBLE, on the double\nNow somebody call a medic, forget it\nBetter just call a morgue man, a ?\nA dead body dresser\nWith the cold clammy hands cause I'mma make this man a date with a stretcher\nHa! Hoh! Ha!\n\n[Chorus]:\n\"I had a dream last night\"\n\"Oh yeah\"\n\"I had a dream last night\"\n\"Oh yeah\"\n\"I had a dream last night\"\n\"Oh yeah\"\n\"I had a dream last night\"\n\"Oh yeah\"\n\n[Verse Two]:\nI'll never forget it\nOn the Greyhound, headed\nUp to Raytown, let it, be a fat joint that got me blowed\nSo I slept in, embedded between the window and the seat\nHope nobody interrupt my sleep\nIf I can just tell ya what had happened to me when I was dreamin' that day\nFirst of all, see I'm one of those brothers that'll tell it like it is see?\nI ain't the one to be beatin' around nobody else's bush either\nCause I'm straight forward and to the point and I won't hold my tongue\nNow I was down and under the 25th and Gayle\nYou know, by the liquor sto'\nWhere the old man drink Old Crow\nAnd the same old man with the same ole baseball cap\nComin' up to me with that same old rap\nWalkin' with a limp and thinks he's a mack\nWell he might have been back in the days, but I don't know nothin' 'bout that\nSo you know, I walks in the store\nYou know I gets my bottle of juice and I gets my trail mix\nCan I have my trail mix\nCan I have that real shit you know?\nYou know, huh, peanuts, raisins, dates and banana chips\nWell, anyway so\nSo, I pays for my little items you know I gets my change\nAnd I gets my bag and I walks out the door feelin' strange\nAnd I looks around and I come face to face\nFace to face, FACE TO FACE\nWith the same brother and he says\n\"YOU, ARE A NIGGA.\"\n\n[Chorus]:\n\"I had a dream last night\"\n\n[Verse Three]:\nI'll never forget it\nAt the bus stop headed\nFor the bud stop, let it be a buckshot that came my way\nSo I dived imbedded between a shadow and a tree\nAin't no nigga gonna kills me\nIf I could just bust a move and get myself on a bus then I can leave\nCause I don't wanna get my cap peeled\nCause I don't wanna wear a weave\nThen the shot stopped\nAnd I seen a cop at the coffee shop, I drop\nTuck, rolled, hop to where he was at and I said, \"Yo Oc\nThe bad bwoy licka likkle shot.\"", "title": "I Dream", "album": "All Balls Don’t Bounce Revisited", "image": "https://images.genius.com/5afdae8c12d9c72303cb15a766b901de.700x700x1.jpg", "year": null}], "artist": "Aceyalone"}