{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "F….k Da City Up (feat. Young Jeezy)", "lyrics": "[Hook: Young Jeezy]\nThis for my niggas on the block dodging one time\nGrinding hard, burning up at least one nine\nPut ya middle fingers in the air one time\nRide wit me, fuck the city up one time\nFuck the city up\nFuck the city up\nFuck the city up\nFuck the city up one time\nFuck the city up\nFuck the city up\nFuck the city up\nFuck the city up one time\n\n[Verse 1: T.I.]\nFresh out the bed getting head in a Range Rove\nAll about that bread, rubberbands on my bankroll\nBankhead, Simpson Road this Atlanta bitch\nSo fly, so gangsta, gutter, glamorous\nWe living out your fantasies, suckas can't handle this\nThey know we run the city shawty it's unanimous\nShout it out sold yay, nine forty-four\nK, Quarter, half, whole thang nigga like the old days?\nHey, dope boy trap nigga swag\nHundred karat chain, quarter mil in the bag\nI'm no longer poppin' tags I just let 'em hang\nSucka nigga doing bad I just do my thang\nAnd I ain't frontin', straight by the book--G Code\nBad bitch, a flat stomach, fat booty, deep throat\nTwenty grand in my pants, fifty in my peacoat\nJeezy fuckin' wit me and we fuckin' up the city ho\n\n[Hook]\n\n[Verse 2: Young Jeezy]\nI seen Jizzle in traffic with his top off\nSo much Louie shit it looking like it knock off\nViolation, that'll get ya ass knocked off\nTexas Pete nigga get ya ass hot sauce\nEver see me in the club with my shades off\nIt was a cool contest I guess the shades lost\n28-5 yeah that's my cost\nBitch my closet so big I swear I got lost\nWhat? Yeah I think I'm gon' need a map\nWe throw them birdies in the pool make 'em swim a lap\nWhip it counterclockwise, that's the backstroke\nBitch my chain so big look like my back broke\nYeah we 'bout to fuck the city up, go broke\nBitch I'm balling so hard I need the whole court\nSix spots in one night they call it club hopping\nThat new Tip and Jizzle shit, it got the club rocking\n\n[Hook]\n\n[Verse 3: T.I. & Young Jeezy]\n[T.I.]\nI'm talkin' A-Town shit, ex lean pound bit\nChopper, fifty round clip\nKeep it with me, I 'on't slip\nAnyone around Tip bout that drama boy I promise\nGot a O of presidential, bitch I'm blowin' that Obama\n[Young Jeezy]\nYeah I'm talkin' plenty choppers, scopes on the A-R\nYou know how I do it, Forgiatos on the car\nWhen I came up out the womb all I wanna be a star\nHope the feds don't stop me, life sentence in the car\n[T.I.]\nHey boy we spittin, reminiscin' bout when we was in the kitchen\nRepresentin', niggas payin' bitches need to pay attention\nAnd we on for the city freaks, this A-T-L\nDo it for my nigga Big Meech and B.M.F. nigga\n[Young Jeezy]\nNigga, all I blow is strong bitch I'm straight for the week\nOrder 5000 dollars, threw it all on the freaks\nOrder twenty-five bricks, I put em all on the streets\nBitch it's shaketown and we turnt up while you sleep"}], "artist": "T.I."}