{"songs": [{"year": null, "album": "Who Is KB?", "image": "https://images.genius.com/cc0b72e73e609b19ba9fe03fa5eac73b.757x759x1.jpg", "title": "Lighter Fluid", "lyrics": "[Hook]\nOn that lighter fluid\nOn that, on that lighter fluid\nOn that lighter fluid\nOn that, on that lighter fluid\n\n[Verse 1]\nAll things movin' are by, for, and to Him\nBorn in Mary but Mary was born again through Him\nPeace between the two, God and man, deuces\nHe removed the curse, this is censorship music\nAbout His Father's business, ironically He was Jewish\nPisces horoscope can't touch what he did with them two fish\nHe's so fly, sinners wanna shoot him\nStranded on His relationship, carnival cruisin'\nYou don't wanna go toe to toe, with the one who's runnin' everything\nBetter hit them knees and forgiveness please\nGo and get a little bit of truth ask him plea(x2)\n\n[Hook]\nOn that lighter fluid\nOn that, on that lighter fluid\nOn that lighter fluid\nOn that, on that lighter fluid\n\n[Verse 2]\nJesus is God, all of y'all are not him\nOne God known for the three, John Stockton\nRun this play, handed off to Christ no option (football)\nYou can't pay your way, put the quarter back in the pocket\nNarrow minded, headed straight, already in a better place\nSin gotta leave my head, DNA\nI'll take an insipid place as long as my sins have been erased\nI'm shootin with a Canon get the picture,scripture\n\n[Hook]\nOn that lighter fluid\nOn that, on that lighter fluid\nOn that lighter fluid\nOn that, on that lighter fluid\n\n[Verse 3]\nI got a little more\nSalvation is a gift but most men'll sleep\nOr try to get it at the last minute like Christmas Eve\nWe are sick in need,I believe, anti-histamine\nIs in the trinity,not your any way genegies\nCheck my symmetry, I'm balanced in the ministry\nSimply livin' before the cross like Gethsemane\nMy enemy's enemy is Divinity\nEndin' the enmity in between God and me, is you feelin' me?\nHigher than I ever been,always tryna represent\nIntroducin' light to this world like Thomas Edison\nLike ed knife, fall away? Yeah right\nMy inheritance is sealed, you can say I'm heir-tight\nLive in community, I don't do islands\nThe Lord's army doesn't enlist privates\nI preach one way,I pray that you trust in Him\nIt's black and white, He removes the gray like Just For Men (Get it?)\nHe was just for men, atonement was just for Men\nHe won't fit in your schedule I suggest you adjust to Him\n\n[Hook]\nOn that lighter fluid\nOn that, on that lighter fluid\nOn that lighter fluid\nOn that, on that lighter fluid"}], "artist": "KB"}