{"songs": [{"year": "2014-07-28", "lyrics": "[Intro: Baby-E]\nYeah..\nYeeeahhhh\nUhmmm\n\n[Hook: Baby-E]\nLight up, light up\nStrike a match and watch the flames burn bright\nLight up, light up\nBreathe deep and let it clear your mind\nWhen you start feeling down, light one up, pass it 'round\nKeep your chin up and head high cause nothing's forever\nLight up, light up\nBreathe deep and put it in the sky\n\n[Verse 1: Baby Bash]\nI'm never drinking and driving, I'm only smoking and flying\nToo many dying, alcohol related death's multiplying\nSo you know, we gotta keep it in perspective\nGet my point across, like a boss and make sure that mi gente gets the message\nI'm just gonna blow up on this fire, who got the lighter?\nYou want that sherbert OG Kush, that Cookie gets you higher\nNeed no crazy pills to give me no crazy thrills\nThat's cause how a playa feels, I'm smoking until the wheels fall off\nYeah, and that's how we keep it lifted\nCalifornia Finest are organically engifted\nI'm in love with Mary Jane, some call it that Marihuana\nI'm the one you call when you need that good ganja\n\n[Hook: Baby-E]\nLight up, light up\nStrike a match and watch the flames burn bright\nLight up, light up\nBreathe deep and let it clear your mind\nWhen you start feeling down, light one up, pass it 'round\nKeep your chin up and head high cause nothing's forever\nLight up, light up\nBreathe deep and put it in the sky\n\n[Verse 2: Z-Ro]\nUuuuuh\nInhale, exhale, fucking right I love it\nI got murder munchies, I’ll die without chicken McNuggets\nUsed to buy bags, now I bring it back in buckets\nThe fuck is this a seed? My nigga, you must be bucking\nI don't smoke less than OG Kush bitch\nY'all boys smoking on that bull shit\nProbably ain't even coughing off none of that\nIf I was you, I wouldn't even much none of that\nCan't even smell it when it's burning, that's that lil boy shit\nI'm a grown man, I don't smoke with lil boys bitch\nSuper Sour Mix with that Cookie\nVeteran lungs since day one, I've never been a rookie\nPlain RAW papers, or RAW paper cones\nIf I add a styrofoam cup I ain't gon' make it home\nI'm just saying I'm so gone, I don't even know where I'm suppose to be at\nHow the fuck we suppose to be sober when Mary Jane everywhere we at\n\n[Hook: Baby-E]\nLight up, light up\nStrike a match and watch the flames burn bright\nLight up, light up\nBreathe deep and let it clear your mind\nWhen you start feeling down, light one up, pass it 'round\nKeep your chin up and head high cause nothing's forever\nLight up, light up\nBreathe deep and put it in the sky\n\n[Verse 3: Berner]\nCookie smoke in the air, there's police everywhere\nYeah I smoke where I want, now I don't really care\nWill I share? I don't know\nIf I'm down? I'm in town for a week\nLet's go half on that pound, yeah I only want that loud\nYo, we don't make a sound that ain't good\nNo swishas, no woods, bong hits if we could\nRoll another one, think we should\nYou can smell it through the bag\nI made it killing off the wax, so wanna take another dab?\n\n[Hook: Baby-E]\nLight up, light up\nStrike a match and watch the flames burn bright\nLight up, light up\nBreathe deep and let it clear your mind\nWhen you start feeling down, light one up, pass it 'round\nKeep your chin up and head high cause nothing's forever\nLight up, light up\nBreathe deep and put it in the sky", "title": "Light Up", "album": "Ronnie Rey All Day", "image": "https://images.genius.com/55c681c1aa5c522fa8461fc1721df6f7.600x600x1.jpg"}], "artist": "Baby Bash"}