{"songs": [{"album": "Klusterfuk", "image": "https://images.genius.com/d81918b5eb66018731d6fb1da718ea1e.900x900x1.jpg", "year": "2012-03-13", "title": "Can’t Stand Me", "lyrics": "[Intro: Krizz Kalko]\nNueve!\n\n[Verse 1: Tech N9ne]\nThe rapper you gotta have in your chatter\nYou be gathering data, to mom and dad it's a matter\nCause they lad is fanatical, for this Vladic, this radical\nAdd a skill that brings avid adolescents to drag us\nEverywhere in there beats by, they be loving the speech\nI teach my beast, I eat when records released by\nThey favorite artist, invaded they hardest\nThe way that it started, my latest they'd have paid it regardless\nEver been to a Tech show? (I haven't, I haven't, I haven't)\nThen why you stopping and popping me out the deck for?\nHear that I got the best flow? (I haven't, I haven't, I haven't)\nGranny clipping, tripping with Ellie and Jethro\nFor listenin' to my music they choose it, they use it\nAs therapy they're on me when I do this, they lose it\nMom and daddy wanna ban me, I'm loud like a wild banshee\nI'm rowdy and antsy, maybe that's why they can't stand me for real\n\n[Hook: Tech N9ne & (Krizz Kaliko)]\nThese are people who can't stand me\nYour mama, your daddy, your greasy-ass granny\nWho be callin' me uncanny\nYour mama, your daddy, your greasy-ass granny\nThey tell you: (\"I'm no good to you,\" but you don't listen to me\nI'm the one you love, but your people can't stand me)\n\n[Verse 2: Tech N9ne]\nShe knew this rap kid was a stack getta\nBut dad lit up, when he saw that the kid was a black nigga\nAnd she's a wack bitch, if you fight back with her\nAnd her mama's mad sick, cause the lad's dick is from Africa\nThat's why they always act shady, we splat babies right at Brady's\nThat's maybe the worst for a white lady, that's racy\nNo longer match-makey, when the blacks\nAttack wack, they be watchin' the mac lately\nEver been with a black dude? (I haven't, I haven't, I haven't)\nYou're prolly thinkin' we all weed and tattoos\nEver thought white and black's cool? (I haven't, I haven't, I haven't)\nThat's cause you think your daughters' gettin' her back bruised\nYour mom's in your business, she's in your business\nCan't you see she wants you to keep us niggas at a distance?\nSeparation existin', and here's cold\nThis story took place when I was 16 years old, yo\n\n[Hook]\n\n[Outro: Krizz Kaliko]\nVes, que ellos dicen\nQue soy malo para ti\nSi tu me amas\nTe puedo deshonrar, deshonrar\nNo soy bueno\nPero te amo, te amo\nNo soy bueno\nPero te amo, te amo"}], "artist": "Tech N9ne"}