{"songs": [{"year": "2012-07-17", "album": "Weight & Glory", "image": "https://images.genius.com/a863b1755efdc7e3ff78486266271cca.600x600x1.jpg", "title": "Mr. Pretender", "lyrics": "[Intro]\n(Coughing)\nWhat you mean you done with me?\nYeah, you for real? You finished?\nCrazy, we'll see about that, we'll see\n\n[Verse 1]\nI be killin' it, I'm ill and legit\nWhoever say I'm illegit don't say that when they hear my blessin'\nChristians say I'm nemesis, go look at Genesis\nBut who cares? I'm friend with benefits innocent\nI can, I can get you right\nMe and my homie, endorphins are air tight\nPleasure's what I swear by\nMy one code is there's no code\nDo what thou will, just for the thrill\nGive it a go, don't let nobody hold you\nSo what you need with a God?\nYou made it this far, who is He to call the shots?\nBut did He really say I'm no good for you?\nThen why I'm so good to you?\nForbiddin' me He shouldn't do\n\n[Hook]\nIt's a shame that I can't say\nThat I know you when I've known you forever\nWhen I've known you forever\nMr. Pretender, Mr. Pretender\nThought I knew you but I didn't\nAnd even though we're finished\nCan't believe you had me living in your fantasy\nMr. Pretender\n\n[Verse 2]\nI was tryna satisfy ya, deify ya\nYou do what you think is right, you be the God you bow to\nI can take you higher\nAnd those Christians are liars\nRiver in Egypt, they in denial\nBut when you felt better\nI know afterwards, guilty, dirty, and real pressure\nBut there was real pleasure\nI'm here when it gets rough\nI got website that'll get you fixed up\nA blunt that'll make you lift up\nOf course I told him he should go divorce her\nHe's a man, how he gon' be faithful to one girl?\nAnd he knows it'll cost him his life in ministry\nBut I make him think it's worth one night gettin' in the sheets\nI'm a beast, you can be a Christian and live in me\nGod can have the public but in private it will be him and me\nWe need liquor, need strippers, homie ride or die\nGo put that bullet in that magazine and make it fly\n\n[Hook]\nIt's a shame that I can't say\nThat I know you when I've known you forever\nWhen I've known you forever\nMr. Pretender, Mr. Pretender\nThought I knew you but I didn't\nAnd even though we're finished\nCan't believe you had me living in your fantasy\nMr. Pretender\n\n[Verse 3]\nSo what I might've lied a lil'?\nAnd my good friend, Death, kills\nBut don't act like you didn't know\nYou love the way I make you feel, you know the deal\nLook, I got wages, a paycheck\nFor instance, you thought you was havin' safe sex\nI promote latex, get your wrapper dog\nBut a condom can't protect you from the wrath of God\nI had the world deceived, then came Jesus\nThought I beat Him, but on the cross I was defeated\nImagine that, He deceived the deceiver\nLeft me on the ground bleedin'\nWhile he leads slaves to freedom\n\n[Hook]\nIt's a shame that I can't say\nThat I know you when I've known you forever\n(**Cough cough**)\nWhen I've known you forever\n(Hold on, I'm dying)\nMr. Pretender, Mr. Pretender\n(But I ain't dead yet!)\nThought I knew but I didn't\n(Forget Jesus, join me in hell)\nAnd even though we're finished\nCan't believe you had me living in your fantasy\nMr. Pretender, Mr. Pretender\nThought I knew you, but I didn't\nAnd even though we're finished\nCan't believe you had me living in your fantasy\n(I am the deceitfulness of sin)"}], "artist": "KB"}