{"songs": [{"album": "The Power of a Woman", "image": "https://images.genius.com/7c0da5fd21bfd7b5cc622eeaf00c35fc.500x500x1.jpg", "year": null, "title": "Anything You Want", "lyrics": "[Verse 1 - Tairrie B]\nHere we go on the flow, I got some suckas on the ill tip\nSo I suppose I'll have to straighten this up real quick\nGive me that microphone and get lost\nWho's taking over? the female mob boss\nI'm strolling on punks like they ain't shit\nCuz I'm legit, and down with the Syndicate\nBut this is a Comptown hit, so it's public (Ruthless)\nAnd thinking you can get with this is useless\nI'm Tairrie B, I got this one for a purpose\nSuckas trying to step because they see what's on the surface\nBut I'll pull your card, then we'll see who's got the hardest\nIt's not the color, it's the heart of the artist\nAnd you can't ignore the woman who will roar\nSo look more close, notice the hardcore (hardcore)\nStyle, scope the dope profile\nListen a while, child, it's all compiled\nLike a text, and the next to flex will get waxed\nIt ain't nothing but a pile of melted tracks\nSchoolly, break it on down from the east coast\nAnd let's stone cold toast\n\n[Break]\n\n[Verse 2]\n\n[Tairrie B]\nNow Schoolly's got the music and me, I got the lyrical\nEazy's by my side, making sure that the spirit goes\nInto the show, and so the whole thing kicks\nEcho Sound is where we mix\n\n[Eazy-E]\nEazy-E's on the set and I'm removing all doubt\nThat a Ruthless bitch has just stepped out\n[A Comptowner to the open?] that she's gulpin'\nAll the boyz in the hood...\n\n[Tairrie B]\n...and they go hopin'\nThey can get with me, like when you saw my cover\nAnd stepped up to me trying to be my lover\nBut that ain't happening, yo, cuz I ain't with it\nYou tried to play the [declawed stay a minute?]\nThis style is so wild, boy you can't handle it\nAnd if you try, I don't need a man to get\nStupid for me, I'll do just fine on my own\nGimme a microphone\nAnd I'll rip up the system, steal the show\nA girl gets out of hand and I'll smack the ho\nSo for those who thought I couldn't do this\n(Yo Tairrie) What? (Show them who's Ruthless)\n\n[Break]\n\n[Verse 3]\n\n[Tairrie B]\nNow the cap I wear reads Comptown on it\nY'all can't read or something, shit\nSo a brother steps up talking all kinda junk\n(Bitch, you ain't from Compton)\n\n[Eazy-E]\nShut the fuck up, punk!\nAnd pay your respects to the queen of Comptown\n\n[Tairrie B]\nPunks talking junk are the punks I stomp down\nHeel to toe, in steel-toed boots\nPlatinum blonde with Italian roots\nClever with rhyming, forever like diamonds\nYou sleep while I creep so I keep climbing\nHigher, objective: your desire\nAlways draped in the flyest attire\nDamage is done and you can bet that I did it\nWith finesse, in a dress that's perfectly fitted\nWhen I juice my hitlist, they can't get with this\nFemale caucasian, can I get a witness? (Yeah!)\nI know you heard it before, I won't bore ya:\nYo Compton? Am I white and I throw ya?\n\n[Spoken]\nYo Eazy\n(What's up Tairrie?)\nYo everybody thinks that I'm rocking you and that's why I got a record deal\n(Fuck naw, she won't even give me the pussy)\n(Word)"}], "artist": "Tairrie B"}