{"songs": [{"image": "https://images.genius.com/46246a8ab5cb3dd15477ef4a9e77c90b.1000x1000x1.jpg", "album": "Game Over - EP", "title": "How I Met My Ex", "lyrics": "[Verse 1]\nLike\nI met my girl when I was 18 years old\nAnd she was just turning 23\nI really love her from my heart\nAnd even though I don't deserve it fam I hope she loves me\nSo I just done this private show I'm doing Footlocker promo\nAnd judging from the postcode it was Shoreditch or Soho\nDid 6 or 7 tracks, made 6 or 7 racks\nA couple days later on twitter I saw this photo of myself and I was grinning\nThat 4K camera of quality had got me tripping\nSo I'm checking out who did it\nWhen I stumbled on this girl\nAnd I could tell that she was different\nA couple hours later now I'm liking all her pictures\nI ain't finished\nI typed her twitter name into my Insta so I could check on every single little digit\nWhy didn't I just message her?\nTrust me I was thinking, but I'm a self-centred rapper too concerned about my image\nThe truth\nSo when she hit me first I'm pretty shocked I didn't burst\nI'm calling Josh, Jack and Juss who am I ringing first?\nMan I was so excited\nThat I replied a minute later that's that bro I think that you just let her know excited\nToo excited, no clue on what I should do excited\nSo I'm just typing, rambling like a fool, excited\n\n[Verse 2]\nLook\nLook\nAnd we were talking for hours over some minor things\nIgnoring everyone else to her I'm replying quick\nThis type of chick she got a spark like you were lighting spliffs\nYou know you like her when you're thinking about your words\nShe got me typing, deleting my messages then re-writing\nIn the hope that there's a smile when she's replying\nThe highlight of my day, them phone calls in the night, it's the little things\nThe girl, she had a vibe and I liked it and\nShe's into photography and she's got a passion for it\nAnd she respects that I'm rapping but she ain't catting for it\nSee that's the perfect balance\nThere's nothing better than a girl with talent\nDrive, ambition, all of them things above\nShe's showing an abundance\nI ain't even met her yet\nShe works around the corner but lives just outside of London\nI ain't fronting, I'm a sweet boy\nIntentions are in question so my compliments are decoys\nIf that even makes sense?\nThe first time I met her, I'm surrounded by my friends\nRandom ends on some staircase\nSo much for a first date\nI just had a show\nAnd I asked if she could meet me after\nMaybe we could chill, you never know where things could go\nNo problem she down to roll\nTravelled in the cold\nSo I went across the road, grey hoodie under a coat\nIf I'm remembering correctly\nIt's always kind of weird when the person that you were texting\nIs the person you are obsessed with\nI was on her from the jump\nI think she was wearing pumps or Vans when I first met her, no, it's either either one\nShe was looking so attractive I barely saw skin 'cause she was covered like a mattress\nMan, I think that she's the one\nI was stuck for twenty seconds tryna to give the girl a hug\nAnd all my friends are drunk so fuck it, I'm about to kiss her\nAny complications, I'm blaming it on the liquor\nChanging my name on Twitter and blocking her on my Insta\nI saw her skin blush the moment that our lips touched\nShe pulled my bottom lip until it stretched\nKissed me on my cheek until she reached around my neck\nAnd had me moaning like a bitch\nEven though I'm wearing jeans, I had to re-arrange my dick so she don't see that I'm erect\nIt's the first time we met, got me feeling like a creep\nAnd that strawberry flavour gave her tongue a kinda sweet little taste\nAnd we could speak about anything we were friends first\nI dropped her to the station I remember\n'Cause we had a conversation for ages about our dreams\nAnd the things that we hadn't seen and all that we intended to do\nI bet she's hoping my intentions are true\nAnd as months went by we both got into it, and intimate\nAnd I'ma spare you the details 'cause both of our parents are probably listening\nBut really we were into it\nInto us, into this\nInto everything about each other we were lovers and I love her 'cause she knows me and that's probably why she told me you ain't ready for a girl\nYou're still a little kid that's getting ready for the world and you don't need that kinda burden\nBut I told her that I want it\nAnd I'm just being honest, yes I know that girls exist but I don't see them as a problem\nI meant every single word\nAnd I ain't gonna lie and say DM's have been absurd but out of every single girl\nThis is the weirdest of positions\nIt's usually the girl that's asking where I see her fitting or a place on her position\nBut I'm telling her I need it\nAnd I don't think she sees it, so I'm being even sweeter when we're speaking and we're meeting\nI've got affectionate messages, you could read them\nYou gotta tell a girl that she's beautiful 'til she sees it\nBelieves it, understands it more than physically\nMentally, and the way that I'm feeling\nI could talk for 10 years about the moments that we shared\nThe jokes that we had running\nThe places that we've been\nThe music we made together producing next to my bed\nThen making my minor changes in reference to what she said\nI think I start to getting tired, my schedule's a mess\nReplies are gettin' lazy and my lady knows it's crazy\nBut she's there if I'm in need\nWhile I'm at shows getting tempted by girls that are on their knees\nYou know I'm only a teen, it's like my eyes started drifting\nNot as easy as I pictured to give your all to a woman\nIgnoring all this attention that's been getting to my head\nThe sex is so accessible, one message or text and girls will get in your bed\nShe's tryna make it happen with photos at her events\nI mentioned it's her passion, photography is her thing\nAnd I don't know if it's the pressure\nWhere paper meets the passion and the pleasure\nWe've all gotta work to survive\nSo now she's popping up at shows\nTaking pictures on her own\nAnd at first it wasn't cool\nBut fuck it we let it go\nUntil I saw her in some rapper's tracksuit, I felt a way\nShe told me it was work and she was in some studio\nTaking pictures and I just sighed\nSome halfway wannabe rappers that fed her lies\nThey ain't looking for no picture\nI know it's your profession\nBut read their intentions\nThey ain't paying male photographers to shoot that same session\nAnd that felt so disrespectful, standing on our dreams\nAnd crushing 'em, I just told her it's nothing do what you need to do\nIf I ain't feeding you\nThen my opinion's all I'm giving when I speak to you\n'Cause I don't have the right\nWhy should girls be punished for a male's dirty mind?\nWhen I think about it now, I'm ashamed to the core\nI mean how many men stop their women from achieving what they can because in secret they've been feeling insecure\nAnd I can't handle my emotions, it's probably why I didn't see her\nTalent when I shoulda been supporting and promoting\nLike I didn't have a platform, a voice and a following\nWith everyone I knew, I really coulda done a lot of things to help chase her dream\nBut instead of me to grow into the person that she needs\nI acted like I couldn't see\nAnd I don't mean to say this like I don't trust the girl\nBut how can I trust her if I don't trust myself?\nAnd even girls can get tempted you know how it goes\nWhat if she meets a bigger rapper when she's at a show?\nWhat if he sees her backstage?\nWhat if he selling lots?\nWhat if he's got a bigger car, got a better watch?\nThat doesn't bother me, she really ain't material\nIt's all the little things they do that put the fear in you\nWhat if he actually replies?\nWhat if he phones her too?\nWhat if he's doing all the things that I'm supposed to do?\nWhat if he's listening, laughing, relating?\nWhat if he even cares to ask her how her day's been?\nWhat if he's trying to give her everything she needs and expects from the one damn person that she's dating?\nI shoulda helped her follow her dream\nBut instead I held her back and had her following me\nAnd boys got a brave face so they'll never know\nThat it hurts just as much when you let them go", "year": "2017-11-03"}], "artist": "Dave"}