{"songs": [{"image": "https://images.genius.com/a7e990f0bc468cba699c9556d1af08e8.999x999x1.jpg", "lyrics": "[Intro: (Sample),  U-God]\n(It is my job to protect society from a person like this. There's two kinds of criminals, one we're mad at, and one we're afraid of. We gotta do the best we can with the criminals we're mad at but the ones we're afraid of, we gotta put them in prison)\nLadies and gentlemen, I'd like to introduce you to Mr. 92A3131\nFrom Bare Hill Correctional Facility, and I'm a\n[Verse 1: U-God]\nPretty good felon with two counts on\nOne hand gun smoking on trees with three ounces\nCaught in my possession\nBeen a bit aggressive, since my adolescence, expelled from pre-school\nI'm on a mission, cause hard heads never learn a lesson\nWith two fire arms headed back to corrections\nI'm in a jam, need that one call to fam\nAnd I'm grinding my teeth as the cell door slams\nCome over at seven now meet the new man\nTouchdown on the streets with a modified plan\nAnd I only been home for four weeks\nConnected with the block again\nNow i'm knocked again, damn\n\n[Hook: U-God]\nI'm a felon, walking these streets\nI can't breathe, in the eyes of the law and the D's\nI'm a felon, walking these streets\nI can't breathe\nI'm a felon\n\n[Verse 2: U-God]\nUp in the cubicle surrounded by criminals\nPerpetuate bullshit, remind me of the juveniles\nBoxed in, counting to the 23rd hour\nWith 7 musty niggas in line for the shower\nFeel my frustration?\nI'm in a fucked up situation\nFrom blowing up trees on probation\nAnd my record just dropped\nYou can hear it on the E block, on regular rotation\nUse imagination\nTurn the clock back, should of never moved packs\nShoulda never trust my ex, she talks on the jack\nWho's in kahoots with black who stabs me in the back\nFor a little .22 and a handful of crack\nOn a quest for Rolls Royces you can make the wrong choices\nSecond strike, front of judge, don't be voiceless\nSentence you to halfway house, halfway out\nLooking for a job and a nice shirt\nConstantly reminded\n\n[Hook: U-God]\nI'm a felon, walking these streets\nI can't breathe, in the eyes of the law and the D's\nI'm a felon, walking these streets\nI can't breathe\nI'm a felon x5", "title": "Felon", "year": "2018-03-30", "album": "Venom"}], "artist": "U-God"}