{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/MV5BMTY0MDY3MjQxN15BMl5BanBnXkFtZTcwODQ2NzE1NA@@._V1._SY314_CR11,0,214,314_.jpg", "title": "Divorce Papers (Freestyle)", "album": null, "year": "2016-06-16", "lyrics": "[Intro]\nUhh, guess I got to talk about it\nYea, alright\n\n[Verse]\nDivorce papers, my lawyer said \"don't say shit\"\nGoldman gon' be mad, Nina gon' be heated\nThey havin' private meetings saying \"Nick is going crazy\"\nHe out here wearing turbans, next he tryna battle Jay Z\nHaters in my comments sayin' \"Eminem the greatest\"\nShit, I agree - where he at, doe?\nI'm a fan yo, but first and foremost\nI'm a man though, that 2010 bullshit\nNigga been let that go, Stan flow\n\"Dear Slim, I wrote you but you still ain't call\nTea's goin' cold, the writing's on the wall\"\nBut dog, there's certain shit I can't stand for\nSo all the Stans gotta understand though, damn\nEm, right now I could really relate to him\nDrug habits, all the pain that he was in\nSeein' foul shit when you don't know\nWhere your baby mama been\nIronically, I felt the same way about a chick named Kim\nSince we got a lot in common\nMaybe he could recommend some rehab for me\n'Member when the fan's was glad for me\nNow they wanna bag, talk shit, and dab on me\nThey don't realize my pop just died, damn, homie\nThis my real life, I almost died twice myself\nBut fuck my health, y'all felt I kept this shit held up\nOver some motherfucking alimony?\nNow who phony?\nWhen y'all need help, y'all call me\nWhen I need help, y'all call TMZ\nY'all believe everything that y'all see\nMaaan, even the niggas who can't read\nHate is a disease\nAnd now I'm in the streets tryna make this track the vaccine\nMy Dad said next time that I need to find a black queen\nHe don't understand that she was already that\nI feel trapped, queen - where Fetty at?\nCause right now, I could really use some rémy\nAnd I don't even drink, but this truth serum's in me\nWhen Drake was Jimmy, mill-i-ons I had twenty\nOlder women I had plenty, but from the outside\nY'all thought I was just silly\nI first tried to holla when Usher was with Chilli\nWe could've made a killin'!\nIf Kanye feel like Pablo, I feel like Ike\nTurn up? I just might\nWhen the world hate you because of what she sing about\nI should've listened to y'all tips - bring 'em out\nWhat happened to the rings? Did she fling 'em out?\nDo she trip when she see me with a new 'ting around?\nWe single now, but we really need to think about\nIs how a child deals, how a child feels\nBecause we got two and they brilliant for real\nResilient for real\nMy daughter said \"Daddy why yo' eyes in tears?\"\n\"Because the last time I dropped you and your brother off\nI didn't get a call next day and it felt like years\nAnd I'ma be honest sometimes I hate to hear\nY'all on the other line havin' fun without me\"\nI wonder if my son will ever doubt me\nCause what the press write about me\nI done lost faith in everybody\nWhat's love? I don't care about it\nI just want my kids to be safe, there you got it\nNow y'all happy? Hope she happy. Know she happy\nPaparazzi snappin', fuck 'em all cause they see my sadness\nAnd just walk it off, I guess I'm the dog\nThat caused it all, it's what the rags wrote\nY'all never know, cause I'll never talk\nIf I speak, only spiritual gifts about my dream girl\nWas blessed to make miracles with\nAnd I'ma lay it on thick, like that miracle chick\nWatt's up, shots out to the southeast Nick\nWhether poetry or Wild 'N Out my mouthpiece sick\nAnd I'm about to spit it out, like Steph in the clutch\nBeen a warrior with mine\nYou niggas just wasn't steppin' it up\nYou boys was too cavalier, Kevin Lovin' it up\nAnd now I can't see my kids cause the government suck\nRepublicans cheer when the black families split up\nBefore? \"No child support,\"black daddy good luck!\"\nRoc' shaking me awake, like \"Daddy get up!\nAre you woke? Are you woke?\nAre you broke? Are you broke?\nI don't know, either way, Daddy we gotta go!\"\nIt's been over two years and I'm the one that's been waitin'\nIt's fucked up that the time that you spend with your own kids\nIs called \"visitation\"\nMan, fuck it let's sign these papers\n[throws headphones]"}], "artist": "Nick Cannon"}