{"artist": "C-Rayz Walz", "songs": [{"title": "Say Werd", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/566d299c2471c83ab1595731e9242047.1000x1000x1.jpg", "lyrics": "C-Rayz Walz - “Say Werd”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): Emile Haynie]\n\n[Intro: C-Rayz Walz]\nHow arrogant is the Solar motorist?  C-Rayz Walz\n\n[Hook: C-Rayz Walz]\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better (Come on)\nSay, “Word.” (Word)  Say, “Letter”\nSay, “Unite.”  Say I’m better\n\n[Verse 1: C-Rayz Walz]\nThe mind-meddling flows define head and it shows you not\nFresh like a Bill Cosby sweater with holes.  Half-\n-ass, you wack on a whole, quick to fold\nUnder pressure like women in the laundry, surrounded by clothes.  You know\nA blind man will see more success than you.  Your thoughts\nBoil and turn your brain vegetable.  Your\nMind stews.  You’ll simmer down, but soon\nYou’ll get stabbed in the dome with a spoon, you stupid souphead\nWhat’s cooking?  Looking pretty kooky in here\nTrying to be my friend and buy me beer?  Get the fuck out of here.  Don’t you\nKnow the challenge of my talented flows give me enough\nSkills to play the piano with my toes? (Did you know?)\nMy symmetry is of scientifical slaughter, attacking\nYour nerve endings in alphabetical order like\nBefore the Ice Age, I’ve been cool, playing bas-\n-ketball with your girl like, “Whoo!  Watch the spin move”\n\n[Hook: C-Rayz Walz]\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better\n\n[Verse 2: C-Rayz Walz]\nNo pressure.  Fresh forever, clever with the best of lines, set\nTo stand the test of time—all-terrain, all-weather.  My last\nRaps/Wraps stacked as a mummy uniform.  The last unicorn\nWriting cuneiform scribes in my human form.  I\nCatch wreck like the J room, bless the door.  I’ll kill it\nB.  You see my energy swarm?  You feeling C?  Say\n“Word,” speak paragraph, make the average crash, driving them-\n-selves crazy on a narrative path.  Circle\nCircle, dot, dot.  Hip hop immune to wackness, sounds\nTight like Abercrombie & Fitch on black kids.  Half\nPast the monkey’s ass, a quarter to the twenty-fives and juice\nFrom penny candy to a Pennywise suit.  This is\nIt!  Disturb the lie.  You heard the vibe.  Now feel the\nTruth as proof and pressure the mind\nThe pen and pendulum, sword and strategy\nI pity the fool who would choose to battle me\n\n[Hook: C-Rayz Walz]\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better (Come on)\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better\n\n[Verse 3: C-Rayz Walz]\nI’m the\nMeaning of raw spitting—you’ve never seen glass.  You went\nTo SEGA Dreamcast for an audition.  Listen, the thoughts\nI think could make your shrink crippled.  I can smell\nWater, I’ll see the color of tickle—(Word?)—red, yellow\nPurple, intellect, fiery breathe, spiritual\nRehearsal.  Physical commercial’s death.  Oh\nWhat a tangled web we weave when you thought God\nBlessed you only when you sneezed—indeed, my school’s\nOn the roof to upgrade my education.  Like Ramon\nScheming on tracks at the nearest station, roaming\nThe bling is ringing in itself, so when the ring start\nBlinging, you’ll think it’s something else—then I’m felt.  The sce-\n-nario: my life’s story on a popup video.  On some\nRun-D.M.C. shit, yelling \"Here We Go.”  And it’s\nNot you, so believe it’s me, one of the\nSickest emcees since Eazy-E\n\n[Hook: C-Rayz Walz]\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better\nSay, “Word.”  Say, “Letter”\nSay, “Unite.”  Say I’m better"}]}