{"songs": [{"lyrics": "[Intro]\nPut you on some game then sis!\nPut you on some game then sis\nPut sis on some game!\nFuck they talking about?\n\n[Hook]\nGame!\nAye, what you need lil' bitch?\nAye, let me put you on some game then sis\nI'm tryna warn you, it's the same ol' shit\nDon't never settle, press the metal, we ain't stressing dick game\nMy momma told me about a lame\nDon't build no nigga up, they want you cause your fame\nKnow the game!\nPlay your cards in different lanes\nDon't never settle, press the metal, we ain't stressing dick game\n\n[Verse 1]\nGame!\nHe fine, but most these niggas goofy\nHe be texting, talking stupid, asking about a movie\nYou can't fool me, you just wanna swim in my jacuzzi\nI got standards, I'ma pretty bitch but tote a Uzi\nMake a nigga wish that I was on the tongue he chewing\nCheat on me, that's so impossible, no feelings for 'em\nWork a nigga like a slave, get on your knees, I'm master\nI dropped a rapper for a trapper, cause that money faster\nAll that love don't mean a thing, I don't indulge in that\nYou broke, competing with a bitch who ain't run up a sack\nYeah they gossip, diamonds glossy when I smile and laugh\nGet some money, be a hundred, and your diamonds last\n\n[Hook]\nGame!\nAye, what you need lil' bitch?\nAye, let me put you on some game then sis\nI'm tryna warn you, it's the same ol' shit\nDon't never settle, press the metal, we ain't stressing dick game\nMy momma told me about a lame\nDon't build no nigga up, they want you cause your fame\nKnow the game!\nPlay your cards in different lanes\nDon't never settle, press the metal, we ain't stressing dick game\n\n[Verse 2]\nRule number one, cut a fuck nigga\nTreat him goofy, watch his homies wanna kick it with you\nTake a picture in the restroom with his wife-beaters\nPost it on the gram and caption, \"I'm a night creeper\"\nI'ma break a nigga heart, you blocked can't call my phone\nBitches tryna intervene where they just don't belong\nI can read between the lines, you think I'm stupid, wrong\nGet some head before he fuck, so he can't tell it long\nAnd I hate that baby mama drama, I'm a victim\nI got some sisters that's so willingly to catch attempting\nYou in my business, for a reason, stalking like a witness\nI'm so worried about my riches, guess I'm moving different\n\n[Hook]\nGame!\nAye, what you need lil' bitch?\nAye, let me put you on some game then sis\nI'm tryna warn you, it's the same ol' shit\nDon't never settle, press the metal, we ain't stressing dick game\nMy momma told me about a lame\nDon't build no nigga up, they want you cause your fame\nKnow the game!\nPlay your cards in different lanes\nDon't never settle, press the metal, we ain't stressing dick game", "album": "Kill Bill, Vol. 1", "year": "2017-08-07", "title": "Game", "image": "https://images.genius.com/242d147a1183c0874d40583e179e55e9.600x600x1.jpg"}], "artist": "Asian Da Brat"}