{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/fe0e5fcb271015d104eee0afa7b66778.750x531x1.jpg", "title": "Concert Rant on 2016 election, Beyonce, Jay-Z", "lyrics": "[Kanye]\nI know it's gon' be a lotta conversation after tonight. Khaled, I love you, I know you got killers in Miami, please do not send 'em at my head, I just wanna have a conversation about how you playing radio's game. Khaled, you a real nigga. Khaled, you a real nigga, you got the keys. But as we learn all the politics, and niggas was doing for years, Obama couldn't make America great, because he couldn't be him, to be who he was.\nBlack men have been slaves, Obama wasn't allowed to do this, *screech*, and still win. He had to be perfect, but being perfect don't always change shit bro. Being perfect don't always change shit bro.\nSo when I'm talking about MTV -- Let me explain something. I was hurt. Beyonce, I was hurt because I wanted to present a video called \"Famous\", and out of respect, MTV told me \"Mr. West, I don't respect you. I will let you know that Beyonce is winning the video tonight, for formation, over Hotline Bling and Famous.\" They told me beforehand so I wouldn't run on stage. Ay bruh, y'all ain't gotta fuck with me, but you know I got the vision, and you know I'mma keep it real with you.\nBeyonce, I was hurt, I went down 7 years on behalf of yo --\nAy nigga, don't throw no shit when I'm talkin'!\nI am putting my career, my life, my public well standing, at risk when I talk to y'all like this. This is the moment in the Matrix, bro, the [?] is back! The [?] is back!\nMotherfuckers might feel a way about this tonight. Beyonce, I was hurt, 'cause I heard that you said you wouldn't perform unless you won Video Of The Year over ME, and over Hotline Bling.  In my opinion -- Now don't go trying to diss Beyonce. She is great. Taylor Swift is great. We are all great people. We are all equal. But sometimes, we be playing the politics too much, and forgetting who we are, just to win. Fuck winning. Fuck looking cool. Fuck looking cool. Fuck being cool. Fuck all that, bruh!\nI been sitting here, to give y'all my truth, even at the risk of my own life. Even at the risk of my own success. My own career. I been sitting here, to give y'all the truth. JAY Z, call me bruh. You still ain't called me!\nJAY Z call me, Ay bruh, I know you got killers, don't send 'em at my head! Just call me! Talk to me like a man.\nI'm trying to be THE man, I just am A man. The same as everybody in here. I ain't above, below, none of y'all. We all equal. We all equal. These are the vibes, bro. This is the future. This is the way of thinking to Make America Great Again. Hahaha, ayo, you like that. Guess what? Guess what? Y'all need the vibes. I was hurt, feelings matter. The way motherfuckers put money up so high, popularity, radio spins, feelings matter bruh. Feelings matter bruh. It's a new world, Hillary Clinton. It's a new world. Feelings matter. 'Cause guess what? Everybody in middle-America felt a way, and they showed you how they felt. Feelings matter, bruh. It's a new world. It's a new world, Barrack. It's a new world, JAY Z. Ay, don't send killers at my head, this ain't the Malcom X movie, we growing from that moment. Let 'Ye be 'Ye. Oh wait a second, do y'all agree with that? Let 'Ye be 'Ye! Wait a second, I ain't hearing no screams on that. Let 'Ye be 'Ye. People, I'm not saying this out of my own well being, because it wouldn't be smart out of my own well being to say things like this. Radio, I done talked to you a bunch of motherfucking times. Y'all motherfuckers is behind the times. Because guess what? The Saint Pablo tour is the most relevant shit happening."}], "artist": "Kanye West"}