{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro]\nMy Spider senses is tingling\nFeel something, got my radars up\n\n[Verse 1]\nSomething going on, I feel funny\nCan't tell me nothin' different, my nose twitchin'\nIntuition setting in like Steve vision\nI still close my eyes, I still see visions\nStill hear that voice in the back of my mind\nSo what I do? I still take heed, I still listen\nI still paint that perfect picture, I still shine bright like a prism\nMy words still skippin' through air\nI know you can't, don't, won't get it\nYou niggas chose to ride that ship, sunk with it\nI'm still afloat, I ain't the captain of the yacht\nBut I'm on the boat\nI ain't acting what I'm not knowing that I don't\nYou niggas acting like you will, but I know you won't\nI read between the lines of your eyes to your brows\nYour handshake ain't matching your smile\nAh-ah, you niggas foul\n\n[Hook]\nI can feel it in the air\nI can feel it in the air\nI can feel it in the air\nI can hear it in your voice\nI can feel it in the air\n\n[Verse 2]\nI sit alone in my four-cornered room staring at hammers\nReady to go bananas\nTwo vests on me, two TEC's, extra clips on me\nI know my mind ain't playing tricks on me\nI ain't skitz, homie. Ain't no body drop a nick on me\nIt's like they trying to plot a set on me\nI hear this voice in the back of my mind\nLike mack tighten up your circle before they hurt you\nRead they body language\n85 percent communication non-verbal\n85 percent swear they know you\nTen percent, you know they story\nMan, the other five, time'll show you, just know you\nThen pull they strings, you the puppet master\nFuck them other bastards, man, watch who you puffin' after\nPlay your cards, go against all odds\nShoot for the moon, if you miss you still amongst those stars\n\n[Hook]\nI can feel it in the air\nI can feel it in the air\nI can feel it in the air\nI can hear it in your voice\nI can feel it in the air\n\n[Verse 3]\nCan you feel it, can you feel it floating?\nWithout picture quoting, scriptures from Revelation\nTalk shit and got the devil waiting, body get stiff, so levitate\nWhy do I speak blasphemy\nKnowing one day that he'll ask for me?\nAsk for my sins, no one'll feel his wrath for me\nI go through it, so you wouldn't do it after me\nAs for me, I'm still circling the block before I'm parkin'\nNot bitching, I'm just still cautious\nSame black parka, same Uzi, extra clips\nStill clapping with that same larking\nDamn, I feel it in the air, you not sincere\nNigga, it ain't an us or we or I'ma thing\nIt's a good/bad karma thing\nThis a song man of honor sing\nI swear I feel something honestly\n\n[Hook]\nI can feel it in the air\nI can feel it in the air\nI can feel it in the air\nI can hear it in your voice\nI can feel it in the air", "image": "https://images.genius.com/48c4319dfc3c978405c6c446d03d8171.500x500x1.jpg", "year": "2005-03-29", "title": "Feel it in the Air", "album": "The B. Coming"}]}