{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "My Big Chance", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "TARIQ: Yo, I-I’ll take two, yo\n\nCRAZY LOU: Ah, fine choice. Powerful yet lightweight. And it hides well in your anal or crotch area. That’s right, including your butt pockets\n\nTRU: Yeah, yeah, that’ll work! Yo, put it on my tab\n\nCRAZY LOU: ‘Kay! Gotcha. Well, fellas, enjoy, and please come again. Don’t tell nobody in the projects\n\n[*door closes*]\n\n[*sirens and crowd noise*]\n\nTRU: Okay, next stop: East New York. We gon’ make you official\n\nTARIQ: Official?\n\nTRU: Yeah! Mr. Large!\n\n[*horror movie synth stabs*]\n\nTARIQ (NARRATION): Now, Mr. Large was the biggest dealer on the east coast. Multi-, multi-billionaire. Nobody fucked with him, not even the FBI. I heard even the President was on his payroll. Kept a tight-knit crew, dealing from drugs to prostitution, loan sharking, gambling, nuclear weapons, rap management… You name it, they did it. And now it was my big chance to be a part of the squad\n\n[*door knock*]\n\nTARIQ: Yo, you think it’s cool for me to be up here with you?\n\nTRU: Yo, chill, these guys love me. We like family. Plus, you with me! It’s all good!\n\nBREAKNECK: Yo, Tru! Come on in. I seen you on the camera, yo. What’s— What’s up? Who ya man, though?\n\nTRU: Yo, this my boy, Tariq. Came to see Mr. Large, make him official. Yo, he’s good peeps. We like brothers\n\nBREAKNECK: Aight, yo, just let me pat him down. You know the stee\n\n[*patdown noises*]\n\nTRU: Ayo, yo, yo, Tariq, this my man, Breakneck\n\nTARIQ: Yeah, what’s up?\n\nBREAKNECK: Yo, before you meet the boss, let me introduce you to the fellas. Yo, fellas!\n\nCREW MEMBER #1: Yo, son, what up?\n\nBREAKNECK: Yo, this is Tariq, Tru’s brother. He’s becoming official today\n\nVARIOUS CREW MEMBERS: What up? Hey! What up fam? No doubt, no doubt\n\nBREAKNECK: Yo, Tariq, this is our Street Crime division. They keep law and order in the streets. Yo, better yet, I’ma let them introduce themselves", "year": "1999-02-23"}]}