{"songs": [{"title": "Would You Believe That", "album": "Hump Days", "year": "2014-10-22", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nL.D\nA.K.A. The Long Winded Answer\n(The number one on the charts!)\n\n[Verse 1: Lil Dicky]\nTwo truths and a lie: I've tried beans, I like wings, I'll die king\nTwo truths and a lie: I'm not gay, I've tried yay, it's my day\nTwo truths and a lie: I might go write a TV show and chill\nI might be up for a nine figure deal\nI used to wonder if Santa was real\nWould you believe that? Would you believe that shit?\nWhat would you believe?\nWe could start with the rap, flowing like malls like 'oh there's a Gap'\nGo on my call logs, dogs wanna chat\nBig dogs, missed calls\nLot of motherfuckers in the league no L\nJust had brunch with Embiid and Noel\nJust got sucked and was fucked by a dumb slut\nUsually I like 'em Ivy League, oh well\nSummer camp I been going ham I was a young man with that chopper\nThat’s rifelry, yeah I like movies, I’m going H.A.M. for that Oscar\nI'm way far on they radar like they know I'm coming that's Doppler\nThey boring to me that's Opera, I'm scoring beauties that's soccer\nMe and Jonah Hill smoke, then we talking shit bout how the rest of y'all blow\nThen we take a dip up in his pool, pretty cool\nNot the pool, shit is hot\nJust a view from a spot, shit is hot\nBunch of blonde bitches laughing all night\nAnd me and Busta Rhymes meet in Venice for a bite\nTalking shit about a comedy singer, shit is so light he tell me\nI can't disagree, get it right he tell me, I mean\nI thought by now he can see that I'm witty\nDown in L.A. I been running the city\nAsk anybody in music or film who got next in this bitch and they all saying Dicky\nI just do it like it's nothing to it\nLife getting pretty sweet like I fondue it\nI'm killing bitches in my lane on some T. Stewart\nAnd I've been sworn [?] yeah the time blew it\nFunner than summer, I hooked up with Summer\nHomies are callin' cause I got her number\nI'm so unencumbered I'm 'bout to do numbers\nMuhammad Ali told me rumble di rumble\nThat man is so nice\nLet that man listen like damn that boy nice\nKanye just listened like \"Hol' up, he white?\"\nI'm taking over the game let me just fund my shit for a minute damn\n\n[Chorus: Lil Dicky]\nWould you believe that? Would you believe that shit?\nWould you believe that? Would you believe that shit?\nWould you believe that? Would you believe that shit?\nWould you believe that? What would you believe?\n\n[Verse 2: Michael Christmas]\nWe at the motel, hotel, Holiday Inn\nWhy don't you come through and bring some of your friends?\nWe in the [?] sipping some Henny\nIt's just the Snoop Dogg Ginny\nNo more dapping? Oh what happened?\nOh he snapping, oh I know\nI heard all about them features what you think he paid for those?\nI hate rapping cause what happened is you niggas turn like hoes\nThey chase me like Barry Sanders they not pass like Morino, aye\nHappy Gilmore, Mr. Deeds, Big Daddy, silver screen\nI'm a Jewish G\nHold hoes of the hostesses that [?] at shows\nI leave the backstage like the roasting I'm like Charlie Sheen\nShow me my opponent\nShow me my opponent\nMiddle class America (America!)\nImma joint for my enjoyment\nI need X amount of dollars, uber X amount of dollars\nI need Hendrix on my dollars\nThree Six Mafia bought my collar\nPlay Mancala with the guala\nDrop some more inside my pocket first\nCausing [?] payment they get drove in a Versace hearse\n\n[Chorus: Lil Dicky]\nWould you believe that? Would you believe that shit?\nWould you believe that? Would you believe that shit?\nWould you believe that? Would you believe that shit?\nWould you believe that? What would you believe?\n\n[Verse 3: Rockie Fresh & Lil Dicky]\nMan live what you want, I come through the [?] and do what you don't\nEvery moment, I kill all opponents\nMy team is some winners, never beginners\nI eat 'em for dinner (mmm y'all good!)\nCold like December (that's pretty cold!)\nI come through the trap (I'll sit that one out)\nNiggas know it's a wrap (it's done, like, why y'all here?)\nBitches gon' clap I come through and my niggas gon' slap\nI'm known on the map (all over the place)\nFrom London to Chi Town (where else?)\nYou know how we ride 'round (what else?)\nYeah\nYour bitch she get tied down (she could)\nMe and [?] in L.A. (me too)\nAnd we smoking that Laker (that's weed)\nYou mad you a hater (fuck you)\nI'm chasing that paper (yes)\nI got [?] (ha ha)\nYour bitch from nowhere (small town bitch)\nBut she think she a star (she ain't shit)\nYes we know who you are (I see you faggot)\nYou a nobody ([You in consequential])\nAnd you know probably (get self-aware)\nHow I come shawty ([?])\nI'm the big dog, [?], I been through it I got a movement (same here)\nRunning through like a truant (fuck school)\nIt's obvious (extremely clear)\nNiggas can't rap with us (never)\nThis paper be coming quick (so fast)\nYou know that I'm running shit (yes)\nI wish you would (I wish you would say something!)\nI'm a lumberjack, how you front on that? (how?)\nRockie, I stunt on that\nCome through, make a hundred racks\nIced out Rollie, take a pass it to my homie\n\n[Outro: Lil Dicky]\nWe pass Rollies around here man\nFuck passing joints\nWe passing Rolexes 'round this bitch\nFuck a blunt\nWould you believe that?\nWould you believe that shit?"}], "artist": "Lil Dicky"}