{"artist": "9th Prince", "songs": [{"album": "Granddaddy Flow", "lyrics": "[Intro: P.R. Terrorist]\nRevenge of the Iron Fingers\n9th Prince, Terrorist shit, nigga\nCheck it yo yeah yo yeah yo yo\n\n[Chorus x2: P.R. Terrorist]\nWe keep it real, hold steel, grab ya sword and ya shield\nTerrorist and 9th Prince it's either kill or be killed\n\n[9th Prince]\nYo we train snatchers, capture fifty-seven passengers\nIt's the last chapter, the underworld scavengers\nThuggish dark shadows, stick and move like Apollo\nMass test the acid they swallow, born to be street desperados\nLike Castalano, these niggas is wicked like the witches of Eastwick\nDirty referee sick shit, kill or be killed is the topic\nThen I'll be a serial killer, hidden murder scriptures\nFor the armageddon mafia, Stapleton shell shockers\nSaddam and Terrorist, we tag teams like the midnight rockers\nPut you in a wrestling move, kill ya crew\n9th Prince is raveshing like Rick Ru'\nI attack the Billboard like Hurricane George (yeah)\nNiggas is microphone frauds (yo)\nThe death wish: kill the rest of the foreign lords\n(yo yo yo)\n\n[Chorus x2]\n\n[P.R. Terrorist]\nHigh street vocalist, get a toke on this\nTry and wrestle with the bulk of this, you just provokin' this\nTerrorist when pissed is like The Exorcist\nMake you slit ya wrist, choose ya death wish, let me insist\nIn the procedure, the only language is thru ya speaker\nMy tongue is fire, breath is the flame, lyrics are ether\nBuild boy, heat seeker, blow the shit out ya tweeter\nIn the lab constructin' rhymes to put ya ass in the sleeper\nGrab my millimeter, call me a cheater, ya easy bleeder\nTerrorist and 9th Prince is the underground leaders\nLyrics for days, splittin' my current seven ways\nRest in the PJ's, countin' my grays, I'm goin craz'\nI pulled the budget, these record execs is fuckin' sufferin'\nGive me a couple mil' by the year 2G just off my publishin'\nRecords are bubblin', my team is strugglin'\nDon't forget, kill or be killed, the album comin'\n\n[9th Prince]\nYo revelation nation, kill on occasion, sick of patience\nMy visions is diabolical like Wes Craven\nGenetic verses, streets is cursed\nTales of terror in ya area, twenty million miles to Earth\nGenocide a century, Apocalypse peniteniary\nComputer convicts, the final conflict\n9th Prince is too intelligent to speak ebonics\nShocky, but brain waves electronic\nMicrophone addiction, philosophy crusifiction\nPrince Saddam crusified all competition\nHe moves like a swordsman on a horse\nBloody verses leave blood stains of Verbal Intercourse\nFloss, like diamonds all up in the cross\nThe title is kill or be killed and you just fuckin' lost\n\n[Chorus x4]\n\n[Outro: P.R. Terrorist]\nThat's the laws, yeah..\nTerrorist and 9th Prince, check the sequence\nY'all niggas must be dense\nThere ain't no defence for this offence\nTryin' to pay the rent, nigga\nYeah..", "year": null, "title": "Kill or Be Killed", "image": "https://images.genius.com/aee759b8fa2fa70e9bb2b738d3297e33.462x462x1.jpg"}]}