{"artist": "Pusha T", "songs": [{"album": null, "title": "Santeria (Kid Cudi Demo)", "image": "https://images.genius.com/66e8896c8c1bb069880e68e1abc3f74f.900x900x1.jpg", "lyrics": "[Verse 1: Pusha-T]\nNow that the tears dry and the pain takes over\nLet's talk this payola (Payola)\nYou killed God's baby when it wasn't his will\nAnd blood spill, we can't talk this shit over (This shit over)\nThe Lord is my shepherd, I am not sheep\nI am just a short stone's throw from the streets\nI bring my offerin', I will not preach\nAwaken my demons, you can hear that man screaming\nI'm no different than the priest, priest\nSantería (Santería, Santería, Santería)\n\n[Verse 2: Pusha-T]\nThey say that death comes in threes, how appropriate ('Propriate)\nTriple back, they rush in like Soviets (Soviets)\nAt the Kremlin\nSearchin' for the green like a Gremlin, presidential emblem\nPresidential tint on this shit that I am driven in (Woo!)\nI just place orders and drop dollars\nRottweilers roam the grounds, the Glock hollers\nThe three of y'all too accessible\nSeen all the wrong moves, watchin' The Untouchables\nWe don't do vegetables, niggas get flatlined\nWelcome all beef, then we heat 'em with flat irons\nYour plans are backfiring, think of double-crossin' a priest\nHail Mary, repeat after me\nSantería!\n\n[Refrain: Kanye West]\nAfter long, afternoons good go\nSacred stories of home, they go\nIt's the code of Mamman Shata\nSomething only we know\nThat's the code named, Mamman Shata\nSomething only we know\n\n[Refrain: Kid Cudi]\nAfter all of the news good go\nSacred stories of home, they go\nIt's the code of [?]\nSomething only we know\nThat's the code named, [?]\nSomething only we know\n\n[Verse 3: Pusha-T]\nOf all the things I've ever paid for\nKnow that it's no price tag when I wage war\nIt's no more to pray for, niggas get preyed on\nDarken my doorstep, they told me the day's gone\nYou listenin', De'Von?\nAs I'm talkin' to your spirit, for God's sakes\nI'm dealin' with heartbreak\nCheckin' my ego, I'm livin' with lost faith\nI'm backin' this hit, nigga, you ever seen Shark Tank?\nI paid 'em in small bills, all of 'em small face\nI bet when we draw blood, you niggas will draw a blank\nDress you in all black, partnered with All Saints\nOur numbers is all facts, my shooters give all thanks\nAnd all praise, no jail bars can save\nLeave you like Malcolm where X marks your grave\nHey, it's probably better this way\nIt's cheaper when the chaplain prays\nSantería!\n\n[Refrain: Kid Cudi]\nAfter all of the news good go\nSacred stories of home, they go\nIt's the code of [?]\nSomething only we know\nThat's the code named, [?]\nSomething only we know", "year": null}]}