{"artist": "Cashisclay", "songs": [{"title": "Vs. Nevez [16tel-Finale - JBB 2018]", "album": "JBB 2018", "year": "2017-10-15", "image": "https://images.genius.com/51d17df7f709cf22327a5d35a159fcdb.630x630x1.jpg", "lyrics": "[Producertag]\nThis is Magestick\n\n[Part 1: Cashisclay]\nSag mir, warum machst du das, mein Junge, hast du es nicht schwer genug gehabt?\nDas Reflektieren der Probleme deiner Jugend satt?\nIch kann dich nicht battlen mit 'nem guten Gewissen\nUnd darum werdet ihr mir vorher etwas zuhören müssen\nDenn diesen Jungen hat die Welt verdreht\nSeinem Dad aufgrund von Arbeitslosigkeit das Geld gefehlt und Mum nur für sich selbst gelebt\nSie trank während der Schwangerschaft und liebte dich nicht\nDas ist der Grund für dein entstelltes deformiertes Gesicht\nFür dein'n Sprachfehler und für die Komplexe, die du hast\nJa, unser Nevez wurd' von Anfang an belächelt in der Stadt\nUnd Tag täglich von den Kindern auf dem Pausenhof gedisst\nDenn keiner spielt mit 'nem Behinderten mit Down-Syndrom-Gesicht\nWas bringt die anderen dazu, zu dir so grausam zu sein?\nDu wolltest doch nicht mehr als etwas Aufmerksamkeit\nDoch niemand gibt dir mal die Chance über dich zu reden\nUnd aus Einsamkeit und Trauer werden psychische Probleme\nFür Mum und Dad wurd' er austauschbar\nSie hab'n vor dem Fernseher gesessen und drauf geschissen, um wie viel Uhr er Zuhause war\nEr schämt sich dafür, er ist traurig und weiß\nKeine Frau auf dieser Erde schenkt ihm Aufmerksamkeit\nUnd er weiß auch, im JBB wird er gehatet von den Massen\nDoch er nimmt den Spott in Kauf, so wird er wenigstens beachtet\nUnd ich find' die Kommentare unter deinen Clips so widerlich\nWenn man bedenkt, dass deine Quali nur ein Schrei nach Liebe ist\n\n[Hook 1: Cashisclay]\nEs tut mir so leid, denn du bist nicht mehr du selbst\nIst da denn niemand der dir helfen kann?\nDu bist verzweifelt und weinst, lass mich allein\nEs tut mir so leid, lieber Gott, warum muss ich es sein?\nDer dir mal einen Spiegel zeigt\nAber vielleicht muss es sein, damit du begreifst\nSo geht es nicht weiter\n\n[Part 2: Cashisclay]\nEy, jetzt werden wieder Minderheiten diskriminiert\nUnd bis auf dieses Battle hat der Behinderte bisher nichts zu verlier'n\nAh, jedesmal, wenn jemand sagt, du siehst wie deine Mutter aus\nDenkt die sich insgeheim, hätten wir damals mal 'nen Hund gekauft\nDeine Songs besteh'n nur aus behinderten Witzen\nSo ein'n wie dich hätt' man in Sparta von der Klippe geschmissen\nUnd weil sich kein Mädchen jemals in das Scheusal verliebt\nMach' ich kurzen Prozess mit dir, nenn' es Euthanasie\nAlles wack, was der Verlierer hier schreibt\nDeine Texte kling'n so krass nach Kindergarten, Dicka, Gio wird geil\nWas soll ich Lines gegen den Bastard schreiben?\nDu bist neben Hitler einer der zwei schlimmsten Österreicher aller Zeiten\nDicka, ich bin hier, damit jede Runde ein Rapper stirbt\nDu nur, damit irgendjemand wahrnimmt, dass du existierst\nDoch niemand interessiert deine beschissene Strophe\nDu bist nur hier dank der gesetzlichen Behindertenquote\n\n[Hook 2: Krickz]\nDu siehst angefahren aus, ich mach' dich Krüppel zu 'ner Bitch\nAn deiner Stimme merkt man, dass du hart zurückgeblieben bist\nEy, dein schielendes Matschauge fällt dir aus deinem Face, Kleiner\nFällst du aus dem Rollstuhl, fühlst du dich wie ein Stagediver\nEy yo, Nevez träumt von einer Karriere im Rapbiz\nNevez, du wirkst sogar neben Laskah noch hässlich\n\n[Part 3: Cashisclay]\nEgal, wie integriert dich deine scheiß Freunde nenn'n\nDu bist so behindert, du bist der Blinde unter den Einäugigen\nUnd um keine Jungfrau mehr zu sein, versteh' ich, dass man Nutten fickt\nDoch Nevez ist so ekelhaft, der kriegt nicht mal im Puff 'n Stich\nErzähl mir nicht, du schreibst an deinen Tracks allein\nDu Schwuchtel kriegst doch alles vorgeschrieben, so wie Laskah oder DAVID NINE\nKomm, ich erklär' dir, wie man flowt oder Texte schreibt\nEine Message zeigt oder 'ne Punchline aufbaut, wenn man battlet\nWeißt du, was dich hier erwartet, du läufst frontal in mein Messer rein\nIch würde lieber sterben als so behindert wie Nevez sein\nUnd was bringt dich denn dazu, bei JuliensBlog mitzumachen?\nSelbst wenn du Akapella rappst, klingst du noch Offbeat, du Lappen\nIch bin mir sicher, dass du nach dem Battle Sanitäter brauchst\nDenn nur aus Mitleid heb' ich mir den Doubletime für später auf\nDas ist als ob du Schläge an dein Doppelkinn kassiert\nDenn trotz dieser SLY bist du die größte Fotze im Tunier\n\n[Hook 2: Krickz]\nDu siehst angefahren aus, ich mach' dich Krüppel zu 'ner Bitch\nAn deiner Stimme merkt man, dass du hart zurückgeblieben bist\nEy, dein schielendes Matschauge fällt dir aus deinem Face, Kleiner\nFällst du aus dem Rollstuhl, fühlst du dich wie ein Stagediver\nEy yo, Nevez träumt von einer Karriere im Rapbiz\nNevez, du wirkst sogar neben Laskah noch hässlich\n\n[Part 4: Cashisclay]\nYeah, ich schäm' mich eigentlich, dadrüber zu reden\nDoch neben dir sieht Stephen Hawking aus wie das blühende Leben\nDeine Ma' dachte, bei der Geburt wär'n Fehler passiert, du Lappen\nHat dich geseh'n und sich sofort sterilisieren lassen\nUnd seitdem forschen täglich Doktoren an ihm\nDenn er warf Zweifel auf an der Evolutionstheorie (was?)\nDu ekelhaftes Wesen, wie kann man so widerlich sein? (wie?)\nMit deinen Kinderfotos werden Pädophile geheilt (ihh!)\nDein Aussehn ist so ein Kopffick\nIch glaube, du bist gar nicht behindert, das ist nur 'ne Ausrede für deine Optik\nDu behinderter Gnom\nDank deinem Matschauge nenne ich dich auch ohne zweckzureimen 'nen verwirrten Zyklop\nDas Talent von dei'm Ghostwriter kommt technisch manchmal bisschen durch\nDoch selbst deine beste Line ballert nicht, wenn du sie rappst wie eine Missgeburt\nDu Kek bist geschlagen, ich habe Nevez begraben\nMann, aber er war nur der erste unter sechs Kandidaten\n\n[Hook 2: Krickz]\nDu siehst angefahren aus, ich mach' dich Krüppel zu 'ner Bitch\nAn deiner Stimme merkt man, dass du hart zurückgeblieben bist\nEy, dein schielendes Matschauge fällt dir aus deinem Face, Kleiner\nFällst du aus dem Rollstuhl, fühlst du dich wie ein Stagediver\nEy yo, Nevez träumt von einer Karriere im Rapbiz\nNevez, du wirkst sogar neben Laskah noch hässlich"}]}