{"artist": "Waka Flocka Flame", "songs": [{"year": "2014-07-08", "lyrics": "I’m from southside of this Blatlanta\nGot shooters in Chiraq\nGot shooters that'll blast you\nI'm good in places you've never been\nThey'll give you shots, no medicine\nSo test Flock, don't try that\nI got little niggas with big guns\nTake limbs off like that's contact\nAnd ain't scared to catch no murder case\nEvery summer, boost the murder rate\nWon't send em now, I'll send em them later\nWhen they cool off, I'll prefer to wait\nCause a real boss got to think smart\nCause the goal is to get cleaned off\nWhile winners beef, we never see y'all\nCause the truth is your team soft\nYou ain't good out in these streets, nigga\nYou're a foreign, no green card\nI been out in these streets, nigga\nSince a young nigga getting green off\nJewelry on out in any hood, won't believe what this ring cost\nNever tucking my chain in and I'm pulling up in your dream car\nCan't talk real and not mention me\nWhat? You niggas don't get it yet\nI'm the realest in it and I built your image\nTurn any block to Virginia Tech\nYou a pussy nigga never been a threat\nI'm throwing bullets, Eli Manning\nAny time you can intercept like Brandon Lee die in your set\nLike blaow!\nNigga I ain't playin' no games\nI ain't talking 'bout a Rover when I say I got range like blaow!\nFrontin' for the fame get your name on the news\nCuz I really got aim with the tool like blaow!\nShoot outs ain't nothing that's new to me\nI'm only 2 or 3 he gone catch 2 or 3\nRight through his jewelry nigga you food to me\nShouldn't have said what you said you gone do to me\nThese rappers as fake as a 3 dollar bill\nAnd I really don't care how they feel\nDon't make you a gangster cuz you touched a mill '\nPut you on the plate, i make you a meal\nDon't make me reveal the truth about you niggas\nYou know that I will green light you for real\nIt's nothing my nigga I put on your head on a brick that you signed for your deal\nBoy we know you a façade\nKnow you won't ride, everything you say a lie\nAin't no surprise, beefing with me isn't wise\nAll these crooks oversize, swallow your pride\nOr you can swallow this nine, really don't matter to me\nI let you decide maybe I might let you slide, sike, homicide\nBefore this rap I was your favorite rappers favorite shooter\nIt ain't a question I'm a rider like I drive a hoover\nI'm too G so without me there wouldn't be no Google\nYour street cred a 3.50 without my approval", "image": "https://images.genius.com/615016a72f645e322ab9388f4cca0404.500x500x1.jpg", "album": "I Can’t Rap Vol. 1", "title": "Blatlanta"}]}