{"artist": "B.G. Knocc Out", "songs": [{"album": "1-Up", "title": "Stories", "lyrics": "I’m posted\nI’m  up in the spot\nWith  them boys\nThey ready to trap\nI was busy pumping the blunt\nWith  that 40 cal sitting in my lap\nAll  I’m thinking about\nIs the dope\nGot  a quarter key up in the back\nSo before I can get up and move\nI got hit over the head with a gat\nNow they yelling\nWhere  is the dope\nWhere is the guns\nWhere is the money\n\nAnd I’m screaming fuck all of you pigs\nYou find it yourself\nYou won’t get it from me\nNow they put me off\nUp in the chair\nThen they put a gun up to my head\nSaid you  better tell us where the stash at\nOr your punk ass gonna wind up dead\n\nIt was three white cops and a black dude\nThis is not a raid this is a jack move\nThey put a knife up on the stove\nThey made it real hot\nThey cut off my tattoo\nI’m bleeding badly but don’t bend  though\nThey mad  I won’t give up no info\n\nThey said punk you don’t know what you in for\nThen they bust my eardrum with a pencil\nI’m like fuck this shit really hurts\nYou niggas are dirty you might as well kill me\nHe said yep pulled a gun from his hip\nThen he hit me in the chest with a millie?\n\nNow I’m looking off  into my death\nBarely can breathe\nGasping for breath\nThat’s when I knew they found all my shit\nWhen that sound went crack on my step\nI heard, “most important thing in business is honesty\nIntegrity, hard work, family, never forgetting where we came from\nSee you are what you are in this world. That’s either one of two things\nYou’re either somebody or you’re nobody.”\n\nWoke up to a call about 7:30\nThe plug said he gonna send a package early\nI sent the money knowing he was trustworthy\nNext couple days came and I ain’t had nothing but frustration\nOut here checking other folks’ mail\nWhen I called this nigga phone it’s going straight to voice mail\nI know he ain’t gonna cross me like his boy did\nI’ll fuck around and chop him up\nAnd throw him off a bridge\nCheck it damn he block me even on that hoe shit\nGot on my girl phone quick and I requested him\nCouple minutes later he accepted it\nAnd so now I’m about to wreck some shit\nI gotta find out where it went sour at\nMight pop up at  his crib\nAnd pop a 40 to his shower cap\n\nBut instead I let an hour pass\nSeem like in all her pictures she was shaped like an hour glass\nTwo hours back I’m checking the location of his latest snap\nSo I can pop up on that nigga and see where it go from there\nHe telling me he sent it but\nWithout a cap or that pistol on my hip\nShot him in his fucking chest\n\nDrove back to the house to see the package there\n\nDamn!", "image": "https://images.genius.com/f53bc2513f951592f3d34d0e92b5e0ad.500x500x1.jpg", "year": "2017-07-09"}]}