{"songs": [{"image": "https://images.genius.com/6438e249e54997f8504fca57219b4738.1000x1000x1.jpg", "title": "Doo Rags", "album": "The Lost Tapes", "year": "2002-09-23", "lyrics": "[Produced by Precision]\n\n[Verse 1]\nPushin' drop-tops, Stacy Lattisaw tapes, the 80's had us all apes\nYoungest gorillas up to bat at home plate\nThat was a uncanny era, guns in my pants, yeah\nX-Clan hair, with dreads at the top of my fade\nHomicidal feds on the blocks where I played b-ball\nThat's when I wondered was I here for the cause or because\n'Cause Ray Charles could see the ghetto\nWas told to stay strong and I could beat the devil\n'Cause yo, I used to play Apollo balcony seats\nWatchin' niggas swing razors in the front row\nThen out in the streets, the car show, 560's, chemical Afros\nAcuras pumpin' Super Lover Cee and Casanova\nLive chicks be asses bustin' out of they clothes\nWearin' lip gloss, big door knockers peelin' they earlobes\nSo where them years go?\nWhere the Old Gold beers and cheers go?\nBut now them shorties here though, so\n\n[Chorus]\nThe doo rags are back, fitted hats, snorkels and furs\nRikers Island buses still packed, what's the word?\nThe drinkers stay drinkin', or puffin' they herb\nAnd I'm still enjoyin' life's ride; one mo' time\nThe doo rags are back, fitted hats, snorkels and furs\nRikers Island buses still packed, what's the word?\nThe drinkers still drinkin', or puffin' they herb\nAnd I'm still enjoyin' life's ride, right?\n\n[Verse 2]\nPolitical thugs in shark suits persuade us to pull triggers\nIn army boots, yellin', \"Join the armed forces!\"\nWe lost the Vietnam War, intoxicated poisons\nNeedles in arms of veterans instead of bigger fortunes\nThere's still a lot of nigga crawlin' in the corporate offices\nWar in the ghetto, we crabs in a barrel, they torture us\nThey won't be servin' the beast too long\nThe murderers wearin' police uniforms, Confederate flags I burn\nBeat Street breakers were dancin' to the music I chose\nAnd Peachtree, Atlanta crackheads was tootin' they nose\nIn frozen corners of Chicago\nLoaded-up llamas, children with fo'-fo's and double-revolvers\nWe devil incarnates headed for jail\nWhere Shell gas company in South Africa be havin' us killed\nYour paper money was the death of Christ\nAnd all these shorties comin' up just resurrect your life\nIt's like a cycle\n\n[Chorus]\nThe doo rags are back, fitted hats, snorkels and furs\nRikers Island buses still packed, what's the word?\nThe drinkers stay drinkin', or puffin' they herb\nAnd I'm still enjoyin' life's ride; one mo' time\nThe doo rags are back, fitted hats, snorkels and furs\nRikers Island buses still packed, what's the word?\nThe drinkers still drinkin', or puffin' they herb\nAnd I'm still enjoyin' life's ride, right?\n\n[Verse 3]\nNiggas used to wear rags on they hair when it was fried up\nThat's when we were lied to, buyin' hair products\nBack before my generation, when our blackness started disintegratin' till awareness started penetratin'\nThe styles come from prison, they used potatoes makin' liquor\nJust to prove we some creative niggas\nTurnin' nothin' into somethin' is God work\nAnd you get nothin' without struggle and hard work\nWar is necessary to my niggas in chains\nFrom Green to Sing-Sing I'm wantin' y'all to know one thing\nThe hardest thing is to forgive, but God does\nEven if you murdered or robbed, yeah it's wrong, but God loves\nTake one step toward him, He takes two toward you\nEven when all else fail, God support you\nI done it, got \"God's Son\" on my stomach\nMy heart and my lungs was affected\nFrom Henny's and gettin' blunted\nDo your body right and it loves you back\nYou only get one life, and yo, because of that\nI'm still blazin', goin' out for the cause\nStill rockin' stockin' caps, not for the waves, obeyin' no laws\nAnd it's like that\n\n[Chorus]\nThe doo rags are back, fitted hats, snorkels and furs\nRikers Island buses still packed, what's the word?\nThe drinkers stay drinkin', or puffin' they herb\nAnd I'm still enjoyin' life's ride; one mo' time\nThe doo rags are back, fitted hats, snorkels and furs\nRikers Island buses still packed, what's the word?\nThe drinkers still drinkin', or puffin' they herb\nAnd I'm still enjoyin' life's ride, right?"}], "artist": "Nas"}