{"songs": [{"year": "2011-01-11", "title": "The Greatest Story Never Told", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Intro: Saigon]\nYeah\nIt's the greatest story, ever ever told\nFirst time ever, knowmsayin?\nI'mma let y'all muh'fuckers know somethin man\nChange the game, it's a promise man\nDun-dun, let me get into this shit man\nLet me remember who I be\n{*scratched*: \"It's time for America to hear THE TRUTH!\"}\n\n[Saigon]\nCheck, the attribute is God be\nLord Supreme Allah helper to another God in need, indeed\nI feed off a lot of the bullshit that tends to succeed\nI was waitin, Just went and took a minute to breathe\nEven squeezed off a +Warning Shot+\nMoose-Knuckle to Brownsville, they impatiently waitin for your boy to drop\nLo and behold, \"Greatest Story Never Told\"\nChapter 1, Verse 1, the genesis of my scroll\nIt's realer than 9/11, I rhyme about lyin reverends\nWhile showin no total respect to the big guy in Heaven\nI rap about politicians how money's their acquisition\nTo get it they gotta keep us without a pot to piss in\nStrugglin to survive, 9-to-5 ain't makin it\nTurn on the TV all I see is celebs cakin it\nFeelin like they got all the bread but they ain't breakin it\nI'm takin it, soon as I find the oven where they bakin it\n\n[Hook]\nWhoa (the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (tell 'em again God, what it is)\nWhoa woo whoa (look, it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (haha, yeah)\nWhoa woo whoa (it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa\nWhoa woo\n{*scratched*: \"It's time for America to hear THE TRUTH!\"}\n\n[Saigon]\nCheck it, check\nWe was brought here to pick the cotton\nNow we pickin the music that massa listen to, the clothes in which he rockin\nWe don't drive a hard bargain\nAll we want back is crack, some more gats and some more of that bullshit rap\nThe crime rhyme is still black on black\nAnd we need a leader like me to get us back on track\nWhen y'all make them diss records do you know what you doin to black community?\nMarket and promote the fact that we lack unity\nThem white people look at you and laugh\nYou look like a porch monkey boy dancin for cash\nWanna get on a record and talk trash\nSee him at the awards and don't do shit but walk past\nAnd that, that's somethin we call CRASH\nCoward Rappers Actin So Hard, when they really just all ass\nAbondoned Nation on the warpath\nAnd then we gotta bring some heat out cause we changin the forecast\n\n[Hook]\nLike whoa (greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (it's the greatest story ever never)\nWhoa woo whoa (it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (yeah)\nWhoa woo whoa (it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (uhh, uhh, uhh)\nWhoa woo\n{*scratched*: \"It's time for America to hear THE TRUTH!\"}\n\n[Saigon]\nLook, once again in the beginnin I was sinnin\nNow I'm in the ninth innin of the game of life, grinnin cause I'm winnin\nI'll teach you how to rhyme, y'all only know how to riddle\nOr peep the government wan' do me like Malcolm Little\nThey say that I'm a threat to the society\nSince I put my thinkin cap on and stop lettin them fuckers lie to me\nYou gotta take it back to face the fact\nThese D's look at us as just another case of crack\nIf I bust a gun in the hood I get Attica or the cat\nI bang a gat in Iraq I get a pat on the back\nBest believe I know better than that\nThis a lesson for all my listeners, this shit ain't just regular rap\nIt's the greatest story that ever been spat\nIt's gon' teach the hood and at the same time make my pockets elephant fat\nGo 'head with all the irrelevant rap\nMe and my nigga Just Blaze bring the true element back\n\n[Hook]\nIt go whoa (it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa\nWhoa woo whoa (it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (yeah, y-yeah, y-yeah)\nWhoa woo whoa (it's the greatest story never told)\nWhoa woo whoa-whoa-whoa-whoa-whoa (ohh, yeah)\nWhoa woo (time, t-time for America, go 'head)\n{*scratched*: \"It's time for America to hear THE TRUTH!\"}\n\n[Outro - Just Blaze scratches]\n\"Time, time, t-t-time\"\n\"T-time, time, t-t-time\"\n\"T-time, time, t-t-time-time\"\n\"Time, time, t-t-t-time\"\n\"Time, time, time, time, time, time\"\n\"Time for America to hear THE TRUTH!\"", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}