{"artist": "E-40", "songs": [{"title": "Don’t Blame It On Me", "image": "https://s3.amazonaws.com/rapgenius/429360_10150592533032050_1732757056_n.jpg", "album": null, "year": null, "lyrics": "(feat. B-Legit)\n\n[E-40] Youse a fool. You sound like you fin to earl\nThey can have all the armor but that calm doesn't harm\n\nChorus One: E-40\nDouble cross the game, and get yo' head to' off\nDisrespect the game, ya get yo' head to' off\nYour faulty bitches main? A getcha head to' off\nFuck with my riches main? And getcha head to' off, beittch!\n\n[B-Legit]\nI'm erog-enous, most dog in this\nDark brown like a clot, but now I'm saucy\nHoes toss me they number like an alley-oop\nBut I slam it in the trash, if she ain't got, ass and loot\nShoot, it's all mine in the nine sizzle\nPistol still fizeal fine, direct hits make em retire\nI ain't no liar, I put it on my flow\nNiggas fuck around, they get they head to' off\n\n[E-40]\nWhat's up? They disrespect us\nThem fools ain't tryin to fight no wars\nYou talkin about bang bang\nThat's the way this shit gonna go\nJust let your balls hang\nDon't think about just do it\nCause when you think about it\nBefore you know it, you blew it\nI ain't got shit to lose\nNo mercy nigga, no sarges\nGet your rowdy boys\nDo it today not tomorrow\nCheck your inventory\nMake sure you got enough ammo\nIt's self-explanitory\nDon't let em blow out the candle, biotch!\n\nChorus\n\nChorus Two: E-40\nThink about it 'fore you pop that shit\nCause if they find you witcha crew, they pack split\nDon't blame it on me (4X)\n(repeat all 2X)\n\n[E-40]\nYou came up sixteen\nInterest is fast\nShe'll still serve everybody\nFor the cash\nShe likes to party\nWith her ass-lick pussy-lick\nDick\nLick ass\n\n[B-Legit]\nAnd we some grown men, we turn trill hoe out\nAnd all we ever did was stuck dick in her mouth\nWe fuck wines to the millionaires\nBall players that play, you better keep your bitch out the Bay\n\n[E-40]\nThe less fortunate\nThe sluts, the drug abusers\nOldest profession known to mankind\nIs prostitution\nWhen I make a zillion I resign\nJust like clockwork\nBut you know me I'm always a day or two late\nAnd a dollar short\n\n[B-Legit]\nI trick a bitch that love Legit and do whatever I tell her to\nFrom credit card scams to givin head to you\nSo if you breathe, know what I mean, prepare that ass\nFor the guillotine boss, get that ass to' off\n\nChorus One\nChorus Two\n\n[B-Legit]\nI got dreams of a mansion with the glass block\nAbout a million point five in the stash box\nI let the beat knock, I let the ass drop\nAnd if a nigga run up, he get ch-uh-chopped\n\n[E-40]\nCase number two forty six, she been in an unhappy dwellin\nNeighbors steady complainin, bout the dope sellin\nBut they ain't never been evicted, or convicted\nThey ain't never been subpeonaed to court, or arrested\n\n[B-Legit]\nI tried to tell em like I once told fools what's up\nFonzarelli and the Savage get they cash and loss\nI'm from the coast, where we don't play that kid shit\nAnd niggas get they motherfuckin wig split\n\n[E-40]\nAhhhhh I spits nothin less than hi-tech Lugz\nWe can buck on each other or we can put on the gloves\nDon't make me mad let me know, if you want more spot\nI can do this playa, get the driveshaft all off, biotch!\n\nChorus One\nChorus Two (to fade)"}]}