{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "Goodnight", "image": "https://images.genius.com/03dd13269b9289e452bde3eb7d1a6577.1000x1000x1.jpg", "lyrics": "[Verse 1]\nI kick flows, rip shows, think it switched though?\nShit no, it ain't any different when I get home\nI shift po to get dough, lust Ps\nIf you ain't ever been broke?\nFor you to judge me's an insult\nIt's my life and I'm living it\nAgreed we all have choices but mine limited mostly by my decisions\nIf I knew then what I knew now I'd a lived live different\nI'd be a different me but I didn't so this is me\nMe, in my position what would you have done?\nWould you of done what I did? Am I what you would become?\nMy guess, my guess is you would've succumbed like I did\nThe decision was mine but I was too young\nAn I picked the wrong path, I went the wrong way\nLeft school then got the grade, banged it out, got my papes\nStacked my Ps, copped a cake, I'm holding weight now\nMade a brick off a ounce and ain't been in the jailhouse\nI intend on staying free, free for me don't mean free from stress\nLay in bed but I ain't asleep\nFrom I need rest I just blaze the tree's\nDrift off hearing my Nan say to me\n\n[Hook]\nGood night, God bless\nI'll see you in the morning\nGood night, God bless\nI'll see you in the morning\n\n[Verse 2]\nI'm a dreamer, but can only dream as\nLong as I'm asleep I've, been having trouble sleeping\nSee Nanny Edie ain't here to say goodbye no more\nI had to say goodbye to her, inside is where resides the hurt\nNow all I feel is pain, after that nothingness\nAfter that? Nothing since, after that there's nothing left\nSome of her last words were I can't fight forever\nLike she wanted to give up an of life she was fed up\nShe had to go but I wanted her to stay\nCause ever since she left, things haven't been the same\nI need a new shelter from the rain\nMy face looking weathered, a facety looking bredder I'm fed up\nI know not what to do\nSee I'd love to say that I don't give a fuck but I do\nThe gift an curse that I'm blessed with\nThe pressures on road ain't nothing to the emotions that I wrestle with\nStress got me in a figure four, raw is what I'm thinking\nI wonder what I'm living for?\nIs it only to hurt? First my great nan\nNow I gotta put my dad in the dirt\nBack in the earth, I wished we could have patched it up first\nI was so angry though, I just couldn't handle the hurt\nNow you're in the back of a hearse\nIt hurts more than it ever did\nSometimes I wish that I had never lived\nFeels as if it would have been better if I never did, live\nI don't know how I'm ever gonna get through this, shit\nI swear down blud, I'm running on empty\nMy life ain't nothing to be envied\nSo goodnight...", "year": "2010-07-16"}]}