{"songs": [{"album": "VII (Deluxe)", "image": "https://images.genius.com/8bd7a3406ad5382fc82d77b9dc06723e.220x220x1.png", "year": "2014-05-12", "title": "Maybe", "lyrics": "[Intro: Yo Gotti]\nChea! Ayo!\nAyy, you know what it is, shawty\n\n[Verse 1: Yo Gotti & Teyana Taylor]\nMaybe, maybe it's the money, baby, maybe not\nMaybe I fell in love with ya on the spot, never lie\nI keep it G, I told you that there off the top\nMaybe you never met a street nigga thuggin' on the block\nAnd I ain't fuckin' with no thot, shawty\nPowerball, this your shot, shawty\nAnd if they hatin' let them talk, shawty\nAnd I been drinking too much, and it got me thinking too much\nYou in my head, what the fuck?\nI say, boy, you done did it, love how you kiss it\nOoh you can get it, I never felt like that before\nOoh, you the realest, yeah, I admit it\nAll in my feelings\n\n[Pre-Chorus: Teyana Taylor]\nHad to pause, nigga, wait a minute\nAlmost tapped out when you started swimmin'\nA little cocky, I can deal with that\n'Cause you put it down and I need parts of that\nJust text your phone, nigga, \"Where you at?\"\nGive me rounds, I need all of that\nAin't even gotta knock, left the door unlocked\nSo is you tryna take it down or nah? Or nah?\n\n[Chorus: Teyana Taylor]\nMaybe it's the liquor, maybe it's the song\nDon't know what it is, but you turn me on\nMaybe it's the bar, maybe it's the car\nDon't know what it is, maybe I'm in love\n\n[Verse 2: Teyana Taylor]\nIn the club twisted, ooh, reminiscing\nBoy, I can vision round two\nIt's me and you and I'm winning, it's no competition\nBoy, you about to, uhh\n\n[Pre-Chorus: Teyana Taylor]\nHad to pause, nigga, wait a minute\nAlmost tapped out when you started swimmin'\nA little cocky, I can deal with that\n'Cause you put it down and I need parts of that\nJust text your phone, nigga, \"Where you at?\"\nGive me rounds, I need all of that\nAin't even gotta knock, left the door unlocked\nSo is you tryna take it down or nah? Or nah?\n\n[Chorus: Teyana Taylor]\nMaybe it's the liquor, maybe it's the song\nDon't know what it is, but you turn me on\nMaybe it's the bar, maybe it's the car\nDon't know what it is, maybe I'm in love\n\n[Verse 3: Pusha T]\nWho she seeing? Who she fucking on the low?\nShe kissing him, she kissing her, she one of those\nFuck is you? You TMZ, you Sandra Rose\nThat's little sis, I'm big bro, so let's go\nMaybe it's the way I speak it\nKnow the spot, and how to reach it\nWhen I meet your man, shake his hand\nThat's I'll keep our little secret\nWoo, no pillow talk, no kiss and tell\nThey countin' coins, my pockets deeper than a wishing well\nShe like ballers, she like Birkin buyers\nShe got a wild side, she like dope boys with a certain fire\nThat's me, nigga, so that's me, nigga\nNo if, ands, no maybes, so that's oui nigga\n\n[Chorus: Teyana Taylor]\nMaybe it's the liquor, maybe it's the song\nDon't know what it is, but you turn me on\nMaybe it's the bar, maybe it's the car\nDon't know what it is, maybe I'm in love\n\n[Outro: Teyana Taylor]\nOoh, oh, ooh\nMaybe I’m in love\nOoh, ooh, ooh, damn\nHad to pause, nigga, wait a minute"}], "artist": "Teyana Taylor"}