{"artist": "Pitbull", "songs": [{"album": null, "title": "Culo (Main Version)", "image": "https://images.genius.com/019c3e4f1239bc5e1c870ad8a780d793.860x860x1.jpg", "lyrics": "Lil Jon\nYeah, yeah, yeah, yeah, yeah, let's go (Let's go)\nRight about now, we need all the ladies to hit the dance flo'\n(Dominicana) If you got a big ol' booty (Mexicana)\nAnd you like to set that motherfucker, let's go!\nPitbull, Lil Jon, hey, hey!\n\nPitbull\nAhora que si, esa hevita esta enterita tiene tremendo culo!\nEsta tan linda, esta tan rica, tiene tremendo culo!\nQue rica chiquita, pero que importa si tiene tremendo culo!\nHasme el favor y meneate chica tienes tremendo culo!\n\nPull up to the club, walk in then I\nPull up to the bar, get drinks then I\nPull up to a broad let her know what it is\nHow it is, why it is, what it is (Hey hey hey hey)\n\nI ain't got time for no games, I'm hopin' mami that you feel the same\nI got what you need to feel the pain\nHere's my number call me when you're up for an even exchange\nFeel me, let me see you do that dirty dance, dirty dance\n\nMami, feel me let me see you touch your toes\nOr shake that thing and talk wit' your ass\nFeel me! All my chicos, all my Jamaicans\n(Put your hands up) All my Haitians\n'Cause they know imma rep' till the day that they kill me pull up!\n\nEsa hevita esta enterita tiene tremendo culo!\nEsta tan linda, esta tan rica, tiene tremendo culo!\nQue rica chiquita, pero que importa si tiene tremendo culo!\nHasme el favor y meneate chica tienes tremendo culo!\n\nMami got the ass and thighs like Trina and J. Lo\nMultiply it she's off the chain\nOff the glass, off the flip and\nWith a couple more drinks I'll be off the hip man...\nI'll be wearin' her out and when I'm finished\n\nParamedics gon' be carryin' her out man... (That's right)\nThe night is young, and if you shave (Hey hey hey hey hey)\nI'll give you some of this mighty tongue hey...\nBe easy, go ahead please me, talk to me sleazy baby (Yeah)\nI wanna freak, a monster in bed, last thing I need is a lady\n\nEsa hevita esta enterita tiene tremendo culo!\nEsta tan linda, esta tan rica, tiene tremendo culo!\nQue rica chiquita, pero que importa si tiene tremendo culo!\nHasme el favor y meneate chica tienes tremendo culo!\n\nEsa hevita esta enterita tiene tremendo culo!\nEsta tan linda, esta tan rica, tiene tremendo culo!\nQue rica chiquita, pero que importa si tiene tremendo culo!\nHasme el favor y meneate chica tienes tremendo culo!\n\nLil Jon\nCulo, hey, hey, hey, hey shake that shit hey\nHey, hey, hey, hey shake that shit hey\nHey, hey, hey, hey shake that shit hey\nHey, hey, hey, hey shake that shit hey", "year": null}]}