{"artist": "Cam’ron", "songs": [{"title": "D.I.A.", "album": "The Program", "year": "2017-06-13", "image": "https://images.genius.com/40b5618414cd7787ba09b185f28f20d5.1000x1000x1.jpg", "lyrics": "[Intro: Ric Flair]\nI can't help it that I'm custom made\nI can't help it that I look good\nSmell good\nWhoo!!\nCan dance all night long\nIt's America\nIf I want to wear a Rolex watch\nYou haven't got one, you understand?\nHa ha ha ha!!!!!\n\n[Verse 1]\nIn my car I had two girls\nA quarter mill, pill poppers and pistols, y'all\nBounce they will round, got 'em back from 'frisco, yall\nLost a package, hit a wall, got it back, I'm sitting tall\nMaybe that's the reason that my wrist look like a disco ball\nWho want to dance, man? Let's take it to the disco, y'all\nRemember I ain't write for a year straight, I drink Cisco, y'all\nThis when I was 17, basketball, hollow tips\nHollow tips came first so of course\nA nigga ain't got that scholarship\nFuck it\nI ain't cared, never cared, not one for politics\nKing of Harlem took me on that path, please acknowledge it\nTowers fell, power gained, still let the sour form\nI ain't talking makeup when niggas was in that powder room\nA lot of (nasal inhale), fiends coughing up mucus\nGive me mine, hurry up, clean that up, I'm still the cutest\nBaby 23 she on me like, Killa, you still the cutest\nThen she got naked, Honey, so you's a nudist\nStill move heroin, 3 piece suit with the Rollie on\nStamps stay fresh, should have named this the Pokemon\nThat's how fiends was acting, like niggas was looking for Pokemon\nMe, I made a left, to get it right, I know I'm wrong\nWhat's going on? Still flowing strong\nNiggas struggling, oh, they just holding on (who are you?)\nI'm Aaron Rodgers turn around, I'm going long\nMy dick the car, on your knees, blow the horn\nThis the winter, spring too, summer, fall\nI'm D.I.A, What's that?\nDone It All\nBaby turn around, yeah, you the one I called\nHer friend said, \"What you want?\", I looked and said, \"None of y'all\"\nGold bottling, hoes hollering\nFunky fresh in the flesh, Dave Koresh Cult following\nA King Solomon, look at him, not a thing bothers him\nOn the corner, chicken wing, gobbling\nI'm here to dismiss the myth of Ghosts and Goblins\nWe will leave you ghost from the toast\nOh not again\nSnatch your siblings up, I'm really on it\nThe rap game be mine, I really want it\nI stack hundreds, sit back blunted, this cat's done it\nI taught bitches how to ball like Pat Summitt\nThe heroin, it flew in first class\nTo bag it up, you need scrubs and a nurse mask\nYeah boy, you looking at a dirt bag\n50 keys in the tub, that's a real bird bath\nShit, all you mother fucking purse snatchers\nTill you seen me, you never heard the word swagger\nNope you never heard the word swagger\nShout out to Dan man but I define the word dapper\n(Who you)\nDapper Cam\nNo clothes on, got a prodigy\nStab your brain with your nose bone\nShit, got that line from The Infamous\nBlack Trump though, look at my apprentices\nShit, tryna finish all my sentences\nI called my niggas up and we can start the senselessness\nI'm a chemist\nPut tools in your mouth, no dentists\nSociety yeah they know me\nNo movie, a true menace\nLieutenant hit off the tenants\nSome tenants right off of Atlantic\nForgot that they owed us money\nWe just took out his appendix"}]}