{"artist": "Pouya", "songs": [{"album": "Underground Underdog", "title": "Great Influence", "image": "https://images.genius.com/71faeb56883d83a577aaf51c4226cae0.1000x1000x1.jpg", "lyrics": "[Verse 1]\nWe sharing Sharon at the Sheraton\n'Cause sharing is caring and Karen is staring at me\nI know she feeling embarrassed\nGrab her by the neck, say \"bitch, don't ever disrespect me\"\nPop the MAC-11 if your soul is feeling empty\nNot so much my enemies but more so my fans I do envy\nYuh, these hoes starting a frenzy, my dick is feeling so flimsy\nI can barely keep up with a B cup\nC, I ain't bring my A game, can you keep up?\nFuck what you heard, piss on your dirt\nPut in that work like private school girls in the first grade\nDade county born and raised out the 305\nWhere hookers stick and jive with pocket knives\nWin the battle lose your life\nFuck your wife in my rusty pickup truck\nThe same kids you hanging with the same ones yellin' \"stick em up\"\nI can resurrect you I can pick you up out the mud put you on to some\nShow you all the ropes\nShow you how that money grow\n\n[Chorus]\nI can show you how to fuck your bitch\nI can show you how to rip that condom off your dick and smack your mama in the lip\nLet the children know it's lit\nDrop out of school, you know you never had that on your bucket list\nI can show you which way you should go\nNever listen to your parents, trust me, they don't fucking know what's best for you like I do, yeah, ayy\nYou think I give a fuck about your IQ?\n\n[Verse 2]\nYour mama thinking you stupid because you bringing in F's\nGiving her stress and a couple knots in her chest\nNobody appreciates that you've been trying your best\nI can show you how to give up and just hang from your neck\nYour stepdaddy looking for your respect\nI say fuck that, don't give it to him\nFuck him and his rep, I know he getting on your nerves\nComing home drunk as fuck\nBeating on you and your mama\nI say put one that in that llama and spit on him while he's sleeping\nPut a needle in his veins so the police think he was tweaking\nTell your mama you was gone the whole weekend\nThrow away the pistol, make sure nobody could reach it\nYour life is better ain't it? Told you that you need me\nI can show you how to be the man\nI can show you how to make your body count expand\nI can show you how to multiply your profits, your pockets, your hoes\nFollow me and I promise\n\n[Chorus]\nI can show you how to fuck your bitch\nI can show you how to rip that condom off your dick and smack your mama in the lip\nLet the children know it's lit\nDrop out of school, you know you never had that on your bucket list\nI can show you which way you should go\nNever listen to your parents, trust me, they don't fucking know what's best for you like I do, yeah, ayy\nYou think I give a fuck about your IQ?\nI can show you how to fuck your bitch\nI can show you how to rip that condom off your dick and smack your mama in the lip\nLet the children know it's lit\nDrop out of school, you know you never had that on your bucket list\nI can show you which way you should go\nNever listen to your parents, trust me, they don't fucking know what's best for you like I do\nYou think I give a fuck about your IQ?", "year": "2016-04-29"}]}