{"artist": "Playboi Carti", "songs": [{"album": "Playboi Carti", "title": "Kelly K", "image": "https://images.genius.com/b08ccdce49d2dc78a6abf5a8a46b076e.1000x1000x1.jpg", "lyrics": "[Intro]\nAnd I only fuck with thick hoes\nWhite ho, let's go, ayy, that's my type, though (That's my type)\nYeah, white ho, yeah, yeah, let's go, what?\nYeah, white ho, yeah, yeah, let's go\n(And I only fuck with, ooh, ooh, ooh, yeah)\n\n[Chorus]\nAnd I only fuck with rich hoes (And I only fuck with, yeah)\nAnd I only fuck with thick hoes, ooh, yeah\nWhite ho, ooh, uh, let's go, ooh, yeah\nWhite ho, yeah, ooh, let's go, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah\nBlack ho, ooh, yeah, let's go, ooh, what?\nBlack ho, yeah, yeah, let's go\n\n[Verse 1]\nOoh, she just need a nigga, uh, with a check, though\nOoh, yeah, movin' too slow move to the left, ho\nOoh, movin' too slow move to the left, ho\nOoh, yeah, hurry up, we hoppin' on this jet though\nOoh, ooh, and I only fuck with thick hoes\nOoh, uh, I'm a skinny nigga, you see these tight clothes\nOoh, ooh, piped up, yeah, I'm piped, ho (Piped up)\nOoh, come and get piped for the night, ho\nOoh, ooh, designer drugs and I need some ice, ho\nOoh, ooh, a lot of hoes, yeah I need some condoms\nOoh, ooh, fuckin' with Young Carti, you'll get high, ho\nOoh, ooh, you ridin' too slow, are you high, ho? (Skrrt)\nOoh, ooh, uh (Slow, yeah), are you high, ho?\nCome and sip some drank, pop some pills, come get high, ho\nWe be on a jet, we so high, we on fly mode\nI be flexin' on these niggas, pop, but they pop mode\nWith my eyes closed\nI'm on Bang Bros\nI got hella hoes\nI got hella hoes, got that nasty flow\nShe get nasty though\n\n[Chorus]\nAnd I only fuck with rich hoes (And I only fuck with, yeah)\nAnd I only fuck with thick hoes\nOoh, yeah, white ho, ooh, uh, let's go\nOoh, yeah, white ho, yeah, ooh, let's go, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah\nBlack ho, ooh, yeah, let's go, ooh, what?\nBlack ho, yeah, yeah, let's go\n\n[Verse 2]\nHo, I'm flexed up\nLookin' like who next up (Like who next up), hold your face up (Hold your face up)\nI just got my check up (Got my check up), got my cash up (Got my cash up)\nYou can't get no check, cuz (No check, cuz), get your bands up (Get your bands up, ooh, ooh, ooh)\nFace down, ass up (Yeah, yeah, yeah, yeah)\nWalk around the club with your hands up (I walk around that shit)\nWalk around the club, I'm no dancer (I walk around that bitch)\nKeep that pole on me, I might just blam ya (Blatt-blatt-blatt-blatt)\nKeep that pole on me, I told him man up (Blatt-blatt-blatt)\nWalk inside that bitch, I made them stand up (Ooh, ooh, ooh, ooh, ooh)\nI'm a walkin' lick, bitch, where your camera? (Where yo camera?)\nIf she want that whole thing, I gave her sample (I gave her a little, though)\nThe way I stole that, bitch, like where your man go? (I took your lil' ho)\nFuckin' on this bitch inside the bando (Ooh, ooh)\nSuckin' on this dick, they use no hands though (Ooh, ooh)\nI just turned this bitch into my main ho (Ooh, yeah)\n\n[Chorus]\nAnd I only fuck with rich hoes (And I only fuck with, yeah)\nAnd I only fuck with thick hoes\nOoh, yeah, white ho, ooh, uh, let's go\nOoh, yeah, white ho, yeah, ooh, let's go, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah\nBlack ho, ooh, yeah, let's go, ooh, what?\nBlack ho, yeah, yeah, let's go\nAnd I only fuck with rich hoes (And I only fuck with, yeah)\nAnd I only fuck with thick hoes\nOoh, yeah, white ho, ooh, uh, let's go\nOoh, yeah, white ho, yeah, ooh, let's go, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah (Yeah)\nAnd I only fuck with thick hoes, ooh, yeah\nBlack ho, ooh, yeah, let's go, ooh, what?\nBlack ho, yeah, yeah, let's go\n\n[Verse 3]\nYeah, my main ho, take that dirty money (Oh, yeah), ho, to the bank, ho (Yeah, yeah)\nFirst you flip a birdie (Flip a birdie, bitch), ho, make a name, ho (Yeah)\nI go 730 (730, bitch), ho, on the drank, ho (Yeah, ooh, lean, on me)\nLike what you drank, ho? (Yeah)\nI pour up that pink, ho (Up that pink), Easter pink, though (Ooh, yeah, yeah)\nAll up in my Styrofoam (Yeah), I'm on lean, ho (Ooh, ooh, yeah)\nShe say she so lonely, though (So lonely)\nLean on me, ho (Lean on me)\nI might give your bitch the bone (Bone), not no leash, ho (Not no leash)\nI just want a lil' dome (Dome), from a freak ho (Yeah, yeah)\nI ain't with the cuffin' (Yeah), ho, that ain't me, ho (That ain't me)\nI just like to press a ho (Press), like that me, ho (Ooh, ooh, ooh)\nFeel it in your chest, ho, ooh, that's OG, ho\nThink I need a G4 (Yeah, yeah), this for me, ho (Yeah, yeah)\nDesigner shit, no cheap clothes (Yeah)\nYou a thief, ho (Yeah, yeah)\nI throw out the bankroll (Yeah)\nThen that thing go (Yeah, yeah)", "year": "2017-04-14"}]}