{"songs": [{"year": "2014-07-14", "album": "MTV1987 ", "image": "https://images.genius.com/cee8162ada8ffe30fb2fad44f0e8d4e0.1000x1000x1.png", "title": "Hell / Heroina", "lyrics": "[Part I: Hell]\n\n[Verse 1]\nI died in the past, I live in the present\nI brag bout the future, I'mma die any second\nI copped me some weapons, I keep em in the trunk\nShe keep that nina on her, she ain't afraid to jump\nI'mma move to London, my grandma stay there\nI stare to the sky, grandma kay there\nGo back to Corpus, my momma pray there\nSix, five, four, one\nGoals done? Not at all\nStanding still, I feel the fall coming\nStaring in the mirror, tell myself that I don’t mean nothing\nMy vision blurry as ever, my wrist is bloody as ever\n3 A.M., still in the apartment's parking lot\nMy sister go to work in two hours, I go to school in three\nI still ride the school bus, still ain't got no state ID\nPity for me? Nah, nigga not at all\nTuition fees? Nigga please, finna be Bieber in the fall, motherfucker\n\n[Bridge]\nBetter protect your head boy, better watch what you said boy\nBefore you end up dead boy, is what a wise man once said boy\n\n[Verse 2]\nFuck twelve, fuck twelve, nigga\nRolling up until I feel different\nRun through thots until my feelings missing\nYou moving weight from your momma's kitchen\nAin't shit change, got no range though\nStill the same nigga, different area code\nKeep the same circle everywhere I go\nIf shit gon' pop off, you know how it go\nNigga, you know how it go\n\n[Part II: Heroina]\n\n[Intro]\nFeel it in my bones\nCreeping, creeping, creeping\nFellas still not home, I won't leave him, leave him, leave him\nFeel it in my bones\nCreeping, creeping, creeping\nFellas still not home, I won't leave him, leave him, leave him\nFeel it in my bones\nCreeping, creeping, creeping\nFellas still not home, won't leave him, leave him, leave him\n\n[Pre-Chorus]\nI been, I been\nSo polite\nI been, I been\nSo polite\nDrugs been, drugs been\nSo polite\nI been, I been\nSo polite\n\n[Chorus]\nWhen I die tomorrow, call my momma\nAt the funeral, no drama\nDon't bring no tools, don't bring no heroina\nWhen I die tomorrow, call my momma\nAt the funeral, no drama\nDon't bring no tools, don't bring no heroina\n\n[Verse]\nMy girl tells me that this shit is death\nTo me it feels it is all I got left\nIt heals my feels deep down, I don't feel wrong\nExcept for when I see the demon bleeding in the mirror for too long\nSee him, need him, write my wrongs\nTreat him, leave him, like his mom\nPain here, right here, in my bones\nKeep me on my toes for now\nCatch me at the church in the morning in a casket\nAnd I don't mind if I die\nBut I don't do it, who gon' do it?\nYou gon' do it, fuck that, I'mma let these drugs do it\nAnd I'm too scared of suicide, I'm too scared of suicide\nIma let this H just take my life, I'm yelling\n\n[Chorus]\nWhen I die tomorrow, call my momma\nAt the funeral, no drama\nDon't bring no tools, don't bring no heroina\nAnd when I die tomorrow, call my momma\nAt the funeral, no drama\nDon't bring no tools, don't bring no heroina\n\n[Outro]\nDon't bring no heroina round here, boy\nDon't bring no heroina round here, boy\nDon't bring no heroina round here, boy\n(Don't bring no heroina)\nWhen I die tomorrow, please no drama\nLet me die in peace"}], "artist": "Kevin Abstract"}