{"artist": "360", "songs": [{"album": "Falling & Flying", "year": "2011-09-30", "title": "Hope You Don’t Mind", "image": "https://images.genius.com/ff953b11808071cdb82a384e1649c9ef.1000x1000x1.jpg", "lyrics": "[Intro: 360]\nI'ma get on my sort of emo shit on this one\nGonna vent a little\nI hope you don't mind\nYeah, listen\n\n[Chorus: 360]\nI hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nAnd can I let it all out?\nSee I hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nCan I let it all out? (yo)\nYeah\n\n[Verse 1: 360]\nAyo, I wish I had a time machine\nTo change the way that my mind perceives everything my eyes have seen\nAnd make me look at life through a wider screen\nIt ain't what you might believe's happening behind the scenes\nI treat the beat like an X-ray, press play\nLookin' inside, the best way to express pain\nFucking up is becoming something I'm used to\nBut sometimes to find yourself you gotta lose you\nTo those listening sorry for being emo\nBut fuck what the doctor says, this is what I need though\nYeah, and so I'm walking into that cloud\nWhere it has to hurt just to bring you back down\nAlmost became addicted to the painkillers\n'Cause without that feeling, yo, the pain's killer\nYou'd think having a near death experience'd\nMake a smart person take their life more serious\nFrom nearly dying to feeling so enlightened\nTo nearly crying and feeling only frightened\nReleasing this is hard, yo, it fuckin' hurts a bit\nIt's the only way I know how to come to terms wit' it\nAnd this is Matt here, I'm giving you the real me\nI just hope that you can feel me\n\n[Refrain: 360]\nAnd I know you're probably thinking I should keep it to myself\nBut I can't, yo, I need it 'cause it helps\n\n[Chorus: N'fa & 360]\nI hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nCan I let it all out?\nSo I hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nCan I let it all out?\nYeah\n\n[Verse 2: 360]\nAnd with the partyin', I think I needa settle down\nTo be real, I'm getting a little messy now\nA few drinks and I'm stressing out\nIn another state, looking for my own mum to come and get me out\nI got no idea when I'm coming home\nAnd all I want is to be left the fuck alone\nI'm only being real, the depression comes and goes\nIgnore it, 'cause tonight there is yet another show\nLooking in the mirror like, \"What the fuck am I staring at?\"\nNot recognisin' the brutal mess that is staring back\nSo I'm giving you the deepest shit you'll ever hear\nSo if you got time for Matthew then lend an ear\nI'm just hoping that I've said it clear\nIf I stay on this path, the end for 360 is gettin' near\n\n[Refrain: 360]\nI know you're thinking I should keep it to myself\nBut I can't, yo, I need it 'cause it helps\n\n[Chorus: N'fa & 360]\nI hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nCan I let it all out?\nSo I hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nCan I let it all out?\nYeah\n\n[Verse 3: 360]\nI see my mates like my brothers, yo\nI hardly see 'em anymore, the last time was a month ago\nThey either working or getting in relationships\nI should do that too, but, yo, I hate the shit\nDon't get me wrong, yo, I love women\nWith what I see though, it makes it hard for me to put my trust in 'em\nAll it takes is one person to fail you\nAnd then you feel like majority will fail too\nMy insecurities'll swallow me whole\nAnd, when they arise, yo, I'm not in control\nThey watchin' every move and they move with me\nLike, \"Look at that dude, '60, that motherfucker's too skinny\"\nI can handle friends tellin' me I'm underweight\nBut, from a stranger, it's something that I fucking hate\nI know you're unaware that shit's a low blow\nBut you feel the need to tell me like you think I don't know?\nNo, that's rude, find a bridge and jump off\nAnd if I tell you to fuck off then fuck off\nThat's not being immature about it\nThat's me admitting I'm insecure about it\nAnd yo I'm sorry if I'm seemin' insane\nBut I wrote this while I was at the peak of the pain\n\n[Refrain: 360]\nBut now it's got me thinking I should keep it to myself\nBut I can't, yo, I need it 'cause it helps\n\n[Chorus: N'fa & 360]\nI hope you don't mind if I spill my pain (I hope you don't mind)\nThe longer that I don'ts like I'm goin' insane (like I'm goin' insane)\nCan I let it all out?\nCan I let it all out? (let it all out, yeah)\nSo I hope you don't mind if I spill my pain\nThe longer that I don'ts like I'm goin' insane\nCan I let it all out?\nCan I let it all out? (let it all out, yeah)\nYeah"}]}