{"songs": [{"lyrics": "[Intro]\nEazy-E: Yo Ren\nMC Ren:  What up?\nEazy-E: Take one\nMC Ren: Yo\nEazy-E: Hit it\n\n[Verse 1: MC Ren]\nRuthless, plenty of that and much more\nSo at the party, Ren is controllin the floor\nThat you step and do your dance routine\nIt ain't a dream my man, you're in a gangsta scene\nWith a villain doin damage on a 24 track\nWith no confusion to finish my conclusion\nRythymatic rhymes from a radio cat\nYou can't take what I got coz I'll be takin it right back\nRuthless gangsta - Cold killin\nYou wanna know what it's means? - Definition villain\nWith the stupid dope rhyme\nSo once you hear one line you can tell it's mine\nWith a baseball cap that's black that I'm wearin\nAnd a look that keeps you all starin\nAnd wondering why I'm invincible\nBut when you hear my rhyme, it's convincible\nI don't take no shorts while I'm constructing the ground\nThat makes y'all move around to my hell of a sound\nGirls drool on me like a diamond\n(Yo Ren, tell them what they do when you start rhymin)\nI go to the party, I hip, I hop the spot\nI dunno what it is, but the girls get hot\nPerspirin' like they're on fire and\nTheir so-called boyfriends with'em are retirin\nAnd for this reason I'm a walkin threat\nSo when I'm on stage I want quiet on tha set\n\n\"Light, camera, action\" (N.W.A. take two)\n\n[Verse 2: MC Ren]\nNow to get started with my musical profession\nA gangsta or villain in mine is in session\nThe way that I'm referrin' to this makes ya move ya butt\nBut don't stand in a daze, yeah you should know what's up\nAnyway I keep em clappin' along\nCoz' nothing bad could go wrong because this song is so strong\nI'm like Toyota, who could ask for anything more\nWhen N.W.A. is cold rockin' the floor\nLike stupid, actin like a retard\nWaitin' for a bumrush, gettin' to the good part\nIt tempts me so with temptation\nWritin' my lyrics with this hyped information\nThis is a section of my creation\nSo don't say shhh! with an exclamation\nJust look at the center of the stage where the spotlight shines\n(Boy you should have known by now) It's mine!\nUnpredictable, keepin you extremely enjoyed\nIt's irresistable, meaning that you can't avoid\nAnd while I'm on stage, look forward to sweat\nBut after I rip it up I want quiet on tha' set\n\n\"Light, camera, action\" (N.W.A. take three)\n\n[Verse 3: MC Ren + Eazy-E]\nI can be loud as hell, think I will? Never\nQuiet on tha' set - Yeah I like that better\nCause what I can do I think I earn respect\nAnd if I didn't from you, that's what I expect\nCause if it ain't ruff it ain't me\nSo who really cares how you want me to be\nSee, I'm just mean staying at the top of the pile\nAnd doin' soft note tunes it ain't my style\nAnd this concludes our program\nOf how N.W.A. makes a ruthless jam\nNow first we take an average drum\nGive it to Dre, and the boy gets dumb\nIt's no secret, that I sit alone at night\nPick up a pad and pen and begin to write\nAll kinda lyrics that's promised to play\nTo make everybody say\n\n[Sample]\n\"They can be cold and ruthless no question about that\nBut sometimes it's more complicated\"\n\n(Yo Dre)\n(You know what I want you to do?)\n(Bring that beat back, bring that beat back)\n\n[Verse 4: MC Ren]\nNow MC Ren is here working like super glue\nNo matter what I do, I'm gonna stick it to you\nCause I'm the pusher, supplying the fix\nAnd this jam's so dope, it don't need a remix\nBut I'm making obstacles of enemy traps\nTo catch any MC's with the weakest raps\nCrucifyin in vain like just for usin my name\nThe definition is pain, but that's the thing o' the game\nIf they try to retreat, I catch'em one at a time\nCoz they're comittin a crime, and still promotin a rhyme\nSo, you in the back of me just listen and learn\nBecause you'll all get a chance or maybe a turn\nNow my assignment was to give a preview\nSo at my next concert I wanna see you there\nNot sittin in a chair standin on both feet, with yo hand in the air\nNow I'm about to jet out but I'll be back\nBut next time expect a more funkier track\nDeep down for your enjoyment to hear more percussion\nWith lyrics that's smooth to start some discussion\nThe prove that I'm hype and you know that's bet\nNow continue to dance coz I'm thru with tha set", "album": "Straight Outta Compton", "year": "1988-08-08", "title": "Quiet On Tha Set", "image": "https://i.genius.com/738cee88d3e4e09c1b8c24de5357c799a275acdd?url=https%3A%2F%2Fimg.discogs.com%2FmOi4U4YtlG2R7bTARf7D4UC8thY%3D%2Ffit-in%2F600x584%2Ffilters%3Astrip_icc%28%29%3Aformat%28jpeg%29%3Amode_rgb%28%29%3Aquality%2890%29%2Fdiscogs-images%2FR-704115-1474940376-6559.jpeg.jpg"}], "artist": "N.W.A"}