{"songs": [{"year": "2018-01-28", "album": null, "image": "https://images.genius.com/586a895c2343f6442bc54c09ea8cf4b3.1000x1000x1.jpg", "title": "2018 Grammys Performance", "lyrics": "Part I: XXX\n[Intro: Bēkon]\nAmerica, God bless you if it's good to you\nAmerica, please take my hand\nCan you help me underst—\n\n[Verse 1: Kendrick Lamar]\nYesterday I got a call like from my dog like 101\nSaid they killed his only son because of insufficient funds\nHe was sobbin', he was mobbin', way belligerent and drunk\nTalkin' out his head, philosophin' on what the Lord had done\nHe said: \"K-Dot, can you pray for me?\nBeen a messed up day for me\nKnow that you anointed, show me how to overcome.\"\nHe was lookin' for some closure\nI can bring him closer\nSpiritual, my spirit do no better, but I told him\n\"I can't sugarcoat the answer for you, this is how I feel:\nIf somebody killed my son, that mean somebody gettin' killed.\"\nTell me what you do for love, loyalty, and passion of\nAll the memories collected, moments you could never touch\nI'll wait in front a homie's spot and watch him hit his block\nI'll catch the homie leavin' service if that's all I got\nI'll chip a homie, then throw the blower in his lap\nWalk myself to the court like, \"Man, I did that!\"\nAin't no Black Power when your baby killed by a coward\nI can't even keep the peace, don't you play with one of ours\nIt be murder in the street, it be bodies in the hour\nGhetto bird be on the street, paramedics on the dial\nLet somebody touch my mama\nTouch my sister, touch my woman\nTouch my daddy, touch my niece\nTouch my nephew, man, I promise\nYou chip the homie, then throw the blower in his lap\nMatter fact, I'm 'bout to speak at this convention\nCall you back—\n\nThe screen reads: \"This is a satire by Kendrick Lamar\"\n\n[Chorus: Bono & Kendrick Lamar]\nIt's not a place\n(Uh-huh)\nThis country is to me a sound of drum and bass\nYou close your eyes to look around\nIt's not a place\n(Uh-huh)\nThis country is to me a thought that offers grace\nFor every welcome that is sought\nPart II: DNA\n[Verse 2: Kendrick Lamar]\nRun your life, I live a better life, I'm rollin' several dice\nOn your life, I live a better life, I'm rollin' several dice\nRun your life, I live a--\nRun your life (ahh)\nThis is my heritage, all I'm inheritin'\nMoney and power, the mecca of marriages\n\nTell me somethin'\nUh, you can't tell me nothin'\nI'd rather die than to listen to you\nMy DNA not for imitation\nYour DNA is an abomination\nThis how it is when you in the Matrix\nDodgin' bullets, reapin' what you sow\nAnd stackin' up the footage, livin' on the go\nAnd sleepin' in a villa\nSippin' from a Grammy, walkin' in the buildin'\nDiamond in the ceilin', marble on the floor\nBeach inside the window, peekin' out the window\nBaby in the pool, godfather goals\nOnly Lord knows I've been goin' hammer\nDodgin' paparazzi, freakin' through the camera\nEat at Four Daughters, Brock wearin' sandals\nYoga on a Monday, stretchin' to Nirvana\nWatchin' all the snakes, curvin' all the fakes\nPhone never on, I don't conversate\nI don't compromise, I just penetrate\nSex, money, murder — these are the breaks\nThese are the times, level number 9\nLook up in the sky, 10 is on the way\nSentence on the way, killings on the way\nWon't you tell'em I got millions on the way\n\n[Spoken: Dave Chappelle]\nHi, I'm Dave Chappelle. And I just wanted to remind the audience that the only thing more frightening than watching a black man be honest in America is being an honest black man in America. Sorry for the interruption, please continue...\n\n\nPart III: Freestyle\n\n[Verse 3: Kendrick Lamar]\nYeah\nSay got work for Kung Fu Kenny\nKnow you got work, got work for plenty\nHim got, her got, more got, Benji\nDamn\nTop off, getting topped off in the city\nBig Top Dawg and I dance on 'em like Diddy\nPop off and I pop back like Fifty\nYeah\nPart IV: New Freezer + Kings Dead\n[Verse 4: Kendrick Lamar]\nI gotta dance\nI Milly Rock when I get that advance\nHow can I shop with like 64 M's?\nTalkin' to Top about business again\nHe want some lot with new Bentleys again\nI want some top from like two sets of twins\nTwenty twin twins, yeah, yeah\n\n[Verse 5: Kendrick Lamar]\nRed light, green light, red light, green light\nRed light, green light, they like, we like\nFast cars, fast money, fast life, fast broads\nEgotistic, goin' ballistic, why God?\nBorn warrior, lookin' for euphoria, but I don't see it\nI don't feel it, I'm paraplegic, tapped in when I'm maxed in\nComp-Town with the MAC 10s and the pumps in the background\nAbsent, never OG, standout\nLackin' everything else but doubt\nMagnum, holding Magnums with a Magnum\nHomie, ad-lib and I sing out loud\nNever had friends, never had ends, never had hope\nThey was like, \"Nope,\" I was like, \"Boo yaow, boo yaow\"\n\n[Spoken: Dave Chappelle]\nIs this on cable? CBS? It looks like it's singing and dancing, but this brother's taking enormous chances. Rumble, young man, rumble!\nPart V: King's Dead\n[Verse 6: Kendrick Lamar]\nNever had friends, never had ends\nNever had hope, they was like \"nope\"\nI was like \"boo yaow\"\n(Yeah, God)\nTee off the day\nKnow we off the, be off the, eat off your plate\nThrow me off, I be, \"Off ya head\"\nWell ate, on C4, I'm way off the edge\nBurn integrity, burn your pedigree, burn your feelings\nBurn your culture, burn your moral, burn your family\nBurn your job, burn your land, burn your children, burn your wives\nWho am I? Not your father, not your brother\nNot your reason, not your future\nNot your comfort, not your reverence, not your glory\nNot your heaven, not your angel, not your spirit\nNot your message, not your freedom\nNot your people, not your neighbor\nNot your baby, not your equal\nNot the title y'all want me under\nAll hail King Killmonger"}], "artist": "Kendrick Lamar"}