{"songs": [{"lyrics": "[Intro: Jay-Z]\nUhh, uhh, uhh, let's go\nUhh, bounce, uhh, bounce\nUhh, bounce, uhh..\nShit relax your mind, let your conscience be free\nYou're now rollin' with them thugs from the R-O-C\nSigel Sigel in the house\n\n[Beanie Sigel]\nUh-huh, sick bastard\nGet your wig pushed back by the wig push-backer\n\n[Jay-Z]\nUhh, uhh, Memph Bleek in the house\n\n[Memphis Bleek]\nStill here, never left\nStill bust, more or less, still puff - beeatch!\n\n[Verse 1: Jay-Z]\nUh, uhh, uh-huh-uh-UHH, uhh\nYoung Hova in the house.. Jigga! Yeah\nCris' sipper, six dipper, wrist glitter nigga!\nHold up love\nEvery time you see Jigga Man I'm rollin' on dubs\nDon't forget about them blades shit choppin' it up\nIt's the motherfuckin' Roc bitch, who hotter than us?\nJay-Hov, 'bout to change my name to Jay Peso\nBut in the meantime, call me William H. though\nOn the platinum Yamaha, got the engine gunnin'\nThrowin' it up like liquor on an empty stomach\n{*cycle whizzes by*} Y'all don't hear nuttin'?\nWho that, Mac?\n\n[Beanie Sigel]\nNah dawg, that's M. Bleek comin'\n\n[Verse 2: Memphis Bleek]\nWho the FUCK, want, what?\nCatch Bleek in South Beach out of the reach of the police\nGat on my lap (yeah), bitch on my back (holla)\nYak in my pocket, smokin the sticky chocolate (OO-WEE!)\nHolla if you want drama with\n\n[Jay-Z]\nThe Dynasty; Amil, Bleek, Jigga and..\n\n[Verse 3: Beanie Sigel]\nSigel - Desert Eagle dawg, who else but me?\nRoc Airs, Roc-Wears, bandannas and white tees\nMe without a gun dawg, unlikely\nYou know I keep the heat right under the wife beat'\n3x Tee, I'm Lincoln now, you can't see the pound\nGot a little gut so gat sit tucked (fuck)\nI run wild, gun high, L.A. style\nBang the roscoe to the sunrise, plus I stay dumb high\nWhether block shit or rock shit\nClub shit or drug shit, I pop shit I got shit\nGet Sig' any track I'ma spit the talk to it\nDown South gon' bounce Crips gon' walk to it\nGet a ounce, get a woods, everybody spark to it\nEvery dawg, every Blood in the hood, bark to it\nGet the ounce, get the woods, everybody spark to it\nWe can smoke in here, put the choke in the air, yeah\n\n[Static Major]\nDon't change the game for these hoes\nWho plays the game like we supposed\n\n[Jay-Z]\nSigel Sigel in the house\n\n[Beanie Sigel]\nUh-huh, sick bastard\nGet your wig pushed back by the wig push-backer\n\n[Static Major]\nDon't change the game for these hoes\nWho plays the game like we supposed\n\n[Jay-Z]\nMemph Bleek in the house\n\n[Memphis Bleek]\nStill here, never left\nStill bust, more or less, still puff - beeatch!\n\n[Static Major]\nDon't change the game for these hoes\nWho plays the game like we supposed\n\n[Jay-Z]\nYoung Hova in the house.. Jigga!\nCris' sipper, six dipper, wrist glitter nigga!\n\n[Verse 4: Jay-Z]\nI wear more bling to The Source and Soul Train's\nMore chains than rings, niggas won't do a thing\nI bangs the four-four in plain, daylight I'm deranged\nSpray right at your brain; by the way this is Hov'\nOne shot Dillinger, one shot killin' ya\nIt's only one Roc La Familia\nSigel lock Philly up, Brooklyn is me\nMatter of fact, the East Coast, who the fuck took it from me?\nFourth album still Jay still spittin' that real shit\nVolume 3 still sold more records than Will Smith\nCan't call this a comeback, I run rap, the fuck is y'all sayin'?\nFive million I done that, now I come back, to do it again (uh-huh)\nEx-sinner, Grammy award winner\nBallin' repeatedly, highlights on Sportscenter\nPlease repeat after me - there's only one rule\nI WILL NOT, LOSE!", "title": "Change the Game", "image": "https://images.genius.com/1f0dcc9dcce0b49d0f778d44b4252f88.226x228x1.jpg", "year": "2000-10-31", "album": "The Dynasty: Roc La Familia"}], "artist": "JAY-Z"}