{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "I’m Free", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Verse 1: Pimp C]\nI'm back on the slab, back on the block\nWhere them hustlers breathe that air and drank them 4's on quarter rocks\nThe boy Emmitt had me shining when I stepped out the door\nI thought I had enough but James told it give me some more\nAnd the same damn day I went to the Bentley lot\nOff the show room floor, I copped and spurred, that thang was hot\nBut I bet all you busters already knew that\nCause I was all on the internet gettin' my shine back\nMaking rhymes stack, pimping with my mic\nEverybody want a piece cause Sweet Jones is what they like\nThey like to pimp his steak and shrimp, hit well like a pimp\nBack floor, 'lac low, UGK is back ohhh!\n\n[Hook: Tom Petty]\nFree\nAnd I'm free\n\n[Verse 2: Pimp C]\nIt was \"Free Pimp C,\" but now see, the pimp free\nOld school gave me that before I left that CT\nTerrell check my bezzle on this platinum Jacob watch\nThey locked up my body but my mind never stopped\nCause I was plotting, and planning, and scheming everyday\nGettin' ready for my release so I can steal the game away\nFrom all these clone type peekers tryna sound like Pimp C\nHe's okay but he's not me\nBy a long shot cuz 'bout tryna steal to me\nThem boys might run BET but trick we run the streets\nIt's me and Bun B, that's for life, we the trill\nWhen you see a pimp shinin, trick, tell me how ya'feel\n\n[Hook]\nFree\nAnd I'm free\n\n[Verse 3: Pimp C]\nI did 4 years tops, never hit PC\nDid my time in Population with the real O.G.'s\nI seen a whole lot of pain, men doing they bids\nMost of us praying and dudes tryna get home to they kids\nWasn't nothing like \"Oz,\" a bunch of iron and bars\nBunch of player hating snitches, talking to the guards\nAnd a whole penitentiary being ran by broads\nSome of them kept it one hundred, most of them was fraud\nSeen a whole lot of chumps, con men in buckles\nSome big time dealers, kidnappers and busters\nPimps and playas, I seen some kill with they hand\nBut I still don't believe the pen is no place for no man!\n\n[Hook]\nFree\nAnd I'm free\n\n[Pimp C]\nYeah! Dedicated to everybody ain't gon' never make it up out there\nKnow what I'm sayin'\nTo everybody doing life... keep y'all head up! (keep it up)\nDon't get fed up! Uhh...\nDo yo' time, don't let yo' time do you\nYoung Pimp!\nPicture me rolling, know what I'm talkin' 'bout, like Pac told 'em when he came home...\nJumped in the five hundred...", "year": "2006-07-11"}]}