{"songs": [{"album": null, "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png", "year": null, "title": "Broken Glass (live)", "lyrics": "(Pharrell) Kweli!!!\n(T. Kweli) Yeah! They wasn't expecting this! that's why ya\n(Pharrell) Hahaha\n(T. Kweli) Gotta hope for the best and play 'em for the worst, c'mon!\n(Pharrell) Muhfuckers is history!\n(T. Kweli) C'mon!!\n\n(Talib Kweli)\nThis the story of - Lucy In The Sky Wit Diamonds\nAsk her why she crying, she wanna live, she got no time for dying\nWas a science, dreams too big for a small town\nShe gotta get to New York and watch a door fall down\nHopped off the Greyhound, gotta make her way now\nShe sleeping on the park benches in the playground\nBut cash burn quick, don't wanna have to turn trick\nReady to quit 'til she met the super pimp\nFlashing his toothy smile that drove little Lucy wild\nShe quick to hop up on his dick straight Hoopie style\nShe let the fella hit but she sang she sell-a-bit (celebate)\nHe ain't buying that, she ain't selling it\nShe looking for love in all of the above\nBelieving videos, trying to back up all on a thug\nWho wanna - put it in her, withdraw like a Citi card\nBut now she shake that ass for tips at the titty bar\n\n(Talib Kweli) (Pharrell)\nBroken glass - everywhere! (IT'S LOUDER!!)\nLouder - than a bomb shattered in in the air (IT'S LOUDER!!)\nTry to hold back your tears baby! (IT'S LOUDER!!)\nWait a second, what happens here baby? (IT'S LOUDER!!)\nBroken glass - everywhere! (IT'S LOUDER!!)\nLouder - than a bomb shattered in in the air, yeah\n(How many of y'all think you can do what we do?!)\nYeah! Wait a second (One! Two! Three! C'mon!)\n\n(Talib Kweli)\nDreams shattered like broken glass\nPress ignore it and your hopes get broken fast\nYou complain for the life you supposed to have\nBut when you try to make plans God is known to laugh\nThrow a song on the phonograph, and Lucy start wilin\nThe trick start smiling, watch the loot start flying\nThe Gucci start pilling up, she live designer plush\nStart lining up the coke so she could find a rush\nTime's up, she's about to turn 33\nHer shit started to sag, she got surgery\nNow cats are used to drive past her like a Church van\nActing on thirst, 'She Wants To Move' like a N.E.R.D. fan\nBigger house, 10,000 dollar purse fam\nShe let you in, she wanted rent by the 1st man\nShe the ring leader in a clique of birds\nAnd they shadowy, like the silhouette behind the curtain\n\n(Talib Kweli) (Pharrell)\nBroken glass - everywhere! (IT'S LOUDER!!)\nLouder - than a bomb shattered in in the air (IT'S LOUDER!!)\nTry to hold back your tears baby! (IT'S LOUDER!!)\nWait a second, what happens here baby? (IT'S LOUDER!!)\nBroken glass - everywhere! (IT'S LOUDER!!)\nLouder - than a bomb shattered in in the air, yeah\n(How many of y'all think you can do what we do?!)\nYeah! Wait a second (One! Two! Three! C'mon!)\n\n(Talib Kweli)\nShe was a small city girl with big city dreams\nNiggas try to figure how to get up in them jeans\nPut her in them scenes, get her on the team\nHit her wit the cream 'til they figured out the schemes\nNow she all up in the club looking for a new love\nReally like Huey Lewis looking for a new drug\nCause coke's getting old, started free basing\nGraduated to crack, smack on occasion\nNot catching the bus, but back at the station\nBack and forth pacing, acting all impatient\nLast hundred dollars, she got to 'Get By'\nNow gotta make a choice, go home or get high\nMommy and daddy miss her, she left for the fame\nNow what's left is the dirt that's thrown on her name\nShe need a ticket home if it's the right course\nInstead she bought a ticket to ride the white horse\n\n(Talib Kweli) (Pharrell)\nBroken glass - everywhere! (IT'S LOUDER!!)\nLouder - than a bomb shattered in in the air (IT'S LOUDER!!)\nTry to hold back your tears baby! (IT'S LOUDER!!)\nWait a second, what happens here baby? (IT'S LOUDER!!)\nBroken glass - everywhere! (IT'S LOUDER!!)\nLouder - than a bomb shattered in in the air, yeah\n(How many of y'all think you can do what we do?!)\nYeah! Wait a second (One! Two! Three! C'mon!)"}], "artist": "Talib Kweli"}