{"artist": "Iamsu!", "songs": [{"title": "Igloo", "lyrics": "[Hook: IamSu!]\nBaddest bitches call a nigga papi\nYo name Tati?\nWhat that shit do?\nWhat that shit do?\nWhat that shit do?\nI'm a cold nigga fuck you in a igloo\nSpanish bitches call a nigga papi\nYo name Tati?\nWhat that shit do?\nWhat that shit do?\nWhat that shit do?\nI'm a cold nigga fuck you in a igloo\n\n[Verse 1: IamSu!]\nHeartbreakers you know what it is girl\nOh you ain’t with it? What's up with yo sister?\nTake your girlfriend steal her like Pittsburg\nShe gave a young nigga brain and you kissed her\nUh, yeah, yeah, yeah, man I'm finna turn this thang up\nYou ain’t talking about money I’mma hang up\nThink twice before you bring a nigga gang up\nShit changed up since a nigga came up\nNow I ride around town with my bass up\nLike my girls the opposite of ass down face up\nHaters get your cake up\nWe gonna do it big 'till the lord take us\nNiggas say what HBK gang in this thang ho\nIn the range rove same colour mango\nYeah, baby you a star no spangle\nWe gone make this shit a movie fandango\n\n[Hook]\n\n[Verse 2: YG]\nNigga fuck you on the girl\nI don’t fuck with ugly hoes them bitches irritating\nThat position depends on the situation\nBitches all in my mouth like I'm a dentist patient\nI got a bitch that's Asian she like it from the back\nMy mama ask me how I get her cause I'm a fucking mack\nIn them jeans her ass look so fat, fat, fat\nBefore we fuck I’mma play with that cat, cat, cat\nOkay, you know my name, you know my name gang it's 400 you dumb nigga\nShe was fucking, that's the only reason I was fucking with her\nYeah, I love my niggas, know that I love my click\nI be fucking bad bitches man I love my dick\nI hold the city down make a real shit\nHaters on my head, I just hit the kill switch\nI be in the streets where it gets real sick\n4 minutes with me girl that's like a field trip damn\n[Hook]\n\n[Outro: IamSu!]\nI'm a cold nigga fuck you in a igloo\nTell me what it do, what it do\nTell me what it do\nI’m a cold a nigga fucking in a igloo\nHBK Gang nigga", "image": "https://images.genius.com/94c484dd53fbf3343ecc1dd8d0aeb8c5.600x600x1.jpg", "album": null, "year": "2011-10-28"}]}