{"songs": [{"album": "Funk Flex Freestyles", "image": "https://images.genius.com/245f4bc41f8d423fa59b932bdeaf60e5.719x719x1.jpg", "year": "2017-04-28", "title": "Tee Grizzley Freestyles on Flex | Freestyle #057", "lyrics": "They still prayin on my downfall\nI know they prayin on my downfall\nFrom the yard to the streets,imma stand tall\n500 hundreds on me now, show em how to ball\n30 on the Rollie just to shine on the Flex show\nThat ain't shit, I'mma make it back off the next show\nIn my sleep sweatin, brother like \"bro, what you stressed for?\"\nI'm breathin hard, like I had a dream I was back broke\nBay Area, LA, you know thats like my next home\nLexington, Louisville niggas treat me like I'm back home\nWhole Midwest, I rep it all, thats my backbone\nComfortable, but not enough to be without that strap on\nYou know these niggas waitin on that\nI got some family and enemies prayin on that\nHad somebody steal from me, you can't play me like that\nCuz, I wanna see some blood, ain't no payin me back\nHit his baby mama, shoulda kept the bitch from near me\nGot some money, but that poverty still fuck with my spirit\nCouple niggas was slippin, we coulda killed em\n\"Let em live bro, it's gon kill em to see us winnin\nI been workin hard, can't you see the ice?\nI been goin' hard, can't you see the stripes?\nReal nigga shit, I never thought this would be my life\nI ain't even think I'd make it to 23, alright?\nBut that Wraith still comin this summer\nAnd imma still let yo bitch drive it\nThese niggas can't give me no pointers\nCause they talk it but they don't live by it\nI done missed the last 12 seasons\nCame back like I ain't missed a beat\nBeen blowin through these hoes, I ain't miss these freaks\nPussy nigga, I ain't miss the streets, the streets was missin me\nJoy Road bitch, but the money long as 6 Mile\nBrick Mile, hit yo bitch\nWhen you call, imma answer like \"come get this bitch\"\nNigga you a target\nYall harmless\nWe heartless\nKeep my mouth closed like the Capanella apartments\nMade it out my city but I still be on Harper\nStill be on Joy Road\nI still be on Chalmers\nAin't make it off parole, I still gotta go to Laughton\nHe tryna squash the beef, but niggas know it ain't no talkin\nBeef? Excited us, we did that for sport\nAin't thinking 'bout no hustle\nWe ain't got it bitch, we poor\nCouldn't leave my hood, now I'm fuckin' with New York\nBlew up off a song that ain't even have a chorus\nWhen I talk, they hear the streets\nThey like \"Tee, give em some more\"\nFree my little brother, I'mma scream it till I'm hoarse\nDetroit, don't panic, I'mma open up them doors\nAnybody try and stop the plan bro, its war\nNigga ahh"}], "artist": "Tee Grizzley"}