{"songs": [{"album": "The Power of a Woman", "image": "https://images.genius.com/d77d878b0b06e34fca168968761d7e0a.600x600x1.jpg", "year": "1990-01-01", "title": "Swingin’ Wit T", "lyrics": "[Intro: Tairrie B]\n\"Quincy D, my mellow, my mentor, my man\nWhy don't you rock that beat\nSo they can jock this jam?\nTairrie B's at bat, I rap, I don't sing\nThe beat is a pitch, so let's swing\"\n\n[Verse 1: Tairrie B]\n\"Swingin' Wit T\" is the title of my jam\nWith the mic in hand yo, you can call it slammin'\nSmooth, like the groove that's rockin'\nI'l bust a move on a man but never jock him\nSock him, if he gets outta hand\nWhy? Cause Tairrie B's the one in command\nAnd i'm flowin', throwin' down to a dope sound\nSuped up by snoop underground\nIs how we do it, so the suckas can't find it\nMe and D, we're funky dope minded\nSo when you see us steppin' up on the set\nYou play the back, .jack, or you jet\nLike a bomb that's tickin' ready to explode\nT's cold kickin' ready to unload\nAnother episode, with the posse clique\nLike a Saturday matinee, Mae West flick\nI push it, punch it, pump it with poise\nPlug the mic and belt, bump it boys\nSo bring the noise it's time to do dustin'\nSwing the rhyme and I'mma keep bustin!\n\n[Verse 2: Tairrie B]\n[Sample?] is what the critics say about me\nSo all you punk little suckas that doubt me\nGet real and let me tell ya the deal\nA female emcee tryna get with me\nShe'll get slapped with the rap that I recite\nLadylike, left to right back and forth on the mic\nCause I'm an emcee, not a singer or actress\nDroppin' method on the track and the fact is\nI wear sweats not a stone washed wack dress\nAnd my man Schoolly D well he back's this doll\nCause I'm the gangstas moll\nSwingin' ya the femme fatale roll call\nMartinez is the manager my girls are hype\nI'm the emcee yeah you got that\nSo if you wanna swing you came to the right dame\nThe female mob boss\nTairrie B's the name!\n\n[Verse 3: Tairrie B]\nNow when you're 'Swingin Wit 'T'\nYou're with the rap sex symbol\nWrapped around my finger like a ring or a thimble\nI'm a diamond cause they are forever\nOn the mic my rhymin's on time and I'll never\nStop or get dropped lookin' like an Athletic\nI look so good the others look pathetic\nThey need a medic\nCause they soft and they can't hang\nSo just step off sucka it's my thang\nAin't about white or black, fact\nThe 'T' is in tact and the B is the backbone\nKnown and prone to get busy\nLeave the men dizzy like Monroe in her time\nBut in the 90's 'Gentlemen Prefer Rhyme'\nLos Angeles get with this\nAnd NYC, why even try to dis?\nIt's where you're at and not where you're from\nSo when you're 'Swingin wit 'T' you get none!\n\n[Verse 4: Tairrie B]\nWell if you missed my rhyme punk better by the book\nRappin' comes from the mind and not from the look\nSo when you look my way, word to the mother...\nDon't judge the book by the cover\nNo other woman can rock the way I do\nSo consider yourself just confide to\nCold housin' the joint and I'll slide you\nTo a point where others just tried to\nNever run outta breathe cause I'mma a pro at..\nSwingin' def lyrics, but you know that\nNot the type of girl that other girlies wanna battle\nI get amped, trample tramps like cattle\nAnd then, I ride away side saddle\nAnd yo, that'll be the end of the battle\nAs you stand there sprung with that look on your face\nThat says damn...\nTairrie B swung the place!\n\n[Outro: Tairrie B]\n\"Yeah, we swinging in 9-0\nJust like Jose Canseco\nAin't that right Joe?\nStop the show\""}], "artist": "Tairrie B"}