{"artist": "Preme", "songs": [{"album": "Dear America", "title": "DnF", "image": "https://images.rapgenius.com/446989a9ae7b6b4aa224a2f3cd8affbc.500x500x1.jpg", "lyrics": "[Intro: P. Reign]\nP. Reign! Reps Up!\nYeah, yeah, yeah, yeah\n\n[Hook: Drake & Future]\nMore rest and sex is all a nigga needs\nIn a lifetime of stress tryna put my mind at ease\nI'm not lookin' at the phone, too much shit been goin' on\nBut while we got this moment of peace alone, girl\nWe should just get\nDrunk and fuck, drunk and fuck, drunk and fuck, drunk\nGirl, we should just get\nDrunk and fuck, drunk and fuck, drunk and fuck, drunk\n\n[Verse 1: P. Reign]\nLife is great when you’re naked, you press the gas and I break it\nI drink liquor don’t chase it and I get women don’t chase ‘em\nI’ll put her face in the pillow and watch her bite on the blanket\nSee you tempted to taste it, get every drop and don’t waste it\nI’m fucking with you, I’m fucking with you\nThe type of dick to make that white girl say ‘’I love that nigga’’\nI’ll hit your Instagram and click like on like every picture\nYou get it from your momma? Well then bring ya momma with ya\nAnd lots of liquor\nTell her \"fuck me like you hate me,\" \"You love me?\" I said maybe\nShe said \"boy don't keep me waiting\"\nAnd I say \"go down, don't be lazy\"\nYeah, now that's my baby, that's my baby\nShe love me for my drive, I love her cause she drive me crazy\nWhat's up?\n\n[Hook: Drake & Future]\nMore rest and sex is all a nigga needs\nIn a lifetime of stress tryna put my mind at ease\nI'm not lookin' at the phone, too much shit been goin' on\nBut while we got this moment of peace alone, girl\nWe should just get\nDrunk and fuck, drunk and fuck, drunk and fuck, drunk\nGirl, we should just get\nDrunk and fuck, drunk and fuck, drunk and fuck, drunk\n\n[Verse 2: Drake]\nOVO I ride, OMO I ride\nReps Up, them my niggas from the Scarborough side\nDon’t fuck with them, or hollow tips will fly\nI don’t have to lie\nLot of people say it in a song just to say it\nMan, I’m not that type of guy, hit me on the cell\nI just might bring you to the city\nSend you home with stories you can never tell\nI’m tryna break you out of your shell (And what?)\nYou just turned 21 like Adele, that’s good with me\nI put my business on hold\nLet me turn off the phone, let’s explore the unknown\nIf you not drinking with me, you force me to turn up alone\nNo peer pressure, I just know you like to get in your zone\nYou say that you’d rather smoke, well, let me call up OB’s room\nAnd tell ‘em roll up a cone\nI know he probably got that extra special (yup)\nI never second guess it\nHow's Villanova? What classes you taking next semester?\nMan, she like, \"Fuck the small talk\nI’m not here to discuss extra credits or my professors\"\nNo time for funny stories\nIt’s funny how she shows up late, but always comes before me\nWe both young and misguided, but that’s another story, yeah\n\n[Hook: Drake & Future]\nMore rest and sex is all a nigga needs\nIn a lifetime of stress tryna put my mind at ease\nI'm not lookin' at the phone, too much shit been goin' on\nBut while we got this moment of peace alone, girl\nWe should just get\nDrunk and fuck, drunk and fuck, drunk and fuck, drunk\nGirl, we should just get\nDrunk and fuck, drunk and fuck, drunk and fuck, drunk", "year": "2014-08-24"}]}