{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/654caba7c794fe0ca96931118286b131.514x514x1.jpg", "title": "Censoring Myself for Success", "lyrics": "HERE is a story about fame. I heard it first as a fable in Somalia, before living it out in America.\n\nThe fox, they say, once had an elegant walk, for which the other animals loved him. One day, he saw a prophet striding along and decided to improve on what was already beautiful. He set out walking but could not match the prophet’s gait. Worse, he forgot his own. So he was left with the unremarkable way the fox walks today.\n\nRight now, the pressures of the music industry encourage me to change the walk of my songs. When I write from the deepest part of my heart, my advisers say, I remind people too much of Somalia, which I escaped as a boy. My audience is in America, so my songs should reflect the land where I have chosen to live and work.\n\nThey have a point. A musician’s songs are not just his own; he shares them with an audience. Still, Somalia is where my life and poetry began. It is my walk. And I don’t want to lose it. Or stifle it. Or censor it in the name of marketing.\n\nI first saw censorship as a child in Mogadishu, walking into my home’s courtyard one day and hearing a radio hushed nearly to silence. The adults hovered around, listening to a song. And I asked why one song had to be played at a whisper while another could blast through the house.\n\nA war was going on, I was told, and some songs had meanings the government did not want deciphered. Those “anti songs” were different from love songs, or folk songs. You had to take care in dressing the words. In love songs, words could preen in bright colors; in anti songs, they attacked in camouflage. And from that, I got a hint of the power of lyrics — to encapsulate magic, or to spread alarm.\n\nNow I have recorded three albums. A few days before I was to record the third, which was released in October, I received a phone call saying my record label wanted a little talk — before the songs were written. (I like to write in the moment.) For the first two albums, there were no such talks. But that was before my name was familiar. So let me start my story there.\n\nIn 2005 I found cheap recording space and sang about the killing ground of Somalia:\n\n“We begin our day by the way of the gun... you don’t pay at the roadblock you get your throat shot... I walk with three kids who can’t wait to meet God lately, Bucktooth, Mohamed and Crybaby.”\n\nIn 2008, with a recording budget, I went on my own to Jamaica, to Bob Marley’s old studio, and sang of a lovely, doomed young friend:\n\n“Fatima Fatima, I’m in America, I make rhymes and I make ’em delicate, you woulda liked the parks in Connecticut... Damn you shooter, damn you the building, whose walls hid the blood she was spilling, damn you country so good at killing, damn you feeling, for persevering.”\n\nThat was my truest voice — my continent’s angst in a personal story. When I sang, my audience wouldn’t just hear music; they would see geography. And yes, it made me well known.\n\nWhich brings me to our little chat. Over breakfast in SoHo, we talked about how to keep my new American audience growing. My lyrics should change, my label’s executives said; radio programmers avoid subjects too far from fun and self-absorption.\n\nAnd for the first time, I felt the affliction of success. When I walked away from the table, there were bruises on the unheard lyrics of my yet-to-be-born songs. A question had raised its hand in the quiet of my soul: What do you do after success? What must you do to keep it?\n\nIf this was censorship, I thought, it was a new kind — one I had to do to myself. The label wasn’t telling me what to do. No, it was just giving me choices and information, about my audience — 15-year-old American girls, mostly, who knew little of Somalia. How much better to sing them songs about Americans.\n\nI also learned about the difference between Top 40 radio audiences and adult contemporary; between A.C. and urban. And between those and no radio play at all. (Which, for a second, made a voice inside me say with horror: “Hey, that’s me! I am Option C, no radio play at all.”)\n\nAnd there I was, trembling between doubt and self-awareness. I had started at Option C, striving to make (and please allow room for grandiosity here) my own “Natty Dread” or my own “The Times They Are a-Changin’ .” But now, after breakfast, another voice was there, whispering how narrow the window of opportunity was.\n\nI could reach more people, it told me. Was it right to spit in the face of fortune, to not walk in rhythm with my new audience? Didn’t all good medicine need a little sugar before it could be swallowed?\n\nSo I began to say yes. Yes to trying out songs with A-list producers. Yes to moving production from Kingston to Los Angeles. Yes to giving the characters in my songs names like Mary.\n\nSo some songs became far more Top 40 friendly, but infinitely cheaper.\n\nOn my second album, I had sung about my mother’s having to leave my cousin behind in Somalia’s war — “How bitter when she had to choose who to take with her...” Now I was left, in “Is Anybody Out There?” — a very American song about the evils of drugs — with only “His name was Adam, when his mom had ’im.”\n\nThe first felt to me like a soul with a paintbrush; the other a body with no soul at all.\n\nSO I had not made my Marley or my Dylan, or even my K’naan; I had made an album in which a few genuine songs are all but drowned out by the loud siren of ambition. Fatima had become Mary, and Mohamed, Adam.\n\nI now suspect that packaging me as an idolized star to the pop market in America cannot work; while one can dumb down his lyrics, what one cannot do without being found out is hide his historical baggage. His sense of self. His walk. I imagine the 15-year-old girls can understand that. If not intellectually, perhaps spiritually.\n\nI come with all the baggage of Somalia — of my grandfather’s poetry, of pounding rhythms, of the war, of being an immigrant, of being an artist, of needing to explain a few things. Even in the friendliest of melodies, something in my voice stirs up a well of history — of dark history, of loss’s victory.\n\nSo I am not the easiest sell to Top 40 radio. What I am is a fox who wanted to walk like a prophet and now is trying to rediscover its own stride.\n\nI may never find my old walk again, but I hope someday to see beauty in the graceless limp back toward it."}], "artist": "K’naan"}