{"artist": "Fashawn", "songs": [{"year": "2012-11-20", "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Verse 1: Fashawn]\nThis is for my A listers, bench dropping\nWindows tinted wonder who inside it\nMovie star, social lights, coke sniffing\nYou know the life in the club\nVIP no fee, look on the house and you get in free\nTFKs, Paris Hilton's parents pay hell a millions\nThe high archi of Hollywood\nDon't let it affect your lovely hood\nEasy to get blinded by the lights\nDon't believe the hype, protect your sight\nYou'll be signing autographs from left to right\nYour fifteen minutes is up, now what?\nSign that contract, now you stuck\nYour fifteen minutes is up, good luck!\n\n[Hook]\nSome people try so hard, to be a movie star\nThey forget who they are\nBefore you know it they'gone\nSome people try so hard, to be a movie star\nThey forget who they're are\nBefore you know it they'gone\n\n[Verse 2: Fashawn]\nCame to Hollywood with a dream in hand\nOf motion pictures the same attentions\nAs a milgram other kids start famous instant\nCouple things they forgot to mention like\nEverybody is your competition\nMoving too fast, should have stopped and listen\nBut he lost that popularity\nAn average Joe, he don't care to be!\nEveryone thinks it's so easy\nBeing told that repetitively\nIt's far from that stardom\nThe media betrays on a TV screen\nBack stabbers, smiley faces\nYoung hot shot could be your replacement\nHow it is in the business of entertainment?\nLife down with the young rich and famous\n\n[Hook]\n\n[Verse 3: Fashawn]\nI could be gone in a wind, do I stand a chance?\nCould be number one then change your plans\nDisappear quicker than a hundred grand\nReminiscent when I was the man\nSeems as if someone's story shine\nThese days you gotta wait in line\nJust a year ago everything was fine\nThey had no problem lettin' you inside!\nThe transformers, not the personnel\nMaybe you need a little bit outrageous style\nWhen we get the new Benz hit Mr. Charles\nRight back in the in-crowd\nYour agent's happy, your friends are proud\nWhen you wasn't popular, none of them was around\nNever there when shit goes down\nAlways there front row in the crowd\nCheering behind your back they all frown\nHard to tell who's real who's fake\nDon't let the alphabet decide your place\nIs the most hot, who designed are fate\nSo people gonna try to eat off your plate\nAnd before you know it, it's too late!\nAll your money is gone, are you stuck?\nYour fifteen minutes is up, good luck!\n\n[Hook]", "title": "Stardumb"}]}