{"artist": "Anybody Killa", "songs": [{"title": "Gang Related", "image": "https://images.genius.com/0ef45eaaeeb6c906ab411eeb71f61222.800x800x1.jpg", "album": "Hatchet Warrior", "lyrics": "[Violent J] Gangsta?\n\n[Anybody Killa]\nNow if you got yo hat tilted to tha side\nAnd you always down to jack a bitch for her ride\nOr the colors that you rep make others upset\nThen you might be.. GANG RELATED! (Ain't nothin' wrong)\n\n[Verse 1: Anybody Killa]\nNever once been seen alone\nEver since you can remember you was fully grown\nSlangin' rocks on tha block with a knot in ya sock\nThen you might be..\nGANG RELATED! Murder rap\nNotches all in your belt\nRobbery and sellin'\nTrees the only jobs that you held\nBeen to more damn funerals than the reverend himself\nThen you might be..\nGANG RELATED! In and out tha penitentiary\nWith no thought of graduation or a fuckin' degree\nStill clockin' \"G\"s from what you learned on tha streets\nThen you might be..\nGANG RELATED! (Ain't nothin' wrong)\n\n[Chorus: repeat 2X]\nYou might be.. (What!? what!?)\nYou might be gang related!\n\n[Verse 2: Violent J]\nDo you wear a hatchetman? You in a gang\nAnd yo ass better be ready to do that thang\nYou rep tha JRB and you will never switch\n(JRB?) Juggalo Rydas Bitch!\nDid you beat your girlfriends who dissed your boys\nDid your crew's name originate in Illinois?\nDo you cross your enemies out with a \"K\"\nThen you gang related to muthafucka like Violent J\n\n[Anybody Killa]\nI'm always asked if I'm gang related\nBy police and the public and I'm startin' to hate it\nIf I wasn't already that would sure make me think\nAbout the problems that I have and what I'd do to be free\nBesides gang related's such a harsh word\nFor them to call a bunch of homies takin' over tha world\nWillin' to die for everything that we built\nThe battleground we call turf where haters come to be killed\n\n(Chorus 4X)\n\n[Violent J]\nDo you participate in gang related activities?\n03's, 211's, 187's?\nIf you do that's okay, fuck we all do\nI'm only tryin' to say you gang related too bitch!\nTake Anybody Killa\nI know him but I wouldn't trust him as far as I can throw him\nHe's fuckin' crazy as hell\nYou wouldn't know\nRight now he's chewin' holes in the floor here at the studio\nI don't even want to do this\nBut he asked me to and I'm scared of his pistol-whips\nWe're all sick in the hatchet's hatchery\nBut I just happen to be the master bitch-slappery\nThe bottom line, I won't say it again until you play it again\nIf you're gang related hope you're my friend\nCause if I see you wearin' some shit I don't like\nI'm shuttin' your cranium down with a lead pipe\n\n(Chorus 4X)\n\n[Shaggy 2 Dope]\nAh ha\nHa ha\nHa ha ha! You know what man? You just might be!\nIn spite of your own knowledge of 'em\nA gangsta, gangobodacious, smacksimus\nMaximum boogie woogie ryda AKA gang related\nYou dilapidated muthafucko!\n\n(Chorus continuously)\nYou might be...\nYou might be gang related! (Ain't nothin' wrong)\n\n[Violent J]\nYou fuckin' gangbangulator!", "year": "2003-04-08"}]}