{"songs": [{"year": "2010-11-12", "album": "G.O.O.D. Fridays", "image": "https://images.genius.com/d272cd908044a0352cc27c2ad57baa3a.747x746x1.jpg", "title": "Chain Heavy", "lyrics": "[Intro: Kanye West]\nUh, we got the black elite in the house tonight\nRosewood\nI feel like I'm at the NAACP or something right now\nThe Essence Festival\nQ-Tip on the beat too, uh, uh\n\n[Chorus: Kanye West]\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\n\n[Verse 1: Kanye West]\nThey try to tell me my chain broke the levee\nMaybe 'cause it's flooded\nWhy you walk around with a baby cross's cousin?\nMy teeth already white, y'all gon' make me floss for nothing\nMy teeth real diamonds, what's the cause of the frontin'?\nWhy y'all got all caps on?\nDon Cheadle time, get extra black on 'em\nBurn, Hollywood, burn\nTake too long for niggas to get they turn\nProbably be cremated before I get my earn\nThey try to tell me that aliens built the pyramids\nI swear life's a bitch on her period\nFor every inch they cut the nose off the Sphinx\nI make my jeweler add a few more links\nYou can look at me, tell I ain't fuck what nobody think\nAnd my face always lookin' like somebody stinks\n\n[Chorus: Kanye West]\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\n\n[Post-Chorus: Kanye West]\nHere we go, like we should\nFeel the sweat, on your face\nHere we go, like we should\nFeel the sweat, on your face\nAlright, okay\nHere we go, like we should\nLike we should, like we should\nLike we should\n\n[Verse 2: Kanye West]\nQuestion:\nWhat color was the skin of the man who beared the cross?\nNo matter how many lashes, they couldn't beat it off\nHow many Cassius' will we see in one lifetime?\nThat's why it's Miles Davis, Kobe, it's Mike time\nI keep that GOAT book on the ottoman\nAnd wrote hooks about slaves that was slaughtered\nIn the 1800s; y'all forget that\nI got called \"nigga\" on Twitter so many times, yo, I lived that\nNow I'm just tryna find where to raise my kids at\n'Cause they don't want niggas next to where they crib at\nHey, realtor, I'm lookin' for a nice park\nTwelve noon, she said my family gon' make it too dark\nThis is the flow that solar eclipses\nSo hopefully one day that real soul will eclipse\nThe bullshit they got us listenin' to, in this existence\nDon't give up now, just a little more persistence\nI am the day Ice Cube met Michael Jackson\nKeep 'em away, hanh! Something might happen\nThis is the makin' of a masterpiece\nSo we broke out the chains and told the master, \"Peace!\"\n\n[Chorus: Kanye West]\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\n\n[Post-Chorus: Kanye West]\nHere we go, like we should\nFeel the sweat, on your face\nHere we go, like we should\nFeel the sweat, on your face\nAlright, okay\nHere we go, like we should\nLike we should, like we should\nLike we should\n\n[Verse 3: Talib Kweli]\nSome wear a suit and tie, they don't wanna remain average\nSome wear a suit and tie like a chain and a straitjacket\nMy chain heavy, stop in that traffic, coppers harass us\nThen DA attack us, want us in chains like B.A. Baracus\nSo no major factor in my decision to be a rapper\nWas rebellion; being anti-establishment was attractive\nTo a black kid from Brooklyn, flames got the thangs cooking\nLand of the juks where them lames get them chains tooken\nIt ain't lookin' good for you if you're a tourist here\nSometimes I rhymes the sort of frequency that only purists hear\nA couple rappers tried to beef with me, nobody's scared\nNiggas was so fucking corny that nobody cared\nWhy I gotta battle rappers? I debate scholars\nQuestion: do it gotta make sense if it make dollars?\nSick visions is living inside of brains\nIt's like we sadomasochistic, addicted to whips and chains\nFiguratively, quite literally, clinically insane\nSpit flames and then visit the higher plane\nTry in vain to ignore it, don't buy the chain if you can't afford it\n'Ye, them lonely-idled whores by the boards, trust\n\n[Verse 4: Consequence]\nThat old ball-and-chain had me chained up for weeks\nSo of course I'm off the chain as soon as I hit the streets\nAnd now when we link she saying the game's over\nI drove her crazy and she became a chain smoker\nNow the new dude she's saying that can stay over\nShould be a chain, who goes by the name of Choker\nThat's what he did when she told him he should play the sofa\nSo the chains on the door, I'm on the way over\nNow when I came over, his only response\nWas, \"You must be the owner of a chain of restaurants\n'Cause I'mma eat your food for that chain that I wore\n'Cause you be running 'round like the chain make the man\"\nSo it's obvious the he don't know the chain of command\n'Cause my chain commands, that kind of respect\nAnd it's so chunky that it's a pain in the neck\nBut it came with a check, I remember on chaining day\nIt spoke for itself and this is what the chain would say\n\"Them chain snatchers are hoping that you ain't ready\nSo don't get distracted, keep your aim steady\nOr there'll be a chain reaction since my chain's heavy\"\n\n[Chorus: Kanye West]\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\nMy chain heavy, yeah, yeah, my chain heavy\nMy chain heavy, my chain too heavy\n\n[Post-Chorus: Kanye West]\nHere we go, like we should\nFeel the sweat, on your face\nHere we go, like we should\nFeel the sweat, on your face\nAlright, okay\nHere we go, like we should\nLike we should, like we should\nLike we should"}], "artist": "Kanye West"}