{"songs": [{"image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg", "title": "Fried Chicken", "album": "Untitled", "year": "2008-07-15", "lyrics": "[Intro: Nas]\nUhh, Lord, Lord, Jah\nWhat I'm gon' do?\nUhh, schhh, Lord, Lord, Jah\nHahaha, shit is all true\n\n[Verse 1: Nas]\nMmm, fried chicken, fly vixen\nGive me heart disease but need you in my kitchen\nYou a bird but you ain't a ki'\nGot wings but you can't fly away from me\nDriving in your bucket seats, all the way from Kentucky to fuck with me\nLook what you done to me, was number one to me\nAfter you shower, you and your gold medal flour\nThen you rub your hot oil for about a half an hour\nYou in your hot tub, I'm looking at you salivating\nDry you off, I got your paper towel waiting\nLay you down cause you're red hot\nLouisiana style you make my head rot\nThen I flock to the bed then plop, when we done, I need rest\nDon't know what part of you I love best\nYour legs or your breast\nMrs. Fried Chicken, you gon' be a nigga death\nCreated by southern black women to serve massa' guest\nYou gon' be a nigga death\nMrs. Fried Chicken, you was my addiction\nDripping with high cholest-\nLike Greeks with his falafel, Italian with his tomato pasta\nWhat roti is to a rasta\nTrapping me, you and your friend mac' and cheese\nCandy yams, collard greens but you knocking me to my knees\nIt's killing me when I'm inside, nothing I need more than a fish fry\n\n[Verse 2: Busta Rhymes]\nShit, it taste good, I can't lie\nIt's like you're walking out the tanning salon\nWhen I pull you out the oven from baking, I got you on my mind\nRubbing that sun tan lotion all up over your body\nSo amazing how you sparkle when I glaze you swine\nHey, my pretty ham hock\nIt's so feminine the way you submitted and how you gave me power\nTo massaging me to shower you with lemon water\nMarinate you with seasoning and dipping you in chowder\nBaby it's like you at the spa the way you gently lay in the pan\nWhile enjoying your butter milk treatment\nI sit and watch the grease sizzle bubbling on your skin\nDespite the funny fragrance, still I lick my finger frequent\nIn any event, I'm reflecting on all the signs\nThat I got saying that I shouldn't fuck with you\nBut the way you that you would taste made you hard to resist\nWhen I put my mouth on you but that's another issue\nButterflies up in my stomach, when I laid eyes on you\nOr was it infection manifesting?\nConfused over the feeling, impatiently eating you\nTrichina worm chewing on the wall of my intestine\nI'm a eat you 'til there's nothing left\nUntil my very last breath, you gon' be a nigga death\nDespite I prepare it the best\nAnd specialize in cooking swine as a chef, you gon' be a nigga death\nWho cares if the swine's mixed with rat, cat and dog combined?\nYes, I'ma eat the shit to death\n\n[Outro: Busta Rhymes]\nAin't that some shit?\nI'ma eat some shit until what I'm eating kills me\nAnd I choose to do that, why?\nCause that's just what niggas do, hahahahaha"}], "artist": "Nas"}