{"artist": "Inspectah Deck", "songs": [{"title": "I.O.U.", "lyrics": "\"Maybe I owe you something\"\n\n[Inspectah Deck]\nI'm not the champagne dinner time, spend the night, dim the lights\nMore like the boots on, sex you right, bet ya bike\nShe said, don't stop, daddy, make my boat rock\nWhoa ma, you so hot, let me that row drop\nAhh yeah, get it girl, ready, switch position, girl\nDoggystyle, rip ya curls, make that body, twist and twirl\nWork it out, it's your world, know that I don't lick the pearl \"Maybe I owe you something\"\nAnd I can too collect it, I don't except no credit\nHere's how you clear ya debit, slide out the skirt and set it\nMami already naked, ready and fish netted\nI'm bout to work you breathless, I try not to hurt you precious\nFirst let me roll the purple, then I return to serve you\nFor you, like you deserve to, the fire burn eternal\nLater she hook the plate up, hoping that I would stay but \"Maybe I owe you something\"\nShe be doing it, doing it, doing it well\nAnd she was doing just fine, til she blew up my cell\nI ain't fronting, I'm still checking, she a beautiful belle\nShe like, roleplaying, got a jungle room at the 'tel\nShe the type that have you creep nights, and fucked up your home\nWhen it comes to that man shit, you stuck on your own\nI know you game me all your love and got nothing to show\nBut yo \"Maybe I owe you something\"\nShe gleam with the latest on, jeans look painting on\nI pushed up crazy strong, grinding to a reggae song\nWe broke at the break of dawn, blazed on the neighbor's lawn\nI gave 'em all, later on, and skated cuz my paper called\nStagged off the peach Snap', damn son, I beast that\nShorty she a free stack, where do they teach at?\nPlus she got the deep cat, know I had to creep back \"Maybe I owe you something\"\nJust name a spot or place, make sure you rock your lace\nWhatever, stockings, hey, it don't matter, you're hot as plain\nHer nigga's locked away, that's why she out to play\nI tell her \"not today\", and she ready to cock and spray\nShe do what poppa say, and I ain't got to say\nAnd all she say is \"let me ride\" like she Dr. Dre\nOne day she flip the script, told me I got to pay \"Maybe I owe you something\"\n\n[Outro: Inspectah Deck]\nWe don't shred no paper, we don't even get down like that\nYou looking hot and all that mami, but you know\nWe just blow the back, get it smacked, and that's that\nAnd it's a wrap.. you dig? I'm still checking for you though\nHahaha, I.O.U. \"Maybe I owe you something\"", "image": "https://images.genius.com/b594b451e76ffa06266ec5bb5611cfd9.500x500x1.jpg", "album": "The Resident Patient", "year": null}]}