{"songs": [{"year": null, "image": "https://images.genius.com/ce0c7f002d95c6699740803862bdb51c.500x500x1.jpg", "title": "If The Sky Falls", "album": "The Midwest Cowboy", "lyrics": "[Hook: Heaven]\nIf the globe stops spinnin and the sky falls down\nAnd the wall on the mountain and the trumps make sounds\nWhen the hands stop tickin and the holes rotten\nAnd the sails get broken you'll all be down\n\n[Interlude: Bizzy Bone]\nYeahhh, gimme that water baby\nIt's gonna drive me crazy, better watch yo' back here playa\nYeahhh, gimme that water baby\nIt's gonna drive me crazy, better watch yo' back here playa\n\n[Bizzy Bone]\nStuck in the game, passin the flames on these lames\nNever could fade me, enter my wall of shame\nHotter then lava, and the sound of the kitchen cajan mayne\nMaintain the main thang, blame, it is a mystical frame\nEnter the circle, exit quicker than aim\nSlums up in the barrio, baby I guess I'm a bum, hey\nCome for me momma, it ain't nothin but legitimate rhyme skills\nAnd baby as we represent the one all the way\nIn the circumference, dunn-dunny gimme the money\nHun-ga-ry motherfuckers, say what? I'm still sunny\nBizzy he does it, what was it? What is it?\nHittin 'em harder in the bank, inquisitive with the straight saints\nDaintily in the ain't, is followin the bears\nInquisit me, is you crazy? I know you know what it is\nIt's just a starter, if I'm a martyr, give me my paper\nKnee-deep like sheep, these wolves, they can't escape us\nOne time\n\n[Hook] + [Interlude]\n\n[Bizzy Bone]\nHolla back, you gimme the rhythm, I hit 'em up in that Ac'\nAnd I hit 'em up in that back, if need be, the mac\nSlack? Never, put it on the 12th of September\nYou better get everything you need, remember - one time\nBaby boy feelin the clout, gimme the music properly\nYes, I'm God's property, monopoly, who gonna stop me?\nNobody, gettin in 'em, we winnin, seein the women\nVenomous in the minimum, baby boy as we sendin 'em\nEndin 'em in the beginnin, renderin what they want\nBut I don't pay no fuckin taxes, I only smoke up the blunt\nAnd I don't have time to front, you're rollin with me well let's move\nWe duck the funerals, the usual, Bizzy let's groove\nOne time\n\n[Hook] + [Interlude]\n\n[Bizzy Bone]\nSecular, molecules protectin us, brain waves respectin us\nPunk motherfuckers, they ain't connectin us\nRecollectin us and we bust, in God we trust\nAnd the plus, I got a mission, precision listen to us, trust\nIn the imperial, water floatin and flowin\nGet it up, uptown all around, they not knowin\nSkyline, high line, I sign this\nGive me my money motherfucker I'm pissed\nOne time in the apparatus, no status, no Gladys\nOnly the pimps, no simps, we still rappin\nKeepin it movin for me, no nuts, no glory\nNo to headstrong, scary story, that purgatory\nI said it's ore-y or we eerie, do you hear me much clearly?\nThe streets in the direction and real people can feel me\nSaid it's ore-y or it's eerie, do you hear me, much clearly?\nStill in the direction and real people can feel me\nOne time\n\n[Hook]\n\n[Interlude] - repeat 2X"}], "artist": "Bizzy Bone"}