{"songs": [{"image": "https://images.genius.com/af3fee028852ee66125272c3c7325df4.600x600x1.jpg", "lyrics": "[Intro]\nHello, my name is Mac Lethal and thank you for your purchase\u2028This album is best served with a delicious glass of Grand Crew or Wild Flemish for all you top-shelf beer drinkers out there\u2028Irish Goodbye begins now\u2028I'm back!\n\n[Verse 1]\u2028Hey!\u2028Imma punch the ceiling 'til it rains blood\u2028I'm yelling 'Kill 'em all!', killin' in the name of\u2028How many people here have ever heard of Ludicrous? Huh\u2028How many people here have ever read Ulysses?\u2028See, I don't feel alive until my heart rate doubles, till the hard bass\u2028Crumbles every single wall\u2028I'm freshly single, y'all\u2028An unnamed actress gave me her cellphone number\u2028I never even called\u2028And Kansas City in my king sized bed\u2028Hoping that the parasites don't eat my head\u2028I'm feeling so tortured, so sorted, post mortem\u2028My brain opens up and blossoms like a ghost story\u2028I used to be the class clown\u2028Now I feel like I'm the goddamned professor at the circus\nSoaking every sector of my opiate receptors\nWith the potency aggressive from the never ending surplus\nMy circuits are a little out of service but I work for every little lavish purchase\nIt's perfect\nDepending upon the verdict\nMove forward if you're sure that continuing on is worth it\nThen work it\n\n[Bridge 1]\nSee Lethal Phil got my back and you that Black Clover got my back\n(Black Clover for life, biotch !)\nKansas City got my back and the whole Midwest got my back\n(Midwest!)\n\n[Hook 1]\nBlack Clover is an army, better yet a family\nAnd every day is Halloween, ring the doorbell if you want some candy\nAnd BCR-4L\nEvery lifetime member understands me\n\n[Verse 2]\nI swear to god I'm like a fiscal libral\nSolve a problem, Get a pencil\nHave a problem? Get a pistol\nNowadays you don't need books just get a kindle\nAnd people snorting 'Yeah, Yeah, Yeah' like Mr Windle\nShit, they tell me that I'm spitting like an old fool\nThese little kids think 50-Cent is old-school\nThey try to question my credibility\nBitch I was killing shit way before the Internet and Pro-Tools\nI think it's childish, they think that Ice-T and Ice Cube were actors that never got violent\nI keep it Irish\nI keep it smart\nSo permanent, bleeding heart, conservative\n[?]\nDon't cringe I'm just scrubbing off your third iris\nThe sickest, the flyest; bird virus, word virus\nWilliam S. Burroughs\nPlaying William Tell with his wife with the aim so thorough\n\n[Bridge 2]\nMy homie Sevin got my back and you know Astro Black got my back\nThe Riot Room got my back and you know DJ Skew got my back (DJ SKEW!)\n\n[Hook 2]\nBlack clover is a nation, better yet a heaven\nAnd every day is Christmas, wake up early if you want some presents\nYou know I'm bringing Kansas City right down your motherfucking chimney\n\n[Verse 3]\nSome people say my writing is so boring that its heavy\nSo I got a little stricter and I'm pouring my spaghetti[?]\nAnd every petal on the clover is so deadly\nIf the coroner is ready imma outlive the beats like I'm Lawrence Ferlinghetti\nThis shits like chopping oranges with machetes\nKicking door hinges and pouring empty 40's different prezzies[?]\nSo unnecessary, nuclear devastating the Soviets\nI'm plagued by my lover and recreational opium\n\n[Outro]\nI got a question for the person in the mirror\nI wanna know if you can keep up with me, if you can keep up with me\nYou're living like you're crippled by this fear\nI'm worried that you can't feel a fucking thing, you can't feel a fucking thing\nIrish goodbye means, without saying goodbye, leave\nThat you just get up and go\nAs long as I'm on the journey I'll make it home", "year": null, "album": "The Love Potion Collection 6: Keep It Irish", "title": "Irish funeral"}], "artist": "Mac Lethal"}