{"songs": [{"year": null, "title": "Unsolved Mysteries", "image": "https://images.genius.com/5b24b6cf31321d7d04a5e1c4405d5ccc.400x400x1.jpg", "lyrics": "[Intro]\nYeah, they try to keep us in the dark\nBy all these things that go on\nI'm just questioning this shit right here\nYa'I mean? I think it's time that we, uh, figure out some of these\nUnsolved mysteries, yeah, yeah\nUnsolved mysteries\n\n[Verse 1]\nWho was behind the brutal death of Malcolm X?\nCan we believe what was said by the crowd and the press?\nThe FBI and CIA knew all steps and all ties\nWas it the nation? Someone just hating unorganized crimes\nWas JFK killed by eyes [?] secret society\nThat carry out the rituals? Stop lying to me\nI want the truth about Morris, and did he die in the tub\nOr did he hide out in France so he can write about love?\nOpen your wallets, look at symbols hidden in dollars\nWho killed Jason Mizell, 2Pac and Christopher Wallace?\nThis may be the information that only the feds know\nIs Hopper and Giants Stadium under the N-zone?\nDo mole people in New York city really exist?\nDoes Bigfoot in the United States, cold in the mist?\nWere there really dinosaurs? We must learn from our history\nThis is why I tell the stories of unsolved mysteries\n\n[Hook x2: Sabac & Necro]\nThese are unsolved mysteries (unsolved)\nUnsolved mysteries (unsolved)\n\n[Verse 2]\nDoes the government mold sicknesses and hold the antidotes?\nWere the Marilyn snipers part of the satanic cult?\nWas there atlantians, and did Atlantis sink in the sea?\nWere they conquered by the greeks, what does this mystery mean?\nWhat happens when we die, aside from our religions beliefs?\nIs there life after death or some type of rigorous sleep?\nNumerology is the mystery, the seconds enforced\nWhat cause the sicilians to merge within descendants of [?]\nIs there life on Mars, are there angels flying in heaven?\nDid they shoot down the plane in Pennsylvania on 911?\nDid Bush know of the attacks, try to cover and forget it?\nWas the truth in the science [?]\nIt's pathetic that aliens are controlling our minds\n[?] triangle that set the peace only define\nI find it odd that our life is really left after God\nBut I refuse to be a part of being left in the dark\n\n[Hook x2]\n\n[Verse 3]\nChupacabras, man on the Moon, predictions, Nostradamus\nAnti-gravity, [?] convictions or holy promise\nAlien abduction, combussion, sources of free energy\nExplain how we retain if we lain out war with the enemies\nThe probes, UFOs to the dead sea scrolls\nHow is it most of us human stand out we often see goes?\nMan in black know it's all planned [?] the poltergeist\nPyramids, time machines, we're getting hexed over night\n[?]\nLevitation from the ancient [?]\nIt's Israel, hollow Earth, the order of skull & bones\nWe seem prone and protect, but full of what is unknown\nNow we question the connection between theory and men\nWhat does it mean when [?] bless [?]\nYou can't stand the feel of pain, but it is all in your head\nMaybe these answers are explained once we're all dead\n\n[Hook x2]", "album": "Sabacolypse: A Change Gon’ Come"}], "artist": "Sabac"}