{"songs": [{"year": null, "title": "What’s That, Fuck That", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "Y'all muthafuckas is sadly mistaken\nI think -\nI don't really think y'all understand\nWhat it is that I exactly do\nI make joints for the radio\nAnd all that, youknowmsayin?\nBut this is my shit right here, yo\nWe can just get right to it\nHope they can fuck with it\n\n[ VERSE 1 ]\nI can make joints all day, never touch a average\nSauce, hot shit, ain't nothin but a marriage\nSkills that I possess, niggas die to have it\nHip-hop muthafucka, I rap like a savage\nAutomatics for faggots who brag about fabrics\nMad blood on your carriage, no love for you addict\nI roast all y'all niggas, homicide closed, die most\nIt's suicide fuckin with me, try toast\nFuck cats talkin first class but fly coach\nThe laugh is over, Mr. Half-a-Soda\nYou're at your quota, I'm halfway to Minnesota\nThe seat 1a sippin a ice cold ??Momossa??\nNever sober, when I awake I can make a wish\nHead from the bitch servant or steak and fish\nArouse my meat till I'm sound asleep\nGettin brain surgery at 33'000 feet\nA nigga knocked out till I hit the ground and creeped\nLimo, five star hotel and a suite\nOnce earnin I come turnin for cunt squirmin\nBitches who front learnin, yearnin to keep the blunt burnin\n\n[ Hook ]\nNiggas pop shit, war, peace, what's that?\nI'm goin to war with my niggas, I love that\nShow me the baddest chick, I'ma touch that\nI bust a slug first -\t\t\t\t\t(2x)\n\n[ VERSE 2 ]\nPart II to the rec off, son, get your check on\nCheck off, cats better step off or get stepped on\nNiggas I pump lead creepin on me\nPut your head to bed for sleepin on me\nWhat, a hip-hop legend with gut\n22 bitches and my wife in the cut\nFuck that, weak niggas blaze em up\nWhere all my Marcy muthafuckas at? (Raise em up!)\nHalf rock diamonds the size of glaciers, what?\nOther half rock vests and spit razors up\nI'm a major nut who used to lay em out\nGet head but let my man fuck em and play em out\nPushed my name up, '99 got my aim up\nShit ain't bein handled correctly - changed up\nNever looked in haste, but I shook the place\nCan't defend your click, why you took the case?\nCats get shook with AIDS, nines and fives\nDouble-fours, tear gas, infrareds and knives\nAnything to survive, like how a vulture get\n'Stayin alive', John Travolta shit\nI toast your click, disrespect what you supposed to get\nYour homebase yawnin next to a sculptured dick\nI got the most focussed click, it's hopeless, bitch\nSauce Money keep the dopest hits\n\n[ Hook ]\n\n[ VERSE 3 ]\nHere's some inspiration for all you slackers\nI used to work in the mailroom, pushin cars for bastards\nThey had the nicest muthafucka changin water and shit\nLookin through a supply book, orderin shit\nIt never really hit me until I thought of the shit\nMy muthafuckin pay close to borderin shit\nI thought about runnin off with a bitch\nUntil I picked up a microphone and started slaughterin shit\nReputation grew, niggas on my dick\nThen I got real brand new and wrote a hit\n3 million sold, baby still chillin when it's cold\nSauce don't change, only money fold\nFuck y'all, the easiest way to word it:\nPublic broadcast, fuck who heard it\nAll that slick shit is gonna get you murdered\nNothin to fear except fear itself, I'm here to help\nCome with niggas, run with niggas\nHave fun with niggas, hold guns with niggas\nSee the sun with niggas, shoot fair ones with niggas\nSubtract from the sum when I'm done with niggas\n\n[ Hook ]\n\n2000 shit\nLegend\nMarley Marl\nSauce Muthafuckin\nMIDDLE FINGER U", "album": "Middle Finger U"}], "artist": "Sauce Money"}