{"artist": "Yukmouth", "songs": [{"album": "Thugged Out: The Albulation", "image": "https://images.genius.com/6dcb01d30774cfc257eef87de8bad453.500x500x1.jpg", "year": null, "lyrics": "Yo! Let's do this!\nUh!\nUh-oh, uh-oh!\nHa!\nUh-oh, uh-oh!\nHa!\nUh-oh, uh-oh!\nUh-oh, uh-oh!\nRegime nigga!\nThrow up yo hands if you Thugged Out\nThe Regime up in this bitch!\n\nThrow up yo hands if you Thugged Out\nFirst nigga act up, first nigga gettin drugged out\nThrow up yo hands if you Thugged Out\nFirst nigga act up, first nigga gettin drugged out\n\n[Verse 1: Yukmouth]\nI do this for the\nReal killas, and drug dealers\nAffiliated wit Mobb niggas, and blood spillas\nPut a slug through you tough niggas\n1-800-Thugs-R-Us\nNo Dragon tattoo on you, nigga\nNo love from us\nIn thugs we trust\nNiggas get rushed like hot whitend snuff\nUp yo nose, I fuck up yo flows\nLeave my competition ass froze\nWe tag on they toes, I'm as cold as Pocinos\nEnemies get tied to a pole, blindfold then I unload\n\n[Verse 2: Tech N9ne]\nThugged Out, my choppers oblivion\nSpeakin the opposite of Carribean in Tropolis\nPoppin my z-z in\nTrue clocker from welfare recipiants\nType of a crispy\nAn anamalisitc 2Pac-er\nMy race Caristian\nJedi rhyme\nThe way I spits ahead of my time\nGive me a Billboard, an you bet I climb\nYou mutha fuckas\nI love rukus\nThug, makin you hug crutches\nStayin away from you nothin but bum bustas\nThe empire is back an we bugged out\nPhats, Keke, Maxx, Poppa L.Q., Gonzoe an my nigga Yukmouth\nThese bitches beggin me to come to menage-a-trois\nBut Muslims hear us say, \"humdu Allah\"\nThey fly, that's on the crew nigga\nYou cannot block the Regime from makin knots\nNo matter what you do nigga\nYa black an blue nigga\nUndercovers like Malik Yoba\nLyrically Nina's usin a force like Yoda!\n\n[Verse 3: Madd Maxx]\nNigga this Madd Maxx\nYou cross the Regime, you get yo life took\nWe get it fuck the good book\nTrue thug niggas that turned to real crooks\nRobbin the microphone, you get yo brain shook\nI told ya we takin over soldier\nA sober niggas rollin Rover's\nMe, Ke, Gonz, Yuk, Tech 9, an Phats on ya\nAll ready wit the caulked gage, buggin out Oklahoma\nFuck a Corona\nWe drinkin 8-Balls until we fall out\nIf you got a problem wit the Regime, your souls called out\nWe all out for war\nThese niggas don't want no more\nI'm takin over like Michael Jordan\nAn I'm the first to score\nSo fuck you fake ass niggas who be plannin a plot\nI take yo block over\nWit the nitroglycerian rock\nThey got us fucked up\n\n[Verse 4: Phats Bossalini]\nThey got us fucked up\nI've been tough\nSince a young buck\nNothin to prove\nLots of pain plus some war cuts\nIt ain't shit, but a thang to me\nDangerously\nI play the man you claim to be\nNiggas strike back\nGun fight, we had to hype back\nThis is the Phats see dream like a Fat Kat\nThey wanna funk, we get dressed in black\nCock the strap, screamin Regime til they bust back\nIt's Mobb-symboly, I die you remember me\nTatted wit Dragons in a custom coffin Bently\nSimply, I'm down to blast so don't tempt me\nI'm hella drunk, an hella blown off the geniti\nFuck wit me\nSee these killas in mine\nBuildin this shrine\nTo feed these fuckin children of mine\nUh\nLook in my eyes\nAs I bleed the Regime nigga\n(Regime nigga, Regime nigga)\nHavin a pile of money machine\n\n[Verse 5: Poppa L.Q.]\nNo I've never been to the pen\nBut I did a county bid\nAn I ain't dumb enough to speak on the dirt I've did\nGuess somebody caught the killer before the police did\nFind him in the car leakin from dope over split wigs\nDeadly lyrics to spit\nMakin sure the killas feelin my shit\nExplicit lyrics an adult content\nShot callas representin at all the major events\nAnd gang bangin got the streets juss way too tense\nI learned to deal wit it\nI'm in the Fields, windows tinted on my wheel wit the steel in it\nWe keep puffin an rollin real wit it\nThat jury linin, showcasin our diamonds to benifits\nOf a long time grindin, enjoyin the fruits of our labor\nAnd rented suits from my tailors\nSome young playas, strivin for greater\nYou know it's all bad\nLet's make it all good\nPushin the Cavvy to touch the Navvi wit the leather an wood\nIt's Regime nigga!\n\n[Verse 6: Yukmouth]\nThe hardest nigga from the \"O\"\nMy flow is certified theme music for organized crime\nNiggas that burglurised banks, and murdered guys for they pies\nReach for the sky\nTechniques like Robert DeNiro in \"Heat\"\nKarl Kani's\nNo disguise, in the middle of the street\nBuckin at police\nFuck police\nGot a Range Rove jeep\nWit 12 open faced gold teeth\nA Rolex piece\nCuban Links, crops, an bracelets\nBut that ain't shit, to leave a nigga naked, duct taped wit they bitch\nIn the basement\nWhere the safe is?\nBig faces\nCops raided, but ended up gettin they fuckin squad car grenaded\nYou want blazed shit?\nI spit the nitroglycerian\nThat's smoother than a pair of new cinnamon Timberlands\nGet Benjamin's\nBut be no P Diddy\nI'm from a city called Weed City\nSee these Regime niggas be wit me\nFuck Christy juss Remmy\nTrue thugs do drugs an come up wit hits\nLike Jimi Hendrix\nShock the world like Snoop at No Limit\nYuk signed to Rap-A-Lot, yeah nigga\nI ain't a playa, I juss mack-a-lot\nPack the gat\nTryin to snatch yo watch in the back of the lot\nKeep my shit for underground fragment rock\nJackpot J struck it rich hit the Lottery\nThe top comidity\nBlood on wallet be from robbin sprees\nRock Phat Farm, wit tats all over my arm\nBullet wounds like a nigga fresh back from 'Nam\nYo nigga get yo mash on {*echoes out*}\n\n[Talking]\n(How old were you, Mr. Washington when you hit the streets permanently?)\nMaybe 10\n(How did you live?)\nI became a runner\n(A drug runner)\nThat's right\n(Could you give us a description of how you lived, the next few years)\nI kinda moved up. I lived where the money goes\nThen I got busted, 2 and  1/2 in ??\n(And when you got out)\nI got a piece of turf to myself. Took it. One block at a time\nNobody stopped me", "title": "Thugged Out"}]}