{"artist": "Inspectah Deck", "songs": [{"title": "Dolla Signs", "lyrics": "\"We talked about this, Al.\"\n\"Yeah, we talked about it.\" (pause) \"YOU talked about!\"\n\nDolla signs in his eyes, they on the prize, sure to rise, move, make her feel like he paralyzed, tryna (get that money!)\nBig bomb in this socks, he even sell it to his mom and his pops, gotta (get that money!)\nThat ain't a gansta lean, that's how we walk, tottin' heavy machines\nPlus his name is \"no-no never he seen wherever he's seen\"\nSeem to keep his head on the C.R.E.A.M. by any means (get that money!)\nSee the look on they face it's hard to tell the love from the hate, when you (get that money!)\nRain slow, asleep, so deep in these cold streets no sleep for a week, just to (get that money!)\nSo with the cakes and tapes, you know we gotta put the steak on the plate\nWith enough to pay the Jake for the case\nThey just as crooked, look at officer Bates, he on the tape, yeah (get that money!)\nThey gon' tell you it ain't everythin', champagne pours, 'fetti rains (get that money!)\nDetroit shorty see a nice thing, her lifestyle out of your price range\nBut never tricking on the Vixen, money over bitches is how to kickin' vision\nBut don't go judge my disposition, depending on how hard she switchin', I'm kiddin' (get that money!)\nI'm talking Wonder Bread, street's is watching right along with the feds, when you (get that money!)\nSince it goofy dooby, it's calling like Pookie in that New Jack movie, sayin' (get that money!)\n24/7 dodgin' the sirens, 247 shots went flying, now you're right here man, this testifying\nYou get rich without trying I ain't lying boy (get that money!)\nAnd if you get it break the gang some, like you remember where you came from (get that money!)\nNow everybody knows you, but no clue of the hell you had to go through (get that money!)\nShining when the weather stormy, over time, grind, till bring they stretcher for me\nGuns and butter, that come with the territory, until they write a better story, homie (get that money!)\nSo now we're hitting on the scheme, 'joyin infinite, green, living the dream, playa (get that money!)\nI'm talking cash in advance, the bands'll make her dance hit your stance, baby (get that money!)\nThat equal power and respect, they vexed, enough said, protect your neck\nLike I'm wrong for being Inspectah Deck, forever fresh\nNevertheless, favors are never a threat, 'cause I (get that money!)\nI heard they money make you change, right? 'cause things'll never be the same when you (get that money!)\nVivid descriptions of the hood like, painting reflections of living a good life (get that money!)\nDoesn't matter what pain you felt, play poker with the card you dealt\nThey say the thing worth more than wealth is health\nAnd ain't nobody gonna help, you gotta help yourself, go ahead (get that money!)", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}