{"songs": [{"year": "2017-12-17", "album": "Deadset Song Series", "image": "https://images.genius.com/361914af43fdae62b50bc16d27a3c279.1000x563x1.jpg", "title": "Deadset 7", "lyrics": "[Intro: Foo Fighters (sampled) & Kerser]\nI've got another confession to make\nI'm your fool\nEveryone's got their chains to break\nHoldin' you\nWere you born to resist or be abused?\nIs someone getting the best, the best, the best, the best of you?\nOh fuck, you got a camera again?\nIs someone getting the best, the best, the best, the best of you?\nFeels like I’ve said that before\n\n[Verse: Kerser]\nFuck's happening? Yeah, it’s been a minute\nThey surprised I’m alive 'cause I’ve been the sickest\nBitches dance, get your hands in the air now\nShave your pussy, I’m just saying let your hair down\nThey all ask for a photo, what?\nPut grenades on you phone, that’s a photobomb\nGetting under your skin, yeah you rap like a homo\nProbably get offended if I told you to vote no\nI’m the reason why your bitch is late\nIt’s Deadset seven, can you picture eight?\nI’m a different guy, make you hit subscribe\nThen delete every video I think you like\nLet me tell you 'bout the tour I'ma get you in the hot shit\nHit pause here and get your tickets now from Oztix\nSpin it right round, we start in Tas\nSnort half the rack and beat a heart attack, back\nOn stage, I’m fightin' on\nIn Tassie on the cloud, but I’m twice as strong\nThey love me here and I’m rapping it fat\nHit stage so hard ain’t a gap in the MAB\nTour starts there on the tenth of March\nTripping out on stage can’t forget my bars\nTas know the G-O, know the beast flow\nGonna fall asleep right where the weed grows\nNext up: fuck yes, it’s Vic\nMelbourne crowd some hectic shit\nTouch down off a plane, drive round in a rental\nCopper chasing that but I ran out of petrol\nBack to the venue, Kers on the menu\nI ain’t even sneeze but they all say “bless you”\nNo stress, I'm like a local there\nThey call me King Kers, they know I’m the man\nI’m at the casino spending the green notes\nM-E-L-B-OURNE let me breathe bro\nOz ARIA, number one\nIt’s in the charts, they were like \"fuck another one\"\nWhat else do you expect from Kers?\nTwenty-third of the third when I land in Perth\nJumpin’ off a plane and I’m off my head\nTripping out like I got a fuckin' wonky leg\nCan’t fuck with Kers, I’m loving Perth\nPeople can’t say a lot without a hundred words\nBut it’s all good bro I’m the fuckin' man\nIf I write you a rap, it’s a hundred grand\nAnyway yo, Perth is sick\nGood all around like a perfect tit\nNow I’m hitting my hometown, bringing my own crown\nWear it on stage like Sydney got the throne now\nAh fuck the crowd is nuts\nAnd my ears kinda hurt 'cause they’re loud as fuck\nFeel so high, I could fly away\nPut my dish in the box like a microwave\nOh shit yeah Kers is back\nAnd you can’t get rid of me I’m like a herpie rash\nSydney’s on April sixth\nOn stage with sunnies cause I’m baked as shit\nYou know how Kerser do\nYeah I’m rich but I still take a purse from you\nAnd the tour got me fucked up, let me chill\nGot you seeing double like a eccy pill\nGonna get in trouble 'cause I mentioned drugs\nGot the game on fire, check the temperature\nSydney going crazy, let's fuck it up\nGot the spliffs in the air now jump you cunt\nWe run a muck, from the day to night\nAnd we don’t need a plane to be stayin' high\nSpeaking of bud, Adelaide is next\nOut of everyone bud, Adelaide the best\nSo we blaze a sesh there and celebrate\nEvery step that I take man, I elevate\nAte a mushroom now I got a belly ache\nDid I mention I was high on the telly mate?\nWhen they sat me there right next to a ho\nSome feminist bloke name Jessica Rowe\nFuck her off, Adelaide was sick\nI mean I think it was, I can’t remember it\nNow the Q-L-D still high as fuck\nRun a competition, see who got the tightest cunt\nFuck waiting for me at Eaton Hills\nI was there two years ago, I’m peaking still\nThanks Bris, now I’m up to Cairns\nHad to add a show yeah, 'cause I never been there\nFuck man their King has arrived\nThey said I love myself, is that a big surprise?\nI didn’t think so, Cairn’s know what’s up\nI could hit an alley-oop if you throw me bud\nIn Cairns with a can, you can tell that I’m high right\nCutting off your hands and I ask for a high five\nOh yes, you know we high\nSo if you in Cairns get to know me right\nKing Kers with a capital K\nRacking up lines at the back of the stage\nBetter stop there, they’ll cancel gigs\nAre you off your head, don’t answer this\nI’m a beast when I flow and I set the trends\nGet the whole country saying \"Deadset\" again\nToo swag and I’m sitting in a sports car\nI could turn a good girl into a pornstar\nHave her going off tracks like a D-rail\nFilm the shit, I could send it to your email\nHeard you hate me, time it as you hold breath\nI just got new diamonds in my Rolex\nI'ma get you stamped like an X pill\nWhen Kers on the mic, man it gets real\nSydney representing till my death yep\nI don’t know but I’m pretty sure I met death\nMight have been 'cause I haven’t even slept yet\nEveryone tellin' me I gotta get rest\nThis is it, gonna go, don’t you stress, yes\nJust get ready with a sesh, till your head's wrecked\n\"Engraved In The Game\" is the best yet\nI'ma see you at the shows, Deadset"}], "artist": "Kerser"}