{"songs": [{"year": "2019-03-04", "album": "Gathering", "image": "https://images.genius.com/5c56ad004ba053dfcdd28031b6d82111.1000x1000x1.jpg", "title": "Cold Day", "lyrics": "[Chorus]\nMan it'll be a cold day in hell ’fore I lose my shit\nI got that noose vice grip, you'se as loose as a bitch\nYou need your tubes tied kid, stop producing that shit\nYou get your wig split quick down the middle you dig?\nAsymmetrical like geometric squares\nIncompatible, there's nowhere to compare\nMe to you, it’s not possible\n\n[Verse 1]\nLogical, niggas pulling out they hair follicles\nComical, shit to each his own, do what you gotta do\nA lot of you, do the dumb shit that you've been allotted to\nBut that's what I'm alluding to, I hope I'm not confusing you\nNiggas talk and all I hear is la-la-la, le-la-la-la, le-la-la-la\nThat shit ain't audible\nI'm Randall Cunningham to these duttymans, I scramble out\nNiggas ship sank 'cause they rode the wave but ain’t plan the route\nOverstep unsteady stepping stones, it’s how I'm standing out\nThrowing temper tantrums like Bobby Knight via ’89\nRigged the whole series like Rothstein, with a large dream\nBest believe I come to collect for the C.R.E.A.M\n\n[Chorus]\nMan it'll be a cold day in hell 'fore I lose my shit\nI got that noose vice grip, you'se as loose as a bitch\nYou need your tubes tied kid, stop producing that shit\nYou get your wig split quick down the middle you dig?\nAsymmetrical like geometric squares\nIncompatible, there’s nowhere to compare\nMe to you, it's not possible\n\n[Verse 2]\n(Unstoppable)\nYou slowing me up, that's not plausible\n(Optical)\nIllusions what they are, I'm astronomical\nA paradigm you stuck inside, your shit is paradoxical\nI can take a mountain and move it\nI can take your regular scene and turn that to a movie\nHoward Hughes it, use it, fuse it, and make it larger than life\nThen add some bells and whistles with all the aesthetics they like\nThere really isn't nothing to it, my shit is contrite\nI got a vision plus the intuition\nStar of the show, I'm Michael Jordan to your Scottie Pippen\nThese niggas couldn't start the engine or the transmission\nYour wires crossed, signal's off, what you transmitting?\n\n[Chorus]\nMan it'll be a cold day in hell 'fore I lose my shit\nI got that noose vice grip, you'se as loose as a bitch\nYou need your tubes tied kid, stop producing that shit\nYou get your wig split quick down the middle you dig?\nAsymmetrical like geometric squares\nIncompatible, there's nowhere to compare\nMe to you, it's not possible"}], "artist": "K.A.A.N."}