{"artist": "G-Dep", "songs": [{"title": "Smash on the First Night", "album": "Child of the Ghetto", "year": null, "image": "https://images.genius.com/bddcce4afa23dd703cfaf4bd2ea9dfe7.300x300x1.jpg", "lyrics": "(G-Dep) Yeah\n(Diddy) G-Dep\n(G-Dep) Yo Boo, I ain't tryin' to be disrespectful or nothin'\n(Diddy) G-Dep\n(G-Dep) Check, I wanna fuck on the first night\nWord up boo\n(Diddy) G-Dep\n(G-Dep) And that's just me, I don't know\nWord up, you been patient\n(Diddy) Talk to 'em, talk to 'em\n\n[Verse 1 - G-Dep and (P. Diddy)]\nSee the thing about Dep (Yeah), I talk about sex (Uh, huh)\nAfter small talk what we gon' talk about next (Come on)\nSome Moet, just to get ya mouth wet\nFull of buzz, let me put the plug in the outlet, maybe\nMaybe so, yes or no, shit I never stress a ho\nI let's a ho (Come on), if it ain't possible, you got to go (Yeah)\nLet the door knob hit ya, take the Moet witcha, shit ya\nPicture perfect, 'til the bullshit surface (Come on)\nProbably want me to purchase, but that shit ain't worth it (Naw)\nI wanna fuck for free, like Akanelli (Yeah), I got the tele\nYou got to tell me if you wit (You wit it), come on even Monica did it\nWhen I meet you let me treat you like the chronic and hit it\nLay you on the bed, like you was a spread\nAnd let you do what you do what that head\nThat's when I said (Come on), yo boo\n\n[Hook - G-Dep, Lady May and (P. Diddy)]\nDep: I wanna fuck on the first night (You wanna what)\nMay: You wanna hit it and run, I ain't the one (Yeah let's go)\nDep: I wanna fuck on the first night (Say what)\nMay: You wanna jump all on it, how bad you want it\nDep: (Stop screaming my name)\nDep: I wanna fuck on the first night\nMay: Put I all in my ribs, what you think this is, nigga\nDep: (I don't know)\nDep: I wanna fuck on the first night\nMay: Yeah ok picture that, you ain't ready for that\nDep: (Stop screaming my name)\n\n(G-Dep) I wanna, I wanna, you wanna\n\n[Verse 2 - Lady May and (P. Diddy)]\nYou wanna what, you don't want a chick like me you wanna slut\nTake in the cut, let you put it in my but\n'Til you, bust a nut on my com-for-ter, uh uh\nThat's not gon' happen, fuck if you rappin' on starship captain\nYo, this nigga thinking he knocking, have me from the back\nAnd get my booty to clap, I'm laughing, I find that funny (Yeah)\nDid you see manikin, like I'm that dummy (Ha, ha, ha)\nStop the game, how y'all not the same (Uh uh)\nCracks and pain (Yeah), and then crack for brains (Come on)\nWork that pussy out, like Jac-que-line\nI know the plays, and that's half the game\nBrain tellin' me no, body tellin' me go (Yeah)\nShit I ain't a ho, whatcha tellin' me yo (Listen girl)\n\n(Chorus)\n\n[Verse 3 - G-Dep and (P. Diddy)]\nIt's G-Dep on ya frequency (Yeah)\nSo when you hear wanna freak wit me (Bad Boy Baby)\nAnd we could be the best of friends (Yeah, come on)\nBut if you ever stress again, guess again (What, ha)\nNow we could bone bitch don't pretend (Uh)\nWe came to fuck, now baby what's up (Come on)\nYo clique is all corrupted (Let's go), all suck dick\nI don't care who you fucked wit (That's right)\nNow we could do it at the flicks, I bust quick\nSmashin', hear the sound when the ass hit\nHit it from the back, make you call me a bastard\nGoin' out vivid, got my foot all pivot, I give it\nHow you give, talk it just how you live it (Yeah)\nYou can get along wit me (That's right)\nFuck now you on wit me (Uh huh)\nMaybe we could work somethin' (Yeah)\nCall ya boo maybe she could hurt somethin' (Let's go)\nI'll be, sure as Al B. (Uh), here take the house key (Uh)\nDon't start without me (Uh uh)\nLike money put it where ya mouth be (Yeah)\nI'mma leave around three, I thing about me, is (G-Dep)\n\n(Chorus)\n\n(Diddy) G-Dep\n(G-Dep) It's just me I don't know\nIt's just how I get down\n(Diddy) Come on, yeah\nTonight's the night, tonight's the night, tonight's the night\n\n(Chorus)"}]}