{"songs": [{"year": "2001-04-03", "image": "https://images.genius.com/ec46798fa54e4b0eead636c38046b017.300x293x1.jpg", "title": "Freestyle With Remy Martin", "album": "Endangered Species", "lyrics": "[Big Pun]\nYo yo yo\nWhat the fuck, Terror Squad\nAll we do is battle what; what, what what\nYo it's \"The Dream Shatterer\" strictly for cream team battler\nRing rattlin microphone fiend spline splatterer\nKing of the throne, bringin it home five nights\nUp in The Source - five mics\nWhippin a Porsche - high price\nPumpin the 9-7, rhyme heaven her voice is mindbendin\nImaginin Angie nuttin but panties and my 911\nThat's what I'm reppin the thug tech and the glove\nStep in the mud with less than a SCUD I'm splittin your rug\nIt's just I'm in love with Mrs. Martinez\nLatin Goddess or Venus, you just happen to give me the hardest {penis}\nYou wanna see us apart, you're chasin the dark\nLong as she run the battle she got a place in my heart\n\n[Remy Martin]\nYo.. yo, yo, yo\nAll of a sudden the big question is, yo who this bitch Remy-nisce?\nIs she really thorough with her borough, can she represent?\nDo Remy write every line and every rhyme that she spit?\nIs she, really the shit, is her flow really sick?\nGet off my dick, keep your sorry ass compliments\nI get mad quick y'all knowin me ain't got no sense\nBitch don't try to play me, because you not a player\nBelieve me, you don't really wanna see my gangster\nIt's easy to cock back and smack the shit out a hoe\nHad to leave niggas bleedin just so we could get our dough\nIt get me heated, that's why I wild out for no reason\nOn the Bruckner, like fuck you, gettin weeded and speedin\nI'm untouchable nigga I ain't never have love for you niggas\nCause y'all pussy that's why I ain't never fuck with you niggas\nMotherfuckers is scandal, on the avenue of Randall\nDon't slip into some shit you and your click can't really handle\nI ain't havin it, get the cash out the cabinet\nBefore I stab the bastard baby in the bassonet\nI'll, body a botty bwoy, blow his gut open\nLeave son chokin, gun still smokin\nKnow how many niggas like, \"I bet you Pun wrote it\"\nY'all can all take a dirty dildo and deep throat it!"}], "artist": "Big Pun"}