{"songs": [{"year": "2018-11-10", "image": "https://images.genius.com/b4cbe7470db4bffcda57e204ad892fef.1000x1000x1.jpg", "title": "Der Bild Redakteur", "album": null, "lyrics": "[Intro]\nYeah\nEy yo, DJ Arow, gib mir den Hetzkampagnen-Beat, yeah\nYeah, ah\n\n[Part 1]\nSchmierlappen-Gelfrisur, kreidebleiche Hautfarbe\nRecherche könn'n wir auslassen, denn Hauptsache, Auflage\nBlock und Kuli griffbereit im sportlichen Blazer\nRote Schlagzeil'n spiegeln sich in meinen Hornbrillengläsern\nIch bin BILD-Redakteur, yeah, ein Silbenjongleur\nBring' Storys mit mehr Fantasie als ein Filmregisseur\nDas' 'n harter Job (voll), ich tipp' mir die Finger wund dabei (aua)\nBist du für kein Interview bereit, erfind' ich kurz mal eins (yeah)\nIst ja kein Grund mich vom Hof zu jagen (also echt)\nDas gibt 'ne Headline mit Alliteration'n zum Namen in rot gemalten Großbuchstaben (haha)\nSkrupel hab' ich ganz persönlich gar kein'n (nö)\nEin paar skandalöse Schlagzeil'n, du wirst allergrößter Staatsfeind\nEin Kind stirbt, dann erfährt die Mama das in der Presse (hi)\nDie Tür ist ein'n Spalt auf – zack, Kameras in der Fresse\nMein Beileid, gute Frau, hier 'n Fuffi für ein Exklusiv-Foto (nimm)\nUnd jetzt bitte schluchzen Sie ins Mikrofon!\nDann Schluss mit Weinerei, Sie sind ja schon ein heißes Teil\nIch hätt' 'nen Job für Sie und Ihre Titten, auf Seite drei\nWenn ich nicht weiter weiß, was ich als Titelblatt-Geschichte nehm'\nDann irgendwas mit Flüchtlingen und Kriminalstatistiken\n\n[Bridge]\n„Es passt schon so“\n„Jawoll, jawoll, Chef! Schreib' ich so runter.“\n„Wunderbar!“\n„Schreib' ich so runter, jawoll! Wird gemacht!“\nEy!\n\n[Part 2]\nEins hab' ich gelernt im Journalismus-Studium\nMan braucht gar keine Story (eh-eh), nur 'n Stift und Publikum\nUnd für die Klicks 'nen Superschurken (jop) als Sündenbock\nJeder, der bekannter ist als ich, erfüllt den Job\nNehm'n wir Kollegah (oder Kollegah), diesen aufgemotzten Rüpelrapper\nDa kann man echt nur mit den Augen roll'n wie Würfelbecher (tze, echt!)\nWas sich dieser Rapper da leistet\nNein, nein, ich sprech' nicht von sei'm Bentley und Daimler (ah-ah)\nIch sprech' von seinen Texten und Reimen\nJa, ich check' nicht mal die Hälfte, doch weiß, dass sie echt schrecklich gemein sind\nIch geb' zu, ich check' nicht immer, wo sich was reimt\nOder die Wortspielerei'n, doch sein Humor ist nicht meins! (ne, ne)\nDenn ich bin weiß Gott ein witziger Knabe (voll)\nBei mein'n Headlines schießt mir oft schon die laktosefreie Milch aus der Nase\nMit Kollegah würd' ich echt nicht tauschen\nEr hat zwar Fame, das Geld und Ausseh'n, aber ich hab' mehr Respekt vor Frauen!\nUnd wenn meine Jugendliebe aus der Schule liest\nWie ich volle Kanne in der BILD gegen den Bully schieße (hehehe)\nDann wird sie sich bestimmt bei mir melden\nOh Gott, ich hoff', ich krieg' sie ins Bett (meint ihr?)\nUnd wenn nicht, ja, dann verpisst sie sich besser\nZurück zu ihr'm sexistischen Ex (peh), der sie nicht mal beschenkt\nDie Schlampe!\n\n[Outro: DJ Arow]\n„Sauber, Toni, ist im Kasten. Aber ey, Seite drei, erzähl mir doch nichts, Mensch! Seite drei sind die geilsten Mädels, Junge. Die BILD lässt sich nicht lumpen!“"}], "artist": "Kollegah"}