{"artist": "360", "songs": [{"album": "Vintage Modern", "year": "2017-07-04", "title": "Just A Thought", "image": "https://images.genius.com/0c3f4ac20b8684b0001c95d073d8307f.500x500x1.png", "lyrics": "[Intro]\nJust a thought\n\n[Verse 1]\nI understand people have a lot of questions\nMaybe I could rap and give you answers with a message\nA lot of times what I'm rappin’ is offensive\nIt ain’t serious, I’m sorry if I actually offended\n\"How does he ever write while he's battlin’ with depression?\nHe could end his life in the matter of a second\"\nWould it matter if I end it? Yes, I wanna show a\nDisorder can be a gift it's just a matter of perspective\nOn this planet there's a fraction of its members\nThey have a talent and they have to be remembered\nWhat I have is a profession, and my rapping is a blessin'\nI don't even have to think, all I have to be is present\nSomethin' higher though is tapped into my head\nDunno what it is but I'm just havin' to accept it\nLike I have a spirit enter me, channeling an energy\nAnd everything I rap it’s like I haven’t really said it\nI probably sound like I’m gackin' off my head\nI’m clean, it’s like divinely I’ve had an intervention\nI understand that it's challengin' to get it\nPeople'll misconstrue how I actually have meant it\nFor me this is proof that the galaxy is more\nThan stars and the planets just randomly projected\nI'm not saying that it had to be invented\nBut there’s something much bigger, no man can comprehend it\nI believe in God, but not a man that is ascended\nStanding in the heavens, judging every move you make\nAnd banish you forever, if you’re bad then you won't get in\nFor me it’s more simple, like it’s actually a presence\nEvery life, every star, every planet and dimension\nEverything is actually connected\nSee, there’s a God that’s ready to come alive in\nEverybody on Earth, all you have to do is let it\nYou can be anything you actually invest in\nYou can’t wait for it though, you have to manifest it\nThe law of attraction is tragically presented\nIt’s the secret, it’s really hard to actually defend it\nThey made it out like you imagining a cheque\nOr a house or a car, then magically you’ll get it\nI’m a believer though, I actually digress\nSee, it goes a lot deeper though than cash and them possessions\nIf you doubt it, look at the placebo effect\nThat’s something that you have to be impressed with\nA tablet was ingested, the tablet did nothin'\nBut in thinking that he had it was still havin' him affected\nSee every thought you have ever thought\nWhat you truly believe, and your actual intention\nIt matters, there’s so much power in your mind\nAnd as far as God goes, that is practically the essence\n\n[Interlude]\nBasically just believe in yourself\nEmbrace who you are\nAnd love yourself and everyone else\n\n[Verse 2]\nYeah, I love getting my vent on\nI'm about to blow, picking up where I left off\nTo tide 'em over I just hit 'em with them songs\nI got fifty more so I'm picking the best of\nSee I been building, I been getting my rest on\nYo, I can't wait to show these kids where my head's gone\nAnd get my rappin' at it's tightest for the album that is timeless\nSo it’s crucial that I’m seeking the best on\nAnd they keep saying I'm brave and I'm headstrong\nBut I can't help but feel like they're dead wrong\n'Cause I can talk about my illness and issues with addiction\nBut I won't ever say where it stems from\n'Cause barely anyone knows and I can't admit it\nThe truth really does hurt, it's too dark to give it\nThis is a life, we never wanna start to finish\nWe gotta give it everything from start to finish\nIn a team where we need to have the heart to risk it\nOur one rule is shooting for the stars in this bitch\nWe're living such a life that it can’t be mimicked\nOnly ever setting goals if they aren’t realistic\nMade to stand out, though we aren’t to fit in\nAny nay-sayers and we aren’t to listen\nAnd we spark a difference, making life that\nCan’t be mimicked, the fact is though, you can't with limits\nI was narcissistic, self-destructive, part sadistic\nThe wrong business I was partnershipping\nI was a part of that party life, partying, then\nLife fell apart, thank God that I parted with it\nIn this All-Star game, I’m the starter in it\nGot that nineties fashion with the starter with it\nPeople think I’m all about the fame, girls and money\nBut the fact is I really love the art of this shit\nAt the table where the winners be at\nFuck sticking to the rules, we ain’t limitin' that\nWe get enough to jump around, make the city collapse\nAnd then we fly around the world doing victory laps\nLet’s go\n\n[Outro]\nI just wanna thank everyone who’s been mad patient with me, and stuck by me through all this fucking bullshit I’ve been through.\nBut I’m back now and I’m not going fucking anywhere. I know this game like, especially in Australia, it’s really super competitive and shit. Everyone wants to be the fucking king. I wanna be the king, I'm gonna be the king. I reckon we should all share the kingdom. Fucking every rapper should believe they’re the king anyway.\nSupport anyone who’s killing it whether you like their shit or not. Fucking even if, even if we got personal issues I’m glad that you’re kicking goals, I’m glad that you’re fucking winning. We need more support, and uh, less ego. And any young rappers coming up, shoot for the fence. Don’t let anyone tell you that you can’t do shit, 'cause you fucking can. You can do whatever the fuck you want with the right belief and the right mindset. Go for gold. Just a thought."}]}