{"artist": "Isaiah Rashad", "songs": [{"title": "Fake Trill", "lyrics": "[Produced by Chris Calor]\n\n[Verse 1: Michael da Vinci]\nThe no stoner, has a boner, I need head and some sex\nSometimes vulgar, I'm quite Homer, dream 'bout booze and some tits\nSpeak 'bout bitches less than often cause they lie for the dick\nThus an evil of a creature, who plays games on gent\nI sit lonely in my Honda, behind darkest of tint\nSmoke a woodtip for my problems and give Brandy a sip\nGet confided in the voice, spill my feelings and shit\nBreaking codes and regulations, not a pimp nor a simp\nGive me things that make me happy, cause the bottom I hit\nFuck a bowl, give me love, fuck your words, give me drugs Promethazine, a nice to meet you, you made bitch niggas all seem to\nMisuse the words of trill, hold the gun so they real\n'til their face in the reel, watch a real nigga squeal\nWhen the piglets peal, the tabs off of your grill\nYeah you chirping, pleading deals with your faggot ass\n\n[Verse 2: Isaiah Rashad]\nBeen sipping on this, stop telling me, start to get sober\nBill Bellamy, tickle my bellilly, I would do anything just to get over\nSo I drank sometimes, then I paint these rhymes, pardon me, I'm antsy\nWhy? My heart quite nervous, '95 I'm swerving, then I hit them curbs\nNo then boys ain't working, fuck a black Suburban, commissary purchase\nMy daddy calls, I barely answer, fuck parental curses\nI spit too many verses, I know you fucking heard 'em\nSo why you leave them voicemails that you know gone hurt me\nTired of rapping that real shit, if nobody gone feel this\nI could be gripping that steel shit, you too busy to deal with\nIt's like, they told me all the time \"You got the gift of the gab\"\nFinally niggas is listening, yeah, then I just start with this missing my dad\n\n[Outro: Isaiah Rashad]\nDamn, so like when... you gone quit? You trill now, huh?\nYou cool, huh? You real? You real, that's what's popular, huh?\nThat's cool, you UGK for life, huh? Boy Stop", "image": "https://images.genius.com/c7cea3b4e8e2ba385a1b2d5258952e1b.630x630x1.jpg", "album": "Welcome to the Game", "year": "2012-06-28"}]}