{"artist": "The Game", "songs": [{"title": "Anything You Ask For", "album": "G.A.M.E", "year": null, "image": "https://images.genius.com/1bdd8645ec9f0789e2de0d0a1e260c77.325x314x1.jpg", "lyrics": "[Game]\nThe young Roy Jones of this rap shit\nSomebody 'bout to get knocked the fuck out tonight, man\n\n[Verse 1 - Game]\nNiggas think they got the Game sewed, yeah right\nI'm air tight, fresh in them Air Nikes\nIf the Navi outside, I might be there\nBlack hoodie, black nine, black Wifey Airs\nRock guns like Caddy trunks, keep a spare\nYou see the lump under the Iceberg fleece, and yeah\nWhen the beef cooks, I'ma put the piece to your head\nAnd if you see a white truck that means your sheeps is dead\nThen I'm going, going, back, back to the block\nTo dump the bucket and jump in the drop\nNiggas know I'm good with the Glock\nThey call me Chick Hearns cause if the Game on knock, I'm callin' the shots\nI wear a shiny suit for a minute like I'm the LOX\nThen get gangsta with a swap meet bag and a Jordan box\nAnd when I die bury me with the Glock\nAnd a bucket of shells in case niggas want drama in hell\n\n[Hook - Bootleg]\nI'll give you anything you ask for\nMoney over bitches!\nTell me what you blast for\nWe don't fuck around with snitches!\nWhat you have to smash for?\nThese niggas tried to play me, man\nAnything you ask for\nIt's all about the Bay, Game\n\n[Verse 2 - Bootleg]\nFirst things first, money over bitches, fuck hoes\nSay my name in vein; watch Game break the bones in your noes\nI'm a Flint Town rider, Inner City flipper\nMy whole squad in flip mode like they name was Rah Diggah\nSword Jinted on, Bootleg, bitch I'm a general\nSaw draw your firearms when you in the presence of criminals\nAnd motherfuck subliminals, metaphors or adjectives\nI come to where you live and shoot sixty rounds inside your crib\nKiller by instinct, murderer by nature\nKilla Cali earthquake ya, show nothin' but bone breakers\nBitch it's nothin', like puffin' on this dust-for-ass pound\nThe caine in my tana have your mouth twisted just like Bobby Brown\nFuck what you might've read, fuck what your people said\nBack in this bitch in '06 it's the Game and Leg\nHighly aniticipated, the day this finally came\nI'll smack a patch of meat off a nigga head for Game\n\n[Hook]"}]}