{"songs": [{"lyrics": "[Intro: Jay-Z]\nWhat, tssh, y'all, what\nJigga, uhh uhh uhh, uh-huh\nPa-pa, uhh, pa-pa, uhh\nThe G, Roc-A-Fella y'all\n\n[Verse 1: Jay-Z]\nWho be, in a Japanese restaurant, eating sushi\nDrinking sake, it's me, and my mami with the doobie\nCutie, smelling like Miyake, half-Philippine thing\nFor now, let's call her Suki, got me, this booty banging\nProperly, in Versace pants, cocky bow-legged stance\nA thing of beauty, watch me, body crazy\nTits Firm like Nature, Foxy, Nas and AZ\nTruly reason to bug the toolie and keep laced in jewelry, watch me\nGirlie tried to lure me and lock me you gotta get up early\n'Cause who's getting played is not me\n\"Surely you jest,\" she said, \"if you thought I was purely\nOut for the bucks you woulda bucked stuck and dropped me\"\nI said maturely, \"You right\nBut better safe than sorry, before the lovebirds\nCan move to the suburbs, I need to double check your story\nTo make sure that you one of a kind\nAnd you deserve to be my Sunshine\"\n\n[Chorus: Babyface (Jay-Z)]\nTouch me with, a heart of gold (uh-huh)\nI can't go a day without my sunshine (uh-huh) ahh-haaa (say what? uhh)\nTouch me with, a smile of gold (yeah)\nI can't go a day without my sunshine, sunshine (uhh, uhh, uhh)\n\n[Verse 2: Jay-Z (Foxy Brown)]\nA year gone, and she seeing things most chicks only\nHear in songs (uh-huh), keep in gear phenom\nLots of ice in the air, round the neck the charm (that's right)\nRisked a four to life bid to keep that shit on her arm\nKeep her impressed at all times, cats would love to creep (uh-huh)\nJust to say they crept with mine, slept with mine, she said\n\n[Verse 3: Foxy Brown (Jay-Z)]\nI ain't deaf nor blind, niggas stressing\nHating 'cause they less than mine, they wanna sex me\nWe chose each other, you acting like you chose me\nThey oppose you then, they oppose me\nWe could creep at a low speed, the gat in the hosiery\nDouble cross you they got to triple cross me\n(I'm thinking that's the way it's supposed to be) Uh-huh\n(One more thing:\nIf I ever go broke, would you hit the block for me?) Fo' sho'\n(She replied, eyes open wide) Uhhhh\n(Put that on everything?) I put that on my life\n(Right)\n\n[Chorus: Babyface (Jay-Z)]\nTouch me with, a heart of gold (uh-huh)\nI can't go a day without my sunshine (uh-huh) ahh-haaa (say what? uhh)\nTouch me with, a smile of gold (uhh)\nI can't go a day without my sunshine, sunshine (uhh, uhh, uhh)\n\n[Verse 4: Jay-Z (Foxy Brown)]\nIf I needed would you, give me your kidneys? (Uhh, uhh, fo' sho')\nCatch a case you catch it with me? (Mmm, fo' sho')\nPawn your jewelry to come get me? (You better know)\nCatch me with a chick, forgive me? (Uhh, now that, I don't know)\nThey spread rumors, will you defend me, tooth and nail? (Uh-huh)\nThey try to frame me, will you be there, till the truth prevail? (uhh)\n(But would you be the same dude, when you blow the roof off sales\nThat you was, throwin' rocks, at the roof at 12, nigga?)\nThis is the truth I shall, 'til the loot gets frail\nI put this on my nephews, from the smallest to the pale\nMe and you balling, from the Heavens, or the Hell\nWon't let you hit the ground if I'm falling myself\nNow picture me leaving you in this cold world, rolling for delf\nIt's me and you in this old girl, we taking the belt\nFrom the lows, to the highs, to the foes we shine\nJust continue to be my Sunshine, uhh\n\n[Chorus: Babyface (Foxy Brown)]\nTouch me with, a heart of gold (uh-huh)\nI can't go a day without my sunshine (uh-huh) ahh-haaa (say what? uhh)\nTouch me with, a smile of gold (yeah)\nI can't go a day without my sunshine, sunshine (uhh, uhh, uhh)\nTouch me with, a heart of gold\nI can't go a day without my sunshine, ahh-haaa\nTouch me with, a smile of gold\nI can't go a day without my sunshine, sunshine", "title": "(Always Be My) Sunshine", "image": "https://images.genius.com/e3a30cb54ee9ef89cc498202c4490d9f.322x269x1.jpg", "year": "1997-11-04", "album": "In My Lifetime, Vol. 1"}], "artist": "JAY-Z"}