{"artist": "C-Rayz Walz", "songs": [{"title": "Spit Hard", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nMan, spit hard or don’t spit at all, man.  I ain’t come in no office to waste...\n\n[Verse 1: C-Rayz Walz]\nSpit hardballs—I ate the jail cell\nA hot boy for real.  What the deal?  I made hell (Whoo!)\nTo come out right and dumb out like\n“Yo!  I get my day together, man, after I break night”\nI break records (What?)—mostly wack vinyl\nI’m a Bad Boy, but don’t let my Shyne blind you\nI bling like cash registers in microwaves\nThis beat got me flipping like Psycho Rayz\nBut see, Walz is still the name I claim (Uh huh)\nI spit so nasty, I could actually stain my fame\nAnd it won’t come out like white pants with grass stains\nBlast brains out the side of your frame at close range\nI want change, treble, and bass\nTo the point my impact might crack a track and level the place\nAll devils gets chased ‘til I catch a case\nLike a UPS worker with a box in your face\n\n[Hook: C-Rayz Walz]\nSpit hard!  (Spit hard!), keep rocking the mic\nSpit hard!  (Yeah!)\nSpit hard!  (Yeah!), keep rocking the mic\nSpit hard!  Bitch, no ho’s bars\nSpit hard!  (Spit hard!), keep rocking the mic\nSpit hard!  (Yeah!)\n\n[Verse 2: C-Rayz Walz]\nWhat's a hot verse without a fire chorus?\nI’ll knock you out, then punch you in the Eye of Horus\nThis is human gat rap—I clap, off safety\nToo much games out right now for you to play me\nSpit it off the top like sunroofs with a Uzi out\nAnd bubble in the place to be like Jacuzzi house\nHorrible like Hägar, Hawkmen in the hood\nFly nigga.  I wish you would and could touch mine\nThat’s my dick.  Don’t clutch mines\nI’ve been spitting rhymes since Monroe High School lunchtimes\nSmoking L’s in stairways.  My rhymes is hearsay\nYou stupid critic.  When I spit it, you hear what I say\nPolitic with smart niggas on dumb blocks\nThe place where basslines sound like gunshots\nWhen the cops come, the fun stops (Chill)\nWhen I spit heat, you see sunspots and get burned without sunblock\nYou come/cum watch like sperm on your clock\nBut you should work for my knuckles and start earning a knot\n\n[Hook: C-Rayz Walz] (x2)\nSpit hard!  (Spit hard!), keep rocking the mic\nSpit hard!  (Yeah!)\nSpit hard!  (Spit hard!), keep rocking the mic\nSpit hard!  Bitch, no ho’s bars\n\n[Verse 3: C-Rayz Walz]\nSteel cage match, 12-gauge rap\nIf you feel Rayz’ clap/Rayz, clap—what a powerful impact\nIn the zone, smoking bones alone with “Bones” Malone\nCutting spades the same way I scraped your dome\nBases loaded—right here’s where I take it home\nYour face exploded from being laced with a basic poem (Oh shit)\n(Spit hard!) Like I’m chewing a stone\nInto a glass pipe (Yeah!)—still rocking a mic\nDropping it like a shot—you get wobbly, wobbly\nLike crooked cops on block who try to follow me\nNothing I splash is weak.  I speak like a flash of the acid leak\nSlave to the rhythm and give ‘em a masterpiece (Voilà)\nDoomsday dialect dominate dialogue\nChange your dull college dorm to a dancehall (Dope)\nNo heroin, crack, X, liquor, and weed\nI’m Brand Nubian (What?)—I “Slow Down” to catch speed\nI slap MCs who don’t spit hard like C\nAnd the front row is beef—prepare to catch teeth\n\n[Hook: C-Rayz Walz] (x2)\nSpit hard!  (Spit hard!), keep rocking the mic\nSpit hard!  (Yeah!)\nSpit hard!  (Spit hard!), keep rocking the mic\nSpit hard!  Bitch, no ho’s bars\n\n[Bridge: C-Rayz Walz] (x8)\nSpit hard!\n\n[Outro: C-Rayz Walz]\nWhat?  Still rocking"}]}