{"songs": [{"image": "https://images.genius.com/d7cb8616465549cc89d5e8bfc9ba7e99.640x640x1.jpg", "year": "2018-08-31", "lyrics": "Songtekst van Sevn Alias – \"Niet Down\" ft. Mr. Probz\n\n[Pre-Chorus: Mr. Probz]\nIk weet, je hebt geleefd\nEn de jaren zijn niet lief voor jou geweest, nee\nMaar wat je leert dat neem je mee\nZe zeggen dat tijd alle wonden heelt, hey\n\n[Chorus: Mr. Probz]\nMaar ze krijgen je niet down, krijgen je niet down, nee\nAl geeft het leven een beat down, krijgen je niet down, nee\nMaar ze krijgen je niet down, krijgen je niet down, nee\nAl geeft het leven een beat down, krijgen je niet down, nee\n\n[Verse 1: Sevn Alias]\nEenieder z'n eigen struggle, eenieder gaat door de mist\nEenieder z'n eigen hossel, eenieder z'n eigen plicht\nEenieder heeft ooit vertrouwd in zichzelf, eindstand vergist\nIn een persoon, dat is gewoon\nPeople come and people go\nJij bent verbaasd hij is geslipt, je zat ernaast, je had het mis\nIn die donkere dagen kwam z'n ware aard aan het licht\nProbeert goed te zijn voor mensen maar ze laten je gezicht\nKeer op keer weer vallen voor wat money of een bitch\nNu ben je boos, heel je hoofd in de knoop door hoe het loopt\nEn je blijft stil maar geeft daardoor wel eerder de eerste stoot\nIn een benauwde situatie twijfel jij niet, jij bent koud\nEn gooi je alle pijn eruit die je al jaren binnenhoudt\nVan buiten hard als steen en je hart die is van goud\nNiet het type die opgeeft, ook al gaat het vaker fout\nEcht, ik ken je beter dan je denkt, 365 dagen voel ik me als jou\n\n[Pre-Chorus: Mr. Probz]\nIk weet, je hebt geleefd\nEn de jaren zijn niet lief voor jou geweest, nee\nMaar wat je leert dat neem je mee\nZe zeggen dat tijd alle wonden heelt, hey\n\n[Chorus: Mr. Probz]\nMaar ze krijgen je niet down, krijgen je niet down, nee\nAl geeft het leven een beat down, krijgen je niet down, nee\nMaar ze krijgen je niet down, krijgen je niet down, nee\nAl geeft het leven een beat down, krijgen je niet down, nee\n\n[Verse 2: Sevn Alias]\nSelf-made, ik ben zelf gemaakt\nNiemand die het voor me deed, ik heb 't zelf gemaakt\nVroeg in de ochtend op en blijven rennen tot laat\nOm te komen waar ik ben, deed ik het zelfde vaak\nBen niet geliefd, begrijp niet hoe ik je kan hebben geraakt\nMaak geen contact, ken ik je niet kijk ik je zelfs niet aan\nJij bent boos want jij bent zelf niet aan\nBoos op mij voor al die kansen die je zelf liet gaan\nJij zoekt respect maar jij bent zelf op haat\nPraat over mij, maar tot hoeveel ben je zelf in staat?\nIk ken je van vroeger, toen was je ook al een hater\nDus in feite ben je al jaren dezelfde dwaas\nFuck it, ik weet dat money zichzelf niet raapt\nDaarom ren ik en heb ik nog steeds dezelfde haast\nJij kon al lang zoveel stappen hebben gemaakt\nMaar je was bezig met mij en bleef op dezelfde plaats\n\n[Pre-Chorus: Mr. Probz]\nIk weet, je hebt geleefd\nEn de jaren zijn niet lief voor jou geweest, nee\nMaar wat je leert dat neem je mee\nZe zeggen dat tijd alle wonden heelt, hey\n\n[Chorus: Mr. Probz]\nMaar ze krijgen je niet down, krijgen je niet down, nee\nAl geeft het leven een beat down, krijgen je niet down, nee\nMaar ze krijgen je niet down, krijgen je niet down, nee\nAl geeft het leven een beat down, krijgen je niet down, nee", "title": "Niet Down", "album": "RECASSO"}], "artist": "Sevn Alias"}