{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "Won (Part 2)", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "[Pacewon]\nThis is a story, of a man\nUnlike any other man, for this man is the.. WON!\n\n[Break: repeat 4X]\nYo, yo, yo, yo, yo\nYo, yo, yo, yo, yo (WON!) (Pacewon..)\n\n[Pacewon]\nAll across the world from the UK to Canada\nNever have you seen a rapper of this calibre\nRock the microphone with energy and stamina\nBrother so nice you could spell it out in algebra\nP-Won MC = 10 of y'all squared\nA hundred rappers scared I'll put dent in y'all beard\nGrab you by the neck, stick a pen in y'all hear\nThat's what your label get for sendin y'all here\nWhy fight when you know you can't win?\nYou climbin up the ladder but I'm the champion\nAnd these some awfully big shoes for dudes to stand in\nDespite who you know or where you campin\nYou see, what y'all flip and make on the first\nI trick off on broads, take home ya Earth\nFuck with a creole girl, take home the curse\nLeave out the hospital, take home the nurse\n\n[Hook: Pacewon]\nAll these lil' jokers wanna play my game\nBut I'm boss here, say my name (PACEWON)\nSee I'm comin with the rhyme, my crew mad deep\nI declare war, who that be? (PACEWON)\nAll these thick-ass pretty women checkin me out\n\"Say My Name\" like Destiny's Child (PACEWON)\nJust speakers in the car baby no backseat\nHear the bass kick, yo that's me (PACEWON) c'mon\n\n[Break]\n\n[Pacewon]\nI'm way out of this world, superspectacular\nI'm the O.G. that bit Dracula\nMake a slick kid mackadocious\nStay away from young girls, I crack a ol' bitch\nWifebeater, like Ike Turner\nCarry five heaters and like 9 burners\nYour homegirl like it, 14 guns\nThe more heat I bring, the more she cums\nDebonaire, never fear\nMad tipsy off Grand mixed with Everclear\nI got a, QB of 'dro and like 60 bucks\nParked my whip, a limo driver picked me up and\nI jump in and smokin Hawaiian\nWatchin \"Late Night with Conan O'Brien\"\nHit the studio your homegirl meet me\nDeeply entranced by my CD, easy\n\n[Hook]\n\n[Break]\n\n[Pacewon]\nYou can see it my aura\nI'm happy as a lil' kid playin Pop Warner\nAnd it's all thanks to my pops and {Ipora?}\nI'm a performer not standin on the corner\nMade my house warmer than a sauna or jacuzzi\nFlew me to Italy\nP.E. #1, I'm the epitome\nI, dribble a riddle, hit a kid with a fiddle and\nWiggle a lil' with my dick in the middle\nJust pull up in the alley with 10's on the chariot\nGot a 9-M-M and I do carry it\nRock hell's bells, smoke weed, sell shells\nCool as LL, well well\nSee me like 6 tours later, superfresh nigga\nBest lookin girl in the club, I left with her\nShocked the fuck out, yeah we all are\nWe ain't wannabe b-ball stars this is rap music\n\n[Hook]\n\n[Break]", "year": null}]}