{"artist": "Cage", "songs": [{"title": "In Stoney Lodge", "album": "Movies For The Blind", "year": null, "image": "https://images.genius.com/a543bef5a47f37a8aeba1d69065b95ac.500x500x1.jpg", "lyrics": "[Intro: Man talking:]\nAnd this story just in from the wires of the associated press\nThe incidents of mental illness in the United States appears to be on the\nIncrease\n\n{*He's losing his mind!*}\n\n[Verse 1: Cage]\nStrapped to the bed, semi-conscious half in dead\nSpit on the head-nurse and got brushed like I smacked a fed\nHoldin' me down while the nurse brought me drugs\nTook out the needle like Roc Raida and shot me up like Courtney Love\nA fuckin' zombie on Haldol, look how I'm walkin'\nStandin' around like crowded shows in Boston\nI'm earning points, but the points not what my parents see\nDemerit me, I pulled out my dick in group therapy\nDust the gorilla till they passed the Glock to Kong\nGetting smacked around the ward and put in restraints by Dr. Strong\nManic, depressed slashed chest keep a eye full\nSorry, we found Prozac makes bipolars suicidal\nNo family visits add fuel to the engine\nDescending my fist on my stepdad's faggot face for attention\nAnd when a T. A. comes in the room like, \"What's the matter?\"\nI'm eating the brownies mom made then smacking her with the platter\n\n[Hook]\n*{I wanna roll with the Devil}*\n\n[Cage talking in backround:]\nNothing works here\nI've been here for seven years\nThe medication don't work\nNothing works here\nI've been here for seven years\nI hate this place\n\n[Verse 2: Cage]\nI'm starting to adjust, holding my dick to escape the lust\nTill these girls in group explain their rapes and busts\nSwitched to jeans, conformance with a different tee\nMy performance to my parents deserves a Azipramine\nAnd after a year when they ask me why I'm still here\nI'm like, this shit is college for my fuckin' rap career\nNew bitch on the unit, fine, fuckin' her first\nPut on suicide watch and jerk in front of the nurse\nMolested bitch with tits and loves beatings\nDoing ant hills of dope thinking it's coke at drug meetings\nAnd when she starts to fucking seizure I'mma leave her\nBy the freezer while I'm taking breathers of ether with a fever\nJack the phone calling my friends fake faggots\nKicking the nurse in her tits when they throw me a straitjacket\nThat's what you get, dumb bitch, now you're crying pet\nWhile I'm waiting for the drugs to kick in like a dying vet\n\n[Hook]\n\n[Verse 3: CAge]\nI'm getting desperate, I'm thinking my only exit\nWas jerking off in medicine cups and get this bitch pregnant\nI'm trying to make it through group with no jokes of shitting permitted\nTry signing yourself out and not getting committed\nMy family sessions go great, with a slap to the mouth\nAnd my stepdad's like, \"You ain't coming back to the house!\"\nLook who's the better patient\nI went to rape the nurse in the nurse's station, broke in and took some medication\nOn Thanksgiving I stuck my dick in the turkey\nAnd had the doctor on-call play with my dick checking for herpes\nDoctor is strange, swinging the open locks\nUnder a blanket while the whole unit tear me with soap and socks\nA silent child, plotting a violent style\nTalking to a rifle out-loud like Private Pyle\nTeen geek with a gut, lookin' to fuck, but stuck out\nHolding my doctor hostage cause I can't get the fuck out\n\n[Outro:]\nMan 1 talking:\nIt's horrible!\nHe's losing his mind\nThat's the only explanation\n\nMan 2:\nHe's gone berserk\nThe man is obviously a lunatic\n\nMan 1:\nIt's apparent that his actions can only be described as the ravings of a mad man\n\nWoman X3:\n{\"The patient has shown no progress\nThe medication is not working\"}\n\nMan 2:\nHe's gone berserk\nThe man is obviously a lunatic\n\nWoman:\n{\"The patient has shown no progress\"}"}]}