{"songs": [{"lyrics": "[Intro]\nFucking drug shit\nDo the drugs\nYeah\nYo\n\n[Verse 1]\nStraight from the depths of Queens.\nLeave you sleeping on the mezzanine\nLike you Lincoln, then switch into a desert scene\nOften heard, but this motherfucker seldom seen\nI'm throwing blows while you waiting for the bell to ring\nDrug smoking\nRaisins make the pasta sweet\nSlumped over when the barrel and your posture meet\nStay lean like some motherfucking ostrich meat\nYou full of shit it's time to get a colonoscopy\nScissor kicks, dick suck from Miss Elizabeth\nLex Luger arms\n4 in the morning in the dark with the computer on\nWasting my time, my thoughts are paced, untastable grace replaced in my mind\nBorn to shine like the eyes on a cat\nSame cat fuck around, put the knife in your back\nThis is nothing, we live & let die and roam the land\nAnd you bluffing\nYou lifted the cards and showed your hand pussy\n\n[Verse 2]\nTailor-made rubber, Rubbermaid reliable\nNever spill the soup\nRock a linen suit\nPlay the streets like the ball court\nSpin & shoot\nStrong as Popeye dipping in the spinach too\n\n[Verse 3]\nTake my nuts out your mouth\nLet me breathe for a minute please\nYour life is cheap like a hooker in the Philippines\nAbout to be a huge star and I'm still in Queens\nYou're on the shelf like a figurine\nDrugs infested my mind\nBut I'm destined to shine\nSpit the shit to keep these motherfuckers pressing rewind\nThousands of pounds of pressure pressed on your spine\nLive divine, free the mind, lead the blind, read the signs\nHands up like you stepping in the party\nNo you getting robbed, motherfucker, with the shotty\nSaid you pottyd\nMake your body do an ollie\nThen dig your shorty out cuz I geeked her up on molly\nHave her eating dick, no need for seasoning\nIf seven dudes are in the room then she's pleasing them\nLike a trooper. Hit her in the pooper. Throw her in the shower\nThen I take her out to Lupa\nI'm kinky, I'll hit it even if it's stinky\nPut em in the shower, make the pussy brand new\nRan through. Give 'em money what I can't do\nStuff her lunchbox & burn her with the candle\n\n[Verse 4]\nUH!\nConsensual Rape\nVinegar solutions\nAnimal abusing\nBarrel revolutions\nDon't get me pissed off, fuck around rip your tits off\nStill getting head, even if my dick's soft\nRising quick, no Fleischman's\nI'm in the endzone with one leg up, posing like Heisman\nThrowing like Theismann, sway foot\nWith the Village Leader smoking a pipe with seven wise-men\nI eat the biggest piece of chicken at the table\nLet 'em know I'm hungry\nPolo on the rugby\nThe forty-four long surely got a trusty home\nTrying to live American Dreams...Dusty Rhodes\n\nYeah\nFucking Pussy", "title": "Consensual Rape", "album": null, "image": "https://images.genius.com/4c92d833aae01e64b71a556bb1cb9f0b.990x660x1.jpg", "year": null}], "artist": "Action Bronson"}