{"songs": [{"year": null, "title": "Do it Again", "image": "https://images.genius.com/f9892894da5ef46b99300e48b63438cd.1000x1000x1.jpg", "lyrics": "[Intro]\nNo diggity, Bronx style yeah, yeah\n\n[Hook: x3]\nIn the daytime, on the late night\nIn the morning, on the wake-up\n\n[Verse 1]\nMere words can't describe the great X\nIs it the shoes on the back's house that got ya callin' out to ya girlfriend\nFool came through last night, with the manly\nMade me forget about Stanley\nFor real I came charged off the Staten Isle\nI'm like three or four down, twisted\nGivin' away smoke\nSweatin' takin' off my coat\nHoney walked by all fly and dropped my drink on my leather\nAnd now my shit is fucked up\nAnd now I gotta bill, but I cooled out, I see potential\nAnd I got a eye for spottin' kind of like Spike\nMiss Chocolate, Miss Brown, Miss Black\nMiss Long Leg, hey I'm ready to beg\nCan't do that\nA vision of the deep, dark soul of home\nAnd claimin' niggas with, so\nHey watch the honey roll, check it\nSurround sound hides ya cries\nTell ya neighbour lies\nNo that wasn't me that was my cousin\nHey you're a school girl\nBut hey you're in a different world\nYou're a fly chick\nYou wanna learn a different trick?\n\n[Hook: with 1 repeated in background]\nNow can I do it again, do it again\nSteady do it again, do it again\nAnd then ya do it again, do it again\nSteady do it again, do it again\nAnd then ya do it again, do it again\n\n[Verse 2]\nLife is slim, put me on to a game\nHad a lot of style in that last profile\nGot her nails filed and her hair done weekly\nA real name thrower, y'all nigga's know her\nTalkin' about garbles comin' out in ten\nDrinkin' goblets of gin and ain't givin' up trim\nTease a nigga, make em' wanna squeeze a trigga'\nThey say a woman's best is diamonds and a man is a dog\nBetter come in from that fog that you swimming in\nBrown skin, laid out in bed is real feminine\nI'll do that R. Kelly on ya\nFingers have some smelly on ya\nThe boy dry humps is now man pumps\nCan he go deeper than the explorer\nFirst 120th street horror\nLet's get naked by the laptop\nCan I see that thing pop?\nYou can squeeze and then stop and be all up in that piece\nI'm the late night window climber, you want the rhymer\nYa mom thought you heard you wouldn't be fuckin' in the house\nNot you momma's sweetheart, undercover freak-heart\nImagine if she would've seen us intertwined and pretzel style\nLegs and arms, hummin' with the radiator clickin'\nOur soft patience quickin'\nI couldn't slow the pace\nI bust off three nuts and awake, the sun's in my face\n\n[Hook: with 1 in background]\n\n[Verse 3]\nI'm runnin' around handlin' things and then like BAM!\nA toss of that ass hit me like out of nowhere\nAnd hey like a flashback honey\nThere was a one should slipped off since day one\nCheck it out-uh!, now can I do it again?\nSure I can do it again!\nGet on some freak shit next time and bring along ya friend\nSee how the world turns\nLook beyond the floor burns\nAt least I have concerns\nI didn't treat ya like a chicken\nI love ya sexually plus intellectually\n\n[Hook: with 1 in background]\n\n[Various ad-libs to fade]", "album": "Wild Cowboys"}], "artist": "Sadat X"}