{"artist": "IDK", "songs": [{"title": "Mrs. Lynch, Your Son Is The Devil", "lyrics": "[Intro (Skit): Voicemails]\nHi Mrs. Lynch, this is Mrs. Zubrod. I'm calling from Deerfield Elementary about your son, Jason. Um, I've been having a few concerns just about his ability to focus in class. There are some options that I've briefly discussed. Um, we see this a lot with children and it might be some form of ADD. I'm not a doctor so I would suggest that maybe-\nUh, Mrs. Lynch, this is Mr. Bailey, Jason's fifth-grade teacher. I'm calling 'cause I'm very concerned about your son. It seems very possible that he will not pass the fifth grade. He's been failing very regularly-\nMrs. Lynch, this is Principal Reynolds, calling again for the third time. Please give us a call back as soon as you can. Jason has been suspended from school yet again for getting into a fight. Um, he's becoming a real problem for the kids. It seems he's getting into an altercation every other day. Um, we've tried to reach out, we're trying to help him. But there's only so much I can do. Mrs. Lynch, we have no choice but to suspend your son immediately-\nThis is Detective Pearson with the Third District Police Department. We are searching for Jason Mills; he's been implicated in a armed robbery case. We have a good bit of evidence that Jason is involved. Please get in touch with us as soon as possible. It's nothing to worry about, hope I hear from you soon-\nHi, this is Stacey from State Farm. The total for this case will be 7,550 dollars. Please give me a call back and let me know how you'd like to process the payment-\nYou have ten minutes remaining\n\n[Intro: Jessica Samiere]\nI can't take it, I can't take this shit no more\nI can't take it, I can't take this shit no more\nI can't take it, I can't take this shit no more\nI can't take it, I can't take this shit no more\nI can't take it, I can't take this shit no more\nI can't take it, I can't take this shit no more\nI can't take it, I can't take this shit no more\nYou gon' be bad forever\nForever, forever\nNigga, you gon' be bad forever\nForever\n\n[Verse: IDK]\nWho the realest?\nWho the gangsta? Who the killa? Who that nigga?\nWho the trillest?\nWho the shooter? Who got shot? Who survived?\nWho diminished? Who the witness? Who detective?\nWho the medic? Who the dead? Who arrested?\nYou the dead, you the lesson\nWe survived, we ain't stressin'\nI was tryna live it, I was tryna be it\nI lived with my mother and stepfather, both had degrees, was heated\nWent the college route\nBut I doubt that I'm going to college now\nI was tryna be flyer than Batman so I got me the strap, man\nAnd I started stealing and turned into Robin now\nI'm just a middle class nigga who's class was a mixture\nOf them spellin' bee winners and them PG killers\nFlop flop flop flop, hit your ass with bananas, they gorillas\nKnock knock knock knock at my door, asking me to come and kick it\nI was different, see my family distanced me but I was curious\nThe mystery of chilling down the street, knowing I shouldn't be\nWas lit to me and that's the reason why that I am literally\nThe only one to go to jail in my family's history\n\n[Chorus: IDK]\nA \"good home, I don't give a fuck\" trap nigga\nSteal the strap from my neighbor's safe, blap blap nigga\nThey gon' still throw my ass in the jail with the killers\nAt the end of the day, I'm a young black nigga\nI'm a \"good home, \"I don't give a fuck\" trap nigga\nSteal the strap from my neighbor's safe, blap blap nigga\nThey gon' still throw my ass in the jail with the killers\nAt the end of the day, I'm a young black nigga\n\n[Outro: Jessica Samiere]\nWho's that knocking? Who's that knocking at my-", "image": "https://images.genius.com/362b37d757b597e3bf2bce15e7e93eef.630x630x1.jpg", "album": "IWASVERYBAD", "year": "2017-09-30"}]}