{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3e158cf3abe010fdfaca43743614210f.485x480x1.png", "title": "I’m On It", "lyrics": "[Hook]\nI’m on it\nI blow a hundred million, make another hundred mil, bitch\nI’m on it\nI hustle hard, oh my God, look at me I’m so rich\nI’m on it\nMy swag on a hundred, yeah that fly shit I want it quick\nI’m on it\nI’m always on point, man I make niggas so sick\n[Verse 1]\nI’m chin chillin, crystal spillin’\nHip hop’s villain cause I’m making a killin’\nNiggas wanna try me, I’m strapped with the lammy\nIf Jay’s Illuminati, what am I, am I Bugatti?\nLodi Dodi, we like to party\nBig 4 in the morning, go outside and catch a body\nI ball full time nigga this is not a hobby\nIf you don’t know about me, better ask somebody\nYeah, I’m grimey, my wrist so shiny\nMy Audemars, I blew a mil, I’m back to making money\nMy swag make her want me, why else would she be on me\nI bet she hardly want me? I think she want to blow\nLick me like a lolly, lick me like a lolly\nHer ass ain't all that but her tits like Dolly’s\nGive me that punani, give me that punani\nNow this is motivation make me want more money\n\n[Hook]\n\n[Verse 2]\nI got it, black card in my wallet\nFind me on locations with model bitches are spotted\nFly shit I rock it, Tom Ford, exotic\nBitches on my dick now that I moved up out the projects\nOne for the money, two for the show\nI’m ghetto like a mothafucka, what you didn’t know?\nTook threes for my niggas gettin’ 8 hundred an O\nKush burn slow, I burn dough\nAnd sip Merlot like I’m on furlow\nFresh up out the pen, I’m back at it again\nThumpin’ like the system in my new big body Benz\nLook I’ma Fat Joe, my neck glow\nThe lights hit the ice, its a special effects show\nTinkle twinkle little star, no one here knows who you are\nMe I’m so big, notorious you dig\nThe paper’s no problem when you're fucking with the kid", "year": "2011-08-03"}]}