{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/e0ea79e92740b25229e135d427f33f01.400x400x1.jpg", "title": "Allah vs Christ", "year": "2012-08-08", "album": "Hail Dark Lord Vader", "lyrics": "[Intro]\nBismillahirrahmanirrahim\nAlhamdulillahi Rabbil Alamin\nArrahmanirrahim\nMalikiyaw middin\nIyyaka na’budu wa iyyaka nasta’in\nIhdinassiratal mustaqim\nSiratalladhina an’amta alayhim\nGhayril maghdu bi alayhim waladdallin\nLord Vader\n\n[Verse 1]\nThere's a Shepard and a lamb in a manger\nThe lamb is in danger\nFor angels told the stranger that it needs the blood from it\nHe does love it but God said cut it\nSo fuck it the Shepard guts and hits the stomach\nWipes the blood on the front of his forehead he's anointed\nAppointed as a soldier for God, who's dissapointed?\nWell Allah is he's sick of Jesus\nBoth of them Middle Eastern\nHope they can get to speaking but no one would give a reason\nWhile there is tension between Muslim and the Christian\nThis is funny cause Lucifer also uses this against them\nTo win souls cause them folks change when the wind blows\nRepent full sins or replace where you've been\nOn your knees you're chin's on the holy carpet\nAss up you done started Muhammad Islamic\nNow you fast for weeks, bring to the East\nMaybe if we see the Arab in the mighty Jew\nFight to death praise me\n\n[Hook]\nAllah is a God\nStrap on, strap on bombs and die for him\nJesus dies for all\nOn crosses, crosses crucified for men\nAllah versus Christ\n\n[Verse 2]\nYo, if it means dying upset to travel\nBlessed to see epic battles\nRequest to be in their actual face\nAs legends capture moments so holy\nOnly these opponents cause commotions\nThat stir in oceans and planets and solars\nThat's over a hundred of millions of light years, yes I am right here\nLightning don't strike fear cause lightning is like spears\nAimed at the heart of the Gods been fighting for nine years strait\nNo breaks sometimes so violent I cry tears\nBut this was meant to happen in the scriptures but with different matches\nSatan was supposed to be in action, he's the champion\nEach time that Jesus is hit, it's like a fetus been ripped\nRight out of a women's womb, the bleeding's intense\nOne of our lords are doomed, what's the real meaning of this\nHe grabs the sun picks up the moon, yes the beatings begin\nSo much suffering I can't believe\nWas 13 when I first seen it now I'm 83\n\n[Hook]\n\n[Outro]\nCongregation, don't you ever let someone tell you that Jesus did not die for you and your sins. That you are not washed in the blood of the lamb. That you are God's children. For God thought of the world that he gave his only begotten son. For whoever believed in him, Jesus"}]}