{"artist": "Ice Cube", "songs": [{"title": "Check Yo Self", "lyrics": "[Intro: Das EFX]\nYeah, word is bond\nDas EFX in this yaknowhatI'msayin\nStraight from the sewer, word is bond\nWe doing this with my nigga\nWhere my nigga Ice Cube in the motherfucker\nWord is bond, yeah\n\n[Verse 1: Ice Cube]\nYou better check yo self before you wreck yo self\n'Cause I'm bad for your health\nI come real stealth\nDropping bombs on your moms\nFuck car alarms\nDoing foul crime\nI'm that nigga wit'cha Alpine\nSold it for a six-o, always let tricks know\nAnd friends know we got the indo\nNo I'm not a sucker sitting in a House of Pain\nAnd no I'm not the butler, I'll cut ya\nHead-butt ya, you say you can't touch this\nAnd I wouldn't touch ya, in fact mothafucka\nHere to let you know boy - oh boy\nI make dough but don't call me Dough Boy\nThis ain't no fucking motion picture\nA guy or bitch-a, I'll get wit-cha\nAnd hit you taking that yak to the neck\nSo you better run a check\n\n[Hook: (Das EFX) & Ice Cube]\n(So come on and chickity-check yo self before you wreck yo self\nChickity-check yo self before you wreck yo self\nYeah, come on and check yo self before you wreck yo self)\n'Cause shotgun bullets are bad for your health\nMic-mic-microphone check (One, two! Check it!)\nMic-mic-microphone check (One, two! Check it!)\n\n[Verse 2: Ice Cube]\nTricks wanna step to Cube and then they get played\n'Cause they bitchmade pulling out a switchblade\nThat's kinda trifle 'cause that's a knife, ho\nAK-47, Assault Rifle\nHold the fifty, I'm nifty, pow\nI gotta new style (Watch out now)\nI hate motherfuckers claiming that they folding bank\nBut steady talking shit in the holding tank\nFirst you wanna step to me?\nNow your ass screaming for the deputy\nThey send you to Charlie-Baker-Denver row\nNow they runnin' up in you slow\nYou're gone, used to be the Don Juan (check that shit out)\nNow your name is just Twan\nSwitch it, snap it, rolling your eyes and neck\nYou better run a check\n\n[Hook: (Das EFX) & Ice Cube]\n(So chickity-check yo self before you wreck yo self\nCome on and check yo self before you wrickity-wreck yo self\nSo chickity-check yo self before you wreck yo self)\n'Cause big dicks up yo ass is bad for ya health\nMic-mic-microphone check (One, two! Check it!)\nMic-mic-microphone check (One, two! Check it!)\n\n[Verse 3: Ice Cube]\nIf you're foul, you better run a make on that license plate\nYou coulda had a V8\nInstead of a tre-eight slug to the cranium (POW!)\nI got six and I'm aimin' 'em\nWill I shoot or keep you guessing?\n'Cause fuck you and that shit you're stressing\nBitch get off the wood, you're no good\nThere goes the neighborhood hooker (slut)\nGo ahead and keep your drawers\nGiving up the claps and who needs applause\nAt a time like this, pop the coochie and you dead\nThe bitch is a Miami Hurricane head\nSprung, niggas call her 'Lips & Lungs'\nNappy dugout, get the fuck out\n'Cause women like you gets no respect\nBitch, you better run a check\n\n[Hook: (Das EFX) & Ice Cube]\n(So chickity-check yo self before you wreck yo self\nSo chickity-check yo self before you wreck yo self\nCome on and check yo self before you wrickity-wreck yo self)\n'Cause bitches like you is bad for my health\nMic-mic-microphone check (One, two! Check it!)  come again check it\nMic-mic-microphone check (One, two! Check it!) come again check it\n(Chickity-check yo self before you wreck yo self\nYou better chickity-check yo self before you wreck yo self\nI said check yo self before you wrickity-wreck yo self) check, check\n(Chickity-check yo self before you wreck yo self\nYou better chickity-check yo self before you wreck yo self\nI said check yo self before you wrickity-wreck yo self) check, check\nMic-mic-microphone check\nMic-mic-microphone check  (check it, one, two!)\nMic-mic-microphone check  (One, two! )\nMic-mic-microphone check  (check it, one, two, one, two!)\nMic-mic-microphone check  (one, two!)\nMic-mic-microphone check  (check it, one, two!, one, two! )\nMic-mic-microphone check  (one, two)\nMic-mic-microphone check  (Check yo self Cube, Check yo self Cube, check yo self... )", "image": "https://images.genius.com/0677f47979a7fbd2c524112d0cad8e56.500x487x1.jpg", "album": "The Predator", "year": "1993-08-17"}]}