{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "[Intro - Akrobatik - talking]\nHa (ha)\nWe gonna fuck y'all head up with this one (head up with this one)\nYeah (yeah)\nPerceptionists crew (Perceptionists crew)\nBeantown got my back (got my back)\nSo let's fuckin do it (let's fuckin do it)\n\nYeah c'mon, c'mon\nLet's go, yo\n\n[Verse 1 - Akrobatik]\nPump your fists like you won the World Series\nFor the brother that be causin your analysis in theories\nY'all to near me not to hear me\nIf it's a beat that's errie, then you know you in store for somethin ser-ious (word up)\nI burn mics period, leave 'em in flames\nOne of the only names consistent in the game\nIn the last decade, to remain prominent (yeah)\nSold out shows on multiple continents (woo)\nFrom Boston to Australia, got sisters singing like Mahalia Jackson, live action\nFuck with Akrobatik and you endin up in traction (what?)\nI don't start shit but brother fear my reaction (yeah)\nBeen around the world more than Crazy Legs' backspins\nI got it done, while you at home high, relaxin\nWorkaholic, about to become a murkaholic\nYou easy to fool, fans think these jerks are brolic?\n\n[Hook - Akrobatik]\nY'all people need to (step it up, up, up)\nBum rappers y'all need to (step it up, up, up)\nLame promoters niggas (step it up, up, up)\nDon't ever try to test my rep kid, what (what?)\n\n[Break - Akrobatik]\nMake your moves and get your dough\nAnd count your money and rip the show\nAnd get some rest and rock some more\nAnd make your calls and hit your flow\n\n[Cuts by DJ Jayceeoh of \"step it up!\" repeated several times behind Break]\n\n[Verse 2 - Akrobatik]\nYo, this ain't no \"Sports Rap Up,\" it's brute force rap, what\nThey say a rapper's only as good as his last cut\nSo I make sure they all knock (all knock)\nFrom my brain, to the lab, to the store that it's pumped on y'all block (y'all block)\nThese other niggas couldn't be weaker\nI make 'em obsolete soon as my voice hit the speaker\nThey need to step their rap game up\nCause they whack lame fucks, fuckin it's up, even they names suck (woo)\nBut Akrobatik sets new standards\nI'm too candid (what?), programmed to do damage\nAttitude is similar to Bruce Banner's\nUsually laid back, but piss me off and I'm a loose cannon (uh)\nI make Babylon fall with a \"yes y'all\"\nIf that don't work, niggas could brawl and\n\n[Hook - Akrobatik]\nIf we do, you better (step it up, up, up)\nRadio, they need to (step it up, up, up)\nBum rappers, y'all need to (step it up, up, up)\nYeah, don't ever try to test my rep kid, what\n\n[Break - Akrobatik]\nMake your moves and get your dough\nAnd count your money but rip the shows\nAnd get some rest and rock some more\nAnd make they calls and hit your flow (flow)\n\n[Cuts by DJ Jayceeoh of \"step it up!\" repeated several times behind Break]\n\n[Verse 3 - Akrobatik]\nFools wanna know if I'm known in my hood\nStupid, does a bear shit in the woods?\nAnd wipe his ass with a furry white rabbit?\nI'm the biggest thing to come out of Boston since \"I Got To Have It\"\nNext to Akrobatik you sound average\nIt's like comparin sour diesel to old cabbage\nSo come on my tour, carry my baggage\nStand at the side of the stage and see the total package\n\n[Hook - Akrobatik]\nAnd go home and (step it up, up, up)\nTell your whack friends to (step it up, up, up)\nBum rappers y'all need to (step it up, up, up)\nDon't ever try to test my rep kid, what\n\nYeah, yeah, yeah", "title": "Step it Up", "album": "Absolute Value"}], "artist": "Akrobatik"}