{"songs": [{"year": null, "image": "https://images.genius.com/b28f41628e146430259753a9d1acaf9a.500x500x1.jpg", "title": "Spit Six", "album": "I.M. 4-Eva", "lyrics": "[Intro: Big Shug]\nAY! Heh Ha! One two one two. Big Shug baby!\nSpit si-i-x! AH HA! Lil' different right now AH HA!\n\n[Verse One] [Big Shug]\nI break bread with six, different cats\nRoll like a funeral in six, Cadillacs\nWith six, mini skirts, popped up in the back\nFive, four, or six hours to six, different tracks\nCome back in six hours with six, different stacks\nOpposition get knocked out, with six different taps\nTry to rob my chicks, get hit, with six claps\nIt's still me and Preme two albums and six tracks\nSix booms six baps that's six thorough tracks\nFrom two veteran niggas real Gang Starr cats\nIt's hip hop baby, I always been wit' it\nDo twelve interviews and slap, six critics\nI want, six grand for my first stand\nAnd I want, six grand for my last stand\nIt's the new Lee Majors, six million dollar man\nBig Shug niggas! And I rep Murderpan\nSpit six, six, six\n\n[Scratch Chorus]:\nS-S-S-Six-S-S-S-S-S-S-S-S-S-Six-\"Ice T\"\nB-B-B-B-B-B-B-B-B-B-B-Big Shug-\"Big Shug\"\nThe-The-The-The big word on the street-\"Ghostface Killah\"\nB-B-Bi-Big-Big-Sh-Sh-Sh-Sh-Shug-\"Big Shug\"\nB-Big-B-Big-B-Big-B-Big-B-Big-B-Big word on the street-\"Ghostface Killah\"\nY-Y-Y-Y-Y-Y-Y-Your street scholar, keep firin is what they tell me-\"Memphis Bleek\"\n\n[Verse Two] [Big Shug]:\nI'm quick to smack, six niggas\nPay six more niggas to smack, six more niggas I break\nSix chicks with six, different lines\nHave 'em do the same crime like six, different times\nAt six o'clock, hit 'em all, six different times\nWhen I go to war, I'm bringin six different nines\nAnd shootin from each one, like six different times\nSo that's, six deaths, six suits to get\nSix crazy cats left wet AH HA!\nSo we, leave town six limos six jets\nSix stripes, like Vietnam vets\nLive life lavish, six kids and six pets\nSix maids and six chefs, great steaks and french strips\nSunkin' living rooms with six steps\nPhone text, I receive like six, death threats\nKeep it away from the crib or you'll see bodies left\nI don't spit six, for the devilish rhymes\nI'm Godly I spit six, seven different times\nAH HA! AH HA! AH HA!\n\n[Scratch Chorus]:\nS-S-S-Six-\"Ice T\"\nS-S-S-S-S-S-S-Si-Six-\"Ice T\" (Yeah spit six baby, it's just a lil' different)\n(Bop your head man! Bug Shug! DJ Premier! Holdin it down man, for the foundation)\nThe-The-The big word on the street-\"Ghostface Killah\"\n(Y'all know! AH HA! AH HA!)\nB-Big-B-Big-B-Big-B-Big-B-Big-B-Big word on the street-\"Ghostface Killah\"\nB-B-B-B-B-B-B-B-B-B-B-B-B-B-B-B-Big Shug Baby!-\"Big Shug\"\nS-S-S-S-S-S-Six-S-S-S-S-S-Six-\"Ice T\""}], "artist": "Big Shug"}