{"artist": "Anderson .Paak", "songs": [{"title": "Departure: Bob James", "album": "O.B.E. Vol. 1", "year": "2012-06-26", "image": "https://images.genius.com/2e98f27e1ed9fbf4ec4c7c1123f5eda4.1000x901x1.jpg", "lyrics": "Skit\nThe first time it happened, I was in my 20s, uhm\nI discovered I would, I would float off, out of my body\nBy a matter of 2 or 3 feet and I would float above my body\n\nIntro\nI took a walk into the unknown\nClosed my eyes and let the most high guide my soul\nMy reflection in the moon light\nIt took a while to see it was me\nIt was me\nO. B. E\nI know you\nOhh\nO. B. E\nO. B. E\n\nO.B.E outer body experience\nO.B.E\n\nVerse 1 (Anderson .Paak)\nSitting in my bedroom counting\nMoney by the thousands\nNot enough to say but its just enough to get me up the grey\nSo I'm heading on a one way train to the Bey, up the mountain\nThe true definition of a come up\nBetter yet the definition of the perfect summer\nHotter than July as I ride through the tunnel\nThinking how can I survive in this WiFi jungle\nWas it time that I heard God mumble\nOpen up your eyes enterprise space shuttle\nPut that bitch in drive let it ride through the ruckus\nGet high motherfucker, these haters can't touch you\nHigher than the OBEY flyer\nStill whipping something from my knuckles like a slider\nShadow is to the hand and the hand is to the body as to the soul and the true definition of rock n roll\n\nOutro\nThere were shooters in all directions\nOn piece with the land\nOn the side was the weapon\nI'm a wanted man\nI'm blind, in and out of my calling\nI've gots to give my all in it\nBut Oh no, no, the God won't fall victim\n\nHey!\nWe in this motherfucker (Right!)\nWe in this motherfucker (True)\nWe in this motherfucker (Right!)\nWe in this bitch (Hey!)\n\nWe in this motherfucker (Right!)\nWe in this motherfucker (True)\nWe in this motherfucker (Right!)\n\nOutro Skit\nA man is but the product of his thoughts\nWhat he thinks he becomes\nA man is completely innocent\nOffered himself as sacrifice for the good of others including his enemies and became the ransom of the world\nIt was a perfect act\nA policy is a temporary creed liable to be changed\nBut while it holds good, it has got to be perceived with, Apostolic ..."}]}