{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/ac60efef8cca00a893f65b5ddd7347d1.640x640x1.jpg", "title": "47 Pop Stars", "year": null, "album": "It’s Pronounced “Five Two”", "lyrics": "[Intro]\nHey, yo\nAs if 47 emcees wasn't enough, I got 47 pop stars, rock stars coming at you\nYo, count them\nHere we go\n\n[Hook]\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it\n\n[Verse 1]\nSometimes i flow weird throw verbal spears like Britney\nThat literally go from here to Houston just like Whitney\nBattle me man you kidding me you just a funny cat\nI bet you 50 cents to M&Ms you won't get a nickel back\nThe track I'm ripping that cause it really ain't that hard\nSee Jesus gives destiny to every child of God\nI'm battle scarred kind of raw but what did you think?\nNo matter race religion or the color or the creed\nIf ya black brown or pink or in or out of sync\nOr hang with the beastie boys that's on the back street\nYou can live in Lincoln Park it don't matter just to me\nSee the prince of peace is guaranteed to give you what you need\n\n[Hook x2]\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it\n\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it\n\n[Verse 2]\nOne day these peeps they was going past me\nWalking with a limp eating biscuits and their hair was shaggy\nI said \"What's y'alls name? That's the question that I'm asking.\"\n\"I'm Michael, that Celine, that's Dion, that's Jackson\nRickey and Martin that's Tony and Braxton\nDrew is on the hill he just chilling and relaxing\nAlicia lost her keys and shes really kind of sad.\" and\nI said, \"You too? No doubt i know how that be happening\nBut i need all the Dixie chicks to gather in\nAnd let me just explain now the reason I'm rappening.\"\nSo i told mariah he carried my sin and died for me\nMy faith is in Christ, who on a hill called calvary\nGave his life for mine so genuine i try to be\nIf the world tries to stop me I rage against the machine\nSo i turn ya radio up and head to the spot\nGet loose like a slipknot, watch the kid rock\n\n[Hook x2]\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it\n\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it\n\n[Verse 3]\nMy uncle was eating corn on a cracker all alone\nIt was 98 degrees out and he was counting crows\nAnd it was just then my papa now he just saw a roach\nHe dropped his red hot chili peppers and then he ran home\nAnd just went they called up John the mayor on the phone\n\"It's a 311, 3 doors down. Now don't be slow!\"\nBut he was like wait a second hold a minute bro\nBefore I usher on over now there's something you should know\nJesus is the firm rock not a rolling stone\nWith him heaven, not nirvana is where you'll go\nAnd I try to show and let ya know but ya third eye is blind\nYou need to just open them up just real wide\nAnd even if you have to blink 182 times\nIt's just so obvious that it can't hide\nTLC tender loving care now he'll provide\nFrom girls to boys to men they need to let him inside\n\n[Hook x2]\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it\n\nJust do it\nJust do it do it do it\nJust do it rock to it\nPut ya hands up high and move it"}]}