{"songs": [{"title": "Believe", "album": "Church Clothes 2", "year": "2013-10-24", "image": "https://images.genius.com/dccansnhx7yt6kfhs6fgcadrb.540x540x1.png", "lyrics": "[Intro]\nOhh, welcome to the Heat Academy\n\n[Verse 1: Lecrae]\nI came home after a trip to Atlanta, a different planet\nIs where they thought I came from after my ship had landed\nTruth is I had this meeting with God and confessed my sin\nAnd he gave me this new beginning all I could do then was pen it\nI came home after a trip to Atlanta, a different planet\nIs where they thought I came from after my ship had landed\nTruth is I had this meeting with God and confessed my sin\nAnd he gave me this new beginning all I could do then was pen it\nAll down in my notebook, just a lot of verses\nMe learning how not to curse was like learning to write in cursive\nShe still flirting with me even though we up in church\nAnd I'm fighting to memorize all these verses up in the word\nYou would have never seen it coming\nA couple months ago I'm getting high with my cousin\nAnd fast forward now around campus I am buzzing\nNot really but it felt like that, it felt like rap was just another passion\nNever thought I'd be at the Grammy's talking about my fashion\nYou don't believe in God? Well how do you explain what happened?\nI promise we ain't plan it, now Christians unashamed from Zambia to Manhattan\nStill looking for the pattern? Come On\n\n[Chorus]\nWhat would it take to make you believe?\nMore fire from the sky? Another part in the sea?\nThe honest truth is, that you ain't got the power to see\nAnd let me take you on this journey, it all started with me\nWassup\nWhat would it take to make you believe?\nMore fire from the sky? Another part in the sea?\nThe honest truth is, that you ain't got the power to see\nAnd let me take you on this journey, it all started with me\nYeah\n\n[Verse 2: Lecrae]\nMost of the things I thought I'd never do I did though\nAnd I ain't nothing but a man standing up on his tiptoes\nShoutout to Kirk Franklin, but I ain't him\nI'm what happens when hip-hop lets all the Saints in\nI wouldn't call it gospel music, but I'm Christian though\nAnd this what happen when a Christian flow\nNow it's funny cause I don't really got a home\nAnd this industry saying leave him alone\nUnless he become a clone\nHave me singing the same old songs, no power in 'em\nBut I'm too hard to understand, I'm an algorithm\nAnd evidently it's evidence I'm a resident\nOf somewhere that you know that you oughta be but you never been\nSo try to get used to me, cause I'mma settle in\nReminding you to settle your heavenly settlement\nA sight for sore eyes, or an eyesore, it don't matter\nI own a label, and guess what, I'mma sign more"}], "artist": "Lecrae"}