{"songs": [{"year": "2019-07-12", "image": "https://images.genius.com/b3ca34e630840f075584e97e1dbfae6f.1000x1000x1.jpg", "title": "Family Matters", "album": "K.R.I.T. IZ HERE", "lyrics": "[Intro]\nYeah, yeah\nYeah\n\n[Verse 1]\nStraight forward with the fashion (Woo)\nOn the real, you ain't think I make it happen\nIt happens\nUntil they see the numbers on the dash\nAnd the wood grain everywhere like a casket (Dead)\nAll these haters and these hoes to me\nYou supposed to speak now\n'Cause when you marinate the game in the sauce as long as I did\nI'm supposed to eat now\nWho shows receipts now?\nCards on the table 'fore they asked for it\nOnly crash dummies need a crash course\nPut your ID away, they need your passport\nOh, you ain't know? I show you how it goes\nThey tryna block my shine like a powdered nose in the bathroom\nOf model hoes that scatter blow\nThat's a whole lotta drip\nThat's a whole lotta tired of the same old shit\nI'm back one more 'gain, though\nCount it up, count it up, with my kinfolk\nPartition my vision in the limo\nThat's a long way from givin' niggas demos\nThat's a long way from keepin' up, keepin' up\nNah, I ain't sentimental\nFamily matters more to me than the Winslow\nDark night, no joke, I'm just hangin' out the window\n\n[Chorus]\nIf I come up, you come up\nIf I ball out, we ball out\nIf I'm poppin', you poppin', I got it, you got it\nThe only thing I'm talkin' 'bout\nIf I roll up, you roll up\nIf I show up, you show up\nIf I spend it, you spend it, I'm winnin', we winnin'\nThe only thing that matters now is family\n\n[Verse 2]\nPower forward with the slashin' (Boom)\nWhen the ball's in your court, all the planet is a basket\nSwish goes the net when I splash it\nOpen lane and they thought I should've passed it (Gone)\nZero to sixty, might just miss me\nAt the spot that you pay to come and see\nThey paid me to come and sit for free\nSo you could watch how we ball out every week\nSparklers remind me of the Fourth\nWon my independence just to start a biddin' war\nCellphones rang out like some gunshots\nBang out in a Caddy with that iron, I'm just stayin' on course (Tiger)\nI'm a master, no jacket (Master, no jacket)\nI got green like a pasture\n\"You get a plate, you get a plate, you get a plate\"\nUnlike the ones from the pastor\nGive and go so they'll never know\nThey say I can't take it with me so I give more\nI guess that's why I'm 300 songs, 10 albums in\nAnd I still got the glow\nBruce Leeroy, Sho'Nuff\nWho needs a hero when they got us?\nMulti 'til the sun die, a real\nThe only movie that you could've seen without a script\n\n[Chorus]\nIf I come up, you come up\nIf I ball out, we ball out\nIf I'm poppin', you poppin', I got it, you got it\nThe only thing I'm talkin' 'bout\nIf I roll up, you roll up\nIf I show up, you show up\nIf I spend it, you spend it, I'm winnin', we winnin'\nThe only thing that matters now is family\n\n[Outro]\nBoom\nYou win"}], "artist": "Big K.R.I.T."}