{"songs": [{"year": "2008-11-04", "album": "The Renaissance", "image": "https://images.genius.com/5d721c8b6f6e8f0141dafa2547e2bd79.500x500x1.jpg", "title": "You", "lyrics": "[Intro]\nWait\n\n[Hook]\nAt the end of it all its you\nAnd at the end of it all it's you\nAnd at the end, it's you\nAt the end of it all it's you\nIt's you, it's you\nAt the end of it all its you\nIt's you, it's you\nAt the end of it all\n\n[Verse 1]\nLooking from how I see it\nWhen I finally realized couldn't believe it\nI couldn't even swallow\nHad a lump in my throat, my stomach hollow\nI had a notion that things were fishy\nBut everything was fine, so why be pissy?\nBut when you wasn't seeing me nights you get it in\nThat's when the snooping and shit, it would begin\n\"Where you at?\" \"Where you going?\"\nThat's what I get when I pick up the phone\nNot a, \"Hello,\" or, \"I miss you\"\nOr, \"The Renaissance, how does it do?\"\nSuspicious ones, though few\nCan stress out your brain, it weighs on you, man\nAnd helps your peep game, I thought it was me\nBut then I could see\n\n[Hook]\nIt was you, it's you\nAt the end of it all it was you\nAnd at the end it was you\nAt the end of it all it was you\nAnd at the end, it's you\nIt's you at the end of it all\nIt's you, it's you, it's you\nAt the end of it all\n\n[Verse 2]\nI couldn't take it\nBut the spell of love, I couldn't shake it\nEven though I would discover\nThat there was somebody else who was your lover\nYou gave me up and managed to turn the tables\nAnd all your honest words, they turned to fables\nThe things that you would accuse me of\nIt seem were the things you were doing, love\nGet it? These things you projected\nAnd I don't want to be affected\nBut when you get in love, it's never easy, love\nTo make decisions of you've defected\nYou were doing so much to try to pin me\nGoing through all my stuff, but it was empty\nAnswers, that I'm seeking\nWell, it seems I'm getting close, that I'm reaching\nAnd I was thinking, I had no reason\nCalling you a culprit, it was treason\nAnd the twinkle, in your eye\nIt was cunning, not for loving, tell me why?\nWe'll make amends if you admit it\nWe can ascend if you're committed\nYour heart, is it in it?\nIf it goes too many days, sweet love can decay from you\n\n[Hook]\nIt's you\nAt the end of it all it was you\nAnd at the end, it was you\nAt the end of it all it was you\nAnd the end, it's you, it's you\nAt the end of it all it's you\nIt's you, It's you\nAt the end of it all"}], "artist": "Q-Tip"}