{"artist": "Playboi Carti", "songs": [{"album": null, "title": "Don’t Tell Nobody", "image": "https://images.genius.com/867b62e060a762029bef659f96e439b6.500x500x1.jpg", "lyrics": "[Intro]\nDJ Lil Keem, what up?\nYeah, yeah\nWhat the fuck these niggas gotta say to me now?\nI don't give a fuck\nI'ma keep counting, nigga\n(Ooh, ooh, ooh, Carti)\nKeep counting, doing all this shit\nYou can hear my jewelry through the motherfuckin' mic\nBalenciagas (Balenciagas)\nI can't fuck with nobody (Number (N)ine jeans)\nBalenciagas, I can't fuck with anybody (Nobody)\nDollas, uh, uh\nWho that is? (Uh, uh, Plugg)\nPlug, where you at? (P-P-Plugg)\n(DJ Lil Keem, what up?)\nYeah, ooh, pipe up, yeah\nOoh, pipe up, pipe up, uh (Hoodrich)\n\n[Chorus]\nBalenciagas, I don't fuck with nobody (Nobody)\nI be in the field ready to pop on anybody (Pop on anybody)\nI just wanna bag that, bag that bitch I met at Follies\nIn a foreign drop top moving with a thotty\nMoving with a thotty trying to fuck me for my clouty (Clouty)\nMoving with a thotty trying to fuck me for my clouty (Clouty)\nBring that ho upstairs, bring that ho upstairs\nI brought that hoe to the trap but please don't tell nobody\nHo, don't tell nobody, ho, don't tell nobody\nBitch, don't tell nobody, bitch, don't tell nobody\nI brought that ho to the trap but please don't tell nobody\nHo, don't tell nobody, bitch, don't tell nobody, yeah, yeah, yeah, ayy\n\n[Verse]\nI said, \"Fuck the robbing\" for this rap shit (Rap)\nNow I'm in L.A. fucking on a model bitch (Model)\nRunning with the same gang I been running with (Gang)\nDesigning and trapping, baby, I'm so addicted\nBeen on the block, been moving with it\nWe motivated, motivated, our boys love to kick it\nI spent a show on these shoes, boy, I love to kick it\nI pay attention, don't pay attention, I pay a-fucking-ttention\nNumber (N)ine, fuck the Trues, I'm so fucking different\nI hang with shooters and killers that just got out of prison, pipe up\nPipe up, I got hella bitches, pipe up\nBuying flights just to see a nigga, yeah, yeah\n\n[Chorus]\nBalenciagas, I don't fuck with nobody (Nobody)\nI be in the field ready to pop on anybody (Pop on anybody)\nI just wanna bag that, bag that bitch I met at Follies\nIn a foreign drop top moving with a thotty\nMoving with a thotty trying to fuck me for my clouty (Clouty)\nMoving with a thotty trying to fuck me for my clouty (Clouty)\nBring that ho upstairs, bring that ho upstairs\nI brought that hoe to the trap but please don't tell nobody\nHo, don't tell nobody, ho, don't tell nobody\nBitch, don't tell nobody, bitch, don't tell nobody\nI brought that ho to the trap but please don't tell nobody\nHo, don't tell nobody, bitch, don't tell nobody, yeah, yeah, yeah, ayy (Hoodrich, bitch)\n\n[Outro]\nBitch, don't tell nobody\nBitch, don't tell nobody, baby, ho, don't tell nobody\nWhen I pull up in your hood, boy, don't tell nobody\nWhen I pull up in that Range, bitch, don't tell nobody\nI love to do it, my lil' boys, they gon' shoot anybody\nThey shoot anybody, they aim first at anybody\nI'm off the Percs, I'm off the Xans, I don't feel anybody\nCash Carti, money bags, boy, anybody, yeah, yeah, yeah (Hoodrich Keem)\nPlugg, Plugg, Plugg, Plugg", "year": "2015-08-08"}]}