{"artist": "WC", "songs": [{"year": null, "lyrics": "{*whip sounds*} Ha ha!\n\n[W.C.]\nIt's been a minute that I've been sittin up in this cell\nThinkin of many ways that I can get paid escapin jail\nMy life is like a football game, I'm movin' the chains\nTryin to score so I could maneuver the Range\nI hear police callin my name, I ball in no lane\nTryin to hit the wall, make the ghetto hall of fame\nIt's third and long, got a lot of yards to gain\nI'm federal, youse a misdemeanor, you small change\nIt's that, S-W-A-N-G affiliate\nFrom the penitentiary to the club, love I'm sendin it\nTurn me out and throw it up and get your boogie on\nAnd let me see those fingers in the sky if you feelin it\nI'm sick, and ain't no curin me, maximum security\nCan't stop my back bumper draggin through your community\nProcess me, lock me down, level me hard kid\nI still come out swingin like Ron Artest, nigga\n{*whip sounds*} Ha ha!\n\n[Hook: Nelly]\nIs it the concrete, or the walls\nMaybe it's the bars, might be the guards\nNigga this is LOCKDOWN - lock 'em down, lock 'em down\nThis is LOCKDOWN - lock 'em down, lock 'em down\nIs it the concrete, or the walls\nMaybe it's the bars, might be the guards\nNigga this is LOCKDOWN - I'm 'bout to whip yo' ass mayne\n{*whip sounds*} Ha ha!\n\n[W.C.]\nNigga the bang bang get up\nSkip skippin through the lane, swang, look at Dub\nSwangin, still feelin 'em all, I can't wait to get out\nWhen I touch-down nia I'mma turn shit out\nLooka there, biddy-by-by, buh-by-by beddy-bye nigga\nLights out, Dub and Nelly 'bout to shut the lights off\nC-Walkin' on the industry, spittin with all my energy\nDedicated to my niggas in the penitentiary\nLadies bounce to this, sip Cris', get drunk to this\nRefs walks to this, dawgs thump to this\nOn my mind is my fetti, itchin for the day\nThat I can parole and jack the nose on a Chevy\nThree-wheel to the St. Lou' and connect with Nelly\nJump in the Escalade on them deuce-four Pirellis, nigga\nMoney is freedom and freedom is cash\nAnd anything between me and my freedom I'll whup an ass\n{*whip sounds*} Ha ha!\n\n[Hook]\n\n[W.C.]\nYeah, Dub stay chuckin the pavement, I'm anti-general populated\nHood related, the industry most hated\nCause I ball greedy and rhyme for mine (c'mon) I'm willin to die for mine\n(c'mon) While haters hate from the sideline\nI'm like Fabolous, I make you \"Breathe\" hard, leavin ya bleedin and scarred\nPC'd up on the sensitive knee guard\nDub Central ain't no surrender, spit for repetitive offenders\nFacin D.A.'s with public defenders nigga\n{*whip sounds*} Ha ha!\n\n[Hook]", "image": "https://images.genius.com/65c28c46b1de126581120a8f4784c7e0.300x297x1.jpg", "album": "The Longest Yard (Music From and Inspired by the Motion Picture)", "title": "Whip Yo Ass"}]}