{"songs": [{"image": "https://images.genius.com/65c28c46b1de126581120a8f4784c7e0.300x297x1.jpg", "title": "Datz On My Mama", "album": "The Longest Yard (Music From and Inspired by the Motion Picture)", "year": null, "lyrics": "[Intro: Nelly]\nYo, how you know when a muh'fucker serious?\nWhen he'll put it on his momma, let's go\n(Derrty!) Ladies and gentlemen\nMales and females (E.N.T.!) of all kinds (let's go)\nAll the way from St. Louis to Minnesota (we all we got!)\nWe bringin y'all, Taylor Made\n\n[Hook One: Taylor Made, Nelly]\n[Tru] It's Jung Tru (in this ho) Jung Tru (in this ho)\nJung Tru (in this ho)\n[Nel] And that's on my momma\n[Blu] Blu Goose (in this bitch) Blu Goose (in this bitch)\nBlu Goose (in this bitch)\n[Nel] Nigga that's on my momma\n[Gube] Gube Thug (in this muh'fucker) Gube Thug (in this muh'fucker)\nGube Thug (in this muh'fucker)\n[Nel] And that's on my momma\nTaylor Made! You heard me? That's on my momma\nThey ain't playin 'round hurr, AND THAT'S ON MY MOMMA!\n\n[Verse 1: Jung Tru]\nJ, U, N, G\nCatch me in a house with a hundred floors, Benz with a hundred doors\nWalkin out the Grammy's with a hundred awards\nI'm the best songwriter and the best damn producer (now)\nCause whores gettin highly and stoned like Medusa\nYeahhhh, a new Hibushi{?} eatin all sushi\nAnd then I tear the mall down for new Prada and Gucci\nMy album's like Jamie Foxx, goin' for Diamond\nLike Martin on \"Blue Streak\" I'm goin to find her\nSaid my flow's ludicrous, I disturb the peace\nAnd I ain't \"Never Scared,\" get your +Bones Crushed+ in the street\nI put D on the block, like I'm one of The L.O.X\nGettin' Bucks like Milwaukee, D-Bo in the spot\nLike Jamaicans on the highway on Bad Boys II\nCause a hundred car crash when they see Jung Tru\nI'm a first round draft pick, the chain say Derrty\nLike Cam takin over the Roc, you niggas heard me, yeahhh\n\n[Hook One]\n\n[Verse 2: Blu Goose]\nYeahhhh, now I ain't Jigga but I keep Beyoncs with me\nI ain't Will but, I keep a Smith & Wess' to blaze with me\nThis story get notorious, like my nigga, Biggie\nI got a G-Unit of killers like my nigga, 50\nMy chronic chokin, ain't no +Badder Boy+ than me\nI just signed a deal with Nelly, I'm with Puff and Murphy Lee\nAnd you can tell, when I stop 'em still, rollin on the Sprees\nWe gon' leave a trail of rappers still, goin on them keys (yeahhh)\nI think of me of when I long stroke, Tia\nBut Tamara keep it real with me, used to pop, pills with me\nKnow she with a king, ridin through the hills with me\nHungry, that's Vanessa Williams +Soul Food+ meals with me (yeahhh)\nI take a prissy chick like Lisa +Saved by the Bell+\nBring her through the ghetto, make her drive cause she got the mil'\nNow I ain't +Money Mike+, with the Prada black, and the money right\nHoney tight, but I'll holla back, bitch it's funny right\n\n[Hook Two: Taylor Made, Nelly]\n[Blu] Blu Goose (in this ho) Blu Goose (in this ho)\nBlu Goose (in this ho)\n[Nel] And that's on my momma\n[Tru] Jung Tru (in this bitch) Jung Tru (in this bitch)\nJung Tru (in this bitch)\n[Nel] Nigga that's on my momma\n[Gube] Gube Thug (in this muh'fucker) Gube Thug (in this muh'fucker)\nGube Thug (in this muh'fucker)\n[Nel] And that's on my momma\nTaylor Made! You heard me? That's on my momma\nThey ain't playin 'round hurr, AND THAT'S ON MY MOMMA!\n\n[Verse 3: Gube Thug]\nYou might catch me with a dime with a crazy ass, crazy stash\nPockets like Malcolm Bliss, crazy cash\nMy life's like a runaway train, I'm gone in it\nTreat ya body like a phone and knock off a tone in it (yeahhh)\nAs far as rap goes, seen a million gimmicks\nOn a prepaid celly, with a million minutes\nAnd you ain't never seen a throwback, until you meet me\nCause the back say Jesus, he played in A.D. (yeahhh)\nI don't like too much, kinda hard to please\nGuns like old toothpaste, hard to squeeze\nAnd um, niggas talk greasy until the steel him 'em\nI just send 'em back to God and let him deal with 'em (yeahhh)\nFor the last two bars, I'mma murder the mic\nAnd come through like Snipes on the back of the bike\nThis life's a \"New Jack City\" shit, ya heard me?\nYeah, I come through like Snipes on the back of the bike\n\n[Hook Three: Taylor Made, Nelly]\n[Gube] Gube Thug (in this ho) Gube Thug (in this ho)\nGube Thub (in this ho)\n[Nel] And that's on my momma\n[Blu] Blu Goose (in this bitch) Blu Goose (in this bitch)\nBlu Goose (in this bitch)\n[Nel] Nigga that's on my momma\n[Tru] Jung Tru (in this muh'fucker) Jung Tru (in this muh'fucker)\nJung Tru (in this muh'fucker)\n[Nel] And that's on my momma\nTaylor Made! You heard me? That's on my momma\nThey ain't playin 'round hurr, AND THAT'S ON MY MOMMA!"}], "artist": "Nelly"}