{"songs": [{"year": "2018-12-18", "album": "Deadset Song Series", "image": "https://images.genius.com/361914af43fdae62b50bc16d27a3c279.1000x563x1.jpg", "title": "Deadset 8", "lyrics": "[Intro: Caleb Followill & Kerser]\nI've been roamin' around, always looking down\nAt all I see\nPainted faces fill the places\nI can't reach\nYou know that I could use somebody\nYou know that I could use somebody\nSomeone like you and all you know\nAnd how you speak\nCountless lovers under cover\nOf the street\nYou know that I could use somebody\nYou know that I could use somebody\nFuck, you got a camera again?\nDeadset, yo\n(Someone like you)\n\n[Verse: Kerser]\nFuck's happenin'? Yeah, it's been a minute\nDrinkin' bleach, what you mean you're meant to clean with it?\nI'm killin' cunts like the pingers of Defcon\nI turn into a coma if my shit ever slept on\nGot my Sportsbet lookin' like a bank account\nWhat I'm on, shit, I ain't 'bout to say it loud\nBang beats, same streets got the playlist\nDelete it all, name it Kers if you play this\nThis the part where I start gettin' selfish\nEighth deadset man, I do it 'cause I sell ticks\nMelbourne first and I think I gotta drive\n'Cause the shit that I'm takin' is too [?] to fly with\nVRC, yeah, the Kers is back\nIn the CBD with the purple dacked\nThey love the Kers 'cause I'm never known to tone down\nHit that stage and it's feelin' like a hometown\nOh now, in Melbs, off my head bruz\nShe head bang, let's see what her head does\nNext up, it's a party bruh\nI wipe my arse with the invite for the ARIAs, huh\nSyndey, yeah, my home is next\nStill get good reception if my phone was dead, yeah\nThis the vibe that we live, we in Sydney\nI rep [?] everyone know the sick me\nGot a bitch here, lookin' like she Britney\nYou know three, you should leave him here with hickeys\nCome along, I'ma be at The Metro\nWon't be the first time I killed a metro\nThanks Syd, gotta jet to the next day\nFuck a wave man, I set the whole template\nAdelaide, what the fuck is up?\nYou know I'm 'bout to say that I love your bud, ayy\nFuck me, I'ma be in a Paddy wag'\nIf I'm getting caught with what's in my saddybag\nADL, that's the city of churches\nChange that shit to your city is Kerser's\nJump around bitch, I wanna see you got tits\nForgot to say, get your tickets now from Oztix\nAyy, Perth, yeah, the man is back\nWith a venue change, you demanded that\nSo I'm in Perth city, yeah, the cunts are back\nOn stage, got 'em feelin' like Hunter's back (Rest in peace)\nShout out to the SBX\nP-city, Kers one, yeah, I get respect\nWest side of Oz in a pink hummer\nSaid a name but we just call her dick sucker\nGot a bitch here lookin' like Jennifer\nLopez, and know too I'm gettin' head off her\nIt's Deadset, yeah, a different kind\nThis is Deadset eight, can you picture nine?\nGot some bills that I bring to Tas\nThe only place that I've seen six fingers at, ha\nThat's a joke, don't be stupid lad\nI love Tas cunt, I got a crew in Tas\nLock it in, eighteenth of May\nGot the whole crowd screamin' ABK\nStill the same crew wylin' out\nStill rep ABK, how you like me now?\nStill twenty-two-five to the day I die\nStill Kers, same cunt, every day I'm high\nStill blow weed, still drop my bars\nStill make Bitcoin, still top the charts\nI'm the line at the end, I'm the bolts and nuts\nNow I'm headin' off to Bris 'cause it's off its guts\nWhat can I say? Man, I'm lovin' Bris\nCame on her face, guess I dumped my kids\nEaton Hill, shit, I said that right\nI said that all wrong back in number five\nBris city, sick city, yeah, the shit litty\nCan't wait to be back, poppin' six biccies\nAfter Bris man, I'm up to Cairns\nAsk anyone I meet man, I love my fans\nBackstage, red eyes with a blunt lit\nAny state, any town, man I run shit\nBut this place like paradise\nAnd my fans like a cold, they can sacrifice\nEffortless tremendous chains hang from Benzas\nMaintain my meds and they sway my message\nGet tickets, Lifestyle is the next step\nIf you mix that with a bit of No Rest\nYou knew what it was when I blew up, true cunt\nMade a lot of money 'cause my tunes are too tough\nBreakin' all the records and I moved up, crews past\nThrough me in the middle like I tuned up two sluts\nReally ain't a fresher MC than the Kerser\nPut you in the ER, followed by murder\nWait a minute, gotta flip the shit\nWork it out for yourself, man I'm sick with this\nFrom Mel to Tas and Perth and back\nAnd Adelaide, I'm a Sydney lad, fact\nReal rap, sliced up in the flavour\nYear later, had my weed in a paper\nSmooth flow, don't be trippin', think I'm lazy\nUntouchable, they try to recreate me\nLifestyle guarantee is the best yet\nI'ma see you at the shows, Deadset"}], "artist": "Kerser"}