{"artist": "Fat Joe", "songs": [{"year": "1998-09-01", "album": "Don Cartagena", "image": "https://images.rapgenius.com/f8bfc43135e1f392362f7d18c8411538.500x432x1.jpg", "lyrics": "[Intro: Fat Joe]\nBlam!\nBang bang baby!\nYeah, Terror Squad style\nTrizzie, check it out now\n\n[Verse 1: Cuban Link]\nYo, I'm rated X in sex, I flex like Lex Luger\nSo who's next to get scooped up by this roughneck from Cuba?\nWe do maneuvers like Super Dave, always with a group of babes\nLaying mami's out like Sugar Ray\n'Cause Cuban Link don't play games, miss, I flip and do some strange [shit]\nWitchu like hit you with the whips and chains, check it\nI get you naked like I'm mystic 'cause this [dick] is\nThick as a brick, raw with big [balls] that bend it\nNow let's get, physical, my jiggable pie\nLet this lyrical guy scuba dive right between your thighs\nI satisfy like a Snickers bar 'cause I'm the bigger bar\nThat'll stick you quicker than a 'spic will strip a car\nMy repoitoire holds a four star performance with all women\nHittin more skins than Alec Baldwin\nYou're fallin in love and you can't get up\nNow check the cut, I stripped ya, now you can't strut, word up\n\n[Chorus: Big Pun]\nBet ya man can't do it like that (like that)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like that (like that)\nI make you scream papa (you the best dada!)\nBet ya man can't do it like that (like that)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like that (like that)\nI make you scream papa (you the best dada!)\n\n[Verse 2: Fat Joe]\nYeah, uh, uh, yo\nParadin in the Palladium, all eyes on my presence\nPoppin the Crist', sportin the chick straight out of Essence\nWord up, patch thug, three quarter front Polo jiggy\nBe like 'Who is he, lookin like a grizzly?'\nWhile your girl watch me, you're busy drink pissy\nWanna lay your love, but your love wanna kiss me, huh\nI got a fly team, me and my guys gleam like high beams\nMakin the killin off of fiends with pipe dreams\nIt might seem like I'm conceited with the C.R.E.A.M. talk\nBut I got the kind of green that could bribe a Supreme Court\nAnd when we talk, the whole world listen\nTurn your back to T.S. for one second and find your girl missin\n\n[Verse 3: Big Pun]\nBaby make me holla, take it off, I give you dolla\nWe can party 'til mañana ain't nobody gotta know nada\nWord to Allah, give me some Mississippi massana\nI'll be in the sauna, chupin' the nalga like the chupacabra\nCool it mama, you gettin too hot, bust a shot\nBoo-yaa! Rub it up and down like my oo-wops\nSucia!, show me your dirty dance\nThe way you work the pants make any man wanna jerk his gnads\n\n[Chorus: Big Pun]\nBet ya man can't do it like that (like that)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like that (like that)\nI make you scream papa (you the best dada!)\n\n[Verse 4: Cuban Link]\nYo, my [shit's] official like it in you like, Keith Murray\nBury my beef, gettin your sweet cherry every week if necessary\nI'm very nasty like Nas, did you ask me?\nPass me those [ass]cheeks and I'll bring you joy like BlackSTREET\nIn the backseat of my Jeep, we can chill\nOr creep like TLC but don't sleep, I keep it real\nWhat the deal mami, you wanna feel on my steel salami?\nCome and try me, I'll sign my name all over your punani\n\n[Verse 5: Triple Seis]\nOhh mami, you comin home with me\nAll night in my tub drinkin Hennessey\nGettin lyed up with your thighs up, I'ma surprise her\nWhen I rise up, inside her\nYippie kay yay, I'ma ride her, and guide her\nStraight to the triz, where we goin, straight to the crib\nPun in here and Cuban and Seis, you know what time it is\nSoon as we walk in the crib, let's get biz\n\nTRIZ TRIZ TRIZ TRIZ TRIZ TRIZ TRIZ TRIZ (oahkayyy!)\n\n[Chorus: Big Pun]\nSince ya man can't do it like Link (like Link?)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like Seis (like Seis?)\nI make you scream papa (you the best dada!)\nBet ya man can't do it like Crack (like Crack?)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like Pun (like Pun?)\nI make you scream papa (you the best bana!)\nBet ya man can't do it like Link (like Link?)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like Seis (like Seis?)\nI make you scream papa (you the best dada!)\nBet ya man can't do it like Crack (like Crack?)\nHe can't work the middle, cause his thing too little\nBet ya man can't do it like Pun (like Pun?)\nI make you scream papa -- adios mama!", "title": "Bet Ya Man Can’t (Triz)"}]}