{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/0aab2c3a8fe65902dd9bea31a7460a32.706x706x1.png", "title": "I’m That", "year": null, "album": "Rap Hard", "lyrics": "[Intro]\nHey\nThis one's so crazy\nUh oh\nOh boy, oh boy\nYeah\nCudi!\nRock this motherfucker\nCudi!\nY'all niggas know it\nYou know\nMan\nIt's just the Midwest Action\nThe real diller tiller on the beat\nYeah\nLet's go\nLet's beat this motherfucker\n\n[Verse 1]\nCudi in the spot, all the lames ice-grillin'\nMad cause their girl call me Mr. Nice-feelin'\nMust stay clear from the sneaks to the fade\nI ain't even in the game and the nigga look paid\nCockroach niggas get sprayed with the Raid\nNo time for the drama, tryna get laid\nSippin', my mellow, Kid Mesc lady killer\nYo girl, I'm a fill her like gas to the tank\nNice skin, college girl, wanna come to Scotty's world\nLike to wear it straight, wanna cut her hair like [?]\nI wanna pop, but you're a bad bitch\nSays she a magician, wanna show me tricks\nTold her I'm a beast in the sheets and the booth\nSays she ain't believe me, need to see some proof\nPulled out my demo, then pulled out a condom\nTold her let's go, while we listen to my album\n\n[Chorus]\nI'm that boy\nI'm that\nNiggas need to know\nI spit high, high\nI'm that boy\nI'm that\nNiggas need to know\nI spit high, high\n\n[Verse 2]\nMet a older ho, birth name [?]\n[?] this nigga had a dealer\nAll the motherfuckers run game just to keep it\nBut the bitch [?]\nYa boy had to delete it\nI said: These are the things I'm on\nNiggas see the potential, wreck shit King Kong\nBeat bot tiller, he a beat Godzilla\nI'm that nigga, boy boy, told you before\nScrewed up shit in the deck and move slow\nGot a neck from a chick and neck move slow\nPerform on stage, hoes in the front row\nThey try to take that like i was Sean Combs\nBitch get down\nYou need to go home or you get dick down\nI use slump, let the base line thump\nAnd it bumps and it thumps that all the cops get mad\nI chill cause I'm ill, up in the game all smacks\nThe races for cake, doing a hundred meters dash\nSit back and I laugh, cause these others are jokes\nThey might just get slapped and those will get choked\n\n[Chorus]\nI'm that boy\nI'm that\nNiggas need to know\nI spit high, high\nI'm that boy\nI'm that\nNiggas need to know\nI spit high, high"}]}