{"artist": "Pacewon", "songs": [{"album": "Won", "title": "No Retreat", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "Yo.. huh.. yo\nRoc-A-Blok, yo, Pacewon!!\nYo.. yo.. Outsidaz in the house, huh\nRuffhouse in the house, yo\nWho else in the house, yo\nLet 'em know.. Pacewon!\nYo yo yo.. Roc-A-Blok, yo\nYo yo yo, yo! Huh! Yo!\n\n[Pacewon]\nAll y'all call on me like Bell Atlantic\nPack a four-four, got weed and never panic\nBout to blow up like a comet hit the planet\nHold it down singlehanded; Pacewon got the pen play\nTag my name like El Da Sensei\nBallin like the Nets, representin NJ!\nWednesday, I'm out on the block, servin you ten ways\nI'm large and niggas rubbin it in, like it was Ben*Gay\nCop an ounce you roll the whole damn thin, I'm a sess-head\nYour best friend a hydro connect from the West End\nDestined to be a legend; pack a nine millimeter\nWeapon three to seven, keep the people steppin\nHuh, hah!!  That's the way of the world\nPlay and get hurt, deal with the way that it work\nOne day you be on top eatin a BLT\nThe next day you be broke like TLC\n\n[Hook: repeat 2X]\nRoll on ya block, handle y'all, battle y'all\nTake you out, put you in my catalogue\nWhen goin to war, better remember\nNo retreat, no surrender\n\n[Pacewon]\nYo, yo; cool ass cats get hit with mad pressure\nHoney got caught cheatin, her man left her\nUsed to be a dimepiece, now she a heffer\nEatin mad ice cream, drinkin Dr. Pepper\nThink she got the virus, scared to get a checkup\nAnd even if she found out, it still wouldn't affect her\nShe'd kiss you and let you give her hickies from the neck up\nAnd let you hit the sugar walls off with no protector\nNiggas go against me and get they neck cut\nFear the son of man, livin, cashin checks, what?\nI work for the goods I receive\nOnly by the sweat of thy brow will you eat\n\n[Hook]\n\n[Pacewon]\nIn my hood it's mad people, deep crews in Regals\nThey got tints too dark to see through\nHebrews own every store, they be hasslin the people\nUsed to be coke sniffers, moved up to diesel\nToo much heron could be lethal\nYou could tell a fiend those six words, they don't believe you\nIf you never heard me before, here's a preview\nUsed to be goodie two-shoes, returned evil!\nI'm settin war off, tell your Senator\nNo retreat, no surrender\n.. yo, yo, and let me take this time to say\nRoc-A-Blok, Pacewon, we representin!\n\n[Hook]\n\n{*ad libs to the end*}", "year": null}]}