{"songs": [{"title": "$ave Dat Money", "album": "Professional Rapper", "year": "2015-06-10", "image": "https://images.rapgenius.com/d005c94b9d8f7a4fed5094f336a3556c.1000x1000x1.jpg", "lyrics": "[Intro: Lil Dicky & Fetty Wap]\nLD, AKA The Independent Variable\nTrap God, and we servin' out the hallway\n\n[Chorus: Fetty Wap]\nAyy, where the gold at, baby? (Fuck I need gold for man?)\nAyy, where the clothes at, baby? (Fuck I need clothes for man?)\nAyy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow dat, baby\nAyy, we gon' save that money (I'm so thrifty)\nAyy, we gon' save that money (I'm so stingy)\nAyy, we gon' save that money\nWhat we doin'? We gon' save dat money\n\n[Verse 1: Lil Dicky & Fetty Wap]\nThe rap game got it all wrong\nWe ain't 'bout to go and spend money just to flex on 'em\nWe ain't really got it like y'all (Yeah, baby!)\nI'm a type of motherfucker that'll check the check\nDo the math, I ain't never gettin' robbed (No)\nThose margaritas not goin' on my card (No)\nI ain't 'bout to split a damn thing for convenience sake\nI'm at the restaurant workin' that waitress\nHold up\nYou ain't heard of Lil Dave, Yung L the Jew biz major? (Ayy)\nFuck you know about the world he raised in?\nI've been savin' money since a motherfucker 13\nI wear the same pair of jeans everyday (It's true)\nFree sandwiches, homie, two stamps away (It's true)\nBook flight December but I leave in May (I do)\nDrugs are generic but still work the same\nI get logins for Netflix from my cousin Greg\nThanks Greg!\n\n[Chorus: Fetty Wap]\nAyy, where the gold at, baby? (Yeah baby)\nAyy, where the clothes at, baby? (Yeah baby)\nAyy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAyy, we gon' save that money (Yeah, I’m so Jewish)\nAyy, we gon' save that money (Yeah, I’m so frugal)\nAyy, we gon' save that money (I'm so imprudent)\nWhat we do? We gon' save that money\n\n[Verse 2: Rich Homie Quan]\nAll of my luggage is Louie V, I swear to God, nigga\nAll of my bitches be scared of me, I put that rod in 'em\nAll of them bitches actin' thoughtless, I disregardin' them\nAll of them bitches actin' holy, ain't got no God in 'em\nI can teach a lil' nigga somethin' like a preacher\nI can take his ass to church fresh as hell, no Easter\nI can make his ass burp like a baby without no hiccup\nI could...\n\n[Interlude: Lil Dicky]\nQuan what's this have to do with saving money though?\nYou know what a full verse would have been too expensive anyways\nI think\n\n[Verse 3: Lil Dicky]\nTrap, trap, trap\nI ain't parkin' that unless the meter green, homie (Please)\nHair cut several months in-between, homie (Always)\nHit the mafuckin' lights when I leave, homie (YOLO)\nSingle ply TP, ass bleed\nAirbnb the motherfuckin' lease, I'm never there\nI'm out in Cali, why the fuck my company in Delaware?\nAt happy hour takin' out the chicken, I don't even care\nAnd that applies to both dating and wings\nPeep matinees, phone bill got the motherfuckin' fam on it (All the fam)\n401K, rollin' over bands on it (Ayy)\nCoppin' sweaters in the summer when the sale on 'em (I'm hot)\nThe fuck you rappers bragging 'bout? You overpaying for it\n\n[Chorus: Fetty Wap]\nAyy, where the gold at, baby? (Yeah baby)\nAyy, where the clothes at, baby? (Yeah baby)\nAyy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAyy, we gon' save that money (Yeah, I’m judicious)\nAyy, we gon' save that money (Yeah, I’m cost efficient)\nAyy, we gon' save that money (Yeah, I do it different)\nWhat we do? We gon' save that money\n\n[Verse 4: Lil Dicky]\nI ain't never hit a bar with a cover (Never)\nLow thread count, hard with the covers (Woo)\nFree trial memberships, though\nI never join the shiz though (Ayy)\nFuck you think this is though?\nFrequent flying like a motherfuckin' finch though (Brr)\nGeneral Tso, half a dozen on the stick\nJust so I can whet the appetite a bit\nWhatchu talkin' 'bout?\nMy AC never doing nothing, blow fans though (Ayy)\nWalgreens card shoppin' all the off brands, though (Ayy)\nBoy go hard when collecting, got Venmo (Ayy)\nSave every motherfuckin' roach, tryna smoke (Ayy)\nCheck the clothes in my drawers, I ain't playin' around\nIt's LD, lil boy, Mr. Hand-me-down\nMy dirty drawers gettin' worn, can you blame me now?\nYou think I got $4.50 up in quarters on me, well I fuckin' don't!\n\n[Chorus: Fetty Wap]\nAyy, where the gold at, baby? (Yeah baby)\nAyy, where the clothes at, baby? (Yeah baby)\nAyy, where the dough at, baby?\nIn the bank, you know I ain't tryna blow that, baby\nAyy, we gon' save that money (Yeah, 1738)\nAyy, we gon' save that money (Yeah, I'm a kike)\nAyy, we gon' save that money (Yeah, I eat figs)\nWhat we do? We gon' save that money\n\n[Bridge: Fetty Wap]\nEvery time these niggas tryna play\nAnd lately I've been stackin' up crazy\nStackin' up 'cause all about the bands, baby\n800K underneath the bed baby\n\n[Outro: Lil Dicky]\nIf you at a restaurant and got a iced coffee\nAnd the waiter been refillin' that without a word of caution\nAnd you get your fuckin' bill and you can see he double charged ya\nFor the coffee and you told 'em there's a problem\nSing along like\nOhh, don't double charge me for that\nDon't double charge me, we like\nOhh, don't double charge me for that\nDon't do it to yourself\n'Cause I might just ask what the ice cube's worth\nWhat the ice cube's worth\nThat's the only differentiator making this a non-free perk\nAnd I might make work more difficult for you than it need be (Brr)\nSo think about it, take a minute, let it breathe, B\nBut think about it, bruh, you saw me get the burger with the bacon on the side\nAfter looking at the price of the side of just bacon\nAnd comparing it to the what the difference in the cheeseburger\nVersus the bacon cheeseburger was and making my decision\nI would hate to be the waiter tryna tell me something different\nI'ma get on Yelp in a minute and review\nThis piece of shit place like only a kike know how\nUnless you take the extra coffee off I might get loud unless you...\nOh, it was just an accident?\nYou didn't even mean that\nYou didn't even... that was... that's... I'm so embarrassed"}], "artist": "Lil Dicky"}