{"artist": "Warren G", "songs": [{"year": null, "lyrics": "Your musical evolution has ended. We control the sound\nIts time we all got down. We bring you electrofonic funk funk funk funk\n\nChorus\nWe want yo hands in the air with yo mouth shut\nWith Hershey Locc on the mic and Warren G is on the cut\nWe make your heart beat, with Hershey Locc and Warren G\n\nMr. Malik-\nWe make yo heart beat like the beat of a heart\nWith these rhymes I release busta B plays his part\nGet it start, get it set, I bet we goin\nG Funk plus timer the energize bunny still goin\nAin't you knowin, I'm so seasick and tired of these niggas\nTryin to get us all start up, cuz they got caught up by trickaz now\nLock down to all blood clots, Malik and Warren G and we shakin up\nSpots\n\nWarren G-\nPlots, when we got work to do\nFrom Atlanta GA to the beach with the Long Beach Crew\nOoh, what would you do what we do, what we do when we comin after\nYou\n\nMr. Malik-\nThey say that drama for they Mama, no we can't talk like Tevyn\nWonder why they families cried and died before 97\nThem and they sins burn to heavy make it all the way to heaven\nAnd we keep bellin, yo G Z it ain't easy tell em\n\nWarren G-\nIts the second time arizzound\nYou know we gotta clizzown\nYoung GFC and Hershey Locc from the pizzound\nFrom OG to BG, from BG to OG\nMy sounds thump pump pump and you know me\n\nChorus x2\nWe want yo hands in the air with yo mouth shut\nWith Hershey Locc on the mic and Warren G in the cut\nWe make your heart beat, with Hershey Locc and Warren G\n\nMr Malik-\nNow he's solo while we roll up on yo block like the kesops\nMakin everybody drop stop and stand it one spizzop\nWe have it locked, to the tic toc it dont stop\nFrom our block to his block, it is that world bombs a lot\nEverybody got Glocks, but let him learn about\nHow them worms rock to the worms drop\nYeah you heard we rock, microphones by the masses\nYou never smash it, I get C-Notes diggin for the casket\nIt gets drastic, no need to ask if, we straight up mashin\nIf we dont start up all y'all to ball cashin\nThe throat locc apparatus when\nFront to back again, what you want we back again\nNow if a spliff did lyrically gifted, time to rap it then\nSo everybody throw your muthafunkin hands up in the wind\nLa la la la la , dee dee da dee dee da dee da\n\nChorus x2\n\nWarren G-\nI got brew D like brady more like trump\nLike the homey Tracy D who the quick to dunk\nFollow me, back to the situation at hand\nWe make your heartbeat bounce, wit ya hands on your chest and your\nPecs\nOpen I'm scopin, the homey straight loccin, break we go for broken\nWhat you smokin? the bomb blueberry\nG Z Whee Z's back and its scary\nTo each and everyone of you wannabes\nYou wants none of these we rap catastrophies\nMake ya heart beat ooh, ahh, dee dee da dee dee da dee dee da dee da\n\nChorus x4", "image": "https://images.genius.com/891cde7cb0ea96f6c0b7a2cda795de40.1000x1000x1.jpg", "album": "The Nutty Professor Soundtrack ", "title": "We Want Yo Hands Up"}]}