{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/3aabc35f21e7a3ca71edda22ad046ec1.500x504x1.jpg", "title": "Crazy", "lyrics": "[Intro]\nCome up through the struggle  not too many get to tell\nGot up and shook it off every time we ever failed\n(Why do we fall? So we can  learn how to pick ourselves back up)\nTransportation make you happy when your life’s a living hell\nSirens jump behind us, praying we don't go to jail\n\n[Verse]\nWindow skimp, two attempts, handing bands over\nSeeko hit, shot and missed 2 then stand over him\nBread Winner, huh? Look who in the building\nLet me check my Instagram I might be at a million\nPissed on, you out ya mind, I'm out mine\nBetter not flinch wrong\nI’m on my grind, rock supplying like the Flintstones\nReputation on the line and the clips long\nThey 9 to 5, slangin' nine you get blitzed on (Bitch I want the only driver, Luca Brasi)\nBitch I'm papered up\nDiamonds glistening, rocking feelings, I ain’t tapered up\nGet on your shit, get out your feelings, hatin’ fake as fuck\nSome feel I’m trippin’ how I’m livin’ I can’t change it up\nI’m a praying mane droppin’ change case spray shit up!\nMight just be me I’m in the strippers ain't no breaking up\nShe talking reckless, bitch whatever phone I’m hanging up\nDick so good can’t seem to keep this bitch away from us\nAnd me and Nook will fuck your bitch she wasn't made to love\nPhone ringing while in a meeting that’s my dog calling\nWon’t point a finger, give an order and they all stalking\nSpeech muted, pressing pause no longer hearing voices\nBecame a boss, couple cars I got steering choices\nSaid I was crazy, wasn't goin be shit back in elementary\nBitches on my dick, fresh steppin out McKinley\nHoop dreams never had em, tryna to fetch a chicken\nSay its gangsta, there go Lump hanging out the window\nTrying to rob me I got shot, two weeks he expired\nNigga burnt ya truck, what up? Ain’t nobody die\nLil bright nigga came thru spitting, wasn't no dumping back\nD Dub got off,then got ripped up, you ain't fuck with that\nWe on our knees praying daily God brung him back\nPutting cookies in my daddy head, a fuckin rat\nMy daddy don't wanna sell me nun, Nook done brung the pack\nBone turned me up (??)\nStroke got hit while he was with me now we clutching bad\nAnd we riding round the bottom with a bunch of strap\n\n[Outro]\nMane we pull up on Buck, ya heard me\nMe and Stroke in the car, ya heard me\nI got the MAC-11 with the whisper thing on that bitch\nYou call my phone talking bout, \"Mane what you doin' out?\"\nI say, \"Mane God got me, my nuts hanging to the floor\"\nYou was on speaker phone, Buck was right there on side me ya heard me\nBitch ass boy"}], "artist": "Kevin Gates"}