{"songs": [{"image": "https://images.genius.com/1347c8a031c29a20889e17df64f84846.300x300x1.jpg", "title": "If I Ain’t a Thug", "album": null, "year": null, "lyrics": "(Singer Singing)\nIf I ain't a thug why do I feel this way?\nWhy does crime stay on my mind?\nAnd if you ain't a thug why do you front so bad?\nYou're just a bitch ass cat inside\n\nVerse 1:\nAll my stocking cap niggas, jean suit niggas\nMy stand still niggas, breeze through niggas\nMy choppin' crack niggas, D's knew niggas\nSomethin' for the Superthug see through niggas\nTransparent, can't panic\nGemstars in the bandana\nScratch my skin on accident\nYou thought you heard the rumors then you asked 'em again\nBut they don't fuck with me, they harass my friends\nClose associates, mostly it's the young ones tryin' to eat\nWhats funny is they remind me of me\nIronic ain't it? problems came wit' no solutions\nNo donations, no contributions\nNo charity, hoes carry me\nOut the spot drunk, cussin', but it don't matter B\nI got legs with no gravity losin' my keys\nOn the loose, a young wolf in the street\nQ.B\n\nChorus -\nIf I ain't a thug why do I feel this way?\nWhy does crime stay on my mind?\n(All I know is this, I can't go legit)\nAnd if you ain't a thug why do you front so bad?\nYou're just a bitch ass cat inside\n(I can't go legit, all I know is this)\n\nVerse 2:\nNiggas bark and don't bite, I bite and don't bark\nBe lookin' from the outside in with no heart\nNever did shit, scared to death with no courage\nFeminine niggas hold grudges\nFour Brothers, three of 'em blood, one of em Lord\nRunaways on the run, niggas never get caught\nI seen it happen in alot of ways\nIn the Hood young killers get alot of praise\nThe hotter days bring music and pussy, even chicken and kids\nOlder folks discuss life and how different it is\nShit has changed since the Fifties\nNiggas fiend to hang wit' me\nSome go to jail and get banged quickly\nTwo inch wounds duke, must've thought you were bulletproof\nRealizin' theirs shit you couldn't do\nWhen you come face to face with the most hated\nDrive by's if there's no way in\nAnd drive off wavin'\n\nChorus 2x\n\nVerse 3:\nI got an alter ego, approach me slow\nFeel I don't know these niggas still they know me though\nEither way lead the way to the front line and heat will spray\nDo I need employment or need a shave?\nBe the wave of the future for thugs on the rise\nPatient, waitin' for the day one of ya'll try\nOff point like none of the time\nI don't sleep much\nFully dressed, pants on my tux be cuffed\nYou a creampuff in disguise\nSympathize with those that give a fuck\nMy blows will hit 'em up\nI got a hot head and cold heart\nSo don't start\nWet lighters ain't broke they just don't spark\nThug niggas don't park, they just take the key out and be out\nGo in the crib\nCountin' they dough, layin' low with they ho and their kids\nUnaware of the enemy\nSo don't pretend to be.....\n\nChorus 2x"}], "artist": "Nature"}