{"songs": [{"image": "https://images.genius.com/fe7b2d9af535866969cc7963ac422da8.900x900x1.jpg", "lyrics": "(All right let's count it down)\n\n1.. 2.. 3.. 4.. 5.. 6.. 7....\n\n[Intro]\nFuck Boulevard beer and their corporate bosom\nI'd rather drink with an agnostic woman\nFuck Applebee's and their corporate bosom\nI'd rather drink with an atheist woman\nFuck the young republicans and their corporate bosom\nI'd rather drink with an agnostic woman\n(Hey Kansas City, no more drinkin' Boulevard beer, it's Flying Monkey mother fucker.. here we go)\n\n[Verse 1]\nHey yo Jerry Falwell's dead, everybody limbo!\nRap music is the new disco!\nI kick drums down the stairs and laugh\nThe sound of paragraphs\nWith beasting these bloods with these chumps and their bling-bling that sucks\nThe phone goes \"ring ring,\" wassup?\nShmuck, I'm here to save the day like I'm Ming Ming the duck fucker\nYa'll win the lotto and the foo-foo lives\nThe rest of us just kinda hope Bono from U2 dies\nBlind Abercrombie trophy wives run the world like\n\"Wow Jennifer, did you lose weight? You go girl!\"\nI mean it's corny, it's filthy;\nSo if you ever see me and I'm drivin' in a minivan then fuck it, come and kill me!\nBut sucka, ya'll can't see me like Snuffleupagus\nNow what the fuck is this I wanna kiss so pucker up your lips\nThe manwhore will charm ya. (wooo!)\nI had it all when I was born like Jamie Lee Curtis and/or Ciara\n\n[Hook]\nFollow, me\nFollow, me\nFollow, me\n(Come on!)\nWe gotta have a jihad..\nWe gotta have a jihad. (Come on!)\nFollow, me\nFollow, me\nFollow, me\n(Come on!)\nWe gotta have a jihad..\nWoo weeeeeee ooo\n(Hey!)\n\n[Verse 2]\nI got a hangover, I could sell the scientific research\nI got my ass kicked last night so now my teeth hurt\nI can't purchase alcohol on Sundays; why?\nBecause they believe an invisible man's in the sky!\nKirk Cameron thinks sinners need to burn in flames\nI got a gun named Corey Feldman and a gun named Corey Haim\nThe third world war just started, TAKE AIM!\n[snickering] They still think an invisible man is in the sky\nKansas City mutha fucka better go check your dead self\nDrivin' through the hood gettin' road head from Fred Phelps\nI'll interrupt family dinner during prayer like\n\"Uh, by the way I'm an atheist and.. don't care.\"\nThe honorable reverand Ted Haggard got caught smokin' meth with a male prostitute up in a Motel 6\nThe flow fell sick, then sweetened and unusual\nI'll go back to church when the Chiefs win the Superbowl\nI wanna paint Linda's sick dead words, gimme a canvas and the brain stem of Mitch Hedburg\nAnd I'ma use it as my quill tip\nI wanna take a couple drill bits and build myself an easel with the skeleton of Bill Hicks (that's a good man right there)\nMan fuck Dane Cook and his corporate ass too (punkass mother fucker)\nNow bring me the female version of Charles Darwin\nAll hail George Carlin\n\n[Hook]", "year": null, "album": "11:11", "title": "Jihad!"}], "artist": "Mac Lethal"}