{"songs": [{"image": "https://images.genius.com/f5c5d75e5a52f8df5fa4820d6ec6dfc9.550x550x1.jpg", "year": null, "lyrics": "I'm in my crib feeling blast\nEarly afternoon session and my homies just left\nAll of a sudden started feeling mad stressed\nLike an elephant was standing on my mother fucking chest\nNow I start to panic and the game took in false\nAgitated by accelerated rates of my pulse\nI called up my lady like I think I'm dying, hon\nShe said, get off the phone with me and call 911\nI tried, cause shit was really faded in a hurry at this point\nThe numbers on my phone was all blurry and shit\nBut by the grace of god I managed to dial\nAnd told them please send somebody to my crib right now!\nI knew that that's the only way that I would stand a chance\nI'm a rider, but now I'll be riding in an ambulance!\nThey found me face down on a pavement\nProbably thinking about my tombstone engravement\nVague memories were begging for resistance\nThey said they couldn't help me\nBut we're just a short distance from a hospital\nMass general, class medical facility, incredible professional abilities\nNext thing that I remember was my mom's voice\nAin't she in VA and holding my hands\nMy aunt Joyce, what's going on?\nHow long have I been strapped to this table?\nI wanna speak, but the ventilator makes me not able\nI'm hoping that is just a nightmare\nBut every time I open my eyes I'm right there\nTools and machines everywhere, I guess they're helping me survive\nWell, at least I'm alive!\n\nBeen down, been down, now, now I'm back\nBeen down, been down, now, now I'm back\nBeen down, been down, now, now I'm back\nNever felt more alive\n\nA so called heart attack\nGot you brother acting, ICU\nYou almost murdered me\nIt's time for a emergency, surgery\nIn and out of consciousness, doping me up\nNot knowing they're about to call, open me up\nThey couldn't hesitate, they had to saw through my chest plate\nIt's sort of wild how they fix my aortic valve\nArtificial parts and wires will take months to heal\nNow it's for real when I say that I'm the man of steel\nFriday the 13th, the day that I won't be hating soon\nCause friends and family was pondering in the waiting room\nWords spread quicker than a stronger aroma\nRoumer was that your boy was in a comma, yeah!\nShit was serious, of course I was oblivious\nDamn near frozen, but not decomposing\nBest friend in my ear saying I'm the chosen one\nThe resurrection, far from the dead direction\nCousin hugging my arm for what felt like days\nFor all the love I was amazed\nThen the docs finally let me know that I would survive\nI can't believe I'm alive\n\nBeen down, been down, now, now I'm back\nBeen down, been down, now, now I'm back\nBeen down, been down, now, now I'm back\nNever felt more alive\n\nTrust me all, the shit does not tickle\nTubes buried in my belly steady eatin' popsicles\nIVs and catheter felt like I was massacred\nThanking God I'm not the one they had to buy the casket for\nBut even now while I'm dropping this rhyme\nI'm recognizing if it's not your time, it's not your time!\nI went from an unimaginable death\nTo smile at my homies while I took my first steps\nMy head cleared when I stopped taking vicodin\nNow all I think about it is getting on this mic again\nAnd to each and everyone who said a prayer for me\nShed a tear for me, maybe put one in the air for me\nAll I Can say is thanks for giving me strength\nBecause I truly believe you increased my life's length\nAll I had to do is show some dedication\nNow all I gotta do is take a little medication\nYou won't help me avoid disaster\nIn the come back, better stronger and faster\nNow it's my mission to prove that I'm deserving\nCause thanks to God ya'll and brilliant surgeons\nI'm alive!\n\nBeen down, been down, now, now\nBeen down, been down, now, now\nBeen down, been down, now, now\nNever felt more alive, never felt more alive", "title": "Alive", "album": "Built To Last "}], "artist": "Akrobatik"}