{"songs": [{"album": "Everready [The Religion]", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg", "year": "2006-11-07", "title": "Enter Everready/B.L.E.S.T.", "lyrics": "[Crystal Watson]\nEnter Everready\n\n[Big Sean]\nSo we rolling, just left Billings, Montana, did a dope ass show\nWe in a 15 passenger van, heading to Spokane, Washington\nWe driving along the interstate, we go over this bridge, hit a patch of ice, all of a sudden the van starts fishtailing\nWe're going back and forth, I'm like \"Woah!\" Krizz says...\n\n[Krizz Kaliko]\n\"You got it Sean you got it! I think you got it man\"\nBut we went sliding further and further towards and back then BOOM we hit\nWe flipped like 5 times, all the windows start breaking out in the van\nI'm like \"Oh god, oh god!\" while we flipping, and finally we stop I'm looking around the van to see if everybody is alright\nFirst person I looked at was Big Nick 'cause I see him jumping out first\nHe runs to the doors 'cause they crushed in and he starts grabbing trying to rip them open like (Grunting noises)\n\n[Big Nick]\nI yank the doors open and I'm yelling out \"Tech! Tech! Are you alright man? Kutt! Kutt! Are you alright?\"\nKutt raises up and I see he's drenched from all the bottles of alcohol we had in the van from last night; and I say \"Kutt man, are you cool?\" and he says\n\n[Kutt Calhoun]\n\"Yeah I'm cool man, I'm cool\"\nSo I'm wiping my face, I'm thinking I'm bleeding\nI look at my hands, it ain't nothing but the liquor\nSo I look around, everybody up and moving\nTech's still on the floor and I'm like, \"Tech! Tech, you alright?\"\nHe ain't saying nothing, I'm like \"Aw man... Tech, you alright?!\"\nHe said something like \"Kutt,\"\n\n[Tech N9ne]\n\"I'm fine man.. I'm fine man, I'm fine, I'm fine.\" I asked him, I said uh, \"anything wrong with my face? Anything on my face?\"\nAnd Kutt was like \"Nah\" So I'm like, I'm listening, and I touch my teeth and I see blood in my mouth, but I'm smiling 'cause I'm hearing Krizz Kaliko saying \"Thank you Jesus, thank you Jesus,\"\nAnd it felt good to be in God's graces\nThe ambulance, the people that came, they said that we were all blessed\nYa know what I'm saying, to still be alive after flipping 5 times man\nSo ever since then, we been celebrating life baby Kickin' it hard Every day's a party baby"}], "artist": "Tech N9ne"}