{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/363d3bd1269fd81f992057289f62a485.1000x1000x1.jpg", "title": "Day for Day", "year": "2017-03-31", "album": "Painting Pictures", "lyrics": "[Intro]\nAyy, look, I say \"I don't rap, I illustrate. I don't paint pictures, I picture-paint.\" Ha, this my motherfuckin' album\nKodak Black-\nKodak Black-\nThe nineteen-year-old Pompano Beach rapper-\n-is reportedly back in jail after he was arrested today in Broward County, Florida\nReal name is Dieuson Octave, changed his plea from not guilty to no contest\nMr. Octave, do you accept your plea?\n-in the two terminal cases that have put his musical career on hold\n-troubled rapper found himself back behind bars after violating the terms of his house arrest\nYeah\n\n[Verse 1]\nYou know I'm a hot boy, but I ain't never lose my cool\nThe streets on fire, that's why I'm ridin' with my tool\n1800 block boy, I'm quick to give a bitch the blues\nI was already sentenced, before I came up out the womb\nStreets done already sentenced me, before no cracker could\nAnd I wonder why, when I'm just so fucked up out the hood\nAnd I wonder why, these niggas be hatin' on a G\nWhen I'm the same lil' nigga, who gave you niggas a chance to eat\nI had to do that time, could nobody do that shit for me\nWhen I was doin' that time, ain't nobody do that shit with me\nI miss my nigga Cool, I know right now he prolly sleep\nOne day at a time, ten toes down until you're free\n\n[Chorus]\nDyin' in a cell's every street nigga fear\nI give everythin' back to have my nigga here\nI give everythin' back to have my nigga with me\nI already know I had to beef, had my nigga with me\nI ain't tryna see the pen', I'm tryna make a shape\nNeighborhood hero, I'm the one gon' save the day\nChosen one, my folks depend on me to make a way\nI do it for my nigga locked up doin' day for day\n\n[Verse 2]\nThey gave Lil' Marcus twenty-five, that's my man (ayy)\nRemember hittin' licks and runnin' up them bands (ayy, ayy)\nThey gave Lil' Greg sixteen years in the pen (ayy)\nFor all my niggas locked up, I'm goin' H.A.M. (ayy, ayy)\nThey gave Lil' Ceelo twenty years, free my nigga\nThey say Lil' Tracy gettin' out this December\nI dropped fifty-five bands from my hand\nThey done let me out, so now I'm goin' in\nBefore he go back, shoot it out with the police (ayy)\nSo that mean he goin' to court in these streets (ayy, ayy)\nHe goin' to trial right there where he stands (ayy)\nFor everybody did me wrong, I want revenge (ayy, ayy)\n\n[Chorus]\nDyin' in a cell's every street nigga fear\nI give everythin' back to have my nigga here\nI give everythin' back to have my nigga with me\nI already know I had to beef,  had my nigga with me\nI ain't tryna see the pen', I'm tryna make a shape\nNeighborhood hero, I'm the one gon' save the day\nChosen one, my folks depend on me to make a way\nI do it for my nigga locked up doin' day for day\n\n[Outro]\nThis my motherfuckin' album\nPaintin' pictures man, lil' Kodak, you already know that"}]}