{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/17bdb55979efe915f90e0fa67b92ad61.1000x1000x1.jpg", "title": "Back Down", "lyrics": "[Intro]\nWoo!\nYeah\nG-G-G-G-G-Unit (G-Unit)\nHa ha\n\n[Hook]\nIt's easy to see when you look at me\nIf you look closely 50 don't back down\nEverywhere I go both coasts with toast\nEastside, Westside, I hold that mack down\nEvery little nigga you see around me\nHold a gun big enough to fucking hold Shaq down\nNext time you in the hood and see an O.G\nYou ask about me, the young boy don't back down\n\n[Verse 1]\nAny living thing that cannot co-exist with the kid\nMust cease existing, little nigga, now listen\nYour mami, your papi, that bitch you chasin'\nYour little dirty ass kids, I'll fucking erase them\nYour success is not enough, you wanna be hard\nKnowing that you get knocked you get fucked in the yard\nYou's a Pop Tart, sweetheart, you soft in the middle\nI eat ya for breakfast, the watch was an exchange for your necklace\nAnd your boss is a bitch, if he could he would\nSell his soul for cheap, trade his life to be Suge\nYou can buy cars, but you can't buy respect in the hood\nMaybe I'm so disrespectful cause to me you're a mystery\nI know niggas from ya hood, you have no history\nNever poked nothing, never popped nothing, nigga stop fronting\nJay put you on, X made you hot\nNow you run around like you some big shot\nHa ha, pussy\n\n[Hook]\nIt's easy to see when you look at me\nIf you look closely 50 don't back down\nEverywhere I go both coasts with toast\nEastside, Westside, I hold that mack down\nEvery little nigga you see around me\nHold a gun big enough to fucking hold Shaq down\nNext time you in the hood and see an O.G\nYou ask about me, the young boy don't back down\n\n[Verse 2]\n\"The rap game is all fucked up now, what are we gonna do now?\nHow we gonna eat man? 50 back around\"\nThat's Ja's little punk ass thinking out loud\nSouthside 'til I die, that's just how I get down\nI'm back in the game, shawty, to rule and conquer\nYou sing for hoes and sound like the cookie monster\nI'm the hardest from New York, my flow is bonkers\nAll the other hard niggas they come from Yonkers\nIt's been years and you had the same niggas in the background\nYou never gonna sell Mitsubishi Tah, Crack Child\nThem niggas dead, they just suck, they no good\nI ain't never heard a nigga say they like them in the hood\nI'm back better than ever on top of my game\nEven them country boys saying \"50 we feeling you, mane\"\nNow you stay the fuck outta my zone, outta my throne\nI'm New York City's own bad guy\n\n[Hook]\nIt's easy to see when you look at me\nIf you look closely 50 don't back down\nEverywhere I go both coasts with toast\nEastside, Westside, I hold that mack down\nEvery little nigga you see around me\nHold a gun big enough to fucking hold Shaq down\nNext time you in the hood and see an O.G\nYou ask about me, the young boy don't back down\n\n[Verse 3]\nI ain’t gonna' tell nobody you pussy\nI ain’t gonna' tell nobody you getting extorted\nI've been patiently waiting to blow\nLadies and gentlemen, welcome to \"The 50 Cent Show\"\nThis is my life, my pain, my knife, my gun\nNow that I'm back, you can't sleep, I'm a nightmare, huh?\nYou hired cops to hold you down cause you fear for your life\nBut you heard about them guns I done bought, right?\nI ain't going nowhere, I done told you, nigga\nI'm a G-Unit motherfucking soldier, nigga\n(They not gon' like you)\nI know, I know\n\n[Outro]\nOh no, he didn't say anything about Ja\nOkay? Ja is my boo, okay? Jeffrey Atkins ain't never hurt nobody\nAnd y'all know big thangs come in small packages, holla\nNow everythang was cool until 50 Cent came back into the picture\nThey better not put their hands on Jeffrey\nOkay, first of all, they don't know that I am a 12 degree pink belt\nOkay, I will dice his ass up like a little piece of celery\nOkay, cause see, they don't know me, Delicious, do they know me?\nOkay, I though so\nCause you know that I know karate, and I will see him\nAnd I will Jet Li his ass, hitaaaah!", "year": "2003-02-06"}]}