{"artist": "Wiley", "songs": [{"year": "2013-11-26", "lyrics": "Bound for the reload, bound for the upraw\nYou can' t hear me clear, turn it up more\nWithout weed I bet I could do much more\nActually that' s worth giving up for\nI just won an award that I was up for\nTook a trip for the grinds, now I' m up for\nFor, ok, let's be honest\nIf you say you' re a king, then you best be on it, or\nYou' re getting rained on\nI ain't just an MC with a chain on\nMy old friends got money, but it's brains gone\nHow you' re gonna win if you can' t get your game on\nLosing ain' t in the front of the mind anymore cause I flame on\nI broke out of my chains, got my aim on\nAnd I ain' t hire an artist you take on\nWhat' s your take on me, can I stay on?\nWhat' s your take on me? Am I good enough?\nBeen stabbed 21 times, am I hood enough?\nI ain' t gotta say what I done, but I' ve done\nLondon is a lot, one man can' t run it!\nI don' t glamorize it I wanna clean it\nSanitize it cause I' ve analyzed it\nThey see what we got, wanna paralyze it!\nKnowing that we are never gonna like it\nWinning, got a due pay for a jacket\nIf it's BBK then I back it\nPaid for, I' ve stacked it, Working is a habit!\nSome are nibbelin' veg like a rabbit\nI' m glad that this way is magic\nI feel free like an unpossessed addict\nGive thanks i made it out though\nCause any of a path would've ended tragic\nOn point-niggers, On point-figures\nManna spraying, but they ain' t on point with us\nOn point to the point, how on dinners\nPipe and hot steam, full of food when it simmers\nYeah, I' m a on point-negro, I' m on point like Feivo\nSee me on twitter not bebo\nCurvin my ego, saying you' re a boss but that' s not what we know!\nI like decent snares\nGood kicks, recent snares\nHit-hat playing on a real cool pattern\nGettin' it all wrong is a frequent fear\nYeah yeah frequent fear\nMy dad bless me I got a decent ear\nMy flow's rapid like a inceasant pear\nMy dons a bit wild we squeeze in here (like BRAP!)\nYou' ve got bars but you can' t make a banger\nI said BANG with no yearly planner\nI said BANG in the year 2 thousand\nDons are act fake, I can never be around them\nThe pounds and the dollars, I found 'em\nWith the sound I'mma get ground, no howling\nCame to the rescue, saw da scene drowning\nSave that scene I'm spring water from a mountain\nWanna argue, so what now then?\nTalk up talk up, when I'm prowling\nYou didn' t mean it, but that' s how it sounded!\nI push high figures, get 'em rounded\nI make cool shit, real cool shit\nWill my manager like it? I doubt it\nSee I' m from a urban scene, so i can't show him\nBecause he ain' t about it!\nI' m a G though, E3 though\nThat's why i surf nets and party 3G though\nIn the world of rave you gonna see me though\nAnd an only king with free people\nIt' s like I' m a slave to the club scene\nLiving the reality, I had enough dreams\nWe face a night I and it' s raining lot\nDon' t matter, cause we still gonna paint this town!\n\nNobody' s safe in a war, I know there' s nobody safe\nWhen I step into the field, I can' t see nobody face\nI roll through like a highlander, call me Wiley McCloud\nI tell people \"you don' t wanna see her twerking\nListen, Miley' s allowed\"\nIf I get called by a worthy opponent, then I' m all up for it\nI' m highly skilled in the battle\nThat's why I might push my luck with it\nYeah? Don' t give a fuck with it!\nLike who' s chucking it?\nI fill the clip full of lyrics, put a clip into the gun and start busting it!", "image": "https://images.genius.com/4a45f722422fe25bcc7e814f98327a27.517x517x1.png", "album": "Ya Dun Know Vol. 1", "title": "CN Tower Freestyle"}]}