{"songs": [{"year": "2019-01-25", "album": "Lifestyle", "image": "https://images.genius.com/8e1ccf4bffb1e69e1caeac42ff135a8b.1000x1000x1.png", "title": "Da Kers Effect", "lyrics": "[Verse 1]\nIf I fall down, would you pick me up?\nWould you come to the bottom and then lift me up?\nCuttin' off cunts, I can see they're fake\nI can tell why they wanna be mates, they snakes\nIt's crazy days till I fade away\nForget who I am, forget ABK\nForget all I done, forget all the fun\nForget all the fame, forget all the cunts\nLike wipe my brain, it's quite insane\nWill you hit backspace when you type my name?\nThat's overthinking, where to go?\nNone of you cunts can scare me bro\nBeen through more, been here before\nHad 'em all doubt me, now they need me more\nWhat you meant to do when the table change?\nAnd your mind play tricks in your crazy days\nCatch up shit like Karma now\nHad to give me Kalma to calm me down\nHad to hit me hard, I'm sparrin' now\nRap turnin' into \"Who be the hardest?\" now, wow\nShoulda seen this comin'\nWhen the scene was runnin'\nAway from me, they couldn't keep up, I was patiently\nSittin' there like, \"Who want a go?\nWho want it with the team that everybody know?\"\nAnd everybody bitin', everybody writin'\nEverybody fightin', everybody likin'\nMy clique, what you forgot?\nForgot what we did for the rap, you gronk?\nForgot if it wasn't for the Kers or Scot\nThere wouldn't be a scene for you nerds to rock?\nEarn your props\nI hear your songs, I turn 'em off\nYou fear the god, I burn the lot\nYou're not near the top, that's Kerser's spot\n\n[Bridge]\nLike try break down everything\nI did to push the scene forward\nOff my own back\nAfter being blacklisted from everywhere\nSo then I created a new scene\nSo rappers who would've usually been ignored\nNow have an opportunity to get heard and get paid\nThat's 'cause of me bro\n\n[Verse 2]\nListen up there, I slap your face\nLet me take you back, back in the day\nTwo-thousand-eight, poor as shit\nKickin' them rhymes, they raw as shit\nMade a buzz, yeah, but the radio\nWould ignore back then, wouldn't play me bro\nIf you wasn't on the FM, you wasn't gonna make it\nI was the first in the country to break that\nI was the first in the country to face that\nI was the first in the country to make rap\nBlow up from the underground\nNo barriers to break 'cause I done 'em now\nG.O.A.T, that's the reason\nWith another million, what's the meanin'?\nWhat's the point in me braggin' more?\nReflectin' back, I'm glad I saw\nEverything I did, everything that I fought through\nEvery single kid that is rappin' now, I taught you\nBe yourself, don't change for them\nI taught you that here in Australia, man\nGet that right when they write the history\nDon't twist shit, don't make a mystery\nWhen I leave, I bet they miss me\nInclude this, I'm reppin' Sydney\nSouth west, a monster\nGet the doctor\nShoulda' changed me when you had the chance\nBut you try block me out so I had to stand\nUp for myself when the public knew\nKerser fans were like, \"Fuck you too\"\nBrang rap culture to the streets\nI could go on forever, I'ma leave it to the beat\nPeace"}], "artist": "Kerser"}