{"songs": [{"album": "From A Planet Called Harlem", "image": "https://images.genius.com/d8c05b527f7360b8e57ac7d6e1bef6a1.500x500x1.jpg", "year": "2009-07-06", "title": "I’m Illy", "lyrics": "[Intro: Chris Brown]\nYeah, '09 our year, hahaha\nMixtape status, YouTube, hahaha\nTeyana Taylor, what's good?\nC. Breezy in the buildin'\nYeah, man\nLet's go in\n\n[Verse 1: Chris Brown]\nI'm in the clouds, homie, no gas mask\nPaper long, stacked higher than giraffe ass\nI'm used to drivin' spaceships so I'm landin' wrong\nOn some ugly shit, ET with a bandana on\nDolce book bag, Louis rag, hangin' out the right side\nRed lightnin' in my hair, I'm lookin' on the bright side\nListen to my music, yes, I highly recommend it\nBut if you ain't messin' with it, why the hell you commentin'?\nAnd I'm really lovin' rappin' now, know I had to get it in\nListenin' to rappers and some of 'em soundin' feminine\nAny stage or any show I been there or I done it\nToo big and these girls run from it, haha\nThese young niggas here now, yeah, we 'bout to shut 'em down\nMy little sister Teyana Taylor and yeah, I'm Chris Brown\nAnd ain't no goons with me, gon' act silly\nDon't forget, mothersucker, I'm illy\n\n[Verse 2: Teyana Taylor]\nUh, I guess the magazines just ain't enough, still wanna play with us\nWhen that beat get murdered, right away you know they say it's us\nBlog sites, web sites, they all know I'm dead nice\nPorsche at the red light, you Honda chicks is dead tight\nMoney steady generatin', haters give me inspiration\nSwagged out generation, got your child board skatin'\nM.O.B so solid, Ray-Bans so poppin'\nMulti-colored fingernails, cranberry phone posse\nKillin' every beat I touch, body everythin' I say\nPen game, whip game, I just bought a car today\nJealous of my one of a kind swag, you're dumb match\nShorty tried to copy and paste my style, she's dumb gas\nScared of nobody, I push it to the limit\nYou rap chicks is burnin', here's a number to a clinic\nCB is with me, get familiar with the movement\nNeglect every instrument to my body and abuse it\n\n[Verse 3: Chris Brown]\nAlexander McQueen jeans, I'm on that mean shit\nSuper sweet 16 clean, my magazine clip\nYeah, you a hater now, check, check out my gators now\nRockin' goose downs and I'm with a belt crocodile\nCan't forget my fur coat, shawty name Merlow\nAnd she mad wild and I like the way it purr yo\n2012, yeah, I'm rockin' new denims\nWith the temperature control all in 'em\n\n[Verse 4: Teyana Taylor]\nYeah, I'm gon' go hard, flow hard\nEvery time I spit is up to par, you know I show off\nLyrics is impeccable, you know I'm gon' act the fool\nYo, he and my model swag, Y-3-2 cool\nYeah, my block is forty left, you know we don't play no games\nTimberland, hard denims, wife beat swag flames\nHarlem is my birthplace, L.A. where my work lay\nHaters check my profile, naw, this ain't MySpace, ow\n\n[Outro: Teyana Taylor & Chris Brown]\nLet me laugh in they face, ass, hee\nCB, hahaha\nYeah, stanky leg\nAight, I hear you\nOld hungry, hungry hippo ass, hee\nLaugh in they face ass, cow, face ass everything\nHarlem school of rat ass, hee\nWhat is it thumpin'? It's beautiful\nYo', yo' hair real like mine, man\nBark like a dog\nHa, a big dog\n*Woof, woof*\nAyy, we illy, we illy\nYeah, man, we just doing this for fun\nWe love y'all\n2009 on everything, you already know\nHey, what you gummin' this? Oh"}], "artist": "Teyana Taylor"}