{"artist": "3rd Bass", "songs": [{"lyrics": "Don't drink the milk (why?) IT'S SPOILED!\n\n[Pete Nice]\nEyes slow to open, alarm clock's broken\nI'm steppin out the bed but ain't a booty line spoken\nStick a 40 to my lips, I sips and I guzzle\nA 40-dog \"Breakfast of Champs\" it ain't a puzzle\nGrips on my feet and step out my rest\nI meet MC Dope Incredible and DJ Fresh\nThey got a demo; fiendin for my headphones\nSo I throw it my system but it's so-so\nI said, \"The weebles wobble, but I dabble in verbals\nThe movies that you're makin get the herbalz\"\nThis ain't a Prince Paul loop from The Turtles\nIt's just 3rd Bass givin y'all the herbalz\n\nHerbalz in your mouth (there it is, there it is)\nEverybody say herbalz in your mouth (There it is, there it is!)\nEverybody say herbalz in your mouth (There it is, there it is!)\n[Serch] Hold up! Weebles wobble, but they don't fall down\nHerbalz in your mouth (say WHAT?)\nEverybody say herbalz in your mouth (there it is, there it is)\nFrom the North and to the South (there it is, there it is)\n[Serch] Weebles wobble, but they don't fall down\n\n[MC Serch]\nWeebles wobble, but they don't fall down\nBut them herbalz, they bobble and you see them all around\nThem 501 blues can't hide the red apple\nWhen I'm in a bodega, buyin some Snapple Orange Iced-Tea\nSkins are playin nicety behind me\nScatterbrain no-name do you mind G?\nSpot the profile and slips in the Serch zone\nAnd wants a description of the bone -- hold up\nWants a description of the bone?!\nPlay AT&T and check the three on your telephone\nD-E-F, then I left to break South\nAnd left a herbal in her mouth\n\nHerbalz in your mouth (there it is, there it is)\nHerbalz in your mouth (there it is, there it is)\nEverybody say herbalz in your mouth (There it is!)\n[Serch] Weebles wobble, but they don't fall down!\nHerbalz in your mouth (there it is, there it is)\n3rd Bass givin herbalz in the mouth (there it is, there it is)\nHerbalz in the mouth (there it is, there it is)\n[Serch] Weebles wobble, but they don't fall down!\n\n[MC Serch] + {DJ Richie Rich scratching}\nHerbalz.. HERBALZ! Ha ha ha\nHerbalz..\n\n[Serch] Weebles to the weebles to the wobbles - to the herbalz\n[Nice] I don't drink milk when it curdles\n[Serch] Cause then it's too pasty, French like pastry\n[Nice] It's like gettin caught boostin at Macy's\n[Serch] True indeed, Cogswell Cogs, and Sprockets at Spacely's\n[Nice] I make like George, and Jet-i-son safely\n[Serch] to my rest and not a Tribe but I'm Quest'n\nYou got bad breath, then take a Certs with Retsin\nDribble dribble drabble say what, I beg your pardon\nQuincy ain't convinced me, got my own \"Secret Gardens\"\n[Nice] So now we boomin out the speakers and amps (true)\nBuggin your nuts like the PMS cramps\nSome falsified but I gots bones to pick\nThe only nine you ever seen was in arithmetic\nHerbalz given, how you livin?\n[Serch] Yo I ain't played like a pseudo\n[Nice] Herbalz in your mouth, and mine are macanudo\n\n(There it is)\nHerbalz in your mouth (there it is, there it is)\nEverybody say herbalz in your mouth (there it is, there it is)\nSay herbalz in your mouth (there it is?)\nEverybody say herbalz in your mouth (there it is, there it is)\nA from the North, to the South (there it is)\nEverybody say HERBALZ IN YOUR MOUTH\n\n[MC Serch]\nGot the herbalz in your mouth\nPete Nice! No herbalz, in his mouth\nRichie Rich! No herbalz, in his mouth\nPrince Paul, no herbalz in his mouth\nYes, yes man\nGot herbalz, where they at?\nGot herbalz..\nHerbalz in your mouth yo where they at they in your mouth\nHerbalz in your mouth yo where they at they in your mouth\nHerbalz in your mouth yo where they at they in your mouth\nMouth mouth mouth, m-mouth, m-mouth..\n\nBut I see some skins, they got herbalz in their mouth\nYou need to break out, if you got herbalz in your mouth\nCome now son, you got herbalz in your mouth\nThe her, the her herbal her ah erbalz\nYou got the her her the her the herbalz in your miggy-miggy-mouth\nDa mouth, HOW MANY HERBALZ IS THAT?\nYou got herbalz in your m, da miggy-miggy-mouth", "image": "https://images.genius.com/ba67f25eba0c6951171aa44e82a3051a.600x600x1.jpg", "album": "Derelicts of Dialect", "title": "Herbalz in Your Mouth", "year": "1991-06-18"}]}