{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "[Hook]\nWho the coldest motherfucker in the room?\nColdest motherfucker in the room?\nWho the coldest motherfucker in the room?\nColdest motherfucker in the room?\nWho the coldest motherfucker that you know?\nWho the coldest motherfucker that you know?\nBring him 'round here he's gettin' froze\n(He's gettin' froze, he's gettin' froze)\n\n[Verse 1: Mac Miller]\nRoll it up, let's smoke\nAnd tell me why your bitch look like Glenn Close\nI'm on my own two, that's ten toes\nFirst the bullets fly, somebody says \"go\"\nWhy you bent low when your Jordans' retro\nGirls playin' games for the bills, they Drew Bledsoe\nThere's a lot that you can buy, but I'll never own\nAnd a lot of information that I'll never know\nLearn 'til they get concerned for my sanity\nYour life is filled with vanity, needs a little clarity\nThis the truth, this a taste, can you handle it?\nA million dollars couldn't cover up the damages\nNaked girl at the crib makin' sandwiches\nAnd when we makin' love I got a candle lit\nSome romantic shit to put her in the mood\nThe world woke me up, now I'm lookin' at the snooze\n\n[Hook]\nWho the coldest motherfucker in the room?\nColdest motherfucker in the room?\nWho the coldest motherfucker in the room?\nColdest motherfucker in the room?\nWho the coldest motherfucker that you know?\nWho the coldest motherfucker that you know?\nBring him 'round here he's gettin' froze\n(He's gettin' froze, he's gettin' froze)\n\n[Verse 2: Curren$y]\nLife, look at my hands I'm the lord of the reigns\nMusical cocaine brought me all of these Carrera keys\nSoft top goin' hard on the block freeze that talk\nAnd that plot about walkin' up on me\nNo security just my homies, the well-dressed army\nPresidential arm piece, my credentials I'm a G\nAll access, Jets wherever you won't be\nSnatch that 'vette for my mans the day of his prison release\nShoe was on the other foot I know he would've done the same thing for me\nBut we'll let that be\nPark it in the spot right next to my B with the chrome wings\nI was sent here to own things\nBoth sides of the court, colder than the airport\nTherefore I'm the one them hoes here for, yeah what\n\n[Hook]\nWho the coldest motherfucker in the room?\nColdest motherfucker in the room?\nWho the coldest motherfucker in the room?\nColdest motherfucker in the room?\nWho the coldest motherfucker that you know?\nWho the coldest motherfucker that you know?\nBring him 'round here he's gettin' froze\n(He's gettin' froze, he's gettin' froze)", "year": "2012-04-18", "album": null, "title": "Cold"}], "artist": "Mac Miller"}