{"songs": [{"album": "RevolveR", "image": "https://images.genius.com/8bd04bc09ad7c7eedd7520acce15651f.960x960x1.jpg", "year": "2011-12-06", "title": "Default Picture", "lyrics": "[Intro] Whoa, oho, oho, whoa\n\n[Verse 1: T-Pain]\nI got a feeling in my bones that I can't get rid off\nBut that's probably the base\nCan't get this picture out my mind, that I've seen on Twitter\nThe one of your face\nGirl I'm just trying to see, if you feel just a little like me\nSo DM me back, don't do me like that\nI wanna see your pretty ass in person, girl\nBut that's just not the case\nPlus I'm way on the other side of the earth\nAnd girl plane tickets too hard for me to pay\nI'm just trying to see, if you feel just a little like me\nSo you can give me a call\nI ain't doing nothing at all\n\n[Hook]\nGirl you can tweet what you do\nAnd posting pictures\nAnd I feel like I need to be posted with you\nLaid up in the bed somewhere, spilling make up, messing up your hair\nGirl you keep making me spend my time\nChecking on your timeline\nYou make me say whoa oho Yeah Yeah\nI'm falling in love with your default picture\n\n[Verse 2]\nYou don't ever show up in my mentions girl\nJust say my name\nMust be some wrong with my eyes of my iphone-drive\nOr is this even your page?\nI am just trying to see if you got any interests in me\nOr am I bothering you?\nShould I be unfollowing you?\nAnd you be acting like that dude in your picture is your boyfriend...\nBut I know it's just a face\nLet me show you that I am better than him\nJust name a time and place\nGirl you gotta see where he is, that is hould be\nGirl you can give me a call\nI just wanna have a talk that's all\n\n[Hook]\nGirl you can tweet what you do\nAnd posting pictures\nAnd I feel like I need to be posted with you\nLaid up in the bed somewhere, spilling make up, messing up your hair\nGirl you keep making me spend my time\nChecking on your timeline\nYou make me say whoa oho Yeah Yeah\n(2x)'\nI'm falling in love with your default picture"}], "artist": "T-Pain"}