{"artist": "Bas", "songs": [{"lyrics": "[Intro]\nIt's Bas, It's Bas\nQueens, that's right\nFiends, that's right\nSuper Mook Fiends\nYea, It's good\nLet's get it\n\n[Verse]\nOkay, I got this chick enthralled, slippin' out her draws\nStick it in her jaw first then I'm in her snatch like I'm dippin' with this broad, purse never comin' back\nCuttin' like a barber stupid niggas spoiled her\nBut I'm a G see? Luke I am your father\nVader how I son these niggas, cater how I serve these niggas\nBig beard, Al-Qaeda with the fuckin' clippers\nSix gears y'all chasin' when we fuckin' dip in\nPop my clip and shoot my shot\nGot her butt naked in my fuckin' kitchen, alfredo what she cookin'\nLight a blunt when we want a killin' of the good shit\nNiggas front, I got a couple hittas up in Brooklyn\nSo they can go to hell they haters\nCatch me a fine honey, bag two bitches in the elevator\nWe'll celebrate her penetrate her, shit cold\nTop floor, you ain't got the code for the elevator\nShine like a laminator so the hoes wanna stronghold\nHit 'em with the Arnold, part one, two, three I'm a terminator\nSalvation week and honestly man, the last couple weeks\nLight the gas on the beat, like a pass from the heat\nJames, Wade, Bas I'm a G, no stage name\nTies on the street we bang, bang\nEyes on the prize so my mind run in circles\nTry and go for mine, and I'll fuckin' hurt you\nMoms was a dime? then I probably birthed you\nGave you a style boy now it's time for curfew\nSleep tight, see the light of day\nSticky finger face time, Onyx with technology\nSchool I used to waste time, but I know biology\nAnd I know my chemistry, bet I know my math\nI will solve the task, pushin' somethin' foreign with 200 on the dash\nWhen they call ignore 'em if it ain't about the cash\nShorty got it goin', she amazin' with the ass\nBas lap these rappers like I'm tapin' down the gas\nPedal to the metal, New York City prince, rose pedals for the fellow\nThis is hella instrumental, shit, I had to go and get a rental\n\n[Outro]\nIt's Bas, It's Bas\nQueens, that's right\nFiends, that's right\nIt's Bas, It's Bas\nFiends", "image": "https://images.genius.com/90ed5acc5725bddf1d8feb24c15ed9f9.300x300x1.jpg", "year": "2011-05-27", "title": "Divorce", "album": "Quarter Water Raised Me Vol. I "}]}