{"songs": [{"lyrics": "[Intro: Pain In Da Ass]\nSorry boys\nBut all the money in the world couldn't bring me back again\nLay down, lay down\nGonna stretch my mic out in Ponce Funeral Home on Marcy\nAlways knew I'd make a stop there\nBut a lot later than a whole gang of people thought\nThe last of the real hustlers, well, maybe not the last\nBleek's gonna be a good rapper\nNew, improved Jay-Z -- I quit\nI'm retiring, ain't enough money in this game to keep me around\nSorry Big, I tried, honest\nCan't go with me on this ride though, I'm calling the shots\nThe bar's closing, where we going to for breakfast?\nRoc-A-Fella y'all -- OKAY, I'M RELOADED!\n\n[Bridge]\n\"Bringing the drama\"\n\"Trying to come up in the game\"\"Marcy\"\n\"Add a couple of dollar signs to my name\"\"Roc-A-Fella y'all\"\n\"One of the best!\"\n\"Waiting for my day to come\"\n\"Just give me the word\"\n\n[Verse: Memphis Bleek]\nNah this ain't Jigga, it's your lil nigga Bleek\nReporting to these motherfuckers live from the street\nGame I peeped those, my mind so advanced\nAt nine I used to geese hoes for Easter clothes\nPeep the steez, I represent for all those\nWith 28 grams, on a come-up trying to creep the keys\nLarge niggas told me park the car, keep the keys\nFind a hoodrat and creep to Mickey D's\nFirst gun two bullets, niggas know I do pull it\nNiggas trying to kill me dog, who wouldn't?\nScrew Gooden, I pitch in the PJ's\nLit off the EJ, I split Dutchies with my ring finger\nYou find a bitch that owe me cream, bring her\nLast seen with Bing, he got dropped between us\nShit is constant, that's why I pack the\nJohnson and Johnson for the nonsense, who wants it?\nI go to sleep with a picture of a Porsche on my wall\nMan I'm trying to come up on y'all, get one up on y'all\nThat's why I hustle in these streets from sundown to sunup on y'all\nMama said keep bullshitting they'll kill you dead\nOne week of this hustling brought a living room set\nWent to Tom D's, niggas mad, veins out\nCopped the Jordan's, two weeks before they came out\nFlashy, fly little nigga\nNosy bitch from the third floor like \"Why little nigga?\"\nBitch please, twist the trees\nTook a long pull, like bitch to breathe\nThat's my answer, life's like cancer\nAnd I'm serious\n\n[Outro]\n\"Waiting for my day to come\"\n\"Just give me the word\"", "title": "Intro - Hand It Down", "image": "https://images.genius.com/1f3b917b779cd80ad127e64f21d6010a.1000x1000x1.jpg", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}