{"artist": "Abstract Rude", "songs": [{"lyrics": "(speaking)\nUh! Watch your step! It's no joke out here, watch your rep!\n\nAin't no joke to provoke a top seed\nFor those who smoke and they got they own weed\nAin't no walk in the park where I'm from\nDogs that bark, but they talk with they guns\nWasn't no unlocked doors where I stayed\nToo much trust in the cops, you got played\nI'm that spade in the deck to cut loose\nBe that blade in your neck, give respect due\nYou didn't expect me to get this far\nNow they caught the vapors, thought they learned from Bismark\nThis dark track could eclipse the sunrays\nHit hard raps, we should quit the gun-play\n'Cuz ain't no fun to relay the bad news\nOur sons and nephews know that cash rules\nFor it I'll never sell the soul of Ab Rude\nA poet of ever'one to tell the sad truth like\n\n(chorus)\nThe Undi-Sputed, Heavyweight, Rudest\nPa-rum-pa-pom! No jargon, could ever dead, this yard mon! (Yard mon!)\nInside, outside, all sides\nSeal the perimeter! I'm a lion of the pride\nHis tribe, my tribe, your tribe\nI put it into ya! Warlords of the Flies\n\nOnly 9-1-1's a joke here\nCops don't come till machine gun smoke clears\nShow no fear in your heart to get tested\nGo nowhere in the dark unprotected\nAs if I gotta remind you how hectic it is\nWe all have homies that set-trip\nThey'll call for medics when the gats unleashed\nYou'll regret it if you don't make it back in one piece\nThat's how they do it no resolving the beef\nWhy Battle Axe Crew stays armed to the teeth\nComin' at you with them tattood physiques\nSo if you rap weak, better take a back seat\nThis is a beat that's haunting in sleep\nIt could bump in your jeep, what they want from the street\nYou could never be measured as this rude\nMeet me up at the session to get schooled by\n\nThe Undi-Sputed, Heavyweight, Rudest\nPa-rum-pa-pom! No jargon, could ever dead, this yard mon! (Yard mon!)\nInside, outside, all sides\nSeal the perimeter! I'm a lion of the pride\nHis tribe, my tribe, your tribe\nI put it into ya! Warlords of the Flies", "title": "Warlords of the Flies", "image": "https://images.genius.com/4983e9cca6dac4d778ba076803b948bd.400x400x1.jpg", "album": "Battle Axe Warriors III", "year": null}]}