{"songs": [{"title": "Ass Shots", "lyrics": "[Hook: Young Scooter]\nShawty knows she's bad with her ass shots\nBut baby, don't you get the wrong ass shots\nScooter signed to who? I ain't no mascot\nIf you push a nigga trapping, get his ass shot\nFuck nigga right up on me, he gon' get his ass shot\nShawty ass up, even got the wrong ass shot\nTry to roll up with that pack and you gon' get your ass shot\nThe last nigga cross Scooter got his whole hood shot\n\n[Verse 1: Young Scooter]\nI gave this nigga 6 bricks, he tried to run off like he slick\nThe latest pack from Oakland, yeah I call it filthy rich\n100 thousand, pushing Cali kush, got that for 86\n80 racks, 800 of that ain't go for 26\nShawty made a mill since she made her last shot\nShe make a free band every time her ass drop\nIf the pussy good, you know I'mma cash out\nI fuck a hoe in 10 minutes then I smash out\nNigga try to snatch my chain, he gon' get his ass shot\nBitch your baby daddy broke, you know he work for the cops\nI'm a million dollar nigga but I still be on the block\nI'm a black amingo boss, you a fucking mascot\n\n[Hook: Young Scooter]\nShawty knows she's bad with her ass shots\nBut baby, don't you get the wrong ass shots\nScooter signed to who? I ain't no mascot\nIf you push a nigga trapping, get his ass shot\nFuck nigga right up on me, he gon' get his ass shot\nShawty ass up, even got the wrong ass shot\nTry to roll up with that pack and you gon' get your ass shot\nThe last nigga cross Scooter got his whole hood shot\n\n[Verse 2: Boosie Badazz]\nI got beaucoup bad bitches, they preform ass shots\nAss done, titties done, but they bad, bottom line\nFuck this girl, he in his feelings say I'm down in bed huh\nNo refund, now he mad he pay for her ass shots\nShawty went to the wrong doctor now her whole ass washed\nAin't no shapes, square straight like a old flattop\nNigga jumping in the club, Boosie play the backdrop\nStrategize the next guy who gon' get his ass shot\nAin't no red eye, no fuck boy, and I sure ain't no mascot\nShe bad, I'm gon' fuck when you fuck 'bout no ass shots\nFlipping up in your crib boy, you know I wear flash shots\nHow you gon' judge her ass shots when she cashed out, nigga?\n\n[Hook: Young Scooter]\nShawty knows she's bad with her ass shots\nBut baby, don't you get the wrong ass shots\nScooter signed to who? I ain't no mascot\nIf you push a nigga trapping, get his ass shot\nFuck nigga right up on me, he gon' get his ass shot\nShawty ass up, even got the wrong ass shot\nTry to roll up with that pack and you gon' get your ass shot\nThe last nigga cross Scooter got his whole hood shot", "album": "Street Lottery 3", "year": "2016-05-01", "image": "https://images.genius.com/03ec4ed7a08aa24f414bc7b2074c7f5b.1000x1000x1.jpg"}], "artist": "Young Scooter"}