{"songs": [{"title": "Elevate*", "album": "LS2*", "year": null, "image": "https://images.genius.com/69eee639bab29343a04455251289a151.1000x1000x1.jpg", "lyrics": "Lyrics From Snippet\n\n[Chorus: Lil Skies]\nCaught the game, make a play, then we elevate (Yeah)\nWalkin' to the party, my pockets overweight\nYou say that's your shawty, why she all in my face?\nI don't fuck with these niggas, I know they gonna hate\nCaught the game, make a play, then we elevate (Yeah)\nWalkin' to the party, my pockets overweight\nYou say that's your shawty, why she all in my face?\nI don't fuck with these niggas, I know they gonna hate\nCaught the game, make a play, then we elevate\n\n[Verse 1: AWG Stanley]\nOoh, top floor we smokin' gas with a couple bitches\nI just landed in the city, now I'm bouta' get litty with a couple of bad bitties', now I'm off again\nI came a long way with 2 Glocks, I had 2 Glocks again\nI had 2 Glocks up in the trap, but them bitches were twins\nThen I would dress up in the trap, doin' hands to hands\nAnd all these niggas in my DMs tryna beat my mans\nAnd pussy nigga if you lame you cannot hate\nI'm gonna hit 'em with the choppa let the 30 bang\nAnd all these niggas y'all are pussy had to elevate\nA couple years ago a nigga was not livin' straight\nI had to get all the pussy and the money back\nAnd all these niggas talk shit and say I'm up tight\nAnd all that shit you cannot cop no worth\nAnd if you come on fuckin' sure then I'ma go berserk\n\n[Chorus: Lil Skies]\nI need to elevate\nWalkin' to the party, my pockets overweight\nYou say that's your shawty, why she all in my face?\nI don't fuck with these niggas, I know they gonna hate\nCaught the game, make a play, then we elevate (Yeah)\nWalkin' to the party, my pockets overweight\nYou say that's your shawty, why she all in my face?\nI don't fuck with these niggas, I know they gonna hate\nCaught the game, make a play, then we elevate\n\n[Verse 2: Lil Skies]\nYeah\nAnd she in love with the top shotters, nigga\nWe ain't fuckin' with no broke bitch, why you with her?\nI just hit her with that dope dick, I don't kiss her\nWhy your mans tryna sneak diss on Twitter\nHe claimin' that he really"}], "artist": "Lil Skies"}