{"songs": [{"year": "2016-04-06", "image": "https://images.rapgenius.com/dd6459cbd7a9bbc163f65d9e61766f27.500x500x1.png", "title": "Making a Murderer", "album": "Streams of Thought Vol. 1", "lyrics": "[Verse 1: Black Thought]\nI said, outer space the place that I’m parkin’ in\nMy marketin’, when you see the sky darkenin'\nRhyme artisan from the crew that's bipartisan\nHi haters a 5th grader you're not smarter than\nAlpha & Omega you betas I march harder than\nBatteries, y'all ain't included, you're not a part of it\nI just took a flight to France to cop cardigans\nAt Lanvin\nI'm that primetime Buju Banton\nAnd I'm just trying to get it on 'til I die\nAm I wrong if I'm living like the laws don't apply?\nMaking music out of nothing, know that boy's bonafide\nIt's disturbing when a murderer enjoys homicide\nTalented Mr. Trotter squad, beyond qualified\nMultiplying the dollar sign, the grind is real it's Palestine\nMy sidekick came from Columbine\nThat fly shit came from Saint Laurent\nSurprise, bitch! I never lived a false moment in time\nRiddle me, what kind of omen am I? You know the slogan is right\nI said a weapon should be chosen to fire\nOnly the ghetto Beethoven replied, the ninth wonder maker\nThunder breaker send these toys to the undertaker\nMy pen smoking like a rude boy from Jamaica\nWhile I'm erasing every fuckboy from the face of the Earth\nWhat's up, boys? It's time for you to get your weight up\nYo, I probably began in the Rift Valley\nIn places untraceable by Rand McNally\nTook a cobblestone trolley through a Mercer Street alley\nThe more championship rings than John Salley\nBiochemically on par with Salvador Dali\nI traveled to Tijuana to smack the federali\nWho packing avocado toast like Mario Batali\nI'm an ocean without a coast, going back to Cali nigga\nName some other body who equally as ill\nFrequently I see the drama call me Cecil B. Demille\nNot a chink up in the armor though I'm lethally for real\nPeople been telling me recently, \"Tariq, you need to chill!\"\nWell picture that, the diplomat pistol slap aristocrats\nAny rapper coming for me, I'ma send a missile back\nNot too many legends got a legacy that's this intact\nThat equipment I'm grippin kept where the ammunition at\nSoul Makossa like I'm Manu Dibango\nWild as the Democratic Republic of the Congo\nI'm Hunter S. Thompson doing it gonzo\nA rapper winds up as a John Doe, I told niggas\nSixty seconds to shine before I fold niggas\nI must be out of my mind with it, gold diggers\nHere come the general for the quadricentennial\nI'm a non-millenial what I rep is the old niggas\n\n[Verse 2: Styles P]\nLet's meet at the crossroads of torsos\nAnd learn some things only the Lord knows\nBreak the law, it's the only law now, no one knows\nGot pies in the oven but no DiGiornos\nWe all got fucked but no pornos\nWe ain't growing corn but got cornrows\nWe ain't playing greens but we be spending it\nLifespan is short, try extending it\nIf you ain't into reading,  I'm recommending it\nI'm reading Carter G. Woodson when I'm in the woods\nWhen the money's cut off, then we barter goods\nA lot of niggas is cowards that ran out of fatherhood\nShould we kill them or let 'em live?\nI don't fuck with no suckers, I never did\nMi amore, if you a Moor\nIf I ever go to war it's the kids I do it for\nI eat emcees they can send me a few of yours\nAnd by a few I mean way more than two\nYou can times that by twenty and tell 'em to come through\nAnd watch them get beat like African drums do\nOld soul, I probably gave lessons to Sun Tzu\nLyrically I'm Bruce Lee master of Kung Fu\nRhyming with Black Thought assessing the black thought\nI told you that I'm conscious but bitch we'll clap off\nI'ma be the one that they hold in a rap off\nI ain't wrapped too tight, nigga I snap off\nOr maybe I snap on\nWhen I go for the rhyme my nigga the latch on\nI'm Hannibal on an elephant, animal but elegant\nGiven you hell heaven sent\nLight a joint, I've been places you've never been\nIf I close my eyes, I could die then get wise\nRead my life like a script, I'm getting it revised\nUsed to keep the beat joint right up in the Levi's\nI'm the tenth wonder I told them to ask 9th\nI'm the other Black Thought, the last ear bender\nAvatar ghost, the one who could bend time\nThe one who could bend rhymes, the one who could bend flows\nRepping for all niggas, little nigga you know\nWe the ones who made making of a murderer\nFuck around and you could be in making of a murderer\nGhost!"}], "artist": "Black Thought"}