{"songs": [{"album": null, "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg", "title": "7 minutes", "year": null, "lyrics": "[Hook: DOLLABiLLGATES]\nMy cellphone ringin’ every 7 minutes (hello)\nI’m on here on my grind, chasin’ 7 digits (oh)\nI can’t waste no time, man, I gotta get it\nI ain’t even count it yet, I already spend it!\nMy cellphone ringin’ every 7 minutes (hello)\nI’m on here on my grind, chasin’ 7 digits (oh)\nI can’t waste no time, man, I gotta get it\nI ain’t even count it yet, I already spend it!\n\n[Verse 1: DOLLABiLLGATES]\nRidin’ ’round my city in a 100 Gs\n30 bitches on my dick, I feel like Lil’ B\nDamn, Based God, look at that paint job (damn!)\nI took my ghetto bitch to Wingstop\nMy phone still ringin’ and it won’t stop, nah!\nThink I’ll buy an extra phone for the extra guap\nPhonebook paper in my pocket, homie\nI can’t even fold the motherfuckin’ profit on me!\nQuit callin’ my phone if you ain’t talkin’ business\nI’m out here on my grind, chasin’ 7 digits\n\n[Hook: DOLLABiLLGATES]\n\n[Verse 2: 2 Chainz]\nI already spend it, denim True Religion\nGive 7 minutes, I can pull me 7 bitches\nPlus I got a 7 in my Gucci tennis\nDrop this shit off, I need a pooper-scooper with me\nIf you was with me, all you gotta do is do it with me\nIf you act right, I’ll take you to the movies with me (get it?)\nThe work here so I got that phone call…\nI meant to say that bird call\nI count money every night until I doze off\nRidin’ in the Jeep with the doors off\nGot them 26s, so I took the 4s off\nIf I put the jewelry on, we done had a froze off\nI do it for the Southside, spell it with an “F”\nAnd the “F” stands for “Yeah, you fuckin’ with the best”\n\n[Hook: DOLLABiLLGATES]\n\n[Verse 3: DOLLABiLLGATES]\nWalk up in the club, lookin’ like a rapper\n$30,000 all twenties, feeling like a trapper\nWe just wanna pour up that Ciroc, hoe\nWhy the fuck you think I brought this extra guap for?\nA 100 miseed calls and they still text\n20 bottles later I will still flex\nMy phone don’t get no service in the VIP\nHer phone don’t get no service when she be with me, no!\nWe was bending corners in my Flying Spur\nShe never seen a car where the floor’s fur\nMy phone’s still ringin’, I can’t answer, though\nI spent a lot of money, I ain’t count it, though\nMy cellphone ringing every 7 minutes\nI’m out here on my grind, chasin’ 7 digits!\n\n[Hook: DOLLABiLLGATES]"}], "artist": "2 Chainz"}