{"songs": [{"title": "Earthquake Hits", "lyrics": "AKIR - “Earthquake Hits”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Intro: AKIR]\nLet’s go.  Damn.  This world is filled with tragedies.  We at war with terrorists, buildings falling down.  Haha.  And babies going to bed hungry now.  And niggas killing niggas.  All over again\n\n[Verse 1: AKIR]\nYo, earthquake hits, world erupts and splits, continental\nShift while the Earth axis splits.  Meanwhile\nWe’ll raise a mean child with fear in his heart.  Hits\nThe Colorado instance—we’re falling apart.  Yo, we should’ve\nListened to the Indians’ wisdom, followed the ways of nature\nBut, instead, we made our own system an ultraviolet prism\nWhere we practice hedonism, capitalistic\nConflict and democratic cannibalism.  If we\nOnly listened to the Rastafar rise through lifetime\nEmulate the sky while they stay on smoking lye\nExhale some hill cess known for calming terminal illness\nBut we didn’t and further then explored the\nForbidden, partied the Marley composition.  But never\nHeed the written.  Shit, if a nigga only listened to the\nHindu singing hints of Dalai Lama, maybe\nNext time, the situation will be calmer if we just respect\nKarma.  Overpopulating ourselves, safari\nGunshot shells bucking at a gazelle.  If it was\nYou, it’d be Hell.  Who’s child is really on the line?\nRespect Mother Earth before we run out of time.  Uh\n\n[Outro: AKIR]\nWhat do y’all think is going on out here?  Neglecting the Earth.  Therefore, the Earth shall neglect you.  Take care of what’s yours, man.  God gave this for us so that we shall recreate and rise again.  And y’all sitting here, bickering about power.  Who got the power?  God got the power.  Don’t neglect that.  Never bite the hand that feeds you.  This goes out to all my little shorties out there.  Queen Isis.  My little nigga Tajae.  And my little girl Ashley.  Know’m saying?  Yeah.  I want to give a big shout-out to my man Big Noah, little Elizabeth, Jacob, Lindsey.  Y’all the future, man.  So you protect what’s yours.  One.  Yeah, uh", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}