{"artist": "G-Eazy", "songs": [{"title": "G-eazy Tim Westwood Freestyle 2017", "album": null, "year": "2017-07-07", "image": "https://images.genius.com/fd7ed1a82cc621a07ef0ec67ae88b145.1000x1000x1.jpg", "lyrics": "[Intro]\nYoung Gerald, this is how it's happening\nArd\nYeah\nYeah\n\n[Verse]\nHitting Britneys with the federline\nI just speak my thoughts, I don't never have to edit mine\nShe been off the chow, higher than my credit line\nHard drugs, you'd be hard pressed to find a better time\nI Got my mind made, I be setting mine\nI could get the pussy fast, any place, any time\nFree Kevin Gates\nYeah I'm really out my mind\nFuck you, exclamation, exclamation, underline\nThey ain't make me, I prayed for it, and i worked daily\nThey try  but they can't change me\nWhy you rappers don't eat?\n'Cuz you're too fucking lazy\nPay no mind, I only chase Jay-Z or Shady\nSmoking hella chronic getting faded\nMoney is Goliath yours David, we can't trade it\nGot three girlfriends, three sex drives, I should probably braid it\nLive a wild life 'cuz I made it\nListen, yeah uh\nAnd i don't take dayoff exhibition game. but i still treat it like a playoff\nReally no surprise, you put the work in, then it pay off\nLook I be off the shits\nI don't know what they off\nClosing out some deals, know I'm fortunate, about to make a pay off\nFishing, you just never catch it, they just rip the bait off\nShow the most love, go and get your hate off\nMotherfucking Adolf\nYou about to fade off\nThis is not a hobby, this my job, what I'm paid off\n10 Ms for 10 thousand hours was the trade off\nThey recognize the swag, then they go and rip it straight off\nNick K ripped John Travolta's face off\nShe undressed, I be certified finessing\nBut hoes be like busses, you miss one, then you go and catch the next one\nA hero in the bay, I feel like Stephen\nA legend, the best one\nThe check came, that's red rum\nThat's Red rum\n\n[Outro]\nYeah, haha\n[?]\nYou Know\nSmashe dit Baby\nYoung T=Gerald\nTim WestWood\nCenter of the universe\nRest in Peace 2Pac, and rest in peace Mac Dre\nHappy Birthday Dre"}]}