{"songs": [{"year": null, "image": "https://images.genius.com/343c2c53c7b1f818cf50919e00643c0a.428x428x1.jpg", "title": "Over Here Hustlin’", "album": null, "lyrics": "(Chorus:)\nWe over here hustlin', we over here grindin'\nWe over here hustlin', we over here grindin'\nWe over here hustlin', we over here grindin'\nI'm all, I'm all about my paper, I'm all, I'm all about my paper\nWe over here hustlin', we over here grindin'\nWe over here hustlin', we over here\nWe over here hustlin', we over here grindin'\nI'm all, I'm all about my paper, I'm all, I'm all about my paper\n\n(Lil Wayne:)\nNow ho don't ask me what I'm doing, thats me in the hook\nAnd I just keep on getting it getting it like a ni' in the book\nYes, wayne straight like a key of that good sh'\nIf your bitch don't know the rules, I will read her the book\nI got the key to the boat, I got the key to the jet\nI got the key to success, get money invest\nRead up with the rest. I got a Swedish connect\nThat means my weed is the best, yoke to even the stress\nOK, the coupe is ridiculous and the jeep is a mess\nThat's called my bullets and lugers, I put 'em deep in your neck\nAdam's apple meet banana clip\nYou know my script, I just get my chips and then I dip, and then I dip\nThey say the bullshit walks, the money talks\nSo I don't answer, I don't answer unless the money calls\nYeah that's my word, thats my word know I will front for y'all\nIts money over everything and bitches under all. M.O.B!\n\n(Chorus)\n(Birdman:)\nI say uptown cobblin', uptown rockin', uptown niggas\nIt's the home of the hard knocks\nCook up a whole block. Hit it up in all white\nRidin' with a chopper, black diamonds and it all nice\nShop 'till you pop bitch, do your own thing ho\nGot the game from Pixie's, second floor sixth court\nBling bling king nigga, money ain't a thing nigga\nRidin' in a Lamborghini, suicidal regal wings\nAssault rifles, my little homies big poppers\nComing through the attic, 20 in the heli-chopper\nZip it and whip it nigga, that's how we ship it, nigga\nBurn it and light it then we flip it and we hit it, nigga\nI spent a mill on my grill for real\n'Cause we be stunting while we hustling, nigga making his meals\nWe be grindin' while we shinin', nigga packin' that steel\nStay fly, get money, nigga stackin' the bills\n\n(Chorus)\n(Birdman:)\nI say, we deep in the game, nigga. we switching the lanes, nigga\nGot blood money homie. No pain, no gain, nigga\nFifty a fame nigga, a G a name, nigga\nThat's what we do nigga, claim your fame, nigga\nHop out a range, nigga. Fang in hand, nigga\nStop all that reppin', 'fore I... send some flames, nigga\nAll this money, nigga. Jewelry and fame, nigga\n'Cause we be stuntin', nigga. Moving them things, nigga\n\n(Lil Wayne:)\nPaper paper, paper. All I need is paper. Green paper\nWhite chalk, yellow tape will, make your shirt look like you got on the butcher's aprin\nGo ahead and make the steak then, bitch nigga\nBitch, nigga talkin'. This is how money sound\nI'm just chillin' but my money still running 'round\nYeah, and I just do's what I does\nYou niggas couldn't even be who I was"}], "artist": "Birdman"}