{"artist": "Isaiah Rashad", "songs": [{"title": "Heavenly Father", "lyrics": "[Verse 1: Isaiah Rashad]\nYeah\nNow, everybody tellin' me a lie\nLordy, give me somethin' for my soul\nSee, I don't wanna think of suicide\nSo please don't take the lock key off my door\nSee, I've been tired of fuckin' all these girls\nAnd I've been tired of spendin' all my dough\nAnd if I give my story to the world\nI wonder if they'd book me for a show\nSee you can't handle pressure on your own\nSo why you carry boulder by yourself?\nThe story’s storyteller tell it wrong\nAnd glorify the horror and the wealth\nMy mama call me, tell me coming home\nAnd I just need some guidance in my steps\nI know I'm not the only one alone\nI know I'm not the only one that felt\n\n[Chorus: SZA]\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\n\n[Verse 2: Isaiah Rashad]\nLook\nNow, I'm prayin' that I make it 25\nThey be callin' doctor for my health\nAnd \"no\" is kinda hard to say to drugs\n'Cause I been havin' problems with myself\nAnd I been askin' questions, where the love?\nAnd they don't give me answers, just a check\nAnd they don't know my issues as a child\n'Cause I was busy cuttin' on myself\nAnd hangin' from the playground wasn't wrong\nUntil you got a rope around your neck\nAnd I been losin' more than just my mind\nGatherin' what's left of self-respect\nAnd Daddy, why you call me while you're drunk?\nAnd why you never love me when I need it?\nAnd I don't wanna be like you no more\nAnd I been tryna cope, I'm getting weeded\n\n[Chorus: SZA]\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\n\n[Verse 3: Isaiah Rashad]\nHere, look, ayy\nI smoke too much: the problems of a 20-somethin'\nI drink too often, there's liquor pourin' from the faucet\nYou would assume from following the tunes\nThat I'm doomed to die young, addicted to dry plum\nThese bitches ain't shit, and pussy is my greatest vice\nI love smokin' weed, I hate advice\nI know some niggas that talk good, the wise men\nFrom a long line of bitch-made and brides-men\nYou never had nuttin' but fuckin' dreams\nYou just caught up in the hype, the fashion and so it seems\nThe limelight, I know that I rhyme tight\nNo need for your two cents and burnin' your blueprints\nThese people think I really give a fuck about the shit they give a fuck about\nJust need a moment of silence, just close your fuckin' mouth\nInfatuated with violence, gun in my fuckin' mouth\nSo you don't know that I'm serious, know what I'm talkin' 'bout?\nLike you got punchlines for days\nSo generic your flow, you're too cold, you're aged\nAnd you got punch lines for days\nSo generic your flow, you're too cold, you're aged\nYeah, and I'm so misrepresented\nBy niggas that claim trill and they souls was never in it, like\nAnd I'm so misrepresented\nBy niggas that claim trill, they souls was never in it, like...\n\n[Produced by D. Sanders]\n[Directed by Eric Swiz]", "image": "https://images.genius.com/88da1904fb461fae943c2c34f20bda85.600x600x1.jpg", "album": "Cilvia Demo", "year": "2014-01-28"}]}