{"artist": "Boogie", "songs": [{"album": "Everything’s for Sale", "title": "Tired/Reflections", "year": "2019-01-25", "lyrics": "[Part I: \"Tired\"]\n\n[Intro]\nI'm tired of that shit, nigga, shut up\nNiggas ain't tryna hear none of that conscious shit fuck you talkin' 'bout?\nNiggas tryin to get faded, get high\nYo, yo\n\n[Verse 1]\nThey like \"Nigga, we tired of hearin' you pour\nOut your heart about how you in the struggle and how you at war\nWith yourself and how you not confident and you insecure\nNiggas tired of that shit, don't wanna hear that story no more, I'm tired\nNigga, ain't you tired of telling it?\nAin't you tired of not being relevant?\nAin't you tired of talking 'bout your ex and your relative, and diggin' up skeletons?\nAin't you fucking tired?\" Nigga, shut up\nYou're right, I am fucking tired of... I'm tired...\nI'm tired of working at myself, I wanna be perfect already\nI'm tired of the dating process, I wanna know what's certain already\nI'm tired of questioning if God real, I wanna get murdered already\n*Gunshot*\n\n[Interlude]\nThe police are arriving on the scene\nNo one knows what's happened yet\nUh, we're waiting for...\nWe're on Rosecrans and Stanford\nI see a gentleman here\nSir, can we inter... Sir, can we interview you, sir?\n\n[Part II: \"Reflections\"]\n\n[Chorus]\nCome and save me, I feel threatened\nThink I ran into a dead end, uh\nAin't no point in using weapons, no\nI'm at war with my reflection, uh\n\n[Verse 2]\nI want fame, well, I can't take L's\nI can't stay still, but I can't pay bills\nIt hard to feel shit when you livin' off pain pills\nHard to put on war boots when you walkin' on eggshells\nDon't let no nigga tell you that you slept on\nYou better take the blame that you progressed wrong and then got stepped on, uh\nThe text's long but I ain't replying for weeks, uh\nI got my peace for a positivity breach\nThis my second stage, this my metaphase, whoa\nThis the leverage change, ain't no retrograde, uh\nAin't seen Heaven's gates but I got hella plates, whoa\nSee this a deadly game, and I need better aim\n\n[Chorus]\nCome and help me, I feel threatened\nThink I ran into a dead end\nAin't no point in using weapons, no no\n'Cause I'm at war with my reflection, no no\nCome and save me, I feel threatened\nThink I ran into a dead end\nAin't no point in using weapons\n'Cause I'm at war with my reflection, yo yo\n\n[Verse 3]\nUh, 5 AM, I got no rest on you niggas\nMy morning flow'll be the death of you niggas\nAt this point, my reflection could get it\nMy homies, the jury, the honor, my label\nMy shawty, my baby, my mama\nThis for the fences I'm hoppin'\nSo don't be shocked when all your plans are negated\nShout out Jhene, she rub my back and then she say I'm the greatest\nSay perspective's 'bout the angle that you lookin' from\nInvesting in protection at your chest before the bullets come\nHow I'm 'posed to look to stunt when I don't feel my growth nearin'?\nWhat's harder, missing cosigns or being co-parents?\nTreat your heart just like a treasure, let no ho near it\nAddress the fact you the suppression of your own spirit, oh shit, uh\nMy clothes tearing and I'm scarred up\nAin't sparred much, it's better living with your guard up, fuck\nHow many girls did I just call up?\nI'm mixin' liquor in my Starbucks, fuck\nI'm the one in front the gun and the one behind the trigger\nI been hidin' from my truths, they will never find a nigga\nIf they ever find a nigga, I identify the killer\nI'ma be the only witness, it's that pussy in the mirror\n\n[Chorus]\nCome and help me, I feel threatened\nThink I ran into a dead end\nAin't no point in using weapons, no\nI'm at war with my reflection, uh\n\n[Outro]\nNiggas ain't shit, these niggas ain't shit, hahaha, niggas ain't shit\nThat's supposed to be about me or something?\nWhat you mean? That's my shit, that's my song, you know? Niggas ain't shit\nPass me the aux cord\nI'm not passing you no damn aux cord\nThis my car, this my car", "image": "https://images.genius.com/3e057bea64f27f9ecfbe001b0cf96345.1000x1000x1.jpg"}]}