{"songs": [{"year": "2003-12-05", "album": "Tasty", "image": "https://images.genius.com/6662969f3c6226dff67b557ce9e5c555.1000x1000x1.jpg", "title": "In Public", "lyrics": "[Kelis (Nas)]\n\nYou see, it's this thing (Kelis)\nI like being single (ha ha)\nOutside....in my mind (Get +Tasty+)\nI liked the way we were (Cookies - +Tasty+)\n(+Tasty+, yeah, let's go)\n\n[verse 1 - Kelis]\n\nHe was next to me (come closer)\nOur flight was s'posed to leave around 2:53\nAll I wanted to see\nIs what would he do if I dropped down to my knees\nI wanna play a game\nIf someone come in, it don't matter, just the same (I like it)\nTry something fun with me\nLet's take our clothes off all over the balcony\n\n[Hook - Kelis (Nas)]\n\nLet's get it on In Public\nJust let it go, I promise that you'll love it\nOh Daddy, don't you wanna be my soldier? (yeah)\nOoo-oooh, let's get it on In Public, oooh\n\n[Verse 2 - Kelis]\n\nDon't try to run from me\nI'll make your toes curl up and make your body scream\nCome take a walk with me\nWe can do it over there by all the trees\nDrive this car real fast\nI'll lay my head and I'll make your body blast\nOww!\n\n[Hook]\n\n[Kelis] (Nas)\n\nLet's make a movie baby (Sit over there)\nCan we get away with it? (Open your legs)\nI'll be an animal (yeah)\nAll lights on (I wanna see you)\nI like it when we do it to this song (You like that)\n\nLet's make a movie baby\nCan we get away with it? (I'll be directing, heh)\nSo nasty\nAll lights on (I like to see)\nI like it when we do it to this song (Yeah, yeah yeah)\nYeah? Talk to me\n\n[Verse 3 - Nas (Kelis)]\n\nThe pussy or the mouth? That is the question (Okay) like Shakespeare\nBut my erection is the case here (yeah)\nI ain't got time to drive you all the way home\nBut instead I can slide you to a club bathroom (Okay)\nOr a restaurant's men's room\nThen I can zoom in your womb\nWe both get what we want (Okay), then we can assume\nTo doing what we was, smokin' that bud and chillin'\nBut first I got it up, before anything, you willing?\nTo win it, it's animal behaviour\nLa chic, la freak-out, with a sexy beast ma (yeah?), who slays ya\nThis is for the mature who love the natural love-\n-making outdoors on the hood of your car (Ohh, yeah)\nNas is good at it all when it comes to givin' it ?war?\nDo I have to convince you now?\nWe don't need hotel keys\nWe jump in the trunk and stain everything upside ya G-string\n\n[Hook] *with Nas ad-libs*\nRepeat 2x\n\n[Nas (Kelis)]\n\n*Kelis moans*\nSo nasty, girl\nIf they gon' see us, cool, they gon' see us (haha)\nI think they seen us, hahahaha\nKelis, sexy beast (yeah)\nYeah, Nasty Nas (that's my boy)\nYeah, uh, outside, in my ride, ha\nLet's ride, ma\nYeah, let's go"}], "artist": "Kelis"}