{"songs": [{"album": "Celcius", "image": "https://images.genius.com/44b96a02c4ad68840aa7a37b7345ba30.1000x1000x1.jpg", "year": null, "title": "Call Girlz", "lyrics": "[Intro: Tech N9ne]\nHey what's up, girl? It's Tech N9na\nHi\nWhat the deal, baby?\nNothing, what's up\nJust chillin with my niggas, you know what I'm saying?\nMe and Don Juan coming out tomorrow\nYou know what I'm saying, on my way to LA\nYou down to kick it?\nOh yeah defenetly\nY\nOu got your homegirl?\nAre they down?\nSure\nTaking questions?\nYou know it\nCaribou Lu?\nYou bet\nIt's on there, right?\nYeah\n\n[Verse 1: Don Juan]\n4 days chillin with some bitches\nOn the way to Cali, tryna maintaine our music and riches\nWe doing what counts, make her switch to the other side\nGet 'm all out they clothes, can I go inside?\nThey feel the vibe, they sure to get wet\nRubbers [?]\nMy nigga Tech, get them hoes, nigga\nGet that trick\n\n[Verse 2: Tech N9ne]\nMy nigga Don Juan, I got that bitch\nOpisit of a hosewife\nCool, jump in the pool, and the dick grabbing\nShe was screaming that it cost 600 to hit\nImma give it to you for free cause I like your shit\nI do it so well, she tellin me tails about her caucasian tricks, rubber strap on shit\nAnd when I'm laughin about how the homegirls making her grip\nShe started inching closer, suckin dick\n\n[Verse 3: Don Juan]\nSo many hoes know about the house 3000\n616 ways that we can all fuck\nWe Rode Dogs, so it's 57\nLust or bust, we just body full of lust\nSo baby, tell me what's up\n\n[Chorus: ?]\nCall girls, and we fuck for days\nI'm about the cash, just to get y'all payed\nTech A N9na and Juan, cause y'all the shit\nDon't stop, nigga please, cause we want some dick\n\n[Verse 4: Don Juan]\nShe wants my money, but it's far from prostitution\nMaking it simple in plan, pussy for distrubition\nFound the salution\nWhile you niggas be losin\nWhile we're cruisin\nGrab my stick, now won't you suck my dick?\nSo many licks, she be survin me like a ccustomer\nRiding down the highway, commence fucking her\nWhile you lovin her, I'm pluggin her\nYou buggin her\nWhy don't you quit? I'm here to tell you that your hoe ain't shit\n\n[Verse 5: Tech N9ne]\nDo your friends wanna extend the vegin to Tech Nin the nappy haired friend grin cummer?\nWith perfect dick, I perfect chicks within summer\nStinging them like a bee\n[?]\nThrowin bolos in the bed, hope it goes in the head\nLow go in the bread\nMo doe, bro, get ahead\nThey don't wanna let go, they know the reason we met, so\nThey can be some ballers instead of a prospect hoe\n\n[Chorus: ?]\nCall girls, and we fuck for days\nI'm about the cash, just to get y'all payed\nTech A N9na and Juan, cause y'all the shit\nDon't stop, nigga please, cause we want some dick"}], "artist": "Tech N9ne"}