{"artist": "Wiley", "songs": [{"year": null, "lyrics": "[Intro]\nYep, yep, yep\nIt's Eskiboy (It's Eskiboy)\nCrossfire Volume 1, nothing long\nThere's not a thing right now\nBig up all the Roll Deep family\nI wanna big up the West London massive, North London massive, South London massive, East London massive\nYou know them way there? (You know them way there)\nAlright, listen\nEskiboy (Eski)\nIt's Eskiboy (Eski)\nAlright then\nEskiboy (Eski)\nBoy, boy, boy (Eski, Eski, Eski)\nIt's Eskiboy\nYeah\nYou know me\n\n[Verse]\nLet me teach him a lesson\nI'll swing with the playground bully any day\nAnd I will never stop repping\nHello, you know me I've got the krep in\nI'm safe, I'll battle with anyone who's testing\nFriend or foe, step in the ring, I will win\nI'ma best it from above, is there anyone ready?\nBecause I've been checking\nAnd you seem to want my title but it's hard to get it\nAnd we can spit together, I'm not pety\nAnd you couldn't beat me if you change your settings\nDon't think that I'll ever be the one fretting\nI'm a bad boy, big up from me, you're not getting\nDon't worry every three months I'll be checking\nAlso I gotta get a six figure cheque in\nI'll draw your wifey up, she's at the check in\nIt couldn't be Wiley, you're testing\nBlud, I don't need him pressing\nBecause pressing me is a mission\nIf it's dissing, I'm winning\nYou're on, and keep wishing\nI've written so many lyrics for years\nI've been bitten\nWhen I remix bars be happy that I listen\nDon't get jealous in [?]\nStart spitting with badman\nNobody cares who you are\nDon't beef life with me\nBe sad, because I'll up your game\nAnd you'll be pressured that you never had\nI'm one of the pioneers of my scene\nPussy holes can't stop me and my scene\nNot Radio One, or Choice or\nKiss or 1Xtra can chat shit in my scene\nWiley won't turn up\nWiley don't turn up\nI'll burn energy in everyday in my scene\nSo what? I don't kiss arse in 1Xtra\nThey wanna act like I don't rep for the scene\nI'm so powerful, the scene reps me\nAnd I'll be damned if I let you get big off my team\nFive years back you didn't like this scene\nBut it's worth money now so you're breading this scene\nSee what I mean?\nI help everyone but they don't wanna help me\nFuck Westwood too, because he ain't done shit in my scene\nHe thinks Pow is the start of my scene\nOi, differently, what's all the big talking?\nBecause of this war, you got yourself caught in\nI'm not Z from City of God\nBut you see me in the ends with Jesus walking\nWar is a minor, soldiers do war and\nFight for a cause, I rise like a machine and\nFollow my dream then when I make P's and\nI here to straps off G's then\nYou've been slewing Wiley since you land road\nWhat for?\nTo be honest blud, I don't know\nBecause I never ever heard of Ghetto\nWhenever time on road, I'm on a ship, from Kane flow\nCouldn't be a banger and until you got a reload\nNow you think that you're hot on the roads\nAnd I don't care if I got bored on the road\nI'm always outnumbered, lord on the roads\nI can swear revenge, I'm angry for nothing\nKano's a star, and your trio stop bluffing\nCan't make a move til he makes a move\nYou ask Switcher for help, but he's not rushing\nDemon wants help too, Richard's got a tree\nAll three of you the same but\nWho is the special one? Kane\nYeah, it's a pain in the neck\nBut the pace is already been set, no\nI don't forget from day\nI was here to collect cheques\nSo keep saying my name, keep me in check\nAnd you weren't a gangster\nThe last time I checked, the last set we done\nYou was lucky, you didn't my full clip of lyrics\nI've allowed you on the set\nBut now, I'm Rowdy, I would out you on set\nIt's not about me blud, it's about me on the set\nWhat are you gonna do? I proved that I'm a vet\nIt's bait\nI know what I'm doing when I'm here\nBut I can't stop you from brewing when I'm here\nYou don't bring two in, and you will stop slewing\nAnd before me, I'm trained for the war when I'm here\nWho cares? You care\nI don't care when I'm here\nSquabbling, I've already been there, now I'm here\nWhen I'm here, war is declared\nI will be prepared\nI'm grizzly like bear\nPlus, I got more than the palace pavilion\nBut I'm still a bad boy, from the Caribbean\nYou think you're straight up brilliant?\nI will come through, I will show who I really am\nYou can never kick ball like a Brazilian\nI'm a top boy, never going down hilly and\nWilliam, William, William, William\nFive years, gonna love past half a million\n[Sham] you're the one who got smacked in a grilly and\nMine, know my name, that's William\nWe know you ain't got skilly and\nAin't gonna make a million\nFlying, headbutt and still-ion\nI remain calm, I'm still standing, William\nIt gets bare man, I'ma dance, still living\nWatch this year, I'm down two million\nIt's gonna be 3-2 when I'm finishing\nYou know Revenge is sweet and\n[Spider] will never see zillions, let alone William\nSpent a few years in my life in Chatham near Gillingham\nBack to London, I'm killing them\nLethal's got a 4-5 stillion\nMan run up in his yard, mumzy chilling him\nPow, it's all getting silly and\nWhat's my name? Oh that's William\nI'm worth a million\nYeah I'm a tower block boy\nI hit power shots, boy\nAnd pow, I don't bread Fire boys\nWiley's a power boy\nTake out crews by the hour\nLife ain't sweet, it's sour\nAnd if you ain't hear, I ain't Lethal the Bizzle\nI'm not looking for power\nI'm looking for the shower, boy\nWho's Fire Camp? I know More Fire\nSeven eleven and still no pow, boy\nSay pow, I can see badman\nYeah, everyone's flowing like the rivers in [?]\nOzzie B waste, sky lyrics, stay a waste [?]\nTell 2Face, Willy's got skanks and\nWhen I see gash in the way, he might skank\nAnd exchange their numbers on the dance floors\nI like big tits and bumpers\n2Face, your mum, she's looking for a toy, boy\nI'm want her crumpets\nYou ready for the rumpus?\nSkirts and shirts and jumpers\nGo fly and when I'm on campus\nThem soundboys, they're pampers\nThey're pranksters\nSilly Willy is still million\nLethal's a wankster\nWatch if he test me\nYou will get the shock of your life when I turn around and shank ya\nYou don't know me\nBack in the day I went college in the day with Gus [Mark Francis?]  and [Shankar]", "image": "https://images.genius.com/64dbc17a69b2b5d6e4be224080306dcb.700x700x1.jpg", "album": "Tunnel Vision Volume 5", "title": "Crossfire Snippet"}]}