{"songs": [{"image": "https://images.genius.com/525e27af60607cbf0361d3a6ea8e94a6.300x300x1.jpg", "title": "Fucc Um", "album": null, "year": "2016-09-12", "lyrics": "[Verse 1: Nipsey Hussle]\nYeah, we know you used to put in work that's old\nNigga and we seen your paperwork you told\nAll these niggas either sniffing glass or they living off the past\nWhen i'm blowing money fast with my bros\nLately I been seeing niggas sell they soul\nHow you catch a case and bail out on parole?\nI've been state to state getting money on the road\nHad to reevaluate who I could to talk to on the phone\nSwitch it up, spit the game pay attention, you should listen up\nFollow code and one day you 'gon get as rich as us\nSeven digit, street nigga that ain't rich enough\nForty million on the crib like that nigga Puff\nNiggas buying yachts, niggas buying jets, that make me wanna buy the block just to reinvest\nHelp my young niggas catch it before it's nothing left\n\n[Hook]\nBaby me the realest ever did it yeah\nHopefully my day ones will remember this\nKeep that shit a hundred one until the death\nEven when i'm gone they'll say I never left\nLookin' at the roof like i'm glad I never quit\nThat's my niggas women though we'd never hit\nSticking to the script get rich and never switch\nAll my role models doing sentences, yeah\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\n\n[Verse 2: Freeway]\nFuck each and every one of them\nI fear none of them\nFrank Lucas push his roof back in front of him\nLeave a nigga toothless when it comes to the loot\nI go stupid with the butt of the gun, know where i'm coming from?\nNorth Philly where Fraizer and Muhammad sparred\nLast named Ahkbar they calling all cop cars\nWhen they pull you over, they might shoot you over moving\nNow that we Truman they know who we are\nThey took a king from us, they X'd Malcolm out\nYou kidding me? I did my own black history\nStudied Illmatic, Reasonable Doubt that's the main reason why these rappers can't get with me\nFuck em all, I hear the whistle know it's time to ball\nY'all niggas throwing fouls but y'all don't wanna brawl\nHow you going on a mission with no vision? Fuck Stevies like a sight look at Stevie's ambition, we hood niggas that get it\n\n[Hook]\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\n\n[Verse 3: Cuzzy Capone]\nDifferent nigga now that my pop's gone\nLow tolerance promise you'd get popped on\nMicrowave the bullets sounding like popcorn\nGrind heavy the cops come or the rocks gone\nSame nigga, so what? The time's changed\nWhen I couldn't get money I used to find ways\nCounting thousands off the cavi in the hallway\nIt wasn't long before I figured out crime pays\nWe still in search of them bright days\nDark streets, only light when police raid\nWhere niggas stress out and let that shots off\nLos Scan, like a skillet it'll pop off\nI hit the ave and posted with the uncut raw\nSacked it up and told niggas I had the cake moss\nNothing fancy, protect myself with the eight ball\nIt wasn't easy I had to hustle on Hyde Park\n\n[Hook]\nBaby me the realest ever did it yeah\nHopefully my day ones will remember this\nKeep that shit a hundred one until the death\nEven when i'm gone they'll say I never left\nLookin' at the roof like i'm glad I never quit\nThat's my niggas women though we'd never hit\nSticking to the script get rich and never switch\nAll my role models doing sentences, yeah\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all\nFuck em all"}], "artist": "Nipsey Hussle"}