{"songs": [{"lyrics": "[Intro]\nIt goes welcome the pop off, some pop soft\nWe bang b-bang b-bang bang out loud\nReady on the left with a face full of death\nWe slanged out fang mouth bang out now\n\n[Verse 1]\nThis is a never dug disco\nZoo York tycoon, memorandum bonanza banter clamp crunk out the fish bowl\nGorgeous how struggling gills wriggle out water, ain't it?\nSame scape as the walls crawling with paranoia's plaintiffs\nThe robo-komodo promo Zen patience a-alike to this jittery drooling mess\nBitterly unruly on mud hugger alert, he usher dirt to the kick circus\nDeflected labor ethic questions peeled at the field workers\n(Is it raw?) Please... does a priest need a ten-foot pole to baptize little Linus minus the lap ride and tease?\nEvolution is a leader depleter\nSeeker needy sheep idol feeder beware, once complete you might not want to be there\nDead straw to gold bar spin fiber\nLost and found in a smitten kitten's incisors\nThey Aphrodite all over the burgle of a purple heart compartment\nMarched a burgundy carpet alarmed and far to parched to bark it\nLil' Abner, a real firecracker\nGrows to throw 'bows with vehicular hijackers\nTo eavesdrop plots cops hired a wire tapper\nThat's a whipper snapper trapped beneath my grip on the fire ladder\nTook drums over to deril' to once over the line tones punch toothy ticks\n'til they find homes like three ruby clicks\nThe roof is on fire where snoopy sits right now\nYou should have shot yourself in the foot when it was in your mouth\n\n[Hook]\nThieves in the strobe deep freeze your pose\nFor the disease that grows underneath your toes\nHolds up a reason y'alls gold never seems to glow\nNow we can all breath slow once the fiend's exposed\nIt goes heave ho. You never got the grit right. Bark fame but you never put the grit down\nHawk styles but you never got the grit right. Put the grit down. Grit right. Get down\n\n[Verse 2]\nThis is a never dug disco defamation of dog and pony grappled out chincey\nChipping Leo Da Vinci\nPhonies pushing kill of hill bloated. Nobody got you\nWhile biggest brother's watching bigger brother watching big brother watch you\nNothing says circus fun quite like nuclear holocaust over breakfast on the terrace. Hash browns and peril\nOld ironsides or good ship lolli-popper\nDavy Jones still got a locker, ak\nThe opera's more than docs and soccer moms\nNow before you kick your feet up\nI married and divorced mother nature after sweet-talking that old hag out of a pre-nup\nThis information's neither braggadocio nor secret\nJust know as of now the world is technically not yours, peanut\nIt's a day in the life of the carnie dog-faced boy escapist\nLiving large, watching Springer, smoking beedies wrapped in bacon\nAt night his get busy disease leakage peaketh\nMerk the he say/she say, BK Jesus turn peg legs to Adidas on the down stroke\nAnd they like 'what's up with the name?'\nI tell'em y'all made Bazooka Tooth I's about to ask the same\nBut before you curfew the city and shut down every block, I'd like to say I still Aesop the fuck out of the Rock\n\n[Hook]\n\n[Verse 3]\nThis is a never dug disco. Spread feelers. Tonka zonk Gepetto bred beezers\nJeepers, gee wilikers, goshes galoshes, Christ, god almighty\nThey tore his limbs off kilter, still the hostage moshes slightly\nHung off the balcony by the skin off his doctor's psyche\nHe hopes it holds but knows the locusts kamikaze nightly\nHe woke, promoted bug-eat-face, insect chopper's biting\nHe's only bones by the time the ungodly body's sighted\nHe saw the puddle, full color hideous monster Viking\nHe used to survey if the vermin dined on others like him\nHe found the fucks indigenous to him and awfully feisty\nHe grew old awkward grinch and settled into bonkers nicely\nI alert vital spider works to cultivate grit, ship the bulk grade shit\nHerbie the love bug drugs pulsate whips\nTie in spite for commoner idiocy and good old-fashioned biblical plague\nWe move units off your pagan escapade\nAnd it's pits to the peg legged\nMake us eclipse cripple, so that pimp's limp, wheel chair basket bow when 15 minutes fizzles\nYour flimsy frame marks hip-hop's second most tragic event\nAnd will 'til Jam Master Jay's resurrection and second death\n\n[Hook]", "title": "Freeze/Honeycomb Interlude", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}