{"songs": [{"title": "Love Drugs and Sex", "album": "Hoodie SZN", "year": "2018-12-21", "image": "https://images.genius.com/557f4ca436aaabc4210bd3850f96b954.1000x1000x1.jpg", "lyrics": "[Verse 1]\nTell me why the fuck you mad though? (Mad though)\nI ain't that used to getting mad dough (Mad dough)\nI dropped forty pointers on your ass, ho (Ass, ho)\nForty pointers on your ho-ass (Mmh)\nHow was I suppose to know that (Know that)\nMoney make you bitches go bad (Go bad)\nRun it up and never go back (Go back)\nRun it up and never go back (Go back)\nW's up and you know that (Yeah)\n'Member makin' tracks with Kodak\nThen we fell a little off-track\nI'm a street nigga way before rap\nI ain't been the type to name drop\nBut it's some shit that I can't hold back\nI heard a nigga from the same block\nIs telling on me, I expose rats\nLook I don't really want no beef with no niggas\nI don't want no enemies or no niggas\nThe feds is coming, and they sweepin' on niggas\nThey gained like seven, took like three of my niggas\nAin't no static, it's just defense on niggas\nGo black on black, go Hoodie SZN on niggas\nPlaques on plaques, I got thirteen of them, nigga\nOne day I wanna be a king like I'm Jigga\n\n[Chorus]\nBut I ain't ready for no love yet\nAll I ever want is drug sex\nI'm used to being in the projects\nMama saying I was up next\nLearnin' how to fucking rob, yeah\nI didn't even touch a gun yet\nMost the niggas I grew up with\nAre sitting up, or either gone, yeah\n\n[Verse 2]\nGone, yeah\nWhen I'm right, I think I'm wrong, yeah\nThis is just where I belong, yeah\nI'm so used to having fun (Yeah)\nI go straight from the Ave to in the club\nCatch me right in the back\nCameras on me, they be all on my ass\nBut Sal in front of me to cover the gas\nBut don't get too gassed, my life is too fast\nBitches tellin' me to follow them back\nAdderall, at least it's better than Xans\nPop a Perc and fuck for hours again\n'Cause I don't want no fuckin' love sex\nAll I want from you is drug sex\nShit you wouldn't do in public\nYou say you ain't the type to suck dick\nYou never finished, it was perfect\nYour natural titties and your curves, yeah\nI make you feel like it was worth it\nI can buy you all the Birkins\n\n[Chorus]\nBut what's next?\nI don't want no fuckin' love sex\nAll I want from you is drug sex\nI don't wanna make you up'\nI don't wanna see you upset\nAll I want from you is drug sex\nBut your love is like a drug, yeah\nI can never get enough\n\n[Outro]\nFuck love sex\nCan we have drug sex?\nFuck love sex, can we have drug sex?\nFuck love sex, can we have drug, drug, drug, drug"}], "artist": "A Boogie Wit da Hoodie"}