{"artist": "Cam’ron", "songs": [{"title": "Hate Me Now Freestyle", "album": null, "year": "2002-01-01", "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Intro: Jim Jones + Cam'Ron]\nI heard niggas talkin' reckless\nMan, y'all talkin' out the side of your mouth, nigga\nY'all niggas is faggots, straight pussy\nWord to my mother, I'll put my foot in your ass, nigga\nNo homo, nigga, what's really good?\nJim Jones, Jim, Capo status, East side, fool\nDipset riders, nigga, when we catch you, we gon' slap that Kufi straight off your mothafuckin' head\nAny other problems, nigga? You know Harlem gon' ride out, nigga\nHarlem, y'all act like I wasn't gon' stand up\nI wish you would, nigga\nIt's nothin'\nWhen the dogs catch you, it's over, you're straight food, nigga\nEverybody wanna be king of the city, right\nWhen I come, nigga, y'all niggas better be real calm, nigga\nIt's nothin', we just livin', millionaire status shorty\nWhen you fuckin' with the don, you fuckin' with the Jones, you heard, nigga?\nY'all with me? Harlem! Diplomats! Let's ride out\nIt's gangstas over here, Harlem hear me with you, Killa, east side\n\n[Cam'ron]\nAye yo, this lil’ nigga Nas think he live like me\nDrove 5’s, shot 5, flipped pies like me?\nNah, Cam gonna blast, I done ran through his past\nAnd I ran for the mag, Taliban on your ass!\nYou’re terry cloth, that means very soft\nThanks Jay, Carm’s the bomb, broke her cherry off!\nSeverely massacred, we really gonna laugh at ya\nThe MAC-Milli blast at ya, you really run to Africa\nStupid, sucker for love, home plenty\nNelson, Mandela, we all boned Winnie!\nShit, I come over and fight\nYou a lame, you forgot over the night\nYo, your career’s over like Mike\nAny one, Tyson, Jordan, Jackson\nAsk Dunn about my mean deals\nFrizzle steam, triple beam, cripple teams\nWhen you seen money in Queensbridge? Never\nI used to catch the tunnel\nLil E, Vernon side, I gave him packs and bundles\nHow many grams in an ounce?\nHow many ounces in an eighth\nHow many eighths in a key\nShorty, stay in your place\nBefore the AK’s in your face\nTake your daughter, R Kelly, have my way with her face!\nAnd your mom’s a whip wop head\nAnd you claim to be a hip-hop head?\nOoh wop, two shots in his hip-hop head\nThis way the whole world know that hip-hop’s dead! Killa!\nRoc-A-Fella, hip-hop bread\n50 thou' a night, holla back, hit my spread\nYou wack, you twisted, your girl's a ho\nYou’re broke, the kid ain’t yours and everybody know\nYour mans even tell you, you be like, “So?\nI love my baby mother, I never let her go”\nStupid…\n\n[Outro: Jim Jones]\nThat's right, nigga, we gon' get our spread, nigga\nThat's a dumb percent of that for me, nigga\nSo you know I'm ridin' for that, nigga\nCountry bum ass fuck, don't even know how to rock rocks\nI caught you with them two rocks on your wrist, nigga\nNext time it's gon' be killin', nigga\nTrust me, man, I'ma clap you in flowers, you faggot\nYou ain't even relyin' on your own hood, nigga\nYou know where we at, nigga!\n140th and Lenox, 15th and 7th, nigga\nAll our jewels, nigga, trust me, man, we glitterin'\nFaggot, you punk, you fuckin' pussy hermaphrodite\nStraight homo, pussy ass nigga with a dick, nigga\nYou got meek, nigga, word to\nMan got me so mothafuckin' hot, nigga, I'm just gon' calm down, man\nYo Killa, fall back on these chumps and let's explain to them a few things they need to learn better, nigga\nHolla, east side the gangstas for sure"}]}