{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Dead Man’s Shoes", "image": "https://images.genius.com/937a22b3dfa62548d1013d052f733535.1000x1000x1.png", "lyrics": "[Verse 1: Professor Green]\nI want me a Vegas girl\nI don't like the song but I'd love me a Vegas girl\nHow do I have the audacity to say this?\nI'm a little bit of a sadist, girl\nI say this, I say that\nWhatever I say, I never take back\nI've got no respect\nAsk Dream Mclean and his enormous head\nI ain't got the heart to care\nAsk him how long he spends in the barbers' chair\nI wouldn't wanna be your barber\nPicture me on a sheep in a barber\nI'm Green like a frog and I ribbet\nNo, I've not lost it, I'm just being silly\nReally need an ump and I'm going on millie\nI don't mean I'm going on Millie\nHow much longer could he go?\nMy mind can only be described as unhealthy\nNo, I wasn't made in Chelsea\nI'm just living it up real tosh\n\n[Hook: James Craise]\nI wear them dead man's shoes\nI wear them dead man's shoes\nI wear them dead man's shoes\nI wear them dead man's shoes\n\n[Verse 2: Professor Green]\nI've had an idea, who knows how\nWe can raise the national IQ? I do\nTake every member of every reality TV show\nFor a little trip on a ship and then sink the boat\nThank God Millie quit the show, I'm unbiased\nIt's simple, Millie would've been on the ship too\nA prick to anybody and everybody\nThere ain't a woman alive that I wouldn't be a dick to\nBut you came into my life\nAnd now everything's so sweet\nI found my perfect match in a woman\nWho gives more hugs than me, Millie\nMe and my bird are barmy\nTwo peas in a pod, edamame\nCouldn't care less what the whole world thinks of me\nAs long as the in-laws think I'm charming, darling\n\n[Hook: James Craise]\n\n[Verse 3: Professor Green]\nIn a couple of years, I'll be speaking posh\n\"He ain't hood anymore, he's a tot\"\nPicture hearing me speaking in a posh accent\nLike \"come hither now, clean my cock\"?\n\"What did you say, young man?\"\n\"Is this the way young people behave nowadays, young man?\"\nThat was when she hit me with her walking stick and said\n\"That ought to teach you for talking shit\"\nI don't even know who she was, this is what the weed does\nMillie, I'm gonna be with you forever\nOnly till the day that we divorce and I get taken to the cleaners\nProbably for getting caught fondling the clean-er\nIt's never gonna happen!\nShe's 68!\nShe has had four children!\nIt would be like throwing a hotdog down a hallway!\n\n[Hook: James Craise]\n\n[Outro: Professor Green]\nI wear them, I wear them\nThem dead man's shoes, I wear them\nI wear them, I wear them\nThem dead man's shoes, I wear them\nDead man's shoes, I wear them\nDead man's shoes, I wear them\nI wear them, I wear them\nThem dead man's shoes, I wear them", "year": null}]}