{"artist": "9th Prince", "songs": [{"album": "Revenge of the 9th Prince", "lyrics": "[Intro: 9th Prince]\nI don't know what the fuck these niggas is thinking\nThe new and improved 9th Prince, fuck these niggas yo\nThe new and improved 9th Prince, it's on, eat a dick, nigga, word up\n\n[9th Prince]\nAiyo, I blast like a Beretta 9, climb the Billboard charts\nWith a bullet that rip through your heart and spine\nYou see I speak so divine, diamond Guess watch\nLeft the eye on the pyramid blind\nIt's the return of the killas, corporate Hitlers\nThe best rhyme spitter, better than Nas\nBetter than Jigga, no, not the RZA\nIt's the 9th Prince, lyrical silverback gorilla\nI was locked up in the mountains\nEveryday I was counting, free at last like Martin\nNiggas is UFO's, nice little reign\nClaiming he's a martian, I traveled far\nAn underground star, bulletproof convertible cars\nI done drove and crashed without a crash bar\nHopped out the 745, like I was live\nThe best of Killarm', fuck the talk is all jive\n\n[Chorus: 9th Prince]\nYo, who you know got flow just like this?\nWho you know pop champagne like this?\nWho you know came home from jail like this?\nTarget practice, ya'll all on my hitlist\nWho you know got flows just like this?\nWho you know spend money just like this?\nWho you know rock shows just like this?\nTarget practice, ya'll all on my hitlist?\n\n[9th Prince]\nNiggas is trapped in the darkness\nWhat I did to Holocaust was straight heartless\nThe 9th Prince is a beast, Wu-Tang Clan\nCan never be deceased, fuck Rosa Parks\nI would of shot a nigga from my seat\nNiggas say Madman, why you tripping? You the illest\nBust my gun with the realest\nSpit rapid fire, with a terrorist\nLay low, deep waters of the abyss\nRihanna blew me a kiss, I raise a black fist, drift off into the myst\nFBI most wanted list, let's clarify all the rumors\n9th Prince about to blow like a brain tumor\nIn the heads of the consumers, intruders\nInstigating contributors, 9th Prince is a sharpshooter\nWord up, that's how we do, yo\nThe 9th Prince and Killarm', yo\n\n[Chorus]\n\n[Outro: 9th Prince]\nWord up, what the fuck, what the fuck ya'll niggas wanna do son?\nYeah, we ain't playing, son, it's the 9th Prince, niggas\nYa'll muthafuckas get ready, man\nWord up, it's about to be on like popcorn, nigga\nFuck that, pop ya muthafucking piece, man\nIt's real right now, man, Killarmy, man '09, yo\nWe in the last days muthafucka, three thousand and eighty\nFour thousand out this muthafucka, right now, nigga\nIt's the 9th Prince niggas, fresh out of jail\nKillarmy, muthafucka\nShout out to my muthafucking Killarmy comrades\nKilla Sin, come home, son, rest in peace to ODB\nYa'll niggas don't respect this shit, man\nI ain't one of these niggas that keep my muthafucking mouth shut\nYo, tell 'em 9th, tell 'em, let them niggas know something right now, yo\nThe 9th Prince, Killarmy, yo, we taking over this muthafucking game\nWord up, man, we out of here, yo, one muthafucking love, niggas, peace", "year": null, "title": "Target Practice", "image": "https://images.genius.com/af61f0ef977c2f691226fe0ab315bfd9.500x500x1.jpg"}]}