{"artist": "Problem", "songs": [{"album": null, "title": "My Last Molly Song Ever I Promise", "image": "https://images.genius.com/c4005e254f231b7ae838ab00e001de5f.421x421x1.jpg", "lyrics": "Need one Need two I think I'mma need three (x3)\nI think I'mma need four I think I'mma need more\nAy Molly, where you at bitch? (x2)\nI'm right here daddy\nI'm right here daddy yeah I'm right here daddy (x3)\nSo come and grab me up so you can take me down\nTake me down, take me down, so come and grab me up so you can take me down (x2)\n\nGunplay: I'm feelin good bitch really really good bitch\nI sniff my molly cause I'm really really hood bitch\nI could change ya life ho I really really could bitch\nNow break bread like you really really should bitch\nBreak the bread break break the bread ho\nFucked her on the floor but I make her make the bed tho (x2)\nYou kno what I be on higher than a pigeon\nSo stacked back you might need a leg for three arms\nI got the mac I'm bout to get my delete on\nM. O. double hockey sticks Y what a sweetheart\n\nAyy Molly, where you at bitch? (x2)\nI'm right here daddy (Chorus)\n\nProblem: Come a lil closer lemme get a taste\nYeah its really working feel it in my face\nDrinkin liquor straight I don't need a chase\nI wanna fuck again we just need a place\nDon't matter what time it is one day I'mma die so I'm tryna live\nIn this very moment, very moment cause life is shorter than Gary Coleman\nSo when I swig I do it big like B-I-G I'm on my T-I-P she on my T-I-P all on my E-Y-E want me to B-U-S all on her T-I-T's for real\nOh I think I like that\nA couple of the home girls wanna meet her I'll be right back\nBaby if she pop it she'll be gone she'll have you in your drawers\nShe go both ways girl she down to fuck us all so whats up\n\n(Chorus)\n\nTrinidad James: This molly mary jane my nigga Problem Gunplay\nWhere that bitch that do that molly and that bitch to roll my weed\nDon't get no molly in my blunt but put this molly on your tongue\nWatch your eyes get wide and your tongue get numb\nOh Sweat dance turn up (x8)\nYeah I get her back to my room over pants get up soon\nPants off ass look look like a half of moon\nYeah miss lady thick, yeah miss lady thick\nBut if she ain't up on this dick, then where she at?\nI'm right here daddy", "year": null}]}