{"artist": "Fat Joe", "songs": [{"year": "2002-11-12", "album": "Loyalty", "image": "https://images.genius.com/334c85de50c53fc4f55c9f3af9218739.800x800x1.jpg", "lyrics": "(feat. Tony Sunshine)\n\nYeah. Uhh. Joe crack the don!\nTon' Sunshine. Terror, uhh\nTerror squad, its our time!\nUhh, yea, hand it ova\nUh, yo, uh-huh, what, yea, uh... woo\n\n[Verse 1]\nYea, mami jus like that bend down grab ya ankles, do it for crack\nDamn should be illegal how that ass so fat\nThe way you shake yo shit make me wanna cop back\nIs it ya motion causing all this commotion?\nForget niggas you even got bitches approaching\nWho am I? I'm just a kid from the Bronx\nIf you love hip-hop you might of heard my shit once\nOr maybe twice or like thirteen thousand times\nI'm sick of it myself I'm loving the shine\nWho else could it be but the squad's O.G?\nBe laid up Wit chicks that resemble  ?\nHalf black, Japanese n something\nMénages, orgies believe me its nothing\nThe girls want tha facts got to feed 'em the lies\nWho else can have you swimming in wealth the blink of an eye?\n\n[Chorus]\nBig trucks, gee rides, we fly, twenty-fo' won't you sit in them tires\nBelieve me its nothing\nG-4 ? Just won't mix with my ride keep a strap on my side\nBelieve me its nothing\nFast women, bad bitches, down hoes, hood rich, pitch up in Daddy's hooood\nBelieve me its nothing\nBig trucks mean rides we fly t-squad our time\nBelieve me is nothing\n\n[Verse 2]\nDrop from Harlem even, more for Brooklyn\nStill got my Name covering the walls in central Brooklyn\nHaters want me, they love to slut me\nMad because my fat ass stay - living comfy\nDown in d-r on the landing strip\nWhen record sales get low we back to advancing bricks\nJack-of-all-trades we do that too\nThe only rapper get the Suge Knight effect when he come through\nWhen pun died, half of y'all cried\nThe other half wanna See my demise\nIt was inevitable the sqaud'll reach new heights it's unforgettable\nFollow the don is all we kept telling you\nOnce you down with the squad you can never give up\nNo need to get ya jewel's back, let them other crews do that\nIt's so ironic that I'm under fire I'm like 'mine'll get better one time' you dick blowers\n\n[Chorus]\n\n[Verse 3]\nNo ya, not dreaming, it's not a visage\nIt's just another platinum plaque to add to my garage\nTen years in the game - and still going hard -\nFuck a club we flood the studio wit broads\nUhh, my whole life never been more focused\nJoes the don ask Jennifer Lopez\nWhat the hell in the world did they do to provoke this?\nThe newspaper reported the scene was atrocious\nAnd still find the time to please girls\nEven get hit on by the chick on Cenas world\nWe beens about it, y'all dudes is frontin'\nBig cars, big chips, big Kris' its nothing\n\n[Chorus]", "title": "It’s Nothing"}]}