{"artist": "Andre Nickatina", "songs": [{"title": "Blood N My Hair", "album": "Bullets, Blunts N Ah Big Bank Roll: The 7 MC Theory (First Pressing)", "year": "2004-05-18", "image": "https://images.genius.com/d65953cb0cdb3c3daa8a293a1af27fee.1000x1000x1.jpg", "lyrics": "[Woman:] Only maybe, maybe it could be different, this time. If we try\n[Man:] I've never seen a guy that could get away with it yet\n\n[Intro sample]\n\nBlood in my hair from the wings of a hawk\nNo angels guide me, I seem to be lost\nSpittin a rhyme from devious ways\nAll in the veins them freaks they get paid\nThe path was laid, the bed was set\nNicky the cat from the fillmoe 'jecks\nHere go the steelo it ain't that odd\nKhan, money, clothes, broads\nDon't forget weed and rap for the gods\nPages that rewrite the Holy Quran\nMan I've been swervin since Julius Erving\nReady to rap now so open the curtain\nDon't be in the lab when I'm doin bad\nPencils and pads they turn to cash\nThis how I mash\nDriving so fast\nShoes say WU! when I step on the gas\nBaby is mad\nMan she got ass\nI looked and gave her my gangsta laugh\nMy pedigree, my legacy\nI sell it like amphetamines\nThey told me at the dinner scene\nAnd I'm standing there high in my anchor jeans\nGangstas, hustlers, hoes and all\nFeel the pain when a rapper falls\nBlood in my hair from the wings of a hawk\nNo angels guide me, I seem to be lost\n\n[Muhammad Ali:] I'm Dancing! Follow me chump! No I'm not there, I'm here! Sucka you ain't got nothin'!\n\nIt's mighty extreme to being a king\nLooking for people to be on the team\nHow much money it cost to cheat\nTo slow ya down and be drug free\nWith Kenneth Cole boots and Sean John suits\nAnd execution that top of the roof\nWho got the juice\nShow me some proof\nThe curse of the rhyme give me the loot\nAwake like an owl and drinkin' some tea\nWatchin' fights of Muhammad Ali\nDodgin' death with every step\nThis is my rep, give me the checks\nLike Snagglepuss I'll step to the left\nWith this freak, with that quiet as kept\nMy philosophy is the boss of me\nPass the hot sauce to me\nYou need diamonds and pearls to floss with me\nI stand there with none\nHot as a gun\nThe sound of the noise will make you run\nMove from the slugs that will rip your lungs\nLook in the eyes of the greediest god\nRollin the streets with the Caddie Passat\nCut through the rain like ninja blades\nThe batter ram explain the rage\nI got my game from project floors\nWeed, dope, and dice by the door\nCrush anything that'll cause a threat\nTalk to the bookie secure the bet\nNever with leniency he won't agree with me\nGettin' all mad when I make the call\nGangstas, hustlers, hoes and all\nFeel the pain when a rapper falls\nBlood in my hair from the wings of a hawk\nNo angels guide me, I seem to be lost"}]}