{"songs": [{"year": "1994-01-01", "album": "Ass, Gas, Or Cash (No One Rides for Free)", "image": "https://images.genius.com/82ea5b0841bddad3be771a5b1b5f1817.600x596x1.jpg", "title": "Neva Was A Baller", "lyrics": "[Intro]\nYou could feel all the tension building up from the convention as the hustlers began to arrive. There must've been 9,000 or more that came through the door, the time was 11:55\n\n[Hook 1]\nBaller, baller, baller can you come out to play?\nTaking hoes out, always have to pay\nI eat and I drink, free load everyday\nAnd get the pussy anyway\n\n[Verse One]\nNever was a baller, never was a trick\nStill had hoes on the dilznick\n24/7\nSneaking dumb bitches in the house\nWhile daddy would sleep on the couch\nHad to tip toe, creep real slow\nDamn, we made it, now it's time to fade it\nShe made a lot of noise so listen here buttercup\nYou're gonna have to shut the fuck up cause\nDaddy don't like me fucking in the crib\nCause nine months later the baby needs a bib\nFor 18 years you'll be in my hair\nNow I'm smarter than the average Huggy Bear\nSo go tell Starsky, go tell Hutch, I'm going dutch\nGet these nuts\nAnd if I needed some pussy all I had to do was caller\nBut no, I never was a baller\n\n[Hook 2]\n\"I never have I never will\" - Snoop Doggy Dogg\n\"Well I have never\"\n\"See even though I got muscle that ain't my hustle\" - Ice Cube 'What Can I Do (Remix)'\nNever was a baller\n\"[?] pimp will slap every last bit of dog shit up out ya nigga\"\n\"See even though I got muscle that ain't my hustle\"\n(K-Dee baby!)\n\n[Verse Two]\nDon't like school came up with a full cough\nCan't wait till my moms pull off\nCause Ice Cube is coming over and we're both ditching\nEating cereal in the kitchen\nCan't wait for the phone to ring\nAnd bring yo' cousin with the dope ass figure to get with my nigga\nSo we can parlay in the covers\nBack then we didn't have to use rubbers\nJust let it fly on the mattress (god damn)\nBut here comes the bad actress\nMy ex-girlfriend standing on my lawn, once again it's on\nI sing this song\n\"Why can't we be friends? Why can't we be friends? Why can't we be friend?\nHon. And do a two on one.\"\nYo I never was a baller\nNo never, no never\n\"I never have I never will\"\nBecause I'm much too clever\n\n[Hook 1]\n\n[Verse Three]\nNow a baller is the one who flaunts being rich\nHe flaunts his car, his doe just so he can get a bitch\nBut no not this kid, this is all I did\nJust shoot game and then the boots came\nThat's how I played 'em as I laid 'em on the flo'\nI dick 'em, dick 'em down till scream and scream for mo'\nI make my own doe so a hoe could never get mine\nCause see I drove a bucket, they still let me fuck it\nJust 18, fresh outta high school\nWasn't thinking about college cause I had street knowledge\nWasn't in a gang, couldn't bang so I didn't\nMy mouth stayed dry from all the game I was spittin'\nTo a honeydip till honey stripped to the nude\nThen food came up and it fucked up my mood\nTalking about a movie and a nice dinner yo\nYou better pop some popcorn and rent a video\nBecause I never get done I do the doing on the slimmy\nEspecially for them hoes that's yelling gimmie gimmie\nI kick 'em to the curb, they deserve to be abused\nI never was a baller cause ballers get used\n\n\"I never have I never will\"\n\"Big baller from around the way\"\nNever was a baller\n\"Big baller from around the way\"\n\"Big baller from around the way\"\nNever was a baller\n\"Big baller from around the way\"\n\n[Hook 1]\n\n\"Big baller from around the way\""}], "artist": "K-Dee"}