{"artist": "YG", "songs": [{"image": "https://images.genius.com/4f22072ae134f53926f9d67d51dfb5ce.500x500x1.jpg", "year": "2013-01-21", "album": "Just Re’d Up 2 ", "lyrics": "[Verse 1: YG]\nI would like to get to know if I could be\nThe kind of girl that you could be down for\nCause when I look at you I feel something tell me\nThat you're the kind of guy that I should make a move on\nAnd if I don't let you know then I won't be for real\nI could be wrong but I feel like something could be going on\nThe more I see you the more that it becomes so true\nThere ain't no other for me it's only you\n\n[Hook]\nI wanna B down\nWith what you're going through\nI wanna B down\nI wanna B down with you\nNo matter the time of day or night it's true\nI wanna B down\n\n[Verse 2: YG]\nPromise you will be my lover\nYou will never ever leave me\nShe know a nigga lie, but it’s whatever, she believe me\nLet me hit it I make you come early like premis\nAs long as she never leave me\nLick you up like fiji water\nGo harder harder\nGirl I fuck you while we listen to the carter\nAin't worried about money, I'm a baller\nI hit her with that game Coach Carter\nI ain't the type that's gone ask where your Benz at\nMy nigga need a girl, so where your friends at\nWhere she live at? Can he pull up?\nHe be gang banging though, he a hussler, can he pull up?\nSee, it be the little things that matter\nGot me climbing up the love ladder\nYou can be wife, best friend\nMy nigga, it's all good\nJust love me like you said you would\n\n[Hook]\nI wanna B down\nWith what you're going through\nI wanna B down\nI wanna B down with you\nNo matter the time of day or night it's true\nI wanna B down\n\n[Verse 3: YG]\nShe said, your secrets is safe with me\nJust think I heard them pages in my diary\nSay don't you ever lie to me\nDon't ever get that pussy up\nEven if I cheat her with a bitch that wasn't good enough\nCause most of the time these bitches don't matter\nShe say long as she don't find out just make sure I wrap up\nShe know a nigga gon' be a nigga but I'm that nigga\nShe wanna be with so she might as well put up with it\nLike hold up!\n\nLook\nWhat's happenin\nShit you know me, I'm in the studio goin hard\nYe?\nThat's cute\nHaha\nOk\n\n[Hook]\nI wanna B down\nWith what you're going through\nI wanna B down\nI wanna B down with you\nNo matter the time of day or night it's true\nI wanna B down", "title": "I Wanna B Down"}]}