{"artist": "Problem", "songs": [{"album": "Mollywood 3: The Relapse (A-Side)", "title": "No More", "image": "https://images.rapgenius.com/067f61cd9f8d4bafeaa5ff6d90c81eb8.950x950x1.jpg", "lyrics": "[Hook]\nI know I said that I wouldn't fuckin' with that bitch no more\nBut I did, but I did. Fuck it, shit\nAnd I know I said that I wouldn't fuckin' with them drugs no more\nBut I did, but I did. Fuck it\nI ain't stoppin' no more, I ain't stoppin' no more\nI'mma do it 'till you niggas ain't watchin' no more\nI ain't stoppin' no more, I ain't stoppin' no more\nI'mma do it 'till you niggas ain't watchin' no more\nHomie\n\n[Verse 1]\nI ain't listen no more, I ain't listen no more\nTell the Punk P.O. I ain't pissin' no more\nTell that bitch stop talkin' I ain't hit no more\nAnd don't ask for no dick you ain't get no more\nYou ain't get no more, you ain't get no more\nBaby pass me a lot of weed and don't hit it no more\nGot the big head [?] till you fit no more\nAnd I'mma be this way till that ass go broke\nAnd it can't happen so\n\n\n[Hook]\nI know I said that I wouldn't fuckin' with that bitch no more\nBut I did, but I did. Fuck it, shit\nAnd I know I said that I wouldn't fuckin' with them drugs no more\nBut I did, but I did. Fuck it\nI ain't stoppin' no more, I ain't stoppin' no more\nI'mma do it 'till you niggas ain't watchin' no more\nI ain't stoppin' no more, I ain't stoppin' no more\nI'mma do it 'till you niggas ain't watchin' no more\nHomie\n\n[Bridge]\nHold up\nThese niggas faded as a mother fucker\nI'mma end up in a [?] in the mother suckers\nIt's bout to go down pass the chain to my lil mama\n\n\n[Verse 2]\nYeah I'm bout to trip tho\nShe's at that big so this thang up on my [?]\nTatted by the ribs, Diamond Lane celebrating the trip\nTurn up all night then go pick up all of my kids\nIn the morning dady buy his kush got me in orbit\nBitch I dare your brother run up on me I ain't Norbit\nYou called me 20 times oh my God yeah I ignored this\nChris shoting for the gram [?] the I stoled it\nPockets all enormous with more tree than a forest\nBaby you can suck it right now dady still recording\nI'm buyin' up these hoes while you niggas buyin' Jordans\nFuck it them suckers I shoulda know like [?]\n\n\n[Hook]", "year": "2015-07-01"}]}