{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse: Wrekonize]\nOkay, walk with me a moment through this beat we make it go\nFollow me up into the clouds, I'mma break it down below\nI'mma get 'em up get 'em up get it poppin' now\nBoomboxes knock the ground, better get this fuckin' loud\nEnemies tuck ya cock in now\nWild buffalo, bill me for shuckin' flows\nClaim you get Hulk but all I see is Mark Ruffalo\nWent on the road, smashin' records like a day trip\nCame back home and all my friends have gone apeshit\nBreaking codes, as far as cowards go they should take the gold\nCalling out the Gods? You the one that's out there fakin' so\nDirty hippie creepin' leakin' out the mouth\nPull your shit together, crashin' cribs and sleepin' on the couch\nPlexo told me kill the diplomatic shit so\nI'm a slay the sick and give your trickin' acrobatic lift...\nLift with dick why you liftin' shit with Olympus kid?\nI'm Olympic prick and an instant fit ... shit, you an infant bitch!\nMade man is runnin' muck around the planet\nGod damn it my language makin' mamas wet they pajamas\nRockin' Thrift Store, Halos\nMy spit's more, Kano\nGot heart, but I bet it ain't a smart\nBut I'm bringin' out a dart in the dark better lay low\nGot Bane on the brain, propane inside my bravado\nAnd the stadium seated executions in Colorado\nGoddamn ... ya Lord got really fuckin' odd plans\nIf he returns, tell him bring lots of ammo and stop playin', amen\nThis is ground zero for the skeptics\nMy vocal cords septic, my family tree metric\nShe seen I had British roots upon my arrival\n'Til I swang my rafiki at a bitch half of me is tribal\nRivals beware! Claim that I could be the best yet\nNo way to be the next Tech so I just be the best Wrek\nExpect records to wreck your neck up like Death - Leps\nSend 'em in quick and pretend you'll neck I'm so deaf to death, yes\nThis is a warning, I told you I'm 'Good Good Night' to get mourning\nFor the beats under my cleats all of these wack rap performers!\nAnd now I'm feelin' Damien, still I got my halo on\nNext week we'll be gathering which liquor mixed with Faygo, huh!?\nThis is one of four, so run for the fuckin' door\nI've come for the fuckin' floor, and once I own it what's in store?\nPorch flows, chaos in the scorched shows\nSéance and of course though, Snake and Bat Morse Codes\n\n[Hook:]\nThey say we got five months left 'til the end of the world\nSo you better cash in on your souls\nI got a birds-eye view, subterranean flow\nAll the majors said, \"Thanks, but no.\"\nNow I got a doped up deal with the Snake and the Bat\nDon't try to act like you didn't know\nI put a decade in the game, now I'm here for my change\nLet's spin this motherfucka into gold...\n\n[Instrumental Out]", "title": "Goldie (Freestyle)", "year": null, "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}