{"songs": [{"image": "https://images.genius.com/3e0642e0d60983bc42f6672798b48508.1000x1000x1.jpg", "title": "Baby", "album": null, "year": null, "lyrics": "[Hook]\nAt night I think of you\nI want to be your lady baby\nIf you were my man\nIf you were my man\nIf you were my man\nI'd give my all to you\n\n[Verse 1]\nI'd give my all to you if you were my man\nLike I'm a child of Destiny, I don't think you understand\nI'd cater to you, learn to cook, be a waiter for you\nGet too cocky then it's later for you\nIt's late at night, we laid in bed, you looking nice\nClose the blinds, and the window, and bring out the ice\nWhip cream, strawberry, fantastic\nEdible arrange arrangement in my basket\nIs this what love feel like? I like the way it feel\nI like the talks on the telephone, the way that we chill\nI like how every time he laugh it makes me laugh\nI like the little smirk he get when he be, ;ookin at my ass like\nShe don't need no ass just to hold me down\nLike she got a brain, bet I wife her down\nBet I take her to IKEA and start cashin' out\nNigga smoke a black and mild, who yo daddy now?\n\n[Hook]\nAt night I think of you\nI want to be your lady baby\nIf you were my man\nIf you were my man\nIf you were my man\nI'd give my all to you\n\n[Verse 2]\nWe two peas in a pod\nWe too blessed to have each other we be thankin the gods\nShow em' much love for much love they put in my life\nAlleviate the stress of clubbin', try'na find Mr. Right\nAll my friends say good men ain't common\nBut he great, he's the epilogue for romance\nSometimes you should wait, 'cause\nWhen the end come, it look like spasm\nIt sound like curled toes and slow orgasms\nOooh wait a minute, we should wait a minute\nI ain't married, you ain't married, maybe this is sinnin'\nOr maybe this is good livin' on a Tuesday\nPuttin' in work getting thirsty\n\n[Hook]\nAt night I think of you\nI want to be your lady baby\nIf you were my man\nIf you were my man\nIf you were my man\nI'd give my all to you"}], "artist": "Noname"}