{"songs": [{"album": "If Heaven Was a Mile Away (A Tribute to J Dilla)", "image": "https://images.genius.com/9312bcdc87acaf69bf4807d06a1292f3.500x500x1.jpg", "year": null, "title": "Pay Jay", "lyrics": "[Rapper Big Pooh]\nR.I.P. J Dilla\nTermanology's up in here\nRapper Pooh is up in here\nMy man Joe Scudda, he's up in here\nMy man Chaundon, he's up in here\n\nYeeeah...\nI stepped on stage just to scream \"Go ladies\"\nAnd after my set she went crazy, slow it down baby\nI can't keep running, energy after the show\nFo' fucking, one won't do, two's not enough\nSo why you in my ear with this fall in love stuff\nI'm just tryna break backs, let me see you climax\nSmoke a little purp', zone out to some Dilla tracks\nI don't know what you been told\nYou dealing with a player, pimp hand ice cold\nI'mma get this money, did get honey\nSo get ready, shake it down for me lovely\nHold tight...\n\n[Chaundon]\nOn the count of three say \"fuck the police\"\nBack and truly in the fleece, diddy-bopping in the streets\nGetting busy over beats what, I'm Fantastic\nOn another Voyage, you know who the boy is\nPuffing on the lye with Esche\nI wanna thank the nigga who sold J Dilla his first SP\nFrom the D back to NYC\nI'm spitting game to this beat like it's a P.Y.T\nIt's Human Nature to turn it up, burn it up\nThe illest Soulquarian to ever serve it up\nNo it ain't hard to tell who the realest it\nChaundilla bitch, got the world on that J Dilla shit\n\n[Hook 2X: Rapper Big Pooh]\nSay what you want but you gon' pay Jay\nSay what you want but they gon' play Jay\nIt's that Dilla shit, that Dilla shit\nThat Dilla shit, that Dilla shit\n\n[Joe Scudda]\nSticky green we tote, hoody with the pea coat\nRiding in the hoopty with my groupie of the week yo\nHoney got that cold and I told her let the heat blow\nDilla and the J, gotta show her how the beat go\nKeep crushin'\nYou know I make 'em envy by the way I keep hustling\nTake notice, stay focused, I'm J-O, it's so raw\nYou can't put him next to nothing\nSo let's take it back, there's nothing like this\nI can't explain all the game that you might miss\nWithout a chain or even a bright wrist\nI stay ready like machete with a tight fist\n\n[Joe Scudda] + [Termanology]\nWhat's your name pa? (It's 'Ology)\nAnd what's the name of your crew? (It's S.T.)\nChilling with the H.O.J. (Yeah, that's me)\nWe putting it down (Lawtown to NC)\n\n[Termanology]\nI don't need no rims, need no Benz\nNeed no ends, cause I got beats\nI don't need no ice, need no height\nMy name up in lights, cause I emcee\nAiyyo, I body rappers, them party rappers\nThem body snatching college application\nRappers saying spread the bang\nWet your aim out your stain in the lane\nOf the kings and the Preem's the same\nKiller of J Dilla beats, shoutout to AZ\nI'm rather unique, you gon' p-pay J-Jay Dilla for them beats\nPay Jay, pay Jay, pay Jay...\n\n[Hook 2X: Rapper Big Pooh]"}], "artist": "Termanology"}