{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "Fuckin Wit It", "year": null, "album": null, "lyrics": "(Hook)\nDrink got me faded, but I'm fuckin wit it\nKush got me blown away, but I'm fuckin wit it\nGirl do your thing, I'm fuckin wit it\nI don't know your name, but I'm fuckin wit it\nAll my niggas with the shit, you know we fuckin wit it\nI was just around the way, the homies fuckin wit it\nGot a line on your girl, and she fuckin wit it\nIt's a fly nigga world, and she fuckin wit it\nGirl, pop the thing, cause I'm fuckin wit it\nI'll drop the change, and I'm fuckin wit it\nI'm fuckin wit it, I'm fuckin wit it, I'm fuckin wit it\n\n(Verse 1)\nWhip full of honeys and them nice chains\nFist full of money at the dice game\nMy niggas used to bundle up them white things\nAnd dip up out the corner when the lights came\nNigga try to knock me, tell him \"nice try\"\nKill another hundred tryna give myself a high five\nLooking at the phantoms man they costed in the high fives\nBring it through and kill everybody, that's called a drive-by\nWhile I\nI've been on my hustle too long for the fake shit\nHad to move on from the snake shit\nHad to take my life in my own hands\nAin't no coupon, nigga save it\nDuckin bitch niggas, duckin bullets, duckin cops\nDuckin bomb bitches that jump on my cock\nMy nigga just won us a pew, that's a blessing\nPoint a nigga out, I'll peel, let me stretch it\nSacrifice myself to see my people eat\nMy nigga thought he'd probably never leave the street\nWent and got the Uncle, threw away the Jesus piece\nCause I know all this knowledge deep, and niggas need a piece\nThere's a bunch of motherfuckers that I need to teach\nYeah we need to reach a level where we all get it\nI got something rolled up, we can all hit it\nAnd a nigga going way to hard wit it\n\n(Hook)\n\n(Verse 2)\nI'm a super elevated, melonated\nBeing. Copped the coup with hella paper\nChop the roof and tell the haters see em later\nYou've been educated by the enemy\nPrayin to an entity to empty the empathy\nFrom your heart. Cop stopped you, cocked his gun timidly\nPOP. POP. Call it muscle memory\nSlavemaster in his blood, he'll never show a nigga sympathy\nWho we gonna call on when they cap a nigga?\nWhat's the remedy?\nWe ain't call em when they cap a nigga\nIs you diggin me?\nThey just wanna call it, Kapernick a nigga. Literally\nMan I'm so serious\nFrancis Scott Key wrote the anthem\nAnd his racist head said that blacks was inferior\nBastards ain't hearin us holler for help\nCollege does not provide wealth\nStack up your dollars, gain knowledge, and sell\nRealize the power you got in yourself\nBe conscious of health\nShit, since I went vegan or spirtually speakin\nI feel like the ancestors' hearing me speakin\nOh I got it baby, you know I'm a get inside it baby\nPlus I got a navy right behind me, rest in peace to Dr Sebi\nA nigga kushed up, burn the blunt down\nIt's hard to put the cup down, cause you know:\n\n(Hook)"}]}