{"artist": "PnB Rock", "songs": [{"album": "TrapStar Turnt PopStar", "title": "Now or Never 2.0", "image": "https://images.genius.com/622a62b3dd00e67165bbd1ab41844ac3.1000x1000x1.jpg", "lyrics": "[Intro]\nSmash Bros\nTell me why did you leave so fast?\nWould you mind if I hold your hand tonight?\nWhat are you afraid of anyway?\nI'm not coming back it’s now or never\nTell me why did you leave so fast?\nWould you mind if I hold your hand tonight?\nWhat are you afraid of anyway?\nI'm not coming back, it's now or never\nOh yeah\n\n[Chorus]\nTell me why did you leave so fast? (So fast)\nTell me why does it hurt so bad? (So bad)\nWhy you had to spread your wings so fast? (So fast)\nI’ll never leave you in the past, nah\n\n[Verse 1]\nThey killed my dawg today\nIt's crazy when they took my dawg away (Away)\nSo I'm going hard today\n'Cause for me, he would be a call away (Away)\nIt's raining hard today\nThese teardrops, they keep falling, ayy (Ayy)\nI gotta watch for my enemies\n'Cause I know that they be tryna get rid of me\nThey tryna steal all my energy\nPlottin' and scheming, they tryna put an end to me (Yeah)\nKnow it's some people around me right now\nThey ain’t right, they be moving too finicky (Yeah)\nYou act like I owe you or somethin’\nLil' nigga, I’m startin' to peep all your tendencies\nBut when I was down and when I was out\nI couldn't call you, is you kiddin' me? (Kiddin’ me)\n\n[Bridge]\nNowadays, I don't even breeze through (Breeze through)\nLove my hood, but fuck it, I don't really need to (Need to)\n'Cause they killed my brother, killed a part of me too (Me too)\nNow it's a hole in my heart everybody can see through (See through)\n\n[Chorus]\nTell me why did you leave so fast? (Did you leave so fast?)\nWould you mind if I hold your hand tonight? (If I hold your hand?)\nWhat are you afraid of anyway?\nI'm not coming back, it's now or never (Now or never, it's now or never)\nTell me why did you leave so fast? (Did you leave so fast?)\nWould you mind if I hold your hand tonight? (If I hold your hand?)\n\n[Interlude]\nTrapstar, popstar\nTrapstar turnt popstar\n\n[Verse 2]\nTrapstar, popstar, locked up, cop car\nBailed out, crazy how I still feel like I'm in jail now\nRoom full of bitches and I swear I can't even tell now\nI don't wanna hit, bitch, I just wanna be by myself now\nI feel all alone inside this world, girl, can't you tell now?\nThey say I sold my soul, bitch, I don't have a soul to sell now\nEven though I'm winning, I been taking all these L's now\nThe odds are all against me, it's like they want me to fail now\nTwo days, I've been up for two days\nTryna figure out why the good gotta die young\nI'm tryna figure out why we always gotta fall victim to the system now\nNick, give me some more volume, gotta pour my feelings out\nYeah, I know it took a while, but I think I get it now\nLot of niggas took my style, but I swear it's different now\nBut they tryna take me out so I keep a stick around\n\n[Chorus]\nTell me why did you leave so fast? (Did you leave so fast?)\nWould you mind if I hold your hand tonight? (If I hold your hand?)\nWhat are you afraid of anyway?\nI'm not coming back, it's now or never (Now or never, it's now or never)\nTell me why did you leave so fast? (Did you leave so fast?)\nWould you mind if I hold your hand tonight? (If I hold your hand?)\nIt's now or never\n\n[Outro]\nNow or never, ooh\nNow or never, now or never\nOh yeah", "year": "2019-05-03"}]}