{"artist": "Inspectah Deck", "songs": [{"title": "C.R.E.E.P.S.", "lyrics": "[Intro: Inspectah Deck]\nTo all those C.R.E.E.P.S. out there\nCrime Regulators Eating Everday Pulling Stings\nC.R.E.E.P.S...., they be out there lurking\nWatching... real low key, though\nWatching niggas get that dough\nJust waiting, patient... gon' make your move soon\nI said \"Make it, don't fake it\" knawImean?\nBetter watch yourself.. yo...\n\n[Hook: Inspectah Deck]\nIf you making money off, you better hold your heat\n(Don't go to sleep, there go them C.R.E.E.P.S)\nIf you icey with the jewelry and the gold teeth\n(Don't go to sleep, there go them C.R.E.E.P.S)\nIf you wheeling through the hood, and you overheat\n(Don't go to sleep, there go them C.R.E.E.P.S)\nIn the streets, they king\nAnd mean Crime Regulators Eating Everyday Pulling Stings\n\n[Inspectah Deck]\nGet low sneaks, throws in the street\nStill grinding, same clothes on the whole week\nPlay low key, lurking through these cold streets\nStay smoking, ain't never got no weed\nAt the dice game, watching the bank\nIf it's money, then they plotting to shank, like Saw\nYou saw it coming, but couldn't stop it with tanks\nCaught your pockets, the watch and the link, no lifers\nThrown through the fire, ain't scared of jail\nMight run through your stash while you making a sale\nCreeping in the gray BM, then hit you and your lady friend\nFor all your savings at the ATM\nSee them C.R.E.E.P.S. got nothing to lose\nThey take they ass kicking, get snuffed & bruised\nGet shot, seen and certainly do 'em\nUnplug the IV, and bounce out the emergency room\nStill hurt from the wound, to him it's a thrill\nHe bout to, do it again like Sidney and Bill\nHe bout to, hit up the crib, for some ecstacy pills\nShot the fiend, cuz he ran to the jiggy and squealed\nYou can find him where the drugs be at, where it's lovely at\nWith the window cracked, scoping with the rusty gat\nOr at the check cash', focus at your money stack\nOr at the bar, where them ballers pop they bubbly at\n\n[Hook]", "image": "https://images.genius.com/b594b451e76ffa06266ec5bb5611cfd9.500x500x1.jpg", "album": "The Resident Patient", "year": null}]}