{"songs": [{"title": "It’s Not That Serious", "lyrics": "[Intro]\n\n[Verse 1]\nI know we all live our life based on what they think\nCause we think it matters but I reckon\nIf we didn't care for just one second\nWe'd be much happier\nRealize your life is your's to live\nTell your friends or your parents and what they think\nYou want the whole thing\nFour kids and a good job a big house and quiet down\nAnd thats cool, stay in school. Go to uni with those like you\nIf on the other hand you want to travel the world just to meditate\nThats what you should do\nYou don't need permission from the stay-in-line commission just to be who you are\nFollow your heart, follow your dreams like a kid again\nThey want to write you off, with the end of the bit of pen, let them have it\nThey'll come around eventually\nIf not it wasn't meant to be\nIts their problem\nJune or December, theres one small thing that I think we should remember\n\n[Hook]\n\nIt's not that serious\nSometimes I want to fight\nSometimes I want to cry\nBut then I must remind myself\nIt's not that serious\nWe're gonna make it through\nAnd find a better way\nThat works for me and you\n\n[Verse 2]\n\nIf you don't conform, society whips you with its displeasure\nIf they were happy they wouldn't care\nWhichever way that you chose, what you do with your time\nLong as you ain't hurtin' no one, then thats fine\nProblem is we hate to see another live the life that we dream\nAnd I don't mean big screen and flashiness\nJust free, carefree, true happiness\nWake everyday excited whats to come\nNever work a minute when doing something you love\nSo when we judge, ask why, is it because we feel life passed us by\nIt's never too late to get rid of the stress\nTheres a whole world out there\nJust look up from your desk and say that the world is mine\nAnd if you're not having a good time, then you're wasting your time\n\n[Hook]\n\n[Bridge]\nYou know, yo\nPeople think I'm really serious, right\nAnd I was for a long time\nI'm not gonna lie and pretend I wasn't\nBut, then I realize that sometimes you just got enough\nI mean, I'm not as serious as people think\nYeah I like to talk about the issues in the world\nBut at the same time, we can't let them bog us down\nYes, the world is not perfect, we all know that\nIts just not that serious\nGo to a comedy show, man\nTake a bubble bath, or, I don't know, buy a pink dressing gown\nDo something crazy that people wouldn't expect you to do\nLet's drop these things called egos on the floor\nStamp on them, and try to get on with it, and realize that its just-\nJust don't take yourself do god damn serious\n\n[Verse 3]\nWhat about the problems in the world?\nThings ain't golden\nYeah, I agree\nBut will worrying solve them?\nNo, I'm not saying ignore\nBy all means do something if you feel for a cause\nBut you can't feel poor enough\nTo enrich one single person on this planet\nAnd you can't feel bad enough\nTo fill one single soul with happiness\nSo, the biggest challenge we face, is just keeping a smile on our face\nIf stock markets crash, or girlfriends leave you, people don't like what they see when they see you\nFootball teams lose, bands will split\nBut the thing we must remember is this-\nIts just not that serious\nIt really is not\n\n[Hook]\n\n[Outro]\nToday walk up to somebody and talk to them find out how their day was\nDon't worry if they think you're crazy- which they probably will\nAnd you people in the train-\nWhen you don't want no one peering over your shoulder to read your letter\nStop taking yourself so god damned seriously\nIts just your newspaper. If I want to read a bit of your newspaper, whats the problem?\nYou should open it up, and let me have a good look\nYeah? Thank you\nLadies and gentlemen, this is Akala, not taking himself very seriously\nAnd there are probably a lot of people that are angry about that and think I've gone crazy\n\"Why am I not screwing up my face? Why am I not trying to be the best grime MC?\"\nI'm trying to make nice relaxing songs\nWhats my problem? I haven't got a problem, its just that I stopped taking myself so god damn seriously\nThats it. Have a good day", "year": null, "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}