{"songs": [{"year": null, "image": "https://images.genius.com/b5fb5b522f3e6528f3734f992d97c3f7.500x500x1.jpg", "title": "Deeper Rap", "album": "Freetracks & Exclusives", "lyrics": "[Intro]\nEy Mutai, ey Digger, ich bin ein Backpack-Rapper\nEy Und ich hab gesehn wie du so voll am rumprollen bist mit deiner Villa, deinem Bling-Bling und deinem Low-Rider\nDigger, so geht's nicht\nIch möchte einige Dinge an unserer Gesellschaft kritisieren\nUnd darum geht es in diesem deepen Track, yo\nCheck it out!\n\n[Part 1]\nEs macht mich verrückt mit anzuseh'n wie Leute im Leben steh'n\nOder sich glatt das Leben nehm' und der Grund, sie sind zu bequem\nUm einzuseh'n, dass es so nicht geht, dass sie so keiner versteht\nIhr solltet lieber chillen beim grillen in dicken Villen\nDoch leider ist das nicht möglich, der Staat hats ja nötig\nDie Steuern zu heben und sich noch mehr Geld zu nehmen\nKein Reichtum und kein Ausruh'n, nur massig Dinge zu tun\nDeswegen sollten wir sie ausbuh'n. (Buuuh)\nJetzt soll man auch noch Arztbesuche selbst bezahlen\nAls würden Ärzte nicht schon mit Reichtum prahlen\nMedikamente auch, ey, Digga, dass schlaucht\nKeine Sau will sich das antun, ein Grund mehr hier abzuhau'n\nDiese Spasten, mit dicken Taschen, voller Kies\nUnd jeder der das geniesst ist fast so fies wie mies\nAlso, wie hieß es gleich noch, jeder Depp nur noch\nDoch nur einer, killt sie doch!\nDas soll jetzt keine Hexenjagd werden\nDarüber könnt ihr gerne lange reden\nDenn wir lieben es zu irritieren\nIndem wir die Raps variieren\nUnd uns artikulieren\nBeim Gewinnen von Preisen die andere Leute verlieren\nIch werde nicht ausruhen, bevor die Leute da was gegen tun\nUnd tun schon genug? Pah, von wegen klug\nWir nehm' euch eure Mic's weg und rappen die Fans in die Tiefen von Hex und euch in den Dreck\n\n[Outro]\nMutai, ey, Digger, ich hoffe diese deepen Lines regen dich etwas zum nachdenken an\nAlle Politiker sind Schweine, nieder mit dem Kapitalismus\nGegen kommerziellen Rap\nOne love, ich bin draußen, peace 'n out"}], "artist": "Kollegah"}