{"artist": "Kevin McCall", "songs": [{"image": "https://images.genius.com/312afea5d7628997f4d167dea042a613.500x500x1.jpg", "title": "Jada Fire", "year": "2012-02-02", "album": null, "lyrics": "[Intro: Kevin McCall]\nAyy\nCuff your chick\nYeah, yeah\n\n[Verse 1: Kevin McCall & (Sammie)]\nK-Mac, look, look, this ain't a game, but I'm a player\nIn the club with my main, but I'm still a player (uh-huh)\nPick the baddest chick, told her hit me later (yeah, yeah)\nIf she got the fire? I'ma call her Jada (yeah, ayy)\nKush got me higher then the Himalayas (uh-huh)\nMami popping that P like the perculator (oh, oh, oh)\nThey all in my VIP, so it's plenty haters (oh, woah)\nTryna fake it 'til they make it call it perpetrator (ooh, woah)\nShawty hot, shawty smoking\nI got her wet, it's like I'm super soaked (wet, super soaked)\nThrow it back so I could bust it open (ayy)\nLouis Armstrong, her cheek's swollen (ayy, ayy, woah)\nLet me jump up and down on that pretty, pretty (pretty, pretty)\nI'ma leave a frown on that pretty, pretty (pretty, pretty)\nTattoo on the cat say come and get me\nTattoo on my dick say hello kitty (hello kitty)\n\n[Chorus: Kevin McCall]\nShe going hard, she ain't tired (nope)\nPop a pill, pull all night\nShawty wet, I'ma need a dryer\nThat pussy real good\nShe got that Jada fire, fire, fire, fire fire fire fire\nShe got that Jada fire, fire, fire, fire fire fire fire\nOoh, she got that, ooh she got that\nOoh, she got that Jada fire\n\n[Verse 2: Diesel & (Sammie)]\nShe a bad chick, fine as hell (yup)\nRed bottoms, hot tail (yup)\nShawty all that, Kennan and Kel\nSoaking wet, killer whale (drip)\nShe got the fire that good, good shit (oh, oh)\nI'm thinking by her fucking the next bitch\nBitch hurt, get me a new chick (ooh)\nNow I'm tryna picture her fucking another bitch (yeah)\nMake it rain, she got that super soak (oh, oh)\nFrom the ceiling to the wall, bring a raincoat (oh)\nShe a wet dream, so I'm trying to float (yup)\nGently down the stream, row row your boat\nLook at her move, shawty get it in\nShe going hard, I'm a fan\nSo I'ma play it cool 'cause she turn me on\nShe got the Jada fire, turn the cameras on (ooh, ooh)\n\n[Chorus: Kevin McCall]\nShe going hard, she ain't tired (nope)\nPop a pill, pull all night\nShawty wet, I'ma need a dryer\nThat pussy real good\nShe got that Jada fire, fire, fire, fire fire fire fire\nShe got that Jada fire, fire, fire, fire fire fire fire\nOoh, she got that, ooh she got that\nOoh, she got that Jada fire\n\n[Verse 3: Chris Brown]\nI don't know you, but you know me (hahaha, ow!)\nWe can take it back to my hotel suite\nI ain't got a car, girl, I got a lot\nMoney over err'thang, M.O.E\nMoney piling up, lemme stack that shit\nIt don't add up, can't subtract my shit (look)\nAnd when I go in, I'ma lick your back, back down\nI tell her get upon it then sit upon it like shit\nYou craz, baby, da-da-damn you blazing\nI got that fire extinguisher, it's amazing (ooh, yeah)\nI'm knocking yo walls down I make 'em cave in (yeah)\nCalifornia kush, I'm in LA, bitch\nBut it's VA though, g-girl, just touch your ankles (yeah!)\nNigga selling unit by the blocks, call 'em legos (bricks)\nHa, swagger bad look at my attire\nShawty bad, she got that Jada fire\nHa, I know they mad we keep dropping that fire\nHaha, and shawty bad, she be busting back, fire\nPussy popping on the handstand, fire\nDrop it, through the room, I'm your biggest fan like (hahaha, leggo)\n\n[Chorus: Kevin McCall & (Chris Brown)]\nShe going hard, she ain't tired (I told you niggas)\nPop a pill, pull all night (look, bitch, bitch)\nShawty wet, I'ma need a dryer (look)\nThat pussy real good (leggo, hahaha)\nShe got that Jada fire, fire, fire, fire fire fire fire (leggo!)\nShe got that Jada fire, fire, fire, fire fire fire fire (what I say? What I say? What I say? I say leggo! Nigga, what? I said that)\nOoh, she got that, ooh she got that (K-Mac)\nOoh, she got that Jada fire"}]}