{"artist": "G-Eazy", "songs": [{"title": "Fly Away", "album": "The Beautiful & Damned", "year": "2017-12-15", "image": "https://images.genius.com/0d2177adfa27f145143e3e5a0ec2e943.440x440x1.jpg", "lyrics": "[Intro: Ugochi]\nLittle bird\nLittle bird\nLittle bird\nLittle bird\nSpread your wings\nAnd fly away\n\n[Verse 1: G-Eazy]\nI should have known, but this won't ever work here\nHonestly realized it way back in our first year\nI'm not even religious, but hope there's a church near\nIt's whiskey on my lips and it's been too much thirst here\nMy lifestyle is gettin' outta hand\nI come down and take a Xan\nDid too much blow tonight, I try to sleep, but I can't\nIgnoring phone calls, when she hit me I don't answer\n'Cause I'm faded, I ain't tryna listen to another lecture\nThese drugs are the only way I'm escapin' from the pressure\nYou don't know what it's like for me, you got no way to measure\nShe said \"I know you well, why you don't let me in to help you?\nThese groupies at these parties, they don't even know the real you\nI'm worried about you, hope you never do enough to kill you\nDecide what you want, 'cause I can only wait until you-\nPush me so far, then I've got nothing else to tell you\nIf I don't make you happy, hope success and all the wealth do\n\n[Chorus: Ugochi]\nLittle bird, little bird, little bird, little bird\nSpread your wings\nAnd fly away\nLittle bird, little bird, little bird\nWon't you spread your wings\nAnd fly away?\n\n[Verse 2: G-Eazy]\nThe toughest part is letting go\nMillion times you saw the cliff, but never jumped to end it though\nMistakes can always turn into another lesson though\nSay I'm selfish, but you're telling me what I already know\nIf you were smart you would run away and never let me know-\nWhere you went, so I can't chase you there; fly away and go\nDon't ask about me, you'll be happier the less you know\nNothing'll change if we keep staying put like we're in control\nBut you just don't budge, you just like an old judge\nCan't you see we got stains on this? This is no smudge\nIf only we could live with no liquor, no drugs\nYou got every right to hate me, but you still hold no grudge\nYou gotta go, even though it hurts, is this for certain?\nEven though I'd hate to see you with another person\nAnd even though you'll always be there in my heart just lurkin'\nHaunting me, I gotta find myself and now I'm searchin'\n\n[Chorus: Ugochi]\nLittle bird, little bird, little bird, little bird\nSpread your wings\nAnd fly away\nLittle bird, little bird, little bird\nWon't you spread your wings\nAnd fly away?\n\n[Bridge: G-Eazy]\nI wish you happiness, one day you'll find the right one\nYou're a queen, you deserve to be treated like one\nVacation for the mind every time I go to light one\nKarma is a bitch, I'm well aware one day it might come\nYeah, one day it might come\n(Fuck....yeah)\n\n[Chorus: Ugochi]\nLittle bird, little bird, little bird, little bird\nSpread your wings\nAnd fly away\nLittle bird, little bird, little bird\nWon't you spread your wings\nAnd fly away?"}]}