{"songs": [{"title": "Freaky Friday", "album": "LD2", "year": "2018-02-27", "image": "https://images.genius.com/2f018e4f3a47df274d648c3bd41d8ed8.1000x1000x1.jpg", "lyrics": "[Intro: Chris Brown]\nLil Dicky, ooh\nMustard on the beat, ho\n\n[Verse 1: Chris Brown]\nI woke up Chris Breezy, oh my god I'm the man (oh shit)\nI’m so fly and I can dance (whoa, whoa shit)\nThere’s tattoos on my neck (oh, oh)\nI just FaceTimed Kanye (blip, blip)\nI told him I’m his biggest fan, yeah (yeah)\nGot all these hoes in my DM (yeah, I do)\nHoly shit, I got a kid (oh)\nOhh, I can sing so well\nWonder if I can say the n-word (wait for real?)\nWait, can I really say the n-word?\nWhat up, my nigga? (woo) What up, my nigga?\nBig ups, my nigga, we up, my nigga\nYou pussy ass nigga, man, fuck y’all niggas\n'Cause I’m that nigga, nigga, nigga, nigga\nI’m that nigga\n\n[Chorus: Chris Brown]\nI woke up in Chris Brown’s body (oh yeah)\nSomehow this shit turned into Freaky Friday\nBut we got no choice but to turn this bitch sideways\n(Oh yeah, oh yeah)\nI can’t believe that it's Freaky Friday\nYeah, it’s Freaky Friday\nI’m in Chris Brown's body\nI drive his Ferrari and I’m light-skinned black\n\n[Verse 2: Lil Dicky]\n(Ring ring) What the fuck?\nI woke up and I'm Lil Dicky (Lil Dicky?)\nUgh, what the fuck?\nThis shit is real weak\nHow his dick staying perched up on his balls like that?\nWalking down the street and ain’t nobody know my name (whoa)\nAin’t no paparazzi flashing pictures, this is great (whoa)\nAin’t nobody judging 'cause I’m black or my controversial past\nI’ma go and see a movie and relax (woo)\nAyy, I’m a Blood but I can finally wear blue (cool)\nWhy his momma calling all the time?\nLeave me the fuck alone, bitch\nWait, if I’m in Dicky’s body, Breezy is who?\nHope my daughter’s in school\nFuck, if I was Chris Brown, where would I be?\nWhat would I do?\n\n[Chorus: Chris Brown]\nI woke up in Chris Brown’s body (oh yeah)\nSomehow this shit turned into Freaky Friday\nBut we got no choice but to turn this bitch sideways\n(Oh yeah, oh yeah)\nI can’t believe that it’s Freaky Friday\nYeah, it’s Freaky Friday\nI’m in Chris Brown's body\nI look at my soft dick with delight, it’s my dream dick\n\n[Verse 3: Lil Dicky & Chris Brown]\nIf I was Lil Dicky in my body, where would I be?\nI’m tryna to find myself like an introspective monk\nI’m balling on the court, oh my god I can dunk\nSnap a flick of my junk\nMy dick is trending on Twitter? Fuck\nNow I’m at the club, I talked my way into getting in\nI look up in the VIP, my goodness there I am\nI signal to him to let me in but he won’t let me in\nI don’t know who that is\nWait, who the fuck he think he is?\nTook a glass bottle, shatter it on the bouncer's head (woo)\nWalked up to that motherfucker\nWait, think it through for a sec\nIf you hurting me then you only hurting yourself\nBut wait, I love myself\nThat was the key, now we're switching back\n\n[Chorus: Chris Brown]\nI woke up in Chris Brown’s body (oh yeah)\nSomehow this shit turned into Freaky Friday\nBut we got no choice but to turn this bitch sideways\n(I can't believe)\nI can’t believe that it’s Freaky Friday\n\n[Outro]\nLil Dicky: Wait, what the fuck?\nEd Sheeran: And now I'm in Ed Sheeran’s body\nIt’s way less cool than being Chris Brown was\nLil Dicky: What the fuck again?\nDJ Khaled: I’m DJ Khaled\nWhy am I yelling?\nKendall Jenner: Huh, I'm Kendall Jenner\nI got a vagina, I’m gonna explore that right now (woo, woo)\nHoly shit, I got a vagina (uh), I'm gonna learn\nI’m gonna understand the inner workings of a woman"}], "artist": "Lil Dicky"}