{"artist": "Vanilla Ice", "songs": [{"title": "Too Cold", "year": "1998-10-01", "lyrics": "[Verse 1]\nAll right stop, collaborate and listen\nIce is back I got a brand new invention\nSomething grabs a hold of me tightly\nFlow like a harpoon daily and nightly\nWill it ever stop? Yo - I don't know\nNow turn off the lights (huh) and I'll glow\nAnd to the extreme I rock a mic like a vandal\nLight up a stage and wax a chump like a candle\n\n[Hook 5x]\nToo cold, Too cold\n\n[Repeat until next verse]\nBut you be talkin' that shit\n\n[Verse 2]\nDance, bum rush the speaker that booms\nI'm killing your brain like a poisonous mushroom\nDeadly, now as I play a dope melody\nAnything less than the best is a felony\nLove it or leave it, you better gain way\nYou better hit the bull's eye, the kid don't play\nAnd if there was a problem, yo, I'll solve it\nCheck out the hook while my DJ revolves it\n\nIce ice baby!, Ice ice baby!\nIce ice baby!, Ice ice baby!\n\n[Verse 3]\nTake heed, Cause I'm a lyrical poet\nMiami's on the scene just in case you didn't know it\nMy town, That created all the bass sound\nEnough to shake and kick holes in the ground\nCause my style is like a chemical spill\nFeasible rhymes you can vision and feel\nConducted and formed, this is a hell of a concept\nWe make it hype and know you wanna step with this\nSwamp plays on the fade, slice like a ninja\nCut like a razor blade so fast, other DJ's say \"damn\"\nIf a rhyme was a drug, you know i'd sell it by the gram\nKeep my composure when it's time to get loose\nMagnetized by the mic and when I kick my juice\nAnd if there was a problem, you know that I would solve it\nCheck out the hook while my DJ revolves it\n\n[Hook]\nIce ice baby\n(throw your hands in the air, let me know you're out there)\nIce ice baby, ice ice baby\n(throw your hands in the air, let me know you're out there)\nIce ice baby, too fuckin' cold\nToo cold, too cold, too cold, too cold\nIce ice baby\nToo cold, too cold\nIce ice baby\nToo cold, too cold\nIce ice baby\nToo cold, too cold\nIce ice baby\nToo cold, too cold", "album": "Hard to Swallow", "image": "https://images.genius.com/966d4b74b972a0d68cebbe7ab3d47bc4.859x854x1.jpg"}]}