{"artist": "Ice Cube", "songs": [{"title": "AmeriKKKa’s Most Wanted", "lyrics": "[Verse 1: Ice Cube]\nIce Cube with Da Lench Mob, I got it goin' on\nA nigga that's livin' in the city of the criminal zone\nOne-time can't keep the law in order\n'Cause everybody's goin' crazy for a quarter\nYou're tuned in to the number one crew in the area\nThe way I'm talkin' I'm scarin' ya\nI'm darin' ya to raise hell and bail and brag and sag\nOr beat down for ya flag\n'Cause if you is or you ain't a gangbanger\nKeep one in the chamber\n'Cause you'll get them thangs put on ya son\nIce Cube has got the 4-1-1\nAll the ol' school house fellows are crooks\nSo I get jealous looks\nThey keep thinkin' did my head grow?\nWill the boys in the hood have to beat down Ice Cube?\nHell no, I'll static son, you'll see it's okay\nI keep my nine anyway\nFor the day one of my homies wanna squab\nI'm still rollin' wit Da Lench Mob\n\n[Bridge]\n(America's Most Wanted)\n\n[Verse 2: Ice Cube]\nBack in the day I did my share of dirt\nSometimes I got away clean, sometimes people got hurt\nBut if you know me, you know that I'm liable\nTo bust a cap 'cause it's all about survival of the fittest\nI'm a menace crook\nI did so much dirt, I need to be in the Guinness Book\nFrom the shit I took from people\nI repo your Vette, then jet\nBack to the criminal set\nI leave clue after clue, but they can't catch me yet\n'Cause I'm slick as slippery\nThey can't get with me, cops ain't shit to me\nI can't dig a pig, so I drop the dogs\nAnd sweat em like sweathogs\nAnd get mad, mad 'cause I'm the nigga that flaunt it\nAmeriKKKa's Most Wanted\n\n[Verse 3: Ice Cube]\nAiyo, here's what the poster read\n\"Ice Cube is wanted dead\"\nThat's all it said\nI put heads to bed and fled the scene wit all the green\nHear shots and si-reens\nWhen I fiend, first they yo' rings, now they my rings\nSo give it up punk and then I just\nPut another jack in progress\nIt's the American way\n'Cause I'm the G-A-N-G-S-T-A\nIce Cube, a motherfuckin' klepto\nAnd tried to catch the early bird but they slept, so\nWho gets the worm?\nAnd if I'm caught in a trap, wou know I'ma beat the wack\nWith a payoff, cop gotta lay off\nFBI on my dick, stay off!\nI'm not a rebel or a renegade on a quest\nI'm a nigga with a 'S' on his chest\nSo get the Kryptonite 'cause I'm a rip tonight\n'Cause I'm scarin' ya, wanted by America\n\n[Interlude]\n(Aiyo Cube man, they on your ass)\n\n[Verse 4: Ice Cube]\nWord, but who the fuck is Herb?\nIt's time to take a trip to the suburbs\nLet 'em see a nigga invasion\nPoint blank on a Caucasian\nCocked the hammer, didn't crack no smile\nTake me to your house, pal\nGot to the house, my pockets got fat, see\nCrack the safe, got the money and the jewelry\nThree weeks later, I'm at the P-A-D\nHad a little fly ass bitch wit me\nSittin' in the den, yo it couldn't be\n(What up, G?) Saw my face on TV\nDamn (oh shit!) I didn't know I lucked out\nStruck out, I gotta get the fuck out\nPacked my bags and tried to hit the door when\nThe ol' bitch down the street must've turned me in\nCos the feds was out there ten deep\nI got hassled and gaffled in the back seat\nI think back when I was robbin' my own kind\nThe police didn't pay it no mind\nBut when I start robbing the white folks\nNow I'm in the pen with the soap-on-a-rope\nI said it before and I'll still taught it\nEvery motherfucker with a color is most wanted\n\n[Outro]\nAmeriKKKa's Most Wanted, uh,  reports that Ice Cube is the leader of the, uh, Lench Mob. Uh, also in the group they have J-Dee, Chill, T-Bone, Yo-Yo, Del, K-Dee\nSounds like a black thing", "image": "https://images.genius.com/ad9591d1ec30bd6ec342549cbe68949c.630x630x1.jpg", "album": "AmeriKKKa’s Most Wanted", "year": "1990-04-17"}]}