{"artist": "Boogie", "songs": [{"album": "The Reach", "title": "Wit Me", "year": "2015-06-24", "lyrics": "[Verse 1]\nPop, pop, another nigga got his dreams shot\nWatch how you textin' man, that bitch might have a screenshot\nAnd it's crazy how the plot twists\nSame bitch that used to say I got lisp\nTrying to be the pilot of my cockpit\nNo, no no, no you stay grounded with them basic hoes\nYou walk around with like a thousand bros, won't relate to those\nNiggas out here saving hoes, save that for the suckas with the cape\nCan't just leave the thirsty bitches by the sink\nHad to hop up out the tank, I can't be fuckin' with these fishes\nGo on get a hundred like, I promise you will have the bitches ho\nThat shit crazy how they twist it, how we hit 'em an dismiss 'em\nAnd they turn us to the villain huh\nFuck it, either way she swallow\nProlly take a selfie, now she think that she a model\nMan lets talk about these trends, the ones these niggas follow\nHow this nigga probably broke, at least he came in with a bottle\nI'm like \"Nigga you weak, you think you poppin' off that shit that you tweet?\nYou buying followers, you niggas is creeps\nMan my family up in Compton and you know my homies up in the Beach\nBut either way it go, I'm up in these streets\", that's what I told him\n\n[Hook]\nYou see, back when I was trying to get a play\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\nBefore I even had a tape, before Thirst 48\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\nNo, no, ain't nobody have my back yeah that's what I'm laughing at\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\nNo, no, now I'm where the ratchets at, it don't even matter then\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\n\n[Verse 2]\nPop pop, another nigga got his boot snatched\nWatch how you texting, she might throw you in that group chat\nWith pictures of your thirsty ass\nNow you got your panties in a bunch from how you sackin'\nAnd she laughin' at your Murphy ass\nBeep beep, riding past another wannabe\nDon't be hiding from the truth, it ain't what you wanna see\nI done dogged a couple bitches, like you know I had to flee\nTold shawty like \"get your paws off my tee\"\nAfter everything you see, you mean to tell me you gon' wife her?\nIt's cool to like that pic, but you mean you really like her?\nNo not me, I'm too smart, play no part\nCause these bitches got no heart\nWe've been finished from that start\nI see you acting like a narc, how you cuffin' all the bad bitches?\nNo not Boogie, you better got and ask my past bitches\nLike why the fuck you think the rats winning?\nPucker up for nothing, I ain't into all that ass kissing\n\n[Hook]\nYou see, back when I was trying to get a play\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\nBefore I even had a tape, before Thirst 48\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\nNo, no, ain't nobody have my back yeah that's what I'm laughing at\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me\nNo, no, now I'm where the ratchets at, it don't even matter then\nThey wasn't fuckin' wit me, they wasn't fuckin' wit me", "image": "https://images.rapgenius.com/329e9e692537ac6301adb12b1fef2ab9.300x300x1.jpg"}]}