{"songs": [{"image": "https://images.genius.com/20598b801c3dafa38d796c0b2ae97899.1000x993x1.jpg", "lyrics": "[Verse 1: Mac Dre]\nI got this bitch on the corner, she hella cute\nI'm always digging in her bra and getting hella loot\nWhats happening? I'm Mac Dre the bitch wetter\nAnd pimping is one of the many ways I get cheddar\nOn a bitch back like a thick sweater\nYou know I represent that 16th letter\nThe P, pimping, West Coast pimping\nPockets so fat the motherfuckas got me limping\nIt's in my blood, I'm a Mac from birth\nA West Coast cutthroat from the turf\nI'm in her purse more than she be\nThat's his wife but I be fucking more than he be\nI go gorilla, that's on the real'a\nAnd the Pittsburg I know don't got no Steelers\nIt's nothing new, we old school like retro\nAnd this gangsta mac shit on this West Coast\n\n[Hook 2X]\n(Straight gangsta mac) (Repeat 3X)\n(Straight) West Coast\n(Straight gangsta mac but sometimes I...)(Get Stupid!)\n\n[Verse 2: Yukmouth]\nI'm a gangsta mac, I'll break a batch\nSend a hoe for the dough, Yuk make her fetch\nBring it back like we playing catch\nA trick dry slurps licks, guns to your head like playing roulette\nPimps follow me copying what I do next\nWith the coupe on 22's and knock a new bitch\nYellow and blue wrist, yellow and blue kicks\nI used to move bricks and make 'em do flips\nNow, I pimp bitches that's in porno movies\nWhile a model bitch feeding me sushi rocking Gucci\nI rock the Louis, model or a groupie\nYou wanna fuck with Yuk, bitch socking it to me\nI'm into jewelry, bitch, ice my wrist up\nPut her on the internet and the strip club\nAnd I met her in the strip club\nNow she fucking with a rich thug, Yuk stay chipped up, what!\n\n[Hook]\n\n[Verse 3: Turf Talk]\nOn Chevy you should see the guts in him\nAnd he cut to fit the 26-inch rim (Dayuumm!)\n3-51, you should see when it passed ya\nPushing on your gas but he's a little bit faster\nFuck what you thought got money here\nMy speakerbox shaking up my rearview mirror\n(Baba! Baba! Baba!)\nSan Quinn told me half these niggas is acting\nJust be about your business you the West Coast Vaccine (Westsideee!)\nSiccness dot net, you diss, you get wet\nPut money on your head for disrespecting this vet\nI only feel comfortable around my hoodlums\nWhy you own a gun, mayne? Y'all ain't gon' shoot em'!\nI was raised by the low lows, dreadlocks and peacoats\n(Hell yeah we smoke weed!) Keep sherm and in snow\nYou catch me posted where the goons is at\nShoot you from the front, leave a hole in your back\n\n[Hook]", "year": "2008-02-05", "album": "Starters In The Game", "title": "Gangsta Mac"}], "artist": "Mac Dre"}