{"songs": [{"image": "https://images.genius.com/dca59ead4748e19253713f7bea3fa4f0.500x500x1.jpg", "album": "Generation Gaming XIV", "title": "Chill Winston", "lyrics": "[Intro]\nBanana\nBanana, banana\nBanana, banana\nI fancy a banana\n\n[Verse 1]\nAy, mankind's finest age\nWill be when animals are no longer confined to cages (yeah)\nSo let's find a way, 'cause\nA gorilla isn't a violent ape\nUntil you give it ammunition, trigger primal rage\nMeaning your life's arriving at its final stage\nLook, your spine'll break, that's what I'm trying to say\nHe can suddenly change from all sedate to more enraged\nThan a horny Gigantopithecus from a prehistoric age\nBut his call of nature's way more than just to fornicate\nMore than brawn, more than brain\nBorn in jail and enslaved\nAll the same, saw a way\nTo maul and break the ball and chain\n\n[Chorus]\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nAll gorilla, no filler\nPart guerilla killer, part Nobel Prize show winner\n\n[Verse 2]\nSo when he's setting up a clever experiment (then?)\nThat's when this fellow's in his chemical element (yeah)\nDoes everything for the betterment of everybody\nTo be honest, there's no better buddy, 'cause he's bloody excellent (yeah)\nIf you're desperate for actual protection\nThen I guess that it's the natural selection\nNo matter whatever you are\nIt's rare that you're really as hard as a gorilla in armour\nWe'll win in an instant when Winston's bananas\nIf you find you're in a dire predicament, don't rely on ignorance\nGet the iron fisted scientist to try and fix it up\nNormalizing vital signs and firing cylinders to silliness\nThis is survival of the fittest, gorillas are winning it\nCome in his kingdom, killing his kinsmen\nYou're gonna take an L as big as Hillary Clinton\nThat's not cool, like calling a Native American an Indian\nOr just living in Swindon\nWhat's weirder than the appearance of Tilda Swinton?\nAll will be revealed, hear me tell the tale of Winston\nHe's a nutter, hugging a tub of peanut butter\nWrecking the base on any stage like he was Geezer Butler\n\n[Chorus]\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nAll gorilla, no filler\nPart guerilla killer, part Nobel Prize show winner\n\n[Verse 3]\nYou might find him in the lab (yeah), writing in a pad\nOr outside going quite gorilla mad (rah)\nFrightening the baddest of the fighters in the match\n'Til they're begging for him to be nerfed\n\"We'd like another patch!\" (eugh)\nBut it might come back to bite him in the ass\nThey still find they're coming last, they should try another class\nFact: when Overwatch comes at you with a giant posse\nYou'll see gorillas in the midst, Dian Fossey\nDoomfist was an opportunist\nRuthless, 'til Winston came along and gave the plot a new twist\nStudying a lexigram to journey to the west and grab\nA tesla cannon barrier projector, get the best of Talon\nGenetically altered to wreck and never falter\nSuccessfully setting up a drone to rock Gibraltar\nFor Overwatch, it ultimately led to their recovery\nImagination is the essence of discovery\n\n[Chorus]\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nAll gorilla, no filler\nPart guerilla killer, part Nobel Prize show winner\n\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nWhoo!\nBananananananananananananananananas\nAll gorilla, no filler\nPart guerilla killer, part Nobel Prize show winner\n\n[Outro]\nBanana, banana\nBanana, banana\nBanana, banana\nBanana, banana\n(Banana)\n(Banana)\nI fancy a banana", "year": "2017-10-19"}], "artist": "Dan Bull"}