{"songs": [{"lyrics": "March\nThe more the merrier\nGet a couple or more to carry you to the burial\nF-R-E-S-H\nFresh to death and keep it def to the left\nWell it was Capricorn, Virgo, Aquarius\n(Check!), Cancer, Leo, Sagittarius\n(Check!), Pisces, Libra, Scorpio, Aries, Gemini, Taurus\nLet 'em die for it\n\n[Aesop Rock]\nDelicate freak show alert the frame\nBash all flags where the mag spin park\nCorroded by the volts that jolt the cold vein\nBoogie down kits to slip past the guard\nDef with a mascot of radical mass\nMegaphone fuzz and a woofer on fritz\nWe are not trained to divert the crash\nBut march face first with a prayer for the blitz\nStand up for the cinema fire, simian ire\nCold shimmy for the cinnamon sky;\nIntimate eyes loop all known alleys\nScoop the bounty like daddy hires Bazooka to murder Ralphie\nI curdle with burnt milk, pariah sigh, honor piranha money\nCount it with the knuckle that hustle bread out a copper-tummy\nOne of these rebels could level the marked city\nBut the N.Y. uber alles governor's picky\nI'll be the jenky Jesus for the species you bleed with\nUltra, soldier poach the folklore\nJump guns through the ninth gate\nJump guns like a noon six burner lit up on the ninth pace\nEven set among a portion conformed to the blind stage\nNever lured by the formal watching imported wines age\nWe bow to the gusto mustered by the mecha-bot\nPlowed by the public, ushered out the letterbox\nWowed by the subject punctured by the helicop\nBoy meets vermin: the widescreen version\nHeadaches, nausea, vomiting, facial paralysis\nThese are a few of my favorite venomous side effects\nMamba, Water Moc, Pit Viper, Diamond Back\nAnaconda, Boomslang, Cobra, bite 'em back\nSpinal tap crabs to the clapper\nAesop Rock is the Cadillac of natural disaster\nPush that button\nEverybody gotta push something\nThat's why the envelope is where it wasn't\nI work with the builders, whittle my gorilla military\nAnd fizzle 'em through the vigilante filters\nWho lamps left of the toggle?\nHow'd they fit that ninja in a bottle?\nDone a hundred million motherfuckers with they hands out\nVersus a walking zipper bomb trying to keep the man down\n\nGet up (get down)\nSit up (sit down)\nIt's either fancy footwork (or get bit by the hounds)\nFace up (face down)\nLaced up (laced down)\nIt's either fist to the sky (or get bit by the crowd)\nWell it was Capricorn, Virgo, Aquarius\n(Check!), Cancer, Leo, Sagittarius\n(Check!), Pisces, Libra, Scorpio, Aries, Gemini, Taurus\nLet 'em die for it\n\n[Aesop Rock]\nI was chewing my tongue out of my mouth one day\nWhen the blood in my beard hit the dirt by the blazers\nWould have said 'curb it' like any nervous habit\n'til maverick told me the coyote pack could smell the wound for acres\nAnd labor to cater fang to fisherman gut critters\nOblivious to the glimmer of innocent duck feathers\nFuck it\nWant a carnivore war? Bet\nI'll be at the Bronx Zoo with a lock pick kit\nOn the eject for cockpit bench, helicop clip\nNazi cops on kamikaze belly flop shit\nRoger, hop-fence-kill-a-crop, monster\nWe are the tired and poor, we come for your water\nBoom!\nBounce when the church corrupt\nWhen the mayor knuckle dust city worker bugs\nWhen the stars finger babies like I flirt with sluts\nYou'll see the fire engine red fox ears perk up\nMetal kettle unsettling treble howl, settler trembling\nMeasuring mellow on the levitate off the mezzanine\nNever seen a ton of bricks dressing clean dapper\n'til it's pin stripe and skull chunk forty stories after\nAnd U.S.A. on a Ketamine disaster\nCane for stress\nCrack if the former left you unimpressed\nNow pardon me if part of me heart of an oddball, but damn\nKumba-fucking-ya, dog\nTerminally alienated and bent awkward by the bought\nPrepped package of the slickest spin-doctors\nRaised where the paranoid hide tools proper\nLike suspicious cargo in a high school locker\nAnd it looks like war, quacks like war\nSo it's Occam's Razor and I'm swayze out the door\nA hundred million motherfuckers hold me back\nThe hand cannons won't ask 'bout your zodiac, boy\n\nGet up (get down)\nSit up (sit down)\nIt's either fancy footwork (or get bit by the hounds)\nFace up (face down)\nLaced up (laced down)\nIt's either fist to the sky (or get bit by the crowd)\nWell it was Capricorn, Virgo, Aquarius\n(Check!), Cancer, Leo, Sagittarius\n(Check!), Pisces, Libra, Scorpio, Aries, Gemini, Taurus\nLet 'em die for it", "title": "Zodiaccupuncture", "album": "Fast Cars, Danger, Fire, and Knives", "image": "https://images.genius.com/2434fa81c5b8e4d6767c0b655d69bd1b.498x500x1.jpg", "year": "2005-01-01"}], "artist": "Aesop Rock"}