{"artist": "50 Cent", "songs": [{"album": "Before I Self Destruct", "image": "https://images.genius.com/eebe68987c98d3b1f9b4166f6ac4d3f7.1000x1000x1.jpg", "title": "Do You Think About Me", "lyrics": "[Produced by Rockwilder]\n\n[Intro]\nD-D-Do you, do-do, do you think about me?\n\"Do you, do you, do you think about me?\nDo you think, do you think, do-do-do you think about me?\nDo you, do you, do you, do you think about me?\n\n[Verse 1: 50 Cent]\nYou think about money when you think about me, huh?\nIt's why my ex my ex, you don't wanna be her\nShe used to have the Beemer, now she own a sneaker\nI had her eating lobster, now she eating pizza\nI think about Easter when I think about Keyshia\nShorty stay fly, that's why I keep her\nRound like the reefer, brown Mona Lisa\nShe good if I leave her, she got her own Visa\nThink about them when you think about fronting\nThink about stunting when you think about me\nI'm the boss, Bentley or the Porsche?\nOverseas see jet ski's slide across\nI love the way you dress, now take it off\nPut your legs high on my shoulders of course\nI'm racing through your mind, but you already lost\nI'm at the finish line and you're a friend of mine\nCome on, let's ride\n\n[Hook: Governor]\n(Do you think about me?)\nJust a little bit, every now and then\n(Do you think about me?)\nGoddamn girl, we used to be friends\n(Do you think about me?)\nJust a little bit, just a little bit\n(Do you think about me?)\nJust a little bit, just a little bit\n(Do you think about me?)\n\n[Verse 2: 50 Cent]\nI think like a hustler, I'm thinking 'bout a shipment\nShe thinking I'm her hustler, she thinking 'bout commitment\nIt's like Paul McCartney's stuck in my head\nHe fell in love with a bitch who walked away on one leg\nShe ain't even have to run to get away with the bread\nThat's some fucked up shit, think about that, kid\nI'm thinking what this bitch thinking when she take me to court\nI pay my child support, what the fuck she want?\"\nThis relationship shit is too much for me\nI wanna fuck, be friends and live comfortably\nShe wanna shine and blow mines on shopping spree's\nShe should have what she want, just not from me\nI'm thinking 'bout my future, she brought up my past\nShe don't care about me, she just want some cash\nI'm thinking damn, girl, we used to be friends\nHow did shit become all about ends?\n\n[Hook]\n\n[Verse 3: Governor]\nDo you think about me? (Do you think about me?)\nI know you think about me\nYou got to remember all the good times we had\nJust a little bit, just a little bit\nJust a little bit, just a little bit\nJust a little bit, just a little bit\nJust a little bit\n(Do you think about me?)\nI remember when you told me\n(I know you think about me)\nThat I'll always be special to you, darling\nYou were so special to me, do you think about me?", "year": "2009-11-09"}]}