{"artist": "Peewee Longway", "songs": [{"album": "Mr. Blue Benjamin", "title": "Keep One Cocked", "image": "https://images.genius.com/3c35598e5643a1aa6719367645d189e1.400x400x1.jpg", "lyrics": "[Intro]\nLets get it\nJ nasty engineered\n\nKeep one cocked too\nI’m strapped and my engineer strapped fuck nigga\n\n[Hook: PeeWee Longway]\nI keep one cocked inside the head\nAnd I'm a motherfuckin' felon\nAin’t the first to fill up, gas bags what I’m sellin\nI got Skippers on my feet\nYou purchase fishscale we gon sell it (Get Off)\nOvernight the narcs inside the box my plug just mailed it\nBoy don't you tell it\nBoy don't you tell it\nOvernight the narcs inside the box, my plug just mailed it\nBoy don't you tell it\nBoy don't you tell it\nI got skippers on my feet\nYou purchase fishscale we gon sell it (Get On)\nI got bricks like I'm a vato go to work like I’m [?]\nPussy nigga tellin' tote that snitch I pick the Jewelry Up\nQuarter million worth of Jewelry\nTold the judge don’t tote no Burr\n20 OG Gas Bags went and spent it on my ear\n\n[Verse 1: PeeWee Longway]\nI work the choppa-later like a calculator when I juug\nEvery time I land in Cali they call me Longway Blue Sug\nThats the city, that I just mailed it, I’m the plug\nBoy don’t you tell it\nThey say, she say, no comprende\nI go Givenchy my slippers\nSnatchin’ bricks up out the river\nCall me Longway John Silver\nI keep one cocked one Nasty Dealer\nLongway one low-life ass nigga\nGold mouth shawty\nI make the snitches cry a river\nBeat the blocks up out the building\n2 gun shawty John Dillinger\n\n[Hook: PeeWee Longway]\nI keep one cocked inside the head\nAnd I’m a motherfuckin’ felon\nAin’t the first to fill up, gas bags what I’m sellin\nI got Skippers on my feet\nYou purchase fishscale we gon sell it (Get On)\nOvernight the narcs inside the box my plug just mailed it\nBoy don’t you tell it\nBoy don’t you tell it\nOvernight the narcs inside the box, my plug just mailed it\nBoy don’t you tell it\nBoy don’t you tell it\nI got skippers on my feet\nYou purchase fishscale we gon sell it (Get On)\nI got bricks like I’m a vato go to work like I’m [?]\nPussy nigga tellin’ tote that snitch I pick the Jewelry Up\n\n[Verse 2: LoLife Blacc]\nHey I do dirt all by my lonely, cause these niggas they gone tell it\nI just hit a lick, them bricks, I break em down then I sell it\nMove them bricks daily, snitches get found just like brenda baby\nIn St. Louis, when them packs touchdown just E.I. like I'm Nelly\nHavin’ paper work, I’m creeping’ just like Kane for them weights\nStrip yo ass like Blue Flame, then we send ya home naked\nTo a snitch a lethal weapon pen a he the type to watch lethal weapon and then Danny Glover is his favorite detective\nBoy don’t you tell it\nBoy don’t you tell it\nBeat you home be in yo yard then them pistols get to yellin’\nI’m a convicted felon still ridin with it\n\n[Hook]", "year": "2016-01-28"}]}