{"artist": "Waka Flocka Flame", "songs": [{"year": null, "lyrics": "[Intro]\nIce neck, wrist fist, yes, I'm balling out, bitch\nTron, Goose, Rosé, yes, I'm drunk as fuck, bitch\nIce neck, wrist fist, yes, I'm balling out, bitch\nTron, Goose, Rosé, yes, I'm drunk as fuck, bitch\n\nIt's that young nigga movement, mane\nYou know how we doin' it, man\nAlright, come on, man, stop bullshittin', nigga\nI do this shit, nigga\nFlocka Robinson, nigga, like my New York buddies say\nFlocka AKA 'I Might Rob You, Son'\n\nThey gonna say they hard, I'ma say I'm harder\nThey gonna say they grind, I'ma grind smarter\nThey gonna say they shining but the lights is on me\nOnly three things: stunt, shine, and flex (Trapaholics)\n\n[Chorus]\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out\nFuck Waka Flocka Flame, call me Waka Flocka Flex\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out\nFuck Waka Flocka Flame, call me Waka Flocka Flex (Damn, son, where'd you find this?)\n\n[Verse 1]\nIce neck, wrist fist, yes, I'm balling out, bitch\nTron, Goose, Rosé, yes, I'm drunk as fuck, bitch\nBalling is my hobby, stunting is my role model\nGetting guap is my job and Gucci is my right hand (Real trap shit)\n\"Waka Flocka Flame, you my favorite rapper, bruh\nCan I trap with you, bruh? Juug and cap like you, bruh?\nCount stacks like you, bruh? Dress So Icey like you, bruh?\nCan I flex? Can I shine? Can I ride like you, bruh?\"\nYou can do it, shawty, you can do it, shawty, grind hard\nWork hard, think smarter than the average nigga\nGo ball for the cabbage, nigga\nMarriage, nigga? Not, not, not me, my nigga\nWork, work, work, my nigga (We make it look easy)\nFlex, grind on these niggas\n\n[Chorus]\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out\nFuck Waka Flocka Flame, call me Waka Flocka Flex\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out (Swish)\nNow I'm balling out (Swish), now I'm balling out (Swish)\nFuck Waka Flocka Flame, call me Waka Flocka Flex (Trapaholics)\n\n[Verse 2]\nIn the trap with the yolk, got the wrap and the choke\nI love weed smoke, shawty, so please let me smoke\nEvery rhyme a nigga wrote, I don't need no ghost writer\nThis that flex, this that shine, this that ball out music\nWe the first b-ball team with a woman for a coach\nPG: Frenchie, SG: Young Juice\nSmall forward: Wooh da Kid, power forward: Waka Flocka\nCenter, center: Gucci Mane\nHalf time, I'ma flex\nWe at a full court press, so you know we got blocks\nLove to shoot, love to shoot like my name was Flocka Kobe\nThrowing loot, throwing loot, shawty, I got hella money\nWalked up in the store, asked her what she wanted\nShe point at shoes, she point at Flocka\n\n[Outro]\nNow I'm balling out, Flocka, I'm balling\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out (Hey)\nFuck Waka Flocka Flame, call me Waka Flocka Flex\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out (Hey)\nNow I'm balling out (Hey), now I'm balling out\nFuck Waka Flocka Flame, call me Waka Flocka Flex", "image": "https://images.genius.com/e14bf400c53ca90683116a31f2ff1d99.1000x1000x1.jpg", "album": "Mollywood", "title": "Ballin Out (Mollywood)"}]}