{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "Let the Record Skip", "album": "Hannicap Circus", "lyrics": "I'm ripped, I'm on an acid trip\nMy DJ's in a coma for lettin' the record skip\nLettin' the record skip\nLettin' the record skip\nLettin' the record skip\n\nVile, sick, son of a bitch\nSay shit three times in a row like I don't give a shit (bitch! bitch!)\nGod dammit son of an ass\nLadies and gentlemen, Bizarre's a dumb ass!\nSayin' cus words like too short\nEatin' pork of all sorts in the middle of New York\nBeatin' my meat, watchin' Sesame Street\nFuck a sheep, I'll bust in my little niece\nShe's so sweet, a six year old freak\nWanted me to bust right between her ass cheeks!\nYou ever met a guy with cancer who refused chemo?\nCall a doctor a homo and do a two week promo!\nThat's me, a fucking G!\nI'll probably be dead before the end of this cd!\nAnd VD? I probably caught it\nCrack in your neighborhood? I probably brought it!\n\nI'm ripped, I'm on an acid trip\nMy DJ's in a coma for lettin' the record skip\nLettin' the record skip\nLettin' the record skip\nLettin' the record skip\nI'm ripped, I'm on an acid trip\nMy DJ's in a coma for lettin' the record skip\nLettin' the record skip\nLettin' the record skip\nLettin' the record skip\n\nYeah! when this Hennessy get into me\nMan I talk shit until I lose my mind like Kennedy!\nThe bottom line, I ain't feelin' your ass!\nSo when the pumps fill your car, it ain't to fill it with gas!\n(nigga!)\nIts Young Miles, I'm the boss of the crime!\nYou don't know another nigga that\u0092s as hard as I\nI clap a nigga in his ride then a toss the nine\nI'm at your wake with a bomb, now your coffin flyin'!\nYou tryna say this ain\u0092t the bestest record?\nMan you got it fuck up like sex in heaven!\nAnd I can gun you down, I don't fuck around\nI have you sleepin' up underground!\nSo when your boy load the lead in the pipe\nBitch niggas better run like they scared for they life!\nAnd when I pop the thang\nEven the niggas in the crowd catch shots like a hockey game!\n\nI'm ripped, I'm on an acid trip\nMy DJ's in a coma for lettin' the record skip\nLettin' the record skip\nLettin' the record skip\nLettin' the record skip\n\nI'm a grown ass man that\u0092's an obsessed Usher fan\nGonna rub his back and put on his head band (Usher!)\nMid-twenties, still workin' at Wendy's (May I help you?)\nSniffin' coke with my girlfriend Kemi\nFuck a cup, I'll piss in your butt!\nTell my grandfather shut the fuck up\nWhile I piss in his butt!\nCan't be around kids, my brains is splattered\nI ain't readin' books, I'm fillin' on pampers\nBizarre don't give a shit, fucking a bitch eighty-six\n(He just told you he don't give a shit!)\nMy grandmother eighty-six and my grandfather would nut in his butt\nI'm a god damn nut!"}], "artist": "Bizarre"}