{"songs": [{"title": "Forget the Fame", "album": "Undaground Legend", "year": null, "image": "https://images.genius.com/4366a7f059e7e7dfdc95237780f7c435.500x500x1.jpg", "lyrics": "(Lil' Flip)\nI come from a hood where everybody standing on the corner\nWhat you need? some weed, speed, or some marijuana?\nYou can get it right here or get it down there\nBut when the laws pull up get away from 'round there\nNow niggas think a nigga started changin\nJust cause a nigga gotta platinum chain hanging\nI still got the same niggas that I'm down with\nIf a nigga owe me money we gon'shoot down shit\nI use to sell work I use to sell pints\nBut now I'm doing shit I got three million in the bank\nI done made alot of moves and payed alot of dues\nAnd if you fuck with me, you might make tonight news\nNow niggas get on TV and forget they partnas\nThe ones who keep it real come to yo shows with the choppas\nThe one who bring that drank, bring that weed to yo house\nThem the niggas down wit me that represent the South, uh\n\n(Chorus)\nI want the money\nI don't give a fuck about the fame\nNo matter how rich I get Lil' Flip will never change\nI want the money\nI don't give a fuck about the fame\nI do this shit so my patnas don't have to slang cain\n\n(Lil' Flip)\nNow everytime I get back somebody went to jail\nBut they taught us don't go to school and you will fail\nI didn't go to college but its money in my wallet\nAnd I just bought a Jag with zero mileage\nNow people like \"Flip, you know I'm tryin to rap\"\nBut you was hatin on me, nigga you might get slapped\nYour telephone tapped, you got the hood hot\nMatter of fact it don't look good for you to be standin on the block\nNigga what about the cops? They rollin and lookin\nAnd everybody know what you sellin and cookin\nSo get yo mind right nigga stay out the streets\nYou see what I did, now I play with these beats\n\n(Chorus)\n\n(Lil' Flip)\nI'm like a hundred-dollar bill I'm hard change\nAnd now its funny everybody ain't acting the same\nRule one never let niggas learn your business\nRule two never ever ever burn yo bridges\nI had niggas that was hatin smilin in my face\nWay before \"Buy the Car, Buy the House\", and \"DiamondsNyaface\"\nNow they see me in the streets like \"I wanna do a song\"\nNigga yous a ho cry babies go home!\nCause you ain't selling records don't get mad\nCause you see me ballin hard in a drop top Jag\nWhen you see me at The Source just chunk up a deuce\nCause I represent Cloverland jumpin out my Coupe\nI'm still gon' be the same nigga on the scene\nI'm still gon' be the only freestyle king......\n\n{*DJ scratches*} I'm still gon'\n{*DJ scratches*} still... still gon be the only\n('Another chop chop productions')\n{*DJ scratches*} free... {*DJ scratches*} freesty..\n{*DJ scratches*} I'm still gon' be the only free style king...\n{*DJ scratches*} only only only only fre{*mumbling*}ee style king\n{*DJ scratches*} ...free style king\n{*DJ scratches*} still gon\n{*DJ scratches*} ly freest..king.. I'm still gon\n{*DJ scratches*} I'm still gon be the only\n{*DJ scratches*} styl {*DJ scratches*} still gon be\n{*DJ scratches*} I'm still gon' be the only free\n{*DJ scratches*}"}], "artist": "Lil Flip"}