{"songs": [{"title": "BET Hip Hop Awards Cypher #3", "album": null, "year": null, "image": "https://images.genius.com/48e9a0e02d85ec6db66796c8a1a592e1.499x499x1.png", "lyrics": "[Verse 1: Lady of Rage]\nI never played, so before first grade I skipped the playpen\nPen game was flame before I learned to tie my laces\nRage is where the plague is, no containing\nSick with the spit that I spit, I inflict contagion\nInhale the ether\nThey can't breathe easy when I'm around\nI leave them a Lil' Weezy like the son of Cita\nHa, I'm Chiquita, bananas\nY'all monkeys wouldn't bust grapes\nAhh, I roll with gorillas, for real-a, my nigga, bandits\nPlanet of the Apes\nRise, all hail Queen Kong\nPeons that becoming soft enough to stuff them out your ding-dongs\nAh, I'm in it to win it 'til I become\nThe hottest chick to run the third rock from the Sun\nLyrically, you would be a fool to fight\nWith the Robin Givens I'm spitting shit on two of the mics\nYikes, I'm goin' in like a lifer\nStep into your radius and decipher your cypher\n\n[Verse 2: Blind Fury]\nLet me try it\nThis the Big Payback, stupid\nGet lost, I'm a big boss like Rick Ross's Maybach Music\nI make cats lose it\nWhen they realize they part of the reason I'm starting to sleep on rap music\nI'm AJ with the style, cause I go free\nNow everybody and they mama want to know me\nI'm on that OG, feeling like I'm suppose'ta\nCame to ruin it, and I'm doin' it 'til it's over\nIt's gon' take a little bit more than this to move me\nI'm on BET more than the Biggie movie\nAin't looking for no girlfriend, just a clique of groupies\nCall me Wiz, cause tonight I'm tryna get the chewy\nI love New York, but out of town's sweeter\nI cheated on Irene 'soon as I found Keisha\nSo, 'nuff respect to alla crew in all d'area\nRight 'ere on the street is where we-a bury ya\nBoom\n\n[Verse 3: Dom Kennedy]\nEven though I can't see me\nI know I look good right now on your TV\nThrow my shades on, call me young Stevie\nLeimert Park legend, we just make it look easy\nAnd I'm counting my money, everyday sunny\nI earned my spot, you ain't taking that from me\nTell them fine girls start shaking that for me\nWest Side get the money, start making that for me\nIt's the unfadeable\nWho the best is debateable\nBut I do it with no label though\nYea, I said we going all night wit' it\nProlly ain't seen this since Suge Knight did it\nGirl you look good, tell her get right wit' it\nI can't do a show in your city if the price isn't\nWhen I walk in, I can tell that they feeling me\nI hear the girls say that's Dom Kennedy\n\n[Verse 4: Skillz]\nIf you a rapper from Virginia, meeting me should give you the chills\nI'm the reason that the world expects you to have some skills\nY'all better call Rozay, dude\nCause this verse gone need like nine uhh's and twenty-two whoo's\nI ain't kidding around\nYou got BET in HD? Well you might want to hit that now\nCause I'm never home, I stay gone\nY'all was everywhere, now you never there, payphones\nClutch fast, spit mustard gas\nAnd when haters say my name, it sounds like crushed glass\nThey students, I crushed the class\nPlus, y'all never came in like Jay-Z's mustache\nTop me? Don't be crazy, chump\nUnless one of these guys decide to show a baby bump\nShout Mr. Hill and Ms. Lee\nOh, and the award for who destroyed the cypher?\nThat goes to me"}], "artist": "The Lady of Rage"}