{"songs": [{"album": "The Leak", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg", "year": "2006-03-28", "title": "Front Back", "lyrics": "[Sample: Eazy-E]\nBack, front back, fron-front back, fron-fron-front back, side, side\n\n[Intro: T.I. + Mannie Fresh]\nLadies and gentlemen!\nT.I.P., aye!\nFre-fre-fre-fresh!\nI know a lot of y'all niggas out there, man, who ain't up on this down south shit\nProbably wondering what the fuck you listening to right now, ahah!\nKing amongst kings! But it's an absolute honor and a pleasure, you know what I'm sayin'?\nTo bring you some gangsta shit of catastrophic proportions\nYeah!\nAll the UGK alumni, like myself, know what this is, man\nHey, Bun! Pimp C, nigga!\n\n[Verse 1: T.I.]\nI gotta '66 Impala so fresh\nWhite top, burnt drop wit' the choppers on deck\nFuel exhaust, and a motor out a ninety-four 'Vette\nFish bowl, televisions pimpin I ain't done yet\nI got the checker red leather and I'm sittin on chrome\nOn 26 inches just to get my roll on\nOne of Jeezy's songs on, make them bitches get low\nI get that ass raised up, like Dr. Dre six four\nHey, come up in my hood, bet them bitches know Tip\nIf you tell 'em you wit' him, all them bitches gon strip\nIf I show up in yo' hood, I bet you niggas won't trip\nOnce I empty out this clip, I bet you niggas gon' dip\nOr get hit up in yo'...\n\n[Hook: Eazy-E + Pimp C]\nBack, front back, fron-front back, fron-fron-front back, side, side\nBack, front back, fron-front back, fron-fron-front back, side, side\nNever let ho-ass niggas ride\nBack, front back, fron-front back, fron-fron-front back, side, side\nBack, front back, fron-front back, fron-fron-front back, side, side\nAnd we never let ho-ass niggas ride\n\n[Verse 2: Bun B]\nIt's the Gulf Way Boulevard gangsta\nSwangin on T.I., S's and Fo's (S's and Fo's)\nPirellis and Blades and 'em crews of hoes\nI'm a playa, you can tell by how I choose my pose\nWhen it gets to swangin on the curb, you might lose ya toes\nDedicated to the slab (slab), the dunks (dunks), the drops (drops)\nThe candy painted cars wit' the chopped off tops (off tops)\nNow put ya diamonds up against the wood wheel\nLean back up on ya leather, chunk a deuce, and show your grill\nKeep it trill, this the south baby, Texas and GA\nT.I. reppin for Bankhead, I'm reppin for P.A. (for P.A.)\nNow pop ya trunk, get it crunk, it's time to ride\nShow them boys you got that front back and side to side baby\n\n[Hook: Eazy-E + Pimp C]\nBack, front back, fron-front back, fron-fron-front back, side, side\nBack, front back, fron-front back, fron-fron-front back, side, side\nNever let ho-ass niggas ride\nBack, front back, fron-front back, fron-fron-front back, side, side\nBack, front back, fron-front back, fron-fron-front back, side, side\nAnd we never let ho-ass niggas ride\n\n[Verse 3: Pimp C]\nI'm switchin lane to lane (uh), leanin on the switch (on the switch)\nSippin on the barre, smokin green and hittin licks (licks)\nBumpin Too $hort baby, in a candy red Biarritz (Biarritz)\nDrop the top and pimp the lot and watch the trunk do tricks (do tricks)\nPimp C, I keep my money on my mind (mind)\nKeep a hooker on the track and keep a swisher full of pine (pine)\nIf y'know like I know, you wouldn't try it (try it)\nWanna jack me for my candy car, you must wanna die (wanna die)\nBut I don't really wanna hit ya with this hot thang\nI just wanna get some brain in the turnin lane\nComin down creepin slow, sippin on a potent fo'\nBangin on the Screw, and keep the pistol right here in the do' {*echoes*}\n\n[Hook: Eazy-E + Pimp C]\nBack, front back, fron-front back, fron-fron-front back, side, side\nBack, front back, fron-front back, fron-fron-front back, side, side\nNever let ho-ass niggas ride\nBack, front back, fron-front back, fron-fron-front back, side, side\nBack, front back, fron-front back, fron-fron-front back, side, side\nAnd we never let ho-ass niggas ride"}], "artist": "T.I."}