{"songs": [{"image": "https://images.genius.com/dd4702b67b8df5a6d15413c2a9f2117c.700x700x1.jpg", "lyrics": "[Mac Lethal]\nYo, that girl's an assassin\nI mean, that girl's an assassin\nUh, let's go. What'd she say to you?\n\n[Verse 1]\n[Joe Good]\nMan, I think she was sent to kill\nWith a pack of dirty diapers and her Enfamil\nPlus, laid up for nine months of labor\nNow she cain't dump her 18 years of paper\nMakin' all what my style affords (right)\nI make it known in my child support (right)\nPut it in a slot, gotta drop a quarter\nShopping in my pockets 'til I'm out of order\n[Mac Lethal]\nDo you wanna take another picture, because I think you should\nI think you should leave for good and try to hold another piece of my epiphany inside you\nHow does it feel? You got a litany to guide you\nI jot a love letter\nI got a much better grip on the lung pressure (can't breathe)\nMy competitor is a fit to kiss\nNow my little daughter wanna make her mama shift her hips\n[Joe Good]\nIf you want a set a twins, it could take a hour\n(Here) Sniff a bag of this baby powder\n(Yeah) Fuck a collar, you could pop a kernel\nYou were in it for the dollars, you were not maternal\n[Mac Lethal]\nShit. Nocturnal, up all night to shake\nWe kiss but your hug's all tight and fake\nI don't hurt at all because I heard it all\nFrom the girl with the surly, pearly clothes\n[Joe Good]\nI love my mama with the dirty drawers\nGettin drama with the early calls\nShe must really wanna get to the mall cause her purse in a bunch\nShe gotta give me 'til the first of the month, what's up\n[Mac Lethal]\nScribble it and curse if I want a little carte-blanche\nInsert and I pump until my heart launch\nShut up\nDon't you say a word. You got me so disturbed. (Word)\n\nChorus:\nI love my baby's mama, cause she's so sweet and pretty\nShe wants to take my dollars, so she can leave this city\nI love my baby's mama, cause she's so sweet and pretty\nShe wants to take my dollars, so she can leave this city\n\n[Verse 2]\n[Joe Good]\nWe lust, we loathe, we fuss and fight\n'Til death from the touch of a single night\nSo generous, and sensuous\n'Til we got what the good Lord sent to us\nWe lust, we love\nWe fuss, we fight\n'Til death from the touch of a single night\nSo generous, so sensuous, right\n[Mac Lethal]\nWatch when the belly button pops out, please\nJust let me babysit, alright?\nTalk loud with your razors, spit your spikes\nJust don't be a crazy bitch tonight\nWhen the hand that rocks the cradle grips the pipes\nYour eyes are a shade of kryptonite\nI'll give you an able, kiss and bite\nAnd put you in a subliminal pipe dream\n[Joe Good]\nI keep it simple with the minimal night steam\nShe wants the peanut butter, pickles, and ice cream\nTwo scoops of double dutch fudge\nHey boo, wanna a waffle cone? It's much love\nIt ain't no thang for my Damey-Dame\nHere's a baby cause you're never gonna take my name\nI guess, I'm overall burned and turned out\nFrom every \"motherfucker\" that'll come from her mouth\n[Mac Lethal]\nOr any motherfucker that'll sit on her couch\nSmoke around my little girl and get all cursed out\nHey pop? What, doll? Respect the rock and cock\nLook sideways and your neck'll pop and lock\nI seen your girl in a sexy halter top\nCuz she's my baby's mama\nIf you go near my family\nYou'll be feeling daily trauma\n\nChorus x 2", "year": null, "album": "The Original 11:11 Sessions", "title": "Baby Powder"}], "artist": "Mac Lethal"}