{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Firm Biz ’08", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Verse 1: Nicki Minaj]\nYa girl been hot since Corduroys\nSince quarter waters,and all the boys used to\nTry to beat like the corner boys\n'Cause they heard the pussy wetter, than themDorney rides\nFuck with who? Fucks with you\nAs long as them checks clear like Huxtable\nI’m known to hang, with a thug or two\nNiggas that only do, what a thug would do\nAsk about me, the FEDS watch daily\nGettin’ more cheese, more bread than a deli\nAnd I’m getting’ love, fan mail like Melly\nAnd I throw it up, twelve o’clock when I wheelie\nI’m in the A, I scoop my nigga J\nCoupe gotta be grey, you gotta get paid\nAin’t nothin’ worse, than being a broke bitch\nI always got crack, I tell ‘em to smoke this\n\n[Verse 2: Jadakiss]\nYo, ya boy been nice since thunder cats\nSince leather boomers and lumber jacks\nCome outside with a hundred stack\nJeans with the sweat pants under that, yeah\nFront on who? Not on me\nNiggas know I keep the seventeen shot on me\nMade a lil something off rap, lot off D\nGet your points off another nigga, not off me\nAir forces, new trues and a crispy tee\nNew coupe, nigga, CL-63\nCost you nothin’, we get hit for free\nWith Nicki, matter fact, nah, the bitch with me\n\n[Verse 3: Nicki Minaj]\nSo you wanna sip goose and play Nintendo Wii? No\nGet the bricks and flip the yayo\nChirp, if you looking for the work\nHundred dollars of pussy, my misses getting’ busy\nFEDs getting dizzy, niggas trying to get me\nSo I change the sizzy combination, to the cizzy\nBrand new V, that’s what I get for pitchin\nNice little crib, a couch that I could sit in\nUmm, I mean sit on, blow piff, fuck a bitch on\nOops, I mean feller, keeps the umbrell-er\nAnd I only fuck with them paper makers\nNicki Lewinski, LK to Jada"}], "artist": "Nicki Minaj"}