{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "Outcast", "album": "Perception", "year": "2017-10-06", "lyrics": "[Verse 1]\nWoke up in the cell, where am I at?\nYeah, it's cold, but I like that\nWhat am I, trapped?\nHeart's beating out of my chest\nDoor's locked, but the keys are in my hands\nHmm, yeah, that's weird, it doesn't make sense, does it?\nI make songs, I don't make friends—judge me\nMight smile, but it ain't that funny\nSing along to the pain, they love it\nLife's like a merry-go-round\nAnd I'm still tryna figure it out\nI like space, I don't fit in the crowds\nMy whole life I've been airin' it out\nOh, I'm gettin' into character now\nFeels wrong, but it feels right\nMy feelings seal tight real nice\nBut I will fight anything to win\nBut I'm not Mike Tyson, I won't bite ya\nBut I will tell you if I don't like you\nI am not the norm\nI got my own shoes, I ain't tryna fit in yours\nI never been married, but I've felt divorced\nHi, I'm Nate, have we met before?\nSomebody told you I was wack? Check the source\nSomebody told you I was back? Yes, of course\nYou got a problem with the fans? There's the door\nYou lookin' for the old me? Check the morgue, agh!\nNot a fortune-teller, but I can see into the future better\nAin't no tellin' what'll happen when I pick up the microphone, get the fans together\nSame style, but the songs are better\nBeen a year and a half, feels like it's gone forever\nAin't no drink in my hand, but you know the buzz is comin'\nBig steps in the game, yeah, the Hulk is running\nMy thoughts are funny, it feels like I'm onto something, yeah\n\n[Pre-Chorus]\nI'm high off the music, my head's in the clouds\nI kinda like it up here; I am not comin' down\nI'd rather be alone, I am not good in crowds\nWhich is kinda confusin', I know—been that way since a child\nThey laugh and they tell me I'll never get out\nI'm just tryna be me, I am nobody else\nI don't care what you think, I'm just bein' myself\nSo I guess for now\n\n[Chorus]\nI'll just be the outcast\nI'll just be the outcast\nI'll just be the outcast\nI guess I'll be the outcast\n\n[Verse 2]\nYeah, I guess I don't fit the mold of rap\n'Cause I'm respectin' women\nI heard your record, I was laughin at it (Ha, ha, ha)\nMaybe they would like me more if I got a little graphic with it\nNah, I don't wanna blend in with you little rappin' idiots—I'd rather be the outcast\nI ain't never puttin' out trash\nI take a hundred and staple it right to my tongue\nI always put the money where my mouth's at, agh!\nFeels good to be here now\nI'm a weird person with a weird crowd\nWhat, you don't like that?\nThat's cool, that's great, that's fine, okay, you can leave now\nGot a weird smile, but I like it though\nI paint it on me and I'm walkin' to the microphone\nAnd put the caution tape around me like I did in Intro 1, yeah!\nYeah, they got me reminiscin' now!\nYeah, you done know I'm 'bout to go mad\nNever wanted something so bad\nGoosebumps through the whole track\nAin't no way I'm gonna hold back\nGot me thinkin' that I'm cookin' in a meth lab\nI don't blow it up in front of my own eyes\nYou look a little lost, you ain't get that?\nComin' from a town where nobody is a rapper\nGuess I never get the memo, must've missed that\nWow!\nHere I go in my feelings again, I can feel it again\nSo I lay in my bed, in my cell with the pen\nAnd I dwell on my sins, I keep wonderin' when\nTime to open the the doors, they don't know who I am\nBut I pick up the keys and I put on my Timbs\nAnd I stare at the locks and the tat on my skin\nAnd I think to myself, \"I don't wanna fit in\"\n\n[Pre-Chorus]\nI'm high off the music, my head's in the clouds\nI kinda like it up here; I am not comin' down\nI'd rather be alone, I am not good in crowds\nWhich is kinda confusin', I know—been that way since a child\nThey laugh and they tell me I'll never get out\nI'm just tryna be me, I am nobody else\nI don't care what you think, I'm just bein' myself\nSo I guess for now\n\n[Chorus]\nYeah, I'll just be the outcast\nI'll just be the outcast\nI'll just be the outcast\nI guess I'll be the outcast\n\n[Verse 3]\nYeah, tryna focus\nTake a knife to my head then I cut it open\nTake my brain, put it on the floor—tryna figure out my motives\nY'all thought I was an issue when the door was locked\nNah, you should see me when the door opens\nEvery night I can hear voices\nPut a camera in my face, might turn Joker like I'm Mike Posner\nAlways been a little complex\nDifficult to process\nSome of y'all wanna sit around and try to pick apart my bars\nHere's some lines you could dissect:\nIf I'ma die, I'ma die givin' everything that I have\nTake a deep breath, I don't need y'all's respect\nI'm a reject kid at recess playin' games with his make-believe friends\nYeah, I don't ever take a night off\nLights off in the room and I write songs\nI might fall into my thoughts once in a while when the mic's off\nYou ain't ever seen no drive like mine, better hop outta my car\nI'm about to unlock my doors\nYou ain't got a seat belt on, better find one\nGettin' sick of people tellin' me to smile more\nT.S. was a chapter I'll never forget, it was therapy for me\nBut it's time to turn the page now\nHey, shut up! I'm tryna tell 'em my story!\nI'm sorry, I wasn't yellin' at y'all, I was talkin' to the voices\nI rip out the drums of the industry's ears for tryin' to ignore me and playin' while singin' this chorus\n\n[Chorus]\nI'll just be the outcast\nI'll just be the outcast\nI'll just be the outcast\nI guess I'll be the outcast\n\n[Chorus]\nI'll just be the outcast\nI'll just be the outcast\nI'll just be the outcast\nI guess I'll be the outcast"}], "artist": "NF"}