{"songs": [{"image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "Go In", "album": "40 Days & 40 Nights", "lyrics": "[Verse One]:\nBack on my shit so hard\nNiggas say, \"Pause\" while I say, \"Start\"\nCause I play video games so much I think I have an X-Box heart\nDriving my hog, while I rip this apart\nI'm a Bad Robot, tell them niggas get Lost\nGot the game on lock down, Rick Ross\nSoon as I got on, they all shut off\nThey created minds that they never used at all\nAww, put me to the test like Saw\nY'all all Dead Silent, playing with dolls\nDark shades cause\nBut I got a whip that'll make your broad, chase my car\nIt flies in the air\nPut the key in, switch gears and it estimates when we take off\nBack from the land, call The Land Of The Lost\nWhere the dinosaurs roam, the bones are my yard\nWilly Wonka'd on my imagination\nI'm just trying to hang, no lacerations\nStand out, it was all planned out, like the Kennedy assassinations\nDudes got deals, congratulations\nBut your followings not real like Pastor Mase's\nI waited all my life to get niggas attention\nDJ Khaled please tell these niggas to Listennn\nPlaying my Coleco I got a Vision\nClosed mouths don't get fed so I just started spitting\nMaybe now they'll know who I is then\nKid With The Green Back Pack on a mission\nWhat's in the bag?\nMost people thought it was dynamite\nCause I'm gonna blow\nSo they were kinda right\nThey tried to bet that the loser won't win\nBut every time I come out they know I'mma go in\nStart\n\n[XV talking]:\nI think y'all got it fucked up. See, a drought came along and everybody was like, \"We'll just take whatever they give us.\" What happened to integrity? What happened to passion in this shit? See when I go...I go in!\n\n[Hook]:\nThey telling me to go in\nGo in, go in, go in, go in, go in, go in\nThey telling me to go in\nGo in, go in, go in, go in, go in, go in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in\nDon't stop\nGo in"}], "artist": "XV"}