{"artist": "King T", "songs": [{"image": "https://images.genius.com/c723068047c0d910e1d247c3b27d3244.640x640x1.jpg", "title": "Time to Get Out", "year": null, "album": "At Your Own Risk", "lyrics": "(All together now)\n(I want everybody to get up out their seat)\n(All together now)\n(I want everybody to get up out their seat)\nAlright, check this out\nYo\n\n[ VERSE 1: King Tee ]\nNow this is for the gangsters, now trip\nA message to the Bloods and the Crips\nIt's time to get out because a lot of things changed\nThe way it used to be, well, today it ain't the same\nYou got the Blood gang shootin up churches and shit\nL.A. and Compton don't mix, so it's Crips fightin Crips\nBack in the days it was whites against 'coloreds'\nNow you got brothers just killin each other\nAnd drive-by shooting's like a sport for you now\nBut when you shoot for your victim with him you hit a child\nI gotta ask ya: how do you feel after that?\nYou brothers blow wind in your gat\nLike you was John Wayne or Clint Eastwood\nYou shot another black for your hood\nGet caught, you wanna cry like a ass\nI kinda giggle when the white man laughs\nNot too long ago you had to fight for your territory\nToe to toe and a gun was a different story\nI guess you can't squabble no mo'\nYour fist is a .44\nBut on the real, hops, I'm on the same boat\nBut the Man got us all by the throat\nAnd since I got the power to deliver this to ya\nI'mma tell ya like it is, I won't fool ya\n\nI want you to\n\n[ singer (& King Tee) ]\nStop fighting and come together as one\n(It's time to get out)\nUnity is what we need, get your job done\n\n[ VERSE 2: King Tee ]\nNow you're out drunk, cold wildin\nKill another brother, on your neck is a medaillon\nThat resembles the shape of the motherland\nBut let me tell you where my color stands\nBlack is you, black is me\nAnd black is creativity\nBlack is present and black is past\nAnd black is of a higher class\nBlack is kings and black is queens\nBlack is what the sunset brings\nBlack is rap and black is soul\nBlack is even rock 'n roll\nCheck it, black is locks, black is braids\nBlack is men with high top fades\nBlack is love, black is devine\nBlack is first of all mankind\nSo\n\n[ singer (& King Tee) ]\nStop fighting and come together as one\n(Get out)\nUnity is what we need to get the job done\n(All together now)\nStop fighting and come together as one\n(Go ahead and get out)\nUnity is what we need to get the job done\n\n[ King Tee ]\nCome together, brother\n[ singer ]\nAnd have unity, you know what I'm sayin?\n[ King Tee ]\nYeah\nOn the strength\n[ singer ]\nWord to the mother\n[ King Tee ]\nTo the motherland, youknowmsayin?\n(All together now)\n[ singer ]\nWe don't need ?????\n(All together now)\nAll we need is a chance\n[ King Tee ]\nGo ahead and get out\n[ singer ]\nWe don't need ?????\nWhat we need is a chance\n[ King Tee ]\nPeace"}]}