{"artist": "PARTYNEXTDOOR", "songs": [{"album": null, "title": "Like Dat", "image": "https://images.genius.com/499498f2af726afd3526747a2007f2ce.550x547x1.jpg", "lyrics": "[Hook: PARTYNEXTDOOR]\nI came in thirty deep like that\nAnd if you callin' and you see your bitch leave\nLil nigga it's on, like that\nRippin' it, rippin' it, rippin' it, rippin' it\nRippers, like that\nThrowin' hunnits and hunnits and hunnits\nAnd make a scene, scene, scene, like that\n(PX, watch out)\n\n[Verse 1: PARTYNEXTDOOR + Jeremih]\nI can't keep a thou' without throwin' it\nI can't keep a pound without blowin' it\nCan't kick it with these niggas, this ain't soccer stop it\nI'm just tryna knock it just like Sock'em Boppers\nI got that boom boom, and that boom bap\nIn the booby trap, they can't trap like that\nI got the bands and all the Xans though\nAll of these Addies I can’t subtract hoes\nWho you shockin', who you shockin' like you got the plug?\nWhy she poppin'? Why she lock it like she from New York?\nWhat she watchin'? Who she watchin'? Is she mine or yours?\n23 karat diamonds, this ain't Michael Kors\n\n[Hook: PARTYNEXTDOOR]\nI came in thirty deep like that\nAnd if you callin' and you see your bitch leave\nLil nigga it's on, like that\nRippin' it, rippin' it, rippin' it, rippin' it\nRippers, like that\nThrowin' hunnits and hunnits and hunnits\nAnd make a scene, scene, scene, like that\n(J, aye)\n\n[Verse 2: Jeremih + PARTYNEXTDOOR]\nJeremih might pull up on your ass\nEvery day your birthday, have birthday sex with you\nI ain't tryna text you, girl I'm tryna be sexual\nI'm just tryna kick it, and lay back and get flexible\nWith some chains, tell me which nigga you on, baby\nAnd the ride a white on white, baby\nI might pull up and I'mma leave with his slut\nScissorhands, give me my cut\nYeah your man been with the bust\nI'm the plug and the price goin' up\nAnd I keep a couple don'ts with my fucks\n\n[Hook: PARTYNEXTDOOR]\nI came in thirty deep like that\nAnd if you callin' and you see your bitch leave\nLil nigga it's on, like that\nRippin' it, rippin' it, rippin' it, rippin' it\nRippers, like that\nThrowin' hunnits and hunnits and hunnits\nAnd make a scene, scene, scene, like that\n(Wayne, watch out)\n\n[Verse 3: Lil Wayne]\nLike that, I got a hundred bitches on the way\nLike that, feel like a hundred chickens on the way\nAnd like that, I got a hundred chickens on the way\nThat white flag, that's when these hoes surrender on the yay\nThey like that, you know the plug know me by face, ho\nLike that, but he no habla ingles though\nLike that, the money train is on the way, ho\nLike that, well you can tie me to the railroad\nLike that, I got a hundred bitches on display\nMy bad, I blew a hundred million on mistake\nRight back, another hundred comin' on the way\nIf I trap, we do a hundred corners in a day\nHundred goons on the way\nOne hundred shots in your face, what you gon' say?\nNeed a code to the safe\nLeavin' a note for bae, she cry every day\nI do not show no emotions\nSo much bass we got distortion\nAll of my waves in motion, all of my goons important\nAll of my ladies are gorgeous\nBuyin' Mercedes' and Porsches\nAll of my niggas are warriors\nNone of my niggas employers\nAll of my niggas are loyal\nEverybody shine like foil\nEverything's lookin' alright\nYeah I just talked to my lawyer, it's time to enjoy, yeah\nTune it's time to enjoy, yeah\nI had to tell myself on the track cause sometimes I ignore it\nDamn\nLike dat\nLike dat\nLike dat\nWe do a hundred corners every day!\n\n[Hook: PARTYNEXTDOOR]\nI came in thirty deep like dat\nAnd if you callin' and you see your bitch leave\nLil nigga it's on, like dat\nRippin' it, rippin' it, rippin' it, rippin' it\nRippers, like that\nThrowin' hunnits and hunnits and hunnits\nAnd make a scene, scene, scene, like dat\n\n[Outro: PARTYNEXTDOOR]\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah", "year": "2016-07-02"}]}