{"songs": [{"year": "2016-11-18", "album": "Tradition", "image": "https://images.genius.com/2d30393f8f61ea7e724356fcf7ab938b.395x373x1.png", "title": "Fight On", "lyrics": "[Verse 1]\nFuck it, where do I start?\nDo I make a remark about my life in the dark?\nAnd all the shit they don't know, like I'm a fucking addict\nTragic that it worked out this way, had it happened any other way, I would've spat it\nBut I'm just laying around\nVision blurry, I'm not happy, 'nother pill, if not\nThey carry me to hospitals and have feeling like a fucking junkie\nBut they ain't been through what I've been through, how the fuck they judge me?\nPlus I'm only on the downers, is what I tell myself\nLike, the highs was any lower, I should belt myself\nAnd all this time I've been working with rap\nI don't talk to many people cos they circles of rats, fuck\nLose my mind when I think into shit\nAnd every pill that I pop, memories sink and dismiss\nWhats the difference I spit like there's a gun to my head\nLeave my life in the booth feels like a struggle for breath\n\n[Hook:]\nGotta fight on ain't no way to beat me\nFeel like I'm locked away somebody gotta free me\nI'm just looking out the ocean as the waves break\nAnd back at me and Boobz were eating off the same plate\nWe had a dream you told me man you gotta chase that\nIn Australia you know I came and saved rap\nTo where I was then to where I am now\nIt's a miracle 'cause rapping like my pen pal\n\n[Verse 2:]\nKeep yourself together, will the fans ever dismember?\nI fluke around my clever no one's snooping through what better\nThat's my confidence boost after popping a few\nAt least I'm honest to you but fuck a promise I'm through what?\nIs that letting them down?\nAfter six albums in they can't question the crown\nAnd it's crazy that I'm still at the front\nI was popping a hundred and eighty six Xanax a month\nAnd that was six a day now I'm currently confused\nCome on, take it back tell me what was the wrong move\nPeople ask me if I've beaten it yet\nCause I've had heaps of fucking help is there a reason to stress?\nTrying to get my teenage years like they never left\nBut they gone fucking Scott get it through your head\nMaybe I ain't ready for the world just yet\nGotta take a pill to handle all the success\n\n[Hook:]\nGotta fight on ain't no way to beat me\nFeel like I'm locked away somebody gotta free me\nI'm just looking out the ocean as the waves break\nAnd back at me and Boobz were eating off the same plate\nWe had a dream you told me man you gotta chase that\nIn Australia you know I came and saved rap\nTo where I was then to where I am now\nIt's a miracle 'cause rapping like my pen pal\n\n[Verse 3:]\nSo I'm hitting the road and a brave face for the stage\nAnd no one's taking my place they never hate to my face\nI could've fell into bits but I'm too strong for this shit\nI got a long list ticking off all of what I can get\nAin't been wrong yet shit I give you my life\nAnd social medias a joke it's how you live in your mind\nBut me I'm in the real world still repping C-Town\nEven though I moved and I'm living by the beach now\nTo my girl, Jesus Christ, how I thank you\nYou watched me fall, you were there, you never break, you\nHelped me up when my legs fucking gave way\nYou was holding me in hospital the same day\nI cave ways for these rappers do they understand?\nIt's obvious I'm rocking gold they rocking rubber bands\nI'ma fight through everything I've come against\nI'm a winner, thought you knew it, don't you come and test\n\n[Hook:]\nGotta fight on ain't no way to beat me\nFeel like I'm locked away somebody gotta free me\nI'm just looking out the ocean as the waves break\nAnd back at me and Boobz were eating off the same plate\nWe had a dream you told me man you gotta chase that\nIn Australia you know I came and saved rap\nTo where I was then to where I am now\nIt's a miracle 'cause rapping like my pen pal"}], "artist": "Kerser"}