{"artist": "Azealia Banks", "songs": [{"title": "Aquababe", "image": "https://images.genius.com/aaa81f2c49f17373da4ee236c1642d45.500x500x1.jpg", "album": "Fantasea", "lyrics": "We gon' do something\nThat yo've never heard before!\n\n[Verse 1]\nThese public pool bitches ain't really mermaids\nPrivate beach Malibu, nigga! Weave up in the shade\nHow do you? Hardly figure, that you that other wave?\nShe party pretty, she party plenty, it's like everyday\nDocumentary, will film the picture, it’s a fantasea\nGet another, pitcher - liquor, off that tanqueray\nOkay, celebrate, let's celebrate\nThat aquababe, sashay, boulevard, runway\nBitches, witness bitches, they've been afraid\nThese nigga's bitches be bitches\nThey smellin' of fish and eggs!\nShe sell the bigger, the bigger\nDifference gave it all away\nSeashells on my two ta-tashies\nSee she got it up on display, hooray!\n\n[Verse 2]\nWe knockin', got it poppin' like a parade\nYour opinion is just a option, fucker what you say?\nI'm looking like, I look right, niggas look-a-ways\nI pop 'em, clap 'em, cock 'em, blam 'em\nLet the choppa spray\nThe brolic Madame, the chunky, clunky 3-8\nTrust me you don't want that rusty, rowdy piper, okay?\nOkay, okay, huh?\n(Okay, okay, huh?)\n(Okay, okay, huh?)\n(Huh? Huh? Huh?)\n\n[Verse 3]\nCinnamon, gentlemen want that kind of taste\nI be killin' 'em, killin' 'em like murder everyday\nWhen Azealia - the AB is on display\nI hit you, split you, lift you, dip you\nGet up out the way\nThe niggas is swank, my bitches is stank\nAll these chickens out for dollars\nAll they get is the franks\nThe linens is blank, the middle is pink\nHe gon' put that snorkel on, we gon' dip in the tank\nI'm focused, I floated out the bluest ocean\nTo splash on your set, honey, get the ships in motion\nBitches seasick, these bitches be opposing\nBitches see me, yes, these bitches be all open\nYou don't want it, no you don't really want it\nI'm drownin' all on my haters and surfin' in the moment\nSwimming in all this paper\nBackstrokin' hundreds\nSwimming in all this paper\nBackstrokin' hundreds\n\n[Verse 4]\nThe chitter-chatter don't really matter, you silly rabbit\nThat could get'cha, g-get'cha, get'cha, your carrot splattered\nOn linen fabrics, I'm diving backwards and livin' lavish\nAqua-fancy, she get it, splash it then dip it back in\n\nHa, ha", "year": "2012-06-13"}]}