{"songs": [{"title": "Can’t Tell Me Nothing (remix)", "lyrics": "La la la la\nWait 'til I get my money right\n\nI had a dream I could buy my way to heaven\nWhen I awoke I spent that on a necklace\nI told God I'd be back in a second\nMan, it's so hard not to act reckless\nTo whom much is given, much is tested\nGet arrested, guess until he get the message\nI feel the pressure, under more scrutiny\nAnd what'd I do? Act more stupidly\nBought more jewelry, More Louis V\nMy mama couldn't get through to me\nThe drama, people suing me\nI'm on T.V. talking like it's just you and me\nI'm just saying how I feel man\nI ain't one of the Cosby's, I ain't go to Hillman\nI guess the money should've changed them\nI guess I should've forgot where I came from\n\nLa la la la\nWait 'til I get my money right\nLa la la la\nThen you can't tell me nothing right?\nExcuse me, is you saying something?\nUh, uh, you can't tell me nothing\nYou can't tell me nothing\nUh, uh, you can't tell me nothing\n\nLet up the suicide doors\nThis is my life homie, you decide yours\nI know that Jesus died for us\nBut I couldn't tell you who decide wars\nSo I parallel double-parked that motherfucker sideways\nOld folks talking 'bout back in my day\nBut homie, this is my day\nClass started two hours ago, oh, am I late?\nNo I already graduated\nAnd you can live through anything if Magic made it\nThey say I talk with so much emphasis\nOoh, they so sensitive\nDon't ever fix your lips like collagen\nThen say something where you gon end up apolog'in\nLet me know if it's a problem then\nA'ight man, holla then\n\nLa la la la\nWait 'til I get my money right\nLa la la la\nThen you can't tell me nothing right?\nExcuse me, is you saying something?\nUh, uh, you can't tell me nothing\nYou can't tell me nothing\nUh, uh, you can't tell me nothing\n\nLet the champagne splash\nLet that man get cash, let that man get past\nYou don't need to stop to get gas\nIf he can move through the rumors, he can drive off fumes\nCause how he move in a room full of No's?\nHow he stay faithful in a room full of hoes?\nMust be the pharoahs, he in tune with his soul\nSo when he buried in a tomb full of gold\nTreasure, what's you pleasure?\nLife is a, uh, depending how you dress her\nSo if the devil wear prada, Adam, Eve wear nada\nI'm in between, but way more fresher\nBut way less effort, cause when you try hard\nThat's when you die hard\nYa'll homies lookin' like \"Why God?\"\nWhen they reminisce over you, my God\n\nLa la la la\nWait 'til I get my money right\nLa la la la\nThen you can't tell me nothing right?\nExcuse me, is you saying something?\nUh, uh, you can't tell me nothing\nYou can't tell me nothing\nUh, uh, you can't tell me nothing\n\nLa la la la\nWait 'til I get my money right\nLa la la la\nThen you can't tell me nothing right?", "album": null, "year": null, "image": "https://images.genius.com/3cfc7d8b148531d9f31298153302cbf6.415x415x1.jpg"}], "artist": "Jeezy"}