{"artist": "Boosie Badazz", "songs": [{"album": "Gangsta Musik", "title": "Baby Momma", "year": "2011-07-07", "lyrics": "This one here for them baby mommas\nWho make baby daddies don't even want no baby daddy\nFeel this nigga. Lil Boosie. Check dis outt\n\n[Verse]\nBaby momma baby momma\nI'm tired of you\nI'm to the point where I wanna fire you\nYou play the games that a child will do\nWhen you need to do the things that a mama do\nBaby momma baby momma\nYou stressin me (you stressin me girl)\nCause I ain't rich you think less of me (you think less of me)\nAnd we ain't gotta take the test to see\nYou need to change yo ways so you can see the best of me\nBaby momma baby momma\nYou lied to me (you lied)\nA good man I tried to be (I tried)\nYou do me wrong even the blind can see\nThat's why I got another woman on the side of me\nAnd she gon love me better (yea)\nFuck me better warm me up up in the coldest weather\nShe bout whatever you heard me\nBaby momma baby momma I trusted you\nIt was so good I left it in when I made love to you\n\n[Hook]\nI'm askin\nWhy you cryin girl?\nWhy you be lyin girl?\nWhy you won't shine girl?\nOn the stretch you know it's mine girl\nIm askin\nWhy you have a baby?\nJust to drive me crazy?\nWhy you be actin shady?\nWhen you posed to be my lady\n\n[Verse]\nBaby momma baby momma\nThought you love me ho? (thought you love me ho)\nBut you won't put a child on child support\nAnd you don't even want my child to know\nThat it ain't daddy it's his mama who wildin' tho\nBaby momma baby momma\nYou jealous of me\nYou don't even want the fellas wit me (my niggas)\nAnd you keep on telling me\nTo slow my role but behind you I'm catchin' felonies\nBaby momma baby momma\nWhere the love done went? (where the luv done went)\nDon't wanna leave you cuz I love ya scent (ya smell)\nThe names I call you ain't really meant\nBut I'm tired of all these fightin's and arguments\nBesides we grown not no mo teenagers\nSo you can stop playin them games tryna check my pager\nYou need to get ya mind right if not I'll see you later\nYou posed to take my side but you listen to the hatas (damn)\n[Hook]\nI'm askin\nWhy you cryin girl?\nWhy you be lyin girl?\nWhy you won't shine girl?\nOn the stretch you know it's mine girl\nI'm askin\nWhy you have a baby?\nJust to drive me crazy?\nWhy you be actin shady?\nWhen you posed to be my lady\n\n[Verse]\nBaby momma baby momma\nYou hurted me\nMe and you know you deserted me (why?)\nI ain't gon lie feel like you murdered me\nCause you the only girl who ever hold work for me\nBaby momma baby momma\nYou a possum now (you sneaky)\nI heard you ridin through the bottom now (for what)\nYou tryna get back on my team\nCause you heard I had a major plug on prementhazime bitch please\nBaby momma look what I did for you (look what I did)\nI took you places that you never knew (you ain't even know that)\nI bought you any kind of tennis shoe\nIf I thought I wouldn't gon make it I'll finish you (blaw)\nBaby momma you missin me (I know that)\nI know you miss how you was kissin me (fa sho)\nIt's sad to say that you a friend of me\nBut just remember can't nobody lay that dick like me\n[Hook]\nI'm askin\nWhy you cryin girl?\nWhy you be lyin girl?\nWhy you won't shine girl?\nOn the stretch you know it's mine girl\nI'm askin\nWhy you have a baby?\nJust to drive me crazy?\nWhy you be actin shady?\nWhen you posed to be my lady\nI'm askin\n\n[Lil Boosie talkin]\nYea this for them baby momma's who put a nigga on child support\nBut just don't know they'll get more without child support\nYou know what I'm sayin and that gotta stop\nYou know what I'm sayin\nIt ain't that I'mma try to make it I'mma put it on yo head\nY'all hoes wrong for that shit man let a nigga live ya heard me\nYou can't stop me dat's how it is now\n\n[Hook]\nBaby momma I done blew up now\nGot a ho she some true love now (she grown)\nAnd I heard you gotta new thug now\nAnd you goin through some mo shit (mo shit)\nI'm out this bitch", "image": "https://images.genius.com/acc8c22987ae3d434169a49303be3c33.640x640x1.jpg"}]}