{"songs": [{"title": "Oh My Gawdd", "lyrics": "[Verse]\nTunnel vision on cyclops, you bozos in my blind spots\nCause I can't see y'all, my level is on sky box\nGot the game locked, I'm on top like a shot clock\nI can do this shit on one leg like it's hop scotch\nI be where them cops not, I be where them Glocks pop\nPain got the Glock cocked, put it to your snap box\nShawty make it pop lock when I'm in that thot box\nMy dildo stay hard, yeah, I got that rock cock (OOOUUU)\nI say what I wanna say\nDykes got my name in they mouth every other day\nTalking on the internet, fuck it, I'ma sip to that\nCause if I really wanted to I could put a end to that\nM.A. been a threat, call me \"Mrs. Get Her Wet\"\nCold hearted, fly nigga bitches call me winter fresh\nI'm back on my bullshit\nStill in the hood on my hood shit\nStill walk in the corner store buy a wood tip\nStill got the P-89 with the full clip, still\nStill buy the four chicken wings from the Chinese\nStill run up on Mr. Softy for that ice cream\nStill looking at a fat ass in them tight jeans\nStill I'ma shine on these niggas like the high beam, still\nI had a great year though\nThought they could get rid of me, but I'm still here though\nDid a lot of interviews, made a couple business moves\nSo before you judge me step into my tennis shoes\nRecord label owner, no college diploma\nThey know me on the west coast, shout out to Tacoma\nSouth by Southwest concert\nI sold out Webster Hall without a sponsor\n('Cause I'm a monster)\nNow this year I'm about to go bonkers\nGot the city locked from Brooklyn to Yonkers\nMade a lot of thousands, but still I can count it\nNow these checks 'bout be bigger than the pockets\nSleepwalkin', throw 'em in the coffin\nThe feedback was crazy, real niggas support it\nPut it out for free and the streams was enormous\nPut it out on ITunes and still people bought it\nI call that love\nI'm what every girl want, I call that UGGs\nHow you hate, but you listening, I call that bug\nSave it, you washed up man, I call that dove\nWhen I wanna hit the club I just call that plug\nRedlyfe, we a family, I call that blood\nWhen they see who the best out I am that stud\nMan, they can't fuck with me, are they on that drug?\nWent from spitting bars on that Hot 9 station\nNow you hear that \"henny and some hoes\" in rotation\nMan, this feeling is amazing\nAnd this freestyle feel like Rap City basement\nI remember listening to Fifty (Yo, Fifty)\nNow you see me on Thisis50\nOut here making big moves\nMy next plan is a house with 'bout six rooms\nWith a big backyard I can land on\nSomewhere I can call home without a landlord\nMy life 'bout to be a movie, where the camcord'?\nBlowing through the money like the fan on\nStacks, rubberband on\nIf I was you I would hate me too\nAnd if I wasn't who I am I would play me too\nBut now I'm here, and you stuck with me, crazy glue\nBut isn't that ironic 'cause I'm crazy too\nSaw me on Fox 5 in that Yankee blue\nSo chill, gold grill, braids two by two\nCompetition, tell me who is that?\nIn the bank is where I'm cooling that\nNever new to that, I'm true to that\nGot waste, where the sewage at?\nGhetto fix, where the super at?\nI be in Brooklyn where the shooters at\nThey throwing shots then I'm shooting back\nNew niggas, don't got room for that\nTo ya level, never stoop to that\nShit, I would be a fool for that\nI got the crown, never losing that\nI beat the pussy 'til it's blue and black\nI like 'em older, where the cougars at?", "album": null, "year": "2016-04-15", "image": "https://images.genius.com/eac22acf0996fe81401676d52fe00183.803x803x1.jpg"}], "artist": "Young M.A"}