{"artist": "Apathy", "songs": [{"title": "Deep Cover Freestyle", "image": "https://images.genius.com/56863a1fcce089af3f654431482571b2.1000x1000x1.jpg", "album": "It’s The Bootleg Motherfuckers! Vol. 3: Fire Walk With Me", "lyrics": "[Intro] [Apathy talking]:\nApathy. Yo Big Mike man, these dudes are rapping more pussy by the second. All this talk about gwap gotta stop. Y'all ain't got none anyway\n\n[Verse]:\nYou know your boy Ap sick spit more flows and raps\nThan hoes got tats on they tits and lower backs\nY'all are phoney criminals\nThat feel they so real, less cases than the end of Deal Or No Deal\nI'ma earn my stripes when I work with Mike\nSo this verse I write can make the Earth ignite\nGot a gun made special so led can spray three ways\nAnd 187 the Feds who raid DJs\nAp's your boy but I'm viewed as the man\nMe and Mike do it big but we huge in Japan\nNot Yakuza but the crews think Apathy's gangsta\nGet the doe, blow the show with my Japanese geishas\nSee the tattoo on my arm when I slap you with my palm\nI'll kidnap you and your mom and attach you to a bomb\nWhen I rap they say I'm radical but rapping don't do it\nI can clap you in the clavicle to classical music\nA fanatical Nautica addict back in '94\nPutting bodies in the ground as deep as a dinosaur\nGlobe trotter, make your flow stop quicker than heart failure\nCause fans think I'm awesome from Austin to Australia\nMy rep grows bigger, how you rep is repetative\nThere's a rapper more connected in Connecticut\nNegative\nI'm one of the best fill up my lungs in my chest\nAnd mutter under my breath like my tongue is possessed\nMiles underneath the Earth, I can call Hell home\nSo it doesn't even roam when I'm on cell phones\nKeep the crucifix close to you\nWhen I spit it's a quotable\nRock my Uptowns once, all my kicks are disposable\nI could quickly dispose of you\nGet a bomb to explode in you\nI be standing right over you\nWhat the fuck am I supposed to do?\nThe quicker picker upper\nPick your burner up quicker\nI murder quicker than a click cause my all my verses are sicker\nThe sickest I can pick you off with a pistol in my peripheral\nRiff with you over a bitch and I bring out the bitch in you\nBlow you to bits, a pink mist mostly invisible\nKinda like that movie, an eagle can make me invincible\nI rap like a ritual, getting rich by the syllable\nBungee jump out the womb and cut my own umbilical\nBillions of flows composed, I be killing my foes\nYou got a new style?\nShit I got a million of those", "year": null}]}