{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/1370850428_bigkuntry.jpg", "title": "Yeah Remix", "album": null, "lyrics": "[Intro - Big Kuntry King]\nP$C\nBlock ENT\nYou know who this is mane, Big Kuntry King\nC'mon\nAye\nC'mon\nAye\nC'mon\n\n[Chorus - Big Kuntry King]\nI'm in the club like\nAye, aye, aye, aye, aye, aye, aye, aye\nYou popping pills? Yeah I'm on it\nXO? Yeah I'm on it\nYou got the dro? Yeah I'm on it\nYou got them hoes? Yeah I'm on it\n\nI'm in the club like\nAye, aye, aye, aye, aye, aye, aye, aye\nGrey Goose? Yeah I'm on it\nOn Patron? Yeah I'm on it\nYou got the dro? Yeah I'm on it\nYou got them hoes? Yeah I'm on it\n\n[Verse 1 - Yung Joc]\nAye, nothing like a P$C and Block ENT party nigga\nReal niggas with real money, folk seeking Ferraris nigga\nDead bitches everywhere, twenties and fifties, throw them out\nSlap them on they derriere, pull the dro and blow it out\nIf you see a scrub in the club, nigga point him out\nTrying in the V.I.P.'s, no love, we throwing them out\nTell them plenty position, nigga stay in your lane\nI'm fuck with real niggas like my nigga Kuntry King\nSo don't give me no lip, HK on my hip, get a hitter for flip\nNeed a Band-Aid for your drip?\nIn case you wondering, know how I'm balling where I stay\nIt's them Boyz 'N' Da Hood, we in the club like aye\n\n[Chorus]\n\n[Verse 2 - Big Kuntry King]\nGive me a bottle of Patron, and a blunt of kush I'm good to go\nI'm high as fuck, I'm in \"The Matrix\", bent on moving slow\nYes I'm the flyest, who told you that? The Oracle\nHow could you ever doubt me? Ask your hoe she know\nKuntry King (Kuntry King) no question, I'm on it mane\nMaking busts all in the club, how you do that? I make it rain\nAnd I got some more stacks, I'm finna make it storm bitch\nBecause you seeing money, don't try, thunder on my hip\nP$C and Block in here, T.I.P. Yung Joc in here\nThat means more pill popping, chicks pop in here\nWe over here, yeah, tell them this is how high\nPopping rubber bands, got them drinks on ice\n\n[Chorus]\n\n[Verse 3 - T.I.]\nI got a pistol in my pocket, throwing money in the air\nTell them bitches get with pimping, ain't no money over there\nAye, you see Kuntry over there, throwing hundreds in the sky\nYeah this rap shit mine, I'ma run until I die\nAnd you can run and you can hide, and you can talk and you can floss\nYou be running for your lives when I knock you niggas off\nAye, I can show you how to floss, Chevy with the dual exhaust\nThe old school cost a hundred thousand cash, real talk\nI know you niggas real soft, never be a real boss\nKeep kicking and sneak dissing, get them caps peeled off\nThe verses going to get you hurt, I don't care if the world saw\nYour girl just saw me go off with Yung Joc we in the club like\n\n[Chorus]"}], "artist": "Big Kuntry King"}