{"songs": [{"image": "https://images.genius.com/49e67f195e584291bc2a980f23cdad07.809x799x1.jpg", "year": "1996-10-15", "title": "Bird’s Eye View", "album": "At the Speed of Life", "lyrics": "[Verse 1: Xzibit]\nWhen it comes to shit like this\nI always get it right the first time\nPlaya haters and snakes waiting for mistakes\nBut that's the breaks, the highs and lows of the industry\nD.I.T.C. and X to the Z\nGet it crackin' to the third degree\nXzibit breakin' niggas down like H.I.V\nWe bring rap to your city like B.E.T\nBut still feel California is the place to be, catastrophe\n\n[Verse 2: Tash]\nThe Alkaholiks is back to fry you extra crispy\nWith the skills that make the plots to try and diss me extra risky\nCause the time it takes to infiltrate and stop my forward motion\nCalifornia will have broken off and fell into the ocean\nCause I rocked around the world with my ill type skill\nStep for real or I'll leave your grill scarred like Seal\nCause I regulate the sectin where the drinks is getting blended\nCertified bartender, go catch the 40 when I send it your way\n\n[Verse 3: Xzibit]\nNiggas that hustle till the day light break\nGo to county 20 times, till can't go straight\nDon't nothing in the motherfucking world come free\nI'll never see a nine to five cause it just ain't me\n(It's like this)\nXzibit shall hustle, lift, build muscle\nAnd think like Russell\nSurvive and bring it live and direct\nTo any crowd throughout the world like this\nCome home and smoke a spliff in the Benz with Swift\n\n[Chorus: Xzibit, J-Ro & Hurricane G]\nI'm fucked up, J-Ro\nYeah, I'm fucked up too\nLooking at these bitches from a bird's eye view\nMy name is J-Ro from the Likwit Crew\nSo what nigga is it you wanna do?\n\n[Verse 4: J-Ro]\nMy flow is metaphorical, historically correct\nWhat do you expect from a nigga with my intellect?\nEast coast representing West coast gangsta\nNah, I ain't tripping, I call up King Tee, we go dipping\nThrough the streets pumping hardcore Likwit beats\nFlowing air, blowing, lounging in them leather seats\nThinking back how we used to rock the house party\nNow we just fucking it up for everybody\n\n[Verse 5: Xzibit]\nHow dare you try to compare yourself to the original\nProfessional Xzibit break you down like correctional facility's\nLimit all capabilities, motherfuck MC's\nHard to read like Japanese\nI'm spreading like disease so I can't be stopped\nBy who you run with, your clique or the bitch ass cops\nXzibit’s first LP, it hit your block like crack rock\nI’m blowing up your spot by remote, it's the cutthroat\n\n[Verse 6: J-Ro]\nI\"m from Cristal-ifornia, I warned ya I'd be on ya\nI'm off the paint like velvet paintings, make your mama mourn ya\nThe Ro is outer national, cold as Henne-sota\nI smoke 12 MC's a day just to fill my quota\nFrom Fourty Ohio all the way to Ore-gin\nBuddy, my fingers are bloody, now I'm Washing-ten\nI clown from Brew-york down to Mai-tai-ami\nI soak up game like a shamm,y understand me?\n\n[Chorus: Xzibit, J-Ro & Hurricane G]\nI'm fucked up, J-Ro\nYeah, I'm fucked up too\nLooking at these bitches from a bird's eye view\nMy name is J-Ro from the Likwit Crew\nSo what nigga is it you wanna do?\n\n[Verse 7: Tash]\nSo Elizabeth it's MC's that's coming to join ya\nSome will be from NYC and some will be from California\nCause I drop the lyrics on you from beneath the Earth's surface\nWhere I write rhymes so fresh I try to bite my own verses\nCause the purpose of my flow is to let you know\nMy style is badder than the water down in Mexico\nCause RICO blend styles like juice and gin\nI got the Likwit shit that have you seeing double like the Twins\n\n[Chorus: Xzibit, J-Ro & Hurricane G]\nI'm fucked up, J-Ro\nYeah, I'm fucked up too\nLooking at these bitches from a bird's eye view\nMy name is J-Ro from the Likwit Crew\nSo what nigga is it you wanna do?"}], "artist": "Xzibit"}