{"songs": [{"title": "What The Fuck", "album": "The King of Crunk & BME Recordings Present: Lil’ Scrappy", "year": "2004-02-24", "image": "https://images.genius.com/6851a699ae4a0e7001aafbfb7d5bc40c.1000x1000x1.jpg", "lyrics": "[Intro]\nIt's so groovy, nigga\nAyy, Lil' Jon, hand me the beat, nigga\nShow these niggas what it really is\nBME click, it's goin' down tonight\nThis for everybody in the club you know\nThe street that wanna know what the fuck goin' on in this bitch\n\n[Chorus]\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga eyein' me, that nigga eyein' me\nFuck nigga eyein' me, he keep on eyein' me\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga tryin' me, that nigga tryin' me\nFuck nigga tryin' me, he keep on tryin' me\n\n[Verse 1]\nFuck the bullshit, beat that ass to the flo'\nHe twistin' and he shakin' like a goddamn hoe\nDon't run or bat me, always tryin' to attack me\nDestroy your brain cells from the heads, I be clappin'\nI'll buck all day, I'll buck all night\nDamn right, I beat ya ass in the goddamn fight\nDon't stand so close, getcha damn nose broke\nTryna gimme dap when you see me, bitch, you ain't my folk\nYou be tryin' me, I'm a thug ass G\nI'ma switch you sideways, I'ma charge a post up fee\nThug straight trappin' 'til I get rich off this rappin'\nI ain't got no friends, gotta watch whose heads I be snappin'\nFlippin' an' flappin' at the mouth, yeah, it's off the chain\nSpit pimpin' on a real bitch just to get brain\nWhat the fuck is you tryin' me for?\nI ain't no bitch, I ain't no lame ho'\n\n[Chorus]\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga eyein' me, that nigga eyein' me\nFuck nigga eyein' me, he keep on eyein' me\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga tryin' me, that nigga tryin' me\nFuck nigga tryin' me, he keep on tryin' me\n\n[Verse 2]\nWhat the fuck is goin' on?\nI beat the fuck out ya ass and run ya bitch ass home\nI'ma young thug nigga, I ain't no fuckin' joke\nIf I ain't no lame nigga, what the fuck you eyein' for?\nTalkin' all that shit, bitch, take it outside\nPop ya 'bout 3 times, now ya turn clockwise\nI ain't playin, I done been tried\nDamn near took a life, used to call me Chuckie\n'CauseI stabbed a man with a knife\nMy life tatted on my neck, so you best respect\nWe thug stylin' BME, leavin' hoes pussy wet\nAll I punch is niggas dawg, I don't fight no bitch\nI gotta hoe in the car, that'll get up in this shit\nI'm gone and pissed off, my brains and nerve lost\nI carry my own coffee, you spill, you get tossed\nAnd last but not least, bitch, quit tryin' me\nYou ain't got no business mothafuckin' eyein' me\n\n[Chorus]\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga eyein' me, that nigga eyein' me\nFuck nigga eyein' me, he keep on eyein' me\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga tryin' me, that nigga tryin' me\nFuck nigga tryin' me, he keep on tryin' me\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga eyein' me, that nigga eyein' me\nFuck nigga, eyein' me, he keep on eyein' me\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga tryin' me, that nigga tryin' me\nFuck nigga tryin' me, he keep on tryin' me\n\n[Verse 3]\nHaters dress to impress but they missed a spot\nIt takes chest to distress the longevity plot\nBut I gotta 380 waitin', keep ya eyes up off me\nKeep ya eyes off my dick and get your own damn money\nYou phony mothafucka, getcha head split right open\nI do it in the street and leave your neighborhood slopin'\nAnd they hopin' that the mothafuckin' war is over\nThese lyrics so diverse that a click clack can break your shoulder\nI done rolled up on the south side of the A\nIf you keep lookin', I'ma bust ya ass in ya face\nI ain't gon' bless, I'ma just make an example\nAll that unloyal shit gon' get your fuck ass tackled\nWhen I cock back, my piece is gonna sound like blam\nHit your ass so hard, the fuckin' crowd say, \"Damn\nYou just got knocked the fuck out\"\nThat's the way we do niggas that's eyein' in the South\n\n[Chorus]\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga eyein' me, that nigga eyein' me\nFuck nigga eyein' me, he keep on eyein' me\nWhat the fuck is goin' on?\nWhat the fuck is goin' on?\nThat nigga tryin' me, that nigga tryin' me\nFuck nigga tryin' me, he keep on tryin' me"}], "artist": "Lil Scrappy"}