{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "2004 Tim Westwood Freestyle", "lyrics": "[Verse 1]\nI told her to drive over after dude crib\nBring a couple new friends\nThem last girls was too thick\nHow you expect me to hit?\nYou wanna watch Clueless\nI wanna watch Foolish\nExcuse me, miss, I don't appreciate your rudeness\nBut if you strip, I will appreciate your nudeness\nI heard the best head come from girls that is toothless\nYeah my game ruthless, yeah my car roofless\nSpit that \"Through The Wire\" over Chaka Khan, ruthless\nShe said she had a friend look like Janet Jackson\nThat bitch came over lookin' more like Freddie Jackson\nNah, nah, nah, baby, won't be no time for no action\nI'm just gon' play this \"Slow Jamz,\" holla at your man\n\n[Verse 2]\nOld school like Melle Mel\nOr we could go to the D where Drelle Drel\nOr DC, PG, or ATL\nBack in Chi, I mean my life like a magazine\nHoney wanna know the details about my ebony\nWell that's XXL\nFather penthouse, yeah that's upscale\nMademoiselle got a hell of a black tail\nI'm feelin' the vibe, her body and soul\nI heard you stay in a metropolitan home\nWell let's kill all the pollyin', I offer you a Cosmopolitan\nLet's jet out the club, get some oxygen\nYour friends say I'm a player, you'd be lucky to keep me\nYou know people gon' be talkin' 'bout us weekly\nMy car be in a robbery\nP-O-R-T but what's more important to me is that\nDon't be comin' 'round my girl tryna act like Mr. Friendly\nAnd steal the spotlight like Mr. Bentley\nI spotted her like Spud McKenzie\nAnd for them fake boobies, I paid them Benjis\nGet your own\nI got Paris, he got Nicky, he tried to get him a clone\nHe said, \"Ye, you know you got extra hoes\nAnd everything you do is extra cold\"\nFrom the Polo fleece to the Jesus piece\nI got family in high places like Jesus niece\nCan I please say my peace?\nIf y'all fresh to death then I'm deceased\nAnd this one here is a heat rock, spit like a beatbox\nThe way the beat rocks, new version of Pete Rock\nBut for that Benz I get CL love\nSo I switched my girls around like 3L dub\nMy favorite girl wanna leave me just because I got a girlfriend\nMy freak girl told me now she's a Christian\nMy white girl wanna move back to Michigan\nI'm pullin' girls off the bench like a 6th man\nI'm in the club pullin' the same old two step\nWhile Omegas doin' the same old Q step\nI had my money on my mind, I was thinkin' green\nShe a pledge, AKA, she was pink and green\nI want a good girl, she want a gentleman\nWe sayin' the same thing like a synonym\nI wasn't really spittin' game, I was scrimmagin'\nMy penmanship is so hard it needs censorship\nI'm a Chicagoan 'til Chicago wins\n'Til we blow like Chicago wind\nI don't know what's better, gettin' laid or gettin' paid\nI just know when I'm gettin' one the other's gettin' away\nI have to say, we goin' to mass today\nWe have to pray, these niggas is wack and aye I have to say\nSince Pac passed away\nMost these niggas don't even deserve a track from me\nFirst of all, let's get rid of them Louis Vuitton boots\nAnd get your tall ass out that C-Class coupe\nYou see the whiskey, had them girls feelin' frisky\nYou was with me, she said, \"Who's your sensei?\"\nAnd even if they wanna get busy\nAnd freaky like Missy and roll some weed up\nYou'll roll 3 blunts and fuck up 3 blunts\nMothafucka you would fuck up a free lunch\nDawg, keep it right thurr like Chingy\nYour girl don't like me? How long has she been gay?\nSpanish girls ask me, \"No habla ingles\"\nAnd everybody wanna run to me for their sin-glay\nIt's funny how these wack niggas need my help\nWasn't around when I couldn't feed myself\nDawg if I was you I wouldn't feel myself\nDawg if I was you I'd kill myself\nThat Ethiopian chick drinkin' straight up liquor\nI told her I'm Nigerian, that's straight up nigga\nShe claimed she ain't hear me on \"The Bounce\" with Jigga\nShe claimed she ain't see me on the basement with Tigga\nThem both my niggas, I suppose\nI might have been doin' a lil' frontin' for the hoes\nWhen I flip flows, I rip shows\nAnd your girlfriends, can I hit those?\nI don't know if it's me, or do them Uggs\nGot girl's feets lookin' like sheepskin rugs\nSome rhyme with her name, some rhyme nameless\nDon't try to treat me like I ain't famous\nMy apologies, are you into astrology?\nCause umm... I'm tryna make it to your anus\nSee that's a little Don Juan game\nAll across your chest like Sean John's name\nNiggas tryna figure out since Kan' came\nWho the rookie of the year: me or LeBron James?\nThey said, \"Woah don't get caught up in the hype\"\nAin't no tellin' they gon' love you after tonight\nWell if tonight's the night, pop bottles, fuck models\nSpend moeny 'til you're broke, my nigga, live your life\nCause I'm livin' international, nigga, the American dream\nAll my dawgs is livin' vicariously through me\nIf I get head from Drene, that's one for the team\nCause 702, that's one for the crew\nMy dawg Hip-Hop really love Claudette\nSo if I ever get to smash, this fuck's for you\nI can barely drive the G5 down King Drive\nCause like a Brinks truck, they know there's money inside\n\n[Intermission]\nI'ma take a little intermission\nI'ma let y'all just talk about how good I rap for a minute and I'ma come back\n\n[Verse 3]\nSo I dropped out of school cause I'm tryna eff the tutor\nHer ex man drove a Mercury Cougar\nI hit her with this maneuver, he just couldn't recuper'\nI'm tryna stab one like Jack The Ripper\nI'm tryna stab two like Jack The Tripper\nMy nigga Tone been locked for a minute\nHe come home, he from the skreets, he gon' want him some skrippers\nAnd I'm a big tipper, I don't even be trippin'\nThis my first real Rolex, it don't even be tickin'\nThis my first pair of earrings I can wear in the shower\nWithout 'em cloudin' up in a half an hour\nSo that basically mean my paper gettin' jean\n4 Gs in the Rocawear jeans\nThis top red hot like Anthony Kiedis\nYou see this? These are the sweetest Adidas\nWe fire, y'all retire\nAll ugly people, please be quiet\nHov ain't get a beat from me in a minute\nHe heard \"Just to Get By\" and I was re-hired\nI got a track right now that could save Mya\nLaughs I do though..."}], "artist": "Kanye West"}