{"songs": [{"album": null, "image": "https://images.genius.com/0c8a9838f178f4722499ace2df3c87ea.718x718x1.jpg", "year": "2019-04-07", "title": "I Ain’t GOT IT", "lyrics": "[Intro]\nRellyMade\n\n[Pre-Chorus]\nThey try to break me down, I tell 'em I ain't stoppin'\nI gave my life on TV screens, I bet you watchin'\nI've been through hell and back, oh yeah, bitch, I'm back poppin'\nAnd if they ever tell me quit, that ain't an option, no\n\n[Chorus]\nOh, you think you gettin'? I ain't got it\nOh, you think you gettin'? I ain't got it\nOh, you think you gettin' now? Oh, you think you gettin' now?\nOh, you think you gettin'? I ain't got it\n\n[Verse 1]\nNo, I ain't got it, oh boy, I'm poppin'\nI'm takin' off like a rocket, for 30 thousand, that's what y'all on\nY'all some lame ass niggas, I'm a Detroit bitch\nFuck these hatin' ass hoes, tell 'em all get off my dick\nTime to go and do it, I'ma do it and that's all\nCan't wait 'til I'm 50 just to go and ball\nSo what you wanna do? Come and bully who?\nFuck them other niggas, ho savage, I'ma ride\n\n[Pre-Chorus]\nThey try to break me down, I tell 'em I ain't stoppin' (I ain't stoppin')\nI gave my life on TV screens, I bet you watchin' (I know you watchin')\nI've been through hell and back, oh yeah, bitch, I'm back poppin'\nAnd if they ever tell me quit, that ain't an option, no\n\n[Chorus]\nOh, you think you gettin'? I ain't got it (You think you gettin' it)\nOh, you think you gettin'? I ain't got it (Oh, you think you gettin' it)\nOh, you think you gettin' now? Oh, you think you gettin' now?\nOh, you think you gettin'? I ain't got it\n\n[Verse 2]\nHow could you think that I was weak?\nLook what I had to defeat\nOh my, I've been alone for a while\nContemplatin' R&B but this is how I eat\nSomehow, time I glow all the way up now\nSo I'ma run it up, run it up, I got the juice again\nSecond glance, Carti' shades, I'm drinkin' juice and gin\nBut I won't cry\nIt's time I spread my wings\nI'm alive, now everything's gon' be alright\nI'm alive, now everything's gon' be alright\nI'm alive, everything's gon' be (RellyMade)\nAlright\n\n[Pre-Chorus]\nThey try to break me down, I tell 'em I ain't stoppin' (I ain't stoppin', baby)\nI gave my life on TV screens, I bet you watchin' (Bet you watchin' me)\nI've been through hell and back, oh yeah, bitch, I'm back poppin'\nAnd if they ever tell me quit, that ain't an option, no\n\n[Chorus]\nOh, you think you gettin'? I ain't got it (Oh, you think you gettin' it)\nOh, you think you gettin'? I ain't got it (Baby, I ain't got it for ya)\nOh, you think you gettin' now? Oh, you think you gettin' now?\nOh, you think you gettin'? I ain't got it (Got it, babe)\n\n[Outro]\nOh, you think you gettin'? I ain't got it (Got it)\nOh, you think you gettin'? I ain't got it (Got it)\nOh, you think you gettin' now..."}], "artist": "Teairra Marí"}