{"songs": [{"image": "https://images.genius.com/12fbe130df0fc7b9332563dae4f83b7a.900x900x1.jpg", "year": "2004-06-29", "lyrics": "[J-Hood] Whattup? D-Block to QB nigga, get at me\n[Havoc] It's another one of those, A-L-C things\n{\"It's the Ryders and the Mobb\" - Jadakiss}\n{\"Yo Alchemist, drop that new shit for 'em right fast\"}\n[Noyd] This is it homie, we gon' go with this one right here\n{\"It's the Ryders and the Mobb\" - Jadakiss}\n\n[Noyd]\nAiyyo, I'm never empty-handed, understand dunn?\nI keep a fistful of cash, the other on some ass son\nSmack the shit out niggas like handball, or I give 'em a fair one\nThey ain't gon' do nothin I dare 'em\nI hear 'em, \"He a gangsta, he don't take crap\nUntil I point this cali' at him, tell him take that\"\nIn fact, I'm about to blow but that you already know\nShit I just strap holdin cracks just a minute ago\nNow I'm in a Jag with a rag and the tints is low\nAnd you mad cause you a fag and your chick's a ho\nYeah she been around more than any bitch I know\nYou should be glad though, I taught her everything she knows\nWhatchu reachin fo'? What I done touched a nerve?\nYou wanna hurt somethin now you know I'm fuckin your bird?\nCause that's my word, front like you want a war\nAnd homie we can settle the score, whatchu waitin for?\n\n[J-Hood]\nYo, I'm the Tracy McGrady of the shit, I take you right to a hole\nShove the tip of the nose of the silencer right in your nose\nY'all niggas is degenerates\nIt don't make sense to do business with a nigga, if you ain't gon' benefit\nFuck a Bentley and a jet, I'm gutter nigga check it\nAll I need is two-point-five and a couple Intrepids\nIt's drama, I ain't starin you down\nI'mma clap ya forehead and dump you on one of them merry-go-rounds\nWe put the packs of crack in the streets to get you a stack\nIt's been acid since they made the first box of Cracker Jacks\nBeat in the staircase purple'd out, rollin a phat\nBottle of 'gnac next to me, on my lap is the mac\nThese slugs hit you they takin your arms\nD-Block got the kind of weapons that Bush, tried to take from Saddam\nFrom Y-O, to your hood, to QB\nCatch me thuggin it out shootin dice twistin up a O-Z\nY'all faggots don't know me, it's no remorse\nWhen hollows rip through your corpse\nHomicide'll find you dead on your porch\n\n{\"It's the Ryders and the Mobb\" - Jadakiss}\n\n[Havoc]\nThat's what I'm talkin 'bout, yo, yeah..\nLike white on rice, I'll be on you, you couldn't even shake me off\nBe in your chest like a smoker's cough\nPut the hammer in your mouth and have you suckin it off\nLike a ho tryin to stop 'fore she find the law\nYou in the club, you's a thug, why you playin the door?\nLike you know somethin I don't playa then put me on\nYou cowards so nervous, I got broads that'll get it on\nWith any fella and think before they talk\nMine like a nigga on the road takin his last walk\nAnd when I come niggas kiss they cross\nYou know you done fucked up now\nNiggas talkin just to be talkin, ain't nothin sweet but the pound\nRepeatly vow, they never go against the grain\nKnow I been doin it, since a little stain\n{*gun cocks*} Pull a hammer, move you right out the lane\nNiggas talkin out they ass like you just sniffed 'caine\n\n[Styles P]\nMy niggas live life with a death wish\nSmoke for breakfast, a lot of people hope that I'm breathless\nWanna send my ghost to the essence\nGo head nigga, I don't care I heard the light was fluorescent\nNiggas count they ones but never they blessings\n'Til they at the wrong end out of the Wesson\nD-Block five star general\nDie Hard like Bruce Willis nigga, I could put a end to you\nRuff Ryder soldier, cold as Antarctica\nI'ma make the plans to pick your man's daughter up\nBig .45 in the sweats of my Nautica\nFifty-five bricks when I'm tryin to pick my order up\nAll my niggas flow, nobody watered up\nShoot 'til the gun empty, then niggas sort it up\nAnytime P in the booth, nigga record it up\nG-host toast, I kill niggas when the quarter's up", "title": "D Block to QB", "album": "1st Infantry"}], "artist": "The Alchemist"}