{"artist": "Pitbull", "songs": [{"album": "El Mariel", "title": "Born N Raised", "image": "https://images.genius.com/75fa8ba9c0940d123d1bb9d8d13611b4.640x640x1.jpg", "lyrics": "(Intro:)\nBorn and Raised in the County of Dade (ahhhh)\nBorn and Raised, Born Born and Raised, Born and Raised in the County of Dade. (continues in background)\nDJ Khaled!\nWhen I ride, I ride for Trey-0-5\nTrick Daddy! (When I ride, I ride for Trey-0-5)\nRick Ross!\nPitbull!\nThe Bottom!\nListenn Nigga!\n\n(Verse 1: Trick Daddy)\nTill a nigga D-I-E, I be forever thuggin baby!\nThe same nigga that's why the streets still love me baby!\nBitch I'm from Dade County\nSee I'm a 7-Trey Chevrolet Impala dope ridah\nI'll blow ya doors off\nYou race your car 'gainst my car\nI'll leave your ass so far you'll doze off\nAnd when I take off, it's like i TOOK off\nAnd when i ride by, it's like i FLY by\nYou like a slow motion\nAll in 3-D\n'cause everywhere I go, they by like \"ey yo!\"\nI fit the description\nBlack T addicted, big Glock wit me\nFor Dade County Nigga!\n\n(Verse 2: Pitbull)\n{Intro:}\nIt's that little chico Pitbull\nI'd just like to welcome y'all to where I been born, (ey Khaled spin that up dog!)\nI been raised... In the County of Dade, you know?\nYou got them boys that pass by in them old school chevies wit the top downs\nBeats that, you know, make the trunk rattle, rear-views shake\nThen they look at you wit they gold smile\nLet you know what it is\n\n{Verse:}\nI been born and raised in the county of dade\nThe land of the haze, the cocaine capitol\nWe ain't just hittin yaou buddy, we Warren Sapp'n ya\nWe comin hard like them Cubans in the 80's dog\nGo ahead, throw it in the pot I bet it's raw\nBetter ten cuidado con un tunbe por se lo llevan todo\nLlama al baba la preguntale por un despojo\nPor en final de todo tu no puedes tu no bobo..\n(\nEverything that I do, do\nEverything that I say, say\nEverywhere that I go I let 'em know hey I'm from the County of Dade!\nOld school chevy heaven\nOld school niggas preachin\nYoung niggas wild'n gettin rich of keys and violence\n\nTrick, he's the mayor\nLuke, he's the king\nI'm Mr. 305, put that on a triple-beam\nI bet I weight out more than a boat out in the keys\nHolla at them haitians, let them know this nick's on me\nWhat's up? Dade\n\n(Verse 3: Rick Ross)\n{Intro:}\nYou see him\nYou see him\nRoss\nYou see him\nYou see him\nTrick\nPitbull\nDJ Khaled\n305 M-i-yayo\n(Born and raised, born and raised born and raised in the County of Dade.)\n\n{Verse:}\nI got road dogs doin that 20-to-life\nYou try me, and ima get 20 tonight\nYou think your bitch bad, man i got 20 alike\nNot the car but you know i be pushin the white\nDippin chevy in syrup\nDigital dash\nNo bank accounts\nMy money in bags\nGo do the physics\nCause when i whip it\nAnd i love to whip it\nThat's just another digit\nThis my city, in my city ya gotta tote fire\nOver town, they'll bust ya head 'cause it won't slide\nBrown sub'll wet ya ass like a dope ride\nYou're dead wrong for thinkin them chicos won't ride\nOpa Locka revolve around that big 4-5\nThem lil haitians they take ya ass for a boat ride.,\nIn carol city, niggas quick to blow the plane wit it\nUnpack the sack and kill the game wit it! (ROSS!)\n\n(Outro:)\nBorn and Raised, Born Born and Raised, Born and Raised in the County of Dade\nBorn Born and Raised, Born Born and Raised, Born Born and Raised in the County of Dade\nBorn and Raised, Born Born and Raised, Born Born and Raised in the County of Dade\nBorn Born and Raised, Born and Raised, Born and Raised in the County of Dade\n\n{Outro Verse: DJ Khaled:}\nYeah it's DJ Khaled, do or die, Big Dog Pitbull, Terror Squad-ian, a.k.a the Beat Novacaine\nRest in Peace to my dog Uncle Al!\nI rep my city\nDade County", "year": "2006-10-31"}]}