{"songs": [{"year": "2019-03-08", "album": "Lifestyle", "image": "https://images.genius.com/8e1ccf4bffb1e69e1caeac42ff135a8b.1000x1000x1.png", "title": "Eyes on Bigger Prize", "lyrics": "[Verse 1]\nWalkin' out the smoke, you shoulda seen me through the haze\nIt’s a man who drop an album, put the scene into a craze\nTook the scene, it grew for days, I was tired of the trenches\nExtensions on my house so I could charge more when I rent it\nI put my eyes on bigger prize, my music sittin' in it's prime\nMy album sales drifted, they all listen when I rhyme\nYeah, I glisten and I shine, best position in my life\nForever on the rise till I go missin’ in the sky\nForwards on my Rolly, change the day and change the date\nBackwards, change the day, but the date'll stay the same\nSubject matter different, Kerser never been a stupid cunt\nFriends before the hitters, they don't like me just for music bruz\nThey know I keep my word and I ain't never been a troublemaker\nI ain't talkin' wrestling, you'll be meetin' with an undertaker\nNoises on my phone got me feelin’ like a dealer pumpin’\nHoppin' out my car smellin’ like half a mill' or somethin'\n\n[Chorus]\nI'm the man and I’m standin' on my own two\nTwo-two-five, ABK, we're our own crew\nCity lights in the state, it's a different life\nEarnin' big, the real hustle of this friggin' mic\nEver had a mate and talkin' 'bout a partner deal?\nI walked out, don't insult me with your half a mill'\nI'm on a level and I'm feelin' like I'm comfortable\nIt's a curse, you know that, but who the fuck are you?\n\n[Verse 2]\nKeepin' at a hundred, don't you know we rockin' ABK?\nI ain't need to help the scene I done it when I paved the way\nAll the music, call it movitivation for some profit\nInspiration for the younger rappers, time to stack your wallet\nI'm a different kind of great, from Campbelltown when it was Campbell-Town\nOnly rock it if brand new, I used to rock the hand-me-downs\nFuckin' slicin' rap way before you even saw a mic\nRappin' all these years and I ain't never had to force a line\nA special kind of excellence and that's why I'm your preference\nUsed to put my pills in the same thing as my peppermints\nI'm stayin' at the front and I'm aware that it's a crazy place\nSaid she can't say no to me, she blame it on my babyface\nThey talk about their goals and I just sit there like, \"That's lookin' great\"\nI didn't bust a sweat and put 10K up for a footy game\nWhen I hit the stage you can tell that I'm a superstar\nThe clothes I'm rockin', they look like I got 'em from the future, bruv\n\n[Chorus]\nI'm the man and I'm standin' on my own two\nTwo-two-five, ABK, we're our own crew\nCity lights in the state, it's a different life\nEarnin' big, the real hustle of this friggin' mic\nEver had a mate and talkin' 'bout a partner deal?\nI walked out, don't insult me with your half a mill'\nI'm on a level and I'm feelin' like I'm comfortable\nIt's a curse, you know that, but who the fuck are you?\n\n[Verse 3]\nClassic after classic, up and bump 'em, get 'em out the way\nRed and blue seepin' through my car and it ain't POWERADE\nFuck off, I'm a rapper, everything I got, I really own\nPoppin' pingers in your state and I feel at home\nHit another state, get a cheque and then I fly home\nEverything I got from what I write down on my iPhone\nBefore that I had the paper with a Bic pen\nCheck the stats, I was even writin' hits then\nDrivin' fast, switchin' cars 'cause I'm bored of one\nWas gonna sell one, I think I'll give my daughter one\nI'm a seasoned vet, true, I'm an animal\nOf course I am the king, man, I'm only thinkin' rational\nPress the issue then you're gonna cop a backlash\nTwenty K stacks if I'm walkin' with a backpack\nThat's cool, now they're sayin' I'm an OG\nAnd only lookin' 23, man, I'm so clean\n\n[Chorus]\nI'm the man and I'm standin' on my own two\nTwo-two-five, ABK, we're our own crew\nCity lights in the state, it's a different life\nEarnin' big, the real hustle of this friggin' mic\nEver had a mate and talkin' 'bout a partner deal?\nI walked out, don't insult me with your half a mill'\nI'm on a level and I'm feelin' like I'm comfortable\nIt's a curse, you know that, but who the fuck are you?"}], "artist": "Kerser"}