{"songs": [{"image": "https://images.genius.com/8ab5eeecff25b17cb0aada47b6f1cc02.600x600x1.jpg", "lyrics": "[INTRO: Spoken]\nAll right, dust off a pimp when you see him\nNow I don't like talking before songs, really...\nBut I'm gonna tell you\nThis is a new approach to positivity\nA new approach to dealing with your problems\nYou see one of them problems\nYou got money problems\nYou got weight problems\nYou better tell that bitch to get out on the corner and get your mother fucking money\nWe pimp slappin' our fucking stress today, baby\n(Yo)(Uh)\n[Verse 1]\nToday you feel stressed\nToday you hate your friends\nYour wallet's hurtin', the entire world is cavin' in\nYou need to lose a couple pounds\nYou need to get in shape\nYou can't sleep but you're tired of making big mistakes\nYour roommate's always being such a little selfish queen. They're always messy and obnoxious, they don't help you clean\nYour sick to your stomach to get back your girl\n[BRIDGE VARIATION 1]\nWell, I'm Uncle Mac and I'mma help you pimp slap the world!\n(Uh)\nYou got some big expectations, don't wanna live those doown\nIt's not a carnival but trust that merry still goes 'round\nI give a FUCK that it's raining, just roll your windows down\nAnd let yourself get soaked, blowing out the weeed smoke\n[SUPPLEMENTAL 1]\nI love it, I'm here to heal the public\nYou got a case of the Mondays\nI got a case of the Fuck-its\nSo tell me if you need a couple OXYs or a ZANY\nAnd I'mma drop you off with your family. DAMN ME\n[Chorus]\nThis world is such a bitch\nThis world is such a silly bitch\nSometimes you need to retract\nAnd straight up slap it like a pimp\nSlap it like a pimp\nSlap it like a money getting, cane pushing, pimp\nThen you say 'I don't give a fuck! I ain't feeling stressed today!'\n'I don't give a fuck. Everything is just OK.'\n'I don't give a fuck! I ain't feeling stressed today!'\n'I don't give a fuck. I'm a mother fucking pimp.'\n[VERSE 2]\nToday you feel sick\nToday you're tense and anxious\nThe bill collectors calling you speaking in different language\nYou're getting sick of anguish\nYou're sick of drunk people\nOn Friday night you're home alone just saying 'FUCK PEOPLE!'\nYour father always judges you inside, you hate him for it\nYou held the door for somebody that didn't thank you for it\nYour man left for a rich bratty girl\n[BRIDGE VARIATION 2]\nWell, I'm Uncle Mac and I'mma help you pimp slap the world\nYou got some big expectations, don't wanna live those down\nIt's not a carnival but trust that merry still goes 'round\nI give a FUCK that it's raining, just roll your windows down\nAnd let yourself get soaked, blowing out the weeed smoke\n[SUPPLEMENTAL 2]\nI'm on it, this cosmic spread\nI'm Drinking 90 minute IPA by Dogfish Head\nSo down a bottle with me, homie, DAMN, sit back\nAnd hit your problems with a open hand pimp slap!\n(Brrrrappp!)\n[Chorus]\nThis world is such a bitch\nThis world is such a silly bitch\nSometimes you need to retract\nAnd straight up slap it like a pimp\nSlap it like a pimp\nSlap it like a money getting, cane pushing, pimp\nThen you say 'I don't give a fuck! I ain't feeling stressed today!'\n'I don't give a fuck. Everything is just OK.'\n'I don't give a fuck! I ain't feeling stressed today!'\n'I don't give a fuck. I'm a mother fucking pimp.'\n[VERSE 3]\nYou're feeling stressed about your whack cash flow\nWell, put your diamond rings on and smack that, hoe\nIllegal parking job, your car got toed\nWell, put your diamond rings on and smack that, hoe\nShiny alligator shoes, thousand dollar Gucci suit\nFeather in your hat, you slammin' Cadillac dooors\nEvery problem in your life's a dirty fucking hooker\nTake two steps back and pimp slap dat, hoe!\n(Uh)\n[BRIDGE VARIATION 3]\nYou got some big expectations, don't wanna live those doown\nIt's not a carnival but trust that merry still goes 'round\nI give a FUCK that it's raining, just roll your windows doown\nAnd let yourself get soaked, and fucking wet\n[SUPPLEMENTAL 3]\nI need it. I've always fucking needed it\nSometimes the best solution is a drink or getting weededed\nBut other times you gotta take your problems and just choke them\nSwell their eye and leave their nose broken\nLike a pimp!\n(END)", "year": null, "album": "Postcards From Kansas City", "title": "Pimp Slap the World"}], "artist": "Mac Lethal"}