{"artist": "Prince Po", "songs": [{"album": "Process of Elimination ", "title": "To All My People", "image": "https://images.genius.com/0a195b4697db9147f19966b2bdd22d3d.300x300x1.jpg", "lyrics": "* soft spoken ad lib for 10 secs *\n\"To all my people I'm out\" ---] Vin Rock\n\"To all my people I'm out\"\n\n[Intro/Hook - both (x2)]\nYo who can still rock a park?\nGet in that ass if you bark\nIt's Prince Po, hope you weather the storm\nAnd don't be afraid, ma let's enjoy the day\nYo I can help you throw your troubles away\n\n[Rude One]\nYo I know Prince for a minute, don't get no realer than this\nI got love, went through some shit but now the medicine's done\nConcocted hot shit, straight off the block like rocks did\nMelody, you corny MCs we make smedley's\nWith no corner degrees, y'all tryin to pass the gology\nCheck your history then I'm a Southside resident\nHoldin quarter bricks yo back when Reagan was President\n\n[Prince Poetry]\nWe be the rugged N-Y's, Medicinemen, intelligent\nMy two's spread nights with hustlers under streetlights\nThe beat strike vital hearts as I heat mics\nHot lava in the form of words\nGot you lovin this natural high as I spit these 'erbs\nEmbrace, lace it with this impeccable taste\nGot the club rockin, titties mad hard off the bass\nYa heard? A nigga gotta always make moves\nAnd continue to shine like Armourall on the shoes, what? Huh\n\n[Hook - x2]\n\n[Prince Poetry]\nYo, I'm on a mish' to get rid of dead weight, ready to bubble\nToo much shit in this life to juggle, this for real struggle\nI keep it movin with all three eyes open (Hah)\nLyrical content is potent, rather well spoken\nI'm massin all my niggas to get it cos wit it\nWe all movin, without it we all lose, I'm about it\nBut we split it (50-50 nigga), if I bust shots to cover your back\nI give it up to see where some niggas' heads are at\nCos brothers do get grimy over nickels and dimes\nAnd if you was my man you wouldn't be reachin for mines\nDamn, catch me on Liberty in the van\nBut one block over, on the corner devisin the plan\nMy niggas Rude and Nice be holdin me down (for real) since a teen\nNow we some veterans of this medicine, stackin the green\nFrom 7-1-8, to 7-0h-2, to 5-1-Oh\nPoe'll make ya shake the stress so act like ya know huh, what?\n\n[Hook - x2]\n\n[Rude One]\nYo half my niggas been, sent to the essence, I make the best of a\nTight situation, organizin emancipation\nTo live life, rip mics, get nice without fights (Ugh)\nCopyright my shit (ugh) and get paid in the spotlight\n\n[Prince Poetry]\nI'm still buckwild like a cock fight, take flight only to win\nBut if I fail all I know is I'm startin over again\nForty projects baby boy, still stickin and movin like Roy\nPrince Poe lyrically bringin you joy\nWhat? What? What?\nC'mon\n\n[Hook - x2]\n\n[Outro - Prince Poetry]\nC'mon, uh-huh-huh-huh\n'98 or better baby, this is how we do it\nUgh, to all my peoples come on\nIt's all good, gotta few words to uplift the spirits, no doubt\nNew York, outer city limits, it's all good baby boy\nDon't hate girl, lemme holler atcha for a while\nUh-hah, ugh ugh, la-la-la, la-la-la, la\nYeah, believe me yo, get it twisted, get smacked motherfucker\n* laughter * But it's all love y'knowI'msayin?\nY'knowI'msayin I be the God, you be the thug\nUh-huh-hah-huh-hah-ah, one love y'all\nIt's all love, it's all love, cheers Nice it's all love\nIt's all love Big Riq it's all", "year": null}]}