{"artist": "Valete", "songs": [{"title": "Pseudo Mcs", "year": null, "lyrics": "[Verso 1: Bónus]\nWack MC's não têm diploma mas são doutorados\nVêm já atrofiados e com o crânio inacabado\nPensamento 'tá lesionado, o som vem intoxicado\nReencarnações de um pneu suplente furado\n\n[Verso 2: Valete]\nPseudos vão para camas de hospital com estes versos em brasa\nBeefaram comigo agora reclamam por eutanásia\nRimas frias, vazias, é só teoria e pouca prática\nVocês estão abaixo de zero, representam a Antártida\n\n[Verso 3: Bónus]\nWacks vêm com blá blá blá mas levam logo o corte\nNão têm o fucking dote, não há quem vos suporte\nWack mc, rap contigo não condiz mas isso não vês\nLanças-te no mercado nem a tua crew compra os CD's\n\n[Verso 4: Valete]\nOrador infeliz, aprendiz de aprendiz\nEm guerra lírica pseudo mc's são refugees\nValete mc de raíz, hip-hop directriz\nNa hora de te eliminar eu tenho o apoio do Green Peace\n\n[Refrão - Valete]\nValete e Bónus aqui e agora neste assassin sound\nJá chega de ver fake mc's a mexer naquilo que é meu\nVocês não estão prontos para andar aqui no underground\nPoyeah poyeah baza poyeah poyeah!\nWacks e biters não têm espaço aqui no movimento\nNão dá para ti motherfucker tens que ser mais convincente\nNunca vais 'tar pronto para andar aqui no underground\nPoyeah poyeah baza poyeah poyeah!\n\n[Verso 5: Bónus]\nPosso falar no singular mas a mensagem é plural\nTu e os teus pares são o fim da decadência verbal\nEsse teu mic handicap é anormal e surreal\nConcentras mais porcaria que um aterro universal\n\n[Valete 6: Valete]\nPseudo, interpretaste ritmo e poesia na forma errónea\nNunca soubeste rimar mas sabes curar insónias\nAgora não fazes cerimónias para rimar aquilo que não é teu\nSe queres ser liricista leva um neurónio meu\n\n[Verso 7: Bónus]\nTu és hip-hop ópio, por favor mantém-te sóbrio\nDizer que rimas é quereres-te enganar a ti próprio\nA tua obsessão é comigo ilusão, gigantes não vêem micróbios\nÉs o pior rapper do ano, já podes pisar o pódio\n\n[Verso 8: Valete]\nCausas tédio, mau cheiro vem por teu intermédio\nTu não tens fãs, só as moscas é que te fazem assédio\nPraga sem remédio, estagnado no primeiro milénio\nTu és um plagiador e fazes de mim o teu oxigénio\n\n[Refrão - Valete]\nValete e Bónus aqui e agora neste assassin sound\nJá chega de ver fake mc's a mexer naquilo que é meu\nVocês não estão prontos para andar aqui no underground\nPoyeah poyeah baza poyeah poyeah!\nWacks e biters não têm espaço aqui no movimento\nNão dá para ti motherfucker tens que ser mais convincente\nNunca vais 'tar pronto para andar aqui no underground\nPoyeah poyeah baza poyeah poyeah!\n\n[Verso 9: Bónus]\nYo deixa o mau génio, para quê tanta teimosia?\nJá é mais que sabido que não existe a lenda porcaria\nNavegante da pia, lirico-hemorragia\nSe um dia o rap vivesse de ti, o movimento falecia\n\n[Verso 10: Valete]\nFicaste fora do prazo, gasto, agora rap holocausto\nA voz é uma arma, vocês nunca vão ter cadastro\nRimador de rastos, musicólogo nefasto\nÉs pai dos teus beats mas eles chamam-te padrasto\n\n[Verso 11: Bónus]\nYo vocês multiplicam-se para fazer cair a cultura\nMas ela é duradoura e não aceita a vossa assinatura\n'Tou farto dos teus absurdos, tenta aprender com os graúdos\nSenão continuarás wack mc até no meio de surdos\n\n[Verso 12: Valete]\nNa tua zona a lentidão de pensamento é a única verdade\nAté as loiras são apanhadas em excesso de velocidade\nRap não é para ti chavalo, é só para pensadores enérgicos\nIsto é maratona verbal, vocês são paraplégicos!\n\nAgora esses manos pensam que têm uma esferográfica\nE um papel e já pensam que são mc's...\nMan, onde é que está o QI? É o cérebro que escreve...\n\n[Refrão - Valete]\nValete e Bónus aqui e agora neste assassin sound\nJá chega de ver fake mc's a mexer naquilo que é meu\nVocês não estão prontos para andar aqui no underground\nPoyeah poyeah baza poyeah poyeah!\nWacks e biters não têm espaço aqui no movimento\nNão dá para ti motherfucker tens que ser mais convincente\nNunca vais 'tar pronto para andar aqui no underground\nPoyeah poyeah baza poyeah poyeah!", "album": "Educação Visual", "image": "https://images.genius.com/51d60e7328e4b1048f51604aceb3c06b.1000x750x1.jpg"}]}