{"artist": "Angel Haze", "songs": [{"title": "Shabba", "image": "https://images.genius.com/5be152015519be507a6e26d1760ae9fd.405x405x1.jpg", "album": null, "lyrics": "Yeah, Yeah, Yeah\nYeah, Yeah, Yeah\nWoo!\n\n[Verse 1: Angel Haze]\nI know all I do is shit talk\nBut honestly I’m pissed off!\nI’ve been like the fucking realest since I kicked up\nCatch me chilling with a model and the strip star\nIf you know me then you know that my shit raw\nSpit hard, nigga, actually I spit bars\nJump on the wagon, show me love, show me fucking love\nWhile the rest of the world getting pissed off\nGet flipped off, I’m just here doing what I meant for\nTalk shit, I snap you get sent for\nI might be cordial, you might smile at you fuckboys\nBut none of you niggas exempt tho\nPicture me giving a shit, tho\nThat’s like two shots of the tempo\nI’m killing myself and like everyone else\nDo I got competition? shit, no!\nAll of you bitches are weak clones\nI know the game, I got chicos\nMy dude a pro shooter, my bitch work at Hooters\nThey worship the ground that my feet on!\nMurdered you niggas on your song\nIf you said that I couldn’t, then you’re wrong\nStick to your pace, and you came back an ace\nAnd did that shit all within four songs\nBitch!\n\n[Hook: Angel Haze]\nShabba Rank, bitch, sha\nShabba Rank, bitch!\nGimme Bank Bitch\nTrap Lord, shit!\nTrap Lord, bitch, yeah!\n\nAoooouuh!\nWhoo! Whoo! Whoo! Whoo!\n\n[Verse 2: Angel Haze]\nI am far too immaculate\nTo not jump on the track and spazz the bitch\nTo not walk in the club and smack a bitch\nTo not throw a bad bitch where the mattress is\nYo, Angel Haze!\nBars for days\nAh wait, hold on! Replay!\nAngel Haze, bars for days\nShots like a motherfucker campus range\nAt BCU never Junior Tech\nAnd I keep the automatic on a dashboard deck\nI'm on set with my chick that sails\nYou are on that money train that has been derailed\nFuck!\nYo, I feel sorry for the runner up\nCause I forever spit cold, better bundle up\nI got an ill nigga, he got a nice flow\nI just get the brain, like a micro\nSick flow but I think it’s psycho\nDash face bitches like a typo\nThat’s reality like a live show\nYou’re in my lair, you gotta get the right tone\nI’m shooting with the camera\nI hope I got you with the right pose", "year": "2013-10-19"}]}