{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "Working the Wheel", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "\"Hold up...\" {*echoes*}\n[Slim Thug]\nSmoke somethin, bitch! {*starts laughing*}\n\n[Hook]\n{*Pimp C sampled from Three 6 Mafia's \"Sippin on Some Syrup\"*}\n\"I'm trill working the wheel, oh you can get a biz-zerd\"\n\"I'm choking on that doja sweet and sipping on that sizz-erp\"\n\"I'm trill working the wheel, oh you can get a biz-zerd\"\n\"I'm choking on that doja sweet and sipping on that sizz-erp\"\n\n[Slim Thug]\n(Slim Thugga! Muthafucka!)\nI'm still trill, working the wheel (wheel), it's pimpin at its finest (at its finest)\nWe playas of the year, you other simps is behind us (is behind us)\nStill sideline hustlin, got 'em for the chief (Geah!)\nOnly nigga in '06 hittin licks off this beat (Ha!)\nPhones get ya fucked off, so need for conversations (un uh!)\nJust hit me when ya get up to that corner gas station (here I come)\nKeep a candy blue 'llac, pop the trunk on the chrome (on the chrome)\nHad the state ridin dirty 'til the Pimp came home (free Pimp C)\nNow it's on, get ready for that Texas takeover (takeover)\nWe got the whole world sipping on them purple sodas (Ha!)\nSaying, \"Man, hold up!\" (up!) And screaming, \"What it do!?\" (what it do)\nShowing off the diamond grills, swangin, bangin on the screw (bangin on the screw)\n\n[Hook] - repeat 2X\n{*Pimp C sampled from Three 6 Mafia's \"Sippin on Some Syrup\"*}\n\"I'm trill working the wheel, oh you can get a biz-zerd\"\n\"I'm choking on that doja sweet and sipping on that sizz-erp\"\n\"I'm trill working the wheel, oh you can get a biz-zerd\"\n\"I'm choking on that doja sweet and sipping on that sizz-erp\"](1141507)\n\n\n[Pimp C]\nUh! Pimp C, I ain't never made love (made love!)\nSome of my friends sell drugs! (Uh!)\nI got some bitches with some cock good as gold (good as gold!)\nCause good hot pussy is to be throwed and sold\nSee me, I'm stackin my paper, grippin my wood\nDiamonds up again, just like it should\nMe and Young Thug, up in yo' hood\nPimpin a ho like a trill nigga could\nCause everyday is a holiday (holiday)\nPoppin tags on a collar day (collar day)\nGirls want this hot dollar cum, wanna suck my dick, wanna swallow Mae (Uh!)\nEverything is everything, when I think to fuck with my pinky ring (ring)\nSipping on a colt purple thing (purple thing), candy red drop sittin on swang\nI whip the 'llac like a whip a bird (whip a bird)\nUsed to drink and then hit the herb (hit the herb)\nCars swerve but don't hit the curb\nGot kids in the 'burb, sipping on syrup\n\n[Hook] - repeat 2X\n\n[Slim Thug]\nMy nigga Pimp off lock, off that lot in a Bentley (in a Bentley)\nThat's how that Texas represent, blowin 'dro behind tint (Geah!)\nBut still ain't let this money change us, still keep a set of swangers\nOn a drop in the garage, with a trunk full of papers\nFit this poppin room with hash pots, shining like stars (shining like stars)\nShe don't wanna fuck me she wanna fuck my car (fuck my car)\nBustin down a cigar, fillin it up with the green\nFire it up! Couplet on the money, cup for the lean\n\n[Pimp C]\nSlim Thug 'bout to fan 'em (fan 'em!), fuckin niggas' heads up (up!)\nHo didn't know us country niggas had our bread up (bread up!)\nEveryday I eat too many shrimp\nEvery city that I go to, bitches love a pimp!\nNow the shit gon' stop, we got this game by the nuts\nPuttin pistols to these niggas and puttin dick in these hoes' cunts\nBeen around the world, then I went to the pen\nFought, fled, came back, I finger fucked my enemies again\nBitch niggas get some nuts, bitch niggas say my name\nWe ain't got no time to be guessin and playin those pussy ass games (pussy ass games!)\nYou pussy niggas must be smokin that krush\nTake that monkey record off, you embarrassing us, huh!\n\n[Outro: Pimp C]\nKnow what I'm talkin 'bout!? It's goin down in the South!\nYoung Slim Thug and Young Pimp C... already!\nPuttin it up in these bitch ass niggas' faces!\nAnd we had the money down here, pussy ass nigga!\nU.G.K. Records and Boss Hogg Outlawz!\nIt's goin down!! Huh!!", "year": "2006-07-11"}]}