{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "Ms. Bird", "album": "Birdman", "lyrics": "(Intro:Baby)\nUh huh uh huh\nCut me up in my head, Cut me up nigga fuck\nAy ay Fresh, its all gravy baby\nIts my turn nigga, I'm under the burn biotch\nIf you ain't getting money, you's a crazy motherfucker (got to be a crazy motherfucker)\nI ain't getting money, I'm probably a crazy motherfucker (lord help me)\nThis is a biotch, biotch\n\n[Baby]\nCome on nigga\nIts them pimpin, ballin, gangster macks\nTheys old school caddies with them bows and racks\nThe new school bens with them bows to match\nBut its the Birdman daddy got them O's of crack\nA nigga off the diet cause a nigga gettin fat\nThem throwback jerseys with them throwback hats\nBurberry timbs with the fence to match\nAnd I'm so so fly, and mommy like that\nOunces of that purple and we do it by the sac\nRag-top bens with them rag-top lacs\nNothing to a gangsta nigga choak your strap\nWe live for money, hoes cooking that crap\nThem 20\" rims and them tires are flat\nThere ain't no question, that stunna is a mack\nA nigga thought it was over but bitch we back\nWith daimonds in the middle PIMP, daimonds in the back BITCH\n\n[Chorus: Mannie Fresh - repeat 2X]\nEvery Place that I went to\nAbout a hundrend bad broads say they sent you\nA picture of themselves but naked, ya heard\nThey all wanna be Ms. Bird, Ms. Bird\n\n[Baby]\nYou know I got that Crystal on the rocks\nYou see a nigga's jewels, no name on the watch\nUntil a nigga die these cops gon watch\nBut I don't give a fuck nigga, the shit don't stop\nAll I'm trying to do is stack a knot\nThem aligator seats with them brand new drops\nThem hoes gonna jock cause they see a nigga hot\nRiding on my jet skiis behind a nigga yot\nTen up in my ear ma ten up on a watch\nReal hot girls gonna jock a spot\nSo grab a nigga dick bitch drop it like its hot\nThe same old nigga off them up-town blocks\nI came around your corner and I shit your spot\nIt's (?) and I serve your block\nA Cash Money hot boy and I pop the lock\nA know beat boy with the rooka rooka rock biotch\n\n[Chorus] - 2X\n\n[Mannie Fresh]\nNow Dada, Barbara, Kiesha, Tarisa and Dawn\nI'm tired of having sex and I want to go home\nBut I can't leave yet cause they kissing each other\nPlus I'm hot and I'm horny, I'm getting my rubbers\nWhat that tatoo on your tittie say, Hood Rich\nLet me your ass, oh wolves' bitch\nGod damn Ms. Kiesha ain't your momma a teacher\nYour sister is a mister and your daddys a preacher\nNow you's a mixed up screwed down dike type chick\nIf you ain't eating pussy then you sucking good dick\nNow every place that I go to\nAbout a hundred grimey niggas say the know you\nAnd they all got that movie that you made with that man\nDon Da Don Don Don, stop playin\nIf you seeee, the movieeee (triple x bitoch)\n\n[Chorus] - 2X"}], "artist": "Birdman"}