{"songs": [{"album": "Activated", "image": "https://images.genius.com/dbf64d5289adc1fb1c700f63f63dfe25.945x945x1.jpg", "year": "2018-05-11", "title": "Jettski Grizzley", "lyrics": "[Intro: Lil Pump]\nOoh, Eskeetit!\nHelluva made this beat, baby\nOoh, Eskeetit!\n\n[Chorus: Tee Grizzley & Lil Pump]\nSlide down my block we gon' shoot, we gon' shoot (oouu) (we gon' shoot)\nLil' baby a thot, but she cute, but she cute (yeah, cold)\nI just want the top then you through, then you through (oouu, done)\nNiggas say they gettin' guap, where the proof, where the proof? (where it's at? huh)\nSlide down my block we gon' shoot, we gon' shoot (brra, brr)\nLil' baby a thot, but she cute, but she cute (yeah, cold)\nI just want the top then you through, then you through (oouu)\nNiggas say they gettin' guap, where the proof, where the proof? (where it's at? Eskeetit!)\n\n[Verse 1: Tee Grizzley & Lil Pump]\nIf I catch an opp in traffic he gon catch the K\nHope he know that when I shoot I'm tryna catch his face (yeah)\nCalled my plug like, \"What bag I'm 'bout to catch today?\" (oouu)\nI got 200 on that Rolls, you can't catch the Wraith (Eskeetit!)\nI'm in love with my bitch ass cheeks (oouu)\nTold that hoe my lap was her assigned seat (yeah)\nHe gon' choke her out if he found out I had her chokin' (wow)\nAnd my watch mil', you will drown, my AP the ocean (oouu)\n\n[Verse 2: Lil Pump]\nEskeetit!\nBitch, don't call me Pump, my name Jetski (Jetski)\nMillion dollars cash, just layin' in the bedsheets (oouu)\nAll your jewelry fake, boy, that shit don't impress me (nope)\nGot a AP, sip lean, don't drink Henny (yeah, oouu)\nTag team a bitch pass her to the bro (oouu, yeah)\nEx-bitch a hoe, had to let her go (let her go)\nHad her suck my dick for a line of coke (oouu)\nSpent 20 thousand on a rain coat (chyeah, huh)\n\n[Chorus: Tee Grizzley & Lil Pump]\nSlide down my block we gon' shoot, we gon' shoot (oouu) (we gon' shoot)\nLil' baby a thot, but she cute, but she cute (yeah, cold)\nI just want the top then you through, then you through (oouu, done)\nNiggas say they gettin' guap, where the proof, where the proof? (where it's at? huh)\nSlide down my block we gon' shoot, we gon' shoot (brra, brr)\nLil' baby a thot, but she cute, but she cute (yeah, cold)\nI just want the top then you through, then you through (oouu)\nNiggas say they gettin' guap, where the proof, where the proof? (where it's at? Eskeetit!)\n\n[Verse 3: Lil Pump & Tee Grizzley]\nShe looked at my wrist, she had a heart attack (water)\nBitch you in ya house, shakin' shit just like a runnin' back\nGave your bitch good dick, had her doing jumpin' jacks\n2 mill, 8 mill, man I want it all cash (yeah, all cash, oouu)\n20 on my gucci fit (oouu)\nYeah I got a thick bitch (yeah), all you niggas counterfeit (huh)\nSpanish hoe she with the shits (oouu), I put 10 bricks on a Lyft (ten)\nToo much hoes I cannot pick (oouu), don't know which one I should hit (yeah, oouu)\n\n[Verse 4: Tee Grizzley]\nI might fly the jet to Waikiki (G5)\n3500 for the sweater 'cause it's GG (Gucci!)\nHit her in the shower, made that lil bitch do the mini me\nMe and Jetski drippin' on a bitch, neck on Fiji (water)\nWatch really hittin', ain't no funny camera tricks (ain't no apps)\nGettin' chewed up by my lil' hispanic bitch (como estas)\nNo you can't spend the night, don't bring your pajamas bitch\nAnd whoever don't like it suck a dick with extra spit, bitch (Booah)\n\n[Chorus: Tee Grizzley & Lil Pump]\nSlide down my block we gon' shoot, we gon' shoot (oouu)\nLil' baby a thot, but she cute, but she cute (yeah, cold)\nI just want the top then you through, then you through (oouu, done)\nNiggas say they gettin' guap, where the proof, where the proof? (where it's at? huh)\nSlide down my block we gon' shoot, we gon' shoot (brra, brr)\nLil' baby a thot, but she cute, but she cute (yeah, cold)\nI just want the top then you through, then you through (oouu)\nNiggas say they gettin' guap, where the proof, where the proof? (where it's at? Eskeetit!)"}], "artist": "Tee Grizzley"}