{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/3f715b9267fdd2d0c862b134c0b1e648.300x300x1.jpg", "year": "2016-10-10", "album": "HOTEL", "lyrics": "[Intro: Yelawolf]\nI just wanna hang with real people\nYou know, I don't give a fuck about how much money you got\nWho you know, none of that\nBe authentic, that's the type of people I want to kick it with\n\n[Verse 1: Yelawolf]\nMotherfucker I'm, a catalyst of the baddest that you can find\nCowboy hat, sittin' crooked in the corner of the club when I'm sippin, my\nJack, beautiful woman on my side\nFact, you ain't gotta tell me, I know, I'm fucking getting it\nFake motherfuckers just talk, I'm fucking living it\nChevy in the parking lot\nBut I’ve had a few holmes, I'ma have to Uber home\nI'ma have to pull my phone out, hit the icon, baby\nThen I’m moving on, but I won’t do it alone, uh\nTake a walk with a wolf, girl\nI can make a good girl a hood girl\nWe can get down and party, shaking the Chevy\nBut whatever happens in the truck, if you could, girl\n\n[Chorus: Yelawolf]\nPlease just be yourself\nBe somebody, make somebody say you’re like no one else\nNobody wanna hang around somebody that is boring\nI'd rather be by myself and drink on the Porch Swing\nSo hold your breath if you can't be yourself\nBe somebody, make somebody say you’re like no one else\nNobody wanna hang around somebody that is boring\nI'd rather be by myself and drink on the Porch Swing\nSo hold your breath if you can't be yourself\n\n[Verse 2: Bubba Sparxxx]\nI love it, I love it\nI'm buzzing enough just to fucking (go nuts)\nFuck discussion, ain't discussing nothing, I'm just gon' (roll, up)\nShow up, show out, big dog, watch how that money go (fold up)\nDidn't know then, but we know now, them clowns we ain't never (told us)\nSo what? You know what?\nThat stuff there is what had made me (grow up)\nThink I can't? Bitch, think we ain't, think what you think you (ho, slut)\nLet that tongue besides both nuts\nThen swallow this whole pole up\nWhile me and Single Wolf pour up\nShow love\n\n[Hook: Yelawolf]\nBe Yourself\nBe somebody, make somebody say you’re like no one else\nNobody wanna hang around somebody that is boring\nI'd rather be by myself and drink on the Porch Swing\nSo hold your breath if you can't be yourself\nBe somebody, make somebody say you’re like no one else\nNobody wanna hang around somebody that is boring\nI'd rather be by myself and drink on the Porch Swing\nSo hold your breath if you can't be yourself\n\n[Verse 3: Yelawolf]\nStep up in this motherfucker with a black hoodie cuz I'm icy cool, yeah\nSpillin' so much ink on the paper I could have filled up Drake’s pool, yeah\nThey told me to get ready but I've been ready, fucking Betty's way back in school, yeah\nAn animal, Hannibal, cannibal couldn't manage to get a handle, I'm too sick\nButters off, leather seats creeping up the alley in the Caddi like \"Who's this?\"\nCatfish, hold up\nWhen you see me coming, homie, throw the deuces\nGot a couple  killers in a camp, wanna dance motherfuckers is ruthless\nBack in the, back of the Chevy holding something heavy, g-g-g-get it, let's go!\n\n[Hook: Yelawolf]\nBe Yourself\nBe somebody, make somebody say you’re like no one else\nNobody wanna hang around somebody that is boring\nI'd rather be by myself and drink on the Porch Swing\nSo hold your breath if you can't be yourself\nBe somebody, make somebody say you’re like no one else\nNobody wanna hang around somebody that is boring\nI'd rather be by myself and drink on the Porch Swing\nSo hold your breath if you can't be yourself", "title": "Be Yourself"}]}