{"artist": "Vado", "songs": [{"title": "Hate", "year": "2017-10-31", "lyrics": "[Verse 1]\nI hate that the world is in dangers\nI hate that my girl is a stranger\nI hate that I'm filled with this anger\nAll this nonsense they bringing my name up\nAll the gossip I hate to be famous\nHate that I made this\nI hate how they hate on me\nI hate how they put their weight on me\nCan't wait on me\nI hate how my man changed on me\nGod knocked and put the blame on me\nYo that ain't on me\nHate being vocal makes you unlike\nHate being social means a device\nI'ont need no advice\nIt's funny how they quick forget that you nice\nI hate how they ain't gotta think when they write\nAnd y'all thinking it's right\nHate when that money don't stack tall\nI hate how executives back off\nI feel that I'm black balled\nHate my nigga still getting crack off\nHate that I ain't got them on rap tours\nI hate it all\nI hate it all\n\n[Verse 2]\nI hate that the streets love no one\nI hate what's the price of a whole one\nI hate I ain't get the offwhite all ones\nHate getting asked can I hold something\nOr giving them a pass when they owe something\nI hate how these coons move\nHate how these kids got loose screws\nFix a kid quick with some new shoes\nHate hearing good news\nHate a nigga feel that I could lose\nI hate that niggas feel that I should lose\nHate I'm a good dude\nHate the fact that she lost that\nOr when she found out took the porsche back\nHate that I crossed that\nHate that you still ain't off that\nI hate that it's hate that caused that\nI hate it\nI hate it\n\n[Refrain x2]\nI hate rain, I hate pain, I hate drama\nHate game, I hate fame, I hate karma\nHate fake, I hate jake, I hate suckers\nHate wakes, I hate snakes, that hate others\nHate foes, I hate hoes, I hate demons\nHate stress, I hate deaths, I ain't breathing\nHate beef, hate going and hate leaving\nHate people that just hate for no reason\n\n[Outro]\nSo why they hate on me?\nSo why they hate on me?\nWhy they hate on me?\nSo why they hate on me?", "album": "Sinatra 2.5", "image": "https://images.genius.com/bc1bd4f17824ab294e8001f40fb0cb12.600x600x1.jpg"}]}