{"songs": [{"title": "Ooouuu (Remix)", "lyrics": "[Intro: Young M.A. & 50 Cent]\nYo bro\nWhat's up?\nI think I had too much Hennessy, man\nI'm fucking with that Effen\nThis Hennessy getting to me\nI ain't gonna lie, I’m a little smizz\nWho that? They with us?\nI'm a little drizz\nLet 'em in, let 'em - 50\nBut we in the club, man, OOOUUU\n\n[Verse 1: 50 Cent]\nI let my young niggas drill like power tools\nPower on every week, I make power moves\nTalk what? I come through with all kinds of jewels\nBeat the case, come to court with all kinds of Jews\nGot your bitch telling me to go slow\nShe bouncing on the stick like a pogo\nShe went below the belt, that's a low-blow\nThen tried to take a selfie, that's a no-no\nNiggas be hating on the low though (I see 'em)\nSee me in the Coupe or that four-door (yeah)\nYou say you the plug, where the dough go? (dough go)\nWe throw that at them hoes in the go-go\n50 back on that bullshit\nYou cool with my opps, we ain't cool, bitch\nYou got to watch how you do shit\nThat's just not how real niggas do shit\n\n[Hook: Young M.A]\nOoouuu, ooouuu\nThese haters on my body, shake 'em off\n\n[Verse 2: Young M.A]\nYea they hate but they broke though (they broke though)\nAnd when it's time to pop they a no-show\nYea I'm pretty but I'm loco (yeah I'm loco)\nThe loud got me moving slow-mo\nAyo Tweetie, where the hoes bro? (where the hoes bro)\nAyo Keys, where the hoes tho? (where the hoes tho)\nThat other nigga, he a bozo (he a bozo)\nIt's M.A, you don't know ho? (you don't know ho)\nWe got liquor by the boatload (that Henny)\nDisrespect the Lyfe that's a no-no (that's a no-no)\nAll my niggas dressed in that rojo (Redlyfe)\nI ride for my guys, that's the bro code (that's the bro code)\nBaby gave me head, that's a low blow (that's a low blow)\nDamn she make me weak when she deep throat (when she deep throat)\nI need a rich bitch not a cheap ho (not a cheap ho)\nThey be on that hate shit, I peep tho (yo I peep tho)\nMy brother told me fuck em', get that money sis (go fuck em')\nYou just keep on grindin’ on ya hungry shit (aha)\nIgnore the hate, ignore the fake, ignore the funny shit (ignore the funny shit)\nCause if a nigga violate, we got a hunnit clips\nAnd we go zero to a hundred quick (ooouuu)\nWe just them niggas you ain't fucking with (oh no)\nPockets on a chubby chick (ah)\nAnd still go bag a thottie in some bummy shit (ooouuu)\nYerr Eli, why they testing me?\nLike I don't always keep the hammer next to me?\nLike I ain't got a hitter to the left of me?\nLike we ain't in these streets more than Sesame?\nIf that's your chick, then why she texting me?\nWhy she keep calling my phone speaking sexually?\nEvery time I'm out, why she stressing me?\nYou call her Stephanie? I call her Headphanie\nI don't open doors for a whore\nI just want the neck, nothin' more\nShawty make it clap, make it applaud\nWhen you tired of your man, give me a call\nDyke bitches talking out they jaw\nNext minute calling for the law\nThis nine will have them calling for the lord\nThey ain't getting shmoney so they bored\nI could never lose, what you thought?\nM.A got it on lock, man of course\nThey say I got the juice, I got the sauce\nThese haters on my body shake em' off\nPussy I'm a bully and a boss\nI'm killing them, sorry for your loss\nI just caught a body, Randy Moss (R.I.P.)\nNow this year I'm really going off\n\n[Outro: Young M.A.]\nOoouuu\nOoouuu\nThese haters on my body, shake em' off\nOoouuu\nOoouuu\nAhhhh, these haters on my body shake em' off\nOoouuu\nOoouuu\nThese haters on my body shake em' off\nI could never lose what you thought? What they thought?\nI could never lose what you thought?\nThis henny got me, it got me sauced\nThis henny got me oh, it got me sauced\nI could never lose what you thought?\nM.A got it on lock man of course\nOoouuu\nOoouuu", "album": null, "year": "2016-09-29", "image": "https://images.genius.com/cf7e328ec50746386204f0f9bf9b8421.500x500x1.jpg"}], "artist": "Young M.A"}