{"songs": [{"year": "2011-02-15", "title": "Give It To Me", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Intro: Saigon]\nYes, yes yes\nUh uh-uh, yes yes\nUh uh-uh, yes yes\nHaha, let me in mayne\nPssh, hehe, look\n\n[Saigon]\nI'm back for the first time fucker\nCancer, that's the sign sucker\nSo pucker up and kiss the fist of this lyricist\nThis, this shit is ridiculous\nI'll be the first one to say it\nDJ's, damn right they gon' play it\nIf not then fuck it I'll take it\nTo the internet, do it myself, they can't say shit\nBut the club gon' love it\nBut be careful, the thugs gon' thug it\nThey'll hit you upside your head\nWith a whole half-full Hennessy bottle and think nothin of it\nBitch won't fuck me then she's celibate\nBrad Pitt couldn't fuck that chick (uh-uh)\nUnless she really just a ho and I don't know\nIf so I'll call up the Bishop Magic (hello?)\nHe gon' give me couple lines to fuck up her mind\nMinutes later I'll be grindin on her from behind\nTell her, \"Turn around, quit kiddin with me\nGrown ass woman, girl give it to me!\"\n\n[Hook: Raheem DeVaughn]\nYou ain't gotta be my girl\nI don't even know yo' sign, ohhh\nI just wanna fiend and we\nWill let you rub up on mine, ohhh\nThere's no need to stop now (give it to me!)\nGirl I want you on top now (give it to me!)\nSo as soon as the beat drop now (give it to me!)\nGirl you gotta break me off, uh-huh\n\n[Saigon]\nWhat up? What it is my nucca?\nI'm back up in this muh'fucker\nSo knuckle up and kiss the fist of this lyricist\nThis, this shit is ridiculous!\nI'm trill like the homie Bun B\nFor real, there's only one me\nThey know that I'll paralyze a phony MC\nAm I on some thug shit? Go on and come see\nCause I ain't even gotta say it\nHis jaw keep jackin I'm gon' break it\nI'll stomp him in the head with the Timberlands\nLucky you could trust me, this muh'fucker won't make it\nBut we ain't come here to start a fight\nWe came to find dames that'll rock the mic\nAnd I ain't talkin 'bout rhyme but the kind\nThat'll do it in the whip before I turn out the parkin light\nClick totally she was comin just to kick it with me\nSoon as she jumped in, I said \"Lick it for me\"\nShe said \"Only if, only if you will stick it to me\"\nI said \"C'mon, quit playin girl, give it to me!\"\n\n[Hook]\n\n[Saigon]\nYou ain't got to act stingy\nYou should give a nigga them drawers (give me them drawers)\nAnd if you can't be that friendly\nCan you at least lick these balls? (Can you lick these balls?)\nI brought yo' black ass to Wendy's\nYou ain't even break me off (chick break me)\nNow I hate bein on your top slate\nLil' hooker you can take me off (ha ha!)\nYes, y'all'in, to the light beat and\nHookers on my (Bat-man) like I'm Mike Keaton\nIt's only right that I spend the night skeetin\nIn the morn' I'm gone, it was nice meetin (nice meeting you)\nYou and your coochie hole too\nAnd all I had to say was \"You're beautiful boo\"\nI ain't buy diamonds, no Gucci, no shoe (uh-uh)\nLike these other muh'fuckin foolio do (nope)\nLook I ain't even a pimp, but pimpin I'm pimpin\nMe and the nine inches, divine intervention\nSo listen, 'less you wanna get fucked up literally\nPut your weight down on me girl, give it to me!\n\n[Hook]\n\n[Raheem DeVaughn ad libds to the end]", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}