{"artist": "Problem", "songs": [{"album": "O.T. (Outta Town)", "title": "In Motion", "image": "https://images.genius.com/bfccd56b50a159db23155c1829c2b5ab.500x500x1.jpg", "lyrics": "[Hook : T.I]\nAll we do it ride, swang, bounce and turn\nBallin' from the spot with an ounce of burn\nWe in motion, we in motion\nWe in motion, we in motion\nAll we do it ride, swang, bounce and turn\nBallin' from the spot with an ounce of burn\nWe in motion, we in motion\nWe in motion, we in motion\n\n[Chorus : T.I & Problem]\nWhere all the hoe lil niggas (they ain't near me)\nBet your lookin' for them pussy nigga (they ain't here)\nWhere all the hoe lil niggas (they ain't near me)\nBet your lookin' for them pussy nigga (they ain't here)\nHold up! nigga back up let me do my stuff\nStrapped to the teeth, nigga who want what?\nHold up! nigga back up let me do my stuff\nStrapped to the teeth, nigga who want what?\n\n\n[Verse 1 : Problem]\nYoung Rida outta Compton, these bitches go crave by\nBe the nigga off of pill, you'll probly get 8'ed off\nAustralia to Atlanta, they yellin' my gang up\nMoney ain't a thang, aye, we pullin' the thang out\nPolice on chase but they never ever catch me\nStood near the game, did nigga try to test me\n[?] your money never ride like a leftie\nYou bring a bag of money, betta make that shit hefty\n\n\n[Hook : T.I]\n[Chorus : T.I & Problem]\n\n\n[Verse 2 : T.I]\nAnd we be rollin' 'em fatand burnin' it down\nThe shit that I'm blowin' like 5 thousand a pound\nAssociated with gangstas, so we don't fuck with them clowns\nI got your bitch in the panties, won't mind pullin' 'em down\nOh, oh, eh, know you hate that\nI put it in her face and make her take that\nGoddamn, bitch hate that\nI bust a nut, I roll a blunt and run it straight back\n\n\n[Hook : T.I]\n[Chorus : T.I & Problem]\n\n\n[Verse 3 : Problem]\nAyeTIP, where the money at ? fired up, burnt out\nGot me in the A, high as fuck, hella turnt out\nD Lane Hustle Gang, niggas gettin' riches\nNow I'm tryna fuck, so Wassup with these bitches\n\n[Verse 4 : T.I]\nPlay around if you want to\nShawty, you don't wanna see me pull up on you\nStill ridin' with a Pistol, and a Ski mask\nWestside know me niggas ... speedpass\n\n\n[Hook : T.I]", "year": "2014-02-24"}]}