{"songs": [{"year": "2011-05-13", "image": "https://images.genius.com/6478121f52fa3b0248edb20e7d06e076.300x300x1.jpg", "title": "Damu", "album": "Damn Fool", "lyrics": "[Hook]\nDamu, Damu i'm [x8]\n\n[Verse 1: Messy Marv]\nIt's a full time job nigga stand in line\n5-9 bounty hunter bitch i ride that 5\nStone love, i bleed this blood and bang this gang\nFrom the B on my fitted nigga down to my shoe strings\nNiggas know what it is homie Mess damuin'\nRed this, burgundy that, they know what i'm doin'\nI was wavin' my flag when i hopped out the pub\nA few of my homeboy's had me fucked up\nNigga's crossed game on me, switched up on me\nJust threw my set in the air like \"fuck my homies\"\nFillmore California i'm representing my square\nHow homie wasn't blood when blood was right there\nSoowoo\n\n[Hook]\n\n[Verse 2: Skatterman]\nTan Dickies, red fitted, red bandana\nBlack mossberg pump, call it the work hammer\nHouse party niggas trippin' everybody out\nFully automatic weapons multiply the body count\nCreepin' slow niggas howlin' \"What that B like?\"\nGood kids but got swallowed by the street life\n6 deuce Brims,  APD\nThe gangs came with the 'cain back in 83\nI been with it Soowoopin' but i don't B walk\nI throw knuckles on suckers and let my G talk\nSo check the gang files, you know the name pal\nIt's Skatterman i sing this song and rep my gang now\n\n[Hook]\n\n[Verse 3: Big Scoob]\nI was jumped brim, so 6 deuce is the true\nBut niggas scream Vill, from Woodland ave. back to Truce\nWe called it flu hills, from 59th to 56th that's where i made skrill\nAnd earned stripes in the field with Guerrilla niggas\nItchy finger quick to peel you niggas, skrilla getters\nWell paid we was with it nigga, hood niggas\nKiller City on some blood shit\nBrimstone stand strong nigga 5-6\nAnd back then blood was thin, the town was all crip\nWe stood strong all along on some Hog shit\nMy west riders tryna claim that they way realer\nBut any killer is a killer can you feel me nigga?\n\n[Hook]\n\n[Verse 4: Jay Rock]\n5 years down the line still talkin' blood shit\nBlood niggas Blood walkin', real Bloods real talkin'\nShoestring still flamed up like an oven boy\nReal killers aimin' at your heart like a lover boy\n90059 is the Zip, you can catch me on the fly if you tryna find a sip\nIf them boys come around then you don't say zip\nI keep a Spielberg 'round the corner with them clips\nRags on the right, Tech Nine in my reach\nLeave you lyin' in the streets for lying to the street\nI'm a lion on the beat, anything i see i feast\nTop Dawg, Strange Music, shit you know we gotta eat\nDamu\n\n[Hook]\n\n[Verse 5: Bumpy Knuckles]\nBumpy's in the club, that shit's kinda strange\nCause i don't party with these faggot niggas in the game\nI come through the door double up 4-4's and a diamond chain\nTo security my name is \"he don't play no games\"\nPut the bass up loud so the club don't hear this \"blaka blaka\"\nI send you niggas flames with these 2 hot Waka flaka's\nWe flood the spot Katrina style, can't nobody stop us\n5-7 RDV's we some gangster motherfuckers\nRogue Dog! It's your boy from the nyc og Bumpy Knuckles\nNigga fuck you, step to me i'll buck you\nTheir whole team is pussy, we call them niggas \"Slut Crew\"\nSoowoo my niggas, I ain't blood but i still fuck with you\n\n[Hook]"}], "artist": "Big Scoob"}