{"artist": "Papoose", "songs": [{"album": "Already a Legend", "title": "Law Library (Part 4)", "image": "https://images.genius.com/ee0d4b8d71f07519d2e4131572b79cb3.395x395x1.jpg", "lyrics": "Oh! somebody done done me wrong, done me wrong\nEyes to the ceiling all night long (all night long)\nTime is slippin' away from me (away from me)\nAnd it ain't no tellin' when I get home (I get home)\n\n[Intro]\nIf your fam locked up and you sick of the law\nTake these bars to the visiting flaw\nHurry up before they imprison us all\nWelcome to Law Library Part 4\n\n[Verse 1]\nHomicide. Put down your gun for a while\nIf it's a full moon listen to sun for a while\nThe definition of homicide is the conduct\nThat causes the death of another person or a unborn child\nI send these words to a mother if her sons on trial\nFood for thought, no more chow\nIf you intend to cause physical injury to a person and you kill 'em\nThat's not a murder, that's a lesson charged sub-division\n1 Paragraph A. We should all learn this\nIf you catch a body under emotional disturbance\nThat does not constitute murder. So you gotta chance\nCause it constitutes a medicating circumstance\nTemporary insanity if your lawyer is in order\nYou could have a murder charge reduced to a man-slaughter\nCop out to a dime 15 years shorter\nOr you could end up with a quarter. To life\n\n[Hook]\nHow did I get life?\nLife life (oh oh yeah), life life (talk to me), life life (oh oh)\nLife life (how did I get life?), life life (tell me)\nLife life (oh oh yeah), life life (ohh...), life life...\n\n[Verse 2]\nYou just a pawn. I ain't talking about where you sell your jewelery\nOr a small lake where water be flowing fluidly\nLife is like a game of chess\nMy next move'll be? Law Library Part 4\nCause truthfully, a person getting murdered or killed\nNothing new to me. Kids reaching for guns before they reach puberty\nBut whether it's me shooting you... or you shooting me\nIt's still black on black crime. Where is the unity?\nHomicide police swarming through the community\nThey locking up you and me\nCause they only gotta prove 3 things to get a conviction\nFollow through with me. That's the motive the intent and the opportunity\nMotive: That mean you had a reason to kill\nIntent: You intended to kill 'em did it at will\nOpportunity: This the most important and why? They place you at the scene\nIf you don't give 'em a alibi\n\n[Hook]\nHow did I get life?\nLife life (oh oh yeah), life life (talk to me), life life (oh oh)\nLife life (how did I get life?), life life (tell me)\nLife life (oh oh yeah), life life (ohh...), life life...\n\n[Verse 3]\nA murder charge doesn't mean defeat\nSome say through the technicalities its the easiest thing to beat\nFollow me through the court system I'm leading you out\nThey gotta prove you guilty beyond a reasonable doubt\nIt's an affirmative defense out blatant\nSo if you start explaining, give a reasonable explanation\nReasonableness of which is to be determined from the viewpoint of a person\nIn a defending situation\nSuspended license, crash you'll make your life shorter\nThey could charge you with vehicular man-slaughter\nCriminal negligence they both go aside\nThey call it criminally negligent homicide\nI'm streetwise, that's why I give you advice\nSo you don't stay incarcerated for your natural life\nMy next chapter is to the politicians\nArticle 490. Terrorism\nLaw Library", "year": null}]}