{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "I Need Church", "image": "https://images.genius.com/572efd897159fe9c977f0134b28da34f.1000x1000x1.png", "lyrics": "[Verse 1]\nI'm more than one person, lately two\nI need someone to save me and save me too\nA devil on my shoulder, an angel too\nAnd I'm tryna figure out who I favour, who\nMade me do the things you made me do?\nForever blaming you, I guess my favourite's you\nThe angel can take a pew for now, I'm cool for now\nYou ain't ever seen an adult so juvenile\nSicker than baby puke, dribbling days were cute\nAnd I'm tryna take a lady home, maybe two\nThough if you spill your drink on my shoes again\nDarling, it's toys out of the pram, baby too\nGetting a little waved and the club's getting boring\nBut I want to carry on till morning\nLady I'm bad, I should come with a warning\nWhat's wrong with your engine? Done with the stalling, come on\n\n[Hook 1]\nI'm open to suggestion\nEvolve without question\nWon't be going to heaven\nWithout salvation or redemption\nI need church\nI need prayer\nOn my knees in the dirt looking up to the sky\nWondering if anyone's there\nI need church\nI need church\nOn my knees in the dirt looking up to the sky\nWondering if anyone's there, I need church\n\n[Verse 2]\nI know what I should and I should not do\nBut what I should do ain't always what I want to\nIf you're lucky, I'll let you have your wicked way with me\nCome on baby, it would be rude not to\nWe were there chatting, it wasn't flirting, it was foreplay\nShe said she ain't really into music and hardly\nEven listens to the top 40\nThough she did say somebody should tell Danny O'Donoghue\nTo stick to the scripts, rap really isn't his forté\nUm, Danny O'Donog-who-what?\nI would rather listen to Rudebox\nBy Robbie Williams, that's a lie\nI would rather not listen to either of these two knobs\nWhy don't we order a few shots?\nThen in a few me and you hop\nIn a cab and go back to my flat\nWhere I can play you lots of my new tracks\nSex with me is safe baby, tamper-proof\nAnd I'm a pro at pulling out, that's tamper-proof\nI'm a mack and here's the proof, when she said her name was Honesty\nI said I'm looking forward to tackling the truth\n\n[Hook 2]\nI'm open to suggestion\nEvolve without question\nWon't be going to heaven\nWithout salvation or redemption\nWoke up in a bed next to a bird\nAnd I hope I used protection\nWe all need a cure cause\nWe don't worry about prevention, I need church\nI need church\nI need church\nOn my knees in the dirt looking up to the sky\nWondering if anyone's there, I need church\n\n[Outro]\nHello, welcome to the voice mail of me\nYou should know who I am if you're phoning my phone\nPlease do leave me a voice mail cause I don't check them\nPlease don't send me a text because then I have no excuse for not getting back to you\nBye\n\n*beep*\n\nGreen, it's Robbie Williams\nI've just heard your album. I-I- listen..\nA, keep my name out of your mouth\nB, why did you have to go and mention Rudebox? It was a pretty shitty time of my--\nAnd C, C is fuck you Green!", "year": "2014-09-16"}]}