{"artist": "Papoose", "songs": [{"album": "Build Or Destroy", "title": "Bang Bang", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro]\nThug-A\nThug-A\nThug-A\nThug-A\nThug-A-Cation\n\n2Pac had the Outlawz\nBiggie Smalls had Junior M.A.F.I.A\n50 Cent got the G-Unit\nJay-Z got Roc-A-Fella\nThey say Jesus had the disciples\nI present to y'all the nation of Thug-A-Cation\nAwww man, my nigga Tydro with his eyes low\n2008 was ours before it even started, is you retarded\nDowntown's C-Brown, Snipe, Flipper the Ripper\nMussolini, my niggas strong, we can't go wrong\nTommy Gunz and Al Capo is getting mad dough\nKay Slay eased up\nO-Dogg, pusher in the mall, trigger-happy Pappy\nAnd I go by the name of...\nYa'll know what I'mma say already man\nYa'll know what I'mma say\nPapoose, Pa-poose\n\n[Hook]\nYou with the Thug-A, Thug-A, slip a clip in (Bang Bang)\nYou with them other suckers, suck a dick then (Bang Bang)\nYou with the Thug-A, Thug-A, ride, yo. (Bang Bang)\nYou with them other suckers, die slow. (Bang Bang)\n\nYou with the Thug-A, Thug-A, slip a clip in (Bang Bang)\nYou with them other suckers, suck a dick then (same thing)\nYou with the Thug-A, Thug-A, ride, yo (Bang Bang)\nYou with them other suckers, die slow\n\n[Verse]\nI know you're tired of hearing stories 'bout homicide\nI'm bona fide\nPromise my life these niggas won't harm a fly\nDance at a disco\nThrow rice at a wedding\nWon't put shit in a diaper, I bang like a lighter\nCocaine wars, take your chain off\nBack them for the dog food, man, this stuff ain't yours\nGive me a thousand grams, I'm a let the 4 bang off\nIt take more than a key to open my domain doors\nBroke the RICO, son of Sam, it's some no-name laws\nAnd I slept with your main broad. What's your name? Lord?\nThey call me, Papoosie, walk with a black Uzi\nTwo thumbs down, you acting in whack movies\nWhy you did a song with him? He mad moody\nI'll, don't touch me, you got the rap cooties\nIt's on when I carry the crons and the Caddy\nYou can get every Tom, Dick, and Harry\nListen\nI hit Tom with the long\nDick with the fifth\nHarry with the Cali\nAnd hop right in my whip\nYou won't hear a thing when P banging that toaster\nP move in silence just like the \"P\" in pneumonia\nCatch you in the 'ville and chase you from Saratoga\nSlump you on the Forn-up's\nI get a share cake and feed it\nHomie, you get a share cake and eat it\nAt the end of the day, niggas can't say I cheated\nI feel every man should get a fair shake and keep it\nI don't put niggas on, then my plans ain't completed\nThey'd rather listen to hands say then see it\nYou can walk a horse to the water, but you can't make him drink it\nSome niggas treat others bad, can't take the treatment\nTreat how you wanna be treated, can't face the beating\nPlans ain't strategic. Disagree, they can't make agreements\nSnakes in the grass, they give a handshake and dice it\nSome niggas think they strong, but yeah, they're the weakest\nTrying to prove their strength, give you a handshake and squeeze it\nYeah, I get my hands dirty, my hands ain't the cleanest\nIf I shake your hand, I give you a handshake and mean it\nThis mover of music here cause I'm here to make my thesis\nAnd only for my fans' sake, I speak it with the bare face of Jesus\nOn my neck, my pants there with creases\nAuthentic kicks, I never wear fake Belices\nLow top, uptowns, one of my pair of favorite sneakers\nI rock a pair of men's just like the landscape of Egypt\nSpit bars to the foreigners, let them translate to English\nNaw, you and your mans ain't the deepest\nSome artists can sew dreams, everything hear they believe it\nSo they stuck on the underground, they can't break the cement\nWhen they get into show business, their answer's deceiving\nHear themselves on the radio, so they feel they're succeeding\nBusiness before show, the airplay is needed\nFirst things come first, homie you can't break the sequence\nWhen you make a dope record, your fans can't receive it\nTook it right out of rotation. Damn, it's deleted\nWhen the whack records come, yeah they increasing\nGive them 90 spins a day. Damn, they repeat it\nJust so they can shine, them dudes, there, they competed\nBack to the drawing-board, your plans got defeated\n\n[Hook]\nYou with the Thug-A, Thug-A, slip a clip in (Bang Bang)\nYou with them other suckers, suck a dick then (Bang Bang)\nYou with the Thug-A, Thug-A, ride, yo. (Bang Bang)\nYou with them other suckers, die slow. (Bang Bang)\n\nYou with the Thug-A, Thug-A, slip a clip in (Bang Bang)\nYou with them other suckers, suck a dick then (same thing)\nYou with the Thug-A, Thug-A, ride, yo (Bang Bang)\nYou with them other suckers, die slow", "year": null}]}