{"songs": [{"title": "Dead or Alive (Fuck the Police)", "lyrics": "[Intro] (DJ Paul)\nAyo Paul what up nigga?\n(Buck, whats goin' on baby)\nAyo nigga you know, you been knowin' a nigga since he was knee-high\nYou know what I'm sayin'\nIts like I'm down here in Cashville\nI got this motherfucker off the chain ya know what I'm sayin'\nWe trappin' heavy, we 'bout to run this muh'fucka hot\nIm comin up to the M-Town to fuck witchu homie\n(I got you nigga, from Cashville to M-Town)\n\n[Chorus: Young Buck] + (DJ Paul)\nThey'll neva take me alive, I ain't goin back to jail\nThe money lookin' good I got dope to sell\nFuck The Police, nigga fuck the police (Them niggas love to hate)\nFuck The Police, nigga fuck the police (Them niggas love to hate)\nYou can't catch me, you can't hold me\nYou can't find me, 'cause you don't know me\nFuck The Police, nigga fuck the police (Them niggas love to hate)\nFuck The Police, nigga fuck the police (Them niggas love to hate)\n\n[Verse 1]\nFirst ima get a key, here I go, rememba me?\nI took it from my enemy, left him in his Bentley seat\nNever should have let me go, I done got my mind right\nAnd even though I'm on parole, somebody gon' die tonight\nCutlass got the dark tints, fuck it we gon' park then\nSee who sittin on 26's then we gon' rob them\nHolla at a couple bitches, know who we are man?\nSome real niggas, I'm a ghetto superstar man\nNow set it off, break 'em off, fuck some handcuffs\nStand up, and what, nigga man up\nWalk out the courtroom feelin' like O.J\nI got my knife in the club if you wanna play\n\n[Chorus]\n\n[Verse 2]\nWill you step out of the car sir? Why you pull me over?\nLooked him in his eye then took his head off his shoulders\nCocaine dreams I can see me runnin' the team\nSome butt-naked bitches packin' grams of that green\nBustin' their patrol cars from the project roof-tops\nGotta keep 'em outta here so that we can move the rocks\nMafia, militant like a black panther\nIm like a young Huey Newton in a black Phantom\nYo we shootin (yo we shootin), and recruitin (and recruitin)\nStartin' riots (startin' riots), That's how we do it (that's how we do it)\nAnd I'm not turnin' myself in so stop askin'\nWe hop out blastin', and walk out laughin'\nYea\n\n[Chorus]\n\n[Bridge]\nWussup all my real niggas and real bitches!\nIt feels good to be in yall city tonight!\nNow, I need everybody to put they trigger fingers in the air!\nAnd repeat after me!\nLET'S GO!!!\nYou got a gun, bitch I got a gun too {Repeat 3x}\n\n\n[Chorus]\n\n[Outro]\nYea (Yea)\nAyo man, I just felt like, I need to let the world know..\nYa know, fuck L.A.P.D. man, fuck N.Y.P.D. man, ya know what I mean\nMatter of fact, fuck the country ass police in Cashville, nigga, Yea!\nAnd you can try to pull a nigga over and all that\nBut I tell my niggas, nigga we shoot back!\nYEEEAAA!!!\nSo you know, when you see me swangin' nigga..\nHandlin' my business, mindin' my own business\nStay the fuck out my way nigga!\nHAHA!!! Cashville Records nigga! We get money though!\nFuck The Police!!!\nThey'll Never Take Me Alive!!!", "album": "SPIN CITY Vol. 3: Fuck The Police Edition", "year": null, "image": "https://images.genius.com/009675f1b5eab745e3d60cd049713b66.676x676x1.jpg"}], "artist": "Young Buck"}