{"artist": "Pras", "songs": [{"album": "Ghetto Supastar", "title": "What ’Cha Wanna Do", "image": "https://images.genius.com/88759a691c139e01e11deaaa6a02b2a4.600x525x1.jpg", "lyrics": "{ } = Pras\n( ) = Girl\n[ ] = Both of them together\n[ ] = Product or Product member\n\n{When the time is right in the heat of the night, right?  Right?}\n[So baby, what you wanna do?]\n(When you got the buzz and you feelin' the high, right?  Uhh.)\n[So baby, what you wanna do?]\n{When you standin' in line and your credit decline, yeah ... uhh}\n[So baby, what you wanna do?]\n(When you didn't do the crime but you're doin' the time, uhh.)\n[So baby, what you wanna do-oo-oo-oo?]\n{Yeah.  Yeah, yeah.}\n[Wanna do, yeah eh ehhh ehh ehh, yeah ehh ehhh]\n[Right.  Right.]\n\nVerse 1:  Pras\nYo, yo, yo, yo, once again she's back again\nWonderin' when she gonna find life again\nMakin' runs, stackin' ones, workin'-class citizen\nChosen one of Babylon\nTouched for the first time like a virgin {Uh huh}\nRap's origin, blast outta Eden {Yeah}\nLove the way the snake skin wrap around her bared skin\nSex on the beach, sippin' on juice and gin\nRepent just to sin again, it's that yin-yang news bulletin\nStuck with being fool ???\nLike I imagine I'ma sound like a Gatlin\nGettin' rowdy with my crew down in Brooklyn\nDrinkin' Ginseng, not to mention, where's my hooligan\nWho find them cats like Benjamin Franklin\nShorty perfect 12 on a scale 1 to 10\nWhatever, whenever, you can see me like when, yeah, yeah, yeah, uhh...\n\n(When you're dead broke, and you can't pay the bills\nUhh, yeah, so what you wanna do?  Uhh, yeah)\n[So baby, what you wanna do?]\n{When you feelin' horny and you need a cheap thrill.  Yeah.}\n[So baby, what you wanna do-oo-oo-oo?]\n[Right.  Right.  Right.]\n[Wanna do, yeah eh ehhh ehh ehh, yeah ehh ehhh]\n{Yeah.  Uhh.  Right?  C'mon.  Feel it.}\n\nVerse 2:  Free\nWhat you gon' do?  Uhh, yeah, yeah ...\nSee, all I wanna do is make love on the beach\nAnd grab all the things that seem out of my reach {M-hmm}\nI never had nothin' so there ain't shhh to lose {Uhhh}\nI refuse to snooze in these Hill Street Blues {Word}\nIt's a full time thing, just tryin' to maintain\nEven little city girls go insane {Stop it.}\nSometimes I wish I could press rewind\nWhen the life I live don't seem to be mine\nIf I could fly away, Free be long gone\nYou couldn't pin me down with your zoom lens on\nI stay macked out, blacked out, stacked out\nCats outta order, y'all get smacked out\nUhh, nobody moves and nobody gets hurt\nNobody interferes when I'm doin' my work\nPullin' my skirt, that's a full court violation\nY'all better get ready for the full annihilation\n{Uhh.}  [Uhhhhh, oh yeah]\n\n{When you think you got a shorty but she's sleepin' with your best friend\nYeah, yeah, yeah}\n[So baby, what you wanna do?]\n(When your man is doin' well, but he lackin' dividends, yeah, uhh, mmm)\n[So baby, what you wanna do-oo-oo-oo?]\n(What you wanna do?  What you wanna do?  What you wanna do?)\n[Wanna do, yeah eh ehhh ehh ehh, yeah ehh ehhh]\n(Right.  Right.  Uhh, uhh, right)\n[To all the people, light your candles, strugglin' and hustlin' your way\nSo, this shout out goes to all of the people bein' in every day, day\nDayyyy.]\n{Yeah, yo, yeah, yo ...}  [Wave 'em from side to side.]\n\nVerse 3:  Pras\nHey yo, I wanna be in the back of the club, just rub-a-dubblin'\nWhile these fake cats be champagne bubblin'\nWho you lovin', who you huggin' in your time of strugglin'?\nTwo to three job is hard to keep jugglin'\nMonopoly of hard times, all I got is hard rhymes\nWhen I make it out, baby, I'ma keep you in mind\nCan't stop the shine, can't claim what's mine\nComin' up, yeah, I'm in my prime\nReady to get this party started\nCut this track with diamonds, yeah I'm cold hearted\nA bloodhound, leavin' you punks dumbfounded, what now?\nYou done F'd up now, wha' what?  Look around\nIf anyone asks, I say it's crime related\nThem cats forgot to learn the Ten Crack Commandments\nPassin' judgement when you came from the basement\nSo if you say we hot, it's just an understatement\n\n(When you in love with yo' man but y'all can't get along, uhh, yeah, yeah)\n[So baby, what you wanna do?]\n{You already bought the ring, but the thrill is gone, yeah.  Uhh}\n[So baby, what you wanna do-oo-oo-oo?]\n[Right.  Right.  Uhh, uhh.]\n[Wanna do, yeah eh ehhh ehh ehh, yeah ehh ehhh]\n{Yeah, yeah.}\n(When your baby's daddy ain't payin' child support\nUhh, yeah, a-what you gonna do?  Uhh, yeah.)\n[So baby, what you wanna do?]\n{When you think you gettin' off but the jury's been bought, yeah, yeah}\n[So baby, what you wanna do-oo-oo-oo?]\n[Right.  Right.  Right.  Yeah.]\n[Wanna do, yeah eh ehhh ehh ehh, yeah ehh ehhh]\n{Uh, uh.  Uh, uh.  Uh, uh.  Yeah yeah, yeah yeah.}\n[Ohhhh, ohhhh, oh ohhhh ohhhhh ohhh.]\n{Hmm.  Yeah.  Aaight, that's it.}", "year": "1998-09-28"}]}