{"songs": [{"year": "2008-12-02", "album": "Troubadour", "image": "https://images.genius.com/2d335571e608b43f30bd8a89e1fa6d38.1000x1000x1.jpg", "title": "Bang Bang", "lyrics": "[Hook: K'naan]\nShe shot me, she shot me\nBang, bang - she shot me\n(ge\n\n[Verse 1: K'naan]\nAhh, there she goes again, the dopest Ethiopian\nIn other words, she came through explodin’ in the podium\nDynamite Napoleon like sodium mixed with petroleum\nSlowly but surely, she was walking toward me\nCut the convo short ‘cause she had to wake up early\nBut continuing the story, don’t worry\nShe gave me digits for her Blackberry\n“You’re very handsome” is what she said\nAnd the way she looked in my eyes said, “put me to bed”\nOh my, oh my, I should have known when she said to me on the phone\n“You do not know me very well, but I would never hurt a fly”\nThen she aimed at my chest with love in her eye\nSaid she aimed at my chest with love in her eye\n\n[Hook: Adam Levine & (K'naan)]\nShe was walkin’ around with a loaded shotgun\nReady to fire me a hot one\nIt went bang, bang, bang, straight through my heart\n(Straight through my heart)\nAlthough I could have walked away\nI stood my ground and let her spray\n(She shot me, she shot me\nBang, bang - she shot me)\n\n[Verse 2: K'naan]\nScorpion, she’s so hot she’s a scorch-ian\nKilling me softly: Lauryn or Kevorkian\nCouldn’t tell if she’s coo-coo or quarky, when\nI asked her her name she said, “call me Ten.”\nTesting, testing\nThings just got more interesting\nShe’s dressed in a vest pin, double-breasted holster\nA very Western toaster\nShe ain’t nothing Kosher\nAh she lets me closer\nHotter than a pepper-crusted Samosa\nWhile I try to keep my composure\n\n[Hook]\n\n[Bridge: K'naan]\nAm I wrong?\nBut what is love without the pain to go along?\nAnd what is pain, if not the reason for me to sing this song?\nAnd this song is for the weak and for the strong\nCause I was strong and still\nShe got me, she got me\nBang, bang - she got me\n\n[Hook]"}], "artist": "K’naan"}