{"songs": [{"image": "https://images.genius.com/3a2ff4dd2773419b355adc68be6cc436.500x500x1.jpg", "title": "Down as Great", "album": "Slauson Boy 2", "year": "2016-06-06", "lyrics": "[Hook: Kirko Bangz]\nI'm tryna go down, down as a great\nEvery night I get, on my knees and pray\nThat I will go down, yeah\nI will go down, yeah\n\n[Verse 1: Nipsey Hussle]\nLegendary moves, leader of my crew\nHeavy is the head that wear the crown, that shit true\nDo it like Nip Hussle, that's to fill some big shoes\nAnd what good is excuses when the fuckin' rent's due?\nSmokin' on this indo, run away from my pain\nRosemary on my temples, heard that's good for migraines\nSolo in my Benzo, exit off the highway\nSolitary thoughts like how to reinvest my side change\n\n[Hook: Kirko Bangz]\nI'm tryna go down, down as a great\nEvery night I get, on my knees and pray\nThat I will go down, yeah\nI will go down, yeah\nI'm tryna go down, down as a legend\nEvery night I ask God for the blessin'\nThat I will go down, yeah\nI will go down, yeah\n\n[Verse 2: Nipsey Hussle]\nSo many niggas doin' time, who are you and I?\nTo play with it is a blessin', so reach for the sky\nPick up Shady off the block and we'll smoke and drive\nPolitickin' on the block to make it multiply\nKeep some bitches on the team from the other side\nKeep at least a pound of green, mothafuckin' right\n30 hours in the spot, goin' overtime\nThen we pull up to the Fox and go hold it down\nYou know this life, it got a cold design\nHow you go from eatin' lobster tails at Ocean Prime\nTo chain to a smoker and throat on the line\nBut when them gates close, keep an open mind\nIt ain't a force in this world like the focused drive\nYou gotta focus on yourself like an only child\nYou make your dream realer, and you make your team better\nYou wake your game up, and you make your scheme better\n\n[Outro: Kirko Bangz]\nThey say this time, this time\nWon't be like the last time\nBut this time, this time\nI'ma do it like my last time\nI'ma go hard, my nigga\nPut my name in the stars, my nigga\nBut I gotta pray to God, my nigga\nThat I will go down\nUntil we legendary, yeah\n'Til we legendary\nWe legendary, yeah\nWho don't wanna be legendary? Yeah\nWanna be.... legendary, legendary, yeah\nI wanna be legendary\nI'm just tryna go down, I'm just tryna go down, I'm just tryna go down\nI'm just tryna go down\nI'm just tryna go down\nI'm just tryna go down\nAnd be a legend in my town\nI'm just tryna go down\nI'm just tryna go down\nI'm just tryna go down\nAnd be a legend in my town"}], "artist": "Nipsey Hussle"}