{"songs": [{"album": "Growing Pains", "year": null, "title": "Goodbye", "image": "https://images.genius.com/7e85622bc62e8bfa09b3556f1fc80f0c.540x540x1.jpg", "lyrics": "Got it this time uhuh\nNo lie, I'm in a fruitful place\nBut I was here thinking about you today\nMy heart finna lose the same gon' moved away\nCan't wait till I return\nWuddup gate the church\nFor now my roots are being planted deep in the dirt\nDirt so I'm reminded of purpose again\nI'd better serve you if I'm a better servant of him\nSo to all my brothers and sisters\nNo, not a day goes by that I'm not reminded I miss you\nThe city's the only thing I've known\nSee the look on his face\nWhen I tell my brother I'm really gone\nTears rolling down our face\nHugging like I'm never leaving but knowing I got a gift\nAnd the more that I think about it, the tighter becomes the grip\nThe brother standing around is the love this feeling astounding\nToo many names to mention but you're the reason I'm grounded yea\nAnd I know it's strange\nBut I know His aim's\nTo glorify His holy name as I go through these growing pains\n\nMan, leaving St. Louis has been\nOne of the most difficult things I've had to do\nTo leave the city I love\nThe people I love\nBut I gotta follow the god I love\n\nGoodbye\nEver had to say that to everything you know\nCause in your spirit you're feeling the lord telling you go go woah\nSmell it?\nFear seeping through my pores second guessing he said it\nSend me a sign\nIs it your voice?\nI really can't tell\nIs it my connection?\nMy signal keeps sending me fail\nFailure yea led by the spirit into to the wilderness he painted on me\nYou ain't hearing\nTears coming down my wifey's eyes\nWe got no friends and I'm\nFeeling like nothing I can do to dry those cries\nGot it all wrong this time\nFeeling so tired\nFeeling like why I'm following you?\nShe's following me\nWhat we gonna do?\nWhat's it gonna be?\nShe done left all of her family\nAnd she's fighting although she's hurting\nI know that you're truly with us\nSpirit is truly working producing something within us yea\nNo this ain't strange 'cause I know your aim's\nTo glorify your holy name as we go through these growing pains\nFor me my wife and my family to be stripped away from everything we've known\nIt's been hard\nBut we're testaments to the fact that god brings growth\nThrough our pains"}], "artist": "Json"}