{"songs": [{"year": "1988-03-01", "image": "https://images.genius.com/0e048ce66f1940b0505d2224de043841.495x494x1.jpg", "title": "Biz is Goin’ Off", "album": "Goin’ Off", "lyrics": "[Verse 1]\nHey to everybody and, people that say partyin\nIt's time to hear a funky rhyme from me the Biz Markie again\nAs I just display 'em, the way I like say 'em\nThe stutter steppin style that I use to amuse and HEY\nI'm the original, hellified king-ing\nFor freaky sound, for throwin down, and you know that I'm bringing\nThe crowd to enjoyment, by what I do\nLike {*ah-oww-oww WAHHAZOOW, boom, ah one two*}\nI keep the people cheerin, because of what they hearin\nMovin and groovin, to a devestatin sound that's glarin\nBecause they're in the mood for me\nThe B-I-Z the Emmezah-Emmezah-A-R-K-I-E\nThe party rippin, never trippin, king of crowd pleasin\nI can turn it out without a doubt in any season\nI entertain crowds, a million and thous'\nHomeboys makin noise, as I do browse through a girl's blouse\nSay the funky rhyme to make the girls get naked\nI can turn it out, with different sounds on my record\nThat I say give 'em, as y'all exault the rhythm\nThe magnificent record maker of Prism\n\n[Hook: repeat 2X]\nThe Biz, Mark, is, ah goin off\nThe Biz, Mark, is, ah goin off\nThe Biz, Mark, is, ah goin off\nThe Biz {*\"Go off, go off!\"*}\n\n[Verse 2]\nHa ha ha ha ha! Check out this bizarre\nRappin style used by me, the B-I-Z\nEmm-A-R-K-I with the E and, you will be agreein\nA brother ain't a brother unless he is say like G'n\nUp with his technique and, keep the people freakin\nLike me the Biz Markie because my style is so unique and\nGuaranteed to rock the mic with rhymes that I say\nI'm just as good as Clint Eastwood, so won't you make my day\nMarkie the original, yes I am the boss\nAnd I can rock the microphone for you and yours\nGo {*boom, ah one two*} 'til my voice is hoarse\nThen take a pause, annnd you know, of course\nI can rock a party, with so much force\nI'm the greatest entertainer Marley came across\nPuttin pictures in photomat to give 'em a gloss\nAnd I don't eat spaghetti without the meat sauce\nWhether Ragu, Prego, Hunt's or Aunt Millie\nYou wanna get dissed? Then try to get illy\nWith me the inhuman, because I'm like boomin\nReagan is the Pres, but so was Harry Truman\n\n[Hook]\n\n[Verse 3]\nNow! I make rhymes, each and every day\nAnd always seem to come up with somethin fresh to say\nIn January, February, March April May\nAnd the other seven months of the year, but anyway\nHey, feel the lay okay, here's a rhyme I must display\nWhen I'm finished you be in it sayin HIP HIP HOORAY!\nI will be an emcee, 'til I'm old and grey\nAnd I can even rock the mic with tooth decay, decay\nYo - ladies of the 80's know that I'm the\nOriginal B-I-Z-M-A-R-K-I say with an E\nYou know me, and my man Big Daddy\nI can't forget, Cutmaster Cool V\nAnd my partner, my best friend TJ Swannie\nRockin the mic would say most definitely\nSo listen don't be missin, I will never be dissin\nI just rock the mic, and always have discipline\nListen to the brother ain't no other you discover\nI rock up the mic just like if I'm, your, mother!\n\n[Outro]\nGo Biz Mark! Go Biz Mark!\n(Repeat to fade)"}], "artist": "Biz Markie"}