{"artist": "Problem", "songs": [{"album": "Hotels", "title": "My camaro", "image": "https://images.genius.com/15abb7fd4efada220fc8791e7d53c261.355x355x1.jpg", "lyrics": "Just woke up, wipe from my eyes, need to roll somethin up. I need to get high as I motherfuckin can. Just realized, hey I'm the fuckin man. Nigga I'm a god, get up off my ass and get my move on. Bitch I fucked last night, badder than a newborn. Yeah, my jewelry louder than a bomb, even the haters gotta say, \"P, you on?\" Yeah, I know that shit. Same year whip, zoom, I flow that shit. I make your bitch say yeah, niggas know that shit. Cause I'm fresher than a bitch and I flow that shit. Me, my nigga think I'm dressed like a trap star. Seen a million way before I was a rap star. Problem, yeah, causin the commotion. Why? Because I'm all that, and that's a motion\nHeard a nigga talkin, he say that he gon get you. He say that you a buster and you nowhere near official. I say, \"That's right? That's what they sayin?\" Man I don't know why a nigga hatin\nMan this nigga prolly seen his bitch in my Camaro, his bitch in my Camaro, his bitch in my Camaro. (x2)\nThat's right. Shout out to my ego, I'm hot as hell like tivo. And if you say I'm not, you are lyin like a Leo\nNow get up on it G-lo. Ballin, rick patino. Louisville slugger, just a mean motherfucker. Only nigge mean muggin on the scene. Thuggin at award shows, saggin with my flag out, lookin for a reason just to pull this fuckin gat out. Che-check it, flat out, we are not the same. I'm real, y'all faker than your chain. Eatin good, you can tell my diet changed. Four deep, supersport, got me in that diamond lane. Shit, in that diamond lane, that's that young money, cash money. I didn't take it, she gave that ass to me. So why you mad at me on the receiving end? Nigga hate the song, and they say greedy, yeah\nHeard a nigga talkin, he say that he gon get you. He say that you a buster and you nowhere near official. I say, \"That's right? That's what they sayin?\" Man I don't know why a nigga hatin\nMan this nigga prolly seen his bitch in my Camaro, his bitch in my Camaro, his bitch in my Camaro. (x2)\nThat's right. Diamond screamin from the lighter chain. Got these niggas on Twitter tryin to cyberbang. Tell em like, let me catch that boy, mike scypes. I ran up on him, all he wanna do is eye fight. Heh, god damn I love my life. I wake up and do whatever I like. I ain't even gonna rap no more like, I'm tired", "year": null}]}