{"artist": "The Game", "songs": [{"title": "300 Bars & Runnin’", "album": "You Know What it Is Volume 3", "year": "2005-03-01", "image": "https://images.genius.com/94aac16d9845daeefdcaedcb5eeb289b.360x360x1.jpg", "lyrics": "[Intro: children talking about 50's music]\n[Kid #1]\nMy mom took me to Sam Goody\nI wanted to buy a 50 Cent CD\nI took that shit home\nThat shit was wack like a motherfucker\nI fuck with Game\n\n[Kid #2]\nI like 50 Cent\nHe reminds me SpongeBob\nAnd Tony Yayo is Blue's Clues\nAnd Lloyd Banks is Dora the Explorer\nThey're my friends\nPsyche\n\n[Kid #3]\nI went down one of them bodega shits right there in Harlem\nGot me a bootleg Lloyd Banks and Young Buck CD\nTook that shit home, put it in my boombox\nThought I was 'bout to be on some Radio Raheem shit\nMan that shit sound like some Vanessa Williams in '88\nI mean Olivia cute but they say that bitch a man\nSo this Black Wall Street for life now\nG-G-G-Unot!\n\n[The Game]\n300 Bars and Runnin'\nJust loan me your ears for fifteen minutes\nWalk with me\nHere the breakdown\nPass the doja, .45 in the holster\nHollow tips'll fold 'em, them niggas, they toy soldiers\nOh, that boy colder than Hova unless he sober\nLike I'm the president, but this ain't the Takeover\nNow, there's the speaker, bring your ears a little closer\nBefore you call this a diss, and you make Hova pissed\nWhy would I wanna do that? When I'm just the new cat\nThat was taught if a nigga take shots to shoot back\nDefending his yard, yeah, standing his ground\nI'm saying if you gonna retire, then hand me the crown\nNah, let Bleek do it, then throw him a concert in Madison Square\nWatch everybody sleep through it\nWe can go bar for bar, I'll let the lines speak to 'em\nWhat they say? Bleek is over, let Chris and Neef do it\nThey say the wrong thing, I'ma smack 'em silly\nWhat you thought? Them was the only niggas rapped in Philly?\nSee them niggas with the sunnis leave you wrapped in Philly\nThen dash in groups like Beanie Mac in Philly\nCosmic Kev called, said Curtis Jack in Philly\nMake a U-turn, I gotta go back to Philly\nI forgot my cheesesteak, that's what I told the cops\nSo they wouldn't get the dogs start searching for the Glock\nAnd I can't forget, B.I.G. got murdered by the cops\nEven I was ready to die, when I heard that he was shot\nWhat's beef? Beef is when I murk you on the spot\nLabels signing anything, still searching for they Pac\nI put purple on the block, so I don't feel threatened\nWhen Ludacris say he coming for the number one spot\nAsk 50, it get lonely on top, you can hate me\nOr love me, but now the cops the only homies he got\nWhen it's beef we eat, we win, but we ain't lonely, we pop\nYou sell records but a G-G-G-U-not\nActing big on the radio, to me you not\nYou can ask Mister Cee who hot\nTony Yayo, I bet 10 G's you flop\nRun up on that new 300C you got\nStop hoping I fall, hope the bleeding stop\nAnd I hope you blackout before you see the cops\nI ain't High Top from Colors, I'm from Cedar Block\nBut what I got in my high tops'll make your breathing stop\nI'm a gangsta slash rapper, check your CD shop\nI'm like Elvis in there, they can't believe he dropped\nNow I'm moving on up to George and Weezy's spot\nI picked up where my homeboy Eazy stopped\nI saw the west coast, put the shit on my back\nSprayed Aftermath on it, then loosened the straps\nIt get hot in here, let Lucifer rap\nBring hell to niggas when Dre producing a track\nTake it to the streets, put the duece-duece to your hat\nThen call the pigs, tell them the rooster is back\nCall Jadakiss, tell him that duke is back\nI'm still by your side, no matter who comes strapped\nFuck Lloyd Banks, it ain't about who could rap\nIt's about when the Ruger clap, is rufus back?\nI see what you thinkin', you want me to die, is that so?\nNow you left leaning back thanks to Fat Joe\nWe got reservations in heaven, you ready? Let's go\nDrop them off, then pop Cristal with Esco\nI'ma say he hit me first if me and Dre talk\nAll Nas said back was he had a braveheart\nNow that's the eulogy, beefing is kinda foolish\nSee niggas running their mouth about what the fuck they gon' do to me\nBut quit the yapping before I proceed to clapping\nAnd you gon' see the captain with plans of getting me captured\nEven behind bars, I'm still gon' shine\nI'm ten years younger than Yayo, I get out, I'm fine\nThen I go right back, nigga, I pop minds\nHow you gon' drop Olivia? You only drop dimes\nI knew you changed when you started sleeping in that vest, dawg\nI don't need 50 Cent, my niggas make collect calls\n1-800-split a faggot nigga wig\nHe got G-Unit wings, throw 'em off the Queens Bridge\nNow your career is over-career is over\nWe in Q.B., banging C.N.N. in the rover\nT-O-N-Y, that's Capone n' NORE\nYou ain't the talk of New York, your sixteens is boring\nTake that shit off nigga, go back to PC\nAnd tell 50 Cent to send you a copy of Beef 3\nI'm airing their ass out on D-V-D\nYou wanna rhyme like Lloyd Banks, repeat after me\n\"I'm a G-Unit toy soldier on Sesame Street\nDoing voice overs,\" bitch ass nigga\nNeed a rhyme dictionary to rehearse his lines\nSound like Oscar the Grouch with them nursery rhymes\nWe was in the studio when I first got signed\nHe got stuck, he called 50, tried to borrow some lines\nThat's the wrong nigga, when you need help with your rhyme\nAll he gon' tell you is say G-Unit one more time\nGot mad 'cause I ain't wanna make your beef mine\nYou got lucky with Ja, why you ain't go at Shyne?\nHe freestyled from the pen, that's just the fact\nSaid he'd put you with your mom and you ain't fucked with that\nThen you lied about your pops, he never bust no cap\nLike father, like son, go ask Busta that\nI knew from the beginning not to trust those cats\nI'd kill 'em all if I could bring Justo back\nThe underground is mine, I treat it like home\nIt's the reason niggas saying my name like Mike Jones\nThe underground is mine, I treat it like home\nIt's the reason niggas saying my name like Mike Jones\nThe underground is mine, I treat it like home\nIt's the reason niggas saying my name like Mike Jones\nI said\nThe underground is mine, I treat it like home\nIt's the reason niggas saying my name like Mike Jones\nAnd I'm far from Houston but you can chop it and screw it\nDo whatever to it, put it in the store, the shit moving\nGave 'em a hundred bars, they ain't think I could do it\nCame with two hundred, nigga this is more than music\nEven Dre knew it, that boy hot like summer\nBoth feet in the dirt, 300 Bars and Runnin'\nI beef with any nigga, say my name, motherfucka, I'm gunnin'\nYou can put it on Skee if you want it\nI'll air you out on Drama King, Mike, or Clue\nAnd watch them shits sell out like a Air Jordan shoe\nI told Funk Flex when I catch the nigga Whoo Kid\nWe gon' see if he know how to DJ with bruised ribs\nDon't hit me on the Sidekick asking what you did\nGet a gun or ask 50's police to use his\n'Cause Bloods gonna get ya\nBlood-Blood-Bloods gonna get ya for that Shadyville chain\nThat 380 spill brains, when I pop shots\nOutside N.Y., in front of hip-hop cops\nOr broad day in L.A., I'ma tell Em and Dre\nThis nigga bootlegging my music, ain't nothing for him to say\nTook me off my own songs, then put it on his tapes\nSo I'ma take him out his house, put the beam on his face\nDrop him off at Terror Squad, let him scream for the jakes\n'Cause when you fucking with Jayceon, you can bleed in the lake\nFor caking off niggas on them CD's and tapes\nAsk him to scratch a record, you will see that he is fake\nIf 50 was Puffy, you'd run and go get him a cheesecake\nTake the DJ off your name, Mr. Instant Replay\nNow the instant replay, I mean the machine\nThat G-Unit use every time 50 on stage singing like\n\"Bitches only feel your shit just a lil' bit\nNiggas only feel your shit just a lil' bit\"\nOn my album, 50 helped me just a lil' bit\nOnly on two songs, now back to some killer shit\nMy clips bananas, I kill a gorilla quick\nBeating on your chest, I see to your death, yep\nTell Ecko to make him a suit\nTell Reebok to make him some boots, get him a head band\nTo cover the holes in his head, he a dead man\nFor thinking he can walk through muddy waters like Redman\nBanks blacked out and let the gun blam\nWithout a M-E-T-H-O-D Man\nSo the lieutenant gotta ask for his strings\nTake my advice, never wear Air Max to the bing\nUnless you one of the Bloods or a Latin King\n'Cause if you left with the Aryans your ass'll sting\nAnd your cellmate is a 25 to lifer\nThey'll stab you in Folsom, then fuck you on Rikers\nAnd life goes on\nNow back to the coward of the hour, who lied and said he write my songs\nHe told Vibe Dre was gonna leave me on the shelf\nSo he gave me all his hits, you should've kept them for yourself\nNigga stop acting tough before I stand over you\nShow you how The Documentary live on top of The Massacre\nMake a move, I'm blasting, add those to the last ones\nTen shots from the MAC, empty the rest in the passenger\nFase yelling that's enough, let the coroner bag him up\nThrow in Makaveli and lift the doors on the Maganum\nGun smoking, Fase think I'm locin' backing up\nReverse the '05 hearse on 41st and traffic, what\nHip-hop cops on my left, but I pass 'em up\nThe Dodge got a Hemi in it, Game got Remy in 'em\nIn and out of lanes like a New York cab\nI miss the old king that New York had\nWho's this fake nigga on pictures with the Jake nigga?\nGot his crew starving 'cause he ate the whole cake, nigga\nHe ain't Nas, ain't B.I.G., ain't Jigga\nIf he ain't Cube or Pac then who you got?\nWe getting tired of you talkin about who you shot\nI'll use another six bars to tell you who you not\nYou ain't 50 Cent, he went out like a gangsta\nYou went out with Vivica, three months after Wanksta\nGet Rich or Die Tryin, we thought you was hot\nNow the same nigga wanna take us to the Candy Shop\nC'mon man, what happened to the thug?\nNow you could find in the club, him and Lloyd Banks hugging\nNigga got mad when The Game start buzzing\nSo fuck making friends now I'm into throwing slugs\nOlivia talking about we a family, Game had to go\nNigga, I'll smack that hoe like I'm Jackie-O\n'Cause I don't wanna be cool, I don't wanna be you\nI don't wanna shake hands or wear your G-Unit shoes\nDon't want you on my hooks, don't wanna be in your group\nJust wanna sit here and wait (for the summer)\nTo be gone, so I can head back to the block\nFresh white Nike Airs and the matching Sox fitted\nPull the brim low, if they don't get it\nBentley Coup on gold Daytons, I was the first one with it\nFour times platinum, I done been there and did it\nCame in the game and shitted, then wiped my ass with it\nThey say the Lord giveth, Lord take it away\nSo I build a house on top of Hip-Hop, I'll wait for the day\nNiggas hating on me, they don't want Jayceon to play\nAnd the D.A. waiting on Jayceon to make a mistake\nSo they can put me in the squad car and lock me away\nGive me a odd job in the pen for minimal pay\nLet me out so I can drive down criminal way\nPushing the rock, nah, this ain't no subliminal, Jay\nThe summer too hot and I just want the winter to stay\n'Cause I'm a cold nigga when I put the pen to the page\nSimilar to them shells going into my gauge\nI hand 'em off to Dre, he turned them into grenades\nAnd Just Blaze, 'cause the boy got game\nLike I close my eyes, and woke up in a Roc chain\nNow back to reality, my gun and my vest\nAnd if diamonds are forever, then I'm Kanye West\nTake a look at my chest, a hundred thou wet Jacob\nWhole crew got chains, a hundred thou can't break 'em\nAnd the flow is hot like thou with Satan\nAnd the only thing I got spinning is Daytons\nThe hotter I get, the more willing to snake 'em\nSo soon as the beat drop, watch where I take 'em\nCompton swap meet to get me some All-Stars\nWhen Game in the house, they callin' all cars\n'Cause they heard about what went on in D.C\nHeard about Hot 97, my beef with 50\nNow tell me do he got a conscience?\nI think not, 'cause if he did I wouldn't be involved in his nonsense\nWouldn't be in Harlem, wouldn't be at this conference\nI'd rather be pushing rock like Samantha Ronson\n50 whispered in my ear, like we still bonding\nWe ain't friends, I'm just acting like Charles Bronson\nMiddle finger in the air, one hand on my Johnson\nHip-Hop police on me like I'm the convict\nWhat happened to the old school? I thought it was rhyming\nDoug E. Fresh and Dana Dane on the corner like Common\nNow that ain't common, it's more like Top Ramen\nThe flow is noodles, I throw it up like vomit\nAnd I still shine like diamonds, they kicked me out of\nG-Unit and I rebounded like Rodman\nIt's still Aftermath, two feet in the paint\nShould I be mad? I ain't\nI'm supposed to stop, I can't\nBecause I'm in the hood politicking, Impala liftin'\nAnd I keep a black four-five on the side of my Prada denim\nChip on my shoulder like I'm fresh outta prison\nDollar vision, blow a hundred thou like my wallet missing\nThen re-up like Kim before the d-cup\nContinuously getting money with my feet up\nChasing the throne, here my black Air Force\nI said fuck Benzino and got the cover of The Source\nFeel me? If not then I guess you gotta kill me\nBut you ain't gon' do that, so, motherfucker, move back\nWhile I do B.I.G. and Pac impersonations on two tracks\nWhen I wake the dead, everybody remove hats\nWe miss y'all, can I get a hand clap?\nNow back to rap and why I gotta stay strapped?\nOn that murder T-I-P, kill you ASAP\nThey don't know which hole to patch up when the K clap\nI tried to spare you Young Buck, now it's time for payback\nIt go, how you from Cashville but you ain't got no cash, nigga?\nSay my name, now that's your fucking ass, nigga\nKept your mouth shut and I gave you a pass, nigga\nNow I gotta lay you down like the last nigga\nBuck, buck, buck from my AK-47\nThis nigga playing with his life, I might have to put him in Heaven\nTryna play the game, talking shit up on the stereo\nPrepare for burials when I'm reincarnating Harry-O\nAnd you don't want that David 'cause you love your life\nGet my Vibe? When it's war, he pull out butter knifes\nMuthafucker, I'ma show you who the gangsta\nAll you do is Murder Inc., now who the wanksta?\nWhen Suge had you, you were stranded on the row\nJuve left you for dead and went back to the N.O\n50 heard you on the tour bus and felt your little flow\nThen he made you temporary replacement for Yayo\nYou a bitch and that's hard to swallow\nAnd you got robbed for your spinning G-Unit chain in Chicago\nI call my nigga Jojo to get it back\nHe had the shit in his hands and you ain't had the ten stacks\nPicture that, I thought we was G-Unit\nThen you ran and told 50 that I did the shit\nAsk C-Murder, the boy ain't hard to find\nI told Monica when I catch him, the boy is mine\nTake one shot of Brandy and pop\nWatch his panties drop when I run inside the Candy Shop\nFuck you, 50, Banks, Yayo, and the cops\nAnd Olivia, I mean for a man, she hot\nNow I'm running out of breath, like I just beatboxed\nGot twenty bars to go, lay it down like sheet rock\nDon't worry about the flow, the boy know he hot\nHurricanes in store November, nigga, fuck Reeboks\nI'm fly like a hummingbird on a tree top\nThe new Hov, the new B.I.G., the new Pac, I need three spots\n280 in, ain't no getting me back\nI'm yelling, \"Fuck the world,\" on my victory lap\nRemember first it was Buddens, then it was Bleek\nNow it's whoever, motherfucker, yeah, who want beef?\nNow whenever, motherfucker, who wanna see me?\nIn the coffin, body exhausted, resting in peace\nYou don't want war, nigga, you want peace\nSo give 'em the piece, capisce, let 'em rest in peace\nFrom West to East, the flow is outdatable, irreplaceable\nLyrical homicide, hell is hot, I'm boxing with Satan\nAnd I slipped 'em the ace, so you cannot replace 'em\nIf Eazy ever decide to return, I remain Jayceon\nA king in the making and the throne is for the taking\nSo I climb the mountain top and put my stake in\nGot the weight of the world on my shoulder\nNot a nigga, nor a hoodrat bitch can stop me from taking it over\nThis is crack music, go get the baking soda\n300 Bars and Runnin', nigga, the wait is over\nI'm gone"}]}