{"songs": [{"title": "Cosmic Kev Freestyle 10/10/14", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Verse 1]\nOh yeah you guessed it\nFinally Famous in this thing we finessin'\nCartier lenses on me, ain't no questions\nIn and out of town I ain't slept in\nWeeks, you ready?\nLook, I've been in and out of town\nStill making plays even when I'm out of bounds\nAutomatic champagne popping never out of rounds\nTell me where the throne, that's where I be sitting down\nI run up in your city, run the spot, run the town\nEven run that motherfucker when I'm not around\nOnly time to fuck, not to fuck around\nI got weed, bad bitches, and money and they all 100 pounds\nGod damn, I am, from pots/pans\nTurn that shit straight to hot sand\nYeah I got the blueprint these niggas try and trace\nThey tell me slow down but I'm in the human race\nAnd I be damned if I ain't first, never living in reverse\nI just hit it from reverse, swear that shit so crazy\nMan L.A. girls so crazy\nHow's it sunny if them hoes stay shady\nAnd New York bitches screaming \"Fuck you pay me.\"\nIn ATL they be eating all the gravy\nIn Detroit man those girls so gangster\nIn Philly I've seen some pretty faces\nLook, I love it when she up and down the pole\nMake me want to take your ass up and down the coast\nHave you ever been Annapol where they champagne sipped\nThen fly across the border to the 416\nThen go up to Philly where they know that shit legit\nOne time for the hood man you know that we the shit\nCome through in the city and you know I eat Philly\nAnd you know I'm repping Philly man shoutout to Meek Milly\nI be going in this bitch until I'm silly\n\n[Verse 2]\nDreamchasers what up though?\nIt's that finally famous boy\nYou know we out here repping since day one\nLook, I got a lot on my mind\nI got more on my face\nIf I ain't going to get it\nThat day is going to waste\nI'm trying to move in my safe\nLike the safe was a safehouse\nI ain't going out to eat but these hoes stay on the steakout\nOh you know it's official when I go bringing that Bape out\nI'm looking through the magazines like this the girl I'm about to take out\nOne time for Detroit, yeah you know that's what stay out\nYeah you know plotting up in there to find a way way out\nFind a way way out we had to fire way way out\nMusic been bumping man we just waiting to break out\nThis the player you've heard of\nThe young and assertive\nI came from the dirt up and\nDid the unheard of\nHoes say I'm the man, uh-huh I concur it\nI'm young and perverted\nIf I don't get the pussy or the payment, what the fuck is the purpose?\nNo calling my phone unless you the fam or my girl I'll just say it's no service\nStay connected as cursive\n\n[Verse 3]\nLive life, get high, change the world\nMan do it all before you go\nIn Europe riding Europeans so it's not a foreign O\nThey like show me the moves, no time for a tutorial\nThey're is levels to the game, like who put this shit on story mode?\nHis story historical\nMr. Anderson, I know Sway ain't got the answers so I'm looking for the oracle\nAll my favorite rappers told me life's a bitch\nSo I'mma fuck the world through the glory hole\nSo that bitch can't take me to the Maury show\nIf she don't smoke weed, pop pills, suck *Tss*\nIf it's one thing that I hate, man it's boring hoes\nAll my girls love me\nSo if I die today it be like 5,011 something freaks at the memorial\nLil bitch\nI hop up on the beat like it's the 08 me\nWhen we was riding for D boy no AC\nHeaded to the game for okay seats\nNow it's courtside at OKC\nI know KD\nAnd all these singer girls know me like do-re-mi\nFa-so-la-ti-do but doe come first\nNo late fees\nKool-Aid smile, colgate teeth\nThe bigger that I get the more I need shrinks\nWoop-woop got a couple screws loose\nYou was in the winner circle you just trying to get off in the fruit\nFruit Loop\nTurn nothing into 2, something into new\nI could write a best seller out of alphabet soup\n\n[Verse 4]\nTry me, try me\nI'mma get this whole motherfucking family\nLooking I ain't playing with nobody\nI come from 6 mile boy I ain't a Cosby\nUnderstand I came up nigga yeah that's all me\nThe world is in my palm motherfucker I need palm trees"}], "artist": "Big Sean"}