{"artist": "Yella Beezy", "songs": [{"image": "https://images.genius.com/8a11adeeb06c77cfb5bf5a477ebd48cd.1000x1000x1.jpg", "year": "2017-11-21", "album": "Lite Work, Vol. 2", "lyrics": "[Intro]\nDo you hear a sinner's prayer?\nShun On Da Beat\nDo you hear mine, mine, mine, ayy\nDo you hear mine, mine, mine, ayy, ayy\n\n[Chorus]\nI pray a lot\nI know we 'posed to trust in you but sometimes I lose faith a lot\nBehind these closed doors I go through so much shit and take a lot\nYeah my heart cold, it's like no feelings there\nGod I wanna know if you hear sinners' prayers\nI wonder do you hear mine, mine, mine, ayy (do you hear a sinner's prayer?)\nDo you hear mine, mine, mine, ayy (do you hear a sinner's prayer?)\n\n[Verse 1]\nAnd I wake up every day like\nGivin' praise to the man, let me see this daylight\n'Cause I got niggas that's locked up that won't see daylight\n'long as I got twenty-four hours I can shake life\nSee you know what's fucked up about it?\nSee I know niggas that pray a lick come through\nAnd they don't give a fuck about it\n'long as the money there when the rent time due\nAnd they can stuff they pockets\n'long as they gotta hustle, outmuscle\nI played with them kids, come get they shoe\nThey niggas is gutter, fuck you\nPlus nigga it's Christmas too? what you think I'd do?\nNigga couldn't walk a mile in my shoes\nEvery day I walk with the semi tool\nShootin' everything that's in my view\nFather God I depend on you\nI pray you overlook all the sin I do\nI know every day you been right there\nOne question, do you hear a sinner's prayer?\n\n[Chorus]\nI pray a lot\nI know we 'posed to trust in you but sometimes I lose faith a lot\nBehind these closed doors I go through so much shit and take a lot\nYeah my heart cold, it's like no feelings there\nGod I wanna know if you hear sinners' prayers\nI wonder do you hear mine, mine, mine, ayy (do you hear a sinner's prayer?)\nDo you hear mine, mine, mine, ayy (do you hear a sinner's prayer?)\n\n[Verse 2]\nI know I ain't livin' right\nStepson and got a son on the way, tryna get my children right\nI know it may take some time but I promise I'm gon' get it right\nI been goin' through some things and on the cool I ain't been feelin' right\nThese niggas actin' too shady, and with me that ain't sittin' right\nForgive me for all my sins and forgive me if I been prayin' wrong\nI pray that you bless my hustle so I can get my paper on\nI know that I'm a good nigga, just wonderin' what be takin' long\nBeen grindin' for a lil minute and I think that my patience gone\nI put in so much work I feel like it's my time\nI'm tryna get up out the street nigga, right now\nOn my mama, look up every day, look up to God\nLord protect me, these niggas tryna take me out\n\n[Chorus]\nI pray a lot\nI know we 'posed to trust in you but sometimes I lose faith a lot\nBehind these closed doors I go through so much shit and take a lot\nYeah my heart cold, it's like no feelings there\nGod I wanna know if you hear sinners' prayers\nI wonder do you hear mine, mine, mine, ayy (do you hear a sinner's prayer?)\nDo you hear mine, mine, mine, ayy (do you hear a sinner's prayer?)", "title": "Sinner’s Prayer"}]}