{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/47286291f795dcabf6ef911ae5d1e441.440x440x1.png", "year": "2019-07-26", "album": "The Lost Boy", "lyrics": "[Verse 1: YBN Cordae]\nOkay, uh, I can tell you how I first started in this rap shit\nMama kicked a nigga out the house, felt fantastic\nTold my homies, \"If you got a couch, know I'm crashin'\nWorried 'bout my future, couldn't care about the past tense\nLost my grandmother, and I haven't been the same since\nStart to get anxious, I'm tired of this lame shit\nTired of the struggle, livin' family in the subdivision\nRamen noodles, drawin' doodles wasn't in my fuckin' vision\nBut who's fault is that? Tryna stay all intact\nFightin' all my demons, they be schemin' but I'm crawlin' back\nAnd eventually flyin', lately been mentally cryin'\nNiggas resentin' me, I am not for the industry lyin'\n\n[Chorus: YBN Cordae & Pusha T]\nLife's a dream, but nothin' is a fairytale\nDo you love me? I can barely tell\n'Cause I'm up and down, been all around, nobody's callin' now\nNo, no, no, no, no, no\nNo, no, no, no, no, no\nUh, 'cause I know what I been through\nBut I still, uh, I'd do it all over again\nAnd my life is so sinful (YBN, why be them?)\nBut through times, uh (King Push)\nThe good guys always win\n\n[Verse 2: Pusha T]\nI can tell you how I first started in this rap shit\n8th grade, backflippin' on the mattress\n9th grade, pack doin' gymnastics\n10th grade, somersaultin' all them crack flips\nAsterisk, skipped school, recorded with The Neptunes\nWe was makin' high school classics\nBefore I took a kilo and I wrapped it, I rapped it\nAround the funeral with the casket (Yuugh!)\nCoke avalanche, like a landslide\nOnly grew my hair this long because my man died\nCollect calls on them landlines, I pressed 5\nTo tell about the new test drive and talk fly, ooh\n\n[Chorus: YBN Cordae]\nLife's a dream, but nothin' is a fairytale\nDo you love me? I can barely tell\n'Cause I'm up and down, been all around, nobody's callin' now\nNo, no, no, no, no, no\nNo, no, no, no, no, no\nUh, 'cause I know what I been through\nBut I still, uh, I'd do it all over again\nAnd my life is so sinful\nBut through times, uh\nThe good guys always win", "title": "Nightmares Are Real"}]}