{"songs": [{"year": "2013-08-12", "album": null, "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Old Matt", "lyrics": "[Intro]\nSo, everyone forgot about this old motherfucker\nThen he drops a track mentioning my name\nTalking about a battle that happened almost two years ago (whatever)\nCome on sixty\nPut that pipe down brah\nYou're falling off\n\n[Verse]\nThe old man yo he lost his sight\nAnd his ex bitch left 'cause she lost her mind\nI'ma tell you all facts about how Matt's fake\nOne week ago was on the forums typing \"Kerser is great\"\nHe calls this shit a joke like \"I'm mucking around\"\nAnd if he diss me properly, the cunt be stuck in the ground\nWhat pissed me off the most is when Matt act tough\nThen he meets me, got him shaking like \"Uh uh bruz\"\nI don't want no fucking trouble man it's only a joke\"\nHe's begging to his manager, like \"it's only a toke\"\n'Cause you a crack head bad, you a ice fiend brah\nAnd your careers at a stand still, I see brah\nAnd you needing some attention so you calling out the Kers name\nYour pop used to touch you up since you hit the first grade\nAnd that's the reason for the Mickey tat\nI didn't wanna bring it up but you're tripping Matt\nBro, you need some fucking counseling, you're not alright\nI told the crew if they see you, you get dropped on sight\nYou're a fucking old man, go and live your life\nYou look fifty five now, fucking give up the ice!\nThe whole industries talking 'bout you and your crack pipe\nLife after fame is it really that bad, why?\nThought you had it sorted but your whole life fought\nYour best mate got a disease 'cause you was hitting him raw\nAnd then your missus went and left yous were tying the knot\nShe left you 'cause her friend started tying the knot\nLife isn't fair so you isn't a smart fuck\nYou're a nice bloke, why you rap like a hard cunt?\nYou're featured on a song called Reservoir Dogs\nI didn't even have to say it, you said you're a dog!\nYou say you piggy backed me if that's the case\nWhy this track got more views in a couple of days?\nBehind the scenes, sixty tries being my mate\nSo if he drops a diss track then he thinks it's okay\nYou a fake motherfucker popping half a pill\nEvery vid I upload is hitting half a mil\nEvery vid that you drop sits on twenty K\nYou fell the fuck off Matt, are you feeling okay?\nI've dropped three albums in the time you working on one\nYour career's falling off, it's time for Kerser you cunt!\nYou're obsessed, this is weird, clean yourself, shave ya beard\nYou're a pop-star faggot and ya whole crew is queer!\nEverything you wanted growing up you got\nIn the rich neighborhood getting touched by your pop\nFucking with a street cunt, your worst mistake\nStill ask me for ID they think you're thirty eight\nStop saying you're clean you're on the Xannies and shards\nYou have to pay me twenty K now to battle me fag\nYou made my career? Nice try there man\nI was hitting million views with the Highest Man\nBefore your fucking name even got mentioned with mine\nYou're a pussy and you're scared of progression, it's fine\nI just fucked you up, Kers one is serving you\nBounce back Matt, next one is personal\nBitch!\n\n[Sample]\nSydney's hottest beatmaker, Nebs\nY'all know what it is"}], "artist": "Kerser"}