{"artist": "Bankroll Fresh", "songs": [{"lyrics": "{Yeah nigga, you know it’s Bankroll nigga. Ain’t gotta tell you this. Street Money}\n\n\nRidin’ round wit it, Ridin’ round wit it, Ridin’ round wit it, I’m Ridin’ round wit it\n\nRidin’ round wit it, Ridin’ round wit it, Ridin’ round wit it, I’m Ridin’ round wit it\n\n\n\nVERSE 1:\n\nDeadly ambassador bullets harassin’ ya hollow tip flip out this black .40 caliber\n\nNiggas who talkin will slowly be after ya. Fracture ya skull all on top of the canister. Glock and Nine milli pussy who testin? Cross Smith and Wesson. Bullets digestion off in yo stomach it's gonna be restin'. I doubt if you make it out if you do it's a Blessing. Bankroll in this bihh flexing shinnin' hard. Bitches on my dick see me shinnin. Diamonds water fridge fresh. Bankroll fully loaded don't you see it? Street money wit me don't you niggas hear it? '69 camaro sounding like a fuckin pig. Yeen no Muthafuckin killa nigga you a fuckin pig. I'm ridin around the Muthafuckin city with the Sig. You niggas talkin bout beefin' but you went and hid. Pillow talkin to these Hoes like I wouldn't hear it. I shoulda Fuck that nigga bitch and made my nigga hit. I'm married to the money bitch that's a tax credit. I'm going to get that big rollie so you won't forget it. Every wardrobe fully loaded, wanna bet? These niggas man Hoes call these niggas Lisa Leslie\n\nHOOK:\nAin't worried bout no bitch at all nigga, I'm trying to put it in my wall nigga. I'm grindin shid get all my niggas richer. Bankroll he strapped, he always got a pistol. (Go!)\nCome wit it. Come come wit it. Come wit it, come come wit it. (Repeat x2)\n\nVERSE 2:\nRidin round with the pack, Ridin round with the sack, ridin round wit the Gat, ridin round with the mach, and the cooler on top of dat. NiggaHow you figured dat, you was gone fuck wit me you Lil nigga? Imma young nigga who bout to be rich, ain't lettin a nigga trick me off the street. Bout to get me a new Peadi Flippe, might sit out, new doors off the Jeep. Comin through this Muthafucka flexin’, no shirt on. Bad bitches on my iPhone. Quick trip callin like, what it is? I'm talkin bout nigga yeah a couple mill. Nigga Vee on the line, what's good? Bankroll pull up in any hood. Yall niggas Know how I do it. Hit the booty club then I flew it. Yall niggas ain't getting money, yall lease. Broke nigga mad, see me ain't speak. I'on give a fuck, fuck the reason. Comin through this Muhfucka hog breathin. Bitch I'm paper chasin', money conversations I thank yo bitch ass really wanna taste it. Made her get naked throw it in the air while she shake it off the ground, scrapin'. Pot scrapin', fork here.. Pot here, right now. Microwave, yeah it's near. Molly clear, take a lick. Take a hit, whiff of Dis. Street Money, big as it get. Bankroll. Bad Hoes. Blue Hundreds. New Clothes\n\n\nHOOK:\nCome wit it. Come come wit it. Come wit it, come come wit it\n\nComeCome wit it nigga. ComeCome wit nigga. ComeCome wit it nigga\n\nCome wit it nigga! Come wit it nigga! Come wit it nigga!\n\nCome on lil nigga! Come on lil nigga! Come on lil nigga. (Bankroll!)\n\nCome wit, ComeCome wit it. ComeCome wit it. ComeCome wit it, ComeCome wit it\n\n(Dis dat dope boy shit here nigga. Street Money. Bankroll!)", "image": "https://images.genius.com/d8b4e58e579e0d47ed1dc6c2843a77d6.600x600x1.jpg", "year": "2015-04-24", "title": "Come Wit It", "album": "Life Of A Hot Boy"}]}