{"songs": [{"lyrics": "[Aceyalone-Talking]\nAlright, yo, this all came about one time when..\nI was, I was, I was, on a plane back going back to Los Angeles\nComing back from somewhere else\nAnd I sat next to this lady and she was telling me some things\nI don't remember it verbatim but I do remember some of the things she said\nIt was like this\nShe said..\n\n[Aceyalone]\nLife as we know it is about to change\nI smell it within the air, the weather is getting strange\nDrugged up, sedated and numb from the pain\nThe sickness in America has spread to her brain\nShe is no longer fit to make good decisions\nShe is completely blind and void of any vision\nShe parties hard and she keeps her conscious mind in prison\nTherefore, she's headed for the ultimate collision\nShe can no longer hide the scars on her face\nThe innocence, now gone, is hard to replace\nShe has no shame, no remorse, or any grace\nShe embraces the Devil and she hates over race\nMs. America, the beautiful, the free\nFallen within the cracks I wish that you could see\nShe buried her misery with this society\nIt's obvious you've got no regard for me (yeah)\n\n[Aceyalone-Hook]\nThats why you caught up, in the belly of America (yeah)\nLost, in the stomach of America (yeah)\nBroken down, in the bowels of America (yeah)\nSinkin, in the garbage of America (yeah)\nSTUCK, in the brain of America (yeah)\nSufferin, in the body of America\nLyin, in the wicked spirit of America (yeah)\nDying, in the old soul of America (yeah)\n\n[Aceyalone]\nMs. America, you've been a very bad girl\nYou nearly disgraced humanity in the eyes of the world\nVanity has took you over, you're not deserving\nThe mirror of reflection, is quite disturbing\nShe made so many promises, she couldn't keep\nShe neglected to mother her young, so they don't sleep\nThey scream out for justice, and then they weep\nWe're not to blame Ms. America, it's what you reap\nThe audacity of your inventions to rule us all\nThe tragedy of your intentions, to fool us all\nYou should've gave in to nature, and to the law\nIt's only a matter of time, before you fall\nThe things you should've worked out, in your first colony\nTook some of your own advice, and your psychology\nYou destroyed all morale, and the ecology\nI'm sorry but I don't accept your apology (yeah)\n\n[Aceyalone-Hook]\nI'm caught up, in the belly of America (yeah)\nLost, in the stomach of America (yeah)\nBroken down, in the bowels of America (yeah)\nSinkin, in the garbage of America (yeah)\nSTUCK, in the brain of America (yeah)\nSufferin, in the body of America (yeah)\nLyin, in the wicked spirit of America\nDying, in the old soul of America (yeah)\n\n[Aceyalone]\nOh Ms. America, so much attraction\nThey should've taken responsibility for their actions\nWe work around the system and make adaptions\nSo you could let freedom ring, within your faction\nHow can people still be hungry, when there's a surplus?\nSuffering within your home, you made them worthless\nDamn near police the state, and make us nervous\nEven though some conform and join your service\nYour presidency is the biggest joke, but where the laugh?\nI always smell the gun smoke, on your behalf\nI think I should send a telegram to your staff\nAmerica, you're down and dirty\nYou need a bath\nSo tell your Secret Agents don't be paranoid\nThis wasn't taught by Socrates or Sigmund Freud\nThis is simply God's work, you can't avoid\nEvery nation ever built, has been destroyed (yeah)\n\n[Aceyalone-Hook]\nCause we caught up, in the belly of America (yeah)\nLost, in the stomach of America (yeah)\nBroken down, in the bowels of America (yeah)\nSinkin, in the garbage of America\nSTUCK, in the brain of America (yeah)\nSufferin, in the body of America (yeah)\nTrying, in the good old spirit of America (yeah)\nDying, in the old soul of America (yeah)\n\n{*J-Rocc scratches and cuts \"Yeah\" until fade*}", "title": "Ms. AmeriKKKa", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}