{"songs": [{"lyrics": "[Hook]\nI got real life in my dreams\nI got the world in my hands\nI got funk in my future\nWhat a perfect romance\nYeah\nI got money in my pocket\nI got a bullet in my gun\nI got B-Boy in my stance\nWhat a perfect romance\nYeah\n\n[Verse One]\nSee my first name is Will, my last name Power\nMy real name is Eddie, last name Bauer\nThey used to call me Gun, last name Tower\nNow they call me Final, last name Hour\nHuh, but on the low my last name is Flow\nMy first name is He Got, my middle name's Fo' Sho'\nMy other name is Maxwell, last name Smart\nThey call me Gotta Lotta, last name Heart\nI get sparked in the place to be\nWith that look on my face like \"You don't know me.\"\nYou don't owe me homie I get what I deserve\nCause I curb serve these words like something they never heard\nOooh\nUndergrounder, co-founder\n175 pounder to clown ya\nI hit the scene like \"Y'all fools weak\"\nI hit the mic like, \"Who's beat?\"\nIt's too easy\nThe almighty mic hog dawg, Ace-zze\nDon't stop me now y'all, hip hop needs me\nCan you read me?\n(It's true man I'm telling you)\n\n[Hook]\n\n[Verse Two]\nSee my last name is Aim, my first name Double\nMy teacher's called me Maker, first name Trouble\nMy new name is Never, last name Crumble\nMy uncle's called me Keep It, last name Humble\nBut on the real, my last name is Skill\nMy first name is He Got, my middle name's The Ill\nMy brother's call me Hold It, last name Down\nBut you can call me Champion, last name Sound\nOne in a million or two in a third?\nIt's just me and the world and it's you and your worm\nSo fuck what you heard if your vision was blurred\nCause I curb serve these herbs like something they never heard\nOooh\nIndependent, superintendent\n175 minutes just to reinvent it\nI hit the scene like \"Y'all fools wack.\"\nHit the mic like \"Who's track?\"\nIt's too easy\nThe almighty mic hog dawg, Ace-zee\nDon't stop me now y'all, hip hop needs me\nCan you read me?\n(Aww for reals)\n\n[Hook]\n\n[Verse Three]\nSee my first name is Yes, my last name Y'aller\nStreet name is At Me, first name Holler\nThey used to call me Hard, last name To Follow\nCould call me Mighty, last name The Dollar\nBut on me, my middle name is G\nMy first name is He's A, last name O.D\nMy peeps call me Bring It, last name Home\nBut you can call me Acey, last name Alone\nI hold my own on the M.I.C\nWith that look in my eyes like I wanna be free\nIt ain't nothing to it, I'm a little disturbed\nCause I curb serve these words and puff on earth's herb\nOoooh\nHip hopper\nYoung B bopper\n175 choppers to rock ya\nI hit the scene like, \"Y'all fools nasty.\"\nHit the mic like, \"Don't ask me.\"\nIt's too easy\nThe almighty mic hog dawg, Ace-zee\nDon't stop me now y'all, hip hop needs me\nCan you read me?\n(Oooh yeah)\n\n[Hook]\nYou got real life in your dreams\nYou got the world in your hands\nYou got funk in your future\nWhat a perfect romance\nYeah\nYou got money in your pocket\nYou got a bullet in your gun\nYou got B-Boy in your stance\nWhat a perfect romance\nYeah", "title": "Perfect Romance", "album": "Perfect Romance [12\" Single]", "image": "https://images.genius.com/26fb6a132a9bc0a2eb43d4a721d7a450.596x596x1.jpg", "year": "2001-01-01"}], "artist": "Aceyalone"}