{"artist": "C-Bo", "songs": [{"title": "Dedication", "album": "Blocc Movement", "year": "2001-08-28", "image": "https://images.genius.com/069abf7637d0c6d1c2db910fd370ca65.500x500x1.jpg", "lyrics": "With my eyes open I tried to focus\nI see my mother\nSqueezing my hand teary eyed behind her\nI see my brothers\nAnd I wonder, how quick the game would take me under\nI felt the bullets hit me in the back and it felt like thunder\nMan, I'm thinkin is it too late for me to change?\nI knew this world is full of snakes dog but thats a part of the game\nA young thug that always scream I ain't afraid of rain\nI would just fight it out with Lord when I had no one to blame\nFrom all the dirt I did\nSnatchin purses to pay the rent\nI knew it would all catch up to me\nMan I hope I'm heaven sent\nI used to be the main one screamin nigga I'm prepared to die\nAnd when it came down to me layin on the death bin I was scared to die\nNo evidence of a killa when I found a bird in my dresser\nAnd if I don't die here\nI'll die tracin your hot desert\nI can't win for losin to meet a whole gang of snakes\nNever thought about killin myself\nBut I refuse to die at the stake\n\nNigga, have you ever been sittin in your car nigga, rollin up a blunt?\nWhen a nigga comes up to your window and gives you a whole clip?\n\nNah you ain't ever had that, you ain't ever experienced that\n\nHave you ever been walkin through the park\nWith your kids and your family, and a nigga comes out the bushes and\nGives you and your family a whole clip?\n\nNo you ain't ever had that\n\nI remember when I had it made\n13 with a whole verb\nUsed to catch me comin down the street clownin in my convertible Ford ??\nI used to be all on the curb\nTryin to holla at me a shorty\nWith my right hand do dub\nAnd me sippin up on a 40\nMe and my nigga used to have it made\nWe used to even fuck the same bitches\nWe used to spend weeks and even months on the corner tryin to maintain\nOur riches\nRemember we used to cut and go to other schools\nAnd I slayed them niggas with lyrics\nHad the whole school late for class\nCuz they all wanted to stay to hear it\nI want to thank you my nig\nCuz everytime I'm at war\nYou was always on my side\nRemember that time you almost died nigga\nAnd I saved your life\nYeah my dog that ain't shit\nNigga i'd do that a 1000 times\nRemember back when we was kids\nAnd I had like 1000 rhymes\nI ain't forgot we unloaded the desert eagles\nNigga to save my brothers\nThe other niggas started the war\nThen they snitched\nWhen they asked who I smothered\nTo my niggas sittin in a cell\nDoin 34 with an L\nThey can't seperate us by jail\nWe all stuck in the same hell\nI love you dawg\n\nI'm in my room\nTryin to make ends meet\nGot on the phone\nHave my whole crew\nMeet me at the end of my street\nI ain't wit havin no weed to smoke\nNo drink, and bein broke\nNigga we got to hit the bank loc\nAnd thats real ain't no joke\nTake me over to the projects\nSo I can steal me a regal\nThen we gonna run over to big Pooks house\nSo I can pick up those Desert Eagles\nY'all fools ready for this\nIt's on and crackin at noon\nWe gonna get in and get out quick\nWith all the money we can consume\nWe hit em right\nWe hit em hard\nAnd I got addicted\nThis shit is like a monkey on my back\nAnd I can't kick it\nSo I'm robbin banks left and right\nEverything is goin good\nTill I hooked up with this one nigga\nFrom the other side of the hood\nHe was a hothead\nHe'd come in the banks shootin guards and shit\nWhen we got out the bank and split the money\nThem other niggas he would rob and shit\nWhen the feds came sniffin around\nThats when I knew he was a bitch\nWhen the feds hit my house and put me on the ground\nThats when I knew he was a snitch"}]}