{"artist": "Apache", "songs": [{"title": "Apache Ain’t Shit", "image": "https://images.genius.com/7b040bdcfb9c6c3e03af2d9b25c4c25d.500x500x1.jpg", "album": "Apache Ain’t Shit", "lyrics": "{*Apache and some girl have sex for 21 seconds*}\n\n[A] Aww damn!!  Ohh shit {*needle drags record*}\n[A] Yeah, yo, yo yo yo baby\n[A] Get the fuck out!\n[G] Get the fuck out?\n[A] Yes, get the fuck out!\n[G] What the fuck you mean, get the fuck out?\n[A] Get the fuck up and get the fuck out!\n[G] Oh you on that shit?\n[A] Yeah I'm on that shit\n[G] Oh you livin like that?\n[A] Yeah I'm livin like that\n[G] Yeah aight, yeah okay Apache, you ain't shit!\n[A] Hahahahahahaha..\n\n[Chorus: Apache]\n(Apache you ain't shit!) That's what they're sayin G\n(Apache you ain't shit!) But there's no playin me\n(Apache you ain't shit!) So fuckin what?\n(Apache you ain't shit!) J drop a cut\n\n[Apache]\nYo I ain't shit, won't be shit, won't quit\nQuick, here comes a catchy Apache with a long dick\nI can't believe you think somethin's up my sleeve\nCause I'll fuck, give you a buck, then tell you to leave\nGet real, fuck how you feel, smile don't pout\nI'm done hon, you came twice, now get the fuck out\nI waited a long time to getcha\nLet the doorknob hitcha, where the good lord splitcha\nBack in the days you tried to get me now I'm gettin you\nThat's reason one-two, ain't shit else to do\nA man, with a plan and the know-how\nNot lookin for Mrs. Right, lookin for Mrs. Right Now\nGet your coat deep throat and get Swayze\nI'm out to get back anybody who plays me\nDon't try to flip, button up your lip\nHell yeah I'm on that tip - and I ain't shit\n\n[Chorus: Apache]\n(Apache you ain't shit!) That's what they're sayin G\n(Apache you ain't shit!) So what you playin me?\n(Apache you ain't shit!) So fuckin what?\n(Apache you ain't shit!) J drop the cut\n\n[Apache]\nCome have dinner with a winner don't worry about the price\nJust kiddin - I wouldn't buy you a fuckin slice\nI ain't shit dear, beware, ask me if I care\nFuck callin you a cab; here's your bus fare\nDon't ask me to bring your shit, cause I don't deliver\nAnd give me my shit back, I'm in indian giver\nIf there's money to be made then I'll make it\nI did you like I did you cause I thought you could take it\nCome come get with it, g'head admit it\nYou heard I wasn't shit and still let me hit it\nTried to trap me like Tyson, a damn shame\nI put a hit on everybody with the same name\nI'm on the move, no time to wine and dine a hoe\nIt's not hard for me to love 'em and let 'em go\nJust let me hit the hips, fuck the friendships\nI'm on that tip - cause I ain't shit!\n\n[Chorus: Apache]\n(Apache you ain't shit!) That's what they're sayin G\n(Apache you ain't shit!) So what you playin me?\n(Apache you ain't shit!) So fuckin what?\n(Apache you ain't shit!) J drop a cut\n\n[Apache]\nI'm a man without morals, so don't bet me\nI'll fuck my girl's best friend if she lets me\nBetter yet, don't let me forget the past\nStick around and get a bone kicked out your ass\nSpeakin of asses, I'm an ass man, lay down\nGot a four inch dick and that's from the ground\nCuties pursue me to do me, I dodge 'em\nOr find 'em, freak 'em, fuck 'em then rob 'em\nSince I can't live without 'em let's have fun\nBitches are like Pringles, you can't eat just one\nSave the commitment shit for a committed nigga\nI'll be committed to a bitch pullin in five figures\nBut my pockets got a padlock, they stay stocked\nMoney grabbers after mine and nine stays cocked\nForget a relationship, listen honeydip\nI'm on that tip, cause I ain't shit!\n\n[Chorus: Apache]\n(Apache you ain't shit!) That's what they're sayin G\n(Apache you ain't shit!) So what you playin me?\n(Apache you ain't shit!) So fuckin what?\n(Apache you ain't shit!) J drop a cut\n\n{*girl dissing Apache on outro*}", "year": "1993-02-09"}]}