{"songs": [{"image": "https://images.genius.com/b3d34ea442eef932a71e2da425174dd8.600x600x1.jpg", "title": "Bury You With Satan (Remix)", "album": "Street Villans Vol. 1", "year": null, "lyrics": "[Kid Joe]\nBrand new Necro \"Bury You With Satan\" remix!  new verse!\nExclusive!\n\n[Necro]\nBury you with Satan bury you with Satan\nDeath is in your future\n\nI'm gettin outrageous on you, pullin razors on you\nBlazin on you, twelve gauges on you\nAmazin the ways I print your veins on you\nIll warn you I'll bring euthanasia upon you\nOn some shocking asia shit\nSplit your face and spit on your corpse, you're a goner\nWrapped stabbed flesh juxed quick and grab your neck\nBludgeon you bloody, buddy you stupid what's after death?\nYou must be after gettin half your body cut in half\nAnd after the aftermath of the bloodbath I'll have my laughter\nYou stupid fucks'll catch crew cuts\nA chainsaw'll take the top of your brain off\nStabbin the two nuts of a Ku Klux - with scalpels\nMy rap'll leave you shackled\nMy rap is like crack inside a capsule\nI'll shove an axe in you where your axel\nYour main point your midsection where your ribs are flexin\nInfested with injections you gettin rid of the infection\nKid you're destined for the death\nDead walkin, flesh exertin\nWalkin through the streets dressed - being a corpse is next\nMake a mistake a blade'll take ya life away\nLeave you decayed inside a lake and break your neck\nDown to your spinal blade\nThe gore shit I kick is sick cause I'm a bitter kid\nI'll stick and vic you bitch\nRip you to pieces - pick you out a ditch\nGo devour dick you coward\nCatch a thousand hits around your skull\nYou won't get yourself nowhere bitin our shit\nNiggas know who did it kid you did it\nKickin it like you bit it you never lived it\nKick in his head til it splitted\nOpen and liquid soakin a hemoglobin ocean\nYou're a victim, you're no one I see him scopin -\nI choke him\n\nBury you with Satan bury you with Satan\nDeath is in your future (*4X*)\n\nListen to the rugged shit Your jugulars slit with razors quick\nI'm sick I only kick amazin shit oyu diss you buggin bitch\nYou better wake up before we dead you and break up your face\nYour a disgrace and you get taped up tortured murdered replaced\nI be the perverted wordsmith your burn shit you heard it?\nI said it stanic I bet it anybody can get it\nYou're not exempt from contempt you beat me you dreamt\nYou asleep and dozin yo'll be bleeding\nI'm a frozen frigid cold cretin\nImaculate packin a hatchet in my jacket\nBack it the fuck up you bitch or get cut up in fractions during action\nGore efficienado rip your body open with a bottle\nThats broken your smokin full throttle hit with a shottie\nI give X to dead necks butcher you push for you\nSenseless violence is endless when I bring it ain't much you could do\nPsycho+logical with the demonic pull\nReelin you into sin peelin your skin like a psychotic bull\n\nBury you with Satan bury you with Satan\nDeath is in your future (*4X*)\n\n[Kid Joe]\nPick up Brutality Part 1 drops September\nThis is the Kid Joe\nBury You with Satan Remix\nYou all fuckin die"}], "artist": "Necro"}