{"songs": [{"album": "Now or Never", "image": "https://images.genius.com/c76c49d728c583665c64123cf97fa389.600x600x1.jpg", "year": null, "title": "Table Dance", "lyrics": "[Tela]\nSecond time around\nY'all know what it is, right heah, yeah\nThat table dance, gotta get that table dance\nThat table dance, come and give me a table dance\nThat table dance, gotta get that table dance\nThat table dance..\n\nAy say baby how you doin, actin like you new in\nTown I done see you around, what you pursuin?\n(?) love, where you been? Ain't been really seein\nYour ass in the club, say what, just workin weekends\nI know you makin ends, you got yourself a Benz\nNaw that's that Lexus, protected with bubble ends\nThe parties where the dough at, go on and get the Moet\nThat's how it be, me and Lo-Key in V.I.P\nLovely I feel your breeze, strawberries and whip cream\nYour body ease, top of me, what time you leave?\nBout a quarter three, go get your girls I get my guys\nWe have a orgy, you feelin me? That's kinda nice\nHurry up, don't you see my niggas ready to leave\nThey been blowin since these eve and they full of Remi\nSay ba-by I wanna hit that fine, get that bind, split that dime\nWhy you lyin, on your side, you in front, I'm behind\nBullshit walk, money talk, I can be with any broad\nBut I want yo' panties off, why you havin any thoughts?\n\n[Chorus *sung*]\nG-string to the side, baby let me take a glance\nThe way you shake it baby girl you know your thighs put me in a trance\nI'm givin you a second chance, to get the money in your hands\nBaby for a table dance\n\n[Tela]\nSame bitch that I knew back from eighty-six college\nBitch polish dicks just for kicks, did some flicks with some chicks\nHold up hon, you ain't sick, why you gotta go and split\nTela's in the club won't you show a little love for this\nDo some special shit you know like you never had\nCause, I'ma special playboy Rap-A-Lot'n with Brad\nI make you laugh if you give me ass inside of a cab\nBetter yet the limo while my friends adapt\nWhat you tellin me, you wanna have sex with me?\nYou and Ebony, and Melody, because I am celebrity?\nI love it when y'all all come and lick on my balls\nTake me to the dressin room and she ain't have on no drawers\nTake it off, pussy blaow, mad girl wild\nI don't really know if I can handle this without\nA (?) compliments, bring some juice and supplements, cause\nWe be doin other shit, yeah y'all know that other shit\nWent up in it, I'll be in it, when I hit it, try done did it\nNot a minute, we not finished, where you goin? Change positions\n\n[Chorus] - 4X"}], "artist": "Tela"}