{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/13e8c687e539572b0d79f0fc8cf1018e.1000x1000x1.jpg", "title": "Executioner Style", "year": "1995-09-26", "album": "4, 5, 6", "lyrics": "Comin straight off the sidewalks of New York\nA nigga livin foul (repeat 2X)\n\n[Verse 1]\nAs I steps inside the playground, I lays down\nMy laws at the door\nAnd any nigga that's lookin for trouble\nGotsta face these silver double-four's\nThat I be packin on my hip, hollow-tips inside the clip\nReady to rip a niggas shit and make his wig slip\nTo the side as a homocide's commited\nI gets rid of niggas quick\nCause ain't no bullshit permitted\nI'm a outlaw\nThe motherfuckin villain doin killings\nI won't stop until the morgue\nGot bodies stacked up to the fuckin ceiling\nIt ain't no drivebys\nA mag and a bag lady, disguised and surprised\nYou got a hole between your fuckin eyes\nNiggas is grazed\nCatchin strays from the blaze\nAmazed\nBy the ways I lays em down when my shit sprays\nCrazy brains hangin, and niggas veins are swingin\nBangin and gunslingin\nEven my own fuckin ears are ringin\nCause what I carry's\nMuch bigger than Dirty Harry's\nDo a Hail Mary\nI make Bloody Mary's out of your capillaries\nPieces of flesh, hangin off a niggas chest\nCause the vest, that he dressed\nCouldn't FUCK with the Smith and Wess'\nMotherfuckers runnin for miles\nBodies stacked up in piles\nI'm killin executioner style\n\nComin straight off the sidewalks of New York\nA nigga livin foul -- \"I kill em executioner style\"-] G. Rap\n(repeat 2X)\n\n[Verse 2]\nI keeps my forty-five loaded\nWith dum-dums, in rear I hold this\nRight at my waist for just in case\nSomebody gots to get exploded\nCause G. Rap ain't that nigga that try to play\nSo nigga lay low\nOr get yourself a pair of wings, a harp, and a halo\nClown, keep fuckin around, and you'll be dead G\nI'm spttin out the lead see\nTo split your fuckin head like the Red Sea\nCharged up with anger,\nSix slugs in every chamber dangerous stranger\nWith itchy trigger fingers like Lone Ranger\nI'm comin to split your cabbage like a savage\nAnd put two in yo' ass bitch\nAnd one inside the wifey and the baby carriage\nSo head for the hills, I kills niggas for thrills\nCausin crazy blood spill, when I let one drill in your grill\nI will pull out the Glock and\nClear the block it when I cock it\nGet laid and played out of pocket\nWhen I rock it in your eye socket\nSo raise up queers\nAnd say your fuckin prayers\nI've been killin for years\nHuntin motherfuckers like reindeers\nIf one nigga's left standin, I'll squeeze the cannon (BOOM)\nOpened his motherfuckin ass like the Grand Canyon\nLayin faggot niggas like towel\nWhen I gets wild I'm foul\nI'm killin executioner style\n\nComin straight off the sidewalks of New York\nA nigga livin foul -- \"I kill em executioner style\" -] G. Rap\n(repeat 2X)\n\n[Verse 3]\nI take ten paces, draw my shit, and aim at niggas faces\nLeavin no traces so a nigga's BEATIN body cases\nI'm wettin shit up, you get hit up, by the super soaker\nBrain after brain, I'm a motherfuckin chain smoker\nCause it's the rootin tootin with the six-shooter\nPut a hole in your trooper\nSo big niggas can hula hoop ya\nLiftin them Smith and Wessuns like the westerns\nI blow out a niggas intestines\nAnd send him back to the fuckin essence\nBullet rows, blows out the nose of my fo'-fo'\nGunnin down all you bozos\nSo run and call for po-po\nSend in paramedics and bring a lot of antisthetics\nMotherfuckin bodies are beheaded\nNiggas are shredded\nSo nigga get ready to meet your fuckin fate\nWhen I send six trey-eight\nStraight In to ya motherfuckin chest plate\nG. Rap been murderin niggas as a child\nYou can go and check my files\nI'm killin executioner style\n\nComin straight off the sidewalks of New York\nA nigga livin foul -- \"I kill em executioner style\" -] G. Rap\n(repeat 2X)\n\n[Production by Dr. Butcher]"}]}