{"songs": [{"album": "E.B.A.H.", "image": "https://images.genius.com/ecaf59e8351d366bc86005cc66afe532.800x800x1.jpg", "year": "2012-09-18", "title": "A Real 1", "lyrics": "[Intro: Tech N9ne]\nYou should be accountable for the sins\nYou commit when behind the computer\n\n[Verse 1: Tech N9ne]\nI don't see why these motherfuckers don't get it, I'm livid\nWhen a youngster trying to punk ya, like he wanna thump ya\nBut it's something he twitted, tweeted, when the fun\nCome ya done agreed it, get a lump sum you gonna need it\nWhen I'm heated, you don't wanna go to war with a thug who succeeded\nI'm not the bigger person in person this music grind stops\nWhen niggas first in the cursin'\nYou're choosin' N9ne's block 57 jerkin' your curtain\nMissouri crime dot, both workin' turfs I be lurkin'!\nIn case ya be in a bit of hate and you wake\nAnd become an enemy the date should be late\nWith the brother's memory, the Yates, nobody's safe, it's how it's finna be\nYou said that you're gonna rape my daughters then cut their arteries?\nWould a father be honored? We'd be slobbering to cut your water streams!\nNigga, so while you hidin' behind yo' tweets\nI be findin out yo' street, 'cause all that flyin' out yo' beak, nigga\nI'm a real one, rhyme without no beat\nSay \"Fuck N9ne!\" and I'll go weak, you just lyin' out yo' teeth nigga!\n\n[Hook: Krizz Kaliko]\nI can only take so much\nWhy don't you think if you threaten me then I'll bust\nIt'd be different if you stepped to me then get touched\nI get a little bitter, we be beefin' on Twitter, I'm bigger\nI'm a REAL ONE! Ain't nobody iller\nDon't make me call on my guerillas\n'Cause what ya say might leak through\nWatch what you say when you speak to\nA REAL ONE! And ain't nobody realer\nIf I'm hurtin' then you can feel a nigga, who's inside out\nThink about what be comin out ya mouth\nIf ya doubt I'm a real one\n\n[Verse 2: JL B. Hood]\nAs real as they come, been me since day one\nGood heart in my chest, good smoke in my lungs\nGood head on my shoulders, stand in front of my soldiers\nNever let anyone hold us, think back when a wiseman told us\nThat \"life ain't about the destination, it's the journey,\"\nFulfill one mission, get a new vision, this ambition burning\nMaintain determined, distinguished gentlemen but a regular person\nEnergy up in my veins, got my fangs hangin' I'm turnin'\nRun with a Strange gang and I'm certain\nThat good thangs changing in that burden\nLifted, DIBKIS nigga hundred percent\nOf it all real if he comin at me sideways\nThinkin' that I will not kill, you trippin'\nBeen like that ain't, nothin' different\nIn a position throne like I'm sittin'\nCan't get pissed with consistent dissin'\nFuck that, where they do that at you gonna\nSee a nigga act unchristian\nI'm unstable, just ask Krizz then\nWhen I flip, so wicked it's sickenin'\nNiggas ain't takin' food up outta my kitchen\nI'm aiming at you, cowards\nDon't stand in the way of ours\nThat's word to Jesse Deuce Howard\n\n[Hook]\nI can only take so much\nWhy don't you think if you threaten me then I'll bust\nIt'd be different if you stepped to me then get touched\nInstead you be on Facebook with a hate look, AY, LOOK!\nI'm a REAL ONE! Ain't nobody iller\nDon't make me call on my guerillas\n'Cause what ya say might leak through\nWatch what you say when you speak to\nA REAL ONE! And ain't nobody realer\nIf I'm hurtin' then you can feel a nigga, who's inside out\nThink about what be comin out ya mouth\nIf ya doubt I'm a real one\n\n[Verse 3: JL B. Hood]\nExtensive time on these lines\nObsessive with mine, when I rhyme\nExpress what I find\nWhen I'm tryna access my mind\nI'm here with Tech, Tech, Tech (N9ne!)\nIf that upsets you then fine\nToo sensitive, busy cryin\nNigga bout' to get left behind\nExpensive wine on the table\nIn the atmosphere of a winner\nCelebratin' and I'm drinkin'\nLike fuck it I'm on a bender\nHavin' the time of my life\nHope I sober up and remember\nKeep it all Strange, brody\nAnd it's only gonna get bigger\n\n[Verse 4: Tech N9ne]\nAnimosity, we don't need it\nBut the botchery in your tweet it\nReally bothered me 'cause you're seated\nHella far from me, you're deleted\nBut it's irkin' me 'cause you said it\nWasn't givin' a fuck when you read it\nIf all of you motherfuckers was accountable\nFor givin' the negative all of it would be debted, dead\nSo watch that evil shit you spread\nI'm a real one so I feel some hurtin' pain then I go shed\nYeah, so don't back off when I respond\nAnd take your cap off when I go Nam'\nSo when you jackoff I'm on your lawn, motherfucker!\n\n[Hook]\nI can only take so much\nWhy don't you think if you threaten me then I'll bust\nIt'd be different if you stepped to me then get touched\nBut my heart don't pump no Kool-Aid\nThis the song that you made? It's too late!\nI'm a REAL ONE! Ain't nobody iller\nDon't make me call on my guerillas\n'Cause what ya say might leak through\nWatch what you say when you speak to\nA REAL ONE! And ain't nobody realer\nIf I'm hurtin' then you can feel a nigga, who's inside out\nThink about what be comin out ya mouth\nIf ya doubt I'm a real one\n\n[Outro: Tech N9ne]\nI'm a real guy, just 'cause you made me a star\nDon't make me a bigger person\nWhen you say something disrespectful to me\nI'm gonna react in the same way\nThat a regular person would act on the street\nIt don't matter If you buying my records or whatever\nI don't give a fuck, I don't give a fuck\nI got feelings too"}], "artist": "Tech N9ne"}