{"artist": "Wale", "songs": [{"title": "Bait (Remix)", "year": "2011-12-05", "lyrics": "[Verse 1: 2 Chainz]\nWork, work, work, work, stashed up at my girl's spot\nHair weave killer had on Louie's in my mug shot\nYeah, yeah, one shot, two shot, three\nDamn I pull up with this mother fucker fish tailing\nAnd I'm raw, fish scale\nBloomingdale and Neiman Marcus\nI take the beat and make it a carcass\nShop at Saks Fifth like it's a Target\nCloset the size of your apartment\nI'm swagged up so don't try me\nBank roll is my ID\nWhen I pulled out she hopping in\nMake your main girl my side piece\nListening to that old Jay-Z\nOne eye open like CBS\nSo much Promethazine I'm VIP at CVS\nLong way from EBT\nEvery time I spit it's a DVD\nAnd I don't care if she gone, in a long skirt\nI'll take her home and do her like homework\n\n[Verse 2: Rick Ross]\nCreeping on the campus in my new Camaro\nCover of the Washington Post, Solbiato apparel\nRoss and Folarin, couple women\nGot them thugs with me, yeah, we about that business\nI'm talking Ambition, I could spell it for you\nRev up the Lamborghini, inhale it for you\nMy pocket's fat, somebody check my blood pressure\nRed Bottom's a stack, there goes a double bidder\nI can't throw no ones, only tens or better\nSince Wale met me he only rode a Benz or better\nDouble MG, we millionaires\nShawty my bait, she say she never scared\n\n[Hook: TCB (Wale)]\nBait, bait, bait, bait, bait\nWho's on my line? Who's on my line?\nI'm blowing up, these bitches calling me\nBait, bait, bait, bait, bait\nI snatch your girl if you're slipping\nShe's on my line like I'm fishing I got that\n(Work, work, work, work, yeah you know I got that work)\n(I'm why baby mommas leave, I'm why baby fathers Kirk)\nI'll snatch your girl if you're slipping\nDouble MG not to mention, we got that\n\n[Verse 3: Trey Songz]\nTouching on that ass, tryna get a feel\nI just had to ask, tell me if it's real\nI ain't tryna diss you, it's really not an issue\nIf it's fake or if it's real I'mma keep you on my reel, still\nBait baby, wait baby\nWhy don't you just get a little taste baby\nI will never judge, fuck a judge, fuck a case baby\nOoh shawty, you shawty, come and be my new boo shawty\nListen, I'm fishing, you bitch niggas is missing I got that\n\n[Verse 4: Wale]\nYeah you know I got that work, women second, family first\nMoney never ever hurt 'cuz rapping got a lot of perks\nHold up, wait, these Nikes don't got no date\nIt ain't gon' be no back and forth\nBut I do quite well with all the bait\nThat remix flow, Mocco bread, PG though\n165 and I'm not surprised, see my flow yuck! My CD gross!\nBlack Ghost, white driver, such an Oreo, I'm thinking out loud\nIn the back seat and it's getting quite loud\nPoint 'em all out, I can sit 'em all down\nDouble MG, what about y'all?\nThese SB's ain't never coming out\nGod Forgive and We Don't\nKeep my circle small you can't get in my crowd\n104, that MLK, know I gotta be Landover out the way\nAnd I gotta thank the young boy Alizay\nWe gon' rep the city of Folarin straight, that bait\n\n[Hook]", "album": null, "image": "https://i.genius.com/dcf6226d74212ad15a339999f0505e2b94f1b95b?url=http%3A%2F%2Fwww.freshcutbeats.com%2Fwp-content%2Fuploads%2FWale-Bait-Remix.jpeg"}]}