{"songs": [{"album": "Below Paradise ", "image": "https://images.genius.com/21eb413b37360c4ff2074e95f89b8fa4.1000x1000x1.jpg", "year": "2014-05-27", "title": "Love Never Leaves", "lyrics": "[Hook: Natalie Lauren]\nLove it never leaves\nLove it never\nLove it never leaves\nI know love don't feel that same way it use to\nStrangers in the same bed I know you're\nQuestioning about cause I know this\nIt's all on your face\nAnd lately lately we've been so distant\nBaby I wish things could be different\nI won't stop searching for what we're missin'\nSo don't walk away\nCause love it never leaves\nLove it never leaves\nLove it never leaves\nLove it never leaves\nOh no no\n\n[Verse 1: Tedashii]\nUh, yeah, tell her I’ll be working late\nFrustrated sometimes at how we’re communicating\nTrying to make it like it was when we were kids\nSimple, but it’s difficult, and we’re just trying to live\nTrying to make it\nShe say that she can’t take it\nGrowing numb by the minute, in an hour she won’t feel it\nIs this the end, and is it finished?\nCan’t we make it work?\nAll these romance and love songs, she seem to make it worse!\nEmpty gestures, to try and bring back our yester\nDay, week, month, year, baby, are you still here?\nPlease, I know that this is not what you expected\nIn your picture perfect image, you’re imagining reflected\nI accept it, I made mistakes with your heart\nI was gone, you were distant, guess that’s how we grow apart!\nBut I want you, no, I need you, and I mean that!\nI don’t wanna lose you, I hope you see that!\n\n[Hook: Natalie Lauren]\n\n[Verse 2: Tedashii]\nIs it one of those days? Cause I feel fed up!\nFeel like you’re stuck in your ways, and you won’t let up!\nQuestion, like persecution, no retribution\nEnough is enough, and I don’t know what I’m doing!\nGot the weight of the world on me, can you help me out?\nDon’t add to the low, please, I’m really stressing out!\nThinking the grass is greener when you’re single\nSick and tired of arguing, so I change my demeanor\nShe wants to talk, I say we do!\nShe says that we’re not friends, and I just say it’s you!\nWe feel like strangers, but what's stranger is this feeling!\nLove never leaves, if it’s true, I hope it soon makes an appearance!\n\n[Hook: Natalie Lauren] (x2)"}], "artist": "Tedashii"}