{"artist": "6ix9ine", "songs": [{"year": "2018-11-27", "title": "WAKA", "album": "DUMMY BOY", "lyrics": "[Verse 1: A Boogie Wit Da Hoodie]\nCatch an asthma attack, the way we pull up on ya\nPut the pump to his chest, make a nigga cough up\nYou a bum and you stressed, and that's why you lost her\nMet a nigga from the X, niggas need to boss up\nShe gon' eat, you want beef, but this ain't no burger\nAll my songs on repeat, that's what's up, your word up\nI was young with the heat, walkin' 'round with burners\nWishin' I could wish for anything like Timmy Turner\n\n[Bridge: A Boogie Wit Da Hoodie]\nNa-na-oh, nah-oh\nNa-na-oh, nah-oh\nNa-na-oh, nah-oh\n\n[Chorus: A Boogie Wit Da Hoodie]\nWhy this bitch tryna play me? Are you crazy?\nPocket rocket in my cargos, like the Navy\nPut this Tommy to his brain, please, like he Brady\nHeartbreakin' on the daily, can you save me?\nWhy is bitches tryna play me? Are you crazy?\nI can't let her have my baby, you not my baby\nI can't let her have my baby, I'm actin' shady\nHeartbreaking on the daily, can you save me?\n\n[Verse 2: 6ix9ine]\nY'all gotta move, give me some room, I'm 'bout to shoot\nBoom! Everybody runnin' out the room\nBoom! Everybody beggin' \"Don't shoot\"\nBoom! Nigga, who the fuck asked you?\nYou a bum, are you dumb? Try me, I got this gun\nRun, nigga, if I'm here, don't come\nBitch, you was expectin' for me to hit\nThat's a dub, I know you put a hole in that shit\n\n[Verse 3: A Boogie Wit Da Hoodie]\nSawed off in the damn drawer\nGot the .30 in my drawers, gotta hold my pants up\nOnly time she ever call is for the banana\nI don't even check my call log, I don't answer\n\n[Chorus: A Boogie Wit Da Hoodie]\nWhy this bitch tryna play me? Are you crazy?\nPocket rocket in my cargos, like the Navy\nPut this Tommy to his brain, please, like he Brady\nHeartbreakin' on the daily, can you save me?\n\n[Verse 4: 6ix9ine]\nWhy this bitch tryna play me? Is she crazy?\nThat bitch know I'm number one, like Tracy McGrady\nKnow I got this .380, it's on safety\nI know all these niggas hate me, won't let it faze me\nFuck nigga\n\n[Verse 5: A Boogie Wit Da Hoodie]\nI'ma swerve in the Maybach, I'ma do some damage\nNiggas sit the fuck down if you don't understand us\nI heard niggas talkin' 'bout they gon' run down on us\nPull up windows down in the fuckin' Lamb' truck\n\n[Outro: A Boogie Wit Da Hoodie]\nNa-na-na-na-na-na-na\nNa-na-na-na-na-na-na\nNa-na-na-na-na-na-na\nNa-na-na-na-na-na-na, yeah\nScott Storch", "image": "https://images.genius.com/16c572cee652b4b917b43149499f8731.640x640x1.jpg"}]}