{"artist": "Watsky", "songs": [{"year": "2012-06-11", "lyrics": "[Chorus]\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nAnd step into the past (Way back)\nI'd do it all again (Again)\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nI was a stupidass (Dumbass)\nI'd do it all again (Again)\n\n[Verse 1]\nI might have a weak chin, but I don't have a glass jaw\nSo watch your fist glance off my cheek skin and back off\nI cut my teeth on the blacktop, I'm used to something cruel\nCause in my youth, my tooths were crowded as the public schools\nWhere we moved above the rules\nWhere the currency was percocets\nWhere I showed up early rocking headgear and turtlenecks\nThis nerd'll flex and you won't see this man pout\nCause the traits that got us beat down, are what make us stand out\nSo let your tongue hang out if you got lips like Mick Jagger\nPlant and stand proud with that little kid swagger\nThe subtle it factor of the baddest individuals\nCause adamant originals don't end up in pigeon holes\nWhich gets my thinking it's a damn shame dorks\nDon't pop their pimples like they're champagne corks\nI work the quirks, cause if I didn't start sloppily\nI'd never clean up this cotdamn properly\n\n[Chorus]\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nAnd step into the past (Way back)\nI'd do it all again (Again)\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nI was a stupidass (Dumbass)\nI'd do it all again (Again)\n\n[Verse 2]\nI never threw like Elway\nOr overthrew like El Che\nSo I moved to LA, to the land of milk and self hate\nBut one day, I'll strip and then strut buck down the sunset strip as it was a runway\nI'm thinking maybe Sunday\nAnd if you need sensei for sexy, just text me. I stay by San Vicente and La Brea where the rent's cheap\nSo you can't tempt me, with a Beamer, Benz or Bentley\nThat's complete with penis envy, and even keyless entry\nCause see, I'm making ends meet, so care to be friendly?\nAnd make ends meet? In my backseat in an awkward frenzy\nOnce in a parking lot while practicing anatomy\nI was knocking elbows till the music zapped the battery\nAnd dammit it was bad but I'm not mad I brought my A game\nEven if we sat there naked ‘til the man from Triple A came\nAnd it was way lame, but I've got on good authority\nShe boldly told the sordid story to her whole sorority\n\n[Chorus]\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nAnd step into the past (Way back)\nI'd do it all again (Again)\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nI was a stupidass (Dumbass)\nI'd do it all again (Again)\n\n[Verse 3]\nSome days I wake up and I wonder \"what would Buddha do?\"\nAnd then I jump into my fruity little Subaru\nSome dudes'll front, \"How do you do, Mama?\"\nBecause some women see the mula, and say 'ooh lala'\nBut I say 'woo-sah'\nI don't smooch on muchachas who need mucha to mooch off\nI'm cool for like a futon out in Utah\nA yurt up in the Yukon\nWhen hurtin' i'll go back to herding wild yaks in Bhutan\nOr cop a coupe with coupons\nBut when you get a F.U.P.A. like a dugong\nI'll treat you supa dupa we can't do wrong\nCause beauty is a dude who puts the moves on, then moves on\nWe're all moving as true pawns\nAnd get chewed in the food chain\nWe're all nude in the new dawn\nBrain screwed on\nWith a plain birthday suit on\nSo let's graduate human, summa kumbayah, huge honors\nSo you goners should do the do and do wander the blue yonder\nCause trying to fool the future takes too long\n\n[Bridge]\nI don't know quite where I'm going, but I'm on my way\nI won't look over my shoulder, back at yesterday\nI know that I'm getting older, a little bit grey\nBut I won't turn my face to look\n\n[Chorus]\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nAnd step into the past (Way back)\nI'd do it all again (Again)\nIf I could go back then (Back then)\nIf I could go back when (Back when)\nI was a stupidass (Dumbass)\nI'd do it all again (Again)", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "Stupidass"}]}