{"artist": "Asher Roth", "songs": [{"title": "Fallin’", "image": "https://images.genius.com/530d3219cbffab25c91a88faa96b0d3a.475x475x1.jpg", "album": "Asleep in the Bread Aisle", "lyrics": "[Verse 1]\nOkay, yeah\nI remember way back, I mean, way back, ages\n8th grade I think, feels like yesterday\nBowl cuts was the craze, I was crazy\nLong blonde hair all over the place\nAnd I'm pale as I ever was, baby face\nWith a frame like a skeleton\nSkinny kid, no, friends with bout everyone\nNo shit, I was cool, I had plenty fun\nBut one wish, I would grow up big\nNo, not built, but they say drink my milk\nDidn't get nowhere, switched up diet\nStarted having hip-hop, pops didn't buy it\nWanted more Springsteen, Earth, Wind, Fire\nFelt that was fine but to rhyme, had to try it\nCouldn't hide the fact I wanted to rap\nBought Jay-Z's CD with my own cash, man\nAnd that was back around '98\nWith the Annie sample and Money Ain't A Thang\nAnd even though I really couldn't relate\nI kept studying and listening and stuffing my face and now\n\n[Hook]\nI don't feel like I'm fallin' (Cause I'm so high that)\nI don't feel like I'm fallin' (And I'm so fly that)\nI don't feel like I'm fallin' (Cause I'm so high that)\nI don't feel like I'm fallin'\n\n[Verse 2]\nThen came high school\nStarted picking up a mic, thought I was cool\nMy friends said homie you know that your white, dude\nI said What? Fa real? Oh it's all good\nCause like this, when I tried it, liked it\nFlipped it, hyped it, insisted the mic\nCause this shit's just right\nJust like that, 9th grade footy heard\nStraight from the Philly burbs, feel me? pretty sure\nSuburban Threat was the name and we really were\nSteady wasting the day spittin' silly verses\nNo curses, writing bout our girlfriends\nBallpoint pen, mines spinning like a whirlwind\nGetting on the mic, I'm a wizard like merlin\nBreaking barriers, tearing walls like it's berlin\n\n[Hook]\n\n[Verse 3]\nAnd I think it was the summer of 12th grade\nWhen Uncle C passed away, leaving us empty\nAnd it hurt real bad\nDisturbed real sad\nBut we had to move on\nSo infact, real fast, we wrote this song\nBout fallen ones and miscues and misviews\nOf the misuse of words used to diss dudes\nSo true, in a serious face\nI'm convinced God works in mysterious ways\nLike everything happens for a reason\nI had to believe it cause that would explain why they leave us\nAs in people that mean everything\nI got love for them all, they'll be there if I fall but\n\n[Hook]", "year": "2009-04-20"}]}