{"songs": [{"lyrics": "[Uncredited spoken word poet forms the song's intro]\nAs Arsenio Hall would say, things that make you go HMMMM\nThe enemy forces inside, approached a young warrior king\nAnd tried to subdue him, but he fought back VAL-iant-ly\nThe warrior king had emerged from his fighter\nAnd had spoken to one of his subjects\nWhen he returned, the invaders tried to CUT HIM DOWN\n\n[Aceyalone]\nNah! None of that man! No! Uh-uh\nUh-uh, uh-uh, uh-uh, uh-uh, none of that no\nUh-uh, uh-uh, uh-uh, uh-uh, uhh\n\n[Hook One]\nBigger they come, the harder they fallin\nIt ain't, nothin but the soundboys brawlin\nIf you listen close in you can hear the reaper callin\n(HEY HEY) Bigger they come, the harder they.. fall\n\n[Aceyalone]\nMr. Big Bad Mouth Man don't know when to stay quiet\nAlways talkin bout how he can't be beat, but I don't buy it\nCome try it! No one man is a riot, seek the head and fly it\nMan against a giant, David against Goliath, I shall triumph\nHold down the fort, hold ground with a fo'-pound\nPronoun in case it go down, cause people are just so low down\nAt the showdown, the faster he go the harder it is to slow down\nIs it my town or yo' town? Can't nobody hold me down\nThe, BIGGER THEY COME, but soon they won't make a sound\nSnatch 'em up and take 'em down, shake the foundation mound\nAnd that's that - now how would you react?\nKABOOM out yo' back, it's no mo' movin back\nIt ain't no get back when the hammer kick back\nWhen the warriors go out to war they seldom make it back\nBack backed up against a wall, let's see who got the balls\nBigger they come, the harder they gotta fall\n\n[Hook Two]\nBigger they come, the harder they fallin\nBigger they come, the harder they fallin\nBigger they come, the harder they fallin\nBigger they come, the harder they, fall\n\n[Hook One]\n\n[Aceyalone]\nAll I wanna know is why your man got so much ego\nTough guy, wanna pick a fight with me and my a-migos\nBut he knows, not what him take on is lethal\nI'm everyday people, you want me superhero\nBig as a redwood, or small as a bonsai\nI'm a fungi/fun-guy, but anyway come test me, gon' die\nNo I'm not gun shy, more like a ninja\nGet it when you least expect it\nHit him in the vital pressure points that injure\nBut I'm really not violent, I meditate in silence\nBut I was taught, give 'em physical justice if they whylin\nDefend yo'self at all times, protect yo'self at all times\nRespect yo'self at all times\nIt's self-preservation versus brutal mankind\nGot, nothin to prove, I know mountains don't move\nAnd Bigfoot don't tippy toe\nThat don't mean it won't get you though\nYour ritual, walk around invincible, you imbecile!\nPower is habitual, this you know is principal\nTo overtake the meek is irresistable and sensible\nIf conscience is invisible, and courage is so minimal\nAnd then I go at 'em all, with unviersal laws\nBigger they come, the harder they gotta fall\n\n[Hook Two]\n\n[Hook One]\n\n[Aceyalone]\nNow any bad boy can be destroyed and anybody can get hit\nEven if you hard, harder than, hard can get\nYou think you'll never be defeated not even a little bit\nBecause you hard, harder than, hard can get\nI mean you too big, too bad, \"2 Legit 2 Quit\"\nBecause you hard, harder than, hard can get\nYou, try on a bad face, OH WHAT A PERFECT FIT\nBecause you hard, harder than, hard can get\n\nYo, yo yo - check it out\nYo back in the elementary school had a fight with the king of the class\nI wasn't in the mood for getting beat up so I had to kick his ass!\nI'm sick of bein bashed, lick a shot and lick it fast\nSooner or later the Gods and the Devils have to clash\nBraveheart, gave his heart so he could save his country\nMe I want to save the art to start before they hunt me\nWhatcha momma taught you HUH? Whatcha momma teach you (HUH?)\nDon't know why I fought you, don't know why I beat you\nSTAND UP to the systematic automatic controller\nRobotic, hypnotic, great psychotic ruler\nNever give an easy win and NEVER take a draw for..\nBigger they come, the harder they gotta fall\n\n[Hook Two]\n\n[Hook One]\n\n[Aceyalone]\nBigger they come, the harder they fallin\nIt ain't, nothin but the soundboys brawlin\nHarder they come, the harder they fallin\nIt ain't, nothin but the soundboys brawlin\nRougher they come, the harder they fallin\nIt ain't, nothin but the soundboys brawlin\nAight..", "title": "Bigger They Come", "album": "Hip Hop and the World We Live In", "image": "https://images.genius.com/dde48df06ccd165a12ed0bc40d9c736e.500x500x1.jpg", "year": null}], "artist": "Aceyalone"}