{"songs": [{"title": "Dear Bro", "lyrics": "[Intro]\nThis shit right here man\nIt’s real personal\nIt comes from the heart\nI miss you bro\nI love you bro\n\n[Hook: Chantal Kreviazuk]\nHow I'm feeling, it doesn't matter\nCause you know I'm okay\nInstead, I ask myself, \"Why do you worry?\"\nWhen you know, you know I'm the same\nI know, I know you don't love me, baby\nThey’re trying to take you away from me\nOnly over my dead body...\n\n[Verse 1]\nDear bro, how’s it going all the way up there in heaven?\nHow’s the afterlife? I know you live in paradise\nBut down here, everything is fucked up\nMan the world is so corrupt you gotta have a gun or have a knife\nAnd mommy going through it\nShe ain’t have a 9 to 5 since you died\nShe just stopped like a traffic light\nYeah it’s been five years but she still cry tears\nShe depressed and her anxiety ain’t acting right\nAnd as for me? Shit, I been hurting\nI ain’t even gon’ lie to you\nI been drinking, getting high, getting wasted, overthinking\nI been praying but the pain is so strong cause every night man I cry for you\nI’m still throwing up that five for you\nThe other day I was thinking ‘bout that time when you called me out the blue\nAnd you told me spit a rhyme for you\nNow every day I grind for you\nAnd Quinn, yo she really getting bigger\nLooking like the bigger sister\nShit she put me in the mind of you\nCan’t believe you had three kids nigga\nBut your daughter is your twin\nI swear to god she just a lighter you\nDamn we really miss you here\nLife sucks and there’s nothing that you missing here\nSince you left, everything is just different here\nTell god that he really need to fix it here\nBut anyway I really hope this letter reaches you\nWish heaven had a phone so I could speak to you\nSometimes I wish that I could be with you\nBut it’s something here in life that I need to do\n\n[Hook: Chantal Kreviazuk]\nI know, I know you don't love me, baby\nThey’re trying to take you away from me\nOnly over my dead body...\n\n[Verse 2]\nDear bro, I been grinding\nI don’t work a 9 to 5, to be honest\nI don’t think that is the life for me\nYou know this rap shit was always my priority\nWas always just a part of me, I swear it’s just right for me\nI found a girl that I really got a bond with\nBeautiful, plus loyal, she aight for me\nAnd Redlyfe, that’s the squad\nThem my niggas, them my brothers\nDifferent mothers and they still would take a life for me\nSaw your pops the other week, saw [?]\nGrandma and Earl Key on the keef\nRamell he in college, Keyon playing ball\nLil nigga getting tall, same height as me\nSeptember 26th, a day I never could forget\nAnother week, it’ll make five years\nDamn, it’s like where the fuck the time went?\nSince you left it’s like where the fuck my mind went?\nThe thought of it just make me want to cry again\nI swear bro I gotta win\nFor you, mom, me, and Quinn\nNah bro, I won’t quit\nCause if I lose I’ma try again\nLately I been neglecting the family\nAnd I don’t know why, I gotta spend more time with them\nP.S. I hope this letter reaches you\nWish heaven had a phone so I could speak to you\nSometimes I wish that I could be with you\nBut it’s something here in life that I need to do\n\n[Hook: Chantal Kreviazuk]\nI know, I know you don't love me, baby\nThey’re trying to take you away from me\nOnly over my dead body...", "album": "M.A The Mixtape", "year": "2015-11-08", "image": "https://images.genius.com/7441e7d1f3478922c9112bd215826a1b.800x800x1.jpg"}], "artist": "Young M.A"}