{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "Pre-Show Ferguson Decision Response", "year": "2014-11-24", "album": null, "lyrics": "I would like to say Rest in Peace to Michael Brown. I would like to give all thoughts and prayers to the people out there peacefully protesting. I also give thoughts and prayers to the people who could not hold their anger in because riots are only the language of the unheard. also give thoughts and prayers to the people who could not We usually come on to Queen’s ‘Champion’, but I just got to tell you today, no matter how much we do it, no matter how much we get shit together, shit comes along and kicks you on your ass. Tonight, I got kicked on my ass when I heard that prosecutor. You motherf*ckers got me today, I knew it was coming when Eric Holder decided to resign. You motherf*ckers got me today. You kicked me on my *ss today, because I have a 20-year-old son and a 12-year-old son, and I’m so afraid for them today.\n\nWhen I stood on the bus, and I cried, and I hugged my friend, I said, ‘these motherf*ckers got me today.’ When I stood in front of my wife, and I cried like a baby, I said, ‘these motherfuckers got me today. You motherf*ckers will not own tomorrow, we will not bend to your fear, we will not accept your pain, we are not going to keep playing that race card, because we know you don’t value my skin. We know you do value his (El-P), but we’re friends and nothing is going to devalue that.\n\nThere was no peace in my heart and I wanted to walk out to ‘Burn This Motherf*cker Down’. But I got to tell you, I’m from Atlanta, Georgia, something said, ‘Just look for something [Martin Luther King Jr.] might have said,’ so I googled Martin King and Wikipedia popped up, and he was 39 years old when you motherf*ckers killed him. He was the same age as I am, the same age as [El-P]. He was a young man when you killed him.\n\nBut I can promise you today: If I die when I walk off this stage tomorrow, I’ll let you know this: it is not about race, it is not a class, it’s not about color, it’s about what they killed him for. It’s about poverty, it’s about greed, and it’s about a war machine. It’s about a war machine that uses you. So as I go tomorrow, I might go the day after, the one thing I want you to know is that it’s us against the motherf*cking machine!"}]}