{"artist": "Will Smith", "songs": [{"year": "2005-03-29", "lyrics": "This is a true story\n{*\"Ms. Loretta\"* - 2X}\n\n[Hook: Will Smith singing]\nLoretta, wrote a love letter to a stranger\nThought that he would change her life\nThought she would be his wife\nOhhh Loretta, never ever met him no danger\nHer love for him sustain her\nThought that he would change her life\n\n[Verse One: Will Smith]\nMs. Loretta, a young girl, I never really met her\nA fun girl, a real go-getter I heard\nA gold Jetta a fool with books a nerd\nAnd so I'm told hooked on my every word\nOh so bold, a love letter, cleverly worded\nIn her jacket pocket, wrapped inside a platinum locket\nIn the shape of a heart, with pictures of me\nHad it inscribed, no us - no him - then no me\nShe fell in love with \"The Prince of Bel-Air\"\nFantasy was to see me and to be with me there\nSo she wrote a love letter to me, and then she signed it Loretta\nShe said I gotta go get him, Will is my soul mate\nWe gotta be together, how could we not be together?\nOh wait, if I send the letter\nI mean how will I be sure that they give it to him\nWhat if they don't give it to him, that'd ruin everything\nI gotta take it to him myself\n\n[Hook]\n\n[Verse Two: Will Smith]\nShe packed all that she owned into the back of her Jetta\nHer backpack and her cell phone and her love letter\nMost of her stuff was done up with, pictures of me on it\nWith the phrase \"it's gonna be\" on it\nHer mother beggin her, please come home\nAnd then, Loretta resentin her, leave me alone ma\nI won't leave my destiny unfilled\nYou just jealous because daddy ain't as sweet as my Will, click\nTo the front gate at NBC\nIn June or July, backstage at MTV\nShe would drive any place that they mentioned I'd be\nTold herself strive for love and God eventually\nWould give me to her, and her to me\nThis was meant to be\n14 months outside every event that I be at\nShe still keep missin me\nAnd now she, gettin high with more frequency now\nRage rumblin inside, got to be with me now\nThen she heard I married Jada - she took her love letter out\nAnd she wrote down P.S. - I hate her\n\n[Hook]\n\n[Verse Three: Will Smith]\nKodak Center, where the Oscars is at\nShe sleep, gettin woke up by the cops in the back\nBy a dumpster, didn't even greet 'em with fear\nGrinnin ear to ear, said my husband meetin me here\nYou know him, he nominated for his flick Ali\nAnd it'll be hell to pay if y'all pick on me\nDon't put that stick on me, hell no I'm not leavin\nGet your hands off, don't make them things click on me\nKickin and screamin, you intervenin\nThis is fate, Mr. what you mean that I ain't?\nWhat you mean it seem like I ain't? Ooh you like my mom\nAnd our love gon' survive y'all hate\nGod gon' take, me to my destiny\nY'all only are seein one side of me, Will gon' see the rest of me\nHe gon' see the best of me if I could only get him next to me\nHe gon' bring my blessings to me, I know it!\n\n[Hook] - 2X", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Loretta"}]}