{"songs": [{"image": "https://images.genius.com/8ab5eeecff25b17cb0aada47b6f1cc02.600x600x1.jpg", "lyrics": "I just want to be able to fly!\n\nYo, why do I keep putting all this pressure on myself?\nLooking in the mirror lecturing myself\nAs-if it's possible for me to ever be better than myself\nIt's like I'm measuring my health by fame and money\nBut even if I'm broke the day still looks the same and sunny\n\nI'm shrouded by these black clouds\nScreamin' as I'm jabbin' the wall\nI got a crown of thorns up on my head\nI'm grabbin' my balls\nI tried to break the doors of heaven\nBut I fucked up and shot myself in the foot with an AK-47\nToday I had to use my AK\nI gotta say it was a bad day\nI ain't fuckin' joking, shit is mad cray\nThe stupid radio has been playing stupider tunes\nI wanna move to one of Jupiter's moons\nAnd live forever\n\nI'm starin' at the ceiling once again (once again)\nWondering if I'm just wasting time (wasting time)\nI'm starin' at the ceiling once again (once again)\nI made a blanket from this cape of mine - I'm sayin'\n\nIf you're lookin' for a super-hero baby\nWell, motherfucker, that ain't me\nI hate a lot of situations, wanna live in isolation\nMake this world something that I can't see\n\nI remember turning 30\nI realized I gotta be stern and sturdy\nIt's real life, I gotta try to and earn and hurry\nGotta get concerned, man, I gotta get up early every day\nGotta work 10:30, just to hunt the worm and birdy\n\nAnd get a permed and purty girly from Kansas City, Missouri\nThat grew up on cans of tuna, and cans of shittier curry\nI'm an artist\nI'm a poet\nMy stanza's pretty and blurry\nI'm rich, that's just something these dancers titties assure me, but\nHow can I enjoy a dancer with rump?\nMy ex-girl just told me that she found a cancerous lump\nAnd she cheated on me\nHow can I be there for her?\nEven though I hate you Chad, I'm begging you to please support her\n\nCause I'm starin' at the ceiling once again (once again)\nWondering if I'm just wasting time (wasting time)\nI'm starin' at the ceiling once again (once again)\nI made a blanket from this cape of mine - now I'm sayin'\n\nIf you're lookin' for a super-hero baby\nWell, motherfucker, that ain't me\nI hate a lot of situations, wanna live in isolation\nMake this world something that I can't see", "year": null, "album": "Postcards From Kansas City", "title": "Another Galaxy"}], "artist": "Mac Lethal"}