{"artist": "Wax", "songs": [{"year": "2019-08-23", "lyrics": "[Pre-Chorus]\nMy lovely lady, I lied into the hole in your beer\nThat's why you said goodbye, you sung \"Get the fuck up out of here\" (Ah, ooh-ooh-ooh)\nAnd I deserve it but I'm hurtin' so bad (So bad)\nNobody's perfect girl, won't you stop being so mad? (Stop being so mad)\n(Ow-ow-ow)\nWhy do you insist on being like that? (Why?)\nI'ma make it up to you in no time flat\nLet's have a little chat\n\n[Chorus]\nYou gotta forgive (Uh)\nForgive and forget (Mmhmm, forget, forget, forget)\n'Cause if you give me a chance to be good to ya\nYou'll see how good a good man can get\n(Hey, you gonna see, you gonna see)\nYou gotta forgive\nForgive and forget (Oh)\n'Cause if you give me a chance to be good to ya\nYou'll see how good a good man can get\n\n[Verse]\nI know that I could never take back what I did\nAnd you don't feel like cuttin' any slack to the kid (Nope)\nBut I'm crawlin' back to ya like an arachnid\nAsking you to forgive the sins I committed\nBaby, I promise you I'm about to turn over a new leaf (Ah)\nNo more breaking promises or any causin' you grief\nI had a breakthrough that was existential\nI'm gonna live up to my best potential, I've learned\nAnd the knowledge I've gained\nWill help us to resolve any problems we've obtained\nI'm on my knees beggin' like a canine does\nAsking you to forgive me, what do you say, my love?\n\n[Pre-Chorus]\nMy lovely lady, I lied into those eyes on your face (Ah)\n(I was not honest, I didn't do it, I promise)\nThat's why you threw my guitar into your fireplace\n(Let it burn, let it burn\nLet it burn, let it burn, let it burn)\nAnd I deserve it but I can't take no more (I can't take no more)\nMy heart is a bull (Hey) and your love is like a matador\n(Toro, toro, toro)\nWhy do you insist on being like this? (Why)\nI would do anything just to get another kiss\nI am dead serious\n\n[Chorus]\nYou gotta forgive\nForgive and forget (Please)\n(I'm beggin' on my knees)\n'Cause if you give me a chance to be good to ya\nYou'll see how good a good man can get\n(You ain't never seen nobody be as good as I can be)\nYou gotta forgive\nForgive and forget (Yeah)\n'Cause if you give me a chance to be good to ya (Hey)\nYou'll see how good a good man can get\n\n[Outro]\nGive me one more chance, uh", "image": "https://images.genius.com/4bc8913b2dd7d9cd803c4dd33ffb5834.999x999x1.jpg", "album": "Acoustic Monday Album", "title": "Forgive and Forget"}]}