{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/a805277625b3011babfd7215f0b077d7.1000x575x1.png", "year": "2019-07-24", "album": null, "lyrics": "[TV Intro: Jimmy Fallon]\nMaking his TV debut performing \"RNP\" from his upcoming project The Lost Boy with a little help from Anderson .Paak and The Roots, give it up for YBN Cordae!\n\n[Chorus: Anderson .Paak & YBN Cordae, Both]\nCome on, New York City, Come on!\nOne of y'all, y'all, gon' be messin' with me (Oh, what the-, wha-uh, come on)\nI got two bad broads gon' be rubbin' my feet (Oh, what the-,  uh, come on)\nI got three young shooters down to bust out the heat (Oh, what the-)\nAnd oh, y'all ain't got nothin' on me (Yeah, hey)\nNot one of y'all, y'all, gon' be messin' with me\nI got two bad misses gon' be rubbin' my feet\nI got three young shooters down to bust out the heat\nAnd oh, y'all ain't got nothin' on me\n\n[Verse 1: YBN Cordae]\nUh, ok, put your, uh, hands up, this the, uh, anthem\nSmiling 'cause I'm young, rich, black, and I'm handsome\nNot to mention wealthy, body on her healthy\nYoung millionaire, what really can you tell me? Smell me?\nBoy, that's Chanel cologne\nI'm in Europe with the tourists with no cellular phone\nShe like-\n\n[Verse 2: Anderson .Paak and YBN Cordae]\nOoh, sound like rich brother problems (Uh-huh)\nI hit a bad chick with a fistful of condoms\nAnd the randomness, like risky ménages\nHit the head right, she can get what she wanted (Uh-huh)\nThe spits, then flaunt it, my drip like a faucet\nShe told me she was prego, I ain't even take the mother, mother ____ out my pocket, yeah\n\n[Verse 3: YBN Cordae]\nHold on, the opposite\nShe want to fly her, so I copped a jet\nMust be thinkin' I'm a one-way ticket on a runway\nDrippin' in my feng shui, sippin' on a sundae\n\n[Chorus: Anderson .Paak & YBN Cordae, Both]\nOne of y'all, y'all, gon' be messin' with me (Mmm)\nI got two bad broads gon' be rubbin' my feet (Oh, what the-,  uh, come on)\nI got three young shooters down to bust out the heat (Oh, what)\nAnd oh, y'all ain't got nothin' on me (Hey)\nNot one of y'all, y'all, gon' be messin' with me\nI got two bad misses gon' be rubbin' my feet (Come one)\nI got three young shooters down to bust out the heat\nAnd oh, y'all ain't got nothin' on me\n\n[Verse 4: YBN Cordae & Anderson .Paak]\nListen, I bought a Moncler coat for the times we were broke\nI'ma wear it in the summer on LeBron James boat\nFront row? Duh, bro, we don't sit on nosebleeds\nAin't your pockets obese? They won't fit in those seats\nAyy, we like a cold team, bro, Shaq and Kobe\nLike back in '03, I was only like 6\nI was like 16, but, I can give a sixteen\nI can make a chick scream, that's a bit extreme\nI got a thick bald chick, I call her Ms. Clean (Uh-huh)\nMy drip frosty like Halls and Listerine (Uh-huh)\nWe all all-stars, you hardly sixth string\nYeah, I had to ball hard to harvest these dreams\nSwear to God, me too, no Harvey Weinstein\nThe coupe was lime green, my wrist was blinding\nProlly in New York, Ferraris and blue cheese\nBro, does that even mean? Just let the hook sing (Come on)\n\n[Chorus: Anderson .Paak & YBN Cordae, Both]\nOne of y'all, y'all, gon' be messin' with me (Oh, what the-, wha-uh, come on)\nI got two bad broads gon' be rubbin' my feet (Oh, what the-,  uh, come on)\nI got three young shooters down to bust out the heat\nAnd oh, y'all ain't got nothin' on me (Hey)\nNot one of y'all, y'all, gon' be messin' with me (Come on)\nI got two bad misses gon' be rubbin' my feet (Come on)\nI got three young shooters down to bust out the heat\nAnd oh, y'all ain't got nothin' on me\n\n[Outro: Anderson .Paak & YBN Cordae]\nYBN Cordae!\nAnderson .Paak!\nYes, Lord!\nJimmy Fallon, New York City\nYou're now part of history\nFree Simba, Free Simba!\n\n[TV Outro: Jimmy Fallon]\nYeah, come on!\nNo, you gotta bow, that's what I'm talking about, that's how you do it!\nCome on, bud\nYou did great, man\nYBN Cordae!\nAnderson .Paak!\nThe Lost Boy is out Friday!", "title": "RNP (Live on The Tonight Show Starring Jimmy Fallon)"}]}