{"artist": "YG", "songs": [{"image": "https://images.genius.com/46b3a8826081b1d6675c55e03a09a50e.672x672x1.jpg", "year": "2014-12-15", "album": "Blame It On the Streets", "lyrics": "[Intro]\nLadies and gentlemen, boys and girls all the way down to the lil' ass babies. If y'all ready to have a party, say hell yeah (hell yeah), say hell yeah (hell yeah). Wait, wait wait wait, now hold the fuck up. Before I bring my nigga out, my nigga, my nigga, my mothafuckin' nigga. Y'all gotta turn the fuck up. I said if y'all ready to have a party, say hell mothafuckin' yeah (hell yeah). Standing six feet tall, weighing 160 pounds, coming live from Bompton nigga. Make some mothafuckin' noise for YG fo' hunnid\n\n[Hook]\nHands up, hands up\nNigga, I'm from BPT\nWhat? (West Side West Side  West Side  West Side  )\nNigga, TTP\nWhat? (What block? What block? What block? What block?)\nWhat? hol' up 400, Spruce Street\n(What y'all doin'? What y'all doin'? What y'all doin'? What y'all doin'?)\nNigga, kill off all beef\nTurn up, turn up, turn up\n\n[Verse 1]\nI’m a Westside get brackin' in the back like what’s happnin'\nThat 40 Glock snap like Insta, ain't no need for a caption\nI got put on by four niggas, wasn't need for no bandage\nI did my stuff like a young nigga, that's how I'm s'posed to handle it\nThe homie threw a right, duck, hit him with the left, bop-bop!\nTwo to the chin, bop! One to the chest\nOne to the ribs, the haymaker didn't connect\nDropped him but didn't stomp him cause that's disrespect\nThat's how I got put on\nTree Top Bompton, yeah I got put on, nigga\nIt was hard in the hood\nI was rappin', my homies sellin' hard in the hood\nI know Game from cedar block, Dot from the West\nThat was my homie *static* that popped what's his name in his chest\nJust got a call, the homies just got bust on\nNiggas gotta go, we can't prolong\n\n[Hook]\nHands up, hands up\nNigga, I'm from BPT\nWhat? (West Side West Side  West Side  West Side  )\nNigga, TTP\nWhat? (What block? What block? What block? What block?)\nWhat? hol' up 400, Spruce Street\n(What y'all doin'? What y'all doin'? What y'all doin'? What y'all doin'?)\nNigga, kill off all beef\nTurn up, turn up, turn up\n\n[Verse 2]\nI was in the county with lions, most of these rappers be lyin'\nCause when I seen 'em, they be quiet, the definition of silence\nThat's a principal of proof, the definition of logic\nThat this nigga is a bitch, every chance he get he's dodgin'\nI brought back this West Coast shit\nAnd this the mothafuckin' thanks I get?\nAll the licks I split, from the houses I hit\nThey brought him more cases in jail but a nigga ain't snitch\nThat's how it's s'posed to go down\nHeld it down, didn't nobody else go down\nGive you a blind date, have my bitch pick you up\nThen have one of my Top members stick you up\nI know Nipsey from 6-0, C-Hood from 10-4\nTiny Bone from 40 Crip, that’s my kinfolk\nMy whole family tried to save me but it didn't work\nMomma know I've been bangin' lately, nigga", "title": "BPT (Live In The Bay)"}]}