{"songs": [{"album": "G.O.Y.A.", "image": "https://images.genius.com/fb7ecaddc1d29cc6370534f44a6e9ae8.1000x1000x1.jpg", "year": "2013-01-01", "title": "Pulp Fiction", "lyrics": "[Intro sample:]\n\n\"Now, I know you think you're smart. See, cause you got all those flashy clothes, you got that big car there. You got all them black bitches working for ya. . .\"\n\n\"You forgot about the white one.\"\n\n[Verse One: Termanology]\n\nListen baby, go get outta them Dungarees\nI leave your ass stranded up in the telly 'fore you front on me\nI'm one of a kind, no same like a snowflake\nNo shame in my game I'll put cut in the whole cake\nI'll have you bleeding like you got an uppercut from that fluffy stuff\nGood thing I ain't puffing dust when I'm pouring up\nCause I'm hustler / mathematician\nI'm bagging women that look like Halle Berry in the mirror\nI'll chop a pill up and give it to a chicken till she hiccup\nGet up\nLittle slut, keep your motherfuckering head up\nThis ain't no Pulp Fiction, girl so don't go dying on me\nI got the iron on me and police spying on me\nIt could be worse, my daughter, grandma could be crying on me\nIn the middle of the street, with a sheet, lying on me\nBut I'm a legend, I'mma live to be 111\nGetting more love than the reverend when I be representing\n\n[Interlude]\n\n\"Now I'm going to warn you. But only one time. See, they told us that you were a trouble maker. That you're no good, that you don't know how to get along with people. . \"\n\n[Verse Two: Termanology]\n\nWhat can I tell you?\nYou know it's Hell when I come through\nFuck spitting a punchline at you, I'd rather punch you\nA pimp getting paper when the pussy is good\nAnd a hustler get paper went it weigh what it should\nSo do your shit right\nI see my name up in big lights\nMy shit's tight so several parties, I had to fistfight\nI mix white when shit's trife\nPitch right through midnight\nBrothers are slanging kidney's in the ghetto, how is this life?\nReefer and sneaker money\nBe making people hungry\nI think your technique is funny\nYou sniffing perico money?\nWhatever's whatever buddy, take down my number\nFrom sunup to sundown our mothers buzz me before you come up\nI'm in the Lawrence building\nI look like the Carter building\nI got no regards for children\nI'll sell you embalming fluid\nLet's do it, I'll prove it\nYou 'fore me yet I'll move it\nI felt like I'm cruising and make a killing before I'm through\nLet's go\n\n[Interlude]\n\n\"You better listen to him boy. If you don't something nasty is going to happen to you.\"\n\n\"Man, move over and let me pass before they have to be pulling these Hush Puppies out your motherfucking ass!\"\n\n[Verse Three: Reks]\n\nSick of the remedy, need Martin, Malcolm and Kennedy\nKicking killer delivery making niggas a memory\nMentally in Miami trees, 70, baby breathe\nLife into these bars, bring death to each and all broads\nSucking my slong long\nHours in the showers\nAnd the powers wanna lock up for keeping the party rocking\nHe be knocking out the speakers, her pussy leaking my semen\nSister think he a demon for creeping award tours\nLord knows I be fucking these hoes\nNever loving these hoes\nA couple nuts and then go\nI'm out the door\nShortfyuz, I abuse these dudes\nMy bars better\nYou can get her in the mood, I'm getting her drawers wetter\nY'all scared of Termanology, Reks\nYou know they bars is the best\nExplode from the chest is what you call a bomb threat\nPump fist for inciting a riot\nMove over let me pass\nOr get them Hush Puppies up in ya ass\nI don't buy it\nYou don't want beef, you niggas weak\nHeart pump Kool-Aid so sweet\nDrake, Common\nFake rhyming, bitch paid homage\nI stay shining, can't waste time in the streets\nA nigga keep climbing\n\n[Outro]\n\"Guns and dope are being sold to school children everyday.\"\n\n\"It's alright... it's real bad out there.\""}], "artist": "Termanology"}