{"songs": [{"year": "2008-08-26", "title": "Color Purple", "image": "https://images.genius.com/ece3d210dc35f31beebaff89c8ab6f36.996x1000x1.jpg", "lyrics": "[Verse 1]\nIt's been a long time coming, but I'm about to change things\nHoller at these kids that like to gangbang\nWhether you real with it or just playing games\nWhether you maintain or banging that thang thang\nIf you bumping this in your whip, you should change lanes\nSlow up, and get your brain on the same frame\nWe all bleed the same blood through the same vein\nWe all need the same love, feel the same pain\nSome'll slang crack, some'll slang caine\nAnd it's a damn shame, brothers acting like Ringling (clowns)\nBarnum and Bailey brothers, knowing jacks don't barely love us\nThey love to see brothers kill brothers\nThe 2k4 version of Colors\nWord to my mommy Guiliani could eat a dick cause only God could judge us\nLet's keep things rationalized\nAnything I write, shit'll nationalize\n\n[Hook]\nIf you ain't scared of no blood\nTell that faggot to throw it up outside after the club\nIf you ain't scared of no crip\nSay nigga fuck this shit, we could pop this off up in here\nBut if you a true to life thug\nSweep that shit under the rug and give each other a hug\nRed and blue make purple, the color of love\nRed and blue make the color purple\n\n[Verse 2]\nI changed the game like James changed the book\nYou heard the verse, now let me explain the hook\nSee, I need all of you gangs to look\nSee how people came this far? You know what type of pain it took?\nDo I gotta worry when I wear my blue and my red\nThat another black man gon put two in my head?\nWhat if it's war, you might need my food or my bed\nJust think about it, what good am I to you if I'm dead?\nI know we all gotta eat though\nIt seems like all we know is how to cop a kilo from little [?]\nBring the shit to the hood, sell the shit to our people\nMost of y'all niggas is slaves to y'all ego\nVice Lords, Latin Kings\nWe need peace god, we need to start practicing\nSee, I'm even trying to do it through this rapping thing\nSo I don't have to see none of y'all motherfuckers that feel you have to sing\n\n[Hook]\n\n[Verse 3]\nThe real gangs is the government\nThe Democrats are the crips\nAnd the niggas that blood to them is the Republicans\nInstead of claiming a set, they claim oil mines in Iraq\nSome in the Ukraine and Tibet\nYet, we don't even pose no threat\nThey got a system that'll lock us for killing one another\nLike they give a shit\nThey ain't care about Kody Scott\nMike Concepcion, whether he was a OG or not\nWish somebody woulda told me to stop\nShit, I used to shoot a lot, it was like giving Kobe the rock\nRemember Mikey first showed me the Glock\nAnd being we only thirteen, I was like totally shocked\nI thought we was killers, but now we know that we not\nCause he's dead and I'm alone, I get lonely a lot\nI don't care if you blood or cuz\nIf you wasn't or was\nNigga, you black, show each other some love\n\n[Hook]", "album": "Abandoned Nation"}], "artist": "Saigon"}