{"artist": "Vado", "songs": [{"title": "What You Need", "year": "2012-02-09", "lyrics": "[Verse 1: Vado]\n\nWelcome to the concrete jungle\nSlow grind, dope line, block need bundles\nWeatherman rain stacks, R.I.P Bundles\nDamier, grey black belts, sneaks, duffles\nThat's a old fit, red bumper hold bricks\nCustom van droved it, 100 grand road trip\nPatrick Swayze Rolls Royce on some ghost shit\nI don't spit, want a sixteen, take the whole clip. Bitch!\nI don't talk, I'm who they talk about\nNever chase, they chase me soon as they see me walkin' out\nEveryday he ain't sick wit it I bring his coffin out\nNo green you couldn't sell ? if you were ?\nI go hard with the best crooks\nNo cash, pay with credit cards or a checkbook\nWe been better, got bars make the rest shook\nTrendsetters, show the rock stars or the prep look\n\n[Hook: Vado]\n\nWhat you lookin' at?\nWhat you lookin' at?\nWe in the kitchen by the stove where we cookin' at\nWe on a mission in control and you shook of that\nMoney clothed, bank rolls, yeah we good with that\nWe jumped up, we party\nLike what you need, we got it\nLike what you need, we got it\nLike what you need, we got it\nWe jumped up, we party\nLike what you need, we got it\nLike what you need, we got it\nLike what you need, we got it\n\n[Verse 2: Nipsey Hussle]\n\nOne track mind, gotta get this money right\nYoung ass nigga on his grind all my fuckin' life\nNiggas goin' broke, they don't hustle right\nI get 10,000 a show that's every other night\nOn stage forty minutes catch another flight\nShopping when I land just to keep my luggage light\nClown niggas talkin' loud I don't fuckin' like\nBaby fuckin' me cuz she say he don't fuck her right\nLook, I been ballin' since my other life\nScared money stay broke and I was on the dice\nLearned early niggas fake and kept my circle tight\nAnd put the money over bitchies, Rollies under ice\nWas never lookin' at my dreams through a fuckin' pipe\nHalf a kilo, Cuban Linx 'fore I touched the mic\nGangbangin' lookin' back though we wasn't right\nIt got my nigga Page double life\n\nRepeat Hook\n\n[Verse 3: Vado]\n\nYo honey dip, I been gettin' fly on the money tip\nMy money flip went from rubberbands to a money clip\nGet money, yet he don't understand who he fuckin' wit\nI represent from that bottom, it's evidence that it's Harlem\nYeah, they like you better win cause you got 'em\nI never spend but I cop 'em, my sweater ? Red Bottoms\nHot, Close range when the iron blow\nShit, I need a whole thing on consignment though\nIt's not a game I ain't tryna pro\nI rather slang 'caine like behind the stoves\nCheck Nipsey left tipsy\nChicks with me, had the six in se'n fifty\nBricks filthy, hit the strip with wet milky\nNot guilty, took a step and left quickly\nMoney out of violence and drugs only\nVado be that mothafuckin' thug homie\n\nRepeat Hook", "album": null, "image": "https://images.genius.com/e2d9824f3848684bc687e9cad8889c34.687x595x1.jpg"}]}