{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "Still My Nigga", "year": null, "album": null, "lyrics": "[Intro: Talking]\nMan, you know the same shit, man\nThe money, the cars, the bitches could fuck up a great friendship\nYa know!\nTo all my partners and the partners I lost\n\n[Killer Mike:]\nYou used to be my nigga though, my nigga though\nWho'd a thought you'd ever envy me and talk down on me to Jigga ho\nSay we was tight like Wayne pants\nAnd it was money over bitches even when we made it rain dance\nLucci over poochi, no romance\nAnd I have never loved a ho so no ho-mance\nJust my bro man\nWe got to the cash money but like Nino and G-money the money make shit go funny\nThe bitches made it wicked\nThe dopeless made it hopeless\nThe coppers and the robbers with choppers make me they focus\nMy nigga's snitching and I'm like Lord have mercy\nMy homie sold me out\nMy partner just hurt me\nAnd all for a bitch I hope the nigga catch herpes\nNah, I'm fronting but at least the claps is hunting\nCause any other nigga I would have been clapping something\nInstead of in the studio smoking and rapping something\n\n[Hook: Killer Mike]\n(And when it's cold outside you can count on your grown man)\nYou my nigga though\nYou still my nigga though\nI don't fuck with you, uh uh, you still my nigga though\n(And when it's time to ride, yeah. You can depend on me)\nI'm still your nigga though\nI'm still your nigga though\nI don't fuck with you but, yo I'm still your nigga though\n\n[Ludacris:]\nNow we was once two niggas of the same kind\nSome pimps in our own fucking mind\nOn point at game time you would play your position\nThen you came around and double crossed me like a ribbon\nOh no, abort mission\nSome money's missing\nWent broke, I guess you got to get paid like tuition\nIf not the President you got to be a politician\nBut others like myself are trying to carry on tradition\nPut women in submission\nWe used to need permission\nTa-daaa, now we running through tricks like a magician\nWe smoking all the mirrors I knew something was wrong\nSo I made up a new trick it's called poof I'm gone\nNow I see you on occasion and we holler at times\nCause things ain't all peachy like the Georgia lottery sign\nAnd if you told me cocaine numbers I would think you was lying\nBut you got to get yours and fool I got to get mine\nLuda!\n\n[Hook: Ludacris]\n(And when it's cold outside you can count on your grown man)\nYou my nigga though\nYou still my nigga though\nI don't fuck with you, uh uh, but you my nigga though\n(And when it's time to ride, yeah. You can depend on me)\nI'm still your nigga though\nI'm still your nigga though\nI don't fuck with you, uh uh, but you my nigga though\n\n[Game:]\nHey, I had this other nigga who was my brother\nJigga fan undercover\nThe blueprints of my life with different mothers\nWe was the closest out of my sisters and brothers\nTwo G's closer than the Gucci belt but life's a motha-fucker when you dealing with paper man\nOne of our ego's got bigger than skyscrapers man\nAfter I put the documentary on them Daytons man\nAround the Doctor everyday so I had patience man, he didn't\nAround the dope spot he was pacing man, for digits\nAm I my brother's keepers for real or not decisions\nHe was in love with strippers sort of like a bee for honey\nAnd that was our separation like BG and Cash Money\n(Damn) Why does it got to be like that?\nI was stacking paper on tour I was gon' be right back\n(God damn) Why you couldn't let your ego die?\nIf you see me rocking a hoody nigga you know why\n\n[Hook: The Game]\n(When it's cold outside you can count on your grown man)\nYou still my nigga though\nYou my nigga though\nI don't fuck with you, uh uh, but you my nigga though\n(And when it's time to ride, yeah. You can depend on me)\nYou still my nigga though\nAlways be my nigga though\nI don't fuck with you, uh uh, but you my bigger bro\n\n[Singing:]\nWhen it's cold outside\nYou can count on your grown man"}]}