{"artist": "Waka Flocka Flame", "songs": [{"year": "2013-02-05", "lyrics": "[Verse 1: Waka Flocka Flame]\nLenses on my face, I see you aviator haters\nHomies with the elevators, car Indiana Pacers\nNever rockin' alligators, just some red bottom Chucks\nGone off a gram of mollies, I don't give a fuck\nFo-fo-forty tucked, when shit pop, you came with 'em, you better duck\nAll I know is stay strapped, get money, and run it up\nGot my foreign choppas on my nigga Soulja\nTalkin' bout Flocka then you know it’s game over\nBOW!\n\n[Hook: Wooh Da Kid] (x2)\nAll I know get it, get it, got it, now it’s gone\nKeep a lot of straps ‘cause I know the war’s on\nNever cross the line, you know I’m my brother’s keeper\nHurry, get 'em quick, this a message to the reaper\n\n[Verse 2: Wooh Da Kid]\nI’m from Jamaica, Queens, I’m looking for a queen\nI guess it’s only right, since Wooh da the king\nYea Wooh da the man, better fit me in your plans\nNiggas sleeping on me, guess they fucked up on the Xans\nIt’s time to wake em up, pour white coffee in a cup\nEvery ball fly paper, it’ll leave you stuck\nWooh da I’m the K-I-N-G\nBSM the army, be all that you can be\nSquad!\n\n[Hook: Wooh Da Kid]\n\n[Interlude: Waka Flocka Flame]\n10 bands on line 1\n20 racks on line 2\n45 racks on line 3\n75000 for a show, now that’s monopoly\n\n[Verse 3: Wooh Da Kid]\nWaka Flocka that’s my brother, fuck with him I put you under\nWooh da packin' heat, but keep it neat like a thunder\nAll I know is get it get it, got it now it’s gone\nThat’s my blood brother, it’s gon' be until we gone\n\n[Hook: Wooh Da Kid]\n\n[Outro: Waka Flocka Flame]\nBOW BOW BOW BOW BOW BOW BOW BOW\nHead shot, head shot, red dot\nHey boy, you came wit' 'em, you better duck wit' 'em\nYou better fight wit' 'em when I bust, nigga\nDo the ducking game man, money dance man, bands on deck\nBSM man, we get money man, 1-0-1-7\nSQUAD", "image": "https://images.genius.com/21b00c1d33bc35a7c5b4f72cdfffc3a3.500x500x1.jpg", "album": "DuFlocka Rant 2", "title": "Brother’s Keeper"}]}