{"artist": "Pras", "songs": [{"album": null, "title": "How It Feels", "image": "https://images.genius.com/5f4f397c7311486910ee54514a7ad678.1000x1000x1.jpg", "lyrics": "When I grow up, I'ma be a superstar\n[Pras] Ah-ha, alright baby\n\n[Chorus: children] + (Pras)\nThey, don't, know, how it feels\n(When you're out on your own, yeah)\n(And you're lookin for that home)\nThey, don't, know, what it is\n(When the world's on your shoulder)\n(And your baby gotta be a soldier)\n\n[Pras Michel]\nYo I was born in the pro-jects, with roaches and rats\nAnd our credentials were our, nines and gats\nStay the hell out the hood read the welcomin mats\nI remember them days, it was hard bein black\nWelfare checks and government cheese\nTake your family in portrait, everybody smile say cheese\nAnd it's a wonder how I kept my head from goin under\nSun don't shine where there's, lightning and thunder\nSome got ways, some got means\nBut still, we all just got hopes and dreams\nThe two blend together like dope and fiends\nCope with teens has that new gangster lean\nEverybody just wanna be a ghetto star\nFly cribs and drivin them big cars\nThat's all Mr. President, hear the voice of the youth\nI don't lie, I speak the truth\n\n[Chorus: children] + (Pras)\nThey, don't, know, how it feels\n(When you a single mother)\n(And don't have that significant other)\nThey, don't, know, what it is\n(To be in the ghetto)\n(And your life be in slow mo')\n\n[Pras Michel]\nUhh, yeah\nBeen around the world a couple times with the ReFugees\nFrom the boot of Italy, to the land of Pawnee{?}\nFell in love a couple times on the London Bridge\nFast cars, fast life, that's how I wanted to live\nWhat a crusade, one of my great escapades\nCut many hearts, like the game of spades\nBut nuttin was as fatal when they blew the World Trade\nNow we at war momma, tradin lives for grenades\nSend in the troops, here comes the brigades\nAmerican resolve and our hearts'll never fade\nI know you somewhere out there chillin in the shades\nBut I hate to be the one, to rain on your parade\nSee God is merciful and God bless his children\nThat's how we gonna reconstruct them buildings\nSo stop the killings, we runnin out of graves\nIn the land of the free, and the home of the brave\n\n[Chorus: children] + (Pras)\nThey, don't, know, how it feels\n(To hear our babies cry)\n(And watch our mothers die)\nThey, don't, know, what it is\n(To see our brothers in prison)\n(While they losin their religion)\n\n[Pras Michel]\nThese, eyes of mines are like, camera lens\nLoved by many but stabbed by my friends\nIs this the end? Some may cry out loud\nBut I won't worry we gonna, make it now\nThe ghetto fed up but they won't break us down\nIt's an eye for an eye what goes around comes around\nDo dis for my peeps who couldn't speak\nSurvival of the fittest, what happens to the weak?\nThey either in between, above or beneath\nTryin to play me like a scrub in a passenger seat\nRacial profile to say the least (okay)\nThere won't be no peace in the belly of the beast, c'mon\n\n[Pras + children]\nBut we gonna make it through baby\nEven though the world is so crazy\n\n[Pras Michel]\nAnd if they ask you, tell 'em it's pain times three\nCause it's a million of them kids stressin just like me\nBABY!\n\n[Chorus: children] + (Pras)\nThey, don't, know, how it feels\n(To see us go to war)\n(And see the people free for no more)\nThey, don't, know, what it is\n(To be a black man in America)\n(And feel like they're comin to get'cha)\nThey, don't, know, how it feels\n(To work for minimum wage)\n(As your life starts to fade)\nThey, don't, know, what it is\n(To be down to your last buck)\n(And no one really gives a mother-HA)", "year": null}]}