{"songs": [{"title": "Prices Goin’ Up", "album": "You’re Doing Good", "year": "2018-03-02", "image": "https://images.genius.com/62ed7e8ad5f168f97767d6395268cb1c.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah my prices going up\nYou're doing good\nYeah my prices going up\nYeah my prices going up\nSledgren\nYeehee, damn\n\n[Verse 1]\nGreen beam on the four five, touch screen, nigga I ain't never lied\nStatin' facts, never televised, spend a couple racks to cover up my eyes\nBust down kale salad, green juice, ski mask when it's time to ride\nMade a hundred thousand 'fore the half time like a Muslim pushing bean pies\nSwitch it up 'cause the beat dropped, pull up on your block with a new mop\nFuck an opp, flip a brick of wop, got it for the F, nigga why not?\nBoys on me so it's high speed, while I'm on the run breakin' down a Glock\nBounce out, foot chase, in the Bay yeah it really goes down\n\n[Chorus]\nI'm tappin' in, yop machine, yeah my prices goin' up\nFake niggas on my dick, yeah my prices goin' up\nFake bitches tryna choose, yeah my prices goin' up\nBitch ass nigga, yeah my prices goin' up\nAyy ayy ayy, ayy ayy ayy, ayy ayy ayy\nAyy ayy ayy, ayy ayy ayy, ayy\nYeah my prices goin' up\nAyy ayy ayy, ayy ayy ayy, ayy ayy ayy, ayy ayy ayy, ayy ayy ayy\nYeah my prices goin' up (shit, damn)\n\n[Verse 2]\nMy credit eight hundred, I can get a front\nBut I don't need a front, trunk in the front\nRoll another blunt, I ain't feelin' nothin'\nWhat the fuck is that? I smoke A-1\nGame fucked up, niggas ain't pimpin'\nBitch fagged off, I ain't really trippin'\nScope on it, kinda hard for me to miss 'em\nSmackin' bitches, eating free range chicken\nWhy you talkin' shit up on a nigga's pictures?\nPillow talkin' to these rusty ass bitches?\nLivin' legend, I'm a healthy ass nigga\nI'm at Calistoga takin' bitches fishing\nGot the bitch trappin', whole new mission\nGive a bitch the game, show her how to get it\nHit for ten grand, one night at the win\nThat's a cool down payment on a Benz\n\n[Chorus]\nI'm tappin' in, yop machine, yeah my prices goin' up\nFake niggas on my dick, yeah my prices goin' up\nFake bitches tryna choose, yeah my prices goin' up\nBitch ass nigga, yeah my prices goin' up\n\n[Outro]\nBitch ass nigga I'm back, you know what I'm sayin'\nYou got me fucked up, get my motherfuckin' swag, you know what I'm sayin'?\nI'm pullin' up, you know what I'm sayin', drop top\nHella motherfuckin' bitches, you know what I'm sayin'\nBlack ones, snow bunny, Indian, Jamaican, you know what I'm sayin'\nWhatever you need, Asain, you know what I'm sayin'\nI got that for you\nYeah my prices goin' up"}], "artist": "Larry June"}