{"artist": "Phora", "songs": [{"album": "Proverbs 18:21", "title": "Real?", "image": "https://images.genius.com/cfba1137e22d3a4bfe2d3caa70e5f7f8.1000x1000x1.jpg", "lyrics": "They say my time is coming soon\nAnd they wanna take my life, but that ain't nothing new\nI've been spit on, bleeding on the ground\nBeen kicked on, but if I'm going down motherfucker then you coming to\nLately I just don't know what to do\nCause I hear these nigguhs talking, but they actions never coming through\nSo stop yapping on the net\nI fear no man, but God so come and slice these tats up off my neck\nAnd if ya'll gangsters so tough then I don't know why ya'll don't ever come to none of my shows\nClose your mouth\nIt ain't to hard to catch me\nI'm coming in your cites\nBut you'll probably just look pass me (Ha)\nReal shit though I try to keep the peace\nBut it's difficult to keep when nigguhs always starting beef\nPut your ears next to my soul\nTell me if you hear me\nThese are my last words before these motherfuckers kill me\n\nHaha\nCan you feel me? (nope)\nNo I'm not new to this I'm true to this (I'm true to this nigga)\nYou ain't really real I can tell when I look at you (I can tell when I look at you)\nI'm authentic you artificial man (Artificial man)\n\nHaha\nCan you feel me? (Nah)\nNo I'm not new to this I'm true to this (I'm true to this nigga)\nYou ain't really real I can tell when I look at you\nI'm authentic you artificial man\n\nNowadays everybody want to be real\nDon't want to put in work, but they expect to eat a free meal\nLost faith\nCause this worlds so fake\nHad to leave my last chic\nCause these girls is snakes and shit\nI lost hope to finding a girl I trust\nCause the last one I was with didn't really give a fuck\nSince I ain't got nobody to talk with\nThese beats become therapy and help deal with the nonsense\nAnd I can't wait to die (Huh)\nCause when I'm gone their gonna realize the reason why I came to life\nPaste the skies with love\nThey let the fake shit rise above\nAnd when I tell you that I'm real\nNo I ain't saying I'm a thug\nAnd saying I'm a gangster\nI'm just true to myself\nCause in the end that's all that matters fuck the girls, fame, and wealth\nSo try to life my life then tell me if you feel me\nThese are my last words before these motherfuckers kill me", "year": "2012-08-12"}]}