{"artist": "Ace Hood", "songs": [{"title": "Loco wit the Cake", "album": "Ruthless", "year": null, "lyrics": "[Hook]\nSpent thirty in the mall\nGoin' loco wit the cake\nFive cars sitting tall\nGoin' loco wit the cake\nTen on some Cali' bud\nGoin' loco wit the cake\nThen I hit the strip club\nGoin' loco wit the cake\nGlittered up my wrist\nGoin' loco wit the cake\nWent and Guccied up my bitch\nGoin' loco wit the cake\nRepping five with the pimps\nGoin' loco wit the cake\nI put on my whole team\nGoin' loco wit the cake\n\n[Verse 1]\nAye\nYou don't want to start a food fight\nGet your attitude right\nBefore I put this cake all in your face and have your crew like\nWho that is? Ace Hood\nYou ain't know that's Ace Hood?\nAsk around in every project they say that boy face good\nPut the Range Rover on them 24's I skate good\nEspecially with the paper ice, all over my Ace Hood\nChain, fuck a dummy I need hoes to educate me\nGood brain!\nTake the package up the temple come back home and get, paid!\nSeven days up out the week a nigga gotta get, paid!\nQuit your hating, get on your job, and ho you can get, paid!\nLike Ace, like who? Like me nigga\nThat's why every bitch you trying to fuck like me nigga\n\n[Hook]\n\n[Verse 2]\nI work them pots like it's chemistry\nGot a F in chemistry\nTook the white and turned it green\nNow that's what I call chemistry\nThat's what I call, Enterprise\nCall my work, The Enterprise\nTwenty junkies beaming up to Scotty in my Enterprise\nSmoking in my spaceship, floatin' through the galaxy\nThey calling me a shooting star, leave hoes off through your calvery\nGangstas, goons, and killers only niggas on my salary\nThey all got charges pending\nMurder, burglaries, and batteries\nNiggas trying to battle me, end up finding they tragedy\nLaided out on the floor and breathing fast and looking up at me (Up at me)\nPlay me in your Chevy when you scrambling\nRuthless than a motherfucker with hundred grand on me\n\n[Hook]\n\n[Verse 3]\nAye\nYou can call me Mister Cash Flow\nMoney out the asshole\nThugging getting paper, what you think that Louis bag ho?\nPull up in that stupid whip\nHundred for the stupid wrist\nStupid this, stupid that, loco with the money bag\nLamborghini Murcielag', girl you got to stupid that\nGucci this, Louis that, riding with them paper tags\nAnd my bitch she bad as hell, Juicy, Louis, Gucci bag\nAll my niggas love to swag, Bentleys, Phantoms back to back\nTwenty grand I'll show you going low and tell them holla back\nPain you a dummy, blow about thirty on a whip and then\nSwing on them 30's\nI drop the top on them verties\nSwitch lanes, on them haters, I'm throwing paper to make them spend\n\n[Hook]", "image": "https://images.genius.com/53ac3721e503404e628fbbe13e8ddd8e.600x600x1.jpg"}]}