{"songs": [{"year": "2010-01-01", "image": "https://images.genius.com/1a165debcabc064cd4d2ed1475b171bc.600x600x1.jpg", "title": "Cowboy", "album": "Crossroads 2010", "lyrics": "[Bizzy Bone]\nYeah this for the cowboys and the cowgirls out there, yeah\n\n[Devin Oliver]\nWill you keep me around and around and around. How do you keep me around?\n\n[Verse 1: Bizzy Bone]\nYou know I'm just a cowboy, you know I'm just a cowboy. And I'll be out every night on the town. You come around when\nI'm down girl, how girl do you keep me around and around and around.[x2]\n\nYou know I like to play, and fuck, and get drunk, and smoke drugs\nWith the boys in the club in the back fucked up and I don't fight\nWith a bitch I'll laugh and just leave had a broad on the trail, take the sail\nJust believe. Did you stay with me, come play with me, make me tell the truth?\nDo you really even know I don't really love you. I don't really love me\nSo how could this be you waist your time on a wretch just the sex that sweet\nI'm just a cowboy I'm making money daily. Had a problem with my new thing not thinking of your family\nCause' really I don't need a women I don't need a friend\nBend over backwards for a women and she'll find another man. I met em' all down to\nHood girls, hustlers in the world, every mama wanna ball so I ball out on the curb\nAnd still I've seen nothing, no nothing that brings nothing, so I'm tryna' get ya something\nThat's not gonna get ya nothing\n\n[Hook]\nYou know I'm just a cowboy, you know I'm just a cowboy\nAnd I'll be out every night on the town. You come around when\nI'm down girl, how girl do you keep me around and around and around. [x2]\n\n[Bridge]\nI'm married to the money, I'm married to the money\nI'm married to the game, I'm married to the game\nI'm married to the money, I'm married to the money\nStill the same ol' G. Still the same ol' G. [x2]\n\n[Verse 2: Devin Oliver]\nAnd girl you know you gotta fall back (fall back.) And no I'm never ever gonna call back\nYou know that I'm attached to the stacks and fat track\nI like your dedicated hard to fall back\nAnd you know I ignore what's right in front of me\nThe money, cars and clothes have got the best of me\nI'm a cowboy your my ecstasy, so get off cause' no one rides with me\nSeeing when I'm in the worst and you know that your the best but\nI can't choose one girrrrrrrl\n\n[Hook]\nYou know I'm just a cowboy (it's a life that you can't replace.)\nAnd I'll be out every night on the town you come around when I'm down girl\nHow girl do you keep me around and around and around. You know I'm just a cowboy\nYou know I'm just a cowboy and I'll be out every night on the town you come around\nWhen I'm down girl how girl do you keep me around and around and around and around and around\n\nI'm married to the money, I'm married to the money\nI'm married to the game, I'm married to the game\nI'm married to the money, I'm married to the money\nStill the same ol' G. Still the same ol' G\n\n[Hook]\n(til' fade)"}], "artist": "Bizzy Bone"}