{"songs": [{"title": "No mercy", "lyrics": "Oh this what we doin?\n\nTook the cold out my heart went and put it on a watch\nMiddle finger hangin out the Benz, feel like Pac\nSpittin on your cameras, bandana with the knot\nCompetition lookin for me, I was waitin at the top\nBut ain't no competition, ain't no one in my position\nDidn't mean to flex on niggas, wasn't my decision\nGod told me do it, so I did it on 'em\nAnd hoes gon be hoes, I ain't trippin on em\nNiggas dyin to be me, so I'm livin on 'em\nSince they want to pay attention, I'ma bill it on 'em\n\nI don't feel her like she feel me, but I'm feelin on her\nShe thought the sky was fallin when I dropped the ceiling on em\nThen she went and dropped her panties\nFuck your heart, I want a Grammy\nDon't take Molly, don't take Xannies\nBut there's weed inside the pantry\nI get high, to get by\nShe go low 'cause she my hoe\nShout-out Reem, that's the bro\nShout-out to my muthafuckin woes\nWe ain't never home, we on the road\nAin't no letting up ain't catching up, we on a roll\nPull up in a skrrt skrrt, hop out then I brrrp brrrp\nCameras out, hold up, let me pose\nPretty muthafucker put me on the front of Vogue\nNiggas try to be tha bro, but they don't know the code\nI put Her in History and sold around the globe\nThis about to be the greatest story never told, nigga\n\nHuh? If you ain't know, then now you know, nigga\nHuh? I wasn't welcomed, I imposed, nigga\nHuh? I put this dick inside her soul, nigga\nUh, just to get up under niggas skin\nFuckin with the same sex, they say it's a sin\nBut I'm a dyke and she a fem, it's a synonym\nPuttin M&Ms in the bank\nThen I go and buy a pack of M&Ms, nigga\n\nTook the cold out my heart, went and put it on a watch\nMiddle finger hangin out the Benz, feel like Pac\nSpittin on your cameras, bandana with the knot\nCompetition lookin for me, I was waitin at the top\nBut ain't no competition, ain't no one in my position\nDidn't mean to flex on niggas, wasn't my decision\nGod told me do it, so I did it on 'em\nAnd hoes gon be hoes, I ain't trippin on 'em\nI don't feel her like she feel me, but I'm feelin on her\nShe thought the sky was fallin when I dropped the ceiling on 'em\nNiggas dyin to be me, so I'm livin on 'em\nSince they want to pay attention, I'ma bill it on 'em\nLet's get it", "album": null, "year": "2019-10-03", "image": "https://images.genius.com/eac22acf0996fe81401676d52fe00183.803x803x1.jpg"}], "artist": "Young M.A"}