{"artist": "Ace Hood", "songs": [{"title": "0 to 100", "album": "Body Bag 3", "year": null, "lyrics": "(Ace Hood)\nYour are now in tune to the beast mix\nI got the key to win and i'm the locksmith\nYou can say your prayers once the Glock lift\nSleeping' on me Freddie Kruger i'm a nightmare\nFuck all this ace hood you need to chill shit\nI body these rappers i got the kill switch\nI'm the one get it done and i'm like the SEAL six\nPolice asking me questions i keep a sealed lip\nOh lord i am the illest you gotta' deal with\nShe blew my brains out she a real crip\nTwelve-hollow rounds in the Glock clip\nThat shit can get to banging if you set trip\nBetter watch your Mrs. ima shop lift\nGo to slamming in this pussy like a mosh pit\nMoney and power my nigga this is our year\nJust know they not on the block if they know the cops there\nDamn right hunnit-twenty on the turnpike\nNothing like some head at the red light\nShe can't get enough, this dick a crack pipe\nLet me fuck her to Machiavelli, that's thug life!\nSwitch the flow up, nigga focused and i'm on that potion\nIt's hocus pocus, top will disappear  you ain't notice\nAll you niggas bogus, in the beamer picture me rolling\nAn i'm heavy boastin', fuck your favorite bitch i'm the chosen\nChevy candy coated, i'm the boss i can't get promoted\nI got plenty shooters, but you know i just gotta tote it\nIf its murder homie, then its guaranteed that i wrote it\nIf its hot i'm on it, get the bussin like i was tony\nI'm talking Montana, pretty bitches in my cabana\nFuck your propaganda, richest nigga with bad grammar\nGlocks in them dirty hampers, the clip is like a banana\nWe the best on my back, can you kindly show me some manners?\nNigga hood nation, fuck waiting and fuck patience\nImma get it now, anybody get traumatized\nWith that drama time, i'm the one who you idolize\nI ain't never lie, gotta ride, they petrified\nHope i never die!\nPussy niggas they ever, try get them televised\nSinging more than a lullaby\nI was bored nigga, watch get rich or get into war nigga\nI kill shit welcome to the morgue nigga!\n\nDonald Sterling feelings i don't like niggas\nEvery where i go i got my team with me\nOnly bad bitches ever seen with me\nNiggas jealous and they still living\nBefore i leave this bitch free Meek Milly!", "image": "https://images.genius.com/23c5d7b9ce6c4ce4c56e05378d036619.500x500x1.jpg"}]}