{"songs": [{"lyrics": "Hook:\n(Cuban Doll)\nImma gangsta bitch\nImma pistol poppin’ get it out the mud bitch\nI’m the type of bitch you might just fall in love with\nYeah I’m looking for the money, where the plug at?\n(Asian Doll)\nImma rich bitch\nFinesse a nigga out his life, he ain’t get shit\nAll my bundles come free, imma lit bitch\nThink that bitch mad she ain’t his bitch\nAye! Aye!\n\nVerse 1: (Cuban Doll)\nI don’t gotta use no chop, I’ll drop shit\nI ain’t flexin for the gram, bitch fuck a pic\nAll my bitches getting money, we ain’t doing dicks\nAnd your nigga taking orders, he a fucking trick\n\nVerse 2: (Asian Doll)\nI ain’t flexin’ for no nigga who ain’t got shit\nI ain’t tweetin’ bout no bitch, imma spot them\nAll my niggas really killers, get mopped quick\nBitch you broke, and you mad Imma hot bitch\n\nVerse 3: (Honey Oso)\nUh!\nI don’t gotta talk big, bitch I’m bout it bout it\nPop up at yo crib, make you come up out it\nI’ll take a bitch nigga, have her in her body\nName honey bitch, you can come and lick it off me\n\nHook:\n(Cuban Doll)\nImma gangsta bitch\nImma pistol poppin’ get it out the mud bitch\nI’m the type of bitch you might just fall in love with\nYeah I’m looking for the money, where the plug at?\n(Asian Doll)\nImma rich bitch\nFinesse a nigga out his life, he ain’t get shit\nAll my bundles come free, imma lit bitch\nThink that bitch mad she ain’t his bitch\nAye! Aye!\n\nVerse 4: (Honey Oso)\nBitches wanna fight, ain’t no one on ones\nYou talk real brazy, we got big guns\nOh yeah drop a pin, bitch we gon come\nDrop her lil ugly ass, then we gon stomp\n\nVerse 5: (Cuban Doll)\nBig mouth, lil hair, lil bitch retarded\nPutting on a show, leave her on the red carpet\nBefore we up them chops, on you weak bitches\nWe’ll pull up to your crib, and just beat bitches\n\nVerse 6: (Asian Doll)\nAll that Instagram flexin, get yo weave snatched\nSmack her in the mouth, don’t wanna hear no feedback\nNiggas got you on a leash, you a bad puppy\nBitch you better keep a buzz off that rap money\n\nHook:\n(Cuban Doll)\nImma gangsta bitch\nImma pistol poppin’ get it out the mud bitch\nI’m the type of bitch you might just fall in love with\nYeah I’m looking for the money, where the plug at?\n(Asian Doll)\nImma rich bitch\nFinesse a nigga out his life, he ain’t get shit\nAll my bundles come free, imma lit bitch\nThink that bitch mad she ain’t his bitch\nAye! Aye!", "album": null, "year": "2018-02-26", "title": "Gangsta Bitch", "image": "https://images.genius.com/99068b4fe0ef3f5a74786d23287c24a1.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}