{"artist": "50 Cent", "songs": [{"album": "Smokin’ Day 2 (G-Unit Radio Part 1)", "image": "https://images.genius.com/1b884ca5d64dceca3c26e802a05cb117.600x610x1.jpg", "title": "Baby Get On Your Knees", "lyrics": "[Intro: 50 Cent]\nYo, Whoo Kid, man. Yo, drop this shit, man. I gotta go, man. Let's hurry up, let's go, man. Oh yeah. 50 Cent, uh. G-Unit. Oh, man. I'm feeling myself right now\n\n[Chorus: 50 Cent]\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\n(Come on, baby, just kiss it for me\nJust put it in your mouth)\n\n[Verse 1: 50 Cent]\nShe was hesitant at first, said she never did it before\nAs soon as I got her going she was going like a pro\nShe went up and down like a merry go round\nAnd round and round and splash\nShe's freaky freaky, when you get her in the bed\nYou need a G like me to get her to give you head\nMy conversation is stimulating\nShe in room ten-nineteen in the Hilton waiting\nShe got a thing for ballas, I mean a thing for balls\nAnd I had turned her ass out so I'm the one she calls\nOn the cheek she kiss me and she tell me she miss me\nBeing around me got her used to drinking Don and Cristy\nI'm a special nigga, look, I'm used to blinding\nKeep that Benzo clean and those spreewells shining\n\n[Chorus: 50 Cent]\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\n\n[Verse 2: Lloyd Banks]\n(You can't be serious? It's four in the morning..)\nRight in the morning I rolled over\nGuess who was over my shoulder\nA pretty round, round, round\nWho just got finished going downtown\nBut at night with no lights I have you wondering\nIf it's a lighting bolt in your mouth or a glow-in-the-dark tongue ring\nBanks need a ghetto chick, set a nigga up wit ass\nSneak around till he fall asleep, digging in his stash\nLeave with everything, rob a Benz, stacks and the grass\nAss so fat she get handclaps when she pass\nI ain't never had a girl, but you can be my bottom bitch\nI done been around the world, we done hit all kind of chicks\nRange Rover, never sober, Hennessey, vanilla soda\nB-A-N-K dolla sign, bitch\nNah, I ain't here to hold you\nLet your baby daddy roll his shoulder\nBanks don't associate with no tricks\nI'ma make it a G-Unit party, from the hotel lobby\nAnd if you ain't trying to freak off then go home, bitch\n\n[Chorus: 50 Cent]\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\n\n[Verse 3: Young Buck]\nYou know what I came to do, let you put your lips on my dick\nBut don't tell nobody, you my mistress, bitch\nAll your friends keep telling you what to do when you get me\nGot to eat the nuts first like a Hershey's Kisses\nBitch, show me you miss me like I'm Pac or Biggie\nShe can be small as Eve or even big as Missy\nI like it when them dikes indugle in group six\nSuck off thanks to 50 and B-Light, unit\nGet your ass suplexed, telling me to go down\nI'm a P-I-M-P, bitch, I bet you know now\nBaby girl, slow down, ou make a nigga cum quick\nWhen you closed your eyes and make your tongue do a twist\nYou my 3 o'clock, lolipop, kiss the last drop, bitch\nWalk around naked, hoe, I met your ass topless\nShe finally found out what Young Buck is 'bout\nSo give a nigga from the south some of that mouth\n\n[Chorus: 50 Cent]\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\nBaby, if you get on your knees\nPut me in your mouth and suck me off\nYou know I got you\n(Come on, girl, you know I got you)\n\n[Outro: Don Magic Juan]\nAlright then, you playas that's down on the dial right now. We gon' give you some real good game, dawg. Official, dawg, Magic Juan and Whoo Kid. We gonna do something that y'all know we gonna do. We gonna soda-pop. Y'all know what I'm talking about if y'all with this game, so get your soda popping ready 'cause we gonna soda-pop it 'round here. Church", "year": "2003-03-29"}]}