{"artist": "B.G. Knocc Out", "songs": [{"album": "Eazy-E’s Protege", "title": "Freedom", "lyrics": "- Yo Knocc Out get the fuck up\n- What?\n- The warden wants to see your ass\n- What the fuck the warden want with me?\n- You fucked up, you deal with it\n- Fuck him, fuck you too\n- Fuck me huh?\n- That’s what I said\n- Fuck me fuck you muthafucka, I’ll put you ass in the box\n- Like I give a fuck, I’ve been here for 10 years, don’t give a fuck about the box\n- I show you punk ass muthafucka\n- Ya alright, bring your ass in my cell!\n\nFreedom...everybody want some […]\n\n[Verse 1]\nLook, I am CC, son\nStraight outta Compton, CC is where I’m from\nWe keep it poppin’ and the city getting dumbed\nAnd that’s why I never leave the pad without packing the gun\nGotta keep that thang on me\nHit the corner, little niggas try to bang on me\nI gotta say around here ain’t the same, homie\nThey will never talk this [?] that’s a shame, homie\nBut that’s life\nYoung girls getting piped down\nThat’s the type of shit that’s going on right now\n[?] on to pay the price now\nBut was born ready, fuck waitin’ we should fight now\nI want my freedom\n\n[Verse 2]\nDon’t wanna die gotta face my fears\nAlways tried not to cry, but can’t escape the tears\nLord knows that I wanna get away from here\nBut for now abuses gotta take him here\nI can’t shake it\nThey say life is what you make it though\nBut I spent my whole life try to make it dough\nEvery opportunity I’ma take it though\nAnd when I throw my mic try to shape it though\nIt’s real talk\nAll my people gotta do the same\nDon’t allow society to hold you in chains\nIt’s abuse so you only have you to blame\nAnd don’t be reaction every homie use your brain\nIt’s God givin’\nHe created you for a purpose\nYou only get one shot gotta make it worth it\nAll you [?] to think you deserve it\nYou was placed right here for you to do a service\nLet’s get your freedom\n\n[Verse 3]\nWhere I’m from the killer season will never change\nThe white man he has put a price on everything\nGot Obama ’cause we wanted a better change\nBut wherever I look it all remains the same\nLord help us, better never fuck with Katrina\nHad the whole city piled up and wonder [?]\n[?] misdemeanor\nSo I’m looking for Lady Liberty have you seen her?\nA cold bitch, put my people in a cold twist\nAnd you wonder why we run around hopeless\nYet we tried, but it’s easy to lose focus\nBuilt this nation but why are we the brokest?\nIt’s all our plan [?]\nIraq now they wanna go attack I ran\nEven general Kadafi tried to take a stand\nSyria and Egypt, y'all [?]\nTo get your freedom", "image": "https://images.rapgenius.com/fe0de3059aaf02131706ef9c8902e493.800x800x1.jpg", "year": "2011-08-06"}]}