{"songs": [{"image": "https://images.genius.com/341a0545bbee6cbf1670c1c1961454e3.320x320x1.jpg", "year": "2011-04-15", "title": "Foreign Exchange Student", "album": "Zero Heroes", "lyrics": "[Intro]\nYeah!\nWe on Squaria!\nHahahaha, yeah!\n\n[Verse 1]\nWhat planet did you come from?\nWith your nails, makeup, and hair done\nAt my show, hands up to the sun\nAsk her what she’s doing when it’s done\nSo we gon' kick it, have a little fun\nPlay me in Street Fighter 4 and won\nChun Li kicks, hair in a bun\nMarvelous sweats, All-Star Chucks\nWhat you smoke? what you drink?\nGreen Ty-Ku? What you think?\nBra all black, panties pink\nI’mma see that by the end of the week\nWe take it slow, I'll take you home\nYour moms don't trip, cause, shit, you grown\nShe said \"You gon' let me sleep alone?\"\nI said nah, she said, \"Come on\"\n\n[Hook]\nI don’t know just where you came from\nI need you now\nIf you leave me for the stars\nThat's something something I'd never allow\n\n[Interlude]\nOh, she cold\nYeah see, I knew she wasn’t from here\nThat’s why I call her Foreign Exchange Student\nCause she’s like fresh as fuck\nLouboutins, Alexander Wang and all that\nBut at the same time, she plays Marvel vs Capcom 3\nListens to The Pixies religiously\nAnd had like a 16 killstreak on Black Ops! Haha!\n\n[Verse 2]\nI don’t know your circle, circle\nBut you like this square right here\nI know your ex hurt you, hurt you\nBut don’t be scared, be scared\nI'll take you high, so high, up in the air, the air\nGeorge Clooney cool and I don’t Bugs, that’s Looney Tunes\nYou come backstage, my crew is cool\nMass Effect 2 and watch kung-fu\nGrabbing these snacks like Scooby Doo\nSmoke 'til your eyes like Lucy Liu\nShe knows I ball cause she asks for shots\nHit a triple double when I pass the Ciroc\nIf love is blind then I’m Matt Murdock\nYou ain’t going home, well I’m glad you not\n\n[Outro]\nTo all the ladies\nOr should I say, Squarian women out there that this applies to\nI wish I could send you some beautiful flowers\nOr a teddybear or something, but I can’t\nSo I’m gonna have Awesome Sound play the synth solo\nJust for you baby, just for you, check it out\nIs that vintage? Preferably\nSwag, swag, swag, swag"}], "artist": "XV"}