{"songs": [{"year": null, "title": "Climb Trees (radio edit)", "image": "https://images.genius.com/8b24619eca032daebf0caa5c44aa746d.512x341x1.jpg", "lyrics": "Sun set and sun rise I'm my own personal light show\nFlipping switches...moving from basin bottoms to plateaus\nThe Earth...manipulates itself beneath me\nI stand still...stagnate. Can't kill...this lagged state\n\nLife...manipulates itself around me, but I'm dead still\nUpright...but dead still\nWord is still born...I will not stoop to the level of the stoop that y'all chill on\nIf the building's boarded up and the children of the corn\n-er Liquor Store don't want to kick it no more...\nBecause holes have filled the wall, sneakers are scuffed & toes have become sore\n\nI saw y'all walk from the hood of tough luck\nYeah, if these walls could talk they wouldn't shut the fuck up\n\nJump in your pick up truck. Drive from the mountain range\nCash the chips in on your shoulder, cut your losses, die young, count the change\nHow strange...you think these clouds look lovely?\nSmoke signals...manipulate themselves above me\nNo symbols...are below me enough to overlook\nI know you read my every move, I wrote the book\n\nMind not the blemishes that are on my premise. Endlessness is my \"to be continued...\"\nNotice the nervousness in my footnotes when being interviewed\nShaking uncontrollably. \"How you doing?\" \"Not bad...how about you?\"\nBrought it right back to me like \"What've you been up to?\"\n\nI don't talk to freaks. I even ignore my neighbors who live down the stairs\nI walk the streets. And they don't know that I'm famous in 2000 years\nSo I say shit loud in their ears and I spit a wretched verse in their face...\nDisrespecting their personal space\nIn a split second, curtains and drapes get closed\nThey think they've shut me out, but I can see their ugly mouth in the shape of \"O\"s\nI'd break their windows with a stone that has a note attatched\nThat says \"I hate Jim Crow, and here's a poem to let you know the haps:\"\n\n\"I've got a golden axe and I chop cherry trees down\nDead to this world. Bury me now.\"\n\nI am from a distant place that sits and waits for my belated time to come\nBut its too late I've missed my fate. I \"F\" with the deaf, blind and dumb\nMy father taught me one thing...how to fire a gun\nI don't bother...this is survival for fun\n\nI have become the most sinister sin city clicker\nCynical dim witted trixter\nCritical shit grinning hipster\nWhisper...to my earhole...tell me not to be fearful\nBe careful\nNot to make any...sudden...movements\nShow me your sole...I like to study shoe prints\n\nYou've stepped to me before! I can recognize them stubby toes!\nI left them guys with bloody clothes. For a second time...nobody knows\nThe pain I've seen. Nobody knows the pain I've seen\nNobody knows why I've got a bloody nose or how they made it bleed\n\nChorus:\nClimb trees...go out on a limb\nTo find me...forget about him\nForget about hymns...what are those psalms that you sing\nWhat are those songs that are in your head echoing...\n\nI am not here to make a change. I break chains\nI break dance moves and move Strange--\nStrange Famous is infamous for inflammatory mission statements\nLiving in basements with subterranean secret service agents\nWith little patience. A pediatrician who hate kids\nWomen's lib is getting choked to death by their own baby bibs\nBaby, did you know I love women who hate mankind?\nI talk about it all the damn time....keep it comin' HUH!!!\n\n\"IIIIIIIII HHHHAAAAAAAATE MEEEEEEEENNNNN\"\n\nThis conversation is mine. I own all the stock in boring small talk\nAnd I've trade marked this facial expression called the \"gawk.\"\nSo fuck off. I dis functions souped by ninjas and hockey fights\nWhile discussion groups infringe upon my copyrights\nAll them bitches want me tonight...I've been so great and respectful\nThey only get salty when I bend them into the shape of a pretzel\nI make them flexible when I break their schedule. It only got hard...\nWhen I asked 'em politely not to fight me and to give up...God\nDamn...this is easier than I thought it would be\nThey'll attend any party and not fight it as long as they're invited cordially\nUnfortunately, I've only got so many hundred openings\nBut talk to me, I want to take you all under my broken wings\n\nWho's the right man for the job?!\nPut up your hands y'all because I'm not tall enough to stand up to God\n\nWho's the right woman?! Throw up one hand...and wave it now\nI'm taking your job", "album": null}], "artist": "Sage Francis"}