{"artist": "Angie Martinez", "songs": [{"title": "Silly Niggaz (feat. Interlude & Uneek)", "image": "https://images.genius.com/439f66679a994188cae23c6858565d8a.438x438x1.jpg", "album": null, "lyrics": "(intro)\nOn any day, in the hood\nIn front of any building, you can find some chicks\nAnd what will they talk about? Niggas\n\n(A) Yo, yo get the f**k outta here!\n(U) Yeah, that f**kin bum motherf**ker\n(U) Pico and shit from around the corner, that nigga be wildin\n\n(Angie)\nUh-huh, yeah..\n\n(Uneek)\nI know this player named Ricky, push an 850\nLight-skinned, slim, with a head like Sticky\nAll you gotta do girlfriend is slip a mickie\nAnd in a quickie, Ricky turns into tricky\n\n(Angie)\nAiyyo but what about his man? 'cause named Stan\nRun around town in the plush Benz van\nIce all around his Rolex band\nBut runnin his mouth bout his credit card scams\n\n(Uneek)\nYeah jerk that nigga, I heard of that nigga\nThe crew of quick niggas wanna murder that nigga, shit\nHe must be listenin to too much Jigga\nBuddy Longdough, he got no figures\n\n(Angie)\n\nYo, aiyyo I know you know Ralph, up on Tiebout\nHe a Puerto Rican cat, yeah you know he eat out\nWalk around town with the weed and heat out\nAnd he loco in the coco, dank weed out\n\n(both - repeat 2X)\nAll over the world, niggas got a story to tell\nIs you fly as f**k, or you broke as hell?\nWhat set you claim nigga, is you thug or what?\nWhat set you claim nigga, is it love or what?\n\n(Angie)\nRude bwoy name Brian, nigga stay lyin\nGot regular, but he swear it's Hawaiian\nPart time dealer, part time client\nSmokin up what he should be supplyin\n\n(Uneek)\nAnd yo that kid Black, don't know how to act\nWanna keep the Timbs on when he hit it from the back (oop!)\nPullin on my hair, almost loosened up a track\nBut I like that kid, he can keep comin back!\n\n{*laughter and ad libs*}\n\n(Angie)\nEverybody back up, back up off the ropes\nAll you silly niggas are gonna have to back up\n{*laughin*} We're gonna need all silly niggas to back up off the ropes!\nMove back.. back.. back.. back..", "year": null}]}