{"songs": [{"title": "Molly", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro: Lil Dicky]\nYeah... man, this is the softest thing I ever did\nBut... it's about something that's pretty important to me\n\n[Hook: Lil Dicky]\nAnd that's you\nAnd that's true\nReally wish that I didn't care about you anymore\nBut I do\nWhat do I do when the rap life\nMake a motherfucker choose up in that fight?\nMake a young couple do something sad like\nBeing broke up even though we had life\n\n[Verse 1: Lil Dicky]\nFuck it, I don't even know what I could've done\nLooking back thinking, \"That's what I should've done\"\nWanting you back\nBut when the fact is I always put you second to rap\nI'm not mad that you wouldn't come\nAnd even though I had to move, I ain't move on\nReally wish you was a boo I could prove wrong\nBut she knows what I'ma do with the new songs\nAnd she know I'm pretty soon with your dude on, running the rap game\nWith that lane always gotta be up on that train\nOr that plane, ain't nobody want to feel that pain\nWith that strain wishin' I ain't gotta get that fame\nOr acclaim, you know I'd give you my last name\nPut that blame on me, chasin' something, feelin' dumb cause you all I need\nHope you wait until I'm done and I'm all free\nBut you know I never know when that's gon' be\nAnd I'm sorry\n\n[Chorus: Brendon Urie]\nIt's the hardest rule to follow\n(I'm thinking of you)\nI really wish that I could call you\n(What can I do?)\nYou can find another me tomorrow\nAnd that's the hardest pill to swallow, babe\nIf I woke up and I called it quits\n(I'm thinking of you)\nIf today I gave up all of this\n(I don't know what to do)\nMaybe I could get you back tomorrow\nAnd that's the hardest pill to swallow, baby\n\n[Hook: Lil Dicky]\nAnd that's you (that's you)\nAnd that's true (that's true)\nReally wish that I didn't\nCare about you anymore (care about you anymore)\nBut I do\nWhat do I do when the rap life\nMake a motherfucker choose up in that fight?\nMake a young couple do something sad like\nBeing broke up even though we had life\n(had life, had life, had life)\n\n[Verse 2: Lil Dicky]\nWhen I'm being dumb and stupid who the fuck is gonna hit me with the motherfuckin' jerk face?\nWho gon' let me know to hit my mother on her birthday?\nWho gon' let me know when I be shopping if a shirt's gay?\nAnd when I'm on the road I be missing that\nAlways looking at my phone, you would give me crap\nEver since I been alone I've been thinking back\nListenin' to your autotune in my mike-phone making us laugh\nYou know the past was a blast but it never could last\nPretty sad when your love got a separate path\nUsed to read when there's nothing to do\nBut it's funny, doing nothin's never nothin' when it's somethin' with you\nYou know I want to still talk, even text and call\nWhenever something's going on I be pressin' \"Mol\" up in the phone\n'Til I press the \"x,\" stressed, the next one I'll best the ex and you'll forget, but it's best\nYou the best to me girl, always baked me something\nAnd when it ripped off, you replaced my buttons\nBut don't be pissed off if I hate your husband\nCause even when I can't say \"love ya,\" I love ya\n\n[Chorus: Brendon Urie]\nIt's the hardest rule to follow\n(I'm thinking of you)\nI really wish that I could call you\n(What can I do?)\nYou can find another me tomorrow\nAnd that's the hardest pill to swallow, babe\nIf I woke up and I called it quits\n(I'm thinking of you)\nIf today I gave up all of this\n(I don't know what to do)\nMaybe I could get you back tomorrow (oh)\nAnd that's the hardest pill to swallow, baby\n\n[Hook: Lil Dicky]\nAnd that's you (that's you)\nAnd that's true (that's true)\nReally wish that I didn't\nCare about you anymore (care about you anymore)\nBut I do\nWhat do I do when the rap life\nMake a motherfucker choose up in that fight?\nMake a young couple do something sad like\nBeing broke up even though we had life\n(had life, had life, had life)\n\n[Chorus: Brendon Urie]\nIt's the hardest rule to follow\n(I'm thinking of you)\nI really wish that I could call you\n(What can I do?)\nYou can find another me tomorrow\nAnd that's the hardest pill to swallow, babe\nIf I woke up and I called it quits\n(I'm thinking of you)\nIf today I gave up all of this\n(I don't know what to do)\nMaybe I could get you back tomorrow\nAnd that's the hardest pill to swallow, baby"}], "artist": "Lil Dicky"}