{"artist": "The Game", "songs": [{"title": "Better on the Other Side", "album": null, "year": "2009-07-18", "image": "https://images.rapgenius.com/e3e658af01712b2bfec05ccd407e8aa5.760x760x1.jpg", "lyrics": "[Intro: Diddy & Boyz II Men]\nI remember the first time I seen you moonwalk (Oh woah)\nI believed I could do anything (Oh, ooh)\nYou made the world dance\nYou made the music come to life (Woah, oh woah)\n\n[Chorus: Chris Brown, Diddy & Boyz II Men]\nThis the type of song that make the angels cry (Mike Jack)\nI look up in the sky and I wonder why? (Why?)\nWhy you had to go, go, I know it's better on the other side (You were the greatest)\nYou were chosen from the start (Chosen, oh), never gon' let you go (Oh, oh, oh, God chose you, will never forget you)\nIt's from my heart, woah-oh (The King, we miss you)\n\n[Verse 1: The Game]\nWho's Michael Jackson? You're Michael Jackson\nI'm Michael Jackson, we all Michael Jackson\nI guess what I'm askin' is, everybody bow their head for a legend, don't breathe for a second\nNow let the air out, grab the hand of somebody you care about\nSo you can hear my message, my confession, somebody tell Usher\nI seen the moonwalk, I guess the young thriller touched him\nLike he touched me, like he touched you\nSo carryin' his legacy, somethin' I must do\nAnd I trust you lightin' candles, concrete visuals\nMe and my brothers listen to Jackson 5 in the livin' room\nFirst thing I did when I heard, was call Puff\n'Cause him and Mike tried to stop the beef between us\nWho was us? Me and 50, that beef is dead\nHim and Mike Jackson gonna take us to the ledge\n\n[Chorus: Chris Brown & Boyz II Men]\nThis the type of song that make the angels cry\nI look up in the sky and I wonder why?\nWhy you had to go, go, I know it's better on the other side (Ooh yeah)\nYou were chosen from the start, never gon' let you go\nIt's from my heart, woah-oh (Oh, oh)\n\n[Verse 2: The Game]\nAs I'm pourin' out this liquor, candles start to flicker\nWhen list my Air Ones, MJ was my nigga\nNot the one that play ball, the one with the Hollywood star\nAnd since I'm a Hollywood star, I'ma tell you my story\nNever had a family that close\nNever see Berry Gordy walkin' through Interscope\nBut just like me, they always had Mike in a scope\nNo matter what you say, I'ma love him and he's still dope\nLet me take you back to '85 when I was in a zone\nDancin' for my mama, 'Thriller' jacket with all the zippers on\nNow i'm doin' 90, 'bout to crash in this Aston\nListenin' to Outkast, I'm sorry Ms. Jackson\nAnythin' I can ever do to better you\nYour son was our king so we won't Corretta you\nI'm writin' this letter to all the Jackson kids\nWe all Jackson kids, time to let us through\n\n[Chorus: Chris Brown & Boyz II Men]\nThis the type of song that make the angels cry (Oh woah)\nI look up in the sky and I wonder why?\nWhy you had to go, go, I know it's better on the other side (Ooh yeah)\nYou were chosen from the start, never gon' let you go  (Oh, oh)\nIt's from my heart, woah-oh\n\n[Interlude: Diddy & Boyz II Men]\nPeople could say what they wanna say about you (Oh)\nWe gon' remember the miracles that you showed us (Oh)\nThrough your music, through your dance (Oh woah)\nThrough your philanthropy\nYou were the one that made us all realize that we are the world\nYou were the one to show us we can moonwalk (Yeah)\nYou gave us the beat (Hey)\nGave us the rhythm (Hey-ey)\nGave us the soul (Oh)\nThrough us, your legacy lives on (Anything)\nYou can't stop now, we won't stop now (Anything, oh)\nMike Jackson\n\n[Chorus: Chris Brown, Boyz II Men & Diddy]\nThis the type of song that make the angels cry (Oh woah)\nI look up in the sky and I wonder why? (Why)\nWhy you had to go, go, I know it's better on the other side (Ooh yeah)\n(Why'd you have to go, Mike? Okay)\nYou were chosen from the start, never gon' let you go  (Oh, oh)\n(Wassup Chris?)\nIt's from my heart, woah-oh\n\n[Outro: Boys II Men]\nThis the kinda song that make the angels cry\nLook up in the sky and ask God, why, why, why\nDo we live and let die?\nThis the kinda song that make the angels cry\nLook up in the sky and ask God, why, why, why\nDo we live and let die?"}]}