{"songs": [{"title": "Can’t Slow My Roll", "lyrics": "[Intro]\nAll these motherfuckers keep on comin'up askin' me\nAyy, Young Buck is you still, you still with Juvenile, you still with UTP?\nMan you're motherfuckin' right nigga\nI'm just doin' my motherfuckin' thang right now nigga, holdin' it down\nJuvenile my motherfuckin' nigga, Skip my nigga, Wacko my nigga, UTP for life!\n\n[Verse 1]\nWatch out (Watch out) Here I come (Here I come)\nI hear 'em talkin' but he don't want none (want none)\nYou a bitch (You a bitch) I'm gettin' rich (gettin' rich)\nI have these [?] on my whole clique rich (clique rich)\n[?] big truck (big truck)\nCadillacs with the grills in the front (in the front)\nMotorbikes (Motorbikes) speedboats (speedboats)\nYeah I got it if your boys need coke (need coke)\nWho the boss? (who the boss) Point 'em out (Point 'em out)\nTell 'em Buck back bitch, I want 'em out (I want 'em out)\nI'm right here (I'm right here) nigga what?\nWe get boxers shoot Glocks,  I dont give a fuck (give a fuck)\nTatto (Tatto) Bullet wounds (Bullet wounds)\nTell Pac that I might see him soon (see him soon)\nKeep it gangsta (Keep it gangsta) I'm so cold (so cold)\nNow you now\nYa'll can't slow my roll\n\n[Chorus] x2\nI know you think you know me\nYou see the cars and iced out rollies\nOf the chain, the pen' can't hold me\nFuckin' with the OG\nYall can't slow my roll\n\n[Verse 2]\nWhy you mad? (Why you mad?) Stop hatin' (Stop hatin')\nGet money nigga, time ain't waitin' (ain't waitin')\nGhetto rich (Ghetto rich) Big brick (Big brick)\nEnough dope to get a whole world of it\nGet 'em up (Get 'em up) Let's go (Let's go)\nSpoil your drink in his face, he a hoe (he a hoe)\nBeen thuggin' (Been thuggin') He ain't know (He ain't know)\nI was at the [?] He ain't go (He ain't go)\nStop playin' (Stop playin') Shake 'em off (Shake 'em off)\nNever will, never have took a loss (took a loss)\nYou see the blunt (You see the blunt)\nYou see the clip (You see the clip)\nBet you never felt a hundred hollow tips (hollow tips)\nBlack suit (Black suit) Black boots (Black boots)\nBlue steel [?] .32 (.32)\nAnd where 'ye at? (where 'ye at?) They go (They go)\nNow you now\nYa'll can't slow my roll\n\n[Chorus] x2\nI know you think you know me\nYou see the cars and iced out rollies\nOf the chain, the pen' can't hold me\nFuckin' with the OG\nYall can't slow my roll\n\n[Verse 3]\nAk (Ak) Fo' five (.45)\n12 gauge with the shells on the side (on the side)\nFront page (front page) Next day (next day)\nMan found dead on the highway (highway)\nMy hood (my hood) My block (my block)\nRow boxing, shoot at the cops (at the cops)\nEat dough (Eat dough) All day (All day)\nQuiters callin' if I don't call back (call back)\nWhite smoke (white smoke) You a [?]\nSmash the gas and run red lights (red lights)\nCock it left (cock it left) Cock it right (cock it right)\nSpin him around and pack it, Aight? (Aight?)\nIt's a life (it's a life) Thank God (thank God)\nBakin' soda in pyrex jar\nKeep it gangsta (Keep it gangsta) I'm so cold (so cold)\nNow you now\nYa'll can't slow my roll\n\n[Chorus] x2\nI know you think you know me\nYou see the cars and iced out rollies\nOf the chain, the pen' can't hold me\nFuckin' with the OG\nYall can't slow my roll", "album": "Born To Be a Thug", "year": "2002-10-10", "image": "https://images.genius.com/4af87237eb08ec9a54e4982ff14ddb32.400x400x1.jpg"}], "artist": "Young Buck"}