{"artist": "Cam’ron", "songs": [{"title": "Get It In Ohio", "album": "Crime Pays", "year": "2009-03-31", "image": "https://images.genius.com/92496cfcc2e09bf599c5704239d3db57.1000x1000x1.jpg", "lyrics": "[Intro]\nWhat up, Midwest?\nThey forgot about the fourth coast\nIt ain't nothing though\nWhat up Arkansas, Minnesota, Kansas?\nKentucky, Missouri, everybody in the Lou'!\n\n[Verse 1]\nThinking bout Guy Fisher\nNever met him, but God damn, that's my nigga!\nI figure real estate invested pie flipper\nNever snitch, me, I'm in a bathrobe, fly slippers (I-80)\nLeft Chicago with good money for 5 drops\nWestside, did the Southside like the White Sox (What up Stony Island?)\nVan Buren, Pulaski, K-Town is contra (Westside)\nThey'll dearly depart ya, in front of MacArthur's (What up Madison?)\nI'm the author for gangsters, tough guys\nDid the whole Ohio, but I started off a Buckeye\nColumbus to 'Nati; them towns I raped 'em\nFew clowns was hatin', moved my pounds to Dayton\nAnd in Akron, my niggas they would throw things\nNot King James, these were coke kings\nAnd you acting grown, doggy you ain't back at home\nThe smack, it's on, wrapped in chrome\nYou better get a chaperone\n\n[Hook]\nIf you know like I know, you should lie low\nKilla, I used to get it in Ohio\nDon't forget the Chi though, guns are like a pyro\nYou keep playing, you will look like a gyro\n\n[Verse 2]\nGo 'head and hate me hater\nCause I'm flyer than a aviator?\nWell, you'll get smacked with the radiator\nAnd I get catered player. \"Wanna talk?\" \"Maybe later.\"\nTold her, her time was up, '88 her, Flavor-Flaved her\nNeed your neck choked; rather, your neck broke\nYou dead broke, yes folks, the jewels are like egg yolks\nAnd you'll get yoked up, switchblade-poked up\nBitch-made since 6th grade, he need his rope cut\nCowboy roped up, \"y'all boys sold what?\"\nKnow what? Dope, crack, and coke is in the coat tucked\nRoll up, hold up, family, this a hold up!\nGet close up, soaked up, I'm KG, post up\nHo, slut, no love, turn beef to cold cuts\nFamily getting bread, well he about to get his loaf cut\nY'all doped up, this game is sewed up\nMalcolm X: tell the white bitch, \"Yo, I want my toes sucked\"\n\n[Hook]\nIf you know like I know, you should lie low\nKilla, I used to get it in Ohio\nDon't forget the Chi though, guns are like a pyro\nYou keep playing, you will look like a gyro\n\n[Verse 3]\nI'd rather be judged by 12 than carried by 6\nMy 12 and 12 -- well, they carry my bricks\nAnd them 12-12 fiends, they're married to sniff\nAnd the V12, that's on various trips\nY'all make a brother laugh, me I took another path\nCome into my habitat, hovercrafts, bubble baths\nDuffle bags stuffed with cash, fell in love with math\nI got the green Benz, red Range, mustard Jag\nWhite coke, tan dope, black gun, trey deuce\nSilver bullets, purple piff, blue pills, Grey Goose\nPull out the rat-tat-tat\nDuck duck, say goose\nBeige coupe, suede roofs, send him up to Jesús (Jesus)\nH-deuce, yea yea, piss off the state troops\nSee me, then they don't, I disappear, say, \"poof\"\nPlay Zeus, homeboy, get a replaced tooth\nNot Pac, mean dust when a nigga say, \"juice\"\nKilla!"}]}