{"songs": [{"lyrics": "[Bill Maher]\nI very often think about you and the Beatles, not because the music sounds alike, but because they were real envelope-pushers, you know, they were always about what's next, telling the audience. They were not afraid to be ahead of their audience, and I feel like that's what you try to do. I mean, this album is a lot about arts, and things that kids not necessarily would be interested in.\n\n[Jay Z]\nThe the truth is, as far as hip-hop and the arts, we were like cousins, you know. If you think about those days with Fab Five Freddy was with Madonna and Basquiat and everything. You know, we all went to those clubs--that’s when hip hop was more underground. The arts and hip-hop really partied together, but when arts started becoming part of the gallery it was this separation. But we pretty much came up together.\n\n[Maher]\nYou have a song on your record called “Tom Ford.” I'm sure some people are thinking, why is he on some white, gay designer’s dick? What’s going on there?\n\n[Jay Z]\nPause.\n\nLet me clarify that: I am not...[Laughs]\n\n[Maher]\nI meant that metaphorically. But the line that I think says alot, you say, “I don’t pop molly, I rock Tom Ford.” You know, everybody else is talking about doing ecstasy, and you’re, “I don’t do that; I get shit done. I’m in business.”\n\n[Jay Z]\nMan, I’m just gonna take you around with me--\n\n[Maher]\nTo explain your shit?\n\n[Jay Z]\nYeah. Thank you. Thank you, sir.\n\n[Maher]\nIt could help you with Harry Belafonte. You had a feud. Show the picture. I mean, this is very bad what happened with the you and Harry because, I mean, look at look at this. He’s 86, and you’re 43? So he’s literally twice your age and it’s a draw.\n\nHe got on your case because he, I remember when they did this with Michael Jordan, you remember that, when they were saying to Michael Jordan: “You're the king of the negroes; get more involved, do more.” And, you know, that upset you, and I don't blame you for being upset.\n\n[Jay Z]\nYeah, I just didn’t think it was the correct venue. If it was something, really like a real problem, you know, I'm not a very difficult to find, especially for someone of that stature. He can reach out to me and we can have a conversation we’ll do some good together. But, you know, I just thought that it was a bit of grandstanding to me, and I didn’t appreciate especially dragging my wife into it was a bit of a low blow--\n\n[Maher]\nAnd Bruce Springsteen...\n\n[Jay Z]\nI really like Bruce Springsteen.\n\n[Maher]\nHarry was on our show once. He was iconic, as he is, and I don't know if you ever saw this clip, but I wanted to get it for you. This is from a 1968 television special he did with Petula Clark, and this was a giant controversy in 1968 because she touched him. Show the clip to show you what I'm talking about. This is what people we upset about.\n\nCan you imagine, that’s where the country was? That just that she had his arm...and you see the look in his eyes, it's like, “you know, you dumb English broad, you’re gonna get me lynched.\" I’m just putting it in perspective; that’s where he’s coming from.\n\nI feel like a lot of this record is about the love/hate relationship you have with fame, certainly that first track, the title track.\n\n[Jay Z]\n“Holy Grail,” it’s about acknowledging that you’re dancing with this drug, you know, and that people have lost their lives behind it, you know, this fame thing, and where to draw the line and how to maintain a sense of yourself within it. We look at all the people that came before us who are no longer here with us, you know, have been in this dance with fame. And it’s just me just really thinking out loud and vocalizing and hopefully dealing with it in some ways. It’s sorta like my therapy.\n\nIt’s kinda strange to have a conversation with like three people, like I'm ignoring y’all. I gotta make eye contact.\n\n[Maher]\nAnd they’re all gay, by the way.\n\n[Barney Frank]\nThink of us as your backup group in waiting.\n\n[Maher]\nWe’ll bring them in in a few minutes. You’re the first guest we’ve ever had who said that. Everyone else is like, “Fuck them.” They never even think about that.\n\nOkay, so I was doing a little math and based on when your first album came out, you will be eligible for the Rock and Roll Hall of Fame in seven years.\n\n[Jay Z]\nIs it based on your first album?\n\n[Maher]\nTwenty five years from your first album. So in seven years you will be eligible for the Rock and Roll Hall of Fame. I'm sure you'll be getting in first ballot unless there's some steroids--\n\n[Jay Z]\nI am not going!\n\n[Maher]\nYou’re not going?\n\n[Jay]\nNah, I’m just--\n\n[Maher]\nYou’ll be going. Who would you like to induct you?\n\n[Jay Z]\nUm, Obama.\n\n[Maher]\nWell...\n\n[Jay Z]\nI cheated.\n\n[Maher]\nLet’s say he’s busy...\n\n[Jay Z]\nIt’ll be all right. He owes me, he owes me a couple.\n\n[Maher]\nHe owes me a couple.\n\n[...]\n\n[Bill Maher]\nI noticed that one of the talking points from conservatives after the Trayvon Martin trial was, why are we talking about this one tragedy when hundreds of black kids are being shot in Chicago. But over the weekend the Congressional Black Caucus did a two-day summit there, and they talked about this very issue the conservatives say they're never talking about. It was covered by NPR, MSNBC, Chicago media, C-SPAN, not Fox News. It seems like Fox News doesn't want to allow this fact in that they are actually talk--\n\n[Josh Barro]\nIt’s total concern trolling.\n\n[Maher]\nWhat?\n\n[Barro]\nConcern trolling. It's, you know, saying, well you know shouldn't--don't worry about this thing, worry about this other thing, but you don't really care about the other thing you just wanna change the subject.\n\nAnd I think that the it's also bizarre to act like people don't care about violence in in inner cities or affecting black communities in the United States. I think it's a hugely important issue, especially in local politics where crime issues are actually dealt with. But it really it really is just an effort to change the subject.\n\n[Barney Frank]\nIt's also the case, and this goes back to our other argument, one of the things Republicans have been able to do is cut budgets, so there are a lot fewer police officers in every city in America. And social workers, and other people who might take a preventive kinda situation. And also, by the way, that’s why unemployment is too high; we've created on a private sector jobs, but the Republican priorities have cut over a million have public sector jobs, and that’s cops and others. So they’ve caused that kind of problem by denying the cities the resources that they could use to try to do with the problem.\n\n[Alexis Goldstein]\nBut I think over-policing is part of the problem. I mean, look at New York City and look at stop and frisk. I mean, policing in communities of color...I mean, I don't know, I can’t talk this better than you can, but I’m curious or your opinion, Jay Z--\n\n[Jay Z]\nI don’t really want to scare America, but the did the real problem is there's no middle class, right? So that the gap between have and have-nots is getting wider and wider.\n\n[Applause]\n\nLet me just finish this point because I do want to scare them a little bit: It's going to be a problem that no amount of police can solve, because, you know, once you have that sort of oppression, you know, and that gap is widening, it’s inevitable that something is going to happen.\n\n[Frank]\nI agree with that, but that does not mean you don't need police in the short term, and I completely disagree: Stop-and-Frisk is an abuse of people’s rights, but the African Americans I talk to, and that including those in Congress, don't want fewer police--they want better policing. But they want more policing. It’s like Bill said, “Oh, the ambulance came very quickly because you were in a white neighborhood; a sad joke with some truth to it. So denying them the resources is the problem, the notion that because some police have misbehaved you want fewer police. I don't know any significant percentage in the African-American community...\n\n[Jay Z]\nWell, more jobs would be better than police. We won’t need police...\n\n[Frank]\nYou need them both. I think, again, that’s a mistake. More jobs, those are going to help, but in the short term people want police stations. We are very unfair to people live in public housing. It was built badly, and they were put in there, but they deserve much more protection. The overwhelming majority of perfectly innocent, honest people--\n\n[Jay Z]\nThey deserve to get out of there. Public housing was a temporary stop, right?\n\nI grew up in Marcy Projects; public housing was a temporary stop until you got yourself together, you moved on.\n\n[Frank]\nBut even if you’re there for a couple years, you don’t want to be unpoliced. I'm all for that, low-income affordable rental housing was my number one goal--it's another thing that the Republicans, through the Tea Party, have absolutely cut off, unfortunately--\n\n[Goldstein]\nBut I don’t think Stop-and-Frisk is a few bad apples. That’s an institutionalized racism that the NYPD has been conducting for years. They stopped more young black men than there are young black men in New York last year. I don’t seem them stopping and frisking Wall Street bankers--they have tons of cocaine on them.\n\n[Jay Z]\nHahahahaha.\n\n[Frank]\nYou’re fighting a straw man. Of course Stop-and-Frisk, the way they’re doing it, is wrong, but answer is not fewer police. You hear people in the African-American community in New York complaining about Stop-and-Frisk, not get the cops outta here. They want the cops to be there and to be better behaved.\n\n[Barro]\nI think it's also important to remember: crime is still falling. We've had a massive improvement--\n\n[Maher]\nThe murder rate is at a hundred year low.\n\n[Barro]\nYeah, so I think you know inequality’s a big problem in a number of ways, but a lot of people were afraid when we went to the recession in 2008 that the progress we’d made on crime be reversed, and actually this is one social indicator that just keeps getting better.\n\n[Frank]\nAnd also black people are the primary victims of crime disproportionately, and that’s why they don’t want to see the police taken away. They want them improved but the answer is not to remove them.\n\n[Maher]\nIf the murder rate is at a hundred year low, why do we need to do so much stopping and frisking; why do we need drones with the police department; why we're building a wall in Mexico. It begs a lot of questions. Why are we such a police state now?\n\n[Frank]\nDon't punish every city in New York for Mike Bloomberg's tics. The fact is--\n\n[Goldstein]\nAnd Ray Kelly’s, let’s don’t forget about Ray Kelly.\n\n[Maher]\nObama wants him as the Homeland Security Czar.\n\n[Frank]\nIt is not true in the whole country that police departments are doing that. The Los Angeles police have gotten a lot better since the days of--\n\n[Maher]\nBut you’re from Massachusetts. We saw, when the Douchebag Brothers blew up the parade, somehow Boston had an army.\n\n[Barro]\nIt was really weird: they shut down the whole city for a day.\n\n[Maher]\nAnd they had half-tracks and what looked like tanks. It didn't look like a police department that I ever saw.\n\n[Goldstein]\nWe are an increasingly militarized society, and because these budgets are getting bigger and bigger, they need to justify those budgets. So sometimes you need to find crime--\n\n[Frank]\nLocal police budgets are not getting bigger; they're being shrunk. If you work at the local level, if you work with police chiefs, and the people want the services from the police. Yes, you got to make them better, but in Los Angeles--\n\n[Goldstein]\nBut we didn’t want the police at Occupy Wall Street, I’ll tell you that.\n\n[Frank]\nBut you were not victims of crime.\n\n[Goldstein]\nWe were victims of brutality. There’s 125-page report that's put together by NYU law professors, documenting all the First Amendment violations conducted by the NYPD.", "title": "Appearance on Real Time with Bill Maher", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}