{"songs": [{"year": "1994-06-28", "image": "https://images.genius.com/da485f2d908437a49ed62020b7d39795.800x800x1.jpg", "title": "On da 1", "album": "Somethin’ Serious", "lyrics": "[Intro: Big Mike]\nOne more for the road, baby, ha ha ha\nYeah, check this out\nWe’ve come to the end of this muthafucka\nIt’s another chapter closed\nYeah, check this out\nI’ma let my muthafuckin’ dawg roll this one off for y’all\nAy dog, check it out…\n\n[Verse 1: Big Mike]\nFive seconds for these niggas to get their ass in check\nI starts my counting then them muthafuckas starts to jet\nFive, four, three, and two, the one, niggas run\nBut some don’t run because they always after some\nBut what’s said is done so tell me, nigga, what the fuck you think you doin’?\nYou thinking I’m new to this shit but it’s enough of the niggas I always ruin\nForever down for mine and my mind says keep\nI’m ready to tweak for my shit so nigga please don’t sleep\nBecause the sleep get beat just like they stole somethin’\nAnd niggas better watch their back if they persist to frontin’\nFool, it ain’t nothin’ to break these muthafuckas off a chunk\nGet ready to jump ‘cause every time I’m up, I’m monster dump\nAnd you leave you laid, this game is played, nigga, with no rules\nI thought you knew, these niggas are true to all that we do\nReal in every way, what else can a nigga say?\nThis ain’t a muthafuckin’ game, nigga, so why play?\n\n[Chorus]\nOn the 1, is how we drop it\nHere it comes, you know you can’t stop it\n\n[Verse 2: Bun B]\nFool, this ain’t a game, ain’t a joke, ain’t a toy\nStressin’ nothin’ but pistol play, come back when you’re packin’, boy\nShit, is it on? Is they drippin’? I can’t tell yet\nThey mean muggin’, but not a word they yell yet\nThey best not point, ‘cause if they do, I’m finna smoke they ass\nLike a joint of indo, when I lean out the window\nWhere the fuck you been, hoe? Uh, do you know where the fuck you at?\nDo you know this P.A. nigga will open up your back?\nBullets be stingin’, I be swingin’ on thangs\nI hang with gangstas that be hustlin’—you ain’t down with all that?\nBeat your feet, busta—it’s going on in the South\nBe strapped for the riot if you got the nuts to try it\nOutta town niggas full of trickness\nSteppin’ up B.V. and catch a one way ticket to a click-fest\nWith nowhere to run, no gun, they didn’t understand that nigga Big Bun can\nDrop it on the 1\n\n[Chorus]\nOn the 1, is how we drop it\nHere it comes, you know you can’t stop it\n\n[Verse 3: Tré]\nIt’s Trizzé, here to keep your shit bumpin’\nNigga, drop your trunk in, pop this Gumbo Funk in\nWatch me keep your head boppin’ ‘round all night\nYou can hit your left switch but the bass gon’ knock your ‘draulics to the right\nTight is what I bring to your ass on wax\nI tax hoes and smack foes, react and attack those\nWho oppose me, you knows me not\nI hit bros like Tyson blows to the flows we got\nNow, who’s that muthafucka that dares to mad-dog a G?\nYou catch a hollow tip from the clip, nigga, for mad-doggin’ me\nAnd any nigga think I beef, get the fuck back, straighten nappy blue\nUp and down, fool, no red in me nutsack\nNow niggas to the left is asking me to hit the switches\nHoes to the right is asking to be one of my bitches\nWhat is this? Run up in like the rock gets slung\nI’m making ‘em bring it to your world and drop that shit on the 1\n\n[Chorus]\nOn the 1, is how we drop it\nHere it comes, you know you can’t stop it\nOn the 1, is how we drop it\nHere it comes, you know you can’t stop it"}], "artist": "Big Mike"}