{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Mixtape", "title": "Freestyle", "image": "https://images.genius.com/459c7b64c165fbc76e02360f338fe60b.600x600x1.jpg", "lyrics": "What up, thunn?\nHold it down, son\nYeah, check it\n\n[Verse one]\nYo\nAnthem of the big barrels, handlers of huge flamethrowers\nThe most foul, throw in your towel\nP-double, I'll blow a hole in your coupe bubble\nRaised like a soldier, camouflage post-up\nYou shook when we slam or throw our guns in the air\nStop the party like Trafalgar Square\nIt's homicide music, when P put his words to it\nStreet journalist, block war inquisitor\nWriter, for New York, novelist at gun talk\nChronicles of a young blood taught\nTo walk with his head up high\nEyes wide, wise guy, made man with Mob ties\nBolt-lock 9s, put one in a hole with no clip\nPocket full of bullets wilding, 16 handling shit\nThrough the dip, slip quick\nI heard sirens coming from afar and slid\nFrom the circumference, left a red splash then I dashed\nBack in my lab, heart pounding from running fast\nPut my half-assed gun back down in the stash\nTwin got a four-pound for sale I need that\n'Cause this no-clip shit could lead to my ass\nRefuse to fall on my ass from any men's wrath, dollar's math\nAnd thunn call me back real fast, yo\nI ain't got no cash but I gotta smash\nThis no-frilled nigga came past, riding on pegs\nBroke, nearly put one in his ribs\nI barely got away with my head\nLet me hold a fever on his strength\nProbably catch him on the bench\nThunn said: “Use your head; this is it\"\nBack outside, put my hoodie strings down tight\nScene of the Crime, do or die\nSeen Bobby, he cop me some coconut wine\nLook across the street, I seen a dude walk by\nHe reaching, the chrome of his gun caught my eye\nPush Bobby to the ground, move to the side\nHe pulled out, I pulled out at the same time\nIt felt like the end of Colors when we stopped and stared\nI threw a pop first, the shot burst, we both was scared\nHe let his fear overpower his mind to think clear\nThat type of shit end your career, now lookie here\nSquinted my lids, aimed for his face and missed\nBut I placed a few good in his back and wrist\nHe ran damned near crawling, I hit the house without stalling\nSweat pouring, trying to catch my breath falling\nCheck my body, to see if I caught one, or more some\nBum niggas wanna front for what? They lost one\nFelt down the side of my forearm was wet\nAww shit, take the pain and bleed\nEmergency'll call the D's\nGrab the Codeine and swallow half the bottle\nGet treatment out in Long Island, tomorrow\n\nDedicated to K.B. and Yambo, the Scarface Twin\nTo all my niggas that won’t think twice to sacrifice your precious life\nWord up! My nighttime niggas, during the sun’s hour, keep your head up\nNigga, what? Word up!\nMy true-to-life thunns\nYeah…", "year": null}]}