{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f1ce17fdad92806e2e9b19241838f42f.1000x1000x1.jpg", "title": "Go!", "year": null, "album": "R.A.P. Music", "lyrics": "[Verse 1: Killer Mike]\n\nYeah, still Killa Kill from the ville\nWith a flow so cold it'll froze your nose\nSomething like the blow did back in the 90's\nWhen I sold to the geeked out hoes\nMust be the reason my flow so dope\nNot dope meaning coke but dope meaning dope\nWhat's that Killa? Y'all niggas don't know? So\nSchool's in session, let's go\nDope shit get you 75 a brick that bullshit\nCoke just gets you 24\nLike my nigga told y'all niggas back in '96\nThe difference between a 4.0 and a 4.6\nAnd you're on my dick, pause\nGet up off the polo draws, y'all\nAin't seen a rapper this cold\n187 since above the law Ok?\nNigga with an attitude like Eazy\nRen, Dre and young O'Shea Ok?\nFuck that punk ass Glock he got on the block\nI'm gonna hit him with the K Ok?\nHave a nigga singing like Michel'Le\nHave a nigga missing like JJ Fad\nBeat a nigga dead like JJ dad\nDamn damn James! Why you make me mad?\nShit got damn, I go ham\nI go off, the gun go blam\nI go in, I go hard\nI go stupid oh my God\nShumalumadumalumashmalumaduma\nEven when I ain't saying shit\nGot AK word play might put a pause in you life\nJust like a comma bitch!\n\n[Scratches]\n\n[Verse 2: Killer Mike]\nLet everyone know that the bad guys back\nAnd he got a gun and he's dressed in black\nTerrorist flow and I'm ready to attack\nBombs over Baghdad yes Iraq and Iran and I am\nThe motherfucking man with the motherfucking plan\nSitting with the strap on my motherfucking lap\nI put the shit to your motherfucking naps\n38. snub to your Nap' ass dome\nI can get you straight like a pressing comb\nI go ape straight King Kong\nY'all monkey-ass-niggas better leave me alone\nI'm a gorilla so I get realer\nI spit hot fire retro Godzilla\nHomicide maniac brainiac\nSipping on a pint of 'yac\nIn a Cadillac\nI'm Killer killer killer killer killer killer\nI did\nThese many shows in these many days\nHad these many bricks got these many paid\nThat's 1,1,2 in these many ways\nIndeed I say the opposite of living in need\nI say is greed they say\nI say no way fuck get money\nStack your hundreds alright ok? Go!"}]}