{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro:]\nIt's the final round\n(There's only 2 days left) (x3)\nBroke, broke, broke\nCome on!\n\n[Verse 1:]\nBroke this down with amazing razor choppers known to chew the fat\nCadence's so dope they interrupt your flow, how rude is that?\nGive me my respect and give it here if I may interject\nI guess it's hard to Wrekonize without the intellect\n305, swimming with the shark fin\nBreaking down doors, stuffing whores till the margin\nAs innovative as Kendall Jenner, I beg your pardon?\nBut your festival was Fyre, who planned it? Billy McFarland?\nHa, y'all ain't really tryna get it where the wild things are\nI've been grinding hard since back before my spine evolved\nI'm Jon Taffer, to off rappers, I style their bars\nWhat were they thinking tryna charge for such a minor cause\nWorld's gone handheld in a hand basket\nHalfway to so damn ratchet\nThey give us no chill, just Mad Max'in\nIt's like this whole place is so fucking savage\nRetirees would fire 3 to get a buck on average\n\n[Hook:]\nSo welcome to the carnival\nWhere everybody is just starving to hop on your balls\nThis PC generation is so freaking hard to call\nI can't tell if I'm allowed to say anything at all\nSo please forward to my publicist if I say something to offend any one of you fucking pricks\nOr if my leaf-burning brothers take a couple rips\nTo shed some light on how real a person's hustle gets\n\n[Verse 2:]\nOkay, I'm tripping, stress got me saying silly shit\nMy album drops on Friday, must be depressive getting it\nThe numbers, the soundscans, the bar, I'm tryna triple it\nBut truthfully, all of that shit should be so insignificant\nI'ma bash it down like Cassius now, what a fascist clown is acting now\nLines are triple packing wow, don't hit that shit you'll have to drown\nIt's release week, further now they retreat\nAsking me for retweets, so I threw 'em back like Beat Street\nWe independent, Snake and Bat, yes I represent it\nBut jump around on stage too much to really rock my pendent\nAnd if I gave you my word, there's no question that I meant it\nInto The Further, I'm tryna murder my past percentage\nThat's how I'm styled, how I keep my thoughts so Future Vintage\nI'm motor-mouth murder menace, come get your groove diminished\nWhere were you going? I'm showing, never said I was finished\nI'm Morse Code from my soul down to my outer limits\nThere's no games in my name, there's never been a gimmick\nNo C, no G, just me and nothing but these leaking lyrics\nOn a ship that's sinking further by the freaking minute\nDoes anybody got a sailboat, I'm deep up in it\nSigning off for the season\nIt's been a blast but I got shows to rock with my legion\nSo I think it's about that time to\n\n[Hook:]\nWelcome you back to my carnival\nWhere everybody is just starving to hop on your balls\nThis PC generation is so freaking hard to call\nI can't tell if I'm allowed to say anything at all\nSo please forward to my publicist if I say something to offend any one of you fucking pricks\nOr if my leaf-burning brothers take a couple rips\nTo shed some light on how real a person's hustle gets\n\n[Outro:]\nAnd with this, we conclude\nInto The Further freestyle session\nI'd like to thank my brother Chip from the guild for these beautiful mixes\nStrange Music, ¡MAYDAY!\nWrek Wedesndays\nInto The Further\nThere's only 2 days left!", "title": "Lie, Cheat, Steal Freestyle", "year": "2017-05-03", "album": "#WrekWednesdays", "image": "https://images.genius.com/5e939e83953819d824cf199eca399d1a.500x500x1.jpg"}]}