{"songs": [{"lyrics": "[Intro: Jay-Z]\nHow can you fairly assess something from the outside looking in?\nThere's gotta be them times you'll be wrong, knahmean?\nHow can a muh'fucka go round and hate a nigga\nHe never even met that, he don't even know and shit?\nI think this rap shit is all beef\n\n[Verse 1: Jay-Z]\nY'all don't even know every day I'm living with stress\nGot up out the streets you think a nigga could rest\nCan't even enjoy myself at a party unless\nI'm on the dance floor, hot-ass vest\nYou think I'm freaking these chicks, right?\nI try not to brush against they chest\nYou get a lawsuit for shit like that, I feel trapped\nSwear to everything when I leave this earth\nIt's gon' be on both feet, never knees in the dirt\nYou could try me fucka but when I squeeze it hurts, fine\nWe'll lose two lives, yours and mines\nGimme any amount of time don't let Ms. Carter grieve\nAt the funeral parlor dripping tears on my sleeve\nTold the judge didn't budge it was him or me\nAnd I ain't trying to be hard but I'm guilty as charged\nPut my mercy on this court and my faith in God\nAnd pray hard none of my nephews wanna be stars, lucky me\n\n[Chorus: Karen Anderson]\nYou only know what you see\nYou don't understand what it takes to be me\n\n[Verse 2: Jay-Z]\nI hate all girls with ulterior motives\nThat's why I'm 20+ years old, no sons, no daughters\nHate putting my life in the hands of fake promoters\nHear the hate in my voice, right? I hate that you noticed\nNiggas wanna strip you to the bone for shit you own\nHate a nigga like that, faggot, get your own\nHate that I can't roam the street without the clip and chrome\nKnowing one day I'ma have to flip, c'mon\nYou know the shit don't stop 'til the Cris' don't pop\nAnd you have to kill a nigga and your wrist don't lock\nI'm trapped, the whole world's against me in fact\nBut ain't no turning back, bring it on\nHate the price of fame 'cause it cost too much\nCan I live without y'all niggas saying I floss too much?\nHate the way you make this hate flow all through us\nSteady looking for flaws through us, lucky me\n\n[Chorus: Karen Anderson (Jay-Z)]\nYou only know what you see\nYou don't understand what it takes to be me\nYou only know what you see\n(Since I was 4 years old\nI been told, everything that glitters ain't gold)\nYou only know what you see\nYou don't understand what it takes to be me\n(And now that I've arrived\nI see those truths unfold before my eyes in a world so cold)\n\n[Verse 3: Jay-Z]\nAnd niggas see you in the street, pretend to be friendly\nBut I know any type of success breeds envy\nI know in the back of your mind you're conjuring ways to hem me\nLeave my friends in a circle pouring out Henny\nBut G's is heaven bound so how I'm gon' receive\nAnything y'all pour to the ground next time throw it up\nAnd ain't nothing changed so even in my afterlife I show it up\nDon't grieve for me, my art remains\nLike a dart from the speaker to your heart\nSpiritually through the portal now my words is immortal\nDon't plan to leave without a fight, I plant a seed I give life\nThough I can't see past the girl's greed to call her wife\nNext time you're thinking heist better be precise\n'Cause I'm fully prepared, one of us is gon' leave here\nI have no regrets even though I won't see grow\nMy godson Boogie, Sonny and Remo, lucky me\n\n[Chorus: Karen Anderson (Jay-Z)]\nYou only know what you see\n(I been told, since I was 4 years old\nEverything that glitters ain't gold\nAnd now that I've arrived)\nYou don't understand what it takes to be me\n(I see those truths unfold before my eyes in a world so cold\nSince I was 4 years old)\nYou only know what you see\n(I been told, everything that glitters ain't gold\nAnd now that I've arrived)\nYou don't understand what it takes to be me\n(I see those truths unfold before my eyes in a world so cold)\nYou only know what you see\nYou don't understand what it takes to be me\nYou only know what you see\nYou don't understand what it takes to be me\nYou only know what you see\nYou don't understand what it takes to be me", "title": "Lucky Me", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg", "year": "1997-11-04", "album": "In My Lifetime, Vol. 1"}], "artist": "JAY-Z"}