{"songs": [{"year": "2009-11-10", "album": null, "image": "https://images.genius.com/e529062dd4f0bfb53bf91c48ec86f0a0.970x824x1.jpg", "title": "Beyonce", "lyrics": "[Intro]\nMan, Beyoncé, I'm mad at you\nMan...\n\n[Hook]\nThey say hello (ay).. Hello (ay)\nI can daydream about Beyonce all day\nThinkin' about the good times before she met Jay\nSee ya know\nThey say hello (ay).. Hello (ay)\nI really thought I had a chance to be your man\nUntil I seen the video with the ring on your hand\nIt hurt me so\n\n[Verse 1 - Kendrick]\nI remember you were 16 on the TV screen with Wyclef\nWere you my type? Oh God yes, I was impressed\nYou was like \"no no no,\" I was like 12 years old\nHoping that one day I could chaperone while you were on the road\nYou wore braids with a bangin body\nLook like you did pilates, a lot of sit-ups probably\nBut bump that, I was there from the start\nEven when Latoya Luckett and that other doo-doo bucket broke your heart\nHope you didn't cry cause honestly they were just so-so\nThey couldn't sing anyway, you deserve to go solo\nNo disrespect to Kelly and Michelle I'm just sayin' they cool\nBut you? You are somethin' like Wonder Woman\nAnd I just wanna hold your hand, bring you to Compton\nGonzales Park, we can build castles in the sand\nEatin hot cheetos with pickle juice in it\nPut that napkin down, you know I'll lick your fingers when you're finished\n\n[Hook]\nThey say hello (ay).. Hello (ay)\nI can daydream about Beyonce all day\nThinkin' about the good times before she met Jay\nSee ya know\nThey say hello (ay).. Hello (ay)\nI really thought I had a chance to be your man\nUntil I seen the video with the ring on your hand\nIt hurt me so\n\n[Verse 2]\nI just bought the Sasha Fierce CD\nGazed at the cover for a whole 5 minutes until my girlfriend hit me\nShe jealous of you cause I don't love her like I love you\nI even make her do the \"uh oh, uh oh\" just like you do\nShe tell me I'm obsessed, I tell her we connect\nLike Ice Cube way before the Mac 10 feud\nShe's like \"you goddamn fool, that girl's rich and you're broke\"\nI said \"So? I'm only 500 mill away, theres still hope!\"\nAnyway, I had feelings even way before you got paid\nAnd I didn't laugh when you busted your ass on the stage\nAnd I salute Kanye for takin' up for you\nI would've stole the award just to prove that I love you\nBut Jay should've did that I thought he had your biz-ack\nWhat happened, Mr. Izzo? Hopico? Fredrico?\nHe used to be my favorite until he abandoned my diva\nNow I tell everybody Nas had killed him on \"ether\"\n\n[Hook 2]\nThey say hello (ay).. Hello (ay)\nI can daydream about Beyonce all day\nThinkin' about the good times 'fore she met Jay\nSee ya know\nThey say hello (ay).. Hello (ay)\nHopefully I still have a chance\nMaybe if I sabotage your man\nYou never know, hmm...\n\n[Verse 3]\nI'mma sneak backstage at a Mary J Blige concert\nWith an \"I love Mary\" shirt, then find Jay-Z\nAnd push him into a dancer, hopefully they lock lips\nThat's when I yell out \"Sounwave! Hurry up take the pic!\"\nPut it on Bossip the same night, yeah, that sound quite right\nPublicity like that? Yep, they'd be sure to fight\nBetter yet, I'mma steal her cell, then call up Affion\nHe impersonates Jay well, get Beyonce on the line\nThen make up some bogus shit like \"You don't rub the back of my knees right\nSo this marriage is over with\nAnd the ring thats on my finger? Guess what? I'm throwin' it!\n[Cling]...you heard the sound so you know I did\"\nHaha that should get 'em\nThat should break em up like a Kit Kat when I do that, yeah, true that\nI'mma put the plan in motion, that's for sure\nBut if I end up with Macy Gray, this plan never work\n\n[Outro - Skit]\nYeeeea, man I hope Jay don’t be mad at me bout this song\nStart-ay, Wizzle start me back from like the first verse\nLike right before I come in\nHaha, what you say? Nah, you think it’ll be hot for real though?\nNigga, you stupid, they probably laughing as hard as you\nNigga got the best wife in the world and shit\nRun that back though?"}], "artist": "Kendrick Lamar"}