{"songs": [{"album": "Tha Hoodlum’s Testimony", "image": "https://images.genius.com/21f8328a60b871beb6d36b965d4ab80c.370x370x1.jpg", "year": null, "title": "Keep On Praisin’", "lyrics": "Chorus:\nKeep on praisin', liftin' up your name, to live in Christ, to die is gain\nRepeat\n\nVerse:\nGrowin' up in the cold world this industry's cloggin' up my brain, got\nMemories of when gospel rap wasn't about money or the fame. Remember when it\nUsed to be strictly ministry? Now it's all about who's at the top of the\nIndustry. Everyone is jealous, full of hate, greed, and envy, now-a-days, I\nDon't even know who my own friends be. Be critized, talked about and stabbed\nBehind my back and playa haters still tryin' to bag gospel rap. My heart goes\nOut to the streets, I'm to reach a thugs and that is why you be warmin' up the\nChurch seats. But you don't hear me though, turn and look the other way, but\nThat's OK, I know God would listen to what I gotta say. I can't lie though\nAt times I feel like givin' up when all this hurt n' pain inside me starts\nBuildin' up. I start cryin', but God shows me love, even if I never, ever win\nThe dove, Im'a keep on praisin'!\nChorus\nPick up my cross and Im'a follow you, even if my boys stay behind and I'm the\nOnly one in my crew. To be man enough to say, \"God here I am.\" But people\nAlways quick to judge, they don't understand. They talkin' about I ain't\nReal, but who are you to judge me? God be the only one who knows just what I\nFeel. So many rappers now-a-days, caught up in competition, that's why gospel\nRap be full of so much division. Believe me when I say, it breaks my heart to\nThink that we was once in unity, but now we're all but torn apart. It's not\nAbout how many records we've sold, it's all about how many save souls. Can\nYou feel me? Tears ran down my eyes yesterday as I heard about 2-Pac's death\nIs there anyone left to say, \"Lord, Im'a stand in the gap.\" My peoples, is\nYou with me, where you at, cause Im'a keep on praisin'!\nChorus\nAnd even though they critizize me, talk behind my back, and tell me hurtful\nWords. Till the day I'm dead, and in my grave, it's God I'm gonna' serve. So\nGo ahead and talk about me and spread your lies. You the one accountable for\nEvery tear when I cry. I shed so many tears for so many years, God can you\nHelp me? I'm tryin' to reach all my peers and if you don't hear, Im'a try\nHarder, even if I die from bulletshots like a martyr. This world be drivin'\nMe hysterical, God I need a miracle, devil keep tryin' to hit me when I wanna\nGet 'em spiritual, lyrically, I'm praisin' God with every word that I speak\nYou heard me, but I gotta turn the other cheek. 'Cause vengence ain't mine\nVengence belongs to the Lord. We gotta come together, one mind and one\nAccord. So to those who have ears, let 'em listen to what I'm sayin' but even\nWithout you Im'a keep on praisin'!\nChorus\nChorus"}], "artist": "T-Bone"}