{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/937899817bbca48d3fbf47a8d864ae81.807x807x1.jpg", "title": "I Don’t", "lyrics": "[Intro: K Camp]\nYeaah Turn Up Hoe\nK Camp\nI don't give a damn\nAbout what a nigga got to say about me\nI ain't got two shits for y'all niggas swear to\nGod\n\n[Hook: K Camp]\nI ain't got to prove shit to y'all niggas\nI ain't got to prove shit to y'all niggas uh uh\nI don't!\nI ain't got to prove shit to y'all niggas\nI ain't got to prove shit to y'all niggas uh uh\nI don't!\nI ain't got to prove shit to y'all niggas\nI ain't got to prove shit to y'all niggas uh uh\nI don't!\nI ain't got to prove shit to y'all niggas\nI ain't got to prove shit to y'all niggas uh uh\nI don't!  What's up?\nI don't! Yeah, turn up hoe\nI don't!  Yeah!  Wooh!\nI don't! Ha/Look\n\n[Verse 1: K Camp]\nListen up I'm the same young nigga\nFrom the Northside high day shit boy I got to get\nPaid  Hop on the track flow\nLike jumping gym boy you know I got too much\nFlavors  Hit her from the back\nGot the headboard rocking I'm a throw 'til I wake up the\nNeighbors (Wake up!)  Way these niggas keep\nWatching my moves telling you don't even need a\nCase ([?])  Twenty-four/seven on my\nClock clock amen I don't even get no\nSleep  Money keep piling\n20k  Hit a [?] bought boy that was just last\nWeek (You lyin')  I don't understand why you\nStill broke boy I been counting that money in my\nSleep! (In my sleep!)  [?] chick that\nLike [?] cute face, fat ass with the\n[?] (Wooh!)  You don't work harder than\nMe, I been at it for years, young nigga I'm\nTired (Wooh!)  But, I continue to\nDrop all this work, you ain't on your job, you get\nFired (Wooh!)  I could care less what a\nLane say about me lil' bitch keep\nQuiet! (Quiet!)  Treat your lil' hoe like\nPotato salad you should know that bitch stay on the\nSide!\n\n[Hook: K Camp]\n\n[Verse 2: K Camp]\nAny place, any time, anywhere, I'm a\nGet a demo where boy you not stay trippy there, but\nWhere?  That nigga flexing that\nLil' bitty trap you can tell that he new to that\n(You can tell!) [?] putting that\nGas in the earth every night where you put it at?\nNow I swear to God\nEverybody fucking trap when they really ain't no [?] in that\nYeah, I'm that nigga, I'm that nigga\nI'm that nigga, I'm that nigga that they seek\nI grind everyday, everyday\nEveryday, everyday, got my drink coming (Drink coming)\nEven with no eyes, with no eyes, with no eyes\nWith no eyes, I can see money! (See money!)\nFlow sick, down\nToo sick, down, ah choo got my nose running!\n(Uh!)  Most of 'em said I wouldn't\nMake it, but nigga it looks like I'm making it\n(Looks like I'm making it)  I got the game in my\nPalms, if you don't mind I'm taking it\n(If you don't mind)  I been this real from the start\nI really don't know how to fake this shit (Wooh, wooh!)\nHolla my niggas some slum no we don't mind we taking it\n\n[Hook]"}], "artist": "K CAMP"}