{"artist": "C-Rayz Walz", "songs": [{"title": "’86", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nHip hop\n\n[Hook: C-Rayz Walz and (Sample from [?])] (x2)\n(\"'Bout to tear it up) '86, '86, '86\n\n[Verse 1: C-Rayz Walz]\nYo, yo, want C-notes and deep throats\nI'm from the era of sheep coats\nManila envelopes and weed smoke\nBlock parties in 22.  Graffiti artists like Tru\nTwo and Jewel—just to name a few for you\nNow or Laters and son dudes.  You hear, son?\nFair ones—before niggas learned gun fu\nYeah, Run D.M.C.s were original\nNow we got pretty thugs and soft criminals\nI remember hip hop not dominated by visual\nYour rap was critical or the crowd got rid of you (Boooo!)\nNow it's pseudo-pitiful.  Plus punks be 'fessin\nSelling records, talk about what they dressed in\nI'm saying that's a part of it (What?) but not the start of it\nThe livest show used to be in your apartment, kid\nHip hop!  Started out in the dark\nNow it's mainly focused to where the fly cars is parked\nBut it's still in my, still in my heart\n\n[Hook: C-Rayz Walz and (Sample from [?])]\n'86, '86, '86\n(\"'Bout to tear it up) '86, '86, '86\n(\"'Bout to tear it up)\n\n[Verse 2: C-Rayz Walz]\nBizzy B told y'all.  Now I'mma Kurtis Blow y'all out the art\nSo fresh, you jet from perfected darts\nMic projection sharp.  Your heart pump Kool-Aid\nYou whack.  What?!?  Bring the noise!  I got crazy backup\nPow-Wow was my neighbor, Rasheen had flavor\nI was pumping Sugarhill on my sister's record player\nWindow wide-open.  \"The Message\" was blasting\nUTFO was next, then Inspector Gadget\nHad to be near bastards to see mean shots\nNever was a killer—couldn't make it to my 13 box\n5 cent refund brung change for video games\nNow I see the youth—the scenario changed\nIt used to be the truth—only rappers had big change\nWe argued \"Who was nicer?  Rakim, KRS, or Kane?\"\nI'm having \"Nightmares.\"  I had to speak to Dana Dane\nTold him I remember the days and how they make me wanna say\nWanna say, wanna say\n\n[Hook: C-Rayz Walz and (Sample from [?])]\n'86, '86, '86\n(\"'Bout to tear it up) '86, '86, '86\n(\"'Bout to tear it up)\n\n[Verse 3: C-Rayz Walz]\nI was body popping, rocking, shocking, plotting to splash in class\nGirls said I looked like Lakim Shabazz\nMy homegirl Roxy was Manhattan's daughter\nSo slick, she bought a bag of chips with a Latin Quarter\nWord to Big Bird (Heard?) and the Izod gator\nLet's take it Back to the Future without the flux capacitators\nNo backsees, no penny tax for clones\nOn my tracks, I would die over Spit like Ramon\nYou wack and get no dap for your rap\nShot through the bottom of your feet—now that's my soul clap\nSo go gold or go plat', but don't go back\nUnless you down by law cause you might get slapped and jacked\nSmash your turntables with a hammer (One, two)\nNow.  How's that for breakbeats?  Knowledge my grammar\nAt the rally with my Ballies when it's time to show and prove\nOn some old school shit like make me, make me move\nWhat?"}]}