{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/b294ecc265a79f3e4ef86c41b208e8e4.500x500x1.jpg", "title": "Bang", "year": "2008-07-08", "album": "I Pledge Allegiance to the Grind II", "lyrics": "[Verse 1: Killer Mike]\nYeah, motherfucker I'm back from the dead\nDriving like a bat out of hell in a red\nCaprice classic, I spit acid\nI don't rap ringtones, I flow classics\nI am dirty south hip-hop, what's happening?\nTrue shit talking, you ain't into battling\nYou know I let the gun go like a gatling\nFavorite fucking rappers I am embarrassing\nGod in the building, nigga, ain't no comparison\nI don't need swagger, I'm just arrogant\nMartin Luther King Drive made me this way\nAnd I've been real G before Atlanta went gay\nI'm down by law, what more can I say?\nGot a new AK, a new Chevorlet\nNow which fuck boy on the block wanna play?\nI'm the best fucking rapper you will find in the A\n\n[Hook]\nGrind Time Rap Gang, they're those guys\nThe truth and the whole truth, they don't lie\nThey just do (do), do (do), they don't try\nAnd if anybody had a problem, they gonna ride\nLike bang, bang, bang, bang, bang bang\nBang, bang, bang, bang, bang bang\n\n[Verse 2: Killer Mike]\nSidekicks hate, they don't wanna see me conquer\nFired my boss, I don't need no sponsor\nTruck jewelry got me looking tough like Tonka\nRobber try to touch, lose his arm like in Rwanda\nIn the concrete jungle, you prey or a hunter\nWhen you kill a nigga, they say his soul haunts ya\nI'd rather sleep with a ghost than sleep with the fish\nBe judged by twelve, than carried by six\nRapper, walk like a man, and ride a nigga dick\nForty-five got the king size jeans on sag\nDon't make me put another skull & cross on the flag\nGrind Time Rap Gang rep that flag\nBang bang bang, the mack on your ass\nCharging with the hemi going vroom vroom fast\nHead full of smoke every packet got cash\nNo love for the haters you can kiss my ass\n\n[Hook]\n\n[Verse 3: Killer Mike]\nLeader of the Grind Time get money Rap Gang\nDope-ass flows, lyrically, I'm cocaine\nDope dick for the bitches, dope lyrics for the dope mang\nKing Kong is the beast man, no cage, no chain\nTop of the world, white girl in my left hand\nSome monkey-ass niggas better hear me, clearly\nAny mother fucker ain't rappin' payin' dearly\nI'm talking weekly, monthly, yearly\nUntil you punk motherfuckers learn to fear me\nI'm on some G shit; I've got a G card\nI hit a nigga head, leave his ass a retard\nI have his momma saying \"No, take me lord!\"\nPreacher in the pulpit, the choir sings\nAnd on the first row a momma cries and leans\nThe young fella had to die, it's a goddamn shame\nBut it's Grind Time Rap Gang, bang bang bang\n\n[Hook]"}]}