{"songs": [{"album": "Urban Legend", "image": "https://images.genius.com/639bf5b825c66e0f59d87574014bc4cf.600x600x1.jpg", "year": "2004-11-30", "title": "Freak Though", "lyrics": "[T.I.] Hey! Hey! Hey!\n\n[Hook - Pharrell Williams] w/ T.I. ad-libs\n(But she's a freak though)\nShe got angel eyes, wit the baby face\n(But she's a freak though)\nI want my momma and daddy to meet her\nMaybe have my name\n(But she's a freak though)\nThey keep talking about you\nBecause they - can't keep up with your pace\nYou're my - super freak! super freak!\nYou're my - super freak!\n\n[Verse - T.I.]\nMy momma taught me, everything fine ain't the finest\nAnd everything that shine ain't a diamond\nThey say that change come wit time and I'm finding\nThat most bitches take your kindness for blindness\nYeah it feel good laying her beside you\nDiggin deep, ol' nine up beside you\nBut we can't kick out in public, gotta hide you\nCause all my partnaz in the hood done tried you\nIt's true that you can't turn a ho into a house wife\nWell listen shorty maybe I don't want a house wife\nThey say that you a freak I'm thinking that they bout right\nBecause that pussy's so good and your mouth tight\nA pretty face, slim waist, and her stout nice\nJuicy ass that them niggas in the south like\nShe super sexy, got a nigga thinking bout a wife\nWearing all white, being wit her for life\n\n[Hook]\n\n[Verse - T.I.]\nThe main thing making niggas judge you\nIs the same thing that make me wanna love you\nFrom the smell of ya hair, I wanna hug you\nTo the way you yell \"give it to me\" when I fuck you\nPlus you ain't tripping off a nigga cause he thuggin\nThat's why I'm twice as happy as relationships that wasn't\nBut my partna say you trickin wit his cousin\nBut nevermind, I don't listen they be buggin\nThey find it hard to understand how could T.I.P. love\nThis girl, when her man is out at strip clubs\nMaybe cause T.I.P. girls leaving wit girls\nAnd in the morning they'll be waking up with six girls\nThey don't know we more like homies when we pick girls\nWhy you worried bout it, he ain't gotta make you his girl\nFuck what he think about you, I think you the shit girl\nMake me wanna bring another kid in the world\n\n[Hook]\n\n[Verse - T.I.]\nNow I been told every nigga in the streets know\nShe ain't nothing but a freak ho\nBut when I look in her pretty eyes, I don't see it though\nNow she done showed me some shit that I ain't seen before\nBut what we do behind closed doors is for me to know\nAll in all I've decided I'm a keep her though\nI'm a fucking grown man, what I'm creeping for?\nJust try me by the four, that's what I'm toting heaters for\nI'd die by that for her a real good reason though\nThat's how I feel, let my partnaz and my momma know\nKeep it real, all the disrespect has got to go\nI disrespect, she is selfish, she don't hide it\nThough she may have been a tad misguided\nAll she need is a little affection, a lot of direction\nA nigga wit a constant erection\nAnd I done wasted plenty time contemplating second guessing\nProcrastinating, I wanna buy a ring and pop the question\n\n[Hook]"}], "artist": "T.I."}