{"artist": "Fat Joe", "songs": [{"year": "1993-07-27", "album": "Represent", "image": "https://images.genius.com/74218f34fc7a7f477441922b9caced21.1000x1000x1.jpg", "lyrics": "Aiyyo Fat Joe, it's your first album right?\nYou comin out the South Bronx\nTime to let brothers know what time it is\n\nT.S. in the house, yo T.S. in the house\n\n[Fat Joe]\nYeahhhhhh.. like this!\nChilly Dee (represent, and uh)\nGizmo (represent, and uh)\nKeith Keith (represent, and uh)\nKing Sun (represent, and uh)\nFat Joe (represent, and uh)\nUptown (represent, and uh)\nUptown (represent, and uh)\nUptowwwwwwwwwwwwwwwn!\n\n[Gizmo]\nI'm from the West Bubblefuck so fasten your seatbelts and buckle up\nI'm the type of brother to beat you down then fuck you up\nGrabbin the mic to rock on tonight to see if the crowd will care\nStep to the Gizzy you dare, you get lit up like a flare\nFrom the, Bronx the Boogie Down battleground, Uptown\nTurn smiles to frowns as I smack clowns around\nShorts I don't take em, bones I fracture and break\nSo make not one mistake, or you get eat like steaks at Frank's G\nJack in June, gettin swept, with a broom soon\nTo meet your doom, mornin night or the afternoon\nHarassin the mic, with a verbal assault of rap\nStick lyrics back to back, that'll pack, to keep myself on wax\nHot like an iron, to defeat the kids you gotta keep tryin\nIf you spread any rumors sayin you took me out, you're lyin\nA human beat is struck I know when it really sounds trunk\nI'm never ever buck I don't give a fuck if you think that I'm a sucker\nParties that I've made, people wonder how long it lasted\nLyrics that are so hardcore, it'll leave you flabbergasted\nGasp for air, inhale it hold it in\nAnd just wait for the rest of the posse to begin\nI'm the human beat magician with the bag full of fun\nAmmunition's the addition to the sawed offfff!\n\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n(Keith Keith!) Another wild nigga from the Bronx!\n\n[Keith Keith]\nRun for help when the mic's in my hand\nI kick rhymes like I'm a rap Van Damme\nAnd eat MC's like a cake or a slice of pie\nI'm not a pimp but I bop like I'm Superfly\nPeople say who's he? I'll give any crew beef\nSo act like you know or get ate-n like stew, chief\nI hold my own yet don't stand alone, I'm well known\nGo 'head and front and get smocked like a neckbone\nThink you better chill troop, cause I'm not havin that\nAnd flippin on niggas like a somersaultin acrobat\nGo get your crew and y'all still couldn't do the man\nI'm blowin up in ninety-three like an ash can\nI know niggas sip this, bitches wanna dip this\nI snatch your girl up, and molest her like a rapist\nHuh, go 'head and look real hard like I'm a sucka\nI'll beat that ass like the L.A. trucker fucka\nSo step up and let me hear your response\nYeah, yo, another wild nigga from the Bronx\n\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n(King Sun!) Another wild nigga from the Bronx!\n\n[King Sun]\nMr. Fifty-Two pick-up, nobody move\nIt's a stick-up, which proves, my getaway is butter smooth\nI'm not the Smooth Operator with the ladies\nBut I get kinda crazy if you let me pick the daisies\nOne thing never say run, King Sun\nI never ran, cause in my hand, I keeps a gun\nRepresentin where I'm from in a bumrush\nRoll up, flip, then be out on the hush-hush\nDon't touch or feel, it's real, showin mad skills\nHotter than heat, yet colder than the Catskills\nDon't play the yard, fake Gods ain't got nuttin for me\nI'm loungin with Tone and Corey\nOn one-six-oh, then I go and check Fat Joe\nOn Trinity, the South Bronx vicinity\nSmokin up your favorite MC like a dread smoke skunk\nCause I'm another wild nigga from the Bronx\nHittin em up, settin em up, splittin em up, gettin em up\nRippin em up, trippin em up, bag em! Zippin em up\nMakin them shout, playin them out, son ain't the one\nThe bigga the nigga to bust em with the sawed off shotgun\n\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n(Fat Joe!) Another wild nigga from the Bronx!\n\n[Fat Joe]\nAww shit, what we have here\nNinety-three and it's a brand new year\nMy name is Fat Joe I got shit locked down\nRunnin with the Latins and the blacks from Uptown\nIt's a damn shame, you better maintain\nI'm causin hysteria blowin niggas out the frame\nYes I can-can, I'm the Fat Man\nNever run, never ran, it's not in the plan\nI got skills you best chills, get off the dillsnilz\nYour rhymes are trash and no frills\nCarbon copy you're sloppy, see Joe ain't the one\nI'm beatin bootleggers down with King Sun\nRollin over niggas like a truck\nI come from the Bronx, a.k.a., West Bubblefuck\nMy rhymes are homicidal, I take your title\nI'm Joe Da Fat Gangsta, far from Billy Idol\nI get you open on the freestyle tip\nNow are you hip to the way I flip the script? Hah\nI'm Puerto Rican, I'll leave you dead and stinkin\nI pimp in my beamer, do my drivebys in a Lincoln\nHip-Hop was born Uptown, the Boogie Down\nIf you bring your whole crew I shut 'em down!\nI'm known from state to state, for shootin down punks\nI'm another wild nigga from the Bronx\n\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx!\n\"Sawed off shotgun, hand on the pump\" -] Cypress Hill\n[All] Another wild nigga from the Bronx! *fades*", "title": "Another Wild Nigga From the Bronx"}]}