{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Jerk", "lyrics": "[50 Cent]\nNext and 50\n(Uh-huh)\nNext and 50\nNext and 50\nNext and 50\n\nYo, yo my imagination is more vivid than life\nPlayboy November issue page three was my wife\nI ain't never had a problem with going for dough\nI did a Jordan in the box I grew it myself\nI go up and down like a merry go round\nVisions of some...splash\nI touch on myself when ain't no shorties to touch me\nAfter this joint half the hood gon' want to fuck me\n\n[R.L.]\nI can imagine you're here\nIn your Vicky panties and brassier yeah\nIt's like your sexy moans I hear\nGot a player gettin' wet down there, I swear\nI close my eyes and when you appear\nMe on top you on top even from the rear yeah\nCall in sick to work\nCan't get worse, damn I'm a jerk\n\n1 - [Next]\nI'm all alone and I'm trippin' my girl\nI keep on missin\nGot me fiendin' for the kitten\nI call but she don't listen\nI make the decision to handle my own business\nBack and forth with the rhythm\nTill I make the jizm\nI'm a jerk\n\n[R.L.]\nI e-mailed you, tried the cell too\nTried to contact you\nBut I failed too\nPants swelled too\nWhat should I do?\nTouch myself?\nWhen I thought about you\n\n[50 Cent]\nYo, yo at the end of the road\nHome sick than being sick of home\nI'd rather have a short to help me\nThen do it on my own\nCheck me out I'd rather beat my own dick than trick\nThat's a quote from BIG I take it back ya dig?\nI play the block to get my work off\nD's come I murk off\nDo a bid for rape fuck that I'd rather jerk off\nListen time's money so I'm only into quickies\nI'm not a pretty boy so I ain't never been picky\nI make it real easy for you to bop to this\nMan I pop the Cris and I rock the wrist\nNew CL 500 I'mma cop this shit\nIt only come hard top so I'mma chop this shit\nBallers they don't chase chicks they chase chips\nChampagne you take sips they guzzle the shit\nOnly a selected few can rock to this\nKaygee, 50 Cent, Next, ya stoppin' this?\n\nRepeat 1 (2x)\n\nLoving me like me\nEspecially when wife be acting funny\nCause it don't need for no money\nAnd it can be so lovely\nTake your hand and aim to please\nDon't drip a drip on your Dungarees\nTake a towel and cover your jeans\nMove it back and forth till you see babies\n\nRepeat 1 (2x)\n\nI'm a jerk, if your a jerk\nHow do it work?\nShow me how you move it back and forth now baby\nFor the guys and the girls\nMove it all around now work, oh yeah", "year": null}]}