{"songs": [{"title": "Microphone Pon Cok", "album": "Necessary Roughness", "year": "1997-01-01", "image": "https://images.genius.com/cdc63b6a1b535ab7f43f1efedace5772.600x600x1.jpg", "lyrics": "Microphone pon cok\nKeep it lock\n\nAll the niggas know the steelo\nRock on the regular\nOn the flow, yo\n\n\"The pon cok lyricist\" - Redman 'It's Like That (My Big Brother)'\n\n[Verse One: Madd 1]\nIt be the dawning of a new era\nCheck the terror of clever, style\nShot in in any type of weather\nHail, sleet or hurricanes, monsoon rains when I rule\nFools even if they pack tools they can't loosen my screws\nMy style's crisper [?] in the whisper down below\nFilthy steelo, not the bullshit with the glitter\nI glimmer like a nova, roll over\nHorizons in a Range Rover\nYou can't survive even with luck from a clover\nFour leafs\nI prefer the seven leafs of Budapest cess\nThe potent strain like Dristan mist that eat your brains\nI got more flavors than ingredients in delis\nMaking all these niggas jeally cause I'm strong to the max\nIn fact\nI can wait for 50 years 'fore I bust\nAnd then erupt and crush MC's without no ring rust\nHa\nBe getting stupid when I rock\nMicrophone's pon cok\nKeep it locked\n\n[Hook]\nMicrophone pon cok\nKeep it lock\nFrom the corner to the crevices, straight 'round the block\nLike a locksmith me lock it down lock\nEverything cut down and everything stop\nFrom the god everything must flock\nComing from the mic hand every place run hot\nDon't play [?] and stop\nX amount of [?] strictly hip hop\n\n[Verse Two: The Lady Of Rage]\nExcusez moi baby boy\nI'm hitting harder than your left jaw can withstand\nSo withdraw, I\nLikes it rough, rugged and raw (and what)\nA microphone fiend, super supreme\nA fool I pity like my girl Nikk B I let off steam when I'm\nWrecking shit, I'm a force to be reckoned with\nCausing definite dysfunctions\nYou couldn't connect to my shit with conjunctions\nGet eaten like luncheon meat, capiche?\nNot one can compete, roll with the elite squad and we roll deep\nRock from Alpha to Omega\nLay your cards on the table get verbally disabled\nYou best, pick up a thesaurus\nYour shit is bull like Taurus\nThis ain't your Day so don't try to play Morris\nI bust back with lyrics that break bones like bats\nCrack my knuckles, get touched by the untouchable\nI be one of the baddest\nPut up your Dukes cause I'm a Hazard\nYou're gonna need a miracle like Jesus of Nazareth\nTo save your from disastrous\nRepercussions cause we be bustin'\nDogg Pound much too much and\nThem niggas still don't give a fuck so\nHa, duck down, ha\nRappers are in danger\nYou don't want to feel the wrath of Rage there's too much anger\nI'll rearrange ya whole train of thinking\nWhat was ya thinking?\nMy loose lips got your ships sinking\nYa dead and stinking\nYa did, ya done\nLyrical murderer remain number one and that's how it is son\n\n[Hook]\n\n[Verse Three: The Lady Of Rage]\nThe microphone pon cok, lock and key\nSmack dab in the middle of my pocket baby you don't wanna lock with me\nCause I'm not to be fucked with\nYou can't touch this\nThe French I speak will spread you out like mustard\nI'm luscious\nThe dutch is extra large like deluxe is\nYo bust this\nYou don't wanna clutched within my clutches\nIt'll be a rainy night in Augustus\nGeorgia on your mind?\nNah, slaughtering these rhymes\nAt any given moment at any given time\nIf anyone think that I'm lying\nShow your stuff\nWhere ya want it?\nHead or gut?\nI'm thinking I've had about enough\nI think you done ran straight outta luck\nFor you chicken heads talking that chicken head cluck\nYa stuck\nAbout to get plucked, so what?\nI'll take you at uh, 20,000 degrees or\nAt 20,000 leagues under the sea\nYou try to play big fish I play you like bumble bee\nTuna\nYou couldn't blow up the spot better than this if you were the una-\nBomber, I got that shit fatter than your mama\nThe drama\nRaging and my nine\nTake Ini or any\nCome mosey on over my way baby I got goods and I got plenty\nIf any, step they'll get flipped like pennies\nHeads or tails\nCall it in the air\nGet blinded by the diamond puff glare\nYou're stuck in a stare\nI double dare all these hot shot that think they too hot to trot\nYou ain't got the Motts\nYour shit stinks like Fox\nTurn it up a notch\nWho's hot? You not\nDo stop\nYou just got dropped\nBy the one who's got it locked\nMicrophone pon cok\n\n[Hook]\nMicrophone pon cok\nKeep it lock\n\n\"The pon cok lyricist\""}], "artist": "The Lady of Rage"}