{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/4fd44ab3b93f85d2dd3a6c82f4bc29a3.479x479x1.jpg", "title": "Beautiful Naked Psychedelic Gherkin Exploding Tomato Sauce All Over Your Face, Flame-Grilled Painting", "year": null, "album": "19", "lyrics": "[Intro - Kool A.D.]\nBieber, Bieber, Bieber, Bieber\n\n[Hook - Kool A.D.]\n(Uggin) I'm Dave Bowie, (uggin) I'm Dave Byrne\n(Uggin) I'm Dave Foster Wallace, (uggin) wait your turn\n(Uggin) I'm Dave Thomas, square burgers\n(Uggin) I'm Super Dave, Burger King, king of burgers\n\n[Verse 1 - Kool A.D.]\n(Uggin) I'm Hunter Thompson, HT\nHunter's Point? (Ugginuggin) HP!\nYou could hate me now\nYou could Drake me later\nYou could cake me, hater\nYou could sidididididididudick my didick\nLittle midgets can look at my middle digit\n(Uggin) I'm Brian Wilson, I'm a Beach Boy\nI'm a lime to a lemon, you a peach, boy\nI'm a Beach Boy, Good Vibrations\nGood god god damn soul vibrations\nStain a white tee, like a non-racist\nBitch I'm Mickey Rourke, whole lotta dancers\nBobby Seale cookbook, Facebook, look book, fake crook shook\nBut the real ones think it's kinda funny though\nOnly funny with the money though, go funny, go go stupid\n(Go go go) Go dummy, go bunny hop, do a ollie (do a ollie)\nSomebody stop me, Jim Carrey, I'm the Superbowl\nI don't even watch TV, I'm the Superbowl\nElian Gonzales at the club with a super ho\nShe go super low, ya'll so stupid though\n\n[Hook - Kool A.D.] X2\n\n[Verse 2 - Haji Springer]\nThe king of burgers, Springer murders any motherfucking song he gets on\nBBS is on, watching ESP-On\nBad bitches in the back, lesbians, yes they are\nForget the bar, we can do it in the back of my motherfucking brand new car\nCause I'm balling like Dave Thomas\nYeah they, yeah they know my name like Dave Thomas\nYeah you know I already paid homage\nThey love me in the motherfucking Bay, doggie\nAll the way to Bollywood, yeah they know my name\nMr. Springer, bitch I ain't changed\nI'm in the Range, bumping Das Racist\nKool A.D., yeah you know we making\nA lot of cake, yeah they on our line\nBitches tryna holla cause they know we wine and dine\nTaco Bell, Pizza Hut\nThat's all I got for a skeezer slut\n\n[Hook - Kool A.D.]\n\n[Verse 3 - Bill Ding]\nGot a lot of buddies, think I'm Dave Schwimmer\nMy friends got ends, I'm a real hitter\nBig Dipper, five star\nSix star, sick car\nPull up in the Audi with the system going\nXanny bar got me John Doe-ing\nSpending money on a blonde ho (loco!)\nBut ya'll don't even know me like I'm John Doe\nBut just know, I handle my business\nSitting in the courtroom why no one wanna witness\nBullshitting, they talking five years\nThey all looking at me funny like I got five ears\nNo tears, J and J\nLow key, I'm finna put your ho on layaway\nBad thoughts as I lay awake\nWhen the cops come I poof like I'm David Blaine\n\n[Hook - Kool A.D.]"}]}