{"songs": [{"album": "RevolveR", "image": "https://images.genius.com/8bd04bc09ad7c7eedd7520acce15651f.960x960x1.jpg", "year": "2011-12-06", "title": "Center Of The Stage", "lyrics": "[Intro: T-Pain & Bei Maejor]\nYeah, shawty, yeah\nLa, da, da, da\nBei Maejor are you ready? (Uh huh)\nBei Maejor are you ready? (Uh huh)\nDo it for the 85 (0)\n85 (0)\nLet's go\nWhere she was?\n\n[Chorus: Bei Maejor]\nShe was in the center of the stage, showin' me love\nI was so amazed, throwin' up dubs\nBaby what it is? I just wanna touch\nMaybe catch a grub, like it's only us\nIn the middle of the stage, showin' me love\nI was so amazed, throwin' up dubs\nBaby what it is? I just wanna touch\nMaybe get some...\n\n[Verse 1: T-Pain]\nI swear this girl so fineeee, she move me so fast\nPutting creases in my t-shirt with her ass\nBaby that's your theme song put it on the glass\nI just wanna backstage pass\nAnd you so fly, I just wanna do ya\nGet ya to my crib and seduce ya\nShit I'll have you screamin \"Hell yeah!\", while I'm giving it to ya\nBaby we can lay in my cooler?\nSo let me know, if I can be the one to show\nHow bad you make a nigga wanna go\nTo the ATM\nAnd come back with a grand so I can see you\n\n[Chorus: Bei Maejor]\nOn center of the stage, showin' me love\nI was so amazed, throwin' up dubs\nBaby what it is? I just wanna touch\nMaybe catch a grub, like it's only us\nIn the middle of the stage, showin' me love\nI was so amazed, throwin' up dubs\nBaby what it is? I just wanna touch\nMaybe get some...\n\n[Verse 2: R. Kelly]\nI thought I was the center of attraction till\nI saw lil mama in action still\nRidiculous, wanna lick her like a liquorice\nTease her till that thang becomes ticklish\nGot me throwing all my money on the floor\nCause she the baddest mutha'ucka on the floor\nThat's even when the lights come on\nNot like these other chicks when the lights come on\nJust wanna put her in the coupe and take her home\nCenter of the stage when I get shawty alone\nCause you bending over well, it looks like a car\nDrove all the way up north just to see that booty south\n\n[Chorus: Bei Major & R. Kelly]\nOn center of the stage, showin' me love (love)\nI was so amazed, throwin' up dubs (Shawty tell me what it is)\nBaby what it is? I just wanna touch (touch you)\nMaybe catch a grub, like it's only us\nIn the middle of the stage, showin' me love (middle of the stage, ooh)\nI was so amazed, throwin' up dubs\nBaby what it is? I just wanna touch (Baby what it is, touch)\nMaybe get some...\n\n[Bridge: T-Pain & R. Kelly]\nT-Pain what she do?\nShe got me trippin, dawg\nShawty butt-naked, just getting off\nI gotta deliver there I'm a tip it off\nAlready got her in club, shawty what it do tryna get in\n\n[Pre-Chorus: Bei Maejor & R. Kelly]\nYou, you, you, you, you\nI spend my chips on you\nYou, you, you, you, you (Spend my money, spend my money)\n\n[Chorus: Bei Major & R. Kelly]\nOnce shawty on center of the stage, showin me love\nI was so amazed throwin' up dubs (Dubs)\nBaby what it is? I just wanna touch (I just wanna touch)\nMaybe catch a grub, like it's only us\nIn the middle of the stage, showin me love (In the middle of the stage)\nI was so amazed throwin' up dubs\nBaby what it is? I just wanna touch (Baby what it is)\nMaybe get some..."}], "artist": "T-Pain"}