{"artist": "Papoose", "songs": [{"album": null, "title": "Mind Body & Spirit", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro]\nPut it on the line\nLets go\n\nYeah, before you can help somebody\nMan you gotta help yourself\nIt's called self-preservation\nGot this shit down to a science man\nCheck it out\n\n[Hook]\nMind body and soul\nMind-he can control you mentally\nBody-he can tell you what to do physically\nSoul-only god control you spirutally\nSo you bust guns smoke weed drink hennessy\nMirror mirror on the wall\nTake a look at him vividly\nYou lookin at your own worst enemy\nPut it on the line\n\n[Verse 1]\nWhen you alone, everybody talk to theyself\nSometimes it's the only way to get across to yourself\nYou ever wanted to do somethin but thought to yourself\nOr didn't wanna do somethin but forcing yourself\nYou ever did somethin good and been glad for yourself\nOr did something fucked up so you mad at yourself\nThought about something funny and laughed to yourself\nOr kept that to yourself\nYou ever met another person\nWho reminded you in the past of yourself\nWhy y'all so much alike you asking yourself\nY'all so much alike y'all clash cause it felt\nLike he was trying to be you when he act like himself\nReally deep down inside you mad at yourself\nPull the gun and blast at him you blast at yourself\nEver knew something was true and then nodded to yourself\n'Cause you can't take the truth stop lyin to yourself\n\n[Hook]\n\n[Verse 2]\nIt's like the mind fight the heart\nSome niggas mind so sharp, they fight what they feel\nAnd do the wise thing they so smart\nBut other niggas do whats in their heart\nReact off emotions they black out and get so dark\nThey hold it in and never talk\nBut get old and die of heart attacks\nThey get attacked by their own heart\nSome niggas get too conceited and fill theirself\nTry to be somethin they're not but reveal theirself\nSome niggas get insecure they grill theirself\nPut a gun to their own head and kill theirself\nYou ever found yourself looking out for everybody else\nSo much that you don't look out for yourself\nIf you a stick up kid in red, drug dealer in blue\nA rapper with a mic, salesman with a shoe\nDon't let nothin get in your way just do what you do\n'Cause the only person that can stop you is you\n\n[Hook]\n\n[Verse 3]\nThats why I say \"who am I?\"\nYou say \"what a stupid question\" but who am I?\nThink before you start talking\nYou forgetting where you came from\nRemind yourself\nLife is like a dictionary\nDefine yourself\nAre you a gangsta?\nWell lets define that word\nI'mma try but it takes action to describe that word\nA gangsta takes care of family, he's never afraid\nDeath before disrespect, a gangsta is brave\nAre you a thug\nIts like a gangsta but more gully\nMoney before bitches and honor before money\nYou a baller?\nThen you cop a house before a car\nFortune before fashion play monopoly y'all\nAre you a rapper?\nThen you must invent those songs\nThey dont gotta like you\nBut they gonna respect your boss\nI named my son Papoose\nHe reflecting me\nBut he way better than me\nMan controls his destiny\n\n[Hook]", "year": null}]}