{"songs": [{"image": "https://images.genius.com/de4461e997db2c5b87deaef13bb98de6.1000x1000x1.jpg", "title": "Auntie Maria’s Crib (The Neapolitan Remix)", "album": "The Boombox Diaries, Vol. 1 EP", "year": "2012-03-07", "lyrics": "[Intro: Action Bronson + mother]\nThere’re my slippers, man\nMammy, get my slippers\nAry, where you going?\nCan you fix me some soup before I go?\nNo, you just tell me before I tell what’s it just\n\n[Chorus: Sample]\n\"You’ve got that certain something\nIt really turned me on\nYou can make me do right\nOr you can make do wrong\"\n\n[Verse 1: Action Bronson]\nDiamonds tastin’, square like the 5 wagon\nPassenger sit on the left\nDrop a little ashes on the thigh muscle\nI'm the doobie scholar\nOld foreign white shooters, Tom Gugliotta\nI'm an aristocrat\nFlow tight like Whoopi character’s pussy in Sister Act\nOr Ving Rhames in Baby Boy, catch you but naked, cookin’ eggs\nFuckin’ with your mother got your sister on the pegs\nDinos, mongooses\nRedline, Haro's\nRosemary toast paddle for the marrow\nGot women of the streets straight emerging out the shadows\n2 piece like Chris Childs did to Kobe\nCatch me in the corner store, quarters for Shinobi\nBall court, I’m NB\nUp in Auntie's house, chillin’ with the family\n\n[Chorus: Sample]\n\"You’ve got that certain something\nIt really turned me on\nYou can make me do right\nOr you can make do wrong\"\n\n[Verse 2: Nitty Scott]\nOkay, this hookah got me cooler than the Buddha\nRap barracuda think it deeper than the scuba\nSpark me up a Cuba\nMe and my auntie Maria, she doing Santeria\nWhile I be blastin’ a classic up in the galleria\nYou know my style, go for miles over miles\nAin’t no tellin’ what a crook is cookin up to see him cook\nHit you with the remix, got your man shook\nBurnin’ higher burnin’, yea I wrote the damn book\nFrench manicure crushing up the sticky\nVery trippy type to get the secret out of pickie\nWe tight fly so, they know how I go\nOnly gettin’ higher them days that when we wild go\nCausin’ me stress, curve you like the letter S\nTake a hit to the chest and I pass the gun to the west\nYea, Nitty, Bronson, tone is so gifted\nPut the flame to the bang and get lifted\n\n[Chorus: Sample]\n\"You’ve got that certain something\nIt really turned me on\nYou can make me do right\nOr you can make do wrong\"\n\n[Verse 3: The Kid Daytona]\nYea, were you naughty Maria crib?\nGanja’s bein’ lit\nFog so thick it’s hard for me to see you here\nNeedy gotta lead ya here\nStyle’s cheap in here\nWhile smoking on this rain that was flown in from keira south\nI brought some white bitches, they go the mirror out\nSlice sniffle sane only 'cause it’s winter out\nWhen in doubt, holla at your nigga\nNo college experience but get a lot of academics\nMy liver don’t like me too much\n2 cups of Mama Juana, really I don’t give a fuck\nShit I’m all short of happy and I line up with some cups\nSo now what’s in the bookings? Conscious for the judge\nTrippy sticks for hash throw\nYou guys sure lookin’ abnormal\nHit my contacts, the past on through\nRegular show cartoon and my tune a nigga rollin’\nGot a 3 bedroom and your geruzza started growin’\n\n[Chorus: Sample]\n\"You’ve got that certain something\nIt really turned me on\nYou can make me do right\nOr you can make do wrong\""}], "artist": "Nitty Scott"}