{"artist": "Ice-T", "songs": [{"title": "I Must Stand", "lyrics": "Nobody ever said life was gon' be easy\nBut damn..\n\n[ VERSE 1 ]\nJust a kid, moms died when I was seven\nPops died, eleven, what's up with heaven?\nIt's hell when you're an orphan at a early age\nThis impressionable stage, no love breeds rage\nIn the heart of a child who never knew his roots\nLooked up to pimps and to hustlers in the eel-skin boots\nParkin Caddies on the sidewalk, gangsta talk\nTruckin diamonds and gold\nRubberbands around the bankrolls\nFly girls to make your head spin\nSeemed they partied all night long\nI was like, \"Put me on\"\nBut they said, \"Little fellow, run and go play\nTake your butt to school or else you'll have to be like us one day\"\nI didn't understand, but I tried to get a job\nWhile all the players got the girls cause they'd hustle and rob\nI was like makin 'bout 1-50 a week\nAnd after taxes, you know what that is - lunch meat\n\nAnd I know I can be better than this\nI gotta get me a car, man\nI gotta get a girl\n\nI know I can do it out there, man\nI'm gonna go for it, man\nI gotta get some money\nWord\n\n[ VERSE 2 ]\nStreets of anger, trouble and crime\nI had it hard, had to sleep in my car sometime\nBut I never let another player see me down\nI kept my front up, my gear clean\nEven when checkin minor green\nBrothers knew my game was true\nSo I hooked up with the real crew\nThat knew excactly what to do\nBank jobs and jewels, quick to flex with tools\nPimpin hoes on the block\nCheckin cash non-stop\nCrack spots, armor with interior bars\nNo lie, I used to own 'bout 15 cars\nEvery piece Fila made\nDrape my women in suede\nPavet Piaget, Cesar's Palace holidays\nIt was on, crazy out of control\nWe made up the word 'ballin', that was how we rolled\nBut the FBI had a-whole-nother idea\nIt's called multiple indictments for hundreds of years\n\nWhat\nDaff is dead?\nCarter got 25 years?\nNah..\nSpike 35 to life?\nNah, don't tell me B.O.'s dead, man\nI don't wanna hear that, man\nI was just with him\n\n[ VERSE 3 ]\nThe game is vicious, no retirement, you die young\nListen to a fake, he might tell you to grab a gun\nI get phone calls from condemned row\nBrothers I ran with, brothers I really know\nThey tell me, \"Ice you got much love in the pen\nYou're the one that got away, don't wanna see you in\"\nThey tell me, \"Tell the little homies the deal\nDon't let em come up in this hellish habitat of shanks and steel\"\nI marched two million strong in D.C\nLookin eye to eye with brothers that I used to think below me\nDamn, my mind was twisted in my hustlin days\nBut God spared me, I got a baby son to raise\nAnd bein black ain't easy, prejudice is real\nBut health and liberty is all we need for us to build\nWe gotta come together, unseparated\nCheck yourself like I did, blackman, because we're all related", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg", "album": "VI - Return of the Real", "year": null}]}