{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Ventilation", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Intro]\nSay you wanna be a fly emcee (Uh-huh)\nBut can you really fuck with Phife Diggy (Hell no)\nYou claim about how you get much bank\nBut Money can you fuck with Mutt Ranks\nI be the emcee with the illest styles\nCause on the microphone I get buckwild\nHaha! Yeah, fuck that\nBassline, yo hit me\n\n[Verse One]\nCheck it, I'm shittin' on rappers this year\nWho the fuck claims they want some of this here (I dunno)\nGo ahead, show your face, shall I crush your shit now\nSay a smidgeon of a word and I bust your shit down\nHow dare you stand in my face with that old nonsense\nToys 'R' Us lyrics, yo fuck that (?) concept\nI back-smack niggas that claim to be the hardest\nSay the word battle and I'll gladly do the honors\nNow for the past, I guess you heard me on some wild shit\nNever had a chance to do some wild out shit\nB&S and folks I know were on some bitch-like shit\nSo debt to label, on top of that, shady cats is the management\nI made a vow, no more gettin' penetrated\nFuck that old happy shit, peep the style that's demonstrated\nRight here nigga, let's just be real nigga\nI know cats be actin' funny, you can go figure\nWhat the fuck, you thought the Diggy was a pussy nigga\nOr better yet (What!) I ain't have it in me nigga\nMan please, I wax emcees of all types and variations\nWhile you jerk artists and put out bogus compilations\nWhen shit hit the fan, niggas go on vacation\nOr wanna join the Nation \"Phifey why's you hatin'\" - Q-Tip\nYo fuck the clowns Frank, yo peep the bullshit they makin'\nThey fakin', look at all the talent they wastin'\nNow every artist on the roster, you know they straight fuckin' prankin'\nNo more of that will Phife be takin', it's money time!\nLike Heather B I'm takin' mine, and that's my word\nI'm more anxious than Ginuwine, I straight get on some\nM.O.P meanin' blast a nine, Once again for two-thou\nMutty ain't refined, while two of our fakers from beyond\nThe motherfuckin' sign, and to whom it may concern\nKiss my never-mind, you couldn't hear the first time?\nWell nigga press rewind, the fuck y'all thought?\nDiggy Dawg wouldn't get his shine, yo let me find out they corny\nYou know that ass is mine, and if you'd like to see me\nI ain't too hard to find, just e-mail me at\n(Three W dot kiss my behind and suck my\nTestes dot com) And I'll gladly show you maggots\nWhy you laid the bomb, it's true Phife, yo fuck that\nMoney I'm just gettin' warm, to whom it may concern FUCK THAT!\nIt's on! uh uh it's on! uh uh\nIt's on! it's on! uh uh it's on!\n\n[Hook 2x]\nIt's ventilation! I gotta air some things out\nI know a few understand what I'm talkin' about\nHold that! Take that with you! Take that with you! Hold that!\nHold that! Take that with you! Take that with you! Hold that!\n\n[Verse Two]\nPhife Diggy got these rappers feelin' uneasy\nPhysically and mentally they say they wanna emcee, but it ain't meant to be\nI discredit all jerks, full force\n'Til they discover who's the man, which leads me to this next discourse\nI'm so disquited with hiphop, cause yo it's disgraceful\nDisinfect all of you roaches, clean 'em up, Lord thank you\nWhat we need is discipline, all of these rappers don't trifle\nSould I just join. I can't do that cause I'm a hiphop disciple\nStandin' next to Bambataa, holdin' fort is how we do\nThose who disrespect the culture, (What!) we seein' you\nDisfigure you! (Disfigure you!) Discard you! (Discard you!)\nThese shiney emcees know the flavor, they get disfavored\nSo from now on my brethren use your discretion\nDon't fuck yourself and if you do I hope your usin' protection\nHow many you murdered on your album, or is that just for attention?\nThese labels got y'all like Muppets so I'ma play Jimmy Henson\nMutt Dawg for two-thou, makin' moves like George Jetson\nSee every dog has his day, so this year no half-steppin'\nTo hear Phife Diggy on the mic, yes sir it's such a blessin'\nNow get the fuck out my session, you punk bitch!\n\n[Hook 2x]", "year": "2000-09-26"}]}