{"artist": "6LACK", "songs": [{"album": "FREE 6LACK", "title": "Alone / EA6", "lyrics": "Part I: Alone\n\n[Intro: Spoken]\nI know that but being around, in that atmosphere and seeing how people move, you know, seeing how, how they make records, you know, what kind of record they make... I'm just like... I don't want this shit for myself and I don't ever want niggas to try to pull me into that. 'Cause I've been told a couple times like, \"Hey, do this shit man, do that...\" And I'm like man, I don't want, I don't want that for me man.\nAnd if I keep tellin' y'all I don't want that shit for me and y'all keep, you know, tryna nudge and push... I understand y'all got your vision and y'all got your formula but that shit don't work for me, man. I'm not gonna conform, I'm not settling for that shit. 'Cause if I do it once and it pop, I'ma have to keep doing that shit over and over again. You can't build no fanbase like that. You...you become, you become, you become a fuckin' song instead of a person. That shit...I'm not...I'm not tryna be that man\n\n[Verse 1]\nUmmmm...migraines from overthinking\nI'm tryna let go, I'm tryna let go\nLet go of the past, man that shit been tryna creep up, up\nContemplatin' on if I'm really as strong as I thought, bitch I might be\nQuick to pull me down but as much as I've seen, I can't fall, it's unlikely\nShit get a little twisted up\nI put my troubles in the dirty then I mix it up\nI’m bouta change my number\nLike I haven’t switched enough\nThis is home\nAnd you ain't Zone 6 enough\nGone\nI’m from East Atlanta Zone\nIf you ain't from it\nTake your ass home\nI let my heart talk, keep my mental strong\nSpeak the whole truth 'til my money long\n\n[Interlude: Spoken]\nHalf of them don't even know your name. I don't want that, I want people to know who the fuck I am. I want people to know what I stand for. I want people to be personal and know, \"This is 6LACK, this is what he believe in....\"\n\n[Hook]\nWhat we need to talk about\nGet gone, get gone, yea yea\nGot the past whispering in my ear\nHe flaw, she flaw, what’s wrong?\nI got troubles, and they won't leave me alone\n\n[Verse 2]\nIt seems like everybody got something to say\nEverybody got a look they tryna get off of their face\nEverybody got an opinion\nAnd I don’t want one\nTrying to tell me a better way to do some shit\nThat you ain't ever done\nSips drink in the booth\nBlack down to my shoes\nKick shit with my troops\nKicking shit, Ryu\nYou not with the shit why you\nFront for those who don’t matter\nWhen they not thinking about you\nIf I learned anything\nIt would probably be to listen more than I talk\nAnd don’t brag about what I got\nJust multiply what I brought\nI never dwell on a loss\nNever give a nigga sauce\nHe might run off with it all, he might run off with it all\nHe might run off with it all, he might run off with it all\n\n[Hook]\nGet gone get gone Yea yea\nGot the past whispering in my ear\nHe flaw, she flaw, what’s wrong?\nI got troubles, and they won’t leave me alone\nGet gone get gone\nGot the past whispering in my ear\nHe flaw, she flaw, what’s wrong\nI got troubles, and they won’t leave me alone\n\nPart II: EA6\n\n[Interlude: Spoken]\nLike I’m more of myself than I’ve ever been\nWhich is something that you really gotta come to face with sometimes\n'cus, I thought I was, you know, fully myself 24/7\nBut nope, like right now is how I’m supposed to feel all the time\nIt's how I’m supposed to be all the time\nIt's how I’m supposed to think all the time\nNow I know going out of this, I know leaving this\nThat will follow me\nIt doesn’t, you know, end with this, you know\nI gotta take it and I, live with it every day\nI see the people around me and\nI feel so much\nI wanna put it in words\nTry and figure where to go with it\nBut I just feel so much\nI know they don’t even feel as much as I feel\nThat’s alright\nThat’s alright\nWe have two different purposes\nClearly my purpose is some shit that’s way fucking bigger than me\nThen it gets completely quiet when I'm at the beach\nI know I’m one person but I kinda feel like this ripple effect is gonna impact a lot of people\nI feel God talking and when he talks everything else is silent\n\n[Verse 3]\nSummer 2011\nAlmost lost my faith in God\nSame time I never prayed so hard\nTook control of my life so I wouldn’t have to take no job\nPress play I couldn’t take no pause\nI’m from east Atlanta 6 they don’t play that shit\nIn East Atlanta six you better make that lit\nOr they be at your front door with that gun doe\nKnow them niggas Nick Cannon with the fucking drum roll\nEast side 'till a nigga die\nBeast mode 'till a nigga cry\nSensei make a nigga fly\nShit hard but you gotta try\nIf I can do it, you can do it too\nTime to be a better guy\nI found the answer ridin' down Candler\nI'm late for court 'cause traffic on Moreland\nI’m trying to preach to y'all what’s important\nSo hard for me to ignore ignorance\nI don’t know why I feel it’s my place\nI know you see the pain in my face\nI call the shots and move at my pace\nBut I understand it's all a big race\nI understand you want that big face\nThey offer and hey\nIt's hard for me to say\nI wouldn’t bite the bait they threw me\nBe cautious where you play\nIt’s darkness in the A\n\n[Chorus]\nBe cautious where you play\nIt’s darkness in the A\nBe cautious where you play\nIt’s darkness in the A\nBe cautious where you play\nIt’s darkness in the A\n\n[Verse 4]\nA-Town stomp on the old me\nUsed to ride through the hood with the slow creep\nPeople gon' love what they don't need\nI remember what the OG's told me\nYou better shine bright when the lights down\nLess talk, more show, nigga pipe down\n'Cause words ain't shit but your thoughts out loud\nAnd thoughts are the opposite of showin' nigga's how\n\n[Chorus]\nBe cautious where you play, there's darkness in the A\nBe cautious where you play, there's darkness in the A\nBe cautious where you play, there's darkness in the A\nBe cautious where you play, there's darkness in the A", "year": "2016-11-18", "image": "https://images.genius.com/9f111ac21b205f296ae84413d00f14a2.1000x1000x1.jpg"}]}