{"artist": "The Game", "songs": [{"title": "Can’t Get Right", "album": "Jesus Piece", "year": "2012-12-11", "image": "https://images.genius.com/dd068b5a01b261090f4744693ea09c67.1000x1000x1.jpg", "lyrics": "[Verse 1: Game]\nI bumped \"Ether,\" bumped \"Takeover\"\nSeein' Jay and Nas on stage was hip-hop's makeover\nAnd that very day you knew niggas was born\nTyler, The Creators, Drake, J. Coles, and Big Seans\nTime for the world to pay homage\nBow to the rap Gods or them K's vomit\nFuck you know about Dipset you little dipshit\nIf you ain't fuck, then you ain't get your dick wet\nI see your little chain\nI see your little dreads, tryin' to be a Lil Wayne, shit\nI used to wanna be a little Hov\nStarted with a little rock, got me a little stove\nMade a little money, bought me a little Rov'\nPaid cash money like I was from Hollygrove\nSold ten mill, everybody know my name now\nThinkin' back, it's a motherfuckin' shame how\nBiggie got killed and Pac got murked\nSometimes I gotta step in the church, cause I ain't tryin' to go to hell\nAs the blood spills from my pen\nIt's time to confess my sins, cause I ain't tryin' to go to hell\nI smoke weed, pop pills, but I'm thinkin' it's time for me to chill\nCause I ain't tryin' to go to hell\nI'm tryin' to get some head tonight, have a stripper in my bed tonight\nBut I ain't tryin' to go to hell\n\n[Chorus: K. Roosevelt]\nFather forgive me, cause I ain't perfect\nNo, no no no\nWhy is everything wrong?\nOh I can't get it right, I always try to get it right\n\n[Verse 2: Game]\nDre promised me records, I never got 'em\nThat's why I had nightmares that a nigga shot him\nFor all my albums missed records\nFelt he shitted on me for Kendrick, recorded diss records\nAnd Kendrick, my nigga, put him on his first mixtape\nI pop champagne when I heard he was with Dre\nAnd I'm tellin' y'all this true story cause I'm real\nDre, first time, hearing 'bout it, wonder how he feel\nCause I feel like shit severin' the relationship\nThe only doctor I knew to make all of his patients rich\nSnoop, Pac, Em, 50, me, K. Dot, watch us do a 360\nPlus The Documentary saved me from penitentiaries\nI ain't trippin', niggas been disloyal for centuries\nFinally got the crown, this motherfucker meant for me\nFunny how you do your top 5's and don't mention me\nFuck 'em all\n\n[Chorus: K. Roosevelt]\nFather forgive me, cause I ain't perfect\nNo, no no no\nWhy is everything wrong?\nOh I can't get it right, I always try to get it right\n\n\n[Break: K. Roosevelt]\nSee I been spendin' these late nights\nOn girls I never see again\nConstantly intoxicated\nOnly God could save me, yeah\nWith 'em by the sunrise\nOne day everyone dies\nThat's the way the story goes\nBut now, I can't feel my heart\nBut I just keep ridin', ridin'\nFeel so numb, numb, oh yeah\n\n[Chorus: K. Roosevelt]\nFather forgive me, cause I ain't perfect\nNo, no no no\nWhy is everything wrong?\nOh I can't get it right, I always try to get it right"}]}