{"artist": "Boondox", "songs": [{"album": "The Harvest", "title": "Lady in a Jaguar", "year": "2006-07-11", "lyrics": "*Umm excuse me could you help me out?? Umm I lost the fuckin freeway and I'm tryin to find my way back. I guess I'm just a little bit lost.*\n\nIt was late one night in the 404\nI was gone off that water chillin on the front porch\nI was leaned back laxin and puffin on some swag\nWhen a bitch came up in a tight ass jag\nShe pulled right in the driveway bumpin clint black\nWhen she stepped out the ride I had to take a step back\nShe had long blonde hair and a ass that wouldn't quit\nTitties fallin all out because the shirt didn't fit\nStarted walkin up to me then she drops the keys\nKneeled down to pick them up and all I saw was g-string\nPussy lips hangin out and it was the shit\nNow I'm sprung on this bitch in a SJ6\n\nHey lady in my jaguar. How did you get you so much money?\nWhat you doing down here, down there, round here?\nHey lady in the jaguar. Who you tryin to impress?\nWhat you down here, down there, round here?\nHey lady in my jaguar. Where'd you get you so mucn money?\nWhat you doing down here, down there, round here?\nHey lady in the jaguar. Who you tryin to impress?\nWhat you doing down here, down there, round here?\n\n*Oh my god.. Umm excuse me Umm I'm not from around here and Umm I was wondering if you could hook a bitch up with some of that you know that really good, good, booger sugar?*\n\nIt was jumpin down town on a sat night\nI was wipin car windows on a corner street light\nShe was parlay in a monte green jaguar\nShe locked her doors now what you do that for?\nI could see she had a dead fox chillin on her shoulder\nBlonde highlighted hair her face a little older\nI knocked on her windshield and kissed the glass\nI think I prolly scared a dune out her ass\nBut she peeled my wig back and offered me a ride\nSmiled at a juggalo and told me get inside\nI'm like hell yeah bitch you old rich freak\nI went to get in, She peeled off and ran over my feet\n\nHey lady in my jaguar. How did you get you so much money?\nWhat you doing down here, down there, round here?\nHey lady in the jaguar. Who you tryin to impress?\nWhat you down here, down there, round here?\nHey lady in my jaguar. Where'd you get you so mucn money?\nWhat you doing down here, down there, round here?\nHey lady in the jaguar. Who you tryin to impress?\nWhat you doing down here, down there, round here?\n\n*Oh my god my fuckin cell phone gets no signal, There's fuckin potholes everywhere and I'm just tryin to get me and the jaguar home okay?*\n\nOh shit who that rollin down the block\nAnother closet smoker lookin for some rock\nAnd a jag pulled up and the window rolled down\nI'm lookin for the infamous Shags The Clown\nI tried to say what up but before I had the chance\nI seen her camel toes tryin to push through her pants\nSo I said come here bitch she said what for?\nShe grabbed me by the pants and opened up the door\nShe pulled out her titties said she likes kinky stuff\nAnd that if I wanted the neden I had to put on these handcuffs\nShe cuffed me to the seat Hey Yo What the hell?\nShe said I'm takin you in for jumpin your bail\n\nHey lady in my jaguar. How did you get you so much money?\nWhat you doing down here, down there, round here?\nHey lady in the jaguar. Who you tryin to impress?\nWhat you down here, down there, round here?\nHey lady in my jaguar. Where'd you get you so mucn money?\nWhat you doing down here, down there, round here?\nHey lady in the jaguar. Who you tryin to impress?\nWhat you doing down here, down there, round here?\n\n*Oh my god I am so not tryin to be a bitch alright.. I just want to get a bag of loose get me and the jag home. So can you help a bitch find a fuckin toot??*\n\nHow did you get you so much money?\nWho you tryin to impress?\nHow did you get you so much money?\nWho you tryin to impress?", "image": "https://images.genius.com/9bc5140eadd19250a34c88748f1ddafa.500x500x1.jpg"}]}