{"songs": [{"title": "Leave Me Alone (Little Bitty Box)", "album": "The Jakal", "lyrics": "[Suga Free]\nDollar bill y'all\nShit\nSomethin' I can feel, y'all\nWhy you bullshittin'\nShadow on the 619\n\n[Verse 1: Suga Free]\nOh, here motherfucker, since you wanna go fetch\nOn my worst day, you couldn't fuck with me at your best\nI know you hate it when I show up (Show up)\nTow up\nProbably cause you know I break a bitch and I'm about to blow up\nNow it's hoe season\nMotherfuckin' so why bitch\nThat you hatin' and contemplatin' on a real pimp for no apparent reason\nThat I beat the situation and I'm hot\nRecognized that you hatin', cause I got them trick waitin'\nBack to back, fuck a 'Llac\nAnd a rat, like that\nOh, you fuckin' with a pimp\nAnd you will get slapped\nThat's what a pimp do\nBreak you\nAnd get rid of you\nAnd make you tell 'em other players what I did to you\nYou bitch, you hoe, you slut\nBetter recognize game before I fuck you up\nNow what you waitin' for?\nI'll let a bitch pimp me when pushed\nYou don't sell no more and make dildos out of playdough\n\nChorus: Suga Free\nIf, you, don't\nLeave me, alone\nI'm, gone\nLock you in that little bitty box again, bitch\nIf, you, don't\nLeave me, alone\nI'm, gone\nLock you in that, lock you in that (Little bitty box again, bitch)\nLittle bitty box again\n\n[Verse 2: 40 Glocc]\nI had a bad ass bitch with a caramel tone\nSo I put my back in my bone, and mack in my tone\nTold her, \"Shut the fuck up,\" and sit in the back of the broom\nSnatch my cheese up quick and kick the back with a shroom\nCause we don't love them hoes and\nA bitch ain't worth a shit with no gold\nSo I hit the club to cop more\nY'all know\nIt's Suga Free and 40 Glocc in Dego\nWith Mr. Shadow all the way from Colton to Seattle\nAnd back to Pomona\nHoes to promote the corner\nHit me on my two-way Motorola\nI got a whole lot of soldiers that love to throw boulders\nIt's all over, test the faith and bleed slower\nThe heat Blaze Just that fast, give me Hovah\nI want the cash and the ice and the keys to the Rover\nTricky gotta kick cheese to meet, nigga, to ball, blow up\nBiotch\n\nRepeat Chorus\n\n[Verse 3: Mr. Shadow]\nI said, \"She's A Hoe\nHer friend's a hoe\"\nIf you ain't about trickin', then your ass gotta go\nFrom the open toe pumps to the way that you move\nI'm a show you how a ese from the S.D. do\nStraight act a fool, got you making me loot\nGot you standing on the corner and that ass look cute\nAnd you know when the fuck I'm comin' 'round the block\nWith the homey So G, Suga Free and 40 Glocc\nIt don't stop, we stay pimpin'\nBitch, why you trippin'\nDon't hate the playa, hate the game\nYou damn chicken\nStickin', no lickin'\nThat's the motto\nAnd boy, the life I life\nIs hard to swallow\nMake your shit hollow, real quick, don't try to follow\nSo pimp playa, pit bosses smokin' in a hot model\nDon Shadow, makin' ya bitch clip tricks\nShe employee of the month when it comes to servin' dicks\nHa ha\n\nRepeat Chorus", "image": "https://images.genius.com/550b13171c38d5b654cf1c9a260cd8b5.500x500x1.jpg", "year": null}], "artist": "40 Glocc"}