{"artist": "Vanilla Ice", "songs": [{"title": "Ice Cold", "year": null, "lyrics": "Your bad self..\n\n[Verse 1]\nAll right, stop, spread yourself around\nGet loose girl, let's break it down\nGet down, straight to the floor\nGet excited and beg for more\nAs I go on, flow on with a smile\nPay attention to my style\nDirty but hot, ya' know what I mean?\nGet loose girl like a sex fiend, let's do it\nCause you know what I want\nMe and you babe go one on one\nGet freaky and I do the same\nGet hot and I ride like a sex machine\n\n[Hook]\nIce cool and you're colder than ever, I like it\nIce cool and you're colder than ever\n\n[Verse 2]\nIce cold, cooler than ever\nNever say never cause I'm so damn clever\nLickin' your lips, I'm ridin' your hips\nV.i.p. posse and we're pimps\nBe on the lookout in your vicinity\nI'm robbin' virgins of their virginity\nLike robin hood gave to the poor\nI rock kashla and now she wants more\nShe calls everday, it's gettin' kinda' silly\nBut she rides my saddle like bronco billy\nIn a rodeo somewhere out west\nShe screams out \"vanilla ice, you're the best!\"\nEchoing out, can you hear?\nShe screams out everywhere\nJust a pimp and you know\nSnatchin' women, so, yo!\nYou can beg, plead and tell me you love me\nBut there's no way i'd put a girl above me\nUnless it's sex and you wanna' ride\nJump on my saddle, baby, and get live\n\n[Hook]\n\n[Verse 3]\nMove your body all around\nThis is the dope jam, so get down\nNow that you like what I'm sayin' admit it\nThis is the jam and vanilla just did it\nI made you work 'til your butt got sore\nIn other words, I'm about to get raw\nOn stage, it's a v.i.p., doin' dances from a to zpumpin' it, pushin' it, stick it hard\nI freaked your girl in the back of your car\nI wore a jimmy that I slapped on\nPopped a rubber duckie, so bought me a trojan\nGet ready, hyped into the groove\nAs I practiced to make your body move\nYou're fienin' for a meanin', oh yes, I'm comin'\nVanilla ice is here so you suckers start runnin'\nThis is the jam I know you're gonna like\nDeshay he cuts like a knife\nHe won't smirk and he won't smile\nDeshay get funky for a while\nYo, it's time for me to pump, pump..\nPump up the volume\n\n[Hook]", "album": "Hooked", "image": "https://images.genius.com/5078fff4f8c0f4d1704f492654dc4064.1000x1000x1.jpg"}]}