{"songs": [{"image": "https://images.genius.com/b7bcbd18f4df90fee8a1067f0b2b3a7b.1000x1000x1.jpg", "title": "Grindin’", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Intro: NF]\nOh yeah (oh yeah!)\nJust let me work, no, just let me work, no\nI'm out here grindin'\nYeah, I'm out here grindin' (woo!)\nI told 'em (oh yeah!) that I'm out here grindin'\nI'm out here gri—(hey, hey!)\n\n[Verse 1: NF]\nYou ain't never heard nothin' like this\nLet me work, show me where the mic is\nI'm on stage, black shirt, in my Timbs\nYou know how I do it, I ain't playin' with you, I've been grindin' Anybody tryna sleep on me better do somethin' with your eyelids\nI hear a lot of whinin', but I don’t hear a lot of rhymin', woo!\nEverybody got opinions, let it go into my ear and then I block that\nPut me on stage, I'ma rock that\nSayin' you the best? Stop that\nPhony, I am not that, yeah\nWhat are y'all doin' out here? What are y'all doin' out here?\nMaybe you should spend a little less time with the women in your arms and a little bit more with your career\nI ain't saying I'm the best, but I should be in the top ten; give me a list of names, I'ma top them\nI'm just playing with ya, I don't care where the top is\nLeave me at the bottom, let me work for it\nYou ain't never gonna find another rapper in the game and tell me that he works more\nTell me that he works more, nah!\nYou might see me with my hoodie up, I ain't leaving 'til I finish\nThis industry ain't nothing but a box, but I ain't gon' climb in it\nYou put me inside a room full of rappers, come back in five minutes\nI'ma be the only one still alive, with a note on my chest saying that I did it!\nYou do it for fame, we are way different\nY'all are looking weak, we ain't cooking in the same kitchen\nEverybody got a shirt with a stain in it\nSome of us'll never wear it out though, lemme get it!\nI guess I don't understand\nThis wasn't part of my plan\nSome of these people, they're thinking 'cause they heard the name that they really know who I am\nBring the beat down!\nI got no time for these Hollywood people, I'd rather give time to my fans\nYou'd rather chill with these women that like you for money\nBut I'd rather chill with my fam, yeah\nI'm out here grindin'\nI'm out here grindin'\nYeah, I see the mic but you looking like a pilot\nWhat's the point of a plane if you don't know how to fly it?\nYeah!\n\n[Chorus: NF]\nI'm out here grindin', okay okay okay\nI'm out here grindin', okay okay okay\nI'm out here grindin', okay okay okay\nI'm out here grindin', all I do is work, all I do is work\n\n[Verse 2: Marty]\nRise of the underdog, I don't like none of y'all\nI'm not like one of y'all\nI'm from the jungle, I run with the son of God\nYeah, what is you running for?\nThey should be running from me\nMost of my family, we don't even speak\nI'm getting married in 22 weeks\nAnd they still haven't said \"Hi\" or wanted to meet, huh?\nI'm not the type to complain\nIf we don't get it, we try it again\nAnd I'd die for the gang, Misfit my blood\nThey don't like us and we question they mom like\n\"Why did—why did you allow your kid to like bad music?\"\nWoo! Promise I do it (woo!)\nI'm tryna give you my everything\nI don't care what they are doing\nI'm tryna do what they couldn't do\nLaugh at the rappers you look up to\nDon't waste time with the centerfolds (ay!)\nI'm alive, it's a miracle (ooh)\nFreestylin' since middle school (woo!)\nI will battle the principal (woo!)\nWear all black like a funeral\nI'm doing me, I don't live for you (ayy!)\nGrindin'!\n\n[Chorus: NF & Marty]\nI'm out here grindin', okay okay okay\nI'm out here grindin', okay okay okay\nI'm out here grindin', okay okay okay\nI'm out here grindin', all I do is work, all I do is work\nI'm out here grindin', okay okay okay\nI'm out here grindin', okay okay okay\nI'm out here grindin', okay okay okay\nI'm out here grindin', all I do is work, all I do is work\nI'm grindin'\n\n[Outro: NF]\nOh yeah, oh yeah, oh yeah\nI'm out here, I'm out here grindin'\nAll I, all I, all I do is work\nAll I, all I, all I do is grind (woo!)"}], "artist": "NF"}