{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Free", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "[Intro]\nOh, oh, oh, oh\nOh-oh-oh-oh-oh-oh-oh\nFree, free, free, free\nFree, free, free, free\nFree, free, free, free\nFree, free, free, free\n\n[Chorus: Pharoahe Monch]\nYou can clip my wings, shackle and chain me\nBack straight, standing tall, a child of God, and I'm free\nSpit in my face, hold me down\nI'mma keep my feet firm to the ground, 'cause I'm free\n\n[Verse 1: Pharoahe Monch]\nYeah, your A&R's a house nigga, the label's the plantation\nNow switch that advance for your emancipation\nMC's in the field like pick cotton for real\nI pop blocks like Beat Street with a notch and a kill\nThey take the strongest of slaves to compete in a track meet\nFor the king of the city sang songs of back streets\nChoruses of cocaine tales and black heat\nOnly to trade niggas like professional athletes\nDon't take that merchandising, snatch that publishing\nPackage that black ass, ship you to London\nBy way of France, Germany, Dublin\nA railroad to underground like Harriet Tubman\nWhile ya'll stay struggling, we smuggle MCs through the streets\n'Til we bubbling on mix CDs, hustling\nClans see me on the block and say, \"Freeze!\"\nI say, \"Fuck you! I'm a man, I'm free\"\n\n[Chorus: Pharoahe Monch]\nYou can clip my wings, shackle and chain me\nBack straight, standing tall, a child of God, and I'm free\nSpit in my face, hold me down\nI'mma keep my feet firm to the ground, 'cause I'm free\n\n[Verse 2: Pharoahe Monch]\nOkay, yo, I give birth to verses in churches with no confession\nSo please pardon my post-partum depression\nA-list MC to spit it in C-Sections\nFor immature minds that get it with each lesson\nThree-fifths of a man, ass jigga with no plans\nHow you discussing publishing figures without a band?\nThey got digital codes on our music for them to scan\nSo even when you sample a snare, you paying the Klan\nSo Google Pharoahe Monch, search triskadecaphobia\nI'll explain why these city banks watch over ya\nI'll peep the future in my sleep, to be honest, man\nWe never had a mutual relationship with Washington\nWhy? Because I believe they put the virus in the latex\nCondoms that they sell us, call it safe sex\nWhat I spit, not only causes a glitch in The Matrix\nBut another listed terror threat that they ain't even faced yet\n\n[Chorus: Pharoahe Monch]\nYou can clip my wings, shackle and chain me\nBack straight, standing tall, a child of God, and I'm free\nSpit in my face, hold me down\nI'mma keep my feet firm to the ground, 'cause I'm free\n\n[Outro: St Juste]\nYou can clip my wings, shackle and chain me\nBack straight, standing tall, a child of God, and I'm free\nNo, you can't define it\nYou're blinded by the light when I rock the mic, 'cause I'm free\nGot you sick with emotions, drink this potion\nDJ, MC, free, like the thief in the night\nBrown skin, ready to win if you're prepared to fight", "year": "2007-06-26"}]}