{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/654caba7c794fe0ca96931118286b131.514x514x1.jpg", "title": "Sunny Days", "lyrics": "[Verse 1:]\nPour me a cup of tea like that ol’ song\nThat I had like that ol’ girl, I was wrong\nAnd it's sad, if I spit I will cuss you\nIs that bad? ‘Cause I really did trust you\nIf the thought ever surfaced to leave you\nI would die ‘cause the purpose would be you\nYou changed for the world, look how you are\nYou front, grilling me from a dude’s car?\nHow sudden, let me see, you got a tongue ring?\nHow funny, we forget about the little things\nSay word, now you hang out with big girls\nAnd the guys you date these days differ\nI hear the stories and it makes me sicker\nMy heart aches, you fake like a picture\nSo close to reality but not quite\nSo dope, man, her body was so right\nShe was a high school chic, how would I've known\nThat our thoughts would conflict like the bible?\nI don't offend, I pretend like I'm laughing\nLike we connect, like some shit could really happen\nAnd it did, we made a move for this love thing\nI met the parents and gave her the round ring\nAnd all of a sudden she got a license to nag me?\nWhat the fuck?! I'm just trying to make you happy!\n\n[Chorus:]\n(Sunny days)\nNope, don't have ‘em no more\nWhatchu on the phone for?\nDon't call me no more\n\n(Sunny days)\nNah, so don't agonize me\nI can't stand the stress, see I'm alright without you\n\n(Sunny days)\nSee I'm far from your reach now\nYour body doesn’t tempt me... well, maybe just a little\n\n(Sunny days)\nYea, on the real, like welfare checks\nYou and I are through... through...\n\n[Verse 2:]\nAlright, I'm vexed\nAite, look, I'm tired and stressed\nDon't command me like that, cool it\nI'll be back, watch Dr. Phil or something\nGet yourself straight, you a lil too excited\nThis ain't your birthday\nYou might as well be a rapper talking all that shit\nWhat the -- you throwing things? Aite, that's it!\nYou gon’ fix it! I'm not gon’ scream, not on some bitch shit\nNothing -- but chill -- I'm not calling you a bitch\nJust a figure of speech\nWhat's with all these “I hates you’s”? You sound like Kelis\nLove, look, you're piercing me with this fierce scream\nSeriously, my ears feel like they bleeding tears\nAnd here’s\nThe head scarf you left in my domain\nAnd here’s\nThe photos of our memory lane\nAnd there’s\n(Nothin for you around here)\nYou crossed over to the other side of the track\nSo there's\n(Nothing for you around here)\nI used to bet on you\nBut now the bet’s off and you know I got roots\nTherefore, my quest love\nA brother like me deserves the best of\nAnd you’re not\nSo... uhmm…\n\n[Chorus]\n(Sunny days)\nNope, don't have ‘em no more\nWhatchu on the phone for?\nDon't call me no more\n\n(Sunny days)\nNah, so don't agonize me\nI can't stand the stress, see I'm alright without you\n\n(Sunny days)\nSee I'm far from your reach now\nYour body doesn’t tempt me... well, maybe jus a little\n\n(Sunny days)\nYea, on the real, like welfare checks\nYou and I are through... through...\n\n(Nothing for you around here)\nNope, don't have em no more\nWhatchu on the phone for?\nDon't call me no more\n\n(Nothing for you around here)\nNaw so don't agonize me\nI can't stand the stress\nSee I'm alright without you\n\n(Nothing for you around here)\nSee, I'm far from your reach now\nYour body doesnt tempt me... well, maybe just a little\n\n(Nothing for you around here)\nYea, on the real, like welfare checks\nYou and I are through... through...\n(Sunny days)\n\n[Outro]\n(Sunny days)\n(Sunny days)\n(Sunny days)"}], "artist": "K’naan"}