{"songs": [{"title": "I See Dead Rappers", "image": "https://images.genius.com/4e4a9a2b5c34bb0dfa92ad21067cc2ed.920x920x1.jpg", "lyrics": "[Skit]\nLittle Girl: What happens when we die?\nWoman: We return to the place that we came from\nLittle Girl: I don't remember where I came from\nWoman: Nor do I\nMan 1: If I wanted to kill somebody, I'd get this boot and I'd beat you to death with it, and I wouldn't feel a thing. It'd be just like walking to the drugstore\nMan 2: (unintelligible speaking)\n\n[Verse 1: Brotha Lynch Hung]\nI see dead rappers\nDaddy got a problem, you don't act right\nBitch if you was my daughter, I would say you was off the crack pipe\nBut that's my confession, should've watched the ID channel at random and now you in the bed with the IV\nYou told me when you left, you was going with Tiny, but Tiny just called, you said I can't find me\nI was going 90, 20 minutes Iater, I was hiding under the bed, now you can't find me\nYou shoulda never made it where you sleep alone, you shoulda got the pistol when you hung up the phone\nI slit ya fucking throat and put ya head in the closet, I gave it all away like a money deposit\nYou shoulda never told me where you keep the loan, so now I'm bout to eat you like a Al Capone\nPut your brain in the oven for din-din, a win-win, and I would like to chew on your [?] with a grin-grin\nNow I'm gonna wait in the kitchen, my stomach's still growling I'm waiting for you to come in-in\nMy stomach's still growling I'm waiting for you to come in-in, I see your GPS, you should be here by 8:10\nNow you know you're sweating like a 350 engine, oh I see your lights pulling up in the driveway, I say, butcher knife, I eat it my way\nKick your wife and your kids put 'em in MySpace, pretty little box, that I keep in my wine safe\nCut your fucking back, get you down to the throat, start to nut, at the driveway, hop in the ride, start it up\nI don't have to get bloody but if I do have to get money\nI will hide around the corner with the knife ready to cut better get running\nI can pull up money then [???] gotta get it to where I don't have to get hit you with the meat cleaver I don't matter it don't matter cause I see her chopped up like a meat chuck with the heat stuff\nI don't give a fuck but 'em in the back of the truck\n\n\n[Skit 2]\nMan: And tell him if he had that swords, I just reach and take the sword and pull 'em down his feet! And I-Pay attention when I'm talking to you! That's where it comes from, it didn't come from no fucking book. Stand up or I'll knock your fucking brains out, ya dig what I'm saying? Handcuff the son of a bitch down there and let me I'll show you how I interrogate the motherfucker, ya dig what I'm saying? I'll reach in your brain and tear your fucking soul out and throw it on the floor!\n\n[Verse 2]\nI smell, wait hold up, I see dead people\n3 dead people, murder up to the 1st degree\nBBQ people, like a picnic get ya wig split, I'mma mothafucking monster with it, sick with liquid spit, Sicx did this, I was dead a long time ago, eating rappers heads off like I was smoke all kinds of dope\nGrr, anaconda, give a nigga all kind of trouble\nAnother rapper fucking with me, must be some kind of joke\nHa ha, nigga I'm a dinosaur, Jurassic get ya head twisted off after I do a whole line of coke\nGoddamnit I'm high, bout to rip a nigga from the spine, eat out his insides\nI got a Activision, 4D like a television, that's the action, leaving ya whole family missing\nYou can't find 'em cause I'm cooking 'em in the kitchen\nNever mind, I already done the dishes\n\n[Hook]\nI see dead rappers (x6)\n\n[Outro]\nBrotha Lynch: Like that\n\n[Skit 3]\nInterviewer:\nCharles Manson: Nobody", "year": "2018-07-20", "album": "Kevlar"}], "artist": "Brotha Lynch Hung"}