{"songs": [{"album": "Identity Crisis", "image": "https://images.genius.com/48c0cb108f652a1188a862412a81d930.640x640x1.jpg", "year": "2009-05-26", "title": "Identity 3: The Church", "lyrics": "(Go Through the Motions)\nSteppin' in and I'm checkin' out the scene\nFresh pressed, creased out, man you know yo' boy be clean (clean);\nHand claps, toe tappin' while the choir raise a song\nFolks shoutin' now the reverend's up you know it won't be long\nPassa holler bout a hour and I'm thankin' bout the game\nPeople peepin at the clock (whoop) every Sunday it's the same\nAlter call, preacher's hoopin', church open up the doors\nLeave a tip then I dip, next week I'm back fo' mo'\nChurch!\n\nSteppin' out the house so fresh, clean/\nTailored suites and gator boots/Italian names in the inseam\nSummer heat encumber teens, forced to wear them pants with pleats/\nSunday morning uniform/like we soldiers, like Marines/\nOff to Sunday School with mama 'nem/like it was a job for them/\nI'd hear the same Word but different meanings like with homonyms/\nTime and time again/cause I'm praying that the time would end/\nMan Saturday must be my crime/my Sunday's doing time again/\nYou feel me man, I know you do/some of y'all still going through/\nMost of us just learn the motions just so we can make it though/\nI mean, no one ever showed us how this thing was vital for life/\nAnd that the church was not a building/but the body of the Christ/\n\nMan, you hear that?\nDid you hear that?\nIt's so dope\nBut we just don't get it\nSomething this good......man\n\n(Go through the motions)\nSame time each week\nJesus must know me\n'Cause I'm heatin' up a seat\nIn the church, church\n(Sunrise, eleven thirty\nYou can be late but don't leave early)\n(Go through the motions)\nThe Devil is a hater\nHe can't touch me\n'Cause I'm blessed and highly favored\nChurch, church\n(I've got to be in that place\nSunday I'm go'n show my face in the church)\n\nThe Church, chosen in Christ in eternity\nThe Church is not a building, it's breathing\nMaturing Christians in communal living, helping babes that are teething\nYou can have perfect attendance in the seat of the building and not be apart of this\nYou can attend the building and not be apart of the body of Christ... it's obvious\nI'm blessed and highly favored and because of this Jesus Christ is blessed and highly treasured. The greatest gift that God could give is God... so see and savor Him!"}], "artist": "Tedashii"}