{"artist": "B-Legit", "songs": [{"album": "Hempin’ Ain’t Easy", "title": "Where the Gangstas At", "lyrics": "[B-Legit] (Kurupt)\n(Gangsta time)\nWhere my gangstas at?\n(Gangsta ville)\nWhere all my gangstas at?\n(You know it ain't a gangsta ville withoout a dog pound)\nAnd a hog nigga (caughing)\nYea, special dedication\nTo all my gangsta niggas and to all my gangsta bitches\n(Im sick wit it tho, check it out)\n\n[B-Legit]\nI used to mash through the crowd\nMakin bitches wonder \"DAMN\"\nThat nigga B-Legit's the man\nIt was 65 grand for the land\nFo 5 O, 4x4, hit the strip slow\nWindows on tint so they can't look in\nIts me the kingpin hit and Mac 10\nOn a trip about to hit up the 6\nShould I give up, them niggas run up\nThey fucked, now what\n\nHuh, whos that?\n\n(Kurupt, Mack 10)\nThat nigga Kurrupt\nG'z up, hoes down, muthafucka blaze up\nD.P.G.C. muthafucka g'd up\nIn all blue and grey all day always\nLet the dogs out muthafucka\nHear the barking\nSee the homies G-walking gangsta talkin\nBitches low on dick often very often\nLil beeyotch 135 pounds of all diaaack\n\nI keep the house always stoppin them dubbs to the bay\nFina fuck with B cousin and E fo tay\nFrom my hood to yo' town its all about the cash\nGot the check and the hoe checkin off in the stash\nDont worry bout' nathan, we out there slangin\nMac n' Kurrupt stay down for whobangin\nKeep a fat sack of dope n' fo sho im Dealy\nMaine, the first foo crossin fo sho I'll kill em'\nWhere the gangstas at?\n\n[Chorus 4x]\nWhere the gangstas at?\nWhere the gangstas at?\nTell me where the homies and the gangstas at!\n\n[Mack 10]\nWe gone keep it gangsta ain't go to pop\nPush the six double O and the Rarri drop\nGet the two tickets spread on top of the hill\nNiggas bellin em' chucks makin over a mill\nKeep the studio full of groupie hoes and choosas\nIn the gut bruisas n' three time losers\nMac 10 still thuggin, thats whats expected\nAnd I vow to keep it ruff as long as Im connected\n\n[Kurupt]\nMan I dont give a fuck about a bitch\nMan I won't ever ever give em' shit\nI hit the switch about 5 times\nThen I make a switch and bust 5 rymes\nSwerve wit a homie that can serve 5 verbes\nMan thats the life then go home to my wife\nWith my pistol (??) (??)\nRetire a nigga, now Im a let my girl write my first verse\n\n[B-Legit]\nI hear it's funk on board, they need to let that go\nGot killas gettin down for a brick of snow\nAnd for the right doe have your head chopped\nTag the drug, bitch you fuckin with thugs\nNo time for pleasures, I got mills to buy judges\nThey rush us, tryin to touch us\nThey bust us, no we all burn for scraps\nSo tell me where the homies and my gangstas at\n\nChorus", "image": "https://images.genius.com/8c2ee1e85ca6b68c98af71fcc87d2721.594x594x1.jpg", "year": "2000-07-25"}]}