{"songs": [{"album": null, "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png", "year": null, "title": "Great Expectations", "lyrics": "My nigga Punchline want his money\n\nYo, this is a capitalist society\n\nYo!\n\nHello world, how y'all doin?\n\nDon't be shy, y'all can wave back, man\n\nI know y'all can't see me\n\nOh you got it?\n\n[ VERSE 1: Talib Kweli ]\nTalib Kweli ichiban in Japan is mush-mush\nYo, I'm able to keep it fresh like veggie tables and couscous\nGot my comp in a catch deuce-deuce\nLivin proof, you want the truth?\nNah, you can't handle the truth\nI flip it like any Angelo, be it Michael- or D'\nPaint the ceiling with my sounds, smoke trees with melodies\nI enter the palace with no malice intended\nIf l's make you cough a chalice is recommended\nParticularly filled with sticky that I got from Manny\nI'm breakin mics like Amy Fisher breakin a family\nIt can be, all so simple if you let it\nIf you don't want to, fuck it, forget it, yo, don't sweat it\nYou feel little\nWhen you let the power of the rhythm hit you\nWhite Widow got my eyes Chinese\nBut sharp as leaves\nOf paper cuttin your skin\nWhenever I write with my pen\nAnd make a point\nY'all be like, \"Yeah, that's the joint\"\nYo Matt, got the track on they DAT\nThat make it easy to complete\nCause I write shit with or without a beat\nSee you on the hook like a fish\nWe knock it out, no doubt, the shit fixed\nLike carols at Christmas\nSo bounce, come on, bounce, come on\nI lock you in my sentence and the shit's a run-on\n\nTokyo, where you at?\nBrooklyn, where you at?\n\n[ Hook ]\nKweli next to be up, so I suggest you re-up\nOr freeze up like you hear a shot\nNow I can trace the tracks of all the teardrops\nOf every single MC in earshot\nI fear not or none, number one\nIchiban, none, number one, ichiban\n\n[ VERSE 2: Talib Kweli ]\nI get my camouflage from Weiss/Mahoney\nMy rhymes are worth the price of Sony\nYour light like last for one minute like Rice-A-Roni\nSon, I'm nice, you're phoney\nIt seems all you want in life's to know me\nI'm colder than when the ground's covered with ice and it's snowy\nOne and only Talib Kweli from Eternal Reflect\nYo, I come to Tokyo where everything is Hi-Tek\nSo I feel right at home, rightin poems, fightin clones\nWho bite my own style cause they ain't got one\nI got drive while you ride shotgun\nPlease stop, son\nI watch _Get on the Bus_ a lot\nAnd all this shabuya has got to stop\nI'm just playin, Japanese culture is like amazin\nAnimation is like hair-raisin\nKick selection got no limit\nEatin seaweed, maybe one day I get with it\nBut when I see weed I'm smokin\nHeh, I'm just jokin\nReally not though\nMy homie Common told me, \"Arigato\"\nMy art got no\nBoundaries like Pablo Picasso\nWho? You don't know, you never knew\nBig up to Ru\nSee you in the show on the Avenue\nOf the Americas\nEtcetera, etcetera\nYou get the point, you want hot shit, I got a plethora\nClassics, it's the best of\nBrooklyn, New York City\nSo we're never comin shitty\nI get more love in Japan than _Hello Kitty_\nSuch a pity, these MC's think they hangin with me\nCatch me on Japanese MTV with Mos Diddy\n\n[ Hook ]\nKweli is next to be up, so I suggest you re-up\nOr freeze up like you hear shots\nNow I can trace the tracks of all the teardrops\nOf every single MC in earshot\nI fear not or none, number one\nIchiban, none, number one, ichiban\nNone, number one, ichbinan, no-no-no-no-no...\n\nHere we go, one, two, come on\nHere we go, one, two, come on\nYo, I'm out\nPeace"}], "artist": "Talib Kweli"}