{"artist": "60 Second Assassin", "songs": [{"title": "Dead Flowers Pt. 2", "album": "Remarkable Timing", "year": null, "lyrics": "[Intro: 60 Second Assassin]\nGirl you know you need to ride for me\n(You know in life it goes down)\nDo or die for me, that's that 60 Second talk (it goes down) real\nB.I.G. (it goes down)\n\n[Chorus x2: 60 Second Assassin]\nI want, you to\nWant me in the way I want you\nIf you don't, want me\nLet the doorknob hit you where the good Lord split you\n\n[Verse 1: 60 Second Assassin]\nLove is love, love'll get you when she's at it again\nAll the chit-chattering friend\nMay as well got me fried in the end, tried by twelve\nAnd carried by six, get with life on the back end\nA free man sometimes feels trapped in\nOpposed to getting paid and bringing all that money back in\nWe decided to get laid now child supports the back end\nI'm a defendant, who cares of a 16th amendment\nThey switched a game on a chicken, when you know\nI always wanted you to want me in the way I want you\n\n[Break: sample]\n\"'Cause the woman I was with...\"\n\n[Verse 2: C-Rayz Walz]\nWas not my reliable reflector \"She was\" a barnyard bird\nFlocking to the king for see neck to check up, yes sir\nThese treasures were undiscovered til the jewels dropped\nAn abused chickenhead in June\nSoon I felt like the used cock from tube socks\nAnd loose rocks, don't confuse plots\nA buckethead get back, I find that out after my Bing rap\nA dead flower something you never bring back\nA weak reflection of the G. I O.D. to ring that\nWith a super giving head, very battered bacon\nSwallowing my pride, a live prelude to her drinking\nLiving in a bottle like the line from Nickelback\nMy shots on the rocks, giving birth to an Apollo, triple that\n\n[Break: sample]\n\"'Cause the woman I was with...\"\n\n[Verse 3: Bronze Nazareth]\nCivil when she model, but she really a silverback\nI seen her peel for stacks, built from dreams and dealing million blacks\nBuilding stacks towards endless comas, I've been with honey over\nGripped this bitch by the shoulder, sipping Goose from crack money\nAwaits track with the clip fully, loaded, never slip, homey\nDefinition of sleeping it, never did fit for me\nFiends scurry, tapping windows urgently, she cutting rocks like surgery\nI'm busting nuts, burn your everglades while she serve the fiends\nSimply devilish and horny\nStill I'm blown, exploring your globe, won't love you in the morning\nShe performing junk exposed, bent on the stripper pole\nSipped the milk and tilt the robes, silks around the things that glow\n\n[Break: sample]\n\"'Cause the woman I was with...\"\n\n[Verse 4: C-Rayz Walz]\nAnd I did it, you got me\nI ain't trying to get you back, slow mo for the bobo\nWhen she broke, pocked the willie lac'\nAnd when we smoked alone, yo, the hoe broke the Philly yac'\nJack Tripper, gave weight to max out, that figures\nWas the messenger chef, Malcolm X got a fresh plate\nThe good times rolling like credits on a sex tape, strolling\nOn the same page frame, I remain a different book\nSaying broken hearts stay dead eyes lead, where it look\nOracle from the judge wise words fed me, slit me, yo\nHe was it, tricks in the image of the likeness Miss Cleo\nAnd the woman I was with, could never be you\nJust another part of me, fooled everything else is see through, mami\n\n[Break: sample]\n\"'Cause the woman I was with...\"\n\n[Verse 5: 60 Second Assassin]\nAnd sees the knowledge of a fool\nIs the wisdom of a dead man, church out, take you to school\nWhy they poison the rules?\nBut you don't hear me, yo, they wanna steal my crew\nIn the beginning, they used to call me boo\nAll I'm hearing through the grapevine is fuck that dude\nDamn girl, that was low\nWhat the fuck and who came to visit you, Aunt Flow?\nTake that rag off and act like you know\nNo one's hurt but the babies and more\nNo one's hurt but the babies, anymore?\n\n[Chorus x2: 60 Second Assassin]\nI want, you to\nWant me in the way I want you\nIf you don't, want me\nLet the doorknob hit you where the good Lord split you", "image": "https://images.genius.com/1d2892cda7088abed9797fd13ab159e5.500x500x1.jpg"}]}