{"songs": [{"image": "https://images.genius.com/fc0efc40fe64e2a53833f9c48a1ef578.1000x1000x1.jpg", "title": "Green Lights", "album": "Perception", "year": "2017-08-18", "lyrics": "[Verse 1]\nYeah (haha)\nMy name buzzin', ain't no way you could ignore it\nI did not come this far so they could ignore me\nI am not the one to say, \"I'll do it in the mornin'\"\nI'd rather get it done, don't focus on what's not important\nThey try to talk to me like they been nothin' but supportive\nAppreciate the love, but do not show up on my doorstep\nIf you ain't about that real, I suggest that you avoid me\nIf we ain't on the same page, that's the end of story, agh!\nYou are not a baller 'cause your closet's full of Jordan's\nYou are not a rich man 'cause you're on the Forbes list\nFirst, I drop the record, then you know I gotta tour it\nReal's still the slogan, only difference is there's more of us\nThe story of my life feels like it's just beginnin' now\nI ask you a question, I want answers, not the run-around\nYou the one that brought it up, but I'm the one to shut it down\nIf you ain't got the album yet, I brought you one, I'm at your house\nHey!\n\n[Chorus]\nAll I see is green lights (woo!)\nAll I see is green lights (oh yeah!)\nAll I spit is real life (yeah!)\nBet you don't know what that's like (huh?)\nAll I see is green lights (yeah!), woo!\nAll I see is green lights, (woo!), yeah\nAll I spit is real life\nI bet you don't know what that's like\n\n[Verse 2]\nYeah\nI know where I'm goin', I don't let no one distract me\nI don't need directions from nobody in the back seat\nI don't need these people in my corner tryna gas me\nI'd rather have people in my corner tryna check me\nYeah, I walk off the bus a different city than the last week\nLet the fans speak, they gon' tell you 'bout the past me\nIf I'm bein' honest, last year I was in a bad place\nWouldn't say I'm out of it, but don't feel like I can't be, agh!\nWho you know droppin' clean records, but they nasty?\nI was made for this, I could tell when Mama had me\nI hopped right off the table, told my doctor, \"I ain't average.\"\nHe asked me, \"What does that mean?\"\nI told him, \"Get the pen and pad, please.\"\nWho'd a known I'd write something that could change lives?\nI don't think y'all fully understand the way you changed mine\nI look at the future that's in front of me with both eyes\nThree records, three years, I don't like to waste time\nOh yeah!\n\n[Chorus]\nAll I see is green lights, yeah! (woo!)\nAll I see is green lights, haha!\nAll I spit is real life (real life)\nBet you don't know what that's like (you don't know!)\nAll I see is green lights (green lights), woo!\nAll I see is green lights (green lights—haha), yeah!\nAll I spit is real life (oh, real life!)\nI bet you don't know what that's like (no!)\n\n[Outro]\nHey!\nHaha!\nAll I see is—green lights!\nYeah!\nOh my!\nYeah! (haha)"}], "artist": "NF"}