{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro: Wrekonize]\nLet's go back to church, you ever get that feeling?\nThat you're not alone? Yeah, yeah I get that too\nWait, actually, I got some friends with me right now\n\n[Verse 1: Co$$]\nYo, from ash to ass to dust\nThey dollar be they pope they praisin'\nDope and I'm like 'Nope' so they callin' me blasphemous\nFuck that ignorant, they want me to show my ass\nIf you got Eminem's complexion some - nuckers (?) turn to slaves\nGod bless your soul nah, God curse you spirit\nComin' with that Jew shit fear this\nStompin' on these niggas toes, FE FI FO\nThe industry got niggas chemically imbalanced\nYou don't need no talent these days\nJust somebody that you know - in the game\nBut I'mma put some hurt - in ya frame\nWith the rhythm cleat you know I'm kickin' dirt. on ya name\nI'm the realest me you niggas fake and front what ya playin'?\nOr you could beek another gain some image in exchange\nFor some fame, take his name\nClaim you doin' what he did\nFuck the truth, if it's gon' get you paid\nYou gon' slang them fears to them kids\nTell me, who slang rock?\nWho shootin' at them niggas on the block\nWho pistol cocked?\nYou's a mixture of that 'Pac and that pot that you be puffin'\nI keep it movin' like the hands on the Doomsday clock\nI got's to keep my mental focus on the top\nCause the minute that you slip, the next minute yo shit flop\nAnd forgot, like, \"Who was that Co$$? I can't recall\", cause\nMost these niggas shootin' for stars, they aim is off, get\nCovered then, smothered by famous they frame resolve\nIn the scripture those who turn to Saul, became the sought\nDumb nucker, we so called mens we thumb-suckers\nWhen we starin' in the eyes of the storm, become wind\nYeah, in a game where some win\nSome sell they soul to be on what we on but we gone\n\n[Hook: Wrekonize]\nShake limits and take it to fake gimmicks\nEven create image, shit do what you must to break ground\nI'm in it for great livin', the fannin' and great givin'\nMan my kingdom was made to break ground\nTo break ground, to break ground, to break grou-ah-ah-ound\nTo break ground, to break ground, to break grou-ah-ah-ound\n\n[Verse 2: Akrobatik]\nI break ground like earthquakes, sledgehammers\nLivin' on the edge, man I been rotted\nSame time true melodic, (Who the hottest?)\nAkrobatik, Wrekonize, Ruthless artists\nLadies taste the blue exotic, 'Bartender, two hypnotics'\nOur crew demolish while you lookin' for some shoes to polish\nToo cool for college so I hit the streets to do my knowledge\nYou fuck around and catch a group of brolic brothers standin'\nTroop asylum ready to get super violent lyrical\nBazookas wildin', with the fuckin' force to nuke a island\nYou ain't sayin' shit unless it's some'n you can do for my kin\nMy crew supplyin' all that shit you love when you get high and\nPass the L around and lift your mind state, to the sky and\nLevitate, for a minute, meditate, while I spit it\nTo be great, I'm committed, so I take it to the limit and beyond\nThis shit that I'm on got the whole planet trippin' love\nThat's why I'm always gone I break ground\n\n[Verse 3: Ras Kass]\nSam Speed told y'all, think you better Wrekonize\nY'all heroes jump off the roof, I respect The Other Guys\nCheck my pulse it's pumpin' BP\nLeakin' on the Gulf I clean it up just hook me to a IV\nSee me like a construction work, a construction Tim's hard hat\nBuildin' like a master mason\nI will serve a God that, bag of chips I'm all that\nStandin' on a scaffold made of dead rappers\nGood Native American pussy is red snapper\nSon, y'all niggas is big dummies I'm Fred Sanford\nThis goes out to Tampa, Orlando, Miami\nSan Diego, Oakland, Los Angeles County\nAllow me to move dirt, like the Sandman\nCrack the earth to proportions of the Grand Canyon\nDamn y'all stand under unstable tables of foundation\nCan't comprehend? I'm ground breakin'\n\n[Hook]\n\n[Verse 4: Rudi Goblen]\nThe monkey's out the bottle\nSo I spit-shine my own light bulb, then cover ya back\nCause epiphanies to follow\nMe to put a knife in the fan and apply planning\nSee a man that can't stand is a man that can't land it\nSo where ya guts at, you stutter and stumbling\nYou need stuff your stories in a sack and set your pace back\nAvoid the void from coming, you running yo shit is bubbling\nI plummet and push the pedal palm the problems in the ground beef\nI'll be, THAT vagabond out in South Beach\nScreamin' \"I'm gon' make it!\" 'til my motherfucking lungs bleed\nPardon me mister, I got a press packet pistol\nThat I'll shoot ya with\nWhen I write the right for my stage life\nHow many people know G? Well I know that I don't give a butt\nCause I'm fuckin' luck until it owes me\nSee I'm a Flipside King drinking Crown, clown\nThose who oppose it gettin' stuck if they don't bow down\n\n[Verse 5: Saheed]\nThis is ground breakin', I leave the town shakin'\nYou don't never hear 'bout Saheed sittin' 'round waitin'\nI gotta take it I'm tired of bein' patient\nRun up in the station tell the DJ play dis so everybody's gettin'\nSPRAYED, I'm tryna' get PAID, cause brother I be\nBangin' out classics everyday\nRock on top of beats and break the foundation where you lay\nI swear to God the strength is right there upon the stage\nWhen I'm there\nThe competition here that's sayin', \"This is not fair!\"\nFuck you, you should call this filterin' the top tier\nYo I be wreckin' mics and breakin' ground with Wrekonize\nI pick the best of everything and put the rest aside\nI get my blessings right, cause I'm in this for great livin'\nNew Year's resolution was to be on top by Thanksgiving\nYou should be thankful you'll be safe 'til November now\nRearrange your agenda or leave this place in a stretcher\n\n[Interlude]\n(What in the hell are they waiting for?)\nI ain't think we'd have time for this, but uh\nFuck it\n\n[Verse 6: Wrekonize]\nMy song's tellin' me to take cover and y'all\nBetter be ready to brawl, enemies heavenly fall\nWhether we rock the spot, or not, the Embassy\nHas got you online searchin' for pop like Tron Legacy\nI'm schizophrenic with career goals\nI'd like to show you what the fuck I'm talkin' 'bout\nGot time? Well here goes\nTook it from Madeline to rockin' out with Cash Money\nMakin' some Strange Music who's to take that from me?\nI'd like to see them claim they're that hungry\nI see 'em in their whips, waitin' for hits\nLike fuckin' crash dummies\nI walk the planet underhanded but I'm overjoyed\nTo walk towards the light excited, I'm a solar droid\nI'll make the sound smirk underneath the clown shirt\nJugglin' the clown jerk, you got a life and found worth\nI got millennia to take you through the outskirts\nBut that's a job I'll gladly accept, cause that's my groundwork", "title": "Groundwork (Remix)", "year": null, "album": null, "image": "https://images.genius.com/c714b196bcc8378c9e57d2328f2b237d.1000x1000x1.jpg"}]}