{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "On Your Mind", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Chorus: Jagged Edge]\nI know you got a man at home (at home)\nDon't go and do nothin' crazy\nYou ain't gotta make a move\nBaby, let me put this on your mind!\nI know you got a man at home (at home!)\nBut think about this here for later (later!)\nYou ain't gotta make a move\nBaby, let me put this on your mind!\nLet me put this, let me put this\nLet me put this on your mind!\n\n\n[Verse 1: Pimp C:]\nGet down girl, just like Pharrell sizzaid\nCheat on ya man ma, that's how you get ahizzhea\"\nI ain't tryna lock ya down and take ya time (take ya time)\nI'm just tryna put this dick off in ya mind (mind)\nGo hit ya spine like a Viking supposed to\nKeep ya nigga in ya life or let a young nigga mold you\nWe stayin' prayed of paper, the ammunition for the devil\nGetting our blessings, goin' to that other level (level)\nBet these niggas can't get it, can't see\nCan't touch it, can't read, cause them niggas ain't me\nAnd girl I don't dream, everythang come true\nThese hoes tryna choose me, but bitch I'm tryna fuck with you\n(I'm tryna fuck with you!)\n\n\n[Chorus]\n\n[Verse 2: Big Zak:]\nShe gotta nigga at home? Of course you do\nCause if ya didn't, I'd think somethin' was wrong with you\nI can't see a nigga splitting up, divorcing you\nYou hot like cayenne, proportion you\nNah image is everythang, time is money\nLet me beat right quick and skeet on yo' tummy\nChill up a shot of Patron, roll a blunt of the kush\nI'm kinda old school, still like hair on the puss\nNow he's yo' provider, pays the bills\nAnd me? I provide dick hard as steel\nFor my last birthday she arranged a menage\nAnd graduated from the drive-way to the garage\nHa!\n\n[Chorus]\n\n[Verse 3: Ali]\nNow you can catch me sippin' somethin' with a cork in a bottle\nSmokin bad on that purp or the fourth with a model\nI don't party much, when I do I blow through it\nI confess, I talk about it more than I do it\nI'm the vacation type, white ostrich Bugatti\nOn the beach with a young Chevy Belle Afonte\nNo P.O., no court, no Glock\nBought these mainly, fresh purr, no socks\n\n[Verse 4: Gipp]\nGipp rollin in a candy Jeep G-50\nOn the weekend it's the LS 460\nOverseas, steering wheel on the right side\nAnd you wouldn't believe that that's a seven forty-five\nWhere you goin'? What it is? What's ya name?\nESP jeans and hardly true religion on her man (hey!)\nTryna fill corners, make some more chips\nDrive a few whips, old school chrome lips\nFlown through the park, dippin' downtown\nFour-door Cruiser with the top break down (down!)\nFloors and the walls all oak on the private coach\nAnd we all gon' let it burn on the \"Love Boat\"\n\n[Chorus: w/ variations]\n\n[Outro]\nPimp C, UGK for life man!\nThat's my nigga right there!\nFo' shizzle, dizzle! Back on the streets, Daddy!\nThe Pimpalation man! Right here, live in person man!\nFenzel Washington, it's Pimpin in Motion man!\nP.I.M you undersmell that?\nYeah, we doin' it real big man!\nJazze Pha, Pimp C, Jagged Edge, Big Zak, Gipp & Ali\nWhoa boy! Masterly coordinated!\nOoooweee\n\n[Chorus]", "year": "2006-07-11"}]}