{"songs": [{"image": "https://images.genius.com/bcca9edec0a4b1e16879fe0cab0dc68b.220x221x1.jpg", "title": "Flap Your Wings", "album": "Sweat", "year": "2004-07-17", "lyrics": "[Hook x2: Nelly & Pharrell]\nDrop down and get your eagle on girl\nFlap your wings\nDrop down and get your eagle on girl\nFlap your wings\nHell naw, ain't leaving me alone girl\nFlap your wings\nDrop down and get your eagle on girl\nFlap your wings\n\n[Bridge: Pharrell & Vanessa Marquez & (Nelly)]\n(She's got that!) Sweat dripping all over her body\nDo you like that sweat dripping all over my body?\n(Oh! Oh! Yeah I like that) Sweat dripping all over yo body\nYou like that sweat dripping all over my body\n\n[Verse 1: Nelly]\nIt's summertime and I'm back again\nThen went to VA yo and got my friends\nSay wassup, Pharrell! (These motherfuckers, now)\nYeah! But let's show em what's above an L, BLING!\n100 thou' couldn't get ya one of these\nI guarantee there ain't a flaw in one of these\n200 thou' couldn't get you in the league\nAnd 300 thou' you couldn't even buy the keys\nI think ya need to add 50 more G's\nNow shall I proceed?! (yes indeed!)\nHo! I need to see ya take it down to the floor\nSpread your wings if you're real ma, fly real low\nPause for a second ma, grind real slow\nAnd if you do it right Rodeo we'll go\nHo! I talk a lil Fred Siegel girl\nBonnie and Judy Lee but when she bad call Vida Guerra\nApple bottom wit a pearl underneath it\nYou talking like you don't need it, I can tell ya conceded\nI like that in you, I don't see nothing wrong\nDrop down and get your eagle on, whoa!\n\n[Hook x2]\n\n[Bridge: Pharrell & Vanessa Marquez & (Nelly)]\n(She's got that!) Sweat dripping all over her body\nDo you like that sweat dripping all over my body?\n(Oh! Oh! Yeah I like that) Sweat dripping all over yo body\nYou like that sweat dripping all over my body\n\n[Verse 2: Nelly]\nNow what's next, the trend sin up in this party\nO.P.P. time, now let's get naughty\nYou take baby girl and I'mma take shorty\nWith the sweat dripping all over her body\nWe gon' move if you wanna (oh!) groove if you wanna (oh!)\nFly ya north up ma and get rude if you wanna\nAin't got nothing to lose nor to prove\nBaby girl soaking like she just got up out the pool, eh!\nI know you're thirsty ma, go 'head and order what you want\nSome call it tricking, go 'head call it what you want\nI came to ball, I ain't come out here to front\nCause the black card'll pickup what the grey card won't\nHer attractiveness, got me attacking this\nOh so fabulous! Booty is maximus!\nShe wanna fly south for the winter\nI might just go down south just to win her\nHell naw she ain't gon leave me alone\nMaking plans for us to be at home\nTake your pants off ma, you can leave your panties on\nBut first drop down and get your eagle on, whoa!\n\n[Hook x2]\n\n[Bridge: Pharrell & Vanessa Marquez & (Nelly)]\n(She's got that!) Sweat dripping all over her body\nDo you like that sweat dripping all over my body?\n(Oh! Oh! Yeah I like that) Sweat dripping all over yo body\nYou like that sweat dripping all over my body\n\n[Bridge - Nelly]\nFrom the girls wit skinny waists to girls heavy set\nC'mon flap your wings, c'mon flap your wings\nTo the girls wit extensions to the girls wit dreads\nC'mon flap your wings, c'mon flap your wings\nFrom the girls got it good living in the suburbs\nC'mon flap your wings, c'mon flap your wings\nTo the ones in the ghetto wit their hands on their curves\nC'mon flap your wings, c'mon flap your wings, OH!\n\n[Hook x2]"}], "artist": "Nelly"}