{"songs": [{"year": "2016-06-10", "image": "https://images.genius.com/ecb75684bd795ef2eaf0b2bfea991ad7.500x500x1.jpg", "title": "No Chorus, Pt. 6", "album": "Who Am I", "lyrics": "[Intro]\nPlug just came with the pack so fat that a nigga might gon' and hit 'em with the ugh\nNigga diss the block, wait a minute\nForty with the lemon, hit your body, make a nigga do the fool\nThis kush right here in a minute\nOG gas, make a nigga cough off first pull\nMy clip got a lil too mini\nOne up in the head, I don't give a fuck if the bitch full\nTay Keith produced it\nNot one, not two, not three, not four, not five, six\n\n[Verse]\nC'mon, I'ma keep goin' like a run-on\nPussy ass nigga diss the block so he got his ass run on\nNow he like hold on\nGrabbin' on his eye, reachin' for someone to hold on\nI don't think he smell me so I shot him in the nose bone\nGot the bitch naked so I told her put her clothes on\nBlocBoy south beach, lookin' like a walkin' sno-cone\nNo Big Tymer but I told her get your roll on (crip)\nTouch his ass up like an iPhone\nFetty Wap him, now his eye gon'\nHead knock him, taste like Betty Crocker\nI'ma give you an F like I'm Denzel Crocker\nI got that word like a fuckin' lager\nKeep that strap and your bitch right by my boxers\nIf you ain't talkin' money then don't bother\nLike Shnitzel, all I hear is Rada Rada\nAll this money, can't give a bitch a penny\nI would never change, you can keep them pennies\nSmack a broke nigga, what you thought was with them pennies\nHow many knifes you got? many many many\nClip hangin' out, it's extended-stended-stended\nWalk around like a motherfuckin' zombie\nBig ass motherfuckin' chopper on me\nPosted in the jungle rockin' down dundee\nYou can say things got wild quickly\nWhen he came at me talkin' too foul quickly\nI gave him this shot, I ain't talkin' whiskey\nNow he fallin' on the ground like he was tipsy\nHustle hustle hustle, man I feel like Nipsey\nI'ma pull a drive by on a ten speed\nThree live, smokin' three five with your bitch\nAnd you know she three high, finna get fucked by three guys\nHold on, I ain't finna stop\nAin't nobody cleanin' but we comin' with the mops\nTreat you like [?], bro we bustin' at his top (doon-doon-doon)\nYou can jumped like a motherfuckin' hop (doon-doon-doon)\nBitch tried to set me up, got her ass shot\nSavin' these hoes, nigga you a Robocop\nPolice in the store, servin' in the parking lot\nAnd my gun in your face, would you give me what you got?\nPull up on an opp like pow\nIt's a man down, somebody done shot up the crowd\nNigga say he smokin' on loud, but that shit mild\nI can't hear the shit right now (that's on my mama)\nI got your main boo wasted, my dick she can taste it\nIt's in the bitch mouth like some braces (she suck me)\nIf I spray, my whole crew sprayin'\nWhat is you sayin'? have you flyin' with the birds, toucan\nBeam me like I had a laser (laser)\nRarely eat, just had the blazers (I'm fresh as a motherfucker)\nPut a hole in you, no bagel\nBitch I been ballin' on 'em like the Pacers (swish)\nMy chain and my ear they is glistening (word)\nLike damn, look at my wrist again (damn)\nMy chain need a Pamper, it's pissin' (woo)\nI cannot go like this\nI will not show my glizzy, I take it on the road every city (word)\nI just threw fifty bows to the city\nAnd called up lil Mishio to come get it (that is my nigga)\nNo OKC but I'm posted with thunder\nPay, Feezy, and Doolie, my young fuckin' gunners\nThey shot a nigga through a goal like a punter\nI fuck her and don't let her smoke on my ganja (can't hit this blunt)\nPlug just came with the pack so fat that a nigga might gon' and hit 'em with the ugh\nNigga diss the block, wait a minute\nForty with the lemon, hit your body, make a nigga do the fool\nThis kush right here in a minute\nOG gas, make a nigga cough off first pull\nMy clip got a lil too mini\nOne up in the head, I don't give a fuck if the bitch full\nNiggas think they killer, is it 'cause the weed and liquor? (I think so)\nFuck your bitch and squeeze her nipples (bankroll)\nShe suck my dick until it tickles (word)\nGas blunt, I'm facin' it (gas, gas)\nNever put my face in it (never)\nYour main bitch is takin' dick (woo)\nI told her put her waist in it\nHigh as a motherfuckin' fool (fool)\nSlice your ass up like a pool (word)\nI could've bought five pair of Robins but really said fuck this shit, copped me some Trues (Trues)\nJordan logo on my shoes (J'ed up)\nAll my dogs Scooby Doo (dogs)\nNo U-Haul, we on the moon\nMy nigga Lil Jayden and Rico came through (what it do young nigga?)\nFeelin' like I'm bulletproof\nGot niggas that'll snuff your ass off of the roof\nI talked her and left her, you wife her, good medic\nI told her to dunk 'em like an alley-oop\nJustin, Aston, CJ, nigga that's my crew\nCan't forget about Pierre and NuNu\nThese niggas they fake like a motherfuckin' screw\nMake they ass disappear like poof\n\n[Outro]\nWhere they at though? where they at though?\nWhere they at, where they at, where they at though?\nWhere they at though? where they at though?\nWhere they at, where they at, where they at though?\nI'ma smoke a nigga's ass like crack smoke\nI don't even gotta smoke crack though\nI don't even do none of that shit\nSmokin' on that gas, make a nigga do a backflip\nOoh, I'm too high"}], "artist": "BlocBoy JB"}