{"songs": [{"year": "2016-11-04", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "Do Better", "album": "H.O.G.", "lyrics": "[Intro: Krizz Kaliko]\nYeah this that old school dope house music hear boy\nPaul Wall, Big Boog, Big scoob, and Kali Baby\n\n[Verse 1: Paul Wall]\nWhat would I do besides grind for them paper stacks?\nThat's the only way i know to get a Cadillac\nSee, I refuse to live this life broke another day\nAll I know is hard work accumulating pay\nA never ending saga this the true hustler's ballet\nI done tossed more blue cheese than a cobb salad\nThat paper calling me I answer on the first ring\nChampionship work ethic, tryna chase a ring\nThey told me I would never make it but I didn't listen\nIt ain't my fault that they failed to see God's vision\nWorldwide globe-trotter, stacking up commission\nAnd if I knew better, I'd do better please pray for wisdom\n\n[Hook: Krizz Kaliko]\nSomebody better pray for me and where I'm at\nDon't know when I leave, if I'm comin' back\nAnd if I knew better (If I knew)\nI would do better (What would I do?)\nAnd If I ever try to lead this life alone\nWherever I go, the street's is still my home\nSee, if I knew better (If I knew)\nWhat I would do better (What would I do?)\nWhat would I do?\n\n[Verse 2: Boogieman]\nI should've knew better\nOutta place like me with a blue sweater\nIn a place where the funny nigga moves his treasure\nI was pushin' fireworks in cool weather\nBig Boog tougher than boot and leather\nBut a fucked up move makes moves lesser\nI was in it for them bands with the grams measure\nGot fucked up dealing with a cool jeffer\nBut that's my fault\nBehind enemy lines I'm gettin' work off\nBitches toast, head hard or soft?\nAnd I'm flamed up talkin' that turf talk\nThey was comin' for me, couldn't stand that\nThe two spots upstairs, I ran that\nHad foots in Elivs, they sent us helpers\nWe movin' metals couldn't plan that\nBut I man the station despite the hatin'\nNo fabrication in this conversation\nBoogie blazin', a trail of greatness\nNo time for patience, that's time wasted\nGood gracious, my good race and them fiends chasin' that fire blood\nBold statement, I rocked, skated, and bounced the products on my blood\n\n[Hook: Krizz Kaliko]\nSomebody better pray for me and where I'm at\nDon't know when I leave, if I'm comin' back\nAnd if I knew better (If I knew)\nI would do better (What would I do?)\nAnd If I ever try to lead this life alone\nWherever I go, the street's is still my home\nSee, if I knew better (If I knew)\nWhat I would do better (What would I do?)\nWhat would I do?\n\n[Verse 3: Big Scoob]\nSearchin', lost, let me slide in the sauce\nLivin' like the heater huntin' freedom, but it costs\nSeekin' out the preacher, but the preacher teachin' false\nMay be on my feet, now I'm creepin' through the moss\nHoping I ain't lost, man, time can't be bought\nSo it's tickin' and it's tickin' and I'm try'na turn it off\nAin't dreams on the cross cause they seem to get lost\nAny schemes to be boast? Any greed will exhaust\nAnd I'm muh'fuckin' tired, I ain't muh'fuckin' lyin\nWhen I'm muh'fuckin' dyin', better muh'fuckin' grind\nAnd it's all bull time, I ain't try'na waste mine\nSo I scratch off the line that wasn't built for the pine\nSo I push a hard line on these bitches all the time\nI'll treat you like a bitch, nigga, and beat you from behind\nI'ma keep you lookin' fine, I'ma keep you wined and dined\nNot a pimp, I'm a pusher, I'm a creature of the grind\nI'm a block boy with a life tied to a scale\nBuilt to excel, can't hear the word fail\nI'ma savage for the cabbage, I'm to greedy for the kale\nAnd I always work a package like I'm workin' for the mail\nBarely missing jail, life lost to a cell\nBut I'd rather be in prison than be wallowing in Hell\nPray to God for a different route, open up and let me out\nDreams of a dreamer, realistic, I ain't gettin' out..\n\n[Hook: Krizz Kaliko]\nSomebody better pray for me and where I'm at\nDon't know when I leave, if I'm comin' back\nAnd if I knew better (If I knew)\nI would do better (What would I do?)\nAnd If I ever try to lead this life alone\nWherever I go, the street's is still my home\nSee, if I knew better (If I knew)\nWhat I would do better (What would I do?)\nWhat would I do?"}], "artist": "Big Scoob"}