{"artist": "C-Rayz Walz", "songs": [{"title": "Rhyme Doublin’ (Clean)", "album": "Classic / Rhyme Doublin’ & A Bonus", "year": "2002-06-14", "image": "https://images.genius.com/31f0f9722ac8884f9a381226a030b02c.529x529x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nYo, what's down?  Yo, I'm concentrating on ignoring shit.  Know'm saying?  Yo, where you just coming back from not going?  Nah, nah, for real, you know what time it's not?  Yo, hypodermically inverted.  This is my man [?]\n\n[Verse 1: C-Rayz Walz]\nI'm not new to this—I'm true to this—fuck foolishness!\nThe buddha mist got you pussies open like a uterus\nSo strange and plain like thought without the brain\nFire without the flame, mad tracks without the train\nSo what's the dell?  (What?)  Oh, I mean, \"What's the deal?\"\nOr tell me how you felt—better yet, how you feel\nI'm hot and cold, old—at the same time, classic\nEatin' so much hot sauce, I piss acid and burn bastards\nOn purpose, I invert this\nDeep but still can't get past the surface\nI'm worshipped—still, in all, I'm worthless\nI'm so rich, I'm broke bitch—now quote this\nYou could be Janet Jackson or Janet Jackme\nBut all a ho can ask me is \"What time is it daddy?\"\nYou couldn't go One D if this was D One\nSee, son?  I fight evil gins—fuck Seagram (Seagram)\n\n[Hook: C-Rayz Walz] (x2)\nRhyme doublin', Swiss account bank bubblin'\nMy team huddlin', spit rounds—you start coverin'\nI'm for rumblin', jugglin', shine mine\nHustlin' when adrenaline going out just to get in\n\n[Verse 2: C-Rayz Walz]\nI'm surrounded by the earth cause I'm shinin' son\nWhen I see a knife I'm like, \"Yeah, aight.  Where's the gun?\"\nYou say, \"Take a walk to the store.\"  I start to run\nGoin' straight to the top—\"understand where I'm comin' from?\"\nI'm soon to bust—oh, I mean, \"soon to burst\"\nSearch the universe.  My verse like the black hole's outskirts\nI'm so perfect—at the same time, worthless\nEyeing the prize—when I get it, will I deserve it?\nRights of passage versus knights of savage\nDark damp rusty nails with clamps to the amp\nNo return once you in it\nOrange juice flow Maid in a Minute\nWalk the head like hats in court\nBlast hip hop shots like gun sport\nAnd give 'nough thoughts to mad shit that never enter my mind\nQuickly taking my time\nWalking crooked in a straight line\nBroke the weak links and herded through the grape vine\n\n[Hook: C-Rayz Walz] (x2)\nRhyme doublin', Swiss account bank bubblin'\nMy team huddlin', spit rounds—you start coverin'\nI'm for rumblin', jugglin', shine mine\nHustlin' when adrenaline going out just to get in\n\n[Verse 3: C-Rayz Walz]\nI'm the MC in the club that stole your Source magazine\nTook your tip from the bar and splashed the whole scene\nVisions of me fucking fat chicks on linguine\nNuttin' fast, flashed, then disappearing like a genie\nGet head from a midget, juggle six smoke bombs\nUnder the sprinkler system in the US Pentagon\nLike acid on pussy, I bubble skins\nI'm attracted to sisters with big lips and double chins\nTrouble ends when the pen hits the paper, then\nI'm in executive fashion like masturbation in a skyscraper\nMy tongue spit impact with more force than gun clips\nAll these lame niggas in the game yellin' they run shit\nFlows cross the border of combat and slaughter\nSo extreme, I could drown your whole team with a drop of water\n\n[Hook: C-Rayz Walz] (x2)\nRhyme doublin', Swiss account bank bubblin'\nMy team huddlin', spit rounds—you start coverin'\nI'm for rumblin', jugglin', shine mine\nHustlin' when adrenaline going out just to get in"}]}