{"artist": "Yella Beezy", "songs": [{"image": "https://images.genius.com/804d37ad67a4341db2d63125ad8c31a6.1000x1000x1.jpg", "year": "2018-11-16", "album": "Ain’t No Going Bacc", "lyrics": "[Intro]\nShun On Da-\nIt ain't my fault, ayy\nIt ain't my fault, ayy\nShun On Da Beat\n\n[Chorus]\nIt ain't my fault that I be flexin' on these niggas\n(It ain't my fault)\nIt ain't my fault I chase this bread instead of bitches\n(It ain't my fault)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault that your bitch wanna text a nigga\n(It ain't my fault)\nIt ain't my fault that we ain't got the same ambition\n(It ain't my fault)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault, ayy (Ayy)\n\n[Verse 1]\nNo, it ain't my fault\nI got sauce and I'm a boss\nI got raw, my southern drawl\nGot the lil' bitch panties comin' off\nI stole a pack and I go get it off\nWent and hid some pounds in my new loft\nKickin' this swag, boy, this shit drippin' off\nI do the dash and then I get lost\nSkrrt, huh, hoo, I'm gone\nDon't call my phone, you ain't tryna bone\nIt won't be long 'til I get on\nThat nigga ain't right so I did 'im wrong\nDoot-doot-doot-doot to your dome\nI- I- I spit the real and y'all niggas joke\nFuck how you feel, put that on my dome\nYou know I fucked that lil' bitch down 'til the morn'\nMy diamond, water, your bitch, water\nI might raw her, that's your daughter\nNever saw her, but I might call her\nShe bend over, look at her, hi, Mrs. Parker\nIf I serve this juice then it gotta be darker\nCan't cut with this blade, it gotta be sharper\nThe smell make me nauseous, I shoot at imposters\nMargiela, eatin' on noodles and pasta\n\n[Chorus]\nIt ain't my fault that I be flexin' on these niggas\n(It ain't my fault)\nIt ain't my fault I chase this bread instead of bitches\n(It ain't my fault)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault that your bitch wanna test a nigga\n(It ain't my fault)\nIt ain't my fault that we ain't got the same ambition\n(It ain't my fault)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault, ayy (Ayy)\n\n[Verse 2]\nAyy, we ain't got the same ambition\nNigga, we don't even fuck the same kind of bitches\nNigga, we ain't even got the same kind of vision\nCut from another cloth, we ain't the same kind of nigga\nI'm really ashamed of you niggas\nMake these ho feel special, how lame are you niggas?\nHell yeah, cuz, I'm blamin' you niggas\nBlow the bitch head up, now she thinkin' she bigger\nThe fuck is you thinkin', my nigga?\nGet in front the law and start singin', my nigga?\nAnd I really thought that they were dancin', my nigga?\nI'll fuck around and start blankin', my nigga\nWhat's up with them bangers, my nigga?\nPut your fingers up and start bangin', my nigga\nRep that shit, what you claimin', my nigga?\nIf they start trippin', let 'em rang out, my nigga (Ayy)\nYou know what crazy? (Crazy)\nA lot of these niggas, they tried to play me (Play me)\nDidn't think I would make it (Didn't think I would make it)\nBut now I'ma throw the shit up in their faces (Faces)\nPut that on my baby (Put that on my baby)\nI'ma shit on these niggas until God take me ('Til God take me)\nThe fuck is you sayin'? (Is you sayin'?)\nI'ma lick the plate then and then I'll scrape it, nigga\n\n[Chorus]\nIt ain't my fault that I be flexin' on these niggas\n(It ain't my fault)\nIt ain't my fault I chase this bread instead of bitches\n(It ain't my fault)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault that your bitch wanna text a nigga\n(It ain't my fault)\nIt ain't my fault that we ain't got the same ambition\n(It ain't my fault)\nIt ain't my fault, ayy (Ayy)\nIt ain't my fault, ayy (Ayy)\n\n[Outro]\nShun On Da-", "title": "It Ain’t My Fault"}]}