{"artist": "Aminé", "songs": [{"title": "CANTU", "album": "ONEPOINTFIVE", "year": "2018-08-15", "image": "https://images.genius.com/57a5f41f49c164e784bf0e43df5535af.640x640x1.jpg", "lyrics": "[Chorus]\nI got my head hangin' out the fuckin' window\nI got my head hangin' out the fuckin' window\nI keep my speakers ringin' on me like my cellphone\nI got them dreads, bussin' bussin'\n'Cause I might wanna let my hair down\nYeah, bitch I let my hair down\nYeah, I got them dreads swingin' 'round\nYeah, 'cause bitch I let my hair down (yeah yeah)\nI got 'em bussin', bussin', bussin', bussin' (hey)\n\n[Verse 1]\nWhite girl wanna touch it (yeah)\nI told her please don't touch me (no)\nShe said, \"Who the fuck is your stylist?\" (huh)\nI told that bitch, \"My cousin\" (yuh)\nRinsed out, picked out, Cantu in my hair (hey)\nLouis V like Virg (yuh), I'm Gucci down (brr! brr!)\nAtlanta for a week, gonna start to bumpin' Gunna (yah)\nFollies for the freaks, spent some racks because I wanna (hey)\nSolange said, \"Don't touch my hair, lil' nigga\" (oh no)\nSo I'm just here to pass the word lil' nigga (yuh)\n\n[Chorus]\nI got my head hanging out the fuckin' window (hey)\nI got my head hanging out the fuckin' window (that's right)\nI keep my speakers ringin' on me like my cellphone (she)\nI got them dreads, bussin' bussin'\n'Cause I might wanna let my hair down\nYeah, bitch I let my hair down (down)\nYeah, I got them dreads swingin' 'round\n(Swingin' 'round, swingin' 'round)\nYeah, 'cause bitch I let my hair down (yeah)\nI got 'em bussin', bussin', bussin', bussin'\n\n[Verse 2]\nIt's me, young Aminé, I pop off when you see me\nNo hiccups for my niggas, pass the mula like a relay (yeah)\nI'm in this motherfucker with my hair down low\nAnd that Becky wanna touch me\n'Cause she wanna come home (yeah)\nBitch I'm in my motherfuckin' bag, ho (in my bag)\nDon't ask me just to pet me 'cause you can't, ho\nDreadlock rocker with a certified bopper (true)\nJenny, Becky, and Samantha wanna touch me 'cause I'm handsome\n\n[Chorus]\nI got my head hanging out the fuckin' window (hey)\nI got my head hanging out the fuckin' window (that's right)\nI keep my speakers ringing on me like my cellphone (she)\nI got them dreads, bussin' bussin'\n'Cause I might wanna let my hair down (down)\nYeah, bitch I let my hair down (down)\nYeah, I got them dreads swingin' 'round\n(Swingin' 'round, swingin' 'round)\nYeah, 'cause bitch I let my hair down (yeah)\nI got 'em bussin', bussin', bussin', bussin'\n\n[Outro: Rickey Thompson]\nWho has nice hair? Me\nWho can touch my hair? Not you\nDid you think this was a petting zoo?\nDo I look like somebody's dog?\nDo I look like somebody's cow?\nDo I look like somebody's lamb? No!\nSit down!"}]}