{"songs": [{"year": null, "title": "Chart Climbin’", "image": "https://images.genius.com/5f7d8c693dab5b876262d1fd859d02b6.200x200x1.jpg", "lyrics": "[Sauce Money]\nMC rhymin..\n.. uhh uhh\nUhh, uh uh-uh-uh-uh-uh-uh-uh-uh\nMC, MC, M-A-R-C-Y\nUhh, uh..\n\nMC rhymin, chart climbin\nWith the baguettes, Roley shinin\nWe smokin the best trees, I bet some skins on it\nI got a SE, twenty inch rims on it\nI got playaz who wanna kill me but love to speak nigga\nCause I got a freak every day of the week\nThey just fake friends, they hope the shit ends (fuck you)\nThey see the dough my click spend in the big Benz\nThey think it's sweet, now we rock cubans with diamonds in em\nBut if they sleep (what?) hell is where I'mma send em\nI know it's beef cause I don't wanna be rhymin wit em\nThey wanna act like BITCHES, time to split em\nWhat the deal Ma? Heard I was boss ha?\nOn the real, wanna hear it from the Sauce ha?\nYou like the way I do it? I just gotta spit\nI got flow doughs hoes and a lot of hits\n\nChorus: Sauce Money (repeat 4X)\n\nMC rhymin, chart climbin\nTogether we talk the talk, forever we walk the walk\n\n[Sauce Money]\nIn the trial my niggas'll squeeze for the general\nMP's holdin my heat, nigga run wild\nI dial, executioners, go the extra mile\nNigga cock that, lose a screw when it pop black\nNever provoke toast, niggas get ghost most\nYou couldn't be my family, we never spoke close\nYou spit that \"yo\" shit, I say \"nosotros\"\nDon't fuck with them dudes, think them niggas homos\nI'm talkin the bad bitches, you on some funny shit\nYou go for broke? I go for gettin money kid\nI grab your homebase, now she give new honey head\nTo all you Donnie Brasco's, I'm Sonny Red\nI split a weak nigga cheek quick, with one of those\nFuck a physique wrapped tighter than mummy clothes\nOff looks alone probably get to touch em all light\nBut because of the flow, now I fuck em all night\n\nChorus\n\n[Sauce Money]\nYou like dough baby? Work hard and you can get that\nBut in the meantime, let me hit that\nGet you down on all fours, like a Kit-Kat\nI'm tryin to split that, shouldn'ta did that\nIn and out with the quickness now what could make the brother stop?\nNothin, well maybe if the rubber pop\nAnd even then that might not slow me down\nI'm bout to go to town, wanna come? Show me now\nSingular most MC's bringin your toast\nI run roughshod rip rap stars and roast\nI don't brag or boast, I only speak in facts\nAnd if I say you seven days, how weak/week is that?\nFatal to niggas that's unable to ride wit me\nYou better decide who side or collide wit me\nThe very last rapper tragically he died swiftly\nYou been warned motherfuckers, now come and get me\n\nChorus\n\n[Sauce Money]\nMC..\nTogether we talk the talk, forever we walk the walk (4X)", "album": "3 Strikes (Original Motion Picture Soundtrack)"}], "artist": "Sauce Money"}