{"artist": "IDK", "songs": [{"title": "Michael What TF", "lyrics": "[Chorus]\nI aim my pistol at your heart\n(Back on my bullshit, Michael what?)\nThat's how I know it's really beating\n(Back on my bullshit, Michael what? Back on my bullshit, Michael what?)\nI was your band-aid at the start\n(I'm back on my bullshit, Michael what? Back on my bullshit, Michael what?)\nBut now I'd rather see you bleeding\n(I'm back on my bullshit, Michael what? Back on my bullshit, Michael wh—)\n\n[Verse 1]\nBack on my bullshit\nPull up on you, white Beamer, that's Cool Whip\nBitches seem him, they screaming, they drool quick\nColosseums, I see 'em, my tour shit\nGot me thinking like, I ain't got love in my heart\nFor nobody that ain't got love from the start\nMy stepfather text me and told me that mama died\nAin't have the balls for a call\nNow he just taking the house and the wealth\nKeep the life insurance bread for himself\nHad the nerve to move a bitch in the house\nAnd told grandma and grandpa he kicking 'em out\n\n[Chorus]\nI aim my pistol at your heart\n(Back on my bullshit, Michael what?)\nThat's how I know it's really beating\n(Back on my bullshit, Michael what? Back on my bullshit, Michael what?)\nI was your band-aid at the start\n(I'm back on my bullshit, Michael what? Back on my bullshit, Michael what?)\nBut now I'd rather see you bleeding\n(Back on my bullshit, Michael what? I'm back on my bullshit, Michael)\n\n[Interlude]\n(One, two, three, four)\n\n[Verse 2]\nBack on my bullshit\nPull up on you, white Bimmer, that's Cool Whip\nBitches seem him, they screaming, they drool quick\nColosseums, I see 'em, my tour shit\nIn my mind got your BM, in my DM\nTryna pull up in the PM, ain't no leaving\nFuck with the gang and they leave ya with a seizure\nOperation you gon need your anesthesia, spot you like cheetah\nMy watch is sick, the rocks is sick\nI seen your shit, the opposite\nMy watch is sick, the rocks is sick\nI seen your shit, the opposite\nThat's just the shit that I say\nTo contain all the hate that I have in my brain\nAll I have is complaints got me going insane\nYeah, I'm fly, but I wish I could jump off this plane\nCan't nobody see the scars I got on my face\nCan't nobody see the heart I had, don't remain\nEvery time it beats, I beat myself up with shame\nThat's the reason why I keep on aiming it (At your heart)", "image": "https://images.genius.com/b77211ed800701c5cc8dc9a5a6ec95fa.1000x1000x1.jpg", "album": "Is He Real?", "year": "2019-09-04"}]}