{"songs": [{"year": "2014-03-06", "lyrics": "[Verse 1]\nSee, an ass like that take control of me\nFuckin' them hoes, fuckin' them hoes, fuckin' them hoes\nFuckin' them hoes to that Jodeci\nGet it rock on me\nMake it pop on me, you the only one? Bitch, lookin' like the golden one\nHave we met before? You sure you don't owe me one?\nFuck a nigga bitch, you don't like that, huh?\nDay Like this you couldn’t write that, huh?\nHit a nigga real hard\nWhen he call three times, she ain't write back one\nDamn no. Bitch say she was a fan, no!\nBuy my CD, I was fuckin' a bitch, fuckin' a bitch\nAnd she started saying lines from the ICP\nSee, an ass like that will make a nigga quit his job say fuck them kids\nCome home late wit his head down, actin' all funny\nHe know what he did!\nYou know I gotta wax that, before I gotta tax that\nFuck a bitch like the IVRY nigga\nBack there by the I.V. nigga, like that\n\n[Hook]\nPop, pop, V.I., V.I\n(Can a nigga hit it?)\nPop, pop, V.I., V.I\n(and Bitch is you gon let me in it?)\nPop, pop, V.I., V.I\n(Can a nigga hit it?)\nPop, pop, V.I., V.I\n(Can I be jealous or go crazy?)\nPop, pop, V.I., V.I\n(Can I be yo nigga, you my baby?)\nPop, pop, V.I., V.I., V.I., V.I\n\n[Bridge]\nAll the bitches pop that ass\nYou know a nigga be fuckin' them hoes\nAnd a bitch be like right there\nYou know I like that\nYou know I gotta work that ass\nTell a bitch I finna pimp, talkin' bout how I ain’t serve that ass\n\n[Verse 2]\nBitch ass trick, make a nigga wanna throw somethin' at that bitch\nBitch ass thick, make a nigga wanna blow somethin' at that bitch\nWhat it feel like, I'm curious, curious\nBad furious, pay the fee, so I know that you serious\nI'm the type of nigga that will chase a bitch\nI'm the type of nigga that will lace a bitch\nThey be like why 100s, always on a bitch mind or lips\nCause a nigga be\nFuckin' these hoes, fuckin' these hoes, fuckin' these hoes\nLike this\n\n[Hook]\n\n[Bridge]", "album": "IVRY", "title": "Can A Nigga Hit It", "image": "https://images.genius.com/de489522831aef11a8d71bbadeebdfd7.1000x1000x1.jpg"}], "artist": "100s"}