{"artist": "Cage", "songs": [{"title": "Dr. Strong", "album": "Depart From Me", "year": null, "image": "https://images.genius.com/e7169ad2c29abc0b01661f3d5439aa28.600x600x1.jpg", "lyrics": "My name is Chris Palko\nAnd I'm a former patient\nOf Stony Lodge Hospital\n\n[Verse 1]\nYou dropped me off and left me here and started your vacation\nAway from me with your new family I got no invitation\nIf you don't think he's abusive its because he's in your ear\nIf I don't see things your way then I'm not thinking clear?\nI was just in your house going to school again for validation\nPissed you off now I'm in the hospital eating medication\nAnd if I tell them I don't want to take something I'm still myself\nBut the drugs they're making me take are making me want to kill myself\nAnd if I try to refuse meds and they force it in me\nEverything they write on my chart is a block of bring me\n\n[Hook]\nDown\nWhy you gotta tie me down?\nKick we while I'm on the the ground?\nThere's nothing you can take from me now\nCause all I've had has been thrown out\nSo why you gotta tie me down\nI was only trying to figure it out\nWould like to get up but I'm tied down\n\n[Verse 2]\nWhen you wake up drugged its tough to get your thoughts sorted\nThen you realize you're tied down about to be drawn and quartered\nBut there's no horses about to rip you limb from limb\nBut the tranquilizer in your blood is what they give to them\nAnd after thirteen hours of being tied to a bed\nDue to shuffle the hallways, fuck off, and die in your head\nThought when I made it out I'd be carried and celebrated\nThought of who I was when I went in, got out, he didn't make it out\nWho would think every stupid thought that you contemplated\nWould convolute what was constituted as complicated?\nPermanently faded necessary that they calm me right\nYou drag yourself around for days relate to zombie life\nI saw a light, desperately trying to move near it\nBut I'm plagued with thoughts as soon as I leave I hope they tear it\n\n[Hook]\nDown\nWhy you gotta tie me down?\nKick we while I'm on the the ground?\nThere's nothing you can take from me now\nCause all I've had has been thrown out\nSo why you gotta tie me down\nI was only trying to figure it out\nWould like to get up but I'm down\n\nWhen I get there...\nLet me in..."}]}