{"artist": "Ice Prince", "songs": [{"title": "Stars And Light", "lyrics": "[Intro]\nIce prince zamani\nNigeria you ready?\n\n\n[Verse 1]\nI’ve been through the rain\nBeen through the pain\nBeen through a lot of shit\nBeen through the same\nI’ve seen a plan to fall on the tunnel causing the rain\nI’ve seen it to the top and i seen it fun in the game\nCritics they criticize me and putting dirt on my name\nMy friends turn haters, they putting curse on the fame\nSpit in my dre shit and i spit i’m ah little wayne\nAnd all i’m trying to do is just feed on my little grains\nLike put a rap on this field and this haters tear it apart\nThese chains kinda heavy, i either wear it or not\nThese fans going crazy over the things that i pop\nAnd then a nigga paid his bills from the hottest singles i drop\nLast week i got a phone call\nAnd here was my sister’s best friend say make i borrow am loan small\nAnd if i tell her that i’m broke, that would be crazy\nCause for her mind my money long, i be like jay-z\nAnd her text said “Ice, i hope you save me\nSchool don dey close and guys dem wan parade me”\nIf i no provide her the radar, she might forsake me\nCause she thinks that i’m rich from a famous i’ve come and like me\nBut me sef gan\nI’m trying to be stable\nFind a girl from the moz and attract if i’m able\nFinally go to the U.S and milk it like the cows do\nSo i can preach about it and put a smile on them, i’ll do that\n\n\n[Hook]\nA young kid from africa spit on your heart daily\nBeen to the prison, to see what the bars gave me\nShinning like the sun and i’ve been with the stars lately\nBeen through the fire, you see what the scars made me\nOh ohhhh ohhhh!\n(Been to the prison, you see what the boss gave me\nSee what the boss, see what the boss gave me)\nOh ohhhh ooooohhhhh!\nYeah!\n[Hook - Ruby Gyang]\nAll i see….(is stars and light)\nIs stars and light (all i see)\nAll i see (all i see)\nIs stars and light\nStars and light\n\n\n[Verse 2]\nSometimes it feels cold like eight degrees\nAnd sometimes the nigga getting J's for free\nIf i fall to the field, i’m not ashamed to leave\nCause sometimes a nigga need space to breath\nNow they know my name o\nI’m f*cking the same though\nNow the niggas looking up to me\nI’m like a rainbow\nWalking in the desert until i’m watching the rain go\nCause niggas getting famous exactly just how the game goes\nBlocka blocka blocka\nThe street they’re itching\nAnd we just bought a chopper for the shits they speaking\nOh yes i pray for the bomba clad rasta who be standing my way\nIt’s different type of cloud that the boy cut from\nAnd you don’t wanna go where the boy come from\nCause the boy drop ceiling when the boy drop bomb\nHe been killing rappers on the internet dot com\nNow happy days gon’\nAll these rappers getting sulfurs like they kiss craze source\nMe i’m spitting hot like a jew *** son\nI still pray for my lord that i can be akon\nSo don’t p****\nCause i go a tiny temper, i was UK born\nOh you see the sparks i’m getting ignited\nJimmy jatt feel this, i’ll be more than excited\nYes…\n\n\n[Hook]\nOh oh ohhhhh ohhhhh!\nOh oh ohhhhh ohhhhh!\nAll i see, all i seeeee\n(All i see)\nA young kid from africa spit on your heart daily\nBeen to the prison, you see what the boss gave me\nShinning like the sun and i’ve been with the stars lately\nBeen through the fire, you see what the scars made me\nA young kid from africa spit on your heart daily\nBeen to the prison, you see what the boss gave me\nShinning like the sun and i’ve been with the stars lately\nBeen through the fire, you see what the scars made me\n\n\n[Outro]\nIf there’s ever been a rap this fly\nIt had to be done by an M.I’s guy\nIf there’s ever been a rap this fly\nIt had to be done by an M.I’s guy\n\n\nYes aii\nThe name ice prince zamani\nAnd tonight i got the beautiful miss ruby gyang\nAnd you already know the story\nLoopy, it all started from right here\nChocolate city, i salute you all…\nBless!\nAnd tonight, tonight, we are in the studio guys with jay sleek\nChopstix, E-kelly, sammy gyang\nAnd i’m talking about the best, Best in the best\nThe greatest in putting music together\nAnd it’s about to go down\nYou know this is history for me\nAnd i feel so proud at this moment\nI feel so proud at this moment\nTo present this album\nThis probably, i think is serious yo\nYou gat to take it serious too\nYeah! Dreams do come through\nStars and light\nAnd my instagram get thousands of likes\nGet ready", "image": "https://images.genius.com/c3c69b38b032e56b8f88f9acc5d4b2a9.270x270x1.jpg", "album": "FOZ (Fire of Zamani)", "year": null}]}