{"artist": "Canibus", "songs": [{"title": "Anagram Phoenix", "album": "Full Spectrum Dominance", "year": "2018-06-06", "image": "https://images.genius.com/e46ac064e354d1b1540013198f5e0d71.1000x1000x1.jpg", "lyrics": "[Verse 1]\n\nYou don't know what's next\nGeneration X gotta prep\nOnly for those who can see it:\nThe iPhone is an anagram for the phoenix\nI'm a woodwind instrument repairman\nDashing, handsome and daring; a Tuskegee airman\nReduce my ground-speed to give the underground what they need\nIf they don't know what to believe:\nThen I don't know what to tell 'em\nBliss; ignorance is a weapon\nIllusions in the middle of the desert\nOr in a sanctuary city, I stand corrected:\nIt's all connected, take an alter exit\nMove on to the next shit\nG-chrome, can't talk late night on the phone\n'Cause you don't live alone\n1 on 1 with Angela Yee\nBacon, eggs and cheese\nLowered torso, legs and feet\nHip hop's first Elon Musk\nIron lungs with guts\nTake it back to the rewind button\nHe was born as a baby in a manger in crystalline light chambers\nThey called him a microphone mangler\nDeveloped as a unit, before it's one love it's one music\nHis sound gave shape to the future\nGuess what? the natty dread can't stand the feds\nHe eat banana bread livin' off grit in the tent\nPresent crisis PR expert\nMusicbox News network\nWhere they trade net worth for wetwork\nYouTube: Canibus search, skip over the battle\nI been rappin since Eve took a bite out the apple\nThe Book of Eli transformed my mind and designed\nThe Paul Thomas Anderson storyline\nThe expression: \"Reason without rhyme\"\nClearly comes to mind\nThat's why I rarely dumb it down sometimes\nIt's an accelerated positive feedback loop:\nUses Mars system surveillance: I need that, too!\nThe bulk data transfer from the West-Indian black panther\nSearch the universe for answers!\n\nWe don't know what's next\nGeneration X gotta prep\nWhat's comin down the pipeline next?\nThe iPhone anagram for the phoenix makes sense\n\nHip Hop robotics with upgraded optics\nMy wardrum mounted on the wall where I found it\nMad-dog maddis mathematics\nPlease read the caption:\nBinoculars read your lips from the rafters\nThanos; cook mean on that drum machine\nTake it back to the 20,000 man street team\nBaby-boomers from the future wearing some faded ass booms\nWith an old school gold-plated ruger\n\"How many times did they shoot ya?\"\nWhat the fuck kinda question is that, who's the interviewer?\nHydrogen powered limited edition Eddie Bauer\nGold-colored clouds spark electricity showers\nWhen I beam down and rap\nI yellow tape that\nMy Man My Mellow won't even say that\nI lift up my praise and make the rain fall sideways\nResurrect Hip Hop from the grave\nThe third-eye brigade, the blockchain bars on a cage\nCall out the pressure on the gauge\nExtraction in a half hour, put some man-trousers over them skinny jeans\nWe need man power!\nStep into my office, excuse the faint smell of nail polish\nI'm water-proofing my electronics\nRight, I got things to go bump in the night\nFight? I throw you in the trunk space with no light\nFront-right and center adrenochrome taste test this\nNow you can't feel your face, nigga\n\nThe iphone IS an anagram for the phoenix\nSoon to be seen by all the believers\nWe don't know what's next\nGeneration X gotta prep\nWhat's comin down the pipeline next?\nThe iPhone anagram for the phoenix makes sense"}]}