{"songs": [{"year": null, "title": "House of Bees", "image": "https://images.genius.com/8b24619eca032daebf0caa5c44aa746d.512x341x1.jpg", "lyrics": "Birds and the bees\nNerds and mp3s\nSurfing the seas of watermarked promo cds that leaked\nLike best kept secrets ain't worth art thats physical\nHardcopy material given a proper burial\nLong live the satisfaction that songs give\nRecords in my attic got scratched and haunted\nRadio stations that are captured on my tape recorder\nA long time listener, first time caller\nHung up for the last time\nNervous and out of breath\nMy writing had no purpose it was murder and lots of death\nTurned to god and turned godless\nThe audience beneath the surface wanted death\nIt kept me honest\nTruth be told never made a deal with satan\nI turned my loose leaf gold\nGot a carton full of songs sitting on the counter of a store\nShut them down now\nOnly looseys sold\nI said\n\nWhat the hell we gonna do now?\nHow many units can we move now?\nThey wanna make money money\nBut there's a limit when you keep taking honey from the house of bees\n\nA lot of shit is out of tune since the weather started changing\nThe flowers are confused don't know when they're pollinating\nThey bloom before the frost get caught depopulation\nRipple effect the systems connect the scene started changing\nBees stop behaving in a way that made sense\nQueens disrespected while the babies raid the nest\nNo defense the record store is under attack\nThe dj's a complete hack but none of y'all beeswax\nThe colony collapse when the label got sued\nFor the pollen on the track now its losing value\nThe music press the publicist deluded bad review\nThey plundered and ask but nothing but the hunger to consume\nMass produce mass appeal manufacture junk products\nStatic loops lack the real so the fans would rather shoplift\nSold the whole thing and forgot what it was\nNow you got no sting and you're trying to start a buzz\nLike\n\nWhat we gonna do now?\nHow many units can we move now?\nThey wanna make money money\nBut there's a limit when you\nKeep taking honey from the house of bees", "album": null}], "artist": "Sage Francis"}