{"artist": "9th Prince", "songs": [{"album": "One Man Army", "lyrics": "[Chorus 2X: 9th Prince]\nWhat the fuck you wanna do?\nWhat the fuck you wanna do?\nWhat the fuck you wanna do?\nWhat the fuck you wanna do?\n\n[Verse 1: 9th Prince]\nYo, honey dip in the whip, I don't walk with no limp\nBut I'm still a pimp... psyche, I'm kiddin'\nPay attention to the darts that's Hidden\nLike the Crouching Tiger, shout out to the dreads, more fire, more fire\nMy music is more mental like the \"Eye of the Tiger\"\nYou've seen me in NYC with Tatiyana Ali\nShe chauffeured me, in a blue Lamborghini\nShout out to my enemies, oh shit, Jesus Christ\nI'm so nice, you Old Spice\nMe and my niggas, roll up like dice\nTakin' ya ice then feed ya to the mice\nYou's a rat, where's ya gat?\nWhere I rest at, even the best get test, black\nFive Fingers of Death, throw ya hands in the air and swing 'em to the left\nHowever you want it I can give it, long live my spirit\nEven if you can't hear it, I'ma make you \"Feel It\"\nLike a gunshot wound when the bullet hits\nBlood spilled in this shit, somebody call the ambulance for son, I'm on the run\n\n[Dom Pachino]\nComin' from all kinds of fuckin' angles on y'all niggas, man\n\n[Chorus w/ Dom P ad-libs]\n\n[Verse 2: Dom Pachino]\nYo, Terrorist, Terrorist, Terrorist, here I come...\nIced the bezzle, canary specs made my face yellow\nYa jigglin', baby, J-E-L-L-O\nNiggas see I'm black and white like Othello\nI'm in Living Color, brother, lyrics lay Heavy on the Mental\nAnd come with full benefits, medical and dental\nI've got pink slips for it all, no rentals\nGet the fuck from 'round here, who the fuck sent you?\nThese Boys are Bad like they're Martin and Will\nKillarmy like this is the drill, you heard the rest?\nBut this is for real, no denying, just rapid fire from the black iron\nStill number one on the under, I heard he came with the thunder\nWord spread, makes niggas wonder\nHe's a hustler slash gunner, alcoholic rum runner\nAnd a One Man Army overall, one bad motherfucker\nLike Terrorist shit...", "year": null, "title": "What U Wanna Do?", "image": "https://images.genius.com/21cb3399de2cfe8fac890083e9323314.940x940x1.jpg"}]}