{"artist": "Watsky", "songs": [{"year": "2016-12-05", "lyrics": "[Chorus]\n\nWho should I believe? Please tell me why\nNo one saw what happened there that night\nThe only clue’s to look you in the eye\nThose gray and cloudy eyes\n\n[Verse 1]\n\nAll the people run and take a side\nDon’t nobody want to break their stride\nBut what if we were to make a mistake\nWith stakes this high?\nNo one’s ever gonna truly heal\nYou want to gamble; who do you let deal?\nWhose future rep do we ruin?\nLet’s spin that roulette wheel!\n\nIt has never been a secret: cowards posin’ as leaders seek\nTo pervert their power and prey on the weak\n\nBut I also\nKnow\nWith an accusation, a wound is made\nYou wouldn’t be the first to wield a rumor\nAs a blade!\n\nFingers pointed like bayonets\nWhat’s it cost you to make a threat?\nDon’t be shy come on place your bet\nIf you roll snake eyes you don’t pay that debt\n\nLet’s set it straight:\nOnly one things certain, that some… body is the serpent\nAnd were… you to win that verdict\nSlither out and take your curtain call\n\nLookin’ for a bit of mercy for she\nShoulderin’ a heavy burden with\nNothin’ but cursed choices\nSilence is the worst of all\n\n[Chorus]\n\nWho should I believe? Please tell me why\nKnow one saw what happened there that night\nThe only clue’s to look you in the eye\nThose gray and cloudy eyes\n\n[Verse 2]\n\nI do not share your load on this journey\nI do not wear black robes in the court\nSo I will not bang the gavel; I won’t lock your shackles\nThis is not my trash to sort\n\nFolks who think they’ve found truth tend to tremble\nAny time the ground beneath them shakes\nFind the closest rock to cling to\nLock your fingers into fissures where it breaks\n\nBut what if turns out things aren’t as we know ‘em\nReapin’ the harvest we’ve sown; Here in this garden of stone\nWhat kind of hideous, selfish obsidian\nHeart do I own?\n\nCould you forgive me if my hesitation\nDemands that you weather this hardship alone?\nHow could you pardon my tone?\nI know that hatred can scar\nThat it can carve to the bone\n\nSo would somebody let me know how do we\nTake shit back to when life was all wonderful?\nGet to buildin’ a home or a chateau we\nCan get comfortable feeling uncomfortable\nI’m not talkin’ a Huxtable\n\nWhat a difficult and retched affair\nPeople seekin’ anything solid\nTo keep them from scratchin’ at air", "image": "https://images.genius.com/1aacc5c51f6e3a30a154e12a7fc3100f.1000x1000x1.jpg", "album": "Oops! All Berries", "title": "Grey Eyes"}]}