{"songs": [{"year": "2001-09-21", "image": "https://images.genius.com/3749c060f89eca4eb3dac2193a559a45.991x1000x1.jpg", "title": "Good Timez", "album": "Be Yo Self", "lyrics": "[Syke talkin']\nYeah...... yeah\nThe good times\nWhen you was a little kid\nPlaying in the yard, you know\n\nVerse 1:\n\nIt seems like yesterday I used to play around the way\nThose were the good timez\nGrowing up as a child, carefree\nMomma said I was wild by three\nEven pops showed me love he was there\nI remember hanging out playing truth or dare\nCowboys and indians, ring your bell and run\nWhen the only thing we sprayed was water guns\nWe didn't have much so we made the best of\nWhat we could afford but we had love\nTryna be grown might snick and curse\nOne tv set gotta cut it on first\nBack in the good timez and the Jeffersons\nWhen ya next door neighbour was ya best friend\nThose are the days I miss and reminisce...\nSo I steady wish, for the good timez\n\nChorus:\n\nNothing but the good timez on my mind, can I rewind\nThe time back to my early days, as children play\nOn the road to tomorrow, some passed away\nSo my future feels hollow\n\nVerse 2:\n\nI'm thinking back on my history, in my elementary\nI wonder do they still remember me?\nThat little bad ass kid\nThe boy that wanted someone to help him, but they never did\nSo off to the office I go, you know\nA problem case from the get go\nWill I ever change before it's too late?\nI need to study harder and get my life straight\nMoms and pops praying for the best for me\nI was blind and I couldn't see\nBut they told me friends come and go as you grow\nFocus in, play to win, or you will live low\nSo I tried to do my best, failed every test\nMy life was becoming a mess\nEven though the past years are far behind\nThey in my mind... considered as a good time\n\nChorus\n\n\nVerse 3:\n\nI remember playing in the street wid my lil bro\nKickin' it wid Mental and Big K-Dog where you go?\nDizzy D, Big Chip, rest in peace\nNissy T and all my other people de-ceased\nCan't let my memories slip away\nNo I ain't okay, cause I haven't seen you today\nNothing but good timez, on my mind, can I rewind?\nThe time back when I used to have a seventy-nine 'Lac\nWid a black phantom and I bought 'em selling crack\nI want 'em back, my teachers Miss Satedon, Miss Nor-ville\nEncouraged me, and wished me well\nTo excell in life, it's a high price\nGood advice, summer nights fist fights\nSaying, things wouldn't be so bad\nIf we got the things we never had\n\n[Syke talks]\nI ain't mad, huh-ha-ha\nI'm thinking 'bout the good timez\nI'm thinking 'bout the good timez\n\nChorus ('til fade)"}], "artist": "Big Syke"}