{"artist": "Andre Nickatina", "songs": [{"title": "Killin of the Caine", "album": "I Hate You With a Passion", "year": "1995-04-19", "image": "https://images.genius.com/caf6d8331e5ef8bd79cb75fa64fb6144.1000x1000x1.jpg", "lyrics": "(Dre Dog talking)\nDrop it\nYeah! (yeah)\nWasup?\nThis is uh...one of those cocaine style raps (you can say that again)\nFor the killas (the who?)\nThe real killas (right)\nThat uh...that popped Dan\nThis yo boy Dre Dog!\nCheck it out (drop that shit there boy)\n\n(Dre Dog)\nStep into the mind of a visionary vocalist\nFocus this, picture this I'm 6 foot 6\nReady for the battle like Desert Storm\nFeel the welts on yo body from the extension cord\nGot you sweatin like a dancer\nStress and gave you cancer\nNigga you the wide receiver foo I'm Deion Sanders\nPrime Time niggas get turned like a channel\nCoke is this, fuck a bitch from Detroit to Seattle\nIndo got niggas thinkin fuckas wanna stop me\nMothafuckas missin teeth boxin like hockey\nRabbit, I'm not a kid but you can get the Trix\nYou better have been sleepin cause I'm slammin Big Six\nBAM! Get the smellin salts he's unconscious!\nTryin to go head up but juss can't stop this\nTreat me like a red but nigga don't push me\nCause once my vocals hit the beat it's good like pussy\n\nKilla!\nNigga?\nIt's the Killin of the Caine\nMotha-fucka\n\n(Dre Dog)\nYou live in a shell like a snail\nMoby Dick ass niggas get harpooned like a whale\nNot a killa (??doin niggarail??)\nFuckin with the pinnacle\nWishin for a miracle\nSituation Critical\nLay it down, you betta expect the worst\nAll screamin like a pregnant woman about to give brth\nIn a taxi, now ask me, do you think I'm bluffin?\nI bet I got you listenin to me juss like I'm E.F. Huttin\nOr somethin, you fuckas gonna all have to learn\nFavorite boxer Tyson, second Tommy Hearns\nHut hut hike!\nI'm runnin from the whites (who's that?)\nCause 5-0 they only thing they see is my nikes\nBut check this out imagine prison under the ground\nEscapers at 0 and you can't hear a sound\nFuck you man Scarface Al Pacino\nI'm coo tryin to get some good pussy up in Reno\nA key! Stolen from a druglord G!\nThat means niggas gonna die for a fat fee\nThe lick went sour, a rat of the name\nThe dope got my life, the Killin of the Caine\n\n(Dre Dog talking)\nRun for cover (right)\nYeah (no)\nNigga (nigga)\nMothafucka (mothafucka)\nIt's the Killin of the Caine\nWassup? I got some catterpiller killers in the house (who you got in\nThis\nMothafucka now?)\nMy nigga Coughnut (thats right)\nMike Mike (Mike Mike)\nMy nigga P-Ride (nigga P-Ride)\nMy nigga (my nigga)\nLo-Lo\nSTOP!\nThought I forgot about you huh nigga?"}]}