{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Delt with the Bullshit", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "[Prodigy]\nDunn it's real like that\n\n[Havoc]\nUh huh yeah\nUh huh yeah(uh huh)\nYeah, ha(solo on that ass ? dealt with the bullshit)\nCheck me out dunn(yeah)\nCheck me out now(out yo)\n\nYo\nFeel me on the road, feel me at the shows\nFeel me for what I stand for\nAnd I'mma do it til the death til I can't no more\nFuck a ho, it's all about dough\nStill, fuck her and still don't love em\nThat's word to mother\nUn-cover the truth, enjoy my youth\nIt's die or lose\nI wonder what if I was sittin in the pen\nOn the strength that I had to hurt something\nCuz my stomach hurtin\nI'm a cool nigga, but don't let me start buggin\nLove my moms, love my little sis, plus my little dunn\nNiggas gotta eat, fuck settling for crumbs\nHell no, me a bum on the streets looking dumb\nTil hell freezes over yo y'all niggas better run\n\n[Hook](Repeated 2x)\n(Havoc)\nCuz I done dealt with the bullshit\nLived through the bullshit\nSo put a clamp on them loose lips\nMy niggas do kill shit (pow pow, pow pow pow)\n\n[Prodigy]\nGuns redundant\nMy dunns move in abundance\nWe loose cannons, my rugar will pop somethin\nWhat's all the frontin\nBeing cavilier will get you nothing\nOr maybe touched though\nKeep pressing me and we be thumpin like The Lords vs. The Hawks\nWhen little boy got a foot long stuck in his back\nAnd punctured his lungs\nIt's very brutal, how the N.I.C. will do you\nYo get KO'ed and pissed on for being rude\nYeah, respect the colors and the flag i wave\nRespect the I.M.D. embroidery\nMy shit is classic and authentic\nBlowin dick\nY'all niggas grafting my whole presence\nGet your own shit\nMy voltage, be higher than the wire pole get\nKing vulture, more flyer than your average rap pigeon\nNow, twist up your cheebas\nI get deeper in depth\nMy rap page make niggas throw they reefer at us\nLove me, bless me, like you supposed to do\nJust don't test me niggas I be toasted up\nWhat(echoes)\n\n[Havoc]\nCuz I done dealt with the bullshit and lived through the bullshit\n\n[Hook #2]\nCuz I done dealt with the bullshit\nLived through the bullshit(no doubt no doubt, yeah yeah yeah)\nSo put a clamp on them loose lips\nMy niggas do kill shit(pow pow, pow pow pow)\n\n[Prodigy]\nMy style, identical to guns that burst\nI'm like a fourth when I go off, or even worse\nIt's like an ill box cutter fight where no one backs down\nMy shit burn, make em far from a clown\n\n[Havoc]\nAy yo, likewise\nSee a nigga that I can't trust is a nigga I despise\nThen I, reply with a cold shoulder\nYou ain't a gat holder, you just a crossover switchover\n\nChorus #2\n\n[Hook #3]\nCuz I done dealt with the bullshit\nLived through the bullshit(uh huh, yeah)\nSo put a clamp on them loose lips\nMy niggas do kill shit(pow pow, pow pow pow)", "year": "2000-11-14"}]}