{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Last MCs", "album": "The Chalice", "lyrics": "Billy woods ft. Vordul Mega and Taiwo Whetstone - “Last MCs”\n[Emcee(s): Vordul Mega and billy woods]\n[Producer(s): Dan Datiles]\n[Scratches: Dan Datiles]\n[Additional Instrumentation: Emile McGloin]\n[Additional Vocals: Priviledge]\n[Background Vocals: Taiwo Whetstone]\n\n[Verse 1: Vordul Mega]\nStories of how we gone through it since way\nBack, talking problems and hard paths\nStarving on blocks, we fed, mad\nAt niggas that forgot we broke bread\nGrow with strength, learning everyday lessons\nGotta get up and press issues, stressed from\nBeing misused.  Fuck those mad ‘cause\nWe spit truth, get dro in bags and\nFor you, it’s easy—more so said than done\nChased by police, we run, get\nTired, pause in streets with peace\nWired, come down hard from being highed up\nStuck on clouds, but no time to fuck\nAround.  Make tracks and rush your town\nOff corners, lungs burnt-out, still\nGot stoges, bust ‘em down.  Outside\nWild, got the grown folks\nCussing now like, “Yo (Yo)\nWhat the f...?  (Shit crazy)”\n\n[Hook: Vordul Mega]\nAnd it’s\nNothing but problems.  Who gonna come\nAround and solve ‘em?  Who gonna be\nThe one to save us?  Gotta save you\nAnd make special moves.  You know it’s like...\n\n[Verse 2: billy woods]\nCarving blocks of granite, Stonehenge flows\nSisyphean stones?  We move those\nKudos to the kids for stage shows, Wizard of Oz\nCurtain-pullers on cats who b-boy-pose\nCorporate toads, the nose knows you’re softer than\nHo Hoes.  Breaking mixing boards in dojos\nTurn studio to à la modes for semi-pros\nCareer-ender, adiós, retire\nTo the Poconos.  You could have been a contender\nTell your grandkids while pulling quarters from behind\nTheir ears, nursing a beard, thinking back over\nThe years.  Under belts, Spitamatic\nThey was something else.  Which Yung Havok?\nThe last emcees I ever felt\n(Ever felt)\n\n[Interlude: Priviledge and (billy woods)]\nAlright, alright, alright, alright, settle down, settle down, settle down.  Everybody grab your seats, you nah’mean?  Coming for you live and direct from the Woodz, it’s me, the one and only Priviledge, you heard?  Holler at me.  But coming to the stage, right now, the very illustrious (This might be all night!), my man William Bodega\n\n[Verse 3: billy woods]\nI’m an outer comp like an E.T\nWho holds weight like snitches at the bottom of lakes\nWho can bend when beats break?  Always drop different\nLike snowflakes, throw the mic down, have it\nTurn to a snake.  Holy Moses upstate\nThat’ll have you tied to his stake half-baked\nDown here, no great shakes.  The average\nResident on a milk crate’ll outshine your mixtape\nHard to kill Gates without eight bars\nOf free-base to stay away.  We’re lane-switching\nOut freeways when we snatch your plates.  Get out\nThe kitchen, where I dwell, raw, well intuition\nLinguistic double-stitching, word connect, forward\nConnect, raw creep with beef for sleepy peepers\nMax out the meter, clap out the heaters\nThought-cheater.  Vengeance sweeter served\nCold, first [?] abasement.  Composition\nFlesh, plasma, reefer creature search speakers\nMic kryptonite—getting weak, I step\nOn stage, glide, forgot my verse blade\nSo I slide, first pray.  Drunk crowds worst\nRhyming dragons unrehearsed, you’re getting paid\nDrop my ganja vibing.  Who’s on first?\nFire Marshall Ray, thugs pushing, dicks swinging a purse\nStage-diving, conniving Coronas\nMore haze, NYPD pepper spray\nBartender rising, snatching top-shelf\nYou don’t got to go home—at least not by yourself"}], "artist": "​billy woods"}