{"songs": [{"lyrics": "[Intro: LL Cool J & Action Bronson]\nLa musica de Harry Fraud\nQueens\nBetter slow down baby\nOne two, one two\nUh, better slow down baby\nJust pulled up to the club on your mother's back\n\n[Hook: Action Bronson]\nYou need to slow down baby\nMy whole team cash and load out baby\nI’m a hero in my hometown, baby\nStop talking, just go down, baby\n\n[Interlude: LL Cool J]\nAyo, Action\nIt ain't no fun if the G.O.A.T. don't get none!\n\n[Verse 1: LL Cool J]\nThe ripper, the master, charismatic bastard\nGame is strange like blondes Ramadan fasting\nIndoor pool look like Uncle Luke's casting\nNever too old to fly a fake bubble ass in\nPeep the rhetoric, nobody can better it\nNone of y'all confederates, I'm daddy, you're a surrogate\nMurder these mics, boy, felon after the predicate\nFuck what you heard, baby, that shit's all irrelevant\nThird as fly or half as intelligent\nStep on that horseshit like Hannibal's elephants\nWatered-down garbage ass rappers prevalent\nAll I wanna know is how the fuck y'all sellin' it?\nAhahahaha!\n\n[Hook: Action Bronson]\nYou need to slow down baby (slow down)\nMy whole team cash and load out baby (no!)\nI’m a hero in my hometown, baby (Flushing!)\nStop talking, just go down, baby\n\n[Verse 2: Action Bronson]\nIn front of Queens Center Mall, leg up on the sweatpants\nSame outfit every country that the jet lands\nJetlagged, just left France\nStuff a motherfucker face into a bedpan\nShimmy in the GMC Jimmy\nSo I can make assists like Mike Bibby\nNice titties on a dyke that like swimming\nSmokin' drugs, rollin' dice, and white linen\n89 Testarossa, will I fit in?\nThe Jeep's so big make you wanna take a shit in it\nYour bitch been in it\nTreated her mouth like I was primitive\nI talk shit cause I'm livin' it\nIt's me!\n\n[Hook: Action Bronson & Lloyd Banks]\nYou need to slow down baby (slow down, baby)\nMy whole team cashin' lowdown baby\nI’m a hero in my hometown, baby (hometown, baby)\nStop talking, just go down, baby\n\n[Verse 3: Lloyd Banks]\nUh! I'm a mac, she gon' hook a nigga up on the expressway\nThat neck play, thousand diamonds in my x-ray\nLight the park like when the Mets play\nClean as a fuck, we make a mess, hey, I'm beamin' on up\nTwenty bucks, twenty women, spend my evenin' on stuck\nI get em out on clockwork, hit my sleeve with the cuff\nThey know what's up\nYoung, black, and hungry in the presidential\nA hundred somethin' dimes, white 11 special\nTakin' a moment while you're roamin'\nI set the trap, set back, watch my cologne win\nDesigner logo on my uni while I'm rollin'\nCrowded pockets in her Louis bag are Trojans\nBanks!\n\n[Hook: Action Bronson]\nYou need to slow down baby\nMy whole team cashin' low-down, baby\nI’m a hero in my hometown, baby\nStop talking, just go down, baby\n\n[Outro: Action Bronson & LL Cool J]\nYou need to slow down baby\nI'm out here, but don't ever fuckin' get it twisted\nI’m a hero in my hometown, baby\nWe on the strip, Friday night, it's lookin' like the award show\nYou need to slow down baby\nCatch me with my bitch, hair color hot sauce\nI’m a hero in my hometown, baby\nOh, man, look who just fuckin' pulled up! (What up?)\nIt's me", "title": "Strictly 4 My Jeeps (Remix)", "album": null, "image": "https://images.genius.com/4c92d833aae01e64b71a556bb1cb9f0b.990x660x1.jpg", "year": null}], "artist": "Action Bronson"}