{"songs": [{"year": "2019-06-14", "image": "https://images.genius.com/632cbe474a2ab6a525c2a0da36a43d67.1000x1000x1.jpg", "title": "Everyday", "album": "I Am Me", "lyrics": "[Intro: BlocBoy JB]\nWord\nWord\nYeah, every day\nI text, I call, I flex, I ball\nI go through this shit every day\n\n[Chorus: BlocBoy JB]\nI flex, I ball, I text, I call\nMy ex, we go through this shit every day\nI ignore y'all, iPhone, missed call\nFrom my bitch, we go through this shit every day\nHow can I sleep when we go through this shit every day?\nHow we gon' eat when you be interrupting me getting paid?\nWhen we go broke, I bet you're gonna have nothin' to say\nMatter fact, the money only reason you call me bae\n\n[Verse 1: BlocBoy JB]\nShe a gold digger, she don't fuck with broke niggas\nRose gold Audemar, got that off a show, nigga\nPinky ring blingin', but fuck that shit, we need some more pistols\n'Cause every time a nigga get some money, it bring more issues\nCame a long way from sleepin' on my fuckin' mama's couch\nGot my first check, got some guns and bought my mom a house\nYou think that I ain't work for this shit? Ayy, watch your fuckin' mouth\nI was robbin' for the dollars, now I'm gettin' gwalas now\nI was fuckin' black feets, nigga fuckin' models now\nI was smokin' point three, Backwoods by the boxes now\n.40 by my boxers, try to rob me, I'ma gun you down\nChain shine like it's sunny now, niggas funny, Leroy Brown\n\n[Chorus: BlocBoy JB]\nI flex, I ball, I text, I call\nMy ex, we go through this shit every day\nI ignore y'all, iPhone, missed call\nFrom my bitch, we go through this shit every day\nHow can I sleep when we go through this shit every day?\nHow we gon' eat when you be interrupting me getting paid?\nWhen we go broke, I bet you're gonna have nothin' to say\nMatter fact, the money only reason you call me bae\n\n[Verse 2: Moneybagg Yo]\nEvery day, every day is like a holiday\nWhen I reset and think, I took the harder way\nThe Wraith or the Wagen, I don't know which car today\nI'm actin' cocky, I'm heavy on water weight\nNiggas ain't solid and I know that\nI'm with the gang, don't nothin' come before that\nAggravated off of yellow, Bodak\nPop you just like Prozac\nNot just talkin', rappin', spit truth through the interphase (Right now)\nBackstage of the venue, strap tucked in my inner waist\nYour money low, I sip Hi-Tech (Red)\nEvery day I flex, but we used to stress\n'Member that (Huh?)\nOn the set, I spent a huncho on a Rolex, yeah (On Skydweller)\nAnd you know we ain't goin' for it, too much money for it\nWanna go to war, flip your Honda Accord\nWipe that baby nose, had to cut his cord\nBlade on the K, chopper with the sword\nEvery day your bitch tryna see the boy (Every day)\nShe know that I'm winnin', keep the score\nGot her legs open like Aventador\n\n[Chorus: BlocBoy JB]\nI flex, I ball, I text, I call\nMy ex, we go through this shit every day\nI ignore y'all, iPhone, missed call\nFrom my bitch, we go through this shit every day\nHow can I sleep when we go through this shit every day?\nHow we gon' eat when you be interrupting me getting paid?\nWhen we go broke, I bet you're gonna have nothin' to say\nMatter fact, the money only reason you call me bae"}], "artist": "BlocBoy JB"}