{"songs": [{"album": "The Calm Before the Storm: Part 1", "image": "https://images.genius.com/1d4a12a154c6cf30e77857bb018ab602.1000x1000x1.jpg", "year": "1999-11-09", "title": "Clueless", "lyrics": "[Intro: Larone Burnette]\nClueless (Ohhhhhh, Clueless)\nMindless\nClueless (We're gonna leave you mindless)\nMindless (Divine bringin' on down)\n\n[Verse 1: Solé]\nSupreme, all about my cream, can you dig the ish?\nFinna be hella rich made a switch to kill the snitch\nTurned out to be a nothing but a hater\nI pull the trigger, it bites the liver\nTo the MO; dead on arrival\nHomocidal when we ride taking ya title\nIt ain't nothing but a thing, cause everybody gotta die\nEverybody gotta lie, hit the scene\nI'm all about the green and the cash\nGive it up fast: the no-no, player watch for the po-po\nBring a 'cain diller as I bring the pain killer\nOn the low low creepin' affiliated\nSee a chick demonstrate it, make 'em frustrated\nComplicated with a buzz, burst until [?] must kickin' up dust\nCrushin' competition, I'm on a mission\nMitch wanna be dissin' at the same time\nAss kissin', hopin' they wishin' that I\nPlay out, fade out never heard of me, but occurred to be\nGreatest, Mitch hate this\n[?] nothin' but a word to me\nReally worth to me, gotta rock it up, gotta stuck it up\nUpon game Mitch you gotta mop it up, soakin'\nNo jokin', can't breathe\nNo more messin' 'round start chokin'\nEverybody that I meet (what you doin'?) dealin'\nEverybody peep it: the lyrical context to get hexed by voodoo\nNo tellin' what's next you're clueless\n\n[Chorus: Larone Burnette]\nNow what you gonna do? Your time has run out\nWhen the Divine and Nina come for you. Are you dreaming?\nOr are you still awake, your time has run out, player\nNow where you gonna run? Where you gonna hide?\nDeath around the corner and it shows tonight\n(Cause you were trippin' you got caught slippin'\nAnd now you clueless about your situation\nLights out, we know it's hesitation)\n\n[Verse 2: Tech N9ne]\nI'm about to hit 'em with a mirror, killer\nGotta get a little bit more of that skriller\nWhat the hell a hater gonna do\nWhen they come face to face with a 9 milla\n(Backed up off of ya, none out but you hopped off I crush ya)\nSee me when I'm comin' with a (Ch-ch-ch)\nBetter hope you'll never hear the (Hah-ah-ah)\nBust every day, many day, any day\nI spray it at hater that claim he's on\nMake that hater say hee-hah Dameon\nDevil child, devil's son, by the rule of the God with the rebel's gun\nAnd if that trick no like it, suck me huevos hun, hum\nIs that killer with the flow not so-so\nNever with a Willie Bobo, hot like cocoa beautiful just like Acapulco, poke your ho, oh\nShe's wet, she's aqua, clueless trick, never had to jock her\nAll over my sack and nobody, niggaro not even you can stop her\nLa Cosa Nostra, me fly boast up, ride that track like a roller coaster\nCome a little closer, see a motherkcuf like Tech Nina toast you\nN9ne Tech come with Divine, just remain mindless\nWhen I flex you, you get next to the real killer\nBut a Bade Mitch motherkcuf just stay at school\n\n[Chorus: Larone Burnette]\nNow what you gonna do? Your time has run out\nWhen the Divine and Nina come for you. Are you dreaming?\nOr are you still awake, your time has run out, player\nNow where you gonna run? Where you gonna hide?\nDeath around the corner and it shows tonight\n(Cause you were trippin' you got caught slippin'\nAnd now you clueless about your situation\nLights out, we know it's hesitation)\n\n[Verse 3: Solé]\nIt's all a mystery, check out the history\nFollow the trickery, hollow tips are loaded from the Tech N9ne\nKnown to bust caps everytime, won't you rewind it? (yrlived)\nGot 'em blinded, simple minded\nGotta get up behind, stop gettin' wild somethin' like pal!\nI make 'em all really wonder how, can we kill em?\nHave we deal them?\n36 grams up in 'em, like snakes deliver up dangerous\nMess around gotta hit 'em, Tech Nina and\nDivine rollin' up can't stop the bum rush\nWhile play haters come to us, victorious, so glorious\nMitch Bade is dumb to us, Notorious\nLike Biggie, is she really from Kansas City, Missouri?\nMitch you better be hear me, better be fear me, nothin' but an enemy\nOn my way to make many G's in the industry, that's how it gotta be\nEverybody be useless another murder committed, clueless\n\n[Verse 4: Tech N9ne]\nYou ever dance with a devil in a pale moonlight\nI usually ask of all my prey\nI'm gonna be level when I'm on a mic\nYou fool I'm a live round when I spray\n[?] I mean [?] make a lot of money [?] sentimental\nNever did I make Biancas whine [?] N9ne\nGet spunked, not even I keep kickin' a bud\nNever give up the Bianca when they wakin' up in [?]\nClueless, who less, me and you foolish\nThis when a nigga do best\nBut if you bite your thumb at me\nTecca Nina gotta make a punk of you\nMuch more strand than an attitude\nBigger than the Capulet and the Montegue\nWho really wanna get involved?\nWhen I bust like sailor [?]\nWill you do me a favor, get lost?\nOr get your head torn off by the flip boss\nKilla clown, look around, hella off the hook\nAnd I stays in the killa zone now, milla dawn\nNiggas be clueless and more so than Alicia Silverstone\n\n[Chorus: Larone Burnette]\nNow what you gonna do? Your time has run out\nWhen the Divine and Nina come for you. Are you dreaming?\nOr are you still awake, your time has run out, player\nNow where you gonna run? Where you gonna hide?\nDeath around the corner and it shows tonight\n('Cause you were trippin' you got caught slippin'\nAnd now you clueless about your situation\nLights out, we know it's hesitation)\n\n[Outro: Larone Burnette]\nWe're gonna leave you clueless, clueless\nAnd all you peeps and hustlers wonder why and how do they we do it, do it\nComing with finesse, you're messin' with the best\n[?]nothing but music bumped and straight [?]\nDon't try to find it, or even bite it\nJust brought the music to your head and get excited\nCause we comin' real smooth, so what you wanna do\nWanna be down with me and my crew?"}], "artist": "Tech N9ne"}