{"songs": [{"title": "Desire Want and Need", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2009-01-22", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg", "lyrics": "[Hook]\nGot goals, got dreams, Im infatuated with nice things\nI love money, it might seem\nThis is my desire want and need\n\n[Verse 1]\nAll I do is eat shit and think about success\nCause man,I done have enough stress\nBut I beat every obstacle they put up\nIm back against the wall like a stove so I cook up\nI've always been the best at every single thing I took up\nSo I feel extra bad for the challenges they hooked up\n(D-Town)Come and make a visit to the (West Side) if I need to be specific\nIf I ever up in court best believe I plead the fifth and they headed to the club bartender bring a 50\nThese niggas bitches swear to god they PMS'ing\nIm just chillin' with my family, Mr. Peter Griffin\nAnd my girl look better than yours\nAnd Im the only thing lookin better than her\nYeah, and Im just tryin to make a million off recordin'\nPsychic read my fortune, said Id be worth a fortune\n\n[Hook][x2]\n\nI learned at a young age you gotta grind for it\nWe been waitin' all day n night for it\nIt seems like we've been waiting all our life for it\nSome niggas will take a life for it\nBut Ima say it I did it all legitimate\nThen put my niggas on it just to say I was considerate\nRace to success and Im like where the competition went?\nThe musics runnin' bitch and it never tore a ligament\nNiggas comin up to me like Sean I beg your pardon\nB-I-G, but how much is you chargin?\nRunnin' up to me for they buzz like a barber\nAnd all that weak shit just make mine sound harder\nAnd Ima live this life till Im gone\nOnly people that could give you life is a judge and God\nBut the only one that judge me is my God\nSo Ima live life like fuck what you thought\n\n[Hook][x2]\n\n[Bridge]\nThis is what I live for\nThis is what I die for\nThis is what I stayed up every single night for\nThis is what I waited my whole life for\nThis is what I waited my whole life for\nThis is what I live for\nThis is what I die for\nThis is what I stayed up every single night for\nThis is what I waited my whole life for\nThis is what I waited my whole life for\n\n[Hook][x2]"}], "artist": "Big Sean"}