{"artist": "G Herbo", "songs": [{"title": "Another Day", "album": "Welcome To FazoLand", "year": "2014-02-17", "image": "https://images.genius.com/4af4495189941f1b86086adb14c093ca.300x300x1.jpg", "lyrics": "[Intro]\nGANG!\nLouie what'chu on bro?\n\n[Verse 1: Lil Herb]\nAnother day, another body droppin'\nIf I go broke then I'mma rob somebody\nA fragile body can't survive a shotty\nPump a nigga, I'll slump a nigga\nAnd I been shot at by a bunch a niggas\nBut I'll still  never run from a nigga\nCatch a nigga hollows flyin' for dem niggas\n50 hit every last one of niggas\nGot some old heads that'll slump a nigga\nBut you still can get killed by my younger niggas\nMy young niggas hungry, put 'em on a lick\nAnd they'll take every last thing from a nigga\nI got hittas wit' me rollin' off a flat\nNow it's hittas in me, ridin' wit' this 30\nI might high speed, so I think that I might go get me a Hemi\nLil bro gotta 30 now it's me and 60\nWe ain't goin' in 'til them bitches empty\nMally tryna make his Glock go empty\nRidin' on them oppers but they block so empty\nKobe make me wanna catch a body\nSeeking for revenge, but that's not forgiveness\nMy niggas ridin' wit' it, they on business\nShoot a brick a hunnid times, put that on Guiness\nMy hittas know they don't condone the snitchin'\nFuck a trial, broski dome the witness!\nLookin' for them niggas, why they keep sneak dissin'\nSee him in the field, up the nickel\nNiggas act like they pretendin'\nBitch I'm in the field wit' the steel\nNiggas say they wanna kill me, act like they forgettin'\nLil bro keep a Glock wit' 30 shots for any block\nWit' red beams to help them pay attention\n\n[Verse 2: King Louie]\nAnother day, another dollar for me\nWake up and get to the money\nMoney on me so that tool is on me\nIf I want him gone, I'll put money on 'em\nAKs wit' them hunnids in 'em\nLet 'em up, bring out the runner in 'em\nIon bop I do the money dance\nPack louder than an ambulance\nI be goin' dumb wit' my big head friends\nThem new hun duns make me feelin' friends\nI spend hella bands on my Robin jeans\nGotta get this green by any means\nCop killas in the magazines\nFrom the block to the magazines\nI'm Mike, yo bitch Billie Jean\nMake her best friend lick her belly ring\nMy life like a Belly scene\nCatch me flexin' in that Pelle thing\nBitches want me like a wedding ring\nNo answer I just let it ring\nNo time to talk baby 'tml'\nAnd ion set up no voicemail\nM.O.B. 'til I D-I-E\nWit' a beam on tha heat, I could shoot a bee\nShoot a creep in the eye and tell 'em, \"see\"\nI told yo dumbass not to fuck wit' me\nNo love for a bitch I just fuck and leave\nShe just suckin' dick, and she ugly\nI'm sick of gettin' bands I got counterflu\nKillas a hit up a carnival\nGet shot hella times like its lots of you\nWe DOA they can't doctor you"}]}