{"artist": "Benzino", "songs": [{"lyrics": "[Intro: Benzino] + (Lil' Kim)\nAyo (Benzino where you at?)\nIt's Yellowman, Benzino wanna rock the party\nAnd we gonna bring this to the after party\nQueen Bee wanna rock the party\nUh, uh, oh (Oh my God)\nYeah (Benzino where you at?)\n(Bounce) Yellow City gonna rock the party\n(This is the G-Mix)\nYoung Hef wanna rock the party, Petey Pablo\nYellow City, yea\n\n[Verse 1: Lil' Kim]\nIt's your girl Queen Bee with the poisoness sting\nChinchilla draggin' with the diamond G-String\nBouncin' on Lorenzos I'm the Bee with the wings\nWho the fuck want what? (What?)\nBettin' it all at the crap tables, rip the casino\nFrom Vegas to Reno, me and Benzino\nWe gonna rock the party and drink Bacardi, all damn night\nAwww watch me shake my ass like a fresh bowl of jelly\nQuite Bootylicious like Beyonce and Kelly\nLove to see guys with tattoos on they belly\nLet's get nasty from the car to the telly\nOoh, I got my girls with me, so go get your boys\nCome ride with us, we on the tour bus\nIf you treat us right, and you spendin' the night\nThen we gon' freak\n\n[Chorus: Benzino] + (Lil' Kim)\nWe gon' throw the party, rock the party\nThen drink Bakardi, freak somebody\nThen leave the party to the after party y'all\nNow what ya'll gon' do?\n(We gon' take it off, we gon' turn it out\nIt's hot in here, we gon' burn it out\nWe gon' throw that thang, we gon' back it up\nNow what ya'll gon' do?)\n\n[Verse 2 Benzino]\nBenzino rock the city and you know I can't stop\nBack at the lounge with a mean Diddy Bop\nShorty lookin' mean and her whole team hot\nYo' what's up? Yo' what's up with ya'll?\nShe sippin' cranberry with a splash of Belvedere\nWhat? Five carot 'conia ice in my ear\nAlways drinkin' Coniac with ice when I'm here\n... Nice\nFeelin' how 'Zino put's his game to the test\n36, 24, I think you know the rest\nWhat's your secret ma? How you fit in that dress?\n... Oh damn!\nNow it's gettin' heated and you know what's on my mind\nMe and you, outta hear, I think it's that time\nMake you tap out when I creep in from behind\nNow that's what's up, now everybody just\n\n[Chorus]\n\n[Verse 3: Petey Pablo]\nHey hey hey hey\nMe met a bitch of my dreams, corn jack\nCome on, liquor inside my head like that\nPants saggin', Carolina hat to the back\nI'm in New York City, can you hear me goddamnit\nWeavin' through the traffic, shootin' usual daps\nTryna find Benzino, is it him in the back\nBring it back, porn channel X on the back\nBe like hey hey hey, how'd she do that?\nPretty headed woman, with her fine self\nBow-legged cutey with her tight legs\nTryna get outta here with her friend in the black dress\nSpread her hoochie coochie on my sun beam bread\nNow I been sayin' to myself, Petey Petey\nGet freaky, damn boy I can't even say it\nAnd I got no need to be scared\nSome things ain't supposed to be said\n\n[Chorus]\n\n[Bridge: Benzino] + (Lil' Kim)\nYeah, we gon' rock\nYellow City, we gon' rock\nThe after party, we gon' rock\n(Now what ya'll gon' do?)\nWe gon' rock, we gon' rock tonight\nCuz a Yellow City party don't stop\nUh, we gonna rock tonight\nNow what ya'll gon' do?\n\n[Chorus to fade]", "image": "https://images.genius.com/6e1c33f62c229b45d503c4857602a733.1000x1000x1.jpg", "year": "2002-09-14", "title": "Rock the Party (Young Heff Remix)", "album": "Redemption"}]}