{"songs": [{"title": "Antfarm", "image": "https://images.genius.com/238b9e6cc2f4ca89654df080d14cbadf.240x240x1.jpg", "lyrics": "[Intro]\nIf you follow a light down a dark path the path can go anywhere. Eventually leading to a dark end. If you are the light. You are the path\n\n[Verse One]\nIdentified by an ankle bracelet\nPlaced in head equipment specialized to make me forget\nBe quiet, I benefit observing my past\nTo go against the grain and watch the world behind the glass\nI can't adapt\nPerhaps my flesh makes it hurt\nWith the segregated colony digging in the dirt\nWhat's it worth?\nThe birth of Earth's eternal nap\nSkin peels off my palm as I rub the genie's lamp\nTunnels filled with sap leave ants stuck on stupid\nGathering crumbs, left behind by the morbid\nThe farms lit yet days to nights they both dim\nIn quicksand, I'm trying to learn how to swim\nRead my lips\nIt's hard to speak to the deaf\nSaying Jesus is coming, I might as well hold my breath\nThe dead, never recover from my demand\nThey can't afford their soul so they leave it in the sand\nJesus is coming, my words echo in their ears\nThe Devil's in a red coat and I'm Paul Revere\nWet knees, they kneel down in sand\nNow my tactics reveal to the damn\n\n[Scratch Hook] {x2}\n\"I seek the guiding light for some insight\" - Heltah Skeltah 'Crews, Clans, Posse's and Cliks\"\n\"It's like that y'all\"\n\n[Verse Two]\nI press my face against the glass module\nThe fact that I'm alive is the only obstacle\nI stumble\nOver a crowd of corpse\nA nation of fly soldiers, the decaying body source\nI pawned a suicide while I'm searching for the reverend\nWhy does it take 100 years to get to Heaven?\nI need seven, paces back but I'm a pawn\nI'm starving\nEating associates like Ghengis Khan\nIt's gone\nYou're never advised to provoke\nIt's healthy but goes down like drinking egg yolk\nThe sun pokes it's way straight through desire\nThe magnifying glass made you large, you're on fire\nI perspire from the aspects redundant\nEverything was raised to praise it's bad judgement\nThee advancement in population decrease\nIt seems the wrong motives keep believers on their knees\nAnd they say...\n\n[Interlude]\nYou just go on and on and on repeating this process over the centuries\nHow many roads must a man walk down?\n\n[Verse Three]\nThey replace my thoughts of the cross with lots\nOf theories to leave me lost, I'm lost enough to toss\nMy morals on the cross till there's no guidance left\nPlaying tug of war with thin lines between life and death\nHad you know I would die then why did I live?\nThey knew they could sin cause they knew You'd forgive\nI sit on conclusions, not knowing that something's wrong\nSometimes I sit and dream just to see what's been beyond\nWhatever floats my boat makes hope's remote work\nOne nation divided by variations of the church\nI perch on branches and die with the day\nIf there was anything I could do I would've done it yesterday\nI say Jesus is coming, circle around your tomb\nYou can't rest in peace without knowing your doom\nI assume, it makes sense when it's ended\nNow we both wish I follow through with what I've threatened\nPretend you died for a hopeless cause\nThe Devil is Hitler and you run his Holocaust", "year": "1999-01-01", "album": "Lifefirst: Half The Battle"}], "artist": "Braille"}