{"songs": [{"year": null, "image": "https://images.genius.com/f567edfefa972b04faf2516e9b374839.769x768x1.jpg", "title": "I Wonder", "album": "City of Syrup", "lyrics": "[Intro: Big Moe]\nHuh, Wassup Boo\nMaan, you stay talkin bout you're down wit me\nBut you stay on that complaining thang, you know what I'm sayin?\nI ain't down wit all that complaining and fussin and fightin man\nI'm a playa type dude, I'd like to let my gal get in the way\nBut, you know what I'm sayin, the Lord blessed me with somethin\nSo I gotta take advantage of that, you know what I'm talkin bout\nSo I gotta do it, so its whateva\n\n[Hook: Big Moe]\nI wonder if I didn't come home\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\nI wonder if I didn't come\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\n\n[Verse 1: Big Moe]\nIf I didn't come home, what would you do to me?\nGet on the telephone? Call Tyrone?\nTell him come get you in he morning\nYou're wrong, this is my song\nAnd I gotta pay bills, keep my happy home\nWreckshoppin all night long, I'm ready, fire burnin\nNo matter what you do to me, my wheels gon keep on turnin\nAre you down? So please don't get me started\nI got bitches out of town, if you fuckin wit clowns\nI'll leave you broken-hearted\n\n[Hook: Big Moe]\nI wonder if I didn't come home\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\nI wonder if I didn't come\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\n\n[Verse 2:  Enjolie]\nI let you play one time, then I knew you were mine\nThe way you caress me baby and sex me, I 'd have to say you put it down\nYou took me, and you put me under you're wings, I can't lie\nCan't no other take your place, and can't a damn thang comply\nI don't know if you noticed, but you're the throwedest on my list\nCan't no nigga or no bitch compare their loving to a love like this\nUp and down, thick and thin, I was always there\nReady to box or unload on a bitch, you know I don't care\nWhen you kiss me with your lips, I just fall in a daze\nMe and you against the world baby, priorities are gettin paid\nDiamonds blindin, hoes cryin, ain't a damn thang changed\nShowin up and pourin up, in this damn rap game\nAnd by the way, I'm gon let you run the streets with your thugs\nWhen Valentine's comes around, you know who's gettin your hugs\nFuck faces by fireplaces, Drink chases on mink rugs\nYou a dog, you gon rome, but always find your way home, so what\n\n[Hook: Big Moe]\nI wonder if I didn't come home\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\nI wonder if I didn't come\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\n\n[Verse 3: Tyte Eyes]\nNow if I don't come home, would you blow up my phone?\nPunch holes in my styrofoam? Misplace my chrome?\nChildish games in yo dome got yo mind confused\nA made nigga or a fake? Now its time to choose\nMany have tried my shoes, but didn't travel too far\nYou knew the shit that you was in before you fucked the star\nLook how you suck up all my barre, you think this shit's for free?\nAll this hustling in these streets keep all this ice on you and me\nPicture how nicer it can be, private flights twice a week\nWithout you gripin about some freaks and how they saw me at the beach\nI'll practice what I preach, you sit being obsolete\nAnd remain to keep my business and my hustle out of reach\nAnd now if I don't come home, would you still be down?\nYou are a fool, I will admit, but start practicin now\nCuz I'm still the same playa that's all about my dough\nAnd I'm not comin home tonight, you triflin ass hoe!\n\n[Hook: Big Moe]\nI wonder if I didn't come home\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh\nI wonder if I didn't come\nWould you still be down with me, yeah\nBecause I'll leave you tonight, uh ohh"}], "artist": "Big Moe"}