{"artist": "6ix9ine", "songs": [{"year": "2019-01-14", "title": "Alright", "album": null, "lyrics": "[Intro]\nPeyoteBeats\n\n[Verse 1: 6ix9ine]\nNiggas want war, yeah, kick the door, yeah\nRun up, break your jaw, yeah, get it on, yeah\nI'ma hit a stain, yeah, broad day, yeah\nNiggas act fake, yeah, catch a fade, yeah\nNiggas said I changed, yeah, made some change, yeah\nI could never change, yeah, still the same, yeah\nI'm still in the hood, yeah, busting juggs, yeah\nPuffing on a Wood, yeah, smoking good, yeah\nShorty want a pic, yeah, that ain't shit, yeah\nTold her do a trick, yeah, on the dick, yeah\nBust her whole shit, yeah, in her ribs, yeah\nLeave her with my kids, yeah, on her lips, yeah\nSkrrt off in the Benz, yeah, doing tricks, yeah\nTwo hundred on the dash, yeah, tell the cashier\nThey want me, I don't lack, yeah, got my gat, yeah\nTalk hot on getting whacked, yeah, body bag, yeah\n\n[Chorus: BlitzedOffLeah]\nI want your drugs not your love, is that alright?\nWon't you whisper, won't you tell me what you like?\nWe can just light up an L and smoke all night\nI'ma do you right, baby, so hold on tight\nI want your drugs not your love, is that alright?\nWon't you whisper, won't you tell me what you like?\nWe can just light up an L and smoke all night\nI'ma do you right, baby, so hold on tight\n\n[Verse 2: Warhol.ss]\nHol' up, ayy, yeah, shawty, how you do it?\nPinky ring clean and that boy actin' foolish, uh\nWhy you looking at my neck? Uh, chain iced up\nAye, aye, stepping up in YSL I'm fly as fuck\nAye, yuh, niggas can't fuck with the kid though\nRaw stepping in, diamonds shining like a rainbow\nOoh, aye, shorty want, I'ma paint her face though\nPaint her face, though, feel like Picasso\nAnd no bravado, and no Fusaro\nComing in here, coming in here, dump the bankroll, uh\nGot the bankroll, uh, 'cause I do these shows, uh\nAnd I count that guap, uh, and I fuck these hoes\n\n[Chorus: BlitzedOffLeah]\nI want your drugs not your love, is that alright?\nWon't you whisper, won't you tell me what you like?\nWe can just light up an L and smoke all night\nI'ma do you right, baby, so hold on tight\nI want your drugs not your love, is that alright?\nWon't you whisper, won't you tell me what you like?\nWe can just light up an L and smoke all night\nI'ma do you right, baby, so hold on tight", "image": "https://images.genius.com/7192138470fbe87683b47123f7c9017d.500x500x1.jpg"}]}