{"songs": [{"year": "1994-11-15", "album": "Ass, Gas, Or Cash (No One Rides for Free)", "image": "https://images.genius.com/2ecc6ba233195d569596674edf4c971a.400x400x1.jpg", "title": "Hittin’ Corners", "lyrics": "[Verse 1]\nAnotha Day!\nDolla\nHolla if you hear me\nComin with the bumps in my hoop'\nAs swoo-woop\nHere I am\nThe mack it's clear I am\nK-Dee, so baby get with the program\nDamn\nWhat's on the menu\nIt's about 10 to 5\nSo let me see what the weather's like\nStep outside, glide to my ride, hit the button for the alarm 'chirp-chirp-disarm'\nPull the top back, cock the hammer on my Glock back\nI ain't trippin, just lettin' 'em know I ain't slippin\nSippin, on some Lipton Iced Tea flossin\nDon't trip, it ain't easy, cause it costs to be the boss\nAnd so, I'm on the hunt\nNever front with the cash flow\nHittin' Corna's slow on the go so now you know\nMy tires are Armor-All'd, spit shined wax on\nTank kinda low so I pulls into Exxon\nGive me 10 on six, damn look at baby at pump 4\nWhat you doin with all that rump, ho?\nShe must have endz, rollin in a benz\nCould it be her's, or maybe it's her boyfriend's?\nSlid me her number\nI wonder if you got a man, cause not a man other than me can get you hotter than\nCayenne pepper\nSwept her off her feet when I boned her\nCatchin bitches hittin Corna's\n\n[Hook]\nDiamond in the back\nSunroof Top\nDiggin the scene how the players lean\nAnd to the ho's that be out there strollin\nYou know I'm rollin\nCreepin up on ya\nHittin Corners\n\n[Verse 2]\nSkip to my Lou, took a sip of my brew\nCalled up my homies and took a trip with my crew\nDown to the spot where the ho's all jock\nTwenty-four seven around the motherfuckin clock\nTick-tock as they flock in packs\nThe macks come around while the other's look for sacks\nBut I'm lookin for the ones that ain't too proud to beg\nWhen I spots 'em, watch 'em, swing from this third leg\nHittin no switches, but still gettin my clown on\nBanked a quick left cause there's more of them down on\nCrenshaw and Vernon, watch the curb while I'm turnin\nDon't wanna scrape them tires, they ain't no Dayton wires\nBut I still got 'em feenin, leanin like I'm in the '64\nBut I'm in this coupe and I'm still lettin these tricks know\nI'm from that number 1 crew in yo area\nI ain't bullshittin, the corners I be hittin'\n\n[Hook]\n\n[Verse 3]\nOne time I was rollin deep, I creep with caution\nI'm bone it, cause they want it, I don't sleep that often\nSlauson make a right cause they got it blocked off\nFor 3 corners straight up to 58th street\nDetour, be sure they ain't on my tail\nBail, what the hell, they gets smoked on the DL\nJust let me ride like Dre, and play my music loud\nSteady mobbin', heads a bobbin' as I move through the crowd\nSlow down, hit the hazards when I cross the train track\nMy sounds are bumpin' loud enough to make your brain crack\nBazooka Tubes bumpin Ice Cube, nigga make it rough, make it smooth\nYeah, show yo eyes so act like you know\nIt's 1994 so let this mack through the door\nI'm in like Flynn, there ain't no stoppin\nSeen my homie Snope, nigga what's poppin?\nChronic smokin, have yo ass chokin\nJust about to blaze, damn we had to raise\nCause 5-0 creep my homie peeps so we jetted\nGot my 9, plus no time, to be gettin sweated\n\n[Hook until the song ends]"}], "artist": "K-Dee"}