{"artist": "Preme", "songs": [{"album": "Off The Books", "title": "Dipped In Gold", "image": "https://images.rapgenius.com/c85eb4f2ba7bf1d3e03ca16f60bd0d72.500x500x1.jpg", "lyrics": "[Hook: Young Thug]\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in there\nI just, I just, I just, I ju-I ju-I just bought a, I just bought a\nI just bought a, I just bought a, I just, I just, I just\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in gold\nShe just bought a rollie just dip it in gold\nWe just bought some rollies just to dip 'em in gold\n\n[Verse 1: P. Reign]\nGo getters, no bullshitters\nGot ten lil niggas and they all hitters\nMake some buddy tell them strippers we the big tippers\nWhole clique full of stars we the big dippers, nigga\nSee me pull up and the wrist glitter, whoo\nTwo-stepping in my chinchilla, whoo\nSay she smoke and she drink liquor\nWell that bitch to tell her bitch to bring a bitch with her, nigga\nShowed up, and we showed out\nBout a millie worth of cars when we roll out\nHoly moly out my waist, Glock coked out\nGold rollie, white face, wrist coked out\nI'm in the A ridin' round with the connect right now\nCause Tip taught a nigga how the birds fly south\nWhen we surf through the strip club hoes wipe out\nGot a Boosie on my wrist and that shit wiped down, nigga\n\n[Hook: Young Thug]\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in there\nI just, I just, I just, I ju-I ju-I just bought a, I just bought a\nI just bought a, I just bought a, I just, I just, I just\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in gold\nShe just bought a rollie just dip it in gold\nWe just bought some rollies just to dip 'em in gold\n\n[Verse 2: T.I.]\nPiped up, rollie iced out\nHaters going back and forth, this shit to fight about\nI'mma, pull up on you with the lights out\nFuck a, ride and get you ass wiped out, nigga\nIt ain't nothing but a G thang\nIn the 6 with bunch of bitches me and P. Reign\nAy wussup? Got the trunk full of sticks on Auto's\nNot ya purse, stole the car on forgiatos\nHey, tell the plug we’re leaving with a carload\nThey ask 'em, who's is telling? Everybody, call Carlos\nYou don't bang, can't borrow, you keep bread in parlay\nYou dickhead, you get scared, you repair in my way\nYou retard, is you not remember who we are?\nWe shoot you from PR, you pretend to be hard, well we hard\nI seen from far away, you got a weak heart\nYou reputation's to question\nI have to check the G card\nMembership says expired on it\nJust put up ya application, see you lied on it\nYa getting towards the loner, I've got  5 on it\nSky dweller, all yellow, said 5 on it\nTurn it\n\n[Hook: Young Thug]\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in there\nI just, I just, I just, I ju-I ju-I just bought a, I just bought a\nI just bought a, I just bought a, I just, I just, I just\nI just bought a rollie just to dip it in gold\nI just bought a rollie just to dip it in gold\nShe just bought a rollie just dip it in gold\nWe just bought some rollies just to dip 'em in gold", "year": "2015-12-02"}]}