{"artist": "Cam’ron", "songs": [{"title": "Freak", "album": "S.D.E.", "year": "2000-09-19", "image": "https://images.genius.com/61effe5c9676b450f29c101e5563907e.960x960x1.jpg", "lyrics": "(Guy singing)\nI need a freak\nI need a freak\nGirl I need a freak\n\n[Verse 1]\nI'm the one that is the low-key Don\nDick stay hard, call me Pokémon\nCause I'm the one they call Cutie pie\nI'm the one with the Gucci tie\nI'm the one with the brand new Benz, droopy eye\nThats the one they said \"I knew he'd buy\"\nI'm the one who be fly\nI'm the one that hit it from the back, dookie pie\nOh, you ain't gon' sue me right?\nWhats that there? your coochie (aye!)\nI'm the one to play it off\nI'm hard already girl, make it soft\nSisqo wants to see your thong, I wanna see you take it off\nOr I'll pull it to the side, break it off\nRight to left, up and down, front to back\nTurn around, head down, I wanna hit it from the back\n\nChorus - (man singing)\nI need a freak\nI want a freak\nThats what I need tonight\nAt every club I like a freak\nI need a freak\nI need a nasty girl, girl I need a freak\n\n[Verse 2]\nI met this one girl smokin' a blunt\nI went to her house, she starts to front\nNah, I gotta potty, why you teasin'?\nPulled out my dick, why you cheesin'?\nThen while I hit it, why you wheezin'?\nHold up girl, why you sneezin'?\nPull out my dick, why you bleedin'?\nWhen I get my clothes, \"why you leavin'?\"\nBut Ma had chrome to play wit'\nShoes by Joan and David\nWhen I was in the whip I asked for dome, she gave it\n\"Ooh, I taste it\"\n\"Ooh, my favorite\"\nThat girl had me out my thug\nI liked her alot but her mouth I loved\nRight to left, up and down, front to back\nTurn around, head down, I wanna hit it from the back\n\nChorus 2x\n\n[Verse 3]\nFemales, go 'head, act surprised\nYa'll like sex more than guys\nPop the question, they get silly\nYou got your period? \"umm, not really\"\nWhats that mean to be polite?\n\"It's the last day and it's real light\"\nYeah right, you leak leaky\nCall me next week, I'm not that freaky\nSome girls come for a dance\nSee that fat ass all in a stance\nAll I do is a touch or a glance\nYou won't have Killa Cam bust in his pants\n\nChorus 4x"}]}