{"songs": [{"lyrics": "[Intro] (x16)\nAesop Rock (Aesop Rock)\n\n[Verse 1]\nIs a love such as that which I exhibit for my practice\nThe factor which then amalgamates debates with straight-jackets and robes\nHuddled in brackets that blacken the average globe\nXenophobe, loathe to modify the fly, feel this..\n\nI carve a notch in my wall for every stall\nEvery fifth mark slants diagonal to symbolize your downfall\nDrunky peasants, honor the shifty Megatron presence\nSlug a bolt once ceremonies of merit turn bloodsport\n\nVoted hella high seas, I freeze your mega dumb company\nPumping out wise beads like, plot sneak-attacks on dry leaves, dunce\nCrooked rumors turn zoomers when rookies talkin'\nBad seeds blossom the Wookiee walk. Hawk and\n\nLet a sucker drift, I lift up every stone prone to find\nThe point at which repellent signals ultimately bind\nWhen a pack of style mimics see my brains target the cluster\nI advance clutchin' the mic like bully to knuckle duster\n\nAnd ascend. Your riddles yield a little plastic blend\nFuck a badge, light a bonfire dancin' jig around the pig\nFigurin' yeah, I'll land a plane on bleached-stained trackers\nUsin' only the finest and post-modern terrain mappers\n\nOnce my brethren disperse\nMy god, you think the heavens touched the earth then\nThirstin' a perch on a bursted curse\nBut I don't. Confide: wine and water chose me\nBored: lasso down Polaris, let the glow amuse me\n\nOk, I lay me down to sleep, creepin' a slumber under red skies\nHeads splittin', straight sippin' a drip of dead vibes\nIt's red tides from here, stop and smell analog hell\nClenchin' a stench of burnin' logics and a child with yearning optics\n\nNow someone's approached the rope, shaken like snow-globes\nOther sought safety in numbers, other's flows got towed under (Yeah)\nStill another took a turn and crashed and burned while others flee\nBut there will never be another starvin' marvel like me\n\nSee, there's a time when... rhyme and...\nPaint combined can't even manage to tell what the swell is like\nPicture your imagery embellished\nWith the hellish aspects of the swarms' forlorn facets\n\nSoul crafted fact cats, boroughin', left perennial tenants discouraged in\nDiscussin' my four seasons flourishing, uh!\nSearching, perching, poetic lead poison\nPoised in ploys to leak a little bit of moisture on your pride\n\nI'm a animated style machine intervening faulty production fueled by nicotine suction\nFrom ducks in my carnival to vipers in my garden\nYou flash identify by the genus, species and class. Start to chuckle\n\nBuckle the architecture til it fell through\nKill the survivors then raise the dead for shock value\nBy the time the pending settlement's fully negotiated (yeah I'll...)\nI'll have put aside a few to get myself situated\n\nSo like sadly, my style spooks juveniles like Boo Radley\nRadically weak assume the colonel Kurtz in our platoon soon enough\nThat's one bluff call, toughens the searcher\nStuttering, emerging, gutter urchin, bursting\n\nI live for the moment of truth when Big Willie rapper\nAcknowledges failure and states \"Goddamn my shit is trash\"\n\"It's time to let go.\" Tin man banging upon his chest to hear the echo\n(Heartless, kid. Hollow compartments.)\n\nBe we the people of the united, starving artistic\nMilitia keep movin' in order to form a more perfect union\nI'm cluing into the poison panoramics brew the panic situations\nIt fucks a little with my brittle gift\n\nI tell myself \"Stay\" (Stay)... up high\nMake a mockery of sun and moon and star 'till they hand over the sky\nMy de luxe is, fluxes, pivots to where the crux is\nInvade the town while village elders holler \"Who the fuck's this?\"\n\nSee: hipper cats aggravated, trudge through the muds\nQuicken ones, plots thicken like, coagulated blood\nRugged serpentine climb, pebble to rock\nLet your pretty pink cloud nine expectations please you not\n\nI'm, Ae-*fucking*-sop Rock, mic bizarro\nProper application of the soul by my standard\nCandid once position from which instigations spawn\nAnd man, I plan to die with a mic in my hand, it's like...\n\nAbandon all hope y'all, abandon all hope, it's like\nAbandon all hope y'all, abandon all hope...", "title": "Abandon All Hope", "album": "Music for Earthworms", "image": "https://images.genius.com/355a2e1156bc79b1e8d0997024f4cc06.300x302x1.jpg", "year": null}], "artist": "Aesop Rock"}