{"artist": "Plies", "songs": [{"album": "Da REAList", "title": "2nd Chance", "image": "https://images.genius.com/a97af29ec97ef69b9b1d54a68b3f8f10.500x500x1.jpg", "lyrics": "[Plies]\nI went to see my nigga, he doin seventeen\nOne of the realest niggas, I done ever seen\nGot caught with a bird, but his record was clean\nComin back from Dade, on the Gator with speed\nHe a real soldier, but his partner was green\nGet out when he 40, went in at 23\nHow seventeen years worth one key(kilo)\nSome shit cost twenty grand can get you over ten piece\nHe ain't wanna hurt nobody, he was just tryin to eat\nHe had a real job, went to work fo' days a week\nSaid this his last trip, and he was gettin out the streets\nHe a good nigga, second chance all he need\n\n[Hook: repeat 2X]\nSome niggas make mistakes, off fucked up circumstance\nNow they life gone, probably gon' die in the pen\nThey done gave up on life, done put it in God's hands\nI thought this was America, what happened to a second chance?\n\n[Plies]\nWish I had one chance, to sentence the Judge kids\nAnd watch 'em beg fo' they life like my niggas did\nGive them a life sentence, fo' some shit that wasn't big\n'Fore they get granted they appeal they gotta do ten\nShoe got to be on the other foot for you to understand\nThe scariest shit in the world to be a black man\nWhat my future holds, wish I knew in advance\nI 'proach life everyday just hopin I win\nA lot us already lost, we sittin in the pen\nThis shit crazy cause God, he forgive sin\nBut when it come to the system that shit don't bend\nI guess it do, dependin on the color of yo' skin\n\n[Hook]\n\n[Plies]\nI thought it was understood, nobody was perfect\nSo how can one mistake, make yo' life worthless?\nGod made us all, put us here to serve a purpose\nYo' life in twelve strangers hands to come back with a verdict\nBut is that really fair? What if they all was dirty?\nYou mess up one time, and they come back with thirty\nBut if you ain't got money, yo' whole family hurtin\nThen you ain't got a choice, you gotta cop out early\nBut if you was rich, you wouldn'ta got them thirty\nWhat if the Judge racist? Nobody to overturn it\nThis system fucked up, because it ain't sturdy\nWelcome to America, home of the controversy\n\n[Hook]", "year": "2008-12-16"}]}