{"songs": [{"year": "2017-11-15", "lyrics": "[Intro]\nI don't rap verses, I rap universes (to Pangaea!)\n\n[Chorus]\nNo, I ain't come to talk, ain't come to play\nCame to fuck shit up, what you got to say?\nNo, I ain't came to talk, ain't came to play\nI'm here to fuck shit up (rare, rare)\n\n[Verse 1]\nI'm here to fuck shit up (wow)\nYou ain't even scratch the crust (stop, stop, stop)\nPlease, do not touch the tux (stop, stop, stop) (don't touch the tux)\nI can't concentrate, I'm stuck\nAin't tryna debate, it's not MMA, you play with my plate, you bait (on me)\nI fold up your bae, like paper maché, I got to feng shui the place (on God)\nThey can't imitate the great (on me), I do not take the bait (on God)\nI mean what I say, in 25 seconds this message will self destruct (fuckin' shit up)\n\n[Chorus]\nNo, I ain't come to talk, ain't come to play\nCame to fuck shit up, what you got to say?\nNo, I ain't came to talk, ain't came to play\nI'm here to fuck shit up (woah)\nI'm here to fuck shit up\n\n[Verse 2]\nLook, third eye is functioning, and I'm in a function\nI might go gorillas, go ape like a jungle gym\nToo much of cannabis, too much of funguses\nI get monstrous with my mantras, bitch\nI like extra condiments on my consonants\nAin't no theories over here bitch, just common sense\nIn real life you internet gangsters just want a pic\nGee willikers gee my golly who'd I offend?\nSynonymous with these psychotic psychiatrists\nThe villain within, or depending on who, the victim within\nIf you've got a point that you really do need to defend, vent to a friend\nBaddest motherfucker walking since woman invented man\nI'm in it to win, I'm knee-deep\nShe's down at my shins feeling my print\nShit, I feel like I'm Prince\nIf you happen to use my name in a sentence shit, future tense\nDon't know if it's clear to you what it appears that I'm here to do\nShit I paid my nigga dues, I transformed you niggas' views\nI'm fucking shit up, lit fuse, fuck you and your ten views, bitch\n\n[Chorus]\nNo, I ain't come to talk, ain't come to play (ray bands)\nCame to fuck shit up, what you got to say?\nNo, I ain't came to talk, ain't came to play\nI'm here to fuck shit up\nI'm here to fuck shit up", "title": "Boom", "album": "The Upside Down", "image": "https://images.genius.com/80b7755ae65f45310ea769723859119e.1000x1000x1.jpg"}], "artist": "B.o.B"}