{"songs": [{"year": "2017-10-02", "album": "ACHOO!", "image": "https://images.genius.com/5dd1babf1fd8791100b55316e37622e1.500x500x1.jpg", "title": "Achoo!", "lyrics": "[Intro: Ski Mask The Slump God]\nThey wildin' out, aye!\nHuh, woke up on a cloud of sauce\nWet, that's better\nI need my water\nI just be sick, sick, sick\nI just be sick, sick, sick (Aye)\nI just be sick, sick, sick\nI just be sick like a sneeze (Yuh)\nI just be sick like a sneeze (Huh, huh)\nI just be sick like a sneeze (Huh, huh, aye, I am replenished)\nI just be sick, sick, sick (Water!)\nI just be sick, sick, sick (Aye, sick like a pimple)\n\n[Chorus: Ski Mask The Slump God]\nI just be sick like a sneeze (Huh, huh)\nI just be sick like a sneeze (Huh, huh, sick like a what?)\nI just be sick like a sneeze (Huh, sick like I'm who?)\nI just be sick like a sneeze (Aye, sick like I'm who?)\nI just be sick, sick, sick (Huh, huh)\nDiamonds, they sick, sick, sick (Huh)\nMy jewelry is cool just like a breeze\nI just be sick like a sneeze, huh\nI just be sick, sick, sick, sick, sick, sick (Achoo)\nSick, sick, sick, sick, sick (Ouch, ouch)\nI just be sick like a sneeze, ooh (Walk up in the club, aye)\nSick, sick, sick, sick, sick, sick, sick (Just like a pimple, look at it)\nDiamonds, they sick, huh, yuh\nI just be sick like a sneeze (Wa-wa-wa-wa-wa, aye)\n\n[Bridge: Ski Mask The Slump God]\nWater (Yuh, aye, aye, aye aye aye)\nJust like a pimple (Just like a-)\nJust like a nipple (Just like a-)\nAye, never gave a fuck, uh (Aye, back still hurt)\nI don't give a fuck (Huh)\nNever will give a fuck (Huh)\nAye!\n\n[Verse 1: Ski Mask The Slump God]\nMy diamonds, they cool like a breeze (how they be cool)\nI just be sick like a sneeze (how they be cool)\nOh my god, Jesus, Reese's in the pieces\nPeanut butter colored LV, huh (Aye)\nI just be fistin', all on your missus\nThis is a vengeance, R. Kelly fetus (This is a vengeance, R. Kelly-)\nAnd I rap in season 'cause don't need a reason (None)\nTo bust open a gun at your knees, bitch (None, what? Wow)\nI'm like wow-zer (Wow, wow)\nShe don't want me gouge her (Gouge, gouge)\nPussy, 'cause my dick, it large (It)\nJust like a McDonalds fries, sir (Make it)\nMy bitch is a witch, but when on me, don't catch a curse\nGoyard on me, they can't afford but they call it purse\nI didn't think this shit washed your pocket more than Allure\nHol' up, bitch, my money is so-\n\n[Bridge: Ski Mask the Slump God]\nSick, sick, sick\nMy money, sick, sick, sick\nMy money, sick, sick, sick\nMy money, sick like a sneeze\nMy money, sick like a sneeze\nMy money, sick like a sneeze\nMy bitch is sick like a sneeze\nMy diamonds-\nAye!\n\n[Chorus: Ski Mask The Slump God & Keith Ape]\nI just be sick, sick, sick, sick, sick, sick, sick\nI just be sick, sick, sick\nI just be sick like a sneeze, huh\nMy jewelry is cool like a breeze, huh\nI just be sick like a sneeze (Aye, yah)\nMy jewelry is cool just like a breeze (Aye, yah)\nI just be sick like a sneeze (Aye, yah)\nBitch (Aye, yah)\n\n[Verse 2: Keith Ape]\n얼어붙어 버린 팔찌\n손목에는 얼음 장식 (E-yeah-e)\n난 바닷물 과다 섭취 (E-yeah-e)\n마치 범고래 된 것 같이 (Yuh, yuh)\n나는 셀 수 없는 돈을 원해 (Aye)\n보물이 내 목을 조르려 해 (Aye)\n나는 걸어 다니는 범고래 (Aye)\n물방울이 나의 온몸에\n내 주먹에는 보석이\nMilo 얼굴 모양 목걸이 (Yeah)\nBapesta 별 모양 귀걸이 (Yeah)\n온몸에서 끊임없이 뿜어, 빛 (Yeah)\n내 식구들은 pull up with a beam (Yeah)\n내 친구들과 poppin' on some beans (Yeah)\n나는 피고, 날아, 하늘 위 (Yeah)\n너무 가까워, 보여, 하늘이 (Yeah, aye, aye, yeah)\n여긴 너무 가까워, 보여, 하늘이 (Yuh)\n고소공포증, 불안정해, 나의 마음이 (Aye)\n내 통장에는 절대 오지 않아, 가뭄이 (Yuh)\nBape랑 명품들이 전부 내 장바구니에 (Aye, yah)\n여긴 너무 가까워, 보여, 하늘이 (Yuh)\n고소공포증, 불안정해, 나의 마음이 (Aye)\n내 통장에는 절대 오지 않아, 가뭄이 (Yuh)\nBape랑 명품들이 전부 내 장바구니에 (Yuh, yuh, aye)\nAyy, 난 보름달 쳐다본 손오공 (Yuh)\n내 두 손에 쥐어진 여의봉 (Yuh)\n적들을 향해서 쏜 원기옥 (Yuh)\n난 근두운을 타고 저 멀리로 (Yuh, aye)\nSippin' on the wock, and I'm laid back, aye (Woah, yuh)\nRollin' up the woods, and I like that, aye (Yuh)\nRollie on my wrist, yeah, I like that, aye (Woah)\nBroke-ass ninja, I don't like that, yuh (Yuh, aye, yuh, aye)\n\n[Bridge: Keith Ape & Ski Mask The Slump God]\nMy money, sick, sick, sick\nMy money, sick, sick, sick (Sick)\nMy money, sick, sick, sick (Sick)\nMy money, sick like a sneeze, aye (Sick, sneeze)\nMy money, sick like a sneeze, yuh (Sneeze, sneeze)\nMy money, sick like a sneeze, aye (Sneeze, sneeze)\nMy bitch is sick like a sneeze, aye (Sneeze, sneeze)\nMy bitch- My money- (Aye, sick, sick)\nYuh (Ayy)\n\n[Chorus: Ski Mask The Slump God]\nI just be sick, sick, sick, sick, sick, sick, sick\nI just be sick, sick, sick\nI just be sick like a sneeze, huh\nMy jewelry is cool like a breeze, huh\nI just be sick like a sneeze\nMy jewelry is cool just like a breeze\nI just be sick like a sneeze\n\n[Outro: Ski Mask The Slump God]\nBitch!"}], "artist": "Keith Ape"}