{"artist": "Astronautalis", "songs": [{"title": "SIKE!", "image": "https://images.genius.com/e789c1eee5bf67c9330ead32545b7bf5.1000x1000x1.jpg", "album": "Cut The Body Loose", "lyrics": "[Verse 1]\nI've been on some burn it down, leave this town, never look back shit\nPassing out on your couch, sneaking out the back tip\nRipping credit cards out your mail box, snatch shit\nCharge it to the gameplay boy, it's practice\n(What are we talking about, practice?  We're talking 'bout practice, man.)\nThey be on some got this, squat this, reroute the power grid\nCops can't stop this, over our dead body, bitch\nHeat this, drop this, turn it up louder kid\nPut it down in our path, million ways around this shit\nWe backstage, sterilising tattoos with beer\nYour cats stay paralysed from bad news and fear\nYou're underage, they'n't fucking let you in here\nFake ID, G, you'll buy us all a beer\nI'm sick of kids who sit and bitch about they can't get into shit\nYour 'woe is me' steez is just getting bit ridiculous;\nFucking ay you're underage, that means they just slap your wrist\nIf not you're young and fit, yeah bitch I'm running pits\nHah!  And give them all trophies\nHah, and some orange slices\nYeah y'all already know me\nOne of the only that's really grinding\nLazy motherfuckers want to call it luck\nBut real motherfuckers know there ain't no such\nThing 'cos I mean there ain't no free lunch\nYou better fix your own plate or serve one to us\nGo and pray to your god or complain on Facebook\nStay waiting for your dad to come save the day, dog\nVoted for Obama and expected change\nIt's just one big party all giving the same gifts\n\n[Hook x2]\nSike\nLike a P.O.S. t-shirt\nYikes\nIt's only gonna be worse\nRight\nBut this beat is kinda beserk\nTurn it up loud until my fucking teeth hurt\n\n[Verse 2]\nYeah girl, I own some gold teeth\nI'm Southern, I was taught to hold heat\nAin't no gangster, tell that true\nRick Ross just a cop with some bad tattoos\nHey, Florida and my neck stay real red\nWhy you make-believe pushing that white shit?\nYou dressed-up gangsters can play pretend\nI stay slinging them white girls 'round my bed\nYoung Steve McQueen spit that dick game\nYou tweet real posse for a bitch with a tin chain\nI don't need no Maybach just to sharpen my pimp game\nPull girls on my bike, ride my handlebars home man\nOoh, I put my word on that chief\nRihanna gonna holla way I murdered that beat\nI cut them like an umbrella, King Kong in the bed sheets\nJust try a better fella when you're done with that deadbeat\n\n[Hook]\nSike\nLike a P.O.S. t-shirt\nYikes\nIt only gonna be worse\nRight\nBeat is kinda beserk\nTurn it up loud until my fucking teeth hurt\n\n[Verse 3]\nSee?  I can write your dumb raps\nPay me and go buy some hubcaps\nFake G's still talking 'bout gun claps\nIt ain't gonna happen, like A-Rod's comeback\nTalent is cheap, money's all made up\nGallons of Beam and the speakers stay bassed up\nFuck it, I got nothing left to say, son\nY'all Get Cryphy, thank you Based God\n\n[Hook]\nSike\nLike a P.O.S. t-shirt\nYikes\nBut it only gonna be worse\nRight\nBut this beat is kinda beserk\nTurn it up loud until my fucking teeth hurt\nSike\nLike a P.O.S. t-shirt\nYikes\nBut it's only gonna be worse\nRight\nAnd this beat is kinda beserk\nTurn it up loud until my fucking teeth hurt", "year": "2015-11-10"}]}