{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/62695ef76e3e49be21ef660ec8107c5c.585x618x1.jpg", "title": "Officer Ricky (Go Head, Try Me)", "lyrics": "You think you know me? (Officer Ricky)\nNigga, You don't know me! (Officer Ricky)\n50... ayo! C-O!\n\nI put a razor thru ya face, I put a nine on my waist\nI cock the shotty just in case, I pump nothin' but bass\nI put a pint of blood in the whip, a pint of blood on the ground\nBullets, bullets get to ricochetin bouncing all around\nThat body all case cold I got her white wit it\nIf they ask me I think niggas from basely did it\nI'm a southside nigga, we take on all comers\nThe first shot pop, we get to warrin all summer\nThese niggas ain't hard I get on em on some different shit\nDifferent strap, different clip, I blow the door off your whip\nThe cop fucked fox, sucked the cunt on the bimbo\nFaggot must've thought he knock me out like Kimbo\nWith gondorea lips, his breath stronger than endo\nFat fuck playing Wii Fit Nintendo\nHave another tattoo, here's another tattoo\nRun into my goons soon, have new bullet wounds\n\nOfficer Rickyyyy, radio for backup\nSee ya ass anywhere you know I'm gon act up\nYou want play with me, when I don't want play?\nHave my niggas whip the skin off your ass in broad day\nScreaming boss, nigga you ain't a boss\nPussy nigga ya lost , listen officer Ross\nI tell you straight suck a dick\nYou tryna come with subliminals\nCuz your ass the police\nMy niggas is criminals\nIt's like every other word out your mouth bout a bird\nLike you sling cocaine, this shit is absurd\nYou's a rapper, you's a motherfuckin rapper\nIt's a wrap, your career is fuckin wrapped up\n\nMy enemy's enemies are my friends\nAnd my semis they like Siamese twins\nSee em up close, you won't see shit again\nLike every fairytale, boy your life has to end\nTry me, get blown away way way\nGo 'head try me, get blown away way way\nTry me get blown away way way\nGo head try me, get blown away way way\n\n(We the best!)\nYeah, you the best, you the cocksucking best\nGo 'head faggot, depp throat it, feel it in your chest\nI'm not friendly, I'm anti-social\nGo 'head try me, I'll be fucking ya up, like I'm supposed to\nYou say I'm violent, now why you say I'm violent?\nThe mac got a muffler, make a loud mouth silent\nNow Me, I'm kinda sensitive, So watch the way u talk to me\nYa better off shootin me, or tryna put the hawk to me\nThe beef ain't shit to me, cuz now I got the wolves out\nThat fo-fo pull around, that tre pound bulls out\nI do it for the moula, boo-ya, bullseye\nPop ya fuckin noodles, deputy do die\nMany men wish death, many men \"oh doe\"\nI make many millions, fuck wit me, that's a \"no no\"\nThis is motion picture shit, there's no director to cast me\nThe D's, I plead the 5th on every question they ask me\n\nMy enemy's enemies are my friends\nAnd my semis they like Siamese twins\nSee em up close, you won't see shit again\nLike every fairytale, boy your life has to end\nTry me, get blown away way way\nGo head try me get blown away way way\nTry me, get blown away way way\nGo head try me get blown away way way\n\nNigga I bleed blue, I swear I bleed blue\nYou thinkin I'm a crip, I'll motherfuckin trip\nThe cool-out blood, maybe I'm all blood\nFind out what a nigga bout when you catch a slug\nMaybe I'm maniac, maybe I'm crazy\nMaybe I'm exactly what my fucking hood made me\nMaybe I'mma do 25 years for murder\nMaybe cuz it's clear I'm the clip inserter\nI done lost my best friend, he died of cancer\nCall me a cheetah, I attack like a panther\nIt's teflon vinyl on my drop-top phantom\nBulletproof windows, and a stash for the cannon\nNigga if you cross me, you gon' have to off me\nI just keep going no matter where they lost me\nYou know I'm like a time bomb- bomb steady tickin\nYou know what's coming next, once nigga slap the clip in\nOh yeah\n\nMy enemy's enemies are my friends\nAnd my semis they like Siamese twins\nSee em up close, you won't see shit again\nLike every fairytale, boy your life has to end\nTry me get blown away way way\nGo head try me get blown away way way\nTry me get blown away way way\nGo head try me get blown away way way\n\nYeah, this nigga's a appetizer\nWhere you at Wayne?\nThe full course meal Wayne\nYou awfully quiet\nYou call Em out, well now I'm out\nI got my vultures out\nYou got get pass me to get Em\nI'm the baby over here\nI'm the smallest nigga in my clique\nShady After-motherfucking-math nigga\n3 headed monster - 50, Em, Dre\nFuck with it if you want nigga", "year": null}]}