{"artist": "Ant Banks", "songs": [{"title": "The Loot", "image": "https://images.genius.com/f15a8c91348ddd75d458eec3b8d6c818.782x768x1.jpg", "album": "The Big Badass", "lyrics": "[Ant Banks]\nYeah, we got my nigga Short Dog in the motherfucking house\nTelling y'all niggas about that loot\nCause you don't know nothing about that, you know?\nDo it to 'em\n\n[Too $hort]\nI used to be a broke-ass nigga from the Oaktown\nRemember Too $hort? Bitch I ain't broke now\nI sold 6 million albums since I got my start\nI be all up and down them Billboard charts\nThat shit is easy, fucking with the Dangerous Crew\nAnd kick back while I tell you about making the loot\nGet in where you fit if you making it fast\nCause a real motherfuck might check your ass\nTake all your loot, kick down your door\nThe word got around you's a bitch-ass ho\nHanging with these same ass niggas that owe you cash\nThat won't pay your ass\nThem niggas just owe you for life\nBe all in your face every day and night\nIf you'd have broke their ass off years ago\nFor fucking off all them counts of dough\nYou wouldn't be a broke-ass nigga today\n(I'm a get that shit back) Well I'd figure you'd say that\nCause you go way back, rewind and play it back\nYou just a fat fucking needle in the haystack\nThey should've just named you jack\nCause you ain't never gonna get that back\nSo reminice on the things you had\nCause you having money was just a fad\n\n[Ant Banks]\nThat's right (Bitch)\nEither roll thick, or suck a fat dick (Gotta get my loot)\nAnd niggas can't fuck with that (Gotta get my loot)\n\n[Too $hort]\nYou working every day and can't never gat ahead in life\nStop punking out running cause you're scared to fight\nYou hang with nine broke niggas, you know the rest\nKiss a fake nigga ass and give a ho respect\nLying all the time about your cash flow\nAnd talking about shit that you think you know\nWell motherfucker if you only knew\nYou made the next nigga rich while he stole your loot\nYou've been hoeing so long I bet you feel like a bitch\nWhy can't niggas like you get rich?\nCause you gotta be a hustler, can't be a buster\nYou ever get a ho, nigga, please don't trust her\nUsed to be rapping, now you slanging dope\nStressing so hard you want to hang your hope\nDreamed of owning a house, maybe two or three cars\nCome up like a motherfucking movie star\nBut the shit ain't happened yet\nAnd I'm an old-school rappin' vet\nYou trying to get your loot, I say you ain't some\nNiggas get their cash, and some can't\nShort Dog on the mic, watch me gank this bitch\nAll that shit you doing, boy you can't get rich\nBut don't give up, just stop faking the shit\nGet off your ass and start making it, biiiitch!\n\n[Ant Banks]\nThat's right (Bitch)\nEither roll thick, or suck a fat dick (Gotta get my loot)\nAnd niggas can't fuck with that, you know? (Gotta get my loot)", "year": "1994-06-14"}]}