{"artist": "Wale", "songs": [{"title": "Dummies", "year": "2018-09-14", "lyrics": "[Intro]\nWe in a different time now, bro\nMan, we all gotta do our part, man\nOne of the most valuable things you can offer is your words\nWe gotta feed the old, the young and everybody in between\n(Woooooo!)\n\n[Chorus]\nUh, these niggas be hatin' on the low\nI just play it cool and confident, they would never know\nMy intelligence is the weapon I use on ’em first\nIt take a smart man to the play the fool and the rules don't reverse, mmh\n\n[Verse]\nDummies could never play me (never)\nOne of the best of my generation but media hate me\nNigga we grew up on Weezy F. Baby, Lupe and Jay-Z\nThat mean I shoot you, say miss, excuse me\nGet her in tune and off The Cool, kick push to your old lady, yeah (heheh)\nAbi, don't call ’em what they isn't\nThey move the goal post for certain niggas, they not official\nI know some snorters and sugar daddies that's politicians\nI know some corner boys that could die tryna pay tuition\nNow is you mad 'cause my wallet, my woman, or complexion?\nLife could be easy, but it's never simple\nAnd it take a real live real nigga to tell the difference\nUh, what do it take be a gangsta?\n'Cause young boys on opioids never felt much, yeah\nThey chasin' money 'til they taste blood\nNow ten year old Makyiah dead ’cause y’all ain't think enough\nNow the city is prayin’, postin' her picture up\nAnd every time I see 'em, I shed a tear and get really numb\n'Cause y’all dare rumble, and y'all don't wanna squash it\nAnd now we here, it's two parents buryin' their only daughter\nUh, how could you kill a child when\nOne of the codes of the streets was keepin' 'em from that violence?\nIt's deeper than y'all beefin', them people be out for us\nIf we killin' our people then we become powerless\nUh, excuse me, I got too deep\nI just signed a contract and now my conscience only think free\nAnd you can save your props for somebody that care what you think\nI been skatin' a while, why you try to Kerrigan? Please\nI'm 'bout to embarrass niggas, I feel that have carried me\nThis industry very cold but it look to you very sweet\nPut niggas on big stages, put niggas in little beefs\nYou put too much faith in it, it puts you in therapy\n\n[Chorus]\nThese niggas be hatin' on the low\nI just play it cool and confident, they would never know\nMy intelligence is the weapon I use on 'em first\nIt take a smart man to the play the fool and the rules don't reverse, dummy\n\n[Outro]\nWit'cho dumbass, boy\nWit'cho mother fuckin' dumbass\nThey can continue to undermine while we continue to be overpaid\nWhether you like it or not, we will not stop\nAs the soul of our ancestors won't allow us to inflict fear\nBut rather turn fear into fire\nOlu is the three manifestations of a supreme God\nOlu is King, you in the presence of Olu\nOlu (Olu)", "album": "Free Lunch", "image": "https://images.genius.com/702c0a054929730ee1cf6d9ad60fbd7f.1000x1000x1.jpg"}]}