{"artist": "C-Rayz Walz", "songs": [{"title": "Street Talk", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nStreet.  Talk.  Street\n\n[Verse 1: C-Rayz Walz]\nWith each thought, my street talk express rhythm in hindsight\nIn deep breath, the day could be death living a night life\nThis is speech to the heat of the beat and how it burns\nCowards learn tricks and chicks be on E! like Howard Stern\nNow it’s earned.  World turns—it’s just the days of our lives\nForsaken, now eyes losing vision as we pray to the sky\nYour boy said, “The streets is watching.”  ‘Cause we flow, they talking\nMy rhymes think they got a father—they don’t know they orphans\nA lone man theory—only those from my tribe hear me\nLonely souls roam on the crossroads—they die near me\nSo take your time when you tasting the wine, tracing the lines\n‘Cause the joys of bliss, like this, might be erasing your mind\nSo gloat from within, spit lead, explode with the pen (They sin)\nFrom the beginning, you already know it’s the end\nIf the beat bumping bass in your face, pardon me—peace\nI know it’s hard, but stroll with the gods on this Odyssey street\n\n[Hook: Ryan Perfect] (x2)\nAyyo, the streets what I talk.  Talk what I see\nSee what I live.  Live what I be.  Being from Queens\nQueens to LA, kids who live seen what I be\nI talk to the streets.  The streets talk to me\n\n[Verse 2: Ryan Perfect]\n(Check it).  Yeah.  Yo.  I raise hell like I was Satan’s father\nThe brother of God can fight the fate of Karma—wait!\nLaser revolver fade your tomorrow.  Stand real far away\nFrom the drama.  Pray to me mama is what I ask from y’all\nMy chain’s a halo of gold no longer levitating, fallen\nWatching the way that it glow is sure to hurt your face, you know\nThink daughters angelic, so my niggas circulating\nThe load in my piece’ll show my chest—embrace it\nEvery thought is a prequel.  Write words and spit sequels\nI promise I’ll never give you nothing feeble\nIt’s not me thieving you, dog—it’s your peoples\nMatter fact, it’s you for believing they believe in you\nWhen you’re raping yourself, thinking “I believe it’s Sue\nI believe it’s true.”  You sound like who you listen to\n\n[Hook: Ryan Perfect] (x2)\nAyyo, the streets what I talk.  Talk what I see\nSee what I live.  Live what I be.  Being from Queens\nQueens to LA, kids who live seen what I be\nI talk to the streets.  The streets talk to me\n\n[Verse 3: Wordsworth]\nYo, yo, ayyo, the streets is what I talk.  I see the weakness in your walk\nThe deepness of my thoughts display the ways we speaking in New York\nTalk what I see: happiness and misery\nHandcuffing—hoping these cops don’t plant nothing when they pat, frisking me\nRap visibly—picture what you hear.  Description so you aware\nWhispers in ears get you convicted to the chair\nWe don’t see our vision’s impaired—we conflicted by kicks and some gear\nSo we can appear to look drinks in despair\nAnd the globe is controlled by the most richest\nAnd on this road to success, there’s some toll bridges\nNo shortcuts—nothing less, you gotta go the distance\nYou gotta try to get across, but when that road is finished... (Uh huh)\nWords symbolizes a pilot that win dependence—got it\nIt coincides with the music in your environment\nIt’s so intense when I inscribe it (That what?)\nThat you got your own private movie screening when you close your eyelids"}]}