{"songs": [{"year": "2015-03-10", "image": "https://images.genius.com/b3f18afdb9a8e4c34bbb5af1f1a5ac80.1000x1000x1.jpg", "title": "No Future", "album": "Persona", "lyrics": "[Sample]\nYou say we have a future and together we'll find it\nYou say we have a future and together we'll find it\n\n[Verse 1]\nAll black O.B.X., all white Cadillac\nMiddle of the summer but I slumber where the snow be at\nTrying to mack Zodiacs\nHad me a Zoziac\nJ.T. banging out the truck bringing Sexyback\nProm played the background\nV.I.P. no pat down\nFive star, gold trim\nTell me you impressed while looking for a boyfriend\nMore like a toy friend\nPlay around, won't stay around when the joy end\nNah, she ain't like that\nTold me she ain't like that\nMad cause she wrote me and it took a while to write back\nMy nigga told me, \"Tell her anything she wanna hear.\"\nShe finally gave it up was another nigga's shears\nYeah, he cut, I ain't fuck after putting in the time\nThe next time I saw her gave her a little piece of mind\nSaid a little piece of shine would've went a long way\nYou trying to be together is a game I don't play\nThere's no future\n\n[Hook] {​x2}​\nShe said she want me but I don't\nReally see a future so I won't\nCause it's just \"No future\"\nI need to really let you go\nBut the way I act girl you should've known\n\n[Verse 2]\nSomewhere on the west coast, looking for a good night\nThings are kinda rushed but I had me a good flight\nBack to the west again\nBack, you impressed again\nNot because I hit but I call you like a best friend\nWestin, Sheraton, share me with your girlfriend\nMight go out to eat but we back to where it all begin\nHotel, don't tell [?] but we gotta part\nHe gon' have your body but you told me I'ma own your heart\nWhat?\nI'ma own your heart?\nWhy we even start?\nThis was fun in the beginning but you torn apart\nI think you undecided, but you trying to hide it\nI sent a text message, now you getting all excited\nSo here we go on this merry-go-round\nYou told yourself you had enough cause of the way I left town\nBut you back in my voice mails talking 'bout the past\nEven though we had no future, you still offering ass\n\n[Hook]"}], "artist": "Rapper Big Pooh"}