{"songs": [{"image": "https://images.genius.com/50a27841c8fd113c4acf184726cc64a7.696x696x1.jpg", "title": "Doctor", "album": null, "year": "2019-07-07", "lyrics": "[Intro]\nHuh\nAyy, RIP Hamp nigga\nYou know you what it is, I'ma real 38 Baby\nYou hear me?\nWhat y'all want?\nBelieve that\n\n[Chorus]\nThe preacher told him slow down, his mama said the same\nHe never knew that it was gon' turn out this way\nDemon's eyes, ain't no love, he grew up 'round nothin' but thugs\nHe got some niggas he want dead because they went 'gainst the grain\nBitch, we gettin' at anything, who want problems?\nWe solve them with them choppas, better be careful whatchu' sayin'\nIf they don't call the laws, who gon' stop us?\nWe send shit to the doctor, bitch, we tryin' to kill you and your mans\n\n[Verse 1]\nI'ma tell you like this, bitch, how I'm supposed to, now my bros want to show you\nHuh, you made a song now, what's that's gon' do?\nHow would you feel if a nigga tried to ho you?\nI'ma tell you what I'm gon' do, I'ma put this pistol on you, leave you stretched how they was 'posed to\nYou mouthing like them hoes do, I bust your dome\nNiggas wicked on that fuck shit, you gon' get it, boy I [?], nigga\nI'm the sickest, he want smoke?\nI kill the business, make it known, nigga\nBitch, your ass to rest outside this fuckin' club like it's your home nigga\nFacts, you act bad, we on your ass, we get you gone, nigga\nSlatt, I say \"blat,\" they blow the strap, you hit the ground nigga\nHold on now (Brr, boom, bow, boom, boom) makin' sounds nigga\nTry and everybody die in the streets, ain't no wrong nigga\n\n[Chorus]\nThe preacher told him slow down, his mama said the same\nHe never knew that it was gon' turn out this way\nDemon's eyes, ain't no love, he grew up 'round nothin' but thugs\nHe got some niggas he want dead because they went 'gainst the grain\nBitch, we gettin' at anything, who want problems?\nWe solve them with them choppas, better be careful whatchu' sayin'\nIf they don't call the laws, who gon' stop us?\nWe send shit to the doctor, bitch, we tryin' to kill you and your mans\n\n[Verse 2]\nAin't no talkin' back to back, bitch I'ma show you\nAnd I can put this on Boo, we gon wet up every block you try to run to\nThem choppas get to clappin' when we come through\nI'ma do some shit that Dump do\nWe gon' shoot up the whole car and pray we slumped you\nRun down with the strap and knock off his cap, they know it's murder\nYou claim you a gangster, then catch a body what you worth for\nZip up everybody, that's what we hollerin', \"It's a purge,\" for\nThey stepped on my nigga, that's what the fuck we been encouraged for\n\n[Chorus]\nThe preacher told him slow down, his mama said the same\nHe never knew that it was gon' turn out this way\nDemon's eyes, ain't no love, he grew up 'round nothin' but thugs\nHe got some niggas he want dead because they went 'gainst the grain\nBitch, we gettin' at anything, who want problems?\nWe starve them with them choppas, better be careful whatchu' sayin'\nIf they don't call the laws, who gon' stop us?\nWe send shit to the doctor, bitch, we tryin' to kill you and your mans\n\n[Outro]\nIf they don't call the laws, who gon' stop us?\nWe send shit to the doctor, ohh yeah\nYou know whatchu' sayin?\nDon Dadda\nKill you and your mans\nHuh?"}], "artist": "YoungBoy Never Broke Again"}