{"songs": [{"image": "https://images.genius.com/0e2f5fbd81c7a1e24ad35c1015e0e26d.600x600x1.jpg", "title": "Nobody Does It Better (Ft Warren G)", "album": "Ghetto Preacher", "year": null, "lyrics": "[Intro: Nate Dogg]\nNobody does it better\nNobody does it better\n\n[Hook: Nate Dogg]\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah yeah\nWe just tryin' make you see\nNobody does it better\n\n[Warren G]\nI'm sittin' here trippin'\nMy mind is blocked\nNate Dogg just spit it so it's time to cock\nNo one can do it better like this two man crew\nThey say we're one hitted quitters\nNow what cha'll gonna do?\n\n[Nate Dogg]\nAlways into somethin, that's my name\nOnly out for money, hey cause that's the game\nPeople always ask me why I'm out for scratch\nHe who has the most is he who won the match\n\n[Warren G]\nStrike one\nMe and Nate Dogg is a match\nStike two\nLeave 'em standing still in their tracks\nStrike three\nYou can call us two one three\nIt's the L and the B that makes me act like a G\n\n[Nate Dogg]\nMy exhibition started back in '93\nNo one, nobody listenin' but Warren and me\nTo all the nonbelievers, now I bet you see\nNobody does it better than me\n\n[Hook]\n\n[Warren G]\nThey call me DJ and the spark plug\nKeepin' it licked\nThere is no accident for these platinum hits\nSo when we make it to show love\nBangin' in your club\nHangin' with your thugs\nGivin' up G love\n\n[Nate Dogg]\nDo you remember back on the east side?\nWhen all of us niggas used to love to ride\nWe didn't care what we did\nTime was nothing to us, we were just kids\nTimes are different now, but you still get stuck\nI'm not a kid no more, I just don't give a fuck\nSo if you think you really wanna step to me\nKeep this is mind: nobody does it better than me\n\n[Hook]\n\n[Warren G]\nWow, make you say go now\nHot rap singles on the charts now\nGot a baby\nSo I'm breakin' hearts now\nOn your mark, get set, it starts now\n\n[Nate Dogg]\nAll you pimp playin' hustlers, now ya know\nYou can't keep me out once you crack the door\nEither join a team or it's best you flee\nNobody does it better than me\n\n[Hook]\n\n[Outro: Nate Dogg]\nNobody does it better (2x)"}], "artist": "Nate Dogg"}