{"songs": [{"image": "https://images.genius.com/5ca5f2633e2d1d141ce38a1b15825143.480x360x1.jpg", "lyrics": "[Intro]\nOh shit, I got a new challenge! Somebody said: \"Hey, Mac, can you rap three hundred words in one minute?\" and I was like: \"I can rap four hundred words in one minute\", check it out! Yeah!\n\n[Verse]\nI got a brand new challenge, everybody told me\nI should grab the microphone and cut it open with my talons\nI take a sharpie tagging your medulla oblangatta\nI was screwing with your mama, I'm asuming I'm your father\nSee a lot of people copying my videos and holding up a iPhone\nWhen they rapping trying to do it like I do\nI'm giving a middle finger to the universe, I’m sicker than fuck…\nQuick when I bust, putting voodoo inside you\nI gotta spit four hundred words in under a minute\nFuckin' exquisite when I am bustin' ridiculous type of raps, bro'\nWalk across a tight rope forty thousand feet up in the sky\nWhile smoking on a stogie in my slippers and bath robe\nI'm bringing a little terror to your mental state\nI hit you in your lungs until you start to hyperventilate\nCuz life is always better with a double IPA and\nMashed potatoes sitting right next to your steak up on your mother fucking dinner plate\nFor all the people arguing on social media\nAbout the quickest rapper in the world, you better know it's me, my friend\nI am puffin' on some Denver Colorado marijuana\nYou can say that I'm a hippy cuz I swear to God that trees are friends\nYou faker than the butt on Khloe K, you fucker go away\nYou're parked up in a fire zone, your truck is getting towed away\nThey gotta break the hydrant and exterminate the heat I'm spitting\nShout to Danny Grooves because he fuckin' made the beat I'm ripping\nI'm José Altuve, I am fuckin' little when I am swinging my bat\nAt the middle, Mac is so mental rapping subliminal facts\nAnd attacking with criminal acts in the back of a rental\nLike I'm Patrick Bateman hackin' with an axe, I crack your temple\nGrab the microphone and get to choppin'\nLike a semi automatic weapon, poppin' it will damage your skull\nAnd if I ever cannot pay my bills off rapping\nI'll walk in the store and steal a bunch of shit like I'm LiAngelo Ball\nGod damn, man, people are quite dumb\nSomebody give me one reason that Rice Gum\nIs famous I made this poison drink it and die son\nI'm God, Jesus is my son\nHuh, Hallaluejah\nI’ll take your little credit card and stab you right in the medulla\nCuz you ain't got a motherfuckin' soul, you a loser\nI'm the greatest rap YouTuber, booya\n\n[Outro]\nOh shit, one minute and three seconds! Well, guess what: that was four hundred and sixteen words! I think we did it, Carrot! Say: \"Yes\"... or don't", "year": "2017-11-20", "album": "YouTube", "title": "400 Words in 1 Minute (Fast Rap)"}], "artist": "Mac Lethal"}