{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Bang Bang", "year": null, "album": null, "lyrics": "[Intro]\nKool AD, professional rapper\nAllahu akhbar\nAlhamdulillah\nAllahu akhbar Kool AD\nDude\nBest rapper\n\n[Verse 1]\nAy yo, Kool AD bitch, look I'm Al-Qaida (Who?)\nWest side Oakland, shout out to the Raiders\nFuck Kevin Sorbo, that nigga is a hater (True)\nFuck Justin Beiber, I ain't fuckin' with him either\nFuck Daryl Wilson, he can see the heater\nKool AD, best rapper, straight ether\nSee me on the corner, peace to Chris Dorner (true)\nBang bang bang call the coroner\nKool AD cold as ice like Foreigner\nOrdering hors d'oeuvres at lupid\nOysters, champaigne, oranges\nPussy foreign plus the whip, it be foreign too\nGaze into my raps I'm imploring you\nHoller if you hear me\nWest side story, you feel me?\nSuck me, fuck me\nFuck me? Fuck you!\nHut one, hut two, hike! Blitz!\nRush you, you ain't got nothin' on the kid, yo\nEvery single day my whole time zone switch\nHaters suck dicks and shit pine cone dicks\nYo my mind so rich, that my physical form\nCan't help but collect hella chips\nGet the money, get the grip like Tinashe\nShout out Allende\nBut fuck Tinashe, sippin' Pinot gray\nThat's [?] plus grigio, you see me though?\n\n[Vocal Sample: Malcolm X]\n\"We're a loving people, we love everybody who loves us. But we don't love anybody who doesn't love us. We are non-violent with people who are non-violent with us. But we are not non-violent with anyone who is violent with us.\"\n\n[Verse 2]\nAyo Kool A.D. bitch I don't stop rappin\nShout to John Caplan\nYo no soy marinero, soy captain\nPero no se but ho, shoutout to the Navajo\nBitch ancho chain yo, tigre [?]\nTiene que ensenarte, insane yo\nTi no entiendes, di me\nKool A.D. no entiendo\nSnappin like a number two pencil\nListen to the words I put together with my mental\nDoin this forever for my kin folk\nKarl like Marx nah Winslow\nFuck all the cops all the narcs, slow stick em\nWith a knife in the pipe where the wind go\nWhen kid go, the kid quick\nYa'll slow, I'm shuttin shit down at the mall, no\nI'm joking\nShout to occupy for shutting down port of Oakland\nA couple of times\nSomeone need to hit Johannes with a 18\nThat's a couple nines\nFuck the cops, thought I told you that a couple times\nFigure I would throw that in, while I... shuck and jive\nI fell off? Yea fuckin right\nKool A.D. all day, all fuckin night\nIf you don't like it fuck your life\nYo I came from Hunter's Point where you should tuck your ice, and then I\nMoved to Alameda for the Tucker's ice cream\nAnd the Ole's Waffles\nI'm a TV show, like um Tony Soprano\nSee me at the Fruitvale truck with a taco\nPeace to Oscar, plus fuck the opera\nFuck the cops, fuck the operas\nIf you got bread cop the chopper\nStudy the game, like a doctor\nMeditate on peace off the loud\nPacked deep like Chopra\nIn-flight inceptions like see-back operas\nOver collar cause I freed that Chakra\n\n[Vocal Sample: Malcolm X]\n\"Once those intentions are made known, we can get to the nitty gritty of the problem. We can get to the core of the problem, we can get to the root of the problem. And then, we can correct the problem.\""}]}