{"artist": "Watsky", "songs": [{"year": "2016-08-19", "lyrics": "[Intro]\nHave you ever seen a corpse?\nHow about an exquisite one?\nThink about Frankenstein’s monster\nNow think about fun\nYou’re getting it, good!\nJohnny starts with a leg. I sew on an arm. Then you lend a hand\nWe each add our piece\nNow, what kind of beast have we made?\nLet’s find out!\n\n[Verse 1: Watsky]\nI woke up Sunday to a bloodshot sky\nRobot overlords goose step by\nShoulda listened when we had the juice to try\nAnd Bill the Science Guy told us that “the end is nigh!”\nLately it’s been getting harder to\nSurvive, since the Hive started to\nBan American refugees from being a damn part of the\nPeople’s Republic of Antarctica\nA bum begged me for a bill he could borrow\nBabbling some shit about “there’s still a tomorrow”\nHe said that “legend has it, there’s still a Baja Grill and a Sbarro\nAt the top of Mount Kilimanjaro”\nAnd so desperate, I set out from the deserts out in Portland\nUntil my thirsty horse collapsed in the scorched sand\nI promised to myself heart and soul\nI’d crawl across this dead world for those garlic rolls\n\n[Verse 2: Dumbfoundead]\nYo, kid, let go of the dead horse\nStop crying, need a ride? Hop in my red Porsche\nEat something homie, you look bony and frail\nNow why the hell would you take the Oregon Trail?\nRemember back in grade school, that stupid computer game?\nYou shoulda known better, now there’s no one but you to blame\nDying of dysentery, don’t climb to the enemy\nI’ma take you underground where the hive resistance be\nApparently a colony of people are out there\nA garden full of veggies, even garlic they sprout there\nLeader General Bieber who be running shit down there\nFound a way to end the drought, bring out the swimwear\nSoon as we pulled up we heard drilling noises\nChildren started dancing, even grown folk joined in\nLike a hydrant in the Bronx, water shot up in the air\nBut was boiling and as hot as solar flares\n\n[Verse 3: Grieves]\nOoowee, ain’t that a bitch?\nNobody believed it 'til the first wave hit\nThe ground started shaking and the sky went red\n(Mayday! Atlanta’s been lost, Justin Bieber is dead)\nNo! God damn, another one down\nColonies of people living under the ground\nRallied against the clowns, a resistance was born\nThey fight for mankind and the existence of porn (let’s go!)\nBack on the surface life eaters\nAvoiding wild packs of North American beavers\nCreepers and face feeders\nFearing the great reaper\nYou’re either gonna get eaten or beat with a pay meter\nThis is real shit homie, dog eat dog\nMore like robot clown eats man and whole squad\nGraffiti on the wall says “there is no god”\nBut there is still homemade vodka, and that’s cool\n\n[Verse 4: Wax]\nHomemade vodka, pour a shot up then I swill it\nI’m the only person left who remembers how to distill it\nIt’s the most popular product in the underground economy\nSo I’m the most popular person in my underground colony\nAll the resistance leaders they throw shots down\nIn my bar after they fight the robot clowns\nAs of late they’ve been stressed and depressed\n'Cause the chances of us winning are becoming less and less\nWe lost the captain of the human army\nMorale's really low and a lot of people are starving\nI’m still wondering how this all happened\nIs this even real, or am I just on acid?\nThe clowns are advancing down\nI use the word “down” cause they’re coming underground\nWait—what’s that sound? It’s kinda loud\nHoly shit! There they are right now!\n\n[Verse 5: Adam Vida]\nCalm down soldier, this is no time to be a fink\nWe can beat these clowns, okay, we just need to think\nI’ve lost ten men this week, I can’t sleep a wink\nBut this the last place on earth a guy can get a decent drink\nSo darned if we lose this bar to these useless zombie bastards\nI’d rather starve than be boozeless\nSo I put barbed wire slabs on the fences\nThat should buy us some time to plan our defenses\nPick up the chairs and trash cans off the floor\nStack 'em up on the front door to jam up the entrance\nAin’t got grenades, but we still might be saved\nI just found fifty diet coke cans and some breath mints\nFill the trash cans to the brim with the cola\nWhen the robots break in toss the mints in the soda\nSee the blast won’t hurt 'em but it’ll get 'em wet certainly\nIt’ll mess up their wiring and disrupt their circuitry\nIf it don’t work though, my next plan cannot fail\nWe drink the vodka—shot after shot 'til we’re too drunk to feel pain\nSpark up a flame, and turn the bottles that remain into Molotov cocktails\nI’ve had it with you clowns, I’ve reached my limit\nYou may have killed my captain, but I’m the lieutenant\nAnd I won’t let you terrorize us, wait just a minute\nThat ain’t no robot zombie, man, what the hell is it?!\n\n[Verse 6: Rafael Casal]\nAdam! Ah! I didn't mean to scare ya'\nDude, that’s not a robot, it’s just Iggy Azalea\nMusta hid up in the bar to learn about who we are\nThen report back to the captain of the folks attackin' my favorite rap stars\nOh shit, quick! Hit her with some fuckin' duck-tape\nShe came to sing-rap & give us all some undercut fades\nLo-fi beats transmittin telegraphic autotune\nHelp! She’s inside my head, and I don’t think I am immune\nBeen repo-d, I think I’m in deep, I am weeping at the seams\nForfeiting my dreams of keepin' the streets G code\nOnly way to outrun it is doublin' up on the track\nAny and everyone get up and metal mean it\nJust puttin' the pedal into it\nNow we taking over the tempo and tunin' it\nNever gone let a lesser demon ruin it, so I’m inducing it\nDoomin it all, I’m undoin' it, deuces I'm dippin\nWho comin' with the kid? I’m out\nHead to the dojo, Diggs got pistols hidden in his fro though\nThese robots think we're bitch, Diggs, gimme some loko\nAnd let me borrow your Jefferson robe bro, I’m goin' postal\nBay boy's 'bout to put this barrel into some fuckin' blowholes\n\n[Verse 7: Daveed Diggs]\nWhoa whoa whoa, hold up cash\nYou see I’m trimming my mustache up\nI heard all these newly brainwashed rap chicks are really down to fuck\nI comb the pistols out the fro and they’re sitting on the table\nAnd there’s two cheesesteaks out in a fully gassed up LeSabre\nI’m ready to ride on these haters, let’s go\nBut you better drive, 'cause you already know\nThat apocalypse or not when I’m behind the wheel my black ass is sure\nEnough gonna get stopped\nAnd we ain’t got the time and the tags are expired\nYou know how it is, I am really not trying to die today, by cop, or by Iggy robot\nWhoa, stop, lemme go bottle up this kombucha I’ve been brewing on the back porch\nGrab the backpack out the closet, it’s got all of our passports\nI’ve been planning this for a minute, seen the writing on the walls\nIf we survive and find a civilization, they’ve got to know who we are\nFirst we swoop up Chinaka, in case we need some muscle\nOr reason, or anything other than our indiscriminate hustle\nThen we roll through the hood real slow bumping something all of these monsters know\nLike a Watsky song? Lo and behold, they’ll follow our car wherever we go\nLet’s lead em out to Napa and let em gentrify that bitch up\nStart the car, homie, no, we are not stopping for any swishers\nOr a McFlurry, bruh there’s no time for that shit\nHold up, there go Nak right there, pull over\nAyo Nak, Ayo Nak, get in the car!\n\n[Verse 8: Chinaka Hodge]\nAy Rafa get back seat\nMake room for ya fam, friend\nI’ll give you this McShake and the end of my Hansen\nNow what the fuck y'all talking it’s the end of the world?\nI been on Pinterest tending to the end of my curls\nI mean the sky is always purple, people running on vapors\nI mean the Tribune been gone, I ain’t gon read it in the papers\nNothing’s all that different, been the same for black women\nWhen apocalyptic breakfasts follows revelation dinners\nThe lights been out, the water smelling of Flint\nExquisite corpses laying where the bodies had been\nNo bombs over Baghdad, just drones with grenades\nWhen life give us citrus, we learn to drop Lemonade\nSo, okay, fellas, shall we get in formation?\nBump some pied piper aura up out the trunk of this scraper\nDo the end of the world styling in our fitteds and gators\nLure these stupid mufuckas on a goose chase\nUse whatever’s already in our suitcase\nI got this whole jones for this open road\nAnd my flow so cold, we don’t need AC\nI popped fo’ no doze, I’ll read this formal prose\nI bet you Butler knows how to make us free\nA Lauren Olamina in Trumped up world\nA black magic woman still being called girl\nBut the only constant is change, holmes\nSo let’s get the supplies and then dip up out our bay homes\nGot this earthquake kit and six gallons of gas\nI got Diggs in the driver and Raf in the back\nGot this passenger seat and the last of these sweets\nGo north Daveed, just gun it 'til wine country\nDo it moving fluid like turfin' with iDummy\nIt’s the bay moves we learned as natives gon' keep us safe\nIt’s the forty water water and an instrumental tape, let’s go\nThey’ll get tired behind us\nI mean half of em hybrid but nigga most of them wind-ups\nWe got nothing but power we got nothing but time\nI got Kwudi’s new beats and Music of My Mind\nBut nothing left in Napa, but the scent of the grapes\nNo palate-cleansing tapas for discriminate taste\nNothing left in Calistoga but one popped bubble\nWe got just two dudes and like one Nak, trouble\nLike how the hell we s'posed to repopulate humanity\nThe two of y’all and me, that’s, like, actual insanity\nLike eww, that's really gross, guys\nIt's like, not Diggs, and not Rafa\nNot nobody else, just get back, doing it styling in wine country with nothing else\n\n[Verse 9: Watsky]\nRed red wine, I don’t want to die!\nI hum under my breath as I fight death in the quiet depths of the bunker\nI was confounded when I came to after Dumbfoundead\nBrought me to the battered base underground where we hunkered down the summer\nBut then winter came and the flame that we tended to flickered to nothing\nAnd the few of us living resorted to burning cadavers like tinder and lumber\nWe bickered bitterly and our wickedness hit a peak in our hunger\nSickened we hunted each other\nPickpocketed the weak and we plundered\nA visitor from the surface stole a garlic roll from a Dave and Busters\nAnd I butchered the buster in his sleep just to lick his fingers for butter\nBut it kind of gave me indigestion I confess and the pipes ruptured from my dung\nLungs punctured when Dumb stuck me with the sharpened end of a plunger\nNow it’s me and Grieves in a shallow grave\nNext to J Biebs and Azalea’s pale humungous butt\nThat I rest my head upon for my perpetual slumber\nWe frail and wretched kvetch and wail\nIt’s curtains, my days are numbered\nAnd I’m numb to the pain, yet one remaining certainty gives me comfort\nI made a living yelling my opinions loudly\nThinking I might matter if I drew a crowd, see\nNow, my lily cheek on Iggy’s chilly cheeks I finally see that the future will be fine\nWithout me\nNothing is entitled to be mine\nI’m a token of a broken time\nAnd maybe there’s survivors on the surface in LeSabres working on\nTomorrow sipping red, red wine\nRed, red, red, red, red, red, red, wine", "image": "https://images.genius.com/caf3c17709b04ff24300da4d62da46fa.630x630x1.jpg", "album": "x INFINITY", "title": "Exquisite Corpse"}]}