{"songs": [{"year": "2013-07-16", "album": "Stranger Than Fiction ", "image": "https://images.genius.com/0043c66183bb24d57ffa8209ac57183e.500x500x1.jpg", "title": "4:30 AM", "lyrics": "[Intro]\n(phone rings)\nKG: What the fuck! Hello?\nVOICE: What up nig?\nKG: What up nigga?\nV: Shit, chillin'\nKG: Shit, I say --\nV: What you getting into?\nKG: I’m just cooling bruh, I’m just cooling. But look, I’m bout to get it in right fast, nigga I love you, let me do this I'mma call you later\nV: Alright nigga\nKG: Alright love you boy\nV: Love you too nigga\nKG: Alright. Keep all that!\n\n[Verse 1]\nGladiators on deck, drug user, don’t drink Sprite\nAnd when I do, it ain't pink Sprite, a lot of lean, it’s purple\nTrust issue, don't trust really, no two point conversion\nWon't run it after I touch down, my punter kicking, it's defense\n(What you get into this weekend?)\nWhere was you when I was slumped over?\nGums hurting from a old bullet\nIn front the toilet while hunched over\nPuking all of my insides, stab wounds from a old friend\nWell at that time we were close friends\nThey say I killed him in cold blood\nWe wrestled for the gun but the gun went off\nHe up’d the pistol, looked him dead in his eyes\nI been ready to die so nigga, do it\n\"Gates lying,\" I'll really do it\nI’m serious too, nigga, really do it\nTurned his head, closed his eyes\nAimed the tool, started shooting\nI didn’t die, my life a movie\n\n[Hook]\n4:30 AM, never say when, it’s five in the morning\nAnd your children are somewhere on the corner\n6:00 AM water boiling\nThink I'm addicted to the strong aroma\n\n[Verse 2]\nWhen I was touching McKinley, Erin really my best friend\nAnd I was loving her best friend, bright Brittany with the long hair\nYou know Flavar Lloyde lil' sister\nShe stole a Jag for to come and get me\nI was buying dope, in and out the system\nBrandy fucking my nigga Ray\nAt the same time, fuckin' Coach Whitney\nHe the track coach, and a asshole\nKnow that didn't have shit to do with this\nI was just stating the facts though\nJessica round me, talking sexual bout me\nShe bend over in front me from the back while I'm pounding\nNow it's over, bitch get up and get out\nI mostly likely forgot to mention, but we was in my trap house\nJust brainstorming, in the game forming these thoughts into ideas\nNo regrets for the shit I did; that also mean for the niggas I killed!\n\n[Hook:]\n4:30 am, never say when, it’s five in the morning\nAnd your children are somewhere on the corner\n6:00 a.m, water boiling\nThink I'm addicted to the strong aroma"}], "artist": "Kevin Gates"}