{"songs": [{"year": "2014-08-19", "title": "Nunya (None Of Ya Business)", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "Uh huh\nDJ Premier, the legendary\nThe Works of Mart\nThe Yardfather is here\nI feel like I need to address some shit, know what I'm saying?\nI feel like they prying man\n\n[Hook]\nIt's nunya business\nWhy I be drinking all this Guinness\nIt's nunya business, it's nunya business\nWho the other mothers of my kids is\nNunya business, it's nunya business\nAll the homicides I done witnessed\nIt's nunya business, it's nunya business\nNunya business, it's nunya business\nIt's nunya business\n\n[Verse 1]\nWeed give me ADD but I still smoke it\nThese bitches be licking my chicken but I still choke it\nWould I be the new Chief if I kill Keef?\nAm I the only one on Love & Hip Hop with my real teeth?\nThe only one that probably been in some real beef\nYou swear to your veneers, I knock em out real brief\nSo nice I feel I should shout out Lil Cease\nOn every one of my joints like I'm B-I-G's up\nHo sit yo ass down\nI'm still out here shooting, you been spent your last round\nThe way that I'm moving they're saying get your cash now\nAlready been proven I'm a skitzo, just ask around\nActing like you know me, how? I get scared\nThe only shit you gon hear is pow pow pow\nI'm Spring Valley smart, Newburgh tough\nBrownsville crazy, and that should be enough\n\n[Hook]\n\n[Verse 2]\nWhen it's time for me to say sayonara\nY'all gon be saying that Sai a martyr\nAnd that I'm a lyrical fire starter\nYeah, I kinda sorta be lying on my dick\nCause it's a lot of chicks that I hit I will not admit\nI notice a lot of y'all be popping a lot of shit\nShould be minding your business but vying to do the opposite\nThey even lied and said Giddy man was a titty man\nWhen I don't even want more than what could fit in my hand\nDamn, Can I Live like Jigga said?\nCan y'all prevent me from going upside this nigga head?\nThey say you do a reality show, your stock just fall\nI'm just glad it was Love & Hip Hop, not Lockup Raw\nThree baby moms, trying to knock up more\nCause it's some forces in the world trying to knock us all\nI'm Los Angeles smart, New Orleans tough\nChitown crazy, and that should be enough\n\n[Hook]\n\n[Verse 3]\nWhat type of asshole go and start trouble with a gangsta?\n2003, we woulda called you a wanksta\nYou go to the dealership but you don't never cop nothing\nYou been hustling a long time? No, stop fronting\nNigga, you never sold coke in your life\nYou sold crack, you was moving them little packs to get your motorbike\nBut when you rapping, you the crack slinging prototype\nI sold more, matter fact...\n\n[Hook]", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}