{"songs": [{"lyrics": "[Intro: Camu Tao]\nGood evening\nAll right\nYeah\nHappy to be breathing\nYeah\nI am alive\nYeah\nYeah\n\n[Scratches]\n\"You look like you've seen a ghost\"\n\n[Spoken: Aesop Rock]\nAre you asleep? Or are you\nAre you awake? Nah, man, I'm done\nI'm showered, I'm everything\nAte some fuckin' Lucky Charms\nLet's go\n\n[Verse 1]\nMost copious, rains soaked the opiates\nNotice how the phobias appropriately procreate\nWoke up with a ghost farm, focused on his groceries\nWhen they aren't telling stories, they are multiplying grossly\nOn the lawn, let 'em loiter, never let 'em spawn\nThe apparitions have been drinking his water for too long\nSo when they gathered by the birdbath in the morning, he would tell 'em\n\"I mean no disrespect but you have all outstayed your welcome\"\nInteresting in a sense\nInterrupt commiserating phantoms on your picket fence\nHow quickly they will lift their heads\nAnd breathe an ultimatum like the dead don't argue\nSaid, \"You're living by the bayonet (but how alive are you?)\"\nShit, A is all juice and bad etiquette\nElbows on the table, lobster bibbin' on the ready set\nHe said, \"But how alive?\", I dunno, homie, you decide\n(No, you decide) Fine! How alive? Too alive\n(How alive?) Too alive (How alive?) Too alive\nAnd one by one around the yard 'til each one felt communal pride\nLike they had done their little part in cleaning up the public\nWith a steaming plate of justice for them Easy Baker stomachs (Say what?)\nWe the legends that hunt with the unremembered\nGeriatric lore in the clutch of the budding censor\nWho snuck around the art police and all related governments\nTo infiltrate a human lung and hike up off his tongue and lip\nAhh, money's in the market for a mothership\nTo double as a vessel that drag his legacy under it\nAnd who am I to hang him out to dry by the heat\nWhen, if rehydrating fails, we're all dumber because of me?\nZombies of the antiquated nation chatter quietly\nThe \"Too alive\" channel from the library of rivalry\nAnd summers in the mud (Mud), winters by the tracks (Tracks)\nNo story goes untold, Aes is back\n\nI got a handful rockin' the same poker-face\nDown to dance around the table like they own the place\n\n[Scratches]\n\"You look like you've seen a ghost\"\n\nI got the whole world thinkin' it's a holiday\n'Cause they can smell the chum in the water from miles away\n\n[Scratches]\n\"You look like you've seen a ghost\"\n\n(How alive?) Too alive\n(How alive?) Too alive\n(How alive?) Too alive\n(How alive?) Too alive\n(How alive?) Too alive\n(How alive?) Too alive\n(How alive?) Too alive\n(How alive?) Too alive", "title": "Keep Off the Lawn", "album": "None Shall Pass", "image": "https://images.genius.com/3d6c4d11084714cc67f880d71310d197.288x288x1.jpg", "year": "2007-08-28"}], "artist": "Aesop Rock"}