{"artist": "A$ton Matthews", "songs": [{"title": "Money Kallin", "image": "https://images.genius.com/430c25397a69492e6a536c74dfd11f6f.750x741x1.jpg", "album": "The Big Payback IV", "lyrics": "[Chorus x2]\nI can hear the money callin'\nI can hear the money callin' BRRRT!\nSKRRRT! SKRRRT! WHIP IT! WHIP IT! HELL YEAH!\nSKRRRT! SKRRRT! WHIP IT! WHIP IT!\n\n\n[Verse 1 - A$ton Matthews]\nSmokin' on that S.G.P., all my niggas T.T.G.,\nSlippin' thats an R.I.P., all these lil niggas know they heard bout me\nKnown to get it brackin' on sight\nNew bitch looking off white\nNowadays hittin' all types\nLookin like its one of them nights\nHeadshots in the moonlight\nDouble back, run it back twice\nWhy you even talkin' out ya place\nBoy I'll pull some hundreds out the safe\nPut some halos all around ya face\nHundred killers murder was the case\nBoy I only see wolves at the dinner plate\nSeen the feins slidin' home when they hit the base\nBoy I'm forreal I'm that quarterback\nFor less than a quarter sack, I'll split head of the God of Black\nPut that shit right on my fireplace, hold up now let me get cozy\nBoy in that bity I'm Tony, Presidential like a rollie\nAll my killas stay around me, crucify you for the glory\nCrown of thorns the fitted on me, Chapovelli really on it\n\n[Chorus x2]\nI can hear the money callin'\nI can hear the money callin' BRRRT!\nSKRRRT! SKRRRT! WHIP IT! WHIP IT! HELL YEAH!\nSKRRRT! SKRRRT! WHIP IT! WHIP IT!\n\n[Verse 2 - Kap G]\nI can hear the money callin' I ain't stoppin\nNiggas actin' like bitches name droppin\nWalk around with the bank in my pocket\nBought a couple chains with the diamonds\nI can hear it from a mile away\nI spend my own bread by the way\nI just want the head and the face\nFuck it put the bed in the wraith\nCan't be scared of what that money make\nLike Tay-K way they run the race\nScreamin' free my patnas, Can't believe they locked up\nI don't fuck with copper's, Foamposite Copper\nLike I worked at Footlocker, And when I work its on us\nI'ma turn my team to bosses, Man I took so many losses\nHad to enjoy the process, You know what that shit cost us?\nYeah, but I had to succeed, Believed in my dreams\nNow I'ma go do it all just for my team, RING, RING, RING, RING\n\n[Chorus w/ Kap G]\n(Aye, Who Dis?) I can hear the money callin'\n(KAP G!) I can hear the money callin' BRRRT!\nSKRRRT! SKRRRT! WHIP IT! WHIP IT! HELL YEAH!\nSKRRRT! SKRRRT! WHIP IT! WHIP IT!", "year": "2018-06-04"}]}