{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "This is it huh? This is America, in rich neighborhoods 3 shots fly\nThe reverend Fred Phelps is still living but Brilliant fucking geniuses like Steve Jobs die?\nBefore I speed it up I gotta warm  up right now\nBarack Obama's about to lose fuckin' White House and I admit Barack Obama's not my favorite but that's because disappointed NOT because I'm RACIST!\nSee y'all were laughing when they executed Troy Davis\nI think that Fred Phelps is scared of his own gayness\nThe funny thing is that none of y'all are even billionaires\nHalf you Tea Party fuckers make like 50 Grand a year\nSo just admit the fact is\nYou don't see the benefits in giving your taxes to young, poor, illiterate Black kids\nYou'd rather call me: pussy, commie, liberal and faggot which Is funny cause I'd whoop your ass\nI hope your youngest son comes home\nAs a gay pornstar named Young Gummed Sloan\nAnd he has two husbands; Adam and Steve and all three of them call you a faggot and leave\nI think it's time we speed it up like Jesse and Walt\nGive me a hit of that Blue Magic Methamphetamine salt\nI think it's time we re-elected Bill Clinton in a hurry and we make the vice-president BILL FUCKING MURRAY!\nYOU PROLLY GOTTA GIVE A LITTLE TINY BIT OF MONEY TO THE GOVERNMENT WE NEED IT FOR THE VETERANS AND OTHER SHIT INSTEAD YOU'RE LETTING FEDERALLY PREDATORY DETRIMENTAL DEVILS FUCK WITH IT AND TAKE IT TO ANOTHER LEVEL; I DON'T HATE RON PAUL EVEN THOUGH HE'S A BIT SCARY BUT MOTHERFUCK MITT ROMNEY AND RICK PERRY I THINK IT'S FUNNY HERMAN CAIN IS ACTING LIKE HE'S GONNA BLUR THE PAIN I WONDER WHAT HE'D DO FOR NOLA HURRICANES 9-9-9, what the fuck, like how? that's 666 upside down, we ain't asking you for nothing quit being a BIG BITCH, just because you work hard doesn't mean you get rich\nBut I'll be taking Michelle Bachman and sitting her down, sticking my dick in and licking and ticking and kicking her out\nAlright I love this fucking country so damn much that I would bleed from my heart just a little bit GOD DAMN\nI'm saying god damn these tea party, tea baggers want some cock-ham, LET'S GO! push it automatic redirect it gonna get a little bit electic decimate a country then we strip it naked, rape it, THEN WE GONNA BE RAPING THEIR HOLY VILLAGE NOW THEN WE TAKING A MISSLE WE GONNA HIT EM NOW\nI got a great idea somebody get Bill Clinton for President GET HIM NOW!\nWe need new president we need a real star I'm thinking Bill withers maybe even Bill Mar\nWe need to re-elect Bill Clinton in a hurry and make the vice-president BILL FUCKING MURRAY! We need new president we need a real star I'm thinking Bill withers maybe even Bill Mar We need to re-elect Bill Clinton in a hurry and make the vice-president BILL FUCKING MURRAY! BILL FUCKING MURRAY!", "year": "2011-10-11", "album": "YouTube", "title": "Occupy Wall Street Satire"}], "artist": "Mac Lethal"}