{"songs": [{"image": "https://images.genius.com/9bfa5db31e0b46c6b56e0d75b686a9c0.640x640x1.jpg", "title": "Eating Food in the Shower", "album": "Cool Patrol", "year": "2017-02-16", "lyrics": "[Spoken Intro: Danny Sexbang]\nBabe, you know I love you, but it's hard to find time to spend together\nYou've got your career\nI've got, my… uh I-I do stuff\nBut I'll find a way to work this out\nLet's get it on!\n\n[Verse 1: Danny Sexbang]\nI'm a busy guy, and you're a busy woman\nEvery day you wake up for work at the crack of nine\nThen we gotta choose between morning sex and breakfast\nGod knows we need both but there just ain't no time\nBut I've found a way to get the most out of our day\nI prepared you this buffet\nSo grab a tray, take off your clothes\nAnd follow me\n\n[Chorus: Danny Sexbang]\nLet's eat our food in the shower\nJust look at the time we've saved\nNothing unlocks a meal's flavor potential\nLike turning up a faucet head from pulse to spray\nWe're eatin' food in the shower\nAin't this romantic, it's just like rain\nAlthough I've definitely had crispier toast in my life\nAnd there's a huge amount of bacon\nCollecting in your drain, woo!\n\n[Spoken Interlude: Danny Sexbang]\nThat's right, girl. Don't things taste better when we're naked?\nI gotta tell you I-- whoops\nSorry I'll get that, that was--\nWhoa whoa whoa! Sorry sorry sorry. That wa... that was me\n\n[Verse 2: Danny Sexbang (Arin Hanson)]\nNow it's later at night, and the mood is right for lovin'\nIt's our 3 day anniversary, let's celebrate\nReservation for two at a candlelight dinner\nRight inside your own bathroom, what a convenient date!\nSit down at the tub-shaped table\nGive your order to the waiter\nAnd hold my pruney hand\nI also hired a harpist and mariachi band (Mi amor!)\n\n[Chorus: Danny Sexbang, Markiplier, Ryan Magee & Matt Watson]\nEating food in the shower\nBut just between us I don't deny\nAll the drinks are watered down, there's shampoo in my tacos\nAlso I asked a bunch of friends if they would like to stop by Hi!\nWe're eating food in the shower\nThis is the pinnacle of your year\nThe night is only getting better as we get wetter and wetter\nHey is this mayo or conditioner? I have no idea\n\n[Outro: Danny Sexbang (Arin Hanson)]\nMan, it's getting crowded in here. Let's towel off\nOh God, the mariachi band! (Señor!)\n(Ay, dios mío!)"}], "artist": "Ninja Sex Party"}