{"songs": [{"title": "Facts", "album": "All Things Work Together", "year": "2017-09-22", "image": "https://images.genius.com/747844e49a25266360c34f8cab2cc4de.1000x1000x1.jpg", "lyrics": "[Intro: Ekemini Uwan]\nPeace does not come before salvation and salvation does not come without truth\n\n[Chorus]\nI will only tell the truth\nI will only tell the truth\nIncoming!\nTruth, truth, truth, truth\nTruth, truth, truth, truth, truth\n\n[Verse 1]\nPeople wonder, \"Is he woke or just a new slave?\"\nOld religion, he just covered it with new chains\nChoppin' out the church, he ain't real, he fake\nHe divisive, he don't rep the King, he just want the fame\nAw man, now they actin' like I'm suddenly political\nTold me shut my mouth and get my checks from Evangelicals\nBoy, my momma raised me, on Angela and Eldridge\nChuck Berry made it, but the credit went to Elvis\nKnow you never knew that, know you think I'm too black\nI just think I'm too real, I grew up on 2Pac\nYou grew up thinkin' that the Panthers was some terrorists\nI grew up hearin' how they fed my momma eggs and grits\n\"'Crae, they say you should follow in the steps of King\"\nI say, \"You've forgotten how they shot him in the streets\"\nI ain't really changed, it's the same old rebel\nStill a radical, I'm passionate, it's just another level (leggo!)\nAT told me I should fight back\nThey don't like that (they don't)\nJust know if you rock the boat you better have a life raft (what?)\nBJ told me I should fight back\nThey don't like that\nJust know if you rock the boat you better have a life raft, woo!\n\n[Chorus: Ekemini Uwan]\nI will only tell the truth (facts)\nPeople cannot abide by a truth. They prefer fantasy over reality... (facts)\nI will only tell the truth\nI am for truth no matter who tells it\nI will only tell the truth\nI am for justice no matter who it is for or against (facts)\n\n[Verse 2]\nRose up out the dungeon\nI was feelin' haunted\nNow I'm bein' hunted\nAnd I'm on a hunnid\nHit the gas, gunning\nSkip the past running\nTell 'em they could bring that\nIf they really want it\nI, I'm on the hometeam\nYou just running with the wrong team\nNever take 'em with the heavyweights or, boy, you'll die and need a little protein\nSouthside off a Yellowstone, had a ham bone and a white tee\nGot a 12-pack of that real talk in the trunk, tell 'em, \"Come find me\"\nDraped up, dripped out, covered in the blood\nMan, I hang where they cripped out, sippin' on the mud\nWhere they swingin', got the whips out, watch 'em pop trunk\nYeah, I know it's hella dark, but I'm tryna light it up\nNow these people swear they own me, sendin' out threats\nTold me keep my mouth shut, told me be a Stepin Fetchit\nI will not oblige to your colonized way of faith\nMy Messiah died for the world, not just USA\nThey say, \"Jesus was Conservative\"\nTell 'em, \"That's a lie\"\nNo, He not a Liberal either if you think I'll choose a side\nThey say, \"'Crae, you so divisive, shouldn't be a black church\"\nI say, \"Do the math, segregation started that first!\"\nHey, you want unity? Then read a eulogy\nKill the power that exists up under you and over me\nI said, you want unity? Then read a eulogy\nKill the power that exists up under you and over me, woo! (facts)\n\n[Spoken]\nSo reconciliation or conciliation requires defrauded parties to be made whole. Not just apologizing for the offense\n\n[Verse 3]\nI was waitin' for the right time to tell y'all how I feel\nAnd, yeah, I know that it hurts, but look, it's gon' heal\nI waited 'til I was on prime time before I let y'all know\nAnd you prolly won't wanna hear my music no mo'\nBut it's all good, man, I love y'all\nHope you know that I'm black black\nTrade in my Smart Car for a Cadillac, can you handle that?\nAnd I love God\nI love Jesus, the one out of Nazareth\nNot the European with the ultra perm and them soft eyes and them thin lips\nAnd I'm still hood\nBeen in the 'burbs for quite some time\nBut I still might hit the gas station for the Lemonheads and the pork rinds\nAnd I'm on one\nYeah, 116 been real\nBinghamton, Tennessee, from Third Ward to Ceiling Hill\nAnd I live a multiple world, call me a hybrid 'cause I'm so black\nYoung theologian who educated, but still be at that Chicken Shack, yeah\n\n[Outro]\nLemme get a two-piece"}], "artist": "Lecrae"}