{"artist": "Andy Mineo", "songs": [{"title": "Caught Dreaming (Remix)", "album": "Heroes for Sale Remix - EP", "year": "2014-04-01", "image": "https://images.genius.com/b4256a40845c3e6eb33bb7a28f6dc008.540x540x1.jpg", "lyrics": "[Intro: for King & Country]\nI'm caught dreaming (I'm caught dreaming) (x3)\n\n[Verse 1: Andy Mineo]\nWhy waste my breath singing words of praise\nThat are filled with myself? (Who's greater?)\nWhat love do I have that you didn't give\nCause all that I am is a product of grace\nAnd what should I trust, your love for me\nOr my love for you? Who's greater?\n\n[Hook: Marz Ferrer & for King & Country]\nI'm caught dreaming\nSomeone greater than me\nAnd I like singing (ohhh)\nA burning tree speaking to me\nI'm caught dreaming\nI'm caught dreaming\nSomeone greater than me\nBringing liberty (ohhh)\nThe blood on Your tree is saving me\nI'm caught dreaming\n\n[Verse 2: Andy Mineo & Marz Ferrer & for King & Country]\nYeah, mouth full of praise, I love you so much\n(mouth full of praise, I love you so much)\nWhat an empty phrase, really I'm more amazed\nHow in spite of how I fail to (fail to) do what you command to (command to)\nServe other gods like Baal, you never bail\n(Serve other gods like Baal, you never bail)\n(I'm caught dreaming, ohhh) That's illogical devotion, could it really be\nYou chose to die for the sinner when nothing was good in me\n(I'm caught dreaming, ohhh) You never left me, even when the darkest days began\nNor forget me, only thing you're forgetting is my sin\n(I'm caught dreaming, ohhh) I wanna make it to the end, let me remain faithful (remain faithful)\nAll because you're faithful to me, yeah, I'm grateful\n(All because you're faithful to me, yeah, I'm grateful)\nMy mistakes can never stop the choice you make to adopt me\n(My mistakes can never stop the choice you make to adopt me)\nThe holes in your hands are the proof that you'll never drop me\n(The holes in your hands are the proof that you'll never drop me)\n\n[Hook]\n\n[Bridge: Marz Ferrer & for King & Country]\nI'm caught dreaming (I'm caught dreaming (x3))\nYeah, I'm caught dreaming (I'm caught dreaming)\nI could sing how I love you\nBut your love is much greater\nAnd I could sing how I love you\nBut your love is much greater\nI'm dreaming\nI could sing how I love you, love you\nBut your love is much greater\nAnd I could sing how I love you, love you\nBut your love is greater\nI'm dreaming (oh dreaming) (x4)\nOh Dreaming (x4)\nI'm caught dreaming (I'm caught dreaming (x3))"}]}