{"songs": [{"image": "https://images.genius.com/8cde208a054ce65c33ef8e1b15101520.500x500x1.jpg", "year": null, "title": "Bitter", "album": "The Complex Experiment Vol. 2: Boy From Kansas", "lyrics": "[Verse One]:\nI can't lie man I'm bitter\nSitting in a room with tears with a river\nI came in forgetting I was here to deliver\nThese thoughts so I write this here like a picture\nLooking insecure at myself, \"What's wrong with you nigga?\nYou can't write. Where's the songs little nigga\nYou thinking you hard, your balls ain't with ya\nThe city don't like ya. They all is against ya\nCan't find yourself, can't rhyme like yourself.\"\nI wanna hang it up but my mind's on the shelf\nIf I didn't have this flow then what would I be?\nMe?\nNah\nYou got it backwards like hearing 2Pac on the record saying \"Suge shot me.\"\nAnd I would not be\nMyself if I changed so why would you think that would ever be arranged\nI felt pain, so your words hurt me\nCame back fighting like Tyson no mercy\nBite his ear off not trying to hear Hoff\nI ain't gon' lie, I still feel like that nigga\nBut I'm still human so I'm still that bitter\nWho wants to hear that they ain't liked\nBy somebody they ain't met in they whole life\nPlay this song back and they gon' say I'm right\nNext time they throw the bait, I ain't gon' bite\n\n[XV talking]:\nAnd I'm good. I'm good on that one. Let me say a few words though. The whole inspiration behind that freestyle right there...was...from a review. It stems from a review on hiphopdx I got on my album. And it was a pretty bashing review if you go check it out. I mean, it misquoted me. It talked- not only did it bash my music but it bashed me as a person. And I ain't gon' lie I was bitter and hurt at the review. I mean, I felt like they acted like I didn't show emotion in my music so...I figured I'd give them an emotion freestyle. Haha. I mean, I'm all good now. Cause I, I felt like dude was a hater but...critics are critics right Clark Kent? Yeah, I guess the next time they throw the bait I just ain't gon' bite. Right? Haha. The next thing they gon' say is, \"That nigga XV laugh too much.\" Haha"}], "artist": "XV"}