{"artist": "Pusha T", "songs": [{"album": null, "title": "Blow / Funk Flex Freestyle", "image": "https://images.genius.com/66e8896c8c1bb069880e68e1abc3f74f.900x900x1.jpg", "lyrics": "Malice found religion, Tony found prison\nI'm just tryna find my way up out this f*cking kitchen\nA Birdseye view got me channeling my vision\nTurn one to two now the kilo's got a sibling\nFather knows best, wash my hands, all's forgiven\nWe kicking up dust like the Colosseum floors\nWalls full of safe's like they mausoleum doors\nPussy getting wet like she walking through my morgue\nGrant's, Jackson's, no room for George\nYeah, the fear of God's in you motherf*ckers\nThis art imitate my life\nYour WorldStarHipHop fame based off imitation white\nEliminate the fools ghouling imitation ice\nMy music's for your soul, inspiration for your life\nEvery dime made in his life more disastrous\nHelp my young bitch see her way through her bachelors\nWhile my old bitch went back to get her Masters\nSame graduation, I was clapping in the rafters\nThe truth hurts every time it's revealed\nWhat goes around comes around, this is life's Ferris wheel\nGrab hold and reverse the steering wheel as I parallel park\nKentucky derby on the grill\nThe fact that I'm free let's me know God is great\nTen year marathon of me selling concentrate\nThese rappers talk crowns but I'd rather talk fear\nVillain like Candyman, say my name and I'll appear\nNo weapon formed against me shall prosper\nHakuna matata, feet up, sipping java\nEy yo, strolling up the totem pole, what's my only problem?\nScrolling through my Rolodex, who shall bed my toddler?\nSo many hands raised as the band plays\nI'm here now, watch how many niggas plans change\nAnd eventually answers to the call of Autumn\nAll of them fallin' for the love of ballin'\nGot caught with 30 rocks, the cop look like Alec Baldwin\nInter century anthems based off inner city tantrums\nBased off the way we was branded\nFace it, Jerome get more time than Brandon\nAnd at the airport they check all through my bag\nAnd tell me that it's random\nBut we stay winning, this week has been a bad massage\nI need a happy ending and a new beginning\nAnd a new fitted and some job opportunities that's lucrative\nThis the real world, homie, school finished\nThey done stole your dreams, you dunno who did it\nI treat the cash the way the government treats AIDS\nI won't be satisfied til all my niggas get it, get it?\nI need more drinks and less lights\nAnd that American Apparel girl in just tights\nShe told the director she tryna get in a school\nHe said \"take them glasses off and get in the pool\"\nIt's been a while since I watched the tube\nCause like a crip said, \"I got way too many blues for any more bad news\"\nI was looking at my resume feeling real fresh today\nThey rewrite history I don't believe in yesterday\nAnd what's a black Beatle anyway, a f*cking roach?\nI guess that's why they got me sitting in f*cking coach\nMy guy said I need a different approach\nCause people is looking at me like I'm sniffing coke\nIt ain't funny anymore try different jokes\nTell 'em hug and kiss my ass, X and O\nKiss the ring while they at it, do my thing while I got it\nPlay strings for the dramatic\nAnd end all of that wack shit\nAct like I ain't had a belt in two classes\nI ain't got it I'm going after whoever who has it\nI'm coming after whoever. Who has it?\nYou blowing up, that's good, fantastic\nThat y'all, it's like that ya'll\nI don't really give a f*ck about it at all\nCause the same people that tried to black ball me\nForgot about two things, my black balls\nUh, look, Uh uh\nI let you into my diary to admire me\nThe making of this man, I let you see the higher me\nThe self righteous drug dealer dichotomy\nI'm drawn from both sides, I am Siamese\nThe tug-of-war opens the door, entrada\nRip me apart and see what's inside of this piñata\nAnd rolling kilos in Gymstrada, that's one saga\nOne chapter of black magic, I'm Harry Potter\nFeels like I'm doomed to dealing with women who\nRelationships with their fathers won't allow us to bloom\nAnd blossom, I swear this Vegas night was f*cking awesome\nBut adios, I blow my own dice before I toss 'em\nLoss some niggas, some other niggas double-crossed 'em\nTryna snatch my niggas back I blew a small fortune\nWrestle with the work, we was like the four horsemen\nRick Flair with the flame, I'm muthaf*cking gorgeous, woah\nAs the gull wing doors lift, Karate Kid, crane kick, no Jaden Smith\nWhiter than that coke brush did they paint me with\nSunk leather seats softer than an angels kiss\nBut they devil-red, tires double tread\nI postin parks up, that gives me double head\nTight rope walking, tryna keep a level head\nThe bright lights blind, look at what the devil did\nYuugh!", "year": null}]}