{"artist": "Boldy James", "songs": [{"album": "My 1st Chemistry Set", "title": "400 Thousand", "year": null, "lyrics": "[Verse 1]\nYou can't have no friends in real life\nWhen all you do is bag up grams and sell white\nGotta find some way to stash these bands\nAnd hide this cash\nIf they trip over my stash they set for life\nI recognize it's hard to get it and keep it\nEasy to jeopardize\nRisk ain't worth the reward, pay it no never mind\nTake it in stride and if worse comes to worst\nYou always board your first, never your second mind\nMind your business and never mix business with friendship\nCause friends be the ones in the end when it's all said and done\nWho can you call? Who can you run to?\nWill they come through on the humble?\nOr will they drop the ball and fumble\nI wouldn't be surprised\nI've seen it all out my own two eyes\nBefore he died my uncle\nSaid, \"if you let it slide it'll come back to haunt you\"\n\n[Hook]\n400 thousand\nI got all of this money and can't trust a soul to help me count this\n400 thousand\nNow the kush and the bricks got me pushing whips that ain't even out yet\n400 thousand\nKnow how you know you getting money when you spend a thousand dollars on an outfit\n400 thousand\nI got all of this money and can't trust a soul to help me count this\n400 thousand\n\n[Verse 2]\nMy son asked what's the most money I ever counted\nI told him 'bout $460,000\nAll dope money from whipping ounces\nSlow rolling them snow bunnies in Clinton Township\nThe bastards tried to give me 'bout six\nFor transacting them graham crackers of that brown shit\nHad me surrounded\nThey jammed traffic, the vans in back of them Crown Vics\nBut they never found shit\nDuring the fed run-ins, out in southwest\nUsed to have to get plugged into the outlet\nBagging up in the house, stressed, ask Justin\nMan, I used to have nothing, but now I'm rich\nNo more out of town trips, jumping on the road\nNo change of clothes, same old outfit\nIn the natty we hit the outlet\nWhat I blew on vintage True Religion denim could've bought a couch set\n\n[Hook]", "image": "https://images.genius.com/c262e3e16e205e57432001e745db05b4.400x400x1.jpg"}]}