{"songs": [{"year": null, "image": "https://images.genius.com/41f9d7c489313eefe0fb972cee6b844e.800x800x1.jpg", "title": "C.W.G.", "album": "American Made", "lyrics": "[Verse 1]\nI'm a southern fried cracker with my dreams and a plan\nWithout my girl in my world I might be half of that man\nLady Luck in my life when I'm playin' the odds\nShe's like an angel sent from heaven or a gift from the Gods\nBut she's got fire in her eyes and from her head to her toes\nShe's a certified dime with the streets in her soul\nShe puts the heat in my heart when I'm feelin' so cold\nAnd got my six when we rollin' dirty down these back roads\nShe's a big booty queen with a helluva swag\nGot them Dolche frames poppin' with the strap in her bag\nAnd that back so bad that we should rock them jeans\nShe's the queen of the aqua dreams, know what I mean?\nYeah she can get the business any time of the day\nMy lil double barrel baby when were rollin' the hay\nOr when were rollin' for pay, she be locked and loaded\nShe's down for a man and she'll pop to show it\n\n[Chorus]\nShe's a C.W.G. baby\nOne to roll shotgun when I'm ridin' dirty\nOne to roll a tight one when I'm drivin' for me\nAnd she got my back, boy, I ain't gotta worry\nI need a C.W.G. baby\nOne to split the shell with her nail\nGet to fightin' and go to jail\nWrite her name in a holdin' cell, my babys\n\n[Verse 2]\nA lot of dudes have problems expressin' their heart\nUntil they walk out the club and see them dents in they car\nAnd they start tellin' they girls how important they are\nThese girls runnin' round here emotionally scarred\nShe been with the boy, she tryna deal with a man\nShe was confused in her youth now but she understand\nThat she can do bad by her damn self\nSo save that broke mess for somebody else\nLil momma help a dude get up on his feet\nHold his heat up for him late night in the street\nNo matter how big you get never forget she\nWas with you back when you was still selling 16s\nAnd them other broads wasn't thinkin' boutchya\nNow they talkin' to ya tryna get a drink up outcha\nAnd you a trick goin' for it need a leave them girls alone\n'Cause you gotta good one waitin' on yo ass at home\n\n[Chorus]\nShe's a C.W.G. baby\nOne to roll shotgun when I'm ridin' dirty\nOne to roll a tight one when I'm drivin' for me\nAnd she got my back, boy, I ain't gotta worry\nI need a C.W.G. baby\nOne to split the shell with her nail\nGet to fightin' and go to jail\nWrite her name in a holdin' cell, my babys\n\n[Verse 3]\nI love the way she break it down and straight hustle the block\nAnd have the whole club starin' at the way that she walk\nA couple Jäger bombs baby go on and gimme a shot\nWe'll shut the bar down and open up the after spot\nShe's a backstage beauty prime time for a pole\nBut I'd never put my baby on display for a show\nShe's VIP but just for me\nAnd we can take it to the top of the penthouse suite\nCause shes my C.W.G. baby\nShe could drive the whole gosh damn world crazy\nHalf the time I'm out my mind from the days that she trips\nI pack my bags and try to leave but I just can't split\nAnd even though she's throwed off a little out of control\nShes the apple of my eye, the true match to my soul\nWe go to ride together touch the sky together\nMy C.W.G. baby, we'll die together\n\n[Chorus]\nShe's a C.W.G. baby\nOne to roll shotgun when I'm ridin' dirty\nOne to roll a tight one when I'm drivin' for me\nAnd she got my back, boy, I ain't gotta worry\nI need a C.W.G. baby\nOne to split the shell with her nail\nGet to fightin' and go to jail\nWrite her name in a holdin' cell, my babys"}], "artist": "SMO"}