{"songs": [{"year": "2017-11-03", "lyrics": "[Intro]\nYo, what happened to this shit, ho?\nKeep going, it sounded great!\n\nTell Fatima that my sneaker that I paid too much from Neiman's...\nGotta... gotta flow, gotta flow\nGotta go, gotta go\nAnd my only first time puttin' these mothafuckas on\nI only have eyes on my clothes\nI love my clothes like I love my girl that I hold close at night\nI got so many clothes in there it'll make you lose your mind\nI got suitcases and suitcases and shoelaces upon shoelaces\nTwo options, but I keep the ones in\nBlue faces, blue faces, I got...\nI got Fear of God, I got Prada\nI got Gucci on, I got Balenciaga, but they did me wrong\nI'm waitin' for I can get my discount on\nI'm waitin', man, I'm addicted to these clothes, dawg\nI'm addicted to wearin' 'em at my shows, dawg\nWearin' 'em out every time I step out, wearin' it\nAll times of the day, I be in the house fresh like\nWhy the fuck is he doin' that shit? You don't know what happened next\nMight be somethin', ill happened\nGrab out your phone and look at your fabrics\nThem shits is good, your gold is glowin', nigga, you got it\nThem shits is good, your juice is glowin', nigga, you got it\nDammit, bruh, dammit, bruh, dammit, bruh\nRemember when I used to eat them made sandwiches\nFrom my mama like it was lunch, made, lunch, made\nI was at the shipyard [?]\nI brush and roll, brush and roll\nThat brush and roll\n12 dollars [?] 12 fucks, that's right before the tax\nYou know that they 'bout to take 1/6th of that\nOh, Uncle Sam\n\nI only have eyes for my clothes\nI only have eyes for my fabrics\nI only wear [?] clothes\nNigga you know I got it\nI got the Fendi belt\nI got the Gu... ooh, ooh\nI got the Prada belt with the fur\nI got the... yeah, yeah\nI got that corduroy as well, yeah, yeah\nWith the little studs on the side\nStuds in the front, what?\nI got [?]\nI got [?] in the front\nI got new shit, got the Common Projects for the basic\nI got rent on, I got all that shit, bitch I'm famous\nI don't know it though, I roll down the window like what's up?\nPeople come inside, they be lookin' like, \"what's that, bruh?\"\n\nYo, I had walked up in the...\nYeah the chicken spot up in the city\nJersey City spot is right outside New York City\nWhere they're tryna get a little cheaper, but it's gritty\nI was with my lil' bitty, with my lil' bitty\nI was tryna go out, tryna be my own\nSometimes I don't wanna have these fuckin' people out here\nThinkin' that I'm just a superstar, so well known\nThat I don't know how to walk like people walked back in the days\nIn their shell toes\n[?] change your ways, nigga, hell no\nAnyways, we walked up in the chicken joint\nAnd that girl tapped her man like\n\"Bae, that's the boy that did that song, that one song\nThat \"I be on that fuck shit,\" they sing along\nThe one our kids like, the one that niggas fight up in the club\nBecause it gets hype\nAnd nigga stepped up on your Nikes, they ones\nThem ones you just got yesterday, them new Air Force Ones\nThem Fresh Wipes, you know you can't even get the scuff up off them\n[?] fuck up off you\nSometimes that shit [?] problems\"\nI was just tryna make music to make the people do it\nI seen somebody gettin' moved to my fuckin' music\nMoved [?] pain involved\nBut I was like I seen the pain, but just stay at home\nThe next song is gon' make you feel like a ray of sun\nThe next song is gon' make you think about your one\nEven if you're still lookin' for that very one\nYou gon' have this to know that [?]", "title": "Check Ya Fabrics", "album": null, "image": "https://images.genius.com/6356cb78f83b5bd8c293e6eb87909206.1000x750x1.jpg"}], "artist": "DRAM"}