{"artist": "CalBoy", "songs": [{"title": "Love Me", "album": "Wildboy", "year": "2019-05-31", "image": "https://images.genius.com/33eeaabad87daf9980dfa3a693243128.1000x1000x1.jpg", "lyrics": "[Chorus]\nTold my bitch I cannot stay over (I can't stay over)\nI been trappin', got this weight on me (Got this weight on me)\nI need time for fixin', can you wait on me? (Can you wait on me?)\nStay one hundred, never change on me (Never change)\nI heard you love me, love me, love me (I heard, I heard)\nWhy don't you love me, love me, love me? (Why don't?)\nYou said you love me, love me, love me (You said)\nWhy don't you love me, love me, love me? (Why don't?)\n\n[Verse 1]\nI come (I come), from out the dark (From out the dark)\nI'm from (I'm from), nothing at all (Nothing at all)\nDon't jump in this water with sharks (Water with sharks)\nNo love, this shit'll take your heart (Take your heart)\nAyy, I pray to the Lord (Pray to the Lord), yeah, for better days\nYeah, hop in a Wraith, I blast away, yeah (Skrrt, skrrt)\nPop me a bar, I might wake up on Saturday, yeah (Saturday)\nI'm on top of the stars, I'm gettin' high today, yeah (I'm gettin' high today)\nSay you with me, but then you be leavin' when it get ugly (When it get ugly)\nI'm in the streets, I'm totin' this beam, lil' baby, I'm thuggin', yeah (Baby, I'm thuggin', yeah)\nI'm feelin' pain pain, I'm sippin' on muddy (Pain pain)\nI know they changed changed, don't say that you love me, yeah (Changed changed)\n\n[Pre-Chorus]\nI been off these drugs so I can function\nAnd I come from bustin' guns, no tusslin'\nAnd I heard you love me, love me, love me\nShow me if you love me, love me, love me\n\n[Chorus]\nTold my bitch I cannot stay over (I can't stay over)\nI been trappin', got this weight on me (Got this weight on me)\nI need time for fixin', can you wait on me? (Can you wait on me?)\nStay one hundred, never change on me (Never change)\nI heard you love me, love me, love me (I heard, I heard)\nWhy don't you love me, love me, love me? (Why don't?)\nYou said you love me, love me, love me (You said)\nWhy don't you love me, love me, love me? (Why don't?)\n\n[Verse 2]\nI come from out the dark\nWe was out there gettin' it, we was trappin' hard\nCounted up them deads for my siblings, it was stack or starve\nHeard she got meds for the healin' of my broken heart\nI know that my heart is ice cold\nBut I love when I hug her, she warm\nAnd I mean you no harm and no form\nWipe your tears when I'm home, ain't no storm\nCome from that mud, they thuggish, ruggish\nI just been bustin' juggs and hustlin'\nToss me your heart and I won't fumble it\nBitch, let me give you this thuggin', lovin'\n\n[Pre-Chorus]\nI been off these drugs so I can function\nAnd I come from bustin' guns, no tusslin'\nAnd I heard you love me, love me, love me\nShow me if you love me, love me, love me\n\n[Chorus]\nTold my bitch I cannot stay over (I can't stay over)\nI been trappin', got this weight on me (Got this weight on me)\nI need time for fixin', can you wait on me? (Can you wait on me?)\nStay one hundred, never change on me (Never change)\nI heard you love me, love me, love me (I heard, I heard)\nWhy don't you love me, love me, love me? (Why don't?)\nYou said you love me, love me, love me (You said)\nWhy don't you love me, love me, love me? (Why don't?)"}]}