{"artist": "Apache", "songs": [{"title": "Who Freaked Who", "image": "https://images.genius.com/7b040bdcfb9c6c3e03af2d9b25c4c25d.500x500x1.jpg", "album": "Apache Ain’t Shit", "lyrics": "[10 second convo between the two to start]\n\n[Chorus: Apache] + (Nikki D)\nWHO FREAKED WHO? (Nigga I freaked you)\nWHO FREAKED WHO? Bitch I freaked you\nWHO FREAKED WHO? (You didn't know what the fuck to do)\nWHO FREAKED WHO? Ha-ha, that's not true\n\n[Apache] + (Nikki D)\nI know who freaked who (yeah nigga) that's a stupid-ass question\nI freaked you and taught that pussy a lesson (heh)\nYou must admit I got the good shit I was way up in it\nAnd when I licked the clit you came for 20 minutes (mm-hmm)\nSweat, moans and groans, and the sex aroma\nFill the room, I'm done hon, then left you in a coma (what?)\nIt begin in candlelight, you try to fight and tussle\nNow you daydream and fiend for my love muscle (sure!)\nIs it love or lust, pleasure or pride\nIf I can't hit bottom I try to fuck up one of the sides (yeah right)\nYou found my spot, got on top, tried to twist and twirl\nFuck \"Daddy,\" now your Apache's Little Girl (whatever!)\nTime for a spankin, but I'll take head instead\nI fuck so well I had seatbelts put on my bed (yeahh)\nDon't be a dummy, buckle up I won't cum too fast (uhh)\nBut believe you'll need a cast for that fat ass\n\n[Nikki D] + (Apache)\nHuh, you ain't all that, your dick stayed the softest (what?)\nCouldn't find pussy in a gynecologyst's office (he he he)\nWhen we kissed, you touched tits, started a sex dual\nYou can't hang, I dropped the drawers and you started to drool (nah)\nI'll admit, the body's fit and quite sexable (yeah)\nI put my ankles on your neck because I'm flexible (uh-huh)\nI'll make you scream when you nut cause you're full of that\nSo what your dick is big I had to show you where to put it at (don't be lyin)\nDon't be shy, I'll treat you real good of course\nPunch in your code and get rode like a fuckin horse (uh-huh)\nFuckin the way I do, it takes nuff guts (ha ha)\nAnd when I'm done you need a tourniquet put on your nuts (ha ha ha!)\nWe play the game, find the hot spot, it's not up top\nFollow the flow, lick 'em low, and it's hard as a rock (ahh shit)\nLayin me, you lose your mind, don't know what to do (what?)\nWho freaked who? (uh-huh) I fucked and freaked you (nah)\n\n[Chorus: Apache] + (Nikki D)\nWHO FREAKED WHO? Yo bitch I freaked you\nWHO FREAKED WHO? (Motherfucker I freaked you)\nWHO FREAKED WHO? Bitch you know that ain't true\nWHO FREAKED WHO? (Nigga this pussy is too good)\nWHO FREAKED WHO? Bitch, I freaked you\nWHO FREAKED WHO? (Nigga bring that dick, more dick)\nWHO FREAKED WHO? Yeahhh, more dick for you\nWHO FREAKED WHO? (Well motherfucker freaky too)\n\n[Nikki D] + (Apache)\nYeah, ain't nothin more pleasin than ass when you need it\nOver 17 so don't PG-13 it\nI can find a freak and fuck around ya whole crew\nBut I'ma use you, then do you, maybe even screw you (What? You buggin)\nThrow my back against the wall and watch me slide to the floor\nPull my panties to my knees and striptease like a whore (daaamn)\nTry you out for size, put your head between these thighs\nLick it lovely motherfucker see this coochie ain't shy\nWatch me bend it, spin it, by now the dick is in it\nPushin butoons and I'm lovin every fuckin minute\nIf you grabbin for sheets yeah I'm grabbin them ass cheeks\nDick nice and hard, hey the pussy's on me\nAhhhh-hahh; the nigga tried to stroke it\nAhhhh-hahh; the nigga tried to poke it\nAhhhh-hahh; the nigga almost broke it\nAhhhh-hahh; but the pussy just smoked it\n\n[Apache] + (Nikki D)\nI must admit you're a great fuck but then again (I know)\nI'll suck your pussy 'til your forehead caves in\nAll I need is whip cream, a dream gets strung\nWhile you pull on my braids I'll tickle your nips with my tongue\nYou're on the menu, I'm hungry, you're the breakfast miss\nThen I'll stick my dick between your big breasteses\nYou pop shit, I pop coochies, you're not the last\nPretty soon you'll have my name tattooed on your ass\nDon't get sad or mad, don't fuss or fight\nGive me a blunt a bottle of hooch and I'll fuck all night\nI'm the freak of the week I'll fuck you any place\nIn a hooptie, a bus, or the fire escape\nNeed I say more, should I go on, let me continue\nI try to go deep and put my nuts all up in you\nFuckin with me, you lose your mind, don't know what to do\nWho freaked who?  I fucked and freaked you\n\n[\"who freaked who\" repeats with Apache and Nikki D ad libs to end]", "year": "1993-02-09"}]}