{"songs": [{"title": "Widescreen", "year": "2013-09-03", "album": "Nostalgic 64", "image": "https://images.genius.com/f28b6855343451e556086d30a3adbd16.494x494x1.png", "lyrics": "[Intro]\n\n[Verse 1: Denzel Curry]\nYesterday I had a talk with my reverend\nAbout how I traded my soul to get a skeleton\nOf Lucifer, so a nigga can mount it on his wall\nHella high, hella high so an angel can never fall\nSmoking on the mystical chronic from a shaman\nDisguised as Andre Young with razor blades under the tongue\nHopefully his speech impediments might call upon, petchulants\nSo he can rip the wings off Cosmo, and Pegasus\nEating Flapjacks with a cannibal Captain K'nuckles\nKamakaze, jeepers creepers, read the power, ate his tonsils\nThrew it up, gave it to an asthmatic\nSwapping spit with crack addicts, Complex magazine and mathematics\nDilated with the ganja and peripherals\nI look at things as cynical, I put the fun in funeral\nA misty, mystic, mischievous one\nBurning papers of the book, Fahrenheit 451\n\n[Chorus]\nCan you see what I see?\nLook at life in 3D (Widescreen)\nCan you see what I see?\nLook at life in 3D (Widescreen)\nCan you see what I see?\nLook at life in 3D (Widescreen)\nCan you see what I see?\nLook at life in 3D (Widescreen)\n\n[Verse 2]\nTrying to achieve the same color as tile sky forest\nI see everything like I'm Horus\nSo watch man, like I'm into Rorschach\nSTDs and bullets—that's what happens when them guns clap\nWickedly sticking these bitches, G', I'm Ice Cube Jackson\n5 fingers of death, I'm packing\nSomething that will make you feel like a paraplegic\nParalyzed when folks no habla murder thesis\nTold based god I'd give him a virgin sacrifice\nAnd stepped into a Pantheon and said \"Yo, which one you like?\"\nStep to Aphrodite with an amethyst rock\nCrystal, get it dog? nah that's a Shih Tzu\nIf you don't really get the moral of the song\nBasically, I see crazy shit, when I grip the bong\nSo maybe right now, you know what that means\nMy eyes are dilated, all three, in HD\n\n[Outro leading into N64]"}], "artist": "Denzel Curry"}