{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "Looks Like a Job 4...", "album": "Birdman", "lyrics": "Looks like a looks like a job job job for job for\n\n[Baby in the backround of Hook]\nOh yeah!\nOh yeah!\nBirdman motherfucker, holla at your boy nigga\nLook, whew, fly in any weather nigga\nTryin to get this money\nYou know real real high, real real high\nWe tryin to stack it biatch\nBird call motherfucker!\n\n[Hook]\nBirdman, look looks like a looks like a looks like a job job job for job for\nBirdman, look looks like a looks like a looks like a job job job for job for\nBirdman, look looks like a looks like a looks like a job job job for job for\nBirdman, look looks like a looks like a looks like a job job job for job for\n\n[Verse 1]\nYeah, I'm on a mission lil daddy to scoop in the Caddy go visit Ms. Gladius\nB(ah) to A(ah) to B-Y BIATCH!\nSomethin' so fly and somethin' so slick\n24's, 28's, got to be better, 18's never, nigga whatever\nIt's the New Orleans finest BIATCH!\nI'm a worldwide rider with that Gucci and Prada shit\nLook like I got to uplift my Prada, get a few dollars, holla at a model\nNigga if it ain't money it can't beat me\nThat platinum from the neck, wrists, finger, and teeth\nBut I'm so so cool and I'm so so ooh\nGet outta line watch me bust my 2\nI ran out the house and I ran in the building\nThem people was comin, \"Hands up!\" ya feel me\n\n[Hook]\n\n[Verse 2]\nI'm the bird of the nest\nThe shark of the sea\nHungry dog on the concrete that's tryin' to eat\nNobody move me cause I be who I be\nThe Uptown rider, the home CMB\nI get what I want when I want I could have it\nLexus, Bentley, and the Jag nothin' average\nNever got married but I'm lovin' Ms. Gladius\nBirdlady in that brand new Caddy\nI'm a boss nigga\nNothin' less, two boats no cost nigga\nFly nigga hold your hearts nigga\nThat what Daddy told you, Mommy told you\nI stand my grounds, be a man homie\nNo quarters no halves, with them wholes thang\n\"Fuck it, pitch in nigga!\" and don't fuck with them chickens man\nFlip whatever: cars, rims, and bucks\nLive this life like you don't give a fuck nigga\n\n[Hook]\n\n[Verse 3]\nDo a doughnut, swing around, and come around the corner\nChange feathers twice, come back with the homies\nThat fly shit, that Prada and Gucci sheets\nFeather to the floor with swine on her feets\nBezel that glow with the 9 on the seats\nAnd whether thats snow or white mink on me\nSee I'm hustlin' leathers and I'm chasin' cheddars\nThat's Eminem's bitch, it gets no better\nWith the wide D-lips with the custom leather\nAnd I ball like a dawg Hood Rich forever\nSee I'm iced all up with that chrome metal\nFully equiped with the Coogi sweater\nBut it's the Birdman daddy, I run with the bird game\nBirds got to have it with my birdy change\nBut it's the big thangs on the big Range, stop and goes\n26's, 28's, it's the Birdman\n\n[Hook 3X]\n\n[Baby in the backround of Hook]\nOh yeah!\nOh yeah, you understand?\nBirdman baby\nOh yeah, you're becoming my kind of a bird\nYou understand nigga?\nFlip one, sell one, roll one baby\nWhatever nigga, however you gonna go we gunna roll it to you bitch\nI'm comin' to your hood boy, I'm flyin' too\n18's is better, never nigga, 24's, 28's, I'm singing nigga\nYou understand this biatch?\nGet rid of it little daddy\nYou understand?\nBirdman motherfucker!\nYou know, you gots to hate me nigga\nBird call bitch\nLet's get this money, holla at your boy nigga!\nThe Stunna, Cash Money number one nigga!\nYeah, that's how you lace me nigga!\nI'm lovin' it!\nHey Lil' Weezy, Papa doin' his thang nigga!\nLater boy, BMJ out!\nLet's get this money baby\nCMR nigga!"}], "artist": "Birdman"}