{"artist": "Angie Martinez", "songs": [{"title": "Every Little Girl", "image": "https://images.genius.com/640767a123d7da2b7b75c5a07ab025a4.355x352x1.jpg", "album": "Up Close and Personal", "lyrics": "[Big Pun]\nYo, yo, Angie, come downstairs\nThe pump is open\n\nHurry up, ma!\nPut your socks, put your slippers on!\nC'mon ma hurry!\n(Alright then, I got it)\n\n[The Product G&B]\nOooohhh Angie..\nOoo-whoaaaa, yeahhh..\nOooh yeah hooooo whoahhhh, ohhh-ye ohhhhh-yeah\n\n[Angie Martinez]\nUh, yeah (ooh ooh ooh ooh)\nUh (ooh ooh ooh ooh)\nUh-uh-uh uh-ah uh-ah-uh-ah\n\nI started in Brooklyn\nComing up in the game\nEverybody has a story\nMine wasn't the same\n\nAngela, delinquent\nI thought I was grown\nI went through a lot things way before I was known\nSee, my moms\nShe never knew I would make it all start\nShe was through with the bad grades\nThe late nights in the park\n\nCausing my mom pain\nMy life was in the dirt\nI played hooky all day while she was hard at work\nSorry, ma\nKnow it was hard and my pops was a jerk\nShe packed her shit and got us out of there before it got worse\n\nMoved the fam to Miami in hopes of changin my ways\nA big portion of my mind still remained in a daze\nIt wasn't 'til we came back my life matured\nSuccess would be the only thing that I was fightin for\nI was determined to get there, and keep it hot\nSince that day my only goal was to reach the top\n\n[Hook: The Product G&B]\nTo every little girl, on every block\nThat's comin of age tryin to reach the top\nI said no matter who you are, you can reach the stars\nBut never forget, how fragile you are, cause a girl is fragile\n\n[Angela Martinez]\nIt's crazy\nWhen I think back, sometimes I have to cry\nCause when you young, you don't see how life can pass you by\nYou don't even really care if you gon' starve or not\nThis go back to ninety-three when I got the job at Hot\n\nI used to answer the phones for Flex\nDo overnight spurts\nBack then, I was like, \"Hey who knows?  It might work\"\nI wasn't satisfied, but it would just begin\nCause in ninety-five\nI was every day, six to ten\n\nI put in a lot of work so I could bring in my listeners\nI secured a fanbase\nAlthough some of them dissed us\nI was new at my thang\nBut I was doin my thang\nAnd I would never let nobody try to ruin my thang\nBut of course, there were people couldn't stand where I was\n\nCause although know I'm in\nI wasn't made what I was\nThrough the heat, kept it moving\nThrow the haters a smile\nWhat would they do if they knew her heart was fragile?\n\n[Hook]\n\n[The Product G&B]\nAngela.. (uh-huh)\nAngela.. (hahahah)\nAngela.. (wooh!)\nAngela.. (uhh, uhh)\n\n[Angie Martinez]\nOverall, it's a rough business\nIt could stop even you\nThere's people that's gonna say things that's not even true\nLike the one about me not bein down for my women\nAnd I hated the lesbian rumors that went around for a minute\nHow bout the one that goes, 'Yeah, she goes with him\nHe bought her the car, the ice, the clothes and rims.'\nAnd I'm sure you all heard she caught one dead in the face\n\nIt'd been different if she said what she said to my face\nAs for men\nWho knows where my story will start\nI went through a relationship that nearly tore me apart\n\nSo I'm chillin for now\nIt's all about me for the moment\nCause there's things that I wouldn't allow\nBut I'mma be aight though, keep comin with tight flow\nTry to stay on the low while I'm watchin your hype grow\nPlayin the role like nobody can cramp your style\nBut I know, like you know, that you're fragile\n\n[Hook]\n\n{​*The Product G&B ad lib to the end*}​", "year": null}]}