{"artist": "Fat Joe", "songs": [{"year": "1998-09-01", "album": "Don Cartagena", "image": "https://images.genius.com/f5c1dde7c10db5efcf281667957c213d.953x953x1.jpg", "lyrics": "[Armageddon]\nYeah yeah\nDo you, Don Cartagena\nSolemnly swear to take this game of hip-hop\nAs your lawfully wedded wife\nThrough sickness and health, til death do you part?\n\n[Fat Joe]\nI do\n\n[Armageddon]\nAight then\nYou now may spit on the bride\n\n[Fat Joe]\nI bet you thought I left you hangin, Joe Crack returns bangin\nWith somethin brand spankin, what the fuck was y'all thinkin?\nBlow out your tweeters, have dinner with world leaders\nTerror Squad so much they be cats with dark caesars\nFast cars and millimeters, gold cards and Visa's\nGivin nonbelievers ways to fly with Jesus\nHere's my thesis, enterprise break the block to pieces\nHustler and hard pool shark like Jack Gleason\nThe only reason I came back was for the platinum\nWith raps, ten times more deadly than saccharin\nMC's be actin, I think somebody needs to slap em\nRun up on em attack em, and ask em what's his passion\nMy love is rockin shows at the highest extremity\nThis star from Trinity got your mom sayin she's feelin me\nWho's dealin ki's, that's peace, get your cheese, pack your G's\nPump this masterpiece at the loudest degree\n\nChorus: Fat Joe, Armageddon (repeat 2X)\n\nLet me find out (find out) niggas is noddin out\nTake some time out (time out) you wondered my whereabouts\nThe truth is I never left you, I kept my promise (what?)\nDon Cartagena blessed you, now pay homage\n\n[Fat Joe]\nYo fuck movin mountains, I move planets and you be Earthless\nTerror Squad the worst that hurt shit, split you to verses\nJoey Crack the world in half, Punisher punish em\nTil they lose the hopes and dreams they had\nThen Armageddon finish em\nYo I'm bout as braze as Satan, no exaggeratin\nMy crew is radiatin, shinin while you playa-hation\nCartagena hit em like the Red Army invasion\nOperatiion lace em show em what they facin, what?\nI've been down since the days of Flash\nWhen it was fun and laughs, before hip-hop was based on cash\nLet's blaze a sack and concentrate on coke inflation\nYou know the biggest asses in United Nations\nFuck the Federation, general population is hibernatin\nBut bear witness to information that'll rock this nation\nI'm not God, but indeed, my mind's relatin\nBetter act now, before your life is wasted\nCause time is racin\n\nChorus 2X\n\n[Armageddon]\nYeah, now do you hip-hop\nTake Don Cartagena, as your lawfully wedded husband\nNow by the power invested in me, by me\nI pronounce you husband and wife\n\n[Fat Joe]\nJoey Crack, a.k.a. Kaiser Soze\nHeads beware, there's mad fear in the air\nJoey Crack, a.k.a. Kaiser Soze\nKnuckleheads beware, knuckleheads beware\nJoey Crack, a.k.a. Kaiser Soze\nKnuckleheads beware, there's mad tension in the air", "title": "Find Out"}]}