{"artist": "Boosie Badazz", "songs": [{"album": "Bad Azz Mixtape Vol. 2", "title": "Confused (2007)", "year": null, "lyrics": "And lately, I, been so confused\nDropped outta school got a beef and got a tool\nNow I'm ready to chop ya crew\nBeen talkin to tha devil is whateva with lil bo\nYou ain't heard I was raised by some hard heads\nThey locked up or they all dead\nSpoon fed or dog fed\nWe untame, that's how I play it\nAnd everybody changin, trippin all a sudden\nAin't askin how I'm feelin they just askin me for money\nNow three years ago they talked about me\nCriticized me, and laughed at me\nCalled me local joker had lil boosie finna stop rappin\nI'm still so confused, got bread and still ain't happy\nCause I'm lost without these pictures, lil I and my f*ckin daddy\nGod tell me bout this ho right here, is this just a ho right here? will she keep it gutta if a nigga go and blow this year\nThat purp is what we smoke this year\nBlowin up I see it clear\nRap game on a nigga\nI'm finna show them bitch that boosie real\nThat hatin cause I shake back\nBrand new monte, take that\nReal spinnas on it, whatever they want\nI'm gon pay that\nI got it so I lay back\nJung-out style\nAnd I got a five westin connection\nAsk my nigga lil rob\nAnd I got diamonds on my pinky ring\nNiggas wanna stank me manye\nI flood the city with drank now they callin me the drank king\nI'm still tryna maintain, fore I catch me a case\nTryna make baton rouge look like cali and you still gon hate?\nAnd I don't lost alot of niggas, my trust f*cked up\nAnd I done did some dirty shit that's why my luck f*cked up\nIt ain't no purple in the city so I'm sippin that tus\nI mention like smoke out friday when he hit that dust\nMember of them zigzag big sacks them burberry dates\nWhen you snatched your first purse went hit the mall and got laid\nManye they got niggas in the grave so confused\nThey saw they death comin and they could'ntduck them tools\nAnd lately, I been gettin too motherf*ckin high\nI'm on my third blunt before the f*ckin sun rise\nFrom the cradle to the grave\nI'm gon always keep it gutta\nI should be number 1 on everybodys list, motherf*cka\nAnd lately, I, been so confused dropped outta school got a beef and got a tool (tool tool tool)", "image": "https://images.genius.com/bc2a8b48704b247169e8a655e7394834.500x500x1.jpg"}]}