{"songs": [{"title": "Don’t Worry Momma It’s Just Bleedin’", "image": "https://images.genius.com/639621ffcdb92dfd5ebdf7c9c9fb2995.500x500x1.jpg", "lyrics": "[C-Lim]\nCan't believe this nigga got me out here on some Scott Peterson shit. Where the body at, G-Macc?\n[G-Macc]\nHey, Lynch said it was dumped over here in the river on this side\n[C-Lim]\nThat right there?\n[G-Macc]\nYeah, that black bag. Get that shit, man\n[C-Lim]\nWhat, cuz? I ain`t getting that shit\nThat's some white people shit, it's dark\n[G-Macc]\nGo get that shit, cuz\n\n[Verse 1: Brotha Lynch Hung]\nNigga I'm the siccest in the west\nHit it in the chest\nIn a minute I rip a nigga like wet sex\nYour sentimental I get the Ritalin shoot TECs\nCut a nigga in half just like a duplex\nThen all I ask is “Who’s next?”\nTake a nigga and give a nigga a suplex\nCoathanga Strangla banging’ the deuce set\nChoke and strangle her, name it in two blex\nIt’s the Season Of Da Siccness times three\nSpitting the venomous IV full of white weed\nAnd my nine get a tight squeeze\nAnd I’mma die with my dick in a tight breezy\nBelieve me, I leave these - bodies they're probably gon' have my face on the TV\nI’m like Jason in 3D, who in the game want to see me?\nI’m at the motherfucking teepee\nPlotting and planning it while I’m wiping off the three\nFifty-seven I'm makin' 'em go to heaven\nOne through seven I make 'em go see the reverend\nIn a casket, niggas get they ass ripped\nRazor blades and dildos, nigga that’s it\nFuck around and get your hat split\nI’m on some 'Tall Cangee got my back' shit\nIt’ll get venomous sending niggas at me\nI keep a Russian AK in the back seat\nI get the guns from the back seat\nBrotha Lynch Hung he got the hacksaw ‘cause he loves to hack meat\nHeat it, and eat it, and leave it\nI'm even leaving 'em bleeding and feeding 'em\nAnd I’mma keep it that deep\nI stay hotter than the Sac' heat\nOne to the head then I smash like a track meet\n\n[Hook - Brotha Lynch Hung and (Krizz Kaliko)]\nDon’t get too comfortable\n(Don’t get too comfortable, you might not stay, might be leaving)\nDon’t worry momma it’s just bleeding\n(Things will be fine if you just give it some time)\nJust don’t get too comfortable\n(Don’t get too comfortable, you might not stay, might be leaving)\nDon’t worry momma it’s just bleeding\n(Things will be fine if you just give it some time and let go)\n\n[Verse 2: Krizz Kaliko]\nNow they got me on some supa’ dupa’ sick shit\nSo I’m a cut up and stab the beat\nLike a slab of meat with slick shit\nNow-now-now I’m with the sickness\nAnd now I’m bludgeoning niggas because it is so ridic'lous\nJuggernaut not random with the rambling\nI’m super cede six seven kill her with the sampling\nAnd chew them like beef tips ‘cause Kevin is a cannibal\nAdd me into the A team and I’m Hannibal\nMechanical robot, i will go hard and damage you with it\nRoll with killers and I got a few with it\nI got a musket and a pint of Muscatel\nWhen they find you they be like, \"What’s the smell?\"\nTake him took his top off, cause-it cause-it popped off\nAnd we off’d him and cost him he soft I'm a boss and I (hey)\nTook the coat hanger from Lynch\nAnd I become the strangler if you flinch, leave her bleed quick\n\n[Verse 3: Tech N9ne]\nGimme the chop and I be hoppin' ready to die let’s go\nReady to pop and I see dropping every in my retinal\nSend me the doctor who got the medical file death row\nFor the nurses who purposely hurt mamma with Trileptal\nWe told you motherfuckers that she was allergic\nHe heard her, slurred now pancreatitis emerges\nNow I got you running from curses and hearses\nCut you like a surgeon ‘cause you deserve it\nTwo reverends is pitiful thinkin' they can get with Mr. Formidable\nI pity your mental hospital, the hospitable\nI’m not finished your thoughts are squashed dinner\nFor harps your off limits and lost with chopped genitals\nI’m coming to get you with thunder though\nSeeing you suffer's gonna be wonderful\nSick inside of me give you lobotomies time to undergo\nFucking with the Nina...\n\n[Hook]\nDon’t get too comfortable\nDon’t get too comfortable, you might not stay, might be leaving\nDon’t worry momma it’s just bleeding\nThings will be fine if you just give it some time\nJust don’t get too comfortable\nDon’t get too comfortable, you might not stay, might be leaving\nDon’t worry momma it’s just bleeding\nThings will be fine if you just give it some time and let go\n\n[C-Lim]\nUgh, it’s-ugh, it’s starting to stink already, cuz\n[G-Macc]\nMan, this shit is getting everywhere… shit!\n[C-Lim]\nUgh, nigga, damn, ugh!\n[G-Macc]\nShut up, shut up, quit acting like that, nigga, shit!\n*Phone ringing*\n[C-Lim]\nHold on, my phone ringing, hold up\n[G-Macc]\nGo into the other room, cuz, I got to finish this shit\n*Phone ringing*\n… I got to finish this shit\n[Brotha Lynch Hung]\nHey Lim\n[C-Lim]\nHella loc\n[Brotha Lynch Hung]\nLim!\n[C-Lim]\nHella loc, who this? When-when-\n[Brotha Lynch Hung]\nThis is Lynch, nigga\n[G-Macc]\nDamn!\n[Brotha Lynch]\nHey, you get that?\n[C-Lim]\nMan… What number you calling me from, cuz?\n[Brotha Lync h Hung]\nNo-no, I’m calling from a throw away, man\n[BZO]\nEy, who’s that, cuz?\n[C-Lim]\nOh yeah, that’s right, cuz\n*Saw noises*\n[Brotha Lynch Hung]\nI just want to know if you got that\n[C-Lim]\nNigga, we got it, cuz\nUm, G-Macc in there cutting up the body right now\nGetting his blood everywhere, cuz\n[G-Macc]\nAw shit!\n[Brotha Lynch Hung]\nOh, for real?\n[C-Lim]\nNigga, you would love it, cuz\n[Brotha Lynch Hung]\nHaha, haha!\n[BZO]\nEy Lynch, where you at, cuz?\n[Brotha Lynch Hung]\nEy, ey, just make sure you got that rollin\nAnd holler at me, you know I need that\n[C-Lim]\nSome food?\n[Brotha Lynch Hung]\nYeah, make sure you save me some of that meat\n[C-Lim]\nGot you\n[G-Macc]\nShit!\n[Brotha Lynch Hung]\nAlright, I’ll be there in a minute\n[G-Macc]\nHey, get off the phone, cuz!\n[C-Lim]\nCuz, I’m here now, that’s Lynch, cuz\nDamn, what’d you do to the room, cuz?! Ugh!\n[G-Macc]\nEy, just ey-just help me grab this leg, cuz\n[C-Lim]\nNigga, I’m not touching that shit\n[G-Macc]\nEy, we need to put it back in the bag, nigga\n[C-Lim]\nCuz, you get-ugh!\n[G-Macc]\nEy, C'mon, cuz\nDon’t worry-\n[C-Lim]\nYou can put that on the floor right there!\n[G-Macc]\nEy, nigga\nYou know this the butcher, what’d you expect to find, nigga? C’mon\n[C-Lim]\nUgh! Nigga, get you-ugh!\n[G-Macc]\nGrab that shit, cuz\nGrab that shit\nC’mon, clean that up\n*Saw noises*\n[C-Lim]\nNow my chest all crushed up and everything", "year": "2010-03-23", "album": "Dinner and a Movie"}], "artist": "Brotha Lynch Hung"}