{"songs": [{"title": "​so cold", "album": null, "year": "2016-06-09", "image": "https://images.genius.com/407a0c7be02e5b5052b01ec30f2febae.500x500x1.jpg", "lyrics": "[Intro: Interviewer, Gucci Mane, & lil ricefield]\nCan you be born with sauce? Or do you-or do you acquire the sauce?\nNo, you can't be born with sauce\nY-You get, you get sauce, you get sauce from...?\nHow you gonna be born with seasoning? (Yeah!)\nYou gotta get seasoned, I wasn't born with all this sauce\nHell yeah! I had to acquire this sauce\n\n[Chorus]\nI gotta get to my dough\nI gotta flex in my clothes\nYung Nathaniel so cold\nI got [?] in my soul\nI gotta get to my dough\nI gotta flex in my clothes\nYung Nathaniel so cold\nYung Nathaniel so cold\n\n[Verse 1]\nMy wrist on froze, your whip so old\nMy wrist so cold, I gotta buy it a coat\nI'ma flex up with my bros, I'ma pull up in a boat\nYou can catch me in the snow, iced out, no [?]\nI got that ice on wrist, it ain't tickin', they thinkin' it's broken (Yeah!)\nI ain't got no time to be trippin' 'bout minutes, I'm thinkin' 'bout motion (Woah!)\nI'm with my clique and we rollin', doin' the most, she really from Oakland\nYeah, my whole kitchen is frozen, whippin' it, mixin' it, sippin' the potion\nBlastin' off, cashin' out, saucin' fools like it was basketball\nAnd you know I never pass it off, young Kobe got a flashin' shot\nSpanish girls, I got venti quattro\nTell that girl to hit my line, yeah\nAll gas, no prime, yeah\nYung Nathaniel got to shine, yeah\n\n[Chorus]\nI gotta get to my dough\nI gotta flex in my clothes\nYung Nathaniel so cold\nI got [?] in my soul\nI gotta get to my dough\nI gotta flex in my clothes\nYung Nathaniel so cold\nYung Nathaniel so cold\nI gotta get to my dough\nI gotta flex in my clothes\nYung Nathaniel so cold\nI got [?] in my soul\nI gotta get to my dough\nI gotta flex in my clothes\nYung Nathaniel so cold\nYung Nathaniel so cold\n\n[Verse 2]\nShorty said she loved me cause she seen I glowed up, aye\nI ain't tryna do that now my heart is colder, aye\nShinin' like a diamond, boy you lookin' so rough, aye\nYeah, I do origami, by my paper never fold up\nI gotta get to my dough, I gotta flex in my clothes\nI gotta glow up, I gotta glow up\nWhy you be doin' the most? You gotta go up\n\n[Outro]\nYeah!"}], "artist": "​lil ricefield"}