{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/7888fcd1d5cdca104d5ef74b255af6da.750x750x1.jpg", "year": "2017-10-27", "album": "Trial By Fire", "lyrics": "[Verse 1]\nDaddy is up five AM again, it's a repeated scene\nHe's been at since ten\nNine to five hours don`t pay enough money\nHe took a third-shift and he's just gettin' in\nBabies are hungry and mommy is bitchin'\n'Bout bills that he need to go pay while he sittin'\nNot even five minutes to drink a cold beer before hearing about what was left in the kitchen\nWalk out the door for a walk to the store, bread was five dollars he only had four\nWon't get a check til' the first of next week and he said to himself I can't take anymore\nWith no heat in the house and no gas in the truck, and his four-year-old's birthday about to come up\nIt's gun, mask, duct-tape, gloves, now\n\n[Hook]\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\n\n[Verse 2]\nShe's a single mother livin' in a hotel in the south side of the city\nAnd she works at a bar in the strip to get tips savin' up for a place that is pretty\nA twelve-year-old son to support, still in school with a father that's never around\nHe took her virginity, promised infinity\nThen he took off and he hasn't been found\nMost of the people she already knows\nHave trouble survivin' and keepin' a home\nThat side of town ain't the place to raise a child\nBut she's doing her best and there's no where to go\nPuts on a skirt, picks up her purse\nHe knows just what she does\nHis mama can't work at the bar every night\nSo his mama is hustlin' and sellin' drugs\n\n[Hook]\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\n\n(Woohoo, woohoo)\n(Woohoo, woohoo)\n\n[Outro Hook]\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\nWhat would you do for love?\nWhat would you do for love? (ooooo)\nWhat would you do for love?", "title": "Do for Love"}]}