{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Chinese New Year", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Hook: Pusha T]\nI'm at your door, your eyes are like, \"Why are you here?\"\nJudging by my steel I got something to do here\nGive up the money or the angel cries two tears\nFront of your crib sounding like Chinese New Year\n\n[Verse 1: Pusha T]\nMask on face, Glock in hand\nI was in and out of homes like the Orkin Man\nNever listen to my parents like an orphan man\nStrong finger on the trigger like it's in dwarf's hands\nConfiscate goodies like Repo Man Sam\nMake nigga kick that can\nFall victim to the Klick Klack Klan\nMy vixen eat ya face like she Ms. Pac-Man\nMy wish her command, ugh\nADT's ain't stop me, simple like ABC's\nSnip, cut, yank just as easy as 1-2-3, breaking and entry so elementary\nGet what the hustlers get for tryna do what the hustlers do\nGive up the cash 'fore I turn you Cookie Monster blue\nAnd your man and them for tryna be hustlers too\nErnie and Bert, I bet them bullet holes burning and hurt\n\n[Hook: Pusha T]\nI'm at your door, your eyes are like, \"Why are you here?\"\nJudging by my steel I got something to do here\nGive up the money or the angel cries two tears\nFront of your crib sounding like Chinese New Year\n\n[Verse 2: Malice]\nLet's play cops and robbers\nAnd watch Heckler & Koch turn cops to martyrs\nAs well as niggas with plots to rob us\nTry me, I'll turn this mothafucka into Shottas\nWith them 911's revvin'\nGunfire leave brethren remains like it's 9/11\nAnd get the sounds of rounds dispensing\nThat clack up make 'em back up like it's invisible fencing\nWhen I picture bits and pieces\nOf bone chip and flesh, it tears me to pieces\nCooperate, escape is useless\nTrust me I'm your friend, I will talk you through this\nTrick or treat niggas with hoods want the goods\nI feel like Robin Hood when I share it with my hoods\nDon't forget, he who plays hero gets hit\nDon't let the 9 mil riddle your wits, smarty pants\n\n[Hook: Pusha T]\nI'm at your door, your eyes are like, \"Why are you here?\"\nJudging by my steel I got something to do here\nGive up the money or the angel cries two tears\nFront of your crib sounding like Chinese New Year\n\n[Verse 3: Rosco P. Coldchain]\nSympathy? I feel none, when you hear that humming\nCommon sense'll tell you duck and get the fuck outta harm's way\nYour dying will absolutely make my day\nWhy he had to go look cool, but he wasn't so he got betrayed\nThis is what I did to him, nozzle with a Sig to him\nHurried out his crib, before that took everything\nPowder to pocket change, even the lint\nLeft the boy laying with his skin\nIf I didn't get you right you better hold your pistol tight\nWhen we meet in the afterlife\nColdchain, I'm the black one that bleed\nRosco P, young G, I don't speak I just squeeze\n97 P will make you drop to your knees\nBefore you know it you'll be floating to a better place, your soul feeling free\nI'm young, black, and I just don't give a fuck\nBig burner on my waist, drugs in the trunk\nSitting high in a truck, call me luck, come press me\n\n[Hook: Pusha T]\nI'm at your door, your eyes are like, \"Why are you here?\"\nJudging by my steel I got something to do here\nGive up the money or the angel cries two tears\nFront of your crib sounding like Chinese New Year"}], "artist": "Clipse"}