{"artist": "50 Cent", "songs": [{"album": "International Ballers (G-Unit Radio Part 2)", "image": "https://images.genius.com/24fe25226a3fad56d5754d3ecf936a21.500x500x1.jpg", "title": "It Is What It Is", "lyrics": "[Intro: 50 Cent]\nSom' for the hood, ya know, yeah\nNuttin' crazy, little som' som'\nYeah, 50 Cent, G-Unit Radio\n\n[Verse: 50 Cent]\nI sit and twist the lye just to get high\nNiggas is gon' die, why ask why?\nHomie, it is what it is, I handle my biz\nI put that on my kid, I don't forget I heard you\nBullet shell in ya wig, hollow tip from my sig\nLeave a hole in you bigger than BIG\nNigga you dead, I know where Nori live, you live by Nori crib\nYou talkin' all that shit, nigga you better move your kids\nSucka tell Tony, don't you fuck me you little monkey\nIrv, whatchu talkin' jackass, you fuckin' little donkey\nYou lied to Suge, then you lied to Prince\nYou got 'em thinkin' I won't pop niggas and elephants\nI spoke to Scarface, I spoke to Bun B\nThey gave me their blessings, they said: \"man get your money, man we ain't call you snitch, man we ain't mad you rich, man keep on makin' hits, and fuck that other shit\"\nCould it be that you mad? jealous a nigga holding?\nG-Unit Records, Radio, G-Unit clothing\nG-Unit films, G-Unit books\nG-Unit sneakers, I'm off the hook\n\n[Outro: 50 Cent]\nG-Unit man, G-Unit video games, G-Unit everything man\nWhen, every magazine stand you walk by you're gonna see me\nEvery time you turn on your TV, you're see me\nThe award show, you're gonna see me\nYou know, I'm gonna pick up everything they give to a new guy:\nBest New Artist, Best New Single, Best New Album, you know\nYou know what I mean, and you can just keep on making your little punk music\nLa-la-la-la, your McDonald's commericals\nMcDonald's apple pie, love the way you make me feel\nNumber two, super size, love the way you make me feel\nM.I.K., 50 Cent, Murda Inc Killa\nI heard about your show too, your show ain't nothin' but good karaoke chump\nYeah man, but if you wanna learn how to do that you should come check me out you know, The Rock the Mic Tour, 50 Cent, Jay Z\nThat's what everybody talkin' 'bout in the street, you know what I mean\nAshanti, what's the matter baby? You lookin' like you strugglin' out there baby\nThey ain't feelin' you no more? ha-ha-ha\nThey ain't feelin' you no more baby?\nAye, you should do another condom commercial, I put the condom on-", "year": "2003-06-12"}]}