{"songs": [{"lyrics": "[Opening dialogue]\nWhy you brothers insist on usin' the word nigga?\nDon't you know that's bringin' down the black race?\nNigga nigga nigga that's all I hear you motherfuckers talk about is nigga\nYou can do what you want, just keep it out of my neighborhood\nPersonally I think the lyrics are a bit too harsh\nI ain't no nigga, fuck that shit\nDoes everything come out your mouth got to be a 4-letter word?\nAll over this bullshit, it's just a bunch of fuckin' noise\nThe way you talk about women is bullshit, plain bullshit\nWhat you motherfuckers doin' for the black community anyway?\nMotherfucker I got kids, I don't want 'em listenin' to that bullshit\n{*hospital monitor starts beeping*}\nFuck the niggas!\nMotherfuckers need to stop\nHow can you call yourself a nigga and be proud of it?\n{*monitor stops beeping - R.I.P.*}\n[Orderly] Flatline\n[Dr. Dre] Bullshit!\n\n[Verse 1: MC Ren]\nWhy do I call myself a nigga you ask me?\nWell it's because motherfuckers wanna blast me\nAnd run me outta my neighborhood\nAnd label me as a dope dealer yo, and say that I'm no good\nBut I gave out jobs so niggas wouldn't have to go out\nGave em some dope and a corner so they could show out\nWhen the cops came, they gave a fake name\nBecause the life in the streets is just a head game\nSo therefore, to make more\nA 15-year-old black kid'll go and rob a liquor store\nAnd get shot in the process\nHe ate up a nine bullet and now he's put to rest\n\n[Verse 2: Dr. Dre]\nWhy do I call myself a nigga you ask me?\nI guess it's just the way shit has to be\nBack when I was young gettin' a job was murder\nFuck flippin' burgers, cause I deserve a\nNine-to-five I can be proud of, that I can speak loud of\nAnd to help a nigga get out of\nYo! The concrete playground\nBut most motherfuckers only want you to stay down\nBut I'm a smart motherfucker you see\nOne of the best producers in the rap music industry\nGettin' paid like a motherfucker\nA young brother, who don't give a fuck about another\nYeah\n\n[Verse 3: MC Ren]\nWhy do I call myself a nigga you ask me?\nBecause police always wanna harass me\nEvery time that I'm rollin\nThey swear up and down that the car was stolen\nMake me get face down in the street\nAnd throw the shit out my car on the concrete\nIn front of a residence\nA million white motherfuckers on my back like I shot the President\n\n[Verse 4: Dr. Dre]\nWhy do I call myself a nigga you ask me?\nBecause my mouth is so motherfuckin' nasty\nBitch this, bitch that, nigga this, nigga that\nIn the mean while my pockets are gettin' fat\nGettin' paid to say this shit here\nMakin' more in a week than a doctor makes in a year\nSo why not call myself a nigga?\nIt's better than pullin' the trigger and goin' up the river\nAnd then I get called a nigga anyway\nBroke as a motherfucker and locked away, so\nSo cut out all that bullshit\nYo! I guess I'll be a nigga for life\n\n(\"Niggas, crackers, jews!\"\n\"If there's hell below, we're all gonna go!\")\n\n[Verse 5: Eazy-E]\nNigga nigga nigga nigga nigga nigga, please\nI'm treated like a fuckin' disease\nYou say - why do I call myself a nigga so quick?\nCause I can reach in my drawers and pull out a bigger dick, yo\nNigga say nigga we cool but\nCracker say nigga, nigga knocked the fuck up\nBut I gotta be a fast nigga, to never be the last nigga\nOr I'll have to beat yo' ass, nigga\nIn the city you see action first\nThen hear about it later in a verse I curse\nBecause I'm real with this to keep my shit straight bumpin\nMurder, created by the streets of Compton\nNow get it from the underground poet\nI live it, I see it, and I write it because I know it\nAnd if you think I'm fuckin' your wife\nYou're motherfuckin' right yo, cause I'm a nigga for life\n\n[Bridge]\nI love niggas, I love niggas, I love niggas\nBecause niggas are me\nAnd I should only love that which is me\nI love that you niggas (\"niggas for life\")\n\n[Verse 6: Dr. Dre]\nNigga this, nigga that\nThe actual fact is that I'm black and bound to attract\nThe attention of another, I mean the other\nBut I'm a motherfucker that'll have 'em runnin' for cover\nYou see, I don't give a fuck about nothin'\nExcept gettin' paid, gettin' bitches, and issuin' stitches\nWhich is, all needed to read it and find a rhyme\nAnd then it's time to say, the nigga's here to stay\nBut what about the fake niggas, the house niggas\nTo get paid quick they gotta suck a fat dick\nBut N.W.A. is outta your motherfuckin' range\nWe ain't gonna change a motherfuckin' thang!\n\n[Verse 7: MC Ren]\nI call myself a nigga cause my skin won't lighten\nI call myself a nigga cause the shit that I'm writin\nHypes me, hypes other motherfuckers around me\nAnd that's the reason why they wanna surround me\nAnd ask me - why do I call myself a negro?\nAin't none of their fuckin' business cause I'll let the trigger go\nSo get out my presence and get out of my sight\nCause MC Ren is a nigga for life\n\n[Final dialogue]\nYou're a nigga 'til you die\nIf you're a po' nigga, you're a po' nigga\nIf you're a rich nigga, you're a rich nigga\nBut you never stop bein' a nigga\nAnd if you get to be educated you just an educated nigga\n(\"I can dig it!\")\n\n[N.W.A.]\nIt's plain to see, you can't change me\nCause I'mma be a nigga for life\n\n{*static noise*}\n\n[Eazy-E (singing a jingle)]\nI'm a nigga, he's a nigga, she's a nigga, we some niggas\nWouldn't you like to be a nigga too?", "album": "Efil4zaggin", "year": "1991-05-28", "title": "Niggaz 4 Life", "image": "https://images.genius.com/378262f83025b434fc5375a332bd1a1f.800x800x1.png"}], "artist": "N.W.A"}