{"songs": [{"title": "Let it rain", "album": "Polluted Wisdom", "year": "2003-01-01", "image": "https://images.genius.com/9x5cimzk33fo1f73tuuvwatzd.500x328x1.png", "lyrics": "[Intro: Prodigal Sunn (60 Second Assassin)]\nThe game was funny for ten (10) years god (9)\nRight now son (8), eating niggas plates (7)\nBiting the forks and all of that shit (6)\nBreaking that shit (5)\nEat to live (4), shit is real son (3)\nFA Rock (2) and we don't stop (1)\n(Zero)\n\n[Verse 1: Prodigal Sunn]\nYo, it's like the game stay changing like gats, heat banging\nI'mma keep flaming, while my clique stay reigning\nAnd we done came a long ways, no time for playing\nNo time for faking, respect what I'm saying and DJ's know I'm not paying\nI paid my dues, we slayed them crews\nThat slayed our jewels\nAnd now y'all want to take us for fools\nCash Rules as I want some sell they soul like shoes\nThe new improved Sun-Zini the Great\nY'all niggas cornflake\nDying for the love of money, bitches and fame\nSnitches and lames, now y'all want to scream my name\nShut the fuck up! y'all niggas get duct taped up\nScraped up, that's the ways of the game, your ate up\nFeel me?\n\n[Chorus: 60 Second Assassin]\n(Let it Rain)\nLook as FA Rock to the Far Rock, I got head from the Bed-stuy\n(Let it pour)\nFrom the third to the eye, 60 Sec news, no one else did it sweeter\n(Let it rain)\nAll the way from the desert to Medina, know what I mean?\n(Let it pour)\nAnd made ends meet, I came up hard in these streets\n\n[Verse 2: La the Darkman]\nSometimes I sit back and pray to Allah that I'll be a star\nThank you for my jewels and my house and my car\nAnd the fish that I eat, and the dimes that I meet\nAll my niggas that's locked down, please let them out the beast\nLet them see the street, have a fat pussy to beat\nWatch the Tyson fight, sitting in the thousand dollar seats\nThat's my culture, talk about guns I got the most-a\nMy heart's made of stone like a ancient Greek sculpture\nLA son, trapped in Babylon, think like a ex-con\nBuilt like a Yukon, deadly as a python\nChampion decathlon, terrifying amazon\nFrom Taiwan, militant as the Pentagon\nGet out\n\n[Chorus: 60 Second Assassin]\n(Let it Rain)\nWhen I say unto the wicked, thou shalt surely die\n(Let it pour)\nAnd thou givest him not warning, nor speakest to warn the wicked from his wicked way, to save his life\n(Let it rain)\nThe same wicked man shall die in his iniquity\n(Let it pour)\nBut his blood will I require at thine hand\n\n[Outro: 60 Second Assassin]\nAnd that servant, which knew his lord's will\nAnd prepared not himself, neither did according to his will\nShall be beaten with many stripes\nThe reason why it rains back on our planet\nIs because the water cannot get out of the earth's atmosphere\nBy its high speed of rotating around the sun Makes it impossible\nSee earthquakes is caused by the son of man\nBy experiment with high explosives\nIn fact, all that stuff is caused by the Wu, the S.O.M\nLa the Darkman, you know what I'm saying?\nSophisticated gyps, the black pimps of the biz"}], "artist": "La The Darkman"}