{"artist": "Antoinette", "songs": [{"title": "Lights Out, Party’s Over", "image": "https://images.genius.com/6048fbc409cf8026ef1821747507c396.400x400x1.jpg", "album": "Who’s the Boss?", "lyrics": "[ male announcer ]\nThis party ain't over\n\n[ Antoinette ]\nThat's what YOU think\n\n[ VERSE 1: Antoinette ]\nHot damn, you're the hoe, so yo, pull up your zipper\nThis ain't 'How Ya Like Me Now' or 'Jack the Ripper'\nYou swing, you swung low, and now you're sub-sub\n(Mh-mh) Yep, you f'ed up\nAntoinette's the Boss, get it straight and remember that\nI dis and don't miss, cause I ain't a friend of that\nScallywag, that Tom, Dick & Harry-hag\nDon't get upset, homegirl, just get mad\nYou're a lightweight, so it's easy to demo teeth\nA '10% Dis'? Here's a 100% beef\nSo get closer and try to figure how\nYou wasn't hype before, but you look like a [bleeped] now\nAnd that's factual, cause I got actual\nProof, troop, I got you floatin like Fruit Loops\nNo wonder you hang with M-i-l-k\nA brother that's a Gremlin and a rockhead deejay\nIt's a shame you didn't make no money\nAnd roll with Antoinette? Hah - ain't that funny\nAnd lucky you, here's a four leaf clover\nMeanwhile: Lyte's out, the party's over\n\n[ hook x2 ]\nLyte's out, now the party's over\nHomegirl reminds me of my dead dog Rover\n\n(The party's) (over)\n\n[ VERSE 2: Antoinette ]\nFly that fist, fly that fist, go 'head\nShe'll front and I'll fly that bitch's head\n(Oooooohhh...) Yo G. Off, back to the program\nWord to Hurb, they tried to dis this\nBut I'ma snow and drop a blizzard like Christmas\nJust one of my - ehm, season's greetings\n(To Lyte?) Yeah, to help the needy\nSo pitch and I'ma hit, you catch it\nA present from me to you, now wrap it\nIn bandage, cause I do damage\nAnd if I do say so myself, I do manage\nTo make a record dope, even when I'm dissin\nI move right, and now you're left missin\nIn action, or should I say actions\nCause my satisfaction's a fraction\nOf what I do when I'm hoggin it\nI hold you like a jail cell, and you're the dog in it\nI when I think, you're like my dead dog Rover\n(Yo yo, Lyte's out) Yeah, the party's over\n\n[ hook x2 ]\n\n[ VERSE 3: Antoinette ]\nI stretch my arm like elastic and finally reach the hoe\nAntoinette's dope, and now I'ma teach you, so\nAin't nobody chillin, your whole clan's wack\nAnd damn, you cram to understand that\nPicture me in flicks more than Dudley\nYou may be Lyte, but you ain't lovely\nI'm fed up, so I had to get rude\nNow who's puffin with a bloody attitude\n\n[ hook x2 ]\n\n[ VERSE 4: Antoinette ]\nNow let's start booin the Audio 2 and\nWhoever else is in your wick-wack crew'n\nI got the rhymes, you got the place, name it\nYou get the picture? Now frame it\nAnd you thought that you would hit with a dis\nHa-ha-ha-ha-ha... sucker, you missed\n\n[ male voice ]\nOh boy!\nHah!\nE-ex-excuse me, m'am\nYour new jam I like\nBut what about MC Lyte?\n[ Antoinette ]\nAh, she's with the pipe", "year": null}]}