{"songs": [{"year": "1997-12-09", "album": "Eye & I", "image": "https://images.genius.com/f1579141bc34038372c5f692cd18be20.636x636x1.jpg", "title": "King of the Hill", "lyrics": "[Intro: Kardinal Offishall]\nMurderer, yeah\nKardinal Offishall, yeah\nFOS crew, yeah\nThe Circle, yeah\nCapitol Hill, yeah yeah\nThis is how it go, on and on\nTo the like break of wha what!\nYeah yeah, check it out\n\n[Verse 1: Kardinal Offishall]\nSee me in MC reality spoken\nSome provoken the Kardinal to speak on sights unheard\nAs my word is bond, so is mental put into a picture\nTwist the vocal like a taste of lime, into the drink of life\nThe rythmn is my wife\nI impregnate her the apex to flex a new son\nEntitled a composition, taught him how to rock\nNow the sex don't stop, my wifey can't get enough\nOf the hardcore, make you want more type of stuff\nThat I bust all over her insides, sometime on the outside\nAdd a beat light to make sure the Immaculate Conception\nIs wicked from start to finish I kick it, mix it into the witch's brew\nAdd a backup vocal to the stew\nNow they be, surfing me at Play De Track, rocking soul and others\nDown to Sam Goodie what, peace to goodie goodie\nRubbing a piece of y'all talk and yo! That's all she wrote\nThat's all I said, as I take my wifey to the bed\nAnd rock\n\n[Chorus: Kardinal Offishall & Tara Chase]\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\n\n[Verse 2: Kardinal Offishall]\nWe gonna bring it to ya face like (ewww!)\nShout and mash up the jump 'till them sound like (ewww)\nKardinal wicked (what), wicked like a (ewww)\nEvery crew know, that's why the crowd like (ahhh)\nPicture your menace to your society, soul to your propriety\nLyricist of the year, and also the cause of you anxiety\nA little nigga chilling on my shoulder told me to rock ya like a boulder\nNow I'm back, big up my chest like Jully Black\nEx-poets, make a nigga see about he heard\nIf I didn't tell you so, there's no truth to the word\nWe sing, stop talking a man's business\nI bless the mic with freshness, the Dr. Kay-bee handles the rest\nShout out to the one-tree, niggas from the J-C, Rexdale to eastside\nTo the Eastside to meet up with Ill B\nMy nigga KC bring him to the uptown\nU to the P inside the E-W, scoop up gone for raps\nGive the dreads a couple of daps, bust a couple raps\nInside the place niggas know my face, girlies know the rest of the long physique\nCause when I rock, the session goes\n\n[Chorus: Kardinal Offishall & Tara Chase]\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\n\n[Verse 3: Tara Chase & Kardinal Offishall]\n{Capital Hill in this, with the one little Miss}\n{TC for your mind brain, yo check it, yo}\nPrepare for your departure from these stolen planes\nRays emitting from the vocals liquefied your brain\n{What's your name yo?}\nMiss Tara Chase if you're nasty\nPulling Capital Queen of the Hill if you ask me\nYou can't fuck this Mickey, Mallory combination\nSurround the world with our sound like global domination\n{How you feel?}\nDistortion to static is how you look\nRe-arrange your whole physical anatomy shook\nFor all them niggas we got what you need\nKardinal Offishall, Tara Chases\nCapitol Hill, get upon the mic and do what you will\nThe Circle y'all, check it out\n\n[Chorus: Kardinal Offishall & Tara Chase]\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!\nOn and on and on and on\nWe gonna keep it on to like the break of wha!"}], "artist": "Kardinal Offishall"}