{"songs": [{"image": "https://images.rapgenius.com/2c6746ae7acfe3205140bd0a613aa502.599x304x1.png", "lyrics": "[Intro]\nIf only you guys knew what just happened in here\nYeah, yeah, yeah, yeah\nCan you turn the beat up a little bit, yeah\nTurn my headphones up\nYeah, yeah, yeah\n\n[Verse 1]\nWell who is he? I be ze meanest, putting Jesus pieces on a fetus\nThe Lord taketh, then he keepeth one of many masterpieces\nI'm rolling up the weed and feasting on gravidas\nYour bitch a junkie, always sucking on somebody's penis\nOoh, I'm eating General Tso's chicken off the fine china\nI put my dick inside your bitch and say the \"Our Father\"\nYoung Moses part water\nHead wraps car bomber\nDeath trap dark slider\nJump on motherfucker, got ya, once I dropped ya\nWho's hot? I moonwalk the jungle gym\nDo not try to stop cause you not gon' fuck with him\nI'm rumbling with countrymen, do it for the USA\nFirst you get the money, then the fame, then you get paid\nAle boombaye, come with superhuman strength\nAll this for the music's sake, but I'm getting stupid paid\nGet ahead or lose a leg\nNever did the funeral fake\nTo be great you await\nEverybody let's eat cake\nD-dumbass\n\n[Interlude]\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't stop\n\n[Verse 2]\nI'm sipping liquor 'til my liver pop\nAnd playing tennis with cinder blocks, I'm in the spot\nChilling with some nympho THOTs, landed on the Planet Rock\nMan of God, hammerhead shark in human camoflauge\nDuck down I'm on, understand the planet's strong\nLead singer came with Keith Richards, brought the band along\nI'm pretty Zen lady, headspin is 1080\nThey say that I went crazy but love me when the check cleared\nRed beard, seen into the future, fear the end near\nBitch I want it all, I will not give you not a cent here\nThis is not pretend, I'm trying to pay some pricy rent here\nIt's no words, selling Goldberg and you gon' get speared\nDo the most, I'm the host and the special guest here\nIt's a fucking party started, everybody get weird\nTake your pants off, move your body, you can dance around\nI got you shitting in your pants, you wearing Pampers now\nMean flow, hitting free throws, shoot 'em granny style\nCame a long way from rocking hand-me-downs, fr-fr-fresh\nI said the world is just a big gazebo, so baby let's get married in it\n\n[Interlude]\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't stop\n\n[Verse 3]\nMorning Mr. McCormick, Mr. Should've-Been-Aborted\nMr. Mighty-Morphin'-Sperm, the Michael Jordan's Nike fortune\nMoney make me feel important like some type of vital organ\nRich people give poor advice, never could afford it\nWalk into the jewelry store\nSpend all my money, fuck did I do this for?\nPussy on my mustache\nNever clean it up cause I'm a dumbass\n\n[Outro]", "year": "2015-09-25", "album": null, "title": "BigBoyTV Freestyle"}], "artist": "Mac Miller"}