{"songs": [{"image": "https://images.genius.com/fe7d5810fa51b8e81d7eeb21c834aab1.499x500x1.jpg", "title": "Hoe Blow", "album": "I Need Drugs", "year": "2000-11-07", "lyrics": "[Intro]\nDoo doo sluts, uhh\nThe sex-pert.. check it\n\n[Verse 1]\nI'm pullin' off your blouse\nStart tongue kissin' you and then I cough in your mouth\nWalk in your house\nAnd slaughtered the mound of your daughter or spouse\nHave them snortin' an ounce\n'Til they are walkin' on the floor on all fours like a hound\nWalk in the fuckin' ladies room and penetrate her womb\nWhile the hookers sprays her perfume, demonstrate a broom\nYou hoes will choke, when you float my boat\nMy cum will coat your throat like the milk from a goat\nPut my notorious dick in between your glorious tits\nWanna know a Secret? I'm suckin' Victoria's clit\nMy tongue got you on some state of euphoria shit\nFuck you with my warriors fist, this whore bitch\nAnd screamin' like a horror flick\nWhen I put my dick where the bitch's manure sits\nI slide through like shit\nAnd all you fuckin' wenches that love to French kiss\nYou love the drenchin' stench of men's piss\nYou find it adventurous\nTakin' like ten dicks right inside your appendix\nWhip out my Jimi Hendrix\nIt's my press kit, dead sick\nFuckin' a chick with an asbestos covered breadstick\nThe sleaze..\nI'll grab the ass of the neighborhood skeeze\nAnd give a good squeeze\nHoldin' your head, with both of my hands, as you suck\nI could snap your fuckin' neck if you say you ain't down to fuck\n\n[Chorus]\nYour cunt looks so good and my dick is ready - Hoe Blow!\nI splatter my scum on your face I'll be squirtin' steady - Hoe Blow!\nYour cunt looks so good and my dick is ready - Hoe Blow!\nI splatter my scum on your face I'll be squirtin' steady - Hoe Blow!\n\n[Verse 2]\nI'm havin' crazy adventures with a fuckin' dirty pair of wenches\nWalkin' in trenches, naked with sick intentions\nI'll pimp your fanny in a pair of skimpy panties\nDon't give a fuck if you got a cunt, or you're a stinky trannie\nI'm dead blunt - I need a drippin' wet cunt\nYou easy flirt - I look right underneath your skirt\nSquirt a drink on you sluts, so you relieve your shirt\nNow I can see your pert tits that'll be dessert\nFinger your slit, feel my knuckles hit your clit\nI bit your tit, swallow my cock, now spit on my dick\nI'm in control when I'm in your hole\nHooker, you better get fucked by me now before your skin is old\nPlus your ass gets crooked too\nSo lay down on the fuckin' floor so I can get a better look at you\nObey the master, hoe, finger your rancid asshole\nWith that plastic pole - do as you're told!\n\n[Chorus]\nYour cunt looks so good and my dick is ready - Hoe Blow!\nI splatter my scum on your face I'll be squirtin' steady - Hoe Blow!\nYour cunt looks so good and my dick is ready - Hoe Blow!\nI splatter my scum on your face I'll be squirtin' steady - Hoe Blow!\n\n[Outro]\nJust a little sample.. of what's to cum.. in your mouth!\nPSYCHO + LOGICAL - RECORDS\nShout out to Mr. Hyde, The Mad Choppers\nStared(?) City, Brooklyn\nFlatbush, Canarsie\nNon-Phixion, New Jersey cats\nMissin Linx, Queens cats\nBronx cats, Staten and Manhattan\nThe fuckin world - JEFF ROSS!!!"}], "artist": "Necro"}