{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/4ea47fac7a81d0fa0d6dd8ad668a2299.1000x1000x1.jpg", "year": "2015-04-21", "album": "Love Story", "lyrics": "[Verse 1]\nDaddy I've been thinkin' about you lately\nMama's never here and step daddy hates me\nHe drinks a lot, it makes him so mean\nMama always screams and it gives me bad dreams\nToday I dropped my bowl of s'ghetti on the floor\nI didn't mean to make a mess, I tripped on one of my toys\nI tried to clean it up, really I tried\nBut I just made it worse so I went to my room to hide\nI knew if Benny saw it I'd be in so much trouble\nI didn't want to, but I did\nAnd the thought of gettin' hit scared me so I didn't tell him\nBenny saw it, he took off his belt and\nYou know... he hit me with it\nThen he pushed my face in to the carpet where the s'ghetti spilted\nBut I forgive him though\nI love you daddy, I guess I gotta go\n\n[Hook]\nThere's a moth on my window seal\nAnd it came to die alone\nThrough the pain of the pouring rain\nI gaze into the storm\nAnd I imagine I'm the son of a man\nWho will hold me close and near\nWith these bruises on my face I cry\nWhile I pray to disappear\n\n[Verse 2]\nDaddy are you there?\nI know you're probably busy off working somewhere\nHelpin' somebody, build a house or somethin' neat\nYou told me what you did, carpentry, right?\nMan, that's so cool, daddy\nI really miss you, so much that I would kiss you\nYeah even front of my friends\nI guess you know I'm gettin' sick again\nI've been throwin' up, I haven't been playin' much\nI missed a lot of school this week, but I'm tough\nI'll make it, you know me, daddy\nI don't get what I want most of the time but I'm patient\nHey if you get a second\nMaybe tomorrow you could come by just to check in\nBecause my babysitter's crazy\nMama don't believe me but she makes me get naked\nAnd I'm embarrassed so I hide it\nI'm tellin' you because you know my heart and what's inside it\nI gotta go to sleep but don't turn off the lights\nI love you daddy, or should I say Christ?\nI gotta go to sleep but don't turn off the lights\nI love you daddy, or should I say Christ?\n\n[Hook]\nThere's a moth on my window seal\nAnd it came to die alone\nThrough the pain of the pouring rain\nI gaze into the storm\nAnd I imagine I'm the son of a man\nWho will hold me close and near\nWith these bruises on my face I cry\nWhile I pray to disappear\n\n[Outro]\nWhen the weeping willow tree sways from the breeze\nI float away\nTo the end of the world, to the moon, to the stars\nTo the heavens where I'm safe\nI’m a child, not a prey. I’m an angel, enslaved\nI'm a life, I'm a world, I'm a rose, put to waste\nWake me up, let me live, let me breathe, let me breathe\nGive me love, give me soul, give me guidance, give me peace\nDisappear", "title": "Disappear"}]}