{"artist": "PARTYNEXTDOOR", "songs": [{"album": "COLOURS 2", "title": "Low Battery", "image": "https://images.genius.com/25ee12c9f4216b43e9dc6e3f0f6d037a.600x600x1.jpg", "lyrics": "[Chorus]\nMy battery's low, but I hope my messages come through\n'Cause I need answers from you\nI need answers from you\nI got questions for you\nSo why don't you got answers for me? (Oh na na na, oh na na na, oh yeah)\nHave you ever lied?\nIt's a dumb question, baby girl, 'cause everybody lies\nBut did you lie with someone else, baby?\nWhat you tryna do? Are you tryna hurt my ego?\n\n[Verse 1]\nLook you know it's actually on a hunnid\nBut babe, right now it's on a zero\nI'm not gon' ask you was it worth it\n'Cause I know I'm not perfect\nWe are young and you're still searching, and uncertain\nMy heart's been broken before\nThis a feeling I already know\n\n[Pre-Chorus]\nI just want the truth, it's just between me and you\nThey don't even know, they don't even have a clue\nConfess, confess, girl, need to know facts\nConfess and text me back, don't hold back\n\n[Chorus]\nMy battery's low, but I hope my messages come through\n'Cause I need answers from you\nI, I need answers from you\nI got questions for you (ooh)\nSo why don't you got answers for me? (ooh)\nHave you ever lied? (Have you ever lied?)\nIt's a dumb question, baby girl, 'cause everybody lies\nBut did you lie with someone else, baby? (Yeah, yeah, yeah)\nWhat you tryna do? Are you tryna hurt my ego? (What you tryna do? Ego)\n\n[Verse 2]\nListen, you coulda said you want to see different people\nNever knew that your love was so lethal\nShot, shot, shot, it's a shot, baby\nKept your secrets on the D-low\nLow-key like a C-note\nOh, oh, no need for the long-talking, girl\nI just want the truth\nFace it, reality, there's no getting back with you\n\n[Pre-Chorus]\nGive me the truth, it's just between me and you\nThey don't even know, they don't even have a clue\nCo-confess, confess, girl, need to know facts\nConfess and text me back, don't hold back, oh, woah\n\n[Chorus]\n'Cause my battery's low, but I hope my messages come through\n'Cause I need answers from you (I need answers from you)\nI, I need answers from you (I need answers from you)\nI got questions for you (I got questions for you)\nSo why don't you got answers for me?\nHave you ever lied?\nIt's a dumb question, baby girl, 'cause everybody lies\nBut did you lie with someone else? Oh, woah\n\n[Outro]\nSomeone else\nYou must have wanted someone else\nMy battery's on low and I hope my messages go through", "year": "2017-06-02"}]}