{"songs": [{"album": "Avatar 2", "year": "2019-03-08", "title": "Chase It", "image": "https://images.genius.com/e3b47a0708f10b0b2eeb5266904ccdb2.1000x1000x1.jpg", "lyrics": "[Verse 1: Joseph Kay]\nI never fuck her like a sucker nigga\nLong strokes in that pussy, I broke them other nigga\nTwo sets of them lips, bet I kiss 'em both\nHit her with the gasp break so she don’t choke\nRight hands up like a drumroll, roll\nKill that pussy like I'm finna purge\nLivewire Records, that's the safeword\nFifty shades of Joseph Kay, I fuck her all day\nGet her ass on naked with that twelve-play\nShe told me she loved me and looked me in my eyes\nThen I fall deeper in that cream pie\nThen I fall deeper in that cream pie\nFifty shades of Joseph Kay, I fuck her all day\nGet her ass on naked with that twelve-play\nShe told me she loved me and looked me in my eyes\nThen I fall deeper in that cream pie\n\n[Chorus: J. Stalin]\nDon’t make me chase that pearl\nThat pussy changed my world\nI wanna fuck you, girl\nI wanna fuck you, baby girl\nDon't make me chase that pearl\nThat pussy changed my world\nI wanna fuck you, girl\nI wanna fuck you, baby girl\n\n[Verse 2: Joseph Kay]\nCooking in the kitchen with nothing on but an apron\nWasn't the kind of pussy, I ain't racist\nI drink the pineapple juice and she tell me how the nut taste\nLet it roll down her head, call her nut face\nShe like to take her clothes off in a dark place\nI eat that pussy, smile big like a shark face\nI give her this dick like every day her birthday\nShe be runnin' from me like it's that sports Tuesday\nHit me while the water bubble up in the jacuzzi\nEvery time we fuck, it's FPS, girl, I can't move in\nNo groupies on the low, what I be ridin’ for\nThat other nigga hella pussy plus he hella boring\nFuck the fantasy and fuck her in the rain storm\nStill rollin’, man, them pills had me hella gone\nCan you please answer your telephone?\nTonight I don't wanna be alone\n\n[Chorus: J. Stalin]\nDon’t make me chase that pearl\nThat pussy changed my world\nI wanna fuck you, girl\nI wanna fuck you, baby girl\nDon't make me chase that pearl\nThat pussy changed my world\nI wanna fuck you, girl\nI wanna fuck you, baby girl\n\n[Verse 3]\nSex in the morning, two bitches at my door\nRan through two boxes of condoms, I was fuckin' them both\nGot some head then got back to whippin' up my coke\nBut they wouldn’t leave me alone, they just wanted some more\nSo I bent that ass over, fucked her right on the stove\nBad bitches I just met at the Coconut Grove\nBroke the jar in the sink, I just lost me an O\nSquare bitches never met a nigga who sell dope\nThey told me they'd replace it, please don't trip\nSat me down on the couch and started suckin' my dick\nOne lickin' my dick, one suckin' my balls\nIt all jumped off from a phone call\nI was high as fuck, lonely as shit\nI ain't even think you was gon' bring the bitch\nNow it's two bad bitches layin' on my floor\nWhile I'm rollin' up dope in my bathrobe\n\n[Chorus: J. Stalin]\nDon't make me chase that pearl\nThat pussy changed my world\nI wanna fuck you, girl\nI wanna fuck you, baby girl\nDon't make me chase that pearl\nThat pussy changed my world\nI wanna fuck you, girl\nI wanna fuck you, baby girl"}], "artist": "J. Stalin"}