{"songs": [{"image": "https://images.genius.com/8084a0e879564a0ce1f5efd48c7dedec.1000x1000x1.jpg", "album": "uknowhatimsayin¿", "title": "Dirty Laundry", "lyrics": "[Verse 1]\nThe Hybrid, I'm telling you, try again\nSleep with the beast, Daniel in the lion's den\nStill drop dirty, have to pop a Niacin\nItched all damn day, just to get violated\nEver seen a roach with babies have babies?\nIn the hood like whatever, we in this bitch together\nOnce got a ho, ain't had money for the room\nSo we did the humpty hump in a Burger King bathroom\nLowkey kept it undercover\nThe way she slurp slurp, she's the quicker picker upper\nNo job, dropped out and a felon\nOn the net, met a fat white bitch named Helen\n300 pounds, maybe more like 280\nHad a couple babies, 270 give or take it\nCall that securin' the bag, had to fight the baby dad\nTry to stop how I eat so I got up on his ass\n\n[Verse 2]\nWhat's in the dark, always come to light\nHead was nasty, you'd think she had head lice\nWhy try? Throw bleach in your eye\nPut your life on the line, hang 'em out to dry\nTryna keep my hands clean, out here ridin' dirty\nShit get messy? Mop him up with the .30\nHigh Tide, Gain off the Arm and Hammer\nSwim towards the current, system try to drown me\nStain your record like Clorox 'n' darks\nSpin cycle had four tops for one\nOut the slums, nobody gave me nothin'\nHad temptations, so I hustled, David Ruffin\nPapa was a rolling stone, so I sold rocks to 'em\nBeam up Scotty, we got lift-off Houston\nLeft my sack in my clothes, Mama just did a load\nEight ball in my jeans, fiends say it taste like soap\n\n[Verse 3]\nTwenty five a peep show when I enter the booth\nMop the floor when I leave, might slip if you do\nCover your ears of your kids, we got round two\nFuck a bitch two times, call it deja vu\nFuck a stripper for some change, actual change\nDime, penny, nickels, actual change\nOkay, wanna hear the story? Left the house in a hurry\nI was at Hunky Dory's, got some dances from Lori\nLeft my wallet at home, ain't wanna hear that story\nIn the car had change from laundry\nHad to wash clothes anyway, told her, \"I'm sorry\"\nSlow anyway, before you was boring\nSaid, \"Gimme a moment\", jumped on it and bounced\nNo fabric softener, 'cause I was hard\nThen she gave me head, had me moaning and groaning\nGuess who I seen doing laundry next morning?", "year": "2019-08-31"}], "artist": "Danny Brown"}