{"songs": [{"image": "https://images.genius.com/ab5b52d21c860b1bfb34d2fc4eaf65ae.640x640x1.jpg", "title": "​ruiner", "album": "ruiner", "year": "2018-02-16", "lyrics": "[Verse 1]\nYo, yo\nIt's the young Edgar Allan spitting live from the basement\nDo it for the love, give a fuck about the payment\nIf I'm being honest, I don't know what I'm chasing\nNeed a space to place my thoughts and the song's the location\nI'm fucking sick of writing all these sad songs\nBut I'm just being real, it's how I feel, word is bond\nI just wanna let you know you're not alone\nThat I know what it's like when you never leave your home\nWhen you can't get out of bed, can't even check your phone\nCan't even lift your head, like your bones are made of stone\nWhen everyone you know is asking why you're feeling low\nBut you can't tell 'em why, 'cause you don't even know\n\n[Bridge]\nI got radio execs tryna say what's best\nI got pressure coming down, got me overly stressed\nI got suicidal thoughts floating through my head\nI got people from the past probably hoping I'm dead\n\n[Chorus]\nOh no, what's your mama gonna say\nWhen I tell her that I broke your heart?\nIt's just things aren't the way that they used to be\nOh no, now you're crying on the bathroom floor\nAnd I guess it's the end\nWell, I lost my mind, then I lost my best friend\n\n[Verse 2]\nYeah, so what if I did and what if I didn't?\nI just wish I wasn't stuck between decisions\nI just wish I didn't feel like something's missing\nI just need to get outside this mental prison\n3 AM and I'm stuck in a rut\nSeems like every time I leave I end up thinking of us\nI keep fucking with your head like a lobotomy\nI lost it all and you'll always be a part of me\n\n[Bridge]\nAnd can you feel the pain when you wake up?\nLate again and it's dark out\nI don't even know where it came from\nCan't escape, got me feeling down\nI remember days in the hometown\nThings change when you come around\nNow they're just memories now\nKeep feeling up, then I'm feeling down\n\n[Chorus]\nOh no, what's your mama gonna say\nWhen I tell her that I broke your heart?\nIt's just things aren't the way that they used to be\nOh no, now you're crying on the bathroom floor\nAnd I guess it's the end\nWell, I lost my mind, then I lost my best friend"}], "artist": "​nothing,nowhere."}