{"songs": [{"year": "2018-03-16", "image": "https://images.genius.com/06f9aef305cebb7633a8be3540c4f61e.268x268x1.jpg", "title": "Driftin’", "album": "ELEVATORS: ACT I & II", "lyrics": "[Skit]\nWelcome, sir. How are you this evening?\nI'm cool. You?\nVery well, sir, thank you. May I see your ID?\nSure, sure. Here you go\nAh, Bishop. They've spoken highly of you\nFloor 77, first door on the right\nAppreciate it\n\n[Verse 1]\nI'm an emperor and you'll surely witness\nI'm from Kether but I been in malkuth doing business\nMoving vicious cause I see the cycle getting repetitious\nAnd plenty of motherfuckers dead sleeping with the fishes\nIt's really getting ridiculous, most folks are envious\nOr they either scared and then fear like insidious\nTimes been ugly but now they just hideous\nEverybody's a killer and they trying to hide theyself from us\nI'm just being me, never switching for the bucks\nI'm in y'all's plan so I'm something no man can touch\nI been going ham like I'm playing in the clutch\nGot the Kyrie step back when actors acting up\nBeen this way since a pup, you can't even get a suck\nFuck a sub, if you acting different then you getting snubbed\nAnd I ain't even let 'em come back like the Cubs\nThat's a dub, I'ma fly like a dove so what's up\n\n[Hook]\nLost in my mind and I'm driftin'\nLost in my mind seeing different\nI've been lost in my mind and I'm driftin'\nI've been lost in my mind seeing different\n\n[Verse 2]\nIf you ain't showing love then you only showing hate\nAnd I already get enough\nWanting cream, need it double stuffed\nThat alone with the knowledge got my conscience rising up\nThe frequency way higher than when I was out of luck\nSo fuck it, if they ain't riding I'ma leave 'em stuck\nCause most of 'em like Biden, Joe's tryna get a buck\nI'm a pro so they duck and say I'm loco\nMeanwhile rappers say the same thing like Coco\nSo I gotta snap like necks in bad choke holds\nI don't see a threat, I don't stress over Bozo's\nI bounce back the best and that's no pogo\nI did it all solo with the mind of a mogul\nThey tried to throw a low blow, no\nI got my guard higher like I got God higher\nStarters getting  brighter\nHanging in like a fighter, I gotta be liver\nShow a bob and weave and end it with good nighters\n\n[Hook]\nLost in my mind and I'm driftin'\nLost in my mind seeing different\nI've been lost in my mind and I'm driftin'\nI've been lost in my mind seeing different"}], "artist": "Bishop Nehru"}