{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f1ce17fdad92806e2e9b19241838f42f.1000x1000x1.jpg", "title": "Untitled", "year": "2012-03-16", "album": "R.A.P. Music", "lyrics": "[Verse 1: Killer Mike]\nYou are witnessing elegance in the form of a black elephant\nSmoking white rhino on terraces\nWill I die slain like my king by a terrorist?\nWill my woman be Coretta, take my name and cherish it?\nOr will she Jackie O, drop the Kennedy, remarry it?\nMy sister say it's necessary on some Cleopatra shit\nMy grandmama said nope, never, that it's sacrilege\nTend to agree because the thought is so disparaging\nThe Lord give a load, you got to carry it like Mary did\nThat's why I'm giving honor to all these baby mommas\nIt takes a woman's womb to make a Christ or Dalai Lama\nThe world might take that child, turn that child into a monster\nThe Lord'll take a monster and fashion him a saint\nI present you Malcolm X for those who saying that He can't\nSaying that He won't, when I know He will\nYou usually don't know it's you until you getting killed\nFor real\n\n[Hook: Scar]\nDear Lord, have mercy\nOn the ones that go through life like it's a game\nDear Lord\nI won't be forced to shut up when I don't feel the same\nCause people gonna lie\nSome people gonna steal\nYou gotta be careful not to shit where you live\nThem people might try to have you killed\nLord have mercy, life is such a battlefield\nFor real\n\n[Verse 2: Killer Mike]\nI ain't never gave a fuck\nI never did and never will\nLive my life on principle\nKeep it true, keep it real\nBetter said, I keep it trill\nAnd no matter who don't like it, homie\nThat's just how it is\nNaked truth like the stripper that's in front of me\nAnd I keep a blunt and a Bible and a gun on me\nWhy? Cause I'm country-bred\nActually, I'm south-er-ern\nSomething like my brethren\nThe legendary Andre 3K, Cee Lo, Goodie, and some other men\nYou should pay some homage, it's an honor this\nThis is not a fiction that is sold by conglomerates\nThis is Soul of Black Folks mixed with Donald Goines shit\nBetter said, Robert Beck, esoteric I could get\nThis is John Gotti painting pictures like Dali\nThis is Basquiat with a passion like Pac\nIn a body like Biggie, telling stories like Ricky\nIf a rapper was to spar, please tell him better kick it\nYou with me?\n\n[Hook: Scar]\nDear Lord, have mercy\nOn the ones that go through life like it's a game\nDear Lord\nI won't be forced to shut up when I don't feel the same\nCause people gonna lie\nSome people gonna steal\nYou gotta be careful not to shit where you live\nThem people might try to have you killed\nLord have mercy, life is such a battlefield\nFor real\n\n[Instrumental Interlude]\n\n[Outro: Killer Mike]\nI don't trust the church or the government: Democrat, Republican\nPope or a bishop or them other men\nAnd I believe God has sustained me with rap\nSo I pick a burning bush, put it in a Swisher wrap\nAnd they can't kill a G, I seen how I die\nI'm only going once, a coward dies a thousand times\nUntil that chariot come and take a nigga home\nI'mma spit this ghetto gospel over all these gutter songs\nI'm gone"}]}