{"artist": "50 Cent", "songs": [{"album": "50 Cent is the Future", "image": "https://images.genius.com/6bc22518471304f1684549742212664c.945x945x1.jpg", "title": "Cutmaster C Shit", "lyrics": "[Intro]\nNew York City (New York City), you are now rackin' with 50 Cent (with 50 Cent)\nAre you ready? (are you ready?) (*gun cocks*) I said are you ready? (are you ready?)\nSee you with me nigga? (with me nigga) Drop that! (drop that)\nPaid for a hooptie but I wanted a drop\n\n[Verse 1]\nG-UNIT! Somethin' new, somethin' new\nI'm not that nigga, in your video\nI'm not a trick, I don't love the hoes\nAnd niggas know I be, on the low\nBut I miss my dough, and I twist my dro\nI'm not that nigga, that you think you know\nI walk around with a big four four\nYou front on me, I'm gonna get at you dog\nI be right at your crib, waitin' at your door\n(What up bitches)\n\n[Verse 2]\nComin' up I ain't had much, I wanted a lot\nI had paper for a hooptie, but I wanted a drop\nSo you know, I had to make somethin' out of nothin' (Yeah)\nLike turn an empty spot, into a crack spot pumpin' (woo)\nHustle hard at 19, I bought a Benz I did\nThe older niggas really wasn't feelin' the kid\nTried to find out where I lived, so they could run in my crib\nBut you can't hustle a hustler, I peeped it and slid\nBack then niggas yousta call me boo\nIn 6 months, I sold a million gold tops on got brew\nCountry came around, ease it and clappin' then\nCountry left, strange shit started happenin'\nLike C shot Ra for some ends, Ra shot Dro for some chins\nCory shot Drew, and we was friends\nMoney turns boys into men\nThe cycle never changes, shit just starts again\n\n[Verse 3]\nNah nigga, ain't nothin' change nigga\nYeah I've been gone for a minute, but I'm back\nDamn 50 good to see you back in the hood\nYou see my cherry red SL, nigga I'm doin' good\nSometime I can't find the words to say how I feel\nSo I take a quote from Menace, \"look at the wheels\"\nI'm addicted to stuntin', now that I'm holdin' somethin'\nI got a trunk full of guns, from VA today\n(oh yeah, let me hold somethin')\nNigga you high or somethin'\nI don't play games, I'm about my money, nigga buy somethin'\nI got a few fifths, I got a few nines\nHere nigga, take one, catch it took, and bring me mine\n\n[Outro - 50 Cent talking]\nYeah, don't ever say I don't do nothin' for you nigga\nYou know, uh, don't say I don't look out for ya\nYa know what I mean, but make sure you nigga, you go catch some jokes\nAnd you come back, nigga have 'em, and have my paper for that thang thang\nYou know what I'm sayin'? Say I don't want it back, nigga don't try to use it\nAnd don't get it back for me, nigga and no shit like that\nIn fact, I can see ya'll niggas now\nRun around sayin', 50 gettin' all this rap money, and he won't help us (haha)\nSit tight nigga I'm comin'\nYou know, new shit, all this shit I put out on the mixtapes\nIs for the mixtapes, I got a million, OH MY GOD!\nMy shit is so hot right now, I'm in a zone", "year": null}]}