{"artist": "Inspectah Deck", "songs": [{"title": "Vendetta", "lyrics": "[Intro: Inspectah Deck]\nYeah, back from the dead\nIt's the Rebel, I Soldier, I told ya\nI shall return, yeah\n\n[Inspectah Deck]\nYa'll done fucked up, lettin' me live, something's got to give\nI'm positive, you're gonna all pay homage\nBelieve me, I ain't lyin' down that easy\nAnd that thought applies for those who proud to see me\nThrough the distraction, I was wounded in action\nAn act of betrayal, but I knew the assassin\nNow I pack a vengeance like Steven Seagal\nI'm back from the trenches to even the odds and...\n\n[Hook 2X: Inspectah Deck]\nYou hear the rockets red glare? The bombs burstin' in air?\nGave proof through the night, that I stood through the fight\nYeah, the Rebel's still here, what?\n\n[Inspectah Deck]\nYa'll better rock ya'll hoodies\nAnd hold your girl tight, before we pop that pussy\nIt be so real, I don't need no deal\nMy mass appeal make a marvel out how he so ill\nYa'll time is up, try your luck, ya'll wind up\nFucked up, before you even recognize I struck\nRoll with the live dozen, got all eyes buzzin'\nWith strong rhymes cousin, been a long time comin'\nBreak your weak links, in the chain, fuck your mink, and your reign\nSon is lame, plus he thinks it's a game\nBut, we about to apply the heat (the heat)\nAnd snatch him up out the driver's seat\nI put my life on it, post up like who want it\nBlast off with the force to send ya'll in orbit\nWild like whitey's in the mosh pit, yeah we gon' start shit\nPack 'em down, then corner the market\n\n[Hook 2X: Inspectah Deck]\nTo all my real M.C.'s, the ones without a deal M.C.'s\nThe ones who kick the real life music\nLet's link, them niggas can't move no more units\n\n[Inspectah Deck]\nFor life I'll be underground, their first thought\nWas yo, \"How did he survive with no commercial support?\"\nDamn right, I miss the corporate politics and tricks\nWhere the SoundScan is rigged and contracts are fixed\nI sit in the pit where the grime exist\nLegendary, they still lovin' my rhymes from 9-6\nNow I'm back, that's my word as I reveal this shit\nBy choice or by force, ya'll gonna feel this shit, ya hear?\n\n[Hook 2X: Inspectah Deck]\nYo, this is all out war, I'm callin' on all outlaws\nSon, they new to the art, ain't true to the heart\nWho's down for the cause, huh?", "image": "https://images.genius.com/c3d252f814a4716a7a99fe1984ad2678.948x936x1.jpg", "album": "The Movement", "year": null}]}