{"songs": [{"album": "The Misunderstanding of Teyana Taylor ", "image": "https://images.genius.com/eb3aaf7fcbe1e5d15cb8b0148635a4cf.355x355x1.jpg", "year": "2012-03-12", "title": "DUI", "lyrics": "[Intro: Fabolous]\nNice\nDUI shit\nNice\n\n[Verse 1: Fabolous]\nDo you know why I stopped you?\nWith your fine ass, I was in the cut, you came flying past\nWish the way we met would have been different, yo\nBut you was doing 55 in a 54, so\nSo pull over, that ass is too fat\nI'd Rodney King that till your ass is blue-black\nYou you and I, I\nWe a team, high five\nLong time no me, who you been doing?\nI get overexcited under your influence\nHead in the whip won't blink the eye\nLet you swallow, but you really shouldn't drink and drive\nGot your body swerving, I'm trying to slow down cause the body curves in\nMaking me wanna bring it like bottle service\nThat 'whoop-whoop' got you nervous\nC'mon, T\n\n[Verse 2: Teyana Taylor]\nYou might think I'm crazy, but I'm serious\nI think it's best that you know now\nThat when I'm with you, boy, I get this feeling\nAnd I don't wanna slow down\nIt's so unusual, the doctor can't prescribe it 'cause I'm loving, oh\nIt's you\nSomething beautiful, strapped up behind the wheel, the way you lose control, for you\n\n[Chorus: Teyana Taylor]\nYou make me wanna ride, I crash into your love, you got me high, oh baby\nAnother DUI, your touch is like a drug you got me high\nIntoxicated, I got another DUI, a DUI, a DUI, whoa\nAnother DUI, a DUI, a DUI\n\n[Verse 3: Teyana Taylor]\nEvery time you pick me up to ride around\nMy mind goes into danger zone\nOnly meant to kiss my lips and I don't wanna stop\nMy body says go, go\nWhat's gotten into me? It's like I grabbed a whole bottle of fantasy\nAnd took it to the head, you got me dizzy\nTell my ex boyfriend I DO'd\nTonight we wanna [?]\nWon't let me go, oh no\n\n[Chorus: Teyana Taylor & Jadakiss]\nYou make me wanna ride, I crash into your love, you got me high, oh baby\nAnother DUI, your touch is like a drug you got me high\nIntoxicated, I got another DUI, a DUI, a DUI, whoa\nAnother DUI, a DUI, a DUI\nYeah, I like this, uh, yeah, yo\n\n[Verse 4: Jadakiss]\nYeah, strap up, put your belts on\nAnd you know it's alright, but it felt wrong\nMatter of fact, it felt good and it felt warm\nLike hot wax on your body when it melts on\nI see you into him, what you been doing, huh?\nDriving under the influence, like a special vibe that you trying to send to him\nBut you purposely tryna crash into him\nThat's what love is, that's what the bug is\nThat's what the benefits of messing with a thug is\nYeah, even know we above this, I just hope you got full coverage\n\n[Chorus: Teyana Taylor]\nYou make me wanna ride, I crash into your love, you got me high, oh baby\nAnother DUI, your touch is like a drug you got me high\nIntoxicated, I got another DUI, a DUI, a DUI, whoa\nYou make me wanna ride, I crash into your love, you got me high, oh baby\nAnother DUI, your touch is like a drug you got me high\nIntoxicated, I got another DUI, a DUI, a DUI, whoa\n\n[Outro: Teyana Taylor & Fabolous & Jadakiss]\nD-D, U-U, I-I-I\nD-D, U-U, I-I-I\nD-D, U-U, I-I-I"}], "artist": "Teyana Taylor"}