{"artist": "Angie Martinez", "songs": [{"title": "Go!! (Muthafuka)", "image": "https://images.genius.com/640767a123d7da2b7b75c5a07ab025a4.355x352x1.jpg", "album": "Up Close and Personal", "lyrics": "Angie: What's this?\n(unfolding of letter)\nAngie & Guy: Dear Angie\nGuy: I know we've been together a long time boo\nBut I'm writing this letter cus\nI really couldn't face you like\nIt's kinda ill\nI gotta a lot things going on right now\nAnd I met somebody too\nSo I need a little space ma for real\n\n[Hook]\nThis mothafucka told me that he'd love me for life\nHe told me he had my back and I would be his fucking wife\nHe told me no matter what baby everythings gon be ok\nAnd now this mothafucka's leaving and he don't think he gon pay\n\n[Verse 1]\nThink a letta like this gon kill me dude?\nShit you was lucky I was real wit you\nShit you was lucky I was feeling you\nLet me tell you what a bitch that's real will do\nI remember all the things that we did in my house\nShould of never left shit in my house\nGet your clothes and your boots and suits nigga get em up out\nYou would never know what I'm about\nWhen I'm in doubt I walk away like it's the in thing\nFollow all my instincts\nThe henessey in ya blood got ya strong like ginseing\nWho the hell you think ya pimpin?\nNot me you can go\nI don't care what you leaving me for\nIf you stay you'll be deceiving me more\nLet me see what you do when you can't get your feet on the floor\nYou didn't think that I would even the score\nThrough the heat of it all\nI was there for you\nCared for you\nBut you never gave the love back\nI don't care if you a thug cat\nAin't no mothafucka ever gon treat me like a rugrat\nIt's niggas like you that make a bitch wanna wil' out\nPut a brick through you windshield\nI don't care how your fam or your fake ass friends feel\nSince day one I've always been real\nBut you took it for granted damnit\nYou got me actin foul\nThink you a playa international?\nGot your bank card know your pin number so I'm cashin now\nOn some funny shit look who's laughing now\nI'ma sell all the jewelry you left behind\nMe being deaf, dumb, and blind\nInstead of being two steps ahead I was a step behind\nThought you never gonna wreck my mind\n\n[Hook x2]\n\n[Background Hook]\nI don't care though\nYou can go now\nPack your shit up\nI don't need you\n\n[Verse 2]\nYou messed with my mind was the worse thing you ever did\nI ain't the one for the wedding ring\nYour doing this for your benefit\nYou degenerate\nStab me in the back like a Benidect\nBut I blame myself for being blind for the scrub type\nShould've knew from the getgo\nBut it's cool I can live I can learn get wise to my life\nIt ain't hard for me to let go\nI'm a strong ass woman\nAin't no way I'm gonna be depressed\nLet a nigga try to wear me down\nNow the rain is gone I can see clearly now\nWhere my mentals at you should fear me now\nLook really how\nDid you think I wouldn't pay ya back\nYour a bitch for the way you act\nYou want to be in the front while I played the back\nAnd you think that I'm gonna be ok wit that?\nThat's crazy wack\nYou ain't never wanna help the team\nDid things that I felt were mean\nBut I let it all go\nNever paid it no mind\nEven though you tried to fuck with my self-esteem\nWhen you dealt with me you had things that you never had\nNiggas knew I was your better half\nNow you got a new bitch\nPray to God hope she know about me\nAnd if not I'm gonna tell her ass\nStella had to get her groove back\nNigga move back\nWho me I'm just moving on\nMary J. said the best when said that I'm not gon cry\nMothafucka thought you'd knew the song\nBut I'mma leave it alone\nCus I'm a bigga bitch\nEven though another chick'll prolly try to get you fast\nHe should've died\nKeep this in mind\nMothafucka wish I never would've met your ass\n\n[Hook until fades out x4]", "year": null}]}