{"artist": "Cam’ron", "songs": [{"title": "Come And Talk To Me", "album": "Ghetto Heaven Vol. 1", "year": null, "image": "https://images.genius.com/01b2584dd85d0bcfad6cde9603330f8b.500x500x1.jpg", "lyrics": "[Intro]\nKnow me I ran down on shorty real quick\nBut guess what she asked me, yo\nWord?\n\n[Verse 1]\nShe said Jay made you a millionaire and looked me in the eyes\nSaid cake, cake, cake got that from the pies\nWe made each other millions, that was my reply\nBut had a mill before I met him, baby, that ain't no lie\nSee he named some Harlem cats and the homie from the Chi\nBut my thing, he ain't name nobody from the Stuy\nAnd I do it like Bed-Stuy, do or die\nBut lets talk about something else, you and I\nShe said cool, played the cool from far\nMy friends wanna ride if you cool with it, pa\nIt's all good we played pool at the bar\nBut I usually don't carpool, there's pools in the car, muah\nShe impressed by the lemon coupe\nLife threw me lemon, I made lemon juice\nHuh, from that I made lemonade\nI kept the workers, sergeants and lieutenants paid\nYou messing with a nigga with mob ties\nPlug me in girl, download my hard drive\nIn the bedroom might get hog tied\nDog fucked, aw shucks, welcome to our lives\n\n[Interlude]\nThis what I told her though...\n\n[Chorus]\nCome and talk to me\nI really wanna meet you\nCan I talk to you?\nI really wanna know you\nCome and talk to me\nI really wanna meet you\nCan I talk to you?\nI really wanna know you\n\n[Verse 2]\nYo, she was intrigued by my repertoire\nHeard I had niggas on water like the reservoir\nPacks of crack, 9 mill in my dresser drawer\nHeard I sold keys but made more off metaphors\nTold her, her homework's efficient\nDon't forget girl I get a lil' ig'nant (true)\nAnd I Diddy bop like I tore a ligament\nMy whole persona, understand that you diggin' it\nI know my life seems exquisite (true)\nKnow where I'm from, girl, you wanna take a visit?\nWe can spin up off my pivot, I don't talk it cause I live it\nAnd the money in my pocket 'nough to stack up to a midget, girl...\n\n[Chorus]\nCome and talk to me\nI really wanna meet you\nCan I talk to you?\nI really wanna know you\nCome and talk to me\nI really wanna meet you\nCan I talk to you?\nI really wanna know you"}]}