{"songs": [{"album": "Para Tu", "year": "2013-10-21", "title": "Gustav’s Revenge Pt. 1", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Intro: J.I.D]\nCome to my garden, it's for you\nEuphoria, next level\nUni—[static] and [static]\nYou can start what you finish\nTemptation is simply what you make it\nIndulge, please\nI want you to indulge\nEvery thump (everyone's a star)\nWill run from your head (every day's the move)\nTo your toes (everywhere we are)\nClose your eyes (you, yeah)\nGet away (everyone's a star)\nIt's for you (every day's the move)\nOnly you (everywhere we are)\nAnd there's the one thing you cannot forget\n\n[Verse]\nI'm just trying to come from under the thumb of this regime\nAll plans I got a scheme, consulted among kings\nSpread my wings, I bleed\nI'ma tell you like a nigga told me\nI'ma tell you like a nigga told me\nCash rules everything around foolies\nSo these niggas walkin' around with the uzis\nStrapped up, no camera, finisher the movie\nYour life is a movie, get it? you stupid\nBrother blind, colorblind, you're Doug Flutie\nMy girl is a nubian princess, convinced she was sent here for me\nSent here to be, anyways I'ma rip this and eat any pussy MC\nSay you are what you eat, ain't no pussy in me\nTell a nigga bye bye 'cause you pussies N-Sync\nDon't squint nor blink, better talk 'fore you think\nNo, think 'fore you talk or the plank you can walk\nLike a pirate, Spillville violence\nMushrooms molly, y'all niggas wildin'\nGrown man fuck boy, y'all niggas childish\nMy dick is the bomb like Arabian Saudi\nYeah yeah shawty, you cannot afford it\nLet me get back to my blunt and my forty\nPara Tu shawty, what it do shawty?\nThis bitch choosin', who shawty? (who shawty?)\nI gotta do what I gotta do and I gotta move how a nigga gotta move, too cool (too cool)\nGot bitches like buku, got money like buku, red sip like soowoo\nYour flow boo-boo, my shit too\nI'm too cool man, shit, ahh, Para Tu\n\n[Outro]\nEveryone's a star\nEvery day's the move\nEverywhere we are\nFor you, yeah\nEveryone's a star\nEvery day's the move\nEverywhere we are\nFor you"}], "artist": "JID"}