{"songs": [{"title": "Got Paper", "album": "Rebel", "year": null, "image": "https://images.genius.com/203d6f5e6f6426f878ba3ff2a016c5e6.1000x1000x1.jpg", "lyrics": "[Verse 1]\nThese brothas passin' me and they all rollin' fly coups\nThey throw some D's on but they still ain't got the truth\nThey blow they cheese on it then they die and what's the use\nI'm so secure in Jesus all I want in life is fruit\nI don't need no fast money NOPE don't need a fast car\nYeah the faith is a race but i't ain't a nascar\nHomie you and God got beef\nCause you keep chasin' money like them hundreds got feet\nBuddy wanna be rich but even 50 done said\nThat he still feel hungry even tho he got bread\nMake em throw away they life got em runnin' from feds\nLove of money's like crack both of em will leave you dead\nWhen you die and face God ain't nothing left to be said\nInstead of chasing the truth you take a lie to the head\nAnd homie all I can do tell you is what Jesus said\nRepent and turn from your sin cause the kingdom of God's at hand\n\n[Chorus]\nGot money, got paper\nSo what who cares?\nGot money, got paper\nI got Jesus baby!\n\n[Verse 2]\nPeople they want cheese American mozzarella\nThe enemies rat trap might snap any second\nI'm like that dude in Matthew who after finding a treasure\nGave all he had to get it that's a real go getta\nPeople dying over wood grain, chrome, and some leather\nThey got expensive tastes but the faith tastes better\nI know the ice wet but the living water wetter\nBut don't believe me read the 13 letters\nOr you can Torah the gospel and all the prophets\nBut homie I promise you'll never profit chasing profit\nNow look at 1 Timothy 6 it's so clear\nYou chase the money and wind up in a snare\nNow a vow of poverty no it's not there\nBut you pursue God the rest he takes care\nYou don't step on his back in order to get rich\nIf you do then you're in sin and ordered to repent\nYou come to Christ for God You come to Daddy for worship\nHe ain't take that Cross to fund your vanity purchase\nEven though we all agree that death is certain\nIt seems we believe there's banks beyond earth (That's crazy)\n\n[Chorus]\nGot money, got paper\nSo what who cares?\nGot money, got paper\nI got Jesus baby!\n\n[Verse 3]\nMoney dough cash paper\nIf it was a woman I promise I used to date her\nNow that we broke up she be callin' ya boy a hater\nCause all I do is use her for glorifying my maker\nMy treasures in heaven Christ is my satisfaction\nIf I was broke I'd be richer than folk who never had em\nGod is the Gospel not a new Bentley\nWas empty and he gave us life and that's plenty\nGet me...homie I could spend six centuries\nSimply saying I'm satisfied in the sensei\nAnd it's sickening, that knowing God ain't enough\nWe gotta tell em they can get rich quickly\nNow this is heresy, false it's not true\n2nd Corinthians chapter 8 and verse 2\nRead that and please believe that\nForget c-note man they pockets was E-flat\nThey still had joy\n\n[Chorus]\nGot money, got paper\nSo what who cares?\nGot money, got paper\nI got Jesus baby!"}], "artist": "Lecrae"}