{"songs": [{"image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg", "title": "Can Anybody Hear Me", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Intro]\nIf you move, I'll fall\n(Davaughn on the beat)\nI'm leanin on you, you baby, you baby\n\n[Verse]\nI push, p-p-push it, I p-p-push it like I'm in labor\nAnd he'll t-t-teach me to, teach me to love my neighbor\nJust w-w-wait up, I'm processin' all the data\nProcessin' all the data, p-p-processin' all the haters\nYou was writin' disses, I was takin' pictures\nSignin' autographs for all of my bad bitches\nAnd in the nick of time it just dawned on me\nI am Nicki Minaj and it's all on me\nBut hey, maybe I'll never win, maybe I'm settlin'\nCan't let the devil in, I'm a comic book heroine\nBut when the wind blows, I'm so Marilyn\n(I'm so Marilyn, Marilyn, Marilyn)\nYo, write it down, take a pictures, bitches, e-mail that\nI came to save a thing called female rap\nBut I hope my ninja powers\nDon't fuck around and offend you cowards\nYou mad at me cause you think I got it easy\nIf we was in the second grade, then you would tease me\nYa see, you still a lil snotty-nose hood rat\n\"I love Nicki\" scribbled all over you book bag\nI love you too\nI just wish your mother would've hugged you too\nYou know Nicki love the kids\nYellow brick road, lookin' for the Wiz\nBut when it rains, it pours for real\nDef Jam said I'm no Lauryn Hill\nCan't rap and sing on the same CD\nThe public won't get it, they got A.D.D\nSee Nicki, follow the rules\nGo and say your prayers and get ready for school\n(Yeah, follow the rules)\n(Let me say my prayers and get ready for school)\nDear God, I am only what you made me\nAnd I appreciate everything that you gave me\nBut like, I don't wanna do it no more\nSort of lost sight of what I'm doin' it for\nThought that I was doin' somethin' good for the game\nUntil they all started throwin' dirt on my name\nTell Debbie, I really, really tried\nThat I said I'm sorry, but I had to say goodbye\nTell Fendi, I'll never forget him\nAnd please tell Wayne I'll always be indebted\n(I'll never forget it)\n(Please tell Wayne I'll always be indebted)\n\n[Outro]\nAy! Can anybody hear me?\nAy! Can anybody hear me?\nAy! Can anybody hear me?\nAy! Can anybody hear me?"}], "artist": "Nicki Minaj"}