{"songs": [{"lyrics": "[Verse 1]\nI finally found love and it's fucking beautiful\nI no longer bite my nails down to the cuticles (No more)\nMy sex stories ain't suitable for listeners\nCause prisoners to wack off, aw man (Yo, chill, chill, chill, chill)\nEnough of that soft shit, me by myself is like the four horsemen\nYou're just a poor sportsman, your sports car could be your coffin\nThe thought of revenge release endorphins\nThat make me feel just like I'm swimming with some dolphins (God damn)\nRing, ring for this I gotta call 'em baby, shit, I might retire\nSpend the rest of my days down in New Orleans maybe\nMoney changed me for the better\nSo I brought it back and got the all black Jetta\nWith the header and the leather bra\nThinking back like \"Shit, dog, you really set the bar\"\nHigh as fuck 'bout to twist another\nToo many people gone, damn, we miss our brothers\nWhat the fuck is going on? A strange sense, ah\nSomething's going wrong, I can feel it in my fingers, man, shit\nA strong scent lingers\nSomething's going wrong, I can feel it in my fingers\nLike arthritis when it's raining, uh\n\n[Bridge]\nLet it rain on me\nLet it rain\nUh, it's me\nOn me\n\n[Verse 2]\nIt only took me nine times to make a debut, tenth time's a charm, shit (True)\nNow man’s on road, that means I'm hard\nCharge whatever on the Visa card, half moon Caesar parts\nA lot of motherfuckers blind, they couldn't see the art\nWar stories, throw 'em through a stack of tables\nWrap my body in a stack of Bibles ‘cause shit could get dangerous\nBam Bam splash off the turn buckle (Splash)\nNow you no longer have to use your nerves or muscles\nWe'll see who loves me if I need a liver, shit\nYou feel defenseless in the presence of a stripper (Shit)\nYou cannot be trusted with the access to the money\nI crash more Benzes than when they practice with the dummies\nI make these bastards look funny, Bugs Bunny, pussy\nI make these bastards look funny, Bugs Bunny (Bugs Bunny)\nUh, yeah, these motherfuckers must be crazy, ‘cause I ain't going nowhere\nUntil I'm called up to the stars, then I'll go there\nUntil then, I'm back here to live another life\nBut for now I'm asking ladies like \"What's up tonight?\"\nBaby, what's up tonight?\nYeah, what's up tonight?\n\n[Outro]\nI got the True Religion jean suit\nG-Unit sneaker shit\nAh", "title": "Prince Charming", "album": "White Bronco", "image": "https://images.genius.com/ac4a689fba4e0dd9edc54358061eb06a.1000x1000x1.jpg", "year": "2018-10-19"}], "artist": "Action Bronson"}