{"songs": [{"year": "2018-07-20", "image": "https://images.genius.com/cc562c0aa5b047df2132b1557d8efb9a.464x464x1.jpg", "title": "Rest in Power", "album": null, "lyrics": "[Intro: Dispatcher + George Zimmerman]\nSanford Police Department\nThere's a real suspicious guy, he's up to no good\n\n[Chorus: Black Thought]\nRest in power, rest in paradise\nIf I could change matters, I would spare a life\n'Cause lives matter, there's clearly nothing as dear as life\nYou have become a symbol in the spirit life\nRest in power, rest in paradise\nIf I could change matters, I would spare a life\n'Cause lives matter, there's clearly nothing as dear as life\nYou have become a symbol in the spirit life\n\n[Interlude 1]\nThey say that, uh, time heals all wounds. It does not\n\n[Verse 1: Black Thought]\nIn America, one tradition that lasts\nIs black blood woven into the fibers o' the flag\nNot addressing the problems of the past\nTo nowhere fast, but following the path\nSo called \"leaders\" on hire for the Klan\nStill rapin' and settin' fire to the land\nWell that's the climate, how can I become a man\nIf survival is a triumph and we got the underhand? Listen:\nOne killer, one child, one weapon\nThe shooter was unthreatened, seventy-one seconds\nSo many unanswered questions, I see reflections of myself\nI feel like in fatherhood we are connected\nToo long before the shooter was arrested\nSo wrong, worldwide, we've been affected\nTo them it's real, sins of the father remembered still\nFor every Trayvon Martin, there was an Emmett Till\n\n[Interlude 2]\nYou killed my son\n\n[Verse 2: Black Thought]\nHow many more kids will we wait for them to kill?\nMy tears collectin' like raindrops on the windowsill\nIf the wounds heal, the memories never fade\nI wonder if you're in heaven's eleventh grade\nSix thousand two hundred and thirty days\nToo young of an early age, such evil and worldly ways\nThe thing in which we believe, the way in which we behave\nThe way in which we've evolved, the monster that we became, listen:\n\n[Chorus: Black Thought]\nRest in power, rest in paradise\nTo all the babies too young to have had to pay the price\n'Cause lives matter, there's clearly nothing as dear as life\nYou have become a symbol in the spirit life\nRest in power, rest in paradise\nKnow as long as you still got somebody here to fight\nYour lives matter, there's clearly nothing as dear as life\nYou have become a symbol in the spirit life"}], "artist": "Black Thought"}