{"artist": "Immortal Technique", "songs": [{"title": "Watch Out (Freestyle)(Third World Remix)", "lyrics": "The corporation that controls the third world in the next century, controls the globe. Think of it: One world economy, one corporation under God, one moral, spiritual, economic unity!\n[Immortal Technique speaking]\nYou know, back in the day, some of y'all must of shout out Allah's name like He was hosting your mixtape. Then after 9/11, you got scared and shut the fuck up. Didn't talk about the demonization of a culture, immigrants, nothing. Now you show up, talking about we, \"Taking it too far.\"\n\nDIE SLOW....MOTHERFUCKER!!!\n\nIntro 2x:\nWatch out who you fuckin' with, watch out who you fucking with\nWatch out - nigga - watch out who you fucking with\n[Immortal Technique]\nYeah....\n100 percent independent\nI'm the fucking boss\nI sold 80,000 off a quotable in the Source\nThe hood is not stupid\nWe know the mathematics\nI make double what I would going gold on Atlantic\nCause EMI, Sony, BMG, Interscope\nWould never sign a rapper with the White House in the scope\nThey push pop music like a religion\nAnorexic celebrity driven financial fantasy fiction\nContradiction cause the life we was given resembles life in prison\nSpent time with Manuel Noriega\nThe real Noriega\nWho did America a hundred favors\nWith contras, the Shah, and the CIA\nMoving Escobar's Coke through the MIA\nThis is the 3rd world speaking through a dead man walking\nAnd everybody talking about the South taking over\nIt's true mother fucker\nBut it's coming over the border!\nFuck your chain\nMy people'll kill you for water\nFuck fans nigga\nI got soldiers supporters\nThat'll cut your throat if you strapped with a tape recorder\nThat's right mother fucker\nWelcome to the New World Order\nWhere the truth is always censored by corporate reporters\nThe government runs the drug politics on the corner\nThat's why I never stress rappers and their employers\nI put a bag over his fucking head and torture your lawyer\nCause it's too simple to shoot you\nI'll taser the roof of your mouth\nAnd electrocute ya\nI'll root you out with the Ruger\nThe German Lugar\nU-Boat\nAnd the troops and the scuba\nNigga\nYou can't overthrow me like the island of Cuba!\nNiggas will never find your body like the bitch in Aruba\nAnd I'll maneuver through the state department and their friends\nWith secret deals like the Nazi's and IBM\nAnd now you know this ain't a trend or a fashion\nThis is my life and my Passion\nFUCK TRYING TO CASH IN\nNIGGA!\nI need more than advancements and a rented mansion\nSo while you little house niggas are singing and dancing\nI'll KILL you and take your land like an Israeli expansion!\n\nHook 2x:\nWatch out who you fucking with, watch out who you fucking with\nWatch out - nigga - watch out who you fucking with\n\nImmortal Technique! South Harlem! DJ GI Joe!", "image": "https://s3.amazonaws.com/rapgenius/1-immortal_technique-20101005.Jpg", "album": null, "year": "2008-01-01"}]}