{"songs": [{"album": "Vintage Curses", "image": "https://images.genius.com/578d3254e53548c2137f0fe0adf43217.1000x1000x1.jpg", "year": "2015-08-01", "title": "Old School Gospel", "lyrics": "[Intro]\nLook at that person next to ya and say\nNeighbor, when I’m about to lose my mind\nGive me 30 seconds to show you what I do\nThis is a warning, this is a warning\nThis is a warning, you stupid motherfucker!\nWe’re gonna take a little trip down memory lane\n\n[Verse 1]\nNow I remember you from back in the day\nHad mad respect when you came my way\n20 years later and shit's done changed\nNow you're a hater but I'm still the same\nI let you hear it cause you wanted a sip\nYou didn’t get it so you had to trip\nGot ignorant, flipped quick, you know the story\nNever made a record but think you an authority\nGotta admit, I was hot as fuck\nBut when your texts rolled in after you hung up\nI just had to laugh and call it a night\nYou can’t dance with the Devil in the bright sunlight\nDone playin' nice, fuck your advice\nFooled me once, won't fool me twice\nTried to throw water at the Wicked Witch\nBut I don't melt, I slaughter a bitch!\n\n[Chorus]\n(A fly girl's a girl who speaks their mind)\n(Hardcore, back with a brand new sick rhyme)\n(What's the time? Don't give a fuck!)\nStill talking shit, still kickin’ up dust!\n\n[Verse 2]\nIt’s a shame when I gotta check a dame six ways from Sunday\nRest on the seventh murder on Monday\nYou wanna reminisce? You really don’t know me\nI’m as real as it gets, so who’s really the phony?\nLearned to scream and became a queen\nBut I can still rock a rhyme that’s mean\nSo don't step with that lightweight crap\nI'm “Black Flag” to your “Adam Ant”\nI kill ants on contact, when I rap\nAnd If you don't get the reference, its cause ya can't\nYou're like Carly squawkin' that \"Call Me Maybe\"\nI'm like Teena talkin' “Square Biz” baby\nBut I'mma rip ya and hip ya to the \"B\"\nThe T-A-I-R-R-I-E\nAnd If I'm too wordy it's cause I kick game\nMay the bridges I burn light my motherfuckin’ name!\n\n[Chorus](x2)\nA fly girl's a girl who speaks their mind\nHardcore, back with a brand new sick rhyme\nWhat's the time? Don't give a fuck!\nStill talking shit, still kickin’ up dust!\n\n[Bridge]\nNow throw your hands up and check my flow\nAs above, so below\nI said throw your hands up and check my flow\nCheck my flow\n(Turn up the microphone)\n\n[Verse 3]\nA hymn for the haters, some old school gospel\nI don’t hustle, I'm known to get hostile\nSo violent with a mic in my hand\nYou better run for cover if I get my band\nAll my fans and blasphemous girls\nGot witches in my coven all around the world\nDressed in black ready to attack\nA wolf pack that got my back and it's like that\nBy the pricking of my thumbs\nSomething wicked this way comes\nI get wicked and then some collecting teeth\nBetter watch your mouth next time we meet\nWolves don't lose sleep from opinions of sheep\nAnd night is falling, the moon is shining\nClouds are forming, the storm is coming\nThis is a warning\n\n[Chorus](x2)\nA fly girl's a girl who speaks their mind\nHardcore, back with a brand new sick rhyme\nWhat's the time? Don't give a fuck!\nStill talking shit, still kickin’ up dust!\n\n[Outro]\nHallelujah, Hallelujah, Hallelujah!"}], "artist": "Tairrie B"}