{"songs": [{"year": "1998-11-03", "title": "Pre-Game", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "[Verse 1: Sauce Money]\nI lay my gun fine, ideas be as bright as the sunshine\nShook the rap game with just one line\nWhen me and my niggas combine, all day, you know what?\nSometimes, I run with mad niggas who done time\nHit you with eight, from one nine, now you showin' the vein\nMy shells is like information, go in your brain\nHoldin' my slug, before you squeeze 'em, show 'em the love\nBurn your fingertips so throw 'em a glove, understand me\nBefore my album drop, copped a Grammy, uncanny\nBought my first Rollie from Manny\nDirty burners my crew never hand me, nigga we family\nYou not, get shot, get caught sniffin' like Dexter Manley\nWith at least ten lead, spray right, paint your skin red\nDamn, we all the shit you can't be\nWe big time, you small time, real small, like how an ant be\nMarcy, bust a shot for Metcalf, Tilo and Danny (bop!)\nPeace to the Bureils, Cut Wop and Stanley (geah!)\nBoom Moet and bow, my whole set is wild (wild)\nPast threats, frontin' flash singles and that's bent\nFuck a bitch, you know the drill, cut a check or suck a dick\n\n[Verse 2: Jay-Z]\nJigga, what the fuck?\nAs a youth explosively, clappin' off the roof\nShootin' guard like Kobe, raised up slay smears and bo'e\nBack then, Gil was my co-d, Spanish Jose\nShowed me how to get the money niggas owed me\nFast forward, no kids, six cars and three Rolies\nTwo cribs, trips to Cuba, sippin' on Ooba\nGot rap in a stupor, first to clap your group up\nFrom the Range with the ski rack, or six with the roof up\nShit, I light the motherfuckin' soundproof booth up\nNew shit, y'all say the same shit like you're looped up\nYour raps all lazy, Jigga the Black Scorsese\nWhat your album lack is more Jay-Z\nCode name: Jay-Hova, all praise me\nY'all don't paint pictures, y'all all trace me\nYou've yet to see the day when my squad be done\nI represent that shit nigga, Marcy son, what?\n\n[Verse 3: Sauce Money]\nI grab my dick in front of your bitch\nScreaming \"Fuck your spot\"\nHeat miser, anything I ever touch was hot\nSauce watching all ya wildcats flop, sound greasy\nOne song on your whole CD, making my job easy\nFigured as much though, got your hustle swinging\nCop a muzzle, then y'all got the nerve to drop a double?\nEverybody ain't B.I.G., nigga\nEverybody can't flow like Jig, nigga\nBitch niggas listen: No sorrow tomorrow\nIf you swallow hollow-points\nLike a dread in the weed spot, I'ma move some joints\nI ain't playing, these BK slugs spraying\nMute niggas could tell you how nice I am\nIt goes without saying\nMalicious, rap flow vicious, stack dough\nBitches sucking dicks, say fat boy delicious\nPretentious niggas get it in slow-mo\nKodak couldn't picture that\nSo X-ray machines taking your team photo\nNiggas switching like a homo, shit on your team\nFuck how they feel, get all that CREAM\nHere comes the drama\nHere's the drummer, they call your number\nAnd now your fun-filled summer filled with bounty hunters\nIf a bitch fuck you for free, cats will kill you for the same fee\nThink niggas give a fuck what your name be?\nOr your raw crew?\nKid you're all saw-through, mad 'cause you ain't blow yet\nNever fret nigga your bitch blew for you\nGet on some Prince shit like, \"I truly adore you\"\nNever, crab cat, fuck you, have that\nSauce mother F-U tricks all in the mix\n300 large on my flat up in the sticks\nNothing but a lot of leg room, my son and my bitch\nGetting fatter of salmon, croquets and grits\nPeace to all my niggas in Marcy, Viya Schmidt and Bits\nL-channel, Henny and crime, nigga which?\nOne of y'all in the mirror looking facing them 8's\nOne in your helmet, might induce a case of the shakes\nB-Scott, what the deal son? Reno where the dro at?\nSauce Money, you know that, nigga", "album": "Middle Finger U"}], "artist": "Sauce Money"}