{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/f4be10e87c4c5135ae076c48430a2318.402x400x1.jpg", "title": "Death Physical", "year": null, "album": "The Exorcist", "lyrics": "[Killah Priest]\nWill we all sell drugs forever?\nLife endeavors, the pipe's the pleasure\nFight the pressure, tides just severed\nCrack is measured, go broke then y'all back together\nJail or gettin' clapped, we all are trapped, however\nHow many gangsta spirits you have to deal wit in dreams\nWake up in screams till you finally feel it\nNever realizin', neva feelin' vibes in\nBut still survivin'\nTill around the corner they peel the iron\nEyes them, flashback when you clap gats\nThat was a payback, bad karma\nYou shoulda had ya armor, grab the llama\nLight the ganja, spirit conjures\nWhen the body goes back to the Earth\nThe soul goes back to the Universe\nNames on plaque in tombs and the dirt\nFact is we all consumed by the work\nA young soldier told me the streets is glory\nDied before me\n\n(Hook) 2x\nOn death birthday\nBlowin' candles, wooden handles\nDamn, he went in the worst way\nDeath birthday\nHis presence is no presents\nDraw your weapon for protection\nWe all wear black on death birthday\n\n[Killah Priest]\nWhat's love a bullet wit ya best friends blood?\nYou see your little sister's kid\nGive 'em a pack of the drugs\nWhat's real, you see ya man consultin' the deal\nYou really jealous but neva really express how you feel\nWhat's heart, you see ya man gettin' killed in the park\nYou both get shot at, but you disappear in the dark\nWhat's life, it's somethin' we all go thru\nFrom the old school\nI know them rules, I know them jewels\nNiggas play cool but get you punked\nNext thing they get you drunked\nNext thing you know you in the alley slumped\nAnd niggas ask you to burn\nTurn around and pass you some sherm\nYou neva learned till that casket discerned\nYour best friend haven't been dead for an hour\nAnd you at his baby-mom house wit some flowers\nRubbin' her back, tellin' her she need to relax\nHow foul is that? Fingertips on her back\n\n(Hook) 2x"}]}