{"songs": [{"year": null, "image": "https://images.genius.com/69a36be14d6ea4a081e8b94ff44cbc4e.994x994x1.jpg", "title": "Stretch Marks & Cigarette Burns", "album": "Tha Blaqprint", "lyrics": "[Intro]\nWoo-han\nWhat\nWho han, Woo han\nWhat up niggas\nIt's crazy\nYo Panchi\nCall Sha\nCall Premo\nTell them let's meet in the club\nYo\n\n[Verse 1: Blaq Poet]\nI came in the club with a couple of goons\nWe was already drunk, now we're smoking the [?]\nLittle shorty on the stage, she was wilding, dancing\nWhole motherfucking crowd screaming, chanting\n\"Move something, shake something\nBreak something, bitch\"\nI was like \"Oh shit, what the fuck they're saying?\"\nBut shorty don't care 'cause she had these niggas paying\nHad them niggas laying out all their bread\nHad them niggas standing on their motherfucking head\nHad them niggas waiting on line for their turn\nNiggas love stretch marks and cigarette burns\n\n[Hook: Blaq Poet (w/ scratches by DJ Premier)]\n\"Move something, shake something\nBreak something, bitch\"\nI was like, \"Oh shit, what the fuck they're saying?\"\nStretch marks and cigarette burns\n\"Move something, shake something\nBreak something, bitch\"\nI was like\n(\"Yo, what the fuck are they yelling?\")\nStretch marks and cigarette burns\n\n[Verse 2: Panchi]\nYo this is for my bitches in the shelters who don't need shelter\nYou're just doing that shit for a crib\nAnd all my bad little bitches, if your baby father hit you\nStick that ice cold knife in his ribs\nAnd all my bitches pimp the system, [?] tell your workers\nFuck that, you gon' have more kids\nAnd you ain't have them 'cause you need them, but now, you got to feed them\nSo you figure that your ass gonna strip\nIn the club setting, niggas dancing, bra sweating\nAs the bass booms, more sweat consumes\nAnd you wonder how thousands can fit in a room\nThe speakers is bumping 'til it damn near pop\nThese hoes is dancing 'til they damn near drop\nBut I sit back and observe the whole scenery\nAnd nonchalantly tell you what it mean to me\nThe filer says no boots and jeans\nI'm in the back blowing trees, dipped in army fatigues\nLittle bitch on my back, when will I learn\nNot to fuck with stretch marks and cigarette burns\n\n[Sample]\n(\"Yo, what the fuck are they yelling?\")\n\n[Hook]\n\n[Verse 3: Imani Montana]\nGot love bitches, sliding down the pole bitches\nTwelve to four bitches, don't matter, you're my bitches\nStretch marks and cigarette burns, alright, bitches\nCan't knock your grind, live your life, bitches\nGet money, be the best at what you do\nCocksucker want to judge, tell them, motherfuck you\nYou done mastered the art of this seduction shit\nSee homie came tonight but hopes he can fuck your shit\n[?] nigga [?] screaming we don't love them hoes\nType to question why [?] dance to her pole\nBut he fucking with [?] but she buying him clothes\nTelling ass nigga, G's don't take you on the road\nIn tune with the soul, can't tell me nothing\nHave a man [?] lick it up, fronting\nWho you think you fooling, look at you drooling\nLove what's she doing, what is she doing\nTop on the pole, thick, legs in a split\nWorking her way down like she's riding your dick\nNow you want to lick every burn and stretch marks\nWhat else can I say, we the best, ma"}], "artist": "Blaq Poet"}