{"artist": "Waka Flocka Flame", "songs": [{"year": "2013-02-05", "lyrics": "[Verse 1: Waka Flocka Flame]\nI woke up this morning too turnt' up, my nigga, I be balling\nPink slip shawty, I don't do no fucking lease\nNiggas dry snitching, want to run to police\nPut it on my niece, you gon' die before me\nI put that on the G, Grove Street nigga\nWhere I'm from, we don't brag if we catch a body nigga\nThat's just life\nReal shit, nigga, that's just life\nWatch out for your friends when they got a knife\nBlood brothers, me and Wooh Da Kid\nRun up over here, no more hard year\nSix millions, that's real shit\nI'm on my squad shit, flex, go hard, bitch\n\n[Hook: Waka Flocka Flame]\nThey know my war stories, niggas know me\nWalk up dumping, [?] me\nEverybody killers, where are the bodies?\nIn the hood, where you could find me\nBlood brothers in the club, it's a movie\nMy hood, you can call it grimy\nLights, camera, action\nCenter of attention, mention Wooh Da Kid and Flocka\nThat's a bad decision\n\n[Verse 2: Waka Flocka Flame]\nB.O. Flame, family above money\nLoyalty spelled backwards, Waka Flocka Flame\nWant to wear my chain, want to drive my car, want to fuck my bitch\nAll in my business, get off my dick\nNiggas bullshitting\nI got that sack right now\nNiggas bullshitting\nFirst strap, thank you to my brother, Wooh\nEverything green, pussy, soo woo\nI built it nigga, watch me break this nigga\nI'm one grateful nigga, all I did, you ain't thankful nigga?\nI'm from Riverdale Road, Grove Street\nLast time that I checked, they know O.G.'s\n\n[Hook: Waka Flocka Flame]\n\n[Verse 3: Wooh Da Kid]\nAll I know is grind, 25/8\nLike fuck it I need it now, niggas can't wait\nKnife or the pistol, let you choose your fate\nNeighborhood buzz, I'm moving state to state\nWooh Da King in this motherfucker\nHeavy metal, three chains in this motherfucker\nFlocka Flame, that's just my blood brother\nCould never be pussy, I got a gangster mother\nMost of these niggas fake, the rest is iffy\nCould even null around, niggas won't tempt me\nHole in his head, I guess he lost his mind\nAnd he thought he was a winner when he crossed the line\n\n[Hook: Waka Flocka Flame]", "image": "https://images.genius.com/21b00c1d33bc35a7c5b4f72cdfffc3a3.500x500x1.jpg", "album": "DuFlocka Rant 2", "title": "Bad Decision"}]}