{"artist": "Big Boi", "songs": [{"lyrics": "[Intro: Big Boi]\nBoy, stop!\nYou ain't no DJ\n\n[Verse 1: Big Boi]\nI double dare, matter of fact, nigga, I double dog dare\nAny rapper to take it there with this player here\nLet's be clear, I'm a leader, not your peer\nValedictorian of this rap shit every year (year, year, year)\nLike beer and pretzels with the game, I go good\nI'm the Hansel to your Gretel, you's a dame, understood?\nOverstand, ho ass nigga from my hood, I'm embarrassed\nBy the lack of class, sat in the back of class\nBut passed with flying colors with yo' backwards ass\nYou're like the caboose and I'm the engine locomotive\nTo let loose steam in the booth, scream, awooo!\nDream Team, nigga, fuck that pillow talk, keep sleeping\nWhile I'm beating down yo' street up in that green thing\nGreetings, Earthlings, I've been lurking deep in the shadows\nGathering artillery for the battle\nNow, on the front line, I stand, microphone in my right hand\nLeft foot on the gas, don't make me put my foot in yo' ass\n\n[Hook: Big Boi]\nYo DJ ain't no DJ, he just make them fucking mixtapes\nWhere they at? Where they at? Where they at? Where they at?\nWhere they at? Where they at? Where they at?\nYo DJ ain't no DJ, he just hit that instant replay\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go\nYo DJ ain't no DJ, he just make them fucking mixtapes\nWhere they at? Where they at? Where they at? Where they at?\nWhere they at? Where they at? Where they at?\nYo DJ ain't no DJ, he just hit that instant replay\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go\n\n[Verse 2: Yelawolf]\nMy momma gave birth to a 10-pound, 6-ounce dream\nAnd God said look for the burning bush, now I turned to weed\nSo I jumped in my shell when I saw my momma burning trees\nHard white, I trickle nickel bags\nIce cold true shit, in the booth with blue lips\nOn your grave like a tulip, in the bar like a pool stick\n808 Toomp shit, Magic Mike, poof, bitch\nAin't nowhere to rest, nowhere for you to sit\nI stole your couch and I took your truck to move it with\nSofa any one of you wanna get to' up\nI'mma tattoo, Kodak you, close up\nAin't no UFO, no, Yela's a supernova\nDogs are barking as soon as that trooper roll up\n30 aught 6, Momma, don't gotta load up\n'Cause I'm from The Varsity, it may be hard to get RC Cola, hold up\n\n[Hook: Big Boi]\nYo DJ ain't no DJ, he just make them fucking mixtapes\nWhere they at? Where they at? Where they at? Where they at?\nWhere they at? Where they at? Where they at?\nYo DJ ain't no DJ, he just hit that instant replay\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go\nYo DJ ain't no DJ, he just make them fucking mixtapes\nWhere they at? Where they at? Where they at? Where they at?\nWhere they at? Where they at? Where they at?\nYo DJ ain't no DJ, he just hit that instant replay\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go\n\n[Verse 3: Yelawolf]\nYeah and I party in poverty with people like\n\"Yeah, you're famous, so what?\nI bet you can't hitch that semi up to this tow truck\"\nRich with a hundred dollars, soul like a batch of collards\nYeah, I'm pale but I'll impale you with an Impala\nRoll with pimp scholars, ATLiens\nA-L-A-B-A-M-A agains, come and check my weight again\nBaby, I know I ain't that crazy, the scale says heavy\nMust be my dick the way bitches been hanging on it lately\n\n[Verse 4: Big Boi]\nYeah, we stay banging on the daily, soul funk crusader maybe\nTailored alligator soufflé, escalade all in yo' ladies\nSpace invader, I'm the lyrical Darth Vader\nGive thanks, pussy nigga, I don't expose you as a hater\nGot Decatur, East Point, College Park and the SWATs\nCampbellton Road closed, road block, watch out for the cops\nGotta think outside the box, know how to connect the dots\n'Fore somebody hit the jackpot playing in your slot, boy, stop\n\n[Hook: Big Boi]\nYo DJ ain't no DJ, he just make them fucking mixtapes\nWhere they at? Where they at? Where they at? Where they at?\nWhere they at? Where they at? Where they at?\nYo DJ ain't no DJ, he just hit that instant replay\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go\nYo DJ ain't no DJ, he just make them fucking mixtapes\nWhere they at? Where they at? Where they at? Where they at?\nWhere they at? Where they at? Where they at?\nYo DJ ain't no DJ, he just hit that instant replay\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go\n\n[Skit]\nWassup, Keisha?\nWho dis?\nYou know who it is, the most feared man in [?], you know who I be... motherfuckin' Henry, Henry\nHenry? What, what you drivin', Henry?\nI wouldn't drive, my momma drop me off\nI'mma do how it in sandals, the \"Jesus Walks\" sandals, I stand outside of the club\n\"Jesus Walks\" sandals?\nYeah, you know Jesus wore sandals so I can wear some too with my little linen outfit, you saw me! The baller\nYou can tell I'm gon' make it rain, I got them 31s, you come on over here, I'm gon' make it rain on you\nNigga, make it rain on this tank\nWhat tank?\nThe tank of gas and what you got on it\nYou never had 30 dollars worth of gas in your tank!\nFuck you livin'? I live out here in Duluth, gas and that damn–\nDuluth? Nigga, that's out of the perimeter, mm-hm, you put 50 on at least\nI'm so tired of you [?] hairy cold-ass hoes, man\nY'all ain't never seen anything, you gotta move around 285, get the fuck out of down that area\nNigga, ain't nothing out of 285 but fuckin' trees\nMm-hm, 50 on the tank\nI'll give you 50 dollars and a blunt of kush and I'mma fuck that mohawk off your head\nMm-hm, you can fuck me, give me 50 dollars, and go 'head give me some kush\nFor 30 dollars, you gon' do the fuck I want you to do!\nI'mma make 'em fill up your tank for 30 dollars\n30, nigga? You talked 50\nI'm gonna make it rain, bitch, tell me\nNah, nah, we stay at 50, how I go down to 30\nWell, okay, it gon' be drizzlin' then, it ain't gon' rains, fuck it\nAyy? It gon' be drizzly\nMm-hm, nigga, that ain't participation, mm-hm, no, mm-hm", "image": "https://images.genius.com/d490a9246c93be0a14dc0d13699d97a2.908x908x1.jpg", "year": "2010-07-06", "title": "You Ain’t No DJ", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}