{"songs": [{"image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg", "title": "Let It Go (Lil Mama)", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "[Intro: Pharrell (Nelly)]\n(OHH!) Turn it up, turn it up\nTurn the beat up, uhh (DERRTY E-N-T!)\nTurn it up some mo', uhh, okay (uhh)\nYou turn it up a little bit?\nHere we go (WE ALL WE GOT, OHH!)\n\n[Chorus: Pharrell (Nelly)]\nShe blowin cause she seen that car (she 'bout to blow!)\nShe blowin cause you turned that corner (there they go!)\nShe blowin cause she seen that watch (she 'bout to blow!)\nShe blowin cause you flashed in it on her ('bout to blow!)\nShe blowin cause she seen that knot (she 'bout to blow!)\nShe blowin cause she seen your flash (there they go!)\nSo many y'all in one spot (she lose her mind!)\nShe never seen so much cash\n\n[Interlude: Nelly & Pharrell]\nSo let it go lil' mama, let it go lil' mama\nJust let it go lil' mama, let it go lil' mama\nJust let it go lil' mama, let it go lil' mama\nJust let it go lil' mama, let it goooo (Hey!)\n\n[Verse 1: Nelly]\nYo, they call me Mr. Intellectual, I keep a bunch of vegetables\nCarrots and the broccoli, how the hell can you stop me?\n(Naughty by Nature), yup I'm (Treacherous) and less than this\nWould be uncivil-ous, and like some syphilis I'm killin this\nBeat by Pharrell-y; yeah, yeah, really\nChad this is silly; ju-just silly (WHOO!)\nGot a team in the Carolinas, your highness\nKeep the finest big booty behind us, behind us\nJust to remind us that, that we the flyest so\nKids at home, yo, please don't try this\nMy hands in my pocket mayne I'm doin the wop\nLil' mama on her Snoopy Doggy Dogg, she droppin it hot\nI got whatever in my garage, pull up and shut down your spot\nI got how many in my bezel man I shut down your watch\nOh yeah I'm rappin, believin, my zing and my trees in\nAnd soon I'll be leavin, with yo' chick (ah-ha!)\n\n[Chorus + Interlude]\n\n[Nelly]\nShe call me Mr. extra sexual, Scorpio ma is legible\nExtraterrestrial, she say I'm harder to swivel\nI keep a fresh pair of Versace, shine up my Liberace\nMy Dolce and my Gabanna, ma I'm keepin it thorough\nI keep one hundreds in the bunnies{?}, let me keep it 100\nI'm the most underrated, under-appreciated\nMost sold to dated, fuck you rapper we GOT\nSee I don't drop every year to give you niggas a shot\nNow I might not get five mics or a double-XL (never)\nBut fuck it, you keep it, I'ma take the 100 mil' (cha-ching!)\nAnd the Murcielago with the rim kitted Tahoe\nThe show stopper, when I ride all you hear is \"Bravo\" (bravo!)\n[clapping] And all you hear is, \"There he go\"\nHa ha ha - ah, ah, ah\nYou see my paint job's a fool, my paint job be poppin\nMy paint job's so wet my license plates read (what it read?)\nPUSSY, shut yo' mouth\n\n[Chorus]\n\n[Interlude - 2X]\n\n[Outro: Nelly]\nListen now I, I\nShe wanna know what my girlfriend know\nAnd uh, she wanna see how deep this can go\nShe wanna know how much she can blow\nShe wanna know what my girlfriend know\nBong bong - RZA\n\n[Nelly, Pharrell]\nShe 'bout to blow, there they go\nShe 'bout to blow, 'bout to blow\nShe 'bout to blow, there they go [fades out]"}], "artist": "Nelly"}