{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/9b8c1d7db9d30b81aa3e833c9b3d227a.797x797x1.jpg", "title": "​thanks kathryn obvious", "year": "2012-06-11", "album": "the lizzie mcguire experience", "lyrics": "[Verse 1]\nIf you write down the things that make me cool, it's a short list\nI don't want to talk about my small wrists\nIt's been a while since my last kiss\n'Cause I mean, it's hard to find a nice techie\nI should be alternative like Becky\n'Cause she's pretty and she's sexy\nProbably just mad because nobody gets me\nAnd I all I ever want to do is sit in my room\nAnd watch Spiderman lose to Dr. Doom\n\n[Verse 2]\nI miss the days before everybody thought I was a stalker\nI've always been the dork, ass jammed inside the locker\n'Cause I thought I was Shena, you know, a punk rocker?\nTill I grew into wanting to be Flocka\nAnd everybody hates it, what a shocker\nI've been hot since grade school soccer\nWhen the coach tried to put me on the bench\nI fuckin' shot her\nNah, just kidding, I'm a lawyer's daughter\nI'm not a badass, I'm not awesome\nI'm a little ginger wuss, I'm Bubbles, I'm not Blossom\nOn the V.I.P list, I'm at the bottom\nI've been hiding in my closet all summer and autumn\nWatching Jimmy Neutron, and dying of boredom\nAnd all my friends hate me, 'cause I ignored 'em\nTo talk to base ferrell and fuck swag, and slug and shit\n\n[Hook]\nAnd everybody else that I'm in love with\nAnd everybody else that I'm in love with\nAnd everybody else that I'm in love with\nAnd everybody else that I'm in love with\nAnd everybody else that I'm in love with\n\n[Verse 3]\nFuck this, everyone in Florida is a sham\nSo I went back to Hollywood, specifically for Cameron\nAnd right after I landed in L.A.X\nI ran into my ex and he looked a little vexed\nThey said, \"is there a problem?\", yes\nHe said, \"California hates you bitch, why'd ya bother?\"\nI just came for the fries with the carne asada\nAnd to prove that I can go a lot harder\nThan \"Gucci Gucci, Louis Louis, Fendi Fendi, Prada\"\nBut whatever, I met him in Louisiana\nWith my baby, James, consider your post flamed\nAnd without him, you probably wouldn't even know my name\n\n[Hook]\nSo he's one of the hundred that I'm in love with\nAlong with everybody else that I'm in love with\nAnd all the other people I'm in love with\nEverybody else that I'm in love with\nAnd everybody else that I'm in love with\nAnd everybody else that I'm in love with\nAnd everybody else that I've been in love with\nAnd everybody else that I'm in love with\n\n[Verse 3]\nAnd everybody else that says they love me\nI mean all the shine online is lovely\nI feel like such a lucky little kid, like Cudi\nAnd if you don't like me, I know that I'm sucky\nAnd nobody likes my music, they just kinda wanna fuck me\nSo here you go, here's your shoutouts, honey\nHi Ramsey, Christian, Michael, Brad, Noah, Matt, Danny\nAnd that asshole who said he can't stand me\nOn YouTube, wearin' some dumb Slayer band tee\nHave fun dealing with those six fans\n\n[Outro]\nFucker\nSay I copied Odd Future, what the fuck is wrong with you?\nI'm just a little girl, stop picking on me on the internet\nTelling people to be mean to me on Last.Fm, okay\nI'm telling on you"}]}