{"songs": [{"title": "Money Trees", "album": null, "year": "2014-06-22", "image": "https://images.genius.com/69eee639bab29343a04455251289a151.1000x1000x1.jpg", "lyrics": "Part I: Money Trees Remix\n\n[Chorus]\nMe and my niggas stayin' hungry, ya bish, ya bish\nOut here workin' for our money, you bitch, you bitch\nNiggas prayin' I fall off, ya wish, ya wish\nGettin' full off success, no dish, no dish\n\n[Verse]\nI want gold models with gold bottles\nTwo fast cars at full throttle to drive me through my fantasies, uh\nI need good rhymes, no dried lines\nAnd 30 cups of red wine to understand my destiny\nSee me I'm floatin' in the ocean\nNever coastin', they can't hold him\nFast life in the slow lane\nRunning'through the bread so fast they say I'm loafin'\nCame up from the bottom\nYoung kids, we didn't really even have no options\nNow thots be thottin' and all of you foo foo niggas plottin'\nCame up from a came up\nLil Skies done changed up\nBut I'm still on the same team\nDoin' things y'all afraid of\nI-I've been workin' hard, but I'm still learnin'\nI-I don't get no sleep, now my head hurtin'\n\n[Chorus]\nWe tryna get it, ya bish, ya bish\nOut here workin' for my team, ya dig? Ya dig?\nNiggas hatin' 'cause Lil Skies\nI be grindin' and I'm just not like you other guys\n\n[Outro]\nYa bish, ya bish, ya bish\nAnd we go, and we go\n16 16's nigga\n\nPart II: All of My Remix\n\n[Verse]\nLook, okay I'm all about my peso, nigga who are you?\nAlways gotta hustle so I watch where I move\nThe bills past due, the money on the table\nWe couldn't pay for cable, now all my niggas stable\nI used to sell shoes, I used to sell hats\nI tried to make that come up, but never ever trapped\nThese niggas straight wack so I can't trust 'em\nTurn a good girl bad, had to adjust 'em\nMoney, power, fashion, my only motivation\nNiggas tryna test me, deep down they hatin'\nPeople quick to judge me, somethin' like I'm Satan\nI've been at the bottom but I'm patiently awaitin'\nTo smash you nigga, I'ma nigga trash you nigga\nYou be rappin' like you nice, boy you ass, my nigga\nAsk around boy, they tell you Lil Skies that nigga\nI been grindin' too hard to come in last my nigga\nSo I go, spittin' rhymes, they dope\nLevitate and I flow\nGreatness they know\nI'm a prodigy\nProbably rocking everybody in the crowd\nAnd I'm known to be wild so I'ma be here for a while\nChambersburg born legend\nI'm bringin' niggas down like 9/11\nAnd my verses pop off like MAC-11s\n\n[Outro]\nUh, and it's love\nUh, shout out to P.A\n717\nHere we go\nTeam watch me win\nI feel like 50 man\n16 16's in 16 days\nYeah, uh-huh"}], "artist": "Lil Skies"}