{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Find The Sound", "lyrics": "[Verse 1]\nLife's a road that you follow til its closed off\nPick a turn make a break before the roads blocked\nMany follow they dont really pick their own paths\nMe I'm different see they welcome me with closed arms\nI just shrug 'em off, tell 'em they can have it back\nIt changes everything, let me tell you tragic facts\nMates treat you different, swear to god they think your changing\nIn your brain you stay the same and now you can't put up with fame\nAnd once that paranoia settles in, your barely going public\nJust to leave your fucking suburb need to rally up an army I mean\nHold my head high, now I got them red eyes\nState to state forget about a decent sleep or bed time\nI'm on my girls nerves, always on the fucking move\nShe thinks I changed I tell her girl you gotta trust me too\nOtherwise, right in front of her eyes\nShe's gonna watch me fall apart got people judging my life\nBut fuck em\n\n[Hook]\nTears come streaming down your face\nWhen you leave something you can't replace\nWhen you love someone but it goes to waste\nCould it be worse?\n\n[Verse 2]\nIt's funny back in class, teachers said I'm hopeless\nThey said they seen potential but I lack the focus\nFunny twist, I was dreaming of this\nI hope they see me now compare our fucking payments and shit\nMan I swear in the back of my mind, I knew it'd happen in time\nAnd now its actually mine, so\nDoes that mean what I seen was another sign?\nOr am I crazy and I'm searching for another rhyme\nIts like there's two of me, rapping what it do to me\nAll I've done was keep it real, and now you see the truth in me\nI ain't never mean to glorify drugs\nI just told you bout my road and now the story's blown up\nBut I'mma ride it out, fucking oath I'm riding proud\nWe can go together all you gotta do is find the sound\nI'm not depressed, nah that wouldn't be the right word\nIn the studio I leave my mark and the mic's burn\n\n[Hook]\nTears come streaming down your face\nWhen you leave something you can't replace\nWhen you love someone but it goes to waste\nCould it be worse?\n\n[Verse 3]\nAm I ever on your mind? Do you listen when I rhyme?\nSo far up, never missing a design\nCause I'm the blueprint, time yeah it moves quick\nTry and fit my shoes kid, rumours never true shit\nJesus had his haters, haters let me know I made it\nCrazy crazy I invade it, maybe ABK be blazing\nBlazing up a green batch, me I got the weed dacked\nTrying to be a man about it, shit I gotta fiend cash\nI ain't used to it, that's probably why I spend it quick\nRappin' is my life I put that shit on everything\nI look you in the eye if you admit that this is mine\nThey like to backstab like a shiv hitting my spine\nI just pull it out, sharpen it and throw it back\nBullseye, hit the marker, got a flow that's fat\nYou could stop the beat I need to know its sinking in\nMy life is crazy god reminds me that I wished for this\n\n[Hook]\nTears come streaming down your face\nWhen you leave something you can't replace\nWhen you love someone but it goes to waste\nCould it be worse?"}], "artist": "Kerser"}