{"songs": [{"title": "Ham", "album": "So Hard", "year": "2013-05-22", "image": "https://images.genius.com/701a46350909affbfec12488b53a9b66.500x500x1.jpg", "lyrics": "[Intro: Lil Dicky]\nWhoa... so hard\nJews is never supposed to go H.A.M., but fuck it\n\n[Verse 1: Lil Dicky]\nOkay dat boy D-I-C-K-Y ballin'\nI been spittin' hella writtens cuz I'm finna get my wallet good\nBitches know I holla good\nGraduated college wit a bag of fucking honors but instead of making dollars\nI been acting like a kid\nRappin' bout my fuckin' dick\nAnd what started as a joke became the hottest fuckin' shit\nKillin' bitches, Michael Vick, and women you know what this is\nSemi-colons in my texts, my instant message game is sick (HO!)\nFuck that shit, when I rub that bitch\nWhen I be up in the club I gotta tuck that dick\nWhen I bring a chicken back, and then I fuck that bitch\nI'mma cum quick, I ain't playin' witcha\nAy you know, I'm spittin crack up on the track\nI'm not attacking all you blacks\nWho try to rap, but I'm just saying that\n\n[Hook: Lil Dicky]\nI'm coming for these muthafuckin' brothas making money\nErrbody love the funny little buddy making jams now\nLadies get them pants down\nSorry to my god and my synagogue and my mom because this kike is going H.A.M. now\n\n[Verse 2: Lil Dicky]\nI ain't on that kosher shit\nFacebook I be poking chicks\nCame up in the 90's yeah im on some Hocus Pocus shit\nI don't push a lotus, I'm drivin a fuckin' Focus\nBut notice that I got the coldest and dopest designer sodas\nI'm an Izze sippin', bitty-kissin muthafuckin' G\nThe way I cum on chickens, call Lil' Dicky mozzarella cheese\nI'm getting pussy, getting bread, I get a lot of fucking yeast\nAnd I been Dustin Diamonds off, they bout to call Lil' Dicky Screech (WHOA!)\nTampon shit, 'cuz I rap for the flow\nAnd I get a lotta bitches when I mac like a pro\nGotta mac, it's a pro, never nap, but I doze\nI'm a little bit of black, like I shat in the snow\nAnd I know ya'll bitches feelin' that\nAin't as nobody real as that\nRappin' like Jamaica’s population, I been killin' tracks\n(Like, in the Olympic Games? You ain’t get it?)\n\n[Hook: Lil Dicky]\nI'm coming for these muthafuckin' brothas making money\nErrbody love the funny little buddy making jams now\nLadies get them pants down\nSorry to my god and my synagogue and my mom because this kike is going H.A.M. now\n\n[Verse 3: Lil Dicky]\nSee them bitches over there?\nPlease don't fucking over-stare\nThat's who I be stroking, young and smoking like they over DARE\nOkay I was joking, I don't know dem I should grow a pair\nBut I am not the most efficient closer when I'm sober, scared\nSo I'm drinkin, fuck you thinkin'?\nMiddle Day that's word to Lincoln\nMy left foot is always stinkin'\nI ball good so I ain't blinkin'\nBaby whatcha know about a muthafuckin' dog\nFuckin' cats up the ass metaphorically...uh, paws\n(I got that pause in on time, right?)\n\n[Hook: Lil Dicky]\nI'm coming for these muthafuckin' brothas making money\nErrbody love the funny little buddy making jams now\nLadies get them pants down\nSorry to my god and my synagogue and my mom because this kike is going H.A.M. now"}], "artist": "Lil Dicky"}