{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Ben Dova", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Intro]\nBend over\nYo, it's Mutty Ranks in the place (Mutty Rankin')\nBut in the immortal words of Shabba Ranks (Where are the girls?)\nWe got some sweet, we got some foul\nI'm about to break it down, check it out, let me know\n\n[Refrain]\nAre you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!) Do you like it like this?\nAre you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!) Do you like it like this?\nAre you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!) Do you like it like this?\nAre you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!)\n\n[Verse 1]\nYo, as I cruise through this ATL town, my eyes brown\nChillin', freshly dipped when I get down\nJarobi, tell 'em 'bout the puppy named Mutts\nLike lifestyles galore in case a chick wanna hump me\nI'm rough with mine, tell me who's rougher\nMakin' honeys express theyself like Salt-N-Pepa\nNot sayin' that sex makes everything better\nBut if all else fails, I'mma fuck that tail\nNow watch out now, damn look at your trunk\nWe could take it to the rest right now and get it crunk\nSing \"Shorty Swing It My Way\", it's only right\nTurn the door, now walk it in and see the real sign of life\nFuck a Phife, I'm on some Shawn Micheal shit tonight\nOn some Five Foot Freak shit, or I don't eat shit\nBut if you act right and you ain't about games\nThen my screwin' can be longer than Nina's last name\nNow tell me somethin' good before I hang up your friend\nFree humps and I'm out there if the shit is mad lame\nMad lame (mad lame) mad lame (mad lame)\nFree humps and I'm out there if the shit is mad lame\n\n[Hook]\nWhen it comes to skins ain't no shame on my game\nMutty orders you to (BEND OVER!)\nYou can't live with them, you just can't live with them\nSo don't waste my time, just (BEND OVER!)\nNow if you frontin' on the tail, then you get the cold shoulder\nDiggy orders you to (BEND OVER!)\nGirl, you are not gettin' younger, you are just gettin' older\nSo hurry up your ass and (BEND OVER!)\nBEYATCH!\n\n[Refrain]\nAre you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!) Do you like it like this?\nNow are you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!) Do you like it like this?\nAre you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!) Do you like it like this?\nNow are you ready? (WHAT!) Are you ready for this?\nDo you like it? (WHAT!)\n\n[Verse 2]\nForever in the jam where the diss be lookin' laced\nDancin' to the tunes of Cool J and Babyface\nMe and my crew, no doubt we in the place\nAss everywhere, (Yeah son, this place is great)\nBumped into this cutie, damn boo you lookin' straight\nChecked her backyard, can I guard that with a gate?\nSlim trim, brown skin, what's your name? ('Salina Kate')\nWhere you from? ('Trinidad, but I live here in the States')\n'It's only been three months but I'm searching for a mate\nWord 'round town is you love to penetrate'\nOf coarse, baby girl, what's the deal, you want a taste?\nA stain is on your brain that could never be erased\n'Sounds good Mr. Phifer, but I hear that's the case\nYour style be so super that you should wear a cape\nI love the way you sound on all five of your tapes\nPlus you're always on the job like Mr. Slate'\nOf coarse her best friend just has to player hate\nAnd being who I am watch the Phifey hesitate\nOn dissing her ass, yo Jay, look at her face\nHer motherfuckin' voice got way too much bass\nNow back your ass up off me and give me my space\nYou know your fuckin' breath smell like chemical waste\nNot to mention that ass, it be way overweight\nKeep that ass out of Wendy's and lay off them shakes\nNow back to you Salina, damn I admire your shape\n'FUCK YOU! Mr. Ranks you just dissed my date'\nNow what I'm supposed, scratch my head and ask why\nYou know that rug munchin's at an all-time high\nNow all these chicks today are just hot hot hot\nAnd me and my crew just wanna get hind, watch\nI won't hold it against you the things that you do\nI'll just have you know that I'm a lesbian too\nSo wiggle your ass here and swing over them titties\nIf you need to pay bills take your ass to Magic City\nNo need to act shitty, you're so so saditty\nIf you need to pay bills then take your ass to Magic City, what what\n\n[Bridge]\nAll you're lookin' for all this time, money\nWell ain't got enough time to take\nYou can't run game on a gamer!\nYou can't run game on a gamer!\nIt's Phife Diggy (What) I gets busy (What)\nBlowin' up the spot (What) Givin' back shots (Ooh! Ooh!)\nJ.U.S. (What) You know you can't test (What)\nBlowin' up the spot (What) Givin' back shots (Ooh! Ooh!)\n\n[Chorus]\nWhen it comes to skins ain't no shame on my game\nMutty orders you to (BEND OVER!)\nI'll fuck in a Land Cruiser or a Range Rover\nDiggy orders you to (BEND OVER!)\nNow if you frontin' with your ass, then you get the cold shoulder\nDiggy orders you to (BEND OVER!)\nYou are not gettin' younger, you are just gettin' older\nSo hurry up your ass and (BEND OVER!)\n\n[Outro]\nLike that y'all, to the beat y'all\nFreak freak y'all, so sweat y'all\nMy name's Malik y'all, style's unique y'all\nNo doubt y'all, I come through y'all\nTribe all y'all. Phife Diggy y'all\nOn the ball y'all\nAnd all these bitches on the way get the balls y'all\nPhife Diggy but I never fall out\nSlum Villy, got to bend over\nWhat what what what, all over\nDetroit Michigan, down in Angeles in CA\nFuck that we don't play round my way\nLong Island, we wildin'\nYugoslavia, no doubt I'm Slav-in' 'em", "year": "2000-09-26"}]}