{"songs": [{"year": null, "image": "https://images.genius.com/f647a6340c19b708e43be356dcd032cc.500x500x1.jpg", "title": "Hear Me", "album": "Street Champ", "lyrics": "[Big Shug]\nHear me, DJ, hear me\nBig Shug from the underground, feel me?\nHear me! Uhh, hear me\nBig Shug baby, here we go\n\nYou don't play my music, so you play what's hollow\nThe music that the simple people can follow\nWith the nursery rhyme most designed for the clown dancin\nStick around for 10 years, what are the chances?\nI'll tell you next to nothin, I'm not bluffin\nAnd you'll be relieved of your scratchin and cuttin\nYou corny anyway you no heart DJ\nWhy the program directors tell you what to play\nBut you front on air, tryin to say what's hot\nBut you got police escorts to the parking lot\nDon't get me wrong some DJ's keep it real\nAnd know exactly how Big Shug feel\nThis is the deal, play the crook music f'real\nI represent how all the underground feel\nDon't be scared, come see despair\nGuns drugs hoes, flippin everywhere\nHard workin people tryin to make a buck\nYoung wild ass niggas who don't, give a fuck\nIn the words of the late, great, Headquarters\nHead up, eyes and ears open\nNiggas bring the rope in, let's do these muh'fuckers\n'Til they hear what we got to say, hear me~!\n\n[Hook: repeat 2X]\nIt is what it is, hear, what I'm sayin\nAll my cats who get amped up and start to sprayin\nDon't make us come see you, we not playin\nOr they'll find your body deep in the woods decayin\n\n[Big Shug]\nHear me DJ? I don't drink Haterade\nSpots around the world my music's still played\nSo what I'm sayin, is get e'ryone paid\nE'rybody on stage, e'rybody backstage\nAnd if they whack the crowd'll let 'em know\nYouse a DJ you don't control the show\nCause you fucked up careers, and don't even know\nThat's why niggas stomp you out, at your show\nAnd you fake promoters, tryin to pay that short money\nIt's 2006, niggas is not dummies\nYou will be haunted, Malibu's Most Wanted\nDon't make me scare your punk-ass white, that's right\nI've been doin this for 13 years\nMany come and go but I've still got my career\nThat's cause I keep it real\nAnd I'm underground - hear me~!\n\n[Hook]"}], "artist": "Big Shug"}