{"songs": [{"title": "Sixteen 16's | All Episodes", "lyrics": "Ep.1 ( 00:12 ):\nDouble-time sixteen this week, let's go deep\nIt's so peak when I speak for the road geeks\nSo cheap when you speak that you won't reach\nAnybody, not your boys or your own peeps\nLittle chief want beef? Look, no teeth\nIn his mouth cos he doubted the bro’s teep\nThat’s a front kick\nFor you dumb shits\nThat don’t know we throw flows and punches\nWhere you livin at, munchkin?\nYou don’t know that Akalas been munchin?\nEmcees like Saltfish, Dumpling\nOr better yet like free school lunches\nSo full of shit that I shouldn’t even touch him\nBut I do cos I’m just that hungry\nRavenous, valorous, abracadabrous\nAmateur emcees get dead in front of cameras\nScratch that we’re takin’ any challengers\nWhatever caliber can't match my stamina\nLook king you ain't on this ting like him\nYou never grew up on Sting\nYour guard's weak and there’s holes in your chin\nWhile I’m cold with the flow, John Jones in the ring\nYour like Man that go gym, but never do squats\nFoundation’s weak so you’re easily dropped\nWhile I’ve got more bodies than a Chinese cemetery\nDone duppied a million men with the pen already\nClaim that you’re on dis ting, ya never ready\nDidn't your mum tell you lies ain't necessary?\nAnd Uncle Akala will punish you for lying\nKid Leviathan, I have been\nYou’re sweet as a hyacinth\nKnowledge is Power Volume 2\nNext year again we will see who’s who\n\n\nEp.2 ( 01:27 ):\nLife, Liberty and the pursuit of happiness\nThose words uttered by the owners of people\nProblem with being an oppressor\nTalkin’ about freedom\nIs the people you oppress may start to believe you\nAnd act on the words you say\nAnd make the owner way\nHow can such noble thoughts come from a wicked source\nOf course\nIt gives me cause to think\nAre the words even worth the cost of the ink?\nIf they change their meaning when the powerful say\nSo we can fight for freedom even the freedom to own slaves\nThese words these prostitutes with no standard\nThat sell themselves to anyone who can utter the language\nAnd get fucked by the highest bidder\nSo the life is bitter for most\nWe can all toast to the glam and glitter\nAnd go ham on twitter\nAnd instagram a picture\nBut can't stop the police from executing\n…children\n\nEp.3 ( 02:13 ):\nLife’s a bitch then ya die right don’t ya?\nBut if you don’t die right, where does your soul go to?\nHarder than the questions of life, I will approach ya\nTwo fists up by my eyes like i'm suppose to\nSmokin' more than every fiend in Camden town\nIf ya ever believe that I’ll be beat by a hand me down, bloody clown\nEver since Cuban linx came in on import\nBeen sharper than swords so I can reign within this sport\nLook at me now, Dessalines with the machete’\nTake a slavemaster head off, quick if you let me\nBet me everything you own clone\nBut this bloody throne’s stuck to the back of my arse\nLike sweaty boxers\nSteppin’ in my zone homes\nNo, I suggest you don't\nYou can't budge me an inch, much less get him off it\nSo stop it, no profit Come off it you little novice\nThey don’t make ‘em like this anymore\nWe rap scholars\n\n\nEp.4 ( 02:52 ):\nLife, liberty and the pursuit of happiness\nThose words uttered by the owners of flesh\nShow us philosophy is dead, if it's just an idea\nWithout real-life practical steps\nOh is that so? Is the life of the mind no longer valid?\nIf we don't live what we think through daily habits\nI'm embarrassed to say, everyday I betray\nHow I think I'd like to live in this world, am I insane?\nOr the same as the hypocrites that I do disdain\nWhat would I do in their shoes? I know what I'd like to claim\nBut there's no way we could say, how we would behave\nIf we had a whole different life up to this day\nIs it innate? Encoded in our DNA?\nOr in the spirit that is born in this body that we enslave\nWhat is happiness for you might be hell for me\nDo you still get to pursue it to the fullest degree?\nWe'll see\n\n\nEp.5:( 03:39 ):\nGordon Bennet, I’m flabbergasted\nSmart bastard, so bloody clever that it’s just retarded\nI don’t recite my charges, nor my type of garments\nTryna hype the hardests like half of these spineless bastards\nWho’s the rhyming artist\nMy timin I have harnessed\nI’m shinin’ blinding partners the finest you find in varnish\nIt’s my time regardless\nIf I should die with martyrs\nKnow that I was old school like Jamaican partners\nBut I’m ahead of my time and the energy I harness\nBrilliant and like equivalent to 4 million karmas\nMy brain power’s insane power I’ve never charted\nYet I’m known around the world for cremating carcass\nOf these half baked emcees that think they’re masters\nBut they ain't nothing but a scam, like the naija pastors\nGo preaching to the people, but listen harder\nAnd you will hear that it’s just bollocks like I am the dog’s\n\n\nEp.6:( 04:21 ):\nThe flow’s complex\nYou need music theory to see what is coming next\nThe crotchets and minus the riddims I will devour\nYou botched it but I’m killin a million villains an hour\nSour are the faces of racists who face the power\nEven though they chat a shower of shit, they’re really cowards\nSo if I do allow it to hit, you man are out\nI’m more unconscious than you are already you ain't about it\nSo just allow it\nDon’t stand the fuck up, nah have a seat\nIf you’re so road then go back to the street\nBut never, rap on a beat you’re crap I promise\nYour friends are not your friends cos clearly they are not honest\nYou can trust uncle Akala to keep it real\nAnd cos I signed myself I’m always keepin the deal\nAin't been on commercial radio since 2006\nPerformed in 50 countries since so\nWho gives a shit, huh?\n\n\nEp.7:( 05:03 ):\nLife liberty in the pursuit of property\nProbably woulda been more proper terminology\nTo explain the world envisioned by a monopoly\nWhat do we do with this world we’ve inherited\nWhat is happiness for you?\nWhat do you pursuit?\nWealth for the few as long as you’re enjoying the view?\nAnd what does wealth guarantee?\nSome peace of mind, regular blowjobs and cars that are nicely designed?\nI’m being superficial\nIt also guarantees that your children’s school won't get hit by a missile\nOn the unlikely event that it does\nIt will be fucking hell to pay for a memorial written in blood\nMoney don’t buy happiness, probably true\nWhat if it buys the closest thing then what do we do?\nWhat good is it loving all of the simple things\nIf the power the money brings takes em away at your whim\n\n\nEp.8:( 05:46 ):\nSo the saga runs on\nThis is still London same Billy with a truncheon\nNow aimin their guns on\nShots to the sternum\nCock Back Burn ‘em\nOr choke an immigrant incase you brothers ain't learnin\nHere’s a little reminder\nThe symbolic debt\nLike, when they use to hange ‘em and tag ‘em for stealin bread\nAnd all you were focused ons what the victim evolved with\nWhere they on the road did they wear a hoodie or smoke spliffs?\nCouldn’t give a shit if they licked a million shots\nDeath penalty has been abolished, has it not?\nAnd I seen way more drugs at Glastonbury than Carnival\nBut they don’t feel the need to send the police with arms at all\nAnd while the paedophiles walk free\nPublic enemy number one my brother its still you and me\nTo see what’s going on, you ain't gotta be a clever sod\nIt’s all about race and class just like it ever was\n\n\nEp.9:( 06:30 ):\nThis love is a drug\nThe way it affects the run of your blood\nNever to snub, but always eventually they do succumb\nOverrun, by thoughts that make you withering on\nYour own mum or anyone who has a slip of the tongue\nAnd there’s the question\nWhile you’re collecting tremendous sums\nWhile people are living in simplest villages even the wickedest slums\nDespite all the image and acting so innocent all of the pillaging’s done\nSo you relax not knowing the facts of how it actually come\nWhat’s next will power lose the head on it’s neck?\nAnd will the one that comes after be like a master grafter?\nOr more disaster cos history’s not a class in laughter?\nBut yesterday is not tomorrow so why do I trouble to answer\nI ain't sure if any war was fought for the poor\nAny persons working with a motive that is totally pure\nWhat I do know is the powerful won't hand it over\nYou gotta take it but nature might make you even colder\n\n\nEp.10:( 07:17 ):\nI drop a sixteen? Everything dead\nI’m Akala\nCos my dad’s black, I fool the whole world\nLike Obama\nThey really think I care about life, nah you’re mad\nI murk everything on the dance done you’re sad\nI had, quite a good time\nAnd spat, quite a good rhyme\nCos mine’s, quite a good mind\nFor time, mic would shine\nSublime, bring who you could find\nCousins don’t worry us\nIt’s not school, we are grown men\nWell some of us\nTrouble us, bless you\nSweet heart you’re special\nSuck it up, don’t show pain, it’s just a flesh wound\nTest whom? Don’t do it to yourself\nThat’s just disaster\nLike an honest third world leader in private planes that are chartered\nYou are not a martyr if you die for no reason\nCos you look like food, and we were hunting this season\nHigh treason to a royal emcee\nIs when you mimic me\nI am the metaphor and you are just a simile\n\n\nEp.11:( 08:01 ):\nThis week, we offered our condolences\nTo a Muslim, with a beard, some say that’s strange\nBut they don’t understand the way that we played the game\nWe don’t care about religion, what’s in a name\nAs long as you pump oil for us keep the price cheap\nYou can behead who you want the deal’s quite sweet\nHelp us to bomb other Arabs from the military bases we have in your lands\nBut you don’t have in ours\nWe’ll give you Rolls Royce’s, yes flashy cars\nPay you billions of pounds yes, we’ll make you stars\nA reformer, quite enlightened, funding the terrorism that we claim to be fighting\nSo its only right that we fly the flags at half mast\nSend the prime minister over seas to kiss your ass\nWho said hypocrisy they don’t know the rules\nDemocracy is just a bloody word sentimental fools!\nUncle Pompous!\n\n\nEp.12:( 09:50 ):\nConservative rap shout to white billionaires\nHeirs to the throne of global capitalism\nBuilt on the back of niggers\nLiterally in actual figures\nCenturies of labor unpaid, it had to equip us\nWith fuel for the engine\nFools stop pretending\nWe have not provided the answer to each and every question\nYou don't worship us and brown imitators\nThen it's obvious to all that you blatantly hate us\nMatters not how we got our paper, even enslavement\nOr dead Congolese kids today for mineral payments\nWhat matters is you worship blindly things over people\nSee yourself as less than equal\nIn the world that we teach you\nIf you have not, you be not\nSwing from the treetops\nAll you little monkeys should know by now that we not\nOf the same species, we're more human than you\nThat's why you worship us you dickheads, proving it's true\n\n\nEp.13:( 10:36 ):\nHave you ever never had a pot to piss in bruv?\nWhile living round the corner from those that swim in grub\nHave you ever gone to school, stomach still rumbling?\nRich kids coming in, ten pound for lunch on 'em\nHave you ever felt the resentment of not having shit?\nKnowing your mother works as hard as those who are arrogant\nTalking 'bout pull yourself up by the socks, bloody snobs\nYou started the race with a fifty pace head start, of course you're gone\nWe started from the beginning, had to carry baggage\nParents didn't have two cars, a home, and a lovely marriage\nBut that's life right?\nWe all play our cards\nBut ours are scarred and marked\nSo we put 'em in bars that's hard as [?]\nOr not\nRep the underground dirt\nBut still tour round the whole globe, shouts to Kool Herc\nWe're so focused on our slice of the bread\nForgot to say if you're still at the bottom it's cool, hold your head\nIt don't make you less\n\n\nEp.14:( 11:22 ):\nI was six years old when I first heard Public Enemy\nI knew in an instant me and hip-hop was meant to be\nShivers down my spine\nHearing a rhyme\nGoosebumps on my skin\nAnd the feeling within\nAll the pain and the rage that the music was cathartic for\nYou probably wouldn't know if you ain't seen the hardships before\nMaybe you would, maybe that's the beauty of it\nAnyone, anywhere relate to the topic\nWu-Tang came out with Shaolin philosophy\nBit of martial arts and some fruit from the knowledge tree\nAnd hood tales, you know, poverty, robbery\nWhere childhood friends die for not much, probably\nFelt they made their songs for my ears and fears\nCos boys like me were not allowed to cry tears\nSo here's a couple bars for them pioneers\nWithout you, you know we wouldn't be here\n\n\nEp.15:( 12:03 ):\nHip hop spoke to what we saw on our front doors\nThe black CNN, and so much more\nAfrican oral tradition evolving through Jazz and blues\nGriots rappin’ from back in the day as a way to spread the news\nUntil came from Jamaica, blazing amazing sounds\nOn the back of Hercules hip hop came to the Bronx with sound\nA decade before, the same Caribbean\nOur grandparents left to the shores of the Europeans\nSo we never learnt to rap watching Music television\nThis is our culture grew up on them sound systems\nNow hip hop is global beyond imagination\nWe still can't allow its roots to be forsaken\nSo I’m makin' a statement and engraving it on London’s pavement\nFor the founding fathers and mothers for this art that we’re making\n\nEp.16:( 12:46 ):", "year": "2015-03-16", "album": "Sixteen 16's", "image": "https://images.genius.com/d63d64df777a3ef536fe94251e324962.1000x563x1.jpg"}], "artist": "Akala"}