{"artist": "Boogie", "songs": [{"album": "Thirst 48, Pt. 2", "title": "Still Thirsty", "year": "2016-10-14", "lyrics": "[Intro]\nI get lost sometimes, lost sometimes\n\n[Verse]\nThis shit turned me to a different dude\nAnd most the time I don't be in the mood\nAnd niggas know how liquor do\nIt got me hitting girls I barely know like \"what you finna do?\"\nThirst, hmm, I'm a different dude\nThis humble talk got me a bit confused\nLet me stop flexing in my interviews and say\nY'all biggest tunes, I kinda look at them like interludes\nOh man, this shit turned me to a different dude\nAnd most the time I don't be in the mood\nWe went from tears at the bottom to we almost top tier\nMy biggest fear is I don't finish through\nI said \"oh man,\" shit, I'm a different dude\nAnd y'all done finally caught me in the mood\nLike how the fuck we made a killing in the land of the dead\nOn my mama I'm the living proof\nAnd shit it ain't no good day if I don't think I'm getting better\nI can't say I feel complete if you don't recognize my efforts\nWas sleeping on the floor, we turned them covers into beds\nWe was trying to get ahead, they trying to leave our shit severed\nSeveral seats to them niggas mad I'm still standing\nWell, well, well, well, well\nNo several seats for Sharese and she said she can't stand me\nThat's too bad, you know we never had that family in real life\n'Cause this shit turned me to a different dude\nAnd most the time I don't be in the mood\nIt's different women that I'm hitting too\nAs soon as I finish, hit Jamesha like, \"I'm missing you\"\nDamn, see I'm a different dude\nAnd y'all done finally caught me in the mood\nNow when I talk about the boppin' and the fucking dick-hopping\nKnow I'm talking 'bout you niggas too, all bad\nWith the shame, with the wrist game\nHow can I not be offensive when I switch lanes?\nEverybody think they winning in the vendor\nHow that nigga get chipped, it ain't shit changed\nPlease forgive me for the calls that I missed\nI blame the stu' like I can't talk for a bit\nAnd yeah my mama know I love her, but sometimes I get mad\nLike why the fuck we have to struggle?\nWhy the fuck we wasn't rich?\nAnd then I sit and think how we went from\nHouse to house, she gave us Heaven with no income\nI grab a plant with all thorns if you tell me\nWhy I had to see my daddy leave and really what it stem from\nAnd now I see what trickled down from his actions\n'Cause I see signs that my son lack compassion\nYeah we could pass up our life, but can't pass up our madness\nCan pass up our wife, but can't pass up these ratchets, all bad\nAll you niggas got me cracking up\nI heard some shit like I don't rap enough\nOr, shit, that I don't want it bad enough and then I heard 'em say\nLike \"nigga you don't got our back enough\"\nFuck, well, I've been stacking up\nNah, really that ain't accurate cause\nI just spent my whole damn advance in the past couple months\nJust to compensate for times we ain't have enough, woo\n\n[Outro]\nWhy leave me lonely?\nWhy don't you love me like you should?\nWhy leave me lonely?\nWhy leave me lonely?\nWhy leave me lonely?", "image": "https://images.genius.com/897bf6a1704e8f4822fba8ab981fa2b3.1000x1000x1.jpg"}]}