{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/31ef3262d569cc170f16ea77ecb6039c.1000x1000x1.jpg", "title": "Drylongso", "year": "2018-10-17", "album": "LA REGLE DU JEU", "lyrics": "It's 8 people on earth with the combined wealth equal to half the population\nIt's insane, it's amazing we even know their names\nAnd they still breathin' air\nThe fuck? it's no fair though\nBill Gates. Warren Buffett. Mark Zuckerberg. Bill Bloomberg. Carlos Slim. Jeff Bezos. Amancio Ortega. Larry Ellison... it's hellish man\n8 fuckin' people own as much as the poorest 3.6 billion\nDawg are you kiddin'? This is idiocy\nKill 'em all, fuck is we waitin' for?\n2.5 trillion dollars in untaxed corporate profits banked overseas to dodge taxes\nAnd still they wanna lock up Snipes and Lauryn Hill for a couple mil'?\nIt's fuckin' madness\n2.5 trillion though. What the fuck?\nWith that money we could do a lot of shit\nIncluding, for example, fix the 2,000 water systems across America\nThat's poisoned with lead and other toxins\nIt's not just\nFlint\nIt's 45 hundred other affected municipalities\nThis is our reality\nHow we finna change that, dawg?\nCop a heater get ready to bang that, prolly, I dunno man\nYo, man, what fuckin'...hellhole they manufacture the game, Jack?\nThe whole game be deranged, blad\nReally doe, I dunno\nVision the figures of...hey, listen, god this is ugly, think about it:\n\n1 of 10 people on earth live under 2 bucks a day\nAnd your average millionaire couldn't give under 2 fucks away\n\nSee there's five times as many abandoned houses\nIn America as there's homeless people\n\nSo if my math is correct, lemme check my notes for a second, oh yeah the system is totally evil\n\nA black man is 2 times to even 2.5 times as likely than a whitey to get shot up\nAnd/or locked up by the cops, bro, on god it's awful\n\nFor every dollar that a white man in America makes\nA white woman makes 77 cents\nIt's hella sexist off top but a black woman makes 69 cents to that same dollar:\nIt's deeper when you add race to the problem\nA Latina get 57 cents, that's when you\nAdd economic exploitation of\nBorders as colonial concepts to the midst\n\nIt's tricknologies employed for generations\nA system so insidious it has to teach us to convince our own damn selves that we ain't shit\n\nBelieve it or not I was highly verbal on them little SATs and what not\nBut my math was a little lackin', I think, cuz I\nNever saw the\nRevolutionary aspects of communication in organization\nAnd, you know, basically the way they that they teach it in school was too basic, basically\nBasically, they tryin' to play games and make you believe that the numbers ain't say shit but they do, though, you know\n\nI came into knowledge outside of my formal education\nAnd that's how I came to overstand the mathematics and they supreme placements\nStandardized testing is a waste of time and brain space, mayne\nIt makes us into automatons\nNaw, we gods. And born-poets\nPlease know this\nTrust, love and believe that\n1-2-3 that\nWhat else?\n\nOh yeah, plus fuck America\nBorn outta genocide and slavery it's crazy\nThat mathematics is mind-bogglin'\nPeace to the prison strikers\nPOWs of the black and brown working-class genocidal battle\nThat's been ragin' for generations\nEver since slavery, and before that\nAn extension of European imperialism born of irrational hatred and exploited for the gain of the few\nIt victimizes all workers, just as a universal issue\nKill all ristos, prolly, I dunno man\nMaybe there's another way\nUntil then, like the brothers say, 'any means' right?\nYeah, that seems right\n\nLook it's simple mathematics, knowledge\nWisdom, understanding\nCulture. You know, freedom\nPower. Refinement. Equality\nGod, build, destroy\nBorin' cypher\nY'all know how it go mayne\nIt's check-check-check 1-2\nEt cetera\nHip hop\nNever bluff, clever thug\nReady for any other mother fucker that wanna get involved\nNo sweat, why you sweatin' boss?\nGod never get a loss\nSever the king head from the neckbone, get gone\nKool Abaso Dubiako, low-key, slept-on\nBut that's whatever though\nPoint is, is the worker deserves to own the means of production, mayne\nPlus love is love is love is love mayne\nWhatever. God bless. One love\nPeace Allah Jah\nEllegua shangó abasa dubiaku, dralansu babbalu, hittin' a bongo, conga, Congo, whatever mayne\nJembe. Timba\nAllah, Allah....\n[listing voodo Gods]\n\nJah Allah, one love\nPeace, kinetic\nThe 7-7 god body, bless bless the abstract math of it\nAlgebra. Cannabis, Animal. Vegetable\nMinimal manage with it\nThe Spanish kid, amethyst, amethyst, amethyst\nDrylongso\nIt's simple mathematics, you know"}]}