{"artist": "YG", "songs": [{"image": "https://images.genius.com/59064082da48f1c48bf96d62c598b6c3.1000x1000x1.jpg", "year": "2018-08-03", "album": "STAY DANGEROUS", "lyrics": "[Intro: Jay 305]\nStay dangerous\nStay dangerous\nStay dangerous\nStay dangerous\n\n[Verse 1: YG]\nThey like, \"YG, why you so extra'd out?\"\n'Cause I pull up in a drop, like bitch check me out\nI don't drive no Tesla, I got too much clout\nTake it out her pussy hole, put it in her mouth\nOoh, they like, \"Damn that nigga nasty\"\nYeah, fuckin' on a bitch that's classy\nYeah, the dick was good, she harassed me\nYeah, then I nutted on them ass cheeks\n2's, 3's, 4's and 5's, eight hunnid, nine hunnid on mine\nI commit crimes all the time, I convince my homies to slide\nTake this pistol, you down to ride?\nCock the pistol, it's hammer time\nPaparazzi, I'm tryna hide\nFuck the bitch, she traumatized\nYeah, just when thinkin' you surpassed me\nYeah, me and Mustard link and we go hammy\nYeah, we both 'bout to cop the Lambies\nYeah, valet the '64 at the Grammys\n\n[Chorus: YG]\nHop in the coupe, subtract the roof like what it do?\nHeard you don't like me, well nigga fuck you too\nHeard you tryna wife her up, I'm tryna pipe her loose\nAll my niggas got stripes (rah!), sabertooth\nBig Ps, Big Bs, nigga suu whoop\n(Brr, brr) Hello? What it Ru?\n900 block, back down to the deuce\nI'm the man, bitch I walk 'round like I'm bulletproof\n\n[Verse 2: Jay 305]\nOoh, Jay 305, why you extra'd out?\nOoh, pull up to your house to pack your daddy out\nYeah, sexy lil' vegan want it right now\nShe don't even eat meat, but she gon' eat it now\nOoh, devil on my back and I'm set trippin'\nI got stabbed six times, homie my mind different\nStay Dangerous in LA, if you gang affiliated\nSouth Central most hated, watch out\nOoh, Khloe Kardashian in my t-shirt\nFor you hatin' ass nigga, I know that gotta hurt\nGhetto superstar since I was 16\nNow I got a billboard on Crenshaw and King\nYeah, all around the world like Ice Cube\nPimp a bitch, fuck peace in all my interviews\nGettin' rich, fuck a bitch, cracker fuck your rules\nPorsche coupe, two bitches, I'm the fuckin' truth\n\n[Chorus: YG]\nHop in the coupe, subtract the roof like what it do?\nHeard you don't like me, well nigga fuck you too\nHeard you tryna wife her up, I'm tryna pipe her loose\nAll my niggas got stripes (rah!), sabertooth\nBig Ps, Big Bs, nigga suu whoop\n(Brr, brr) Hello? What it Ru?\n900 block, back down to the deuce\nI'm the man, bitch I walk 'round like I'm bulletproof", "title": "BULLETPROOF"}]}