{"artist": "Benzino", "songs": [{"lyrics": "[Benzino]\nUh, yo (We!)\nUh-uh, uh uh uh\nUh-uh, uh uh uh\nUh-uh, uh uhhh!\nMr. Gzus, Twice Thou\nRay Benzino!\n\nI spit that thug shit, the whole world wanna bang to\nAmazin, Mr. Benzino from the Made Men\nHalf Peurto Rican, half black, still blazin\nSteel bangin on the handle of my gun\nI be Hangman (Hangman), Mr. Bang-bang man\nCatch you in your hall, while you Mr. Slang-thang man\nFold you up like a bangy pair of Guess jeans\nI guess you know what I mean, 9-15\nBe the murderer, niggas that I be rollin with\nControl shit, we thirty dirty deep Bonie clique\nLight that blunt, burn that hash, keep it movin yo\n(Made Men catch wreckin anybody studio)\n\n[Twice Thou]\nYour days are numbered nigga (what?) you better bounce\nGot thirty-two rounds in my twenty ounce\nBlue nickel, new pistol performs in the physical form\nSqueeze slugs 'til the gun jam, any mission I'm on\nBlack leather doo-rag, two Mags with speed loaders\nI'm a weed smoker, my cylinder spins, chillin ya mens\nLoudmouth niggas catch it the worst, for example\nI'll shoot the shit out of you -- and ya man too\nLeave ya bodies in the gutter, cut up for the streetsweeper\nHack you the fuck up with a meat cleaver, retreat nigga\nTake a seat dog, while we bang to this beat dog\nOr pose, I'll pump holes in ya meat dog\n\n[Chorus]\nTo city kids and pretty bricks, saditty chicks\nHood rats and them killa cats, we reppin y'all\nFor niggas that's locked for 'ricks\nGD's on blocks that got nine's to spit, we reppin y'all\nThese streets that be keepin it real, throwin money in ya grill\nStrapped with the steel, we reppin y'all\nTo niggas that's gettin mil's, playin ball\nAll my ladies and all my dogs, we reppin y'all\n\n[Mr. Gzus]\nI'ma keep it crackin like the Earth from it's axis\nNon-stop spittin hot shit with no practice\nWith this iron, I'm a blacksmith\nWith shit to make ya backflip\nFrom the clap you do the twist and then you don't exist\nJust for being a hostle, thug imposter\nOn sight, fuckin pop ya (Pow!) Drop ya\nHit a nigga proper with these shells made of copper\nHollow's, Made Men what? The gunfire follow\nMy sharp shooters mentally ill, in Bentley's we chill\nGot cash and bought everything we ain't steal\nAnd many clips to fill cuz these streets stay real\nWe bring the heat, now you know how gettin burned feel\nYo get peeled\n\n[Benzino]\nWe stack right?\nBenzino catch you while yo creepin, try yo' best right?\nJust make sure you don't get caught sleepin, whistle deaf right?\nYou not believin what you seein, infrared right?\nYou niggas dead right? Slippin in clips right?\nThese niggas wanna go to war, it's time to ride right?\nBut when it's time to get it on they run and hide right?\nThey gonna make me run up in the crib and flip right?\nMy niggas rip right? See I'm on top now\nAnd if you wanna fuck around then you'll get shot now\nDon't let me send my Boston niggas to your block now\nThen make 'em strip you to your knees and take your Glock now\nWe got it locked now... (Nigga)\n\n[Chorus]\n[Repeat to fade]", "image": "https://images.genius.com/ab64bde2620df28863f2c6355a1da426.600x600x1.jpg", "year": null, "title": "We Reppin Y’all", "album": "The Benzino Project"}]}