{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/MV5BMTY0MDY3MjQxN15BMl5BanBnXkFtZTcwODQ2NzE1NA@@._V1._SY314_CR11,0,214,314_.jpg", "title": "Can I Live", "album": null, "year": null, "lyrics": "[Nick Cannon]\nCan I live?\nI'm talking, ma\nI know this situation is personal\nBut it's something that has to be told\nAs I was making this beat\nYou was all I could think about\nYou heard my voice\nYeah, uh huh\nJust think, just think\nWhat if you could just\nJust blink your self away\nJust, just wait, just pause for a second\nLet me plead my case\n\nIt's the late 70's, huh\nYou seventeen, huh\nAnd having me, that will ruin everything huh\nIt's a lot of angels waiting on their wings\nYou see me in your sleep so you can't kill your dreams\nThree hundred dollars, that's the price of living? What?\nMommy, I don't like this clinic\nHopefully you'll make the right decision\nAnd don't go though with the knife decision\nBut it's hard to make the right move when you in high school\nNow you gotta work all day and take night school\nHopping on the bus and the rain is pouring\nWhat you want morning sickness or the sickness of mourning?\nCan I live?\n\n[Hook - Anthony Hamilton]\nI'll always be a part of you\nTrust your soul, know it's always true\nIf I could talk I'd say to you\nCan I live?\nCan I live?\n\nI'll always be a part of you\nTrust your soul, know it's always true\nIf I could talk I'd say to you\nCan I live?\nCan I live?\n\n[Nick Cannon]\nI'm a child of the king, ain't no need to go fear me\nAnd I see the flowing tears so I know that you hear me\nWhen I move in your womb that's me being scared\nCuz who knows where my future holds\nYo, the truth be told you ain't told a soul\nYo, you ain't even showing, I'm just two months old\nThrough your clothes try to hide me, deny me\nWent up three sizes, your pride got you lying\nSaying ain't nothing but a migraine\nIt ain't surprising you not trying to be in Wic Food lines\nYour friends look at you funny but look at you mommy\nThat's a life inside, take a look at your tummy\nWhat is becoming, ma? I'm Oprah bound\nYou can tell he a star from the Ultrasound\nOur spirits connected, doors open now\nNothing but love and respect\nThanks for holding it down, she let me live\n\n[Hook]\n\n[Hook]\n\n[Nick Cannon]\nIt's uplifing for real, y'all\nI ain't passing no judgement, ain't making no decisions\nI'm just telling y'all my story\nI love life\nAnd I love my mother for giving me life\nWe all need to appreciate life\nAnd a strong woman who had to make a sacrifice\nThanks for listening\nThanks for listening!\nMomma, thanks for listening"}], "artist": "Nick Cannon"}