{"songs": [{"year": null, "image": "https://images.genius.com/929cacd7483396413e8968b427318292.968x968x1.jpg", "title": "Quiet On Tha Set", "album": "Straight Outta Compton: N.W.A 10th Anniversary Tribute ", "lyrics": "[Fat Joe] Terror Squad!!\n\n[Big Punisher]\nThis is goin' out to the mothafuckin' punks and broke ass tricks\nDon't Tryin' to come up in here\nUp in here pumpin' that shit, I will straight blast you\nYou better break yourself mothafucker\nShit!! punk ass tricks, bitch\n\nTake it hard ---] Eazy-E\n\nYo, kick it ---] Eazy-E\n\n[Big Punisher]\nRuthless, plenty of that and much more\nSo at the party, Terror is controllin' the floor\nThat you step up and do your dance routine\nIt ain't a dream my man, you're in a gangster scene\nWith a villain, doin' damage on a 24 track\nWith confusion to finish my conclusion\nArhytomatic rhymes from a Radio cat\nYou can't take what I got\nCause I'll be takin' it right back\nRuthless gangster ---] MC Ren\nCold killin, you wanna know what it means?\nDefinition... Villain ---] MC Ren\nWith the stupid dope rhymes\nAnd once you hear one line, you can tell it's mine\nWith a baseball cap that's black that I'm wearin'\nAnd a look that keeps you all starin'\nAnd wonderin, why I'm invincible\nBut when you hear my rhyme, it's convincible\nI don't take no shorts, while I'm constructin' the ground\nThat makes you movin' around, from the hell of the sound\nGirls drool on me like a dyin'\n\n[Ant Banks]\nPun, tell them what you do when your ass start rhymin'\n\n[Big Punisher]\nI go to the party, I hip and hop the spot\nI don't know what it is, but the girls kept knock the aspirin'\nLike they're on fire and\nTheir so-called boy friends with them are retirin'\nAnd for this reason I'm a walkin' threat\nSo when I step on the stage, I want quiet on the set\n\n[Break: Ant Banks scratching inarticulated Public Enemy's quotes]\n\n[Fat Joe]\nNow to get started with my musical profession\nA gangster feelin' in mind is in session\nThe way that I'm referrin to this, makes you move your butt\nBut don't stand in a daze, you should know what's up\nAnyway, I keep the clappin' along\nCause nothin' bad could go wrong because this track is so strong\nI'm like throw you the.. you can ask for anythin' more\nWhen the Terror Squad is cold rockin' the floor\nLike stupid, actin' like a retard\nWaitin' for a bumrush, gettin' to the good part\nIt tips me so with temptation\nWritin' my lyrics with hyped information\nThis is just a section of my creation\nSo don't say shit with finesse fination\nJust look at the center of the stage where the spotlight shines\nIt's mine, unpredictable, keepin' you extremely enjoyed\nIt's irresistable, meanin' that you can't avoid\nAnd while I'm on stage, feel forward to sweat\nWhenever I rip it up, I want quiet on the set\n\n[Break: Ant Banks scratching quotes below]\nYeah, what?, what?\nTerror Squad, Terror Squad\nYeah\n\n[Unidentified Artist]\nNow I can be loud as hell, you think I will? Never\nSsssht, quiet on the set ---] Eazy-E\nYeah, I like that better ---] MC Ren\nWord ---] Dr. Dre\nThat's what I can do, I think I earned respect\nAnd if I didn't from you, that's what I expect\nCause if it ain't rough, it ain't me, it ain't me ---] Eazy-E\nSo who really cares how you want me to be?\nSee, I'm just me, standin' at the top of the pile\nAnd doin' soft known tunes, just ain't my style\nAnd this concludes our program\nOf how The Terror Squad makes the Ruthless Jam\nNow first, we take an average Gun\nGive it to Pun, and the boy gets dumb\nIt's no secret, that I sit alone at night\nPick up the pad and the pen and begin to write\nAnd lay down the lyrics that's promised to play\nHear everybody says:\n\n[Break]\nCheck it in, check it out\nPut it in, take it out\nMake it out, yeah, Terror Squad baby\nWhat?, what?, what?\n\n[Cuban Link]\nYeah, now Cuban Link is here workin' like super glue\nNo matter what I do, I'm always thinkin' of you\nCause I'm the pusher, supplyin' the fix\nAnd this jam's so dope, it don't need a remix\nBut I'm makin' obstacles, an enemy traps\nTo catch any Emcee, with the weak-ass raps\nCrucifyin' their data, cause you're usin' my name\nThe definition is pain, but that's the thing of the game\nIf they tried to retreat, I catch them one at a time\nCause they're comittin a crime, but still promotin' a rhymes\nSo, you're in the back of me, just listen and learn\nBecause you'll all get a chance, or maybe a turn\nMy sideman wants to give a preview\nSo at my next concert, I wanna see you there\nNot sittin' in a chair, standin' on both feet with your hands in the air\nNow I'm about to get out, but I'll be back\nBut next time expect the more funkier track\nDeep down for your enjoyment, to hear more percussion\nWith lyrics that's smooth, to start some discussion\nTo prove that I'm hype, now, you know that's a bet\nSo continue to dance, Cuban blew up the set\n\n(*Explosion*)"}], "artist": "Big Pun"}