{"songs": [{"year": null, "image": "https://images.genius.com/a822e5595fc1eee33d5cbbfa1ae70b68.500x500x1.jpg", "title": "Problems", "album": "Delightful Bars", "lyrics": "[Intro: High-pitched voice effect]\nYeeeeah.. hah, hi haters\nGuess what, I'm baaaaaack!\nI know you niggas missed me man\nI know you missed me, you know how I know?\nCause my name stay in your fucking mouth\nYo, listen up, uh\n\n[Rapper Big Pooh]\nMuh'fucker think quick, I don't do much but talk shit\nSwallow spit, that's my life\nI can hear the people now screaming \"Damn, he trife\"\nFive years since the +The Listening+ and I can't change?\nGuess what, priorities rearrange\nGot fam looking at me like \"Damn, you strange\"\nAfter all this time I couldn't stay the same\nHad to get a new picture, I just kept the frame\nIn a whole new zone, so when you hear me speak\nIt's a whole new tone, yes I am prone\nTo tell wannabe rap niggas go home\nWho pop a lot of shit till they standing alone\nLook, I stand tall whether wrong or right\nDon't do petty shit, keep it out my sight\nFor the right cause homie, yes we do fight\nIf you seeing all of us then it's not your night, right?\n\n[Hook: Jozeemo] + (Rapper Big Pooh)\nI hear 'em talking like \"You got a prob\"\n(You better know I'm always on my job, now everybody like..)\n\"We don't really want no problems B\"\n\"Have our name in the obituary column sheets\"\n(Ay, I heard 'em say \"You a bastard case\")\nThey better chill 'fore I blast the place, now errbody like..\n\"We don't really want no problems B\"\n\"Have our name in the obituary column sheets\"\n\n[Jozeemo]\nMy last name Murder, it ain't Bradley, it ain't Parker\nI ain't got no brothers, fuck +Danny+, I don't wear no +Glovers+\nBold with it like the Catholic who be cussing in church\nMy bitch stay hot, chinky eyed, dutch in her purse\nFucking with me, believe you'll be stuck in a hearse\nThe doctor couldn't save your life cause I was fucking his nurse\nIn love with the dirt cause clean just really ain't my style\nA bastard cause I told your moms you really ain't my child\nBitch I pulled out, like I did with the MAC millie\nFool with the tool, get abused when I act silly\nThat'll really make the whole situation jacked up\nJo' be the period when pussies wanna act tough\nBleed you, whole plate of hollow points to feed you\nDolo for the dance cause your partners chose to leave you\nHow a felon walk around with guns, ain't that illegal?\nMind your business fuck boy, I'll see you when I seek you\n\n[Hook: Jozeemo] + (Rapper Big Pooh)\n(Ay, I heard 'em say \"You a bastard case\")\nThey better chill 'fore I blast the place, now errbody like..\n\"We don't really want no problems B\"\n\"Have our name in the obituary column sheets\"\nI hear 'em talking like \"You got a prob\"\n(You better know I'm always on my job, now everybody like..)\n\"We don't really want no problems B\"\n\"Have our name in the obituary column sheets\"\n\n[Rapper Big Pooh]\nYeah, you don't really want no problem with the team man\nH.O.J. Hall of Justus, we ride heavy, uh\nIllmind on production of course nigga"}], "artist": "Rapper Big Pooh"}