{"artist": "Drake", "songs": [{"year": "2011-09-10", "album": "Care Package", "image": "https://images.genius.com/4cd65ec7b52771ff83e55d19485cea0a.1000x1000x1.jpg", "title": "Club Paradise", "lyrics": "[Intro]\nHa, yeah\n\n[Verse 1]\nThey say that all your old girls got somebody new\nI said, \"Damn, really? Even Rosemary? Even Leann Sealy?\"\nThey said, \"Fucking right, they were the first to go\"\nIt's nothing personal\nIt's just that all them women that you slept on been working though\nThey've been saving up, new niggas came around, they been waking up\nWith \"I swear, you don't know this city anymore\nThey might have loved you before\nBut you're out here doing your thing, they don't know you\"\nAh, sure they do, they just not as sincere\nIt's crazy all the emotions forgot in a year\nShe like, \"Why you even give a fuck, you not even here?\"\nWell, out there there ain't nothing for me and I think I need to come home\n\n[Chorus]\nTell me, who did I leave behind?\nYou think it got to me, I can just read your mind\nYou think I'm so caught up in where I am right now\nUh, but believe I remember it all\n\n[Verse 2]\nI be with my nigga Chubbs, he in love with street shit\nNo wonder why I feel awkward at this Fashion Week shit\nNo wonder why I keep fucking up the double-cheek kiss\nAnd long for that ignorant Young Money Miami Beach shit\nCouple artists got words for me, that's never fun\nThey say it's on when they see me, that day don't ever come\nI'm never scared, they never real, I never run\nWhen all is said and done, more is always said than done\nAnd I was told once, things will change\nBy a nigga named Tip when my deal came\nTold me it's all good, even when it feel strange\nNow I'm that guy that know them strippers by their real names\nRochelle, Jordan\nThick bitches, they just talked me out of four grand\nHow'd a pile of kush become a mountain of truth?\nHow'd a bottle of wine become the fountain of youth?\nDamn, my biggest fear is losing it all\nRemember how I used to feel at the start of it\nAnd now I'm living a muhfucking fairy tale\nAnd still trying to keep you feeling a part of it\nYeah, just lie to my ears\nTell me it feel the same, that's all I've been dying to hear\nLights get low and that's when I have my brightest ideas\nAnd I heard my city feel better than ever, that's why I gotta come home\n\n[Chorus]\nTell me, who did I leave behind?\nYou think it got to me, I can just read your mind\nYou think I'm so caught up in where I am right now\nUh, but believe I remember it all\n\n[Verse 3]\nMy mother is back to who she was years ago\nIt's like a new page me and her are beginning on\nI wish she'd stop checking up on women I can't stand\n'Cause I got new girls I could use her opinion on\nShe thinks I've become a slave to the wealth\nBut I'd never break the promises I made to myself\nAnd I would never make up names for myself\nThen change the names that I just gave to myself\nCertain rappers would call me to say \"What up, though?\"\nI used to brag about it to my friends\nAnd now I'm feeling like all of these niggas cutthroat\nAnd maybe that's all they do is just pretend\nDamn, but I bought it though, I believed it\nYeah, I thought it and I achieved it\nYeah, so show me love, show me fuckin' love\n'Cause I thought it was all I needed\nYeah, clearly I was wrong about it all along\nAnd this'll be the year that I won't even feel shit\nThey trip off the amount of people that I brought along\nBut I'm just trying to be surrounded by some real shit\nNeed credentials for every one of these Toronto kids\nI promised they'd see it with me, we just trying to live\nI told 'em we about to get it and we finally did\nListen closely to my shit, I swear it's sounding like home\n\n[Chorus]\nTell me, who did I leave behind?\nYou think it got to me, I can just read your mind\nYou think I'm so caught up in where I am right now\nUh, but believe I remember it all\n\n[Outro: Bob Marley]\nWell, you see, the way I feel about the music, it can be copied, you know?\nBut, it’s not copy do it, it’s the feel, you know? It carry a feel\nWell, you ask plenty musicians – them know it, but them can't do it\nSome people still searching for this truth here"}]}