{"artist": "Cappadonna", "songs": [{"title": "Milk the Cow", "album": "The Pillage", "year": "1998-03-24", "image": "https://images.genius.com/a0de9ba12455d35ac16b7d5a8d3a6379.500x500x1.jpg", "lyrics": "[Verse 1: Cappadonna]\nLet us milk this cow, the best way we know how\nPark Hill projects, chicka-POW\nOne culture, return of the track slasher\nDouble doser, Cappadonna broadcaster\nStrivin for perfection, the only way I got\nMy life back was through investin, devotion\nMovin my soul toward the skit, vocabulary\nComin out my ass like shit, to feed my babies\nI gotta fight y'all MC's, this money\nBe gettin me high just like cheese in these tracks\nI milk for all my childhood, make me feel good\nSo I keep on writin meditatin in the ghetto\nMakin love waitin for lost minds to settle\nThen I speak out, because we all need the guidance\nDeep down inside us where you could define science\nMy mother told me, when I was so stressed out\n\"All you gotta do is just put your best out\"\nAnd I did it, milky\nMilk this cow (2X)\nMilk this cow, the best way we know how\nPark Hill projects, chicka-POW!\n\n[Chorus: Method Man]\nHold your own nigga, Razor Sharp with the art\nDon't gettin blown nigga, throwin darts at the charts\nDanger Zone nigga, Cappadonna\nYou know the stee' potnah, Wu-Tang death before dishonor - what?\n\n[Verse 2: Cappadonna]\nYo, new Cappadonna is about to exhale kid\nHold all the phone calls, stop all the mail\nCappadonna raise hell, speak and I broke the shells\nSeen brothers that fell when I slipped\nI had my alibi tight that night, up in the Hill chillin\nY'all'll get shot, move away things are too hot\nLook at my spot now, friends are exiled from close distance\nI flow persistence, every time I step up, I rip reps up\nKu Klux, my words swing around like numchucks\nThis ain't for big bucks, never can quit this rap shit\nIt feeds my seeds, I can barely breathe\nBut y'all cats better believe keep off, the darts are soft\nWhile I throw these missiles, at your skin tissue\nYou can't escape I absorb, gigantic crowds all aboard\nWatch out for shitty fraud, my darts slam like doors\nMakin it hard for you to get yours, selfish\n\n[Interlude: Cappadonna] (x2)\nMilk this cow, the best way we know how\nPark Hill projects, chicka-POW!\n\n[Chorus]\n\n[Interlude]\n\n[Chorus]\n\n[Outro: Method Man]\nBad birds that fuck nerds! *inhaling*\nHah! *inhaling*\nSuck a dick up til ya hiccup motherfuckers!\nThe swarm continues, Wu-Tang Killer Beez\nCappadonna Cappucino, the Donna-mite\nCame to treat your earpiece right\nY'all better recognize and realize\nHot Nixon, playin my position, bitch!\n\n*gunfight*"}]}