{"songs": [{"title": "Lemme Freak", "album": "Professional Rapper", "year": "2014-09-17", "image": "https://images.rapgenius.com/16a5f27e41e576f7114675c486ebb960.640x640x1.jpg", "lyrics": "[Verse 1]\nDrunk, faded\nBrowned out, looking all shady\nTwo months since I fucked a lady\nYoung Man dick going crazy\nStandard Saturday\nI'm about to get a cab and masturbate\nThen I see a hot girl look back at Dave\nLemme get your cat girl, no Hathaway\nThat's what I thought not what I said to her\n'Stead I walk up to her like, \"I know you heard of the kid\nYou heard what I did, you heard of my shit, the murderous spit\"\nShe's like, \"Naw, you're being weird, what are you talking about?\"\nI'm like, \"Aw...\" Pulling out my phone like a boss\nYouTube 'bout to get her off\nBut as I type the y-o-u, some porno pop up\nI'm like, \"Hold up, how did... that's not even me\nLike, I don't jerk off mobily...\"\nThen her friends coming up and wanna know if everything is okay\nI'm like, \"Naw, this a rape, you can't tell?\nGimme a break, please. Get the heck away.\"\nI turned to her, \"Let me buy you a drink,\" she like, \"Fine.\"\nTold the man, \"Two Patron,\" she like, \"Lime.\"\nSaid he tried twice, the card got declined\nI'm like, \"Alri—, is this a—\nCould it be a machine issue?\" He was like, \"Naw,\"\nI was like, \"Obviously there's something wrong\nI got dough, like I'm not broke...\nI got donuts with the same card like about an hour ago.\"\nHe like, \"Dude, I don't know.\"\nNow I'm looking at the girl she just wanna go\nAnd I ain't talking 'bout with me, bro, I mean alone\nI got one more chance to prove myself\nSo I'm like\n\n[Pre-Chorus 1]\n\"Look, I'm athletic, girl, I've gotten several Rec League MVP's\nAt my crib I've got some pizza, plus a little bit of weed\nIn my room I've got a TV, plus I recently did sheets\nGirl, I even have a fridge that has the water on the door\nLike with the crushed ice\"\n\n[Chorus]\nYou know I don't give a damn what your plan right now\nThis is me coming at you as a man right now\nLemme freak, lemme freak, God dammit, lemme freak\nJust lemme freak, please God, just lemme freak\n\n[Verse 2]\nThe girl from the first verse\nSomehow let me fuck\nFast forward, seven months, we in love\nSome real serious relationship type shit\nDespite this, I ain't fucked for days\nTried last night, but was pushed away\nBut I've been acting well behaved today\nI smell okay, Adele Pandora's playing\nNow she laying on the floor\nAnd I'm praying this bitch is horny, I go and give her a smooch\nShe kissing Dicky back, so I play with her boobs\nBad move, she don't like that\nBad mood, her boss being mean to her\nVia email, she wanna write back\nI'm like, \"Right now?\"\nShe like, \"Yeah, what do I say, can you just help me?\"\n\"Oh, okay, what's the context?\"\nThen she like, \"Well, he talks to Jane before coming to me.\"\n\"Who's Jane again?\" I said,  she like, \"Wow, you should know that...\"\n\"Okay, I guess I forgot,\" she like, \"Dude, that's my other boss.\"\n\"Okay, true, so shouldn't your first boss\nGo to the other boss, before you? Right?\"\n\"But Jane isn't hands on!\" she yelled\n\"Okay, well I just don't understand the dynamic then\nI don't work with these people.\" She started crying\n\"Wait stop, what the fuck is this?\"\n\"Naw, you don't ever take my side.\"\nAbout an hour later 'til I'm on her good side\nWe in bed, hands on her good thighs\nI try to kiss, she like, \"Good night\" but I'm like\n\n[Pre-Chorus 2]\n\"Look, I just turned off The Departed for a movie 'bout a bee\nI've been cutting back on farting, tweeting, arguing and weed\nYesterday I wore a cardigan at dinner with your sweet\nAnd supportive aunt during the fourth quarter, of the Eagles\nNow reward it.\"\n\n[Chorus]\nYou know I don't give a damn what your plan right now\nThis is me coming at you as a man right now\nLemme freak, lemme freak, God dammit, lemme freak\nJust lemme freak, please God, just lemme freak\n\n[Verse 3]\nFast forward some more, June 16th, 20 74\nOld LD looking old as fuck, still with the same ho, holding up\nBut my life sucks, legs hurt, friends dead, real terse\nMy dick looking like it's tinfoil\nHer tits looking like they hard boiled eggs\nOn top of that, she insane\nLike, I don't even think she knows who I am\nOur kids moved away, we've been doing the same shit for days\nMaybe months, who knows, probably going to die soon\nPretty scared, I ain't even gonna lie to you\nThink about it all day, on my last legs\nBut I'm going out with a bang\nI got pills they invented back in '57\nI took five, that's a bit excessive\nI look high, take a look at my thighs\nAnd good God that's a little erection, it'll work though\nNow I've gotta find the ho, I'm pretty much blind at this point\nI don't know if I mentioned that yet, but I am\nMade my way into the bedroom and there she is, I'm like\n\n[Pre-Chorus 3]\n\"Look, I don't know if you're aware that\nYou've been throwing out my shoes\nWhat I do know is, I'm sick of doing nothing here with you\nAll my blood is in my dick, I'm probably dying pretty soon\nAre you even comprehending what I'm saying\nPlease acknowledge that you hear me...\"\n\n[Chorus]\nYou know I don't give a damn what your plan right now\nThis is me coming at you as a man right now\nLemme freak, lemme freak, God dammit, lemme freak\nJust lemme freak, please God, just lemme freak"}], "artist": "Lil Dicky"}