{"songs": [{"year": "2010-07-13", "album": "Troubadour", "image": "https://images.genius.com/2d335571e608b43f30bd8a89e1fa6d38.1000x1000x1.jpg", "title": "Somalia", "lyrics": "Uh\nYeah\nSomalia\n\n[Verse 1]\nYeah\nI spit it for my block\nIt’s an ode, I admit it\nHere the city code is lock and load\nAny minute is rock and roll\nAnd you rock and roll\nAnd feel your soul leavin’\nIt’s just the wrong dance\nThat'll leave you not breathin’\nI’m not particularly proud\nOf this predicament but\nI’m born and bred\nIn this tenement, I'm sentimental, What?!\nPlus it’s only right to represent my hood\nAnd what not\nSo I’m about to do it in the music; in the movies\nCut to the chase pan across to the face\nI'm right there\nFreeze frame on the street name\nOops wait a minute\nThis is where the streets have no name\nAnd the drain of sewage\nYou can see it in this boy how the hate is brewin’\nCause when his tummy tucks in\nFuck the pain is fluid\nSo what difference does it make\nEntertaining threw it\nSome get high mixing coke and gun powder, sniffin’\nShe got a gun but could have been a model or physician\n\n[Hook 2x]\nSo what you know bout the pirates terrorize the ocean\nTo never know a simple day without a big commotion\nIt can’t be healthy just to live with a such steep emotion\nAnd when I try and sleep, I see coffins closin’\n\n[Verse 2]\n\nYeah\nYeah\nWe used to take barb wire\nMold them around discarded bike tires\nRoll em down the hill on foot blazin’\nNow that was our version of mountain bike racing\nDaammn!\nDo you see why it’s amazing\nWhen someone comes out of such a dire situation\nAnd learns the English language\nJust to share his observation!\nProbably get a Grammy without a grammar education\nSo fuck you school and fuck you immigration!\nAnd all of you who thought I wouldn’t amount to constipation\nAnd now I’m here without the slightest fear and reservation\nThey love me in the slums and in the native reservations\nThe world is a ghetto administerin’ deprivation\nBut mommy didn’t raise no fool did she hoyo?\nI promise I would get it and remain strictly loyal\nCause when they get it then they let it all switch and spoil\nBut I just illuminated it like kitchen foil\nA lot of main stream niggas is yappin’ about yappin’\nA lot of underground niggas is rappin’ about rappin’\nI just wanna tell you what’s really crackalackin\nBefore the tears came down this is what happened\n\n[Hook 2x]"}], "artist": "K’naan"}