{"songs": [{"title": "Head Bussa", "album": "The King of Crunk & BME Recordings Present: Lil’ Scrappy", "year": "2004-02-24", "image": "https://images.genius.com/6851a699ae4a0e7001aafbfb7d5bc40c.1000x1000x1.jpg", "lyrics": "[Intro]\nPut yo' hand wit yo' fist up\nPut yo' hand wit yo' fist up\nPut yo' hand wit yo' fist up\nRight about now (what's up?)\nPut yo' hand wit yo' fist up\nWe need y'all to rise (rise)\nFor the International Head Bussas Anthem (Head Bussas)\nLil Scrappy (Lil Scrappy)\nLil Scrappy, BME Click\nMe? Who are ya? I'm Lil Jon\nOkay\n\n[Chorus]\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\n\n[Verse 1]\nI made up my mind that I'm ready to strike and I'm ready to fight\nTakin' out my steel killin' every fuck nigga in sight\nWe expite, I knew you bitches didn't wanna brawl (uh what you say?)\nBitch I'll swang on all of y'all\nI'm the beast from the east, wit the fangs on my teeth\nI'll murder all of y'all bitches in the middle of the street\nAnd I don't give a fuck if you don't like me\nStraight knock yo' ass out into cap-tiv-ity\nDown south, I'll ride, shoot and kill homicide\nIt be nothin shawty till the day that I die\nWe strive, on tearin heads up!\nAnd everywhere we go we gon tear dat bitch up\nWe don't give a fuck about havin no click\nDa A got my back and ain't takin' no shit\nExcuse me shawty, get the fuck out my face\nBefo' we get mad and shoot up the whole place\n\n[Chorus]\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\n\n[Verse 2]\nI speak my mind, cause bitin my tongue hurt\nMurder yo' ass wit lyrics and put yo' face on a shirt\nI'm a motherfuckin rider, cause I thought y'all knew\nI ain't run from nothin' even if it's twenty of you\nI think it's plenty of you that really want the shawty dead\nBut watch what ya said lil shawty, I'm makin' bread\nFuck all y'all born haters wit the hatred blood to match\nA long way but plus I run with G's and gats\nAnd shawty matter of fact these trill G's be thugs\nWe ain't talkin behind yo' back and we ain't scared to bust\nI'm by myself, but bein alone makes you strong\nI stepped off the porch young, so shawty I been grown\n\n[Chorus]\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\n\n[Verse 3]\nATL off the chain down here\nYa come wit dat yappin and no action, you gon' disappear\nYou walk in the club, it's tight like brass knuckles\nStraight elbowin haters like we jumpin off turnbuckles\nBeatin in ya door with dat clip on the tech\nBeatin down ya block in that 89' Chevy\nTell that stupid boy we throwin' 'bows and we ready\nScreamin' \"swang shawty\" to dem boys dat can't stand me\nYeah shawty - I'mma ATL slugga\nKnockin' off heads on you pussy motherfuckers\nShawty be sayin', \"Scrap, you a cool boy!\"\nBut I know in my heart dat I'mma head bussa boy! (Head bussa!)\n\n[Chorus]\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas\nWe some head bussas, we some head bussas\nWe'll knock a hater out, we some head bussas"}], "artist": "Lil Scrappy"}