{"artist": "Cage", "songs": [{"title": "Boston Crabs", "album": "Extra Beef Value Meal EP", "year": "2003-01-01", "image": "https://images.genius.com/f5d8ba970ee96238cfdc222539381aff.600x600x1.jpg", "lyrics": "'Brick, that's the name of my pit\nCall that dog shit records\nBrick records, no game of chess\nYall playin dip checkers\nBottle of mo no dough, but mo problems\nDangerous connection: you in ya boys ass with no condoms\nGet back to research get clapped for free merch\nThen cover the bodies with them fake Stetsasonic t-shirts\nWatch me fuck this herb up from the curb up\nTo his fitted, sic my pitted on his bit, Kube chew that bird up\nYou speak real words but can't finesse this shit\nAnd Rebel INS would ??? inspect this dick\nOpen your eyes, tell me what do you see?\nCouldn't be E.C. so you do beats\nFor college hoops on the WB, and you fucking with me?\nI have you clipped for a bag of D and I'm puffin it free\nPass around your mans' powder\nGet your five fans louder\nBut your bitch don't say shit\nGargling Cage clam chowder\nIn and out her with a New York frank\nLet's fight grandson\nYour pops lotto dough got you looking like ransom\nYou think up long\nFive months later got a linked up song\nThat sound like the vocals are synced up wrong\nCheck, never selling Esoterrible for boring gentle shit\nTrying to eat off Cage like some nude oriental chick\nYou need a firehose to get that shit off of the shelves\nLeft a crumpled up rap trail lost in my twelves\nWishing death on me sounding like my ex ho\nWasted verses on haters, me and Copy collect those\nGet milk to sponsor the \"where's he been tour\"\nCame to the rap mecca and had to cancel every in-store\nWent to Fat Beats hoping to blast a few clips\nI had to put the ass back in Massachusetts\nDaddy poorbucks got you fronting with his agents\nWhy you bringing up Pete Nice when you running with his cadence?\nTried to pull my dog's collar my dog hollered\nLook at Richy Rich trying to fight a pit with his dog Dollar\nLeaders of the Weathermen will clap iron\nLike the Cobra Commander bucking Megatron out the Black Lion"}]}