{"songs": [{"year": "2015-09-04", "album": "Only Way Is Up", "image": "https://images.genius.com/3b1383e768b84255f7aee1d94135fee4.680x680x1.jpg", "title": "Change", "lyrics": "[Verse 1: K Camp]\nI was six years old\nRiding shotgun in an old school with my dad\nMemories that I hold on to\nCause really those the only ones that I had\nThey used to call me Lil' Rock\nSkinny big head nigga with a rock\nAnd I ain't talkin' 'bout the hard\nEven though my fam used to keep the grams in the socks, damn\nIt was me, lil Brandon and Nene\nOutside running wild, fuck TV\nOn 13th all the way the 49th and Chambers\nShout out to my lil cuz Veve\nAnd my uncle Jerome\nOne time for my uncle Jerome\nIn the basement smoking cigarettes with Tyrique\nI think we did that when unc wasn't home\n47th and Lloyd, first time I got jumped on the porch\nHit the oldest one with the one two, bink bink\nOther one ran up, left him right there on the porch\nHell is you saying? Lil Jeff turned me into a man\nThat was big bro, that was big cuz\nEverything to a nigga now he gone\nGuess God had a plan I don't understand\nLord why you do me this way? You live and you learn\nThem tables will turn, them bridges will burn\nBut through it all, just make a way\nI'm here to stay and I'ma do it for my city like the mayor\nReal northside nigga living life like my grandaddy Charles\nHe the reason why a nigga is a player\n\n[Hook: K Camp]\nLet me talk to 'em, yeah, hah\nPlenty nights when I felt all alone, nobody to lean on\nListen up, let me tell you how it feel\nHah, look\nI just tell it how it is, everybody claim they real\nOn the real these niggas ain't ever been real\nStraight up, hah, look\nI'm just living my life, I'm just doing my thang\nSame nigga from the jump, baby I ain't gon' change\nHah, baby I ain't gon' change\nNah, nah, baby I ain't gon' change\n\n[Verse 2: K Camp]\nMan fuck everybody do you\nSame lil nigga that they said wasn't gon' be the shit is the shit\nWho knew?\nStill ridin' 'round with my day one niggas\nWe don't need new niggas in the crew\nOne time for my nigga Dan\nThat was my first friend second grade Miss Blue\nI don't do too much\nNigga just say what's up, man salute when you see me\nThese niggas upset cause they heard I got next\nI keep cheese like Fellini's\nBack in the day I used to be a hot head\nLike I'm walkin' 'round with a beanie\nIn the middle of the summer\nI'm just tryna score, nigga, no time to fumble\nIt's game time, everybody on time\nWe just tryna get this money at the same time\nI ain't claimin' what ain't mine\nGot your girl on the edge like the state line\nAin't no mo play time\nWe just tryna get it off the muscle\nFighting for the money, how much hustlel\nI'ma get my bitch to respect my hustle forreal\nMan fuck everybody do you\nSame lil nigga that they said wasn't gon' be the shit\nIs the shit, who knew\nStraight up, hah, look\nI'm just livin' my life, I'm just doin' my thang\nSame nigga from the jump\n\n[Hook: K Camp]\nWhat's the point of getting that money?\nMoney ain't money if your life don't change\nWhat's the point of pushing that whip\nIf you ain't changing lanes?\nWhat's the point of having many girls\nIf your bitch don't change?\nWhat's the point of staying the same\nIf everything around you change?\nI've changed, I've changed, I've changed, I've changed\nI've changed, I've changed, I've changed, I've changed\nI've changed, I've changed, I've changed, I've changed\nI've changed, I've changed\nIf everything around you changed\nAll I need is change\n\n[Outro: Jeremih]\nYou don't need nobody, you don't need nobody\nThey don't want to be here, they ain't got to be here\nYou don't need nobody, you don't need nobody\nThey don't want to be here, they ain't got to be here"}], "artist": "K CAMP"}