{"songs": [{"year": null, "title": "Inner Conflict", "image": "https://images.genius.com/af357ab92dde48966f2efd2335518e9f.268x268x1.jpg", "lyrics": "I conflict with those who are tricked by the gimmick market and can't think with logic\nLogics are in the distance so I'm makin a pop hit hip hop is askin themselves why this kid talks shit\nIt's just I'm never breakin even so I throw an art fit\nSick of rappers sayin' fresh but stink like armpit and couldn't test a single member that's within our clique\nI'll bring it to you right now but you don't really want it\nI'm born to the sauce that make ya heart skip, if you rolled as much as you're told you'd get car sick\nA constant my pissed off audience is at your concert, sittin in the front row, get wet with what they all spit\nI'll be standin in the back hittin ya with a tall stick\nI could drown your ass in oil and still ya not slick\nWinnin over your fan base make em say \"aw shit\"\nRight in ya damn face, confidence, you lost it\n\nNow these super thuggy guns say bring that hard shit ... Inner conflict\nSimple simple Simon Simon says to sing the pop hit... Inner conflict\nCorny white boys just want jokes, this isn't a comic strip... Inner conflict\nStill I bring the conflict, I sing of conflict, I'm in a conflict... I'd rather be artistic\n\nPainting pictures with my words while freaking a tar pit, you're broad strokes are filed with lead, so what you're eating's toxic. With this poisonous self destruction you're feeling, stop it\nTaking more than god's name in vein making your beating heart quit\nPut you on the floor then pull the carpet out from under your feet and watch you drop quick, flying through the airwaves hit you in a drop kick on the WWF wrought his war tip\nRun up in your crib and watch that horse trip\nPlaying healthy mind games that keep her thoughts sick the plot is not the only thing I think is in this porn flick, once I'm done with her you really think she wants your dick?\n\nThat's not how I'd rather be\nThis is not who I would rather be\nThis is not what I would rather be\n\nI am not lit hittin on some club hoppin' bar chick, I star to flick name dropping on some super star trick, only for the sake of seein her jump on the jock quick simply get that cock trick spit what your mom drip. Back to these bastards who claim they got grip, take your finger off the safety and let your Glock click. Aim for the back of my fist, make it your target, stigmata. I let the blood from my palm drip, I've got to cold and sober(?) socials in the Arctic, I'll single-handedly rip through your family make it look like a mob hit, better stiff it if your biscuit got limp, I'll go down head first like Fred Durst for a hot lick of this lollipop stick\n\nSick of suckers thinking they can balk it. Hip-hop rip offs over a guitar lick. That little bitch has slit his wrists with his guitar pick. I stick to my convictions, it don't make me a convict, I compliment only those who deserve the prospect, never tried the chronic chucked the tire tonic, not your normal human assuming I'm bionic, bout to blow up listen to my inner time bomb click\n\nNow these super thuggy guns say bring that hard shit ... Inner conflict\nSimple simple Simon Simon says to sing the pop hit... Inner conflict\nCorny white boys just want jokes, this isn't a comic strip... Inner conflict\nStill I bring the conflict, I sing of conflict, I'm in a conflict... I'd rather be artistic", "album": "The Known Unsoldier...Sick Of Waging War"}], "artist": "Sage Francis"}