{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/p07777av8ss.jpg", "title": "Make it ruff, make it smooth - feat. k-dee", "lyrics": "Hey yo Cube\nMake it ruff\nCube, check it out\nWhassup?\nYo this bitch was suckin' my dick\nThen I told her?\nWhat?\nMake the music with ya mouth bitch\nBaby, baby\nYa like that\nMake it ruff\nNaw, make it smooth\nI make niggas say woof 'cause I'm in the coupe with no roof\nYa smell like somethin' 90-proof\n'Cause, I'm ruff, and nigga you can buck these nuts\nIf you comin' with that smooth shit, hardcore rules shit\nI make the hoes say hay each and every day\nBitch 'cause I'm the K-Dee, no I'm not a G\nMothafuckin' wannabe mack\nBut I'm smooth like that\nI gots ta buck, you, right on up, punk you lucky that cha livin'\n'Cause, I'm the unforgiven, I like power, ain't a damn thing funny\nI like pussy and money\nAnd I won't slam like Onyx or never ever stutter\nBut I'm b-b-butter\nLeader of the new school, you hardcore fool\nNigga make it ruff, make it smooth\nAnd I'm here\nMake it ruff, naw, make it smooth\nYou can lick me up and down till I yell stop, damn\nBitch ya missed a drop 'cause I don't play when I sway\nIt's the quicker picker upper\nA pro that moves slow before this hoe\nI'm quick to dump her, so eeny-meeny-miney-mo, where's my dough?\nI gots ta make a livin', I out ta get mo\nMoney, and got more nuts for ya honey\nSo come and break me off, this nigga's walkin' soft\nIt's the smoothness that make niggas move to this\nFor you ruffnecks, I'll check you with my tool and shit\nDon't sweat 'em, just let 'em play that hardcore role\nWe still cool but just make it smooth\nYou know what, it's like a jungle sometimes it makes me wonder\nHow I keep from goin' under?, I'm chocolate thunder\nRuff as sin, cuts on ya skin\nAnd I blend with the tracks, see I'm black\nK-Dee is the mack, matter fact\nNiggas hit me up with the C's and B's\nBut you don't wanna fuck wit these\n'Cause, I'll put 'em on ya\nAnd we'll have to wake ya mothafuckin' ass up with ammonia\n'Cause hardcore rap is always on the map and it don't stop\nDevoid of pop and if I drop another smooth hit\nIt'll still be hard 'cause I helped start this shit\nSo make it ruff, naw make it smooth\nMake it ruff, make it smooth\nMake it ruff, make it smooth\nMake it ruff\nNaw make it smooth\nMake it, make it ruff\nNaw make it smooth\nI hate when niggas get too fuckin' sexy on the track\nI'm pro black, well I'm a pro mack\nI like hittin' switches\nI love hittin' bitches 'cause I'm a player, hard rhyme sayer\nI thought you knew, but ain't no thang, you knew the way I swang\nCreepin', ain't no sleepin', ain't a damn thing changed\nI hit hoe after hoe with this laid back shit\nFool, I kill at will and still can fade that shit\n'Cause, it's the predator\nI had it, yes a nigga watch yo step\nYou in a gang like star, tryina get a rep\nIt ain't no sweat for me to buck, buck nigga don't give a fuck\nYou better duck, duck or get your ass stuck, stuck\nDon't let the smooth shit fool ya, 'cause I can get it on\n'Cause, I be breakin' bones like dragonfly Jones\nQuick to put 'em on ya\nDon't make me act a fool, nigga, make it ruff\nMake it smooth and I'm in here\nMake it ruff\nMake it ruff, make it smooth\nMake, make it, make it ruff\nMake it ruff, make it smooth\nMake it ruff\nIce Cube's up in this motherfucker\nK-Dee's up in this motherfucker\nMake it ruff, naw, make it smooth\nMake it ruff, naw, make it smooth\nMake, make it ruff, ruff\nMake, make it ruff, naw make it smooth\nMake it ruff, ruff, naw, make it smooth\nNaw, naw, make it smooth\nNaw, make it smooth"}], "artist": "K-Dee"}