{"songs": [{"image": "https://images.genius.com/3e04787eea4f43554ffcbde3a35ad709.1000x1000x1.jpg", "title": "Creepy Crawl", "album": "Death Rap", "year": "2007-09-10", "lyrics": "[Verse 1]\nCreepy crawling, in your crib, we're comin' to kill\nCatch you while you sleep, wake up to a gun in your grill\nDoing Satan's business, tie you up, hang you\nStrangle you, 22cal. bang, bang you\nMephisto with a pistol, methadrine crystal\nGive me all the money, to me you're less than shit stool\nJuxed 51 times, women screaming, blood everywhere\nBound and gagged, in fear you stab, beg for your life\nBreak the gun handle on your skull, take a jagged knife\nThen like an animal indulge, in non-stop stabbing trife\nPuncture pregnant bitch, rupture arteries\nMy horrific cult of vultures, butchering, no remorse, bludgeoning\nSlit your throat, gushing like a flushed toilet, now your hunched\nMy infamous psycho posse, tagging 'pig' up on the door in blood\nYou can't stop me from:\n\n[Hook]\nStabbing, and stabbing, and stabbing, and stabbing (Until you die!)\nAnd stabbing and stabbing and stabbing and (My cult keeps)\nStabbing and stabbing and stabbing and stabbing (Viciously)\nStab you to death!\n{*Gunshot*}\n\n[Verse 2]\nFace down on the bed, pillow case over your head\nLamp cord choked, leave everyone in the place dead\nKnife to your chest, your colon flexes\nSlashing the word 'war' in your solar plexus\nWe're piranhas, get you prepped for embalmers\nYou're pleading, bleeding profusely in your pajamas\nAttacking my prey like a starving hawk\nJux ya buttocks with an ox and a carving fork\nSenseless crime, no motive, sacred deed\nShock the world, make 'em stand up and take heed\nNeedle tracks on my arm, influenced by Beatles tracks\nDoing your fetal sac harm\n\"Patty, do something witchy later\"\nHelter skelter in blood on the refrigerator\nExit, me and my vicious accomplices\nHitch-hike back to the ranch, mission accomplished\n\n[Hook]\nStabbing, and stabbing, and stabbing, and stabbing (Until you die!)\nAnd stabbing and stabbing and stabbing and (My cult keeps)\nStabbing and stabbing and stabbing and stabbing and stabbing (Viciously)\nStab you to death!\n\n[Charles Manson sample]\nWhat the hell I wanna go off and go to work for? Work for what? Money? I got all the money in the world. I'm the king, man. I run the underworld, guy. I decide who does what and where they do it at. What am I gonna run around like some teeny bopper somewhere for someone elses money? I make the money man, I roll the nickels. The game is mine\n[?]"}], "artist": "Necro"}