{"songs": [{"album": "9th Wonder Presents: Jamla is the Squad", "image": "https://images.genius.com/6c28b8f399f3d8eab6069bb5e914e276.1000x1000x1.jpg", "year": null, "title": "Shinin’ Star", "lyrics": "[Verse 1]\nYou the one that’s responsible, remarkable\nHonourable, always in control\nYou’re daddy’s pride with your momma’s eyes\nLove ‘em both sorta like I love my life\nThey created you so the praise is due\nUp high cause he favoured you by makin’ you\nMy compliments inside you is where heaven is\nBeautiful and suited too, brighten up the dark\nSo I’mma nickname you star\nCan I call you Mars? Or maybe Venus?\nNothing’s between us on this earth\nBut it’s God first\nSo every time you right by my side, God work\n\n[Hook]\nAnd you’re my little star\nI see the way you shine\nDon’t go too far now baby\nI need you\n\n[Verse 2]\nLong walks thinking and planning our future (I need you)\nRushing tryna get home thinkin’ what I’m gonna do to ya (I need you)\nKnew that it was you to trust, you can turn the Luther up\nI must admit it girl you go the smoothest touch, got me stuck\nAnd that’s alright though, I’mma let go, love’s in control\nSo let me ask, is you cool with that?\nIt’s you in fact cause you got us on a plateau\nI can’t go back to the playa way of thinking\nA queen like Billie Holiday, my inner being\nTaking giant steps like John Coltrane [?]\nJump in the boom and me replacing your name with mine\nThis ain’t a game cause everything that I’m sayin’ sincere\nYou’re here with me not entertainin’ them lames\n(Ooh, star, I love the way you shine)\nSee you appreciate the little things, actually\nWhen the revenue was short, you’d be holdin’ up the fort\nBeauty and compassion need balance any man would need\nThough the future’s lovely, look at what my eyes see\nMe giving you a seat to mark the beginning of we\nFollow I take the lead, a little Jo and Jodeci\nSpinning while I kiss your cheek, know my heart is yours to keep\n(I’d do anything for you)\nYea you got it, boo\nLovin’ every side of you I receive the bright of you\n(Oh yea), and I be there for you\nHard work and soft on you sweet like a summer foo\nStacked in the pants, yea, somethin’ like an Amazon\nGotta hand it to ya girl, ya everything a man want\nAnd I’m thankful\n\n[Hook]"}], "artist": "Terrace Martin"}