{"songs": [{"lyrics": "[Intro]\nDie nigga! We are born to die nigga\nYou've been dyin for 400 years\nNiggas know how to die\nNiggas don't know nothin else, but dying\nNiggas dream about dying\n\n[Bridge: MC Ren]\nI'm a motherfuckin nigga  (with an attitude)\nI'm a motherfuckin nigga  (with an attitude)\nI'm a motherfuckin nigga  (with an attitude)\nI'm a motherfuckin nigga  (with an attitude)\n\n[Verse 1: Dr. Dre]\nI got a case, of spittin in a motherfucker's face\nSo me and my ace, we got a taste\nOf a motherfucker's billy club, he took his gun and\nPut it to my head and said, \"Nigga start runnin\"\nSo tell me what's the next episode?\nIs he crazy, does he want to chase me or waste me?\nI thought, \"Run nigga run\", but I caught myself\nBecause my secondary thought was death\nI've got head and heart real, but still a motherfucker said\n\"I want another black motherfucker dead\nNiggas ain't good for shit to me\"\nCause it's a race for second class, so get your ass\nUp against the wall bitch, and then he tried\nTo jump me but the punk became a victim of a walkby\nFuckin with Dre, you get a foot up in your asshole\nIt's just another way to let you know\nNigga send them, nigga send them, nigga send them\nPunk can't fuck with me - Real motherfucking G\nStraight from the streets of the CPT\nTelling you why, real niggas don't die\n\n[Hook]\n\"I-iiiiiii, just want to celebrate!\"\n\n[Verse 2: MC Ren]\nReal niggas don't die cause they eventually multiply\nThe niggas I'm with, they take an eye for an eye\nBecause the times are so wrong, gotta stay so strong\nNiggas gotta keep it goin on and on\nAnd don't let no paleface throw your ass in a snail race\nHave your residence occupyin a jail space\nThat's what they want to do cause the system is fucked around\nI try to let you know with the records that's underground\nThey don't give a fuck about a nigga, they would rather pull the trigger\nAnd have you in front of a barrel smilin sayin \"Cheese!\"\nSo nigga get smart and rebel back\nI'm not with that black shit so I'm not gonna yell that\nAll I see is niggas getting harassed\nAnd can't do nothin about it but get a foot in they ass, yo\nBut if every nigga grabbed a nine\nAnd started shootin motherfuckers it would put 'em in line\nAnd that's how it's supposed to be\nWhen a pussy-ass nigga try to fuck with me\nYo, because it's useless to try\nTo kill a nigga cause nigga a motherfuckin real nigga don't die!\n\n[Hook]\n\"I-iiiiiii, just want to celebrate!\"\n\n[Interlude]\nDie nigga, everywhere you go\nNiggas dying, niggas been dyin for 400 years\n\n[Bridge: MC Ren]\nI'm a motherfuckin nigga  (with an attitude)\n\n[Verse 3: Eazy-E]\nOnly the good die young, so that makes me young and bad\nPuttin ass-kickings on the niggas that never had\nSo I guess that makes me tough shit\nStraight up gangsta, wrong nigga to fuck with\nSo how can a nigga die, when he's causin the bloodshed\nBy shoot motherfuckers in the head\nTryin to make a nigga extinct because they fear me\nBut never wanna hear me\nSo I'mma let 'em know how a nigga's livin\nTakin from motherfuckers cause nobody ain't givin\nA damn thang! To a nigga, a real nigga\nSo I'm living by the motherfuckin trigger\nCause a nigga ain't afraid of bein locked up\nI'm out of luck, so why should I give a fuck?\nBut they still want to try\nTo kill a nigga like me but motherfuckin real niggas don't die!\n\n[Hook]\n\"I-iiiiiii, just want to celebrate!\"\n\n[Outro: MC Ren]\nYeah, a real nigga don't die!\nYeah motherfuckers!\n(\"Die, nigga!\")", "album": "Efil4zaggin", "year": "1991-05-28", "title": "Real Niggaz Don’t Die", "image": "https://images.genius.com/3ca4da71fc3013722afaf26fcb385c8f.1000x1000x1.jpg"}], "artist": "N.W.A"}