{"artist": "Wax", "songs": [{"year": "2010-05-01", "lyrics": "Dumbfoundead\nBig Wax, tryna get a dollar for these tracks\nWe just tryna make it like everybody else\n\n[Hook: Aloe Blacc]\nI need a dollar, dollar, a dollar, that's what I need\n(Hey Hey)\nWell, I need a dollar, dollar, a dollar, that's what I need\n(Hey Hey)\nSaid I need a dollar, dollar, a dollar, that's what I need\nAnd if I share with you my story, would you share you dollar with me?\n\n[Wax]\nI got my mind on my money and my money on my mind\nSo I stay stressed out cause money is hard to find\nAnd even when I find some of it I always end up shoving it\nInto the pocket of somebody whose already got a ton of it\nKeep your ninety-nine percent I just wanna get one of it\nKeep ya private jet man I'm just tryna keep my oven lit\nAnd my electricity on\nSo put a dollar in the hat and be gone\nAyo let me get a dollar from each of you\nJust take it out the money you would use next time you tip the pizza dude\nWait, now it's his plate I'm robbing\nAnd me and him probably got the same type of problems\nSo give us each a half dollar, a 50/50 share\nI ain't a math scholar, but that seems pretty fair\nI'm still waiting for a break that may never come\nBut 'til then do you got a dollar for a begging bum?\n\n[Hook]\nI need a dollar, dollar, a dollar is what I need\nHey! Hey!\nWell I need a dollar, dollar, a dollar is what I need\nHey! Hey!\nSaid I need a dollar, dollar, a dollar is what I need\nAnd if I share with you my story would you share you dollar with me\n\n[Dumbfoundead]\nI need a dollar; my Korean father came to this country to feed his daughter and son\nJust a moderate sum\nBut sought the refuge in a bottle of rum\nA 100 proof, like poof, and the bottle was done\nWhat he become was a true alcoholic where he used all his profits\nFrom his blue collar popping on booze\nAnd I vowed I'll always have my feet on the ground\nNo stupid mistakes just keep the food on my plate\nA dollar will confuse you put you in delusional states\nThink you're investing in a dream but Freddy Krueger awakes\nFool; this isn't unusual, this is L.A\nI seen the rich get richer and then piss it away\nThey either sniffing the cane or a medicinal pain killers\nThe dealers that slang are awaiting the grave diggers\nWe keep a guns by your wallet best keep it tucked\nUse it and you might get more bang for ya buck\n\nI need a dollar, dollar, a dollar is what I need\n(Hey Hey)\nWell I need a dollar, dollar, a dollar is what I need\n\n[Bridge: Aloe Blacc]\nWell I don`t know if I'm walking on solid ground\nCause everything around me is falling down\nAnd all I want is for someone to help me\n\n[Dumbfoundead and Wax]\nYo, if I only had a dollar more, I can get a dollar menu item or something from the dollar store\nA penny for ya thoughts, a dollar for ya dignity\nThe almighty dollar will make you bow down religiously\nI need a dollar leave a dollar every time I see a dollar I want it to come my way\nGive me a dollar, me a dollar, never been an easy dollar somebody help me get paid\n\n[Hook]\nI need a dollar, dollar, a dollar is what I need\nHey! Hey!\nWell I need a dollar, dollar, a dollar is what I need\nHey! Hey!\nSaid I need a dollar, dollar, a dollar is what I need\nAnd if I share with you my story would you share you dollar with me", "image": "https://s3.amazonaws.com/rapgenius/Big_Wax_in_Front_of_a_Fence.jpg", "album": null, "title": "I Need A Dollar (Unofficial Remix)"}]}