{"songs": [{"title": "With the Plug", "image": "https://images.genius.com/71620f8003bc66935a971834dc272d98.640x640x1.jpg", "year": "2017-07-04", "album": "Money Changes Everything", "lyrics": "[Intro]\nWithout love\nLost in the darkness\nWithout love\nLooking for light\nWithout love\nEverlasting night\nWithout love\n\n[Chorus: Maxo Kream]\nAyy, look, ayy\nShould I serve him, should I rob him? (I don't know)\nYou know the plug (what?), always gave me problems (take 'em down Maxo)\nShould I serve 'em, should I rob him? (should you what?)\nPop his top (boom), medulla oblongata, yeah (pow pow, bang, boom)\nShould I serve 'em, should I rob him, yeah (who?)\nOh the plug (hey), he always give me problems (I don't know, ayy)\nServe him a what (yeah), rob him for that (ayy, Maxo)\nServe him for that (Maxo, Maxo), yeah\n\n[Verse 1: Maxo Kream]\nMama told me (what?), Maxo you a heathen (bitch you bad)\nOn the corner (what?), crippin' with them demons, yeah (crip)\nTriple double (what?), never double teamin', ayy (two three)\nBrocolli lettuce (what?), trappin' like a vegan (damn)\nI call the plug (hello?), but he don't wanna pick up (pick up bitch)\nI'm not a bug (nah), bitch I'm tryna pick up, ayy (real)\nStash of drugs in the F-150 pickup, ayy (yroom)\nSippin' mud (yeah), bitch I got the hiccups, whoa (hiccup)\nWatch me make a play from my tub like a reverend\nWatch me stick a pussy nigga up like a tampon (Maxo)\nI was thirteen when I caught my fifty-two (crip)\nPourin' whole things in the crip Mountain Dew, ayy (yeah)\nBig homie, I don't fuck with new crips (hell nah)\nCatch me groovin', like five holdin' two fifths, ayy (five deuce, yeah)\nShould I serve him, should I rob him? (I don't know)\nYou know the plug (what?), always gave me problems (uh-huh)\n\n[Verse 2: 03 Greedo]\nMaxo bring the lean, Greedo bring the green\nHanging like some oranges and some grapes, bring down with a leaf\nPlug for the drugs, hit the kitchen if you whip it up\nBring it back, bring it back, while receive the pack\nGreen from the Bay, the Yay Area, like where I'm at\nFiends where I stay, skate across the map, hit the H-Town\nMaxo got the strap, rounds loaded, don't get clapped\nGreedo got the MAC, cheese on niggas scalp, ooh\nPeel off like a scab, low-lows ain't the swag\nForeign do the dash, purple in my rag\nAll I blew is cash, pop a xan and stash\nPop a xan a batch, lost him in a flash\nShould I rob him, should I serve him?\nFuck it, I just popped him, now I'm swervin'\nMe and my bitches cock it for that lurker\nCan't be no accomplice to a murder, ayy\nShould I rob him, should I serve him?\nShould I rob him, should I serve him?\nShould I rob him, should I serve him?\nShould I rob him, should I serve him?\n\n[Chorus: Maxo Kream]\nAyy, look, ayy\nShould I serve him, should I rob him?\nYou know the plug, always gave me problems\nShould I serve 'em, should I rob him?\nPop his top, medulla oblongata, yeah\nShould I serve 'em, should I rob him, yeah\nOh the plug, he always give me problems\nServe him a what, rob him for that\nServe him for that, yeah"}], "artist": "03 Greedo"}