{"artist": "Plies", "songs": [{"album": "100% Real Nigga", "title": "Dope Boy (Remix)", "image": "https://images.genius.com/e0a35e364bbe7570899c10c1af5b0ffc.529x529x1.jpg", "lyrics": "[Intro]\nAy, I think I might get indicted off this one, nigga\nThis for my motherfucking dope boys, nigga\n\n[Chorus]\nWho put the Chevys in the game, nigga? (A dope boy)\nThe first nigga on 26's (was a dope boy)\nI bet the nigga you fucking right now (a dope boy)\nAnd this the year of the motherfucking dope boys\nWho put the Chevys in the game, nigga? (A dope boy)\nThe first nigga on 26's (was a dope boy)\nI bet the nigga you fucking right now (a dope boy)\nAnd this the year of the motherfucking dope boys\n\n[Verse 1]\nA dope boy is who these rap niggas wanna be\nThis shit real out here, this ain't TV\nA nigga knock your ass off, nigga about a G\nCan make a quarter bird look like a whole key\nIn the hood, a dope boy symbolize success\nCan lock us up, but you can't take us out the projects\nMy momma told me to sit down 'cause she can't rest\nI told her thank the streets for the diamonds on her neck\nYou can't fault her, I'm fucked up, she did her best\nWithout the dope game, nigga, I'll be hopeless\nThe only thing that motivated me, nothing else\nIt's God, then a dope boy, that's how I felt\n\n[Chorus]\nWho put the Chevys in the game, nigga? (A dope boy)\nThe first nigga on 26's (was a dope boy)\nI bet the nigga you fucking right now (a dope boy)\nAnd this the year of the motherfucking dope boys\nWho put the Chevys in the game, nigga? (A dope boy)\nThe first nigga on 26's (was a dope boy)\nI bet the nigga you fucking right now (a dope boy)\nAnd this the year of the motherfucking dope boys\n\n[Verse 2:]\nI don't know if the dope game worth going Fed\nBut I know one motherfucking thing: it's where the money at\nAin't stunting these crackers, nigga, y'all worry about that\nI feel like I could do mine if it came to that\nI bet these little jits couldn't tell you who the mayor is\nBut they could tell you niggas on them 26's is\nDope boy the biggest thing to ever hit the crib\nAnybody who somebody, a dope boy their career\nIn the hood, nigga, who everybody talking 'bout?\nAnd who these silly ass hoes around here fighting 'bout?\nA dope boy the biggest thing that ever came out\nYou better put something aside, nigga, before the drought\n\n[Chorus]\nWho put the Chevys in the game, nigga? (A dope boy)\nThe first nigga on 26's (was a dope boy)\nI bet the nigga you fucking right now (a dope boy)\nAnd this the year of the motherfucking dope boys\nWho put the Chevys in the game, nigga? (A dope boy)\nThe first nigga on 26's (was a dope boy)\nI bet the nigga you fucking right now (a dope boy)\nAnd this the year of the motherfucking dope boys\n\n[Outro]\nAy, dog\nI want y'all niggas to know something, man\nWithout information\nThese pussy ass crackers ain't got nothing, dog\nIf you keep it G with the niggas you're running with, homie\nYou can stay out here a long time, boy\nIf you don't get caught with it on you\nAll that shit a bitch downtown talking 'bout don't mean nothing, nigga", "year": "2005-03-01"}]}