{"artist": "Anderson .Paak", "songs": [{"title": "Draft Day Freestyle", "album": null, "year": "2014-01-01", "image": "https://images.genius.com/fd64e9ac45d9ce8789a4daeae79bdee3.500x500x1.jpg", "lyrics": "[Intro]\nCheck, check, one, two\nYeah\nOhh, oh yeah\nOh, yeah\nOh, yeah\nYeah!\n\n[Verse]\nLivin' like I'm livin', tented windows on that Camino\nNiggas couldn't see me, triple beamer, fuck a telescope\nPhotos of my baby boy, I know I know to raise him tough\n\"Daddy why you never home?\" \"You'll understand when you grow up\"\nPapa was a crazy fuck, paper chasing, playing drums\nMomma never taught me how to save, she told me double up\nWifey need a couple bucks, side piece always wanna fuck\nLife ain't never easy I can see y'all niggas giving up\nSee y'all niggas grilling us, see yo' bitches feeling us\nThese niggas ain't killing us, we been more than generous\nGiving every single bit, taking everything we want\nTime is of the essence, but don't put that stress up in blood\nNow what the fuck is \"good luck\"? Everything I've ever done\nSomething out of nothing, killing everything in front us\nEvery nigga that ever fronted on us is throwing up\nChunking up the gold cup, y'all niggas is runners, huh\n\n[Hook]\nAnd now we only got the time that heavens deal us\nThere's some things in the world that we have to deal with\nAll these lame niggas ever gave me was opinions\nBut I never gave a fuck about a couple pennies, nah\n\n[Verse]\nI just want a Picasso\nI want there to be peace out in Chicago\nI give y'all Venice Beach before the fall though\nBut I see Malibu soon as I close my eyes though\nLabels talking that shit, but I ain't sign though\nHellfyre my clique, word to [?]\nHey, could've been worse out this motherfucker\nCould've been in a herce  out this motherfucker\nStep up in this bitch like I'm connections in this bitch\nI'm taking what you niggas what you niggas owe me\nMiddle finger to the police\nMe and LoDef [?]\n[?]\n*Coughing*\nPlatinum Status in this bitch\nShoutout [?] on the flip\nMy nigga [?] on the shits\nOpen mic and rhetoric\nMy nigga bus driver, Milo\nThat nigga DJ Nobody's sneaker game is [?]\n\n[Outro]\nAnd now we only got the time (Hellfyre the clique)\nThere's some things (Sc-scramble my shit) to deal with\nAll these lame niggas (Freenationals) was opinions\nBut I never (aye yo Lee, imma be back nigga, don't trip, I gotchu) nah\n(Shoutout my nigga [?] thats my old head, my old head\nShoutout my nigga [?], teaser, teaser, teaser gang bitch) O-oh\n(Shout out my nigga [?], the almighty [?]\nGood to have y'all niggas back)\nThere's some things in world ([?])\nAll these lame niggas- opinions\nBut I never gave a fuck([?]) nah (muah)\n(Y'all labels taking too long, but thats okay though. Imma make y'all pay for every year yall niggas dont break bread, word to my momma. Shoutout to mommaa too, she gon' get her bachelors in a couple months. Yup.)\nVenice, LA\nMalibu is on the way\nBuck! (Hold tight)\nI'll see y'all on beach, see y'all niggas on the beach\n(I smoke no more so you know, if i get bored imma just write some shit throw it up on Soundcloud)"}]}