{"artist": "Pras", "songs": [{"album": null, "title": "What’s Clef", "image": "https://images.genius.com/5f4f397c7311486910ee54514a7ad678.1000x1000x1.jpg", "lyrics": "If you'd like to make a call, dial your operator\nIf you need help, try, try again\nTry, try again\nI got it started to my face\nI got it started to my face, right?\nWhat you thought, there wasn't gonna be no retaliation?\nHa, ha, ha\nYou gotta be kiddin'!\nYou call my name four times on a record?\nHeh, heh!\nIf you need help, try, try again\nTry again\nYo, \"Return of Jack the Ripper,\" what? Nigga please\nI'ma push you further back than your hairline recedes\nNew York City, don't get it confused\nYour song will last as long as your part in \"Krush Groove\"\nBody moves, the battles, bullets, the lesson\nYou write about being a veteran, but not a legend\nBack from the war with thirty-two medals of honor\nYou claimin' underground but never been to Bobbito the Barber\nGimme them medals back, since you forgot how to rap\nCall DJ Bobcat and ask him where them old records at\nLike Channel Five karate, my kick is gonna reach ya\nA new episode where the student kills the teacher\nAny last words before I send you to your dream?\nHold my hands and pray\nYou don't got knowledge yourself\nSo you don't know what that mean, a'ight?\nWho suped you up to do the record in the first place?\nIt lacked taste, you get \"The Gas Face\" like 3rd Bass\nL.L. stands for Lickin' Lyor, or Lickin' Lichty\nLickin' Lyles, Lickin' Labels, lickin' they balls\nUnder the conference room table\nWhen you hear this record, you bound to go AWOL\nI worked too hard, for this life is serious\nThis ain't bulls-eye, I ain't your target practice\nSo call Mr. Martin, I rarely kill often\nBut in this sound clash, I got a bodybuilder's coffin\nBack from Miami where your record got no heat\nThat's why your Def Jam interns call it \"Battle of the Beats\"\nYou're weak nigga!\nIf you need help, try, try again\nTry again\nYo, this my question\nWhat's your question?\nWhat's Clef got to do with this, got to do with this?\nWhat's Clef?\nI'm not a Bob Marley impostor\nWhat's Clef got to do with this, got to do with this?\nTell your ghost writers, \"Go write something better\"\nIf you need help, try, try again\nTry again\nGuess who? Uh-oh, uh-oh\nHere we go-o, uh-oh\nEvery two records you do scenario\nYou get the best MCs, how? To rhyme first\nOf course you rap last, so you can show off your skirt\nI guess it didn't work on \"4 3 2 1\"\nYou got out done by Canibus the young gun\nYour last weapon, is to call out Wyclef Jean\nNot knowing that you callin' fire for your cremation\nJammin' and cool, sumpthin' like you\nJamaicans say, \"L.L. a fool\"\nKids wet too who do the pool\nLet bells ring like Sunday school\nL.L. Cool J is hard as hell?\nSo hard at night he's Jezebel\nI heard the teller, Himmemel\nHow you think he wrote the song?\nRock the bells!\nYo, Clef\nI know you got styles, but get back to the issue kid\nThis is real!\nYo, don't get me angry, like the Hulk, I'll turn green\nYour marriage is a cover up, 'cause you use Vaseline\nFun love of hip-hop, these lyrics got you steamed\nKnowing damn well that bad men don't wear g-strings\nAnother side of Clef, the face you won't seein' oppressed\nI even got the Devil worshippers sayin', \"God bless\"\nYou star struck, and I'ma buck you like Carlito\nAnd when they say, \"Who did it?,\" you tell them Benny Blanco\nWyclef, preacher's son, check the revelation\nPolygram buy Def Jam for twenty million\nMCA buy Polygram for eleven billion\nI come to Sony and get pimped by the Haitian-Sicilians\nAnd I'll even, get you an ad in \"The Source\"\nYou'll be the first rapper selling products for hair loss\nThe W-Y-C-L-E-F, Wyclef\nThe return of Jack the Ripper was only to meet his death\nThe next time, you wanna dis me for kicks\nGet off my dick, go somewhere and lick your lips, bitch!\nIf you need help, try, try again\nTry again\nRest in peace!\nWhat's Clef got to do with this, got to do with this?\nWhat's Clef?\nI'm not a muscle man impostor\nWhat's Clef got to do with this, got to do with this?\nWatch what you ask for, 'cause you just might get it\nYo, this is Naomi Campbell chillin' with Wyclef\nI just wanna tell you L.L., your record is wack\nL.L., why don't you just give up?\nIf you need help, try, try again\nTry again\nIf you need help, try, try again\nTry, try again", "year": null}]}