{"artist": "Hitmaka", "songs": [{"album": "Almost Famous - Sexy Lady EP", "image": "https://images.genius.com/8bdc9dc70c0ab2bb50820e695d25c7bc.1000x1000x1.jpg", "year": "2007-06-12", "lyrics": "[Yung Berg]\nYeah - so you know we had to do a remix right?\nRob Holladay, told you we was gon' be famous nigga~!\nAhh!! Yeah - Y, B's, still\nI told y'all my album was crazy\nDo our dance with us\nIt's the remix, shorty bring it back\nIt's the remix, Jim Jones on the track\nIt's the remix, shorty bring it back\nRich Boy, Yung Berg, bring it back, c'mon\n\n[Intro: Junior - sung] + (Yung Berg)\nHey sexy lady (yeah) it was nice to know you (it was nice to know ya)\nBut I gotta move onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn\nHey sexy lady (hey sexy lady) it was nice to know you (it was nice to know ya)\nBut I gotta move onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn\n(I told y'all!) Hey sexy lady~!\n\n[Jim Jones]\nIt's hot days in December\nWe down Miami, drop tops in the winter\nWe off ocean, the Coupe doors open\nAnd front wet woolies off Superman potion\nCasino slang, try and kick game\nShe was flyer than a plane from her toes to the Gucci frame\n(She was fly) Damn, but I'm sittin on two hundred thou'\nI can't front cause I'm diggin lil' momma's style\nLondon bag by Thomas Wylde\nVuitton shoe by Extreme Hole\nFall edition with the mean sole, pencil jeans look painted on\nOne night, the next day I'm gone\n5 A.M. in the morn'\nDrunk and high off Patron, momma it's on\nMomma is you grown? It's the X-rated show\nAnd if you got a man he's now your excellent foe\nI'm bad\n\n[Hook One: Junior - sung] + (Yung Berg)\nHey sexy lady, it was nice to know you (it was nice to know ya)\nBut I gotta move onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn\nHey sexy lady, it was nice to know you (it was nice to know ya)\nBut I gotta move - WHEN WE SING THIS SONG (yeah)\nWE GON' HAVE SOME FUN (yeah) Hey sexy lady~!\n\n[Yung Berg]\nYo, so quiet down I'm in the mode for pimpin\nYellowed denimous watch, call it Flotus Simpson\nYoung boy, so he like older women\nBut the young girls they know the bid'ness\nMeet me at Pimp Leach{?}, then go to Zini\nOr catch me on the tube like I Dream of Jeannie\nSnap two times and I'm in a new city {*snap snap*}\nTwo mo' times and I'm back in my city {*snap snap*}\n(SEXY LADY~!) Chi city, fly with me\nShorty wan' ride with me in the S-550\n... They call me Young 50\nBeats like Dre, flow like Biggie\nBop like Diddy, you can't match this\nI don't roleplay, let my girl do the actin\nYeah, and shall I say\nAu revoir, adios from the Y.B. gang, g'night!\n\n[Hook Two: Junior - sung] + (Yung Berg)\nHey sexy lady, it was nice to know you (it was nice to know ya)\nBut I gotta move onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn\nHey sexy lady, it was nice to know you (it was nice to know ya)\nBut I gotta move onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn-ah-onnnnnnnnn\nHey sexy lady~!\n\n[Rich Boy - over Hook]\nAy, sexy lady\nRich Boy, new money, locked\n{*laughing*} Ay...\n\nHop in the ride baby the interior's soft\nLet's go to my palace or up to my loft\nLet me upgrade ya, nothin too major\nPut ya in some Fendi just to add a lil' flavor\nYou musta got that pretty tan on South Beach\nI can fly ya out the country where the phones don't reach\nOr come to Alabama where I'm +BIGGER+ than the mayor\nHoes lickin at the lamb like a Life Saver\nTalkin 'bout bread, well I'm a whole loaf\nI can be the butter, let that ass be the toast\nOr I can be your master and sit up on the throne\nHave you walkin 'round in a leash and some thongs\nSmellin my cologne, my manstick be long\nYou can get it now you ain't gotta wait long\nAin't nuttin like a slim wiz with a pretty face\nAnd sexy lady I'mma give you first taste, roll with me\n\n[Yung Berg]\nIt's the remix, shorty bring it back\nIt's the remix, Jones on the track\nIt's the remix, Rich bring it back\nSexy lady, Rob Holla' on the track, c'mon!\n(SEXY LADY~!) This is a Y.B.M.G. product\nWild wild rock to what's good\nAri, my levels soundin right right now\nThat's what's crackin - loco! Hunnid! Junior!\nThe album comin soon, look what you made me\nAy, this to all my ex-girlfriends out there\nGotta move ah-ah-on, ah-ah-on\nAh uh-ah uh-ah, ah-ah-on...\n{*instrumental to end*}", "title": "Sexy Lady (Remix)"}]}