{"artist": "Wale", "songs": [{"title": "Cashin Out (Freestyle)", "year": "2012-03-15", "lyrics": "[Chorus: Ca$h Out]\nCool\n36 Os so riding round with that nina\nRiding with a ho named Keisha, smoking on Keisha\nMy diamonds talk for me, they say, \"Hi, can I meet you?\"\nG5, how high in the sky, ho I can't see you\nGot a condo on my wrist, girl, I'm cashing out\nGot a condo around my neck, girl, I'm cashing out\n36 Os so I'm riding round with that nina\nMy diamonds talk for me, they say \"Hi, can I meet you?\"\n\n[Verse: Wale]\nI got these tats all on my arms\nSmoke one stack straight to my dome\nPay my haters not too much mind\nYou pay your favorite stripper car note\nYeah I'm cashing out, I'm all Madden dog\nI'm understanding that bull like a matador\nTop 10 in my category\nBought a brand new car for my after party\nThese shows be packing tight\nCouple grand when I rock the night\nGot a chauffeur, bumping Coke Boyz\nThese hoes ain't acting right\nCamera to the road trying to mack to a shone\nWoodstock though, couple bands on the floor\nGot ten on the floor, stop playing with flow\nHigh as D'Angelo notes in a Ghost\nNigga met her at Vanquish\nBut she say she from Bankhead\nWhere the thing is amazing\nSo ain't no way you gon' wait for relations\nGot it matching though\nPut the bottles up, put the glasses out\nRed bottoms y'all and the ass is out\nShe a honest girl so I'mma slam her out\nOutstanding clout, what up Greg Street\nMore money that mean less sleep\nIt's all good, finna dog that\nBe a wack cat be my pet peeve\nAss shots in her Seven Jeans\nFive shots she ready to leave\nFendi daughter my PRP, but nigga Fendi brought me your NC\nFayetteville I'm out Raleigh too\nShe gonna dance when that Molly through\nMy liver's cold, I got the frigid flow\nSo before I go, you should harvest food\nAnd them niggas ain't fly, where the fuck your purple label at\nAnd when the club close down bet you don't know where your lady at\nWhy you saving that, with her misbehaving ass\nDon't pay for that, double-MG nigga brag about\nJust like that... Wale\n\n[Chorus: Ca$h Out]\nCool\n36 Os so riding round with that nina\nRiding with a ho named Keisha, smoking on Keisha\nMy diamonds talk for me, they say, \"Hi, can I meet you?\"\nG5, how high in the sky, ho I can't see you\nGot a condo on my wrist, girl, I'm cashing out\nGot a condo around my neck, girl, I'm cashing out\n36 Os so I'm riding round with that nina\nMy diamonds talk for me, they say \"Hi, can I meet you?\"", "album": null, "image": "https://images.genius.com/e0cde0eabe61c1ddca97cce2386792d2.421x421x1.jpg"}]}