{"artist": "Yukmouth", "songs": [{"album": null, "image": "https://images.genius.com/fe4ce80636a153d477eafc54f843fd09.900x900x1.jpg", "year": null, "lyrics": "(Yukmouth)\n(Breathe!)\nRound 2, nigga! I won the first round, nigga!\nGo back to the drawin' board, nigga!\n(Breathe!)\nI'm built for dis, baby\nOh yeah, and thanks for the promotion on the radio station\nI loved that, nigga!\nYamean\n(Breathe!)\nKeep sayin' my name, keep sayin' my name, baby\nKeep blowin' me up, nigga, and I' ma cut your fuckin' throat, you bitch!(Breathe!)\nThe Game play games nigga\nYou a lyin' ass toungue ring faggot, nigga!(Fuck the Game, you bitch!)\n\n(Yukmouth)\nI crack your back\nWhen I'm blastin' ya gat\nYa lungs collapse like a asthma attack\nNigga I make you hard to...\n(Breathe!)\nFaggot rap\nYa back bone is D'mack'n ya brotha, And you still got clapped\nLay on ya back and try to...\n(Breathe!)\nNigga ain't from the hood\nYour first album wasn't good\nAnd every week you get slapped by Suge!\nBitch nigga...\n(Breathe!)\nCome to the Bay, man, the TECs gon' spray\nIt's like you're boxed in with pepper spray\nNigga I make you hard to...\n(Breathe!)\nAnd don't lie, that's the code of the streets\nI drag you from the '64 by that G-Unit piece\nYou bitch...\n(Breathe!)\nPlayin' games, you don't really want beef\nMy Chi niggas got that G-Unit piece\nBuck I know you can't...\n(Breathe!)\nYou never met Pac, you never met Eazy\nYou're suckin' on my dick! Man, your lips too breezy!\nYou gotta...\n(Breathe!)\nTake deep breaths, adjust your tongue ring\nWhile Dre stick his dick in ya ass, you pretty dumb thing (Fuckin' faggot!)\n(Breathe!)\nYou a G-Unit model\nI'll fill you up with them hollows\nYou fall, I follow and watch you wallow!\nNow try to...\n(Breathe!)(Nigga!)\nWar like Waco\nMy chain glow I made doe\nSince you had that tongue ring And fade on the game show(nigga)\n(Breathe!)\nYou're just a mixtape diva in every G-Unit sneakers\nY'all tryin' to sing them high notes like Aretha!\nYou gotta...(Bitch!)\n(Breathe!)\nFuck Wall Street\nA gat to your cheek\nAnd put your brains on the passenger seat!\nGame over he can't...\n(Breathe!)\n\n(Marc Shyst)\n\n(Yukmouth talks over the chorus)\n\n(Chorus)\nOne into the two, two into the four\nThe Game want war, The Game got war\n(Breathe!)\nFour into the five, let The Regime ride\nGame ride wit them, the game ova for them\n(Breathe!)\nOne into the two, two into the four\nG-Unit want war, G-Unit got war\n(Breathe!)\nFour into the five, let The Regime ride\nGame ride wit them, the game ova for them\n(Breathe!)\n\n(Gonzoe)\nIt's war time, You bitches understand me\nThere's no fist fightin'; on sight I'ma blam you\nSmash niggas' face with gun handles\nYou know me the definition of the land of the scanners\nYou pose for the camera\nI carry my own blamma\nBury niggas with Chucks on with wooden pyjamas\nOn the hood you square\nDeath is a promise\nNo niggas know you from the jungles to the bottoms\n'cause' you had contacts tryin to GQ model\nI was born with Pac, in the OE-bottle\nYou're a dick rider\nTryin' to fuck with which crews hotta\nMatch your tongue ring to the paint on your Impala\nYou're just another fuckin' clone\nYou maricón\nGettin' shitted on\nFor shoes and cell phones\nYou dead wrong, nigga, sayin' Yuk ain't safe\nFrom E-1-4 to the Shaws There's a price on your face, you bitch!\n\n(Yukmouth)\nBitch Nigga!\nYou can't fuck wit us Regime life nigga?!\nHow dare you say Tha Regime on your fake ass skit?!\nHow dare you use \"5 on it,\" you fake ass nigga?!\nYou ain't got no plaques on your wall!\nYou ain't got no money, you bitch!\nYou at yo momma house, you punk!\nYou tongue ring queen!\nNigga!\nYou can't fuck with me man!\nStay off the internet, you computer thug!\nYou don't want it, nigga!\nYou don't want war, you bitch!\n\n(Chorus starts)\nJoe Budden murdered you!\nAnd Yuk gon dead yo ass, nigga!\nI'ma whack yo bitch ass, punk!\nYou already know how we rock, nigga\nYou just got your first tattoo 2 years ago, nigga!\nWhen JT found you, you were tryin to be a G-Q model!\nYou thought you was the next LL\nREMEMBER!?\nRemember you was saying that, you bitch?!\nBe real!\nPunk...\nFake ass blood...\nNigga!", "title": "Game Ova Part. 2"}]}