{"artist": "Pastor Troy", "songs": [{"album": "Crank Up", "title": "Crank Up", "image": "https://images.genius.com/c18b63eead74654c03c0b1652b373f80.600x600x1.jpg", "lyrics": "[Intro]\nYeeah, PT Cruiser Baby, Yeeah\nAiYo, we want everybody to crank this muhfucka up\nNigga, Crank this shit up LOUD NIGGA! (okay)\n\n[Hook]\nCrank Me Up, PT baby is back to get bucks\nI dont know maybe ya never, heard of\nComin in the back of the club with black gloves\nHard as a hammer, I am Atlanta\nSoon as i step on the scene, its lights camera\nAction, Cash In, Fat-ass cheques, my rolex\nWill make ya faint,huh, ya think i ain't?\nI hit the bank and get the grands, and just to spin tonight\nNuh-uh, pass me the mills mamma, i got a flight\nLears, listen here, private jet at the-yo (?)\nA bad ass ho, into the clouds I Go\nThe underground putting it down for five years\nThe blood, The sweat, the motherfucking tears\nI'm living the life of a young, drug lord\nI'll build this heffa up if i get bored\nNow ease up shorty, let the G slide through\nAnd i don't leave, without my .32\nTucked in the boot(boot),Tucked in a coat(coat)\nAnd when i see Chuck, its gonna get tucked in his throat\nAnd murder she wrote? But hell, I can't read\nStabbed a ho, kidnapped the bitch, see?\nAnd now i'm on the loose, now im on the run\nFuck that shit, I'll go and get a bigger gun\nYeah! Motherfucker (Nigga)\nCrank Me Up!\nIf you dont give a damn, nigga, we dont give a fuck\nI watch your CD's, my man, y'all suck\nYou suck a cracka's dick in the office then came up\nGet it? Never for this, damn nigga test\nSee how she be because my motherfuckin chest, Nigga\nYes nigga, picture me, hot caprice\nWhen i dun been raised by all these G's\nNigga, the crooks and killers, is my motherfuckin niggas\nJab a pussy, with some motherfuckin scissors\nThis is a, motherfuckin, crime scene\nI'm dumpin on the law, my nigga, by any means\n\n[Hook]\nCrank Me Up, PT baby is back to get bucks\nI dont know maybe ya never, heard of\nComin in the back of the club with black gloves\nHard as a hammer, I am Atlanta\nSoon as i step on the scene, its lights camera\nAction, Cash In, Fat-ass cheques, my rolex\nWill make ya faint,huh, ya think i ain't?\nI hit the bank and get the grands, and just to spin tonight\nNuh-uh, pass me the mills mamma, i got a flight\nLears, listen here, private jet at the-yo (?)\nA bad ass ho, into the clouds I GO!\nHey!\nCrank Me Up!\nIf you a gangsta you need to crank this up\nIf you dont give a damn, nigga, we dont give a fuck\nPastor baby, about to crank this up\nCrank Me Up!\nIf you a gangsta you need to crank this up\nIf you dont give a damn, nigga, we dont give a fuck\nPastor baby, about to crank this up\nHey!", "year": null}]}