{"artist": "50 Cent", "songs": [{"album": "The Massacre", "image": "https://images.genius.com/ca36dfbff5c6dfcea453afdb61476f86.1000x1000x1.jpg", "title": "God Gave Me Style", "lyrics": "[Chorus]\nGod gave me style, God gave me grace\nGod give me style, God give me grace\nGod put a smile on my face\nHa-ha, God put this smile on my face\nGod make me shine like the sun\nGod make me shine like the sun\nSometimes I feel like I'm the one\nSometimes I feel like I'm the one\n\n[Bridge]\nIt ain't my fault, I just reach for style\nI'm hot, I breaks it down\nIt ain't my fault, you can't break it down\nThe way I break it down\n\n[Verse 1]\nListen, you can call me what you want, black and ugly\nBut you can't convince me the Lord don't love me\nWhen my CD's drop, they sell the best\nYou call it luck, why can't it just be I'm blessed\nI'm a track star runnin' through life chasin' my dreams\nBest deal I made was tradin' the mic for that triple beam\nI zone off thinkin' is there really heaven or hell\nIf so what happens to a changed man that dies in a cell?\nI need no answers to these questions, 'cause time will tell\nGot a date with destiny, she's more than a girl\nDon't much good come from me, but my music\nIt's a gift given from God, so I'ma use it - yeah\n\n[Chorus]\nGod gave me style, God gave me grace\nGod give me style, God give me grace\nGod put a smile on my face\nHa-ha, God put this smile on my face\nGod make me shine like the sun\nGod make me shine like the sun\nSometimes I feel like I'm the one\nSometimes I feel like I'm the one\n\n[Bridge]\nIt ain't my fault, I just reach for style\nI'm hot, I breaks it down\nIt ain't my fault, you can't break it down\nThe way I break it down\n\n[Verse 2]\nSome days I'm in the crowd, all by myself\nBunch of niggas around, I'm still by myself\nI drift off on a cloud, by myself\nThinkin 'bout nothin more, than life - what else?\nThese days it's hard to tell who really cares for me\nSo when you hear this song, you should say a prayer for me\nI put a message in my music, hope it brightens your day\nIf times are hard when you hear it, know you'll be okay\nA O.G. told me God's favorites have a hard time\nYou're out the hood, that's good, now stay on the grind\nI'm a sponge, knowledge, and wisdom I ab-sorb fast\nI'm in a class by myself, you do the math\n\n[Chorus]\nGod gave me style, God gave me grace\nGod give me style, God give me grace\nGod put a smile on my face\nHa-ha, God put this smile on my face\nGod make me shine like the sun\nGod make me shine like the sun\nSometimes I feel like I'm the one\nSometimes I feel like I'm the one\n\n[Outro]\n(It ain't my fault) yeah\nShoutout to Reverand Floyd Flake\n(It ain't my fault) Creflo Dollar, TD Jakes\nBishop Eddie L. Long. Easy-L shorty. Ha ha\nWooo! Feels good\nOh yeah, can't forget Bishop Morton\nCause my mama'll kill me, ha ha", "year": "2005-03-03"}]}