{"songs": [{"year": "2018-07-17", "album": "Pure Intentions", "image": "https://images.genius.com/2619374aaf74e820050eff994da86264.1000x1000x1.jpg", "title": "Get Back", "lyrics": "[Hook]\nGet back, get back, get back back back\nGet back, get back, get back back back\nAyy hol' up hol' up hol' up hol' up\nWhat you reachin' for? (what you reachin' for?)\nNiggas ask a lotta questions, act like I don't know 'em (who the fuck are you?)\nNiggas say they get into it, I ain't even notice (I ain't even notice)\nTold 'em they would never catch me on my flying lotus (fly away ho)\nJust found out I'm claustrophobic I'ma need space (I'ma need space)\nReal short with my conversation these days (the fuck you want nigga?)\nI don't trust a soul I'm too paranoid (I don't trust 'em)\nI got voices in my head, they make too much noise\n\n[Verse 1]\nSleeping pills (no)\nScript refills (no)\nChronic (yes)\nQuicker thrills (no)\nPlateaued hills (no)\nIronic (yes)\nThe dollar bill (so?)\nMake 'em bounce (oh)\nHydraulic (yes)\nWhat the fuck y'all niggas finna do next to get your shit poppin' off ground and movin'\nTo turn your little sad scene into an epic movie\nWhat the fuck you niggas thought it was, oh you ain't understood me\nBetter get familiar, hope you know just what the fuck you doin'\nThis shit's a foreign language, hope you niggas speak it fluent\nAnd know exactly who you are before you get influenced\nPain's a potent drug if you take a hit (if you take a hit)\nThe void of reality it don't exist (no it don't)\nFeels like a fuckin' simulation I'm stuck in the glitch\n\n[Hook]\nGet back, get back, get back back back\nGet back, get back, get back back back\nAyy hol' up hol' up hol' up hol' up\nWhat you reachin' for? (what you reachin' for?)\nNiggas ask a lotta questions, act like I don't know 'em (who the fuck are you?)\nNiggas say they get into it, I ain't even notice (I ain't even notice)\nTold 'em they would never catch me on my flying lotus (fly away ho)\nJust found out I'm claustrophobic I'ma need space (I'ma need space)\nReal short with my conversation these days (the fuck you want nigga?)\nI don't trust a soul I'm too paranoid (I don't trust 'em)\nI got voices in my head, they make too much noise\n\n[Verse 2]\nAmphetamines (no)\nChlorophyll (no)\nHigh (yes)\nDramamine (no)\nSet a scene (no)\nDie (yes)\nIt's just a feel (so?)\nTo each his own (oh)\nI (yes)\nCould give a fuck what these niggas doin' just to get by 'cause I got my own issues\nFeelin' like I'm thrown out of the clouds while wearin' no suspension\nFeelin' like my ride went up and down with no maintenance assistance\nBut keep it cool, calm down, that's what they insistin'\nCouldn't find it had no urgencies in my situation\nAnd I been patiently wait, was I too late for the game?\nAm I a victim of fate (if you take a hit) make sure you blow some smoke in they face\n'Cause they was quick to take your plate and eat your food with no grace\n\n[Outro]\nGet back, get back, get back back back\nGet back, get back, get back back back"}], "artist": "K.A.A.N."}