{"artist": "Inspectah Deck", "songs": [{"title": "Who Run It", "lyrics": "[Intro]\nYeah, it's lit, yo Dan\nThis  beat sound like niggas want some money and somethin', man, fo' real\nHellfire,  Inspectah Deck, Streetlife\n(runnin', runnin', runnin', runnin')\n\n[Verse 1: Hellfire]\nLet's talk facts, niggas know that my gun'll blow\nEliminate  any question of \"Who run the show?\"\nSo  when its time to go to war, Hell unleash the violence\nIt gets fatal like a case of the Zika virus\nThe  book is closing, no time for new members here\nWe gettin' paper, sellin' well 'cross the hemisphere\nThe bottle is pourin', model's is whorin'\nAll the vehicle be top, be exotic and foreign\nIf  a nigga try to flex then his body is fallin'\nHis last place to breath be inside of a coffin\nEvery day I plot ways of how to get to this bag\nHit the plug for ten bricks and that we split them in half\nSee real niggas shouldn't respond with sneak disses\nMy fifth letter ring in your mouth like freak bitches\n(runnin', runnin', runnin', runnin')\n\n[Verse 2: Inspectah Deck]\nNo matter how you roll the dice, you know the soldier nice\nFlow sharp, you would think it was a Logan slice\nGrab bae, hold 'em, tight while I blow the site\nLike, hit a niggaquicker than a cobra strike strike\nYeah, you know the price, this shit'll cost ya, we own the night\nShittin' on you orifice, niggas wanna sequel when the bus is rollin'\nODB, nigga, please, you must be trollin'\nI adjust to no one, only fams within arms reach\nViolation of my fam, that's when the arms reach\nWhy they hatin'? 'Cause we takin'\nTakin' mad trips to foreign lands\nThey ain't even on vacation\nWhole scenery change, new greenery, strange\nCouple mamis and bikinis to flame\nOnly MV I fuck with, jeeps are stridden\nIt's gold time, no time for the foolishness\nWho run it\n\n[Verse 3: Streetlife]\nWe run it\nRebel I engage the call all morning\nPull up curbside on your block, who on it?\nHop out, guns drawn, nigga, you runnin'?\nNobody move, or catch tubes to your stomach\nWhile you talk about what you gonna do, we done it\nThis is nothing new to me, it's getting redundant (runnin')\nWho run it? You run from it, America's Most Wanted\nStill gunnin', I stayed flooded\nStreetlife, I spray hell's fire, I'm a known Arson\nI got mad priers, call niggas out like umpires\nYou's a damn liar, you didn't shoot, it was a misfire\nWe run these streets like car tires\nYou just squire in your own empire, you's a dick rider\n(runnin', runnin', runnin', runnin')\n\n[Outro]\nThe Wu-Tang were naturally enraged and they challenged Shaolin but all the other temples, they mediated. Our chief, Abbot, as a gesture of peace had to withdraw Shaolin. So Wu-Tang took\nShaolin's place. And after that, they became number one. (number one, number one)", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}