{"songs": [{"album": "Strangeulation Vol. II", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg", "year": "2015-11-20", "title": "Chilly Rub", "lyrics": "[Intro: Tech N9ne & (Woman)]\nTake off your shirt and your bra\n(Okay) Lay on the bed on your stomach\n(Hmm, okay)\nOkay, I'm 'onna straddle you now, okay?\n(Alright)\nI'ma place my palms up, then I'm gonna place the tips of my fingernails at the top of your left and right shoulders, and I'm gonna swirl down your back\n(Hmm)\n\n[Verse 1: Tech N9ne]\nNow you're 'bout to feel the chill bumps\nI'ma do this to you 'til lunch\nYou're the lunch that I'm talking 'bout\nMore chilly pimples popping out\nYes I'm giving you a chilly rub\nAin't it feeling beautiful you're loving what the milli does\nJust a little minute longer with the rubbing it is nothing\nYou'll be begging me to hit you with the Billy Club\nI'ma do it to it\n'Til you got to release that fluid spew it\nTape it let her friend who never knew it, view it\nDid you hella proper, now you it, do it\nYeah she running like a relay\nMeaning she quick when it hits D Day\nLike 180 on the freeway\nYou ain't gotta worry 'bout a thing nigga she lay\nChilly rubbing'll get you hot as an oven\nWhether you drinking or drugging\nIt get you ready for loving\nAfter you grub on the muffin\nYou gonna be shoving the stuffin'\nNigga you beating and busting like a percussion\nNigga it's on if she take off her top\nShivering's making her get the Riot Maker to pop\nShake her a lot\nYou really like her and want to ding her? Well\nPalms up down her back with the tip of your fingernails\n\n[Chorus: Tech N9ne & (Krizz Kaliko)]\nChilly rub (Uh huh!)\nCall me when he leave I won't come 'til he duck (Uh huh!)\nNeed the stimulation I'm the illy plug (Hey!)\nAnd you know I got that drink and I got the silly bud (Uh huh!)\nAnd I know you want that (chilly rub!)\nWatch me do it (chilly rub!)\nAll into it (chilly rub!)\nYou know what the chilly does (Uh huh!)\nI know you like this touchy-feely thug (Hey!)\nAnd every time we link you think it's really love\nFrom this chilly rub\n\n[Verse 2: Stevie Stone]\nWhen she's all alone on a late night\nShe on a belly, face down showing all cat\nGet to rubbing on the body and she moanin'\nGet to screaming like Stevie whatcha call that?\nI told her, baby wait a minute just fall back\nI made the cookie on the lady she applaud that\nAnd got the foreplay feeling fengshui\nAll gas baby tell 'em over haul that\nAnd I be digging real good in the morning\nText to your girls that booty fire\nShe'll be reminiscing thinking that she love me\nForgetting every nigga that she been with prior\nWhat is it? (Make her feel this way)\nWhat is it? (Tell her climb on me)\nWhat is it? (Let her ride that weed)\nBaby had a very long D\nI told her she could get it in time if she ready\nShe wanted stimulation and I'm trying to break the levy\nI got her face down ass up on her belly\nI'm tugging on her hair make her breathing all heavy\nShe fuckin' with the plug so the plug put the pipe down\n'Fore them other niggas pussy on strike now\nShe got a creme de la creme nigga tight now\nSaid she want it right now, came in a night gown\nChilly rub\n\n[Chorus: Tech N9ne & (Krizz Kaliko)]\nChilly rubs (Uh huh!)\nCall me when he leave I won't come 'til he duck (Uh huh!)\nNeed the stimulation I'm the illy plug (Hey!)\nYou know I got that drink and I got the silly bud (Uh huh!)\nI know you want that (chilly rub!)\nWatch me do it (chilly rub!)\nAll into it (chilly rub!)\nYou know what the chilly does (Uh huh!)\nI know you like this touchy-feely thug (Hey!)\nAnd every time we link you think it's really love\nFrom this chilly rub\n\n[Verse 3: Godemis]\nNow what the fuck is the drillbit? I'm wavy\nI'm still wetter to fill up what y'all gave me\nIf I had a controller could y'all play me?\nCause I'm hella rain but ain't chilling with y'all lately\nMe and them hood rats been on ten\nShe give me the green life and sin going in\nIf I apply pressure then the rules gon' bend\nConsensual fornicating fucking with grown men\nAnd everyone of y'all ready to be wet up\nI'm on another level I ain't ever gonna let up\nMy homegirl rolling got to help her keep her head up\nAnd know I got her MO trying to get her out her get up\nI get up, she get on and we on some other shit\nAnd she know what I'm on it's beyond she loving it\nAnd she don't need that top or bottom\nUnbutton it, I slap it, I flip it, I blast it\nI'm rubbing it and when I'm up in it\nShe wetter than a T-2\nNo I don't need another player just me and you\nI'm going off at the offence, D-2\nAin’t met a type flight nigga like me, true\nYou got a man but his plans just really dull\nHear what I'm saying roll out that's really bud\nI'm finna ground getting pounded pretty much\nTrick you're finna come and get this chilly rub\n\n[Chorus: Tech N9ne & (Krizz Kaliko)]\nChilly rubs (Uh huh!)\nCall me when he leave I won't come 'til he duck (Uh huh!)\nNeed the stimulation I'm the illy plug (Hey!)\nYou know I got that drink and I got the silly bud (Uh huh!)\nI know you want that (chilly rub!)\nWatch me do it (chilly rub!)\nAll into it (chilly rub!)\nYou know what the chilly does (Uh huh!)\nI know you like this touchy feely thug (Hey!)\nAnd every time we link you think it's really love\nFrom this chilly rub"}], "artist": "Tech N9ne"}