{"artist": "Peewee Longway", "songs": [{"album": "Running Round The Lobby", "title": "Drugs", "image": "https://images.genius.com/07f774957bb8c9b0f34c822c17a1eb9b.300x300x1.jpg", "lyrics": "[Hook: PeeWee Longway]\nAll my niggas on drugs\nAll my niggas on drugs\nAll my niggas got drugs\nParty pack turn up with your goods\nDrugs drugs drugs\nAll my niggas on drugs\nAll my niggas got drugs\nParty pack turn up with your goods\nDrugs drugs drugs (All my niggas geeked up)\nDrugs drugs\nAll my niggas got drugs\nDrugs drugs drugs (All my niggas geeked up)\nAll my niggas on drugs\n\n[Verse 1: PeeWee Longway]\nNarcotics narcotics\nHow bout it we got it\nCook dope wanna ASAP Rocky\nWrist game make it do the Ricky Bobby\nGot molly wanna run around the lobby?\nMe and my niggas booted up we in the lobby\nWe don’t roll doobies up or smoke Bobby\nPull up in the Bentley truck or the Rari\nHeard you wanna meet the plug I’m the socket\nA nigga too geeked up in Neiman Marcus\nI’m on drugs, bitch I beg you’re pardon\nI’m on the lean and the white Remy Martin\nMe and all my niggas on drugs\nMe and all my niggas we the plug\nMe and all my niggas give a fuck\nMe and all my niggas turnt up\nTurn down for what?\nRanned out of pints ‘fore I ranned out of supply\nTalking through the wire, boy your ass gon die\nDrugs made it happen, boy you think I’m a lie?\nMade a mil Saran wrapping, mail man make it fly\nI get higher when they tell me that the package arrived\nI got drugs in bitch I’m working\nYou can tell that I’m high from the look on my eyes I’m geeked up\nBitch me and my niggas\n\n[Hook]\n\n[Verse 2: MPA Shitro]\nI wake and bake to start my day then pull up on my plug\nAll my niggas trafficking we known for selling drugs\nGot 50 gas bags in the tub got another 100 bags on tuck\nGot your bitch popping molly booted up\nGot boys for the fiend shoot up\nDrop the work in the pot then you hit it with the fork\nTryna make your drugs double up\nI’ma jugg 100 bricks go buy a double R\nDope boy rich rolling off drugs\nI’m a walking PET poured up on mud\nSparkles on the pints of lean all all in the glove\nParty pack dipping out the party sack\nRolling up with the homies all on drugs\nDrugs drugs we all on drugs\nWho want jugg? We all gon jugg\nThe whole damn hood ?\nStill smoking cali bud out the Backwoods\nAll my niggas on jugg in the back hood\n? nigga we don’t bang that hood\nSay you getting money nigga put that on my hood\nDrugs drugs\n\n[Hook]", "year": "2013-08-18"}]}