{"artist": "E-40", "songs": [{"title": "Club Hoppin’", "image": "https://images.genius.com/cea2cd5542acbdb69525e943d142c9f9.600x600x1.jpg", "album": "Mr. Flamboyant ", "year": null, "lyrics": "[Intro]\nWhat’s up E mayne, we goin' to a little hookup?\nIt’s cool, I’m waitin on P and 'em to call me an whatnot\nThey say as soon as they page me\nHold on here we go, soon as they page me we will do it right here Jus plug it with it\nLet’s go do this thang mayne (ok that’s cool, that’s cool)\n\n[Hook: E-40]\nI see folks all over the place doing electric slide\nThe house is bumpin', everybody’s inside\nIf you step with me, then I’ll step with you\nIf we step together then we’ll all come through\nWhat’s really goin' on? Can we have some fun?\nGet at the ladies and put down the guns\nRead our mail and get paid on da gooch\nForm a team and unite into a group\nThis here way: we cannot be stopped\nEnjoy the scene and do the club hop\nRegardless of what, this you can’t ignore\nEverybody struck to the floor\n\n[Chorus]\nEverybody go\nE-E E-E Everybody go\nE-E E-E Everybody go on\nE-E E-E Everybody go\nE-E E-E (He drives me crazy)\n\n[Verse 1: E-40]\nCome along, come along with me\nFrom out the woodwork it’s E-40\nNo beatin' 'round the cocoa plant, straight to the point\nJust like dank I’m' bout to vibe this joint\nGo on and fetch you a companion\nMy duty is to make sure nobody’s abandoned\nI put this here on everything I love\nIf you get up and bug then you got plug (he drives me crazy)\nFreak baby girl then spit\nI know that’s the way it’s done by The Click\nAin’t none of that shammin', fakin' or barkin'\nStraight club hoppin' (he drives me crazy)\n\n[Hook: E-40]\nI see folks all over the place doing electric slide\nThe house is bumpin', everybody’s inside\nIf you step with me, then I’ll step with you\nIf we step together then we’ll all come through\nWhat’s really goin' on? Can we have some fun?\nGet at the ladies and put down the guns\nRead our mail and get paid on da gooch\nForm a team and unite into a group\nThis here way: we cannot be stopped\nEnjoy the scene and do the club hop\nRegardless of what, this you can’t ignore\nEverybody struck to the floor\n\n[Chorus]\nEverybody go\nE-E E-E Everybody go\nE-E E-E Everybody go on\nE-E E-E Everybody go on and dance if you\n(He drives me crazy)\n\n[Verse 2: E-40]\nI had to like push my way up in this here industry\nMCs wanted to get wit' me but really and truly I don’t have time to see\nI’m out here handlin' my business in and out the studio, gettin' my productions goin'\nThey say 40 you got to clean up yo act if you wanna receive seniority\nAirplay points and all that\nI was like mayne, I think I understand, I know it’s gonna be hard\nBut I need to come up wit' a fresh new game plan (he drives me crazy)\nWoo-woo-oo-oo-woo sounded dapper, while I was messin' around pushin' buttons on tha sampler\nWhatever you wanna call it and whatnot, the beat was knockin'\nStraight club hoppin'\n\n[Hook: E-40]\nI see folks all over the place doing electric slide\nThe house is bumpin', everybody’s inside\nIf you step with me, then I’ll step with you\nIf we step together then we’ll all come through\nWhat’s really goin' on? Can we have some fun?\nGet at the ladies and put down the guns\nRead our mail and get paid on da gooch\nForm a team and unite into a group\nThis here way: we cannot be stopped\nEnjoy the scene and do the club hop\nRegardless of what, this you can’t ignore\nEverybody struck to the floor\n\n[Chorus]\nEverybody go\nE-E E-E Everybody go on\nE-E E-E Everybody go on\nE-E E-E E-Everybody\nE-Everybody (He drives me crazy)\n\n[Verse 3: E-40]\nMini-skirts boomin', but you know I’m not up for groovin', plottin' and consumin'\nPuttin' to use my old school steps\nNow I’m pumped like a punk on a keg I can’t rest (he drives me crazy)\nI even got the security guards goin'\nLettin' a gang of people in free and talk 'bout this one’s on me\nProppin': proper and poppin'\nA gang related theme defines The Click, I’m off in there\nYeah, that’s the plan, caught up in somethin' that I do belive in\nShe was lovin' every minute of the speech that I was droppin'\nStraight club hoppin' (he drives me crazy)\n\n[Outro]\nI like to shoot a cut out to my sohab [?]\nE to D, Freddy B, Mack Mill\nNew Fad Clothing with the mob hood designed by Mac D-Shot\nThe House of Soul fo’ helping me get in my E zone\nBobby Cordonna, Gateway Studio\nThe Tank brothers: Pono and Peter\nMike Mosely, Mugzi and Tap Daddy\nLil' E-40 and my homie Tracy\n[?] fo’ helping me grind off my left side tapes\nBoss DVDs from the V and the whole Click faculty\n\nEverybody go on\nE E-Every everybody go\nE-E E-Every\n(He drives me crazy)"}]}