{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Veteran’s Memorial", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "[Verse 1]\nMemories play back like film\nI flash back we was little niggas living most real\n1989's when we first met\nWe first clicked over convo gettin twisted\nIn dun gram earth crib cutting outta school\nWatching cable it seemed like the over day\nThrough the eyes of a stranger we was kids\nBut in our own minds we was grown mens\nOutside on the block we would play the bench\nAnd y'all play the rock every chance y'all got\nAs I sat back and just watched\nHey, what can I say?\nThe same back then as I am today\nI can recall me, Jamil and Jamal\nIn the room drinking straight vodka with they moms\nWhen I walk home with the big nefertiti charm\nBack with the light blue camoflauge suit god\nMe and Hav' doing it hard trying to get on\nWe sample songs on the box with record and pause\nKilla B didn't even get his first firearm\nAnd I was still holding one shot derringers\n\n[Chorus]\nWho would think anyone of us would cease to exist\nLeft with just thoughts of the past to reminisce\nSometimes I see a chick walking past with ya kids\nOr find an old flicka of some 1-2-fifth\nAll the shit that we been through it boils to this?\nDun, I wish we could start it all over again\n\n[Verse 2]\n95 we on top touring the states\nA lotta times we even took the click overseas\nCame along way from the hallway\nSitting in the staircase with bacardi\nBring the honeycomb speaker outside to bang\nWhile we would share drinks with the other that came\nTriple L stayed taking they cash in dice games\nKilla Black grew to keep an ice grill, dun was not playin'\nYammy, the most infamous told me one day\n'Put the bogies down 'fore I pound you out P'\nBut it was all love, we was each others duns\nWe held each other down, borrowed each other guns\nIts hard to believe that niggas so strong\nCould die so easily forever be gone\nI could still feel the wet of your palm against mine\nCause we did our hand shake all the time\nWhy it have to be your time to go and not mines?\nSpilled tears contemplating to my delf cryin'\nAll the laughs we shared and fights we had\nAll the nights we would get nice, damn\nPlates of food we split in half\nI dedicate the rest of my life to all my niggas that passed\n\n[Chorus]\nWho would think anyone of us would cease to exist\nLeft with just thoughts of the past to reminisce\nSometimes I see a chick walking past with ya kids\nOr find an old flicka of some 1-2-fifth\nAll the shit that we been through it boils to this?\nDun, I wish we could start it all over again\n\n[Outro]\nWhat's the fuckin' deal, motherfuckin' Scarface nigga, killer for Bean, Fugi, Gooey, I can't take no more nigga, Corey, Black Ed, the fuck, knahmsayin'? I'll Will burnin'\nHarry, fuck yo, I can't take no more man\nFrankie, Spank, whattup man? Straight up\nMy grandmoms man, my granddad man\nGrandma Brooks, straight up my pops man\nStraight up man, that's it\nAll my dead, all my dead\nMan, the little babies man, no more man\nAbortion babies man, I can't take no more man\nI'll never forget you, all my dead it's all love man\nMotherfuckin' Yambo, in a minute, we'll be there\nMotherfuckin' Yammy, straight up, I can't wait\nYou was my strength nigga, I miss y'all\nI can't believe you gone nigga\n(You was supposed to be right here)\nWhat the fuck happened?\nAin't nobody else goin' away man\nYou ain't takin' nuttin' else from me man\nNobody can't take nuttin' else from me man, that's it\nI dare you! Come try, it's over man\nYou can't take nuttin' else from us yo\nThat's my word, I put my life on it I'll be next nigga, straight up\nI'll stand up for that\n'Cause ain't none of my niggas goin', that's enough\nWe had enough\nIt's the Veteran's Memorial right here man\nStraight up, man\nWe love y'all, one love", "year": "2000-11-14"}]}