{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Keys Open Doors", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Hook: Pusha T]\nKeys open doors, keys open doors\nKeys open doors, keys-keys open doors\n\n[Verse 1: Pusha T]\nYuugh! Make your skin crawl\nPress one button, let the wind fall\nWho gonna stop us? Fuck the coppers!\nThe mind of a kilo shopper\nSeeing my life through the windshields of choppers\nI ain't spend one rap dollar in 3 years, holla!\nMoney's the leash, drag a bitch by her dog collar\nNow, ho follow, this is my ghetto story\nLike Cham, Ice-P is the Don Dada\nOpen the Frigidaire, 25 to life in here\nSo much white you might think your holy Christ is near\nThrow on your Louis V millionaires to kill the glare\nIce trays? Nada! All you see is pigeons paired\nThe realest shit I ever wrote, not Pac inspired\nIt's crack pot inspired, my real niggas quote\nBitch never cook my coke! Why? Never trust a ho with your child\nAt you make believe rappers I smile! HA! Canal Streeting my style\nLike you internet sharing my files, you MySpace niggas\nSo kill the comparison, I'm South Beach sipping on Sarafin\nRoyalty check nigga, I never been\nCook money clean through Merrill Lynch\nAccountant just gasp at the smell of it! (Gasp!)\nMeet the dealer, ain't a bitch realer\nSo you ain't gotta question why Pusha don't feel ya!\nKnock it the fuck off!\n\n[Hook]\nKeys open doors, keys open doors\nKeys open doors, keys-keys open doors\nKeys open doors, keys open doors\nKeys open doors, keys-keys open doors\nKeys open doors, keys open doors\nKeys open doors, keys-keys open doors\nYeah\nKeys open doors, keys-keys open doors\n\n[Verse 2: Malice]\nThrow it on the scale, feed your God damn self\nGet it how you live, we don't ask for help (No)\nWord on the street is you gonna love how it melt\nAnd I don't come with a pitch neither, the shit sell itself\nI yell \"Re-Up\" til I'm locked like Mumia\nAnd get it 'cross-state with the grace of Maria\nKeep on toys, you goin' know us when you see us\nLiving street tales worthy of Don Divas\nKeys in the floor, mistress in Dior\nBitch tell me she love me but I know she's a whore\nShit could get ugly, shit she talk to the law\nAnd that's just what I get, it's the Roses of War\nFuck the Bureau! Rather be spending Euros\nAnd get fed grapes, fuck hoes in plurals\nJust like heaven as I gaze at the mural\nWhat a peace of mind when you cop you some Shapiros\nCheers to the future as we toast to life\nI'm Prive-ing in Miami, I'm a socialite nigga\nThe cars are big, the cribs are bigger\nThe kids are happy, the perfect picture\nGemstar razor, the fruit of my labor\nAnd I walk with a glow, it's like the Lord's shown favor\nThese bitches fake like the hoes on Flavor\nBut I don't mind spending, all it is is paper, yes!\n\n[Hook]\nKeys open doors\nKeys open doors"}], "artist": "Clipse"}