{"songs": [{"year": "2018-05-04", "image": "https://images.genius.com/b6424d6ad1ab459f68bef7045b421240.1000x1000x1.jpg", "title": "No Chorus, Pt. 11", "album": "SIMI", "lyrics": "[Intro]\nHah, Tay Keith (word)\nTika-tika-tika-tika-tika-Tay Keith (Tay Keith)\nI just pulled up with a chopper (hah), you got a three-eighty (word)\nLeave a nigga fired if a nigga ever pay me (huh?), hey\nTay Keith, fuck these niggas up\nLive, live, bitch I'm too live (word)\nBitch I'm smokin' big blunts (huh?), y'all niggas smoke two-five (that's on my mama)\nTwo-fives, what's a two-five to a three-five? (a three-five?)\nTwo guys, what's a two guys to a three guys? (huh?)\n\n[Verse]\nYeah bitch, this No Chorus, Pt. 11 (Part 11)\nDraw down with the gun like it's double-oh-seven (rrah, baow)\nTwirl a nigga, no baton, but I'll use it as a weapon (get back)\nWorrisome bitch up on my line, don't stomp the yard, bitch get to steppin' (to steppin')\nNigga playin', get jumped (get jumped)\nCrank a nigga like the lumps (lumps)\nHeadshot him with the pump (rrah)\nNow his brains gone (boom boom boom)\nAyy I'll smack a nigga if he say my name wrong (say my name wrong)\nI can't trust these niggas, they be singin', call 'em Trey Songz (yeah yeah yeah)\nAyy, do you want to take a ride with me? (a ride with me?)\nAll I mean, chopper on the side of me (raow raow raow raow)\nAyy I stand for the block, it's like a tribe to me (word)\nAnd I'll never switch up 'cause that's the pride in me (that's on my mama)\nHey, all we do is rob\nCatch an opp late night, bust him at his car (car)\n'Cause I caught him at the red light (the red light)\nAyy come hit the headlight (the headlight)\nThem niggas they scared, right? (they scared)\nFell in love with the forty, we some newlyweds right? (yeah we married)\nAw, no, they don't get it though (no no)\nOn my Chris Brown shit, my money stackin' wall to wall (wall to wall)\nWhen I went to school, made the team, but I ain't play the ball (never played it)\nMan I act a fool with them things, I up and spray at y'all (boom)\nBlocBoy be the fuckin' player (player)\nIf you with me, put your fuckin' hands in the air (in the air)\nI'ma shock the world but I ain't ever use a taser (use a taser)\nYou was the V, now you're G, boy you traitor (twist up, ayy)\nI'ma pull off in the 'Vette (skrrt, skrrt)\nMy nigga my left hand, but he on the right with the TEC (skrrt)\nDump at your car, leave it wet (huh?)\nYou was so scared that you fucked around and had a wreck\nBlocBoy the preacher, you blessed (blessed)\nI was in school with the work in my desk (the desk)\nI had the tabs and the perc for the less (what you want?)\nSell me too much then your ass will get stretched (I need all that)\nGet down, yeah you know the MO (the MO)\nMy money long like a limo (limo), your shit short like demos (huh)\nMy pockets fat like a hippo, forty on my hip though (yeah yeah yeah)\nHit the club, shot six fours, no lie it was lit though (lit, lit, lit)\nAyy, yeah it's time for everybody to rock with me (rock with me)\nIf you think that you gon' kill me, you gon' lay down and drop with me (die ho)\nSayin' BlocBoy is a ho, that's like sayin' the cops with me (the cops with me)\nTwenty-five for a bow, ayy lil nigga come shop with me (shop with me)\nGet your money up (bitch)\nWe don't do no leg shots, we shoot the stomach up (the stomach up)\nAnd we gon' bend your bitch down until her tummy tuck (until her tummy tuck)\nCuz put the tommy up (put that down cuz)\nWe Bloc Nation, everybody know we keep them guns with us (duh)\n\n[Outro]\nFuck wrong with y'all niggas?\nY'all niggas stupid\nAyy, fuck that, ayy Lil Lee, come finish these niggas off Lil Lee, ayy\nYeah, ayy man, say man, yeah man\nEvery time Tay Keith get on this motherfucker he gon' fuck 'em up again and again man\nAnd Bloc gon' keep makin' play after play man\nAnd if you hatin', suck it easy bitch, fuck you talkin' 'bout?\nYeah man, Glock Nation, Bloc Nation\nIf you hatin' get the Glock Nation, bitch, haha\nWorry, haha"}], "artist": "BlocBoy JB"}