{"artist": "Fat Joe", "songs": [{"year": "1998-09-01", "album": "Don Cartagena", "image": "https://images.genius.com/f5c1dde7c10db5efcf281667957c213d.953x953x1.jpg", "lyrics": "Yeah, uhh, dat gangsta shit\nUhh, yeah, dat gangsta shit\nUhh, dat gangsta shit\nWhat you love huh? Dat gangsta shit\nWhat you want huh? Dat gangsta shit\nNow what we live huh? Dat gangsta shit\nYeah, uhh, uhh\n\nRecognize my presence, this rap game specialized with legends\nI drop shit niggas try to memorize in seconds\nYou criticize me, still visualize the lessons\nAnd when I wish to put aside the questions\nBefore they find out, who's the realest\nWho done spoke without one joke about the illest\nShit that ever happened, in this rappin beyond rappin\nJoe the God it ain't so hard to start clappin\nBut I lay low, create flows, for the pesos\nNow we got extra hoes, wantin to chase shows\nI take foes, and break em down to minerals\nWe went from street corner thugs to white collar criminals\nIndividuals, with no peace on the quest\nThe iced out, piece on my chest, from the East to the West\nNever sleep in a sweat, keep the heat with the vest\nReady for the 'casian blazin gettin deep with the best\nThe police wanna test my strategy, got half of the world\nMad at me, but very few challenge me\nPerhaps you will be the first to approach this, lyrical dope shit\nCartagena will bring the chrome like explosives\n\nNow what you love huh? Dat gangsta shit\nWhat you want huh? Dat gangsta shit\nNow what we live huh? Dat gangsta shit\nDat gangsta shit, dat gangsta shit\n\nYeah, uhh, uhh\nFuck the whole world, all I need is my dough and my girl\nAnd even she can get it, everybody go to hell\nI don't need y'all, disrespect the Don and I'mma see y'all\nHit you with the tech and the armor, you see-saw\nThat's my steez, if I don't kill you I'mma clap you these\nAsk your peeps if I ain't have the beast soundin Japanese\nCoughin blood, that's what you get for talkin thug\nRun up on your preacher with the sweeper feature coughin slugs\nOnce a thug always a thug, hallways and drug dealers\nFillers, killers, they wanna chill all day with us\nThey love the Don, these words are more than just another song\nIf I said I slit your neck, your jugular's gone\nAin't nothin artificial, Joe the God, the Terror Squad official\nGot a lot of pistols with missiles, Pray Allah is with you\nThe shit you say'll get you sprayed with the clapper\nJust remember Joe the God is not your ordinary rapper\n\nNow what we love huh? Dat gangsta shit\nWhat you want huh? Dat gangsta shit\nNow what we live huh? Dat gangsta shit\nDat gangsta shit, dat gangsta shit\n\nNow what you love huh? Dat gangsta shit\nWhat you want huh? Kick dat gangsta shit\nWhat you live huh? Dat gangsta shit\nDat gangsta shit, dat gangsta shit\n\nYeah\nGoin out to all the real niggas\nAll the niggas that support real hip-hop\nAll my niggas on the corners\nDJ's, no matter where the fuck you from\nIt's where's your gat, hahaha\nPrimo whattup nigga? Yeah\nDon Cartagena\nTerror Squadian, rock the party and, what?\nBeotch!!", "title": "Dat Gangsta Shit"}]}