{"artist": "Fashawn", "songs": [{"year": "2016-07-15", "album": "Manna", "image": "https://images.genius.com/7909de42acaa53e8d7f09f09fc2be548.500x500x1.jpg", "lyrics": "[Intro]\nYou’re dealing with a criminal government here\nThese are criminals in power\nAnd it didn’t start with Bush\nThinkin’ that you making progress\nWhere the hell is the progress for the masses of your people who are going backwards?\n\n[Verse 1]\nTemptation of enemy, how does man avoid it?\nTook away his profits handed him the poison\nGave him ten commandments and a pamphlet to follow\nThis world’s like a xanny: too massive to swallow\nRegurgitated what I consumed\nAt times I wish I could’ve stayed in the womb\nSomebody, anybody, what’s the worth of a black life?\nOr even a brown one? I heard they get found son\nWhen his noodle’s hanging outside of his dome\nMama gotta pay for the funeral, need a loan\nShe’ll be lucky if his murder even make the news\nI feel a pain like Billy when she sang the blues\n‘Bout the strangest fruit, have to have a bite\nBlame America for my appetite\nI even heard the new KKK is Kim, Kylie, and Kanye\nMother Amerikkka\n\n[Hook]\nTell me how could you take my smile away from me\nYou said you love me, but you lie, you lie, you lie\nTell me how could you take my smile away from me\nYou said you love me, but you lie, you lie, you lie\n\n[Verse 2]\nYo Lady Liberty got a pentagram in her vagina\nEver seen a tommy gun in the hands of a minor?\nEver seen a cop grab his cannon and fire\nAt somebody unarmed? A brother bodily harmed\nFeel like I don’t belong, I want eye on the law\nThinkin’ if they kill us one by one—problem resolved\nI might get Willie Lynch’d for this rhyme\nA pinch with some time, my face on a picket sign\nA nation on fire while money’s the messiah\nEven treat they own presidents like pariahs\nWish it was simply black and white, no Mariah\nIn the USA the hue is Freddie Gray\nConfusion infused with the ignorance\nI wonder if I’m a citizen or an immigrant\nThey have the nerve to call my family illegal\nWe all spinnin’ on the axis of evil\nMother Amerikkka\n\n[Hook]\nTell me how could you take my smile away from me\nYou said you love me, but you lie, you lie, you lie\nTell me how could you take my smile away from me\nYou said you love me, but you lie, you lie, you lie\n\n[Verse 3]\nNo justice for Alton Sterling or Bettie Jones\nMiguel Espinal, Nathaniel Picket, Philando\nThat’s the taste of a Bland decision\nAbulances, families panic-stricken\nLie in a casket or you could land in prison\nThat ultimatum still stands in the land we live in\nAll it took was a few grams, got my man convicted\nIt’s harder being Dante than being Darren Wilson\nSo N-O-T-O-R-I-O-U-S in the U.S\nShe down, blow\nIn debt, confess we owe each other a lot\nStill I hug her like she the only mother I got\nEven though she threw shade on the sunniest spots\nTurned every one of her sons into something they not\nI been insane since I came out her stomach\nI don’t know how else to say I’m in love with Mother Amerikkka\n\n[Hook]\nTell me how could you take my smile away from me\nYou said you love me, but you lie, you lie, you lie\nTell me how could you take my smile away from me\nYou said you love me, but you lie, you lie, you lie", "title": "Mother Amerikkka"}]}