{"songs": [{"album": "I Really Rap", "year": "2017-11-30", "title": "Can’t Stay Away", "image": "https://images.genius.com/8c75d09384d3e2e7dd519dae8ec8c1f5.1000x1000x1.jpg", "lyrics": "(...And I can’t stay a away from you...)\nZeusy, yeah, look\n\n[Verse 1]\nI don't get busy, I stay busy\nI’m a patriot who be airin’ it, who can hang with me?\nShit, my alias should be alien, outta space trippy\nGot the gang with me, I’m a terrorist, don't play with me\nLook, [?]\nCome and get servered by the bad man\nProcecutor tried to lynch me ‘cause I flip birds like I’m Marshawn\nFlip birds like an Osborn, whip swerve with the top gone\nBall so hard, I fill the bleachers, popcorn, get your popcorn\nYeah, ain’t nobdy better, where your goons at? You can die together\nMake your body tremor when it boom bap like the 90s era\nI was on the block in the 90’s, hopin’ that the cops wouldn’t find me\nComin’ with the rock like I’m Kyrie, they was coming for the rock like Tyrese\nWait, better tell them all, I was 5’8” but I kept it tall\nManute Bol when I’m lettin’ off, I would school holmes, LaMelo Ball\nDawg, y’all on some amateur shit, why would you claim to spit?\nSuper Sweet Sixteen, which one of your parents are rich?\nHuh?\n\n[Bridge]\nI mean, how I’ma stay away when these niggas out here shit in that garbage, straight dirt\n\n[Verse 2]\nYou the dumbest, dummy, we ain’t buddy, buddy\nBack child support, you bastards ain’t got nothin’ for me\nThink you seein’ me? Put a band up ‘cause I want your money\nThis NeNe Leakes doin’ stand up, ain’t nothin’ funny\nI’m Hussein with the flow, fuck them new names that you know\nHave ‘em tryin’ to rap from a wheelchair like he 2 Chainz at a show\nAll you new names got to go, one man rock band on these keys\nBy the time you get to his prints, they like, ”Gotdamn, he OD’d”\nI reload on these haters, my ego say we major\nDonald Trump in PR, I hit free throws with this paper\nHe low on this paper, he get primo’d to his maker\nChigga, chigga, I’m smoke ready, pre-rolls in Jamaica\nLook back on for the season, in this Jaguar, I’m speedin’\nGot a drive like ‘Bron ‘Bron, put this rag on for no reason\nSkrt, rap god in my region so it’s hats off when I’m beastin’\nHe no fear but me no care like it's Patois that I’m speakin’\nYeah\n\n[Outro]\nYou understand? You get it now? Get that “watered down, retarded, yellow short school bus, 4 four kids in a class with a helmet on” flow the fuck outta here\nShit quiet, the boy back, Zeus, Harlem\n\n(...And I can’t stay away from you...)"}], "artist": "J.R. Writer"}