{"artist": "Z-Ro", "songs": [{"album": "Sadism", "title": "Crazy", "lyrics": "[Chorus: Z-Ro]\nWho wanna be boo'd up, hell no, I ain't crazy\nI only met you last night, no I ain't crazy\nTryna get the keys to my house, I ain't crazy\nYou sexier than a bitch, but I'm not that crazy\nWe did it last night, must have drove you crazy\nThinkin' we a couple now, ain't that crazy?\nWanna have a baby, do i look that crazy?\nI hope you know now that I'm not that crazy\nNo, yeah\n\n[Verse 1: Z-Ro]\n24 hours later you love me, huh\nDon't know what to do with your hands you wanna touch me, huh\nYou was acting like you was all that (What?)\nNow you the one that need the fall back (What?)\nYes, you the one that got lucky, huh (Ha-ha)\n'Cause I know I put it down\nYou was leakin' so much, I thought I was 'bout to drown (Splash)\nNow you wanna know who my bae is\nBaby I don't do that bae shit\nI'm just tryna keep you naked (Hey)\nWhenever you come through, I'ma fuck you (Hey)\nMight make love to you but you know I don't love you (Hey)\nLet's just keep it playa baby\nI ain't tryna be your savior baby\n\n[Chorus: Z-Ro]\nWho wanna be boo'd up, hell no, I ain't crazy\nI only met you last night, no I ain't crazy\nTryna get the keys to my house, I ain't crazy\nYou sexier than a bitch, but I'm not that crazy\nWe did it last night, must have drove you crazy\nThinkin' we a couple now, ain't that crazy?\nWanna have a baby, do i look that crazy?\nI hope you know now that I'm not that crazy\nNo\n\n[Verse 2: Carol Cake]\nWhy you don't pick up the phone when I'm callin'?\nStop actin' like these other niggas don't want me, they all tryna holla\nI ain't chasin' nobody, I'd rather be chasin' them dollars\nLearned my lesson the hard way, fucked around then I got called up\nCould it be my past comin' back turnin' into karma? (Damn)\nHad to let my ex go, that boy was nothin' but drama\nOnly thing I'm worried 'bout is gettin' into these commas\nLet's take a trip across the water and go to Yokahoma\nIf you act right I could be your lady, if you act right I could have your baby\nPull up in that all blacked out Mercedes, cake by the pound, might be stunin' daily (Yeah)\nBitch wanna have beef, pour the gravy (Yeah)\nMy enemies mad, they love to hate me (Ha)\nSelf made queen, I ain't never been lazy\nOne taste of that cake gon' make you crazy\n\n[Chorus: Z-Ro]\nWho wanna be boo'd up, hell no, I ain't crazy\nI only met you last night, no I ain't crazy\nTryna get the keys to my house, I ain't crazy\nYou sexier than a bitch, but I'm not that crazy\nWe did it last night, must have drove you crazy\nThinkin' we a couple now, ain't that crazy?\nWanna have a baby, do i look that crazy?\nI hope you know now that I'm not that crazy\nNo", "year": "2018-11-16", "image": "https://images.genius.com/2cce230c16c8a42c1f80ef21c26b55ab.1000x1000x1.png"}]}