{"artist": "The Game", "songs": [{"title": "Baby You", "album": "1992", "year": "2016-09-30", "image": "https://images.genius.com/03506c153faf2bbd7f787f31a87bf74c.600x600x1.jpg", "lyrics": "[Intro]\nBaby, baby\nBaby you, baby\n\n[Verse 1: The Game]\nBaby you know you got me goin' crazy\nYou run around my head like these waves\nYeah baby you, you know that you the one that I adore\nThe one I introduced to Tom Ford at dinner\nThat was you, you'se the one I fell in love with\nThe one I move these drugs with but now you on some fuck shit\nAnybody but you\nI ain't figured that you would be the one to cut me\nLeave me on the floor fuckin' bloody, God damn\nBaby you, you had me fooled the whole time\nNow you got me in King of Diamonds givin' these hoes time\nGirl, baby you, I can't blame you though\nWhen you see the door, you see the door\nNow listen, baby you\n\n[Hook: Jason Derulo]\nEvery time I decide to leave you all in the past\nBaby I be, thinking 'bout you on the long drive, yeah\nAnd you ain't no one to make me feel unsatisfied, no, uh\nBut baby you, you got me going, uh\nBut you got me going, you got me going, uh\nBut you got me, you got me, you got me\nYou got me, you got me, yeah\nYou got me, you got me, you got me\nYou got me, you got me\nBaby you, yeah, oh\n\n[Verse 2: The Game]\nTell me how you think we livin' how we live?\nLike you the one that put us in these cribs\nNot me but baby you\nLike I ain't gettin' money for these shows\nI guess you think I'm trippin' on these hoes\nThey fans but look at you\nWho in them Celine bags? Who in them Giuseppes?\nLouboutins, wanna bet me? I win 'cause it's you\nYou begged me to get on that show\nI ain't want it but you did, I'm a real nigga, I did it for you\nYou don't see Swizz and Alicia\nKim K and Kanye, arguin' all the time\nIt's just you, I begged you to marry me\nHalf a million dollars out my safe down the drain\nBut fuck it 'cause that was you\nDamn we got some beautiful kids\nBut you never say it somethin' we did\nI guess your baby daddy you\nRegardless of the shit we go through\nI got Jason in the booth, 2 AM singin' shit about you\n\n[Hook: Jason Derulo]\nEvery time I decide to leave you all in the past\nBaby I be, thinking 'bout you on the long drive, yeah\nAnd you ain't no one to make me feel unsatisfied, no, uh\nBut baby you, you got me going, uh\nBut you got me going, you got me going, uh\nBut you got me, you got me, you got me\nYou got me, you got me, yeah\nYou got me, you got me, you got me\nYou got me, you got me\nBaby you, yeah, oh\n\n[Verse 3: Jason Derulo]\nBlood is money and I spent it on ya\nAin't it funny how it ended, oh yeah?\nYou said you'd go down for the last time\nBut we both know it's not the last but I saved mine, uh\nLong as you going down\nI'ma tell you what you want to hear, uh\nWell you got me, you got me, you got me\nYou got me, you got me, yeah, oh\nI'ma tell you baby, you got me, you got me, you got me\nYou got me, you got me (you got me, you get me)\nWhat you need a ring for?\nWhen you got me baby, yeah, yeah\nDon't listen to what your friends say\nDon't listen to what the people say\nDon't listen to the blogs baby\n'Cause they full of shit, oh, oooooh\n\n[Outro: Jason Derulo]\nOoh, ooooh, hey\nYeah baby, yeah baby"}]}