{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/keith-murray-e1302009751237.jpg", "title": "Nobody Do It Better (Tyrese)", "lyrics": "[Intro: Tyrese]\nTyrese!!!\n\n[Keith Murray]: (Tyrese)\nKeith Murray!!! (WOO!!!) Def Squad!!! (I like this right here man) Me too\n(Keith Murray you did that! Talk to 'em!) Yeah!\n\n[Verse 1: Keith Murray]\nKeith Murray, the lyrical hannibal floe cannibal\nAnimalistic tough guy man handle you\nI came into this bitch my style hardcore\nThen I heard a hater say he ain't fire no more!\nWhat?! That was me standin on your block with the razor blade\nIn my mouth back when hip hop was hip hop\nFor those who don't know or forget\nTo make y'all happy with Mary J. who Puff came to get (Me)\nThen who called for Total to make y'all see (Me)\nThen who he called again for Special Delivery (That a be me)\nThere's nothin you could tell me, I rocked every hole in the wall\nThen arena to arena with R. Kelly\nWho made you feel beautiful while gettin lifted (Me)\nI rocked bells with L you must be stupid\nI don't need no permission, to do what I do\nCome through and show the whole world how I do\n\n[Chorus: Tyrese] (*Keith Murray)\nThat's why your lovin me cause can't nobody do it better\nThat's why your lovin me cause can't nobody do it better (Can't nobody)\nThat's why your lovin me cause can't nobody do it better\nI'm gonna be right here to get your shit together (*Right here, yo!)\n\n[Verse 2: Keith Murray]\nAnd who you know get out of jail and get them figures\nGet back into the game like f**k the system\nHit the studio and bless y'all with Fatty Girl\nWho got 'em sayin ba donk a donk around the world\nNow I'm hearin I got anger issues on the street\nThe only anger I got, is when I'm f**kin up a E beat\nKeep runnin your lips and I'm a have you dancin like the crips\nTurn your six pack to some barbeque rib tips\nMother hot damn this man jam like a phone\nAnd plus the shit I get more draws than a dresser\nWhen I flow, there's no one deafer\n\nMake you make the ugly face like Lamont's Aunt Ester\nYou can't stealth me my tank is too healthy\nEven negative situations help me\nWhen E lace the beat, and me and Ty bust one\nTrust son that's money in the bank like a trust fund\n\n[Chorus: Tyrese]\nThat's why your lovin me cause can't nobody do it better\nThat's why your lovin me cause can't nobody do it better (Can't nobody)\nThat's why your lovin me cause can't nobody do it better\nI'm gonna be right here to get your shit together\n\n[Verse 3: Keith Murray]\nYo! Keith Murray is your excellency MC Ultra\nWith the sickest comeback like nigga I told ya\nHoneys sweat me like conversation, mind affiliation\nHouse niggas like the Fannie Mae Foundation\nThe K don't play f**k around touche' and toupee\nWhat you say get done away like Faye\nI rhyme flagrant you sweeter than a sugar fragrance\nIgnoramus, blow your brains out on a pavement\nThe game we been milkin for awhile like a green cow\nYou seregant MC, that ain't your style\nMetaphors dawn on you in time like revelations\nBattlin Keith, self mutilation\nLet it be sensible, I'll make you invisible\nNiggas can't see me the flow is invincible\nMy style royalty like residuals\nYou subjectable, hospitable y'all niggas is despicable\n\n[Chorus: Tyrese]\nThat's why your lovin me cause can't nobody do it better\nThat's why your lovin me cause can't nobody do it better (Can't nobody)\nThat's why your lovin me cause can't nobody do it better\nI'm gonna be right here to get your shit together\n\n[Bridge: Tyrese] (Keith Murray]\nOh his flow is so (Keith Murray, Black Ty) I won't let go (Word up)\nOooh his flow is so, oh!!! I won't let go (Aight here we go)\n\n[Outro: Keith Murray] (Tyrese)\nYeah yeah yeah!!! No doubt (I like the way this feels right here!!!)\nIt's classical baby (Make me wanna get on the freeway you know in the fast lane)"}], "artist": "Keith Murray"}