{"songs": [{"image": "https://images.genius.com/15a79e9b319ecd94a9131a5bc8bbd010.1000x1000x1.jpg", "title": "Chun Swae", "album": "Queen (Bonus Version)", "year": "2018-08-10", "lyrics": "[Intro: Swae Lee, Young Thug & Future]\nFall off in the spot\nWait up, they gon' do it while you drop\nMetro!\nPull up with no top\nIf Young Metro don't trust you, I'm gon' shoot you\n\n[Chorus: Swae Lee]\nFall off in the spot, every girl coming like a shark\nAnd you know my necklace, sitting on ski resort\nFall off in the spot, every girl coming like a shark\nPut that thing in park, I'ma let my fin pick you apart\nGlowing in the dark, fifty some' girls on board\nRunning with the marksmen, everything on point like, \"En garde!\"\n\n[Verse 1: Nicki Minaj]\nYo, I'm me, I'm Barbie drippin'\nDB9, Barbie whippin'\nIf he say he don't want me back, he be lyin'\nBitch, I'm the sauce, Barbie dippin', I'm the boss, Barbie sippin'\nThey keep tellin' me work it, I ain't got no chores\nI'm all yours, Barbie kissin', call the stores, Barbie shippin'\nOut or indoors, baby, I'ma floss\nWhat? Why of course, Barbie tippin', I endorse, Barbie strippin'\nMink carpet, but I ain't got no flaws\nDoors look like wings, Barbie sittin', bada-bing, Barbie trippin'\nCurve niggas like they arm in a sling\nHopped off the swing, Barbie swingin', to the ring, Barbie blingin'\nGood box, so he called Don King\nWho the fuck gon' party with them dollies, no I never do the mollies\nIf I hit you, then you probably gon' sue\nWho the fuck gon' come through with the body, always lookin' like a hottie\nAlways saying what somebody won't do?\nWho the fuck gon’ pull up in your city, looking every bit of pretty\nWith the itty bitty titty bitch crew?\nWho the fuck gon' beat him with the .22 if he don't lose the attitude\nAnd run off with his credit cards, too?\n\n[Chorus: Swae Lee]\nFall off in the spot, every girl coming like a shark\nAnd you know my necklace, sitting on ski resort\nFall off in the spot, every girl coming like a shark\nPut that thing in park, I'ma let my fin pick you apart\nGlowing in the dark, fifty some' girls on board\nRunning with the marksmen, everything on point like, \"En garde!\"\n\n[Verse 2: Swae Lee]\nThousand dollar massage\nI don't ever miss my mark\nAnything I like goes in the cart\nI might spend it all to prove a point\nRolling west coast, Arnold Schwarz'\nIf she lick her lips then I'ma join\nIndo I'ma spark\nWhen I cash out, that's her favorite part\n\n[Verse 3: Nicki Minaj]\nThey delivered my Lambo, all white with a tan bow\nMy body's a work of art, he eatin' this Van Gogh\nI'm not in the bando, I'm Pablo Sandals\nWhite beaches, candles, we sexin', Anglo\nWh-wh-what you think all these niggas wanna cuff for?\nA lot of Bloods, what you think they in the cut for?\nYeah, it's a sweep, I ain't talkin' when the dust fall\nMy winnin' streak still hasn't peaked, you little dust ball\nBitch I'm a star-ar, me and Swae Lee, yah, yah\nG-4s, 5s, Chun-way on the runway, yah, yah\nRiccardo Tisci in Milan, you see me modelin', ah\nDinner with Kar-ar, dinner with Karl Lagerfeld, yah\nYeah, this that Steven Klein, Mert & Marcus, yah, yah\nYeah, just to take a picture, I go raise the bar far\nI'm bitchy, yah, yah, really bitchy, ah, ah\nAmerica's Next Top Model, call me Yaya\nE-every time I score she gon' hear them swishes, ah\nTell that bitch I'm in the league, she still play for Wichita\nI piss hits broad, call me the swish God\nThe swish, swish God? Yup, the swish God\n\n[Chorus: Swae Lee]\nFall off in the spot, every girl coming like a shark\nAnd you know my necklace, sitting on ski resort\nFall off in the spot, every girl coming like a shark\nPut that thing in park, I'ma let my fin pick you apart\nGlowing in the dark, fifty some' girls on board\nRunning with the marksmen, everything on point like, \"En garde!\"\n\n[Outro: Nicki Minaj]\nMhm, shout-out Giovanni\nFor doing that \"Barbie Tingz\" video, uh-huh\nNina Garcia, Stephen Gan, Elle mag, yuh, uh-huh\nI’m still on my Naomi shit\nWilhelmina Models tip\nWeezy, Mack, Baby, Slim\nGee, I see you, Jean, Tezz, El, Shawn Gee\nMonte, Avery, Roppo, Joe, Katina, Mike, Dave, Gary, Josh\nUh, Rap, Jigga, Kim, Wiz, Hillary, Khloé , Biggz\nJuice, I see you Juice, keep me rollin' Juice\nYou're in the middle of Queen right now, thinking\n\"I see why she called this shit Queen\nThis bitch is really the fucking queen—ahh!\"\nAhahahaaah! Rrrrr!\nI love my fans, I love you so much"}], "artist": "Nicki Minaj"}