{"songs": [{"title": "Last For Life", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2016-04-16", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg", "lyrics": "Ay\nI promise we gone live how we want\nI promise we gone get all we want\nSplit the bill, naw forget the bill, look\nWe gon' buy the whole restaurant\nRemember way back when we had said back then\nWe will be the ones to have arenas packed in\nLivin' big time\nYup big time\nTo the point where my name could've been Big Ben\nNo matter what they gave out I never gave in\nWithout sunshine I never caved in\nI'm Finally Famous 'til the lights is faded\nThen the crowd is jaded\nWhen I hop on stages\n\n[Hook]\nHey\nYou don't live for life\nSo live your life\nWhen you live and die\nLook back and say you did it right\nWhen you get it right\nI hope it lasts for life\n\n[Hook x2]\nLast for life\nLast for life\nLast for life\nMan I wish that this could last for life\n(Lookin' back) Lookin' back on all we saw\nWho woulda thought we'd get this far\nYou search your life for Heaven on Earth\nWhen you get it right hope it lasts for life\n\n[Verse 2]\nI promise they gone all try and be me\nI promise they gone know who we are\nI promise we that gon' be successful\nWith or without the college degree\nRemember old head use to tell my momma\nThat boy gon' be something that there I promise\nSo they should not expect nothin' less than to see us set like dinettes, I guess\nAnd we all waitin' for tomorrow\nSometimes without acting you gotta deal with drama\nHey to get these dreams I figure it's gon' take more than Nyquil and pajamas\nBut they know what's up\nWe hoppin' out, and they know it's us\nWhen we get it right\nLook back and say\nThat we did it right\nAnd hope it lasts for life\n\n[Hook x2]\nLast for life\nLast for life\nLast for life\nMan I wish that this could last for life\n(Lookin' back) Lookin' back on all we saw\nWho woulda thought we'd get this far\nYou search your life for Heaven on Earth\nWhen you get it right hope it lasts for life\n\n[Big Sean Talking]\nYo I remember I used to ride to school with my dog Tone\nAnd we be like listening to Kanye, Jay-Z, you know like everybody, basically\nAnd it's crazy now cause I do business with them\nYou know people always ask me like you know, \"Why you ain't go to school? Why you ain't go to college?\"\nIt's like man, I didn't go to college cause...this is what I want to do, you know what I'm saying?\nThis is my dream\nYou know the thing is you can go and ask Jay-Z who Big Sean is, you can ask Pharrell who Big Sean is, you could walk into Def Jam offices right now be like \"Who is Big Sean?\" and LA Reid will tell you who Big Sean is\nYou can ask Nigo who Big Sean man, and they know\nI'm 20 years old man, I done been around the world. I done been around the world. I done been around the world doing what I love to do\nLike, what more could you ask, you know? And that's real"}], "artist": "Big Sean"}