{"artist": "R. Kelly", "songs": [{"album": null, "year": null, "lyrics": "[Jay-Z]\nEverything ain't hardcore you know\nI can't sing but my man\nI'ma let my man smooth that thang out for you\nYou know, take the edge off, you know what I'm sayin'?\n\n[are. Kelly]\nAll my s*** ladies throw ya hands up high\nAnd all my real playas throw ya hands up high\nAnd just keep on bouncin' while I take you on a ride\n\n[Chorus: are. Kelly]\nIt's like your body's on radio I'm feelin' you in stereo\nPut me in your cd player I'm gonna hit it nice and slow\nBaby I'm your hot mix bumpin' in your cherry Lex\nCheckin' out your widescreen while your hands up on the headrest\n\n[Verse 1: are. Kelly]\nI'm, in the studio thinkin' about my next hit song\nTryin' to come up with a melody that will turn you on\nOn the mpc3000 tryin' to come up with beats\nThat'll make come on over here and lay down here with me\nI'm searchin' for that special mind blowin' melody\nAnd it's gotta be s*** so I'll think it through carefully\nIt's like I'm tryin' to tune it, to ya station babe\nTry to get you to play, this record babe\nEvery time I hear this track girl I think about me and you\nIn the Maybach doin' what we do\n\n[Chorus:]\n\n[Verse 2: are. Kelly]\nUm, now I know a few friends of mine that has made love to this record\nSo when you're in the mood call the station, request this record\nShe walks in the room, says \"'Ly I can't breathe\"\nAs I try to catch my breath and proceed\nLookin' at yo' s*** smile, while I put my vocals down\nGirl you have made this song a hit in each and every town\nYou a s*** melody with a touch of freakin' harmony\nSuch a perfect chemistry\nGirl we deserve a Grammy, or Soul Train\nBillboard, mtv or bet award\nRollin' like we on a tour\nOoh the way you put it down girl I can't take it\nS** was so good girl we've got to do the remix\n'Cause girl you a mix master\nWhen it comes to pumpin' you such a ghetto blaster\nIt's such a hit that I gotta bootleg it, yeah\n\n[Chorus:]\n\n[Verse 3: Jay-Z]\nA melody is the chemistry, the way we click\nIt's like four part harmony and all that shit\nYour waistline is the bassline, I ride that shit\nStrung off your treble and I'm high as shit\nWe made love in the studio when we got together over and over again like a loop\nDamn I'm missin' you, it's hard to listen to\nAll these different dudes, huggin' and kissin' you, fuck!\n\n[Chorus:]\n[are. Kelly]\nYeah, I'm feelin' you in stereo\nAw yeah, aw yeah, yeah", "title": "Feelin’ You In Stereo", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}