{"artist": "Cam’ron", "songs": [{"title": "Dat All", "album": "Ghetto Heaven Vol. 1", "year": "2013-10-01", "image": "https://images.genius.com/01b2584dd85d0bcfad6cde9603330f8b.500x500x1.jpg", "lyrics": "Pull ups in the Park, in the Winter-Time\nPull up in the dark, I got a Sinner’s Mind\nYou kno just how i get, when it’s Dinner Time\nYou ain’t gotta like me but you know that I’m a Winner, 5\nNo disrespecting Nicky Barnes, Fritz neither\nLa, Az, M&M , Rich neither\nBut I’m top shelf, Harlem: Hall of Fame dun\nThe Lennox Ave \"Forest Gump\", I’m on the long run\nAnother piece, another Charm\nAnother Bracelet damn I need another arm\nThe only 2 I respect is Puff and Wan\nI can’t front on Mandeces\nAnd we got it for cheap , u kno that Mira Mira\nJust picked up 30mil from Netflix\nThen you wonder why I don’t Sweat Chicks\nMan I Check Chicks\nEven JuJu know.. Act right, or I’m on to the Next Bitch\nNah, I love you booboo, you know I’m playing Baby\nMan, she know I ain’t playing Baby\nY’all be playing Crazy. Me? I be spraying 80\nPa 89. 9 tourists, I have em laying daisies\n\nFlip the keys, 4 flights, 8 towns\nAnother bird with a bird on the Greyhound\nDat alll Datt Allllll Dat Alll Dat Alllllllllllllll\n\nI need my shorty at the Mta, another at the DMV\nMy Mommy at the Condo, & my Baby w/ the Ebt\nDat alll Datt Allllll Dat Alll Dat Alllllllllllllll\n\nYour Block dry, no prob i got a Brick for It\nWar, i see my Taylor. im Fit for it\nIn the Strip Club with money we got off the Strip\nI ain't talking about when i say i come off the Hip\nDrive bys out the Corsica\nYacht Party, i ain't talking Nautica\nNot the Circle line im on a different Water bro\n10 hoes, 3 O's , 2 Homies, & a Orchestra\nYour Daughter Missing? No shes Not. no need Reporting her\nShe with White Girls, & that White Girl, they Snortin Her\nLifes a Bitch, a few Niggas i kno got caught in Her\nHit with the 45. Mother Earth, they Aborting Her\nBut im smoking on that mother nature\nPull It Twice, Its a Pillow, It will Suffocate Cha\nI Ain't Trying It, But Chea, im Supplying It\nWho Buying It? Your wrinkled feelings? No Problem. ill Iron It\n\nFlip the keys, 4 flights, 8 towns\nAnother bird with a bird on the Greyhound\nDat alll Datt Allllll Dat Alll Dat Alllllllllllllll\n\nI need my shorty at the Mta, another at the DMV\nMy Mommy at the Condo, & my Baby w/ the Ebt\nDat alll Datt Allllll Dat Alll Dat Alllllllllllllll"}]}