{"songs": [{"lyrics": "[Intro]\nYeah, I ain't got no fucking time. Asian Doll, yeah from Japan. nothing like the rest, like nothing. Ya digg?\n\n[Chorus x2]\nI ain't tryna be nobody, I just shine (I just glo). I ain't tryna go on dates, I gotta grind (gotta go). I ain't never started beef, I swear they lyin' (hell no). I can't fuck em he to cheap, I'm a dime (basic ass)\n\n[Verse 1]\nPercocets on his tongue, got him booted up. Bitch in my face, she a fan I'm too blunted up. All that slick talk, they be cappin', silly damn rabbit. Hunt you like a hunter, count bands pretty ass savage. Courtney, he'll really smoke you for yo shit, real crips do a hit, kiki slap them doors, not care, no feelings shits. Slap a blood, pussy bitches know how Asian coming. Im Granted by the devil, want my soul I pray I'm humble. My energy is maximum, delete like capo tho, I am the captain huh. Tap me on yo shoulder if you want a problem. Rappin' like you gotta block, these bitches acting radical. I'm sweet like cinna-bread. R.I.P lil shirm, I want these niggas dead\n\n[Chorus x2]\nI ain't tryna be nobody, I just shine (I just glo). I ain't tryna go on dates, I gotta grind (gotta go). I ain't never started beef, I swear they lyin' (hell no). I can't fuck em he to cheap, I'm a dime (basic ass)\n\n\n[Verse 2]\nSpeaking Asian Doll, tell em I'm the realest bitch. I put my life up on the line and I ran with it. Hoes confused, poppin' pussy like a spanish bitch. Get money, fuck niggas, how I came up. Can't never switch up, been same blue bucks. My momma fell off, now she got a foreign truck. Minnie me's better run, let me hitters out. Yo team full of slut buckets, goofy, mickey mouse. On the same shit, lames get no money. Gang gang. Point her out, she get changed. I treat that nigga like a maid. I be geekin' starting waves, they be feenin' want some steak. How you feel,  X you off my list. Not racin' I just pace. I ain't nothin' like the rest, bitch you blend in with the rest. I can't speak to a hoe, she got dick on her breathe. I got money on my mind, cost them bands dont  waste my time. Asian Doll can't fuck with it, I paved the way, I am that bitch\n\n[Outro]\nYeah, ayeee. I don't got no time, yeah, I gotta go, I just shine, yeah, Asian Doll, get them bands, yeah yeah yeah yeah", "album": null, "year": "2016-12-20", "title": "I Aint Trying", "image": "https://images.genius.com/30a675268e16a21e60272a07729900a7.500x500x1.jpg"}], "artist": "Asian Da Brat"}