{"artist": "C-Rayz Walz", "songs": [{"title": "BLVK Like Burt Reynolds", "album": "All Blvck Everything: The Prelude", "year": "2011-01-01", "image": "https://images.genius.com/314968b39e4808b82841f13a9560fd84.1000x1000x1.jpg", "lyrics": "(Sample)\n\"All my massive, gotta get with it.\"\n\n(Sample)\n\"I don't want n***az sounding like me, on no album.\"\n\nListen to the rhyme, listen to the beat..It's cool\nI had to fight cause I brought hummus to school\nI was vegetarian, then in 2000 shit became cool\nI'm like what the fuck they can't stop me\nI had to fuck people up to eat my broccoli\nNow everybody wants a motherfucking salad\nThe bullet or the ballad\nI'm like Malcom X on the step it's a mini me\nVs. the person who spit bars at Kennedy\nAllah symmetry transition to Jesus Christ\nBiggie or Pac? It don't matter, he's just nice\nIt's the season I motivate with light\nIt's the reason why you hear me on the mic so hype\nWith my blonde thing.. Cause I do the mic something dirty\nYou heard me, like Don King\n\n(CHORUS)\nI want a mustache damn it!Like Burt Reynolds\nLike Burt Reynolds, Like Burt Reynolds..\n\nI must splash canvas, your bus pass ran it\nOn a concourse stuck like fuck mass transit\nI buck blast answers, what black antlers?\nMan vs. Wild, I'll eat a muskrat sandwich\nWhen I'm online don't be a fucking bass scammin'\nFuck that blam him, crush that salmon\nPardon my french or my rough ruck manners\n\"********?\" What? That's just bad Spanish\nTweet, tweet my beat skeet on your songs\nI be street in the sheets with your moms.. real talk!\nI'm being funny, but yo it's like money: I come and I go\nThe root of all evil, I know\nMy He Man'd get \"****?\" to smoke\nOne shot pops tequila and quote\nFire hut stop dropping and roll, my spit give me props like Ramone\nHow am I gonna go pop holmes? Pop was never home!\n\n(CHORUS)\nI want a mustache damn it!Like Burt Reynolds\nLike Burt Reynolds, Like Burt Reynolds..\n\n(Sample)\n\" I put two hands together like twelve o'clock\"\n\n(Sample)\n\" We rock for ourselves, we don't need no fans\nBut if you're in the place to be, let me see your hands\""}]}