{"artist": "​​wifisfuneral", "songs": [{"year": "2016-05-27", "lyrics": "[Chorus]\nTip-toe to my grave I ain’t worried about shit\nLost in the dark I ain't seen the light since\nDrown on a pill? I ain’t worried about death\nNever even knowing why my life still exists\n\n[Verse 1]\nAll gold grim had to lay him on my chest\nNow my pack like Dupri boy I’m so so def\nHit the dash then I spaz, getting cash?\nWhat a feeling\nGot a bad bitch?\nYeah looking like a taz angel\nWater whip it, Aquafina my wrist\nShe water whippin’ when she squeeze on the dick\nMan of the year, yeah I done walk in the building\nLike fuck what you talking if you think you winning\nLike how I'm the youngest nigga flexing chilling?\nYou obviously can’t approach me, Who you is?\nDiamond shining boy they twerking and shit\nFifteen hundred what it cost on my fit\nFifteen hundred just to pull up to  city\nLast year a nigga was broke and ain’t get it\nNow they done, think I done got they attention\nNow my momma can’t complain when I’m sittin’\nNow is mothafuck you if you ain’t with me\nSlick boy I dropped out of school and I did it\nSlick boy you actin’ a fool and admit it\nNow I walk around with jewels, check the bezels\n\n[Pre-Chorus]\nNow If I fucking die before I wake\nI just fucking pray that all my gang gonn’ stay the same\nStuff some bands up in my robins\nThen I skirt off into space\nJust a youngin’ getting money man like what more can I say\nNow If I fucking die before I wake\nI just fucking pray that all my gang gonn’ stay the same\nStuff some bands up in my robins\nThen I skirt off into space\nJust a youngin’ getting money man like what more can I say\n\n[Chorus]\nTip-toe to my grave I ain’t worry about shit\nLost in the dark I ain't seen the light since\nDrown on a pill, I ain’t worried about death\nNever even knowing why my life still exists\nTip-toe to my grave I ain’t worry about shit\nLost in the dark I ain't seen the light since\nDrown on a, I ain’t worried about death\nNever even knowing why my life still exists", "image": "https://images.genius.com/65d9a6298066ff70d7294b1024cc2172.500x500x1.jpg", "album": "Black Heart Revenge", "title": "Grim"}]}