{"songs": [{"title": "X Bitch", "lyrics": "[Hook - Meek Mill]\nI got my x bitch fucking with my next bitch [x3]\nYou ain't fucking ho? cool, that's the exit\nI got my x bitch fucking with my next bitch\nI got my next bitch fucking with my best bitch\nI got my x bitch fucking with my x bitch\nYou ain't fucking ho? cool, that's the exit\n\n[Verse 1 - Young Chris]\nCaught my x bitch fucking with my next bitch\nShe a bad little bitch, thick as Texas\nShe a down bitch, why I fucks with her\nGot a pretty little bitch going up with her\nLive, it's Benz in the garages\nGot a bad bitch named Nicki that love Minajs\nWhat's the deal huh? fuck with a real one\nTell 'em activist I need a silk one\nNow I got my x girl fucking with my next girl\nAll that equals bomb ass pussy and the best twirl\nBest of the both worlds, want that R.Kelly chicken shit\nGotta love a bad bitch that hit a bitch\nShe the best\n\n[Hook]\n\n[Verse 2 - Meek Mill]\nI got my x bitch fucking with my next bitch\nI got my next bitch fucking with my best bitch\nI put em all in the ring like wrestling\nThen send em home to their boyfriend, getting questioned\nNow he's stressing, look at me flexing\nCatching hoes all in the field like D.Jackson\nCatch a ho all on your grill if he ratting\nFor talking when you not in the game like John Madden\nBye bye ass, drive by past you\nSee you with my ho, I just ride by laughing (Ha!)\nI be in that top line fashion\nAnd I connect hoes like Wifi, ask em\n\n[Hook]\n\n[Verse 3 - Young Chris]\nHitter, hitter, how I did her, did her\nThen her best friend came in with her\nI cannot forget her, gotta love the hoes\nThem hoes love a nigga (What?)\nKeep em on they toes, on my dime XC\nCold motherfucker, you rolling with your boy\nOr you rolling with the suckers\nWelcome to the house party ho, it's x rated\nYou ain't even know my [?] and my x dated\nHe the man with the hoes\n\n[Hook]", "album": "Gunna Season", "year": "2014-05-06", "image": "https://images.genius.com/6ce854a7d0e3a0fdc9d99f8087542d8f.500x500x1.jpg"}], "artist": "Young Chris"}