{"artist": "A$AP Ferg", "songs": [{"title": "Hungry Ham", "image": "https://images.genius.com/58b9521071cb4f1250d2cf9bf0e82e3b.1000x1000x1.jpg", "album": "Always Strive and Prosper", "lyrics": "[Intro: Crystal Caines]\nSee this is Harlem, these our streets\nHungry Ham, that’s all we\nThem niggas out here shining, niggas out here dying\nCause we never got along\nWe all go-getters, we go get it\nSome gon’ fake it, half won’t make it\nGet a chance to make it out, we taking it\n\n[Chorus: A$AP Ferg & Crystal Caines]\nBlock (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nNigga what’s your block? (Hungry Ham)\n\n[Verse 1: A$AP Ferg]\nGrandma used to call me Mickey Mouse but I’m no rat\nOn the block they threw a couple bullets, Warren Sapp\nSeen my nigga’s family members buggin' off the crack\nYour uncle smell like shit like he got garbage in his ass\nI’m from 143rd, I come from Hungry Ham, ya heard?\nWhere the pigs'll lay you down and make a nigga bite the curb\nThem kids is poppin’ Percs because they claim it cool they nerves\nMy crazy ass neighbors sprinkle (Hoo, hoo, hoo, ayy!)\nStreet name was Sterlin, smell like shit, vomit, urine\nWhen my bitches come over they have the look of concerning\nLike why he stand in the hallway with a milk carton and be lurking?\nWhy he jumping for joy when the whole building was just burning?\nWhat about that nigga’s sash? Wore the socks on his hands\nPurple coats in the summer, with the Glock in his pants\nAnd he stabbed his own mama, how you do that to your fam?\nCause my block full of lunatics, call my shit Hungry Ham\nDamn!\n\n[Chorus: A$AP Ferg & Crystal Caines]\nBlock (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nNigga what’s your block? (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nBetter wear your Glock (Hungry Ham)\nBetter wear your Glock (Hungry Ham)\nBetter wear your Glock\nI’ll be back, nigga (BLAH!)\n\n[Interlude]\nAunt: Yeah Sharon, I don’t know what’s going on. I seen your son on the corner and he was chillin’ with all of them-\nMom: Ooh, Darold...\nAunt: Yeah! Like he could be a rapper or something like-\nMom: Darold gon' get his ass beat!\n\n[Verse 2: A$AP Ferg]\nMy auntie ask my mama, “Did Darold quit his job?”\nI seen him three days straight sitting on a car\nMy mama screaming, “Darold, c’mon, you ain’t quit yo job!”\nMama yes I did (Darold! Hoo hoo hoo ayy!)\nMy mama barking like doggies in front of my aunt and my shorty\nI tell her, \" I am a rapper\", she suck her teeth and ignore me\nAll she see is my gold teeth with a white bitch and some 40's\nI’m getting fame on computers, she don’t think this shit is for me\nI used to pray for more women, now I get dozens of oldies\nWhen I be hittin’ it doggie, she bark like hoo hoo hoo!\n(Oh my, I’m horny!) Only when you want sex you callin’ me\nTellin’ me how much you want me but I think you’re full of baloney\nI ain’t stressin’ you shorty, my shorty be stressin’ me, shorty\nClaimin’ I’m messin’ with shorties and be undressin’ them shorties\nI ain’t get no head from them shorties\nAin’t be in the bed with them shorties\nNow what these condoms for?\nAnd please don’t say these Magnums is for me\n\n[Interlude]\nGirl: Are you serious, what the fuck is this?\n\n[Bridge: A$AP Ferg & Crystal Caines]\nI'm-I'm-I'm-I’m from Hungry Ham, y'all ought to know\nBetter get your ass another plan if you want to blow\nCan’t play this corner for no more summers if you get my flow\nWe catching meat, but y’all niggas is buns, hoo hoo hoo ayy!\n\n[Chorus: A$AP Ferg & Crystal Caines]\nBlock (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nCause that’s my block (Hungry Ham)\nNigga what’s your block? (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nNigga fuck your block (Hungry Ham)\nBetter wear your Glock (Hungry Ham)\nBetter wear your Glock (Hungry Ham)\nBetter wear your Glock (Hungry Ham)\nPapi, why you throwing things? (Hungry Ham)\n\n[Outro]\nI’ll be back! (BLAH!)", "year": "2016-04-08"}]}