{"artist": "Kirko Bangz", "songs": [{"image": "https://images.rapgenius.com/01940fd6971fab8b63507051b8dd9463.500x500x1.png", "title": "Hoe", "year": "2014-01-27", "album": "Progression 4", "lyrics": "[Chorus: YG]\nWhen I think about you, I think hoe!\nWhen I dream about you, I think hoe!\nIt only took me some hours to hit, I think hoe!\nWhen I see you with my nigga's crib, I think hoe!\nWhen you pull up in your whip, I think hoe!\nAct different when you get your chips, I think hoe!\nWouldn't do it for your homies, do it for your bitch, hoe!\nHoe!\n\n[Verse 1: Kirko Bangz]\nThese hoes only fucking with a nigga, with them figgas\nYou ain't got it, them bitches ain't fucking with you\nStop saving these hoes, fuck these bitches\nStop bringing them around a real nigga\nCause a ho gon' be a ho, and a bitch gon' be a bitch\nDon't put your dick up in a ho that make you money\nAnd these hoes fucking different niggas every night\nBut she still be up in church every Sunday\nSo bitch, tell the DJ play my shit\nAnd tell your home girls to get with it\nDon't be ashamed to be a ho, if you a ho, then let them know\nYou getting money and they need to fuck with it\n\n[Chorus: YG]\nWhen I think about you, I think hoe!\nWhen I dream about you, I think hoe!\nIt only took me some hours to hit, I think hoe!\nWhen I see you with my nigga's crib, I think hoe!\nWhen you pull up in your whip, I think hoe!\nAct different when you get your chips, I think hoe!\nWouldn't do it for your homies, do it for your bitch, hoe!\nHoe!\n\n[Verse 2: Yo Gotti]\nWhen I wake up in the morning, I think dough\nBad bitch follow all the rap niggas, she a hoe\nGot a 100 thousand likes and a million something followers\nI'm a street nigga, I'm just tryna get my dollars up\nKirko Bangz and my nigga YG\nYo Gotti, trill nigga, ask your ho about me\nReal nigga shit, don't do that, get your feelings hurt\nWant a red bitch in a mini skirt\nChanel boots, Celine purse\nShawty not a stripper but can make it twerk\nWhen you think about me you think bread\nWhen I think about you, I think head\n\n[Chorus: YG]\nWhen I think about you, I think hoe!\nWhen I dream about you, I think hoe!\nIt only took me some hours to hit, I think hoe!\nWhen I see you with my nigga's crib, I think hoe!\nWhen you pull up in your whip, I think hoe!\nAct different when you get your chips, I think hoe!\nWouldn't do it for your homies, do it for your bitch, hoe!\nHoe!\n\n[Verse 3: Kirko Bangz]\nThese hoes gon' be hoes\nYou cuffin' and loving her, but she fucking on the low\nAnd I'm like \"damn\", bitch, what you saying?\nHo, you know you got a man\nBut she gon' fuck all the niggas, that all the bitches is fucking\nAnd she gon' post all them pictures that she don't look like in public\nShe gon' be in the club, bottles poppin', she boppin'\nWhen the sparkles start coming, bitches start table hoppin'\nThey see me when I'm coming down riding slow\nYou ain't a ho, why you fucking on the floor?\nYou and your girlfriend wear each other clothes\nBitch we don't save these hoes\n\n[Chorus: YG]\nWhen I think about you, I think hoe!\nWhen I dream about you, I think hoe!\nIt only took me some hours to hit, I think hoe!\nWhen I see you with my nigga's crib, I think hoe!\nWhen you pull up in your whip, I think hoe!\nAct different when you get your chips, I think hoe!\nWouldn't do it for your homies, do it for your bitch, hoe!\nHoe!"}]}