{"artist": "C-Rayz Walz", "songs": [{"title": "Rain Forever", "album": "We Live: The Black Samurai EP", "year": "2004-07-16", "image": "https://images.genius.com/6db5062033813b4d2fef23bb8ec78afa.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nC-Rayz.  Rain all day.  Make it rain\n\n[Verse 1: C-Rayz Walz]\nDon't be a biter, heifer—why?—I'm the Chupacabra\nYou spit flames?  So what?  I'm used to lava\nLet's introduce the horror.  I'm calm as brother\nThrowing stray bars and quasars to harm a fronter\nThat's right (Right, right) ‘cause I can't be left\nAnd you spoiled MCs simply will never be fresh\nNevertheless, less than forever is what to expect\n‘Cause your rain on the time is just a nap in the bird’s nest\nBeads of sweat form like rosaries over my eyebrow\nAnd slide down when I kill the stage in front of live crowds\nTo my little fans, any bigger, you'd be AC\nMy slang bangs like gangs who hang in front of Skate Key lately\nBut it don't matter—it's like we all in the dark\n‘Cause of the spark, they thought you was gunshots in the park\nDon't worry, mommy.  They just rapping (Damn)\nHe must have plans to wake up all the mummies in Manhattan\n\n[Hook: C-Rayz Walz and (Bleedin Gumz)]\n(I am trained).  Flaming rain (Flaming rain)\nRaining flames (Raining flames)\n(Rain forever, baby)\nRaining flames (Raining flames)\nFlaming rain (Flaming rain)\n(Rain forever, baby)\n\n[Verse 2: Bleedin Gumz]\nMy life, my life was hellified.  I done ride that road of the chosen\nA few has arisen to shine bright in the night like the rainbow light of a prism\nI can make the incision.  My decision is real if I should let a snitch nigga ride\nShould it really be your grill?  But since I'm in your whip, that I decided to let you slide\nI was tryna live cool.  But cool don't pay the bills and cool don't get my money right (Come on)\nGotta stand out on my own, puff my chest out like I'm grown and fight that righteous fight\nThe simple words to be a man, hey, and stay as real as you can from now ‘til the day you die\nAnd you too will live (You too will live) to say that you can rain forever\n\n[Hook: C-Rayz Walz and (Bleedin Gumz)]\n(Fire flame).  Flaming rain (Flaming rain)\nRaining flames (Raining flames)\n(Rain forever, baby)\nRaining flames (Raining flames)\nFlaming rain (Flaming rain)\n(Rain forever, baby)\n\n[Verse 3: C-Rayz Walz]\nI'm a stick up kid of the worst kind—wait\nOn second thought, let me go with my first mind\nBefore I burst 9s, rehearse rhyme and raw truth\nForget sixteens—from the eights, I show you what the fours do\nI used to aim clappers if you had chains like famed rappers\nBut I'm a changed man now—your chain don't matter\nA bag of magic, slashing the dragon with a hatchet\nI kill verses on purpose—my notebook’s a casket\nTo be serious with you guys, I bust metafives and crush fours\nPlus you don't know me from the last Vulcan you fucked raw\nOn instinct, the next line would be...\nYou stupid chickens ain't shit without my duck sauce\nI scream down to the ground and cause an uproar\nThe reason for this?  Well, the floors reflect Walz\nInstall my Singular/Cingular wireless to unplug your mind\nAnd for $9.99, you could add a line\nThe Angel from Anaheim build Walz in pantomime\nNext time, we'll rock on the block in Palestine\nI used to drink Ballantine ‘til Wu exposed the steelo\nNow I'm thinking “Long Range,” like “We Live” with Ste-Lo\n\n[Hook: C-Rayz Walz and (Bleedin Gumz)]\n(My claim to fame).  Flaming rain (Flaming rain)\nRaining flames (Raining flames)\n(Rain forever, baby)\nRaining flames (Raining flames)\nFlaming rain (Flaming rain)\n(Rain forever, baby)\n\n[Outro: Bleedin Gumz]\nMmm hmm.  Mmm hmm.  Mmm hmm.  Mmm hmm\nRain forever, baby\nMmm hmm.  Mmm hmm.  Mmm hmm.  Oh oh\nRain forever, baby\nYeah, yeah.  Rain forever.  Rain forever, baby\nRain forever.  Mmm hmm"}]}