{"artist": "Canibus", "songs": [{"title": "Give It More", "album": "MicClub Mixtape Master, Vol. 1", "year": null, "image": "https://images.genius.com/9b207b6db57e4990598b7391cac9abe9.500x500x1.jpg", "lyrics": "[Verse One]\nI got this beat from Riggs, yeah I got it from Riggs\nCause in a minute I'ma be on top of the biz\nTry to act like you don't know who it is\nAround the globe there's kids that play the Canibus quotable quiz\nIts like if you ain't a mogul they don't know who you is\nBut I'm a oldie in the biz with the vocals and libs\nSaid so much crazy shit on my last album\nMy name shut Interpol down for two hours\nNow that's true power\nI create what I can't count to rhyme from my anger management counselor\nJust listen to the fives and blend in with the signal you getting\nCan you hear me now? Answer the question\nYou wanna talk about sick poems? I spit stones\nLeave you split holmes, tied knots with your rib bones\nQuick blows break off your limp wrist bones\nMake you scream melodies in twelve different ringtones\nI can speak Chinese, ching chong get off the ding dong\nKnock your ass over the tables like little ping pongs\nYou got balls? Bring 'em on\nI smash 'em with a spiked bat like Raekwon with Cuban Linx on\nBlink and you gone, let off more shells than shrimp farms\nSpit raw, your face look like you smelling stink bombs\nYou ain't dreamin nigga, pinch your arm\nCanibus be spittin' bars that can dislodge Kanye's jaws\n\n[Hook] x 2\nWhat you lookin' for? We hookin' off\nPunchlines on the song through the hook and all\nYou actin' like you think you too good to fall\nYou spit with a glass jaw, get up give it more\n\n[Verse Two]\nIf I was focused I could crush you\nCause you sayin you focused, then how come I can still touch you?\nI bust you, then spit some young buck shit at you\nCause I still got the heart to go bust me a head or two\nMy little arms carry big arms, to tickle the clip\nFinger keep the sig warm when I bring harm\nI have a nigga screamin' for his mama\nYour body armor don't protect you from your karma\nCome along with me, let me see what you got\nBattle you on the spot, show you how nice you not\nI'm the champ like Ali, you just a close copy\nWhen people see you, they don't know that its not me\nI flow cause I got to\nThis shit sound hot cause its not you\nYou tried to catch me, but I got you\nI got a mind that spins like belt drives\nAnd when I seen hip hop die I felt cries\nBut I got an idea to bring it back to life\nBring me back to the mic, make sure you package it right\nI'll go all out, pour my heart out, mix it around\nPut my voice to these beats, let it mix with the sound\n\n[Hook] x 2"}]}