{"songs": [{"image": "https://images.genius.com/fa91cff72cfd37fd6ea86da4dde45a21.300x300x1.jpg", "title": "Amongst Kings", "album": "Q.B. 2 Compton", "year": null, "lyrics": "[Nas]\nFirst I see a flashin' light, then on my own\nI hear nothin', the smell of fire in brimstone\nI feel hundreds arms grabbin' me, fallin' down the hole\nIs it because there is no Gravity my body leaves my Soul\nIs the Devil mad at me? will I go to Hell?\nOr is it Heaven that awaits me?, is too early to tell\nIs it now that I'm to be judged?\nWill I face thee bright tunnel warm lights?\nWill embrace me before force takes me\nLike I'm movin' through high winds\nSee my self in baby carriages, relatives and friends\nThings manifest, kings from every planets rest here\nBeams of light hear the voice of the Nazareth near\n\n[Hook: Nas]\nYou 'Amongst Kings' from both far near land\nMade in my image son of God son of man\nYou came in the spirit for I am that I am\nFather of all worlds Fallen Angel and the Lamb\n\n[Nas]\nSeen my body layin' down in the ground\nIt was painless, didn't feel a thing\nShots ring felt the anxious to get up and run\nI was atheist, committed Suicide\nI wish I could erase this shit\nI seen a new life before the Christ\nHe created night & day, the sun & moon\nFrom the virgin woman's womb\nWe lookin' down at my body, emergency room\nDoctors frownin' at me surgical performs, I'm doomed\nIt's my day of judgment, eternal peace & fire\nFar past the stars far past the Orion\nI asked that you forgive father, I was tryin'\nMany thrones in the light but only one's truly shinin'\n\n[Hook]\n\n[Nas]\nFaster then the blinkin' eye, is the master and I\nFace to face (uh) fightin' my case so we debate (where?)\nCountin' all my sins (ok), where do we begin\nWhen I stabbed the man in the train station or drunk gin\nWhen I grabbed the man let the shells hit him from the Mac 10\nIt was all retaliation, (from what?) from way back then\nNow I got the black Benz (and) trips from Aspen (and)\nDisney World for my little girl and I'm askin'\nYou would recognize all the good deeds I'm worth (Dear God)\nSend me on a trip God please the Earth\nSo I can deliver thou want it, stop playin'\nHe gave me life, I screamed out loud that \"I Am...\"\n(Nas... Nastradamus)\n\n[Outro: Nas]\nAnd I saw another mighty angel come down from Heaven (I Am)\nClothe wit the cloud (Nastradamus)\nAnd the rainbow was upon his head as a Crown (I Am)\nAnd his face was lit as were the Sun (I Am)\nAnd his feet as pillars of fire (Nastradamus)\nAnd his name was Nastradamus (I Am)\n(I Am Nastradamus)\nNas...\nNas...\nNas..."}], "artist": "Nas"}