{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Drop The Vibe Freestyle", "lyrics": "[Intro: Kendrick Lamar, Jay Rock, DJ talking]\n(Work out for me, work out for me)\n(Work out for me, work out for me)\n\n[Verse One: Kendrick Lamar]\nFeeling like a mother fucking animal\nHannibal Lecter of 2012\nElected to execute every rapper that has excelled\nIf music is your calling\nYou're falling, pick up yourself\nIf a nigga said he could see me\nBet he told you in Braille, fucker\nPut you in front of the street then buy you some bread\nNigga you lunch meat, should've worked at Subway instead\nGoliath couldn't bare my triumph\nI'm a leader, walk behind me as I walk through Zion\nSwinging swords like I'm sparring with a Spartan\nWatch they face drop when the beat drop\nI drop a real jewel like a Martin, fool\nMe and curtains ballin' like peewee kirkland callin' 'em kirk franklin\nStomp 'em, leave 'em hurting\nNo judgement for a plaintiff\nThey tried to find me guilty for spitting filthy as O.D.B\nBut I've been O.D. since '03\nThat's March 14th, my first recordings\nI kicked it like sweet chin\nMusic on Chuck Norris\n\n[DJ Talking]\n\n[Verse 2: Jay Rock]\nLook, look, look\nI'm J-A-Y, Rock to be exact\nNiggas said gardens, Watts on the map\nHm, story of this eastside nigga\nAll my life in the ghetto on the peace side nigga\nWhere across the tracks, opposites attract\nNiggas go hard for the color of they flag\nDope man money, welfare recipients\nUnfit mothers never heard of obedience\nHo's so devious, niggas all talk\nRight around the corner, deja vu\nSame old shit, something like re-runs\nGotta stay sharp, if you slip then you bleed ?\nGuns in the Levis, 501s\nNiggas don't box, they buy more guns\nUh, that's how it is on these L.A. streets\nDon't sleep, don't sleep\nLook, catch me sitting in my truck\nRemy in this cup\nNo tags on this bitch, but I don't give a fuck\nI ride until the wheels fall off\nThat's some real shit\nNever let them get in your mind, never reveal shit\nLet a nigga know your feelings, business and all\nHe's the type of nigga riffing and wishing on you to fall\nFake niggas try and impersonate your character\nThat's why I got my mother's fucking eyes on them scavengers\nWatch 'em!\nMy daddy told me that every day\nPray for late Charles, why he have to pass away?\nThinking about my pops, then the stress starts to kick in\nRoll me up a fat ass blunt and start drinking\nDamn!\nThen reality starts to set in\nI'm married to the streets and I ain't never had a wedding\nI stop selling dope because niggas started telling\nSex, money, and weed: the life we start living\nGuns in the closet for niggas who start tripping\nStay in the house when them choppers come out spitting\nStay on your job\nKeep your eyes open on every corner\nThe blink of an eye, and you're a goner\nNo wronger, tell 'em about the pains of this hunger\nShock 'em like thunder\nAnd the ? going bonkers\nJust living my life up on some cool shit\nSo, nigga just miss me with all that bull shit\n\n[Outro: Kendrick Lamar, Jay Rock, DJ talking]"}], "artist": "Kendrick Lamar"}