{"songs": [{"title": "What it Look Like", "lyrics": "Yeah, yeah\nWhat it look like (what it look like)\n\nNow check it out\nWhat you see homey ain't always what you get\nYou gotta take your time and never let 'em see you sweat\n'Cause if you lose your mind and you start rhyming just to kick it\nSomebody's gaurunteed to pull your ticket\nNow you know you can't drive in LA with no insurance\nEspecially if you holdin' mad warrants, doin' 90 down Florence\nBut you tell 'em yo your rims is tight\nBut its hard for them to see 'em when you rollin' side streets at night\nNo doubt you're a winner, but yo you gettin' thinner\nThat may be because you be havin' top ramen for dinner\nYour crib is arraigned, ?? tellus ?? is messin with your man\nTill you ?? doxt my munch ?? 'cause you got problems with your dental\nTo anybody lookin' how you livin' legit\nBut ain't nobody really care enough to tell you to quit\n'Cause you're a step away from homeless, up ridin' a bike\nAnd though you think you livin' G, but what it look like?\n\nCHORUS\n\nYou say your crib is long but what it look like?\nYou say your cash is long but what it look like?\nYou in the danger zone so what it look like?\nWhat it look like baby what it look like?\nYou got a fancy car but what it look like?\nIt's gonna take you far but what it look like?\nThink you a superstar but what it look like?\nWhat it look like? (Baby when I'm on the mic)\n\nYou can't live wit 'em, can't live without 'em\nAnd you're too dumb to know what to do about 'em\nAnd she plays you, never givin' proper respect\nYou treat her like one time when she just wears ? tech ?\nThen you ask her not to cheat she tells you baby I won't\nBut everytime you leave town she on her back gettin' boned\nAnd you don't understand why she do you like that\nBut if you live like a rat, you give like a rat\nYou shoulda thought harder when she started to flow\nYou shoulda thought about more than just the back of her stroke\n'Cause you was singin' you's a man and you never get hurt\nBut then you never counted on baby doin' the dirt\nNow you were happy 'cause your boys think you livin' the life\nThinkin the two of you in love and you were given a wife\nBut you know someday soon she be takin' a hike\nShe might be lyin' in your bed but what it look like?\n\nCHORUS\n\nYou got a girl with you but what it look like?\nShe knowin' what to do but what it look like?\nYou sayin' she'll be true but what it look like?\nWhat it look like baby what it look like?\nShe's chillin' on your arm but what it look like?\nShe like a good luck charm but what it look like?\nIs she a flossy momma what it look like\nWhat it look like? (Baby when I'm on the mic)\n\nNow everybody wanna be a rapper (yeah)\nEverybody wit' a mic wanna be a rapper (yeah)\nSo dapper that they run they mouth hollerin' about respect\nBut then they never scrutinize on the size of the check\nYou see life don't change when you sign that deal\nYou need a true definition of keepin' it real\nYou be in the studio makin' a gang of noise\nBut it's nothin' if you sellin' just to you and your boys\nThey say God bless the child that's got his own\nBut say a prayer for the baby on the microphone\nThey got you walkin' round hard but they treatin' ya soft\nYou makin' 80 cents a record and they rippin' ya off\nThey make five or six dollars and they keepin' it tight\nBlow you up in the mornin' and you gone at night\nVideos are bein' made to put hoes in\nAnd The Source is only good to sell clothes in\nNow you can call me bitter baby that's for sure\n'Cause I made mine and now I'm comin' back for more\nAnd it's lesson number one when you rockin' the mic\nIt sounds good to you yo but what it look like?\n\nCHORUS\n\nYou got a microphone but what it look like?\nYou say your rhymes is on but what it look like?\nIt's to the break of dawn but what it look like?\nWhat it look like baby what it look like?\nYou got your record deal but what it look like?\nYou gonna keep it real but what it look like?\nYou think you hard as steel but what it look like?\nWhat it look like? (Baby when I'm on the mic)\n\nWhat it look like? (x3)\nBaby what it look like?\nWhat it look like? (x3)\nWhat it look like (Baby when I'm on the mic)\n\nYeah\nAnd it don't stop\nAnd it won't stop...", "album": "Ain’t Goin’ Out Like That", "year": null, "image": "https://images.genius.com/3cb46619256eaaca5a5d759524fc9d64.456x456x1.jpg"}], "artist": "Young MC"}