{"artist": "Boosie Badazz", "songs": [{"album": "Streetz Iz Mine", "title": "Boosie Speaks", "year": null, "lyrics": "(Intro)\nBoosie Bad Azz, say lil K these niggas acting funny with me now? whaaaa\n\n(verse 1)\nAll my bread gone, all my redbones, all my fans in the stand they done left me alone. all my pussy poppers they don't wanna holla look like its just me and my choppa look like I got a problem. I'm to the head but my hustle ain't gone ya feel me? I'm Innocent til proving guilty or til God kill me I ain't got nothing in these streets now I'm back to robbing good thing I'm in these streets and I know who got it I'm in a world where ain't no fucking rules in em so I live by the code strap up and blues niggas all my friends in the wind since my ends gone, my bad bitches down to 2 since my benz gone, I can't sleep I'm having nightmares fucked up thinking bout that zoom zoom thinking what I did wrong, niggas in the hood mane don't even speak no more treat Lil Boosie Boo like he nero (damn)\n\n(Chorus)\nWhat if I was all fucked up? (who me? yea you)\n(who me? yea you) (who me?)\nShit what if I was all fucked up? (who me? yea you) (who me? yea you) (who me? yea you)\n\n(Verse 2)\nWhat if I had a bald head and I ain't no bald head, my cuz fucked up my plug my business is all dead my niggas they on that Gangsta shit back to that belly shit running off in clubs with them thangs we wrecking shit back to smoking that devil shit famel to high nigga whatever you with I'm with lets take a ride nigga .45 cocked back niggas gone pay for my struggle in my pocket nun but lint im finna take muthafuckas Woah I call Donkey I got some shorts in my click niggas tryna play with me must don't know I play for keeps call Webbie like Savage I keep a package right now I'm starving yesterday I was balling, Maneeee Im' finna go in they circle ol' stingy ass niggas used to smoke all my purple but they gone get it doe I got this AR in my hand and I'm gone let it go and let em know I'm Fucked up!\n\n(Chorus)\nWhat if I was all fucked up? (who me? yea you)\n(who me? yea you) (who me?)\nShit what if I was all fucked up? (who me? yea you) (who me? yea you) (who me? yea you)\n\n(Verse 3)\nSay Fred\nI'm all fucked up, got 1 blunt of purp left\nGas tank on low, can't even hi see the nigga at delga\nDamn I'm fucked up\nGangsta done broke down, Charger done broke down\nMonte Carlo need tires on it\nI'm kinda fucked up right now I mean that\nWhat the fuck Ima do though?\nStick a nigga up, Stick a nigga up! (agghhh)\nStick a nigga up, stick a nigga up....", "image": "https://images.genius.com/97c4e9f74f25d5d9d54095f37754f43a.500x500x1.jpg"}]}