{"artist": "Ace Hood", "songs": [{"title": "2 Fux", "album": null, "year": "2017-03-08", "lyrics": "[Intro]\nBeast\n(Renegade, renegade, renegade)\n\n[Verse]\nUh, I wake up every mornin', thank God, then I gotta get to it\nI never had a role model, money was the only influence\nWhile they was talkin' 'bout it in the city, I was really out doin' it\nHundred bands I was 19 and the man, I knew it, okay\nThat's around the time I shine, had these niggas all hatin'\nSame time I was grindin,' same time I was patient\nYou was standin' with your hand out waitin', yeah yeah\nI'ma keep it real, how it feel? I don't give 2 fucks\nCount another bag on the road, I could never get enough\nThey wanna hang when I'm on, where they were when the shit got tough?\nAnd what a nigga think about me? I don't give 2 fucks\nYou don't pay my bills, you don't feed my kids, your opinion don't matter\nMy pockets still gettin' fatter\nGod damn and the last time I looked in the mirror, I was starin' at a real one\nAnd fuck makin' friends, where the ends at? 'Cause all my dogs need a million\nI don't give a fuck about poppin' no bottles in the club\nI'm focused on the money, I ain't never goin' back the way I was\nA lot of people asked why I drive it here then it get missin'\nSorry to my fans, I'll be way more consistent\nHaters get the middle finger, Lord be the witness, listen\nGot a crib out west in the spot out in Cali, waiting for me when I touch down\nFired my old jeweler, went and got a new jeweler, made him already do the bust-down\nI thinks it's funny how they wanna be down, all of a sudden young nigga gettin' up now\nYeah, king of the city, nigga, king of the state, turn beast when the sun down\nI'm just really havin' fun now\nFunny how that slick talk minimize when ya boy 'round\nI just landed in the UK, in a suite with a pretty little freak sippin' D’Ussé\nMurda, murda in the booth, ayy\nI'm a killer on the beat, increasin' the crime rate\nI need a mill, not an entrée\nI need a Jay, no Beyoncé\nSmokin' like a choo train\nShowin' niggas how to do things\nBoys bitin' on the flow, I changed up like a mood ring\nYoung nigga with a new flame\nDon't compare me to no mane\nTop of the food chain, uh", "image": "https://images.genius.com/b4cef4b662eb87732659eda89f2349be.500x500x1.jpg"}]}