{"artist": "Pink Guy", "songs": [{"album": "Pink Season", "title": "I Will Get a Vasectomy", "image": "https://images.genius.com/176ec7cd55a78c0fcb8c2560fa88283c.1000x1000x1.jpg", "lyrics": "[Intro]\nI just wanna show my appreciation to how much I love kids and teens between the ages of twelve and seventeen\n\n[Verse 1]\nWhy, are kids so fucking stupid?\nDid their parents not beat them hard enough-enough-enough?\nI try, to empathize with teens\nBecause when I was younger I was stupid too-too-too (It's true)\nBut then I realized, that I was never this stupid\nMy friends were never this stupid, y'all are just dense-dense-dense\nLike damn, I'm really, really concerned\nI wish your father would use that wooden spoon-spoon-spoon (Just fucking beat them already)\n\nI was being ironic man, what a fucking loser. Do you have-\n\n[Verse 2]\nListen kids, being edgy is okay\nBut the same ten jokes in a row, that's not okay-okay-okay\nLike damn, is that all you can come up with?\nIf you're gonna be racist at least be original, please (Yeah, we're dead serious)\nIf you're under seventeen, please don't ever talk to me\nYou think this is part of the act, but please don't come near me\n\n[Outro]\nDude, get a load of this guy! He's never heard of irony before! What a fucking loser dude!\nJimmy it's past your bedtime\nDad no\nIt's past your bedtime, get back to bed\nI was just being ironic\nI don't care\nNo dad please\nNo, you're being a piece of shit, take these spanks you little bitch\nDaddy please, daddy please\nWho do you think you are? who the fuck do you think you are? Talking to people on the internet like you're some piece of shit, calling irony\nI was just being ironic\nTake these fucking spanks you dumbass kid. I should've never given birth to you, you piece of shit. Take that, I'm out of here son\nI was being ironic\nIf I should even call you son\nDaddy, have you ever heard of irony before?\n\nI was just kidding, that crying was ironic, i wasn't actually crying\nWhat the fuck did you just say? You want me to come back here? Huh?\nNothing, nothing daddy\nThat's what I fucking thought, go back to bed, it's nine PM", "year": "2017-01-04"}]}