{"songs": [{"image": "https://images.genius.com/887dfadbe71c74993c4e467bd365cd15.500x500x1.jpg", "lyrics": "[Verse 1: Mac Mall]\nYou down for me like four flats on a Cadillac\nYou got my back and I never have to question that\nI could be pennyless or counting racks living fat\nYou’re with me, never against me, and I love you for that\nI love you for this, down for me, poor or rich\nRide with me, ride for me, put in work, never quit\nCheap tricks on my tip ‘cause they see my game is thick\nBut my real ride or die is who I’m rocking with\nCan’t slip, won’t trick, tell a buckethead bitch bounce quick\nPriceless, here’s my ride or die chick\nI swear my ride or die is heaven sent\nMy accomplice, and never D.A. with this\n\n[Chorus 2X: Vital]\nI think a lot of girls, they waste my time\nBut I think I found mine, my ride or die\n\n[Verse 2: Mac Mall]\nThat’s my queen, I’m her king\nThat’s main, we a gang\nGetting at the finer thangs, in life\nThat’s my wife, got my back, when things is trife\nSo at night, she keep it tight\nI do it right like rain\nMy boo thang got that insane, say my name, say my name\nSwear she the type of thang that make your whole life change\nI put her up on game, she never small change\nLike them lames do it for the fetti not the fame\nKeep a ride or die by my side\nYou know that I’m winning long as you is mine\nOn us, I love her, last the test of time\n\n[Chorus]\n\n[Verse 3: Baby Bash]\nLike Clyde and Bonnie, we gon’ ride Bugatti\nKeep our business to the face and don’t tell nobody\n‘Cause I found mine, shine like we on Cloud 9\nWithout you I mighta been a chalk outline\nSo I got your back like a bra-strap\nWhen I dick you down proper, you take all that\nSo tell them goofy ass niggas they could fall back\n‘Cause they ain’t never get a comment or a call back\nSo I give you all mi corazon, ‘cause I know you gon’ ride for me\nAnd we gon’ prove them haters wrong ‘cause you’re my ride to the D-I-E\n\n[Bridge: Vital]\nIs you ridin’?\nIs you open?\nIs you payin’?\nOr is you goin’?\nIs you ridin’?\nIs you open?\nAre you payin’?\nGirl, I’m just sayin’\n\n[Chorus]", "year": "2015-04-21", "album": "Legal Business?", "title": "Ride or Die"}], "artist": "Mac Mall"}