{"songs": [{"lyrics": "[Chorus]\nTell me what you want and I'mma give it to ya\nDon't want to be about your man or what he did to ya\nAin't no need to fuck around let me give it to ya\nCall a nigga when you need him, talk shit to ya\nTalk shit to ya\n\n[Intro]\nTalk shit to ya\nTalk shit to ya\nTalk shit to ya\n\n[Chorus]\n\n[Verse 1: Marlon C]\nHad a girl one time finer than all outdoors\nShe were nice but every last single one of her friends were hoes\nI love the girl man, forget your friends\nSaid will be with me 'til the end I give you anything\nAnd when you need your weed to be smoked, fuckin' go broke\nGet your nails done every week if you want you can do ya feet\nFuck the receipt, I ain't gon' check up on you\nSee I trust you to the fullest for you, I'd take a bullet\nSit admit the world thought I had found the perfect woman\nCause she kept me coming 24/7 swear it were like heaven\nWhen we made love thank the Lord above you all mine at all time\nBelieve you got that sunshine\nHer heart and mind is open just as much as my nose is\nYou said you wanted one kid I told you three or four of em\nMaybe a couple more of em, add to the collection\nReal big ole house on the hill honey yeah we want you\n\n[Bridge: D'Angelo & Marlon C]\nIf you tell me how you feel\nGon' break up with your ex\nI'll be more than happy to set up shop\nSince we already had sex, might as well finish the rest\nYeah I know you love what I'm tellin' ya\nHe don't spend time wit' you, wine and dine wit' you\nHe don't even go out in public wit' you he fuckin' wit' you\nYou better see the light and come on here tonight\nTurn you loose on some vodka and juice, aight?\nThe way I kick it see it's better than Bruce, aight?\nAnd when I've finished we can grab all the dudes, aight?\n\n[Chorus x2]\n\n[Intro]\n\n[Verse 2: Marlon C]\nYou said now he ain't worth for shit, drink the liquor\nEvery time I call you on the phone with the nigga\nKeep on playin' it off, your heart's soft smile when you see me\nLet him know you need him, you know you ain't gon' leave him\nTry to reach him by beeping him but his pager be at home\nCause see he creepin' while you sleepin' and that's the reason you weepin' and carryin' on\nPerm but on a budget he took it back\nGave it to some other little heffa that you ain't like but that's life\nYou ain't his wife yet still you wanna be\nGoing back to some waters when you need to be with me\nSee it's all about letting go of this ho, girl stop that crying\nThe easy way to do this, amused me to see ya kept trying\nLying to yourself I ain't deaf, heard you wanted inside\nI called by soon as you did it you started haulin' 'em off\nWhat's the problem? I can solve 'em if you're down\nSee I ain't no Brandy I come in handy when it's just a rebound\n\n[Chorus x2]\n\n[Intro]\n\n[Chorus]\n\n[Intro (Extended)]", "album": "Baby Boy: Music From the Motion Picture", "year": "2001-06-19", "title": "Talk Shit 2 Ya", "image": "https://images.genius.com/b8ff5806bec69476a631e3e1d6c09a4d.500x500x1.jpg"}], "artist": "D’Angelo"}