{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "Yeah\n\n[Cuts by DJ Jayceeoh]\n\"Akrobatik-batikkkkk\" (uh, uh) (what?)\n\"And Talib, Talib, Kw-Kw-Kw-Kweli, Kweli\" (yeah, word)\n\"I blow the back out\"\n\"Back out, the track out, the track out\" (uh, uh)\n\n\"Kweli and Ak put a stamp on it\" (yo, yo)\n\"I blow the back out a track when I black out\"\n\"I blow the back out the track out\"\n\"The track out\"\n\n[Akrobatik] (Talib Kweli)\nLet's go, yo\nI be the host of your show, Mr. A to the K-R-O (what up bro?)\nSame shit, steady makin them hits (I see the same as me)\nSo what up? (Put a stamp on it, stamp on it)\n\n[Verse 1 - Akrobatik] (Talib Kweli)\nAkro, so straight for '08\nKweli, both names that hold weight\nSo when you be creatin your playlist, don't forget that we are A-list material\nLyrics dirty to the point they scratchin off the serial\nAnd straight to the basura, goes that whack shit in your stereo\nI'm Akrobatik brother, I'll out-backflip Rey Mysterio\n617 to the 619 (one nine)\nChicks pon heaven when he kicks one line (one line)\nAnd big up to my DJ, pon the mix one time (one time)\nPut 'em up, get 'em high\nIf hip hop is dead, then it happened the day that Dilla died\nBut Ak and Kweli's here to show you that this shit is still alive\nA couple brothers with talents to rip your brain apart\nBut who would rather just bring \"Balance\" to your \"Train of Thought\nOur \"Black Dialogue\" documents \"The Beautiful Struggle\"\nBringin any stage or studio trouble\nSo spin the vinyl back (*vinyl scratching*), you'll have somebody like \"I know Ak\"\nHis show will rock your body from the intro to the final track\nThat's the outro, no doubt yo\nRappers is marks/Marx like Groucho, nothin to vouch for\n\n[Break - Akrobatik] (Talib Kweli)\nYo, the special guest on the jam is Talib\nYo, you know you the man (what up fam?)\nSame shit, steady makin them hits (I see the same as me)\nSo what up? Yo, put ya stamp on it, stamp on it\n\n[Verse 2 - Talib Kweli] (Akrobatik)\nYo, live at your stereo, your hero get dinero though\nI have the name, them name a country after like Amerigo Vespucci\nWe authentic like the Gucci with the serial number\nThese rappers Fruity like the Pebbles in your cereal, wonder\nWhy, some will die by the code of the Samurai\nIf this is nine eleven, they the fireman that ran inside (inside)\nDreams put on hold, like operators standin by\nCamouflage like a mirage dodgin the camera's eye (woo)\nKweli and Ak make your chick fantasize\nWith Spanish fly, we ever take the stand, you know we plan to lie\nWhat kind of man am I?\nI'm way off, if you think I'll take a day off\nThis ain't Ferris Bueller (what?), I'm not camera fry\nKick the sand in your eye\nGround your ass, if you plan to fly\nBurnin through your skin like a can of lye\nThe rock and the dealin since Stand to the Side\nMy fear somethin like a Panther with pride\nFans will decide who the truth when it come to this rap shit (rap shit)\nKweli and Ak kid, classic in the year of the Blacksmith (Blacksmith)\nBoston to New York City, Talib Kweli, Akrobatik, get that mail\n\n[Akrobatik]\nWhat up? And put a stamp on it\n\nAkrobatik and Talib Kweli, we stand taller than the Great Khali\nAnd yo, we turnin you out\nAk with Blacksmith, show 'em what it's about\nY-Y-Yo, put your stamp on it, stamp on it\n\n[Outro - Cuts by DJ Jayceeoh]\n\"Yo, yo, yo, P-p-put your stamp on it, stamp on it\"\n\"Yo, Kweli and Ak\"\n\"Put a stamp on it, stamp on it, stamp on it\" (yo, yo, yo)\n\"I blow the back out the track when I black out\"\n\"Black out, I blow the back out the track out, the track\"\n\"I blow the back out a track when I black out\"\n\"Black out, black out ...\"", "title": "Put Ya Stamp On It", "album": "Absolute Value"}], "artist": "Akrobatik"}