{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "White Man’s Burden", "album": "X-Ology: The Best of X-Raided", "lyrics": "* - one of 5 new releases on this \"Greatest Hits\" album\n\n[First Verse]\nMy fore fathers was bought and sold, raped and sodomized\nNow after eight hundred years you decide to apologize\nApology not accepted, too late for repentin'\nTime to ride, homicide to William Clinton\nThat ass rippin', penetrated with baseball bats\nShoot him up with heroin and get him hooked on crack\nBlack folks been sufferin' in the United States\nThese United Snakes got us in divided States\nShell-shocked, Hell's got to be here on Earth\nIn the ghetto circumstances can't get no worse\nCertain chances we takin' to survive, we got no choices\nSo we rappin' hopin' we can make it happen with our voices\nI was too small for football, too short for hoops\nSo I rode with the Crips and cliques thick with troops\nX-Raided them tricks hated but I don't give a fuck\nUneducated bitches don't realize they stuck\nYou're oblivious to the fact that your life is hideous\nWe're holdin' our own and we don't need you to pity us\nPlus, we got our own kind holdin' us down\nThose who sold their souls, but it'll be cold\nWhen we catch you, I bet you'll receive the death sentence\nTurnin' racist generals into pulp non-fiction\nCircumcision the \"G\" way\nMurder the D.A\nHit 'em with hollow slugs, show him no lee-way\n\n[Chorus: repeat 2X]\nIt's too late for apologies fuck your sorrow\nDoin' it one day at a time yellin' \"Fuck tomorrow!\"\nIn the streets it's crack, guns, and infected bitches\nGenocide on the down-low, the White Man's wishes\n\n[Second Verse]\nMy father figures was Arnold \"Schwarzanigga\" and Sly Styllone\nPuttin' visions of murder in a nigga's dome, early on\nI grew up, watchin' Al Pacino and Nino Brown\nTarentino is the one who let me know how to put it down\nTelevision created a gang of niggas like me\nWe learned how to kill at home watchin' T.V\nIt poisoned my mind as a youth\nIntroduced me to money, mayhem, and murder, I'm the product it produced\nLet me loose to prowl, now they sayin' I'm a killer\nCuz European ideology's all about the scrilla\nAin't y'all feelin' the devastation you're causin' the Earth?\nSteady exploitin' the milk of this bitch for all that it's worth\nWhen it's ready to blow up, they gone leave this World and go on to Mars\nLeave us torn and everybody up will be reachin' for stars\nWhy my people so caught up in money, cars, and bitches?\nDon't you realize, you're fulfillin' the White Man's wishes?\n\n[Chorus]\n\n[Third Verse]\nLord forgive for all the blood that his body bled\nAnd all the tears that his Mommy shed\nThe book says \"Thou Shalt Not Kill\", but I've seen more blood spill\nThan all them vets on Hamburger Hill\nIt's real post war syndrome\nI went to see my homie but his Mama told the homie been gone\nAnd every time I turn around, it's a body on the ground\nFresh gun shot wounds, but he didn't hear a sound\nWhen he came out the womb, nobody told him he would be dead so soon\nThe gauge went BOOM\nIt's America, I know you got a cure for AIDS\nWe need a cure for rage, on the rampage\nCan you feel it?  The tension's in the air thick\nAnd hate got me so high I'm gettin' airsick\nYou got my people broke, lookin' for a buck to borrow\nDoin' it one day at a time, FUCK TOMORROW!\nFuck your song!\nI want revenge!  I got a beretta named Vendetta\nTime to answer for your sins nigga\nAnd when you meet your creator tell him I said, \"I apologize\"\nBut I gotta ride...\n\n[Chorus] - repeat til' fade"}], "artist": "X-Raided"}