{"artist": "Drake", "songs": [{"year": "2014-04-01", "album": "Care Package", "image": "https://i.embed.ly/1/display?key=fc778e44915911e088ae4040f9f86dcd&url=https://i1.sndcdn.com/artworks-000075319254-z1l6qc-t500x500.jpg", "title": "Draft Day", "lyrics": "[Produced by The Fam; co-produced by Boi-1da]\n\n[Intro]\n(Watch out, watch out)\n(Look out, look out)\n(Watch out, watch out)\nYeah\n(Look out, look out)\nYeah\n\n[Chorus]\nDraft day, Johnny Manziel\nFive years later, how am I the man still?\nDraft day, A. Wiggins\nFuck that other side, bitch, we stay winnin'\nAww man, you know I had to do it for you\nYou know I had to do it for ya\nYeah, suits and ties yellin' out, \"Pay the guys\"\nMan, I had to do it for ya\nYou know I had to do it for ya\nYou know I had to do it for ya\nAww man, aww man, aww man\nMan, you know I had to—\n\n[Verse]\nSometimes I laugh with God about how you can't stop me\nI'm his darkest angel probably but he still got me\nI'm gettin' mine, but still I better lives\nAnd shit I set aside to make sure that my people getting by\nBrunch with some Qatar royals and my cup is all oil\nYou know it's real when your niggas'll take the fall for you\nAll loyal so you keep eggin' me on\nAnd we gonna have to crack a shell just to prove to you, you ain't hard-boiled, mm\nLast night I tried some raw oysters\nMan that boy growin' up quick, that boy know he the shit\nThat boy singin' on every song when he know he can spit\nThat boy manifested it, that boy knew it was written\nThat boy did it on purpose\nThat boy know that they shittin' on you, and they can't get past you\nYou should've followed all my moves, you won't realize 'til after\nAnd if I left this shit to chance I would've picked a name like Chance the Rapper\nYeah, no offense 'cause I don't know that nigga\nI'm focused on making records and gettin' bigger\nJust hits, no misses, that's for the married folk\nTell 'em fix my suite up 'cause I'm comin' home\nI heard they talking crazy, I was out of town\nYou know they love to pop all that shit when I'm not around\nBut when I'm here, not a sound, that'll make me snap, jot it down\nGo in the booth and lay a body down\nKnow some Somalis that say we got it Wallahi\nGet us donuts and coffee, we'll wait for him in the lobby\nAnd I gotta tell him chill, Sprite got me on payroll\nLet that man live, they say, \"Okay, if you say so\"\nSee whatever I say goes, I play like I'm on 'roids, no Canseco\nNo Oakland A's though, shout out the Bay though\nI think I'm on my eighth flow, just watch me paint flow\nWe all do it for the art so I could never hate though\nSignin' off on more deals than a lawyer with a heavy case load\nHow the game turn into the Drake show?\nDog, what the fuck happen to so-and-so, where did they go?\nToo worried 'bout bitches and fashion, they go missin' in action\nAnd then you never notice they missin'\nOn some Hunger Games shit, I would die for my district\nJennifer Lawrence, you can really get it, yeah\nI mean, for real, girl you know I had to do it for ya\nYou know I had to do it for ya\nYou know I had to— oh, wait, sidebar, left some beat at the end\nSo that all of you fuck niggas could loop it and get your lies off\nSZN\n\n[Chorus]\nDraft day, Johnny Manziel\nFive years later, how am I the man still?\nDraft day, A. Wiggins\nFuck that other side, bitch, we stay winnin'\nAww man, you know I had to do it for you\nYou know I had to do it for ya\nYeah, suits and ties yellin' out, \"Pay the guys\"\nMan, I had to do it for ya\nYou know I had to do it for ya\nYou know I had to do it for ya\nAww man, aww man, aww man\nMan, you know I had to—\n\n[Outro]"}]}