{"artist": "Beanie Sigel", "songs": [{"lyrics": "Hmm, shit, I don't do much\nY'knawmean? Smoke weed, fuck bitches, huh\nGet paper cuts from countin money...\nI just be chillin, y'knawmean?\nMenage trois, knawmean? Quadrupla trois...\nY'knawmean? Shit I don't do much\nAll that shit, what you expect man?\n\n[Verse 1]\nYo, I don't do much, you know Mac stay sucker free\nSo please don't fuck with me\nYou don't really want war\nYou don't really want the heat from the four\nYou don't really wanna eat out a straw\nMan you niggas is broke, y'all niggas ain't got no cash\nMan you niggas ain't got no stash\nWhere your wheel and your rims?\nMotherfucker look at the heel on your Timbs\nNigga your walk and your talk you niggas is ass\nShit, I don't do much, you know Mac, lay in the cut\nIn the 'telly somewhere layin a smut\nChampelly, purple hayin it up\nFront row A layin it up\nOr in the kitchen prob'ly weighin it up\nOr in a mission prob'ly sprayin shit up\nNiggas playin too much\nI try to chill but they be sayin too much\nBut you know they dont say it to me\nThey don't play wit me\nYou shit where you eat, you might as well lay in your pee\n\nShit, I don't do much\nI don't do much\nShit, I don't do much\nY'knawmean? Fuck...\nFuck, I don't do much\nI be chillin man, I don't know about y'all though\nShit I don't do much\n\n[Verse 2]\nI roll a L, go in the booth\nSpark it up, start blowin the truth\nI don't do much, I smoke weed, pop pills, sip water\nFuck it, keep it real, keep steel, give orders\nSuckers, give out halves, squrrlies, y'all call it quarters\nYoungun, take this eightball, cuz you take long\nAnd please, don't make me use this eight long\nCuz you could get all six up in your acorn\nAnd trust me...\nY'all don't want that\nY'all don't want Mac to snap on you cats\nYou don't really want no problems\nYou don't layin under your squatter\nYou don't want me fire bombin your house\nYou don't want me duct tapin your mouth\nBetter yet, pourin lye in your mouth\nYou don't want me smackin up your kids\nYou don't want me layin up in your trash\nPoppin up, then I'm poppin your ass\nCuz you won't do shit\n\nI don't do much\nShit, I don't do much\nY'knawmean, I just be chillin I be smokin man\nI don't be thinkin about y'all niggas man [I don't do much]\nY'knawmean, I be chillin\nShit, I don't do much\n\n[Verse 3]\nI just chill up in the middle of the block\nWatch my younguns make a killin on the block\nTell 'em watch trucks who be wheelin through the block\nGet shot, get shucked with vans chillin on the block\nShit, I don't do much, I just chill and relax alot\nI don't hustle, I just tax the block\nShit, I don't do much, I just roll out and play wit tools\nThat make you faggots obey the rules\nShit, y'all don't do much\nBut drink 40's, look dumb on the block\nDamn near 40, still runnin from cops\nY'all don't do much\nY'all niggas ain't stackin no cash\nThat shit you pack got a crack in yo' ass\nY'all don't give a fuck, y'all gon' get cuffed\nAnd I'mma laugh when y'all get stuck\nShit, I don't do much\n\nHeh, y'knawmean, y'knawmean?\nI don't do much\nI don't give a fuck man, smoke weed, get high\nFuck bitches, that's my biz [I don't do much]\nY'knawmean?\nI don't do much\nY'knawmean four pound?\nShit, I don't do much\nI don't do much\nAnd I don't give a fuck", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "I Don’t Do Much", "album": "The Reason"}]}