{"songs": [{"lyrics": "[Intro: Various Samples]\n[Give him one of these pills if he has any pain]\n[A parable....What is it? Well it's a little story with a lot of truth\nAn earthly story with a heavenly meaning\nJesus told many parables to grown-ups and children alike\nHe told them simply and sincerely, in words everyone could understand\nSo that all might learn the lesson he was trying to teach...]\n[Yeah!]\n\n[Verse Intro: Aesop Rock]\nThey were selfish with the helmets on the little bus\n'Till brake fluid sewage crippled up the get-retorted nickel punks\nSlowly cope but swore his lowly robot vole evoke\nWould one day rise in sections to interrogate the Holy Ghost\n[I knew it!]\n\n[Verse: Aesop Rock]\nHoly smokes!\nFather, black suit white collar\nKiddie porn dungeon, guns, and three fingers for your daughter's\nCaught belly-up, antique Nazi paraphernalia\nYou cannot pay your bills with holy water and Hail Mary luck [Oh my!]\nShucks fucker, enjoy the Alcatraz shower fun\nAnd mommy's mad I'm cliche generation X agnostic front\nIt ain't the nifty fate, the 1958, before the New-New Testament-approved Altar-boy fisting rape\nAnd \"take me to your leader\"\nLong as he don't manipulate toddler beaver [Leave him alone!]\nCall me crazy, but I bet that wasn't God's demeanor\nSodom-meter peaking [Me too!]\nBut Long Island was Jesus every weekend\nSpoon-fed to appease traditional love bringing\nOf a Middle Pennsylvania shit-hole where elders movement\nStressed the stellar therapeutic Bible cycle (How?)\nOne church with a bait and tackle store next door and not much MORE\nSo the two moved to New York, made babies raised on what they SAW\nChristmas morning smelled fresher than angel pussy\nBut immaculate conception came second to playful goodies\nLike laser-tag was way more spiritual than blood and body wafer bags\nAnd manger staff as long as Santa ate the cookies [Well...]\nGrandma was a saint, while he'd paint with snakes and bullies\nSaid If only you'd memorized your prayers like you did your Kool Gs!\nBy the time I was old enough to know what religion was\nI was Catholicism-numb and truly didn't give a [FUCK!]\n'94: Moved out the crib and it ain't seen a steeple since\nWhat Knievel-evil seeps in a Christian leader's pitch\n'Till priests' laps slapped with parental advisory warnings\nI'll be auditioning Gods in my office on Monday morning\n\n[Hook: Various Samples & Aesop Rock]\n[Yeah!] {Scratched throughout chorus}\nUh oh! And yet another pill slipped\nDown the hatch and pass 'em through the kill-switch\n\nI need a couple A's for Q's\nI'm not an asshole I'm just a little confused\n\n[Interlude: Sampled]\n[This story reminds us of the one Jesus told about people who were kind and\nHelpful to others. He said that one day the king would say to these people:\n'Come. Inherit the kingdom prepared for you. For when I was hungry you gave me food. When I was sick and you visited me. I was in prison and you came to me.'\nBut the people asked, when Lord did we see you hungry and feed you?\nOr sick or in prison and come to you? and the king answered:\n'In as much as you have done it unto one of the least of these, my brethren\nYou have done it unto me.']\n[Yeah!]\n\n[Hook: Aesop Rock]\nJust a little bruise in the back of the pews\nActing amused with a mask and them Vatican blues\nFor in the eyes of the organization I was raised in\nAes' is just another sinning brick in Hell's basement\nCubicle adjacent to the killers and rapists\nFor what? Drugs and fucking, It's part of growing up\nLike cuffs over dumb shits is better than the schools\nI'm not an asshole I'm just a little confused\nJust a lit fuse in the back of the pews\nWatching a thousand flavors of the same God feud\nI figure ultimate-peace is the common theme\nSo its a no-brainer \"peace\" when the blood hit the screen\nGot a basic good and evil sensibility born\nGood neighbor know a halo wouldn't fit over horns\nI'm more science than faith, I'm more karma than bread and booze\nI'm not an asshole I'm just a little confused\nNot an asshole I'm just a little confused\nNot an asshole I'm just a little confused\nNot an asshole I'm just a little confused\n\n(You know what? To be completely honest, Aesop, you're a fucking asshole)", "title": "Holy Smokes", "album": "Fast Cars, Danger, Fire, and Knives", "image": "https://images.genius.com/2434fa81c5b8e4d6767c0b655d69bd1b.498x500x1.jpg", "year": "2005-02-22"}], "artist": "Aesop Rock"}