{"songs": [{"year": null, "image": "https://images.genius.com/ce9a0317f67940b823d8370135d930af.500x500x1.jpg", "title": "Money Getter", "album": "Dirty Pretty Things", "lyrics": "{DK}\n\n[Rapper Big Pooh]\nI'm a money getter, a pound flipper\nYen, euro, yuan - they all differ\nI get dough, I stack bread\nOld school, keep a lil' where I lay my head\nStraight bills, no change (none)\nFlip currencies when it's time to board planes\nSafe landing when it's tuck behind the old frame\nPickin up more money at the baggage claims\n\n[Chorus]\nI'm gettin it, you gettin it?\nForeign exchange, I'ma keep spendin it\nGot cars same color as the Raiders\nIndependent nigga makin money like the majors\n(\"Cause I'm a money getter, I'm-I'm a money getter\" - Big L) Yeah.. {4X}\n\n[Rapper Big Pooh]\nBags been packed, passports stamped\nGoin overseas, no not the lamp\nGoin overseas, lookin for a stack\nFillin up a duffle, bring it all back\nNo Ron Isley, taxes got paid\nHad no clue all the money I done made\nDon't classify me as just a backpacker\nCan't classify me as an underground rapper\nNo not a trapper, Poobie just hustle\nUnder all this fat, know Poobie got muscle\nMind on my money, mo' I really need it\nPeople sing that T-Pain to me, they +Can't Believe It+~!\nAnything I put my mind to achieve it\nEverything I dream of, I concieve it\n\"For the love\" couldn't keep the lights on\nI'm watchin Ty-son, 60 inches, can you SEE it?\n\n[Chorus]\n[Rapper Big Pooh]\nTravel 'round the globe, then it's back home\nThat's when you find me in a whole 'nother zone\nMind on my money, money on my mind\nMind on my business, baby in due time\nYou'll understand that I'm all about bank\nYou can walk around like your shit don't stank\nYou can ask niggas in the club to buy dranks\nFocused on gettin this bread like Tom Hanks\nGod come first, family come second\nThird is the Almighty Dollar, my peckin\nOrder is the Order of the Day, serve porterhouse filet\nRap niggas always got shit to SAY!\nAsk about me, always got shit to play\nShow out of town, yeah I'm on my way\nNo video blogs, I go hard\nGettin money, it's evident I'm on my job, uh\n\n[Chorus 2X]"}], "artist": "Rapper Big Pooh"}