{"artist": "Khia", "songs": [{"image": "https://images.genius.com/32deca0fcef2f3102d33fef2ae5d613b.640x640x1.jpg", "title": "Bullshitting", "year": null, "album": "MotorMouf Aka Khia Shamone", "lyrics": "[Hook]\nThese niggas be bullshit\nBe bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to stop bullshit\nQuit bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to stop bullshit\nBe bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to stop bullshit\nQuit bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to (stop bullshit)\n\n[Verse 1]\nWho they hittin' on like they motherfuckin' money long\nBut most these niggas broke as hell and they ain't got none\nOl' broke ass niggas wearin' fake ass chains\nRun a real motherfucka ain't boutta goddamn thang\nYou's a crap fo' a nigga, pull yo pants up\nYou not hustlin' motherfucka, get yo weight up\nYou sellin' dick like a hoe, you's a bitch now\nYa hoe takin' care o' ya, you the shit now\nThat ego gon' get you niggas fucked up\nYou free doe so why you actin' like you locked up?\nYou pretty tough when you jumpin' on a weak bitch\nDem crackers comin' then you turn into a weak bitch\nYeah I said it, motor mouth, bitch you better know it\nI'm guaranteed to put this motherfuckin' steel on ye\nI gotta tell these hood rats how the game go\nYou take care nigga 'fore you do yo kids, hoe\n\n[Hook]\nStop bullshit\nBe bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to stop bullshit\nQuit bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to (stop bullshit)\n\n[Verse 2]\nStalkin' me, nah I ain't shawty, nigga man up\nIf you a king, act like it nigga, stand up\nOh what forgot yo gangbangin', you's a man now\nA bullshit motherfucka, pull yo pants down\nAnd get fucked 'cause you got the game fucked up\nAnd you's a hoe nigga, and you broke nigga\nTryna act like you a killer when you're really scared\nYou only act hard when you're with ya bodyguard\nTime's up for all the motherfuckin' bullshit\nIf you a real nigga, pay yo bill nigga\nOl' snitchin' motherfuckas workin' with the law\nA-you's a house nigga, I'm a field nigga\nI'm in the jungle everyday, where you at nigga?\nA paddywhack ass suckle, where yo stack figure?\nAlways big boy talkin', put yo bread up\nA crown by the lil' money, bitch I'm sicker\n\n[Hook]\nStop bullshit\nBe bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to stop bullshit\nQuit bullshit\nThese niggas ain't got no money\nThese niggas ain't got nothin' for me\nSo they need to stop bullshit\n\n[Bridge]\nOl' broke ass niggas wearin' fake ass chains\nRun a real motherfucka ain't boutta goddamn thang\n\n[Outro]\nStop bullshit\nBe bullshit\nWh-what they stalkin' me? You ain't got no fuckin' money today\nNigga you ain't never got no motherfuckin' money no way\nSo stop bullshit"}]}