{"artist": "Ace Hood", "songs": [{"title": "Body 2 Body", "album": "Blood, Sweat & Tears", "year": "2011-07-26", "lyrics": "[Intro: Ace Hood & Chris Brown]\nYeah, Ace Hood (Woah)\nWhat's up, baby? We the best, huh (Woah, oh)\nSo I had a few things in mind  (Woah oh)\nHaha, and I was thinkin' of\n(J.U.S.T.I.C.E. League, J.U.S.T.I.C.E. League)\nOw!\n\n[Chorus: Chris Brown & Ace Hood]\nBaby, you don't have to try to read my mind\n'Cause you know I wanna get it in (Na'mean?)\nAnd tell me why would we just think about it?\nIf you want it, then I got it (You know what it is, baby)\nWe can be body to body, body to body (Mr. Hood)\nI don't mean to rush you, girl\nBut we should be body to body\nBody to body, body to body (Mr. Hood, yeah)\n\n[Verse 1: Ace Hood]\nUh, picture your body soakin', bath water\nNo panties on, come up out them leg warmers (Ooh)\nWrap up your hair (Hair), leave on your heels (Heels)\nKissin' you while I whisper, \"Shawty, how it feels?\"\nLet ya mind wonder, oh, you're thinkin' dirty\nI was thinkin' you can ride me, Miss Kentucky Derby (Haha)\nI dream about it, let's take advantage\nMy body on your body, hope that you can manage\nGotta moan it, damn it, feels good\nPullin' on her hair to let her know I'm still hood (Right)\nDamn right (Damn right), so unreal\nThis year of the Ace, bet ya that she know the deal (Ow!)\n\n[Chorus: Chris Brown & Ace Hood]\nBaby, you don't have to try to read my mind\n'Cause you know I wanna get it in\nAnd tell me why would we just think about it?\nIf you want it, then I got it\nWe can be body to body, body to body\nI don't mean to rush you, girl\nBut we should be body to body (Yeah, I say)\nBody to body, body to body (That's right)\n\n[Verse 2: Ace Hood]\nUh, so quit ya contemplatin', skip this conversation\nBy the way you bitin' on your lip just gave me confirmation\nWas that Chanel 5? Very sexy fragrance\nAre those your real eyes? Can tell you're partially Asian\nBut I know your body got me focused, I'm just so sedated\nAnd I guarantee I'll do you better than your past and latest (Ow!)\nBody to body (Body), wet as Dasani (Woo!)\nBet if I hit your spot that I'll make you tsunami (Ow!)\nChange up the sheets (Sheets), no time to sleep\nAsked her what she's think, then she replied that I'm a beast (Woo!)\nYeah, she replied that I'm a beast (Ah)\nGot it locked between the sheets and even in the streets\n\n[Chorus: Chris Brown]\nBaby, you don't have to try to read my mind\n'Cause you know I wanna get it in, yeah\nAnd tell me why would we just think about it?\nIf you want it, then I got it\nWe can be body to body, body to body (Yeah)\nI don't mean to rush you, girl\nBut we should be body to body (We)\nBody to body, body to body\n\n[Bridge: Chris Brown]\nWe're making love on the floor\nYou're kissing my tattoos\nI'm pulling your hair, you scream my name\nCall me daddy, baby, I got you\nGirl, get in your bed and lay it down, down, down\nGirl, are you ready?\n'Cause I'm gon' want you face down, down, down, right now\nYou fucking with a real freak\n\n[Chorus: Chris Brown]\nBaby, you don't have to try to read my mind\n'Cause you know I wanna get it in (Girl, you know that I wanna)\nAnd tell me why would we just think about it? (Yeah, yeah)\nIf you want it, then I got it\nWe can be body to body, body to body\nI don't mean to rush you, girl (Oh, we can be)\nBut we should be body to body\nBody to body, body to body (Yeah, oh)", "image": "https://images.rapgenius.com/3e61f4fc51761f6b032d9ce794ae690c.1000x1000x1.png"}]}