{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/8518dd2d23ac286b62bc5bd0d0d3d6db.1000x1000x1.jpg", "title": "Almost There", "year": "1998-03-10", "album": "Heavy Mental", "lyrics": "[Intro: Killah Priest]\nFirst time in rap history your mind will be tooken to a level\nPrepare yourself\n\n[Verse 1: Killah Priest]\nWhen I relax my thoughts and my brain hovers New York\nMy third eye glides with the view like a hawk\nThey find my mind is automatic\nRhymes are tragic, found in the attic\nLost you in Asia, minor, find you in a laser beam\nI'm supreme, my mind state is like a dream\nStargazer scarred from the radar\nBeyond Gods and moms and airwaves and channels\nDesert rats and camels, reptiles and mammals\nStandings of Daniel, Emmanuel and Samuel\nEzekiel's wheel over tall trees and hills and mountains\nFountains, rivers, lakes, brooks and ponds\nInhabit by rabbits, snakes and swans\nEnergy is solar light barrelled beyond the Sun Controller\nOver Jehovah through the days of Noah\nTremendous speed around the Octaman Sea\nBlack Sea, Sea of Caspainia\nPersian Gulf all the way to Mediterranean\nCity of Atlantis, skin is getting tight as a mantis\nPriest style is organic, mechanic seagulls, swings over the eagles\nSoars over cathedrals built during the medieval\nShall remain in the ordained Byzantine Empire\nTake you higher one stage as a massive fire\nBut still like Niger, arch rival of Constantine\nDark Ages got sparked through the stages\n307 A.D. Constantinople ruled mobile\nSeeking global floating motion over the Arctic Oceans\nScan the land, every inch of the sand\nNever bring plans, animals, woman, child and man\nBeasts and fish every inch, length and width\nCome through the abyss over Egypt\nA space odyssey with more angles than photography\nMore exotic plus it's erotic like pornography\n\n[Break: Killah Priest]\nAm I almost there?\nYeah I'm almost there?\nAm I almost there?\nYeah I'm almost there?\nAm I almost there?\n\n[Verse 2: Killah Priest]\nI'm a space cadet from a tape in the cassette player\nBy fasting and prayer, I'm passing the ozone layer\nI meditate then I'm near top of skyscrapers\nView fluid nature, dropping, blew through a vapour\nThen there's paper, the wind that take you\nQuiet as the breath in your nose\nAppear in the cold from the depths of our soul\nWhich has no weight, constants rotate at a slow rate\nThrough the black holes over rainbows in Kuwait\nDestination, operation, alternation of the Sun\nCircuit stars, positions seasons, I weigh a tonne\nImmortality through galaxies, I'm burning\nIt's like accomplished, plus the compass keeps turning\nPure as a virgin, release heavy burden\nI travel when I preheated the urban\nHit the firmament, shock waves are permanent\nRays of children gaze and stand amazed\nSo long, I'm going to the place Paul Apostle was born\nWhich is in Tarsus, small city in Cilicia\nThen I moved south, all the way to Nigeria\nRow the Tigris River all the way to Assyria\nMesopotamia all the way to Syria\nEuphrates to the Ur of Chaldees\nUp the Highland located near Iran\nFurther crescent till I reach a section\nFrom each direction, from East to West and\nFrom North to South, all over the equator\nNeptune from the womb of the creator\nKillah Priest the Iron Sheik from the Middle East\nI'm Almost There so prepare, I say peace... peace..."}]}