{"songs": [{"title": "My Time Pt. 2*", "album": null, "year": null, "image": "https://images.genius.com/bb479613ff6939c7c3a3483470375719.1000x1000x1.png", "lyrics": "Lyrics from Snippets\n\n[Verse 1]\n-bro (They call me bro), now they pull up to my show\nI'm just doing me, they comparin' all my flows (Comparin' all my flows)\nAnd they don't even know (And they don't even know)\nAnd you don't even know and we don't even know\nI just know I'm 'bouta blow, I just know I'm 'bouta go\n\n[Chorus]\nShout out to my nigga Vell, yeah, he know he from the North\nGot your bitch, she on my body and she sucking me on soft\nWhy these niggas talking hot? Boy, you know that you ain't tough\nYeah, and I ain't gon' lie, got me really fucked up, really fucked up\nReally fucked up, really fucked up\nGot me really fucked up, really fucked up\nReally fucked up, really fucked up\nGot me really fucked up\n\n[Verse 2]\nI swear, I don't fuck with these niggas\nI'm tired, I act like I fuck with these niggas\nJust lie 'cause they ain't get fake, I get bigger\nSometimes I don't even wanna get bigger\nI remember when I didn't look in the mirror\nNow I see I'm the man when I look in the mirror\nAre you really that man that you see in the mirror?\nIs that really your gang? Did they help you get here?\nFit gon' drip, it don't matter what I wear\nI could wear a Nike sweatsuit with a Moncler\nAnd it's gon' be angelic as long as I'm here\nThey say \"Lil Tecca, what style are you wearing?\"\nYeah, shawty on my body, I don't even want her\nAll cold on my side, I ain't even gon' burr\nFuck diamonds, them niggas, they be using me for clout, yeah\nPull up on your block, all my niggas gon' skirt\n\n[Chorus]\nShout out to my nigga Vell, yeah, he know he from the North\nGot your bitch, she on my body and she sucking me on soft\nWhy these niggas talking hot? Boy, you know that you ain't tough\nYeah, and I ain't gon' lie, got me really fucked up, really fucked up\nReally fucked up, really fucked up\nGot me really fucked up, really fucked up\nReally fucked up, really fucked up\nGot me really fucked up"}], "artist": "Lil Tecca"}