{"artist": "Big Boi", "songs": [{"lyrics": "[Intro:]\nGodzilla!\n\n[Hook]\nWe on fire fire fire fire\nYea! We on fire fire fire fire\nYea! We on fire fire fire fire\nYea! We on fire fire fire fire\nYea! We on fire fire fire fire\nNiggas wanna tell it, hoes wanna gossip\nNiggas wanna tell it, hoes hoes wanna gossip\nNiggas wanna tell it, hoes wanna gossip\nWe on\n\n[Verse 1: Big Boi]\nNo introductions needed, boy just call me the undefeated\nAnd underneath this Georgia dry I know I can’t be seen (winner)\nFire vocals because my voice was a classic\nLike Coca Cola when they had cocaine in the package\nI meant to say blowing the ingredients\nBut I went to the mall today and all the niggas had those mediums\nLittle bitty ass clothes\nLike dancing with the stars without the judges or the dance floor\nOh and niggas don’t dance no mo\nAll they do is this\nBeef it up, call me Venus fly chart waitin' on fly Mc' to eat em up\nI’m fly, yes I can beat them weak as fuck and ain’t no keeping up\nI’m balls deep and then we big in the\nFat sacks nigga, Cadillac killer\nCataract prescription filled up\nI got my medicinal card from Los Angeles, the city of lost angels\nA connoisseur of cannabis\nI’m from Atlanta bitch, we never shop with strangers\nNo matter, we strain the slanging, some of the game rules done changed\nNiggas is outchea talking like a cockatoo to a cop or two\nNow they watchin' you and yo mama too, bird’s eye view\n\n[Bridge: Blue Oyster Cult]\nWith a purposeful grimace and a terrible sound\nHe pulls the spitting high tension wires down\nGodzilla!\n\n[Hook:]\n\n[Verse 2: Pimp C]\nI’m getting blowed on the regular\nRiding and talking dirty on my cellular\nPlayer I got some real good that will save you some\nUh and if you my homeboy she gon give you some\nAnd it’s all for the paper but she still gon come\nYou dippin' in the cookie jar, now you sprung\nI have you trippin' like it’s nothing thorough\nPlayed on my hoes, don’t talk to nobody, gon tell yo girl\n(Uh, now look)\n\n[Verse 3: Big Krit]\nOkay but niggas wanna tell it, hoes wanna gossip\nCus they pussy wasn’t hittin and they lip was super sloppy\nSucka duck a motherfucker, we done chop the brain about it\nBut my money corner pocket, plenty game ho\nSlap it like a biscuit, king of diamond, king of trickin', what’s the difference\nGot it poppin' like a skillet with some chicken grease in it\nCountry born, country paid, from the village to the grave\nWorth the payment, body truckin' cus the money I already made\n\n[Hook:]\n\n[Verse 4: Bun B]\nMan I hate that all the time I got haters in my bizz\nTalking bout the trill but don’t know what the fuck it is\nMothafuckas nowadays are seriously sorry\nThinking that the key to life is putting yo business on Mari\nThey say you’re rockin Mari but them mothafuckas Rockport\nAlways talking bout you bustin nigga but your Glock short\nI know the truth so ain’t no need in yo line\nBullshit ain’t workin, ain’t no need to be tryin\nI’m dyin to be that nigga that’s spyin in the telescope\nProwlin with triller niggas but iron to yo dearly folk\nTelling them talk tales, vibs and hung angers\nSave it for Jeremy, Kyle, Steven, Jerry Springer\nBuzzin like a bee, tryna sting me wit yo stinger\nBitch you could get the middle, (what middle?), the finger\nStick it in yo ass and let it linger\nNo homo, we give the hynel like the RnB singer Obomo\n\n[Bridge: Blue Oyster Cult]", "image": "https://images.genius.com/13aca1a0803c515646f80b95792b028e.611x475x1.jpg", "year": "2014-02-03", "title": "GossipZilla", "album": "Week of K.R.I.T. "}]}