{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Genesis", "image": "https://images.genius.com/355ea5d28cf7f9451c601f8bacd72263.495x495x1.jpg", "lyrics": "[Intro]\nRespect this right here nigga\nI-M-D, you must play this\nI-M-D, word up\nYeah, you know, Infamous Mobb Deep\nIt's real, check it out though\n\n[Verse 1]\nRespect the I-M-D\nFresh out the carton, the R-A-double-P, E-R\nP-E-double, when I speak it gets real\nFlex try to tell me, \"Yo Dunn, nah chill\nYou can't come out, wildin' out like that\nRhymes so vivid Dunn I see what you sayin\"\nBut you gotta understand how I feel\nThe pain and the hardship it took to build\nYears of frustration, some got killed\nOthers fell vic' to the gates of steel\nMost try to instill sanity still\nStuck on this rock where we don't belong\nI wanna go home not sing this song\nBut I'm forced to perform speech napalm\nCalm, surrounded by all types of harm\nDogg man fuck your screwface I watch hands\n\nWatch your hands nigga, I see that, word up..\nWord up, peep y'all cats movements\nLaid back in the cut like what?\nPay attention.. check it out Dunn\n\nI'm bein watched by snake eyes\nPeep them shed skin plenty times\nSurrounded by crash dummies and empty minds\nGet your shit together Dunn, see between the lines\nStay awoke, to the ways of the wickedest kind\nInfamous - cause of the way, I write rhymes\nPlus my story's more foul than your newborn eatin swine\n(Stupid) Catch a seat, it's about to get deep\nLike squeezin flouride on your brush for your teeth\nOr, takin your seed to get shots every week\nWe need to pay more attention to our surroundings\nBusy wildin, all for the wrong cause\nPut that same strength into somethin that'll pay off\nDon't forget your soul's involved\nThat same energy you put out, comes right back it revolves\nI smash you, Dunn only if I have to\nI would hate to, but I'll be more than glad to\nThe positive and negative war has now begun\nP helps you seperate both the sides\nLet the truth arise, black devil don't hide\nYou can't hide from me, you might from the others\nI've been employed to pull your ass out from the covers\nYou walk like you got hooves and talk like you 'sposed to\nTrickin my brothers into followin you? Yo\nPotential energy is easily made kinetic\nI turn 'em all back where they belong, don't wet it\nWhat? Set it..\n\nSet it nigga, fuckin fake-ass motherfuckers\nTake your mask off nigga what? (what.. what..)", "year": "2000-11-14"}]}