{"songs": [{"title": "Hot Shyt", "lyrics": "[Intro: Peedi Crakk]\nHot shyt, hot shyt, come and get it, come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\n\n[Verse One: Peedi Crakk]\nCome and get it, I don't know what the fuck to do wit it\nI wrote it down, took it to the studio and spit it\nI tried to knock it in the game, a soccer, they ain't kick it\nI twist it up in the dutch, mental lit it and hit it\nMy girl won't lick it, my moms won't cook it\nThe cops won't book it, my squad ain't wit it\nI shot a point black where the cage is still live in\nI try to take it to Jamal and pray that they'll send us\nA pair of pliers won’t grip it, icepicks won't pick it\nI took it to Jigga, he couldn't do nuttin wit it\nI threw it in the river, motherfuckers started swimmin\nI bagged it up, put it on the block and couldn't flip\nWho the fuck gon' buy it? The Roc won't drop it\nMaybe if I put up \"For Sale\" sign, somebody cop it\nState penitentiary cellblocks can't lock it\nHot shyt, bitch, DJ Screw can't +Chop+ it\n\n[Hook: Peedi Crakk]\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\n\n[Verse Two: Black Thought]\nUh! Come and get it, who want it I got it I'm runnin with it\nI brung it from Philly Philly where the crimes get committed\nThem rhymes is terrific, beyond scientific\nI took it up in a gym, nobody couldn't lift it\nWhere the hell I'm 'gon send it? Will people 'gon dig it?\nI took it to Rich he said it's somethin wrong with it\nHe took ut to ?uestlove, he on the phone with it\nHe took it to Pitchfork, he couldn't get a sentence\nWho the fuck 'gon touch it? If Snoop won't puff it?\nThe streets don't love it, your peeps won't plug it\nI took it to Jigga he said it wasn't in the budget\nWe took it to Jazzy Jeff, the brother couldn't cut it\nI wonder who 'gon knock it, the world 'gon rock it\nThe squad 'gon pop it, your girl 'gon jock it\nI lost my wallet, glad I had it in my pocket\nWhen I'm up in the party, come and see me get retarded HOT!!!!\n\n[Hook: Peedi Crakk]\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\n\n[Verse Three: Tuphace]\nYo, come and get it, I admit it, I spit it kinda diff-er-ent\nThey, try to put me in the box, I wouldn't fit in it\nCoke - wasn't shippin it, dro - wasn't hittin it\nBut flippin them downloads and folks stay clickin it\nLabels won't push it, T-Pain won't hook it\n{?} campaign, straight George Bush it\nShowed it to John McCain, said it wasn't crooked\nOpened the champagne when Obama ran and took it\nThe kids won't heat it, the blogs gon' delete it\nI sent it to L.A., the nigga couldn't +Reid+ it\nI gave it to MJ and my homie couldn't +Beat It+ (Hee-hee!)\nI showed it to Stevie and he said he couldn't see it\nWhere the hell I'm gon' spread it? My city don't get it\nThe radio gon' edit, the journalists won't sweat it\nDig it, I don't give a SHIT about a critic\nI'm young, fresh, and gifted and I spit it how I live it\nCome and get it!\n\n[Hook: Peedi Crakk]\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\n\n[Verse Four: Young Chris]\nUh! My pops wouldn't raise it, Just won't +Blaze+ it\nJudge wouldn't free it, Charles couldn't see it\nAnd even if they had the horiscope they couldn't read it\nHe took it upon his self since Def Jam won't release it\nSaid the artist couldn't paint it, a poet couldn't speak it\nBullet couldn't seek it bad karma couldn't reap it\nSaid the farmer couldn't grow it, the cleaners couldn't sew it\nJohnny Depp couldn't +Blow+ it, B.E.T. wouldn't show it\nSaid the law couldn't cuff it, my lungs wouldn't puff it\nTone couldn't +touch+ it even the phone couldn't crush it\nSaid a holster couldn't tuck it Superhead can't suck it\nIt's born to rock on, explosion, one of the toughest\nSaid the barber couldn't cut it, rain couldn't flood it\nMcCain can't beat us so Barack had to lead us\nIt's the Roc motherfuckers, G-shots, undefeated\nThis flow is so insane T-Wayne Couldn't Believe it\nMOTHERFUCKERS!!!!!!!\n\n[Hook: Peedi Crakk]\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\n\n[Verse Five: Wale]\n(Kill it!) Okay, Peedi said kill it, euthanasia's in the building\nAnd Wale been on his business since Gang of Six kill it\nThe people gon' feel it, a leader win the building\nA leader to my people, niggas hate it just a smidget\nThe city can't stop it, no keys gon' lock it\nBelieve I been popular, the freaks who been pockin\nThe beggars can't borrow, the record sales drop\nAnd name another new nigga wit a sicker Twitter follow\nAnd the politics are part of it, the radio ain't on it\nPromoters say that most of them are 'fraid of my performance\nI'm flawless wit the spittin, the rappers don't live it\nMy YSL lenses, my infrared sixes\nMy infrared maxes and I ain't even matchin\nSo gonna bring the bitches, and Peedi bring the Backwoods\nAnd I'mma get some action, who said I won't do it?\nI'mma take you out the game, you +Mutombo+ to it\nMuthafucka!!!\n\n[Hook: Peedi Crakk]\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt\nCome and get it come and get it hot shyt, hot shyt", "album": "Back to the Feature", "year": "2009-06-19", "image": "https://images.rapgenius.com/740cbb12a9a5247d4852293a05ff97e7.300x300x1.jpg"}], "artist": "Young Chris"}