{"artist": "Wax", "songs": [{"year": "2016-09-02", "lyrics": "[Intro: Wax]\nYo what's up man this is Jed. I own Jed's Irish Pub across the street from your house. You know the one you walk by every day on the sidewalk? Anyway, I'm just gonna put up this folding chalkboard sign every single day for you to look at casually, with all our drink specials listed and how cheap and delicious it is. And you're gonna know how easy it would be for you to simply take a couple steps and walk in like everybody else\n\n[Chorus]\nI'm tryna stop drinking and I fucking hate it\nThe feeling that I get from it is underrated\nI just wanna get so faded I become sedated\nI'm tryna quit drinking and I fucking hate it\n\n[Verse 1]\nFuck alcoholics anonymous\nI'm gonna start a group called alcoholics obvious\nWith a good time alcohol is synonymous\nI'm 'bout to break the fuck out of all my promises\nI don't wanna drink anymore but I fuckin' do\nIf you know my music then you know that it's nothing new\nI'm drinking carbonated water like it's a substitute\nBut I need 80 right now, this is nothing proof\nWant the truth?\nI hate clarity\nIn all sincerity I'd rather temporarily be acting merrily\nAnd laugh hysterically until you have to carry me and throw me in back of a Grand Cherokee\nI need some damn therapy but um\nAA is not what I be needing\nThe lackluster greeting by sadly fucking repeating my name\n30 years sober, you still at the meeting it's lame\nI'd rather drink than that\nCall me an aristocrat\n\n[Chorus]\nI'm tryna stop drinking and I fucking hate it\nThe feeling that I get from it is underrated\nI just wanna get so faded I become sedated\nI'm tryna quit drinking and I fucking hate it\n\n[Verse 2]\nI just don't wanna give it up\nI know that drinking every day is fucking my liver up\nI know it ain't my first love I know that the music is\nI know I would've had more success in the music biz\nIf I would've stuck to writing lyrics instead of whiskey\nBut there's a whole battalion of demons embedded in me\nAnd I never challenged 'em I always just fed 'em quickly\nI guess I'm diseased\nI wish all of the stress would just ease\nI was a dreamer but the demons have undermined my quest\nI used to watch myself and discover I was the best\nBut every smart brain has a dumber side I guess\nFill myself with depressants then wonder why I'm depressed\nFans tell me my art saves\nHelps many people crawl out of some dark caves\nBut I wanna stay in mine I like where the darkness is\nI'm going to the liquor store to visit my pharmacist\nI'm giving up\n\n[Chorus]\nI'm tryna stop drinking and I fucking hate it\nThe feeling that I get from it is underrated\nI just wanna get so faded I become sedated\nI'm tryna quit drinking and I fucking hate it", "image": "https://images.genius.com/7c1dd79f5e740daf40ac14e92f0f0bef.999x999x1.jpg", "album": "The Cookout Chronicles", "title": "A.O."}]}