{"songs": [{"title": "Today", "year": "2016-07-19", "album": null, "image": "https://images.genius.com/fe6972079764e887665b319a337be686.640x640x1.jpg", "lyrics": "[Intro: Allan Kingdom]\nI think I paid my dues, I think I lift my cup\nI think my rent is due, I think I'll get high\nWindow shopping, couldn't cop, no boycott\nLeggo see what's at the top, no toy block\nThem boys got toys and still I don't even got a deal\nI think I'll get high\n\n[Verse 1: Denzel Curry]\nI like my currency lucrative, my words are provocative\nI say what I say cause what I say is my prerogative\nI stay positive as if I was terminally ill\nI could imagine having a friend but that never was real\nLemonheads only using me for the limelight\nLooking at my wrist, they reveal themselves when the time's right\nWhen it's said and done, I can only see it in hindsight\nPull a Fetty Wap on these niggas and give a blind eye\nI don't rock fake shit or fight soft niggas\nI try to unite all my brothers cause I lost niggas\nI got Nell and Slikk back so now I kick back\nOnly thing I pray for is Mookie to get his jit back\nWhat's up?\nGot my nigga Boogie in the front, nigga what's up?\nHop out, do my motherfuckin' stuff, nigga what's up?\nGirl I ain't rich, just a nigga on the come up\nGrindin' 'til the sun up, believe that\n\n[Hook: Allan Kingdom]\nI'm doin' what I want today (doin' what I want)\nI'm movin' how I want today\nI'm steady doin' what I want today (movin' how I want)\nAnd I been losin' but I won today\n\n[Verse 2: Boogie]\nI got to stop and see the signs, man a lot been on my mind\nAll this hurling from this vodka mixed with wine, uh\nTryna get a spot, I seen my mama get declined\nAnd then my chakras got aligned, niggas plottin' on my spine, oh shit\nOld backstabbin', all day hashtaggin'\nLazy don't suit me nigga, see it when I start slackin'\nI learned to see the bigger picture when they start flashing\nGot it depicted to the pixel, you just all captions\nOh shit, I feel enriched from my misfortune\nJust know that talkin' gotta chill if you bench-warming\nJust know the groupie getting blocked before she ever get to score\nNo you just a rebound, I only hit you when I'm bored\nYou only wit' me for the come up\nGot my nigga Curry in the front, nigga what's up?\nHop out, do my motherfuckin' stuff, nigga what's up?\nDrugs got a nigga moon walkin' 'til the sun up, believe that\n\n[Hook: Allan Kingdom]\nI'm doin' what I want today (doin' what I want)\nI'm movin' how I want today\nI'm steady doin' what I want today (movin' how I want)\nAnd I been losin' but I won today\n\n[Outro: Allan Kingdom]\nDoin' what I want, doin' what I want\nMovin' how I want, movin' how I want\nDoin' what I want, movin' how I want"}], "artist": "Denzel Curry"}