{"artist": "Kia Shine", "songs": [{"image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "title": "Stunna Frames", "year": null, "album": "Due Season", "lyrics": "[Intro]\nPut your stunna frames on, whoa\nPut your stunna-put your stunna-put your stunna frames on\nPut your stunna shades on, put your stunna shades on\nI-I-I wear my stunnglasses at night\n\n[Chorus: repeat 2X]\nPut your stunna frames on, whoa\nPut your stunna-put your stunna-put your stunna frames on\nPut your stunna shades on, put your stunna shades on\nI-I-I wear my stunnglasses at night\n\n[Kia Shine]\nPut your stunna frames on, so you can see what I'm sayin\nI got that ice on my teeth, you can see what I'm sayin\nI'm sayin - kinfolk, they call me Kinfolk Jones\nI feel so fly up in my frames, I done came up with a song\nI got them D.G., Louis V, Armani and the Gucci jones\nOh forgot the sticker on yo' lens? Naw, that's a super stone\nKinfolk, kinfolk, you know the Memphis boys crazy\n(Why you wearin shades at night~?) Respect my fresh and stop hatin\n\n[Chorus]\n\n[Kia Shine]\nCheck it, Polo horses on my shirt, Chanel's on my face\nRed monkeys on my ass, on my feet Bathing Apes\nBathing Apes? Ay, y'all gon' respect my fresh\nI'm a fly Memphis hustler, you shouldn't expect nuttin less\nSee my shirt match my car match my shoes match my lens\nDamn kinfolk! You done merked them folks again\nAgain when it come to clothes mayne I be killin it\nTrill talk, my frame game is ridiculous\n\n[Chorus]\n\n[Interlude: repeat 2X]\nNow do the motorcycle (AY!) do the motorcycle (AY!)\nPut your stunna shades on and do the motorcycle (AY!)\nAnd if you cain't dance (AY!) then do your two step (AY!)\nIf you cain't dance (AY!) then do your two step (AY!)\n\n[Jack Frost]\nI'm gettin money, I'm gettin paid\nWhen you see your boy Frost I got them frames on my face\nCause my future so bright I got to wear shades\nAnd my eyes prolly red from the kush and the haze\nI get buck with my shades on # buck with my shades on\nWalk like a pimp and grab my nuts with my shades on\nCartier, Valentino, even B&G's\nWhen it come to stunna shades niggas ain't seein me\n\n[Chorus]\n\n[Interlude]\n\n[Outro: repeat 2X]\nNow do the Memphis walk (AY!) do the Memphis walk (AY!)\nPut your stunna shades on and do the Memphis walk (AY!)\nAnd if you cain't dance (AY!) then do your two step (AY!)\nIf you cain't dance (AY!) then do your two step (AY!)"}]}