{"songs": [{"album": "1UP", "image": "https://images.genius.com/383147e9c1a11d9c30e30f67d8ab80c1.1000x1000x1.jpg", "year": "2019-01-23", "title": "Getcha Roll On", "lyrics": "[Pre-Chorus: T-Pain]\nHey, I know you waitin' on me, baby, can you hold on?\nJust make sure when I get there, you ain't got clothes on\n'Cause you gon' ride that dick to a slow song\nYou got me and I got you, now what can go wrong?\nAnd you keep tellin' all your friends about me\nAnd now they wanna get it in on the balcony\nWe goin' all night, girl, I'm talkin' so long\nI got that wake up for you, baby, make sure everybody in here...\n\n[Chorus: T-Pain]\nGetcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\nGetcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\nNow you keep tellin' all your friends about me\nAnd now they wanna get it in on the balcony\nSo getcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\n\n[Verse 1: T-Pain]\nHey, yeah, I got like four phones\nThe AC in the Mini Cooper blowin' snow cones\nI got like five bad chicks, don't wanna go home\nYeah, it's a vibe, it's a vibe, yeah, I'm so gone\n'Cause I've been puttin' in that work and now it's time to chill\nAnd my bitches came through with all kind of pills\nI told her, I get too high and then I'ma sext her\nAnd she was like a-woah, a-yeah, a-Dexter\nI be like, bitch, don't kill my vex, huh\nUnless you wanna get in that UberX\nAll I do is just sit back and count checks, uh\nBut I be losin' count, I'm on that Hennessy XO, blur, blur\nThe wrist full of ice (Yeah), the neck on freezer burner (Ooh)\nKeep on talkin' shit and I'ma have to get the burner (Ooh)\nBitch, keep lookin' at me, I'ma have to go and learn ya\nI get shit straight like a perm, bruh (Yeah, yeah)\n\n[Pre-Chorus: T-Pain]\nI know you waitin' on me, baby, can you hold on?\nJust make sure when I get there, you ain't got clothes on\n'Cause you gon' ride that dick to a slow song\nYou got me and I got you, now what can go wrong?\nAnd you keep tellin' all your friends about me\nAnd now they wanna get it in on the balcony\nWe goin' all night, girl, I'm talkin' so long\nI got that wake up for you, baby, make sure everybody in here...\n\n[Chorus: T-Pain]\nGetcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\nGetcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\nNow you keep tellin' all your friends about me\nAnd now they wanna get it in on the balcony\nSo getcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\n\n[Verse 2: Tory Lanez]\nI know this 1942, it got you so gone\nNah, this ain't a interview, ain't shit to prolong\nShe let me touchdown, I tell her go long\nI get to lickin', I be in it for the whole song\nShe take them pants off, Luther Vandross\nCome and get it, baby, do it with your hands off\nYou gon' get it like I put it in the hand-off\nGet to shootin' in that pussy like a standoff\nSuper lit, lit (Lit), she ain't average (She ain't average)\nHit a split on the dick, she a savage (She a savage)\nShe get on top of me and start doin' gymnastics\nShe clean as ever but I love when she get nasty\nMight even let her run right through this check\nWhen I'm with you, I'm flexin' on my ex\nThat's why I let you come on the road, might even fuck at the show\nI got too nasty with your girl, now you can't fuck her no more\n\n[Pre-Chorus: T-Pain]\nYeah, I know you waitin' on me, baby, can you hold on?\nJust make sure when I get there, you ain't got clothes on\n'Cause you gon' ride that dick to a slow song\nYou got me and I got you, now what can go wrong?\nAnd you keep tellin' all your friends about me\nAnd now they wanna get it in on the balcony\nWe goin' all night, girl, I'm talkin' so long\nI got that wake up for you, baby, make sure everybody in here...\n\n[Chorus: T-Pain]\nGetcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\nGetcha roll on, getcha roll on\nEverybody, everybody, getcha roll on\nNow you keep tellin' all your friends about me\nAnd now they wanna get it in on the balcony\nSo getcha roll on, getcha roll on\nEverybody, everybody, getcha roll on"}], "artist": "T-Pain"}