{"artist": "Vast Aire", "songs": [{"title": "Viewtiful Flow", "year": null, "lyrics": "Look mom no hands!\nLook mom no hands!\n\nI think I'm going to Disney World after this one\n\nI got the style that amazes\nToo many phrases\nYou think I'm weeded up, I'm on lasers\n\nHuh yeah Cannibal Ox yo!\n** You gets no love from me **\nThere's two things you should know\nI had a ill life so I gotta ill flow\nBut you already knew that\nLike the third movie of the Matrix was gonna be whack\nWell it ain't like I didn't care\nBut the Oracle said, \"spend your money elsewhere.\"\nWalk with my like one third of a rocks\nBut talk to me like on half of an ox\nWearin the same clothes In a vein cold\nPoppa was a rollin stone\nWherever he laid his hat it became his home\nMoms was coked up it became the poem (ouch)\nGive me two strikes and I'm gone with the wind\nI know piranha rap niggas that'd eat you thin\nAnd all I gotta say is when because..\n** You gets no love from me **\nYou can throw me out the window and I'll land on my feet\nIf she steppin with me then we keep it discreet\n** You gets no love from me **\nYou could toss me out the window and I'll land on my feet\nNigga\nShit.. I got the style that amazes\nToo many phrases\nYou think I'm weeded up, I'm on lasers\n\nYeah I know jiujitsu\nI'll hit you with the divine secrets of ya! ya!\nComing through with the rah rah\nBumpin cats while they rollin up they la la\nThis is that backyard boogie\nI'll be at the podium and niggas wanna chew me?\nI'll be at the cipher, nigga salute me\nI'm fly like Woodstock you crawl like Snoopy\nI been doing this since 10 years old\nAnd ever since then you wouldn't leave me alone\nTalk to the machine when I'm home on the bone\nCause she caught my first album and digs my cologne\nGive me two takes and I'm gone with the wind\nI know piranha rap niggas that'll eat you.. thin\nAnd all I gotta say is when because..\n** You gets no love from me **\nYou can throw me out the window and I'll land on my feet\nIf she steppin with me then we keep it discreet\n** You gets no love from me **\nYou could throw me out the window and I'll land on my feet nigga\n\nShit.. I got the style that amazes\nToo many phrases\nYou think I'm weeded up I'm on lasers\n\nOk, 28 grams in an ounce\nThat means... I can get my mom a new blouse\nAnd that means... I can get my girl a new house\nYou could die like a rat get trapped like a mouse\nOk there's 16 ounces in a pound\nSo that means.. You ain't gonna make it uptown\nAnd that means.. the Brooklyn boys'll bang you\nAnd hang you like the Klu Klux and leave 'em with no nuts\nI guess that's go fish\nI'm swimmin upstream you goin with the current\nThat's why I'm at peace in life and I do what I do\nAnd you do what's current\nShit, who broke the street to your radio?\nNow you coming out of your mouth\nBut I'm on the white faces just as soon as they pout\nAnd walk on water just as soon as they doubt nigga\nI'm here to change the level to boom\nIf you didn't sell records you ain't packin the room\nSo this means you should rhyme first\nUntil you pay your dues rap hurts\nGive me two takes and I'm gone with the wind\nI know piranha rap niggas that'll eat you thin\nAnd all I gotta say is when because..\n** You gets no love from me **\nYou could throw me out the window and I'll land on my feat\nIf she steppin with me then we keep it discreet\n** you gets no love from me **\nYou could throw me out the window and I'll land on my feat\n\nI got the style that amazes\nToo many phrases\nYou think I'm weeded up I'm on lasers\nAnd I'll land on my feet\n**You gets no love from me**\nI got the style that amazes\nToo many phrases\nYou think I'm weeded up I'm on lasers\n** You gets no love from me **", "album": "Look Mom... No Hands", "image": "https://images.genius.com/ec5e65a416584a208b3230e59ddbdd2f.600x600x1.jpg"}]}