{"songs": [{"year": null, "title": "Wild Cowboys", "image": "https://images.genius.com/f9892894da5ef46b99300e48b63438cd.1000x1000x1.jpg", "lyrics": "[Hook: 2x]\nWild cowboy, it's the wild cowboys\nWild cowboy, it's the wild cowboys\nWild cowboy, it's the wild cowboys\nWild cowboy, it's the wild cowboys\n\n[Sadat X]\nYeah, yeah, yeah, yeah\nAll of y'all out there might think that I'm strange\nBut the wild cowboy never lived on no range\nThe only prairie I seen was in the library\nAnd the last Indian I seen was headin' towards Cleveland\nY'all can believe in what y'all believe in\nBut stop the bullshittin' and deceivin'\nWhen the O.K. Corral bell rings for the winter\nI'mma flash back to '79 with Thelma drinkin' wine\nYou could see that it was me even with that small screen\nAl Green had a major string of hits\nAnd I wanna be like him, in the fact, that each one was a gem\nMy man Mashburn is killin' 'em down in Dallas\nI seen him one day after this bullshit show called Alice\nThe wild cowboy is hard to resist\nMake the play, get the assist, girlfriends hate genesis\nMe and Diamond D dug deep in the crates\nBeen rhymin' for high rates, I did wild show dates\nMy name is X yo my name is X, worth more weight than gold\nPrecious than your baby who's a year old\nStep to war without your armour, results in trauma\nMad drama, I'm the mad bomber\nYoung girls stay away cuz I'm dangerous (What)\nI'm a grown man, don't force my hand\nI'll judge off cuz I can (Cuz I can and I will..)\n\n[Hook: 2x]\n\n[Sadat X]\nHey I got a lot of family on both sides of the tracks\nSome is livin' positive while others is sellin' crack\nTwo sides to livin' yo step up and place your vote\nLike a 'murder that she wrote, hey that's my own quote\nNow should I clear myself for samples?\nOr make cats examples of my cowboy status Roy Rogers\nYou ever see Oliver Twist and his boostin' man Dodger?\nTaking wallets in the street, sign my name in the wet concrete\nA big X, so wide ya break ya fuckin' legs\nFor me to be dead-ass, have bread and water in a tall glass\nIs lunacy, madness, and I ain't on no badness\nBut in this point in time I can't take no backward steps (Uh-uh)\nI like crisp, green, money, and a lot of it\nIn big bills, cuz money right here make this whole world spin\nSay you went on a gin, 'cuz honey go home with strange men\nDance by the light of the silvery moon\nThen wake up in the mornin' with the hay in your eyes\nYour purple with that herpes bump, who want the rump?\nSome niggas joint got a lump from that late night hump\nWhat does it take to be a cowboy? Hold on down boy\nCuz I don't got no contracts in my pockets\nKids run up our amp like they stuck they hands in sockets\n\n[Hook: 2x]\n\n[Sadat X]\nI rule uptown to Nairu with an iron fist\nGrand Master, national title-est\nI string people out, plus I bring people out\nSo Heineken's across the board for all my men\nCheck it out, I'm verse for now but I'mma do this again\nRemember the wild cowboy's in the heart's of all men\nBut then again some kids ain't never gonna win\nAnd they'll be played in here\n\n[Hook]\n\n[Sadat X]\nYeah, Nubian style, so versatile\nWin by a mile, sack a pen and pile\nOne nineteen and one twenty\n8th Avenue, 7th Avenue\n1st Avenue, 2nd Avenue\n3rd Avenue all the way to Amsterdam\nAnd Broadway, and Edenwald\nAnd Castle Hill, money fill the bill\nAnd haha, ya don't stop\nTo my man Mark the Spark, ya don't stop\nTo my man Early Bird, ya don't stop...", "album": "Wild Cowboys"}], "artist": "Sadat X"}