{"songs": [{"title": "Church Clothes", "album": "Church Clothes", "year": "2012-05-10", "image": "https://images.genius.com/dac6127bb6a5a6cb9a45121946eb86ef.500x500x1.jpg", "lyrics": "[Intro]\nYeah, uh\nOne time for H-Town\nOne time for D-Town\nOne time for A-Town, M-Town\n\n[Verse]\nR.I.P. to Medgar Evers, R.I.P. to Dr. King\nI ain't tryna' hate on my own kind\nBut Al and Jesse don't speak for me\nI'm probably gon' catch some flack man\nBut I'm-a swallow this pill like Pacman\nSome of these folks won't tell the truth\nToo busy tryna get them racks man\nChurch tryna rob my paychecks\nChoir members probably having gay sex\nPastor manipulatin' hurtin' women\nI wonder which she's gon' slay next\nBookstore pimpin' them hope books\nLike God don't know how broke looks\nAnd telling me that I'm gon' reap a mil'\nIf I sow into these low crooks\nPlus I know ol' girl a freak\nAnd how she singin' a solo\nI walked in the church wit' a snapback\nAnd they tellin' me that that's a \"no-no\"?\nThat's backwards, and I lack words\nFor these actors called pastors\nAll these folks is hypocrites\nAnd that's why I ain't at church\nTruthfully I'm just doin' me\nAnd I don't wanna face no scrutiny\nAs long as the church keep wildin' out\nI can justify all my foolish deeds\nSmoking weed, pourin' up\nKeep that lean up in my cup\nMaybe I could change the world\nBut this porn on my laptop got me stuck\nYeah I know what's right from wrong\nBut that there ain't gon sell a song\nI rather sell my soul then save it\nIf that's what make my money long\nIt better not be no real God\nWith real hope, that heals hearts\nThat shows me that I ain't livin' up\nTo all the things that He put me here for\nIt better not be no real church\nReal saints, who pray hard\nAnd let me rock my snapback\nWith the 501's and the J's on\nIt better not be no real folk\nWho don't think that they better than you\nStraight or gay, drunk and high\nThey walk through the cold and weather wit' 'chu\n'Nah we don't wanna see that\nCause that might mean \"life change\"\nThat might mean I'm worth more than money, cars, sex, and pipe dreams\nBetter not be no real Jesus, real forgiveness, for hurt folks\nIf God gon' take me as I am I guess I already got on my church clothes"}], "artist": "Lecrae"}