{"artist": "King Los", "songs": [{"image": "https://images.genius.com/916a912809348b0dcc67ff098d44c1fa.500x500x1.jpg", "title": "Closer", "year": "2013-01-01", "album": "Welcome To Swaggsville", "lyrics": "[Intro]\nAye yo\nOn this joint right?\nThis joint all about getting closer to your dreams man\nShout out to my nigga Jordan man\nKinda inspired me to do this\nYou know what I'm saying?\nNigga that be checking for my music\nAnd and this for my fans man\nWelcome to Swaggsville baby\nI'mma go in a little bit for ya'll\nCheck\nUh\nUh\nYeah\nYo\n\n[Verse One: Los]\nI know I write a lot of raps about how my attires fly\nThough material items are not what I'm inspired by\nGot a keen intuition and vision provided by\nAll those times that I fell and still be willing to try to fly\nI'd be telling a lie if I ain't feeling expensive shit\nBut in compassion to this\nIt ain't nearly as intricate\nI'm convinced it nothing short of a miracle\nNothing more than what clearly you struggle for\nWhen you hear it you love it more\nAnd what you verbally express and your spirit's on one accord\nReleasing some of the pull of this lyrical tug-o-war\nAye\nEver heard the story about the genius and the dummy?\nGenius was getting smarter\nDummy was money\nThe dummy kept getting dumber\nThe genius was good at math\nHe calculated some numbers\nDivided his flow in half\nIf you ever hear me rapping like a dummy on the track\nJust know I'm too far from a dummy to not go and get this cash\nMan I do this shit when I'm bored just to stay busy\nTo keep my fans beefing with people about how great is he\nOhh before I forget\nBig shout out to Drake Drizzy\nBut not to jump off the topic\nMy nigga so stay with me\nI see myself as someone who can offer innovation\nSo Jordan,you're more than a fan to me\nYour like inspiration\nAnd I appreciate how you value the situation\nI hope you can use my music to get through that shit you facing\nI found my music the day that my father left me\nNot knowing that through my loss was the way that my God would bless me\nBut miracles happen daily\nBlessings is every second\nThough it seems like when it happens\nBlessings is never present\nThe tribulations in life is directing us to the question\nIf you paying attention\nIt's hidden in every lesson\nYou second guessing and hoping your notions is accurate\nWhen you feeling all alone like nobody will back your shit\nPack your shit\nGet out and grab some shit\nAnd go closer to your dreams\nMy nigga that's the shit"}]}