{"artist": "Beanie Sigel", "songs": [{"lyrics": "(feat. Snoop Dogg)\n\n(Chorus - Snoop Dogg)\nMa! I think it's safe to say\nYou ain't seen a playa lay this way\nOr playa game this way\nWit a attitude, like - and ya don't stop\n\nAficionado, so fashionable\nWit a confident swagger, international\nGame so tight the girls had to go\nAnd you don't stop!\n\n(Verse - Beanie Sigel)\nHah! sicka than your average\nMoney too long can't stash it\nIn the closet or the mattress\nPaper, stretch like elastic\nChecks from advances, the bank can't cash it\nSo the price for that, never ask it\nJust sign my name or pop plastic\nHating ass cops wanna harrass em\nSearching for a Glock in the pocket of his fashion\nBitches wit SP stitches on they asses\nAnd they left breast (yes!)\nLet's get dressed and toast to the occasion\nCops couldn't page em, flow so amazing, hot like cajun\nYou fucking wit the champ\nPop corks on champ' like I just took the chip\nNigga took the stand when he coulda took the 5th\nYeah eat a dick wit AIDs on the tip, keep my name off ya lips\nNot guilty!\n\n(Chorus)\n\n(Verse - Beanie Sigel)\nI said I'm sicka than your average\nKeep three shooters like the Mavericks\nShort to the point like Nash is, fucking wit a savage\nNiggas press they luck, get bucked like ashes\nThree piece suits, linen fabrics\nThree quarter croc, sharper than a pastor\nB Sig bring the light to the masses\nOf these rap bastards, who gives street passes\nOne shooting can lead to three caskets\nJump suits, state boots, at least three stabbings\nYou softer than a Reebok Classic\nFolding under pressure when confronted by them badges\nI was taught stay low and keep blasting\nPo only know questions that was answered\nKeep a number on the high price lawyer\nIt's five ways now days, everybody saw ya\n\n(Chorus)\n\n(Bridge - repeat 2x)\n(SD) Now let's toast to the man, that when he get out\nThat he gon do them thangs that he rap about\nA true playa Pha-real (Pharrell)\n(BS) Haters stay out my face\nAnd know that thing still by my waist\n\n(Verse - Beanie Sigel)\nOnce again I'm sicker then 'em all\nNiggas see C's start shitting in they drawers\nWhen I kick in the door, stop the blood clot crying\nWipe the piss off the floor\nThe ape is back, my gate is cracked\nMy jumpsuit and my cuffs is off\nYeah I'm back on them bricks\nRaise your cups and raise your glass\nAnd let's toast to the boy B Mack, yeah I'm back in the mix!\n\n(Chorus)", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "Don’t Stop (radio)", "album": null}]}