{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Beanie Sigel]\nOnce she grin, I'm in, game begin\nMan I met this bitch one time\nI mean man this chick so fine\nI just had to fuck this bitch one time\nI caught her at the mall goin shoppin\nShorty had six bags, strugglin and still coppin\nCute face, slim waist, body proper\nHair fell short to her shoulders, I had to stop her\nShheeit, I had to add that to the roster\nAnd me leavin without that there was not a option\nExcuse me miss, please take no offense\nBut I'm shoppin for a ladyfriend about your size\nI saw somethin that could be a 4, if you could try that on\nShit, I could peep the fit before I buy it for her\nShe smiled, and tried it on with no problem\nStepped out lookin like The Next Top Model\nDAMN! I told the salesclerk to give me two\nAnd told ma for all your work, this one for you\nYou keep it~! That'll be our little secret\nNow peep it, to make this long story shorter\nI ain't get shorty name 'til the next morning\n\nOnce she grin, I'm in, game begin...\nOnce she grin, I'm in, game begin...\n\n[Beanie Sigel]\nOnce she grin, I'm in, game begin\nMan you know that chick that time\nI said I had to stick that time\nI fucked the bitch about six times\nNow she on my phone every hour\nCussin out her man, talkin 'bout he a coward\nBitch please, she said that I'm all that she need\nIndeed, I showed her that I was built for speed\nI'm heavy, somethin like a '55 Chevy\nAnd they don't make my class no more, I'm quite sure\nI'm somethin she never had before, I'm that boy\nCause once they grin, I'm in, game begin!\nY'all dudes spit that same lame to them\nPlease~! You niggas ain't nothin like Sig'\nMan I run through these chickens like fresh white tees\nKeep 'em in check like fresh Nikes\nAnd once again, when they grin, I run 'em in\n\nOnce they grin, I'm in, game begin - uhh!\nOnce they grin, I'm in, game begin - uhh!\nSoon as he buy that wine I just creep up from behind\nOnce they grin, I'm in, game begin\n\n[Beanie Sigel]\nI'm the master, I'm somethin like a pussy conniseur\nFaggot! You somethin like a pussy kind of whore\nChit-chattin at bitches, yip-yappin with niggas\nAbout this and that, how your chips be stacked\nI keep a bitch on her BACK! Put her face in the pillow\nYou give a bitch all your TRAP! Keep your face in the middle\nOf her puss, while her mouth full of Cupids\nYou useless! I abuse 'em then I lose 'em\nI'm +Ruthless+, but nothin like Eazy\nI keep a pocket full of Magnums, believe me\nI keep these whores chasin\nShort money, long conversation, they gets nathan\nYou know the rules, a whore gets none\nHard dick and bubblegum\nAnd I just chewed my last stick is where I'm comin from\n\nOnce they grin, I'm in, game begin - uhh!\nOnce they grin, I'm in, game begin - uhh!\nSoon as he buy that wine I just creep up from behind\nOnce they grin, I'm in, game begin", "image": "https://images.genius.com/356ca6b0db6d8d8b7be50568bdfb53c0.700x695x1.jpg", "year": null, "title": "I’m In", "album": "The Solution"}]}