{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": "2007-08-21", "title": "Go With Us", "lyrics": "[Talib Kweli]\nIn your eardrum so furious\nIt ain't a game, it ain't a joke, it's so serious\nThe best flow period, let's go!\n(Klack-klack-klack-klack-klack-klack-klack-klack-klack-klack)\nYo, the year of the Blacksmith\nIt ain't defined by any calender\nJust thought I'd remind all you challengers, uhh\n(Klack-klack-klack-klack-klack-klack-klack-klack-klack-klack)\nC'mon, Talib Kweli, Strong Arm Steady (Blacksmith)\n\nYeah, when I jump in the stu' with beautiful rap staff\nYou could bump in yo' hoopty, bump in yo' Cadillac\nBlacksmith, S.A.S., real rap that\nPeople just be seein the surface, they can't get past that\nPhil Da Ag' smoke in your stash, Mitchy like klack-klack\nKrondon got crack rap, I got your back back\nHomie swing you better +duck+ like Aflac\nLames just, stay in your lane, the flow is HazMat\n\n[Phil Da Agony]\nYeah, we back for the '07, say goodbye to this '06 shit\nYeah we here for the championship\nAnd that's exactly what we came to get\nYou know the name of this, organization that made you famous\nIt's the Strong Arm, with the long arm to throw the bomb on\nThe drop of the dime; we at the top of the line\nPlus we on the incline, the rhymes be finer than wine\nDesign them in the mind, they shine like diamonds\nFresh out the coal mine, young soul, old mind\nI'ma hold mine, Steady spittin cold lines\nSharpen it up, backwoods sparkin it up\nThese niggas act like, what I rap like in the clutch\nI mastered the dutch, Dizzle tell 'em to duck\nHitman for hire, Blacksmith put it up\nCourtesy of Kweli, you got a problem with me\nPhil Da Agony, Strong Arm Steady!\n\n[Chorus: Talib Kweli]\nWe 'bout to open up, we 'bout to sew it up\nWe so focused bruh, go on and throw it up\nThe joint is broken up, we 'bout to roll it up\nWe 'bout to smoke it up, that's why they wanna go with us\nWho wanna go with us? She wanna go with us\nShe wanna go with us, they wana go with us\nSo let's gooo!\n\n[Krondon]\nFrom L.A. to B.K., Brooklyn that is\nOn the black hand side, Strong Arm Steady\n\n[Mitchy Slick]\nBlacksmith and we hear somethin\nNext thing you know, we was on the road dime humpin\nEarrings full of O'Shea's\nBig ass chain all in the way like Ghostface\nOf course all the hoes wanna go\nBaby like Mitchy, hella ghetto but he heavy peddles Lambo's\nAnd gettin snow cheap\nHad a nigga out missin studio sessions, haulin from the police\nBut now I'm focused, and where my folks is\nAnd when we together we mob like locusts\nCrooks that hit licks that got crooks who work in big ass granny kitchens\nThat we use to cook chickens\nAnd not the ones that's finger lickin\nThe ones that'll have a Cali nigga ticklin switches\nMy guns'll make a Northern Cali run\nHow you think the little homie got kush zips for four hun'?\n\n[Chorus]\n\n[Krondon]\nAy don't think we changed our style\nWe just got more change for our style\nStrong Arm Steady!\n\nChronic, country as cornbread, this L.A. life could be\nFunky as George Clinton's colorful dreads, prestigious\nI'm bred from a different cloth\nThe walk and talk soft could cost your head\nThe difference you the minor we the major\nNo long life to be lived for the hater or the traitor\nEight out of nine of my niggas doin time for advancin\nHandlin illegal finances\nThis the family reunion, mixed with the holy communion\nYou'll never win, you're too busy consumin\nKweli, let's start up a union\nProtect the real niggas from the fakes so we ain't gotta do 'em\nYeah, this the church right across from the liquor sto'\nBeen on that hip-hop shit since Biz Mark' picked his nose\nUnder the mattress stack big as a fat chick\nSteady is the gang and the label is Blacksmith, bitch!\n\n[Chorus]\n\n\"Ohh!\" [echoes]"}], "artist": "Talib Kweli"}