{"songs": [{"year": null, "lyrics": "[Chorus: 100s]\nPower\nPower\nPower\nMoney, cars, clothes, hoes\nFuck I need a friend for?\nPower\nPower\nPower\nLivin' life reckless\n'Cause a nigga rather be feared than respected\n\n[Verse 1: 100s]\nPower, nigga, yeah, it's conquer time\nBury me in all gold with my concubines\nIn the center of a military convoy, clear the streets\nYeah, this nigga wanted power since he was a small boy\nEverything I'm buyin', I can buy it five times\nIn a fortress on a island, 'cause the power's all mine\nMy mama called, she said, \"Never shit in yo bed\nWhy you never call? It's 'cause the power got to yo head\"\nSaid, \"I gotta call you back\", niggas ain't hearin' that\nOnce you tasted power, then there's really no goin' back\nGot a down bitch, hot bod, that's how I'm feelin'\nSince I got the power, I don't give a fuck about her feelings\nShe said a nigga changed, and I say\n\"Bitch, just stop complaining\n'Cause you wasn't sayin' shit\nWhen we vacationed in the Caymans\"\nShe said that I disgust her, and she threw my ring back at me\nI just sparked a hunnid, poured up, and then laughed at her\n\n[Chorus: 100s]\nPower\nPower\nPower\nMoney, cars, clothes, hoes\nFuck I need a friend for?\nPower\nPower\nPower\nLivin' life reckless\n'Cause a nigga rather be feared than respected\n\n[Verse 2: 100s]\nThreesome in a glass shower, foamin' off the past hour\nDoin' powder, then I hit the club to feel mo' power\nBottle in my hand, shirt off, yelling \"west side\"\nFeelin' like a god, bitch, feelin' like I can't die\nUnstable, feelin' incomplete without the money\nFuck the world, they just tryin' to take the power from me\nMy right hand tellin' me slow down please\nThinkin' I don't know he fucked my bitch while I was overseas\nCancel that nigga, cancel that bitch\nNever played you, nigga, I fuckin' made you, nigga\nBut I ain't really trippin', man, I treat it like a misdemeanor\nNiggas say they lost me once I let the power get between us\n25, Bay power, never takin' nights off\nWatch some niggas pullin' up behind me with the lights off\nFuckin' shots fired, it's the end for me\nShit, I guess the power was the end of me\n\n[Verse 3: J. Folks]\nSee, I come from the front, hit his neck with the pump\nPut his head on the roof, and his body in the trunk\nWent straight for his sixes, then rinsed the boss off\nThrew them big bitches in my 'Lac, then I rode off\nNigga, I'm a mac, every bitch know I get payed\nI got the dubs on my back, like MJ\nBack in his day, yes, I'm back with the K\nKeep hating till your legs and your waste get separated\nThat's when you gon' really hate me, that was just an illustration\nComin' at me indirect, nigga, what you in for, death?\nNigga, and you don't want it with the blood hounds\nEast bound town nigga with the long pounds\nLong round, put your mind on the ground\nFor a really long time, on my side of the town\nAnd it's gonna be awhile before the rollers arrive\nBut he gon' give me his attire when I pull out the five, nigga\n\n[Outro: 100s]\nPower", "album": "Ice Cold Perm", "title": "Power", "image": "https://images.genius.com/98d3e3369facf82ee69688c5e541f1f3.1000x1000x1.jpg"}], "artist": "100s"}