{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Consider Me Dead", "album": "The Initiation", "lyrics": "[X-Raided]\nI had a heart full of pride and had to set it aside\nAs I was nailed to the crucifix and stabbed in my side\nImpaled, toothpicks jabbed in my eyes\nNiggas cry but the truth is they're glad that I died\nInhale, conversatin' with Satan himself\nStarin' in the mirror lately got him hatin' hisself\nInhale, green smoke like it's oxygen\nRise up out the grave, gotta get my props again\nI pray for the day that I could say I got revenge\nGot a vendetta cuz I been hated by lots of men\nMy rage, just way too strong to contain\nI'm sinkin', but I'm way too strong to complain\nI'm cheatin' the reaper every time he come for me\nWhen I die, will you nigga cry, ride, and die for me?\nI'm creepin', prepared to take a breath without thinkin'\nOf consequences, of starin' in the face of death without blinkin'\nThe Unforgiven X-Raided, take my name in vain!\nNefarious nigga, feel the need to explain the game\nTo various niggas that got it twisted up like cornrows\nI'm sick of this bitch shit, I'm comin' for you mark hoes\n\nChorus (X-Raided + Kingpen):\n\n(X-Raided) Niggas I used to fuck with\n(Kingpen) Consider Me Dead\n(X-Raided) Yeah all you niggas can suck dick\n(Kingpen) Consider Me Dead\n(X-Raided) All them hoes I used to mack to...\n(Kingpen) Consider Me Dead\n(X-Raided) BITCH get a rose over the tattoo and...\n(Kingpen) Consider Me Dead\n\n(2x)\n\n[X-Raided]\nNigga I can't stop now, came too far to turn back\nFlames burnin' in my brain, my heart done turned black\nI opened my mouth to speak and I don't recognize my own voice\nAnd when I close my eyes to sleep, dream of wildin' with my homeboys\nAnd wake up, the image lingers\nWhen he throw up the set it make me wanna break up the niggas fingers\nBlow up the set twice a day, fake nigga I respect not\nLoad up the Tec and spray your life in one day nigga\nI detect cops and you look like a bitch\nYou shook like a nigga that done did somethin' wrong\nFalse form ass nigga\nGet on and blast nigga\nDid harm to the last nigga speakin' on my name\nAnd I got these East Coast muthafuckas sleepin' on my game\nI sleep even though my brain got me ready to seek and destroy\nWhat?  You speakin' on my joy?  You speakin' on my pain\nAnd it's been seekin' out my brain\nThrough this pen to this paper to this track\nTo the DAT and in your ears, nigga for years\nYeah....\n\nChorus\n\n[X-Raided]\nWhen I die don't come visit me at my grave\nI'll come up out the casket\nLike \"Night of the Living Dead\" to get that ass bitch\nRide 'til a nigga dead like Killa Tay on Crip\nWe got to admit you deserve respect but on Crip\nYou niggas gay Cuz we bloods like Dracula\nWe'll turn a nigga round me\nYou weak thugs will have hurtful necks around me\nWe jump niggas like strangulations\nAnd got a gang of patience when it comes to killin' lames\nLayin', waitin' all night for an opportunity to spill your brains\nEither you or me, gotta be one, holla at 'em\nAnd I'm comrades with clouds so get decapitated or bombed in crowds\nAnd never capture Raided I mob around\nTurn your skin black and blue and orange by the time it's found\nTied and bound and tarred down\nTwo-faced, many faces better kept\nBefore we chop you up in suitcases\nAnd disappear without any traces\nAnd we all got game!\nPaid with flames, all got game!\nKnock y'all brain, Mad Man we all got fangs, bitch!\n\nChorus"}], "artist": "X-Raided"}