{"artist": "Andy Mineo", "songs": [{"title": "All We Got", "album": "Never Land", "year": "2014-01-28", "image": "https://images.genius.com/1ef8116b131220e1461999903c0b4fdb.540x540x1.jpg", "lyrics": "[Verse 1: Andy Mineo]\nMore of the same, I'm cornered again\nBack and forth, forth and back with the names\nRecordin' pain\nYou played back when them insecurities rang\nAnd I ain't even gotta answer, but the question remain\nWhy everything inside of my brain\nNot applied, it's insane\nBut, yo, I'm tryna change\nDecided to ditch my strength and rely on the King\nMama said at the end of yourself is where it begin\nSo I'm totally freed, embracin' my limitations\nWishin' my heart move at the same pace as this information\nI pray this ain't strange what I'm sayin'\nBut I'm tryna find a back door to your imagination\nI'm here, let me in to be clear\nI'm bringin' somethin' make you wonder who's the one that gave the gifts that I bear\nWhat happen next\nI think about it, do you ever?\nI can give you an answer but a question do you better like..\n\n\n[Hook: Dimitri McDowell]\nHave you ever loved the treasures of this world\nWhen it's insanity?\nCause it's killin' me\nHave you ever tried to be something you're not?\nCause I've been searching for security\nOh, na-na-na\nHis love is all we got\n\n[Verse 2: Andy Mineo]\nI'm tryna go from selfish to selfless\nNot just thinkin' 'bout my needs but someone else's\nAll these pretty women in my city isn't helpin'\nNo matter how hot that body, one day it's meltin', yo\nA good lie got a little truth in it\nSo I'm tryna decide what's real and embellished\nThe money comin' in so everybody's good fellas\nI don't trust em, no phone numbers\nTell em e-mail us\nCan you tell?\nI've been affected by this industry\nNumbers and CD sales, what the heck has gotten into me?\nI had to ask myself, what's a win for me?\nDo I worship God or what other people think of me?\nSoberin' thoughts depletin' my hot air\nThinkin' 'bout this world when I'm not here\nWill I treasure money or the moments that we share?\nIt's funny how, seein' death can make life so clear\nI got a girlfriend, but so long it feels weird\nIt's not like \"Yo, can I get to know you?\"\nMore like, \"Meet my parents\"\nI think I'm scared cause it's serious\nAnd every time I tell somebody they tryna to marry us\nPump the brakes\nI think I love her, but them words ain't been said still\nCause last time I did things didn't end well\nPlus, plus my past was hashtag been trill\nIt's time to grow up, you know what?\nI ain't trying to be another bum that's just scared of committin'\nTake everything from these women then go missin'\nI gotta kill the wicked part of my heart that keeps pimpin'\nIf I ain't got the strength then I know where to get it\nYou live different when you know you've been forgiven\nHis love is forever, don't you ever forget it\nYou live different when you know you've been forgiven\nHis love is forever, don't you ever forget it uh\n\n[Hook: Dimitri McDowell]\nHave you ever loved the treasures of this world\nWhen it's insanity?\nOh, na-na\nCause it's killin' me\nHave you ever tried to be something you're not?\nCause I've been searching for security\nOh, na-na-na\nHis love is all we got\n\n[Bridge: Dimitri McDowell]\nPlease speak your mind, I'm wide open\nLove you for you girl, let it be hard girl\nLay it on the line, tell me all your questions\nI promise I won't judge you, try not to judge me\n\n[Hook: Dimitri McDowell]\nHave you ever loved the treasures of this world (loved the)\nWhen it's insanity? (When)\n(Oh, na-na-na)\nCause it's killin' me\nHave you ever tried to be something you're not?\nCause I've been searching for security\nOh, na-na-na (Oh, na-na-na)\nHis love is all we got"}]}