{"artist": "Cam’ron", "songs": [{"title": "Girls", "album": "Purple Haze", "year": "2004-12-07", "image": "https://images.genius.com/b6f4f4bab1804fbaae0c7dd7e0b294d6.1000x1000x1.jpg", "lyrics": "[Intro: Cam'ron]\nKilla!!\nDipset, Charlemagne\nJim Jones, Santana, Freekey\nLet's go!\nWhat they want sing\n\n[Chorus: Mona Lisa]\nGirls just wanna have fun\n(Oh girls)\nGirls just wanna have fun\n(Girls just wanna have)\n\n[Verse 1: Cam'ron]\nKilla!\nDamn chump passed, he a dumb ass\nCall J.R. (why?), get a fun pass\nYeah she come fast, so she leave quicker\n'Cause she cum faster, skeet skeet nigga\nWe be with her, me, Jim, Zeek hit her\nThen she's a flea flicker, Don Chi Chi with her\nP.E. with her, wee wee, easy, ol' me, OG little me lick her\nSo she need liquor, never seen sicker\nNigga, if rap was head, she could be Twista (fast)\nHad her alley to alley, Hawaii and Maui, and Cali the Valley\nUp in white Lotus, dog you might notice\nThat you type bogus, me I'm quite focused\nAnd hope is hopeless, disappear in the air, hocus pocus\n(Killa, Killa)\n\n[Chorus: Mona Lisa]\nGirls just wanna have fun\n(Oh girls)\nGirls just wanna have fun\n(Girls just wanna have)\n\n[Verse 2: Cam'ron]\nGoddamn he stuck like stucco\nCut low, slut no, here he come uh oh\nMan see what the fighting do, that's why I'm piping boo\nAin't even liking you, I'm exciting true\nJust right I do, heels high, wheels fly, real fly Nikes are new (Air 1's)\nAnd a righteous view, from night to new, day, hey play\nCatch a flight for two (first class!)\nAnd you thought you a baller, a baller?\nHawker, dog you a stalker! (you a stalker)\nUpset cause what she wear showing (that's see through)\nAww man you ain't in gear for knowing\nAsk questions in fear of hoein (what's that?)\nWho you with? Where you at?\nWhere you going? (where you going?)\nWhere you going, I'm flowing, she blowing\nSky high like a Boeing, got pies like it snowing (slinging!)\n\n[Chorus: Mona Lisa]\nGirls just wanna have fun\n(Oh girls)\nGirls just wanna have fun\n(Girls just wanna have)\n\n[Verse 3: Cam'ron]\nKilla, uhh\nFemales better twirl on yours, better curl on yours\n'Cause I swirl on shores (then what)\nCome back to a pearl golf course (who you)\nI'm Kurupt, 'cause \"Girls All Pause\"\nAnd the world is yours, honey sip sizzurp earl of course\nAnd you know I'm in the building mister\nWith the Olsen twins, or the Hilton sisters\nAnd I haul 'em in to the Hilton mister\nI milked them, I killed them, you quilt her, you missed her\nYou held her, you kissed her\nYou felt all the blisters, melt on your whiskers\n\n[Chorus: Mona Lisa]\nGirls just wanna have fun\n(Oh girls)\nGirls just wanna have fun\n(Girls just wanna have)\nGirls just wanna have fun\n(Oh girls)\nGirls just wanna have fun\n(Girls just wanna have)"}]}