{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "Redemption Songs", "image": "https://images.genius.com/459c7b64c165fbc76e02360f338fe60b.600x600x1.jpg", "lyrics": "Hello\nFrom the top of the world, wishing you were here\nSo you could see things from my P.O.V\nIt's a long way down, but I never look back\nThough it's over now, know it's life or death\nLife being: to reach my goals, death being to die\nI wish poverty on no man and struggle on no woman\nGone are the days of old, we've crossed the threshold into a new era\nOf prosperity & peace\nIs there heaven and hell? You will find out getting in my way\nBut for those who agree, please celebrate with us, as we proceed to succeed\n\nI take non- believers and change they whole view\nThey spend a little time, they singing a new tune\nI get it forever, P foreverly fresh\nName a rapper more sinister than Perignon is\nI pop pain, AK's, and currency bands\nMy skid mark's on fire I peel off so fast\nThis is deeper than rap, Infamous is a brand- a lifestyle, not a movement\nOur bullets go 'blam'\nLook I'm a seasoned vet marinaded in the trash on corners of the slum- dirty New York\nI am with the cleanest swag, and the meanest V\nIf your want the Feds want then I'm what the Feds need\n\nThese are new age rules, new age moves\nOnly thing I can't fuck with is these new age dudes\nBut it's the world and the people that I'm subject to\nI get this digital money and stay inside of my groove\nMaking new age rules, new age moves\nOnly thing I can't fuck with these new age dudes\nBut it's the world and the people that I'm subject to\nI get this digital money and stay inside of my groove\n\nAs a kid they used to call me 'little big time'\nThat was then, and this now\nNow they call me 'King Rhyme'\nGlobally I stand, Infamous to eternity\nI infinitely do this shit\nI cut that fucking tat off your head if you ever cross me\n\nNiggas screaming mutiny?\nI toss niggas off to the sharks\nH.N.I.C. 3- Redemption songs\nThis is how God intended it\nRed Carpet shit, Black ties and new black dresses\nDon't let the camera flash blind you\nR.S.V.P. all grown up now\nThere is no excuse\nNothing can stop the power of God\nThis is God's plan\nThis is the way God intended it", "year": null}]}