{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "Air Jordans", "year": null, "album": null, "lyrics": "[Hook]\nHer legs spread on my tounge, Air Jordans\nStand in line for that pussy, Air Jordans\nWear that ass out, Air Jordans\nThese the flyest bitches out, Air Jordans\nI'm laced up, got a couple bad bitches no make up\nIn the club posted drinking all the Ace up\nShe just want the D so tell her I said come and face up\nAir Jordans , Air Jordans\nGot a couple from Japan too , rare Jordans\n\n[Verse 1:]\nI'm on my bullshit like how many hoes could i do on a day , whoo\nMight take a couple to D me cuz bitch i be shooting these J's\nFucking with my J's on , i was taught to play a way\nIf i mack her now no imma back her down then i fade away , nigga where my 808\n??? up in this bedroom , you know niggas ain't really with talking\nSoon as you walk in i want you to throw it up and imma catch it just like i'm Rodman\nAwesome imma cause a a arson in your apartment\nWe could put some 1 on 1 and see if you can guard me\nTake off all your garments, I'm gone, then I'm gone, then I'm gone, then I'm on and I'm back in the morning\nWith the heat tho\nYour nigga gonna hit like Shaq at the free throw\nI Deebo that pussy, do circles\nI zero that pussy while she throw a zero that pussy\nMy ego so big I jump in it and T.O. that pussy\nNot him but like time out I Timeout, I T.O. that pussy\nKing\n\n[Hook]\n\n[Verse 2]\nShe been walkin different ever since\nI put this inside her pussy but ain't leave no evidence\nYou need CSI to catch me bitch\nI wanted a beef, so she gave me a piece\nI threw up peace signs from my G6\n(L.A. LEAKERS)\nHer ass move, yeah it move like she tryna do a pole trick\nI told a bitch hold this, that's the whole dick\nGot a whole different way of doing shit\nI'm super rich\nYou should get the cutest\nChick you know and tell her come through\nWe could kick it like Cung Le doin kung fu\nYou should get comfortable on my bed\nOne two, One two, One Two\nYou and I got a nigga runnin back and forth like I'm doing suicides\nAnd you screamin oo and ahh\nWhile I'm watchin you move side to side\nAs you ri-da-da-da-da-da\nLike Pac on a nigga\nClimb on top of a nigga\nLike a six four bustin on three wheels, with them shocks on em nigga\nThrow that box on a nigga like a nigga ???\n\n[Hook]"}]}