{"songs": [{"title": "G Walk", "album": "Crunk Rock", "year": "2010-06-08", "image": "https://images.genius.com/0c51cd98de0fa1c7e422eecdda04aaf3.1000x1000x1.jpg", "lyrics": "[Intro: Soulja Boy & Lil Jon]\nLil Jon!\nBME Click\nSoulja Boy Tell 'Em\nCan we crank these niggas up, boy?\nLet's crank these niggas up, man! HAHAHAHAHA\nSOD Money Gang\nLame niggas get the fuck outta my way when I step in the club on this one right here nigga\nFUCK NIGGA!\nShawty Redd!\n\n[Verse 1: Lil Jon]\nLet me see you throw your motherfuckin' sets up (in the sky)\nThrow your motherfucking rags out (wave em' high)\nPussy nigga keep on eying me (you wanna die?)\nI got shawties, them in here too (they gonna ride)\nWe too crunk to be tryna dance (I got that thang)\nAnd it's right here on my side (don't make me bang)\nYou must not know where the fuck we from (pick a side)\nEastside to the West nigga (and we don't hide)\n\n[Verse 2: Soulja Boy]\nG walkin' through the club\nHaters gettin' mugs\nI gave your bitch a hug\nAnd she got wetter than a tub\nI'm hot nigga (I'm hot nigga)\nG walkin' on yo block nigga\n80 stacks spent, tell my jeweler make my watch bigger\nSoulja Boy blowin' up like a fuckin' bomb\nAll I need is ten minutes in a club with Lil Jon\nGot my goons in this bitch, so shawty don't test yo luck\nChairs flyin' in the club, quack, quack, bitch you better duck\n\n[Hook: Soulja Boy & Lil Jon; Both]\nSwag to the left (left), swag to the right (right)\nSoulja Boy and Lil Jon gettin' crunk all night\nG walkin' with the realest with some pants on\nNow everybody in the club, turn your motherfuckin' swag on\nG walk, (walk) do it! (Walk, G walk nigga, walk, walk, gangsta walk nigga)\nG walk, (walk) do it! (Walk, G walk nigga, walk, walk, gangsta walk nigga)\n\n[Verse 3: Soulja Boy]\nI'm not playin' boy, I'm not playin' ho\nFuck swag, bitch I got mojo\nNo homo, I got them thangs cocked\n25 bands all wrapped in one not\nSoulja Boy shawty, left arm, right arm shawty\n27 tattoos shawty\nWalk inside the party\nPolo on my body\nG walkin', all my goons get retarded (look)\n\n[Verse 4: Lil Jon]\nI don't give a fuck\nYeah, that's what's up\nThink you too tough?\nYou get touched up\nI sent a ho on ya, you get sucked up\nShe let them goons in, that's how you've fucked up\nBut it don't even matter, fuck that chitter-chatter\nI'm in the club with it, I make them niggas stutter\nI shake them bottles up, we let that liquor splatter\nCause I'm a crunk nigga, I ain't no fuckin' rapper\n\n[Hook: Soulja Boy & Lil Jon; Both]\nSwag to the left (left), swag to the right (right)\nSoulja Boy and Lil Jon gettin' crunk all night\nG walkin' with the realest with some pants on\nNow everybody in the club, turn your motherfuckin' swag on\nG walk, (walk) do it! (Walk, G walk nigga, walk, walk, gangsta walk nigga)\nG walk, (walk) do it! (Walk, G walk nigga, walk, walk, gangsta walk nigga)\n\n[Outro: Lil Jon]\nHey, hey, hey, hey\nHey, hey, hey, hey\nHey, hey, hey, hey\nHey, hey, hey, hey\nHey, hey, hey, hey\nHey, hey, hey, hey\nHey, hey, hey, hey\nHey, hey, hey, hey"}], "artist": "Lil Jon"}