{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Missão", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "Não vou mentir, o meu lugar é no trono\nNão vou dormir, eu sei sonhar sem sono\nNiggas vão cair, já vesti o quimono\nRasga as tuas folhas tropa, chegou o outono\nPtt bota o jacket niggaaah q'eu so cold pa caralho\nEu mando bolota e jack na fita, o som bate pa caralho\nEu canto rap que mete na vida uma noção do caralho\nMas se a miuda é atrevida dou-lhe lição co caralho\nMa nigga, puta da minha liiife, dá-me voltas ao estomago\nE outra puta na minha liiife quer saber onde estou mano\nBitch don't kill my vibe é a puta do tom mano\nPor isso vou deixar andar até colar o piston mano\nSmp num zig zag, deus escreve e taga em mim\nTenho a doença do rap, um sindrome de mc\nPtt puto pega leve, sou mto heavy pa ti\nJá tou co cocuruto no tecto, nigga pass me the weed\n\nPass me the weed\nAhahahahaha\nPass me the weed\nAhahahahaha\nPass me the weed\nAhahahahaha\nAhahahahaha\nAhahahahaha\nPass me the weed\nNigga, pass me the weed\nI said: pass me the weed\nAh\n\nEu tou vidrado cos olhos vidrados no espelho fixados, coitado de mim\nSou depravado, disso sou culpado, imagino-a de lado, cos lábios pa mim\nChupo um bocado e co dedo molhado vou po-la num estado que não quer o fim\nTou preparado, sou bem-educado, senhoras primeiro e o homem no fim\nSe tas chocado, boy tas enganado e então na verdade não curtes pussy\nNao fiques chateado, podes dar o rabo q'a tua namorada vem para mim\nNa tua morada, ela vem-se para mim\nSou doutorado, the pussy m.d\nTudo tratado, mais q'assegurado\nTou mais concentrado que o futre na qui'\nA kiki disse isso à fifi, a fifi disse isso à mimi..\nAi mami! problemas co papi e agora a missão cai me a mim\nProf daddy, tacadas sem caddy, ela perde-se como a maddie\nÉ que ela quer vir brincar comigo aos medi-cos, sou cusco, no escuro procuro cu\nImaturo, sou um puto puro, mas juro por tudo que eu nao sou brusco\nEu curto de curto-circuito mas nao corto o circuito, o intuito é partir muito!\nO teu corpo é um mapa, eu no coito sou um gps\n\n\n\n\nMas eu nao curto estrada, faço o caminho que m'apetece\nYes, irás a caminho do everest\nCongrats! «you're now fuckin with the best»!\n\nPuta da minha life\nPuta da minha life\nPuta da minha life, dá-me voltas ao estômago!\nEu disse:\nPuta da minha life\nPuta da minha life\nPuta da minha life, dá-me voltas ao estômago!\nYo\nPuta da minha life!\nPuta da minha life!\nPuta da minha life, dá-me voltas ao estômago!\nEu disse:\nPuta da minha life\nPuta da minha life\nPuta, puta, puta, puta da minha life!\n\n\"The healthy human mind doesn't wake up in the morning thinking this is its last day on Earth\nBut I think that's a luxury. Not a curse\nTo know you're close to the end is a kind of freedom\nGood time to take...inventory. Outgunned. Outnumbered. Out of our minds\nOn a suicide mission\nBut the sand and the rocks here, stained with thousands of years of warfare...\nThey will remember us. For this\nBecause out of all our vast array of nightmares, this is the one we choose for ourselves\nWe go forward like a breath exhaled from the Earth. With vigor in our hearts and one goal in sight: We. Will. Kill him.\"", "year": "2013-11-02"}]}