{"songs": [{"album": "Paperwork: The Motion Picture", "image": "https://images.genius.com/0aedeee6f38d44bf87bbee70cb36cca3.640x640x1.jpg", "year": "2014-10-21", "title": "G’ Shit", "lyrics": "[Verse 1: T.I.]\nI'm a rich nigga like I don't know\nI can change if I wanna, but I won't though\nSteer right even when I'm on the wrong road\nReal talk from the heart what I'm known for\nSkinny jeans, I don't do those\nI'm the starter sub-par oughta shoot for\nFully automatic chopper, you could shoot though\nNow I'm movin' five mil' when I shoot dough\nAudemar, Hublot\nOne point five on the two-do'\nOld hustle, new flow\nOld money, new ho\nSuckers prayin' I'ma chill, but I'm too cold\nLong as I'm around, fuck they need you for?\nRidin' in the Chevy totin' three bricks\nSince nobody wanna make G shit\n\n[Hook: Watch The Duck]\nThis is for the gangsters, for the pimps and hoes\nThis is for the dope boy trappers sellin' halves and hoes\n(Since nobody wanna make G shit)\nThey want G shit, give it to 'em, give it to 'em now\nThey want G shit, give it to 'em, I'm the one to give it to 'em\n\n[Verse 2: T.I.]\nIf you don't know me let me tell you somethin', shawty\nStill got them choppers, make you run from it\nCamouflage, dog tag\nGot 'em followin', when you see me better haul ass\nKeep it G at all costs, what you call that?\nCrack rock, hip hop, I done all that\nCertified trap nigga, sucker, fall back\nA broke nigga he may entertain all that\nAll left field, keep it true, nigga\nSave the flash in the dance for a new nigga\nKeep speakin' for the ones who ain't got a voice\nKill 'em dead only when they leave no other choice\nHow I see it, if you ain't down to die 'bout it\nDon't waste my time, slime, why the fuck we talking about it?\nStill ridin' in the Chevy totin' three bricks\nSince nobody wanna make G shit\n\n[Hook]\n\n[Verse 3: Jeezy]\nNow what the fuck is an ounce? We smokin' bout an LB\nWe don't even do the nine, sell it by the whole ki\nAnd I'ma take this shit to trial, they got nothin' on me\nThey be on the Champagne, bitch, I'm 'bout to OD\nI got a bag full of birds and motherfuckers gettin' bought\nBars on the trap doors got it looking like a vault\nUsed to hit the highway over twenty of them things\nYoung nigga hit the club with the twenty of them chains\nWhen Jay was beefin' with Nas, I was sellin' cocaine\nWhen Game was beefin' with 50, I was doin' the same thing\nI was at the hospital, nigga, Meechy got shot\nFuck you niggas talking 'bout? I love that nigga like Pac\nG shit\n\n[Hook]"}], "artist": "T.I."}