{"songs": [{"year": "2012-10-22", "album": "good kid, m.A.A.d city (Deluxe Version)", "image": "https://images.rapgenius.com/by8dnoiat5fe4tp8eugoagwpv.300x300x1.jpg", "title": "Collect Calls", "lyrics": "[Produced by THC]\n\n[Intro]\nLook at all the bullshit I been through\nIf I take you home, will you tell the truth?\nLook at all the bullshit I been through\nIf I take you home, will you tell the truth?\n\n[Verse 1]\nMomma take this mothafuckin' block off\nTryna reach you every day, collect calls\nNever get through, and I go through withdrawals\nSay who told you that I wanted this door\nTo slam shut, I just wanted to vent or\nAsk you if you give me your rent for\nA attorney, I can pay you back more\nSoon as I get out, yeah, every rack is yours\nCommissary running low, I need help\nNot too much, I hustle up the rest myself\nK. Dot wrote me saying Marcus got killed\nIf you knew me, then you know how bad I feel\nQuisha prove me wrong, and never came to visit\nAnd I heard she fucking on some other nigga\nAnd my niggas left me in the dark, blind\nMama just get back at me this last time\n\n[Hook]\nMen lie, wo—women lie\nMen lie, wo—women\nMen lie, wo—women lie\nMen lie, wo—women\nLook at all the bullshit I been through\nIf I take you home, will you tell the truth?\n\n[Verse 2]\nMama, take this mothafuckin' block off\nThat's on the date the day I take the block off\nPulled up, and they put me in them cop cars\nPlease believe me, this ain't easy by far\nYou forgot you're talking to your only son\n'Member when you put me in that relay run\nI was racing, chasing dreams to be the best\nYou had taught me that the very day I won\nAll I need is you to give me same support\nInvestigation saying that the same report\nFrom a witness just might testify in court\nDA say I take a deal, or take a loss\nI ain't built for all them goddamn numbers\nGod's will, say a prayer for me mama\nIf you can't, then open up the phone lines\nMama just get back at me this last time\n\n[Hook]\nMen lie, wo—women lie\nMen lie, wo—women\nMen lie, wo—women lie\nMen lie, wo—women\nLook at all the bullshit I been through\nIf I take you home, will you tell the truth?\n\n[Verse 3]\nDante, if I stress to take the block off\nThat's the day the state had take them locks off\nI could only help but do so much\nBettering yourself, your own crutch\nLook at your reflection, tell me who you see\nWho is your protection? G-O-D\nNo, it's not neglect-ion, I have just accepted\nYour fate and what its gon' be\n'Member all the nights that I cried\nThinkin' that my only son just died\nPeeking through the window, kickin' through the door\nIt's you they looking for, raid outside\nRather see you locked up than dead\nOnly you would say that I'm selfish\nSo before I take the stand and put this bible in my hand\nSon, let me say this\n\n[Hook]\nMen lie, wo—women lie\nMen lie, wo—women\nMen lie, wo—women lie\nMen lie, wo—women\nLook at all the bullshit I been through\nIf I take you home, will you tell the truth?"}], "artist": "Kendrick Lamar"}