{"songs": [{"lyrics": "Ahhhh shit!  Shit!  Shit!\nNow, I'm walking down the street with some chicken and a forty\nI'm yelling at these hoochies and I'm looking for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nRun outta dough, slap the ho\nGet the dough and go back to that liquor sto'\n\n[Hook - repeat 4X]\nAfroman likes tall cans\n\nNow I'm a afroholic, call me Afroman\nLove to sag my khakis with a tall can\nMy homies pop the forty of some St. Ides\nNow that mother (uh!) staggering from side to side\nNow, we the loudest homeboys in my neighborhood\nWe look real bad but we feel so good\nMy thirst is quenched but my craving won't extinguish\nI need some forty ounce mother (uh!) Old English\nPut the top in my mouth, put the bottom to the ceiling\nDrink it down down until I get that crazy feeling\nNow just walking down the street with some chicken and a forty\nI'm yelling at these hoochies and I'm looking for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nRun outta dough, slap the ho\nGet the do' and go back to that liquor sto'\n\n[Hook]\n\nSee these girls be acting all bad and rude\nAlways got a bad attitude\nSee I just wanna dance, why can't you get the picture\nYou act like a brother wanna move in with you\nI gots no fame, I gots no wealth\nSo I wind up dancing by my goddamn self\nBut I paid my money, just like you\nAnd baby I'mma do what I came to do\nYou see I can't wait around 'til I get rich\nJust to make yo' gold digging attitude switch\nSo I'm walking down the street with some chicken and a forty\nI'm yelling at these hoochies and I'm looking for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nRun outta dough, slap the ho\nGet the do' and go back to that liquor sto'\n\n[Hook]\n\nI stepped into this party full of Mexicans\nI didn't realize I was the only black man\nOne hand on my bottle, the other on my peter\nI barked like a dog and started freaking senoritas\nI think she was embarrassed with the eight ball in my cup\nShe kept on stepping back so I kept on stepping up\nThis vato strolled up, put his gun to my head\nI knew if I moved I was officially dead\nThat had to be his woman, I know it doggonit\nThat ain't the first time that I got confronted\nGot my quete, \"What up, ese?  Get the fuck outta here!\"\nI said, \"I'm gone mother fucker, now give me my beer.\"\nCause I'm just walking down the street with some chicken and a forty\nI'm yelling at these hoochies and I'm looking for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nRun outta dough, slap the ho\nGet the do' and go back to that liquor sto'\n\n[Chrous]\n\nHO HO HO HO HO HO HO HO HO\nHO HO HO HO HO HO HO HO HO\nWalkin down the street with some chicken and a forty\nYellin at these hoochies and I'm lookin for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nOutta dough, slap the ho\nGet the do' and go back to that liquor sto'\n\n[Hook]\n\nWell I'm a afroholic, call me Afroman\nLove to sag my khakis with a tall can\nMy homie pop the forty of some St. I's\nNow that knucklehead staggering from side to side\nWe the loudest homeboys in my neighborhood\nWe look real bad but we feel so good\nMy thirst is quenched but my craving won't extinguish\nI need some forty ounce mother fucking Old English\nPut the top in my mouth put the bottom to the ceiling\nDrink it diggy diggy down 'til I get that crazy feeling\nI'm just walking down the street with some chicken and a forty\nI'm yelling at these hoochies and I'm looking for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nOutta dough, here we go back to that liquor sto'\n\n[Hook]\n\nNow these women be actin all bad and rude\nAlways gotta bad attitude\nYou see I just wanna dance, why can't you get the picture\nAct like a brother wanna move in with cha\nI gots no fame, I gots no wealth\nSo I whined up dancing by my God damn self\nBut I pay my money, just like you\nAnd baby I'mma do what I came to do\nYou see I can't wait around 'til I get rich\nJust to make yo gold digging attitude switch\nSo I'm walking down the street with some chicken and a forty\nI'm yelling at these hoochies and I'm lookin for a party\nDrink it fast, make it last, 'til you know it ain't no mo'\nOutta dough, here we go back to that liquor sto'\n\n[Hook - speeds up at end]", "title": "Tall Cans", "album": "My Fro-losophy", "image": "https://images.genius.com/286e5a371c850693e27da49e4af749c5.300x308x1.jpg", "year": "2000-06-03"}], "artist": "Afroman"}