{"songs": [{"year": "2007-02-10", "image": "https://images.genius.com/7f83bf9448b2da79539dac03a657c334.249x249x1.jpg", "title": "Baby Girl", "album": "Hate Music", "lyrics": "[Intro: Bizarre]\nTime waits for no one\nIt's time to be a man\n\n[Verse 1:  Bizarre]\nIf your got kids, you know what I'm talking 'bout\nBut do like I did and just walk the fuck out\nFor 10 years I been smoking crack\nBut now I'm back to get my litte girl back (hey there)\nI'm on 8 mile with an attitude, science said work for full\nButt-naked in the noon (damn)\nForced to be a man with nowhere to go\nShit I just stopped smoking crack an hour ago\nWith the hope and a prayer my life is finished\nI never smile cause I need to see a dentist (damn)\nIt was all good when mama was paying the rent\nBut she died to weeks ago in a car accident\nAnd when the fuck the find me in the cardboard box\nWith dirty socks, drinking a bottle of scotch\nI want cock so bad I suck your grandfathers cock\nGive me that rock or get sucked!\n\n[Hook: Eminem]\nMy baby girl, keeps getting older\n(Time for me to be a man)\nI watch her grow up with pride\n(step up and take irresponsibility)\nMy baby girl, keeps getting older\n(It just all happens so fast)\nI watch her grow up with pride\n(what I wanna do?)\n\n[Verse 2: Bizarre]\nMy little girl wants to be a ballet dancer (dady)\nLast week she was diagnosed with cancer\nIt took me 2 years to spot it\nAnd the cancer she got, ain't nobody got it\nAnd I'm trying to stay strong, I want my little girl to live long\nThats why I'm writing poems and writing songs\nHealth insurance they ain't paying no cash\nThats why I'm selling glass, If I have to I'll sell my *ass*\nLook at me an irresponsible father and been here\nFor half an hour and ready to run like a coward\nLord please don't take my little girl's life\nSo she can skate on ice and learn how to ride a bike\n\n[Hook: Eminem]\nMy baby girl, keeps getting older\n(Yeah I love my little girl)\nI watch her grow up with pride\n(Watching her grow up)\nMy baby girl, keeps getting older\n(Takes a real man to stick around)\nI watch her grow up with pride\n(The fuck I wanna do?)\n\n[Verse 3: Bizarre]\nShe been up all night crying and hurting and the chemical theory\nIt ain't working and I can't afford the operation\nNot even if I rob a gas station\nLooking dirty, stanky and beat in the shower\nI don't smoke cigarettes, I'm killing a pack in an hour\nMy little girl said \"daddy I'm going to have it\"\nLook at my princess, fighting, only 7\nAny minute my daughter can pass away\nAnd her favorite group is B2K\nSing motherfucker! sing! sing motherfucker!\n\"gotta be that one that you deserve\nGotta be the one that you can hold\nGotta be gotta be your everything, don't kill me Bizarre!\"\nHahaha, you little motherfuckers\n\"if you got kids, what the fuck would you do?\"\nThis ain't Bizarre, this is John Q with a loaded 22. (bow!)\nMe and my TEC-9, I load her and cock her\nEverybody going to hell, even the doctor\n\n[Hook: Eminem]\nMy baby girl, keeps getting older\nI watch her grow up with pride\n(The fuck am I supposed to do?)\nMy baby girl, keeps getting older\n(I mean, I mean what would you do in this situation?)\nI watch her grow up with pride\n(I'm just a product of the world)\nMy baby girl.."}], "artist": "Bizarre"}