{"songs": [{"year": "2008-09-30", "title": "When the Lights Go Out", "image": "https://images.genius.com/ebc5be88ada34561fc19c744f8f49b81.600x600x1.jpg", "lyrics": "[Chorus]\nWhatchu gonna do when the lights go out?\nNo trace of the money in your bank accounts\nPanic and chaos in the streets of the city\nEach man for themselves and police ain’t got pity\nThis is where we separate the weak from the strong\nWho survives, who dies, who’ll keep keep on\nEnemy amongst enemy fighting it out\nSo whatchu gonna do when the lights go out?\n[Verse 1: Sabac]\n\nThis is the day of doom, lit by the moon vocally prophesized\nPenalties, empty energy overly modernized\nRich are sodomized, the initial conception\nIt’s like prisons and communism that fits in deception\nNo cellphones, radio, no Internet, or TV\nNo planes, no cars, no lit homes, and prone to bleed\nWe cloned our seeds expecting we can own, decree\nNow we’re back to primitive earth we roamed for free\nMost ain’t built for the challenge and get killed for the balance\nThe water supply low, a few million gallons\nFor the billions of people, watch that number decrease\nEveryone is on their knees begging for something to eat\nDisease claims many lives, people pray to their maker\nSee the pain in their eyes in a state of omega\nEscape the cold and the heat, we’re faced to fold and defeat\nWe walk the edge of the earth burning the soles of our feet\nThere’s no control in the streets, it’s worse than looting and riots\nWorse than a shooting or virus, more like pursuing a diet\nOf human flesh, grotesque but it’s survival of the fittest\nAmazed how you behave in the arrival of the finish\n\n[Chorus]\nWhatchu gonna do when the lights go out?\nNo trace of the money in your bank accounts\nPanic and chaos in the streets of the city\nEach man for themselves and police ain’t got pity\nThis is where we separate the weak from the strong\nWho survives, who dies, who’ll keep keep on\nEnemy amongst enemy fighting it out\nSo whatchu gonna do when the lights go out?\n\n[Verse 2: Ill Bill]\nIn ancient times the nighttime represented the death of life\nThe sunrise a rebirth we’ve left for trife\nTaken for granted, nations in panic, worldwide chaos\nIt’s starvation raping the planet, it’s Satan that planned it\nThe Unabomber predicted this would happen\nImagine the lights went out, credit and debit cards are dead now\nBillionaires are thrown to the lions, heads of trillion dollar corporations\nAre thrown out of skyscraper windows crying\nNo more email, text messages, or smart phones\nNo more free mp3’s or illegal downloads\nNo more governments, total anarchy\nThe few that knew how to use solar energy as a power source were massacred\nDuring the gas riots of 2017, gas prices eighteen dollars a gallon\nIt set the streets on fire, the beast admired the least to cry\nAmongst the thieves and liars that make use of the violence\nPeep the science\nWe’re relying on the sun’s power, get your sundial\nPut your gun down? Think about your daughters and your sons now\nThink about these cannibals you have to hunt down\nBy high noon it’s raw, armageddon’s at sundown\n\n[Chorus x 2]", "album": "The Ritual"}], "artist": "Sabac"}