{"songs": [{"year": null, "album": "Fire and Glory", "image": "https://images.genius.com/dd8fc4f20fab691cb0bc8e71f35767a4.300x300x1.jpg", "title": "Heads Up", "lyrics": "[Intro]\nYeah, it's Mr. Kardinal\nYeah, Black Jays! Oh what?\n\n[Verse]\nYo, all the shuckin' and jivin' is over\nI'm the chosen soldier, cold shoulder\nYour home boys told ya, flip your flows\nI fold, you can fertilize with the BS they sold ya\nI need papers for the style that I loaned ya\nEverybody's talkin' about they gettin' busy, why don't ya?\nWeak players in the game steady gettin' over\nI'm one of a kind, like side gills on a Rover\nFirst name Jay, but ain't similar to Hova\nMy buzz is like rum mixed with Coca Cola\nMy shine is incredible, versus a solar\nI'm sick like a seven-day-strain of Ebola\nI'm here! Yeah, nigga!\n\n[Hook x2]\n(One more time)\nNo doubt, when we on the block\nBecause my niggas came ready to rock, boy\n\n[Verse]\nStep heavy like a lion through the jungle\nI'm lyin' if I told you that I wasn't raised humble\nI'm tryin', but I stumble, I try not to mumble\nSo you can hear it loud stupid (Let's get ready to rumble)\nI'll serve you son, like I'm supposed to\nThe only way I'm bi, is when I'm flyin' bicoastal\nOr buyin' fly wears, Nike Airs like most do\nI'm hotter, than the hotter, than the hotter, I'll roast you\nGot a good habit of doin' what you won't do\nStop playin' girl, you know I ain't phoned you\nCheck one of them suckers, you know that they want you\nI'm loco with the vocals, most dudes just local\nI'm here! Yeah, nigga!\n\n[Hook x2]\n\n[Verse]\nYo, rudeboys move in silence\nDon't want to hustle until they hear sirens\nI'm tryin' to be inspirin'\nBut my 6'4\", 220 has a lot of them kids perspirin'\n'Nuff dudes firin', too many gettin' shot\nSo swallow your pride nigga, check whoever is hirin'\nThe paper gangstas is who I'm admirin'\nThose who get paper alive, and still smilin'\nY'all stay wildin', I'm tryin' to go the mile and\nI'm rough enough to break New York from Long Island\nIf you a big man, why you actin' like a child?\nPick up the pace, and put down the crack vial\nI'm here! Yeah, nigga!\n\n[Hook x2]"}], "artist": "Kardinal Offishall"}