{"artist": "Problem", "songs": [{"album": "S2", "title": "About That Time", "image": "https://images.genius.com/7fb9d8c4ebfefcd0475c83bda4bfb488.1000x1000x1.jpg", "lyrics": "[Intro]\nAight\n\n[Chorus]\nHuh, starin' at my Rollie, it's about that time\nLess about talent, more about your grind\nGo against mine, we gon' come back fine, yeah\n\n[Verse 1]\nIt's comeback season far as comebacks go\nI'm not here for X and O's, this ain't tic-tac-toe\nAin't no love around this bitch, so I ain't got none to give\nNow I done slowed down with the old, you see what happened to Bill, yeah\nY'all know that I'm a Problem, so know that when y'all approach 'em\nI'm driven by the dollar, might as well call it my chauffeur\nI do this for the love, I don't do shit for your approval\nY'all catch me drivin' poundie 'fore you catch-man, hold up\nDiamond Lane, we never losin'\nAnd me? I'm never changin' sides even when we wrong\nSo what? Chachi read the bang and ride, boom\nShoutout to Bang, he just lost his mother\nMine alive, use mine, shit, you like my brother\nTo all my niggas, like a bed, bro, I got you covered\nNiggas trip, I do my shit\n\n[Chorus]\nHuh, starin' at my Rollie, it's about that time\nLess about talent, more about your grind\nGo against mine, we gon' come back fine, yeah\n\n[Verse 2]\nSalute to God\nI heard these niggas wanna shoot the god\nI find out the bullets rippin' and they shoot the god\nDiamond Lane, bro, salute the mob\nIt's truth in eyes, nigga, look at mine\nNigga, look at mines\nI don't take days off, everyday 'bout the buck\nI don't give time to these pussies unless I'm 'bout to fuck\nRemember talkin' to Uzi up in his Bentley truck\nYoung nigga, keep movin', fuck 'em, just get the bucks\n'Cause they gon' hate you anyway, chyeah\nThe minute they don't like you, they'll remake you any day\nAnd you'll be sittin', puzzled, like, \"what happened to my pieces?\"\nAnd all your team be gone, it just be mommas, aunts, and nieces\nFuck these industry niggas, I treat 'em like polices\nMotherfuck 'em, never trust 'em but be careful when I see 'em\n'Cause they ain't ready for real action, huh\nFor real\n\n[Chorus]\nStarin' at my Rollie, it's about that time\nLess about talent, more about your grind\nGo against mine, we gon' come back fine\n\n[Outro]\nDiamond", "year": "2018-11-30"}]}