{"songs": [{"title": "Legal", "album": null, "year": "2014-05-17", "image": "https://images.genius.com/8a31abeb512287bb97f10d480ac081ab.500x500x1.jpg", "lyrics": "[Hook: Lex Luger]\nSmokin' marijuana all in public\nYou would think that shit was legal\nI just went and bought a Bentley coupe\nThat shit boosted up my ego\nI got me a freak ho, she boosted up my ego\nShe boost her niggas ego   \n\n[Verse 1: Gangsta Boo]\nI boost that nigga ego up, he bought me a Range Rove'\nPut my pussy on his lips, he kissed it with his eyes closed\n[?] counts stacks of cash and bags that I just made off tour\nTravel through the snow and then get it\nI'm a hustler, baby, and that's for sure\nPay no attention to wack bitches\nI can't see from the side, I got tunnel vision\nWhere they do that at? Not over here on this side of Memphis\nSmokin' with some veterans, not in Cali but still got my medicine\nBeen fucked up and let me back in again\nLike Kevin Durant, I am gonna win\nPerforming in TomorrowWorld blew my fuckin' mind\nIf you ain't heard of that then you really are behind\nTriple 6 'til the death of it, call me Wicked Witch\nPrivate planes, money, cars, the fame, makin' number hits\n\n[Hook]\n\n[Bridge: Lex Luger]\nShe ain't just for me, though\nShe boost my niggas ego\nWe out in Puerto Rico\nFlooded with the migo\n30 thousand on a nigga\nI'm a walkin' kilo\n\n[Verse 2: Lex Luger]\nJumped into this game with no pot to piss in\nNow my baby mama shoes made by Christian\nLouboutin, who is him? He never bought a Benz\nLex Luger here, we in the field, I never disappeared\nAccomplish what you want to but you can't\nI am sponsored by Mr. Thomas and Ben Frank\nYour baby mama is in my sauna, we havin' dranks\nPull out that llama, you with that drama over that skank\nI hit and run, when I smash, I'm done\nBitch, I ain't the one, wanna have my son?\nHo, you must be drunk or you just playin' dumb\nI just wanna have fun, I just came here to cum\nCan it be on your tongue? Can you call up your friends?\nDo they wanna have fun? We can soak in the sun\nWalkin' out of Fulton County, Gucci shoes on\nFeels like every time I'm doin' right, something goes wrong\nI just popped that Xanax and it was the whole bar\nI don't have anxiety so motherfuck' the law\n\n[Hook + Bridge]"}], "artist": "Lex Luger"}