{"artist": "Angel Haze", "songs": [{"title": "I Don’t Like (Freestyle)", "image": "https://images.genius.com/5be152015519be507a6e26d1760ae9fd.405x405x1.jpg", "album": null, "lyrics": "[Intro.]\nIt's Young Gypsy in this bitch\nI don't like\nThere's a lotta shit in this fuck ass world that I don't like\nBut, you know. Angel Haze\n\n[Verse 1: Angel Haze]\nLook, fuck all these bitch ass niggas and these bitch ass bitches, don't fuck with these trick ass niggas\nAlways wanna talk about your whips and a bitch and how he quick to click, clack, hit that trigger\nNone of y'all niggas fit in that picture, only shit you smoke is in that swisher\nTalk about your scene where you been for the sales and the green and I mean all that shit that figures\nAlways seem to wonder how it gets that way. How living a lie becomes the shit that pays\nHow the wonder of the color for a stupid motherfucker and it never really enough until it gets that grey\nBlack is perilous, it's just that shade\nHold up nigga, drop my beat\nHow the fuck you live in a world where ever since birth you were meant to not succeed?\nIdolizing niggas that will die behind a nigga that was lied to a nigga that will not succeed\nIdolizing bitches that will rely to other bitches that pretend about their shit, but did not succeed\nI'm simply an informant the cycle of the garn that was introduced by some niggas that you should not believe\nBasically, all the niggas you look up to looked up to a nigga that did not succeed\nAnyway, I'm ham on these motherfuckers\nStomping on their face, toejam on these motherfuckers\nGet me mad enough, I'll cloak and dagger up. Say church, amen, lay hands on these motherfuckers\nAll I do is talk that real shit, no really, I'm 'bout that real shit\nWalk up in the spot, bitches fiend for my presence cause they've never felt the essence of a real bitch\nWhoop, whoop, real bitch. Whoop, whoop, real shit\nI'm out here on that trill shit, flow wetter than some seal lips\nI'm in this bitch like all day, fuck these bitches like always\nAin't one bitch out that can step to the kid\nI'll kill them and have them drawn like Paul Frank\nShook ones, I know that you shook son\nI see you eating at your card like a book worm\nJealous ones fucking envy, good and fucking plenty\nA hating ass bitch is some shit I don't like and I ain't got that in me\nIn me, I ain't got that in me\nI don't need no friends, ho. I'm not fucking friendly\nI don't fuck around ho, I get ratchet quickly\nBitches, not out here fucking with me\nWeak ass bitches that's out in the world and I don't like that plenty\nFunny. I don't like you anyway\nYou fucking suck, I'll murder you like any day\nBitch, fuck off", "year": "2012-10-02"}]}