{"artist": "Asher Roth", "songs": [{"title": "Freaks", "image": "https://images.genius.com/e7be0abebf7a2ead2080b2dbd056152e.500x500x1.jpg", "album": "The Greenhouse Effect Vol 2", "lyrics": "[Verse 1: Asher Roth]\nThat booty poppin' you doing making me kind of hard\nYou ever thought about movies? I think you'd be a star\nI used to watch scrambled porn alone in the basement\nBut I don't watch anymore, nah girl I make it\nSo let's get naked, you can meet my O-face\nThink my parents home so we should head on back to your place\nYou can tie me up, probably wouldn't make a peep\nYou like anal beads? Yeah the safety word is \"jamboree\"\nYou can't handle me\n50 shades of Sasha Grey\nMultiply by Tory Lane\nTimes it by a Jenna Haze\nWhat can I say? Hey, you fulfill my fantasy\nCandles lit, sittin' sucking dick under the canopy\nI can dress like Santa, shit on you like Human Centipede\nGo and show that fanny, don't you try and be romantic please\nI'm talkin' spittin' and chokin', rippin it open\nTill it's drippin' down your throat and runnin' in slow motion\n\n[Hook: Nicki Minaj]\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\n\n[Verse 2: Asher Roth]\nThose blonde bitches with a gap in their teeth\nAnd Daisy Duke shorts showing off a little cheek\nI wanna pillow fight and roll you up inside the sheets\nSmoke you like a spliff of California's finest weed\nRed heads in white tees\nWearing no bra, showing off the perky little beads\nI love it when you're freezing and those nipples start to peek\nTry unique positions, so can you hold my feet?\nSnapchats a fat ass, smack smack off the glass like a bad pass\nShe has pierced ears and pierced lips\nPierced tongue, pierced nips and pierced clit\nThat's weird shit, but it's all good\nDo your thing, baby, like a freaky girl should\nEverybody knows it ain't as easy as it looks\nPersonally, see I just wanna fuck\nI'm talking 'bout\n\n[Hook: Nicki Minaj]\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks\nI've got my freaks, I've got my freaks got my got my freaks\nI've got my freaks, got my freaks", "year": null}]}