{"artist": "6LACK", "songs": [{"album": null, "title": "Pretty Little Fears (Live)", "lyrics": "[Verse 1: 6LACK]\nDo better, who better?\nYou better? Been around, like hella, propellers\nWanna know who you with, don't tell 'em\nCome on fellas, that ain't none of your biz'\nGot on your body suit, you know I'm on your ass today\nWould you let me hit it thrice if I asked today?\nShe know my stick nothing but magic babe\nI be swinging it back and forth, 'til you in your casket, bae, mm\n\n[Pre-Chorus: 6LACK]\nGirl, you want my best side, mm\nBet she from the westside, mm, mm\n\n[Chorus: 6LACK]\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you won't\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears\n\n[Verse 2: 6LACK]\nOkay, say it loud, say it proud, you want it more\nWe open door, hit the couch, then the floor\nI cut it up, like a scissor, love galore\nShe never bored, there's so much shit we can do\nYou free to say whatever, baby, if you askin' me\nNo limit when I'm in it, got a Master P\nI'm hoping I don't have a fast release\nGot me focused like I'm out here tryna get my Masters see, mm\nThrowin' up the peace sign, mm\nGirl, I'm from the Eastside, mmm, mmm\n\n[Pre-Chorus: 6LACK]\nGirl, you on my best side, mm\nSay she from the west side, mm, mm\n\n[Chorus: 6LACK]\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you won't\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you won't\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears\n\n[Verse 3: 6LACK]\nSummer came and it left\nBut love stayed and it’s stuck\nAnd now I carry my weight like a truck\nI don’t make music for critics to critique\nBut because the people need\nThey need me to lead the way, and so I speak\nIt's 6LACK pronounce blacker than my skin\nEver since I was a boy, the world told me I should never ever cry\nAnd If I was to ever shed a tear, out of fear, show emotion\nI could kiss my credibility goodbye\nWe were taught to be strong, not knowing the only way to be that\nWas to feel like it was safe to open up\nNow woman suffer from this gap that we created everyday\nI’ma learn and I just wanna say that it is tough\nThis here is a PSA for every young black man watching\nI am not here to talk about my album dropping\nConditioning and the influence exist for a reason\nBut it's all bound to change like the seasons, seasons\nYou got pretty little fears, I got pretty little fears too\nI’m just hoping I could share\nWith you\nYou got pretty little fears, I got pretty little fears too\nI’m just hoping I could share\nWith you", "year": "2019-01-23", "image": "https://images.genius.com/103257aeaf421fb834abe9d35aa2fabf.640x640x1.jpg"}]}