{"artist": "Plies", "songs": [{"album": null, "title": "Excuse My Hands", "image": "https://images.genius.com/142f4d6c2e6ce44c7607f441746bff25.1000x1000x1.jpg", "lyrics": "What?s ha?enin? baby?\nLet ya lil' whoa Plies tell you what?s goin? on wit a man\nMy hands been gettin? me in a lot of trouble lately so\n\nPlease excuse my hands\nThey just wanna touch\nThey just wanna feel\nThey don?t mean no harm\nBaby, just excuse my hands\n\nBaby, please excuse my hands\nI apologize, they have a one track mind\nTo squeeze on your behind\nBaby, just excuse my hands\nPlease excuse my hands\n\nWit my hands I can make you do a lot of things\nHave you engagin? in some activities you can?t explain\nLeave my fingerprints on every inch yo? damn frame\nWit this one finger I can make you get off the chain\n\nGet that lick, gimme my hands, they get they own brains\nThey wanna touch ya, they wanna rub ya, they wanna feel yo? frame\nRun my hands through yo? hair and go against yo? grain\nLet me message ya baby and help ya ease ya pain\n\nYou wanna get comfortable?\nTake your shorts off, I can help you change\nWanna take my hands off, but I can?t, they just gon? call yo' name\nIf I can?t squeeze and I can?t hold ya it don?t feel the same\nIt ain?t my fault baby, my hands' the one to blame\n\nPlease excuse my hands\nThey just wanna touch\nThey just wanna feel\nThey don?t mean no harm\nBaby, just excuse my hands\n\nBaby, please excuse my hands\nI apologize, they have a one track mind\nTo squeeze on your behind\nBaby, just excuse my hands\nPlease excuse my hands\n\nI?ma do ya like this and do ya like that\nI promise you gon? like the way I touch on you\nSo jump up in dis Benz and let the seat back\nI promise you gon' like da way I feel on you\n\nI?m do ya ?til yo? body say ?ooh?\nI?ma do it til yo' mouth breathes ?no more?\nI said, ?Excuse my hands,? she said \"Boy stop playin?\nCome make love to yo' number one fan, hello\"\n(Please excuse my hands)\n\nBefore I kiss ya or make love to ya, I wanna touch\nCan you please face the wall? You 'bout to get strip searched\nMy hands talkin? to me, they want now what?s under yo' skirt\nLet me be the one that do the honors, help you wit yo? shirt\n\nMy hands don?t like to be unemployed, they like to work\nI been told my hands a little mannish, they like to flirt\nGod knows women the sexy thing he put on this Earth\nMy hand cravin? yo' little sweet body and it?s gettin' worse\n\nI wanna thank you and your body for helpin? me write this verse\nMy hands'll never leave yo? body, baby they so loyal\nDo me a favor, look on the dresser and grab that baby oil\nAin?t got to be the one that do it, my hands gon? spoil ya\n\nPlease excuse my hands\nThey just wanna touch\nThey just wanna feel\nThey don?t mean no harm\nBaby, just excuse my hands\n\nBaby, please excuse my hands\nI apologize, they have a one track mind\nTo squeeze on your behind\nBaby, just excuse my hands\nPlease excuse my hands\n\nKeep doin? it, keep doin? it, keep doin? it to me\nKeep doin? it, keep doin? it, I swear I?ll never leave\nKeep doin? it, keep doin? it, keep doin? it shawty shawty\n\nWoke up in the spot\nOh yeah the boy?s on fire\nI?m wit my nigga Plies", "year": null}]}