{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Verse 1: R.A. The Rugged Man]\nLittle ones listen, learn from me, see, you could be the best\nBut sit in your room depressed and you'll never progress\nMy sister Dee-Dee was born mentally retarded, she was a beautiful\nWoman at 26, but now she's dearly departed\nThis May Tenth she suffered from a heart attack, the depletion of\nOxygen in the head left her in a coma brain-dead\nHer internal organs was failing, her body no longer releasing excretions\nMy parents wouldn't pull the plug cause she was still breathing\nBlack, white, let's unite us, never divide us. X-Clan\nProfessor X died from spinal meningitis, so many like us\nAre in Rikers suffering, struggling, slumming. A few years ago\nYou was sucking your thumb and now you're busting your gun and dumbing\nAn innocent man is done, and enough of your bluffing, your thugging\nAnd enough of the ruckus running, the roughest is coming\nIt's a miracle just being born, learn to enjoy life\nIt ain't that long. sing the words to my song, come on\n\n[Chorus: Eamon]\nWake up, don't cry\nSo sad inside\nI still get through the day\nI'm gonna make it anyway\nWanna give up, feel like hiding\nYeah, I get down, but keep fighting\nI still get through the day\nI'm gonna make it anyway\nAway\nAway\nI still get through the day\nI'm gonna make it anyway\n\n[Verse 2: R.A. The Rugged Man]\nLiving ain’t a breeze, please, life’s full of tragedies\nWe see our friends die, some get murdered, some die by disease\nGot your finger on the trigger, don't do it, contemplating\nSuicide, just put the gun down, we've all been through it\nAn infant in his crib sprayed by stray bullets and dies\nHe was a future genius, he would have won a Pulitzer prize\nThe racist cop shot an innocent black, an 8-year old\nProstitute hoing getting mommy money for crack\nA little boy molested by his step-father, hopeless\nThe little boy grew up now, he's molesting his own kids\nThe government watching you from a satellite like you ain't had it right\nYour best friend snitching on you; that's animal-like\nIt's horrible watching your loved ones die and having to bury 'em\nThis year, my cousin found dead, she overdosed shooting heroin\nMy family dying from sickening disorders, we found my brother Maxx\nHe was blue and purple and he was stiff with rigor mortis\nMy father got spots on his lungs, they think it's cancer\nI'm praying every night, even if God don't ever answer\nWe can do it together, women hold your mans\nMen hold your women, everybody let's hold hands and sing\n\n[Chorus: Eamon]\nWake up, don't cry\nSo sad inside\nI still get through the day\nI'm gonna make it anyway\nWanna give up, feel like hiding\nYeah, I get down, but keep fighting\nI still get through the day\nI'm gonna make it anyway\nAway\nAway\nI still get through the day\nI'm gonna make it anyway\nWake up, don't cry\nSo sad inside\nI still get through the day\nI'm gonna make it anyway\nWanna give up, feel like hiding\nYeah, I get down, but keep fighting\nI still get through the day\nI'm gonna make it anyway", "title": "Still Get Through The Day", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}