{"artist": "Phora", "songs": [{"album": "With Love ", "title": "Fake Smiles", "image": "https://images.genius.com/e4222fcd73ffac8203c096001741c65a.1000x1000x1.jpg", "lyrics": "[Chorus]\nIt's like, the more I try, the less I feel\nIn desperate need of something real\nWhy, lately I ain't been the same?\nAnd why I try so hard to hide this pain\nI search, but I can't ever find\nCan't seem to leave my past behind\n'Cause all the ones I hope would stay\nAre all the ones that fade away\n\n[Verse]\nTruth is I think about you often\nI miss your voice, I miss your smile that I used to get lost in\nI know you know I have this thing for you, I never lost it\nI think I just lost myself, in the midst of the non-sense\n9 times out of 10, I'd close my eyes and dream about you\nDon't know what it was, but you just had this thing about you\nLately we've been distant, see, I just can't be without you\nAnd my soul got so attached to yours\nI can't be me without you\nBut, we hate ourselves because we run from the people we love\nAnd we all hold on to the past 'cause we miss what it was\nDon't wanna feel so we try to numbin' the pain with these drugs\nLiving in hell, 'cause we lost faith in the place up above\nAnd my anxiety is breaking me, it kills me\nI'm living in a world so fake, I lost touch of the real me\nHad to take a look back, just to ask me if I'm still me\nAnd would I still stand for this if they wanted to kill me?\nI can't take it no more, I just can't take it no more\nI can't smile like I'm okay, I just can't fake it no more\nI can't act like I've been happy and complacent no more\n'Cause every time I try to change, it is the same as before\nMy karma's coming, my karma's coming, it's weighing in\nI'm drinking till all my feelings just fade away again\nAnd mama, she always told me \"this ain't a way to live\"\nBut, when you feel what I'm feeling that's just the way it is\nI'm trying not to break down but I just can't hide this pain\nSaw myself in the mirror and I'm just not the same\nBut who's to blame? I guess we all change\nWe hurt the ones we love because of our pain, fuck...\n\n[Chorus]\nIt's like, the more I try, the less I feel\nIn desperate need of something real\nWhy, lately I ain't been the same?\nAnd why I try so hard to hide this pain\nI search, but I can't ever find\nCan't seem to leave my past behind\n'Cause all the ones I hope would stay\nAre all the ones that fade away\n\n[Outro]\nAre all the ones that fade away\nAre all the ones that fade away", "year": "2016-10-11"}]}