{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro]\nYep\nFeels like we been here before\n\n[Verse 1]\nIt's the return of the one that just Can't Be Alone\nA Typical cat is known to visit the path on Church Road\nA Freak that's into his mind, now above the Neon Skies\nA Modern Man who's out for Better Things, we gon' Rise\nLoaded Galil has got me filled up on Adrenaline and\nI'm fearing the Paper Trails, Anxiety Attacks again\nFloating Away and Haunted by the grip of sleazy goals\nEasy Money still don't exist but bet that We Got Soul\nSo\n\n[Hook]\nDo you wanna go further now?\nCan I take you further now?\nDo you wanna go further now?\nLet's take it further now\n\n[Verse 2]\nOn a rock where the people draw these lines into the sand\nTo separate us all with hate upon our fellow man\nI travel the globe and meet as many people as I can\nBefore they come and try to strike us down right where we stand\nThe upper hand is quite deceiving when it waves you bye\nIt's easy to not be grateful for the things you pay no mind\nBut take those things away from the people and when they do find\nThat they don't have exactly what they want it's killing time\nI decline, you'll find me further now with each command\nEach step that I take towards the other side is planned\nEach day I treat like a lifetime inside my hand\nWhat to do is for me to choose, well isn't that just grand?\nI'm still hearing the ghosts of family members passing by\nAnd still seeing so many souls that waste the fact they live\nI catalog my every step and breath into my spine\nSo even when I make mistakes, at least I know they're mine\nFine\n\n[Hook]\nDo you wanna go further now?\nCan I take you further now?\nDo you wanna go further now?\nLet's take it further now\nInto the Further\n\n[Outro]\nYou have now entered the further\nTrust nothing, trust no one\nBe wary of the clones", "title": "Further", "year": "2017-05-05", "album": "Into the Further", "image": "https://images.genius.com/6f3dc8fd85f67bd995f87b15cb9bb3a1.1000x1000x1.jpg"}]}