{"songs": [{"year": "2010-01-01", "title": "I Was Zero", "image": "https://images.genius.com/124ced80167d056671039400238da2c2.220x220x1.jpg", "lyrics": "If it wasn't for the bass, I wouldn't need these hearing aids\nIf it wasn't for mistakes, I probably wouldn't be here today\n\n10 years ago I was 22\n20 years ago I was 12\n30 years ago I was 2\nBut when I came out my momma I was zero\nWhen I came out my momma I was zero. (x3)\nI was zero when I came out my momma, and now everybody knows\n\nIn the before life, I was undead\nI was home schooled, there were no rules\nBut I gave it all up, just for the chance to go public\nA celestial scarecrow dancing with the puppets\nA tug in my gut, I'm carrying the world in my stomach\nI'm a surrogate mother-fucker the girls love it\nBirth the suffix and cut the visible string\nControl's much more than a physical thing\nI was born into it, and before I knew it\nI saw the students of poor gettin' hauled off to war\nThe law of Judas in the land of the king's tax\nPartaking the Eucharist, then demand your kick-backs\nSpiritual wrist slap, please pass the sacrament\nAsk if big bad black Jesus was African\nSelling a click track, call it a soul-clap\nIt's all in how you package it\nThe power of a magic trick\nImmaculate concepts, lost in the land of the cross\nI'm standing off with a man of the cloth\nHe knows the ins and out's and all I wants the outs\nHes selling real estate for some place in the clouds\nBut I'm not investing in intellectual property\nInventing gender-bending technology\nBecause maybe everybody needs to just become a sexual oddity\nLeaving birth to the test tubes and death to the lottery\nThere's no one stopping me, I've gotta be self-regulating\nWealth is escalating, but my poverty was entertaining\nI'm debating, the value of a caste system\nI'm cash backed for wars and wars funded by my tax income\nI find my part of the problem in part of me\nThere's always been a difference between what I am and what I wanna be\nIt's either Jihadist freak or Jesus scenester\nI heard god is cumming and shes a screamer\n\nI couldn't understand what she was telling me\nWhy everyone thinks that they're their own worst enemy\nI followed the manual and I swallowed the skeleton key\nAnd it unlocked the hell in me\n\n(So this is my gift to god!) Rippin' at my dick like a tourniquet, syphilis!\n(This is my gift to god!) I'm jumpin' out the cake, naked with a shank\n(This is my gift to god!) Unwrap the package confetti made of maggots\n(This is my gift) You call that talent? here's your image back, you can have it\n10 years ago I was 22\n20 years ago I was 12\n30 years ago I was 2\n\nWhen I came out my momma I was zero. (x4)\nI was zero when I came out my momma, and now everybody knows. (x2)\n\nIf it wasn't for the bass, I wouldn't need these hearing aids\nIf it wasn't for mistakes, I probably wouldn't be here today. (x2)", "album": "LI(F)E"}], "artist": "Sage Francis"}