{"songs": [{"album": null, "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png", "year": null, "title": "Get Back, Pt. 2", "lyrics": "Talib Kweli:\n\nClear the area, stand back, nothin to see here\nKeep it movin (I need the area clear)\nGet back, stand back, back\nGet back (we gon' have to clear all this stuff)\nGet back, back, get back\n\nDcq:\n\nReflection Eternal\nThat's the name don't forget it, Talib Kweli, DJ, Hi-Tek\nBrooklyn! New York City\nCin-ci-natti! Keep on\n\nTalib Kweli-Verse 1:\nIt's a funky sen-sa-tion ain't it?\nI'm havin a conversation wit'cho imagination\nIt was explainin how you was waitin, for somethin amazin\nLike when it come out you out the door racin to the store (*zoom*)\nIt took a lot of perse-verance and patience\nWe was preparin for our place among the ancients\nYo basically yo' take on me ain't makin me\nOr breakin me and yo I hate to see a fake MC\nI take out all my competition from like A to Z\nCause I get fly more frequently than a travel agency\nThat's what I'm made to be, hip-hop through my artery\nAn important part of me the soundtrack to my oddysey\nIt got me, rockin retardedly\nPardon me for speakin incorrect politically\nAnything less would be me speakin hypocritically, and I don't do dat\nYou lingerie MC's I see through that\nI make a point about you and your crew, go \"Tru dat\"\nWho dat? It's the Reflection\nRemember the name, slid in the game before the \"2000 Season\" came\nBreakin the chain, usin the pain as our ammunition\nTo blast Babylonian towers out of position\nIt's the Reflection and we poppin like your ears on a plane\nWe make you disappear like tears in the rain\nThe fears in your brain is clear when I appear on the terrain\nAnd bloody your nose\nI got more lines than co-CAINE that's why you sniffin' around\nWe diggin' for different sounds to keep it hittin'\nStraight up the only way we gettin' down with the sound is provacative\nIt's for the love and cause of that we got a lot to give\nIt's for the love and cause of that we got a lot to give\nYou got a issue with that then it ain't my problem kid\nY'all niggas gotta eat, we gotta live, yo\nWe all gotta eat and gotta live\n\nDcq:\n\nReflection Eternal\nThat's the name don't forget it, Talib Kweli, DJ, Hi-Ti-dek\nBrooklyn! New York City\nCin-ci-natti! Keep on!\n\nTalib Kweli-Verse 2:\nWe remain, hotter than the blue part of the flame\nI got a Glock in my brain\nThat baffle weapons inspections like Saddam Hussein\nAnd rocks with the impact\nGettin beat with socks filled with ten-packs of tokens\nMen's backs get broken when I get open\nWords more than spoken\nMost of dem MC's on the first thing smokin\nLeavin town at the same time causin traffic on the interstate\nWe stay droppin classics cause the key word is innovate\nThese cats is so plastic that we call 'em laminated\nTried to duplicate the style quickly got frustrated\nMore desperate than dudes who search people's ashtrays for clips\nI burn MC's like Coca-Cola through the paint on your whip\nShit! My rhymes is like a magnifyin glass\nWhen I shine my light through it, I burn up everything in my path\nLast Dragon like Lee-roy (sho' nuff) rock for the b-boy\nMy rhymes are so sharp you catch cuts that key-loid\nDestroyed the decoy, most of y'all d-boy, my culture\nIt's not that I hate, y'all just p-noid cause y'all fake\nEmbarassed and ashamed and don't know where to put the blame\nAnd never hesitate to call out my name!\nI ain't effected by the negative\nIt's the Reflection and we dealin with the positive\nIt's for the love and cause of that we got a lot to give\nIt's the Reflection kid\nNever gotta look between the lines to get the messages\nYou're too sensitive, checkin out our references\nThe turntable and microphone specialist\nIt's the Reflection kid, it's the Reflection kid\nIt's the Reflection kid, like that like that\n\nDcq:\n\nTalib Kweli (Talib Kweli) DJ Hi-Tek (DJ Hi-Tek)\nBreak it down, for you and yours (y'all know what time it is)\nYou fuckin with Kweli, you fuckin with Brooklyn\n(Tired of hearin all this) don't wanna hear none of that\n(is is my fam really nice..)"}], "artist": "Talib Kweli"}