{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/307e203ec9caa0adc017d870d8f2ed88.400x400x1.jpg", "title": "25 Wives", "year": "2011-10-17", "album": "Tell Ya Friends", "lyrics": "[Intro]\nYea\nChip, check it out\n25 wives\nWish I could have\nIf I could have 25 wives\n\n[Verse 1: King Chip]\nJust me with all y'all, that'd be so wonderful\nMake daddy proud, I love every one of you\nMy angels, I feel like Flava Flav but sexier\nThe sex is gonna be messier\nBut ain't gonna be no stress in here\nWe living good all of us, we winning, that's obvious\nWe got whips, Cars R Us, we smoke good, it's foggy\nPlus the status: they all mad at us\nTeamwork, that's our recipe for living lavish\nYeah, we get this cabbage\nI'm the head coach of the team\nIf everybody play their position, we can win this thing\nCalled life, happiness, liberty, freedom\nIf I got all y'all, there won't be no sense in cheating\nY'all the truth, got a connection with you all\nAmbisexuals, if this ain't Heaven what's it called?\nMust be life, no greater feeling in the world\nIf I had 25 wives, I would love all my girls\n\n[Chorus]\nI wish I could have 25 wives\nWe'd all get it poppin, we'd all get high, that's fly\nIf I could have 25 wives\nI'd love them all like they love me\nWe hustle to survive\nI wish I could have 25 wives\nWe'd all get it poppin, we'd all get high, that's fly\nIf I could have 25 wives\nI'd love them all like they love me\nWe hustle to survive\n\n[Verse 2: Wale]\nGot women in every city. Winning in every city\nHer body's been paranormal since buying that pair of titties, look\nSilicone bitches got the confidence\nBut natural bitches get all my compliments\nI ain't trying to conflict\nNickels to dimes and shit\nMake something out of nothing. Nigga, I MacGyver that bitch\nNiggas wild as shit\nNo rubber, just climb in that bitch\nTake your hat off and get to cuttin: Kung Lao on that bitch\nMortal Kombat, my shit is beyond rap\nI keep it 100 nigga, Warren Moon, Warren Sapp\nHit, I never call her back\nBet she keep on coming back\nYou keeping her dry, shit, I named that bitch \"Tsunami Cat\"\nI'm too polished, I ain't looking for acknowledgement\nPut my squad on my back like I'm wearing me a starter jacket\nYall lame niggas\nNo bitches when y'all are out\nI get that Ivy League brain, catch me with a Dartmouth\n\n[Chorus]\nI wish I could have 25 wives\nWe'd all get it poppin, we'd all get high, that's fly\nIf I could have 25 wives\nI'd love them all like they love me\nWe hustle to survive\nI wish I could have 25 wives\nWe'd all get it poppin, we'd all get high, that's fly\nIf I could have 25 wives\nI'd love them all like they love me\nWe hustle to survive\n\n[Outro: Wale]\nIt's Double M-G yo\nIt's nothing but a motherfucking undefended free throw\nI'm getting each ho\nEyes lower than Ichiro"}]}