{"songs": [{"title": "500 Homicides", "album": "Remember My Name", "year": "2015-05-29", "image": "https://images.genius.com/d8603b87de8ec5fae2e52a2e68345725.1000x1000x1.jpg", "lyrics": "[Intro]\nOh! These niggas ain't gangstas\nStay tryna take my lil homie off the streets huh\nFree 'Nine bitch!\nWe still got real niggas out here (so everybody gangsta now huh?)\nWhere you from nigga?\nFree the guys man, you ain't from where we from\nI told my niggas we gon' make it man\nIt's a fucking movement man\nWe a fucking family, we ain't a gang\nOTF (Squad)\n\n[Verse 1]\nThese niggas is bitches, getting info from bitches\nGo and tell to the piggies\nI'm tryna get riches, and stay on that business\nFree bro, niggas snitching\nMy case almost over, you lucky one pending\nI put 2 in his lemon, this 4-5 a lemon\nExtended clip for his niggas\nAnd he ain't shit to his niggas\nWe don't hesitate, from DeeDee and BayBay just know that the opps ain't never safe\nLoad up the Glock, and reload the 8\nDo a drill on the op, no clones I see dots\nACG's, Free the Guys shirt, and one pair of rocks\nI'm on the block\nHope my tape don't flop, and it go gold when it drop\nI'm not a liar, start D'ing them baggies, and we risking indictment\nJust to get flier than a first class ticket, United\n300, O'block\nMurder murder, kill kill, in the jam I'll never squeal\nMy label only time I deal\nI fuck with G's, B's, Moes, Kings,  Snakes, 4's and the niggas under Neal\nSilver spoon, you don't know how hunger feel\nDreaming 'bout 100 mil, step on that curb with 100 pills\nWestern Union money to bro and them, in the cell doing 20 years\nAnd I lost a couple of these niggas, and they ain't never seen 20 years, oh\nBro died when I was out of town, shit happened I’m not around\nSlide through every opp block and we up shots till they not around\nWhat's up with this twitter beef?\nThought we was keepin' it in the streets?\nThey mad I'm in the winner seat, from the summer time 'till winter breeze\nAnd choppa squeeze, bitch go blaat, blaat, blaat!\nI ain't even gotta rap, (rap, rap) Rex nem in the trap (trap, trap)\nOne time no light bulb, bro n em got a lamp, (lamp, lamp)\nWhere you from you ain't stamped (stamp, stamp)\nNiggas know we the champ (champ, champ)\nGot niggas sneak dissin', it ain't rap\nMake a real nigga gotta spit facts\nGot some niggas saying keep it only rap\nThat's how these old niggas stay on the map\nHeadshot, we ain't getting into that\nNiggas tellin' hands full of pens and pads\nGrab a pack, blood bleeding real bad\nDoin' hit in a coupe, in a Range, or an Audi\nFuck a nigga doubt me\nAll on my dick when they see me\nKnowing this bitch wanna be me\nHell yea you can die over a retweet\nI'm grabbing my pole on mimi\nI can't see a nigga like Stevie\nI won't tell, I'll take me a BG\nLet's get it!\nGANG!"}], "artist": "Lil Durk"}