{"songs": [{"image": "https://images.genius.com/508b912f569b8bb0c6714a8272e0e931.400x397x1.jpg", "title": "24 Shots", "album": "Gory Days", "year": null, "lyrics": "[Verse One]\nMy shit's straight vile\nYou're mild, you've got no style\nI won't be impressed 'til you possessed by Belial\nI make beats like surgeons resume\nTo stitch up your wounds\nInside the emergency room\nThey must work urgently or you'll permanently be in a tomb\nYou seein' the clergy soon\nI'm taking this rap game serious from the start\nMake your chest cut open with scalpel holding doctors working on your heart\nPlaying fucking God\nLacerating to pieces of lard\nLike vultures ripping Jesus apart\nYou're chopped up and divided in cubes\nMy tracks pump like blood pumping through I.V. tubes\nThe human body gore who the fuck created it?\nVeins and brains are insane it's some creative shit\nSatanic organs\nMelodies of morbidness\nOver the ramming sword of sicknesses the world's all been dissed\nYou rap like a cadaver\nThere's no life in you\nI should stick a knife in you\nRight through your windpipe will do\n\n[Chorus 2x]\n24 shots in your head\nI know you're dead but I want to make sure you're dead\nSo I pump 4 more in your head\nWith the Beretta you're dead but I want to make sure you're deader\n\n[Verse Two]\nMy pumping tracks hit you like gun shots fire crackers\nAnd jumping jacks wrapped into one attack\nThis year, is just another point in time\nAnother year time devours the joints in your spine\nUntil you're stressed\nWith no credentials left\nJust your essential breath and the potential death\nIt's maggots and blindfolds, winter jackets and rifles\nCaught up in the cycle of psychos\nIt's when your life goes\nI'm done with babbling, a kid disses and I grab him then I'm gonna stab 'em\nSon you're ain't fronting on my album\nSpitting on your bitches tits\nThey shift the shit\nMy pistol grip is sadistic like Mephisto clique\n\n[Chorus]\n\n[Verse 3]\nNow since World War 2 has a rapper slaughtered you\nWith the impact of Necro's rap\nIt's morbid truth, in fact\nNot since the first sin, has a poet created grim verbatem like me\nMaking the industry cringe\nI've had a profound effect\nMy angle has strangled the underground like a noose around the neck\nMy first radio coverage introduced you to being bludgeoned\nAnd took you through the brain of a Brooklyn kid that was thugging\nNow I've got hundreds loving\nWho would have thought I'd be considered the greatest cat\nExplaining the verbal onslaught\nNow everyone's objective is directed towards finding a Necro record or a\nFreestyle where I wreck the respected\n\n[Chorus]\n\nDIE!"}], "artist": "Necro"}