{"songs": [{"image": "https://images.genius.com/369afe88f604eba1cc44f9cb55ac50c7.1000x1000x1.jpg", "title": "Hot Now", "album": "AI YoungBoy 2", "year": "2019-07-08", "lyrics": "[Intro]\nBeat Execs\nGuwap\nMarcuss, you killin' the beat\nKeep up, I like it, drive me all insane\nNiggas want to test us, 45 sidekick\nYou can try to cuff, I let it up and bust your brain\n\n[Chorus]\nChoppers out, many men, baow, baow\nBaby girl, I need that fan 'cause I'm hot now (I need that fan)\nBroke ass niggas with that playin', they get shot down (That playin')\nPlenty money, bitch, come on my land, see what I got now\n\n[Verse]\nGet shorty on them Xans, she get to spinnin' like a lighthouse\nI'm walkin' through the mall, I'm tryna figure what the hype 'bout\nYou dumb lil' nigga, I ain't with that talkin', you'll get piped down\nShorty tryna to fuck, I told her hurry and come pull up now\nShe said, \"Where you get your car? 'Cause I like it\"\nI said, \"That's funny, it don't cost that much\"\nShe said, \"Why you totin' that gun? I'd rather you just fight, kid\"\n'Cause the day I put it down'll be the day I'm out of luck\nBitch, give me the recipe, this shit is gettin' the best of me\nI need a beat through the headphones\nThis money, it ain't shit to me, your bitch'll dig a ditch for me\nPlus he'll bat you in your shit with that chrome (Bitch, lay down)\nI pulled up, jumped out, loaded, geeked\nBitch, don't come approach the heat\nI'm focused, nigga, what the fuck you on? (What you on, bro?)\nTwo hundred thousand in the bag on me\nFortnite is the last release\nThey got the nerve to still be dissin' in they songs\nThey ain't even on\n\n[Chorus]\nChoppers out, many men, baow, baow\nBaby girl, I need that fan 'cause I'm hot now ('Cause I'm hot now)\nBroke ass niggas with that playin', they get shot down\nPlenty money, bitch, come on my land, see what I got now\n\n[Post-Chorus]\nShe said, \"Where you get your car? 'Cause I like it\"\nI said, \"That's funny, it don't cost that much\"\nNiggas wanna test us, 45 sidekick\nI hope these fuck niggas came with some luck\nKeep up, I like it, drive me all insane\nNiggas want to test us, 45 sidekick\nYou can try to cuff, I let it up and bust your brain\n\n[Outro]\nMmh, ah\nChoppers out, many men, baow, baow\nBaby girl, I need that fan 'cause I'm hot now\nBroke ass niggas with that playin', they get shot down"}], "artist": "YoungBoy Never Broke Again"}