{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind", "title": "Raspy Shit", "image": "https://images.genius.com/a7c7371c883ae1d1241073cd59f52564.1000x1000x1.jpg", "lyrics": "[Intro]\nUh, a lil' better\nYep, lil' Skateboard P, haha\nYessir (hot), yessir (hot), yessir (hot), yessir\n\n[Verse 1]\nMa, the way you huggin' on me, it's a problem\nThe fuck you tryna end up in the gossip column?\nI know I got jewels like I'm the pharoah of the ghetto\nBut we are and it's a bright-ass shiny Carerra\nStickin' your feet out the window so they can see your stillettos\nCost a thousand dollars, same as your housing holla\nNot to mention the wrist and the thirty thousand collar\nPussy must be good, he's victim to your power\nShit, nigga like me? I would never allow it\nSpit that shit to me, I would ask you, \"Have you showered?\"\nYou wanna get up in my boat and ride\nTake pictures with the kid up in Ocean Drive\nGo to Casa Tua and just sip on Calouas\nAt the bar, talkin' to other women about the best jewelers\nYou like that, huh? Smilin' still, call your girlfriend (Why?)\nYou fell asleep at the wheel\n\n[Chorus]\nDon't try to come up on my ear talkin all that raspy shit, raspy shit\nDon't try to come up on my ear talkin' all that raspy shit, raspy shit\nDon't try to come up on my ear talkin' all that raspy shit, raspy shit\nAnd don't try to come up on my ear talkin' all that raspy shit\nTryna ask me shit, c'mon\n\n[Verse 2]\nAyo, I walk in brashest, certainly the crassest\nThe restaurant's classes, the owner is asses\nShit, my money green like the helmet of a fascist\nSo what you want – Patron or Petrucia glasses?\nAin't no mystery, his daughter know the history\nAnd every night we toast like it's victory, get with me\nAnd I ain't changed since my early mental\nI been snackin' on shrimp and sippin' on Shirley Temples\nNo drug to drinkin' – what you want?\nNo, seriously, what you thinkin'? Since the Yukon\nNever puffed a J, you can ask Loushawn\nBack when he pushed beige like it was coupons\nWith a house full of dames like it was Moulin\nI would ask they names, but they would only do Sean\nAnd I ain't sayin they regret it, but fuck it, they do\n'Cause if they could reverse time, nigga\nWhat would they do, huh?\n\n[Chorus]\nDon't try to come up on my ear talkin all that raspy shit, raspy shit\nDon't try to come up on my ear talkin' all that raspy shit, raspy shit\nDon't try to come up on my ear talkin' all that raspy shit, raspy shit\nAnd don't try to come up on my ear talkin' all that raspy shit\nTryna ask me shit, c'mon\n\n[Verse 3]\nHoneys Panamanian, eyes like Iranian\nLighter than the blue of the sky of the day we in\nAss like a volleyball, the kind that make your dick hard\nHead to the hustlers, so sweet she could get cars\nNow she here with me, lil' Skateboard P\nCheaper than the sound of a bird that chirps\nI spit, then I hit, then I murk, yessir\nA flick chico stick and a Twix, that's her\nShe admire how the champion live\nHow I signed Slim Thug with a ramp in my crib\nI'm a champion, I do as the champions did\nExcept I improve with the new and the rest get rid\nBut some of y'all don't like that, it's easy tryna bite back\nInstead of sayin' hi, gettin' fly, but I'll be right back\nMy dude got the steel if you think you fly\nShoot the wings off your ego and watch you skydive, yessir\n\n[Chorus]\nDon't try to come up on my ear talkin all that raspy shit, raspy shit\nDon't try to come up on my ear talkin' all that raspy shit, raspy shit\nDon't try to come up on my ear talkin' all that raspy shit, raspy shit\nAnd don't try to come up on my ear talkin' all that raspy shit\nTryna ask me shit, c'mon", "year": "2006-07-25"}]}