{"songs": [{"lyrics": "[Intro]\nJigga, Vol. 2 bitch\nYeah\nFuck Judge Wapner, it's Jigga\nYa heard?\nY'all niggas in violation of the \"Player Hating Code\"\nSession 1001\n\n[Verse 1]\nYo, I gives a fuck if you traum'd up\nDom Perrignon'ed up\nNiggas from where want what?\nOne slip'll get your cherry bombed up\nI got heavy arm\nAnd my niggas Homicide and Deadly Calm in the cut\nB, test your dumb blonde luck\nFuck with the wrong one\nShawn gun, harm one, two, fuck y'all wan' do?\nBastards, niggas know I blast quick\nAs if y'all had to ask, shit, get your ass twist\nIt's the rap's El Niño, get your brain splitted\nAnd I don't like pussy well enough to hang with it\nYou ain't with it, same shitted\nThey can't fuck with the languaddage\nSoon as the slang's spitted, if you came you get it\nPlain as a game with them thangs with it\nOn co-sign and the whole nine\nLeave you where I find yo ass, lost with no sign\nYou're so wrong\nI'm the last nigga to roll on\nGot a vest on, went to Folsom\nWhen you guess wrong I'ma press one\nMotherfucker\n\n[Chorus]\nFuck the judge, fuck the jury, when you're warring with me\nIt's People's Court, we hold court in the street\nI gives a fuck about the D.A\nWhen you see Jay, better crawl for your heat\nIt's People's Court, we hold court in the street\nYa heard me?\nFuck the judge, fuck the jury, when you're warring with me\nIt's People's Court, we hold court in the street\nI gives a shit about the plaintiff\nNigga, dangerous, watch your language with me\nIt's People's Court, we hold court in the street\n\n[Verse 2]\nI give a shit if it's small claims like stealing your bitch\nOr if it's Supreme Court like stealing your bricks\nLook, my guns is all-range, more pain\nIndifferent to whether you're big money or small change\nWhen I cock it, ball game\nMy pistals never miss-trial, here's the determent\nWith no chance of parole, bullets coming concurrent\nI'm like \"Why, nigga? Try Jigga\" You must remember\nIt's like being on trial for your life with a public defender\nLet the jury fill the seats up, and start the court calendar off\nWith docket number 9mm\nAll rise\nThe Honorable Jay-Z presides\nInstead of a mallet, I hold a tool\nAll objections over-ruled\nSave your opening arguments, hope you understanding\nTwo guns, right over left, that's how I cross-examine\nLike Tom Cruise, pop 'em with the Top Gun, you lose\nJigga's no lie, and y'all can't handle the truth\n\n[Chorus]\nFuck the judge, fuck the jury, when you're warring with me\nIt's People's Court, we hold court in the street\nI gives a fuck about the D.A\nWhen you see Jay, better crawl for your heat\nIt's People's Court, we hold court in the street\nYa heard me?\nFuck the judge, fuck the jury, when you're warring with me\nIt's People's Court, we hold court in the street\nI gives a shit about the plaintiff\nNigga, dangerous, watch your language with me\nIt's People's Court, we hold court in the street\n\n[Verse 3]\nNo flow's sicker, no cell can hold Jigga\nSince I dropped Reasonable Doubt, no coke can convict us\nNo contest in a rhyme fest, I'm best\nUnder oath raise my right hand, and I spit it honest\nKnow your facts for real, 'fore y'all decide to act ill\nWhen you blow trial ain't no coming back on the pill\nIt's Murder One, bail set at a, half a mill\nIt's Murder One, for you backwards motherfuckers: red-rum\nCommit hate crimes, fake rhymes I hold in contempt\nYou get state time for faking like you greater than him\nSo cop a plea, to lessen charges, pay your fine at the Desk Sergeant\nSay you're sorry, then take your property\nI be sho' defended, flow splendid, no co-defendant\nWhile you niggas hold trial with no motions in it\nThree time felon, third album, locking it down for the term\nOf Lifetime, Vol. 2, nigga, court is adjourned\n\n[Chorus]\nFuck the judge, fuck the jury, when you're warring with me\nIt's People's Court, we hold court in the street\nI gives a fuck about the D.A\nWhen you see Jay, better crawl for your heat\nIt's People's Court, we hold court in the street\nYa heard me?\nFuck the judge, fuck the jury, when you're warring with me\nIt's People's Court, we hold court in the street\nI gives a shit about the plaintiff\nNigga, dangerous, watch your language with me\nIt's People's Court, we hold court in the street", "title": "People’s Court", "image": "https://images.genius.com/b74aec2e8ac2501b6721c42b36005b7f.600x595x1.jpg", "year": "2000-08-29", "album": "DJ Clue Presents: Backstage Mixtape (Music Inspired by the Film)"}], "artist": "JAY-Z"}