{"songs": [{"title": "Odds", "lyrics": "[Verse 1: Young Dro]\nStock broker, NASDAQ, helicopter pad cat\nBitch, where yo' ass at? I'm sitting up in this brass Lac'\nPlease, bring the gas mask, you know I got that gas back\nYou ain't got no ass at all, where the fuck is yo' ass at?\nBoing! Just, I suggest that we should go and grab that\nProject shawty, I am in the cut right where the path at\nFuck all that bullshit, this where we do the math at\nShow me where the cash at, I take off like a half back\nMafia, capisce? Dining at Joe's Crab Shack\nPull up in the Lamb', tell my bitch she could have that\nWestside mansion, this where I take my bath at\nAfter she get through serving me head, where her cab at?\nUh, I'm in the lab, black\nYou told me shawty life wasn't cool, so I declared that\nKidding me? Shooters in Italy, ask Sal that\nSpit a nigga up, when they find him, they bring half back\n\n[Hook: Forgeeauto & Young Dro]\nSeventeen chains with eleven rings\nMr. Oddball baby, changing up the game\nThirties on the Range, same color cocaine\nNew dimension system, trunk on Liu Kang\nAmtrak stacks, call me Mr. Soul Train\nAviator kush pack, Mr. Soul Plane\nFat as Ben Frank, money in the bank\nDiamonds chlorine, me, myself and Irene\n\n[Verse 2: Young Dro]\nBitch, I'm in the Z like Zorro\nWhen I come through, I'mma come for something\nBoo bring the nine-tails, Bobo bring the pump or something\nWhen I see ya bitch, I'mma put four in his confidant\nKill him for breakfast, I'mma eat his homeboy for lunch\nMashing out, I'm the same nigga that they asking bout\nKick it like Liu Kang, it's time to bring the action out\nI'm the real, sole controller of this monopoly\nGet wrong for real and I'll knock you off properly\nGotta be on top of my shit cause you ain't hot as me\nNiggas can't be me in the hood but they try to be\nNo! You are not Dro, motherfucker\nYou know you a hater, you a ho, motherfucker, nigga, Dro!\n\n[Hook: Forgeeauto & Young Dro]\nSeventeen chains with eleven rings\nMr. Oddball baby, changing up the game\nThirties on the Range, same color cocaine\nNew dimension system, trunk on Liu Kang\nAmtrak stacks, call me Mr. Soul Train\nAviator kush pack, Mr. Soul Plane\nFat as Ben Frank, money in the bank\nDiamonds chlorine, me, myself and Irene\n\n[Verse 3: Mac Boney]\nIt's obvious, I come at these suckers at another angle\nPicasso of my time, I'm a different painter\nThrowing ones at a dime, she a perfect stranger\nI shot my pistol in the sky, almost hit a angel\nAin't afraid to die, I'm in love with danger\nI'm a lion tamer, I'm a ho trainer\nYo' bitch, she fuck with us, that's a no-brainer\nShe a slow brainer and a fast learner\nShe a bad bitch so she a good earner\nI get to Ike-ing on yo' ho, she act like Tina Turner\nI get to playing with these racks, it ain't safe, bitch\nSmash you in yo' face with this cake, bitch\n\n[Hook: Forgeeauto & Young Dro]\nSeventeen chains with eleven rings\nMr. Oddball baby, changing up the game\nThirties on the Range, same color cocaine\nNew dimension system, trunk on Liu Kang\nAmtrak stacks, call me Mr. Soul Train\nAviator kush pack, Mr. Soul Plane\nFat as Ben Frank, money in the bank\nDiamonds chlorine, me, myself and Irene", "album": "High Times", "year": "2013-10-15", "image": "https://images.genius.com/301c5442f3c36df0f9bc84839ae91216.640x640x1.jpg"}], "artist": "Young Dro"}