{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/38ab7a32a309b05605c3809b7bae8a2d.750x750x1.jpg", "year": "2019-04-18", "title": "God’s Warrior", "lyrics": "[Intro]\nYou know everything a nigga say be facts man like\nI hope they don't play this shit in court one day\nIf you look up some of the stories in my city\nYou will see the relation between the music\n\n[Verse]\nEverybody with me clumsy, we all be droppin' shit\nDroppin' niggas, droppin' icy kids\nFuck a bitch, drop her at her momma crib\nNot with the gossipin', we do that robbin' shit\nAny means, I'm gon' eat\nSlide with the tank on full (Yeah)\nLeave with the Glock on E\nI got a K, it hold a hunnid\nBut I got lazy, only put 90\nMoney make your whole team vanish\nThat's a paper trick, Origami\nI be dolo, don't need a posse\nIf you got the wave, I got the tsunami\nChain hit like Ike Turner (What else?)\nBut I don't beat bitches, I beat bodies\nI just bought some chain reactions just to stomp a nigga in Versace\nCall me Martin, I stay with the Tommy\nYou lookin' for me, pussy come find me\nAnd I'm not gon' snatch your chain, I'm gon' take it off politely\nSo when I go back to sell it, it's not damaged, not even slightly\nRaised around killers, that's how I'm cut\nFound out where he stay, don't shoot the house up\nLay in they bushes 'til your legs lock up\nWhoever walk outside first, drop some\nLift that chopper up, go nuts (Go nuts)\nThat was his momma, so what? (Fuck it)\nNigga that's your fault, we wanted your blood\nAnd your bitch take dick like a grownup\nI'm a product of them streets (Yeah)\nSharks and hustlers, I'm from the D (Yeah)\nBring a nigga to the feast (Yeah), we not stingy, homie eat\nHe get greedy, put him to sleep\nThey gotta identify him by his teeth\nWe gon' kill you if you freeze\nWhen your job was to squeeze, nigga\n\n[Verse 2]\nI got an Uzi and sound like, boom! (Ooh)\nI got a Draco and it sound like, boom! (Sheesh)\nKnock your shit open, the bullets explosive\nFall and you getting stood-over (Come here)\nCan't run out of bullets in a shootout\nTaking my time counting as I'm blowin'\nYeah, drumsticks, guitar-sized AR's, we a little band\nRapper diss me, I'm at every show like I'm his biggest fan\nHollows in that Sprinter Van gon leave somebody crippled, man\nYou see your DJ brain come through his head\nYou'll turn religious, man\nHaving my way, him see us up at the range, that's practice, okay?\nDead bodies in the hood, pour acid on it for rapid decay\nGranny don't even know the savage she raised, nigga (Savage she raised, nigga)\nAyy, 200k get you took off the planet today, nigga (Holy water)\nAyy, nigga hoes, I don't feel 'em (Feel 'em)\nCut his head like a deck, let his homeboys deal him (Bitch)\nFuck who rockin' with him\nCatch his bitch at the mall while she shoe shopping, nigga\nDon't let him dive, just shoot out the windows, that's how I'm coming (That's how I'm coming)\nYou not faster than no bullets, why is you running? (Fuck is you runnin'?)\nI be talking to my Glock like, \"You be buggin'\" (Bitch you be trippin')\nI put Forgi's on my drop, them bitches rubbin' (Skrrt skrrt)\nThey like, \"Grizzley, bro you rich, why is you thuggin'\"? (Why am I thuggin'?)\nBig Meech was rich, ain't nobody asked him why was he hustlin' (Why was he hustlin'?)\nWhat y'all need to ask is these niggas why they be bluffin' (Fake ass niggas)\nTook my FN off my hip like, \"You've been summoned\" (Bop!)"}], "artist": "Tee Grizzley"}