{"songs": [{"year": null, "title": "Mourning Aftermath", "image": "https://images.genius.com/ac9e0f11c62005e2d424955c950a2944.300x300x1.jpg", "lyrics": "I know I look good\nStop sweatin' me\n\nI'm makin' myself look pretty\nI'm makin' myself look pretty for you\nI'm makin' myself look prettier\n\nLet me rub my back against the notches on your bedpost\nTo scratch these afterthoughts off my flesh and shed ghosts\nMy head's close to your closet door\nI've got the glass to my ear. My nose is in your\nBusiness (I smell something fishy here.)\nI hear bones rattling. Poems battling for space and time\nPhones that'll ring when I make judgment calls with pick-up lines\nSexual hang-ups leave me waiting nude and while alone\nIt gets aggrivating masterbating to a dial tone\nI'm the home to run-away trains of thought\nMy one track mind is a collision intercourse where victim's cross\nBedroom eyes...uncross their legs exposing inner thighs\nI disrobe and show my most convincing disguise\nI've lived so many lives each death has left my face scarred\nHid so many lies under my breath that I can't face God\nDig into my mind deep enough you'll find a graveyard\nI get nervous bodies will resurface every time it rains hard\n\"Don't cry, girl.\" Let me outline your short comings\nMy world is full of them and they're all in the long runnings\nIt's all fun and games. It's all done in vain. It's all a ----ing shame\nI ain't the one but I'm the one to complain?\nMake love to the present, fuck the past\nMake love to the present, fuck the past.Nothing lasts\nDon't you dare worry about the morning aftermath\n\nI'm makin' myself look pretty\nI'm makin' myself look pretty for you\nI'm makin' myself look prettier\n\nTaking an acid bath, pissing on the shower curtain\nThe gal just laughs and starts dissing my towel turban\nI had to ask if she knew how to listen now I'm certain\nNow my task is just to get up in her like I was a surgeon!\nI'm a virgin who makes exceptions at sunset\nMy dirty skin gets cleansed by the summer sweat\n\"Self, have some respect! I don't need you new and clean\nBut I don't want the procedure routine!\"\nA screw machine!with a few bolts loose.robot response touch tone\nHair trigger, happy-go-lucky emotion monger wants a love poem\nRun home.dip into your closet and jump bones\nYour secret admirer's stuck higher up and he's unknown\nLooking down on you.can you bare the burden?my ears are hurting\nI found a few gears are turning\nWith squeaky wheels.they get the grease cuz its a damn nuisance\nUnderstand the blueprints for our mechanical movements\nIt never ran smooth since we abused the Earth\nGrabbed a hand full of pubics and removed the turf\nRefused its worth, we lose our shirts.she assumed the worst\nAnd needed proof of birth? I'm leaving this universe\nIt seems doomed and cursed.see if you come first then come fast\nComplain.Constrain.Constantly ask\nComplicated questions contain scientific answers in your flask\nCome and bring us (Confidence). Cunnilingus (Compliments)\nCome to thank us went from guilty conscienceness to common sense\nOur Common ground meat from man-made concrete\nMake love to the present, fuck the past\nMake love to the present, fuck the past.Nothing lasts\nDon't you dare worry about the morning aftermath\n\nI'm makin' myself look pretty\nI'm makin' myself look pretty for you\nI'm makin' myself look prettier", "album": "Personal Journals"}], "artist": "Sage Francis"}