{"songs": [{"lyrics": "Nobody feels like a G feels\nWhen he post up his '64 on three wheels\nDaddy ask me \"what you wanna be when you grow up?\"\nA low rider with some Colt 45 in my cup\n\nI was on my way to college and then saw\nA Cadillac three-wheeling down Crenshaw\nIt was nineteen hundred and eighty three\nI knew exactly what the fuck I wanted to be\nA low rider, bass provider, drop down like a spider\nSpy the hood rat and go straight inside her\n\nBut if she buttless\n...bitch can't ride in my Cutlass\n\nMonday, Tuesday, Wednesday, Thursday, Friday\nRunning them red lights sideways\nIn the parks and streets, brothers keep dying\nBut I drop the back and let the sparks keep flying\nMy daddy wanted me to take the Daytons off the Dodge\nCause the 'baseheads keep breaking in the garage\n\nI keep sagging in my 'lac with my butt out, I strut out\nLook at my two front tires, you know I cut out\nI took from the ghetto what I could take\nBut you can't take my P.O with the metal flake\nI'm a knucklehead buzzing off of alcohol\nMessing up a new car for no reason at all\n\n[Hook]\nHit the switch homeboy, Hit the swiotch\nStop acting like a little old biotch\n[X2]\nFront and back homeboy front and back\nBlaze the sac and pass back my yack\n[X2]\nThree wheels homeboy, three wheels\nLet me see your low rider G skills\n[X2]\nOne switch, two switch, three switch, four\nOh my God, my battery's low!\n[X2]\n\nCali, Cali swangin'\nSound, system bangin'\n[X2]\n\nCan't stop sporting them all-stars\nCan't stop driving them gangster cars\nNew cars just don't appeal to me\nIt's 2004 and I'm a still a G\nCops don't want brothers loiterin'\nGangbangers drive by and start slaughterin'\nSo they talk a lot of smack and write a fat ticket\nBut I drive around the corner, come back and still kick it\nGotta sell wheatgerm and crack, so\nI can have money just in case I break a axle\nI turn my music up loud to attract a crowd\nThrow the hood out the window, make the homeboys proud\nKeep my kahkis creased right with my girl in my ride\nI used to be local but now I'm worldwide\nAfromanmusic dot com blowing up like Vietnam\n\n[Hook]\n\nAf-ro-man-make the Cadillac coupe pan-cake\nLock it up, cock it up\nPost on threes, twist on Ds\nAfro as you ride her, Cadillac walk like a spider\nSmash out fast then dump her, sparks straight flying from the bumper\nWorld. Wide. Hungry. Hustler, hit that switch don't be no buster\nHop in the coupe like a toad frog, go swoop up your role dog\nCali Swangin' K.J., Go way back like heyday\nSix stray, six 'fo\nA. F. R. O\n\n[Hook]", "title": "Cali Swangin’", "album": "My Fro-losophy", "image": "https://images.genius.com/c4fd850563348aed762e3d484ea76e19.500x500x1.jpg", "year": null}], "artist": "Afroman"}