{"artist": "E-40", "songs": [{"title": "Brownie Points", "image": "https://images.genius.com/841113c618ea11b5cbd44a43565e925e.788x768x1.jpg", "album": "Charlie Hustle: The Blueprint of a Self-Made Millionaire", "year": "1999-11-09", "lyrics": "[A-1] Yeah\n[E-40] Seven-oh-seven\n[A-1] Yeah.. Charlie Hustle\n[E-40] Playa, playa\n[A-1] What's wrong with these old niggas man?\nD-Day, what's wrong with these niggas?\n[E-40] What's wrong with these niggas?\n[A-1] This fuckin game.. tryin to get brownie points and stripes\n[E-40] Smack points (yeah) yeah\n[A-1] You got somethin for these old niggas doe\n[E-40] What we got fo' em big balla?\n[A-1] Yeah, yeah, yeah\n[E-40] BEOTCH!\n\n[A-1]\nWhat's the subject? Fo' brings niggas they Kotex\nWhere we reside I creeps my ass up inside\nAnd smash these brownies off in his FACE\nThat I done shitted and pissed on, dude, HOW THAT TASTE\nCatch him out his place, out of his area\nWith his nephew and his niece, ooh, the more the merrier\nNigga tried to fuck mines off (what'd he do?)\nTried to gauge the porch with my broads on Watoo\nDude you done broke fuckin code\nI'm finst ta dump drop clip, dump-drop-clip reload\nBe like I can motherfuckin explode\nTalkin about I'll be fuckin all kind of women\nThat's B-R-P, Blade Run or Pimpin\nOnce upon a time there was this guy named Dane\nTried to fuck my bitch, but he Kris-Krossed game\nI don't owe this motherfucker in the first\nBut he done made livin in my house a whole lot worse\nTryin to gain some stripes\n\n[E-40]\nIt's nothin nice -- READ HIM HIS RIGHTS\nCollar him and laugh, rollin over and politickin with the vice\nCrackin under pressure, bust a pipe\nSnake eyes is crooked dice\n{\"Goin all up out your way just to get them brownie points\"}\nIt's steaks and knives -- READ HIM HIS RIGHTS\nSo-called best friend'll stab yo' ass in the back with a knife\nAnd try to, put yo' ass on ice\nFor brownie points and stripes, for brownie points and stripes\nNiggas'll take your life just to {\"get them brownie points\"}\n\n[A-1]\nYou niggas got me stuck what?\nWatchin y'all spit it and get it fucked up\nLucked up, my mobb niggas, yea we gon' bust what\nIf he isn't never see mail, cause that we sell\nDope by the truckloads, hoes can catch it retail\nMotherfuckers grindin but we all ain't played\nAnd all ain't paid, now watch em all get sprayed\nLaid back and watch him misprint it, we been spit it\nFor you newcomers who thinkin you done it, I put my fist in it\nLet yo' bitch get it, serve a D and watch a bitch split it\nIf I ain't wit it, it wasn't enough fuckin chips in it\nNiggas try to gain stripe, I flame mic\nGot em all caught up in the same shit, call it game tight\nKeep my name hyped, strivin to get my name right\nWhen it's fucked up, I'm the one you can blame right\nHatin on my niggas when I did the shit\nYo we the shit, represent this hogg ass bitch\n\n[E-40]\nIt's nothin nice -- READ HIM HIS RIGHTS\nCollar him and laugh, rollin over and politickin with the vice\nCrackin under pressure, bust a pipe\nSnake eyes is crooked dice\n{\"Goin all up out your way just to get them brownie points\"}\nIt's steaks and knives -- READ HIM HIS RIGHTS\nSo-called best friend'll stab yo' ass in the back with a knife\nAnd try to, put yo' ass on ice\nFor brownie points and stripes, for brownie points and stripes\nNiggas'll take your life just to {\"get them brownie points\"}\n\nYoung Mack Jr. ain't nothin but 14, Mack Jr. think he tough\nMack Jr. be havin problems with his stomach, throwin up that green stuff\nMack Jr. done tried everything (in the Bay) the whole taco\nMack Jr. be takin whiffles of that Khadafi and shovin it up his nostrils\nMack Jr. just got out the hall, Jr. I call your bluff\nJr. ain't to be played, Jr. quick to bust\nMack Jr. be geekin, Mack Jr. be havin withdrawal\nMack Jr. be tweekin Mack Jr. be workin hella close with the law\nI don't KNOW this motherfucker, never saw the dude\nBut Mack Jr. all the time be seein my viznideos on the tizznelevision tube\nFool know not that he'll blunder, I got yo' ass hypnotized, talkin about\n\"When you see that nigga E-40, Element of Surprise!\"\nOne of my fellas overheard about it in the pen, chopped a couple of kites\nTold me to be careful cause niggas'll take yo' life for braggin rights\nThat ain't fair so stop that baby attitude why do niggas gotta cheat\nDon't them niggas know I got enough fetti to put they whole fuckin family to sleep?\n\nIt's nothin nice -- READ HIM HIS RIGHTS\nCollar him and laugh, rollin over and politickin with the vice\nCrackin under pressure, bust a pipe\nSnake eyes is crooked dice\n{\"Goin all up out your way just to get them brownie points\"}\nIt's steaks and knives -- READ HIM HIS RIGHTS\nSo-called best friend'll stab yo' ass in the back with a knife\nAnd try to, put yo' ass on ice\nFor brownie points and stripes, for brownie points and stripes\nNiggas'll take your life just to {\"get them brownie points\"}"}]}