{"songs": [{"year": "2007-01-01", "image": "https://images.genius.com/1cb64c0085d6455fb32281de721131be.600x600x1.jpg", "title": "Play It (Remix)", "album": "50 Bodies Pt. 2", "lyrics": "[Intro: Big Shug] (DJ Premier) {Termanology}\nYeah man, all I'm sayin is (Remix...)\nJust play the music, play all of the music, man\nWe gotta keep some balance in the game\nY'know? Let it play man, f'real (f'real!)\n(\"Remix!\") Uh-huh\nBig Shug, Preemo, you know the deal\n{5'9\", Termanology! Singapore}\nJust play these records man, all of em\nDJs', all around the world\n\n[Verse One: Big Shug]\nThis year, I'm not fuckin with coward cats\nWho hide behind they raps and flashy Cadillacs\nScared of the battle raps and semi-auto gats\nBut wanna push wack rhymes from artificial cats\nThat wanna feel the purple haze and spots where cattle graze\nSwimmin pool with dime chicks, spendin happy days\nWith all my niggas blaze, honey dips gets glazed\nAnd I'm paid a hundred grand when I hit the stage\nThis is not a phase, it's a real, nigga's rage\nAnd I'ma make sure I get it before I'm back in the cage\nI promise to shoot and blaze, 'til my dyin days\n'Til DJs' stand and my music's played\nAny beef with me'll end in castastrophe\nI'm winnin while you losin, thats how it just has to be\nFrom the vinyl, to the CDJ\nGive the fans a chance to hear the fly shit I say\nPlay the record or get smacked clean\nWith another bangin joint from Big Shug and DJ Prim'\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it!\n\n[Hook: Big Shug]\nLet the music play, ayy  (\"You know we get down!\")\nLet the music play, ayyeyaay (\"On the microphone\" <- Erick Sermon)\nLet the music play, ayy  (\"Rhymes flowa like water\")\nLet the music play (\"Hip-hop~!\" <- MC Shan) Everyday\nLet the music play, ayy  (\"You know we get down!\")\n(\"The record is massive evidence of the\nFlexability and toughness, of the principles you perfect\")\n\n[Verse Two: Royce Da 5'9\"]\nThe rap game is the WWF, we inside of these steel cages\nOutrageous, things staged on real stages\nTakin pictures with the long faces\nTalkin hate shit, they +Hart Foundation's+ in the wrong places\nWhen it's on, niggas always do that +Snake+ shit\nTalkin to the +Jakes+ shit\n'til I have +The Undertaker+ toss you in that vase quick\nYou don't get no Take 6, this is not a flick\nThis is me, nigga, Prada kicks\nSickest nigga spittin, yeah, competition, not as sick\nI done penned a lot of hits, you should read the credits 'fore you play it\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it! (\"Play it\") Play it!\n\n[Verse Three: Termanology]\nYeah, aiyyo\nIt's only right I demolish any artist\nSemi-autos in my rhymes can describe some of my harder living\nLucky I'm not in prison, givin my momma heart attacks\nHow would my daughter to react to no father figure?\nThe streets raised me, the radio plays me\nPigs try to frame me, but nothin could faze me\nI'm crazy~! I got love for the radio stations\nBut you know, real shit never gets in rotation\nThey don't play it...\n(\"You know-you know-you know we get down!\")\n\n[Big Shug]\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it! (\"Play it\") Play it!\n(\"Play it\") Play it! (\"Play it\") Play it!\n\n[Singapore Kane]\nNo matter how you call it, garbage is garbage\nSo play the real hip-hop tracks, cause the true fans want it\nPreem lays the boom-bap with the scratch on it\nShug's the +Street Champ+, Singapore's who he spar with\nLife's a bitch, but I married her like Norbit\nThe sky's still the limit, I aim for the orbit\nPlay the record or get beat down, Diddy style\nChampagne bottle your dome, it gets pretty wild\n\n[Big Shug]\nThe +Team+ is now a +Dream+: Royce, Term, and Preem\nSingapore Kane spit fire to the brain\nNo excuses now, loaded up, bloaw!\nYou want a record you could play, here it go now\nStamp and approve it, let the fans move it\nYou ask for the real, this is how we do it\nPlay the record or get shut down\nOr get, slapped or clowned, gagged or bound\nPlay it! {*echoes*}\n\n[Outro: Big Shug]\nUh-huh, remix! It's what we do, man\nPlay the records man\nRoyce Da 5'9\", Termanology\nBig Shug, Singapore Kane\nAnd the incredible, DJ Premier"}], "artist": "Big Shug"}