{"artist": "I-20", "songs": [{"title": "Fightin’ in the Club", "lyrics": "(They fightin' in the club)\n\n[Hook] I-20 (2 Chainz)] (Repeat 2x)\nWe thugged out (Thugged Out)\nSo clear the club out (Club Out)\nNiggas get drugged out (Drugged Out)\nThey Say (They fightin' in the club)\n\n[Verse 1: I-20]\nDealer bitch, recognize, I'm back up on my grind ho\nNiggas talkin' this and that and wonder what I signed for\nOh, now you hatin' DTP, cause we got the game sold\nBottom line, you gotta problem, tell it to my 9, ho\nFuck ya boy, hit somebody, swing until a nigga dead\nChingy make her chicken-head, tell that chick to give me head\nYou can tie tonight dawg, Get em', peel em' roll on\nFeezy where dem' hoes at? Titty all the dro' gone?\nD my sister Shawnna man I hope Chi support her\nAnd tell me niece, Carma, I would die for her father\nI-20 is a street nigga, better recognize bitch\nWe ain't gotta go outside, we can do it in the filth\n\n[Hook]\n\n[Verse 2: Lil' Fate]\nNow you can catch me in that D&D & see them boys throwin'up they thumbs\nNorth-North run this bitch, nigga where you from?\nSouthside, Eastside, Westside they replying\nBoys throwin' signs bout to start a fuckin' riot\nBangin', niggas real gangstas in the M-Town\nBut I'm from the A so this the type of shit I been 'round\nNigga yeah fuck yall click, yall niggas wankstas\nThey got his ass beat with bottles, chairs and tables\nYeah!\n\n[Hook]\n\n[Verse 3: 2 Chainz]\nIt's a chair over there and a bottle on the left\nAnd nobody playin' fair every man for himself\nWhen push come to shove, shove come to push\nYou against us, nah us against you\nAll of us carry tools, lil' schooled ya whole crew\nYa prolly gon' run\nWhen the girls start screamin' \"I thought I seen a gun\"\nThey yellin' that \"They fightin' in the club\"\nYeah, got people doin' stunts\nGot people blowin' blunts\nGot people doing the ring\nGot people with sense\nYou need to stay low til' you get out this building\nFirst and everything, what about ya enemies?\nNiggas swing pool-sticks, niggas throwin' pool-balls\nNiggas throwin' bottles, niggas throw em' all\nIf I get locked up, I'mma get out tomorrow\nTHEY FIGHTIN' IN THE CLUB!\nYeah, with all our folks\nAll I bought, had to go waste cause all us fought\nWe used everything it was a all out war\nWhat the fuck you think ya chicks call us for?\nMy good shirt and all got tore\nBreak it, pay for it? we all got dough\nHold them bustaz, buck em', bust em'\nTHEY FIGHTIN' IN THE CLUB!\n\n[Hook]\n\n[Verse 4: Chingy]\nThey fightin'..you fighting? then get out the spot\nAy black, creep out to the ride get ya shit out and cocked\nIn fact, I'm posted by the bar like the hood-star that I am\nDon't make me up my piece and turn yo brain into some jam, ya heard?\nThat nigga got a chair ya scurred? Bust his head with a beer ya heard?\nWhy you runnin' over here, you scurred? Fuck them blaze up that herb\nWalnut Park and it's like you tinted and did I mention\nDTP'll tear da club up, bitch nigga what's up?\nDon't get FUCKED UP! But blow yo TRUCK UP!\nAtlanta to St.Louis is they bangin' gangs or not\nYeah I bang a A.K. and it got a gang of shots\nDon't get shot.......I'm from the block\n\n[Hook]", "image": "https://images.genius.com/90e0bb9a0154e50e44a296a498644f13.500x500x1.jpg", "album": "Self Explanatory", "year": null}]}