{"artist": "Wale", "songs": [{"title": "Beautiful Bliss", "year": "2009-11-10", "lyrics": "[Chorus: Melonie Fiona & Wale]\nBabe, you know it gets no better than this\nIt's like, sunshine on a rainy day\nIt's like a high, could you take me away?\nTake me away, away\nIt's a beautiful bliss, oh (When you feel like this)\nBeautiful bliss, oh (When you spill out hits)\nBeautiful bliss, oh, oh, oh (When you fly as a bitch)\nAnd you ride with this, and you ain't bothered a bit now, baby\n\n[Verse 1: Wale]\nFresh out the airport, fresh out the chair with the clippers\nLike Shaun Living', thinking, hmm\nI'm tryna get it like Sean get it\nIf Lord giveth, a mil' and a MILF light skinneded\nIt's slight blemishes and life system\nBut I'm giving it foundation when I write lyric\nThat Anvil Neidhart minus bright knickers\nMaybe not quite the star but my heart's in it\nWhen Bret Hart meet Brett Farve\nA sharpshooter well exceeding any figure four\nYou see my figure more or less six or more\nI invest in my larynx and lungs and this voice I project\nMy project is like what pros inject\nAnd a nigga so fly I should be droved in jets\nIt's ironic they call me a fresh breath\nNo joke, you see them boys sign me to the scope, right?\n\n[Chorus: Melonie Fiona & Wale]\nBabe, you know it gets no better than this\nIt's like, sunshine on a rainy day\nIt's like a high, could you take me away?\nTake me away, away\nIt's a beautiful bliss, oh (When you feel like this)\nBeautiful bliss, oh (When you spill out hits)\nBeautiful bliss, oh, oh, oh (When you fly as a bitch)\nAnd you ride with this, and you ain't bothered a bit now, baby\n\n[Verse 2: J. Cole]\nI phone home to the real they wanna know just how it feel\nWho woulda thought a lil nigga from the Ville could get a deal?\nAy, tell them niggas at the top we want yo spot we are for real\nAnd yeah, we heard you got it locked but like them socks, we on your heels\nSo you best be on your toes nigga, especially on your flows nigga\nCause man they keep on checking for me, especially all your hoes nigga\nCatch me on your doorstep, you see me, let me in\nAll I wanna do is eat, I'm like a freaky lesbian\nNow all I wanna do is ball on TV, need ESPN\nThey heard I'm 'bout to blow so all my enemies say let's be friends\nAnd all these rappers know just where I'm 'bout to go so catch me then\nWhere all the girls we knew that screamed fuck you going let me then\nI'm definitely in a class of my own, at dinner with Hov\nHoping that he pass the baton, he just passed the Patron\nAin't nothing given dawg, it's earned if you just living, dog, you learn\nI let you niggas see the light, I'm like the prison yard, I yearn\nFor that living large, but mama I ain't done yet\nSit back and watch your sunrise, kick back and know your son set\nForever I ain't run yet, and I never will, Nas told me life's a bitch\nPac said fuck the world and I ain't come yet, you up yet\nMy punchlines like gut checks I'm raw-dog, I'm rough sex\nI'm on deck, I'm up next, I'm God blessed, I'm success\nSo fuck stress, you can get the fuck from 'round me\nAnd if you listening, know you wondering where the fuck they found me\nI'm from the Ville, boy, ay Wale, good looking\n\n[Chorus: Melonie Fiona & Wale]\nBabe, you know it gets no better than this\nIt's like, sunshine on a rainy day\nIt's like a high, could you take me away?\nTake me away, away\nIt's a beautiful bliss, oh (When you feel like this)\nBeautiful bliss, oh (When you spill out hits)\nBeautiful bliss, oh, oh, oh (When you fly as a bitch)\nAnd you ride with this, and you ain't bothered a bit now, baby\n\n[Verse 3: Wale]\nAnother day up in my ES, wish it was an LS\nBut elastic is my wallet, fuck it\nI don’t be stressed like relaxed, muscles\nYour feedback ain't plusing, and you can keep it running\nHa, like a muffler, when we not in summer\nThey like A-list actors, they not no stunners\nToo much practice now for me to malfunction\nSo any beat that function, I breathe on and puncture\nLeave it like a female vagina punctu-\nWaiting, showing you her beauty if she's naked\nIt's like the view of a painting or a lakehead\nThis just how beautiful my day is\nPeep me how I'm raising up the capital from Nathan\nCapital I'm raising like I'm through punctuating\nOr shift keys or an I placement cause\nShifted keys gets your capital raised up\nMotherfucker, hah!\n\n[Chorus: Melonie Fiona & Wale]\nBabe, you know it gets no better than this\nIt's like, sunshine on a rainy day\nIt's like a high, could you take me away?\nTake me away, away\nIt's a beautiful bliss, oh (When you feel like this)\nBeautiful bliss, oh (When you spill out hits)\nBeautiful bliss, oh, oh, oh (When you fly as a bitch)\nAnd you ride with this, and you ain't bothered a bit now, baby", "album": "Attention Deficit", "image": "https://images.genius.com/a820f3f34251c1428eb5e289fe202b13.600x600x1.jpg"}]}