{"artist": "Canibus", "songs": [{"title": "Ghetto People Song", "album": "Full Spectrum Dominance", "year": "2018-06-22", "image": "https://images.genius.com/e46ac064e354d1b1540013198f5e0d71.1000x1000x1.jpg", "lyrics": "[Sample Hook, \"Ghetto People Song\"]:\nGhetto people song, only them can sing this one\n\n[Verse 1: Canibus]:\nThey say the devil's time is short\nSo what, sport?\nWe still ain't free\nThey still lying on radio and TV\nThe centuries turn into minutes; humanity's finished\nForced organ harvest, what's for dinner?\n\n[Canibus sings and raps in Jamaican Patois]\n\nButcher the meat\nChop up the beak\nDig out him ribcage\nBlow him out the reach\nFire burn hot\nItal in a' deh pot\nWomen head wrap up, she walk round in a flat\nBobo dread water-bong, Maroon sing-song\nHow long ya there, foreigner in a Babylon belly man?\nThen you no know?\nFire shot fling stone\n(???)\n(???)\nBad man dun a van tear off Jah\nTry gallavant, every bloodclot ting a get jam\nDis tiger bone tonic son, drink that\nWhich gyal want pop it fi di pussy, bring that\n\n[Sample Hook]:\nGhetto people song, only them can sing this one\n\n[Verse 2: Canibus]:\n[Jamaican Patois]\nBareface, they kyas and clean up the place\nI sent a [butler out for] buy front bricks\nMan upon road no tek catch a buss man\nI know man I still buy ore\nSubstance dominate rhymes\nStyles trail closely behind\nThey work together, you don't need to choose sides\nDystopian present times, immigration talk to a leprechaun\nMotherfucker ain't no friend of mine\nIf he's worth his weight in sodium, step to the podium\nIngest the polonium\nWhile promoting electroneum\nCrypto-sporidium\nThe next coin for the millenium\nCheck the chlorine levels before you swim in it\nImmigrant: Uncle Sam\nMusic industry Ombudsman\nI heard Ice about to raid Summer Jam\nWhen the sun disappears, the fear of the moon is a shared emotion\nAmong men everywhere\n\n[Verse 3: Canibus]:\nMeta-Fortnite, nano-mic; volcano cancel your flight\nAsh in the air, clash of the titans\nMan-made throwing fertilizer in the fan blade\nDNA de-energize by high gamma waves, slaves\nClose to old age, told to behave\nThe youth strayed so far from the way they were raised\nMore locks, more keys, more prisons, more thieves\nIf pedophilia's a crime then why they go free?\nI rarely generalize, but who goes to parties to consume drugs wrapped in cheese brie\nInquiring minds don't give a *flllluck* what you know\nThey just wanna see the deposit slips, yo\nRelocate, move in with grandpa\nMeanwhile Grandma goes in to live with prince bandar\nDomingo, my nigga\nThanos the rhythm trigger\nPercussion paint picture for the everyday listener"}]}