{"artist": "Wax", "songs": [{"year": "2015-10-23", "lyrics": "Give It To You\n\n[Intro]\nYo B, Wax and Herbal T, man you guys are old as fuck. I used to listen to you on my fucking walkman b. Dog, dog I used bump Grizzly Season back in middle school dog. I used to listen to you on my fucking myspace page, top 8 b. Dog, you guys are old as fuck, top 8 you're a 7 to me b, number 7 b\n\nWax: Yo Herbs, take 'em back\n\n[Verse 1 - Herbal T]\nNever gave a fuck, still not caring\nNever televised like Gil Scott-Heron\nJill Scott blaring out the box back in '02\nTouring in the van with the whole crew\nUsed to rock the Grape Street Pub in Manayunk\nSome didn't get it cause they didn't understand the funk\nBroke down in Omaha, please can somebody give my man a jump\nSill sick like the measles and the mumps, still keep it\nSmooth like laminate, dirty like a contaminate\nSlamming it, double hard like a drummer throwing a flam in it\nDamn if it isn't Wax and Herbal T in this bitch\nOverstaying our welcome, we never leaving this bitch\nWe're here to stay your dismay, attacking the track\nIn a Chuck Norris way, fuck what the purists say\nHerbal T, I know the time like Morris Day\nRap till I got nothing more to say\nLet the chorus play\n\n[Hook]\nYou want it, you need it\nYou got it please believe it\nWe gon' get give it to you everyday\nYou want it, receive\nWhat real though achieve\nWe gon' give it to you everyway\n\n[Verse 2 - Wax]\nI've been running from the jump with no sign of fatigue\nThe first time I heard something funky I was intrigued\nI ain't stop to breathe since a child at 3\nThat's why you primadonna rhymers are way out of your league, I put in\nMy 10,000 hours for free, that's why the doubters get beaten and then devoured and eaten\nWhile I wave a middle finger at the powers that be\nAs I segway by when I'm down at the beach\nYou can't fuck with me when I'm in my zone\nI'm in love with this microphone\nYou cannot keep up with me these Joneses\nWe saturated in dopeness\nMe and Herbal T for many years have been on tour\nNo hotel, though slept on rental van floors\nOnly one thing that we stand for: loving the funk\nYou stepping to me and my brother give up\n\n[Hook]\nYou want it, you need it\nYou got it please believe it\nWe gon' get give it to you everyday\nYou want it, receive\nWhat real though achieve\nWe gon' give it to you every way\n\n1, 2, 3, 4, 5, 6, 7!\n\n[Hook]\nYou want it, you need it\nYou got it please believe it\nWe gonna get give it to you everyday\nYou want it, receive\nWhat real though achieve\nWe Gon' give it to you everyway\n\n[Outro]\nAh yeah! Citizens of Earth, you are now about the witness the rebirth of the holy spirit of Funkenstein. Have you every made love to a Czechoslovakian mermaid in the middle of a pumpkin patch? If not, then you have absolutely no reference point to even attempt to imagine how we feel right now. Wax and Herbal T are god on my planet. When we pray, we pray in their names, and Wax and Herbal T damn it, we pray a muthafucking lot, so run for cover and hide your bitch", "image": "https://images.rapgenius.com/73165186fb4904ae4b2bd8cd6c3df2c1.640x640x1.jpg", "album": "Livin’ Foul", "title": "Give It to You"}]}