{"songs": [{"album": "More Politics", "image": "https://images.genius.com/2b173e3d3bd02f85d5edd743f3588568.600x600x1.jpg", "year": "2016-11-18", "title": "I Dream B.I.G.", "lyrics": "[Produced by Buckwild]\n\n[Intro]\nI Dream B.I.G, uh\nI Dream B.I.G, Termanology\nSheek Louch\nYeah, SP\nBuckwild on the beat, uh\n\n[Verse 1: Termanology]\nI don't sell drugs I'm a rhyme seller\nSaving for the crib with the wine cellar\nOther crib got the high rise elevator\nSky dive out the window and hit a jet propeller\nTryna cop me a skyscraper with my paper\nMake my bank account balance multiply major\nIt's all mathematics, my whip and my chain matches\nI ain't tryna hang with these average chickens my aim is lavish\nFortune 500 on my mind cousin\nPick a Porsche lift the doors, suicide stuntin'\nYou ever see the eyes on a gold digger?\nLike a goldfish floating down a cold river, ugh\nBaby sharks in a fish tank\nCorporate accounts in a swiss bank\nStill, I know it's hard to believe\nBut I work so hard, I'm like can't I just dream?\n\n[Hook]\nI Dream B.I.G\nI Dream B.I.G\nI Dream B.I.G., it was all a dream\nDream B.I.G\n\n[Sheek Louch]\nNo doubt\nTermanology\nD Block\nSheek Louch\nTerm\n\n[Verse 2: Sheek Louch]\nI Dream B.I.G\nAll these white presidents, now we got a nig\nYou would think that would take some power from the pig\nBut nope they killing us right where we fucking live\nFrom crack rocks to niggas worrying about the hiv\nShould I preach?, Or should I rap about some shit you can't reach?\nHold up, I Dream B.I.G\nFerraris, weed blowed up\nRolex on, fronting with my sleeve rolled up\nI Dream B.I.G., G5 pilot directions\nTen bitches on there with ass injections\nI throw that money at them like I'm up in perfections\nChinese guyanese, different complexions\nMy niggas coming home with no parole\nArtist be artist, and these labels not controlling their soul\nBack to back dutches like I'm smoking a cig\nSome think about 2Pac but me and L.O.X. we Dream B.I.G\n\n[Hook]\n\n[Styles P]\nTerm what up\nLouch what up\nStatik what up\nBuck what up\nYeah\n\n[Verse 3: Styles P]\nI Dream B.I.G\nUsed to hustle work right out of a fiends crib\nMade a little cash when they was down on the phone\nUsed to fall asleep and dream about the islands I own\nHad a air craft carrier to carry the jets\nThe fleet of the whips\nAnd all of the set\nThe quarterback, bought the whole front line a Rolex\nPerpetual piece, connect with the streets\nDissecting the beats, until the lesson is complete\nAnd whoever try to test know the weapons released\nI Dream B.I.G., took me a nap and seen B.I.G\nWoke and lit the smoke, started spitting some mean shit\nHelicopters and cartiers, chicks in the green six or the white five\nReciting Melle Mel on white lines\nHedge funds money and pipe lines\nLiving with your family and live out your lifetime\n\n[Hook]"}], "artist": "Termanology"}