{"artist": "Isaiah Rashad", "songs": [{"title": "Brenda", "lyrics": "[Intro]\nUh, uhm, yeah, uh-huh\nUhm, yeah, uhm, this a room\n\n[Hook]\nI got two cigarettes to my last name\nI clock in for the check but I don't wanna go\nI got two cigarettes to my last name\nI clock in for the check but I don't wanna go\nShe said you, you can't save em all\nShe said you, you can't save em all, yeah\nShe said you, you can't save em all, yeah\n\n[Verse 1]\nI mix a gallon of the gallon in a gallon of that\nAnd down that in your Nissan for the memory\nFor the energy, for the Tennessee\nFam call work, off work just to visit me\nI bought an ounce just to fuck with you\nHe don't take no hand outs, he don't take no hand outs\nRemember what my poppa told me\nRemember what my poppa told me\nTrust inward, trust in ya, my n-word, my friend of\nLast of the divine livin', so timid, all on us, doggone it\nThey would laugh at the small moments, then call on us\nLike who had you on your bad days?\nWho dropped you at that bitch house?\nLike, like back when we was little\nI was just an instrumental, now I'm Malcolm in a million\nWe talked about a billion, we talked about our feelin's\nWe kept it more than realest\nAnd look at how the path came, took it for the rap fam\nWould ya give ya all to the world, the work, work, and left hurt?\nShit, and what's worse\nShe too tired to talk, lately your thumbs hurt\nWe miss love and sex, Bridget, your son's birth\n21 hurts in court by 24, boy\n\n[Bridge]\nYou can't save 'em all\nShe said you, you-you, you can't save 'em all, um\nShe said you, you-you, you can't save 'em all, um\n\n[Verse 2]\nI write piss test livin', fuck that shit\nFuck call centers, fuck is this really growin' up my nigga?\nTax on your motherfuckin' nuts my nigga\n$10.25 what the fuck can a nigga do with $10.25?\nPlus your weed habit plus my weed habit and your weave habit\nFor free givin' we livin' with a weed daddy, two kids\nMix that Boosie with that boom-bap\nYou rap like you need money like you don't love this\nMy shit shoot up your jury before you judged this\nPull out, look at my dick like ain't it gorgeous\nFor those that can't afford this\nIt be like I got, I got\nI got my own world, I got my own mind\nDay dreamin' for a lunch break for my son's sake\nOn the run for the funds sake\n\n[Outro]\nI clock in for the check but I don't wanna go\nIt ain't that hard, I got two cigarettes to my last name\nI clock in for the check but I don't wanna go\nYou, you can't save em all", "image": "https://images.genius.com/63ae3497b74634d538e6bd9eeaaac0a8.1000x1000x1.jpg", "album": "The Sun’s Tirade", "year": "2016-09-02"}]}