{"artist": "Cam’ron", "songs": [{"title": "Go Outside", "album": "Ghetto Heaven Vol. 1", "year": "2013-07-04", "image": "https://images.genius.com/01b2584dd85d0bcfad6cde9603330f8b.500x500x1.jpg", "lyrics": "[Hook - sample of The Cults song 'Go Outside']\n\nI really wanna go out, I really wanna go outside and stop to see your day x2\n\n[Cam'ron talking over the Hook]\nUh, it's fucked up outside man. Shit crazy man. Barack gotta hurry up and do something man - they just reelected the nigga right? - word!\n\n[Verse 1]\nMan, my car fucked up, accelerator choked\nI ain't got time, to tell you haters jokes\nOn my stoop they try and sell a player coke\nNow I walk inside my lobby and the elevator broke? Damn\nNiggas act hard, when they in the midst of folks\nA hard drop baby, when they get eviction notes\nThey gon have to drag me out, fuck it bring 'em in to fight\nMatter fact by ten tonight I'll organize a tenant's strike!\nWith our T-shirts saying \"WE THE PEOPLE\" (Us!)\nThen I point at you, meet the evil (them!)\nYou can't neglect the feel, go back upstairs and expect to chill\nBut forgot to pay the electric bill\nShit, what the hell?\nSaturday night, no SNL\nTomorrow Sunday, no NFL\nI go on Twitter, type FML\n\n[Hook]\n\n[verse 2]\nFar as a job, it's hard to find a steady one\nJust got paid and feel like I owe everyone (damn)\nTroy, Tanya, Mike, Annette, Rex\nMy nigga Rex, he gon have to wait 'til next check\nJust got laid off, damn, what's my next step?\nCop the work from the Hill, that's my best bet\nA text from Tasha, looked at it awkwardly\nSaid she left the doctor and she really need to talk to me\nWent on for hours, she text \"you ignoring me?\"\nText her cordially, \"yeah you move unlawfully\"\nThrew the phone away, grabbed me a Boost Mobile\nFuck that iPhone shit, all my moves local!\nMy pride defined, never lie, you could ride on it\n'Bout to go to the Ave, who got 5 on it?\nSplit the bill with Harold, Page, and Darryl\nThen I went and played spades with Ms. Carrol\n\n[Hook]"}]}