{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro]\nAny excuse (ladies and gentleman)\nNo really, any excuse\n100k freestyle (God damn it)\nUh-huh, yeah\nSo now the Mursday album's right I figure\nI figure we can get a break now\nOh no, we ain't doing breaks?\nOh we ain't doing breaks, alright\n\n[Verse]\nI know you might have seen me on the Hunger Pains\nTouring around the country, keep it bumping Strange\nFloring the pedal, munchies in my suffering veins\nWhat can I fucking say?\nMy name is Benjamin, truth be told, I love the game\nSince '99 I've been a threatening train\nSpent all this time, so in 3009 you hear my records play\nThey don't respect the rhyme so I've been bunging\nBouncing on cats who spend their time wondering stupid shit, Cliven Bundy\nOh, I wonder, wonder, wonder why\nAll of my real Mayday-lians are stuck inside this shuck and jive\nThey never fear that, I bring these riots\nProduced the song for Tech and Kenny that's top 20 and still rising\nLive with the politics, but bet it hurts\nAnd if it's tears, I'll disappear in the cheers for years like Mega Hurts\nI'm walking 'round arenas and thinking this gon' be us\nI'm in the smash and do I have to pen for them to see us?\nShit, they keep telling me to rhyme to Rap God\nWell I really would but I feel that beat sucks my dick and balls\nTry not to take offence today, this is all opinion based\nSo why would I care if you truly dig into a different shape?\nYou see I'm not Donald Sterling\nA.K.A. a senile racist motherfucker who is not deserving\nOf pennies, nickels or sterlings, extra helpings and servings\nAnd mercy he's not deserving, what is the shit I'm observing\nThis plan has truly gone goon style\nWell at least my whiskey stash is full and there's new episodes of Boondocks\nShit I should run a bit and lift some weights\nBut I'm so God damn tired, I can't unravel all my dire straights\nSo I keep killing 'em like the Yellow King\nMy parents been here for a long, long time, prepare the wedding rings\nMe and this game got something going on\nThe reason I lost so many girlfriends in high school to the love of songs\nThis is for the love of wrong, in the name of those who're gone\nFor missing planes to Ukraine and North Korean pawns\nAnd who am I? Just a British yankee chasing grubs\nAddicted to the game and fiending for that famous drug\nJust broke a 100K on Facebook but it ain't enough\nGot an album coming up with Murs, oops shameless plug\n\n[Outro]\nMursday\nIt's coming June 10th\nShit, Strangeulation\nIt's coming May 6th, that is gonna hurt some feelings\nI just wanna say \"what up\" real quick\nThank you if you one of the 100k\nAnd if you're not, one way or the other\nI'll see you soon", "title": "100k Freestyle", "year": "2014-04-04", "album": null, "image": "https://images.genius.com/c714b196bcc8378c9e57d2328f2b237d.1000x1000x1.jpg"}]}