{"songs": [{"title": "Four Leaf Clovers", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nI see what you want\nI got you\nYeah\n\n[Verse 1: brandUn DeShay]\nYou want the fashion, right? You want the flashing lights?\nYou want the girls gone wild, you want them flashing, right?\nDon't want to ask the price, you want a actress, right?\nYou want to be the one that everybody acting like\nBut tell me, dog, what in the world would you sacrifice?\nYo, I would give this all up, don't got to ask me twice\nI dare anybody to ask me what my life is like\nFull of hardships, it's hard shit like stalagmites\nYou see what I'm saying? I live the closed captioned life\nIf life was a plant, my plant will barely capture light\nPhotosynthesis, hope this ish would just last the night\nOver in a day, hope that my hopes are asinine\nA piggy bank for a brain, I got cash in mind\nWalk around with chips on his shoulders, I'm trying to cash in mine\nTried to enslave my brain, but I got a mastermind\nIt's clear that I mastered mine\nBut tell me do\n\n[Chorus: brandUn DeShay]\nYou want you the cars?\nYou want you the girls?\nYou want you the money?\nYou want you the world?\nWell, good luck, homie\nGood luck\nGood luck homie\nGood luck\nYou want you the cars?\nYou want you the girls?\nYou want you the money?\nYou want you the world?\nWell, good luck, homie\nGood luck\nGood luck homie\nGood luck\n\n[Verse 2: brandUn DeShay]\nI'm just living my life, hitting like I'm even planning the fame\nGot redshirted, that's probably why I ain't playing no games\nYou should be cuffed, come out with your two hands up\nY'all ain't playing for real, y'all want two hand touch\nI follow my nose, I'm living on that toucan stuff\nI'm like imagination, that shit that you can't touch\nTake a poll on who would die for this, who stands up?\nJust me, Radio Raheem, and you can't touch\nIt's tough for making music like this and it's hard to ration\nFor rapping, I'm sure even Christ admires my passion\nI wonder what's my purpose, I sound like the lamest asking\nBut I known to wear my heart on my sleeve like the latest fashion\nI just want to resume that music is whom saved my life when I was a zero\nAnd now it's my turn to play hero\nThis music's got to burn, it's my turn to play Miró\nAnd peace like Buddha\nDo\n\n[Chorus: brandUn DeShay]\nYou want you the cars?\nYou want you the girls?\nYou want you the money?\nYou want you the world?\nWell, good luck, homie\nGood luck\nGood luck homie\nGood luck\nYou want you the cars?\nYou want you the girls?\nYou want you the money?\nYou want you the world?\nWell, good luck, homie\nGood luck\nGood luck homie\nGood luck", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}