{"artist": "C-Bo", "songs": [{"title": "40 & C-Bo", "album": "Til My Casket Drops", "year": null, "image": "https://images.genius.com/dc4336c862301b0ea11cc46a1958acbe.500x500x1.jpg", "lyrics": "[C-Bo]\nIt's all about that, scrilla scratch, flossin a bad batch and pushin\nSomethin luxury when it ship the sector snack my semen\nDrank the diamonds, geechie dub shinin\nNinety-seven sport drop Benz, gettin mine\nYou can hate and catch the tip of the blade of my sawed A-K\nIt's West coast mafia for the Midwest to the Bay\nBut I'm from the Valley of Cali we specialize in cap peelers\nStraight thug niggas, quick to draw like Matt Dillon\nOutlaws, strap in drawers, ready for war -- push up\nOn the side of your Ford Explorer and start dumpin through the doors\nWe realers; with so much scrilla can you hang with G's?\nStart uhh, who busy Jesus said\n\n[E-40]\nFuck cowboy keys now I ain't never been nobody's sucker\nNor have I ever been any coastal fake\n\"He got too much too lose; he ain't gonna bust in the ring!\"\nOut of state deputy license plates fix a ticket window tinted\nI could shoot to kill -- dressed up like a old man in a Bonneville\nDisguised, ready to chastise and dissapoint my prey\nSurprise, the element, apply pressure\nGet back at the motherfucker, snatch back at the motherfucker\nBust caps at the motherfucker... motherFUCKER!\nOne-Time up in the Valle-Jo\nFollow me and Bo to Sacramento\nSpend it on some ol high performance, Catastrophic\nGet some stunts, turn some tight ones, blew a head gasket\n\nChorus: repeat 2X\n\nIt's fo'-oh and C-Bo, quick to blast\nBreak niggas like the Task, without the mask\nWater, bring the noise like we on stage\nBoom, break em down like a twelve-gauge\n\n[C-Bo]\nBack at cha I rose, Chuck Taylors and double-oh's\nYoung thugs, ready to protect with fo'-fo's\nOn a mission mashin, nonstop til we cashed in\nAll out assassins known for down and dirty and blastin\nOn sight smashin, anything no question asked\nRunnin up with no mask and dumpin caps in that ass\nThis one life we live, is to be lived without sin\nBut I'll be damned if I die without a damn thing to give\n\n[E-40]\nDon't make us have to be the one to grab the gun\nAnd get to dumpin on your crew! That's what we do, check it\nDrop it like it's hot assume the position on the flo' butt naked\nGive me erything you got\nOr you gonna end up comin up missin and I won't regret it\nStill Water run deep (how deep?)\nUhh, all I find all I keep, uhh\nPay the price to have a sucker put on ice\nGot just as many Hot Ones as my nigga Spice\n\nChorus\n\n[E-40]\nBut if they, locked you up and throw way the key, what would you do E?\nI'd be up in that motherfucker watchin my latest video brought to you by\nTrass G and Trey Dogg from the California Music Channel Broadcastin\nRap Show the Bay Area's own Number One network, cable station, C.M.C\n(BEYOTCH!) Love letters to my wife, ba-bee I miss you\nThis mornin I learned how to make a pair of dice out of some toilet tissue\nFan mail from my fans, get up out of jail\nWaitin for my court ap-pail\n\n[C-Bo]\nNigga pass the strap and let me blast\nI'm quick to get off in that ass\nIt's Forty Water and the Loco Bitch so kiss dick and kick cask'\nFrom Sacramento down to Vallejo, on a mission about that mail\nWe specialize in collectin pays\nIf you come short, we dumpin facials I holds down the fort\nWith two Magnums culture go toe to toe\nWith any one of you bitch ass niggas\nThat think you can fuck with me and fo'-oh\nIt's old school trick, new school fools they catch clips\nForever money over bitch, we'll never caught snick considered licked\n\n[E-40]\nHell yeah, ay\nSee that's what I'm sayin that shit is realer than a new fifty dollar bill"}]}