{"artist": "Anybody Killa", "songs": [{"title": "Sticky Icky Situations", "image": "https://images.genius.com/0ef45eaaeeb6c906ab411eeb71f61222.800x800x1.jpg", "album": "Hatchet Warrior", "lyrics": "[Verse 1 - Anybody Killa]\nMy teacher always said I wouldn't be nothin'\nSo I met him in the parking lot said \"I'ma killer\" and then I rushed him\nSometimes I feel like a nut\nRunnin' through the neighborhood, tearin' shit up\nStraight jackin' motherfuckers just to smoke a blunt\nSometimes I feel that my head fucked up, and it really sucks\nI hear voices tellin' me to do it (Do it)\nHow would you act if you had to live through it?\nTurnin' back on the gat, and I stole me an ounce\nNow I'm addicted to the sound of a head gettin' whacked\nDo I smoke too much, cause I choke too much?\nAre you mad cause I keep stealin' your roaches bro\nYo Mike P! (Yo what's up?) Turn my headphones up\nRude Boy got me stoned from the sticky stuff\nWeed's fuckin' with my head, man I'm too damn high\nYo Violent J, you want the rest? (Show you right!)\nMan I can smell it in yo pocket (Roll it up)\nSandwich bag filled up like you ain't got enough\nAlways smoke with your road dogs, don't be shy\nCause when a drought comes, he might be yo main supply\nMe and J steady smokin' pounds\nSo at least have a sack when you see us around (Biatch!)\nLike you ain't heard, man we flippin' the scripts\nSo unlock yo ziplock and let me grab us a spliff\n\n[Verse 2 - Blaze Ya Dead Homie]\nWhen I pass it to you, bitch pass it back\nBitches don't smoke for free, where the ass be at?\nB-L-A-Z-E, ABK\nAnd we got Esham and Violent J\nJuggalos outside in the parking lot\nBecause y'all know how we get sparked a lot\nGot the Faygo Cola with the Vodka twist\nAnd when we all get together we see diamond mist\n\n[Verse 3 - Violent J]\nI could smoke a stick of dynamite and not be dead (POP!)\nI like it cause it fuck with my head\nI stay weeded indeed, a killa need it\nI can eat it to feed it, proceed and keep it heated\nNow who the fuck don't like my flow?\nYou ain't heard my words will make the beard of a wiseman grow\nHydro, in a good way it fuck with my head\nAnd without it you fucks would be dead\nI rhymed dead and head for the 17th time\nWe double team rhymes, ABK and Violent J\nIf I loved Shaggy anymore I'd have to be gay\nIn Californ-i-a, they pull they socks to they knees\nNIA, Ninjas In Action we be deez\nI like cheese, I'm a serial pleez\nI bitch slap fans cause I be a dick like that\nI get wicked-wicky-wicky rhymes sick like that\nI'm fat and fuzzy and I smell like weed everywhere\nMy homies call me Smokey The Bear\nTell that pokey beware, don't come near here\nDon't dare, unless you wanna see my axe buddy partin' your hair\nI'm a Southwest gang bang gangsta boy\nZug Island, Del Ray I ain't's ta toy\nMy boy Nate's the boy, my whole crew busts shots\nUntil you out like quamay's pokadots\nI'm tryin' to smoke a litte somethin' for my dogs who smoke\nThey only cessed and stressed cause they all too broke\nI'm like \"bew-bew-bew-bew-bew\" with the Anybody Killa\nBlowin' Indian tubleweed, we bitch booty feelas\nGhetto scrubs flippin' nubs at thugs\nWe drown faggots in Faygo tubs and eatin' dead bugs (Ew!)\nI'm tryin' to say anything that rhymes\nSo I can fuck with your head like the cess do mine\n\n[Hook - Blaze Ya Dead Homie] -x2\nBreak it down and roll it up, smokin' blunts all night\nHesitate to hit it too hard, the weed's that tight\nSticky icky situations, dehydrated\nCottonmouth creepin', the game got me faded\n\n[Verse 4 - Esham]\nI'm in the water with the sharks bleedin'\nThat's why I be a killa for no reason, speedin'\nMy flows dope like OZ's and\nCrush pounds and trees and, I'm all season\nVeteran, no one does it better than they (We)\nE and J, (Hey) ABK\nAnd that's my man and them (What's up?)\nAnd I always blow ganj with them\nDetroit playas too advanced for them\nWe buyin' out the bar, we don't dance with them\nSo if you ever get a chance to glance at them\nBaby boy say holla back, answer him\nH-U-S-T-L-E-R\nYes, that's what the hell we are\nSee, me and Blaze, wicked ways\nFull body armor, 5000 rounds and about 2 K's\nI can walk on water, spit fire and ice\nChinese secrets, makin' wine from rice\nStill shoot dice, up against the wall so nice\nStill F-U-C-K the po-lice\nThink twice like the 3 blind mice\nBut don't give me no advice\nI shine like crystals in the jewelry heist\nAnd still pimp hoes like Heidi Floess", "year": "2003-04-08"}]}