{"artist": "Fashawn", "songs": [{"year": "2014-12-01", "album": "Fash-ionably Late", "image": "https://images.rapgenius.com/403bc5802ed3d90725c369764212c278.600x400x1.jpg", "lyrics": "[Intro: samples and Fashawn]\n\"Woo-hoo! Vanilla ice cream, and I'm gonna take me a big lick!\"\n\n\"Any one of them niggers gives me any crap, I'll lay them out...\"\n\"You do that then...\"\n\nUhh, check it out, yeah\n\n[Verse 1: Fashawn]\nIn a neighborhood, predominantly black, was a house party\nA typical game of craps and Cognac\nHeard the commotion, when somebody hit a seven\nSaw a pack of black queens hopping out a white Lexus\nGangstas on the front lawn, function in the back\nA bunch of wild Africans who don't know how to act\nRat in my ear talking 'bout \"Can we leave now?\"\nTook her to the attic and stared to sweat her weave out\nI bust a nut and reemerge out a weed cloud\nTo the party, fuck it if whoever saw me (stop)\nMy foam cup dirty with the lemon-lime\nThree uninvited guests enter at the same time\nWhite dudes with Swastikas tatted on they arm\nSurrounded by niggas who'd be glad to do them harm\nNot even fair, they outnumbered and gotta be aware\nI could smell a problem in the air\nThey strolled through and everybody gazed\nPretty obvious they're not afraid\n\"Let 'em live.\" That's what Mama Miss Golly said\nBut my partner Big Linky pulled a chopper out instead\nInterrogative, asked if they knew where they was at\nThey had to, these honkies look a little too relaxed\nSaid they only came for the bitches\nThat's when suddenly I heard a bang from the distance\nNiggas scattered as the door opens up\nWent from three to 100; now there's more of them than us\nIf you ain't bring a firearm you should duck\nOr hit the floor and be a fortunate one to survive\nThey snatched Linky by the neck, gave him one in his head\nI went and grabbed the nine under his bed\nHe had bad karma, dirty sweat below the rug\nIn debt with various thugs, had an Aryan plug\nThat he robbed months ago, they're back for revenge\nGave him a bullet for every stack that he spent\nExplains the skinheads crawling through his crib\nNo mercy, they shot Mama Golly in the ribs\nPoor Linky left his noodles on his couch\nI could finally get away, or try and shoot it out\nBounced to the nearest gas station\nHopped in the closest motherfucking cab waiting\nSaw an opportunity and had to take it\nOnly thing on my mind now is retaliation\nPlantation\n\n[Outro: Sample]\n\"Get on, white folk. This here's the plantation sure enough, but Miss Golly? She ain't up yet!\"\n\"Now look who here! They done set us off, talking whities!\"\n\"Honkies with their wrinkly white asses...\"", "title": "The Plantation"}]}