{"songs": [{"lyrics": "So you've all come here to the place to be\nThe rock shock to the rhythm of a funky melody\nSo, without a doubt you gotta pick this out\n[?] we're rockin' the house\nYou know we're doin' it right and we're doin' it correct\nSo when it comes to MC poppin' we don't give a heck\nAnd we're givin' you a chance, step out of your trance\n[?]\n'Cause it's party time, you know it's party time\nHey, everybody, it's party time\nJust get real loose and ya catch the groove\nBecause of the rhythm of our voices are all so smooth\nSay, hey, young lady, sweet, pretty thing\n[?] and you enter a swing-swing\nAnd if you show us that you really came to party here tonight\n[?]\n\nRight now, of course, right now\nMC Globe (who else?) Tell 'em your name (Pow Wow)\nAnd do you know this?\n(I know I know this well)\n'Cause we're the two well-experienced poets\nThe style that we use can hardly be measured\nWhen we're doin' it for the people it surely is a pleasure\nWe can rock away the sound of the stormy weather\nWe're two for all, that means we are together\nWe're just too clever and never in our lives\nWill we hear a rhyme good enough for us to bite\nSo, listen as we recite\n\nGo tickity-tock, Wow, tickity tickity-tock, Wow\nGo tickity-tock, Globe, tickity tickity tock, Globe\n\nWe told you once and we'll a friend\nThey made a mistake when they let us in\n\nNow, there's place in through your city where the people are sodity\nA glamorous place with expensive taste\nEverybody walkin' around with their nose up in the sky\nThe level of the cipher was never too high\n[?] never reach the peak of the dummer's beat\nWell Pow Wow and G.L.O.B.E. says\nThis place will never ever be the same again\nBut they made a mistake when they let us in\nNow we're just two, we're just two MCs\nAnd we're gonna rock this party house\nSho' nuff takin' over control\nTotally, Pow Wow and Globe - G.L.O.B.E\nNow, why? We don't know\nWe're we are the two who's gon' steal the show\nWell, it's got to be\n(It must be that funky rhythm) That makes us show our techniques\nRight now we're gonna tell you again\nThey made a mistake when they let us in\n\nWhat? This way, please\nFor what? We didn't do anything\nYeah, man, we didn't do nothin'\nLook, you can't put us out\nOur name is on the list\nHa ha ha ha ha ha ha\n\nWe go, tickity-tock, Globe, tickity-tock, Globe\nYes, Tickity-tock, Wow, tickity-tock, Wow\nWe're notorious, yes we're talkin' about us\nIf Pow Wow and Globe rock, the party must\nAnd you best believe we can do as we please\nPow Wow and the G.L.O.B.E\nTwo master minds of our time\nAlways present the brand new rhymes\nTakin' you to the heights [?] shockin' these mics\nTryna shine bright like two star lights\nBein' your guide, rockin' your world\nSocialize the fly guys and snatch the fly girls\nBut, why not? 'Cause it's time for the funky MC bop\n'Cause it's funky type of styles other MCs got\nIt goes, tickity-tock, Globe, tickity-tickity, Globe\nTickity-tock, Wow, tickity-tickity tock, Wow\nYeah, we'll tell you once and we'll tell you again\nYou made a mistake when you let us in\n\nThere was a doctor at the bar, chillin' hard\nDrinkin' a drink called Bacardi [?]\nAnd on his left was this fabulous movie star\nLookin' so good, better than Hollywood\nThere was a lawyer, politician and a millionaire\nThere were lots [?] people there\nNow listen, we love to party and spark up the flame\nBut nevertheless we're gonna be the best at this game\nSo for those of you who don't believe what we say is true\nWe dedicate this statement to you\nIf you don't wanna party, I'll tell you, my friend\nYou made a mistake when you let us in", "title": "They Made a Mistake", "album": "Planet Rock - The Album", "image": "https://images.genius.com/8331b6c8262a509e390a36b467c78f1d.1000x1000x1.jpg", "year": null}], "artist": "Afrika Bambaataa & Soulsonic Force"}