{"artist": "360", "songs": [{"album": "Falling & Flying", "year": "2011-09-30", "title": "Meant To Do", "image": "https://images.genius.com/ff953b11808071cdb82a384e1649c9ef.1000x1000x1.jpg", "lyrics": "[Intro]\nI dunno what I want to change\nBut I know I shouldn't stay the same\nI dunno what I want to do\nAnd I dunno what I want from you\nSo I'm on my way\nLooking for another one to get me through\nIt's my bad if I met with you and you left confused\nWhat the fuck am I meant to do?\nWhat the fuck am I meant to do?\nWhat the fuck am I meant to do\nWith you?\n\n[Verse 1]\nSee you know the girl, yeah, you know the type\nYo, she doesn't know the world, but she knows a fight\nShe wants a boyfriend now, go and have a closer look\nTalk about a bad choice like she wrote the book\nShe been talking to this guy for a while and he wants in\nBut he's a nice guy, so she don't want him\nBut why is it that the ones that are bad for you\nAlways seem to be the ones she's attracted to\nYo, it's the same shit, yo, you have to chill\nYou turn a small thing into a massive deal\nSee you don't have to care but\nWe have a good week and then it's back to square one\nIn this life that you lead most the time\nYou just fight with the weak then you cry as the cycle repeats\nBut you don't think it's a problem\nI guess the first step is admitting you've got one\n\n[Interlude]\nWhat the fuck am I meant to do?\nWhat the fuck am I meant to do\nWith you?\n\n[Verse 2]\nYo, I don't know who you are, where'd you come from? (from)\nWhy you getting so mad, where's the love gone? (gone)\nWhy I feel like there's somethin' that I've done wrong? (wrong)\nAnd why I feel like you're someone I should run from?\nHey, yo, it's endless\nListen to me, come on, I don't wanna punch on\nI feel like I'm fighting myself with no gloves on\nWhy is it that the ones that are bad for me\nAlways seem to be the ones that are attracting me?\n'Cause she love me, she love me\nBut why she always wanna fucking erupt me?\nIt's never me though, trust me, it must be you\n'Cause you always turn nothin' into something\nTrue, but you stay upset\nYo, I can't count each and every day I've left\nI give it twenty-four hours till we break up next\nBut I guess it's all worth it for the make up sex\n\n[Chorus (Condensed)]\nI dunno what I want to change\nBut I know I shouldn't stay the same\nAnd I dunno what I want to do\nThat ain't all though, I dunno what I want from you\nSo I'm on my way\nLooking for another one to get me through\nIt's my bad if I met with you and you left confused\nWhat the fuck am I meant to do?\n\n[Verse 3]\nLiving in the sex and the drugs and the rock and roll\nI'll admit it, though, I lost control\nI met a girl with a positive soul\nShe regretted that she ever went and got involved\nCouldn't handle all the people talking\nI let 'em keep going and I keep ignoring\nI'm past those days always keeping score\nAnd I said it and I meant it, that ain't me no more\nThey see the lights and it's seeming exciting\nBut see as time goes by it is blinding\nBut see I really, really want to meet wifey\nBut the way that I'm living ain't likely\nYeah, being a rapper ain't getting me far\nI don't have a house or a pet or a car\nI'm twenty-four living in my parents' garage\nSafe to say that I'm off to a terrible start\n\n[Chorus]\nI dunno what I want to change\nBut I know I shouldn't stay the same\nAnd I dunno what I want to do\nThat ain't all though, I dunno what I want from you\nSo I'm on my way\nLooking for another one to get me through\nIt's my bad if I met with you and you left confused\nWhat the fuck am I meant to do?\nWhat the fuck am I meant to do?\nWhat the fuck am I meant to do\nWith you?\n\n[Outro]\nI dunno what I want to change\nBut I know I shouldn't stay the same\nI dunno what I want to do\nAnd I dunno what I want from you\nSo I'm on my way\nLooking for another one to get me through\nIt's my bad\nWhat the fuck am I meant to do?"}]}