{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/699f98c18a6750dc382068fbcdbc0236.1000x1000x1.jpg", "title": "Cold Blooded", "year": "2013-04-12", "album": "Indicud", "lyrics": "[Verse 1]\nI got my head on a swivel\nThink its time I open my mind where I left it\nNigga make it easy, make sure that they can't delete me\nI'm bout to be rewire your whole fucking mainframe\nI'm sick of the same, lame old same thing\nI got some bubonic you might wanna mix with some whisk\nI got a vendetta with showing niggas that I'm way better\nFeeling way worthless, the lost black sheep of G.O.O.D. Music\nOnly good for a hook, huh? Let me show you flows\nIntuitive when it comes to many things I know\nCold, most winters I would dream of being a winner\nFeeling like less than shit to the doubters\nPain I promise to all who oppose my knowledge\nMy reign, the fucking essence of pain fuck rain\nStanding in a monsoon of cool, time will tell\nThis is what it is when you're walking to hell\n\n[Chorus]\nCold! Bitch you know I'm cold yea\nI'm one cold blooded nigga\nOh So cold\nNiggas know I'm cold yea\nI'm one cold blooded nigga\nOwie!\n\n[Verse 2]\nI love how I can make so many people feel uneasy\nWalk right passed I know you hoes see me\nCan't deny the shine of a jedi\nWorld class almighty super cudder the Godly\nBurbon, divas just smoking 'tiva - that was my hobbies\nI love shittin on these niggas that is my fave\nCan't fuck with an unstoppable force\nThat lives with no regrets and of course no remorse\nOne two one two, assholes now please listen close\nI live for the day to watch all you pussies roast\nWhoosah whoosah, so I don't slit nobody throat\nAwww it ain’t my fault, homie thought he had the juice\nBash a nigga face in, watch the blood leak\nPut my ear where his jaw was, tell a nigga to speak\nStanding in a monsoon of cool, karma is my armor\nWas only scared of my father, beyond that I'm...\n\n[Chorus]\nCold! Bitch you know I'm cold yea\nI'm one cold blooded nigga\nOh So cold\nNiggas know I'm cold yea\nI'm one cold blooded nigga\nCold! Bitch you know I'm cold yea\nI'm one cold blooded nigga\nOh So cold\nNiggas know I'm cold yea\nI'm one cold blooded nigga\nOhwe"}]}