{"songs": [{"image": "https://images.genius.com/b0c1f935e3da928e1533ba90e51de3d8.1000x1000x1.jpg", "lyrics": "[Intro: Que Bandz & Uncle Murda]\nWoo, whoa\nYou know what the fuck it is nigga\nI got the bank now, whoa\n\n[Chorus: Que Banz & Uncle Murda]\nIt's feelin' like I got the bank now\nTrip' six CeeLo is all I'm shootin'\nGrippin' that thing now\nStickin' shit up if I start losin'\nI got the juice now\nBitch I'm Makaveli and 2Pac, I be too proud\nThey like who shot ya? I hit 'em up with a few rounds\n'Bet whatever my nigga, I got the bank now\nI used to side bet nigga, I got the bank now\nYour money good my nigga, I got the bank now\nMoney on the world my nigga, I got the bank now\n\n[Verse 1: Que Banz]\nI remember posted up by the train at the junction\nNow I'm with the swipers with the pieces tryna punch in\nY'all still tryna guess what I got, makin' assumptions\nMoney ain't the topic my nigga, change the discussion\nThis that mental rap, packs the rental rap, glizzy strapped\nCrash the whip, real trip, we send that rental back\nNiggas scheme watch, beam with the grip, you get slingshot\nIf 12 come I'm peelin' off in a creme drop\nStruggles I been through nigga, I got a lot to say\nI done seen a nigga catch a case off a pot of yay\nDrop the bread, I feed him lead, boy he gon' die today\nGot a dopehead for three bundles, gon' supply the cake\nSmoke switch, then codeswitch, either the clear goose\nMood switch, got two grips, I keep a pair to shoot\nTry and run, we end dude\nSend them shots, we clearin' you\nDrag him to the top of the roof and make him parachute\nTwo chains, my mood swing, you loose change\nBlack coupe, that Mulsanne, I'm Bruce Wayne\nNiggas mad but they know, got the bag for the low\nPut a price on his head and now his tag got a toe, whoa\n\n[Chorus: Que Banz & Uncle Murda]\nIt's feelin' like I got the bank now\nTrip' six CeeLo is all I'm shootin'\nGrippin' that thing now\nStickin' shit up if I start losin'\nI got the juice now\nBitch I'm Makaveli and 2Pac, I be too proud\nThey like who shot ya? I hit 'em up with a few rounds\n'Bet whatever my nigga, I got the bank now\nI used to side bet nigga, I got the bank now\nYour money good my nigga, I got the bank now\nMoney on the world my nigga, I got the bank now\n\n[Verse 2: Uncle Murda]\nCaught a body, ain't tell nobody, like what's the point?\nNiggas' niggas be the reason that niggas be in the joint\nBlack hoodie, my mask on with them black gloves\n'Cause that white jury and white judge don't like us\nSmoke exotic, them narcotics is what we distribute\nMy shooters out your shooter, your shooter ain't even get to shoot\nFendi, Givenchy, and Valentino\nWe play blackjack or shoot craps at the casino\nWith the Mexicans, got it for sale again, talkin' kilos\nPlay Gee Money, I'm my brother's keeper like Nino\nA side deal will get your head tapped where I come from\nThese bullets and the feds is two things you can't run from\nSeven MAC-11's, eight thirty-eights\nIf he an Alpo, let the forty cal blow at his face\nMade crack sales and dope sales in front of minors\nPut hard dick and quarter of bricks in bitches' vaginas\nCaught a robbery, nigga almost bodied me, I ain't pat him down\nLet him go, then he took a shot at me\nI'm that kid that wanted to play Monopoly\nInvested in real estate, now a hood nigga got property\n\n[Chorus: Que Bandz & Uncle Murda]\nIt's feelin' like I got the bank now\nTrip' six CeeLo is all I'm shootin'\nGrippin' that thing now\nStickin' shit up if I start losin'\nI got the juice now\nBitch I'm Makaveli and 2Pac, I be too proud\nThey like who shot ya? I hit 'em up with a few rounds\n'Bet whatever my nigga, I got the bank now\nI used to side bet nigga, I got the bank now\nYour money good my nigga, I got the bank now\nMoney on the world my nigga, I got the bank now", "title": "Bank Now", "year": "2017-11-24", "album": "Don’t Come Outside, Vol. 1"}], "artist": "Uncle Murda"}