{"songs": [{"year": null, "title": "One Foot In The Door", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro]\n[Jay-Z interview about Saigon]\n[Jay-Z]\nThis thing is…\n[Interviewer]\nWho’s the next hot artist that you would say is coming out?\n[Jay-Z]\nWow…\n[Interviewer]\nJust on the scene\n[Jay-Z]\nI don’t know, man.  Uh, it’s a couple people that got a shot.  I mean…\n[Interviewer]\nLike who?\n[Jay-Z]\nUh T.I. has a shot—he has a real shot.  Uh, Lil’ Wayne has a shot.  Fabolous has a shot.  There’s a lot of…\n[Interviewer]\nSomeone we’ve never heard of, though?\n[Jay-Z]\nOh, I don’t know… Oh, maybe Saigon.  The kid Saigon\n[Interviewer]\nSaigon?\n[Jay-Z]\nYeah, yeah…\n\n[Saigon]\nYeah, Preme (\"The kid Saigon\")\nCocksuckers thought they was gonna buy my soul, for a couple hundred thousand (\"The kid Saigon\")\nYou know what'm sayin’?\nIlluminati for a car and a shiny chain, for a watch, a shiny watch\nNah nigga, I'm Saigon (Press the reset, man)\nNever, I'm Saigon (Don't do it)\n\n[Verse 1 – Saigon]\nY'all want me to make up a character and be it\nThat's what I gotta for you people to have to see it\nWhy should I have to get shot in my back to achieve it?\nOr be dead or paraplegic for these cats to believe it?\nI breathe it, I done went on the internet and been a wreck\nSaid Rick Ross and 2 Chainz should get chin-checked\nBut then I dropped thirty minutes of intellect\nThat would’ve been neglected had I not pegged it with disrespect\nSo no disrespect\nEverybody got they own set of problems—I got dirt I gotta disinfect\nIt's fucking absurd, swerve like I'm huggin' the curb\nAfter guzzling couple cups of the Bourb’\nPimpin’ in the top ten, right behind Rakim\nIn front of Big Daddy Kane—(\"No, Sai\")—I'm only playin’\nI ain't fuckin with Kane.  But it's a lotta niggas\nY'all can name and I tear them niggas outta the frame\nBang this in your old school box—this ain't the iPod days\nThis for niggas that had high-top fades\nThis for niggas with the eyes I grazed\nThat rocked shell tops when they was shell tops, “Stocking Caps” for the waves\nI can take you to the days (What?)\n‘Fore the Greatest Story was Ever Told\nI was letting ‘em Berettas unload\nShooting up clubs, gunfire coming from both ways\nCouple niggas was targets, couple just caught strays\nNow I said selling coke pays in the Illmatic days\nNowadays, they offer you coke—go that-a way\nSai's an anamaly (anomaly), family\nYou ain't got the grammar and goin’ hand to hand with me is insanity\nYou need to examine me, take a closer look at the crook\nThat the valley and the brook cold cooked\nTake a look at the work that I put\nTwo albums, some mixtapes and a book\nAnd I only got one foot\n\n[Hook – Saigon]\nOne foot in the door, but I feel I’mma need one more\nWithout that, I am just unsure\nI wanna give it my all, wanna go balls to the wall\nBut I only got one foot in the door\nI got one foot in the door (x3) (*with scratches by DJ Premier*)\n\n[Bridge – Big Daddy Kane and (Saigon)]\nOkay, okay, I see what you doing with it baby (See that?)\nYeah, you down in the sprint position and whatnot man (Ready)\nWaiting for someone to pass the baton in the money marathon (Ready)\nThat's what it is.  You know you can't just run with it, you got to come with it (Coming with it)\nSo um, I'll be up there waiting for you at the finish line.  Let’s go\n\n[Verse 2 – Big Daddy Kane]\nYou know it's something ‘bout that name Big\nAs in me, Small's a pun—we all can gun\nRemorse is none ‘cause we bosses, son\nAnd that’s the type of shit that you don't see often, son\nNow line 'em up so I can body all sets\nI need to rhyme in front of volleyball nets\nSo y'all can catch that shit that it went over your head\nYo, what he said can [?] over—you’re dead\nI’m so eager ta just hold heat ta ya\nY’all get tough in front of social media\nI ain’t a Twitter thug, nigga—I’m a split-a mug nigga\nWhen y’all set the bar, I’mma get above nigga\nToo much shit here be genetically made\nAnd MC’s don’t give a fuck like, “Forget it, we paid”\n(These niggas is) Frontin’ until they just pathetically fade\nAnd that’s a new wack rapper in the bed that he laid\n\n[Outro – Saigon]\nThese niggas dead, Kane.  I swear to God they dead.  Swear to God, it's The Yardfather, man.  I ain't holding back no more on these muhfuckers man.  Shoutout to legendary BDK, nigga—Brooklyn's own.  Motherfucker, Big Daddy Kane.  DJ Premier.  I got one foot in the door.  Preme, take us out of here the right way, baby.  Hip-Hop, nigga\n\n[Scratches + Samples - DJ Premier]", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}