{"songs": [{"album": "Flowmastermouth: West Walkin’", "image": "https://images.genius.com/b2b874d83bd7ee807d90089167b565ce.500x334x1.jpg", "year": null, "title": "Nigga Wit Game", "lyrics": "Ring my jingle bells its young T-Nutty in your fingernails and Im a single male, tell your homegirls I got weed for sell plus pimpin ain't easy I need tha mail. Like a post office when tha hoes jocc us, flocc us and treat us like gold watches, lovin me cuz Im four blocc and sippin bubbly on tha dope spot. And it dont stop, Im a nigga that'll mac lemmie hit it from tha bacc disattachin tha bone. Off in tha wind cuz it costs when I spend time I need to get mine takin blunts to tha dome. Don't feel bad If I leave u alone cuz sticcin and movin is apart of tha game, the reason why Im all in tha bacc of your brain is cuz my diccs in you and wit accurate aim. Wait for me to swoop ya' (if I) take too long than do what u do cuz u know Im chasin chalupa just gimmie a minute to bundle my loot. Love me cuz Im knoccin tha coc outta u call me a bust a good nutty or two u can just call me your buddy lover boo, every other day we can do something new. Off wit tha roll cuz Im hot wit tha flow s'you can watch at my shows baby hop in tha load (on stocc wit tha gold) Gs spinnnin from tha chrome, G staccs from my songs. Straight gangsta mac mamma face tha facts that Im chasin scratch cuz I need it even though I bang out yo bacc, to put it on tha map Im a locc cuz u never say eat it\n\n[Chorus:]\nEverytime tha players leave, Im missin tha way it feels cuz everytime u put it down, I need it, right now (a mac a player if u call it that it all goes down wit a nigga wit game) Satisfactions' guarenteed, each and every time we meet, my body's callin come and see about your baby (a mac a player if u call it that it all goes down wit a nigga wit game)\n\nGoodness gracious misses madam it's clear your rear done got a little fatter my dear, for years u know me for maccin, u was damn near havin a heartattacc when I arched your bacc, figured it out, there goes tha spot we was talkin about knoccin tha coc outta stocc and u tell me to stop and call me tha chocolate spouse. You's a mouth but Im not mad cuz Im glad that u like to taste cheeze, I was laced up by my momma my grandmammas and my aunties. 18 wit a attitude, actin like a grown baby girl is u crazy thinkin u can play wit me cuz u freak and u creep and u lay wit me? I remain a G little nigga that be maccin up got bitchez baccin up Im taking action. Niggas that be slaccin up lovin a nasty slut up in tha club catchin fatal attractions. Haterz harassin cuz he ate it and Im bashin smashin (niggeratin) and tha fattest asses goodness gracious misses madam u work it like magic. I could feel it all throught tha plastic plus didn't recognize that u was that thicc. Just give me a minute it was that quicc but wit precision girls hit u wit tha tactics. Don't need to practice cuz I be at u just add my name to tha mac list, cuz I had yo dame on tha matress givin up tha game wit all access\n\n[Chorus]\nMisses Madam will u mind double- dutchin a bone? Will u be mad if I fucc and get on Im not lookin for love because I got it at home it doesn't matter that Im wrong, do when Im gone. Sippin tha Paul Mason blowin tha bomb, tha truth is my boo is my crazy baby mom (why u here wit me?) shh, keep calm this is only a creep not agreed to tha prom. U got yo nerve thinkin givin me bread, will get u more than a dicc u thicc in tha head? Tha minute u said u love a nigga u was lying cuz I heard another nigga had u crying in tha bed. I wasn't fed, up wit it, didn't give a fucc about it cuz Im T-Nutty. U can consider me one of your buddies and to tell u tha truth Im just lovin tha money and rubbin u honey. I'll go when it's sunny, show me when these hoes be jumpin bones like a bunny rabbit makin it a habbit, convincing me not to shake tha spot but I shake it because Im a paper addict. Baby girl I gotta have it lemmie let it be known. Im to be questioned girl because Im grown I'll stay gone for twenty-four hours beliving that money is power and only cowards get thay game devoured by they spouse. Im G when I work tha mouthpoece cuz Imma be treated like tha king of tha house. Blowing a blunt wit my dingaling out, mingaling and angiling after tha paper route. No doubt thug niggas need love, a kiss and a hug and all the above, but Im not the type to do too much to get it Im a menace to tha cat and rather rip and run\n\n[Chorus]"}], "artist": "T-Nutty"}