{"songs": [{"lyrics": "[Intro]\nAnd you say New York City\nUh-huh\nPut your hands together\nYoung!\nUh-huh\nYeah, uh-huh\nYes! (Yes!)\n\n[Verse 1]\nI'm from the '80s\nHome of the her-on\nEra of the hustlers, uh\nThe world is my custies\nNew Rich Porter\nThe way I flip quarters\nFront on all these other rap artists, but me\nMomma was a mink wearer, papa ran numbers\nSo it's plain to see where my whole plan come from\nAmerican dream, I'm living the life still\nWay I shine is like a zillion dollar light bill\nStill I'm grinding, army jacket lining\n40 below Timbs on, getting my M's on\nMy best friend's gone\nI seen bad days, still find songs that I hear him on\nGetting my Mary J. Blige Reminisce on\nI hear his voice in my mind like, nigga live on\nSo I get on that fly shit I been on\nSpin on corners in Enzo with rims on\nBut for info, puffing on Endo-Nesia\nGive me amnesia\nI ease up, that right, I'm high nigga\nI want the sky\nThe world when I'm done\nI'm give it to my sons\nLet 'em live it up, split it up, switch it up, uh\nSixes kit it up, man I did it up, done\nThe rest of my belongings belong in the hall of fame\nA list of hits next to all my names\nI came\n\n[Bridge]\n(Woo!) uh-huh (geah)\nI want the sky baby\nI want the sky baby\n\n[Verse 2]\nIf the sky should fall\nAnd it all goes tomorrow and they foreclose on the house\nAnd auction off all my cars\nDon't cry for me Argentina, I mobbed the Beamer\nTook trips abroad, got mobbed in Sardinia\nIn Ibiza, I had pizza in the club\nLadies know I'm that guy, they wanna piece of my love\nNow they wanna do your boy like Mike in his prime\nBillie Jean, the goddamn boy ain't mine\nAnd the Roc break up, had the people losing hope\nCan't lie, they had Muhammad Hovi on the ropes\nNow I'm back in the go mode, back in the go-go's\nThrowing the diamond up, repping the logo\nRose gold, Rosé flow, I'm okay though\nWhat don't kill me makes stronger than before so\nHere we go and I'm not Domino\nWhen it all falls down, I'm like Kanye's jaw\nI might break but I don't fold, 'til I hold the sky in my hand\nYeah, that's my goal\nAnd then I bid you Freddy Adu\nProdigal Child, y'all not ready for the fu-ture, ture\nThen I disappear in the Bermuda Triangle\nMy name will be viewed such\nHere's to the man that refused to give up\nI want the sky nigga, chuuurch\n\n[Outro]\nI want the sky baby\nI want the sky baby", "title": "American Gangster", "image": "https://images.genius.com/778c1892b8a2f5aee554c4c797ca8915.1000x1000x1.jpg", "year": "2007-11-06", "album": "American Gangster"}], "artist": "JAY-Z"}