{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Games", "album": "Weekend Warrior", "lyrics": "[Chorus: computer voice]\nGames, you don't have to play, games with me girl\nYou, know, how, I feel\nOhh games, you don't have to play, games with me girl\nYou, know, how, I feel - ohh\n\n[additional computer voice]\n.. games, you don't have to play, games with me girl\nYou, know, how, I feel\nOhh games, you don't have to play, games with me girl\nYou, know, how, I feel\nOhh games, you don't have to play, games with me girl\nYou, know, how, I feel\nOhh games\n\n[Verse One]\nHi there good lookin, pretty sweet thang\nI really want to put you under my wing\nBut everytime I try you give me a hard time\nLike I'm a murderer, or commitin a crime\nI try to do everything right for you\nYou're always givin me excuses, makin me blue\nWhen I met you at Cancun, at Fiesta Americana\nYou lookin tasty like strawberries and banana\nI asked you your name you said Lee-Lee from San Fran\nShe said, \"I have friends but I don't got a man\"\nI said, \"Really?!  As good as you look?\nLookin like somethin out a Playboy book?\"\nI thought I struck gold, ching ching, the jackpot\nJust the thought of you it be makin me hot\nWhen I step to you, you act funny style\nYou need to marinate on this for a while\n\n[Chorus]\n\n[Verse Two]\nNow let me tell you like this baby doll\nI never guessed you would act off the wall\nGive me a chance for a little romance\nWe can dance and dine in Jamaica or France\nSomethin in the way you make me feel\nI like your personality, and your sex appeal\nBut it's all hard, not bein witchu\nYou're playin hard to get like catch 22\nSome people got time to play them games\nBut I don't, so don't call me no names\nLike all I want is sex, and take you no places\nAnd, why you always up in girls face\nYou know, I'm the B-I-Z, this is my job\nFans nibble on me like corn on the cob\nLet me tell you somethin, my word is bond\nLike \"Bonita Applebum,\" you gotta put me on\n\n[Chorus]\n\n[Verse Three]\nIf I didn't feel you, I wouldn't send you roses\nJewelry, furs, and designer clotheses\nYou know you got me, that's why you do what you do\nStressin and depressin, me and my crew\nYou know it's got to be real like Sheralyn\nOr you wouldn't be askin for an encore again\nI know you like me!\nSo you might as well \"Do the Right Thing\" like Spike Lee\nBecause I love you more than human eyes can see\nCause you got what I need, \"OH BABY!\"\nI don't know why you give me real rough times\nCause you're the one that rings my chimes\nYou bring me joy like Mary J\nI wanna do the same thing to you every day\nSo stop playin your games like Barry White\nYou know, you know, YOU KNOW!  AIIIGHT?\n\n[Chorus] - repeat to fade"}], "artist": "Biz Markie"}