{"songs": [{"year": null, "image": "https://images.genius.com/24534b93264edd6fa9e5967c765ab1f8.630x630x1.jpg", "title": "2 to the Stomach", "album": "Fastlife Music Presents: Code of the Streets", "lyrics": "[Intro]\nWhat? Yeah, my nigga Preem man\nCame, got me off these muthafuckin' streets yo\nWas out there doing my muthafuckin' thing\nIt's a wrap for y'all niggas now, ya heard?\nFUBAR, yeah, y'all go hoo-ha!\n\n[Verse 1]\nOh my god, y'all niggas didn't want none of me\nPreemo, you should've let me chill, leave me be\nBut now I gotta attack, pull out my rap stacks\nShow all these bitch-ass niggas they can get backslapped\nQueensbridge, that's my motherfuckin' kingdom\nPoet's my name son and that's where I came from\nI been a motherfuckin' terror ever since day one\nI was toting Glocks, niggas was playing with play guns\nEverything is motherfuckin' real I say dunn\nGet out my way dunn, I'm 'bout to slay dunn\nBeat you like a slave dunn, make you obey dunn\nPoet don't play dunn, the outcome? Critical, crucial\nThe shit I'ma do to you make hell seem beautiful\nI murdered this shit intro to outro\nI got real dogs that eat Alpo, straight take you out yo\nShow you what this gangsta shit be all about yo\n\n[Hook]\nPoet's coming, click boom, 2 to the stomach\nI give it to whoever want it\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, the thug poet\nPoet's coming, click boom, 2 to the stomach\nI give it to whoever want it, what?\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, the thug poet\n\n[Verse 2]\nPoet's coming hardcore\nWith a new style for the art of war\nLet the Hennessy flow, let my enemies know\nNiggas is dead if they not kin of me or friend of me yo\nYou're not ready for the raw deal, it's all real\nTryna penetrate my force field, get all killed\nYou don't want to see the Mac clip all the way filled\nBig nurse the motherfuckin' gat all in your grill\nMy shit is banned from TV, banned from radio\nYou gotta cop me on the low like a bag of dro\nI represent the street, I represent niggas hungry\nAnd they wanna eat that gangsta shit\nGuns out, blunts lit, polyin' over the strip\nRenegades, crack-slingin' soldiers\nHustlers locked down for moving real boulders\nThug bitches that don't play the kitchen, they play the street\n'Cause fuck that, hoes gotta eat\nPoet's comin'\n\n[Scratched]\nA thug poet\nThink I'm playin'?\n\nHit 'em with that shit Preem\n\n[Hook]\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, what?\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, the thug poet\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, what?\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, the thug poet\n\n[Verse 3]\nIt's a lot of niggas comin' in, a lot of niggas comin' off\nA lot of niggas frontin' like they ill when they butter soft\nCompetition looks thick, got a lot of niggas locked\nBut they ain't like me, I'm like you, I'm like from your block\nShot G's with gym stars, dump D's in marked cars\nStay a real nigga in the street and behind bars\nFuck the radio play, I don't need it anyway\nRemember back in the day in L.A., N.W.A?\nThat's the type of shit that I'm on\nGotta get my motherfuckin' shine on\nMurderin' every beat I rhyme on\nNiggas light up with me, bitches get drunk with me\nNo rapper and no company can fuck with me, see?\nStraight like that, I got that king cobra venomous rap\nGet in my face and I'ma give you a smack\nI'm on some what what, Noreaga shit\nPull out, spray this bitch\nBlaq Poet: hip hop's most dangerous\n\n[Hook]\nComing, click boom, 2 to the stomach\nI give it to whoever want it, what?\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, the thug poet\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, what?\nPoet's coming, click boom, 2 to your stomach\nI give it to whoever want it, the thug poet\n\n[Outro]\nShit happens any minute, ya heard?\nQB, QB's muthafuckin' finest\nGet outta here Preem man, fuck the bitch-ass niggas"}], "artist": "Blaq Poet"}