{"songs": [{"year": "2008-07-25", "album": "Not 4 Sale", "image": "https://images.genius.com/f0a901d03b5db37284706922ef6d3d03.1000x1000x1.jpg", "title": "Burnt", "lyrics": "Hello...\n\n[Lindo P talking]\nAiyyo! Ladies and gentlemen ha ha ha!!\nWelcome to the team wit the mighty Black Jays yeah!!\nAll di wicked heart dem ... who a dat we a know!!\nBun dem up mi wuk fi di lighter ya mon!!\nYo blaze dem up burn dem up mon!!\nYeah yo Kardinal!! Heh\nYa need summa, Black Jays!! Ha-ha!\n\n[Kardinal Offishall]\nYo! Come mi suh mek a likkle way\nHere comes the Fireman and mi no play\nSounds get a little ??? from the verses that I spray\nRemember I don't play and I don't take no disrespect in any way\nGangsta - I hear dem likkle punks\nI see the crooked way you like to walk\nBut Jah Jah has a better understanding of the way I like to move\nAin't got nothing to prove and I am not wasting a second checkin you\nPunk - the speakers in the trunk\nThe bass is overloaded feel the tump\nThe highs are sounding high-high super high\nWatch a di man dem kiss the sky\nEverything a everything so you know Kardinal don't have to lie\nNah - the world is what I want\nI'm not gonna lose my flow trying to flaunt\nMe nah gon' try and fit in with the Devil I am on another seat\nEASY MY YOUTH LYNDO P WEH YA SEH RUDE BOY!\n\n[Hook: Lindo P]\nA me say make.. way..\nHere comes the Fireman (AHH!)\nWith ganja hennessey all inna hand (yo)\nWoman touch we pocket and take out a couple grand\nDagger pon me hip and mi ting inna hand\nWhaa-whoi-whoi-whoi YOU!\nBoy full time shoulda learn\nYou play with the fire get burn (Cho!)\nMaking money a black jays dem concern\nSpin the record deejay blaze it make it burn\nBuuuuurrnnnnn!!\n\n[Kardinal]\nYo! I represent my crew\nSome youths they love to talk until they blue\nMy family will look out for each other cause that's how we haffi do\nWe ain't talking to you or we ain't dealing with a likkle interview\nGWEH!! Big up to Mr. Hakim\nWe controlling the scene and making green\nSome people think dem haffi pay to chatter and talk all bout dem machine\nI don't live in between and I am not concern with hold no magazine\nCHO!! I am just who I am\nI been this way since I was inna pram\nAnd naturally we all are insecure but ya haffi dash wey that fi sure\nSoon as it hit the door ya haffi mek dem know say man a come fi more\nYEH!! More than the rest a dem\nI do not feel no ways if you no blend\nCause they will always want the righteous man\nFi bob we head and make it bend\nThis youth can not pretend (DASH WEH DAT!!!)\n\n[Hook]\n\n[Kardinal talking]\nBurn! A mi say fiiiiiiiiire!!\nRighteous man liveth forever and I-ver more\nA-hahahaha! Yeah! Black Jays (a mi say fiiiiire)\nKonvict family stand strong unno rude bwoy!\nHeh heh heh heh... (ahhhh!!)\n\n[Hook]"}], "artist": "Kardinal Offishall"}