{"artist": "Famous Dex", "songs": [{"year": "2014-11-04", "album": null, "image": "https://images.genius.com/a257a03f4e2e50206124ebd7182c626f.591x591x1.png", "lyrics": "[Intro]\nFuck being on some cool shit\nI be like, \"I never knew the rules,\" bitch\nBad bitch, I'm tryna give her pool stick\nAnd if the bitch still like it, give her the full clip\n\n[Verse 1]\nOh, Lord\nMan, these bitches going overboard\nHad to cut this bitch off, yeah, extension cord\nRiding 'round in a foreign, something you can't afford\nTwo bitches in the back kissing on ya boy (Thottianas)\nYou wife that bitch?\nI'm like, \"No, boy.\"\n\"No, boy. No, boy. No, boy.\"\nHah?\nMan, that bitch is a thot\nMan, she fucked the whole block\nAll she wanna do is cocks\nI went zero to a thousand, nigga, real quick\nAnd you can get drilled if a nigga touch the kill switch\nMy body need mollies, nigga, pill sick\nAnd fuck poppin' one, I pop two and then I'm healing\nThese hoes going, I'm like: \"Kiss then. Lick then. Flip them. Diss them.\"\nI ain't got time for hoes\nI'm just cooling with the bros\nFive thousand for a show\nShout out to this lil bitch, her head real sick\nThese hoes ain't loyal, man, I'm lookin' for a real bitch\nAnd free my nigga Mack, he ain't did shit\nAnd when he come, I swear to God, he gon' kill shit\nFuck all that \"Dex, go to school!\" shit\nI be on the block and we do this\n30 and them mops and them ruler sticks\nThey say, \"You from Englewood?\"\nI'm like, \"No shit!\"\nOh, no\nWhat you think I keep a gun for?\nMAC's on the strings like a yoyo\nBullets hit his stomach then his damn throat\nFree my nigga Lil Savage, yeah, Pico\n\n[Outro]\nY'all know how I'm rocking, man\nLike rocks on my Robin's, I'm shining, man\nShout out to my manager, C-Roc, man\nShout out to my twin, Fat Daddy, man\nShout out to all of MOE, man (Gang)\nReal quick\nZero to a thousand, nigga, real quick\nReal quick, real quick\nAnd you can get drilled if a nigga touch the kill switch (Gang)", "title": "0-1000 (Remix)"}]}