{"songs": [{"title": "Deuces", "album": "Good Grades, Bad Habits", "year": "2015-01-01", "image": "https://images.genius.com/54112e8129ee2d68a052681e8cda020c.500x500x1.jpg", "lyrics": "[Intro: Lil Skies]\nUh, one time for the, one time for the\nHuh, one time for the\nLook\n\n[Verse 1: Lil Skies]\nI'm wearing all gold like a king\nRubies with the diamond rings\nFuck the bling, chasing dreams and serving them to the fiends\nI'm a minor in his cold mind with the cold mind of Einstein\nDropping knowledge every line\nI'm god, they can't tell me nothing\nWhy is you bluffing? I'm the topic of discussion\nFaded off this robitussin\nI'm a Nikon to my youth, lyrical in the booth\nCaptain of my troops, letting loose, I'm busting on her tooth\nMy flow nasty and grimy, promise I'm back at it\nSmashing all you rap faggots who always been backstabbing\nTeachers told me, \"Focus\", but fuck it, I'm writing lyrics\nRaising spirits, holy and gifted, I hope you hear it\nI only fear god in the odds of being odd\nWithout a prod, rappin' everyday like it's my job\nI know that's the motion, wrap my Jimmy in a trojan\nBefore I swim in the girl's ocean\nIt's funny how they think they know me\nMy mind's suicide, yet, I'm feeling too alive\nSee me and Neek we rise but y'all hate\nNiggas faking, wanna be a Jason\nWorking on my education\nTryna make it to my destination\nBut me, being me, I just wanna get high\nRide past pretty bitches here in Malsay High\nBut, hey!\nLife's a game but this ain't no fucking 2k\nDon't give a fuck about what you say\nI'm chucking up the deuces, bitch\nI'm chucking up the deuces, bitch\nSaid, I'm chucking up the deuces, bitch\nI'm chucking up the deuces, bitch\nIm chucking up th-\n\n[Verse 2: Neek]\nI'm having visions of givin', givin' up on this competition\nAnd saying, \"Fuck it man\", and givin' in to the opposition\nBut then I start having visions of how I was sitting\nAt my desk in sixth grade writing rhymes in my composition\nOf the curvin' life I'm livin'\nIf that ain't too fulfilling than I don't know what's appealing\nIt's like everytime I write\nMy future life becomes revealing\nBut, it's crazy 'cause the future is still so concealing\nLayin' back with my eyes on the ceiling\nCan't even tell you what I'm fuckin' feeling but I'm thinking 'bout a million\nA million damn ways to help my mom care for the children\nNew cup, new crib\nYeah, that's a good-ass feelin'\nGivin' up on the world\nAnd no longer givin' a fuck 'bout a girl\n'Cause when you worry 'bout girls\nThat shit will fuck up the world\n'Cause you gon' say, \"You my world\"\nThen buy her diamonds and pearls\nBut in the end, she gon' switch up\nMan, that's the way of the world\n\n[Verse 3: Neek & Lil Skies]\nSo don't be trustin' these girls\nThey all they slick but greasy like Jheri Curls\nOn a scale from 1-10\nWe masterminds with the pen\nAs we sit in the wind\nWrite rhymes they comprehend, so!\n\n[Outro: Lil Skies]\nI'm chucking up the deuces, bitch\nI'm chucking up the deuces, bitch\nI'm chucking up the deuces, bitch\nI'm chucking up the deuces, deuces\nI'm chucking up the deuces, deuces\nI'm chucking up the deuces, deuces\nBitch, bitch, bitch, ha-ha!\nI'm chucking up the deuces\nNeek, we ballin' in a new way\nI pull up with a new wave, a new wave, a new wave"}], "artist": "Lil Skies"}