{"artist": "Waka Flocka Flame", "songs": [{"year": "2009-10-17", "lyrics": "[Intro]\nOne-zero-one-fucking-seven\nBrick Squad!\nYeah, nigga, I'm finna annihilate your ass, nigga\nOne verse, pussy ass nigga\nI ain't even got no hook for this shit\nBut this shit is so super duper personal, my nigga\nLike, real talk\nLike, homes so super lame, like\nI perform at Libra, I get off the stage\nThen homes start popping shit about a nigga\nEgo tripping 'bout a nigga\nThe same nigga that wanna borrow a hundred dollars?\nThat nigga\nThe same nigga that say he balling, sleeping at hoes' house\nDriving hoes' cars and shit\nThe same nigga, like...\nCome on, man, this Flocka, nigga\nY'all niggas got me fucked up, nigga\nLeBron Flocka James, nigga\nAin't shit changed, nigga\nI still scrape up dollars and change, nigga\nReal talk, nigga\nNo hook shawty, boy\nOne verse, you pussy ass boy\nFor real, nigga\nThis shit real, my nigga\nThey can't calm me down, nigga, right now, nigga\nI'm on Hulk right now, nigga\nEverything green, nigga\nDiamonds green, gang green, nigga\nFuck y'all niggas talking about, nigga?\nWaka Flocka, nigga\nThese niggas got me fucked up, man\nReal talk\n\n[Verse]\nThrowing bullets back, don't wear throwbacks\nHe talk like Gucci, act like Gucci, rob ice like Gucci\nBoy, stop! That's middle-of-the-mall jewelry\nEgo tripping have these goons knock off your koofy\nBetter calm down before I fill that fade\nWatch your chain, I'm throwing beads off, pussy nigga, what the fuck you claim?\nWe ain't the same clique, same label, the same gang\nThis is a public service announcement to the fake Gucci Mane\nThem people on the east side [?] you, nigga\nI ride on the B side, who are you, nigga?\nYou could play Ken, then I'm Ryu, nigga\nYour clique not really right, fake Damu, nigga\nJealous and he envy me 'cause I'm realer than him\nJealous and he envy me, call the pussy Throw-B\nWaka Flocka Flame in the club, where the gangstas be\nIn the club, rolling up nothing but that stinky tree\n\n[Outro]\nLittle pussy ass nigga\nYeah, nigga\nOne verse your ass, nigga\nI hope you heard this shit, nigga\nYou lucky, my nigga\nYou know my momma, I know your momma\nThat's why I can't touch your pussy ass, nigga\nYou know a nigga put that hands on a nigga, you gon' call 12, nigga\nYeah, nigga, and I heard when you was in prison, nigga\nYou was a trustee, nigga\nYou wasn't no real nigga\nMy nigga told me you wasn't even in the population, nigga\nStop popping like you gangsta, my nigga\nReal talk, nigga, selling honey buns to get tattoo'd\nThen come out, wallowing like you hard, nigga\nYou ain't no real nigga\nWaka Flocka Flame\nGone", "image": "https://images.genius.com/a7f4cdca00f823e421f5447e42ad6de2.500x500x1.jpg", "album": "LeBron Flocka James", "title": "1 Verse"}]}