{"songs": [{"album": "Black Friday", "year": "2015-11-27", "title": "Black Friday", "image": "https://images.genius.com/1aeee685f8ca3c2c5ac3ca265ab0ac37.500x500x1.jpg", "lyrics": "[Produced by Pharrell Williams & Sounwave]\n\n[Intro]\nYeah\nTen toes to the ground\nYeah\n\n[Hook 1]\nLet's get the proceedings proceeding this evening\nNo Promethazine I’m a king, no leaning\nI got a better way to fight these demons\nFuck do you know ‘bout my pain? blaow\nLet's get the proceedings proceeding this evening\nNo Promethazine I’m a king, no leaning\nI got a better way to fight them demons\nFuck do you know ‘bout my pain?\n\n[Verse 1]\nIf I quote it nigga, I wrote it nigga\nSix head shots, I’ll erode a nigga\nPop another clip and I'm reloaded nigga\nAin’t no way around it, I’m the coldest nigga\nDo a nigga dirty life's a coal, my nigga\nGet you cleaned up then I fold you nigga\nShout out to the haters who promote a nigga\nFlow hot, whip cold, I’m bipolar nigga\nBut I don’t like to talk about a Rover nigga\nKeep this shit a hundred, I just sold it nigga\nTired of police looking at me like I stole it nigga\nProbably just gonna cop a lil Corolla nigga\nDon’t need a rollie on to know I’m getting older nigga\nDreamville going way up like a floater nigga\nCouple hands out like I owe them niggas\nWhere was you when the Civic was getting towed my nigga?\nNo snakes in the grass cause I mowed it nigga\n\n[Hook 2]\nFuck do you know ‘bout my pain?\n(Right there let me get that there\nTalk about it)\nFuck do you know ‘bout my dreams?\n(Talk about it)\nNada\n(If you really believe it, gotta talk about it\nYou heard about what happens when you talk about it\nNiggas lookin’ at you funny when they start to doubt it\nFucking up your energy when you start to doubt it too)\nRollercoaster ride\n(Start to doubt it too)\nHow much do it cost?\n(Start to doubt it)\nIf I take a ride, fuck around get lost\n(Shoutout my nigga Ib)\nRollercoaster ride, how much do it cost?\n(El Presidente and shit)\n(He want me to talk my shit for y'all)\nIf I take a ride, fuck around get lost\n\n[Verse 2]\nCole world you should stay off this dick\nI sold out the Garden, I should play for the Knicks\nTook a couple minutes and I sold out Staples\nA nigga getting cream like an old ass Laker\nBut I ain’t coming to talk about all that paper\nThat’s what they talk about when they ain’t got shit to say\nCan’t understand why niggas never got shit to do\nYou know the saying, same shit nigga, different day\nI never felt that, no way\nCause on the same day a nigga doing different shit\nSpit different flows hit different chicks\nLet my Brixton hoes feed me fish and chips\nWhy I do a lot of shows? I’m the shit, that’s it\nGot suicidal doors, I just slit my wrists\nNever stingy with the hoes word to Cliff and Chris\nSo if I fuck six bitches I got six assists nigga\nThe flow sick as shit, catch ebola if you bit this shit\nI never take, I invent the shit then flip the shit\nThen lick the shit, and bit the shit back twice, I’m that nice, woo\nWhat’s the plan?\nCole keeps snapping like a Mustard jam\nGot a middle finger for Uncle Sam\nI done paid so much taxes I can fund Japan\nBut instead they make a young nigga fund the man\nSame man that keep a young nigga under, damn\nI just cocked back nigga and my gun don’t jam\nOn a scale from one to ten I’m a hundred grand\n\n[Outro]\nIt's Cole fuckin’ world nigga\nDreamville in this motherfucker, Top Dawg in this motherfucker\n\"When you and K. Dot shit drop?\"\nBitch never, they can’t handle two Black niggas this clever\nBut this February, bet shit get scary when I fuck around and drop...\n(Censor Tone)"}], "artist": "J. Cole"}