{"songs": [{"year": "2012-01-01", "image": "https://images.genius.com/bdb1ca23b418b0572caba92910aaa741.600x600x1.jpg", "title": "Nigerian Email", "album": "History Will Absolve Me", "lyrics": "The truth already set sail, I'm looking for reasonable doubt\nThe check's in the mail and I promise not to cum in your mouth\nI was born during a drought, I was born to a house divided against itself\nI was born into the mouth a well amidst poverty\nDad died, they gave me his stuff\nI put a couple more notches in the belt\nPlay the hand you dealt, DC on melt seeds poppin\n98 not gonna release your delta h meridian\nBush weed got me feeling like a kid again\nTraffic island gilligan, dwb except the pat down like a second class citizen\nNo need for the sugar coatin', have you seen any brothers on the moon?\nI got you open, Scott ? with the shank you get cut and ganked gaffold leaking from the poking\nBig bank take little bank, Zimbabwean dollars what I'm holding so I'll take that now\nThanks, ? with the boy golden\nFace bloated wrists frozen\nWhen he wave from outdated Soviet tank don't be frontin like you dont know him\nBuried in fatigues soldier slim, i see murder in a crimson tie, george teague\nThe overlook hotel is where I've always been\n\nYour frame of reference is Brick Squad\nMine is Poppa Large, big shot on the East Coast\nAin't what it used to be, but I'll take it\nI done boast cowardly threat, flow make shift\nHey momma! I finally made it!\nNo lie, son jumped out a third story window when we got raided\nMy feet never left the floor, I'm on that James Naismith\nSoft spoken, unabraisive\nPolitely asked whitey to loosen the bracelet\nCuba Gooding his way out of central booking\nHot date? I do the cooking\nTurns out she stays up in the Bronx, I'm in Brooklyn\nThat commute ain't appealing\nBest not forget your earrings\nSummer heat searing\nShe's dressed for it so of course the streets is leering\nMy skin's crawling, stomach turning\nThis Bill Belamy cornball honking and swerving\nShe hardly seem to notice, focused like bourbon\nMe? I break up trees on your fourth generation imitation Premier beats\nThat's definitely not the flavor\nAnd trust me you not doing the 90's no favors\nLouie the 14th in a clean glass piece slow motionley major\nTheme music for stolen credit card movements\nThey caught the most etherest of vapor\nWhite suburb, black neighbor\nI'm high like black mayor\nRivet city ransom\nBut the hoe need no savior\nSheesh, she got me repeating myself\nI'm gonna go get the papers, get the papers"}], "artist": "​billy woods"}