{"songs": [{"image": "https://images.genius.com/fe7d5810fa51b8e81d7eeb21c834aab1.499x500x1.jpg", "title": "Get On Your Knees", "album": "I Need Drugs", "year": "1997-01-01", "lyrics": "\"Baby, Baby I'll get down on my knees for you, if you....\"\n(repeat 5X)\n\n[Necro]\nMotherfucker you know the deal, How I rep up on this porn shit\nSo yo! Suck it\n\nI lounge gettin blown by PJ sparks at key west\nI need breast like Sahara needs a HIV test\nI'll hit that pussy up with a nasty attack\nGet on your knees like your looking for that last piece of crack\nFilthy like Al Louis, jerking off at seventy\nOr serenity, swallowing my twenty inches of obscenity\nI'm paying a good buck\nSo slut, you better fuck as good as you look and suck as good as you fuck\nWhen it comes to this porn shit you know who the master is\nBitch I'll leave Necro tagged on your ass with jizz\nSex in the ninteys without a rubber? Yo! thats dead\nI like skinny bitches but Debbie Diamond looks like a crackhead\nPorn is infested with obscene woman\nVanessa Del Rio word is bond looks like a she male version of Gene Simmons\nI'll fuck you in your shitter\nThrough your panties, you'll be making mad noises\nDressed up fancy shmancy, screaming out like a banshee\nInside a basement somewhere close to Delancy\nWhere the corner is infested with hookers that look like Brandy\nWhen it comes to this porn shit yo! nothing's new to me\nSo yo! Dion tell them what you fucking do for me\n\n[Dion]\n**\"Baby, Baby I'll get down on my knee's for you, if you....\"\n*Scratching* \"Get on your knees\"\n*Scratching* \"Get On Your Knees\"** (repeat 4X)\n\"Begin to Blow\"\n\n[Necro]\nI'mma hit you with shots of cum\nKelly LeBrock didn't know how to suck cock\nBut teaching her was lots of fun\nProtein eruptions filmed on porno productions\nAbductions of sluts that dont know how to suck dick, here's instructions\nPut your head down between my legs\nAnd learn the craft, of how to lick and suck\nFirst the head then my entire shaft\nI have diplomacy in sodomising Ona Zee\nIm know to be, quick to fuck madams like Buck Adams\nJuggle my lizard tounge in your snatch\nLickin Lana Sams tits be like\nLicking a cutting board with two points attached\nBelieve me I've tried it often\nMy schlong almost put Nina Heartly up in a coffin\nMy cock ain't never soft\nIt stays solid twenty for seven bom'\nEver since I fucked Medusa clit that snake pit turned my shit to stone\nRiz Tony ebony needs twat, be rauncy\nPut a biscuit to Ginger Lynn head and forced back in the porn, G\nTraci Lords dont think you're excused, from geting further abused\nCause your torpedo shaped tits be jewels\nYou can't handle it, why is your slut bugging?\nDon't she know shes in for intense fucking\nSucking and butt plugging\nWhen it comes to this porn shit yo! Nothing new to me\nSo yo! Dion tell them what you fucking do for me\n\n[Dion]\n\"Baby, Baby I'll get down on my knee's for you, if you....\"\n(repeat 4X)\n*Scratching* \"Get on your knees\"\n*Scratching* \"Get On Your Knees\" (repeat 4X)"}], "artist": "Necro"}