{"artist": "Ice-T", "songs": [{"title": "Depths of Hell", "lyrics": "* strictly best guess only on Daddy Nitro's reggae patois\n\n[Daddy Nitro]\nNow hear dis!\nAll bad man what dey a know\nThe original bad man dey a know, seen?\nDaddy Nitro, an' Ice-T dey 'pon ? man\nCome talk wit reality\nAn' any guy who nah like dey got shot in ? face\nNo Ice-T, come talk wit reality star\nTell dem bout da endin of da world today.. COME!\n\n[Ice-T]\nI got a attitude as thick as a convict's\nBomb ticks, my heart beats as I rhyme over hard shit\nWatch this, the nigga that you didn't think could do\nBreak through with the rhythm that'll rock your whole crew\nThought you knew; I ain't no punk or no pooh-butt\nStep to me, the cops are still diggin niggas up\nWhat's up? What's up? What's up? You wanna try your luck\nYou move you weave you bob you got stuck\nAnd now you're trippin with your fuckin brain\nYou never seen so much blood pour through one vein\nYou try to scream, you choke\nYou try to run, your legs are broke\nYou're bulletproof I hope..\nYo, I ain't no nigga to flex, but I will flip\nFuck up a nigga and dropkick his fuckin bitch\nI love to squabble and I'm good widdit\nSo if you want some nigga come get it\nI ain't trippin nigga trippin at all\nYo, I'm fuckin walkin over weak rapper's downfalls\nIt ain't my fault they fell, it ain't my fault I sell\nI pull my ass up from the depths of hell\n\n[Daddy Nitro]\nLawd! Jib-bibbidy-bong, jib-bibbidy-be-bong-ska-dang\nDaddy Nitro an' Ice-T come wid a different some-thang\nComin out de ghetto tings are wild like pure 'ell\nNuff man get ? in my firebomb sale\nSome a sell coke but the music we a sell\nWe no inna doubt, we don't want no ambulance bell\nWhile other lyrics are full of our style we fill up our clientele\nIce-T an' Nitro from the, depths of 'ell, COME!\n\n[Ice-T]\nYou punks are jealous cause I'm rollin in fly shit\nMy shit, all paid for and I don't owe no guy shit\nFuck you, it ain't my fault your ass is on empty\nThought you was it, but you're smooth gettin pimped G..\n.. I ain't no ho fool\nGot much respect for the new and the old school\nBut many rappers can rip mics but can't count..\n.. zero bank amounts\nWord and many critics are hot cause hard rap hits\nThey like to make it all soft that we pop shit\nFuck that, I'll die before I let the hardcore go\nCause I'm a nigga from the G-H-E-T-T-O\nI got a posse who's airtight, quick to fight\nAnd got the power to continue or end the night\nAnd if you stepped on wrong, then you're a done kid\nThe yellow tape's in the club because one did\nI got no pity so don't ask me for fuckin any\nI'll break a bum off but you niggas can't get a penny\nWhen I was broke, I stole my gold, I pawned\nI lived the life of a hustler off and on\nI'm just a brother that lived to tell\nI brought my ass up from the depths of hell\n\n[Daddy Nitro]\nCome! In a de ghetto tings are wild round de clock\nSome man a smoke crack and soem man a fire shot\nMe tell de people dem laws, that we no inna dat\nIf a guy try dat thing we get them sixteen shotta\nIt's a lovely night ?? ?? off de chatta\nEasy Ice-T make them no say you a mark-a\nAnyway we go on I bet a no say we stop\nWit lyrics and de music and right on de ?\nEASE UP and come again my selector\nAll over de world is only for pain an' sufferin\nThat's why Ice-T and Daddy Nitro come wit the reality thing\nNice this everytime star\nMan like Ice-T 'pon the ?? man\nCome in star, one last time and teach dem bout reality\nNow watch dis, COME!\n\n[Ice-T]\nI met this girl who act like I owed her somethin\nNothin, all I owed her was some good steady fuckin\nFuck that, not the one that's gonna fall on no ho trap\nEase back bitch, before you need all your teeth back..\n.. I ain't no fuckin mark\nMade all my money workin bowcutters in the dark\nSnatch bars and cars and vice grips\nLong handled sledgehammers, saws and wire snips\nI got an ill side that drips from my brain at times\nIt still thinks of the psycho and brutal crimes\nI still remember when I had a low cash flow\nNo hoes, no cars, no gear no dough\nAnd times got wicked..\n.. I even remember havin to sell all my pawn tickets\nBut suckers spread out and they left me with few friends\nBut that's who wit me as we fuck up the true ends\nSo don't be trippin if your luck's gone bad, be glad\nIt'll empty out the fake fuckin friends you had\nThen get yourself together, nigga aim straight\nShoot point blank at your goals, work hard and wait\nYou can do it even if you fell\nI brought my ass back from the depths of hell\n\n[Daddy Nitro]\nCause we are serious, en-ter-tain-ers\nTalk about de Ice-T, he no joker\nCause we are serious, en-ter-tain-ers\nTalk about de Daddy Nitro me no joker\nMe come and pull up my lyrics and full up my style\nAnd full up our lingual\nAs me sit upon de riddim I'mma sit on proper\nAs me flow upon de riddim like a rockin of de gong\nMe sit upon de riddim like a true ??\nMan no listen Daddy Nitro like a fierce ??\nMe flow upon de mic from a ?? area\nPam pamma, original chat masta\nMe pam pamma, original chat masta\nMe pam pamma, me come fi set fi dance pon fiyah\nAn' if it's on, well you must fi chant up hiyah\nMe say dis a Daddy Nitro steppin ?? ??\nCome down, no try to diss and no dismiss de kid\nAs me sit upon de riddim wit de man Ice-T\nAll of de massive up here listen to me\nRespect me come from inner New York Ci-ty\nDie gon test me, man go dead and buried, COME!\nEase up man, FIYAH\nWicked every time.. woy! Woy! Woy! Woy!", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}