{"songs": [{"year": "2009-02-24", "album": "Troubadour", "image": "https://images.genius.com/2d335571e608b43f30bd8a89e1fa6d38.1000x1000x1.jpg", "title": "America", "lyrics": "[Intro]\nUh huh uh huh uh huh\nOh this takes me home\nIt makes me think about sitting outside of my old home when I was younger and singing something like\n\n(K'Naan in Somali)\nGabaryaray shuxaano\nMaro Shabeel eh xirato\nMaro qafiif eh huwato\nMagacaaga ii sheeg\nMagacayga waa Sharaf\nSharaf, Xaaji weyaan\nAqalada xiriirta\nDhinac baa ka jooga\nAla yaa usheega?\nTinta ushaleeya?\nNaa hoéy Zamzamey\nSabaax nuurey\nAdoo kilkiley\nIyo\nKaloon badanay\nAdoo xajka jira\nXasuus badhanay!\nSaxiibtaa\nCaasho, cashaq baa dhilay\nUgu dhambaystina\nAniga iyo geel uba\nUgu banaan bixin\nWaa aniga orodneey\nNabad dheynee\nMareekan waa laga soo waayey\nMareekan waa laga soo waayey\nMareekan waa laga soo waayey\n[Repeat x2]\n\n[Verse 1: K'Naan]\nThere are certain things fresh and certain things mish\nI got my own sound I don't sound like the rest\nAnd even my attire and my choice of dress\nAnd not long ago I don't spoke English\nMy point is police pull me over a lot\nThey wonder what kind of rap sheet I got\nAnd sometimes I take a young girl out to eat\nAnd hold the door open, \"Oh, you're so sweet!\"\nOf course my affection's super illustrated\nAnd I like to give don't reciprocate it\nUnless you could give me someone innovated\nWell lets cook it up we dont refrigerate it\nBut back to the country of the educated\nWhere people get robbed and they celebrate it\n\nWaa aniga orodneey\nNabad dheynee!\nMareekan waa laga soo waayey\nMareekan waa laga soo waayey\nMareekan waa laga soo waayey\n[Repeat x2]\n\n[Verse 2: Mos Def]\nMaraken, my country 'tis of thee\nSweet land for robberies\nDope smoke and SUV’s, red meat and army greens\nFat and frills, thrills and spills\nEat and sleep, hump and kill\nShop til you drop, work til you dead\nGet all you can, then get in the wind\nOutta my face on your knees\nSleep in the mansion, shut out the streets\nMake that cake, whoop that trick\nLick my swagger suck my sick\nGet high get low get stcky get rich\nGet yo own show get down get quick\nYou slow you blow you broke your fix\nTerror dome, home swag home\nTerror dome, home swag home\nHome swag home, home swag home\n\n(Somalian(America))\n\n[Verse 3- Chali 2na]\nThere are some things pure while certain things blur\nDilute it with the lie and you believe when it occur\nFalsified information got my people in the stir\nWe have to be in search of something equal to the cure\nStraight out the door, I come to give you more\nLay the law keep it raw, when I speak it from the core\nGet underneath your skin like especially with the claw\nConflicted with the rich cuz I kick it with the poor\nI laugh in the face of adversity\nSound clashed with the bass cuz its natural to me\nBut if you pay attention to the past you will see\nNot long ago you black they'd hang your ass from a tree\nCertain things things change, while some stay the same\nSome are recluse others are lovers of the game\nI'm trying to walk the lane, the Sirat al-Mustaqim\nInstead of doing things they keep you covered in the flame\n\n(Somali)\nNanananana that shit was cool in English, but let me get that Somali verse\n(Somali)\n\n(Somali until fade out)"}], "artist": "K’naan"}