{"songs": [{"year": "2014-07-15", "title": "Whip (Areyoudown?)", "image": "https://images.genius.com/a4d52942eb4b120225094d0e316c3b15.800x800x1.jpg", "lyrics": "[Produced by Ken Ross and Saba]\n\n[Verse 1]\n\nSeventeen livin' out a dream while these niggas want to sleep, sleep\nSeventeen I'mma steal the keys while my mama go and sleep, sleep\nSeventeen with a new love for the streets, streets\nSeventeen hitin' seventy on the highway, highway\nCause you just want to see outside\nBut the bus don't run this late at night\nOh how lovely it'd be to take you for a ride\nIn the streetlight your face glows\nBackin' out the driveway (driveway)\nOne hundred on a highway (highway)\nA youngin' on a joy ride (joy ride)\nAnd I hope that they don't find me (find me)\nI know my mom will never find out (find out)\nIf she isn't awake by now (by now)\nI'mma whip it 'til it's light out (light out)\nShit I just grabbed the keys like I'm out\n\n[Hook]\n\nAnd about in the whip, whip, whip, whip, whip, whip, whip, whip\nOut in the whip, whip, whip, whip, whip, whip, whip, whip\n\n[Verse 2]\n\nSeventeen livin' out a dream while these niggas still sleep, sleep\nSeventeen I'mma steal the keys while my mama go and sleep, sleep\nSeventeen with a new love for the streets, streets\nSeventeen hittin' seventy on the e-way, e-way\nBackin' out the driveway (driveway)\nOne hundred on a highway (highway)\nI whip it on a Wednesday (Wednesday)\nWatch how I treat it like it's Friday (Friday)\nA youngin' on a joy ride (joy ride)\nCalled my lady, I'mma slide, just enjoy the ride\nI cannot complain with life since it's goin' right\nBut if we caught then we goin' down for the night\nHer memory resemble the mileage\nDon't let mama find out, she would trip about it\nI went for a trip paid for by my allowance\nI'm loud as a mouse then out the house\nAnd I'm out on the town and I swear\nI whip like I'm Kunta\nThat whip like too crucial\nCause you just want to see outside\nBut the bus don't run this late at night\n\n[Hook]\nOut in the whip, whip, whip, whip, whip, whip, whip, whip\nAre you down to trip, trip, trip, trip, trip, trip, trip, trip\n\n[Outro]\nAre you down? Are you down? Are you down?\nAre you down? Are you down? Are you down? Are you down?\nAre you down? Are you down? Are you down?\nAre you down? Are you down? Are you down? Are you down?", "album": "COMFORTZone"}], "artist": "Saba"}