{"artist": "Paul Wall", "songs": [{"album": "Heart of a Champion", "title": "I’m On Patron", "image": "https://images.genius.com/a57ebc00e63298f7cb6a61085942af55.1000x1000x1.jpg", "lyrics": "[Intro]\nBeanz N Kornbread\n\n[Hook](x2)\nI'm on Patrón, I just took seven shots to the dome\nI'm gone, so gone\nSo dude, can I get a ride home?\n\n[Verse 1: Paul Wall]\nAy, what it do?\nI'm on like a light switch\nMy wrist wear froze up like a computer glitch\nI'm drinking 151, Caribou Lou\nTech N9ne 'gon get it jumping like a kangaroo\nIs it your birthday? Let's go and have a shot or two\nMy partner Glu you put me on to something new\nSnuck in a gallon of lemonade from Chick-Fil-A\nMix it up with this Ciroc and we 'gon parlay\nI'm looking for a hot girl that like to a-bay-bay\nCome out and play and let me see you shake it this way\nThat Patron clears day, I'm on it hard\nGetting lit with my dogs, having a party with these broads\n\n[Hook](x2)\n\n[Verse 2: Paul Wall]\nGo and pop another bottle, get this party to cracking\nAll these barbie doll models make the champ start macking\n550s everywhere now Big Cat in heaven\nHe on his fifth Remy at 7\nIt ain't even 11\nThug boss Slim Thug drinking GPO\nGrey Goose, Patron, and Orange Juice\nPour me some more\nNow Box and Poppy Joe just ordered the rose mo\nChucking deuces to my partner, Hi-C and Big Do\nI'm loaded like a full clip\nLeaning like a sinking ship\nLit up like a Christmas tree\nHow much throwed up can I get?\nC-Stone and Lil C, bringing out the Jägerbombs\nIf I get pulled over DJ Jonny pay my bond\n\n[Hook](x2)\n\n[Verse 3: Paul Wall]\nI keep bumping into people say\n\"Man my bad. I'm intoxicated a tad and the DJ acting bad\"\nMiskin Mike and Stag, my family getting slammed\nBeanz N Kornbread just bought a round of Belvedere and cran\nMan, I'm so throwed I can't think\nWho the hell been putting their lips on my drink?\nWhat the hell the waitress doing with my change?\nSomebody slipped me a thizz pill, I'm feeling strange\nMaybe some Red Bull will help me sober up\nMatter fact, mix it with this Grey Goose in my cup\nI can barely stand up, I'm about to throw up\nIf you can't roll with the big dogs, go hang with the bucks\n\n[Hook](x2)\n\n[Outro]\nBeans and cornbread", "year": null}]}