{"artist": "A$AP Rocky", "songs": [{"title": "Bass", "image": "https://images.genius.com/5fb9bbbba50174ef41a0dd1f68902363.500x500x1.jpg", "album": "LIVE.LOVE.A$AP", "lyrics": "[Intro: Bloody Loco & Voice 2]\nSo recognize that shit, you better fuckin' recognize that fuckin' name right now...\nI recognize, I recognize\nA$AP\nRecognize that shit, A$AP\nA... fucking $AP\nI recognize\nYou don't play no fuckin' fear in my heart\n\n[Verse 1: A$AP Rocky]\nThese other niggas so-so, they open off my mojo\nSpanish Sophie with a half a kilo by her cho-cho\nBlow it out your culo, who got dough on the smoke though\nMy partner had cinco now we blowin' on that ocho\nBozos love my rose gold, purple got me slow-mo\nStuntin' like I'm Dorothy but my rubies in my gold though\nWhat you think this four for, these niggas must be loco\nSteppin' on these bricks and for your fix so call me Toto\nFollow me, follow me, follow me now\n\n[Verse 2: A$AP Rocky]\nNow I'mma come through getting down\nGot a new Cadillac with a diamond in the back\nGot a bitch and she bad with about a hundred tats\nGot my goons on deck, and we got a hundred straps\nWhat you know about that, got me swaggin' to the max\nEverybody know we got the shit and baggages to match\nBetter come correct, fuck what the basis is\nGold grills like a set of new braces\n\n[Verse 3: A$AP Rocky]\nWhy they comment on my set though, they lookin' cause my neck gold\nAnd I let that Tec show... hear that echo?\nLet go, that medal, .38 special, to your threshold\nNiggas actin' petro, like they sexual, was metro\nBunch of bad bitches fuckin' out on tour\nLike it through the back door, give it to her raw\nShimmy shimmy ya: ODB, ODB\nFuckin' other niggas' broads: OPP, OPP\n\n[Verse 4: A$AP Rocky]\nComin' down stuntin' like a bitch, bitches on my dick\nOn the set and they like the nicotine to cigarette\nHow they fiending for a nigga got these hoes up on my sack\nGot my niggas in the back, couple bitches in the bed\nASAP where it's at, where that weed, how that cake\nBitches all up in my face, back back, give me space\nCas you know how we do it, niggas scream ASAP\nAye Clams nigga, tell me where that bass at?\n\n[Outro: A$AP Rocky]\nBass, uhh!", "year": "2011-10-31"}]}