{"artist": "Plies", "songs": [{"album": "The Real Testament", "title": "1 Mo Time", "image": "https://images.genius.com/833ec3b321b44889272a33c28901ad3f.600x600x1.jpg", "lyrics": "(Chorus 2x)\nI know you caught me cheating\nAnd you tired of me lyin\nImma be honest with you baby\nI know I crossed tha line\nIf you dont wanna f**k with me no mo than cool it's fine\nBut before you go baby\nCan we f**k one more time\n\n(Verse 1)\nI know I f**ked up and sorry ain't\nWhat you wanna here but i can't change\nThat shit dog it is what it is\nYou can go f**k another nigga if thats how you feel\nIf thats goin to make you feel better than gone do it hell you asked me about this lil petty\nShit and i kept it real, know that shit probably hard for you to swallow still I ain't know how\nBad i hurt you til' I seen ya tears I ain't asking you to accept how a nigga live, if you feel\nLike another nigga can treat you better, than it is what it is. but let the truth be told its\nBeen my pussy for years. now you got all ya lil home girls up in ya ear just lets f**k one more\nTime before you dip\n\n(Chorus 2x)\n\n(Verse 2)\nI know its probably best for us to go our seperate ways, cause i know me imma f**k up again\nAnyway but in my muhf**kin heart a nigga want you to stay cause once you f**k up this shit can\nNever be straight im dead ass wrong thats why i ain't got shit to say bet you think a nigga didn't\nGive a f**k anyway i just had to f**k you good the other day and how that pussy was bitin i\nDidn't wanna scape you rode that dick so long until you started to shake and i can tell when you\nWould nut i can see it in ya face imma miss f**kin you from the back and how i grabbed ya waist\nBut most of all imma miss how that pussy taste\n\n(Chorus 2x)\n\n(Verse 3)\nIt ain't another nigga who's going to f**k you like I Do you can talk that shit all you want\nBut bae you know its true I know i f**ked up i said im sorry now its on you. you can play\nStupid and give me away if you want too. if you say f**k it its over then i guess we through i\nKnow if i caught you cheating ill probably cut you loose dont get it f**ked up i ain't tryin to\nTell you what to do. whatever decision you make i gotta live with it but whatever your answer\nIs just make sure you can deal with it but if we do break up imma keep tryin to get it this\nShit we going through right now is real silly gone cuss me out and lets f**k and gone kill it\n\n(Chorus 2x)", "year": "2007-08-07"}]}