{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Get It Gurl", "year": null, "album": null, "lyrics": "[Chip The Ripper]\nUh get it girl put it in my...\nUh get it girl put it I'm my...\nUh get it girl put it in my...\nUh get it girl put it in my...\n\n[Verse 1: Chip The Ripper]\nBaby I'm the ripper\nSee me on them 4's\nT.V.'s I suppose\nLookin' for these hoes\nBitches know the deal\nWhen they see me swing them doors\nTell em they ain't even got to take off no clothes\n\nWhen you see me in that old school swerving\nProbably cause your baby mama in my lap slurping\nHit the freeway goin 77 south\nThick light skinned dime setting off the mouth\nTake your time speed it up really don't matter at all\nLong as the baby batter splatter in ya jaw\nLet it shoot from the window to the wall\nMy knees week I try to stand up and I fall\nNow it's my niggas turn he got next\nDon't expect a dollar we ain't writting no checks\nI don't wanna feel your teeth this ain't the chewing\nTwo niggas and one girl what was ya'll doing\n\n[Hook: Chip The Ripper]\nShe's a go liver\nPut it I'm my\nShe's a go liver\nPut it in my\nShe's a go liver\nPut it in my\nShe's a go liver\nPut it in my get it girl\n\n[Verse 2: Chip The Ripper]\nAy little mama got a ass so fat my nigga\nLike damn look at that look at that\nYea I said it's cool\nBut I don't even wanna stroke her\nCause when she lick my nuts it's like I'm on a rollar coater\nDear Mrs. thick lips\nI'm the big blow the juices of the tip\nIf you give it a good lick\nI know you don't want nobody thinking your a trick\nBut the windows on the cutty tinted I ain't sayin shit\nMe you and my crew can go somewhere private\nSo you can salive it but you ain't gotta hide it\nThe whole hood know that you a go liver\nSo go head and dive in my thighs like Godiva\nGave shawty a ride but she ain't have no gas money\nShe said \"Chip I'm broke but you can get some ass from me\"\n\"I gotta better idea\"\nI said, as I reclined my seat\nI had her quick weave bouncin to the beat like\n\n[Hook]\n\n[Verse 3: Fat Al]\nAy girl I'm swang nine and I ain't talkin about a nine\nBut my dick is brain food good for your mind\nOh you smoke that's fine\nAt least I know now she goin down down down for a dime\nHow rude of me it's the f-a-t\nPull up on three's candy green armani seats\nBut that's only half you ain't seen shit yet\nPull up fresh checks off the marquee jets\nPlus I gotta about a pound of diamonds on my neck\nPull up in a lex\nMy pockets to cash a check\nDon't mind me cappins a natural reflex\nYou won't reject\nCause I'm me and that's that\nI ain't askin for much just a little jaw\nNot trying to hit your walls\nJust wanna hear you gaw\nYou make it hard for me to control myself\nJust thinking about your barin makes me Oh myself\nShe be like\n\n[Hook]\n\n[Hook: Chip The Ripper]\nShe's a go liver\nPut it I'm my\nShe's a go liver\nPut it in my\nShe's a go liver\nPut it in my\nShe's a go liver\nPut it in my get it girl\n\nPut it in my get it girl\n\n[Verse 3: Fat Al]\nAy girl I'm swang nine and I ain't talkin about a nine but my dick is brain food good for your mind. oh you smoke that's fine atleast I know now she goin down down down for a dime. how rude of me it's the f-a-t pull up on threes candy green armani seats but that's only half you ain't seen shit yet. pull up fresh checks off the marquee jets. plus I gotta about a pound of diamonds on my neck. pull up in a lex my pockets to cash a check. don't mind me cappins a natural reflex. you won't reject cause I'm me and that's that. I ain't askin for much just a little jaw. not tryin to hit your walls just wanna hear you gaw. you make it hard for me to control myself. just thinking about your barin makes me hold myself. she be like\n\n[Hook: Chip The Ripper]\nShe's a go liver\nPut it I'm my\nShe's a go liver\nPut it in my\nShe's a go liver\nPut it in my\nShe's a go liver\nPut it in my get it girl\n\nMore lyrics:\nAll about Chip Tha+Ripper:"}]}