{"songs": [{"year": "2001-04-03", "image": "https://images.genius.com/ec46798fa54e4b0eead636c38046b017.300x293x1.jpg", "title": "My World", "album": "Endangered Species", "lyrics": "Uhh, yes y'all baby\nYeah, yeah, work it out\nWork it out dawg, work it out now\nUhh, y'all motherfuckers, big dawgs in the house what?\nTerror Squad what? Terror Squad what?\nI ain't a rapper, I just bust a lot, off the top\nWhat, yo, yo\n\n[Big Pun]\nThe penalty is death, especially when I'm mentally stressed\nMy enemies hang with me 'til I eventually flip\nI never reject an offer to battle\nSlap a coffin on the saddle\nAnd rattle like a wooden horse to el barrio\nNiggas talk but they babble cause they ain't sayin' nothin'\nIf ain't blazin' somethin with the MAC I'm in the shack bakin' muffins\nFake the funk and get your rump roast\nOne dose of the toast'll make you jump if you come close\nPun spoke, ain't no more debatin; my squad been waitin'\nFor the perfect time to give you what you all been waitin'\nAn orgi-nation of veterans built\nWith genuine skills to pay the heat, gas, and the rest of the bills\nInvest in the real, don't get left in the hills\nMy tec and my steel turn your whole crew into vegatables\nWe blessed with the will to never surrender\n'Cause my every agenda's in and out\nUnseen like I entered the ninja\n\n[Chorus]\nIt's my world girl, either love it or leave\nIf you was my girl, you'd be thuggin' the weave\nSuckin' the blow pop, with a ring in your tongue\nBaby don't stop, that's how you bring it to Pun\nIf this is my world, I'd be Tony the man\nCall me The Godfather, controllin' the fam'\nRunnin' the whole coast, I'd be a mafia king\nNothin but the finest diamonds in my watch and my rings\n\n[Big Pun]\nStupid.. gimme yours\nYou be lookin' bunny rabbit\nGive your pants bunny rabbits, what you know about that?\nI ain't about to pop you stupid\n\nFuck the small talk, niggas know Pun keep the fo' cocked\nDon't walk too fast, might pass through the wrong block\nDon't stop, keep it movin', the streets'll ruin\nThe average man, faster than, the motherfuckin' teamsters union\nWe doin' dirt cause we gotta, five dolla a hour\nThree kids and my motherfuckin' big mama\nMy Sig Sauer got different plans, God knows I'm just a man\nSo hide your wrist if it's glistenin\nListen man, we just niggas tryin' to work it out\nListen friend, strictly biz it's nothin personal\nWe thirsty now and I ain't drinkin' out of plastic cups\nPlatinum plus (Thorough) crystal glasses with the fancy cuts\nFancy us, livin' life lavish\nDrippin' ice cabbage, livin' in the six, with some white bad bitch\nTight package I gotta pass\nI'm from the ghetto nigga, I like a lot of ass\n\n[Chorus]\nIt's my world girl, either love it or leave\nIf you was my girl, you'd be thuggin' the weave\nSuckin' the blow pop, with a ring in your tongue\nBaby don't stop, that's how you bring it to Pun\nIf this is my world, I'd be Tony the man\nCall me The Godfather, controllin' the fam'\nRunnin' the whole coast, I'd be a mafia king\nNothin but the finest diamonds in my watch and my rings\n\n[Big Pun]\nWord life T. Squad holdin' it down, y'knahmean?\nGettin' this money by any means baby\nLet me get the fuck up outta here, 'fore I break somethin'"}], "artist": "Big Pun"}