{"artist": "88-Keys", "songs": [{"album": "Adam’s Case Files - The Mixtape", "lyrics": "Maybe I'm a dreamer. Maybe just a fool\nLately, I can hardly see the sun\nIf you had a secret, I could take a guess\nBut nothing in your eyes seems to hold me\nTruth or consequences? Which one will it be?\nSomeone said that time would ease the pain\n\nYeah\nTanya morgan in this\n\nVerse 1: [Donwill]\nShe got top-knotch crotch and I ain't tryna swap\nBut I still watch my watch and not stay at her spot\nAnd that's sayin' alot cause some them playas\nShe got them on stand-by, hopin' that I fall by the wayside\nStay tryna take mine, I'm layin' it by her bedside\nHate how I be taking off and really got her right\nBut I keep my socks on every time we get it on\nSo I can slide my kicks on and get her out before long\nBecause we cut-buddies, cuddling confuses what we doing\nAnd huggin' wasn't in the game plan\nSo excuses on why I gotta leave with the tuggin' at my sleeve\nIs ridiculous to me, get the dick and let me be\nShit is simple. Actually my bed is mad comfortable\nAnd spacious as I make it, you can hog ya own blanket\nPlus you gotta be awake at 6 a.m., I sleep in\nCome on, it makes sense\n\n[Hook]\nHold me like this\nHold me like this\nHold me like this\nPlease hold me like this\n\n[Verse 2: Von Pea]\nYo. I rushed over to her like I never seen her hindparts\nNever got her naked, never told her make her spine arch\nArchie, her jugs, head, and overall physical\nHad me 'bout to put her in my next seven lyricals\nHer thong sang a song from her inner clit a limerick\nBaby faced away from me as I'm about to enter it\nI'm whipped, the appeal of her is peeling at my heart-strings\nStrummin', but I'm dumbin', what I'm thinkin'?\nThis is hardly a love-connect\nCause in no way, is honey in the right-mind set\nAnd eerily this chick is kinda like my ex\nSo why catch z's when I should leave\nCatch a cab to the A or the C\nMy dudes know how it goes\nThe children exit the pole\nThe lever leave and hopefully without 'em counting the vote\nAnd you be ready to go, but she want you to chill\nPut ya arm around her, listen to Jill\nBut I will not\n\n[Hook]\nHold me like this\nHold me like this\nHold me like this\nPlease hold me like this\n\n[Verse 3: Ilyas from Tanya Morgan]\nI won't hold you, but I'll hold you down when ya man is not around\nHold me or just hold me up, but I'll hold you up against the wall to fuck\nHoldin' in my nut, only way I'm holdin' back, missionary hold ya back\nNot ya man, no holding hands\nWhen the fun is done you can hold the fan\nNo bondage cause you hold me hostage, I have other plans\nYou hold it like a holster, my pistols dangerous\nI hold the moment like I'm posing for a wanted poster\nIly the kid, hold the crown like I'm s'posed ta\nQueen of ancient kings so you can't hold me close\nHold on to ya love like En Vogue\nCause I hate to see you holding back tears\nNaked, holding on ya clothes\nBut when I try to leave, tryna hold the door closed\nHoldin' on my sleeve like please don't go\nHoldin' grudges, on the phone saying I'm cold\nIt's over, click over, had to put you on hold\n\nHold me like this", "image": "https://images.genius.com/04b97c8f6b1aebe77e0fca3a907694d7.300x300x1.jpg", "year": "2008-06-11", "title": "Cuddlebums"}]}