{"songs": [{"image": "https://images.rapgenius.com/a002f3f3d49b753b7b46d55f4d0e0337.750x750x1.jpg", "title": "Licinpusee", "album": "Licinpusee", "year": "2015-08-29", "lyrics": "[Hook]\n\n[Verse 1: Necro]\nTongue fuck the pussy rapidly\nStick my tongue dead at you like Manolo\nBut bitch you ain't slapping me\nCunnilingus, stab it like the fingers of Mingus\nCaught gingivitis\nLicking your bloody period puss\nGene Simmons tongue\nDemon got women sprung\nDrink your pineapple juice\nBitch, eat your lemon meringues\nYour ass licked, multitask\nMake a whore spasm\nI'm the ultimate in giving multiple orgasms\nA bitch rarely has them and when she does it's barely fantastic\nShe uses a mechanical piece of plastic\nAre you experienced like Jimi Hendrix?\nBitch, I'd like see if my jimmy can touch your appendix\nHoe, bend over, over holy Jehovah, I'm in\nI'll make you cum over and over and over again\nI lick white pussy, black pussy, Spanish pussy, yellow pussy\nHot pussy, cold pussy, wet pussy, smelly pussy!\n\n[Hook]\n\n[Verse 2: Necro]\nI used to take it slow be a gentleman like Marvin\nNow I eat a female's genitals like a cannibal starving\nJerry Doucette smells like fish food\nIf washing your pussy don't fix it, you got internal issues\nMuff diving while you got your period, it's serious\nDelirious business, scary suspiria\nRed badge of courage, fuck that I can, hun\nFuck around bitch, I'll make you eat your own tampon\nNice, excited, swollen, creamy white juice dripping pussies\nWith a hole in the middle like a doughnut\nMake a bitch go nuts\nTeeny, tiny, little pussies but you grown up\nYour pussy's dryer than the Arabians\nSo I'm spitting drool like a fool all over your labia\nIf you're not into it, then i'm not into it\nI'm intuitive you could just do me and drink fluid\n\n[Hook]\nOrgasm! x4 (SNIFF)\n\n[Verse 3: Necro]\nFace between your legs, I'm about to get in you\nTake a deep sniff If I don't pass out quick, continue\nFinger test works too\nIf I survive it then I'mma dive in with saliva\nWhile you lie there and arrive at an orgasm\nSeeing stars like Orion\nLegs up, backseat driving\nG-spots like Bigfoot or the Bermuda triangle\nBut I can find it at the right angle\nPussy lips strangle my four fingers up in your kangaroo pouch\nNow bitch don't piss on my couch\nManipulation hard suck, clitoral stimulation\nImmolation of your pussy to the God of fuck\n\n[Chorus]"}], "artist": "Necro"}