{"artist": "50 Cent", "songs": [{"album": "God’s Plan", "image": "https://images.genius.com/7488990258b7e75bb8e35de7a131ec87.697x694x1.jpg", "title": "Gangsta’d Up", "lyrics": "{*set to the beat of \"G'd Up\" by Tha Eastsidaz*}\n\n[50 Cent]\nYeah, I stay with my ratchet nigga\nGo 'head and talk bad nigga\nYou best be on your best behavior out this motherfucker!\nHa ha\n\n[Hook: 50 - singing]\nI stay gangsta'd up, niggas ain't got shit on me\nAnnnnnd, I stay wit my gat, in case I gotta pop somebody\nGeeee-Unit clique, you're blind if you can't see\nThat weeeee run the streets, nigga you better ask somebody\n\n[Tony Yayo]\nI got a rifle with a scope in the trunk of the Viper\nSo I shoot off the roof like the D.C. sniper\nI just bought a bezel, and a brand new piece\nAnd a level two vest and a brand new piece\nSee y'all hip-hop niggas don't want no beef\nY'all get shot and rat to the hip-hop police\nNigga two guns up, I run up in your label\nWhy your guns in the house like a couch potato?\n\n[Hook: 50 - singing]\nI stay gangsta'd up, niggas ain't got shit on me\nAnnnnnd, I stay wit my gat, in case I gotta pop somebody\nGeeee-Unit clique, you're blind if you can't see\nThat weeeee run the streets, nigga you better ask somebody\n\n[Lloyd Banks]\nThese hoes want me to stop, but this is the worst part\nI was born with this game like birthmarks\nI don't trip, but I'mma get a little watch from my modelin chick\nCause she spent a lot of time on my dick\nI get a new fan every single time that I spit\nGray and blue Benz, lovin' every diamond I get\nFast and furious in the Rang Rove', cause my bread folds\nBeef I hit your neck and turn your jewelry into red gold\n\n[Hook: 50 - singing]\nI stay gangsta'd up, niggas ain't got shit on me\nAnnnnnd, I stay wit my gat, in case I gotta pop somebody\nGeeee-Unit clique, you're blind if you can't see\nThat weeeee run the streets, nigga you better ask somebody\n\n[50 Cent]\nI'm from the bottom man niggas know I came up hard\nI got a temper man I'm looking for some shit to start\nMan my tax bracket change, I'm sittin on some change\nThe hoes man they changed they don't treat me the same\nIt's not my looks that's got me all up in them drawers\nIt's the new M3 with the Lamborghini doors\nMan them D's they done turned them dogs into dopefiends\nSmell a leak in my clothes so they barkin at me - WHOA!!\n\nYeah, that's gon' have to be good enough\nI lost a friend tonight\nJam Master Jay... rest in peace\nI send my love to his family\n50 Cent y'all\n\n[Hook: 50 - singing]\nI stay gangsta'd up, niggas ain't got shit on me\nAnnnnnd, I stay wit my gat, in case I gotta pop somebody\nGeeee-Unit clique, you're blind if you can't see\nThat weeeee run the streets, nigga you better ask somebody\n\n[Outro]\nG-Unit, God's Plan!\nDamn... {*gunshot*}", "year": null}]}