{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/b0932d143df01e1f636e2819ec376deb.500x500x1.jpg", "year": "2018-05-03", "album": null, "lyrics": "[Intro]\nWooh!\nAlright, alright\nNow listen, listen loud and clear, you dig?\nThis is uh, this is history\nFor real nigga\nYo, yo\nYo, yo, yo\nNow check me out, listen\n\n[Verse 1]\nWhy everybody change on me?\nWhile I remain the same, that's why I'm bringing Major Payne\nLike mothafuckin' Damon Wayans\nAnd now you chickens is toast, this ain't Raising Cane's\nIt's clear we wasn't raised the same, rappers lame with fame\nI'm known to kill a wack rapper like a bad hobby\nI smash hotties and stash bodies, then cop lil' boats\nLike that's Yachty, and that's probably\nWhy I'm so fly that I crash lobbies and after it slap thotties\nI'm a rap fanatic who rap fantastic without the platinum status\nWhy I'm blastin' the maddest 'cause most of these cats is average (uh)\nI swear to God that I never lie to avoid a fact\nA terrible hair stylist, I'm destroying tracks\nI don’t bust guns but my niggas deploy the strap\nThen bring out a fucking .45 like Michael Jordan's back\nI wanna give these niggas hell if heaven was grant\nThe best thing from PG since Kevin Durant\n\n[Hook]\nHah, my name is, my name is, yeah\nOh yeah, YBN shit\nDon't doubt my name, I said, I tell 'em what my name\nNigga better know the name, yeah, YBN shit\nBetter know, my name is (yuh)\n\n[Verse 2]\nSee, a nigga was skippin' class, damn I rather attempt the raps\nSaid fuck it I'm missing that, when I blow go tick for tack\nI'm a boss on my Diddy shit, my flow is too hideous\nDropped out of school, senior year, a true idiot\nYou see, I wear designer bags, I don't carry minor cash\nI'm trying to find the stack, big as Blac Chyna's ass\nOh you wack rhymers, trash climbers, that's kinda sad\nIn the pathfinder, but my path couldn't find my dad\nNow my soul dented, pulled up in a Ghost tinted\nIn a drive-by, where niggas shooting shit like Cole Bennett\nYou ho's finished, in this rap shit a cold menace\nBut I'm flowin' gold liquid, damn I'm so vicious\nUh, my name is Cordae, but don't forget the YBN\nI used to get high with friends off grandmama's vicodins\nAnd mix it with a percocet, damn that really worked a sweat\nMy verse is just perfect, yeah, fuck it go and search the net\n\n[Hook]\nHah, my name is, my name is\nNigga's be the lamest, YBN shit\nMy name, you nigga's know his name\nThe nigga's flow is lame, nigga, hah\nMan, these niggas whack as fuck\nIn this music shit, bro, like what the fuck\nYou niggas suck like shit bro, like\nDamn you niggas fucking suck. man", "title": "My Name Is"}]}