{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Staple Singers: oh! Big Daddy!]\n\n[Big Daddy Kane]\nHear ye, hear ye, from far and near\nThe one they call the Big Daddy Kane is here\nTo deliver a message to everyone everywhere\nSo listen up party people cause this you should hear\nIt's a story of a far-away atmosphere\nThat you will find very rare and far beyond compare\nAll is sincere and rather debonair\nSo let's all gather around, because...\n\n[Hmm...yeah...I'll take you there...oh!] (x4)\n\n[Verse 1: Big Daddy Kane]\nOff to a place you thought was unreal\nWhere people of the world do know how to chill\nEverything remains cool and calm where you are\nAnd if you ask about crime, they all'll say, [Hah?!]\nThey wouldn't even know what you mean\nCause it's a different program, y'all know the routine\nWhere people work hard for a decent buck\nAnd you can wear truck jewelry without being stuck\nNever wondering whether your house is all right\nSo go leave your VCR on the porch overnight\nAnd as for the people they all stand proud\nSenior citizens party with the hip-hop crowd\nYou can hang at a jam till the break of dawn\nAnd leave without your Bally shoes getting stepped on\nEveryone walks around in their right mind and all\nBecause crack ain't nothing but a hole in the wall\nSo those who wish to live with glare and flair\nThere's a place that this can be done, and yo...\n\n[Hmm...yeah...I'll take you there...oh!] (x4)\n\n[Verse 2: Big Daddy Kane]\nWhat I discovered may just only seem\nAs something that you find in your wildest dream\nBut! on the real tip, you will see\nI'm not playing, what I'm saying is reality\nThere is a place people live with joy\nThat the next man cannot come along and destroy\nNo one faces problems, no one says sorry\nAnd war ain't nothing but a game on Atari\nThis message also applies to other nations\nLike Africa for instance, where there's starvation\nBut if you come with me, you're sure to see\nEthiopians can eat in Red Lobster for free\nAnd people that you saw before that were poor\nWill never ever see the situation no more\nCause in this world everyone's a millionaire\n[Is there WIC?]\nAre you sick?\nAnd what the hell is welfare?\nFashions are smashing for all to flaunt\nAnd we can get anything that we want\nSo don't think you can't afford expensive design\nBecause fresh Gucci wear is only $5.99\nSo come ye all and attend this affair\nAs we journey to the promised land, and...\n\n[Hmm...yeah...I'll take you there...oh!] (x3)\n\n[Verse 3: Big Daddy Kane]\nSince I'm the type of guy that laughs and jokes\nThis may sound funny, but seriously folks\nIt's a shame that people today must live\nIn a world that's operating oh so negative\nBut I found a place designed especially for you\nWhere peace and harmony is everyone's culture\nSo let's all gather around before this world corrupts\nAnd we don't even need Scotty to beam us up\nBecause...\n\n[Hmm...yeah...I'll take you there...oh!] (x4)\n\n[Big Daddy! Oh...hmm!] (x9)\n\n[I'll take you there...all right] (x4)", "image": "https://images.genius.com/a3044a73939ccd541c13cf37d29d70bb.1000x1000x1.jpg", "year": "1988-06-28", "title": "I’ll Take You There", "album": "Long Live the Kane"}]}