{"songs": [{"album": "Prenuptial Agreement", "year": null, "title": "Red And Blue Lights", "image": "https://images.genius.com/120e77f1186060bdc73f0c721ba49267.1000x1000x1.jpg", "lyrics": "(J Stalin - Verse 1)\nRed lights in my rearview, it's still true I still move shit, this stunna still blue, imma dope boy in my heart so I ain't you. My momma smoked it too, I sold it in the house, nigga I sold it out the house, forgive me for my sins but I never got to be a child. Based on where I lived yup I'm up in the game but I ain't hearing tha jizz. Where I be at the sounds of the sirens cover their ears. They on our ass, hit the gas and switch the gears. Sorry bout yo homeboy but ain't no love round here. There's crack down here, nines and macks down here. Lil niggas will jack to be exact down here, phines down here, niggas move cream down here. No holsters, Pistols in they jeans down here. I bury you or you bury me or we gon funk all year\n\n(Chorus)\nAnd sometimes I can't sleep at night dreaming bout the red blue lights. And I'm cautious wen I drive at night Cuz I be seeing the red blue lights. On the corner without a cop in sight thinking bout the red blue lights. So wen I leave make sure I'm alright ain't caught by the red blue lights\n\n( J Stain - Verse 2)\nMe, imma Dboy so I'm weighing the cot, You niggas and rappers ain't hard so you waiting to flock. I saw em go, from selling grams to collecting cans and that's all she wrote with some money switch hands, we shot them niggas whole block up then we switched vans, it's hard to understand if you ain't from round here. My heart cold shit I lost my daddy last year. The task came, they left and I'm still here. Switch my gear they don't remember my description, went back to my bundle got a hundred stacks missin. Them niggas stole about a hunnid hours in the kitchen. I'm up in there the next morning bitch I don't listen, imma dog round here so my pinky ring glissin, I'm on top of my game but a lil dame who I'm missin, this nigga still bitchin they ain't got no money, I gained five pounds a month just look at my tummy\n\n(Chorus)\nAnd sometimes I can't sleep at night dreaming bout the red blue lights. And I'm cautious wen I drive at night Cuz I be seeing the red blue lights. On the corner without a cop in sight thinking bout the red blue lights. So wen I leave make sure I'm alright ain't caught by the red blue lights\n\n(The Jacka - Verse 3)\n*The Jack, yea*\nMan I'm too fly to say im going to school, so I'm getting high with my niggs with a loaded tool. Barley getting by, is that wat I'm going thru, murder on my thoughts why don't I walk you thru, so you see life so you see my face for I rob you for your ice ice ice. Never caught a case but here to rob a niggas life, how could it be hard if I ain't doing life. Shit be tryna change but I can't escape this night, can't erase the paper not a cop in sight. Ride around trappin, got to many bitches but I never been a captain they just love a nigga. I be in the action first time I moved coke. I was just a kid first time I seen coke. It was three hunnid bricks made my mind up rite there, this wat imma do blew her ass a kiss same thing it's tha drama crew\n\n(Chorus)\nAnd sometimes I can't sleep at night dreaming bout the red blue lights. And I'm cautious wen I drive at night Cuz I be seeing the red blue lights. On the corner without a cop in sight thinking bout the red blue lights. So wen I leave make sure I'm alright ain't caught by the red blue lights"}], "artist": "J. Stalin"}