{"artist": "G Herbo", "songs": [{"title": "Know Me", "album": "Welcome To Fazoland 1.5", "year": "2017-03-17", "image": "https://images.genius.com/8d549b9719d3fbd617d2d17a0cf09b86.355x355x1.jpg", "lyrics": "Fuck niggas, if you a fuck nigga... I don't fuck witchu!\n\nHook:\n\nWhere the yoppas at? I need to buss' or sumn'\nLil mama throw it back, you need to buss' or sumn'\nAnd I ain't tryna come see you unless I'm fuckin sumn'\nYea these niggas really fake, I don't run under nun'\nI don't know you, and you don't know me\nSo don't go off what you heard, cause you dont know me\nOk you say you wit the shits, you gotta show me\nI read niggas, keep ya distance you don't know me\n\nVerse 1:\n\nYou don't know me, you don't know me\nYou say you blow heat? You gotta show me\nI heard niggas lookin' for me like they know me\nBut should no nigga look for me, unless they owe me\nBut if you lookin' for me, bitch I'm posted (SQUAD!)\nRight on 78th & Essex, where I poster\nAnd you could try to ride through, if you want to\nBut I'd be careful, cause C-Money got that toaster\nGotta stop sayin' names, cause the police watchin'\nAnd they all on ma dick tryna hold us\nOpps come to court tryna snitch on the soldiers\nItchin' and scratchin' me, I'll knock his shit off his shoulders\nAll these old ass niggas tryna come around now\nLIke they wanna fuck wit me cause I'm older\nWhile I know they really wanna hang cause I'm holy\nFuck niggas stay up in ya lane, you don't know me (Haann)\n\nHook\n\nVerse 2:\n\nHow you say you know me fam?\nWhere the fuck I meet you at?\nHold on. watch out, don't approach me fam\nBefore I let you meet this strap\nBoy I been out there in that field, stayed out there\nWit them killas, so hell naw you can't catch me wit\nNo new niggas, there's a 30 on one of two niggas\nRun the streets, if a nigga try and shoot at me\nFuck you think I'm suppose to do nigga?\nAnd I know half of ya'll won't shoot for me\nThat's why I don't fuck witchu' niggas\nOn top of that, you ain't never did shit for me\nSo I ain't got nun' for you nigga\nMatter of fact, if it was all left up to me I\nGot hits for a bunch of you niggas, Moodie\nWhere the yoppas at? I need to buss' or sumn'\nPull up and let them choppas clap you gon'\nNeed luck or sumn', young nigga do what I\nWanna do, not what I'm pose to do\nFuck nigga how you call yourself a G\nWhen that's somewhere over you? (GANG!)\n\nHook"}]}