{"artist": "C-Rayz Walz", "songs": [{"title": "3 Card Molly (We Live: The Black Samurai EP Mix)", "album": "We Live: The Black Samurai EP", "year": "2004-09-07", "image": "https://images.genius.com/6db5062033813b4d2fef23bb8ec78afa.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nLook at me.  Heh.  Belief.  Start to forget that I’m crying like this.  I’m crying.  Oh shit.  Heh.  Dougie!\n\n[Verse 1: C-Rayz Walz]\nFour to five times, dum-dums blast\nIn the chest of my brother.  That breath was the last one\nI don't believe it.  My heart needs a cast\nI told him, “Get out that lane!” ‘cause it was too fast\nAin't it time to cut these yellow lines?  The\nShow must go on.  I got his younger brother on my mind\nPast tragic.  Wish I knew magic tricks\nI bring it back to this physical script\nBut dreams is broke.  He got smoked for coke\nIn the form of rock.  Murder worse?  He was on his own block (Damn)\nAt the funeral, I cried then laughed\nAt the same time, my wrath had me happy and sad\nTo reminisce off his unique funniness\nAdds up to this.  His life was a gift\nTo be wrapped in memories from days of way back\nBefore clips and gats, colored tops, and cracks\nWe thought bikes was fat and girls was whack\nThey said you die, black.  But I don't believe that\n'Member that time I took the shit in the train station\nAnd you said the cops was coming, but you were just playing\nRight after, we robbed that crackhead, fams\nThat was back in the day.  Damn!\nWe both had the high-top fades like Kane and\nWe was fiending for them Nike Airs on Fordham Road\nIt don't make sense how you just gone\nAnd it don't make rent—how I don't get paid for this song\nBut it make lint in my pocket when I pull 'em out\nAnd it make me wanna go and (Blao!  Go blao!)\nI feel like blasting myself ‘cause my pops is gone\nIt ain’t nothing going on but the stocks and bonds\nLost in the motion of life, provoking the strife\nCouldn't see the day through the motion of night\n\n[Hook: C-Rayz Walz] (x2)\nOn Fordham Road.  3 Card Molly\nFucking up the icy man in front of everybody\nBX the place I was from\nBX.  Man, I love that slum\n\n[Verse 2: C-Rayz Walz]\nHey Ms. Rios, sorry that I dissed your flag\nAnd when Ty got shot, he had to shit in a bag\nBut that's okay ‘cause Ra lay on the same corner\nOn the same ave where I sold marijuana\nAnd Ms. Carolyn was a nosy neighbor\nMr. Sack was screaming loud, but that were the days\nOf a ’86 juvenile mentality\nNot nice on the mic but brother ain't wanna battle me\n‘Cause the knuckle game was Chuck Norris\nThe gun was enchanted—enter in a buck-buck forest\nWithout the dollars, more live than Morris\nYou know how it go for con artists\nI remember block parties and .22s and\nLot of serious cats in a funny crew and\nJabu, I miss you.  When you died, I was upset\nCouldn't know how it felt to be a Vietnam vet\nTo hear bombs going off in your ear with big Metallica\nNow we in the streets and the jails is like Galaga\nThey got your DNA samples\nPlus they got your female in the house trampled\n(Boom, boom) is the hell of the train station\nI try to move out, leave the pain vacant\nBut it stays here and it stays there\nBust out stray shots.  It’s no fair\n\n[Hook: C-Rayz Walz] (x2)\nOn Fordham Road.  3 Card Molly\nFucking up the icy man in front of everybody\nBX the place I was from\nBX.  Man, I love that slum\n\n[Interlude: C-Rayz Walz]\nDougie.  Rest in peace.  (Live).  Dougie (Live), rest in peace.  Dougie (Live), rest in peace.  I’m sorry.  3 Card Molly.  Came precise.  Belief deceiving.  Beliefs on the boards.  (Belief!).  What do you believe in?\n\n[Hook: C-Rayz Walz] (x2)\nOn Fordham Road.  3 Card Molly\nFucking up the icy man in front of everybody\nBX the place I was from\nBX.  Man, I love that slum"}]}