{"artist": "Professor Green", "songs": [{"album": null, "title": "Don’t", "image": "https://images.genius.com/62d13e9c49f7e4502b4c30e7630fc461.500x461x1.jpg", "lyrics": "[Verse 1: Professor Green]\nFirst off, I know I ain't no angel\nBut silly me for thinking that I could save you\nFor thinking that I might be the one that could change you\nSaid you would change but all you did was pretend to\nSo is it any wonder why I resent you?\nAnd I knew you were wild but I thought I could tame you\nFell for the you that you were, then wanted to change you\nGuess it's unfair to blame you if you're unable to change you\nFor you to be any different just ain't you\nYou ain't ever been anything other than unfaithful\nWhat should I do? Cause I could stay with you and just make do\nBut I ain't ever met a woman so fucking ungrateful\nI grew so sick of your fables, can't even bear\nTo be in places I used to take you, I used to love you\nBut now I hate you, can't bear to see you on the TV\nSo I even got rid of my cable\n\n[Hook: Tori Kelly]\nDon't mess with my love\nThat heart is so cold\nAll over my arm\nI don't wanna know that babe\nDon't mess with my love\nI told her she knows\nTake aim and reload\nI don't wanna know that babe\n\n[Verse 2: Professor Green]\nReally, what was it all for? It was awful\nFor a minute it was hot but it so quickly\nStarted to cool, couldn't have written this shit\nIf you were an author, it was so different in\nThe beginning, a couple friends were telling me I was tripping\nBut you can't help who you fall for, guess you were tricking me\nBut if you were ever in trouble, I was always the one that you'd call for\nThis is torture, I always dealt with you calling\nCouldn't even tell me the truth, it was your friend who was informing me\nWhat was you even with me for? Was it all a [?]?\nInstead of you cheating, couldn't you have thought to leave?\nYou must hate me, why? I can say that I did\nBut I don't ever wanna hear you say that we tried\nI don't love the way that you lie, I'm giving you the boot\nA little like Dane Bowers to Katie Price\n\n[Hook: Tori Kelly x3]", "year": "2014-09-17"}]}