{"artist": "Immortal Technique", "songs": [{"title": "That’s What It Is", "lyrics": "[Green Lantern]\n(Invasion)\nOk... let's go... talk to em'... holler\nDon't you get tired of hearing niggas say that shit?... all the time?\nWhy can't you shut the fuck up and rhyme nigga?!\n\n[Immortal Technique]\nYeah... yeah\nUsed to run around getting my fight in the streets on\nBack in the day before Harlem had a green zone\nWhat good is a good education with no direction?\nLike the right to vote with no one to vote for in an election\nLike a gun with no bullets in the clip for protection\nLike a crowd packed in the front without the midsection\nUsed to live robbing and stealing and being reckless\nIt took time for my mind to put the ghetto in perspective\nI used to live in the back of a holding van\nUsed to be offbeat like the white girls' shoulder dance\nI wrote rhymes a acappella, no beat behind bars\nShed blood to make it, like the story behind scars\nI used to be a battle champion in the meanwhile\nBefore some of you little fuckers learned to freestyle\nPrematurely senile underground prima donnas\nI was Oliver North during Iran Contra\nCause I never snitched, and that's backed by evidence\nI learned it by watching you, don't ever forget it bitch\nCause everybody knows how the government do\nThey never snitch on themselves, but they want you to snitch on YOU\nEvolution from Australopithecus\nPrimitive commercial shit to hard-core lyricist\nYour wax is useless, rappers are dropping like Icarus\nTechnological revolution... nigga picture this\n\n[Hook]\nMotherfucka what?\n\n[Verse 2]\nYeah\nI told you what it was, but this is what it is now\nLyrical bullets, packed to the top of the clip now\nTreat it like a robbery, I'm shutting this shit down\nFellas put your hands up and the all the women strip down\nThat's not misogynist you ostriches, cause I could just, apocalypse\nTalk politics to the populace\nOr challenge what the market is\nWith militant caucuses\nThat'll smash the spirit of Hip Hop out the sarcophagus\nThis is the curse of Tutankhamen, I bring the drama on\nI'm sinful, I eat you, broad daylight on Ramadan\nHip Hop, reparations, now we taking back Delucci\nDon't tell me you spent it on coke, like Danny Bonaduce\nWe're tired of being on the outside, looking in\nWondering what the fuck Hip Hop would've been\nThis is what it is, as opposed to what it used to be\nAnd this is your corporate tax ID eulogy\nDominant species the new breed that won't let you breath\nI'll make you die for what I believe\nSo we got nothing in common\nThere ain't no comparison\nYou got beef with niggas, I got beef with Aryans\nWhite power Nazi European Americans\nRapid Poverty pimps, and fake vegetarians\nThe resurrection, ripping a ball through the record section\nFlight connection to the Chechen border for guerrilla lessons\nFuck a middle man distributor, I got a choice now\nThis ain't Volume 1., I got a grown man's voice now\nToured the country four times over, I'm older and wiser\nPoisonous words, you'll find strychnine in my saliva\n\n[Hook]\n\n(motherfucka what?... Bring it to 'em raw)\n\n[Verse 3]\n\nI told you what it was, but this is what it is now\n50 caliber bullets, I don't need a clip now\nFuck your private jet nigga we shooting the shit down\nBomb wall street and make the stock market dip down\nI told you what it was, but this is what it is now\nYou the shit nigga? I don't care about shit now\nI play the role of Abraham, idols get ripped down\nMelt the ice caps, and make all of this shit drown\n\n(No one out there can fuck with me)\n(motherfucka what?)\n(I speak that real shit)\n(to smash the airwaves)\n(I don't want to tell you motherfuckers again)\n\n[Outro]\n{Deep Cover-1992}\n\n[David Jason]\n“We’ve developed a new product. It’s completely synthetic, therefore, no growing, no refining, no peasants, best of all no international borders, no customs agents. There in that case in front of you are two detailed perspecti on marketing and anticipated cash flow and so forth…”\n[Hector Guzman]\n“You racist Americans, you just want to cut us poor hispanics completely out of the market.”\n[David Jason]\n\"Now I think you know that there is no such thing as an American anymore. No Hispanics, no Japanese, no blacks, no whites, no nothing. Just rich people and poor people.”", "image": "https://images.genius.com/cbb36cff0867b087bc47fcf98b7cd803.300x300x1.jpg", "album": "The 3rd World", "year": "2008-06-24"}]}