{"songs": [{"year": "2011-09-06", "album": "YouTube Promotion Tracks", "image": "https://images.rapgenius.com/02b58086980a9d85d02680be12cb2a87.562x218x1.jpg", "title": "Brighter Lights", "lyrics": "I see these bright lights\nThese people hunt for cash\nI can’t adapt, how you sell your soul for hundred stacks?\nMy life is worth more, my pride is Kers raw\nI’m in the city bout to start a fucking turf war\nCos I’m so proud, my bottle watch it go down\nI ain't seen no King, so I'm gonna make my own crown\nI coped a call, Stracy's sitting in a prison cell\nI'm spinning out, like where's my boys, cos Shoei's in as well\nIs this the life we chose? Something for the nicest clothes\nSit back with the ice and doe, watch my brothers fight for hope\nFuck rhyming, if it does than it's a bonus\nI say what's on my mind, and if it rhymes I didn't notice!\nHairs up on your arms stand, realness in my palm man\nI hold the Earth then curl it round, no wonder people can't stand!\nSafe promises, I made the snakes obvious\nSometimes I don't know who to trust, even my mates I gotta to give\nUp on paranoia, burnt too many bridges\nJust realised it rhymes - Kerser is the sickest!\nFuck rhyming, if it does than it's a bonus\nWhat happened to that line man, my brain is gone it's hopeless\nBut I still be the realised\nThat's why they feel this, from the deals that the real missed\nThat's the bad thing bout grabbing the mic\nThe best rapper that you find probably hasn't been signed\nAnd it'll stay that way, but me I'm gonna make that change\nYou weighing up those [?] you be getting fed, I'm gonna take your plate\nYeah you lads cry, strong - I've got my Dads pride\nNever giving up. You holding beef it turns to mash pie\nI think I'm built different, you can see the skill in it\nI did this shit myself, I never ever got a mill ticket\nSince the 'Highest Man', shit I've been the highest man\nPromoters call my manager, you best to be supplying grams\nWhere I go from here? Confused, not knowing what to do\nGot no other option to, make a change - I'm opted to\nYou can dislike, shit ice, spit fire\nImagine what I'd be, if kid never hit pipes\nI sware on something you won't witness again\nYou won't experience I vibe like what I've writ with my pen\nBecause I'm sicker than them - this is the finishing slam\nFucking ill, you know the deal because I did it again - UH!"}], "artist": "Kerser"}