{"artist": "Yukmouth", "songs": [{"album": "Godzilla", "image": "https://images.genius.com/06ce9a2ae3e7a9474fcfc10e00a00df9.500x494x1.jpg", "year": "2003-07-22", "lyrics": "(Yukmouth talking with Aaron Hall singing in backgroud)\nOh boy, Uh, Yea, Uh\nI see some fly ladies in the house tonight\nUh, Yea, Me and my nigga A. Hall in this bitch\nHey my nigga we do the video we goin' straight to Brazil my nigga\nBelieve it\n\n[Verse 1]\n(Yukmouth)\nYou can tell its the summer\nGirls in the Hummer\nAnd the new Porsche, Boss Ballers, Tycoons\nSwimming pool, Hoop course, Golf course\nMiami beach house, Off shore\nHardcore, Sophmore, This album I floss more\nPull up in the Bentley Azure, Just me and A. Hall\nKidnap ya broad, Make her go awol\nReal nasty broad who could swallow a eightball\nMake a classy broad and model say I hate y'all\nOr maybe because I date y'all, shake y'all\nReplace y'all with a Daytona spring break broad\nReal ballers pop Cris by the case dogg\nHaters drink eggnog, Recognize like Nate Dogg\nShake Shake, Move ya body like a snake ma\nEvery night a hundred g's in ya face ma\nPlease believe me, Yuk and A. Hezzy\nGet it crunk fa sheezy, Slut take it easy\nYea\n\n[Hook]\n(Aaron Hall)\nI gotta have ya body\nGotta have ya body\nOn and on and on an it go like\nAnyway you want me to get you away\nYour wish is my command, Baby\nI gotta have ya body\nGotta have ya body\nOn and on and on an it go like\nAnyway you want me to get you away\nYour wish is my command, Baby\n\n[Verse 2]\n(Yukmouth and Aaron Hall)\nWe drinkin' Remy Martin, Mixed with Hypnotiq\nAll my alcholics, Incredible Hulk it\n(Yukmouth)\nI live it, I walk it, Talk it\nBad bitch in the cockpit of the Aston Martin\nWe got this, Hot chick with a body like a hourglass\nPokin' out the Frankie B. jeans, Matchin' Prada bag\nI like girls with alot a ass\nLong hair, Lotta class, She like dudes with alot a cash\nTiffany braclet, Mack makeup\nI got the Raider throwback to match the black Jacob\nBlack fitted hat to match the Black Raider\nThe batch of playas, Snatch ya batch (bitch), Scratch ya Gator's\nAnd leave with ya wifey of course\nShe of course never seen Gucci seats in a Porsche\nAnd she got a hubby, But to me she divorced\nLet my nigga Aaron sing the chorus\nBring it back, C'mon nigga\n\n[Hook]\n(Aaron Hall)\nI gotta have ya body\nGotta have ya body\nOn and on and on an it go like\nAnyway you want me to get you away\nYour wish is my command, Baby\nI gotta have ya body\nGotta have ya body\nOn and on and on an it go like\nAnyway you want me to get you away\nYour wish is my command, Baby\n\n[Verse 3]\n(Aaron Hall)\nWe drinkin' Hypnotiq, Magnums in my pocket\nMe and my man Yuk layin' low, You know we gotta rock it\nFrom the US to Rio de Janerio\nLayin' on the sand smokin' on some hydro\nWith the baddest hotties I's ever seen\nBooty look good in the stylin' jeans\nI don't care what nationality\nYour wish is my command baby\nI gotta have ya body\nYeaaa, Your wish is my command baby\nI gotta have ya body\nHeyyy, Your wish is my command baby\n\n[Hook repeats until song ends]", "title": "I Want Ya Body"}]}