{"songs": [{"title": "Buss Yo’ Head", "lyrics": "[Intro: Young Buck]\nAight rap niggas (yeah!)\nYou got 24 hours to live nigga (ha ha)\nYour time's up right motherfuckin now nigga\nDah dah dah dahhhh\n\n[Hook: Young Buck]\nY'all niggas ain't no killers, y'all niggas some hoes\nAnd y'all act like gorillas but you already know\nIf the gangstas feel us then 50 should'ta let me go\nAll the rappers that was beefin they ain't talkin no mo'\nI'll bust they motherfuckin head ho (who wanna diiiie?)\nI'll bust yo' motherfuckin head ho (I'm read' to riiiide)\nI'll bust they motherfuckin head ho (who wanna diiiie?)\nI'll bust yo' motherfuckin head ho (I'm read' to riiiide)\n\n[Young Buck]\nCan't wait to see ya homie, gotta keep that Nina on me\nHaters wanna leave me lonely - but y'all ain't killin me\nFuck you, ya ain't feelin me, what you eat don't make me shit\nI'm cleanin my artillery and wipin off these hollow-tips\nShawty like to swallow dick, and she set up good licks\nI treat her like a pit and holla - GET 'EM GIRL, GET HIS BRICK!\nYou know if you snitch, what we do to tattletales\nCut off yo' bottom lip, send it to you in the mail\nI'm coverin up my trails, I smell gunpowder\nAnd the hood hot as hell cause of 48 hours\nAll my niggas tryin to rob a rapper and get a bird\nTake his platinum and his fur, get in the back of that hearse\nMuh'fucker\n\n[Hook] w/ ad libs\n\n[Interlude]\nListen to the devil when he open up his mouth\n(Be quiet, you can hear them bodies callin)\nListen to the devil when he open up his mouth\n(Be quiet, you can hear them bodies callin)\n\n[Young Buck]\nYes, I brought a A.K. to my concerts\nSo I don't need security, I put in my own work\nI'm walkin with my jewelry, I know I ain't from round here\nBut y'all gon' have to kill me before I lay it down, yeah\nI was on the news for knockin him out his shoes\nBut the dude got a son that go to my daughter's school\nSo I'm cool, cause I can grab what he love most\nAnd that's the reason why you see me laughin then go\nPay the bond money, let me get back to the streets\nThe one man army, a Indian with no chief\nI got a bomb on me, so e'rybody move slow\nBiggie Smalls said it, \"If I go, you got to go\"\n\n[Hook] w/ ad libs\n\n[Young Buck]\n(Beef) Is when I see you niggas on the streets\nThe barrel of the beretta knock out motherfuckers teeth nigga\n(Beef) Just when you think it's good to go to sleep\nI crawl from under the bed, and put a hole in your head homie\n(Beef) Is probably what you rappers gonna die fo'\nIt's somethin that we live by, somethin that we ride fo'\nIt's (beef) so when you see that '72 Caprice\nWith a chopper out the window like, buck a motherfucker\nThis is (beef); just know that there will never be peace\nThis 40-Glock'll make you niggas NEVER sell a CD\nAnd since it's (beef) well this might be my last verse\nCause I'mma set it off, I'm about to blast first\n\n[Hook] w/ ad libs\n\n[Outro: Young Buck]\nHEY! Yeah\nNiggas know who it is nigga\nIt's ya homeboy Young Buck motherfuckers!\nAnd I just beat another motherfuckin gun case, ha hahhhh!\nYou know what it is nigga\nTop of Bullets-burg, the world keeps turnin\nDead bodies come up every day nigga\nGet out the way! CAUSE I'm COMIN!!", "album": "Buck the World", "year": null, "image": "https://images.genius.com/c575145ecec0cf746c69f02ad15139be.1000x1000x1.jpg"}], "artist": "Young Buck"}