{"songs": [{"year": "2012-03-30", "image": "https://images.genius.com/b1d9cfabd4ea2c9b0aa34fdd4dd20ed5.499x499x1.jpg", "title": "Hey Nicki", "album": "This Guy’s a Weirdo", "lyrics": "[Hook] (2x)\n\nOh Nicki, you so fine\nOh Nicki, you so fine you blow my mind\nHey Nicki!\nHey Nicki!\n\n[Verse 1]\nJamaican, Queens, about to catch a flight\nI'll be there... 6 o'clock tomorrow night\nJump off the flight, hit the hotel\nJump in the shower, I'm musty as hell\n\nUnload my bags, pull out the doser\nJackin' off, to this Nicki Minaj poster\nThinking about her, all on the highway\n'Fore I bust a nut, I yell \"pink friday\"\n\nOh my god, she's so fuckin' sexy\nShe's not a Barbie, she's more like a Becky\nEveryday, I think about what she's wearin'\nWhen the TV come on, I can't stop starin'\n\nYou from Trinidad? So is my dad\nI'm lying, he's a fag that got shot in Baghdad\nHow 'bout I pull on a pink wig, how 'bout you wear a shower cap\nHow 'bout I stab you six hours while you take a fuckin' nap?\n\nChorus (2x)\n\n[Verse 2]\n(My dear, my dear, my dear, you do not know me but I do know you, baby, maybe, cause I follow you on Twit-Twit-Twit-Twit-Twitter...\nAnd Facebook [yeah], and Myspace [fuck yeah] and Youtube [what], and Pink Friday)\n\nHey Onika, it's nice to meet you\nI wanna invite you to a, dollar slice a pizza\nPut our trunks on, and dive in a pool\nHow 'bout we have lunch at, Blackwell middle school\n\nIt's the end of the world, it's almost armageddon\nIf you and Drake get married, I'm fuckin' up the weddin'\nKnockin' over tables, spittin' food\nKuniva, make sure J-Cole's don't make a move\n\nI'm obsessed with you, Nick, I'm just like Stan\nI wanna be you girlfriend, and your best friend\nAnd I heard about your daddy, tryna blow up the house\nNext time I see him, I'mma blow out his mouth\n\nAnd tell Jacob, to take off that makeup\nAnd matter a fact, you and Lil' Kim should make up\nI'mma say one more thing before I leave...\nRemember, \"I will eat your pussy for life... for life... for life\"\n\n[Laughs]"}], "artist": "Bizarre"}