{"songs": [{"year": null, "image": "https://images.genius.com/d530c52ed07699f53b2c873775b96848.500x500x1.jpg", "title": "All Good", "album": "Speaking in Tongues", "lyrics": "[Intro]\nYeah, and if I died in your arms tonight\nThey say just like the Corinthians, you know\nPaul wrote he said, \"Man I die every day\"\nYa know, time movin so fast, youknow'msayin\nA day on Earth like a thousand years in heaven\nYa know, dependin on how you livin it's like\nWhere yo' bread at? Where yo' leather, youknowhatI'msayin?\nA lot of motherfuckers out here goin shoppin\nAnd I be tellin people about the West side\nAnd let 'em know what's goin on over there man\nSpirits man, it's a spiritual thing\n\n[Bizzy Bone]\nHow can I make the spirits understand\nThat I am just not to be tested by the outer man\nAnd everything that we can't comprehend\nIs not a mystery that God drinks champagne, Moet, share Dom\nBaby girl sayin that there's imperial, watchin the tube\nStore up the blunt, please don't get it confused\nSlurred your speech love or follow the rules, home of the tomb\nShake yo' stick; these playa haters don't know shit\nWhat do you do, when the homeboys try to play you?\nGet some new homeboys or just ride as a playa?\nWhen the prayer in the system the Father, the force revolvin\nAny problem we can solve it, if we want it then it's ours then\nI say the blessings manifested from God\nDon't get it twisted, this the Heavenly month\nI see these bitches tryin to trick you, they trickly movin quickly\nAnd it's movin to the swiftly - hehe, man it's cool, heh\n\n[Interlude]\nYeah, what if I died tonight?\nIn your arms, in your arms\nWhat if I died tonight...\nIt's all good, it's all hood\nOh baby it's on, for sho'\nYeah, you know what it is\nOne time for your mind pimpin\n\n[Bizzy Bone]\nAll good, all hood, aw baby it's on\nYou don't have to worry about your title, it's vital beyond the bone\nBelieve in the one - in the name of the Father\nThe Son and the Holy Spirit baby we must confess with our tongues\nPlay it to give it, I think we fit to havin some fun\nLoad up some funs, get a cab and baby fuck those guns\n\n[Interlude]\nYeah, what if I died?\nWhat if I died in your arms tonight, arms tonight?\nIt's like Paul said man, I die every day man\nSee, it's like a, a day on Earth is a, like a thousand years in Heaven\nYouknow'msayin? What if I, what if I died tonight?\nWhat if I...\n\n[Bizzy Bone]\nI really don't know what you want me to say\nI really don't know what you want me to do\nBut just get away from here, and only the Lord can guide me\nOkay, you don't want me to stay and I can't wait\nThey say don't turn around cause again, you know what it is\nGet away from here, heh heh heh heh, heh\nAnd only the Lord can guide me, can I tell you all?\nDo they keep throwin up twos\nI will never understand why they do what they do\nGo tell 'em they need to get all the freedom\nFrom the normal evil world and take the time\nWithout whylin out and of course\nThey gotta watch out when they cast they pearls\nThat's because I love you, you know that I'm not gonna hurt you\nAll in, you're never alone, one true soldier\nUntil the story's over, crossroads, cross toes, hit 'em with a crossbow\nRemember baby it's on, and that's because I love you\n\n[Outro]\nWhat if I died in your arms tonight?\nWhat if I died in your arms tonight?\nYeah, what if I, what if I, what if I\nStay out the wonderment with them X's and the Y's and the chromosomes\nReal choose, real game for you motherfuckers\nHol-la back, you know how we do it\nThey say like, a day on Earth is like a thousand years in heaven\nIs your grill leveled? Yeah, what if I died?\nWhat if I, what if I, what if I, what if I\nStay out that wonderment I'm tellin you baby\nCome up out that tree, don't even trip\nDon't even ask no questions, that's what it is\nThat question mark, y'knowmsayin?\nThat unknown, man that's where that shit come in\nAnd that shit start gettin broken down to the fullest\nY'know what it is, representatives\nWe have an aide, we have a path\nWe have a road that we have taken with this music, with this movement\nOne true God and we will never betray that\nIn the name of the Father, the Son and the Holy Spirit amen\nIf you don't stand for somethin, ya ass'll fall for anythang\nHolla back\n\nWhat if I - haha I told you quit askin that question man!"}], "artist": "Bizzy Bone"}