{"songs": [{"year": "1994-06-28", "image": "https://images.genius.com/da485f2d908437a49ed62020b7d39795.800x800x1.jpg", "title": "Fire", "album": "Somethin’ Serious", "lyrics": "[Intro]\n(“Fire”)\nNigga, you gotsta (“call the fire engine 'cause I’m flaming up your building”)\nNigga, you better (“call the fire, call the fire, call the fire engine 'cause I’m…”)\n(“Fire”) (“Sending fire through my spine”)\n(“Fire”) (“Sending fire through my, fire through my spine”)\n\n[Verse 1: Big Mike]\nMark ass niggas, grab your shit because it’s on\nAnd if you ain’t come to get down, then just get gone\nBig Mike is up in the house and I’m about to bring it on\nSo nigga, bring it right or just get hung for bringing it wrong\nFool, this ain’t a dream, ‘cause if it was, I’d be the muthafuckin’ Sandman\nPuttin’ niggas to sleep like so with my bare hands\nThe nigga from the hood causing wreck\nBlacker than the lacquer that you’d find on your living room set\nSo nigga, don’t fuck around ‘cause I ain’t scratchable\nI know you wants to fly my fuckin’ head but it ain’t detachable\nSo nigga, what is you askin’ fo’?\nOne to the dome, or should I just reload the chrome and blast some more?\nHittin’ every nigga up until it’s more dead\nWith the .44, laying ‘em down on their foreheads\nSo pack up your shit and retire, fool\n‘Cause come June I’ma set your world on…\n\n[Chorus]\n(“Fire”)\n(“Call the fire engine 'cause I’m flaming up your building”)\nNigga, you gotsta (“Fire”)\n(“Call the fire, call the fire, call the fire engine 'cause I’m…”)\n(“Sending fire through my spine, fire through my spine”)\n\n[Verse 2: Mr. 3-2]\nOh no, I can’t be faded, I know you hoes hate it\n‘Cause I peep out six shotswith the 9 millimeter nickel-plated\nIt can’t be debated, 1993, more murder killer upgraded\nAnd muthafucka, it’s already been stated\nFor your ass to bring it on but you hesitated\nMy nigga, my loc, my homie, I can’t be imitated\nNiggas be sick, all up on my dick, and player haters hate it\nSo get the gat, load the fuckin’ clip, nigga\n‘Cause these busta ass niggas wanna trip, nigga\nBustin’ shots in a classic as we flip, nigga\nSteady gettin’ fucked up, ‘bout to dip, nigga\nIt ain’t shit, nigga; so what the fuck is you talkin’ ‘bout?\nBumpin’ your gums, runnin’ off at the mouth\nSo pass the Swisher Sweet, so I could get higher\nAnd watch your ass ‘cause I’ll fuck around and set your\n(“Fire”) to your ass, bitch; to your ass, bitch; to your ass\n\n[Chorus]\n(“Call the fire engine 'cause I’m flaming up your building”)\n(“Fire”)\n(“Call the fire, call the fire, call the fire engine 'cause I’m…”)\n(“Sending fire through my spine, fire through my spine”)\n\n[Verse 3: Big Mike]\nHow can I kill a muthafuckin’ busta? Let me count the ways\nBlast his muthafuckin’ ass for days and days and days and days\nMonday, Tuesday, Wednesday, Thursday, Friday, lick a shot\nBlock-block, every muthafuckin’ busta gotsta drop\nWord to the muthafuckin’ heater, man\nGot a gang of niggas ready to bust a gang of caps when I see the man\nOoh, now what you hoes wanna do?\nOoh, run and get your punk ass crew\nCool, I got a gang of bullets too\nFool, one for him, one for you\nQuick fast, to the ass, niggas be damned for dying slow\nWhen I be letting the 22 plus 22 go\nBoom, yeah, boom, come again, boom boom\nWatch a muthafucka hit the floor again\nReal, rugged, rough and original\nComing from the G-H-E-double T-O\nNo nuts, no glory, 1993, niggas be gettin’ smoked with that bullshit\nIn case you didn’t know, hoe\nSo if you plan to come down, they call me sire\nYeah, ‘cause I’ma set your world on…\n\n[Chorus]\n(“Fire”) Yeah\n(“Call the fire engine 'cause I’m flaming up your building”)\nCome on (“Fire”) come on\n(“Call the fire, call the fire, call the fire engine 'cause I’m…”)\n(“Sending fire through my spine, fire through my spine”)\nCome on (“Sending fire through my spine, fire through my spine”)\nConflict’s in this muthafucka, y’all\n(“Sending fire through my spine, fire through my spine”)\nBig muthafuckin’ Mike and 3-muthafuckin’-2, yeah\n(“Sending fire through my spine, fire through my spine”)\nPee-Wee on the muthafuckin’ boards, bringing that noise for y’all ass\n(“Sending fire through my spine, fire through my spine”)\nThe Southern way, no other way, fuck what another say\n(“Sending fire through my spine, fire through my spine”)"}], "artist": "Big Mike"}