{"songs": [{"image": "https://images.genius.com/ff6738f83747060eafd4a7af4964cd8f.1000x1000x1.jpg", "title": "Carry on Tradition", "album": "Hip Hop Is Dead", "year": "2006-12-19", "lyrics": "[Intro]\nYeah, niggas want to talk about this rap shit\nNiggas want to talk about this money\nAbout these cars, these homes, these labels\nClothes, sneakers, big money shit\nNow everybody trying to get rich\nNow get rich niggas, fuck it\n\n[Verse 1]\nSome rap pioneers be them crackheads\nWhen they speak, you see missin' teeth\nSilver chain with a silver piece\nNiggas your grandfather's age, they pants still hangin' down they legs, talkin' about they ain't paid\nAnd they hate you, ‘cause they say you ain't pay dues\nAnd Slyvia Robinson was stealin' and robbin' them\nI feel it's a problem we gotta resolve\nHip-Hop been dead, we the reason it died\nWasn't Sylvia's fault or because MC's skills are lost\nIt's because we can't see ourselves as the boss\nDeep-rooted through slavery, self-hatred\nThe Jewish stick together, friends in high places\nWe on some low level shit, we don't want niggas to ever win\nSee, everybody got a label\nEverybody's a rapper, but few flow fatal\nIt's fucked up, it all started from two turntables\n\n[Hook]\nWhen they crown you and you rise up to your position\nCarry on tradition\nWhen they knight you, then you go to fight\nGo to war, don't petition, carry on tradition\nCarry on tradition, carry on, ca-carry on, carry on tradition\nCarry On Tradition\nWhen you rep what we rep, then carry on tradition\n\n[Verse 2]\nSome of these new rappers got their caps flipped backwards\nWith their fingers intertwined in some gang-sign madness\nI got an exam, let's see if y'all pass it\nLet's see who can quote a Daddy Kane line the fastest\nSome of you new rappers, I don't understand your code\nYou have your man shoot you, like in that Sopranos episode\nDo anythin' to get in the game, mixtapes\nYou spit hate against bosses; hungry fucks are moraless\nYou should be tossed in a pit full of unfortunate vocalists\nNiggas, I could've wrote your shit\nI had off-time, was bored with this\nI could've made my double-LP\nJust by samplin' different parts of Nautilus\nStill came five on the charts with zero audience\nThe lane was open and y'all was droppin' that garbage shit\nY'all got awards for your bricks – it got good to ya\nYou started tellin' them bigger dogs to call it quits?! WHAT?\n\n[Hook]\n\n[Verse 3]\nNow niggas got the studio poppin', it's mad clearer\nEngineers got his earplugs and still hear us\nThe live-in-the-park sound versus the studio state of art sound. We on the charts now\nFrom British Walkers and Argyles\nLook at us rap stars now, with our black cars now\nFortune 500 listed, brunches, sip Cipriani's\nSippin', blunted, with rich white guys around me\nThick white girls around me, Chinese lined up\nBecause I'm what? Every dime lust\nWe used to be a ghetto secret; can't make my mind up\nIf I want that or the whole world to peep it\nNow carry on tradition\nFuck a bum wack rapper makin' his career out of dissin'\nPeace to the strugglin' artists and dead one's gone, we miss 'em. I promise I carry on tradition\n\n[Hook]"}], "artist": "Nas"}