{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C Pt. 3", "title": "Live", "image": "https://images.genius.com/65ddd77ff59df02b544ca7aecbd742a1.500x442x1.jpg", "lyrics": "[Intro]\nYes, welcome back, to Infamous radio, 3-57 FM\nI'd like to thank all the callers that called in earlier\nThe love is much appreciated\nLadies call up, the request lines are still open\nWe playin' whatever you wanna hear\nRight now, we got a special request\nGonna play this young man record right here\nIt's kind of fresh\n\n[Verse 1]\nOver here we tie your ass up to a chair\nAnd throw bricks at you top speed for ya head\nSlow pain, torture style\nBetter hope one of these shits knock you out\nI enjoy watching you suffer, scream, shout\nAnd all that badman shit out the window\nAnd while he gone, Im having his bimbo\nLife is ill, and it make sharp turns bro\nNiggas is foul, they run up on you quick loc\nNiggas is foul, they run up on you quick loc, and\nLight you up, stop your green\nFrom going any further, now you don't think\nSo tough, you think you so tough?\nYou need to be cool and just get your bucks\nShould've been cool and just got the ones\nNetwork with the thugs, that's all soaked in bread\nMoney attract women, and have you (???) in\nBut loyalty is everything, you unloyal piece of shit\nUngrateful, son of a ho\nYour baby mama callin it dumb\nFucked up the dough\n\n[Hook]\nNow ain't that a bitch\nThat's life, fuck that live\nI'm nice I'm high off this\nGet right\nDo it up big, this life\nGet right live\n(x2)\n\n[Verse 2]\nAnd let die, just let go and let god\nYou be alright just cool man, calm\nAnybody violate us, we bomb\nNigga wrong gonna do that? He dumb\nAnybody that foolish, need scars\nPermanent reminders\nGot 'em all sick cause I spit like the virus\nBoy If I get up on my shit say goodbye-us\nTime for you to meet your maker, don't cry-us\nIt's a little bit too late now for that cryin'\nI'm the fly thug poster boy\nI rap for every young scrap up in the joint\nI rhyme for every time my pockets was empty\nNow I pop Don, pour some in the street\nIn memory of the old me\nThe one and only\nR.I.P\n\n[Hook]\n(x2)\n\n[Outro]\nYes, wild man, I really love this record, Ernie\nErnie we got to play this more often\nThis young man needs.. He's just... he just bitchin'\nCan I say that on the radio? yeah\nCallers call up, we still have tickets available\nFor this year's summer cornrow contacts\nRight in the projects\nB.Y.O.B\nBring your own bottle bitch\nNow hurry up and call\nTickets are runnin' out real fast\nWe're gonna get into the music right now, keept it going\nIt's infamous, 3-5-7\nDon't touch that dial\nI'll blow your motherfucking hand off\nNah I'm just kiddin, you know we playin'\nAll right we'll be right back", "year": "2012-07-03"}]}