{"artist": "Yung Joc", "songs": [{"album": null, "image": "https://images.genius.com/5200e146beed135df8a24d5e4cf8a432.600x600x1.jpg", "year": null, "lyrics": "[Intro: Yung Joc]\nHey love, you remember your first time? (New Joc City)\nGet dat with a real kid? (Block Entertainment)\nWell let's talk about it (Bad Boy South)\n\n[Hook: Marques Houston]\nIt ain't nothing like the first time\nI'm tryna tell you I can blow your mind\nBaby, if I touch you here and kiss you there\nGonna fall in love, shorty, best beware\nThere ain't nothing like the first time\nI'm tryna tell you I can blow your mind\nBaby, if I touch you here and kiss you there\nGonna fall in love, shorty, you best beware\n\n[Verse 1: Yung Joc]\nThis ain't no love song, mo' like a cut song\nYou say your day was long, well tell daddy what's wrong\nI'ma tell ya one time, just relax and unwind\nWhisper sweet nothings now you're blushin' chills down your spine\nOh yeah you hot and tempted, oh no not Pretty Ricky\nBut when you grind on me, I'm gon' leave relieve your symptoms\nJust slip in them satin sheets, move a lil closer\nTake you on the scream machine like a roller coaster\nLet's turn it up a notch, kiss your hot spot\nI'ma do it non-stop until your legs lock\nI'ma keep goin' and goin', the Energizer Bunny\nMr. Make You Feel Good, what you want from me?\n\n[Hook: Trey Songz]\nIt ain't nothing like the first time\nI'm tryna tell you I’ma blow your mind\nBaby, when I touch you here and kiss you there\nYou gone fall in love, shawty, best beware\nThere ain't nothing like the first time\nI'm tryna tell you I’ma blow your mind\nBaby, when I touch you here and kiss you there\nYou gone fall in love, shawty, you best beware\n\n[Verse 2: Yung Joc & Marques Houston]\nWon't ya let me introduce ya, to thug Karma Sutra\nThis ain't no lovey dovey, nah but watch how I seduce ya\nGirl I'm the man, I'm the man\nYou love in my mouth, not in my hands\nOh yeah I like it slow, baby, be easy\nGon' dip it low, baby, be easy\nTell me your Vicky Secrets, tell me all the dirt\nYou smell like peaches, must be Bath & Body Works\nLove the way yo' body work, I'ma make yo' body rock\nYou take a deep breath, you gon' feel the aftershock\nI know I got you hooked on this lovin\nDon't get it twisted, we just cuttin', baby\n\n[Hook: Marques Houston & Trey Songz]\nIt ain't nothing like the first time\nI'm tryna tell you I can blow your mind\nBaby, if I touch you here and kiss you there\nGonna fall in love, shorty, best beware\nThere ain't nothing like the first time\nI'm tryna tell you I can blow your mind\nBaby, if I touch you here and kiss you there\nGonna fall in love, shorty, you best beware\n\n[Verse 3: Yung Joc]\nYeah, I know I know, your lips so soft\nBut I gotta go, let's hit the shower baby, it's time to rinse off\nI'll wash yours, you wash mine, I'll adore it the first time\nYou got yours, I got mine, sometimes I'll drop you a line\nBut look, don't tell nobody, just keep it on the low\nNot your best friend, not your cousin, nobody's gotta know\nI know it sounds crazy, but that's just how it is\nYung J-O-C, long live, long live\n\n[Hook: Marques Houston & Trey Songz]\nIt ain't nothing like the first time\nI'm tryna tell you I can blow your mind\nBaby, if I touch you here and kiss you there\nGonna fall in love, shorty, best beware\nThere ain't nothing like the first time\nI'm tryna tell you I can blow your mind\nBaby, if I touch you here and kiss you there\nGonna fall in love, shorty, you best beware\n\n[Outro: Marques Houston & Yung Joc]\nM.H. and Joc, shorty we gon' give it to ya\nMmhmm, yeah I know y'all wasn't expectin' that\nM.H. and Joc, shorty we gon' give it to ya, girl\nWelcome to \"New Joc City\"\nHey, oh, oh baby\nGoodnight", "title": "1st Time (Remix)"}]}