{"songs": [{"year": "2014-11-21", "lyrics": "[Intro]\nHey, I said hey\nHey, hey, hey for real\nCome on man, uh\n\n[Verse]\nLook, crept through the door\nCame through the back\nI lifted up that dope\nShe said \"what is that? Wax?\nWhat is that? Velvet? Roses I'm smelling\nBitch it's that fire\nI'm twisting that dope like bitches and yoga\nI'm stretching it out, uh\nNiggas run the 3.5 in 1.1 hours\nLunch filled up with that sour\nIf you got strong we got power\nAnd we got powers cause my plug plugged in\nWe out of sockets\nOut of pocket and you still dug in\nCame up with nothing\nI juug and finesse\nFell back for a (?) Tec\nFinna free Timmy Caine\nAnd Shawn P, I ain't tryna be next\nIt's on me when my niggas get out\nStrong weed and the bitch in the house\nFatass, big tits, and no blouse\nAnd molly to dip in the (?)\nRolling around\nAll I gotta pay is 45 for the grammy\nTook a grammy and some mo to New York, we was gold\nI've been slurring cause that potion got it hard to understand me\nWhen you filled up with that (?) I DRAM up for your mammy\nWord around the town is that I'm hydronic\nAnd you heard the same thing ain't that ironic\nThat thing there ain't a hit unless I'm on it\nAnd this right here a hit cause I'm on it\nWhenver I'm on E, I ride around for that gas\nI can't settle, I'm never glad when it's bags of trash\nIn the ghetto is where I can the (?) my cash\nAnd blow that spit out and (?) when (?) bitches drive past\n\n[Hook]\nRoll that shit, light that shit, smoke that shit, yoga fire\nRoll that shit, stretch that shit, flip that shit, yoga fire\nIt's so good when that shit hit your lips, yoga fire\nYou got piff? That ain't this, hit that shit, yoga fire\nYoga fire, it's that yoga fire\nYoga fire, it's that yoga fire\nYoga fire, yoga fire\nYoga fire, yoga fire\n\n[Outro]\nYayaya hey hey fuck all that shit man. Really really roll up, roll up, man you got like (?) on you man. But you owe me nigga, you owe me that (?) from last time nigga stop fucking around. You always gotta fuck with me like that man you already got that light that shit up man stop fucking around. Yoga fire, I just made that up, how the fuck you yoga fire? 1EpicSummer", "title": "Yoga Fire", "album": "#1EpicSummer", "image": "https://images.genius.com/e6707cbe88b21207d4fedad203379cc7.500x500x1.jpg"}], "artist": "DRAM"}