{"songs": [{"image": "https://images.genius.com/af0654553d67f7e1591754d04df663e0.500x500x1.jpg", "title": "Eyes", "album": "The Honor Roller", "year": "2013-01-28", "lyrics": "[Verse 1]\n\nPush away the bad shit, getting all the good energy is a fashion\nLocal satisfaction, is what I please when I spit these lyrics out\nUrban relaxation yes I get it from the South\nIm a Queens baby and my father was a drug dealer\nGold watch, gold chain, new Lexus, new beeper\nMet that nigga once or twice\nHe always had a different wife\nNot to mention different kids\nShout out to my bros and sis...\n\n[(Nebu begins talking)]\n\nThat's just the point of life you feel me. I got like one picture of my father, and uhm that's about it\nI dont know how to contact this nigga or any of my sisters or brothers thats on my dad's side\nBut, you know what im sayin, Ima meet them...\nOne Day\n\nLet's Go!\n\n[Verse 2]\nPush the pathway to success, hittin' the expressway\nSmokin', chokin' on the best, high until the next day\nI see through fakes like x-ray, four eyes I got vision\nCrash into a lake and drown, is that water whippin'?\nCall yourself the victim but really you're the suspect\nI'm hungry for the success, like I ain't eat lunch yet\nThey tell me that I'm up next\nNigga I don't see no line\nAin't no next my time is now\nAnd Im a king my fro the crown\nNappy ass nigga, nappy nappy ass nigga\nI do not give a fuck cause Im a happy ass nigga\nBout to get some money in my bank account with a smile\nTake the deposit out, and go next door and cop some loud\nHit JG and blow it now, who operating on some different shit\nIt don't get as real as this\nShe put on her lipstick, and my dick she started to kiss\nAnd it's looking like a baby arm, playing with a red crayon\n\n\nIt's like to the point where I really don't give a fuck anymore yo. You know what I'm saying I'm me\nAnd uhm, everything happens for a reason. There's a lot of questions that'll never be answered and it's like... the way shit's going these questions will stay unanswered.  Something's gotta give. But ima keep on pushing, keep on working.  People love me. Ima give them the love back, never put this mic down.  Real shit this ain't the high talkin. And uh I appreciate every fucking body man, since day 1 repping OSHS, letting everyone know who Nebu Kiniza is.  Keep doing it man we got a way to go\nI wanna take over America, I wanna take over Paris, I wanna take over the world.  I want niggas to know\nI am all over the world.  Let's rock it"}], "artist": "Nebu Kiniza"}