{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": "The Bay Area Bully", "lyrics": "[Hook]\nNow baby I can take you to Mars\nBut I ain't got no gas in the car\nYou can walk right next door to the bar\nYou should just be happy just to fuck with a star\nNow baby we can go to Brazil\nBut it'd be cheaper if we sat here and chill\nI got a lot of problems and a whole lot of bills\nFuck what ya heard I'm just keeping it real\n\n[Verse 1]\nSeemed like yesterday I was in Malibu\nSpending bucks and giving and gifts like Santa do\nNow they ask me, \"Ya Boy, why the attitude?\"\nI'm broke and I need some dollars bitch, you got a few?\nMy bitch tell me rap ain't gon' work\nI need to give it up and go put on a FedEx shirt\nWhat makes it worse, I'm five thousand a verse\nWithout having a curse I'm ten, no one trying to spend\nSo I'm back to my momma house\nShe gave my room to my sister\nNow I'm sleeping on the couch\nAnd they ask what I frown about\nCause I'm the hottest on the west and I'm down and out\nNow tell me, remember them diamonds on my wrist?\nNo more, yesterday I had to pawn that shit\nI'm stressin, I got salad with no dressin\nWas livin the life now I'm stuck in a recession\n\n[Hook]\n\n[Verse 2]\nThey just cut off the water in my building\nBathing out of water bottles not a good feeling\nNo bitch I ain't got no sugar you can borrow\nLet me get a candle cause my lights get cut off tomorrow\nNo food in the refrigerator\nJust Kool-Aid and some KFC mashed potatoes\nCan somebody call an exterminator?\nThis cockroach just stole my pack of Now and Laters\nTattoos on the front, back and side of me\nNow honestly, what job gon' hire me?\nMan, this rap shits fucked up\nIt seem like everybody having tough luck\nPull out the bicycles put the gas pumps up\nThe gasoline prices baby that what's up\nI need a good meal and I need a hair cut\nMy pockets inside out nigga and what\n\n[Hook]\n\n[Verse 3]\nEven chicken is expensive\nIt's six dollars just to egg a nigga winda\nAnd drive-bys cost too\nSo they on bicycles doing what they gotta do\nLook, my bitch say she want Mr. Chow's\nI turned around and looked at her like \"Bitch, how?\"\nI can't even afford to wax your eyebrows\nIt's hotdogs on the stove girl pipe down\nI went from the green leaves to the Black & Milds\nAnd I done went from the iPhones to the burn outs\nPolly seeds and corn nuts got me turned out\nBut anything goes when you in a paper drought\nI'm tired of rap niggas talking what they paper 'bout\nWhen they ain't got enough dough to start a bank account\nGot money better know that it's a blessing\nLet's see how long you can survive this recession", "title": "Recession"}]}