{"songs": [{"image": "https://images.genius.com/857a416f44825b13b2e0155587142ae2.600x600x1.jpg", "year": "2002-10-01", "title": "BK to LA", "album": "Man vs Machine", "lyrics": "Yeah! AOWWW, AOWWW!\nC'mon! Yeah, yeahhh (yeah) yeahhh, yeahhh\nM.O.P.! Uhh (X to the Z)\nYeah baby, that's right, you know how we do it\nOne time, X, where you at my nigga?\nFIYAHHHH!!!!\n\n[Xzibit]\nI spread the hate, like Taliban records and tapes\nShoot five times to the sky, gimme some space\nI got y'all, runnin in place, cut to the heart of the subject\n(MASH OUT NIGGAZ!) Straight from the gutter you love it\nAin't nothin above it, we stomp y'all religiously\nWatchin paper thugs tryin to hide behind the industry\nFrom here to infinity, love thy enemy\nNiggas got the knowledge but don't know the chemistry\nAll inside your baseball hat and kneecaps\nWith baseball bats ('TIL FAME HIT YOU WITH THE MINI-MAC)\nFull body black fatigues, lungs black from weed\nIn black limo tinted SUV's with Bill\n\n[Billy Danze]\nSTILL (still) WORLD (world) FAMOUS\nThe underdogs of rap, back to claim this, the fact remain we're\nHeartless and painless, it's dangerous to strangers\nThat try to change us, knowin we're anxious to flame 'em\n\n[Hook 2X: Xzibit + M.O.P.]\n[X] Huh, you want problems I'mma bring 'em to you\n[B] We cockin them thangs\n[X] Yeah, I got a song let me sing it to you\n[B] We ready to bang\n[X] Yeah, you talk impressive, you don't mean it do you?\n[B] Watch where you aim\n[F] Get lost in the game, get tossed in the flames, nigga\n\n[Billy Danze]\nYou must wanna throw the towel in holmes, it's your man B.D\nFrom N.Y.C., the N.Y.G. (IT'S)\nM.O.P., and X to the Z\nIs a friend of our family (YEAH MY NIGGA)\nFor you, counterfeit, wannabe hardcore players\nI rub you under your face with single-edged razors\nCold street INTELLIGENCE, O.G.'s and REBEL MEN\nGrip quick, cock squeeze and LEVEL MEN to SETTLE IT\n(From L.A. to) B.K., from B.K. to (L.A.)\nPersistant and insistant on doin it our way\nDo you really wanna fuck with Danze? (c'mon)\nWhen he comin with them thugs in the van\nDouble clutch in his hands, my nigga\n\n[Lil' Fame]\nMake the world flame! Face the Fame-ster, part, Fame-ster\nY'all niggas akin to God and gangsters\n(YOU SEE IT!) It's the M dot, to the O dot, to the P\nWith X to the Z hot, what's happenin?\n\n[Hook]\n\n[Interlude 2X: Xzibit]\nHunt down, hurt, hang and hate the hater\nWatch how you rise, fall and thank me later\nLook in my eyes, I should not have to say it\nLook alive, these streets is complicated\n\n[Lil' Fame]\nAOWWWWWWWWWWWWWWWWWWW! You got problems with us? Start poppin\nI get in yo' chest like anthrax, vaccine couldn't stop it\nLet's move on 'em (aoww) must move on 'em\nRush in, gun-bustin, black seven plus tools on 'em\nNever snooze on 'em, I'm short, haven't got room for 'em\nI send you to God with no shoes\nCLUELESS! Real G's run this, we rule this\nIf you wanna get into some gangsta shit, let's do this\n(YES SIR!) No question, no half-steppin\nStreets is my profession, heat in my posession\nHollow-tips is the answer; look around you see the signs\nSay \"NO SMOKIN\" but our guns got cancer!\n\n[Xzibit]\nYeah cause I'm not (I'm not) what you thought I was\nLike my career was gon' fade like a fuckin buzz\nRaise the stakes high, I solidify\nThe grip that I keep on shit, GET OFF MY DICK!\n\n[Hook]\n\n{*random ad libs to fade*}"}], "artist": "Xzibit"}