{"artist": "G Herbo", "songs": [{"title": "Gangway", "album": "The Best of Lil Herb & Lil Bibby: Heir Apparents", "year": "2012-06-12", "image": "https://images.rapgenius.com/04c67cc48cd213e1ef1cff5c3b460abe.1000x1000x1.jpg", "lyrics": "[Intro]\nNigga lookin' for us we out there in that gangway man\n78th man\nCome get it\nRoc-block\n\n[Hook]\nI be in that gangway, where we slang yay\nCatch a body and bond from the station in the same day\nMoney out the way but our location in the same place\nI remember days when we stayed by that gangway\nYoung niggas, but we never played by that gangway\nCold hearted killers get you blazed by that gangway\nThey like \"y'all gone get enough of hanging by that gangway\"\nTrappin' hard, but we still bangin' by that gangway\n\n[Bridge]\nThem niggas from that gangway'll put in work\nNo problem only your conscious could get you hurt\nIf you try to hit us up, we gone come and hit you first\nTeam full of solvers and problems come with a shirt\n\n[Verse 1]\nI from the side where they found Derrick Rose\nHe made a name off jump shots, we was out there shootin' poles\nHustle hard stackin' 0s, we was tryna get the dough\n'til they started snatching 0s then we started snatching souls\nWe grew up right by the store, young as shit and we was runnin' shit\nStarted gettin' respected quick, earned it with a hundred clip\nRan into some beef then my youngins started dumpin' shit\nCut some niggas from the circle, they was on some other shit\nMy dogs was trained to go, they was blowing out they mother shit\nWe grew up on loyalty, EBK a brothership\nOr should I say ya brotherhood, either way my brothers good\nAnd if nigga wanna play pussy, I'mma blow em down like a﻿ brother should\nAnd you know I got the ratchet on me, if I'm ridin' round in another hood\nSmokin' 3 5s out a blackjack, tell white Shawn roll another wood\nAnd my niggas up to nothing good, every day is like the same day\nAnd if a nigga out here looking for me you can find somewhere by the gangway\n\n[Hook]\n\n[Verse 2]\nYou can catch me on that 8 block where we bang at (Rock-block)\nIf a nigga try to send shoots then his forehead what I aim at\nAnd a nigga got that straight drop, all they wanna know is where the cane at?\nHave my young niggas hit and kick doors, all they wanna know is where the stain at?\nRun up in a nigga trap house with the macs out, where the keys at?\nPussy nigga wanna act up, he get clapped up cuz' I need that!\nTake everything we can get up out it and forget about it, where the weed at?\nAnd a lot of niggas out here hatin' on me, if you heard something don't believe that, straight-up\nNiggas out here need to get there cake up\nGettin' to the money when I wake up\nI get all the cash I can take up\nAnd if I'm missing money then I make up\nBut if I don't eat it's a drought in the street\nSo early in the morning I'm out with this heat\nAnd I'm all about the check, 'til a nigga disrespect\nLike a day with LeBron, bitch I'm out with the Heat\nA lot of these dudes don't be out in the street\nI ain't in the house, bitch I'm out you can see\nLet a bitch nigga act 'bout it to me\nHave my young goon punch 'em in the mouth 'til he sleep\nRidin' round town with the strap in the seat\nRun into a opp put the Glock to his cheek\nThought he'll make from the bottom to the top\nPop a shot from the Glock knock his top on his sneaks\n\n[Hook]"}]}