{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/b59b51bf880fd8415e9f016385674205.400x399x1.jpg", "year": null, "album": "Piss’n In a  Barrel of Bee’z", "lyrics": "[Intro]\nBrrptptatata\n'Ey when your hear shots ring\nIt's probably my team\n\n[Verse]\n10 o'clock I'm in the shower, phone rings\nIt's for you Wayne, I'm in the shower\nIt's important Shawty Fatt is on his way\nSaid he needs to talk to you before the show\nTonight at 2:31, alright, okay\nSlide the curtain back and grab the phone\n\"What up? what's up with it? what's going on?\nIt isn't like you, to go interrupting me for anything at all\"\nHe said \"I'm just fucking with you Wolf\" and laughed if off\nHahaha.. Dick head, hang up the phone\nTake the phone, wrap my towel, dry off and throw my clothes on\nIn an hour we go home, though I ain't liking the idea\nOf opening up for Trina\nI support my clique through whatever\nSo I met my team up at the parking lot\nWe all came together in separate cause\nWe like to debate up alot, small town super stars\nEvery clique got somebody\nThat is spotted more than bout it\nBut I doubt if you ever seen a soldier more bout it\nThen I ride and die\nPartner with the hard like a pirahna\nAnd I bite like a lion\nWith the bullets to back up the drama\n2 Real for TV, yea pulled up in a Minivan\nBumpin' that Jeezy, \"What up Wolf?\"\n\"What up my man?\", I dept his hand\nSecurity was yelling already that we needed to move\nBut we ain't studying that until security lost a clue\nAnd started mouthin' off to the wrong one\nSpecifically the main one who aim guns\nNo, bad idea fat boy, I seen it coming\nFistful surrounded them\nA couple of them was swinging and yelling\nIt could've been over in just a second\nBut the asshole was persistent\nAnd 2 Real for TV ain't with it\nMe and my dread homie held tight\nThey started yelling out the cops are coming\nBut it was to late something's got a hold\nAnd 2 Real popped the trunk, grabbed the steel\nCocked it back and walked into the front door of the club\nYou don't want it here, there, anywhere I promise you\nThe sirens are sounding, we [?] with the rest of the crew\nCalled my homie Fist to get the scoop of what went down\n\"It was nothing Wolf\", shit\nWe up in this bitch chillin' now\n\n[Outro]\nDamn\nThat's how ya'll get down?\nFor sho' Fistful", "title": "2 Hot 4 TV"}]}