{"songs": [{"lyrics": "(Chorus:)\nAfromans pimpin Pennsylvania\nIf you don't know how to suck, I'll train ya\nFlyin down the 76 like a 76er\nBetween the turn table keep the Colt 45 in the mixer.)\n\nChillin With My girl in Pittsburgh\nFuckin her tits whiles I hit the herb\nFucking her friend in State College\nNo degree, just ghetto knowledge\nShe's from Penn State\nI'm from the State penn\n\nI'm afro mutherfuckin M A N\nGetting licked by a girl in Lancaster\nLeavin her face a complete disaster\nPots Town, Weeds Ville\nPennsylvania getin high for real\nBetty with the Gettysburg Address\nI raised her dress and left a mess\nThis girl from Altoona\nI opened her legs, it was all tuna\nI met this girl from Clearfield\nWhen the coast was clear, I fucked her in the field\n\n(Repeat Chorus:)\nJust up in the city of brotherly love\nWhat a bunch of Faggots\nI'm just playin damn\nYou know I like Randall Cunningham\nDr. J, Charles Barkley\nIverson, I ain't done\nThe Fresh Prince, Jazzy Jeff\nSchooly D, smokin blunts to death\n\nSo Dr. J, fuck that J\nRoll me a Philly for the city of Philly\nWe used to be boys but we turned them in with the munchies\nEatin Philly Cheese steak again\n\nWho's that smoking by the liberty Bell?\nIt's Afroman from East Palmdale\nSigning the declaration of independence from our dependence\n\n(Repeat Chorus:)\nLauren, from the city of Warren told me I was boring\nI pimp slapped Lauren now I got Lauren out there whoren\nMet this girl form Grove City, as I drove, she flashed her titties\nI dropped her off in Clarion, Slapped her on her ass, said carry on\n\nTook my hoes to Johnstown, they jumped out the car, sucked the Johns down\nFucked this girl, form Kittaning, while she was in the backyard tanning\nMet this girl form Chevy Chase Heights, my dick takes frequent flights in her pussy and around the globe\nBack to Latrobe, fuckin in a Ford Probe\n\n(Repeat Chorus:)\nWinter time, feeling leery, van broke down right by Lake Erie\nMet a little girl in Mill Creek, put my cold hand on her warm butt cheek\nGot a motel up 79, turned on the heat and everything was fine\nMy van got (indc) in Corry\nWhile I fucked the receptionist Laurie\n\nDid a show that night in Titusville\nAfro is the tightest and that's for real\nI know why the call it Oil City\nAll the women like oil on their tittys\n\nI met a new girl in New Castle\nNothin feels better than a brand new asshole\nVirgin girl, from St. Marry\nAfroman poppin that cherry\nSummer, from Somerset\nIn the wintertime she's still wet\nI met a rich lady in Buter\nI said, I'm Afroman, your new butler", "title": "Pimpin’ Pennsylvania", "album": "Waiting to Inhale", "image": "https://images.genius.com/9a4062521e7bceaeec8fcfcf6308b5c0.500x500x1.jpg", "year": null}], "artist": "Afroman"}