{"songs": [{"title": "Bleed", "lyrics": "[Intro]\nHey yeah, yeah, yeah, yeah whatever, ayy\n\n[Verse 1]\nFour years later they still sleepin' on me (Sleepin' on me)\nAnd I ain't gotta get the strap 'cause I keep it on me\nIt's crazy how I got a big dick without a dick (Uh-huh)\nIt's Young M.A, don't ever let that name come out yo' lips (Woo)\nI'm the big goon\nI send my goonies to your crib and you can die inside your livin' room (Crrt)\nIf gettin' money mean you dumb, well, fuck it, I been a fool\nAnd I ain't just go and get the food, I built the kitchen, too\nI'd rather be inside some pussy than do this interview\nLittle gay nigga, hoes been on me since, like, middle school\nBreak up with a bitch, by next week I won't remember you (I won't remember you)\nJust because I put it in don't mean I'm into you\nInto foreign countries with a foreign chick (Woo), foreign whip (Woo)\nForeign food, foreign shoes, just a bunch of foreign shit (Uh)\nNiggas wildin' out in Paris, Colten you recordin' this? (Huh?)\nPut two hundred thousand on my balance just for talkin' shit\nFuck it up on tour and shit (Fuck it up)\nRem handle the important shit\nIt's funny how haters throwin' shots but they ain't callin' it (Nah)\nUh, clear the way, make room, please excuse\nThat's a real nigga walkin' in\n\n[Chorus]\nHuh? It's M.A, bitch (Woo)\nYou got somethin' on your mind, then say that shit (Say that shit)\nWe kingpins, this is not a playpen (Woo)\nIn other words, we don't play that shit (We don't play that)\nM.A 'bout to drop, better play that shit (Better play that)\nHoes love me, them niggas hate that shit (Hate that)\nThey be like, \"Ooh, I hate that bitch\" (Ooh)\nOoh, but ain't they broke and ain't I rich? (Huh)\n\n[Verse 2]\nOoh, ooh, shake 'em off (Shake 'em off)\nNiggas wasn't on their job, had to lay 'em off\nHer nigga wasn't on his job, had to break her off\nThree words for these hoes, take it off\nOoh, drop panties, no hands please, she don't need plan Bs\nShe pop' Xannies like it's candy, that's why she antsy (Ooh)\nBut she nasty and I'm a thorough bread nigga with a attitude\nIt's Young M.A, make sure that M and A is capital (Yes)\nBeing broke is a joke, that's why I'm never in a laughin' mood\nAlways got the trap clickin' like they some tappin' shoes\nIt was either get rich or die, I had to choose (Ooh)\nGet Rich or Die Tryin', Curtis Jackson move\nBipolar, can't control her, keep a tool with me\nStrapped across my shoulder cause my mind is like a bag of screws\n(Grr)\n\n[Chorus]\nHuh? It's M.A, bitch (Woo)\nYou got somethin' on your mind, then say that shit (Say that shit)\nWe kingpins, this is not a playpen (Woo)\nIn other words, we don't play that shit (We don't play that)\nM.A 'bout to drop, better play that shit (Better play that)\nHoes love me, them niggas hate that shit (Hate that)\nThey be like, \"Ooh, I hate that bitch\" (Ooh)\nOoh, but ain't they broke and ain't I rich? (Huh)\n\n[Verse 3]\nFlex, ooh, Hercules\nIn this motherfuckin' booth leavin' third degrees (Ooh)\nCookin' crack up in that stu', I gotta serve the fiends (Huh?)\nHop in that Maybach tell the driver, \"Umm, curtains please\" (Woo)\nRich and filthy, still rock silky red rose certainly (Uh-huh)\nBlack and blue, that green one too, just copped that burgundy (Woo)\nI swear I try to change my ways but it ain't work for me (Nah)\nFuck a bitch 'cause currently, my mood is currency (Yes)\nAnd I'm sippin' Hennessy, make sure it's privilege please (Ooh)\nI'm countin' up, she said \"How much?\" I said infinity (Woo)\nIf I don't come for you, ayy, do not send for me (Woo)\n'Cause I will pop this brand new Glock, take her virginity (Grr)\nUh, big pimpin', spendin' Gs (Spendin' Gs)\nWhat I look like trickin' on a bitch, that ain't did shit for me? (What?)\nCan't be in my vicinity without abilities (Nah)\nAll you haters hold my nuts and suck my dignity\n(Suck my dignity)\nSheesh", "album": "Herstory In The Making", "year": "2018-11-29", "image": "https://images.genius.com/dd286c758e5283a01ccb912b73b84066.1000x1000x1.jpg"}], "artist": "Young M.A"}