{"songs": [{"image": "https://images.genius.com/160815eb312ed9599c9b09f532708095.552x552x1.jpg", "year": null, "lyrics": "[Letra de \"Es Mi Gusto\"]\n\n[Intro]\nEn veces la raza se pasa\nCriticando a uno, que como me visto y acá\n'Ta madre!\nMejor que se vallan a ver-gansitos no?\n\n[Verso 1]\nPor la manera que me visto\nEl modo que camino\nEl gusto que yo tengo de cerveza y no de vino\nSe pasan criticando\nA quien miro y con quien ando\nQue anoche me llamaron\nLa jura me anda buscando (¿qué?)\nQue me la paso en la calle\nQue por eso mismo no encuentro jale\n¡Ah, qué cabrones!\nNo dejan vivir a gusto\nEl día que me muera les voy a sacar un susto\nPero en otro rollo si quisiera preguntar\n¿Quién chingados dio permiso de mi vida criticar?\nSoy el único, original en este mundo\nUn poco hocicón y el pensamiento profundo\nEn este caso les tendré que platicar\nPorque la vida de un cabrón no se vive a lo normal\nSo, ya lo saben, no es cuestión pa' que se claven\nDespacio todos juntos como si fuera un revés\n\n[Coro]\nMi gusto es ...\n¿Quién me lo va a quitar?\nHasta que yo me muera nada lo puede parar\nSolamente Dios del cielo me lo quita\nDisfruta de lo bueno de la vida por 'orita\n\n[Verso 2]\nPor ahí me dicen que les caigo mal a unos\nEs lo de menos, no tienen nada más que celos\nSon cosas que no me importan, mi atención soy yo\nY dale gracias a mi jefe por los huevos que me dio\nMe critican por todo, solo digo la verdad\nSi te ofendes aquí va tu amistad por la ventana\nDicen que por las joyas que yo traigo\nDebo de andar vendiendo algo\nNo hay pedo\nSigo adelante como me gusta\nHasta tu vieja a mi me busca\nPregunta; ¿Qué es lo que tengo yo que tu no tienes?\nEs carros, feria y dos tres más mujeres\nNo es pa' que te agüites (no te agüites)\nEs para enseñarte\nQue hay cosas mas importantes ¿no crees?\nNo gastes mas energía en odiarme, esta es mi vida\nY mi gusto mejor trata de olvidarme\n\n[Puente]\n¿Cómo la vez? Pinche raza\nNomas andan buscando a ver que le hayan a uno, pa' criticarlo\n\n[Coro]\nMi gusto es ...\n¿Quién me lo va a quitar?\nHasta que yo me muera nada lo puede parar\nSolamente Dios del cielo me lo quita\nDisfruta de lo bueno de la vida por 'orita\n\n[Verso 3]\nAnda, anímate\nVen y ponte en mi lugar\nMi mundo va rodando y nada lo puede parar\nA lo macho yo nunca me porto gacho\nLos fines de semana me la paso bien borracho\n¿Crees que aguantes? Mejor piénsalo muy bien\nSon mis gustos escandalosos como el tren\nSin rencores voy rompiendo corazones\nArriba todos ellos que comprenden mis razones\n\nLas cosas que yo traigo no vienen simple\nNomas estas pinches escuinclas que me siguen\nTodo lo demás es duro jale, neta!\nAgárrate los huevos y aprieta\nSi te dicen de otro modo mándalos a ver-Galavisión\nGente así acaba en el panteón\nHaz lo que tu quieras pero goza de tu vida\nY pon tu raza bien arriba\n\n[Coro]\nMi gusto es ...\n¿Quién me lo va a quitar?\nHasta que yo me muera nada lo puede parar\nSolamente Dios del cielo me lo quita\nDisfruta de lo bueno de la vida por 'orita", "title": "Es Mi Gusto", "album": " Proyecto Akwid"}], "artist": "Akwid"}