{"songs": [{"title": "48 Prisons", "image": "https://images.genius.com/02d3ad2b829899023edb27dd83a02009.1000x1000x1.jpg", "lyrics": "[Intro - Braille]\n\nLet's see what Xperiment made for the record\nDude, what is that — like, Morse code?\nYou picked the right production name, I'll give you that\nEverything you make sounds like an experiment\nThis beat is so weird!\nHow am I supposed to rap over this?\nFor real, come on, man\nCOWBELL!\n\n[Hook - Unknown]\n\nSpit prison cells\nLivin' in the world, no different, for myself\n\n[Verse 1 - Braille]\n\nTried to get it right the first time\nBut I couldn't nail it\nYou only get one shot\nI'm aimin' with a nail gun\nTrigger happy, took a couple extra under pressure\nSweatin' bullets but I let the salt marinate my skin\nSalt of the earth, walkin' closer to the fault line\nWhose fault is it? It's mine, but I'll share\nContagious, beware, Visionaire with a blank stare\nBankrupt souls, who wants to be a millionaire\n\nThere's a million ways to die, only one catalyst\nSin is the enemy we battle with\nJealousy don't gel with me\nThis felony just fell on me\nKeep this dirty little secret\nLike, tattletale, don't tell on me\nEverything in moderation\nMonitor your consumption\nGet in a slump and blame others for your corruption\nThe gossip is toxic\nIntoxicated at a toxic bar, saying, \"At least I'm not a rapist\"\n\nIt's tasteless\nYou can run but can't escape it\nWatching pornography, constantly washin' your hands\nSo much audacity\nActin' like you're innocent 'cause someone else is worse than you\nTake it personal\nWe perpetrate it, look at the data\nCrooked nature can't manage the commandment to love our neighbors\nDanger, danger, we can never earn the favor\nOr deserve fellowship with the Creator, so holy\n\nTry to be the hero but we're more like heroin\nBoastin' about our bondage, ignorant and arrogant\nThey want that pure, uncut, and unadulterated\nI want that pure, uncut, but no adultery\nTell me lies, sweet little lies\nWhite lies come from black hearts\nTake the mask off, face the facts raw\nNone of our facades are foolin' the triune God\n\n[Interlude - Braille]\n\nThis beat's actually kinda hard, dude\nNah, I'm feelin' it\nYo, but this song's called \"48 Prisons\"\nI only spit 32 bars, we gotta keep it going\nGimme more!\n\n[Verse 2 - Braille]\n\nPleasures of this world leave me thirsty with an empty cup\nTwisted definitions of manhood, I can't measure up\nLoosen my possessions, in the heavens throw my treasures up\nBetter get some shelter when the bad weather comes\nWhen the rain falls, when it's all said and done\nI just wanna be conformed into the image of the Son\nTo live is Christ, to die is gain\nYou were murdered for my shame, I will suffer for your name\n\nNo one took your life, the sacrifice you freely gave it\nSet free all the captives and broke the chains of enslavement\nRose from the grave in a glorified body\nNo false prophets can make the same claims\nI'm inconsistent but the Lord is magnificent\nAnd my life is significant 'cause he's the one givin' it\nMakin' me obedient, sanctified livin'\nJesus the ransom for sinners, he can unlock the prison", "year": "2011-08-30", "album": "Native Lungs"}], "artist": "Braille"}