{"artist": "Big Boi", "songs": [{"lyrics": "[Hook: Sleepy Brown]\nHey, just touched down, been gone for awhile\nTryna find you, where are you now? I've been looking for you\nCome through, get you, riding out, we'll do\nSoon as I can find you, I've been looking for you\nHey, just touched down, been gone for awhile\nTryna find you, where are you now? I've been looking for you\nCome through, get you, riding out, we'll do\nSoon as I can find you, I've been looking for you\n\n[Verse 1: Big Boi]\nLet me give you one to grow on\nMe and you have been digging each other now for so long\nLike an archaeologist looking for our bones\nWe used to do it to the slow songs\nThen our hormones would mix up from the sweat\nCause I feel it drip drop from my pecs to your chest\nI send a text from the jet, just to get you slippery\nMemories of you soaking wet\nThat's the only time I might slip\nThen I slide between them thighs, she keeps it tight-lipped\nLike a vice grip, it's so private\nMum's the word unless I'm knee deep inside it\nThree's company not crowded, I get\nCake, eat it too and apple pie\nSlices with the ice cream, icing, à la mode\nShe inspires and excites me now you know\n\n[Hook: Sleepy Brown]\nHey, just touched down, been gone for awhile\nTryna find you, where are you now? I've been looking for you\nCome through, get you, riding out, we'll do\nSoon as I can find you, I've been looking for you\nHey, just touched down, been gone for awhile\nTryna find you, where are you now? I've been looking for you\nCome through, get you, riding out, we'll do\nSoon as I can find you, I've been looking for you\n\n[Verse 2: André 3000]\n(On some cool shit)\nWell here's a revolutionary idea\nWhy don't we both stay home and if the doorbell goes ding-dong\nWe can act like we not here\nPut them house coats on and take them right back off\nAs a result, like we work at Ikea\nTest every piece of furniture to see if it is stable\nYou wanna take it out on me then do it on the table\nMmm! Blow to the head, it's fatal\nWait til, you get a load of me\nI ain't joking, Dark Knight, Batman\nAnd I'm poking that pussy-cat, woman\nPoke-it-man, baby gon' push it back on me\nHoping that maybe you'll wake up in the morning\nAnd forget about it all, I hate to see you sad\nSo if anybody call, tell em that you'll let em know\nWhen we fall back to earth, go berserk, baby\n\n[Bridge: Sleepy Brown]\n(I've been looking for you)\nCome on in, I've been looking for you\nBaby, where you been? (Where you been?)\nNo more wasting time, let's gone and get it in, get it in\nAnd I won't stop, don't stop, 'til I make that leg drop\n\n[Verse 3: Big Boi]\nYeah, they wanna follow in my footsteps\nBut I'mma go something like the Boogie Man, never forget that\nYou musta fell down and bumped your cranium\nBeen moving crowds, rock halls and stadiums\nMaybe I'm one of the best you'll ever meet\nThe Greatest Show On Earth, B.I.G\nAnd I'mma make you remember me\nI stay colder than December, B\nMr. Freeze, only want to see her on her knees\nThroat pregnancies, are at a all time high, keep it sci-fi, wi-fi\nAlways connected to muchacha, watch out bwoy\nThe time flies by as the Cadillac glides\nIt's the Return of the Jedi, niggas know better\nAntwan and André together\nDungeon Family for the W, I-N\nLike Khaled, all we do is win, win\n\n[Hook: Sleepy Brown]\nHey, just touched down, been gone for awhile\nTryna find you, where are you now? I've been looking for you\nCome through, get you, riding out, we'll do\nSoon as I can find you, I've been looking for you\nHey, just touched down, been gone for awhile\nTryna find you, where are you now? I've been looking for you\nCome through, get you, riding out, we'll do\nSoon as I can find you, I've been looking for you\n\n[Verse 4: André 3000]\nI-I-I be on it, in and out it, in and out it\nIn and out it, in and out it, went about it\nLike I owned it, dog it\nGone it, dog and pony show\nSaid my name repeatedly, repeated me\nLike Tony Toni Toné, Tony, Tony\nI know, I know, I know I said two too many Tony's\nI go, I go, I go, I’m not usually a morning\nPerson, but certain skirts can makes me\nPull back the curtain and let the sun burst in\nShe searching for her Ken, Barbie\nHer skin makes my Berlin Wall fall down\nTo the ground, now touché, hardly\nA one night stand, number on nightstand\nShe ain’t gon’ never leave me hanging like an old white man\nBut she don’t understand that I’m a fan of Steely Dan\nAnd she like everything that’s on the radio and I demand she change it", "image": "https://images.genius.com/ce6391108f5034ad21b71de40801cdb7.560x560x1.jpg", "year": null, "title": "Lookin’ 4 Ya (Jedi Remix)", "album": null}]}