{"artist": "Half A Mill", "songs": [{"album": "Da Hustle Don’t Stop", "lyrics": "[outro: Half-A_Mill]\nYea, yea, uh huh\nUh huh, yea, uh, huh\nDedicated...to all the ladies out there\nHalf-A-Mill, how can I trust you?\nUh, yea, uh huh\n\n[Verse 1]\nWhen we first started out it was lust\nNow you talkin marriage and trust\nCarriage for us, baby carriage\nYour love nearly made me savage\nYou like it when I grab it\nAnd twist you backwards and let you have it\nSexual magic, you like it when you get ya ass whipped\nYou need a man to take over, see you in your Range Rover\nHoped off the 11th hundred, made you pull that thing over\nWent from what's your name to Champaign to hangover\nNow you want me for yourself so we became closer\nBlazin haze on the sofa, no more spendin days watchin Opera\nWe eatin Lobster at the Copa, monster hat wit the toaster\nPoppin Velvet, makin a toaster\nA new relationship wit that's Kosher\nPlan to make it last forever\nBut tell me can I trust ya?\nHow I know you ain't creepin wit another buster\nHow I know someone else ain't rubbin butter\nAll over my lover, can I trust you?\n\n**How could I trust you -- anythin you eva need it**\n\n[Chorus: Half-A-Mill]\nUh, uh huh, uh huh, yea, uh\nCan I trust you?, can I trust you?\nUh, uh huh, yea, uh, uh huh\nHow can I trust you?, how can I trust you?\n\n[Verse 2]\nSpinnin the five, call you up spend some time\nI'm like Ginuwine I got flowers and the wine\nConversate wit you for hours, stimulatin ya mind\nOn a rainy day I'll make it shine\nBring ring field wit mines\nEnough ice to make you blind\nBut that's still won't make you mine\nYou prolly like to play wit my mind\nMake me chase you around and you body like di-da-damn\nSo you know I had to bling you down\nWaitress bring around of that drink wit the crown\nYou prolly tired paintin in town\nMa let me put that mink down\nI roll enough to snake now\nYou poppin drinks that blue berry haze got ya eyes shank now\nWe at the steak house, came along way from take-outs\nPolice stake outs, lets take a vacation and break out\nLet's go to Africa where the Zebra's and Apes is out\nGo under -- a waterfalls so I can blaze you out\nBut can I trust you?\n\n**How could I trust you -- anythin you eva need it**\n\n[Chorus: Half-A-Mill]\nUh, uh huh, uh huh, yea, uh\nCan I trust you?, can I trust you?\nUh, uh huh, yea, uh, uh huh\nJames Brown, yea, uh huh\nCan I trust you? can I trust you?\n\n[Verse 3]\nSippin a glass of Reds, you tellin other cats is dead\nWant to get married, every since I hit you wit the Jagged Edge\nYou can throw that thing away wit the plastic head\nCause I'm packin a lead that got you grabbin the bed\nYou neva knew that your back spread so much\nIs like I got your soul touched\nHardened stiff still won't nut\n'Til you errupt like a Volcano, I feel you liver\nFeel you mama puttin you through physical drama\nYo the dick tellin your mama\nYour friends say I got you whipped\nTellin chicks its natural Phenomena\nIs like sumthin magical, how I attracted you\nThe conversatin captured you\nHave you sippin Carot-chews\nBlazin hazin black roots mixed wit absolute\nTree or life, come here ma let me grab ya fruit\nUnites are ripe, heres a lil ice for ya life\nImagine if you was my wife\nBut can I trust you for life?\n\n**How could I trust you -- anythin you eva need it**\n\n[Chorus: Half-A-Mill]\nUh, uh huh, uh huh, yea, uh\nCan I trust you?, can I trust you?\nUh, uh huh, yea, uh, uh huh\nJames Brown, yea, uh huh\nCan I trust you?\n\n[Outro]\nYea you talkin all this yaknawmean?\nWord, you talkin 'bout relationship\nAnd feelin and commitments yaknawmean?\nWord, I can like you, I can love you\nBut can I trust you?", "year": null, "image": "https://images.genius.com/cdace55ea46853fe392a282bca193979.600x600x1.jpg", "title": "Can I Trust You"}]}