{"songs": [{"image": "https://images.genius.com/a771fd3e611d5c86a13b17b05dbb15f9.500x500x1.jpg", "lyrics": "Dan doo\n\nThere was a good old man lived out west, Dan Doo, Dan Doo\nThere was a good old man lived out west\nTom Kling-klass Mc-Kling-gle\nHe had an old wife that was none of your best\nAnd it's harum, barum, compario\nHicky-you-ka-tack kleming-go, Tom Kling-klass Mc-Kling-gle\n\nThis good old man came in from his plow, Dan Doo, Dan Doo\nThis good old man came in from his plow\nTom Kling-klass Mc-Kling-gle\nSaid he, \"Old wife, is breakfast ready now?\"\nIt's harum, barum, compario\nHicky-you-ka-tack kleming-go, Tom Kling-klass Mc-Kling-gle\n\n\"There's some dry bread and meat in on the shelf,\" Dan Doo, Dan Doo\n\"There's some dry bread and meat in on the shelf,\"\n\"If you want more than that, you can git it yourself. \"\nThis good old man went down to the sheep-fold, Dan Doo, Dan Doo\nThis good old man went down to the sheep-fold\nHe caught a sheep and did him hold\n\nHe hung this sheep on a hickory pin, Dan Doo, Dan Doo\nHe hung this sheep on a hickory pin\nAnd away he jerked him out of his skin\n\nHe put this sheepskin on his old wife's back, Dan Doo, Dan Doo\nHe put this sheepskin on his old wife's back\nThe two little sticks, they went whickity whack\n\n\"I'll go tell my father and mother and all my kin,\" Dan Doo, Dan Doo\n\"I'll go tell my father and mother and all my kin,\"\n\"You've whaled me once, and you won't do it again.\"\n\n\"You can go and tell your father and mother and all your kin,\" Dan Doo, Dan\nDoo\n\"You can go and tell your father and mother and all your kin,\"\n\"But I've whaled you once and I'll do it again. \"\nThis good old man travelled fourteen miles in fifteen days, Dan Doo, Dan\nDoo\nThis good old man travelled fourteen miles in fifteen days\nAnd if you don't cut a lap getting out of the way fast\nYou can harum, barum, compario\nHicky-you-ka-tack kleming-go, Tom Kling-klass Mc-Kling-gle\n\nChild #277\nFrom Folk Songs out of Wisconsin, Peters\nCollected from Charles Dietz, Monroe, Wisconsin, 1946\n@marriage\nFilename[ danndoo\nPlay. Exe danndoo\nRg\n===Document boundary", "title": "Dindi", "year": null, "album": null}], "artist": "Unknown Artist"}