{"artist": "Prince Po", "songs": [{"album": "Animal Serum", "title": "Keep Reachin", "image": "https://images.genius.com/bcc0b72953588145b6c14022fc08642c.700x700x1.jpg", "lyrics": "[Verse 1]\nEmotions get involved\nWhen you're more loyal than most\nTryna get between your broad\nBut don't wanna spoil your host\nShit ain't holly sweet, but for you\nI'll sugarcoat it\nHope you get on your feet\nAnd your flee, them boogers bought it\nI don't like to judge dawgs\nAnd I don't do gossip\nI'm just into street love(?)\nA soul move a prophet\nThe music created to make\nPeople feel good\nNow reach beyond the stars\nWhen it's my turn to rock it\nMade the best out of the worst situations\nWait far from finish, but above all ungrateful\nY'all getting some stagnant, not some limitations\nTime to evolve, I'm sorry I had to shape you\n[?] my figure committed to the hustle\nThe dudes I move with give it a little more muscle\nWe taking a stride, y'all take it for granted\nNow baby lets take it and vibe\nStay around the planet\n\n[Hook]\nI keep reaching, they keep pulling\nIt's breaking me up inside\nY'all keep sleeping\nWhat I'm doing\nLiving dreams, how, that's why I\nI'd rather speak to myself right now\nCause ain't it never good when you're trying to help out\n\n[Verse 2]\nBroke bread with the folks until the loaf was gone\nSame good intention when i'm composing a song\nIn another dimension the haze dipping? the tension\nMy inspiration in recitals help you stay strong\nI do it for my heart cause Gods there\nFed a couple of cats, they probably wanting me dead\nStraight scheming when I was just trying to share\nBetter be careful cause karma's a motherfucker\nNever thought i'd see Brazil, London and Spain\nWalking across the bridge by Big Ben in the rain\nHumble cause i'm just a regular nigga from Queens\nWho got a lot of jewels but I don't rock a chain\nI'd rather grab my guns and help me chase your dreams\nNow to get at the ones who's in the struggle like you\nYou need some education to partake in some things\nThese visuals are colour blind that's why they shine through\n\n[Hook]\n\n[Verse 3]\nIt's sweeter when they sleeping\nI work hard play hard\nMaui on the weekend\nI few got it [?] so I had to dismiss them\nHate to see them drown and fall off at the deep end\nStill shining like sun all across the land\nThe autobot bionic boogie band be creeping\nSmoother than the waves that run up on the sand\nLaughing cause there's nothing else to do but keep reachin'\n\n[Outro]\nYeah, Yeah, my name is Greezy Junior. Greezy Junior!\nHey, hey hey young world, the world is young\nYou see Prince Po asked me to come through and drop some homegrown empire state\nNigga I'm trying to tell you something black maxwell smart heron bone\nThree finger ring with diamonds jewels on you motherfuckers\nMotherfuckers always, always talking about whats fucked up\nOr somebody who is fucking up or always trying to tell what is it\nOr what ain't happening\nFuck outta here!\nYou gotta speak on shit with meaning, put some shit in the air", "year": "2014-02-04"}]}