{"songs": [{"image": "https://images.genius.com/508b912f569b8bb0c6714a8272e0e931.400x397x1.jpg", "title": "One Way or Another", "album": "Gory Days", "year": null, "lyrics": "The Sexorcist\nCheck it you fuckin' bitches\nStinky twats\n\n[Necro]\nI don't kid man I fuck Nicole right in her pink hole\nThen a pickle light up a nickle\nNow honeys ready for the meaty stick pole\nMy cum-shot bombs on two hot blondes\nHolding some pom-poms, pork them like won-tons\nI fuck you where you make your doodie, start shaking bootie\nWhile rockin' thongs, spread your crevice\nGet prepared for the rubber prongs\nI know this bitch that'll suck your dick for three cracks\nAnd her clitoris lips be hanging down to her kneecaps\nYour cunge is lunch, I'll plunge into your vaginal sponge\nWhether hip-hop or grunge, I'll even munch on the buns of nuns\nIf honeys ass is god, I'mma shoot a massive wad\nWith the brutal precision, incision, in poodle position\nI'm taking these polariods of this blonde\nShe's drippin' upon, substitute my peter with a chiquita\nThen devour for three hours\nMy best believe it's washed down south\nOf a hot, wet drippin', cunt sqaushed against my mouth\nI'd like to give a 16 year old slut\nYoung buck a tongue fuck\nBut she might get knocked up\nAnd the cops'll wanna lock my cock up\n\nChorus x4\n\n[Necro]\nOne way or another\nI'm gonna fuck you\nI'm gonna fuck you fuck you fuck you fuck you\n\n[Necro]\nYo you slob bitch\nYour mouth is equilvelent to garbage\nSuck my cock like a good little girl and make my knob twitch\nIt's sodomy, eat my dick like collard greens\nYou need a job? Work your lips up and down my solid meat\nOpen your mouth, I got a visitor\nYou're wanking me off so damn fast your hand is a blur\nNow bob my chunk of godly hunk all over your fucking face\nI'm spitting globs of spunk\nGet on your dirty knees, bend over and bob\nTill your wet tongue spreads my cock juice all over my knob\nSuck my dick with devotion\nYou got a no nonsense deep throat motion\nOur bodies creating friction like no lotion\nSubstitute my dick with a dynamite stick and fuck your slit\nPeep the ovum explosion\nNecro is a demented mack\nWhat's more intense than crack\nYour boobs warm against my back\nYou got no idea how much pleasure I can take\nSo let your fingers grasp around my shaft like a snake\nNow wank me\nAfter you suck it you could thank me\nFrankly I want hanky-panky if you're skanky\n\nChorus x4\n\nFuck you!\nI'll fuckin' kidnap you!\nYou bitch!\nI'll fuckin' put a fuckin' needle in your arm\nYou're fuckin dead\nYou're dead"}], "artist": "Necro"}