{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/ce70d8117c83ff4322bbd7d5d9b122da.468x468x1.jpg", "title": "Real Friends", "year": "2016-03-09", "album": null, "lyrics": "[Only verse: Kirko Bangz]\nI gave fuck about a real friend, man i rather pull in a l benz\nYeaa gave a fuck i gave a fuck about a real friend\nSometimes feel betrayed by my own kid\nI done came up, but how many love us, how many love us\nHow many love us man im on tour going through too many\nToo many rubbers, too many rubbers, too many rubbers\nI wanna help my fam but i got too many brothers, too many sisters, too many cousins\nAnd i hate how they all fake fuck with eachotha, and fussin eachother, and cussin eachother\nAnd man yesterday CPS came an picked my cousins up but i wanna let my big cousin know no matter\nHow much she fuck up ill still fuck with ha, too many problems in my life\nIm going crazy tryna play it strong, tryna cover it up and niggas i thought\nWere my niggas pullin stunts like a bitch that’s the come up HUH?\nI guess you thought that was your comeback like if you cam counter sorta never fumbled HUH?\nAnd niggas spittin at the kid and i guess you feelin like that nigga gon bubble HUH? hahaa, guess im supposed to be in trouble huh?\nHow many times it\nGonna take for niggas to realize everytime you push me on my comeback, I'ma come back harder\nHow many times is it\nGonna make me realize that every heart I break is gonna come back on my daughter, real friends\nSupposed to be there for you all the hard times\nThey ain’t supposed to talk about you, real friends\nBe having a hard time\nWith all the girls wanna talk about you, real friends be hating getting\nTheir\nFirst chance to shine on you promise that their gonna take advantage \nReal friends\nLive in ya house drive yo car and tell you how they got the fakest family\nReal friends i call yo mama , mama go behind ur back and do some shit you\nCan’t imagine real friends supposed to be there for yo nigga huh?\nKeep it real man\nI miss all my niggas dawg just sitting back thinking of how it could’ve\nBeen\nI guess if I would’ve stayed the little man i guess if I would of never got\nRicher man, then id still have real friends, instead I pulled up in that L'z bens\nAnd keep fucking niggas girlfriends, i guess I’m supposed to do that to the world ND?\nBut I ain't tryna be that Randy Earliz I pray to god for my POPS he find someone to marry\nI pray to god my POPS to find someone to cherish I feel like human rights since 1999 when he\nGot that divorce for that one he cherished, I remember that shit like yesterday\nWe all cried thought they was killin eachother but shit we all died, my step momma doin fine\nShe got a real man my pops he lost a wife and a real friend , i don’t think he ever gonna find that shit\nAgain it’s hard for a middle classed 50 year old man i pray that i don’t into that shit aiight?\nCuz I don’t wanna be lonely everynight The strongest man in the world ain’t tryna fight they fight..\nI’m tryna find a perfect girl and create another life and that’s the shit I think after the play of nights\nAfter I fucked around with a niggas wife my real friend is out there in San Diego she tied down to all of my games\nThough I miss her er day though she probably pop a pregnant anyday though really i got nothing else to say doe\n\n[Outro: Ken Randle]\nMama used to tell me treat your friends right broke or wealthy\nTreat that girl like ya daddy didn’t treat me, nothing ever like real a friend, like a real friend.. real friend, yeaaa. real friends.."}]}