{"songs": [{"image": "https://images.genius.com/51ffe6afd99678e61b52396c4cf6818b.500x500x1.jpg", "year": null, "title": "Who is Y’all Niggas", "album": "The Unforgiven Vol. 1", "lyrics": "Yeah X-Raided yeah\nYeah X-Raided yeah\nYeah X-Raided yeah\nGoin' down ugh\nNiggas be woofin' that shit\nNigga who the fuck is you nigga?\nShow me y'all credentials before you speak on X-Raided\n\nThey say when the dogs away the cats'll play\nNow X-Raided's back up in this bitch leavin' niggas DOA\nSpittin' fire\nWhy you done woke up the dragon?\nThought the loc was through so niggas startin' braggin'\nAbout who can fuck with X now really\nWho put Sac on the map was it you don't be silly\nWill he make the beats up? Nigga what?\nAnd 24th Street rip\nBut even blood niggas got dubs on my shit\nAnd thug niggas on the south side\nSlam X-Raided loc when they out ridin'\nI'm the king of this Sac-Town scene and you peasant\nI ran shit in the past, will in the future and the present\nYo Meek attempt to diss me was futile boy\nI knew you back when you was broke wearin' Bugle Boys\nNow you got tattoos ooh! You big killa\nI won't hesitate to slap you, you still a bitch nigga\nWhich nigga wanna war with the hardcore\nLoad up you .44 playa what cha waitin' for\nLay a motha fucka face down\nWith bullet holes in his clothes\nDecapitated and naked from the waist down\n\nChorus:\nWho is y'all new booty ass niggas tryin' diss this nigga\nI dismiss niggas\nEndless blue sportin trigga tottin menace\nNiggas that'll disfigure niggas on my shit list (2X)\n\nNig-niggas on my shit list\nNiggas on my shit list\nNig-niggas on my shit list\nNiggas on my shit list\n\nI know y'all busta remember me\nPumpin' slugs in your dome lobotomizin' your memory\nIt's him or me when the wars on\nMy new tapes out now the south areas' a war zone\nI send letters from the pen to my true locs\nIt's time to ride my nigga go out and shoot folks\nIncarceration ain't workin'\nMy body's locked but my souls on the streets lurkin'\nPerkin' niggas like Folgers, motivatin' soldiers\nTo make you set look like yo set got wrecked with bulldozers\nHow many marks can I take in one day?\nI'mma need a little help don't trip it's on the way, hey!\nDisplay your corpse like a mannequin in the window\nWhy damagin'\nYou got no wind and it's plain and simple\nMake 'em cripple\nGet savage when I aim my pistol\nFlame a missile through your temple till your brain gristles\nDead issues\n\nChorus\n\nWho is y'all, who is y'all\nYeah\nI'm through with y'all, through with y'all\nWhat\nWho is y'all, who is y'all\nYeah\nI'm through with y'all, through with y'all (2X)\n\nNigga you can't fuck with X-Raided and you hated\nI heard that little bitch ass shit that you stated, nigga\nYou can't fuck with X-Raided and you hated\nI'm the motha fuckin' bomb bout to detonate it\nI consume fake rappin' mark niggas like Brut\nChew 'em up spit 'em out piss on 'em when I'm through\nYou used to be a crip now you claim damu\nYou dog niggas didn't know but nigga I do\nI knew you's a hook like a U-turn\nPut your ass in a urn cremated nigga burned\nHoward Stern couldn't clown a nigga worse than Raided\nLet loose a few verses had you cursed and faded\nLike Madusa on the loop I'm turnin' true to the stone\nSpittin' brimstone burnin' motha fuckas to bone\nIf it's on I'mma show you how to end this shit\nChrome .50 caliber \"Des Eags\" with extended clips bitch\n\nChorus"}], "artist": "X-Raided"}