{"artist": "Inspectah Deck", "songs": [{"title": "Can’t Stay Away", "lyrics": "[Intro: Ice Cube sample & Inspectah Deck]\nEarly in the game, when I was still young, still not really sure how far it was gonna take me. I made a vow to myself that I wouldn’t let the game change me. Imma just be myself, let the chips fall where they may. But at the end of the day I’ma still be happy with who I am. Whether I blow up and fall off or whatever. I just vowed that I was gonna be happy with who I am. No matter what’s my status in the game…\nYeah, your highness\nIt’s in my blood\nIn my veins\nIt keeps calling, and calling\nWord\n\n[Verse 1: Inspectah Deck]\nI fiend to hear the sound through the woofer\nI love hip hop, more than Tanzanite and Brown Sugar\nFrom Mr. Magic’s Rap Attack, Hank Love and DNA\nTo Awesome 2, Kid Capri, Kay Slay\nChuck Chillout, Jesse Joyce, Jazzy Jeff\nAnd cool DJ Red Alert was going years\nI couldn’t wait to play my tape and make the block shake\nLet the tape rock till the tape pop\nGraffiti on my loose suit do this in my soul\nSince Pete Rock and Marley Marl was in control\nUsed to mosey uptown to get the raw\nI need that Ron G, S&S, Rated R\nSystem or Green Lantern, the Funkmaster Flex bomb\nTony Touch and Doo Wop, grew with Desert Storm\nThat real shit, pump through my veins\nNo, I can’t stay away so I’m pumpin’ ‘til the grave\n\n[Chorus: samples]\n“It ain’t nothing like Hip-Hop music”\n“Exorcist, Hip-Hop possess me”\n“We bless mics,” “Don’t it sound amazing”\n“Never thought that Hip-Hop would take it this far”\n“It ain’t nothing like Hip-Hop music”\n“Rap is somethin’ you do, Hip-Hop is somethin’ you live”\n“Check my resume,” “My poetry’s deep”\n“Most valuable poet on the M-I-C”\n\n[Verse 2: Inspectah Deck]\nI got my b-boy stance from it\nSkip school, poppin', lockin' to the Mantronik\nJust-Ice made me wonder who Latoya is\nAnd I learned that nobody beats the biz\nWe was kids just listenin’ to the music loud\nSo believe I was moved, when Rakim moved the crowd\nNow as a rapper I remember moving till\nBecky Jack the rapper Freaknic and how can I be down?\nJust a young MC tryna bust a move\nI was on Beach Street break into a crust room\nDo it for dough, do it ‘cause I love it\nSince Hurricane G, told Red kicked that other shit\nI must admit without hip-hop I’d disappear\nIt’s like my heart beat’s one with the kick and snare\nThat real shit, pump my veins\nNo, I can’t stay away so I’m pumpin’ ‘til the grave\n\n[Chorus: samples]\n“It ain’t nothing like Hip-Hop music”\n“Exorcist, Hip-Hop possess me”\n“We bless mics,” “Don’t it sound amazing”\n“Never thought that Hip-Hop would take it this far”\n“It ain’t nothing like Hip-Hop music”\n“Rap is somethin’ you do, Hip-Hop is somethin’ you live”\n“Check my resume,” “My poetry’s deep”\n“Most valuable poet on the M-I-C”", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}