{"artist": "Ice-T", "songs": [{"title": "O.G. Original Gangster", "lyrics": "[Verse 1]\nTen years ago I used to listen to rappers flow\nTalkin' bout the way they rocked the mic at the disco\nI liked how that shit was goin' down\nDreamt about ripping the mic with my own sound\nSo I tried to write rhymes something like them\nMy boys said, \"That ain't you, Ice! That shit sounds like them.\"\nSo I sat back, thought up a new track\nDidn't fantasize, kicked the pure facts\nMotherfuckers got scared cause they was unprepared\nWho would tell it how it really was? Who dared?\nA motherfucker from the West Coast, L.A\nSouth Central, fool, where the Crips and the Bloods play\nWhen I wrote about parties, it didn't fit\n\"6 N' the Mornin,\" that was the real shit\n\n[Hook]\nO.G. Original Gangster\n\n[Verse 2]\nWhen I wrote about parties, someone always died\nWhen I tried to write happy, yo, I knew I lied\n'Cause, I lived a life of crime Why play ya blind?\nA simple look and anyone with two cents would know I'm\nA hardcore player from the streets\nRapping bout hardcore topics over hardcore drum beats\nA little different than the average though\nJet you through the fast lane, drop ya on death row\nCause anybody who's been there knows that\nLife ain't so lovely on the blood-soaked fast track\nThat invincible shit don't work\nThrow ya in a joint, you'll be coming out feet first\nSo I blast the mic with my style\nSometimes I'm ill and other times buckwild\nBut the science is always there\nI'd be a true sucker if I acted like I didn't care\nI rap for brothers just like myself\nDazed by the game in a quest for extreme wealth\nBut I kick it to you hard and real\nOne wrong move, and your cap's peeled\nI ain't no super hero, I ain't no Marvel comic\nBut when it comes to game I'm atomic\nAt dropping it straight, point blank and untwisted\nNo imagination needed, cause I lived it\nThis ain't no fucking joke, this shit is real to me\nI'm Ice-T, O.G\n\n[Hook}\n\n[Verse 3]\nTwo weeks ago I was out at the disco\nTwo brothers stepped up to me and said, \"Hey yo, Ice\nWe don't think you're down. What set ya claiming?\"\nE drew the Glock, yo my set's aiming!\nDumb motherfucker, try to roll on me, please!\nI'm protected by a thousand emcees\nAnd hoodlums and hustlers and bangers with jheri curls\nWe won't even count the girls\nCause they got my back and I got theirs too\nFight for the streets when I'm on Oprah or Donahue\nThey try to sweat a nigga but they just didn't figure\nThat my wit's as quick as a hair trigger\n\"He's not your everyday-type prankster.\"\nI'm Ice-T, the original gangster\n\n[Hook]\n\n[Verse 4]\nSo step to me if you think that you're ready to\nGot on your bullet proof? Well mine's going right thru\nThis ain't no game to me, it's hollow fame to me\nWithout respect from streets, so I don't claim be\nThe hardest motherfucker on earth\nCatch me slipping, I can't even get worked\nBut I don't slip that often, there's a coffin\nWaiting for the brother who comes off soft when\nThe real fucking shit goes down, take a look around\nAll them pussies can be found\nThey talk a mean fight but fight like hoes\nI'm from South Central, fool, where everything goes\nSnatch you out your car so fast you'll get whiplash\nNumbers on your rooftop for when the copters pass\nGangbangers don't carry no switchblades\nEvery kid's got a Tec 9 or a hand grenade\nThirty-seven killed last week in a crack war\nHostages tied up and shot in the liquor store\nNobody gives a fuck\n\"The children have to go to school!\" Well, moms, good luck!\nCause the shit's fucked up bad I use my pad and pen\nAnd my lyrics break out mad\nI try to write about fun and the good times\nBut the pen yanks away and explodes and destroys the rhyme\nMaybe it's just cause of where I'm from\nL.A. (*bang!*) that was a shotgun!\n\n[Hook]", "image": "https://images.genius.com/45bb8d8e0573aa4b17d0a8d970332fdc.529x532x1.jpg", "album": "O.G. Original Gangster", "year": "1991-05-14"}]}