{"songs": [{"image": "https://images.genius.com/fe7b2d9af535866969cc7963ac422da8.900x900x1.jpg", "lyrics": "Beer! Makes us fired up!\nSo come on, drink it all night long!\nSlam it girl! Slam it girl! Slam it girl! Slam it girl!\nSlam it girl! Where's the marching band at?\nPound that beer, pound that beer\nDon't drunk dial, no, pound that beer\nPound that beer, pound that beer\nDon't drunk dial, no, pound that beer!\n\nBubble on back to the bar stool, I will\nMy pill, might dissolve on my tongue\nFuck that Jagermeister bullshit\nThat DUI hurt a little bit now I'm all done\nNo, can I go to the liquor sto' and buy that poison\nHey pretty thing, right there, yeah you, I hate your boyfriend!\nI don't give a fuck if he a vigilante(?) anywhere\nKill him on his incubator rhythm like this\nPop that, bottle top, talk back, that about says it all\nLet him meet my fist\nGotta a beer and a\nOur kisses taste like alcohol you know that means its love\nSwitch it\nHere's another reason that I'm gonna take you home\nCause I can't be a fiesty little freak when I'm alone\nOh my goodness who the hell is blowing up my phone?\nThis better be important, don't you understand I'm drinkin beer?\nCan't you feel the spiders, they're buried deep inside us\nThe politicians, officers and judges are vampires\nI never once suggested that we tie each other down\nI think we should buy another round\n\nBeer! Makes us fired up!\nSo come on, drink it all night long!\nSlam it girl! Slam it girl! Slam it girl! Slam it girl!\nSlam it girl! Where's the marching band at?\nPound that beer, pound that beer\nDon't drunk dial, no, pound that beer\nPound that beer, pound that beer\nDon't drunk dial, no, pound that beer!\n\nHow can I describe to you this?\nSee that lady over there got that poisonous kiss\nHere another Cinnamint the element is in 'em\nIs she lookin like a demon in a chemical abyss\nBut no, can I go to the liquor sto' and buy that poison?\nHey black angel, hey mama sue, I hate your boyfriend!\nI can't lust, your battle won't fuck the measure up\nTho domestic I love the sex with no sums of sensual drugs\nOh no, I got a thirty pack tho\nThen again if the black ball melts\nTook the original to get us high\nGotta get me inside\nGotta take that knife\nGotta scrape that pipe with your lit up eyes\nSwitch it!\nHere's another reason my insanity has grown\nCause drama is so childish and fucking overblown\nOh my goodness who the hell is blowing up my phone?\nThis better be important don't you understand I'm drinking beer?\nCan't you feel the spiders, they're buried deep inside us\nThe politicians, officers and judges are vampires\nI never once suggested that we tie each other down\nI think we should buy another round\n\nBeer! Makes us fired up!\nSo come on, drink it all night long!\nSlam it girl! Slam it girl! Slam it girl! Slam it girl!\nSlam it girl! Where's the marching band at?\nPound that beer, pound that beer\nDon't drunk dial, no, pound that beer\nPound that be-e-e-er, pound that beer\nDon't drunk dial, no, pound that beer!\n\nYes sir, this is one of those ignorant anthems\nBe an intellectual if you want\nBut we got the nectar of the gods here\nBecause we're drinkin what?\nBeer! Makes us fired up!\nSo come on, drink it all night long!\nBeer! Makes us fired up!\nSo come on, drink it all night long!", "year": null, "album": "11:11", "title": "Pound That Beer"}], "artist": "Mac Lethal"}