{"artist": "Iamsu!", "songs": [{"title": "All On Me", "lyrics": "[Intro]Trauma Tone\n\n[Verse 1: Kool John]\nWalk in this bitch, turn on, [got all eyes on me], Its all on me now, yeah, hey\nSoon as I walk in this bitch, heads turn, I got all eyes on me\nIt's too many bitches, in this motherfucker here, and I'm taking some home with me. (With me)\nMy stepdaddy died, now I gotta man up, nigga now cause its all on me\nNigga came from the bottom, and I'm headed to the top and the kush, yeah its all on me\n\n[Verse 2: IamSu!]\nTell me what you want, what you really really want\nFrom the rich, I'm the one, I'm the one to get it done\nOn my iPhone tryina get a play to get it [fex]\nI get top off top ain't no waiting for that hash\nHeartbreak, Shmoplife, team very very strong\nAnd I pray that my dreads hang very very long\nI be speaking from the heart when I say it in a song\nHow you claim you a boss when your momma pay your phone\nI'mma take care of my family, I'mma put the team on\nOn the beach out in Miami all I see is Hoes and Thongs\nSince my grandaddy died I'm the man of the house\nI was 17 years old my momma tried to kick me out\n\n[Hook]\nSoon as I walk in this bitch, heads turn, I got all eyes on me\nIt's too many bitches, in this motherfucker here, and I'm taking some home with me. (With me)\nMy stepdaddy died, now I gotta man up, nigga now cause its all on me\nNigga came from the bottom, and I'm headed to the top and the kush, yeah its all on me\n\n[Verse 3: IamSu!]\nI'm out here tryina setting an example\nThis niggers swagas snacking taking samples\nWalking in and trying to see what we about\nThe topic of the conversation ain't gonna leave you out\nRetro Jordans, you ain't buying these at foot locker\nI feel like rocky in a meat locker\nThese niggas hating on the low and I really hope they keep talking\nMouth full of gold, I can't ever do no cheap talkin\nIts bigger bidness, see the bigger picture\nYou want [?], tryina be official\nYou gon wait till you dead, wait for me to diss you\nI'm fully focused on my bread, I really need my issue\n\n[Hook]\nSoon as I walk in this bitch, heads turn, I got all eyes on me\nIt's too many bitches, in this motherfucker here, and I'm taking some home with me. (With me)\nMy stepdaddy died, now I gotta man up, nigga now cause its all on me\nNigga came from the bottom, and I'm headed to the top and the kush, yeah its all on me", "image": "https://images.genius.com/10007df416e46af8535d07a9558715cc.500x500x1.jpg", "album": "Eyes On Me", "year": null}]}