{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/2f8c2a97598a2842b2c7bd1bac986a3f.500x500x1.jpg", "year": "2011-05-13", "album": "Friday The 13th: Kill My Nightmare ", "lyrics": "[Sample: Nina Simone]\nYou're just plain rotten\nYou're too damn lazy\nYou thinkin' he's crazy\nWhere am I goin'?\nWhat am I doin'?\nI don't know, I don't know!\n\n[Intro: Yelawolf]\nYe, so I got this personal mission\nI'mma take this Crimson Tide banner\nFrom the great state of Alabama that is\nAnd I'mma take it to all 50 States\nAll 50 States in one song\nJust so I can hear 'em say:\n\n[Hook]\nEverybody knows about Alabama gotdamn!\n\n[Verse 1: Yelawolf]\nI started my journey down in Alabama\nThen my mama threw me in a swamp when I was five out in Louisiana\nShe told me to take my state of ware with me\nThen we moved to Oklahoma with her boyfriend from Mississippi\nHer boyfriend was in the country music industry\nSo we hopped on a tour bus from Texas and went to Tennessee\nMet a dude from New York at a rest stop in Arkansas he said, (Goddamn!)\n\"You really do say howdy ya'll!\" (Howdy ya'll)\nI'm a nomad, yeah, kinda sorta\nI got stranded in Georgia\nBut I was headed to Florida\nI hitchhiked the rest of the way down to Palm Beach\nAnd I one-nighted a girl with black hair from Hawaii\nI don't know how I landed in Indiana\nBut I got this Crimson Tide banner\nAnd I ain't gonna stop until\n\n[Hook]\nEverybody knows about Alabama gotdamn!\n\nThat's 12 states down!\n\n[Hook]\nYeah, put the Jack in the backpack\nAnd I won't stop 'til I hear 'em sayin' that\nEverybody knows about Alabama gotdamn!\nLet's go!\nHo! Ho! Ho! Ho!\nEverybody knows about Alabama gotdamn!\n\n[Verse 2: Yelawolf]\nWell I stopped in Michigan with Eminem and popped some No-Doze\nI took a plane to Maine and ran down the East Coast like\nConnecticut, Rhode Island, Massachusetts, New Hampshire, Vermont, now down to Jersey\nPennsylvania, Maryland, to Virginia, the Carolinas; back to the dirty\nI bucked to Ohio\nAnd swam through Kentucky\nGrabbed a bottle of Jim Beam\nGot drunk and was feeling lucky\nMet a girl who met a boy from Illinois who just dropped him\nBecause he moved to Wisconsin\nWell, I took her over to Minnesota\nI tip-toed out of the room with her purse and now, Iowa!\nI hurried to Missouri, from there I went to Kansas\nRode a twister to Nebraska, drove the Dakotas with Candice\nStopped in Montana to refill my bottle\nI went roamin' in Wyoming and snowboarded through Colorado yellin'\n\n[Hook]\nEverybody knows about Alabama gotdamn!\n\n28 states down, I'm on a roll!\n\n[Hook]\nYeah, put the Jack in the backpack\nAnd I won't stop 'til I hear 'em sayin' that\nEverybody knows about Alabama gotdamn!\nLet's go!\nHo! Ho! Ho! Ho!\nEverybody knows about Alabama gotdamn!\n\nMoving on!\n\n[Verse 3: Yelawolf]\nI hit the Texaco in New Mexico\nHopped in the back of a truck that was carryin' vegetables\nHe took me to Arizona, to a trading post\nI was headed for Utah so he offered me a sack of potatoes\nI told him thank you for the ride up the road but I'm fine though\nThere's plenty of those up in Idaho\nBut Arizona's got some beautiful women though like (Goddamn!)\nShe's fine but I gotta go!\n30 pack, now I'm Oregon\nI hit a couple of divin' boys when I stumbled into Washington\nAnd I still got Alabama with me\nMet an Eskimo from Alaska, bought him a beer and told him \"keep it Dixie!\"\nLost my money in Nevada, security said \"I warned ya,\"\nTook my car so I had to skateboard to California, now\n\n[Hook]\nEverybody knows about Alabama got damn!\n\nThat's 50 states 'Bama!\n\n[Hook]\nYeah, put the Jack in the backpack\nAnd I won't stop 'til I hear 'em sayin' that\nEverybody knows about Alabama gotdamn!\nLet's go!\nHo! Ho! Ho! Ho!\nEverybody knows about Alabama\nEverybody knows about Alabama\nEverybody knows about Alabama gotdamn!", "title": "Alabama Gotdamn"}]}