{"songs": [{"image": "https://images.genius.com/42a6aa99dab64b9d94f46c6d8fda1c32.714x709x1.jpg", "year": "2001-06-08", "lyrics": "[Akrobatik]\nYo, one one time, I was, I was talkin to my man\nMy man Beatbox Prince right?\nHe was explain this situ-this situation that he was in\nAnd he was like, \"Yo Ak, if I don't\nIf I don't handle this situation right here, I lose.\"\nAnd I thought about that\nCause yo, I ain't tryin to lose, check this out\n\nAiyyo 5 A.M., still wide awake\nCan't sleep a wink I'm contemplatin moves to make\nDaily situations got me in a effed up state\nI need to overcome the stress and hold my own weight\nI wonder how many of y'all truly know the pain\nOf a ghetto superstar who can't afford to ride the train\nFifty million things is goin on inside my brain\nBut yet and still heads say I'm gassed if I slip and forget they name\nWorkin forty hours puttin up with bull{shit}\nWhen my label stressin me to stay consistant with lyrics\nIt's pressure but realistically this here could solve my problems\nAnd enhance my wins column, but one thing\nIf my lyrics ain't tight, I lose\nDon't blaze the set all night, I lose\nCan't maintain and pay dues, I lose\nAnd yo I ain't tryin to lose (uh-uh, never catchin L's)\nFame, glamour and glitz\nIt's time to start savin, and buildin on some grown man {shit}\nYo, I need to see \"The Light\" like Pharoahe and Common\nAnd get off this diet of greasy-{ass} pizza and ramen\nSo I keep my music tight, and stay on the playlist\nNot because I'm gleamin simply cause I'm bein creative\nAnd I can't front, it's easy to make a joint from the heart\nWhen every single {fuckin} thing around you's fallin apart\nSo as the record spins, my trance begins\nI grab the bull by the horns and the shark by the fins\nWhen Kris, Rakim, and Chuck was speakin I was listenin\nSo let this rebel's \"Lyrics of Fury\" enter your skin\n\n[Hook]\nIf the lyrics ain't tight, I lose\nDon't blaze the set all night, I lose\nCan't maintain and pay dues, I lose\nAnd yo I ain't tryin to lose\nI refuse to take a \"L\"..\nI can't take no \"L\"..\nDon't need to take a \"L\"..\nYo Akro refuse to take a \"L\"..\n\n(yo yo, no I ain't tryin to lose)\n\n[Akrobatik]\nReachin daybreak, you never know how long that may take\nBut I know it will take longer with too many mistakes\nEarth be on my back like don't depend on rap\nSon it ain't guaranteed so watch how much you spend on that\nAnd I'm bright yo, I wanna go to school, and back that up\nBut I owe my school grands and yo they don't give a {fuck}\nSo now it's time for go for delf I'm hittin the road\nAnd stackin papers makin the name Akrobatik explode\nSo, don't be upset when I come to your town\nAnd tear the walls down with sound cause we all gon' get down\nI'm comin out the blocks to win (win win)\nAnd drop gems that's refreshin like oxygen (gen)\nSo any obstacle or impediment\nI treat it as a test to just how strong I represent self\nI won't chase wealth but make moves that lead to it\nI ain't tryin to reminisce on how I blew it, yo\n\n[Hook]\nAnd if the lyrics ain't tight, I lose\nDon't blaze the set all night, I lose\nCan't maintain and pay dues, I lose\nAnd yo I ain't tryin to lose\nI refuse to take a \"L\"..\nDon't need to take a \"L\"..\nYo I can't take no \"L\"..\nYo yo, and I ain't tryin to lose \"L\"..\n\n{*cut and scratched: \"cause I'm in it to win\"*}\n\n[Dialogue from \"The Devil's Advocate\": Al Pacino, Keanu Reeves]\n\n\"What did I say to you? WHAT WERE MY WORDS TO YOU?\nMaybe it was your time to lose. You didn't think so.\" -] Al\n\n\"Lose?! I DON'T LOSE!! I'LL WIN! I'LL WIN!\nTHAT'S MY JOB, THAT'S WHAT I DO!!\" -] K.R", "title": "No Losses", "album": "U Got It / Don’t Fear / No Losses"}], "artist": "Akrobatik"}