{"artist": "Anderson .Paak", "songs": [{"title": "Cheers", "album": "Oxnard", "year": "2018-11-16", "image": "https://images.genius.com/f86cd94b8dc54301943533fa84ca4350.1000x1000x1.jpg", "lyrics": "[Intro: Anderson .Paak]\nYeah, uh huh\nYeah\n\n[Verse 1: Anderson .Paak]\nI'm workin' on a world premiere\nAnd I could see the world from here\nThey ask me where I'm going from here\nShit, anywhere long as the runway is clear\nShit, music business movin' too fast for me (God damn)\nWishin' I still had Mac wit' me (Yes Lord!)\nHow do you tell a nigga slow it down when you livin' just as fast as 'em?\nI couldn't understand when I seen 'em stretched out cold on the pavement\nNiggas catch T-K-O's on occasion\nWishin' I could save 'em, what was I to say?\nI was doin' dates, dippin' in and out of state\nWe was goin' in to get away\nSick of feelin' so outta place\nWishin' I could save ya, what was I to say?\nWishin' I could save ya, but now it's too late\nNow, is this really what I wanted?\nIs it really worth the pain?\nNow am I really an asshole? Fuck what you say\nDon't do me no favors, let's get back to basics\nWe live for today, bitch, fuck up out my way, bitch\nI'm losin' all my aces, I'm runnin' outta patience\nGot some pretty faces knowin' what my name is\nUp in high places, I got some new neighbors\nThey don't really say shit but when they see the spaceship\nThey just think I rap or some form of entertainment\nBut they don't know I'm black, young, gifted and amazin'\n\n[Chorus: Anderson .Paak]\nYou know I had to close my eyes, yeah\nAnd if I have to free my mind\nI may not have the lane, movin' all along\nKnowin' that I can't do it on my own\nAnd if I got the pain feelin' comin' out\nHave to run away, think I'm goin' home\n\n[Verse 2: Anderson .Paak]\nYeah, you know I'm workin' on a world premiere\nAnd I could see the world from here\nI know you somewhere in the atmosphere\nI know someday I'll meet you halfway there (Cheers)\nThey say there's nothin' you can do about it\nCan't say that I'm new to sorrow\nWishin' I could take your problems\nTrade 'em for a little more time wit'chu\nCarry you out the bottom, the weight of the world, I got it\nSprouted wit'chu on my shoulder, the greatest honor to know ya\nI'd gotta be honest wit'cha, I hate you ain't in the picture\nI hate all them fake niggas claimin' like they gon' really miss ya\nI know there's no one to blame and maybe the point that I'm missin'\nBut I needed a minute, just give me a minute\n\n[Chorus: Anderson .Paak]\nYou know I had to close my eyes, yeah\nAnd if I have to free my mind\nI may not have the lane, movin' all along\nKnowin' that I can't do it on my own\nAnd if I got the pain feelin' comin' out\nHave to run away, think I'm goin' home\n\n[Break: Anderson .Paak]\nOh, say it ain't so!\nTears keep fallin' down my eyes\nDamn it, I miss you, I should be with you\nCan't turn back the hands of time but I should be with you\nI miss my friend\nDamn it, I miss you\nCannot bring you back\n\n[Verse 3: Q-Tip]\nThese pictures I'm seein' are fuckin' me up\nAnd I don't know what to do but reminisce and face the pain\nBack in the day before you were a dog and you were just pup\nBangin' beats and bringin' bitches back to the tour bus\nExcuse me, y'all, I know this .Paak shit, I just need a second\nIt's Q-Tip in this bitch and I'm just in here reflectin'\nHead on collisions with memories in the intersection\nLookin' in my rearview, wishin' I could be near you\nThe freeways of my mind are crowded with traffic\nThe good times that we had and them bad habits\nLook at me now, look around, last man standin'\nGrown man cryin' like a child tryna understand it\nSo sick of sendin' flowers to all of my brother's mommas\nDon't know what's harder, fightin' trauma or keepin' a promise\nA true confession breath is a blessin', without a question\nBut niggas don't get the message until they get disconnected\nMy story ain't over, I'm still turnin' pages\nBut the picture I painted with you in it has faded\nMy queen, my dreams and even my wages\nI know what it means to lose everything when you made it\nRags to the riches and back to the rags is a muh'fucka\nThe consequence of puttin' all your chips in one bucket\nTo be honest, I feel like gettin' right back to these commas\nYou mother fuckers keep the drama\n\n[Pre-Chorus: Anderson .Paak]\nI'm workin' on a world premiere\nAnd I could see the world from here\nI know there must be somethin' after here\nI know some day I'll meet ya halfway there in the atmosphere\nCheers\n\n[Chorus: Anderson .Paak]\nFree my mind\nYou know I had to close my eyes\nClose my eyes\nYou know I have to free my mind\nOooooh\nYou know I had to close my eyes\nYou know it's time for me...\nYou know I have to free my mind\n\n[Outro]\nFree my...\nFree\nFree\nFree my...\n...My mind\nMy mind\nMy Mind"}]}