{"artist": "Vado", "songs": [{"title": "Straight For The Summer", "year": null, "lyrics": "[Hook x2: Kirko Bangz]\nStraight for the summer\nStraight for the summer\nIn shape for the summer\nShe gon' be straight for the summer in shape for the summer\nStraight for the summer\nStraight for the summer\nAss pokin' out, stomach pokin' in\nJust got her new membership at the gym\nGoin hard all winter just so she can be\n\n[Verse 1: Vado]\nMa what's the word tho? its me spiff, Kirko\nTwo straps showing no Urkel\nGrape fives on his black purple\nKeep a nice number eight two circles\nShe in my vein like an I.V\nIn that new thing color high-C\nThats my boo thang nigga try me\nLove to show her shoe game on the IG\nI can't wait for the summer\nShit lookin' great for the summer\nA dyck man lotta cake in the summer\nAn iron man audi R8 in the summer\nNaw coke I got a live one\nAlways turnt up a do or die one\nAny bird that I have she a fly one\nLong fur let it drag on the garson\n\n[Hook x2]\n\n[Verse 2: Fabolous]\nShorty so cold she get hate from the summer\nTight little dress look great for the summer\nLookin' ass niggas couldn't wait for the summer\nLike damn girl you gained a little weight for the summer\nNew bitches at the house renovate for the summer\nAll want to stay can't hate on a slumber\nParty, shawty, shape like a number\nEight, 458 for the summer\nGet a nigga bitch hooked like bait for the summer\nShe ain't coming out hibernate for the summer\nCan't find they everything coming out neither\nNigga no release date for the summer\nThirsty ass niggas I ain't got nothing for ya'll\nI'mma let your ass dehydrate for the summer\nI fuck with my niggas gettin' paper like a printer\nStanding tall like centers had to grind all winter to be\n\n[Hook x2]\n\n[Bridge: Vado]\nAh, thats how you do that there\nDeserve to make head turns like who that there?\nVIP whole team, my crew back there?\nWe the Best and you knew that there\n\n[Hook x2]", "album": "Slime Flu 4", "image": "https://images.genius.com/717b0a05045a780f06b72a9f68eadfe0.500x500x1.jpg"}]}