{"songs": [{"year": null, "image": "https://images.genius.com/6da49ff0e6d6b69f4a78bfd5f4fc60ed.626x626x1.jpg", "title": "I Would Die for You", "album": null, "lyrics": "[Intro - Big B]\nWish, I would've died for you baby\nI would've died for ya, Layzie\nI would've died for you, Krayzie\nBut the Widow try to play me, play me\n(7th Sign masterminds. Bizzy The Kid. The Midwest Cowboy)\n\n[Verse One - Bizzy]\nBone ain't feelin my vibe\nThey sayin \"Bizzy, he think he 'Pac\" passin out on stage\nRolling Stones was shocked\nBizzy The Kid grippin his baby makers tellin the whole story\nRunnin from cops, bustin shots, smackin the top with a forty\nI'll never go pop, I'll never go back to Ruthless, stick to the block\nYou better believe it, and I'm sorry to the fans of Bone\nBut I'm Bentley, Audi 5's and drop tops\nBlueberry Swisha Sweets,  that's the way that we monster mash\nHomies gon respect my Gangsta, watch the way we count the cash\nBang, the gang, 7th Sign\n27, 7 kids, lookin young, feelin fit and I don't have to be pressed or pimped\nI don't need no make up neither, I don't want you to touch my hair\nI just wanna rip flow with sickness, makin money everywhere\nI don't wanna have pop appeal, I wanna work with real niggas\nField niggas, trill niggas, rappin with only ill niggas\n7th Sign crack the steel, niggas make me wanna kill niggas\nCrack the steel, peddle to the meddle, mash the gas and mash the wheel\n\n[Chorus - Big B]\nWish, I would've died for you baby (I represent y'all)\nI would've died for ya, Layzie\nI would've died for you, Krayzie (I represent y'all)\nBut the Widow try to play me, play me (The Widow be tryin to get me)\n\n[Verse Two - Bizzy]\nI am the General feelin incredible better than\n10 year veteran off in the cut with a cup of Essence\nFeel the presence, spread the message\nNever knew Evanessence, ain't no best friends\nShut up and handle your business\nThis the new thing, the true thing, 7th Sign's how we doin things\nGangsta party, smokin and drinkin puttin on my dancin shoes\nGotta get that money man; Pay me and I'll come dance for you\nStay the night and bang your broad (Uh) while I'm talkin in tongues\nLet me swallow that, it taste like peaches, must've been a mango blunt\nFollow that, I am the future\nEvolution of elevation, knowledge is the power\nWe shall overcome the hatred with Double Barrels and Ruegers\nEnscripted like an Egyptian, encrypted like biblical Lucifer\n7th Sign won't die, 7th Sign boy\nYou can put that on Joanne I met from San Croy, sucker\nDippin out like Ice Cube, skippin out like Dr. Dre\nFollow the foot steps of rich niggas,bitch niggas, & I'm on my way\n\n[Chorus - Big B]\nWish, I would've died for you baby (I represent y'all)\nI would've died for ya, Layzie\nI would've died for you, Krayzie (I represent y'all)\nBut the Widow try to play me, play me (The Widow be tryin to get me)\n\n[Verse Three - Bizzy]\nThese are my truest feelin's, people are fake as hell (Hell)\nWoman don't turn me down (Down)\nFeel me, like they feelin Braille (Braille)\nI dont' wanna be David Ruffen (Ruffen)\nI don't wanna be Ottis Williams (Williams)\nI don't wanna be Brue neither smokin chronic, drinkin brew and chillin bitch\nYou ain't Barry Gordy\nWe were the perfect group, I promise, you broke us up though\nBizzy always tells the truth, ah\nAin't you a liar, ain't you?\nYou are the venomous snake huh?\nToo bad none of the homies got bitten, hell yeah (Shwew) I wrote this for all L.A., uh\nAny rapper wants to battle, wanna see who goes the fastest\nI don't have to study or nothin I'm a leave that up to you actors\nI don't read The Source or The Vibe when I'm up in Barnes & Nobles\nBone Thugs N Harmony, 7th Sign Soldiers\nStandin in my gangsta pose, sharp as a cobra\nLook in the mind of a madman medicated with Doja, I'm mutilatin his mocha\nNo metaphor and the rappin is real, let it be the hook, fuck a gimick\nIf I die, would you kill nigga?\n\n[Chorus - Big B]\nWish, I would've died for you baby (I represent y'all)\nI would've died for ya, Layzie\nI would've died for you, Krayzie (I represent y'all)\nBut the Widow try to play me, play me (The Widow be tryin to get me)"}], "artist": "Bizzy Bone"}