{"songs": [{"image": "https://images.genius.com/ec460ab317d45b37a52a3fbfe238e5d8.304x304x1.jpg", "lyrics": "[Intro: U-God]\nI'm tellin' you, tellin' you, tellin' you\nAin't ready, Mark, Mark, they ain't ready, man\nThey ain't ready, they ain't ready, they ain't ready for me\nThey ain't ready for me, they ain't ready for me right now, nigga\nI'm here... {*laugh*} When you thought it was safe\nAhh... ooh... give it to me, give it to me\nUh... yeah... now give it to me, give it to me\nPump... now bump bump... now bump..\nGive it to me, give it to me, give it to me, now bump\n\n[Chorus: Autumn Rue (U-God) {both}]\nBaby, when you put it on me (on me)\nDo you thing relentlessly ('lessly)\nDon't you wanna scream my name? {over, over} again\nI just wanna scream your name (your name)\nGive you lovin' that's insane {insane}\nBaby, won't you make me scream {over, over} again\n\n[U-God]\nYo, yo, yo... now your's truly, same ol' g\nYa'll gon' see, you can't hold me\nFeel my energy, my soul so free\nFor a half a century, I've been low key\nWho is he? They call him, U-G-O-D\nReal grizzly, busy as a bee\nFeel it in the air, over the sea\nDon't be mad cuz your ho chose me\nHazel eyes, no goatee, hold heat, rock you to sleep\nKnown in the streets for my platinum teeth\nCuz when I pop something, I go in deep, no bump\n\n[Chorus]\n\n[U-God]\nNow that's right, nigga, I got those skills\nNerves of steel, sex appeal\nHand skills, like windmills\nMind bender, every time I send chills\nDressed to kill, throw 'em in the trance\nMake 'em dance like ants in they pants\nCheck out my, battle stance, comin' down\nAvalanche, war's closing and you got no chance\nHard, rock, abs, move like a snake\nAll that ass, make the waterbed break\nSkin like a god and for heaven's sake\nWhy you wanna make a nigga scream your name? Spark..\n\n[Autumn Rue]\nNiggas try to say what I want\nWhat's the deal, let's keep this blunt\nWe only try'nna have some fun\nHow can, I get you home?\nI searched, you're not the typical kind of guy\nYour moves they, definetly caught my eye\nI like the way you take the beat slow\nAfter the party is on\n\n[Chorus 2X]\n\n[Outro: U-God]\nYeah, yeah, yeah\nFrom the Slums of Shaolin\nHillside Scramblers, we out the garbage, niggas\nWhat? Huh? You ain't think I was gon' come back, huh?\nDid ya? It's U-G-O-D-Zilla\nThat's right, that's right, Hillside Scramblers\nThe gram handlers is back, yo Mark, yo Mark\nYo, spark that track, baby!", "title": "Put it on Me", "year": null, "album": null}], "artist": "U-God"}