{"songs": [{"album": "I Really Rap", "year": "2017-11-30", "title": "I Really Rap", "image": "https://images.genius.com/8c75d09384d3e2e7dd519dae8ec8c1f5.1000x1000x1.jpg", "lyrics": "[Intro: Dave East]\nHuh?\nWhat a day\n\n[Verse 1: Dave East]\nFresh out the bookings, my mental thinkin’ about millions\nWatchin’ for cameras, couples hammers we stashed in the building\nDifferent, ain’t got no answers for me\nNegative vibes in my circle feeling like cancer to me\nKidnap your daughter, we on her, go get that ransom for me\nConnect from Indonesia, about his paper\nI’ll date you later, ‘cause him don't need ya\nDope is amazing, it got him shakin’, look like a seizure\nBitch from Jamaica, they hatin’, fuck it, they in the bleachers\nI’m startin' five, eyes open, just look alive\nGo through my book of rhymes, you’ll see that I took my time\nO.G. got that raw smell, Ivy League, no Cornell\nDouble cup with my sprite mix, transportin’ with a white chick\nSee the burrow with a perc' in me, pilot told me I'm a flight risk\nCross the border, got work with me, early morning plus night shift\nGot a hit man, just make the call, he write the list\nSide bitch got my wifey pissed, wanted an icey wrist since ‘96\nBut\n\n[Bridge: J.R. Writer]\nThe real is back, how real is that?\nWhere them writtens you’ve written at? They chicken scratch\nI don’t listen to silly cats with simple tracks\nWho told you that they was feeling that, that shit is wack (huh?)\n\n[Chorus: J.R. Writer]\nI really rap, I really rap, (turn me up)\nYeah, I really rap\n(Talk my shit) Don't compare me to nobody, my shit is crack\n\n[Verse 2:  J.R. Writer]\nLook\nIn Harlem, I’m goody, your [?] was hoody\nYou play me just a little B, I’ma stomp you and boogie\nI’m far from a rookie, don't disrespect it, and just expect it\nYour girl gon’ throw the mouth piece until she get rejected\nThe kid’s selective and you reckless with them hoes you pick\nShe need to go get stitched, she doesn’t even know she hit\nExpose you pricks and you hoes, you want a lift? The answer's no\nI cut it short, I’m from New York, that slut can walk, Amber Rose\nIt ain’t hard to see I copped out on armory\nD. Wade, Cavaliers, opt out, don't start with me\nJ.R. should be your idol, I ain’t your rival\nAnd y’all ain’t fuckin’ with me, period, y’all need some Midol\nMind you, I’m in a room 'bout as high as the Eiffel\nAnd it got so many views, it’s about to go viral\nI should advise you, I’m tuckin’ the semi\nSettin’ up shop just to fuck with the city, who tusslin' with me\nNone of them, I’ma be ripping the mic til I’m hundred and twenty\nYeah, understand I rock, all these bands I clock\nFresh out the big shack and “Your man's not hot”\nFuck the plans y’all got, I will son y’all any day\nCome brawl or you in the way, young boy this the NBA\n\n[Chorus: J.R. Writer]\nI really rap, I really rap\nYeah, I really rap\nDon't compare me to nobody, my shit is crack"}], "artist": "J.R. Writer"}