{"songs": [{"image": "https://images.genius.com/4d8cc547ab63a2371208b5ac2181e328.1000x1000x1.jpg", "title": "Therapy Session", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Verse 1]\nYeah, I got off stage like a month ago\nI was talking to fans\nAnd one of 'em pulled me aside and said\n\"We never met, but I swear that you know who I am\nI've been through a lot\nI don't know how to express it to people, don't think that I can\nBut I got that Mansion CD on rotation\nThat's real for me, Nate, you do not understand\"\nIt's crazy for me\nKids hit me up, say they slittin' they wrists on the daily\nThis music is more than you think\nDon't book me for just entertainment, it's entertainin'\nHearin' these parents, they telling their kids\nMy music is violent—you gotta be kidding me\nI guess that your definition of violence and mine\nIs something that we look at differently\nHow do you picture me, huh?\nWant me to smile, you want me to laugh?\nYou want me to walk on the stage with a smile on my face\nWhen I'm mad and put on a mask? For real though\nI mean, what you expect from me?\nI'm tryna do this respectfully\nThey say that life is a race\nI knew my problems would prolly catch up eventually\nI do my best to be calm\nHow you gon' write me and tell me you'd slaughter my family?\nThat's just a glimpse to the stuff that gets sent to me\nThese are the parts of my life they don't never see, woo!\nI am aware, it's aggressive\nI am not here for acceptance\nI don't know what you expected\nBut what you expect when you walk in a therapy session, huh?\n\n[Chorus]\nTherapy, therapy session\nTherapy, therapy session\n\n[Verse 2]\nThis girl at the show looked me in the face\nAnd told me her life's full of drama (Yeah!)\nSaid her dad is abusive\nApparently, he likes to beat on her mama\nI got so angry inside\nI wanted to tell her to give me his number\nBut what you gon' do with it, right?\nYou gon' hit him up then he'll start hittin' her harder, that's real\nThese kids, they come to my shows\nWith tears in they eyes\nImagine someone looking at you\nAnd sayin' your music's the reason that they are alive\nSometimes I don't know how to handle it\nThis type of life isn't glamorous\nThis ain't an act for the cameras (Nah!)\nYou see me walk on these stages\nBut have no idea what I'm dealing with after it, nah!\nI put it all in the open\nThis is the way that I cope with all my emotion\nI'm taking pictures with thousands of people\nBut honestly, I feel like nobody knows me\nI'm tryin' to deal with depression\nI'm tryin' to deal with the pressure\nHow you gon' tell me my music does not have a message\nWhen I'm lookin' out at this crowd full of people I know I affected? Agh!\nI got some things in my life (My life)\nI know I should let 'em go (Let 'em go)\nLet me jot it down (Jot it down)\nLet me take a mental note (Mental note)\nI put it all in this microphone (Microphone)\nThink about that for a minute\nWhat is the point of this song? I'm just ventin'\nBut what you expect from a therapy session, huh?\n\n[Chorus]\nTherapy, therapy session\nTherapy, therapy session\n\n[Verse 3]\nWhat you think about me\n—That doesn't worry me\nI know I handle some things immaturely\nI know that I need to grow in maturity\nI ain't gon' walk on these stages, in front of these people\nAnd act like I live my life perfectly\nThat doesn't work for me\n\"Christian\" is not the definition of what \"perfect\" means, woo!\nI ain't the type to be quiet\nI ain't gon' sit here in silence\nIf I wouldn't say what I say to your face\nThen I promise you, I wouldn't say it in private\nI am not lyin'\nPeople go off on my page, and I'm tryin' to quit the replyin'\nBut this is ridiculous\nI'm passionate, man, I really mean what I'm writing\nYou want me to keep it a hundred?\nOkay, I'll keep it a hundred\nI see a whole lot of talkin' on socials\nBut honestly, I don't see nothing in public\nI kinda love it, yeah\n\"Why don't you write us some happy raps?\nThat would be awesome\"\n\"All of your music is moody and dark, Nate\"\n—Don't get me started (Yeah!)\nYou wanna know what it's like if you met me in person?\nListen to my verses\nThis music is not just for people\nWho sit in the pews and pray at the churches, nah!\nI won't reject it\nI don't expect everyone to respect it\nI don't expect you to get my perspective\nBut what you expect from a therapy session?\nHuh?\n\n[Outro]\nI mean, I think sometimes people—they confuse what I'm doin'\nI write about life, I write about things that I'm actually dealing with\nSomething that I'm actually experiencing\nThis is real for me\nLike, this is something that personally helps me as well\nI'm not confused about who gave me the gift\nGod gave me the gift and he gave me the ability to—to do this\nAnd he also gave me this as an outlet\nAnd that's what music is for me\nWhen I feel something, whether it's anger\nUm, it's a passion about something—or frustration\nLike, this is where I go\nThis is—this is—that's the whole \"NF Real Music\" thing, man\nThis is real for me—I need this\nThis is a therapy for me"}], "artist": "NF"}