{"artist": "Warren G", "songs": [{"year": "1994-04-28", "lyrics": "[Produced by Warren G]\n\n[Intro]\nRegulators. We regulate any stealin' of his property. We’re damn good too. But you can’t be any geek off the street. You gotta be handy with the steel, if you know what I mean. Earn your keep. Regulators, mount up!\n\n[Warren G]\nIt was a clear black night, a clear white moon\nWarren G was on the streets tryin' to consume\nSome skirts for the eve so I can get some phones\nRollin' in my ride, chillin' all alone\n\n[Nate Dogg]\nJust hit the east side of the LBC\nOn a mission tryin' to find Mr. Warren G\nSeen a car full of girls, ain't no need to tweak\nAll you skirts know what's up with 213\n\n[Warren G]\nSo I hooks a left on 21 and Lewis\nSome brothers shootin' dice, so I said \"Let's do this!\"\nI jumped out the ride and said \"What's up?\"\nSome brothers pulled some gats, so I said \"I'm stuck!\"\n\n[Nate Dogg]\nSince these girls peepin' me I'ma glide and swerve\nThese hookers lookin' so hard they straight hit the curb\nOnto bigger, better things than some horny tricks\nI see my homie and some suckas all in his mix\n\n[Warren G]\nI'm gettin' jacked, I'm breakin' myself\nI can't believe they takin' Warren's wealth\nThey took my rings, they took my Rolex\nI looked at the brother, said \"Damn, what's next?\"\n\n[Nate Dogg]\nThey got my homie hemmed up and they all around\nCan't none of them see him if they goin' straight pound-for-pound\nThey wanna come up real quick before they start to clown\nI best pull out my strap and lay them bustas down\n\n[Warren G]\nThey got guns to my head, I think I'm goin' down\nI can't believe it's happenin' in my own town\nIf I had wings I would fly, let me contemplate\nI glanced in the cut and I see my homie Nate\n\n[Nate Dogg]\nSixteen in the clip and one in the hole\nNate Dogg is about to make some bodies turn cold\nNow they droppin' and yellin', it's a tad bit late\nNate Dogg and Warren G had to regulate\n\n[Instrumental Interlude]\n\n[Nate Dogg]\nI laid all them bustas down, I let my gat explode\nNow I'm switchin' my mind back into freak mode\nIf you want skirts, sit back and observe\nI just left a gang of hoes over there on the curb\n\n[Warren G]\nNow, Nate got the freaks and that's a known fact\nBefore I got jacked I was on the same track\nBack up, back up, ‘cause it's on\nN-A-T-E and me, the Warren to the G\n\n[Nate Dogg]\nJust like I thought, they were in the same spot\nIn need of some desperate help\nBut Nate Dogg and the G child\nWere in need of somethin' else\nOne of them dames was sexy as hell\nI said \"Ooh, I like your size!\"\nShe said \"My car's broke down and you seem real nice\nWould you let me ride?\"\nI got a car full of girls and it's goin' real swell\nThe next stop is the Eastside Motel\n\n[Instrumental Interlude]\n\n[Warren G]\nI'm tweaking into a whole new era\nG-funk, step to this, I dare ya\nFunk on a whole new level\n\n[Nate Dogg]\nThe rhythm is the bass and the bass is the treble\n\n[Warren G]\nChords, strings, we brings melody\nG-funk, where rhythm is life and life is rhythm\n\n[Nate Dogg]\nIf you know like I know\nYou don't wanna step to this\nIt's the G-funk era, funked out with a gangsta twist\nIf you smoke like I smoke\nThen you're high like everyday\nAnd if yo' ass is a busta, 213 will regulate", "image": "https://images.genius.com/701dda20978aaae6ecc21e88c0c17c89.600x526x1.jpg", "album": "Regulate... G Funk Era", "title": "Regulate"}]}