{"artist": "50 Cent", "songs": [{"album": "The Big 10", "image": "https://images.genius.com/ebcbd791d9dec323345c03a3341cac73.320x285x1.jpg", "title": "Body On It", "lyrics": "[Intro] News report\nReporter:\nPolice search for clues on the Q 111 bus where two people were shot, one fatally\nWitness 1:\nYou heard like a few shots ring out and uh, you know by living in the neighborhood familiar with those sounds. We knew it was gunshots, so automatically you know we started taking cover because we didn't know or establish where they were coming from\nReporter:\nPolice say it all started in South Jamaica about two and a half miles away From the shooting on the bus at Jamaica station\nWitness 2:\nI was trying to get away from the area, after the first shot, it was very traumatizing to me like I've seen this happen a lot of times and didn't want to be involved. I Didn't want to be that person that get a stray bullet or nothing like that\nReporter:\nPolice Arrested a 34 year old man, they believe he is responsible for both shooting Incidents. They also recovered a handgun. He was arrested not far from here near Jamaica station in Jamaica, Queens. Zach Fink Ny1\n\n50 cent:\nIt's the big 10, its been 10 years since 50 cent is the future\nI'm tired as a motherfucker\nWhat you want me to be I've tried to see\n\n[Verse 1]\nYeah bitch I got my second wind\nYou could pretend I ain't the shit\nI'm guilty, I'm guilty\nYeah I'm filthy fucking rich\nI'm strapped your honor\nNew mac, my armor\nPoint blank, catch in my bulletproof persona\nNew version of Dahmer\nPussy eating Piranha\nMy tongue touch your flesh\nYour bitches say I'm the best\nThe crackers say I'm racial\nWait a cotton-picking minute\nNow I'm racial\nCause I done put cotton-picking in it\nPut a knot on your fucking head\nYeah that'll happen first\nI'll put a dot on your fucking head\nYou'll end up in a hearse\nThey say I play mind games\nWarrior mind frame\nThese bitch niggas always forget to say my name\nGo ahead, I want you to\nYou fraud, I'm on to you\nI'm so strategic you wouldn't believe it\nAnd they know, everytime I come around\nPit stop and they tend to quiet down\nCause they know about me\n\n[Hook]\nMy nine got an extended clip on it\nMy tech got all kind of shit on it\nM beam hollow tips rubber grip on it\nNight vision through the sight when I grip on it\nMy nine got an extended clip on it\nMy tech got all kind of shit on it\nMy pound got a body on it body on it\nMy man put a body on it body on it\n\n[Verse 2]\nI read a blog\nThey said I ain't got it\nI still got it\nOh lord!\nLook whose gonna meet the edge of my sword\nI'm taking off now bitch\nAll aboard\nIf you want to ride fuck it let's ride\nIt seems like principle living's starting to fade\nEven is a gangsta's life, niggas is snakes\nNo loyalty, rats ratting on members of the game\nFunny they were family before the pigs came\n\n[Hook]\nMy nine got an extended clip on it\nMy tech got all kind of shit on it\nM beam hollow tips rubber grip on it\nNight vision through the sight when I grip on it\nMy nine got an extended clip on it\nMy tech got all kind of shit on it\nMy pound got a body on it body on it\nMy man put a body on it body on it\n\n[Outro]\nYeah, this right here one marks the decade of hot shit\nIf a nigga say I fell off all I want you to do is ask him when\nWhat they gonna say, what the Curtis album?\nOkay so number one's not good enough\nI gave you Ayo Technology that was number one\nI get money, that wasn't hot\nSo tell me when I fell off\nYeah, when I gave you motherfuckers what you asked for\nWith before I self destruct\nYou looked at me and was like\nWe cool fif'\nYou know why?\nCause I won too much in front of you niggas\nThats why\nIt's alright go out take a break come back\nSo hot you can't deny it\nIts your boy 50\nThis one right here is for the haters for real\nI want you to eat a dick\nDon't suck a dick, eat a dick\nChew it. haha", "year": "2011-12-09"}]}