{"songs": [{"title": "Survive", "lyrics": "AKIR - “Survive”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Verse 1: AKIR]\nElders say, “Keep your focus,” smirk and say I’m hopeless\nAddict for greenbacks, rubber bands over mean stacks\nI’ma get it—I mean that—like coke where the fiends at\nSupplying, multiplying, lying up in a mean shack\nTen rooms of fire, place, and a mean act\nSuper fly, she’s live ass and a mean rack\nDrive you out of your mind, back up, and truck\nCall me the Mack, speeding behind until I reach my peace of mind\nThis peace of mind?  Plan to protect it with a piece of mine\nFuck around, blow out a piece of your mind.  It’s hard\nWork, nigga [?].  Musical\nArtwork.  Soon as I reach, I’ll climb.  There’s no\nStopping on four fours.  Like bowlegged, low\nJust watch the move, don’t ask me why I do what I do\nBack the fuck up while these live niggas step through\nBack the fuck up while these live niggas step through\n\n[Hook: AKIR]\nStay alive, nigga, ‘cause man is not the only to\nSurvive, nigga.  And so we keep this fire\nDeep inside, nigga.  Without it, you will wither up\nAnd die, nigga.  Stay alive, nigga.  To all\nMy live niggas, only few is prepared\nTo die, nigga.  Pick up your people, then go ahead\nAnd ride, nigga.  Get live, nigga\nSurvive, nigga.  Stay alive, nigga\n\n[Verse 2: AKIR]\nStated as simple as I can, I am only one man.  In this\nGrand scheme of things, about as small as an ant, holding\nThe dreams of those who believed but didn’t achieve, addicts\nPimps, and thieves who breathe by these tricks up their sleeves\nNiggas in prison see their living through survival as creed.  Only\nEighteen, serving fiends and had his mom signing deeds\nTo her new house, bank accounts, to the scenes with the cream\nYou know the scene, same routine: judges gave him eighteen.  And you\nCould see the repercussions through the bums on the street.  Head on\nTheir shoulders, falling over, they can’t get on their feet.  It’s hard\nTo balance when the foulness hits ya.  Elders say, “Read the scripture”\nI say, “Do whatever fits ya.”  I’ll pray, I’ll play my part\nIt’s at the end of motion picture.  Type twenty-three to plot\nChanges with the age, kid.  Getting these papers to\nFinance me rocking stages.  I’ll get patient, then change\nSwitch: dental pair, health care, and paychecks\n\n[Hook: AKIR]\nStay alive, nigga, ‘cause man is not the only to\nSurvive, nigga.  And so we keep this fire\nDeep inside, nigga.  Without it, you will wither up\nAnd die, nigga.  Stay alive, nigga.  To all\nMy live niggas, only few is prepared\nTo die, nigga.  Pick up your people, then go ahead\nAnd ride, nigga.  Get live, nigga\nSurvive, nigga.  Stay alive, nigga\n\n[Verse 3: AKIR]\nYo, yo, some decide to play games, some decide to take aim\nSome decide to dickride, piggyback off somebody’s fame\nSome’ll pray on the weak, some’ll wait for defeat\nSome’ll wait for the chance to knock you off your fucking feet\nChallenge your balance, watch you fall in the street, pick up\nYour keys and run you over with your own SUV.  I’ll keep\nAn eye open, sleep, make sure the sky’s over me ‘cause when\nYou over the sky, it’s over, you die.  Time\nWill tell my destiny more that equity.  I want my people\nTo love and respect me in the struggle ‘til I’m stress-free\nThese thoughts are serious and much more than lyrical\nModern-day negro spirituals, contemporary biblical\nThere’s a lot in this world.  You might not be the dopest.  Stay\nFocused, always keep an eye on your peripherals\nNo telling what these niggas’ll do.  Don’t get sidetracked\nMy niggas.  Ayyo, just do you\n\n[Hook: AKIR] (x2)\nStay alive, nigga, ‘cause man is not the only to\nSurvive, nigga.  And so we keep this fire\nDeep inside, nigga.  Without it, you will wither up\nAnd die, nigga.  Stay alive, nigga.  To all\nMy live niggas, only few is prepared\nTo die, nigga.  Pick up your people, then go ahead\nAnd ride, nigga.  Get live, nigga\nSurvive, nigga.  Stay alive, nigga", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}