{"artist": "​​wifisfuneral", "songs": [{"year": "2014-10-15", "lyrics": "[Verse]\nMax P trapping out the cut like it’s part-time\nLeave a nigga flatbread, ? ,cracked jawline\nSmoking blunts since the first grade\nScreaming “Fuck 12”\nFree my nigga Black, hope he maintain\nRiding through the motherfucking strip, hitting licks with my bitch\nI done smoked on the eighth, I done sipped on the fifth, vomit\nYour hoe in the cut\nFinesse like no other, we get what we want\nGrab a dutch from the store and it’s on\nCop a half, I’ll smoke it all till it’s gone\nPour up a four and I’m throwed\nI fuck with your bitch, she say “okay, he got me”\nBring her right back to the crib, quickly, sloppy toppy\nCan’t fuck with me nigga, I’m hot as wasabi\nI was born off a piff and i’m fucking with thotties\nSlip a lil brick and get pulling out shorties\nSell all them xannies, we give them receipts\nSaid “no nigga copy”\nThe topic is prophecy\nGuap, it ain't stopping\nSmoking and ? on candy paint\nThirties, we riding on Chevrolet\nGot clips by the dozen, I’m eating grapes\n\n[Hook]\nSo you got killers that’s ready to roll?\nYou finna put two in my head and it’s blow\nLoad it and cock it and squeeze, let it go\nOkay, fasho\n\nI’m serving chakra back in 98\nKeep heat on your block, on your block where you thot 99, little weight\nRemember December, November, eating ramen noodles with ninety cent cakes\nLittle nigga, you stupid, straight clueless\nYou know what it is\nNigga, hit up my plug if you looking for this\nNo lies through my lips, all I speak is real shit\n(And that’s real shit bruh, I mean like, you know)\n\n[Hook]\nSo you got killers that’s ready to roll?\nYou finna put two in my head and it’s blow\nLoad it and cock it and squeeze, let it go\nOkay, fasho", "image": "https://images.genius.com/5e503e4ab206a1308e9cd6f26042c1b3.500x500x1.jpg", "album": "Why Am I Alive? - EP", "title": "Okay, Fasho"}]}