{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/edce90c8bb6a41d501e55ed6f4d888df.1000x1000x1.jpg", "title": "Boss My Life Up", "year": "2015-12-25", "album": "Institution", "lyrics": "[Intro]\nSee, you gotta go against all odds, you know?\nBoss your life up\n\n[Hook]\nI had to run a check up, I had to boss my life up\nLike, where I get these bands from?\nLike, where I get that ice from?\nI stayed down long enough, and then I came right up\nWhat else you think a nigga used to stay up all night for?\nWhat else you think a nigga used to stay out sellin' white for?\nI'm in love with the guap, while lil momma think I like her\n\n[Verse 1]\nSee, Imma drink a pint, lil momma damn, she got nice butt\nThen you can come and tie lil momma down, you could wife her\nIf you got them bands, then she might fuck\nI'm in Fort Myers with G1 sellin' white stuff\nI had to hit that lick, it's a gamble everyday\nI here you gotta take a risk\nHow else you think I wrapped the Cuban link around my wrist?\nNow I'm bendin' corners, I got forgis on my whip\nCashed out, nigga, I've been racked up ever since\nMovin' short on them bills, now I pay my momma rent\nRemember sellin' dope to my next door neighbor then\nKnock, knock, ain't nobody home we breakin' in\n\n[Hook]\nI had to run a check up, I had to boss my life up\nLike, where I get these bands from?\nLike, where I get that ice from?\nI stayed down long enough, and then I came right up\nWhat else you think a nigga used to stay up all night for?\nWhat else you think a nigga used to stay out sellin' white for?\nI'm in love with the guap, while lil momma think I like her\n\n[Verse 2]\nBoss my life up, it wasn't nothin' else to do\nYou should try it too, you should run a check or two\nI'm tryna make it out, you could be successful too\nAin't tryna make it out? Then sorry I can't hang with you\nGirl I can't hang with you, lil homie I can't mess with you\nI'm bout my cheddar, you should go get you some cheddar too\nGo get you a check or two, that what you better do\nSo you can free yourself a lil bit, when you steppin' through\nI had to boss up, I had to cut some people off\nTo be the boss, you gotta learn how to take a loss\nBible on the dash, road runnin' with the cross\nGoin' up top, touch down like Randy Moss\n\n[Hook]\nI had to run a check up, I had to boss my life up\nLike, where I get these bands from?\nLike, where I get that ice from?\nI stayed down long enough, and then I came right up\nWhat else you think a nigga used to stay up all night for?\nWhat else you think a nigga used to stay out sellin' white for?\nI'm in love with the guap, while lil momma think I like her"}]}