{"artist": "Young Thug", "songs": [{"year": "2019-01-09", "lyrics": "[Intro: Young Thug]\nThugger! Fetty!\nMotherfuckin' Wap you know what I'm sayin'\nThis the real get money motherfuckers out\nI want them to get some of this one, you know what I'm sayin'\n\n[Chorus: Young Thug]\nBaby wake up\nThey can't wait to, they can't wait to\nHate on us\nBaby wake up, baby smell the coffee\nThey not friends with benefits, these lil hoes just stalking\nCause my cake up, my cake up, my cake up, my cake up\nMy cake up, my cake up, yeah\nMy cake up, my cake up, my cake up, my cake up\nMy cake up, my cake up, my cake up, yeah\n\n[Verse 1: Fetty Wap]\nAnd when I wake up baby\nFirst thing on my mind is get this cake up baby\nI stay on my grind, why they hating?\nDiamonds like a glacier, I stay counting paper\nNo wonder why they hating\nAnd you so fine, I'll make you mine yeah\nAnd I'm thinking bout all the time babe\nWhen I'm on tour, when I'm back home\nYou know I'm bringing the money home, yeah\nShe like when she see when I skrrrt when I'm dripping\nRoll up with me to the club, is you tripping?\nRoll up the weed, let's get high, let's get lifted\nI can teach you how to get it baby, tell me if you with it, yeah\n\n[Chorus: Young Thug]\nBaby wake up\nThey can't wait to, they can't wait to\nHate on us\nBaby wake up, baby smell the coffee\nThey not friends with benefits, these lil hoes just stalking\nCause my cake up, my cake up, my cake up, my cake up\nMy cake up, my cake up, yeah\nMy cake up, my cake up, my cake up, my cake up\nMy cake up, my cake up, my cake up, yeah my cake\n\n[Verse 2: Young Thug]\nI kick all my bitches in, I ride with them Benjamins\nFresh to death I'm killing it, I'ma drop the ceiling bitch\nMoney flow like water falls, never knew or know of y'all\nNever saw or noticed y'all, never dawg, baby naw\nNawww\nI wake up then roll up and bake up\nI cook them cookies, easy bake 'em\nI cake that bitch, I meant I bake her (udigg)\nBig old dinosaurs Bs all on my body (woo!)\nBet' coming down if you wan' see it (see it yeah)\nI pop perkys and drink lean and I'ma take a molly (yeah)\nI told my drug man he so needy\nYaaah\n\n[Chorus: Young Thug]\nBaby wake up\nThey can't wait to, they can't wait to\nHate on us\nBaby wake up, baby smell the coffee\nThey not friends with benefits, these lil hoes just stalking\nCause my cake up, my cake up, my cake up, my cake up\nMy cake up, my cake up, yeah\nMy cake up, my cake up, my cake up, my cake up\nMy cake up, my cake up, my cake up, yeah my cake", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Cake Up"}]}