{"songs": [{"title": "Down in the DM (Remix)", "lyrics": "[Intro: Yo Gotti]\nIf she respond to this DM, boy you fucked up\nShe took your pictures off her 'Gram, y'all must have broke up\nFirst she love you, then she blocked you, boy that's fucked up\nIt's the remix and you know what's up\n\n[Chorus: Yo Gotti]\nAyy it go, it goes down in the DM (it go down)\nIt go down in the DM (it go down, it go...down)\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go... down)\n\n[Verse 1: Yo Gotti]\nI tell her, Snapchat me that pussy...mood\nOr FaceTime me that pussy if it's...cool\n(Woo) Boy, my DM poppin' (DM poppin')\nMy DM just caught a body\nIf you screenshottin', you the police\n10 likes, you want OD\nFollow shawty then unfollow\nThen follow back, that's so me\nShe's like, \"I killed 'em, bitch I killed 'em, really killed 'em\"\nBitch you wouldn't look like that if you undo all them filters and angles\n\n[Chorus: Yo Gotti]\nI seen your girl post her BM\nSo I hit her in her DM\nAll eyes, yeah I see 'em\nYeah, that's your man? I'd hate to be him (whoop)\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go...down)\n\n[Verse 2: Nicki Minaj]\nYour dick ain't good enough to be stylin' on me\nYou's a bitch ass nigga to keep on wildin' on me\nHit my side nigga, \"Quick, fast! Pull up in that quick, fast!\"\nI ain't talkin' pancakes, but he flip a brick fast\nA bunch of bad bitches, ain't doin' the dab, bitches\nDo be in some gangs, couple Cs on their bag, bitches\nFuck you mean? Fuck your little memes\nEven Queen Bey had to tell 'em I'm the queen\nCheck the D, blessed indeed\nThe executive producer, bitch, rest in peace\nThen he put his hands in my pants, felt them thick lips, and got wood\nHe said, \"Kylie, wuss good?\" I said, \"Miley, wuss good?\"\nI said, \"Could you pay my bills, like O'Reilly? Wuss good?\"\nI just sit back and observe, all these niggas that I done curved\nIf it go down in your DM, then baby boy, you lucky\nCause 99.9%, of these fuckboys can't fuck me\n\n[Chorus: Yo Gotti]\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go...down)\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go... down)\n\n[Verse 3: Nicki Minaj]\nYo, I seen your man post a quote, and a pic in bed\nSo I hit him in the DM, like, \"Hey bighead\n'Member when I was your woman crush?\", He said, \"Yeah\"\nTold him that I'm headed home, he could meet me there\nTry to beat me there, let me be clear\nIs you eatin' ass too? Nigga, pinky swear\nI'm just lookin' for a dude, that could eat the twat\nDo he make more dough, than the pizza shop?\nDo he dress every day, like it's Easter Sunday?\nCan he give me more head, than Peggy Bundy?\nMan, fuck I look like turnin' down some dome?\nMan that's sorta like a dog turnin' down some bone\nNigga know that I'm a 10, that's Celine on my lens\nI don't need another friend, it's just me and my Ms\nI said, \"What you like about me?\" He said, \"That your ass fat\"\nHe said, \"Would I let him eat this ice cream out my ass crack?\"\nHe said that, \"It's abstract\",He said, \"Yo, yo ass crack!\"\nI told him \"I never front\", and then I threw that ass back\n\n[Chorus: Yo Gotti]\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go...down)\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go... down)\n\n[Outro: Yo Gotti]\nI tell her...\nSnapchat me that pussy (mood)\nSnapchat me that pussy if it's...cool\nSnapchat me that pussy (mood)\nSnapchat me that pussy if it's...cool\nI seen your girl post her BM\nSo I hit her in her DM\nAll eyes, yeah I see 'em\nYeah, that's your man? I'd hate to be him (whoop)\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go...down)\nIt goes down in the DM (it go down)\nIt go down in the DM (it go down, it go... down)", "album": "The Art of Hustle", "year": "2016-02-19", "image": "https://images.genius.com/d9bad20f6db0d39356e79f787f7edb1f.1000x1000x1.jpg"}], "artist": "Yo Gotti"}