{"artist": "Pras", "songs": [{"album": "Win Lose or Draw", "title": "Light My Fire - 37648", "image": "https://images.genius.com/e86c37e94a9221052cd1f57601afc795.500x500x1.jpg", "lyrics": "Yo (uh, what, yo, uh-huh) ha, yeah yeah\nYeah, eh-heh, alright (mmm, uh, uhhh)\nGood morning light my fire baby woo; woo, woo!\nOhhh-oh-ohhhh, girl you make me feel fine\n(Yeah, uhh, ha ha)\nDan-na-dah-doo-doo-dah!  Ohh-oh-ohhhh\nDan-na-dah-doo-doo-dah!\n\n[Pras Michel]\nWell I was born a mixed breed, a planted seed\nMixed with some weed and a lil' bit of Hennessy\nWhen I bleed, I love to believe\nThat a friend in need is a friend indeed\nWhere da bumba claat, where da bumba ras\nForget me not, dem know a Super Pras\nBlueberry don't start no fight\nSean Paul tell 'em pass the light\nEighty bars but your 16 ain't worth the spit\nMoney cars and fame is that all you get?\nPride and respect in the street, that's not all I got\nSilly boy come test, cause dem wield de shot\nSeckle de violence, bad boy move in silence\nGive them some guidance, they need to see the science\n(Fire that's richer than ??) Well speak up\nAnd through your minutes of fame I kept my FEET up\n\n[Chorus: Pras Michel + female]\nC'mon and light my fire, babyyy, ohh-oh-ohhhh\nKiss the sun let's get higher, hi-ii-iiigh\nThey don't think we're gonna make it, ohh-oh-ohhhh\nBut the world let's just take it, hi-ii-iiigh\n\n[Pras Michel]\nWell I was often told I was off my road\nNever sold my soul for the glitter of gold\nLet the truth be told, I made the mold\n23 years old, 20 million sold\nY'all dream of half-a-mill, lookin for your next meal\nAsk the guerillas, I signed my own deal\nMovies, clothing, ma I'm so ill\nMash up the dancefloor (yo Pras chill!)\nMan SECKLE, I'm bumpin like a kettle {*whistle*}\nYou don't hear the sound bustin your vessel? {Brrap!}\nAnd for my enemies, scope 'em like the Kennedy's\nYou think I'm lyin?  Go and ask the ReFugees\n\n[Chorus]\n\n[Pras Michel]\n40 days 40 nights I was off the scene\nCocked back my style with a gangsta lean\nKept my ears to the streets and my hands been clean\nServin rice and beans while I plot and scheme\nBack by the 18, we buffalo soldiers\nRude bwoy run 'way, I thought I told ya\nGuns too big to fight in a holster\nStill stay true to my roots and culture\nWhen we comin rushin in best be afraid\nWe take a flag when we march in our parade\nBrooklyn, Trini, Jamaican, Haitian\nWe built to rule like United Nation\nStill Pras fat hooks I'm no Nas\nType bars through wars ain't no scars\nTook the pilgramage to conquer Rome\nDethroned Caesar, guerillas now they're home, ba-by!\n\n[Chorus]\n\n[female ad libs while Pras talks]\nYeah, guerillas baby, you don't see us comin\nBrrap, brrap, lights out, ah-heh-heh", "year": null}]}