{"songs": [{"lyrics": "[Verse]\nA story of about two crazy dolls\nAll they wanna do is get money pussy foreign\nThey mean as fuck\nEven killed a couple bitches\nDon't tell on each other they done gave some bitches stitches\nLil Cuban she a beast, she'll slap a bitch for me\nYou fucking talking wrong put this thirty on your teeth\nReal niggas trapping, they would whip a bird for free\nCall my phone I don't answer cause the money all I see\nIf you wanna beef with me, I'ma need a hundred bands\nBitch you better be flyer then motherfucking Japan\nBitch you better be an astronaut, niggas they is fucking not’s\nAsian doll that bitch, I am sad, all my homies dead\nI don't give a fuck about a bitch, it's been fuck the rest\nOn that gang shit, six, I been born bitch\nYou ain't never flipped shit, what you want a fucking feature\nThey steady dissing me but these bitches on a bleachers\nWhat the fuck? Huh? Some motherfucking gum\nLil Cuban get the motherfucking hundred round drum\nYeah I’m free styling, these bitches they be wilding\nThey want my fucking life, but they ain't got no fucking styling\nYeah you stay with your mama\nYeah with your little diploma\nYeah bitch I dropped out got some motherfucking bands\nI’m the motherfucking man, but you know I’m a girl\nI ain’t never been a cheerleader, I ain’t go to juice\nSkip that motherfucking class, with my new Louis bag\nI was so damn high, know these bitches they be sad\nBut I’m hood rich, got that money out that fucking rap, you can't even trap\nGirl you ain't even got no bank account\n\nI be flexing reckless, Asian Doll; I'm happy, niggas wanna stress me\nNigga you can't even get a answer, I been so busy rocking shows\nNiggas know they hoes, niggas know they dogs\nAsian Doll, bitch I get that money I be fucking exhausted\nRunning round the lobby like a motherfucking kid\nI am not a normal bitch, these bitches is my kids\nAnd I been pregnant ever since like when?\nNigga what you talking bout, I been threw them bitches in the trash can\nThis some Detroit niggas killers on that murder shit\nTie your momma up, call your brother like we did it bitch\nWe don't give a fuck, always been tough\nNever been a lame, I don’t even gotta pretend cause I’m insane\nCheck my resume, check my background\nNiggas talking like they from the hood, what you acting like you new now?\nBitch I ride through, and I cruise now\nWith no new bitches, all my bitches on that cute shit\nBoo bitch!\nWhat you looking at?\nWhat, you wanna die?\nThen I flex, on lil' Cuban go and get that motherfucking tech bitch", "album": "Project Princess Vol. 1", "year": null, "title": "BWB (Freestyle)", "image": "https://images.genius.com/89cf00a43983749125eda2c372d01f56.500x500x1.jpg"}], "artist": "Asian Da Brat"}