{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Freaky Gurl (Wanna Minaj?)", "album": "Sucka Free", "year": null, "lyrics": "[Intro: Nicki Minaj]\nOh I get it, oh okay\nNiggas tryna, niggas tryna, tryna be on some slick shit\nHow you gone do a freaky girl song and not include Nicki Minaj?\nI mean come on now, you know my fuckin' name, let's get it\n\n[Chorus: Gucci Mane]\nShe's a very freaky girl, don't bring her to mama\nFirst you get her name, then you get her number\nThen you get some brain in the front seat of the Hummer\nThen you get some brain in the front seat of the Hummer\nShe's a very freaky girl, don't bring her to mama\nFirst you get her name, then you get her number\nThen you get some brain in the front seat of the Hummer\nThen you get some brain in the front seat of the Hummer\n\n[Verse 1: Nicki Minaj]\nUhnn you want a freaky girl? Welcome to Nicki World\nN-N-N-Nicki's world, N-N-N-Nicki's world\nUm, let me think, what could I do to kick it off?\nHow bout I cum all on your dick and then I lick it off?\nI mean it's something so funny when it get soft\nI like to play with it, squeeze it like a stress ball\nHe say he like to hear the sound of me slurpin' it\nTurn off his phone cause them hoes keep churpin' it\nTell me that I get the fattest pussy in the whole world\nAnd if I let him eat it, I can be his ol' girl\nFuck I look like turning down some head?\nI mean that's sorta like a bird turning down some bread?\nYou can eat it like a treat, you can squirt it, you can skeet, I'm a freak, I love to beat, just don't get none in my sheets\nEvery time I pop the coochie, Gucci start chokin' me\nNow I'm kinda scared I got a feelin' Gucci stalkin' me\nSex game kinky, niggas call me Pinky\nFuck with presidents, I am Nicki Lewinsky\n\n[Chorus: Gucci Mane]\nShe's a very freaky girl, don't bring her to mama\nFirst you get her name, then you get her number\nThen you get some brain in the front seat of the Hummer\nThen you get some brain in the front seat of the Hummer\n\n[Verse 2: Lil Kim]\nI'm a very freaky gurl, very freaky gurl, gurl\nVery freaky gurl, very freaky gurl, gurl\nVery freaky gurl, very freaky gurl, gurl\nOhhh, you want a freaky girl? Welcome to Kimmy's world\nYou ain't gon' wanna leave, it's like a kid at Disney World\nMy deep throat have you squirtin' like a water gun\nCoochie overflowin' like somebody let the faucet run\nBust one nut, I ain't done, I got more to come\nFriends tell 'em more to come, we gon have some orgy fun, Yeaaaah\nChew on me like some bubble gum\nMight lick you like a lollipop once you taste my honey bun\nIt's our lil' secret, just like my underwear\nYou know pain is pleasure, can you make me shed a tear? Smack my ass, grab my neck, got em cummin' everywhere\nI'm a freak so I don't care, just don't get none in my hair\nNow he callin' me wifey and he wanna introduce me\nTakin' me on shopping sprees he wanna buy me Gucci (Gucci)\nZoom like Boosie on the back of his Suzuki and I ain't even sex em'\nAll I did was let him eat my... coochie!\n\n[Chorus: Gucci Mane]\nShe's a very freaky girl, don't bring her to mama\nFirst you get her name, then you get her number\nThen you get some brain in the front seat of the Hummer\nThen you get some brain in the front seat of the Hummer\nVery freaky girl, don't bring her to mama\nFirst you get her name, then you get her number\nThen you get some brain in the front seat of the Hummer\nThen you get some brain in the front seat of the Hummer"}], "artist": "Nicki Minaj"}