{"artist": "Vado", "songs": [{"title": "No Turning Back", "year": null, "lyrics": "[Intro: Vado]\nMost hated\nBank Sinatra\n\n[Verse 1: Vado]\nI keep a swisher 40 de-roll\nWalking down the block like Im bishop 40 below\nTell em get your forty of those\nWe hit em before they close\nA quarter if its forties pros\nIm on T im gone with those\nRollie arm is froze with no heat Ma its cold\nPlayed the block like Ibaka's Role\nMe and G wal like OG, one and Hov\nEvery brick we forty-forty on it\n20 go to the click make sure that shorty want it\nAin't maddest lips when it lip\nLike when you blow a trumpet\nDont want your shift on the strip\nMake sure you throw him something\nRueger tight, none of my shooters fight\nThey stop do the dice I win some lose a life\nMy muta light boy I better and I dont do the ice\nMy shoes is Mike, rugby sweater with Freddy Krueger stripes\n\n[Hook: Vado]\nNo Turning back Im here now\nRugby shut down, what you gon wear now?\nNigga fuck style cause I dont care now\nBut let me spit some shit to bring your ear down\n\n[Verse 2: Vado]\nWhats all the commotion?\nPut the pier in the ocean\nDress to sensitive put away your emotions\nHit with the vulture and I dont care if you focus\nClip and the tray life like roaches where the smokey?\nWhen the work run then holla at me\nYou need work done? then holla at me\nWord to my first son, you white collar happy\nPut my paws on the powder then call that powder scrappy\nTheres no love in hip hop\nPunch his throne I bombs it like the brother of Hip Hop\nStep down off the yacht LV duffle with flip flops\nSwitch the hustle I dip locks\nHope you muscle in tip top\nRan outta squares you outta shape\nLike years me mask off and take what out the safe\nWe only let gats off when things get out of place\nBy the waste my niggas keep it like shit is not a case\n\n[Hook]\n\n[Verse 3: Vado]\nTalk my nigga\nYeah I was running things on this court\nYa'll wouldn't be able to walk my nigga\nWhat you thought my nigga?\nWonder why your money ain't tall?\nThats cause your mind think short my nigga\nFought my nigga\nWho? what you do?\nYou's was never that\nWho you shoot?\nWho you screw?\nLet me measure that\nWhich you move? One or Two?\nWhere ya fellas at?\nHit your crew, one or two boy\n\n[Hook]", "album": "Slime Flu 3", "image": "https://images.genius.com/8066555d470cc6c865fd602c0153957a.500x500x1.jpg"}]}