{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "Intro III", "album": "Perception", "year": "2017-10-06", "lyrics": "[Verse: Fear & NF]\nWhat, are you scared of me? That's embarassin'\nIf it wasn't for me, you would've never wrote Therapy\nI've been here for you, but how come you're never there for me?\nIt's a little bit twisted, but I miss when you and I had scary dreams\nI don't really wanna talk about it!\nWell, that's too bad now, Nate\nShut up!\nNow, where were we?\nWell, back in the day when\nYou and I had it all mapped out in the basement\nCryin' in your room like a baby\n\"I wish mom was here!\"\nWe all do so we wouldn't have to hear about it every single record\nYou don't really wanna change me\nYeah, I'm the one that made this happen\nDo you really wanna get rid of your main attraction?\nLet's pack our bags and go back to Gladwin now\nYeah, it's time for the third record\nAnd you know I got the content\nI don't wanna make you nervous\nBut it ain't like it used to be, we got a lotta people watchin'\nYou told me that you don't want me in your life, that's pretty hard to digest\nAnd I told you I'd leave when we die, and we ain't died yet\nTherapy Session was beautiful, Nate, but I'm wonderin' what's comin' next\nYeah, get that stupid hat off of your head when I'm talkin' to you, you hear what I said?\nYou don't like the prison I built you?\nYeah, you wanna know what the funny thing is?\nYou keep on talkin' to me like a stranger, but we've been together since you were a kid (Kid), yeah\nTook us from a no-name, told you everything was okay\nNow you tryna cut me out of it like I ain't never been a part of it, I am the heart of it, I made this whole thing\nYeah, I put us on the dope stage, you must have no brain\nWhat's the point of having guns if you can't aim?\nWhat's the point of havin' blood with no veins?\nWhat's the point of havin' love with no pain?\nWhat I'm sayin' is me without you doesn't make any sense\nI know I'm intense and controlling, but you need to learn how to cope with it, that's just the way that it is\nIf you didn't want me to live in your house, you shouldn't have let me move in\nIt's comfortable here and I like it, I got my own room and everything, it don't get better than this\nYou say you wanna own your life, then wake up and take your own advice\nYou just mad 'cause you know I'm right\nYeah, I'm flattered you put me in Mansion, but you should've told 'em right\nHold your hands on the coldest nights\nYou didn't tell 'em 'bout the times you and I used to hold the mic\nI mean, what are you, outta your mind?\n'Cause both of us will be, come on, let's go outside!\nIs this what you wanted?\nBoth of us out in the open? Let's do it then!\nI mean, why are you doin' this?\nI know that you're mad, but I'm not in the mood for this\nWe got a record to drop\nSo why you actin' like I'm not a part of it?\nAye, where is my shovel at?\nProlly out back—where it always is\nYou can't get rid of all of me!\nI'm the reason why—\nNah, shut up, I don't wanna hear another sentence\nHey, I'm NF\n\"Is it me or the fear talkin'?\" Ha! What a dumb question!\nYeah, it's real music 'til the day we die, right?\nYeah, ain't that the slogan, Nathan?\nThought I told you to keep your mouth shut\nI mean, so what? You know I never listen\nLet me guess, we gon' dig a hole, kill the track, and prolly put a beat in it\nRap about it for like three minutes\nAyy, that's pretty deep, isn't it?\nWait a minute, you don't really think for a second that you're puttin' me in this?\nNo, of course not, just a little deeper then we'll go inside and we can stop diggin' (Woo)\nYou had me scared for a second, I thought we were diggin' my grave [thunk]\nWe did, what, you don't like bein' afraid?\nHere's a dose of your own medicine\nWhat, you don't like how it tastes?\nMy therapist told me don't bury my issues, but I'ma be honest, man, I'm feelin' great! (Great)\nI think it's only right we go back to where you were created\nI wrote a song for Johnny without you, but he ain't gon' like it, let's see how he takes it (Takes it)\nHe probably don't even remember us, does he?\nI wish I was buryin' anger\nBut both of us know I'ma need him for that song, he still lives in the basement\nAlmost done, shoulda done this a year ago, I don't know why I waited\nYou know how I get, I put everything off in my personal life, you hear what I'm sayin'?\nThat was a joke, yeah, it's hilarious, ain't it?\nYou'll spend the rest of your life in my backyard or back of my mind, depends how you see it\nPut the shovel away, time to go back in the house now, you'll be out in a week\nTellin' me you want your room back, that's funny; what, you ain't got nowhere to sleep?\nI'ma just look out the window and laugh at you, this is crazy to me\n'Cause I thought you had me in prison this whole time, but I'm the one holdin' the keys"}], "artist": "NF"}