{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Dirty Money", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Pusha T]\nYo wattup ma'\nI got a pocket full of stinky's lets go spend these right quick\n\n[Girl]\nWhats that?\n\n[Hook: Pusha T]\nAll my fly bitches like (dirty money, dirty money)\nAll my stripper bitches like (dirty money, dirty money)\nAll my college hoes like (dirty money, dirty money)\nDon't it spend so right? (dirty money, dirty money)\nNow lets go shopping, lets go chill\nLet's go buy them new Louboutin heels\nAss in La Perla, ears full of pearls\nDamn dirty money know how to treat the girls\n\n[Verse 1: Pusha T]\nGive a little - take a little, my check the dealy\nMost niggas is will-not's, you're dealing with a willy\n3-D faces on them crisp new billies\nGot Benji lookin all googley-eyed and silly\nThe glitter chill got ya mind seein milli-mill's\nI'm 7 figure, the bigger, your thoughts are literal\nSee I don't blame ya, cashmeres that you feels\nPicturing the fortune, you just tryna spin the wheel\nBrain like Teri, face like Eva\nI ain't forgettin them other Housewive's neither\nTwo-seaters, back in the trunk, 2 feevas\nWe stayin up till 2 a.m.to watch Cheaters\nAs long as I'm nice with the flame and the flass\nI don't mind keepin you up on them must-have's\nPito pumps, Gucci slouch bags\nNow tell me, is that dirty money really that bad?\n\n[Hook: Pusha T]\nAll my fly bitches like (dirty money, dirty money)\nAll my stripper bitches like (dirty money, dirty money)\nAll my college hoes like (dirty money, dirty money)\nDon't it spend so right? (dirty money, dirty money)\nNow lets go shopping, lets go chill\nLet's go buy them new Louboutin heels\nAss in La Perla, ears full of pearls\nDamn dirty money know how to treat the girls\n\n[Verse 2: Malice]\nWe could trick tuiton, you could be the vixen\nYou could front for ya girlfriends, I ain't trippin'\nYou done got you a rapper, I see ya vision\nAnd one of the best too, that's ambition\nYou could tell me 'bout ya day, I pretend I listen\nAnd you ain't gotta love me, just be convincin'\nI don't ask much, some ashes on the cuff\nAnd that silver bullet, automatic or the clutch\nNah mama hush, you ain't even gotta speak\nJus put it on ya charge, check makes ya feet\nCompliments of me, take the bitter with the sweet\nAnd we can get this money like its falling outta tree\nCome spend a dollar, yea, bathe in it, walla\n17-5 for the low, tell 'em \"Holla\"\nLove you in Escada, Jimmy Choo, Prada\nSnow White ya life, hows that for starters?\n\n[Hook: Pusha T]\nAll my fly bitches like (dirty money, dirty money)\nAll my stripper bitches like (dirty money, dirty money)\nAll my college hoes like (dirty money, dirty money)\nDon't it spend so right? (dirty money, dirty money)\nNow lets go shopping, lets go chill\nLet's go buy them new Louboutin heels\nAss in La Perla, ears full of pearls\nDamn dirty money know how to treat the girls\n\n[Verse 3: Pusha T]\nTo my fly ghetto bitches with their hair-shop-talk\nBraggin to their hair-dresser 'bout that shit he bought\nTo my South Beach bitches with that sassy walk\nWho ain't tryna hear nuttin if you don't ride Porsche\nTo my get-money niggas gettin paper fa' sho\nTrickin' grands up in Louis for the love of the sport\nI tell ya, get money money, take money money, uh\nDope money money is great money money, what\n\n[Verse 4: Malice]\nBefore I'mma bicker with ya, ma, I'mma switch ya\nI fly 'em in quick, I fly 'em out even quicker\nBy no means, am I in love with a stripper\nYou understand that then you fit in the glass slipper\nTravelin' broads, sittin' in G-4's\nChangin' the weather, when it rains, it pours\nAnd the crib is ajoined with French doors\nYou rock with ya boy then anything is yours\n\n[Hook: Pusha T]\nAll my fly bitches like (dirty money, dirty money)\nAll my stripper bitches like (dirty money, dirty money)\nAll my college hoes like (dirty money, dirty money)\nDon't it spend so right? (dirty money, dirty money)\nNow lets go shopping, lets go chill\nLet's go buy them new Louboutin heels\nAss in La Perla, ears full of pearls\nDamn dirty money know how to treat the girls"}], "artist": "Clipse"}