{"artist": "Angie Martinez", "songs": [{"title": "Mi Amor", "image": "https://images.genius.com/e62fa9bb0cec22251790f2012612bbd7.300x300x1.jpg", "album": "Up Close and Personal", "lyrics": "[Hook: Jay-Z (Angie Martinez)]\nHow you say my love in spanish? (Mi amor)\n(How you say my love in thug) Can I hit it raw?\nIn the backseat of my jeep, or maybe on the floor\n(Easy papi) Nah mami, teach me more\n(Tr'teme especial means treat me special)\nI ain't got no time for that now, dame un beso\n(Wanna keep a good girl like I told you before)\n(Easy papi) Yeah, teach me more\n\n[Verse One: Jay-Z]\nI like fast cars, I love faster chicks\nYou don't need a small waist, I take ass and tits\nLove chicks that deep throat, love bein left alone\nOn a Sunday afternoon with the remote\nLove havin my cake plus eatin it too\nShit, I got cake what the fuck I'm 'posed to do\nLike chicks to dress, but I love a good shoe\nSophisticated mama with love for the hood too\nLove sexin girls on that boricua shit\nLove black girls that's when the Levi's fit\nChicks that play hard to get on that Aaliyah shit\nIf at first I don't succeed, then believe I split\nCan you blame me? Young buck, dirty-ass pops trained me\nMoms allowed it, daddy was about it (Bout it)\nGame got inherited\nMama said if you find love you better cherish it\nTeach me!\n\n[Hook]\n\n[Verse Two: Angie Martinez]\nI like to slow dance, I like to romance\nI like to.. stroll through the park holdin hands\nAsk me how my day was, tell me \"Ma lookin pretty\"\nOn Sundays in the cut watchin \"Sex and the City\"\nHavin long talks and good lovin in the mornin\nWalk them dogs when my body is callin\nFlesh air force cuts a wound with a line\nNo stress of course, cause I don't have the time\nLike to wine and dine but please hold your liquor, cuz\nI'm rollin with ya and I hate a silly nigga\nLike 'em rough and rugged, love it when you tug it\nYou buggin out of line on that thug shit is nothin\nDealt with cats before that I had to train\nDealt with cats that's poor and a cat with fame\nOne who played basketball and I had more game\nSo por favor, papi stay in your lane\n\n[Hook]", "year": "2001-01-01"}]}