{"songs": [{"title": "Hola Amigo", "album": null, "year": null, "image": "https://images.genius.com/bb479613ff6939c7c3a3483470375719.1000x1000x1.png", "lyrics": "Lyrics from Snippets\n\n[Verse 1: Lil Tecca]\n-[?]\nYou fuck with the wrong nigga, yeah, he [?]\nEvery line, I'm 'boutta punch him\nLook, look, don't touch it\nYou brought one, I brought a bunch in\nAll white cast like The Brady Bunch\nI'on even like rappin', this shit ain't fun, yeah\nUh, but I'm still number one, huh\nI was born number one, yeah\nFinessin' these niggas for fun\nBro got a Glock and it came wit' a drum\nI know I'm 'bout to blow-ow-ow, are you dumb?\nI can't fuck these bitches, nigga, like a nun\nYou niggas is sweet like a honey bun\nYou niggas is sweet like a Jolly Rancher\nAnd y'all gon' turn a nigga to a prancer\nShe gettin' nasty like Dirty Diana\nThat shorty, she suckin' and fuckin' on camera\nYou talkin' to me? Better have your man\nThe dick give her nutrients like a banana\nI clean the block, nigga, like a janitor\nShout out the cashier 'cause they ran it up\nGot too much racks, gotta band it up\nHe talkin' shit on my live, I'ma ban him, uh\nOff 30 milligrams just for the stamina\nShe givin' neck, don't bite like Dracula\nHe talkin' that hot, nigga, we gon' pack him up\nGot too many cards, nigga, like it's Pokémon\nGot hot as the block, can't think 'bout another bond\nI can't even drive, I went bought another car\nI been that nigga, man, he said I was Hollywood\nGot a 'lil Arab bitch from Bollywood\n\n[Verse 2: XanMan]\nAyy, hola amigo, fuck is you [?]?\nMy OG still got [?] like a [?]\nThat chop a nigga, nigga pray like a [?]\nBitch, I got the stick from Hamilton\nHad it first, nigga, I was in the tenth grade\nI'm really out here, all these niggas bitch made\nI got the shit [?] like a sensei\nMy niggas be shootin' shit like they ain't phased\n[?] on that nigga, give him a ten fade\nGlock smashin', [?] a bitch, call her [?]\nShoot everybody, I ain't [?]\n[?], you missed, what happenin'?\nMy [?] a blood, he got killed in action\nShooter with dreads, XXXTENTACION\n[?], I gave him aspirin"}], "artist": "Lil Tecca"}