{"songs": [{"title": "Glenwood", "album": null, "year": "2009-06-02", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Intro: Kanye West]\nYeah\nOkay\nAyy!\n\n[Verse 1: Kanye West]\nAyo, poppin' willy shit, let's see who really rich\nY'all ride the beat, I'm about to pop a wheelie, bitch\nReally this, I came up with on some silly shit\nLook how good it is! I'll show you who you dealin with\nY'all illy? I'm iller, I'm from Illinois\nYo, Big Sean, why don't you call your Chi-Town boys?\nShow me where they at, I will destroy\nI'm 'bout to fuck somethin up, I might as well call the lawyer\nG.O.O.D. Music run this bitch? Yes, we do\nI know you thinking, \"Damn, I wish 'Ye would bless me too\"\nIn the booth, I use the restroom; It's best you...\nGon' head and kiss the Jesus piece 'cause I just blessed you, unh!\nAnd holy water, odds against Ye, it's slaughter\nEver since I opened up that Midnight Marauders\nNow it's gon be a problem like a brand new installment\nFrom the late, great, Mr. Christopher Wallace\nThey call us pompous; can I be honest?\nHonestly, modesty wasn't ever in my policy\nApology accepted, you ain't say it? Shoulda said it\nAs soon as I did it, all that bullshit was deaded\n\n[Hook: Big Sean & Kanye West]\n(Get it?) Yup, yup, I get it\nG.O.O.D. Music, bitch, ain't nobody fuckin with it\nAnd nah, nah, they can't really do it how we did it\nIt's G.O.O.D. Music bitch, ain't nobody fuckin with it\n\n[Verse 2: Big Sean]\nB.I.G. is, \"Gee, whiz!\" He is...\nSure he would be the man, ever since a fetus\nI know it's niggas prayin on my downfall and weak shit\nBut I'm never going downhill, even on ski trips\nI am the D, come and make an observation\nIt seem like the murder rate is higher than the population\nDamn! I bet you just as sweet as you look, bitch\nYou are just Bushwick, I'm 8-foot-6\nI'm so up-up on it like insomniacs\nG.O.O.D. Music, man, 'Ye, where he find me at?\nI'm so dominant, I'm so confident\nThat I'ma get a compliment on any fucking continent\nFrom freaks that's fine as shit, without this designer shit\nBig business, respect my conglomerate\nGirls get check, but my bank get check more\nWhenever niggas check up, I'm who they check for\nOr have a check for; Louie V shit\nSo much Damier print, fuck around and play check-ors\nAnd these rappers get critical damages\nBut I rap so good, it's no need for bandages\nYou the man in your city? Cool\nWhen am I performing? Right after you\nI'm sorry but you gone be ranked right after two\n'Cause, I'm first place and second is my crew\nSo move, bitch! Yeah"}], "artist": "Big Sean"}