{"songs": [{"title": "Bitchslap! (bonus beat)", "image": "https://s3.amazonaws.com/rapgenius/brotherali-flag-1.jpg", "lyrics": "Yo Ant, kick the beat you just kicked a little while ago...\n\n[ VERSE 1 ]\nI bitchslap rappers so hard it give em whiplash\nYou fuckin with sleeveless t-shirts, where your tricks at?\nLook left, look right, wait, where your chick at?\nShe findin out she walk and talk right, provide dick pipe\nI'm a big baller, shot caller, all a y'all are runnin laps\nLet me tell you little fuckers a story walkin out\nYou probably think you're somebody big talkin loud\nYou're transparent, I been starin through your Karl Kani\nArt imitates life imitates art\nGet it straight, slice through the mic, pourin out my heart\nWhen it's late night we litter the landscape\nAnimate our dead opposition to get one last phoney handshake\nI read a lot and write a lot, empty my pockets at the giro shop\nHit the cash machine for some green, maybe a ten spot\nI said giro cause my Greek's a little broken\nBut my four-letter French works fine if you're provokin\n\n[ Chorus ]\nAnd we killers in the morning, killers in the evening\nWake up and we yawnin, happy we still breathin\nGot one longin, that's to keep eatin\nWe here to stay and we ain't leavin\n\n(Rock y'all)\n(Everything gonna be alright)\n\n[ VERSE 2 ]\nI'm a cross between John Gotti and Mahatma Ghandi\nLook between pimp and square, you probably find me\nThere, in vain I solemnly swear\nI'm a Guardian Angel with gang signs in the air\nI spent too much time fuckin with sorry sobs\nTreatin beats like bitches, flippin ménage à trois's\nYou ain't tryin to see us angry, pop, we already hard\nFuckin the the diplomats'll get you horribly scarred\nFrom the cat behind the wall who play handball in the yard\nTo the one that run the block as head baller in charge\nTo the brothers with the kufis on that walk with the gods\nMission Hill, Caprini Green, all ghetto scenery\nEvery city got us beaten up, down tryin creepin up\nSoundbombing people, what? Till we get a equal cut\nWe come through straight smashin on the haters\nWitness the world, the Rhymesayers\n\n[ Chorus ]\n(Rock y'all)\n(Everything gonna be alright)\n\n[ VERSE 3 ]\nOften the brain runs\nAnd expresses itself in words, sometimes profane ones\nThat's when it first occurred to me where the pain comes\nFrom, page one in my rhyme book\nIf you listen closely you can picture how my line looks\nYou presently pressed to be restin next to me\nThe best of me molestin destiny wrestlin with ecstacy\nThe recipe for immoratlity\nFlows actually be on the malls and factories\nOf urban life with the laws of gravity\nAudacity, you got a lot of it\nCommon sense should tell you not to rap against\nMy obvious dominance\nMy real lilfe size is bigger than your confidence\n\n[ Chorus ]", "year": null, "album": null}], "artist": "Brother Ali"}