{"songs": [{"album": "Trouble Man: Heavy Is the Head", "image": "https://images.genius.com/a1b5deb88a250e321b6319b2dc6d74f2.1000x1000x1.jpg", "year": "2012-12-18", "title": "Check This, Dig That", "lyrics": "[Intro: T.I.]\nYeah, hey\nYeah, hey\nHey\nI say now check this, dig that\nDig that\nDig that\nHey\n\n[Chorus: T.I.]\nCheck this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nYou broke I can fix that, yeah\nHey, hey, hey\nI say now check this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nHey, come and see me, I can fix that, yeah\nHey, hey, gettin' money, nigga\n\n[Verse 1: T.I.]\nI'm gettin' my hustle on and I'm rollin', got whatever gettin' that paper\nFresh out of prison, I'm glowin', middle finger raised to them haters\nGet your chick before she gets stolen, one of my partner surely may take her\nSend her back to you, pussy swollen, so it's messed up just like her make up\nGot an elephant memory, it's flawless, I remember all of y'all who was talkin'\nGot a good mind to run in your office, whoop your ass in front of your bosses\nMy partner died in my honor, I'm responsible for his mama\nHis daughter too, bet you she can go whatever college she wanna\nStill wrap rubberbands in my bank roll, broke is somethin' I can't go\nBitches yellin' out I'm the shit, I'm like tell me somethin' I ain't know\nMy broker called said my stocks is up 20% so my profits increasin' even in my absence so my attitude is obnoxious\nContract almost expired, they get one more album off it\nBetter go tell Edgar Bronfman make my contract big as Bosh's\nGot bitches on my side shit, and feds already watchin'\nJust one more year of paper and I'm back to blowin' broccoli, ay!\n\n[Chorus: T.I.]\nCheck this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nYou broke I can fix that, yeah\nHey, hey, hey\nI say now check this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nHey, come and see me, I can fix that, yeah\nHey, hey, gettin' money, nigga\n\n[Verse 2: Trae Tha Truth]\nI'm the king of Texas, I put on\nOn the block, tryna' put the whole hood on\nStay stiff, when them other niggas stood wrong\nStreet shit, only thing a nigga stood on\nMy niggas on Death Row, same shit like Suge\nAttitude fucked, then shit been good\nTell 'em I got a million, ain't never gotta worry 'bout a thing\nI represent it the best I could\nYeah, I get paid when I rap\nShit get flipped then I'm back to the trap\nTrunk locked up with somethin' that clap\nIf you don't get that, then bitch'll get slapped\nBitch, I pop her, get this whopper, find me in the hood, same things I got shut up\nI won't be stopped, probably why you niggas hate\nMoney gettin' big like look what I got up\nYou ain't seen that Maybach fella with that drop?\nChain stay icy, bitch, I stay hot\nYeah, I'm Truth, that's what you not\nIt's my time, fuck your plot\nI got my team strong and my guns loaded\nCity mine, the whole hood voted\nThis murda bidness, they know I showed it\nSuicide, both doors floated\nMe and Tip, G-D-O-D, got that work, C-O-D\nYou've been livin' free, you got a P-F-E\nThat talkin' cool but ain't shit to me\nBroke, I'll be damned if I go back\nThis Hustle Gang and you know that\nWe earned respect so you owe that\nWith the middle finger like hold that!\n\n[Chorus: T.I.]\nCheck this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nYou broke I can fix that, yeah\nHey, hey, hey\nI say now check this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nHey, come and see me, I can fix that, yeah\nHey, hey, gettin' money, nigga\n\n[Verse 3: T.I.]\nSo many lanes with so much to say\nBut that's another topic for another day\nThey know face to face I clown nigga\nWhy you ain't talk shit now nigga?\nDon't try to dap me up, you ain't down wit' us\nAm I angry? Bitch, don't I sound bitter?\n'Cause I'm so sincere\nIt's so severe that you know through all that I persevere\nI die tomorrow, my hopes up there will be on some other level, my ghost'll fear\nI got no compassion, no understandin' like y'all bitch asses, so underhanded\nMy rational is all reprimanded, just smash the gas, take full advantage\nMy patience short and my temper bad\nSo you'll find me everywhere you ain't at\nThe best you got, you better bring that\nYou wanna take me out? You can't fake me out\nWhen they let me out, you wanna help me out\nNigga did these moves, come check me out\nMe and Doug in the drop-top Bent' we are headed to the bank with a check we got\nOne thing, ain't no question 'bout it\nIf not more, I'm just as hot\nOkay, scratch that, I'm spazzin' out\nBig bank rolls I'm passin' out\nI hug your hoe, she passin' out\nBefore she hit the ground, I'm mashin' out\nI'm bossin' up and I'm stayin' down\nGot racks on racks just layin' round\nBig bank, nigga, ain't no playin' 'round\nYou wasn't checkin' me then, I bet ya did now\n\n[Chorus: T.I.]\nHey, check this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nYou broke I can fix that, yeah\nHey, hey, hey\nI say now check this, dig that\nYou know I be gettin' that money in them big stacks\nYou broke I can fix that, yeah\nHey, come and see me, I can fix that, yeah\nHey, hey, gettin' money, nigga"}], "artist": "T.I."}