{"artist": "Vado", "songs": [{"title": "Mobb Shhh", "year": null, "lyrics": "[Intro]\nAnd all of you shrug, right? Except some of your friends of yours and one day I might do something that upset you and you hit me. Then you become boss. My friends they hit you, and somebody else becomes boss. And on, and on, and on. You know what I call that? Stupid, very very stupid\n\nSo if you ain't doing it, who's gonna be...\n\nNobody\n\n[Verse 1: Vado]\nJust landed\nStepped out, red carpet\nQuestions asked, press flash, I'm the next target\nFlex barking, about to sign to the best market\nS parked it, key on me to push start it\nJust blew a grand in Houlihan\nServing us drinks, disturbing the peace like Luda fam\nSight clearer, in front of the mirror, like \"Who the man?\"\nYou the man where the cooler stand then do the damn (thing)\nFarazino and Ferragamo the shoe is tanned\nIf he don't take his hand out his pocket you shoot his man\nI've been around for a while, I ain't new to Cam\nOr new to the cam, since Mad Ciphers I knew the plan (early)\nKnew the right people to be around\nListen and learn, then my turn came, I see it now\nIt's time to earn when the birds came, we need a town\nA key, a pound, and the price stay, we don't bring it down\n\n[Verse 2: Vado]\nI'm so sick of them, talking Slick Rick to them\nName your top 10 I got at least 6 of them\nThat attach-dough, velcro need to stick with him\nStart playing your role\nMaybe could make a flick with him\nSuit and tie, mai tais, you have a sip with him\nCan't do shit to him, I know it's hard to get to him\nMeet his underboss, captain if you want to talk\nBefore he had him a plate, he was eating from other forks\nThat took a care of disease is what his mother caught\nSister drive around yelling look what her brother bought\nThey hate that I'm all like what these fuckers thought\nHarlem nigga with more sponsors than a Rucker court\nMy math equivalent, 10% for the middleman\nIgnorant but militant\nKill your miss, snatch your siblings\nStacks in the Timberland\nBoxes, packs, in the ceilings them, concealing them\nAsk an innocent man, ask a gentleman\n\n[Verse 3: Cam'ron]\nDon Vito, Don Carlo, Castellano\nLook, kneel over, be on point like guarding Rondo\nGotti whacked him, body bagged him\nTook the family over\nWhere you running a racket dig, can't be chocha\nCandynovas, owe me money? Can't be over\nIn the sands with girls\nHit it harder than Sammy Sosa\nLifestyle, quite foul, never made it up\nImmunity, since 20, my community, gated up\nSpray them up, like alcohol, play the cut\nMade the cut, whole, half-quarters, orders, break them up\nTell him chill before we break him up\nThen wake him up\nFuck toys, wakes are us\nChampagne from waitresses\nGucci, Louis, monogram the D square\nBe clear, we here, and gonna be, each year\nSee dear, Killa, keep the streets near\nPeace gear, on the ave, with chicks in beach chairs", "album": "Boss of All Bosses 3.0", "image": "https://images.genius.com/542582f911fe2c36f0aa620e94d7b8da.500x500x1.jpg"}]}