{"songs": [{"album": "The World Ain’t Enuff", "image": "https://images.genius.com/aacbaca3b07ab6c68caf4ac5bedb0d81.776x768x1.jpg", "year": "2000-09-19", "title": "Tela", "lyrics": "[Intro]\nC-C\nIt's 2000 sir\nThe World Ain't Enuff\nC-C Yeah\nRight Here (Lock Down)\nTake it back, Take it to the streets know what I'm saying\nUnderstand Me\n\n[Verse 1]\nTela! Who is the nigga in the beam with them thangs? Tela!\nWho is the nigga that leans on your brains? Tela!\nWho is the nigga with the quality ice? Tela!\nHollering out fuck the price! Tela!\nWho is the nigga in the wide body frame? Tela!\nWho is the nigga see reflections off the chain? Tela!\nWho is the nigga that act bad with the laws?\nKeep a pistol in his draws and act bad with your broads. Tela!\nWho is the nigga that'll never be broke? Tela!\nWho is the nigga take sales like coke? Tela!\nWho is the nigga that'll hide the dope?\nSo real in the rims of a Seville and find the folks. Tela!\nWho is the nigga that gets fast like cast? Tela!\nWho is the nigga say splash on your bitch ass? TTela!ela\nWho is the nigga that's doing his thing?\nSince 89' I been pinkied the ring know what I mean? Bling! Tela!\n\n[Chorus]\nYa'll Want Who? Tela! x8\n\n[Verse 2]\nWho is the nigga that rush the shows with dimes? Tela!\nWho is the nigga that dust your nose like lines? Tela!\nWho is the nigga ride the Jag with three pounds? Tela!\nPut your ass where you can't be found? Tela!\nWho is the nigga stay sprayed all day? Tela!\nWho is the nigga say fuck platinum shades?\nWho is the nigga say put the ice in it?\nLet the lights hit it\nAnd look nice in it. Tela!\nWho is the nigga in the aqua-blue Gators? Tela!\nWho is the nigga that will hop through the haters? Tela!\nWho is the nigga that's defining thangs?\nFor ballers to do from splitting capers to big stangs. Tela!\nWho is the nigga say do true thangs? Tela!\nWho shot a video at Blue Flames? Tela!\nWho is the nigga that keeps it off the chain?\nAnd still let it rain, Hold up pimpin man you know me! Tela!\n\n[Chorus] x8\n\n[Verse 3]\nWho is the nigga see the sun in the south? Tela!\nWho is the nigga hundred guns in the house? Tela!\nWho is the nigga rock the tank with the mink? Tela!\nAnd leave the bank with the got damn sink? Tela!\nWho is the nigga that switch records labels? Tela!\nWho is the nigga say fuck em' if they ain't able? Tela!\nWho is the nigga that stay five deep\nWith top quality hoes that'll shoot up your Jeep? Tela!\nWho is the nigga that holds his own like the ace? Tela!\nWho on a song with Short and Face? Tela!\nWho is the nigga keep the snow in lumps?\nI get stopped by the pos and say go with the pumps. Tela!\nWho is the nigga to hot to swap it up? Tela!\nI say fuck it buy shit and Glock it up? Tela!\nWho is the nigga that did Sho Nuff'?\nI got Pac posted up tellin em Tossing it Up\n\n[Chorus to Fade]"}], "artist": "Tela"}