{"artist": "Cashisclay", "songs": [{"title": "Vs. Chosen [4tel-Finale - JBB 2013]", "album": "JBB 2013 - Viertelfinale", "year": "2013-06-02", "image": "https://images.genius.com/ae7929d4dcdc21628c7d16eea1a02858.1000x563x1.jpg", "lyrics": "[Part 1: Cashisclay]\nJetzt hast du all'n gezeigt, wie gut du Savas imitieren kannst\nDie Kunst des Bitens, frag Alligatoah nach nem Feature an\nHast du mit dei'm Billigrap die Opferrolle angepeilt?\nEy, heute fliegt der Fettsack raus - SpongeBozz gegen AHMED 2\nUnd ich weiß, wer der Spast hinter der Maske ist\nEs ist klar, dass du nicht Savas, sondern Butters bist\nEs tut schon weh, dass ich an dich diesen Beat verschwende\nChosen ist kein Richter nur der Pförtner vom Justizgelände\nHier kriegst du kein' Hype, wenn du nicht selbstironisch bist\nSpar dir die Runde, Chosen, ich wurd schon vom Playerboy gefickt\nPlatz acht war ungerechtfertigt und du wirst unterschätzt?\nAber rappst standard und die Videoidee hat Winin besser umgesetzt\nDreitausend Likes, hat sich gar nicht gelohnt\nAber Probs an deine Mütze von der Bahnhofsmission\nNach dem dritten Part wird an deiner Hand gelutscht\nAber Julien: Jetzt kommt erstmal deine Standardhook:\n\n[Hook: Joe-L]\nChosen, ich hab ein paar mal dein' Stream geguckt\nUnd frag mich \"Warum hat der Junge so viel Ritalin geschluckt?\"\nYeah, versteh nicht, was da bei dir los ist\nGeh auf \"Youjizz\", wie es aussieht, hast du Geier einfach Riesendruck\nKomm ans Tageslicht, wenn's dafür nicht zu spät ist\nLass die schwarzen Sachen an für dein eigenes Begräbnis\nDu kommst mit Waffenarsenal und tötest uns auf miese Tour?\nDu bösartiger Superheld, dich gibts bestimmt als Spielfigur\n\n[Part 2: Cashisclay]\nIn deiner Runde gab es raptechnisch nicht viel zu hol'n\nRechnet nach, der wär nicht mal im Turnier ohne sein Video\nEr will damit doch nur ablenken und Fehler kaschieren\nWozu punches kicken? Chosen hat ne Nebelmaschine\nEy, Juliens Fans niedermachen, wie behindert das ist\nDenn wenn er fragt, wer weiterkommen soll, dann stimmste für dich\nUnd wenn du ihn so verachtest - Was machst du dann in dem Turnier?\nDu ziehst dich selber doch g'rad daran hoch, was du kritisierst\nUnd schreibst, dass der kleine Eichelküsser plötzlich Eier hat\nDoch hast Hinterrücks die ander'n Teilnehmer nach Lines gefragt\nKrasser Scheiß, sowas nennst du \"jeden vernichten\"\nFür eine Hook von Favoriten jeden Penis zu wichsen\nAber [Piepen] macht das nicht gleich, wie viel Sperma du schluckst, Spast\nDann wolltest du von ihm noch wissen, wer meine Hook macht\nIst mir prinzipiell egal, ich halt von sowas nichts\nIch wusste dass du standard, aber nicht, dass du verlogen bist\n\n[Hook: Cashisclay]\nChosen, zeig mir meine Grenzen auf\nDu bist der beste im Turnier und nach dem Battle raus\nAber wenigstens nimmt deine Karriere kein' Schaden\nDenn das du das hier gewinnst, haben die wenigsten erwartet\nChosen, battle meine menschliche Seite\nWenn man anti alles ist, ist man am Ende alleine\nWeil du für ein Feature an Pimmeln saugst\nNehme ich dir deinen Kindheitstraum\nDenn schon nach Part eins war der Savas bitende\nMinderbemittelte Spinner raus\n\n[Part 3: Cashisclay]\n\"Deine Famegeilheit ist behinderter Dreck\nSag, was nützt dir Bekanntheit bei all den Kindern im Netz?\"\nDas ergibt sich von selbst, die Frage stellt sich mir nicht\nWarum machst du denn hier mit wenn nicht für Fame, Likes und Klicks?\n\"Ich richte Rapper hin mit tight gerappten Parts\nX Silben, x mal, diese Reimtechnik ist hart\"\nProbs, du konntest ein paar Technikpunkte einstecken\nAber wo war denn die Message in den Reimketten?\nZwanzig mal gedoubled, damit leute jede Line checken\nChosen, könntest du mich irgendwann mal live backen?\n\"Nein, Cashis, ich lass dich durch Parts verbrenn'\nFür all die making of's und Facebook-Posts und ask.fm\nAlter, was willst du erzähl'n? Rede über mein' Hype\nRede über meine Likes und du steckst Prügel dafür ein, ah\nMich trifft keine deiner überkrassen Strophen\nDoch nach dieser Hook bist du wieder grün hinter den Ohren\n\n[Hook: GReeeN](x2)\nEs herrscht dicke Luft auf einem Stuhl im Unterschlupf\nDenn Chosen quält Julien mit Mundgeruch\nWarum die Maske, fehlen dir ein paar Erbanlagen?\nDu reißt das Ruder nicht rum, nicht mal als Galeerensklave\n\n[Outro: Perplexx23]\nEyo Chosen, du Lauch... Ne, warte mal... Du bist ja gar nicht Chosen. Du bist ja Jestic\n\n[Part 1: Cashisclay]\nManchen Rappern fehlt es heute an krassen Lines und tighten Songs\nKein Problem, man hat mit ner Maske eine zweite Chance\nUnd man will 'nen Hype kriegen durch Internetbattles\nBis der Erste dann erfährt, wer dahinter steckt, Jestic\nFrüher wollte keiner hören, was du machst\nUnd mit Maske hat sich nichts geändert, töte dich, du Spast\nEin Casper-Verschnitt macht mit Doom-Maske Battlerap\nPeinlich für dich, deine Quali ist dein bester Track\nWie du Trauerfälle sammelst auf Piano in 'nen Song presst\nDu machst Geld mit dem Tod deines Freundes bei 'nem Contest\nJestic oder Chosen? Ich seh da kein' Unterschied, verdammt\nEy, dein alter Ego ist genauso uninteressant\nJestic war mal echt, Chosen hat nur Aufrufe gezählt\nUnd das JBB nimmt dir deine Authentizität\nDreitausend Likes durch gebitete Lines\nEy, Chosen und Jestic - Scheiße auf Scheiße\nDeine Maske fällt, Jestic, vorbei für dich\nDenn sie hilft einem nicht, wenn man scheiße ist\nIch lass Chosen, Gio und SpongeBozz links liegen\nCashisclay, das ist mein Griff nach dem Kingtitel\nDeine Maske fällt, Chosen, aus und vorbei\nDenn als Jestic verlierst du auch die letzte Aufmerksamkeit\nUnd während du an meiner Quali kleine Fehler suchst\nSehe ich in dir nur ein Freilos auf dem Weg zu Tune\n\n[Outro: Takt32]\nHi, Martin, ey, echt voll cool, wie du in der Quali krass wie 'n Killer guckst\nAber ey, wieso klaust du deiner Mutter die Maske aus'm Swingerklub?\nIch weiß, wieso, denn du scheiß Keck bist gar nicht \"Hightech hundert Bars\"\nDu Fotze bitest mit dei'm scheiß Rap nur styletechnisch Savas\nWas da los bei dein' Parts, Alter? Cashis meinte, du bist Grafikdesigner?\nWieso sind dann deine Texte so lahm und einseitig\nWie Partyflyer von der Einweihungsfeier?\nBesorg dir ma' 'n paar Eier, Alter, und wirf den Tanga und die Maske weg\nAlter, Martin\nNicht mal im Wörterbuch findest du Fotze Anerkennung und Respekt\nAlso erzähl mir nichts vom Battlerap\nSchreib lieber weiter Emotracks für deine Verwandten\nMitgefühl? Alter, bei mei'm Part ist sogar dieser\nSamuel Koch zum Klatschen aufgestanden\nUnd selbst wenn dir Cashis schon genug Arschtreter verpasst\nDu armseeliger Spast, geb ich deiner Mom nur aus Hass Deepthroat\nBis sie wie du 'n verfickten Sprachfehler hat\nAh, finds'te krass? Schreib ich dir auch mal 'n paar miese Bars\nWenn du so wie Cashis dafür einfach meine Therapiestund'n bezahlst\nAber ey, Jestic, ich hab's dir nie gesagt\nNächste Woche bin ich schon dein Stiefvater, du Arsch\nTakt32, du Fotze"}]}