{"artist": "Apathy", "songs": [{"title": "Blow Ya Head Off", "image": "https://images.genius.com/eabc32df5cd437dbcd4ace3344667e2b.300x300x1.jpg", "album": "Handshakes With Snakes", "lyrics": "[Verse 1: Apathy]\nIf I had a dollar bill for every sucker that I killed\nI'd be sitting on a mil blood and guts in my grill\nHot as hell, I wasn't born with the ability to chill\nI don't care what people say, Bun B think I'm trill\nKillmatic, spillin' acid out my mouth, I'm a dragon\nI'm snatching all your gold, I'm Bilbo Baggins\n(Is you the Hobbit, bitch?) I'm the king of the apocalypse\nConquerin' your planet while my posse push rocket ships\nMotherfucker I'm from H-E-Double Hockey Sticks\nTrainin' harder than the Russian in them Rocky flicks\nOverload the computer, overflowin' the sewer\nOverthrowin' the ruler, cut your fuckin'\nHead off like Tortuga, I'm white as a Stormtrooper\nIPhone porn shooter, dominating whore abuser\nWith power like the sun from 93 mil\nThis is how we kill from '93 til\nMurder, murder everything, nobody's standin'\nI'm a black hole in your soul slowly expandin'\nI'm the crop circle maker where the mothership's landing\nI'm a ghost who's lampin' in an abandoned mansion\nWatch the news while I drop these jewels\nI got tubes in my veins full of rocket fuel\nAnd for the flock who snooze, rock snot box of crews\nI pop shots at cops and cover forensic clues\n\n[Hook]\nAnd blow your head off, just for asking\n\"Who's the one rapping?\"\n(POO POW)\nCock back the hammer\nAnd blow your head off, just for asking\n\"Who's the one rapping?\"\n(POO POW)\nCock back the hammer\n\n[Verse 2: Marvalyss]\nI know you artists is breathin' but I'm the illest alive\nI'm J Dilla with bars, Gil Scott with the rhymes\nPaint pictures on the paper, this inoculate mind\nSlow down your train of thought, at the drop of a dime\nThis rhyme patterin', I'm staggerin' at top of the lines\nIs parallel to the crosshairs on the top of the 9\nI know you dyin' for a spot at the roster to shine\nCongrats, they lookin' for the next vagina to sign\nBeen in the game for some time, paid the usual dues\nI torch wedders, Bar Mitzvahs and funerals too\nI'm underground, ain't no other way of keepin' it true\nAnd when death is the consolation, it's a beautiful view\nEnigmatic, I spark in the booth and split static\nGet clipped from a pager with a twitch and drug habit\nBuck 50 with the RZA, I ain't talking bout the Abbot\nFrom a block away, I can knock the hinges off your casket\nIt's open door policy, modus operandi\nMy syllabus was scripted in the tombs on a land mine\nThese emcees don't want me to rap\nBut say nothin', powder-puffs don't want me to snap\nThe epicenter of atrocity, high velocity rocketry\nTommy John any jerk-off thinkin' he stoppin' me\nThe prophecy was properly pinned, you niggas scared of it\nAnd gun's in your mouth, like you talk arabic\n\n[Hook]\nAnd blow your head off, just for asking\n\"Who's the one rapping?\"\n(POO POW)\nCock back the hammer\nAnd blow your head off, just for asking\n\"Who's the one rapping?\"\n(POO POW)\nCock back the hammer\n\n[Verse 3: Blacastan]\nI'm the shogun's decapitator, detonator, activator\nBlaca-stanley Kubrick, outstanding imaginator\n(6 minutes, Blacastan, you're on)\nI crack your skull open, and serve your brain like flan\nWho shot ya? Bullets blow the fuse out your chakras\nLights out, still tryin' to rhyme when the mic's out\nChase you through the woods like Blair Witch\nGrab you by the hair bitch, then burn pentagrams on your queer tits\nSnatch your ghost right outta your torso\nWho da best? (Prime Minister Blac) Niggas I thought so\nMy waves stay spinnin' like the rims at a car show\nThe golden child lampin' in a temple in Tibet\nI'm Eddie Murphy spittin' game at a dragon silhouette\nI douse you, then burn your eyelids with cigarettes\nLike Colossus, my fists smash the globe like a comet\nIslamic, I wrote this with the passion of Muhammed\n\n[Hook]\nAnd blow your head off, just for asking\n\"Who's the one rapping?\"\n(POO POW)\nCock back the hammer\nAnd blow your head off, just for asking\n\"Who's the one rapping?\"\n(POO POW)\nCock back the hammer", "year": "2016-06-10"}]}