{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Hook]\nProud to be poor\nProud to be what? Proud to be who?\nPoor people, poor people, poor people, poor people\nProud to be poor\nProud to be what? Proud to be who?\nPoor people, poor people, poor, poor, poor people...\n\n[Verse 1]\nY'all don't want this, Rugged Man take no shit\nNotice you fake y'all just go where the dough is\nWe do this for the poor people cats that are homeless\nMy whole clique roll thick roll with strictly broke kids\nHopeless, y'all can't even see what the truth is\nWe ain't give two shits ruthless rugged\nNew shit, you ain't think that I can fuck you bitch\nYou ain't think you roll with us you'll be sucking dick\nLack politeness like this don't act like\nThe typical stereotype so what's whiteness\nBeing grimey greasy that's what being white is\nI got a bitch with a flat ass and I like it\nI like big breasts and I like to lick vaginas\nAnd fucking bitches on dumpsters in the back of diners\nEverything we do is white trashing razor blade\nTo the wrist cause we hate life with a passion\n\n[Hook]\n\n[Verse 2]\nI like being broke I like being dirty crusty\nProud to be poor I like being fat and ugly\nI like not succeeding I like beefing I like\nBleeding I like starting fights for no reason\nBad temper no patience shit on ya floor\nStick ya face in it make you lick the raisins\nEverybody on this hip hop dick makes me sick\nSeeing chicks like Mariah doing hip hop shit\nI don't care if they think I'm sexist I don't care\nIf I talk about the same shit on every record\nAnd with this gimmicky pop rapping the way that P. Diddy\nAnd Will Smith be getting jiggy\nI'd rather not take showers and smell shitty\nBorn to be poor we born poor we die poor\nI rhyme for the low down scummy\nI rhyme for the true hoodrats that ain't ashamed to look bummy\nUnderstand that, where ya man at we blow ya head\nBackwards we Linda Blair that we rugged man that\nYou better watch out, don't talk that you fake that\nFakeness take that with ya platinum plaques\n\n[Hook]\n\n[Bridge]\nIf you got no place to live, if you ain't got no job, if you ain't got no dough (Let me hear you say)\nI'm broke as fuck (I'm broke as fuck) I'm broke as fuck (I'm broke as fuck)\nIf you a piece of shit and you proud, and ya whole squad ain't worth shit\nAnd you ain't got shit (let me hear you say)\nI'm broke as fuck (I'm broke as fuck) I'm broke as fuck (I'm broke as fuck)\n\n[Hook]", "title": "Poor People", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}