{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/2fcd83a75bb86211e1a47f91e921d8f1.220x220x1.jpg", "title": "You Came Up", "album": "Capital Punishment", "lyrics": "[Intro: Noreaga & Big Pun]\nYo, what the deal, baby?\nI see ya, a'ight?\nStill not a player, but you still a hater\nHa! Pun here, where my horns at?\nWhere my horns?\n\n[Bridge: Big Pun & Noreaga]\nFa ye da da ya da da da da\nFa ye da da ya da da da\n\n[Chorus: Noreaga & Big Pun (x2)]\nPun, you came up\nWhat, what? Makin' it happen\nFrom rappin' on the corner to possibly goin' platinum\nBut when we roll, are you still ready to ride?\nYo, I'll be ready to ride and I'll be ready to die\n\n[Verse 1: Big Pun]\nAy-yo, my word is bond\nLong as I'm alive, I'mma put it on\nCoulda gone to jake, shit, thug nigga 'til I'm gone\nWeight of the Bronx, I'm flippin\nFive boroughs thoroughly reppin'\nLet's unite the city and step to the world as a weapon\n'Cause everybody's checkin' for Pun, second to none\n'Cause Latins goin' platinum was destined to come\nThe inevitable, heavenly, better than whatever you do\nWe eligible, TS is incredibly credible\nFor the revenue, we gettin' you open with lyrical dope\nAnd these breaths that are potent is like an injectional dose\nAnd it never quits\nTake it from TS's top terrorist\nRapper slash hijacker, bombin' tracks ever since\nI was young, I wasn't always Big Pun\nIt wasn't always this fun, ay-yo, I rose from the slums\nI had to pay my due, lay a few\nBut I ain't sayin' who, stayin' true to the game\nNo names, playin' it cool, just me and the crew\nHoldin' it down long as we round\nWe gonna keep sockin' it to you, like Homey D. Clown\nGoin' down like 'Pac, ready to ride or die, nigga\nLa-da-le-la-la-la-la-la\n\n[Chorus: Noreaga & Big Pun]\nPun, you came up\nWhat, what? Makin' it happen\nFrom rappin' on the corner to possibly goin' platinum\nBut when we roll, are you still ready to ride?\nYo, I'll be ready to ride and I'll be ready to die\n\n[Verse 2: Big Pun]\nAy-yo, ain't nothin' changed, I'm still the same\nThe way you remembered me, since the centipede\nHarder, big blacker, back in the 70's\nTry to remember me from my aggressive will\nThe way I kept it real is more important than any record deal\nI used to chill on the block with Cuban and Seis\nI still do, but now it's in the blue convertible eight-- fifty\nMy true niggas'll always be wit' me\nThe shifty kiss me, tell me they miss me, then try to diss me\n'Cause I'm a rispy, crispy for life, sixtie's the price\nAnother fifty for the Cuban twisted in ice\nNiggas is sheist, but I psych 'em out\nThough they like to doubt\nI make 'em all believers, once I let the Tyson out\n'Cause I can vouch for only a few, only the crew\nFrom the old school, I consider loyally true\nI morally grew from a fool to a scholar\nFollow the rules on how to spot a plotter\nThat's cool for a dollar\nI wanna holla at my peeps that's reppin' the streets\nWrestlin' the beast of chest, restin' in peace\nBlessin' my seeds and watchin' over us\n'Til I die, I'll align the souls with mine and shine for all of us\n\n[Chorus: Noreaga & Big Pun]\nPun, you came up\nWhat, what? Makin' it happen\nFrom rappin' on the corner to possibly goin' platinum\nBut when we roll, are you still ready to ride?\nYo, I'll be ready to ride and I'll be ready to die\n\n[Outro: Big Pun]\nFa ye da da ya da da da da\nFa ye da da ya da da da\nFa ye da da ya da da da da\nFor my thug niggas, thug niggas"}], "artist": "Big Pun"}