{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "BabyMan", "year": "2018-01-01", "album": "BabyMan", "lyrics": "Back in '86 right after crack came out, shortly after rap came out\nThe Mac came out. I had the doctors at the hospital shook man\nCause I came out with a Louis Vuitton bookbag. Opened the bookbag had a pound of haze and a Sony PSP with nine months worth of games. I popped out Rollo fitted, I was fly\nUmbilical cord already cut, I didn’t cry. I wasted no time\nI spit that game. I grabbed the baddest nurse I saw and asked her \"what was her name?\". Only five minutes old pulling hoes\nAnd she replied \"Boy you just a little guy, plus you can't even drive\nWell that's whatchu thought, fired up the Newport\nTried to grab the keys off the counter, but I was too short\nReached back into my Louis Vuitton bag, drunk the pint of Hennessy and rolled the purp that I had. Gone off that\nPut on my baby hat that they got me from baby Gap\nAnd told my daddy I’d be back\nGave my daddy dap, Chucked the deuce to mama\nLaced up my baby shelltoes aha-holla\nLeft the room, nurses runnin right behind me\nHopped on the elevator, took it to the lobby\nReached back into my Louis Vuitton bag\nGrabbed the 930 Nextel Chirp that I had\nCalled up Chris told him \"send me all his licks\"\nHe like \"who the fuck is this?\" I'm like \"It's BabyMan, bitch\"\nAt 20 minutes old I knew I had to get dough\nCalled the bus and told the driver \"let me off at the store\"\n\n[Hook] x4\nHe's just a baby\n\nUh. I didn't need pullups. Didn't use a bottle\nPissed behind the buildings. I ate at McDonald's\nMama's still confused, couldn’t quite understand it\nPopped out the womb on two shelltoes I landed\nFull set of teeth and I ain’t even a week old\nMoney on my mind since the start of my time\nA little misguided, standin in the store\nLike \"How the fuck can they sell blunt wraps, but can't sell dro?\"\n\"Chip you just a baby\" that’s what they tell me like I don't know\nGeorge Bush gots to go, I can't wait till I can vote\nI outside the store getting grown man cash\nWhatchu need? I got it all in my Louis Vuitton bag\nNiggas goin crazy when they see me like look y'all\nHe’s only a foot tall, the size of a football\nI laughed, and said \"If I open my bag, I got a black Mac that'll blow the skin off yo ass\". Ain't no goo-goo ga-ga's over here\nThey scared. Yeah, I might be a baby but your boy got a beard\nDon't expect to catch me in the stroller\nCause if I catch you slipping with the keys in the ignition, I'm rolling\nDown the alley striking down the white like I'm bowling\nClips know something like \"that little nigga holding\"\nIf it ain't about the dough, then what for?\nCalled the cab and told the driver \"let me off at the store\"\n\n[Hook] x4\nHe's just a baby\n\nOhhh\nHe's just a baby\nHe's just a baby"}]}