{"songs": [{"lyrics": "[Narrator]\nLet's describe a certain female\nA female with a disease of character and attitude\nIf you will a snob\nHowever in the view of NWA...\n\n[Verse 1: Ice Cube]\nA bitch is a bitch\nSo if I'm poor or rich\nI talk in the exact same pitch\nNow the title bitch don't apply to all women\nBut all women have a little bitch in 'em\nIt's like a disease that plagues their character\nTaking the women of America\nAnd it starts with the letter B\nIt makes a girl like that think she better than me (bitch)\nSee, some get mad and some just bear it\nBut, yo, if the shoe fits wear it\nIt makes 'em go deaf in the ear that's why\nWhen you say 'hi' she won't say 'hi'\nAre you the kind that think you're too damn fly?\nBitch eat shit and die\nIce Cube coming at you at a crazy pitch\n(Why?) I think a bitch is a bitch\n\n[Bitch]\nWho the fuck you think you calling a bitch you little sorry motherfucker\nI don't know who the fuck you think you talking to\nLet me tell you one motherfucking thing, I'm not no-\n\"Bitch, shut the fuck up\"\n\n[Verse 2: Ice Cube]\nYo, you can tell a girl that's out for the money\nShe look good and the bitch walk funny\nShe ain't no dummy, she's rather conniving\nYo bitch, fuck what I'm driving\nSee a young nigga that's striving\nYou're through without a BMW\nThat's why a bitch is a bitch I guess\nOr either P-M-S\nHere, test the girl that's kinda snobby\nAnd I bet you dissing niggas is her hobby\nAnd after she finished the test\nGrade today of B-I-T-C-H\nAnd watch her get mad 'cause she know it's true (she know it)\nBut a nigga like me'll say \"fuck you\"\nDo like Ice Cube, slam her ass in a ditch (word) (slam her ass)\n'Cause a bitch is a bitch\n\n[Bitch/Ice Cube]\n\"Why I gotta be a bitch?\"\nI ain't call you no bitch, if you listen to the goddamn song it'd tell you what a bitch is...\n\"Fuck the song 'cause I'm not no motherfucking bitch\"\nI didn't say you was a bitch, if you stop acting like a goddamn bitch\n\"Fuck you, little punk-ass little nigga\"\nFuck you, bitch! You sloppy-ass, scandalous-ass ho!\n\"Fuck you! Who the fuck you think you are?\"\nFuck you! Suck my dick, bitch! You scandalous-ass, doo-doo dog breath, stinking, ugly...\n\n[Verse 3: Ice Cube]\nI once knew a bitch who got slapped\n'Cause she played me like she was all that\nA bitch can be your best friend talking behind your back (yeah?)\nAbout who's fucking who and who's getting fat\nLook at yourself for me (look, bitch)\nNow do you fall in this category?\nOr you the kind that won't blink\n'Cause you don't think your shit stink\nLucky I haven't had a drink\n'Cause I'd down your ass\nThen I'd clown your ass\n'Cause the niggas I hang with ain't rich\nWe'll all say \"Fuck you bitch!\" (word)\nNow what can I do with a ho like you\nBend your ass over and then I'm through (get the fuck out)\n'Cause you see Ice Cube ain't taking no shit\n(Why?) 'Cause I think a bitch is a bitch\n\n[Narrator]\nThere you have it, the description of a bitch\nNow ask yourself are they talking about you?\nAre you that funky, dirty, money-hungry, scandalous, stuck-up, hair piece contact wearing bitch?\nYep, you probably are\n\nBitch!", "album": "N.W.A. and the Posse", "year": "1989-11-13", "title": "A Bitch Iz a Bitch", "image": "https://images.genius.com/1eeb76b08dcbc4e778777a3be33bdff4.600x600x1.jpg"}], "artist": "N.W.A"}