{"songs": [{"title": "Listen Up", "image": "https://images.genius.com/c8f633b4a8bcbf1c3e4d297a72000ed9.640x640x1.jpg", "lyrics": "[Intro]\nOne for treble\nTwo for bass\nShock the party and do it right\n\n[Verse 1]\nHa! Would you look at him?\nYeah, fuck him!\nHe walk like he just did something great\nAnd can't hold his leg muscles straight\nI puts a little something in my step\nSo these [overdotes?] know they ain't fuckin' with us yet\nI never left a customer upset\nYou ain't huffin' and puffin' in my set\nLike it wasn't in the fizz-eck\nMy people ain't for tustlin' and shit\nListen you hecklin' me in the venue, I will duff you in the nizz-eck\nI done raised these phrases since babies\nIn order to make them tough, I trained them rough\nSeldom a sentence ever escape my mouth\nWithout me kicking it hard in the ass on the way out\nI step on the tour manager floor\nSo that I could holler for y'all 'til my throat got sore\nThey hand me thirty minutes then I won't stop short\nUntil you beg for mercy and the whole spot pour\nAnd all the while the feet never touching the ground\n[?] grind his teeth to the thunderous sound\nKeep clever, every other line is something profound\nNow what about me say I'm fuckin' around?\nSweet Jesus!\n\n[Hook]\nListen up, get loud and clear\nGon' shock and amaze with the sound you hear\nI said listen up, and get right tonight\nWe gonna shock the party and do it right\nListen up, get loud and clear\nGot to wiggle your ass, get wild in here\nI said listen up, and get right tonight\nWe gonna shock the party and do it right\n\n[Verse 2]\nHere's a tip-toe around me on eggshells\nThen got a few props and your head swell and then well...\nYou swear to God you wouldn't boogalu\nNow look at you when we cry to throw the book at you\nI soak into my blood on Ant beat\nYour blood on your sneak from a pulp to the beat, right\nShould be preserving your breath\nBring murder and death when I swerve in your set\nAin't heard of us yet but we bang bang boogie\nSteer clear and let us do our damn thing lookie\nHear I wanna thank y'all for rookie of the year\nBut I ain't finished fuckin' with your ear\nGod damn it now!\n\n[Hook]\nListen up, get loud and clear\nGon' shock and amaze with the sound you hear\nI said listen up, and get right tonight\nWe gonna shock the party and do it right\nListen up, get loud and clear\nGot to wiggle your ass, get wild in here\nI said listen up, and get right tonight\nWe gonna shock the party and do it right\n\n[Break 1]\nSomebody come on!\nAnybody come on!\nEverybody scream!\nSomebody say, oh yeah!\nThat's right, y'all!\n\n[Verse 3]\nHol' up\nI don't fuck with no one unless I love 'em\nAnt, Slug's a deacon, BK our brothers\nAnd I ain't got nothing if I ain't got pride\nEither love me or don't waste my time\nI'll break my spine\nY'all buy tickets and raise my guarantee\nAnd that's another hungry mouth I can feed\nBelieve you me, sequel to the Shadows and the Champ EP\nThese muh'fuckers all leanin' tryna see through me\nWatch out, tell me what the fuck are you really seeing\nYou ain't shit, you get your jewelry taken\nRight along with your shoes and your laces\nThat beautiful bracelet\n'Cause your company control the way you viewin' the matrix\nSee I came in the game without a name\nJust some displaced anguish and a gift for the language\nI give a rat's ass what category I'm placed in\nAt the end of the day, we all piss in the same wind\nSame play pen, just a little different arrangement\nAnd I ain't been artistically caged in\nI bring to the table gifted innovation\nPlus some morbid more than their imagination\nI never know when to say when I'm hated\nI debate with a stranger 'til I blatantly break them\nI give 'em a facelift with the blade of the bass kick\nIt's a ways to the payment now barely don't say shit\n\n[Hook]\nListen up, get loud and clear\nGon' shock and amaze with the sound you hear\nI said listen up, and get right tonight\nWe gonna shock the party and do it right\nListen up, get loud and clear\nGot to wiggle your ass, get wild in here\nI said listen up, and get right tonight\nWe gonna shock the party and do it right\n\n[Break 2]\nListen up, listen up\nListen up, listen up\n(Shock the party and) somebody come on!\n(Shock the party and) anybody come on!\n(Shock the party and do it right)\nIt's going on downtown\nLet's stop!", "year": "2007-04-10", "album": "The Undisputed Truth"}], "artist": "Brother Ali"}