{"songs": [{"lyrics": "[Verse 1]\nAs I awaken\nBorn from the slums and taken\nThrough the ritual, childhood, puberty, adulthood, maturity\nAnd mastery of me\nAnd my surroundings counting down the days till I'm exposed\n\"I hear it move swiftly\" underneath the nose\nTill one day you're face to face you're gonna cross the line\nYou're lost for time\nLife lose diminished\nHeart beat finished, replenish\nNow you can be one with the light\nBut when it comes it'll come like a thief in the night\n\n[Hook]\nSo hollow the ground and don't put up a fight\nCause when it comes it'll come like a thief in the night\nYeah, obey the laws and do everything right\nBut when it comes it'll come like a thief in the night\nFor real we take 'em away\nThey take 'em away\nWe take 'em away\nThey take 'em away\nWe take 'em away\n\n[Verse 2]\nI hear the sound of the rain trickling down my window pane\nIt stains the seal to let me know life is real\nSustain and build and and maintain a force field\nI use it in a time of need when it's hazzardest\nAs it is said\nBe defensive at all time for instance\nAs soon as I'm elevated out of existence\nI am no more\nI can soar\nRight on the back of an eagle\nOr look eye to eye with a beetle\nBut now I am engaged\nIn none other than the physical form in which I'm caged\nSuch lawlessness involved in this charade\nTainted face painted black\n\"Is that the end momma? Can't I come back?\" (No, no)\nNo your train stops here\nRight where the rain drops appear\n\nNext stop in between the ears\nObjection to make you cirular\nWork you just enough so you can work yourself\n\n[Hook]\n\n[Verse 3]\nOverly anxious can't just wait\nTo see when death is gonna pull you to your fate\nIt's inevitable there's no escape\nThere's no mistake\nEvery time a life is given, it's another one you have to take\nThen your electricity and and your energy's released\nBorn into another soul after your physical's deceased\nMay you forever rest in peace\nAlthough your current is concurrent there is no deturrent\nYou will cease to be no more\nThe war has been won\nThe warrior is rested and your duty here is done\nJust when you think you're having fun\nIt'll snatch you up and run\nFor a second you appreciate the sun\nFor a half a second you appreciate the stars\nFor a half a second you reflect on who you are\nAnd what you where\nAnd in a flash it's all a blur\n\n[Hook]\n\n[Outro]\nLadies and gentlemen today's subject is death\nThe way I look at it it's three basic elements right?\nDie, dying, dead right? Die, dying, dead. Death becomes you says the crow to\nThe cheetah because you're an old cat. see you seem a little under the\nWeather, while me, my wings are as strong as ever, he says\n\"Well that may be so\" the cheetah says to the crow, but you know where to\nFind me, because everybody gets their time card pulled. You'll just be a few\nMore steps behind me, and behind you may I remind you so is everything that's\nTrue and living, that's life driven is given a final shock boy. frankly\nSpeaking, everything in here is on the clock boy. every atom, organism\nInsect, animal, man is gonna die, dying, dead. \"Death becomes you,\" says the\nArmadillo to the crow, \"oh you, oh you, are gonna die.\"\nNow wonder how many people die that, they have to put new suits on\nHow many people die with their boots on\nAnd how many people die cause they get there shoot on\nAnd how many people just die, period\n\n[2nd Outro]\nYou recording\nAlright cool\nYo' I just wanna say, you know\nIf you got something out of this\nAnd you listening to this\nAnd it was cool for you\nYou know, musically, lyrically\nYou know\nIf you received some type of lesson or something to aspire you to do whatever you do\nYou know what I'm saying\nTrying to get wherever you trying to go\nOr you know, or a reflection, whatever, you know its all relevant\nIts all, its all relevant\nYou know everything counts\nYou know it ain't all good\nBut everything counts\nAnd this just 1 side\nThis is, this is 1 look\n1 look at things you know\nIts different views\nEverything changes\nYou know the world revolves\nAnd evolve\nAnd I revolve and evolve with it\nAnd solve, problem solve\nHa, true\nBut again I wanna thank everybody for listening\nYou know, see y'all next album\nHonour, respect, peace", "title": "The Thief In The Night", "album": "A Book Of Human Language", "image": "https://images.genius.com/8c348dfe824da4f3b04231c7e4d629ae.700x700x1.jpg", "year": "1998-04-14"}], "artist": "Aceyalone"}