{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Non Stop (Street King Energy Track #4)", "lyrics": "Now I don't get along with these niggas anyway man\nI wish a nigga...\n\n[Verse 1:]\nYou niggas won't believe I got the shooters to your shot\nYou think you're built for bumpin' heads with me well nigga you're not\nThis'll be the last time I try to fucking warn you\nNext time your ass out of line, bitch I'm on you\nNigga that security you got ain't getting paid\nEnough to take some bullets or that 6 6 blade\nYou fucking hesitate you gonna need first aid\nMy blade'll turn a line man into a feather weight\nWho me? I wanna warn you motherfuckers ain't seen nothing like me\nStill looking for a juxs and my wrist so icy\nI tell the homies these niggas is full, eat 'em\nThey coming out the awards wearing their good clothes, need 'em\nTake it off, tell that sucker \"take it off\"\nThey ain't come up how we came up, man they niggas so soft\nHalf man half dog man my niggas sense fear\nBrought 'em here in a Lear to take your Audemere\n\n[Hook:]\nNigga round the clock non stop\nNiggas is hungry on my block\nI'm from south side nigga where the gangstas play\nMake one false move and you're blown away\nI make it so hot nigga my Glock\nSeventeen clip filled up with nine shots\nI'm from south side nigga where the gangstas play\nMake one false move and get blown away\n\n[Verse 2:]\nDon't get coffee with me pussy I told you before\nIt's outlaw, lawless I fuck you up regardless\nNiggas say they be work in I wanna see what they saying\nPut that work in without a mans, bring me that nigga, chain him\nATL BET we can AR in the park\nMake the parking lot sound like an Iraq war\nFeel the mood change when I step through the door\nGo head make me fuck you up that's what we came here for\nGem star, carve you up nice\nHave so much fun I wanna do it twice\nThat's my bitch on the pole\nYou tipping she's stripping\nI'm known for tripping\nI just slapped the clip in\n599 Ferrari state dipping\nCash getting, brick flipping\nStraight clip in, good ghetto living\nBig better vision\nBigger plans for a bigger bed to get in\n\n[Hook:]\nNigga round the clock non stop\nNiggas is hungry on my block\nI'm from south side nigga where the gangstas play\nMake one false move and you're blown away\nI make it so hot nigga my Glock\nSeventeen clip filled up with nine shots\nI'm from south side nigga where the gangstas play\nMake one false move and get blown away\n\n[Outro:]\nYeah, ya'll see me laying low, I got so much shit to say\nI'm a play, we gonna spar from now to the fight\nYou understand how this goes down right?\nYou seen this movie before, this a rerun\n'Fore what we call it? We call it Get Rich Or Die Trying\nHuh, did 12 million that time\nNah nah nah, we call it the massacre\nWe did 10 million that time\nWhat we gonna call it?\nHuh", "year": null}]}