{"songs": [{"image": "https://images.genius.com/95140c7c576a68cc10d708ff71ef761a.500x500x1.jpg", "year": "1991-12-03", "lyrics": "[Intro]\nYeah, yeah\nCan you feel it, baby?\nSmoothed out\n\n[Chorus]\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\n\n[Verse 1]\nCall me the new hoe on the block\nSome do like me, some do not\nI get paid to lay all kinds of ways\nSmoothed out fade with knack for hoe rap\nAnd some said flowin’ to me, was not you\nNigga hoes just went deep for ‘92\nAMG almost gold for ‘91\nAnd when I kidnap rap shows, I pack gun\nYes, me, sea to sea, coast to coast\nWilliam Mo’ takes care of my dough\nI roll Benzos, truck for the snow\nSippin’ something cool like a Bacardi Breezer\nAnd then jim gets greeted by a skeezer…\nBut anyway, when I grab M-I-C\nC-O-O-L A-S I-C-E\nOh, I guess not, no, in or out\nFast, not slow, and smooth not rugged, so\nI’m kinda like sex\nMC’s receive broke necks when I mic check\nAnd peace to the DJ’s\nI ran rhyme marathons for three days\nKinda like tongue relays for the Lick ‘Em Low Lovers\nWord to the D, brothers\n\n[Chorus]\nCan you feel it? (Trunk o’ funk)\nNow, can you feel it? (Trunk o’ funk)\nNow tell me can you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\n\n[Verse 2]\nSince our last meeting, I’ve been eating\nBombudd cookies, made by Cookie\nYou see, my mind got escalated by something I love or hate it\nBut then…I just did it again\n304 supplies the tool\nMoe Doe will check in hand, he’s the band\nBeats by the ounce, dozen, and pound, rhyme for rhyme\nVerb for verb, noun for noun\nI’m like down for a big fat butt\nPretty lips and hips, and a fat sack of\nWhat is that, Dr. Lovejoint smokes herb? (Mary Jane)\nUh, have you kicked to the curb\nSo lay back and hit it ‘til ya cain’t\nAnd if you got a bitch wit’ ya, fuck her ‘til she faint\n‘Cause your dick ain’t got a brain, punk\nSo when you’re finished fuckin’, throw her in the trunk\nI’m outta here\n\n[Chorus]\n(Trunk o’ funk)\nNow tell me, now can you feel it? (Trunk o’ funk)\nYo, can you feel it? (Trunk o’ funk)\nYo, can you feel it? (Trunk o’ funk)\nTell me, can you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCan you feel it? (Trunk o’ funk)\nCome on, can you feel it? (Trunk o’ funk)\n\n[Outro]\nShouts out going to the nigga hoes, Moe Doe, Chubb Rock\nMy man LaQuan, my man Sylk Smoov, the 69 King\nFather MC, the Funky Socialistics, Too $hort\nMy man Mark Money, my man Hakeem\nGreedy Greg, DJ Quik, EPMD, Boss, Big P\nMy niggas on the 1-1-4 level, yo\nCool and Mellow Productions, Tracy’s on the board\nMaking money, oh Lord\nHa ha, I’m outta here", "title": "Trunk O’ Funk", "album": "Bitch Betta Have My Money"}], "artist": "AMG"}