{"artist": "​​wifisfuneral", "songs": [{"year": "2014-08-27", "lyrics": "[Verse 1: Wifisfuneral]\nCall the coroner, it's the wettest form\nIn the faces I'm slashin'\nYou see the Grim Reaper in his finest passion\n10 Glocks pop in that drop top, candy cover paint\nThe return of Max Payne with no weapons drawn\n30s with the hollow tips\nRed icy bitch, yeah she with the shits\nI'm in the darkness, creeping slowly\nDemons speaking, souls departed\nBlunts smoked in the bathroom\nPaint dripping in the faucet\nBlood found in my arm where I stab\nDrug addicts in the casket\nMedusa's Stone for a reaction\nI got my, 9 millimeter cocked in my coffin\nEyes red, dope burning, I get faded often\nSwitchblade full of blood, late night slice\nThroats in the tub, counting bodies like I'm counting Benjis\nI'm all alone, right where you left me\nIn that dark room, that taste of blood\nThat faded rush, it feels so new\nMy soul speaks, I'll fade with time\nI'll paint the cameras, I'll blow my mind\nI'll stab the reverend, I'll kill the preacher\nThem false lies, no one can keep them\nPercs and them blood samples got you speaking\n\n[Interlude: Jim Ross]\nOwen Hart was uh, set to make an entrance from the ceiling, and uh, he fell from the ceiling. I have-I have the unfortunate responsibility to let everyone know that Owen Hart has died. Owen Hart has tragically died from that accident here tonight\n\n[Verse 2: Wifisfuneral]\nI'll call the plug when I need it\nI'll call the plug when I'm fiending\nReflection of pain at its finest\nI'm slowly dying with no hesitation\nNever the time to say goodbye\nThen I'll roll through like Razor Ramon\nGold chains swinging\nLeave the bad guy alone\nI'm toting pistols with Al Capone\nSky falls, cold weather\nDeath to all, pour a 4 in that 24\nI'm swinging low, straight 32s\nWith that Dutch roller\nBlunt ash on my undergarments\nI'll walk on water\nThat precious such, see I would bother\nOwen Hart, them bodies fallin'", "image": "https://images.genius.com/383319eb93e791b4922afe255b44c047.500x500x1.jpg", "album": "wifisfuneral - EP", "title": "PlayStation 2"}]}