{"songs": [{"year": null, "image": "https://images.genius.com/a96ea234d3e0ea068a71f09414207f4b.360x360x1.jpg", "title": "One Time", "album": "The Story", "lyrics": "[Intro/Interlude: Bizzy]\nShow 'em how we play, show 'em how we play (w-w-w-w-warriors)\nShow 'em how we play, show 'em how we play\nWe play (cause we are warriors, warriors)\nThat's how we play-ay, that's how we play we play (cause we are warriors)\nShow 'em how we play (walk us through the corridor, warrior, warrior)\nShow 'em how we play-ay-ay-ay-ay-ay\n(Walkin through the corridor, walkin through the corridor)\nShow 'em how we play-ay-ay-ay-ay-ay (warrior, warrior, warriors)\nShow 'em how we play-ay-ay-ay-ay-ay\n(Walkin through the corridor, cause we're the warriors)\nShow 'em how we playyyyyyyyyy\n(Cause we're the warriors, walkin through the corridor, corridor)\n\n[Chorus 4X: Bizzy Bone]\nIt's only one - get deep in the word and deep in the herb\nAnd deep in the woods and peep out the birds\nDon't sleep on us, don't sleep on us (it's only, it's only)\nDon't sleep on us, don't sleep on us (it's only, it's only one)\n\n[Bizzy Bone]\nLocal on the wings takin flight gettin mo' major\nWhat is it they gonna love me, they gonna shove me\nNever a stranger to danger playa\nThey better remember that to the coldest winters pimp hand\nSlippin ain't never an option, I get the trippin\nFlip when they dip when they skippin\nThey say to the other side, let it roll, let it go, let me ride\nAs we park on the other side, for the moment\nAnd the Lord provides, so potent, heh\nLike the omni-potent, I'm the greatest, youknowhatI'msayin?\nNow we duckin in sins, sinful livin, baby let that sinnin begin\nSee ain't we dirty rags, and ain't we dirty bags\nPretty in the rugged rough, pretty enough to sip that Henn'\nDrift back in, move back in, wit 'em again, sick enough\nCan we bring it quick enough? Now tell me is that slick enough...\nCause I know I wasn't good enough, and I know they sneakin a peek\nDon't let 'em drown me, oh dear Lord\nI think they're drunkards and I'm a freak - stay close\nLook at the cookie crook, but I love them all the same and yes I'm grateful\nHow could they be so fuckin hateful? (hateful)\n\n[Chorus]\n\n[Interlude]\n\n[Outro: Bizzy]\nIt's only one...\nIt's only, it's only one {*echoes*}\nIt's only, it's only, it's only, it's only one {*echoes*}\nIt's only, it's only, it's only, it's only one {*echoes*}\nIt's only, it's only, it's only, it's only one {*echoes*}"}], "artist": "Bizzy Bone"}