{"songs": [{"title": "I Got That", "album": "Rebirth Of A Gangsta", "year": null, "image": "https://images.genius.com/bb4f64327ad94669caa0b2dba434fd08.379x600x1.jpg", "lyrics": "[Hook: Timbaland]\nWhen you hit me on my phone betta know what cha want\nWhen you call me, you already know, on the low\nIm sayin Hey! I got that(dro). I got that(drank). I got that(hoes)\nI got. I gotta pocket fulla stones and im playin the corner\nYou want it, you already know, you sicko.Im sayin Hey!\nAbout that. Hey! .about that. Hey! .about that. Hey! about. whoo!\n\n[Verse 1: Lil Eazy E]\nLemme tell you bout a nigga named E (named E)\nIm hittin corners in compton and movin work gettin profit\nThey tryna stop it but im so low key (low key)\nThey say with dollars come power\nIm stackin mines by the hour\nMan fuck that coward!\nImma, get while the gettin's good\nGot boyz in da hood\nAnd bundles of Kush\nMuthafucka George Bush!\nSee he ain't helpin us, the streets they respectin us\nGovernment ain't tryna help, so we just invest in us\nDo whatever for a buck, in the hustle I trust\nMoved from the back of the bus to a Maybach in a tux\nLivin that good life. Still Lovin that hood life\nThis for my homies who locked down and doin life\nThey not on the grind for em\nWe served that time for em\nCan't see ya did it for me, so I feel like I owe em\nNow Tim Ridin with me, everybody tryna get me\nTill the day I die im livin filthy\n\n[Hook]\n\n[Verse 2: Timbaland]\nLemme tell ya bout this nigga named Tim(named Tim)\nIm well known in them corners V.A. to California\nThe game sowed up and you wanna blame him(blame him)\nAnd throw yo side up\nHomie nd ill throw minez up\nHomie, till I retire\nOnly GOD knows when(knows when) im Mr. Mo'endz\nIf you ain't talkin paper I tell ya Go'on then\nI gotta team of goons they kidnapping grown men\nDuck taping wife and kids, thinkin niggas gone then\nAn when I ride by, I'mma let 'em slugs fly\nBustin my forty five,say hi to the bad guy\nYea, my swag is stupid, my style is celebrity\nSo I dont really gotta shoot'cha you already dead to me\n\n[Hook]\n\n[Verse 3: Lil Eazy E]\nAnd I ain't stoppin for nothin, can't get enough of it\nThis dope game such a rush and a nigga lovin it\nFast money, Fast cars im on some other shit\n???\n[Hook]"}], "artist": "Lil Eazy-E"}