{"artist": "Phora", "songs": [{"album": "One Life To Live ", "title": "No Matter What", "image": "https://images.genius.com/d1e75acbdeb01e13d54d7b06f6752078.1000x1000x1.jpg", "lyrics": "[Hook]\n\nShe said, 'No matter what you do\nNo matter where you go\nBaby you'll always be the one for me. (always be the one for me)\nEven if you leave I'll never let you go\nEven after all the things you done to me. (all the things done to me)\n\nNo matter what you do\nNo matter where you go\nBaby you'll always be the one for me. (always be the one for me)\nI just thought I had to let you know\nEven after all the things you've done to me. (all the things you've done to me\n\n[First Verse]\nShe said, \"I'm here for you no matter what, even after all the fame, groupies and the cameras\n\nEven after all your so called homies turned their backs, they say they down but yo' their word ain't jack\n\nIn fact, even after the curtains close and the moneys gone\nI'm still here even after all the times you've done me wrong\nKnow I gotta have some patients with you\nGirls probably sending you naked pictures\nHope you ain't laying with'em\nYeah, and if you ever do leave\nAll I really want is for you to promise you'll take me with yah(promise you'll take me with yah)\nOr at least take a memory, cause if you gone I don't know how much love is gonna be left in me\nAnd when you next to me at night it sets the mood right\nThink about our future as I stare into the mood light\nI'm the only one who truly understands you\nI know what you thinkin' I don't ever have to ask you\nBut every time your gone, apart of me is missing\nWhen you come back my love for you is never different\nNow the feeling never changes\nI here for you wether your broke, dirty and smelly\nThese girls love you cause you famous.\"\n\n[Hook]\n\nShe said, 'No matter what you do\nNo matter where you go\nBaby you'll always be the one for me. (always be the one for me)\nEven if you leave I'll never let you go\nEven after all the things you done to me. (all the things done to me)\n\nNo matter what you do\nNo matter where you go\nBaby you'll always be the one for me. (always be the one for me)\nI just thought I had to let you know\nEven after all the things you've done to me. (all the things you've done to me\n\n[Second Verse]\n\nLook\nShe said, ' I know you stressin' but you drinking to much\nI feel like we growin' distance\nWe ain't speakin' enough\nEvery time I try to talk to with you, you say you 'ok.'\nBut I know something is wrong, and I can see through your bluff\nI just wanna know what I can do to help you get through it\nCommunication is key, but sometimes you act stupid\nSometimes you play games\nSometimes you so difficult\nSometimes you drive me crazy\nAnd sometimes we on a different note\nBut I know, I can feel it in my soul\nWhatever brought us together had plans for us to be close\nI mean, just don't take me for granted\nIf you want every second of my time then you can have it\nThe only thing you don't have is the right to take advantage\nI hope you never try cause my heart is already damaged\nAnd\nI don't expect for you to fix it\nBut I expect that you respect my feelings and you listen\nThat's why I'm here\nAnd you need me like I need you\nNo matter what I gotchu, and never will I leave you\nSo grab my hand and tell me you won't ever go\nI wanna say 'forever' but you never know\n\n[Hook]\n\nShe said, 'No matter what you do\nNo matter where you go\nBaby you'll always be the one for me. (always be the one for me)\nEven if you leave I'll never let you go\nEven after all the things you done to me. (all the things done to me)\n\nNo matter what you do\nNo matter where you go\nBaby you'll always be the one for me. (always be the one for me)\nI just thought I had to let you know\nEven after all the things you've done to me. (all the things you've done to me)", "year": "2013-07-01"}]}