{"songs": [{"image": "https://images.genius.com/6bb3e1691f3789354cba18fb4b109a8d.640x640x1.jpg", "year": "2013-06-04", "lyrics": "[Intro]\nUhh baby (x2)\n\n[Verse 1: Alex Wiley]\nBlast off [uhh baby)\nIt's the motherfucking time now\nDug a deep ditch when i quit school, but this rapping shit helping me climb out\nMe and Chancellor, fuck you tahm bout\nVillage shittin' on niggas in time out\nWhen im feeling this all that i rhyme 'bout\nMe and Kembe grindin' in the grind house\nAsking where I wanna go, who I wanna be\nMy life is nothing more than ripping all these beats\nAnd that's the way i want it im trippin'\nOf the weed and that im sippin' on at least you\nTipping, fuck you mean\nGotta get mine, gotta fucking win\nGotta bring the Village, I gotta represent it\nI gotta keep on pushing, gotta keep on working\nI can't stop yelling fuck though, I gotta keep on shittin'\n\nAll we wanna do is get money\nSeem like errbody want some shit from me\nLike put me on with this and hook me on with that\nFind your way up off my dick homie\nRemember I used to keep the sacks with me\nIn the basement, watching that Rap City\nNiggas used to say I rap shitty, funny\nNow them niggas want a track with me\n\n[Hook: Alex Wiley]\nIf my manager insults me again\nI will be assaulting him\nAfter I fuck the manager up\nThen I'm going to shorten the register up\nLet's go back, back to the Gap\nLook at my check, wasn't no scratch\nSo if I stole, wasn't my fault\nYea I stole, never got caught\n(x2)\n\n[Interlude: GLC]\nYea, they're going to do it on purpose man\nIt's going to be haters lurking\nYou know what I'm talking about?\nWishing to see you fail\nBut at the end of the day if you got God on your side\nWhy the fuck would you believe in hell\nYou know what I'm talking about?\nHate ain't shit but the devil\nTell them motherfuckers to get up\nAnd get up on a whole 'nother motherfucking level\nIsm\n\n[Verse 2: Chance The Rapper]\nNASA,\nWhole world wants to know what you crashed for,\nJag off, what you jag for\nIm just doing what you assholes, had asked for\nWhen we going to home?\nMy eyes hurt, my throat hurt, my soul hurt\nMy whole church know my niggas on dirt\nLil' college dropout, blame it on Ye'\nLil' Jimmy done grown up, he's slangin' them tapes\nSouthside, out West, South By Southwest\nDoubt my prowess, I guess 'bout now I'm fresh\nGoodness gracious,\nVisionary chasing, Chance with a space and The\nThen a pronoun, and the car spacious,\nAnd a spaceship for the spaceship like IGH!\n\n[Hook: Alex Wiley]\n(2x)\n\n[Outro: GLC]\nYea, always keep your ism at a magnificent level\nThat it's true, know what I'm talking about?\nI come to find out there's three type of people in the world\nThere's those that ask what happened\nThere's those that saw it happen\nAnd then there's those that made it happen\nAnd which one are you?\nCathedral.ism", "title": "Spaceship", "album": "Club Wiley"}], "artist": "Alex Wiley"}