{"artist": "IDK", "songs": [{"title": "Hello Pt. 2", "lyrics": "[Famous Intro: Rihanna + Kanye West]\nMan I can understand how it might be\nKinda hard to love a girl like me\nI don't blame you much for wanting to be free\nI just wanted you to know\nSwizz told me let the beat rock\n\n[Verse]\nIf SoundCloud died, a lot of rappers would ghost\nIn 2015, they thought my rapping was toast\nIn 2016 I started rocking the boat\nIn 2017 I'm giving these niggas smoke\n*Cough, cough* (Dope)\nI'm an animal, fuck it, no I'm a cannibal\nFuckin a bitch thick as the glasses on Buress Hannibal\nThat's probably just as thick as my wallet after a college show\nGive my BBC to the A student in honor roll, like\n(what's that?)\nI don know, I'm just tryna get outta here\nThey try just copy my inner-, under- and outerwear\nRemember I would call up the number asking is\nAlice here?\nThey would be like, this ain't no Alice nigga\nMy names Amir\nA man's biggest fear\nBut now I'm pushing past my peers up this ladder\nLooking down in was makes me scared\nI don't never look there\nThey love me and they hate me\nGot they feelings so mixed that their heart got good hair\nPut me on the throne, I promise I'll give it good care\nThe best new nigga, can't none of these rappers compare\nThey might be a little bit more popular now\nBut as soon as I pop, they pop charting go down\nFuck it\nWhen I pop, they Papa Doc backing 'em out\nAim 32 bars at their head, parting their crown\nPick the pieces up and weld it together sit my ass down\nThen release then flow, how many new rappers will drown?\n(pause)\nAll of em\nKilling every odd that comes\nMost these niggas cornballs\nI'mma have to harvest em\nI might have to (brrp, brrp), I can't even think of nothing\nWinning it this light over my head like I'm thinking something\nBars hit yo ear, face looking like it stink or something\nPulling out even with a condom if I think I'm coming\nI don't trust no hoe, said it twenty one-four\nTRIBE be the click, HOLY be the logo\nBeen wore Supreme since my first video, ho\nSo it's only right when you see me out in Soho\nI know I'm from the land where they jump you at a gogo, but\nWhy this niggas jumping on my stick no pogo\nPause no homo\nPut me in the ring and we can brawl go toe toe\nUsed to steal clothes for the malls up Moco\nNow my last check read five, oh, oh oh\nAll from my vocals\nSo fuck a list, my fans know that I'm the best\nAnd they growing by the minute from the time that I invest\nSpeaking of invest, Jewish niggas organize my check\nTelling me relax every time a brother wanna flex\nWhat next?\nI just speak my peace, keep my peace\nCubans with Jesus piece, with my peeps\nRest In Peace B.I.G, know that he\nNever gonna die\n\n[Famous Bridge: Sister Nancy + Swizz Beatz]\nBam bam, 'ey 'ey 'ey\nBam bam bam, bam bam dilla\nBam bam 'ey 'ey 'ey\nWhat a bam bam, bam bam dilla\nHow you feeling right now? Let me see your lighters in the air\nBam bam 'ey 'ey 'ey 'ey 'ey\nBam bam 'ey 'ey 'ey\nWhat a bam\nLet me see your middle finger in the air\nBam bam 'ey 'ey 'ey\nBam bam bam, bam bam dilla", "image": "https://images.genius.com/af4d8494f10f9376ea62710dda632fb9.723x723x1.png", "album": null, "year": "2017-01-03"}]}