{"songs": [{"album": null, "image": "https://images.genius.com/6efed4f2f043ca2d708512a157481569.720x720x1.jpg", "year": null, "title": "Baby Don’t Go", "lyrics": "I try to play cool\nActin' like what you do don't phase me, don't phase me\nMeanwhile I'm sittin' at home, all alone\nTryin' to keep myself from goin' crazy\nWhen I'm in the house, when I think about\nWhen I see you out, when I hear about {T-Pain}\nI want my baby back! {'Lo-so} And I thought it would be easy\nBut it's hard for me to let you GO~!\n(Baby don't) GO! (Baby don't) go!\n(Baby don't) go (baby don't) {y'all know what this is}\n\nNow I'm better than your ex, gon' be better than your next\nBaby Screwed Up so you better be from Tex-as\nCan't seem to doubt that I creamed her out\nNow you dream about how I turned Nieman out\nNothin' to scream about just back your Beemer out\nPack it up in the trunk, go back to Kima house\nCause I can play cool, but I can't play fool\nThere's options in break up, you ever play pool?\nBetter do you cause I damn sure does me\nAnd what your buzz be is only because of me\n\nThe wifey, hus-by, never was me\nI does me, trust me\nI don't wanna another you so I'mma slide (yup)\nBut I got another boo, on the side, bay-bay\n\nI try to play cool\nActin' like what you do don't phase me, don't phase me\nMeanwhile I'm sittin' at home, all alone\nTryin' to keep myself from goin' crazy\nWhen I'm in the house, when I think about\nWhen I see you out, when I hear about\nI want my baby back! And I thought it would be easy\nBut it's hard for me to let you GO!\n(Baby don't) GO! (Baby don't) go!\n(Baby don't) go (baby don't)\n\nThrough the time I been alone, time I spent on phones\nKnow you ain't lettin' them climb up in my throne\n\nNow, baby that lime with that Patron\nHave me talkin' crazy, it's time to come on home\nNow, I talk with someone above\n\nIt's okay to lose your pride over someone you love\nDon't lose someone you love though over your pride\nStick with 'cha entree and get over your side\n\nWe break up to make up at Jacob's baby\nHer parents fought too, I'm the makeup baby\nWake up baby, love 'll have you open though\nI mean you seen Tom Cruise on the Oprah show\nSo I just can't bet on the next hand\nThere's too much in this pot just to give to the next man\n\nNow if you ain't never went through it you ain't really into it\nThe next rap to show you I really been through it\nEvery other day I'm givin' the love away\nThat's what your friend's sister or little brother say\nIf I'mma do somethin', it's the undercover way\nWhen them hatin ass watchdogs look the other way\nAnd others may not see that we need each other\nBut if we on the same page we can read each other\nThey should learn us, instead of try to turn us\nMr. and Ms. Smith, we both got the burners - UP~!\nIf you love your baby then turn this up\nKnow we keep this hot like a Thermos cup\nRelax, don't be Tryin' to perm us up\nWe already straight - yes\n\nFab we gon' have to make a dance to this song man!\nY'knahmean; ain't no WAY you can't dance on this\nUh, T-Pain!\n\nI want my baby back! And I thought it would be easy\nBut it's hard for me to let you GO!"}], "artist": "T-Pain"}