{"songs": [{"title": "Pound Cake Recipe", "lyrics": "[Intro: Jimmy Smith]\nGood God Almighty—like back in the old days...\nYou know, years ago they had the A&R men to tell you what to play, how to play it and you know whether it's disco and rock but we just went in the studio and we did it. We had champagne in the studio, of course—compliments of the company—and we just laid back and did it. So we hope you enjoy listening to this album half as much as we enjoyed playing it for you. Because we had a ball. Only real music is gonna last—all that other bullshit is here today and gone tomorrow...\n\n[Verse]\nI was on this rave ting 'nough but it weren't fulfilling me\nCouples shorties wanna grind, they say they're feeling me\nAnd all the champz and Ciroc, it was killing me, it was killing me\nEmpty women don't fill what the heart missed\nYou can't search a wild place for a calm Miss\nI found my place in the hood, where the arms is\nSo I'm good cah your home is where your heart is\nI wanna say a couple words for my enemies\nYou've gotta ask God while you sit back\nCah these niggas get brave when the sip Yak\nAre you niggas still brave when it kicks back?\nToo many snakes round here in my residence\nThe teeth marks in my back are the evidence\nAnd I ain't preaching to you niggas\nJust careful who you keep before they creeping on you niggas\nLook, I'm me, no more, no less\nI was taught no whore, no stress\nTrapped in and we don't protest\nOur friends die while the folks go rest\nI've learnt if you're talent then you're tainted\nIf you're getting on your feet then you're hated\nAnd you could ask my mum or my aunty\nThe worst things happen to the calmest youtes\nListen, I was led into the corner like a goner\nGirls move loose for the dollar\nI said they move loose for the dollar\nNigga's feem, someone's daughter's who they holla\nCash rules everything around me\nI'm a young king so I'm looking for my crown see\nTired of the struggle so I'm feeling kinda drowsy\nGrind full time 'til I cop my mum a housey\nFuck the pagans, I'm not scared, I said it blatant\nBeefing with my niggas then it's no cooperation\nGive your soul a quick elevation\nAll up in your crib, no hesitation\nAnd most you niggas whack\nIf you ain't send your niggas P's then don't say free him on the track\nAnd that's R.I.P. to the truth\nNothing but some liars and some frauds in the booth\nWhite girl thick, white thighs, that's a white cake\nStab a pagan for the mula, that's knife cake\nMoney cake's nice cake, flip it twice cake\nCake, cake, cake, cake, cake, cake\nLook, when my head [?] then my niggas hurt\nCabbie to the scene then I put in dirt\nAnd don't tell me that my brother's pissed\nOr tell me that it's on site, see us\nNo time for these rap fakes\nFuck beef, I'm in the crib, I'm tryna mash cake\nI'm tryna be the man and take my dad's place\nI know killers pushing hammers to a man's face\nAnd for the flat rate, you can get the batch ate\nI'm tryna get away, I'm living in a trap-state\nSo I'm stuck up in these flats mate\nI'm fucking slags in my flat, that's a flatmate\nDuh, duh, that's a man's face\nI'm a lone wolf living in a gang place\nI ain't in a gang, got a couple gang mates\nYou're either popping [?] or you bang weight\nNiggas bang way talking 'bout the damn beige\nNot the gym weights you be banging in the can straight\nYou wanna start grinding but you're damn late\nI don't trust a snitch cah I don't like the ham taste\nMy connect's over certi, going H.A.M late\nHe told me hang five, had to tell him hang eight\nIf you ain't from the left, you won't get the slang mate\nI've got this rap ting locked, how can a man hate?\nFuck multi play, I'm me, I'm on the campaign\nI'm tryna pop the best [?] and the champagne\nI could spit on any track and show a man pain\nBut you just chat a load of crap 'cause you're a damn lame\nAhh, and it's a damn shame\nA hundred rappers and they're sounding all the damn same\nAll the homegrown died when the Dam came\nDam cheese, Dam kush and an amm flame\nNiggas saying I'm a mad pain\nPlenty niggas hate my guts and wanna act brave\nIf I've got the man-bag, I've got the bad stains\nI don't swing fam, I'll put a wetter through a man's frame", "year": null, "album": "No More Looney", "image": "https://images.genius.com/04830dac3384eb099580c3ed9646e73d.500x500x1.jpg"}], "artist": "AJ Tracey"}