{"songs": [{"year": null, "album": "Allow Me To Re-introduce Myself", "image": "https://images.genius.com/3b2283d9008265c54952b9dadead1160.360x360x1.jpg", "title": "Motivation", "lyrics": "[Hook] [May Marquardt]:\nLooking back to the day when you said I wouldn't make it far\nI had to promise myself no tears and I'm so sincere, I don't care who you are\nI'll never be afraid of pain\nYou got to dance in the heavy rain\nSo when it's coming down on me\nIt's only motivation\n\n[Verse One] [Kardinal Offishall]:\nYo, you never know what you have until you lose everything\nThe love and your sanity, nigga 'erything\nYears back I had felt agoraphobic\nAll the fire that I had, it's like the devil done stole it\nRead it on my mom's face\nShe couldn't camouflage\nAny of the hurt, it's like the Earth felt sabotaged\nThe pressure for the first time, ?, Mr. Get Up And Go, couldn't leave the bed layin' in\nFor months on end I was the subject of a prayer chain\nEveryday losing stripes like a candy cane\nRealizing that nobody really noticed that I didn't come around\nThey assumed that I was out of town\nBut I was out and down\nUntil one day, my mom and my cousin came through and said, \"Look around\nYo, no matter how bad your life feeling\nYou gotta keep your spirit to the ceiling.\"\nThat love is motivation\n\n[Hook] [May Marquardt]:\nLooking back to the day when you said I wouldn't make it far\nI had to promise myself no tears and I'm so sincere, I don't care who you are\nI'll never be afraid of pain\nYou got to dance in the heavy rain\nSo when it's coming down on me\nIt's only motivation\n\n[Verse Two] [Big Pooh]:\nA few years on the road now I'm sitting in the crizzib\nShades drawn, Little Brother gone, people livid\nMe? I'm in another space, focused on the past\nDepressed about the future cause I couldn't get passed\nMe\nStarting over\nSo I'm inching closer to the point of no return\nWhere I'm feeling rap's over\nA few months period\nThe mind is a meriod\nLooking in the mirror, like \"Nigga are you serious?\"\nMy girl looking at me like, \"Nigga you delirious?\"\nNo matter where I turn, see the message was ubiquitous\nGet up, get out and stop sulking\nNo more Lou Ferrigno, time to turn into The Hulk and\nSmash on these niggas, thank the doubters for supportin'\nBig Dho coaching, I'm starring on the court and\nNo more role playing for this beat dragon slayer\nReturn of the rapper, you should kneel and say a prayer\nI'm here\n\n[Hook] [May Marquardt]:\nLooking back to the day when you said I wouldn't make it far\nI had to promise myself no tears and I'm so sincere, I don't care who you are\nI'll never be afraid of pain\nYou got to dance in the heavy rain\nSo when it's coming down on me\nIt's only motivation"}], "artist": "Kardinal Offishall"}