{"songs": [{"year": null, "image": "https://images.genius.com/809737792a8459e937896e9550e530ba.600x600x1.jpg", "title": "Life Story", "album": "Life Story", "lyrics": "[Intro]\nThe world ain't no different now\nThe world ain't no different now\n\n[Verse 1]\nNever had a dime, my life a crime\nHad to be when I was nine, Moms drunk off wine\nRunning with all kinds her mind stayed in the stupor\n'til the point she paid no mind to the super\nStay mad but stay fronting with smiles\nStayed on the growl and eating once and a while\nFirst day of school never had nothing too style\nMister Colondre stressing, I ain't coming in a while\nIt was a bummer, rocking the shit I rocked all summer\nOn the first day, I was feeling some kind of way\nAnd she wasn't trying to do nothing, you would think\nFor the sake of the kids, she'd enroll in school or something\nNow I know then was even harder\n'specially for a single mother raising me with no father\nShit living up in this tenement, eating stale Entenmann's\nTalking wild shit to Spanish immigrants\nI speak in codes, man tú sabe\nAlways cállate bendición to my madre\nEven though she never did nothing for me\nAcknowledge me as I run down my life story\n\n[Hook: Cheryl Pepsii Riley & Racquel]\nYou don’t know, how crazy it is outside\nI’ve died inside so many times\nOh, I’ve cried, oh, I’ve cried\n\n[Verse 2]\nCheck the skit, nobody never gave me shit\nIf anything a nigga framed me and made me get\n3 to 6 my first bid, no doubt up in Spofford\nHad to be 12 son, trying to make a profit\nRemembering robbed my Moms with no guilt\nEating pork and beans, old corn flakes with no milk\nBitter, in school I smacked cats in a hurry\nMoms ain't care she busy getting drunk with Mrs. Berry\nOn the first floor, I used to thirst for greenery\nPicking pockets with Seth and Jay from 106th Street\nYo, fuck home, I'm tired of getting punched in my dome\nTired of hearing this faggot-ass nigga moan, I started roaming\nMy hustle game is deep, cats ya heard\nFrom San Fran back to Manhattan to Newburg\nNotorious tell your friends to spread the word\nGlorious, my life story is absurd\n\n[Hook: Cheryl Pepsii Riley & Racquel]\nYou don’t know, how crazy it is outside\nI’ve died inside so many times\nOh, I’ve cried, oh, I’ve cried\nI know I haven’t been the best\nI’ve shown you things you shouldn’t have seen\nCan you forgive me? Can you forgive me? Oh, my baby\n\n[Verse 3]\nHome from Elmira, got a little brighter\nI'mma keep it real still a schemer and conniver\nRecognize the struggle, living like a thug do\nHatred in my heart but inside I love you\nSee no matter what I will extend my arms to hug you\nKnowing that I'm just like you, I am like the double\nAll I wanna know is how you pound me down\nYo, this shit is real and you really jerked me around\nBut any way I am getting paid with Puff now\n'Bout to cop you a house I can send you some stuff now\nSo many levels jail take you\nI appreciate jail 'cause it made me appreciate you\nI've been through fire and brimstone\nUsed to be diplomas in jail, now I cop the gem stone\nI remembered when you rushed me\nThe time you said you should of flushed me, I forgive you ma trust me\n\n[Hook: Cheryl Pepsii Riley & Racquel]\nYou don’t know, how crazy it is outside\nI’ve died inside so many times\nOh, I’ve cried, oh, I’ve cried\nI know I haven’t been the best\nI’ve shown you things you shouldn’t have seen\nCan you forgive me? Can you forgive me? Oh, my baby"}], "artist": "Black Rob"}