{"songs": [{"image": "https://images.genius.com/356a919f7753fd13b4ebec02d9018b3d.736x704x1.jpg", "lyrics": "-=Mac Dre talking=-\nAh, what, ah, what\nMall Macenroe, like what!\nAndre Macassi ah, ugh\nStreet Sampras, what it do?\nWhat that is?\nWhat it do?\nUgh, ugh, ugh, ugh, ugh, ugh\n\n[Verse 1: Mac Dre]\nThis ain't no love ballad, or romance song\nThis a dance song for you can get yo dance on\nIt's hard to keep my pants on when I'm giggin'\nAnd when I'm giggin' it look like I'm diggin'\nI do the pigeon, bird like a nerd\nSome endlessly rappin' every line every word\nI dust myself off like I stole third\nSkinny nigga giggin' with no shirt\nI get chauffeured so I can passenger gig\nGet the chips and don't trip off her mask and her wig\nSo, son, I'm askin' her this: Can you do the thing?\nCan you really do the dew and pursue the green?\nI ask her who the king, she tell me I'm is\n(Nothin' but the hook) It's almost time, kids\nI'm tryna see some grindin', can you dig?\nYeah, you fine, bitch, but can you gig?\n\n[Hook 3X: Mac Dre]\nBaby, can you gig?\nYou so crazy when you gig\nUgh, she giggin'\nLady, can you gig?\nGirl, you so crazy when you gig\nUgh, he giggin'\n\n[Verse 2: Rydah J. Klyde]\nShe was doin' the twist and pop\nWhile I was tryna get the cork out the Cris then pop all in her hair\nHer champagne shampoo was Flashdance 2\nBaby want me to dance too but that I can't do\nShe was giggin' too hard for me\nTurned around and my dick stretched a yard you see\nI can't play wit you lil' mama, Thizzle got you crazy\nShocked her when I stood up and walked on her lazy\nBroke it down, touched the ground; rolls wit the 80's shit\nLit that hazy, asked her \"What you know about Thizz?\"\n\"What you know about this? Naw, bitch, Thizz\"\n'Cause that's what it is, DJ put us in the mix\nWatch us pump up the party\n'Cause we didn't come to body nobody\nIt's 300 Bay cats in the lobby\nSwingin' dreads, movin' heads, getting' stupid\nNaw, that's the old look, can gig to this new shit, watch me\n\n[Hook]\n\n[Verse 3: Mac Mall]\nI'm a fan of the Running Man, old school Cabbage Patch\nMight mix The Prep wit a little Roger Rabbit\nRobo-Cop, Up-rock, Pop-lock, Boogaloo\nI don't know about you but where I'm from you see we act a fool\nLil' mama giggin' with me tryin' hard to keep up\nBut I'm bustin' moves that she never even heard of\nFeelin' it, Thizz face look permanent\nAdvance Bird Dance now we call the shit \"The Buzzard\", bitch\nHumpty Dance don't got nothin' on me\nQuick to Michael Jackson spin and do the Mahoney\nYou squares is phony but your bitch still want me\n'Cause I do the George Jefferson oh so coldly\nYeah, it's a celebration, bitch\nSo I'm gon' break it down to the Fred Sanford\nLil' mama movin' but you know she can't handle it\nI'm in the middle of the floor with my hands on my dick\n\n[Hook]", "year": "2005-03-22", "album": "Da U.S. Open", "title": "Giggin’"}], "artist": "Mac Dre"}