{"songs": [{"title": "Mr. Intentional", "album": "MTV Unplugged 2.0", "year": null, "image": "https://images.genius.com/223n7ezbshqosz0dhiz8hrmkd.500x500x1.jpg", "lyrics": "[Verse 1]\nSee, the road to hell is paved with good intentions\nCan't you tell, the way they have to mention\nHow they helped you out?\nYou're such a hopeless victim!\nPlease don't do me any favors, Mr. Intentional\n\n[Verse 2]\nAll their talk is seasoned to perfection\nThe road they walk, commanding your affection\nThey need to be needed, deceived by motivation\nAn opportunity to further situation\nWhy they're so important is without explanation\nPlease don't patronize me, Mr. Intentional\n\n[Verse 3]\nWe give rise to ego by being insecure\nThe advice that we go desperately searching for\nThe subconscious effort to support our paramour\nTo engage in denial, to admit we're immature\nValidating lies, Mr. Intentional\nOpen up yours eyes, Mr. Intentional\n\n[Verse 4]\nStuck in a system that seeks to suck your blood\nHeld emotionally hostage by what everybody does\nCounting all the money that you give them just because\nExploiting ignorance in the name of love\nStop before you drop because that's just the way it was\nPlease don't justify me, Mr. Intentional\nOh one-dimensional, Mr. Intentional\nOh don't you do me any favors\n\n[Verse 5]\nWake up, you've been sleeping\nTake up your bed and walk\nStop blaming other people\nOh it's nobody else's fault\nAccept the truth about you\nYou know that life goes on without you\nAnd your expensive misinventions\nDisguising your intentions\nDon't worship my hurt feelings, Mr. Intentional\n\n[Verse 6]\nSee, I know you can't help me, Mr. Intentional\nThe only help I need to live is unprofessional\nThe only wealth I have to give is not material\nAnd if you need much more than that, I'm not available\nPlease don't entertain me, Mr. Intentional\nOh I don't need your sympathy, Mr. Intentional\nStay away from me, Mr. Intentional\nSo one-dimensional, Mr. Promotional\nMr. Emotional, Mr. Intentional"}], "artist": "Lauryn Hill"}