{"songs": [{"image": "https://images.genius.com/3b061185b8a017578796bbe35c4f5557.1000x1000x1.jpg", "title": "The Hard Way", "album": "Nate Dogg", "year": "2003-02-25", "lyrics": "[Intro: (Nate Dogg)]\n[Cough] How much money do you have, baby?\nCount it out, count it out\nOh no, a-ain't no marriage in this\nShe too broke\n\n[Verse 1: (Nate Dogg)]\nOne to the two to the three to the four\nWhen you see the big dog, Give the doggy his bone\nCouple fucking lines and they're mind is blown\nI'm just making sure the fucking mic was on (1,2... 1,2)\nBig Dick Willy standing next to you\nAfter meeting me, ain't nothin' you won't do\nYou like the crazy sexy little things I do (Like a)\nSmokin' weed while I'm sexting you [cough, cough]\nNigga's won't [?] so I r'ic r'ic row\nNigga's won't bust cuz they ain't that poor\nTake the hottest nigga's girl cuz I'm just that cold\nNigga's talk shit so I s-st-stole\nNow a nigga callin' on my cellular phone\nMad at a nigga cuz his couchie is gone\nMad Doggin' me like his bitch ain't grown\nHad a bad bitch but her hair wasn't combed\nI really didn't need her so I let her go\nEven though I could've stomped a nigga, word is bond\nI keep saying to my self, \"I got a million hoes\"\nPlus, she really wasn't worth it so I just moved on\n\n[Verse 2: (Armed Robbey)]\nWho wanna get it?\nWhen I grab the mic, I give it\n100% Every fuckin' time when I spit it\nI dropped a load and got ya'll thinkin' that I shitted, (Ooohweee)\n[?], If it's funky then I did it\nMy style is rough, full of bumps and dibits\nYa'll be talking, I think, while I live it\nI visit some cheap hotels, most exquisite\nTravel like a P-Ball player movin' his pivot\nWhere the pirate of Philly cap? It was fitted. (Nigga)\nForever to the streets, I'm commited\nMy business of being number one, is real vivid\nYa'll know the truth even though you won't admit it. (Nah man)\nYou got a problem on our ride, you better quit it\nI'm ludacris, I throw a bow like I'm Riddick\nAnd watch the blood go down from your head from when I split it\nAnd guarantee that when I'm charged with it... I'm a quit it\n\n[Verse 3: (Xzibit)]\nXzibit, made from the best up in the Universe\nI bust first and make the crowd disperse\nThe worst thing you ever seen in your life\nLike seein' a pregnant bitch buy rocks and hit the pipe\nIt ain't like I have tried to tell ya. (shhh)\nMisery love company, keeping the wrong company brings failure\nI got a billion lies to tell ya\nCuz ya'll can't handle the truth, here's the proof\nNobody sings better than Nate (Heeey Ohhh)\nIt's a mistake when you hate and disrespect the golden state\nI go straight for the jugular vein\nWho got game like a castrated man that you cannot hang\nAnd havin' no nuts is a fucked up thing\nGet your head outta you're ass and use your brain\nIt's a short ride to the top and a long way down\nRoll it up, take a few puffs, and pass it around\n\n[Chorus: (Nate Dogg)]\nI like that ass, so back it up (Heeey Ohhh)\nIf the boys start acting up\nGive them what they want (Hey Oh, Hey Oh)\nWhat they want (Hey Oh)\nThey want (Hey Oh)\nThey want ([3x:] Hey Oh)\nYou know all day we be givin' it up (Heeey Ohhh)\nBig drawers, Big Dreams, we be livin' it up\nGive them, what we want. (Hey Oh, Hey Oh)\nWon't stop now, we'll never stop ([x3:] Hey Oh)\n[2x:] Heeey Ohhh, Hey oh, hey oh, hey oh, hey oh, hey oh, hey oh"}], "artist": "Nate Dogg"}