{"songs": [{"title": "Hundred Dollar Bill Skyscraper", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Verse 1: Big Sean]\nNow gimme everything I ask for or end up in a cast ho\nNever slowing down that's why I'm gettin' paid fast-forward\nStanding on my money, that's a cash flow (oh)\nSmokin' medical, sippin' chemical I need a labcoat\nFrom where they livin' off food stamps that's past poor\nThought about it as I got a stamp in my passport\nYeah I made it out, made it up, and I'll remain makin' it up\nNever satisfied what I make, no such thing as makin' enough\nBitch I'm livin' like its monopoly\nTryna dodge jail and I'm buyin' up the property\nYo wifey was down with monogamy, til' she started massagin' me\nBut you can't have a dollar ho, blame it on the economy\nA young player at the tip-top\nBitch niggas hatin', bad bitches wanna liplock\nI could show you the ropes, since I got the game in a slipknot\nFrom a city of G's I'm just the one that was picked out\n\n[Hook: Big Sean]\nWake up in the morning, first thing I need is my paper paper paper paper\nYa might pass out and die if ya try and match my labor labor labor labor\nMan everytime they see me they say boy whatcha doin (woah) boy whatcha doin? boy boy whatcha doin?\nBitch I'm tryna build a hundred dollar bill skyscraper scraper scraper stackin' my paper\n\n[Verse 2: Mac Miller]\nBitch, unzip my pants fore you try and take them off\nOpen wide, say ah then you cough\nSee I got so many shows, think it's a season of Lost\nGet money uniform, you can see I'm on my job\nAh damn, bitch you better stand in your lane\nAll my jams are so insane, you just Danity Kane\nStraight pussy, and no balls\nRockin' jeans and thug sandals, that's a faux pas\nHave em all like (Oh God) Everytime we showin' off\nTrue players what we is and true players don't dissolve\nThey evolve into a Gotti, was illa then you thought you was\nNow we in Bugattis ridin' shotty when we shoppin' for some good shit\nI don't claim no hood shit\nBut I guarantee you I ain't on that Hollywood shit\nHey, unless it's chilling up at Holiday Hills\nAnd that's sixteen bars, all of em ill (What)\n\nSay Say Say\nTrue players what we is and true players don't dissolve (6x)\n\n[Hook: Big Sean]\nWake up in the morning, first thing I need is my paper paper paper paper\nYa might pass out and die if ya try and match my labor labor labor labor\nMan everytime they see me they say boy whatcha doin (woah) boy whatcha doin? boy boy whatcha doin?\nBitch I'm tryna build a hundred dollar bill skyscraper scraper scraper stackin' my paper"}], "artist": "Big Sean"}