{"artist": "ILL BILL", "songs": [{"title": "14 Years of Halftime", "lyrics": "[Intro: Riya Mae Braunstein]\nHi, this is Riya. Congratulations Eclipse on your fourteenth anniversary of the Halftime Show!\n\n[Verse 1: ILL Bill]\nHoly shit, it's fourteen years already E, where did all the time go?\nI remember when you did your first Halftime Show\nLike it was just yesterday evening, goons is creeping\nHebrews blacker than Zulus and Guidos rocking wife-beaters\nEclipse rocking FatBeats, hoodies and fondle up shirts\nHim and (???) put in remarkable work\nI did this show so many times over the years for the right reasons\nFind a way to civilize a trife heathen\nThe ILL Bill collective, suicide king, my sounds are hard drugs\nWe God’s thugs, popping off guns, you lost blood\nLike you lost your head\nTalking to me is like having your fortune read\nBy a fourth-century sorcerer that tortures men\nThen try to walk the subway platform with gats drawn\nLike a postal worker coming home drunk and just lost his job\nThat’s what we dealing with in Roman times\nI never liked school, those fucking devils always told me lies\nAnd tried to brainwash, we know the value, everybody fucking hates cops\nAnd if you blasted one you gained props\nHyper shit, Roddy Piper shit, tiger-striped and sniper shit\nNone of these fucking idiot can DJ like Eclipse\nFuck that! He be on top going for Fourteen Years of Rap\nIf you love the real shit, give him dap\nCongrats to (???) and PD Cologne too\nWednesday nights at , WNYU\n\n[Verse 2: Q-Unique]\nIncineration of your whole Generation X\nBetter place your bets (???)\nDJ Eclipse (???) got the sign blinking\nConsider it illiterate, you can’t read between the lines\n(???)\nExaggerated existence of commercial sounds\nLike pussy politicians got political prisoners locked down\nKnock down and hit you with the impact of a DJ skid scratch\nWith a big gat that'll flip your wig back\n(???) like a board of secret cult\nThe vital data that can shatter government bodies\nRock parties like a boulder rolling through a nightclub\nOne might bug at the fact\nFourteen Years of Rap got me underground dap\nI’m past that like I missed my stop on the A-Train\nHere’s the weight gain from the great brain\nPass the spray paint!", "image": "https://images.genius.com/8ada7e190ceb4cd543137da9736ec2ae.640x640x1.jpg", "album": "Howie Made Me Do It 3", "year": "2013-11-26"}]}