{"artist": "Prince Po", "songs": [{"album": "Animal Serum", "title": "Machine Rages", "image": "https://images.genius.com/bcc0b72953588145b6c14022fc08642c.700x700x1.jpg", "lyrics": "[Intro]\nThe time, time, time is 2000 and now\nThe location, planet Earth!\nBullshit motherfuckers don't talk about\nThey knew shit, knew shit, knew shit!\nRages!\n\n[Verse 1]\nOur [?] of survival, and quicksands of injustice\nWe racial profiling and human rights on crutches\nPlus the political corruption got people demanding answers\nNobody gives a fuck no more than either taking chances\nFlip that quarter quick, copping stacks from sanchez\nPut one in the chamber, had to pack between the branches\nGovernment money launderin' [?] like spreading cancers\nThe World Trade disaster was just the wars cash advances\nNeglected too much office meds and back on campus\nTo take innocent lives just to ease the pain\nWhile we continue to ask why, still no answers\nBut I know you can't embrace the sun and I believe in rain\nFuckers digging up dirt are causing these avalanches\nThe people put in work, but can't make ends meet\nYoung mothers struggling with hungry babies and shitty pampers\nSo the world should understand being a slave ain't sweet\n\n[Hook]\nThat's why it's rage against the machines\nIt's rage against the machines\nThe lies of propaganda got me ready to scream!\nI refuse to bury the dream\nReturn democracy, plotting the genes of property\nGot a lot of hostility, it's more than the cream!\n\n[Verse 2]\nThrough swamps of the struggle is sand storms and scandals\nAmongst whoremongers will [?] label us vandals\nSeparating racist beliefs, stating the nation\nUsing taxpayers money for gambling and taking vacation\nStart from the fuss like Spitzer\nDrinking old hoes, how would one sudden afford of education?\nBut won't allow fellows, but focus on occupation\nTrying to leave us down and hopeless, boxed in the Matrix\nGot backs against the wall, rebellious the guns drawn\nLooking at the millions who're starving, you've done wrong!\nChoosing our targets in this modern day 'nam\nAnother mother crushed for their child runs in the arms\nPolice don't serve and protect, them beasts is a threat\nThey fought East serving death, I walk in peace in Tibet\nI'm wiping off the scars and the youth is getting old\nBlood, sweat, and tears, grease loose wet\nBack from my rap face, literal shrapnel\nAddicted to morphine, trapped in the capsule\nHonorable discharge, the scarred and homeless\nOfficers full of shit, jobs bomb like roaches\nMe and Strap lacking medical insurance\nCivilians are getting jacked, rebels sad and notorious\nFull body armed up in this state of emergency\nTwelve gauges started blast and back at the perjury\n\n[Hook]\nAgainst the machine!\nIt's rage against the machines\nThe lies of propaganda got me ready to scream!\nI refuse to bury the dream\nReturn democracy, plotting the genes of property\nGot a lot of hostility, it's more than the cream!", "year": "2014-02-04"}]}