{"songs": [{"title": "DAS CAP", "album": "Lil Boat 2", "year": "2018-03-09", "image": "https://images.genius.com/c5ccfc3f04970ad45b0bbde6ea1fa1ac.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, you ever looked at a nigga, like, who was just poppin', poppin' shit and you just knew he was, knew that nigga was broke?\nBroke ass nigga\n\n[Chorus]\nThas cap, talkin' online you get papped\nMy young nigga keep a strap, drive with a strap on his lap\nFuck postin' up in the trap\nI'm finna cop me a island, yeah, and put myself on the map\nRich and it ain't 'cause of rap, yeah\nBitch I ain't rentin', I hop in a Bentley, it ain't got no ceilin'\nYou mad? Fuck ya feelings\nBitch I ain't rentin', I hop in a Bentley, it ain't got no ceilin'\nYou mad? Fuck ya feelings\n\n[Verse 1]\nAll of my niggas be wildin' (Wildin')\nStay with the cannon, the gang wildin' out\nNigga don't talk about stylin'\nI stay with the drip, put it all in her mouth\nNew coupe, it came with twin turbo\nSendin' 'em bullets like Tony Romo\nPut that bitch on the syrup, it's slow-mo\nPullin' off with the gang in a four door (Skrt)\nCheck, check, check, check, check, check, check it out, uh\nI'm with the static like radio, why do your pistol shoot vertical?\n\n[Interlude]\nMan, you niggas ain't shootin' at nobody man\nYou niggas shootin' in air man\nAll these niggas do is flodge, flake, and beef through texts\nMan these niggas is hoes\nNiggas ain't gettin' no goddamn money man\nAnd thas cap, these niggas ain't, these niggas ain't gettin' no fuckin' money\n\n[Chorus]\nThas cap, talkin' online you get papped\nMy young nigga keep a strap, drive with a strap on his lap\nFuck postin' up in the trap\nI'm finna cop me a island, yeah, and put myself on the map\nRich and it ain't 'cause of rap, yeah\nBitch I ain't rentin', I hop in a Bentley, it ain't got no ceilin'\nYou mad? Fuck ya' feelings\nBitch I ain't rentin', I hop in a Bentley, it ain't got no ceilin'\nYou mad? Fuck ya' feelings\n\n[Verse 2]\nOkay, I'm tryna fuck a new bitch\nI'm tryna make a new flip, hittin' home runs like Chip, huh\nYeah, fuck with a nigga (Fuck it)\nFuck with my money, we might have to cut us a nigga\nAin't no debatin' with none of y'all niggas\n22 diamonds, that shine in the picture\nMenthol, shorty blow dick like Newport (Newport)\nHundred thousand dollars in the Jansport (Jansport)\nStackin' money tall, make a camp fort\nFuck it\n\n[Interlude]\nMan, man you know the world would be a lot more truthful if you had to pay a lie man\nThese niggas be lyin' out they ass man\nJust talkin' for no reason\nCappin' this, cappin' that, I don't understand that, you never capped on nothin'\nI'm the youngest nigga, I mean everything I say, I do what I say you feel me?\n\n[Chorus]\nThas cap, talkin' online you get papped\nMy young nigga keep a strap, drive with a strap on his lap\nFuck postin' up in the trap\nI'm finna cop me a island, yeah, and put myself on the map\nRich and it ain't 'cause of rap, yeah\nBitch I ain't rentin', I hop in a Bentley, it ain't got no ceilin'\nYou mad? Fuck ya' feelings\nBitch I ain't rentin', I hop in a Bentley, it ain't got no ceilin'\nYou mad? Fuck ya' feelings\n\n[Outro]\nHop in the Maybach, hop in the hop in the Maybach, yeah\nHop in the Maybach, hop in the hop in the Maybach, yeah skrt"}], "artist": "Lil Yachty"}