{"songs": [{"title": "All Your Fault", "album": "Dark Sky Paradise (Deluxe)", "year": "2015-02-24", "image": "https://images.genius.com/740ca6fe7862ad174446f7794050b7a4.1000x1000x1.jpg", "lyrics": "[Produced by DJ Mano, Kanye West, OG Webbie, Travis Scott & WondaGurl]\n\n[Intro: Kanye West]\nYeah, and we G.O.O.D\nKeep talkin' about this shit but whatever\nWe can go back and forth all day\n\n[Chorus: Kanye West + Travis Scott (Ambrosia)]\n(How much I feel, I live for your love)\nLit for your love baby, lit for your love\n(Live for your love)\nLit for your love baby, lit for your love\n(Live for your love)\nLit for your love baby, lit for your love\n(Live for your love)\nLit for your love baby (Straight up!)\n\n[Verse 1: Kanye West]\nThat's that don't play! Whuh! That's that new Ye\nPeople sayin' I'm the closest thing to Mike since Janet, whuh!\nTom Cruise, homie, we jumpin' up on them couches\nThat's a fresh house, is that a guest house?\nYour house got another house?\nYour bitch got a bitch, your spouse got another spouse\nYoung Walt Disney, I'ma tell you truthfully\nIf you leave Mickey you gon' end up with a Goofy\nI imagine that's what Chris told Karrueche\nGirls be actin' like it's diamonds in they coochie\nI don't give a fuck, I don't give a fuck\nBut cops chokin' niggas out in the media\nWe finna have to protest and tear the city up\nWe 'bout to tear this whole place up, pretty much\n(How much I live)\n\n[Bridge: Kanye West]\nAnd you know it's all your fault\nNobody, nobody, nobody, babe\nYou know it's all your fault\nNobody, nobody, nobody, but me\n\n[Chorus: Kanye West + Travis Scott]\nLit for your love baby, lit for your love\nLit for your love baby, lit for your love\nLit for your love baby, lit for your love\nLit for your love baby (Straight up!)\n\n[Verse 2: Big Sean]\nHoe, we done made it through hell and disaster\nMy crib done got bigger, my women got badder\nYou wonderin', \"How do you get in the game?\"\nI'm wonderin', \"How do I get to the rafters?\"\nOh boy, I'm mad until these records gettin' shattered\n'Til I'm MJ or Magic, ooh, and she just want the status\nSo, you the man she got, but I'm the man that she been after\nShe done sent so many naked pics, my phone ain't got no data\nI walk off in New York like my name Derek Jeter\nHeaded home to the D where you know I keep a Gina (Gina!)\nI'm the good with the evil; fuck you, nice to meet you\nYou can't have a peace sign, man, without the middle finger\nWith the clique when you see us, that's my family to me\nThat's my family tree, they're my arms, legs, hands, and my feet\nAnd I can't cut them off with even diabetes\nHit the beat and kerosene it; scratch that, I white sheet it\nA 100 dollar fade every single time you see us\nBeen a king all my life so I shoulda got a Caesar\nSomewhere off in Vegas rollin' dice up at the Caesar's\nGot me thinkin' back bout how I used to roll to Little Caesars\nPiece of pizza with Tanisha now I'm with a Boniqua\nShe finna blow at that\nI got your dream girl, yeah, she actin' like a hoe at that\nThrow her to me, I'ma throw that back\nTop spot, I'm finna go at that (Straight up)\n\n[Chorus: Kanye West + Travis Scott (Ambrosia)]\n(I live for your love)\nLit for your love baby, lit for your love\n(Live for your love)\nLit for your love baby, lit for your love\n(Live for your love)\nLit for your love baby, lit for your love\n(Live for your love)\nLit for your love baby (Straight up!)\n\n[Verse 3: Big Sean & Kanye West]\nHoe, you gotta move quick\nWorld in my hands, I ain't gotta loose grip\nI don't like loose pussy or loose lips\nAnd I done did the impossible a few times, Tom Cruise shit\nHoe, and I ain't satisfied bein' on that top five list\nI ain't satisfied until I'm on that all-time list\nTil everything I spit is all timeless\nMy girl on that all fine list\nMy life a little luck, a lot of grind, bitch!\nNo \"maybe,\" hoe, I gotta make it\nFuck your nomination; man, fuck the world\nI'm repopulatin', wrap my Rollie round my waist\nYeah, time's a-wastin'\nNiggas want the comma-comma-combination\nLong as I'm around, it's gon' be dot-dot-dot, a lot of waitin'\nGot my pinky on her brain while I'm gettin' brain\nPlottin' world domination, people ask me how to make it\nI'm just like \"man, if you want the crown, bitch, you gotta take it\"\nStraight up (Straight up!)"}], "artist": "Big Sean"}