{"songs": [{"album": "I’m Serious", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg", "year": "2001-10-09", "title": "Grand Royal", "lyrics": "[T.I. - talking]\nWhat? (Nigga, what)\nI'm the King of the Motherfuckin south. (Huh, what? I'm T.I.P nigga)\nPicture that, nigga (Try me then nigga. King of the South)\nI ain't got no hits\nNigga, kiss my ass, nigga (Bust me then, sucka. Yeah, yeah, yeah, yeah, yeah)\nNigga, I been bustin'. You don't like it. Outbust me then, nigga\nNigga, I can fight nigga. I can say what the fuck I wanna say, nigga. (PSC)\nKing of the got damn south. Bust me then, nigga\n\n[Verse 1]\nMight see T.I.P in one of them drop things\nWay down the block, man\nSwervin in and out of lanes, gettin some hot brain\nI'm tellin ya, I'm hot man\nFrom here to Scott Lane\nYou know the day I drop, man\nShawty, I'm not playin\nNow hold up, st-stop dammit\nShawty, you're not jammin'\nIf you hear one more, got dammit\nI-I-I can't stand it\nI'm taking over spots to damage that B.I.G and Pac image you got\nStop dick ridin, your shit's tired\nI doubt if even your bitch buy it for six dimes\nI can't see how niggas who not spittin ask why they not winnin'\nOr why their record not spinnin, why niggas not feelin it\nCause that shit is not real, and we know you're not ah killin shit\n\n[Hook 2X]\nCrown damn royalty\nShawty, I must be\nWhoever wanna shut me, uh-up\nJust outbust me\nUntil then I'm king of it, don't act like you ain't know it\nYou wanna be supreme, of it, go get 16 for it\n\n[Verse 2]\nI been spittin since way back like the seats in the Lac, nigga\nSince the days of 97 sacks in the back of the trap, nigga\nI ain't a rap nigga, I just happen to rap\nWith a gift\nI ain't gotta act and still I'm hotta than that nigga\nI think all of ya wack niggas should give your plaques\nTo the real killas and crack dealers for writing your script\nGet a grip, you need your ass whipped, for tryin to be famous\nEverybody know my flow is chainless and that's how I remain\nIt's T-I-P, K-I-N-G, O-F-D-A-S-O, ah U-T-H\nLabeled as one of the greatest when it comes to the flow\nGive a damn what you think\nCause if the legends of the south ain't complainin\nLike Outkast and Goodie Mob\nWhat the hell and the fuck do I care what you sayin\nI'm T.I.P\n\n[Hook 2X]\n\nWhat, what, what\nYal still ain't heard\nPussy nigga, yal still ain't heard\nT.I.P., King of the South, shut your motherfuckin mouth\nOr come see bout me, homie\n\n[Verse 3]\nWell, whether you can't live with it\nOr you just can't love it\nOne thing that you can't say\nIs shawty it ain't bustin\nI was the King of the South before my single was out\nI gave you everything from the hoes to the dope game\nNow hold up, wa-uh-wait shawty, wanna buy at 8 shorties\nSo go and get the weight shawty, out of the safe for me\nThey all can go for 140, meet me at 1:40\nNow hey, don't play no games with me\nI ain't no lame sissy\nAll I'mma bring wit me, is the niggas who hang with me\nThey smoke and drank and slang with me\nSo they'll bang with me\nKnow if they came with me, that they down to die for me\nOr bust a 45 at the blink of a eye for me\nNow don't be fuckin round, before you be duckin down\nYou ain't goin hear that bustin sound\nTil right 'fore you touch the ground\nNow know that AK'll turn you browner than Bobby\nAnd I was raised in the yay, rappin just was my hobby\nI'm king of it\n\n[Hook 3x]\n\n[T.I. - talking]\nWhat?\nKing of the South\nMotherfuck yal niggas\nWhat?\nNigga, yal don't know\nThis my city, nigga\nATL, nigga\nWhat?\nI washawty born and raised, nigga\nDie here\nBorn and raised, nigga\nBankhead-born, Bankhead-bred\nOne nigga down goin be Bankhead dead\nNigga, what?\nOutbust me then\nATL in this motherfucker\nYou don't like it, nigga\nKiss my motherfuckin ass\nGet a Benz then talk, nigga\nI don't give a fuck what you think about that little bitty-ass house you got\nNigga, get a house on a lake\nThen come tell me somethin, nigga\nYou don't like down south\nFuck you then\nGot plenty dick for your mouth\nHo ass nigga\nI can fight\nCome see bout me\nHo ass nigga\nPSC in this muthafucka"}], "artist": "T.I."}