{"artist": "Ice Cube", "songs": [{"title": "Gangsta’s Fairytale 2", "lyrics": "[Intro: Little Russ]\nHey motherfuckin Cube, what the fuck wrong with you? You didn't kick the rest of that Gangsta Fairytale shit. Why don't you kick it one good time? Niggas on the playground wanna know what's happenin. You left em hangin man, what the fuck?\n\n[Verse One: Ice Cube]\nLittle Boy Blue is outta Folsom\nNow them three little pigs gotta roast him\nDrivin down Sesame Street and I bet\nThat little motherfucker's out fuckin Smurfette\nAin't saw the wolf yet, but it's no doubt\nThey'll catch his ass slippin at his grandma house\nThey got the Mac-10 pointed out the coupe\nCause they gotta follow they nose like Fruit Loops\nPeeped out Little Miss Muffet on her tuffet eatin grits\nShe saw the Mac-10 and the bitch had the shits\nRan into her house, called up her crew\nCause Red Riding Hood wants to kill Little Boy Blue\nAnd the wolf too, what is Mister Rogers doing?\nMoved out his Jordan, bought him a Ewing\nHim, Little Boy Blue and the wolf in the cellar\nPlanning on gettin Cinderella\nCause Cinderella still works for the pigs\nThrough with the dwarfs, fuckin Bebe's kids\nNow Snow White got the horny ass fever\nFuckin the Beauty's Beast like Jungle Fever\nNow the word's on the street\nWhen the crews meet\nYou better make some fuckin room\nCause it's on with the pigs and them other nigs\nWhen the cow jump over the moon, everybody jump\n\n[Verse Two]\nNow Little Boy Blue is up front\nWith the nine millimeter, ready for the hunt\nLittle Red Riding Hood caught his ass slippin\nDrew down on the boy cause the bitch is set-trippin\nAbout to get loose with the deuce deuce\nThat's when the boy said, \"What about the gang truce?\"\nThe little ho had no words\nThe wolf came around and the bitch got served\nThree little pigs bought wigs\nDressed like sheep, Cinderella is Little Bo Peep\nTryin to creep, on the crew\nThe wolf, the Rogers, the Blue, they through\nCause the pigs did the buck buck bang, ping\nNow you hear the fat lady sing\nCinderella, ran like a bitch\nTo the pay phone cause the bitch is still a snitch\nNow the pigs are caught by the pigs and taken\nIn the pen to get fried like bacon\nYou still can't trust no ho\nAnd Ice Cube'll tell the kids how the stories, should go\n\n[Outro: Little Russ]\nYeah Cube, man that shit was dope nigga! You all that and a bowl of grits. Nigga that shit was on props, nigga! Yeah that's how you kick that shit for the ninety-deuce, nigga. What's happenin nigga?! Yeah nigga that's Gangsta Fairytale part 2 nigga. All you trick-ass niggas can't fuck with it", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg", "album": "The Predator", "year": "1992-11-17"}]}