{"songs": [{"album": "Hood Politics V", "image": "https://images.genius.com/1d41e14a37194abf4f8777c7434614de.500x500x1.jpg", "year": "2008-09-30", "title": "So Amazing", "lyrics": "\"I'll tell you this much, you know a good thing when you see it\"\n\"We gotta, move to a different place\"\n\n[DJ Premier] {*scratching*}\n\"Thief-gangsta-pimp-hustler\"\n\"Are you ready?\"\n\"Termanology\"\n\"Are you listening, do you know what I sayin'\"\n\"Ter-Ter-Ter-Termano-Nology\"\n(Jadakiss: \"Try to tell 'em that it's the flow, son...\")\n\n[Verse 1]\nAyo, Scratch Magazine said the flow is untimely\nThen they ask why haven't Eminem signed me\nI ask myself the same question every day\nWhen I'm sweatin', still baggin' up grams of boo-lay\nYo, Jay, you should really hit me up\n'Cause I can go to the Roc or Roc La Familia\nBring that stock up\nYou could stock up\nOn a couple platinum plaques, I'll throw the Roc up\nJust some shit I thought up, but it probably works\nSo hit me if you need some quality work\nI'm the most underrated\nUnderestimated\nUnsigned new cat to rap\nSee, I hit every label up\nThey said, \"Damn, you could rhyme\nYou the best cat out we can't sign\"\nWell, that's fine, 'cause I'm a remember\nEach and every one of y'all faces when I make it\nPreme\n\n[Scratched Hook 2X]\n\"Termanology\"\n(Big L: \"I'm deadly when I pull the pin out\")\n(Posdnous: \"Every word I say should be a hip hop quotable\")\n(Jay-Z: \"The flow's so amazing, nigga\")\n\n[Verse 2]\nAyo, who you know nicer than Term, riddle me this\nIf you don't say Rakim, you better say 'Kiss\nStyles P, Kool G or Pac\nAnybody else, I put 'em up in a box\nThey say lyrically, I'm the new AZ\n'Cause if I really wanted to I could keep up with Nas\nTerm is like Earth, Wind & Fire, rims and tires\nBut you can't ask people, they biased\nI'm the flyest sire of this side of Elmira\nI'll walk past papayas and into the fire\nI'm, chillin' with Mya, crushin' Mariah\nWhile I'm fuckin' with Tyra, you fuckin' Elvira\nI got Latino respect like Carlito\nSince way back with Stretch and Bobbito\nI'm in the lab, it's just me and Primo\nThe ghost of James Brown and the soul of Chris Rios\n\n[Scratched Hook 2X]\n\"Termanology\"\n(Big L: \"I'm deadly when I pull the pin out\")\n(Posdnous: \"Every word I say should be a hip hop quotable\")\n(Jay-Z: \"The flow's so amazing, nigga\")\n\n[Verse 3]\nPuff hear this, take a meeting the next day\nI won't say shit, I'll just tell them to Press Play\nYo, Dre, you should hit me with some beats\nI'll write the whole Detox in one week\nThe sun rises in the East but it sets in the West\nSo I ain't got an 'S' on my chest\nI'm the best new artist out that's on the market\nWho you think your girl filling up her iPod with?\nYou give me a mil? I'll turn into 50\nWatch me diss every muh'fucker who ever dissed me\nMy kicks is crispy, sippin' on a Formula 50\nBitches sayin' when I'm tourin', they miss me\nI'm so Ludacris, I could be DTP\nGet it crunk like TVT\nThese A&R's hear me, they gon' lose it\nMan, it's just Common Sense, it's G.O.O.D. Music\n\n[Scratched Hook]\n\"Termanology\"\n(Big L: \"I'm deadly when I pull the pin out\")\n(Posdnous: \"Every word I say should be a hip hop quotable\")\n(Jay-Z: \"The flow's so amazing, nigga\")"}], "artist": "Termanology"}