{"artist": "Casey Veggies", "songs": [{"title": "Dreams & Egos II", "album": "Customized  Greatly Vol. 2", "year": null, "image": "https://images.genius.com/1a029e524a5e116fb4512ade4b883627.756x720x1.jpg", "lyrics": "[Hook: Casey Veggies]\nYes sir, the texture is fresher\nI'm next up, expect us, we better\nMy dreams got me like \"Oh, where's my cheddar?\"\nMy ego got me like \"Homie, you ain't [?]\"\nYes sir, the texture is fresher\nI'm next up, expect us, we better\nMy dreams got me like \"Oh, where's my cheddar?\"\nMy ego got me like \"Homie, you ain't [?]\"\n\n[Verse 1: Casey Veggies]\nI be thinking like we don't think alike\nHomie step back I need space to write cause I need space to write\nCall me Satisfying Veggies, I give 'em what they like\nI spit that out of sight, I am brightest in the light\nI be on some other shit, no I do not balance right\nI had to switch it up, credit I don't get enough\nThat's why I'm sliding my ATM like nigga what\nI'm from the West but I flow East\nTell me who I do I compete with? You niggas easy\nYou gotta believe me\nMy dreams is like graduation, my ego was late registration\nAchieving my goals like having babies\nSo I'ma keep pushing until I make it, make it\n\n[Hook: Casey Veggies]\nYes sir, the texture is fresher\nI'm next up, expect us, we better\nMy dreams got me like \"Oh, where's my cheddar?\"\nMy ego got me like \"Homie, you ain't [?]\"\nYes sir, the texture is fresher\nI'm next up, expect us, we better\nMy dreams got me like \"Oh, where's my cheddar?\"\nMy ego got me like \"Homie, you ain't [?]\"\n\n[Verse 2: H.O.P.E.]\nSee I am here to cut addicted like woah\nOn my money making mission, I see dollars I go\nWhen I get back anybody in my position\nI told LAPD dodger I don't hide O's no more\nThink about it, this is top tier\nDo not fear unless we in the same lane\nWe ain't in the same lane, we hardly do the same thing\nI critically think why you here rapping about the same thing\nEat these little niggas up, smile and let my fangs hang\nJeans pressed, tailored tight, shit I'm sitting pretty, huh\nSwear I'm taking all the shine I don't even give it none\nStars getting brighter, you just fighting for attention, huh\nYou gon' make a big scene, go and get you some\nHey, this where I cool out, cool out\nI just chill and bud out\nBring the drinks and food out\nIf you ain't ultra real then I don't care what you bout\nIf you ain't ultra real then I don't care what you bout\n\n[Hook: Casey Veggies]\nYes sir, the texture is fresher\nI'm next up, expect us, we better\nMy dreams got me like \"Oh, where's my cheddar?\"\nMy ego got me like \"Homie, you ain't [?]\"\nYes sir, the texture is fresher\nI'm next up, expect us, we better\nMy dreams got me like \"Oh, where's my cheddar?\"\nMy ego got me like \"Homie, you ain't [?]\"\n\n[Verse 3: H.O.P.E.]\nI'm king capital Ego everywhere that we go\nHaters bound to build up, I give it the old [?]\nHit the spot in slow-mo, my presence is on Tivo\nChuck the deuce, grab my money and hit the streets, yo\nCheck my sneaks yo and my seams yo\n[?] but you ain't this clean though\nUncle Dave beats make a nigga speak slow\nFollow the leader, nigga\n\n[Verse 4: Casey Veggies]\nMy old lovers talk to me then don't hear from me in weeks\nThey have visions of me coming back but it's something I don't see\nI McLove it on the beat, I be killing when I sleep\nSuperbad with the pen and pad, really rad it's really sad\nThat's you can not keep it up\nChilling man, my sneakers up\nEvery beat, I beat it up so niggas want the features huh\nFeed 'em nuts, they eat it up, you quirrel niggas acting sus\nThe act is up so back it up\nWe back on the bus\n\n[Outro: Casey Veggies]\nWe got them dreams and egos\nWe got them dreams and egos"}]}