{"artist": "R. Kelly", "songs": [{"album": null, "year": null, "lyrics": "Everyday and night I pray\nLove will swing you back this way\nLife without you here with me\nAin't the same without you g\n\nBaby hear me, I never meant to hurt you\nBaby come and talk to me\nLet me know what's on your mind\nEvery time I see you\nYou're running from me all the time\n\nBaby hear me, I never meant to hurt you\nI only wanted you to be happy\nYou to have the best of things\nTo be down with me, baby\n'cause your lovin', it's so good\n\nYou're giving me the run-around\nThought our love was going down\nBaby don't you know\nThat I'm down until the day I die\nBaby hear me, never meant to hurt you\nNow you know i'll never do anything to hurt you\n'cause baby I love you\n\nEvery night and day I pray\nYour love returns\nOh I'd give my life\nIf it would only make you happy\n\nRap (notorious B. I. G)\nSittin' reminiscin' on when you started dissin'\nSpittin' in faces in public places\nRolexes with faces had you chipper for months\nMade some dough, did some shows, now you're starting to front\nSmokin' blunts on the veranda with amanda\nShe's fillin' your head with he said, she said\nPoppa doin' this, poppa doin' that\nBut don't tell him I said it 'cause my jeep might get wetted\nForget it, go on take her word like the koran\nYa'll stay friends, i'll stay and smoke phil benzs\nHoneysuckle sets, biggie secret pyjama sets\nYou were the reebok vandal, now you were chanel sandals\nI made you - why would I play you?\nThink about it while the streets you roam\nIt's all peas and crispies in the fridge when you get home\n\nChorus\nYou to be, be happy\nYou to have the best of things\nBaby everything you want it for baby\nYou to be down with me\nSo give me that ass back baby\n'cause your lovin' is so good, so damn good, babe\n\nEveryday and night I pray love will swing you back this way\nLife without you here with me ain't the same without you g\n\nChorus", "title": "Be Happy", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}