{"artist": "Apathy", "songs": [{"title": "All I Think About", "image": "https://images.genius.com/073ac226410c8abcffb60094f9a7e61b.700x700x1.jpg", "album": "Honkey Kong", "lyrics": "[Hook]\nCatch your, catch your, catch your, catching wreck on the M-I-C\nWhat must I say?\nWhat must I do?\nTo show how much I think about... (catching, catching wreck on the M-I-C)\nWhat must I say?\nWhat must I do?\nTo show how much I think about... (catching,catching )\n\n[Verse 1:Apathy]\nAfter Ap unloads, get these rappers to explode\nReadin' maps to magic roads with John Walker sat in robes\nThe messiah, crucifier\nWho is flyer, There; elusive as Lucifire(Lucifer)\nI fuel the fire, usin' music to inspire\nUzi does it, uzi did it, let my uzi spit it\nDon't confuse me with them dookie motherfuckers gettin' shitted out\nSpit it out, slit their throat and slowly I'mma bleed 'em out\nThis the Garden of Eden so best believe I weed 'em out\nJust because it's pussy doesn't mean I'll always eat it out\nHonkey shit, 'Moby Dick', classics you should read about\nBuggin' out, gotta chill, 40 ounce, pop a pill\nTurn your burners around like the cover for Kill At Will\nHoly smokes, pour some liquor out and if your homie croaks\nHeard a rapper bitin' my steeze, well I hope he chokes\nVanderslicin' everything in sight, it's like I handle light\nAnd through this mic recitin' frightenin'\nHave your family candle-lightin'\nWaitin' for this rocket to launch, to try to hit the Sun\nHave a séance in the Bronx to channel Big Pun\nI'm a phantom with fans that beat up rappers I hate\nYou'd think they fat kids, the way they always after my cake\nMy jet's on Jupiter, my mansion's on Mars\nI spend a Saturday on Saturn, slow dancin' with stars\nThis is music where you find a female and form a fetus\nA rollerskatin' jam hand-crafted by a genius\nAnd if you smoke trees, you're halfway through the blunt\nOr dick deep in some cunt, bitches hate when I'm blunt\nSee the only thing that's badder is the '87 Mattingly\nScratch that, take it back, '011 Apathy\n\n[Hook]\nCatch your, catch your, catch your, catch your break on the M-I-C\nWhat must I say?\nWhat must I do?\nTo show how much I think about... (catch your, catch your break on the M-I-C)\nWhat must I say?\nWhat must I do?\nTo show how much I think about...\n\n[Verse 2:Action Bronson]\nYo I was born to be a king where smokin' drug is a mandate\nMade somethin' outta nothin', now controllin' the landscape\nBad grapes swellin' in a glass, yo I'm educated\nMind levitated, crime and family separated\nMy hands are placed right at the top of the chopsticks\nStatus in society is high like my optics\nSay a couple words, the people scream for joy just to get a chance to meet\nSmoke some reefer wit your boy\nNever really thought the kid would rap\nNow it's a simple fact\nMy flow is Hookers at the Point the way I hit the track\nI'm all day with it, pissin' in the street\nJust like my daughter at the park, you get lifted off your feet\nMy bars are heavy like Olympic liftin'\nPlace raided by siftin'\nA-I-R inscripted on the side of the Pippen's\nNever sniffin', motherfuckers need to learn and listen\nBronsolinio,hard cover, first edition\n\n[Hook]\nCatch your, catch your, catch your, catching wreck on the M-I-C catching wreck on the M-I-C\nWhat must I say?\nWhat must I do?\nTo show how much I think about... ( catching wreck, catching wreck on the M-I-C on the M-I-Con the M-I-C)\nWhat must I say?\nWhat must I do?\nTo show how much I think about... ( catching wreck, catching wreck in Connecticut)\nWhat must I say? (catch your, catch your, catch your, catch your, catch your break in New York)\nTo show how much... (catch your, catch your, catch your, catch your break in Connecticut)\nWhat must I say? (catch your, catch your, catch your, catch your, catch your break in New York)\nTo show how much I think about... (catching , catching wreck on the M-I-C)", "year": null}]}