{"artist": "Phora", "songs": [{"album": "Yours Truly Forever", "title": "Forever", "image": "https://images.genius.com/358d401afbd509d000a77d9819b74fe2.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYeah, you said you need some assurance, I wrote this song for you\nI've been stressin' and I don't know how to talk to you\nI've been dealin' with pressure, our picture's still on the dresser, when it comes down to it, trust me, I'd give it all to you\nBefore you, I ain't know what happiness is\nA type of love I was missin' back as a kid\nI'm livin' life on the edge, I've been takin' risks\nI'm—too young to worry about marriage and having kids, but\nYou make me think about it, like really think about it\nYou say you just need an answer, I try to creep around it\nBut the truth is I'm just scared of commitment\nMy parents separated young, shit, I want this to be different\nI wanna—get to know you from the inside-out\nI know you know I got a past, I know you still got doubts\nKnow I still do a couple things that you still not 'bout\nThere might be a couple girls that I still need to cut out\nBut I brought the scissors with me\nI could be your caretaker like SZA with me\nI just wanna love you, that's the mission with me\nJust promise not to switch up and be different with me, yeah\n'Cause things change and people change, but I've learned that's just emotions sometimes\nI ain't noticed love was blind until I opened my eyes\nStayin' up late nights, we never notice the time\nEven though we distant I just hope I'm still on your mind, like\n\n[Spoken]\nYo, what's good?\nLook, I ain't even tryna fight with you right now\nI'm just—I'm just sayin', look\nWe've been through way too much to just let this shit go like that\nI wanna make this shit work\nIf you love me like you say you do\nCut the games, cut the bullshit, let me know how you feel\nThere's no one else out there for me, but you\n\n[Verse 2]\nYeah\n3 In the morning, I'm steady thinkin' 'bout you\nYou on my mind so often I barely sleep without you, yeah\nIt's crazy I'm not complete without you\nPeople around me, they check themselves 'fore they speak about you\nBut—you should know that you're still the one for me\nInstead of tryin' to come for me, you should comfort me\nYou really need to stop textin' sayin' you done with me\n'Cause everytime you on that type of shit it just fucks with me\n'Cause I've been goin' through it, you know I'm goin' through it\nYou know I'm dealin' with family issues, I'm goin' through this\nMotion in life why I've stressin' like crazy\nAnd I've been lettin' pressure get the best of me lately\nBut I want them late nights with you\nThem date nights with you\nThem all around the world, takin' plane flights with you, it's real\nHow you feel? I ain't lyin', I need you\nWe've been way too distant lately, tell me, when can I see you?\nIt's like, I know you need someone who can be faithful to you\nBut you need someone to prove it, not to just say it to you\nSee, I'm just tryna put these pieces back together\nI can promise you I'll stay, but I can't promise you forever, like\n\n[Spoken]\nNah, look\nI'm done arguin' with you, I'm done arguin' with you\nHold up, listen\nFor real?\nOkay, that's how you feel?\nHaha, wow, you crazy\nSo what time can I come over?\nAlright, I'll be there", "year": "2017-08-18"}]}