{"songs": [{"year": "2014-11-11", "album": null, "image": "https://images.genius.com/ca6c7a32de158ddf997e1a7037e56e95.600x450x1.jpg", "title": "How Childish Gambino Made Things Easier For Kids Like Me", "lyrics": "The sky is black, the stars haven’t come out yet. Not to say it isn’t bright though. It’s a bunch of teenagers standing in a field in Georgia. The brown grass is wet but crunches underneath their feet. The children of Little 5 Points, the ATLiens, the losers, the well dressed, the freaks, the geeks, the nobodies, the somebodies. Waiting. Anxious. Staring at their phones (always connected), smoking cigarettes, looking cool or just looking. Waiting. This is Atlanta. No, this the internet. No, this is behind the internet, behind those trendy avi’s tweeting Young Thug and Young Lean lyrics and retweeting the unfound. The Deep Web is here. Waiting. These are the kids that had no voice—not before, not on this scale. Waiting. Waiting for it to speak.\n\n“If it rains I’m going to do a show for free next week OK?” – Donald Glover, speaking to a small audience at one of his impromptu public listening sessions\n\nFor some reason all these kids—who don’t really share much in common at first glance—came to this field. To hear someone, to feel something. This is where it starts. This is where it ends.\n\nChildish Gambino isn’t the renaissance man. People have done this shit before. Jamie Foxx did it. Some would say Jamie Foxx did it better, with way more appeal to way more people. But the problem in art—and right now rap and rap culture is the art—is that a weird black kid that’s kinda ugly who gets his sister to drop him off at South-Dekalb Mall can go into the BEST BUY, pick up a Jamie Foxx stand-up special, a Jamie Foxx movie, and a Jamie Foxx album with his birthday money and he won’t feel anything in between them. While he saw the same name on three different items, what he was really getting was three different products, saying three different things, talking about things that he can’t connect with. Even though he saw three different products of Jamie Foxx, through three different mediums, they’re so conflicting that at the end he has no idea of who Jamie Foxx REALLY is. He felt nothing.\n\nThis is the problem in art. Rinse and repeat with a Kanye album and Kanye movie, Degrassi and Drake? Let’s not go there. Rap music is unique in the huge disparity there has almost always been between the rapper, who we may see in person or in interviews or whatever, and who he is or pretends to be when he is rapping. Anyone can rap. Anyone can make a stand up special. Anyone can act. Anyone can be themselves. But very few can do all of those different things at one time and really be doing one thing. Be sending one clear message about who he is to the world. Something real.\n\nWhen that black kid is walking around his all-black high school, listening to the album, it’s not just an album, it’s something he can connect to. Another soul he can relate to. Someone who talks about the same shit he sees, feels, and hears every day in the streets and hallways. Living on the outskirts of Atlanta. Too black for the whites and too white for the blacks. The lanky white kid from The Woodlands who runs cross country but smokes weed everyday with friends who he’s not sure really give a fuck about him. He can relate. As can the boy from Nowhere, Texas who doesn’t have any friends and spends all day on Twitter to pass the lonely time. He can’t help but notice this guy who acts like him and thinks like him, and talks about the shit he sees on the internet and makes it real. So can the black girl from just outside Philly who tried to kill herself three times. Or a slacker/class clown in Palo Alto who loves jokes but also knows what it feels like to be alienated because you’re different. They can all take something, because Gambino gives everything. He puts his whole self into his work and distributes it in such a way as to be accessible to everyone, no matter what their skin tone is, who they follow on Twitter or whether they like the book or the movie better—because they’re both dope.\n\n“I got really lost last year. But I can’t be lonely though. Cause we’re all here. Stuck here.” – Excerpt from a note Donald Glover shared on Instagram last year\n\nThere’s a certain world out there, behind catchy word play and 808s, underneath jokes about racial identity and insecurities. Every artist since forever—from da Vinci to Drake—has wanted to split their heads open on the sidewalk and spill their emotions into the world, for everyone to love, ache, and hurt as they did. And every artist since Da Vinci has come a little bit closer to breaking down that barrier between the artist’s deepest feelings and the audience.\n\nAs of the day this article is published, Gambino has come the farthest. He takes the lyricism of Lil Wayne, the insecurity of Drake, the honesty of Kanye, and spits it back out at you in five different languages just in case you didn’t understand one. If you couldn’t hear how sad and confused Glover was on Because The Internet, you could visualize it through screenplay, you could see it in his interviews as ‘The Boy,’ you could read it in his notes on Instagram. Those notes read like something close friends and family would bury with their loved one. They didn’t sound like the normal things we all share with the whole world. What he did instead was selfless. Gambino gave a part of himself to the world that he can never, ever get back. It belongs to me now, it belongs to you, to those teenage girls on the bus, to that chocolate boy in Atlanta.\n\nThe internet was something that nobody could have predicted 50 years ago—it’s pretty ridiculous actually. The Boy can show himself in a quarter of a second as if you’ve known him for years, smoked weed with him in glass houses, talked about your deepest fears and insecurities staring at a bonfire, laughed with, grown with. It’s to invite the whole world INSIDE YOU, point out all your flaws and be open to all the malice, hatred, and insults all very real because thats you they can choose to love or hate, accept or reject, not some fake, manufactured facade. The fact of the matter is, it’s not that Drake or Kanye can’t do what Gambino is doing, it’s that they don’t dare to. And who would?\n\nAt 17 years old I wrote an album. I wrote an album about depression, love, memories, and a lot of other dreamy teenage bullshit. I didn’t write an album about the internet. I created something that was a product of it. I wrote all of the lyrics and my BFF Romil produced the entire thing. The thing that was special about the album, however, wasnt the album. It was the way we released the music that made the album something fresh. Inspired by this short film NOAH, and with a lot of help from my friends, especially HK, we used the internet as a medium. Our artwork, our videos were all based on the concept of the audience seeing what I see when I’m most vulnerable, when I turn on my macbook. People can read the textedit diary entries I posted on instagram and look directly into my life, into my screen, same thing.\n\nI wouldn’t have been able to release that album if the black dude who kinda looked like me didn’t share his stories and ideas and take on the world with the world. With the rap world. He’s brave. He’s brave enough to say, “Hey I Like this. I look like this. I talk like this. I made this. Do you like it?” Kanye gave people careers off of a sound he made with an album. He kicked down doors and made it possible for guys like Cudi and Gambino to work. Gambino is doing the same for kids like me—kids who are in their bedroom, spending hours trying to create something that’s bigger than the music. Bigger than uploading a song on SoundCloud. It’s bigger than themselves. Gambino has created a world and all of his fans have gotten lost in it. They want to know what comes next. Where does the story go? That inspires the fuck out of me. That’s what I’m doing with my art, and that’s how Childish Gambino made things easier for kids like me. He made it clear."}], "artist": "Kevin Abstract"}