{"artist": "C-Bo", "songs": [{"title": "Deadly Game", "album": "Til My Casket Drops", "year": "1998-02-24", "image": "https://images.genius.com/dc4336c862301b0ea11cc46a1958acbe.500x500x1.jpg", "lyrics": "[Verse 1]\nYou know I never was no choir boy\nYour folk's got a gang of priors\nMaybe that's why the one-time's be trifling\nTrying to give a young nigga thirty-five to life\nWhen I ain't even done nothin wrong, officer\nI have no info to offer you\nHe asked my name, so I came off the brain\nTold him, \"I'm John Doe and this is my ho Jane\"\nHe said, \"Smart mouth nigga, don't make me do you\"\nPut my thumbprint in his high-tech computer\nMy name came back with a warrant, felo-nies\nNow they got me downtown, spread my anus\nButtock, I'm like, \"What the fuck is it now?\"\nHe said, \"You robbed a liquor store; we know where, when and how\"\nIt's foul, they got a nigga tore up from the floor up\nMy mom in the courtroom looking like she 'bout to throw up\nIt's a strong armed robbery, strapped in the commission\nAt my pre-trial conference, D.A. had a proposition\nHe said if I lose at trial I'd get 38 with the L on top\nBut take the deal he'd give me five with having most of the charges dropped\nHopped on the deal quicker than Flash, it's sad\nI admit that, but two and a half ain't bad I got getback\nThey sentenced me to five, two I gotta bring\nIt's only strike one swing, batter-batter, swing\n\n[Chorus]\nIt's 1-8-7 on the D.A\n'Cause they ain't trying to give a young motherfucker no leeway\nYes, yes... y'all\n1-8-7 on a whole courtroom, motherfuck 'em all\nYou better swing, batter-batter, swing\n'Cause once you get your third felony, it's fifty years you got to bring\nIt's a deadly game of baseball\nSo when they try to pull you over, shoot him in his face, y'all\n\n[Verse 2]\nFresh out the pen, unrehabilitated\nDoing hella good, and my P.O. hates it\nHates dick, she's a dyke lesbian bitch\nCan't wait to violate for me for some petty-ass shit\nI got to get a job, so I'm filling out applications\nFighting the temptation, to slang [?] uh\nMinimum wage don't get it\nFive bucks an hour don't cut it, man, I ain't with it\nSo fuck it, I went and struck it rich on a dope sack\nMy homie gave me two, and told me to bring him four back\nNow, it's time for me to start having things\nI flips me a Coupe and painted it candy apple green\nIt gleams, clear coat sprayed on thickly\nFools out to get me 'cause my shit is looking sticky\nI'm at the club and I can feel them suckers scoping\nI'm knowing they plotting on me, but I'm still hoping\nThat they won't fry me, unless they wanna die\nThey will be dripping more blood than Mrs. Simpson was\nSho' nuff, ain't no bluff, here them suckers come\nGot me reaching up under the panel to handle the forty-four caliber gun, uh!\nSpun his ass around with one of the fat Magnum rounds\nGot him on the ground making funny sounds, oh!\nI got a problem, witnesses--ten\nPositive identifacation\n\n[Chorus]\nIt's 1-8-7 on the D.A\n'Cause they ain't trying to give a young motherfucker no leeway\nYes, yes... y'all\n1-8-7 on a whole courtroom, motherfuck 'em all\nYou better swing, batter-batter, swing\n'Cause once you get your third felony, it's fifty years you got to bring\nIt's a deadly game of baseball\nSo when they try to pull you over, shoot him in his face, y'all\n\nOn swoll' in the pen, cellmates with X-Raided\nNow I'm on parole, five years later\nThe Bo loc is ready to have me a ball\nFuck my P.O., I'm goin AWOL\nAnd you all can suck this dick\nI'm sick and tired of going through all this bitch-made shit\nI got two strikes right now as we speak, and peep\nI'm not 'bout to let you motherfuckers do me\nA petty with a prior will buy your fate\nWith Wilson in the office, you gets no date\nSo I'm putting all my belongings on Greyhound bus #22\nBound to another state, me and my crew\nUnpacked my shit, stacked my grip\nCalifornia and Pete Wilson can suck my dick!\nAnd if you didn't already know that you couldn't trust his ass\nJust look how he did Polly Klass\nUsed her death and her family's name\nSo he can yank more votes and political fame\nIt's a shame that I'm the one they say is a monster\nJuvenile delinquent, steppin out of sync with\nBut fuck that, I ain't going out like a punk\nThat ain't my style, rip him from his ass crack to his nut sacks\nNow, they wanna kill a nigga like me\nI blast one, I blast two, that's strike three\n\n[Chorus]\nIt's 1-8-7 on the D.A\n'Cause they ain't trying to give a young motherfucker no leeway\nYes, yes... y'all\n1-8-7 on a whole courtroom, motherfuck 'em all\nYou better swing, batter-batter, swing\n'Cause once you get your third felony, it's fifty years you got to bring\nIt's a deadly game of baseball\nSo when they try to pull you over, take them on a chase, y'all"}]}