{"songs": [{"title": "Strong (Remix)", "lyrics": ".[Verse 1: Young Dro]\nSmoke one the strong way, roll one the long way\nFine ass bitch, hey, she fucking with my feng shui\nWeed all in my eyes, I'm finna cry\nWeed in the brownie pies, body high\nThey trippin' cause my eyes red, I look like a pothead\nY'all niggas monkeys so I'm bout to go bananas\nEverything I ride flip flop, yeah, Tropicanas\nPut deuces in the Phantoms, west side of Atlanta\nI'm the same nigga told you bout salamander sandals\nUh, getting head in a bunkie, rolling up a dutchie\nBitch, I want my number back, your pussy musty\nFuck that bitch, trust me\n\n[Hook: Young Dro]\nMan, that weed strong as fuck (x4)\nWho got strong? (Who got strong?) (x8)\n\n[Verse 2: 2 Chainz]\nWearing shorts in the winter time, don't pay me no nevermind\nAnd, if it was a swag race, I'll beat you niggas to the finish line\nWoke up in first class with my dick hard, sold so much work, I need a brick card\nPull up to the spot with my tint dark, I rent pussy, I don't rent cars\nParking lot pimping is my forte, I get head for the foreplay\nSmoking cookie with my girl named Cookie and I guess she going both ways\nI got wax in my trippy, I don't need a lighter, I got wax in my trippy\nI done bought everything off the racks up in Fendi\nWhen I leave the store, it smell like a motherfucking hippie, hey!\n\n[Hook]\n\n[Verse 3: Young Dro]\nShawty said she got that burning pack, I am too high to determine that\nI'm geeked up off the chief, talking to me, gotta run it back\nCharlie Sheen, all that, roll up a ball bat\nI'm in the hotel with two lesbians, where the fuck y'all at?\nI'm with the coalition, team, pouring up this lean\nDrive a nigga bitch cray till she need a Ritalin\nSmoking out the back of cars, man, we just a bunch of stars\nBlack kush up in my cigars, I am high off this planet, Mars\n\n[Hook]", "album": null, "year": "2013-11-14", "image": "https://images.genius.com/134a4872ea91075f919728667ab13bf3.877x877x1.jpg"}], "artist": "Young Dro"}