{"songs": [{"year": "2016-08-29", "lyrics": "[Verse 1: B.o.B.]\nYou feel that?\nThat's the sound of the kids...\nWith no fucks to give\nWith no luck for shit because they didn't grow up as rich\nThat's the sound\nThat's the sound\nThat's the sound of niggas locked in the pen\nDoing a bid with more time then they should give\nThat's the sound of an oppressed nation\nTired of chasing villains that don't got no faces\nThat's the sound of a nation that don't got no patience for faux proclamations\nWarlocks in churches in sacred locations\nThe sheriff’s a Klansman, the judge is a Mason\nNot to be biased and not what your faith is\nBut how do I trust my own country and state that's more loyal to Satan then their own occupation?\nThe system is rigged, if I vote will I change it?\nGreed will consume us with no moderation\nBlame for a beast I'm not sure I created\nI'm not sure I'm created, like I'm inside a game I'm not sure that I'm playing\nIt's a whole operation\nWhether it's real or whether they staged it\nShit get so tense when I go out to places if I fuck around and sneeze in the air I can break it\nAnd people feel so violated, you feel what I'm feeling before I can say it\nBefore I can step in the studio to lay it\nI know what my role is I know I ain't basic\nBut I guess the truth must hurt, I guess that's why they butthurt\nAll the secrets that I unearthed no stone left unturned\nTo learn to fly you gotta jump first\nI touched the sky that's why I'm sunburnt\nI change a life in only one verse\nWelcome to the seventh pinnacle\nSomewhere between the metaphysical and hella spiritual\nI seen hell and hell is digital as well as visual\nHell is how they did the Aboriginal\nHell is when the innocent get murdered and they don't arrest the criminal\nOh my, oh my god, oh my god, take the steering wheel 'fore I do something that I ain't intend to do, no interviews!\nPacing in my living room!\nB.o.B. what's gotten into you?\nYou wiling you advantage [censored] shit like you are invincible!\nPeople always ask me \"Jeez why you still living dude?\"\nShit I wonder why I'm living too!\n\n[Verse 2: B.o.B.]\nWhy I'm living too\nWhy I'm living too\nSay whats wrong with me? Shit whats wrong with you?\n'Cause me I'm feeling good\nMe, I'm in my zone I look up in the sky, and I know this can't be home\nAnd I know I ain't alone\nThey try to take your home\nThey try to sway the weak, and they try to break the strong, huh\nBut I'm not a quitter\nGod's child not God's dinner\nOn God I'm Godzilla\nTry to plot, I'll make the plot thicker, huh\nSee the middle class got a lot slimmer, and the upper class got a lot richer\nThey want a revolt, they want you to riot, they want you to try it\nThey wanna provoke us to keep us divided, but the people are no longer quite\nThey say Bob they gon' to take you out if you keep rhyming this way!\nHuh, I say fuck it we all going to die anyways", "title": "ESCAPE", "album": "A.I.R. (Art Imitates Reality)", "image": "https://images.genius.com/5c49104d5de1bbfefcb27959d392d8c4.1000x1000x1.jpg"}], "artist": "B.o.B"}