{"songs": [{"image": "https://images.genius.com/c93362744a33b4196acf0d52520994c4.264x264x1.jpg", "album": null, "title": "I’m Coming", "lyrics": "[Verse:]\nYou wanna see a lot of me\nSo I hate when I talk to my boy from pen and he\nActs like cuz' you forgotten me!\nI ain't got time to shit let alone come check you blud\nYou know I'm her property\nI got property\nRight now I'm in Europe fucking up shit\nMore than the economy\nSo when you land you know I got you properly\n\n[Chorus:]\nI bring my people through it, everything I\nDo\nYou reckon me I fuck wid' you\nAhhhaaa\nIf you a snitchin' little bitch and you love\nSingin' to the blues\nWell this song wasn't made for you\nAhhhaaa\nI'm coming\nI'm coming\nFor you\nAaaahhaa\nI'm coming\nI'm coming\nFor you\n\n[Verse 2:]\nYo, fuck so good make a bitch wanna fight me\nWanna Rolex ring Wiley\nWhen I was a bum, no-one really liked me\nNow it's time someone went a got a new job for Tinie\nI'm only playing\nI'm just saying, I'mma shit so hard I'm constipated\nOverworked, underrated\nNow my tings poppin' off, no gun relation\nGrind all day but I ain't roller blading\nAll eyes on moi, holla baby\nNo love for the ex, on that note T\nTell Kelly I've got that motivation\nLook I beg, someone try find Max online and let her know I wanna smash her\nFrom the back\nIf not Sarah Jane come give me brain and put them big red lips on my sack!\nI'll be killin' cause I'll be getting bred\nHard doe, number 1's all day on the chart show\nSo fuck you and your 90 track mixtape\nThat's a million bars of arsehole\nMy flows are wrecked and it opens legs\nIt's fly than a motherfucking jumbo jet\nWhat a selfish bastard, no respect\nYou know dapz, no regrets\nI still roll through my hood and I wear my chain\nFuck a top boy Scorcher and Bashy can't do the same\nReal recognised, reaaalll\nHow many albums have you sold today?\nI ain't saying I'm Wayne not Kanye\nBut I'm living life on the runway\nIf your 9, I'll be like 'Welcome on board my brudda, say bye to gun play'\nKing of the jungle, hardest can be, I dare you to let your chick party with\nMe\nI'm Tarzan and I'm hung like a tree\nImagine if your new born pops out looking exactly like moi\nBanter, but on the real tell her get her on pampers because I'll be on the\nTour bus getting pampered\nI heard Simon Cowell thinks I'm a little wanker\nAnd I'm getting on his tits like cancer\nAnd I don't wanna start mentioning names\nWhere they all now? There bankrupt!\nJoe Mcelderry, oh what a stand up!\nAlexandra, pull your socks up!\nWhere you hits at? You ain't no winner!\nI feel bad cause your voice is amazing but your careers getting raped by a\nMason\nThat shit fucking upsets me, cause it don't get me, try bring them near me\nComing round with their hands out, wanting a hand out, ahhh that's too\nPolitical\nI don't care about a Bentley, Gucci or a fendi, man's living in a\nSpaceship!\nYou got clapped by a, bang! Your girl got mad by a bang! That smooth\nCriminal\nI'm a product of my environment I ain't sayin' me and you are any different\nI'm just planning an early retirement\nI don't mean sorry when I say I'm going Kingston\nEvery man's welcome to fly long distance\nWe be on the beach with Weed Man Winston! Winston!\nPlus I'm the craziest thing out the United Kingdom\n\n[Chorus:]\nI bring my people through it, everything I\nDo\nYou reckon me I fuck wid' you\nAhhhaaa\nIf you a snitchin' little bitch and you love\nSingin' to the blues\nWell this song wasn't made for you\nAhhhaaa\n\nI'm coming\nI'm coming\nFor you\nAaaahhaa\nI'm coming\nI'm coming\nFor you\n[Outro:]\nI ain't even going in, I'm just fucking around\nThey just words\nYou know me\nI'd rather be singing my shit anyway\nYou got kids motherfucker\nPooomblayyy!", "year": null}], "artist": "Dappy"}