{"songs": [{"image": "https://images.genius.com/3fafe062032c4ec3d42f4b11c25a02a1.375x375x1.jpg", "lyrics": "[Skit: DJ Clockwork]\nYo, I'm fucking zooted right now in the fucking bathroom, dog. And, you know what I'm saying, I'm just recording this shit cause I feel like I got so much fucking shit to say and like, you know what I'm saying, this is the only way that I'ma get it out\n\n[Intro]\nYeah, can I get the littlest bit of reverb on my voice?\nI'm trying to hide from something, I just don't know what\nOh, it's not sad baby, you know\n(Between heaven and hell)\nYeah, um, I saw a mountain, you know across the horizon\nWhen I got there realized it was just a pile of rocks\nYeah, so God damn\n\n[Verse 1]\nI wonder if everybody hope\nThat this song is not depressing as the last one was\nCause Heaven smell like Nag Champas\nCome here darling, ash my blunt (Smoke)\nWaiting on hallucination, ain't a single fact I trust (No)\nDear family, my sanity go down when my cash go up\nRap too much, how the fuck to get through the verse\nI came from house parties\nFind a bitch and go through her purse\nAll I need is a little good pussy and whole lot universe\nI met God before I ever stepped into a church\nAnd that motherfucker still owe me money\nOhhh I need a religion to follow\nI swear to God that I got more problems\nThan there is bitches in Carlow\nLord have Murciélago, yeah\nAnd I don't know how the fuck I'm supposed\nTo look into my parents eyes when I'm scared to die\nMy eyes same color as a cherry pie\nWoah, see I'm terrified\nCrucifix heavy, who gon' carry mine?\nYeah, what's with all this talk about Hell and Satan\nAnd sleep deprivation\nIf this is planet Earth, then my hell's a basement\n\n[Hook]\nAscension\nA brand new me\nYeah, yeah\nWhy you wanna do me like that, Miss Conception?\nBetween heaven and hell\nWhat's between heaven and hell?\nA brand new me\nOh it's a brand new me\n\n[Verse 2]\nOkay, if I could tell these kids one thing\nJust make sure handle your business\nA criminal leave no witness\nAnd don't ever trust these bitches\nWhat happened to your life when your house become a home\nWhere your children at? Where your children at?\nYou got two sons, all they do is fight\nYou up through the night like gimme-gimme-gimme that\nYeah, nice titties, got a pic, go and send me that\nSendak books, can you give her that?\nFuck rap, make a million off a shitty app\nYeah, smoke trees in the cab\nPittsburgh, show you where the city at\nAnd don't forget that H, get you smacked in your face\nGot so many sons, I was young, now they half my age\n90K out in Portugal, smile on my face, backlit stage\nMy bitch batshit crazy and that shit fascinates me\nYeah, on my tongue where the tab is\nAnd it burn like battery acid\nI was in the backs of my classes\nBy the kids having asthma attacks\nCause he panicked every single time he sat on his glasses\nEvery Wonderland have a Alice\nYeah, but I'm a king God can I have a chalice\nI'm demanding the truth, put your hands to the roof\nBe a man, that's a challenge\n\n[Hook]\nAscension\n(Challenge, are you up for that challenge)\nA brand new me\nYeah, yeah\n(Yeah, everybody got to have balance)\nWhy you wanna do me like that, Miss Conception?\nBetween heaven and hell (Salvation)\nWhat's between heaven and hell?\n(And the underworld, welcome to Heaven\nBut I gotta keep that bitch waiting)\nA brand new me (Fascinating)\nOh it's a brand new me\n(And that's fascinating, please be a little patient)\n\n[Outro]\nOoh, I ain't a doctor, could you be a little patient?\nYeah, be a little patient\nEverything will be okay then, if you be a little patient\nOne world, one nation, done waiting\nYeah, yeah, um\nNow I'm still sipping moonshine\nWe discovered a new high, me and Jerm done this a few times\nYeah, but who's high now\n(I can't believe I done changed my life around)\nTalk a lot of shit but will you die now\n(I been wanting to cry over this shit. Every day I think about fucking dying)\nWhat you gonna do when everybody die out, just go die out\nLet's ride out", "year": "2015-09-18", "album": "GO:OD AM ", "title": "Ascension"}], "artist": "Mac Miller"}