{"songs": [{"lyrics": "Cook it up spooky salute\nLook 'Zook'll hook it up to\nShoop the local Winnie Cooper loopy\nLow brow, low brim\nShe asked me, \"What's your name?\"\nI flashed the grossest fang in show biz\nYoung Valkyrie is open, \"What's yours?\"\n\"Um, Jenny, um...\"\nBody clocked in a ten-penny sum\nSprung colossal, \"Miss, may I process your Pentium?\"\nBut Ae is hesitating\n\"My princess\nThe pigeonholing rose out your predecessor's lunacy in the kismet\"\nHer eyes googled back as that of one unfortunate breed plus a new kink in the posture\n\"Just don't get all barnacley\nOr get P.T. Barnumed in 3D THX sound stereo dismissal\nSorry hun, it's just the last few have been a fistful\nLike.. like them girls you bump into out dumb luck\nGet high and innocently kiss once when she's punch drunk\nWatch her misinterpret the moment tongues touch\nCrazy McCling-a-lot claim instant one love\nAnd you've gotta beg your friends to take 'em off your hands like thumbcuffs\nOr them barbies you'll vibe for a sexy second (lovely)\nGive it a month Hyde heckles Jekyl and she makes Hitler look cuddly\nBut Jenny in the sky with emerald eyes\nYou're so different so delicious so the fish\nI'd be willing to walk the limb with\nSo let's just get a few things out the way: (okay)\nI'm clinically bonkers and hate just about everyone God's great earth offers\nI won't be getting dressed up to impress your family dear\nAnd if I can't wear jeans and sneakers then I won't be lamping there\nNope, aggro-pimp, sinfully, finicky nova, bag it up no-diggity soldier\nMagic touch fingertip donor\nOwn up to your dirty debutante animalistic instincts\nRitual courting dance and breeding behaviors (like what?)\nI dream of Jeannie and fucking her obsecenly\nBut Jenny could be Jeannie so easily if you'd let me\nHell, the bad tact daddy-o Merlin-- 'e' for effort\nMost of these high-post Fabio world motherfucks make my head hurt\nDead up-- I got death in the skull but you'll get used to it ma\nDinner and cinema, yes, just cough the bread up\nSure, he schleps with a naked pocket but I carry dreams\nLike I wanna be an astronaut after you marry me\"\n(WHAAAAT???)\n\"You're rushing this I feel smothered it's crowding me awfully\"\nDolly, I love you, \"Get the fuck off me!\" Sorry. (Call me)\nAnd I'm circling her like a tiger shark frenzied but friendly\n\"I'm cool, how you feeling Jenny?\" (Jenny?) Jenny? (Jenny?) Jenny?\n\"So quiet, oh I like that, so mysterious, I dig it\nThe way you haven't made eye contact with me once in ten minutes\nI'm just saying girl, I'm dirty-dog raw vintage mixed with mega-low society\nMister gutter-fuck etiquette - try me!\nSo there it is, game. I mean it's not like I'm sweating you\nBecause when it comes down to it, most of y'all females are the same\nBut now it's your turn baby, spit it out\"\n\"Okay\" She punched me dead in the fuckin mouth and walked away\n\nOw! Fuck!\n\nWatch out ladies cause you know he don't love ya\nBazooka Tooth is one bad motherfucker\nHe's a low life pimp with a low life game\nHe needs a no life dame with a strobe light frame\n\nCook it up now\n\nNo ring on the finger\nThere ain't no strings attached\nBut if you love television and\nManic depression\nGet a carton of cigarettes\nAnd we can make it happen\nGet to mackin'\nJust leave your baggage on my curb with the trashcans\nIt ain't like I seen you in Maxim\nRelax with the tap dance\nLights, camera, lap dance!\n\nCook it up now", "title": "Cook it Up", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}