{"songs": [{"title": "ASAP Dicky", "album": "Hump Days", "year": "2013-06-26", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nHey what's up y'all?\nIt's ya boy Dicky, AKA Yung Dick\nA$AP Rocky beat\nA$AP, I'm fuckin' witchu\nIf you tryna like, get on a track, collaborate, I'm wit it\nOr like\nEven if it's like just getting brunch\nI get brunch, if you wanted to\nI don't know if you get brunch but you should\nMy treat\nSo, alright, hold up\n\n[Verse 1]\nRiding through your city, tryna find some titties\nI'm high enough to think I might be dying, word to Whitney\nVagina, chicken, sticky, that's all you gotta give me\nAnd I'm 'bout it, 'bout it, ain't no doubt about it\nLil Dicky ehh?\nHeard he spit that witty ridiculously, offensive shit\nHeard he got expensive shit, heard that he resent his dick\nYou heard right muthafucka\nI'ma a bright, coy, white boy, kike muthafucka ehh?\nSo whatchu fittin' to do\nI got a bitch she brought a bitch now ma dick dinner for two\nOkay das fiction but admit it that I'm spittin' it smooth enough\nTo get a Jew wit some scruff to mack a beauty wit boobs and a butt\nAnd plus a flat ass navel, twistin' that, no dreidel\nFrom the back so fable of me (woof)\nCream cheesin , philly bred - so bagel of me\nWhen dicky dead, this ain't never gonna be..so\n\n[Hook]\nWho said you can’t live forever lied\nOf course, I’m living forever I’ll\nForever, I’ll live long\nYou can’t ever deny\nMy force, I’m living forever I’ll\nForever, I’ll live\n\n[Verse 2]\nAnd I been rollin wit a fatty\nBoneless chicken patties\nBeen clubbin like this muthafucka's rollin' wit a caddy\nAnd now that I been rappin, all these bitches holla me\nHad to put a daily cap on the head, no Aladdin\nKnow I'm average looking, and I'm bragging bout getting chickens\nBut this spitting got me positioned to be banging out bitches\nOutta ma league...Jeff Teague bangin on Griffey\nWould never happen less you happen to be hanging wit dicky\nOh yeah I'm white, killin' brothas like I'm up in the klan\nBeen fucking fly faced honeys like I'm up in sudanm so damn!\nI'ma spit it 'til I get a buggatti\nAnd body two hotties, who bodies\nFugazi, punanis tsunami -- das wet\nPuffin' sticky, you ain't fuckin' wit lil dicky\nBumpin' biggie, humpin' giddy\nCummin quicker than ma internet\nI got high speed internet\nSpittin' mad ignorant\nSicker than a muthafuckin' immigrant\n\n[Outro]\nLike, 1930’s type immigrants\nI feel like all them ma' fuckers got polio or some shit\nThat’s why everybody now got AIDs\nUh anyways, appreciate the support\nSo Hard, download that shit\nUh, yeah, I'm out\nHolla back\nL-D\nYeah"}], "artist": "Lil Dicky"}