{"artist": "Famous Dex", "songs": [{"year": "2017-09-15", "album": null, "image": "https://images.genius.com/a257a03f4e2e50206124ebd7182c626f.591x591x1.png", "lyrics": "[Intro]\nWhat's my real name?\nNo, I said what's my real fucking name?\nI need y'all to say it out loud\nDexter, uh what\nI got 50, I got 50 in that Glock\nI got it now\nUh ya, uh what\n\n[Verse 1]\nKeep a Glock with me and I ain't lacking (I ain't lacking)\nRun up on his ass y'all already know it cracking (uh what)\nGot my diamonds on me, oou, bitches smacking, oou\nI got some bitches shaking ass ya its smacking, oou (ya uh dexter)\nYea looking good (what), yea I'm from the hood (ya bitch)\nYa I keep a 50 now wish a nigga would (pow pow)\nYa 5 gram rollin' backwood (backwood)\nNow its 7 grams in my backwood (ya uh what)\nDrinking lean, huh (drinking what), holdin' magazines (ya huh)\nFreshest magazine, yea I am cracking everything (ya uh dexter)\nGot your bitch up on my dick, I keep a stick (pow pow)\nI was broke but fuck now that nigga rich (ya uh what)\nCallin' me Dexter (what), poppin' pills I do whatever (whatever)\nRaf's on and Margiela's (oou), that nigga as soft as a feather (what)\nPinky ring like the weather, ballin' mazi for the leather (skrt skrt)\nPop a xan I feel better (uh what), off the xans I feel better (ya)\nGivenchy, you ridin' Honda I'm ridin' in the Bently (skrt skrt)\nLook at his pockets empty (uh what), I know his pockets so empty (ya)\nCome near me (oou), Come fuck your bitch she can't come near me (can't come near me)\nI got my diamonds they clarity (uh what), I got my diamonds they clarity (ya uh dexter)\n\n[Refrain]\nYa, uh what, oou\nLook at my diamonds they clarity\nLook at my diamonds they clarity\nYa, oou\nBoy you can come near me\nBoy you can come near me\nSkrt skrt skrt\nYa uh a dexter\nPoppin' the pills oou\nPoppin' the pills oou\nPoppin' the pills oou\nPoppin' the seal oou\nDrinking the seal oou\nDrinking the seal oou\nYa, what\nUh Dexter\n\n[Verse 2]\nPull up with a Glock (pow pow)\n30 in my mouth (30 in my mouth what oou)\nI get this money never stop (money never what haha)\nAP on my wrist I had to check the clock (ya uh dexter)\nYour bitch all up in this cock (oou)\nMaybe get away got 50 in that Glock (oou)\nI got 50 in that Glock\n[?]\nI got 50 in that Glock (ya uh dexter)\n\n[Outro]\nI got 50 in that Glock (ya uh what)\nI got 50 in that Glock (ya in that what)\nI got 50 in that Glock (50 in that what)\nI got 50 in that Glock (50 in that Glock)\nBitch ha\nDexter!", "title": "I Got 50"}]}