{"songs": [{"album": "Stoic", "image": "https://images.genius.com/815db944cfd1552de023107589d7e376.1000x1000x1.jpg", "year": "2012-09-30", "title": "Blapper", "lyrics": "[Intro: T-Pain]\n\n[Verse 1: T-Pain]\nI keep seeing niggas tryin' to be my duplicates\nRunning round acting like they be the poop and shit\nLike they made a new groove and shit\nI'm the leader of the new school and baby I got proof of it\nI pop my collar girl got these rapper niggas singing like we are the world\nHoller girl they calling me a switcher\nOr is it the switches on this Impala girl\nI talk shit cause I can\nSmoking on that green we goin' green eggs and ham\nAdada mean adada say I'm superclean get out my face\nI had to go get F.A.B. again and\nTha Bizness on this motherfucker slap again\nNappy boy bitch you know the team\nIf you ain't get the picture yet check your photo stream\n\n[Chorus: Krizz Kaliko]\nThis right here on the trump nigga that shit bump\nNigga that shit bump, nigga that shit blank\nNigga that shit slap, nigga that shit blap\nSo I'mma call it blapper, blapper\nBlapper, blapper, blapper, blapper\nBlapper, blapper, blapper, blapper\nBlapper, this is a blapper\n\n[Verse 2: Mistah F.A.B.]\nT.U.K. tu-tu-turn up king\nYou niggas turn down like turnips\nGet your girl wetter than a scuba if she smell like tuna\nShe get kicked out the ride no fifa\nSo much T.R.U. religion I'm Buddha, got hoes like Luda\nI will never ever miss a Monifa\nTurn the music up I'mma pop a speaker\nShe hit me on Twitter cause she know that I'm a tweaker\nWhat you doing brah? shit I'm 'bout to murder this feature\nPain put me in the game no bleachers, see ya\nSee my style and wanna snatch it, fires\nLater wanna call hifi ratchet (Stop it)\nThat's just LOL I know you don't hear me on the radio well\nI don't give a F\nI'm going to the right and you goin' to the left turn it!\n\n[Chorus: Krizz Kaliko]\nThis right here on the trump nigga that shit bump\nNigga that shit bump, nigga that shit blank\nNigga that shit slap, nigga that shit blap\nSo I'mma call it blapper, blapper\nBlapper, blapper, blapper, blapper\nBlapper, blapper, blapper, blapper\nBlapper, this is a blapper\n\n[Verse 3: Krizz Kaliko]\nKali to the ba-uh-bay, ba-uh-ba-uh-baby\nShout out to the ba-uh-business, rockin the pavement\nI can get belligerent, ignorant, Christopher crazy\nDeliver it hot, like it's fresh up out of the bakery\nA hell of a nigga, you ain't seen me on television and\nEveryone listenin', me and Nina be in your system\nI still go Stewey-ooey, making your girlfriend get real gooey-ooey\n816 boyz Missouri-ouri\nThis shit slaps like a bad kid\nTecca Nina but Teddy Pain look what F.A.B. did\nI finger it like it's the sphincter of a bad bitch\nThis beat is so thick look like it already done had kids\nSo put this in your speaker box\nCall it an old school prank, cause this nigga knocks\nWe reppin' from the bay to the A to the K to the C\nIt's a blapper with a capital B\n\n[Chorus: Krizz Kaliko]\nThis right here on the trump nigga that shit bump\nNigga that shit bump, nigga that shit blank\nNigga that shit slap, nigga that shit blap\nSo I'mma call it blapper, blapper\nBlapper, blapper, blapper, blapper\nBlapper, blapper, blapper, blapper\nBlapper, this is a blapper\n\n[Verse 4: Tech N9ne]\nI-dada mean, Molly is my medicine\nMy mind, my dream, have her looking elegant\nMy highlight is goin' fly by my wi-dife\nAnd hoin' my life is triumph for no one but that's irrelevant\nI'm tryin' to party, bitch I ain't the president\nI don't swat flies, cause bitch I am an elephant\nI'm in the party like dada-dada\nDrinking with N.O.R.E. you know we got nadda fama\nBut I peace for sex and, she's my best friend\nIf she sleeps with Tech then keep a heap of cheques in\nMy pad your lady give me money ain't my bad\nYour problem, cause you wifed a bitch in the ho column\nAnd I'm happy the morning after, smashed her\nBeat it up hella quick like I was Master IP\nDip to my crib and I stash a grip\nBanging this beat I love it cause this a blapper bitch"}], "artist": "T-Pain"}