{"songs": [{"title": "Cross Roads", "album": "Just Cause Y’all Waited", "year": "2018-02-26", "image": "https://images.genius.com/56a88ac0f6a68cb01296b26fb7ed3134.1000x1000x1.jpg", "lyrics": "[Intro]\nOTF NuNu man, you know how we rockin' man, MG-03, 72nd\nSo you- we on the block this early?\nYeah it's 9th Street man, fool a lot of shit happened there\nAnd I'm in my feelings at a crossroads\nDon't want to go\nCrossroads\n\n[Pre-Chorus]\nMeet me at the crossroads, never be lonely, meet me at the crossroads\nMeet me at the crossroads, never be lonely, meet me at the crossroads\nAnd I'm gonna miss everybody\nAnd I'm gonna miss everybody lord\nAnd I'm gonna miss everybody\nAnd I'm gonna miss everybody\nAnd I'm gonna miss everybody lord\nAnd I'm gonna miss everybody\n\n[Chorus]\nDon't want to be lonely (meet me at the crossroads)\nDon't want to be lonely (meet me at the crossroads)\nDon't want to be lonely (meet me at the crossroads)\nDon't want to be lonely (meet me at the crossroads)\nAnd I'm gonna miss everybody\nCapo, L'A, everybody\nNuski, Fredo, everybody\nI done seen they dead bodies\nAnd these bodies steady droppin' but you barely hear about 'em\nAnd they can't take fear up out 'em, oh\n\n[Verse]\nAllah, we don't believe in Jesus\nRIP Kenneka Jenkins\nLook what they doin' to my people\nThink it's funny, why they tweakin'?\nThey gon' snake you, they not equal\nThat shit with Fredo got me tweakin'\nThey not cryin', they just tweetin'\nAin't no time to do no grievin'\nPercocet come out my pores\nYou don't feel that when they die 'til it happen to yours, yeah\nBut they got a choice\nIn the trenches, I done did it, I became a voice\nSee I ain't changed but I was goin' through changes\nPluto'd still be alive if he ain't hang with strangers\nNiggas love you when you dead, that shit the strangest\nSkylar and Bella my two angels\nFo'nem at your roof like a fucking reindeer\nSo deep inside this hellhole, it don't rain here\nWe love the same people, we ain't got the same tears\nThey don't understand me, don't think they can hear\nSpread the love (we can't 'cause niggas die 'bout it)\nSpread the love (this time they said I'll die 'bout it)\nSpread the love (my niggas, I'll fire shots 'bout 'em)\nSpread the love (too many niggas got bodied)\nI'm so deep in Chicago, whoever thought I'd see France?\nIf I ain't have beef I think they'd be treatin' me like Chance\nOld heads cannot mislead me, they know that I'm too advanced\nEven though that I'm lowkey, got killers on my demand, ayy\n\n[Outro]\nYou ever seen friends turn to snakes?\nYou ever seen snakes turn to friends?\nI'm seein' this shit happen every day\nThat's where we at, know what I'm sayin'\nWe rap about it 'cause we got, know what I'm sayin'\nI see people judgin' us, talkin' 'bout\nThey always talkin' 'bout guns, postin' guns\nThey doin' it for the money\nSee I came from shit, know what I'm sayin', so I do what I want\nThat's why 2Pac was so great, you feel me?\nHe spoke his mind\nNigga ain't gotta be no gangster\nEverybody with me ain't no gangsters\nYou know what I'm sayin', everybody with me ain't no killers\nEverybody with me don't get money\nYou know what I'm sayin', but we gon' make that shit work\nWe gon' put the money niggas with the money niggas\nWe gon' put the killers with the killers, know what I'm sayin'\nAnd let it get treacherous for niggas, you know?\nFor real, for real"}], "artist": "Lil Durk"}