{"artist": "Anderson .Paak", "songs": [{"title": "Bubblin", "album": "Madden NFL 19 Soundtrack", "year": "2018-05-17", "image": "https://images.genius.com/d8d13d82d6300ae267ef4e72be669210.1000x1000x1.jpg", "lyrics": "[Intro]\nLook at you go\nOkay, you bubblin'\nLook, go, go\nLook at you go\nOkay, you bubblin', look\n\n[Verse 1]\nYeah, one in the hand, one in the bag, bubblin'\nLook at the cash, look at the cash comin' in\nCome get your mans, this lil' nigga buggin' me\nJust leave the bag, quit all that jaw-jackery\nDon't even pass me that, I don't want none of it (yeah)\nThese niggas mad about it, had enough of it\nWoah, watch what you sayin', all that poppin' and shakin'\nGot me hot as a laser, my posse deep and irate\nAnd we act a fool for the paper, had a dream and I made it\nEl Camino on Dayton's, Vintage Guess over Bape\nPut the bread on me bitch, bitch you bet I'ma bank it\nPiggy flat in a blanket, I might just roll out today\nI might just roll out to Vegas, head back to my old ways\nCop a room full of Asian hoes and do blow all day\nLook at me baby, look at me baby\nDon't I look like a million? I'm 'bout to clean out the safe\nD-don't I look like somebody that just be bodyin' everything?\nAll that talkin' is great but I don't be talkin', I air it out\nAll the problems have gotten easy to bury\nI'd rather drown them in Hendrick's, I'd rather kiss on my Mary\nI been, broker way longer than I been rich so until it levels out\nI'ma take your mama to the Marriott and wear it out\nTook me so long to get it, gon' and spread it out\nLet 'em know all about me when I'm dead and gone (woah)\n\n[Chorus]\nOne in the hand, one in the bag, bubblin' (look at you go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash bubblin' (okay, you bubblin')\nLook at the cash (look) bubblin' (go)\nOne in the hand (look), one in the hand (go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash bubblin' (okay, you bubblin')\nLook at the cash (look) bubblin'\n\n[Verse 2]\nI'ma need all the fries you can give me\nAll the hot sauce, all the pie you can give me\nBetter be all or nothin', don't have me in the middle\nYou better be all you can, get higher than the limit, yeah\nSimplify for the Dumbos, plenty slides, I can shuffle\nHit the cadence with my young bitch, Isaac Hayes, Billy Ocean\nBought my old hoe with the cane stick, left my slippers at the function\nIt's hard to run in Gucci slides\nChick, I thought you said you didn't have a husband\nI'm a stud, no cuckold, Jackie Chan, no trouble\nCan't clean it with a bib, blood drippin' from the cutthroats\nNo Lord, not me, I can never be the one you wanna stunt for\nMoney, money, that machine gun sprayed the Ferragamo store\nR.I.P to times that I was broke, after life in 911 Porsche\nMatte black lookin' clean, dead prezies in an envelope\nCookin up canard, waitin' for the antidote\nRunnin' out of time, patience thinner than a pantyhose\n\n[Interlude: Sample]\n\"Get over here and empty your pockets.\"\n\"I don't do that.\"\n\"You're my prisoner—you do what I tell you to do—get over here.\"\n\"Haha, he's gonna get nasty about it!\"\n\"Fuckin' bitch!\"\n\"Frank! Cool it, huh?\"\n\"Stay the fuck outta this!\"\n\n[Chorus]\nOne in the hand, one in the bag, bubblin' (look at you go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash bubblin' (okay, you bubblin')\nLook at the cash (look) bubblin' (go)\nOne in the hand (look), one in the hand (go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash, bubblin' (okay, you bubblin')\nLook at the cash (look) bubblin'"}]}