{"songs": [{"image": "https://images.genius.com/1347c8a031c29a20889e17df64f84846.300x300x1.jpg", "title": "Five Minutes To Flush", "album": null, "year": null, "lyrics": "Five minutes to flush\n\nNature:\nThey say they just want to question me the interuption\n4 in the morning they knocked and caught me fuckin'\nThrow on something mad provocative play with the top lock\nBuy me some time so I can hide the shit kinda quick\nMove the guns clip the herb\nThey got me shook up plus my nut was disturbed\nHide the chocolate pickin' up shells form off the carpet\nBaracaiding the door for war like a hostage\nIt's my crib, got my name on the lease\nCan't explain niggas just get arrained and released\nBut who snitched set me up, I think it's you bitch\nSacrificing my life for you two kids?\nTruth is, I got a business to lose eyewitness news\nPaper tellin' bitches to move, police turned this into a zoo\nMad reporters, I laugh as I'm sippin' my brew\nThey think they caught us\n\nHook:\n4 in the morning Feds are out at the door\nWhat you gonna do?\nWhat you gonna do when they come through for you?\nOoh ee ooh ee ooh ee yeah yeah yeah yeah\n4 minutes left\n\nNature:\nAbout a minute went by they knocked harder\nMy bitch went hysterical in shock\nSlapped her to calm her\n4-4 cocked to armor\nIt's been a long day now I raid with jakes playin' in the hallway\nIt's senseless, enter my crib and can't prevent this\nBlockin' my enterence, trying to knock it off the hindges\nBattering rams coming inches, my hoe was buggin'\nThrow a fit thowin' puttin' coke in the oven\nLike I'm Larry Davis the phone rang some D.A. bitch\n\"Nature turn yourself in\" I didn't say shit\nKnowin' in my heart I'm a stay rich\nIt's abusing, confusing them until they lose patience\nTry to ease up, calm my nerves with the cheeba\nHoping the door doesn't fall before the keys flush\nThieves rush, plus the riot squad\nNo surrender no retreat shit's deep but times is hard\n\nHook\n\nNature:\nBy the time they had busted in I had touched the cash\nJust flushed the last hundred grams nigga subduct the math\nThey made me either that or let them take me\nStill in my night clothes fake like I'm asleep\nSpoke to my rat heard him ask where the coke at\nPredicate felon hope to never go back\nThey had survelance aware of all dealings\nKnew about bitches that liked to shoot and loot kept in ceilings\nSearching my spot behind curtains stay cursing\nChief of police finally meet him in person\nBut I just flushed the yayo what could he say do\nTrying to flip on me, once was on the payroll\nTrying to laylow he can't find what he need\nSo instead I'm cuffed taken down for some weed\nBut it's just for a short say, I call the Firm then emerge\nOn the streets to return the next court day\n\nHook"}], "artist": "Nature"}