{"artist": "AZ", "songs": [{"title": "Ho-Happy Jackie", "image": "https://images.genius.com/f645e1706de16d6351751e537cecad5a.800x800x1.jpg", "album": "Doe or Die", "lyrics": "[Intro: AZ, Jackie & Guy]\n\"What's up AZ?\"\n\"Maintainin' G\"\n\"I'm sayin' tough titties somebody gotta suck it, I'm casin' the joint what's up?\"\n\"I'm sayin' there mad dime bitches up in here though.\"\n\"Let me tell you though, it ain't time to subtract & add on.\"\n\"How you doin' AZ?\"\n\"Oooh you definitely thick, no question.\"\n\"Yeah, but it cost.\"\n\"Yo man give me change for a penny, I pay for that, I know who\nYou is Ho Happy Jackie.\"\n\n[Verse 1: AZ]\nWhoever thought that that sweet thing born model material\nThat hated hot cereal could grow to be a high silly ho\nReally though, it's a shame for this damn dame\n'Cause everything's brand name\nWhen will she get enough of these damn games?\nStruttin' with her unbuttoned blouse like it ain't nuttin'\nDraggin' her wagon, knowin' fellas be flaggin' and frontin'\nHopin' by keepin' her gear, wear and hair dope\nAnd some really Big Willie nigga'll dig her and get open\nAnd give her what only a tenderoni would deserve\nShe got some nerve thinkin' every nigga's a herb\nThat goes around trickin' on every chicken that he's stickin'\nMale or female, whoever gassed her need an ass kickin'\n'Cause if it's more than one fella tryin' to get with her\nTo hell wit the fly, she only slidin' with the highest bidder\nBut if you ask me, she's nothin' but a nasty\nMoney hungry, unclassy, Ho Happy Jackie\n\n[Interlude: Guy]\n\"Yo, son word to mother, let's keep it real, that bitch ain't\nNuthin' but poison man, every nigga that bitch fuck with\nSomethin' happen to, she see a pinky ring shine\nShe up in the nigga mug piece like he handlin\".\"\n\n[Verse 2: AZ]\nCheck it, this one Jamaican wasn't fakin' with the bacon\n'Cause ever since him, she was on if I'm not mistaken\nBut then again, this money gettin' Dominican\nCaught her when she was fallin' off, and made her win again\nNow nothin' can stop it, once she in a nigga pocket\nShe be seein' more profit than those livest weed spots get\nMakin' her income and then some\n'Cause even a wedding band on her hand\nWon't stop a man who wanna spend some\nDiamonds and furs is all she want, that damned Glamour girl\nLovin' it, out there clubbin' it, dancin' like one of Hammer girls\nHappy Jackie, the jigga ho\nHer job is to jack nigga's dough, I call Jackie the jack a nigga pro\nAnd it's true, count all the fellas she flew through\nShe even juiced Jack the Jew, Jackie I'm scared of you\nAnd I remember that '87 September\nWhen she was slimmer, she was a ho hoppin' beginner\nBut now from acne, nappy hair and gear that was tacky\nShe's on (she's on, she's on, she's on)\n\n[Interlude: Jackie & Girl]\n\"Yo I got that sucka ass nigga.\"\n\"Ooh yes you do (I'm sayin' though what's his name?)\nThat's AZ from the Eastside. Girl you better work dat ass.\"\n\"Is he trickin' boo?\"\n\"He trickin' (good), but he got a baby moms.\"\n\"Yo fuck that I gotta eat his doe thang\n'95 I'm gettin' it all\n\"Yeah go ahead girl.\"\n\n[Verse 3: AZ]\nSo all the sugar dick, dirty devil dog, slick daddies\nDon't get out foxed, and slicked, and switched into a trick daddy\nTrickin' ya whore, hustlin' end for some skins\n'Cause next you be trickin' on all you family members and friends\nShe got a way to make ya feel like ya gotta stay in\nIt's not a way she'll pay, it's bills that she gotta pay\nSo married or single, watch out for Jackie when you jingle\nShe might sting you, and ain't no tellin' what that sting'll bring you\nYou could fall off point and get careless\nLose all awareness, go hairless, why she wouldn't care if\nYou go bankrupt, her lifestyle's corrupt\nSo knowledge before you wisdom or understandin' is fucked\n'Cause if you ask me she's nothin' but a nasty\nMoney hungry, unclassy, Ho Happy Jackie\n\n[Outro: AZ & Jackie]\n\"Yo what up AZ? We out?\"\n\"I'm sayin' whatever baby. Dinner gonna lead to breakfast\nIf it's on you it's all good.\"\n\"Yo I got you all the way.\"\n\"Better stop talkin' 'bout it and be about it, word.\"\n\"Yo my man whip outside, we can leave right now.\"\"\n\"You buggin' the fuck out? What's wrong with you? Word up, what the fuck you talkin' about?\nBitch, you tryin' to get a nigga killed or somethin'?\"\n\"I'm sayin'.....\"\n\"Get the fuck outta here, word up.\"\n\"I'll suck ya dick.\"\n\"Yo, you stupid get the f.... You Ho Happy Jackie ass bitch\nYo get the f.... Ayo son, come and get her the fuck outta here\nAyo get the Mo son we walkin' out the fuckin' club with that shit right now, word up\nAyo kick that bitch to the back.\"", "year": "1995-10-10"}]}