{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "The Honey", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Jazze Pha]\nLadies and Gentlemen! (it's Pimpalation pimpin!)\nLadies and Gentlemen! (gentlemen, gentlemen, gentlemen, gentlemen, gentlemen!)\nYou are now tuned in to the best!\nThis here Jazze Fizzle... producshizzle!\nPimp C (ladies and gentlemen!)... Jody Breeze!\nOoowwwhhheee!\n\n[Hook]\n[Jazze] If y'all niggas want the honey\n[Jody] Yeah!\n[Jazze] But I just want the money\n[Jody] Young chump change!\n[Jazze] Just fifties and them hundreds!\n[Jody] Girl I know you want me I'ma...\n[Jazze] Scoop ya in my Impala, new Gucci and that Prada, gotcha koochie by the collar\n[Jody] Well I'mma strip off ya clothes and lay ya down on the flo'\nHe fucked the shit out that bitch, I fucked the fear out that ho {*2X*)\n\n[Jody Breeze]\nYeah.. hey, uh oh there he go, look who slid through the door\nIt's ya dog Jody Breeze, I'm the shit on the low\nY'all niggas make me sick, spendin chips on a ho\nOn the grind, tryna get it, I shit on a ho\nOff top, let 'em know, I'mma mack, I'mma pro\nMatter fact, lemme hit it from the back later on\nBaby, gon' bend it over, tune it up let me see\nI ain't from Houston ho, but I'm still a pimp, see?\nAll I drink is Hennessey, all I smoke is stickery\nHoes wanna get with me, but they ain't get shit for free\nI'mma playa, you can tell, ATL where I live\nI ain't with the kissin, hoes, Jazze Fizzle let 'em know\n\n[Hook]\n\n[Pimp C]\nY'all niggas wanna lay, I wanna play in a bitch mind\nIf she, playin her Daddy, I will knock out her spine\nI'm out here on the grind, 24/7 I'm gettin it\nI'mma let them tricks eat it up (up!), I ain't trippin bitch!\n(Bitch!) Bitch, bend over, let 'em see it girl (girl!)\nHoes in the club, like '96 showin niggas love (love!)\nI used to be off in the Chi-C in Atlanta ('lanta!)\nYoung girls poppin cock out in Alabama ('bama!)\nI seen it all from the pimps and the tricks (tricks!)\nThe real live boys, opening the pussy stores (pussy stores!)\nI got respect for the flat backers (backers!)\nBlack, yellow, or crackers, keep ya Daddy ridin cause I'mma Cadillacer\n\n[Hook]\n\n[Tela]\nOh, he Tela in the change, I put the \"G\" in the game\nPut the \"P\" in the pimp (pimp), brought back the blue to the flame (flame)\nBreak a bitch like a trig, write out some magical shit\nAnd while I feel more slim, that ain't my starter bitch!\nDrop the top on the Rolls and roll under the sun\nThrow my finger in the air like, \"Kiiiddd! Ho I'm the one!\"\nGot my gators and suits, multiple colors like fruit\nPimp aroma on my breath, Tropicana and Goose\nTo the roots of pianos, see my moves she can't handle\nH.B.O., nigga ho break up overtime Soprano\nDiamonds up against panels of wood, it's all good\nLean back, candy 'llac gettin head on my hood (hood)\n\n[Hook]\n\n[Jazze Pha]\nLadies and gentlemen! (gentlemen, gentlemen, gentlemen, gentlemen, gentlemen!)\nFizzle! Oh, yeah, you have now been entertained (Pimpalation pimpin!)\nAnd you are now apart of the Pimpalation! (Pimpalation!)\nYou undersmell? Uh! There's a whole lot of devices that make this thing roll\nKnow what I'm talkin 'bout!? (what you talkin 'bout Fizzle?)\nYeah, Jazze Fizzle, Sho' Nuff Records!\nPimp C, UGK Records! Wood Wheel Records you know what I'm talkin 'bout!?\nRap A Lot mafia's behind this one, yeah!!\nWassup J!? Large mackin and sasquatch pimpin! Y'all know what it is!\nWassup Bun B!? Wassup International Red!? Oh boy!", "year": "2006-07-11"}]}