{"songs": [{"year": null, "album": "Deadset Song Series", "image": "https://images.genius.com/361914af43fdae62b50bc16d27a3c279.1000x563x1.jpg", "title": "Deadset", "lyrics": "[Intro:]\nKerser\nGot a camera again\n[?]\nLook\n\n[Verse:]\nFuck's happening? Yeah, it's been a minute\nHad to green up in it, now I gotta speak and hit it\nI got the buzz lad, I'm set to get paid\nIf they ain't hating all I gotta say is get great\nYou just want the position I'm in\nBut that ain't gonna happen 'cause they listening in\nI got the underground rap scene breaking the stories\nYou should thank me, why the fuck you even hating me for it?\nDoesn't make sense, swag in your face yes\nWhat they set to do and I put stains on a shaved leg\nI'ma party man, we only live once\nA bottle straight sipping looking like I'm owning the club\nAnd they yelling out my name and the phone won't stop\nWhen I was Scott no one even rang me up, like what?\nI used to dress poor skinny cunt looking meth head\nNow I'm fresh, done it all myself; Deadset\nWho would've thought I'm the pick of the bunch\nI'm that warm good feeling like a dick in a cunt\nNow I've got a party coming and you're all invited\nGot the date set now and it's time to supply it\nYou getting mad I'ma plug my shit\nI was meant to piss you off, you can suck my dick\nSo we kicking off in Sydney, make a move to Newie\nGet my bud and rock the show come on you people knew me\nFrom there we hitting Adelaide, I'm gonna steal a massive plane\nAnd park the cunt on stage and hop out with a fucking acid plate\nI'm Mozart, I go hard, I smoke up\nPicking up a loan shark then I go to Hobart\nIt's well earned, then Melbourne; the fuck's up?\nSet so dopey can't believe I'm a drunk cunt\nI must jump up to Brissie with that sticky icky\nGet on stage and pick a biccie right into your bitch's titties\nThen head west like yes, yes I'm in Perth\nSydney Swager, let me show you how\nThe king works lets out the way on the track, let me rock shit\nThought I better add, get your tickets now from Oztix\nGot no shame come and whitness a star, but\nSomething that you'd kill to see, I rip 'em apart\nI woke up with no drugs you know but\nWithin ten minutes I was high and toked up\nKerser come on, say it again, call it\nWhat you want my I making it main\nI'm loving how I'm feeling, Ratesy asked me at the start\nWhat's my aim? Now we tripping 'cause we gonna hit the mark\nTo anyone who's doubted, how you feeling? It's all good\nI'ma write this out and come to your hood\nI'm in paradise, via sattelite\nI hope you see it right here I'm rapping tight"}], "artist": "Kerser"}