{"songs": [{"title": "10 Years Grindin", "lyrics": "[Intro]\nYo, listen\nMmm\n\n[Verse 1]\nRemember me?\nI was on police cars on Channel U 2003\nSo when I tell you it's 10 years\nIn fact its more like 13\nAnd when I was 13 and Wu-Tang Forever came out\nWrote out the lyrics in my english book\nBoth discs including the skits\nNot a coincidence I spit like this\nCraft I have mastered\nArmed with the arsenic pen for the men that wanna beg friend\nOr pretend it is them that stand what I stand for\nStep in the ring get banged by the champ\nAw sit down stan get handled\nTrue you're bars are dusty like a old mans back foot trekking the desert with no sandals\nWho is checking on those vandals\nBit-break mic's with the bars of a martian\nLeft my kids to be fatherless bastards\nSee I'm so far past them\nRun a lap 10 times, they're talking about starting\nDickheads ask \"wheres the proof?\"\n4 of the top 10 Fire In The Booth's\n6 albums all packed with truth\n12 UK tours now who's who?\nShit...\nDone all this while ignored by the mainstream\nEveryday life feels like a daydream\nSee you know that you're cold\nWhen mans grandma see you and they cross the road\nSay that they love what you're doing for the struggle and they're feeling the stories you told\nPouring your soul\nBoring a hole\nRight through the pain straight into the cold\nSee the more it unfolds\nMore that you're sure that he knows\nMore that you feel that a portion of gold\nIs not worth distorting your goals\nIf you're already sure of the truth that you hold\nSee I'll leave with that gem\nBeen droppin' them since back then\nIt's 2016 and It's Not a Rumour just turned 10\nMy friend\n\n[Chorus]\n10 years grinding\nWhat have I done with all of that timing\nMastered the art of this rhyming\nSpit hard and I passed the assignment\n10 years grinding\nWhat have I done with all of that timing\nMastered the art of this rhyming\nSpit hard yeah I passed the assignment\n\n[Bridge]\nWhat you know about graft?\nWhat you know about art?\nWhat you know about heart?\nWhat you know about touring the world from the start but your songs never close to the chart\n\n[Verse 2]\nA decade's a long time\nIf you find yourself following the wrong line\nBut you can change course with a strong mind\nWe around the world with the words but they're not mine\nI don't create them I just arraign them\nSpit them on tracks and the crowd go crazy\nFor the flows and the fables\nTekks and the turntables we're able to play ball\nMy stable? Farther of the house\n[?] from your mouth bring it out\nSee the sagas I spew, targeting few\nIt's drama for dudes, you are scarred if you knew\nSee the half of your crew, departing from you\nThe other half with the all of your crew\nA regard for the truth\nThat is the hardest thing we can pass to the youth\n'Cause this truthing shit takes work\nAnd there's no guarantee it'll work\nAnd some other little talent-less jerk\nMight come in the team and take your shirt, that's how it goes\nAll you can do is flow and hope that their ears work well\nHope they can tell\nYou're more like ghosts in a shell when you got man shook like a obeah spell\nHell? Well that's light work\nWhats an ABC to a tight verse?\nI'mma slay these beats and I might burst\nCouple more egos with the right verse\nYou little 3 amigos need a night nurse\nCome and see me on stage for the right purse\nYeah a prize fighter, 10 year grinder\nIts the right rhymer, push up your lighter\nWho can reciter\nStanza mans can't decipher\nI plan like Japan and ban man from cyphers, done\nMan get bun\nHere's to 10 more years to get spun, son\n\n[Chorus]\n10 years grinding\nWhat have I done with all of that timing\nMastered the art of this rhyming\nSpit hard and I passed the assignment\n10 years grinding\nWhat have I done with all of that timing\nMastered the art of this rhyming\nSpit hard yeah I passed the assignment\n[Bridge]\n\n[Verse 3]\nWhat you know about grinding?\nWhat you know about timing?\nCan you read all the signage\nHave you mastered the science of rhyming\nThe science that I am defining, you're trying\nThe miles this vehicle has run\nAnd its heavyweight more than a tonne\nAnd of course I do talk 'bout my tongue\nThese lungs that become these thunderous drums\nWhen I'm done my sons could never get breakfast\nAs a parent I am that reckless\nAnd I don't give a fuck 'bout your necklace or any of the other type reckless investments\nI'm tested, and proven\nMany times over, its older, its colder\nWith shoulders the size of mountainous boulders\nAll of your [?] don't count it as [?]\nWise from young so I'm 'llowing the olders\nUnless otherwise proven, I'm schooling the foolish\nAnd I'm built for the game lets do this\n\n[Chrous x2]\n\n[Bridge x2]", "year": "2016-09-23", "album": "10 Years of Akala", "image": "https://images.genius.com/bd174bbb42265536ee1741370f5dc593.600x600x1.jpg"}], "artist": "Akala"}