{"artist": "Cam’ron", "songs": [{"title": "Dipshits", "album": "Federal Reserve", "year": "2014-05-14", "image": "https://images.rapgenius.com/27ef825f6f2bbdb34bbff10647d136dd.413x413x1.jpg", "lyrics": "[Produced by A-Trak & Just Blaze]\n\n[Introduction: Juelz Santana and Cam'ron]\nNever thought they'd see this again\nHere we go!\nKilla Cam in the building\nDipset!\nYou know what it is\nMy man A-Trak\nI feel something epic, no homo\n\n[Verse One: Cam'ron]\nMan, I'm that nigga, y'all, I ain't even lying\nI'm running fashion, man, I ain't even trying\nI see these fuckboys hating on me\nBeen in the crib three years, they still waiting on me\nBut I'm done with the frontin', I'm popping trunk and pressing the button\nNo stunting, I'm dumping and pumping the pump\nSomethin' to this chump, have him crying like onions\nWith a gun I am gifted, back up before I will happily lift it\nPopping a cap in the back of your cap\nLift up your hat, my astro's malicious\nMommy backed up and said she see the difference\n\"You're mature, handsome, mixed with a lot of ignance\"\nDick in her intestines 'bout to poke her chitlins\nCall me 2 Chainz's Drummond, say my strokes are different\nI'm different, you beating\nWhat you doing after this, bitch? I'm leaving\nAdios, vamonos\nI fuck your mama, word to mama, keep your mama close\n\n[Hook: Juelz Santana]\nUh, I know you miss this\nIt's still Dipset, you dipshits\nStay fly, don't get your bitch hit\nStay gripped, don't get your shit split\nUh, still push it and get it off\nNigga, we just cut from a different cloth\nUh, I know you miss this\nStill Dipset, you dipshits\n\n[Verse Two: Cam'ron]\nMan, fuck a magazine, don't care what you cowards read\nDon't gotta wonder, we like wonder with our bread\nMoney, respect, don't forget the power, dread\nHad this one girl squirting like a showerhead\nNine on the waist, eighty keys in the trunk\nStamp on the dope, eighty degrees of funk\nReebok money, eighty degrees in the pumps\nLookin' for me? Top floor suite of the Trump, baby\nCause of stupidity, send fire, humidity\nNo one here is sick of me, got the gift, no Christmas tree\nGet the shovels, y'all, everyone digging me\nI'm back to the future, still making history\n\n[Hook]\n\n[Outro: Dame Dash]\nI feel like rapping on this shit\nFirst off, my name is Dame Dash\nAnd I want to talk for a second if you don't mind, let me just say one thing:\nI am from Harlem, and I'm back outside\nAnd you know what that means?\nThat means people eat. Cause I'm a Harlem nigga, and that's what we do\nThat means when we walk in the room, nobody's safe\nYou 'bout to feel that, pause\nHarlem sticks together\nSo if you feeling like number one, get ready to be number two, cause we back\nWhat's that shit y'all be saying?\nFool's Gold!\nAight? 'Bout to party, I might pop bottles\nMight have to see Champagne Dame!"}]}