{"songs": [{"title": "How Could", "lyrics": "[Intro]\nUh huh!\nReal nigga shit\nAye light that weed up bruh\nGimme some rubber bands\nWhat's poppin lil mama?\n\n[Hook]\nHow could a bitch so bad pussy be so good? (So good)\nHow could a million dollar nigga be so hood? (It's dolph)\nAll that ass she got that's why she walk like that, yeah\nAll this cash I got that's why I talk like that!\nBalmain and margielas what I'm rocking, (Aye aye!)\n200 in my skinnies you know how I'm rocking (Racks!)\nShe signed for it and called and told me that she got em\nThat's my trap bitch she just want some red bottoms\n\n[Verse 1]\nBought a Rolls Royce just to smoke kush in it\nThis carbon 1-5 got a hunnid bullets in it\nShe bad and she paid\nThat's my kind of bitch\nThese niggas counterfeit, (they fake!)\nMy old school sick!\nMy bitch too thick... yo bitch look like a motherfucking toothpick\nI just poured up a four and poured some out for Pimp (RIP Pimp C)\nI took this South Memphis shit and I went worldwide!\nI smashed her for 30 minutes then told her open wide (Take that)\nIf you bout paper then let's get it cause so am I\nMulti-million dollar nigga smoking blunts on the block!\nRemember we ain't have shit but grandma, she did her best\nFrom the projects to private jets picking up check after check\nWanna know what a hunnid thou look like just look at my neck\nI'm drilling yo bitch from the back and still got on my Rolex\nIn the club passing bitches out bottles of Moët\n\n[Hook]\nHow could a bitch so bad pussy be so good? (So good)\nHow could a million dollar nigga be so hood? (It's dolph)\nAll that ass she got that's why she walk like that, yeah\nAll this cash I got that's why I talk like that!\nBalmain and margielas what I'm rocking, (Aye aye!)\n200 in my skinnies you know how I'm rocking (Racks!)\nShe signed for it and called and told me that she got em\nThat's my trap bitch she just want some red bottoms\n\n[Verse 2]\nSkinny nigga, big bank, my auntie walked up in my spot and she said \"Boy this shit stank!\"\nI got pills, I got drank\nCalled yo' bitch up and got laid\nCalled the plug up and got paid\nGot a 400 thousand dollar coupe parked outside in valet\nI got a hundred dollar taper fade\nI pour lean in my lemonade\nAin't no telling what a nigga might do (Uh huh!)\nGet too close to me then my lil' niggas might shoot (Paper route bitch)\nLil' nigga stay fly like I went to flight school\nI'm living the life, I'm living the life full\nAye, this is my life, this is my life ooh!\nTwenty-five hundred for a pair of tennis shoes\nMy bitch went shopping, bought me a chopper and some Jimmy Choo\n\n[Hook]\nHow could a bitch so bad pussy be so good? (So good)\nHow could a million dollar nigga be so hood? (It's dolph)\nAll that ass she got that's why she walk like that, yeah\nAll this cash I got that's why I talk like that!\nBalmain and margielas what I'm rocking, (Aye aye!)\n200 in my skinnies you know how I'm rocking (Racks!)\nShe signed for it and called and told me that she got em\nThat's my trap bitch she just want some red bottoms", "album": "King Of Memphis ", "year": "2016-02-18", "image": "https://images.genius.com/1589c69ebdac7664de45bd46c9a41d07.640x640x1.jpg"}], "artist": "Young Dolph"}