{"songs": [{"year": null, "title": "On My Way", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "Ha ha, S to the A man\nYeah!\n\n[Hook]\nI'm on my way to the top, no frontin\nY'all couldn't pay me to stop, no nothin\nStayed on my own and keep my pace, I'm runnin\nCause I'm on my way up, I'm on my way up\nIt is y'all comin with me - elevator ride to the top\nY'all can come with me - elevator ride to the top\nI don't think y'all hear me - we gon' take a ride to the top\nIt is y'all comin with me - we gon' take a ride to the top\nI'm on my way up\n\n[Verse 1-Saigon]\nAnd I ain't NEVER comin down clown\nBang you from every angle like surround sound\nBow down, pay homage to my hustle man\nStop gettin mad cause I be showin off my muscles man\nI work hard for 'em, so damn right I'ma show 'em\nYou think I do that shit for fun? I don't think so son\nI'm in the gym like young Muhammad and them\nHe said to make it to the top that I gotta get it in\nAnd in the studio you should already know what I'm cookin up\nEvery other year I got this rap shit shooken up\nWhoever hot at the time know if he got outta line\nThen I'm droppin a rhyme to put a stop to his shine\nI'm, much more than punchlines and metaphors\nThe skill level is light years ahead of yours\nSo feel free to critique my mystique\nThe wise rule the world, the strong only rule the weak\n\n[Hook]\n\n[Verse 2-Saigon]\nAnd like I said, I ain't comin down\nI did everything one can do in the underground\nMixtapes, tours, made a couple hundred thou'\nBut people want that \"Greatest Story\" and they want it now\nThe powers that be don't wanna let my message out\nMy words are equal to somethin for them to stress about\nI made a song \"Color Purple,\" they refused to push it\nThat was a song that could do stuff this other music couldn't\n\"Pain in My Life,\" the proof was in the pudding\nPlus I'm a rapper that could act as good as Cuba Gooding\nThe black-ballin was obvious, I walk, they say \"Look he leavin\"\nWhat kinda guy'll retire before his rookie season?\nI plan, plot, strategize different ways to make it\nCause when you real as I am you face major hatred\nFeel free to critique my mystique\nThe wise rule the world, the strong only rule the weak\n\n[Hook]\n\n[Verse 3-Saigon]\nThey target us like hate, target at Colin\nCorey got on the train and startin poppin shots into people noggins\nIt's not surprisin why my people still get knocked for robbin\n'Sposed to just watch you cop shit to drive in? We barely survivin\nYou crazy or just out of your noggin? Look dawg\nI'm really [?] shit, none of y'all spotted it\nThat's the problem with kids, you niggas got slum topics\nTalk about you from projects, you sold the bubblegum droplets\nAll you hear is Hummers, drop six; for every nigga with a drop six\nIt's two niggas with hoopties probably fuckin y'all chicks\nA hot spit, think you could stand a Glock\nRockets are brolic like rocks are solid, you sweet as a box of chocolates\nI'm takin off to the top like a rocket\nI gotta get to the profit and nada is gonna stop it\nSo feel free to critique my mystique\nThe wise rule the world, the strong only rule the weak\nSpeak\n\n[Hook]\n\n[Outro:]\nUhh, break it down now\nBreak it (no frontin) no frontin y'all\n(No nothin) Nothin gon' stop me man!\n(I'm runnin) I'm on my way up yo!\nCheck it (I'm on my way up)\nWho comin with me?\nHow many people comin with me?\nNow everybody come (with me) c'mon\nDJ Corb', Saigon the Yardfather\nBreak it down (way up)", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}