{"songs": [{"title": "Da Real HoodBabies", "album": "Crazy But It’s True", "year": "2019-02-26", "image": "https://images.genius.com/fe35fd7d024e488463eb6611fb5ceaa9.750x750x1.jpg", "lyrics": "[Intro]\nB-B-Bankroll Got It\nUh\nGotit\n\n[Chorus]\nH-O-O-D (Huh), B-A-B-I-E-S (Baby)\nI'm the real Hood Baby (The real one)\nBitch, it's tatted on my neck (Tatted)\nI laced it up (Uh) in my Nike shoes and ran up a check (Go get it)\nGot monkey bullets in this TEC (Brr), and it's takin' off your neck (Gah)\nShots in the middle, might hit a flip (Boom)\nTalkin' real crazy, he caught a dip\nNatural big booty bitch, you thought it wasn't real (Damn)\nPussy tasted like candy and I caught it at Phipps (Let's go)\nBoy, make a movie, don't gimme no lip (Movie)\nSuperstar status, got hoes in the VIP (Superstar status)\nKeep shit trill, boy, you ain't real\nEverything goin' up like a motherfuckin' hill (Talk to 'em)\n\n[Verse 1]\nHit it from the front, then I grab her by the neck (Uh)\nNutted on her face, yeah, Gotit left a mess (Uh)\nThen she let the shit drip down to her chest (Uh, uh)\nBitch, I want M's, I ain't talkin' 'bout necks (Let's go)\nDo one, kingpin, it's on to the next (To what)\nThey askin' who steppin' shit, come get stretched (Me)\nToo high, havin' Percocet, gon' balance it (Uh)\nGot a bag, move out the hood to Buckhead (What)\nIt's a show, Rio hit my phone like- (They up)\n\"Bro, what the hell?\" Fat, geeked up, smokin' cookies\nGivin' hell, these niggas ain't nothin' but some rookies (Huh)\nThey say I ain't a killer, lil' nigga, just push me (Woah)\nAMG Benz geeked up, it's pushin' (Skrt)\nStickin' to the T, I ain't talkin' 'bout Pusha\nCut the cap talk, all the could've, would've, should've\nSmokin' Backwoods, we don't roll no Swishers (Ah, ah, ah)\n\n[Chorus]\nH-O-O-D (Huh), B-A-B-I-E-S (Baby)\nI'm the real Hood Baby (The real one)\nBitch, it's tatted on my neck (Tatted)\nI laced it up (Uh) in my Nike shoes and ran up a check (Go get it)\nGot monkey bullets in this TEC (Brr), and it's takin' off your neck (Gah)\nShots in the middle, might hit a flip (Boom)\nTalkin' real crazy, he caught a dip\nNatural big booty bitch, you thought it wasn't real (Damn)\nPussy tasted like candy and I caught it at Phipps (Let's go)\nBoy, make a movie, don't gimme no lip (Movie)\nSuperstar status, got hoes in the VIP (Superstar status)\nKeep shit trill, boy, you ain't real\nEverything goin' up like a motherfuckin' hill (Talk to 'em)\n\n[Verse 2]\nHe tried to run off, but the boy got caught (Brr)\nPushed up where he stay, yeah, his block got chopped (Skrt)\nRatatatat, make the boy walk it out (Ratatatat)\nHe talk to the boys, cut the tongue out his mouth (Shh)\nDeebo, but we ain't talkin' Friday (Deebo)\nHands down, yeah, racks up, I bet I knock him out\nChanel shoes, I'm a tight jean-wearin' ass nigga\nI fucked around and caught gout (Let's go)\nGo rock out shows now (Woah)\nHow many hoes now?\nHow many fake ass niggas say they roll, yeah?\nBut they told, yeah (Yeah)\nGucci ain't racist, I still rock their clothes, yeah (Talk to 'em)\nWrist on froze, yeah (Wrist)\nPedicure Gotit, I show my toes now (Pedicure, ayy)\nShow up and show out (Let's go)\nHow many more memes? Bitch, I ain't green (Yeah)\n\"Do you want a Perc?\" Hell yeah, that's me (Oh yeah)\nBitch, I'm the baby, Hood Baby, yeah, the king (Huh)\nRockstar Gotit, got cuts on my jeans (Huh)\nThey bitch so lit, she pop her a bean (Uh)\nHow many haters this shit gon' bring? (Yeah)\nShit, how many more niggas' act gon' change? (Talk to 'em)\nBitch, I'm poppin' everywhere, just check the page (Bitch)\n\n[Chorus]\nH-O-O-D (Huh), B-A-B-I-E-S (Baby)\nI'm the real Hood Baby (The real one)\nBitch, it's tatted on my neck (Tatted)\nI laced it up (Uh) in my Nike shoes and ran up a check (Go get it)\nGot monkey bullets in this TEC (Brr), and it's takin' off your neck (Gah)\nShots in the middle, might hit a flip (Boom)\nTalkin' real crazy, he caught a dip\nNatural big booty bitch, you thought it wasn't real (Damn)\nPussy tasted like candy and I caught it at Phipps (Let's go)\nBoy, make a movie, don't gimme no lip (Movie)\nSuperstar status, got hoes in the VIP (Superstar status)\nKeep shit trill, boy, you ain't real\nEverything goin' up like a motherfuckin' hill (Talk to 'em)"}], "artist": "Lil Gotit"}