{"artist": "Anotha Level", "songs": [{"title": "Phat-T", "image": "https://images.genius.com/48100ad58310882b16f5882d30b4164b.763x768x1.jpg", "album": "On Anotha Level", "lyrics": "Verse One:\n\nB Glad like the bag I'm not mad like the hatter\nOn Anotha Level and I didn't use a ladder\nListen up good call me short and it's on\nBust you in the dome cuz I got little man's syndrome\nAlways down to bone when Home Alone like the movie\nGettin mad groupies, Tina Tam and Suzie\nHonies wanna groove me, cuz my flow is groovy\nI never pay ends or get skins in a jacuzzi\n\"The track is mighty phat to me\nYa loves the way I freaks the beat\nWhenever it is I freaks the beat\nSnaps come rolling back to me!\" *sung to Tootsie Roll commercial*\n\nVerse Two:\n\nWhat, is, really going on?\nMy, lyrics, rain like a storm\nOh yes, it sets quite a trend\nI'm the one your girlie likes and you can't stand it\nFresh cut come hottest, not at all modest\nI'ma tell you right now, I gets no runs anonymous\nCut all the hoopla, end the propagandin\nWe rode the Soul Train, not left Bandstandin\nFans keep fannin, where's my girl Shannon?  Hot damn it\nNow you understand it, aiyyo catch the Stones\nBecause it's slammin\n\nVerse Three: Booty Brown\n\nI'm throwin up West coast in the niggas faces\nFrom the City of Angels, I know you know where the place it\nThey call me Rudy, the dark brown tutti\nThe dark brown booty with an afro and a mad flow I'm a rap pro\nPlay the right end, I'm into flippin hits\nLike flapjacks off of fat stacks as I max with Anotha Level\nSo dig it like like a shovel digs a ditch\nA West coast rhyme without using the word .....\n\nVerse Four: Bambino\n\nI'm coming, I'm coming, I'm coming like this\nBallin up my fists and I'm not even pissed\nI'm just hyped, the type, you gotsta believe in\nThe dog inside of me is hungry this is what I feed it\nMarks and oreos, until we fill it up\nThe youngest hound of the Level does that make me a punk\nYup, shucks, I still get butt\nAsk your local honey and she'll tell you what's up\nOhhh damn, you freak me so well\nI used to hear it all the time from my old girl Mel\nNow I'm living swell add her to my clientele\nCan I get some thirst cuz it's hot as hell\nI kick some hoarse shit now I gots ta hay bail\n\nVerse Five: Slim Kid Tre\n\nHey bail, check it out well\nI gets up on the microphone and then I have to sail\nLike a ship, I'm on another motherf--kin tip\nGot me?  Here I go, copy\nYeah, so watch your back, black\nPharcyde's here and we'll never come wack\nMaking all the papes and comin by the stacks\nI know Anotha Level got my motherf--kin back\nHere to represent West coast\nBurnin up the map like toast\n\nVerse Six:\n\nI feel the funk while Tre Rhymealinda's\nBefore it's all over, we all just spins the indo or the bud\nConcentration is a must, occupation is to bust\nSo I bust, and then I bust\nThis shit is Phat, I'm hoping that\nYou can comprehend, the flavors that we blend\nYou know where to find me, come for the ride\nOn Anotha Level II the Pharcude\n\nVerse Seven: Imani\n\nImani represents one of the funk fabulous\nChillin freewheelin funkstaz, out the funky depths\nOf the West coast underground, umm, yo, so how that sound?\nI be rippin, rappin, with Anotha Level, rippin\nRappin with the Freestyle Fellowshippin, and the Waskalz\nGiving niggas assholes, cuz niggas don't understand\nMy s--t be in demand so I'm holdin niggas to WalkMan's\nPapers, if you slept on me you know you catch the Vapors\nI got my nigga Fat Lip with me, yo\nHe ain't around so what am I gonna do G?\nWhat am I gonna do man???  DAMN!!!\nYo whassup man?  You wanna rap?\nCan you rap whassup?\nYou look a nigga that can't rap, but I think you might be able\nTo drop somethin on the mic yo\n\nVerse Eight: Farmer Brown (Fat Lip)\n\nWell I used to just rap when I was on the farm\nPeople tried to come around giving me some harm\nBut I tell em no that it got to cuz\nThe Farmer Man is about to flow\nCuz I'm the Farmer Man, I hold the mic in my hand\nLike a pitchfork, I say whassup to New York\nI'm way out like Mork from Ork\nEnough to make you grab a bottle of moonshine\nAnd pop the cork, yeeeee-hawwww!!!!\nBout to get raw with my man Farmer John\nAnd my good ol frog, so y'all rock\nThe cock-a-doodle-doo, ragga-free funk\nEven though this ain't somethin that you're used ta\nYeahhh, hyuh hyuh hyuh hyuh\nAnd ya don't stop, check it out check it out\nYa don't stop, check it out check it out\nYa don't stop, yo what's you got to say on this boy\n*fades*\n\nAnotha Level II the Pharcyde (10X)\nMatter of fact it was phat\nThat shit was phat\nSay what?  To the\nSay what say what?\nTo the, Phar-Cyde\nKeep it going, Fat Lip grip the mic", "year": null}]}