{"songs": [{"title": "Hang On", "album": "Church Clothes 2", "year": "2013-11-07", "image": "https://images.genius.com/dccansnhx7yt6kfhs6fgcadrb.540x540x1.png", "lyrics": "[Intro]\nI have a collect call from *beep*\nAn Inmate\nAt County detention facility\nIf you would like to accept this call\nPlease press 4\n\n[Verse 1: Lecrae]\nLook I don’t know what Cornel West know\nI’m tryin my best though\nAnd I don’t know what all you went to\nBut look at everything we been through\nMan, we got high together\nWent to the mall, got fly together\nPolice came through tryna ask us questions\nMe and you sat there and lied together\nTryna keep in touch, it got hard\nHad a couple kids, and found God\nProbably heard I went off to school\nBut never knew I was snortin that raw\nWell I’m past that but not perfect\nI know it feel like it ain’t worth it\nBut you love dog and that’s real talk\nDon’t nobody wanna put you in the dirt man\nI know it’s hard out here to get work\nGot 2 strikes and feel worthless\nBut you was made for more than that drink and smoking\nTryna ask the streets for your purpose\nYou got your family here hurtin'\nMy partnas callin' me, worried\nAnd me and yo daddy did the same thing\nBoth left us out here struggling\nHeard they locked you up so I came through\nForget what you did and what you ain’t do\nIt’s times like this we pray through\nGotta run to the God that made you\nGotta hang on, hold strong\nTrust in The Truth to bring you home\nI ain’t tryna sit here and preach to you\nI’m tryna be the one you can lean on\nHang on\n\n[Dialogue]\nLecrae: Whassup with it kinfolk?\nFriend: Tryin' to take it one day at a time\nLecrae: So, whassup with the case tho?\nFriend: They tryin' to hit me with that mandatory minimum, man\nGotta fight that charge\n\n[Verse 2: Lecrae]\nTalk with the homie through a glass wall\nLetters gettin' passed off\nTold me he was about to head to trial\nPray to God he don’t get cast off\nHead to the sky cuz I need some hope\nKinfolk just got caught with dope\nPartner just called said his baby sick\nAnd this might be the end of my rope\nMan it’s hard out here and I’m hurtin\nDon’t need no choir girl flirtin\nDon’t need no pastor tryna touch on kids\nTelling me what I can't wear to church and\nNo fake cryin, a preacher lyin\nSayin God don’t love me if I don’t tithe\nI need real Him in a real season\nI need real faith in a real Jesus\nI’m hanging on by a thread though\nCrazy thoughts in my head, bro\nTold my grandma to pray for me\nBefore I end up dead or a dead broke\nOnly few of my friends know\nWhat I got to pretend for\nFree fallin, tryna hang on it\nAnything I can get my hands on\nHang on\n\n[Dialogue 2]\nGrandma: Hello\nLecrae: Hey Grandma. It's me\nGrandma: Hey baby!\nLecrae: Hey, I need you to pray for me. I'm just going through some things right now\nGrandma: Well, what's going on?\nLecrae: Well, you know, just everything. Family, money, just life in general. It's crazy\nGrandma: Well, let me tell you what the good Lord say, He said don't be anxious about yo' life. What you gon' eat or what you gon' drink or about yo' body\nSee, life is more than food, and the body is more than for clothing\nBirds in the sky, they don't sow, they don't reap, but yo' heavenly Father feeds 'em. So, He say just seek first the kingdom of God and his righteousness, and all these things will be added to ya'. See, life ain't for you to control, or carry all the burdens. That's why ya' give ya' life to Him. Hang on"}], "artist": "Lecrae"}