{"artist": "Will Smith", "songs": [{"year": "2002-10-25", "lyrics": "(Verse 1)(Will Smith)\nUh, check, check\nYo, yo, yo\nAcross the room shared a little gaze with me\nCrazy mama how your scent played with me\nEyes never hiding your heart angelic looking\nFaking disinterest but I can tell you're looking\nFace to face her eye to eye stance with me\nDidn't even say nothing I felt you wanna dance with me\nYou push me back a little when I kissed your hand\nSaid you was attracted to me truly but you had a man\nI put my finger up (Shhh) don't say nothing\nHe ain't here is he? We can play or something\nHe at the crib oh, I see you live with him\nWhat you gone get married to him and have some kids with him\nUs could be just a weekend thing\nJust a weekday thing, just a thing ma\nLook we can have everything else\nBut for tonite let me have you for myself\nGirl holla at me\n\n(Chorus)(Tra-Knox)\nYou can have the rest of your life\nGive me tonite\nYou can have the rest of your life\nGive me tonite\nYou can have the rest of your life\nJust give me tonite\nYou can have the rest of your life\nJust give me tonite, give me tonite\n\n(Verse 2)(Will Smith)\nWhoop!Whoop!\nBig Will coming through like\nWhoop!Whoop!\nTra-Knox coming through with\nWhoop!Whoop!\nEast girls off the hook ain't they\nRight, right\n(Tra-Knox)\nBaby girl\nYou know exactly what I want\nNo I'm not tryna replace your man\nI just want one night to you all over\nBaby girl\nThis our secret rondevue\nLook in my eyes I'm telling you\nAll I'm tryna do is change your view\nFor a moment or two\nBaby girl\nI don't wanna break up your happy home\nBaby I don't wanna be alone\nSo let me jump in the zone\nCan't you feel the Jones\n\n(Chorus)\n\n(Verse 3)(Will Smith)\nThinking of living your life as a hundred yards long\nGive me a quarter-inch thats all I'm asking\nDo the math I'm the sun you the earth\nIts U-N-I-verse and its the worst\nCuz I thirst to tape connect her\nI know you got a life momma\nTrust me I don't wanna bring your life drama\nI can barely hear my think slide with me\nDip out the side door take a ride with me\nLet me hear about (Uh)\nWhat you think about (Uh)\nWhat you need to do (Uh)\nThe things you dream about (Whoo)\nYour Body with me but I know where your heart's at\n(Phone rings) Let it ring ma call him back\nWishing I could stop the clock to make it last with you\nAm I gon' be at home alone with a glass slipper\nIs it a sin to pretend with another fella\nMidnight the story ends like Cinderella\n\n(Chorus)X2", "image": "https://images.genius.com/76048d37e73e3e383749923c401de4f0.1000x1000x1.jpg", "album": "Born to Reign", "title": "Give Me Tonite"}]}