{"songs": [{"year": null, "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "Look Out", "album": "1 Less G n da Hood", "lyrics": "(look out)\n(bustin and runnin)\n(Look out)\n(raid, raid)\n\nI hear a siren you know what that means, the boys in blue is on the way. and people duckin in and out to find a safe place to hideout, but not me i'm standin in full view of the street steady waitin on the police, thankin them for catchin me their attempts to trap me are useless, and the army of dead i command are forma ruthless\n(and your S.W.A.T team with snipers on every roof top scopin)\nAnd the team leader barkin out orders to throw the smoke in\nYou knoe that you gonna bump it like aaliyah said im 1 in a million and sometimes you can't comprehend the shit i'm feelin\n(but thats ok, i'm reloadin)\nAnd fully prepared to bust ya skull open. got you stripped down like a bitch at the bar searchin fo tips. all be dis got the shakes cuz you can't afford a hit. i'm a G in every sense of the word so my game is soldier so i match the motha f**kin pigs like a jelly donut\n\nChorus\nLook out the police is comin, got me runnin through the crack house bustin and runnin\n(get in)\nLook out, cuz i dont wanna get sprayed ya better lay it down fo yo ass get destroyed\n\n(i gotta blunt in my right hand a gun in my left takin shots at the cops either jail or death im already dead you can't kill me and i ain't goin to the pen, bitches come run me)\n~~~~~~~~\n\nI jumped in the caddy on the way to the dope house, i see the red and blue hold-up time out who they f**kin wit, im a g wit a trunk full of dope and heavy artillery\n(pull your vehicle to the side of the road)\nOh yall think im playin well ya'll just don know better run the plate check who you f**kin wit or get found on the sidea the road in a ditch, east side bitch boy what the f**k you thought quit f**kin wit these killas we'll blow ya head off we some hustlas tryna get rich quick. get money wit the boss and comp for old shit. motha f**ka for real i'm just lettin you know, f**k wit a dead man its yo funeral. so when you pull up on a g wit a hatchet in the window take yo ass to the coffee shop bitch ass po po\n\nChorus x1\n\nWhy you still followin me i get w2 to pay my taxes you gonna make a motha f**ka have some relapses. th red, white, and blues have been known to set me off and you about to fall victim to the molatov (cocktail). the smell is foul and overwhelming of you burnin in ya cruiser and ya lights is meltin, why can't i be dead , have a bitch, and enjoy dealin without one a yall motha f**kas botherin me, callin me a sinner, but i'm not im the dead body from the block. and ain't nobody on there pushin rocks. i'm a grown up but not in the sense that you accustom, i graduate from the 22's to the 9's that im bustin. at you i empty the clip on the cops who testin and leave em lyin dead in the intersection. you want beef you got it homeboy its what im servin, take the safety off your gun cuz i know that your nervous\n\nChorus x1\n\n(look out)\n(look out)\n(i gotta blunt in my right hand a gun in my left takin shots at the cops either jail or death im already dead you can't kill me and i ain't goin to the pen, bitches come run me"}], "artist": "Blaze Ya Dead Homie"}