{"artist": "​​wifisfuneral", "songs": [{"year": "2016-03-05", "lyrics": "[Hook: Wifisfuneral]\nHalf a perc up in my system\nJust for some motivation\nI ride on dubs, box Chevys\nAnd get that foreign to race 'em\nOkay, I flex too much, it's quite obscene\nTwo bitches, siamese\nThey kick it, join my soccer team\nI'm off that bean like, \"Fuck you mean?\"\n\n[Bridge: Wifisfuneral]\nI'm on that bean, ay\nI'm off that bean, ay\nI'm on that bean, ay, ay\nI'm on that bean, ay, yeah, ay\n\n[Verse 1: Wifisfuneral]\nI just pulled up in that foreign\nTwo door coupe, ay, with that top back\nThey counting so much racks up in my hands\nSo they tryna catch me up, up in a mousetrap\nBeen flexing and finessing too damn hard, they be like\n\"Lil Ric Flair, you need to stop that\", but I copped that\nRed dropped up in my Faygos\nSo I had to mix the Tech, I must've sold him that\nYeah, I called my banker up and get some racks\nAnd then I blow it, damn\nLike we be lurking state-to-state\nJust to make some plays and bring the racks again\nBad bitch for my preference\nSaid her name Mercedes, so I ride the bitch\nTest drive the bitch off a whole perc and a lot of sticks\nBut I bet you can't do it like me\nFlex so hard with the racks and the cheese\nSix K on my waist, them's Saint Laurent jeans\n\n[Verse 2: Caskey, both]\nSix K on my waist, them's Saint Laurent jeans, God damn\nDo I need change for the cheese? No, mam\nJust pulled up in a drop top, vroom\nThen I took her back home, hit her to a slow jam, God damn\nPercs got me feeling motivated\nSeen the Rollie, man, you know we made it\nAll my shit is looking orchestrated\nAll my bitches always sort of faded\nGot a freak bitch who's giving top\nI been killing pussy, ain't a lie\nI remember back in the days\nBack when I barely, rarely heard to stop\nBack when I made my money off of pot and the bitches\nGot my hoes making odd calls\nI done really been with the shits\nI don't really know about y'all\nAll I know is that I got a bar\nI'm a wizard, boy, John Wall\nGot all my bitches on call\nGot the pussy wanting encores\nKilling it slowly\nShe just sucked my dick and she don't even know me\nI'm balling like Kobe's\nI poured a lil liquor out for the homies\n\n[Hook: Wifisfuneral]\nHalf a perc up in my system\nJust for some motivation\nI ride on dubs, box Chevys\nAnd get that foreign to race 'em\nOkay, I flex too much, it's quite obscene\nTwo bitches, siamese\nThey kick it, join my soccer team\nI'm off that bean like, \"Fuck you mean?\"\n\n[Outro: Wifisfuneral]\nYeah, okay, I'm off that bean like, \"Fuck you mean?\"\nAy, okay, I'm off that bean like, \"Fuck you mean?\"\nYeah, okay, I'm off that bean like, \"Fuck you mean?\"\nYeah, yeah, ay, I'm off that bean like, \"Fuck you mean?\"", "image": "https://images.genius.com/16095e39e5e9d0b82e01539490fa2ead.500x500x1.jpg", "album": "19 - EP", "title": "Half A Perc"}]}