{"songs": [{"image": "https://images.genius.com/8a6d212c44ae5c3db53de0e693e5dba7.1000x1000x1.jpg", "lyrics": "[Intro: U-God]\nMotherfucker, you don't know me, motherfucker\nI be gettin' down for a long time, bitch\nI be gettin' money since '88\nMy gun been going off, I been doing mad shit in the streets\nMy history is swell, motherfucker\nThat's why I can talk this shit, for real\nThis is real nigga shit, and motherfuckers know\nMy name ring bells in jail, bitch, what?\n\n[Hook: U-God]\nYou don't have a chance, you don't want to dance\nMy gun goes blam, you don't want to dance with a gangsta\nYou don't understand, niggas ain't playin'\nFirst time around, I come back swinging\nYou and your mans, you better just scram\nMy gun goes blam, you don't want to dance with a gangsta\nYou don't understand, niggas ain't playin'\nFuck around now, I come back sprayin'\n\n[U-God]\nYour gun cry tears of lead, one in the head\nHigh grain, rhino shell, dum-dums, tear you to shreds\nThe armor piercin' slug shit, scare off the feds\nKid, I'm that fearsome, my hammer's a sled\nPledge allegience to my conquest, prepare for the bomb fest\nRight and left connect like twin jumbo jets\nI can feel the blood bubblin', under your flesh\nI'm coming down here rollin' in my snowball effect\nPut sugar in your ears and sweet talk you to death\nMy voice alone, don't have to force you for sex\nPop an ecst', get jumped off, the madness all in me\nFlushed out my kidney's, with a half pint of Remy\nDust off the semi', with the speed of the centipede\nMove on my enemy, and clear the vicinity\nFeel my energy inside tearin' out\nClear it out, flame thrower's airin' out, baby\n\n[Hook]\n\n[U-God]\nCome get a glimpse, the magnificent pimp\nLeave your face prints stiff, and graved in cement\nInvent the daily manuscript, return of the dragon fist\nYou pissed? Then seek anger management\nCuz my cannon kick back, with a gangsta metal\nWent right through your rib rack, and kissed the devil\nFrom the slang, now your brain is a twisted pretzel\nIn the empty hallway, you can hear the echo\nDon't get petro', U-Godzilla stomped in the metro\nGet wild like techno, collect the dough\nFor wreck, the side ball and better check your ho\nDon't get mad, cowboy, just respect my glow\nJust another episode, powerful breath control\nExplodes in your ear, you can't hear me in death mode\nIn retrospect, you best Protect Ya Neck\nOr get slapped the fuck up, by my next cassette, hear me?\n\n[Hook]\n\n[U-God]\nThis - is - the - warrior's anthem\nPose, in the pictures with the golden guns, handsome\nPhantom of the opera, frantic in the mansion\nThe head banger boogie got 'em dancin' in the Hamptons\nYou panickin', one strike, get murdered up quick\nAnd the mic's my life, and I'm surgical with this\nSwift and wreckless, smoke blunts for breakfast\nMaster the game, this is chess, not checkers\nFeel me? Bone collector, just, vision my art\nIn the darkness, vulture's come and, pick you apart\nOne rusty steel spike pierce, straight through the heart\nI bleed for my Clan, don't let 'em, break us apart\nStrong as Noah's Ark, in the Biblical age\nStill, holdin' the Clan, in it's critical stage\nEngage in combat, beyond shadows of doubt\nWu-Tang claim supremacy, son, I'm airin' out\n\n[Hook]\n\n[Outro: U-God]\nYo, man, if you was real, nigga\nYou would say niggas names, man\nYou ain't real dude, man, stop playing, man\nYou scared of niggas, niggas is runnin' with yo fuckin' name\nYou ain't doing shit, bitch, worry about your own shit\nTalkin' about niggas can't talk this shit\nFuck, I've been doing this, nigga\nI don't know what the fuck you talking about\nTake over projects, and set up shop, quick fast", "title": "You Don’t Want to Dance", "year": null, "album": "Mr. Xcitement"}], "artist": "U-God"}