{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "No Lights", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Intro]\nHow y'all doin ladies and gentlemen?\nMy name is King Dirty Gordy\nAnd... I have a story for y'all\nYou know somebody that went through it\nI don't care where you from...\nEast, West, midwest, South, please listen\n\n[Hook]\nMomma why we ain't got no lights?\nWhy you and auntie fight over a pipe?\nWhy all these roaches at night?\nWhy my uncle always come and steal every thing in sight?\nWhy different guys pick up my sister every day of her life?\nWhy my brother and his homies always blazing that indo?\nWhy they sellin crack and blowin up your basement window?\nMomma why you send me to school ugly and never clean?\nI'm gettin teased cause my clothes smell like kerosene\n\n[Verse 1]\nI see my breath in my own house\nI notice the eviction notice on the door so I guess we finna get thrown out\nMomma please pay the rent when your next check come\nShe can barely spit out a word cause her mouth is so numb\nAnd big brother I can't believe you\nYou ridin in cars with these two\nAnd you know we need food\nYou sellin 'cane outta here\nDrunk felons hang out in here\nYou ain't hearing things loud and clear, is you?\nYou know momma can't take care of us\nFace it nigga, you our parents, bro\nCause all our sister wanna do is do her hair and fuck\nShe's the neighborhood rat, all the homies hit it\nAll the hood niggas hit it, started yellin at the trick\nMe and her don't even hit it\nHer conversation strictly money and niggas\nSo she just be senseless\nNever though a nigga life would ever be this bold\nI shouldn't even be seeing this shit, B, just ten years old\n\n[Hook]\nMomma why we ain't got no lights?\nWhy you and auntie fight over a pipe?\nWhy all these roaches at night?\nWhy my uncle always come and steal every thing in sight?\nWhy different guys pick up my sister every day of her life?\nWhy my brother and his homies always blazing that indo?\nWhy they sellin crack and blowin up your basement window?\nMomma why you send me to school dirty and never clean?\nI'm gettin teased cause my clothes smell like kerosene\n\n[Verse 2]\nMy brother's locked up now a nigga really out here\nGoing to school mad as hell cause I ain't got no gear\nMan, I'm fed up\nDon't even know the last time I had a haircut\nG, is you feelin me? But I'm gettin suspended\nCause I'm always gettin defensive\nFeelin offended, swinging on classmates in an instant\nOften walking home crying cause my pride is dead\nSo much pain in society gone take time to heal it\nOn my way home from school prayin to lord almighty\nThat when I get there no one's gon be fittin to be fightin\nWe'll just leave that shit alone and maybe we'll be alright\nBut I'll never be ok, cause seen too much drugs and violence\nI see my auntie and here husband move they stuff in\nMy mommy, what happened to her friend's checks that she does her drugs wit\nAnd when her cash is all gone and her credit is out\nMy uncle leave and take all his stuff out the house\n\n[Hook]\nMomma why we ain't got no lights?\nWhy you and auntie fight over a pipe?\nWhy all these roaches at night?\nWhy my uncle always come and steal every thing in sight?\nWhy different guys pick up my sister every day of her life?\nWhy my brother and his homies always blazing that indo?\nWhy they sellin crack and blowin up your basement window?\nMomma why you send me to school dirty and never clean?\nI'm gettin teased cause my clothes smell like kerosene\n\n[Verse 3]\nMy sisters pregnant with her third baby in three years\nI'm 13, my mom's still a dope fiend\nMy brother's outta the pen saying he'll stay clean\nNo weed or dope sellin, gettin a job wit no felon\nTwo days later when I see him this shit was so funny\nWatch him half kill a friend cause the bitch owe him money\nMy momma and auntie takin blows in the kitchen\nBeefin over a piece of a nickel that came up missin\nMy uncle all in my brother room, grabbin all his stuff\nUncle when you come home, you know he fuckin you up\nBut what really fucked up, my sister got me babysitting\nI acting like I don't know the bitch like she's just some trick\nMy brother got caught in the crackhouse, they gave him five\nKeep lockin him up lord, just don't take his life\nIn the end you thought I'd be some thing but I'm not\nI'm 18 years old, sellin my momma rocks"}]}