{"artist": "Boldy James", "songs": [{"album": null, "title": "How Much", "year": null, "lyrics": "[Intro: Boldy James]\nBoldy blocks (How are you?)\n227 (Only us)\nConcreatures (Game time)\nHell block (Mafia)\nDetroit (What else?)\nLet's Get it\n\nThere's some hoes in this house (Go!) X3\nThat's my five dolla ho\nThere's some hoes in this house (Go!) X3\nHow much I gotta blow?\n\n[Verse 1: Boldy James]\nI'm working out that bag that you wish you had your hand in\nLying in your raps about some shit me and my man lived\nBack when I was coming up, hits me and my fam did\nNigga you was never one of us, you was hand fed\nPaying 40 for the lean and niggas on they last leg\nI keep that .40 with the beamer, don't have 40, ask Viz\nHow I'm cut? My niggas drilling\nDon't believe me? Ask Dez\nShot him up and didn't kill 'em, but I left him half dead\nWoke up out that coma, popping SOMAs, on his death bed\nGot up on his good foot and hopped up on his bad leg\nCause bullets fly and numbers don't lie, this a math quiz\nIf you get that bag in, can I get an ad-lib?\nYeeeeaaaaah\nMe and Yankee cracking crab legs\nUp in locals now we up in Strokers\nAnd that ass so fat I need a lap dance\nHamiltons and Jacksons\nCame with two, I gave her 20, she gave me back 10\n\n[Hook: Boldy James]\nMa, I just gotta know\nHow much I gotta blow\nHow much i gotta throw at a five dolla ho (Let's Get it)\nMa, I just gotta know (Whoa!)\nHow much I gotta blow (Ok)\nHow much i gotta throw at a five dolla ho\n\nThere's some hoes in this house (Go!) X3\nThat's my five dolla ho\nThere's some hoes in this house (Go!) X3\nHow much I gotta blow?\n\n[Verse 2: Problem]\nI ain't scared of a nigga, I ain't regular quick\nGot workout, squad a helluva fit\nBoy bird fly on some pelican shit\nLittle bitty nigga with an elephant dick\nAnd these niggas' hoes be loving it\nPull up, shut it down like the government\nBanging my gang out in public\nAnd punch a mark nigga for the fuck of it\nI'm on that, out the hood and ain't going back\nDon't sweat the past cause that's going back\nSay \"yes\" to cash and y'all knowing that. What?!\nNo root when I flow it, count the poet, y'all know it, I done did the due\nOn the track, on my toes like a running shoe\nStay grounded like when your mamma punished you\nI'm 100 proof\nNo matter how you feel about it\nPaper never chill about it\nIf it doesn't count or mean another comma in bank\nMoney, we can't live without it, but I gotta keep it solid\nJust because I'm getting it, don't mean a ???? ain't a thing\nBut the way I move, I got it, five kids and counting\nYou feel me?!\nBut Imma live this way 'til God or a young bitch nigga come kill me\nWhat?!\n\n[Hook: Boldy James]\n\n[Verse 3: Jarren Benton]\nGotta get some hoes in this house\n\"All Gold Everything\"\nWhen you give me head bitch, keep them golds in your mouth\nWeird ass nigga from the eastside\nWhen we pull up on you fuck niggas, bitch you know what we 'bout\nRappers sound dead in a brand new Bugatti\nMurder everything ????\nThrowing up the A, nigga magna cum laude\nGotta a trust fund for the kids, muthafuck Versace\nYeah, shit I'm done with these fools\nWho the fuck said getting money ain't cool?\nI been broke bitch, I couldn't feed my kids\nI ain't going back nigga, shit I'm done with that blues\nFeel God when I beast on a tune\nThese niggas more pussy than Reese Witherspoon\nIf she bust it open she can get the keys to my room\nIf you say my name wrong that can lead to your doom\nYeah, nigga word to Big Pun\nI told a bitch I'm in the game like Tron\nI ain't got the crown yet, but you can call me the king\nI be damned, swear to God, man, I feel like one\nI learned to adjust to complications\nI'm 'bout to progress my situation\nFuck niggas must be the new Cool Kids\nThat's all I see, these niggas still hating\n\n[Hook: Boldy James]", "image": "https://i.genius.com/6c415f4dab8083310481b9fd82d82fd218bb6f4a?url=http%3A%2F%2Fboldyjames.com%2Fwp-content%2Fuploads%2F2013%2F08%2Fmaxresdefault.jpg"}]}