{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/7f0fa2bcd1074e38f760c80850e084bd.398x266x1.png", "title": "Break the Simulation (Philosophy Book)", "lyrics": "April 15th, 2018\n\nSome people have to work within the existing consciousness while some people can shift the consciousness. often people working with the existing consciousness are jealous of those who are more in touch and they become hard-core capitalist in hopes of creating the illusion that the value of money is worth more than the value of time and friends.\n\nApril 17th, 2018\n\nAs a creative your ideas are your strongest form of currency. You have to protect your ability to create at all cost. try to avoid any contractual situation where you are held back from your ideas.\n\ndistraction is the enemy of vision. Sometimes you have to get rid of everything.\n\neverything you do in life stems from either fear or love. Fear often causes people to be manipulative. be transparent as possible. Stop setting plays. Stop playing chess with life. Make decisions based on love not fear.\n\ntrend is always late\n\nApril 18th, 2018\n\nwhen you first wake up don't hop right on the phone or the internet or even speak to anyone for even up to an hour if possible. Just be still and enjoy your own imagination. It's better than any movie.\n\nYou have the best ideas. Other people's opinions are usually more  distractive than informative. Follow your own vision. base your actions on love. Do things you love and if you don't absolutely love something stop doing it as soon as you can. Don't follow crowds. Follow the innate feelings inside of you. Do what you feel not what you think. Thoughts have been placed in our heads to make everyone assimilate. Follow what you feel.\n\nI don't believe in the concept of an enemy. We have been conditioned to always be in competition. Stop looking for something to beat and just be. You don't have to do all the work. Once you start moving in love the universe will assist you. You will be a drop of water with the ocean as your army. If you move out of fear than your on your own. Then it's just you and the money and the countless people you have to lie to and manipulate to build a man made path that will never lead to true happiness. just stop lying about shit. Just stop lying.\n\nin life, we are all trained actors. When we're born we're ourselves and then one of the first things we're thought is how to act.  If you see a kid screaming at a restaurant because he feels something and can't express himself in a conventional manner. everyone will say he needs to learn how to act. At home parental acting classes are one of the first steps to us loosing who we really are to \"the simulation\".  Parents are our first acting coaches.\n\nme and my friend Anthony Schiller always ask questions about time. Is time linear? I recently did an interview where I placed a high value on time. Everything means nothing until you make it something. You are your validator.\n\nBe here now. Be in the moment. The now is the greatest moment of our lives and it just keeps getting better. The bad parts the boring parts the parts with high anxiety. Embrace every moment for its greatness. This is life. This is the greatest movie we will ever see. There's love stories.  Pain happiness. It's 3 dementional. There's taste touch sound. It's the most entertaining for of entertainment. Just being. We believe time is a man made construct. Actually time and money are both man made currency. Because you can spend them both.\n\ntoo much emphasis is put on originality. Feel free to take ideas and update them at your will all great artist take and update. Cars have four wheels. Hoodies have hoods. It's amusing to me when some one says this is an original hoodie. Bro... it's a hoodie 🤷‍♂️ I find myself getting stuck in the idea of originality and letting my ego push me to say things like \"this person stole this from me\" and the funny thing is it'll be a reference I took from somewhere 😂 let's be less concerned with ownership of ideas. It is important that ideas see the light of day even if you don't get the credit for them. Let's be less concerned with credit awards and external validation.\n\ndon't trade your authenticity for approval\n\ntruth is my goal. Controversy is my gym. I'll do a hundred reps of controversy for a 6 pack of truth\n\nif you wanna see the true character of person watch the way they treat someone who can't do anything for them.\n\nApril 19th, 2018\n\ntoday will be the greatest day so far. Life keeps getting better and better.\n\nwe're all servants\n\nit's not where you take things from.  It's where you take them to\n\nthe beauty is in the imperfection(s)\n\nApril 20th, 2018\n\nwe need to Aman Giri the world\n\npeople are celebrating real ideas and vibe. Not just hype\n\nall you have to be is yourself\n\nI don’t believe in horizontal hierarchy. If you build a ladder too high it’s actually most dangerous for the people at the top.\n\nimages are limitless and words aren't. Words are defined\n\nsharing is community holding information is capitalism\n\niterations of ideas are how culture evolves.\n\neverything is so planned these days. People appreciate spontaneity and honesty.\n\nstrive for universal consciousness not segregated consciousness\n\nstyle is genderless\n\nYeezy is based in Calabasas but will also be setting up offices in New York London and Wyoming\n\nthe world is our office\n\nApril 21st\n\nI love the way Candace Owens thinks. only free thinkers\n\nI don't subscribe the term and concept of God fearing.  That's a dated mentality that was used to control people. We are in the future. If God is love and love it's the opposite of fear then...🤔🤷‍♂️ to fear God makes no sense 🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️ live in love not in fear. be fearless. Express what you feel not what you've been programmed to think.\n\nget past the past\n\nThe more people contribute to real time global consciousness the faster we evolve\n\nApril 22nd\n\nquestion everything\n\nthe blinders are off\n\nDemonization has metastasized. The psychological zombie effect. People demonize people and then they demonize anybody who sees anything positive in someone whose been demonized\n\nwe have freedom of speech but not freedom of thought. The thought police want to suppress freedom of thought.\n\nConstantly bringing up the past keeps you stuck there\n\nWe live in a time where people don’t respect people for being themselves. People respect people for following the general  trend and consensus. There was a time when slavery was the trend and apparently that time is still upon us. But now it's a mentality.\n\nself victimization is a disease\n\nApril 23\n\nwe're evolving at warp speed\n\nnew ideas will no longer be condemned by the masses. We are on the frontier of massive change. Starting from breaking out of our mental prisons.\n\nlife is more exciting than the movies\n\neven Prince once had an access pass\n\neveryone should be their own biggest fan\n\nI’ve always had a desire to do things people wouldn’t even think to do\n\nIf your foresight is incredible   Stay stubborn to your vision\n\nyou can say anything as long as you put the right emoji next to it.\n\nApril 24\n\ndragon 🐉 energy\nNatural born leaders\nVery instinctive\nGreat foresight\n\nto be great is to be misunderstood\n\nnever a master. Always a student.\n\n2024\n\nspread love\n\nApril 25\n\nFree thinkers don't fear retaliation for your thoughts.  The traditional thinkers are only using thoughts and words but they are in a mental prison. You are free. You've already won. Feel energized. Move in love not fear. Be afraid of nothing.\n\nYou don't have to agree with trump but the mob can't make me not love him. We are both dragon energy. He is my brother. I love everyone. I don't agree with everything anyone does. That's what makes us individuals. And we have the right to independent thought.\n\nIf your friend jumps off the bridge you don't have to do the same. Ye being Ye is a fight for you to be you. For people In my life the idea of Trump is pretty much a 50 50 split but I don't tell a Hillary supporter not to support Hillary\nI love Hillary too.\n\nI love when people have their own ideas. You don't have to be allowed anymore. Just be. Love who you want to love.  That's free thought. I'm not even political. I'm not a democrat or a republican\n\nAnd also I'm all the way out the sunken place. And I'm not scared anymore. I'm not scared of the media. I'm not scared of the past and I'm optimistic about the future. This tweet is in love not fear.\n\nwith love I am invincible. Truth is subjective but love is the most powerful force in the world and the world needs to express more of it.\n\nI said express love more because we have love but we don't express it.  My friend Tmills will always say \"I love you\" and it used to make me feel weird to hear that. Now I tell everyone I love them.  He sparked me to start expressing love more.\n\nWhen my daughter acts out she actually says afterwards I just want to hear you say I love you more.\n\nno race religion region or political party can argue with the power of love\n\nfear takes strategy   Unlearn linear thinking   Hit you with these zig zag thoughts\n\ndecentralize\n\nburn that excel spread sheet 🔥😂\n\nwhenever someone mentions the word \"fan\" to me it's super manipulative. It's like \"don't do or say this because of your fans\"  My fans are fans of themselves.\n\nAnd any fan of me wants Ye to be Ye even when they don't agree because I represent the fact that they can be themselves even when people don't agree with them. Drops mic 🎤Yeezy shrug 🤷‍♂️\n\nApril 26th, 2018\n\nThough hate is a similar emotion to love. Hate is not the answer.  Love is. just think of someone you hate and try saying even to yourself that you love that person.\n\nThe world is our family\n\nPeople usually don't agree with people who don't agree with them\n\nif you feel something don't let peer pressure manipulate you\n\nthe concept of loving people has a stigma. try telling people you love them it actually feels weird at first. We're really good at hating each other. We have to get good at loving each other.\n\nYour conscience should allow a physical manifestation of your subconscious but right now most peoples conscious is too affected by other people’s thoughts and it creates a disconnect from you doing what you actually feel now. Instead of doing what you feel you just do what other people think you should do.\n\nit's really cool to say I hate you. But it's not cool to say I love you. Love has a stigma\n\nwe are more worried about what we can lose than what we feel\n\nspread love. Put more love into the universe.\n\nArtist transform tragedy into beauty\n\nApril 27th, 2018\n\nApril 28th, 2018\n\nApril 29th, 2018\n\nApril 30th, 2018\n\nMay 1, 2018\n\nMay 2, 2018\n\nMay 3, 2018\n\nMay 4, 2018\n\n[this book is still in progress...]"}], "artist": "Kanye West"}