{"songs": [{"title": "Soldier", "album": "Return of the Darkman", "year": null, "image": "https://images.genius.com/ffc48cdf9440941e0fd4bf0d068c90af.400x400x1.jpg", "lyrics": "[La the Darkman]\nStand up guy, with family, shared a pie\nTo the cops and the judge, always tell a lie\nLook 'em dead in the eye, right hand high\nFor the D.A., get anything, 'fore I fry\nSentence me to die, cuz I live by the oath\nAny nigga snitch, stick a sword down his throat\nPills, crack or coke; we hustle it all\nSometimes it seems we ball just to fall\nOne nigga shouldn't get caught with a brick\nThen the next 30 days, feds indict his whole click\nThat's some homo shit, you worst than a bitch\nSit ya ass on the toilet, everytime you take a piss\nGet no realer than this, money orders get sent\nTo the pen, for my comrades and my friends\nPrisoners of war, chose not to crawl\nKept they mouth closed and live by they borgue\n\n[Chorus: sample (La the Darkman)]\nDo you remember me? (Uh-huh, uh-huh)\nI'm a soldier (Uh-huh, uh-huh)\n(I flip that dime, I commit that crime, nigga)\nDo you remember me? (Uh-huh, uh-huh)\nI'm a soldier (Uh-huh, uh-huh)\n(And if I get caught, I'mma do my time, nigga)\n\n[La the Darkman]\nI don't fold, nigga, I'm young, but think old\nNew York, baby, I was raised in the cold\nRound mobsters, dealers, pimps and real killas\nPower and manipulating people, we the realest\nEverywhere broads feel us, to Brook, to Tennessee\nI'm like a carpenter, I keep that hammer on me\nI push that E., by ten thousand pills\nNiggas don't, come straight, with the cash, get killed\nNo prints, no weapons, no witness, neither\nFour A.M., in your bushes, I'm a certified creeper\nYou a certified sleeper, I came to bring death\nNiggas talk beef, that's peace, I'm a chef\nPut your ass in a box, like Boyardee\nPrepare all black suits, for your family\nLike George W. Bush and Operation \"Push\"\nIt's La W. Dark, I came to take your heart, nigga\n\n[Chorus]\n\n[Willie the Kid]\nYo, yo, niggas shaking in they boots, I shoot dice and scoop paper\nYou brought a gauge for this shooting range, then shoot paper\nI bought a gauge for this shooting range, a few wakers\nMy shoe game, champagne and blue bakesters\nBack day, it's all about rope chains with anchors\nWe paid corners til the cops camcorders ganked us\nWhile we never on the phone, niggas Crank Yankers\nThen worse than a hater, is a fucking traitor\nEmbassy, never fold, never tell, fuck rap\nWe got blue shots and gas for sale, my nigga\nBang bang bang and boom boom boom\nYou're big dreaming like the Boom Boom Room, I'm real life, nigga\nI'm family first, guns and coupes\nWillie the Kid, I'm all that, the Sidekick with the blue\nCops gave me amnesia, I ain't no snitch\nAnd I love my niggas, I don't love no bitch"}], "artist": "La The Darkman"}