{"artist": "Paul Wall", "songs": [{"album": "The People’s Champ", "title": "State to State", "image": "https://images.genius.com/19b7a5ade7ab1480228518784ccd7fcb.500x500x1.jpg", "lyrics": "[Intro: Freeway]\nFree! Paul Wall!\nAnd we comin with the bum-bum-BUMMM\nEarly! G'yeah! Uhh\nIt's the Roc, Swishahouse and we bum-bum-BUMMM\nDumpin on y'all hatin ass niggas and we hit y'all with the bum-bum-BUMMM\nEarly! Uhh, g'yeah, uhh\n\n[Freeway]\nY'all better keep your weapons close it's Philly and Paul Wall\nAnd \"this is the way we ball\"\nBring the raw to yo' city got them semis if you really want war\nWe gon' bring it to your doorstep, vests and them hoodies\nAnd we pop pop pop... through your body\nPut the rest in your fitty and \"this is the way you fall\"\nTo the ground and you shakin nigga\nState Prop cock game, squeeze gunnin haters down\nAnd we take a hater's pounds and we sell a hater's bricks\nAnd, we the main reason why they chicks is not around\nSomebody tell them that the Roc in Houston\nSwishahouse got that knock in Houston\nWe come to lock shit down\n\n[Hook: repeat 2X]\nReal niggas stand up, point 'em out\nWe gon' gun them haters down, get from 'round you hear that bum-bum-BUMMM\nAnd all my real bitches step up\nCome to wipe a player down, smoke a pound with him, bum-bum-BUMMM\n\n[Paul Wall]\nI hear these haters talkin, seem like they gettin louder\nThese sweet cupcakes softer than some clam chowder\nI'm from the city that's proud to serve big crack rocks\nFor twenty dollars get you higher than an astronaut\nI keep a Glock in my State Prop jeans\nFloating on cloud nine, gone off codeine\nI chunk a deuce to a hater, I'm on a mission for paper\nI got Lil' Hawk with me servin dope fiends like a waiter\nI'm on the south B with my boy Do YOu\nBig bank take little bank baby tell me what it do\nThese boys talkin loud but they ain't saying a thang\nBut Paul Wall and Freeway'll make 'em sang\nWhen we hit 'em with that bum-bum-BUMMM\n\n[Hook]\n\n[Paul Wall]\nIt's the Swishahouse, State Prop chain gang\nForty-five cal', big Glock, bang bang\nI keep the tupperware tucked in my underwear\nRain down thunder on these suckers make the clutter clear\nLet's get one thang clear, I run with grizzly bears\nBite you in your back and make you straighten out your chest hair\nI'm one hundred baby no time for playin games\nI got a garden full of karats hangin in my chain\nI keep a player 'bout my paper, fuck a hater\nCause the real turn fake, switchin over like a crossfader\nI'm squashin chatter, climbin up the ladder\nCause my goal is to make my pockets fatter baby Paul Wall\n\n[Hook]\n\n[Outro: Paul Wall]\nPaul Wall, Philadelphia Freeway\nSwishahouse, State Property\nIn Philly they say \"early\"\nIn Houston, Texas we say \"already\"\nBut it's all good\n\n[Hook] - over Paul talking\n\n[Paul Wall]\nKnahmtalkinbout... already\nSanchez on the beat, throw down baby\nPaul Wall, Freeway", "year": "2005-09-13"}]}