{"songs": [{"year": null, "image": "https://images.genius.com/dcc907148124284a9abc48db9df5e500.500x500x1.jpg", "title": "State of the Union", "album": "Fat Boy Fresh, Vol. 1: For Members Only", "lyrics": "[Rapper Big Pooh]\n(If I quoted a perfect picture, would the people come see it?)\nWould the people come see it? Would the people come see it?\n(If I wrote a great novel, would anyone read it?)\nWould anyone read it? Would anyone read it?\n(The truth, I'll write it and continue to amaze)\nThey continue to amaze, they continue to amaze\n(If the North would've lost, would I still be a slave?)\nWould I still be a slave? Would I still be a slave?\n(The roses do grow out of project pave)\nOut of project pave, out of project pave\n(Little white kids, too, need to be saved)\nToo need to be saved, too need to be saved\n(Life is a play and the world is your stage)\nStage... play ya role, nigga\nTimes is gettin tough, we all countin coins\nRock boy slang envisionin Donald Goines\nYoung girls dream of bein the new B\nGrow up, be glam, and marry a Jay-Z\nLife it shouldn't be, but this how we livin\nGrown men crusin middle schools for the children\nBlowin up buildings, gas four bucks\nThe rich gettin richer and the rest gettin fucked\nWe preach education when our schools ain't shit\nCollege forty grand and that's IF they admit\nTyrone from the 'jects, single-parent home\nNever leave the crib, without that chrome\nSports and entertainment ain't ALL that we have\nBefore you assume, my nigga, do the math\nI keep gettin questioned 'bout people in my past\nTell me that the good die young, have last\n\n[Chorus: T3]\nIt's the, state of the union my nigga, we up soon\nThey call it terrorist when we don't play by the rules\nIt's racism when we try to speak our views\nIt's known as realism when they show it on the news\nIt's the, state of the union my nigga, we up soon\nIt's hard to get it in when you destined to lose\nWe gotta move for the young and impressionable\nThe Xs' and Os' - let's go!\n[Rapper Big Pooh]\nRap is gettin crazy, this ain't competition\nNiggas think beef is the way, ya start dissin\nNiggas think beef is the way, just fishin\nEven more reason to stay out the kitchen\nRapper been pitchin, words to the track\nEvery rapper now got they start in the trap\nThey start flippin packs. money before the deal\nJust last month, you sponsored 'em on a meal\nWhy keep it real when drugs can get you paid?\nAnd just like Hammer, that fad will, too, fade\nLie about your dealin, disrespectful to the trade\nIt's killin our people by the hundreds every day\nThe media attacks, you try and back away\nStand by what you said, get the fuck out the way\nReal niggas here do this shit everyday\nThey don't kids come around talkin play\n\n[Chorus]"}], "artist": "Rapper Big Pooh"}