{"artist": "Drake", "songs": [{"year": "2013-09-24", "album": "Nothing Was the Same", "image": "https://images.genius.com/84ad5364b68fe10c7405ba894802736d.1000x1000x1.jpg", "title": "Come Thru", "lyrics": "[Intro]\nYeah\nWe had the type of nights where mornin' comes too soon\nAnd nothin' was the same\n\n[Verse 1]\nWatch me, goin' out of the way, when I shoulda went home\nOnly time of the day I get to spend on my own\nI was trippin' off how I used to sleep at ya crib\nShould drive by right where you live and pick you up on the way\nWe ain't spoke in so long, prolly put me in the past\nI can still get you wet, and I can still make you laugh\nYou should call into work if that ain't too much to ask\nI could pour you up a drink and we can burn somethin'\n\n[Chorus]\nCome through, come through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\nKnow ya got that thang that I like\nKnow ya, know ya got that thang that I like\nCome through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\n\n[Verse 2]\nYeah, last night I brought DOA to the studio\nThey already had a stage and a booty pole\nIt's supposed to be a lot of hard workin' goin' on\nBut who the fuck can focus with this twerkin' goin' on?\nSomeone put a order in for a chicken (for a chicken)\nTold my girl to order in, I need the kitchen (need the kitchen)\nYeah, they know I got the hookup, they just wait on me to cook up\nBaby, I heat up the stove, you do the dishes, ya know?\nRap game, crack game, ain't that different, ya know?\nLast album had it boomin' somethin' vicious, ya know?\nAnd ya know I need ya back in my life\nGirl, ya know ya got that, know ya got that thing that I like\nGirl, you got that thing for real\nWhen I was on a mission to make it\nWho used to sleep on the floor with you when you lived in the basement?\nWho else got all the things you need at 4am when it's late?\nI always pour you up a drink and let you burn somethin'\n\n[Chorus]\nCome through, come through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\nKnow ya got that thang that I like\nKnow ya, know ya got that thang that I like\nCome through, come through, come through\nGirl you know we got thangs to do\nGirl you know we got thangs to do\nSo get your ass in that car and come through\n\n[Bridge]\nWhy has it been so long? Why has it been so long?\nWhy has it been? Why has it been?\n\n[Outro]\nWho you been crying to? Who you been flying to?\nWhose bed are you sleeping in? Someone's been hiding you\nWhere have you been? You deserve rounds tonight\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\nRounds tonight oh\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight\nCome through girl you deserve rounds tonight"}]}