{"songs": [{"album": "Gutter Rainbows", "image": "https://images.genius.com/195bc58c1487ceee38b62b9e3ae90bdb.300x300x1.jpg", "year": null, "title": "How You Love Me", "lyrics": "[Intro]\nI hear footsteps, in the dark\nFeel like I'm goin fuckin crazy\n\n[Hook: Blaq Toven]\nEvery day since we first met\nCan't even eat a bit\nI can't seem to think straight\nWhen I think about how you love me\nEveryday is like a holiday\nSomething like Christmas Eve\nMy worst day is carefree\nWhen I think about how you love me\n\n[Talib Kweli]\nWhen are we gonna grow up?\nWhy do I love you so much we so touched?\nExcited by the drama we like when it show up\nThe fightin don't slow up, I light you like close ups\nAnd I call you my Calamity Jane, you like my fantasy\nLove cause the same chemical reaction in the brain as insanity\nHolidays drinkin wit'cha family... passionate folks\nImagine if they had they own reality show - actually no\nDesire's like fire; quit playin or get burned\nOr give it away on camera like Montana Fishburne\nOur presence is a gift, a gift is our presence\nBreakup text call her a bitch under my breath\nAnd then the makeup sex she forgive me in a session\nI know she love me, she sendin a mixed message though\n\n[Hook]\n\n[Talib Kweli]\nYou need a chick with some fire\nI mean unless you want a wife cold as ice\nLivin life with the biggest debutante\nMe and you we considered the upper echelon\nThe only one I come out my fitted for in a restaurant\nYou can get it huh; remember I was takin your digits\nSame night I was makin the visit\nMake it the mission to make you cum\nWhen we done sometimes you hate to admit it\nYou a little numb from the toys\nAnd love the noise that you make when you run from the boys\nAnd comfort your man, insane how we go so crazy with it\nThis the asylum, so we call relationships committed\nYou ain't a bird I ain't them others guys that get lost in the name\nYou the butterfly, and I'm the moth to your flame\nLove is dying while the mother's cryin\nBig brother eyein me imposin their reality to Shutter Island\n\n[Hook]\n\n[Talib Kweli]\nOur love is like a saga or a trilogy, the drama is killin me\nI'm grown but the little boy is still in me\nWe discuss monogamy polygamy, the I's the probability\nYour momma ain't feelin me, it stung like a killer bee\nHow far from the tree do the apple fall?\nThe things I said - was it how I felt, was it the alcohol?\nOr do I really hate her after all?\nI apologize for the statements that I made to her\nFirst I swallowed my pride, then I ate my words\nI tried to pass it off acted like it was nothin\nThe fact is I was discoverin my appetite for destruction\nEverything else is bland once you tasted filet mignon\nWhen I'm full I'm takin you home, you a plate for later on\nI'll eat it up... or beat it up\nTil your love runneth over, yo I need a cup\n\n[Hook]"}], "artist": "Talib Kweli"}