{"songs": [{"title": "Speak To Em", "album": "Free Crack III", "year": "2015-11-17", "image": "https://images.genius.com/7e3e0fd0f795c92d1ea99308257f6793.800x800x1.jpg", "lyrics": "[Hook: Lil Bibby]\nLet me tell you how I feel\nThis the same life I dreamed about when we was kids\nAnd since I got a couple M's\nI ain’t gon’ preach to ‘em, but let me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\n\n[Verse 1: Lil Bibby]\nI say they know that I’m a loose screw, pockets on that Bruce Bruce\nNigga lose it all, bitch act like she never knew you\nSo I don’t catch feelings baby, I just keep it neutral\nLet her stay a couple nights, I hit the road, I’m through with you\nThese niggas amateurs, fuckin’ on these models and these actresses\nI keep it under wraps cause\nBitches runnin’ game and I know they ain’t slick\nShe gon’ meet a ball player and do the same shit\nI swear this shit is hard, gotta watch for these niggas and these broads\nAin’t no friends turn frauds\nStill waiting on the day a nigga try to pull a card\nLoyal to this thing of ours, my youngest down to risk it all\nBeen a young star, back to back in them cars\nIn the streets my life was hard so every day I thank God\nAll praise to Allah, blessed we made it this far\nStudied the attraction law, she want me to hit it raw\n\n[Hook: Lil Bibby]\nNow let me tell you how I feel\nThis the same life I dreamed about when we was kids\nAnd since I got a couple ills\nI ain’t gon’ preach to ‘em, but let me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\n\n[Verse 2: Lil Bibby]\nI remember trappin’ all winter\nKnow I kept it killer, January to December\nI was in the trap all day gettin’ faded\nBoomin’ like Metro til it got raided\nLearn the rules to the game ‘fore you play it\nThey gon’ ask you, better not say shit\nCause what you say gon’ be used in the court of law\nHe wasn’t built, got in that room and he told it all, damn\nThought that was your friend right?\nHe should help you do that ten right?\nHe was with you smilin’, riding in your Benz right?\nYou was on top, but that shit ain’t air right\nOut witnessing the judge’ll lose you\nHe ain’t even send you money for a pack of noodles\nThought he was real but he fuckin’ fooled you\nDifferent hood, same story, it’s the fuckin’ usual\n\n[Hook: Lil Bibby]\nNow let me tell you how I feel\nThis the same life I dreamed about when we was kids\nAnd since I got a couple M's\nI ain’t gon’ preach to ‘em, but let me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\n\n[Verse 3: Common]\nPyramids and stars on garages\nThe Gods is plugged in the streets catching charges\nHe used to serve from the crib and his daddy was the sergeant\nBlack Life Matters, before we was marching\nMy squadron stretched from 87th to the 9, real niggas on the grind\nWith the power to refine, Know good wine and crime\nExpensive watches and niggas doin’ time\nEverybody wanna shine, the young stars aligned with us\nWe used to fuck they babysitters, now these young niggas is hittas\nOn the streets they deliver\nI was that nigga that rolled up and smacked niggas\nNow I yell “Free Allah, bless the trap niggas!\"\nCop lights backlit us, the spotlight\nMade niggas wanna clap niggas, Black bigger lifestyle\nFrom Rothschilds to White Owls, livin’ for the right now\nMy niggas never lied down\nDon’t sleep on my city, we keep it a buck fifty\nThat’s why I fuck with Bibby, hear me?\n\n[Hook: Lil Bibby]\nNow let me tell you how I feel\nThis the same life I dreamed about when we was kids\nAnd since I got a couple M's\nI ain’t gon’ preach to ‘em, but let me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em\nLet me speak to ‘em"}], "artist": "Lil Bibby"}