{"songs": [{"year": null, "title": "Bring Me Down (Part 1)", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Verse 1-Saigon]\nYou ever get the feelin\nNo matter what they do, no matter what they say\nYou know you'll make it, someday\n\nYou know the feelin when your back is up against the wall\nPeople say they love you but you ain't convinced at all\nTell 'em they full of shit and they tell you you're insecure\nCallin you immature, does that make sense to y'all?\nYou ever feel like it's you against the whole world?\nLike everybody is schemin, even your own girl\nYour homeboy seem to be countin your money\nTell him you ain't got it and he lookin at you funny\nI'm feelin like I probably need to either leave the game alone\nOr either be the G to bang the chrome and get his name known\nHow does the Saigon story end; how?\nKnow what they sayin for now?\n\n[Hook: Joe Budden]\nThey'll say I'm a killaaaaa (uhh)\nI feel I'm as high as I can be\nAnd y'all ain't gon' fly as high as me\nI can't be no realaaaaa\nY'all ain't gon' bring me down, down (nah!)\nY'all ain't gon' bring me down, me down (never!)\nY'all ain't gon' bring me dowwwwwn (no!)\nI can't be no realaaaaa\nY'all ain't gon' bring me down, down\n\n[Verse 1-Saigon]\nI'm too high but it's not from a drug\nIt's not from a drink, it's not from a night at the club\nIt's not from a broad, it's not what I copped from the dealer\nI would tell ya, but if I tell ya then I gotta kill ya\nI been around a lil' while but I'm kinda scared\nIt's ill, like a vet that's still wet behind the ear\nSome niggas look hard, but I don't feel a threat behind the stares\nI'm lookin for vic's and they could be volunteers\nI dare somebody jump out the window to try to stop me\nI wait for niggas to shoot 'em like I was a paparazzi\nManly stack, system knockin the Maserati\nI jump out the back and turn your block into Nagasaki\nI shouldn't have to always make an issue with the pistol\nJust to prove the kid is official, tissue to the gristle\nHow does the Saigon story end; how?\nKnow what they sayin for now?\n\n[Hook]\n\n[Interlude: Joe Budden (Saigon)]\nKillaaaaa (I'm too high but it's not from a drug)\nI feel I'm as high as I can be (I'm high on life, love)\nAnd y'all ain't gon' fly as high as me (I'm from above)\nI can't be no realaaaaa\nY'all ain't gon' bring me dowwwn\nY'all ain't gon' bring me dowwwn (no)\nY'all ain't gon' bring me dowwwwwn (the invincible Saigon!)\nI can't be no realaaaaa (one, two, three, go!)\n\n[Hook - echoes at the end]", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}