{"artist": "Andre Nickatina", "songs": [{"title": "Conversation With a Devil", "album": "Conversation With a Devil - CR3", "year": "2003-04-22", "image": "https://images.genius.com/7af39c6c556f9aa9a3e8de7ac158203b.1000x1000x1.jpg", "lyrics": "Khan...\n\nMy name is Nicky, but you can call me Dre\nI party through L.A, now baby what you gotta say\n\n[Verse 1]\nMy name is Nicky, but you can call me Dre\nI party through L.A., now baby what you gotta say\nI live and lay like Sugar Ray, I listen to Sade\nYou never see me workin, and yeah freak I like to play, OK?\nYou're thicker than a can of peanut butter, OK?\nTalkin' to another brother, givin' me the eye\nMan I can't believe those thighs, shit\nI can see the freak in your eyes, shit\nAnd if I get you in my coils, I'mma strike for oil\nAnd let me tell you baby girl I'm spoiled\nMy favorite colour's blue, I'm like the number two\nMeanin' that I like to\nHave my cake 'n eat it too\nShe said, \"Do you want a drink Nicky baby?\" -\"Yeah\"\n\"You want me to get it for you baby?\"\n\nShit- My name is Nicky, but you can call me Dre, what up\nI'm only in town for one day, what up\nAretha Franklin tapes I like to play, what up\nI can see you like the Tanqueray\n\nShit- My name is Nicky, but you can call me Dre, fast\nI'm lookin' like MC Shan, flash\nBaby is at least a six footer, ass\nWe can get together in the middle of the night\nHop into my ride, take flight, that's right\nYou're rollin' with a pisces, buckle up tight\nSlick Rick talkin' like, \"da da da...\"\nStraight chicken hawkin' like, \"da da da...\"\nCaught up in my game like, \"da da da...\"\n\nMy name is Nicky, but you can call me Dre, I'm over\nBaby had hips like boulders, I'm over\nFeelin' kinda tipsy man but I ain't really trippin'\nTalkin' bout the next expedition\nShit- My name is Nicky, but you can call me Dre (what up)\n\n[Verse 2]\nMy name is Nicky, but you can call me Dre\nI hit the crap table with a four and a tre\nI party through L.A., this what I gotta say;\nYou're mines\nGirl what's your zodiac sign?\nYou're mines\nAll up in my eyes, you a dime\nYou're mines\nAnd I'mma keep on spittin' baby only if you're listenin'\nStandin' in the gangsta position\nShit- My name is Nicky, but you can call me Dre, what up\nWe can keep talkin' in the cuts, what up\nDamn girl ya got a big butt\n\nShit- My name is Nicky, but you can call me Dre, fo' real\nBaby wearin' jeans 'n high heels, fo' real\nThey bumpin' Big Daddy Kane like, \"da da da...\"\nAnd plus rhyme pays like, \"da da da...\"\nAnd I really ain't ashamed like, \"da da da...\"\n\nMy name is Nicky, but you can call me Dre\nThe plan is to talk to ya girl until you understand\nThe plan, we can talk about your pants cuz I really don't dance\nStandin' in my playboy stance\nI look you in the eye, you're rubbin' on my hands\nI know you got a man, ya actin' so bold\nThat's why the game might be feelin' so cold\nI say you got control, I put you in the hole\nI tell you in your ear, \"Do you wanna roll?\"\nI hear her say \"yes\"\nYou're rollin' with the fresh, today\nMy name is Nicky, but you can call me Dre, OK?\n(OK?)"}]}