{"songs": [{"album": "Thr33 Ringz", "image": "https://images.genius.com/1c9a02cd6c726adaf48e44273aa15ed7.500x500x1.jpg", "year": "2008-11-11", "title": "Digital", "lyrics": "[T-Pain]\nYayyy, yeah\nIt's goin digital... woo!\nYayyy, yeah, yeahh, yeahh\nIt's goin digital... yeah\n\nSee tonight it's goin digital, really though\nReally everybody in the club 'bout to feel me though\nI came alone, cause I'm takin somethin back with meeeee, yeahhhh\nI left the duals up on the Lamborghini (the Lamborgini)\nSo they can see me (see me everybody in the club) know I got fettucini\nI can't leave home, without a couple stacks on meeeee, yeahhhh\nNow I got the Gucci on the shoes (shoes) Louie knapsack (sack)\nIce around my neck (neck) how pimpin is that?\nOhh c'mon girl, you can stack your platinum back with meeeee, nooooo\n\n[Hook: T-Pain]\nTonight it's goin digital (ayy) digital (ayy)\nDigital (ayy) digital (ayy)\nIt's goin digital... {e'rybody know me when I walk up in the club}\nTonight it's goin digital (ayy) digital (ayy)\nDigital (ayy) digital (ayy)\nIt's goin digital... {e'rybody know me when I walk up in the club}\n\n[T-Pain]\nWhen the club do's open up (open up) I'm po'in up\nEverybody in the club know I got the frozen cup\nI can't leave home, without lookin like Magic Don Juan, yeahhhh\nNow everybody know what's goin on (goin on) my pimpin strong\nListen everybody in the club - is singin my song\nI can't leave alone, cause all these bitches know that I'm the one, yeahhhh\nNow I got the green on the shoes (shoes) gold Cadillac ('llac)\nIce around my neck (neck) how pimpin is that?\nOhh c'mon girl, let's get it crackin all night long, ohhhhh\n\n[Hook]\n\n[Tay Dizm]\nIt's goin digital, youse don't wanna hear me though\nShe lookin at me like she wanna be symmetrical\nFallin on yo' body, hit this and be quiet\nCause everybody in the club know I start the party\nJust washed my shoes, the gators too clean\nDon't mess around and make me have to +Do the Right Thing+\nAight, I'm digital, and you can come to MySpace\nOr just call me when you're\n\ndownTo get away\n\n[Hook]"}], "artist": "T-Pain"}