{"artist": "Professor Green", "songs": [{"album": "F64", "title": "SB.TV F64 [S1. EP57]", "image": "https://images.genius.com/66c589151ccebc6d628211be16409ef2.360x360x1.jpg", "lyrics": "[Verse]\nBeginning to think, I might need a wifey\nDating all of these women is getting pricey\nThe whole situation is getting dicey\nBut them bumping into each other excites\nCommon sense tells me to do the right think but\nMy ignorance tells me I'm doing it\nI'm Pritt Stick, glued to the game too innit\nTo be removed, wanna quit but I'm too legit\nToo slick to give up the way I'm living man\nGot cash as long as people wanna sniff a gram\nAin't changed, ain't lies, if I'm different man\nPeople say any different, I couldn't give a damn\nLet 'em hate, say I switched the flow\nCourse I've switched the flow, old shit is old\nOut with the old, in with the new shit\nFor my haters, that all wishing they could do this\nThink you're big? I don't think you're big enough bitch\nI'm struggling to pick a brush to smear your blood with\nI don't think I'm a t'ug ya little fuckwits\nIt's fun when they think I'm a punk, then get a bust lip\nNo miming, just rhyming, I'm hot Prof\nAnd this is my spot 'til I'm in a pine box\nAquire dosh, I'd be lying if I said my lines off\nBut it ain't nah, licking my shots\nKnee deep in slosh, whilst you're still beating off, silly\nBillie's, A Millie's, nearly just taught me to OZ\nHave I got crabs or am I just itching my crotch\nIn my business but you're interns in it, I'm the boss\nAfternoon, I'm just passing through\nOn stage after me? That's a par for you\nHow do you make something so easy look so hard to do?\nPass my zoot!\nNow I'm high up, as high as high gets\nGet cycle eight past the class but I ain't sat my test\nThey say I'm best when I jest, I beg to differ\nI say I'm sicker when I'm vexed\nThat's when I rap better at the end of my tether\nI'm silly clever, poppy, cocky, like I ain't ever been beat ever\nBut whoever, hear you talk shit better walk it\nOr else walking is gonna get a little awkward\nType to run a red just to see your Porsche flip\nRun your lips and I hope you're being in to tortured\nOlders and youngers, best to knows the cold is amongst us\nI ain't boasting, just being real\nSomebody give me a pill, I got a headache\nP's not a dunce, don't menstruate but I am a bleeding cunt\nThat don't hesitate, when it comes to beef I run\nStraight back in it, with a lyric on fire like when I'm in the clinic\nI am into digits, yeah I like P\nDairy intolerant but high off cheese\nI'm a punchline king, I dare anyone of these chumps to try a ting\nStep into my ring and let's swing for it\nLife I'll make you sing for it\nAin't nothing but puppets on my strings, ding\nI made my way in, with raps so fat\nI had to drop my boxers when I weighed in\nFrom saving, I was hot the first CD I dropped was amazing\nHating begins now the albums coming\nI came back they wondered how I done it and now what?\nDoubt not, I'm as sick as I sound\nProf, come to your house party just to piss in your mouth wash", "year": "2010-04-08"}]}