{"songs": [{"image": "https://images.genius.com/918b4db0bc6d6cd1a89e223b72d2d53b.1000x1000x1.jpg", "title": "Food for Thought", "album": "The Pre-Fix for Death", "year": "2004-09-21", "lyrics": "[Necro]\n(Check The Dragon)\nGet served like a restaurant, follow my orders\nYour style gets taken out, 'cause you're a bite swallowed with water\nI think I'll eat into your mind instead\nPoison you with M.S.G then crack you with cans of soda upside your head\nIt's free delivery of flavor at it's foulest\nYou could get beat down all day, I stay open for hours\nFly like chicken wings, what I prepare kid\nWill leave your stomach full of knife wounds, you'll need some spare ribs\nYou're fish, you're chicken, my recipe\nRequires me leaving your gizzards scissored, my specialty\nIs an appetizer, you're hungry? I'm starvin' ya\n'Cause you're souped up, my evil's won ton, get burnt like barbecue\nShrimp, anybody that stepped to me lost\n'Cause my steelo is cold like noodles with sesame sauce\nNow eat your words as you shoot your bladder\nCause you got no guts in you, them shits are on my poo poo platter\n\n[Chorus 2X]\nYo it's food for thought, these frightening rhymes\nHit every street corner like Chinese take-out, vitamins for the mind\nNutrients for the brain, lyrical fluid\nIs dirty like the Chinese food in your hood but you're still addicted to it\n\n[Necro]\nYou're lost in the sauce as it clots your vessels\nI'll undo the blouse of your spouse and give her my house special\nMy raps are hot and sour, they choke you\nYou make no moves like a vegetable, you're fake like tofu\nWhen I rap to my customers I'm nice\nBut if you're not you'll get porked with a fork 'cause my brain's fried like rice\nYou're vegetarian? you don't want beef?\nYou won't bite with no more teeth, you're a crumb like 4C\nYour whole fuckin' character's dead\nYou're plain like fried rice without the peas carrots and egg\nI'm white like rice without the soy sauce\nAnd if you hate me for that kid step up and end up a destroyed corpse\nYou're chopped like suey, the slang I drop is chewy\nMad hard, cats can't digest\nThe food is fat packed with lard, too much gives you a bad heart\nYou're so gassed your ass blasted out a gastric fart\n\n[Chorus x2]\n\n[Necro]\nI start cookin' with a low flame then increase\nTill you're deceased with your brain on the floor lookin' like lo mein\nTorment you constantly, serve you broccoli\nMixed with Clorox to see if you plot, my menu's an atrocity\nHere's a fortune cookie, my generosity\nIt reads: \"Very soon in the future you'll vomit green\"\nYour mom cries from her eyes when you're cut up like onions\nThen your body's reincarnated in the form of dumplings\nTake my advice, try a quart of\nBoiled rice, dandruff, oiled lice, here's your side order\nYou got lobster on your plate ready to be chewed\nBut you're going to starve 'cause you're blind you can't see food\nYou're sweet without the sour\nSo I force you to devour sauerkraut raw for about an hour\nChicken, I'll leave your breast cut\nSauté it with as-bes-tos, 'cause I'm water chest-nuts!\n\n[Chorus x2]"}], "artist": "Necro"}