{"songs": [{"image": "https://images.genius.com/cef1261760333ffabefc84e1057f1277.936x938x1.jpg", "title": "Gluteus Maximus", "album": "The Sexorcist Pt. 2", "year": "2017-11-30", "lyrics": "[Verse 1]\nYeah yeah\nThis the type of beat you rock\nRight before you bout to get some pussy\nDuty calls when a bitch needs a booty call\nMake my balls touch her gluteus maximus bag a Maxim mag bitch\nTest her gag reflex fake titties with defects plastic Barbie rejects\nThat ate 3 dicks at once (pig)\nFuck a bitch to death, the pre-fix I like a flexible chick spread eagle poke her wit a pool stick\nTurn the bitch into a coke mule choke on my family jewels with all that drool and spit put my tool in ya pit\nMy gat rubs your clit, suck ya tits, fuckin' bitch\nDrink that milk, pregnant slut, sip it quick, don't talk zip ya lip\nYou ain't got nothing to say that I'm interested in unless it's dirty shit\nI got more than 30 chicks on my dick at the same time\nI kick game rhyme fellas learn from it, honey you feel sick? That's sperm in your stomach\nNow get used to it, douche it, douche bag bitch unsanitary horrible hygiene , bye, Felicia. Hahaha!\n\n[Chorus]\nBitch you ain't down to suck dick?\nThen get the fuck out of my hotel real quick (Bye!)\nYou want a pic? You want your tit signed?\nI'm film you blowing my penis and squirt cum on ya spine\nBitch you ain't down to blow Beesh?\nThen I don't care if you end up homeless in the streets (Bum!)\nLike a stray dog, white slave abductee\nThe only thing I want to hear you say is that you down to fuck me\n\n[Verse 2]\nI'm like Maximus charging through your gluteus maximus like a maxi pad miss fuck you call a taxi quick\nBitches on Paxil showing their ass like crack kills make you take a shit like Ex-Lax pills\nNetflix and Chill, you got a man? He could make us eggs quick\nAfter I show you what the sexorcist does to your rectum with the speculum bitch\nYou need protection cause some of these sluts have infections\nNo affection just a death wish suggestion my erection gives a bitch a c section slicing through intestines\nMachete phallus salami digestion, 18 year old floozies make you drink a protein smoothie\nThink ya shit don't stink til it starts oozing out of your coochie and culo like slugs from an automatic Uzi\nCatch a biological disease in a jacuzzi\nHef's grotto it's a doozy, hot models with twat's throttled with bottles loosely, pussy's gaping like potholes.  Foul!\n\n[Chorus]\n\n[Outro]\nYeah, now that's a song\nTrue\nPenetrate it, kill it\nBeat the pussy up like it stole something from you hahahahaha! ha!\nThe sexorcist tappin' your intestines honey, bitch, innards"}], "artist": "Necro"}