{"songs": [{"lyrics": "[Intro]\nYeah, what the fuck!\nJay-Z, Marcy, Brooklyn\nRepresentin' the, what, what\nRoc-A-Fella y'all, for life\nStretch Armstrong\nBring the noise, haha\nClown-ass niggas (Yeah)\nYou know how we get down\n\n[Verse 1]\nUh, Roc-A-Fella's capo, unflappable\nTest my weight in the Apple\nNever a question of if, but when you gonna die like cattle\nBeef, I go at it so rugged, you swear, I love it\nIs that so, hard to learn?\nMy burner give niggas permanent heart murmurs\nIf that ain't reason for concern (woo!)\nMy, crew endangers\nEstranged miscellaneous niggas\nLeft in troubled waters like Greg Louganis\nAin't nothin' touchin' from Brooklyn to Metuchen\nOr wherever the fuck you cats rest your head at, dead that\nThe last time you seen us, niggas popped up in Beamers\nShopped up in Neiman's, locked hip-hop up between us\nSqueamish rappers stay out of my space like Venus\nOr it's Soulshocker, Jigga Niggademus\nMurderous writin', not a word of it to your likin'\nSince we make you hate to love it like Prince\n'Til a nigga feel straight like Bill Gates\nOr feel a mil'-eight, we gon' spill hate, in-fil-trate\nDie! It's your fate, realize the great\nGet your hardhats, professionals rockin', nigga, wait\nTiming's everything, everything that glitters ain't gold\nThere's diamonds in every ring, what the fuck!\nIn the driver's seat, nigga used to live in the back\nMuggsy Bogues style, now a nigga bigger than Shaq\nCrib in the Cat, skills, living phat\nChickens that used to act ill\nFuck y'all, I ain't forgivin' that (Fuck y'all!)\nA nigga bitter so, when a nigga hit you, believe (Ugh)\nI'm tryna hurt your stomach like ten thousand sit-ups (Yeah)\nJigs, baby, what it is! Just as casual\nYou blast for me, you better believe I blast for you\nYeah!\n\n[Interlude]\nYeah, uh-huh, yeah\nEvery time, y'all (Roc-A-Fella, y'all)\nWhat, what, Jay-Z, huh (What, yeah, yeah)\nYeah, yeah, Roc-A-Fella y'all (Marcy)\nWhat, we rock on y'all, representin' the\nYeah, yeah uh-huh\n(Let these niggas know)\nWest Coast niggas, man\nGetting out of line, man\nWatch your step, haha\nFuck around\nYeah, yeah, yeah\n\n[Verse 2]\nYo, react, biatch nigga\nThink they can fuck with the rich nigga\nJigga, they can't touch ya\nSay y'all, we livin' like STNRs (?)\nYou faggot niggas don't play yours, my team'll slay yours\nNaysayers, can't fuck around we lay yours\nWith our hands up there, shit, I swear to God\nSince money's respected you know I had to get it\nCollect it like antiques, and let it stack\nBrrrrrrr, like that\nI mastered this fast shit, now I move on\n'Cause too many bastards tried to get they groove on\nAnd now you see me jiggy, you puzzled\nHe ain't sellin' no records, is he? That nigga gotta hustle\nShit, you bet your guns, by any means, I get my ones\nYou intervene, by any means, I get ya done\nFor real", "title": "I Shot Ya Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}