{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind", "title": "That Girl", "image": "https://images.genius.com/f689ab0824fca0c915118da31cb95b4a.600x597x1.jpg", "lyrics": "[Intro: Pharrell & Snoop Dogg]\nWe do this in our sleep, nigga\nYeah\nEver been in love before?\nI wanna holla at you ma\nYou know it's hard for a player to admit that sometimes\nBut I'mma spit that sometimes, y'know what I'm sayin?\nAight P give it to me one time nephew\n\n[Chorus: Pharrell & Snoop Dogg]\nThere's something 'bout this girl man, from around my way\nShe from a around the way\nEver try to hold back your feelings, but it just wouldn't stay\nIt wouldn't stay, wouldn't stay\nBut when I finally found the words to say\nI wanted to run away (Run away, run away), simply run away, oh\nYou can try to run and hide, it won't make a difference\nYou can lie to yourself, let me reason\nSure it hurts when it comes to your attention\nThat you're in love with the girl\n\n[Verse 1: Pharrell]\nYes sir, that's her\nBut it wasn't like that back when I met her\nThe lavish life from all the dough spun\nBefore the double R had to hitchhike thumb\nHer friends didn't like niggas like us\nBut I arrested the coochie and her feelings got cuffed\nSpider web sex must have got caught up\nBut there's more to it I remember once\nSayin' \"Let's shit on the peons\nLet's go to Vegas and watch Celine Dion\"\nMake 'em say \"What we on?\"\nYou say no like you was doin' it for eons\nFuck it I just hum and let the watch give off the neons\nWhen it rains it pours, I laugh to myself when I change the score\nYou said my sex was a lot but my brain gave you more\nAnd somethin' bout how your ex was a toy, I guess he played games\nIt's only diamond dice here not tryin' to justify\nWhen you shut your eye you can touch the sky\nYou in trouble ma, and you should pray about speed\nBut if that's 'bout you, what that say about me?\n\n[Chorus: Pharrell & Snoop Dogg]\nWhat you say, say, say?\nBut when I finally found the words to say\nI wanted to run away (Run away, run away), simply run away, oh\nCheck it out, check it out\nYou can try to run and hide, it won't make a difference\nYou can lie to yourself, let me reason\nSure it hurts when it comes to your attention\nThat you're in love with the girl\n\n[Verse 2: Snoop Dogg]\nSee I'm a crip in dark blue Chucks\nAnd I does what I does yeah I might say \"cuz\"\nIt's really weird cause a nigga got love\nSnoop Dogg's a crip and the girl was a blood\nShe told me that her baby daddy was a thug\nNow it is what it is and it was not was\nI'm hollerin' at lil mama like what\nMonday morn stack tryna get my cheese back\nAll these memories breed seed to the rhythm rhyme pleaser\nLay back while we sippin' on a breezer\nFresh four pack sittin' in the freezer\nAin't that Kadija I heard she was a skeezer\nShe used to hit them licks wit' the visas\nWhen I seen her wit the homies I was like \"Jesus\"\nIt's been a little minute since I seen her\nHope her man don't run up cause I'll have to pull the nina\n\n[Chorus: Pharrell]\nThere's something 'bout this girl man, from around my way\nEver try to hold back your feelings, but it just wouldn't stay\nBut when I finally found the words to say\nI wanted to run away, simply run away\nYou can try to run and hide, it won't make a difference\nYou can lie to yourself, or try to reason\nSure it hurts when it comes to your attention\nThat you're in love with the girl\n\n[Outro: Pharrell]\nThere's somethin' 'bout this girl man\nThere's somethin' 'bout this girl man\nThere's somethin' 'bout this girl man\nThere's somethin' 'bout this girl man", "year": "2006-10-30"}]}