{"artist": "Vast Aire", "songs": [{"title": "The Crush", "year": "2008-06-24", "lyrics": "This is not a love song, nah!...\n\n[Vast Aire]\nI had a crush on Twanda\nShe went to I.S. 230\nFigure 8, she was so curvy\nHad a arch on her back with mad jewelry\nEvery Neanderthal wanted that cutie\nGood complexion, not too thin\nShe had the baddest trim\nI ain't talking about her haircut\nShe worked at my man's job\nShe made 11th graders wanted cradle rob\nShe got the sweet potato; I got the corn on a cob\nTuck ya shirt in she don't date no slobs\nIf you saw her smile she had a bad attitude and a wicked profile\nGorgeous face and a nice style\nIt'll make you say - \"Damn you can have my child\"\nGot me thinking all this is worth my while\nWith my head in a cloud, screaming loud\n\n(Hook) 2x\nI got a Love Jones for ya body and ya skin tone\nFive minutes alone, I'm already on the bone\nPlus I love the fact you got a mind of ya own\nSo you can sit by the throne\n\n[Vast Aire]\nShe look good in the Winter, better in the Summer\nI met her at the bus stop she gave me her number\nSometimes we would go out and then slumber\nShow me yours I'll show you mines\nShe lift up her sweater\nBack then no girl could do better\nI really dug Karen, or was it Anetta?\nOr was it Vanessa, Stacey, or Trecee?\nI didn't like Jessica she was too spacey\nMaya's got attitude, Janice got her titty out\nMissy's game, Viya's got her ass out\nBut Melissa's on the bed drinking wine\nDon't hate on me pa, I got pimp design\n\n(Hook) 2x\n\n[Vast Aire]\nPink cookies in a plastic bag\nGetting crushed by the Empire - State\nC'mon baby why - wait\nLet's make whoopee - today\nI'mma Frankenstein Valentine\nHow's that? Cuz I can separate my heart from my mind\nYou are too emotional\nAnd then about three seconds I'm about to go postal\nIn other words crazy nigga with a gun\nI got a crush on you but you ain't the one\nShe was using sex for a weapon\nHer aim was precise it kept me guessing\nIt kept me stepping\nI was on my toes until I learnt my lesson\nMy man tried to tell me I was slipping (Slipping?)\nI ain't even know that I was tripping\nBut this is not a love song\nWell, maybe it is, maybe I'm fronting (Maybe I'm fronting)\nWhy don't you pull my card? (Uh-huh)\nIf the duece is wild I'll let down my guard\n\n(Hook) 2x", "album": "Dueces Wild", "image": "https://images.genius.com/eb42f00f56a165e0e57e8f51a829caad.536x536x1.jpg"}]}