{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "My Writes", "album": null, "lyrics": "[Dove]\nYo - who hold guns and rock ice bigger than life;\nGot bitches throwin they drawers on stage - that ain't me!\nI raise kids, push whips, piss an mc\nLove money like I love my moms\nLove my nigga Com Sense when he bang dents all up in they wallets\nWall to wall bullshit I got hardwood floors\nSet sail for tour ever since eighty-nine\nSo y'all are fuckin the same hoes who used to be mine\n\n[Tash]\nAnd I've been waitin three summers to rhyme longside my people\nRico, De La, inject you with the lethal\nDose of hop-hippin if you thought Catash was slippin\nThen put that drink down, you drunk off what you sippin\nCatash put the dip in dip dive socialize\nFuck around with me and next you'll find yo' crib burglarized\n\n[Xzibit]\nYo you better recognize and try to analyze this\nHand over fist - how can a man act like a bitch?\nChange and switch, snitch on his crew\nYo get rid of the niggas before the same thing happen to you\n\n[Pos]\nAnd they'll leave your ass sticky like glue\nBlood leakin out, girls freakin out, motherfuckin cops tweakin out\nGot you on your knees like a freak, jugglin deez nuts\nSmugglin these cuts from S. C., you best be-\n-lieve there's no web or leave a net\nWe done swallowed 40 bottles of threat, yo\n\nChorus: all together\nWhat you know about my writes? (my writes)\nWhat you know about what's weak, what's tight?\nAnd what you know about an off night? (uhh)\nWhat you know about niggas frontin for the light?\nAnd what you know about them gun fights? (gun fights)\nGot a nigga duckin while them girls show fright\nWhat you know about my writes? (my writes)\nAh what you know about my writes? (my writes)\n\n[Xzibit]\nYeah, yeah, look\nI'm Samson without Delilah, the soul survivor\nThe drunk driver that rolls straight, take the whole cake\nChop it up with the family, wash it down with alcohol\nMy telly's a Desert Eagle for all the fuckin shots I called\nMy niggas gotta ball, never settle for less\nHeavy metal, heavy on yo' chest like two breasts\nStep into my office cause it's time for you to roll somethin\nOne false move, and we gon' beat you like you stole somethin\n\n[Pos]\nYo these style I kick should be called?? Rap\nDrawin the pussy out the nigga after my prize, cause I want it\nThey stomach what I throw, they know I'm right for they diet\nThey librarian flow keeps the party real quiet (shhhhh)\nThe love I lost outweighs the rhymes I gain\nBut the fact that I spit 'em makes me cherish the name\nSo pass the mic so I can put in my share\nI rip it from home to L. A\nWith connectin flights to rip it elsewhere\n\n[J-Ro]\nDrinkin up Black & Tan in the back of a van\nI learned as a young man - long trip, piss in a can\nGettin a house for two grand, now you got your own land\nLet your mind expand, everyday have a plan\nRo-Gram is rare earth, swingin Black Tarzan\nYou got to live with the cards dealt in yo' hand\nStay young like Peter Pan, like Sly, take a Stand\nAnd go Uptown Saturday Night like Ichiban\n\n[Dove]\nI keep it dirty like under the bed (dirty)\nDirty like Uncle Red; aiyyo, (??) (??)\nDirty brown Likwit flow thicker than the Yoo-Hoo\nDirt you dishin out, chef tellin it all\nFace down in the dirt, doin my dirty work\nExpert, tryin to regulate my network\nHead jerk, spice it with rice, stick with it\nIf they ask who cut the grits I'ma say E-Swift did it\n\nChorus with minor variations\n\n[Tash]\nAnd I've been known to get it on, past the break of the dawn\nTash'll punch you in your grill and leave \"Potholes in Yo' Lawn\"\n(C'mon!) You makin diss songs? Spit that rhyme my way\nI can shut y'all niggas down like the Y-2-K\nI did a tour in ninety-four with De La Soul and Tribe\nWe on the same vibe, cause real niggas coincide\n(\"Right-right-right..\") The situation is drastic\nBut see songs like these is why this album goin classic\n\n[J-Ro]\nThis is for the dj, bring it back one time\nI drop bombs like when my moms told me to rhyme\nI'm - old school like my dad is\nSo add this, to your collect', Plug Won - who the baddest?\n\n[Pos]\nAiyyo we theme park status, upstage these niggas like Gladys\nThem little Pips, they done tripped the wire\nBlamin they legs, while I'm claimin these tunes\nIn this we'll stay down like seats found in sorority bathrooms\n\n[Xzibit]\nYeah - we flat out classic, seperate the real from the plastic\nAnd I gotta say no names\nPlay no games, hit the switches, crack the frame\nShow no shame or fuck it all up, take the blame\nBrand name fresh out the box type hustle\nManpower success is mind over muscle\nGrind til the wheels fall off, accept the loss\nI never been soft, whatever the cost, addicted to floss\nNailed to the cross it's time to return\nMy only concern is makin sure that Hollywood burn\nHollywood burn, burn to the ground, trick-ass niggas\nIs all up in the game and don't deserve to be down\n\n[J-Ro]\nFour bottle rap, twist the cap and kick back\nDe La, Xzibit and Tha Liks came to get that\nAnd what you know about us droppin ya\nAnd leavin you with half a face like the Phantom of the Opera?\n\nChorus with minor variations\n\n[Chorus extended]\nAh what you know about my writes? (my writes)\nAh what you know about my writes? (my writes)\n\n[Tash]\nYou got the right to shut the fuck up! {*laughing*}"}], "artist": "Xzibit"}