{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "Black Males", "year": null, "lyrics": "[Intro: Boogie]\nIt’s no winning if you stuck in a losing situation\nThirsty\n\n[Verse One: Boogie]\nUh, look at us black males\nTrapped well, crack sales, uh\nIf that fails, you know just how them rat’s tails\nYour fat bails, watch these niggas turn to Maxwell\nAnd start singing, okay, sounding like this sample\nProblems we can’t gamble, no, problems we can’t handle\nTryna grip this shit, in the midst of shit, got niggas pissed as shit\nWe see the light, but we can’t get the shit, cause niggas flick the switch, shit, woo\nNiggas switching to get rich, somehow I never switch, though\nLately, I been boxed in like boxes in them warehouse stock\nAnd I guess Stockton ain’t really wanna pass my momma check\nTo the mailman, uh, and that’s hell, fam\nThat’s why I, uh, that’s why I\nThat’s why I be screaming “Fuck what niggas think!”\nIt’s sin up in the breeze and we inhale it, we ain’t saints, uh\n\n[Interlude: Epic Must Die]\nI just want niggas to listen\n\n[Verse Two: Epic Must Die]\nMaaan, he 25, he doing life\nTen years of crime, started with a dime\nHis son just turned 6, he ain’t never seen his pops\nHe only seen some pics, shit, his pops ain’t seen him\nThey the spitting image, both of they fathers missing\nI hope he grow up different, y’all probably think I’m tripping\nSpitting all this sentimental shit, but really it’s realistic shit\nThat’s how it be, the shit is deep, touching me, you feel this shit?\nHow many niggas think a gun make ‘em bigger?\nA set make ‘em stronger? A rag make ‘em realer?\nA homie for a homie, but revenge ain’t gon’ finish that\nBlack-on-black to wearing black at funerals, so remember that\nBefore you pull a trigger, that’s not another nigga\nNah, that’s your brother, you still gon’ kill ‘em, huh?\nOver what? Probably something stupid\nTypical black males, man, what the fuck is we doing?\n\n[Verse Three: Boogie]\nYo, is this Halloween or these niggas just phonies? Uh\nJust look at all these snakes, they dressed up like your homies, uh\nAnd free my niggas, we got problems we can’t pinpoint\nMy pen point me straight to the pen that points get you in\nThe wind push me straight to the point, what’s my point?\nMy niggas pinned down, writing to this pen pal\nReally ain’t no point to that shit, smoke a joint to that shit\nAnd we yelling but we silent, ain’t no voice to that shit, man", "image": "https://images.genius.com/967988d72ade953e4d1121eb78757aa7.1000x1000x1.jpg"}]}