{"artist": "Andre Nickatina", "songs": [{"title": "45 Caliber Raps", "album": "Raven in My Eyes ", "year": "1998-06-23", "image": "https://images.genius.com/7e1daec351ffc7c86dc485eebe9de835.220x220x1.jpg", "lyrics": "Its an art, swing your bat like jack clark. Catch me after dark hittin ritz with no bark. Raise the curtian, night club dweller straight flirtin, but be up with the roosters when the birds start chirpin. Show shocker, love sea food and red lobster. Heart knocker, a tiga blaze the garcia chopper. With a mouth full of weed and a mind full of greed, stampedes with no fees with a mouth to feed. Just walk dont talk if honk without a fader. Leather coat like Darth Vader, still screamin im a raider. Not a savior, playa of the F finga banger. Nick named bullet cuz im one up in the chamber\nHook\n45 caliber raps ready to snap. Lying like pinocchio on two twin tracks\n45 caliber raps ready to snap. Baby wore some jeans that exposed her gap\nVerse 2\nPut together better than a Roman Scarlet letter, my dress code reacts to the mood of the weather. Fish tailin on the freeway my tickets turn to warrants. Alcohol? my tiga sip?. Spittin wide eyed? mouth pieces of gip. Sink ships get chips, check the quality shit. Pinky nail shaped whale on a path to hell, that how it feels when your pockets and got no mail. Clientel, better keep em cuz i picks em up. One minute you the nigga now a bump in the trunk\n\nVerse 3\nMind gone Al Capone on a snith. Smellin like Ck one on the bitch. Day dreams of being drug free and having a wife, gets between my bread makin and my hustlin life. Nigga 45 caliber raps ready to snap. Lying like pinocchio on two twin tracks. We put in work, my nickel defense stays alert, All Star Chucks squeakin up the turf. Nigga banned from the spot like vanilla ice cream, wishin nightmares and i tell you nice dreams. Stay in persuit, my whole world revolves around loot. Drinkin coconut juice, wearin Kenneth Cole boots. Most of my tigas slang weed or crack. They say the bigger the peelin man, the bigger the cap. Comin like wolves in a whole damn pack. Check it"}]}