{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Book of Judges", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "[Verse 1]\nAmerica the ugly raped my mother\nDeceived my sister separated my brother\nMurdered my children hung my father\nNow they want me to rock the vote the fucks why bother\nSeen the commercials for they army or whatever\nPicture me giving a damn I said never\nMy mind's too sharp my brains too clever\nMy spine is too strong every line pulls your lever\nLimitless rhymes for the indigenous the remedy\nPLOT! Gettin' my money like the Kennedys\nFLIP IT! Put em' in stocks collect anemities\nROCK! roll behold my epiphanies and\nRead em' and weep, heat em, I beat em' to sleep\nMislead em' til we even-Steven defeat em' with freedom of speech\nAnd let em' know that I'm the motherfuckin' fire-starter\nPiss on the constitution then burn the Magna Carta\n\n[Hook]\nAll I know is what I feel\nDeceive my eyes and distort what's real\nOnly truth will set you free\nI'd rather die on my feet than to live on my knees\n\n[Verse 2]\nWe dying over black gold they harvesting the sand\nPresidents living marvelous they starving in Sudan\nIt's obvious you walk a blind bath to oblivion\nThe book of judges read the scriptures unlike Gideon\nLight my fire, start my engine\nWhen Pharoahe becomes Moses it's medicine for who listens\nA veteran with a mic bringing prophecies to fruition\nMotivational verses under adverse conditions\nYou're, caught in the mainframe I've seen the maze man\nThey watch you from the streetlights you and your main man\nThe bar code around your neck same as your name brand\nYou're lost in a strange land no thoughts of a game plan\n\n[Hook]\n\n[Outro]\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta\nPiss on the Constitution then burn the Magna Carta, Carta, Carta (Fading out)", "year": "2007-06-26"}]}