{"artist": "Ice Cube", "songs": [{"title": "Crack Baby?", "lyrics": "[Hook]\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you the motherfucker that broke in my Mercedes?\n\n[Ice Cube]\nLet me tell y'all, the definition of shady\nIt's a nigga like you that think it's all gravy\nDo some dumb shit, dumber than join the Navy\nWhat yo' broke ass doin' with a hundred babies?\nStrap it on please, you're spreadin' STD's\nThroughout the hood, you's a walkin' disease\nYou took the bad ones, and you turned 'em into sad ones\nBitch you dumb too, fuckin' with the last ones\nYou's a crazy nigga goin' in and out of there\nLike you love it, but nigga I'm outta here\nWhen they crack the door, boy I ain't comin' back\nI'm tryin' to figure out, why you keep runnin' back?\n\n[Hook]\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you the motherfucker that broke in my Mercedes?\n\n[Ice Cube]\nSick with it, bipolar, crazy as the Ayatollah\nWent in to buy a soda, now we shootin' at the rollers\nHe looked at me like \"Cube, I thought you was a soldier\"\nI am nigga, but not for a Coca-Cola\nJumped out my car when his head hit the tar\nIt bust like a jar but he still wanted to spar\nThey jumped out, and hit his ass with the taser\nFifty thousand volts turned him into Joe Frazier\nBeat they ass, took they badge, took they guns and they cash\nCame by the bar, nigga rollin' in they squad car\nBlue and red lights flashin' like a superstar\nI just shook my head and wondered who the fuck you are\n\n[Hook]\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you the motherfucker that broke in my Mercedes?\n\n[Ice Cube]\nYou've got to be a crack baby, turn into a grown-up\nSharp as a bowling ball, brain like a donut\nMy daddy told me that the early bird get the worm\nHe told me that the early dope fiend get the sherm\nThree AM, see you ridin' on that bicycle\nOld motherfucker, what you doin' on that tricycle?\nYou's a cold motherfucker like a icicle\nWith your grandmama purse tryin' to buy a nickel\nI should kick ya ass just because she can't do it\nCause all you do is talk shit and you drink fluid\nYou say \"Yeah man, you better get used to it\"\nThey say God is perfect, and I say he blew it\n\n[Hook]\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you the motherfucker that broke in my Mercedes?\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you a grown crack baby born in the '80s?\nAre you the motherfucker that broke in my Mercedes?", "image": "https://images.genius.com/284f4145950de6c7f91a598379e2bb40.1000x1000x1.jpg", "album": "Raw Footage", "year": "2008-08-19"}]}