{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "Pass the Mic", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "[Intro]\nUh, uh!\nYeah, yeah!\nUh, uh!\n(Pass me the mic 'cause I'm off the ledge!)\nYeah, yeah!\n(Pass me the mic 'cause I'm off the ledge!)\nUh, uh!\n(Pass me the mic 'cause I'm off the ledge!)\nYeah, yeah!\n(Pass me the mic 'cause I'm off the ledge!)\nUh, uh!\n(Pass me the mic 'cause I'm off the ledge!)\n\n[Verse 1]\nI give [?] to ladies who say that they need it\nAll you braggin' about perpetratin' pimp-hoes beat it\nIt's not my fault that I'm the man you wanna mimic\nA gentleman [?] rapper, back off me, that's my gimmick\nYou're not dapper, your suit's not from the tailor\nYou bought it off the rack because you're wack and plus a failure\nGrab my mic, no nah you can't reach it\nA-be like me, you couldn't learn it if I teach ya\nNow I don't know some rappers from Adam (yeah)\nI won't brag and try to say that I can wreck 'em (yeah)\nSee I hold my own and protect my perimeter\nI won't limit him or even limit her\nI do what I do and that's for me\nNevertheless it sounds selfish but that's the key\nAnd I don't hang with those people who likes to half step\n'Cause that will result in me havin' a bad rep\nAnd I don't need no bad publicity\nWalkin' around havin' no names dissin' me\nSayin' I get taxes if I'm a salary\nKnowing my songs [?] as if it was a calorie\n'Cause I'm that man that ladies be glad to see\nWhen it comes to women I specialize in the anatomy\nNow talk about me like a Hollywood scandal\nUh! 'Cause I'm sure hard to handle, uh!\n\n[Hook]\nPass me the mic 'cause I'm off the ledge! (Uh)\nPass me the mic 'cause I'm off the ledge! (Yeah, yeah!)\nPass me the mic 'cause I'm off the ledge! (Uh, uh!)\nPass me the mic 'cause I'm off the ledge! (Yeah, yeah!)\nPass me the mic 'cause I'm off the ledge! (Uh, uh!)\nPass me the mic 'cause I'm off the ledge! (Yeah, yeah!)\nPass me the mic 'cause I'm off the ledge! (Uh, uh!)\n\n[Verse 2]\nNow life's a game and I live it accordingly\nBrothers are jel' 'cause women are supporting me\nThey bought an album and plus the show ticket\nThey wanna see the original rapper who's praised by the critics\nNot fall short because I don't fall short of\nEvery women's thought that means I'm always thought of\nTake 'em slim and fat with a name like Jane Doe\nEven take your hoe and put a tag on your toe\nI'm giving women life for all those who wanna get it (and)\nSo cut your man baby, call the paramedics (what else)\nLife's too short to be carryin' around dead weight\nMake that move right now before it's too late\nI'm hard to handle that means you can't grip me\nI can't be whipped, baby don't try to whip me\nI can't be blown, thrown or shown\nI said the only thing Positive can be is known\nWorldwide and even locally\nYeah, all instrumental and ya'know vocally\nI got the voice that makes the almighty dollar\nGet a ring around your [?] around your collar\nWhen you mess with [?] Cinderella\nIf you see her tell her Positive's a smooth fella\n\n[Hook]\nUh, yeah!\nUh, yeah!\nUh, yeah!\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge! (Uh, yeah!)\nPass me the mic 'cause I'm off the ledge! (Uh, yeah!)\nPass me the mic 'cause I'm off the ledge! (Uh, yeah!)\nI'm the best thing that came since grits!\n\n[Verse 3]\nNow back up off and stop jackin' off\nAnd all my battles won were strictly by forfeit\nSome saw the beginning but none saw the ending\nWith the thought of winning but the title's still pending (damn)\nThen me, the holder, strictly 'cause I took ya\nSaid that you're raw, but nah I think I cooked ya\nYou're done, well done, matter-fact crispy\nNow you hung around sayin' \"Pos, why you diss me?!\"\nI'm not mediocre, the Batman or the Joker\nLife is a game similar to poker\nBut I'm a flush, yes a flush that's royal\nMy girl is always loyal unlike they Olive Oil\nSteppin' in the boots, I think I'll smack him to a finish\nPopeye's a punk for relyin' on some spinach\nI get fed up, I go head up\n[?] I'm shoppin' I might pull the lead off (hmmm)\n'Cause I'm a sinner with an itchy trigger finger\nA bone so hot I got to turn off your ringer (c'mon)\nI took all I could stand, can't stand no more (what else)\nMy house is decorated in a modern decor\nMy clothes have a Positive K signature\nAnd I'm sure next year I'ma headline the tour\nLike that y'all (that y'all), Positive K (Mmm)\nYes in the night and also the day\nI say that I've done because I did it\nI'ma end the song by tellin' Silver D to hit, c'mon\n\n[Outro]\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge!\nPass me the mic 'cause I'm off the ledge!", "year": null}]}