{"artist": "WC", "songs": [{"year": "2007-08-14", "lyrics": "[Verse 1: W.C.]\nFrom hood to hood, city to project, the project\nNigga what's the motherfuckin' dialect?\nGangstas, caught in a shuffle\nNiggas tryin' to turn a constant struggle to the positive hustle\nWhether it's the yay or the 9-to-5\nThe pills or the chronic, we hustle to stay alive\nAnd if you ain't Reggie Bush runnin' a rock\nYou better be good as Kobe slangin' a jumpshot\nCause round here the odds of success is nimble\nIt's like Russian Roulet with five bullets in the barrel\nI'm located on the map, with latinos and black\nAmerican dream is pistol and a dope sack\nWhere they process, strip us down to scan us\nLock us up and ban us, the city of bandanas\nWhere we, grind steadily and move to the 12-gauge melody\nJust livin' in the hood is a felony\n\n[Chorus: Ice Cube]\nAnd if you guilty by affiliation\nAnd you're subject to humiliation\nAnd you're facin' incarceration\nProbation or under investigation\nThrow your hands up to the sky\nOh Lord please tell me why\nMy own people gon' testify\nI'm in the hood and I don't have a alibi\n\n[Verse 2: W.C.]\nI'm lookin' at my TV. The commercials keep\nTellin' me, nigga 'Be All You Can Be'\nBut if ain't BET or in the backseat\nOf the LAPD I'd barely see me\nIt's a trip, the whole world finna rap\nBut when it's time to shine, where all the real niggas at?\nDo a nigga gotta be rich, just to get over?\nDo a gotta be a bitch to sit next to Oprah?\nIt must be the walk but I'mma keep it O.G\nI'm a nigga that like soul food and to smoke weed\nAnd stay breaded, hit the corner on the hog\nWith my middle finger twisted, index and pinky spreaded\nA sellout nigga, I'm the wrong type\nWest Coast nigga, take flight on site, I know they\nHate to see me comin' but, I gots to put the blue\nChucks on the pedal and rep it for the ghetto\n\n[Chorus: Ice Cube]\nAnd if you guilty by affiliation\nAnd you're subject to humiliation\nAnd you're facin' incarceration\nProbation or under investigation\nThrow your hands up to the sky\nOh Lord please tell me why\nMy own people gon' testify\nI'm in the hood and I don't have a alibi\n\n[Verse 3: W.C.]\nFo-fo' up under my zipper\nCause bein' black ain't a job it's a motherfuckin' adventure\nLook, the gun shots won't cease\nAnd rollin' by, if it ain't my enemies then it's the police\nI'm askin', which one will kill me faster?\nIs it that drive-by, or the cigarette causin' cancer?\nGod made a promise that we all gon' die\nAlong the ride nigga might as well ball and get high\nSo I'm sittin' back with the zig-zag, grabbin' and snappin'\nThe gank back for action just in case I gotta get to clappin'\nCause niggas is playin' elimination\nAnd where I'm from every nigga's guilty by affiliation\nThat's why we ride and the young die\nAnd you lucky if you live to pass 25 that's why they\nHate to see me comin' but, I gots to put the blue\nChucks on the pedal and rep it for the ghetto\n\n[Chorus: Ice Cube]\nAnd if you guilty by affiliation\nAnd you're subject to humiliation\nAnd you're facin' incarceration\nProbation or under investigation\nThrow your hands up to the sky\nOh Lord please tell me why\nMy own people gon' testify\nI'm in the hood and I don't have a alibi\n\n[Verse 4: W.C., (Ice Cube)]\nI gotta rep where I'm from (Where you from?)\nSouth Central where the good die young\n(Where you at?) Western & Imperial\nIt's the pure West Coast, comin' out your stereo (West Coast)\nI gotta rep where I'm from (Where you from?)\nSouth Central where the good die young\n(Where you at?) Western & Imperial\nIt's the pure West Coast, comin' out your stereo", "image": "https://images.genius.com/d4ed6bd2c7a379500fac9a01a4457d66.300x300x1.png", "album": "Guilty by Affiliation", "title": "Guilty by Affiliation"}]}