{"artist": "Z-Ro", "songs": [{"album": null, "title": "Hey Lil Mama (radio)", "lyrics": "[Hook:]\nHey there Lil' Mama\nWhy don't you come & take a ride with me around the town?\nOn the low, we could be goin' down baby\nHey there Lil' Mama\nWhy don't you come & take a ride with me?\nWe can smoke us a pound\nHit the Telly & we can & gon' clown baby\n\n[Z-Ro:]\nWell uh excuse me miss, I don't wanna take up your time\nAnd this ain't none of that kitty game with the same old pick up line\nI'm a get straight to the point, you are as lovely as a rose\nThough I'm not into one night stands, I'm eager to see you out your clothes\nPlease don't take it the wrong way, I'm just spectatin'\nBut I won't lie & say I'm not thinkin' about sex makin'\nIt was on my mind real strong, but I don't wanna rush\nWe can remain friends for a real long time\nBy then I'd know if I've been dealin' with a strong mind\nEither business brain the drugged up & gone mind\nBut that's irrelevant, I'm speakin' for the present baby\nTell your girls you gon' holla, jump in my Intrepid baby\nUnless they wanna come & kick it with my homies\nIf not, me & you could kick it & leave 'em all lonely\nI got alot of girls on my phone tryin' to lay with me\nBut just for tonight, I want yourself to come & stay with me\n\n[Hook:]\nHey there Lil' Mama\nWhy don't you come & take a ride with me around the town?\nOn the low, we could be goin' down baby\nHey there Lil' Mama\nWhy don't you come & take a ride with me?\nWe can smoke us a pound\nHit the Telly & we can & gon' clown baby\n\n[Z-Ro:]\nPapa was a rollin' stone & he still rollin'\nI guess that's why I leave alot of pussy holes swollen\nI must've got it from my Dad, this mackin' in me\nPlus all the girls love this big dick I'm packin' with me\nDon't get me wrong, I'm not a hit & run\nAnytime you make time for me, then you can come & sit & give me some\nTryin' to handcuff me, you movin' too quick\nNot tryin' to be seen in public with you at the movies & shit\nChances are you got a man, he gon' be mad if he see you\nSo let's keep our thing undercover, so nobody know what we do\nLong as we do it like that, we can do it long\nMake it a while since we did it last so we do it strong\nIt's in my blood to be as straight up as I can be\nAnd straight up I can see you in my jacuzzi chillin' with me\nThough I got alot of girls on my phone tryin' to lay with me\nJust for tonight, I want yourself to come & stay with me\n\n[Hook:]\nHey there Lil' Mama\nWhy don't you come & take a ride with me around the town?\nOn the low, we could be goin' down baby\nHey there Lil' Mama\nWhy don't you come & take a ride with me?\nWe can smoke us a pound\nHit the Telly & we can & gon' clown baby\n\n[Z-Ro:]\nI feel my cellphone vibrate & I wonder who could it be?\nAnother bad ass yellow bone talkin' dirty to me\nShe say she ready for me to come & make my round\nTellin' me how she gon' do me, I'm ready to break right now\nAs soon as I got in my ride 'fore I made it out the driveway\nThe twins hit my celly, said that they were comin' my way\nDouble the pleasure double the fun, I can't miss that\nA menage with the Asian persuasion, I had to hit that\nMakin' money all day long is what I love\nBut I'm tryin' to give up a minute or 2 so you can fuck a thug\nAnd I won't waste your time, not a minute man\nLayin' pipe with long jevity, always I'll be in it man\nAnd once I reach my conclusion, that ain't the end\nI'm just givin' you a breather, baby go on & catch a wind\nMaybe that's the reason all these girls wanna lay with me\nI'll show you if you want me to, just spend the night & play with me\n\n[Hook:]\nHey there Lil' Mama\nWhy don't you come & take a ride with me around the town?\nOn the low, we could be goin' down baby\nHey there Lil' Mama\nWhy don't you come & take a ride with me?\nWe can smoke us a pound\nHit the Telly & we can & gon' clown baby", "year": null, "image": "https://images.genius.com/20010e2d73e6d96ee166bef205163763.1000x1000x1.jpg"}]}