{"artist": "G-Eazy", "songs": [{"title": "Achievement", "album": null, "year": "2014-11-21", "image": "https://images.rapgenius.com/d473d1aa15e22cbc376e67d314614aae.500x500x1.jpg", "lyrics": "[Verse]\nAnd this verse is just a method to communicate\nStunt on everybody just so you can hate\nI think I'm the one, I'll show you why then let you debate\nSo direct, shoot it straight\nIf you just heard about me then you're stupid late\nGet right or get left ho, choose a fate\nFollow no one I move at my own pace, you can wait\nNotice how you stop touching bread like you're losing weight\nOne day you will see why I'm truly great\nI be on the road till I'm old like Willie Nelson is back\n20k for a verse you need some help on a track\nAnd I swear I've been all the way to hell and I'm back\nWithout a cosign at all I put myself on the map\nI was chilling with a girl that I just met\nMid conversation got impatient\nSo I asked her can we fuck yet?\nGuess that she was upset\nThat was about the time she stormed off, steaming mad\nShe was bad but I just let\nHer go, why you sweat girls like a fur coat\nIn the summertime? You're a nerd bro\nNever leave work never furlough\nThink you're fucking with me? K, sure bro\nReady all times say the word go\nSippin' drinking merlot, started drinking early\nStill the same Gerald half killer, half nerdy\nSo far, my 20's they've been one hell of a journey\nBob Dylan told me don't trust no one over 30\nDamn, draped in Saint Laurent and Supreme\nAmount of money that I spend on what I want is obscene\nAll surreal how we live this good off of a dream\nAnd I swear I do it all for the team\nDrunk off of the Heem\nTruly feel I'm the coldest alive\nAll I do is work, focus, and strive\nSplit a swisher, roll a fatty I'mma smoke this and drive\nI'm a threat, now some of you can really only hope to survive\nGrab a glimpse I'm as rare as it gets\nForget whoever else you might've thought was apparently next\nOut here and I'm blessed\nI come to town and every girl in the city's at my show and all the parents get stressed\nI'm maneuvering with flair and finesse\nWorking out so I could carry the west\nI'll prepare for the test and I'm ready after 5 sets\nLift the whole bay with my biceps\nCaution if you try to follow my steps\nYou will trip and fall get exhausted and collapse\nMost of these haters carry germs so I'm cautious giving daps\nI just can't fuck with everyone my circle stays the same size\nEnjoy the lifestyle that fame buys\nAfter party is at Drai's in Vegas where they have the view\nGet some girls, grab a few but only bring the baddest through\nRappers imitate the style, I'm not even mad at you\nI'm not even throwing shade, I just overshadow you\nYeah I'm in my own lane, run my own pace\nChasing nobody marathon my own race\nI do it for the bay area that's home base\nThey try to run next to us but there ain't no space\nI feel like life just switched to hyperspeed though as of recent\nThe difference between yourself and me is you're just decent\nA garden full of flowers grew its way up through the cement\nIf I ever said I'm never scared just know I really mean it\nI dreamed about the top I had a vision and I seen it\nIf you know the work comes first then you and I are in agreement\nAnd it's a long haul but I work harder than them all\nSo come back in 5 years and we can talk about achievement\n\n[Skit/Outro]\n[Reporter]: Hey let me ask you something. Do you worry about achievement? Does it worry you or do you just do your own thing and say \"here it is you either accept it or not\"?\n[Tom Waits]: Well, do I worry about achievement?  No I worry about a lot of things but I don't worry about achievement\n[Reporter]: No, well I'll scratch achievement off"}]}