{"songs": [{"year": null, "image": "https://images.genius.com/da38feb1c7ca636243c52d23e325bbd4.500x500x1.jpg", "title": "Feel My Soul", "album": "Thugs Revenge", "lyrics": "[Intro: Bizzy]\nThe Lord can feel my soul, we are never alone\nBone smokin sticks and stones\nWords can never hurt me, have no evil\nWhere do we go from here? The Lord, the Lord\n\n[Chorus: Bizzy Bone]\nThe Lord can feel my soul, we are never alone\nBone smokin sticks and stones (words can never hurt me)\nWords can never hurt me, have no evil\nWhere do we go from here? Wherever if baby\n\n[Bizzy Bone]\nLet nothin break your loyalty cause loyalty be royalty\nGather up your people we be congregatin, toiling\nSoiling, diggin deeper watchin the speaker\nRighteousness, tender hearted temperature boiling\nHumble me, words written feedin the hun-g-ry\nChrist Jesus, I be preachin your name certainly\nBumbling and stumbling baby we still comin\nHarmony army sent you, from the land mothering\nBrotherly, Heavenly Father tryna help 'em\nSmother me in your mercies, render my everything\nTenderly, baby remember me?\nI said it's plenty B wherever you go, September, G\nHellified, tell the truth, don't lie\nI don't have the luxury to play I must provide\nMelody, border of my musicianary missionary\nNever no status, we positionary\nHeavenly Christ Jesus, son of the father\nShed blood for my people, respect it and you can call me\nDefinitely, if not him? Pssh, better be\nA little somethin for you to remember me\n\n[Chorus]\n\n[Bizzy Bone]\nBaby we gotta get 'em, helpin 'em out now\nSome way, some motherfuckin how\nThrough the court trial, people sentence me and I smile\nOn lockdown, lettin me out like wow\nIt's only one, spirituality to feelin the rock crowds\nPeepin me, I never put the top down\nShootin at me, find the fountain top of the mountain (chow)\nNo adultury, bravery is the sacrifice in Jesus Christ\nYessss - and he came in the flesh\nAnd yes he paid the price, just like war say\nWhen I read it, you know I got excited\nDavid is the Psalm red, I feel so invited\nGatherin the family tell 'em I love 'em, they remember me\nHeavenly, smokin in, carry that\nKnowin me, journey past blasphemy\nBaby tried to capture me, honor mommy and daddy - only one\n\n[Chorus]\n\n[Bizzy Bone]\nPray daddy not mad at me, they tryna tear us apart\nThey put they hands on me, will you bless me? I'm from the heart\nLittle Bryon baby, love everybody I'm around\nPayin attention baby, even even if you down\nAnd the frown on, and turn it upside down\nYou put the smile up, I move on fast real quick, real quick\nIn the weapons of the mind real slick\nNow give me grace and peace\nPraise the Father and the Son and the Holy Spirit\nIncrease the beast survive, your relatives and tribe\nAs long as you spiritual, you always alive\nBy the bloodshed in Jesus Christ, I truly thank you\nI'm livin in vain times, I love and I'm truly thankful\nI'm never alone and I think about you\nI don't have to worry, I'm alone and I sing about you\nSo as we here to greet our brothers with the spiritual kiss\nLet us be stiff fast and Heavenly rain, give me your wrist..."}], "artist": "Bizzy Bone"}