{"artist": "50 Cent", "songs": [{"album": "Bulletproof (Soundtrack)", "image": "https://images.genius.com/a67b37e2a3aaa0ddad59cdae813b6aa8.500x500x1.jpg", "title": "Not Rich, Still Lyin’ (Game Diss)", "lyrics": "[Intro]\nThis mic on?\nLadies and gentlemen\nI'd like to thank you for coming out tonight\nFor the screening of my new film\n\"I'm Not Rich I'm Still Lyin'\"\nIt's 50 Cent starring as Game, it's autobiographical\nI hope you enjoy yourselves\n\n[Verse 1: 50 impersonating Game's voice]\n50 callin me crazy, I might be just maybe\nI'm gangsta I'm crippin', the Damu I'm trippin'\nFuck 50, fuck Dre, fuck N.W.A\nMan I'm Hurricane Game (Em this nigga changed)\nI brought the west back I write the best raps\n(But what about Snoop?) Snoop shit ain't all that\nAnd I get bad bitches now I even fucked Mya\n(I fucked her 1st Game) 50 you a liar\nSee that's why I hate you, you think you know me\nI'mma tell everybody you shot my homie\nI hope the police get you and you go to jail\nFeds freeze your accounts so you can't make bail\nHope everybody on G-Unit go to hell\nWit Eminem, Obie, Stat Quo and D-12\nSo what I was on change of hearts so what I was a stripper\nSo what I never banged I'm from Compton nigga\n\n[Hook]\nNow horror films they scare me\nI watch action films very rarely\nWhen it's comedy or it's drama\nIt's starrin me no problem\nNow horror films they scare me\nI watch action films very rarely\nWhen it's comedy or it's drama\nIt's starrin me no problem\n\n[Verse 2]\nG-G-G-G-Unot! I got my own shoe (Game that shit ain't gon' sell)\nSo, the ad's in the magazine nobody can't tell\n(Good luck wit yo next album man I hope it does well)\nYou tryna be funny, D-Mack got all my money\nAnd Jimmy robbin me, they listenin probably\nMe and Fase had a fall out he really not my brother\nWe got the same father but we got different mothers\nNow Suge punked Dre but he don't punk me\nI won a Vibe Award this year nobody punch me\n(Game you know I wrote that hook for Hate it or Love it)\nSo what, it's still on my trophy case I think nothing of it\n\n[Hook]\nNow horror films they scare me\nI watch action films very rarely\nWhen it's comedy or it's drama\nIt's starrin me no problem\nNow horror films they scare me\nI watch action films very rarely\nWhen it's comedy or it's drama\nIt's starrin me no problem\n\n[Outro: 50 Cent (normal)]\nYeah; it's 50\nNew album, July 18th\nIt's called \"I Can't Stay Away\"\nY'all thought I was gonna let y'all eat? Naw nigga\nOh! This is too much fun man\nHey... hey nigga I seen yo lil DVD nigga\nIs that all you got? I mean newsflash: nobody believes you\nThen you say you woke up outta coma 2001\nWell yo brother says you never were in a coma\nThen you say you were in a gang\nWell yo brother says you were never in a gang\nNow you can get your records together\nAnd you can submit 'em to me\nI mean you can send the records you have to me\nSo I can... open... ya album budget, your recording budget\nYou gotta send your music to the boss.... that's me, the boss\nYeah....it's D-Unit, G-Unit, that's it, that's all\nI rule with a iron fist\nCocksucker", "year": null}]}