{"songs": [{"lyrics": "[Verse 1]\nMy first name is a random set of numbers and letters\nAnd other alphanumerics that changes hourly forever\nMy last name, a thousand vowels fading down a sinkhole\nTo a susurrus, it couldn't just be John Doe or Bingo\nMy address a made-up language written out in living glyphs\nLifted from demonic literature and religious text\nTelephone uncovered by purveyors of the ouija\nThen checked against the CBGB women's room graffiti\nMy social a sudoku, my age is obscure\nMy in-case-of-emergency is in the daisies chasing birds\nEmployed by trillionaires with perfect teeth and pores\nAnd people who open doors for the people who open doors\nMy medical history is a course at SUNY Buffalo\nCharlatan psychiatry and troubleshooting undertow\nNervous in the service still, I'm burger meat and purple pills\n\"Here,\" \"Thank you, we'll call your name,\" \"Sure you will.\"\n\n[Interlude]\nSkipped lunch\nI'm shrunk\n\n[Verse 2]\nYou pack up all your manias, you're sitting in the waiting room\nYou're dreaming of arcadia, you're feeling like a baby tooth\nAwaiting panacea, channeling your inner Beowulf\nIn purgatory, just before you pay up to filet yourself and others\nIn the name of help, coal on a conveyor belt\nInto ego death alone, no telephone from Gabriel\nI'm half a human, combin' over Home and Garden stoned\nGold chains over turtleneck, cigars over cologne\nA thousand shitty paintings wrapped around a wounded animal\nWoo him with the Schubert, he's a future human cannonball\nLittle fuckers fighting, mother hiding in her Hulu\nI'm climbing up the stucco, let's get to the seppuku, uh-oh\nThat pretty penny turned the prickly into Benji\nIf you save up all your winnings then you get to count your blessings\nI finally crunched the budget up and punched the button\nShe called my name out and pushed me into an oven\n\n[Interlude]\nThe fuck?\nI'm shrunk\n\n[Verse 3]\nShe says, \"I'm not your enemy.\"\nI said, \"That sounds like something that my enemy would say.\"\nInstead of playing off the chemistry\nShe said, \"You're being difficult.\" I said, \"I'm being guarded\nYou're a quarter-mil in debt, I get more guidance from my barber\nLook, I'm not good at this, I grew up in a noogie-fest\nYou built your walls up high\nOr said goodbye to all your Cooky-Puss\nHere's one: every time my telephone buzzes\nI see images of hooded riders setting fire to hundreds.\"\nShe said, \"When you start getting all expressive and symbolic\nIt's impossible to actualize an honest diagnostic.\"\nI said, \"When you start getting all exact and algebraic\nI'm reminded it's a racket, not a rehabilitation.\"\nOkay, agree to disagree as grown-ups from opposing clans\nHonoring the push and pull, I should've called the Scholomance\nOh well, preservation is a doozy\n\"Will you be needing another appointment?\" \"Absolutely\"\nI'm shrunk!", "title": "Shrunk", "album": "The Impossible Kid", "image": "https://images.genius.com/1d8582e283f0f4d717c0ba1fe12df744.1000x1000x1.jpg", "year": "2016-04-29"}], "artist": "Aesop Rock"}