{"songs": [{"year": "2006-01-01", "title": "Untraceable", "image": "https://images.genius.com/4efe3d7de04a343b34f1b0ddcfbc7bf4.1000x1000x1.jpg", "lyrics": "[Intro:]\nYeah love is love, you know, it's what it is\nHad a rough year, got caught up in some bullshit\nBut my dudes told me, you know squash that X\nWe gon' go to Miami for Memorial Day\nAnd play for a little while\nYeah we played, yeah boy did we play\n\n[Verse 1:]\nNow mind you, my shit ain't plush\nBut I get up in the morning, and catch the early rush\nListen yo, I'm playing with time\nNew York state say I owe for the crime\nBut at least they let me rock for the whole hot  Summer\nGet my affairs in order, then some gwap to my daughter\nMy dudes took me to Miami, did we play?\nKilled Memorial Day\nStayed at the Sagamore, had a penthouse suite And one on the fifth floor\nAte and partied with a crew of bosses\nCabana on the beach, liquor at arms reach\nCame to town with a bag full of pills\nNiggas real icy, and broads caught the chills\nMy dudes ain't no rap niggas\nJust real grown men, who can manipulate the figures\nBitches throw in New York and Greensboro\nNiggas couldn't front, we was thorough\nSeen kids sing Jamal, cause he heavy on the wrist\nBoy with a five day spread\nTen star dining, and ten star head\nBut still kept that thing on cock\nI  ain't gon' front, I ain't trying to get rocked\n\n[HOOK: Sadat X]\nI'm still the untraceable, they can't rate 'Dat\nOne of the baddest niggas to ever grip this here\nThe Precog, read the blog\nStill get a loose from Ack?\nNigga I'm from your block\nNigga I'm from your block\n\n[Verse 2:]\nYeah, I rip up body, if it smell real good\nI might want to taste it, Ma I could\nLet's get to mingling, mix chromosomes\nBubble type baths, oils and foams\nI really love a reggae, all types of lust\nPowerful hips man, I'm about to bust\nYou open up the door, she could see the seashore\nTempt me, make me want to stick it raw\nBrought her to the crib, gave her her own drawer\nI'm really quite happy, need I say more?\nWill we get married, I'm not really sure\nTracey give me babies, at least 3 or 4\n\n[HOOK: Sadat X]\nI'm still the untraceable, they can't rate 'Dat\nOne of the baddest niggas to ever grip this here\nThe Precog, read the blog\nStill get a loose from Ack?\nNigga I'm from your block\nNigga I'm from your block\n\n[Verse 3:]\nNow I'm the man among boys, the street settler\nI hit you, and then hit your man, cause he being such a meddler\nThe Untraceable, went to war with the whole block\nSqualor [?] no English for the Dollar\nI might holler, let me call my dudes first\nMore local than mainstream, with my main team\nWe globetrotters and real grimey\nI'd rather them be that way than bein' some-timey\nYou pretty niggas'll crack, at the first sign of a dust-up\nBuilt non-certified, they brains is fried\nYou smack her cause he lied, you's a wild boy\nKnow the Wild Cowboy and where I am, and where I be at\nSee that grown man shit and be aware\nThrow it in the air, might get lifted in the air\nI come peaceful, but I will flip cabs on you\nDon't say I didn't warn you, you should of joined the army\nI'm about to arm me, set my niggas free\n\n[HOOK: Sadat X]\nI'm still the untraceable, they can't rate 'Dat\nOne of the baddest niggas to ever grip this here\nThe Precog, read the blog\nStill get a loose from Ack?\nNigga I'm from your block\nNigga I'm from your block", "album": "Black October"}], "artist": "Sadat X"}