{"songs": [{"title": "Lost Ones (Remix) (Part 1)", "album": "J. Period Presents... Best of Lauryn Hill, Vol. 1: Fire ", "year": null, "image": "https://images.rapgenius.com/120aecb25b6c1aaba8b52405150ed00a.1000x1000x1.jpg", "lyrics": "[Intro: Rohan Marley]\nYeah, yeah, yo, Lauryn, allow me to talk 'bout them, you see it?\nJ. Period, as usual, run that again, that one's hot, from the top\n\n[Verse 1: Lauryn Hill]\nIt's funny how money change a situation\nMiscommunication lead to complication\nMy emancipation don't fit your equation\nI was on the humble, you on every station\nSome want play young Lauryn like she dumb\nBut remember, not a game new under the sun\nEverything you did has already been done\nI know all the tricks from Bricks to Kingston\nMy t'ing done made your kingdom want run\nNow understand L. Boogie non-violent\nBut if a thing test me, I run for my gun\nCan't take a threat to my newborn son\nL been this way since creation\nA groupie call, you fall from temptation\nNow you want to bawl over separation\nTarnish my image in the conversation\nWho you gon' scrimmage like you the champion?\nYou might win some, but you just lost one\n\n[Hook: Lauryn Hill] (x4)\nYou might win some, but you just lost one\n\n[Verse 2 Lauryn Hill]\nNow, now, how come your talk turned cold?\nGain the whole world for the price of your soul\nTryin' to grab hold of what you can't control\nNow you all floss, what a sight to behold\nWisdom is better than silver and gold\nI was hopeless, now I'm on Hope Road\nEvery man want to act like he's exempt\nHe need to get down on his knees and repent\nCan't slick-talk on the day of judgment\nYour movement's similar to a serpent\nTried to play me straight, now your whole style bent\nConsequence is no coincidence\nHypocrites always want to play innocent\nAlways want to take it to the full out extent\nAlways want to make it seem like good intent\nNever want to face it when it time for punishment\nI know you don't want to hear my opinion\nThere come many paths and you must choose one\nAnd if you don't change, then the rain soon come\nSee, you might win some, but you just lost one\n\n[Hook] (x4)"}], "artist": "Lauryn Hill"}