{"artist": "Asher Roth", "songs": [{"title": "Healer", "image": "https://images.genius.com/e7be0abebf7a2ead2080b2dbd056152e.500x500x1.jpg", "album": "The Greenhouse Effect Vol 2", "lyrics": "[Verse 1]\nMind wonders if it's turning obsolete\nSometimes I struggle honestly with what I do believe\nTo hook it on and look beyond and tell me what you see\nI see us needing what we want instead of what we need\nClimbing to its the peak, find the motion is exhausting\nMost have lost touch, still wandering regardless\nDon't wanna pay attention on how to make a connection\nWhen wrecking a man's treasure and throw it right in the garbage\nFaltered, unfathered, our fault that he didn't bother\nWanted to be proud of, now challenged to think harder\nLonger, dig deeper, nothing has came easier\nAnxious and plain eager, impatient to play speaker\nMake 'em wait, teach'em how to thread the needle\nPeople hating people, that's horrible trained evil\nOn the morning's eve, be encouraged, take action\nOnly to receive distraction, distraction, distraction, fuck!\nWhat was I trying to accomplish?\nNon traditional, non-fictional, spit conscious\nNot to mention blonde friend you take shots with\nOr take shots at, but might bounce back\nAnd bite your ass if we ever cross paths\nCause you never bother questioning the cold hard facts\nEver stop to ask to get out of my head\nThe subconscious tap like a Natty Light keg\nNow the thought process, coming out of my neck\nSpills into the palace of the fellas breaking bread\nSeeking balance, getting calluses instead\nWorking hard, a valiant attempt\n\n[Hook]\nI know we ain't dead yet\nWe've been living through your internet\nYou don't have to believe everything you think\nWe've been programmed, wake up\nWe miss you\n\n[Verse 2]\nSo conflicted, my interest in this mission\nTry to walk away, feeling that nobody would listen\nWhen you're always known to take the road of least resistance\nYou have to let it go, what's a plan without a vision?\nSo confused what to do, can't see\nIn our food, in our news, in our sleep\nIt intrudes through the roots of our trees\nInhaled in ourselves, get impaled when we breathe\nIf it fails we excel and retreat\nFrom the tales of the chem. trails pails in the scrip\nVeils on the street lamps, all hail the weak\nWhile our freedom goes stale, too impaired to get free\nWe agree to the breach through our silence\nNo sirens, no fires and no violence\nMore wires, more hired for their alliance\nMore lies to hide behind so why try it?\nTalk about it, find people feel the same\nBut larger conversations say people go astrained\nMaybe it's in vain working on a better day\nAnd hey maybe this will resonate", "year": null}]}