{"artist": "Anybody Killa", "songs": [{"title": "Ghetto Neighbor", "image": "https://images.genius.com/0ef45eaaeeb6c906ab411eeb71f61222.800x800x1.jpg", "album": "Hatchet Warrior", "lyrics": "[Verse 1 - Anybody Killa]\nThey call me ghetto neighbor, I don't give a fuck\nSounds bumpin' all night, steadily wakin' you up\nHomies bangin' on the door because I'm slangin' the tree\n24 hour weed spot,  buy two, get one free\nEvery week another piece of property gettin' stolen\nCheck it in you little buster watch your eye get swollen\nNeighborhood bad ass, I think the whole block hates me\nReady to freeze psycho motherfucker actin' crazy\nEver since the young age of 13\nSame house, different neighbors and they all blame me\nFor all them cars that got stolen, the windows that got broken\nA handful of jewelry that the cops caught me holdin' (Psyche)\nI've never been caught for a run that I commited\nI've never seen a fat ass lick and didn't hit it\nAll the murders that they claimin' I ain't stressin' that shit\nCause if you got the evidence then come convict me bitch\n\n[Hook]\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\nWould you be my, could you be my\nWon't you be my (WE NEIGHBORS Y'ALL!)\nWould you be my, could you be my\nWon't you be my (I BRINGS THE DRAMA!)\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\n\n[Verse 2 - Monoxide]\nCars and stray dogs always fuckin' up my grass\nAnd everytime you see me comin' you know I'm about to ask\nWhere your 5 at? I'm buyin' weed in 10 sacks\nAnd fuck a bitch at Burger King just to get some free snacks\nStandin' on my porch in a robe\nI got some top tens with no shoe strings, I'm out cold\nAnd the gold, hope it ain't nothin' my eye catch\nI'm runnin' pockets like a campaign rep it's gettin' snatched\nDice game on the side of the crib\nI'm shootin' dollar in this motherfucker, who else in?\nAnd the cops got a problem with me, who knows why?\nProlly cause I got a couple tagged cars in my driveway\nI keep it ghetto like the whitest of trash\nSellin' food stamps for cash just to get up on the fat pad\nSo when you see me on your block watch your back\nCause Monoxide will lay a motherfucker out flat\n\n[Hook]\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\nWould you be my, could you be my\nWon't you be my (WE NEIGHBORS Y'ALL!)\nWould you be my, could you be my\nWon't you be my (I BRINGS THE DRAMA!)\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\n\n[Verse 3 - Paris]\nWho's that nigga slash Nasdaq sponsored ass?\nSoldier devils never love, fuckin' up your country club\nBailin' through the gates, raisin' hatred in they eyes why\nTry to calculate when niggas make it when I ride by\nThough you can't stand seein' any non-European\nHavin' things, what a shame niggas come, then you fleein'\nBut we won't, goodies too, take advantage, better school\nBigger plots, acre lots, pushin' Benz and sellin' stocks\nGuess who comin' to dinner in your area?\nKnow you hate to share it, I love it when I'm scarin' the\nBitches in my neighborhood, I'm brutal on your whole committee\nNever seemed to see how niggas comin' from the city pretty\nBut we rollin', foldin' the cash holdin', bitch I'm showin' out\nKeep my bidness out yo mouth\nClowin' all them racist holes, juggalos know a devil should\nRoughest on my cul de sac, there go the neighborhood\n\n[Hook]\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\nWould you be my, could you be my\nWon't you be my (WE NEIGHBORS Y'ALL!)\nWould you be my, could you be my\nWon't you be my (I BRINGS THE DRAMA!)\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\n\n[Anybody Killa]\nThat's right motherfucker! Psychopathic is your (GHETTO NEIGHBOR!)\nMy man Paris and all that gorilla funk is your (GHETTO NEIGHBOR!)\nMonox Boogie settin' it straight cause you know he my (GHETTO NEIGHBOR!)\nSo now that we neighbors throw up yo motherfuckin' hood! (GHETTO NEIGHBOR!)\n\n[Hook]\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)\nWould you be my, could you be my\nWon't you be my (WE NEIGHBORS Y'ALL!)\nWould you be my, could you be my\nWon't you be my (I BRINGS THE DRAMA!)\nWould you be my, could you be my\nWon't you be my (GHETTO NEIGHBOR!)", "year": "2003-04-08"}]}