{"songs": [{"image": "https://images.genius.com/3dfcdaab94652abd75c7788fce09ed7f.398x400x1.jpg", "year": null, "lyrics": "[Intro: Akrobatik]\nAight, now (Yeah, y’all).  All y'all, y'all gotta come up (Yeah, y’all) to the front now.  This... this open mic but it ain't no bullshit (Yeah, y’all).  Yo, y'all gotta come up to the front of the stage (Yeah, y'all).  Know’m saying?  Like... yup, you too, you (Yeah).  You in the skirt, it's good to, good to see (Yeah, y'all) honey in a skirt and so...  Come on.  Come up to the front (Yeah, y'all).  We're gonna do it like this (Yeah, y'all).  Akrobatik, aight?  Yo.  Check it.  Come on.  Uh.  Uh (What?).  Let me see some hands, y'all.  What's the deal?\n\n[Verse 1: Akrobatik]\nSpontaneous combustion.  Always keep my movements turbo-thrusting\nShowed up on the scene trailed by gale force winds gusting\nBusting through obstructions with percussion like a wrecking ball\nBrothers running game but, to be honest, I ain't checking y'all\nPsycho fans prepared to answer my every beck and call\nBut I don't abuse the privilege\nThis raw, underground, gritty MC lifestyle, I'm living it\nLast will and testament?  I ain't never giving it (Why?)\nWhy?  ‘Cause what I touch remains infinite\nCremate my material items, perpetuate your soul by sniffing it\nI’ll make a Rhodes scholar sound illiterate\nMy soul is old, rhymes dirty, born illegitimate\nMy shit received five mics before I submitted it\nIf it didn't, it's because the reviewer was inconsiderate\nProbably got his head up some R&B ass\nBut it don't matter though.  Ain't nobody scarring me last\nI drop the fat shit, everybody bounce to this Fakts shit\nWrote the classic rhyme and chose the fat beat to match it\nLightning-quick skill—Garciaparra couldn't catch it\nI hate it when MCs wear mascara and they ass switch\nI got the matches and my fingers on the gas switch\nNow, only Ak remains top draft pick\nCreate a female MC from my rib\nAnd start a new breed of rappers to freak the ad lib\nWord\n\n[Hook: Samples with Fakts One Scratches] (x2)\n\"Akrobatik always blowing the spot\" - Akrobatik on Mr. Lif ft. Akrobatik’s “Inhuman Capabilities”\n\n[Verse 2: Akrobatik]\nOn the mic, I shine like lightning bolts flashing\nRip it with a passion.  Foes I'm smashing\nAshing out the spliff and get right down to biz\nMCs all stuck—they failed the pop quiz\nHow you measure who the nigga reigning at the top is?\nPlatinum plaques or well-crafted business?\nWitnesses across the nation vouch for Ak\nWhile you digging in your couch for crack, I attack (What?)\nSmack raps out the park like Mark McGwire\nThe crowd needs igniting—let Ak spark the fire\nI be the raw supplier of the pure uncut.  Son, what?\nI'm stingy like busting one nut\nWe're funding missile launchers while ignoring the schools\nBut there's war in the schools, but we're led by the fools\nAnd that leads to ignorant rappers who smoke ooze\nAnd get ripped by Ak ‘cause they don't know the rules\nDrop jewels frequently at various frequencies\nRecently, MCs have been ignoring common decency\nBut now we gon' see how that go\nAnd when you see Ak, be prepared for the flow\n\n[Outro: Akrobatik]\nAight?  I’m on the mic shit.  This some real shit, yo.  It's Akrobatik, y'all.  Boston, Massachusetts.  Who's up next?  Who's up next?  Who want the mic next?  Where... where'd all the MCs go?  Where... yo.  No... nobody wanna touch this?  It's hot though.  Aight?  Hehehehe", "title": "The Flow", "album": "The EP"}], "artist": "Akrobatik"}