{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Beanie Sigel]\n(Yo) Who wanna fuck wit', the fat boy of the Roc?\n(blldddttt) stick em, ha, another victim\nMac pullin' capers again\nFuck with that money paper then\nLight as a rock, gonna light up the block\nDon't believe in cases, goin all out\nPaintin' faces, switch my picture, like tradin' places\nFor that money what?\nEverybody hands up, or hands down money tucked\nI flip the money trucks, money I don't give a fuck\nAy money, shut the fuck up\nIt's only a stickup\nYou don't stand a chance, give it quick up\nYou 'bout to turn into an ambulance pickup\nEnough with the cocky stuff, fuck all that stocky stuff\nDon't get smacked like a hockey puck\nI ain't wit' that rocky stuff\nI'm strapped got this gat (Blah blah blah blah)\nWhat?\n\n[Hook: Kurupt and Beanie 2x]\nGangsta gangsta, tell me how you do it\nIt seems so simple, like there was nothing to it\nOne more time run through it, everybody hands up\nAlright hands down money tucked\n\n[Beanie Sigel]\nI'm on fire like a molotov cocktail\nI'm high off them cocktails\nDangerous gone broke, my aim is no joke\nDuct taped, roped, strangle your folks\nBox cut across the throat (nope)\nBang the four 'till it's broke\nPrey on niggas in a circlular pattern\nCatch you playin' craps, car in reverse\nI'm circlin' back\nMan I stay up in them dice games, fuck a ice chain\nA Ice ring, I'm tryin' to come up on some nice change\nIn case a nigga might swing, they gets a might thang\nPull out the right thang, show em it's a spike thang\nMake you do the right thing, like a Spike Lee joint\nBang that pussy in his right knee joint\nYou get the sergeant and cap couldn't tell mack (freeze)\nI'm like a rat dodgin' traps when it come to the cheeze\nBackwards wrapped my trough\nWon't hesitate to clap ya folks\nI'm on tilt like a rapid (?)\n\n[Hook 2x]\n\n[Beanie Sigel]\nBack now nigga, all black down nigga\nMack now, loaded up wit' black towns nigga\nFrontline, clap down, background niggas\nOne nine clap crowns, and smack down niggas\nKeep rope to hogtie you pork ass niggas\nStuffin' the boot to shoot hoops you sports ass nigga\nWouldn't shoot a game of pool\n8-ball in the corner pocket, stop it\nYou niggas flippin' Guess jeans profit\nDisrespectin' the scale, expectin' to sell\nYou got seeds in ya weed, disrespectin' the L\nDon't got 20's on ya wheels disrespectin' the car\nYou burnin rubber and that squad, disrespectin the tar\nYou niggas wore ass backwards, vest and no gat\nSame thing with your hustle, rustled and packed\nThe ball back on missions\nDrop the east the mack more vicious\nBack to snatch or crack off dishes\n\n[Hook 2x]", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "Gangsta, Gangsta", "album": "The Reason"}]}