{"artist": "Papoose", "songs": [{"album": "The 1.5 Million Dollar Man", "title": "Brotherly Love", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Verse 1: Papoose]\nLook how we dress we fly just like Delta\nAll we need is food, clothing, and shelter\nStreetsweepers on the rise\nThe wait is over I arrive\nThe 1.5 million dollar man\nJust to think I started with one grand\nI know you got hundreds and millions god damn\nI'mma catch up just give me a time span\nHow it feel when you shake my hand\nFeel like money don't it, my man\nAnd I wanna thank most of my fans\nWithout y'all I wouldn't be who I am\nWho we are myself and my fam\nThe knockout kings me and Nasaam\nI know you tired of them same nine jams\nOn the radio all day, I am\nA relief like walkin' on hot sand\nThen steppin' in cold water, I can\nBecome a millionaire just for rhymin' on mics\nI'm about to have the time of my life\n\n[Hook: Isley Brothers]\nAre you ready for the time of your life?\nIt's time to stand up and fight\n(It's alright) It's alright (It's alright, it's alright)\nAre you ready for the time of your life?\nIt's time to stand up and fight\n(It's alright) It's alright (It's alright, it's alright)\n\n[Verse 2: Papoose]\nWalked in the store and copped me a cold bottle\nAll the kids love me they say I'm their role model\nThis pretty little girl she ran up on me fast\nShe said \"My name's Asia can I get your autograph?\"\nI praise the kids so when I signed the paper\nIt read \"Papoose in the name of Asia\"\nWouldn't be here if my mom's wasn't in labor\nSo let me walk you through the laws of nature\nI swam up a fallopian tube, hopin' it lead through well\nFertilized joined with an egg to form a single cell\nWith anxiety, divided, and redevided entirely\nChangin' to two trillion cells, all different varieties\nOff the stress of this chain of events, grown reliably\nTime prevented me but my destiny was society\nI just borned you, like she borned me\nNow the children of the world can see\n\n[Hook: Isley Brothers]\nNow the children of the world can see\nThere's a better way for us to be\nThe place where mankind was born\nIs so neglected and torn, torn apart...\n\n[Verse 3: Papoose]\nWe hold each other down like real brothers should\nKnowledge before wisdom we understood\nThey try to come between us, none of those suckers could\nCause you can't penetrate steel with lumber wood\nMoney over sex and honor before money\nDeath before dishonor, feed you if you hungry\nFam before friends, no outside trust\nHe might be your man but he ain't one of us\nIt be outsiders that put a family in a war\nTell him watch his head before they cut it off\nHe sellin' three grams and tellin' em' it's a ball\nThey comin' back for that point 5 they want it all\nWe was on the grind when the company was\nJust division, now I give the country a buzz\nMy blood brother not because he a thug\nYou my brother, brotherly love...\n\n[Hook: Isley Brothers]\nI'm your brother\nI'm your brother, don't you know?\nI'm your brother\nI'm your brother, don't you know?\n\nWe'll be living in a world of peace\nIn a day when everyone is free\nWe'll bring the young and the old\nWon't you let your love flow from your heart...", "year": null}]}