{"artist": "Pusha T", "songs": [{"album": "PT4*", "title": "Sociopath", "image": "https://images.genius.com/b735b6902e7dc5bd041ccde222620b5e.3000x3000x1.jpg", "lyrics": "[Refrain: Pusha T]\nMy bitch hot, like she D-ing up the spot\nMy bitch hot, like she D-ing up the spot (D-D-D-ing up)\nShe AP and really eat a nigga's watch (D-ing up the spot)\nMy bitch hot, like she D-ing up the spot\n\n[Verse 1: Pusha T & Kanye West]\nShe keep a lit 16, a network of typers\nFuck sellin' the pipers to get the baby the diapers\nCall the bitch Swiffer 'cause all she know is swipers\nFuck a rap nigga, but she don't need him to wife her\n(D-D-D-ing up the spot)\nBenz trucker, all your mans want to fuck her\nShe get a nigga cleaned up too, you need a buffer?\nTravel out to them islands in Thailand\nShe don't know if it's Lanvin or Lanvin\nAll she know, if it's my hands, it's pie hands\nAll she want is the monograms and my bands\nCharcuteries\n(Yo, what, what is charcuteries?)\n(Man, it's, it's when you go to your hotel room)\n(And they got the cheese and the fucking pepperoni)\n(Sliced on a little wood board, waiting on you)\nNew jewelries\nNew taste levels, shit, she be schooling me (Nigga)\n\n[Chorus: Pusha T]\nI got a bitch that'll master your card\nNice with the Visas, passports is art\nEvery page inked up, her and the bitches link up\nThey think they hear the drum and the machine when it syncs up\nHeads boppin', boop-bopty-boop-bop\nWho you think showed you that Chanel did the tube socks?\nBustin' down watches\nRental whips in the garages\nShe don't trick, but she charges\n\n[Verse 2: Pusha T & Kash Doll]\nLotta double Cs, double Gs (You know how I do it)\nNew body parts, they double Ds (You know how I do it)\nThe dual exhaust is double Vs (You know how I do it)\nYou niggas talk, she fuckin' me\nHer mother sayin' she should be a nurse hurts\nBut she just worry 'bout who got the purse first\nI tried to tell her, \"Go to real estate school\"\nShe say, \"Don't you see these fucking dealer plates, fool?\nYou know the rush it is to know bitches hate you\n'Cause they man is locked up but still laced you?\nAnd you know I need it twice, so it takes two\nFendi cross-body, fanny pack beige blue (Nigga)\n\n[Chorus: Pusha T]\nI got a bitch that'll master your card\nNice with the Visas, passports is art\nEvery page inked up, her and the bitches link up\nThey think they hear the drum and the machine when it syncs up\nHeads boppin', boop-bopty-boop-bop\nWho you think showed you that Chanel did the tube socks?\nBustin' down watches\nRental whips in the garages\nShe don't trick but she charges\n\n[Refrain: Pusha T]\nMy bitch hot, like she D-ing up the spot\nMy bitch hot, like she D-ing up the spot (D-D-D-ing up–)\nShe AP and really eat a nigga's watch (D-ing up the spot)\nMy bitch hot like she D-ing up the spot (D-D)", "year": "2019-08-26"}]}