{"artist": "Angel Haze", "songs": [{"title": "Heart", "image": "https://images.genius.com/94752f8107601b005d0ccd537b1f7727.500x500x1.jpg", "album": "Voice - EP", "lyrics": "[Poem: Angel Haze]\n\nSomehow the nights are always the longest\nI can’t look within myself without seeing you first\nI can’t open up my wounds without worsening hurt\nI can’t ever get the flowers if I don’t pull them from dirt\nI feel you in my sheets\nSee you in cracks as I get nearer to the door\nSometimes I walk alone, and I can hear you in the floor screaming, “Why’d you let me drown? Why’d you let me go?”\nAnd I, I never have the answers\nI hear your screams like tears falling from the mountains\nIn your eyes such a sharp, sharp pain\nI can hear and feel you die, hear you calling\nI hear you calling, but I can’t save you\nI can’t save you\nI can’t save you one more time\nI can’t look you in your eyes and tell you, “Things will be alright.”\nI can’t feed you any lines\nGet you hooked and reel you in, just to throw you back again and watch you drown\nAll over again\nAnd I’m mentally reclined in my mind\nPreviewing memories of the times when we almost had it\nWhen all it took was to grasp it\nWhen all it took was to grab it\nClench your fist so tightly around that bliss and be happy\nBut somehow the sands of time slipped through our fabric, and stained our existence with that of it’s own\nIt was running out on top of us\nSlowly running out on top of us\nAnd if you can hear me cry in this poem, disregard it\nBecause this is the part where my heart will harden\nWhat do you do with a heart you can’t feel?\nWho do you give it to?\nHow do you live with it?\nI’m guilt trippin’\nI’ve packed bags full of sadness\nRemorse, my anger won’t let me see past it\nMy bloodshot eyes are so tired, I can’t seem to see straight\nIt was not supposed to be this way\nIt cannot be this way\nI remember finding sun in your eyes\nThe stars in your smile\nI could walk for miles along the concrete just staring into them\nAnd now I play keyboards like pianos typing symphonies of misery\nInstrumenting our memories\nPraying that you’ll remember me\nPraying that you’ll remember me when my years run out\nWhen our cycle discontinues\nWhen your fears run out\nPraying that you’ll remember me when you move on\nPraying I’m still your weakness when you grow strong\nNever let your heart run out on you\nNever let your heart run out on you…", "year": null}]}