{"artist": "Z-Ro", "songs": [{"album": "Heroin", "title": "Blast Myself", "lyrics": "[Hook: Z-Ro]\nI wake up in the morning and I ask myself\nIs life worth living, should I blast myself?\nBefore I go to sleep at night, I ask myself\nIs life worth living, should I blast myself?\nLook at myself in the mirror and I ask myself\nIs life worth living, should I blast myself?\nI got problems but too much pride for me to ask for help\nSo is life worth living, should I blast myself?\n\n[Verse 1:]\nTell me where to go to get a piece of mind\nCause all I see is suicide receiving me by my tec9\nAlthough my tattoo reads 'no more pain'\nLately I feel the needle hit me up in vein\nMost of my real niggas are dead\nThey done left me with my fake friends\nThe ones that 'always need you\nBut don't appreciate' friends\nI'm solo when I roll\nI live in doubt by myself\nThat way nobody can blame me for the death of somebody else\nCause the way these niggas hate me is an epidemic\nI'm in the line of fire 24/7\nConstantly steppin' in it\nHate me cause I'm doing good\nHate me cause I ain't doing bad\nAt least I got to be a dad\nBut I got no seeds\nI used to bleed for some other cats crashin'\nBut as far as I'm concerned I would've burned for those creations\nMy family didn't make it\nMake me wonder will I last myself\nSo is life worth living, should I blast myself?\n\n[Hook:]\nI wake up in the morning and I ask myself\nIs life worth living, should I blast myself?\nBefore I go to sleep at night, I ask myself\nIs life worth living, should I blast myself?\nLook at myself in the mirror and I ask myself\nIs life worth living, should I blast myself?\nI got problems but too much pride for me to ask for help\nSo is life worth living, should I blast myself?\n\n[Verse 2: Z-Ro]\nIt ain't that I sound like 'pac\nI sound like stress\nJust like automatic when I'm down and depressed\nI shed tears cause I do it so good\nThanks to my nothin' ass homies off the block\nNigga fuck my hood\nI couldn't shit, shower, and shave\nUnless I was willing to pay\nThat's why I wasn't willing to stay\nI could do bad by myself\nI ain't even have no money for me\nAnd y'all was laughing like me suffering was funny to see\nSo wonder why I don't give a fuck about being here\nOn the other hand I murder motherfuckas\n'Do we have a problem here? '\nIf you beat me to the trigger\nI ain't mad homie\nLeast I ain't gotta cry no more\nNo more feeling sad homie\nY'all know trae got my back\nHe gon' look out for my people\nGod leave me not in temptation\nDeliver me from evil\nAnd if it's my time, I'm ready\nIf it ain't, I'm a ask myself\nMan, is life worth living should I blast myself?\n\n[Hook: Z-Ro]\nI wake up in the morning and I ask myself\nIs life worth living, should I blast myself?\nBefore I go to sleep at night, I ask myself\nIs life worth living, should I blast myself?\nLook at myself in the mirror and I ask myself\nIs life worth living, should I blast myself?\nI got problems but too much pride for me to ask for help\nSo is life worth living, should I blast myself?\n\n[Verse 3: Z-Ro]\nI ain't trying to be a role model, but I am\nWhat kind of role model get arrested for 300 grams?\nI struggle with my addiction, I ain't perfect\nRealize that it's bringing me closer to my grave\nSo maybe it's worth it\nThe more codeine I drink\nThe more I'm not awake\nI'm like a prisoner\nAnd syrup is the way I escape\nBut the message is to the kids\n'Do as I say, and not as I do\nCause there could be a brighter future for you'\nBut as for me; all I know is drama, all I know is pain\n27 and I don't know how to smile and that's a shame\nI came and I used 77, the first one\nBy age 10 or 11 fool blown smokin' blunts\nCause weed was what I needed to evade and escape\nBut reality went in and smacked me dead in my face\nNow that I'm gone, I got no more cheeks to turn\nSo I ask myself, man is life worth living should I blast myself?\n\n[Outro: Z-Ro]\nWent to the pitcher full of liquor\nTrying to ask for help\nSaid is life worth living should I blast myself?\nMovin' so fast I done broke around and cast myself\nMan is life worth living should I blast myself?\nI'm tired of bein' broke, where was I when the cash was there?\nMan is life worth living should I blast myself?\nI just can't take it, I ain't even gotta ask myself\nMaybe life ain't worth livin', I'm a blast myself", "year": null, "image": "https://images.genius.com/6c6f6b9a74e666243f96b121e467b3e8.640x640x1.jpg"}]}