{"artist": "ProfJam", "songs": [{"album": "Mixtakes", "title": "Lo-fi", "image": "https://images.genius.com/ac43427e0930880bed1cbdb2bb1736f9.600x600x1.jpg", "lyrics": "[Profjam]\nVejo tudo tão claro, ninguém me tira deste trilho\nTenho um bom faro\nBanha activa, rap livre venho soltar\nE o teu indicador 'pa mim esticado a apontar\nPorque é q perdes o teu tempo a julgar-me\nSe eu já vou no submarino amarelo a afundar-me?\nA bela no castelo e o monstro a mostrar-me\nComo eu sou feio sem ele no espelho se estudar\nQue cenas tão bonitas que eu vejo no dark\nDispo a minha máscara, o jeito e o sotaque\nFico bué panasca a beber leite e a chorar\nSe isto não der pasta o meu filho vai gozar-me\nPor isso fico triste e evito falar-me\nÉ q eu sou tão crítico que só vim pa calar-me\nImolo-me a mim próprio só pa que alarme\nAs próximas cópias do prof em desarme\nChupa trinca e morde com esses dentes de sabre\nSó ca minha morte é q a tua boca não se abre…\n\nPor isso diz o teu “rest in peace\" como se eu já não existisse\nPublica no mural que hoje ‘tás um pouco triste\nE dá o teu respeito como se eu pa longe partisse…\n‘pó morto há respeito imagina se aplicássemos\nA lógica que o vivo tinha o direito ao memo!\nTalvez o teu desenho passasse a ser tipo um Picasso\nE a história que vem de ser humano não tinha h pequeno!\nE se o tópico te choca, como faz uma galinha\nPor ser utópico e pode nunca vir a ser verdade\nEntão coloco o presente e o passado numa linha:\n- aquilo que vives hoje em dia nunca foi imaginado!\nMete a mente no ginásio pa levantares estas barras\nBom karma é nutrição, drogas é tipo a jarda\nAs costas tão na merda, ‘tou na posição do Atlas\nEnfermeira enferma, tive que lhe tirar a farda\nSolto fios de esperma com um bom bico dessa gata\nNunca lhe pedi nada, ela veio cá dar-ma\nEla sabe o Darma, ela muda de arma\nEla veio mudar-me a vida…", "year": "2016-04-01"}]}