{"artist": "The Game", "songs": [{"title": "Bullshit", "album": "Streets of Compton", "year": "2016-06-17", "image": "https://images.genius.com/013b16a8c7fb2bc65f6717453933b715.1000x1000x1.jpg", "lyrics": "[Intro: The Game]\nAy who got all these niggas walking around\nWith all this motherfuckin' air in they chest?\nOh, you pumpin' your motherfucking self up, huh?\n\n[Hook]\nYou know I'm with the bullshit, ay\nYou know I'm with the bullshit\nNiggas know I'm with the bullshit\nYou know I'm with the bullshit\n\n[Verse 1: The Game]\nPull up, park the Camaro like an arrow\nOnly fuck with Snoop, nigga fuck your cousin Harold\nPlus I got the barrel on tuck, nigga what\nFirst nigga jump up, first nigga fucked up\nI'm with the bullshit, Jimmy Butler in the Kutlas\nHop out, get yo ass beaten, no mustard\nHood full of killers, Cedar Block, no busters\nSay we gon' do it, but we ain't, don't trust us\nGet your ass robbed out here\nBy a nigga name Rob out here with no job out here\nWe with the bullshit, Burgundy sob out here\nGet smoked if ever say slob out here\nNigga this Piru, I'm advertising like a commercial\nHand me your hood pass, pat you down then murk you\nNigga we still mad Doughboy killed Virgil\nBlood this ain't no motherfuckin' movie\n\n[Hook]\nYou know I'm with the bullshit, ay\nYou know I'm with the bullshit\nNiggas know I'm with the bullshit\nYou know I'm with the bullshit\n\n[Verse: 2]\n40 days, 40 nights\nIf I ever lose a muthafuckin' fight\nYou in the pen', say good night\nGet your ass strangled with the motherfuckin' kite\nI am with the bullshit, save them motherfuckin' tears\nYou bunk down with the nigga that ain't had pussy in years\nHe with the bullshit, fuck you gon' go?\nNigga where the fuck you gon' go when he made you his hoe\nNow you switchin' in the pen\nThrough the glass talking to your mama, bitchin in the pen'\nOhh you snitchin' in the pen?\nYour lawyer stuck you on the pen', nigga just stick you in the pen' (ohh)\nMy nigga Reek doing 30\nAnd I got gun that he did murder with, it's still dirty\nAnd I heard from a little birdy, niggas wanna problems\nJump in my Impala, skrrt!\n\n[Hook]\nYou know I'm with the bullshit, ay\nYou know I'm with the bullshit\nNiggas know I'm with the bullshit\nYou know I'm with the bullshit"}]}