{"artist": "Ice-T", "songs": [{"title": "Peel Their Caps Back", "lyrics": "[Ice-T]\nCoolin in my crib, cold video dubbin\nFBI warning? Huh, don't mean nuttin\nThey call that shit a crime? Yo that shit's a joke\nHit record on my dope remote\nI heard my phone ringin, I wonder who could it be\nIt was the E, the V, yes the I-L E\nHe said, \"We got static - word, I just got out\nPunks tried to move at the club and we shot out\nBullets everywhere,\" Okay what's the prob?\n\"Ink got popped, he's dead as a doorknob.\"\nYou bullshittin! \"I ain't fuckin around\nThe posse's rollin tonight, nigga are you down?\"\nI grabbed my AK, my 16, and my baby Mac\nStrapped on my vest, and threw the 9 in the small of my back\nI said - Chill, don't let nobody move without me\nSay you know where they are?\nHe said, \"I know where they be\"\nLet's peel their caps back\nLet's peel their caps back\n\nTwelve o'clock midnight, posse was airtight\nTwenty-five cars, under the streetlights\nSome people talked, while others cried\nInk was a brother, who shouldn't have died\nThen the silence broke, Ice what's it gonna be?\n38 hard brothers stood and stared at me\nThere were only two words that I had to say\nP-A-Y, B-A-C-K\nThe car's loaded with a silence that could wake the dead\nPistols clipped as the chambers loaded full of lead\nEveryone in the crew knew what I said\nWould mean by morning, somebody else soon would be dead\nLet's peel their caps back\n\nThe cars at the corner like a long black snake\nNight prowlin' for a life to take\nYa see down in the ghetto it's an eye for an eye\nThat's the answer to the question why\nIn my throat, there's a lump, then I swallow it, I ain't no chump\nFace of Death, then I cocked my pump\nI'm a nigga on the trigger, madder than a pitbull\nJust layin for a reason to pull\nOn you, any duck motherfucker that gets in my way\nI'm insane, and my homeboy's death made me this way\nBut then we spot him, Evil E shot him\nDead in the face, made sure that he got him\nOthers ran, but no mercy to the posse's wrath\nAutomatic Uzi motherfuckin bloodbath\nLet's peel their caps back\nLet's peel their caps back\nLet's peel their caps back\n\nThen all of a sudden, a bullet came through my eye\nMy dome exploded and I felt my other brothers die\nI drank my blood as I fell like shit into the street\nMy corpse stunk like a burnt out rotten piece of meat\nTen brothers died in this stupid homicidal binge\nCause whenever someone dies, nobody wins\nBut this drama, you'll never hear a word of\nCause all the paper's gonna read is a gang murder\nGang murder", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10"}]}