{"songs": [{"album": "Special Effects", "image": "https://images.genius.com/c31738617ce4106278ded17b5712a82a.1000x1000x1.jpg", "year": "2015-01-28", "title": "Aw Yeah? (interVENTion)", "lyrics": "[Intro]\nDomine...Domine...Domine...Domine...\nQuestion for the the maker and it's aw yeah?\nThis the way it's supposed to be huh? Aight\n\n[Verse: Tech N9ne]\nSippin'\nOn a glass of red wine\nRight before bedtime thinkin'\nEverybody down here trippin'\nIf you up there upstairs, this is Nina tellin' you to listen\nThe vision I'm givin' everyday, life is dumpin' on us like a pigeon\nI get many enemies with this Forbes list\nBut I get rid of energy from piss poor pricks\nCan I get to heaven?\nAll I get is threatened every time I get more chips\nGotta grip four fifths for the sick forces\nI gotta fight all of the night with cops, Crips, Bloods with sore fists\nAnd them Nazis wanna hem Hadji, up it ain’t too many men godly\nHideous so many cities bust in, Ferguson to Libya, Benghazi\nHuman equality never been a level playin field man it been wobbly\nSo many circles of sin rob me, that’s why we go angel to grim Cosby’s\nYellin' this to my superior, the grading of love is inferior\nUpon this earth a lot of people jerked around\nAbout 300,000 to Syria, are you serious?\nI could never think of burying my children p-p-period\nNigeria\nI'mma yell while I'm walking through this Hell cause I'm furious\nZuse know what's up, he said you got to pack a toy\nBut why you gotta let the bodies drop in a coffee shop in Aussie? (Aussie, Oi Oi Oi)\nBut around here loving coco's the bomb\nMeanwhile so many people are taken out by the hands of Boko Haram\nAw yeah?!\nThey gotta suffer the penalty cause of our education\nNobody wanna say nothing, but I gotta call it abomination\nPissed off, thinking, \"what this cost?\"\nWhat these babies blood drippin' for?\nSo I say in Latin, listen Lord\nAudire domine (audire domine)\nAudire domine (audire domine)\nOnly way people are gonna be able to kill off a demon is\nPick up a gun and be ready to put it between him a nigga be screamin'\nAudire domine (audire domine)\nNo fear the only way\nEvery day flatten the beast\nAt least Anonymous is hacking for peace\nAnd yet we gotta bust cause we packing a piece\nChoke not another one of us for the snappin' police\nWho the hell a brother gonna trust when it's always dishonor?\nHate me like Obama\nAnd I ain't even got around to askin' you the question, God\nWhat about my, MAMAAAA!?!?"}], "artist": "Tech N9ne"}