{"songs": [{"title": "Iraq", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2009-04-16", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg", "lyrics": "[Hook]\nIraq in this bitch, Iraq [I turn the club to]\nIraq in this bitch/Iraq in this bitch\n[One call] Iraq in this bitch\nIraq in this bitch Iraq in this bitch\n[You better get down] Iraq in this bitch\nIraq in this bitch, Iraq [You better get down]\nIraq in this bitch//Iraq in this bitch\nIraq in this bitch\n\n[Verse 1: Big Sean]\nNow why why why/Would you compare me to you\nIf you think we're equal/Then bitch, you are remedial\nRemember who you're speaking to/Call it egotistical\nBut I am one of one, Yup and there is not a sequel, sequel\nSoon as I approach in/Please do not approach him\nOr you will need a little more than Ibuprofen (B.I.G.)\nPlease try and test us/One hand gesture\nWe'll fill they ass with lead like standardized testing, testing\nAnd you already know where I live\nHow could I make it out that bitch being a bitch\n(I know) I'mma drink glass after glass\n(I know) I tend to act for ass over ass\nBet a stack I'll make your bitch come over\nThere's diamonds on deck like a nigga playing poker\nI hear them niggas talkin' but bet all they do is look\nSee, to you I'm Mr. Big but to him, I'm Mr. Bush, Bitch. Look, bitch\n\n[Hook]\n\n[Verse 2: Dustly McFly]\nSuccess brings envy\nI gotta watch out for these jealous thugs\nSo I am working with these mags like editors\nI went from trapping to rapping to make a extra buck\nBut now I keep that shotty by me like a Elmer Fudd\nMcFly shitting, I know the haters smell us\nI make it hard to breathe they need oxygen inhalers\nI'm so froze I need a double sweater//I got two softball hoes\nAnd every time I run home, they give me double headers\nYou can't come to my city talking absurd\nAnd don't take it from me, just ask Young Berg\nSo if I snatch your bitch, you better get to walking\nYou think you cute? You probably look better in a coffin\nFlight leer ice gear, Phantom, I just must steer\nLittle nigga just build a buzz/You just had a light year\nAnd I am sick of all of this hating shit\nHad 'em dumping like a bad ass relationship\n\n[Hook]"}], "artist": "Big Sean"}