{"artist": "Watsky", "songs": [{"year": "2011-08-03", "lyrics": "[Verse 1]\n\nI know why they call them labels\nBecause you have to fit a label now to fit a label\nBut If I'm a pussy, then I guess I did my kegels\nI got it on lox, I'll bring the bagels\nIt kind of feels like middle school again when they call\nI think the majors can't decide if I'll come play ball\nIf I can make them money\nIf I can dumb my shit down enough\nOr do the dance\nI think it's kind of funny\nThey might be right, I'm shaped different like Toblerone\nI turned down a quarter mil to pitch a mobile phone\nCause I believed that I can be more and walked away\nAnd left my hand up in the air like I just shot the J\nWhite rappers make it quicker if we talk like stars\nHit the A-list\nCause you puffed on Ls\nAnd dropped your Rs\nLet's pull some video out of 5th grade pageant\nAnd compare the way you talked then to how you're rapping\nYou think you sound the same?\nOr that you picked up the way to be real in somewhere TV-Land along the way?\nIf I just get 15 minutes I'm gonna stay myself\nAnd when that 16th minute comes then I won't hate myself\nMaybe I'll never get signed\nI'll fucking flatline\nBut nobody gets to raise a banner during halftime\nWin or lose, I always choose myself and place a bid\nAnd make the same face on every play like Jason Kidd\n\n[Hook]\n\nIt's almost 4AM\nMonday in my room again\nGot a crazy vision of a dream escaping from my pen\nI'll be swinging going down\nFuck that noise, No way no how\nYou're listening to this song\nBut I'm working on the next one now\n\n[Verse 2]\n\nIf my goals are odd I take as a challenge\nPeople seem confused by how I hope to use my talents\nCould he be weird Al, could he be Jimmy Fallon?\nI tell them to imagine Mos Def meets Woody Allen\nHaters give me balance. Every Kyle's got a Cartman\nI know how failure tastes\nI drink it straight from the carton\nI always keep a gallon in the fridge at my apartment\nTo remind me how it feels to drop the ball like Stevie Bartman\nBelieve me I want to achieve it all by being me\nIt's too easy to be cheesy on TV or DVD\nI'm seeking to sneak in, but I'm weeping when I peep the scene\nCause I'm knee-deep in it and need a TP roll to keep it clean\nI'm digging for a deeper meaning cause beneath this skin is a beating the temperamental heaving heart of gentle heathen\nIf you deceive us, homie that's so sad\nI'll get more agro than the Aggro Crag\nI'm Boney Boney leave me aloney you know me well\nDon't dwell on that Jabroni just cause that baloney sells\nHis flow is hole-y like the edge of abalone shells\nI want to flow holy like matrimony bells", "image": "https://images.genius.com/c29f84b2362a2e43218c9c9f8eb13126.500x500x1.jpg", "album": "A New Kind of Sexy", "title": "4AM Monday"}]}