{"songs": [{"image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "title": "5 O’Clock (LP version)", "album": null, "year": null, "lyrics": "It's really real, when I feel the way that I do right now\nI see all my brothers underground\nPushing up daisies, man, it amazes me\nThat you can't see where you gonna be\nA statistic, everybody's gon' call ballistic\nIf you had a good day, damn, I must have missed it\nCause you mad at the Universe\nGoing to hell with everybody else cause you want your own first\nI got the urge to let you in on a little secret\nCause you keep dying if I keep it\nAll the keeling that you're feeling is from within\nFor the copper check the color of your skin\nWhy lie? I couldn't try even if I had to\nBorn with the bullet-proof vest when I had you\nA black woman trying to get through to the few\nSo you can leave the next crew\n\n5 o'clock in the morning. Where you gonna be?\n(Outside on the corner)\nYou better get yourself together\nWhile you're wasting all your time\nRight along with your mind\n\n5 o'clock in the morning. Where you gonna be?\n(Outside on the corner)\nYou better get yourself together\nWhile you're wasting all your time\nRight along with your mind\n\nWhy should I do right and suffer\nI rather do wrong making that loopy and that hustler\nInstead of hot-dogs I'm eating porks up in their smother\nAnd got a gang of loot up in the safe up in my covers\nOn top of all that I push big fat Lex\nAnd got my hoes that in golf course just in case I feel like flexing\nSo I must ask, for real though, who are you\nSee, I'm a big man\n\nYeah, you know you'se a big man, check it\nI went for twelve years to school and never could read\nA knowledge of my hood is something they can never teach me\nI never started to step but I kept up with the Joneses\nHaving rollers... my little pinky ???\nI did a lot of kinky thing the girls knew it, flock into it\nI'm around my old way, yeah, they still wants to do it\nIts not about the clothes that you got on your back\nBut the money in your pocket and if you're down like that\nCome on\n\n5 o'clock in the morning. Where you gonna be?\n(Outside on the corner)\nYou better get yourself together\nWhile you're wasting all your time\nRight along with your mind\n\n5 o'clock in the morning. Where you gonna be?\n(Outside on the corner)\nYou better get yourself together\nWhile you're wasting all your time\nRight along with your mind\n\nWella, Mr. Black Man tell me where you're heading\nThe last few years I watched while you were sheading\nPounds and pounds on growth for the population\nSoon we won't be able to have a strong black nation\nA shooting here, a stabbing there nowhere to stop\nCause now you're dying from the dose of the crack rock\nI'm just a Nubian Queen that needs a king to stand strong\nAnd try to press on\nIt's not a white man's finger on the trigger\nCar-jacks, drive-by's, callin' each other \"nigga\"\nI'm not here to scold but rather shape n' mold\nThat young black mind that won't live to grow old\nCause you're fronting smoking on the blunt and\nDown with your friends cause you think you're making ends\nBut you're not - and that's the truth of the matter\nYour brother gettin' skinny, cause you want your pockets fatter\n\n5 o'clock in the morning. Where you gonna be?\n(Outside on the corner)\nYou better get yourself together\nWhile you're wasting all your time\nRight along with your mind\n\n5 o'clock in the morning. Where you gonna be?\n(Outside on the corner)\nYou better get yourself together\nWhile you're wasting all your time\nRight along with your mind"}], "artist": "Nonchalant"}