{"songs": [{"lyrics": "[Intro]\nYou ain't got enough stamps in ya passport\nTo fuck with Young H-O (heheheh)\nInternational, uhh\nShow young boys how to do this thing\nThe maturation of Jay-Zeezy, heh\nCheck me out\n\n[Verse 1]\n30's the new 20 nigga I'm so hot still (uhh)\nBetter broad, better automobile (uhh)\nBet a yard (naw!) bet a hundred mil\nThat by the song's end I'll probably start another trend\nI know everything you wan' do\nI did all that by the age of 21\nBy 22, I had that brand new Ac' coupe\nI guess you could say that my legend just begun\nI'm, young enough to know the right car to buy\nYet grown enough not to put rims on it\nI got that six-deuce with curtains so you can't see me\nAnd I didn't even have to put tints on it\nI don't got the bright watch, I got the right watch\nI don't buy out the bar, I bought the nightspot\nI got the right stock\nI, got, stockbrokers that's movin' it like white tops\nI know you're like \"Fuck! This is child abuse, call DYFS!\"\nI must just be getting nicer\nYou young boys ain't ready for real\n30's the new 20 nigga, I'm so hot still\n\n[Hook]\nI used to let my pants sag, not givin' a fuck\nBaby boy, now I'm all grown up\nI used to cruise the used car lot, put chrome on the truck\nBaby boy, now I'm all grown up\nI used to play the block like that (like that)\nI used to carry knots like that (like that)\nNow I got black cards, good credit and such\nBaby boy cause I'm all grown up, taha!\n\n[Verse 2]\n30's the new 20 nigga, I'm on fire still\nThese young boys is like fire drills (uhh)\nFalse alarms (uhh) the next don (naw)\nHe ain't got it (uhh) on to the next one (Young)\nI'm still here (yeah) still here like Mike\nGotta stop playin' with these children (chea)\nI'm a bully with the bucks (boots)\nDon't let the patent leather shoes fool you youngin'\nI got the fully in the tux\nThat was my past, now I'm so grown up\nI don't got one gun on me\nGotta a sum on me to hire a gun army, get ya spun like laundry\nAnd I'll be somewhere under palm trees, calmly listenin' to R&B\nWhen we get the call he's, no longer with us, fire ya babysitters\nYou little fucks fall back for real\n30's the new 20 nigga, I'm so hot still\n\n[Hook]\nI used to let my pants sag, not givin' a fuck\nBaby boy, now I'm all grown up\nI used to cruise the used car lot, put chrome on the truck\nBaby boy, now I'm all grown up\nI used to wear my hoodie like that (like that)\nFive deep in a hooptie like that (like that)\nNow I got black cards, good credit and such\nBaby boy cause I'm all grown up, heheheh\n\n[Verse 3]\nY'all roll blunts, I smoke Cubans all day\nY'all youngins chase, I'm Patronin' it straight\nI like South Beach but I'm in St. Tropez\nY'all drink Dom but not Rosé (hey)\nYa chick shop at the mall\nMy chick burnin' down Bergdorf's\nComin' back with Birkin bags\nYa chick is like, \"What type of purse is that?\"\nI'm from the era where niggas don't snitch\nYou from the era where snitchin' is the shit\nI'm afraid of the future (why?)\nY'all respect the one who got shot, I respect the shooter\nY'all go to parties to ice grill\nI go to parties to party with nice girls\nYoung boys gotta chill\n30's the new 20 nigga, I'm so hot still\n\n[Hook]\nI used to let my pants sag, not givin' a fuck\nBaby boy, now I'm all grown up\nI used to cruise the used car lot, put chrome on the truck\nBaby boy, now I'm all grown up\nYa, we used to ball like that (like that)\nNow we own the ball team, holla back (holla back)\nNow I got black cards, good credit and such\nBaby boy cause I'm all grown up, taha!", "title": "30 Something", "image": "https://images.genius.com/4371d45b1c52d7dc87e4204ae0aa8373.900x900x1.jpg", "year": "2006-11-21", "album": "Kingdom Come"}], "artist": "JAY-Z"}