{"artist": "Plies", "songs": [{"album": null, "title": "Dayum!", "image": "https://images.genius.com/142f4d6c2e6ce44c7607f441746bff25.1000x1000x1.jpg", "lyrics": "[Verse]\nI'm the mothafucking nigga in your city, nigga, in and out\nTell that ho to leave me lone, nigga only fuck with dimes\nGot these niggas threatening hoes, make them take my post down\nSince you being petty, pussy nigga, I'ma fuck her now\nTell when niggas money getting funny, let their bitches go\nLong story short, stay in your lane, you can't afford hoes\nI'm in the club smoking dope, I'm in the back, I'm all bezel'd up\nText the ho and tol' her, \"I'm on my way\", I'm finna wet her up\nToo many niggas biting now, had to switch up on the jeweler\nPussy bought the same watch, had to switch up on Muller\nRiding in that seven deuce, big brother was in the Buick\nYour ass in trouble, ain't it? Swear to God he'll give me shooters\nRiding to that hot water, a mothafucking hot boy\nLil nigga in a big body, bitch this look like Shaq's car\nTear drops in your face and you ain't killed, now what the tax for?\nBlew a M in one day, that's what you call a sack, boy\nMight do me a free show, send the money straight to Meech\nNo ain't never met the nigga, I just like to keep it G\nY'all niggas be balling, ain't it? [?]\nBalling like a mothafucka but you ain't signed to dog shit\nAh!\nThat's a mothafucking nigga for ya\nI'ma keep fucking these bitches, taking pictures for ya\nFirst day you come home, I'm buying a chicken for ya\nAin't talking Popeye's, I'm talking 36 on ya\nThe only nigga made 20 M\nAnd I ain't never did a summer jam\nNo disrespect to New York City, bitch\nBut I blew without a summer jam\nNever seen a nigga try to slam me and slam his damn self\nWith a 100 grand in my pocket, nigga, I beat your lil ass half to death\nChoppa game serious, nigga, hands on Mayweather level\nBig brother always told me you can't show love to these pussy niggas\nIf you ever, ever, ever, ever, ever try me\nSwear to God I'll stack a Bible, pussy better kill me\nBy the time security got to me, he was already asleep\nI done got back on stage, nigga, started doing me\nHeard they sneak dissing now, I got the Gram on fleek\nGoogle your net worth, pussy nigga, tell me what you see\nI bet a M to your 10 stacks, it ain't more to me\nYou ain't really eating, nigga, you need a grand more than me\nDayum!\nY'all pussy got me out here, boy\nI'm riding home when I'm out here, boy\nTwo things in this world that I ain't seen\nAnd that's a UFO, nigga, and a bitch that I need\nThese niggas want me to take a L so bad but\nHow I look at it, shit, it can't even help\nNigga ask me the other day \"damn, why they so mad?\"\nI told him \"I don't know, dawg, hope they tryna get fed\"\nDayum!\nI'm celebrating, popping bottles, ho\nIf you ain't tryna fuck, don't want you in my section, ho\nSay she think that she pregnant bih\n(What you told her?)\nI told her ain't no pregnant bitch\nAin't no Hollywood ass nigga, I'ma project ass nigga\nAbout 10 years ago I was a 100 gram nigga\nI got that base steady flipping\nLike Toucan Sam, nigga\nI heard niggas talking shit, I mean a grand slam, nigga\nReal recognize real\nAnd y'all niggas don't look familiar\nShe say her pussy always good, bih\nLike a Sweet Pussy Saturday, nigga\nThey shoulda killed me when I was a puppy\nNow I'mma full grown dog\nI buy all brand new, I leave my old shit in the mall\nShe say she ain't fucking none, I told her \"bitch, don't even call\"\nBitch, I paint my own self, bitch, I'm my own boss\nYeaaah!\nIf the pussy good, talk to me\nIf you a pussy, you can't walk with me\nGot some money, nigga, shop with me\nMy day one's on top with me\nIt's one in the morning\nMy old bitch calling\nShe tell me what I'm doing\nI text her back, bitch, balling!\nIn front the club with the top off\nI'm just tryna get my rocks off\nFeelin' lucky if you want it, nigga\nAnd get your pussy ass knocked out\nI'm just walking around this mothafucka looking like a ki\nY'all hating ass niggas looking like an oz\nI done played the offence, nigga, y'all played the D\nGet the guns re done, I'm throwing blue hundreds in the sea\nDayum!", "year": null}]}