{"artist": "C-Rayz Walz", "songs": [{"title": "Everything", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Hook One: C-Rayz Walz] (x2)\nI told y’all I can’t be stopped\nMy rhymes do more than circle the block\nI balance the scales.  You better duck when the speakers pop\nFor those who love Biggie and Pac—hip hop!\n\n[Verse 1: C-Rayz Walz]\nYo, cash rules everything ‘cept these poison themes\nCaught between Cannibal Ox and Soylent Green\n‘Til I’m Back to the Future with Biff, getting a facelift\nFrom Mrs. McFly, turning my whip to a spaceship\nI’mma stand over y’all ‘til I’m understood\nSo smooth, Krushing your Groove like Blair Underwood\nIn the heat of the night with a candle and chalice\nSmoking the Rafiki wearing Indian fabrics\nSinister sleepy.  Compete me indiscreetly\nI put sixteen shots in your dashiki\nSnatch ya Africa beads plus ya colon\nWriting fat rhyme—lines leave your notebook swollen\nI’m holding my nuts, dictating my seminar\nSimile-shoot razor blade shards, leave your lips scarred, mouth ajar\nNow before I come off, you need inspection\nIndeed, the section’s adding your face to my survivor collection\nYou ain’t hot ‘cause you got a yacht\nMan, you got kids but you ain’t no pops (Stop, stop)\nYou probably snow but you can’t rock\n“With that freestyle, you’re bound to get shot” - Notorious B.I.G. on Craig Mack's \"Flava in Ya Ear (Remix)\"\n\n[Hook Two: C-Rayz Walz] (x2)\nHate crime.  Anxiety\nWaste time or flame the fire in me\nWhatever you learn, there’s cheddar to earn\nIn the streets, this heat is better to burn (Whoo!)\n\n[Verse 2: C-Rayz Walz]\nWhen I was short on sums, I want none of your funds\nWhen I was young, I was numb, running with guns\nAnd I only went to class for the ass and the fun\n“The school dropout.  Never liked the shit from day one” - Nas's \"Represent\"\nSome still backpacking a MAC, tracking a gat\nClapping rap cats slacking in facts, stacking\nAnd cats saggy with wack khakis like in the Black Dragon\nStabbing a cabin, bragging in Japanese patterns\nWild card cats in the same outfit follow suit\nDo the Hollywood Shuffle, guzzle hollow truth\nNow the time’s right to shine light on Apollo’s youth\nStrange fruit, juice, and trees—saw tomorrow’s loot\nThrough the era where those who touched the mic were very dope\nKids got shot were it very cold on a ferry boat\nTalking like we carry coke—“Don’t worry, loc”\nYour burial close—next to your notebook.  Woah!\nSo keep keeping it up ‘cause if you sleep\nYou ain’t sleeping enough ‘til you six feet deep in the dust\nI roll with sick minds, sniff lines, click .9s, switch rhymes\nBefore I bang on your team like I’m 6’9”\n\n[Hook One: C-Rayz Walz]\nI told y’all I can’t be stopped\nMy rhymes do more than circle the block\nI balance the scales.  You better duck when the speakers pop\nFor those who love Biggie and Pac—hip hop!\n\n[Hook Two: C-Rayz Walz]\nHate crime, anxiety\nWaste time or flame the fire in me\nWhatever you learn, there’s cheddar to earn\nIn the streets, this heat is better to burn (Whoo!)\n\n[Outro: Bridge and Samples with Scratches]\n[Bridge]\nEverything I wanted was all I need\nLove in me ‘long as I’m loving the streets\n[Samples with Scratches]\n“You know the rules” - KRS-One on Boogie Down Productions' \"Ya Know the Rules\"\n“What’s all for life?” - [?]"}]}