{"artist": "Benzino", "songs": [{"lyrics": "(hook)\nShe said she want to get to know me\nEven though she smashed the homie\nI'm just saying what they told me\nI try to tell her keep it lowkey\n\nShe want to do it like some animals\nI said I'm with it 'cuz for real girl I'm an animal\nIf we did that it be more that you can handle though\nI'm off that kush\nI'm off that liquor\nI'm a animal\nUh, hold it! This beat is the shit\nI'm at the bank still holding my dick\nYeah! Hold this smack while I empty the clip\nYeah Hand me straight while I emplee the fifth\nThat's when I got on my animal shit\nStill a savage for this paper I'm handling shit\nAbout my business catch you later I'm better than this\nI'm on your tv screen but still I will shatter this bitch\n\n(hook)\nShe said she want to get to know me\nEven though she smashed the homie\nI'm just saying what they told me\nI try to tell her keep it lowkey\n\nShe want to do it like some animals\nI said I'm with it cuz for real girl I'm an animal\nIf we did that it be more that you can handle though\nPop that kush\nI'm off that liquor\nI'm a animal\nAt night she creep in my bed and she yawnin\nAnd then she creep out at 6 in the morning\nSkurr! She always riding in something that's foreign\nSaid I excited her nigga's so boring\nAnd she be loving that animal dick\nSilence of the Lambs straight Hannibal shit\nSpecially when its dark and the candles are lit\nNo Love and Hip-Hop this is some animal shit\n\n(hook)\nShe said she want to get to know me\nEven though she smashed the homie\nI'm just saying what they told me\nI try to tell her keep it lowkey\n\nShe want to do it like some animals\nI said I'm with it cuz for real I'm an animal\nIf we did that it be more that you can handle though\nI'm off that kush\nI'm off liquor\nI'm a animal\n\nYeah, see that brand new drop mazzy\nSee that new louis luggage;I copped it. (WOoh)\nSecretaries get beat in my office\nNo, it's not enough so I turn down them offers\nFuck them niggas 'cuz I get on my animal shit\nI come through with a hundred killers go ham in this bitch\nLeave you no choice motherfuckers gone have to submit\nWe tore it down and you said, \"Look what them animals did.\"\n\n(hook)\nShe said she want to get to know me\nEven though she smashed the homie\nI'm just saying what they told me\nI try to tell her keep it lowkey x2", "image": "https://s3.amazonaws.com/rapgenius/91e679c8210dab2c79d0611be49e28ef.jpg", "year": null, "title": "Smashed Da Homie", "album": null}]}