{"artist": "The Game", "songs": [{"title": "Brake  Lights", "album": "Brake Lights", "year": "2010-08-03", "image": "https://images.genius.com/6e47923e84d22040bd228aa550a666d4.800x800x1.png", "lyrics": "[Intro: Busta Rhymes]\nMy nigga Game\nI remember when I first met the nigga!\nNigga hella-flamed up, flagging and all that\nNigga told me he come through Cedar Block\nOut there in Compton and shit\nI said if this was one of my niggas from New York this nigga be my nigga\nEven though he from the West Coast, he still my fuckin' nigga\nCrazy shit though is even though it seem like the homie be strugglin' between good and bad\nAt the end of the day, it always come from a genuine place\nLove that nigga\n\n[Verse 1: The Game]\nI wake up in the morning to Ciroc and some pancakes\nGive a fuck about a bar, bitch, this a mixtape!\nGive a fuck about a car, bitch, this a Rover!\nYou drivin' a mistake like me dissin' Hova\nBut I don’t give a fuck, nigga, do it all again\nRule number one, never make a rap nigga friend\nBut I run up on a muthafuckin' rap nigga Benz\nIn Miami feeling like Khaled, “All I do is win\"\nEighty thousand on the bracelet, watch got a face lift\nDrivin' through the hood in this muthafuckin' spaceship\nFeelin' like the first man on the moon\nDraped in all black, whole club full of goons\nPumpin' bottles 'til them pretty hoes move\nTonight I’m fuckin' with bitches with scars and bullet wounds\nLive in that Ferrari, sleep in it like a tomb\nSoo Woo straight up out my mama womb, nigga\n\n[Chorus: The Game]\nI'm in all red like my brake lights\nIn the kitchen on the stove\nTryna get my cake right\nI work late nights, graveyard shift\nNigga gotta keep it trill\nI’m blessed like the angel on Rolls Phantom grill\nDon’t make me hit my brake lights\nIt’s a cold world, but it don’t taste right\nGotta get it baked right\nEyes in the rear view\nSo I can see clear through the haters\n\n[Verse 2: The Game]\nFrom the cradle to the grave nigga, do it hard body\nBut I never fuck with a bitch with a hard body\nSoft as a peach, life is a beach\nAnd I’m in Venice laid on the beach, white sheets\nWith a dime-piece starin' at my timepiece, what it say?\nBy six o'clock we be chillin' at the Mandalay, nice\nChandon on the ice\nSwimmin' in this fuckin' money, buy a hatin' nigga life\nAsk about mine, nigga, I reply twice\nBitches run around my house, three blind mice\nGet lost in this muthafucka\nBut I never get crossed in this muthafucka\nRottweilers at the door!\nDobermans by the pool, Dimes by the furnace\nLive life like Capone cause a muthafucka earned it\nPaper planes with them hunnid dolla bills\nSpent a couple mill but still, nigga\n\n[Chorus: The Game]\nI'm in all red like my brake lights\nIn the kitchen on the stove\nTryna get my cake right\nI work late nights, graveyard shift\nNigga gotta keep it trill\nI'm blessed like the angel on Rolls Phantom grill\nDon’t make me hit my brake lights\nIt’s a cold world, but it don’t taste right\nGotta get it baked right\nEyes in the rear view\nSo I can see clear through the haters\n\n[Verse 3: The Game]\nOne love to my niggas, two claps for my hoes\nBuy a dime piece some clothes, well nigga, I suppose\nI can get her Jimmy Choos, don’t mean that I'ma do it\nWent light skinned 'cause my first baby mama blew it\nNow I’m stuntin’ on dem hoes, what happened to the Buick?\nNigga turned rap star, God bless music\nNow a nigga gettin’ head whenever I choose it\nBlues Brother’s jewels covered in that new Goose n’\nGrew up on that Snoop shit, Gin got me woozy\nGot me feelin' sorry for my nigga Lil' Boosie\nTurn up the fuckin’ radio, bang a lil' Gucci\nGet high as a hummingbird, and touch a little coochie\nYeah, I’m a made man, bitch what you thought?\nIf I want an Aston, that fuckin’ bitch bought\nTell my nigga AR, 'Go open up the vault'\nAnd fuck what it costs, money talk, nigga\n\n[Chorus: The Game]\nI'm in all red like my brake lights\nIn the kitchen on the stove\nTryna get my cake right\nI work late nights, graveyard shift\nNigga gotta keep it trill\nI'm blessed like the angel on Rolls Phantom grill\nDon’t make me hit my brake lights\nIt’s a cold world, but it don’t taste right\nGotta get it baked right\nEyes in the rear view\nSo I could see clear through the haters\nI paint the whole town, same color as my brake lights"}]}