{"songs": [{"album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "title": "Forbidden Fruit", "image": "https://images.genius.com/bb7d8464fb9d79d3ef87ecd4ad3ede1b.300x300x1.jpg", "lyrics": "[Produced by J. Cole]\n\n[Chorus: J. Cole & Kendrick Lamar]\nMe and my bitch, took a little trip\nDown to the garden, took a little dip (Oh no)\nApple juice falling from her lips took a little sip, lil' sip\nTook a lil' sip, took a lil' sip\nT-T-Took a lil', took a lil', took a lil' sip\n\n[Verse 1: J. Cole]\nAyo, I walk through the valley of the shadow of death\nWhere niggas hold tech's like they mad at the ref\nThat's why I keep a cross on my chest, either that or a vest\nDo you believe that Eve had Adam in check\nAnd if so, you gotta expect\nTo sip juice from the forbidden fruit and get loose\nCole is the king, most definite\nMy little black book thicker than the Old Testament\nNiggas pay for head but the pussy sold separate\nSame bitch giving brains to the minister\nThe same reason they call Mr. Cee the finisher\nForbidden fruit, watch for the Adam's apple\nSlick with words don't hate me, son\nWhat you eat don't make me shit and who you fuck don't make me cum\nPut a price on my head won't make me run\nTry to kill me but it can't be done\n'Cause my words gon' live forever\nYou put two and two together Cole here forever\n\n[Chorus: Kendrick Lamar]\nMe and my bitch, took a little trip\nDown to the garden, took a little dip (Oh no)\nApple juice falling from her lips took a little sip, little sip\n\n[Post-Chorus: Kendrick Lamar & J. Cole]\nBitches come and go (You know that)\nMoney come and go (You know that)\nLove come and go (Don't shit last)\nBitches come and go (You know that)\nMoney come and go (You know that)\nLove come and go (Don't shit last)\n\n[Verse 2: J. Cole]\nTake a seat baby girl you've been all in my mind\nI know I ain't called gotta pardon my grind\nJust copped a maroon 5, no Adam Levine\n'Came a man by myself, only father was time\nI know that she relate baby daddy ain't shit\nSo she raised that nigga kids but she swallowing mine\nAnd that's why you all on my mind\nAll on my line like caller number nine\n'Cause a nigga poppin' like Harlem in the nine-seven\nWay before Mase was a reverend\nI was a young nigga making A's at 11\nOr 12, trying to get a taste of the Heaven\nOr Hell, only time gon' tell\nFuck her while her mama home, \"baby, don't yell\"\nHow many records do a nigga gotta sell\nJust to get the cover of the XXL\nOr Fader, fuck your magazine hater\nWhen I say that I'm the greatest I ain't talking about later\nI'ma drop the album same day as Kanye\nJust to show the Boyz the man now like Wanyá\nAnd I don't mean no disrespect, I praise legends\nBut this what's next, the boy sick, can't disinfect\nLife's a bitch and her pussy's wet\nMy clip is loaded and this is the kiss of... death\nBlaow\n\n[Chorus: Kendrick Lamar]\nMe and my bitch, took a little trip\nDown to the garden, took a little dip (Oh no)\nApple juice falling from her lips took a little sip, little sip\n\n[Post-Chorus: Kendrick Lamar & J. Cole]\nBitches come and go (You know that)\nMoney come and go (You know that)\nLove come and go (Don't shit last)\nBitches come and go (You know that)\nMoney come and go (You know that)\nLove come and go (Don't shit last)\n\n[Outro: J. Cole]\nDon't shit last, don't shit last and you know that\nWent to hell, got hot didn't melt\nThe only man above me is God himself\nAll these other niggas is below me\nWord to Phife, Q-Tip, Ali, and Jarobi\nWhat up Queens\nCole is the King and you know that\nStarted with a dollar and a dream, and you know that\nNever give a bird bitch a ring, you should know that\nBitch, bitch\nThat should be my new ad lib\nI got a new one. I finally got a cool ad lib\nBe at all the shows everybody be like, bitch\nBitch, bitch\nOr you can do the low cool shit, bitch\n\n[Outro Skit: Lil Cole]\nYo, yo, yo pull over right here, right here, here you go\nYeah pull over right here, to the right\nPull over, pull over, pull over, pull over\nIght, look look, park right here\nI'ma be out it'll be like thirty minutes tops\nIt'll be like thirty minutes, I'll be right back out, ight\nBitches come and go, bitches come and\nYo, yo what up, what's popping, I'm back, I'm back\nYo you got that piece ready for me, that Jesus piece\nNah the gold, the rose gold joint, yeah, yeah, yeah, yeah\nYeah let me see that, oh shit what is that some\nWhat's, what the fuck is that platinum\nIs that? What's that chain right there\nIs that-ss-ss white gold, that's platinum\nIs that plat, well niggas doing platinum again, niggas doing, niggas ain't even platinum yet right, oh shit bout to make\nYo I'm trying to bring that shit back, kill these niggas\nLet me see that one too, the wat, the watch, the platinum watch"}], "artist": "J. Cole"}