{"artist": "Cam’ron", "songs": [{"title": "Hey Ma", "album": "Come Home with Me", "year": "2002-08-06", "image": "https://images.genius.com/c85b516a9f0261e29ea6a014ed24f40c.600x600x1.png", "lyrics": "[Chorus: Freekey Zekey (Toya)]\nHey ma (wassup)\nLet's slide (all right)\nAll right - and we gon get it on tonight\nYou smoke? (I smoke)\nI drink (me too)\nWell good - cause we gon' get high tonight\nGot drops (got coupes) got trucks (got jeeps)\nAll right - cause we gon' take a ride tonight\nSo ma (wassup)\nLet's slide (all right)\nAll right - and we gon' get it on tonight\n\n[Verse 1: Juelz Santana]\nYo, now I was downtown clubbing, ladies night\nSeen shorty, she was crazy right\nAnd I approach baby like: \"Ma, what's your age and type?\"\nShe looked at me and said, you's a baby, right\nI told her, \"I'm 18 and live a crazy life\nPlus I'll tell you what the 80's like\nAnd I know what the ladies like\nNeed a man that's polite, listens and takes advice\nI could be all three, plus I can lay the pipe\nCome with me, come stay the night\"\nShe looked at me laughing; like \"boy, your game is tight\"\nI'm laughing back like, sure you're right, get in the car\nAnd don't touch nothing, sit in the car\nLet's discuss something, either we lovin' or I'll see you tomorrow\nNow we speeding up the West Side\nHand creepin up her left side, I'm ready to do it\nReady to bone, ready for dome\n55th exit, damn, damn, already we home\nNow let's get it on\n\n[Chorus: Freekey Zekey (Toya)]\nHey ma (wassup)\nLet's slide (all right)\nAll right - and we gon get it on tonight\nYou smoke? (I smoke)\nI drink (me too)\nWell good - cause we gon' get high tonight\nGot drops (got coupes) got trucks (got jeeps)\nAll right - cause we gon' take a ride tonight\nSo ma (wassup)\nLet's slide (all right)\nAll right - and we gon' get it on tonight\n\n[Verse 2: Cam'ron & Juelz Santana]\nYo.. uhh\nNow that I got a girl, my ex wanna holla and spit\nTold me to acknowledge her quick\nShe like \"Cam, stop fronting on that Dave Hollister tip\nCome over let's swallow and sip.\"\nI'm like: \"momma is sick\nI promise you dick, usually have a problem with chicks (why?)\nThey all say I'm rotten and rich\"\nBut not her, boobies' real, high heel doobie feel\nPlus got them Gucci nails, huh\nYou a cutie still (still)\nAnd this my down girl too - ain't no groupie deal\nWe left the movies with Uzis, Suzuki wheels\nTo the jacuzzi, I tell you, my boo be's real\nI mean she do be winning, Louie spinning\nGo to the crib, she got the Gucci linen\nI see boo be grinning\nShe looked and said: \"Cam, I know that you be sinning\"\n\"Naw! I'm a changed man, look at the Range, ma'am\n(Look) I got a whole new game plan\"\nLooked and said: \"That's nothing but game, Cam\"\nShe was right, she was up in the Range, man (she know me)\nDropped her off at the L, now I'm flipping the cell\nThat's right, I had to call up L\nYo L, what up? I hit, what else?\nPlus dome, say word, and we got it on tonight\n\n[Chorus: Freekey Zekey (Toya)]\nHey ma (wassup)\nLet's slide (all right)\nAll right - and we gon get it on tonight\nYou smoke? (I smoke)\nI drink (me too)\nWell good - cause we gon' get high tonight\nGot drops (got coupes) got trucks (got jeeps)\nAll right - cause we gon' take a ride tonight\nSo ma (wassup)\nLet's slide (all right)\nAll right - and we gon' get it on tonight"}]}