{"artist": "Yung Wun", "songs": [{"album": "The Dirtiest Thirstiest", "image": "https://images.genius.com/e91387d452cf8257d4c55a2b7f99a6af.1000x1000x1.jpg", "year": "2004-12-07", "lyrics": "[Intro: Yung Wun]\n\nIt's another one\nThat's right, motherfucka\nIt ain't over, you can bob ya head to this shit\nIt's all dark [?] around here\nWhat! Bitch nigga! Yeah shawty!\n\n[Chorus: Yung Wun]\n\nLoad 'em up, let's ride\nSomebody's gonna die\nLoad 'em up, let's ride\nSomebody's gonna die\nLoad 'em up, let's ride\nSomebody's gonna die\nWhy?\n\n[Verse 1: Yung Wun]\n\nI'm coming straight up out the hood nigga\nYou can ask anybody, who got the guns nigga?\nI play around with big guns and fuck nuns\nOn a daily basis, I bet you think I'm crazy\nLiving life in this fast lane, coming up in this cat's game\nHugging the Glock, sipping yak mane\nI know a lot of niggas warned/wondered[?] about me\nHow I be, where I be, at 19, man fuck it\nWhat I got I worked hard for\nNine motherfuckin years I done starve for this rap shit, (that's right)\nNow niggas got it locked like vice grips\nAnd you know a bike rip, so a nigga might flip\nI got an overdose of game to give out, (but shawty)\nBut niggas act so funny I just don't speak out\nIt can be what you make it, get it how you take it\nI'mma break your billboard and replace it\n\n[Chorus x2: Yung Wun]\n\n[Verse 2: Taronda Hamilton]\n\nThat nigga like so special, it's kinda hard for me to speak\nYou see this shit right now, it's kinda hard for me to preach\nThey say the good die young, but that's the only thing I read\nBut they [?] bustin my guns, and to that nigga that [?]\nI hear parole's in three weeks, I heard your brother's a mother\nAt the store with them gutters, slinging rocks to them clubbers\nTen years a mother, got her fine and clever\nI'm gonna make your family feel what we feel forever\nGot me pissed as ever, on that shit so tell 'em\nThat bitch is sick with that click with rap sheets of felons\nAim my nine to your melon, bitch I snipe you who tellin'\nRevenge my friend meet your friend Lucifer the devil\nRetaliation I'm dwelling, I know I'm going to hell and\nI know this shit got me twisted but I'm scarred for ever\nMy brother's life was precious and bitch you took it so selfish\nBitch be careful 'bout big weapons, little sister gonna getcha\n\n[Chorus x2: Yung Wun]\n\n[Verse 3: Yung Wun]\n\nI command respect, so hop your ass back in that fed\nMotherfucka love is love, they don't cash no cheques\nWhile you're waiting for your mans to supply you with grams\nI'm in the dirty south bangin' niggas up cos I can\nGet to the money, lay low with stacks of fifties and hundreds\nAnd a ground bag of coke for the niggas I'm frontin'\nAnd they ain't got to pop it, I got a trigger for that\nIf you really want war, I got niggas for that\nI stay in the streets, in touch, ready to reach\nWith a city full of dogs that ready to eat\nAll it takes is a phone call, that's your downfall\nIf you owe me any money, I want it all\nI told niggas this day would come\nBut I never really thought this day would come\n'Til niggas ran in my crib, beat up my old lady\nWhile I was hustlin' in the ville\nShit got real\n\n[Chorus x4: Yung Wun]\n\n[Outro: Yung Wun]\n\nWhy it even got to be that way?\n(be that way, be that way, be that way, Why?)\nWe don't walk in these streets that way\n(streets that way, streets that way, streets that way, Why?)\nY'all niggas still runnin' off at your mouth\n(off at your mouth, Why?)\nHuh, Yung Wun\nLoad 'em up, cock 'em back, let's ride", "title": "Load ’Em Up"}]}