{"artist": "Prince Paul", "songs": [{"album": "Politics of the Business", "title": "So What", "image": "https://images.genius.com/f7b3f07c46a4e110f16d6822ec0efdf5.500x500x1.jpg", "lyrics": "It's the return\nOf the world's most famous [?]\nLadies and gentlemen\nFunk extraordinaires\nLadies and gentlemen\n\nWest Coast, East Coast\nCocaine, check it out\n\nWhat do you say to a man that brags about his car?\n(So what?)\nWhat do you say to a man that claims he's a rap star?\n(So what?)\nBam-diddly-diddly-bam-ba-see\nIsn't is a MC comin' up to me?\nThen that he stuck up in my ear\nYour halitosis is burnin' up my nose hairs\n\nWhy why why\nMust we talk about your car\nAnd your dope ass house\nWhy why why\nMust you be braggin' about the dope\nYou be slangin' in the South\nWhy why why\nWhy you claim to be knockin' fools out\nWhy why why\nApparently you don't know what life's about\nNo no\nWhy why\nWhy why why\nOoh ooh\n\nWhat do you say to a man that brags about his car?\n(So what?)\nAnd what do you say to a man that claims he's a rap star?\n(So what?)\nBurnin' up my lungs here, get out my face\n\nHey yo, same shit, different toilet\nI can't call it\nI'm just tryin' to have a good time\nNigga you tryin' to spoil it\nCause from the moment you walkin'\nYou shit-talkin'\nKnowin' that these cats watchin'\nAnd chicks hawkin'\nBraggin' about that shit you own\nA new pager and cellphone\nThe Benz on chrome, the brand new home\nTalkin' shit like that's gonna get you stuck up\nAin't nobody impressed nigga, so shut the fuck up\nI see you talkin' to the dime with the tight weave\nMake sure you roll up your right sleeve\nTen more time before the night leave\nTo make sure she can see the wrist glisten\n(Nice watch!)\nNow you think you a baller, but just listen\nTired of you niggas tryin' to put on a show\nI'm tired of you braggin' about the cars and dough\nI'm tired of you talkin' about niggas you don't know\nWrote a song about it, wanna hear it? Well here it go\n[Chorus]\nWhat do you say to a man that claims he's the shiznit?\n(So what?)\n(All the felonious capers)\nWhat do you say to a man that say he got a hit?\n(So what?)\nYou ain't really makin' no paper\n(Y'all ain't shit!)\n\nNiggas always talkin' bout what they got\nNiggas always talkin' bout how much they clock\nNiggas always talkin' every way they go\nI'm not impressed by you niggas, I just want you to know\n\nNiggas always talkin' bout what they got\nNiggas always talkin' bout how much they clock\nNiggas always talkin' every way they go\nI'm not impressed by you niggas, I just want you to know\n\nI don't care about a bitch or a 6\nChris Don or a mode\nAll that shit just to show?\nYou can't take it when you go\nI'm a survivor\nAnd I only speak for the riders\nAnd I don't wear Prada\nCause I think the horses are hotter\n\nThese other cats talkin' 'bout the jewels they got\nI'm talkin' 'bout the jewels I got from the dudes I shot\nCheck my record, I made plenty niggas strip naked\nYou wouldn't expect it so when it happens,  just accept it\n\nLocked up, I been there\nTwo years, I've done that\nSellin' cats run at\nOr I'ma put you where a pun at\nI love being me\nDon't you wish you was me?\nCould take a nigga key\nAnd tell your friends it was weed?\nI'm too much for this world\n(Y'all can't stand me)\nI look better than my girl\n(Well goddamn it)\nI was once a hot boy but now I'm a cold man\nOnly time y'all wanna brawl is all drunk and got the rams\nI don't need any, this thug life isn't in me\nI keep a pack of gum my gun and two jimmies\nI wouldn't leave a block until I knocked my last rock off\nWishin' I could be that boy, drivin' with the top off\n\n[Chorus]\nWhat do you say to a man who claims he has all the girls?\n(So what?)\nOoh-ooh\nLa-aah\nLa-aah", "year": null}]}