{"artist": "Wax", "songs": [{"year": null, "lyrics": "[Intro]\n\n[Verse 1: Wax]\nI be like Jésus Chrísto\nCats are not listo\nWax I speak so\nReminiscent of a freak show circus master\nAll these worthless basterds getting nervous faster than a village on the verge of disaster\nThey need to cry me a river since rappers spit soft\nI bring the grimy deliverance\nNo need to remind me to shiver since I spit the Siberian wilderness\nCold as it gets\nSpit 'till I'm old as a bitch\nNot necessarily the sole goal to get rich\nBut it'd be nice\nMan fuck all of the phony talk\nI been grinding for a while like Tony Hawk\nIf you don't believe me homie, walk in my shoes for a day\nListen to the music I play\nI been doing this way too long to stop now\nIt's not that I wouldn't, I just forgot how\n\n[Verse 2: Android]\nIt's like the devil gave away his violin and he never needed it back\nBut a way to how someone cuts the strings up for the beats that he feeds to Wax\nThe world ain't ready for people this intelligent, pristine in rap\nAnd I'm an idiot, you never wanna worship or offer an extra seat in the class\nI ran for the student senate\nTo deliver this movement, this method and invented a new poetic weapon used to diffuse my excessive amounts of depression\nI sat in the back of the class, wearing a dunce cap, acting stupid until the professor asked\n\"Can someone explain the elements of music?\"\nI looked around, everybody looked completely clueless\nI put in this beat, that's when I seen everybody's head immediately moving\nAnd bobbin', groovin' and poppin'\nLike this was some sort of roboticaly musical eroticness\nThat evolved from the human consciousness\nAll the people looked like zombies from resident evil\nMust've been the sick lyrics that I put on the record that effected the needle\nI cut the beat, they stood up and started applauding\nThe professor gave me an A+ and said \"Man, dude that was awesome\"\n\n[Verse 3: Bobby Bloodbath]\nI stomp through the swamp of a motherfuckin' comp\nThrow your kids to the aligators, watch 'em chomp 'till they armless, legless, fucked up really bad, torso floatin' like a motherfuckin' lilly pad (bitch!)\nRappers want to talk tongue and cheek? I'll staple your tongue to your motherfuckin' cheek 'till you can't speak or eat\nFor a whole week\nThen I'll throw your grandmother of off fuckin' Pike's Peak\nFuck a tight beat, if it's hot I still hate it\nSpit over the track and murder the dude who made it\nCome out of the booth and stab the engineer\nCut off his ear to wear as a souvenir\nOsama Bin Laden's my boy, I'll get him on the phone\nPlan another 9/11 on your grandma's retirement home\nBLAOW!\nBunch of dead senior citizens\nBobby Bloodbath\nWatch your back EOM\n\n[Outro: Bobby Bloodbath]\nMotherfucker\nBobby Bloodbath, stand the fuck up New York City\nBy the time you hear this track\nAll these other motherfuckers, Wax, Android, EOM be in the bottom of a river somewhere With concrete trapped to their fuckin' feet\nWith fuckin' photographs of their children all over their fuckin' bodies\nBobby Bloodbath motherfucker stand the fuck up!\nEast New York\nConey Island\nBitch ass motherfuckers!", "image": "https://images.genius.com/80a8f98d2de41e1d691e1395431f7e34.700x700x1.jpg", "album": "Liquid Courage", "title": "Concerto Del Muerto"}]}