{"songs": [{"year": null, "image": "https://images.genius.com/6f26a70c4161345974d87dbd8208a62b.450x450x1.jpg", "title": "Going Right at ’Em", "album": "Only the Strong", "lyrics": "[Noyd]\nI'm coming right at 'em, dun. Come on!\n\nYou see these monkey-see-monkey-do's only holding 22's\nThey're bucking nothing, letting nothing die\nYou see I roll for dolo, I don't need a crew\nI pack up by the gun or two\nBelieve me and I'm letting stuff fly\nAnd I don't give a fuck about the law\nBecause I've been here before\nI've been locked in, boxed in, adolescence at war\nI've been locked up, shot up, niggas calling the cops up\nI make these niggas shit in their draws. I seen it all\nLet's move on to the scale, the soda and fishscale\nWe be making crack like this\nLet's forget about hell, nigga, them jails, them god-damned snitches\nThey're going to make me clap the bitch\nYou see I'm all over the beat\nYou know I'm all up in the street\nMy niggas and bitches, bang to this\nCheck it, if it don't shine\nBelieve me homies, I pack some nines\nI'm going to bang til I empty my clip\nYou know my style, kid\n\n[Noyd in Hook]\nWith my timbs on my feet and the gat on my back\nWhen I'm strapping, you know I'm grinding, nigga\nYou have to see me with nines, if you want to stop mine\nI be two steps ahead and you be one shot from dying\nI don't run from feds for the bread I'm frying\nThe chicks say they love me, but I know they're lying\nThe closest thing to me only be my iron\nAnd I ain't lying\n\n[PMD]\nI've been doing this rap thing for years, ain't a damn thing changed\nStill on the block with my dogs, kicking the slang\nKool and the Gang don't sound like E and 'caine\nSince it's my thing, street cats respect my name\nGot the perfect game when it comes to this hiphop game\nCrack your frame, leave your whole shit in flames\nI'm like the gator in the Florida swamp, you losers no comp\nYou know the track record, mess around and get stomped\nFrom \"The Headbanger\" to \"You've Gots To Chill\"\nI stacked and built, packed and filled\nSo why these cats be acting ill?\nAcross the planet, my walls are granite\nSlow down, partner, the beat is never lost or stranded\nI can rap for centuries, spit with the first infantry\n[] in the back, I take the jet and keep the Bentley\nDon't tempt P, I squeeze until my whole clip's empty\n[Still say I was sent when it's empty]\n\n[Hook]\n\n[Noyd]\nAin't nothing changed, me and only me got my back\nWith no gang, I maintain with a baby Mac\nThis game got these niggas thinking they're hard when they ain't\nLike they're God and won't catch ache in broad day. These niggas soft\nYou know they've got sugar in their tank, man, get lost\nBefore you catch it right across your face\nYou got \"thug\" pumping through your hearts and veins\nTill my slugs come busting through your window panes\nThen they flip, you know they turn and they snitch\nNobody in the hood seemed to heard of them since\nListen, dun, you don't want it, you don't want to feel the Tec\nI'm coming squeezing, leave you bleeding\nY'all niggas know the rest\n\n[Hook]"}], "artist": "Big Noyd"}