{"artist": "Big Boi", "songs": [{"lyrics": "[Intro]\nGhosts and goblins run amok\nIn the caverns of rhine\nSlinging petty corruption\nThe seventh sign!\n\n[Hook]\nYeah!!!!!!!\nGive to you and I do what it takes!\nTo give it to you!\nBust...bust!\n\n[Verse 1: Big Boi]\nStep into the realms of space where nobody goes\nOnly the baddest motherfuckers are the ones that are chose!\nSome of the coolest individuals on the planet we said\nBest believe that we can buck or give a damn if we care!\nNo collision supervision but my family is here\nNow my mama taught my niggas that was under the stairs\nOne of those who chauffeured life and then was unprepared\nBut my hunger is the thunder, no wonder it can't be smothered\nOr buttered up, buttercup, melt your sauce\nYou a Chuck E. Cheese bouncer chumpin' off the boss\nWhat I'm trying to tell you now is that you're softer than soft\nAnd I'm sick as a cough, did I mention it's raw?\nYour predicaments flawed, flaw means fucked up\nAnd serving out the oven not fried, slow roast\nNo coast, tuck your tail and hide!\nYou scared?\n\n[Hook]\nYeah!!!!!!!\nGive to you and I do what it takes!\nTo give it to you!\nBust...bust!\n\n[Verse 2: Killer Mike]\nI officially do it with duns on tour\nWe lock down traps, push caps galore\nMy wiz cook work 'til it scale like fish\nMy old earth even known to handle biz\nI serve whipped, out of whips, whip out cash\nUsually keep a G-pack on the dash\nTry to test my gangsta, I bring harm\nI'm as slick as Freeway Rick and Nicholas Barnes\nMy Uptown Nikes hold caps and cheddar\nMy waistline hold a 4-pound Baretta\nI'll shoelace your face just to learn you better\nMy ox so sharp it cut through leather\nMy rap name Killer, my street name Skunk\nI mastered the music that was born in the Bronx!\nI switch my slang spit from my mouth\nI'm still all coast, my coast the South!!!\n\n[Hook]\nYeah!!!!!!!\nGive to you and I do what it takes!\nTo give it to you!\nBust...bust!", "image": "https://images.genius.com/547d6239cd014bda1acb0078d0ddaafc.999x999x1.jpg", "year": "2003-09-23", "title": "Bust", "album": "Speakerboxxx"}]}