{"artist": "Ice-T", "songs": [{"title": "Fly By", "lyrics": "[Intro: Donald D Talking]\nOne, two in the place to be, I'm MC Donald D\nAnd in the house Nat the Cat, the Syndicate Mobb boss\nAnd standing after me, Ice-T the O.G. Gangster\nSyndicate is about to jump off on a buckwild freestyle\nIce, drop some dope shit!!\n\n[Ice-T]\nEverybody step back from the mic cause I set it off\nAll playing the wall, it's time to sweat it off\nAnybody with static, awww, please try\nI'll do you like Godfather 3 and do a fly by\nTime to rip and hit and strangle\nI eat Guardian Angels\nAnd toy emcees with their names on the front page\nI bury in shallow graves\nI don't rap with girls in my LP\nI don't beg for pussy, I love the ladies and they love me right back\nNow who's the mack?\nMission accomplished\nI came to stomp this microphone and leave suckers unconscious\nAnd if you think you got a 'S' in your chest\nYou better wear two vests\nWatch your back, your front, I always hit, don't bunt\nCrazy posse when I'm out on a duck hunt\nEmcee Ice-T answers to no one\nLoad my rhymes and cock them like a shotgun\nLet off like frags from a pipe bomb\nA low stroll and my mic in my right palm\nThe cops hate me and that's right they oughta\nBefore my crew gets to their daughters\n\n[Break: Ice-T Talking]\nHa ha ha, yo, Nat the Cat, you're next baby\nYo, why don't you get on this Mic\nAnd jump off like suicider off the Brooklyn Bridge, baby?\nYeah, you're a player, kick it\n\n[Nat the Cat]\nDo you know me?\nRight, that's why carry the mic\nI'm not flashing my American Express\nI'm playing my cards closed to my vest\nMy name that you say, what, I'm vesting\nListen up and listen close and listen for the lesson\nBlack panther resisting that situation\nExecuting with tact, jumping exact\nRipping up slack on the tack\n86 didn't mack, turn tales and back up at stack the jack\nCause I'm venerish, Nat The Cat, unloading like the million tons of T.N.T\nYes that's me, you see, you wanna be but can't MC\nCause on the real, the science ???? behind your capacity\nThe simplicity that's how I say\nBut I said it, you know you wonder how did he say that anyway\nTo you it's complex, when I flex for flex flood\nStimulates the opposite sets, and that's dope\nThough why you can't cope\nI'm throwing you a rope, I'm about to draw you as you don't rock the boat\nOr you be back inside the ocean this time it won't float\nYou be stuck on the bottom with other suckers I got them\nSporting to see me, woof, while I'm banking the loot\nJust off the end, you travel around the world in a fly silk suit\nMy style is custom made suede and leather\nDown to fly by in any weather\n\n[Donald D]\nDonald D the smuggler, goin' for the juggler\nFiring wild out here, police sirens\nWhat's up? Do you wanna die by?\nThe Syndicate sniper tonight on a fly by\nSwing while I came into the tune that grip ya\nFlip ya, trip ya, rip ya, I keep dipping ya\nIn and out, back and forth, up and down\nMe be sleeping with the heat, I can't fuck around\nCity sounds, I proceed with caution\nTeach you that B.S.C.s another fortune\nI'm here to sink your brain, I'll take the thought you think\nMake you walk the plank, to watch you sink\nThe M.O.B needs a hitman\nWell here I'm, Uncle Cocaine, floods your membrane\nAs the black ball swings from the chain\nLearn to steal, learn to wheel and deal\nWhen things got hot, caps got peeled\nMC's, come on, step with your rhyme\nWhat's up, put your life on the line\nI shall robe them, headlock choke them\nWhile you walk them when the Syndicte Sniper get stalk them\nRed Beam on target, you can't dodge it\nWouldn't wanna be ya, ABC ya\n\n[Outro: Donald D Talking]\nAww yeah man, that was MC Ice-T\nNat The Cat and Donald D, you know what I'm saying?\nIn your face for 1991 and did something\nWe outta here, for sure, it was a homicidal fly by\nSo peace to Syndicate's elders", "image": "https://images.genius.com/8ba43671bb57813daf61c8431aebd0ea.1000x1000x1.jpg", "album": "O.G. Original Gangster", "year": null}]}