{"artist": "Bone Crusher", "songs": [{"album": "Release the Beast", "title": "Southern Gorillas", "year": null, "lyrics": "[24 seconds of instrumental to open]\n\n[Intro/Chorus: Bone Crusher]\nThese niggas talkin hardcore ain't no killers\nYou don't wanna fuck with these Southern Gorillas\nNow take these slugs from my Desert Eagle\nY'all niggas fuckin with the realla to realla\nI'ma tell you one more time nigga - get from around me\nTell 'em, hey nigga GET FROM AROUND ME!\nYeah I'ma tell you one more time nigga - get from around me\nWHAT?~! Hey nigga GET FROM AROUND ME!\n\n[Bone Crusher]\nYeahhhhhhhhhhhhh, the tide keep comin nigga\nJohn Blaze for them heffers it don't, get no better\nI got, woodgrain and leather that's sharp like cheddar\nWhen I see a fuck nigga, I'll gamble - whatever\nCall me BONE CRUSHER nigga, I'm the hardest thing walkin\nWhen I see a fuck nigga, all he do is talkin\nWhy he wanna rub against me, I really don't know\nYouse a bitch, youse a bitch, by the way youse a hoe!\nDon't EVER try to stop me, 808 drop-ping\nI watch the bass come in and knock ya {?} out your chin\nNigga wonder why I never come around with a grin\nI've been down for strongarmin nigga once again\nWhat's my name? BONE, CRUSH-AH, stop that\nHow y'all niggas wanna attack, a nigga that ain't strapped\nWatch out for Jugganots, I'll kill a motherfucker\n{*growling loudly*} I WILL KILL A MOTHERFUCKER NIGGA!\n\n[Chorus]\n\n[Cotton Bend]\nReal killers don't talk, here they quietly spark\nOn the contrary nigga, don't need eyes of a hawk\nCause I'ma catch you up close, 22 to the throat\n'Nother 12 to the chest, nigga that's all that she wrote\nHell I make my own silencer, nobody hear nothin\nYou shoulda kept your mouth closed, you had to push the button\nBut I ain't no dumb nigga, so I don't leave no trace\nHell don't you know nigga, no body no case\nAnd I'ma give you a lil' scoop, we takin chipper to the hooch\nAnd I'ma get rid of everythang, from tha roota to the toot\nHell from the hair to the boots, from the house to the Coupe\nShit from your wife, to your brother nigga\nAll the way down to your pooch\n\n[Chorus]\n\n[Bone Crusher]\nNigga get the FUCK out my damn face\nYEAHHH, the mangler, 'bout to mop up this place\nYEAHHH, y'all niggas wonder why I'm harder than cinder blocks\nI'm unstoppable, similar to Jugganots\nHey first of all, I was born to be extra hard\nAnd with that BM shirt was born to be extra smart\nAnd clearly, my competition is, kinda nil\nSo watch your mouth young nigga 'fore you get killed\nIn 99 I'm the strongarm kinga nigga\nGorilla, mobster, the real deal\nAnd if you want it my nigga you know where I be\nAsphalt, steady walkin these asses up the street\n\n[Chorus]", "image": "https://images.genius.com/8238f0468ca00f9904b8a992b5eed5d2.620x620x1.jpg"}]}