{"artist": "Ace Hood", "songs": [{"title": "’Bout Me", "album": "Ruthless", "year": "2009-06-30", "lyrics": "[Intro]\n\n[Verse 1: Ace Hood]\nMister Hood\nNigga I'm good\nAce Hood\nFace good\nWish a nigga would\nTake this\nBake this\nFeed it to the wolves\nA motherfucker should\nI'm beating like band wood\nThat black flag swag is part of my man hood\nThat pistol on that seat is just keeping your man good\nI'll pop his top like drops and can goods\nI'm gutter\nTell you one thing about me\nI'm stuck to the green\nLike the coke to the fiends\nAnd if by all means\nJust pay me in all green\nSprite chasing the promethezine, I'm on lean\nBall Greez my dude, we goon your whole team\nI'm him them dangers ask your man mane\nFifteen bottles of Rose and champagne\nNiggas they know the name and understand the game\nI know you see the chain\nIt's We the Best the game\n\n[Hook]\nBitch I'm ruthless\nBoy I'm a G\nAnd you don't know a motherfucking thing about me\nOne thing about me\nI do it for the streets\nI do it for the killers and them young O.G's\nTell you this about me\n(About me)\nAbout me\n(About me)\nI'm a G I'mma rock with that beat\nTell you this about me\n(About me)\nAbout me\n(About me)\nI'ma keep that black flag on me\nTell you that about me\n\n[Verse 2: Ballgreezy]\nI'ma stack my bread and fuck nigga's hoes\nShoot dice, drink liquor, and sell dope\nTote fire, stay fresh everywhere I go\nPop pills and while I'm getting my goon on\nPack extra clips, and get my suit on\nAsk bitch ass niggas who want to move wrong\nSo if you got it on your mind let a nigga know\nSo I could show you that the .9 send niggas home\nOther then that, the street niggas love Greez\nEven though they baby momma want to fuck me\nI'm one hundred about everything the boy do\nThat's why the crowd behind me everywhere I move\nAnd you can tell by the swag Greez about money\nAnd I don't play no games when it's about money\nI do it for them young niggas that pop beams\nThe hot boys with big stacks the cops see\n\n[Hook]\n\n[Verse 3: Ace Hood]\nAye where my goons at?\nWhere my G's at?\nWhere them killers and them zoes staying so strapped?\nBroward County on the map, that's a known fact\nAnd when I talk back, people running four flat\nAnd night see the light, you can follow that\nI creep all black\nSo strapped\nFuck rap get your baby boy kidnapped\nBlack flag, my rag got the wrist wrap\nRespect G, when I walk not a pen tap\nBecause I'm me\nWho's he? We could end that\nStreet nigga ain't no time for that chit chat\nI'm cold like Coronas in a 6-pack\nAce Hood getting head like a ball cap\nOne thing about me I don't call back\nFall back, I'm addicted to the brown bag\nMC Hammer swag\n'Can't touch that'\n\n[Hook]", "image": "https://images.genius.com/53ac3721e503404e628fbbe13e8ddd8e.600x600x1.jpg"}]}