{"songs": [{"year": null, "image": "https://images.genius.com/0e0f7da938d859e7393ec453d6223ad7.600x600x1.jpg", "title": "Beat U Pussies Up", "album": "Dope Talk Volume 2", "lyrics": "[Intro: Big Scoob]\nYeah Imma call this one the old nigga track, you dig?\nCause I'm on some old nigga shit on this one, know what I mean?\nI ain't with this new funny style of rap shit these niggas is on, man\nI think Imma rock a throwback jerzy in this bitch, nigga\nAnd Imma keep it that way\n\n[Chorus: Big Scoob]\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\n\n[Verse 1: Big Scoob]\nLil rap niggas, lil jeans, lil shirt\nLil money, lil work, lil terf\nLil boys, lil skemes, lil hood dreams\nI'm a big boy, all I do is big things\nAnd these gang niggas, never did a thing niggas\nOnly wrote a song, now they sware they bang niggas\nI ain't with it man, came up with a different brand\nReal niggas, real killers, really silly, man\nYeah nigga, I been meeting in this rap shit\nRun from niggas, but they sware they on some trap shit\nAin't that, I sware them niggas on these pussy games\nStraight tricks, but they sware they straight players, man\nBullshit ain't nothing to a real boss\nReal feends bring real heat, that's real talk\nSee me in the club, holla, tip a cup\nJust remember if you trippin\n\n[Chorus: Big Scoob]\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\n\n[Interlude: Glasses Malone]\nScoob do it for the OGs\nI do it for the YGs and BGs\nG Malone, check it\n\n[Verse 2: Glasses Malone]\nFall into the funk shit\nNiggas talking, but they ain't saying nothing\n2 pistols, simpley saying \"boom\"\nI came motherfucker, give me your wrent\nPlayer shit, know who you're dealing with, man?\nHad a Holliwood bitch eating that tan\nAnd don't supersize shit\nEver seen a pare of supers like this?\nI doubt it, bitch I'm bout it\nDesert Egle 44, but I'm the same without it\nLocked out, dark like Wesley Snipes\nBumpin lodies at the gage of westlife\nKnocked a young bitch, so it's no rest tonight\nLeave this restaurant, we the best and get it it right\nFake nigga rush in, acting like he wanna fight\nGrab my gun and my knife, and nigga\n\n[Chorus: Big Scoob]\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\nI'll beat these pussys up\n\n[Outro: Krizz Kaliko]\nDope Talk Vol 2\nKali baby\nWe in the building man\nBig Scoob\nGlasses Malone\nWe beat these pussys up\nWell, y'all beat these pussys up\nI don't know what I'm talking bout"}], "artist": "Big Scoob"}