{"songs": [{"year": null, "image": "https://images.genius.com/a822e5595fc1eee33d5cbbfa1ae70b68.500x500x1.jpg", "title": "Roll Call", "album": "Rapper’s Delight", "lyrics": "[Jozeemo]\nUh, give me a second, I'm having a nigga moment\nJo' reaching under the shirt's your first omen\nWe man up, y'all niggas is still zoning\nI'm on my third hustle while niggas is still yawning\nFive in the morning, out of town cell phone\nRoaming on my Philly shit, beard need coaming\nWork's never done, fake niggas need bitching\nSet off a pistol whipping, trigger finger still itching\nPots in the kitchen, 'caine needs cooking\nAs long niggas balling, Jo' Gutta still jooking\nI see the crowd looking, I thought he was a rapper?\nThat's part-time bitch, I'm an AK clapper\nDress code's something like the opposite of dapper\nSend a black rose to your mother and your pastor\nI'm after, everything I feel that I'm due\nOn the grind 'til I feel that I'm through\n\n[Chaundon]\nEven though I moved out of NYC I'm the realest\nTransferred to Central Carolina Phyllis\nThe world black and white but a nigga dream of color\nLike blue and cream wallies, I'mma rock 'em this summer\nTook a few losses, had a little setback\nReparation time, dude for the get-back\nHad a premonition, I'd be the illest spitting\nShut down Webster's, become the definition\nUsed to have more +Nightmares+ than +Dana Dane+\nA voice woke me up and told me to change the game\nNever second guessed it, rose to my feet\nMetronome flow, huh, controlling the beat\nThe heart of the street, put my vocal chords in a frame\nHang it up because it's art when I speak\nDon't need to autograph it, my verse is the signature\nNow open up the gallery doors\n\n[Hook]\nI never should have rolled the dice\nNow I'm trapped off in the game (in the game)\nNo matter how you live your life\nSome shit don't never change (never change)\nI'm here for the money and the power\nY'all keep that fuckin fame (fuck the fame)\nEither way when I leave this bitch\nYou gon' know my fuckin name\n\n[Joe Scudda]\nYeah, so come with it, Joey done shitted\nBest to do it and damn near best that did it\nNine-one-nine on the wrist and the fitted\nRaleigh y'know our cap', lil homie don't forget it\nPut the bait out and you bit it\nFuck around with me, catch a bald like Riddick\nOr bald like Jackson, time for some action\nIf you asking, I ain't with all the rassling\nI'm about moving, I ain't with the losing\nAs a fly-by I'm still cool cause I'm cruising\nWhat you think you doing? I might have to ruin\nBetter catch up homie, come get with the movement\n(Better tell 'em bout it) H-O-J, they don't play\nThat's my team, this my day\nCrown City boy, that's where I stay\nAnd we the best out, that's what they say\n\n[Rapper Big Pooh]\nUh, niggas always wanna talk about money\nTold y'all I came with Dho/dough, young'n you ain't know?\nToured the world with my group Lil' Bro'\nThat means I'm professional, who's next to blow?\nYou just standing in a shadow\nHurt pride like I stole your mojo\nI'm so thoro, get a book, maybe I'll explain\nHow I maintain, do this with no strain\nHuh, you do it with no gain\nAnd they tryna put us on the same plain\nNo disrespect, that's a disconnect\nI achieve milestones you ain't even seen yet\nBeen a couple places you ain't even dreamed yet\nSix years later, how quick we forget\nAnd yet, there's still not one comparison\nThat they compared me to that I ain't much better than, my nigga\n\n[Hook]\n\n[Outro: Rapper Big Pooh]\nYeah, haha\nHOJ, that's the muh'fuckin movement\nYeah, uh, that's the muh'fuckin unit\nJ.O., Doovie, Jozee', Rapper\nSean Boog, what up? Khrysis, what up?\nD-Brock, Big Dho"}], "artist": "Rapper Big Pooh"}