{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "End Of The Road", "lyrics": "Jim Jones, what it here, homie?\nKilla Cam, Freekz Zeeky, Juelz, what's happ'nin?\nHey, T.I.P., nigga\nI'm up in Harlem to put it down wit my muthafuckin' folks\nDipset, bitch, a town to muthafuckin' NY, nigga\nYou already know what it is, Bankhead\nC-Rod, Grand Hustle, Diplomats\nYou don't like it? Kill ya''self nigga, let's go\nLate night, straight white fa' ya' base pipe\nNo mo' quarter O, get ya' weight right\nCrack rock, black Glock kept it waist height\nIt hit ya'' mug you don't imagine what ya' face like\n'American Pie', I'm tellin' you guys\nYou want beef wit us, well who the fucks preparin' you guys?\nWe sparin' you guys, get buried alive\nWhat you rushin' fa'? Act like you in a hurry to die\nSome I let 'em fly 'fore I let that ride\nI paralize ya' like Superman's horseback ride, nigga\nWalk up on ya' car an' scorch dat ride\nFlat tires, glass shattered wit a corpse inside\nA town break down straight pounds of dro'\nStill deal if you want 10 birds or mo'\nPimp Squad, Dipset, I know ya' heard before\nIf we called you a bitch, you deserved it, hoe\nI cop bricks of the crack an' take it to my block\nStrip or my trap, my block strip is so trapped\nCops quick wit a strap, an' you'll be scared shitless\nHow they where the big fifth an' load up flares an' biscuits\nI'll take ya' bitch from you, bring her back wit smeared lipstick\nYou can compare ballistics, but it's mere physics\nI'm two threes on drops, I used to play hoopties on blocks\nPlottin' man like who he gon' pop\nIn this tragic city, now I'm Bankheadin'\n4 tens headin' down in A.T.L.'s Magic City\nYes, the stash is pretty an' the mag hold 50\nWe take ova towns, then send the Rovers 'round\nLookin' fa' hoes to pound, ya' local hoochie spot\nLookin' fa' hoochies hot to get they coochie popped\nI love the titty bars, I love my niggas, pa\nDipset, Pimp Squad, yo, let's get it, pa\nYeah, already trill niggas in this bitch\nU.G.K., know what I'm sayin', that's off top, fool\nYou already know, wreck it boyz, go down like that\nWhat up Jones? Dipset, nigga\nBitch my Cadillac is candy an' my pistol is pearl\nMy best friend is a pimp an' his bottom bitch is ya' girl\nI got them '84s that clank, the big diamonds that blank\nPlus them hoes that pop pills, smoke kill an' sip drank\nFuck what ya' think, I'm tryin' to tell you how life\nIs, give it an' take it\nMy lil' brotha in the pen, where niggas shiv'rin' an' shakin'\nWe got a million dollar team, wit one gone\nSo I'm takin' my 500 to flip in the game\nTo have somethin' for 'em when he come home\nMy two older brothers locked up, both of 'em smokin'\nPrincipal's gon' be fucked up, man\nMy lil' nieces an' nephew heartbroken\nSeein' Daddy in a cage at that age, it fuck ya' mind up\nSo at this stage in the game, I gots to really get my grind up\nSo you gon' see me in yo' city doin' a verse or a show\nOr maybe even servin' one o' these niggas\nA couple of dem thangs on the low\nI'm Dipset affiliated, so you can hate it or love it\nBut it you keep pushin' ya' luck, bitch, my middle fingers' gon' shove it\nKnow what I'm sayin'"}], "artist": "T.I."}