{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/8df54c2d7f7abaf27116f5f75f12e728.500x500x1.jpg", "title": "Nasty Nigga", "year": "2012-08-01", "album": "Procrastination Kills 4", "lyrics": "Uh, I met this girl on the South side\nShe was bad, and she always keep her mouth wide\nShe got me thinking about some things that I’m supposed to do\nGirl, I’ve been calling cause I’ve been trying to get close to you\nAnd don’t be mine with that man, I’ve been at work shit\nI heard you and your husband try to work shit\nI keep it pimping drop your name in my verses\nBut how your thighs been on your ass, got me nervous\nI’m sipping alcohol and hoping I don’t burst quick\nAnd this dick hard enough to make the Earth split\nI put it in, and she told me that it hurt a bit\nI know the whole hotel probably heard the bitch\nShe scream my name out tell me where my name at\nOn the ass I tried, but nothing came at\nShe lay me down and roll me like a Maybach\nI grab that ass, suck them titties for the simlax cause\n\nChorus:\nI’m a real nasty nigga\nGirl, I’m a real nasty nigga\nSay I’m a real nasty nigga\nI’m a real nasty nigga\nShit, say I can get nasty with you\nGirl, I can get nasty with you\nCause I’m a real nasty nigga\nI’m a real nasty nigga\n\n(TYGA)\nUh, bitch shut the fuck up, put that butt up\nPut your face in the pillow, don’t you come up for air, bitch!\nYou feel that dick is right, yeah bitch\nPulling up your hair, choke you out, I’m like yeah, bitch!\nYou like that nasty shit, spin at it, put it in\nFucking for an hour long, then we’re straight fuck again\nThe sun come up, come on, you know I…\nShe licked the nut up, I’ll be the… like nut chucks\nEat the pussy, make you curl your toes up\n..now we’re fucking slow motion\nRoll up, coast ..speed it up because she’s rolling\nThen impact the gap…\nNigga what?\n..baby my sex game popping up\nMake a bitch bad, tell that bitch to get on top of her\nTurn the bitch out, now she don’t know what she about\nBang bang, kick ‘em out, come in her mouth, no doubt!\n\nChorus:\nI’m a real nasty nigga\nGirl, I’m a real nasty nigga\nSay I’m a real nasty nigga\nI’m a real nasty nigga\nShit, say I can get nasty with you\nGirl, I can get nasty with you\nCause I’m a real nasty nigga\nI’m a real nasty nigga\n\nAnd now she turn that ass around for that 69\nHow many licks did you take, I’m on 89\nThat pussy taste like water, my favorite kind\nI lick the tats on her back, yeah, every night\nShe’s speaking different languages when I get behind\nI go deep up in that ass, trying to feel the spine\nStrokes flow to that beat…\nWe hit it fast, but she’s telling me to slow it down\nMy nigga tell me to put her finger up in her butt\nHe told me that’s the fastest way to make these bitches nut\nI let the bitch and keep fucking, until she find the love\nI fell asleep into… until I’m waking up\nIt’s five thirty so honey, a nigga probably done\nBut missing on his dick he don’t pay…\nI congratulate the bitch and put her knees up\nIn her chest I drop my deposit, I’ve been all…\n\nChorus:\nI’m a real nasty nigga\nGirl, I’m a real nasty nigga\nSay I’m a real nasty nigga\nI’m a real nasty nigga\nShit, say I can get nasty with you\nGirl, I can get nasty with you\nCause I’m a real nasty nigga\nI’m a real nasty nigga"}]}