{"artist": "Young Thug", "songs": [{"year": "2014-12-11", "lyrics": "[Verse 1: Young Thug]\nI'mma ball like Spalding nigga\nI'm a blood I'mma balla, you can call a nigga\nAnd I'm smokin' angel dust, yes my nigga\nAnd I'm attracted to green like war niggas\nI'mma pull up late, Ricki Lake!\nAnd my jewelry's no joke, shit frosted like flakes\nI swear to God I'm baked like Easy Bake uhhh\nI send a bank statement that shit sound like a taser\nYeah she shoutin' like I shot her with a taser\nFly that bitch to LA she ballin' like a Laker\nI know not to tell and never speak to the neighbor\nIn fact I can't see them I'm on so many acres\nEver since I met shawty I feel like Hercules\nAnd I'm smokin' bales of weed cause it grow on trees\n6 golds in my mouth like a set of keys\nWith my west boast blood bangin' burgundy\nRich bags under my eyes nigga Birkin these\nShe say I want Victoria Secrets\nAnd I fuck her long watch her decrease\nEven though I'm a blood, she like \"CC\"\nShe get mad whenever I bring a BB\nShootin' a 223, DVD\nWatch me shoot a foe, way down the street\nCost a whole hunnid band, band with the heat\nI'mma die for my clan, Ku Klux me\nDiamonds red like a muhfucka cut me\nAnd I smoke rusty and dusty\n\n[Hook: Young Thug]\nWhat are you doin' in this game?\nI wanna know what are you doin' in this game\nHey, baby girl whatcha doin' out here?\nWhat the fuck are you doin' out here?\nHey, I know whatcha doin' out here\nI know whatcha doin' out here\nYou killin' these bitches\nKillin' these niggas\nCook a lot of white like Tommy Hilfiger\nAy baby girl gimme this twat\nShe love to sound like Brian Nichols\n\n[Verse 2: Rich Homie Quan]\nBrian Nichol with a pussy out to kill it\nI ain't lookin' for the swoop I need a bitch who got a million\nI want a bitch with some loot who gone take care of her kids\nI mean make sure her kids, straight forever udigg?\nI won't stop gettin' money forever udigg?\nAnd I ain't talkin' bout a shovel, hmm udigg?\nI just bought a new dog that ate up the pig\nI just bought a new car, a hunna, udigg?\nPshh, stop, a hunnid ain't shit\n2 boys 1 month, a hunnid on them\nCan't go broke, it may not come again\nBut a lot of money comin' in you don't belong here so\n\n[Hook: Young Thug]\nWhat are you doin' in this game?\nI wanna know what are you doin' in this game\nHey, baby girl whatcha doin' out here?\nWhat the fuck are you doin' out here?\nHey, I know whatcha doin' out here\nI know whatcha doin' out here\nYou killin' these bitches\nKillin' these niggas\nCook a lot of white like Tommy Hilfiger\nAy baby girl gimme this twat\nShe love to sound like Brian Nichols\n\n[Outro: Young Thug]\nBaby watch out for the shark\nWatch out for the cops\nWatch out for the thots\nThey just want a piece of you like me\nBeat 'em like Bruce Lee\nFacin' life and you broke\nLook at my shoulder boy you can cry on me\nNo, no tellin' but I told ya you can't control these streets\nIf a pussy nigga play I'm gonna gun him down like a G\nBaby you can't see me I'm ballin you can't even D me", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Brian Nichols (In This Game)"}]}