{"artist": "Playboi Carti", "songs": [{"album": null, "title": "Had 2 (Original Version)", "image": "https://images.genius.com/2464352e4c9d86516c4891b53ebc48a6.871x871x1.png", "lyrics": "[Hook]\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nAye, ooh\n\n[Verse 1]\nI was brought up different, so my vision different\nYeah my bitches different, riding 'round tinted\nI can't fuck with niggas, I go get it nigga\nHow I live it nigga, I can't kick it with ya\nThey say that I changed, went and copped a chain\nWent and copped them thangs, weight all in my name\nFuck me for my fame, fuck me for the fame\nWeight all in my name, weight all in my name\n\n[Hook]\n(Boss up!)\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\nBoss up on these niggas\n\n[Verse 2]\nI can't kick it with ya, I don't fuck with niggas\nI just smash they bitch, all up on that bitch\nWhy you mad at me? How my flex on cold\nYeah my flex on bold, teach you how to move\nAll my flex on cool\nAnd my chain on cool\nYou know how I do, you know how we move\nBoy this swag school, let me teach you\nI be in the scene, pocket full of shit\nAnd I got the Glock, boy don't try no shit\nI'm from Flatbed, been with the shit\nI'm a hot nigga so I need a hot bih\nOoh that be yo bih? Why that be yo bih?\nShe in love with you, and with yo clique\nI be with the shit, my hoe with the shit\nFuck her anywhere, man I love that bitch\nPockets still thick, got me fucked up\nSmoking on the Jit, got me fucked up\nThese niggas 'round here, they got me fucked up\nOpen up the truck and then I let it buck\nAnd I'm on the block with the shit for real\nAnd she give me top, yeah for real for real\nI just love the guap, yeah for real for real\nYeah yeeeah", "year": "2017-06-27"}]}