{"artist": "Willie D", "songs": [{"year": "2016-04-15", "lyrics": "[Intro]\nTell your nigga jokes while he in the room\nHe gon' laugh harder than you cause he a coon\nI'm a goon top down pants up when I walk\nNever call a C.O. a boss I'm not a coon\n\n[Verse 1]\nBoom - it's the elephant in the room\nNaw that's a mutha fucking coon\nBlacks been free since Lincoln got wasted\nBut some of these niggas still on the plantation\nListen up Charles Barkley\nYou light skin but still calling you a darky\nThe only reason that they put the mic in your face\nIs so you can do they dirt and talk down on your race\nTNT made you big put you on a wig\nNow you're acting like you never had trouble with pigs\nYou kissed a man in the mouth for reals dudes that's a no no\nWhen you gon' come out the closet you fucking homo\nSaw you on television dressing in drag\nWhat kind of dumb nigga say slavery wasn't that bad\nDissing San Antonio women that's the kettle and pot\nWith that busted up looking ass wife you got\n\n[Hook]\nIf you're selling out your people you're a coon\nIf you hate your own kind you're a coon\nBootlicker shuck and jive you're a coon\nYou're a coon you're a coon you're a coon\nIf you're selling out your people you're a coon\nIf you hate your own kind you're a coon\nSambo die slow you're a coon\nYou're a coon you're a coon you're a coon\n\n[Verse 2]\nHow to make a coon - if you wish for a black one\nPut some change in his pocket and give him a platform\nPut him on suspension if he cross that line\nBut if he shitting on his people give him more airtime\nSteven A Smith what's up with that hairline\nBig mouth louder than 4 Alpines\nGot a chip on your shoulder cause ball game suck\nAnd you gotta work with players that your wife wanna fuck\nI'm a savage running through the field amok\nRaven-Symoné shut your chicken head dumb ass up\nWhite folks don't love you black folks don't trust you\nWhen you was on that show Bill Cosby must've drugged you\nI had to get 'cause you're cooning for capital\nYou Hollywood niggas are laughable\nYou're not infallible like Cosby when they use you up\nThey gon' throw your ass under the bus\n\n[Hook]\nIf you're selling out your people you're a coon\nIf you hate your own kind you're a coon\nBootlicker shuck and jive you're a coon\nYou're a coon you're a coon you're a coon\nIf you're selling out your people you're a coon\nIf you hate your own kind you're a coon\nSambo die slow, you're a coon\nYou're a coon, you're a coon, you're a coon\n\n[Verse 3]\nAw hell CNN is on\nCheck out this lil bitch named Don Lemón\nGetting stuck in the butt got your ass corrupted\nYou can smell weed but you can't smell injustice\nSelling your people out while the police murder them\nI wish the protestors would've shot you in Ferguson\nI wish that would've been Stacy Dash on the ground instead of Michael Brown\nBut with additional rounds\nHeard you slept your way to the top, somebody lying\nYou're D list actress, been divorced 3 times\nStank ass\nThey say you easy plus you on Fox News\nHow you gon' talk about somebody else morals and values\nThey prop these clowns up to undermine the plight\nGive'm the spotlight and reduce'm to soundbites\nUncle Toms dancing to the stereotypes\nHow you mutha fuckers sleep at night\n\n[Hook]\nIf you're selling out your people you're a coon\nIf you hate your own kind you're a coon\nBootlicker shuck and jive you're a coon\nYou're a coon you're a coon you're a coon\nIf you're selling out your people you're a coon\nIf you hate your own kind you're a coon\nSambo die slow, you're a coon\nYou're a coon, you're a coon, you're a coon\n\n[Monologue]\nThe supporters of coons love to talk about how they respect them because the coon have their own mind, or they have their own opinions, or they think outside of the box. That's a lie. The reason why they support the coon is because they can control the coon. Now, some people gonna have a problem with me callin' these coons out. First thing they gonna say is \"crabsinthebucket, crabsinthebucket\"… Let me tell you something: this ain't got nothin' to do with me trying to hold another black person back. I love to see black people gettin' it, you understand what I'm saying?\n\nBut if your criticism of the black community outweigh your contribution to the black community, and you black, you a mothafuckin' coon!\n\nIf every time the police shoot somebody black, and you take the police side, you are a coon!\n\nIf you fixed your mouth to say that we ended racism and discrimination in America, like this old coon-ass nigga, David Clarke, who call himself a Sheriff in Milwaukee, you are a coon!\n\nIf you are of any ethnicity other than white, and you support Donald Trump, yes, you are a coon!\n\nIf you out here rattin' on the next man 'cause he husslin', and y'all doin' the same thing, you're not just a coon, you a mothafuckin' rat-coon!\n\nNow let me get back to this crossdressin'-ass nigga Charles Barkley— Look here, nigga, you love to talk about how you'll slap somebody. I wish you would put your mothafuckin' hands on me…I'd body your fat ass! Real talk. This nigga got a real self-hate issue. Fuck Charles Barkley, and the ground he walk on! If you fuckin' with Charles Barkley, fuck you too! Yeah, I said it…It's Willie D. H-town. Fifth Ward. Dirty dirty\n\n[Outro]\nWillie D talking\nWhere the coons at\nWhere the coons at\nWhere they at where they at where they at\n(Gunshot)\nWhere the coons at\nWhere the coons at\nWhere they at where they at where they at\n(Gunshot)\nWhere the coons at\nWhere the coons at\nWhere they at where they at where they at\n(Gunshot)\nWhere the coons at\nWhere the coons at\nWhere they at where they at where they at\n(Gunshot; casing hits floor)", "image": "https://s3.amazonaws.com/rapgenius/1362179363_willie-d.jpg", "album": null, "title": "Coon"}]}