{"songs": [{"title": "Nigga What’s Up", "album": "Bred 2 Die Born 2 Live", "year": null, "image": "https://images.genius.com/0ec27b6023fdef052011e493255845b9.900x900x1.jpg", "lyrics": "(50 Cent)\nYeah, it?s 50. Uh huh, Scrappy. It?s the Unit\nAhh nigga what you don?t know, is I ride around with the 44\nGot a lil brown tryin to get some more, who you tryin' to front? I'll let the whistles blow, the whistles blow?\n\nChorus:\nI represent Atlanta, I?m a A-Town rider, I?ll lay a nigga down, (ahh nigga what?s up)\nI ain?t aimin at your legs, I?ma put it to your head, until your brains on the ground (ahh nigga what?s up)\nNigga Trix are for kids niggas out here catchin biz he's got his dick playin around (ahh nigga what?s up)\nShawty gon? keep talking and we talking I?ma put that fuckin gun on your mouth (ahh nigga what?s up)\n\nIt's the prince of the south, back up in me\nWith the tool in my pocket and the A-town fitted\nIf you don?t get love from the A, then you ain?t winnin\nI'm on the ?, butt naked hoes and big boy pimpin\nIn the A, all the niggas they think I be trippin\nCuz I walk with my gun out, prepare for the lickin\nThe young boys stay crunk, them rims be spinnin\nNiggas will jack you for your car, I don?t care what you whippin\nBut I?m gonna tell you like this, I don?t play no games\nI was built for this shit and I can take the pain\nThrough my whole life course I?ve been off the chain\nAnd niggas knew I been broke way before the fame\nI been havin ? thoughts of ? a nigga\nOoo I wish a nigga would, I don?t take that shit\nIf a lot of talkers are less, walkers that?s rich\nMy momma taught me to hit every nigga that act like a bitch\n\nChorus:\nI represent Atlanta, I?m a A-Town rider, I?ll lay a nigga down, (ahh nigga what?s up)\nI ain?t aimin at your legs, I?ma put it to your head, leave your brains on the ground (ahh nigga what?s up)\nNigga ?? kids niggas out here catchin biz I?m the dick playin around (ahh nigga what?s up)\nShawty gon? keep talking and we talking I?ma put that fuckin gun in your mouth (ahh nigga what?s up)\n\nYeah there?s no place like home, there?s no place like home?\n\nSee these streets pay me, I?m a ? baby\nWho better like ?, I don?t care if they like me\nIf I am A, around my way, I?ma rep the A all god damn day\nIt?s Atlanta GA, so watch what you say, that?s where I stay, I be on Cascade\nThe choppers spray, get hit with the K, from a block away, fuckin with me\nZone three is the place to be, where the young niggas will get you got for free\nYou don?t see a crack head getting crunk on tv, and if you don?t believe me, then why don?t you come see? A\n\nChorus:\nI represent Atlanta, I?m a A-Town rider, I?ll lay a nigga down, (ahh nigga what?s up)\nI ain?t aimin at your legs, I?ma put it to your head, leave your brains on the ground (ahh nigga what?s up)\nNigga ?? kids niggas out here catchin biz I?m the dick playin around (ahh nigga what?s up)\nShawty gon? keep talking and we talking I?ma put that fuckin gun in your mouth (ahh nigga what?s up)"}], "artist": "Lil Scrappy"}