{"artist": "Pastor Troy", "songs": [{"album": "D.S.G.B. “I Am D.S.G.B.”", "title": "Pastor Troy 4 President", "image": "https://images.genius.com/8e828ea005780ad0ba81ac237881f31a.639x638x1.jpg", "lyrics": "[Pastor Troy]\n\nI'm the muthafucking president (come on, come on) 3x\nWatch how I represent\n\nVerse 1:\nFrom the land where the constitution stand while niggas stumbling\nWondering, who is gone step up and stop the mumbling?\nWe all complain for better things\nBut who gonna bring the pain to make these muthafuckers shame\nThey weigh\nMy brother taught me that crime pays\nWe run up in another nigga shit with a.k.'s and Mob thirds\nWho gone have the last word?\nYo team or mine\nWhy don't we just rob them crackers blind\nQuit being shine\nMy mind upsets me cause niggas a stress me\nIf yo ass don't wanna be set free\nDon't hinder me\nI can see it from a mile away\nI hate these muthafuckers\nBut I love the game they play\nLike they so innocent\nI know them fucking crackers bent\nCause niggas bent too\nLook at all I been through\nAnd I'm still running\nGrab yo gun and grab yo bullet proof\nBut do not come if you ain't gone put yo shit to use\nCause this a muthafucking war\n\nHook: 4x\nUncle Sam what's yo ransom\nI got yo nieces\nPlease, don't make me blow these ho's to pieces\nCause they increasing\n\nVerse 2:\nUncle Sam what's yo ransom\nTell me what's up\nGot a message for the Pentagon\nYou fucking up\n50 bucks and a canteen\nDogding the trap never will I join the army bitch!\nDon't make me laugh\nIt's war\nMy niggas is burning and giving in\nEither you roll with them or they throw you in the pin\nTo win, was all I ever wanted to do\nWould you do it for me (No)\nThen I can't do it for you\nA soulja buddy, I was born on the base\nUncle Sam want who?, Get the fuck up out my face\nThe case is closed\nI can't be treated like a ho\nNo push-ups, no sit-ups, I tell ya hell no\nI been in the army 22 years to today\nI rock my fatigues, I rock my muthafucking yay\nI sweep on the bump and let it rid e on y'all punks\nThe streets my army and I been ready off the jump\nMuthafuckers I'ma soulja", "year": null}]}