{"artist": "Fat Joe", "songs": [{"year": "2001-12-04", "album": "Jealous Ones Still Envy (J.O.S.E.)", "image": "https://images.genius.com/4a7618aab6a23480b8790a58ffad66c8.1000x1000x1.jpg", "lyrics": "[Buju Banton]\nAny bumbaclart boy feel dem bad try an' test now, it's death!\nCut off dem blood-clot neck and don't give a fuck!\nWhat unu feel like? Unu the king?\n\n[Khalid] Uh-uh.. Saya, Saya!!\n[Saya] What is it Khalid, what is it?\n[Khalid] The original King of New York has returned\nThe King of New York, the Don Cartagena\nJoe Crack, Terror Squad leader!\n(Whoo.. whoo, whoo, whoo, whoo, whoo, whoo!!)\n\n[Fat Joe]\nThe fuck?! What?!\nYeah, mind on my money; money on my mind\nNigga mind on my money; money on my mind\n\nAiyyo, who can test I, the true King of N.Y\nWell ever since Big Boy died from Bed-Stuy\nI've been, controllin the street, holdin the heat\nShit I only want what's stolen from me (Nah you ain't fuckin wit us)\nRollin with me, could only get you fast cars and\nFuck mad bitches and, dine amongst the stars\nBut we gettin mad chave in the life we live\nMTV's comin over just to feel my \"Crib\"\nMan fuck them other kids! That's how I feel\nI thought I said it all in \"He's Not Real\"\nBut you beggin me to kill, must want ya brain spilled\nI tryna keep cool but it's hard to tame still\nShit's still real man you never shoulda bought it\nMust feel ill to see your boss get extorted\nSpecialize in audits and makin hot tapes\nThis rap shit don't cut it then it's back to flippin weight\nMan I'm feelin great (Whoo!) Pushin mad units\nHustlin is the key to success but could you do it\nI been layin it down, the spray and the town\nIt's about time the rightful owner claimed his crown\n\n[Hook: Buju Banton + Fat Joe]\n[BB] Who the fuck you know be fuckin with this?!\nAs Big Pun's knowin you'll be givin a shit!\n[FJ] Not a damn soul! I let you know from the get go!\nWanna war with the Squad, walk through the threshold!\n[BB] Who the fuck you know be fuckin with this?!\nAs Big Pun's knowin you'll be givin a shit!\n[FJ] Not any squad or clique can squab with this!\nShit I'm O.G. nigga y'all know how this is!\n\n[Fat Joe]\nHey yo, it's all over, I want a piece of the pie\nNigga hand it over or all your seeds gon' die\nAnd it don't take much for me to kidnap a DJ\nOr clap at ya truck while you ridin through the freeway\nShit is mad ea-say to wet you up\nBetta, watch yo' bitch and who's dick she sucked\nShe gon', set you up, I been to the crib\nI don't know why you surprised bitches love the kid\nI'm more realer than the way you act\nA born killer quick to wave the mack\nAnd all you niggas gotta face the fact\nI pop shit cuz you can't stop me\nMore rich cuz they can't rob me\nI plant clips at ya fam's lobby\nJoe the Don and you been warned\nBut niggas never wanna listen till they kin's gone\nNow you wanna get it on cuz ya dollars stack\nNow how you plan to holla back with a hollow back?\nJoey Crack and I be the truth\nDon't believe that's the streets till proof\nAsk the deez how my Eagle blew\nBetchu sayin, \"Damn, what we did to duke?!\"\nBetter gather them young'ns and hope you make it through\n\n[Hook] 2x\n\nThe Don is the King of New York..\nThe Don is the King of New York...", "title": "King of N.Y."}]}