{"songs": [{"year": null, "image": "https://images.genius.com/321acbbfeab9cad5fa5d8ce42d8794aa.1000x1000x1.jpg", "title": "Zone Out", "album": "Fat Boy Fresh, Vol. 1: For Members Only", "lyrics": "[Intro]\n\"Keep it locked inside, keep it just between us\nKeep it secret, never confide, until they all have seen us\"\n\nYeah, smoke something\nDrink something, zone out\n(\"One two\")\n\n[Verse 1]\nZone out, ain't no need to pull a chrome out\nUnless we talking 'bout them wheels, homie roll up\nYou see 'em checking out the whip, let me slow up\nEy that's my nigga over there, better throw it up\nR.I.P. to dead homies so I pour it up\nSee me in some new shit, keep 'em throwing up\nSo what I ain't the best by your best standard\nStill living my life just how I planned it\nStill rough around the edges, fuck 'em, why sand it?\nLike to stick 'em in they sides 'til they can't stand it\nDon't respond to wannabees, you can all can it\nIn the net, like the flames so they try to fan it\nThis is more candid, liver than the interviews\nOther people spin your words like a centrifuge\nI ain't into feuds, or a rap beef\nThese ain't your real friends, nigga they just showing teeth\n\n[Hook]\n{\"One two\"}\n{\"Puff the lah, relaxin\"}\n{\"You gots to chill\"}\n{\"Slow down\"}\n\n[Verse 2]\nKick back, put my feet up on the glass table\nLil' liquor in the cup, watch a lil' cable\nWatching people get jobs and they ain't able\nTo perform cause they really ain't qualified\nBlack people got a proplem, we don't swallow pride\nForget asking for ya help, yo we rather slide\nBackslide, now we out showing our backside\nBacked us into a corner that we try and hide\nIt's the beats and these words which I confide\nLet the rhythm of my voice take me for a ride\nAnd zone out, ain't no need to pull a chrome out\nUnless we talking 'bout them wheels, time to roll out\nAnd if your credit like mine, pull a fold out\nYou in the back of the line, we been sold out\nNobody got enough talent to be a hold-out\nAnd if the pressure too much, go another route\n\n[Hook]\n\n[Verse 3]\nZone out, ain't no need to pull a chrome out\nUnless we talking 'bout them wheels, seat lean back\nLil' space between the wheels, yeah I need that\nI see 'em laughing at the car, pointing, \"He's fat\"\nWell you're right, say it twice, yeah I need that\nJust a lil' inspiration and you feed that\nMorning sign been posted, better heed that\nTrying to follow the lead, check where we at\n\n[Hook]"}], "artist": "Rapper Big Pooh"}