{"artist": "R.A. The Rugged Man", "songs": [{"album": null, "year": null, "lyrics": "Call me Thorburn, John A., Staff Sergeant\nMarksman, skilled in killin', illin', I'm able and willin'\nKill a village elephant, rapin' and pillage a village\nIllegitimate killers, U.S. Military guerrillas\nThis ain't no real war, Vietnam shit\nWorld War II, that's a war, this is just a military conflict\nSoothin' drug abusin', Vietnamese women screwin'\nSex, gamblin' and boozin' — all this shit is amusin'\nBitches and guns, this is every man's dream\nI don't wanna go home where I'm just an ordinary human being\nSpecial Op, Huey chopper gun ship, run shit\nGook run when the minigun spit, won't miss\nKill shit, spit four-thousand bullets a minute\nVictor Charlie, hair-trigger, hit it, I'm in it to win it\nGet it, the lieutenant hinted, the villain, I been it\nThe killin', I did it, cripple, did it\nPictures I painted is vivid, live it\nA wizard with weapons: the secret mission, we 'bout to begin it\nGovernment funded, behind enemy lines\nBullets is sprayin', it's heatin' up a hundred degrees\nThe enemy's the North Vietnamese, bitch please!\nAin't no sweat, I'm totally at ease\nUntil I see the pilot got hit, and we 'bout to hit some trees\nTail rotor broke, crash land\nAmerican man in Cambodia, right in the enemy hand\nTake a swig of the Whiskey to calm us\nThem yellow men wearin' black pajamas\nThey wanna harm us, they all up on us\nBang bang, bullet hit my chest, feel no pain\nTo my left, the Captain caught a bullet right in his brain\nBody parts flyin', loss of limbs, explosions\nBad intentions, I see my best friend's intestines\nPray to the one above, it's rainin', I'm covered in mud\nI think I'm dyin', I feel dizzy, I'm losin' blood\nI see my childhood, I'm back in the arms of my mother\nI see my whole life, I see Christ, I see bright lights\nI see Israelites, Muslims and Christians at peace, no fights\nBlack, Whites, Asians, people of all types\nI must've died, then I woke up, surprised I'm alive\nI'm in a hospital bed, they rescued me, I survived\nI escaped the war, came back\nBut ain't escape Agent Orange: two of my kids born handicapped\nSpastic, quadriplegia, micro cephalic\nCerebral palsy, cortical blindness — name it, they had it\nMy son died, he ain't live\nBut I still try to think positive, ‘cause in life, God take, God give", "title": "Uncommon Valor (R.A. the Rugged Man’s Verse Only)", "image": "https://images.genius.com/8fff7f98b3275b4fa6a6a43f01159e31.899x899x1.jpg"}]}