{"songs": [{"year": "2007-11-13", "title": "Saigon Meets Just Blaze", "image": "https://images.genius.com/957f0d0a594a246a123db431c7990d2a.1000x1000x1.jpg", "lyrics": "[Intro]\n[Just Blaze]\nSound so beautiful, ladies and gentlemen.  I go by the name of Just Blaze.  Uh oh!\n[Saigon]\nThank you, thank you.  I appreciate the love.  Thank you very much.  But we gonna get into this shit real quick.  Check, check it.  Check me out\n\n[Verse 1 – Saigon]\nYou could get your body hurt badly in an hour\nY’all niggas sing like Mariah Carey in the shower\nOr Eddie King Jr. before the brain tumor\nLyrically, Sai nasty as a crack fiend bloomer\nI flow with a glisten and glow.  I’m positioned to blow\nKnow I'm bout getting some dough, I’m dismissin’ a ho\nKnow I’m conditioned to go.  Fo’ plus fo’ mo’\nKnow that my biscuit’ll blow—that I did it befo’\nAnd this is real talk—not no fake shit\nI rhyme with such a complexity—y’all so basic\nA true song from you would go, “I don’t make sense\nAnd me and none of my niggas is not no gangsters.”\nBut I was a prisoner though\nI let six of ‘em go.  Know that I’m sick with the flow\nKnow I don’t stick with the po’.  Know that I kick in your do'\nI get bricks to your blow.  Know that my niggas’ll go “Boom!  Boom!”\n\n[Interlude]\nThat’s that Just Blaze right there!  That that Just Blaze!  Do it!  This a monster, man…\n\n[Verse 2 – Saigon]\nYou could bring all of your brethren—niggas is cowards\nThe bullet’ll be the plane and yo’ frame is gon’ be the towers\nThe similarities’ll be the flowers\nThe difference: you fell in a couple of seconds instead of a couple hours\nThug or political flow.  I’m a lyrical pro\nKnow niggas be bitin’, but you know I’m original, though\nKnow I’m conditioned to go.  Fo’ plus fo’ mo’\nKnow that yo’ bitch is a ho.  (How you know?)  I done hit it befo’\n(Shiet…)  And this is real hawk—not no play shit\nA flow with a futuristicness—y’all so ancient\nA true song from you would go, “I don’t break bricks\nI never bust gats and I don’t got cases.”\nBut I was a prisoner though\nI was beaten, but oh.  Know I was getting the snow\nDown on the visiting floor.  Know I’m predicted to go\nGold out this muhfucka\nKnowing my clique in the show is ridiculous, yo\n\n[Outro]\nYea!  Greatest Story Never Told, man…", "album": "The Moral of the Story"}], "artist": "Saigon"}