{"songs": [{"year": null, "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "World Be Free", "lyrics": "Intro:\nAnnouncer: Can I have your attention please?\nKeith: On my way to JFK\nAnnouncer: Final boarding for flight 655 at Gate 14\nKeith: I don't want of ya\nI'm on my way to LaGaurdia\nI'm on my way home or away, JFK (2x)\n\nHey yo, anywhere I go I definately reo for mine\nCause I'm constantly in a Def Squad state of mind\nI went to New Orleans and kept it clean\nSpitting, splitting rappers at they seams for the cream\nBy all means\nAlthough I seen the green wasn't enough\nI jumped in the Lexus, went to Texas, pulled a royal flush\nFeelin like Tony Atlas, up in Dallas\nRhymacutin with them niggas who be shootin up in Houston\nAnd do remember I get in ya in Virginia\nSwept N.C. and S.C freeze the West Indies\nOh and I'm going back to Indiana and Alabama\nDid the ink pad bounce through Atlanta\nI be rapidly runnin through chocolate cities\nLike Philly, D.C., Cincinnati, and M.D\nAnd Jersey, Lord have mercy\nCan't nobody serve me cause my world be free\n\nCHORUS:\nGoin around the world, goin around the world\nAll around the world, goin around the world\nGoin around the world cause my world be free\nGoin around the world (3x)\n\nCause my world be free\nThen I was touching ground Uptown\nAs my rings gleamed in Queens\nAs I cooked it up in Brooklyn for all the friends\nKentucky was lucky I had to much Hennessey\nWhen I was representing love love Tenessee\nKansas City, Missouri can speak upon the glory\nSt. Louis can even tell the story\nOf how I dropp shit thick and cold like the snow in Chicago\nA major up in Ohio, I was pack with cactus tactics\nUp in Phoenix, Arizona set shit on fire in Oklahoma\nNiggas had their ears pinned to the ground listening\nWhen I was stomping through Detroit, Michigan\nYou hear me sounding crispy looking all scandalous\nSwervin in the streets of San Francisco and Los Angeles\nDon't even ask the question did I visit Africa\nShit I warmed it up in Alaska, smashed Nebraska\n\nCHORUS (3x)\n\nFrom interstate to tri-state to international\nMr. Keith Murray always keeps it classical\nThey had me up in England, mic stranglin\nJewels danglin while my single jingle jangling\nNumber one in my field, never defeated\nWent to Sweden demonstrated malicious mic beatings\nI was with my right hand man, Redman\nWhen I did the Ichiban crane style in Japan\nI transform like Dr. Bruce Banner\nStepped off the plane and blacked out up in Canada\nI'm a million dollar man like Lee Majors\nFucked around and hit the jackpot up in Vegas\nYeah handin out vapors like bad news\nYo I be everywhere puttin down y'all\nIt's Def Squad y'all know my plans"}], "artist": "Keith Murray"}