{"songs": [{"lyrics": "One day when I was ridin on the train I seen these two kids talkin\nAbout the (Roc-A-Fella) had fallen (YEAH!)\nOne day when I was ridin on the train I seen these two kids talkin\nAbout the (Roc-A-Fella) had fallen (YEAH! Roc-A-Fella y'all! OWWW!)\n{EAST NEW YORK! }\nBefore Stack Bundles died he said I was the new version of Biggie\nB.I.G. tell Stacks he wasn't lyin I really get busy (You heard Diddy? !)\nI be listenin like damn I said that? !\nI should be a millionaire where the f*ck is the bread at? ! (Where the money?)\nCome on niggas come up to me and say\nYou should have signed to 50 instead of signin with Jay (WORD!)\nMan I got six figures from Jay I'm straight\nYou little groupie ass niggas get the f*ck out my face! (UHHHHH!)\nChris Lighty told me to tell y'all get off my dick\nI'm connected how y'all know I ain't f*ckin with Fif? ! (G-G-G-G-G)\nHustlers holla at me like, whattup Murd?\nI heard you got it but you overchargin niggas for that work (I AM!)\nYou get it for the low low but your prices is WOOO!\n(It's about to be higher!)\nI'm like yeah that's the motherf*ckin TRUTH! (But it's fire!)\nShit you know where I gotta go to get it\nI be feelin like Frank Lucas before he started snitchin\nHe asked for it his man saw it so it don't mean shit to me\nHe's gone, and that's how it supposed to be\nCheck it out now! (I get away with mur-mur-murda!)\nHe asked for it his man saw it so it don't mean shit to me\nHe's gone, and that's how it supposed to be\nCheck it out now! (I get away with mur-mur-murda!)\nLet's do this...\nYes, gangsta, gangsta, how y'all wanna do this?\nI clap niggas down for yappin off follish\nAin't no stoppin this Roc-A-Fella movement\nThe name is Jay Guevara, homie, who are you and\nYour offbeat DJ? If anything he play, sound familiar\nI'll wait 'til Pharrell say, (\"Lame... \")\nNow I have to diss you, Joe\nYou can get a smack for that, matter of fact\nThe gats are blown, the natural like Roy Harve'\nThe boy hard, your Toy Squad'll get squashed, BOY!\nYardee, y'all be lost in the source\nPartly because y'all boss ain't a leader\nHe's a follower, (NO!) no, I'm not coppin ya\nAlbum or your single, you likely to go coppa\nThe coke coppa, the quick K cooker\nSadat X like Master P, bring the hook up\nHe asked for it his man saw it so it don't mean shit to me\nHe's gone, and that's how it supposed to be\nCheck it out now! (I get away with mur-mur-murda!)\nHe asked for it his man saw it so it don't mean shit to me\nHe's gone, and that's how it supposed to be\nCheck it out now! (I get away with mur-mur-murda!)", "title": "He Asked For It", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}