{"artist": "Z-Ro", "songs": [{"album": "Cocaine", "title": "Bring My Mail", "lyrics": "[Talking:]\nThat's right nigga, King of the Ghetto in this. Check it out\n\n[Verse 1]\nI'd like to thank my fans, for all the love mail and the hate mail\nEvery time I was in jail, an the judge didn't let me make bail\nThe prosecutor gave me my time, and laughed in my face\nCause he knows I'm goin' from first to last place\nSo I'm makin out another commissary list\nStamped envelopes, soups, oatmeal and tuna fish\nSoda, candy, cool offs, coffee is as close to codeine as I can get it\nHopin this weekend I get another visit\nBut I ain't stressin I'm just countin down weeks\nPoppin muscle relaxers so I'm always sleep\nThe warden want the CO's to catch me slippin\nBut they ain't trippin\nSo they bringin me burgers and barbecue chicken\nSome of them love me, some of them they can't stand me\nProbably cause I'm rich and in the world I ride candy\nThey think they put me through hell\nBut I can't tell\nIt don't matter what they do as long as they bring my mail\n\n[Hook]\nBring my maaaaaiiiillll, bring my mail. My mail. (My mail, my mail, my mail)\nYou can bring my maaaaaiiiillll, bring my mail. My mail. (My mail, my mail, my mail.)\n\n[Verse 2]\nAin't nothin on the TV but Jerry Springer\nAnd the sexy guard in the picket, but the windows are tinted so you can barely see her\nI really hope they call rec in a sec\nOtherwise work out a lil bit or try to get a channel check\nCertain officers try to give me a hard time\nAnd the GI's watching tryin to catch me throwin up gang signs\nFor no reason at all, they constantly harrass me\nTryin to get me to lose my temper, so they can gas me\nIt's funny\nCause I got so much pride they can't take none of it from me\nThey just mad cause they ain't makin enough money\nAnd still gotta work on holidays, all day and night\nTakin it out on me, cause I'm in all white\nBut it's all right I just lay back\nWhen I get out I'd love to see they faces when I peel out in my Maybach\nMeanwhile I can't even tell I'm in jail\nCause I'm doin swell\nY'all can kiss my ass on the way to bring my mail\n\n[Hook]\nBring my maaaaaiiiillll, bring my mail. My mail. (My mail, my mail, my mail)\nYou can bring my maaaaaiiiillll, bring my mail. My mail. (My mail, my mail, my mail.)\n\n[Verse 3]\nI'm usually out eatin for the holidays, but instead\nI be sharin meat packs and noodles with my cellies and we fed\nCause we're two gun runnin homies, gettin hit up\nDrinkin hooch till we fall off and it's hard to get up\nBut there's always one that wanna ruin it\nYou know the one that's always pointin fingers, he the one that be doin it\nRunnin off at the mouth but ain't man enough to repeat it to the ranks\nSo they takin both the TV's out the tank\nNo necessities either, but we can wash our own clothes\nBut somebody gon' get slit if we don't get to watch the Super Bowl\nI don't even look at television in the world\nSo I'm good I'll write a rap or write a couple of girls\nOr read me a book to put some fat on my brain\nBefore I come back to prison they'll have to murder me mayn\nMy in and out the jailhouse gotta stop\nBut in the meantime I gotta see how many new pictures I got\nBring my mail\n\n[Hook]\nBring my maaaaaiiiillll, bring my mail. My mail. (My mail, my mail, my mail)\nYou can bring my maaaaaiiiillll, bring my mail. My mail. (My mail, my mail, my mail.)", "year": null, "image": "https://images.genius.com/e2ffc8099acf82f0cda021f13e4a16ff.1000x999x1.jpg"}]}