{"songs": [{"lyrics": "[Intro: Jay-Z & Beyoncé]\nIt ain't for everybody! (Uhh)\nWelcome to Hollywood, baby (take a picture)\nUh-huh, you coming with? (Let's not even talk about it)\nLet's do it (let's go) uh-huh\n\n[Pre-Hook: Beyoncé & Jay-Z]\nI see your jealousy as you watching (I see you watching me, baby)\nYou watching (it's all good)\nIt's kinda sexy to me how you watching (I love it)\nYou watching (uh-huh, come on)\nI see your face (I see your face)\nYou wanna touch it (you wanna touch it)\nCome to my place (come to the crib)\nAnd let's discuss it (let's chop it up)\nTonight you'll be, a superstar\nTonight you gonna be a superstar, baby\nCome let me sign you up (let's get into it)\n\n[Hook: Beyoncé & Jay-Z]\nOoh it's the lights\nYou blinded by the (action!)\nYou need that (Hollywood!)\nAh, ah, ah, ah, come on\nOoh it's the lights\nYou blinded by the (satisfaction!)\nYou need that (Hollywood)\nAh, ah, ah, ah, come on\n\n[Verse 1: Jay-Z]\nPaparazzi spots me in the lobby of my high-rise\nI hide behind my shades cause the fame is blinding my eyes\nMy God, I know how Ozzie Oz\nOnce had felt when he was as high as I have got\nI have got to make this stop\nPeople often warn me that the fame ain't for the faint of heart\nIt'll change those who said they had love for you into strangers\nWhen your fame starts, it's a chain reaction\nLocomotion like when the train departs\nStranger, things have happened\nRapping, stacking, platinum plaquin'\nBorn in Brooklyn, got a place in Manhattan\nGoing back to Brooklyn to escape the madness\nWhen your friends is, Chris and Gwyneth\nWhen your girl is more famous than you then it's\nTime to get all your windows tinted\nKeep your eyes squinted, it's gon' flash any minute\nThe music biz is like musical chairs\nIt's about where you standing when the music stop spinning\n\n[Hook: Beyoncé & Jay-Z]\nOoh it's the lights\nYou blinded by the (action!)\nYou need that (Hollywood!)\nAh, ah, ah, ah, come on\nOoh it's the lights\nYou blinded by the (satisfaction!)\nYou need that (Hollywood)\nAh, ah, ah, ah, come on\n\n[Post-Hook: Beyoncé & Jay-Z]\nYou got to get it (oh oh oh oh, oh oh oh)\nDo you want it? (Oh oh oh oh, oh oh oh)\nBut you don't need it (oh oh oh oh, oh oh oh)\nWhat do you do? Oh oh oh oh\nNow that you got what you want\nWhat do you do? Oh oh oh, hey\nOh you want more?\n\n[Verse 2: Jay-Z]\nHey mister, pay six-a, a list-a, you're in the mist of\nThe ride of your life but you gotta keep them hits up\nCan't put your guard down, gotta keep your mitts up\nTake a sip, sir, it's so intoxicating, ain't it?\nTry not to get jaded, Hollywood's been good to ya\nStartin' feel like buzz to ya, don't lie\nGon' fly, you addicted to the lights\nWithout the fame how you gon' survive\nIt's like living on heroin, you so high\n\n[Bridge: Beyoncé & Jay-Z]\nAnd everybody warning you about it (I tried to told you)\nAnd once you taste, you can't live without it (it's addictive)\nNot cause you choose to not live without it\nYou sure you want this, baby?\nIt's now a part of you, it's now a part of you (it's a part of you)\nAnd everybody warning you about it\nI see you changed, I see you blinded\nAnd once you taste you can't live\n\n[Hook: Beyoncé & Jay-Z]\nOoh it's the lights\nYou blinded by the (action!)\nYou need that (Hollywood!)\nAh, ah, ah, ah, come on\nOoh it's the lights\nYou blinded by the (satisfaction!)\nYou need that (Hollywood)\nAh, ah, ah, ah, come on\n\n[Verse 3: Jay-Z]\nWanna be seen, male groupies\nNow you've become what you once despised\nJames Dean, John Belushi\nBlow your whole life tryna live in the lights\nHeroins following Marilyn\nHoppin' over the edge just like Janis Joplin\nRiver Phoenix, Jimi Hendrix\nJimmy Morrison, all of them ended by\nHollywood, thank God for Hollywood\nHollywood, sure you want this baby?\n\n[Outro: Jay-Z]\nHollywood\nIt's the most addicted drug in the world\nWant the fame? You want the lights?\nHahaha", "title": "Hollywood", "image": "https://images.genius.com/99f21c63f818e07d09a79b7ee1b63300.300x300x1.png", "year": "2006-11-21", "album": "Kingdom Come"}], "artist": "JAY-Z"}