{"songs": [{"lyrics": "[Hook: Afu-Ra]\nI just wanna ride with you\nI just wanna ride with you\nI just wanna roll with you\n\n[Chorus: Afu-Ra]\nHey hey, hey, we light it up everyday\nAnd always seem to go when something fresh to say\nHey hey hey, hey we light it up everyday\nI'm talking what you talking, are you going my way?\nHey hey, hey, we light it up everyday\nI'm talking what you talking, are you going my way?\nHey hey, hey, we light it up everyday\nAnd always seem to come when something fresh to say\n\n[Afu-Ra]\nLook at me now, I'm on the come up, done up, what up, what up\nNow we can build all night, until the sun'll come up\nHave some of the raps yea, we blaze and blazin'\nTil my eyes roll back in my head, I feel amazing\n\n[Chorus: Afu-Ra]]\nHey hey, hey, we light it up everyday\nI'm talking what you talking, are you going my way?\nHey hey, hey, we light it up everyday\nAnd always seem to come when something fresh to say\n\n[Hook: Afu-Ra]\nI just wanna ride with you\nI just wanna ride with you\nI just wanna roll with you\nAnd only you, I\n\n[Afu-Ra]\nThat's right, purple haze, white widow, yeah, get me settled\nI burn pirates in my head, hit the grittle, hello\nThen talk about trees, so long, I put it in a song\nSmoking a bong, like Cheech and Chong, that's right\nWe bubble it up, we bubbling up\nAnd all my hydro home girls, aiyo, y'all know what's up\nAnd all my fellas that's risen, y'all play the backwoods\nGet your head right, come on, y'all know it's good\n\n[Hook]\n\n[Chorus]\n\n[Hook]\n\n[Afu-Ra]\nIf you like your bats fat and your blunts real long\nLet's get it on, let's get it on, let's get it on\nI like my bags real fat, and my spliff's real long\nLet's get it on, let's get it on, let's get it on\nDon't you like your bags fat, and your spliff real long?\nLet's get it on, let's get it on, let's get it on\nI like my bats real thick, and my blunts real long\nLet's get it on, let's get it on, let's get it on\n\n[Chorus 2x]", "title": "Only U", "album": "State of the Arts", "image": "https://images.genius.com/6641519bda508e451130d48bde3b5fe7.480x483x1.gif", "year": "2005-07-01"}], "artist": "Afu-Ra"}