{"artist": "Ace Hood", "songs": [{"title": "Mr. Black Man", "album": "Starvation 5", "year": "2016-07-11", "lyrics": "[Hook : Ace Hood]\nHey, Mr. Black Man living in America\nWe can never let these motherfuckers bury us\nEmbarrass us\nHey, Mr. Black Man living in America (hey)\nHey, Mr. Black Man living in America (hey)\n\n\n[Verse 1: Ace Hood]\nWoke up in the morning thanked the Lord for seeing another day\nShould I sell dope or figure shit out in another way\nTryna keep my faith but see the devil from a mile away\nBills are piling, momma just complaining bout them everyday\nGetting sick and tired , tears are running down her eyes\nOnly thing that's on my mind, I just got to fucking grind\nLike ain't got shit to lose, I got so more shit to prove\nHit my plug and make some moves or finess them with that tool\nThis is me and daddy shoot, that's what they want us to do\nSystem set so we can lose, just depends on what you choose\nGrab that chopper, shoot that block up you gon end up on the news\nRather fill yourself up with knowledge that's that power we refuse\nPrisons over populated cause we dropping outta school\nLet 'em tell it we uneducated , life a devastation\nAll our actions are not validated, police agitated\nShoot us up then go home and kiss their babies\nShit so fucking crazy\nI apologize to every single person that we lost\nFrom a stupid motherfucker who think they above the law\nGot me screaming fuck the cops , make me wanna squeeze the Glock\nSend my love out to the block ain't no way will I be stopped\nAin't no way we looking back\nThose opinions these are facts\nYou don't feel me you just wack\nNow tell me how real is that ?\nBut in the mind of a nigga in the ghetto tryna make it\nThat trouble seems to find a nigga it's so hard to shake it\nSay a prayer for my niggas still in it\nI know it's hard and they just tryna make a living\nTryna feed the fam like it's Thanksgiving\nEveryday a nigga praying for forgiveness\nThe penitentiary's a billion dollar business\nAnd I will never let you trick me in the system\n\n[Hook:]\nOh, Mr. Black Man living in America\nPlease don't never let these motherfuckers bury us\nEmbarrass us\nHey, Mr. Black Man living in America\nWe can never let these motherfuckers bury us\nWe can never let these motherfuckers bury us\n\n[Pre Hook:]\nOk, I pour another cup and roll and endo\nRolling 'round the city with extendos\nThey can't stop staring out the window\nThey just tired of burying they kin folk\nI say the police out shooting, it's a cold world\nWhat if one day that's your son or your little girl ?\n\n[Hook:]\nHey, Mr. Black man living in America\nWe can never let these motherfuckers bury us\nEmbarrass us\nI know the system is against a guy that's smart enough\nHey, Mr. Black Man living in America\nWe will never let these motherfuckers bury us\nEmbarrass us\nHey, Mr. Black Man living in America\nHey, Mr. Black Man living in America\nEmbarrass us", "image": "https://images.genius.com/002c1ec02431344405111a1007c5307c.800x800x1.jpg"}]}