{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/7b848bb2c03176f196fbd8167b10284f.1000x1000x1.jpg", "title": "Rise Up", "year": "2002-07-01", "album": "Collaborations", "lyrics": "[Hook]\nRise up, lift your eyes up\nGet up, stand up, throw your hands up\n[x3]\n\n[Verse 1: KJ-52]\nSick of all the lies, sick of the compromise\nSick of the way we live our lives and run and hide\nSick of the times we turn our head, close our eyes\nCan you hear the cries when you gonna rise?\nStand up, my people in the place, where you at?\nStand up, God's people who ain't ashamed, where you at?\nStand up, if you say you know His name, where you at?\nStand up, 'cause you gotta proclaim what you have\nRise up, no more hiding, no time for crying\nAnd you can't be the light of the world when you ain't shining\nStraight rhyming so you'll be straight recognizing\nYou ain't trying you just sitting there straight whining\nWhile the whole world around you just straight dying\nSo keep in mind Jesus, Lion of Zion\nHe gave his life, so you and I wouldn't be frying\nQuit hiding, it's time for you to start rising\n\n[Hook]\n\n[Verse 2: KJ-52]\nYo, yo, to all my real live people in the spot now\nRise up let me see what you got now\nWe blowing holes in your speakers when we rock now\nWe keep it hot now, every time we rock towns\nThat's how we got down, every time we drop sounds\nSo you know you better listen when I talk now\nCause we never stop now, or let your guard down\nCause if you got the answer, why keep it locked down?\n\n[Verse 3: Rob Beckley]\nHow many people want to see this rock now?\nGo bump it in your trunk, rolling with the top down\nHold on, cause I'm letting the missile drop now\nNo hostages, cause we're taking your whole block down\nYo, we hot but not tropic in the mall\nMight catch me in a hot topic\nWe can talk if somebody wanna knock it\nWe coming at dangerous speeds, you can't stop it\n\n[Hook]\n\n[Bridge]\nCome on, my people where you at is a spine\nGet off, come on, right now\nEverybody, now I say come on\n\n[Hook x2]"}]}