{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/0f5966cdd789dfc9a6064762362f99e0.600x600x1.jpg", "title": "First Date", "lyrics": "[Intro - 50 Cent]\nJust one night, tonight\nIt could be three of us\nYeh yeh yeh\nGirl, we could get it on\n(Where ya' girlfriend)\nGirl, we can have a ball\n(Bring ya' girlfriend)\nLife's too short to not fuck on the first date\nNo one knows if we're promised tomorrow\nBut if we make love until the next day\nWe'll have the rest of our time to celebrate\n\n[Verse 1 - 50 Cent]\nFour in the morning girl, now I don't wanna talk\nWe've been talking for hours, now you know I wanna fuck\nLook I don't understand what it is you don't understand\nMy watch a hundred grand, my chain a hundred grand\nBitch, I'm a wanted man, I say I run New York\nCause I do what the fuck I wanna do, they know wussup\nThey say my screws are loose, I say who cares, you know I'm rich\nLook I don't have time to blow with a bitch shooting the shit\nNow maybe you can loosen up and let me go to work\nSo I can whisper in your ear while pulling down your skirt\nWhen I get the stroking girl you don't know what to say\nQuick come quick, girl, I'm gone right away\nYeh, you nasty, girl, you nasty\nAnd I'm into that, so get at me!\n\n[Hook - 50 Cent]\nI don't want no good, good, good, good, girl\nMe, I want a nasty girl\nCome creep with me, be a freak for me\nLife's too short to not fuck on the first date\nNo one knows if we're promised tomorrow\nBut if we make love until the next day\nWe'll have the rest of our time to celebrate\n\n[Verse 2 - Too Short]\nI said bitch, I wanna fuck you in the worst way\nHell yeah, I wanna fuck you on the first date\nIf I don't, I say, fuck you on Thursday\nCause then I won't want you, watch how fast I dump you\nBut right now I'm infatuated\nYou get to hang with me, girl, you graduated\nI take you out for drinks and get you tipsy\nThen I pull my dick out and I say kiss me\nYou're about to laugh ya little panties off\nYou only get one date, you better grab these balls\nThey wanna ride in fancy cars\nThat's what bitches do\nThey like to rub it then suck it and lick it too\nShe's a nasty little trap ho slut\nBut I like that shit, so let's fuck\nBitch!\n\n[Hook - 50 Cent]\n\n[Outro - 50 Cent (+ Too Short)]\nOhhh, ehhhh\nIt sounds crazy\nBut tomorrow's not promised\nI mean, I mean I wanna do it today\nI want it now\nI don't wanna wait\nWait for what?\nMy time's running out\nYour time's running out\nCome here girl\n(Wanna fuck you bitch\nI wanna fuck you bitch\nYou only got\nOne date\nAin't no tomorrow)", "year": null}]}