{"songs": [{"album": null, "year": null, "title": "Get Free Coleworld", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1: J.Cole]\nStrictly for the survivors\nThe 800 number dodgers\nBoy, what I tell ya ass bout picking up that phone\nWhen the number unknown\nTell them people I ain't home\nHalf black learning white lies\nNiggas broke her heart now she trying white guys\nToo ashamed to bring him 'round cause her homegirls’ll clown like\n“Girl I ain't know you like ‘em bite size\"\nShe embarrassed now\nOn edge cause she gotta meet his parents now\nThey probably think I’m no good for ‘em\nToo dark, too thick, too hood for ‘em\nNow she sitting at the dinner table wondering what I’m doing here\nThey got me feeling like a job interview in here\nThey asking questions about her 5 year plan\nShe saying “who I’m fooling, they could never understand”\nThey could never understand\n\n[Chorus: Amber of Dirty Projectors]\nLook at me\nI Just can’t believe\nWhat they've done to me\nWe could never get free\nI just wanna be (I just wanna be)\nLook at me\nI Just can’t believe\nWhat they've done to me\nWe could never get free\nI just wanna be\nI just wanna dream\n\n[Verse 2: J.Cole]\n(Fuck is that smell)\nI smell bullshit, it must be an election year\nThe more I listen man the more you sound less sincere\nStill I’m watching CNN tryna keep up\nIn my interviews maybe I should speak up\nTell the world how I feel like you lying all the time\nAnd keep ‘em niggas walking 'round blind all the time\nBut the same niggas think I’m fucking dimes all the time\nLike I'm walking round with money on my mind all the time\nAnd I feed into it\nI’d rather make tracks where I bleed into it\nThe single's only the look to sell these niggas the book\nI can only pray that one day you’ll read into it\nIf not, fuck it, I got my own problems\nFuck ya beats nigga I produce my own albums\nI zone out that old sound that I've grown out of\nWas born out of being broke with hope\nBut it don’t matter I’m on Saturn now and I won’t shatter\nAs long as this blood grows in my bone marrow I’m gonna gather my thoughts\nAs sharp as a bow and arrow\nBack when I had no dough and no apparel\nMy flow’s thorough, now I’m more aware of all the perils a nigga face\nLoaded pistols with nickle plates is a nigga fate\nAnd why they call this shit a race\nThe agony of defeat, wish the elite could get a taste\n\n[Chorus: Amber of Dirty Projectors]\nLook at me\nI Just can’t believe\nWhat they've done to me\nWe could never get free\nI just wanna be (I just wanna be)\nLook at me\nI Just can’t believe\nWhat they've done to me\nWe could never get free\nI just wanna be\nI just wanna dream\n\n[Bridge: Amber of Dirty Projectors]\nWe’re all together in the same boat\nI know you, you know me\nBaby, you know me\nWe’re all together in the same boat\nI know you, you know me\nBaby, you know me\nWe’re all together in the same boat\nI know you, you know me\nBaby, you know me\nI Just wanna dream\nI Just wanna dream\nI Just wanna dream\nBaby, you know me\n\n[Outro: 2Pac]\nDon't support the Phoneys,Support the real\nYou know what I mean?\nHow can these people be talkin about how they so real\nAnd they don't care about our communities?\nHow can they be talkin about how they're all this you know\nThe hood and blah blah they don't care about the communities?\nYou know what I mean? Listen to the words they have in their lyrics\nAnd tell me is that some real shit\nAnd if that's real shit to you\nYou know what I mean? Listen to what they're saying to you\nDon't just bob your head to the beat peep the game\nAnd listen to what I'm saying & hold us accountable for it"}], "artist": "J. Cole"}