{"songs": [{"image": "https://images.genius.com/88ec3c681c282bee52d73da4d8bfcde9.512x512x1.jpg", "lyrics": "Let's talk about it, got a issue\nMaybe we should talk about it\nCan't ignore it\nMan, I can't walk around it\nGrab a drink with me at a bar that's not too crowded\nGot a issue, no I don't, I got 2000\nNo I don't, I got 360\nThink about my god damned life while I'm walking in a circle\nChugging some whiskey\n\nLife is just another circle, friends and lovers that'll hurt you\nPain, agony, stress and death and a bunch of good feelings\nIn a rut about commercials, stories with a twist\nYou're for a young bliss\n\nIt's the circle of our lives\nYou're got young people feeling like they're 30 when they're five\nAnd old people that are in their forties feeling six\nI'm nice. Whoo!\nRecently I'm hearing lots of people try to say that I am undeserving of the fucking accolades I'm getting\nSo I tell these stupid motherfuckers if they do not like it, sorry baby, just don't listen\nThat's life!\nAnd life is beautiful. And that there is the truest story\nI don't understand suicide, I could never kill myself\nEventually my stress will do that for me\nSo fuck y'all\nKnuckle up and brawl\nDrank a little Jameson, got drunker by the bar\nNow it’s numbing up my jaw, I’m untucking my gun and just fuckin busting at you all\nBasic pumping and dumping, the truth underneath it all there’s a victim\nAnd the person that can fix it is standing where the mirror is\nWhen I die wrap me up in gold leaves and\nAnd bury my body underneath a pyramid\n\nI wish there was a button that I could press to erase my bad memories of my regrets\nI wish there was a button that I could press to erase my bad memories of my regrets\nI wish there was a button that I could press to erase my bad memories of my regrets\nWell maybe in the next life I'll get it right\nMaybe in the next life I'll get it right\nCaught up in a circle\n\nLet's talk about it, got a issue\nMaybe we should talk about it\nCan't ignore it\nMan, I can't walk around it\nGrab a drink with me at a bar that's not too crowded\nGot a issue, no I don't, I got 2000\nNo I don't, I got 360\n\nPain to me is a bunch of wack motherfuckers coming to get me\nCan you imagine?\nBack in the days if a wack motherfucker started rapping\nYou would snatch that mic from his god damned hand\nTake one step back and smack him\nNowadays there's no passion\nEverybody trying to cash in, jewellery flashing\nThey walk around showing off the newest fashion\nAll we care about is who has the truest passion though\nShogun assassin, break baseball bats over my head like I'm Bo fucking Jackson\nThirty for thirty, Mac Lethal killed everything\nHard nose like the narcos down in Medellín\nIs every single rapper a thug?\nIf you ain't rapping about money, cars or bitches then it has to be drugs\nMaybe you could tell us all a story about your life\nOr maybe talk about a couple things you actually love\nI mean, shit. It used to be a thing of beauty rapping a rhythm\nAnd now the artists that are practically ripping up anything that's popular\nAnd don't imagine the difference\nThis is exactly a symptom of fucking capitalism\nAnd I’m not mad at the system, and I’m not throwin' jabs and I’m not dissin'\nCause it’s just music, it ain’t war, it ain’t a maximum prison\nBut I'm just saying motherfuckers when I'm rapping and spitting if I just do not do it fast less than half of you listen\n\nI wish there was a button that I could press to erase my bad memories of my regrets\nI wish there was a button that I could press to erase my bad memories of my regrets\nI wish there was a button that I could press to erase my bad memories of my regrets\nWell maybe in the next life I'll get it right\nMaybe in the next life I'll get it right\nCaught up in a circle", "year": "2016-09-13", "album": "Congratulations", "title": "Circle"}], "artist": "Mac Lethal"}