{"songs": [{"title": "Strippers & Chances", "album": "Mr. Midnight", "year": null, "image": "https://images.genius.com/6659527e1d927b401e994eff3a8867ac.1000x1000x1.jpg", "lyrics": "[Intro: Larry June]\nCardo got wings\nSo, you know\nI hit the strip club with my brother Jay Worthy\nYou know what I'm sayin'?\nSomething slight, seeking inspiration\nYou know what I'm sayin', if I crack somethin' I crack somethin'\nIf I don't, I don't\nTwo mojitos, please\nNumbers\n\n[Verse 1: Larry June]\nLately, baby, I been on some other shit (Other shit)\nGotta make it happen on some thuggish shit (Thuggish shit)\nNights on the road with my son and shit (Son and shit)\nI'm barely even sleepin', shit\nI been outta the game, I been boardin' these planes\nDealin' with a lot of shit but I don't never complain\nI know she lookin' down on me, I know she got my back\nAnd I'd trade anything to have them old days back\nTook that fear out my heart and I went harder\nHad to move smarter, get my life in order\nYou gotta keep goin' no matter what\nShit, you can't step it up 'til you step it up\nFuck it, let's hit the strip club\n\n[Chorus: Larry June]\nBaby, keep goin', bend that over, run it back\nMake it clap, uh-huh, like that\nI'm back at it, goin' hard, never switch\nAnd got no love for a punk rock bitch\nBaby, keep goin', bend that over, run it back\nMake it clap, uh-huh, like that\nI'm back at it, goin' hard, never switch\nAnd got no love for a punk rock bitch\n\n[Verse 2: Jay Worthy]\nBaby, keep hoin', I ain't tell you to come in off the blade\nI need it all, whole thousand, so, baby, keep goin'\nStill snowin', I ain't never had no other than that\nLook like a blizzard but it summertime in Oakland\nAin't you three worthy? Sprite dirty, that's early\nDancin' on the pole, that bitch was slappin' Jay Worthy\nKnow the streets heard me, I'm that nigga from the two L\nBrown chocolate mink lookin' smoother than Nutell'\nRemember postin' all them ads just in hopes that she would do well?\nHad to prep her right because you know these bitches do tell\nPull up in that Lex, bubble-eye, new car smell\nTerrell Owens, baby, keep goin'\n\n[Chorus: Larry June]\nBaby, keep goin', bend that over, run it back\nMake it clap, uh-huh, like that\nI'm back at it, goin' hard, never switch\nAnd got no love for a punk rock bitch\nBaby, keep goin', bend that over, run it back\nMake it clap, uh-huh, like that\nI'm back at it, goin' hard, never switch\nAnd got no love for a punk rock bitch"}], "artist": "Larry June"}