{"songs": [{"image": "https://images.genius.com/6tetlmlkzc3lziitg3f9dor0u.500x500x1.jpg", "year": "2009-07-24", "title": "Bad News (Nobody’s Somebody)", "album": "Everybody’s Nobody", "lyrics": "[Kanye West]:\nDidn't you know I was waiting on you\nWaiting on a dream that'll never come true\nDidn't you know I was waiting on you\nMy face turned to stone when I heard the news\nWhen you decide to break the rules\nCause I just heard some real bad news\n\n[XV]:\nI'm like one mess away from picking up a mop\nAnd one question away from if my album drops\nWill I make to the stage but never get any props?\nNiggas don't got time for me so they don't watch\nPlaces where I've been, I run into past friends\nSay \"You still do music?\" and it makes me just want to stop\nNiggas making top ten lists\nAnd I've paid my dues like rent so I deserve my spot\nYeah, my rap peers try to shun me\nYou sprinting in a marathon trying to outrun me\nMickey Factz charging for tracks like he outdone me\nWhen I said, \"Let's do something\" when he wasn't doing nothing\nBut I get it, music business needs business\nBet if I was from New York shit'll be different\nBut I'm just a boy from Kansas just spitting\nSo I gotta take my crown cause they wouldn't fucking give it\nThe fan base I got really means a lot\nFly Boy Club tees at every show I rock\nBut will I act like them when I pop?\nGet Mistah F.A.B.s intern and start charging for drops?\nSometimes I ask how they don't know my name\nSix years ago I was featured on hiphopgame\nA few years after that I was fucking with Game\nOnpoint, Whoo Kid, who's The Kid In The Green?\nBack Pack, that's rap through the eyes of me\nThe kid that nobody listens to, they aspire to be\nI reached out to Herfection, wasn't looking in my direction\nSo I guess my talent see ain't required to see\nNerdy kids being admiring me\nMy mom said, \"Just live for what you dying to be.\"\nI'm dying to see the day that I finally get on\nSometimes I think I wanna make it just to prove people wrong\nI did this song on my own and never asked for handouts\nI think I don't fit in but I never stand out\nFrustrated with the game in a room with no windows\nSo I turn on the track and decided to air it out\nAm I saying something they don't really care about?\nCause me talking about clothes will probably just wear them out\nHaha! How could the blogs say I'm not nice?\nThe only dude from Wichita that's been on Nahright\n'09 so time to show and prove\nMy flow better — My show improved\nThe Kid With The Green Back Pack is on the move\nAnd if this sound don't do it I don't know what to do\nCause I'm dealing with real shit in my real life\nCause when you left it all, how do you feel right?\nThe quiet type so I don't say much\nSo every girl I talked to I lost in them holiday months\nValentine's coming up, Patrick's Day around the corner\nSo they all fall in love cause I don't got time for 'em\nThen I lost my phone with a few on my connects\nNever expected that would bring me closer to my ex\nThey say I'm just a W away\nFrom putting the W in the game\nAnd that statement make me wanna think different\nCause I'm helping the niggas that was saying I was lame\nI'm about my dollars but I will never change\nIf you obscure and I don't like you, I won't like you with the fame\nI told Seven I'mma try to be the same\nAnd never turn into these new niggas in the game\nI don't wear chains or Bapes or tattoos\nAnd to say I ain't nice you gotta be cashews\nSo when Everybody's Nobody is that dude\nTell them cats who ain't listen that you got some bad news"}], "artist": "XV"}