{"songs": [{"album": "I’m Serious", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg", "year": "2001-10-09", "title": "Do It", "lyrics": "[Verse 1]\nYou looking good in them guess's shawty showing yo ass\nMake a nigga wanna grab a hold of yo ass\nStrip you out yo couchie dress and hit the flo' wit yo ass\nWhen I leave the club I wanna see some more of yo ass\nI ain't tricking shit but I might spend some dough on yo ass\nThe way you bouncin on my dick and grindin' slow wit yo ass\nHit the v.i.p. wit me I po' some moe' fo yo ass\nJust so I can see you out there bouncin yo ass\nIf I leave the club wit something rather go wit yo ass\nThem other broads fine but you a pro wit yo ass\nWhen I see u poppin and droppin I know it's yo ass\nIn a crowd full of hoes I would notice yo ass\n\n[Bridge: T.I.]\nA now a thug done chose\nAnd I don't give a damn if the club done closed\nGive the DJ a dub tell him spin one mo\nSo I can finish watching you poppin yo\nShakin yo, droppin yo, bouncin yo ass\n\n[Hook: T.I. & Females]\n(T) Now all my guls say\n(F) Do it baby stick it baby\n(T) Yeeeah, bounce ya ass and holla\n(F) Do it baby stick it baby\n(T) Alright, a in the club say\n(F) Do it baby stick it baby\n(T) Okay, so if ya wit it holla\n(F) Do it baby stick it baby\n(repeat)\n\n[Verse 2]\nI see ya every Friday night outside the club in da line wit ya partners\nShawty you see all that ass poking out them Dolce and Gabbana's\nHey as soon as she get in I'm a find her ass\nThe first record the DJ spend I'm behind her ass\nI don't care if I got some henn' I'm putting down my glass\nJust so I can get out there and grind her ass\nWit yo fine ass, must I remind yo ass?\nYou da baddest thing in here that's why I'm eyeing yo ass\nIn ya Iceberg suit, ya face looking cute and I like those boots\nYa nails all pretty and ya hair due too\nI'm fucking wit you, shit just choose and we'll be fucking by two\n\n[Bridge: 1x]\n\n[Hook: 1x]\n\n[Verse 3]\nI made this song to let you know shit that I see ya when you workin dat ass\nMake a nigga think later on he gone be twerkin' that ass\nAnd I can tell by the way you throw it back it ain't no hurting dat ass\nAnd ain't no room for nothing else in that skirt but that ass\nThe jiggling shawty, got a nigga shivering shawty\nAnd if you don't know what to do wit you better give it here shawty\nPut a bend in her back, I'm throwing the dick she giving it back\nI tell her if you ever give me dat ass I ain't giving it back\nShe bouncing her ass, later on I'm a blow a ounce wit her ass\nRide out wit her ass, cut sumethin' on the couch wit her ass\nThen bounce to her pad, coz you know it ain't no housing her ass\nCoz since the first time I seen her, all I been thinking bout is her ass\n\n[Bridge: 1x]\n\n[Hook: 1x]\n\nDo it baby stick it baby (8x then end)"}], "artist": "T.I."}