{"songs": [{"year": "2011-07-02", "album": "Section.80", "image": "https://images.genius.com/1f3cde1d04f886d4d4eb88a2c26a4e4d.1000x1000x1.jpg", "title": "Fuck Your Ethnicity", "lyrics": "[Produced by THC]\n\n[Skit]\nGather around. I'm glad everybody came out tonight. As we stand on our neighborhood corner, know that this fire that's burning represents the passion you have. Listen, Keisha, Tammy, come up front. I recognize all of you. Every creed and color. With that being said... fuck your ethnicity. You understand that? We gon' talk about a lot of shit that concerns you. All of you...\n\n[Intro]\nNow everybody, throw your hands up high\nIf you don't give a fuck, throw your hands up high\n\n[Chorus]\nNow I don't give a fuck if you\nBlack, White, Asian, Hispanic, goddammit\nThat don't mean shit to me\nFuck your ethnicity, nigga\n\n[Verse 1]\nFire burning inside my eyes, this the music that saved my life\nY'all be calling it hip-hop, I be calling it hypnotize\nYeah, hypnotize, trapped my body but freed my mind\nWhat the fuck are you fighting for? Ain't nobody gon' win that war\nMy details be retail, man, I got so much in store\nRacism is still alive, yellow tape and colored lines\nFuck that, nigga look at that line, it's so diverse\nThey getting off work and they wanna see Kendrick\nEverybody can't drive Benz's, and I been there, so I make it my business\nTo give 'em my full attention, ten-hut! Man, I gotta get my wind up\nMan, I gotta get down with God cause I got my sins up\nMatter of fact, don't mistake me for no fucking rapper\nThey sit backstage and hide behind the fucking cameras\nI mosh pit, had a microphone and I tossed it\nHad a brain, then I lost it, I'm out of my mind\nSo don't you mind how much the cost is, penny for my thoughts\nEverybody, please hold up your wallets\nYeah man, I'm the mailman, can't you tell, man?\nGoing postal, never freeze up, when I approach you\nThat's starstruck and roast you, oh my\nHiiiPower\n\n[Interlude]\nReporting live from Planet Terminator X\nI saw Martin Luther King with an AK-47\n\n[Chorus]\nNow I don't give a fuck if you\nBlack, White, Asian, Hispanic, goddammit\nThat don't mean shit to me\nFuck your ethnicity, nigga\n\n[Verse 2]\nI'm tired of y'all, cause everybody lied to y'all\nAnd you believe it? Recognize them false achievements\nIt's treason and I'm Tylenol, I knock out when you knock it off\nKnock on the doors of opportunity, I'm too involved\nI'm no activist, I'm no Einstein before calculus\nI was kicking that math, dropping that science\nLike an alchemist, and I be kicking that ass, lyrically I'm UFC\nIf a UFO had came for me, I'ma come back with the head of an alien\nDon't alienate my dreams, get it right\nGet a life, I got two, that's a metaphor for the big shit I do\nBoy, TMI, TSA, man I'm fly, put wings on my back\nThat a plane or an angel? Both like a pilot with a halo, whoa... gross\n\n[Bridge]\nI mean, I've seen so many things come through them, him, her, you\nI'm just a messenger, yeah, I know life's a bitch, get the best of her\nPut them 3's up, they notice that we up, HiiiPower\nAnd the power in the people and if they don't believe us\nThey'll die\nWizard\n\n[Chorus]\nNow I don't give a fuck if you\nBlack, White, Asian, Hispanic, goddammit\nThat don't mean shit to me\nFuck your ethnicity, nigga"}], "artist": "Kendrick Lamar"}