{"songs": [{"image": "https://images.genius.com/341a0545bbee6cbf1670c1c1961454e3.320x320x1.jpg", "year": "2011-04-15", "title": "Awesome (Remix)", "album": "Zero Heroes", "lyrics": "[Intro]\nHaha, yeah\nHow y'all doing out there? (Alright, alright)\nThank you for joining me this evening\nHow y'all feel?\n\n [Hook]\nLike I feel so awesome\nHow you feel? Awesome, I guess that's awesome\nShawty you fine and your body is awesome\nWanna roll? Awesome, well let's go, awesome\nHands in the sky like…\n\n[Verse 1: XV]\nI’m A-W-E, some call me awesome\nSome call me Vizzy, hunnies call me often\nGator on my shirt, what did it Lacoste him?\nJesus Christ I'm good, please don't cross him\nHow rude, Stephanie Tanner\nYou don't gotta watch me but please watch your manners\nAnd I be getting green, so mean, Bruce Banner\nGifted flow and presence, man I’m the new Santa\nAnd uh, I’m saying Kansas where I’m staying\nWhere niggas be bang-bangin' like Pops on the Wayans\nAnd even through the hating in walls they thought I stay in\nPsh, who you playing? I done went Super Saiyan\nThis that off the glass, off the floor, off the board jam\nWe in the building, you wishing you had the floor plans\nYou just a door, man, door man, damn, I wish I had more hands\n\n[Pre-Hook]\nNow tell me what got two thumbs and knows how to spit rhymes?\nTwo thumbs up, you gon point 'em at this guy\nAl Hedison couldn't be this fly so ask how I feel and you know I reply…\n\n[Hook]\nLike I feel so awesome\nHow you feel? Awesome, I guess that's awesome\nShawty you fine and your body is awesome\nWanna roll? Awesome, well let's go, awesome\nHands in the sky like…\n\n[Verse 2: Pusha T]\nThis is history in the making, ain’t you feeling it?\nThief flow, they say I’m on some show stealing shit\nMy solo discography, I’m building it\nNow every time you hit the space bar, I'm killing it\nYeah, I’m so fucking awesome, 200,000 was paid to out-floss ‘em\nThey don’t wanna follow my lead, I gotta force ‘em\nTo keep the competition in line, you gotta sort them\nFire engine red in that drop head\nHaters drop dead when I’m in that bobsled\nCover girl on my side and she bobs head\nSaying yes to my denim as she nods head\nXV from the middle of the map\nI’m coming to you live from the middle of the trap\nColors in the chain likes Skittles out the pack\nThe hustler, teaming with the gentleman of rap\nLet's go\n\n[Pre-Hook]\n\n[Hook]\n\n[Verse 3: XV]\nAy, I'm awesome, every time I lay it down\nI think that I kill 'em, play possum\nDeath proof, ride around with Rosario Dawson\nTell 'em open wide when they see how I'm flossing (ching)\nCooler than a peppermint, Wayne's World excellent Party on Garth (shwing)\nWork ethic harder than a Mexican\nThat's why I can walk up into any restaurant and close the whole thing\nSee? Even G couldn't F with it\nSemi-colon, dash, parenthese, text message it\nThat's a side smiley face ‘cause I'mma make the best of it\nI assume you should make room for the elephant\nBoom, where I come from is irrelevant ‘cause my glory is all that I revel in\nAnd my story begins where most others end\nSo all I really got to tell ‘em is…\n\n[Pre-Hook]\n\n[Hook] (x2)"}], "artist": "XV"}