{"songs": [{"year": "2016-01-16", "lyrics": "[Hook]\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\n\n[Pre-Verse]\nJust in, breaking news\nTwo shooters reportedly seen on the move\nOver to you Bob\nOver to you\nUh Bob?\nOh shit\nYeah, uh\n\n[Verse]\nGunshots apparently heard, have all of the parents concerned\nSuch a tragedy that this is happening in such a lovely suburb\nPolice and chief in high alert, investigators need to search\nSources say there were two gunmen but people claim there was a third\nIt's hard to confirm, so Bob are people still panicking?\nYeah but it could have been worse, our sources say this is some type of\nReligious terrorist hate group with an insatiable thirst\nSigning off, this is Action News, remember you heard it here first\n\n[Hook]\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\n\n[Interlude: Interviewer & Witness]\nYou told me that you were sitting in class this morning and you saw a lot of police. Tell me -- tell me how you found out what was going on\nWell, we found like there was all these people. And we found out because there was -- we were like right near the window in our classroom. And like we saw like police officers and we heard them on the roof and in our building\nWas everybody crying, scared, wanting their parents to come get them?\nYeah, they were. And then some people were even like -- they kind of felt *inaudible* they got a stomachache\nDid you hear any gunshots or anything like that?\nWell, police officers, like they were -- they were kind of, because there were police officers, like right out the door, like trying to find the guy\nAre you okay right now?\n\n[Hook]\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\nFire, fire\n\n[Interlude]\nTo be honest with you I'm just like 'let's go get her cellphone activated right now.'\n\n[Interlude/Outro]", "title": "Action News", "album": "FIRE: (False Idols Ruin Egos)", "image": "https://images.genius.com/f848443490c092a3b586e54658aa26d7.800x800x1.jpg"}], "artist": "B.o.B"}