{"artist": "Ice-T", "songs": [{"title": "Addicted to Danger", "lyrics": "\"Yo whats up man? Yeah I gotta trunk fulla this shit\nWord, broads still with me man, comin over to grapevine right now\nYo I can't talk right now man, I gotta get off this phone\"\n\nDamn, how'd I get into this scam\nRoll in a car with the trunk worth 5000 grand\nI came up from the curb, word\nFirst thing it rocks, now my ride's packin crazy birds\nI gotta freak in the front seat\nShe got crazy game, might even have more than me\nAnd thats why I don't trust, I ain't no busta\nOne wrong move and I'll dust her\nBut she knows that, keeps a gat\nWorks much plastic, always stays on phat\nShe said she loves me\nLooks deep in my eyes, sometimes cries, all lies\nShe only loves my cash flow, long dough\nThe falso love of a pimp and a ho\nBut me and her gotta job to do\nGet this luggage back to the crew\nShe got scanner, I hadta listen to the pigs talk\nAnd if they speakin about us then its jumpin off\nBut I ain't sweatin them at all\n2 cops'll roll up and 2 cops'll fall\nThe lines on the highway, I'm makin my mind drift away\nTo my last jail stay\n5 years for a 459\nI'm never goin back, no matter what the crime\nSurrenderin ain't me\nFuck that, I'm holdin court in the street G\nFor a nigga like me there ain't no ounce\nMy life filled with drug busts and shoot outs\nPure ghetto anger, pure ghetto anger\nPure ghetto anger, I'm addicted to danger\nSome nights I crash clubs\nRollin with the posse made of well-known thugs\nCool out with the freaks\nTruckin much jewels, beggin for beef\nThens some niggas roll up\nLookin for a way to pump the reps up\nBut I ain't the one\nI'm handin out beat downs, no need for guns\nSometimes I gotta ask myself\nIs all this buck whylin good for a niggas health?\nI don't know why\nAm I suicidal, do I wanna die?\nThe answerin, simple\nA headache throbs in my temple\nIt says it ain't fair, it says it ain't right\nIt says its goin down tonight\nWe finally made it to the drop spot\nKing and Weston Ave, snoody fox\nThe posse was there, but it ain't right\nFuckin police lights\nIts all goin down that road blocks\nI never seen that many cops\nIt was a setup, my whole damn crew's gettin wet up\nBig time, some motherfucker dropped a dime\nBut even in the flurry of gun shots\nMy adrenaline was boilin hot\nI crash down on the floor of the ride\nPunch the gas, drove that benz through they punk ass\nHit Vernor doin 90\nLooked in the rear-view, no one behind me\nI got on the phone\nCalled up the homies to see what went wrong\nBut no time to sweat that\nI still gotta trunk fulla shit, I was on phat\nI just need a cool place to hide\nDumped the benzo, slammed the G ride\nMe and a freak hit a motel crash spot\nThe streets was hot\nRubbed me down, said she adored me\nSaid the gunfire made her horny\nThe she pushed me back on the bed\nLicked me head to toe, toe to head\nThen I closed my eyes real slowly\nIs this love? No not me\nThen I felt a pain in my chest\nThe smell of gun powder and burnt flesh\nI looked in her face, opened my mouth\nAnd then her badge came out", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}