{"artist": "Wiz Khalifa", "songs": [{"year": "2014-05-25", "lyrics": "[Produced by Sonny Digital]\n\n[Intro]\nNigga all I smoke is papers\nAll I smoke is papers\nI’m a motherfuckin’\nI’m a motherfuckin’\n\n[Hook]\nAll I smoke is papers\nAll I smoke is papers\nI’m a motherfuckin’ Taylor\nI’m a motherfuckin’ Taylor\nAll I smoke is papers\nAll I smoke is papers\nI’m a motherfuckin’ Taylor\nThrowing up the gang like a banger\n\n[Verse 1: Wiz Khalifa]\nAll I know is smoke when I’m in a ride\nAll I know is count while I’m getting high\nAll I know is Flex while I’m in the club\nAll I know is show them hoes no love\nAll I know is buy a hundred bottles pour ‘em\nAll I know is old school or foreign\nAll I know is make sure they know your name\nAll I know is ride out for your gang\nAll I know is make them hoes cone joints\nAll I know is keep your niggas on point\nAll I know is have my money on time\nAll I know is grind lil’ nigga, grind\nThat’s all I know\n\n[Hook]\n\n[Verse 2: Ty$]\nTwisting up our fingers, all in your face like what's happenin'\nMy niggas hop out and get to smashin’\nSock a nigga first then ask him\nWhere you niggas from? What you niggas bang?\nSnatched a nigga chain, he ain’t with the Taylors\nThis nigga jewerly fake, he ain’t getting paper\nHe's a fuck nigga, not a real player\nI took his bitch and made her learn how to roll papers\nOff Youtube, you should do it too\nType of bitch that like to be around the who’s who\nYeah she get around, she like a hula-hoop\n\n[Hook]\n\n[Verse 3: Wiz Khalifa]\nBig bag of that, coming back for that\nRoll ‘em back to back, keep a sack of that\nDon’t imagine that, that’s a matter of fact\nEyes down in the clouds where you find ‘em at\nIn my MCM bag where the magic at?\nCome back to my room, jump on the broom\nSwear the magic happened, she hit the magic dragon\nHer ass started clapping, I was glancing\nSmoking kill, that’s that extra pack\nTell the DJ to bring it back and tell the weedman to bring a sack\nI got a bong and I got a biatch, ass fat, body full of tats\nPick her up, fuck her on the jet, nothing less\n\n[Hook]", "image": "https://images.genius.com/e168a843af4516427b50fafd226984ee.990x990x1.jpg", "album": "28 Grams", "title": "Banger"}]}