{"songs": [{"image": "https://images.genius.com/e8f9be6df36a6370218e9971d5cb2867.640x640x1.jpg", "title": "Grindin’ (Selector Remix)", "album": "Lord Willin’", "year": "2002-08-20", "lyrics": "[Intro & Hook: Pusha T] (Pharrell)\nWhat's the size of them rims on that car nigga huh? (Grindin!)\nCan they see that chain from a far nigga huh? (Grindin!)\nWhatcha game be like? (Grindin!)\nWhatcha change be like? (Grindin!)\nSo whatcha name be like? (Grindin!)\nMa, it don't get more ghetto than this\n\n[Verse 1: Sean Paul]\nTell dem!!! Connnect di dot yo\nDem mi friend dem ready fi hit di block yo\nThose who try fi test yuh better mek since yuh better know how\nIf not yo, then dem gonna lose all dem spot yo\nHail my friend and start collect di top doe\nNow, with ease, takin over all territories\nPlease, don't come inna mi way when mi a squeeze\nMi shot can be heard from the West Indies\nSmell di gun powder inna Jamaican breeze\nTrees, smoke di pound by di keys\nLadies, nuff nuff like rice and peas\nTop notch we top notch so tell dem nuh better stop watch\nDi way how we be clockin it makin these g's\nGrindin it, yo, pickin up di pace double timin it\nYo, up inna your face definin it\nHey, better get your mind in it or else yuh ago get left behind in it\nYo, grindin it, yo, pickin up di pace double timin it\nHey, up inna your face definin it\nHey, better get your mind in it or else yuh ago get left behind in it\n\n[Hook: Pusha T] (Pharrell)\nWhat's the size of them rims on that car nigga huh? (Grindin!)\nCan they see that chain from a far nigga huh? (Grindin!)\nWhatcha game be like? (Grindin!)\nWhatcha change be like? (Grindin!)\nSo whatcha name be like? (Grindin!)\nMa, it don't get more ghetto than this\n\n[Verse 2: Simpleton]\nYo! Ah! Ah! People sell dem soul a for a slice of bread\nDon't watch how man business may get eye turn red\nPay attention to like how easy man dead\nIt's ready been written man it's ready been said\nMi travel a thousand miles just to lick a guy head\nYuh might pick up teflon mixed with led\nDon't get mi angry mon or neither fled\nNuff snitches a work for CIA and feds\nWe beat 'em badly and mek di whole a dem dead\nAnd this di original di badily boom skegereg\nFreestyle fanatic, stayin quietly in da attic\nSpittin like a damn automatic\nSo let mi tell yuh straight a like elastic\nWatch how yuh start it, let mi tell yuh fo real yo\nGimme yo a chance, mek yo di nuff a dem dance\nLet mi tell yuh full of nuff grands, let mi tell yuh still yes di shine\nNow what I claim what is mine, let mi tell yuh leave that designed\nSpecial in crime, grindin fly\n\n[Hook: The Clipse in sing-song voice and (Pharrell)]\nGrin-din', when you know what I keep in a lining (Whooof...)\nNiggas better stay in line, when (Whooof...)\nWhen you see a nigga like me shinin' (Grin-ding!)\nGrin-din', when you know what I keep in a lining (Whooof...)\nNiggas better stay in line, when (Whooof...)\nWhen you see a nigga like me shinin' (Grin-ding!)\n\n[Verse 3: Kardinal Offishall]\nKardi, yo, yo, they just keep holdin me, won't let go, provokin me\nNiggas tryin to stop my doe\nWell if it isn't, Mr. Canadian (BO!!!!) Mr. Canuck\nT Dot niggas (Pharrell: Grindin!) we don't give a (BO!!!!)\nMr. Kardinal steal dem fronts out of your mouth\nFlip it for a pound of herb and sell it in front of your house\nBadbwoy big talk put this somethin pon cock\nWhine out yuh dutty claat down south to up north\nWeh di man dem a seh? Five plus two yo we flip that a (Ten)\nMek di english pound di paste up plus di (Yen)\nStill fire pon a fassy and grind di gal dem (How yuh mean?)\nSeen, come again, we mek di green yuh know\nSwell it to di seem yuh know\nChronic supersonic tonic juggle it to a fiend yuh know\nMr. Kardinal deal with the mic rockin V.A. to the dot\nStop whinin when we (Pharell: Grinding!)\n\n[Hook: Pusha T] (Pharrell)\nWhat's the size of them rims on that car nigga huh? (Grindin!)\nCan they see that chain from a far nigga huh? (Grindin!)\nWhatcha game be like? (Grindin!)\nWhatcha change be like? (Grindin)\nSo whatcha name be like? (Grindin)\nMa, it don't get more ghetto than this"}], "artist": "Clipse"}