{"artist": "Big Daddy Kane", "songs": [{"lyrics": "\"bring that beat back, bring that beat back!\" - chuck d\n\"we gonna do a song, that you heard before..\"\n\n[kane]\nHere I am, r-a-w\nA terrorist, here to bring trouble to\nPhony mc's, I move on and seize\nI just conquer and stomp another rapper with ease\nCause I'm at my apex and others are below\nNothing but a milliliter, I'm a kilo\nSecond to none, making mc's run\nSo don't try to step to me, cause I ain't the one\nI relieve rappers, just like tylenol\nAnd they know it, so I don't see why you all\nTry to front, perpetratin a stunt\nWhen you know that I'll smoke you up like a blunt\nI'm genuine like gucci, raw like sushi\nTo stage a rage is what rap did to me\nTo make me want to create, chaos and mayhem\nCold rock a party, until the a.m\nI'll make a muscle, grab the mic and hustle\nWhile you stand dazed and amazed, I bust a\nLittle rhyme with authority, superiority\nAnd captivate the whole crowd's majority\nThe rhymes I use definitely amuse\nBetter than dynasty, or hill street blues\nI'm sure to score adored for more without a flaw\nCause I get raw!\n\n\"r-a-w\" (cut and scratched by mister cee 4x)\n\n[kane]\nAttact, react, exact, the mack'll move you with\nA strong song as long as you groove to this\nI keep the crowd loud when you're hyped\nDo damage on stage and injure the mic\nAs I shoot the gift, mc's stand stiff\nWhile my rhymes stick to you like skippy and jif\nFeel my blunt fist, or my death kiss\nThe rap soloist - you don't want none of this\nSupreme in this era, I reign with terror\nWhen I grab the mic, believe you're gonna hear a\nFascinating rhyme, as I enchant them\nSo let's all sing the big daddy anthem\nGo with the flow, my rhymes grow like an afro\nAn entertaining gain, the kane'll never no\nProblem, I could sneeze sniffle or cough\n\nEeee-even if I stutter i'ma still come off\nCause rappers can't understand the mics I rip\nThey sho' nuff ain't equipped, that's why they got flipped\nBut my apparatus is up to status\nDon't ask who the baddest, or cause static\nTo make or break or take em, my rhymes hit the head\nPut it to bed, so watch what's said\nSave the bass for the piper, rearrange your tone\nTake a loss and be forced from the danger zone\nI get ill and kill at will\nTeachin a skill that's real, yeah no frill\nJust stand still and chill as I build\nScience I drill until my rhymes fill your head up!\n\"r-a-w\" -- don't even get up\nCompetition shut up, cause I'm raw!\n\n\"help me!\" (cut and scratched 8x by mister cee)\n\n[kane]\nThe man at hand to rule and school to teach and reach\nThe blind to find their way from a to z\nAnd be the most and boast the loudest rap\nAgain, to reign your domain (yeah kane)\nThe heat is on, so feel the fire\nCome off the empire, all the more higher\nLevel of depth, one step beyond dope\nThe suckers all scope and hope to cope but nope\nCause I never let em on top of me\nI play em out like a game of monopoly\nLet em speed around the board like an astro\nThen send em to jail for tryin to pass go\nShakin em up, breakin em up, takin no stuff\nBut it still ain't loud enough\nSo let the volume increase, never to cease\nI'ma release a masterpiece a slip of the tongue like grease\nRippin the mic to shreds, puttin heads to bed\nCode red cause the rhymes is bein said\nBy the asiatic printer of raw poetry\nNo hints or clues, you all know it's me\nI go pound for pound and round for round to clown the sound\nProfound it's bound to go down, uhh\nA lyrical knockout, showin I got clout\nMy comp should just drop out\nCause none of them can see me\nI leave em winan like their name was bebe or cece\nI get raw!", "image": "https://s3.amazonaws.com/rapgenius/1321503841_BDK%20fade.jpg", "year": null, "title": "Raw [Edit] (45 Version)", "album": null}]}