{"songs": [{"image": "https://images.genius.com/3dfcdaab94652abd75c7788fce09ed7f.398x400x1.jpg", "year": null, "lyrics": "Yo yo yo yo yo\nWhat's the password.. password..\nYo yo yo\nYou know the password.. password..\nI know it, password is +Detonator+\nLet me type it in real quick: \"Welcome!\"\nAight, let's check this: \"You've got mail!\"\nWord up, bust it\n\n[Verse One]\nThe internet's your medium of choice\nCause nobody really wants to hear your corny ass voice\nYou ain't a MC just because you could type\nOn the mic in real life your ass'll get sniped\nYou a man with a mouse who can't rock the house\nJerkin off to gay porn while wearin your girl's blouse\nYou know you never seen no real life fame\nSo you're lookin for some recognition through a screen name\n(No doubt) No threat, y'all ain't the pro set\nRappin ten years and not a paid show yet\nI love to get online and shine and drop bombs\nBut my music can be found on more than dot coms (word up)\nYour website gets a whole lot of hits (right)\nBut in the real world son you ain't sayin shit\nCats run they mouth on AOL\nBut everytime they drop a twelve inch, they don't sell\nYou love the anonymnity, you hide behind the shadow\nAlways tryin to get someone to chatroom battle\nCryin cause heads only rhyme one syllable\nWho made the rule you gotta use every millisec\nBecause it's fillable?\nI'mma snatch your webmaster, break both his legs\nPost it on your site, format it as .jpeg's\nRip you on your own site and sign your guestbook\nThen go into your chatroom and leave the rec shook\nWhat percent of these rappers can compete? (Nil)\nReboot they whole shit, control-alt-delete\nYo, you can have a PC and a Mac\nBut you internet MC's can't see AK\n\n{*vocal scratching*}\nIf a rapper try to diss.. wh-wh-when you online\nI ahh I ahh crush the motherfucker\nRapper try to diss.. wh-eh-wh-eh-wh-eh-when you online\nAhh ahh ahh I crush the motherfucker\n\n[Verse Two]\nCarpal tunnel syndrome, can't make a fist\nI rip every MC on your buddy list\nShow the light to you so bright that your eyesight fail\nNow you doin all your correspondence through eBraile\nCats get online and start all types of static\nBut heads without computers know whassup with Akrobatik (true dat)\nCause I rock real mics in real life\nRip real crowds, real shows, real cyphz\nPlus your anonymous gab, it don't bother me\nI don't give a fuck if you got AOL or Prodigy\nYour crew screams that you the illest of all time\nWhen your only fans are all your nerdy friends that rhyme\nAnd even if you was nice, no one'll ever hear\nCause you in front the keyboard too much to develop your career\n(Say word) And half of y'all is just teenagers\nYou don't know jack about what rippin up the stage is\nSo I'mma get a crew of online MC pirates (right)\nInfect all your computers with a flesh-eatin virus (uh-huh)\nChew up all your fingers so you can no longer type (say what?)\nThen expose your lack of flow when you approach the open mic\nSo internet MC's, heed my advice\nOnline keystyles don't make you nice\nBring it to the streets and start to rabble rousin\nSincerely yours, Akro 2000\nWhat percent of these rappers can compete? (Nil)\nReboot they whole shit, control-alt-delete\nYo, you can have a PC and a Mac\nBut you internet MC's can't see AK\n\n{*vocal scratching*}\nIf a rapper try to diss.. wh-wh-when you online\nI ahh I ahh crush the motherfucker\nRapper try to diss.. wh-eh-wh-eh-wh-eh-when you online\nAhh ahh cru-cru-cru-cru-crush the motherfucker\n\n{*continue scratching \"crush the motherfucker\"*}\n\n[AOL] Goodbye!", "title": "Internet MC’s", "album": "The EP"}], "artist": "Akrobatik"}