{"songs": [{"lyrics": "[Produced by Mark Ronson]\n[Additional production by Statik Selektah]\n\n[Hook]\nI got a brand new car\nI got a jazz guitar\n\n[Intro]\nWelcome, everybody\n\n[Verse 1]\nThank you a lot for coming, it means a lot to me\nSteer the yacht with my knee, plenty of botany\nDamn, bad chick on top of me, pornography\nAnd I know she only want me for my guap-ery\n(Ahem... let me get my voice right\nGary, sorry, 1, 2, 3, 4)\nIt's the first time ever\nYo fuck this jacket, I turn this shit to 85 napkins\nSince Jeter's done I'm now the captain\nTrust you me, Gotham's safer now\nBut there's always a new joker in town\nReady to smoke you with that pound\nBut when he shoots it, the flag says \"BANG!\" and everybody laughs\nHe must be up and off the molly tab\nI'm by the bar lookin' Swedish in the trenchcoat stupid\nThe only one drinkin' mango lassi in the bullpen\nMy lips are sealed like the singer with bad skin\nMy need for speed made the Jag spin\nDog, I'll resurrect Freaky Tah to do my ad-libs\nOverseas I prolly got mad kids\nThat I don't even know about, you better slow down, baby\nI'm still young, fuck it, gotta use it while it works\nNothin' lasts forever, or does it? Fuck it\nShout out to my cousins, all of 'em\n\n[Hook]\nI got a brand new car\nI got a jazz guitar\n\n[Verse 2]\nI'll take it back to playin' handball and smokin' on the park benches\nDippin' cabs and hoppin' fences\nLaughin' all the way back to the buildin' runnin'\nGot to the door, twist the key, elevator waitin' for me\n100, got upstairs and fixed eleven bowls of Crispix\nGrabbed a Snapple out the bin, no one's an even match for the kid\nLegs are made of stone, the back of a bridge\nIn goal line situations I'll tackle the fridge\nPeace to Mike Ditka, 50 on the light fixture\nRight side shifter, fight fixer, twist your sister\nAnd I ain't talkin' 'bout the hair band, mothafucka\nIt's Bam Bam doin' ah ah ah ah\n\n[Outro]\nOut with the, ah!\nI can't even get this fuckin' right, are you kidding me?\nI'm ashamed of myself, I'm sorry", "title": "Brand New Car", "album": "Mr. Wonderful", "image": "https://images.genius.com/3f40c65495de257e6acc2dabe3749b6b.800x800x1.jpg", "year": "2015-03-23"}], "artist": "Action Bronson"}