{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "Rap Music", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "New Jersey stand up!\n\n[DJ scratching Eminem sample]\n\"Pacewon\" Yo!\n\"Pacewon\" Yo!\n\"Pacewon\"\n\"Pacewon\"\n\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n\n[Verse 1]\nYo! This is every man for himself and things not sweet\nI knew this song by that crew Mobb Deep\nSo I used it, my brother produced it, new shit\nSet me up so I could flow like a cruise ship\nAnd tell this story 'bout these men that's foul\nAnd how this little nerdy kid stole our style\nAnd ran wit' it, even bit our wit' and our charm\nAnd did a half a dozen songs dissin' his mom\nHe went so far 'cross the grain, I should put the choke down\nHe turned our inner expression to a joke style\nDoin' that pop B.S, doin' coke now\nAnother manic depressive, gettin' doped out\nI read a book about he a crook and no good\nThat's why he hidin' from Suge\nWhy he had to pack his bags and move his things from the hood\nSo scared he wouldn't move back if he could\n\n[Hook]\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\n\n[Verse 2]\nYo, is it your heart, or is it the lies\nYou lack courage like the lion in the Wizard Of Oz\nYou went from brunette to blond just to better your cause\nBut your hypeman album sound better than yours\nBunny rabbit got a funny habit, we say\nHe let a homey and a honey have it, cause he gay\nWell I'm hard to the core like Brun in Krush Groove\nYou a little prick that ate too many mushrooms\nGot your voice on the track of your choice\nYou made noise, but then turned your back on your boys\nEven did it to Royce, where's Head? Where's Fuzz?\nI'm sick of your songs, I need lead ear plugs\nThe same thing you tried to do with the Outz\nIs the very same reason that they booin' you now\nLike the D.A. in court I pull two of your files\nBetter save that last dance for Julia Stiles\n\n[Hook]\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\n\n[DJ scratching Eminem samples]\n\"Fuck\" \"Slim Shady\"\n\"Fuck\" \"Slim Shady\"\n\"Fuck\" \"Slim Shady\"\n\n[Verse 3]\nYeah, back to gettin' +Raw+ like Kane and Mister Cee\nMe and Slim Shady had a past history\nI'mma paint a picture now, you can set it up\nLet's start with this time that he was gettin' jumped\nI jumped in, knocked a couple kids down\nMade niggas bidounce, helped him off the gridound\nMe and Big Nasty started raisin' hell\nAlways wondered why your other boys ain't help\nSee this is real dirt that I'm kickin' on y'all\nWon't you battle me? Stop pickin' on Ja\nScary little bitch, you a soldier? Not true\nThe truth just is you wanna be Pac too\nStop biting, invest in speech\nAnd let my fallen brothers just rest in peace\nYou never met 'em, they probably wouldn't feel ya\nCause your little rap songs need to get realer\nSee you just got a charge cause you shook with a gun\nGot yourself in trouble now, look what you done\nLow down and shifty, only on camera\nShit, compared to him I'm Tony Montana\nI beat his ass, smack him up and play wit' em\nTake that little ass allowance Dr. Dre give 'em\nHow many styles can I flaunt in your face\nAsk Em, he don't want it with Pace, noooooooo\n\n[Hook]\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\nSee this is rap music, this is culture\nThis is organised, it has structure\nIt has insight, this is rap music\nNot to be mixed or deluded\n\n[DJ scratching Eminem sample]\n\"Pacewon\"\n\"Pacewon\"\n\"Pacewon\"\n\"Pacewon\"\n\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)\n(This is how the East Coast rocks)", "year": null}]}