{"songs": [{"lyrics": "[Scene from Taxi Driver]\nHow about dope? Grass? Hash? Coke? Mescaline? Downers? Nebutol? Tuonal? Chloral Hydrates?\nHow about any uppers? Amphetamines?\nNo, I'm not interested in that stuff\nCrystal meth, I can get ya crystal meth\nNitrous Oxide, how about that?\nHow about a Cadillac? I get ya a brand new Cadillac\nWith the pink slip for two grand\n\nH'z Global, Black Market shit (yo, yo, yo)\nMy niggas know (Yeah So, Yeah So)\nYo, yo (Yeah So, Yeah So)\n\n[Verse 1: Da$H]\nDolla still thugging regal, it's the tan skin Bugsy Siegel\nRiding in a bucket with two bitches and a rusty eagle\nYou know it's nothing, cup of dope got me David Ruffin\nDwell on this game, now we lunging on my way to the luncheon\nOnly jewelry I wore was copper and steel\nStill I pop-up on random blocks for appeal, then it's real\nI'm at the benefit for kids with better needs\nThe only thing it did was better off my jeans, mass extortion\nCrack recording raps from Jim Morrison orphan\nYou only see me when it's violence like a shark fin\nThe boss man, pulling strings like I'm Santana\nThe bandana from high school, claim my damn hammer\nWith bad grammar I did all this\nCatch me on Tunisian beaches off a tab of acid\nEating red snapper with a goddess, got Parisian features\nYou niggas novice, should observe the teachers\nGet clapped tryna short or cheat us\nNo cuts, no breaks, get it motherfucking straight nigga\n\n[Scene from Taxi Driver]\nYou interested in a automatic? It's a Colt .25 automatic\n\n[Verse 2: $ha Hef]\nKnock on the locked door, package get dropped off\nBricks on a drop cloth, sick with the handle\nI push the pill like I'm hot sauce\nCough up the knots and get knocked off\nThe top of the drop porsche get chopped off\nThe bitch with me is a throwaway\nShe roll my dope, we blow a O a day\nShe suck me then she go away\nThis big chopper will turn a nigga to saw dust\nThe bitch with me the same color as dandruff\nI need my space, made a right and pulled up on eighth\nI move the base, posted on the crate\nRight on 38th in front Domingo shit\nStrictly 'bout my chips, I'm on some Pringle shit\nI could feed the hood off a single flip\nTrue shit, move eight balls like pool sticks\nI'm all up in your bitch head like q-tips\nSmith & Wesson, nine milli' my favorite weapon\nBlue cheese is my favorite dressing\n\n[Hook x2: ($ha Hef) & Da$H]\n(Niggas better get to ducking when the pistol scream\nI could bag a fifty bundle from the triple beam)\nGold; bury it in the sand, count up a band\nLight a blunt, reassure I'm the man\n\n[Verse 3: A$ton Matthews]\nThe turtle run a race, homicide from the shell shot\nSlip the cuete through the mail box\nA gauge to my head and the cell locked\nAll my gun shells stay well stocked\nThe Art of War, cup of Henny in this office war\nLook back and fourth from the door with the eyes of a Labrador\nParanoia keep me safe at night\nMy clip is full and my game is tight\nShe laid on ice before I laid the pipe\nKiss the ring 'fore I shake the dice\nDaddy need a new Glock, extendo shots, and tube socks\nShe know how them looney rules rock\nYour Mac-11 gu-wop\nWe was [?] before them boondocks\nSince Sour Lucas and Moonrocks\nNo loose knots on my new noose knots, ou\nMama there go that man again, Mini Van Dan and them\nWith a minivan full of mannequins, uh\nFor the drugs that we trafficking\nCheck the shipping and handle it\nWe finesse for them ex souls, get exposed\n\n[Hook: ($ha Hef) & Da$H]\n(Niggas better get to ducking when the pistol scream\nI could bag a fifty bundle from the triple beam)\nGold; bury it in the sand, count up a band\nLight a blunt, reassure I'm the man", "album": "17 More Minutes", "year": "2015-09-11", "title": "Shark Tank", "image": "https://images.rapgenius.com/bc767cef675d8c710827132af4ee379b.512x512x1.jpg"}], "artist": "Da$H"}