{"songs": [{"image": "https://images.genius.com/8f8b1782b097d1c513ec8617640f78ec.640x640x1.jpg", "lyrics": "[Verse 1: Mac Dre]\nMost of my brodies is ex cons and parolees\nDrink heem and OD's\nRoll twomps and goldies\nGet made from Goldie, 'cause Goldie the made man\nDon't fuck with blade men\nGo hard like cavemaen\nAy man, I don't think you understand though\nI stalk the streets, with a Colt Commando\nA Thug and a vandal, a walkin' scandal\nDrink like ten fishes, smoke like candles\nPistol grip handle on the riot 12 gauge\nKeep the rollers off me and out the jail cage\nGot a twelve page letter from my folks in the rally's\nHe got caught up in a riot and they shipped him outta Cali\nOmaha, Texas, Leavenworth, Kansas\nThey got us spread out, I don't know where my mans is\nBut it's like this, I don't complain\n'Cause I knew about the game when I hopped in the thang\n\n[Hook]\nLord, can you hear me?\nToo many niggas dying\nLiving Cutthoat but they trying\nLord, you gots to help me\nI know sometimes they wrong\nKeep my niggas strong\n\n[Verse 2: FREAKO]\nListen, I been walking the line\nPiercing the wire, stepping with my chin up\nWoke or sleep, my lids never shut\nProtected but rapists stay PC'd up\nEscorted by badges and handcuffs\nBilly clubs and face shields to storm your cell\nSearch your locker, thirty days in lock up\nFrom reminiscing with my celly, pretending\nWe daydreaming of flying, we high\nEternal freedom, but we paid the price for living this life\nWe cry inside, but only cold stares for the naked eye\nA young boy with mafia ties, so while inside\nThe bricks and fences, got every tear stitched up\nWith coke and black pinheads twisted in zigzags\nWatching time pass, 'cause I ain't got nothing but time\nWriting invisible lines on lined paper\nBut being secluded made my rhymes greater\nSo I stick to my music, song after song\nI might make a hit over the phone\nHello?\n\n[Hook]\nLord, can you hear me?\nToo many niggas dying\nLiving Cutthoat but they trying\nLord, you gots to help me\nI know sometimes they wrong\nKeep my niggas strong\n\n[Verse 3: Rydah J. Klyde]\n'92, '93, hit a lick, split a key\nFlossin' on chips and spit a clip, the game was fun to me\nIt didn't take me long to see it wouldn't last though\nHow else can my cash grow?\nWithout the J team and task force coming to ask for me\nI'm moving too fast, homie\nI wish you would've got over the gate and I escaped with the cash, homie\nBut I'll bust my gun to avoid the pen\nWe was young lights when you went it\nBut changed from boys to men, be home at 10\nDo that, and come home, that ain't no place for a player\nCan't make no money, ain't no bitches in there, but life ain't fair\nBut your world don't stop, you gotta keep keep on\nWe pueblo no matter what street we on, the streets we roam\nThat's why I ain't wrote you when in here\nBut I'll see you when I see you\nIf not, then when they lock the rider in\nThen tough love, one thug\nIssue a slug to that snitch nigga\nFinish where we left off, I'mma get rich nigga\n\n[Hook]\nLord, can you hear me?\nToo many niggas dying\nLiving Cutthoat but they trying\nLord, you gots to help me\nI know sometimes they wrong\nKeep my niggas strong", "year": "2002-08-27", "album": "Thizzelle Washington", "title": "Help Me"}], "artist": "Mac Dre"}