{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/643d9675eedcaa5319fa306772e6375b.479x479x1.jpg", "title": "Bering Sea Gold", "year": null, "album": "63", "lyrics": "Yeah, Bering Sea Gold, I'm three old\nThe rating of my standard is over/under depending, the kid pending\nKing with words, circuit of circular love\nHella right, a lot of eyes, sell the rights\nPalm wine tapster, young Napster\nRough mix, no mastered, I run faster\nSon, pass the rum plus the Dutch Master\nI touch plastic, chuuch bastard, fuck you asshole\nYeah, Kool baby, Kool A.D., Kool baby\nCheck it out, yo: shit is all fucked up, god\nLike elections, stepped in it, if not, what?\nI don't know, the kid caught up\nTook it to the rib but he got up\nCook it in the crib, get the law up\nStick it in the fridge, get the squad up\nThis ain't the lottery, chill, c'mon god up\nNod up, nod down, affirmative neck muscle grustle\nThe hustle grindy, the grind limey\nBut sometimes the blind see\nDumb shiny, come find me, cool climate, Optimistic Primate\nEffortless gestures of love that some design hate, define great\n72 dimes await, Allah wisdom\nDeath cab jihadi, shake your body\nI'm Salman Rushdie, fuck me, suck me, I'm lucky\nI got one ugly rugby shirt, it's dirty, rock it at every party\n(Laughter)\nPLO Al Jolson\nMulatto creole Eskimo new human\nSee your dude shrooming on the moon, playing Duke Nukem and losing\nAre you stupid? I'm too truthful\nWho do you think's tutoring whose pupil? I'm true cuckoo\nBoop boop be doo to the Kool, meta-mutual\nRun it through like fiber, 25-to-lifers, survivors\nMight describe a light similar to China white but brighter\nYo, the fuck I gotta lie for?\nYou could die or you could live more\nYou could cry or you could give more\nYou could fly or you could skid more\nYou could try or you could fib more\nFuck you got to live for? This or that, that or this\nKicking back, flipping in the ghetto on a datadisk\nKool wax feather Daedalus, shruggy Atlas\nThuggy, mean-muggy actress\nBaby Mancuso, they be like you so irresponsible\nBack with another one of them block rockin' optical illusions, Cuban"}]}