{"artist": "Playboi Carti", "songs": [{"album": "Die Lit", "title": "Middle Of The Summer", "image": "https://images.genius.com/2c0ac6dd21317bb8aa126e1843c1b752.1000x1000x1.png", "lyrics": "[Intro: Playboi Carti]\nHold up\nYou know what I'm saying?\nYou know I seen Kesha and them back there\nYeah, Kesha\nGot muhfuckin' Redd in this bitch\nYou know what I'm saying?\nKnow what I'm saying, real playa shit\nMe and my bitch, nigga\nYeah, me and my hoe, nigga (Yeah)\nWe do this shit with real big, nigga (Yeah)\nI said we do this shit for a big boy Patek\nWalk in that shit, take over that bitch\n\n[Chorus: Playboi Carti]\nI'm in the hood with niggas, don't bother me (Check it out)\nThirty-five hunnid my cardigan (Check it out)\nShawty gon' fuck, shawty gon' swallow me (Check it out)\nShawty gon' get on top of me (What, what, what, what)\nAll of this ice in the summertime\nAin't no boy fucking with Carti, nah!\n\n[Verse: Redd Coldhearted & Playboi Carti]\nI'm in this bitch with young Carti (Carti)\nRiding 'round with the top down (What?)\nAll of these bitches so naughty (What?)\nThey tryna fuck on us right now (Uh)\nIf Carti with it, then I'm ridin' (Yeah)\nGot a hunnid on the neck (What?)\nAin't no stopping, bitch, I'm poppin'\nYou see this Rollie and this chain (Chain)\nBitch, I'm so icy, I'm cocky (Cocky)\nJust dropped a fifty on my jeweler (Jeweler)\nAnd told him, \"Make sure it's shiny!\" (Shiny)\nIt's Coldhearted and she got a stick\nRight beside me, I'ma let it hit\nI ain't really with the sucker shit\nThese niggas around me, you know they with it, yeah\nThese niggas around me you know they with it, yeah (Yeah)\nThey toting the Glocks and the dirty sticks, yeah (Yeah)\nAbout Coldhearted they gon' pull up quick, yeah (Yeah)\nThey ready for war, yeah, you know they with it, yeah\n\n[Bridge: Playboi Carti]\nMe and my bitch lit, yeah, me and my homie (Yeah)\nWe do this shit with my hitman (Yeah)\nYou know what I'm saying?\nI can't really complain about shit, man (Yeah, what?)\n(I said we do this shit for a big boy Patek)\nEverything good, you know what I'm saying?\n(Walk in that shit with my bih Red)\n(Sippin' red drink nigga!)\nDon't give a fuck what it look like\n\n[Chorus: Playboi Carti]\nI'm in the hood with niggas, don't bother me (Check it out)\nThirty-five hunnid my cardigan (Check it out)\nShawty gon' fuck, shawty gon' swallow me (Check it out)\nShawty gon' get on top of me (What, what, what)\nAll of this ice in the summertime\nAin't no boy fucking with Carti, nah!\nI'm in the hood where niggas don't bother me\nThirty-five hunnid my cardigan (Cardigan)\nShawty gon' fuck, shawty gon' swallow me\nShawty gon' get on top of me (Top of me)\nI'm in the hood where niggas don't bother me\nThirty-five hunnid my cardigan (Cardigan)\nShawty gon' fuck, shawty gon' swallow me\nShawty gon' get on top of me (Top of me)\nI'm in the hood where niggas don't bother me\nThirty-five hunnid my cardigan (Cardigan)\nShawty gon' fuck, shawty gon' swallow me\nShawty gon' get on top of me (Top of me)", "year": "2018-05-11"}]}