{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "We Got It For Cheap (Intro)", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Intro: Mr. Lee]\nAyyy, papá\nRe-Up Gang Records\nThat hold-the-door music (Got it for cheap)\nYou know, Broadway, daddy\nMonteca, crack, hooray\nToda la vaina que hay aqui-hooray\nEn Uptown baby, otra vez (G-g-got it for cheap)\nClipse, Hell Hath No Fury, b\nLet em know, daddy, Mr. Lee!\n\n[Verse 1: Pusha T]\nFear him, as soon as you hear him\nUpon my arrival, the dope dealers cheer him (Got it for cheap)\nJust like a revival, the verse tends to steer 'em\nThrough a life in the fast lane, I German engineer 'em\nNo serum can cure all the pain I've endured\nFrom crack to rap to back to selling it pure\nFor every record I potentially sell in the store\nIt's like Mecca to the dealer that's selling it raw\nSo many deceive ya'\nI'm more in touch with the keys, move over Alicia\nI force feed ya the metric scale\nRap's like child's play, my show and tell\nWithin each verse you see the truth's unveiled\nThey manufacture proof as they lie to themselves\nPuppets on the string like a yo-yo\nBouncing like a pogo, they praying I never go solo\n\n[Chorus]\nWe got it for cheap\n\n[Interlude: Mr. Lee]\nDo it! (Got it for cheap) I fuck wit the real niggas, daddy\nFuck these bitch-ass niggas (G-g-got it for cheap)\nLo' tiene temblando tu a todito ello, loco\nThey just wanna be you, loco!\nFucking envidioso\nBunch of palomos\n\n[Verse 2: Malice]\nThe wool's removed and now I see\nMy leg was pulled, the joke's on me\nSo heartbreakin, like lovin a whore\nMight hurt ya once, but never no more\nIt's like tryin to fly but they clippin your wings\nAnd that's exactly why the caged bird sings\nWho can nickname it? The shame rings true\nSeems to me reparations are overdue\nI done been to the top, I done sipped the juice\nAnd with that being said, bird crumbs'll never do\nEven on my last, not a penny in the bank\nI'ma stand on my own, so thanks, but no thanks\nKeep the pranks as I bid farewell\nI gotta answer to Marcus and Jennelle\nAnd to little brother Terrence who I love dearly so\nIf ever I had millions, never would you push blow, never\n\n[Chorus]\nWe got it for cheap\n\n[Interlude: Mr. Lee]\nAy, dios mío! Malicioso!\nThe handcuffs are off now Daddy\nEntiende! Cabroncito\nEveryone must pay now!\nBunch of mama huevos, toditos\nRe-Up Gang Records\nIt's your game now, daddy\n\n[Verse 3:  Pusha T]\nI'm the best since he died, and he lied\nThe spirit of competition, one verse could start jihad\nCPR Pusha, the flow tends to revive\nPullin the covers back, I expose what you disguise\nMy presence is felt, the pressure is on\nA 4'11\" Cuban helped us weather the storm\nPyrex and powder, it was back to the norm\nThrough all the adversity, the fury was born\n\n[Verse 4: Malice]\nNiggas don't get the picture, it's written in scripture\nEven ask your mama, she'll tell you that blood's thicker\nAnd I don't know how them other niggas built\nAnd I don't know if ever they feel guilt\nOr maybe niggas just too high on they stilts\nBut this one's on me, I'ma view it as spilt milk\nGrandma, look at me, I'm turnin the other cheek\nIt's the R-E-U-P G-A-N-G\n\n[Chorus]\nWe got it for cheap\n\n[Outro: Mr. Lee]\nFrom the street to this música\nWe get this money, we never stop\nRecord sales? Digital scales? It's whatever\nWe always at home\nHell Hath No Fury\nEl sueño de un jodedor tratando de realizarlo\nMr. Lee!"}], "artist": "Clipse"}