{"songs": [{"title": "Free Crack 4 Intro", "album": "Free Crack 4", "year": "2017-06-23", "image": "https://images.genius.com/977ce8f2a06fdc6d78002a3fa6ed087e.400x400x1.jpg", "lyrics": "[Intro: 50 Cent & Lil Bibby]\nGot me feelin' real bulletproof in this motherfucker\n'Cause the windows of my motherfuckin' Benz is bulletproof nigga (yeah)\nAnd my motherfuckin' vest is bulletproof nigga (hah)\nAnd my motherfuckin' hat is bulletproof nigga\nBut the doctor said if I get hit I could have a motherfuckin' concussion\nBut better that than a hole in my head, right nigga?\nHahaha (aw)\n\n[Verse 1]\nBitch we armed and dangerous\nYou ain't no limit, can't hang with us\nAin't too many that can bang with us\nNiggas want smoke, well flame it up\nWhat you been smokin', some angel dust?\nYou're mad 'cause your bitch got a thang for us?\nYou really want smoke with the gang for her?\nYou thinkin' 'bout losing your brain for her?\nNiggas got choppers, the same as us\nBut I don't really think they insane as us\nWe come to your block and change it up\nThey take off they jersey and hang 'em up\nLook, I wanted to be like D-Rose\nMama was broke and I needed some clothes\nThen I started wyling and kicking in doors\nLooking for fiends that be playin' with they nose\nGot off my ass and start settin' some goals\nMy neck got upgraded from silver to gold\nI start a track, I need different hoes\nI keep me a row, I need me a Rolls\nRemember them times had to sleep on the floor\nNow all my seats on the floor\nM O B, won't pay a fee for a ho\nAnd I still scream free the Ro\nThey want me chained up but I came up\nYoung nigga 'bout to fuck the game up\nMovin' slow so I switched the lane up\nKept it Ben Frank, never changed up\nIf it's 'bout money you know I get plenty\nI ride with the semi, I die with it with me\nDon't try Lil Bibby, the savage is in me\nI'ma get rich 'til I die like I'm Fifty\n\n[Interlude]\nI'm tired of fuckin' playin'\nI got my recognition\nI done came up every step I came up\nI came up, I came up from these streets\nHuh?\nLook\n\n[Verse 2]\nLet's be serious, niggas be actin' like they on they period\nTellin' these lies but I am not hearing it\nThey play in the ride but I am not feeling it, cut it off\nI do not like being lied to\nEBK, let me remind you\nNiggas be talkin' like gangsters until I go hop out, lil brother come find you\nKill everybody behind you\nOr in the front and the side too\nYour partner 'nem wanna be cool\nIf he fuck with you then he dying too\nNiggas keep hating, I'm losing my patience\nI fuck with some haitans who'll make you a patient\nThese niggas ain't gon' be satisfied\n'Til the doc tell mama you ain't gon' make it\nNigga it's 'bout time that I go super saiyan\nMy brothers been telling me Bibby quit playin\nI got a short temper so watch what you sayin'\nTell all these crackers just hurry and pay him\nThey don't understand, bitch I'm the man\nFuck her then kick the bitch out like she payin'\nDealt me the cards, just watch how I play 'em\nFuck a hit record, Free Crack for the land"}], "artist": "Lil Bibby"}