{"songs": [{"title": "Gomen Nasai (ごめんなさい。)", "image": "https://images.genius.com/17eb391459f24a859fae1486bc662488.620x620x1.jpg", "lyrics": "[Verse 1]\nI was going postal\nDummy like a Slowbro\nCheating, that's a no-no\nThinking I'd finesse her with the words though\nShawty hit me with the stunner like she fucking Stone Cold\nFrequent flyer mileage, I had bitches out in Tokyo\nShe knew bout the hokey-pokey at the karaoke though\nThought shit was sweet just like candy\nNow you cannot stand me\nI played myself just like the rope-a-dope\nYou kept it real with me\nHow these hoes gon tempt me like this?\nI can't let you go\nGirl, I'm sorry, I know I ain't shit\nFed up with me, the ending was sure to come\nNow I'm stuck watching two turning into one\nIf there was problems, why you didn't mention em?\nTrees is your habit, now your ass crashing into one\n\n[Hook]\nGomen nasai, oh\nI didn't mean to make you cry, oh\nI'm sorry 'bout the lies\nGomen nasai, oh\nI didn't mean to make you cry, oh\nI'm sorry 'bout the lies (gomen ne!)\n\n[Verse 2]\nI'm feeling so sick, no NeYo, need a medic\nWhy all the good times we hold, oh, we forget it?\nI never ever was faithful, I let you tell it\nYou got me looking for love advising on reddit\nAnd now I'm wishing we could reset it\nYou don't believe me now\nYou went from swimming in sheets to wanting to see me drown\nI made mistakes once or twice, a hundred times\nEven when I don't deserve it won't stop me from wanting mine\nBut ah...\nIs it too late now to say sorry?\nCuz I don't wanna be another example of when love gets trampled on and end up on Maury\nBut everybody is sorry and everyone lies\nAnd nobody miss it until the well runs dry\nSo Imma let you cheat, we'll call it even, yo\nThough I hate the thought, I'd hate it even more to see ya go...\nGo!\n\n[Hook]\nGomen nasai, oh\nI didn't mean to make you cry, oh\nI'm sorry 'bout the lies\nGomen nasai, oh\nI didn't mean to make you cry, oh\nI'm sorry 'bout the lies (gomen ne!)", "year": "2016-07-28", "album": "goldUn Child: 2"}], "artist": "Ace Hashimoto"}