{"artist": "Ice Cube", "songs": [{"title": "Growin Up", "lyrics": "[Ice Cube]\nHa ha, that's my shit\nTurn it up {*echoes*}\nUhh, yeah\n\nI hear a beat like this, and think about growin up\nHouse parties, with gangbangers showin up\nRepresent your hood, everybody throw it up\nThey say Cube get on the mic, nigga blow it up\nI used to be lyrical, political\nBut now you want it sugarcoated like cereal\nFirst I met Dre, then I met Yella (yessir)\nDr. Dre made me rap acapella\nMe and Jinx did a show at Dooto's\nWith K-Dee, I think it was two shows\nThen Dre introduced me to E\nCruisin down the street in his red Jeep\nHe said, yo niggas we should flip it like this\nCause them Boyz N the Hood like the gangsta shit\nI put the pen to the pad, young nigga was raw\nAnd told the world how we felt about the law\nIt was real\n\n[Hook 2X: samples] + (Cube)\nI see the happiness (all day every day)\nI see the pain\nWhere am I (growin up in the hood)\nBack down memory lane\n\n[Ice Cube]\nOh shit, it's N.W.A.!\nThem niggas on tour and they comin our way\nLil' Eminem is still tucked away\nIn that trailer park, just bumpin our tape\nJerry Heller tried to make his escape\nI had to bounce, while other niggas got raped\nSame niggas turned around and said fuck me\nNo FUCK YOU cause I'm down with Chuck D\nAnd I'm 'bout to do a movie up, a classic\nWhen I hit the screen, nigga it was magic\nNever thought I'd see Eazy in a casket\nThanks for everythang, that's on everythang\nI learned a lot of game from you\nI like your son, he got his name from you\nI tell him everythang that he need to know\nIf he ask my advice, I won't think twice homey\n\n[Hook]\n\n[Ice Cube]\nFrom _Boyz N the Hood_, to _XXX 2_\nEverybody wanna know my next move\nFans all around say \"We love you Cube!\"\nI wanna take time to say I love you too\nI love all my fans cause they know I'm a man\nAnd not a little boy or some fuckin play toy\nA lot of niggas say I grew up on you\nAnd let me know if anybody fuck wit'chu\nCause you talk a lot of shit about the red, black & blue\nAnd how they treat a nigga called Katrina, did you see her\nWhite folks worry 'bout them fuckin misdemeanor\nWhile black people dyin in that God damn arena\nJust because I'm actin nigga never stop rappin\nIt's in my blood homey, I'mma keep the party crackin\nMoney keep stackin 'til they put me in a casket\nWho you think you fuckin wit? Here's another classic\n\n[Hook]\n\n[Ice Cube]\nI'm Ruthless, I'm Ruthless..\nStreet Knowledge..\nLench Mob..\nWestside..\nUhh..\n\n[Hook] - 1/2", "image": "https://images.genius.com/c4141aa982e145b56c3c52c3fbd1c258.1000x1000x1.jpg", "album": "Laugh Now, Cry Later", "year": "2006-06-06"}]}