{"artist": "Kid Rock", "songs": [{"image": "https://images.genius.com/ef9beb732b2ecfffbf27f7606bcdeed3.500x500x1.jpg", "title": "Forever", "year": "2001-11-20", "album": "Cocky", "lyrics": "[Verse 1]\nHaha\nOoh, I'm back (back), the fog is lifted\nThe earth has shifted, and raise the gifted\nYou knew I'd be back, so pack your bone\nAnd hit the road Jack, because daddy's home\nWit the funky hot wrists, thick like Al Rocker\nPumping out hits, getting chips like Opera\nBitch I told ya, do not hate\nOr question the music I make, ugh\n\n[Chorus]\nI make PUNK ROCK, and I mix it wit the HIP-HOP\nI get you higher than a TREE TOP\nYou want to roll wit the KID ROCK (yeeaah!)\nI make SOUTHERN ROCK, and I mix it wit the HIP-HOP\nGot money like FORT KNOX, I'll forever be the KID ROCK\nFOREVER!\n\n[Verse 2]\nThe junky's are, still cigar smoking\nStill the same cause I ain't change nutting\nHuffing, and puffing; I got two rookies\nAll in check doing the redneck boogie\nThe king is back, to retract the wack\nRe-pack my sack, wit the double fat back\nForget all that, I'm still singing (yeeaah!)\nAnd like kids on monkey bars I'm still swingingg\nThought I got dusty, thought I'd get rusty\nThought I'd get rich and quit, oh he must be\nFat and ugly, broke black and blue\nBut I'm trim fit, rich and back for round two\nRed, white and the Pabst Blue Ribbon\nDead right, that's how I'm living\nGiving you more, that the false and fakes\nThey can't make the kinda music I make, eh-huh\n\n[Chorus]\n\n[Verse 3]\nThe black cat is back, in original form\nThe legible, credible, inevitable storm\nWay past the normal, still misbehaving\nFinger in the air and the flag still waving\nDon't come, don't test the boss\nBecause I got this sewn like Betsy Ross\nYou can floss and front, you can taunt and tease\nBut you can't fuck wit rhymes like these\nThumping like a drum kit wit wrists that slit picks\nBumping for the kids who twist, splif and sips fifth\nI got the gift I'm about to unravel\n(Eight ball, side pocket) Eight ball in my jacket\nPussy and blow, you know how I live\n\"You can't say that Kid,\" fuck off, I just did\nWatch me twirl, the earl, the pearl\nOr just keep on Kid Rocking in the free world\n\n[Chorus]\n\n[Outro]\nPUNK ROCK - FOREVER! HIP-HOP - FOREVER!\nTREE TOP - FOREVER! KID ROCK! (yeah!)"}]}