{"songs": [{"album": "Hood Politics VI: Time Machine", "image": "https://images.genius.com/f9e44bc01ab3df8228df9c9e93dfe1f9.499x499x1.jpg", "year": null, "title": "I See Dead People", "lyrics": "I See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nWelcome to the cemetery wonder what i se?\nThis one here died from HIV\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nIm like the reper of death, taking steps through cemetery with my gold bottle of Hen\nThis is jim he the toolman, he flipt his new van over like a rollercoaster got em on a new stand\nAnd this is little Jen her mama had her in the pen, so her future was bleek before it began\nAnd homie right here he was in the grims, til he cold ran the wrong colombian\nPolitision, Collage prison, electrician, officetion, we all gone end up in this position, in the box with our body all stiffen\n\nThis the homie Mark he got murdered by a cop infront of a NY barbershop. Where the kids starve allot, Og's spark allot, so the D's spark does not, right in the parking lot\nAnd this is little chris he went through some shit, he had scoliosis and roller coasted his wrist. But nothing close to this kid named rolen nahodacig put toasters up to his wig and roasted him like a pig\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nWelcome to the graveyard wonder what i se?\nThis one here yes he must have OD\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nWhat a wild day i seen a old lady burying a crack baby that was only three days. And this my homie kane he died in a plane crash with the oxygen mask stuck to his face. And this is little faith, she sip a little case with a grey goose and drive a lex coupe. till she's all stay true but swurve them play goose til she pop pop poped right our her sun wouth. this the crazy truth, this mamy rockin daisy dukes got choked until she turnt baby blue, that shit was shady to. cuz this cat around the way shot up the crib missed and hit the baby to. say it ain't true hope you ain't next sincerely yours it's the reper of death and. . \n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nWelcome to the cemetery wonder what i se?\nThis one here died from HIV\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nThis is little Tamy her uncle went up in her panties and hurt her badly when she was stayin over grannes. started takin zanex to erase the man who gave her bad memory she fucked around and toke to many. And this the homie Mani he liked to skydive til he hit a high ride ended up on sci fi\n\nAsked the lord why? but he could care less sincerely yours it's the reper of death and\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nWelcome to the graveyard wonder what i se?\nThis one her yes he must have OD\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People\n\nI See Dead People"}], "artist": "Termanology"}