{"artist": "Yella Beezy", "songs": [{"image": "https://images.genius.com/c0f90591068ddfa0736db83f494fdcb6.600x600x1.jpg", "year": "2019-07-19", "album": "Baccend Beezy", "lyrics": "[Intro]\nWe global now\nHey \n\n[Chorus]\nIf  you ain't help me get it, don't tell me how to spend it, ayy\nFive percent tint, that mind your business\nEngine roaring, watch me smash out in the Bentley\nPut  'bout thirty in my mouth, just ask my dentist (Hey, hey)\nI  got bands too, I'm the man too\nI wanna see you make it hot just like Dan Rue, hey\nOh,  you brand new? I heard it's ran through\nThat's your cousin? We can keep it in the fam too\n\n[Verse 1]\nHey\nBack to back foreign, engine roaring in the Bentley\nIf  the head boring, she ain't goin', suck me dentally (True)\nChoppers on go, hitting notes like a symphony\nMotherfuck these silly broads and these boys, ain't got shit for me\nGot a fine bad mamajama out in Tennessee\nLine for the J's just like the number 23\nBig loud .50 cal if you think you're tryna bully me\nWord around town, say a nigga ain't good as me\nWoo, woo, woo, shit, yeah\nGirl, I'm tryna see if you can do the splits, yeah\nI wonder if you can throw it back on the dick, yeah\nPussy good, make a nigga nut quick fast\n\n[Chorus]\nIf you ain't help me get it, don't tell me how to spend it, ayy\nFive percent tint, that mind your business\nEngine roaring, watch me smash out in the Bentley\nPut 'bout thirty in my mouth, just ask my dentist (Hey, hey)\nI got bands too, I'm the man too\nI wanna see you make it hot just like Dan Rue, hey\nOh, you brand new? I heard it's ran through\nThat's your cousin? We can keep it in the fam too\n\n[Verse 2]\nHey, keep it in the fam, damn, that pussy righteous, ayy\nMake it rain on me and I'ma strike it like lightning, ooh\nGot the bed rumbling but nah, we ain't fighting\nShe said she like girls too but nah, she ain't dyking\nShe called her best friend up, it's exciting\nTwo bad bitches and they say that they like me\nGrip the dick good, say her pussy lips biting\nFour of 'em got a boyfriend, these hoes trifling\nI ain't tryna cuff you, girl, just one night me\nFeeling like I'm Gucci Mane, bitch, I'm so icy\nI don't give a fuck if your nigga don't like me, ayy\nBig time peaches, motherfucker, so pricy, yeah\n\n[Chorus]\nIf you ain't help me get it, don't tell me how to spend it, ayy\nFive percent tint, that mind your business\nEngine roaring, watch me smash out in the Bentley\nPut 'bout thirty in my mouth, just ask my dentist (Hey, hey)\nI got bands too, I'm the man too\nI wanna see you make it hot just like Dan Rue, hey\nOh, you brand new? I heard it's ran through\nThat's your cousin? We can keep it in the fam too", "title": "Keep It in the Fam"}]}