{"songs": [{"year": "2017-02-17", "image": "https://images.genius.com/408de8d7a71da47ba8c8b3ba86885fce.640x640x1.jpg", "title": "Johnny Hallyday", "album": "Électron Libre 2", "lyrics": "[Intro]\nBig Lemsi Records !\nDonne-moi mon putain d'HayceLem'juice !\nLima. Echo. Mic. Sierra. India !\n\n[Couplet unique]\nJe t'attends sur le parking\nGlock sur la tempe\nNique la mère à Starsky\nMes bikows font sauter la banque !\nPuto, va dire à ta bande, qu'on est nerveux :\nSur le ring et les plates-bandes ! #XV2\nMéga moteur allemand, j'tiens ta pute en laisse !\nMonarque paranoïaque, voyage pittoresque\nOn a tiré sur la dernière roue du carrosse\nJuste parce qu'on a trop bédave, qu'on est bipolaires !\nOK : j'porte le bandana comme à Los Angeles\nAllez tire sur ma banana comme sur ce Maze\nTrop d'jaloux s'approche de ma forteresse\nCe showbiz a capitalisé ce game de merde !\nKhabbat everyday, j'me sens beaucoup mieux quand j'ai vomi la vérité\nHayce Lem' validé ! J'peux tenir aussi longtemps que Mr Hallyday !\nJ'fous la merde et j'suis dans tous mes états\nJ'ai la veine sur le front en mode Végéta\nT'as deux jambes, deux bras :\nL'argent va l'chercher !\nArrêtez d'me gratter, j'ai pas !\nTu veux m'kicker, j'ai la musique dans la peau\nTu m'fais pitié, j'vais t'écraser dans ma paume !\nComme le Phénix je renaît de mes cendres\nSlalom entre les schlagues à chaque mois de décembre\nT'as plus de cocaïne, t'es en pleine descente\nTu vas rayer ta carte grise et revendre tes jantes !\nMoi j'emmerde les gens, j'vis comme j'veux !\nJ'suis un génie incompris qui s'arrache les cheveux\nNan mon pote j'ai pas d'problème avec mes chevilles\nMais je sais que j'suis l'meilleur et j'vais braquer le jeu !\nBande de fils de putes !\nDans tes sons, t'ouvres ta chatte\nFaut qu'on s'voit nous deux !\nHein Gringo ?! La dernière fois que je t'ai fumé, y'avait ce petit goût de beuuuh !"}], "artist": "Hayce Lemsi"}