{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/2435f727d48cd3047e7ebf62372980b1.500x500x1.jpg", "title": "A Crying Heart", "year": "2008-05-20", "album": "Behind the Stained Glass", "lyrics": "(Priest talking)\nYeah, yeah, my name is Priest\nYou know what it is man\nHere me out there world\nWhat you got on this man?\nBig time we gotta get it\nWhat's over there? I go it\nLock that, Priesthood, knaw'mean?\nIt's real son, it's real son\n\n(Hook) Priest\nI only fucks - with - what's - real\n\n[Killah Priest]\nLet he who have sin, sin no more\nTired of kicking in doors, shootouts,, blood and gang wars\nChainsaws, tied up spouses, cocaine laws\nHawaiian outfits with SKs that bloodstain walls\nTill you're losing ounces, niggas see the life that drug game calls\nYou're crying fountains on the calls, saying, \"Please, she's only four\"\nPleading the merciless men that murder your kin\nSending you threats over the phone and they murder again\nNow you either make the payments or funeral arrangement\nContemplating, federal building put their name in a statement\nPoor choices, take this like the gem from the pearl of oysters\nStill wet on my tongue, rep where you're from\nAnd your boy just see real niggas respected\nDeliver this message to the dumb and the deceased\nWe all from the streets, made they rest in peace\nWhile I wreck this beat with techniques\nResurrect speech with flows are deep in soul\nI tell Ms. Rahman, I'm sorry what happened that evening\nBut it was Tone; his name came up now we even\nAnd Mr. James I wish I could change, but Todd\nShouldn't of did what he did, you can't blame Rob\nAnd Ms. Stevens, what can I say? A close call\nBut it wasn't me you visit at the morgue\nWhen they killed Spark that night, my heart went to the right\nMy chest got tight, that was a hard one to fight\nHood mysteries that no one could figure out\nPlain and simple, facts were there\nGoing through packs of beer\nMake me run to the roof; let the Mac off in the air\nYou was always strapped, gave me dap then threw up the pairs\nLike yeah, I missed those years, I dish out tears\nStrange dreams at night make me wish you was here\nTommy you should have watched your back\nInstead he let them niggas plot and then form an attack\nHis shots echo, bounced off the building in the ghetto\nMass genocide, inner-city children of the borough\nAnd Mr. John, I did what I did cause of revolution\nYou're damn near sixty, may you lay next to Newton\nThe dollar bill, \"In God We Trust\"\nDoes God stand for Guns, Oil, & Drugs they gave to us?\n\n(Hook) Priest\n\n[Killah Priest]\nIts project living regardless revolvers are spitting\nWhen drama is lit, ganja get clipped, the mission\nNo bottles with ribbons, just hollows from Henchmen\nHell swallows us, death follows up\nBullet shells, toddlers get bucked\nBlack male role models are fucked\nThe little girls promised the world but tomorrow turn sluts\nYou either playing basketball or pushing crack in the hall\nOr either rap or getting macs out the board\nNow what's that, white supremacists?\nNo rights for immigrants (no rights)\nLife imprisonment, some get life sentences\nSecret indict, wife swapping with businessmen\nWe fight militant, deep as the words they're writing Genesis\nBlack paintist Rome-like the images\nThis goes to the judges and the sentences\n\n(Hook) Priest"}]}