{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "É Nossa", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1]\nCabeça em chamas, nigga é ghost rider\nCaveira é de pedra, meu encéfalo é de lava\nNunca escondo a cara por mais que isso arda\nNem preciso de oxigénio, comburente é a tua raiva\nBitch nem duvides q'eu à noite acendo logo\nPega no teu bong, eu 'tou pronto para o jogo\nJá tens a moeda, insere e chega-lhe fogo\nRola calca acende bafa prende, adeus folego\nFica o sufoco, esquivo linhas de soco\nAcerto uma linha minha até o lyoto sabe a pouco\nNão 'tou louco nem maluco, 'tou apenas malouco\nCorto as mãos ao punchliner, agora o dread só dá coto\nEle mete a protese pa' dar em props em mim\nJá diz que o prof é boss e qu'é ganda mc\nEnquanto digo «fuck-off nigga you don't know me»\nAí ele volta a tentar mas eu nem me mexi\nCuz he can't see me, miopia universal\n'Tou pra lá do horizonte em cima de um pedestal\nJá nasci bruta-montes e ainda virei bruto-estalo\nAgora desmonto mal comece o instrumental\nConheces o instrumental? Então tenta lá mata-lo\nFalar fica fácil quando não tens nada a grava-lo\n«É um mero chavalo» Tu nem venhas provoca-lo\nÉ que se o caldo entorna eu obrigo-te a limpa-lo\n\n[Hook]\nA cidade é nossa, partilhada pela family\nA ganza é grossa da grossura duma damn tree\nCais na fossa se te frontas contra jam aqui\nTomada de posse, o game é nosso, preciso repetir?\n\nA cidade é nossa, partilhada pela family\nA ganza é grossa da grossura duma damn tree\nCais na fossa se te frontas contra jam aqui\nTomada de posse, o game é nosso, preciso repetir?\n\n[Refrão]\nTraz a female, traz a female\nPinto-lhe a cara toda, abre o olho, bota rímel\nManda vir mel, manda vir mel\nSou Winnie the Pooh, com a cara nele viro caramelo!\nFaz uma big L, faz uma big L\nQueimo o jogo todo, piso e derreto o chinelo mano\nFuck o papel, fuck o papel\nPa' ser rei desta merda não preciso d'um castelo mano\n\nTraz a female, traz a female\nPinto-lhe a cara toda, abre o olho, bota rímel\nManda vir mel, manda vir mel\nSou Winnie the Pooh, com a cara nele viro caramelo!\nFaz uma big L, faz uma big L\nQueimo o jogo todo, piso e derreto o chinelo mano\nFuck o papel, fuck o papel\nPa' ser rei desta merda não preciso d'um castelo mano", "year": "2014-06-06"}]}