{"songs": [{"title": "Numb", "lyrics": "[Intro]\nYeah\n\n[Verse 1]\nHow you gon' fuck with my pride?\nHow you gon' fuck with my mind?\nHow you gon' make me go numb?\nBitch, you gon' make me go dumb\nBig smoke pokin' my lungs\nBig drink, yak, no rum\nHad to get away with my sons\nHad to get away with my dons\nIt's so hard, Big Pun\nI don't wanna be a player, Big Pun\nI don't wanna be around no one\nGimme a drink and I'm on one\nWith the boys, sip a cold one\nHit the road like a roadrunner\nShe don't love me but the hoes love her\nCupid tryna take her soul from her\n\n[Pre-Chorus]\nYeah, fuck love, fuck love\nI don't wanna love, I don't wanna love\nI just wanna take these drugs, yeah\nI just wanna take these drugs, yeah\n\n[Chorus]\nTake these drugs and go numb\nI just wanna go numb, numb, numb\nNumb, numb, numb, numb, numb, numb, numb, numb\nI just wanna go numb\nI don't wanna feel nothin', nothin', nothin'\nNothin', nothin', nothin'\nI don't wanna feel nothin'\nI don't wanna feel nothin', no\n\n[Verse 2]\nHow you gon' fuck with my heart?\nYou play with my heart like darts\nYou broke my heart into parts (Yeah)\nHow you gon' stop what we start? (Damn)\nHow you gon' break what we build? (Build)\nHow you know this wasn't real? (Real)\nI know you feel what I feel (Feelin')\nYou turned my heart into steel\nI feel like I'm Jack and I'm Jill (Feel like I'm Jack and I'm Jill)\nTryna get over this hill (Tryna get over this hill)\nNo, I'm not poppin' no pills (No, I'm not poppin' no pills)\nI just smoke weed and I chill (I just smoke weed and I chill)\nYeah, I was tellin' you lies (I was tellin' you lies)\nYeah, I fucked up sometimes (Times)\nBut why would you fuck with my pride? (Why would you?)\nWhy would you fuck with my mind? (Why would you fuck with my mind?)\nI know I wasn't right, but I tried\nI know I wasn't right, but I... yeah\nI know I wasn't right, but I tried\nI know I wasn't right, but I...\nI know I wasn't right, but I tried\nI know I wasn't right, but I tried, yeah\nWhen they tell you it's up, better hide, yeah\nWhen they tell you it's up, better hide\nWhen they tell you it's up, better hide\nWhen they tell you it's up, better hide\nBut you'll see the truth in my eyes (Swear you'll see the truth)\n\n[Pre-Chorus]\nYeah, fuck love, fuck love\nI don't wanna love, I don't wanna love\nI just wanna take these drugs, yeah\nI just wanna take these drugs\n\n[Chorus]\nTake these drugs and go numb\nYeah, I don't wanna feel nothin'\nYeah, yeah, I don't wanna feel nothin'\nYeah, yeah, I don't wanna feel nothin'\nYeah, take these drugs and go numb\nI just wanna go numb, numb, numb\nNumb, numb, numb, numb, numb, numb, numb, numb", "album": "Herstory In The Making", "year": "2019-09-27", "image": "https://images.genius.com/f06180c99d3e1065bc630862c9787d3d.1000x1000x1.jpg"}], "artist": "Young M.A"}