{"songs": [{"album": "Para Tu", "year": "2013-10-21", "title": "Heather", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Verse 1: L.E.]\nAs I looked at my watch and try to gather my thoughts\nThat was locked in a box, outside, the reflect of the clock\nThat was on my wall, aw dog, you been thinkin' a lot\nDrinkin’ a lot of the lean and smokin' the pot\nHeather swallowed my dick and called it her black cock\nAnd said that she'll be back so don’t tax for the crack rock\nAnd I'm like, \"you could bet not,\" better get you some snapshots\nIn your mind of some type 'cause I'm a stand up type of guy\nYou'll be surprised what these bitches'll do\nKeep my blunts rolled, pronto, even give me they soul\nIf you don't know then I know what you didn't befo’\nAre you convinced that I’m the prince that told that y'ain’t know?\nSorry, didn't mean to fool ya, but yeah I'm the manure\nCan I get a Hallelujah? Baby it's Michael Jr\nSorry, didn’t mean to fool ya, but baby I'm the manure\nCan I get a Hallelujah? 'Cause bitch it's Michael Jr\n\n[Chorus: J.I.D]\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la\nI wrote this shit when I ain't have a dollar mane\n\n[Verse 2: J.I.D]\nYeah, I seen your face real big on the poster\nWalled you out, now it serves as a coaster\nLive mixtape, download it to a folder\nPlay it, delete it, shit was slowin' up my modem\nHope you quick enough to dodge the shots niggas throwin'\nHead, shoulders, arm, back, stomach, scrotum\nOh, but we ain't done yet, we bustin' 'til the sunset\nLet's get a little deeper, we ain't even havin' fun yet\nL.E. said I'm humble as fuck and I could stunt\nBe loud, smellin' myself, shit, I'll leave it to my blunt\nOnce I'm done with this flow, I'll leave it to a dust\nLet 'em fuck it up, cocaine your nose with a uppercut\nFuck is up? Feelin' so anti-sober\nIn NY looking for leaf like a clover\n[?] pronto [?] what you wan' do\nDo what your mind can't do, finna go on the run though, holla\n\n[Chorus: J.I.D]\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la\nI wrote this shit when I ain't have a dollar mane\n\n[Verse 3: Hollywood JB]\nBang, bang, whoever thought you'd find\nA iller group of niggas who was rollin' in the same gang\nBeen goin' balls to the walls, now it's time to let my nuts hang\nAnd I'm still hustling, niggas still tryin' to jock the slang\nAnd they bitch is lookin' for a cock to swing on\nGo up and down, get they stock exchange on\nThe ride get rough so hang on, and I just do me\nAnd I'm so Lati' I could fuck around and get my sang on\nAh Ahem, like\nU-N-I-T-Y, and we all equal but if you and I was ever tied\nThen I prob'ly wasn't doin' somethin' right\nLike when I piss and hiccup at the same time\nAnd then I hit your chick up like, \"What you doin' tonight?\"\nAnd then she send me pictures of that ass, so that ass in disguise\nYou know she doin' the plank on the vine\nWhere you plank on the wood while the guy's in recline\nI think it's called the ride to the sky\nI ain't really sure, I just heard it was tight\nDamn, what's with the evil eye?\nI'm chill, no I'm not a evil guy\nNot a fan of lettin' all that bullshit fly y'all jump on\nI just like to lead, want to follow? Then come on\nY'all chose the same path, I found another to run on\nAnd when I get on top I got a lot of niggas to stunt on"}], "artist": "JID"}