{"artist": "Wale", "songs": [{"title": "Fitted Cap", "year": null, "lyrics": "[Intro: Rick Ross]\nBeat Billionaire\nYou know I stick to the script\nTwenty-million dollar nigga, but I do it like this\n(M-M-M-Maybach Music, Maybach Music)\nMy Jordans high-top, snapback fitted cap (huh!)\nMy Jordans high-top, snapback fitted cap (huh!)\n\n[Chorus: Rick Ross]\nMy Jordans high-top, snapback fitted cap\nMy Jordans high-top, snapback fitted cap\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\nMy Jordans high-top, snapback fitted cap (woo!)\nMy Jordans high-top, snapback fitted cap (woo!)\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\n\n[Verse 1: Wale]\n(How can I not talk big? I got to)\n(Wale, look, yeah, uh)\nFerrari Mikes, bitch, I'm on my car show\nMy chick black and white, she ain't no dime, that bitch a Concord 11\nKnow I'm reppin' this, shoot and I don't ever miss\nThe coupe I'm in is rented, I ain't wit' all that commitment shit\nP-R-Ps is proper, couple Gs when I'm shoppin'\nMy girls and my SBs, got a thing for pink boxes\nShout out Frankie the Butcher, shout out Mishka in Brooklyn\nThat's some nigga from 10.deep ATL, I’m wit' the cooker\nI ain't even tryna fool, ho, I ball like private school\nYou bammas like Hyperstrikes, your wifey sleep outside of you\nAnd NT my niggas, you know just we just need more shit and\nIt's ironic how I drop some dough when I got them Homer Simpsons\nLook, pine green Foams, they may never see the store\nGot LeBron Entourages like Maverick and Richie Paul\nBitch, I ball, ho, you lame, look at my Laneys, switchin' lanes\nLook at my 9s, look at my Blazers, look at my 4s, cut wit' laser\nLook at my whore, that is your lady\nLook at my flo', makin' y'all crazy\nMakin' y'all sick, y'all cannot tame me\nLexus drive me, Maybach pay me\nSalute\n\n[Chorus: Rick Ross]\nMy Jordans high-top, snapback fitted cap\nMy Jordans high-top, snapback fitted cap\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\nMy Jordans high-top, snapback fitted cap (woo!)\nMy Jordans high-top, snapback fitted cap (woo!)\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\n\n[Verse 2: Meek Mill]\nYo, I said I'm swaggin' out in my Cool Greys\nNo LL, but these cool J's\nAnd my wrist froze, but I'm cool sha'\nLike a bald head, I'm too paid\nI'm too blazed, and I'm too high\nGeorge Kush, the whole crew high\nWrong move and that tool fly\nBetter calm that ass like woo-sah\nIt's MMG, MOB, young nigga, I been OG\nWalk around wit' like 10 on me, that 5-7, that fen' on me\nDon’t grin on me wit' them long stares\nYou ain't God then there's no fear\nBig money, all the hoes here, HD, I see it so clear\nWe jeweled out and we racked up\nPhantom beep when it back up\nBig bullets, look like a Mack truck\nShooters ride wit' that Mac tucked\nI'm a Bad Boy, bitch, ask Puff\nSip Cîroc it's my last cup\nOn this shit, I can't stand up\nCatch a case and I'll man up\nThis Rozay, Wale, Gunplay, and that nigga Pill\nIn Brazil, and this shit is real, got bad hoes and that Whip Appeal\nOne week and we get the deal, one day and I fucked the bitch\nMy Levis, they 501, my snapback is hella bent, ha\n\n[Chorus: Rick Ross]\nMy Jordans high-top, snapback fitted cap\nMy Jordans high-top, snapback fitted cap\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\nMy Jordans high-top, snapback fitted cap (woo!)\nMy Jordans high-top, snapback fitted cap (woo!)\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\n\n[Verse 3: J. Cole]\nFresh-ass nigga, no wonder why them hoes be open\nThat’s that nigga, so what'd I say? They okey-dokin'\nHow you figga? You fuckin' wit' me? I hope he jokin'\nI'm witcha girl, you home alone, bitch you Macauley Culkin\nI'm oviedosin', ayy, homie, Cole be smokin'\nThen put my ashes on you niggas, bet you gon' need lotion\nI'm slowly roastin', heatin' up, so you know we toastin’\nFuck hoes wit' no emotion, fade away like Kobe postin'\nOut in Sweden, like ain't shit that you can't tell us\nLord, forgive me, as a kid, I used to look at niggas jealous\n'Cause uh, they had them J's, and my mama wouldn't cop 'em\nCan you blame her? Hundred dollars for them bitches want a option\nNow we livin' much better, nigga, pay whatever\nRock them bitches once then forgot about 'em forever\nMy kicks like my chick, I don't need to know the numbers\nYou just need to know I'm comin', I'll kill you niggas this summer\nCole... Cole, World\n\n[Chorus: Rick Ross]\nMy Jordans high-top, snapback fitted cap\nMy Jordans high-top, snapback fitted cap\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes\nMy Jordans high-top, snapback fitted cap (woo!)\nMy Jordans high-top, snapback fitted cap (woo!)\nThe Rolls-Royce, it's all white\nFoamposites, the LeBrons, I'm fuckin' wit' the Spikes", "album": "Self Made Volume 1 ", "image": "https://images.genius.com/32181ba51dd7d9bc28affe373780c5f4.1000x1000x1.jpg"}]}