{"artist": "Fat Joe", "songs": [{"year": "2011-10-31", "album": "The Darkside Vol. 2", "image": "https://images.genius.com/f2f9e529c5e6328625a53474a16fcb2a.640x640x1.jpg", "lyrics": "[Intro: Fat Joe]\nAyo Hype, what up?\nCrack, nigga!\nDarkside, yeah, yo\n\n[Verse 1: Fat Joe]\nTryin' to cut the top off the Porsche\nPut a bitch in the front\nBetter yet hundred sticks for the niggas that front\nI got a steel in them packs, got 'em right in the trunk\nShoot the snap back off your muh'fuckin' head if you want\nI got a guardian angel, yeah she stay in the hood\nAnd she pop up whenever I touch the grain on the wood\nI got a bitch from Atlanta, she remind me of Pebbles\nGot a hell of an ass, this redbone is a devil\nShe call me Marty McFly, Nike Back To The Future\n10 racks on my feet, but that's somethin' I'm used to\nI put my team on the map, you other niggas is fake\nWorse than Oregon, you switch a different jersey a day\nI'm in the beach somewhere foreign\nI'm in your bitch while you snorin'\nA million cash off the tour, then I'm back in the mornin'\nI'm fuckin' sick of you niggas, I'm about to throw up a million\nDoctor oz in the kitchen: cook a perfect prescription\n\n[Chorus: Dre]\nYeah, gold prezzie, gold prezzie, rollin' in Bugattis\nI got that Ringo Starr\nI'm slingin' Paul McCartney\nBitch I'm in the kitchen with that Arm & Hammer\nWhipping George Harrison, John Lennon\nDopeman! Dopeman!\nDopeman bitch, I'm the dopeman\nBitch I'm in the kitchen with that Arm & Hammer\nWhippin' George Harrison, John Lennon\n\n[Verse 2: Jadakiss]\nOf course I could get 'em\nBut do you know what to do with 'em?\n60 for the brick even if you cop a few of 'em\nTalkin' about that diesel: the root of all evil\nYou could use your nostrils, or you could use a needle\nI need a hundred more, and I want it pure\n'Cause when somebody die off it\nThen they want it more!\nThe hustlers we surrounded by niggas that hold the hammers\nOxys got generic, switched it to Opana's\nWhen you give 'em a 9 or better they go bananas\nMake a million dollars a month: that's what the plan was\nNow to catch the mornin' shift\n'Cause they need that mornin' sniff\nThousand bundles finished by 11, then I'm blowin' a spliff\nShow you how to get right, crib right, whip right\nTen dollars a bag, but it's 20 after midnight\nPill man, weed man, stove man, coke man\nYou know who I am motherfucker: I'm the dopeman\n\n[Chorus: Dre]\nYeah, gold prezzie, gold prezzie, rollin' in Bugattis\nI got that Ringo Starr\nI'm slingin' Paul McCartney\nBitch I'm in the kitchen with that Arm & Hammer\nWhipping George Harrison, John Lennon\nDopeman! Dopeman!\nDopeman bitch, I'm the dopeman\nBitch I'm in the kitchen with that Arm & Hammer\nWhippin' George Harrison, John Lennon\n\n[Verse 3: Fat Joe]\nYo, cut the man off the middle, I want it all off the top\n'Bout to yacht me a nigga, run him off of the block\nI'm takin' all of the profit, purchasin' more of the product\nInvest in killers and dealers to take my company public\nI got a thing for them strippers, got a pole in the mansion\nWhite hoe, (?) Marilyn Manson\nThis for all of my niggas doin' time up in prison\nFor getting caught with the burner, you know a rider's ambition\nI'm 'bout to gamble with life, take a trip out to Vegas\nI'm 'bout a Zionist mic prayin' the Lord to forsake us\nRemember times I was broke, how it run in your pocket\nSpend my money on dope, then I tripled my profit\nNow I'm a multi-millionaire, head off in the lair\nTake bitches on the private, than set off in the Lear\n\n[Break: sample]\n\"What you say nigga?\"\n\"I said I'll suck yo dick!\"\n\n[Chorus: Dre]\nYeah, gold prezzie, gold prezzie, rollin' in Bugattis\nI got that Ringo Starr\nI'm slingin' Paul McCartney\nBitch I'm in the kitchen with that Arm & Hammer\nWhipping George Harrison, John Lennon\nDopeman! Dopeman!\nDopeman bitch, I'm the dopeman\nBitch I'm in the kitchen with that Arm & Hammer\nWhippin' George Harrison, John Lennon", "title": "Dopeman"}]}