{"artist": "50 Cent", "songs": [{"album": "The Lost Tape", "image": "https://images.genius.com/d86b049a9dadb2baf4552acc2c993b97.480x480x1.png", "title": "OJ", "lyrics": "[Hook - 50 Cent]\nPut on my O.J. gloves and watch me kill this shit\nBeat the case then come home and go back from doing some different shit\nI'm pullin' off a O.J, off-off a O.J\nI'm pullin' off a O.J, I'm killin' these bitches\n\n[Verse 1 - Kidd Kidd]\nI'm smoking up my lungs, this liquor drowning my liver\nI'm now using these prescriptions, these pancakes now full of syrup\nMayweather all contenders, I eat each rappers for dinner\nPut these ratting ass niggas in a sewer, Master Splinter\nSound like my phone is bugged, give a nigga the jitters\nI don't give a fuck, tell the pigs to kiss my shitter\nYeah, I'm kind of thinner but Goddamn, you're jeans are slimmer\nI don't want you 'round my children, you look like a sex offender\nPlanet of the Apes, I'm a G-Unit gorilla\nAll these rappers claim they killas, prolly sue you when you hit 'em\nSee I'm not what you used to, I ain't soo-woo, I ain't crippin'\nI'm a Rider Gang nigga, we gon' get it where we fit it\n\n[Hook - 50 Cent]\nPut on my O.J. gloves and watch me kill this shit\nBeat the case then come home and go back from doing some different shit\nI'm pullin' off a O.J, off-off a O.J\nI'm pullin' off a O.J, I'm killin' these bitches\n\n[Verse 2 - 50 Cent]\nGot a new bitch that's so bad, yeah, she don't know what she doin'\nAnd her ass so round and fat, when she touch me, I'm like boooing!\nI want head and I want tails, so I don't wanna flip a coin\nI don't kiss it, I don't tell, so her close friend she can join\nThey don't call me from the pens, that's to see how things are goin'\nSo the money, it still flowing, get a Rider Gang, it's still glowin'\nAnd my neck and my wrist and my ears and my fist, got diamonds all over shit glowin'\nAnd the Lambo ain't got no top, it ain't summer yet but it's hot\nYou gon' lose the speech when you hit the streets and you see the bitches I got\nYou better believe it's real from the Philippines to Brazil\nLil Mexican chica, I want you to meet her, people can give it to you pure\n100% uncut, now nigga you know wassup\n\n[Hook - 50 Cent]\nPut on my O.J. gloves and watch me kill this shit\nBeat the case then come home and go back from doing some different shit\nI'm pullin' off a O.J, off-off a O.J\nI'm pullin' off a O.J, I'm killin' these bitches\n\n[Verse 3 - Kidd Kidd]\nMJG, bitch I got them 8 balls\n4 door garage, bitch, I need 8 cars\nThey want me locked up, they singin' like Akon\nOr shot up like a dope head arm\nBitch my life right and you niggas dead wrong\nI would take your head on, so you can see me head on\nI'm gettin' my air blown, you know what her head on\nShe got my head gone, shit, I'm 'bout to head home\nPimp zone, that's my destination\nStill street, never handed in my resignation\nDing dong, I'm at your doorbell waiting\nWho tryna get served, I'm 'bout to do some catering, huh!\n\n[Hook - 50 Cent]\nPut on my O.J. gloves and watch me kill this shit\nBeat the case then come home and go back from doing some different shit\nI'm pullin' off a O.J, off-off a O.J\nI'm pullin' off a O.J, I'm killin' these bitches", "year": "2012-06-11"}]}