{"songs": [{"image": "https://images.genius.com/3b061185b8a017578796bbe35c4f5557.1000x1000x1.jpg", "title": "Keep It Real", "album": "Nate Dogg", "year": "2003-02-25", "lyrics": "[Intro: Fabolous]\nYeah, recognize and realize\nThis is serious pimpin goin on\nThe game ain't ready, for Nate D-O-double-G\nLil' M-O, Fabolous\nWe 'bout to pimp the damn thing\nLike it's never been pimped before, you feel me?\nYeah, uhh\nFrom the Westside, to the Eastside\nTo the Dirty South, to the Midwest\nC'mon, let's ride, peep game\nYell at 'em Mo!\n\n[Chorus: Lil' Mo (Nate Dogg)]\nI'm gon' treat this game like a hoe\nAnd this trick better have my money fo' sho'\nI'm a player, gangster, pimp and a rolling stone\nAnd I ain't gonna let it go, that's why\n(I'm gon' treat this game like one of my pros)\n(Wanna be number one so anything goes)\n(But my tactics they just can't be exposed)\n(Can't be exposed)\n\n[Fabolous]\nYeah yeah uhh yeah uhh yeah ghetto\nThis kid was enforced by strict parents\nDon't flow for nuttin less than a cross and sick earrings\nA Porsche with sick steering\nNever mind the cost to get clearance\nFor me, if you ask what I cost an appearance\nI'm a pimp, of course your chick's sharin\nI got lawyers, who never lost in fixed hearings\nI need seven figure offers to sign\nCome out your pockets like your needs will be officer blinds\nI send the Street Family and your offer's for mine\nWith blocks, that look like police officer Conn\nIslip's a author of mine, once these slugs is in your head\nDoctors won't be able, to get 'em off of your mind\nHow they gon' take me off of my grind\nThese yellow and white stones glowin somethin awful in mine\nEven if they don't understand the flow, they understand the dough\nTell 'em I said they don't get a hundred grand then go!\n\n[Chorus]\n[Icarus]\nUh-huh, uhh, Icarus, Bushwick, GMG, yo\nNate got all the chickenheads from Medina on the weiner\nCause I hide the nina, inside the Beamer\nI'ma treat this game like a hoe on Hunt's Point\nThey don't have my dough I'ma snipe 'em gunpoint\nMy name Icarus, game ridiculous\nGet in your house quicker than St. Nicklaus\nMe rockin Nate like we need bitches\nCome through lookin evil, three 6's\nGMG, king of the remixes\nAnd music pah is broke we fix it\nAnd we equipped with (what) heat that if we squeeze\nIt'll bring police from three districts\nN.Y. to L.A. we get chicks\nThat smoke haze and drink Ih liquid\nY'all know the flows I be sick with\nIca the Don, trick I be pimpin\n\n[Lil' Mo]\nCause I got this game, right where I want it\nAnd it better have my money\nOr it's gonna get ugly\nYes it's gonna get ugly, that's why\n\n[Nate Dogg]\nThe game is to be sold, not told\nThe tattletale will always be broke\nYou live and learn, just live by the code\nIf you, don't already know\nThat's what it takes now\nRaise the stakes now\nDon't be fake now\nKeep it real (keep it real)\n\n[Outro: Nate Dogg (Lil' Mo)]\nI'm gon' treat this game (you better have my money)\nLike I beat this game (you better have my money)\nWon't leave this game (I'm a player...)"}], "artist": "Nate Dogg"}