{"artist": "WC", "songs": [{"year": null, "lyrics": "F/ Case\n\n[Verse: wc]\nWe been through sl Coupe\nWrist froze like Igloo\nBig Lou, Tony get your sauce swirled\nCome twisting, Nina whistling that you with your home girls\nBig bankers, Big drinker, I see you sneaking\nA peak so I know you live these gangsters\nFreaky thoughts got me cussing at you\nVisualizing me in side ya, baby can we holla\nLookie here lets skip the fake conversation and all the waiting\nMy name is Dub what's crackalatin\nCertified rider, all nighter, dipping in the Impala\nTrying to get you with this anaconda\nBe your friendly neighbor-hood neighbor with paper\nChrome and wood on the Chevy baby\nBust rubbers go deep under covers\nA freaky mother fucka' we should get to know each other\n\n[Chorus: Case]\nCome take a ride with me baby\nMe and my homey bout to blow - Flirt\nI saw you at the light looking bright\nBanging from your head to your toes - Flirt\nCan't tell the future, I don't know what tomorrow holds\nBut we can smoke a little chronic, drink a little\nAnd if it's good, drink a lil' mo - Flirt\n\n[Verse: wc]\nAin't no denying I'm straight buying\nYou in that tight skirt\nCause baby you got my flirt\nShutting all rookies down\nStub down Dub Cezzy\nA. K. A. Pussy Hound\nWho was snitching, punany technician\nTrying to make your head off from multiple positions\nOff a yatch and moet\nI fiend for s**, menage a trois and getting freaky of that ass\nCause I insert it\nSquirt it wit you on top jerking it\nPlaying Mystikal like \"show me what you working wit\"\nRunning up in it playing dead duck let me put the plug in it\nShow you how a thug hit it\nExchange lines, blazing drinks St. Ides\nTrying to do the damn thing wit you\nAnd your girl at the same time\nNo commitments to make the butt riches, a machine loving m vocabulary, flirt\n\n[Chorus:]\n\n[Verse: wc]\nI got a problem, and it's serious as cancer\nNo matter what you call it baby I'm a fuckaholic\nTrying to get you on the lizo to blow\nAnd whistle my melody, part them legs open like the Red Sea\nMake you smack hit it from the back\nWhile I'm creeping in the hood blowing on dubs sac\nAs long as your kit-kat gets wet and percolate\nNo matter the color or size, I can't hate\nI like the skinny ones, thick ones the whole entre\nI even think I'm country for fat monkeys like Beyonce\nWet lips and as ghetto as Vivica\nNasty long tongue known for licking ya\nI might trick a little just to keep the litter\nBut tripping as G gon' cause we goin sip\nI'm mashing to smashing\nThere's too many asses\nI can't role past them, I'm getting at them\n\n[Chorus:] (2x)\n[Outro: wc + (Case)]\n(You me, Dub-Cee)\nUh, Dub-Cee (Flirt)\nCase (that's me)\nNew millenium shit (baby baby babe)", "image": "https://s3.amazonaws.com/rapgenius/1365792063_12686799_ori.jpg", "album": null, "title": "Flirt (Feat. Case)"}]}