{"songs": [{"year": null, "album": "Live at the Renaissance", "image": "https://images.genius.com/385b6e7c56f69d3e4c1f475500b46023.450x450x1.jpg", "title": "Say Something For Me (Request)", "lyrics": "[Intro]\nIt’s for this girl\nAnd she was like—she knew who I was or whatever, right\nAnd she was like, “Yo, I love what you did and everything you’ve done\nI really miss your voice\nAll this music I hear, I dig it, I dig it, and I dance to it\nBut I want something for me\nLike, you know, just for me, you know\nI don’t look at myself as this way or that way\nAnd I just want you to do a record for me\nAnd, you know, those who feel like me and think like me”\nAnd this was a true story, I was, like, touched by that\nI know this kinda un-hip-hop of me to be touched by something\nI did this little joint right here, check it out one time\nListen\n\n[Verse 1]\nHere’s a slow style and it’s never your style\nMC’s rap isn’t really that mack\nYour wishes get a grant from the brother on a slant\nOn the curb, the audacity of rappers, some nerve\nFishing in the ponds of piranha in this game\nCould prove to be fatal if priorities are lame\nBy that I mean, you know, focused in on material\nAlthough it has its place, it should really be residual\nMaking it a point to do it right for you\nYou an upright lady with sass and a brew\nNever will I pass on a little bit of sass\nI’m obliging this request on an Abstract set\nAll the single moms with your children in your arms\nWho do it every day on a hard-earned pay\nResenting the word “ho” that dudes overuse\nI’m sorry for that, mama, some cats are just rude\nAll the elder women who have raised a few divisions\nHats go off to the lives brought forth\nAll the pretty ladies who got to hustle\nWho want to enjoy rap but find there’s a struggle\nFeels objectified so much they get dizzy\nThere’s a million and one ways to say “Get busy”\nAnd to the little angels, little women out there\nWho’s home alone too and at your TV you stare\nYou’re way more precious than the things on the screen\nKeep your head to the sky and just dream\nKeep your head to the sky and just dream\n\n[Chorus]\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\nI don’t even know if you’ll take requests\nBut can’t you say something for me?\n\n[Outro (Vocal Samples)]\nMC’s rap isn’t really that mack\nAudacity of rappers, some nerve\nHats go off to the lives brought forth\nPretty ladies…feel objectified\nThere’s a million and one ways to say “Get busy”\nWay more precious than the things on the screen\nKeep your head to the sky and just dream\nKeep your head to the sky and just dream\n\nI don’t even know if you’ll take requests\nBut you can’t you say something for me?\nI don’t even know if you’ll take requests\nBut you can’t you say something for me?"}], "artist": "Q-Tip"}