{"songs": [{"image": "https://images.genius.com/6e672c139a6e77928ac847b6c6f61258.422x421x1.jpg", "title": "Taiwan to Texas", "album": "Exclusive Audio Footage", "year": null, "lyrics": "[Intro - Pharrell Williams]\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Where you at?\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Where you at?\n\n[Hook]\nFrom Taiwan to Texas, Lambos to Lexus\nDiamonds in my necklace\nLeave y'all bitches breathless\nYou don't want to test this\nBurners leave you chestless\nThousand niggas restless\nDo you get my message?!\n\n[Verse - Pusha T]\nYo, choose your sides, we coming for the top\nY'all niggas bout to drop like fall guys\nWhen I speak, all rise\nOr get trampled over in Range Rovers with fog lights\nTonight's got a feel in the air, caused by they stare\nAnd the spots that we walk, patrons whisper and glare\nYou know we coming minked out\nEars, neck and wrist freezed out\nLooking like we robbed the Sphinx out\nHaters in the back, you know they Cuban King'd out\nJealous as ever, we took the handmade link routes\nTwo vandals, twin calicos with pearl handles\nDonuts, middle of street, in pink Lambos\nPassenger seat, glanced at her feet, hot pink sandals\nSparking my heat, told me her name was Roman Candles\nYo, ya'll know who we are, you're looking at stars\nClipse are the ones breakin the law\n\n[Hook]\n\n[Verse - Malice]\nYoung guns bustin out, targa tops and drops\nSipping on Black Label lacing it with scotch\nReady or not we comin' at y'all, ready and cocked\nWith one shot, accurate hit with red dot\nNinety degrees, ninety-five speed, feeling the breeze\nNinja style, twelve-hundred CCs, travel in threes\nWe dabble in speed, poppin wheelies on the interstate\n355 with fish gills, watch how they ventilate\nMy time radiate, my sons they got manners\nThey cock hammers, hear bout my dogs on cop scanners\nCat's wanna come to my clique, borrowin beats\nBut the Clipse got all this on lock, swallow the key\nWe plane hoppin, meanwhile y'all name dropping\nWent from train hopping to diamond exchange shopping\nTank-topping wit links, ice dropping in drinks\nMalice winning much, rocking the mink, what!\n\n[Hook]\n\n[Bridge] (Pharrell)\n(Tell em where the fuck you from!)\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak (yeah, c'mon)\n\n[Verse - Pusha T]\nYeah, who got it sewn up?\nWho got a thousand on they side with signs that's thrown up\nShit, we got it blown up\nWhile y'all take the bus our bitches is flown up\nFour wheeling, popping hot bars at the ceilin\nWe cock back, auto-matics because it's thrillin\nAsk yourself, you ready to try? you ready for I?\nAssed out, mashed out bitch, get ready to die\n\n[Verse - Malice]\nIt's wild how we fall up in pubs and night clubs\nLadies show love by giving back rubs in bathtubs\nSwitch that, backing the thugs wit black gloves cause they actors\nCatching our slugs with fractures\nRunning wit thirty niggas who looking for where beef at\nClipse name come out they mouth, we make em see black\nThey blind in they third eye, my view is bird's eye\nMalice eliminate every first, second and third guy\n\n[Hook - repeat 2x]\n\n[Bridge] (Pharrell)\n(Tell em where the fuck you from!)\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak - Star Trak\nStar Trak, Star Trak (yeah, c'mon)\n(Tell em where the fuck you from!)\nStar Trak, Star Trak - Star Trak (Huh)\nStar Trak, Star Trak - (bitches) Star Trak (yeah, uh)\nStar Trak, Star Trak - (yeah) Star Trak"}], "artist": "Clipse"}