{"songs": [{"title": "Broke My Wrist", "album": null, "year": "2016-11-11", "image": "https://images.genius.com/716534bb7ece4eece79121d4e801f4d4.500x500x1.jpg", "lyrics": "[Intro: Lil Pump]\n(Ahem)\nDamn, why you flex like this? (Lil Pump)\nLil Pump, trapper of the century (Ooh, ayy)\n(Ronny J produced it)\n\n[Chorus: Lil Pump]\nDamn, why you flex like this? (Ooh)\nDamn, why you flex like this? (Ayy)\nJohnny Dang on my wrist (Johnny)\nJohnny Dang on my wrist (Ayy)\nLil Pump got them bricks (Brr)\nLil Pump got them bricks (Bricks)\nI just broke my wrist (Ooh)\nI just broke my wrist (Ooh)\nI just broke my wrist, ooh\nI just broke my wrist, ooh\nI just broke my wrist, ooh (Lil Pump)\nI just broke my wrist, ooh\nLil Pump got them bricks, ooh\nDamn, why you flex like this? Ooh\nJohnny Dang on my wrist, ooh (Lil Pump, Lil Pump)\nJohnny Dang on my wrist\n\n[Verse 1: Lil Pump & Smokepurpp]\nOoh, Lil Pump fucks your sister, damn\nFound that bitch on Twitter, damn\nWrist on, wrist on, wrist on, wrist on... (Ooh)\nNever take a bitch to a dinner (Never)\nLil Pump in the White House (Woo)\nMade White House turn to a trap house (Woo)\nReal trap nigga, I'm from down south (Trap)\nNiggas mad at me 'cause they ain't got clout (Clout)\nFuck school, nigga, I rather sell pounds (Ooh)\nIf we got beef, we can meet right now\nIf we got beef, we can meet right now (Yeah)\nIf we got beef, we can meet right now (Yeah, ayy)\n\n[Verse 2: Smokepurpp]\nTwenty thousand on my pinky ring\nDiamonds never stain, lookin' like cocaine (I don't even care)\nI'ma stack this money higher, higher (Yeah)\nGet flyer, flyer, get higher, higher (Yeah, okay)\nI'ma run this check higher, higher (Yeah, yeah)\nGet flyer, flyer, get higher, higher (Yeah, okay)\nTwenty thousand on my pinky ring (Yeah, oh, what?)\nThirty thousand on a fuckin' chain (Yeah, okay)\nOoh, I just broke my back\nOoh, Lil Pump still sell crack (Okay)\nDiamonds dancin' like they Lil Kim\nWith no VIP, posted in the back (Uh)\nNiggas sayin' Lil Purpp a goofy, Lil Purpp a goofy\nHe ain't hittin' licks (Hey, shut that shit up)\nBut I still fuck your bitch (Whack)\nThen I'ma hit the lick (Yuh)\nI just been playin' with niggas that don't even charge\nI bought a prescription (Yeah-huh)\nDiamonds dancin', gold teeth glistenin' (Yuh)\nNiggas gettin' shot like addiction (Yuh)\nFuck nigga talkin' down on me (What?)\nI got real shooters, down, homie (Okay)\nPut fifty bands on a head\nGet a nigga whacked like my name Kony (Alright)\nOoh, I just broke my wrist (Yuh)\nOoh, I just broke my wrist\nOoh, I just broke my wrist (Yuh)\nOoh, scrape the pot, we rich (Ooh)\nOoh, I just broke my wrist (Oh, what?)\nOoh, I just broke my wrist (Yuh)\nOoh, made her bend her back (Ooh)\nOoh, then she broke her rib (Oh, what?)"}], "artist": "Lil Pump"}