{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/770790566878699d43ed58ab69a253ba.1000x1000x1.jpg", "title": "Goodbye", "year": null, "album": "Black August", "lyrics": "[Intro: Killah Priest]\nUh.. Black August\nGood Morning America\nIt's Killah Priest back at ya\nI'm feelin' good tonight, uh-huh\nPriesthood, Big U in the house, SoulStice\nWe gon' do this, stay focused\nYeah, I feel it, uh-huh\nYeah.. yeah, yo, yo\n\n[Killah Priest]\nThe mouth and tongue of Malcolm\nTellin' my publicist, fuck this government\nGo 'head and rate my album, this is the judgment\nVacate the island, billions will start wildin'\nThe feelin' of violence will have trillions in silence\nOr watchin' the news, Arabs against Jews\nThey bombin' the schools, political fools\nLiberal move, is all confused, gun users\nInstead of peace talk, fuck this world\nI ride for Z. York, pass the heat off\nI blast at Farahkhan to overthrow Babylon\nFuck this world, that's why we carry on\nBy the Email Fidel, tell him meet me on the D.L\nNo longer a free world, think of shank or Verra'\nThis be the days of terror.. SoulStice\n\n[SoulStice]\nOh shit, amazin' grace, how sweet the sound\nSavin' slaves, for another body found\nBound to the streets where we drown if we sleep\nWe make heat instead of peace\nStruggle to eat, and breathe\nOn Shiek metal swords before we eat\nTo teach, shake my head in disbelief\n41 shots, a young brother deceased\nGunned down by police, is there no justice, no peace?\nSo fuck the police, listen, I walk with P\nIgnorance leaks like back streets of sickness\nOr disease, and our weakness, we bleed\nDeceive to believe in this modern Eden, we thieve\nConceive through this belly, we beasts\nNinety thieves stalk woods for Priest\nLeave out this laws of Camenites\nWe strive to rise like height\nBut through hate we over-weigh our fate\nAnd fall like meteorite, to spread the self-sacrifice\nInstill like these parasites, in birth rights\nPrescribe a mind of 360 degree fahrenheit\nIn the dark like midnight, these words I recite\nI once was blind but now I..\n\n[Killah Priest]\nSee the light..\nFreedom fights in prison, sprung from religion\nTaught by elders, the system failed us, no one to help us\nPriest and his Priestess. We sit on thrones judging Egypt\nPeep the eclipse, the shadows cover the moon\nThe Devils govern the fools, they stubborn as Jews\nPearls before swine, I quiz them, they need more time\nSeek the wisdom, free your mind\nFrom the cobras, it's Priest and SoulStice\nWe came to teach the culture\nWe can stand the heat like vultures\nOpen ya wings, the soul of a King\nSong of a Queen, dawned with the rings\nBow and kiss 'em, if he's a fraud than strip 'im\nFrom all this badness, greet him with daggers\nWe more than rappers, we the masters\n\n[SoulStice]\nEven after.. World War 3, the war of intelligence\nThe court, self-defense is common sense\nThird corridors and drug stores\nImmensely spokes and leave scars of no evidence\nDense minds outlined in chalk, the refined walk\nCan rise again like cocks, a resurrection at box\nReligious, intravenous, take my name in vain\nClinically insane, hold secrets\nMentally slain for their repentance by the government\nHold the third commandment, who's the man sent?\nModern Lazurus, hands wake the nation\n\n[Killah Priest]\nIt's revelations, I'm takin' medication, my head is achin'\nI've been buying weapons since the 11th\nStars and stripes vs. a star and crescent\nGod's blessin', be a soldier, I gotta speak out on Oprah\nI'm Under Siege, I grab my gun and fatigues\nPlead my woman and seeds, hundreds shall bleed\nI speak blunted from weed\nDo y'all really want peace or y'all wanna see war?\nCrates of candles or crates of C4\nWhy they rich and why we poor?\nIf he Jacob do that make him Esaw?\nIs Colin Powell really Bush as Igor?\nWhy did terrorist attack the entire Eastern seaboard?\nWho taught the men to kill theyselves?\nThey're received Allah's rewards, we need to read more\nPriest, I rap with razor blades on the side of each jaw\nIn the millennium, war against Palestinians\nA century is done, plenty of guns\nPlenty of bombs, many shall come\nAnd my name, a homeless man ridin' a train\nDay and night, leavin' my head with migraines\nIt's the atomic age, we either smokin' chronic or sage\nThe blood of Jesus, Decepti-concept\nMartin Luther King had a dream\nGun shots create a smokescreen\nWe throw on concrete, I wear a bandana like the Panthers\nBack to court with my handgun\n\n[Chorus x2: Both]\nIt's real as the masonic seal on a dollar bill\nConspiracy theories that got Kennedy killed\nOr the secret governments, Blood and Crip\nWorldwide, look at the future through your third eye\nGoodbye.."}]}