{"artist": "Vakill", "songs": [{"title": "Armor of God", "year": "2011-06-14", "lyrics": "Let me talk to him!\nLet me talk to him!\nTalk to me!\n\n[Verse 1]\nI’m from the era were we murk the bearer of bad news like Leonidas\nAnd family don’t speak till tragedy reunite us\nScout to see who tightest and slay hordes\nWho wanna test V.A. sword\nI wanna meet the Fockers\nNo Gaylord\nAn angelic presence the delegates blessing\nIt’s hell against heaven\nMy flow is god’s relic in essence\nWhy in the fuck is you replicas testin\nWith a delicate pressin\nI can blow you to maggot delicatessen\nThey restless til I’m soul clapped with no mercy\nTill they witness the crown get hold captive and murk me\nNo industry flow active can hurt me\nThe upper echelons about effective as proactive to herpes\nInstruct spit to keep niggas with chalk employed\nThe gods fully armored\nApology talk is void\nWhat part beast you don’t understand\nI write the sickest shit to hit white sheets since cross burning Caucasoid\n\n[Hook]\nV, a verse for all the fallen that left me\nA, may the armor of god protect me\nKill everything thing that’s movin expect me\nIf you offended then I’m talking to you directly\n\n[Verse 2]\nSick as an abortion activist germ biochemist\nStrapped by yo clinic\nClappin’ clients with a grill that’s cryogenic\nThe ice that my tear ducts cry authentic enough to hypothermia what I\nBreathe upon even freeze a pond\nThe game will never be fixed\nCause every new nigga heavily bricks\nOr exploited like 70′s flicks\nMachine and beast cleverly mixed so\nFuck around and get carried by six\nLike the nuggets in 76\nI’m a good fucka\nA sick migraine cross contaminated with strychnine strains and click\nNines aimed\nSplit a soul three ways in an auction\nYou celebrity fit thugs weighing your luck and weighing your options\nSubsequently no slugs can dent me\nSpit freeze whatever rubs against me I creep like a stealth winter\nFrost bitin shit till your health splinters\nThis is I, fill in you the blank lord and master bitch I’m self-centred\n\n[Hook]\n\n[Verse 3]\nNiggas want me to rehash beef with Twista till the targets destroyed\nRun up on him at 106 & Park with the toy\nFuck all that, that’s a marketing ploy\nIn fact, I’m proud of what the nigga accomplished\nBark at cha boy\nEnvy breeds from not stackin right\nNon packin pipe\nInsecure non tough, tough actin tinactin types\nYou clients of panda pussy pimpin\nThe source of your extinction in existence is right here in black and white\nTill I’m emancipated, I birthed terror that stans Al-Qaeda\nSwitch up, give a fuck if fans okayed it\nAll I got is my balls and my word\nIf the streets hold me to my word, we already know where your hands located\nYour fears confirming my thesis\nThe time fabrics in permanent creases\nPressing the luck you weigh\nWhen bucks spray, you lay\nUckfay ouyay\nWant some positive shit?\nMother fucker play Lupe\n\n[Hook]", "album": "Armor of God", "image": "https://images.genius.com/554587a9ac04d4be1bd20ccba16e6fd0.450x450x1.jpg"}]}