{"songs": [{"album": "DiCaprio 2", "year": "2018-11-26", "title": "Slick Talk", "image": "https://images.genius.com/a24486c6e4c335d50ce79fdcf7bef5ac.1000x1000x1.jpg", "lyrics": "[Intro]\nActivate, activate, activate, activate\nActivate, activate, you know I'm about to activate\nActivate, activate, activate, activate\nActivate, activate\n(Whoa Kenny!)\n\n[Verse 1]\nActivation, activation\nMaturation, process, rap game too saturated\nGrab your lady, masturbation on her face\nA acne patient acting patient, so complacent\nComfortable, a basic bowl of shit\nHold my own, I own my dick\nGo shalom, I’m unpredictable\nAnd roll with the clique and fold with big clips\nI know I'm feelin' activated when I came in this bitch\nClaiming the 6, I don’t care about being famous and shit\nI was a bad little never had, nigga get the bag\nGive it back to my fam, boy I am who I am\nHope I don't get in a jam in a jam\nHad a dream of eating lamb in the Lamb'\nAnd the label come off fam with the ram\nLike Martin, Gina, Cole, Tommy, and Pam\nStart scheming boy, you die where you stand\n\n[Beat Switch]\n\n[Interlude: Jamaican DJ]\nNow hear dis! You likkle spit and chew out soundbwoy\nYou mussi think you can go buy experience a Woolworth!\nYou mussi think a so King Selassie ah get him crown!\nNo, no, no!\nNo, no, no, no way!\nYou got to work hard for it!\n\n[Verse 2]\nLook, okay\nThis the type of shit that have niggas in beef\nDat slick talk followed by some stick talk then sleep\nPissed off, I done took my fifth loss this week\nBig dog, I can scratch that shit off like fleas\nI got a lotta shit to say, but I'ma keep my list short\nI know alotta your favorites not gon' fuck with this part\nWhen I'm done, please know that I was trying to diss y'all\n'Cause if this is a competition, then I’m setting this bar\nIn my city, who’s with me? I'm in my own lane, Jack\nNigga said, \"J.I.D. so flame, I propane rap\"\nI’m from East Atlanta like Gucci and Travis Porter\nBut my story is similar to the hare and the tortoise\nPen so sharp told stories you thought I forged it\nBack in the fourth grade, never read Curious Jorge\nMy nigga Corey kept a little 40 inside his North Face\nLeft a nigga with no face and beat the court case\nComing home from ball practice, took the street the short way\nWe from the East, but never gave niggas a reason\nTo try it or think it's easy, soft pussy niggas eat the sorbet\nOr eating your face, or squeeze the heat, then leaving your place\nI've been telling you life's a bitch, but it’s a beach in your case\nI've been yelling and throwing fits, I'm tired of screaming all day\nI've been fighting these fucking demons all day\nMan, this shit ain't never been easy, maybe I just need a breather\nHand your boy the blower, let me squeeze it\nBlow a little steam, ain't hating, I'm just heated\nNiggas know what I mean, but niggas don't know what I been through\nSo if I offend you then, uhh, uhh, uhh, uhh\n\n[Chorus]\nI heard niggas looking for a problem\nBut we don't even move until the rent due\nMy niggas hands itching, finna rob something\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you (Our Father)\nBetter pray to God\n\n[Verse 3]\nLook, okay\nFuck what a nigga say or, look, my mama think I made it\nLift my head to skies, I cry and begin prayer\nThanks to the maker, got me out of an awful place\nMy nigga gone for 17 years like a cicada\nMore than a motivator for me to get off my anus\nAnd kick ass like I'm Danny Mainus\nPut the pen pad to the paper, big mad with a painting brush\nSplish splash, drawing scenes from my dim lit past\nDimwit, pimp shit, syndicate with the pen grip\nRipping shit, intimate, infinite rhyme kicking, l-l-let's begin\nWho's your list? Your top 10? You can say whoever better than\nI'm ready now, I was ready then, I was headed down the aisle\nRap game in a wedding gown, she gave me the ring\nI said, \"Yes\" and vowed for forever now\nOn the honeymoon, getting naked now\nOn a money pile, doing doggystyle\nI'm a father now, and you are my child\nOr you aren't my child, I'm on Maury now\nAnd I'm talking loud, the results are found\nYou are not the - wow, I should kill this bitch like a doggy pound\nWe divorcing now\nI want the cars, ring, clothes, all the houses\nAnd you broke my heart, I'm re-organizing\nAnd I'm really trying to be mature about it\nBut I got a killer like a fucking dealer\nDream-villain, spill-villain rhyme to the ceiling\nWould I should I kill a rapper 'cause I coulda\nDuh nigga, this a gun and a bullet\n\n[Chorus]\nI heard niggas looking for a problem\nBut we don't even move till' the rent due\nMy niggas hands itching, finna rob something\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\n\n[Outro]\nNot that I need it\nThis nigga cap as fuck, man\nAin't no cap in my rap\nThis super cap in your rap, boy\nWhere y'all niggas from for real?\nWhere y'all from?\nNaw\nOhhh"}], "artist": "JID"}