{"artist": "Indo G", "songs": [{"title": "Dead Men Don’t Talk", "lyrics": "(Hook x4, Project Pat & [Indo G])\nGot'chu layin in ya blood, got'cho body in the chalk\nCaught'chu slippin after dark [Dead men don't talk]\n\n(Verse 1, Indo G)\nI'm oh-so oh-so fresh, when I send shots on my block\nAnd I'm somewhat fuckin coool, clientele won't stop\nFive for the fifth, or just ten for the pill\nNiggas chill as I slides to the side, Coupe DeVille\nPeel caps on a busta, see hes a stupid motherfucka\nTalkin shit about my business, you best to duck\nI got'chu on the infrared, in a mess; where you goin\nI hope you got nine lives cause you bodies will have holes in and out\nPull ups on Johnson, yo I stacks up and chill\nCome on just let us buy, just some twenty dollar bills\nIs you is or is you ain't the D.E.A. or cluckers?\nHope you ain't them folks, cause you some dead motherfuckas\nThat's all a nigga know, is a pocket full of bolos\nFresh sparklin BITCH, so motherFUCK some Polo's\nI'll never get a job, it's too much cheese in my hood\nAs long as I'm bout my hustle, I'm a nigga up to no good\n\n(Hook x4, Project Pat & [Indo G])\nGot'chu layin in ya blood, got'cho body in the chalk\nCaught'chu slippin after dark [Dead men don't talk]\n\n(Verse 2, Project Pat)\nA million, a million\nProject was a million\nBullet slugs, I drilled them\nDo I have to kill them?\nPeel them, domes to the back, just to protect mine\nWill them, cowards get the ups on me with the nine?\nDraw yo iron, if you think that you is a deadly kid\nShot you why you wantin, now get off, see now what'chu did\nGots the kid gone and with us, 'fore them police bust\nCar fulla that dope, I'm the shooter with the dirty Ruger\nDo you bow down like a fool, and become a snitch?\nWorkin for the Feds, man you lames\nLet the hammer twist, back motherfuckas crushin heads like some grapes\nPoint blank motherfucka, mask out, thirty-eight demonstration\nThird point state in the nation, where I live\nBut I've seen more dope than a Haitian\nFloatin, in the city streets, keep yo eyes closed\nYou ain't seen shit, or your mouth hit these bullet holes\n\n(Hook x4, Project Pat & [Indo G])\nGot'chu layin in ya blood, got'cho body in the chalk\nCaught'chu slippin after dark [Dead men don't talk]\n\n(Verse 3)\nComin straight from the hood dude\nThis nigga they call Ms. Smokey mayn\nEvil thoughts is in my head, sometimes I feel I'm insane\nCreepin up outta the dark with no heart, now it's time to kill\nHit me a scope, now I have hope, bullets you know this shit so real\nHave no anger, torture chamber, now yo life's in fuckin danger\nDead men don't walk, and they sure in the hell don't talk\nFirst they told it me, then they tellin me\nNext they plannin, hopin to strip me from my life\nGod give me sanity\nAnd in my mind, I'm racin, still racin\nChargin for the outcome, but it's death I'm facin\nAnd too deep callin, no stallin; chicken steps\nRemorse is wealth as I breath my last breath\nWord, a nigga murdered on the streets by that heat\nNo witness to witness this, or the police\nFuck it I guess, I'm dead\nA nigga reserve my head, promise to kill the body with the spread\n\n(Hook x2 to fade, Project Pat & [Indo G])\nGot'chu layin in ya blood, got'cho body in the chalk\nCaught'chu slippin after dark [Dead men don't talk]", "image": "https://images.genius.com/326b460d0036bf8ae9072f36083701aa.400x400x1.jpg", "album": "Angel Dust", "year": null}]}