{"songs": [{"lyrics": "[Produced by Thelonious Martin]\n\n[Intro]\nSay Jude I really wanna see you nude\nI don't mean to be rude though (yeah)\nSay Jude I really wanna see you nude\nI don't mean to be rude though (yeah)\nYeah so, nigga\n\n[Verse 1: Da$h]\nKing of spades, bitch from Spain, it's the kitchen maid\nGettin' paid at a rate my mother in disarray\nWrote the book and never read a page\nBurnin' a 50 feel like Nickie Cage\nGone in 60 seconds\nEvery time we speak you cry, that's why I stick to textin'\nSmoked a bowl before I sent the message\nSayin' we homies 'til the very endin'\nSay without me you'll die\nCan't reply so I just hit the exit\nFuck, just my luck, in the terminal, pissy drunk\nCatch a flight across the country just to chase a buck\nRollin' stone, rollin' stone, call too many places home at times\nHow many lives I'm livin? four or five\nEach one I'm surely high\nYuri Orlov\nFake ID as I'm checking in the Waldorf\nA fuckin' warlord\nRussian escort who going to blow me 'til my balls sore\nFuck you think I laid these bars for?\nCar door open backwards\nBitch's ass like an allergic reaction\nShe service my faction\nSmoke some shit that should've came with a caption\nAll my actions be considered as classic\nFree Maverick, nigga, I fuckin' meant that, uh\nFree Maverick and all my other cold b's\nEvery chance I get I tell a cop to blow me\nBreath smell like a 40 and a half an ounce\nBitches hometowns be some shit a nigga can't pronounce\nStash the drugs in her lips that's under her salmon blouse\nLife a movie by the way this shit is pannin' out, ya nah mean?\nCaught up with my greens, endo and cash flow\nOwn mother think I'm an asshole\nSo? think I care about about a bashful nigga?\nYou better hope that I don't catch you, nigga\nStomp your boss your team'll take the loss\nSlide off in the beigest Porsche, nigga\nYour team'll make the rules, my niggas break the laws\nJust a corpse, yeah so", "album": "V.I.C.E.S", "year": "2013-06-26", "title": "Brighton Beach", "image": "https://images.genius.com/98d0e9f8e8520567640e21c00d1c4c79.600x600x1.jpg"}], "artist": "Da$H"}