{"artist": "Prince Paul", "songs": [{"album": "Psychoanalysis (What Is It?)", "title": "In Your Mind (Altered States)", "image": "https://images.genius.com/2e62c87c2fc12d70ea466dbe46b314e0.599x599x1.jpg", "lyrics": "(Okay, Pete, fill it up. I'm gonna soak my head under your hose.)\n\n(Ahh, this is the nearest thing to a bath I've had in a week!)\n\nYeah, I FUCKIN' noticed! What the FUCK are you hauling, assbreath?\n\n(Apples.)\n\nHow's your fuckin' FUCKED up (ramano?), Paul?...\n\n(He's asleep in the cab.)\n\nEvery time you pull in here he's fuckin' asleep\nWhat is he, a fuckin' pussycat?\n\n(He drives as much as I do\nYou run your station, we'll take care of our rig.)\n\nOkay, I was just FUCKIN' wonderin!\nHold your FUCKIN' horses, eh? I didn't ask you for alladat!\n\n(I checked the tires and oil, nevermind them. How much gas?)\n\n70 gallons? That's fuckin' highway robbery\n\n(Whatever it is, I'll have to get you on the way back.)\n\nWhat'd you say? You're gonna FUCK me from the back?\n\n(I said I can't pay you til I deliver this load.)\n\nWhy didn't you fuckin tell me before that you had to stop and take a shit?\n\n(You wouldn't have given me the gas.)\n\nI'LL say I wouldn't!\nI would FUCKIN notion to siphon it out.....I'll SUCK it!\n\n(You wouldn't do that, Pete.)\n\nHey, you know you get your ass every time\n\n(Relax, I wouldn't jip you. You know I'm honest.)\n\nAll you mother-truckers are honest and always fuckin' broke\n\n(Relax, I told you.)\n\nSure, I'll fuckin' relax\nAnd the next thing you know, a man'll be suckin my dick!\n\n(Uh-uh. Ohhh no. Not MY truck.)\n\nHey, shit happens\nAnd, then you're out of business, and I'm, outta my dick!\n\n(Don't worry about me and the installment man\nHe's gotta CATCH me first.)\n\nThat shouldn't be too fuckin' tough. You always give him the shaft!\n\n(Heh, he's had three months to try!)\n\nGet it fuckin' right this time, stupid ass (lamer?)\n\nChorus (x 6):\nIt's all in you mind....every time (It's ALL in you mind)\nIt's all in you mind....every time (It's ALL in you mind)\n\nHere we go......ready.....and....\nOne, two, three, four, five, six\nOne, two, three, four, five, six\nRemember, the \"four, five, six\" is in place\n\nOne, two, three, four, five, six\nOne, two, three, four, five, six\nNow let's do the girls' part. Girls, up....feet together...\nStarting with the right foot....\nStep to the side about six inches with the right foot, here we go...\n\nOne last question which is very important\nHow does psychoanalysis do this?\n\n(By probing the unconscious.)\n\nWhat is the unconscious?\n\nChorus (x4)", "year": "1996-06-25"}]}