{"artist": "Westside Gunn", "songs": [{"year": "2015-09-16", "lyrics": "[Intro - Dear Winter]\n(Ayo, these niggas can't keep up man)\nDear Winter\nCan't wait to see you again\nHitler Wears Hermes Three\nRest in peace Machine Gun Black\nAyo\n\n[Chorus]\nMy man just came home from doing twenty flat\nHe already back to selling crack\nHe look at me and said \"this all that he know\"\nRocking sasquatch fabrics from head to toe\nThe cut we was cut from it's still loyalty\nTwelve gold slugs, Chanel mask you know it's me\n(I'll blow your fucking head off yo...)\nTwelve gold slugs, Chanel mask you know it's me\n\n[Verse 1]\nFly as a pelican, benevolent\nDrug money infectious, we whipping up extras\nMy man got killed for two pounds of [?]\nMy kicks cost that, it hurt for me to see his kids\nI'm from a city where everybody got ten bodies\nBurberry trench covering the chopped shottie\nNiggas had buck shots in every part of 'em\nYeah they might be fly now but I fathered them\nCall for neighbor dealers carving bricks\nLow top Margiela's looking marvelous\nStyle was Cristal foul, foul as an ace\nLeave 'em shot floating in it like Scarface\nYou broke my heart when you killed Frank\n(Remember when Tony shot Pussy on the boats yo?)\nYou broke my heart when you killed Frank\n(Seemed like yesterday I was running guns)\nAyo, Sly still got four lives left\nFour leaf me to the night checks\nRicardo, lemon squeeze, fifty shot TEC\nShot fourty five hanging out the Murciélago\nPraying for tomorrow\nA lot of niggas never seen eighteen\nMy young boy favorite color stay green\nThirty years on the triple beam\nBroke the slot machines out in Medellin\n\n[Chorus]\nMy man just came home from doing twenty flat\nHe already back to selling crack\nHe look at me and said \"this all that he know\"\nRocking Sasquatch fabrics from head to toe\nThe cloth we was cut from is still loyalty\nTwelve gold slugs, Chanel mask you know it's me\n(I don't give a fuck who you is you ain't fucking with me yo)\nTwelve gold slugs, Chanel mask you know it's me\n\n[Intro - Bloody Fiegs]\n\n[Excerpt from Kanye West Sway in the Morning Interview]\n\"I am Warhol. I am the No. 1 most impactful artist of our generation. I am Shakespeare in the flesh. Walt Disney, Nike, Google -- now who's going to be the Medici family and stand up and let me create more or do you want to marginalize me until I'm out of my moment\"\n\nI'm sniffing gun powder\n\n[Verse 2]\nAyo one rack be yola\nThem Bathing Ape Coca Cola\nDropped a tear when Ghost shot Roller\nSpikes on the camouflage loafers\nLord everything kosher\nShot a hundred rounds, the whole hood woke up\nKick in the door for the raw\nShoot your baby mother in the forehead\nStarted off with a double up\nBuck fifty your kids, they face will bubble up\nNigga, ain't nobody safe\nRose gold R8, who wanna race me?\nWe'll be rich forever\nIf the dog food tasty, I'm Azie\nMCM bucket in the mall scene\nNo jump shots so we off king\nJoakim Noah when I post up\nLeave his body freezing like a cold cut\nMachine got killed it had me fucked up\nI ain't been the same since let me sniff\nI was shackled on that bus taking trips\nYou broke niggas get a bottle and take midget sips\nGive me a case of everything\nThe triple beam like a wedding ring", "image": "https://images.genius.com/4a0a4be0aad5965487e030fdb043a277.500x500x1.jpg", "album": "Hitler Wears Hermes III", "title": "Dear Winter Bloody Fiegs"}]}