{"songs": [{"title": "Paying in Naiveity", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nWelcome\nAris P!\n​brandUn DeShay\nIt’s monumental right now\nWhat you’re doing is kind of simple\nOh\n\n[Verse 1: brandUn DeShay]\nDeShay in the house tonight\nMind out the box in some brand new Nikes\nGirls is face down like there’s two, right?\nThis song ain’t got a hook, but I’ll bet you’ll bite\nRhymes off the hook, I mean off the chain\nA small price to pay for going off the brain\nPut down the pen and the pad, and ever since\nI’ve been murdering beats, no evidence\nI rhyme with so much elegance\nY’all bunch of rhymes can’t get like elephants\nY’all rappers on your period like elements\nBet you I can make you Bebop like Ella Fitzgerald\nClothes not fresh, they’re sterile\nThat’s why I spit a song and you feel it in your bones like marrow\nNot much more I can tell you other than the world need hugs\nAnd don’t do drugs\n\n[Verse 2: Aris P! & brandUn DeShay]\nIn this place on the right\nThere’s some chicks I got to get by the end of the night\nMy shirt is so worthy, the chicks may bite\nChicks is so fly, they just may take flight\nIf you’re high enough, this won’t sound odd\nI don’t smoke, but feel high enough to hide by God\nAnd I don’t have a real type, brah\nI just hope I’m not attracting these psycho broads\nI’m on the 8 Mile like the staircase\nSaw that these girls in a game of police, give me fair chase\nMake me work for it, I’ll take the day shift\nEven punch in early to work the grave shift\nI’m feeling like holding this place\nGirls falling for me like there’s a hold in this place\nStraight taking over this place\nPlus my rhymes are sick, I’m afraid you may catch a cold in this place\nLadies, listen, I can’t wait to feel your tongue\nWith my breath of fresh air, go ahead and fill your lungs\nHopefully you will let me fill your cup\nMaybe the last thing I do before I fill you up\nI’m kidding, at least a part of me is\nDon’t want to sound rude, so pardon me miss\nSit back, kick back, and breathe, let the leaders lead\nAnd I’ma keep killing this track, let the sticks bleed\nThere’s some fine young chickadees up in here\nI’m looking for some Mayas and Tiffanys\nI know these dudes too sick of me\nI got the deals on the table and their girl is the centerpiece\nFor the guys, it’s a bummer\nYour girl never did track, but I’m going to prove she’s a runner\nIf we stay hot like the majority of the summer\nWe’re bound to stand out like minorities in the suburbs\n\n[Outro: brandUn DeShay]\nSo, uh\nIf you don’t know right now\nUh, this is something that, uh, producers do\nWhen they don’t have the track copyrighted yet\nWhich I don’t have this one, um, under ASCAP yet\nSo, uh, waiting on this check to come through on Friday\nSo I can pay to get the, uh, these CDs published\nSo I can make some more beats probably tomorrow or whatever\nSo I’m just going to talk over the beat so y’all niggas can’t rip it off and all\nSo, um\nSo being this the last track of the mixtape and all\nHope you, you know, had fun\nHope you hit me up\nKeep your ear out for me\nSign off\nYeah", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}