{"songs": [{"image": "https://images.genius.com/99e08f1d5c92053943899d806088a4a4.1000x1000x1.jpg", "title": "Fast Life", "album": null, "year": "2018-12-22", "lyrics": "[Chorus]\nDid this by myself, they say I sold my soul\n(But they can't tell me nothing)\nWill the fast life ever end for me? Nobody knows\n(I told them imma keep on stuntin’)\nI wonder who would stick beside me if I lost it all\nIf I was spendin' reckless, would you let me blow it all?\nYou was there when it was time to ball\nIf I'm ever losin’, hope you don't ignore my calls\n\n[Verse 1]\nIn L.A. I'm hidin' from my problems and the snow\nI start feelin' empty when my cup is low\nWatch your drink around me, I spent three rack on my coat\nFell in love with money, first dime bag that I sold\nFuckin' hoes and shopping gettin' old\nIn Houston fucked a stripper, came straight off the pole\nYou should know the game is sold, I never told\nMy favorite rappers washed up in the gettin' old\nI just seen your favorite rapper in the store\nI just bought in cash, she put that shit on hold\nI got a lot but yeah, I still want more\nCount this money ’til my thumbs get sore\n\n[Chorus]\nDid this by myself, they say I sold my soul\n(But they can’t tell me nothing)\nWill the fast life ever end for me? Nobody knows\n(I told them imma keep on stuntin')\nI wonder who would stick beside me if I lost it all\nIf I was spendin’ reckless, would you let me blow it all?\nYou was there when it was time to ball\nIf I'm ever losin', hope you don't ignore my calls\n\n[Verse 2]\nMy bro just told that the streets is all he know\nSendin’ money every month to give him hope\nFucked up his re-up, had to scrape it out the bowl\nI heard he robbed the plug and now he sellin' dope\nMy teachers used to call me dumb and send me home\nKarma is a bitch, and you reap what you sew\nI just seen to rollies and I both 'em both\nGod gave me two pinkies, I put rings on both\nThey wanna see me lose, that's nothing new\nAll this ice help me keep my cool\nCouldn't handle the pressure if you were in my shoes\nI made it, I still work like I got something to prove\n\n[Chorus]\nDid this by myself, they say I sold my soul\n(But they can't tell me nothing)\nWill the fast life ever end for me? Nobody knows\n(I told them imma keep on stuntin')\nI wonder who would stick beside me if I lost it all\nIf I was spendin' reckless, would you let me blow it all?\nYou was there when it was time to ball\nIf I'm ever losin', hope you don't ignore my calls"}], "artist": "NAV"}