{"artist": "G-Eazy", "songs": [{"title": "Been On (Remix)", "album": null, "year": "2014-01-15", "image": "https://images.rapgenius.com/d56a324996ce1be2b580af48d0aa89dd.900x532x1.png", "lyrics": "[Verse 1: Rockie Fresh]\nYeah, funny how these boys front but they hustle backwards\nThey send Rockie on for a lot of factors\nYou can keep your lil' tweets cause they don't even matter\nYou got a bad bitch? Well, all my homies gettin' at her\nShow no love, show no mercy\nI ball on these niggas: old school, James Worthy\nPraises to the most high, I'm so fly\nAnd you know I rep the Chi 'till a nigga die\nBut I'm in every other state every other week\nClimbin' Rocky Mountains, shorty takes a while to reach that peak\nYeah, it's double M, bitch, I fuck with Meek (Maybach Music)\nThese niggas waitin' on the album praying that it leak\nI'm droppin' heat, I'm on fire, nigga you a lie\nIf you disagree, get some money, fuck with me\nThey said a young boy slept on\nBut what I spent on I probably went and put your rent on\nI get gone\n\n[Hook: G-Eazy]\nEveryday I got some fly shit on\nKeeping all black outfit on\nI already bagged most the chicks\nThat you out here trying to get on\nYou just catching up to what I've been on\nYeah, that's what I've been on\n\n[Bridge 1: Rockie Fresh & G-Eazy]\nThey wanna talk about the lights\nThey don't even know the price man\nThat's that shit I been on\n(Yeah, that girl you got is nice, I already had her twice\nThat's that shit I been on)\n\n[Verse 2: G-Eazy]\nYeah, okay, that shit's what I've been doin'\nI'mma do what I'm meant to and get money, this shit's been brewin'\nIf I'm doin' it in store beware the rise I'm ensuin'\nAh, look what the wind blew in, it's your girl who I've been screwin'\nYes, higher standards, higher class\nThat \"L.A. confidential\" will always keep a fire stash\nRappers want me on their songs? I make them wire cash\nThat's your housewife? She let me on-top-the-dryer smash\nLife, don't smoke with us if you've got fragile lungs\nReminiscing being broke when I ain't have the funds\nBreaking bread with the homies, now you snack on crumbs\nBlack on black, I'm looking like a ninja in these Shadow 1's\nYeah, I'm breaking swishers for the broccoli sesh\nComing to a city near you - it's me and Rockie Fresh\nMight spend the rest of my life on tour\nThe Bay's what I put on for\nThis remix was an encore\nThey want more\n\n[Hook: G-Eazy]\nEveryday I got some fly shit on\nKeeping all black outfit on\nI already bagged most the chicks\nThat you out here trying to get on\nYou just catching up to what I've been on\nYeah, that's what I've been on\n\n[Bridge 2: Tory Lanez & G-Eazy]\nNiggas try and gash now first class through the clouds\nNigga that's that shit I been on\nYeah, and that's how it's going down: every night, another town\nThat's that shit I been on\n\n[Verse 3: Tory Lanez]\nYeah, look\nAnd I remain that nigga, spittin' gettin' lifted off a swisher\nAwkward, I just hit your bitch up off a picture off of Insta\nIt's the, uh, youngest on it, honestly I'm markin' targets off the list\nAnd plan on kissin' Kate Barlow with ya bitch\nLook, a nigga don't fuck with no hoes that don't give the dome\nI'm gettin' dough, sick nigga I be spittin' foam\nGettin grown on my yard game, buy hard Balmain\nJeans cost half a trap-star plus a hallway\nMore Jordans, Fendi, Dior, sportin' your whore on my corridor\nAnd I'm pourin' her four Porsches\nPull up for Porsches\nCops, they try and court us\nThese bitches let me in their slots like quarters\nOld money in my spot like hoarders\nGet shot like ballers on that court, bitch I'm hot like spoilers\nSee these niggas, you cannot control us\nOne umbrella stock hot like Glocks and sofas, nigga\nCanada!\n\n[Hook: G-Eazy]\nEveryday I got some fly shit on\nKeeping all black outfit on\nI already bagged most the chicks\nThat you out here trying to get on\nYou just catching up to what I've been on\nYeah, that's what I've been on\n\n[Bridge 1: Rockie Fresh & G-Eazy]\nThey wanna talk about the lights\nThey don't even know the price man\nThat's that shit I been on\n(Yeah, that girl you got is nice, I already had her twice\nThat's that shit I been on)"}]}