{"artist": "R. Kelly", "songs": [{"album": "Untitled", "year": "2009-11-30", "lyrics": "[Verse 1: R. Kelly]\nNow I can't leave this club without you girl\nI swear I want more, you deserve an encore\nBackstage, V.I.P., drop it, how it's rainin'\nWon't you come and tell me are you wit it?\nWhat you want girl? You can get it\nThese clubbers won't treat you like I treat you\nBig chips, black hearts, you'll be my costar\nSomebody sayin' you lookin' for me?\nGirl, here I go\nLook, oh my god, who do we have\nUp in the club, dancin' for me?\nGirl, let me help you chase your dreams\nYou're so beautiful\nHow can I make you understand that I want to...\nRub, I wanna touch, every little inch of your body\nGirl, you *have* to come with me\nYou're incredible, whoa girl (yes you are)\n\n[Hook]\nBaby, see the exit, exit\nSee the, exit\nLet's go, out this club\nExit, Exit\nSee the exit\n\nNow baby if that's your man, forget it, go about it and dance\nI really didn't mean no harm, it's just a player's charm in me girl\nAnd I do it around the world, in every bar\nLike a professor babe, Kellz gives sex seminars\nWhen you walk by, so slow, make me whistle\nYou got pretty teeth\nIt feels so good when you're smilin' at me\nI'm about to buy you everything\nBaby girl, just leave this club with me\nI got a big house in the mountains\nLet's go, and I even got a stripper poll\nExcuse me miss, somebody sayin' you lookin' for me?\nLook, oh my god, who do we have\nUp in the club, dancin' for me?\nWhy you upstaging these chicks?\nGirl, you got the dance owned\nHow can I make you understand that I wanna...\nRub, I wanna touch, every little inch of your body (your body)\nGirl, you need to go with me\nIt's the last call, alcohol, girl (yes it is)\n\n[Hook]\n\nWhen you see me\nTwo of us, your block, back of Maybach\nBlack shades on, down low in your hood\nSmokin' on that good\nDon't take a picture or autograph\nCrack some jokes, make me laugh\nTake some shots, baby now, come to my hotel\nGirl I love the way you're teasin' me\nYou and your girlfriend on the dance floor\nI'm thinkin' a minage tois\nWon't you jump up off in my car?\nGirl, it's so pretty\nLeather interior, custom made for me\nLet the top of that go back, then we'll pull off from the club *real slow*\nSo fans can take a pic\nGirl I get a kick out of splurgin' on you\nNordstrom, Prada, Gucci, Fendi, Vicky Secret's too\nBaby, sky's the limit where we go from here\nOnce we're in that Benz\nGirl, take me serious when I say, I wanna walk out of here with you\n\n[Hook]", "title": "Exit", "image": "https://images.genius.com/5a944a10bb0940f7591a3793da77ca12.550x550x1.jpg"}]}