{"artist": "Vanilla Ice", "songs": [{"title": "Dancin’", "year": null, "lyrics": "Dancin', Dancin', Dancin'\nCome on, come on, come on everybody\nCome on, come on everybody\nCome on everybody, come on, come on everybody\nCome on, come on everybody\nLet's do this dance\nGet out your seats and let me shake your pants\nOh, with the base cold thumpin' and the hihats snaren'\nPeople are jumpin' and the fly girls are staren'\nPeople under 40...Yo! Let's get down\nBecause they need more break and now it's sliced by Shay\nThe records out so don't wait\n\nThe style that I'm doin', it'll ruin\nAll you people came here just for booin'\nGet your dead ass up and back on the floor\nJump in the groove and let Vanilla go\nInsane, with my gold chain\nYou know you're gonna' see it on Soul Train. Hit it!\n\nDancin', Dancin', Dancin'..\n\nAll you people on thel eft, shake your thing\nAnd everybody on the right, do the same thing\nNow, the people in the middle, try to enhance\nCome on everybody, let me see you dance\nIn motion, with the potion\nGet up everybody and locomotion\nAll swing and do your thing\nUnless of course, you can't hang. Chillin' is o.k\nBut not when I play this song, move along, be gone\nYea! The beat'll make you move when the records on\nGet with this style and update it\nLike my record is, when you play it\nDef comin' strong, hard like a matador\nI saw my style, my soul up on the dance floor\n\nDancin', Dancin', Dancin'...Do it! Funk it up!\nDancin', Dancin', Dancin'..\n\nSwingin' until the night is through\nJust let your feet and your body take control of you\nJust like a trance to keep you movin'\nEverybody can do it, just keep on groovin'\nOf the 808...just kickin' like a chicken that you just ate\nSo catch a groove so we can get down\nYell out the name of your hometown\nMiami...Catch the groove. L.A....Catch the groove\nNew York...Catch the groove. Seattle...Catch the groove\nDallas...Catch the groove. Detroit...Catch the groove\nVIP dancers...Catch the groove. Everybody...Catch the groove\nDo it!\n\nDancin', Dancin', Dancin'...Yea! Can we do it?\nDancin', Dancin', Dancin'...Come on everybody..", "album": "Hooked", "image": "https://images.genius.com/5078fff4f8c0f4d1704f492654dc4064.1000x1000x1.jpg"}]}