{"artist": "Petey Pablo", "songs": [{"album": null, "title": "Blow Your Whistle", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "[Intro]\nHey hey! Everybody come here, I need all y'all to come over here\nCome here come here, yeah, I want you to do this, come on\n\n[Chorus: repeat 2X]\nBlow ya whistle! Blow ya whistle!\nBlow ya whistles for me y'all!\nI said if you wanna bizzle then you can let a nizzle\nTo blow ya whistle from Petey Pizzle to come on anda...\n\n[Verse 1]\nI can do anything and everything with new flows\nThen take this Manny track and tear the game a new asshole\nMe and my do-rag half man, with two black hoes\nHow in the world could it do this, I be so damn cold\nI got a rabbit foot in my pocket, uh huh\nCome on I needed the other part of the rabbit\nTo fill up a pocket, I gotta major problem partna\nSo that means I don't need to be bothered for nada\nUm, feel me dogga\nMy head hot, uh huh, and my body warm\nUh huh, my nose runnin, could you close the door, uh huh\nLetting out all granted and goodies sweet G's and deviled eggs\nBoiled tater to goat cheese\nY'all don't even remember me\nI'm Petey - take ya shirt off Carolina from Greenborough\nBut what Petey needs to see this evening\nYou can keep your shirt on - we gon' use these\n\n[Chorus]\n\n[Verse 2]\nI tell ya when I come runnin head down, but naw\nBut naw, y'all ain't hit me\nSo I guess I had to ahead hit ya with something that could grip yo attention\nThat make ya yell at ya kids from the kitchen\nWhat put that whistle down! But Petey on tv\nDamn it Petey, ya heard what I say\nI just love it when I could take a track and have me some fun\nGet footloose, and still can put the club on crunk\nMake a girl butt bump (ba bum), make a party go crazy, (ba bum)\nWhen the first two bumps come on (ba bum)\nI'ma have some, I'm telling ya mayne\nI'm the new spokesman for gas grills and propane\nWhen I wrote this I had to wear shades\nI had to wear rubber gloves to get this today\nManny Fresh's CD player wasn't even playin\nMan we need a fire truck, where my whistle at baby\n\n[Chorus]\n\n(Hey, let me hold ya whistle) No\n(Uh huh, please, I just wanna blow it) No\n(Just a little bit)\nAin't ya proud of me now\n\n[Verse 3]\nRelease ya mind, body, and soul\nAnd let yourself become a part of the flow, like the EX roll\nAnd you can try your best to hold it back but you can't hold\nAnd even if you had a cramp, pull these handcuffs on ya\nTurn 'em loose, don't worry 'bout 'em , leave 'em alone\nHe the one gon' look like the button ho\nWhistle blowin', and the party still goin' on\nAnd he all upset, mad, cause he too grown\nI'm back, I'm ready to take my back\nOh and I hooked up with Cash Money\nNow how in the hell did you do that?\nElementary my nigga, I just took this little thing here and blew it\n(Ya Petey Pizzle whistle?) Yeahhhhh\n\n[Chorus] - 3X\n\n[Outro - Manny Fresh]\nOh, and there he go, fa sho', Petey Pab\nStraight hustla, play child, uh Manny Fresh ya heard\nPetey check it out baby cakes\nUh you can buy yo momma a house off of this one\nYou can get yo daddy that truck that he always wanted\nYou can get yo grandfatha that chromed out wheelchair\nAnd you can just go ahead on and just, glide in the wind\nYa heard, ooh, I'm feelin myself\nI wanna thank everybody for givin' me this opportunity to blow my whistle\nBlow my whistle, blow my whistle", "year": null}]}