{"artist": "R. Kelly", "songs": [{"album": null, "year": "2014-01-01", "lyrics": "[Intro:]\nLet’s wake up, it’s dinnertime\nYep… turn up\n\n[R.Kelly Verse 1:]\nPull up to the crib and a nigga on silk… come fvck with a nigga\n‘Bout to bang on the pussy like I’m blowin’ up the crib… fvck with a nigga\nYou gon’ wanna claim this dick… fvck with a nigga\nFuck with a nigga… come fvck with a nigga\nOoh… she roller-coastered on it\nOoh… she threw it up, I alley’d, ooh…\nThen I beat the pussy ’til it’s blue\nGirl you know you got that good, yeah\n\n[Hook:]\n…like an Oreo\nI love to lick the middle like an Oreo (turn up)\nOreo… Oreo, like an Oreo…\nI wanna bite it and get inside it ’til I get you gone\n…like an Oreo\nI love to lick the middle like an Oreo (turn up)\nOreo… Oreo, like an Oreo…\nI wanna bite it and get inside it ’til I get you gone\nYou wan’ know how I get down?\nYou wan’ know how I get down?\nYou wonder how I’m the best and can do all this my mouth\nYou wan’ know how I get down?\nYou wan’ know how I get down?\nYou wonder how I’m the best and can do all this my mouth\n\n[Bridge:]\nCookie, cookie, cookie – I’m a cookie monster\nBreak your back, crack it open like a lobster\nI kill the pussy, dig her\nGrave… she grab the wood like grippin’ … grain…\nI told her “put it in my face”\nLet it rain… let it rain…\n\n[Hook repeat 2nd time]\n\n[Rapverse: Pullout]\nSweet juice, darker berry, that means she got deep roots\nSqueeze fruit, quench thirst, satisfy my sweet tooth\nI got a girl scout at my toll house, it's dinnertime so i'm eating out\nY'all gonn have to squze my french cause i kiss momma with a dirty mouth\nSo tonight imma satisfy my appetite with a candlelight and you apple pie\nI'm superfly...beat up on that pussy, eat it like a cookie....sugarhi\nMoonlight lemme get the mood right and i think you look right girl you looking hood tight\nCould've sworn i told you, it'll be a good night. Throw it imma catch it eat it up food fight\nBrowsing in your candystore. Milk and cookies, open draw\nMistletoe to the middle of the floor,little mama getting kissed by Santa Claus\nHand all in your cookiejar, dipping it like a foreign car\nYou won't search far for that shooting star imma nibble to the middle like a candy bar\nGirl you looking fine. From behind bump n grind\nTurn that ass round, crack that spine we call that Duncan hine\nTootsie Roll that cookie dough, miss Betty Crocker meets Willy Wonka\nPussyhole is like an Oreo, Double Stuff....I'm Cookie monster\n\n[Bridge: 2nd time]\nCookie, cookie, cookie – I’m a cookie monster\nBreak your back, crack it open like a lobster\nI kill the pussy, dig her\nGrave... she grab the wood like grippin’ … grain…\nI told her “put it in my face”\nLet it rain… let it rain…\n\n[Hook repeat 3rd time]\n\n[R.Kelly Verse 3:]\nGirl, I’ve got a sweet tooth – ain’t nothin’ sweeter than you\nI’mma eat it up, beat it up, ’til you holler out “truce”\nMy bed could be your stage, and I’mma make you a star\nYour legs in the air, my hands all off up in your cookie jar\nYeah I’m hittin’ every spot on your map, that’s me goin’ on tour\nMy Tom Ford, your Just Cavalli, that’s clothes all on the floor\nYou throwin’ ass, I’m catchin’ it, the neighbours keeping score\nLouis Armstrong, I pick you up, eat that against the door\n\n[Hook repeat 4th time:]\n\nR. Kelly ft: Pullout – Cookie Monster Lyrics", "title": "Cookie rmx", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}