{"artist": "Ice-T", "songs": [{"title": "Inside of a Gangsta", "lyrics": "Yeah\nThis is Ice-T\nI'mma slow it down for a minute\nI wanna talk to all the ladies out there\nI got my man J-e-ll in the house\nI got a message I wanna send out to all the fly ladies, yeah\nCheck me out\n\n[ VERSE 1: Ice-T ]\nIt's time for me to kick game\nAnd if I can't do it, then ladies, Ice ain't my name\nNow real brothers ain't easy to understand\nAnd it's a long hard road to become a man\nDrama seeks and chases him through every year\nHis homie dies, you might see him shed a tear\nBut mostly hardcore feelings are all you see\nCause you gotta be raw to be called a gee\nBut every man slows down\nYou'll see this side when there's probably no one around\nAnd there's no safer place\nThan if you ever are some gee's homebase\nBut it ain't easy, these brothers got barricades around the hearts\nIt's gonna take time before the trust starts\nBut girl, you must be true\nCause if your man's a gee, he'll definitely die for you\nLook him deep in his eyes, let him know you're there\nShow him that you really care\nTrust me, you move with time\nThrough the darkened halls of his mind\nYou just might find\n\n[ Bobby Ross Avila ]\nThe me inside of a gangsta\n\nYo, Jell\nYou know what I'm sayin?\nI try to represent for all the brothers out there\nAnd I know my latin homies have the same drama with they girls, man\nWon't you let em know how it's goin down\n\n[ VERSE 2: Jell ]\nMan, I'm lookin for a hina that's down\nBut you don't have to be brown\nIf you wanna hang around\nAll you gotta do is stay in check\nCause if you're rubbin me right\nThen you can bet you'll get respect\nAnd that's why I guess my feelings will have to show\nHow can you hide somethin that's in your soul?\nCause there's more to the l-o-c\nThan all the violence, baby, that ain't who I be\nI know my dogs and me can still pull straps\nBut I rather have you rollin in my Cadillac\nCause when we cruisin, thangs is all good\nAnd that goes for every vato in the hood\nNow sometimes it's hard to show the other side\nEspecially when my crew is caught up in a homicide\nCause East L.A. don't play\nAnd if I had my way\nI'd kick it with you everyday\n\n[ Ice-T ]\nWhether black or brown, the situation's the same\nDifferent hoods, but the same game\nSome girls won't take their time\nOthers will stroll through our souls and find\n\n[ Bobby Ross Avila ]\nThe me inside of a gangsta", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg", "album": "VI - Return of the Real", "year": null}]}