{"songs": [{"title": "Why Do", "lyrics": "Familiar scene, street corner, tape and sheets\n18 put to sleep, talk on the street\nTil next week when a different face is another life wasted\nSelf-hatred is dangerous, the world see him as a thug\nBut don't understand\nThat a poor black man, ain't born with a strap in his hand\nWas soft like all children at 5 years old\nBut the cycle and society, turned him cold\nPops fled the scene, left mom's on her own\nTo feed 3 seeds alone, so she never home\nSweatin' for change, but there's big dough in the game\nAnd he wanna be next to push a range\nSo we change innocent, to militant ways, Rollin' with the bigger boys, doin whatever they say\nBut wait these streets ain't got no glory\nMan rolled up on him, you know the rest of the story\n\n[Hook:]\nWhy do we live this way oh lord?\nWhy do we have to live this way?\nWhy do we live this way oh lord?\nWhy do we have to live this way?\n\nLook at what we see and go through\nOf course we're thugs, cause of our will to survive\nNot cause of drugs\nLiving in foulest conditions, still breed proudest traditions\nWe speak, everybody listen\nBut we still jealous, when one of us shining\nLike I'm grindin, why's my man shining?\nI ain't criticizing, been known to be whiling\nJust tryna give you food for thought when I'm rhyming\nCause I'm tired of youts' them dyin' cause there's no guidance\nBut I won't have my fam cryin\nAn eye for an eye? That's your science?\nCool we're the same then, let's get blinded\nI'm not in the hype ting-handle ma business\nIf I feel somethings a threat, then that threats missin\nJust know that my heart was good and that I tried\nI just had too much pride\n\n[Hook]\n\nNo matter how we act, we all got emotion\nJust learn to hide it, it hurts to open\nThe street is a movie, stay in your role\nIf you let it go, vultures swallow you whole\nBut it don't fool me bro, I see things clear\nBig killers get big years and shed big tears\nIf not at trial, gradually as the years pass\nThe guilt set in like a vice on the heart\nReminiscing bout the nigga at your side\nNow he's missin' and no wishin could give him back life\nThat's just life, shit ain't fair\nMan scream \"street dreams', all I see is the nightmare's\nLocked up, years pass seed dun grown\nGet murked or hit the pipe, Either way you a ghost\nAnd that's reality even though it's crazy\nGot to change, or it's the same fate for our babies...\n\n[Hook]", "year": null, "album": "It’s Not A Rumor", "image": "https://images.genius.com/715fae4666a7a92dab37c4e67a75dbb4.500x500x1.jpg"}], "artist": "Akala"}