{"songs": [{"year": "2000-02-15", "image": "https://images.genius.com/78db381d2d753de4e0e8d4c6dba908c2.600x600x1.jpg", "title": "Whoa", "album": "Life Story", "lyrics": "[Intro]\nI'm getting ready to put y'all up on something, man\nYo, when you see something ill, know what I mean?\nThat shit is whoa, anything ill you see is whoa\nNigga, have a big 6 at the curb, that's whoa\nEspecially if he got the fully equipped kit on it, it's whoa\nLike you know what I mean? Like, yo\n\n[Verse 1]\nI had this bad bitch Uptown, she was whoa\nHad me fucked up in the head, I mean whoa\nBought the bitch diamonds and pearls, I mean whoa\nShoulda seen them shits shining on her wrist, whoa\nNow money ain't a problem, see my dough is like whoa\nPulled out my bankroll on y'all niggas like whoa\nFloss the blue shrimp from two-tenth like whoa\nFaggot wanna peep my blueprints, I'm like whoa\nHad to hit the brakes on y'all niggas like whoa\nNiggas getting pulled on my block like whoa\nComing home within a half an hour like whoa\nFronting like they had the manpower like whoa\nMore or less, Moreso\n\n[Chorus]\nI'll rip your torso, I live the fast life\nCome through in the Porsche slow like whoa\nMy niggas, like dough, light 'dro\nNitro, might flow, nice clothes like whoa\n\n[Verse 2]\nEase pain with cocaine like whoa\nNow I'm Doc Strange in the Range like whoa\nHundred miles an hour, switching lanes like whoa\nPlus I'm getting brain from this chick like whoa\nFinger near a nigga asshole like whoa\nScene floss riches and bitches like whoa\n99 Jag Benz Coupe like whoa\nKeep them cheese lines on your blocks like whoa\nGrenade through your window bitch, like whoa\nLove to see me do this shit, like whoa\nNiggas put me through this shit, like whoa\nSo I'mma go toe-to-toe, blow-for-blow like whoa\n\n[Chorus]\nI'll rip your torso, I live the fast life\nCome through in the Porsche slow like whoa\nMy niggas, like dough, light 'dro\nNitro, might flow, nice clothes like whoa\n\n[Verse 3]\nWe bag it, then flip it like whoa\nCars we jack it then strip it like whoa\nFully equip it, front to back, like whoa\nSpitting on fiends that come for crack like whoa\nAsking for shorts and shit, nigga like whoa\nHalf on his crunk, now nigga, that's whoa\nFlow so properly you'll see I'm whoa\nAin't no stopping me, I'm deep like whoa\nGuns be popping, B, we creep like whoa\nHear my name in these streets, it's like whoa\nMust I pound the concrete like whoa\nFill his bitch ass, head to feet like whoa\nYour man ain't whoa, the judge ain't whoa\nC.O's ain't whoa, P.O's ain't whoa\nPlay y'all self, I get the G.I. Joe\nD-I-C, K riders ain't whoa\n\n[Chorus]\nI'll rip your torso, I live the fast life\nCome through in the Porsche slow like whoa\nMy niggas, like dough, light 'dro\nNitro, might flow, nice clothes like whoa\n\n[Verse 4]\nNiggas getting money in VA is whoa\nHonies looking right in ATL is whoa\nNiggas pimping hoes in Chi-Town is whoa\nBitches taking paper in L.A. is whoa\nNiggas stacking dough in D.C. is whoa\nP.R. D.R. hold me down like whoa\nBallers in Detroit hold me down like whoa\nNiggas in New Orleans getting money is whoa\nBoston and Jersey, mothafuckas is whoa\nFlorida niggas and Philly niggas is whoa\nTampa and Texas, Cleveland is whoa\nMemphis and Lil' Rock, my niggas is whoa\nPanama niggas they hold me down like whoa\nMy New York peoples they hold me down like whoa\nBad Boy nigga, word is bond, we whoa\nAlumni bitches, word is bond, we whoa\nN.C, S.C., mothafuckas is whoa\nMy nigga Buckwild, word is bond he whoa\n\n[Outro]\nAnd that's just how the story go\nAnd whoever I forgot on this shit is, whoa\n8th Street, Life Story, Petey P, that nigga\nThe beat I got from big Buckwild is whoa\nThat nigga Black Rob on the mic is whoa\nMy whole fucking flow on the mic is whoa"}], "artist": "Black Rob"}