{"songs": [{"year": "2017-06-30", "image": "https://images.genius.com/5459e9e148431643d2ed2d3bbdecc3b8.1000x1000x1.jpg", "title": "40", "album": "Who Am I 3", "lyrics": "[Intro]\nAyy man\nHello? what's up man?\nI'm finna be out there in a minute, you hear me?\nHah, yeah, word, word, word\nNiggas just had a problem you know what I'm sayin'\nWith the motherfuckin Glock forties, you hear me?\nHah, hah\n\n[Chorus]\nNigga tried to rob me, got the Glock forty (Glock forty)\nBaow baow baow, get the fuck off me (get the fuck on)\nSpeed limit thug, big go shawty (vroom)\nNo NBA, boy we gon' keep ballin' (ballin')\nSee you gettin' money, big go shawty (word)\nCopped two Glocks and they both forty (yeah)\nFucked two cougars and they both forty (forty)\nTwenty-two Ruger, got the scope on it (woo)\nNigga tried to rob me, got the Glock forty (word)\nBaow baow baow, get the fuck off me (word)\nSpeed limit thug, big go shawty (yeah)\nNo NBA, boy we gon' keep ballin' (that's on my mama)\nSee you gettin' money, big go shawty (that's on my mama)\nCopped two Glocks and they both forty (that's on my mama)\nFucked two cougars and they both forty (word)\nTwenty-two Ruger, got the scope on it (woo)\n\n[Verse]\nGlock with the beam, no dope on it (no dope)\nTwo-two-three got a scope on it (with a scope)\nTurn a close friend to a dead homie (to a dead homie)\nLeave a nigga head hangin' with the rope on it (with a rope)\nWe shootin' shit, y'all don't want it (word)\nWe kickin' shit with the big homies (with the big homies)\nGlock-36 with the stick on it (grah)\nGet off my dick 'cause your bitch on it (she suckin')\nWe do not beef over hoes shawty (hoes)\nI do not pop pills I just smoke shawty (gas)\nHold up, what's that on your nose shawty? (huh?)\nPack your shit and hit the door shawty (bye)\nFull of the lean, that promethazine\nThat shit done got me feelin' doze shawty (leanin')\nHundred round drum at your nose shawty (word)\nLet it go like Keisha Cole, shawty (hah)\n\n\n[Chorus]\nNigga tried to rob me, got the Glock forty (Glock forty)\nBaow baow baow, get the fuck off me (get the fuck on)\nSpeed limit thug, big go shawty (vroom)\nNo NBA, boy we gon' keep ballin' (ballin')\nSee you gettin' money, big go shawty (word)\nCopped two Glocks and they both forty (yeah)\nFucked two cougars and they both forty (forty)\nTwenty-two Ruger, got the scope on it (woo)\nNigga tried to rob me, got the Glock forty (word)\nBaow baow baow, get the fuck off me (word)\nSpeed limit thug, big go shawty (yeah)\nNo NBA, boy we gon' keep ballin' (that's on my mama)\nSee you gettin' money, big go shawty (that's on my mama)\nCopped two Glocks and they both forty (that's on my mama)\nFucked two cougars and they both forty (word)\nTwenty-two Ruger, got the scope on it (woo)"}], "artist": "BlocBoy JB"}