{"artist": "Ice Cube", "songs": [{"title": "Don’t Trust Em", "lyrics": "[Verse 1]\nYou can't trust a big butt and a smile\nNo, that's the old style\nIn ninety one, shit ain't quite the same\nBitches got a brand new game, yo\nIt's kinda hard to see\nBut the dating game ain't what it used to be\nBack in the day, if a ho wanted ya dough\nShe give you a piece of ass and there we go\nGo and get knocked up and then get socked up\nYou be broke and locked up\nBut the new's done hit\nBitches all over on some new improved shit\nTo all y'all macks\nCome to find out that bitches are pullin jacks\nI remember every night all you had to worry about\nWas gettin caught at a red light\nAnd a nigga jack you for your Daytons and chains;\nNow shit done changed\nCos you gots to watch the ones in the skirt\nAnd it ain't about gettin burnt\nI know it sounds strange, but could you\nStop thinkin with ya dick for a change\nCos you'll get a bullet in your brain, Mr Rich\nAnd about that bitch, don't trust em\n\n[Chorus 2x]\n(Ice Cube comin at'cha with a crazy pitch)\nDon't trust no (Bitch! Bitch! Bitch!)\n(Ice Cube comin at'cha with a crazy pitch)\nYou can't trust no (Bitch! Bitch! Bitch!)\n\n[Verse 2]\nHere's how the bitches jack:\nThey try to catch a dumb nigga in the act\nYou came to the club, stepped to the bar\nAnd pulled out a wad of Dubs\nAfter you got buzzed, she walk by\nYou saw how big her ass was\nGot her on the dancefloor\nAnd she started dancin like a ho\nJimmy got stiff, she ain't have a ride home\nSo you gave the bitch a lift\nShe didn't wanna trouble you\nBut hopped her big ass in your BMW\nHopped to her house and started kissin\nAnd Jimmy just wouldn't listen\nCos you got real horny\nAnd that ain't cool at four in the morning\nStarted undressing the ho\nGot to the drawers and the ho said \"No!\n\"Not on the first date\n\"It's gettin kinda late, could you come back at eight?\"\nYou said \"Yeah!\" cos you thought you met a wholesome ho\nBut nigga, she know you rollin in some dough\nAnd you'll regret and somethin 'bout a bitch you just met\nDon't trust em!\n\n[Bridge]\n(scratching of BBD's 'Poison' and PE's 'Don't Believe The Hype')\n\n[Verse 3]\nEight o'clock on the dot, nigga's hot\nDick hard as a rock\nStraight on a solo creep\nCan't wait till her little boy go to sleep\nSo you can seduce the G\nBust a nut and make an excuse to leave\nYou got her worked out cos you the man\nBut the bitch got diff'rent plans\nShe said \"Take off your clothes, jump in the bed\"\nWhile she powder her nose\nYou get butt naked, cos you ready to wreck it!\nCos you's a motherfuckin pro, next thing you know\nThe door flies open with a blast\nWith four niggas in ski masks\nPointin a gun at the pimp\nYou're scared as a motherfucker and Jimmy done went limp\nThey beat you down just a taste\nTake ya to your house and make ya open up the safe\nDrove you far, tied up in the trunk of your own fuckin car\nTake you out and pop the cap\nI told you the bitch was a trap\nDon't trust em!\n\n[Chorus 2x]\n(Ice Cube comin at'cha with a crazy pitch)\nDon't trust no (Bitch! Bitch! Bitch!)\n(Ice Cube comin at'cha with a crazy pitch)\nYou can't trust no (Bitch! Bitch! Bitch!)\n\n[Bridge]\n(scratching of BBD's 'Poison' and PE's 'Don't Believe The Hype')", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg", "album": "The Predator", "year": "1992-11-17"}]}