{"artist": "Cadet", "songs": [{"title": "Not Now (Ft Sangeet)", "album": "The Commitment 2", "year": null, "image": "https://images.genius.com/5820d2dba0549dbc477fc37bf62ae455.1000x1000x1.jpg", "lyrics": "[Verse 1]\nAight, venting\nIt feels like a nigga needs help\nI don't wanna say too much though\n'Cause it feels like I've got nothing to myself\nAlready said about Stereotype, and I've said everything about Slut\nI told you lot about waiting by the window\nHow my father was really on drugs\nBut shit ain't changed that much though\nLook, what am I gonna do - lie?\nWhat's the point up in that? If you already know my life\nYou already know about Gipset days\nViolate cousin get banged in the face\nAnd we done the whole 'Krept's cousin'\nI'm my own man, look how I sit in my ways\nAnd I know that you wanna hear a story\nAnd I'ma give you one, nigga, pipe down\nBut this one ain't about back then, this one's about right now\nSo Allah, I beg you guide me\nAnd make everything that I say be truth\nI just want them to understand so they can see the world in my views\nBut anyway, now where was we?\nMy father, you were an idol to me\nEven downloaded Twitter I remember, for me\nJust so he could retweet\nAnyway, shit's so good in the hood\nAnd I still live with my dad in the city\nNormally the vibe's calm in the house\nLast month he's been moving iffy\nI'm like \"yo, pops, what's going on?\"\nHe says \"I'm gonna tell you\"\nI say \"when?\"\nAnd right now a nigga be nervous\nNormally, he would address shit there and then\nSee, aight, it's bait\nBut he wants time, to plan and see what he's gonna say\nI won't put you through the nervous wait\nCool, I'll skip this a couple of days\n\n[Hook: Sangeet]\nI'm praying, Lord, I'm praying for some bad days\nAll these problems got me in my ways\nMan I lose myself thinking about all this pain\nNow when the tables gonna turn my way?\nThere's no quitting now\nListen, I'm the man now\nAnd I can't give up now\nI need you to stick around\n\n[Verse 2]\nNow he takes me and my sister shisha\nWe just wanna know what's going on\nHe's telling man his usual jokes\nWe're looking at him like \"dad, what's wrong?\"\nHe's still telling his jokes and the shisha I smoke\nSnapping and getting out the camera\nRight in the middle of his jokes and his banter\nHear this man say something about cancer\nOf course, he tries to carry on talking\nSis is crying and me, I go stiff\nAnd he's saying shit like \"they caught it early\"\nIt's normal shit, he'll be normal quick\nMaybe I sound naive and shit, but I didn't think that stuff really exists\nI thought that shit only happened on the TV\nNever saw one so close to the kid\nSo nah man, I ain't tryna hear that\nFuck that, I ain't tryna hear that\nNot my dad, I ain't tryna hear that\nNot my pops, I ain't tryna hear that\nSo now what I gotta see my dad go through\nOn top all that shit that my dad's gone through\nHe's just gone from a crackhead to a king\nLike, how much shit can a man go through?\nAnd every day after that was stress\n'Cause every week after that was tests\nLearning shit about keyhole surgery\nSpending hours on the NHS\nA date gets set for the operation\nNow we just gotta get prepared\nHe's staying strong like a father should\nBut look in his eyes, I can see that he's scared\nAnyway, operation's success\nThe cancer's gone\nBut now he's so weak\nI don't wanna ask dumb questions, like \"dad, are you okay?\"\nLook, so I don't speak\nAnd me, I don't talk, me, I just stare\nAnd I don't even know my tough stuff\nJust my brain it can't comprehend, seeing Superman so fucked up\nSo that night I slept there\nWell, you know, just as much as I can sleep\nI'm so close to my dad, his guardian angel's gotta try and get through me\nRemember that story - when I was a young one I missed my birthday and fell asleep by the window\nNow I'm sleeping next to my dad, and I'm moving the cover every time that the wind blows\nTold him rest for six weeks\nBut the second week he was back in the office\nTaking care of business\nMan, I hate it but I guess that's what a boss is\nTaking care of a fucked up me, my sisters and my little bro\nStill being the whole head of the family\nHear [?] nanny saying that she wanna go but\nFuck man\nMy dad, you get me?\nMy idol, my king\nI look up to you so much\n\n[Hook: Sangeet]\nI'm praying, Lord, I'm praying for some bad days\nAll these problems got me in my ways\nMan I lose myself thinking about all this pain\nNow when the tables gonna turn my way?\nThere's no quitting now\nListen, I'm the man now\nAnd I can't give up now\nI need you to stick around"}]}