{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg", "title": "Drake Diss, “Money, Cash, Hoes Needs to be Deaded” [Arsenio Hall Appearance]", "year": null, "album": null, "lyrics": "I think the braggadocio--the money, cash, hoes thing--needs to be deaded. I feel like that’s holding us back as a culture, as black people; it doesn’t advance us in any way, shape or form. We’ve been doing that same thing for years now, it’s like like, what, four decades of the same old [expletive]. Sorry for my language. And I feel like, you know, if you’re gonna be an artist, there’s a time when you just have to embrace the responsibility and understand that the power of music is something so special, and to be able to do in on this magnitude where you reach millions of people, it’s like why not use that for good, why not tell kids something that they can connect with in their life.\n\nAnd really, my mission statement since day one - And I'm getting so worked up talking about this. All I wanted to do was help kids not feel alone and stop kids from comitting suicide. *Applause* Thank you.\n\nAnd I'm never trying to be political, and I'm actually like shaking, I can't believe I'm saying this, but- *Arsenio interrupts*\n\nArsenio: Those two specific things, where does that come from?\n\nCudi: Well, I've dealt with suicide for the past 5 years, you know? Like, it wasn't a week or day that didn't go by where I was just like \"You know? I want to check out\" You know? I know what that feels like, and I know it comes from loneliness. I know it comes from not having self-worth, not loving yourself. And these are things that - you know, kids don't have music that can coach them and give them that guidance.\n\nI didn't have that. I had to listen to Jay-Z and take certain things from it and the other shit, I just didn't know what he was talking about. *laughter* And like, now I'm 30  and I'm like, \"Oh! that's what Hov was talking about, I get it now\"\n\nBut what about the kids who- you never really had an artist where you connected with them all across the board. And I think that that's my job, I'm just really trying to guide people and help people, cause loneliness is a terrible, terrible thing man, and if you don't know how to conquer it, it can eat you alive.\n\nArsenio: How are you right now?\n\nCudi: I'm good, I'm alright."}]}