{"artist": "Benzino", "songs": [{"lyrics": "[Intro: Benzino]\nNiggas don't want it\nThese niggas don't want it\nNiggas don't want it\n\n[Benzino]\nBenzino.. take your best shot\n\n[Chorus: Benzino]\nNiggas don't want it\nThese niggas don't want it\nThese niggas don't want it...\nNiggas don't want it\nThese niggas don't want it\nNiggas don't want it\n\n[Benzino]\nAshtray for the roaches\nShift up V-12 ferocious\nIn the 6, big gats and hostess\nBeneath city lights, niggas get ready\nMake sure you hold your gun right, shoot steady\nStop shakin, betta bust that nigga\nFeel the rush when you squeeze that trigga\nYou only get one chance, one opportunity\nTake your best shot - nigga get through to me\nThe war's on once again, ground zero\nMade Men, let's take it to the end\nWhen the smoke clears - I be the only one left\nFight niggas to the death, you can't win\nUnderstand me Lord, forgive me for my sins\nBenzino.. been killin.. been stealin..\nBeen sellin.. niggas stop tellin..\nBeen robbin.. been shockin.. been rockin..\nI blow up spots - Fuck bin Laden!\nCan't you understand real niggas don't die? (Niggas don't want it)\nJust light a candle up in the middle of July\nAnybody pop shit and don't want to die...\nI know the reason why...\n\n[Chorus w/ variations]\n\n[Benzino]\nEr'body run for they life, take cover\nI rip mics unlike no other\nRosary and wife beater's, ice grill\nCowards show heaters, but don't want to kill\nBitch tight for real, what the deal?\nHow you gonna wanna go the whole 9...\nWhen you scared to hold a 9?\n9 o' clock come you got 15 minutes\n7 days away dogg, gotta get in it (Niggas don't want it)\nI ain't backin up from nobody, no crew\nNo man - especially not you\nYou ain't ready for the big game\nClothesline that bitch, make him know my name\nI'm going deep like Moss\nMake you pay a high price if you don't know the cost\nAin't nothin I'd kill for a cause\nStay high, steady ride ill cars\nBurn that hash, brizza roll that weed\nLet me show you why these fake cats don't know me\nHangmen hang 'em high, hold fire, til you see the white's in they eye\nThe enemy's at the gate, on the front line\nIt gets ugly when I go for mine\nGrab the microphone, spread the prophecy\nGo and tell your hood, your people ain't stoppin me\nMore, he's up to no good, stop watching me\nThis year, my year just watch and see, motherfucker\n\n[Chorus 2.5x w/ variations & Benzino ad libs]", "image": "https://images.genius.com/2dc039a69f839e6cf2cd363179b68679.500x500x1.jpg", "year": null, "title": "Niggas Don’t Want It", "album": "The Benzino Remix Project"}]}