{"songs": [{"image": "https://images.genius.com/89026ea1dc7518eef373c3891314768f.300x300x1.jpg", "year": null, "lyrics": "[Intro]\n(*clears throat*)\nLadies and gentlemen\nThank you for coming out to Basement Beats tonight\nI'd like to introduce to you the #1 jewel dropper\n..Big Lee (*applause*)\n\n[Ali]\nYo I'mma bring it straight to niggas this time\nDerty, fo'sho (uh-huh)\nHow we was doing it (uh-huh)\nNow they doing it (uh-huh)\nLike a wise man once said (wise man)\nLike the Jackson 5 (St. Lunatics though)\nBut rap-wise (rap-wise)\nCheck\n\n[Verse]\nI'm out herre on these streets\nTrying to survive through the cocked heat\nThe block deep, pop you once watch the spot leak\nBut right now, I'm trying to restrain from that\nBut if you trip, I'll grab that thang and let him spray from that\nI'm just a God of the universe, nothing more, nothing less\nDon't believe in spooks, I missed three places after death\nMy mind is clear, while yours is full of distortions\nFrom all that flesh you eat, and scrambled abortion\nMy portion is one, yours is three\n3D, you claim to God Lee, not hardly\nYou looking for Leezuz partner? Well her I am\nWalking on water with 3 dumples in 2 hands\nWhoa damn! Let me slow it down one time\nResurrect the mind and give sight to the blind\nHow many eyes you got? You say 2, I say 3\nYou see what I'm saying, and you still seeing me?\nYou add it up\n\n[Hook] - x2\n\n[Verse]\nCheck, check\nJust do what's right y'all (tell 'em) and that's the bomb\nYou know I where we from, read the Bible and Quaron\nWe roll real drinks, shots of City in the clinc\nI said shrink, last night hurling in the sink\nBoy think, know your type, don't gun snipe or gripe\nBut couldn't get doper than this unless it came through a pipe\nI'm trying to tell y'all, 'Tics drop shit, we here to sell y'all\nThe truth, real always, tight like hallways\nBrawl like ball face, squint the God pay\nHit, bumping and flick, collecting green print then\nHeavy cent, we roll the third behind the tent\nTires spent, and then we float like lint\nMe and the man child, since a youth we ran wild\nGats busting at everybody, \"Hands down!\"\nBig house, mouse zip blouse for the spouse\nCrazy bucks, tv's and rims on crazy trucks\nIt's the Ghostrider, a new science to God a-\nBlunt provider, the kit made the 6 wider\nI serve, touch nerves that swerve in a Suburb'\nOut of life I deserve, define wisdom define herb\nIt's the verbal abuse, what's the use of calling truce?\nLet's ooze loose out tools, Lee without the Bruce\nAnd while you cats go popping bop, me I'm out tops\nBreak it down like shop chops and come off like flip flops\nThat's hip hop\n\n[Hook] - x2\n\n[Ali]\nFeeling good right now derty, feeling good about our self (*echos*)\nPass that sub-conscience, pass that conscience\nPass that super conscience, I'm into that magnetic\nI'm towards infinite (*echos*)", "title": "360", "album": "Heavy Starch"}], "artist": "Ali Jones"}