{"songs": [{"year": "2009-11-10", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Compton State of Mind", "lyrics": "[Intro: Kendrick Lamar]\nYeah, Kendrick Lamar\nThis for the town, nigga\n\n[Verse 1: Kendrick Lamar]\nMe, I'm from the Hub City, yeah, that Compton court building\nCaught a murder when his homie died, judge caught feelings\nI'm on Rosecrans, chilling right inside Best Outlest\nFive dollar Little Caesar, momma shopped at Food-4-Less\nElementary McNair, say what's up to Vanguard\nCentennial High, had me swimming with a pool of sharks\nMe, I'm just a good kid, tryna keep it neutral\nBut I'm well aware that a square can get shot too\nMost Crip and some Piru, that's just how the game go\nHood on every corner, stop for gas and get your brains blown\nBitches with fat asses, burning in the stashes\nMurders in July, call that summer time madness\nRest in peace 4 Bent, rest in peace Mausberg\nSwear to God, when I make it big, your voice'll be heard\nMe, I'm just a good kid, tryna keep it positive\nThough I know it's chaos, forever my heart will live in\n\n[Chorus: Alori Joh]\nCompton, concrete jungle\nWhere dreams are made of\nThere's nothing you can't do\nNow you're in Compton\nThese streets will make you or break you\nExpire or inspire you\nLet's hear it for Compton\nCompton, Compton\n\n(Verse 2)\nTake you back to Y.E.T it was just divining me\nEarl had got disciplined for not catching a fade that week\nShit had made him stronger though, yeah those were the good old days\nEating Tam's burger while my Juvenile CD had played\n21 outside maybe sideline pop\nYellow tape on sidewalk damn somebody got popped\nHoping that I live a lot, I don't want to die young\nPlease don't come shoot up my party, I just want to have fun\nSheriffs in my rear view, mother fuck the police\nPull me over just to plant an 8 ball on me\nFuck it though I'm out here, I've always been out here\nSince the Compton swap meet, black and red LA gears\nPac was on Rosecrans nigga I was right there\nCali Love video he said whattup I said yeah\nFree my nigga J-Dub and both of the J-Mans\nEazy paved the way, Lil Eazy bout to get it in for..\n\n(Chorus)\n\n(Verse 3)\nI'm talking bout Westside Piru, N.H.P., Campanella, Carver Park\nFront Hood, Nutty Blocc, Lantana, 151, Park Village\nCedar Block, Santana\nBurgundy and Blue bandanas\nPeace! Peace!\nFruit Town, Kelly Park, Southside, Elm Street\nPoccet Hood, ATF, MOB, LPP, 135, VTP\nAtlantic Drive, Limehood, NHC, PBC\nPeace! Peace!\nTragniew, Compton Raymonds, Tree-Top, Mona Park, T Flats, 7 Os, 155\nCompton Swamps, Holly hood, T Zones\nAll a nigga really want for us to keep\nPeace! Peace!\nBut shit that a take some time and more time\nBut I'm pushing to get us there in no time\nMe, I'm just a good kid hoping I can spread love\nWord to the county building forever I do it for...\n\n(Chorus)\n\n(Outro)\n[My nigga Hootie told me to keep it Compton, keep it Compton yeah\nE-S-T 1987, Dominguez Hospital that bitch was on Bullis Road]"}], "artist": "Kendrick Lamar"}