{"songs": [{"year": "2012-06-07", "album": "Weight & Glory", "image": "https://images.genius.com/a863b1755efdc7e3ff78486266271cca.600x600x1.jpg", "title": "Go Off", "lyrics": "[Intro]\nYou think bein meek is weak, huh?\nTry bein meek for a week\nAin't that right, Shai? Ha!\nI go off\n\n[Verse 1: KB]\nI go by K to the second letter\nBut my name is a second matter\nGive me a second\nI'll bring you from Cain to the second Adam\nFor His fame, boy, I'm up and at 'em\nFor the pain, boy, I'm up to bat\nAnd patient for the win cause we win slow with these family matters\nAh, ah, I'm so convinced\nThat you won't find no bolder men\nThan those of them that's goin' in for holiness\nGod goes with them\nWhat you know about goin' harder?\nWalk with me through these martyrs\nAnd fathers, dead for they Father\nFor the Father, boy, don't get me started\nLet me try to break it down\nI thought I'd be doin' it if I moved a couple pounds\nMade a hundred thou, bunch of women in the house\nBut that ain't doin' nothin' but f-f-following the crowd\nEverybody's doin' what everybody is doin'\nYou cool with doi'n the opposite of everybody's doin'\nYou goin' hard for Yeshua, you goin' hard in the truest\nI promise\n\n[Hook: Andy Mineo]\nI'm goin off\nGoin harder than I've ever been\nI put that on everything\nI'm goin off\nGoin harder than I've ever been\nI put that on everything\nI'm goin off (for the glory)\nI'm goin off (of the King)\nI'm goin off (it ain't for me)\nG-goin off (it's all for Him)\nI'm goin off (for the glory)\nI'm goin off (of the King)\nI'm goin off (it ain't for me)\nI'm goin off (it's all for Him)\n\n[Verse 2: KB]\nI was a hothead, bad attitude\nWoulda, coulda, shoulda been shot dead (ok)\nAlways runnin' my mouth\nI'd rather die then be soft, man\nI've been slammed on my back just to prove that I'm not scared\n(Turn the other cheek), stop playin\n'Til I met Jesus and really seen just what He's about\nHe endured the cross, to kill 'em all woulda been the easy route\nWhen I first got saved had a dude come up to me, talkin, tough to me\nWanted to duck and swing but I walked away, that was the tougher thing\nSee a Godly man acts different when he's been wronged\nHe knows how to overlook offense like a peepin' Tom\nEasy to smoke your problems away with that Cheech and Chong\nIt's hard take 'em head on, who mans up before the Lord?\nWhat about the brother that discovered that his lover was under the covers with another man? (That's hard)\nWith everything inside of him he wanna go and body him but he givin' him grace instead (That's hard)\nWhat about them brothers who are wanted by multiple women but they married and they know they gonna be there\nFor their children so they willin', they livin', they've faithfully given they wife everything?\n\n[Hook]\n\n[Verse 3: Tedashii]\nI go off, hard for this\nNo holds barred, good Lord this it\nNo arguments, keepin' my cool\nFaith on fire, no arsonist\nIt's hard to miss, 116, yeah\nUnashamed, rep it mayne\nEven when they disregardin' this\nI told you g-go hard for this, ah\nI know it's tough when your eyes and your mind seek lust\nAnd your pride is a must\nAnd the lies rise up to skies, what's what?\nAnd you feelin' like quittin' cause what you tried ain't enough, ah\nThat's when you take heart\nGod got it, still God\nHarder, harder I go for the Lord\nGo hard 'til the day I depart, ah\nGo harder for the Father even if it means I'm martyred, assaulted, departed\nDoesn't matter He bought us\nHe chose us and called us somebody planted and watered\nAll these seeds He increased with ease bearin' fruit like trees\nBreathe (ha) breathe, breath in my body\nOf the King, I'm a product\nChance is slim without Him, I'm saltless\nBut He called us, all us, guaranteed He got us\nSo I live in His name, give Him the reigns\nEven when I know the temptation is tryin' to slip in this thang\nIt's so much easier mayne to give in to sinnin' like men and the many of women I know who caught up in chains\nSteady livin in vain and they sin with no shame\nMan they stuck in the prison until they meet up with saints\nWho be bringin' 'em change, yep all in His Name\nUntil they unashamed\n\n[Hook]"}], "artist": "KB"}