{"songs": [{"title": "Masterplan", "lyrics": "AKIR ft. Diabolic - “Masterplan”\n[Emcee(s): Diabolic and AKIR]\n[Producer(s): Engineer]\n\n[Verse 1: Diabolic]\nYo, Plan A begins with the end of famous trends\nAnd by making hip hop feel like it's '98 again\nI'm saying when I can still listen to Jay and Em\n‘Cause those days came and went as fast as Kane and them\nThe south takes offense to what I say—ask the fans\nThe way they dumb it down, New York don't have a chance\nBrainwash half the land with crack and gats in hands\nThat's The Man with (The Masterplan).  Yeah I know\nJust eliminate any man trying to say some real shit\nPeople ain't as dumb as you think—they may just feel it\nThey may just feel sick of whips, cheddar, and watches\nThey may hear us and rush Tower Records to cop it\nThey may just spend whatever bread’s left in their pockets\nSeeing Diabolic rock shit and question the logic\nI'm expressing my knowledge and blessing the topic\nSo you conscious of (The Masterplan).  Walk with me now\nIt goes beyond the music.  It's the scripture and the Devil\nThey gave black people AIDS and more liquor in the ghetto\nNext thing you know, there's people getting sick at every level\nWhile tycoons are getting rich off the chips that they embezzle\nI'm a rebel with a cause.  Applause ain't necessary\nIt's all secondary to the soldiers in the cemetery\nFuck Bush, but it would have been the same electing Kerry\nTruth getting buried (The Masterplan).  Wake the fuck up\nBin Laden was a scapegoat to send our boys to battle. Now they\nAvoiding shrapnel for a bunch of oil barrels.  We\nNothing more than cattle for the slaughter.  Got a daughter\nCan't afford to see her fall in this New World Order.  They want\nMy supporters drunk as fuck up on the corner\nJust killed another author—William Cooper is a goner\nAll the bullshit they taught ya hits as hard as Joey Porter\nBut it's all (The Masterplan).  Don't let ‘em fool you\nThe lights are on, no one’s home.  Must be in their chromosomes\nEvery politician lies—I hear it in their vocal tones\nLet's get every soldier known and set it like a broken bone\nThey won't see how serious we are 'til they get overthrown\nIt was written in the Declaration of our Independence\nTo instill new government but now it's been neglected\nBy the Acts of Patriots and we the ones who’ve been affected\nBy sick a collective with (The Masterplan).  We the people\nRefuse to pledge allegiance to the demons preaching.  We’ve been seeing\nScreaming on the evil heathens, waking up the people sleeping\nI won't feel we’re even-Steven 'til all y'all just cease to breathe and\nSeeing seems to be believing and they see what we releasing\nI don't even need a reason—word to God, the Holy Ghost\nIt's information overdose.  If you don't see, you’re comatose\nThe revolution's 'bout to start with shotguns in my overcoat\nTo expose (The Masterplan).  AKIR, let ‘em know\n\n[Verse 2: AKIR]\nYeah, my iris size of the enterprising and rise up\nIn the lie for the survivors in the land of 85ers\nI'm the reflection of old-timers with the focused features\nOf my father, so I wonder how the system steady robs us\nAnd leaves a culture to be so impoverished, head-bobbing\nTo the timing of the snare popping from a style hard as stone\nReaganomics starved for artistic options and now\nAdopted as a format to endorse their wack products\nAnd conduct sharecropping while supporting things\nTo keep us locked in correctional facilities, but they ain't\nKilling me.  I'm coming with the illest scheme, smooth brown\nBrother like Billy Dee.  Nigga, is you feeling me?\nI'm getting focused.  First, let's diagnose it\nWhat the system holds close most is money movements\nIt's so explosive, you have to notice corporate owners hold money\nYour business loan is fat, feed political campaigns.  I hide\nBehind the more focused.  Take, for example, the ones\nWho stamped dude, want Afro capitol and brag and boast the most\nBy marble mantles, lighting up expensive candles\nToast to each other as they compete for the largest growth\nCorporate tax break so that they can keep the most\nFinding comfort in their rich man crew.  Trust these are just\nSelective few that the plan lets move through\nBust (The Masterplan).  What a tactic\nIt's hard for us to ever trace.  Fantastic\nPenthouses with glass floors, expensive taste\nDouble the ceilings for you to chase.  It's hard to erase\nHow they respect money and power.  And since the cowards\nTake what's ours, flip it into money showers\nLet's combine talent and specialize with the prowess\nI'ma rap, you make beats, and Jay'll hit the streets\nSouth of Engineer, the sound crispy and loud\nI'ma run around town, ripping stages until promoters\nPay us and DJs'll start to play us\nRecoup and then invest, make money for the people\nThat don't want to be slaves.  Let ‘em rest, build a name\nLegitimize the money we made in different ways\nPlay the game, pay taxes, spend money with the comrades\nIn action, write off expenses, make it a practice\n‘Cause this is (The Masterplan).  Yeah", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}