{"artist": "Big Daddy Kane", "songs": [{"lyrics": "{Big Daddy Kane:}\nHmm yeah, this sound kinda funky, this sound real funky\nI'mma get busy on this, man, with ehm, let's see -\nLike 8 bars, then I want you to come in with a scratch -\n{DJ Mister Cee:}\nWhat? nah man, we ain't havin that!\nJust trip, I'm tired of every record we do\nI got to be jiggin-jiggin this, jiggin-jiggin that\nYou know what I'm saying?\nYo, it's time for me to get busy on the mic by myself\nOn the solo tip, you know what I'm sayin?\nSo yo, step back and let me show you how a real DJ rocks\nAs I kick it like this:\n\n{DJ Mister Cee:}\nA DJ gets no damn credit\nDon't look at me funny, Kane cause, yeah, I said it\nI'm always in the background\nSupplyin the sound, but my props is yet to be found\nBesides, when you're kickin a rap\nThe only other people you can see is Scoob and Scrap\nSo y'all get the girls, okay\nBut I bet you wasn't gettin skins scratchin for Shante\nAnd the first time a record skips\nYou catch an attitude and always tryin to flip\nNow ain't that a bitch\nI swear one of these days I'm gonna pull the power switch\nCause I'm always breakin my neck\n10 in the mornin you were sleepin on my sound check\nAnd when it's time for the show\nI'm supposed to go (Big Daddy) (hell no)\nAm I a man or a machine?\nOr just a fat kid who don't supposed to be seen?\nDon't you know you wouldn't be so amazin\nIf I wasn't helpin you out, you black raisin\nAnd you got the nerve and try to complain\nMakin a record sayin 'it's hard bein the Kane'\nHmm, but all you gotta do is rap\nTry carryin some console cases on your back\nWell, I'm through with breakin my neck\nUntil you learn to show your DJ some respect\nBecause without me you'd be butt-naked\nSo from now on, spin your own damn records\nNow put your weight on that shit here\nYeah (yeah) (x5)\nI'm outta here", "image": "https://images.genius.com/f2f313ca094b7792e9d4a77d69784d4d.475x473x1.jpg", "year": null, "title": "DJ’s Get No Credit", "album": "Prince of Darkness"}]}