{"artist": "Problem", "songs": [{"album": "O.T. (Outta Town)", "title": "Milkin’", "image": "https://images.genius.com/bfccd56b50a159db23155c1829c2b5ab.500x500x1.jpg", "lyrics": "[Hook: Young Thug & (Problem)]\nMilkin' these hoes, milkin' these hoes\nMilkin' these hoes, milkin' these hoes\nCuffin' my bros, cuffin' my bros\nCuffin' my bros, cuffin' all bros\nMilkin' these hoes, cuffin' my bros\n(Get to the money, let's get to the money, yeah)\nMilkin' these hoes, cuffin' my bros\n(Get to the money, let's get to the money)\n\n[Verse 1: Young Thug]\nMilkin' these hoes, cuffin' my bros\n2 million dollar mansion with a swimming pool in the back like it ain't cold\nDeal a nigga actin' like he won't roll back that concert till that 40 showed\nUp! Put the bitch in the boat\nConcierge said the cops are comin' up\nHurry wit' the racks and don't forget a cup\nNigga get stuck just like chuck, Band-Aid on Band-Aid\nPut the lil bitch on the IG, now she think she done struck\nLil bitch, start a fan page\nPut a hole in his jaw wit' a hole in the wall, ooh-ooh!\nShit! Lay it down, now the boy lost\nMy shoes havin' is the tightest, we stay high, nigga, kite us\nMy money long like a rifle, no one-shot, we not snipers\nI wan' bust her like a bubble, bitch I'm chewin' now like a snuffle\nWhen I bump from my racks, bitch I want a million ordered!\nNo shovel!\n\n[Hook]\n\n[Verse 2: Problem]\nMilkin' these hoes, balcony flows\nColder than how I be doin' my hoes\nConference my shooters, I'd read' to expose\nThat most of these rappin' ass niggas is hoes\nYeah and your bills I just spent on my clothes\nTrustin' my bros 'fore I listen to hoes\nFuck these bitches, but I still wanna fuck these bitches\nAnd that's on my mama though\nBought it brand new, yeah, the mileage low\nYou claim you hood but that's comical\nBands on bands, that's logical, money nigga\nDrug dealer, he's cheaper but my drugs realer\nShe's a rat but I fuck wit' her\nShe's hush while I hush wit' her, shhh\nQuiet, bitch, 'fore a nigga cause a riot out\nNever was no love, valentine take a motherfuckin' timeout\nStill motherfuckin' white on the table\nTell my killers go and sniff a line out\nAnd drop a baby mama, drop a nigga drawers\nFuck that till them motherfuckers timeout\n\n[Hook]", "year": null}]}