{"songs": [{"title": "N64", "year": "2013-09-03", "album": "Nostalgic 64", "image": "https://images.genius.com/f28b6855343451e556086d30a3adbd16.494x494x1.png", "lyrics": "[Chorus]\nMoshin' to nostalgic rock shit, I'm Brock, bitch\nSemi-automatic might blast like Team Rocket\nWait, and tell 'em I'm mixing that Slayer with that 2Pac shit\nOne golden bullet to kill all that faggot pop shit\n\n[Verse 1]\nDelivery, I'm the bullet that killed Kennedy\nEnemy, D.I.T.C., darkest symphony\nNecro, fuck around and let the TEC blow\nRed beam to his noggin make it look like techno\nI told you, I don't even wanna be the best, ho\nI'm the threat with Tourette's making motherfuckers John Doe\nRicky Rozay, Aquarius Killa The Keyser Soze\nMaking a family cry together like the O'Jays\nBack in the old days, I'm the one that's chosen\nThug from the 90's, I'm cryogenically frozen\nAvenger, but yet I be the Joker and the Riddler\nWith a mindset that's switched like Harvey Denture's dent\nThe Dark Knight, fuck a Clark Kent\nMartin Lawrence when he traveled back in time with suspense\nSuspended, animation when my brain reacts\nDon't belong in this world like I'm Samurai Jack\nClick Clack on the Glock, seventeen get me\nThen put the Ghostface so we can empty the cream\nCash rules everything around me surrounding\nThe ditch where they dug the darkness that's shrouding\nFound me, Nemo, ego Kanyeezy\nBruh I'm from a city where niggas they con easy\nWhere they quick to pull that trigger, never a squeegee\nThen make it on the late night news, nigga, good evening\n\n[Interlude: Sample]\n\"Yeah, Mike, things are quite here now at Miami, Carol City High School, but earlier today was quite the scene when nearly the entire student body walked out of the school to protest Trayvon Martin's murderer. Signs in hand, chanting, \"Justice for Trayvon.\" Now Trayvon actually went to school here at Carol City last year so some of these kids actually knew him personally, and they say his murderer should be behind bars\n\n[Chorus]\nMoshin' to nostalgic rock shit, I'm Brock, bitch\nSemi-automatic might blast like Team Rocket\nWait, and tell 'em I'm mixing that Slayer with that 2Pac shit\nOne golden bullet to kill all that faggot pop shit\n\nMoshin' to nostalgic rock shit, I'm Brock, bitch\nSemi-automatic might blast like Team Rocket\nWait, and tell 'em I'm mixing that Slayer with that 2Pac shit\nOne golden bullet to kill all that faggot pop shit\n\n[Verse 2]\nI'm Acid, fornicating with crack shit\nCheated with the virus that took over the life of Magic\nSharing a needle, with the common-slash-hobo\nSterilize with the spit that shoots from a Komodo\nDragon, gun chuck, fire, I'm blasting\nDope and sick , that shit is just a classic\nHuh, that's a hit for you bastards\nThat's the shit for you bastards\nI'm lugubrious because I'm from a place where niggas\nShoot at shit and never on no Buddha shit, that knock-knock\nAnd who is it? Am I really losing it? Maybe\nTrapped in a white room with a dead baby\nAm I going crazy? Is my name Casey?\nAnthony, then the baby turns into an amputee\nGod damn I'm really losing my mind\nOr should I end it all just by grabbing a nine?\nBut, it's too easy, Demonz of my mind leave me leave me\nPut me into isolation so you wouldn't see me\nFree me from misery and un-easy\nPain, emotions from the crypt I gain\nYet another young brain slain, mane...Dang!\nHe just lost consciousness\nThat's life when you live without consequence\nDeath over sixteen shots, his head is split\nDead"}], "artist": "Denzel Curry"}