{"artist": "Warren G", "songs": [{"year": "1994-06-07", "lyrics": "[Verse 1: Warren G]\nThis DJ, he gets down\nMixing records while they go round\nTo the hip to the hop, you just don't stop\nProducing funky tracks til it makes you drop\nConjunction junction, whats my function\nI'm hookin up tracks so that niggas can function\nIt's not Pete Rock or that nigga Dr. Dre\nIt's this muthafuckin nigga from around the way\nThe one that brings you styles on timesy, whymsy\nThats why it's so hard to find me\nConduction, construction when I bust choo choo, bustas\nIt's a must when I bust when I bust, I gotta come correct\nThe R to the E to the S-P-ect architect\nYup nigga no I'm not tweaking\nIts one of the sixteen minds that I'm speaking\nThe W-A the double R the E into the R\nA-B-C-D-E-F to the muthafuckin G\nOoh shit as I flex I wrecks I checks\nSo what's next\n\n[Verse 2: Mr. Malik]\nOh who's next, to catch wreck on the menu\nI snap necks when I flex let me continue\nSend you, on a mission when I rock\nIt goes on and on and on and you know it don't stop\nYes I'm back on another route, ready to take em all out\nNow can't get with this, cause they get faded without a doubt\nCheck em, I wreck em like 1-2-3 why\nThey can't fuck with that rude one Malik\nWill I drop it, can't stop it, lit it up like a rocket\nWhen they get out of line I grip the nine out my pocket\nLock it down yeah that's what I do\nHow could you come solo nigga when I run through your whole crew\nI rule, fool, act like you heard it\nThe one I run with, can't remember the last he murdered\nDem do away or dem get dealt with\nKill the noise I want silence, no bubbaclad bullshit\nNigga, it's all about my grip\nSo the one who starts to slip is the one who gets ripped\nKept a chip on my shoulder not now that I'm older\nThey, all of me, the LBG high roller\nCause back in the days on the side where we sat\nNiggas come up missing if they didn't have they strap\nSo why, try to be, like me\nJust when you pull back a G and I think I'm Mr. Malik\n\n[Hook]\nWell if the beat is funkadelic then the tune is right\nMr. Malik and Warren G so tonight's the night that we spark\nWe spark in the dark when we do it in the park\n\n[Verse 3: Mr. Malik(Warren G)]\nWell its the A to the B (and the C to the D)\nHey my name is Mr. Malik with that DJ Warren G\n(Mr. Malik can you hear me)\nYes I'm the host with the most they can't get close or even near me\n(I said a tick, tock, ticking to the era)\nI said a pick which Glock bitches get shot its still terror\n(Terror, terror, pick which Glock)\nWhich one, (the black one with the big pin lock)\nMe and Dre in a five hundred so those who wanna get dropped\nNigga go knock, knock I trick a flow non-stop\nFly double I never slip trip or flip flop\nThe tune is funkadelic, the crew was right\nBut if Malik will make you smell it then tonight's the night\nFor me to stay trump tight up with my nigga Warren G\nThat's sorrow when you borrow but you can't be oweing me\nWhat's next\n\n[Verse 4: Warren G]\nI say what's next, what's next what's N-X-E-T\nIt's me, Warren to the muthafucking G\nFlowing with my little homey named Malik\nYes everybody will just tweak\nOff the new style ill ease that we got\nYes it's me Warren G on the block\nPump pump, block Glock, let me just tick tock\nIt's me Warren G on the muthafuckin rock-n-roll\nStroll, then stiff back to the rap\nIts me with the big black mack eleven strap\nSo let me flix into the flex\nWoo, so what's next\n\n[Hook]\nWell if the beat is funkadelic then the tune is right\nMr. Malik and Warren G so tonight's the night that we spark\nWe spark in the dark when we do it in the park", "image": "https://images.genius.com/90788604880076aca392c53224d10eba.500x500x1.jpg", "album": "Regulate... G Funk Era", "title": "What’s Next"}]}