{"artist": "Andy Mineo", "songs": [{"title": "Death Has Died", "album": "Heroes for Sale", "year": "2013-04-16", "image": "https://images.genius.com/fdf80f726778a05ec46bdc108384b8f2.540x540x1.jpg", "lyrics": "[Verse 1]\nIt was just last week that my grandma died\nIt's been years since I've seen family on my father's side\nA bittersweet moment but tell me why\nNothing less than the sting of death brought us together\nI sat and listened to the priest tell lies\nTo appease loved ones in they seats\nWhen you're looking at a face that's weeping\nThe grim truth don't bring 'em no peace\nSo I put on all white gloves like Mr. Jackson\nCarry the casket to the Cadillac then\nI realize this is the first time that me and my brothers ever did something together\nWhatever, I'm grown now, come on, let's just put on our smiles and take pictures, we can take pictures\nEat this humble pie and leave them dishes\nFor somebody else to clean 'em until I see ya'll again\n\n[Pre-Hook]\n(Breaking down, breaking down)\nEverything here is breaking down\n(Br-br-Breaking down, breaking down)\nIt's all breaking down down down\n(Breaking down, breaking down)\nEverything here is breaking down\n(Breaking down, breaking down)\nBut this won't be forever no\n\n[Hook]\nYou used to make me cry\nBut one day he'll wipe every tear from our eyes\nHe'll come make all things right\nAnd we'll sing death has died, but until that day\n\n[Interlude]\nUntil that day\nOh, until that day\nOh, oh, oh\nThis won't be forever\nUntil that day\nOh, until that day\nOh (this won't be forever)\nThis won't be forever\n\n[Verse 2]\nI hopped off the plane\nMy God, what a scene that I seen on that TV screen\nPeople huddled round, hands on they mouth\nNot again, same problem, it hit a new town\nTwenty-six dead, twenty of 'em kids\nWhere do you begin when some lives just ended\nAnd everybody got the question\n\"If God's so good, how he let this happen?\"\nIs it mental health? Is it gun control?\nIs it we make superstars out of animals?\nIs it the movies we make? The video games?\nI don't know, but God I want an antidote\nAll I know is this world is broken\nOur sin is the reason it ain't like it's supposed to\nWords fall short tryna comfort the grieving\nBut you gotta know that there's hope to believe in\nOne day my God gon' crack the sky\nHe gon' bottle up every tear that we ever cry\nBring truth to every lie, justice for every crime\nAll our shame will be gone and we'll never have to hide\nNo more broken hearts, no more broken homes\nNo more locking doors, no more cops patrolling\nNo abusive words, or abusive touches\nNo more cancerous cells that'll take our loved ones\nNo more hungry kids, no more natural disasters\nNo child will ever have to ask where his dad is\nNo funerals, where we wear all black\nAnd death will be dead, then we'll lock the casket, yes\n\n[Hook x2]\n\n[Interlude/Outro]"}]}