{"songs": [{"lyrics": "[Sample]\n[Its like finding feathers on a housecat]\n\n(Jay-Z)\nLemme take yall somewhere else right now\n\n[It's like searching for a needle in a haystack]\n\nLemme get y'all to zone out wit' me, man\n(Its a'ight, don't be scared)\nTake y'all niggas left and center (zone out wit')\nBullshit\n\n[Hook: Sample x2]\nI hear the people talk (I hear y'all)\nWhistling when you walk (Y'all hear me)\nYour kind is hard to find\nDarling, I'm glad you're mine\n\n(Jay-Z talking during chorus)\nY'all niggas should twist up sumthin\nReal real real tight right here\nZone out wit' ya boy\nIf you don't smoke, grab you something to drink\nMix it up right\nIf you don't smoke or drink\nMan, just light up an inscense\nFuck it\nClose ya eyes... Vibe wit' a nigga\nI want y'all to really hear me\n\n[Verse]\nI speak through music, I reach you dudes\nWe can get deeper in the dirt than cleat shoes\nI refuse to lose\nI peep you creeps three months in advance\nI SEE RIGHT THROUGH YA, JUDAS!\nThe man that I am and damn you don't know\nThe harder you go at me the harder I flow\nLet's do this\nI'm just a mirror reflectin' your image\nThe minute you switch up your face I pick up the pace\nThere's nothin' to it\nPull hammers from my waist\nWe can clap at this amateur pace\nIf that's what's crackin'\nOr we can play this on \"All Madden\"\nCan you even fathom not havin' a fear in the world\nI'm cool in my afterlife\nIf I'm readin' these chapters right\nPlease what have you, I breeze through Matthews\nBleed if I have to, you cowards die a thousand deaths\nFake fucks face-down on your housing steps\nAre y'all even gettin' this message?\nI ain't bein' aggressive\nBut if you testin' my life then, shit, I gotta answer\nGotta cut off the cancer, young'n, pull your pants up\nYou gettin' too big for ya britches\nYou fuckin' wit' a dude that did it wit' digits\nBreathing's a privilege\nDon't you know when you're defeated?\nWon't you though? Throw in the towel\nI'm better with vowels\nI'm a man of principles; damn-near invincible\nIn my own mind now that my soul's aligned\nI didn't know before now my role's defined:\nTake hold and control what's mine\nCome and get me!\nCome and take my life, you comin' wit me\nCome and try to take me for granted\nI'll take you off this planet\nDammit, man this is the gift from God\nThis ain't happenstance\nAnd your arms are too short to box\nPlus we knuckle up unorthodox\nYou can't take me off my grind, get off my cock\nWhatchu thought? It's the Roc\n\n[Sample x3]\nI hear the...\n\n[Outro: Jay-Z]\nBack in the mix of the scuffle\nSince '86 I was sick with the hustle (Woo!)\nGet a couple of chicks to touch you (Woo!)\nFeather-weight fucker dont ever hate on the brothers\n\nHeh-heh\nThought I was playin' but you niggas'll stop now\nI ain't gotta sell another record in my life\nThe Blueprint 2, baby! (Mm-hmm)\nSee y'all in November (Oh shit!)\n\n[Sample Hook]1x\nI hear the people talk (C'mon)\nYes sir and when you walk (C'mon)\nYour kind is hard to find\nDarling, I'm\nDarling, I'm\nDarling, I'm", "title": "People Talkin’", "image": "https://images.genius.com/a7449b38b8eab47232b379bc442a5f10.1000x1000x1.jpg", "year": "2001-11-18", "album": "MTV Unplugged"}], "artist": "JAY-Z"}