{"songs": [{"image": "https://images.genius.com/a9dab1316a072dc685292eb0051fe88a.500x500x1.jpg", "year": "2006-11-02", "title": "Duce-One", "album": "The Complex Experiment: Vol. 1", "lyrics": "[Verse]:\nYou always hear me shouting it out\nNow you 'bout to find out\nWhat it all is about\nLet me break down the route\nI was the ONE that saw it all through my window view\nSaw some flashy niggas stunting, said, \"I want that too/TWO.\"\nShane was in his Jeep, THREE cats outside\nCame up to me, I stayed G, gave all FOUR of them FIVES\nThey asked if they could use my go for a couple of ticks\nI said, \"Sure. My mom don't come home till SIX.\"\nIntermission real quick\nShouts out to SEVEN\nThis is him on the beat just in case you need reference\nEIGHT bars in\nThe same week I found out what an EIGHT ball is\nStayed in the streets\nGot robbed one time didn't have my NINE\nI wasn't build for the game, Shane told me TEN times\nHad a good connect in Augusta G\nWould take the drive just to get it for ELEVEN a key\nSo please excuse the smell of dirty laundry being aired\nBring me TWELVE bars back I'll start the verse from there\n\n[XV talking]:\nYo, I don't think y'all know what's going on. Play that shit back for 'em. Make sure y'all paying attention\n\nYou always hear me shouting it out\nNow you 'bout to find out\nWhat it all is about\nLet me break down the route\nI was the ONE that saw it all through my window view\nSaw some flashy niggas stunting, said, \"I want that too/TWO.\"\nShane was in his Jeep, THREE cats outside\nCame up to me, I stayed G, gave all FOUR of them FIVES\nThey asked if they could use my go for a couple of ticks\nI said, \"Sure. My mom don't come home till SIX.\"\nIntermission real quick\nShouts out to SEVEN\nThis is him on the beat just in case you need reference\nEIGHT bars in\nThe same week I found out what an EIGHT ball is\nStayed in the streets\nGot robbed one time didn't have my NINE\nI wasn't build for the game, Shane told me TEN times\nHad a good connect in Augusta G\nWould take the drive just to get it for ELEVEN a key\nSo please excuse the smell of dirty laundry being aired\nBring me TWELVE bars back I'll start the verse from there\nNow if you came here and hit up THIRTEENTH Street\nWhen I was FOURTEEN you see me on the block every week\nAt FIFTEEN I went from Hoffa to XV\nAnnounce the name to the world on The Legacy\nThe first time the city heard the boy's hot SIXTEENS\nBut back then, I tried to sound just like Jay-Z\nSwore my last song for Shane was in 2003\nPick up The Answer, I believe it's track SEVENTEEN\nEIGHTEEN mixtapes later, I'm known to the public\nAs The Definition of it, nigga hate it or love it\nWrote NINETEEN songs on the Greyhound buses\nStarted on Complex cause I know they want it\nSince I know they wanted more then what I gave to them\nFlows outside of drug dealing and 20 inch rims\nCheck the block that grew me and the age I was\nWhen I made a classic album, deuce to the one\nThat's 21 nigga"}], "artist": "XV"}