{"artist": "E-40", "songs": [{"title": "Dem Boyz", "image": "https://images.genius.com/43cc1955c01c5556fda9d51868d1f070.499x449x1.jpg", "album": "Revenue Retrievin’: Day Shift", "year": "2010-03-30", "lyrics": "[Intro: E-40]\nAnd all the niggas fuck with it cause all the bitches fuck with it\nAnd all the bitches fuck with it cause all the niggas fuck with it\nAnd all the niggas fuck with it cause all the bitches fuck with it\nAnd all the bitches fuck with it cause all the niggas fuck with it\nBitch!\n\n[Hook: Y.V.]\nDem boyz goin rep hold down they turf\nCan't shaime them boyz they game don't work\nThey don't really want that dem boys come to ya\nAim a bird over ya head them boys got gouda\nDon't fuck with dem boyz (don't fuck with dem boyz)\nDon't fuck with dem boyz (don't fuck with dem boyz)\nDon't fuck with dem boyz (don't fuck with dem boyz)\nDon't fuck with dem boyz (Beitch!)\n\n[Verse 1: E-40]\nDon't fuck with them boyz them lil niggas got ammo\nTear the head off a bat them lil niggas is animal\nCome up with street money off them schemes and scandals\nI'm from the real world with crooks, killers, and vandals\n(Crooks killers and vandals?) all over the gouda\nCrack ya cranium open don't let the skinny jeans fool ya\nHe's the driver, I'm the shooter, we the dynamic duo\nI'm from northern California but we call it Califoonia (uhh)\nBeen gassed without the propane (propane)\nDope game before the cocaine (cocaine)\nI'm so natural like a afro (like a afro)\nLike ball players spit tobacco\nR.I.A. switching lanes with my lade (lade)\nI season up season down so you can't play me (play me)\nMan them boys got pies\nThey a point the long barrow right between ya eyes\nBitch!\n\n[Hook]\n\n[Verse 2: E-40]\nUhh, drunk classes, in and outta court (outta courts)\nToo many DUI's, drinking is my favorite sport [burps]\nMoney, clothes, cars and sex\nStreet so cold mane they need some Mucinex\nNever hustle backwards mane I always hustle forward\nShe say she got some money for me, 40 all for it\nI'm from the 707 where they grow it and smoke it\nIf it's alcohol in it then ya know I'mma po' it\nUhh, I take it back to the eighties\nWhen I was serving ya mama the reason why ya crack babies (crack babies?)\nWhich I don't really like to brag about\nI had style just before they brought swagger out\nNo one on the corner like us\nDookie rolled chains and them gumby haircuts\nThem boyz just talking they ain't got no bucks\nWe'll never be them they just wanna be us\nUhh\n\n[Hook:]\n\n[Bridge: E-40]\nAnd all the niggas fuck with it cause all the bitches fuck with it\nAnd all the bitches fuck with it cause all the niggas fuck with it\nAnd all the niggas fuck with it cause all the bitches fuck with it\nAnd all the bitches fuck with it cause all the niggas fuck with it\nUhh, beitch!\nNo one on the corner like us\nDookie rolled chains and they gummy haircuts\nThem boyz just talking they ain't got no bucks\nWe'll never be them they just wanna be us\nUhh\n\n[Hook:]"}]}