{"artist": "Anderson .Paak", "songs": [{"title": "Sweet Chick", "album": "Oxnard", "year": "2018-11-16", "image": "https://images.genius.com/f86cd94b8dc54301943533fa84ca4350.1000x1000x1.jpg", "lyrics": "[Intro]\nOhh yeah\nOhh yeah\nSpotlight, that's just my life and time\n\n[Verse 1: Anderson .Paak]\nOkay, I got me a sweet bitch\nSo I'm headed to N.Y. just to be up in it\nOff of Rivington, we fuckin' up some Sweet Chick\nShe go vegan on the weekends\nHell naw, you shouldn't be eatin' dick\nI got me a freak bitch\nAnd she nasty, she wild, she a free spirit\nAfter me, she gon' let the whole team hit it\nGoddamn, why can't you be more discreet wit' it?\nI'm at peace wit' it\nCome on, peace, kid\n(Spotlight, that's just my life and time)\nYeah, it ain't much, look\nOkay, I got me a cheap broad\nShould be tippin' but she'll put them dollars in her bra\nShe be cussin' out the managers at restaurants\nEvery time we go to dinner, shit is free of charge\nI got me a centerfold, kinda sorta\nBut she poppin' on the Insta though\nShe gon' have a million followers by the winter time\nAfter that she'll be somebody that I used to know\n(Spotlight, that's just my life and time)\nI had to let her go, you know?\nHad a Xan ho\nShe be mumblin' and hard to understand though\nShe in love with all the trappers from Atlanta\nIntroduced her to T.I. and that was the last time I had her\nGot a skater bitch\nShe a gamer, gotta take her to arcades and shit\nShe be watchin' Anime while I'm layin' dick\nWanna go to Comic Con, I'm like \"Come down a bit\"\n(Spotlight, that's just my life and time)\nI like gangsta shit, uh\nSpeakin' of which, got a gangsta boo\nMan, her mama and her grandmama gangsta too\nWith the drama, keep the llama in the daisy dukes\nShit, if I try to take her to the party, she gon' shoot up the room\n(Fuck outta here, nigga, run ya shit, run ya shit)\nOoh, got a lazy bitch\nOh, I'ma do it tomorrow, tomorrow came and went\nAin't no fuckin' at the crib, it's probably dirty as shit\nHow you runnin' outta breath when you ridin' the dick?\nHo, oh nah, nah, nah\nYou gotta get the fuck up off me right now\nOh, baby, I been thinkin' 'bout\nWhat I gotta do all day and I'm fuckin' tired, Wilma tired\n(Spotlight, that's just my life and time)\nDamn, okay, I got it\nGot a cougar bitch\nWe be fuckin' in the back of Subarus and shit\nI would love to spend the night, there's always food in the fridge\nShe be knowin' what she like and what to do wit' it\nUh, throwin' me around, wasn't used to it (Wasn't used to it)\nGotta tell my bigger homie how abusive she is\nNigga, no one would believe me, they like \"You just a bitch\"\nHad to buy surveillance cameras to get proof of it\nDamn\n(Spotlight, that's just my life and time)\nI'm suin' you, bitch\n\n[Verse 2: BJ The Chicago Kid]\nWell, I got a tight ass one from Chicago (From Chicago)\nShe said she lowkey but everybody know (Everybody know)\nBitch is from Heaven, mattress on the floor (Whoa)\nInvite her to the crib, show her how I live\nBut she bought some roaches, no\nNext stop, Ohio (Ohio)\nHer mom's shoppin' these parts from Mexico (Mexico)\nShe demand the D before and after show (After show)\nThese are the ups and downs when we're in the\n(Spotlight, that's just my life and time)\nOoh, yeah, baby, baby, yeah\nYeah, baby\nAh, ohh\nDarlin', darlin', darlin', darlin'\n\n[Break: Anderson .Paak & BJ the Chicago Kid]\nOkay, ha, shit\nYes, Lawd\nOkay\n(Spotlight, that's just my life and time)\nI got it, uh\n\n[Outro: Anderson .Paak]\nGot a yogi bitch\nAnd she natural, she hate to wear deodorant\nAnd she bashful if she come up out those clothes she in\nYou got a what, my nigga? You got-you got a what?\nOh, your bitch is flexible?\nNo, no, no, no, no, no\nYou like yogi bitches now? Fuck that!\nHow'd you get in here? Chill\nLet's see if your bitch could dodge these bullets, nigga\nMy nigga, you know what?\nNo, no\nGet the fuck, wait, you fuckin' wit' a bitch\nDon't talk\nThat don't shave her under arms?\nYou know what? You gon' run that under arm hair bitch\nBitches in the hood need that for edges\nPut the gun down, yo\nWhat else you got in your bag, bitch? Come up off that\nShut the fuck up, nigga\nOh\nYou know what, come up off your cha-you know what? I fuckin' loved you, nigga\nOkay, okay\nYour bitch is makin' me-you know what, bitch?\nShe 'bout to die first, fuck that\nDon't move"}]}