{"artist": "50 Cent", "songs": [{"album": "Mixtape Legend", "image": "https://images.genius.com/c78ba6e180e07842a12b28e83ee5b6d4.1000x1000x1.jpg", "title": "Gunz for Sale", "lyrics": "[Intro]\nWoo wooo\nHaha\nG-Unit!\n\n[Chorus]\nWe got those semi-automatics and we got them revolvers\nWe them niggas you should get at if you got a problem\nWhen them hollow tips hit 'em, man, that should solve 'em\nWe got them Lugers, the Rugers, them M1s and they all for sale\nGot that nine millimeter, got that ten millimeter\nGot that little deuce deuce and they all for sale\nGot that old trey pound, got that new four pound\nThey've been used once or twice and they all for sale\n\n[Verse 1]\nWa da da dang, wa da da da dang\nI'm the reason them thangs in my hood go \"bang!\"\nI got that trey deuce, I call that, my nigga behave\n16 gauge in case you niggas wanna get crazy\nWhen a sawed off hit your body parts, they fall off\nYou get hit in the leg, man, you can't even crawl off\nWhen that AK switch to automatic to spray\nEverybody out this bitch could get hit with a stray\nI got silences and scopes, military issued pistols\nHolla at me, whatever you need, homie, I can get you\nNickname rubber grips, hollow tips, extra clips\nYou don't want your shit to jam, better buy a cleaning kit\nTeflon, kevlar, need to wrap it round your chest\nYou pop off, they pop back and you get left a bloody mess\nMAC-11, MAC-10, time for some action\nDump a clip out this bitch, see how niggas act then\nGot guns and ammo, they all for sale\nClips included, you're responsible for your bail\n\n[Chorus]\nWe got those semi-automatics and we got them revolvers\nWe them niggas you should get at if you got a problem\nWhen them hollow tips hit 'em, man, that should solve 'em\nWe got them Lugers, the Rugers, them M1s and they all for sale\nGot that nine millimeter, got that ten millimeter\nGot that little deuce deuce and they all for sale\nGot that old trey pound, got that new four pound\nThey've been used once or twice and they all for sale\n\n[Verse 2]\nG stand for \"Gangster\", Unit stand for \"U Niggas In Trouble\"\nBetter lock and load on the double, G-Unit!\nFresh out the box, 40 Cali Glocks\nCalico 20 shot, street sweepers clear the block\nI'm that nigga niggas call when them shots pop\nTake 'em to my grandmama basement, show 'em what I got\nLook, I got three 380s, a TEC and two M1s\nIce came through on some shit and bought him one\nThem young boys from the projects crazy\nHe was kissing on the toast and saying \"that's my baby\"\nBuck came through saying \"50, show me some love\"\nSold him a dub-dub, something he can sneak in the club\nGave him some shells for that trey 8 snub, he gave me some bud\nI gave him a pound, gave me a hug, love is love\nI take it back to the NWA days\nFuck Jake, my CDs raise the crime rate in the tri-state\nGot some Rugers, some SIGs, some Colts\nMy nigga, for real, holla at the kid (they all for sale)\n\n[Chorus]\nWe got those semi-automatics and we got them revolvers\nWe them niggas you should get at if you got a problem\nWhen them hollow tips hit 'em, man, that should solve 'em\nWe got them Lugers, the Rugers, them M1s and they all for sale\nGot that nine millimeter, got that ten millimeter\nGot that little deuce deuce and they all for sale\nGot that old trey pound, got that new four pound\nThey've been used once or twice and they all for sale\n\n[Outro]\nYeah, man, y'all niggas got any problems?\nY'all know where y'all can reach me at, man\n19174991919, homie\nYou know what I mean, holla at the kid\nYou know what I mean?\nSo what it got bodies on it, it still look new! Haha", "year": "2003-09-23"}]}