{"songs": [{"lyrics": "[Verse 1: Jay-Z]\nRight, right\nYo, peep the scripts, scoped honey from the whip\nJumped out like \"YO! Who the fuck you with?\"\nFlash the jewels 'cause that's the rule\nDamn I like a girl who spend a little cash for her shoes\nFace natural - can I get at you?\nSaw a spot on the body look nice with a tattoo\nWith my name, but didn't want to jump the gun\nI didn't know how many niggas was humping hon\nI said I never seen a face like yours before\nAnd I been around some cute whores before\nThat either me or my boys tore it up before\nSo I'm hoping you different, let you push the 6 and\nGive you a different life and baby if it's right\nJump on it in the morning and ride it 'til the night\nWant to buy you real jewelry when it hits the light\nBitches'll momentarily lose they sight\nShe said\n\n[Chorus: Lil Kim]\nI know what boys like\nI know what they want\nI know what boys like, boys like\nI know what boys like\nI know what they want\nI know what boys like, boys like me\n\n[Verse 2: Lil' Kim]\nYou want a cutie with a booty like POW!\nDeeper than a MILE! Earrings shine like TADOW!\nBut I'm a real bitch so you know I do real things\nOnly real bitches live like queens - Get it?\nSafety deposit in the walk-in closet\nMarble faucets and matching Rolls Royces\nIn the driveway from Monday to Friday\nI be the richest, shitting on these bitches\nWhile chickens cluck giving up the butt\nI plays the cut with the Daddy Warbucks\nYou can call me a slut, who gives a fuck\nThat's fine nigga shit, I'm good with mine\nI can tell by your shoes you know what I want\nFuck a pre-nup give me half up front\nMy sex be the best so we split these costs\nYou can stop saying mine\nAnd start saying ours\n\n[Chorus: Puff Daddy & Lil' Kim]\nI know what girls like, I'm a flyyyy girl\nI know what they want\nThey want to sex me\nThey think I'm sexy\nI know what girls like, girls like me\nI know what boys like\nI know what they want\nThey want to sex me\nThey think I'm sexy\nI know what boys like, boys like me\n\n[Verse 3: Jay-Z]\nGot the bomb place, fireplace John Blaze\nVictoria Secret lingerie, ice like Don King\nThe price was like eight digits a long way, shit\nGot the beachfront view, V1 too\nCop you one, cop me one too\nOn the place, jet ski's park by the lake\nNo neighbors, make all the noise you want to make\nInvite your friends over\nLet 'em make their way through the Benzes and the Rovers\nBefore they reach the door\nVacate, away a week or more\nFirst class to and fro, freaking off\nGot to have things locked, champagne popped\nCruise around the world 'til the damn thing stop\nCop Rembrandt, hang 'em, pay the lot\nCan't complain, we balling, true or not ma?\n\n[Chorus: Puff Daddy & Lil' Kim]\nI know what girls like\nI know what they want\nI know what girls like, girls like\nI know what girls like\nI know what they want\nI know what girls like, girls like me\nI know what boys like\nI know what they want\nI know what boys like, boys like\nI know what boys like\nI know what they want\nI know what boys like, boys like me", "title": "I Know What Girls Like", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg", "year": "1997-11-04", "album": "In My Lifetime, Vol. 1"}], "artist": "JAY-Z"}