{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse One: Scrap Lover]\nSURPRISE! Guess who's on the rise?\nAnd competition, I'm takin, and breakin em down to size\nI operate around the clock like city bus\nNever take five, cause yo when you rest, you rust\nBe advised, that I pack heat for beef\nI'm knockin brothers out the box, and knockin out teeth\nTwenty-one years young and I got the knack\n(You got it!) to attack and scoop girls like a set of jacks\nRuff rhymes that rag any rap herb\nBuilt by the best to bust swerves like a sharp curve\nFifty percent on wax, no matter of fact\nEvery nine out of ten rap acts produce a wack track\nTwice as nice, but smooth as silk\nSomebody writin for Scrap, is like givin a cow milk\nI release, to make it hard for the fellas to cease\nCause I'm the type to make noise, I don't make peace\nHere's a new jack, ready to SWING\nAnd bring the hype type of freestyle rhyme for the crowd to sing\nSome say there's a party, but it looks like a job to Scrap\nI catch bodies with a nickel-plated rough rap\nMe and ?Slap?, we run together through the city\nThe nitty gritty, always together like titties\nBy any chance that I do get burnt\nYou better believe that I'm comin back, just like a tax return\n\n[Hook]\n\"Here comes Kane, Scoob, Scrap\"\nHere we go y'all! (6X)\n\"Here comes Kane, Scoob, Scrap\"\nHere we go!!\n\n[Verse Two: Scoob Lover]\nMove over to the side, let a slim brother wreck it\nIt's that Scoob Lover kid, so pull up a chair and CHECK IT\nWhen I get wild like Heathcliff, or Dennis the Menace\nIt's like food to a fat man, finished\nI bust your head like a apple (A APPLE)\nAnd pour the blood in a jar, tell your moms that it's Snapple\nAnd wait around my way for your crew, who's next\nCause I be lookin out my window with a nine like Malcolm X\nThere's no comp, they all got stomped so\nDream on.... dream away.... WELL OKAY!\nAnd play like Shante, and Have a Nice Day\nI drop rhymes that go boom (BOOM!)\nAnd I can get funky like a high school locker room\nDon't even think that I'm country country bamma\nScoob is hittin harder than a heavy heavy sledgehammer\nI rock songs to make your grandmother dance\nMy rhymes are more together than a girl in biker pants\nI'm never backed up, I never once had a fronter\nBoy I get more beeps than a roadrunner *beep-beep*\nI never sweat the girls when it comes to a phone call\nI got things sewn up tighter than a football\nSo skip to my loo or get stomped by my crew\nBrooklyn's in the house and ain't a damn thing new\n\n[Hook]\n\"Here comes Kane, Scoob, Scrap\"\nHere we go y'all! (6X)\n\"Here comes Kane, Scoob, Scrap\"\nHere we go!!\n\n[Verse Three: Big Daddy Kane]\nHere comes the Prince of Darkness ready to spark this\nAnd show the people just who is the hardest\nRuff and rugged, kind of similar to a nugget\nBut yet and still, I manage to keep the groove, smoove\nRebel for wreck them rappers I dissect them\nCause anything I say on the mic will affect them (HOW?)\nSo bad, they gotta run for shelter\nSo rappers take flight like they work for Delta\nThey know I ain't havin it, styles with no crab in it\nFakin and flakin it child, you're sadly mistakin\nCause who's a rapper here that Kane rip on the mic\nAnd start flowin *ZOOM* Yo yo yo, where you goin?\nThat's how they flee from me, the B, the I-G\nDamn man, you know my pedigree, huh\nThe gangsta, murdera, killa to ya\nFor sure endure to injure him or her\nThe breaker the taker money-maker never a faker\nMy lyrics are built like Schwarzaneggar\nSo all my competition gets destroyed\nYou need to put your weak rhymes on steroid\nFor you to ever to press up on the mightiest man\nTo rip a show and flow, provin that competition CAN'T GO\nBecause I do all, it's easy for you to fall\nI move all rappers like my name was U-Haul\n\n[Hook]\n\"Here comes Kane, Scoob, Scrap\"\nHere we go y'all! (6X)\n\"Here comes Kane, Scoob, Scrap\"\n\"and Mister Cee\"\n\n[Samples/Scratching]\n\"Well it's the Kane\"\n\"bring me on, and ah\"\n\"Scoob Lover\"\n\"bring me on, and ah\"\n\"Scrap Lover\"\n\"bring me on, and ah\"\n\"Here comes Kane, Scoob, Scrap Scrap Scrap\"\n\n\"Well it's the Kane\"\n\"bring me on, and ah\"\n\"Scoob Lover\"\n\"bring me on, and ah\"\n\"Scrap Lover\"\n\"bring me on, and ah\"\n\"Here comes Kane, Scoob, Scrap and Mister Cee\"", "image": "https://images.genius.com/b6cc17d62fd6810516cc285d9804a8ab.1000x1000x1.jpg", "year": "1993-05-25", "title": "Here Comes Kane, Scoob and Scrap", "album": "Looks Like a Job For..."}]}