{"songs": [{"title": "LL Cool Shay", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nI need lust\nIs that aight?\n\n[Verse: brandUn DeShay]\nYou looking at me like this guy looks familiar\nIf you don't remember from where, it's probably gonna kill you\nBut I'll give you a hint: I'm there when you sleep\nNot the Sandman, it's me, the man of your dreams\nSheesh, I think this is the house that love built\nFor two, I love you like cookies love milk\nEven if the milk spilled, I wouldn't shed a tear\nI'm a man, even better, I'm your man\nFor real, so baby, let's make a deal, let's set off like rockets\nAnd kick it, we can do something that's easy on my pockets\n\"How we gonna fun when he ain't got no funds?\"\nWell, I may not have ones, but change gonna come\nGet it? Like toll booths, I told you the truth, let's split\nI think I see your ex over there talking shit\nY'all been broke up, this ain't recent\nI want to talk man-to-man, but he on some zone defense\nHe making me laugh, this dude is bitch\nCan't let go of the past with that kung fu grip\n[?] I think we're about to finally get managed\nTelling me how she met Casey back in Los Angeles\n\"Didn't he tell you I'm the one with no panties?\"\nBoo, you know how many it be with no panties?\nPlease, but I do remember your eyes\nAnd I remember your thighs, it was December, that's right\nThen we jet off in the ride to my humble abode\nIt ain't take us no time to come out of them clothes\nShe wanted me to take it slow, I wanted her to take it off\nWe ended up doing both, now nobody gets a loss\nUsually, I want to hit it fast like speed bags\nBut for you, I'ma take it slow like relax\nSatisfaction, I have the right tactics\nAnd if you need them, I got crazy\nThere's more space in my room, it's galactic\nChiropractic, there is where all of the backs spent\nMy bedroom is my workplace\nMy dick hate to babysit, so I dropped the kids off at her place\nOr I drop my kids off at her face\nOh, oh I'm sorry, did I say that out loud?\nUh, we need to turn this music up louder\nSkeet on her like rain, now that's what I call a baby shower\n\n[Outro: brandUn DeShay]\nYeah, I'm sorry\nI need lust\nAnd let's keep it moving", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}