{"songs": [{"lyrics": "[Intro: The D.O.C.]\nAyo Dre, what's goin' on man? What's goin' on?\nAy what ch'y'all gon' do for this last record?\nNah tell me what ch'y'all gon' do?\nOkay, you want me to do the intro? Aight!\nParental discretion is advised for the moment\nWhile I'm getting candid, now understand it\nAin't too typical in any way, though the pro\nOn the mic is the D.O. to the C., this is an intro\nI know The D.O.C. makes you want to take a Valium\nSo buy a bucket cause upcoming is my album\nAnd for the record, meaning my record, check it\nListen to the single and you'll be like, yo, I gotta get it\nBut in the meantime, listen to the rhyme\nOf the Dr. Dre played with N.W.A\nYella's on the drum roll, rocking the beat\nAyo Dre, where's you gonna take this ---- man?\n\n[Verse 1: Dr. Dre (The D.O.C)]\nAyo, let's take it to the street (word up!)\nLet 'em understand perfection\nLet knowledge be the tool for suckers to stop guessing\nCause I don't give a damn about a radio play\nObserve the English I display\nLyrics for the adults, children have been barred\nAnd scarred from listening to something so [censored] hard\nDope, pumping that's so my rhymes will never falter\nYo it's Dre, forget the \"Mind of Minolta\"\nPsycho like no other dumb brother\nSo step to me wrong, G-O for what you N-O\nBut be warned, never will I leave like a regular\nCause I'm a little better than the regular competitor\nI use to see 'em on stage\nEarning money like a thief, but without a gauge\nUntil I got full, of clocking the lame getting pull\n(They said you wasn't gon' get paid)\nNah that's bull, yo, they like it stylistic\nAnd I enchant the crowd like I'm a mystic\n(C-C-C-C) C-C-C-cameras are flashing when I'm in action\nA photo, or fresh with a flair for fashion\nPure simplicity, see, it's elementary\nYou hear one of the hardest young brothers this century\nTry to comprise a word to the wise and the guys\nParental discretion is advised\n\n[Verse 2: MC Ren]\nRen is most extremely high performance\nThe black hat cause I worn this, cause it's like enormous\nSome trash I don't take it, not even in a toilet\nAnd trash from a sucker, put in a pot and I'll boil it\nTurn up the pilot as it burns\nAnd maybe the stupid suckers'll learn\nI'm not a sub, cause I speak sensible\nNot considered a prince, 'cause I'm a principal\nI'm engineering the funky sound that you're hearing\n'Cause when it comes to power, I'm power steering\nSilly you say, I say you're silly when you say it\nRushing to the eject, to put my tape in and play it\nIt's like Apollo, but I'm not an amateur\nAnd I really don't care while I'm damaging ya\nIt's for the record, yo, so my lyrics is gonna spin it\nAnd if there was a trophy involved, I'd win it\nPossession is mine and I'm the holder\nCause a brother like Ren don't really care cause I'm older\nSo for you to step off would be wise\nAnd say forget it, parental discretion is advised\n\n[Verse 3: Ice Cube]\nI be what is known as a bandit\nYou gotta hand it to me when you truly understand it\nCause if you fail to see, read it in braille\nIt'll still be funky, so what's next is the flex\nOf a genius, my rapid-stutter-stepping if you seen this\nDope, you hope that I don't really mean this\nBut if play made a greater high-top fade\nIt's not my trademark when I get loose in the dark\nYou guess it was a test of a different style\nIt's just another dope brother on the pile\nDriving around with the flow of the tongue\nYou hung yourself shortly after knowledge was brung\nTo your attention, by the hardest rapping artist\nThat is known for lynching any sucker in a minute\nStagger 'em all\nWhen I start flowing like Niagara Falls\nIce Cube is equipped to rip it up in a battle\nMove like a snake when I'm mad; and then my tail rattle\nI get low on the flow so let your kids know\nWhen I bust, parental discretion is a must\n\n[Verse 4: Eazy-E]\nLittle did they know, that I would be arriving\nAnd it's surprising, rocking it from where I been\nBut it's the E here to take, no mistake to be made\nIn the trade where funky dope records are being played\nDamn the regular, yo as I get better the\nGirls wanna trick and go stupid up on the tip\nSo I get 'em hot, thinking they're gonna get it\nAs they sit, rubbing their legs like a cricket\nTo you it may be funny, but\nThere's no service of beef without money\nSo slip the C-note, and you can choke\nOn a wing-ding-ding-a-ling down your throat\nForeplay to me ain't it\nWhen you spread 'em I'm ready, then you can get a hit\nFrom the Eaze, if you can deal with the size, but if you can't\nParental discretion's advised!", "album": "Straight Outta Compton (Clean)", "year": "1988-08-08", "title": "Parental Discretion Iz Advised (Edited)", "image": "https://images.genius.com/cf6cbda0b09812dba8e939e35431c042.1000x1000x1.jpg"}], "artist": "N.W.A"}