{"artist": "Yung Bans", "songs": [{"album": "MISUNDERSTOOD", "image": "https://images.genius.com/96f7e4381a7e85c9840d3d332b3496f5.1000x1000x1.png", "year": "2019-07-24", "lyrics": "[Intro: Yung Bans & Future]\nI think I turned by brother to a junkie\nSippin' on red\nHe rich and he got money\nWalk around like a zombie\nYoung nigga, can't get this\nSippin' on red\n\n[Chorus: Yung Bans & Future]\nI'm sippin' on red dead, 'til I'm on my deathbed\nDo I pop these meds? Yeah\nThink I got a drug fetish (Think I got a drug fetish)\nI think I got a drug fetish, yeah\nRoxy, then I'm on 'em heavy\nIt ain't nothin' my mama can tell me (It ain't nothin' my mama can tell me)\nShe said, \"Lil' nigga don't block out, really\" (I'm geeked up)\nHow many milligrams you on right now? Like 60\nPercs gon' fill my void when I feel empty\n\n[Verse 1: Yung Bans & Future]\nGiddy-up, giddy-up\nNigga run 'round, caught with the nina, got a heater\nShe suckin' my dick with her hand on my heater (Yeah), nina\nPussy wet, hurricane Katrina, Katrina (I hear voices in my head)\nYou niggas lil' boys, you niggas got V-Bucks, V-Bucks\nPop me a Perc' and I float, turn to a dreamer\nBalenciaga shawty, I don't rock no damn Marina (This life is crazy, crazy)\nI think i'm getting nauseous, oh my, mama mia\nSo high in the sky, told my shorty I couldn't reach him (Mama mia)\nSippin' that lean, I'm sleepin'\nYoung nigga sip that lean 'til I'm sleepin'\nYou know I'm sleepin'\nYoung nigga sip that lean 'til I'm sleepin'\nSleepin', young nigga sip that lean 'til I'm sleepin'\nI turn to a demon, nigga push up...\n\n[Chorus: Yung Bans & Future]\nI'm sippin' on red dead, 'til I'm on my deathbed\nDo I pop these meds? Yeah\nThink I got a drug fetish (I'm all the way up)\nI think I got a drug fetish, yeah\nRoxy, then I'm on 'em heavy (I got habits, ain't goin' away)\nIt ain't nothin' my mama can tell me (I got habits, ain't goin' away)\nShe said, \"Lil' nigga don't block out, really\"\nHow many milligrams you on right now? Like 60\nPercs gon' fill my void when I feel empty\n\n[Verse 2: Slim Santana]\nI mix that purple with that red, I'm sippin' red dead\nBenji shoe, the type not laced\nI mix the perc' with Oxy', got me feeling like the prez' (Let's go)\nI ain't no emo kid, I ain't gon' act like I'm depressed\nBalenciaga on my drawers, nigga I'm a mess\nDon't come 'round me recording, I'ma think that you the feds\nThirteen hundred for the pint, yeah, expensive meds\nWhen I was hittin' stains, I was up, couldn't get no rest\nAll this pain inside me, got me feelin' like Derez\n1OF1 the gang, yeah, we different from the rest\nGotta watch your move, it ain't checkers, yeah, it's chess\nFree my brother Trap, I know you bangin' on the set (Set, set)\n\n[Chorus: Yung Bans & Future]\nI'm sippin' on red dead, 'til I'm on my deathbed\nDo I pop these meds? Yeah\nThink I got a drug fetish\nI think I got a drug fetish, yeah\nRoxy, then I'm on 'em heavy\nIt ain't nothin' my mama can tell me\nShe said, \"Lil' nigga don't block out, really\"\nHow many milligrams you on right now? Like 60\nPercs gon' fill my void when I feel empty", "title": "Red Dead"}]}