{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "Never Had Nothing", "album": "Birdman", "lyrics": "[Mannie Fresh Talking]\nYo, This Fresh (echoes)\nFor you (echoes)\nBout to Freak, The Run D-M-C beat, Ya hoids?\nHolla!\n\n[Hook]\nI ain't never had nothin (oh yeah), I'm tryna get somethin (believe that there)\nAnd where they slang them thangs at, where yo ass duckin? (where you at nigga)\nI ain't never had nothin (smell me bitch), I'm tryna get somethin\nWith them people on my back (holla nigga, nigga) but I gotta keep duckin\n(Mannie Freezy!)\nI ain't never had nothin, I'm tryna get somethin (let's, get feezy)\nAnd where they slang them thangs at, where yo ass duckin?\n(Suga Slim never love me like stone me boy motherfucker)\nI ain't never had nothin, I'm tryna get somethin\nWith them people on my back but I gotta keep duckin\n\n[Verse 1]\nI started from a rock, then move to a chip\nNowadays I'm the Birdman bitch\nI ain't never had nothin that share the same dish\nWe jumped off, we share the same clip\nWe share the same clothes, whole block wore out shit\nGhetto fab, that ghetto shit\nIt's that, ghetto map with ghetto tip\nYou never touch nothin that belong for you slick\nWe never had nothin so we run for this shit\nBreakin-in houses and sellin these bricks, and these\nPublic houses, it's goverment bullshit\nFour and a half tryna cut well for our shit\nThey tearin down our project(gun pops)bust-yo-clips\nLook in ya eyes, see nothin but bitch, when you\nLook in my eyes, see these hardlife shit\nWe ain't never had nothin, I don't stunt till I die bitch!\n\n[Hook]\nI ain't never had nothin, I'm tryna get somethin\nAnd where they slang them thangs at, where yo ass duckin?\nI ain't never had nothin, I'm tryna get somethin\nWith them people on my back (aye, aye, aye, aye) but I gotta keep duckin\nI ain't never had nothin (alright), I'm tryna get somethin (beyotch!)\nAnd where they sell them thangs at (oh yeah), where yo ass duckin?\n(Holla atcha boy nigga!)\nI ain't never had nothin, I'm tryna get somethin\nWith my people on my back but I gotta keep duckin\n(Birdcall motherfucker!)\n\n[Verse 2]\nNigga, we had tore down nights\nMe and my brother had tore down bikes\nJust his tore down life, nigga smoke and fight\nChoke the pipe, youngstas bust for stripe\nAin't got new jewels, ain't got no life\nNigga, caught the blues when his part called lights\nSee I, been in yo shoes, lost memos on crews\nAnd I, paid my deuce from scramblin blues\nAnd I, laid my rules from cookin these fools\nAnd these, fucked up time in seventy-two's\nAnd I, learned to grind in eighty-two's\nAnd I, learned to shine in ninety-two's\nAnd I (gun pops), bust my nine in twenty-o-two\nNow tell me what the fuck I'm suppose to do\nI'mma ball like a dogg, so nigga fuck you!\nYou ever crossed my line, you know what I'mma do bitch\n\n[Hook]\nI ain't never had nothin, I'm tryna get somethin\nAnd where they slang them thangs at, where yo ass duckin?\nI ain't never had nothin, I'm tryna get somethin\nWith them people on my back but I gotta keep duckin\nI ain't never had nothin (oh yeah), I'm tryna get somethin (beyotch!)\nAnd where they slang them thangs at(holla atcha boy), where yo ass duckin?\n(ha, it's our world baby, promise sucka)\nI ain't never had nothin, I'm tryna get somethin\nWith them people on my back but I gotta keep duckin\n(aye, aye)\n\n[Verse 3]\nWe walk up to bread, no meat, marinade (Fuck!)\nThe whole block share a dozen our eggs\nThe whole hood had one nigga was craze\nMom smoked that shit she had to pay\nOld folks know lil' one was bust his hage\nHeroin, coke, and dope fuck with his head\nBout to flip the script come out today\nWild Tato, C-To, ball today\nHot cake see a fresh know how to play\nOther side had my homie had to lay\nBig Chief, real from the concrete streets\nNigga was on the labor and wanted to eat\nShit-a-never get better, love is merry\nTall house, survive and duck the inneries\nNice cars, clothes, pussy ho, money and fame\nEvery motherfucker in here know my name\nI was born then live y'all niggas (believe that bitch!) banned in\nThat's why I stunt so fuckin much\n\n[Hook]\nI ain't never had nothin, I'm tryna get somethin\nAnd where they slang them thangs at, where yo ass duckin?\nI ain't never had nothin, I'm tryna get somethin\nWith them people on my back but I gotta keep duckin\nI ain't never had nothin, I'm tryna get somethin\nAnd where they slang them thangs at, where yo ass duckin?\nI ain't never had nothin, I'm tryna get somethin\nWith them people on my back but I gotta keep duckin\n\n[Mannie Fresh Talking]\nThis Fresh (echoes)\nFor you (echoes)\n\n[Man Talking]\nYo this the real Magnolia, worldwide ya heard me?\nI'm just chillin up in the studio with Mannie Fresh and the Birdman\nYo we goin out, ya heard me, with this great hit\nYo, I'm chillin with Seed and Stone, Bizzy\nI'm thinkin about my boy Towe too\nBut Big G, R.I.P. man, we love you (echoes)\n*beat fades*"}], "artist": "Birdman"}