{"songs": [{"year": null, "title": "Let Me Run", "image": "https://images.genius.com/97e5f72432c5b33084c28f136249f9b1.442x442x1.png", "lyrics": "[Hook: Corbett & Saigon]\n\nDon't let me be, just another one\nI always told myself, I'll be here when it's done\nI know they don't believe, but see we just begun\nMomma I'm growin up, you gotta let me run\n(Gotta let me run, gotta let me run) Let me run\n(Gotta let me run, gotta let me run) Let me run\n(Gotta let me run, gotta let me run) Hey\nMomma I'm growin up, you gotta let me run\n\n[Verse 1: Saigon]\nI don't know but I gotta go, Gotta go slow, but I gotta go cause I gotta grow\nThe flow got a nigga fall but I gotta show that I got a lot mo' to go\nI gotta blow\nI won't take no, I don't think so\nHold on strong and no I won't let go\nI'm almost there, I know I won't take long\nI look in the rear and it's a long way home\nDon't let me be, just another one\nMomma I'm growin up, run that to your younger son\nI'm the one when it's all said and done\nLet it run to get a gun, the one that'll blow one\nThe one with the cold stare, niggas wanna go there\nAnd oh yeah I don't fear no one\nRight now Twista-like style\nQuick to pipe down when usually I fight back\nNow I'm lookin' like wow\nI came to learn that my main concern's gripping the mic down\nWow, album number two, how comfortable, last one was for you\nThis one is for you and for frontin' niggas too\nComin' for you, now what you gonna do?\n\n[Hook]\n\n[Verse 2: Saigon]\nRun away with the moonlight\nThird eye too bright for me to lose sight\nAnd I'm only fuckin' with niggas that move right\nCan't rock with a man pants too tight\nYou belong in the blue light district\nThis prick take \"ho nigga\" to new height\nYou in the strip club you might\nSee a nigga throwing bread, no food fight, right\nGot a style like Ike\nThe beat is my bitch, I'm wild for the night\nSoup's upside your head when I spit it\nAnother DV tell the Feds I did it\nGet on TV with a Red Sox fitted\nBet I won't go near Bed-Stuy with it\nYou know I'm just kiddin, Earth is our turf\nI'm the person to say that first in my verse\nDon't let me be, just another one\nJust a statistic when I'm havin so much fun\nI'm in the boom-boom room with a poon-poon\nLips smellin like perfume, wanna resume soon\nPut your money where your mouth is\nBet you find your honey where my house is\n\n[Hook]\n\n[Verse 3: Saigon]\nI don't know what I'm runnin' from\nI don't know where I'm runnin' to\nSeems your dreams are not comin' true\nWhat the fuck are you gonna do?\nStop it now? How dumb are you?\nHow many lumps you want, one or two?\nYour future's right there in front of you\nWhatever you do with it is up to you\nNot for nothin' but who the fuck are you?\nLot of other people are fucked up too\nYou ain't the only one who luck's up, boo\nLife's a bitch, but you could fuck her too\nLike I said mami, it's up to you\nWe don't do L's. W's\nI'm not comfortable with number two\nBut it's up to you, it's up to you\n\n[Hook]", "album": "The Greatest Story Never Told 2: Bread And Circuses"}], "artist": "Saigon"}