{"songs": [{"image": "https://images.genius.com/ef31a268bb15ee7d732e1034b6ea51d2.500x500x1.jpg", "album": "Generation Gaming XVIII", "title": "Creative Destruction", "lyrics": "[Intro]\nWa-ba-da-ba-ba-bow\nFamiliar melody?\nWa-ba-da-ba-ba-bow\nI wonder what this song's not about\nAy, look\n\n[Verse 1]\nHere's a type of game that you've never ever heard of\nAn island with a hundred people on it from an airdrop\nFighting each other inside an ever shrinking safe zone\nWhile paying through the nose for some wacky custom made clothes\nI can't always keep every track tailored for the fanboys\nWow, have you seen how well this game plays on Android and iOS?\nWe're saturated with these type of battle games\nIt's as if the industry's incarcerated, shackled, chained\nAnd that's a shame, 'cause in between the shovelware\nThere could be fairly passable games, is this one?\nI couldn't care less\nIt's yet another game I haven't rapped about\nSo let me grab a pen and pad and we can crack one out\nLock and load, I'm ready\nCocky, hopping over hedges\nWatch me no-scope in a moment\nI'll be popping open treasure boxes\nCollecting lots of loot and tat, I'm just like Stuart Ashen\nTrendsetter with a newer hat on, pure fashion master\nCan't take too much action, I'm super anxious\nSo I'll camp out in the background like a damn scout\nAnd shoot the passers by\nMy only plan: survive until I'm the last alive\nThen head straight back to the sky like I'm a satellite\n\n[Hook]\n(I've been paid up front) To make introductions\n(Another battle royale game) Straight from production\n(Apparently, this one's called) Creative Destruction\n(Like the rock formed from) Volcano eruptions\n(I've been paid up front) To make introductions\n(Another battle royale game) Straight from production\n(Apparently, this one's called) Creative Destruction\nI made the lyrics up, it never came with instructions\n\n[Verse 2]\nWhat is this thing, anyway? Some kind of blimp taxi?\nIt's definitely not a school bus, it's pretty pimp, actually\nSee? Originality\nAbsolutely avant-garde\nThat's at least one feature PUBG just hasn't got\nRight, let's investigate somewhere we've never been before\nSo set the thing to north, we're heading to the ski resort\nHang on, this area feels eerily familiar\nAre you definitely sure we really haven't been here?\nK, I'll take your word for it\nI mean, I've never heard of it\nSo presumably, it's new IP and free, no need to purchase it\nA hundred players and my aim's to be the first to get to victory\nAnd if it means I need to do some dirty tricks\nFine, I'm about to do some damage, I'm absolutely savage\nMad as when the cabin crew managed to lose my baggage\nI'm university challenge, you're universally challenged\nI do prefer to be telling the truth than hurtfully selling a spoof\nLike, \"how on Earth is he talented?\"\nBank balance permanently swelling like a purple bellend, man\nI'm telling you, cross Fortnite and Fortnite and what do you get?\nHere's the hook again, just in case you haven't got it yet\n\n[Hook]\n(I've been paid up front) To make introductions\n(Another battle royale game) Straight from production\n(Apparently, this one's called) Creative Destruction\n(Like the rock formed from) Volcano eruptions\n(I've been paid up front) To make introductions\n(Another battle royale game) Straight from production\n(Apparently, this one's called) Creative Destruction\nI made the lyrics up, it never came with instructions\n\n[Outro]\nGame devs\nGet in touch\nI'll talk about your game\nAnd make it seem okay\nNot great, but okay", "year": "2018-11-03"}], "artist": "Dan Bull"}