{"artist": "Capital STEEZ", "songs": [{"title": "Emotionless Thoughts", "album": "The Secc$ Tape", "year": "2012-01-01", "image": "https://images.genius.com/904faf700b61fab6ffe1bd0314bb704e.350x350x1.jpg", "lyrics": "[Intro]\n(I fall in love, too fast)\n\n[Verse 1]\nThis goes for Mrs. Whats-Her-Name\nI know that something changed before the money came\nBut you got real Shady, Aftermath\nI was passed reminiscing over our past\nClaim you don't remember it\nBut went and told your friends in the most intimate details\nNow you wanna censor shit\nTrying to fix the bits and pieces of what's left of it\nBut even when it's fixed, it's so delicate\nTrue love is so hard to find\nAnd they say that once you found it you lost your mind\nEven some of my niggas done grew apart with time\nTruthfully I needed the space, you're far too kind\nI guess I gotta let it be\nBagir said I gotta big year ahead of me\nJack told me that world will see eventually\nEven my worse enemy is praying for the best for me\nDreams money could buy\nWhen you fall in love and realize your love was a lie\nAnd I guess that it was lust that flooded my eyes\nSlim waist, thick cake, lovable thighs\nI put that on the name of king\nI'm a first class nigga, coach told \"you ain't make the team\"\nFuck chasing cheese\nHomie, I'm chasing dreams\nAnd fans make up for the rest like Maybelline\n\n[Verse 2]\nAnd I'm the bad guy yet again\nSpend so much time tryna to find who the victim is\nAnd if we put it in the eyes of the witnesses\nI still get the blame for fuckin' up in the beginning, shit\nYou told me you was over that, grow up\nAnd you say you saw us holding hands, so what?\nIf you can't look me in my eyes and respect me enough\nThen I guess you getting left in the dust\nWith no feedback\nHaving late night conversations\nContemplating, both knowing that my time is wasted\nMood swings all time of the day\nWith childish behavior admit that I was kind of complacent\nAnd knowing this could be the end of it\nThree months and she still ain't send a hint\nNow she fucking with the next nigga claiming it's her friend and shit\nYou really take me for that much of a fool huh?\nI had bitches on hold for a long time\nTo hear the perfect reason to just give them the walk sign\nSo you could talk yo shit, I'mma talk mine\nAnd hit me when you finish cause this is the fourth time\nI've crossed your line when you crossed mine\nYou crossed my mind I'm just looking at lost time\nI can't stress it no harder than this\nAnd I forgot to tell you, karma's a bitch\nHigh school girl be acting all retarded and shit\nIgnoring my shit, I know you see me calling you, Miss\nAnd if I called you a bitch, it must've slipped out\nI got caught in the midst, and then you flipped out\nWhitney hit the rock hard enough and stop getting loud and James is in a grave\nSo I'ma have to pull a Chrissy brown\nI'ma laugh when they Rihanna yo ass\nBecause you love it when you binded and gagged right?\nRemember that time in the bathroom?\nI left it on your lower back like a tattoo\nI'm just letting off mad fumes\nAnd I'ma have to fill the shoes of this bad dude\n\n[Outro: Capital STEEZ and Samples]\n\nBeats for days\nBeats for days\nBeats for days\nBeats for days\n\nJOEY! WAKE THE FUCK UP NIGGER!\n\nBe Safe\n\n\"I think its just such a magical process, you know? Like how when\nYou’re just putting these notes together, you know, and how its just\nCertain combination of notes just really means something, sometimes\nAnd…and, uh, sometimes you get lucky and just come across a few\nNotes that just really work well together. And its just a magical\nMoment, you know, as you’re discovering…\"\n\n[Piano begins]\n\n\"Marijuana Strains For Every Taste!\nSnow White, Super Girl, Afghan Dreams, New York Diesel\nMedical Marijuana equals Life. My Life\nYou smoke something like this, its just gonna lay you on the couch\nAnd you really won’t be able to work for the rest of the day\"\n\nGetting high. Real high. Mmmmh. Lovely and Yummy and Mmmmh\nStay Tuned"}]}