{"songs": [{"year": "2014-11-11", "lyrics": "[Verse 1]\nSeen a nigga talkin' bout me like a dog\nI seen a nigga change up, ask a nigga for a song\nI done seen a bitch cry\nTwo months later she on all my D\nI see KK nigga, my homie got a 30 shot Glock\nHeard she a bitch that love to get cock\nAll that lumpin' and bumpin', you know the bitch hot\nI made it cool to be a fat boy\nI'm on your bitch like a frat boy\nFuckin' whats yours, cigarillo guts hit the floor\nFor lousy, Kill for that noise\nStroke right, all night, plumber with the long pipe\nHundred band juug on my HP\nYou should see what one click takes me\nWorldwide web I'm boomin' worldwide\nWhen she saw the boomin' caught your girls eye\nGet you a slice of this humble pie\nMade from the fruit of my loins, and my fruit of my loom\nGet no fuck wit'\nProbably cause you stay on fuck shit\nI be high on my drunk shit, all of the functions\nOn a bitch that can barely function\nI love this life I live, I came from a triflin' lil city\nIn a city I never been to, and they fuckin' with me\nCause the \"Cha Cha\" frenzy\nYeah thats wavy\n\n[Hook]\nRide the wave, the wave\nI don't ask for features, I get asked for em\nNiggas mad, postin' raps up on these forums\nSay I'm Hollywood, I'm actin' foreign\nI should make the next nigga feel out of form\nAs far as love, I never had none for him\n\n[Verse 2]\nCause I was puttin' in work while them hoes was snorin'\nI was puttin' in work while you bitches snorin', yeah yeah\nKick in the shit with my good shoes on\nRun in the town, my ass sat down, I'm a kingpin\nThese things that are said about me, are truthful\nEvery word I do mean, school these malnourished souls\nTil they're barely hot, years, they volunteers\nWitness how jelly rock\nToo hot to handle like a pot from the bottom\nI was deprived of nothing, still had to start from the bottom\nAin't it something how I used music to channel my problems\nLike a [?] cable remote with no [?] to quote\nAnd I'm the latest to post, like a slow ass sinna\nBut when you pass me that rock, I bet that shit goes inward\nC-notes and benji's\nBenihanas for dinners, sexy mamis for quickes\nSlangin' wood with no splinters\nWe wolves plus winners\nWe out here building this wave, you wanna ride but you cain't\nWe out the building, its wavy\n\n[Hook]\nI don't ask for features, I get asked for em\nNiggas mad, postin' raps up on these forums\nSay I'm Hollywood, I'm actin' foreign\nI should make the next nigga feel out of form\nAs far as love, I never had none for him\nCause I knew they never had none for me\nCause niggas sleepin', I was workin'\nYeah yeah run this\n\n[Interlude]\nShoutout to [?], we finna kill this shit\n\nGet the fuck up off my back about these bars and shit man\nFuck that shit, uh alright\n\n[Verse 3]\nNigga don't get it twisted\nUnless its weed in the blunt lemme hit it\nWhile I'm screamin' fuck rap to you niggas\nI'm passed finished with you\nBlack and mild smokin', reggie chokin'\nGotta be jokin' think you fuckin' with D.R.A.M\nI'm napalm from Vietnam, dropping bombs for the dope\nI send (?) they had no clue I had flow\nBut I'm cool with that tho\nI used to tag the toes of dudes with no soul\nWhile they shoes was still on, is that so?\nSo the fuck what?\nThese numb nuts ain't worth the attention\nWho want a feature cause I'm working and winning\nOh yeah I get it, it's no (?) help with your vision\nSo how you so ready to work if you not ready for spending\nI need c-notes and Benzes\nThis Benihana delicious\nI got your bitch in my (?)\nYou should pay way more attention\nThink I hit my top speed but I'm just revving my engine\nFuck (?) came to me, bitch I (?) to go get it, nigga\nAnd this me having bars shit\n\n[Verse 4]\nUh, uh, uh, uh, DRAM man\nSomebody said I wasn't there yet\nWell nigga where the fuck am I at?\n(?)\nNiggas act like I ain't the man\nRejecting the same jam that turn they ass to McMahon\nSo fall back with these preconceived notions like\nYeah I think you stupid\nI just feel he needs focus\nLike I read with bifocals\nNigga I be going postal like mailman when the dog is loose\nSoon as you pass the gate they try to bite and bark at you\nOvercame obstacles\nTriple at the ones that rhyme like Doctor Suess\nLeft these niggas hanging dead without a noose\nThey (?)\nTruth be told I knew I had the it factor since two years old\nWhile all these commentating, sidelining, quick riding, dick pirating\nSail the ocean blue to get screwed and your bitch like it\nPlay this shit on Sunday, play the dick on Monday\nWax on, she snap the pussy back and make it one way\n\n[Interlude 2]\nMotherfucker don't you ever get it fucked up bruh, it's DRAM nigga. I'm here, I'm not going nowhere, not gonna get me the fuck out of here bruh. All this time I done got damn, what? Shit?\n\n[Verse 5]\nPlay this shit on Sunday, play the dick on Monday\nWax on, she snap the pussy back and make it one way\nWith the (?) like a cold cut, so what?\n2014 model, I don't give no fucks\nNo fucks given, I'm dripping and drive you crazy\nI'm saying I'm fucking dope, I'm a product of 1980's\n'88 to be exact, dread headed, kinda fat\nSturdy nigga, nerdy nigga, how can y'all compete with that?\nSteady nigga flow is working hard to bring the reaper back\nCutting niggas racks as they be asking how we (?) with that\nRare, rare, very rare\nEverybody well aware\nThat I've been such an underdog I got all these pussies scared\nThat I done made the greatest album on some Biggie shit\nAnd I'ma own up to that, maybe just a little bit\nNigga feel like dipping molly, prolly just a little hit\n25 years ago I used to look so innocent\n25 years later still ain't seen a prison yet\n1 year after that, I'm the greatest artist living bitch\n\n[Interlude 3]\nI own up to that statement bruh, come on man, don't do that bruh, like don't do that. All this motherfucking I've been putting in man. Shit ain't never gonna stop, one year after that I'm the greatest\n\n[Verse 6]\nPicasso couldn't paid this picture better\n(?) in my system plus a (?) cigarello, white widow\nI inhale like Whitney, I exhale like Whitney\nAnd RIP to Whitney but y'all must be on that Whitney\nIf you think you can get with me\nI am liquor to your kidneys\nI am cancer from them ciggies\nI am death, I have just been digging these holes beyond\nNiggas hoes with no flows at all\nMy rapid mic strike take flight, that's the protocol\nCalling all true rhyme sayers to the chopping block\nCutting off this (?), everybody get chopped\nAnybody doubt me then that anybody smoking rock\nPitiful or (?) probably sell they mama's clothes to cop\n30 thou to open up shop, nigga no you're not\nI'm taking shit down, snatch your crowns over (?) spots\nThrow the records out cause you're tired I done wrote the dope\nCassius Clay serving pope, presidential solid hope\n\n[Outro]\nMotherfucker, it's DRAM nigga. Does Real Ass Music, nigga don't do that bruh. Don't take me from this bruh, it's my life bruh. Every day I wake up and think about this man. Fuck out of here, half the city a product of that, VA, 2 up, 2 down", "title": "#1EPICRANT (Ode To The Struggle Rappers)", "album": "#1EpicSummer", "image": "https://images.genius.com/e6707cbe88b21207d4fedad203379cc7.500x500x1.jpg"}], "artist": "DRAM"}