{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f5e81e5d5f74cbb217e8988eb2ac58e7.400x400x1.jpg", "title": "Bad Day/Worst Day", "year": null, "album": "The Killer", "lyrics": "[Killer Mike]\nCRIP - true blue to it\nBLOOD - Piru to it\nGangsta music, is to drug abusin\nDon't confuse it with C. Delores Tucker\nFUCK her, and Bill O'Reilly\nAnd Reverend what's-his-name, FUCK his name\nKobe the best player ever, wit NO game\nFell for the trick of that white bitch, so lame\nHow lame? Lame as the new host of Soul Train\nSheeit, lame as the old host of Soul Train\nI do gangsta music, FUCK Soul Train!\nAll blacks got is BET\nPardon me, that shit's owned by MTV\nBlacks ain't got shit, it's still 1-9-6-6\nCause you can buy a car ain't shit\nJordan cain't buy a team, and that nigga got six rings\nCot'picker, see what I mean?\nQ-Tip's singin, Dre 3000 actin\nGod-damn, niggas too good, for this rappin\nI'm just askin, what the fuck happened?\nI'm just askin, nigga what the fuck happened?!\nWe went from \"too black to too skrong\"\nTo Sisqo and the God-damn \"Thong Song\"\nWe went from Farrakhan to Don Juan\nDon Juan keep it pimpin man\nBut I'm just sayin Farrakhan got business man\nPlus he speak positive on that knowledge shit\nNo matter how much my auntie holla\nI'd NEVER give a dollar, to the good doctor - Reverend Creflo Dollar\nFuck dat! Befo' I do dat\nI'd join Mason Betha's church and quit rap\nI'd hang out with Murder INC. and sing 50 Cent raps\n50 Cent raps; I'd rather let Eminem call me 50 niggas\nThan break bread wit a rich nigga readin scripture\nBy the way, if you're Aryan Nation - FUCK Hitler, FUCK Hitler!\nThat's to let ya know I didn't forget ya\nLet me make ya bad day a worst day\nMe and Hitler got the same damn birthday\nThat cracker dead, that's my God-damn birthday\nGo shorty, go shorty\nFUCK a protest, I got a Glock 40\nUnlike these bougie niggas, I ain't braggin\nFUCK killin blacks, I'm down for toe taggin Grand Dragon, Grand Dragon"}]}