{"songs": [{"image": "https://images.genius.com/859f21e88f70d1ad36d049e5cd7f2f90.750x750x1.png", "title": "Hussle in the House", "album": "Bullets Ain’t Got No Name Vol. 2", "year": "2008-12-04", "lyrics": "[Verse One]\nLook, I'm comin straight off of Slauson\nA crazy motherfucker named Nipsey\nI'm turnt up cause I grew up in the 60s\nCaution to you rap niggas try and diss me\nI go hard that's why yo' bitch wanna flip me\nBig guns nigga, turn rivals into rosaries\nExtended clips I give a fuck who you 'posed to be\nStraight off the block I sold dope to buy groceries\nNow it's rap money no advance it's all royalties\nYou broke nigga you could follow me\nIt's fuck bitches get money keep some hollow heads logically\nAnd I'm from where homicide boost the economy\nPay taxes to these corners and put in work it's a policy\n(*Hustle) It's white chalk on the corners\nIt's yellow tape on the gate, choppers up above\nThat's Cuz and Tiny Loc's runs the streets where I'm from\n\n[Chorus]\nThis is just a small introduction to this Nipsey Hussle music\nGuns money and bitches that's the way that we do it\nFirst get 'yo grind on, then get yo' shine on\nWe come through daytime with the lights on\nNow hit the fast lane, and let yo' chain swang\nYou gettin dollars like a doctor but you gangbang\nYeah! It's Hussle in the house\nYeah! It's Hussle in the house\n\n[Verse Two]\nBlue rag, S-hat, gold on my neck fat\nGuns case catch that, this neighborhood, I rep that\nShoot first, ask last, move work, fast cash\nBrynhurst, 10th ave, squabble if you get mad\nAnd in my lifetime, I seen a lot of death\nA couple cold nights, it look like it was nothin left\nBut God got me, so I got him tatted on my flesh\nSlauson - nigga, you ain't heard shit yet\nCuzzy, Cobby, Hoodsta Rob, Tiny Draws\nInfant Stone, when he come home - then baby, we dog\nAnd can't forget my big brother Black Sam\nJust a young good nigga wit a million dollar plan\n\n[Chorus]\nThis is just a small introduction to this Nipsey Hussle music\nGuns money and bitches that's the way that we do it\nFirst get 'yo grind on, then get yo' shine on\nWe come through daytime with the lights on\nNow hit the fast lane, and let yo' chain swang\nYou gettin dollars like a doctor but you gangbang\nYeah! It's Hussle in the house\nYeah! It's Hussle in the house\n\n[Verse Three]\nI came from nothin - so did every other rapper\nSave the spectulation, real banger, gun clapper\nSILENCE! - any, hit the opposition with the Mac\nI'll turn him into candle on the curb over blood splat\nFuck Rest in Peace shirts, nigga where ya guns at?\nIt done been two weeks and we ain't seen no get back\nType of shit is that, yo Crippin is wack\nYou ain't poppin you ain't turnt up, nigga, you off that\nI promise, I'll be out lurking with the pump\nGooned up, black hoody on, chopper in the trunk\nReady to hop out, and do my muh'fuckin stuff\nSIX-OH, NIGGA, dats wassup, HUH!\n\n[Chorus]\nThis is just a small introduction to this Nipsey Hussle music\nGuns money and bitches that's the way that we do it\nFirst get 'yo grind on, then get yo' shine on\nWe come through daytime with the lights on\nNow hit the fast lane, and let yo' chain swang\nYou gettin dollars like a doctor but you gangbang\nYeah! It's Hussle in the house\nYeah! It's Hussle in the house"}], "artist": "Nipsey Hussle"}