{"songs": [{"album": "If Heaven Was a Mile Away (A Tribute to J Dilla)", "image": "https://images.genius.com/9312bcdc87acaf69bf4807d06a1292f3.500x500x1.jpg", "year": null, "title": "Say It (Remix)", "lyrics": "{\"Say it\"}\n\n[Joell Ortiz]\nYou say it you did it, you didn't then they did it to you\nYou couldn't wake up and hustle, you had to get approval\nAnd become a big dog but stay a little poodle\nHatin like, \"That's word to my mother, I knew that nigga boo-boo\"\nTake a look at this game y'all, this shit is doo-doo\nNiggas say what they don't do, smoke what they don't know\nIt's a circus not a zoo, they say they walk where they don't go\nAsk about them in they hood nobody knows who they are\nCause all they did was play they window and steady our\nWay of life and write it on they paper nice\nSo you could lie and say you played the strip late at night\nBut I'd know when I had to hit the ave I used to take your bike\nYou was always that lil' dude that the neighbors like\nYour face move, you ain't never been in a razor fight\nSo when you say what you did make sure you say it right\nCause I ain't gon' only break your jaw, I'mma break your mic\n\n[Termanology]\nI pledge allegiance to beatin the shit outta every beat\nThat I'm greeted with immediately me and Sheek\nAnd Joell might as well be Rakim, Kane and LL\nI puff a L and stuff a shell up in the borough\n{\"Say it\"} if you really want the hammer\nThe cannon'll blow your grandma, make it hotter than Atlanta\nThey call me Tony Montana, the vandal that handled grammar\nFuck a police scanner, I'm standin up on a grand and just\n{\"Say it\"} and we come through deep\nBunch of crazy Puerto Ricans and we all got heat\nGive a fuck about a hater cause we all got beef\nI do songs with Bun B, Saigon and Free\nFor free, that says a lot for me\nI get respect from the rappers that you dyin to meet\nMonday's Murder Mass, Tuesday's out in Philly\nWednesday's pour heart then back to N.Y.C., c'mon\n\n[Bun B]\n{\"Say it\"} To my face if you got the testes\nDon't try to test these, you better bounce like jet skis\nCause we body beats, and this one I'mma murder that\nThis UGK for life {\"c'mon\"} I know you heard of that\n{\"Say it\"} like a murder rap, buddy I'mma body boys\nLeave lines leakin on loose leaf and probably scarred\nI don't talk to fakes so don't try to polly god\nThey find you stankin in Frisco at the trolley yard\nLord, have mercy, have grace\nHave the decency to get the fuck up out of my face\nI ain't down with the braggin, ya dumb so ya convo is laggin\nAnd really {\"c'mon\"} you got the dragon\nWe melt mics G, but not like that\nI'mma run and grab you some Colgate and be right back\nNow that's real, just keepin it trill\nYou wanna be the big will like J Dill'?\n{\"C'mon\"} Then motherfucker just {\"say it\"}\nFuck the radio, internet play it\nNahRight.com, yo it's time to S.K. it\nLet the hood okay it, no way it could lose\nR.I.P. to my dude, Pimp and J Dilla too\nTwo of the best that was keepin it true\nAnd if you miss 'em both like I do\nThen let me hear you just {\"say it\"}\n\n[Saigon]\nI mastered my zone, that's why I'm in a class of my own\nThis was '93 I'd probably be blastin the chrome\nY'all be sittin ya asses at home\nAnd you was a telephone thug, who only talk trash on the jones\nNow in the booth, you this bullet-proof certified murderer\nIf this had any truth, why nobody never heard of ya?\nYou only known for rap, nigga, bumpin your gum\nNobody seen none of this crack, that you dumped in the slum, bum\nNobody seen you bustin your gun, you wouldn't bust a grape in a fruit fight\n(Shit) Your pussy lips too tight\nMan, I'll tell you 'bout a kid named Divine\nLive by the thirty-eight {\"c'mon\"} and die by the nine {\"say it\"}\nWhat's it gon' take to make niggas stop lyin' in they rhyme?\nIs this what you gotta do to shine?\nWho give a fuck if radio say it's a hit?\nReal niggas consider it miscellaneous shit\nNah, we ain't the ones to play with (play with) we slay shit (slay shit)\nYou wan' rhyme with the big boys then nigga just {\"say it\"}\n\n[Freeway]\nWho the only nigga that drop\nThirty-one songs in a row and they all hot?\nY'all niggas drop songs and they all flop\nKillin me, I gun ya all down, thirty shots in a row, yeah\n{\"Say it\"} Me and Term' spit fire burn, we'll burn\nDrop bombs like Vietnam, send you home missin arm\nMissin leg, I'm the plague, I'm a renegade\nHundred-fifty boys come, hundred-fifty boys laid\nOut, sprayed out with their brain out\nNiggas said he spittin fire, Freezer put the flame out\nFreezer needed money so Freezer put the 'caine out\n'09's mines, clear the lane out 'fore I drain out\nThe 11th letter, that's the K for you stupid fools\nMake memorials out your hangout\nI am Destiny's Child, all you gotta do is +Say My Name+ out\nLoud, fuck the crowd, pull the thang out\nBlaow!"}], "artist": "Termanology"}