{"songs": [{"lyrics": "[Fat girl!]\n[You're a fat girl]\n[Fat...fat...fat fat fat fat girl] (repeat 2X)\n\n(It's funky fresh Eazy E) new kid on tha block\nAnd already got a fat girl on my jock\nNow my story's kinda simple, so please change the tempo\nAs I tell you a tale bout this big fat pimple\nI was chillin' on the ave, drinkin' some brew\nSaw a fatty comin' my way, so what was I to do?\nI busted a U, went tha other way again\nBut forgot that tha avenue was a dead end\nI turned around, here she came, stride for stride\nFunky fat like that, bout two thirty-five\nStampede was rushin, I double looked\nAnd she had more chins than a chinese phonebook\nFive four three ugly as can be, she said\n\n[Ron-de-vu]\nHello Eazy E! Do you remember me? (I said no)\nHuhu yes you do suga\nMy name is Bertha but you can call me booga\nRemember the time when you were drunk at a party\nWe was slow dancin, give ya all this body\n\n[Eazy-E]\nWhen she said that she loved it, I was in shock\nOh my God got a fat girl on my jock\n\n[Hook:]\n[I got a fat girl on my jock] [Fat girl] [Got a fat girl on my jock]\n\nShe gave me tha grin, I showed tha frown\nAnd with a bear hug picked me off tha ground\nSqueezin' me tight, attempted to bug me\nGrabbed me by tha rear, said [Love me, hug me!]\nI was hell, victim of a scandal\nCoz this girl's too much for E to handle\nBroke tha beast grip, started to run\nBack to tha crib, grabbed tha elephant gun\nShe's grubbin', thighs rubbin' in a hot pursuit\nI loaded up tha gun bout ready to shoot\nShe kept on comin' because of addiction\nLegs on fire because of friction\nMy gun broke\nI was doomed\nDropped tha double barrel, grabbed tha harpoon\nAs I swung, tha fat girl fell\nLyin' on tha ave just like a beached whale\nThat's tha story, it's quite ill\nAnd all fat girls y'all besta chill\nAll overweight freaks stay off my block\nCause it's ill to have a fat girl on your jock\n\n[Hook]", "album": "N.W.A. and the Posse", "year": "1987-11-06", "title": "Fat Girl", "image": "https://images.genius.com/1c81d51b13dc4236b4af0e1838b85b8c.600x600x1.jpg"}], "artist": "N.W.A"}