{"songs": [{"album": "Kingdom Muzik Volume 3", "image": "https://images.genius.com/777bea5d8d5e8876c8c3632ab3997503.500x500x1.jpg", "year": null, "title": "Dum Dum [DJ Spinoff Remix]", "lyrics": "[Verse 1: Lecrae]\nReal skinny\nLoud colored tennies\nBody marked up like graffiti\nI don’t push a Maserati, Beamer, Benz or Bentley\nAnd yeah I rode a foreign, and yes I'm lookin' spiffy\nGo ahead and doubt us, but what you know about us?\nWe ain't gotta follow them (No), we take another route-a\nNo we ain't blowin trees bro, open up my window\nI see you poppin tags, but you know that’s why yo' ends low\nI tried to tell 'em we was comin’, go on, let us in\nWhy they hatin’ like we all a bunch of hooligans?\nNo gimmicks, Spirit in my lyrics\nKnow when people hear it they gon’ love or they fear it\nAnd how we flow, when we show up at a show\nThey say we go S.O. hard in the paint, they can’t wait for some mo’\nBut some others say we preachin’, some close-minded teachin’\nLike we ain't heard of Marx, Locke, and Nietzsche? Believe me\n\n[Hook: Lecrae & Tedashii]\nEh, They Don’t know about us, they don’t, they don’t know about us\nThey, They, they don’t know about us, they don’t know about\nThey think we Dum Dum Diddy Dum Dum\nBut they gon’ know, they gon’ know about us\nThey gon’ know about us, they gon’ know about us\nOh they gon’ know about us, they gon’ know about us\n\n[Verse 2: Tedashii]\n6-2, 2 plus, go on add it up\n(Hey, that’s a big problem, call it Calculus)\nMath don't subtract, but content like I had enough\nLong hair, don’t care, Samoan, plus I’m tatted up\nI know this blow ya' mind, and I ain't blowin pine\nNot talkin’ women lookin skimpy every other line\nYeah, I got a dime, about to make her mine\nLife in Christ got me finished like a crossed a line\nWith the way that you’re telling me to sell, sell out\nNah man it’s so foolish, done tryin to be you and don’t fit\nMis-fit, I don’t trip, Everybody Hate Chris\nThey sayin get with this, just like a membership\nThey talkin’ slick like this is it, but it’s just gibberish\nI say I’m interested, they say ‘you different’\nOh, you gon’ know even if you don’t let us in\n\n[Hook]\n\n[Bridge: Tedashii]\nDum on em, dum on em, like I could be\nDum on em, dum on em, like you should be\nDum on em, dum on em, like I would be\nDum on em, dum on em, yeah that’s cool with me\n\n[Hook]"}], "artist": "Tedashii"}