{"artist": "Wiley", "songs": [{"year": "2007-06-04", "lyrics": "[Intro: Wiley]\nYeah! (London)\nIt's me, Eskiboy (Eskiboy)\nBow E3, all day long, hol' tight Maniac (All day long)\nYou know we do this (Hello, til the cows come home)\nOh my days, certain man tryna say like (Come on like)\nI don't rep for E3 (Bow E3), I am not E3 (Agh)\nAre you crazy? (Bow E3, mad, woo)\nI've been doing this (B-b-bow E3)\nI went to Bow Boys (Bow E3), I've been doing this for so long (B-b-bow E3, woo)\nLike (Bow E3), it's amazing how you can say that (B-b-bow E3, yeah, hello)\nListen (Bow E3)\n\n[Verse 1: Wiley]\nMy names Wiley, I come from (B-b-bow E3)\n07961897033 (Bow E3), I'm so E3 (B-b-bow E3)\nThe whole of E3's got so much talent (Bow E3), I hope you see (B-b-bow E3)\nI know E3 so well, if you ask me Wiley speaks for the whole of E3 (Bow E3)\nWhen I say that (B-b-bow E3), Scorcher won't make anybody bow to his feet (Bow E3), I ain't Wolfpack (B-b-bow E3)\nBoy Better Know E3, won't accept another doughnut MC (Bow E3) disrespect E3 (B-b-bow E3)\nI'm always tryna rep ends but certain friends on ends they don't know E3 (Bow E3)\n'Cause when it's reppin' time (B-b-bow E3), I show E3 (Bow E3)\nWe made a genre everybody's onto (B-b-bow E3), it's all come from Bow E3\nIt's Wiley aka Eskiboy (Bow E3), I'm from (B-b-bow E3)\n\n[Interlude: Wiley]\nYou get me? (Bow E3) That's why (B-b-bow E3)\nAnd certain man are tryna say like Eski (Bow E3) don't represent Bow E3 (B-b-bow E3)\nI've been doing this for so long (Bow E3)\nIt doesn't make sense tryna say I don't represent (B-b-bow E3)\nYou get me? (Bow E3)\n\n[Verse 2: Wiley]\nYeah, I'm from Bow E3 (B-b-bow E3)\nThe Tec-9 boys in his waist hold face, better know E3 (Bow-bow-bow-bow-bow-bow-bow-bow bow E3)\nWhen the war starts not many roll E3 (Bow E3)\nAnd I'm still alive, say Bow E3 (B-b-bow E3), didn't know E3, hello E3\nIn summer 2-7 (Bow E3), I was show E3 (B-b-bow E3)\nI'm the grime kid, pussyhole, know E3 (Bow E3)\nI'm a soldier so let's go E3 (B-b-bow E3)\nIt's Umbrella, not SHO-SHO E3 (Bow E3)\nSo, anyone from E3 who says they're shower (B-b-bow E3), don't lie, we know E3 (Bow E3)\nIt's not hard, anybody tryin' it better just stop (B-b-bow E3), I'll let the leng go E3 (Bow E3)\nCan't chuck a ting, I'm a pro in E3 (B-b-bow E3)\nYour girl's the ho of E3 (Bow E3)\nNot mine 'cause mine don't come from E3 (B-b-bow E3)\n\n[Interlude: Wiley]\nYou get what I'm saying? (Bow E3)\n(Can't) Can't tell me that man don't represent E3 ('Low it man, 'low it, b-b-bow E3)\nI've been doing it (Bow E3)\nOi (B-b-bow E3), hol' tight the mandem, hol' tight the girls ('Low it blud, 'low it, bow E3), hol' tight the women (B-b-bow E3), men\nYeah (Bow E3)\nAlright (B-b-bow E3)\n\n[Verse 3: Wiley]\nMoon Lee Chinese that's Bow E3 (Bow E3)\nI'm the fast E3, you're the slow E3 (B-b-bow E3)\nThe girls ain't dumb in Bow E3 (Bow E3)\nThey're like us, they all want dough E3 (B-b-bow E3)\nThey might link on the one away, when the suns gone away (Bow E3)\nIt's all good that's Bow E3 (B-b-bow E3)\nAnd I know she sees (Bow E3), when I walk past the house, I know she sees (B-b-bow E3)\nThe boyfriends cars outside, you can never be an outsider and be safe with a girl from (Bow-bow-bow-bow-bow-bow-bow-bow bow E3)\nI know E3 (Bow E3), and beefs just putting on a show E3 (B-b-bow E3)\nI put on the best show E3 (Bow E3)\nI know E3, I wrote E3 (B-b-bow E3)\nLike I don't care, my name's known in E3 (Bow E3)\nPricks, I ain't done nuttin' but represent Bow E3 (B-b-bow E3, bow E3)\n\n[Outro: Wiley]\nYeah (Bow-bow-bow-bow-bow-bow-bow-bow bow E3)\nYou get what I'm saying? (And I'm E3, Bow E3)\nI am so Bow E3 (Bow E3), you would not believe it (Bow E3, 07961897033, B-b-bow E3)\nLike (Bow E3), I've been doing this stuff for so long (B-b-bow E3)\nLike Bow North (07961897033), Monteith Estate (Bow E3)\nVicky Park (B-b-bow E3), like\nCandy Street, all these places (Bow E3)\nRoman Road (B-b-bow E3), St. Stephens, Tredegars (Bow E3), Morville (Oi, oi Maniac, B-b-bow E3)\nMalmesbury like (We have gone Bow E3)\nDevons Road, like (B-b-bow E3)\nLike everywhere, please (Bow E3)\nYou can not school me (B-b-bow E3, me and Maniac are gone, right now)\nIt's Eskiboy (Bow E3)\nAnd I rep for (B-b-bow E3, woo, Bow E3, woo)\nAnd you can't chuck a ting in (B-b-bow E3)\nYou know who else reps (Bow E3), God's Gift (B-b-bow E3), and Rascal (Bow E3)\n(07961897033, I'm Bow E3, I'm so E3) (B-b-bow)\n(Hello)", "image": "https://images.genius.com/f5e387caa8376c74acff42629a6ff921.500x500x1.jpg", "album": "Playtime Is Over", "title": "Bow E3"}]}