{"artist": "Playboi Carti", "songs": [{"album": null, "title": "Cash Shit", "image": "https://images.genius.com/2464352e4c9d86516c4891b53ebc48a6.871x871x1.png", "lyrics": "[Intro]\nCash, cash, cash, cash (What?)\nCash (Cash), cash (Yeah), cash, what?\nWhat? What? What? What?\nWhat? What? What? (Uh, SLATT, ooh)\n\n[Verse 1]\nOoh, if I'm a bitch then I'm the baddest bitch (Baddest bitch, what?)\nOoh, cash, cash, cash, cash, bitch\nSir Flex-A-Lot (A lot), boy, I flex, bitch\nI pop the Glock, boy, I pop this shit (What?)\nI rock the show, it's a mosh pit (Yeah)\nBeen 'round the block, huh, it's my park, bitch, uh (Yeah)\nApartment, uh, with a lot of shit\nSnowman, huh, ice cream shit, uh (Cash)\nBad bitch, huh, like to suck the dick (Bitch)\nMy clique (What?) throw them hundreds, bitch, uh\n29, ho, huh, 16, bitch (Check it out)\n16 bullets have you bleeding, bitch\nWestside Piru, how you bleeding, bitch? (Slatt)\nMy diamonds bloody on my body, yeah, they bleeding, bitch (Slatt)\nDiamonds summertime, you ain't seeing me\nMy diamonds biting like some Molly on the gleen shit (Gleen)\nLil' shawty said she tapped my phone, never received shit (Tapped my phone)\nI was in this bitch boolin' in Bleveland\nParking lot pimpin', bitch, parking a lot of shit (Yeah)\nCash, cash, cash, cash, cash, cash, cash, bitch (What?)\nHundred thousand just to hear the nigga spit (Uh)\nShe spitting on the dick, told the bitch to quit\n\n[Chorus]\nOoh, ooh, ooh, ooh, on some cash shit, uh\nOn some cash shit, huh, on some cash shit, uh\nOn some cash shit, huh, on some cash shit, uh\nOn some cash shit, huh, on some cash shit, uh\nOn some cash shit, huh, on some cash shit, uh\nOn some cash shit, huh, on some cash shit, uh\n\n[Verse 2]\nI'm a cash in, uh, I'ma cash in, uh\nThe bitches want me, I'ma catch 'em\nBad bitch suck dick, yeah, she love it\nBad bitch said she love me, yeah, she love me (Hey)\nDiamonds biting like some Molly and I love it (Diamonds biting)\nBitches wanna fuck Carti, yeah, I love it\nGot a lot of bitches on the side\nGot a lot of niggas doing life\nPut that on my block, that's on my 9 (What?)\nAll these niggas lame, I know they lying\nFucking on your bitch, that's all the time (Bitch)\nI just do this shit all the time\nOff the lean, off the lean, oh my God (What?)\nDiamonds on me biting, oh my God (Cash)\n\n[Outro]\nWhat?\nCash, cash, cash shit\nCash, cash, cash, cash shit (What? What?)\nCash shit (What? Uh)\nCash, cash, cash, cash shit (Bee)", "year": "2018-05-06"}]}