{"artist": "B-Legit", "songs": [{"album": "Hempin’ Ain’t Easy", "title": "It’s In The Game", "lyrics": "It's in the game!\n\nIt's in the game!\n\n[B-Legit]\nTwo to fo months on federal hold\nI been good, can't believe the game is cold\nSomebody told, that I couldn't handle my floss\nAcross the bay snitches tryin to shake shit off\nI made a call to my lawyer, one to my bitch\nTwo niggas stuck and we start to sit\nCase hella weak, got to dismiss shit\nI threw the words with the fish like swiiiss\nI only dealt on yall cuz i had some warrants\nTell you to a player on some tickets and toys\nI never had a bad case, check my fat on that\nI spend a rap, I bet my lawyer peeped that bat\nI rap, cuz my mouthpiece the best\nThen I let a nigga out on house arrest\nI break from the game, got a nigga change\nShit will never change it's in the game\n\n[Chorus 2x]\nIt's in the game!\nIt's in the game, ghetto stars, cars, cocaine\nWhen hustlers slang, some niggas bang, it's everythang\nWeed, hoes, speed, hop, greed, snitches bleed so what you you need\nIt's in the game!\nIt's in the game!\n\nIm a savage about mine for real tho\nKick a bitch in the mouth with my steel toe\nSay wussup to my niggas off the Filmore\nScooty G, Prop D, and Young ill hoe\nOn a mac block shit to get niggas the fame\nB's got the blunt and Twins got the game\nIt's no kool aid just indo\nWatch a bitch get naked for the kindo\nI bounce outta there, make my way cross town\nDick hard, finsta go knock shit down\nIm commin through now, cuz Im affiliated\nIm bout' to fuck n' get out n' leave uritaded\nI was player hated, bitch heard me speak\nPut a note in my pocket said you had me weak\nHit 3rd street n' run in the same\nHella n' fame, it's in the game\n\n[Chorus 2x]\n\nIn my last run, bout'  to close up shop\nGot bitches in a rental holding keys to hop, but me Im nonstop\nI catch the red eye and when my hoe touch down\nI be a mo' ti'\nIm in a suit top, lookin business like\nOn my lap top fucken with the web site\nEmail La tell em' hold up\nI got good shit commin' fista blow it up\nKeep my mouth shut, never tell my raps\nAnd niggas pay me double when they know it's a (??)\nAnd fo' a coo amount, we can take em' off\nHave yo niggas meet mine at the shoping mall\nWe ain't takin falls, got balls of steel\nTakin hits, see these (??) (??) get killed\nIt's real, fucken appeal, I aim\nIf I'm shoot in the brain, it's in the game\n\n[Chorus 2x]", "image": "https://images.genius.com/8c2ee1e85ca6b68c98af71fcc87d2721.594x594x1.jpg", "year": "2000-07-25"}]}