{"songs": [{"lyrics": "Bing! Bang! Pop! Pow!\nJesus what am I going to do now?\nI think my engine's about to explode\nI need to pull over to the side of the road\n\nMy car is smokin' and I'm losin' my vision\nHope I don't get to a traffic collision\nCallin' on Jesus the Great Jehova\nQualified traffic trying to get over\n\nI thought to myself \"Oh my God!\nThat sounds like my engine rod!\"\nMan, I'm so stuck, got no luck\nGot to walk ten miles just to call a tow truck\n\nSpent three hours and the pump can't find me\nHighway patrol pulling up behind me\n\"Is this your car?\" \"Yes sir.\" \"Well prove it\nBy the way three hours to move it\nIf you're still here when I come back round\nYou'll be heading downtown to the edam.\"\n\nBack on the bus, can I get a transfer?\nCar broke down...(car broke down)\nJust got a job, I just got hired\nWay across town\n\nMy car got towed by prejudice cops\nI know tomorrow morning I'll be at the bus stop\nI told my girl the bad news at the bar\nShe said \"Oh baby, you can use my car.\"\n\nSo I comin' to her house for the rest of the night\nAnd I my get a little thing all right\nShe gave me the keys, the very next day\nI pulled on my clothes and jumped the freeway\n\nI turned on the radio, the bass was rockin'\nAll of a sudden man, I hear some knockin'\nI though to myself \"Oh my God!\nThat sounds like her engine rod!\"\n\nIt must be curse, this is crazy bro\nCause I broke two cars two days in a row\nA cop gave me a ride to the payphone\nThey call a tow truck, it get away home\nMy girl's going to curse and my girl's going to fuss\nNobody got car we go for the bus\n\nBack on the bus, can I get a transfer?\nCar broke down...(car broke down)\nJust got a job, I just got hired\nWay across town\n\nWaiting at the bus stop me and my girl\nTrying to move up in the material world\nThere's no sequel, I feel equal\nTo the dog fleas and the homeless people\n\nI told Jesus I need an answer\nTold the bus driver I need a transfer\nLookin' for a seat, I thought about money\nI took a deep breath and then I smelled some thing funny\n\nOne man smelled like a alcoholic\nAnother smelled like a pot of old tonic\nI stood in the back in a school shirt\nCause all them seats smell just like urine\n\nNobody on the bus makes good money\nSo why's this high school kid makin' fun of me?\nI rung the bell, the bus passed my stop\nMan I had to walk back about four or five blocks\n\nMaybe my life would be this hard\nIf I started putting aside time for God\nWhen I start trying, when I start praying\nBad thing start happening, you know what I'm sayin?'\n\nBack on the bus, can I get a transfer?\nCar broke down...(car broke down)\nJust got a job, I just got hired\nWay across town\n\nHope I don't panic when I talk to the mechanic...", "title": "Back On The Bus", "album": "Because I Got High", "image": "https://images.genius.com/286e5a371c850693e27da49e4af749c5.300x308x1.jpg", "year": "2000-04-09"}], "artist": "Afroman"}