{"artist": "Fabolous", "songs": [{"year": "2014-12-25", "album": "The Young OG Project", "image": "https://images.genius.com/0b84b857b0d5bab3c411e1d7611e3a5c.1000x1000x1.jpg", "lyrics": "[Chorus: Fabolous]\nMy cinnamon apple, you know you did me wrong\nMy cinnamon apple, said you know you did me wrong\nYeah, my cinnamon apple, you know you did me wrong\nMy cinnamon apple, said you know you did me wrong\n\n[Verse: Fabolous]\nLook, I wanna take y'all back to 7th grade, middle school\nSkinny kid that everybody knew, I was a lil' cool\nHad my initial ring, gold chain, my lil' jewels\nWhat was more than most had so I never got ridiculed\nThis was '89, matter fact it was '90\nCrack was already huge, the streets start getting grimy\nBut I wasn't in that world then\nI'm 13, all I'm thinkin' 'bout is Nikes, basketball and my girlfriend\nYeah, who at the time was Tia Williams\nAnd she had no idea that one day I would see a million\nThis is a teenage love, few months but we was buildin'\nShe was grown, I was the man but we was children\nShe had ass though, I mean for her age or whatever\nShe wore my ring some times like we engaged or whatever\nAnd this the \"No, you hang up first\" dial tone era\nYour mom's pick up and say \"Hang up my house phone\" era\nAnd I hated that, how you gon' scream in my baby ear\nThat pretty lil' brown skin girl with the baby hair\nAs we was going steady, my sex drive was so Andretti\nShe a virgin but I feel like it's time, I know she ready\nHe ain't got much experience, but she don't know that\nThat boy's chance is comin' up, I hope he don't blow that\nI'm waiting for the opportunity, mama at work\nStart with a kiss, then I'm in her shirt, next I'm in her skirt\nYou know that always heard that the first time gonna hurt\nThat's what she heard from her cousin, 'lied and told her it doesn't\nAnd so to me, it's just a matter of time\nThat Tia gon' give it up to me and that'll be mine\nBut one day I was absent, I came back to school\nLearned that, I left the man but I came back the fool\nThey told me, \"Tia did some bullshit, I mean did y'all speak?\"\nShe cut school, lost her virginity, some kid named Khalif\nAnd I'm stuck... Like what the fuck?\nI ain't hear that my girl did what? But had to act like I ain't care\nFelt like I wanted to cry, but nah I ain't tear\nThat first time I learned that trust ain't a must if I ain't there\nAnd of course we broke up, she moved on, I did the same\nI ended up with some next girl, forget her name\nWhich probably isn't right, 'cause we used to get along\nBut I remember Tia, 'cause she did me wrong\n\n[Chorus: Fabolous]\nMy cinnamon apple, you know you did me wrong\nMy cinnamon apple, said you know you did me wrong\nMy cinnamon apple, you know you did me wrong\nMy cinnamon apple, said you know you did me wrong\nYeah, my cinnamon apple, you know you did me wrong\nMy cinnamon apple, said you know you did me wrong\nYeah, my cinnamon apple, you know you did me wrong\nMy cinnamon apple, yeah you know you did me wrong\n\n[Outro: Kevin Hart]\nAnd you gon' leave me, for some fuckin' nigga? Huh?!\nI thought you loved me\nYou was supposed to be my cinnamon apple, my cinnamon apple!\nBaby you gon' leave me for some nigga?! Huh for some NIGGA?!\n{*crying*} Get out of the car bitch\nAnd you gon' leave me?! You grimy son", "title": "Cinnamon Apple"}]}