{"artist": "Fabolous", "songs": [{"year": "2012-11-22", "album": "The Soul Tape 2", "image": "https://images.genius.com/82b1f5651f6eeea592ec747fc3987f89.968x968x1.jpg", "lyrics": "[Chorus]\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\n\n[Verse 1: Fabolous]\nI turn my dark secrets into bright ideas\nI used to cry for help, I learned to wipe my tears\nI was scared to embrace, but now I fight my fears\nThese hoes say I'm too much, it's only right I share\nPressure makes diamonds, I was made to shine\nWhen life gave me lemons, I made lemonade with mines\nWhat's beef? Beef is when you make mistakes\nLike less burgers with ya buddies and more steaks for snakes\nMy story just gets better when you get to the end\nSo when I'm at my worst, I know it's not the end\nI came from the dirt, made the cut and blew\nSo when you put me in that right light\nWhat I do?\n\n[Chorus]\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\n\n[Verse 2: Fabolous]\nI'm shining religiously, Jesus pieces and crosses\nI paid for all of my toys, I don't owe any Santa Clauses\nI never finished school or completed no college courses\nWas taught to be a winner, but I learned more from my losses\nLosses like, when you go is your friends gon' miss you?\nWas it cause you beneficial or you been official?\nCondo at the top, one floor down from Heaven yo\nHating is beneath me, I say that's the devil yo\nI'm tryna keep the faith, hanging in with hope\nWent to my jeweler, brought myself two angels on the ropes\nI came from the dirt, made the cut and blew\nSo when you put me in that right light\nWhat I do?\n\n[Chorus]\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\n\n[Verse 3: Fabolous]\nCould say I always was the truth but that be lying a little\nYou can't spell believe without a \"lie\" in the middle\nI always say it first, niggas trying to ditto\nBut I got bigger shit to do than to try and belittle\nMind of a general, heart of a solider\nThat just mean I call the shots, but ain't afraid to take the shots\nNiggas gave it all they got, still couldn't take my spot\nDon't get ya shorty got and have to live out takens plot\nI ain't give a fuck, now I would give whatever\nYou only live once, but legacies live forever\nI came from the dirt made the cut and blew\nSo when you put me in that right light\nWhat I do?\n\n[Chorus]\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond\nShine bright like a diamond", "title": "Diamonds (The Soul Tape 2)"}]}