{"artist": "Immortal Technique", "songs": [{"title": "The Poverty Of Philosophy", "lyrics": "Most of my Latino and black people who are struggling to get food, clothes and shelter in the hood are so concerned with that, that philosophising about freedom and socialist democracy is usually unfortunately beyond their rationale. They don't realize that America can't exist without separating them from their identity, because if we had some sense of who we really are, there's no way in hell we'd allow this country to push it's genocidal consensus on our homelands. This ignorance exists, but it can be destroyed\n\nNiggas talk about change and working within the system to achieve that. The problem with always being a conformist is that when you try to change the system from within, it's not you who changes the system; it's the system that will eventually change you. There is usually nothing wrong with compromise in a situation, but compromising yourself in a situation is another story completely, and I have seen this happen long enough in the few years that I've been alive to know that it's a serious problem. Latino America is a huge colony of countries whose presidents are cowards in the face of economic imperialism. You see, third world countries are rich places, abundant in resources, and many of these countries have the capacity to feed their starving people and the children we always see digging for food in trash on commercials. But plutocracies, in other words a government run by the rich such as this one and traditionally oppressive European states, force the third world into buying overpriced, unnecessary goods while exporting huge portions of their natural resources\n\nI'm quite sure that people will look upon my attitude and sentiments and look for hypocrisy and hatred in my words. My revolution is born out of love for my people, not hatred for others\n\nYou see, most of Latinos are here because of the great inflation that was caused by American companies in Latin America. Aside from that, many are seeking a life away from the puppet democracies that were funded by the United States; places like El Salvador, Guatemala, Peru, Colombia, Nicaragua, Ecuador and Republica Dominicana, and not just Spanish-speaking countries either, but Haiti and Jamaica as well\n\nAs different as we have been taught to look at each other by colonial society, we are in the same struggle and until we realize that, we'll be fighting for scraps from the table of a system that has kept us subservient instead of being self-determined. And that's why we have no control over when the embargo will stop in Cuba, or when the bombs will stop dropping in Vieques\n\nBut you see, here in America the attitude that is fed to us is that outside of America there live lesser people. \"Fuck them, let them fend for themselves.\" No, Fuck you, they are you. No matter how much you want to dye your hair blonde and put fake eyes in, or follow an anorexic standard of beauty, or no matter how many diamonds you buy from people who exploit your own brutally to get them, no matter what kind of car you drive or what kind of fancy clothes you put on, you will never be them. They're always gonna look at you as nothing but a little monkey. I'd rather be proud of what I am, rather than desperately trying to be something I'm really not, just to fit in. And whether we want to accept it or not, that's what this culture or lack of culture is feeding us\n\nI want a better life for my family and for my children, but it doesn't have to be at the expense of millions of lives in my homeland. We're given the idea that if we didn't have these people to exploit then America wouldn't be rich enough to let us have these little petty material things in our lives and basic standards of living. No, that's wrong. It's the business giants and the government officials who make all the real money. We have whatever they kick down to us. My enemy is not the average white man, it's not the kid down the block or the kids I see on the street; my enemy is the white man I don't see: the people in the white house, the corporate monopoly owners, fake liberal politicians those are my enemies. The generals of the armies that are mostly conservatives those are the real Mother-Fuckers that I need to bring it to, not the poor, broke country-ass soldier that's too stupid to know shit about the way things are set up\n\nIn fact, I have more in common with most working and middle-class white people than I do with most rich black and Latino people. As much as racism bleeds America, we need to understand that classism is the real issue. Many of us are in the same boat and it's sinking, while these bougie Mother-Fuckers ride on a luxury liner, and as long as we keep fighting over kicking people out of the little boat we're all in, we're gonna miss an opportunity to gain a better standard of living as a whole\n\nIn other words, I don't want to escape the plantation I want to come back, free all my people, hang the Mother-Fucker that kept me there and burn the house to the god damn ground. I want to take over the encomienda\nAnd give it back to the people who work the land\n\nYou cannot change the past but you can make the future, and anyone who tells you different is a Fucking lethargic devil. I don't look at a few token Latinos and black people in the public eye as some type of achievement for my people as a whole. Most of those successful individuals are sell-outs and house Negros\n\nBut, I don't consider brothers a sell-out if they move out of the ghetto. Poverty has nothing to do with our people. It's not in our culture to be poor. That's only been the last 500 years of our history; look at the last 2000 years of our existence and what we brought to the world in terms of science, mathematics, agriculture and forms of government. You know the idea of a confederation of provinces where one federal government controls the states? The Europeans who came to this country stole that idea from the Iroquois league. The idea of impeaching a ruler comes from an Aztec tradition. That's why Montezuma was stoned to death by his own people cause he represented the agenda of white Spaniards once he was captured. Not the Aztec people who would become Mexicans\n\nSo in conclusion, I'm not gonna vote for anybody just cause they Black or Latino. They have to truly represent the community\nAnd represent what's good for all of us proletariat\n\nPorque sino entonces te mando por el carajo cabron gusano hijo de puta, seramos libre pronto, viva la revolucion, VIVA LA REVOLUCION", "image": "https://images.genius.com/9c9631e16897ed9bc090afd0a05da5ae.1000x974x1.jpg", "album": "Revolutionary Vol. 1", "year": "2001-09-18"}]}