{"songs": [{"lyrics": "[Verse 1]\nFlash that buttery gold\nJittery zeitgeist, wither by the watering hole, what a patrol\nWhat are we to Heart Huckabee, art fuckery suddenly\nNot enough young in his lung for the water wings\nColorfully vulgar poacher, out of mulch\nLike, \"I'ma pull the pulse out a soldier and bolt.\"\nFine, sign of the time we elapse\nWhen a primate climb up a spine and attach\nEye for an eye, by the bog life swamps and vines\nThey get a rise out of frogs and flies\nSo when a dogfight's hog-tied prize sort of costs a life\nThe mouths water on a fork and knife\nAnd the allure isn't right\nNo score on a war-torn beach\nWhere the cash cow's actually beef\nBlood turns wine when it leak for police\nLike, \"That's not a riot; it's a feast, let's eat!\"\n\n[Chorus]\nAnd I will remember your name and face\nOn the day you are judged by The Funhouse cast\nAnd I will rejoice in your fall from grace\nWith a cane to the sky, like, \"None shall pass.\"\nNone shall pass, none shall pass\n\n[Verse 2]\nNow, if you never had a day a snow cone couldn't fix\nYou wouldn't relate to the rogue vocoder blitz\nHow he spoke through a NoDoz motor on the fritz\n‘Cause he wouldn't play rollover fetch like a bitch\nAnd express no regrets, though he isn't worth a homeowner's piss\nTo the jokers who pose by the glitz\nFine, sign of the swine in the swarm\nWhen a king is a whore who comply and conform\nMiles outside of the eye of the storm\nWith a siphon to lure out a prize and award\nWhile avoiding the vile and bizarre that is violence and war\nTrue blue triumph is more\nLike, \"Wait, let him snake up out of the centerfold\nLet it break the walls of Jericho, ready go.\"\nSat where the old, cardboard city folk\nSwap tales with heads, like every other penny throw\n\n[Chorus]\nAnd I will remember your name and face\nOn the day you are judged by The Funhouse cast\nAnd I will rejoice in your fall from grace\nWith a cane to the sky, like, \"None shall pass.\"\nNone shall pass, none shall pass\n\n[Interlude]\nYou tried, you tried, you tried to trick me\nYou've got a, you've, you've got a, a lot of nerve\nI'm, I'm not, I'm not, trying to trick you\nI'm try, I'm try, I'm trying to help\n\n[Verse 3]\nOkay, woke to a grocery list, goes like this\nDuty and death; any one object, come stand in the way\nYou could be my little Snake River Canyon today\nAnd I ran with a chain of commands\nAnd a jetpack strapped where the backstab lands if it can\nFine, sign of the vibe in the crowd\nWhen I cut a belly open to find what climb out\nThat's quite a bit of gusto he muster up\nTo make a dark horse rush, like, \"Enough's enough!\"\nIt must've struck a nerve so they huff and puff\n'Til all the king's men fluster and clusterfuck\nAnd it's a beautiful thing\nTo my people who keep an impressive wingspan\nEven when the cubicle shrink\nYou got to pull up the intruder by the root of the weed\nN.Y. Chew through the machine\n\n[Chorus]\nAnd I will remember your name and face\nOn the day you are judged by The Funhouse cast\nAnd I will rejoice in your fall from grace\nWith a cane to the sky, like, \"None shall pass.\"\nNone shall pass, none shall pass", "title": "None Shall Pass", "album": "None Shall Pass", "image": "https://images.genius.com/3d6c4d11084714cc67f880d71310d197.288x288x1.jpg", "year": "2007-08-28"}], "artist": "Aesop Rock"}