{"songs": [{"title": "All Night", "lyrics": "[Intro: Jeezy]\nYeah\nAnybody seen my drink?\nOh, we goin' all night tonight (Oh‚ I got it)\nI'm on that white though\nAll night‚ nigga\nNah‚ for real though\nTalk to 'em, nigga\n\n[Refrain: Jeezy]\nI'm talkin' breakin' down a brick, yeah‚ to hit a lick, yeah\nIn love with the bitch, but she still a trick‚ yeah (Yeah)\nThat ass sittin' right, yeah, I wanna bite, yeah (Yeah)\nI could fuck it right, yeah, all night, yeah, uh\n\n[Verse 1: Jeezy]\nGotta let them niggas know, boy, you got that dough, boy\nFuck what you heard, you ain't nothin' to hold boys\nBefore I seen them O's, boy, I was a poor boy\nDrop my top in the hood, yeah, I'm talkin' dope boy\nI be making hits, man, like a hitman\nWhat you say about them dollars, they can suck a dick, man\nKeep my dawg on the collar 'cause that boy a pit, man\nStreets get deep, yeah, I'm talking quicksand (Yeah)\nStraight up out the hood, yeah, I'm ridin' wood, yeah\nRose gold with the pointers, yeah, I'm lookin' good, yeah\nSelf-made, self-paid, yeah, it's understood, yeah\nStill be A-E-W, I wish a nigga would, yeah\n\n[Chorus: Jeezy]\nYou' bout your issue? Is you gon' shine every night?\nPhone off, grind it up and get it right\nDon't do no snitchin', don't do no trickin', don't do no lackin'\nDon't do no cappin', it's all night, let's get it crackin' (Yeah)\n\n[Verse 2: Gunna]\nCame up on a milli', yeah, I'm a millionaire (Yeah)\nI can see the envy, yeah, through these Cartiers (Through the Cartiers)\nNeighborhood style, like catch me rockin' cashmere (Cashmere)\nExtravagant shop, I can't buy shit from last year (No)\nShe can heal the pain when I hit like Advil ('Vil)\nI drop to explain and I charge for adlibs (Adlibs)\nI hop on the plane, show the whole world my drip (My drip)\nTalkin' 'bout her brain when I said she give lip (Lip)\nI got in my bag, this a whole lot of chips (Uh)\nSpeedin' in the whip, I got way too many whips (Too many)\nFans across the world, I get paid to take a trip (Trip)\nYou don't trust these suckers, if you play, you gon' get flipped\n\n[Chorus: Jeezy]\nYou' bout your issue? Is you gon' shine every night?\nPhone off, grind it up and get it right\nDon't do no snitchin', don't do no trickin', don't do no lackin'\nDon't do no cappin', it's all night, let's get it crackin' (Yeah)\n\n[Refrain: Jeezy]\nI'm talkin' breakin' down a brick, yeah, to hit a lick, yeah\nIn love with the bitch, but she still a trick, yeah (Yeah)\nThat ass sittin' right, yeah, I wanna bite, yeah (Yeah)\nI could fuck it right, yeah, all night, yeah, uh\n\n[Outro: Jeezy]\nWhat's up?\nYeah\n104 did that, yeah\nYeah, yeah, yeah, yeah, hah\nAll night\nYou gon' get up tomorrow, do it again\nYeah\nYeah, yeah\nYeah, yeah", "album": "TM104: The Legend of the Snowman", "year": "2019-08-23", "image": "https://images.genius.com/bc6135011548a24a95a5c16c968a3106.1000x1000x1.jpg"}], "artist": "Jeezy"}