{"artist": "Andy Mineo", "songs": [{"title": "In My City", "album": null, "year": "2011-01-01", "image": "https://images.rapgenius.com/0fa7cd1c853f65588e12456956591741.720x720x1.jpg", "lyrics": "[Hook:  Efrain]\nIn my city, that's where God belongs\nIn my city, cause He run it anyway, He run it\n\n[Verse 1:  Andy]\nLook, Psalms 14 uno, you know\nHe says in his heart God don't exist, fool though\nWho created the stars?  Planets like ours?\nPluto and Mars?\nYou need the proof, though?\nThe truth is so in the art\nThis the living God that I serve\nMade everything in a minute with a single word\nHe be taking care of the bees and even the birds\nCause the truth is taking care of the people who are in the Word\nDon't you see our sin brought a curse?\nChrist redeemed us, now I know my prayers work since we believe He interceded\nWe are soldiers, an army, our sergeant is He\nOur weapons are not carnal, yo, we start on our knees\nWe are a movement of the young, on fire and we zealous for the honor of our Father that's in Heaven\nBring Him\n\n[Andy & Efrain]\nIn my city\n\n[Hook:  Efrain]\nThat's where God belongs\nIn my city, cause He run it anyway, He run it\nIn my city, that's where God belongs\nIn my city, cause He run it anyway, He run it\n\n[Verse 2:  Andy]\nGod, I'm so unashamed\nThis world thinks we insane\nCause we be living like in this life it's about Christ and to die is gain\nWe denying the fame, don't retire we aim\n'Til our last breath to go and confess the Messiah's Name\nSo Thy Kingdom Come, Will be done\nIn our city until 'til we see Him in the Holy one\n(New York, New York)\nThat's where the homie from, but I know I can't be the only one\nAny believers in here?  Show me some\nGet your hands up for the Holy Son\nFought death beat it, now you know we can defeat it\nGo and read it, man, we already know we won\nThere's power when Your people\nWill gather just to come seek Ya\nThen ask for Your forgiveness, admitting we truly need Ya\nTaking the Gospel to the ends of the earth\nSearching for hearts, but first I think we going start right\n\n[Andy & Efrain]\nIn my city\n\n[Hook:  Efrain]\nThat's where God belongs\nIn my city, cause He run it anyway, He run it\nIn my city, that's where God belongs\nIn my city, cause He run it anyway, He run it\n\n[Verse 3:  Andy]\nSo Father teach us how to pray, not just ramble off with a wishlist\nMake us still and listen\nGive us holy ambitions\nWe're called and commissioned\nYour work here isn't finished\nWhile we're living then we'll never ever fit in, misfits\nBlessing those who hate us\nPraise You in our affliction\nThe way the see us love one another is our distinction\nThey take You off our dollars and out the Pledge of Allegiance\nBut they'll never take praise out the mouth of believers\n\n[Andy & Efrain]\nIn my city\n\n[Hook:  Efrain]\nThat's where God belongs\nIn my city, cause He run it anyway, He run it\nIn my city, that's where God belongs\nIn my city, cause He run it anyway, He run it\n\n[Andy & Efrain]\nIn my city.. He run it, He He He run it, He run it, He He He run it\nIn my city.. He run it, He He He run it, yeah\n(Here, in New York City, we will not be silent) In my city..\n(The capital of the world, we are the light of this world)  In my city...\nHe run it, He He He run it, yeah, He run it\nCause He run it anyway, He run it"}]}