{"artist": "360", "songs": [{"album": "Please Be Seated 3", "year": "2016-02-22", "title": "My Favourite Downfall", "image": "https://images.rapgenius.com/b2600a04acb9167dce0a914d5c3fa0b9.600x600x1.jpg", "lyrics": "[Chorus: JOY.]\nYou only call me when you're drunk, saying I might be the one\nTalk me into it even though my intuition\nTells me not to listen, it feels so damn good\nTo hear your voice\nAnd I don't want to quit it's like stepping on a cigarette\nThat just goes on\nYou're my favourite downfall\nYou're my favourite downfall, up all night\nYou're my favourite downfall\n\n[Verse 1: 360]\nBreathe me in, keep me inside\nI'll be your friend, I'll teach you to lie\nI'll bring you to life and I'll teach you to cry\nYou got a demon inside, hard to swallow when I'ma eat you alive\nYo, it's time to stop\nI created all of these feelings that you keep fighting off\nThat commitment that you keep hiding from it is kinda gone\nWhy deny it for?\nMeant to be with no strings attached, now we about to tie the knot\n\"I'm forever yours,\" no, you're forever mine\nWithout me happiness is something that you'll never find\n'Cause I define you, listen to me and I'll guide you\nYou're defensive of everything I do, 'cause I've got you believing that I'm you\n\n[Chorus: JOY. & 360]\nYou only call me when you're drunk, saying I might be the one\nTalk me into it even though my intuition\nTells me not to listen, it feels so damn good\nTo hear your voice\nAnd I don't want to quit it's like stepping on a cigarette\nThat just goes on\nYou're my favourite downfall\nYou're my favourite downfall, up all night\nYou're my favourite downfall\n\n[Verse 2: 360]\nDon't ignore me, I know you hear me, I ain't quiet\nThat wall you think is gonna keep me out, I walk straight by it\nYou're so fed up, try to run but I won't let you\nYou don't get it, like to think that you know better but you're no better\nWill you leave? No, never, see I don't let up\nOne day I'm gonna come around and put you so low that you won't get up\n(You won't) See, they say you're ill\nThere's something wrong with your head and that you gotta take some pills all because how I make you feel\nBut I'll make you feel, feel this\nWhat would you rather: feel shit or not feel shit?\nThe meds will silence that devil in your ear\nUntil we're toe-to-toe though I will never disappear\n\n[Chorus: JOY.]\nYou only call me when you're drunk, saying I might be the one\nTalk me into it even though my intuition\nTells me not to listen, it feels so damn good\nTo hear your voice\nAnd I don't want to quit it's like stepping on a cigarette\nThat just goes on\nYou're my favourite downfall\nYou're my favourite downfall, up all night\nYou're my favourite downfall"}]}