{"songs": [{"title": "Fuck Me For Free", "lyrics": "Lefrak City, Queens Yo this is Akinyele with my mans Complextion and\nRight now we representing all the guys with more than ten dollars in\nThey pocket who still gone be playin even though they not payin for the\nWhole night. You know what I'm sayin?\n\n(chorus)\n\nGirl would you fuck me for free?\n(Girl would you just fuck me for free)?\nOne fuck, One fuck\nGirl would you fuck me for free?\n(Girl would you just fuck me for free)?\nTwo fucks, Two fucks\nGirl would you fuck me for free?\n\nYo if I ever had to go out spending cash for ass\nI get it some Quarterback shit and I'll just pass\nI'm a little too fast for ya'll gold diggers\nOn that O.J tip straight tryin to duece a nigga\nThat's why I don't believe in holidays, or meeting your moms, eating\nOut, a restaurant or taking your ass to that prom\nI'm straight up like the collar on the foreigns\nLiving like our daughters are runnin ones Perion\nLadies fucking men for money all night long but that's foul like a nigga\nEating swan while reading the Qu'ran\nThe fire run game on they brain\nYou cats is dying died her up in the Ramada\nWith eight bitches and a pie pizza filled with anchilates\nAnd all ya'll girls can have a slice on me\nCause tonight me and my people we fucking for free\n\n(chorus)\n\nYou know how it is on these streets tryin' to make a million\nIf I was talkin square biz I'd be out sellin' Cicilians\nImagine I would pay for all the girls I fucked\nI'd be broke as fuck with a broken heart\nPlus I can't fuck now what the fuck type of shit is that in this\nPosition cause I was trickin like a magician\nGirls in the world tryin to take your bread\nPut your wallet in your hat nigga and hold your head\nIt's the Akinyele, you know I rock well\nGirl I get up in that ass like K.Y Gel\nSaid, if I want to fuck I gotta spend cash\nNiggas must have had they tongue in your butt\nCause you cause you talkin' out your ass\nHuh, I just came to bust a nut\nBut if you want me to go down south girl listen up\n\"I wanna fuck\" I said \"I wanna fuck\"\nYo, the farthest south I'm going is the accent\nCheck it out \" I wanna fuck\" huh huh huh\n\nChorus until fade", "year": "1996-08-13", "album": "Put It In Your Mouth EP", "image": "https://images.genius.com/6f97c404ebb3eb7b5295699bdf7912f6.707x702x1.jpg"}], "artist": "Akinyele"}