{"songs": [{"image": "https://images.genius.com/bff812621b4e5711800203b54676c8b5.626x640x1.jpg", "title": "Gigolo", "album": "Nick Cannon", "year": "2003-10-18", "lyrics": "[Intro - R. Kelly] + (Nick Cannon)\nOh, oh, oh, oh, oh (Oh, uh, haha, Cannon Ball)\nOh, oh, oh, oh, oh (Check it, Kels!)\n(Yo nigga we in the club singing this for money, ha!)\n\n[Hook - R. Kelly]\nI'm a gigolo, spending lot's a dough\nYou can tell the way wide-body, sitting on voguesAnd how I'm shining, wit the fresh, fresh clothes\nAlways surrounded, by so many (HO!)\nI'm a gigolo, always on the go\nEvery time I turn around, I got another show\nIn the club, wit about three in a row\nDrop in the Six, cause I love them (HO!)\n\n[Verse 1 - Nick Cannon]\nShorty I, only got one night in town, tell me baby where you down\nBushes we won't beat around, bushes we just eat 'em now\nFeeling yo Moschino  blouse, seven jean, Black and Lebanese\nHead to her knees, please if you ever need a bastard remember me\nJust rock to the melody, I got you in bed wit me\nI thought you would never leave\nYou wanna name me, like Amerie\nKnow the chain freeze wrist, be the same degrees\nTryna get lil' mami, in that thang of reese\nOnly getting in for free, if you came wit me\nCause I'mma grown man, not B2K\nIf I need a Girlfriend, it won't be to-day\nNo, I'm NOT tryna be ya man, pimp bones in my body\nRock them body-hotty, rock them, like ladi-dadi\nMe and Kels on Ducatti's, wanna see you drop it shawty\nOh weee! tryna leave the club, wit a groupie!\n\n[Hook]\n\n[Verse 2 - Nick Cannon]\nMa I'm busy on tour, ma, you busy on the floor\nMa I'm feeling yo heels, them Christian Dior's\nI'm like David Beckham, keep a mean shoe game\nBut like my favorite records, keep spinning new thangs\nLet my hair grow, cause I was looking for a change\nShorty call me the Scare Crow, I'm looking for some brain\nIn \"The Wiz\", there it go, here it is, where the show\nCause through yo dress, I can see yo drawls\nSo shorty just shake it, make a round of applause\nIf you outta Hypnotic, 'nother round at the bar\nAnd when we parking lot pimping, they surrounding the car\nNo, I'm NOT tryna be ya man, pimp bones in my body\nRock them body-hotty, rock them, like ladi-dadi\nMe and Kels on Ducatti's, wanna see you drop it shawty\nOh weee! tryna leave the club\nWit a groupie! wit a groupie!\n\n[Hook]\n\n[Verse 3 - Nick Cannon]\nMami, when we leave the club, leave wit us\nYou don't need ya car keys, we gon' fair in the bus\nAnd the way you wear ya jeans, is means to cuss\nSo DAMN! how you get them on, DAMN! big secrets on her\nThrowback chick, hotter than Ms. Vic Damone\nThis the type of ... I'm on, not picking up the phone\nUnless you unblock ya joint, then put on ya coat\nKnow when to hit, when Nick get in the booth\nCome through in something new, wit an invisible roof\nOh the sentence on my necklace seem invisible too\nWhen we do what we do, we can't be visible boo\nThe last thing I need is lawsuits, all I did is call you\nInitiated first move, shorty that was all you\nI'm NOT tryna be ya man, pimp bones in my body\nRock them body-hotty, rock them, like ladi-dadi\nMe and Kels on Ducatti's, wanna see you drop it shawty, oh weee!\n\n[Hook]"}], "artist": "Nick Cannon"}