{"songs": [{"lyrics": "[Intro]\nAy\nOh yeah\nDaBaby\nHey\nSex with me- Hahaha\nIt's that shit like\nLike that shit when you get that lil' late night text\nThat, that \"what you doin'?\"\nYou know what I'm talkin' 'bout?\nAt like eleven or twelve o'clock, \"What you doin'?\"\nHahaha\nThat ain't DaBaby, that's my baby!\n\n[Verse]\nYou know when we fuckin', I make love to you\nI'ma get you high like the drugs do you\nPut your hands behind your back like the judge do you\nI'm tryin' to hear that ass clap, ain't no love music\nWe need to turn it up and put it on some trap music\nYeah I'ma bend you over to that Gucci Mane\nPut my hands on your shoulders, I'm like, \"Who the man?\"\nShe bitin' on her bottom lip, screamin', \"You the man\"\nWhy you tryin' to run? Baby throw that ass\nPut your leg behind your head like it's yoga class\nAnd I know that shit hurt, you need to stretch, don't you\nYou know I don't show no mercy when I sex on you\nWater water water water, I'ma dive in it\nWho and it's gettin' deep, I can't survive in it\nI'm in that pussy goin' dumb, lose my mind in it\nYou gon' have me actin' funny on my side bitches\nYou know the word around town, I got that thang thang\nThat's why all them bitches wanna be my main thing\nYou might as well fuck my nigga, it's the same thing\nBack in high school, she let us run a train train (Choo choo)\nRidin' 'round the city with a nigga (Boop boop)\nI'm your boyfriend for the night baby (Do you)\nActin' brand new on her boyfriend like (Who you?)\nRun up on me actin' crazy, guaranteed to (Shoot you)\nHa, if I put it on her then she ain't gon' never forget about me\nLeave her alone, guarantee she gon' start talkin' shit about me\nI know she remember, that pussy get wet when she get around me\nBut she put up a wall, I'm figure out a way to get around it\nJust to hit it one more time for the one time\nAnd fuck her from the sun up to the sun down\nI got her talkin' back to me, goin' dumb now\nSay she finna cum for me, I say you can cum now\nUsed to be a side nigga, I'm the only one now\nYou done let DaBaby fuck her, now you fucked up\nYou used to be her boyfriend, ain't no point now\nYou fuck around and get her back if you luck up\n\n[Outro]\nWhat's up\nHaha\nThat ain't DaBaby, that's my baby!", "album": "Baby Talk", "year": "2017-01-23", "title": "Sex With Me (Remix)", "image": "https://images.genius.com/fa242d3e0e043b6323716b6cd4f41477.600x600x1.jpg"}], "artist": "DaBaby"}