{"artist": "Gangsta Boo", "songs": [{"title": "Wanna Go to War", "album": "Enquiring Minds", "year": "1998-09-29", "image": "https://images.genius.com/5283d1f21d20bdec4953ec12b3d4e43a.300x300x1.jpg", "lyrics": "1 - Wanna go to war wit me baby?\nThis gangsta bitch can get crazy\nDon't you decieve this lady\nDon't fuckin' play wit me baby\n\nRepeat 1 (3x)\n\nI'm kickin' it, I be doin' that playa shit\nYou be doin' that ho shit, hatin' up on me bitch\nI cannot help I'm a Prophet queen, ridin' until I die bitch\nDo you wanna get fucked up?\nDo you wanna see me tear da club up?\nDo you wanna get bum rushed?\nBy niggas wit triggas that's ready for come-up\nI bet you be wonderin'\nHow do a lady be flowin' just like them niggas do\nI be spyin' on your crew\nThat's how I know exactly what to do\nDon't be playin' wit me\nIt hurts me deeply to see that you decievin' me\nI'll get you, I'll study up on the novel known as Misery\nI'm comin' wit shit to _Make 'Em Say Ugh!_ like that Master P shit\nI'll be hangin' wit niggas that's _Ready To Die_ like Notorious BIG shit\nDon't be fuckin' wit me\nWhen you see I'm on some other type of mix\nDon't try to be 'bout it in front of your friends\nPut that red dot on your chest\nThem mafia niggas taught me well, nigga can't you tell\nI sport the mean designers bail, nigga doin' swell\nTo end this verse off, I be known to have you niggas pissed off\nBut keep on pissin' cause I ain't gon' stop until yo' ass drop\n\nRepeat 1 (4x)\n\nI be the one you love to hate cause I'm so so slick\nYou look into my eyes, but never knowin' what I'm gon' do next\nI'm like outlaws, we warrior thugs\nShowin' 'em our blood\nIt don't mean cause I'm a lady that I can't have the blood\nI keep my mean mug wit me for you hoes & that shit\nI get my smoke on daily, cause I got to have it\nTo all you lovely ballin' niggas lookin' for a sidekick\nPut yo' money by yo' dick & we can do some business\nI'm not tryin' to be rude\nThat's just how it's gon' be\nI'm rollin' wit The Prophet Posse and we 'bout our money\nMany people say I'm crazed\nDamn, is it a lie?\nI guess I'm crazed now-a-days, baby it's do or die\nI'm bein' real, you bein' fake\nLike some counterfeit cheese\nWhile yo' bitch ass on yo' knees doin' just as I please\nEnquiring minds wanted to know what's gon' be my next move\nIn Monopoly, you's a fool, cause this game you gon' lose\n\nRepeat 1 (4x)"}]}