{"artist": "Watsky", "songs": [{"year": "2013-10-15", "lyrics": "What makes a human different than the rest of the food chain\nIs not that we are at the top of it\n\nWhen I got my first pet ever, a leopard gecko, back from the pet store, I was distressed\n\"No no no no no no, don't do this to me... What do you mean leopard geckos can't climb walls? The whole freaking point of getting a gecko is so you can send them on spy missions!\"\nI learned to love him for what he was not\nI named him Sizzler\nAfter my favorite restaurant\nWhere you could get chicken nuggets in the shape of dinosaurs\nLet me tell you, there is no more inspiring buffet item\nThan a lump of reconstituted chicken parts that styles itself as a Stegosaurus\nSo Sizzler was a fitting name for a Leopard Gecko\nThe earthbound gecko\nThat chooses to live not as some wannabe green reptilian Spiderman\nbut as a ferocious jungle cat\nA truly aspirational beast\nFollowing in the glorious tradition of the Whale Shark\nThe Cat Fish\nThe Egg Plant\nAnd of course the Horseshoe Crab\nA crab that dreams of being... a horses shoe\n\nI fed Sizzler live crickets that lived in a terrarium that sat in the bathtub\nSo in case they somehow managed to escape the cage\nThey would struggle fruitlessly against the impossibly high porcelain prison walls\nI'd shake the crickets up in a paper bag full of protein powder like some fucked up death maraca before he crunched in\nA wing or spare leg hanging out his lower jaw like salad greens\nI couldn't figure out why I was feeding my pets to each other\nI had this little secret\nSometimes I would slip into the bathroom and carelessly\n-whoops- glance the terrarium and slide the roof a crack to grant crickets that could climb that granite slab a fighting chance\nIf they made it over they were honorary geckos\nA couple earned their freedom and escaped into the wall paneling\nWhere played their tiny violins as long as they had music in their legs\n\nI gave sizzler back to the pet store\nI stopped eating at his namesake restaurant\nI started thinking if chickens wanted to be dinosaurs we should let them enjoy the privilege while they were still alive\nIt was years before I came to the conclusion that you can't stop the brutal beauty of the food chain by removing yourself from it\nThere is no life without death\nThere's no way to live perfect\nSo flush that dream down the toilet\nAnyone who's owned a teakettle knows that even water screams when you boil it\nAnyone who's driven a car on the freeway has committed bug genocide\nEven if you're a vegetarian, your super market produce is sprayed with a product called insecticide\nHow do you rectify that people are dying and Watsky, you're worried about crickets?\nin a world not yet rid of rape and murder\nYou're talking beef and pig on baconburgers\nWhen kids still beef with pigs on Hegenberger\n\nI'm not saying we don't need to look after US.\nJust that we lose nothing by expanding our definition of \"Us\"\nWhat makes humans special is not our ability dominate those more vulnerable than ourselves\nIt's our willingness protect them\nTo empathize\nNo, mothafucka, it's not an excuse to dress your dog like a sailor on shore leave\nThat's obnoxious\nI'm aware geckos don't want to leopards & crickets aren't pretending to be lizards\nThose are human projections onto animals that are simply out here trying to function\n\nI do, however, believe in the horseshoe crab\nThe crab that dreams of being a horse's shoe\nAnd maybe you've never seen four living crustaceans glue themselves underneath a thoroughbred's hooves\nGo ahead and tell me there's no way that thin exoskeleton could support a two ton Clydesdale\nDon't believe me. But I've seen it.\nBrave New Voices, do you believe in the horseshoe crab?\nI said, \"Hey Horse, nice shoes.\nThat horse, \"I'm touched. I didn't realize people were actually capable of feeling things\nYou know... I'm not naïve, human\nI know that horseshoe under me is no horseshoe at all\nHell, don't tell him, but it's not even a horseshoe crab\nIf you lean in, you can tell by the shell it's actually a hermit crab\nThe genuine article\nAnd I'm no horse—Bitch, I'm a barnacle.\"", "image": "https://images.genius.com/15e329cac8808712e9bcdedd4c1b05fd.1000x1000x1.jpg", "album": null, "title": "Leopards & Horseshoes"}]}