{"songs": [{"year": null, "album": "#44 - 44 Magnum", "image": "https://images.genius.com/205171c81fe32b24535d9dac6a675bba.1000x1000x1.jpg", "title": "Incredible (feat. LL Cool J)", "lyrics": "[LL Cool J]\n\nI'm incredible, I mix up shit like cake mix\nKeep it blazin hot, rhymes 燽urn to keep you frost bit\nMC's is assed-out cause they lost it\nPeep my foundation, the way I reinforce it\nI monitor movements, precisely\nMakin niggas hit high notes, like the Eisley's\nFinally, some bitches I can touch up\nTie em to the grill of my Six, pop the clutch up\nHush up, I rush up, inside your cut\nMake you puss up, then bust up, cause my shit bumps\nThis Don's Trumps, kill straight cats and all chumps\nCause \"Life is like a box of chocolate,\" Mr. Gump\nUh, the ultimatum, lets abbreviate em\nLL platinum again, don't you hate 'im?\nA thin line between darkness and sunshine\nFive Percenters that was raised on swine\nKnown to be wise, and you wise to understand\nBringin me drama is a handstand in quicksand\nI've been爃ot so long, I'm immune\nYour rap career get cut short like Poom-Pooms\n\nChorus: Keith Murray (LL Cool J)\nNow, from the streets to the suites and all around the world\nThey all recognize we (Incredible)\nWe can stand in the water and can't get wet\nYou can bet your last dollar we (Incredible)\nWe gets it on in the worst way\nAll the homeboys and the girls say we (Incredible)\nFrom one brother to another\nThey agree with each other, lyrically we both (Incredible)\n\n[Keith Murray]\n\nAdios, mios, Montageune\nWe're too hot to hold and too bold to be controlled\nYour only skin-deep, my ugly comes from the soul\nI find the leaks, and E plug the holes\nI have more beef than filet mignon\nBut got smart, and flushed the bullshit down the ?como?\nRappers just started rappin last week, get a deal next week\nAnd go platinum next month\nBut pass the blunt, so I can stay hy- like -dro\nDon't act like you don't know, I'm about to fly a flow\nI'm three from three from a three-point land\nWith more devastation than a nigga can withstand\nRemember me? Untouched by any emcee\nI add verbal assault to your mental injury\nCause I'm the vogit, toat it, quote it\nFive-0 said freeze, man I blowed it\nRyhme strategies, no one's bad as this\nI sew up the populace like a seamstress\nA prisoner, doing time and the bit\nA grown man, and don't play with no kids; I'm incredible!\n\nChorus\n\nLyrically we are both (Incredible)"}], "artist": "Keith Murray"}