{"songs": [{"title": "B.O.N (Big Ol Nigga)", "album": null, "year": "2014-11-21", "image": "https://images.rapgenius.com/f4d5d6e4e61968614278a02482aac7bf.500x500x1.jpg", "lyrics": "[Intro]\nIt's your boy Lil Durk man\nKing of Chicago man\nThis is not a diss\n\n[Verse 1]\nCaught a new case and shit, made me look basic\nPolice want names, cause I done made it\nDon't fuck with my niggas, they left a nigga hanging\nFree Zoo and free DD, hardbodies don't say shit\nDon't be from Mubu, this rap shit is fufu\n(We don't rap beef, nigga!)\nCatch me on Normal, with Twin he a loose screw\n(My niggas go nuts!)\nThese niggas is snitching, we callin' em blues clues\nThey telling the police, giving em loose clues\nI fuck with the Migos, but I am not Capo\nSipping on purple, I'm feeling like harpo\n(I'm sippin' on act!)\nThese niggas want war, knock meat out his taco\nFor that beef with our team , we shooting like porno\nShots out of Chiraq, born central city\nNow I'm in LA, eating shrimp with Diddy\nMy daddy got booked with some books and a couple of millis\nThe next deal I sign is gonna be for a couple of millis\nI don't rock Gucci, I just like Louis V\nThat swipe shit is cool, but you will not Woochie me\nHow you gone wife her, she just gon' do the team\nYou stick to the smokes and the molly, I'mma do the lean\nShout out to B.O.N., I'm talking 'bout Bump and 'nem\nYou diss on Chiraq, you is not coming here\n(Better ask them niggas)\nYou so GDK, now you a thug again?\nYou so BDK, now you a thug again?\nWith these birds man I feel rich homie like Thugger 'nem\n(Like Rich Gang)\nHow you feel today, and thinking we plugging him\nAnd I lost a couple niggas that I can't hug again\nBut I seen a couple niggas I cannot mug again\nShout out to Def Jam, No I.D. 'nem\nHomicide on the scene, no I.D. him\n(Took off his face with this 40!)\nSipping on lean, my IV Kit\nThey look at IG, they wanna be him\nI call up D Thang, he dress a nigga up\nCall up Randy Boy, po' lean in my cup\nI call up Ikey Mikey, he shooting shit up\nThey talkin' bout Durk, he picking shit up\nFuck all that eating shit, I'm with this beef shit\nI use a lot of autotune, but I'm with this street shit\n(Ask all the opps!)\nI bang like Chop, but I'm on my Keef shit\n(I'm fuckin' with him right now!)\nTake a nigga down, but we will not keep shit\nShout out to 4-6, shout out to Dog Pound\nShout out to 300, they will not make a sound\nNiggas be tweaking, I know they 'gone hate us now\nIf Kobe leave league, there ain't no Lakers now\nTake me out of Chiraq, like Jordan off the Bulls\nHow you the king of Chiraq you ain't got no pull\nAnd these niggas throwing L's like these niggas loyal (These niggas ain't loyal at all!)\nThese niggas say they got your back but they ain't for you\nB.O.N\nI'm a big ol nigga\nB.O.N\nI'm a big ol nigga\n\n[Outro]\nAye Nuski gang man RIP man\nFree Rondonumbanine\nAye this my city nigga, gang\nCause I'm a big ol nigga\nI weigh 150 solid ya hear me I'm still a big nigga, nigga\nAye my feature price cost these niggas rent for a year man\nI pay you niggas shit up\nNuski got the strap December 15 nigga, gang"}], "artist": "Lil Durk"}