{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Who is the man with the master plan? (x2)\nDJ Mister Cee\nWho is the man with the master plan?\nHe goes by the name of the Big Daddy Kane\nThen it goes a little something like this...]\n\nYes, here we go, on with the show\nAs the rhythm of this starts to flow\nNo matter the tempo, fast or slow\nGet up and dance cause the Kane said so\nThis is the dance floor groove of the album\nPresented to you all live from Calvin\nWhoops! I meant to say Mister Cee\nThe disc jockey down with me, the\nMicrophone lord, my wisdom is a sword\nTry to get with us, and get floored\nSome DJ's try to front, but yo don't let them fool you\nCause wine is fine, but Calvin is cooler\nJump up and down, and eh, and all around and\nCheck out the way that my DJ is sounding\nOn the turntables to keep the crowd stable\nKilling the cuts putting bodies on a record label\nAnd just for the symphony\nHere comes the M.I.S.T.E.R.C.E.E\nTaking a stand like a band\nMister Cee got a master plan\nHit it!\n\n[Who is the man with the master plan?\nDJ Mister Cee...on the mix] (x4)\n\n[Kane speaking as Cee cuts it up:\nWhooo! yeah, warm it up, Cee...uh!\nC'mon now, make it happen, make it happen\nGo hit me one more time, c'mon Cee warm it up\nYeaaahh... that sounds funky!\nI, I mean like extra crazy stooopid def!\nHit some of them transformers hops\nAgain, again, again\nUh! Uh! Uh!\nNow, yo, tell yourself a song]\n\n[Getting ready to, (various samples), oh, oh, oh, oh, oh, oh (x12)\n(Samples, in order): play it, let go, feel it, come out, clap to this\nMove your body, get fresh, go go go, I'll do it, do it again, hit me\nHnn--drop!]\n\n[Big Daddy Kane in the house!\nBig Daddy (x2) Biz: huh, huh! (x2)\nMy man, my mellow]\n\n[Who is the man with the master plan?\nDJ Mister Cee...on the mix] (x4)\n\n[Oh Mister Cee, Oh Mister Cee....]\n\n[Kane: Now, just to let you know\nI go by the name of Big Daddy Kane\nI got my DJ Mister Cee in the place to be\nAlso the engineer all-star Marley Marl\nNow yo, cut, won't you do me a favor\nAnd tell these party people where you from]\n\n[LG, LG, LG...rock on, rock on....]\n\n[Kane: now, since we on the tip of our neighborhood\nWon't you tell them where I'm from?]\n\n[Lewis...Avenue! Lewis...Avenue!...]\n\n[Kane: Okay, now I got a brother by the name of Mad Money Merc\nNow he come from NA Rock\nI got two dancers, Scoob Lover, Scrap Lover\nThey come from the place known as Brownsville\nMy barber name is Smooth, he come from Whitecourt\nAlso, we got the engineer all-star Marley Marl in the place to be\nAnd he come from the area known as the Bridge\nNow yo...]\n\n[Mister Cee interrupts: yo, hold up Kane!\nYou done said all your names on your record\nIt's time to say names on my record now\nYo, I want to say what's up to my man ATL\nMy man Shack Money\nMy man Shep Love and the entire LG Posse\nI wanna say what's up to my man Moose Love\nMy man Nut, Sambo, Heado, the TCF dancers\nYo, I want to say what's up to Dawn\nI want to say what's up to Nicola\nMy man Rhythm Shawn, Shimsho, Yam Love\nSpike D, Willie D, NA Rock, Chicago, yo!\nYo! I can't hold it back! [It's over, it's over]\nLater for it, yo! [Shut the fuck up!]\nWhat's up?!\nTo the whole....(cracks up)\nNigga dissed me!", "image": "https://images.genius.com/a3044a73939ccd541c13cf37d29d70bb.1000x1000x1.jpg", "year": "1988-06-28", "title": "Mister Cee’s Master Plan", "album": "Long Live the Kane"}]}