{"songs": [{"album": "Gas Nation", "year": "2008-01-01", "title": "My Niggaz", "image": "https://images.genius.com/9efead5cb97d59ee680d8ce8a526d23b.500x500x1.jpg", "lyrics": "[Intro: J. Stalin]\nYeah, man, it's your boy J. Stalin\nMan, you feel me\nI'm just sittin' here lookin' at this photo album, man\nI got a lot of niggas that ain't here no more\nMan, you feel me, man?\nShit, damn near brought tears to my eyes, man\nMan, you know what I'm sayin'\nLet y'all know how I feel about that\n\n[Verse 1: J. Stalin]\nSeems like high school was just around the corner\nNow everybody and their mama posted on the corner\nI used to play Madden 'til the sun came up\nLook mama, I'm a star now, your son done came up\nYou're in good hands, surely you ain't gotta worry\n'Cause I can see through the fog, even when it's blurry\nHopin' Jazz and Dame come home in a hurry\nI rock thirty-thousand, nigga, and wasn't urgent\nMy niggas on they way if I tell that it's urgent\nFresher than detergent, dressed to impress\nYup, that's them niggas from the West\nHad to bury a lot of soldiers, but we still blessed\n'Cause them cops kept us stressed\nThey paid in the long run\nMe, I got on my grind and see I had a son\nWe used to smoke weed and knock money by the tons\nThis was way before we was playin' with guns\n\n[Hook: J. Stalin]\nAnd ain't no niggas like my niggas\nI miss my niggas\nI'm lookin' at these pictures\nIt's funny how the 90's came and gone\nThinkin' about the days when we used to get our mash on\nAnd ain't no niggas like my niggas\nI miss my niggas\nI'm lookin' at these pictures\nIt's funny how the 90's came and gone\nThinkin' about the days when we used to get our mash on\n\n[Verse 2: J. Stalin]\nDon't ask me, I'll tell you the Hennessy take the pain away\nBut shit, I miss her more and more everyday\nWhat's up Greedy, [?]\nI know everybody got somebody to tip away\nSee, I'm a Mar brotha, you could believe that\nStalin on the suade to a platinum plaque\nI do it for the ones with crack addicted mothers\nAnd niggas with RIP, take two's of they brothers\nThe ones who let the pressure, man the system take them under\nDon't trip, I understand why you picked up that bundle\nAnd call it a city, but we call it a jungle\nI just wanna tell you I ain't shit without my homeboys\nThat's why when I'm on stage, they right there with the toys\nLil Ricky, Nar, L, I see y'all\nWe them niggas, mothafucka's wanna be y'all\nGuess what, this is Cypress Village roll call\n\n[Hook: J. Stalin]\nAnd ain't no niggas like my niggas\nI miss my niggas\nI'm lookin' at these pictures\nIt's funny how the 90's came and gone\nThinkin' about the days when we used to get our mash on\nAnd ain't no niggas like my niggas\nI miss my niggas\nI'm lookin' at these pictures\nIt's funny how the 90's came and gone\nThinkin' about the days when we used to get our mash on\n\n[Verse 3: J. Stalin]\nI'll bust a head for Gun\n'Cause he'll do the same thing\nGo through the street measures for the Cy-Vi gang\nMy family mean more to mean than an iced chain\nWhere I'm from, 5-0 pick em' up like a crane\nI ride with lil K, nigga, blood is blood\nAnd me and Maybach'll go slug for slug\nWith who-ever, whenever, any given time\nHow you gon' see down the right path when you blind\nOn the cloud, he'll bend the world, I still shine\nSearching deep in your heart and you shall find\nThe strength that you need to get you past the time\nI keep it real, smokin' weed, jottin' down the lines\nWhen you livin' that life, got you peakin' out your blinds\nIf I could I'd take back the hands of time\nBut me? I'm just talkin' 'bout the shit on my mind\nMe? I'm just talkin' 'bout the shit on my mind\n\n[Hook: J. Stalin]\nAnd ain't no niggas like my niggas\nI miss my niggas\nI'm lookin' at these pictures\nIt's funny how the 90's came and gone\nThinkin' about the days when we used to get our mash on\nAnd ain't no niggas like my niggas\nI miss my niggas\nI'm lookin' at these pictures\nIt's funny how the 90's came and gone\nThinkin' about the days when we used to get our mash on"}], "artist": "J. Stalin"}