{"songs": [{"image": "https://images.genius.com/0e1f124f48c2edf75255aa6292bdf2b5.600x600x1.jpg", "title": "First Blood", "album": "Die!", "year": null, "lyrics": "[Verse 1:]\nSpecial forces, professional with a four-fifth\nCongressional medal shit\nAggression will get you split\nAvoid explosions with agility, mentally exploit the vulnerabilities of my enemy\nLast survivor, a master diver, fastest driver, liver than MacGyver on visor\nAye aye sir\nFlashbacks of blasting gats, flack jacket backpack fuck you bastard, attack\nGuerrilla tactics, military practice, boobytrap set, get the match lit\nDon't get captured\nFuck George W on a voyage for POWs destroyed villages\nRubble, pillaging trouble\nKilling children villains with submachine guns, generals drilling them\nA grunt can't front, there's no where to run to\nWar hero like DeNiro in Deer Hunter\nFirst Blood\n\n[Hook:]\nI draw first blood, it's over with and that's that - [[Prodigy]]\n(It's over!)\n(Nothing is over!)\nIt's similar to Vietnam\n(You just don't turn it off! It wasn't my war! You asked me and I didn't ask you! Who are they to protest me, huh?)\n\nI draw first blood, it's over with and that's that\n(It's all in the past now.)\n(For you!)\nIt's similar to Vietnam\n(For me civilian life is nothing! I was in charge of million-dollar equipment! Back here I can't even hold a job parking cars!)\n\nI draw first blood, it's over with and that's that\n\n[Verse 2:]\nMissing in action, I'm a get you back soon\nInteractions like shrapnel fractions that hack limbs\nNam jungles holding guns in holes\nLungs full of smoke, shooting mongrels\nYour son got killed, parachute down and shoot down enemies\nNothing cute, brutal like a barracuda frown\nKnives, bows and arrows penetrate bone marrow\nYou're leaking haemoglobin marinara\nCommando send shocks like Pendo(?) bucking to kill\nCut up your grill like Nandos\nKilling enemy troops, many in groups\nApproach em like roaches\nHo Chi Minh trail, hit em with explosives\nBuenos noches, no chance to live\nBrains on the floor looking like poached eggs\nTorturous punishment, banana clips, helicopter gunships, veteran friendship\nI'm a get you\n\n[Hook]\n\n[Outro: Samples]\nMy friend is all over me! I've got blood and everything and I'm tryin' to hold him together! I'm puttin'... the guy's fuckin' insides keep coming out! And nobody would help! Nobody would help! He's saying, sayin' \"I wanna go home! I wanna go home! \" He keeps calling my name! \"I wanna go home, Johnny! I wanna drive my Chevy! \" I said \"With what? I can't find your fuckin' legs! I can't find your legs! \""}], "artist": "Necro"}