{"songs": [{"image": "https://images.genius.com/7e114d4e83f8c99e3e538eec05b723a3.500x500x1.jpg", "album": "Generation Gaming XII", "title": "Family ’68", "lyrics": "[Verse 1 : Dan Bull]\nBrother\nWhile you were here playing beer pong\nI was dealing with the viet cong\nMe and my familia, we are strong\nA real bond\nSo string along, I'm gonna sing a song\nNow bring it on\nWho are you? Hey, hey, who are you?\nClay I'm just a boy from the Bayou\nThere's a battle raging, man and nature\nBut if you can navigate the salivating alligators\nHell awaits you\nSee you at Sammy's place an hour later\nAnd do a man a favour 'cause I'm outta paper\nGrab the tab and pay the round\nAnd get yourself a drink to drown your sorrows and a chaser\nDown it straight and then head out onto the town for capers\nMy knuckles got a couple scars from scuffles in bars\nOver shuffled cards, I hustle hard\nThere's a shovel in the trunk of my muscle car for when the trouble starts\nSome dogs are only loyal 'till you pull the muzzle off\nVisibly twitchy, there's a reason you're fidgety\nMust be the midges, heat and humidity, breeding stupidity\nBitch\nWe've no need for your sympathy\nConcealing your bigotry beneath a sheet of duplicity\nAnd revealing your inner beast\nDown in the deep south we do it differently\nI mean if you're feeling me\nDead in the middle of river row, little did we know, that we riddled two middlemen who didn't do diddily\nOh\nThis is New Bordeaux (Bordeaux)\nSo what's a few more schmoes?\nAsking for their ass kicked?\nThat's their last trick\nHow'd you like the bottom of a swamp for a casket?\n\n[Hook: Dan Bull]\nUntil you've had it all taken away, you'll never know\nThe meaning of family\nOnce you've had it all taken away, then all you'll want's\nTo be in a family\n\n[Verse 2: NemRaps]\nThe new black mob, courtesy of Bourbon Street\nMight not know me but you heard of me, certainly\nThe Marcanos tried to murder me, but when I pull the heat\nMy people started rising like mercury\nThe Italian Mafia, killed without mercy\nSo now it's time to turn this town topsy-turvy\nIf you in the family, then you getting amnesty\nWe plan to bleed these heathens from the city like a damn disease\nNew Bordeaux, my residency\nAnd I can't control what the residents see\nSo me and my conglomerates, shall remain anonymous\nI'm out for dead presidents to represent me\nPut you in a coma not induced medically\nFeed you to the creates not leaving a shred of evidence\nEvidently I need to break it down, so lemme see\nIf you keep messing with me, you'll be a swamp delicacy\nThe only cocktail you drink is molotov\nThere'll be a few scorched men in New Orleans when we catch 'em nodding off\nBullets will be tossed across ya noggin\nKeep on talking and we'll pop you like a bottle top\nAnd transport you out of state\nWe dump bodies before they can draw the chalk lines\nYou can vanish without a trace\nSafe to say, my serrated blade'll ruin y'all\nStabbed so many times, I got you looking like a voodoo doll\nWar is what it's time for, go and grab a knife or a shotty\nTurn a sight for sore eyes into an eye sore\nGot your body floating downstream towards the 9th ward\nFamily isn't who you're born with, it's who you die for\n\n[Hook: Dan Bull]\nUntil you've had it all taken away, you'll never know\nThe meaning of family\nOnce you've had it all taken away, then all you'll want's\nTo be in a family", "year": "2016-10-09"}], "artist": "Dan Bull"}