{"songs": [{"image": "https://images.genius.com/13446bc3cf170903a07fb62b46e86588.700x700x1.jpg", "year": null, "lyrics": "[Verse 1: Alex Wiley]\n\nOkay, I been, I been high for way too long\nI just came to show face, okay?\nAin’t trying to stay too long\nI just do my own thing, okay?\nAnd hope it all work out\nTrying to set the bullshit a blaze\nAnd hope it all burn down\nAnd niggas ain’t shit if they spitting\nThey ain’t spit it like I do\nNigga why you looking around I’m right by you\nAct stupid enough they might sign you\nI’ve been killing shows from NY to the Bayou\nAnd you can keep your fucking take on what I do\nI bet it’s super fucking fake when I smile\nNever thought I’d envy a child\nThey way they so free, so honest, so wild\n\n[Bridge]\nBut, I just hope that you’re feeling the same\nI just hope that you’re feeling the boy\nI just know that I spit it insane\nI just know that I’m filling the void\nWeak niggas I’m finna destroy\nI be gunning shit up when I came\nKnow we left as the end of the story\nWhen it’s all said and done you seem like a rock\nCream always gone rise to the top\nLil nigga we killing the noise\n\n[Hook] 2x\nNow I only put down good vibrations\nI don't even see the lows\nTunnel vision to the paper\nI don't really need you hoes\nBut if I like her energy\nThen motherfuck her body count\nAuthenticity I need\nSo please don't change on my account\n\n[Bridge 2] 2x\nI don't think they understand\nI'm my own man\nI'm a grown man\nYou are not my homies\n\n[Hook] 2x\n\n[Verse 2: Alex Wiley]\nV's up nigga! V's up nigga!\n20 years in the wind\nBeen on the line\nBeen on the run\nThis shit blazing hot\nThis shit from the sun\nSo then stop seeing her\nTry to think of someone else for once\nAiyo you would've think I would've made me a big shot by now\nIn Chicago you gone fuck around and get shot right now\nPhone blowing up all my things like right now\nShe's trying to come over, bitch not right now\nNever feel low when I'm filling my tank\nAnd my niggas around me tell me I'm spilling my drink\nOk, ok hear that Monday, sluts all on me, feel the hate\nCrabs legs, these lamb chops, this prime rib so viscous\nGot a set of twins that's gone set the table\nAnd a naked bitch to put the dishes on\nLife's a game I'll give away between your main thing and your mistress\nYou keep bringing me on\nAnd then blink and be gone\nBask in it don't miss shit bro\n\n[Hook] 2x", "title": "Vibration (Extended Version)", "album": null}], "artist": "Alex Wiley"}