{"artist": "Azealia Banks", "songs": [{"title": "Chasing Time", "image": "https://images.genius.com/562c62c890447270513c5bcf8be38475.932x932x1.png", "album": "Broke with Expensive Taste", "lyrics": "[Intro]\n(Damn nigga damn, took a chance on ya, double and dipped again)\nGO!\nYou could do your dance\nTake a chance with your lover like this began!\nSing\n\n[Verse 1]\nI want somebody who can take it apart\nStitch me back together make me into who I wanna be\nBut all you ever do is sit in the dark\nDealing with the Devil, you ain’t never ever gonna be mine\n\n[Pre-Chorus]\nCause I’m born to dance in the moonlight\nI feel like spending my nights alone\nI try to give you a little more space to grow\nWhite lies, I don’t wanna be around anymore\nI’m through giving, I’ve got to go....\n\n[Chorus]\nAm I chasing time?\nCause I wasted all mine on you (you)\nAm I chasing time? (time)\nCause I wasted all mine on you (you)\n\nCheck my watch, I had the future in my pocket\nBut I lost it when I gave it to you (you)\nIf tomorrow drops, I had my time right in my locket\nBut I lost it when I gave it to you (you)\n\n[Verse 2]\nDamn, nigga, damn\nTook a chance on you, double and dipped again\nAnd, scram, nigga, scram\nHit your mans up and tell ‘em to get the van\nAnd reminiscing can't\nBring it back to the cabin in Michigan\nBut man, this the plan\nSay goodbye to your lover cause this the end\n\n[Pre-Chorus] + [Chorus]\n\n[Bridge]\nYo, get lost hit the highway, freeway\nWe've been off-course like the wrong-way relay\nNeed me a boss, you’re a constant delay\nThese the kinda thoughts I've been having for three days...\nFeel like you’re more of a homie\nPlease, you don’t even know me\nYou think I’m starting new relations\nI’m just departing and need my space and\nTime to myself, ventilation\nNo time for you, I lack the patience\nAnd you’re like, “Girl, how you do that?\"\nMy attitude is bitchy but you already knew that...\nAnd since we can’t get along\nI think we should both move on\n(GO!)\n\n[Pre-Chorus] + [Chorus]", "year": "2014-09-15"}]}