{"songs": [{"year": "2011-10-14", "album": "The Nebulizer", "image": "https://images.genius.com/108c1549cb9fa7e49685238b78f6936d.600x600x1.jpg", "title": "Kerser Is The Sickest", "lyrics": "[Intro: Kerser & Charlene Dunne]\nTired cunt?\nKerser is the sickest, learn about it\nKerser is the sickest\nFuck's doin'?\nYeah\nOi cunt!\n\n[Verse 1: Kerser]\nIn the studio with Nebs and, yep, we pop anything\nXanax with Endone and some cough medicine\nNah, you're not gettin' 'em hyped, from offsettin' my mic\nI'm what excellence defines to be better described\nKerser, I'm your boyfriend's favorite\nBut then they get the shits 'cause their girlfriends play it\nPeople love me yeah, only hated by a whack bunch\nProbably 'cause my crew jacked their shit and left 'em smacked up\nDon't hate the player, they say hate the game;\nYou're why I hate Aussie rap so you can take the blame\nI see coppers and I laugh 'cause you're not my equal\nI'm sellin CDs and yeah this shit's legal\nThis is easy, gang shit, gutter rap\nSpoken from a street view so you can't fuck with that\nI want something back, I'm charging with interest\nDon't say \"what\" to me, it's \"beg your pardon\" you bitches\n\n[Hook: Charlene Dunne & Kerser]\nKerser is the sickest, kers-kerser is the sickest\nKerser is the sickest, kers-kerser is the sickest\nFuck all you bitches, fuck-fuck all you bitches\nKers-kerser's at the club man, I'm the sickest cunt\nKerser is the sickest, kers-kerser is the sickest\nKerser is the sickest, kers-kerser is the sickest\nFuck all you bitches, fuck-fuck all you bitches\nKers-kerser's at the club man, I'm the sickest cunt\n\n[Verse 2: Kerser]\nThe attitude on me, you think it's fucked, ayy?\nI don't give a fuck, fuck face\nI'm in the southwest, trooper soldiers by my side\nYou're with your girl, she sees the crew and she's like \"bye bye guys\"\nHow the fuck you know and where the fuck you been now?\nHow you know her? They're laughing like \"see lad?\"\nIt's a hell of a life, I might just yell on the mic\nI'm the relevant guy you're the irrelevant type\nDo you get me? Nah\nI fuck around until the world, till the west is up\nYou're a festy cunt, you're not as fresh as us\nI'll slap your little sister down till she gets me drugs\nI'm on the bestest buzz, a straight reckless cunt\nI'll leave your party laughin' with your fuckin' necklace tucked\nYou got a sec ya slut? Well hit the deck you mutt\nYou need to check what's up, I got a nest of buds, what?\n\n[Hook: Charlene Dunne & Kerser]\nKerser is the sickest, kers-kerser is the sickest\nKerser is the sickest, kers-kerser is the sickest\nFuck all you bitches, fuck-fuck all you bitches\nKers-kerser's at the club man, I'm the sickest cunt\nKerser is the sickest, kers-kerser is the sickest\nKerser is the sickest, kers-kerser is the sickest\nFuck all you bitches, fuck-fuck all you bitches\nKers-kerser's at the club man, I'm the sickest cunt\n\n[Verse 3: Kerser]\nYou make me laugh there, saying your producer is fresh\nAre you a dumb cunt lad? My producer is Nebs\nEnough said we'll bump heads with all of ya's\nWe can brawl with words, I've got some terms that'll corner ya's\nWhat they gonna do when I get to the spit?\nNow I got em in position, make 'em tap out by submission\nYou see me brother with your CD cover\nHave to leave it on the curb for you to ever be gutter\nMotherfucker got a buzz on the street\nThey hold GotBeef events, cunts come to see me\nI can brag what I do, yeah sad 'cause it's true\nThink I give a fuck about a toy lad with a crew?\nI do it properly from street talk to comedy\nHonestly, gotta be, watching me, topple these\nWhack rappers and backpackers laid out\nI'm coming from the street so we never had the same route\n\n[Hook: Charlene Dunne & Kerser]\nKerser is the sickest, kers-kerser is the sickest\nKerser is the sickest, kers-kerser is the sickest\nFuck all you bitches, fuck-fuck all you bitches\nKers-kerser's at the club man, I'm the sickest cunt\nKerser is the sickest, kers-kerser is the sickest\nKerser is the sickest, kers-kerser is the sickest\nFuck all you bitches, fuck-fuck all you bitches\nKers-kerser's at the club man, I'm the sickest cunt\nKerser is the sickest"}], "artist": "Kerser"}