{"artist": "Cappadonna", "songs": [{"title": "Get Away From the Door", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Cappadonna]\nYo! Get away from the door\nEverybody get the fuck back\nStaten Island, stand up\n\n[Verse 1: Cappadonna]\nI live a street life, nothin' but hard times and strife\nI be stuck on the block try'nna make things right\nSold crack for a living, now I could write\nNot just for the paper, for the sacrifice\nVibe with me, the cops come ride with me\nI'm all in the hood, yeah nigga, slide with me\nIf the feds start lookin' for Don, survive with me\nExperience my ill pain, the broke windows in the rain\nCrackheads goin' insane\nMarlo stuck dope in his vein, lift him up\nBodies in the back of the hood, stiffen up\nIt get ugly and shit, why it gotta be this?\nWe came a long way, fuck cheaters\nWe don't wanna bust the Heaterz\nNo speakin' on the phone, we don't trust receivers (yeah)\nPark Hill be the real niggas and Don' Divas (it ain't over, it just begun)\n\n[Chorus: Inspectah Deck]\nEnough of your bullshit, my niggas'll pull quick\nBerettas and full quicks, guerillas and convicts\nArmed and dangerous, bombs and bangers, kid\nStormin' the game with it, calm but anxious and\nI'll whip yo ass for this, come with the cash or it's\nOn with the blast and it's, gonna get hazardous\nNiggas should know by now, niggas should know my style\nShaolin, hold me down, frontin', there goes the pow!\n\n[Verse 2: Cappadonna]\nWhy it gotta be like this\nPolice fightin' us with night sticks, niggas carryin' ice picks\nSometimes, niggas we do crimes, I ain't gotta tell you\nNiggas throwin' up signs, niggas shipped to Bellview\nSon, don't let coke dog smell you\nRun if you packin' something, do what I tell you\nSkate, nigga, never let jake nail you\nI got caught up in the grind but I fell through\nNow I'm back on the spot, keep my eye on you\nMake a phone call, kid, or put a spy on you..\nAnd this is dedicated to all my niggas in the ghetto\nBig dimes and C Rule, jugs of Palmetto\nI'm in too deep and I just can't let go\nCatchin' my pain, real niggas that respect dough\n\n[Chorus: Inspectah Deck]\nEnough of your bullshit, my niggas'll pull quick\nBerettas and full quicks, guerillas and convicts\nArmed and dangerous, bombs and bangers, kid\nStormin' the game with it, calm but anxious and\nI'll whip yo ass for this, come with the cash or it's\nOn with the blast and it's, gonna get hazardous\nNiggas should know by now, niggas should know my style\nShaolin, hold me down, frontin', there goes the pow!\n\n[Outro: Cappadonna, sample of Louis Farrakhan]\nIt's my world!\nFucked up, stick 'em, ugh\n2-4, Graveyard Shift\nThe names and the faces have changed\nBut the game, is still the same…"}]}