{"artist": "G-Eazy", "songs": [{"title": "Groupies", "album": "The Epidemic LP", "year": "2009-01-01", "image": "https://images.genius.com/5b719fd20e56357b25606586e909ef17.500x500x1.jpg", "lyrics": "[Hook]\nFollowing the stardom wherever we be\nTryna find your way back to VIP\nWe all know me sorry you're a groupie\nAnd that means you gets no money from me\nTryna chase after the fame, you're a groupie\nYou don't even know my real name, you're a groupie\nWhere were you before I came up? you're a groupie\nPlease come on step your game up, you're a groupie\n\n[Verse 1]\nThis club is getting crazy I swear I'm about to leave soon\nGroupies finna make it to the VIP soon\nSome new locks we'll need soon\nThey damn near pushing breaking down the door to the green room\nSecurity where you at? we need assistance\n30 gold diggers and they blocking off the entrance\nTryna catch a glimpse like I swear their sixth sense is\nAlways know where we finna be and these bitches are crazy\nDie hard, full of ambition\nA seven nation army couldn't stop their mission\nWith 007 precision they be on us\nAnd they ain't giving up until the mission is accomplished\nNever work alone now, always work with an accomplice\nGot they co-workers with them pros never novice\nBut on the real tip if I'm honest\nMan these groupies work so damn hard I'm astonished\n\n[Hook]\nFollowing the stardom wherever we be\nTryna find your way back to VIP\nWe all know me sorry you're a groupie\nAnd that means you gets no money from me\nTryna chase after the fame, you're a groupie\nYou don't even know my real name, you're a groupie\nWhere were you before I came up? you're a groupie\nPlease come on step your game up, you're a groupie\n\n[Verse 2]\nShe'll do anything for me if I tell her do chores\nTake your clothes off mommy go and lose yours\nTold them straight up we don't like loose whores\nBut these bops keep sweating me like loose pours\nAnd no lie it's really that deep\nTryna get backstage trying to creep\nKicking till they try to find a plot to get in\nYelling at the bouncer talking 'bout \"I know him\"\n(No you don't)\nSome groupies get bold and wanna chase after me\nSome groupies get shy and keep staring at me\nSome groupies go bad but won't say it to me\n\"I don't see the big deal he's still Gerald to me\"\nEither way a groupie is a groupie\nActing like Lucy off of Charlie Brown but I'm more Snoopy\nI'mma dog, ain't trickin off a dollar for these rappers\nIt makes no difference cause nothing's gonna stop her\n\n[Hook]\nFollowing the stardom wherever we be\nTryna find your way back to VIP\nWe all know me sorry you're a groupie\nAnd that means you gets no money from me\nTryna chase after the fame, you're a groupie\nYou don't even know my real name, you're a groupie\nWhere were you before I came up? you're a groupie\nPlease come on step your game up, you're a groupie"}]}