{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/32566b274cb74d5e9bf6c13c96685a89.1000x1000x1.jpg", "year": "2017-04-04", "album": "Long Live Nut", "lyrics": "[Chorus]\nUh, uh, you know we way up\nI done lost my man on the way up\nLost a couple bands on the way up\nHad to change the plans on the way up\nNow I'm on my way up, can't wait to wake up, yeah\nEvery day a nigga on his way up\nTryna get there, when I get there, I'ma stay up\nYeah, I'm on my way up, yeah\nYeah, when you way up\nWhat they gon' say when you way up?\nEverybody gon' hate when you way up\nI ain't at the top yet, I'm on the way up\nOn the way up, way up, yeah\nI done came far I'm on the way up\nTryna get there I'm on the way up\nI ain't at the top yet, I'm on my way up, yeah\n\n[Verse 1]\nWhat nigga want war with us?\nNigga talk shit but they quiet when they see me\nI'm in that new thang, out ridin' like a genie\nThis a 450, this is not a Lamborghini\nAnd they know that we gon' eat, we want business\nKnow that we gone beef 'bout a penny\nKnow if we don't eat, we don't sleep\nAin't no peace, we gon' creep with them semi's\nThat judge put a nigga in that chair like a dentist\nWho you know on one leg still runnin' shit?\nThat chopper got a full ass drummer kit\nMy neck and wrist ear and my momma lit\nTryna cop another Benz before the summer hit\nNow a nigga way, way up like a motherfuckin' blimp\nWe done had to came up, blowed up, got a grip\nWe done fuckin' blowed up, ayy, now we way up like a blimp\nWe done fuckin' blowed up, ayy, do it\nPull up in the coupe with the doors up, nigga\nI done fucked your bitch with my homeboys, nigga\nGot these hoes sewed up like a overall, nigga\nYeah and overall still I'm over y'all niggas\nUh, bank first place later, save now fuck later\nGet the pussy, boy, gon' now fuck later\nI'ma get the money now then fuck later, yeah\n\n[Chorus]\nUh, uh, you know we way up\nI done lost my man on the way up\nLost a couple bands on the way up\nHad to change the plans on the way up\nNow I'm on my way up, can't wait to wake up, yeah\nEvery day a nigga on his way up\nTryna get there, when I get there, I'ma stay up\nYeah, I'm on my way up, yeah\nYeah, when you way up\nWhat they gon' say when you way up?\nEverybody gon' hate when you way up\nI ain't at the top yet, I'm on the way up\nOn the way up, way up, yeah\nI done came far I'm on the way up\nTryna get there I'm on the way up\nI ain't at the top yet, I'm on my way up, yeah\n\n[Verse 2]\nUh, uh, I won't stop until I win\nI don't fuck with no fake friends\nNiggas talkin' blocks then we want in\nKick 'em off the block if he ain't comin' in\nI remember when I came home vert\nRemember puttin' change in my baby mama purse\nI'm glad thangs changed and it ain't get worse\nThem niggas tellin' names but that ain't gone work, yeah\nUh, I'm a motherfuckin' stoner\nWhole hunnit to my mama, gave her a whole hunnit\nThat's a whole hunnit\nLil' nigga, I'm a roadrunner\nBust down on me, 50 whole pointers\nThem niggas takin' swag, yeah, they stole from us\nWhen we out of grass then the snow comin\nI ain't gotta brag 'cause my numbers gon' show for me\nClearport, every time we flyin'\nKnow we get 'em 10 times 10 at a time\nThem niggas talkin' mad, get my mans on the line\nYou know when my mans mad then everybody dyin'\nUh, now a nigga way, way up like a motherfuckin' blimp\nWe done fuckin' came up, blowed up\nYou a shrimp, they don't bring my name up\nNiggas know they ain't us, yeah, ayy, uh\n\n[Chorus]\nUh, uh, you know we way up\nI done lost my man on the way up\nLost a couple bands on the way up\nHad to change the plans on the way up\nNow I'm on my way up, can't wait to wake up, yeah\nEvery day a nigga on his way up\nTryna get there, when I get there, I'ma stay up\nYeah, I'm on my way up, yeah\nYeah, when you way up, what they gon' say when you way up?\nEverybody gon' hate when you way up\nI ain't at the top yet, I'm on the way up\nOn the way up, way up, yeah\nI done came far I'm on the way up\nTryna get there I'm on the way up\nI ain't at the top yet, I'm on my way up, yeah\n\n[Outro]\nNiggas talk shit but they quiet when they see\nUh, uh, what nigga, what nigga?\nUh, uh what nigga want war with us?\nNiggas talk shit but they quiet when they see me", "title": "Way Up"}]}