{"songs": [{"album": "Absolute Power", "image": "https://images.genius.com/478a9ba0370b10241e03f91f6e741b36.1000x986x1.jpg", "year": "2002-09-24", "title": "Bianca’s and Beatrice’s", "lyrics": "[Intro: Tech N9ne, Kutt Calhoun and random woman]\n[T] Let's go holler at her real quick\n[K] Ooh shit, we gotta do that\n[T] What's your name baby?\n[W] Bianca...\n(Tech and Kutt both start laughing)\n[W] What'chu laughin' for?\n[T] (still laughing) Ah nothin', nothin' baby it's cool, you know what I'm sayin\n\n[Hook:]\nBianca’s and Beatrice’s are known for wettin' mattresses\nAnd bendin' over in the ill positions\nBianca's and Beatrice's they love the way I'm rappin' this\nI dig 'em then I pluck 'em then I diss 'em\n\n[Verse 1: Tech N9ne]\nI'm kickin' it wit' this chick up in the club I'm off the Lou\nAnd when you're on that Caribou you know just what you do\nI called her Bianca, then she said \"What is that Bianca shit?\"\nI looked and cracked a smile and said Bianca means you, bitch\nYou's a Bianc' baby, whether you like it or not\nBut you hot especially when x and vicodin popped\nIf you trippin' you can hike it and hop\n'Cause you know what I came to do\nMe and my villains come to strike it and stop\nPipe it and prop, ya leg up and get up\nBianca hold ya head up, ya sex wet the bed up\nEverybody's ponderin', wonderin' about my slang that I spit\nYou can use it when you refer to a dame or a chick\nDon't be trippin' about the choice of words I'm usin' on this script\nDon't step off in my face 'cause you can bet I come equipped\nYou wanna know what to say to get the Bianc' to let you blend? (What?)\nHotel, motel, Holiday Inn!\n\n[Hook x2]\n\n[Verse 2: Kutt Calhoun]\nYou that new green nigga Kutt Calhoun (Who that?)\nYou know that big-lip pretty nigga wit' the gold teeth (oh) be rapping with Tech\nHeard he just signed a big deal, an estimated 5 or 6 million\nThat nigga fine if he willing, I'ma blow his mind (bitch!)\nBig lips and all the things involved got your whole brain dissolved\nYou couldn't squeeze in these drawers if you was my dick and balls\nI tell you man, theses dames are lame, greedy, raunchy, and dykes\nA nigga gets a bit of fame and Bianca’s be like:\n(Sow yo' ro-yal oats,)\nBeatrice's sayin' (Hell yeah yeah yeah yeah)\nBut Kutty be like (Ho no slow yo' roll)\nBuffoon to busy tryin' to zoom off into the (upper room!)\nClaiming they Cath-o-lic, licking asses, off ecstasy\nWeed and hashes, and hits of acid, addressing me\nJust ‘cause I rap, bitch you gettin’ nasty\nGone wit'cho nasty ass pizzazz ashy slash sassy, Beatrice!\n\n[Hook x2]\n\n[Verse 3: Tech N9ne]\nBeatrices means more than one Bianca\nThey actresses, bring 'em sex toys and ganja\nWe activists, ain't no yes boys, we monsters\nAnd macks at this, ring ya best noise we conquer\nThe fact is this: say you don't wanna when you want to\nRelax to this ecstasy and Willy Wonka\nWe slaps a bitch, 'cause me and my niggas are bonkers\nWe stacks the hits, no Coleco, Tyco, or Tonkas\nImmaculate get the motherfucker you honor\nA laxative, 'cause they boo-boo bitin' piranhas\nMy gats'll spit, 'til you player haters are goners\nLike Maximus, I'm gladiator for na-na\nMy raps assist the beat that disturbin' ya mama\nThey scrap to this, welcome wicked witness the trauma\nSo clap to this, while you puffin' yo' marijuana\nGet back to this, (what) Beatrice's and Bianca's\n\n[Hook x2]\n\n[Outro: Tech N9ne talking]\nYo, yo, yo, baby…\nI’m so sorry if your name is Bianca or Beatrice…\nI know they givin' you a hard time about it, you know what I’m sayin'? (laughs)\nEy yo, it’s just some lingo, though, Tech N9ne lingo, you know what I’m sayin?\nMy brother Dyno Mack, he’s a god damn fool, came up with that shit in LA, doe\nBaby I’m so sorry, you know what I’m sayin', if your name is Bianca, and Beatrice, hey…\n(laughs)"}], "artist": "Tech N9ne"}