{"songs": [{"image": "https://images.genius.com/3890b2654f54e40524f08f1c544980d5.960x960x1.jpg", "title": "I Just Wanna Know", "album": "Therapy Session", "year": "2016-04-07", "lyrics": "[Intro]\nYeah\n\n[Verse 1]\nYeah\nOnly time you ever call me\nIs when you feelin' like\n\"Don't nobody else wanna listen\"\nWhen's the last time you saw me?\nYou probably don't remember that\n'Cause that was back then, you were different\nI don't wanna hear the sorries\nI'm tired of all the talkin'\nTo be honest, I would rather see a difference\nYeah, you pass me in the hallway\nBut you ain't say a word to me\nLately, all I ever feel is distant\nYou don't care that you lost me\nWhat's wrong with ya?\nHad a picture of you sittin' on the dash in the car with me\nNow it's in my closet with the other ones\nSittin' in a box I don't wanna open up\nYou took it all from me\nTold me you would die for me\nYeah, all you ever do is lie to me\nWish that I could say that this has come as surprise to me\nTold me that I never took the time\nAnd now you ain't got the time for me, yeah\n\n[Chorus]\nI just wanna know oh, oh, oh, oh\nWhen did you get so cold? Oh, oh, oh\nWhat happened to your soul? Oh, oh, oh\nDon't you see me? (See me, see me)\n\n[Verse 2]\nYeah\nWe used to talk like best friends\nI remember that\nI guess I don't know what happened to us\nNow you got me questionin' what trust is\nYou told me you would be there for me\nYeah, but you ain't really mean it, did ya?\nNow you wanna jump ship\nLeave me here alone\nWell, I'm used to it\nEverybody else did\nWho you havin' fun with?\nDon't tell me, I don't wanna know\nEvery time I ask, I just feel sick\nYou're the one that jumped in\nTold me you had feelings\nNow you tryna tell me that is not true\nI ain't gotta clue who I'm lookin' at right now\nBut I know the person that I'm lookin' at is not you\nYeah, they say that you are who you hang with\nMaybe that's the reason you been changin'\nMaybe that's the reason why I'm feelin' like you're dangerous\nAnd every time we talk it's like I'm talkin' to a stranger, ah\n\n[Chorus]\nI just wanna know, oh, oh, oh\nWhen did you get so cold? Oh, oh, oh\nWhat happened to your soul? Oh, oh, oh\nDon't you see me? (See me, see me)\nI thought that we were close, oh, oh\nBut now that door is closed, oh, oh\nWhen did we lose control? Oh, oh, oh\nGuess you don't need me (Need me, need me)\nI just wanna know, oh, oh, oh\nWhen did you get so cold? Oh, oh, oh\nWhat happened to your soul? Oh, oh, oh\nDon't you see me? (See me, see me)\nI thought that we were close, oh, oh\nBut now that door is closed, oh, oh\nWhen did we lose control? Oh, oh, oh\nGuess you don't need me (Need me, need me)"}], "artist": "NF"}