{"songs": [{"year": null, "image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "title": "26 Inches", "album": null, "lyrics": "(feat. Young Buck)\n\n(Intro:)\nHaha, Blood Raw what up\nHeyya! Young Buck waz happenin homie\nWe gon' start real heavy on this muthafucka right here boy\nLet's get to the money!\nShow you why I'm so mufucking florida nigga\nYeaaaaaa\nCashVille, USDA\nYa'll know what the fuck time it is nigga\nB raw steen nigga\nWe bringing them muthafucka chevys out on this one nigga\n\n(Chorus:)\nI said 26 Inches got me\nSitting so high (x3)\nYea I'm blowin good and I'm\nFeeling so high (x3)\nAnd I'm riding good and I'm\nLooking real fly (x3)\nYou can hear me before you see me\nWhen I ride by (x3)\n\n(Blood Raw:)\nOutside forest green, inside peanut butter\nHigher then a mu'fucka, call that bitch peter pan\nBitch I'm da man, I'm da man\nRiding bluedown, all my niggas spent 100 grand\nShit from florida hoe, I brought the band with me\nYou see this what I do, I call it fam music\nLook how I'm sittin, yea I'm riding green now\nHopper grass grill on it and I'm looking mean now\nSee 14 depped up, everybody blowing purp\nAncient momma paint job, yea it came with the surs?\nHanging out the roof looking down on them crowds\nSomebody must have farted, everybody got frowns\n\n(Chorus:)\nI said 26 Inches got me\nSitting so high (x3)\nYea I'm blowin good and I'm\nFeeling so high (x3)\nAnd I'm riding good and I'm\nLooking real fly (x3)\nYou can hear me before you see me\nWhen I ride by (x3)\n\n(Young Buck:)\n26 inches on my chevy, hope my tires fit\nOld school, old money, 50 ain't buy this\nI just bought a dome, sell me two capris\nThe blue suede interior, the matching baby seats\nPop my hood on these bitches, let me show em what my money like\nHeavy in the game, so I sprayed it cocaine white\nBoose got me loose, 180 7 boose\nSee we don't blow them brains out, we just chop the roof (YEAAA!)\nShe said my chevy cute, it match her gucci boots\nSo now she break me off, everytime I come through\nI can drop the back, pickup the front\nMake it lean to the left, and get right back to the money bitch\nI'm clean by myself, but I'm hell with the crew\nCause if I'm on 26s then my niggas is too\nYea I seen ya looking at me, so shawty what it do\nMe and blood raw rolling, tell jeezy where we going\n\n(Chorus:)\nI said 26 Inches got me\nSitting so high (x3)\nYea I'm blowin good and I'm\nFeeling so high (x3)\nAnd I'm riding good and I'm\nLooking real fly (x3)\nYou can hear me before you see me\nWhen I ride by (x3)\n\n(Blood Raw:)\nShoulders, Chest, pants, shoes (Haha, talk to em)\nSomebody better wipe me down\nI'm feelin good, looking good, you know I'm clean\n(girl voice) you do ya thang\nThey say I show my ass, but I don't mean need too\nLil momma wanna holla, I scooped the whole crew\nI'm in the sky, it's a bird, it's a plane\nYou can hear me 'fore you see me, I'm in it with them thangs\n\n(Chorus:)\nI said 26 Inches got me\nSitting so high (x3)\nYea I'm blowin good and I'm\nFeeling so high (x3)\nAnd I'm riding good and I'm\nLooking real fly x3\nYou can hear me before you see me\nWhen I ride by x3\n\n(Young Buck:) Yeaaaaaaa"}], "artist": "Blood Raw"}