{"songs": [{"image": "https://images.genius.com/6tetlmlkzc3lziitg3f9dor0u.500x500x1.jpg", "year": "2009-07-24", "title": "Gobstopper", "album": "Everybody’s Nobody", "lyrics": "[Hook: XV]\nOpen up the store, they like damn, what you offer?\nI say take a look and see, now they call me Willy Wonka\nNow, I ain't tryna brag, but I be lookin' proper\nThey say \"Boy you stay as fresh as everlasting Gobstoppers\"\n(Repeat x2)\n\n[Verse 1: XV]\nHello, my name is XV, I'm a microphone controller\nWith some goobers in my pocket and a straw up in my cola\nPlay them back, but I'm always on my grind like a moler\nAin't like none of these bogus niggas, make me a new folder\nI be in the cut like a mower\nTryna get my dough, oh, no wonder they call me Homer\nI like to think I'm on the brink of my Odyssey\nAnd mix-matchin' when you see Lil Weezy on his prodigy\nSo why talk about who fresher, who get fresher?\nMy peers ain't on my tiers, so just support the pressure\nNigga I'm the lead role, you ain't even wanna measure\nYou the gum, at the bottom of my shoe, actin' extra\nI make squares seem cool like checkers\nJust tryna stay away from being Bobby Fletcher, bet your\nBottom line dollar, I'm the coolest kid so holla\nJust in case, you gon' say, why they call you Willy Wonka?\nWell\n\n[Hook]\n\n[Verse 2: Wiz Khalifa]\nNotebook, notebook, trapper keeper paper\nWilly Wonka's in my closet, all these flavors\nShop with me, you'll get exhausted\nBroke niggas stay outta Dodge\nThey just can't afford it, yellow starships\nWalkin' out the men's department\nNow look at that bitch ridin' with me, and she gorgeous\nYou 747'in, I'm G4'in, snorin', paper like the NBA, ballin'\nNo look\nBig house\nI don't cook\nMy chick exotic, bring what I want through\nAnd I don't even tell them what I want\nI just throw pool-parties at my hotel room and they come\nDidn't know I'm famous so she claim she ain't a groupie\nYou feed her McDonalds, I'm Nakama eatin' sushi\nGotta lot of loose leaf (paper)\nCome down to dat money boy I'm straight, no chaser, okay!\n\n[Dialogue]\nGirl1 - But what's it do?\nWilly Wonka - Can't you see? It makes everylasting Gobstoppers!\nGirl2 - Did you say everlasting Gobstoppers?\nGirl3 - I want an everlasting Gobstopper\nGirl4 - Me, too!\nGirl5 - And me!\nMan - Fantastic invention, revolutionize the industry\n\n[Hook]"}], "artist": "XV"}