{"songs": [{"image": "https://images.genius.com/77d8b544101985f5eff4b25d138ec004.246x138x1.webp", "lyrics": "[Intro]\nOoh, you dig?\nOoh\nThanks ugly god\nThanks ugly god\nThanks ugly god\nOoh\nThanks ugly god\nThanks ugly god\nGang\nAyy, ooh\n\n[Chorus]\nI'm like \"how it came to this?\"\nIt get dangerous\nNiggas be switching up\nI won't change a bit\nRun up on me if you want\nI got aim assist\nI got aim assist, look\n\n[Verse 1]\nI got aim assist\nI just be makin' it\nStack up the money, i'm saving it\nYou my favorite, when you comb your hair and straighten it\nBut I peep you took a lil bread out my bag when i'm knowin' I had some change in it\nAnd I ain't gon put my hands on you but I bet i'mma make you pay for it\nSay you better give me that money you owe me, or i'm taking it\nTalking that shit about me like you know me, that be the lamest shit\nYeah when I beat from the back it sound like macaroni\nI'm on that wavy shit\nShe on that crazy shit\nLook, I do amazing shit\nHold up, spread a bitch legs like jelly (huh)\nGet her pussy wet like Levi (huh)\nShe just want a brand new bag and a rich nigga baby all in her belly (huh)\nChoppa gon' eat like deli (huh)\nShut up bitch, is you ready? (huh)\nBeat her from the back, so steady (huh)\nShow me bitch, don't tell me\n\n[Chorus]\nI'm like \"how it came to this\"?\nIt get dangerous\nNiggas be switching up\nI won't change a bit\nRun up on me if you want\nI got aim assist\nI got aim assist, look\n\n[Verse 2]\nAyy, my new bitch she do what I tell her\nShe keep a 2-2 in the dresser\nShe step in the booth if I let her\nI can't keep my shoe off the pedal\nGot these bars in the booth (huh)\nAnd these stars on the roof, and the VLONE on my sweater\nHer pussy wet but her momma get wetter\nHer pussy straight, momma still better\nI jump in that bit' with a big ass berretta\nI hop off the stage with a bag of that cheddar\nI tell her I love her and that we forever\nBut I'mma just fuck her one time and forget her\nSeen a few niggas switch up under pressure\nSo I stopped fuckin' with them for the better\nCame in that bit' with a stick for whoever\nTold that lil bit' get the fuck on my level\nThrow it in the back, i'll get it\nI'mma put it on my debit (huh)\nNiggas be stealing my sauce (huh)\nBut don't wanna give no credit (huh)\nAnd I ain't never took no loss from it\nCause it only go as far as I let it (huh)\nAnd bitch just know i'm just trynna fuck or somethin'\nAnd tell your boyfriend that I said it, bitch\n\n[Outro]\nThanks ugly god\nThanks ugly god\nThanks ugly god\nThanks ugly god", "title": "Bless The Booth Freestyle", "year": "2019-09-19", "album": null}], "artist": "Ugly God"}