{"songs": [{"title": "Big Deal", "lyrics": "[Intro]\n\n[Verse 1]\nI wake up every morning on a multi-million mission\nI call my Cali bitch and told her I'm on the way to visit\nMy nigga said he'll sell me a hundred for 250\nDeal done, a hundred of 'em on the way to Memphis\nI stopped in Texas and poured up a pint with Paul Wall\nSlam dunking P's around this bitch like John Wall\nNah I'm a Memphis nigga, I slam them bitches like Marc Gasol\nR.I.P. to Ida Mae and free all my dogs\nI put it all on the line, that's what made me\nMama was drinking when she was pregnant, that's why I'm crazy\nI told the major labels \"fuck you, pay me\"\nFuck you think this is? I just had my new baby\nThe fuck you think this is? I ain't shit like these rappers\nI'm laughing at 'em 'cus them niggas being fake as wrestlers\nSold out shows, bad bitches, and trappers\nI got the streets going stupid, free my nigga Gucci\n\n[Hook]\nWhats up with that Dolph nigga? Whats the big deal?\nHalf a million dollar pack, that's a big flip\nYou ain't gotta bump my shit nigga, yo bitch will\nI see straight through you pussy niggas like a windshield\nSend a hundred shots through a pussy nigga windshield\nI like my bitches small waist, booty real big\nWelcome to Dolph World, that's where I live\nI asked God to help me find a plug and do it real big\n\n[Verse 2]\nIn Dolph World, that's where I live\nIn the hood, that's where I chill\nOn the west coast, that's where I sco'\nDirty Texas tea, that's what I po'\nTwo thousand Franklins stashed in the flo'\nShe thick then I might put dick in yo ho\nWhy they love me? Whats the big deal?\nGrown ass man still riding big wheel\nPush the turbo button, watch the coupe fishtail\nWeed so strong when you cut the plastic it got a shit smell\nNigga that's all we smoking\nNigga that's why I'm choking\nShit so sticky can barely roll it\n\n[Hook]", "album": "High Class Street Music 5 (The Plug Best Friend)", "year": "2015-02-24", "image": "https://images.genius.com/e4d5c5c85823203f05b63def3eca8185.500x500x1.jpg"}], "artist": "Young Dolph"}