{"songs": [{"year": "2009-06-30", "image": "https://images.genius.com/69a36be14d6ea4a081e8b94ff44cbc4e.994x994x1.jpg", "title": "Ain’t Nuttin’ Changed (Remix)", "album": "Tha Blaqprint", "lyrics": "[Intro: DJ Premier]\nREMIX!!!\n\n[MC Eiht]:\nYeah! Yeah! Ye-Yeah!!!!\n\n[Scratch Hook] (Blaq Poet)\n\"When I come through the hood\" - Akon 'I Still Kill'\n(You know it's poppin)\nAin't nothin changed (You know it's on)\nWhen I come through the hood (You know it's poppin)\nAin't nothin changed (You know it's on)\n\n[Verse One: MC Eiht]\n(When I come through the hood) Still reppin the hood\nOn foot patrol with a .38-snub\nHoes lovin the G, one-time's on post\nHopin a nigga snitch, hope he, sellin the most\nGeah, will still follow the code\nCouple of niggas stretched when the work got sold\nKeepin it all hood, dress code never switch\nCompton all day, these G's never snitched\nGhetto birds skip the area (through the hood) they still fly\nReportin the homicide when cars drive by\nAin't a damn thang changed, everybody got vexed\nIn the neighborhood spot, with a couple hood rats\nGeah, niggas for life so it's all year round\nCompton's still the same so you know how we get down\nGeah! Yeah, Eiht get it cracking\nStill a Menace so it be no acting\n\n[Scratch Hook]\n\n[Verse Two: Young Maylay]\n(When I come through the hood) ...I'm in the six-cuatro\nHoppin cause it's hot, the drop and squat the block low (Oh)\nI'm not yo' ordinary thang, manye\nIn L.A., {EXTRAORDINARY GANG BANG}\nTerritorial marks, right on the wall\nBroad day to nightfall, they ain't fightin wit' y'all (Naw!)\nWe poppin and chippin, poverty stricken\nHonestly a lotta robberies are rockin a chick\nAin't nothin changed, we wear khakis and Chucks'\nT-shirts, hat to the back, exactly wassup\nSee you probably like me if you ride with the heat\nI survive and eat, identifyin with the streets\nDon't think I'm a switch, get rich and then front\nCause when I'm finish with this, this where I end up\nEast to westside -- yes, that's on my momma\nMaylay, L.A., popper from the Dodgers\n\n[Scratch Hook]\n\n[Verse Three: Blaq Poet]\n(When I come through the hood) WHAT!!! You know it's love love\nChillin with the thugs and my duns light the dutch up\nNigga what the fuck's up? I'm all good\nYou don't wanna see me runnin up through your hood\nDressed in all black, from head to toe\nGot your own goons sayin \"Why you mess with Po'?\"\nI don't give a fuck, who they say is next to blow\nThey just ringtone rappers and they already know\nWhat?\nAin't nothin changed, I spit flames forever\nI'm hardcore like whips, chains and leather\nI got shit locked, New York to this block\nTime's up, tick tock, move slow, get popped\nOn the real yo I ain't even feelin niggas\nOver twenty years in the game lyrically killing niggas\nReppin my hood checkin the weapons it's good\nSteppigng all over niggas reps in they neck of the woods\n\n[Scratch Hook]"}], "artist": "Blaq Poet"}