{"songs": [{"album": null, "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg", "title": "Dey Know", "year": null, "lyrics": "Paid $100 for some head, nigga, Say you ain't did it!\nI know a lick at 4 mil', nigga, Say you ain't with it!\nNow if we hit this lick, nigga, & you don't want to split it\nThen it's bow, bow, bow to your motherfuckin' fitted, now!\nI don't give a fuck, I don't give a fuck!\nI pull up in that truck, Pull up in that truck\nI run that bitch over, call it Trukfit\nAnd yeah I'm on my own, I'm screamin' \"Fuck it\"\n\nFuck it, I'm whippin' it crazy\nI'm ridin' the foreign, I'm doin' 180\nMy chain so heavy, my brain so deadly\nType of nigga buy the watch & change the bezzy\nThey ain't never seen me comin' like this\nSmokin' on that gasoline in the VIP\nThey need ding-a-ling for the trampoline\nCause all these bitches want to do is jump on the dick\nI hop over fence, I'm offended by co-defendants\nDrink codeine for mornin' sickness\nYour dad was a motherfuckin' snitch, so nigga, you were born a witness\nAllstate, accident forgiveness\nSay my name by accident, We actin' ignorant\nDoing a drive-by while you playin' different\nThis that Me Time at the finest\nYou won't beat me or see me whinin'\nI am gangsta like the Raiders cap with a Jheri Curl on the side\nI like thighs & breasts, I hide from stress\nI don't even know where my phone at\nCrib so motherfuckin' big, I don't even know where my room at!\n\nWhip so fast they say there he go\nBitch so bad, man, I think she know\nTurned 100 to a mill, man I think they know\nDucking on the low, man, I think they know\nI think they know, I think they know\nI think they know, yeah yeah, I think they know\nI think they know, I think they know\nI think they know, yeah yeah, I think they know\n\nI think they know it, if they don't then fuck it I show it\nBlow it like you owe it, ordered a case of Moet\nY'all get to going back to back for us\nAll black like I'm wanted\nGot your bitch zoning, send her back in the morning\nThat money coming, trying to stack it enormous\nYou niggas pussy, fucking rat on your homies\nI think they know it, they know it, they know it\nI got a plane that's sittin round the corner\nI got some bitches here from California\nGot on my chains, I'm lookin like a dope boy\nThese niggas don't want it, I put that on mañana\nMy chain into 100, my belt Ferragamo\nGo to LA, meet the plug at Katanas\nI'm still the king of my city and they know it\nAnd I paint pictures with these words, I'm a poet\nAnd I drop the top on my whip, and we soarin'\nA 50 a check then I'm in it, if niggas stay with it then they get extorted\nAnd I'm gone\n\nWhip so fast they say there he go\nBitch so bad, man, I think she know\nTurned 100 to a mill, man I think they know\nDucking on the low, man, I think they know\nI think they know, I think they know\nI think they know, yeah yeah, I think they know\nI think they know, I think they know\nI think they know, yeah yeah, I think they know"}], "artist": "2 Chainz"}