{"artist": "A$ton Matthews", "songs": [{"title": "NIGHT TO REMEMBER", "image": "https://images.genius.com/7d669a9840e0f66465554b0d91b1f435.1000x1000x1.jpg", "album": "SKREWSDAY", "lyrics": "[Intro: A$ton]\nYeah, yeah, yeah, yeah\nHol' up\nZipper gang shit\nHol' up\nYou wanna play rough?\nOKAY\n\n[Verse 1: A$ton]\nBoy, we was raised from them shoulders\nTurn you to victims or soldiers\nYou smell the death 'round the corners\nBut baby we used to the odors\nYou better pay what you owe us or you’ll be a gift to the Lords\nOu baby, thugging it costs, summertime, block in the shorts\nI'm 'posed to die tonight, see if they stick to the course\nI get the brrrt from the source\nI put the lock in her jaws\n100's and 50's all over them titties, but please baby keep all the locks off my doors\nDropping a 5 in a liter, drop from the top like she Lita\nShe got the throat of a diva and got a face like Aaliyah\nTreat her like I don’t need her, dismissed\nBending corner, wig shopping, ay\nPut you on a shirt and get a day\nZipper gang, we pull up, leave a stain\n1Up, 2Up, 3Up, beat the case\nYoungin's thirsty, lurking for a name\nClose or open casket for the fame\nAll depending how you wanna play\n\n[Interlude: A$ton Matthews & (Da$H)]\nYeah, yeah, yeah, yeah, yeah, we need all that (yeah, so)\nAll that, bitch, you smacked (yeah, so)\nHeadshot, face shot, neck shot, all that (yeah, so x2)\nFlatline, you dig? (yeah, so x2)\nWell\n\n[Hook: A$ton Matthews x2]\nI'm 'posed to die tonight\nI'm 'posed to die tonight\nBut it look like a night to remember\nBut it look like a night to remember\n\n[Interlude: Da$H]\nYou already know who the fuck it is man\nYou already know who the fuck it be\nMr. Stop Fucking Playing With Me, man\nPull up, hop out, take your bitch, get knocked the fuck out\nNo type time, I'm on no type time, we on pussy\n\n[Verse 2: Da$H]\nWalked in, I looked like the man of the hour\nThe one with the pistol, the one with the power\nYour bitch suckin' dick cause her nigga a coward\nGot paid off it all, from the pills to the powder\nDoing business so they hatin' it\nIf we want it then we takin' it\nChalk line, yellow tape and shit\nSmut her out, you probably datin' it\nGot the package and I made it flip\nHe got hit, then we arrangin' it\nShells in faces, we in enragin' it\nDiamonds dance like a Jamaican bitch\nDirty Whine on the necklace\nDUI, I'm ridin' reckless\nUh, yeah, she on ya line for the textin'\nAnd she in my spot for the sex, nigga\nYeah, So, No\nGang member, flame sender\nBad man, mad man\nRed ragging, toe tagging\nRack stackin', no lackin', nigga\nKeep it bool or else we uppin' toolies\nClips on clips, it ain't no fuckin' movie\nDon't associate with fuckin' goofies\n\n[Hook: A$ton Matthews x2]\nI'm 'posed to die tonight\nI'm 'posed to die tonight\nBut it look like a night to remember\nBut it look like a night to remember", "year": "2017-04-11"}]}