{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "Cannon Fire", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "[Intro]\nHeyyo check it\nThis goes out for all of the ones that's walkin' around here\nOut in the streets blindfolded\nNot knowin' what's really goin' on\nNawimsayin?\nThese streets is a habitat baby\nWord up\nPito\n\n[Verse 1]\nIn the garden of snakes, ain't no breaks, no mistakes\nJust games that's played at high stakes, the next guys wake\nTry to fly straight, not violate if you wanna die late\nThe tri-state, crime at a high rate, where peoples dilate\nGun shots that make the block vibrate, it shook niggas migrate\nSome die by fate, yo niggas cry hate\nA fly facer get they thighs scraped\nAnd little PUS that's why raped\nA kid inside his gate, gets murdered by jake\nA young nigga try ta fly capes, and get caught on the FBI tape\nIn verse of the State\nLost the case and gotta fry date\nNinety ninety eight, day of July eighth\nSome cats get ta stack the hot papes\nLive in the skyscrapes\nGo ta airline, buy flyin' states\nWhere they can hibernate and operate\nImpregnate, some chinky-eyed mate\nOther niggas will lay the power race, wit tre 8's\nTry to apply weight, and ready ta die staced off and dehydrate\n\n[Hook]\nCannon fire light up the town\nI stand my ground and hold the fort down wit the forty pound\nYou bust a round, I bust a round and lay your shorty down\nOn enemy territory grounds ta fall me down\nSon how that sound?\nCannon fire light up the town\nI stand my ground and hold the fort down wit the forty pound\nYou bust a round, I bust a round and lay your shorty down\nOn enemy territory grounds ta fall me down\nSon how that sound?\n\n[Verse 2]\nIt's like a time bomb you hit Vietnam ta Saigon\nKeep your mind calm, your nine on, me hard ta find harm\nPeep the crime dons rollin' wit ex-cons holdin' they out rons\nAnd teflons ta be streets flooded wit red ponds\nLike it was red dawn, bodies get found around without the heads on\nJudges set bonds that figures they know niggas is dead on\nWhat's left of death penalty facilities where niggas step on\nWit those that blew trough, go get they body filled wit electrons\nThe tec drawns, the ones that live foul, they're leavin' wet moms\nWit lead charms, put her ta bed wit her head drawn\nKillas wit red palms leavin' bodies cool as the dead fonz\nCaught in the dead wrong, found they way, ran into the feds arms\nYo\n\n[Hook]\nCannon fire light up the town\nI stand my ground and hold the fort down wit the forty pound\nYou bust a round, I bust a round and lay your shorty down\nOn enemy territory grounds ta fall me down\nSon how that sound?\nCannon fire light up the town\nI stand my ground and hold the fort down wit the forty pound\nYou bust a round, I bust a round and lay your shorty down\nOn enemy territory grounds ta fall me down\nSon how that sound?\n\n[Verse 3]\nFor steady cash flows, niggas'll blast you past the Astros\nBlow you like afros, the little fast hoes that last all the fast dough\nThey splash foes, red as Tabasco, they lay your asshole where the grass grow\nRunnin' wit armies like they Castro\nThem Donny Brasco's get Johnny Doj around they last holes\nKeepin' em half froze, put in shiny boxes rockin' they last clothes\nThe cash close inside your top pocket of stashed roast\nBody got found down on the back roads where all the trash blows\nAnd broken glass globes, the dip chicks slicker than gastro\nWho bag a slash blow and spot some top of the block hot as a gas stove\nThat's Mastro's cats in the Astros\nWho ain't afraid ta let they gats go\nThe paper dash bros lovin' the flash though\nAnd pass mo'\nStash rolls, count em like math pros\nAnd crash low soda, PoPo's don't step all up in they path yo\nThem cats go, that's smack on the back burner, but keepin' the gas low\nWhen task rolls they snatch his ass mows, movin' too ass slow"}]}