{"artist": "50 Cent", "songs": [{"album": "The Kanan Tape", "image": "https://images.rapgenius.com/4491454fb35bf08c09d2b90d6cd34472.921x921x1.jpg", "title": "Body Bags", "lyrics": "[Produced by The Alchemist]\n\n[Skit]\n[Snorts cocaine]\nNigga, (yeah), nigga, you know I don't fuck with them niggas. Them niggas pussy. Sucka ass niggas. I don't like either one (I don't even like 'em). But the other night I'm in the gambling spot. Nigga come up in here - boom - hit the door. \"Get the fuck on the floor, bitch, get down on the floor.\" I turn around like, \"what?\" Niggas like, \"get down!\" (When was this?) I'm like, \"nigga, I got on white linen.\"\n\n[Intro]\nFuck it, I mean we gotta kill what we eat, right? It's not a problem, it's really not a problem. Southside\n\n[Verse 1]\nOkay, the dope addin' up, the coke addin' up\nThe smoke addin' up, my pockets are fattened up\nI got bitches in my bedroom, nerds on computers\nDiamonds 'round my neck, straps for my shooters\nI made it, look ma', I made it\nI grind so hard to get here I can't be faded\nI got lawyers on the line, five different kinds\nFive different crimes, same .45\nGot a plan to turn to premise, see, a nigga ain't lyin'\nCause they ain't gon' say I did it and I ain't gon' say I did it\nAnd I might go back and forth to court, better bet I get acquitted\nCan you dig it? Nigga, can you dig it?\nShit changed, a nigga ain't broke\nI had a safe size as a shoe box, it felt like a vault\nNow I got real money, that \"fuck how you feel\" money\nThat \"nigga, you look at me wrong, get killed\" money\n\n[Hook]\nYou gon' be part of my body bag ritual\nHop out, hammer out to get at you\nYou gon' be part of my body bag ritual\n.45 lettin' off some shit at you\nYou gon' be put in a body bag\nYou won't get a chance to fire back\n\n[Verse 2]\nI peep my swag in the mirror, I think I got a crush on me\nI don't want no wack bitches touchin' me\nTailor-made threads, satin sheets on my bed\nGet a bitch sea-sick, waves all on my head\nDiamonds in my ear, Baccarat chandelier\nGabbana underwear, I'm so fly it ain't fair\nEvery day a different dime piece\nRose Gold, a different time piece\nHublot, AP or rollie\nYour bitch and your jeweler know me, homie\nI'm bulletproof, go 'head, take a shot at me\nYou be a dead nigga like the last one that got at me\nMy shirt level three so I ain't got a vest on\nMy heart like ice, my chest like teflon\nI'm a nightmare right here, just me and my knife, nigga\nDon't let me find out you ain't 'bout that life, nigga\nIt's doomsday, I mean goon day\nI get the orders, like, \"air out the room, Dre\"\n[Gun shots]\n\n[Hook]\nYou gon' be part of my body bag ritual\nHop out, hammer out to get at you\nYou gon' be part of my body bag ritual\n.45 lettin' off some shit at you\nYou gon' be put in a body bag\nYou won't get a chance to fire back\n\n[Verse 3]\nThe mollies had a shorty ass trippin' strippin' in my kitchen\nPush my thumb in her ass while I was strokin' her kitten\nI be in my own zone, still clutchin' the chrome\nTalk state of the art, you will see 'nine to foe\nMy passport need pages, I'm fuckin' round' out in London\nJetlag from jets, wrist lit baguettes\nTrippin' in my charm, look bitch, I'm a don\nSo shit go how I say it go, fuck if I'm right or wrong\nMy paper long, bomb kush in the bong\nIt feels like I'm dreamin' cause a nigga on\nI'm so far from a hammy down, I'm out in Miami now\nMy bitch no  speak no ingles, she fresh off the boat\nShe give me neck, what you expect? I got connects for the dope\nI'm no joke, blow 30k on the coke, stuff ten in the coat\nNigga, front, I'll have a hand full of dreadlocks\nBitch, I hit your ass with a headshot\n\n[Hook]\nYou gon' be part of my body bag ritual\nHop out, hammer out to get at you\nYou gon' be part of my body bag ritual\n.45 lettin' off some shit at you\nYou gon' be put in a body bag\nYou won't get a chance to fire back", "year": null}]}