{"artist": "G-Eazy", "songs": [{"title": "Far Alone (darksiide Remix)", "album": null, "year": null, "image": "https://images.genius.com/fd7ed1a82cc621a07ef0ec67ae88b145.1000x1000x1.jpg", "lyrics": "[Verse 1: G-Eazy]\nYeah, blue jeans, Air ones and a white tee\n'06 hangin' out the window like, yee\nHyphy on one, off a bottle might be, my tree\nSmokin' Agent Orange, Hi-C\nBack when me and Marty was recordin' at my Mom's\nMost of y'all were chasin' around bops\nI was in the lab, only hoping that my job\nNever would be based around mops now I'm on\nYeah, she know; love me cause my ego\nGirls and the drugs always follow us where we go\nAy, where the Bay at?\nShouts out to Jay Ant\nLookin' for the party girls, let me know where they at\nSkinny rich girls always askin' where the yay at\nThrow a house party like cool, where you stay at?\nTurn upside down, let her twerk on the wall\nTook her to the bathroom and did work in the stall\n\n[Verse 2: Justin Bieber]\nYou gotta go and get angry at all of my honesty\nYou know I try but I don't do too well with apologies\nI hope I don't run out of time, could someone call a referee?\n'Cause I just need one more shot at forgiveness\nI know you know that I made those mistakes maybe once or twice\nBy once or twice I mean maybe a couple of hundred times\nSo let me, oh let me redeem, oh redeem, oh myself tonight\n'Cause I just need one more shot at second chances\n\nYeah, is it too late now to say sorry?\n'Cause I'm missing more than just your body\nOh, is it too late now to say sorry?\nYeah, I know that I let you down\nIs it too late to say I'm sorry now?\nOoh, ooh\nI'm sorry, yeah\nOoh, ooh\nSorry, yeah\nOoh, ooh\nSorry\nYeah, I know that I let you down\nIs it too late to say I'm sorry now?\nOoh, ooh\n\n[Verse 3: G-Eazy]\nFrom the BART train to a tour bus\nStill the same game except I'm pulling more sluts\nMore butts, more bucks, never giving more fucks\nDid it my way, I'm never taking short cuts\nRaised in that town like fool, who put you upon?\nHuh, E-40, Mac Dre is who I grew up on\nI'm just selling game got you if you need a coupon\nYou can check my resume, see every beat I threw up on\nSmoking on grapes, rollin up swishers, no papes\nBack of the Ghost, closed drapes\nI'm a boss tycoon\nGirls in the crowd all swoon\nSuper high, I'm off to the moon\nAnd I vanished with your girl then I took her to my room\nShe wants me to slay ooh-kay, that means doom\nBoom, and it's to be expected\nKnew this would happen as soon as she texted\n\n[Verse 4: Justin Bieber]\nCan we both say the words and forget this?\nYeah, is it too late now to say sorry?\n'Cause I'm missing more than just your body\nOh, is it too late now to say sorry?\nYeah, I know that I let you down\nIs it too late to say I'm sorry now?\nI'm not just trying to get you back on me\n'Cause I'm missing more than just your body\nIs it too late now to say sorry?\nYeah, I know that I let you down\nIs it too late to say I'm sorry now?\n\nSorry"}]}