{"songs": [{"title": "Do You Want Me", "lyrics": "Hello Ladies\nOmillio Sparks\nOschino Vasquez\nUh - Hunh\nMommy Do you want me?\n\n[Hook]\nMami do you want me?\nCause I done grew feelings for you boo\nI see what you go through\nI'm going through the same things too\n\n(Sparks)\nIn the beginning basic, live for the moment\nFuck it, swinging on the weekend\nElto and drinking, kickin\nRelationship platonic\nMeanwhile the time flying\nI think I'm getting caught up in feelings\nI ask myself Sparks what is you doin?\nYou drawin, You don't even know her\nAnd already you Carl Thomas 'Emotional'\nWhat is it? The twat or the back massages?\nThis I, like you shit, got real confusing\nI ran to my homies for answers, but they just say fuck it\nBut every time I turn around they trying to fuck you\nUncle Lano told me let you go (let her go)\nBut my conscience said NO, I think I got something here\nShe finish school and working on her career\n\n[Hook]\nMommy do you want me?\nCause I then grew from\nI see what you go\nI'm going through the same things too\nMommy do you want me?\nCause I then grew from\nI see what you go\nI'm going through the same things too\n\n[Oschino]\nMet you on a ski trip\nJust wanted to skeet quick\nI think we was dancing to uhhh Fiesta Remix\nYou had ya ice and ya Louie Vuitton bucket on\nBut I was anxious to see you with nothing on\nYa skin was smoother than The Isley Brothers\nI had rubbers, plus my pockets was filled with the Franklin Brothers\nWe had sex once, we had sex twice\nBefore I knew it we was smuttin every night\nYou was too fly for Lerners\nPlus my dick fit perfect in ya wet, bushy, hot fur burger\nMy niggas said I'm open, they say I'm wrong\nBut they ain't see how ya ass just swallow a thong\nTeeth straight like drug money\nShe had her own money\nShe had a son, he was fly he used to love money\nShe drink red Ali', I drink straight Belvy\nNow she love when I come home so she can straight nail me\n\n[Hook]\nMommy do you want me?\nCause I then grew from\nI see what you go\nI'm going through the same things too\nMommy do you want me?\nCause I then grew from\nI see what you go\nI'm going through the same things too\n\n[Young Chris]\nHolla at me Mommi\nExcuse me miss\nWhat's ya name? Where ya from?\nHow can I cum?\nPossibly can take you out tonight?\nI got friends with me\nBottle of Belvy in the Benz with me\nCome to condo get it in with me\nAnd tell ya friends that you been with me\nCause time the only thing you can spend with me\nI tell her trick what? Lace who? That ain't what Chris do\nGot a lot of girls but be good if I get you\nHave the hood rats against you now\nThat's all I need is a mommy with potential\nKnow how to roll the trees up for Papi\nOverseas trips to Papi\nType bitch I let count the cheese up without me\nYea show her to the family\nAnd if everybody feeling you, then boo we can grow into a family\nHolla\n\n[Hook]\nMommy do you want me?\nCause I then grew from\nI see what you go\nI'm going through the same things too\nMommy do you want me?\nCause I then grew from\nI see what you go\nI'm going through the same things too", "album": "State Property Soundtrack", "year": null, "image": "https://images.genius.com/84576893bd0396cc4153bf1c32207302.400x400x1.jpg"}], "artist": "Young Chris"}