{"artist": "WC", "songs": [{"year": null, "lyrics": "\"L.A.! Californ-I-A!\" (repeat 4X)\n\nIt all started on a Saturday night, I was at the Tilt\nFaded off a eightball, when I got the phone call\nI recognized the voice right off the bat\nOctavia, a.k.a. the neighbor-hood-rat\nI used to run up in her but I had to play broke\nCause the bitch was known to twist mo' than hundred spokes\nTalkin bout a party she was givin and niggas was dippin\nShe wanted me and my crew to come through and\nI couldn't find CJ, Toones was out of town\nAnd Mack and Cube wasn't out nowhere to be found\nAnd all that bendin solo shit, played out with Cooley High\nEven in the movie Damon caught a black eye bitch!\nAin't no peace treaty motherfuckers is losin\nIn nineteen-ninety-eight, ain't too many niggas trucin'\nSo what makes you think I'm comin out tonight ho?\nYou must be on Triple D: Dick, Dope and Dynamite\nShe kept claimin that security was tight\nAnd if I came, we'd both be comin tonight\nSo I jumped off my kizznouch, grabbed a coat and my coat\nPicturin my dick all down this bitch throat\nLoaded up my heater, took the black nina\nJumped in my rizzide, headed for the Westside\nRollin in the rigga with the naughty\nBumpin \"Flashlight\" fool, headed for the party\n\n\"L.A.! Californ-I-A!\"\n{WC} Uh-huh, uh-huh, fuckin with house party\n\"L.A.! Californ-I-A!\"\n{WC} Shit ain't safe\n\"L.A.! Californ-I-A!\"\n{WC} Kids don't try this at home\n\"L.A.! Californ-I-A!\"\n\nIt's goin down, the music got the whole block blastin\nAnd all I see is titties and bitches with big asses\nI couldn't make it through, I had to go back\nAnd park around the corner cause the street was packed\nSo now I'm bailin to the party, eyes damn near shut\nHeater on my side, plus I'm high as fuck\nStraight trippin off 40's, hoodrats and shit\nWith niggas names tatted on they ankles and wrists\nAnd all these Cutlasses next to empty bottles of Hennesey\nAn early indication of gangbangin activity\nGot to the do', no security in sight\nJust niggas ridin on me, what that whoopty-woop like?\nI felt like I straight mark, walkin in the house\nGettin punked by niggas too young to get in Magic Mountain\nSo I rolled back on em, right on the spot\nTold em, \"Fuck your set!\" That's when I heard the music stop\n\n\"Hey nigga what that stand for on your arm?\"\n\"Ni-niggas havin cash\"\n\"You mean niggas havin a collision\"\n\"Get that nigga!\"\n\"Don't let that nigga fall!\nDon't let him fall!\"\n\nStretched out on the flo', gettin fucked up\nAll I saw was knucklehammers and bottom of niggas Chuck's\nBitches screamin, \"Kick that nigga ass for me!\"\nHe's teemin on my dome, ain't no motherfuckin sympathy\nI grabbed my heat and started dumpin, hit the back do'\nScotch free loc and who did I see?\nOctavia, pussy wet, drunk on the ground\nPassed out on her stomach with her pants hangin down\n\n\"L.A.! Californ-I-A!\"\n{WC} Shit ain't no joke loc, fuckin with a house party!\n\"L.A.! Californ-I-A!\"\n{WC} Niggas is gettin gunned down\n\"L.A.! Californ-I-A!\"\n{WC} Ha hah, I don't know about where y'all from\nBut it ain't goin down where I'm from\nFuckin with a house party!\n\"L.A.! Californ-I-A!\"\n{WC} Shit is real, check it out\n\nWoke up the next day, little cut on my arm\nOne on my eyes and head, more knots than Berry Farm\nCalled the ho up and cussed her punk ass out\nShe had the nerve to ask why a nigga turned the party out?\nNigga I scream on that bitch, I banged on that bitch\nNutted up on that bitch, hung up on the bitch\nStank-ass skank got niggas crossin enemy lines\nI should've stayed home and listened to my first mind\nCause now a nigga's layin down mad at the world\nLookin like the Elephant Man with a jheri curl\nSittin at killa King with forty-fo' stitches\nFuckin with these parties and these punk ass bitches\nFuck a house party!\n\n\"L.A.! Californ-I-A!\"\n{WC} Ha hah, youknowhatI'msayin? Fuckin with a house party!\n\"L.A.! Californ-I-A!\"\n{WC} This shit is real loc, youknowhatI'msayin?\n\"L.A.! Californ-I-A!\"\n{WC} Ay Toones, tell these motherfuckers\nFuckin with a house party\n\"L.A.! Californ-I-A!\"\n{WC} Ain't nuttin but motherfuckin bandana swingin\n\n\"L.A.! Californ-I-A!\"\n\"L.A.! Californ-I-A!\"\n{WC} Y'all know what time it is\nBandana season loc, ha hah\n\"L.A.! Californ-I-A!\"\n{WC} Fuckin with a house party!\n\"L.A.! Californ-I-A!\"\n{WC} Fuckin with a house party!", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "Fuckin’ Wit Uh House Party"}]}