{"artist": "Vast Aire", "songs": [{"title": "KRS-Lightly", "year": null, "lyrics": "Vast Aire:\n(It's like, one day I came home and I was like man, I was listening to the radio and shit.  I was like damn, Camu.  We gotta do this sh*t.  Yo!)\n\nVast Aire:\nI wrote a rhyme to a beat sippin' a Sam Adams\nNow everybody and their grandma know Atoms\nYo, now everybody and their grandma know Atoms\nYo, now niggas want war like Edwin Starr, but what is it good for?\n(Absolutely nothing)\nI'm saying Ice Ice Baby lost 18 zeros cause he was (Absolutely frontin')\n\nCamu Tao (of S.A. Smash):\nCause news been sequel like Vin Diesel\nI'm in the back of the club smackin' up ten people, [ow]\nI'm in the back with your girl trading them sweet secrets\nRubbing on your honey and getting them tits leakin'\nAnd if I'm to slick for niggas I switch to triggers\nShoot me up with fifths of liquor, help me out\nWhen I'm out pinch hits the niggas\nAnd if the club is stuck on lame, punk, we heat it up\nAnd if your girl say she's stuck on brain, we beat it up\nCause Mu's been crackin' since What's Happening!!\nHow ya gonna push your shit forward when your ass backwards\nAttitudes wanna change when the cash stack up\nShoot things when they attack using them black magnums\nListen, niggas are you ready for fun?\nHow you gonna front in the house when its heavy with guns\nChop up your body have you rollin' with chunks, niggas\n\nCamu Tao (of S.A. Smash):\nI wrote a rhyme to a beat sipping a Pale Bass\nNow everybody and they grandma know Smash\nNow everybody and they grandma know Smash\nCause niggas want war like Edwin Starr, but what is it good for? (Absolutely nothing)\nI'm saying Ice Ice Baby lost 18 zeros cause he was (Absolutely frontin')\n\nVast Aire:\nYou know my mouth is New York, but my elbows are southern\nComfort, spilt on my shirt change the pattern\nMC's better eat they veggies\nI'm Four times Fantastic, [Unseen]\nRock hard and flexible\nPlus my flesh is fire suitable, [yo who you rockin' for?]\nTo the cats in the front who be acting ill\nAnd the chicks in the back with the skirts that peel, [Ha Ha]\nShe's hoping for my index skill\nCause I was backstage up in her Massengill\nNiggass drunk all night looking for skins to kill\nNow we wake up with the morning after pills\nI think my tongue needs a dance floor\nCause my vernacular is like fancy movement\nAnd if you ever test my crew\nYou might not live that long to dispute it\n\nCamu Tao (of S.A Smash):\nPut your money where your mouth is\nI'll knock your teeth out\nWe don't play fair yeah's that's the street bout\nWhat's the beef about life ain't that long\nNiggas squeeze 'em out you put it in a rap song\n\nVast Aire:\nI wrote a rhyme to a beat sippin' a Sam Adams\nNow everybody and their grandma know Atoms\nYo now everybody and their grandma know Atoms\nSmash Brothers, Atoms Fam\nCause niggas want war like Edwin Starr, but what is it good for? (Absolutely nothing)\nI'm saying Ice Ice Baby lost 18 zeros cause he was (Absolutely frontin')", "album": "Look Mom... No Hands", "image": "https://images.genius.com/ec5e65a416584a208b3230e59ddbdd2f.600x600x1.jpg"}]}