{"songs": [{"image": "https://images.genius.com/0c2b6ab5b12521682ccf377202642c09.600x600x1.jpg", "album": "XXX", "title": "Bruiser Brigade", "lyrics": "[Chorus]\nBruiser! That's my crew\nBruiser! But don't forget the brew\nMGD's and Colt 45's\nBut don't forget that Molson Ice\n\n[Verse 1]\nI'm about to drink a Heineken (Heineken?)\nI'm about to drink a Heineken (Heineken?)\nMet a white bitch with a China friend (China friend?)\nShe gone slurp me and she gone slurp my friends\nBRUISER! That's my crew\nBRUISER! But don't forget the brew\nCoronas and Bud Ice\nDon't forget the Miller High Life\nWe about to drink some PBR\nNo bottles at the club, nigga, we at the bar\nUK niggas up in the pubs, they watching them soccer games\nWe drunk as fuck, nigga, we bumping Waka Flame\n(BOW-BOW-BOW-BOW!)\nYo, bitch! She wanna fuck me\nYo, bitch! She wanna suck me\nWhat the fuck you think she 'posed to do?\nBut if she fuck me, she gotta fuck the crew\n\n[Chorus]\nBruiser! That's my crew\nBruiser! But don't forget the brew\nMGD's and Colt 45's\nBut don't forget that Molson Ice\n\n[Interlude: Dopehead]\nBruiser Brigade, bitch!\nIf you ain't pulling a nigga dick out and slapping yourself with it\nThrowing this bitch in your mouth sucking dick with bubbles\nFucking all night and drinking protein shakes in the morning\nGet the fuck outta here!\n\n[Verse 2]\nI don't give a fuck 'bout none of these ho ass niggas\nI don't give a fuck 'bout none of these ho ass niggas\nI'm drunk as fuck, might fire on one of these niggas\nWe drunk as fuck, we might just jump these niggas\nBRUISER! That's my crew\nBRUISER! But don't forget the brew\nWe drink everything up on the shelf\nNow we hurling in the bathroom, I need some help\nBut that's the life of a Bruiser nigga\nDon't make me have to shoot a nigga\nBitch, it's Bruiser Brigade\nBitch, it's Bruiser Brigade\n\n[Verse 3: Dopehead]\nI need some brain, I think I lost mine\nI'm higher than Swizz Beatz' hairline\nYou always cake up then bake up, say what?\nYou rappers cuff and you fake as lace fronts\nDopehead hustle harder, niggas can't knock it\nSuper skinnies, loosies breaking in my back pocket\nI slam a rapper head first like the Undertaker\nHead-butt your whole skull in, nigga fuck a hater\nYou soft as Elvin off the Cosby's\nMy niggas down to do a homi'\nBruiser Brigade and don't forget the brew\nStyling on rappers since Northwestern High School\nCalling me ahead of my time is an insult\nI don't need a pencil, this shit is all mental\nYou rappers are wack, mad as hell and you bored as fuck\nI hit the stage grab the mic and do my Jordan shrug", "year": "2011-08-15"}], "artist": "Danny Brown"}