{"songs": [{"year": null, "lyrics": "(Russell Lee)\nYeah, Yeah\nI'm a spit some of this real game\nSome real shit\nSome real talk\nNa, na\nWhoa-oh, Whoa\n\n(Richie Rich)\nUgh, check my watch\nCheck my chain\nIt's simple and plain\nThe Chevy wit the blew out brains\nAs I bounce and mash\nCount this cash\nFloss and flash\nCop and blow a zip wit Bash\nSince everything is big in Texas then where's the zag's?\nI'm a cross the finish line\nTell me where's the flags?\nBrought my rag top\nShould have brought the Jag\nOn the beach me and Beesh\nLook at all this ass\nI could tell you stories but can show you cash\nGive you game and secrets that I know you'll pass\nTo the next playa hater\nAnd he'll break like glass\nNow I got a bunch of people digging' through my pads\nSo I choose to floss\nCuz who's the boss, let's ink it\nIt's Richie Rich for those who thought re-think it\nSome yell it and tell it\nI blow it and smoke it and smell it\nLet's spend tokens wit my people who sell it, what?\n\n(Chorus): Russell Lee\nI can show you better than I can tell ya, tell ya\nI can show you better than I can tell ya, tell ya\nI can show you better than I can tell ya, whoa yeah\nBut it's really nothin' though (But it's really nothin' though)\nBut it's really nothin' though (But it's really nothin' though)\n\n(Baby Bash)\nI could show you somethin' dirty deep up in them corners mayne\nWhat the deal?\nI could bend the block and make it hotter than a Forman grill\nI got the keys to the Chevy Caprice\nI could show you mother fuckin' snitches straight to Belize\nNow that's low\nFa sho', conspiracy and parole\nI could show you real cats doin' time over a ho\nI could show you poor and happy, or rich one's that lose they mind\nI could show you dime pieces in school fashion design\nI could show you street lights and heart beak hotels\nI could show you young cats gettin' popped wit yayo\nDown to do what I gotta do to satisfy the man in me\nAnd from the looks of thangs the popo's ain't understandin' me\nThe original digital scale reader\nThe pedigree playa who be stackin' his Velveeta\nI could show you boss stuntin' so fuckin' disgustin'\nI could show you rapper's frontin' but mayne it's really nothin'\n\n(Chorus)\n(A-Wax)\nI could show you\nI could reach you and teach you\nI know you and where you comin' from\nI understand it\nThis been goin' on forever dog\nIt's no end\nLife is like a bullet in your back from a close friend\nDisappointed to the point where I'm runnin' by myself\nNever knowin' where I'm goin' start to wonder myself, yeah\nMoney was a necessity\nMy greed got the best of me\nYou think you smokin' Uncle B\nWho got the recipe?\nI'm sayin' it's nothin'\nI say it sincerely, and speakin' clearly\nI'd rather you respect me than fear me\nI came a long way and still I got a while to go\nYou probably thinkin' to yourself \"What's he smilin' for?\"\nMy dog Bash about to be platinum doin' his thang\nSo if you hate him for it, boy you fakin' and know it\nWe takin' this money\nBig bundles of bills\nI'm like a whole 'nother person when it come to this skrill", "title": "Better Than I Can Tell You", "album": null, "image": "https://images.genius.com/bc082a91a318bb46fe9f277e0f6b2166.399x399x1.jpg"}], "artist": "Baby Bash"}