{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "D.R.U.G.S.", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Verse 1: Phife Dawg]\nWhen folks say they want some raw hip hop, guess who they quick to call?\nDiggy Dawg, cuz my shit be neanderthal\nSome call it primitive, retaining to an earlier time\nCan't help but go back to them years like '89\nWhen brothers gave a damn about the beats and rhymes\nNow life is only by the party, ices worn by everybody\nBut what are you saying lyrically, come on, seriously\nSee that's what's wrong with this muthafucking industry\nMC's be listening to they A&R friends\nBut they ain't your friends, they ain't into setting no trends\nIt's all about them, and how you can make them some ends\nBut fuck that, I'm here to make sure that skills transcend\nWhere there's a, pad and pen, Phife gon' make 'em some yen\nWith Mr. Fudge on his job, Hi-Tek on the blend\nWifey holding me down, granny singing me hymns\nUrging me to praise God and keep my eyes on him\nJust to look is at, see him, he's a mimic to me\nSimply put things in perspective, on how to MC\nAnd be an all I can be, done deal, and that's real\nPhife the baby face of hip hop, with the raw whip appeal\n\n[Hook: Phife Dawg & Hi-Tek]\nI'm here to do what I can do, and I'm done with that\nYo, fuck that, this where the realness at\nI know you fraud ass rappers can't attest to that\nYo, fuck that, this where the realness at\nReal rap's aim at the wig, while rest fake jack\nYo, fuck that, that's where the realness at\n\n[Scratch Break]\n\"The realness\"\n\"And that's my word\"\n\"Queens\"\n\"Into that\"\n\n[Hook: Phife Dawg]\nOne-time for your mind, this is how we do\nPhife Dawg rock gems, Hi-Tek produce\nAnd it don't stop, we got the sure shot\nIt's for the, it's for the, better men of hip hop\nOne-time for your mind, this is how we do\nPhife Dawg rock gems, Hi-Tek produce\nAnd it don't stop, we got the sure shot\nIt's for the, it's for the, better men of hip hop\n\n[Verse 2: Phife Dawg]\nSo you wanna be that superstar, but you more like nova\nShining for a week, by next Monday you're over\nAnytime you see a mic, better look over your shoulder\nBOW! Before you get smacked with the boulder\nThought my attitude was cold for you G? It's even colder\nBitter, MC's get kicked right in they shitter\nMut' Ranks, more controversial than Adolf Hitler\nTest me, you getting cut with this here log splitter\nNow who's iller, backs get snapped like Tostitos tortillas\nMy shit be killa dealer, Planet of the Apes, fuck a Magilla\nFeel me, black, to Queens, New York, where y'all at?\nLick two shots out in the air, front front to back\nToo many rappers running round, fronting like they the bomb\nOr you hardly to be the first to read the 23rd psalm\nDid you think you'd just get over, with the looks and charm\nOr did you, study the style that the next was on?\nCome on? Time's up for the fraudulent, peep the style that I implement\nI'm say, God damn I'm so innocent\nShit's just so critical, niggas don't wanna hear the lyrical\nAnd they wonder why this rap game's so God damn fickle\nPeep the fake shit that the wack suburban rapper be on\nOne or two rappers from the projects they might sing love songs\nTell me, is something wrong? Damn, right, niggas ain't tight\nAnd they won't be tomorrow, next Never-uary, and damn sure not tonight\nYou wanna know why? Cuz Diggy Dawg is in they eye sight\nYou wanna know why? Cuz Phife Dawg is in they eye sight\n\n[Hook]\nI'm here to do what I can do, and I'm done with that\nYo, fuck that, this where the realness at\nI know you fraud ass rappers can't attest to that\nYo, fuck that, this where the realness at\nReal rap's aim at the wig, while rest fake jack\nYo, fuck that, that's where the realness at\n\n[Hook]\nOne-time for your mind, this is how we do\nPhife Dawg rock gems, Hi-Tek produce\nAnd it don't stop, we got the sure shot\nIt's for the, it's for the, better men of hip hop\nOne-time for your mind, this is how we do\nPhife Dawg rock gems, Hi-Tek produce\nAnd it don't stop, we got the sure shot\nIt's for the, it's for the, better men of hip hop\nOne-time for your mind, this is how we do\nPhife Dawg rock gems, Hi-Tek produce\nAnd it don't stop, we got the sure shot\nIt's for the, it's for the, better men of hip hop\nOne-time for your mind, this is how we do\nPhife Dawg rock gems, Hi-Tek produce\nAnd it don't stop, we got the sure shot\nIt's for the, it's for the, better men of hip hop", "year": "2000-09-26"}]}