{"artist": "The Game", "songs": [{"title": "Astronaut Pussy/Welcome to California", "album": "OKE: Operation Kill Everything ", "year": "2013-10-08", "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg", "lyrics": "[Part 1: Astronaut Pussy]\n\n[Hook]\nToo high, can’t come down\nLosing my head, spinning round and round\nRound and round, round and round\n\n[Verse 1: Game]\nBack to the Hooves\nRidin' down 74th and Hoover with my nigga ScHoolboy\nCadillac and a coupe\nSee them niggas hatin from afar, can’t catch em now\nBut they getting smacked when we do\nRat-a-tat like we Snoop, Crown on the vic\nCrown on my wrist, crown on my bitch\nAnd a couple crowns on my crew\nCouple pounds of the blue\nIvy in it, tsunami in it when I be in it\nGot the lobby in it, Tommy in it\nThe trunk got a body in it\nNiggas be like, \"He bodying it\"\nZiplock full of J’s, closet full of J’s\nWorkin' on my Pippen, he’s Scotty in it\nBath tub big enough to fit a Audi in it\n8 gold chains like a Saudi in it\nMurder with the ink, I’m Gotti in it\nDon’t get too popped, get your ass 2Pac'd\nCargos with the 12 gauge shotty in it\nPlus I still got a crib on Brazil\nI ain’t never hardly there but I got a Maserati in it\nThat’s my new addition, no Bobby in it\nChop shops in the hood, no karate in it\nSo much money, got a money tree\nWhoop so many niggas’ ass, shit we money team\nSame fuck niggas with they hand out, same sad song\nBring the bands out, nigga should be workin on they money scheme\nBack to the convers', kill 'em with one verse\nConverse with the worst 'til one of our gun burst\nCall the mortuary, tell him niggas in one hearse\nCause Compton ain’t like the city of Commerce\nNo back talk, back wall, end up in asphalt\nNiggas got them choppas like we flyin' the black hawk\nPut you with the roots, thinkin' a nigga was Black Thought\nNow hold that thought\nMotherfuckers wanna act loco\nHit 'em with numerous shots from the 4-4\nMotherfuckers wanna act loco\nHit 'em with numerous shots from the 4-4\n\n[Hook]\nToo high, can’t come down\nLosing my head, spinning round and round\nToo high, can’t come down\nLosing my head, spinning round and round\n\n[Verse 2: ScHoolboy Q]\nPray for me, I’ll make 30\nDesert Eagle, my nails dirty\nEverything on life and I’d die for it\nMade a mil', you ain’t even know it\nTell Illuminati I’m down for it\nCall Jigga, I'm next nigga\nSon niggas my new litter\nFuck the world on Earth Day\nHer booty clap on my birthday\nI would take the cake but I’ve been paid\nI’m a real nigga, you’s arcade\nHad a switchblade in the 5th grade\nSmoked plenty weed on my mama’s couch\nNow I’m going big, I can buy the house\nYou sound water down, I sound off a ounce\nSee this for those who say \"Where you from?\"\nAnd for those hoes who go' make me cum\nBut them fuck niggas we don’t fuck with them\nAnd fuck niggas gon' lose a lung\nKnock knock nigga, come feel the drum\nIf the bread low, I'ma stack the crumb\nHide the contraband in-between my gum\nBefore smoking dope, I was selling coke\nWell rocked up to a 8 year old\nWhen it popped up, call it pot luck\n500 G’s, nigga pretty please\nCondos where it’s sun and trees\n10 tees with my 80s\nHoover hats like the star of David\nPull on, shots a must, get me faded\nRan up on 'em, I ain't good with aimin'\nMove out the set but the set I’m banging\n\n[Hook]\nToo high, can’t come down\nLosing my head, spinning round and round\nToo high, can’t come down\nLosing my head, spinning round and round\n\n[Verse 3: Skeme]\nLook, a young nigga really tryna stunt, fuck it\nWestside Ingles and I ain’t, budging\nIndependent niggas with no, budget\nIf it ain’t about a dollar gotta change, subjects\nRap ass niggas ain’t sayin, nothing\nThis flow here, niggas can’t, touch it\nMotherfuck friends, tinted windows on the Benz\nDoing doughnuts in the bitch got me trippin like a bucket\nSox gang off in the streets\n10 hut, bring the squadron with me\nSee niggas talk ballin like they been in the gym\nBut you lookin like a novice to me now quit talkin to me\nCan I vent?\nAll you niggas sound retarded to me\nKillin these niggas, I’m a general nigga\nTurn yo head to a target for free\nNow I’m on, look at me\nStarted, started with them pistols and palm trees\nNow when niggas come through the wood\nNiggas gotta know that that’s all me\nSee the set catch rec\nWhen I slide through throwin up all bills\nAnd niggas wanna act like they thuggin like us\nWe said, \"Boy please\"\nThis S to the K to the E to the Mmm nigga\nNew Rolls go vroom nigga\n.4-5 cocked back like boom nigga\nGot enough loot to fill up a room nigga\nAnd I’m rolling these blunts at 100 a go\nGave her that dick now she beggin' for more\nMade me a millie, yo bitch load is illie\nBut I ain’t got, still got 100 to go\nAnd I do it, I does it, I spit it, you love it\nI just left from Newark, got bands in my luggage\nPlay with you rappers, my nigga this Bloodin'\nTake out my dick, take a piss on the public like fuck it\n\n[Hook]\nToo high, can’t come down\nLosing my head, spinning round and round\nToo high, can’t come down\nLosing my head, spinning round and round\nRound and round, round and round\n\n[Bridge]\nToo high, high\nC-c-can't come down\nToo high, high\nC-c-can't come down\nToo high, high\nC-c-can't come down\nToo high, high\nC-c-can't come down (round and round, round and round)\n\n[Part 2: Welcome To California]\n\n[Intro: Too $hort]\nWelcome to California, beitch\nWelcome to California, beitch\n\n[Hook: Stacy Barthe]\nSky’s not the only place\nStars are livin'\nI know another place\nWhere you can’t stop the shining\nYou can’t stop the shining\nYou can’t stop the shining\nYou can’t stop the shining\n\n[Verse 1: Game]\nNigga done been everywhere\nLeft trails in my city everywhere\nBut nowhere like home, C-O-M-P-T-O-N on\nBitch come and dust my throne\nStand from my grandmother’s porch to my executive Porsche\nNow I’m driving through London and Rome\nWith a Parisian bitch, rockin corn rows\nBackseat of my Panamera watchin' pornos\nWhere we goin? What we doin?\nFly to Johannesburg, leave the city in ruins\nThen fly to Dubai on my poolside, coolin'\nMy Audemars ain't waterproof, fuck it go and get a new one\nI done been everywhere around the world and that’s cool\nBut can't no hotel fuckin' reserve us parked through\nMy hood gorillas move whenever sharks move\nMove back to Compton shit, we ought to\nCondos on Wilshire, shit I bought two\nLivin' down the street where BIG got shot, I haunt you\nAnd the very next day where Pac met his fate\nIt’s how we live our life, surrounded by tape\nPause\n\n[Bridge: Stacy Barthe]\nHarmonizing\n\n[Verse 2: Game & Too $hort]\nWhere the angels fly, City of Angels\nI, will never let you down\nKill, anything approaching my crown\nStill, undefeated\nThat’s why I got my kids building sand castles on the beaches\nBut don’t get it confused, city still got rules\nWear the wrong colors, nigga end up on the news\nLights out, like Durant in The Drew\nThen I’m right back down Compton Avenue in a Buick\nIf you had a heart, niggas put a bullet through it\nAnd it took a coma for you to be king, would you do it?\nWould you do it?\nIf I dropped you off at Watts, would you walk through it?\nWould you be from Grape Street or would you Piru it?\nHere’s my red rag, it says, \"Ain’t nothing to it\"\nThey go the 60’s, motherfucker, good luck\nWelcome to California, beitch\nThey go the 60’s, motherfucker, good luck\n\n[Verse 3: Schoolboy Q]\nUhh, from the corner where the hoes sell they kit kat\nShort dress, hair down the bizack\nYou know me with my thumb in my index\nNah, I ain’t Bloodin' nigga\nPass blunts to my cousins nigga\nTurn hell into gold, I can pon the river\nHiiiPower, you a Amish liver\nCali dro in my lungs and such\nTwisting blunts from dawn to dusk\nMy shoebox should’ve been a armored truck\nEverything good, feeling marvelous\nKey to the city, they should honor us\nYou don’t talk me and Game, no game homie\nGet greedy with the clip, no aim on it\nUh, and this the 3rd degree\nBurn like the bridge and yo business, uh\nStarted at the floor, at the beginning, uh\nNow I rep the floor until the ending, uh\nSmoking on L's cause I’m winnin', uh\nWax getting blowed just to kindle it, uh\nYeah, now back to the groove, back to the Hooves\nRat-a-tat-tat in the 'Lac with a tool\nNo county jail, still wearin' all blue\nOrange on the trim, straight lookin like Q\nFig' tattoo\n\n[Interlude: ScHoolboy Q]\nYeah yeah yeah yeah (oo-wee, oo-wee)\nUh, yeah (yeah)\nUh, uh, right (right, right)\nUh, yeah (yeah)\n\n[Verse 4: Schoolboy Q & Too $hort]\nI’m into gangsta shit, gangsta clothes and gangsta crib, yeah\nNeed a gangsta bitch to take the dope and hop the fence, yeah\nMight die on the freeway, hey\nMuch love to the Kee-Way, aye\nWatch you know about L.A.? Uh, yeah, right\nWelcome to California, beitch\nStay low from the comas, uh\nMake a right 'fore they dome us, uh, yeah, yeah, yeah\nWelcome to California, beitch\nStay low from the comas, uh\nMake a right fore they, pop pop pop\n\n[Hook: Stacy Barthe]\nSky’s not the only place\nStars are livin'\nI know another place\nWhere you can’t stop the shining\nYou can’t stop the shining\nYou can’t stop the shining\nYou can’t stop the shining\n\n[Verse 5: Skeme]\nGot a bitch, say she wanna fuck in Beverly Hills\nAnd I swear I’ma bring her to the set if she will\nAnd if I do, the pussy better be killed\nIt's just the way I make her feel, no Stephanie Mills\nA nigga heavily trill, these haters never be real\nI came up in a world where it’s kill or be killed\nI swear that every bitch I used to fuck fuckin' me still\nJust give her dick, never covered a bill, this shit is real\nThis Westside INGLCL\nBands on them bitches, getting ends on them bitches\nGold framed Cartier lives on the bitches\nLast long like I’m using extends on them bitches\nI’m a (what?) native, I got real niggas with me\nGolden State, gold grills, I put on for the Betty White\nMiddle fingers for the pigs\nTell them bitch niggas suck a dick, man come and get me aight\n\n[Interlude: Skeme & Too $hort]\nThis nigga Chuck want a nigga be in here\nRappin' all day and shit\nBlood, I got to go get my shit braided\nNigga ends and shit all out\nAnd I ain't got no lean?\nFuck this, we out this bitch\nWhat's happening though?\nWelcome to California, beitch\nWoop!\n\n[Hook: Stacy Barthe]\nSky’s not the only place\nStars are livin'\nI know another place\nWhere you can’t stop the shining\nYou can’t stop the shining\nYou can’t stop the shining\nYou can’t stop the shining"}]}