{"artist": "Papoose", "songs": [{"album": null, "title": "Bucket Naked (Remix)", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro: Remy Ma]\nThat's how we be on the trailor?!\n\n\"Bucket na-bucket na-bucket-bucket naked!!!\"\n\n[Papoose]\n(THIS IS THE REMIX!!!) She got a bedroom body GO SHORTY!!!\nShe got a bedroom body GO GIRL!!!\nShe got a bedroom body GO SHORTY!!!\nShe got a bedroom body\n\n[Hook: Papoose]\nI told her I'm a call her (Bucket) got her on the camcorder\nI can't believe I saw her (Bucket naked!!! UH!)\nAs soon as I meet her (Bucket) like a Queen I'm a treat her\nCause I just wanna see her (Bucket naked!!! UH!)\n\n[Verse One: Papoose]\nI like it when she wear the sweatpants right the ass ain't pink\nSmell like roses her pussy don't stink\nChew Doublemint gum, she like to have fun\nTatoo on her body earring on her tongue\nWe the real Bonnie And Clyde\nYour girl aight but your girl ain't live\nFlyer than a piece of paper bearin my name\nGot the hottest chick in the game wearin my ring\nShe look good in her stay-greens, (Bucket)\nBut I wanna see her get (Bucket naked!!! UH!)\nI like it when she wear them tight jeans, (Bucket)\nBut I rather see her get (Bucket naked!!! UH!)\nShe got my name tatooed on her\n(Bucket) man I seen her when she get (Bucket naked!!! UH!)\nI make her scream I hit every corner\n(Bucket) cause I like her when she get (Bucket naked!!! UH!)\n\n[Hook: Papoose]\nI told her I'm a call her (Bucket) got her on the camcorder\nI can't believe I saw her (Bucket naked!!! UH!)\nAs soon as I meet her (Bucket) like a Queen I'm a treat her\nCause I just wanna see her (Bucket naked!!! UH!)\nShe was sittin home alone, (Bucket) sippin on Patron\nNow she in my cameraphone (Bucket naked!!! UH!)\nShe was dancin in the club, (Bucket) she want that thug love\nNow she in that bathtub (Bucket naked!!! UH!)\n\n[Verse Two: Remy Ma]\n(THIS IS THE REMIX!!!)\nDownload the footage from the phone and to the Mac and make a movie\nA master bedroom body and my shit come wit a jacuzzi\nHe said, \"Excuse me miss, your lips is mad juicy\"\nI said, \"Iit's Mrs. and +THIS+ is Papoose's\"\nIn my birthday suit, he +Wipe Me Down+ - Lil Boosie\nAnd we both Gs', together we make Gucci\nYou sex-textin, typical groupie\nMen are visual, might send a picture of the oochie (Oochie Wally Wally)\nI'm his housewife, his ho, his Suji\nI be on my dot, Remy Ma's on du-ty\nHe be callin me papers so people think he use me\nNo, I give him three holes like a piece of loose leaf\nI throw the booty, the food-y is always ready\nI'm t-tellin you, B-Becky ain't got nothin on Remy\nDon't need KY jelly, everything is all ready\nDon't gotta take off my clothes, I'm bucket naked already!!!\n\n[Hook: Papoose]\nI told her I'm a call her got her on the camcorder\nI can't believe I saw her (Bucket naked!!! UH!)\nAs soon as I meet her like a Queen I'm a treat her\nCause I just wanna see her (Bucket naked!!! UH!)\nShe was sittin home alone, sippin on Patron\nAnd she in my cameraphone (Bucket naked!!! UH!)\nShe was dancin in the club, she want that thug love\nNow she in that bathtub (Bucket naked!!! UH!)\n\n[Outro]\nUH! Bucket\nUH! Bucket naked!!!\nUH! Bucket\nUH! Bucket na-bucket na-bucket-bucket naked!!!", "year": null}]}