{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": "2007-08-21", "title": "Holy Moly", "lyrics": "[Talib Kweli]\nYeah, as a kid growin up in Brooklyn, my pops was a DJ\nHe had a bunch of records - funk, jazz, rhythm and blues, soul\nThere was this one gospel record I liked like, like\n\nLike holy moly, I might get some religion and leave you holy holy\nYeah, this rhyme is so fat it's roly poly\nI give you intimate details so you can get to know me\nThese corporate rappers like \"Why this dude pickin on me?\"\nYou rap your way to the top, but now it's gettin lonely\nKids is hungry and you lookin like a steak from Nick & Toni's\nBut don't nobody want your jewels, cause your shit is phony\nSay word? Your shit is real? Damn, your shit is corny\nMy rhymes turn a new page like Mark Foley\nAnd touch kids like when Larry Clark gave the part to Chloe\nRest in peace to Harold Hunter, the greatest from New York\nStarted out skatin for Zoo York\nWord hangin out at The Gavin, I was very lucky\nTo talk to Rash' once I got past Derek Dudley\nGot him on \"Respiration\", that's pre-Badu\nBet you Garnett Reid got a Matt Doo tattoo\nSometimes I feel like I'm drownin I gotta tread water\nHead above the water I always remember Headquarters\nHeads up, eyes open, I got my mind focused\nI find hope inside a line, my rhymes define opus\nSometimes hopeless people, fill my thoughts with evil\nMy record so hard it broke the needle\nAt the Mixtape Awards niggas act like they don't give a fuck though\nAnd disrespect the legacy of Justo\nWhat the blood claat? No, let the blood flow\nYou ain't come to pay your respect, then what you come fo'?\nToo many good niggas die, it's like a stop loss\nHood niggas ghetto like fried wings and hot sauce\nHow you hard? The cops lettin 50 shots off\nBaby Jay-Z's with the knockoff Scott Storch beat\nYou are not Short, you are not Katt\nYou're not a player or a pimp, money stop that\nLearn to master your speech and be eloquent\nRappers keep peddlin sweets, the beats weaker than gelatin\nWe used to kick up dust, now we settlin\nRest in peace to Dilla, Weldon, we can't forget you\nProfessor X and, Proof we miss you, word\nRest in peace to Shaka, twenty one gun salute\nIn the air like \"BLAKA BLAKA BLAKA\"\nYou're still here cause you're livin through me\nYou're like a gift God has given to me\nUh, uh, uh, what?"}], "artist": "Talib Kweli"}