{"artist": "Webbie", "songs": [{"year": "2007-11-20", "lyrics": "[Chorus: Webbie & Lil Phat]\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean, mayne?\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean?\nShe got her own house, she got her own car\nTwo jobs, work hard, you a bad broad\nIf you ain't on, sit down, if you ain't on, sit down\nIf you ain't on, sit down, if you ain't on, sit down\n\n[Verse 1: Webbie]\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean?\nBaby Phat, just relax, front your own flat screen\nBack rub, cook, clean and don't make her make a scene\nWhen you call her on her cellular, she tell you she don't need\nNot a goddamn thang, you a hot damn thang\nIf you think you finna get her with a goddamn chain\nYou insane, boy you better get some goddamn change\nShe a fool, been to school, even walked across the stage\nAnd she say, \"I love Webbie from his looks to his ways\"\nThe stilettos the J's depend on how the weather look\nFlip flop slippers just to show off the pedicure\nFlip flop niggas depend on how the cheddar look\nShe'll buy her own, I don't think she'll never look\nIn a man face standin waitin for him to take care of her\nShe'll rather go to work and pay the bills on schedule\n\n[Chorus: Webbie & Lil Phat]\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean, mayne?\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean?\nShe got her own house, she got her own car\nTwo jobs, work hard, you a bad broad\nIf you ain't on, sit down, if you ain't on, sit down\nIf you ain't on, sit down, if you ain't on, sit down\n\n[Verse 2: Lil Phat]\nShe a dome dime diva, gutta like Keisha\nWork that meter, she a good freaker\nShe stay on her shit, she got her own shit\nShe don't neva trip, all she want is that dick\nShe bouncy, flossy, keep them hoes off me\nGutta, lil slang, man I love when she talkin\nA independent chick, do you know what that mean?\nShe cook, she clean, never smell like onion rings\n22's on her whip, oh she do it large (she do it large)\nWhen she break a nigga off, got a nigga spoiled\nShe a bad lil chick, a fly lil chick\nHit me on my phone, she like to buy that dick\nGot her stunna shades on, lookin like something\nStallion, hair long, she a nice something\nLike to go to the mall every day for a outfit\nHair did, nails did, independent what she call it\n\n[Chorus: Webbie & Lil Phat]\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean, mayne?\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean?\nShe got her own house, she got her own car\nTwo jobs, work hard, you a bad broad\nIf you ain't on, sit down, if you ain't on, sit down\nIf you ain't on, sit down, if you ain't on, sit down\n\n[Verse 3: Lil Boosie]\nBoosie Badazz\nShe got her own house, drive her own whip\nRange Rover all white like her toe tips\nShe got a pretty smile, smell real good\nOnly time she need a man for that good joog\nThey buy the bar too, they superstars too\nThey be like, \"You ain't got no money? Take yo broke tail home\"\nIn Baby Phat they on, they clothes match they phone\nThey be like \"Yeah!\" when they song come on\nLeave the club kinda early cause they gotta go to work\nI mess with supervisors who got credit like Big Turk\nSo dusty feet, please don't bother me\nI got independent dimes on my mind who spoil me\nGucci hat, Gucci fit so sick\nThat's a gift from my independent chick, yessir!\nTryna get next to her, gotta be ya self, mayne\nCause she got her own money, she don't need no help, mayne\nBoosie!\n\n[Chorus: Webbie & Lil Phat]\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean, mayne?\nI-N-D-E-P-E-N-D-E-N-T\nDo you know what that mean?\nShe got her own house, she got her own car\nTwo jobs, work hard, you a bad broad\nIf you ain't on, sit down, if you ain't on, sit down\nIf you ain't on, sit down, if you ain't on, sit down", "image": "https://images.genius.com/3a2f27bb4d14a8df29bba09ff2e47948.600x600x1.png", "album": "Savage Life 2", "title": "Independent"}]}