{"songs": [{"image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg", "lyrics": "[Intro]\nYeah\nYeah, um\nUh\nLadies and gentleman\nYeah\nWhew, that drip\nYeah, okay\n\n[Verse 1]\nWritin' on writer's block, haven't slept in days\nThey wanna put me in the psycho watch, everyone's afraid\nOf what I do inside my studio, worried I'ma lose control\nThey rufflin' my feathers and they shuffling the Yu-Gi-Oh! (Yu-Gi-Oh!)\nExecution flow, at your neck like new cologne\nUno, dos, bitch, I'm in your head like Freddy Krueger though\nMy brain fried, always chasing the same high\nI'm too fucked up to function, do nothin' but waste time\nWoke up annihilated, lyin' on the pavement\nCovered in items I regurgitated under a fire escape\nAnd I know that it's Friday, 'cause every Friday they have a parade\nIn-front of city hall, hear 'em celebrate, they havin' a ball\nMy pupils dilated, highly dehydrated, I'm lost inside a giant matrix\nIsolate myself from eyes I find contagious\nJump above the comedown\nI'm strung out and nodding off inside the dugout\n\n[Chorus]\nDon't be scared, just come with me, yeah\nFeels so good to feel this free\nWhat are you afraid of? Tell me what you made of\nWhat are you afraid of? It's just a little angel dust!\nLa da da da da da da da\nLa da da da, la da da (Just a little angel dust!)\nLa da da da (Yeah,) la da da da (Yeah)\nLa da da da, ayy (It's just a little angel dust!)\n\n[Verse 2]\nYeah\nI'm playing hot potato on a Winnebago\nThe chips are stale, they taste okay though when they dipped in queso\nAnd what's an angel with a missin' halo?\nShe will drop out of school to take a trip to DayGlow\nFound a twenty laying by the sewer rats\nYou know little Stewart hasn't been in any movies lately\nHe's spent his paychecks on cocaine and latex\nHis agent workin' hard to try and book him a commercial\nWhat I do should not concern you, do this 'til I turn blue\nNot Eric Sermon, I'm more Merlin, curses turn 'em into bird food\nHurry to make the first move, I'm walking like Herschel\nAnd now we at the end of verse two, oh\n\n[Chorus]\nDon't be scared, just come with me, yeah\nFeels so good to feel this free\nWhat are you afraid of? (Woo!) Tell me what you made of (Yeah)\nWhat are you afraid of? It's just a little angel dust!\nLa da da da da da da da (Yeah)\nLa da da da, la da da (Said it's just a little angel dust!)\nLa da da da, la da da da\nLa da da da, ayy (Just a little angel dust!)\n\n[Outro]\nDon't fuck with the angel dust\nDon't fuck with the angel dust\nPlease don't fuck with the angel dust\nOh, please don't fuck with the angel dust!\nAw shit", "year": "2014-05-11", "album": "Faces", "title": "Angel Dust"}], "artist": "Mac Miller"}