{"artist": "Z-Ro", "songs": [{"album": "A Bad Azz Mix Tape", "title": "H-Town", "lyrics": "(Track)\nH-Town, going down, ooooh\nOh yeah (know we talking bout)\nAaaay, ay\n\n[Hook: Track]\nI'm oooooooout, H-Toooooown\nThese niggas, need to know what I'm talking about\nOooh you know, it's going down tonight\nSo get ready, you gots to be ready\n\n[E.S.G.]\nI'm talking two bedrooms, gated residential-aire\nE.S.G. and Boss Hogg, ask the Presidential playa\nRoley, mansion, my click expanding fa sho\nSwanging on 4's banging Z-Ro, smoking on do' close the 4 do'\nLooking so thoed you know me, see them agents can't hold me\nE and Slim on the track, we like Shaq and Kobe\nAlley-oop out the Coupe, and my troops gon march\nFrom the South to the North, look for the ice in the starch\nThere we go there we go, see our diamonds gon glow\nHouston Texas in the do', pour a pint fuck a fo'\nNo longer sitting low, changed my 4's to twenty three's\nFUBU on my chest, platinum Roley under my sleeve\nRiding V fucking 12's, keep the V-6\nMe and Rich getting rich, add shocks into my shit\nWho the click, playing it raw we wire your jaw\nE.S.G., Presidential Playas, we outlaws huh\n\n[Hook: Track]\n\n[Slim Thug]\nI'm out that H-Town Tex, where they don't barre plex\nInvisible set around my neck, I look good and reflect\nThe Slim Thugger, on 23's burning rubber\nSometimes I wanna shine, sometimes I roll undercover\nI'm from the City of Syrup, where young G's slang birds\nLooking good by the herds, full of that endo herb\nNothing less, Down South we puff on the best\nWhen I blow I just say no, to that stress oh yes\nSee I'ma clown top down, pop trunk and surround\nIf you love me you gon smile, if you hate me you gon frown\nWe hold it down, Boss Hogg Outlaws ain't po'\nWhen I'm in town I can be found, checked in the top flo'\nPresidential playa, with mo' respect than a mayor\nSuper thoed flow sayer, and I ain't no sprayer\nSlim Thug, E.S.G., putting it down with the car\nWe Presidential playas, taking over the charts ha\n\n[Track]\nSee these Presidential playas know it's going down\n(going down) they know it's going down (going down) yeeah\nSee these H-Town playas know it's going down\n(going down) going down (going down) yaaay-yaay (going down)\n\n[H20]\nSee we sitting blow do in the low-low, rolling killing\nBout to break the coffee down, dump it in the swisha\nI see them niggas in the front, talking loud and capping\nTrue bad boys, move in silence make it happen\nMy niggas, get smoked out high niggas\nBranded up down to ride, for G.I. niggas\nWe ain't gangstas, but demand respect\nAy yo let's cash some checks, while them other niggas plex\nMoney, sex and hoes and hoes\nPeople screaming my name, doing sold out shows\nAin't got time for rap wars, we gon shine like stars\nPeople see me at the bar, with E.S.G. in a car\nFuck em all I'ma ball, with my niggas that stack\nAnd just love to smoke sacks, with they mind on mack\nI'm a Presidential playa, nigga you ain't know\nG.I.N. branded up, going down fa sho\n\n[Hook: Track]\n\n[Lyrical 187]\nI passed that Harm Clark, and Buffalo and Few Quay\nWoke up on the North, at Antoine and Golf Back\nWhile I'm out here, I need to go and get that Swisha House tape\nWith them freestyles, the one that 5000 Watts made\nIn H-Town we put it down, from the North to the South\nGold grills and platinum pieces, ballas holding down shop\nSeems full of chickens, clocking in the parking lots\nBe careful with that drank, cause the laws stay hot\nMLK to Homestead, playa choose your spot\nYou know it's warm around this 3rd Coast, so drop your tops\nG.I.N. and Presidential, with that boy from Wreckshop\nAnd Mr. Slim Thug, we feel we can't be stopped\nIt's been a long time coming, the sleeping down had to wait\nNow it's too late, them Texas boys got too much weight\nSo stop hating, you know you know the way we put it down\nFor the Dirty Dirty South, representing H-Town\n\n[Track]\nI wish, got my G's from H-Town, it's going down\nI wish, got my G's from H-Town, it's going down\n\n[Hook: Track]\n\n(Track)\nSee these Presidential playas, they stay ready (ready)\nMoving Cheves (Cheves), ooooh-oooh-ooh\nSee these Presidential playas, they stay ready (ready)\nMoving Cheves (Cheves) oh-I oh-I", "year": null, "image": "https://images.genius.com/61c7d6d0f92c90c1f5d454e933477bb5.500x500x1.jpg"}]}