{"songs": [{"image": "https://images.genius.com/e723a4b2d038c34df13108415deee7cf.640x640x1.jpg", "album": "Ground & Water", "title": "Feet On The Ground", "lyrics": "[Verse 1]\nUh, it was cold how they did it\nBut it just warming up\nNo more covering up, not a storm as us\nElon Musk is just a long arm of the just\nFun crushing all law unjusts\nI adjust the bar on your stereo tie your system up\nTwist the [?], twist stereotypes\nFuck the system up, twist the [?]\nFuck a nigga up, all [?]\nFuck outta my face 'fore I get the pump\nI'm trying to get a pump 'fore I listen to Lil' Pump\nLil' punks got Hip Hop feeling a lil punk\nBut it's cool, I bang that shit too\nThat shit make em rap to get boost\nOn the West Coast shout (to everybody)\nOn the East Coast..\nRedefinition had a nigga with a cheese toast\nThree dope sixteens every beat\nAnd my feet is right back in the street\nGun smoke!\n\n[Verse 2]\nUh, and it was wrong how the song went\nAnd just hits, I needed help\nReaching out into heaven\nWith my feet in hell, oh well\nHow deep did you go before the water flows\nB L U, I make the water global\nCall me local and I say I'm international\nBut call me local and a nigga might snap on you\nBig B L, they got a bad rap on you\nBare back, back to the pen pad and paying dues\n'Cause ain't a new trap song under the sun\nStill, I still feel trapped amongst everyone\nEvery gun I ever had, I lost and never bust it\nTen years past and now the pen is ever rusting\nAlways been trusted, till one day I lost it\nEasy to crucify somebody if the cross fit\nAll this talk to get me six feet deep\nBut  my feet are still up on the street\nGun smoke!\n\n[Verse 3]\nNigga got the [?]\nEven when I was out of it\nI do get clouded from the spliff hanging outta my lips\nCount the bliss, call it a blessing and keep pressing\nEven I don't wanna be free but keep dressing [?]\nKeep perfecting your role, keep [?]\nSpit blessing and flows to touch the rest of the globe\nManifest to be whole, a man professing his soul\n[?], i'ts the same old song, y'all\nWe talking about practice, and you're an actress, dawg\nWe talking about practice, to be a master\nThe master never out-shines the sun\nAnd dues get reined on by everyone\nIn the happiest tons, and the lizard was gone\nMost can't believe that we still living this long\nI gotta write a new song to a beat this week\nTo put my feet right back on the street\nGun smoke!", "year": null}], "artist": "Blu & Damu The Fudgemunk"}