{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/24c5c29fe788fe669929c7cd90a09600.412x412x1.jpg", "title": "Boat", "lyrics": "[Intro: Chevy Woods]\nThat's all these niggas rap about is trappin'\nA nigga been did that\n\n[Hook: Chevy Woods]\nHunnit pack boy you ain't never seen a hunnit\nHunnit pack boy you ain't never seen a hunnit\nIf you ain't never been a boss a lot of work got frontin\nOut of town full of duffle bag full of that dope\nAnd a nigga bad hand for car money now a nigga need a boat\n\nI need, I need a I need a boat\nI need a boat, I need a boat, I need a boat\nI need a, I need a, I need a, I need a, I need a boat\nI need a boat, I need a boat\n\n[Verse 1: Chevy Woods]\nDouble knock at the door that's the code to the trap house\nBeen a junkie bout an hour, used to let me use the crib thats a trap out\nI done been did all that shit niggas rap about\nDrop a bag when you hear a motherfucker click boom get you ragged out\nI need a hood with some cribs and some motherfucking OG's\nTap, tap what the fuck? 5 shots in your chest if you owe me\nBetter keep it ding round here, dirty money try and clean round here\nBullets cold ding round here, make her suck a nigga lean round here\nScared for my hood, tell me what you pussy niggas even need round here\nI be with good shooters they don't even need a motherfucking bean round here\n48 hunnit I done seen so many niggas bleed round here\nStreets sleepin' go brrrrrr get a pussy nigga clean round here\n\n[Hook: Chevy Woods]\n\n[Verse 2: Kevin Gates]\nWhat up? Cut up? I don't get tired\nOut of town nigga bout to pull up on a taxi\nMake a left on East Buchanan, make a left on Carolina\n23, 29 transaction\nWhat you tryna get? Need a spliff? Action\n18 O's, 500 4 grams\nWeigh it on the scale only that without the bag\nAdd an extra gram when you weigh it with the bag\nReal street nigga, I ain't ever seen a hunnit\nWhere the clique house be, you would think I have a hunnit\nInterstate, enter state, now we go and get it\nMustard on the yellow before you stuff it in the vender\nConnect trying to bring them I was buying 2 minutes\nSlow down find another blood and he coming with it\nI'ma cut them up and ima test them right infront of you\nPut them gloves on before I even see the bundle\nFinger press a mother fucker nigga never fondle\nMaking sure a fishscale, I don't sell all base but I could make it all\nShake, especially in the drought\nHit me with the re-compress, you gon have to kill me taking food out my kid mouth\nMaybe you don't feel me I'ma die bout respect nigga you really seen me\nA hunnit pound of green in a 18 [?]\nI only sell dope, told Lito come and get it\n\n[Hook: Chevy Woods]\n\n[Verse 3: Chevy Woods]\nStart the car on you niggas I don't even need keys\nTwo hundred on the dash, you a hunnit nigga so round twice your speed\nHit a nigga with the pack, he don't bring nothing back then you know what it is\nWhite clean off the mac if you know where you stay it ain't safe round here\nI see the jealously all in your eyes nigga\nHeres a table with about 4 pies nigga\nPour killas, Im the truth you a lie nigga\nIf he ain't table then you know he ain't mine nigga\n48 hunnit\nI was on tour some real break out on the road\nAnd a bitch ass nigga hit my spot for about a quater bird\nI ain't even trip that come with the gang\nNow what thats worth its all in my chain\n\n[Hook: Chevy Woods]"}], "artist": "Kevin Gates"}