{"artist": "Preme", "songs": [{"album": "Off The Books", "title": "Simple You", "image": "https://images.genius.com/70bfaab8ab60abc2c2be1b84b345a76b.760x760x1.jpg", "lyrics": "[intro: The Code]\nHad To Go, Had To Go...x4\n\n\n[Verse 1: P. Reign]\n\nOur nights always lead to mornings with tylenol, white wine and adderall got us deep in our dialogue, at my favorite spot where the lights are dimmed when the sky is dark, and she just can''t get over not having to wait in line at all. Simple girl, attracted to simple things, love and hate tatted under her nipple rings, know i'm diggin your style you feelin' my smile, I guess it's safe to say that we're going to be here for a while\nChill and laugh a bit, I can tell you're passionate, body like a model i told her to find some management, she laughed again, and said \"you talented. you probably got those pick up lines memorized like the alphabet, never met a man with a lifestyle that's so extravagant, well I'm intrigued by the fact you speak different languages, spoke for hours with the candles lit, both be passionate, look at the way we met, turned out to be the greatest accident.\"\n\n[The Code]\n\nBaby... Ohh\n\n[Verse 2: P. Reign]\n\nUff, that freakin' dress when your body moves, something special inside of you, knew it from when I spotted you, just take a shot or two, I don't want to lie to you, man enough to tell you I never want to say bye to you. Feels like we got a deeper than average connection, she smiled and said \"It's true, think our bond is impressive. You must be proud when you see your reflection, them chiny eyes with your complexion is utter perfection. I wanna be the one you runaway with, came along way from sneaking girl's into my momma's basement, let's go back to my place and finish this conversation. I Breath, She agrees without no hesitation. We leave, as I pause for a mental celebration. It's the smell of your fragrance that got me so impatient, told her show me your spots and I'll show you dedication, I hope you're wild as your imagination\n\n[Outro: The Code]\n\nBaby...Ohh\n\nObsiously we both have...", "year": "2015-12-03"}]}