{"artist": "Andre Nickatina", "songs": [{"title": "Nickatina Creation", "album": "Raven in My Eyes ", "year": null, "image": "https://images.genius.com/c1330c23535f72013404c70819b54875.500x500x1.jpg", "lyrics": "Gentlemen. Welcome. i look foward to a tounnrament of truly epic proportion. We are unique gentlemen, through long years or rigourous training, sacrafice , denail pain\n\nYea this is uh a nickatina creation. You probablly never heard nothing like. This but check it out\n\nI got flavor and all them thangs you know. Yea Bitch suck a dick or hit the door.Its like a vessle clearer than a crystal, hotter than a pistol, man I give a whistle. And gather up my converse in a hurry niggas flock together like ravens in the bird the movie the movie by Alfred Hitchcock Bitch I got your block bitch i got your block on Krytonite lockdown and worship like a Kansas City Royal or a chick thats up in Bagdhad living of of oil, Rough and ready eatin on Italian made speghetti the way I pin the grass mothaf**kers call mr Teddy, bear yea litte rug Yogi, f**k them US made TV's I'd rather f**k with Sony Mitsubish my girl's name is Sun Duck Kim, her father is the president of IBM \"Thats him\" is what the cops say when they fear Nicky Im thinking cash burns I get ghost on the piggy to the den Andre Nickatina all in A NIGGA MAKING DIKES WANT DICKS AGAIN :)The ace of spades, shit can get colder than a glacier But sweeter than them licorice or them zig zag papers yous a scalywag you wait for ? and you wear a tote tag but bitch i leave a gash like a 44 mag real dash-board I race like shaba just to put a gun on OG he yell \"Mama daddy\" someone call the fuzz mother f**ker down with them columbian drugs im not a savior shit vibrates like a pager i got my bow and arrow stretched just aim her something propper, swinging blades like a helicopter instead i crab meat spend my cash and chow down on a lobster with the sauce bitch my boss back and get raw f**king with criss you gonna get crossed out nothing but dick in your mouth went to vegas to see the tyson fight and brought a quarter ounce, to smoke to sell, you really can't tell so many fine hoes you think its heaven or hell, you pick,my timer tick tock a timex, niggas look for pussy when they can't find sex\nThis is uh, a nickatina creation. Todays what baby-October third about 330 in the morning. And we awake like an owls"}]}