{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/7e8707e6b431e1efcbbd7d7e6cd95c9c.474x450x1.jpg", "title": "100 Rounds (Original Version)", "year": "2008-02-05", "album": "Half a Klip", "lyrics": "[Kool G Rap]\nFo'-fo' calibre spit game, you know?\nKGR, Giacana, Queens runnin things you know?\nKnow it!\n\n[Verse 1]\nAny nigga crazy enough to take G for a joke\nI don't know about your flow but I'mma see that you float\nCause I don't waste my time beefing with dopes, the heat smokes\nOnly microphone niggas speaking to me on this rope\nGet some hood bitches to point out where you and your ho live\nA crack head can even MAC 11 your whole crib\nGet twenty holes in your wig from eleven-year-old kids\nOnly twenty-two when they come from eleven-year-old bids\nFind out ya racin to the 5-0 station\nGot a Jake on a payroll to give your location\nI'mma shove a machete inside your ass like Jason\nEnd up a fresh nig' buried in the basement\nThat's how we movin, got killers from other coasts\nGive some pennies to wire whips with explosives\nWe okay niggas to death at high doses\nColumbian necktie, nigga you closest\n\n[Hook] {X2}\nYou know it's trouble when the Click come around here\nShit that we totin, gotta get from the sound here\nWhoever want it on your script, gun 'em down\nSpin your whips, Hummers round with a swift hundred rounds, yeah\n\n[Verse 2]\nGive two of them things to a frame in armour\nRazor blade a nigga face like he came from Uganda\nRun in your shit aiming the llamas, while your dame in pyjamas\nThen you watch while niggas banging her posture\nAll we want is them C-notes, that bundle of dope\nYou can play hero and die, try to rumble with toasters\nJust be easy baby boy, it only take us a minute\nGot a bag of yay, some pussy and some cake to split it\nCross right over your line nigga we take the scrimmage\nKeep the stones and the jewellery blue as the face on the grimace\nNew York State menace with eight's by the appendix\nNo lactose in it, get raw freight from the chemist\n\n[Hook] {X2}\n\n[Outro] {X2}\nStop acting like you ain't know me, you know my name yo\nStop acting like you don't notice the way my chain glow\nStop acting like you ain't loving me in my mink coat\nYeah, yeah, yeah, yeah"}]}