{"songs": [{"year": null, "title": "For My Hustlaz", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "[Intro]\nIt don't get no betta than this (uh-uh)\nUh, uh, uh, uh\nB-K muthafucka\n\n[Verse 1]\nIt's a shame but, alot been change since we came up\nI used ta run wit them, now I got my guns for them\nTreat my hollows like trash, strait dumpin' 'em\nSauce Money show niggas no love when I come for them\nThey thought they left a real nigga on his ass black\nAnd that my numbers wouldn't rise like Nasdaq\nAnd gotta re-half that, just pass that\nWe 'gon clash black for playin' the middle like ya ass crack\nYou can ball ova here, I play pass that\nExotic cats love ta talk peace when you blast back\nNo more fair ones, know you shot enuff of them\nDon't really wanna do it, now you gotta fuck wit 'em\nI'ma shit everytime that I hear ???\nAnd make ya real ugly like bitter beer face\nSendin' fake thugs back ta the essence\nSince my Rolex was a gift, there's no betta time than the present\n\n[Hook]\nThis one is for my hustlaz\n(Right!)\nLadies don't tustle wit bustaz\n(Not tonite!)\nIf you a dough gettin' swinga\nNiggas act funny wit cha money\nWhatcha do?\n(Give 'em the finga!)\n\nThis one is for my hustlaz\n(Right!)\nLadies don't tustle wit bustaz\n(Not tonite!)\nIf you a dough gettin' swinga\nNiggas act funny wit cha money\nWhatcha do?\n(Give 'em the finga!)\n\n[Verse 2]\nI dedicate this ta cats want they cheddar ta rise\nFifty grand too much, O.K. Seventy-Five\nSauce Money kinda cat you could never despise\nHit the streets lookin' like you a betta disquise\nGet a grip, I'm the preacher, you dance wit the devil\nWhoever my eyes focus on is not on my level\nNot even close, ex-girlfriends hatin' ta see it\nYou can give me brain or get out, take it or leave it\nRelax wit side who, max wit my crew\nOperation gettin' money, that's what I do\nInsecure artists pay me not ta spit\nShow me fake love and then try ta fly if they hit\nThey could feel it in they bones, cuz when I drop my shit\nAll hell'll break loose, that's how hot I get\nI rock big in the summer, witout missin' the block\nWhen I wanna get M, then I listen ta Pac\nScarface when I'm laid back, whippin' the 3\nIf I wanna hear that shit, then I listen ta me\nStick in the key, turn the knob and open the door\nPrevokin' a war, cats saw us smokin' the 4, fo' sure\n\n[Hook]\nThis one is for my hustlaz\n(Right!)\nLadies don't tustle wit bustaz\n(Not tonite!)\nIf you a dough gettin' swinga\nNiggas act funny wit cha money\nWhatcha do?\n(Give 'em the finga!)\n(Give 'em the finga!)\n\n[Verse 3]\nLook, I like ta come through and run up in 'em all night\nBring my man too, Mami if it's alright\nI'ma a big one, but I like ta ball out\nSip Henny, smoke dro 'til you fall out\nHit 'em wit that Marcy maneuver, makin' 'em droppin'\nI ain't met one yet make me take her shoppin'\nBut I might cuz I gotta lotta cash ma\nPlatinum Navigator Glock when the stash ha\nRolex, Cuban Link, now the riddle comin'\nDo I know about 69, a little sumthin'\nI like ya point-blank style, you in it ta win it\nBut before I go downtown, gimme a minute\nYou got ta shower up, make sure no dirt in it\nI got the Pro-Fo, neva eva squirtin' it\nThat's a thong, (damn), baby you just hurtin' shit\nBring that thing here baby, show me what you workin' wit\n\n[Hook]\nThis one is for my hustlaz\n(Right)\nLadies don't tustle wit bustaz\n(Not tonite)\nIf you a dough gettin' swinga\nNiggas act funny wit cha money\nWhatcha do?\n(Give 'em the finga!)\n\nThis one is for my hustlaz\n(Right!)\nLadies don't tustle wit bustaz\n(Not tonite!)\nIf you a dough gettin' swinga\nNiggas act funny wit cha money\nWhatcha do?\n(Give 'em the finga!)\n\n[Outro]\nThis one is for my hustlaz\nSaucemuthafuckin' for the year 2-O-O-O\n(Hustlaz)\nNiggas betta recognize\n(Hustlaz)\nI'm just gettin' started muthafuckaz\n(Hustlaz)\nGet yo shit off now\n(Hustlaz)\nIt don't stop\n(Hustlaz)\nB-K nigga\nMarcy\nWorldwide\nYou know the drill\nCut a check or suck a dick", "album": "Middle Finger U"}], "artist": "Sauce Money"}