{"songs": [{"lyrics": "Yes! Yes! Thank you for inviting me here for my final speech\nLadies and gentlemen, homosexuals, lesbians, and transvestites\nAllow me to introduce myself as the Hungry Hustler, Afroman\nI am the American Dream. Even though the government tried to experiment with me\nBy placing me in the projects, I'm still the American Dream\nSurrounded by drugs\nJeopardized my life by living around thugs\nBut I'm still the American Dream\nKicked outta Palmdale High School\nBecause I was considered a distraction to the educational process\nI've traveled through the complete metamorphosis of the justice system\nAnd I'm still the American Dream\nEntered Juvenile Hall as a tadpole;\nHopped outta prison as a bull frog\nBut I'm still the American Dream\nThe most rejected, disrespected\nWhen I went for a job I was never selected\nBut I am still the American Dream\nAnd right about now\nI find it quite serendipitous to see that all of you some-timin'\nWishy-washy, two-faced, back-stabbin'\nConiving hypocrites have accumulated here in my midst to persecute my character\nWith such flagrant slanderousity\nBut I counter-attack by calling it constructive criticism\nAnd all of your negativity has been recycled into motivation\nAnd I am still the American Dream\nAmazing Grace, how sweet the sound that saved a wretch like me\nI once was lost, but now I'm found; was blind, but now I see\nThere's a lot of people out there who can identify with me\nYoung lady right here, you may be a single teenaged mother\nBut you are still the American Dream\nThe lady next to you, yes. Your breasts may not be as big as men think they should be\nBut you are still the American Dream\nYoung man, you may not be a baller, shot caller\nWith 20 inch blades on the impala, but you are still the American Dream\nYoung man right here, you may have spent all your money on a hood rat bitch\nAnd didn't get no pussy last night, but you are still the American Dream\nYes sir, I am just like Ham. I'm for the black man\nThe mexican, and even poor white\nAll human beings that have no rights. So put down your past, pick up your future\nFollow me as we journey through the Red Sea\nCause I have been to the mountain top\nI've seen the Promised Land\nMine eyes have seen the glory of the Underground Category\nMy mind has been delivered\nMy spirit has been reinstated from the Corporate World's modern-day slavery\nI've been emancipated. Free at last! Free at last! Fuck a drug test\nI'm fittin' to roll some grass. Love, peace, and Afro grease, Fro-ever! Buccooocc!\n\nA-E-I-O-U, and sometimes W. 'Cuz I'm high, cuz I'm high, cuz I'm high", "title": "The American Dream", "album": "Because I Got High", "image": "https://images.genius.com/286e5a371c850693e27da49e4af749c5.300x308x1.jpg", "year": "2000-03-04"}], "artist": "Afroman"}