{"artist": "Fashawn", "songs": [{"year": null, "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "Produced By: Exile\n\n[Intro]\nMake them believe\nThis my song to talk\nI don’t know no other way\nEvery word that you could say\nHeard it all before, before\nHeard it all before\n\n[Verse One: Fashawn]\nEvery time that I’m doing right\nYou assume that I’m doing wrong\nWell as long as I’m doing me\nNever mind that shit you be on\nSee I got a problem with liars\nMight as well be wearing a wire\nSick and tired of be sick and tired\nI’m uninspired, dealing with smiling faces\nFor dollars they silent fading\nI can let it continue or simply I can replace it\nTake it back to the essence, take it back to the basics\nTo procrastinating, knew all my addicts was waiting\nWas that you was watching the news, it’s merely just entertainment\nAnd fuck reading bout history and when I went out and made it\nGo get your head out the clouds, keep both feet on the pavement\nOften get lost in the world, prisoner of temptation\nYou prolly coulda, shoulda, woulda, but nigga you didn’t\nUsed to be a reflection now you just an image\nGot me second guessing, answering the question\nI’m just searching for the truth\nCould you point me in his direction please?\n\n[Hook]\nIt’s my song to talk\nCould you point me in his direction please?\nI don’t know no other way\nIt's all I know\nEvery word that you could say\nHeard it all before, before\nHeard it all before, come again, before\nHeard it all before\nHeard it all before\nHeard it all before\n\n[Verse Two: Fashawn]\nSaid you gon do it, then do it, all about showing and proving\nYou really give it your all, there’s always room for improvement\nAre you on a hallucinogenic, seeing illusions\nIn a state of euphoria, under the influence\nKid it's a sobering feeling, when you--hold up let me finish\nWhen you focused on winning, and you know it’s no limits\nAnd nothing’s guaranteed, this shit can change in an instant\nRather I go with the major or I stay independent\nAll nobody can win it, all I need is my team and maybe a personal Jesus\nI don’t know what to believe in, constantly chasing and dreaming\nDay to day and the reason, to get this paper I’m eager\nMis-educated by teachers, who said my destiny was death or incarceration\nBut damn, didn’t I make it, got no congratulations\nWondering who I can put my faith in\nThinking about all this time that I’m wasting\nCan we have a conversation please?\n\n[Hook]\nIt’s my song to talk (could you point me in his direction please?)\nI don’t know no other way\nEvery word that you could say\nHeard it all before, before\nHeard it all before, come again, before\nHeard it all before\nHeard it all before\nHeard it all before\nMake em' believe [X6]", "title": "Heard It All Before"}]}