{"artist": "Ice Cube", "songs": [{"title": "A Gangsta’s Fairytale", "lyrics": "Intro: Little Russ, Ice Cube\n\n[Story-teller] Once upon a time, in the black part of the city\n[Young kid] Yo G, yo G you better get out of here man, 5-0\n[Door swings shut, car peels out]\n\n[Russ] Yo Ice Cube, man\n[Cube] Whassup man?\n[Russ] Why you...\n[Cube] Whassup?\n[Russ] Yo Ice Cube man, why you always kickin the shit about the bitches and the niggas? Why don't you kick some shit about the kids, man? The fuckin kids?!\n[Cube] Word\n\n[Verse One: Ice Cube]\nLittle boys and girls, they all love me\nCome sit on the lap of I-C-E\nAnd let me tell ya a story or two\nAbout a punk-ass nigga I knew\nNamed Jack, he wasn't that nimble, wasn't that quick\nJumped over the candlestick and burnt his dick\nRan up the street cause he was piping hot\nMet a bitch named Jill on the bus stop\nDropped a line or two, and he had the ho\nAt that type of shit he's a pro\nSo Jack and Jill ran up the hill to catch a lil nap\nDumb bitch, gave him the claps\nThen he had to go see Dr. Bombay\nGot a shot in the ass, and he was on his way\nTo make some money, why not?\nDown on Sesame Street, the dope spot\nThere he saw the lady who lived in a shoe\nSold dope out the front, but in back, marijuana grew\nFor the man that was really important\nWho lived down the street in a Air Jordan\nRide to the fellow Mister Rogers and hoes\nDrove a 500 sittin on Lorenzoes\nHe broke out, Little Bo Peep, smoked out\nSaw, her and her friends sellin sheepskins\n[Little Bo Peep] Yo yo I got them sheepskins\nYo, my empty sheepskins\nYo baby, what's up with that?\nHickory dickory dock, it was twelve o'clock\nCinderella ain't home must be givin up the cock\nI don't doubt it, she is kind of freaky of course\nHad a fight with Snow White, she was fuckin her dwarfs\nSaw a fight over colors, too\nRed Riding Hood, and Little Boy Blue\nA bad influence? Yo I don't know\nBut Ice Cube'll tell the kids how the story should go\n\n[Interlude: Little Russ]\nYeah money, that's it, yeah money, that's it\nThis is Little Russ in the house\nRock that shit homey, rock that shit!\n[Well, you know the rest]\n\n[Ice Cube]\nHumpty Dumpty sat on a wall\nWith a joint, drinkin some 8-ball\nThree little pigs in a Coup de Ville\nLookin for, the wolf to kill\nThey're fucked up and they want revenge\nThem and Humpty used to be friends\nNow they're enemies cause he's a traitor\nPulled out the Uzi cruised by and sprayed him\nCinderella hoeing for the fellas\nAnd Mister Rogers is gettin mighty jealous\nOf the cash that the pigs were makin\nTime for the pigs to get turned to bacon\nCause Mister Rogers found out quick\nThat Humpty Dumpty was blown to bits\nThey said that the motherfuckin wolf was next\nSo Mister Rogers better watch his step\nSo he let the wolf know\nWe're gonna fuck up the pigs, and take their ho\nCause Cinderella is much too fast\nBefore twelve, givin up ass\nDouble barrels all loaded and cocked\nAs soon as they show, they gonna get popped\nThey bailed down Sesame Street and caught em\nLittle Boy Blue is up front givin orders\nLittle did they know Cinderella was a fink\nShe called the cops and got thrown in the clink\nA bad influence? Yo, I don't know\nBut Ice Cube'll tell the kids how the stories should go\n\n[Outro: Little Russ, Ice Cube]\n[Cube] Aiyyo man was that dope enough for you?\n[Russ] Yeah you aight, you in the house\nWe outta here, seeeee-yaaaaa\n[Cube] Yeah you better go home before I whoop your little bad ass\n\n[Barney Rubble] Some bedtime story huh?\n[Bugs Bunny] It's a nice place to visit, but I wouldn't wanna live here\n[Andrew Dice Clay] Ay, good ol' Mother Goose, remember her? I fucked her", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16"}]}