{"artist": "A$AP Rocky", "songs": [{"title": "Grown Up", "image": "https://images.genius.com/5ff1cf6959ea5afde5004b68062591ff.500x500x1.jpg", "album": null, "lyrics": "[Verse 1]\nBachelor with no tux, still got my shirt cuffed\nStill got my sleeves rolled up and my shirt tucked\nGrown up? Sure enough, sipping on that syrup\nPurple Label shit, yeah, I wear what I sip\nScarface vision, see my visions on a blimp\nAnd a quarter key will turn a G into a gent\nAll-purpose flow, we are the great\nI'm so Kurtis Blow, and these are the breaks\nMy Christian Louboutins got nails, give me hammer toes\nNiggas get shy when that camera rolls\nDrop crotch pants will remind you of them Hammer clothes\nAll-yellow Phantom, I'm like Yeezy in that amber Rolls\n\"Ah-ha-ha-ha-ha,\" but who am I kidding?\nNo way I could afford it so for now I'm just pretending\nHow these gold diggers digging without a single pot to piss in?\nCause my pockets full of lint and my heart is full of vision, I'm grown\n\n[Hook]\nI don't do kid stuff much\nNiggas say, \"Now, nigga all grown up\"\nI don't hear y'all much\nI'm all grown up, tough luck\n\n[Verse 2: Seth Narley]\nCurtains drawn and six dudes back\nThe chauffeur ride in the front as we speed to the dot\nDeanna waits along with the classy mist\nMy waist my shoulder blades the type you can't resist\nPicture this: being 21 with a gift\nBamas don't understand how I'm swift\nOr I'm MJ-nice, like Jordan up on the mic\nAmen for the new saviors of rap\nMy birth's 3/89 but I'm 30 up on the track\nThat's grown man, little homie, that's real rap\nY'all trying to switch up the style, I'm bringing Versace back\nGiovanni, Medusa, and all black\nHot boy, I done ran through hell and walked back\nPassport is stamped from sightseeing the map\nAnd to think, I'm asleep but won't blink\nI'm dreamin all this within, Young Leo, Inception\nCome again? No offense\nBut fuck whoever said wearing slims was a trend\nMore like a lifestyle in the rawest form\nAll grown up, nothing like before", "year": "2011-10-31"}]}