{"songs": [{"title": "ODd Party", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nI had straight A's like a flat chest\nOn my rap shit, I run the web like arachnids\nAll this from a black kid from the west side of Chicago\nThe only way that I know that I'll go is fucking full throttle\nNow that's a cool motto\nThat's all I've ever known since I started this\nThinking what I'm gonna do, but I should put my heart in this\nGotta play your part in this play and I'm playing the lead\nI find it hard to miss playing for keeps, it's deep\nDeShay\n\n[Chorus: Kent Jamz]\nYou've never heard me out before\nAll the girls adore me now\nInsane and wild, it's crazy how it all worked out for me\nNow, all the girls know my song\nAnd they wanna take me home\nI'm staying wild, it's crazy how it all worked out for me\n\n[Verse 2: Casey Veggies]\nEven [?], down for me or get up and leave\nGirl, you can't even get a apple, this ain't Adam & Eve\nI actually just had a vision I was stuck in a tree\nAnd these hoes be sticking me out like some [?] in your mouth\nWhen asked who they favorite rapper, I always pick down south\nAnd in my city, I'm a star, so girls know who I are\nI don't even front, I'm in the back of the car\nLooking at the back of your girl, she backing it all\n\n[Verse 3: Joon]\nI'm trying to stay the same, learn the power of the game\nKeep my feet planted on the ground\nBut it's kinda hard being down to earth when they drumming off the earth\nKeep my head in the clouds\nGuess I'm taking and break it on down, I smoke weed for the hell of it\nIf you ain't 'bout your business, [?] then partner, don't even email us\nHaters, I can't stomach them\nAll of them can Humpty Dumpty off the face of the earth\n[?] mind of Columbus\n\n[Chorus: Kent Jamz]\nYou've never heard me out before\nAll the girls adore me now\nInsane and wild, it's crazy how it all worked out for me\nNow, all the girls know my song\nAnd they wanna take me home\nI'm staying wild, it's crazy how it all worked out for me\n\n[Verse 4: P]\nOh, my God\nThat chick was bad, did you see her, dog?\n[?] slow, let it flow, ain't gotta press too hard\nNice to see you today, would you come out and play?\nI got a First Class ticket to the sky where I say\nSo tell your man \"bon voyage\"\nThe world loves OverDoz. and where we go, the crowd [?]\nMake us feel it in their hearts\nGet them high like spaceships, yeah, we taking off\nEverything you wishing for, baby, I'm your shooting star\n\n[Verse 5: Kent Jamz]\nThese L.A. girls ain't as innocent as they may seem\nShit, before they tweet me, they gotta go through Cream\nEven if they got a cute laugh, big old butt\nI'ma be looking like a Scream mask, baby, what's up?\nI'm cannot [?], harder to see\nAll the models with ass all part of your needs\nIf you roll with more Crips, then it's harder to be\nMy ash used to be kush, so it's harder to see\n\n[Chorus: Kent Jamz]\nYou've never heard me out before\nAll the girls adore me now\nInsane and wild, it's crazy how it all worked out for me\nNow, all the girls know my song\nAnd they wanna take me home\nI'm staying wild, it's crazy how it all worked out for me", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}