{"artist": "Bone Crusher", "songs": [{"album": "AttenCHUN!", "title": "Grippin’ the Grain (Remix)", "year": null, "lyrics": "(Bone Crusher)\nAttenCHUN!\n\n(Intro - Bone Crusher [Bun B])\nBC: Bone, bone, bone, bone, bone, bone, bone (This line repeats 4X)\nBB: Break Em' Off (4X)\nThat Grippin' the Grain remix\nBreak Em' Off in here\nUGK in here\nLil' Flip in here\nWe all in here, know what I'm talking about\n\n(Chorus 2X - Bone Crusher)\nGrippin' The Grain\nFrom the front to the back\nCan you feel my wolfers bang?\nComing down bumping, knocking pictures off the wall\n\n(Verse 1 - Bone Crusher)\n87 while I'm gripping the grain\nPimping is hard though, ain't a damn thing changed\nComing down so clean, shouts out to Texas man\nI'm so fresh, my nigga you didn't know\nCrispy starch jeans, starched down to the floor\nHeavy set exterior, deep into the floor\nWhat's y'all bitches talking about, you niggas ain't hardcore\nThis here the major don\nGot the speakers in the trunk, bump, bump, bump, bump\n\n(Chorus 2X - Bone Crusher)\n(Last line in verse 1 run through 1st line in chorus)\n\n(Verse 2 - Bun B)\nYeah!\nIt's Bun B, that underground king on top of ground\nIn that Cadi slabbed out with rags out and it's down\nChromey belts, buckles and blades that chop up and pound\nSee the Neon in my trunk when I'm popping surround\nYou be sipping on that oil, you dip off in that foil\nPut that water in the pot, watch me whip it when it boil\nPA I'm staying loyal, I keep letting them hang\nUntil they free that Pimp C, Steven Jackson get the rain\nWe gonna be..\n\n(Chorus 2X - Bone Crusher)\n\n(Verse 3 - La Chat)\nI'm riding I - 85, big body Benz with spinning tires\nBubbling eye signals on the mirror, when I turn the ride\nAnd the inside is just plushed out, wood grain and leather\nClothes like feathers, navigational system ready to go where ever\nAin't that clever, TV's in the backs of the head rests of the seats\nPlus that beat, you can hear the words of twist when I'm rolling down the streets\nSo beep beep, let me have a lot of room while I'm switching my lanes\nFast like a train, styling and profiling while I'm grippng the grain, we..\n\n(Chorus 2X - Bone Crusher)\n\n(Verse 4 - Lil' Flip)\nWell I'm gripping the grain and flippng the caine, keeping my pockets fat\nI got dubs on my Jag, screens on my Cadillac\nI pack a gat, nigga take it cause it ain't no time for wasting\nGot a tech on my lap, plus a nine by the Play Station\nI riding high, getting bent, smoking weed, passing by\nEven when I'm just chilling, I still dress fly\nI'm a pimp until I die, I'm putting it down for Break Em' Off\nSo if you ain't riding 20's, you got to take them off\nCause you looking shitty boy, cause I run your city boy\nWith Big Goon, Pastor, and my nigga Tity boy\nWe came to get it crunk, so fire up the slunt\nAnd if that nigga talking shit, he will get jumped\nBut I just came to chill, I ain't trying to have a fight\nI'm trying to show you niggas how a pimp turn out a dyke\nI do this every night, motherfucker how you feel\nFrom the land of the trill, the youngest one with a deal\nI'm Lil' Flip\n\n(Chorus 2X - Bone Crusher)", "image": "https://images.genius.com/5beb28ca5af6cd2d237978b432e6a5d7.600x600x1.jpg"}]}