{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/ef0c6419ec0e902c94466bd26c081b8e.750x750x1.jpg", "title": "Cherish The Day", "year": "2013-12-21", "album": null, "lyrics": "[Verse 1]\n24/7 I’m Coachelin' in heaven\nHeaven is what you make it\nSome earn and some take it\nKeepin' it real, no fake it til you make it, that’s some ho shit\nDon’t listen to all advice cause most niggas don’t know shit\nRoll up my nigga, (Cherish the day)\nShout out to all my fam doin the best they can\nDon’t settle for less my nigga, just come up with better plan\nDon’t be too quick to call these new niggas yo friends\nOn a roll and this one hope it don’t take me up out the solar system\nAll against 'em, have no future, they best to born with 'em\nPlease don’t step on these Michaels they ain’t available yet\nWe ever so fresh, tell these reckless hood niggas that’s ready for death\nThat’s why we (Cherish the day)\nWe leaders like Nas and Damien Marley\nAim to be wise and stop putting all that poison in my body\nI swear I’m on that shit like right after this party\nSo ready, set, go, we spoke to the people\nWe told em that all go upward we go\nI’m down with the plus sign, nigga fuck evil\nConsecutive blunts smoking til I PO\nTake it slow, that’s how I...\n\nCherish the day\n\n[Verse 2: Domo Genesis]\nIt’s like I hustle so hard to keep lunch on the table\nAll this hard work and this is how they fuckin repay you\nCompared to what? These niggas suck\nHow the fuck if the play you? You think you lucky but you drunk\nGetting fucked by yo label, got the mentality\nNever had shit to prove, so in turn it ain’t shit lose\nBe that follower shit from fools, me I’m burning the book of rules\nWant moves? Get you bruised by young dudes with 22’s\nWeak dudes, so confused, play it cool, you get to choose\nI ain’t no slave but I’m out here in the field, nigga\nIf I get killed today at least I went a real nigga\nBut I ain’t planning on leaving, my seat back and I’m chiefin\nI sleep after I’m breathing, I bleed rap for a reason\nI tried to tell these niggas about my prophecy (\nAll inked out, now these niggas wanna copy me\nThoughts came out, who'd a  thought I had a lobotomy?\nHonestly only policy, mobbing deep, work the prodigy\nShook niggas, fuck is you talking? It ain’t no stopping me\nMorphine flow, it’s like I’m spittin out some policies\nAin’t a nigga allowed to speak? Who is hot as me?\nI kick the rap game in the face, say no apologies\n\nCherish the day"}]}