{"songs": [{"title": "Dark & Violent", "year": "2013-09-03", "album": "Nostalgic 64", "image": "https://images.genius.com/f28b6855343451e556086d30a3adbd16.494x494x1.png", "lyrics": "[Intro: J.K. The Reaper]\nFang life!\nYou ain't never heard no tales from the darkside\nYou ain't never heard no tales from the darkside\nWelcome to the land\nYou ain't never heard no tales from the darkside\nWhat it's 'bout?!\n\n[Verse 1: Denzel Curry]\nIt’s ‘bout a young nigga, running away from the moon to catch the sun quicker\nDrug dealer, Nino with the steelo trying to sell kilos and grams\nSettling angry stomachs up in his fam\nSo if that silver spoon on your plate, if you touch that, that's your fate\nDon't have faith, Like Evans, you got to face demons to get to your heaven\nThe pimps is the prophets, not prophets for reverends, this is the lifestyle of a broke adolescent\nSo here's a lesson of a teen that survived Rikers\nBut shortly, his life had ended with a bullet that's made out of Midas\nTouch\n\n[Chorus: J.K. The Reaper]\nYou ain't never heard no tales from the darkside\nYou ain't never felt the pain of the darkside\nYou ain't felt the burning flames of the darkside\nYou ain't have a fucking name on the darkside\nYou ain't never heard no tales from the darkside\nYou ain't never felt the pain of the darkside\nYou ain't felt the burning flames of the darkside\nYou ain't have a fucking name on the darkside\n\n[Verse 2: J.K. The Reaper]\nKnew a young brother without a name, he was in love with his nina strap\nAnd steadily schemin, barely sleepin, but dreamin of pretty bitches and beamers\nBut when he awake, he sees his fate\nAnd his reality, to do whatever it takes to elevate his fucking salary\nAny niggas a casualty, kill 'em, rob 'em\nThen casually walk off into the darkness, it all started\nWhen he was, welcomed into our fucked up world, the son of a fucked up girl\nAnd his father was just a blur, his life had took a curve\nWhen he saw his brother dead on the curb, due to retaliation\nOf the gang relation,  he was young, a kid, a baby\nAnd yet to realize the pollution of the nation\nNow he 18 life in jail is what he facin'\nShit, murder was the case that they gave him\nShit, murder was the case when they raised him\nMind stuck in the all black prison\nYou think he give a fuck about the system?\n\n[Interlude]\n(Car driving)\nNigga we gotta get this money\nDamn right\nWe gotta get this money, I got the plans...\nEverything's set up\nJust got to go in there-..\nGot the banger man, as long as you got the hammer man, we out\n...Go by the book...\nYou ready to do this shit or what?\nYeah, yeah, 'this what I got to do\n\n[Verse 3: Nell]\nOut on the gank, rolling the dank\nAs he cased out the bank,  he was catching that shank\nGetting loaded the stick,  trying to major his rank\nThugging was how he was brought in the paint\nRush the security, no longer pure was thee\nSoul turned it cold for the love of the gold\nBust in the air, everyone hit the floor\nNot giving a fuck, loc-ing off of the 'dro\nBodied a nigga, riding in a dropped ‘Lac\nTop back, cruising them twenty fours\nSo I went crazy, my vision got hazy\nI walked in the bank, and I start to get bold\nClutching that pistol grip\nThe teller was moving too slow so I pistol-whipped\nThe bitch, he was twitching, bust at a civilian\nAnd blasted the mag with no mask in the buildin’\n\n[Verse 4: Denzel Curry]\nBurn the fingertips off, replace the dental\nLeft the golden bullet magic in his coufie, no his temple\nThat’s engraved, leaving corpses\nIn graves, Glock 17 cutting fades\nBarber,  we dumped the security in the harbor\nThen we switched the identity, chose the name Leroy Carter\nThe bank teller looking short and squeamish\nSteve pistol-whipped the bitch; she kept screaming\nShut up, ho, before a nigga nut up, ho\nSteve said he couldn’t take the shit\nSo he took her to the back, then Steve grabbed the MAC\nThen he put it to her head, and then he raped the bitch\nBoy, we gotta do a job or we might get toast\n13 shots rung out and it left two ghost\nTales from the dark side, jack move, riding\nTrials and tribulations of the dark and violent"}], "artist": "Denzel Curry"}