{"artist": "Watsky", "songs": [{"year": "2012-06-11", "lyrics": "[Intro]\nWhat a beautiful and sexy night\nWhat a shame someone would try and mess this up right now\nLook around, I mean I hearing everything you're saying\nBut to be honest with you, I don't give a fuck dude!\n(Let's Go!)\n\n[Chorus]\nLet me tell you about my GPA, four-O, straight A's and my-\n(I don't give a fuck!)\nLet me tell you bout my resume. It's so cray, It's insane and my-\n(I don't give a fuck!)\nAnd my boyfriend, he's so hot, and the car that he bought me is-\n(I don't give a fuck!)\nAnd my \"ooh-la-la\", my \"blah, blah, blah\" and (I don't give a fuck!)\n\n[Verse 1]\nCause I'm a bachelor, so fuck attachin' a\nLabel to the life we're living and imagine a\nFuture where we won't be living in the past\nI'll be flipping birds like a chicken breast on a spatula\nSo if you're bragging then you can forget it\nAnd if it thunders and if it rains and pours, let it\nAnd in the morning then it'll hit you that George said it\nThey gave him a fuck, he returned it for store credit\nBut don't be sore yet, if you got a score, settle it\nCause it's more pleasure with fun before etiquette\nGet up on the table and pour your drinks, get it, but\nDon't be boneheaded, it's for your own benefit\nI'll be getting open and seeking my seventh heaven irreverent, while you be seeking a reverend or Pope Benedict\nYou got a stick where the sun don't shine?\nWell, that's fine but remember that I don't give a fuck\n\n[Chorus]\nLet me tell you about my GPA, four-O, straight A's and my-\n(I don't give a fuck!)\nLet me tell you bout my resume. It's so cray, It's insane and my-\n(I don't give a fuck!)\nAnd my boyfriend, he's so hot, and the car that he bought me is-\n(I don't give a fuck!)\nAnd my \"ooh-la-la\", my \"blah, blah, blah\" and (I don't give a fuck!)\n\n[Verse 2]\nAll I wanna do is get my mind right\nIf I'm looking at tomorrow check my eyesight\nAll I'm gonna focus on is this fine night\nCause all I know is that this life is finite\nNever Neverland isn't more than a legend and so I gotta be digging the present session and getting this\nWedging myself up into the wettest crevices, effortless\nGrabbing a piece of the flesh, if you love it then why fight\nSome people slower than a nineties modem\nWanna see the nips, it's a while to load 'em\nIf life is a woman she's got some epic titties and I wanna get up in it and live it and motorboat 'em\nCause I wanna see the cool and the classy\nAnd I wanna see the cruel and the nasty\nCause if it's real shit, lemme feel it\nAnd if you can't deal, I don't give a fuck\n\n[Bridge]\nLet me tell you 'bout my five year plan and my 401k and-\n(I don't give a fuck!)\nLet me tell you 'bout my workout set, P90X and my\n(I don't give a fuck!)\nLet me tell you bout some random crap you don't care about and-\n(I don't give a fuck!)\nAnd my \"ooh-la-la\", my \"blah, blah, blah\" and (I don't give a fuck!)\n\n[Chorus]\nLet me tell you about my GPA, four-O, straight A's and my-\n(I don't give a fuck!)\nLet me tell you bout my resume. It's so cray, It's insane and my-\n(I don't give a fuck!)\nAnd my boyfriend, he's so hot, and the car that he bought me is-\n(I don't give a fuck!)\nAnd my \"ooh-la-la\", my \"blah, blah, blah\" and (I don't give a fuck!)", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "IDGAF"}]}