{"songs": [{"album": null, "image": "https://images.genius.com/10ad707ee72d4bbf386071ea808feab3.1000x1000x1.jpg", "year": null, "title": "MySpace Mixtape Part I", "lyrics": "And there is something about a one way ticket home no, don't go\n\nI'm gonna kiss you til I can't no more\nI'm gonna miss you when your out that door\nI'm gonna love you til we both stop breathing\nI'm gonna love you til my heart stops beating\nI'm gonna kiss you til I can't no more\nYour gonna miss me when I'm out on tour\nI'm gonna love you til we both stop breathing\nI'm gonna love you til my heart stops beating\n\nYou can call me Adam Sandler from the way that we just click\nCause you said you ain't a rapper you just wanted one to lick\nSo we went back to my house\nAnd we handled all our shit\nYou rub my back and scratch my head\nAnd always have some weed to hit\n\nI'm so happy that you get me\nYour so lucky that you met me\nDo I love you? definitely\nWill I hurt you? I won't let me\nIf I do than just forget me\nBut what more do you expect me to do? to do\nI would, I would\nI would, I would do anything for you\nI would, I would\nI would, I would do anything for you\n\nI'm gonna kiss you til I can't no more\nI'm gonna miss you when your out that door\nI'm gonna love you til we both stop breathing\nI'm gonna love you til my heart stops beating\nI'm gonna kiss you til I can't no more\nYour gonna miss me when I'm out on tour\nI'm gonna love you til we both stop breathing\nI'm gonna love you til my heart stops beating\n\nCity lights were bright the night I made you mine\nAnd all I'm asking for is a little bit of your time\nEven if I tried I could'ntget you off my mind\nI swear it's all for you in every single line\n\nAnd I would live out of a suitcase\nFor months at a time just to see your face\nAnd I would wait in the exact same place\nIf you promised to come back in a couple of days\n\nI would, I would\nI would, I would do anything, anything for you\nI would, I would\nI would, I would do anything, anything for you"}], "artist": "T. Mills"}