{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "It Gets Hot", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "\"Oh my gosh.. the music just turns me on!\"\n\n[Pacewon]\nYo... uh, uh\nGive it to me now, give it to me now\n\n[Hook: singer]\nIt gets hot - when I see you\nWhen you see me and the vibe is true\nC'mon shorty let me ride with you\nIt gets hot - when the love is real\nWhen my car's all shiny and the club is filled\nWalkin in the door like what's the deal?\nIt gets hot\n\n[Pacewon over Hook]\nAiyyo.. ha ha\n...\nWhat the deal huh, huh?\n\n[Pacewon]\nAiyyo I'm sexable from head to toe\nMad hot like Mexico\nCause I +Rap+ like +Kool G.+, every year, new me\nToo deep, mixin that umm with that ooh-wee\nA few peeps up in my loft, havin lunch with the boss\nSex might jump off (who knows)\nIt all depends on her clothes, if she's dressed provocative\nThe compliments I can give her, that's positive\nAnd she'll swallow it, gobble it up\nJust because I'm a prominent, dominant thug\nThat be rhymin in tongues, mi amor {j'tem?}\nA flirtatious man who loves to make friends\nPull you in bathroom, grope you, harass you\nDazzle every woman in town, when I pass through\nWith my \"Mad Crew\" like BDP\nShowin my colors like BET, what's the deal now?\n\n[Hook]\n\n[Pacewon]\nWhat's the deal, yo, yo\nYour wife like me like flicks from Spike Lee\n\"She's Gotta Have It,\" my jeans and white tee\nMy arms around her waist, she breathin in my face\nLike \"Pace when I'm with you, I feel so safe\nAnd hey I'm all yours, the ring means nada\nIt only costed two-thousand sixteen dollars\nAnd your verbal illustrations get me hotter\nSexy dada, let me holla\" - and I'm like\nCome right along, I'm a roller coaster ride\nGet on, we can crush to the song\nI chat with your motherfuckin cat like Dr. Doolittle\nShow your dog how to hit it from the back and chew nipples\nCause friction like when you rub two nickels\nInvent new shit to do wit'chu\nKnock the boots down to the ground with energy and stamina\nMy boy locked up, won'tcha pose for the camera\n\n[Hook]\n\n[Pacewon]\nWhat's the deal yo, yo yo yo\nI make women hallucinate and see things\nPut my finger in the G-string\nMake her smile like Christmas Day when she was 4 years old\nGrab the back of her neck, kiss her earlobe\nMake her sweat like she just ran a mile\nTurnin green like she was Bruce Banner now\nBetter yet the She-Hulk, break buildings down\nWhen we fuck, break the oochie down and leave her\nBack to the block, rollin trips and fever\nBrand new chicks for my chips to freeze up\nChicks like Britney, chicks like Shakira\nI take the purest of 'em just like mirror mirror\nAnd I'm, Prince Charming, the best they mobbin\nGet my boys together, do some big robbin\nAnd we ain't robbin ya goods, nigga stealin your world\nAll because I was feelin ya girl\n\n[Hook]", "year": null}]}