{"artist": "3rd Bass", "songs": [{"lyrics": "Knock knock knock knock, come in come in!\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in!!\nWho's at my door? (I don't know but let him in)\n\n[MC Serch]\nCome in, to my cribbo, no reason you'll say ditto\nNo tea and crumpets, not servin' you no vittles\nLittle one sit, I'll kick to you a fable\nSo recline on the recliner put your feet up on the table\nSable is a fox that's used for coats\nThe sable is a fable cause you bought yourself a goat\nSkin all in, so ease up on throttle\nNo role model and your life is out the bottle\nThe roll of the dice on the corner of the street\nYou get beat on 123rd street\nDone by the system that ain't really sayin' nothin' new\nYour kids flippin, so now what you gonna do?\nGo home? Hell no, she don't want you there\nWhy need a man or even work when there's welfare?\nOh yeah, another scam, see?\nThe government's way to destroy the family\nSee life is a gamble, find the ball under the shell\nHell no, I kick two and make the dome swell\nSon, that's the end I hear the doorbell ringin'\nAnd if that's your pops, tell the man to just come in\n\n* doorbell rings *\n\"Oh hello dear!\"\n\"Uahh, good morning..\"\n\"Very well then.. suppose you come over here!\nBut first..\"\n\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in!\n{\"I came in the door..\" -] Rakim}\n\n[Pete Nice]\nAsk me why I wander on desert plains\nI say the Cactus still grows without rain\nPlain to see from my horse without a name\nI set it off, still things ain't the same\nA case of wasted life, inner city blues\nGoods for hoods from the merchant of grooves\nI move your butts but a question lingers\nI look at my hands, I sees ten fingers\nA finishin' touch, much on the Pete P\nHear the Three-R-D and the blind see\nWhy I flipped and why I ain't with the Klan\nWhich one you say all truth and\nTrue indeed, y'all needs a speed knot\nKnothead syndrome, sets off piano drops\n{* Daddy Rich cuts and scratches *}\nSo I please, and step with Kool Poppa Sha\nScopin' every skin without a bra\nOn the streets, Kurious like Jorge\nWhy don't you make like Run and pause?\nFlaws in characters, scrubs get done in\nI swing it open y'all, so come in\n\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in come in!\nKnock knock knock knock, come in!\nWho's at my door? (I don't know but let him in)\n{\"I came in the door..\" -] Rakim}\n{\"I came in the door..\" -] Rakim}\n{\"I came in the door..\" -] Rakim}\n{\"I came in the door..\" -] Rakim}", "image": "https://images.genius.com/ba67f25eba0c6951171aa44e82a3051a.600x600x1.jpg", "album": "Derelicts of Dialect", "title": "Come In", "year": "1991-06-18"}]}