{"songs": [{"title": "How Can I Become a Bawlaa", "album": "So Hard", "year": "2013-05-22", "image": "https://images.genius.com/701a46350909affbfec12488b53a9b66.500x500x1.jpg", "lyrics": "[Intro]\n\"Hey, what's going on man, it's your boy LD\nAnd I'm a pretty big rap fan, and\nI'm noticing that every other rapper get to say whatever they want\nSo, I just wanted to make a song where I could, like, act like I was the man\nLike \"Mercy,\" but my friend Dean said I couldn't\nAnd, he a hundred percent right\nIf I tried to say anything cool, I would just sound, like... gay\nYou know what kind of disadvantage that puts me at, where I just can't say anything cool?\nLike, literally, the only thing I could think of was to bring a black dude in for the chorus, so shout out Corey Gunz\"\n\n[Hook]\nRidin' round smoking weed with my foreign bitch\nRidin' round smoking weed with my foreign bitch\nMy window down, I'm riding to my new shit (Wish that was me...)\nGot my new bitch, got my, got my new bitch (This dude a G..!)\nI don't camp off wit no J's, they sell them hoes for free (What the fuck that mean?)\nNever payin' for no pussy, fuck them hoes for free\nThat's a fucking bawlaa\nHow can I become a bawlaa?\n\n[Verse 1]\nMirror mirror on the wall\nHow can Dicky learn to ball?\nI wish I was T.I.P. and I could spit some shit with southern drawls\nI wish I could flip a brick and spit that shit like Ricky Ross\nHolla at broads, at the mall\nSpit about a muhfuckin' bitch up in 'da whip\nAnd getting lit up in the backseat\nTalking shit about a dinner with an athlete\nFuck that, can't rap like the rest of these muhfuckers\nWithout all my writtens being fact free\nDo y'all know how bad I wish I could?\nBut y'all would laugh if I spit hood\nSo now your man is making jams about some random shit\nWhen dudes is rappin' bout they fucking weaponry\nHomicidal tendencies\nThe only dough that I can boast about is seeded sesame\nI'm jealous, B\nCause everybody in the game get to say they kill\nEverybody in the game get to say they steal\nEverybody in the game sayin' words like \"trill\"\nReally wish that I could make that hit, fake that shit\nWithout coming off all gay and shit\nCuz if I could've rapped like Wayne\nThen I'd prolly be saying a lot of the crazy shit, like\n\"I'mma kill you pussy ass bitches with the chopper!\nNow make that pussy pop off!\"\nAnd this shit would sound proper\n\n[Chorus]\nRidin' round smoking weed with my foreign bitch\nRidin' round smoking weed with my foreign bitch\nMy window down, I'm riding to my new shit (Wish that was me...)\nGot my new bitch, got my, got my new bitch (This dude a G!)\nI don't camp off wit no J's they sell them hoes for free (What the fuck that mean?)\nNever payin' for no pussy, fuck them hoes for free\nThat's a fucking bawlaa\nHow can I become a bawlaa?\n(I just wish I could say black things, straight up)\n\n[Verse 2 ]\nHere we go, here's a flow\nBout some shit I really know\nI'mma spit it raw and swag it up as if I'm really cold\nMy cheerios is honey nut\nGear at most a hundred bucks\nP.S. I Love You is on the TV, Dicky tearin' up\nGo up to the bathroom, I have to\nMy dentist say I gotta make an effort, now it's time to floss\nHoller at my dog, and I call the muhfucker to me, and\nGet a leash and take him out to walk\nRoll around the ave, I put his shit up in a bag\nAnd then a whip pull up, the windows down, this bitch look out and asking how she get back on the highway\nTold that bitch to drive straight\nAnd take a left on Honeycut\nBut stay up in the right lane\nCause  it come up kinda quick\nYou see what the fuck I'm saying? Other people get to rap about, like\nHome cooked crack, and, like, jail and shit\nAnd I gotta spit a lotta shit about a motherfucking kid up in a crib that's got the central air\nIt's not fair, no one cares\nReal talk, I just wanna braid my hair\nAnd rap about whatever, bruh\nMoney, hoes, etcetera\nInstead of being clever every measure but I'm never gonna be...\n\n[Hook]\nRidin' round smoking weed wit my foreign bitch\nRidin' round smoking weed wit my foreign bitch\nMy window down, I'm riding to my new shit (Wish that was me...)\nGot my new bitch, got my, got my new bitch (This dude a G!)\nIon't camp off wit no j's they sell them hoes for free (What the fuck that mean?)\nNever payin' for no pussy, fuck them hoes for free\nThat's a fucking bawlaa\nHow can I become a bawlaa?\n\n[Outro]\n\"Yeah, like, it ain't fair\nLike, Kanye says shit like \"Have you ever had sex with a pharaoh? I put the pussy in a sarcophagus.\"\nAnd nobody remotely questions that, they just respect his swag more\nRick Ross say his \"car smell like blue cheese.\"\nIf I said my shit smell like blue cheese, people would just think\nLike, I was eating wings in my car, and, like, making a mess, like a goddamn mess...\nSo... fuck\""}], "artist": "Lil Dicky"}