{"songs": [{"title": "Pre Tour Bars, Just cos", "lyrics": "[Verse 1: Akala]\nReal supporters like real things so thanks\nNo deal but passport bookings are full of stamps\nSo much so, had to get the new one done\nYour crew run run, every time a new one come\nCause a verse from Akala is harder than time in Abu Ghraib\nWith the same sense of injustice, put em to their grave\nSlaves to a better king, great its American\nBut that ain't impressing em, chains got to bury them\nI slay with the best of them, pray for the rest of them\nFirst immaculate birth since the manger in Bethlehem\nThree wise men came and gave me the blessings then\nHead grew bigger for my brain to develop in\nSame as the heroine, to veins full of melanin\nShit that I'm peddalin', it's death to your brethren\nYes better cherish him the best there has ever been\nFrom this side of the pond, I'm a Bond with a better trim\nBut I don't work for MI6, quite the opposite\nI fight Imperialism but couldn't put a stop to it\nCause outside of the lyric realm\nI ain’t Superman\nThe world we live in is fucked, like the bars I spit\nYou don't know the half of it, how much smarter can Arthur get\nThe only joker round here is you, so we laugh at it\nThey tell you that I’ve mastered it, I’m just practising\nI always represent my class like Thatcher did\nBut I am not a privileged prick of a politician\nI am the broken home with no pot to piss in\nSo if you stop to listen you would know that I'm badder\nThan any other thing that has ever been made of matter\nMy whole head's gone like I've been shot with a cannon\nThink I need treatment better check Frantz Fanon\nWho said it wouldn't happen they lapping up all the knowledge\nMany other conscious MC's are boring lets just be honest\nAkala's on some other shit love...\nYes I did just refer to myself in the third person, what a mug\nBut the grub that my belly's now having, I had to scrap em'\nEvery single inch of the way to get it cracking\nIt almost never happened but you decided to back him\nSo the passion that I'm rapping with, they could never fathom\nCause their spirit don’t feel it, its why they're so idiot\nWant to tempt fate, that's great, lets seal it, I mean it\nMore that any word that you've ever heard\nFor all the street scholars still stuck on the kerb\nFor the road and the pavement, I don’t romanticise\nI see structural poverty and I analyse\nGentrification fucking us up\nWe gonna have it?\nTown planners trying to turn London into Paris\nA rich white centre with a ring of estates\nWhere all the chavs and the immigrants go. Is that our fate?\nJust enough poor people left to clean up the dirt\nGo kill yourselves in the sticks where the shots can’t be heard\nLeave the centre to the civilised people, to improve\nYou know the type that want to have their carnival without coons\nMove you little paupers; fuck your sons and daughters\nYour lives and your communities are not important\nWe can all pretend that it's just market forces\nRather than the social engineering which it of course is\nThey say they don’t believe in hand outs, fucking liars\nLook how we bailed out the banks and didn’t nationalise them\nYou can make it if your enterprising right? Try it, just like I did\nThat’s what I'm supposed to say, when you ask me how my life is\nBut that ignores the facts and all the things that I have seen\nAll the blood that's put before my eyes when I was just a teen\nI ain't being dramatic\nOr beggin’ gangster life\nTruth is though I did do wrong, I’m living on borrowed time\nRappers rhymes starting to sound clever, like they borrowed mine\nYou learn nothing from me it MUST be that you ain’t got to sign\nAin’t got to hide it from them brother if you got a mind\nDid our people not bleed for the right to read in another time\nWatch the youths back in Yard, back in Nigeria\nDo they reject knowledge? Are we serious?\nSo whose culture is it then for us to act foolish?\nWho we entertaining and serving with our bullshit\nWith my dreads, with my picky head, with my hoody on\nChief up these so called scholars go off and write a song\nYeah I think deeply, man is so neeky\nBut still box man in their mouth for getting cheeky\nThink I'm exceptional? That's not true\nI’m like most of my brothers that grew up on the Wu\nI don’t respect a lack of honesty or authenticity\nReady for anyone think they can talk to me lyrically\nPhysically, I ain’t superman nor a massive dude\nBut train everyday like a soldier, what you thought this is?\nWe talk this revolution shit, and not be super fit\nHow you gonna fight a battle soldier if you ain’t used to it\nFizzy drinks, packet of crisps, chicken and chips\nNah fam, green banana and yam we go HAM\nMake your shit stand strong when you're still an old man\nCheck the Rastas in the hills back in Yard you’ll understand\nWhat’s the plan?\nKeep em dumb and distracted and unhealthy\nPerfect recipe for keeping themselves wealthy\nAnywho\nMurdering mics, daily I duppy, little yuppies, that's to scared of the trenches, I'm forever muddy\nA roadside brainiac, I’ve forever studied\nCouple man mistook me for a prick, look what they discovered\nI tell jokes all the time, I’m forever funny\nHa-bloody-Ha you really thought that I would let you mug it\nWe speak gully cause we're still tuggy\nThough we, deeper than gullys and we ruin countries\nAnd you, needn’t have worry cause it's all covered\nLook how we, feeding them knowledge and they will love it\nYeeaah\nFuck your conditioning, rap nitroglycerine\nGlistening like the top of the pyramids on you invalids\nWe all know who the winner is, don’t shit where your dinner is, Man rap about food but couldn’t even finish his\nYou’re hungry? I'm starving, look at my ribs inch’ning\nThe baby n' it's bedtime, maybe I should sing to him\nA sweet little lullaby, put em to sleep\nIt's so peak for the other guy cause he ain’t me\nMost of you speak 'bout the gully side and put me to sleep\nCause you’re a chief and you cannot rhyme, better believe\nUncle Akala is the hardest out\nEverybody says this\nAnd it's no secret why I don’t make playlist\nBut tour tickets selling out, novels self published\nMy life’s all good, I enjoy my summers\nBut I am what I am, council house, single mother\nSo won’t get arrogant from a little bit of abundance\nAs long as I puncture trying to manufacture dry schemes I’m already done with\nRun through that stage in like seven, I'm on my shaolin monk shit\nOne finger push up, a blade in the neck\nIron shirt, qigong you can't fake the respect\nMuch less, [?] a vet, I'm as brave as cadet\nIn Dessalines army, what the fuck you expect?\nNEEEEEEXXXXT", "year": "2015-04-13", "album": null, "image": "https://images.genius.com/d06fbbceadf997c411ad4da6be5f4952.1000x563x1.jpg"}], "artist": "Akala"}