{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "[Akrobatik]\nIf you brought your attitude in the spot, then GET IT OUT\nLadies got your hair permed, you 'bout to SWEAT IT OUT\nLet's make it worth your dough, befo' you HEAD IT OUT\nGet live, LET IT OUT; c'mon and LET IT OUT\n\nYo, keep the peace while I'm freein the beast\nThe album set for its US and European release\nI make you bounce just like a street hustler seein police\nWhen Akrobatik's in the place the wack emceein decrease!\n(PERCEPTIONISTS) Regulator with some shit you'll never hear on no elevator\nCreators and devastators, you know we'll never hesitate\nTo leave you surprised with, that hip-hop hybrid\nNow open your eyelids, to fly shit!\n\n[Mr. Lif]\nMy pilot like a pirate on the seven seas\nIgnite the mic with an unleavened steez\nBody of Christ nice, I slice scheiss, that's German for certain\nUnder shit you oughta be learnin\nJesus, eases, for rockin the sleeveless\nWife beater, I'm the motherfucker light breeder\nSend your chest when I whisper fresh\nBrother think they def then you sink to death, take a breath\n\n[Akrobatik]\nMake a left at the door if you ain't ready for the raw\nCarnivore, power source that bust through armor doors\nLike a batterin ram I'm shatterin jams\nI'm leapin in the crowd like I'm Baccarat Lambo\nYou slackers in Sambos are straight getting handled\nBy rap's Rambo and Commando, simply because you can't flow\nManiac material that murder the dance flo'\nEnhance shows I guarantee another advance yo\n\n[Hook: Akrobatik]\nIf you brought your attitude in the spot, then GET IT OUT\nLadies got yo' hair permed, you 'bout to SWEAT IT OUT\nLet's make it worth your dough, befo' you HEAD IT OUT\nGet live, LET IT OUT; c'mon and LET IT OUT\nYo, it's the Boston brothers that y'all done READ ABOUT\nSucka rappers heard we was comin they JETTED OUT\nAND whether if you faded or peezy or DREADED OUT\nGet live, LET IT OUT; c'mon and LET IT OUT\n\n[Mr. Lif]\nI'm a cool little nigga when I flip at night\nLike stripe, my mechanical, might jab her right\nRollin in a tank with center bites\nStep in the center bombs, before I jump in the tron\nSoup bowl and beat bro, when you're in a trance I'm in a stance\nB-boy, yeah the actual McCoy, just dance\nI rep with the sidestep 'til the sky's wet\nI'm the one anomaly that hasn't been sniped yet\n\n[Akrobatik]\nYo, brothers got an album deal all for the solo hype\nNow we 21st century rap prototypes\nRappers mad at us because they don't do they promo right\nAnd all they worry 'bout is who they look in they photo like\nBut me and Lif is like Luke Skywalker, Hans Solo like\nPimpin any rap like Magic Juan and Dolomite\nTakin over shit like Bush took over your voter rights\nThat's why we all about that fuckin check the promoter writes\n\n[Mr. Lif]\nI let bass go, the shit'll rip off your face though\nWe're the ones with all the clout the brothers will say so\nSo we say go away, you stay\nTell the rest of them rappers to go pray, they're prey\nUse left arm drop bomb\nOperation crush planet Earth right palm\nBrother there's no tomorrow, we make time hollow\nSorrow, better take notes and just follow\n\n[Hook]\n\n[Outro: Akrobatik]\nYo, Akrobatik, Mr. Lif\nFakts One, hot shit uhh\nYeah...", "title": "Beast Mode", "album": "Absolute Value"}], "artist": "Akrobatik"}