{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "Da Heat", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "[Intro: Kool G Rap] - x2\nStill on this paperchase\nLoad the stacks up in the safe\nCause champagne tastes with beer money don't cut the cake\nMe and my peoples play for high stakes\nLook out for FBI jakes, turn up the ? case and place me upstate\n\n[Verse 1: Kool G Rap]\nBut yo its all legal\nEvery last printed bald eagle\nWe started out as small people now we tall and lethal\nFrom poverty, to land properties, runnin' monopolies\nWe properly, sit in butter leather shit and mahogany\nCall it robbery, just as long as I grab the lottery\nIm tryna prospectally strictly going for jackpottery, obviously\nKool G Rap I like a lotta cheese\nA novelty, models be stripping\nLike the shit's pornography, the odyssey, lyrical prodigy\nSee my philosophy like Socrates\nLogically cats follow me catastrophically\nApostle G\nYour role model be and anything less is just a S.O and S. with the apostrophe\nFuck all that hypocrisy\nYou know who doctored these lyrics about the street shit first\nCheck my biography, its possibly\nCause I was ahead of my time just like a prophecy, monstrosity\nNiggas wanna copy me like photography\n\n[Hook] - x4\nLadies: It's so, It's so hot, I'm heatin' up!\nKool G Rap: Straight, bringin' the heat son!\n\n[Verse 2: Kool G Rap]\nWe keep the rides flowing, the Glocks blowing, the pockets swollen\nThe poppy seed lye's growing, knots big as Samoans\nGot cash flowing out the colon\nBe on the yard dash like Jesse Owens\nTryna get strikes and riches like bowling\nKeep a look out for Jakes patrolling\nThey hate to see niggas be straight and holding mad diamonds glowing, the paper foldin'\nWe rolling Kennedy Caver? status, living it lavish\nCop the shit that's as hot as a radish\nFive and one quarter carats from outta Paris\nMy units is moving quicker than Randy Travis\nA lyrical style that ravishes, creeping past all your averages\nCarry my own weight, fuck extra packages\nJust make sure there's a clique of savages from outta the habitat with bad habits kid!\nLift up your whole wig, get you jigged, for just one more hole in the Earth to dig\nWhen I spit the shit from out the cig\nIt's nothing short from blood-sport, you get your mug torched\nListen to what the thug taught\nBefore you get rocked, down on the block for cops to find your blood corpse\nFrom scud missles\nThat I could see, sizzle your blood and tissue\nGot done by the fake ones and all the unofficials\n\n[Hook] - x4\nLadies: It's so, It's so hot, I'm heatin' up!\nKool G Rap: Straight, bringin' the heat son!"}]}