{"artist": "E-40", "songs": [{"title": "Concrete", "image": "https://images.genius.com/a7504e2acd1371e3c4acefadcfeb06ff.1000x899x1.jpg", "album": "Revenue Retrievin’: Graveyard Shift", "year": "2011-03-29", "lyrics": "[Verse 1:]\nI was threw in the game with a shield and a sword\nStarted having money, buying things I used to couldn't afford\nAt the beginning of my mannishness I was the mannishest\nI bought a nickel-plated .45th\nFalcons, Granadas, Caddies and Fairlanes\nChevy Impalas, Cutlass and Mustangs\nDonkey rolls, jewelry like a pharaoh\nTroop jackets, d-boy apparel\nHop, weed, speed, coke, whatever you need\nKnew how to add and subtract but barely can read\nNo, I can't - Yes, I did - No, I didn't\nEither gon' be dead or successful or imprisoned\nTriple beam scale, I was flipping the goup\nHella clientele, I was getting my loot\nConcrete, I ain't made of feathers\nTear shit up just like some angry protesters\n\n[Hook]\nI come from the streets\nWhere they play for keeps\nThe strong and the weak\nGotta be concrete\nI'm from the streets\nWhere every day they leak\nAmbulance and police\nGotta be concrete\n\n[Verse 2:]\nHe started off fast, came in last ran out of gas, but he was winning at first\nWhat you call a person like that? A quarter horse\nEntered the game and can't run a lap, a t-tortoise\nThat's domino talk, mayne, you mack - O-of course\nYou still in the game? Nah, we divorced\nYou make any change? No remorse\nHe full of shit just like a porter potty\nHis hustle game sloppy, triggered off on them boppies\nI'm from what's right, maybe that's what's wrong\nThat's what I was just telling my little homie on the phone\nBe a leader not a follower\nIf you will be a follower, follow the right leader\nStop thinking with your peter\nMy peter? Yeah, your dick\nWhy? A chick'll get you hit\nKeep your eye on the sparrow\nGet cornered and ambushed, they'll limit your space, your space is narrow\n\n[Verse 3:]\nHe put his foot where his mouth is - good riddance\nGunned him down in the drive-through of Kentucky Fried Chicken\nThey wasn't gangbanging, but they was set-tripping\nAte him up real good, but he still living\nThe victim's parent's lawyer on the case for real\nTry'na put the nigga that did it behind bars to make him pay they doctor's bill\nBut the shooter a monster, he hella feared\nSo ain't nobody talking, listen here\nAnd not only that, but the victim don't want nobody saying nothing anyway\nBecause when he get out and get his shit together\nHe gon' put them niggas under the weather\nWhen it comes to feuding and funking gotta be clever\nBeef and commotion and drastic measures\nFrom the top of my head to the bottom of my feet\nI don't know about you, but I'mma stay concrete\nBiatch"}]}