{"songs": [{"image": "https://images.genius.com/8b6b3f9cd8babb9f75aeca91c224cf2d.1000x902x1.jpg", "title": "Bucketheads", "album": "Bullets Ain’t Got No Names Vol. 3", "year": "2009-08-04", "lyrics": "[Intro]\nAll Money In, No Money Out\nSouth Central state of mind\nTwelve twenty-two o'nine\nBrand Hussle, it's a lifestyle\nYuh, it's neighboorhod Nip Hussle\nUh, yeah, Slauson, yeah, Slauson\nHussle\nIt's volume 3, Check it out\nIt's Rallo on the track\nFly Money Studios\nIt's All Money In, No Money Out, neighborhood Nip Hussle\nUh, look, look\nI be by myself gettin' this guape, my nigga, I'm focused\nI'm on a mission, you know?\nThis dedicated to all you little buckethead bitches, little hoodrats\nYuh, yuh, listen\nLook, look\n\n[Verse 1]\nYou hoodrat bitches is weak to my niggas\nRun your mouth to beauticians about who I stick my dick in\nI hate hoes that be all up in my business\nThey need to wash they ass and take they kids to the dentist\nNeed to get some cash? Go find a job and stop livin' off the county\nI be countin' hundred thousands, I'm out in every city\nBig Willie bop, bottles, young Nipsey\nTop models fuck with me, I'm on\nI'm really in a different category than your boyfriend\nBaby daddy so [?] with your baby havin' ass\nLook, I get cash off this million dollar swag\nLaptop full of hits in this Louis duffle bag\nBlack Dickies, black tint up on the Jag\nDrive slow, let my ex-hoes witness what they had\nAnd I'm at a level in my life where every move is out a plan\nShow these bitches I'm the man\nIf real women, please believe and understand that I do got your respect if on your own two you stand\nYeah but it's fuck you to you bucketheads\nYeah but it's fuck you to you bucketheads\n\n[Outro]\nHussle\nBullets Ain't Got No Name volume 3\nYou know what it is man\nAyy, dedicated to you little ratchets, man\nWe see through all your little shit, man\nYou know, y'all just like us\nY'all just can't take it when you get played back\nYou know, it's all hood though\nI respect game\nIt's Hussle (It's Hussle, it's Hussle, it's Hussle)\nYeah, you think it's a hole in your mouth\nYou ever thought about that, like, girl why you think it's a hole in your mouth?\nYuh, yuh, Hussle, Hussle\nUh, I'm one of the flyest young niggas out here\nI give this myself, bitch\nYou know, if I wasn't rappin', I'd probably be pimpin'\nI wasn't pimpin', I'd probably be trappin' or somethin', man\nI do it all\nLive up to the my last name, baby\nNip Hussle\nI did it without you hoes\nSo I take my pick\nSmoke some kush\nHop in the studio rappin' about my life, man\nI love this shit, it's nothin', man\nI'm drinkin' Grey Goose\nAnother day, another dollar\nHussle music, all that, man, volume 3, nigga\nYeah, uh, uh\nAyy, and if my album is shit, man, that's on my mama\nMy album hard as fuck\nI'm tryna push the date up and drop that shit right now, man\nCome with album 2\nI do this shit, man, y'all need to get used to me, man\nIt's Hussle, yeah\nI'm not even really tryin' that hard\nLet me get off probation\nLet me get my studio back setup\nLet me get this money all the right\nMan, you niggas gon' be in trouble\nUh, uh\nBitches already in trouble, man\nIt's not where I'm at, it's where I'm goin'\nY'all know what it is, neighborhood Nip Hussle music\nNigga, volume 3\nYeah, yeah\nOh yeah, Rallo on the track too\nUh, Hussle is my last name\nYeah, Hussle is my last name\nYeah, Hussle is my last name\nUh"}], "artist": "Nipsey Hussle"}