{"songs": [{"album": "More Politics", "image": "https://images.genius.com/2b173e3d3bd02f85d5edd743f3588568.600x600x1.jpg", "year": "2016-11-18", "title": "We’re Both Wrong", "lyrics": "[Produced by Q-Tip]\n\n[Verse 1: Saigon]\nHow could we have respect for you?\nLook what we subjected to\nSupposed to serve and protect\nYou acting all unprofessional\nRestraining a man is not grabbing him by his testicles\nSucker getting a gun and a badge and get disrespectful\nI'll tell you why this shit is so stressful\n'cause we been going through it since we came to America\nOn a vessel\nPick up a social studies book every time that they mention us\nThey was even enslaving us, trading us or was lynching us\nSo what's the big difference?\nWhether it's a rope or a scope, the objective is to go out and hit niggas\nSpeaking this from the heart\nI been doing the knowledge\nWe're seeing that slavery was never truly abolished\nThey making uzis with dollars they can use for the colleges\nWhat is this?\nThis is the movement of tricknologists\nThe only thing we're doing wrong is not fighting back\nYou ain't got the light to rap but you know what's right and exact, jack\n\n[Hook: Saigon]\nHow the hell am I wrong?\nWhen your people been doing my people wrong for so long\nNow all we got is the hope and the focus to hold on\nY'all been killing us for so long, it can't go on\nHow we both wrong?\n\n[Verse 2: Termanology]\nIf they shoot at us, they probably get awarded\nIf we shoot at them, they popping us when they spot us\nIt's harder to live life, more conscious and like marauders\nAnd focus on the problem of who could fix it in office\nThen picking up a bottle, a bitch, and a couple garcia's\nAnd heading to the crib, to kick it and get some knowledge\nDo we want knowledge? And bread for our toddlers?\nSaved in accounts or more belts and wallets\nAnd me I'm part of the problem, purchasing gucci products\nBefore, I put away that money for my daughters collage\nAnd still a great father but times are getting harder\nNo money for private school, I guess should go harder\nTryna lock in in stability, cuz of my family history\nAll of them died broke, so I'm tryna be the remedy\nOur ghetto kids never inherit no stocks and bonds\nThat's something to think about\nWhen you putting them Jordan's on\n\n[Hook: Saigon & Termanology]\nHow the hell am I wrong?\nWhen your people been doing my people wrong for so long\nNow all we got is the hope and the focus to hold on\nY'all been killing us for so long, it can't go on\nHow we both wrong?, damn"}], "artist": "Termanology"}