{"songs": [{"title": "Hood Gospel", "lyrics": "[Intro]\nYeah, what you know bout that Kayrone shit, when that waterbug crawled in that babygirl mouth, killa\nDid that shit killed them white folks livin in the big house\n\n[Chorus: Ricco Barrino]\nHmmm, now tell me can you stand it?\nBeen in the trap about four days\nCan't sleep these bills they gotta get paid\nThese niggas snitched and brought up ya name\nNow tell me can you stand it?\nHearin' ya patna just got killed\nThe cops shot him like he didn't deserve to live (oh no)\nStuck in this trap and I'm feelin' pain yeah\nTrying hard just to stand the rain\n\n[Verse 1: Young Dro]\nDro, hard wit it, thought I ran outta guap didn't it (nope)\nThought I ran outta fakin' God (what?)\nThought I ran outta cars didn't it (zrooom)\nEven though me and 'Tasia broke up, I miss and respect shawty heart wit it\nI had six goals it was like a spades hand, I ain't even play cards (stupid ass)\nAnd I never knew nothin' bout a Visa, food stamp them our people\nThe Barrino family used to sing so hard, I start crying like a tile weeper (hol up Ricc)\nShawty came wit that street sweeper, shawty shot up some sweet people\nOne week, without Jesus, is a weak nigga, peep it nigga\n\n[Chorus: Ricco Barrino]\nNow tell me can you stand it?\nWatchin' yo momma cry (momma stop cryin')\nTears runnin' down her face\nShe just heard her baby died\nOh, now tell me can you stand it?\nLivin' on this earth in hell\nIn the trap gettin' off that work\nIn a place that's full of pain\nTell me can you stand the rain\n\n[Verse 2: Young Dro]\nThe [?] you love I'on wanna go no more, tired of wearing these polo clothes\nTired of talking bout these ices and busta niggas kickin' in these doors (uh)\nWhat the hell are we workin' for?\nMomma used to be crying in the room, now my momma be twerkin' though (uh)\nHa, now what the hell is my daughter doing? (Taylor)\nGod please bless my family (please), everything about to be [?]\nMove out the hood up to [?] and yo bubblegum ass, need chewin'\nSwear to God I wanna pray for you but I can't do it cause you evil doing and I'm right with it\nTurn around with that Glock wit it (bow), bust it off I got shots with it (Glock)\nAnd protectin' my house with it (cmon), this what I suppose to do (yes)\nYou don't remember them phone issues, you don't remember them [?] that the glass went through and I bled through the shoe\n\n[Chorus: Ricco Barrino]\nTell me can you stand it? this rain (I love you momma)\nTell me can you stand it? this pain\nTell me can you stand it? I don't know what I'm gonna do\nTell me can you stand it? (thank you momma)\nNow tell me can you stand it?\nLivin' on this earth in hell (you know I talk this shit)\nIn the trap gettin' off that work\nIn a place that's full of pain (yeah)\nOoh tell me can you stand the rain\n\n[Bridge: Young Dro]\nMy wings on I can't fly God, scared to ask you why God\nThink that I went blind, what is wrong with my eyes God\nLeave me, I can't see you, everybody comin' these two\nThey bustin' K's and I'm runnin' through, everybody wanna be fooled but I'm smart enough and I'm hard enough\nTellin' me what's botherin' ya, and I swear to help you if I can\nMy co-defendant, my main man, now who the fuck killed momma boy\nWhy the hell ya'll totin' toys, why the hell we hungry\nGod help your son boy, it's Dro\n\n[Outro: Young Dro & Ricco Barrino]\nYo momma ain't never got shot five times bruh\nYo daddy ain't no purified bonafide junkie bruh\nYa'll ain't neva had to borrow ice before huh\nWe don't need sugar no mo', we don't need flour there\nWe stood the rain baby, yeah\nCome from the church widdit though, grandma son has it\nTell me can you stand the rain, bring it back", "album": "Da Reality Show", "year": "2015-09-18", "image": "https://images.genius.com/c0a3acd599ab7913a2dc0b058737a766.640x640x1.jpg"}], "artist": "Young Dro"}