{"artist": "50 Cent", "songs": [{"album": "Power of the Dollar", "image": "https://images.genius.com/f63dcb3995f4321fe966bca29bc94d2e.600x597x1.jpg", "title": "How to Rob", "lyrics": "[Produced by Trackmasters]\n\n[Intro: The Madd Rapper & 50 Cent]\nYo, yo, yo, yo, you know who this is boy\nThe art of getting robbed\nThis is how we do Brooklyn-style, boy, you know what I'm saying?\nR.I.P B.I.G - nigga R.I.P P.A.C - R.I.P\nEnough of that shit, it's time to O.D, one time\n\n[Verse 1: 50 Cent]\nThe bottom line is I'm a crook with a deal\nIf my record don't sell I'mma rob and steal\nYou better recognize, nigga, I'm straight from the street\nThese industry niggas is starting to look like something to eat\nI'll snatch Kim and tell Puff, ''You want to see her again?\n\"Dance your ass down to the nearest ATM''\nI have dreams of fucking an R&B bitch\nBut I wake up early and bounce with all her shit\nWhen I apply pressure, son, it ain't even funny\nI'm about to stick Bobby for some of that Whitney money\nBrian McKnight, I can get that nigga anytime\nHave Keith sweating staring down the barrel on my nine\nSince these Harlem World niggas seem to all be fam\nI put the gun to Cardan, tell him, \"Tell your man\"\nMason Betha, haha\nCome up off that watch now, I mean right now\nThe only excuse for being broke is being in jail\nAn entertainer can't make bail, he broke as hell\nI'd rob ODB, but that'd be a waste of time\nProbably have to clap him, run and toss the nine\nI'd follow Fox in the drop for four blocks\nPlotting to jux her for that rock Kurupt copped\nWhat, Jigga just sold like four milli, got something to live for\nDon't want a nigga putting four through that Bentley Coupe door\nI'll manhandle Case like \"Dope, get on the ground\nYou ain't with Mary no mo', where you getting chips from now?\"\nI been scheming on Tone and Poke since they found me\nSteve know not to wear that platinum shit around me\nI'm a klepto, nah for real, son, I'm sick\nI'm bout to stick Slick Rick for all that old school shit\nRight now I'm bent and when I get like this I don't think\nAbout to make Stevie J take off that tight ass mink\nI'll rob Pun without a gun, snatch his piece then run\nThis nigga weigh four hundred pounds, how he gonna catch me, son?\n\n[Hook: The Madd Rapper]\nThis ain't serious\nBeing broke can make you delirious\nSo we rob and steal so our ones can be bigger\n50 Cent, how it feel to rob an industry nigga?\nThis ain't serious\nBeing broke can make you delirious\nSo we rob and steal so our ones can be bigger\n50 Cent, how it feel to rob an industry nigga?\n\n[Verse 2: 50 Cent]\nI'll catch P and Silkk the Shocker right after the Grammys\nAnd Will Smith and Jada ass down in Miami\nRun up on Timbaland and Missy with the pound\nLike, \"You, give me the cash; you, put the hot dog down\"\nI figured it out, niggas been robbing Joe before\nThat's why his ass don't wanna be a player no more\nMy attitude while robbing J.D.? \"Fuck you, pay me!\"\nHad Da Brat with em, should've had his gat with him\nDMX wanna get down, well, you tell, homie\nI'm on that Treach shit, I do my dirt all by my lonely\nI should rob Clue, man, his shit did well\nI wanna stick TQ, but his shit ain't sell\nI hit the studios, take niggas' jewels and leave\nCatch Rae, Ghost, and RZA for them funny ass rings\nTell Sticky give me the cash before I empty three\nI'll beat your ass like that white boy on MTV\nCanibus wanna battle while I'm sticking him up\nFuck the cab, the coroners picking 'em up\nHeavy tried to hide his shit, hey nigga I saw you\nHe said \"Why you robbing me? I got nothing but love for ya\"\nCaught Juvenile for his Cash Money piece\nTold him I want it all, he said, \"Even my gold teeth?\"\nI caught Blackstreet on a back street in a black Jeep\nOne at a time, get out and take off your shine\nDid you ever think that you would be this rich?\nDid you ever think that you would have these hits?\nDid you ever think that I'd flash the nine?\nAnd walk off with your shit like it's mine?\nI'mma keep sticking niggas until I'm living\nI'll rob Boyz II Men like I'm Michael Bivins\nCatch Tyson for half that cash like Robin Givens\nI'm hungry for real, I'm about to stick Mister Cee\nThat nigga still eating off Big's first LP\nI had Busta and the whole Flipmode on the floor\nHe asked me if I had enough, I told him, \"Gimme some more\"\nIs you feeling this? Then wait for the sequel\nI gotta get Kirk Franklin for robbing God's people\n\n[Hook: The Madd Rapper]\nThis ain't serious\nBeing broke can make you delirious\nSo we rob and steal so our ones can be bigger\n50 Cent, how it feel to rob an industry nigga?\nThis ain't serious\nBeing broke can make you delirious\nSo we rob and steal so our ones can be bigger\n50 Cent, how it feel to rob an industry nigga?\n\n[Outro: The Madd Rapper]\nFor real, yo, you know what I'm saying?\nNiggas got to get stuck up, that's just how it goes down\nIt don't matter if you an industry nigga or a regular nigga or a bitch\nIt don't matter if you got it and I need it I want it\nYou know what I'm saying? That's just how it go down\n50 Cent ain't fucking around, Trackmasters ain't fucking around\nCrazy Cat ain't fucking around, The Madd Rapper ain't fucking around\nYou know what I'm saying?\nSo watch your backs, watch your pocket book, watch your pockets\nWatch everybody on the train, watch everybody on the bus\nCause we gonna get you whether you like it or not", "year": "1999-08-10"}]}