{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro]\nYou are lucky, for letting me know that I am not\nUnfortunately, the lucky never realize they are lucky until it's too late\nYesterday you were better off than you are today, but it took today for you to realize it\nBut! the day has arrived, and... it’s too late\nYou see? People are never happy with what they have\n\n[Verse 1]\nNever fear, shed a tear, every years changing\nSet a gear, let me ears, billy's rearrangin'\nIt’s amazin', this box I'm caged in\nA haven for the layman\nMy aim's a raven\nBathin' in a base 'n' filled with litigation, I'm racin’\nEach crowd I rock is a playpen\nI’m playin' while I’m pacin'\nPush harder on the cold pavement, I'm enslaved in\nMomma said I was a stubborn boy\nWho tore his rage in bull fed spice how to cage in\nMet a couple rap packs, and we stayed kin\nBlazed up and baked in, self preservation\nSet a strange coarse off on the trains in\nFelt like a strange skin\nNever been the same since\n'83 was the year that I came in, May 5th\nSay Ben, Why we wearin’ aprons?\nIt's a hustle that I didn't sign up for\nBut gotta set bill quick, Fuck, goin' job core!\nI'm sicker than the average, rap-ridden rabbits\nTrack smilin' magic, no, I gotta have it\nIt's poetry or understandable garbage\nThe word pours, oh , so close to artists, but\nI'ma keep on keepin' each song, to free speech on deaf beats like Petong, I\nCan't hear you, image and egos\nSo won't know fear through the gimmicks you leave, so\nBe out of my peep-holes, silly ol' Neemo\nMore tricky fish than a peep show\nI'm rugged to the arsenic jingle\nThe lame airwaves make my cartilage tingle\nIt's enough to give a bag and a shingles\nIn this fake world, I mingle\nTo me it's all details\n\n[Chorus]\n(What'chu gonna do, do do, do do, do)\nIt's all details\n(What'chu gonna do, do do, do do, do)\nTo me it's all details\n(What'chu gonna do, do do, do do, do)\nYou see it's all details\n(What'chu gonna do, do do, do)\nThe devil's in the details\n(Do do, do do, do do, do)\nThe devil's in the details\n(Do do, do do, do do, do)\nThe devil's in the details\n(Do do, do do, do do, do)\nThe devil's in the details\n(Do do, do)\n\n[Verse 2]\nThese days MCs and DJs\nWalk through each maze with a girl named Cliche\nCar, chain, fake MC battle\nShake, roll, rattle, hoarse mic on a saddle that'll\nStraddle all prior push on our movement\nThey say that our music, is merely amusement\nAnd if it is, I've amused myself to death\nAnd EBAY'd off every last breath\nGoin' once, goin' twice, it's sold now\nSpreadin' the whole town, a segment of gold nouns\nWords fall off the wall like paint chips\nI'm biting my dazed lip, and hearing the same shit\nI'm only tryin' to breath\nThey want me to fly, but they wire my needs, see\nIn this circus I'm fire and greed\nA surplus got me dyin' to beed\nIt's all details\n\n[Chorus]\n\n[Outro 1]\n*Ding*\nWhat's goin' on Burn?\nWhat up! What's the deal man?\nChillin'. Where you goin'? You goin' to the top?\n(How you doin' man?)\n(Chillin', you?)\n(Yeah, yeah) Where you headed, top?\nTop, yeah (AAaayyeee!)\nAll right, lets go, lets go\nGood job man, so what's been popin' man?\nTryin'a make it happen, break down the doors, you know how we do?\n*Arrggh* I feel you man\nI brought my may down (Oh, what?)\nFrom Bestbuy (Ah, you're the one)\nYeah! *Hahaha*\n*DIng*\nWhat up, niggas!! (What up!)\nWhat up man, where you headed man?\nOh, shit, the buttons pressed to the top\nAre you? Ah, you goin' to the top too!?\nI don't know what the fucks goin' on up there\nYo, I knew I fuckin' smelt Burny from the fuckin' floor\n(Ah, fuck you man) This nigga came the fuck up\nWhatever man, so I like to smoke before I come up\n*Ding*\n\n[Voice Clip]\nMost people don't think twice about getting into an elevator with a stranger, but they should\nTake a look at this surveillance video\nNew York Police Department is hoping someone can help them identify this man\nAs you can see, the man walks into this New york city elevator and pulls a gun on the unsuspecting person inside\nThe robber hit the victim in the head repeatedly with the gun and allegedly took his wallet\nThe victim had minor head injuries and police are hoping you can help track down the suspect\n\n[Outro 2]\nThis is elevator music\nI am Plex... Luther. Don't ever forget the Luther\nUmm... What happened to the Funk?\nThat's what I wanna know\n*Ding*", "title": "Details", "year": null, "album": null, "image": "https://images.genius.com/c714b196bcc8378c9e57d2328f2b237d.1000x1000x1.jpg"}]}