{"artist": "Iamsu!", "songs": [{"title": "100 Grand", "lyrics": "[Hook: x2]\nI keep it 100 grand understand, understand\nI keep it 100 grand\nI keep it 100 grand understand, understand\nI keep it 100 grand\nUh, uh!\n\n[Verse 1: Iamsu!]\nWhat's happenin'? from the Rich'...\nWhere them niggas get active\nCan please tell me somethin' that I don't know?\nMe and the gang we're going loco\nI got a cold flow, these rappers broke though\nBut I won't help them I will melt them\nRumpelstiltskin, they was sleepin' on me\nI got a problem, I always keep something decent on me\nThey think I'm fucking with 'em, they think I play around\nI keep it real so the real always stay around\nI keep it underground, ain't it your funny style?\nMad cause a nigga getting money now\nIt's the gang, huh? We in this thang, huh?\nI spent your whole paycheck on this chain, huh?\nI'm from the Bay huh? That's where it came from\nIt's where them squares came through and got the game from\n\n[Hook: x2]\nI keep it 100 grand understand, understand\nI keep it 100 grand\nI keep it 100 grand understand, understand\nI keep it 100 grand\nUh, uh!\n\n[Verse 2: Juvenile]\nI'm rolling like I'm bowling and I'm striking like I'm posing\nPeople looking at me like I was chosen\nYou know the big dog gotta keep dosing\nEvery day I get it in, shit, I just win\nBitch, I'm 100 grand, ten racks times ten\nYou kiss ass and I don't follow that trend\nChoppa on deck, send whoever you wanna send\nGorilla game I'm doin shit they ????\nIf you ain't bringing money to the table you can vacate\nYou be up all night staring in the ice box\nI be making deals buyin shares of the right stock\nI'm a cool cat, I don't really like cops\nIn and out the jail, making bail, bitch, my life hot!\nI'm always in the building, cause I built it\nIt's all breast feed, you know I milk shit\n\n[Hook: x2]\nI keep it 100 grand understand, understand\nI keep it 100 grand\nI keep it 100 grand understand, understand\nI keep it 100 grand\nUh, uh!\n\n[Verse 3: Problem]\nAll the real niggas know the name Problem\nDiamond lane real on it, fast car\nWood on the dashboard, all about the cash board\nMake the money fast forward, make it bitch give me that like I ask for it\nTreat the hood like Nascar, exotic whip trunk in the front bad boy\nElephants in the room, pretty with pretty goons\nFlip the script with direct shots like Beanie Boom\nFuck that where the bitches at\nNo big buildings but down town is where your bitches go\nLittle Compton ass nigga with the vicious flow\nNiggas careers, bout to do where the dishes go\nWatch cost me a brick of blow\nBitch before you come grab some zags from the liquor store\nCause a nigga try to smoke something\nCali only bought it back ye no frontin'\n\n[Hook: x2]\nI keep it 100 grand understand, understand\nI keep it 100 grand\nI keep it 100 grand understand, understand\nI keep it 100 grand\nUh, uh!\n\n[Verse 4: Kool John]\nTell these straight things I'm about, I'm about riches and bitches\nI'm about being the sickest, cause niggas know I'm the realest\nSuzzie on the beat he knew I was gonna fill it\nHe knew I was gonna kill it, I whip chamber it with it\nHe put me against the best of MVP every time\nThey want these hot rhymes, they're killing in every line\nThese niggas rap good, but these niggas really lying\nWe're seeing these cash money, now niggas is big timing\nWe're fucking with my cash, man you're fucking with your life\nI ain't saying I'm a thief, but a nigga fuck your wife\nI'm riding like a cock, got these fans screaming outside\nGot your bitch screaming, now she wanna fuck a jackpot\nI got the gold chains huff back smart pack\nHuff hatch smart swag and your bitch love that!\nI never slipped up I'm 50 G'd up\nTrying to get my dick sucked, trying to get my gwap up\n\n[Hook: x2]\nI keep it 100 grand understand, understand\nI keep it 100 grand\nI keep it 100 grand understand, understand\nI keep it 100 grand\nUh, uh!", "image": "https://images.genius.com/d9aac6b0004bb7670481c392847fcd4b.450x450x1.jpg", "album": "Kilt 2", "year": null}]}