{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/77ef0c835ab568a0ed94a31a3605ccc3.1000x1000x1.png", "title": "Major Distribution", "lyrics": "[Chorus: 50 Cent & Snoop Dogg]\nI'm trying to move 1 brick, 2 brick, 3 bricks, four, more\nI'm trying to move 5 bricks, 10 bricks, 20 bricks, raw\nI smoke one ounce staring at the caddy on the showroom floor\nNow I'm trying to move 5 pounds, 10 pounds, 20 pounds, more, boy\n\n[Verse 1: 50 Cent]\nRun tell the Bloods I’m crippin', go tell the Crips I’m Blood\nNigga, I be trippin', bitch, I don't give a fuck\nI put the K on niggas, I spray on niggas\nCome through 2012 XJ on niggas\nI'm an apex predator, nigga, I'm stronger\nShooters on deck, I break bread and they on ya\nNiggas said I fell off, oh, you heard I fell off?\nWhy the fuck would you be repeating that?\nNigga, I'm a rap tycoon, make a 100 mill by June\nNow who the fuck said I can't rap, Jay?\nI'm in a dope fiend's dream, I got it for 'em raw\nI got that morphine memories, I've been breaking the law\nI was born a burner, in the stroller with the llama\nI'm violent, I kill a nigga, put that on my mama\nNah, nah, don't tell me nothing about none of these niggas\nI smoke all these niggas for this bread\n\n[Chorus: 50 Cent & Snoop Dogg]\nI'm trying to move 1 brick, 2 brick, 3 bricks, four, more\nI'm trying to move 5 bricks, 10 bricks, 20 bricks, raw\nI smoke one ounce staring at the caddy on the showroom floor\nNow I'm trying to move 5 pounds, 10 pounds, 20 pounds, more, boy\n\n[Verse 2: Snoop Dogg]\nI give a fuck about a fed as I jump up outta bed\n5 pounds, 10 pounds, 20 pounds, yeah\nI'm trying to put this shit away on the low\nI need a hit a day, think you better get away\nFrom my, oh, my, I got a birdie that'll fly\nFrom Cali to Kingston, back to NY\nSnoop's smash the kush, from 5 to 9\nCome by and get you some pounds and now you flying high\nRun with the metal with my foot to the pedal\nG's with the trees and the C's on my level\n5-0, you know I go hard, these fools call me Bogart\nHead nigga in charge, these niggas soft as DeBarge\nBut I ain't tripping, I'm just flipping my cheese\nCause if you really want the bomb come and fuck with your G's\nI got it, always kill, always will\nHad that, sit that, my nigga get that, you hear that?\n\n[Chorus: 50 Cent & Snoop Dogg]\nI'm trying to move 1 brick, 2 brick, 3 bricks, four, more\nI'm trying to move 5 bricks, 10 bricks, 20 bricks, raw\nI smoke one ounce staring at the caddy on the showroom floor\nNow I'm trying to move 5 pounds, 10 pounds, 20 pounds, more, boy\n\n[Verse 3: Young Jeezy]\n5 AM in the kitchen, nigga, I'm coughing\nBag full of white 8 balls, I'm going golfing\nNow homie got killed last night, bought him a coffin\nRetaliated the same night, made him a dolphin\nGuess that's the life of a yay' flipper\nChoppers making your ass get naked just like a stripper\nGot cameras for the jackers, home invaders, man\nThem niggas coming all black like they Raiders fans\nAll I saw growing up was kilos and gangbanging\nThen the homie taught me to whip, gamechanging\nNow I'm breaking down birds on the coffee table\nYeah, and half them bitches sold 'fore they off the table\nGotta look, nigga wantin' my half, I’m gonna split it\nThe type of nigga work that visit like it's a skillet\nLess Soda, more water, stretching like it's elastic\nWeigh it up in 250's, wrap it up in plastic, yeah\n\n[Chorus: 50 Cent & Snoop Dogg]\nI'm trying to move 1 brick, 2 brick, 3 bricks, four, more\nI'm trying to move 5 bricks, 10 bricks, 20 bricks, raw\nI smoke one ounce staring at the caddy on the showroom floor\nNow I'm trying to move 5 pounds, 10 pounds, 20 pounds, more, boy\n\n[Outro: Snoop Dogg]\nYeah, you know what it is. It's your cripping cousin, 5-O. Anytime you need that mothafuckin' smoke, you know I got it, cuz. You need 5 pounds, 10 pounds, 20 pounds? Whatever you need, you know I got it. And if them niggas out there in the NY need it give 'em my connect so I can hook them niggas up with that. Ooh wee, ooh wee! We tryna move this shit, cuz. For real though. I got too much of this shit, homie. Yeah, I'm Bob Marley reincarnated. Jah! Rastafari!", "year": "2013-02-05"}]}