{"songs": [{"image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg", "title": "Bossed Up, Pickle Juice", "album": null, "year": null, "lyrics": "You have to be like a beast. You have to be a beast. That’s the only way they respect you. I came up under Wayne, and Wayne has his way of doing things. When Wayne walks up on the motherfuckin' set and-and say, \"Don’t talk to me, have my fucking music ready, get the fuck up out of my face, I’mma blow this shit in your fucking face all day, it’s cool. But every time I -- every time I put my foot down and stand up for myself, it’s like, \"We’ve heard about Nicki Minaj! Nicki Minaj shut down a photo shoot! Oh my god! No one wants to work with Nicki Minaj!\"\n\nI’m glad you heard. Now, when I come to a photoshoot, let it be of quality. You know why? Because I put quality in what I do. I spend time, and I spend energy, and I spend effort, and I spend everything I have, every fiber of my being to give people quality. So if I turn up to a photoshoot and you had -- you got a fifty dollar clothes budget and some sliced pickles on the motherfucking board, you wanna know what? No, I am gonna leave. Is that wrong? For wanting more for myself? Wanting people to treat me with respect? But you know what? Next time they know better. But I had accepted the pickle juice, I would be drinking pickle juice right now\n\nWhen I am assertive, I’m a bitch. When a man is assertive, he’s a boss. (He bossed up.) He bossed up! No negative connotation behind \"bossed up.\" But lots of negative connotation behind being a bitch\n\nDonald Trump can say, \"You’re fired!\" Let Martha Stewart run her company the same way and be the same way! \"Fuck, oh, evil bitch.\" But Donald Trump, he gets to hang out with young pussies and have 50 different wives and just be cool… \"Oh, Donald we love ya. Donald Trump…\" But when you’re a girl, you have to be like… everything. You have to be -- you have to be dope at what you do, but you have to be super sweet, and you have to be sexy, and you have to be this, and you have to be that, and you have to be nice, and you have to… It’s like, I can’t be all those things at once. I’m a human being… I don’t mean to be ranting and raving like this. I don’t -- don’t use this footage, please; it’s just gonna make me look stupid"}], "artist": "Nicki Minaj"}