{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/245f4bc41f8d423fa59b932bdeaf60e5.719x719x1.jpg", "year": "2019-08-01", "album": "Funk Flex Freestyles", "lyrics": "[Part I: \"Otis\"]\n\n[Intro: YBN Cordae]\nOkay, ooh, ooh\nOh, y'all on some shit\nSip my tea man\nMake a lil' house out this bitch\nUh, okay\n\n[Verse 1: YBN Cordae]\nI came in the game with a chip on my shoulder\nLooking at the competition, all these niggas is older\nOnly got two favorite rappers, Jigga and HOVA\nI'm sipping the soda, Lamborghini equipped with a motor\n'Till I hopped in the fast lane, reminiscing my past pains\nCarry it, the cash came, heritage from my last name (Uh)\nI'm from a tribe of brilliance, I buy the building\nPlease hide the children, I'm 'bout to go on a killing spree\nKnow you feeling me, got these rap poems, soliloquies\nWife, I really need, these hoes a bunch of Billy Jeans\nFake ass niggas, snake ass niggas\nRapping fast but \"What the fuck did you say?\" ass niggas\nType imported with Michael court in, your life distorted\nThe best nigga out of the league since Michael Jordan\nPlotting what I'm 'bout to accomplish, quite enormous\nI don't have to write to forfeit, my nigga my life a story\nCall Spike Lee, tell him how I made it off of type beats\nI might be the nicest with the handles since Kyrie\nRookie vet, came in the game, just took the check\nBodying everything that I do, my nigga look at Flex\nShoutout to my nigga Joey, court side at the Brooklyn Nets\nTold him I need a ticket, you gotta be specific\nMy nigga, I bleed terrific and piss excellence\nMy shit heaven sent, flowing like a sick veteran\nThe difference between me and you\nMultiply your self worth by five trillion\nYour high ceilings still couldn't equal two\nFraction of my worst shit, find your purpose\nBut while my verses, you can learn something, go soul searching\nNow watch me spend these Benjamin Franklins\nLike what this nigga be thinking\nNever forgot to deposit that as memory bank and\nHilary Swank and niggas should really be thanking\nThe young God MC stopped the killing, he's dangerous\n\n[Interlude 1: YBN Cordae & Funkmaster Flex]\nYou see it, wow\nUh, huh (Woof), yeah\nWatchu got Juan, watchu got?\nWhat's next?\n\n[Part II: \"Suge\"]\n\n[Intro: YBN Cordae]\nOkay, ayy turn this shit up a little bit\nOkay, I fuck with this, alright\nUh, Jetson make- ayy\n\n[Verse 2: YBN Cordae]\nDifferent day, different dollars\nSwitch Impalas, Fendi, Prada, plenty proper\nJust dropped 100K on my new portfolio, you a penny stopper\nYou can keep your Balenciaga's, got plenty drama\nMan, I'm fiending like twenty mamas\nI'm barely rich, man, I still eat at Benihana\nI'ma need like ten Rihanna's\nPost commentary to all my niggas in solitary\nMy bitch bad like Halle Berry\nWe be making movies like Tyler Perry\nShit kinda scary, my God\nWhy you got to be so bashful\nShawtie wanna hit my phone with a hassle (Huh)\nI ain't tryna raise no Rascals\nCopped a new crib, shit look like a castle (Ayy)\nGetting them coins (Uh), Filet the steak, I ain't eating sirloins (Uh)\nBaby come join (Uh), I'm getting this money, I won't\nSo fortunate, proportionate\nLost Boy, nigga, no coordinates\nRemember Christmas, we was giftless\nThree foot tree, no ornaments\nPull my dick out, hoes swarming it\nFlow cold, nigga no warming it\nMama couldn't afford AAU, so we couldn't hoop, nigga no tournaments\nNow I'm with my nigga Ben Simmons plus ten women, I been winning\nMe and you, it's a big difference\nNaw for real, now listen Flex, ayy\nYou ain't dealing with no amateur\nTwo toned drip might damage ya\nHit a nigga quick, no camera\nI do not think you could handle us\nWhy they in the streets so scandalous?\nRap niggas dumb, don't plan enough\nLet me tell you how I ran it up\nSix months, live with my manager\nI was down bad on my ass, with no cash in the bag, now I'm finally manning up\nTryna get a sack, boy I'm the quarterback on my team like my last name Manning, bruh\nKnow what that mean?\nIf that bitch bad, get in between\nHer pussy wetter than aquamarine\nMade that ho sing, Adam Levine (Uh)\n\n[Interlude 2: YBN Cordae & Funkmaster Flex]\nYeah, yeah\nHold it bruh\nKeep it rolling\nWe rolling (Uh, huh)\nYeah, yeah, yeah, yeah\n\n[Part III: Kick, Push]\n\n[Intro: YBN Cordae & Funkmaster Flex]\nIf you got bars (Uh, huh)\nIf you out here watching this\nHol' up, hol' up my nigga, bring that back\nAww man\nIf you got bars like this (Uh, huh)\nSubmit you material, alright (Yeah)\nSubmit FunkFlex.com if you can spit like YBN Cordae (Yeah)\nI'm not sure if you can, but if you can send it to me\nCome on\nYou got another one?\nLet's do it, come on let's play (Let's go)\nIf you got another one, I got another one (Let's do it)\nLet's go, let's do it\nUh, man I love the diversity\nFlex, yeah, yeah\nOh, this why I came up here 'cause y'all play great beats (Who?)\nFor real, haha, ayy\n\n[Verse 3: YBN Cordae]\nI'm still searching on the path that I'm headed beyond\nOne thing I had to learn was never question a don\nWhat is life to a king and what is death to a pawn?\nWhen I was twelve I got baptized and read the Quran\nSearching for purpose, answers\nLocked up for murdering verses\nStan, I heard you was nervous but that's my manners\nGrew up in Carolina but was raised by the panthers\nMoved to Maryland, mama used to work at the Sheraton (Uh)\nOne bed room apartment, it was so embarrassing\nHard times will humble the soul and lower arrogance\nRaised in the trenches with robbers, it's no samaritans\nNo charity, you niggas confused, it's no clarity\nCrystal clear diamonds from Africa, just imported\nI realized with money that vanity is less important\nFeeling like LeBron with plans of catching Jordan\nPlotting on a billi, ways to invest the fortune\nLet me switch the topic for you niggas that's getting brolic\nIf you kicking knowledge, I'll make a scholarly visit college\nDropped out and told professor, \"Kiss my ass\"\nNow I'm heading to the studio to diss my class\nLet me bring it back a second for all of my adolescence\nAm I the dopest out? My nigga, why is that a question?\nCompetition is nonexistent, was born the greatest\nMy parents fornicated but that shit's a normal basis\nGave birth to a king, wasn't a cloud in the sky\nTo all of the motherfuckers who would doubt, it's a lie\nSo remember this like it was in the Book of Genesis\nI reminisce days when love was real and all the infinite\nTired of the fake shit, back to the basics\nYour favorite rapper's favorite, somebody had to say it\nWas caught up in the Matrix, almost lost joint\nNow, y'all motherfuckers go and cross The Lost Boy\nNigga", "title": "YBN Cordae Freestyles on Flex | Freestyle #130"}]}