{"songs": [{"year": null, "title": "If... (My Mommy)", "image": "https://images.genius.com/e419c674f3606427aa03bb9748a8b873.360x360x1.jpg", "lyrics": "[Intro]\nI dedicate this song to that one special lady.  That lady who never, never turned her back on a nigga.  That one lady who no other woman could be—no matter what, man.  Let’s reflect for a moment, my real\n\n[Hook]\nIf this world were mine\nI would place at your feet\nAll that I own\nYou've been so good to me\n\n[Verse 1]\nI wrote about stickin' the mamis\nWrote about lickin' the tommy\nIt's time for me to write some shit for my mommy\nMy mother, and not only to tell her I love her\nBut to show her how the pen can cause her kid to grow up\nI don't even be lying no more.  Ma, I'm honest\nI'm not playing with guns no more neither, I promise\nI'm not hanging with the donnas\nHe my dog and I love him but fuckin' with son is just too much drama\nI wonder how it would be if you had the chance to raise me\nWould I still not know how to romance a lady?\nIs it ‘cause you made me a cancer baby\nThat I stay on some crab shit so nobody get the chance to portray me?\nWhatever it is, yo, I ain't tryin' to let it go\nI'm focused ma—I know what I'm headed for\nAnd, oh, before I let you go\nYou might not knew it before, so I'm telling you now to let you know\n\n[Hook]\nIf this world were mine\nI would place at your feet\nAll that I own\nYou've been so good to me\n\nFor real.  Every day, ma.  All that I own.  Ya know?  You been good, ya know?  Even when you couldn’t be there, you was there.  You know what I mean.  You what’m saying?  You what’m saying?\n\n[Verse 2]\nI remember the everyday arguments\nPart of it was fuckin' with my common sense\nThe other part of it gave me the confidence\nTo do what I was doing\nOnly if I knew what I was doing\nWhen, what, and who was I pursuing\nBeing twelve years old, guzzlin' gold\nComing home drunk.  You crying while I stumble and fold\n‘Member you had your son like a bum in the cold\n‘Cause you was movin' my kicks and found jumbs in the sole?\nBut, man, I was a young man just runnin' the road\nTryin’ to make a little crumbs ‘cause wasn't none in my bowl\nI hated to see you struggle for gold\nWhen you really deserved ice, double the cold\nThat glow like your colorful soul\nMom, my love for you has wanted to grow\nLast ten times stronger than any couple that's old\nAnd, oh, before I let you go\nYou might not knew it before, so I'm telling you now to let you know\n\n[Hook x2]\nIf this world were mine\nI would place at your feet\nAll that I own\nYou've been so good to me\n\nEverything.  All that I own.  Ya know?  Shit it real, man.  I put my life on the line, son.  This rap shit ain’t gassed up.  You know what’m saying?\n\n[Verse 3]\nYo, I said they could never give enough cheddar to me\nTo talk about the lady that made me negatively\nEven though eye to eye’s something we never could see\nMy mother's the one woman no other one ever could be\nSee?  She gon' be proud when I blow like Nagasaki\nDon't ever regret lettin' them cell blocks adopt me\nJail was a blessin', mommy.  My nation stood by me\nThey got me in places regular faces can't find me\nAnd Omega, my crimey (what he say?), told me I'm so ahead of my time\nEven when they fast forward, niggas rewind me\nI learned about Malcom, Marcus, and Kwame\nAbout the white man—why he feed us spiced ham\nSpam, and salami.  Lyrically they can't deny me\nAll I need is your love, your trust and just for you to stand by me\nAnd, oh, yo before I let you go\nYou might not knew it before so I'm telling you now to let you know\n\n[Hook]\nIf this world were mine\nI would place at your feet\nAll that I own\nYou've been so good to me\n\nEvery day.  All that I own.  Ya know?  This song is for all the mothers in the world.  Everybody’s mother.  The deceased mothers.  Rest in peace, mothers\n\nYeah, that’s real shit, man.  Real talk, man.  I love you, ma.  Word up.  For everything, yo.  Let’s get back into some street shit", "album": "The Best of Saigon A.K.A. The Yardfather Vol. 1"}], "artist": "Saigon"}