{"songs": [{"album": "Return of Greatness", "year": "2014-01-03", "title": "Key To Life", "image": "https://images.genius.com/361c50ac4fbeb75a5d90584024bc5b19.500x500x1.jpg", "lyrics": "[Verse 1]\nIt get no great as me\nEven the haters see\nI must be eleven hundred if I ain't a G\nBefore the deal, cuban links or the AMG\nTrying to steal Cuban Linx out of HMV\nI'm a vet, where's the level of respect?\nI do this shit for rec\nIt was never about a check\nCheck, I'm that nicer\nHow could you ever bash Writer?\nI wrote rhymes for the jects to have a rap cypher\nFacts, biter; you don't have to ask questions\nMy first battle was against a battle rap legend\nYou rappers have sessions just to put out dirt\nI ain't just put in work, I put out work\nAsk Cam though, everything I put out worked\nGrown man flow, get anyone you pushed out worked\nKnight with the armor, light with the scharma\nWhich one of y'all don't think Writer's a monster?\nI will bomb ya, everything I write you should honor\nI had cyphers with Jim when he was driving a Honda\nFacts, I'm spitting crack, come buy you a pack\nI been bodying cats before they popped up with Smack\nGrew up with Rex, Lux; a couple guys that could rap\nAnd killed tracks with Juelz when he was driving a Ac\nThat's real rap, you ain't tuned into a lame\nI'm on Pluto with it mayne\nWe ain't musically the same! (at all)\nHow could you explain moving in the game\nTo a nigga who helped build the biggest movement in the game?\nCalling it quits, he don't get rawer than this\nPut the corpse in the ditch, just hit record and it's lit\nAnytime I'm in the place, divas all on my dick\nBunch of diamonds in the face, Jesus tour on my wrist\nUnderrated, but your mother favorite\nLet the beat breathe, I don't wanna suffocate it\n\n[Verse 2:]\nWhere's the ambulance? You don't stand a chance\nGrams got 'em back and forth, hammer dance\nThem old days, hand to hand on Amsterdam\nI had a coke wave when French was just a camerman\nThat ain't a diss, don't be asking me if\nI got beef with anybody, these are facts that I spit\nI'm passionate bitch, there's passion in these tracks that I rip\nYou will never be a match because I'm lit, trick\nStraight up sick, but they love Rif\nHud 6 told me \"Get 'Em\" was a straight up hit (R.I.P.)\nThem real bars of crack you don't wake up with\nI did real songs with Stacks, no made up shits\nShit, how I'm not great, I'm tired of y'all fakes\nCome out of y'all face, don't fly to my estate\nYou know me fam, I ain't got the lot of y'all fakes\nI toured Japan off of a couple Writer's Block tapes\nWait, ain't no touching Writer\nY'all a bunch of biters\nI ain't passing the blunt, I'll fuck up the cypher\nI'm a pro -- you ain't know, now you know\nThe damn nail salon don't even wanna go toe to toe\nBut yo, I ain't ya average spitter, I mastered this\nAsk your bitch, she been at a nigga way before I had a Twitter\nWhat had happened nigga, we taking this over\nI leave him in the clouds if he claim he a smoker\nRoller, you could smell the hazy aroma\nSmoke enough of this, you'll spend the day in a coma\nDifferent kind of bling, I hang with the owners\nRocks sticking out the ring like Adrien Broner\nNews break, how you niggas gonna scoop cake?\nWhat you know about getting a quarter mill for two tapes?\nI overgrind dummy, being broke is not funny\nI put in work, like I need that overtime money\nMoney, I'm a beast\nUnderstand that seeing me\nYou better off jumping off the roof and landing on your feet, capiche?\nAll these other rappers are basic\nIt's Asics, made me take a nap when they played it\nFace it, these cats ain't got the talent to take it\nYou wasted, with some wack cats on your playlist\nI download they tracks to erase it\nI think its about time I them back to the greatness"}], "artist": "J.R. Writer"}