{"songs": [{"image": "https://images.genius.com/f5c5d75e5a52f8df5fa4820d6ec6dfc9.550x550x1.jpg", "year": "2014-01-01", "lyrics": "[scratches: Paten Locke]\nThe big man on campus\n\nMost rappers fail ‘cuz of the sloppy way their beats are chosen\nThey need to move to Germany and rock some Lederhosen\nYou fuck with Ak, you hear that beat explosion\nA good look, like you found a parking spot that had the meter broken\nI’ll rock a heap of shows and wake up all the sleepers dozin’\nAnd get these heaters goin’ so we get the people knowin’\nBest believe I go in – flowin’s in my hemoglobin\nPlus I got the game to pull that shorty by the speaker posin’\nShe lookin’ good and smilin’ like she would be pleased to know him\nWhispered in his ear she got some supple double D’s to show him\nLegs were lookin’ lovely, bubble exceeded the norm\nDid a couple more songs and bounced with the key to the dorm\nWhat’s your name again? She smiled and repeated it for him\nWatched a little movie, then it quickly proceeded to porn\nThrew on the lingerie, she want him to beat it ‘til morn\nNow the heat is on, lights are gone, and the speakers are blowin’\nHip-Hop, Run-DMC ‘My Adidas’ is goin’\nHer homie’s callin’ and he want a Ak CD, a old one\nAnd if I sell it to him, we can have the weed he holdin’\nTook it to her room, my name was on the wall graffiti golden\nStrip poker man, you know you’ll never see me foldin’\nNow she’s standing there in the bottoms of her bikini only\nR.A. is knocking at the door – don’t let him see me homie\nI’m fully dressed but, yo, these college heads don’t need to know me\nI politely stepped out the side door\nAnd continued with my homies on my worldwide tour, but\nShe got expelled, so I guess the knowledge is:\nBe careful when you fuck with a college chick\n\n[scratches]\n\nThe big man on campus\n\nRain on your college-ass disco dorm\n\nHey baby, you got a girlfriend? Me so horny. Me love you long time", "title": "Campus Invasion", "album": "Built To Last "}], "artist": "Akrobatik"}