{"artist": "Valete", "songs": [{"title": "BFF", "year": "2019-08-29", "lyrics": "[Intro: Tiago & João]\nFoda-se a sério mano?\nNão te ia mentir, mano!\nFoda-se!\nYa, não te ia mentir\n'Tá-se bem, eu vou ver isso! Tchau aí, mano\nYa, tchau\n\n[Verso 1: Valete]\nCom o coração golpeado gravemente\nAnsiosamente ele põe a chave na fechadura\nRoda a chave para a esquerda ele roda suavemente\nAbre a porta e vê a casa toda escura\nDo quarto ouve um som que parece Jovanotti\nNah, afinal é Luciano Pavarotti\nPara não fazer barulho ele anda bem ligeiro\nSorrateiro enquanto anda assenta o calcanhar primeiro\nTem a caçadeira no armário do escritório\nInstinto predatório para mandá-los para o crematório\nPega na arma com uma postura insegura\nE a tremer empurra para a direita a patilha de abertura\nBem insano ele vai entrar sem plano\nUm cartuxo em cada cano e cerra o semblante\nPuxa a patilha e pensa no amigo de infância\nA seguir engatilha a arma para a trilha de vingança\nFaceta de louco põe a mão na maçaneta\nEle quer matá-los e fazê-los apodrecer numa sarjeta\nRevolta macabra ele quer ver a cabra morta\nÉ a reviravolta, respira fundo ele abre a porta\n\nAna - \"Tiago, Tiago, baixa a arma, baixa a arma!\"\nPedro - \"Foda-se, Tiago, baixa a arma, Tiago!\"\nAna - \"Baixa a arma, foda-se!\"\nPedro - \"Calma, mano!\"\nAna - \"Tiago, baixa arma! Foda-se!\"\n\n[Verso 2]\nUma vida radicada numa entrega tresloucada\nUma vida debitada, dedicada a ti\nO esforço que fiz para teres a vida acautelada\nPorque trabalho como um escravo para que não te falte nada\nSenti-te estranha, senti o clima alterado\nEu devia ter calculado que era tudo falseado\nRelação já não tinha chama\nMas nunca pensei que acabasses com essa doninha na minha cama\nForreta, era o que ouvia nas tuas bocas\nQuando fui eu que comprei as tuas jóias, as tuas roupas\nPuta, cona largada, pura insana\nEncharcada de moralismo sempre armada em puritana (Puta!)\nAgora vais sentir a sequela (A sequela!)\nCom a caçadeira enfiada na tua goela (Na tua goela!)\nA bala a perfurar a traqueia\nE o teu corpo como plateia enquanto a morte fraseia\n\nPedro - \"Tiago, Tiago!\"\nAna - \"Foda-se!!\"\nPedro - \"Foda-se!\"\nAna - \"Caralho!\"\nPedro - \"Calma, mano! Calma, caralho!\"\nAna - \"Ai, Tiago!\"\nPedro - \"Pensa, Tiago, olha p'ra mim!\"\nAna - \"Tiago!\"\nPedro - \"O que é que tu vais fazer?\"\n\n[Verso 3]\nNós éramos únicos, os últimos moicanos\nMelhores amigos desde os oito anos\nÉramos os putos das trapaças e chalaças e toda gente\nCom graça chamava-nos de comparsas\nLaço alquímico, sentimento mítico\nDei-te amor bíblico tu eras só um cínico\nLembras-te do nosso pacto de sangue\nSe fosse preciso era morrer um pelo outro como num gangue\nPara a minha mãe eras como eu, deu-te o me'mo trato\nSangrámos juntos, comemos do me'mo prato\nQuem diria que iria ver-te com essa fingida\nQuem diria que seria o teu melhor amigo a tirar-te a vida\nVosso casamento no inferno é o que eu prevejo\nPuta, dá-lhe um beijo e pede um último desejo\nVê a gruta do abismo na viagem conjunta\nE a bruta pena capital, o karma da vossa conduta\n\n[Outro]\nTiago- \"Uhn, uhn\"\nAna- \"Ei, ei, então o que é que foi?\"\nTiago - \"Foda-se, pesadelo do caralho!\"\nAna - \"Estás todo suado!\"\nTiago - \"Foda-se!\"\nAna- \"Vai tomar um banho!\"\nTiago- \"Ya!\"", "album": null, "image": "https://images.genius.com/d8e9f6686e116b74e7728900a266410b.640x640x1.jpg"}]}