{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nOn the Black Caesar tip, my dialogue is just like\nA frank inside of a supermarket, raw dog\nI'm the untouchable, never to be took out\nA Sexy Mother.. ooh child, Prince look out!\nI'm keepin girls of all shades on my trail\nFrom a Sister Act down to a Single White Female\nCause when I hit the skins they all say, \"Damn Kane -\nYou knock out the Bush like a presidential campaign\"\nBut if you think that lickin' toes makes me weak\nYou better treat me like Freddy Krueger: don't sleep\nI write raps, ready to rip and rock real rough rhymes\nRun in rugged and raw, rapidly ruinin' roaches\nPoint blank, I spell murder to a bum\nAll you backwards rappers: REDRUM, REDRUM!\nCause I do em somethin awful, break em down to a morsel\nMakin sure that you're no longer adorable\nRappers get so quiet when I'm comin', that if they\nShitted a dictionary, you couldn't get a word from em\nIt's sort of a tradition in Bed-Stuy to do or die\nSo steppin to me is suicide\nI couldn't think of a rapper takin' mines\nI feel like Ali, \"I'm the greatest of all times\"\nFloatin' like a butterfly, stingin' like a bee\nYeah I know this ain't boxing but that's still my pedigree\nBut as for you, you have no appeal\nHow you get a record deal?\n\n[Verse 2]\nLike shell-toe Adidas, ain't a damn thing changed\nThe way I shoot off lyrics like a firing range\nBreakin' out in a cold sweat, the death threat\nGettin' more props than a movie set\nThe smooth microphone assassin, rhymes keep blastin'\nUh, I keep the body count massive\nBut if you say you increased the Body Count troop\nYou must admit that you joined Ice-T's group\nCause you ain't hurtin' niggedy nuthin', so why you bluffin'?\nTryin' to be the new Big Daddy Something\nBut there's only, before me, no one is richer[?], huh\nYou couldn't come Pryor if your name was Richard\nCause I'm the Alpha and Omega\nArm-Leg-uh-Leg-uh-Arm-Head, stayin' raw til I'm dead\nAnd to battle me you shouldn't even try\nCause with wings on your tongue, you still couldn't say nothin' fly\nAnd I don't care if you bring a crew\nAnd I don't even care if someone else writes for you\nMan, you could even be someone the crowd may just like but shoot\nYou couldn't see me with a bifocal mic\nCheck my resume, Rapmasters, Word Up!\nYo! MTV, BET, The Box and all that good stuff\nAnd Billboard for my five year duration\nAnd see that I got more spots than a dalmatian\nLet's get down to finish this large\nYou could bring on your whole squad, none of you chumps are hard\nAll that garbage you mumble ain't real and seriously, seriously\nHow you get a record deal?\n\n[Verse 3]\nA lot of rappers today, wonder\nShould I ask Kane to write rhymes for me to say?\nWell you're god damn right you should\nCause my rhymes are like spandex, they make any ass seem good\nSo act like you know Baby Pop\nWhen I riggedy rock the higgedy hip-hop non stop, as I\nFreak the funk and flip the flavor to flow with the flyest\nA fury full force in the flames of the fire, now\nMay these MC's rest in peace\nBecause when I come to town, the population decrease\nI leave em finished, dead and that's that, huh\nNot even Pet Sematary could bring em back\nI slay my prey, they decay, I tell em like Jennifer Holiday\nNo no no no no noooooooooooo way!\nThat you could ever touch this, no you know how I feel?\nI think you bought your record deal..", "image": "https://images.genius.com/991e2c2e79db97404e1f9e4632577c92.400x397x1.jpg", "year": "1993-05-25", "title": "How U Get a Record Deal?", "album": "Looks Like a Job For..."}]}