{"artist": "G-Eazy", "songs": [{"title": "I Be In The Lab", "album": "The Tipping Point", "year": null, "image": "https://images.genius.com/b84153d413902dee5130447af68ec3b7.500x500x1.jpg", "lyrics": "[Intro: Dexter's Labratory]\nDee dee, can you please check if your brother is ready for school?\nAt last, my greatest work completed\nSmooch\n\n[Hook]\nI be in the lab\nI, I, I be in the lab\nI be in the lab like Dexter\nDe-Dexter\nI be in the lab like Dexter, Dexter\nI be in the lab like Dexter\nI be in the lab\nI, I be in the lab\nI, I be in the lab like Dexter\nI be in the lab like Dexter\nIn the, in the lab\nIn the lab like Dexter, De-Dexter\n\n[Verse 1]\nI be cooking up slap up in my laboratory\nIn time to hear you other rapper's stories cause they boring\nI'm snoring through your verses, I'm sleeping on you ho's\nI even brought a sleeping bag, pillow, and a change of clothes\nI'm tired of you lames, you don't make music\nYou didn't engineer it, mix it, or even produce it\nYou just wrote your 16, which wasn't even hot\nNow you talking like you got some kinda talent, think not\nI'm sorry to expose you, somebody should've told you\nWhat a rapper does or at least what he's supposed to\nGet your own lab, record your own vocals\nLearn how to mix, then go and learn pro-tools\nDon't need nobody else, I do it myself\nI make all my own beats, Have need for no help\nMarried to the music\nI'm thinking now they call me a professor\nWanna find me? I be I be in the lab like Dexter\n\n[Hook]\nI be in the lab\nI, I, I be in the lab\nI be in the lab like Dexter\nDe-Dexter\nI be in the lab like Dexter, Dexter\nI be in the lab like Dexter\nI be in the lab\nI, I be in the lab\nI, I be in the lab like Dexter\nI be in the lab like Dexter\nIn the, in the lab\nIn the lab like Dexter, De-Dexter\n\n[Verse 2]\nI be in the studio, every night up in the lab\nI'm acting like a mad scientist gone mad\nIn the basement with a pad and a pen jotting down\nVerbs, adjectives, and nouns, while we pass the weed around\nRelieve stress from my mind, jaws drop when I rhyme\nThe freshest boy breathing, you can hate but I'm signed\nAfter my first stanza they bring it back and rewind\nLike hold up, What the fuck you say?\nCause they fucking with me (no)\nEverybody needs to (know)\nPay attention cause we're probably finna (blow)\nUp superstar status, back at it God Damnit\nBitch I am the freshest on the planet\nCheck my resume I been serving these\nTen albums in the game at young age of 18\nYou don't know music how I know music\nTake the beat and I abuse it\nBitch I does this don't confuse it\n\n[Hook]\nI be in the lab\nI, I, I be in the lab\nI be in the lab like Dexter\nDe-Dexter\nI be in the lab like Dexter, Dexter\nI be in the lab like Dexter\nI be in the lab\nI, I be in the lab\nI, I be in the lab like Dexter\nI be in the lab like Dexter\nIn the, in the lab\nIn the lab like Dexter, De-Dexter\n\n[Outro: Dexter's Labratory]\nNow do you understand?\nThat by combining the positive and negative polarities of sucrose and radium...\nWe can excrete the elements from any variety of [?]\nAnd unificate them with the superlative percussions of the magnetic osprium\nThusly, this machine should not be used by a person of lower intelligence such as...\nGiggles\nUgh, you're not listening to me\nPay attention!"}]}