{"artist": "Andre Nickatina", "songs": [{"title": "Nickatina Says", "album": "Daiquiri Factory: Cocaine Raps, Vol. 2", "year": "2000-06-06", "image": "https://images.genius.com/938e1205f8900a38bea9cfb2f96124ae.220x220x1.jpg", "lyrics": "[Intro]\nNickatina says cast your votes\nTell all the freaks, yeah grab your coats\nTell all the nerds, yeah take some notes\nAnd R&B niggas, ya'll clear your throats\nNickatina been at since 11\nGot me a house up in gang bang heaven\nMy mother use to say that I was like a little reverend\nThat's why they call me God # 7\n\n[Verse 1]\nI like birds cause I'm a hawk\nTry to clown me ho and I'mma walk\nRockin' your party is my favorite part\nDid it for an hour and I didn't even talk (bitch)\nNickatina is like simon says\nDips in his whip like simon says\nMake a few chips like simon says\nSmoke a little weed in the back with the dreads (yo)\nI take pride in smelling fly\nBaby ain't no telling why I blaze\nI sport Chuck Taylors twice a week\nGotta keep an ear out on the streets\nMan I'm kinda high, you said, who got beef?\nNigga take advice from these nasty freaks (yeah)\nDid you see the cold steel?\nHomey that shit'll make you cold for real\nEven though it's hot when its bout to hit\nHot enough to make a bastard do a flip\nWhat you know about ghetto cheese?\nAll she heard on the phone was \"nigga please\" (click)\nI'm like an ice cream truck\nVeins get cold when I cut this blunt\nNothing but fire tiga in my path\nAnd nah man you can't have no autograph\n\n[Hook x2]\nNickatina been at since 11\nGot me a house up in gang bang heaven\nMy mother use to say that I was like a little reverend\nThat's why they call me God # 7\n\n[Verse 2]\nNickatina says bust back first\nAnd by any means necessary don't get hurt\nThe five millimeter go good with the nina\nJust like raps go good with Nickatina\nNickatina says lace your boots\nReal drug style Armani suits\nCheck this out baby, I'ma tell the truth\nYou'se a freak and not that cute, ho\nI kick back like expensive wine, spit paragraphs all the test of time\nIt's just like ya found a treasure chest with mines\nJust like ya found a treasure chest with mines, nigga\nAndre is like the moon\nCome out after six tiga ready to boom (move)\nIt ain't no thang to me\nEasy as pie, can you hang with me (fast)\nI mix it up like rum Barcardi\nTalk and walk and smoke weed at the party\nGamble on yourself for about two g''s\nIm eating water melon way juicy, fuck it\nCheck it out I get blunted on top\nLiving like an anvil ready to drop (playa)\n\n[Hook ]\nNickatina been at since 11\nGot me a house up in gang bang heaven\nMy mother use to say that I was like a little reverend\nThat's why they call me God # 7"}]}