{"songs": [{"year": null, "image": "https://images.genius.com/cc562c0aa5b047df2132b1557d8efb9a.464x464x1.jpg", "title": "The Professional", "album": null, "lyrics": "[Intro: Mickey - Rocky III]\nThis guy'll kill ya to death inside o' three rounds!\nThis guy, is a wrecking machine! (Uh-huh)\nAnd he's hungry...(Uh, Uh)\n\n[Verse]\nHumour! These niggas makin' me laugh\nA natural born hustler, got to make that cash\nA natural born fe', she gotta shake that ass\nAnybody tryna eat, they gotta break that fast\nMillion crabs in the barrel, wanna make they splash\nThe quick run fast, nice niggas finishin' last\nIt don't matter, yo, the speakers, or the hammers could blast\nI handle yo' ass, you slippin', I'ma take yo' stash\nIt's BLACK INK! What you think? Is you ignorant, or what?\nLife's a bitch, I'll tell you when I'm finished wit' this much [?]\nSmoke toke, and power-broke, and brothers syndicated up\nSee them spinnin' satellite dishes, that's sittin' on the truck\nNah, we'll drive fast, to your lip or your jaw\nLady hittin' me wit' the number, like' 'Gimme a call,'\nI ain't doin' no graffiti, but I'm quick on the draw\nPaint a picture of a pistol, while I'm kickin' your door\nGet on the floor, and I don't mean the 'Dancin' Type'\nWit' all the DJ's, and the bar, and fancy lights\nI'm talkin' 'bout them rats and roaches, and some mice\nCement floor, you left [?], for the rest of your life\n'Cause you's a amateur, done rappin' a professional mic\nWho need to get his chin slapped wit' a professional pipe\nWah![?] But then the cops, they wanna cuff my wrist\nThat's not my twist, I'd rather blow the spot like this\nI'm at a table with five chicks, that's not my bitch\nStupid niggas, tryna figure, \"How he got my bit...?\"\nBecause, I lay the law, hem it up, stitch by stitch\nPlay tough, and I'mma cut you, like you a sandwich\nI'm just a calm, nonchalant, not-givin'-a-fuck type\nAnd you all uptight, and you can't fuck right\nAnd still you want a lady, who just can't get enough, right?\nWell, that's the reason that she wit' us, a'ight!\nGimme a light, for this spliff, o' hypnochrish [?] I'm holdin'\nBig, wheels, I'm rollin', bigger bills I'm foldin'\nCash flow controllin', account's gone swollen\nOne ounce on purple, another couple on golden\nTwisted, I bake the whole projects biscuits\nThis kid is a, trend setter, ya'll just misfits\nWillie Gank, I been better, y'all just begginin' shit\nNow this a life-or-death, predicament, I step in wit'\nA vendetta, then start spittin' shit, this big game [?], that's ridiculous\nYa motherfucker's insignificant, I'm .357 magnificent\nStay playin' where them bad bitches, is\nYou feelin' me, man\nYou know y'all niggas ain't stoppin' a thang\nRolled on, see, I been up on top o' my game\nYo, dawg, see I'm never gonna change my name\nYou better, park your brakes, or change your lane\nBecause, fam', you know they fin' lift the semi-automatic ban\nThey fin' to have them in the ghetto, goin' at it, man\nThey bring it to your block, and have it like Pakistan\nPhilly Boys, makin' noise, clingin' like static, an'\nThem young cannons, even jump out vans\nLeave you laid out, stiffer than the mannequin stands\nYou get, sprayed out,  clapped with mechanical hands\nThat kick back, 'cause you and your mansa\nGet zapped, just keep, thinkin' o' Inks, the people's enjoyin' it\nI, cold-blooded, kill shit, keep on doin' it\n'Cause, that's my pleasure, is the people's enjoyment\nGangsters, holla at me, if you seekin' employment\nSure, kid, that's only if you willin' to learn\n'Cause it's a hard grind, but it got a heavy return\nI seen some hard times, now I got cheddar to burn\nBut still, got mo' cheddar to earn, it's Black Ink, nigga!"}], "artist": "Black Thought"}