{"songs": [{"year": null, "album": "The Dusty Foot Philosopher", "image": "https://images.genius.com/0939cced5a2b8162cd5d38cb17171350.640x640x1.jpg", "title": "Voices In My Head", "lyrics": "Eh yo, welcome to my world, please listen\nHEY!\n\n[Hook:]\nPoison in my veins, inside I'm torturing my brains\nAnd still I try, aiaiai\nVoices in my head, am I alive or am I dead\nAlone I cry, aiaiaiai\n\n[Verse 1:]\nConsider configure The shit that I'm in and the pain, I'm literally going insane\nI'm frightened, my heart and my head have been fightin\nI'm certain that it's hurtin the rest of my body\nThem voices as loud as Manhattan come chattin\nThey say \"Who met us and let us in?\" and you kno you better than al of these replicates screamin they represent\nC'mon man c'mon man\nAnd the people inside me say they wanna see me go on tragically\nAnd it's evil, cause I'm only 20 something working for a crumbs n some bread\n\n[Hook]\n\n[Verse 2:]\nThe harder the struggle the deeper the trouble\nCome out of the bubble, I'll teach you to cuddle\nWith demons inside me, what demon is not me\nThese demons inside me they got me, they stop me from sleepin\nAnd eatin and keepin it even, and even my reason for breathin this season\nSleetin in a danger, my nose when I'm readin, it's bleedin on paper\nIt's bleedin on paper\nAnd I'm tired of this violence, so tortured inside? ain't akward and overly open inside, have I already died\nHas mom already cried? And why do I feel like I'm over this life\nI'm not hateful, I'm grateful, my girlfriend is tasteful, livin it up\nI might even blow, like a leak in a truck, with a torch and a clutch\nAnd explosion that leaves a whole coughin off dust, and the people\nInside me saying, they wanna see me go tragically\nAnd it's evil, cause I'm only twenty something, working for some crumbs and some bread\n\n[Hook]\n\n[Verse 3:]\nI'm still awake, and it's quarter to six\nI'm trying to write and I ain't thought of no shit\nI live with guilt like I slaughtered the sick\nI live with shame, like my daughter a bitch\nI don't make living but I still persist, I could sell out but I still resist\nSo don't tell me about no pain and shit\nI was born and raised in poverty bitch\nAnd I smile all the while and don't complain\nI'm something like Gil Scott heroine\nDo you know what it feels like to lose a friend, again and again and again, again\nThe bitterness in the killer the poet, the river of blood within the mess flowin\nI'm the bitterness in the killer the poet, the river of the blood will keep on flowin\nPeople inside me say, the wanna see me go on tragically\nAnd it's evil, it's evil, cause I'm only twenty something working for a crumb or some bread or nothin\n\n[Hook: until end]"}], "artist": "K’naan"}