{"songs": [{"image": "https://images.genius.com/bd05a72ae55bef17a41ab12e62da6d6e.1000x1000x1.jpg", "title": "Good Form (Remix)", "album": "Queen (Deluxe)", "year": "2018-11-29", "lyrics": "[Intro: Nicki Minaj]\nEardrummers\nMhm, Young Money, uh huh, mhm\nYo, hold up, hold up, mhm\nMhm, mhm, mhm, mhm\n\n[Verse 1: Nicki Minaj]\nYo, hold up, hold up, hold up, okay, hold up\nYou see a bad bitch coming through, yo, what's the hold up?\nI'm in that new new, me and New New when I roll up\nI tell the valet, \"Park my Benz and bring the Rolls up\"\nYo, hold up, hold up, hold up, okay, hold up\nHe see me lookin' pretty every time he scroll up\nMight gotta let the blicky hit you if you stroll up\nNow put your hands up, it's a hold up\nRun me the money (Go!)\n\n[Refrain: Nicki Minaj]\n'Cause I be the baddie B, Barbie tings, banging body B (Go!)\nEverybody be on my D, yo, I gotta be (Go!) in reality\nSuck a D if you doubted me\nBack of the 'Bach, back of the 'Bach\nBack of the 'Bach, back of the 'Bach (Woo!)\nWho on Barbie D? Who on Barbie D? Everybody (Go!)\nOoh, you gotta see, honestly, on my odyssey (Go!)\nI'm the baddest B, I don't even know how to speak\nHat to the, hat to the back and relax, you in the back of the 'Bach\n(Come on!)\n\n[Pre-Chorus: Nicki Minaj]\nSee, a bitch got more coins than a game room\nSo we ain't ever hatin' in TheShadeRoom\nSee, I keep my sons in a playroom\nSo me and you ain't ever in the same room\n\n[Chorus: Nicki Minaj]\nI tell him eat the cookie 'cause it's good for him\nAnd when he eat the cookie he got good form\nHe know I don't never cheat because I'm good to him\nMight gotta have his baby, nurses yellin' \"push\" for him\nYou see I let him eat the cookie 'cause it's good for him\nAnd whenever he eat the cookie he got good form\nHe know that when I'm pullin' up, I'm in a good foreign\nI be like, ooh, he love me, ooh, he love me, good for him\nCome on, come on, come on\nI be like ooh, he love me, ooh, he love me, good for him\nCome on\n\n[Verse 2: Nicki Minaj]\nI slick, slick drop the top like nip slips\nSo he tryna smash like when the whip flips\nI hit licks just to floss with this wrist\nAnd when I leave my bitches, we all say, \"Kiss, kiss\"\nI'm in that new new De La Renta, channeling Bugs Bunny\n'Cause all I want is karats and some big drug money\nI'm only loyal to the niggas that'll bust guns for me\nThe jig up, it's a stick up, run me the money (Go!)\n\n[Refrain: Nicki Minaj]\n'Cause I be the baddie B, Barbie tings, banging body B (Go!)\nEverybody be on my D, yo, I gotta be (Go!) in reality\nSuck a D if you doubted me\nBack of the 'Bach, back of the 'Bach\nBack of the 'Bach, back of the 'Bach (Woo!)\nWho on Barbie D? Who on Barbie D? Everybody (Go!)\nOoh, you gotta see, honestly, on my odyssey (Go!)\nI'm the baddest B, I don't even know how to speak\nHat to the, hat to the back and relax, you in the back of the 'Bach\n(Come on!)\n\n[Pre-Chorus: Nicki Minaj]\nSee, a bitch get more press than a keypad\nBefore you suck me off, get a knee pad\nSee, I pull the strings like a tea bag\nI'm prolly with my jeweler playin' freeze tag\n\n[Chorus: Nicki Minaj]\nI tell him eat the cookie 'cause it's good for him\nAnd when he eat the cookie, he got good form\nHe know I don't never cheat because I'm good to him\nMight gotta have his baby, nurses yellin' \"push\" for him\nYou see I let him eat the cookie 'cause it's good for him\nAnd whenever he eat the cookie, he got good form\nHe know that when I'm pullin' up, I'm in a good foreign\nI be like ooh, he love me, ooh, he love me, good for him\nCome on, come on, come on\nI be like ooh, he love me, ooh, he love me, good for him\nCome on\n\n[Verse 3: Lil Wayne & Nicki Minaj]\nBarbie, (Yes?) I think you gnarly (Ooh)\nI think you fly, these other bitches just larvae (Haha)\nWhen you make that ass jump like my heartbeat\nAnd if you let me eat the pussy, then it's shark week\n\"Hello, may I speak to Tunechi?\" May I ask who's callin'?\nEverybody got the juice without a glass to pour it\nI want my cake and eat it, too, and after that, I'm starving\nI feel like Adam, but I'm 'bout to eat a apple on you, uh\nRollie on the right side, now y'all on my time\nPlease get off my dick before it turn into a pipe bomb\nEyes lookin' like I'm somewhere outta Taiwan\nFaded as fuck as always, hi mom\nLook dude, I'll stomp your ass out in my good shoes\nBe my foot stool\nTold my lawyer don't call me 'less it's good news\nThen my phone started ringing off the hook, snooze, brrr\n\n[Outro: Nicki Minaj & Lil Wayne]\n'Cause I be the baddie, B\nYoung Money, it's a army\nHe ain't into toys, but he fuck with the Barbie\nIt's the president, Monica what they call me\nNicki the ninja, Nicki the boss, Nicki the harajuku, ah\nRemix, baby\nMula\nYeah, yeah, yeah"}], "artist": "Nicki Minaj"}