{"songs": [{"year": null, "image": "https://images.genius.com/1c6f996c565bb953458c87d40333434d.700x700x1.jpg", "title": "Who? (Got My Back)", "album": "Never Say Die", "lyrics": "Uh uh, uh uh\nWhere the real niggas at ?\nWhat? Who got my back ?\n\n[Verse 1]\nAnd who will be ready for war at all costs\nPosition themselves to take the fake heads off\nAnd who will really cock their weapon\nNot their mouth when it's time for you and your team to go all out\nAnd who in the face of danger keeps quiet\nNever snitch, never give up your mans and them for shit\nAnd who will rock my product like kane ?\nPush that shit like rocks to the top of the game\nIs it you? And who got my back like a cape?\nSo I can be a superhero, get more money like De Niro\nAnd who will never sell their soul\nOr their asshole for the dollar if you feelin' me niggas\nThen holla and who sees this shit through veteran eyes\nAnd for hip-hop to be more than Ready To Die\nSurprise it's not many, real niggas left my mind's\nDesigned to get while you step in facts\n\n[Hook]\nAnd who's gonna get my back? Oh!\nAnd who's gonna bust their gat, for me?\nAnd who's gonna feel like I feel, keepin' it real like gangstas do, who?\n\n[Verse 2]\nAnd who's gonna support their seeds\nBe a father to their child\nAnd still live Big Willy Style\nAnd who's gonna walk their dogs till their tongues hang out\nTill world wide your joints bang out\nAnd who's gonna keep the faith in ya niggas\nNot get gassed and caught up with the silly gold diggers\nAnd who will never hate, never be an ingrate\nNever whine or cry whether free or upstate\nAnd who on steroids all muscled up\nWon't rub us the wrong way and get their ass fucked up\nAnd who will write their own rhyme\nTime after time, hot shit that leaves the comp' dumb and blind\nIf it's you then you came to the right place\nAnd if it's not you get smashed with a brick in the face\n\n[Hook]\nAnd who gonna get my back, who?\nAnd who gonna bust their gat, who?\nAnd who gonna feel like I feel, keepin' it real, like gangstas do, who?\n\nAnd ... gonna get my back, who?\nAnd ... gonna bust their gat, who?\nAnd who gonna feel like I feel, keepin' it real, like gangstas do, who?\n\nAnd who gonna get my back, who?\nAnd ... gonna busts their gat, who?\nAnd who gonna feel like I feel, keepin' it real, like gangstas do, who?\n\nWho got me, who?\nWho got me?"}], "artist": "Big Shug"}