{"artist": "Boondox", "songs": [{"album": "Krimson Creek", "title": "Cold Cruel World", "year": "2008-05-13", "lyrics": "[Intro]\nI don't know what to do anymore\nAfter I quit with medicine I became psycotic\nI suffer from depression\nComplete depression\nHad it my whole life\nI have had it so bad that uh...\nI had anxiety\nBeen diagnosed with major depression\nLots of phobias, lots of fears\nAnxiety, panic attacks\nManic depression before, I didn't think that\nDepression could be so bad\n\n[Verse 1]\nSometimes it feels like the world's on my shoulders\nEverything around me closing in, it's starts to grow colder\nIt's like I'm sitting on death row and waitin' for conclusion\nShits real fucked up, my brains filled with much confusion\nDo you know what it is to sit a 3am\nWith a gun pressed to your temple on your knees prayin'\nOr in the bathroom, on the floor, a handfull of pills\nCause the fuckin' rent's due and you can't pay bills\nHave you ever felt the cold grip of death in your heart\nI'm talkin' rips right in your cavity and pulls it apart\nTen motherfuckin' seconds just from ending this shit\nFlames rising from the ashes that your about to commit\nHave you ever stopped your car somewhere far from everythin'\nSat a half an hour, just thinkin' of a better way\nTo put your soul to rest and set your mind at ease\nPut the barrel in my mouth, I wanna sleep for all eternity\n\n[Hook]\nDear cold cruel world why am I here?\nI never asked to be alive\nEveryday it's just a struggle even to survive\nDear please juse wipe away the tears\nI'll be better off when I'm gone\nIn my own private Hell and left all alone\n\n[Verse 2]\nSo many reasons just to leave this fuckin' planet\nPressure gets to me so much, god damn, I just can't stand it\nPeople hatin', credit problems, bitch be fuckin' my friends\nA million reasons, circumstances for your soul to transcend\nNobody like me, I'm a loser, parents wish I was dead\nI'm overweight, can't get a date, I'll turn my walls to red\nI lock the door, turn up the music, flip the T.V. screen\nI'll leave a bloody fuckin' mess off for my moms to clean\nIt's's to the point that I can't stand it, I can't even try to cope\nAnd you don't know me, you can't help me, you can't offer me no hope\nIt's too late to try and stop it, I have lost the fuckin' war\nI ain't gonna write no fuckin' letter, leave my answers on the floor\nI'm a do it I swear, don't even think I'm lyin'\nNobody gone remember me, nobody gone be cryin'\nAll alone in my death like I was in life\nLet me take my final breath, they can bury me tonight\n\n[Hook]\n\n[Bridge]\nYou won't miss me when I'm gone\n(Flames risin', flames risin')\nI know you did me so wrong\n(Flames risin')\n\n[Hook/Outro:]\nDear cold cruel world why am I here?\nFlames risin', flames risin'\nDear please juse wipe away the tears\nFlames risin', flames risin'\nDear cold cruel world why am I here?\n(just wipe away, just wipe away)\nFlames risin', flames risin'\nDear please juse wipe away the tears\n(just wipe away, just wipe away)\nFlames risin', flames risin'\nDear cold cruel world why am I here?\nFlames risin', flames risin'\nDear please juse wipe away the tears\nFlames risin', flames risin'", "image": "https://images.genius.com/880085d49aff9217e77dc1187f030306.500x500x1.jpg"}]}