{"artist": "Apathy", "songs": [{"title": "Chrome Depot Freestyle (Blade mix)", "image": "https://images.genius.com/01f7607656537e2a3d4e1323e42e51b0.1000x1000x1.jpg", "album": null, "lyrics": "[Verse 1 - Apathy]\nYo\nI got the force that could knock a Sumo wrestler down\nProfessional sound that's puttin' rappers flesh in the ground\nScared of a candid-cameras for plantin' a bomb\nBut takin' shots with mechanical cannons in my arm\nA verbal-tech battle mech ready to flex\nYou step to me next you get metal machete's to necks\nThen I slice jugular veins, crushin' your frame\n'Till the pressure from the skull plates bustin' your brain\nI'm the type to spit and make you say \"that's fuckin' insane\"\nAnd when your not payin' attention, I'll be touchin' your dame\nI could make your whole squads frames bust in to flames\nSo why you speak on my name? you got nothin' to gain\nExcept two black eyes, a broke jaw, and a broke nose\nI hope foes know I got nothin' but dope flows\nI'm spittin' perfectly verbally\nAp's eternally as intricate as surgery or fixin' broken circuitry\n\n[Chorus]\nIt's like boom bap, fuck your rap\nYou ain't ready for Celph and you ain't ready for Ap\nIt goes boom bap, fuck your rap\n'Cause you might get smacked with the back of the gat\n\n[Verse 2 - Celph Titled]\nYo everybody on the wall get the fuck out yo position\nAnd focus on the God with the raw power of six men\nLook me in the phone book, my math be unlisted\nGot top secret formulas with 7th wonders orbit systems\nYou know the signature, the Celph titled literature\nGet intricate with flows and carry mechanisms to spit at cha\nWho want what? I sell beats for G-notes\nPut three in your fleece coat and tie your neck to a ski-boat\nYou know I make the heat disasterly spill\nAnd let the chrome sparkle like Master P's grille\nNigga's say godammit he's ill why ain't he blow yet?\nI came before Christ, hip hop wasn't even known yet\nThe only time you catch me holdin' my tongue\nIs if I cut it off and gripped it and spit more linguistics\nBeyond long distance, dial the chrome for assistance\nAnd use my sharp looks to bag hundreds of bitches\nSelf-pachino, you know the name from the beat down\nAmputate my arms and I still won't put the heat down\nThis is prophecy, don't make me repeat this\nPut a magnet to your data and leave your files deleted\nMotherfucker!\n\n[Chorus] x 2", "year": null}]}