{"artist": "Vado", "songs": [{"title": "Stop Being Greedy (Freestyle)", "year": "2014-01-11", "lyrics": "(Intro)\nVado!\nAce Hood!\nWe better than them!\nWe da best!\n\n(Verse: Vado)\nI let the AK go at yo 88 door\nHit yo playmate hoe, ticket day they roll\nI don’t talk, if it’s war nigga say no more\nAsk Papi, I bought em all so it ain’t no mo\nYo! I’m forever paid, more gators than Everglades\nTailor made, cut spinnin, you see every wave\nMargielas laced, vanilla wraith\nCopped the penthouse, Central Park west, Costello’s place (frank!)\nYea, that’s hella cake, I’m hella up\nGold yellow dub, high in the 7 like Melo dunks (yess)\nYes, firin a weapon, you better duck\nSittin poolside in a mink tank and leather trunks (FUCK 'EM)\nJust cus, fuckin just does\n3 quarter furs unbutton for just hugs\nShow the Cuban links like it’s nothing, we just thugs\nRemember when I used to be pumpin with just dubs\nRunnin with just drugs, Marion Jones it\nCan checkers respect us cus we carryin nosy\nTired of spittin on records how I’m better than those men\nSmoke cigars with plackers like I’m next for the chosin (HUH!)\n2M just on a wristwatch\nWhere I’m from, who them? They get this shit rocked\nCrimesquare do them, that was the brick block\nLynch mob, loose ends and Charlie crib’s pops (SLIME)\nYea, man down for 10th Ave\nThomas crowned in a new S, the 6 pound (mean)\nJewish E just be the charger, mistrial\nMy mind go far when I write like pen pal (BLAO)/(HUH!)\nIt’s my turn, if I die the sky burn\nPop slime girl from the roof like how I learn\nUsed to be in school counting loot like why I learn?\nHeadshots, blood down yo face like side burn\nYoung walkin targets, set to clip yo apartment\nRip the plastic so yo couch shoves on yo carpet\nInfrared between beds like where your moms be\nGot my man and valet handling parking\nAnd next lamas checks commas\nFew things that came with that we the best bomber\nTwo things remain, that’s respect, honor\nSpit flames and chew names like Jeff Dahmer\n\n(Verse: Ace Hood)\nI’m next level, don’t sweat em\nI’m mo better, my flow is a trend setter\nSee most you niggas faker than Pac at the Coachella\nI’m king of the south, you king like coretta\nWith suicide bars, you jokers are Heath Ledger\nThey hear the name Ace, is fearin them 3 letters\nI’m too clever, you knew better, you do better\nCan see the boy never in neckle whomever\nI’m still focused, my eyes opened, I’m God chosen\nI’m so reloaded, the city better but I ain’t noticed\nI’m in a Lotus, you see me rollin, just blowin tottin\nA 9 mm, can see that you wanna meet it\nA couple Jesus pieces to keep away from the demons\nAnd Shawty suck it slow, when I’m comin just touch the semen\nAnd fuck them niggas like Cam, I really mean it\nI only know it’s murder, you must’ve got amnesia\nI’m a beast motherfucker, you read it and weep\nStill hatin on the truth, I hope you die in yo sleep\nWe the best in my blood, ain’t no sympathy seen\nYea you know who the team, you still chasin the dream\nI’ve been hot for a minute like I was wanted for killin\nBetter pay some attention, I go for Elliot Wilson\nThere’s a bomb in yo lobby, sorry you cannot defend it\nI’ve been tickin and can’t pretend if you like what you hearin\nFuck that! See I’m out of my mind, I’m on Columbine\nI wanna take the spot of the people I idolize\nBefore I ever die I’m the realest, it’s finalized\nMy niggas go to war, then I’m wit it, I gotta ride\nWhere’s Funk Master Flex? Gon drop the bomb\nI’m a young legend, give it to em raw\nRap game mine, that was for the blogs\nMe and Vado ridin, yea we tryna kill em all\nYou don’t wanna see a pitbull pissed off\nHave yo whole town out morning yo loss\nSnitch niggas get it, dog that should be law\nHave em catchin bullets like he fuckin Randy Moss\nTryna get peace, I don’t even sleep\nYou’ll get the picture on Starvation 3 nigga\nJanuary 17th ah\nMotherfucker\n\n(Outro: Ace Hood)\nSee I did this shit for fun nigga\nDid this shit cus I was bored\nAin’t nothing harder than what we doin nigga\nAce motherfuckin Hood bruh\nVado, wuddup nigga\nWe the mothafuckin best ah!\nCali\nWhat’s happenin bruh?\nYall hear that motherfuckin beast comin through the headphones, ah?\nFunk Flex wuddup?", "album": null, "image": "https://images.genius.com/e2d9824f3848684bc687e9cad8889c34.687x595x1.jpg"}]}