{"songs": [{"year": "2005-08-30", "album": "Late Registration", "image": "https://images.genius.com/20be4a5ccc57daf3577b7e0d12f092f8.1000x1000x1.jpg", "title": "Bring Me Down", "lyrics": "[Produced by Kanye West and Jon Brion]\n\n[Hook: Brandy]\nI always knew that one day, they'd try to bring me down\nWay down, way down\nOne day, they'd tried to bring me down\nAlways knew that one day, they'd try to bring me down\nWay down, they'd try to bring me down\n\n[Verse: Kanye West]\nWe gon' to Mass today, we have to pray\nBesides what the pastor say, I have to say\nSince Pac passed away\nMost you rappers don't even deserve a track from me\nYou see, if you ever wanted to ever be anything\nThere'd always be somebody that shoot down any dream\nThere'll always be haters, that's the way it is\nHater niggas marry hater bitches and have hater kids\nBut they gon' have to take my life 'fore they take my drive\n'Cause when I was barely livin', that's what kept me alive\nJust the thought that maybe it could be better than what we at at this time\nMake it out of this grind, 'fore I'm out of my mind\nAnd get some leeway on the he say she say\nYour girl don't like me, how long has she been gay?\nSpanish girls say \"Yo, no hablo inglés\"\nAnd everybody want to run to me for their single\nIt's funny how these wack niggas need my help\nWasn't around when I couldn't feed myself\nDawg, if I was you, I wouldn't feel myself\nDawg, if I was you, I'd kill myself\nMade a mil' myself and I'm still myself\nAnd I'mma look in the mirror if I need some help\nNow I'll speak from the heart, y'all all frontin'\nEverybody feel a way about K but at least y'all feel something\n\n[Bridge: Brandy]\nWhat you calling?\nI let all in for getting what some get will get ya\nWhat kind of dream we found?\nSee, I'm often catching crosswinds\nForgetting where the hell I met you\nAnd try to bring me down\n\n[Hook: Brandy]\nI always knew that one day, they'd try to bring me down\nWay down, way down\nOne day, they'd tried to bring me down\nAlways knew that one day, they'd try to bring me down\nWay down, they'd try to bring me down"}], "artist": "Kanye West"}