{"songs": [{"lyrics": "[Intro]\n\"JAY-Z this,\" \"JAY-Z that.\"\n(\"JAY-Z won't hold my hand no more.\")\n\"JAY-Z this,\" \"JAY-Z that.\"\n\"JAY-Z that,\" \"JAY-Z this.\"\n(\"JAY-Z won't give me no money.\")\nGet off JAY-Z' dick!\nWhat, y'all niggas get front page articles?\nY'all mention JAY-Z name?\n(This thing on?) JAY-Z, JAY-Z\n(Check) In JAY-Z news\nI understand what y'all tryin' to do\nI brought the flutes this time, though (Check)\nUnleash the flutes on 'em, Guru\nGive me some more music in the headphone\nLet's get to the proceedings preceding this evening\nLet's do this thing (let's do it right this time)\nC'mon!\n\n[Verse 1]\nH-O-V-A\nI got my mojo back, baby, oh behave\nNaw, naw, don't be afraid\nY'all and your articles hock spit at Jay\nY'all from afar threw darts my way\nWhat you thought, I would not have nothin' to say? Nope!\nY'all fell into the booby trap\nI set the trap just to see dude react, and now\nAnd now you's can't leave\nYou opened the door, God, I'm at you annually\nAnd I'm sorry Miss Rosie Perez\nI call a spade a spade, it just is what it is\nBut you can't give cred to anything dude says\nSame dude to give you ice and you owe him some head\nShorty, it's time to wake up the dead\nYou sound a little naive in them articles that I read\n\n[Chorus]\nH-O-V-A\nThe Blueprint 2, baby, on the way\nH-O-V-A\nI got my mojo back, baby, oh behave\nH-O-V-A\nThe Blueprint 2, baby, on the way\nH-O-V-A\nI got my mojo back, baby, oh behave\n\n[Verse 2]\nCan't y'all see that he's fake, the rap version of T.D. Jakes\nProphesizin' on your CD's and tapes\nWon't break you a crumb of the little bit that he makes\nAnd this is with whom you want to place your faith?\nI put dollars on mine, ask Columbine\nWhen the Twin Towers dropped, I was the first in line (It's real)\nDonatin' proceeds off every ticket sold\nWhen I was out on the road, that's how you judge Hov, no?\nAin't I supposed to be absorbed in myself?\nEvery time there's a tragedy, I'm the first one to help\nThey call me this misogynist\nBut they don't call me the dude to take his dollars to give gifts at the projects\nThese dudes is all politics, depositin' checks\nThey put in they pocket, all you get in return is a lot of lip (Yap, yap, yap)\nAnd y'all buy the shit, caught up in the hype\n'Cause the nigga wear a kufi, it don't mean that he bright\n'Cause you don't understand him, it don't mean that he nice\nIt just means you don't understand all the bullshit that he write (The fuck is you sayin'?)\nIs it Oochie Wally Wally or is it One Mic?\nIs it Black Girl Lost or shorty owe you for ice?\nI've been real all my life, they confuse it with conceit\nSince I will not lose, they try to help him cheat\nBut I will not lose, for even in defeat\nThere's a valuable lesson learned, so it evens up for me\nWhen the grass is cut, the snakes will show\nI gotta thank the little homie Nas for that, though (Ha ha)\nSavin' me the hassle of speakin' to half of these assholes\nAnd I'ma let karma catch up to Jaz-O, whoa\nI'm back before you had a chance to miss me\nMy mama can't save you this time, niggas is history\nWho you know flow vicious as me?\nYet so religiously, that's why they call me Hov'\nI get the spoils 'cause the victor is me (Me, nigga!)\nYou're an actor, you're not who you're depicted to be\nYou street dreamin', all y'all niggas livin' through me\nI gave you life when niggas was forgettin' you emcee\nI'm a legend, you should take a picture with me\nYou should be happy to be in my presence, I should charge you a fee\nI'm Big Dog, Glenn Rob – listen, God, you a flea\nAnd the little homie Jungle is a garden to me\nWhat's the problem, B? You not as hard as me, nigga\nHard as we, nigga, R-O-C, nigga\nThat's why they follow me\nThey feel my pain and my agony, nigga\nI won't rest 'til you on one knee\nYou want war, then this war's gon' be, nigga\nUntil you on one knee\nYou want war, then this war's gon' be, nigga\n\n[Chorus]\nH-O-V-A\nThe Blueprint 2, baby, on the way\nH-O-V-A\nI got my mojo back, baby, oh behave\nH-O-V-A\nThe Blueprint 2, baby, on the way\nH-O-V-A\nI got my mojo back, baby, oh behave", "title": "Blueprint²", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}