{"songs": [{"title": "Behold a Lady", "album": "The Love Below", "year": "2003-09-23", "image": "https://images.genius.com/9c95e6c91deee00543064991b835ada0.999x999x1.jpg", "lyrics": "[Intro: André 3000]\nSophistafunk, aristocats\nDistinguished dogs, clean up your acts\nPull up your pants, ladies and gents\nPlease, act like you got some sense\nYou know what I really wanna know?\nWhere do all the good girls go?\nWhat clubs they hang at?\n\n[Chorus: André 3000]\nBehold\nA lady\nI see you standing on the wall\nClap, clap, you deserve it all\nBehold (Candy-coated unicorns are)\nA lady (Quite hard to find)\nI see you standing on the wall\n(The classic lady, a rare breed indeed)\nClap, clap, you deserve it all\n(Is that make and model discontinued?)\n\n[Verse 1: André 3000]\nToday, I might snow, tomorrow, I'll rain\n3000's always changing but you stay the same\nAnd I need that\nHey, I need that (in my life)\nWhen I feel washed up and inadequate\nAnd throw all my songs away, no matter how mad I get\nYou make me smile, you make me smile\nYou make me smile, you make me (Oh)\nYou're the anchor that holds me down\nWhen my ship is sinking, you won't let me drown\nAnd I'm grateful (Oh, oh-oh-oh, oh-oh, oh-oh)\n\n[Chorus: André 3000]\nBehold (Maybe they disappeared with the dinosaurs?)\nA lady (Oh, but that's such a Big Bang Theory)\nI see you standing on the wall (Maybe they're still around?)\nClap, clap, you deserve it all\n(But only to be seen with appreciative eyes)\nBehold (Maybe they were taken for granted?)\nA lady (And lost all their magic)\nI see you standing on the wall (Oh, how awful)\nClap, clap, you deserve it all (Oh, so tragic)\n\n[Verse 2: André 3000]\nYo mama's old fashioned, yo daddy don't play\nYou'll always be this lovely 'cause they raised you that way\nHallelujah! Thank ya, Jesus! Thank ya, Lord!\nThank ya, Jesus! Thank ya, Lord!\nThank ya, Jesus! Thank ya, Lord!\nYou're not extra extra, you're so plain Jane\nThe ying to my yang, darlin', you've got that thang\nAnd you know it, but yet you don't\nBut yet you don't and that's what's so cool\nYou don't say too much, but when you do, it's profound\nIn the street, you hold your head high\nAt home, you get low down for me\n(Can't get no lower, can't get no lower, can't get no lower, yeah)\nOh, you're the anchor that holds me down\nWhen my ship is sinking, you won't let me drown, ah-ah-ah-ah\nSad, but one day our kids will have to visit museums\nTo see what a lady looks like\n\n[Chorus: André 3000]\nBehold (So if you find one, I beg you, hold her tight)\nA lady (Yes, if you spot one, good sir, treat her right)\nI see you standing on the wall (Benjamin André, signing off)\nClap, clap, you deserve it all (Thanks a million)\n(Good luck and goodnight)\nBehold\nA lady\nI see you standing on the wall\nClap, clap, you deserve it all\nBehold\nA lady\nI see you standing on the wall\nClap, clap, you deserve it all\nBehold\nA lady\nI see you standing on the wall"}], "artist": "André 3000"}