{"songs": [{"album": "History in the Making", "year": null, "title": "Goonies", "image": "https://images.genius.com/4e9033767fdf16134df5cf3680daf95b.500x500x1.jpg", "lyrics": "[Hook]\nIt's the Dips, we can't fall off we are sick\nAnd keep ridin till the wheels fall off of this bitch\nSalute, Wooo Wooo, Wooo Wooo\nWooo Wooo, Wooo Wooo\nIf you get money like ain't shit funny\nAnd quick to tell a bitch she ain't getting shit from me\nHolla back, Wooo Wooo, Wooo Wooo\nWooo Wooo, Wooo Wooo\n\n[J.R. Talks]\nOk, Writer, (DipSet) Who ready?\n\n[Verse 1]\nListen, This is natural, we're not compatible\nA hustler not a rapper dude, don't make me have to clap a few\nWrap ya dude, Blat ya through\nNigga, fuck a stash box, I got a box in the stash for you\nYou ain't a Goonie, yous a Looney Tooney\nI will use this Uzi to remove ya kufi\nTroops salute me, dude ya fruity\nWho's a groupie, and lucky that my shoes are Gucci (why)\nCause I stomp creeps, I'm beyond beats\nBig war guns, check out my arm reach\nI'll get ya moms leaked (where) stretch out in Palm Beach\nIffy till I put you underground then its concrete\nYou stepping up there them hecklers'll flare\nPeter Rowe leave ya soul in a breathe full of air\nNo body better this year (why)\nI'm in the zone, and it's like you goin bald, cause you'll never get here/hair\n\n[Hook]\n\n[Jim Jones Talks]\nWooo (Jones) Wooo Wooo Wooo Wooo (Capo) (One-Eyed Willy)\n\n[Verse 2 Jim Jones]\nOne-Eyed Willy, head of the Goonie-Goo-Goos (Capo)\nI'll put paper on ya head just like a su-su\nBlowin haze in the air out the moon roof\nWhile I'm racing, switchin gears in the new coupe\nSo its nothing to 10-90\nPeter Rowe you hop in the Benz do 90\nI'll cop a new bed buck 90 (ballin)\nI'm on the block getting bent's where you find me\nI'm probably spittin out punka seeds\n40's off Autobahn tell black dump the weed (we gotta get high)\nIt's 600 for my Dungarees\nI'm on the corner getting blunted with a bunch of G's (Eastside)\nSo ya life's but a bleep away\nWell I party at night where the Heat play (down in Miami)\nUntil the cops sub do me (fuck it)\nI'm claimin DipSet ByrdGang we the Goonies (we the Goonies)\n\n[Hook]\n\n[Hell Rell Talks]\nOk, Ruger Rell DipSet, (I got us Writer) I got us, Yo\n\n[Verse 3 Hell Rell]\nI'm the shit Mr. Doodoo, I'll holla wooo wooo\nHundred niggas hop out hoodied up like boom boom\nI got Goons on the payroll shorty\nAnd I don't tough shit, they move the yayo for me (they move that shit)\nMoney machines count the pesos for me\nShit on my neck, that's Range Rove money\nMy jewelry starting to add up to cars my brother\nMagnum on one wrist, Charger on the other\nWhen I die my house gonna be a tourist attraction\nYou serious that's the same chair Hell Rell sat in (you serious)\nYou lyin, that's the same toilet Hell Rell crapped in (na you lyin)\nMink carpets and he got it from rappin, ruger double action\nYou wanna learn about some cain nigga talk to me\nYou wanna know who own the city cruise New York wit me (DipSet)\nI bring the grittiest out (yeah)\nAnd if Rell in the building all the Goonies in the city come out (yeah)\n\n[Hook]"}], "artist": "J.R. Writer"}