{"songs": [{"year": null, "image": "https://images.genius.com/15a6f267cd4cff3d055d74576b9029ee.500x500x1.jpg", "title": "Adidas 1's In Da Club", "album": "See Me On Top", "lyrics": "[Intro: Big Krizz Kaliko]\nAdidas 1's in da club\n(Yea okay thug, what thug okay, okay)\nAdidas 1's in da club\n(Okay, okay thug what, what)\n\n[Hook: Big Krizz Kaliko]\nAdidas 1's in da club\nAdidas 1's in da club\nWho woulda thought I'd have to pop a trunk\nWho woulda thought I'd have to pop a trunk\nAdidas 1's in da club\nAdidas 1's in da club\nWho woulda thought I'd have to pop a trunk\nWho woulda thought I'd have to pop a trunk\n\n[Verse 1: Big KRIT]\nAir Force 1's on my feet\nI ride a Chevy (?) the freaks\nYo I can't stop stop cause my clique still with me\nLife is twirl my rims is still spinning\nIncrease my goal and pop my collar\nBad bitches talking in the club with they Prada\nOpen my trunk with a lame if I gotta\nShow em how quickly a comedy turn to drama\nBlaze dead bull for saying shit outta line\nSomething like (?) a lame get outta time\n(?) pop some pills to power up\nDon't [?] I used to buy them shells when I (?)\nI bust, boy you talkin' shit then don't play around us\nMy niggas'll split your wig\nUh, uh, ya dig?\nMy crew like what it do\nAir 1's on my toes in the club when I roll through\n\n[Hook: Big Kriz Kaliko]\n\n[Verse 2: Big Kriz Kaliko]\nNow bigger straps than forces are shell-toed Adidas\nCan tell who it is by the way we rob people\nWe headed to the club to see what we can snuff out\nBut first we head to the spot so we can get totally drilled out\nThere's no doubt that the boys from down south\nTake a look at the kids they taking what I dream about, sex\nNow what you think that I came here for?\nTo buy (?) for my Adidas? No!\n(?)\n(?)\nIn the (?) of the room on the flow, in them nice kicks\nDrinking that lady pipe, don't say that you don't like this\nI see you (?), so I'm knowing that ya liked it\nNow hold up, I see some niggas gettin' (?)\nNow all my niggas right here because we (?) more than doves\nHey, Killa K bring it out because I thought that it was all up\nBut at the end of the night it seems we gotta pop the trunk\n\n[Hook: Big Kriz Kaliko]\n\n[Bridge: Big Kriz Kaliko]\nAdidas 1's in the club\nAdidas 1's, who woulda thought\nWho-who, woulda thought I'd have to pop a trunk\n\n[Hook: Big Kriz Kaliko]"}], "artist": "Big K.R.I.T."}