{"songs": [{"album": null, "image": "https://images.rapgenius.com/b47e308054ae37a97ed59f0188287ea8.1000x1000x1.jpg", "year": "2015-02-28", "title": "Nasty Freestyle", "lyrics": "[Produced by 30 Roc]\n\n[Intro]\nYah, say Roro, you know what it is, right?\nWho Is Rickey Wayne?: The Mixtape\nYa feel me? Yah, ahem\n\n[Verse]\nFirst, let me hop out the muh fuckin' Porsche\nI don't want her if that ass don't sit like a horse\nI be ballin' on these niggas, got me feelin' like sports\nDash got so much wood I could build me a fort\nAin't too many things I ain't done yet\nI'm the king of this shit, crown by the toilet\nI'm just barely gettin' started, you already upset\nGot a tiger as a pet, I just took him to the vet\nHomie, I be makin' hits, I'm the rap Derek Jeter\nLet your bitch ride on me like she was on the feeder\nIf the pussy ain't good then I probably won't feed her\nLil homie, you can keep her cause I really don't need her\nI ain't worried 'bout features, homeboy, you's a peon\nToilet seat ass nigga, man, I swear you gettin' peed on\nMan, my jewelry so cold, I walk around with the heat on\nMy alarm clock set, just in case they wanna sleep on, ya dig?\nI'm a full-time player, hoppin' out in alligator\nSippin' lean and Now and Later, homie, I'll annihilate ya\nIf you think you wanna battle, you gon' have to pay some paper\nI just hit her and I quit her, I would never ever date her\nIt's a shame how I'm barely gettin' love in the city\nTravel to another town, you can bet they fuckin' with me\nI be killin' this shit, pray to God they forgive me\nThey said, \"when you blow up, don't forget me\", man\nI been on fire ever since they made the lighter\nMy boys will pull up on ya, homie, I ain't talkin' diapers\nWalk into your function, on point, I'm like a sniper\nMy girl bad like Dej Loaf so don't try her\nFlexin' all you want but homeboy, you ain't ready\nTen times sharper than Michael Myers' machete\nBeen about the money, I ain't worried 'bout the fame\n'Bout to have everybody sayin', \"Who Is Rickey Wayne?\"\nThat me..."}], "artist": "T-Wayne"}