{"artist": "King Los", "songs": [{"image": "https://images.genius.com/916a912809348b0dcc67ff098d44c1fa.500x500x1.jpg", "title": "Amazing", "year": null, "album": "Welcome To Swaggsville", "lyrics": "[Intro]\nUmm you already what this is baby, it’s your boy Los\nYou what I’m talking bout, I mean it’s only right that we go in\nSo uh, Im amazing, so so amazing (Welcome to swagsville)\nHad to turn the lights off\nLet’s go baby\n\n[Verse 1: Los]\nCause I go harder, faster, further, stronger\nDirector, facilitator, illustrator, author\nAll of the above, I’m falling so far in love with this all over again\nThis is awesome\nHip-hop be my darling, tell me you gon marry me\nCause without you I’m nothing, and without me you’re boring\nLook how we be performing, when we get together\nYeah we the shit forever, you see this shit I’m better than all of the rest of ... them\nThey phony like wrestlers, when you gone I’m restless\nBut when you close them gestures\nCool as I could ever be, smooth as you could never be\nNever out my groove I’m way too cool of a celebrity\nF with me I’m definitely the deathest to the death of me\nEverybody left me so the only one that's left is me\nNever thought my life would be filled with so much destiny\nTill everything is right with me, I write whatever’s left of me\nAnd can't nobody write for me, so I guess it’s left of me\nTo make it all right, you can say I left the recipe, definitely\nSee me a king it ain't a ‘ting when a pawn a verse me\nMe no fear when me ‘ear all the controversy\nLord ‘ave mercy how them tink a response could 'urt me\nWhen me make it ‘tru the hard time and all me friend desert me\nAllergic to chilling these millions I’m grinding\nShinning with the brilliance of a trillion cut diamond\nOf course I’m the hardest\nThey should teach courses at Harvard about how I horse other artists\nI’m the Rolls-Royce to these Hondas\nBetter known as my compe-tition but in compe-tence I am not fond of\nIf it’s not a compli-ment, that’s a response to this shit, what could you offer?\nHomie, I am off the far corner of Mars with my bars and fuck gravity I actually walk on the stars\nHeard a redneck say “Where the fuck is this nigga from?\nAll we know is he just jump on the track and he get ‘er done\nLord forbid he get a goddamn beat with a bigger drum\nCause Lil Wayne done lost his goddamn brain and Jigga’s done”\nWhere the fuck do I get it from?\nSince the moment this shit begun, it’s like God put a pen in my hand and said “nigga run”\nI been running ever since, presenting stunning evidence\nWith such cunning relevance and like running elephants\nYou can hear my arrival, I fear for my rivals\nMy flow’s so righteous should of appeared in the Bible\nPrepare for the final chapter of a stand up nigga\nCause most rappers got spinal fractures\nBut mine will capture the minds of the captured\nUnder these lines I’m underlining the answers\nCan’t tie me, down or deny me\nMy ribbon in the sky provided by such a fly me\nHow deep? I stimulate your brain more\nAnd lames taking shots at me cause I’m something to aim for\nGame score, forty-nothing\nFucking with Los, I’m sure he’s bluffing\nMy fans say “Homeboy you’re disgusting, you don’t have to say anything more to 'em than fuck 'em,”\nSo “Fuck 'em!” I say, and I’m so sincere why the fuck would I play?\nHe ain't walk in my shoes, nigga fuck what he say\nI just murdered this shit, come fuck with me Ye"}]}