{"artist": "Playboi Carti", "songs": [{"album": "Wave 1", "title": "Butterfly Coupe", "image": "https://images.genius.com/a63c7b050bf5165863984536fc353f66.1000x1000x1.jpg", "lyrics": "[Verse  1: Playboi Carti]\nWalk up in that bitch, ooh, yah, and I kick shit\nAnd I got some bitches, ooh, and I switch shit\nAnd I got these millions, ooh, on my dick quick\nAnd they know I'm in here, ooh, in the ceiling\nHigher than you feeling, ooh, how you feeling?\nYoung Carti I'm building, ooh, and I'm in it\nAnd I'm in that fit with that shit, yeah that hit shit\n29 Clique shit, ooh, get your bitch quick\nAnd I gotsa lotta shit, yah, don't get shit bitch\nIf I don't feel the shit, ooh, you can't smash bih\nAnd I'm in that Rari, ooh, yah, and I smash bih\nAnd I'm in your daughter, ooh, yah, watch me smash it\nDiamonds drip like water, ooh, yah, watch me splash bih\nAnd I'm in that, yah, yah, that my new whip\nPull up in my, ooh, yah, that my new whip, yeah\nThat's yo new bih? Yeah, so that's new dick\nYeah, that new thick, ooh, make me cum quick, ooh\nI got lots of shit, yah, I got rich quick\n\n[Chorus: Yung Bans]\nRemember I was down, bet these niggas thought I'd lose\nSo when I pull up now I'm acting brand new\nIce, all these diamonds on me, think I got the flu\nButterfly coupe with my boo, drop the roof, aye\n\n[Verse 2: Yung Bans]\nButterfly coupe with my boo, drop the roof\nThe lil bitch wanna hit my cup, I pour a six in minus two, aye\nGood gas bag, broke niggas smoking boof\nIn the booth with the boof, wake up early, bust a move, aye\nSmoking on some fruit, bitch, I been gassing like a jew\nNiggas say we having pressure, pussy nigga, who is you? Aye\nPress a pussy nigga if he tryna take this loot\nI ain't worried 'bout no bitch 'cause either way these bitches choose\nHunnids, blue, Glock, shoot\nRed, Tech, bitch I ball like I hoop, aye\nBitch I'm from the block, aye, hide it in my sock, aye\nGot my nina on me while I'm smashing on yo thot\nSmashing on yo thot", "year": null}]}