{"artist": "Beanie Sigel", "songs": [{"lyrics": "Sitting with my pistol, the four pound llama\nStrapped onstage at the Summer Jam concert\nWhat you really want from a nigga? I'm a monster\nScratch to the death like the dog Manny onyx\nWack-ass rappers, y'all niggas garbage\nYouTube gangstas, y'all niggas blogging\nB. Sig a problem, connects out in Compton\nUzi onstage, House of Blues rocking\nHard Knock tour, left a Mac in the closet\nThat I just snatched on the badmouth Riley\nRock the Mic tour, got booked for a body\nShot out with RAM squad, what's up with Tommy?\nGot a whole graveyard, nigga, come try me\nRappers like O-Dog, menace to society\nYeah, I'm like Crowe in the Colosseum\nProlific exterminator of human beings\nLook a man in his eyes 'fore I R.I.P. 'im\nKiss a nigga on his cheek 'fore he meet the demons\nGlock 27, thirty three in the clip\nLouis leather check to hold to hold that bitch on my hip\nGun explodes often, leave yellow caution\nBody chalked off with a arm knocked off it\nSnitches breaking water, rats having abortions\nFuck law enforcement, my PSI flawless\nNiggas taking losses, they don't work the porches\nBosses turn to workers, workers turn to bosses\nBroad Street Bully never bitching, still cautious\nStill circle the block, dog, before I park it\nAin't shit changed but the gun under the parka\nGlock 18, Mag 4 fully auto\nNight vision, infrared beam in the dark glow\nBut you in a hole where the dearly depart go\nGlock work while I hawk 'em down\nWhy run the block when I could walk it down?\nSee Desert E, fat boy stay ready\nGovernment issue four pound by the belly\nColt 911, hold that chrome bitch steady\nTen up in the clip, put four up in your skelly\nStomp you in those Air Force Ones like Nelly\nMore stones in the bezel than a Soda Club Pelle\nNiggas can't stop my train, I'm Chubb rocking\nWhat's beef? Who ready to die? I'm big popping\nI'm hundred proof, you niggas cheap vodka\nI'm the lord of the underground, the new chief rocker", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "Shot Caller Freestyle", "album": null}]}