{"songs": [{"title": "4th Quarter", "album": null, "year": "2014-09-12", "image": "https://images.genius.com/767716ebb1f1573f38c330346f497aaa.500x500x1.jpg", "lyrics": "[Intro]\nI look up\nStraight up\nI gave 'em time, time\nTime\n\n[Verse 1]\nNow it's back to me nigga\nI took my clique turned it to faculty nigga\nTook my operation to factory nigga\nWhen I'm in the zone they won't tackle me nigga\nI touched down in the city, a fuckin' walkin' target\nStill man all my bitches miss me, yeah they miss me but not misses\nIf you ask me what my interest, all my interest involve interest\nIt ain't nothing to cut that bitch off but you can't cut my percentage (No no)\nWith the bases loaded all we need's a hit, boy I'ma still swing for the fences (Gone)\nI guess you tend to over do it when you come up underprivileged, look\nI came to my senses, I can never count on people\nI can't even trust the senses in this world full of venom\nAll I need's my spider senses, my short temper to cool out\nYeah sometimes I need woosah, time to get paid by the goo-ghaas\nMy office on top of that rooftop, for my mama Myra Anderson\nTell me who gon' be set for life, Myra and her son, fo' sure\nOne time for the fam, they don't eat, I don't eat\nI can't rest on my feet till they all on they feet\nThey say rest your eyes, I'm just like why?\nBitch I ain't never seen Ben Frank asleep\nBut I do need that paper like sheet after sheet\nI got so much drive ho, look both ways in the streets\nWhen I heard 'bout all these singers and all they naked pictures I'm like \"Did my email just leak?\"\n\n[Interlude]\nHol' up\nLemme check, oh nah nah nah\nThey fake, we good, we good\n\n[Verse 2]\nThe stock goin' up, makin' all the right moves\nBoy you would have thought I got tipped off (Tipped off)\nYou would have thought these niggas fell off a skateboard\nThe way they take these hoes and trick off (Trick off)\nI got a rich girl, I swear to god dawg, man she's like a walkin' ATM\nExcept she ain't come in with drawls\nI know you've been having G.O.O.D. Music withdrawls\nI can not deal with the fuckery that fake shit you be in\nAll that bullshit that you rappin' honestly just makes me cringe\nMoney doesn't grow on trees, okay someone explain to me\nThen how the hell does my whole team just keep on rakin' it all in, hah?\nWe stressed on, we pressed on\nMet with Hov and Bey they told us we next on\nWe dream that, been slept on, we kept on, we left home\nMama earlobes is VS stone\nHer earrings so big she can't even fuckin' hear nothing nigga\nDon't give a fuck, no I can't spare one nigga\nNo I do not have five wheels, I can't spare one nigga\nTalkin' like I'm on the last cigarette because I had to take it back to square one nigga\nSometimes to win the war man you got to lose a battle\nBut if I lose a girl just know my next one gonna be badder\nWhen I pulled up to the church, ooo, they thought it was the pastor\nHeaven sent, raisin' hell, same time, what that's the rapture?\nDidn't go to class for a second I swear I woulda failed everything\nMy passport was the only thing I'm passin', flyin' overseas turnin' dreams into habits\nTurnin' coach to first classes, mom I'm never movin' back\nAnd I put six years in the flow, okay, no wonder it got mastered\nThe flow need a dam, why it's doin' too much damage\nGod damn it's good to get it, even better with ya niggas\nCall up my dog who been in and out depression\nSaid boy how you living, don't lie to me 'bout your feelings\nOn the outside you look fine but on the inside could be killin'\nYou act like a comedian but now you're Robin Williams\nAnd now we cryin' rivers that nobody wants to swim in\nWhen one phone call coulda been the one to prevent it\nSo I'm there for my dogs till we forever on\nTill we hit the dealership and cop the Megazord\nNigga that's the red range, white range, black range, green range, pink range\nYellow range, blue range, every neck comes with a few chains (Ohh shit)\nI learned that every bad bitch comes with mood swings\nJust like Mortal Kombat, Liu Kang, so true man\nG-5 down to Mexico, G.O.O.D. Music familiar man\nWe back at it to let you know, I figure it's best you know\nIn the middle of recordin' we got caught up in the news\nAbout what happened in St. Louis\nWe midwest kids that shit coulda happened to us\nI looked up the flight tonight\nThen I realized man I got a grandma now that's half alive\nAnd honestly what happened in St. Louis probably happened in Detroit like twenty times\nI hope we finally see the signs\nPuttin' gas off in my Benzo, I ran into a youngin'\nThe same age as me except he in the trash huntin'\nAsked me for some change I gave him like one somethin'\nMan to keep that shit a hunnid I wish I woulda gave a hunnid\nCause if you ask me how I'm doin', shit you could do the math\nI just bought a five bedroom, four bath\nThree story, two car garage, I'm one man\nI just did it for my mom, finna do it for my dad\nAnd I ain't even sell my soul, imagine what I coulda got for that\nI made something out of nothing, it's like I pulled it out a hat\nMan when I'm done they gonna statue me, I turned my clique faculty\nOperations to factory, in my zone they won't tackle me\nTouched down in the city, the fuckin' walkin' target\nStill all my bitches miss me,  yeah they miss me but not misses\nIf you ask me what's my interest, all my interest involve interest\nNigga\nStraight up"}], "artist": "Big Sean"}