{"songs": [{"lyrics": "[Chorus]\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was played the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was played the back\nBut now I'm in the front\n\n[Verse 1]\nI was in the back I told my doll that Ima take it\nAin't faking kept it real but these labels ain't wanna pay me\nI need my money bitch or I ain't fucking with no label\nThese niggas switched up on me like the seasons I've been waiting\nI was patient, I've been grinding\nAll my life now it's my time\nYoungest bitch applying pressure, then they switched and I'm like why?\nKept shit real, I wadn't in yo ear, talking like a bitch, and that boy a snitch\nWatch your world end up in a ditch\nI ain't mad at you lil baby Ima get it in the field\nTadoe hit my line like sis a hundred k ain't no more deal\nAin't no nigga make me, can't no nigga break me what the fuck\nI'm a project princess bitch they tried to fuck me ain't no luck\nI ain't tripping I'm a bounce back and chase it till I pass\nFuck with you but lately you be acting fool you showed your ass\nShowed me I can't trust no nigga, I was riding I wouldn't lie to you\nYou let me go and kick the p on niggas who would laugh at you\nI'm never in my feelings bitch I'm all about my money\nBitch you bummy why shining looking sunny your team was hungry\nI was trying to show you Asian Doll was bigger then your picture\nBut you flipped the script and showed me why I love to tote them pistols\nI'm a doll and I'm spoiled Ima need my money now\nBank account I set it up you still ain't gave me no amount\nYou can't handle me I'm damn near on TV so when I'm on TV don't hit my line\nThat's where you wanna be, BDG\nBeen the shit, I don't need nobody now I do this shit\nI'm used to money give a fuck about another niggas shit\nI'm praying, I've been, God\nKeep me safe they wanna take my life\nEverybody that I trusted switched up on me fuck the fight\nI'm so tight, I'm so tough, hood lady trendsetter\nSelf made young bitch smoke a bitch like John Doe\nMy future hella lit, when I saw your gang, they jumped on my dick\nWhy y'all change? Cause my fame\nNiggas be on that jealous shit\n\n[Chorus]\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was played the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was in the back\nBut now I'm in the front\nI was played the back\nBut now I'm in the front", "album": "Project Princess Vol. 1", "year": null, "title": "In The Front", "image": "https://images.genius.com/89cf00a43983749125eda2c372d01f56.500x500x1.jpg"}], "artist": "Asian Da Brat"}