{"songs": [{"title": "Mo Money", "lyrics": "[Intro]\n9-7, 9-8, let's get this bitch to set the record straight, y'know what I'm sayin'\nConcentration Camp in the house\nWe ain't playin wit' 'em\nNigga what\n\n[Verse 1]\nIf it don't make dollar then it don't make cent\nTo a ghetto pimp, nigga hop 'cross the fence\nEarly in the mornin', my business with your mug on mean\nSideways, throwin' it up, how them puppies lean\nNow sometimes we rhyme fast, sometime we rhyme slow\nBut wherever we go, we stay strapped down fo' sho\nYou ain't know? It's a cold world gotta keep it jumpin' like jets\nAnd it's like that nigga\n\n[Verse 2]\nLook I'm a lay-low ass nigga, ain't no class figure\nTalk shit about my clan and I'm gonna break yo ass nigga\nI'm 'bout cash nigga that's all I'm tryin' to see\nI can give a fuck less who you tryin' to be\nI got my mind on some shit I'm gonna jack a vibe for me\nI'm with a sick group of vics that's down to ride for me, bitch\nYou see shit done hit the fan and this camp ain't comin' like we is\n'cause we the sickest clan\n\n[Verse 3]\nNow all my niggas put your nuts in your hands if it ain't no hope\nSlide your foot and tell 'em hoes get the dick out they throat\nI'm copin' day-by-day but I really can't wait 'til I get my hands on some loot\nRollin' state to state to get face-to-face\nWith the boss and be like fuck you\nDuck who? I'd love to, but I'm not quite that bitch fight\nSo gank the hoe, lemme get this Gs\nAnd be on the way to get my shit right\n'Cause midnight gon' call for some weed to smoke\nWhen these hoes shake they titties hollerin' \"Go lay low!\"\n\n[Hook]\n'Cause I gots to get mo' money, mo' money\nCan't get my issue with no money, no money\nNigga gots to get mo' money, mo' money\nCan't get my issue with no money, no money\nI gots to get mo' money, mo' money\nCan't get my issue with no money, no money\nNigga gots to get mo' money, mo' money\nCan't get my issue with no money, no money\n\n[Verse 4]\nSometimes I have fatal visions of being paid when I be broke\nSo you know, like I know, that you know\nThis shit I stress is hard to cope\nI'm dope, I still focus on my paper\nPlottin' schemes so when I get my paper\nI can make my paper greater\nA faker, you got the game fucked up\nPenitentiary bound, you wanna clown, I'll make your heart pound\nDown and dirty with this thirty-thirty\nCaught me slippin' with a pound of weed and a verdict\n\n[Verse 5]\nNow when you get your cheese, watch out for broke-ass hoes\nDon't give 'em nothin' free but dick and then show 'em the door\nKeep your ol' lady 'cause you done wanna cut it up and have fun\nAnd pull a high school freak, 'cause they young and dumb\nA Foot Locker broad to keep you laced with kicks and 'fits\n'Bout three college hoes, 'cause they crazy about dick\nGet you a married hoe, just so you could test your game\nGet the credit card and spend up all the husband's change\n\n[Verse 6]\nI can't let another nigga's problems worry me\nNot unless we negotiatin' for some currency, ya dig\nFuck the pigs 'cause they bust they wigs, for nothin'\nThink a nigga movin' somethin', but really they just be stuntin'\nFrontin', like they be pushin' weight and at the same time\nThey don't even know that they playin' themself while lookin' fake\nA crooked snake could easily slip in between\nA nigga and his dream for bein' reign supreme\nWith the green, know what I mean?\n\n[Hook]\nTryin' to get mo' money, mo' money\nCan't get my issue with no money, no money\nNigga! I'm tryin' to get mo' money, mo' money\nCan't get my issue with no money, no money\nNigga! I'm tryin' to get mo' money, mo' money\nCan't get my issue with no money, no money\nI'm tryin' to get mo' money, mo' money\nCan't get my issue with no money, no money\nNigga! (Tryin' to get mo' money, mo' money)\n\n[Outro]\nConcentration Camp in this bitch, ya heard me?\nLay Low\nLucky Knuckles\nYoung Bleed\nBig Happy\nAnd this how we doin' this thing, ya heard me?\nStraight out the South\nHappy in this bitch, for the 9-7\nHonor proves anything\nTryin' to get mo' money\nSixty-seven three\nAnd your mob and me, I have no issue with any of you", "album": "My Balls and My Word", "year": null, "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}