{"songs": [{"album": "Shut Up And Rap", "image": "https://images.genius.com/22af45710b74abb23f51b1a75a855114.1000x1000x1.jpg", "year": "2014-12-09", "title": "I Fucks With You", "lyrics": "[Hook: Cyrus DeShield]\nIf I fucks with you and you fucks with me\nBaby why we wasting time?\nGot my mind made up, I want you, baby\nStop frontin', get with me right\nI fucks with you, and you fucks with me\nThen why we wastin' time? What's it gonna be?\nIf you fucks with me, baby\nIf you fucks with me, baby\nIf you fucks with me, baby\nIf you fucks with me, baby, baby\n\n[Verse 1: Lumidee]\nYo I done seen it all, heard it all, moved too fast, hit a wall\nGave it all, took a loss, questionin' could I be yours\nAnd yeah I'm seein' how you move and everything you do\nI might be judgin' you on some shit you ain't really do\n'Cause when we're rockin', nothin' beats the feelin'\nAnd I ain't got a problem ridin' shotgun if you're steerin'\nSo when you're sayin' that you want me, what that really mean?\n'Cause when you're out there on the road, know it's another scene\nYou're feelin' lonely, cravin' that affection\nAnd all these bitches jumpin' in your face for that attention\nYou could reject it, and I'm sure you're protected\nThere I go, my mind be goin' off into the left shit\nSo what we doin'? Really you're pursuin' this?\nAbout to let my guard down, don't wanna ruin it\nWe got that real shit, somethin' you can feel shit\nSo what the deal is? I think we could build it\n\n[Hook]\n\n[Verse 2: Termanology]\nI ain't sayin' it's love 'cause love is a strong word\nBut in order to love, you gotta have a bond first\nEverybody makes mistakes, I'm no different\nPromise never to judge, long as it's consistent\nYou go and see a couple cats hatin' like bitches\nTryna throw out the directs and sneak disses\nThey probably gonna tell you that I got a lot of women\nIt's one thing to hear it, it's another thing to listen\nJudge me on my actions, my thoughts and my words\nYour stomach never lies, you can start there first\nLook me in my eyes, like deep into my soul\nAnd travel throughout this realm as deep as you can go\nWe never have problems 'cause the sex is official\nAnd when I'm out of town, I always text you, \"I miss you\"\nI know you're kind of worried and respect is the issue\nBut trust me, you'll know it if I really fuck with you\n\n[Hook]"}], "artist": "Termanology"}