{"artist": "Problem", "songs": [{"album": "Understand Me (EP)", "title": "Moment Of Clarity", "image": "https://images.genius.com/2fb841981d824d69093a77309827b08c.400x400x1.jpg", "lyrics": "(Intro)\nThat Nigga sayin what?!\nHa ha\nYeah right\n\n(Verse)\nLet’s make a few things clear\nWhen you’re gone I’ll still be here\nWon’t miss a day, this ain’t leap year\nWe knock out teeth here\nShoppin have a new freak every week here\nThat smell good with pretty feet here\nHad to risen from the ashes, predicted by the masses\nTo be one of the few that persevere through the ratchet era\n80’s baby, the classic era\nGot the skill to bounce back, I’m elastic terror\nTurn that, surrounded by smoke\nGrew Niggas with no bread, care from some toast?\nCrazy right?\nWent from a rapper to a trapper then back to a rapper\nMy definition of a crazy life I guess\nGod’s with me, so it’s like who I got to impress?\nHeartless, the life Bitch put a knife in my chest\nAnd so what? Is it kinda prove real life to my chest\nPulled it out, stuck her and I’m lookin' to slice the rest of you Motherfuckers\nWait a minute, I’m a ladies man\nNot that Nigga frontin' hood with the crazy vans on\nOut here gangbangin with them lil pants on\nOld Nigga , forever young, get my Peter Pan on\nHuh, we don’t need no nigga's validation\nI speak for the diamond nation every time I talk\nWe did what? Don’t believe them allegations\nBe a slave and tell by the way you walk, talk and think\nBy the smell of this dank\nSpend my time in they bitches, the other half in the bank\nMy grind has no limits, I’m Master P in a tank\nWith Silkk The Shocker, C Murda tuck in the shank\nAnd niggas takin shots just like they bustin with blanks\nI hear but don’t feel em\nI’ll punch em, but won’t kill em\nIt ain’t my MO\nBut I got niggas for that\nDon’t need no more rappers on my dick, I got bitches for that\nI think they should start spellin The Nigga\nP-R-O-B-L-E-M\nBird, let’s petition for that\nGet the dictionary ready\nKeep my girl, the energy is more than the two trips of Mary Mary\nVery scary, the coupe is very dairy\nMilky white, lounging at the polo lounge, deeper than Barry White\nVoice buried 24 feet in the ground\nIt’s real in the field, got my cleats on em now\n\n(Outro)\nThey like P what you doin? Wanna switchin yo style right now? You winnin\nYea, but as yo mind change, yo grind change with it\nWould be the same old nigga if I did it", "year": null}]}