{"songs": [{"year": null, "title": "Freestyle Confession", "image": "https://images.genius.com/af357ab92dde48966f2efd2335518e9f.268x268x1.jpg", "lyrics": "[Intro]\nYeah, check this. Uh. Sage Francis\n\nIn an effort to salvage even the slightest percentage of what I once had\nHas left me with vital organs, which much has hemorrhaged\nMy innards twist and turn, I'm convinced that sin is learned\nTheir lesson once the minutes burn, not their soul\nI'm sick with concern about my operative role\nDeadbeat inhabitants\nOn planet Earth\nAre programmed at birth to be apathetic at events\nEven if athletic they're inadequate\nTurning sexually active to abstinent, mentally absent\nYou're not accepting of me, new accent\nDifferent tone\nWhether listening on the phone long distance or reading an interesting poem\nIn this instance\nHearing a song spoken out\nI can fill my tub with confidence and still soak in doubt\nStick some soap in my mouth\nWhen I speak in bubbles\nIt'll give me the appearance of a cartoon and weaken my troubles\nThen with every step I take I'll be leavin' puddles\nAnd though you damp, everybody drowns when I flood town\nI'm being to discreet and subtle\nMan, you figure this kid would be learning\nTo stay away from ambiguous wording\nUnderstand it's disturbing\nPurposefully I stall\nHow many times can I be treated rudely during a courtesy call?\nI've been left with a dial tone\nYes denied on the phone\nI'm depressed, I'm alone\nTime to forget writing a poem\nMy mind's been set, the light has been shown\nI'll confess on the microphone\nNow in the past year, I've done some of the worst things imaginable\nNot including making songs that hopefully bring capital\nI've resided in places that are practically inhabitable\nAnd I know none of this really matters to you but I shall continue\nIn recent months\nI don't think I've been decent once\nMy view of this world has been skewed, I see all priests as punks\nRespect for women?\nAll bitches, freaks and stunts\nMy mental is temporal cause my physical has increased with lumps\nThat could be cancerous\nBut I try to convince myself there's no chance of this\nSince all I've been doing is paying attention to physical health\nThe medicine on my shelf goes untouched\nDon't wanna admit, I need help\nEven though I know I need help, but I can't help it\nI've accepted a hard truth\nGiven by ma dukes\nSee as a kid\nI always peeled off fresh scabs that left me with a scared youth\nYou can check my blemishes and tarnished background if you want proof", "album": "The Known Unsoldier...Sick Of Waging War"}], "artist": "Sage Francis"}