{"songs": [{"title": "Jump Out the Window", "album": "I Decided.", "year": "2017-02-03", "image": "https://images.genius.com/15fe74f551404783e7b7cb1a8ba102e9.1000x1000x1.jpg", "lyrics": "[Chorus: Big Sean & Jeremih]\nI think I’m ready to jump out the window\nAnd turn that nigga that you with right back into your friend, though\nWe already wasted too much time\nAnd your time is the only thing I wish was mine\nSo yeah, oh yeah, I think I’m ready to jump out the window\n\n[Verse 1]\nStraight up, straight up, look\nKnow ya momma didn’t raise you to take no disrespect, yeah\nI feel, I feel like real queens know how to keep the game in check, yeah\nYou cried on my phone the whole night\nThat time he crossed the line yeah, yeah, yeah\n(Oh I was there) I went to straighten his ass out\nAnd you told me never mind yeah, yeah, yeah\nThe question isn't, \"Do he love ya?\" The question is, \"Do ya love yourself?\"\nYou give the best advice to your friends and not take it for yourself\nRemember when you used to come through and hit the Mario Kart\nAnd you always picked the princess\nI realized you was princess way back then\nWe the best thing that never happened, but\n\n[Chorus]\nI think I'm ready to jump out the window\nAnd turn that nigga that you with right back into your friend though\nWe already wasted too much time\nAnd your time is the only thing I wish was mine\nSo yeah, oh yeah, I think I'm ready to jump out the window\n\n[Verse 2]\nYou been up at night, sleep deprivation\nWhat's the hesitation? What's ya reservation?\nYou been trippin', trippin' with no destination\nYou need separation, you need recreation\nY'all been arguing every other day\nYa friends gotta step in and break it up like chill, chill, chill\nIt's no need to turn this into Kill Bill, look\nFunny we ran into each other while we leaving\nYou walked in with a perm\nAnd now yo' hair look like The Weeknd's\nI know that you been needin' clarity\nDon't mean to sit ya down and turn this into therapy\nBut you gave too much time to that boy charity, hear me\n\n[Chorus]\nI think I'm ready to jump out the window\nAnd turn that nigga that you with right back into your friend, though\nWe already wasted too much time\nAnd your time is the only thing I wish was mine\nSo yeah, oh yeah, I think I'm ready to jump out the window\n\n[Outro]\nLook, I don't mean to sound like the jealous type\nBut you oughta know (oughta know)\nI think me and you should get together sometimes\nOn the low low low\nSometimes I wonder if you even know\nHow much you worth, I gotta know\nSometimes I wonder if you even know\nHow much you worth, I gotta know\nI don't mean to sound like the jealous type\nBut you oughta know (oughta know)\nI think me and you should get together sometimes\nOn the low low low\nSometimes I wonder if you even know\nHow much you worth, I gotta know\nSometimes I wonder if you even know\nHow much you worth I gotta know\nI gotta know, I gotta know, I gotta know\nI think I'm ready to jump out the window\nThis one's for you, you, you, you, you, you, you"}], "artist": "Big Sean"}