{"songs": [{"year": "2016-11-04", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "A.B.N.", "album": "H.O.G.", "lyrics": "[Intro: Bumpy Knuckles]\nHalf of these niggas so unaware\nMike check!\nThey so high and drugged up on prescription drugs\nThey don't know what the fucks going on\nFuck am I doing here?\nCame to show you some light\nLook over here nigga\nDo you see me?\nWake up nigga\nWake up!\n\n[Verse 1: Bumpy Knuckles]\nFrom the day I signed on to play the game\nI spit bars with aggression\nI'm to dope to be mad\nI turned depression into expression\nI was 10 when a cop called me a \"nigga\"\nCause I called him a \"cop\"\nPointing his finger through my skully top\nFucking racist cracker\nI was pissed cause the school they told me\n\"Look up to this bigot piece of shit\"\nYeah I dress like a rapper bitch cause I got bars\nStop and frisk one of the best lyricist to exist\nNo guns on me if you touch my frame\nI got a 7 punch combo that'll change the game\nBig mad black nigga in the eyes of the police\nGripping that trigga at Americas nightmare\n\n[Hook: Big Scoob]\nAmericas biggest nightmare\nMy eyes are open now I see\nAmericas biggest nightmare\nThis land ain't what it's supposed to be\nAmericas biggest nightmare\nThis country wasn't built for me\nAmericas biggest nightmare\nWe on a leash so how we free?\nAmericas biggest nightmare\nI broke the change and I'm aware\nAmericas biggest nightmare\nI'm a target now but I don't care\nAmericas biggest nightmare\nThe racial tension fills the air\nAmericas biggest nightmare\nBring it pussies I ain't scared\n\n[Verse 2: Big Scoob]\nBlame Islam for all these senseless acts of terrorism\nOr blame Christianity for these wicked whites and they narrow vision\nBecause you wear a uniform don't mean you practice heroism\nThat's not a given, hate driven\nNo fear written, no clear privilege\nEither way theres people dyin'\nThe systems broke but y'all keep on lyin'\nProtect the people the oath you took\nAll of us with a open book\nNot the ones that look like you\nWalk like you and talk like you\nPower privilege these pussies choosin'\nDo the math my people losin'\nSupremacist on the premises\nSo I'm in this bitch with a lifted fist\nAnd a metal pick and it's evident\nThat I'm fed up with this evidence\nHow black lives are irrelevant\nIn America this the elephant\nBut truth be told we heaven sent\nBenevolent but our etiquette\nIs deemed uncouth\nLet's speak some truth\n400 years in fear of a noose\nWater hoses and guns and troops\nWe are the product you devils produce\nHow are we equal show me the proof\nYou actions are speaking you hatred is leaking\nYour history's written no way to defend it\nShame on us for how we forgetting'\n\n[Hook: Big Scoob]\n\n[Verse 3: Killer Mike]\nLet me tell you something fucked up about this evil and perverse nation\nThe greatest fear and they kryptonite is a black man with an education\nThat's not afraid to go to war for his and violence proliferation\nIf it means it's saves his nation like Tucson did for Haitians\nDon't pray to they god don't respect they rules and if you do you a muthafuckin fool\nHow god lovin master gone love you too?\nYou bastard beat you till you black and blue\nI prayed and prayed and prayed Jesus never came\nThen i read Marcus Garvey, shit ain't been the same\nMy knee only bow to my ancestors\nGood lord ain't blessin' me\nPoor white trash done got all mad protestin' they ACP\nIf I was there like I wish I was\nWould have rolled up in my vert\nI would've told them country boys \"your bitch is fat and you need work\"\nAnd me I got them Oxys, mollys, xanax, and that syrup\nWhat I wouldn't have been is frightened, scared, or startled by your ass\nI would've walked up that fat white bitch and threw her a wad of cash\nTell her \"Money make you master, now bitch go cut my grass\"\n\n[Hook: Big Scoob]\n\n[Outro: Killer Mike]\nAin't no such thing man\nAs nobody over nobody\nStay down\nCome up\nYeah"}], "artist": "Big Scoob"}