{"songs": [{"title": "Good Morning (Ceven AM)", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Intro: Ken Nordine (Sampled)]\nHe became so interested in time that he got little egg timers and gave them away as presents\nTime way out in the universe\nHe knew what time it was on Arcturus and the Pleiades and the Milky Way\nOne night, though, at two o'clock in the morning, the light wouldn't go on; the fuse had blown\nBut suddenly, he realized he knew what time it was without even looking\nNot only in the important cities of this world, but in the entire universe\nAnd naturally, began to brag a little the next day\nHe told people, \"I know what time it is\"\nAnd they tested him and he did know\n\n[Verse 1: brandUn DeShay]\nI’d like to send a big thank you to the people out there who listening\nIt feel like since Volume: One! and Volume: Two!, I’ve been born again, man, I’m Christened\nOr should I say Baptized? All I know is that I had sad eyes when I did this\nThinking ‘bout my future and the path that I chose, God knows I’ma take a big risk\nBut I’m prepared every little step of the way like Charles told me, gotta be ready\n‘Cause I admit that I’m getting sick watching all these cats living my dream like they Freddy\nGive me just a chance just to prove to my fans that all that rooting for me wasn’t in vain\nThey tell me, “You gon’ make it to the top, I hope you know that!”\nI love y’all, I hope you know that\n\n[Verse 2: brandUn DeShay]\nAnd we right where we need to be\nIt might suck right now, but it could be worse\nIt could be hearses instead of cavaliers\nSo you won’t hear much nagging here\nI cried damn near every night, but I’m not sensitive\nIt just hurts to be hurt\nWhen you give your last out of gratitude, just once you would like to be put first\nBut what’s the point of working for acceptance if I am not accepted as is?\nYou can call me stubborn if you want, but I ain’t gon’ change, no, not one bit\nAnd this was kind of hard to flow to ‘cause of this crazy time sig-na-ture\nBut learn the music theory and you, too, will see clearly\nCeven\n\n[Outro: Donnie Darko & Gretchen Ross (Sampled from Donnie Darko)]\nDon’t look so freaked\nI’m not\nYou should check your backpack, those guys love to steal shit\nYeah\nSo, why did you move here?\nMy parents got a divorce\nMy mom had to get a restraining order against my stepdad\nHe has emotional problems\nOh, I have those too\nWhat kind of emotional problems does your dad have?\nHe stabbed my mom four times in the chest\nOh… did he go to jail?\nNo, he fled\nThey still can’t find him\nBut my mom and I had to change our names\nAnd I thought “Gretchen Ross” was really cool\nI was in jail once\nI mean, I accidentally burned down this house\nIt was abandoned, but still, I…\nI got held back in school\nAnd I can’t drive until I’m 21, you know\nBut I’m over all of that, I, I…\nI’m painting and stuff, writing\nI want to be a writer or maybe a painter, I don’t know, or maybe both\nI’ll write a book and draw the pictures\nThen maybe people will understand me\nI don’t know, change things\nDonnie Darko? What the hell kind of name is that?\nIt’s like some sort of superhero or something\nWhat makes you think I’m not?", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}