{"songs": [{"title": "An Ocean of Stars", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nYeah\nLet's set sail on our relationship\nAcross the seas on a gentle breeze\nI can take you down like submarines\nIn our submarine, submerged in dreams\nI take you down 2000 leagues\nPast the starfish, sea cows, and reefs\nAnd coral\nWhere we can explore all\nThe things underneath the bedsheets or sheets of sand\nHand in hand\nOr fin in fin\nWe done made it through the thick and thin\nSo how a little bit of water gonna stop us?\nWe gon stop the water like stoppers\nDeep sea divers stop and they watch us\nThey can't believe that we don't need to breathe\nBut what they can't see is we got clearance\nClearly we got gills like Scott Heron\nBut still\n\n[Chorus: brandUn DeShay]\nI can take you higher\nI can take you higher\nI can take you higher than this\nYeah, said I can take you higher\nSaid I can take you higher\nI can take you higher than this, yeah\n\n[Verse 2: brandUn DeShay]\nLand ahoy! Now we back to hand in hand\nAs we crawl from the coast with our hands in sand\nSunrise look as sweet as a candy stand\nI had to say it 3 times like the candy man\nConversation about as dry as the desert we in\nI felt like desertin, like dessert with an n\nBut I said I wouldn't quit, I'd stick it out until the end\nLooked around and found a stick and carved a heart in the sand\nThen I felt a raindrop, two drops on my hands\nTwo turned into a few drops\n\"I think see an oasis, what did you spot?\"\nShe said, \"It must be a mirage. I see a suitcase and two cars! \"\nWith no time to wonder, we ran down yonder\nTumbleweed roll like the thunder we under\nUnlatch the suitcase and what did we see?\nOpened it up and found two pairs of wings\nSo\n\n[Chorus: brandUn DeShay]\nI guess I can take you higher\nI guess I can take you higher\nYeah, I can take you higher\nI can take you higher\nWe could take it up higher\nWe could take it up higher\nWe could take it up higher and higher and higher\n\n[Verse 3: brandUn DeShay]\nThe sweet smell of the atmosphere\nGot me feeling a little bit weird\nThere's something in the air, oh wait, that's me\nNow we so fly, literally\nNo carpets to fold out like centerfolds be\nWe close to the action like front row seats\nNo one in the world can get sick of this\nYou flying with Rudolph like St. Nicholas\nThe difference between us and them\nIs like Prada and H&M\nThey got wax wings like Icarus\nEven with wings your figure still significant\nAnd I ain't learn that in chemistry\nBut we got chemistry and we got geology\nI'll put a rock on your finger as soon as I get outta here\nBut the problem is that we exiting the stratosphere\nOur wings fall from grace as we fall towards space\nBut\n\n[Chorus: brandUn DeShay]\nI can take you higher\nI can take you higher\nYeah, I can take you higher than this\nWait, no\nI said it ain't nothing higher\nYeah, I swear it's nothing higher\nIt ain't nothing that's higher than this\n\n[Verse 4: brandUn DeShay]\nIs this a dream or it used to be?\nCause somehow we don't even need suits to breathe\nI caught a glimpse of the pleiades\nLike an ocean of stars, but if not an ocean a see at least\nAnd then we see a spaceship arrive\nYou close your eyes to shade the blinding light\nWe clutch our hands tight as we ascend\nBeen shooting at the stars, I hope we still friends\nYou look out the window and you grip my arm\nAs the ship moves to infinity and beyond\nEven the Milky Way seems small and far\nThe big dipper just turned into one big star\nBut I look into the window's reflection, why?\nCause I can see the stars in your eyes\nEven when we out of space or in outer space\nWhen your hand's in mine, we never out of place\nI told you I can take it up higher\nI told you that I can take you up higher", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}