{"artist": "Big Ed", "songs": [{"lyrics": "[Master P]\n\nOh yeah, and to our enemies\nWe don't hate you but uh, we got a place for ya\nCause uh\n\nSomebody goin die tonight\nNo Limit assassins goin ride tonight (What's up Big Ed nigga)\nSomebody goin die tonight\nNo Limit assassins goin ride tonight\n\nUhhhhhh, ha ha\nMy motherfuckin guns and my duty nigga\nAnd let me handle my motherfuckin business\n\nI served an ounce of cocain, and now I'm trapped in this game\nSo much weed to the brain, got you bangin for change\nBut I'm a No Limit soldier, tattooed in blood\nFederal OZ's sold keys and now heroin and drugs\nAnd this game got me trapped cause I've been bustin at bitches\nAnd I've been standin on these projects countin up keys and kits\nAnd these hoes wanna kill me, see me dead cause I'm rollin\nAnd everything that I ride I pay with cash it's not stolen\nNow I don't trip on no bitches and I don't trip on no niggas\nYou wanted the dope and some cain, now how'm I supposed to deliver\nI got my game that's my G, I fuck with killers and ballers\nI live for today and tonight so nigga fuck tommorow\n\nSee I'm a soldier for life, give me my duties and my stripes\nAnd fuck everybody else, and we gotta ride tonight\nSee I'm a soldier for life, give me my duties and my stripes\nAnd fuck everybody else, and we gotta ride tonight\n\n[Big Ed]\n\nI'm on my way to N.O. with four keys of cocain\nI got murder on my brain with the trunk full of thangs\nP told me meet him uptown, it's time to get dirty (third ward)\nGot a bunch of niggas tatted up screamin ya heard me\nGot them bout it bout it bitches ready to fuck\nI said it bout it bout it nigga, cause they're ready to bust\nPut my guns in the sky (sky), bullets goin fly (fly)\nAnd I ain't satisfied till all my enemies die\n\n[Master P]\n\nSee I'm a soldier for life, give me my duties and my stripes\nAnd fuck everybody else, and we gotta ride tonight\nSee I'm a soldier for life, give me my duties and my stripes\nAnd fuck everybody else, and we gotta ride tonight\n\nNow drive nigga\nWe did that\nNo Limit soldier!\nWoo woo!", "image": "https://images.genius.com/d1645663d13224ddd74a3441afd4c58c.772x768x1.jpg", "year": null, "title": "Assassin", "album": "The Assassin"}]}