{"songs": [{"title": "All My Life", "album": "Finally Famous: The Mixtape", "year": "2007-09-30", "image": "https://images.genius.com/e4311df795cf4c9077ccbb609da0c55a.500x500x1.jpg", "lyrics": "[Intro]\nUh-huh, uh-huh\nUh-huh\n\n[Verse 1]\nI am the hottest in the whole metropolitan (yeah)\nWith so much knowledge that I overlook college, man\nIs my mic on? Mama said \"Just do it\" so put your Nikes on\nAight mom, but these niggas out here rule this jewel to Jesus\nAnd don't believe in me like Jews do Jesus (yeah)\nI'm tryna make it out the rooms at the same reaches (aha!)\nAnd see a million dollars but I never knew reaches (never did)\nBut now my change up like a picture (uh-huh)\nI ain't lookin' at a poster but I see the bigger picture\nAnd I used to do it at a momma basement like Tigga\nBut a nigga so hungry, I'm about to eat ya dinner (ye-up)\nI'm here in the beginning and the end like winter\nNo matter what, was always told to \"Go on! Keep your chin up!\" (yeah)\nBecause you got to work it up like chin-ups\nAnd get on the rebound like a sit-up, eh-heh\n\n[Chorus]\nAll my life\nHow old they been puttin' me down? (they been puttin' me down, they been puttin' me down)\nIt's been all my life (uh)\nTryna get off the ground (we on the rise, we on the rise, we on the rise!)\n\n[Verse 2]\nWell, they say \"You can only go as far as you can see\"\nIf that'll determine all you could be\nIf that's the answers, I got 20/20 vision\n'Cause a nigga out here gettin' what these other niggas didn't\nDawg, I went to eat-in like savages\nSo not eatin' at all like Africans\nAnd my average is above averagin'\nSo they ain't gettin' none like after [?]\nI ain't always had money but was rich in spirit\nI always made noise even if you ain't hear it\nNo questionin', I'm ahead of them\nAnd moved up like my last name Jefferson\nThe truth, my first name should've been evidence\n'Cause some of y'all bitch made like estrogen\nBut ain't shit changed until the money out the ass\nLike a nigga shit change, haha\n(Damn!)\n\n[Chorus]\nAll my life (uh, uh)\nHow old they been puttin' me down? (they been puttin' me down, they been puttin' me down)\nIt's been all my life (uh)\nTryna get off the ground (we on the rise, we on the rise, we on the rise!)\n\n[Verse 3]\nThey underestimate 'cause I'm underage (uh-huh)\nBut I'll put in work like a brother that's underpaid\nSo, I'm paid like church on a Sunday\nAnd fresh to death (uh), I belong on a runway\nMy pockets went from super broke to super swole\nSo now I ball like the Super Bowl\nI ain't see me in the draft, it ain't eight in the morning (uh-huh)\nBut you see me first class (uh)\nAnd I'm pickin' up that paper like a nigga work trash, damn!\n\n[Chorus]\nAll my life (uh, uh)\nHow old they been puttin' me down? (they been puttin' me down, they been puttin' me down)\nIt's been all my life (uh)\nTryna get off the ground (we on the rise, we on the rise, we on the rise!)"}], "artist": "Big Sean"}