{"songs": [{"title": "Adding On Rap", "album": "The Lost Tribe of Shabazz", "year": null, "image": "https://images.genius.com/ccff32ca0eedb6ac1f785643772e94fa.400x399x1.jpg", "lyrics": "Peace, my brothers and sisters\nHow ya been, I kinda missed ya\nBut now I'm back rockin this club track\nHit your cassettes, I think you better dub this one, black\nCause it's kickin, it's gonna stick in\nYour brain, Just goes insane on the mixin\nAnd on the rhyme tip I get mines quick\nI don't waste no time, I click\nTestin my mic, mic-check\nIs it hype yet? It's hype? Aight, bet\nGrab a girl and proceed to the floor\nThis is the perfect night for you to score\nJust might be a night for romance\nI don't care, all I want you to do is dance\nGirls are fiending for loving\nCryin and kissin and huggin\nBut they don't know nothin\nOnce the bug's in all of you will start buggin\nLadies listen, I'm not dissin\nDon't ( ? ) cause there's too many fish in\nThe sea for me to do what I wanna do with\nAnd I'm not stupid, so don't play me like cupid\nKeep your claps on as I rap on\nThe title of this song is let's on add\n\nWell, let's start this\nI wanna see the crowd get retarted\nOn the dance scene, know what I mean?\nI'm the cream, the cream, the one that rises\nAnd I'm one of the wisest\nMy fans been waiting so long\nFor me to come on with a rap to a club song\nWell, here it is, just a little taste\nSo let it pump and ride the bass\nHands start clappin when I'm rappin\nBooties are shakin, feet start tappin\nThe flavor lingers, fingers start snappin\nI last long cause I'm strong and I'm black and\nProud, I'ma say it out loud\nI'ma sincerely rock this crowd\nI got something here you don't ever wanna turn down\nSo be concerned, clown\nCause if you're not concerned you'll get ( ? ) on\nFor the simple fact that you slept on\nAnd it's not wise to sleep in this business\nCause you can get dismissed\nThis is a mixture of club and hip-hop\nAnd I'm on my way like straight to the tip-top\nAnd I don't stop, word is bond\nI'm glad to be strong\nSo let's add on"}], "artist": "Lakim Shabazz"}