{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/fc08a4018680b3979b913a15b46cd21b.1000x1000x1.jpg", "year": "2019-06-07", "title": "No Talkin", "lyrics": "[Intro]\nAyy, don't talk about it if you really gon' do it\nDon't say you gon' do that shit if you really won't do it\nBeen at the bottom, you don't wanna go through it\nI'll take it back out the back and I flow through it\nNow, I'm in the back of the 'Bach\nTwin chopsticks, Cody and Zack\nDJ on the beat, so it's a banger!\nMe and Blanco Kobe and Shaq\nMe and Lochi goin' Mad Max\nATL Jacob, bitch!\n\n[Verse 1]\nCome through, just don't take no flicks\nGo at whoever, I ain't got no pics (Word)\nHeard a nigga say he fucked my bitch (What?)\nFuck that bitch, I don't trust that bitch (Trust that bitch, nigga)\nAventador and the license plate Michigan (Yeah)\nHad to quit fucking with dawg, he feminine (Feel me?)\nI run Detroit, niggas talkin' 'bout Eminem\nTalking that shit, I kill you, him, and him (Yeah)\nI made a M, then I made a M again, slow down\nCheck that score, nigga, blow out (Blow out)\nNo school 'cause the trap got snowed out (Snowed out)\nIf I was C-Murder, I would've broke out (Broke out)\nBitch got flew out, then thrown out\nLil' bro in the joint gettin' niggas rolled out\nEverything a nigga do for the bag, no clout (On my momma)\n\n[Chorus]\nAyy, don't talk about it if you really gon' do it\nDon't say you gon' do that shit if you won't do it\nBeen at the bottom, you don't wanna go through it\nI'll take it back out the bank and I'll blow through it\nI'm in the back of the 'Bach\nTwin chopsticks, Cody and Zack\nMe and Blanco Kobe and Shaq\nMe and Lochi goin' Mad Max, bitch\n\n[Verse 2]\nBitch, I'm a Detroit legend (Legend)\nYou convenient, not special (Not special)\nAnd you know I'ma shoot, not wrestle (Bow)\nI'm calling it now, this shit goin' Platinum (That's facts)\nBefore I go broke, I'ma jump in a lake\nI could jump out that Bentley and jump in a straight\nJump out that straight and jump in a Cutty\nNiggas want smoke, we gon' jump in a tank\nLil' baby, I don't do dates\nCan't have these hoes with a due date\nSpend your block for a few days\nWith a few K's, if you play, you lay\nNiggas want beef, don't entertain it\nThey wanna die, just make the arrangement\nShe on her knees like its a engagement\nMy niggas get money too, it's contagious\nWhere was you at when I was in the basement?\nWhere was you at when I was at arraignment?\nThey wanna fuck, 'cause we in this bitch raining\nMillion dollar nigga, but I still eat Ramen\nI love bro to death but we don't really be hanging (Why not?)\nI'm scared to hang with him 'cause he got more bodies than Jason (He's a killer)\nForeigns back to back, just line 'em up, adjacent (Line 'em up)\nYou got all them niggas locked up, you a agent (Boy, you's a rat, bitch)\n\n[Chorus]\nAyy, don't talk about it if you really gon' do it\nDon't say you gon' do that shit if you won't do it\nBeen at the bottom, you don't wanna go through it\nI'll take it back out the bank and I'll blow through it\nI'm in the back of the 'Bach\nTwin chopsticks, Cody and Zack\nMe and Blanco Kobe and Shaq\nMe and Lochi goin' Mad Max, bitch"}], "artist": "Tee Grizzley"}