{"artist": "50 Cent", "songs": [{"album": "Curtis", "image": "https://images.rapgenius.com/2af05736416168c4afae4dbe684f0fbe.600x614x1.jpg", "title": "I Get Money", "lyrics": "[Produced by Apex]\n\n[Hook: Audio Two (50 Cent)]\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah)\nMoney, money I got, money, money I got (I run New York!)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah, yeah)\nMoney, money I got, money, money I got (I run New York!)\n\n[Verse 1]\nI took quarter water sold it in bottles for 2 bucks\nCoca-Cola came and bought it for billions, what the fuck?\nHave a baby by me baby, be a millionaire\nI write the check before the baby comes, who the fuck cares?\nI'm stanky rich, I'mma die trying to spend this shit\nSouthside's up in this bitch\nYeah, I smell like the vault, I used to sell dope\nI did play the block, now I play on boats\nIn the south of France baby, Saint-Tropez\nGet a tan, I'm already black, rich, I'm already that\nGangsta, get a gat, hit a head in a hat\nCall that a river rat, shit, fuck the chitter chat\nThe baker, I bake the bread; the barber, I cut your head\nThe marksman, I spray the lead, blood clot, chop your leg\nDo not fuck with the kid, I get busy with the Sig\nI come where you live, ya dig?\n\n[Hook: Audio Two (50 Cent)]\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah)\nMoney, money I got, money, money I got (I run New York!)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah, yeah)\nMoney, money I got, money, money I got (I run New York!)\n\n[Verse 2]\nYou can call this my new shit, but it ain't new though\nI got rid of my old bitch, now I got new hoes\nFirst it was the Benzo, now I'm in the Enzo\nFerrari, I'm sorry, I keep blowing up\nThey call me the cake man, the strawberry shake man\nI spray the AR, make your whole clique break dance\nBackspin, head spin, flatline, you're dead then\n9 shells, Mac-10, \"who wanna get it cracking?\"\nI was young, I couldn't do good, now I can't do bad\nI ride, wreck the new Jag, I just buy the new Jag\nNow nigga why you mad? Oh, you can't do that?\nI'm so forgetful, they calling me cocky\nI come up out the jeweler, they calling me Rocky\nIt's the ice on my neck, man, the wrist and my left hand\nBling like bloaw, you like my style\nHa ha - I'm heading to the bank right now\n\n[Hook: Audio Two (50 Cent)]\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah)\nMoney, money I got, money, money I got (I run New York!)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah, yeah)\nMoney, money I got, money, money I got (I run New York!)\n\n[Verse 3]\nYeah, I talk the talk, and I walk the walk\nLike a Teflon Don, boy, I run New York\nWhen I come outta court, yeah, I pop the cork\nI keep it gangsta, I have ya outlined in chalk\nIn the hood if ya ask about me\nThey'll tell ya I'm about my bread\nRound the world if ya ask about me\nThey'll tell ya they love the kid\n\n[Outro]\nWhoa, hey (I-I get it)\nWhoa, hey (I-I get it)\nWhoa, hey (Yeah)\nWhoa, hey (I run New York)\nWhoa, hey (I-I get it)\nWhoa, hey (I-I get it)\nWhoa, hey (Yeah, yeah)\nWhoa, hey (I run New York) whoa\nI get money, money I got\n(I'm back on the streets, man)\nI get money, money I got\n(I'm bringing the heat, man)\nI get money, money I got\n(I'm on my grind)\nMoney I got, money I got\n(Like all the time)\nI get money, money I got\n(Trying to stop my shine)\nI get money, money I got\n(I'll cock my 9, don't get outta line)\nMoney I got, money I got\n(I said don't get outta line\nI-I get it, I-I get it\nYeah, yeah)", "year": "2007-06-30"}]}