{"songs": [{"year": null, "image": "https://images.rapgenius.com/a81c43ce4eb01064e3cf8b0e726c42d0.500x500x1.jpg", "title": "The World is a Ghetto GEEmix", "album": "Winners Circle ", "lyrics": "[Intro]\nKids is what make me feel so good\nSee you looking at the glory that's coming up into the future of life\nSee the younger youth is what's gonna make everything to keep going\nAfter I done passed down the hill\nYoung and black!\n\n[Verse 1: Marcus Eugene]\nUh, young, gifted and I'm black\nUh, young, gifted and I rap\nYoung and gifted, but I don't got a strap\nSo I hope nobody try to run up on me with the mac\nLike \"blat!\"\nLay a nigga flat\nBut let me fall back cause I ain't into all that\nAs I get back to the trap\nWhen I say I'm trappin', that just mean I'm tryna stack\nTryin' not to get caught up where I'm at\nIn the 'jects where the mice gettin' cheese with the rats\nThat's where I be's, and these is the facts\nThe world is a ghetto, we all know who's Geppetto\nAngel on your shoulder, in your ear you got the devil\nPeople change like leaves that them dope boys peddle\nBlow trees like flowers in the meadow\nLife's a breeze, you know me, I'm just tryin' not to settle\nCause these streets still cold like metal\nWhen it's heat, it ain't sweet\nAnd them shots ain't Jell-O\nSo, props to them niggas takin' shots like Melo\nFrom the block, just tryna meet the top like \"hello!\"\nUh, then we sayin' our good-byes\nGlory for the villains, no love for the good guys\nA system of bad people that's tellin' us good lies\nThat's life as you know it, you lookin' through hood eyes\n\n[Hook: BJ the Chicago Kid]\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\n\n[Interlude]\nThen there's a lot of funky things in this country\nAnd there's a lot of good things too\nBut there's more funky than good\nWe've changed some for the best\nAwful lot of cases for the worst\nAnd some, they have not changed at all\n\n[Verse 2: Starks]\nFrom a ghetto where fathers don't even father\nMothers don't even bother\n'Less it's about a lotto\nDo anything for a dollar\nYeah, they givin' head just to get ahead\nProvin' they ain't thinkin' 'bout tomorrow\nThey bottle full of sorrow\nPain is deeper than cargo pockets\nI wouldn't knock it, I just want better for my note\nYeah, I know we all different\nBut we'll always be the same 'til we change our endin'\nMan, we gotta change our mind before we change our livin'\nAnd if we never change our mind we in the same position\nBut niggas is niggas\nAnd bitches, well, they still bitches\nInstead of brothers and sisters\nMan, this shit is ridiculous\nI guess I'm still ridiculous\nHollerin' at shorty like \"hey, yo, let me get yo' digits\"\nThen a man get offended\nThen a pistol get grippin'\nAnd he shoot and he missin'\nHe don't care who he hittin'\nAnother senseless victim\nAll from ghetto livin'\n\n[Hook]\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\n\n[Interlude]\nDude, we got to get our minds together!\nAnytime a brother was shot another brother in his own neighborhood\nThen go to his funeral and turn over his own casket\nThey need to have the police down there\nCause see the niggas is N.A.A.C.P\nNiggas ain't actin' like colored people\nIf I can't work and make it, I steal and take it\nThey come up to me with a nigga who can put air in a bottle and sell it\nHe can do it man\nA nigga can sell anything\n\n[Verse 3: Kendrick Lamar]\nAs I watch the sky change colors\nThe rain flooded the neighborhoods of the black brothers\nThe black mothers are stressing, the coroners have covered\nAnother statistic, episodes of a cold summer\nThe street runners got the same legs of Michael Johnson\nThe fast life surpassed life beyond the conscience\nProfanity in the air, the children use the content\nThe vanity's in the air, that Louis bag: haunted\nThe black girl with the hair, that's kind of coarse\nHer baby daddy's in court, she smoking on a Newport\nSeventeen with dreams of becoming a stripper\nOr becoming an AIDS victim while touching them zippers\nThe life that we living in, things we would do just to live again\nHow can an angel forever live in sin?\n\n[Hook]\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\n\n[Outro]\nYou know, anybody that uses somebody else to gain is pimpin'\nWell, I tell you what soul brother, lookie here\nCan't nobody pimp you but your pimp ass self\nYou understand?\nThen there's a lot of funky things in this country\nAnd there's a lot of good things too\nBut there's more funky than good\nShit ain't gettin' better\nWe've changed some for the best\nAwful lot of cases for the worst\nAnd some, they have not changed at all"}], "artist": "BJ the Chicago Kid"}