{"songs": [{"title": "Wiggle", "album": "California Sweetheart, Pt.2", "year": "2014-08-05", "image": "https://images.genius.com/53c0e30a15ee99ee795398042b0a7565.1000x1000x1.jpg", "lyrics": "[Intro]\nWiggle like that with a dick in her (dick in her)\nBet she can't wiggle like that with a dick in her (dick in her)\nBet she can't wiggle (wiggle...)\n\n[Verse 1]\nHit the club, tear the club up\nColt 45 and two blunts got me fucked up\nPlus you bitches got me fucked up\nGot my name all up in they mouth cause I'm wassup\nDon't you know we runnin this bitch?\nLil Debbie count buns in this bitch and that's typical\nAnd I ain't even trippin on you hoes\nCause it's obvious I'm shitting on you hoes and that's literal\nThis for my bitches who don't mind gettin' ratchet\nBitch I'm the fire can you match it? Catch it?\nBounce bitch\nDon't forget to put a little wiggle in it\nBounce bitch\nGot your man lookin' now he wish he hit it\nWhen I make it clap and I throw it back\nGot these muhfuckas feenin' for the pussy cat\nIf they starin' then I'm probably what they lookin at\nThey know that Debbie's where the goodie at\n\n[Hook]\nBounce bitch, bounce, bounce, wiggle, wiggle, wiggle\nBounce trick, bounce, bounce make that booty jiggle\nYou can do it, put your back into it and don't forget to put some ratch into it just watch me, bitch\nBounce bitch, bounce, bounce, wiggle, wiggle, wiggle\nBounce trick, bounce, bounce make that booty jiggle\nYou can do it, put your back into it and don't forget to put some ratchet to it just watch me, ho\n\n[Post-Hook]\nDamn, baby got a ass so fat\nMake a player wanna smash that\nBring that shit back, drop it, wiggle for me\nPussy pop it jiggle for me\nDamn, baby got a ass so fat\nKind of ass you would throw a stack at\nBring that shit back, drop it, shake it for me\nPussy pop it, get naked for me\n\n[Verse 2]\nLook, but don't touch muhfucka I'm a boss bitch\nStill work a muhfucka out like cross fit\nBlowing money in the club don't cost shit\nThis going out to the bitches who think I lost it\nCan't you see I'm winning in this bitch\nYour man wishing he was swimming in this shit and that's typical\nBitch you can't work it like me, hit the floor, can't twerk it like me and that's critical\nThis for my bitches who don't mind gettin' ratchet\nBitch I'm the fire can you match it? Catch it\nBounce bitch\nDon't forget to put a little shake in it\nBounce bitch\nGot these hoes salty, throwing hate in it\nWhen I make it clap and I throw it back\nGot your man salivating cause the ass fat\nIf they starin' then I'm probably what they looking at\nThey know that Debbie's where the gushy at\n\n[Hook]\n\n[Post-Hook]"}], "artist": "Lil Debbie"}