{"artist": "ILL BILL", "songs": [{"title": "Glenwood Projects", "lyrics": "[Intro: Uncle Howie]\nGlenwood motherfucking Projects! That was the fucking place, man. Fucking crack smoking all night, cooking it up, selling C4, weapons, blowguns, every motherfucking thing. What a fucking rush! We were cooking the shit up, and I smoked it up, and the Jamaicans man, they came back, fucking torched the place with me motherfuckingin it! I couldn't get out the fucking apartment, they locked me in, I had to go out the fucking window, it was fucking dynamite!\n\n[Verse 1: ILL Bill]\nILL Bill, lost sanity, lost humanity\nLost in a maze of purple haze\nCannabis sativa, spit ether violently\nVery vociferous, victorious\nHotter than a crematorium, I'll kill all of you\nKill your mother, fuck you, drop dead, faggot it's the dragon\n.44 Magnum splatter you in front of your family\nMy firearms never be tired, up in the air\nThrow a bullet up in each eye, and one in your ear\nI speak heroin, breathe weed, sniff cocaine\nTweaked levels when I peeped Courtney kill Cobain\nWe got the whole world scratching their heads\nOur life is like a hijacked airliner but we managed to win\nBack to the crib, breaking up the cash and the brick\nHaving a bitch flashing the tits while you crashing the whip\nLaughing at hoes taking facials in amateur flicks\nWhile the ILL Bill album's kidnapping your kids\n\n[Chorus: ILL Bill]\nI put the D in the drugs and the G in the Guns\nI put the D in the dubs and the T in the Thugs\nI put the C in the 'Caine and the P in the Pain\nThe \"G\" in the Game\nPop! Pop! Three in your brain!\n\n[Verse 2: Necro]\nI get impatient like a long bid\nGet so vexed I hit the wrong kid\nShit gets awkward like I'm on a drug and I can't get off it\nBlank out, rip the shank out\nTreat you like Viet Cong\nHit you like the weed in a bong\nYour pussy like a G-string and thong\nYou think I'm sick? Fucked up? Oh am I?\nYou think you can't die?\nDon't think you're crazy cause a year's passed by\nBeat you down with my fucking hands tied\nNow change your attitude\nBefore you get cracked from different latitudes\nBy kids that are mad at you\nThey expect gratitude, I'll strike a foe\nEven if you don't know me you better act like you know\nEspecially if you're soft\nI've earned my stripes like Schwarzkopf\nThe gun I bust off will tear through your clothes like a moth\nYou're sloppy, cuz you start beef and cop pleas\nBut not me!\n\n[Chorus: ILL Bill]\nI put the D in the drugs and the G in the Guns\nI put the D in the dubs and the T in the Thugs\nI put the C in the 'Caine and the P in the Pain\nThe \"G\" in the Game\nPop! Pop! Three in your brain!\n\n[Verse 3: Goretex]\nI rock sickening raps like Woody Allen flares beach hats\nOr John Hinckley run up on politicians with ski caps\nLaser weapons, I bleed coke\nHappiness is like a warm gun\nRun up in your crib slitting your G's throat\nCruise the block whipping UZis and pop\nLosing the cops, whether New Lots or zooming through Watts\nThe newest space suit, love rocking titties like grapefruits\nPhase two, Rasta-ice inverted Jesus\nI'm up in Fatburger, Beck's and codeine\nSo clean, pinstriped gat runners are OG's\nServing the fiends crack, dope and weed\nGlenwood Projects, we living the American dream\nScreaming “hey pelican\" with trains of coke on my cock\nHandlebars like Vivica with nipples and crotch\nWe toured drive-bys on the Mongoose with Glocks\nThis ain't rhetorical, the story gets worse, funny\nYou get shot!\n\n[Chorus: ILL Bill]\nI put the D in the drugs and the G in the Guns\nI put the D in the dubs and the T in the Thugs\nI put the C in the 'Caine and the P in the Pain\nThe \"G\" in the Game\nPop! Pop! Three in your brain!", "image": "https://images.genius.com/fc526dae683e1f19f37ee02105da9a7c.1000x1000x1.jpg", "album": "What’s Wrong With Bill?", "year": "2004-05-04"}]}