{"artist": "Boondox", "songs": [{"album": "The Murder", "title": "I’m A Mess", "year": "2017-03-24", "lyrics": "[Verse 1]\nEarly in the morning still half a fucking asleep\nHalf a fucking hard and pissing on a toilet seat\nAnother day for me to not give a shit\nFeeling like cliche, just rage for the hypocrite\nMy girlfriend thinks that I'm a huge scumbag\nLooking at me like I use her hair for a cum rag\nBut I ain't tripping 'cause she's making good case\n'Cause everytime I pull out, I'm aiming for her face\nMy resumate ends in 2005\nAround the same time that I last had a sex drive\nI mean I still have sex but it ain't driven\nA tampon chomping really satisfy a woman\nInsecurities, lack of maturity\nEvery drug ingested mixed with impurity\nGot me feeling that I've finally reached the ceiling\nDoing something drastic is seeming more appealing\n\n[Hook]\nI'm lost and constantly grieving\nThe darkness is calling me, the voices are screaming\nI'm fallin', I'm fallin' out of control\nThey're callin', they're calling, I can't consult\nSo I'm letting go\n\n[Verse 2]\nPut on the television but my cable's disconnected\nDidn't pay the bill guess it should have been expected\nLook at my phone but there ain't nobody texting\nCheck my social media to add to my depression\nI'm a fucking joke, at least that's what I'm reading\nThey might just have a point, feels that's how they'll ever treat me\nBut I wonder what would happen if I fucking went assassin\nDrag them all down for a little satisfaction\nThe twitter throat slitter, Facebook strangler\nInstagram son of Sam, Snapchat mangler\nMake them all bleed and post it on my timeline\nViral mental spiral cause I'm out of fucking my mind\nA selfie with the victims for my profile pics\nEvery murder more sick to increase page clicks\nA serial killer social media homicide\nCommitted by a lunatic who's more than qualified\n\n[Hook]\nI'm lost and constantly grieving\nThe darkness is calling me, the voices are screaming\nI'm fallin', I'm fallin' out of control\nThey're callin', they're calling, I can't consult\nSo I'm letting go\n\n[Outro]\n\"I've saved my best fun just for you!\nWhere are you David?\nCome hit me!\nI know you're under there, where are you?!\"", "image": "https://images.genius.com/e8156b5abe6d6da62f135b01f8bad398.500x500x1.jpg"}]}