{"songs": [{"lyrics": "[Intro: Dr. Dre + Laylaw]\nYo, what’s up niggas and niggettes?\nN.W.A is back in this motherfucker\nAnd this is only the single\nWait until the motherfucking album comes out\nWe gone have some more of that good shit\nThe shit you just can’t fuck with\nBut yo, we ain’t finished, tell ‘em what’s up man\nYo man, there’s a gang of motherfuckers out there on the dick, man\nIn every motherfuckin' state\nWanna be like, wanna look like, wanna act like\nWanna dress like, wanna sound like muthafuckin' style stealin'\nClone ass N.W.A bitin' ass motherfuckin' everywhere man\nNon-reality seein', non-reality feelin'\nNon-reality livin' ass motherfuckers man\nHey, I don’t know, reality, it’s important to me, man\nSo fellas man, tell these niggas what it’s like in the minds of real niggas\n\n[Verse 1: MC Ren]\nPrisoner like a hostage\nYo, you should of covered your muthafucking head like an ostrich\nDeep in the dirt cause you's a sucker\nAnd you ass up high so I can kick the muthafucker\nDon’t try to hang, you best avoid\nCause my foot will be so far up your ass you’ll get hemorrhoids\nBefore you try to fuck wit Ren\nI'll put two in your ass and you'll be shitting a size 10\n\n[Verse 2: Dr. Dre]\nFirst come, first serve, whoever's got the nerve\nStep up and get what you deserve\nFrom the word of a muthafucking hip-hop maniac\nBrainiac, so what you oughta do is step the fuck back\nNow how the fuck you think a rap will last?\nWit your ass saying shit that is said in the past\nYo, be original, your shit is sloppy\nGet off the dick you muthafucking carbon copy\n\n[Verse 3: MC Ren]\nFalling deep in the drums so many of styles\nIs one of the reasons a nigga ran a hundred miles\nCheating and now beating, the crowd I kept seating\nBut weak muthafuckas biting off and they kept eating\nStyles that kept them full of bull\nCause the vocals were local in nightclubs and not getting paid in full\nThey got the nerve to cuss\nOnly reason niggas pick up your record is cause they thought it was us\n\n[Verse 4: Dr. Dre]\nYo, giving what I gotta give, doing what I gotta do\nYou don't care for me, so who gives a fuck about you\nYou can't harm me, alarm me\nCause we're the generals in this fucking hip-hop army\nThe niggas wit attitudes if you didn't know\nWe blow, flow and getting loose slow from the get go, yo\nTry us and take it\nYo, fuck this shit, Yella, kick the break in\n\n[Hook]\nIt's the real thing, you are now real, real niggas, niggas\n\n[Verse 5: MC Ren]\nYou can run, but you can’t hide, you know I'mma find'cha\nCause a nigga like Ren's only 2 steps behind'cha\nDon’t look back because you’re shaking and all scared\nA nigga in black can be your scariest nightmare\nSo sleep wit the lights on, forget that the mic's on\nDon't step on my muthafucking stage without nike's on\nDon’t say it’s psycho and then you just might go\nMentally fucked up when I let the right blow\n\n[Verse 6: Dr. Dre]\nAll these niggas wit the jibber jabber\nBut couldn't kill a fly wit a muthafucking sledge hammer\nGangstas in black are out there\nBut only because, yo, it’s the shit that we wear\nOn my muthafucking dick\nBut I'mma love it when you drop like a muthafucking brick\nSo, yo, step off, go to bed, cause if you're mislead\nYou get a muthafucking bullet in your forehead\n\n[Verse 7: Eazy-E +  MC Ren ]\nBlack, the good, the bad, the ugly, you see\nA little streetwise nigga, you know me\nRolling wit some real niggas playing for keeps\nBut you muthafuckas know who run the streets\nWit that hardcore hip-hop rap shit\nNow how much harder can another nigga get?\nTrying to be like us, sound like us, dress like us\nAshes to ashes and dust to dust\nSo nigga, nigga, nigga, nigga, nigga, nigga, please\nSince you're on the dick why don't you drop to your knees\nCause I'm a muthafucka that's out to kill\nEazy-E, a nigga that's real\n\n[Interlude: DJ Yella]\nReal niggas, straight off the streets of Compton\nQuick to get in your shit without second thought\nAnd if your ass get smoked, it's my bullet you caught\nSo if you're talking shit about the niggas in black\nBow down to the Kings in Raider hats\n\n[Verse 8: MC Ren]\nThey played out, that's what niggas were chanting\nOne nigga left and they said we ain't happening\nPeople had thought we was finished and then done wit\nBut if you think about it, yo, we really ain't done shit\nYet, so cover your ears and wipe your tears\nAnd quit sniffing all over my dick for new ideas\nAnd when the new record comes, I’ll come like a fucking bomb\nAsking for fucking money, don't buy you a fucking crumb\nYou're on the dicks of four niggas not one\nAnd when it comes to dicks, you don't even have one\nSo brace yourself to make sure you don't get fucked up\nCause if I let you slide, it’s just cause you lucked up\nDon’t come in my face again, because I'mma floor ya\nAnd if you're a bitch, I'm a fucking ignore ya\nBecause my attitude's a little bigga\nCause MC Ren is one of the real niggas\n\n[Verse 9: Dr. Dre]\nLost in a muthafucking world of madness\nSadness, but Dre is just a nigga that glad there's\nSucka muthafuckas like you, making wack jams\nBecause it only shows you how dope I am\nNever try to ignore us\nWhen I'm expressing, stand still like you're full of rigor mortis\nCause I'm a real nigga, but I guess you figure\nYou can break me, take me, but watch me pull the trigger\nDre is just a nigga with heart, a nigga that’s smart\nA nigga that’s paid to say what others are scared to play\nWe started out wit too much cargo\nSo I'm glad we got rid of Benedict Arnold\nYo, N.W.A, criticize for what we say\nBut I'm a do the shit anyway\nCause I'm the muthafucking doctor, never faking\nYo, Yella, kick the muthafucking break in\n\n[Outro: MC Ren]\nN.W.A, straight outta muthafucking Compton\nTaking over shit in all of the 1990's\nYo, Dr. Dre, DJ Yella, Eazy-E\nAnd I am MC Ren, yo, N.W.A taking over this muthafucka y'all", "album": "100 Miles and Runnin’", "year": "1990-05-29", "title": "Real Niggaz", "image": "https://images.genius.com/2fe86712465fd594990ed18b9142f78e.600x600x1.jpg"}], "artist": "N.W.A"}