{"songs": [{"lyrics": "[Intro]\nB-I, what up?\nLong as I got a voice, you got a voice my nigga\nYessir\n\n[Hook]\nBK stand up, Brooklyn throw your hands up\nIf you with me, lick a shot for Biggie\n\n[Verse One]\nChillin' in the spot in my B-Boy stance\nDon't make this four-fifth kick like Bruce Lee roy pants\nYou know I'm smarter than Spock, for Leonard Nimoy fans\nSo this aluminum will foil your plans, that's how I'm doin' em man\nI keep two in hand, in case I've been drinkin'\nSeeing double, I got one for you and your twin\nI got a nickel for your thoughts, make your blood trickle\nLeave your smarts on the sidewalk, 'til the cops come and get you\nI'm done playin' with you\nThe guns sprayin' with or without you\nMake your body whistle without you, Young!\nI'm still official without you\nStill that nigga all the bitches whisper about, ooh\nHe's so terrific, his lyrics like it's about you\nYou can't tell me that everything he spits that it's not true\nI'm from a crack in the wall, a fighter with my back against wall\nTook a lighter, left my name in the hall, Young!\n\n[Hook x2]\n\n[Verse Two]\nGrew up on Lexington Ave, my socks real high\nMoved to the Marcy Projects 'round the time I was five\nHad a great-grandmother in the heart of the 'Stuy\nSo on the Fourth of July, we would always stop by\nMan, I ran through the bush, bought pounds from \"the dreads\"\nThey had the best beef patties and cocoa bread\nPlayed the Albee Square Mall 'round the time I was gettin' tall\nWhere niggas would snatch your pockets, leave your change on the floor\n18 regime round then, Pink houses, Fort Greene niggas they ain't blend\nWasn't safe on the A train, D, G or the F\nDecepticons, Lo-Life niggas snatch the Polo off your chest\nEast New York, Bushwick, fuck it, the whole BK\nBrownsville, where the warriors come out to play\nNigga you better roll deep goin' through Coney Island\n'cause it's one way out, nigga, one way in, nigga\n\n[Hook x2]\n\n[Verse Three]\nEverywhere you go, Brooklyn's in the house, if you soft tuck your chain\nThe crooks is in the house, yes, the jooks is in route\nThe drama's on the way\nStare downs first, then the llamas gon' spray\nMomma's gon' pray\nBut we respect real, you act like a sheep, you gon' be the next meal\nThe wolves is on the job\nGotta get in where we fit in\nNot rid the show and the kids is growing\nBaby need new shoes, and you sitting on 22's\nAnd we got guns big as Samoans\nAnd you in the spot showing off like Terrell Owens\nHell I'm on this nigga\nYou better hold your ground, if you a straw house\nThen the fours will blow you down and its back to the home town, yes!\n\n[Hook x2]", "title": "BK Anthem", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": "2008-12-03", "album": null}], "artist": "JAY-Z"}