{"artist": "​​wifisfuneral", "songs": [{"year": "2013-09-17", "lyrics": "Verse 1:\nWriting threw blood printed  syllables with these sinister equals with holy matrimony individuals, blessed with presence of legends\nThey tried to catch my nigga jacob slippin', he beat them charges, we winning\nIts 10 o'clock on the strip these niggas touch the work its hard as it gets\nI was just a by stander couldn't touch that yola so i threw these coke bars on a rhyme pattern feels like im fighting with the face of Medusa\nMy hearts stone cold out of place and in grooved with no movement i get aroused when you moving and when im talking im highly irrelevant and stupid\nAnd as you clutchin' with clutches, discussin' discussions about a past memory that never meant nothing, you catch my bluff when talking im a disappointment to the youth when walking when you see him? you off him\nMe against the world book one i write my chapters threw scapple's, posted on the corner smokin' blunts with bastards as my niggas whats the mathematics, more then 3 commas? we at it! never was with the funny business, smack the fuck out of a faggot if he honey dippin', i told the label suck my dick and cut the check! i got his wifey jackin' my dick i suck on her neck\n\nHook:\nNigga take it how you want it since its mental suicide i cover my face like tom cruise in my vanilla sky, mentally ill shit i had to die love for the profit with greed in my eyes\n\nVerse 2:\nYo, i blow this piff to the sky sit in disguise from the life, packed tobacco in my pocket, wheezing and coughing im offing my ego when tossing the blade switch heel flip personalities often talking when jotting down thought when walking\nI use to thrw up that triple 6 sick shit, its young LaFlare from the H-e-double hockey sticks\nCaught in my darkened days while sparking the haze, dead inside for amusement, snort it up? use to it\nIm like a vivid vision, young basquiat's offspring minus the heroin addiction a diamond in the rough hold my nuts while your bitch is on my tip get a call from capo tell the bitches what it is, scavenger screwing, dont come my way youngin' get popped right out your patrick ewings!\nBlend in with a fucking coffin while weed tree coughing you see me when you see these lowlifes walking\nWriting threw the blood of a poor minority niggas say one word its nothing more of them or more with me\nYou see these darkened eyes? full of love which you despise? well i was dancin' with the devil reschedule the date and time\nProtect you neck while i step all up in your bitches section catch an erection while its 25 to life im sentenced\nIm just a mind fragment of an illusion cruising putting my 2 cents to your dollar use it\nMayby you'll get rich with an finger itch.. my palms sweaty im greedy with imagination thats benjamin chasing.. nigga", "image": "https://images.genius.com/191244590c3fb278cb86e7191b0b2a53.593x593x1.jpg", "album": "Six Hundred & Sixty 6 - EP", "title": "Hmm"}]}