{"artist": "Casey Veggies", "songs": [{"title": "Remember Me", "album": "The Odd Future Tape", "year": "2008-11-15", "image": "https://images.genius.com/95006fc0c5c08dc0b6ea167151ba467a.1000x1000x1.jpg", "lyrics": "[Verse 1: Casey Veggies]\nCV, CV, CV, Remember me? Same lil' nigga that was out JV\nWhy my momma call me crazy? Why me daddy call me lazy?\nUh, sorry. I can't change. Lookin' at life, these dark frames\nCocaine, A fiend. I'm advanced, AP\nThat's why the cameras take me\nI'm everything that they see, you blind niggas hating, I'm overlapping handclapping, more fame, more action\nSo nigga what's happening?\nSo nigga what's happening? (So nigga what's happening?)\n\n[Bridge 1: Hodgy Beats]\nEver had a dream and you end up living it (Nah)\nHow have you changed? (Changed) Seems that I'm getting it\nThis lifestyle, I'm wild, just switching it (Yep)\nThey think Alzheimer's they forgettin' it (Why?)\n\n[Hook: Hodgy Beats]\nDon't you remember me? (Nah)\nDon't you remember me? (You Should)\nDon't you remember me? (Nah)\nDon't you remember me? (They should)\nDon't you remember me? (Nah)\nDon't you remember me?\nDon't you remember me? You better remember me!\n\n[Verse 2: Tyler, the Creator]\nA, C. Remember me? Fuck you. (Uhh...)\nStill a rapper, no chain. Still skate, Nollie Tre\nGot a couple aliens get in the zone\nAnd them lames still trying to get the number of phone\nAll up in MySpace tryin' to get in my space\nI gotta tell these faggots to leave me alone\nSame asthma, different flare\nSame inhaler, different air\nSame truth, a different dare\nSame club a billionaire\n\n[Bridge 2: Hodgy Beats]\nTrillionaire, Gazillionaire, too much to share\nWe don't care, ain't going nowhere\nWe right here, a knife to spare. We just don't want to share\n\n[Verse 3: Tyler, the Creator]\nI got a couple bucks, what the fuck should I buy for lunch?\nDonuts? 'Preme beanie? I'm Billie Holiday's needle\nShoot that shit, your armor's great. That rasta bitch, you got a date\nIt starts at 8, a one night stand, your dinners here. (Cut the stake)\n\n[Bridge 3: Tyler, the Creator]\nRemember Shock One's Team, we mob deep\nCouple odd niggas are, rolling down your street\nHell hath no fury when me and the devil meet. Does he remember me?\n(Does he remember me?)\n\n[Bridge 1]\n\n[Hook]\n\n[Verse 4: Casey Veggies]\nAh, ah, ah, I, I, I said hold on. Press flash. Had dreams to get cash\nThat shoebox is my stash, my first thought never comes last\nSo when you see me, make sure that you wear your 3D's. This is the C.D. Who you? Beats me\nHomie you can't beat me, I'm gone you can't see me\n(You cannot see us)\nI'm gone you can't see me\nI said, I'm gone you can't see me\nWhen I pull up homie, I'm gon' fly off in that G3\n\n[Outro]\nYeah.. Yeah man we see it. I mean, we the same niggas you knew..\nThe only difference is.. got a little more money in our pockets\nCouple more friend requests.. Couple handshakes.. nothing major\nWe got smiles on our faces.. Remember me?\nRemember me?"}]}