{"songs": [{"year": "1991-08-27", "image": "https://images.genius.com/40f66b653cd7b106d8dea9f33eac5a75.598x598x1.jpg", "title": "Kung Fu", "album": "I Need a Haircut", "lyrics": "Once about a time there was a kid\n\nWho didn't have a bicycle or a car that skid\n\nOnly thing he had was Pat and Turner\n\nHe didn't know the future but the lesson to learn-ah\n\nWay to get started in the music biz\n\nJust listen to the story as I tell it like it is\n\nI was a youngster from East Junior High School\n\nWho thought somebody with Adidas sweat-shirt was cool\n\nIt symbolized somethin, but I don't know\n\nI wanted to be down really really bad so\n\nI asked one of my best friends Derek Mangareu\n\n\"C'mon man can I be down can I be down witcha crew?\"\nHe had one by the name of Masters of Control\n\nI wanted to be down, so I could play the role\n\nHe said, \"No you're not good enough we have ours Mark\"\n\nI went home and sat in the room with no lights in the dark\n\nAnd this is gonna be a rough rendezvous\n\nAnd that's why I sing this song to you\n\n\nI'm a lonely soldier.. yeah..\n\nMany miles from home..\n\nWith a heart that's heavy..\n\nAnd with.. a will that's strong\n\n\nI got a little older, three years to be exact\n\nWhen a crew named Midnight Express gave me a crack\n\nIt consist of one MC and two DJ's\n\nAnd the way Kevin D cut had me amazed\n\nIt was like I just joined the Lakers\n\nOr even Rock Steady or the New York City Breakers\n\nI was in 11th grade, at ?? High\n\nThey was sayin they was sayin hey what's wrong with this guy\n\nBecause all he do, is bang on tables and mumble\n\nAnd doin music with his mouth like a band ensemble\nOr the human beatbox wasn't thought about\n\nAnd the teachers they thought I was crazy without a doubt\n\nI guess they didn't understand what I was comin from\n\nSince I was into MC'n, they thought I was dumb\nThen there was a teacher by the name of Ms. K Parke\n\nSince I was good at rememberin numbers she said I was smart\n\nBut that don't got nothin to do with this rendezvous\n\nAnd THAT'S why I sing this song to you!\n\n\nI'm a lonely soldier.. yeah..\n\nMany miles from home..\n\nWith a heart that's heavy..\n\nAnd with.. a will that's strong\n\n\nI was a walkin son of a gun before the day I begun\n\nI'mma tell you how it started, from day one\n\nWell me, I lived in ]??[, they lived in C.I\n\nI was ambitious and devoted til the day I'd die\n\nI used to get on Fair Islip, take the S-42\n\nGet off at Bunanan Street, and go to the house of the crew\n\nI would walk from C.I., to Bay Shore\n\nJust to see if I really had the rhymes galore\n\nI'd go to house parties here, go to house parties there\n\nWalk the ?? ?? pants off my derriere\n\nLike if I was David Carridine who played \"Kung Fu\"\n\nWho would walk from China to Japan without a shoe\n\nHummin beats, sayin rhymes, kept me goin\n\nFrom givin up or bein crazy, or just stop flowin\n\nMy teachers and parents said, I should just stop\n\nJust go to army go to college get a job witcha POPS?!\n\nI can't take no more of this rendezvous\n\nAnd that's why I sing this song to you!\n\n\nI'm a lonely soldier.. yeah..\n\nMany miles from home..\n\nWith a heart that's heavy..\n\nAnd with.. a will that's strong\n\n\nI'm a lonely soldier..\n\nMany miles from home..\n\nWith a heart that's heavy..\n\nAnd with.. a will that's strong"}], "artist": "Biz Markie"}