{"artist": "Yung Gravy", "songs": [{"album": "Sensational", "image": "https://images.genius.com/fcce98819925bcd9bee2eb3729176ce7.1000x1000x1.jpg", "year": "2019-05-31", "lyrics": "[Intro: Yung Gravy]\nPlay me some pimpin', mane\nJason Rich on the beat, bitch\n\n[Chorus: Yung Gravy]\nI said, hey, Mrs. Buttersworth, ooh, baby\nYou got ass, come and show me what it's worth (Ayy), ooh (Ayy)\nI said, hey, Mrs. Buttersworth, come on, baby\nYou got ass, come and show me what it's worth, I'm Mr. Buttersworth\n\n[Verse 1: Juicy J]\nI was on the purp (Purp), chased it with the syrup (Syrup)\nGot you buttered up (Up), you know what I'm worth (Worth)\nRent due is the first (First), you want that new purse (Purse)\nFirst you gotta ride for me, throw it in reverse (Throw it)\nOpen up your legs (Spread 'em) like you giving birth\nIntroduce you to new positions, now you diverse\nYou was talking big shit, now you in there lost for words\nBut you the, you the best even at your worst (Ayy)\nDoubled up my doses, got me up four from my nurse (Ayy, ayy, ayy, ayy)\nI finessed the docs for the scripts like it's rehearsed (Ayy, ayy, ayy, ayy)\nFill you up for breakfast then I send yo' ass to work (Ayy, ayy, ayy, ayy)\nBig blunt of Gelato and Wedding Cake for dessert (Ayy, ayy, ayy, ayy)\n\n[Chorus: Yung Gravy & Juicy J]\nSaid, hey, Mrs. Buttersworth, ooh, baby\nYou got ass, come and show me what it's worth (Ayy), ooh (Ayy)\nI said, hey (Shut the fuck up), Mrs. Buttersworth, come on, baby\nYou got ass, come and show me what it's worth, I'm Mr. Buttersworth\n\n[Verse 2: Yung Gravy]\nAy, you got me going crazy with the ass so fat\nHave mercy (Have mercy), don't you dare make it clap\nGot me hot and bothered by the smell of flapjacks\nGirl, it's seven in the morning, why you got me throwing racks? (Ayy)\nMiss Buttersworth, you're all that I imagine\nAnd you really got that fucking wagon\nWake up every morning and you got that shit clappin'\nGot damn, Gravy, why you gotta keep snappin'?\nMiss Buttersworth, you the perfect lady\nWhen you tuck me in got me feeling like a baby\nOoh, damn, girl, why you so tasty?\nSpread a little butter on the biscuits and the gravy\n\n[Chorus: Yung Gravy]\nHey, Mrs. Buttersworth, ooh, baby\nYou got ass, come and show me what it's worth (Ayy), ooh (Ayy)\nI said, hey, Mrs. Buttersworth, come on, baby\nYou got ass, come and show me what it's worth, I'm Mr. Buttersworth\n\n[Outro: Juicy J]\nShut the fuck up", "title": "Buttered Up"}]}