{"songs": [{"title": "BOOM!", "album": "Lil Boat 2", "year": "2018-03-09", "image": "https://images.genius.com/c5ccfc3f04970ad45b0bbde6ea1fa1ac.1000x1000x1.jpg", "lyrics": "[Intro: Lil Yachty & Ugly God]\n30, you a fool for this one\nRun it up, mhm\nI finally realized why you niggas hatin'\nNiggas ain't gettin' no money, man\n'Cause when you ain't gettin' no money, you know what I'm sayin', like\nYou know what I'm sayin', stressed out, you know what I'm sayin'\nYou stressed out when you get no money\nWe stressless over here, niggas is stress free\nYup, ayy, yup, ayy, yup, ayy\nYuh, yuh, yuh, yuh, yuh, yuh, yuh, yuh\nYuh, yuh, yuh, yuh, yuh, yuh, ayy, yuh, yuh yuh\nYuh, yuh, yuh, damn, yuh, okay, yuh\nYuh, yuh, yuh, yuh, yuh, yuh, yuh, yuh\nGod, Boat, God, Boat\n\n[Chorus: Lil Yachty]\nAnd that lil' car go fast (Fast) and that lil' car go zoom (Zoom)\nThat lil' bitch got a fat ass (Ass), took that lil' bitch to the room (Whoo)\nMy niggas walked in with sticks (Sticks), my niggas walked in with brooms (Brooms)\nTry to take one of my chains (Yeah), all you gon' hear is a boom (Boom)\nBoom! Boom! Boom! Boom! (Damn)\nBoom! Boom! Boom! Boom! (Grr)\nDon't give a fuck 'bout your clique, uh\nY'all can get hit with the boom (Boom)\nDon't give a fuck 'bout the bitch, uh\nGive her the dick, then I zoom (Skrr)\n\n[Verse 1: Ugly God]\nI'm like \"Whoops\", huh, I might peel off in a coupe, huh\nNigga better not take my chain, huh, blow that bitch up like a nuke, huh\nI do this shit for my mama, my mama told me don't forget 'bout my roots (Huh)\nI just been countin' my commas, talk down I'ma stomp that boy out in my boots (Huh)\nHop in the whip and go vroom, nigga talk down, I go boom\nI won't even break a sweat, I'ma just call up my goons\nGet yo ass gone for the low, my shooters gon' ride to the Moon\nThen I'ma fuck on ya ho, take that bitch back to the room\nAyy, I'ma shoot shots if you talk down on my name\nI don't miss shots, but my choppa got aim\nOld money, but it don't walk with a cane\nVVS diamonds, just talk to my chain\nYeah I beat her back out, it get knocked out the frame\nFuck my old whip, had to cop me a Range\nShe don't fuck with me right now, but as soon as I drop\nGuarantee she gon' fly for the fame\n\n[Chorus: Lil Yachty]\nAnd that lil' car go fast (Fast) and that lil' car go zoom (Zoom)\nThat lil' bitch got a fat ass (Ass), took that lil' bitch to the room (Whoo)\nMy niggas walked in with sticks (Sticks), my niggas walked in with brooms (Brooms)\nTry to take one of my chains (Yeah), all you gon' hear is a boom (Boom)\nBoom! Boom! Boom! Boom! (Damn)\nBoom! Boom! Boom! Boom! (Grr)\nDon't give a fuck 'bout your clique, uh\nY'all can get hit with the boom (Boom)\nDon't give a fuck 'bout the bitch, uh\nGive her the dick, then I zoom (Skrr)\n\n[Verse 2: Lil Yachty]\nDrop and roll (Ooh, ooh), death row (Ooh)\nI bought six cars before 20, uh\nGave her that dick, now she love me (Ooh)\nGave her that dick, now she love me\nLean in the glass, like it's bubbly, huh\nThese niggas hate that I'm rich, huh\nThese niggas hate on my bitch, yeah (Guck it)\nFuck with that fuck up (Damn)\nFuck, then I dip, 'cause she stuck up (Ooh)\nCrowd hands up like a stick-up (Yeah)\nHit the flick of the wrist, huh\nBank on Lemony Snicket, huh (Ooh)\nIce on my neck, cost a ticket, huh (Ooh)\nYour career rocky like ridges, huh (Ooh)\nTest me, you gon' need some stitches\nThat goes for any of you bitches (Lil Boat)\nChopsticks (Ooh), nigga, get beat up in the moshpits (Yeah)\nLeave a nigga lumpy, like cheese grits (Yeah)\nDick 'bout as long as four fish sticks (Ooh)\nMiddle finger to a cop, racist pig that can suck on my cock\nBig rocks all inside of my watch, that's not a Rolex, my nigga, that's Swatch\n\n[Chorus: Lil Yachty]\nAnd that lil' car go fast (Fast) and that lil' car go zoom (Zoom)\nThat lil' bitch got a fat ass (Ass), took that lil' bitch to the room (Whoo)\nMy niggas walked in with sticks (Sticks), my niggas walked in with brooms (Brooms)\nTry to take one of my chains (Yeah), all you gon' hear is a boom (Boom)\nBoom! Boom! Boom! Boom! (Damn)\nBoom! Boom! Boom! Boom! (Grr)\nDon't give a fuck 'bout your clique, uh\nY'all can get hit with the boom (Boom)\nDon't give a fuck 'bout the bitch, uh\nGive her the dick, then I zoom (Skrr)\n\n[Outro: Ugly God]\nSkrr, skrr, skrr\nSkrr, skrr"}], "artist": "Lil Yachty"}