{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Hold It Down", "image": "https://images.genius.com/35dc92a2bcff8d7abfc69f96f332730b.1000x1000x1.jpg", "lyrics": "[Produced By J. Cole]\n\n[Verse 1]\nIf my heart stop pumping tomorrow don’t feel no sorrow\n'Cause life is hard mentally and everything is meant to be\nSometimes I ask myself If I was gone who will remember me?\nIt's hard to tell oh-well sit back and sip this Hennessy\nNow lately it's been hard to tell my friends part from my enemies\nCuz plenty niggas show me love but in their hearts they envy me\nWhy? I'm just a nigga from around the way\nTold my momma I'll make it happen and I found a way\nPour out some liquor for my niggas at the crossroads\nAnd may the Lord give guidance to the lost souls\nI know that deep inside these niggas know it's more to life\nThen mackin' hoes and stacking dough\nMan I'm sort of like a nigga who done seen greener grass\nSo when they think they ballin' like The Dream Team\nMy nigga I done seen meaner cash\nAnd I'm tryna get it, follow me nigga I'm on a prowl\nHeaded to the top! You watching me nigga?\nThen hold it down\n\n[Chorus]\nHold it down, if you need to holla at me\nDon’t hesitate to call it ain't a problem\nI can be there I’d ride for you, lie for you\nI know you’d do the same, I will die for u\nSo hold it down, when the times is hard, I’ll be around\nSo hold me down and it don’t matter how far I’ll be around\nYea, I'll hold you down\n\n[Verse 2]\nYou were my nigga from the younger days, we grew up\nI went to school you went the other way\nBut still my brother man, I'm sitting, reminiscing on\nAll of them bitches we were tripping over, kissing on\nOr at the skating rink we trying to bag some new hoes\nAnd If I need gear, you let me hold ya new clothes and vice-a-versa man\nBut now that life is worser man a nigga slow caking\nI'm broke tryna chase a dream, you just got probation and I'm stressed\nYour little sister pregnant what’s next?\nOh shit my mama doing drugs, at times it's hard to feel blessed\nIn this madness I holla at my nigga in the sadness\nRemember when ya mama tried to beat you with that bat shit?\nRemember your chick Nina man that ass was the fattest\nRemember my crush on Sabrina? yo, she still the baddest!\nI'm just glad that I can holla at you, it's been a while\nAnd til the next time I hear from you, ay, hold it down!\n\n[Chorus]\nHold it down, if you need to holla at me\nDon’t hesitate to call it ain't a problem\nI can be there I’d ride for you, lie for you\nI know you’d do the same, I will die for u\nSo hold it down, when the times is hard, I’ll be around\nSo hold me down and it don’t matter how far I’ll be around\nYea, I'll hold you down\n\n[Verse 3]\nAnd these are tough times baby but we’ll make it through\nYou know I'm headed for the top I swear I'm taking you\nJust hold a nigga down through this bad weather\nThe rain falling ain't balling but I have better\nA women with an ass and a strong mind, it's been a long time\nSometimes you on your bullshit, sometimes I'm on mine\nWill I have a hard time to stay committed?\nOr do I only want your voice moaning when I hit it?\nMan only God knows\nI know deep in your heart you don’t want me to be no star though\n'Cause groupies out there every show you scared I'm fucking every ho\nAnd girl I ain't gon' lie and say I won't 'cause shit you never know\nBut may the Lord give me strength, I love you more than anything\nThe future mother of my kids, the love is real and if we ever part God forbid\nI love you still so when I'm on the road don’t trip, you know im down for you\nKeep it tight and don’t slip, and hold it down for me\n\n[Chorus]\nHold it down, if you need to holla at me\nDon’t hesitate to call it ain't a problem\nI can be there I’d ride for you, lie for you\nI know you’d do the same, I will die for u\nSo hold it down, when the times is hard, I’ll be around\nSo hold me down and it don’t matter how far I’ll be around\nYea, I'll hold you down"}], "artist": "J. Cole"}