{"artist": "C-Rayz Walz", "songs": [{"title": "C-RayzWalz", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nLadies and gentlemen and you know, uh, and everybody else.  Hehe.  In this corner, same cats that [?].  (Weighing out of the first...).  This is not, important, man.  [?].  All of you do know very well who I am.  Now...\n\n[Verse 1: C-Rayz Walz]\nIt’s been a long time.  I shouldn’t have left you\nBut I was babysitting my nieces and nephews (Oh)\nLabels’ll pay you two cent for them hood rhymes\nLast time I wanted a Penny, I was watching Good Times\nYou ain’t popping.  If so, we soon to see, liar\nFlame off the top.  I pour water on your Kundalini fire\nIn my spare time, what I write’ll make you fear mines\nEach rhyme sharp like parts of Grand Puba’s hairline\nI’m a soloist—I hurt teams most\nAnd get the whole house shook like Thirteen Ghosts\nNo, fuck that!  I’m tired of this buck-rap.  Hip hop slug\nThugs knocked the fuck out—fuck ya love tap\nThis is the round trip ticket—you’ll catch a bus back\nI train where I conduct jacks, so don’t get stuck, black\nActing like it can’t happen, you’ll owe me a plaque\nLike the Lakers ain’t still got Kobe and Shaq\n\n[Hook: C-Rayz Walz]\nThey call me C-Rayz Walz.  Clashing, mashing, splashing\n(Is he nice?)  Man, who you asking?\nC-Rayz Walz.  Spilling it, killing it\nYou feeling it?  Any show I get, I’m stealing it\nC-Rayz Walz.  Hip hop.  Rip shot\nGet rocked.  Let ‘em know that I came to rock\nC-Rayz Walz.  And I shined before I signed a deal\nAnd you know I’m real\n\n[Verse 2: C-Rayz Walz]\nThe reason my form is complete and sick\nMy style was born spored on a Petri dish\nIn a room with microchips, blips, and math quotes\nAlien graffiti on my lab coat!\nBut now I spit hard, rip these bars and simply sell\n‘Til I hit rock bottom like an empty well\nThis is for the love, but I do profit\nWhile y’all cats is sooner to get Junior than Lou Gossett\nWhen I blacked out like dark-skinned brothers—those you kill (No!  No!)\nI see the price of paper—it’s poems for sale\nIf you too shook to get busy\nI’ll punch you in the stomach, make the butterfly dizzy\nTelepathy’ll make your clique about faith\nTryna play me like the monkey in Outbreak\nThis A&R try to tell me who I should rhyme like\n[?].  His shell toes have five stripes\n\n[Hook: C-Rayz Walz]\nThey call me C-Rayz Walz.  Clashing, mashing, splashing\n(Is he nice?)  Man, who you asking?\nC-Rayz Walz.  Spilling it, killing it\nFeeling it?  Any show I get, I’m stealing it\nI'm C-Rayz Walz.  Hip hop.  Rip shot\nGet rocked.  Let ‘em know that I came to rock\nC-Rayz Walz.  And I shined before I signed a deal\nAnd you know I’m real\n\n[Verse 3: C-Rayz Walz]\nStand up, hands up, touch ceilings\nHeadphones in your ribs—listen to your gut feelings\nRevealing questions.  Do you have answers?\nNo.  You’re Dorothy.  I’m the hurricane in Kansas\nI’m blessed.  Don’t make me put the speakers to your chest (Boom, boom)\nForce you into cardiac arrest\nTurn clubs to paper, leave stages ripped up\nAlbums are special ed kids—they gotta be picked up\nMy shadow superior (So?).  I scheme on crews\nWith enough skills to make the village voice scream on you\nViolate your rights.  Then the bragging ends\nPut two in you bitch niggas like you having twins\nI don’t care what you seen or heard.  In fact\nI’m C-Rayz Walz, off the bean curd rack\nAnd you wack acts is lame.  It’s a shame—admit it\nI could write a whole album off the brain in five minutes\n\n[Hook: C-Rayz Walz]\nThey call me C-Rayz Walz.  Clashing, mashing, splashing\n(Is he nice?)  Man, who you asking?\nI'm C-Rayz Walz.  Spilling it, killing it\nYou feeling it?  Any show I get, I’m stealing in it\nI'm C-Rayz Walz.  Spit hard, rip bars\nGood God.  Let ‘em know that I’m on my job\nI'm C-Rayz Walz.  And I shined before I signed a deal\nAnd you know I’m real"}]}