{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/ee48edb7d205895392bbf636ad4893a1.1000x1000x1.jpg", "title": "Dear Slim Part Two (True Story Remix)", "year": null, "album": null, "lyrics": "(Chorus)\nLa la la la la la la la\n\n\"Hello? Yeah man, I don't mind\nWell, had a chance to go to the music awards. And I was in hope of getting a chance to meet Eminem. And I had KJ's CD with me, yours, and the Lord opened up the door for me to be able to meet him. After he won an award he was backstage with his bodyguards around him and they were pretty much keeping people away from him.\"\n\nDear Slim, I wrote you but you still ain't callin'\nIt's been like 3 years since I wrote that song and\nA lot has changed now for you and I\nI had no clue that I would write a song for you and it would change my life\nKids with tears in the eyes still come up to me\nShowing love to me and telling me that they look up to me\nStrangest thing I seen recently has come to be\nThat I'd get dissed for saying what Jesus done for me\nBut there's a whole 'nother side of things I've come to see\nStill a huge influence you got upon this industry\nBut enough of me cause it's not what I came to say to you\nSorry now for what your mom and dad did to you\nA lot of kids relate with you, cause really they've been there too\nI know there's a lot of pain and hurt now that you've been through\nBut there's still a real love that God has gave to you\n\n(Chorus)\nLa la la la la la la la\n\n\"I just kinda prayed, I said, 'God give me a chance to give him this CD.'\nI had a chance to walk up to him and I said, 'Hey Eminem, you don't know me. But uh, you know that song Dear Stan you did?' He said, 'Yeah.' I said, 'Well there's a guy that's written a song to you kinda based the same way. It's called Dear Slim.' He said, 'What's he doin, dissin me?' I said, 'No.'\"\n\nDear Slim, I wrote you but you still ain't callin'\nI met the guy who backstage gave you my song and\nI'm still wondering what you thought man\nWhen he walked up to you and talked to you and left the CD in your hands\nYou might've listened to it, or you might've lost it\nSome say you heard it probably got mad and tossed it\n\"Well did he hit you back?\"\nWell that's the question that I always get\nBut I know ya wife heard it and at least I know that she liked it\nBut congratulations on your movie yo and I heard your record sales is like over 20 million sold\nBut there's one thing that's really got me thinkin' bro\nDoes a Grammy mean anything if it's just gotta cost your soul?\nI thank God for the love that never goes away\nI was going to Hell but it didn't have to be that way\nYou see the bottom line of what I always say\nIs that God puts back the broken pieces that were thrown away\nIf everyone you know just up and goes away\nHe'll still love you till the very day that you're old and gray\nStill a lot of Christians, all they do is hate on you\nInstead of dropping to their knees and taken time to pray for you\nIt's obvious that you really love your daughter, dude\nAnd for that I gotta say, well, I got respect for you\nBut here it is, Dear Slim Chapter Part 2\nFrom another cat still trying to make it just like you\n\n(Chorus)\nLa la la la la la la la\n\n\"I said, 'Nah man, it's actually the opposite. He's actually showing you a lot of respect and love. There's a message of hope that he's giving you. If you don't mind I would like to give you one of his CDs.' He said, 'Man I'll take it.' He took it and we sat there and talked just a little bit more. Thing is, I don't know if he ever heard it or not.\"\n\nDear Slim, hear the junk that I'm goin' through?\nMTV's hating on me and saying that I'm biting you\nVH1 jumped in and started ripping on me too\nIt's so obvious they seem to get my song confused\nI'll admit what I've said could sound funny\nBut I never came at you just to paint you as the enemy\nI was never hating your or starting controversy\nI was never blaming you and trying to make some money\nSee I don't claim to know everything that you've experienced\nAnd I guess by now, well, you've already been hearin' this\nBut in my life there is one thing I hold is this\nIs that a life without Christ is still a life that is never fixed\nI'll admit it's a hard pill to swallow\nThat you and I these days will always be the role models\nYou see these kids, we're the ones that they always follow\nWhat we say and how we live gives them a better tomorrow\nI've had my share of sorrow, plus man I've been rejected\nI've been chewed up, spit out and plus disrespected\nBut if I die today and never sell another record\nJesus gave me more that I ever could have been expecting\nLife is hectic it can leave you blown away\nBut check it bro, man, we call just gonna die someday\nAnd n that note well there's one thing left to say\nIs that it's still one love and one God and only one way\n\n(Chorus)\nLa la la la la la la la\n\n\"I said, 'He's showing you a lot of respect, a lot of love. This is a message from God to you through him. I'm just asking will you just take it and listen to it?' He said, 'Yeah I'll take it.' So he took it from my hand and I prayed, 'God use this and bless this moment to encourage Eminem into a relationship with you.\""}]}