{"songs": [{"album": null, "image": "https://images.genius.com/4044a4e2bb3bded0a2513112554143c0.747x747x1.jpg", "year": null, "title": "Welcome to California", "lyrics": "[Hook: repeat 2X]\nWelcome to the Golden State\nWest Coast California where the one time hate\nBloods, Crips, esés quick to regulate\nLowride and hit switches till the bumper break\n\n[Verse 1]\nUh, yeah\nI'm leanin' back in my Chevy Impala hittin' the curb\nSwooping up all the homies see my dogs so I swerve\nTo the left on 3 wheels\nY'all know the deal\nGot the spokes with the chrome grill\nWith hydraulics\nHittin' switches on a day-to-day\nFrom Compton, Carson, Inglewood, down to the Dirty Bay\nRidin' the Cali way\nDippin' initiating sparks on the interstate\nMusic blastin' and \"California\" written on the license plate\nI love the Golden State\nSunny skies and the palm trees, beaches and lowriders\nSinging songs like the Eastsiders\nSayin' \"What? What? Uh? Yeah?\"\nStraight outta of the land of the unforgiven\nHomies in prison wishing they ain't had three strikes\nBut this Cali thug way of livin' got 'em twenty-five to life\nIt's rags and bandanas, Chuck Taylors, Dickies and thug grammar\nG's full of their evil ways like Santana\n\n[Verse 2]\nFrom Long Beach down to West Convina\nInglewood, Riverside, Palm Springs, Hollywood down to Pasadena\n'Frisco, Oakland down to the Marina\nSac-town and San Jo back to Catalina\nYa gotta love it y'all, the sunny weather\nNo sweaters or leather\nJust mink brims and a pimp feather\nThe land of superstars and nice cars with chrome tires\nAnd bad traffic backed up for miles\n[But we] still rollin' til the wheels fall off, gotta floss\nIn the Benz or Escalade\nNo need to playa' hate\nThis killa' Cali where gangstas rally and tally\nThe murders, in streets or alleys\nFrom the Projects to the Valleys\nChuck Taylors, khaki suits, skip the wind breakers\nThis California, home of the three time champ Lakers\n\n[Announcer]\nRobert Horry passes it over to Shaq, Shaq out to Kobe, behind the three point line...\nIt's good!!!\n\n[Verse 3]\nI'm from the land of drive-bys and acmatics\nThug lords, Blood and Crip riders and drug addicts with bad habits\nCharismatic with automatics and bandits holding these cannons\nIt's scandalous how they be dumpin' til' the last man standin'\nThat's why, gotta get to preachin' while they still alive\nCuz tomorrow not promised specially where them hollow points fly\nIt's do or die in the Golden State\nMost riders regulate off of the smallest things\nLike Red or Blue colors, then catch a case\nIt's California though, I love it like the riders do\nPoppin' our collars, dippin' in Impalas, dog I'm stayin' true\nThrow up the \"W\", this here's the anthem\nFor every ghetto, projects, neighborhood and street alley\nWhere guns be clappin'\nWhere they packin' a Mac or Magnum, braggin'\nHow they be jackin', attackin', smackin'\nTakin' action just to get reaction\nC-A-L-O-F-O-R-N-I-A\nWelcome to Frisco, Sacramento and the streets of L.A\nThis is the killin' fields, y'all!\n\n[Hook: repeat 4X]"}], "artist": "T-Bone"}