{"songs": [{"year": "2013-10-25", "album": "S.C.O.T.", "image": "https://images.genius.com/84085e89142cb021fb85634062e40a2b.700x700x1.jpg", "title": "Life Is", "lyrics": "[Hook]\nTi-ti-time ticks and it's going quite quick\nBut li-li-li-life is exactly how I write this\nTi-ti-time ticks and it's going quite quick\nBut li-li-li-life is exactly how I write this\n\n[Verse 1]\nCouple of stacks on clothes a week\nEven though I get clothes for free\nThinking about my aim in life\nAiming high to the rainy sky\nStarted with nothing, watch it grow\nVoice if the street, better lock and go\nDo it for the ones you look down on, and put a frown on\nBut you out and you found a\nSolid gem, call it diamond 'cause it's shining\nAnd if I went from a siren to an island I'd be violent\nBut I'm out here chasing dreams, I ain't got no time to stop\nA darker night just means brighter days around the block\nNever stop you, chase your dream\nTake it from me, you can make it clean\nIdolised from state to state\nLife on the line, it's make or break\nYoung Timmy got stabbed for an iPhone 4\nWhy someone take a life for an iPhone for?\nListen up now before it gets too late\nAll your problems escalate but you stand stall you're standing straight\nKeep your head clear you got a plan to make\nMove along live your life. Didn't sink in? Listen twice\n'Cause I was lost and I was down but I changed my life\nHear from me, there's a way you gotta make it right\n\n[Hook]\nTi-ti-time ticks and it's going quite quick\nBut li-li-li-life is exactly how I write this\nTi-ti-time ticks and it's going quite quick\nBut li-li-li-life is exactly how I write this\n\n[Verse 2]\nFind my goals, execute\nLive life, accept the truth\nAin't no ever telling if you coming or you staying\nOr you waiting or you playing on a message move\nYou gotta pave a way, don't you follow no one's path\nMake your way, let them follow you\nYou ain't leaving last, gotta move\nNo one else can help you now if you can't help yourself\nI've overcome what I won't become\nBut I won't be dumb and I won't be numb\nWait, I gotta be numb to ignore your feelings\nSo spiteful, but I've kept it real man\nHit this here, then hit the ceiling\nVictory, I enjoy this feeling\nJust stop, hope for the best\nHope you hear this and hope you're obsessed\nHope you don't leave, don't say that you left\nHope you're coming back and staying till your death\nIs life a rollercoaster?\n\n[Hook]\nTi-ti-time ticks and it's going quite quick\nBut li-li-li-life is exactly how I write this\nTi-ti-time ticks and it's going quite quick\nBut li-li-li-life is exactly how I write this"}], "artist": "Kerser"}