{"artist": "Pastor Troy", "songs": [{"album": "Universal Soldier", "title": "I’m A Raise Me A Soldier", "image": "https://images.genius.com/6e18d447b8cfad7cd072f5e0653aab8a.220x220x1.jpg", "lyrics": "Raise Me a soldier\nArtist:PASTOR TROY\nCD:UNIVERSIAL SOLDIER\nSong Title:Raise me a soldier Track #10\n\nTalking before the Song:\n\nI Can't wait to have a son, Lil PT Nigga, Lil Pastor Troy\n(Its gonna be real)\n..............................\nAnybnody can be a daddy, it take a real man to be a father, (this dedicated to all them niggas takin care of they responsibility its on...keep it real)\nI think back home how i was raised, and how it is now, and i'm Half the man\n----------------------------------------------------------------------------------------------------------------------------------------\nMan i'm played the fuck out\nAnd i can't do nothin bout it\nMy pop pushed me when i pouted\nThen he grabbed me and shouted\nNigga thugz make this earth revolve\nAll the simple shit that these mothafukaz can't solve..we forgotten\nNow i ain't gon' spoil you rotten, you's a punk if you's a nigga\nWhile punks pull pranks us real niggas pull triggers\nAnd i figure that like father, like son..fuk the pack man, lets buy the 50 pack and a gun\nDont mean to take away yo fun, whats mo fun than money\nAnd even when you move a-tons pay yo tides on sunday\nLets understand that the big man is Jesus Christ\nGive him repect and them devils can't fuck wit yo life\nCause they'll entice you wit anything, bitches and broads wit bright ideas\nNigga...close yo ears or yo money dissapear, took me years fo i'd seen the light\nAnd i'ma tell my son his great-father was right, like my father sat me down now sit down my boy\nAnd make him understand what it means to be a Troy\nAnd let the burdains i experienced make him laugh\nBut at the same time, let my baby clear his path\nAnd all the math that them crakaz gonna teach in school, i teach him home\nTeach him shit he would have neva know\nI teach him how to clip the dope and how to chop his rocks\nI do it all for tha ship off tha old block..cause dats my blood\n\nI'ma raise me a soldier, a soldier. I'ma raise me a soldier..a soldier, put my faith in Jahovah..Jahovah, teach me how to raise my soldier, my soldier!\n\nMy son, the one thats gon' take over the throne, and he'll me atone\nWhen them bustaz doin wrong, its bound to happen\nAnd i can see him laughing at trials and tribulations\nHolla'in at the hoes help them wit they situations\nManipulation..? come on he'll be like me\nAnd when niggas knock his shit, he gon' tell em wit the quick\nTheres a million ways to get to the top of the mountain\nBut the view is all the same, so fuck it i'ma a slang\nHe gone understand the his name the game bendin all the rules\nSo prove the move you make, cause nigga dats yo fate\nGon' take a few mistakes but as long as he learn\nEven the bird didn't know, just go get the worm\nAnd he gonna earn mo blessings, his blessings teach his son\nHis son gonna teach his boy, and reunions we'll enjoy\nThe visions of a Troy President of this nation\nBrings a tear to my eye..What thugz ain't 'pose to cry?\nI rely on my intuition, and my position, God gon' bring me to a stong position\nNow would ya'll listen, that the cristian and i cry for days, another child\nTo raise him to the worldly ways..dats my blood\n\nI'ma raise me a soldier, a soldier. I'ma raise me a soldier..a soldier, put my faith in Jahovah..Jahovah, teach me how to raise my soldier, my soldier!", "year": null}]}