{"songs": [{"year": "2005-01-01", "image": "https://images.genius.com/9ca5cfaace091af186d0ad1e8bf04332.1000x1000x1.jpg", "title": "Neck of the Woods", "album": "Fast Money", "lyrics": "[Intro]\n(Uptown!)\nYeah, yeah, nigga\n\n[Chorus: Birdman]\nWell let me take ya' to the neck of the woods\nIn my hood (uptown), show you what we livin' like (uptown)\nWell let me take ya' to the neck of the woods\nIn my hood (uptown), show you what we livin' like (uptown)\n\n[Verse 1: Lil Wayne]\nChyeah! Gangsta to the core\nAnkle wrap flamer, paint your kitchen floor\nWit' your whore, shit you can't ignore\nThings you endure when you fuckin' wit' the boy\nAll I heard was, \"Weezy, don't kill me no more\"\nI hear your bullshit, I play matador\nI'm outta categor-y, I ain't there wit' y'all\nI got a positive vibe, but I ain't scared of y'all\nGet the kid negative, never did that at all\nThat rat-a-tat go off, that blat-kak-kak-kak-kak-kak\nI gotta bitch so fine her name Pérignon\nShe know how to stash quarters in a carry-on\nI blow outta town grass when I'm outta town\nUptown in the building: not a sound\nCuz killas don't get heard about\nThey get whispered about or you get murdered out, nigga!\n\n[Hook: Birdman & Lil Wayne]\nWell let me take ya' to the neck of the woods\nIn my hood (uptown) show you what we livin' like\nWalkin like a man, finger on the trigger\nI got money in my pocket, I'm a uptown nigga, nigga!\nWell let me take ya' to the neck of the woods\nIn my hood (uptown) show you what we livin' like\nWalkin like a man, finger on the trigger\nI got money in my pocket, I'm a uptown nigga, nigga!\n\n[Verse 2: Birdman]\nThe first shot, the first nigga got shot\nWe bust him open like a blunt on a Marley, nigga (yeah)\nA hundred Gs, nigga, score some keys\nThen we went to the hood and then we started to ballin', nigga We know them people been paper chasin'\nSo we stay out the way, then we pull out the Harleys, nigga\nWe keep the gauge close, in case you won't know\nYou come to the hood? I bet you a target, nigga\nIt's all good 'til you catch a case\nA nigga never escape 'cause you addicted to money, nigga\nWell, let me bring you back yesterday\nA lil' homie I know got full of that barma nigga\nFuckin round wit' that Kid-N-Play\nNigga fuckin with Gs, a nigga twisted his body, nigga\nWell, let me tell you 'bout this game I know\n(You keep flippin' dough, homie?) You'll be riding the flyest, nigga\n\n[Hook]\n\n[Verse 3: Lil Wayne]\nGot it on your mind, let daddy say somethin'\nAll that play buckin', gon get your face buttoned up\nNow when you smirk, you look like Jay-Z's shirt\nFuckin wit' that turf, I'm puffin' on that smurf\nFuck it, come holla!\nAnd tell that poppa put away your dollas, your son got choppas\nAnd if you got enemies, your son got enemies\nThat's uptown energy nigga!\n\n[Verse 4: Birdman]\nDon't waste no time on no bullshit\nIf it ain't hood shit, we spend a lil paper nigga\nWell if you catch 'em in the hood nigga\nIt's all good shit, go 'head, do me that favor nigga\nWell let me take you deep down in the inside\nIt's where they hustle and the homies try to get it right\nIt's when you got to ride, it's when the homie die\nAnd the money can't stop the pain in the inside\n\n[Hook]\n\n[Outro: Birdman]\nPlease believe it! Birdman and Birdman Jr.!\nWe hear them bitch ass niggas talking, you heard?\nBut we up by one, you heard?\nThey playing catch-up! Cash Money Millionaires!\nHot Beezoh! Birdman, holding it down!\nYou got a problem? You know how we rock, homie!\nHold Uptown down, big dog! Big dog! You heard me?"}], "artist": "Birdman"}