{"songs": [{"album": "Strange Days Tour: A Decade of Excellence", "image": "https://images.rapgenius.com/61456b856546aa659dfd2021519e7443.500x500x1.jpg", "year": "2010-01-01", "title": "1zie", "lyrics": "[Intro]\nSo what’s up with it baby?\nI’m saying, I’m trying to holler at you\nI mean, what’s good?\n(I don’t know babe, I mean\nYou got all these girls over here\nI’m not trying to be a groupie)\nNo, no no no no you’re not a groupie\nA groupie comes for the whole group\nYou’re just here for me, you’re my 1zie\n\n[Hook: Irv Da Phenom]\nMy 1zie, my 1zie\nKnow what she want, and she know where she wanna be\nMy 1zie, my 1zie\nGirls all around me, but she’s the only one I see\nOnly in town for a night, my 1zie\nSo I know it makes you shy, my 1zie\nGirl we grown, so come on\nYou’re nothing like a groupie, 'cause you’re my 1zie\n\n[Verse 1: Tech N9ne]\nI got a big tour bus baby won’t you come see?\nEven though you know a lot of women want something from me\nYou don’t know me that well cause I’m hella underground like Bun-B\nSuch fun we could have, it'll be a blast if I could play with you like Jumanji\nI’m hood and techie, that’s grungy\nShe’s good and preppy, Abercrombie\nPressing her would be sexy she's hailing from Montre-al\nAnd when I say “y'all” she laughing at me sounding country\nShe said she don’t do the groupie thing I’m grumpy\nMy face looking like Ashton Kutcher just punk’d me\nIt haunts me when a woman’s just with me\nAnd I don’t get none because she's feeling groupie\nBut you’re just with me, so you’re my 1zie\n\n[Hook: Irv Da Phenom]\nMy 1zie, my 1zie\nKnow what she want, and she know where she wanna be\nMy 1zie, my 1zie\nGirls all around me, but she’s the only one I see\nOnly in town for a night, my 1zie\nSo I know it makes you shy, my 1zie\nGirl we grown, so come on\nYou’re nothing like a groupie, 'cause you’re my 1zie\n\n[Verse 2: Tech N9ne]\nThey always care about what everybody think\nDon’t wanna hook up with rappers on tour with scary body ink\nMissing out on a good guy, that when I kiss ya very naughty pink\nBut some of them be those evil B.O. people, hairy, probably stink\nBut I ain’t talking about you, because you’re gorgeous\nAnd I don’t wanna hear the groupie thing, it's just me baby don’t forfeit\nJust come towards this, extend me like a swordfish\nIgnore chicks who say you’re a big groupie, loosen up in gorged dick\nHow we kiss it lightly, don’t try to fight\nThese feelings that you’re feeling from this Kansas City iced tea\nI shouted sugar honey ice tea!\nYou’re just with me and not the group\nSo you're a 1zie, groupie slights me\n\n[Hook: Irv Da Phenom]\nMy 1zie, my 1zie\nKnow what she want, and she know where she wanna be\nMy 1zie, my 1zie\nGirls all around me, but she’s the only one I see\nOnly in town for a night, my 1zie\nSo I know it makes you shy, my 1zie\nGirl we grown, so come on\nYou’re nothing like a groupie, 'cause you’re my 1zie\n\n[Verse 3: Tech N9ne]\nAnd this dude be true, with you I wanna do thee do\nBut if you really wanna do the crew, that’s cool, cause we do groupies too\nI'm just saying that I wanna get it on with think and juicy you\n38-24-36 and you don’t got booty dew\nA groupie does the group baby, but I am one\nI’m a go back to my bunk so try and come\nWith me and the feelings we denying none\nYou maybe crying some cause it feels so good\nAnd now I leave you lying sprung\nGo tell your girls you did the humpty dumpy\nHow you layed me down, undressed me, then you sunk me\nJumped off in it like a bungee, down under like I was Dundee\nDon't say groupie baby girl you're just my 1zie\n\n[Hook: Irv Da Phenom]\nMy 1zie, my 1zie\nKnow what she want, and she know where she wanna be\nMy 1zie, my 1zie\nGirls all around me, but she’s the only one I see\nOnly in town for a night, my 1zie\nSo I know it makes you shy, my 1zie\nGirl we grown, so come on\nYou’re nothing like a groupie, 'cause you’re my 1zie\n\n[Outro]\nOoooh, ooh ooh ooh ooh (yeah)\nOoooh, ooh ooh ooh ooh hoo-hoo ooh (that's right)\nOoooh, ooh ooh ooh ooh (You're just my 1...z-i-e)\nOoooh, ooh ooh"}], "artist": "Tech N9ne"}