{"songs": [{"lyrics": "[Intro]\nAye, the fuck this nigga calling my phone, what?\nNigga you can't check me, you gotta check for me?\nDo you got some bands for me?\nYeah, did you ever give me something?\nHell nah, get your goofy ass outta her boy\n\n[Verse]\nI can't stand no broke ass nigga sit down\nAlways calling me for money trying to smoke my loud\nThey be some fans\nTweaking, acting like your regular bitch\nI know these niggas piss, boy you can't sex shit\nI need some neck bitch\nI shot your new bitch\nThat hoe ain't real as me, that bitch can't even get rich\nJumped out the porch, I was so young, my mind been set\nAll them hundreds, and them fifties can't be a dollar less\nI know a nigga groupie, he call me pretty pussy\nHe give me money cause I'm boujie and my hoodie coogie\nI got on makeup still look better then your fucking momma\nWhy you faking like you got it boy your pockets dying\nLast week you hit me up, I gave you no reply\nDon't give a fuck about a thot niggas bound to die\nQuit that fucking lying, I keep an attitude\nYou ain't a real nigga stunting in your homies shoes\nYou got a pent house, with bout six dudes\nAll your crack cards scamming to you out the loot\nI am from outta space, finesse a niggas face\nThey just wanna fuck a famous bitch off instagram\nI be turning niggas down like a bowling alley\nI got thirties and my bitches throw they titties out\nDumb ass nigga, who's a slut you got the wrong bitch\nStay in my DM's on that goofy ass thirsty shit\nSee you in person, I'm to clean, I can't even speak\nYour brain so small from that lean and all that shitty weed\nHyping pussy ass rappers head cause they got clout\nGo get your own, see Lil' Asian I'ma get it now\nGotta different nigga, different day, No talk it out\nBe in the studio with Barbie bitch we be cute off drugs\nHer pussy loose as fuck, you fucked her anyways\nBasic ass nigga, sent her on a get away\nGo fuck around and catch eights or a raping case\nCan't praise no nigga with no cheap ass mixtape\nNo dinner dates, lunch dates, just give me sloppy face\nAnd when you done nigga don't act like we go together\nWas broke alone ain't no nigga give me no cheddar\nMy brother taught me bout you faggot ass buzz killers\nDrugs dealers, treeba, yeah take a niggas check\nThis the song where my bitches gon' get they respect\nHe was lacking off that drank you coulda hit a stain\nBut you a real young bitch don't want no nigga chain\nAnd don't you wanna boss up and stay out niggas face\nIt's a difference from a groupie and a gang member\nI don't know nobody but my mans can't hang with her\nPillow talking bout your mans for a name nigga\nLame ass nigga, dirty trash nigga\nWith them small ass dreads I'm on your ass nigga\nTripping bout a hoe you niggas through\nWe don't care just want some throat\nI have niggas they be act pretend like they don't know you though\nI'll write on your instagram page and like your pictures and DM you\nNigga who the fuck you think you is?\nI don't know you!\nThis my world, swerve a nigga like a cinnamon roll\nAll these niggas be hoes\nAll these niggas be through with them same ass clothes\nNigga who you think you is, I be pimpin' on a bitch\nI don't give a fuck about a nigga if he was rich\nNiggas they be spazzing they be trying to beat a bitch\nBut Lil' Asian, I ain't going yeah my thirty got a clip\nAnd my purse cost a grip and my pants cost a G\nLame niggas they be talking yeah these niggas I can't see\nAnywhere I go, you know the doll yeah she's VIP\nI ain't even gotta speak I bet the bouncers know me\n\n[Outro]\nGang, bitch, what the fuck?\nAye, these niggas goofy as hell\nI better not see another nigga sneak dissing no bitch on Instagram\nPeriod, yeah, yeah, that way!", "album": "Outtaspace", "year": "2017-03-24", "title": "Real Bitch Anthem", "image": "https://images.genius.com/cf4c7c9edd0207eed4f48620ddbf32a9.500x500x1.jpg"}], "artist": "Asian Da Brat"}