{"songs": [{"year": null, "title": "Eviction Notice", "image": "https://images.genius.com/ac9e0f11c62005e2d424955c950a2944.300x300x1.jpg", "lyrics": "Fuckin' doin' it\n\nThis song is called Eviction Notice, it's a 2-parter\nIt's about how drugs are the gateway to fun and flat laugh lines\n\nThere's effort in her smile and it shouldn't be that way\nHer last days are being snuffed out in an ashtray, and that's pricely\nTrying to intercept the passing away I've asked nicely\n\nBut I've learned not to feed the hand that bites me\nThis morning the cradle rocks the hand\nAs I bang on pots and pans\nShe's just playing in her warning labeled box again\nShe wants a man I can look up to, a role model to come through--\nDon't bother unpacking your car...cinogen filled thrill sticks\nThis girl will spit fire\nGot me doing pirouettes over her guilt trip wire\nI still skip by a land mine or two, see I've learned the landscape\nAll the while practicing my firm handshake\nHair, trigger-finger itch to spark any conversation\nSaid explosive personalities don't part deadly confrontation\nWhat happens in between her lips\nShe needs a fix more than she knows her friend's a bitch\nAnd needs to go\n\nThere's a note on the door..\nEviction notice\n\n\"Listen, one of us is leaving, and when I say US I mean YOU...\nYOU'RE leaving. (You're leaving... You're leaving.)\"\n\nI'm in the house y'all, I'm in the house y'all\nAnd ain't no little piece of paper gonna kick me out y'all!\nWhat?? I'm in the house, I'm in the house\nAnd ain't no legal separation gonna kick my ass out\nI'm in the house y'all, I'm in the house y'all\nAnd ain't no new boyfriend gonna kick me out, y'all!\nFuck that, I'm in the house, I'm in the house\nAin't no snot-nosed brat gonna kick my ass out\n\nPick ME! Please leave me believe me\nPlease leave me believe me please\nPlease leave me believe me please leave me\nPlease believe me, leave me leave me..\n\nThis song is called Eviction Notice, it's a 2-parter\nBasically it's about how sacrifice and vices will invite themselves\nTo an overstayed welcome at your haunted house parties\n\nThere's effort in her smile and it shouldn't be like that\nHer final evenings have her drowning in a nightcap, and that's costly\nTrying to keep her on the right track I ask softly\nBut she just says \"BACK OFF ME\"\nAnd I've learned to space her private respect\nShe breathes some room to need and every afternoon proceeds\nTo mix her liquid sitter while preparing baby food to feed\nShe wants I man I can look up to, a mentor-- Fuck you!\nGet your things packed\nYes kids, the poison is the message in the bottle\nBefore the dawn she'll have to kill all fetal positions by ingesting a\nMorning-after pill\nCrawling fast until I get rewarded for how good I've behaved\nWhile practicing my goodbye wave..\nShould I stay? After planning my escape routes\nAnd shouting out, \"Is there a lifeguard in the lighthouse?\"\nTo the rescue bottle mouth-to-mouth between her lips she sips\nShe needs a fix more than she knows her friend's a bitch\n\nAnd there's a note on the door..\nEviction notice\n\nFun times fun times, (\"Fuck you!\") fun times fun times fun times\n(\"Fuck you!\") Fun times fun times, fun times fun times fun times\n(\"Fuck you, get the fuck out of my house...\")\nFun times fun times, fun times fun times fun times\nFun times fun times, fun times fun times fun tiiiimes!!! (\"Fuck YOU!\")\nOne more time guys, fun times fun times fun tiiiimes!\n(\"Get out.\")\n\nI love you\n\n(\"Get out!!! Get the fuck out of here! GET OUT!! Go.\")\n\nYour mother would like to hear from you", "album": "Personal Journals"}], "artist": "Sage Francis"}