{"songs": [{"image": "https://images.genius.com/9703948ee40b2385b6c79a5f9eeffec3.700x700x1.jpg", "year": null, "lyrics": "Yeah, uh\n\n[Verse 1 - Akrobatik]\nYo, mic ripper, that's my job, that's what I do (uh)\nCreate a new style, distribute it to a few\nDie hard, hardcore, underground hip hop, listeners (listeners)\nPut the signal in the sky like Commissioner\nGordon (Gordon) (what?, uh), and out jumps the warden\nTo ax up the competition like Lizzie Borden (Borden)\nI never sweat the shit that I am or ain't affordin (uh)\nRather sweat the quality of the music I'm recordin\nI'm scorin on the mic and you could gamble or bet\nThat if you come to Ak's casino you play Russian roulette\nYo, but I won't put your head out, I'd rather put you into it (into it)\nWhen I get intricate (intricate), shit you get intimate (intimate)\nWith your brain (brain), but yo, yo, I won't put your head out\nI have these MC's changin faces and tell 'em \"get out!\" (get out)\nYou'll have to ring the sweat out your pours when your done\nWith these verbal calisthenics (uh)\nYou could try to beef your ass up with Cyrogenics\nBut your style is dead, it's second round your greeted by the medics (what?)\nYou just get by the credit (uh)\nFor soundin like the flavor of the month rap act (act)\nThe hip hop consumer needs to smack that, asshole!\n\n[Hook]\n\"Watch dem fly niggas show you how to rhyme, asshole!\" - Guru - 3X\n(*scratched*) \"Asshole!\"\n\n[Verse 2 - Mr. Lif]\nMr. Lif comin off the bench for the Unabomber\nWearin inhuman armor\nMade from a theorem, Pythagorean\nI fly to outer space and grab a being\nHang ten on a Quasar (where they at?)\nThere they are\nHomemade missiles, start the procedures (uh, no doubt)\nI blast femurs of blasphemia\nStep off to the side to take a breather\nAnd hit you with the dose of emphysema\nReturn to see ya, at my leisure\nIt's a double feature, I'm the creature (what?)\nCops questionin my fans\nSearchin for Mr. Lif (Mr. Lif), \"48 Hrs.\" like Ganz (uh)\nThat's a burden like white mans\nI am like Trans (what?)\nUnseen but my mind expands\nKnown to swell glands of clans and crews\nAble to communicate with bands of wolfs\nThe beat blaster (what?), similar the beast master\nSpell caster, Lif it be, more wizardry\nTo damage physically with a slow or fast flow\nApparently skills are somethin you lack so\n\n[Hook]\n\n[Break - Cuts by DJ Fakts One]\n(*\"Asshole!\" - scratched several times*)\n\n[Outro - Akrobatik - talking]\nYeah, uh\nPerceptionists crew", "title": "Wreck Dem", "album": "Balance"}], "artist": "Akrobatik"}