{"songs": [{"year": "2014-05-09", "image": "https://images.genius.com/365b4e7c6bd0f53a58899a021a7d00b7.1000x1000x1.jpg", "title": "Click Click", "album": "King", "lyrics": "[Part 1]\nGuck mich an Bitch\nEy yo, mein Leben is' okay\nIch zieh mit paar Supermodels\nAuf 'nem Segelschiff Cocaine\nKomm und steppe breitgebaut\nIn die Edeldiscothek\nUnd du sagst zu deinem Baby\n\"Komm lass gehn es is' schon spät\"\nDenn sonst wird es gefährlich\nWie Karrieren im Dopegame\nKid ich schwöre dir mein einziges\nTägliches Problem\nIs' Nackenmuskelkater\nDurch die schwere der Goldchains\nEy yo, wie gesagt Homeboy\nMein Leben is' okay\n\nIch sitz' im Edelrestaurant und kriege Hunger\nVerlier die Geduld und zerlege mit drei Gunshots den Riesenhummer\nDu willst in den Backstage Baby, zieh ne Nummer\nKid ich mach aus standfesten Kampflesben Emochicks mit Liebeskummer\nUnd bleib Laidback, ey wenn der Boss mal am Rad dreht\nDann nur wenn er am Steuer seiner kostbaren Yacht steht\nInternationaler Businessman slash Prollrapper\nIch wollte schon mit sieben reich werden so wie Goldwäscher\n\n[Hook: 2x]\nYeah, und es geht Klick Klick\nPaparazzi Blitzlicht\nDeine Bitch schreit \"KILLAAAAA!\"\nIm M6 mit 'ner Chick\nBig Boss, big Dick\nNumber one der Hitlist\n\n[Part 2]\nNachts auf der Autobahn, ich rauch Haze mit zwei Chaias\nPlaystationzockend in der Couchecke vom Nightliner\nEin Abteil weiter, Handflächen knallen auf Bootys\nGroupies lassen die Hüllen fallen wie ne ballernde Uzi\nSchöne neue Hiphopwelt: Ein Leben zwischen Drogen\nGroupiebitches, Geld und Ritzhotels; auf großem Fuß wie Big Foot Fell\nWo Topmodels Aston Martins polieren\nWir sind Player die die Fuckbuddies im Handy nach Städtenamen sortiern\nDiese Schlampen sind Blutsauger. Ich step' aus dem landenden Hubschrauber\nIn Slowmo, wink' per Handgruß den Zuschauern\nDie am Rand vom roten Teppich applaudieren\nSteppe lächelnd durch die Crowd lass mich per Stretchlimo chauffiern\nDie ein Leibwächter fährt: Schwarzer Anzug, schwarze Sonnenbrille\nUnd ein Knopf im Ohr wie'n Steifteddybär\nMein Finanzberater labert von Preisniveaustabilität\nFuck it! Ich schmeiße Scheine hoch beim Videodreh\n\n[Hook: 2x]\nYeah, und es geht Klick Klick\nPaparazzi Blitzlicht\nDeine Bitch schreit \"KILLAAAAA!\"\nIm M6 mit 'ner Chick\nBig Boss, big Dick\nNumber one der Hitlist\n\n[Part 3]\nHau mir ab mit deiner Graskiffermucke\nHundesohn ich box dich back in deine Pfadfindergruppe\nUnd du fragst dich wieso nennt selbst dein Vater dich Schwuchtel\nKid weil du dem oberpeinlich bist, wie'n Haar in der Suppe\nDeine Ma is' ne Nutte in Rotlichtbezirksstraßen\nIch hab in mei'm Kleiderschrank mehr exotische Tierarten\nAls ein Zirkusgelände. Steh Pelztragend am Fenster\nUnd spuck auf die unten demonstrierenden Tierschutzverbände\nSalutier' der Legende! Ich bin back Player, stack' Paper\nDoubletime Neckbreaker, Kille dich mit nem Sechzehner\nPenner du bist schon knapp über ein Jahr lang in der Massephase\nWarum rutscht bei Klimmzügen dann dein Armband in die Achselhaare\nHater du bist stark neidisch bleibst bis du ins Gras beißt ne Bitch\nUnd deine Grabsteininschrift sagt dann wahrscheinlich nichts\nAußer: der Typ kam auf die Welt hat paar Dicks gesuckt\nSpliffs gepufft, Pünktchen Pünktchen und das war's eigentlich\n\n[Hook: 2x]\nYeah, und es geht Klick Klick\nPaparazzi Blitzlicht\nDeine Bitch schreit \"KILLAAAAA!\"\nIm M6 mit 'ner Chick\nBig Boss, big Dick\nNumber one der Hitlist"}], "artist": "Kollegah"}