{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/6899b851929e0ce00a3ce59fe1cb1f6e.500x500x1.jpg", "title": "Gangsta Gangsta", "year": null, "album": "The Giancana Story", "lyrics": "[Ma Barker]\nWhat, nigga, Black {*censored*} Fam\nY'all don't fuckin want it, you heard\nListen up\n\nBitch either ride or collide with me, this side right\nYou don't wanna wait 'til the end of the night to step outside wit me\nYou know the history of the guys with me? Extortion, kidnappin\nMurder in the first, niggas live to die\nHungry and they bloodthirst, my Dunn guns the worst\nWe can get it to poppin off like July the 4th\nOn any day of the month bitch we get it to jump\nBlack {*censored*} Fam, my niggas ain't scared to dump\nSo what the fuck you want beef for, you squeamish\nStart to hyperventilate you see a nigga start to hemorrhage\n{*censored*} Fam don't start shit, we regret the finish\nBitch nigga, we really live this, we mean business\nWe even got teachers in the school where your kids is\nNannies inside where your cribs is\nBeautician doin hair where you Wiz is\nBlack {*censored*}, secret society bitch\nYou get found with the fishes\n\n[Kool G Rap]\nAiyyo, who wanna know about the life story, it's like Corle's\nBlood all over the nice Mauries\nStutterin bitch, who you know spit more gutter than this?\nSmack a nigga with the butt of the fifth\nWe guerillas and thugs in the midst\nWas cold before I flooded the wrist\nBig heist shit, blood on the bricks\nBag it up, bubble the strip\nOne days work, a couple of whips\n.. then more than double the chips\nSupreme Queens nigga with a BK click\nYou just a weak fake bitches whatever nigga the heat spray quick\nY'all niggas can't do shit but peep the gray wrist\nCGP in the face of your chick, comin f'real with it\nBring the cattle to the battlefield, we'll still spit it\nNo matter who the fuck you are, you can still get it\nCount that off as a loss, go 'head and peal wit it\nFar as your corny-ass click, they gotta deal wit it\n\n[Hook: Black Guerilla Fam]\nWe the Black {*censored*} gangsta click (gangsta gangsta)\nPut your hands to the streets for this gangsta shit (gangsta gangsta)\nYou a nigga or a bitch keep it gangsta kid (gangsta gangsta)\nBlack {*censored*} Fam, you know how these fuckin gangstas get\n\n[Male Black Guerilla Fam member]\nAiyyo sex money and drugs, that's my life\nShrimp shooter with the red light, that's my wife\nBitch prism on the late night, that's my type of hustle\nShit make dough, that's my bubble\nNo one's project beef, that's my struggle\nI never been shot - that blood there, that's your puddle\nWho the fuck wanna fire at me?\nFor every shot a nigga shoot, my mac-11 firin three\nYou got wars, nores, lazy {?}\nEt cetera, Black {*censored*} Fam, we bang harder\nBandana Montana streetsweep carver\nShots connect, your bones I disconnect\nBring your skull back home like I bone collect\nOne year under dirt you'll be bones in bed\nTasmania, Brooklyn - that's my set\nStop screamin out Guerilla 'fore I break yo' neck\n\n[Another male member]\nI dare anybody play like Laze Mike\nNot blaze like half of your block in broad daylight\nTake flight to Queens with your fake ice\nPull you out the back of the trunk\nAnd put your face in the brake light\nYou six deep, so what? Me I'm by myself\nBut you know what? I cut one of y'all real bad\nPops is my pops but my moms my real dad\nYou runnin round with the same heart that Steel had\nI'm the best, I don't give a fuck who said so\nHave you dopefiend like Lazy, let go\nDon't get your head gassed off my nice chain, word to my mother\nI done lost half your life in a dice game\nI don't brag shit, I'm a hustler; I don't wanna be seen\nI want the green the fame shit is for suckers\nI'm a Guerilla, so it ain't nuttin to touch ya\nBitch nigga recognize that or learn to suffer\n\n[Hook] - repeat 3X"}]}