{"songs": [{"image": "https://images.genius.com/d878e54b6766255010da413481db1471.1000x990x1.jpg", "title": "There Was a Murder", "album": "Til the Casket Drops", "year": "2009-12-08", "lyrics": "[Intro: Kobe]\nI wake up-wake up in the morning\n'Cuz them boys come knocking in the morning\nThen I have me girl go flush in the toilet\nThem say did someone get murdered on the corner?\nThem say did someone see me, seen someone get shot\nThem say they saw﻿ me there...\nMy nigga they won't break me, and I'll go crazy\nBefore they make me tell...\n\n[Hook: Kobe]\nThere was a murder by the corner house, whoa-whoa-whoa-whoa-whoa\nThem boys asking questions now, no-no-no-no-no\nNow everybody seen it, but don't nobody know\nWhat happened to the boy down the street a week ago\nAin't nobody talking, they keep it on the low\nDon't open ya mouth, when they knocking at ya door\nCause niggas die out here for snitching, they﻿ dying for snitching... OK?\nThese niggas die out here for snitching, they dying for snitching... OK?\n\n[Verse 1: Pusha T]\nThose who break the code, we dig them holes\nWhat's worse than a street nigga that sells his soul?\nBe it the life we chose, we pick our roles\nBad man stands an' fall but never fold\nGangster﻿ turn informer when the jig's up\nYa tool mix-up mix-up\nBabylon boys, get bodies left for pick-up\nBlood puddle, gun muffle, guns couple\nMuzzle﻿ in mouth, we bring trouble\nSoon police come rush, whole family crushed\nAll because them pussies couldn't hush\nShot box mouths with no covers\nBody 'pon body gets stacked, one top th'other\nWish them hadn't to suffer\n\n[Hook]\n\n[Verse 2: Malice]\nNobody seen nothing, heard nothing, they ain't said a word\nJust chalk and yellow tape, with blood 'pon them shirts\nAshes to ashes his body back to the Earth\nThat casket drop six feet, then throw upon it dirt\n\"Mum's the word\", that's hustler's etiquette\nYou'd rather hang yourself than turn state evidence\nEver since I﻿ was young, never talk to the folk\nTongue small like a rudder, yet steer the 'ole boat!\nLoose lip the reason that ship no longer float\nTelling the Feds everyting they wanna know\nThat fatal blow took his very last breath\nThe power of ya tongue is life-and-death, ya feel me?\n\n[Hook]"}], "artist": "Clipse"}