{"songs": [{"album": "Truly Yours 2", "year": "2013-04-30", "title": "3 Wishes", "image": "https://images.genius.com/eea3c8d569aba2182316f265944de431.896x896x1.png", "lyrics": "[Verse]\nYeah, grew up with killers, I ain't know they was killers\nWe was just together man, playing Mega Man on Sega, man\nYour mama loved me to death, she reminded me of Afeni\nYeah, a real black queen\nIf I had a genie, I'd wish that she ain't struggle no more\nY'all wouldn't have to go to sleep with all the roaches if she wasn't so poor\nYou told me when you came to my house this shit was like a timeout\nFrom reality, one night you asked me what I'm crying 'bout\n'Cause you was staying over for the weekend\nI woke up from out my sleep when I heard mama and my stepfather beefin'\nI don't know if he'd been drinkin', but I know this shit got loud\nAnd I heard rumbling from struggling and rolling on the ground\nCould never get used to that sound, my mama saying \"Get off me!\"\nMy tears is tumbling now, I wish that you never saw me\n'Cause I felt like a coward, so powerless I was only twelve\nI wish I wouldla bust through that door my fucking self\nAnd grab the Glock right off the fucking shelf, if nothing else\nScared a nigga shitless, there goes two of my wishes\nForever scarred, determined to get some heart\nNo matter how big the nigga, no matter how small you are\nFast forward to our older years, two different paths\nYou used to talk to me 'bout college, but that shit didn't last\nWaste of potential, getting cash, what could I say?\nSo tired of not having things, you'd never see it my way, too proud to fold\nYour demise, one day much to my surprise\nMy nigga called me, told me you just caught a body twice your size\nI asked if it was self-defense, he said it was defense of pride\nAnd that they tryna give you ten, but if you lucky you'll do five, damn\nNot my nigga, the same one that told me\nThat things always get better, just trust me, don't cry my nigga\nThe news call him a killer, but he my nigga\nSad shit, ayo genie last wish, free my nigga"}], "artist": "J. Cole"}