{"songs": [{"title": "Rambo (Freestyle)", "album": null, "year": "2016-08-12", "image": "https://images.genius.com/fc231aac2fd4fe5965f20d2d30f0c775.858x858x1.jpg", "lyrics": "[Intro: DJ Clue]\nPower 105.1\nDesert storm radio baby\nA Boogie, Don Q\nHighbridge\nDon Q, get 'em\n\n[Verse 1: Don Q]\nWhipping with finesse, got me sprinting through a check\nStacking more, spending less, you niggas still in debt\nThey love the Don cause the arm looks like Lucky Charms\nI just want to count a hundred grand and hug my mom\nTell her it's nothing wrong\nThe sun's shining and we made it through the thunderstorm\nNo more rain, now all I see is the hundreds pouring\nThem bitches played before, now we just stunting on 'em\nWait, I ain't coming for 'em\nI got better shit to do\nSee through the years I done lost a good friend or two\nThis shit is pitiful\nI walk up in the spot dressed down like an interview\nThen it's to the block, spilling lean on my tennis shoes\nI'm December cool\nSay what's your name again baby? you know it been a few\nAnd if the pussy weak I probably won't remember you\nI probably had to doubt we in the mineral\nYou know I like to mix it with the chemical\n'Til a nigga in the mood, and I see the ceiling move\nI'm the one they listen to, you the one they skipping through\nNigga lives on that corner where niggas died\nI'm where hard rock and heavy metal, that Ozzy Osbourne\nIt's shit I got to keep my mind on\nSnakes in the grass gon' come in with they disguise on\nThose the main niggas that you gotta keep your eyes on\nBut it's hard to tell when them the niggas you relied on\nDamn, look, your nigga is back\nThought I was gon' fall off? how silly is that\nI stood dolo in the cold and got rid of the pack\nAnd I'm talking way before I remembered a rap\nCatch me in the heights, right where the Dominicans at\nMe and Boogie, a few thots, make 'em fit in the back\nOf the coupe, they ain't loose, then we sending them back\nNigga speeding for no reason, got me spilling my yak\nSee I'm just tryna sit and relax and flip up a pack\nProbably go visit the trap and pick up a stack\nKeep calm, it ain't the tens and the Timberlands black\nDon C, Givenchy, made denims to match\nI'm back\nLook\nDon C, Givenchy, made denims to match\nWe don't even do Don C's anymore man, fuck that shit\nBoogie what up?\n\n[Interlude: DJ Clue]\nPower 105.1\nDesert Storm Radio baby\n\n[Verse 2: A Boogie Wit Da Hoodie]\nHighbridge to the grave, bitch\nEvery nigga that I came with on that same shit\nSeen some shit up on the chain before I became rich\nMe and you are not the same, I ain't speaking English\nYeah I'm talking that slang shit, they tell me talk up\nThey don't give out free Porsche trucks, I had to boss up\nFifty hanging off my necklace, my shit water\nDon't reach and watch your step, yeah don't get crossed up\nI can get into the drama if you wanna\nIf you try to hit and miss, do you believe in karma?\nIf you plottin' I can best believe you gon' get caught up\nMy nigga Dre a monster, he straight out of Compton\nYeah I'm all about my business, 'bout my chicken\nIf I put you on a mission, you'll be rich then\nYou can't get into my vision, this shit different\nReally talking what I'm living for a living\nHuh?"}], "artist": "A Boogie Wit da Hoodie"}