{"songs": [{"image": "https://images.genius.com/f3dc932dcf3a3d218d8e387297bf5afe.1000x1000x1.jpg", "title": "Let Me Go", "album": "The Search", "year": "2019-07-26", "lyrics": "[Verse 1]\nTalk to you with my hands tied\nWalk towards you on a fine line\nEverybody has a dark side\nI feel embarrassed when they see mine\nRain falling from my dark skies\nClouds parting, but it's all lies\nShouldn't I see the sunshine now?\nWonder how I look in God's eyes\nAm I a good person or a lost one?\nWill this feel worth it when I'm all done?\nWill I feel ashamed or like who I was?\nWill the pain vanish or will more come?\nWill I stay numb or regain love?\nMaybe someday have a taste of freedom?\nWill I take the poison out of my blood?\nOr just leave it there inside of my lungs?\nI know (Know know, know)\nI should let you go, hands are feeling cold\nJust leave me alone (No, no, no)\nI just want control, I feel so exposed\nLiars in my home (No, no, no)\nPlease do not provoke, noose around my soul, I cut down a rope\nThey don't want me happy, they don't want me fixed\nThey don't want me better, they just want me broke\nTalk but never listen, at least I admit it\nBlock out all my vision, watchin' me diminish\nThat's my favorite pastime, I know nothing different\nTell me something different, I don't see the difference\nI just feel offended, I just feel defensive\nWhy don't you accept me? I just need acceptance\nTime is of the essence, don't like how we spend it\nYou just want perfection, I need you to let me\n\n[Chorus]\nLet me go, let me go, let me go, let me go\nLet me go, let me go, let me go, let me go\nLet me go, let me go, let me go, let me go\nLet me go, let me go, let me go, let me go\n\n[Verse 2]\nWhy'd you say I don't belong here? (Huh?)\nFill a bucket full of my tears (Huh?)\nPour it out the water, all of my insecurities whenever I'm scared\nI watch 'em grow and say I don't care\nI pray to God to ask if hope's real\nAnd if it is, then I was thinking maybe You could introduce us, we ain't met still\nYeah, my chest feels like a blade's in it\nWho put it there? I think they did it\nOut the cell now, where am I headed?\nAm I Hell-bound? Will I find Heaven?\nWill I feel better or just regret it?\nIf I let you go and find the seven letters\nI've been looking for, it's like it's never endin'\nOpen all the doors and let the peace enter\nI'm (So, so, so)\nPitiful at times, miserable inside\nThey want me to hide (No, no, no)\nHow can I survive? Change your state of mind\nI should say goodbye (No, no, no)\nThey want me to beg, they want me to plead, they want me to die\nThey just want me dead, they just want me hurt\nDon't want me to live, don't want me alive\nStop with the pretending, I don't feel respected\nI just feel rejected, I don't like rejection\nYou promise protection, I don't feel protected\nI just feel neglected, how can I respect it?\nI'll teach them a lesson, I pick up the weapon\nAim in your direction, shoot at my reflection\nShatter my perception, hate it when I'm desperate\nYou just want perfection, I want you to let me\n\n[Chorus]\nLet me go, let me go, let me go, let me go\nLet me go, let me go, let me go, let me go\nLet me go, let me go, let me go, let me go\nLet me go, let me go, let me go, let me go (Let me go)"}], "artist": "NF"}