{"artist": "50 Cent", "songs": [{"album": "God’s Plan", "image": "https://images.genius.com/7488990258b7e75bb8e35de7a131ec87.697x694x1.jpg", "title": "187 Yayo", "lyrics": "{*set to Dr. Dre & Snoop's \"Deep Cover\" instrumental*}\n\n[50 Cent]\nG-G-G-G-G-G-Unit!\n50 Cent nigga, Tony Yayo (yeah)\n{WHOOOOOO... KID}\n\n[Hook: repeat 2X]\nYeah! And you don't stop\nI do a 187 on your motherfuckin block\nYeah! And it don't quit\nIt's G-Unit in your motherfuckin ass bitch~!\n\n[Tony Yayo]\nThey say good things should happen to those who wait\nBut I'm stuck in the game still slingin weight\nFor that eggshell white, that tan and the brown\nFor a XL-6 or a seven four pound\nSuede seats is hot but Italian leather is better\nAnd with cameras in the mirror, nigga cars costs cheddar\nI'm on first class flights, with flyin cooks\nCause my verse sound nice when they fly in hooks\nNow I'm blowin weed yo, in Beverly Hills\nWith some bad freak hoes in the Montreal\nNext year it's the new Hummer, stash box with the llama\nI drive through in the blue data bomber\nHeaven or hell'll prevail when I'm a goner\nCause I eat up tracks, like Hannibal and Dahmer\nI'm the first one out, and last one on the corner\nCause life is a hustle, any day you be a goner\nP89 Ruger with the silencer\nLet off a clip it sound like spitballs goin through straws\nWe got, plenty of ratchets but not on sale\nWe even got villagers that hold shotgun shells\nThese rappers is talkin 'bout bricks in they rhymes\nYou never did shit but some Mickey Mouse crimes\nI don't respect it, my work is never watered down\nSo on the first I get mo' checks than Nike Town\nSling in thirty-one hundreds, I been on the block\nSince niggas did the snake, running man and the wop\nWhen I was 15, I ain't want no workin papers\nI played the strip all night, servin niggas\nListen nigga, we live like Italians in jail\nI got C.O.'s bringin cell phones to my cell\nGet rich in the game, niggas out to get you\nFill your ass up with led turn yo' ass to a pencil\nI jumped out with the Ruger rapid-fire\nI had you on the run like Omar on \"The Wire\"\nI'm the only rapper you know that stay on the run\nI'm the only rapper you know that stay with a gun\nI'm a hustler, O.G.'s love to hate\nCause I got old school money put away in the safe\nYou can catch me in the hood where that dope and coke at\nOr you can catch me in cali in the Hollywood throwback\nI'm a bail jumper, you know them fish scale pumper\nFuck Judge Wong, he won't catch me on the corner\nNigga pay poor tax, homey you owe me\nYou wanna rap we can battle for your see through Roley\nI be in M mansion, strippin them models\nHis bathroom's so far you gotta piss in a bottle\nThere's too many indians and not enough chiefs\nWhy you buy all the guns if you ain't got enough beef\nThe shit I spit'll cause an all out riot\nAnd my new four-fifth'll cause a hollow-tip diet\nI'm the type to tie up your lady, and gun butt your baby\nI'm like the mob nigga, fuck you pay me~!\nI'mma hide my assets, and disappear\nMake a quick twenty mill' and vanish in thin air\nI've finished my work now its time to cop\nAnd meet that Chinese lady at the baggage spot\nI need twelve 12's, and fifty-eight 58's\nCause I got eight sales and they all gon' wait motherfucker!\n\n[Hook]\n\nYEAH!\n{Ha ha... WHOOOOO KID!!}", "year": null}]}