{"songs": [{"title": "So Fast", "album": "Certified Hit Maker", "year": null, "image": "https://images.genius.com/88d940564ba39d25a3dd6ccf554c2f17.1000x1000x1.jpg", "lyrics": "[Intro]\nMmh, mmh\nAyy Royce, you did it right here!\n\n[Chorus]\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I'm getting so slapped (Getting so slapped)\nMmh, versus my bros you get smacked out (Lil’ bitch!)\nWhippin' on the road, we tryin' get that (Tryna get that)\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I’m getting so slapped\nMmh, versus my bros you get smacked out (Smacked out)\nWhippin' on the road, we tryin' get that\n\n[Verse 1]\nMmh, I be smoking boof pack, .30 on me, two-sack\nI just rock some bands, and she want me so bad\nLook at all of them, they noticed\nWhen you front the cash, they think that they can do this\nYeah my bands flew out, then I smoked this\nYou ain't never seen money, yeah I noticed\nThis fly I just mixed, feel like a space man, yeah\nTwenty racks, up in the spaceship\n\n[Pre-Chorus]\nWhat you on, lil baby, what you on?\nThirty on my wrist and that shit will last a hunnid\nWe can make it two, cause baby I am not one\nAnd you a model looking better than everyone, yeah\n\n[Chorus]\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I'm getting so slapped (Getting so slapped)\nMmh, Versus my bros you get smacked out (Smacked out)\nWhippin' on the road, we tryin' get that\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I'm getting so slapped\nMmh, versus my bros you get smacked out\nWhippin’ on the road, we tryin’ get that\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I'm getting so slapped\nMmh, versus my bros you get smacked out\nWhippin’ on the road, we tryin' get that\n\n[Verse 2]\nTaking off like a rocket bitch, I got six bands in my pocket\nYuh niggas, here, take a niggas watches\nFake nigga's diamonds, gotta put them on the watches\nI still bounced out, with the chopstick, uh\nMy brother Taz said watch this then he popped him\nWe was living on the streets, so how could I stop him?\nNow we living how we dreamed but he cannot watch this\nSo I told him over seas, I'm finna rock it\n\n[Pre-Chorus]\nWhat you on, lil baby, what you on?\nThirty on my wrist and that shit will last a hunnid\nWe can make it two, cause baby I am not one\nAnd you a model looking better than everyone, yeah\n\n[Chorus]\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I’m getting so slapped\nMmh, versus my bros you get smacked out\nWhippin' on the road, we tryin' get that\nMmh, I be in the real one going so fast\nMmh, poured out the 8, I'm getting so slapped\nMmh, versus my bros you get smacked out"}], "artist": "Lil Mosey"}