{"artist": "Andy Mineo", "songs": [{"title": "Next Episode", "album": "Saturday Morning Car-Tunez", "year": "2012-05-20", "image": "https://images.genius.com/2f9cf695968b74ddbacf05e3de6499c3.300x300x1.jpg", "lyrics": "[Verse 1: Andy Mineo]\nI've been doing this for so long\nLike the only thing I know\nFeels like the only thing I know(I know, I know, I know)\nI never really thought what I did was so wrong..\nBut my eyes were closed, look at how I got to grow(to grow, to grow)\nThere's things in my life, that I gotta undue\nWhat I thought was so right, now I gotta untrue(true..)\nBut we spoke everyday now we don't even speak at all(speak at all)\nCause I brought you so much pain that you won't pick up my call\n\n[Hook: Andy Mineo & Sheena Lee]\nAnd it's so bittersweet\nHow the one that can love you so much and hurt you so deep\nLight up your day to mess up your whole week\nLock your heart down and keep the key, it goes..\nI-don't-want - for you to be my next episode\nI-don't-want - just another love story told\nI-just-want - you to be my sister\nI see life so much different\nNow that I know what you're worth...\n\n[Verse 2: Andy Mineo]\nIn my quest for them X and O's, in my quest-in my quest for them X and O's\nWasn't being intentional\nNow I gotta big list of some ex's, oh..\nDo I regret those? well yes and no\nThrough it all though I got to grow\nBut it came with a friendship broke\nWas it really all worth it? I'm feeling all serpent\nThat Lecrae line did work when I heard it\n2 bars hit hard like a 2 part sermon\n\"Like Christ, love your wife how He loves the church\nWithout seeing how many hearts you can break first\"\nI was making relationships\nA temporary fix to medicate my loneliness\nTaking doses, of emotions\nVia phone call, when we spoke and\nI planted seeds I really couldn't see you\nCouldn't feed myself so how could I feed you?\nWasn't seeing God so clear how could I see you?\nI was just leading you on but didn't need you\nDang, look at the things we do\nFor our own pleasure we go and use people\nYou ain't even single no more but I wanna keep you\nLook at how it exposed the heart of man is evil\n\n[Hook]\n\n[Outro: Andy Mineo & Sheena Lee]\nNow that I know what you're worth yea...\nNow that I know, I see life so much different\nI see life so much different\nOooh, I see life so much different\nNow that I've been forgiven...\n\n[Hook]"}]}