{"artist": "Cage", "songs": [{"title": "Dust Vs. Ecstasy", "album": "Suicidal Failure 12\" Vinyl", "year": "2000-08-12", "image": "https://images.genius.com/11f969ee23640ebc90fad61758e7a950.600x600x1.jpg", "lyrics": "[Verse 1: Cage]\nI'm clinically diagnosed, so mimic close\nToast Mighty Mi for supporting my drug habits when I'm out of dope\nYou wanna see where the rabbit hole ends up?\nPills, deepen when it nails first, whats up with your girlfriends guts, uh\nWeathermen associate, Worm Kings more appropriate\nCollapse the mic, smoked out, tabs are soaking wet\nWaiting 'til I come down to flick the lights on\nAnd watch the little spiny back bone puncture my writing arm\nEject from my palm, attack the pen\nOpen you with the sharpest compositions, and then play it on your organs\nAfter the false mathematics of tragic habits\nFrom your scattered body parts, and then divide your thinking fragments!\nThe sum is your rhymin' average\nAnd who the fuck you lookin' for when your only squad is your adlibs?\nRipped out your speaking passage with salad tongs\nDon't give a fuck if my joint sold out like Stretch Armstrong!\n\n[Hook: Camu Tao x2]\nRenegade, cutthroat, Dust Vs. Ecstasy!\nStep into wall, space, you fought the equilibrium\nYour outer reach is reaching out to mute your speech\nThe mutant freak! Death to all stars for all eternity\n\n[Verse 2: Cage]\nThrowing triple six in your rhymes, and you ain't Satan's dogs\nGot a head full of Jesus to guide me to where the leak is\nWhile I freak this mormon how fuckin' boring this scores been\nDrug dealers camped out side of my house is doormen\nFuck all these happy drugs I'm lookin' for this relapse\nGet pushed in the face 'til the back of your heads a ski mask\nRun up in Fat Beats with a gun 'cause I got shit to plug\nYou want a bug? Pull my exoskeleton\nPeel my pectoral back reveal a pound of beating mescaline\nEffective when, the worms crawl in then bleed out!\n'Cause the minute any girl dies shes getting eat out\nFuckin' with a pistol in your mouths the only peace route\nIf you find a better exit, show me that piss box\nStuff a dozen infants in a Ziploc for a dirty wrist watch\nSlice my arm, squeeze my palm, over the crowd to calm\nNerves while I craft words like skin into uniforms\n\n[Hook: Camu Tao x2]\nRenegade, cutthroat, Dust Vs. Ecstasy!\nStep into wall, space, you fought the equilibrium\nYour outer reach is reaching out to mute your speech\nThe mutant freak! Death to all stars for all eternity"}]}