{"songs": [{"title": "Congrats", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nNah, I don't love her\nI got a lot of white girls back in the suburbs\nSo how could I just give that all up just for one girl?\nAin't nothing but a word, do you know what you want, girl?\nFind it absurd, do you know what you want, girl?\nMe and the thought of you, you're singing your song with me\nYou're up and you're down, but with me is where you'd ought to be\nAnd after all the arguments, you still gon' be raw to me\nI need you to talk to me\nI need you to say something, baby\nYou won't catch me reading between the lines like a checkout\nTwilight, how a nigga always got his neck out\nQuick to tell a heffer get the heck out\nYou got my upmost respect, I hope you feel that way\nAnd when we old as fuck, I hope it's still that way\nWe started from the ground up, I hope we're built that way\nYou make my heart go *BOOM*\nI hope you feel that, babe\nCongratulations\n\n[Chorus: brandUn DeShay]\nOut of all the contenders, I think I found us a winner\nLet's hear it for the girl, let's give the girl a hand\nCongratulations, congratulations\nCongratulations, let's hear it for the girl, let's give the girl a hand\nOut of all the contenders, I think I found us a winner\nLet's hear it for the girl, let's give the girl a hand\nCongratulations, congratulations\nCongratulations, let's hear it for the girl, let's give the girl a hand\n\n[Verse 2: brandUn DeShay]\nOkay, now I know what you're thinking: 'This nigga must be drinking\nHe going all in after only a weekend'\nGo off the deep end, but I don't need a lifeguard\nI just need to roll up my arm like some Right Guard\nRight after a hard day, this fairy tale starts far away\nBut this is magic like Hardaway\nI probably couldn't have found a harder way to fall in love\nBut fuck it, let the fish burn like Carter say\nYou got the very best part of me\nYou got my heart, so babe, let's play it smarter, K?\nDon't make me hate this\n'Cause all that shit that you tossed like an important call\nI gotta take this\nPraying to God she don't burn me like a blank disc\n'Cause I'm a pro with the pain, on my Hank shit\nThe last level of the game, so we can't win\nWith no coins left, I can't wait to tell the boys this\n\n[Chorus: brandUn DeShay]\nOut of all the contenders, I think I found us a winner\nLet's hear it for the girl, let's give the girl a hand\nCongratulations, congratulations\nCongratulations, let's hear it for the girl, let's give the girl a hand\nOut of all the contenders, I think I found us a winner\nLet's hear it for the girl, let's give the girl a hand\nCongratulations, congratulations\nCongratulations, let's hear it for the girl, let's give the girl a hand\n\n[Outro: brandUn DeShay]\nOut of all the contenders, I think I found us a winner\nLet's hear it for the girl, let's give the girl a hand\nCongratulations, congratulations\nCongratulations, let's hear it for the girl, let's give the girl a hand", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}