{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/cdcdde2343bbd5aa068762ff4189968e.1000x1000x1.jpg", "title": "New Day", "lyrics": "[Intro]\nIt don’t take much strength to pull a trigger\nBut try to get up every morning day after day and work for a living\nLet’s see ‘em try that\nThen we’ll see who’s the real tough guy\nThe working man is a tough guy\n\n[Chorus: Alicia Keys]\nParty people say, party people say\nAy it’s a new day, it’s a new day\nWorld is getting ready, everybody ready, yeah!\nFor a new day, for a new day, celebrate and say\nA-A-A-A-A-A-A-Aye\n\n[Verse 1: Dr. Dre]\nI woke up this morning thinking ’bout the old me\nWhen I was feeling like Miller Lite and Ol' E\nBut now I ride on some conscious shit\nI’m getting bread while I toast to my accomplishments\nOnly one I could have a problem with is myself\nThat’s probably why my only competition is myself\nFrom today to tomorrow the Doc is just rocking the same drum\nFuck the past, though I ain’t forgot where I came from\nI got the club rocking, uh\nI got your girl jocking, uh\nMe and Fif’ still in this bitch, bitch\nWe goin' the distance witchu party people, come on\n\n[Chorus: Alicia Keys]\nParty people say, party people say\nAyy\nIt’s a new day\nIt’s a new day\nWorld is getting ready, everybody ready, yeah!\nFor a new day, for a new day, celebrate and say\nA-A-A-A-A-A-A-Ayy\n\n[Verse 2: 50 Cent]\nNow, you can get your knees on the church floor, pray it get﻿ better\nOr push the dough on the liquor store, see where it get ya\nBut me, I got to be on top\nI said, me I get to be on top\nI got the street on lock\nI’m on automatic pilot, ain't nobody stopping me\nGrowing up in poverty ain't fill my heart with larceny\nNiggas ride, I don’t hide, I dump to get 'em off of me\nI’m a leader, look and see the natural born boss of me\nThey from Bel Air, I’m from the bottom\nSoon as I spot ‘em I get to drop ‘em\nI got ‘em; the competition, red-dot 'em\nIt’s dinner time when the 9 come out\nIt’s off with the chain, off with the ring\nMove, bang, off with ya brain\n\n[Chorus: Alicia Keys]\nParty people say, party people say\nAy it’s a new day, it’s a new day\nWorld is getting ready, everybody ready, yeah!\nFor a new day, for a new day, celebrate and say\nA-A-A-A-A-A-A-Aye\n\n[Bridge: Alicia Keys]\nMarks on the wall\nIt’s now or never at all\nI’m gonna give it my all\nWhether I rise or fall\n\n[Verse 3: 50 Cent]\nTrue story, I said I’d get rich or die trying\nI did it, good luck sucker, trying to stop my shine\nNothing matters but the music, music my first love\nWe paper chasing -- I’m always coming in first, cuz\nI’m built for it, see I’m better under pressure\nI react like a maniac when I’m coming to get ya\nI got to win, Em watch and Dre watch and my son watching\nFuck that, losing ain't an option\nI’m sharp I’m on point\nThe ink from my ballpoint\nThrowing out my pain\nI’m back on my A-game\nI’m focused, for me this is just another victory\nExcept that I’m stronger than an ox now mentally\n\n[Chorus: Alicia Keys]\nParty people say, party people say\nAy it’s a new day, it’s a new day\nWorld is getting ready, everybody ready, yeah!\nFor a new day, for a new day, celebrate and say\nA-A-A-A-A-A-A-Aye", "year": "2012-07-30"}]}