{"songs": [{"title": "Wit Us", "album": "NorthsBest (Mixtape)", "year": "2017-04-07", "image": "https://images.genius.com/d29809dbaa99451ad1b602a7d257ba18.500x500x1.jpg", "lyrics": "[Hook]\nYee, yee\nBitch wanna fuck when I met her\nGucci and diamond, I met her\nIf you is cold get a sweater\nI don't respond to yo' letters\nI cannot fuck with you niggas\nDon't try and flex when you wit us\nWe on that goal when you wit us\nYo bitch on my dick when she wetter\n\n[Verse 1]\nYee, these niggas want me, me so bad\nEvery nigga in this thing switch up so fast, yah\nI won't go a day without blowin' on that gas\nA nigga on that fake shit, know dat shit don't last, yah\nCome on baby girl, come and ride wit me\nMosey love nobody so please don't get attached to me\nUnless you throwing it you can't come and ride wit me\nCause hoes ain't shit and I'ma take yo' bitch, yah\nLeanin' off the Actavis, I swear you a activist\nYah, hella money, yah yah, hella money, aye\nPour up a four, now niggas goin' dumby\nDon't hit up my phone if you ain't talkin bout that money\nLike what you tryna do? You can't roll with me\nSo you can go back to what you do, say\nI'ma roll with crew, you know that ain't new\nNow I'm on that new shit, now homie what it do? Yah yah\n\n[Hook]\nYee, yee\nBitch wanna fuck when I met her\nGucci and diamond, I met her\nIf you is cold get a sweater\nI don't respond to yo' letters\nI cannot fuck with you niggas\nDon't try and flex when you wit us\nWe on that goal when you wit us\nYo bitch on my dick when she wetter\n\n[Verse 2]\nYo bitch on my dick when I met her\nYou know she a groupie, you let her\nWalk out the crib when I met her\nIn love with the game she better\nJust drop a half on my wood, please get off I'm good\nBe awake for good, if you want me, you should\nI don't show no love, why you mad at me?\nWe ain't sayin' that and I fuckin' guaruntee\nIf sober never dropped, you want same bands on me\nI know you agree so don't try come at me like\n\"What happen to you? Mosey actin' brand new\"\nStill got the same damn revenue\nMy fans be gone by two, so now what it do?\nGot big bro's in a jam, you know they gon' shoot, yah yah\n\n[Hook]\nYee, yee\nBitch wanna fuck when I met her\nGucci and diamond, I met her\nIf you is cold get a sweater\nI don't respond to yo' letters\nI cannot fuck with you niggas\nDon't try and flex when you wit us\nWe on that goal when you wit us\nYo bitch on my dick when she wetter\n\nYee, yee\nBitch wanna fuck when I met her\nGucci and diamond, I met her\nIf you is cold get a sweater\nI don't respond to yo' letters\nI cannot fuck with you niggas\nDon't try and flex when you wit us\nWe on that goal when you wit us\nYo bitch on my dick when she wetter"}], "artist": "Lil Mosey"}