{"songs": [{"year": "2014-08-18", "title": "Adonai (remix)", "image": "https://images.genius.com/bfaec1a0bac7ea0de2beca8ef167e036.500x500x1.jpg", "lyrics": "Intro\nYeh! ekyire w) fo) no mony3 no baako mma me wai, go!\n\nCastro (hook 1)\nObiaa nto ne collection (2x)\nObiaa biaa nto ne collection,  God eee…\nObiaa nto ne collection (3x)\n\nSarkodie\n\nTsie! me mma nimpa biaa emmbu wo abofia\nAhopopo amo enya nyinaa woho  ntsi a\nY3 wo tamfo ntsi gyae ma ne wea\nY3mboa mo a mo nsi na mo pia\n\nChorus\nS3 wo ba mo a nuama nyinaa y3 dii\nNana Nyame nea waka no na 3b3 ba mu\nS3 wo ma wo nsa so a bepo nyinaa tutu\nSo ma paadi don't lose guard ka wakoma to wo yamu\nEverybody sing hallelujah! (hallelujah!) (2x)\nMake u sing ooo.. (oh yaah..yaah..)\nI say help me sing ooo..(oh yaah…yaah…)\n\nSarkodie (Verse 1)\nAh! na mo fi s3 m3 hwe ase\nMe k)y3 a ma san aba, hw3!\nAhokyer3 kakra me faa mo ntsi\n)mo se ma waai me ni daama\nMo eni na ewuo no, na mo fi ns3  m3 y3 saasani hw3!\nWo hu me a  na mo yamu ahye wo, afei de3\nWoeni b) me so p3 na wo se woan mpo ni\nNana Nyame ne nsa ano  afei de3 wo hu me 2,2\nMo a na mo se me y3  junky\nNs3 wo nso wo kaa bi shame on you too..\nAfei   de3 mo hu s3 me ma k) balle w) yonkey\nHw3 no ne nim s3 monkey  if I check I dey see say u dey hungry\nWa y3 yie anka wo da so hy3 ab)ski\nMennwu y3 de3 Nana Nyame tse ase\nWo ne me ennya p3, obiaa ne ne wiase\nMr3 a na da bench so wo aflao\nObiaa anfa handkerchief ampepa meni ase   ntsi\n\n\n\nChorus\nS3 wo ba mo a no)ma nyinaa y3 dii\nNana Nyame nea waka no na 3b3 ba mu\nS3 wo ma wo nsa so a bepo nyinaa tutu\nSo ma paadi don't lose guard ka wakoma to wo yamu\nEverybody sing hallelujah! (hallelujah!) (2x)\nMake u sing ooo.. (oh yaah..yaah….)\nI say help me sing ooo..(oh yaah…yaa..)\n\nSarkodie ( 2nd Rap)\nMma mo 3nnkye me 10yrs mewu a nka way back\nMo aflopi this be ma pay back  ma enemies you 4 dey quard\nMe nncurse wo, I don't want to disobey God\nMo try s3 mo ne b3 to prison  w) abr3 a mo ni  particular reason\nMo dwen me ho, me ne tigofo) y3 meeting\nFa to wasomu I don't wana b repeating\nNyame na 3b) me ho ban  ntsi mony3 fokoo\nMoney no b problem 3no ne me moto\nTo w'eni hw3 me honam eni ne me shoto\nMe mma wenni enngye )kyena me y3,dondoo…\n\nCastro (Hook 3)\nWo na w)b) sor ne asaase ne emu no)ma ntsi na y3 fr3 wo Adonai\n3no)ma way3 ama me ne m'ebusuafo as) meni beebree ntsi awulai…\nWo na w)b) sor ne asaase ne emu no)ma ntsi na y3 fr3 wo Adonai\n3no)ma   way3 ama me ne m'ebusuafo nyinaaa…  God eee…\nNhyira na w'ehyira me ma na bu me so yi a  I say God eee…\nMennhu nea me mmfa da w'ase Egya eee…\nBaba God eee…. way3 me k3se me daase Egya eee..\nEgya Nyame eee…3y3 w'adom ntsi na me tse ase  Baba God eee…\nBaba You be too much eee…(3x)  Baba God eee…(3x)", "album": null}], "artist": "Sarkodie"}