{"artist": "King Los", "songs": [{"image": "https://images.genius.com/17fe43f9da145e3408e4f87c517d1110.600x600x1.jpg", "title": "Dreams & Nightmares (Remix)", "year": "2017-12-16", "album": "G.O.A.T.", "lyrics": "[Chorus]\nI know its hard, but you made it out\nI'm so proud of you\nI'm so proud of you\nI know its hard, but you made it out\nI'm so proud of you\nI'm so proud of you\n\n[Verse]\nOoh lately I just been on my vibe\nFriends switching up ain't nobody on my side\nDon't even got no bitches in the ride\nEverybody tricky keep the blicky by my side\nI be damned if you get me fore I get you\nI be damned if I can't turn a 1 to 2\nWhere I come from its hustle or die\nSo you might just sell dope then get by cause you got that struggle inside\nYou are, a king, You are, You are\nCause I said so\nAnd I know you go where that bread go\nWhen that bread go to your head, where your head go?\nWhen these bitches on your dick, where your head go?\nEverybody know you the shit, even the feds know\nBut I don't say a word, I don't say a word\nMan you know the judge hang on to every single word\nPeople in the jury just gone peep you in your jewelry\nFigure you a hood nigga, opposite of good nigga\nI can't stress this shit enough\nTimes get hard when your rollies turn into cuffs\nThey tryna kill us my nigga, you know what's up\nBut if you know your hood like riding a bike, bitch throw it up\nHold up wait a minute, I'm about to kill this\nI'm a dillo colored Bentley nigga arm up out the ceiling charm about to blind the bitch Oh my god I got the feeling\nKill em with a literal syllable drill a few holes in him\nHe been leaking information its a loophole in him\nThen you roll with him and you popped\nThey don't get knocked off but you get locked\nThat'll never happen, used to sell weed but I'm better at this rappin\nCoogi sweater shorty never sweat a bitch but I wet her, better get a napkin\nTake shit I ain't asking, no fake shit I ain't masking\nJust mask up and I take shit, no matrix I ain't gassing\nYou make shift I make shit shift, like paradigms\nI may shoot this shit with a pair of dimes\nBitch I'm straight like I'm paralyzed\nI blew checks like I'm verified\nMy lady taste like a cherry pie\nScary guys don't worry I, shit\nHoping out the ghost the closest I been to terrified"}]}