{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro: 50 Cent]\nI'll give you something to talk about\nCome around me fronting I'll air you out, I go off\n\n[Verse 1]\nI don't shoot shit off dog I gun it down\nWalk up on niggas and run 'em down\nPull a stock out that K throw a hundred rounds\nWon't stop 'til your box lowered underground\nPut you in the urn, your bones will burn\nThe rap guerilla the wack rap ringtone killer\nI'm here, to find a nigga equally realer it's rare\nYou can meet me in the square if you dare to come near\nI have no morals, just a whole lotta piss\nAnd a dick for you, bullets and a clip for you\nThis the ignorance at least it looks that way\nWhen you witness it kill at witnesses\nBury the hatchet, matter of fact bury the casket\nKill niggas bury the ratchet\nPick it back up if I have to, I used to bump niggas\nAnd pump niggas out for the practice\nThe shit starter, the shit finisher, I don't know what's harder\nWhen they release ya or when they sentence ya\nThe realness, back like I promised\nReady to dig a nigga shit like a colonic, I go off\n\n[Hook: 50 Cent]\nI know it's them again from last time remember them\nThey can't believe we back up in the club\nBecause you sippin on that Henny and my bitch will get the semi\nAnd you fuck with me I'm gon' let it off\nI go off! Off in this bitch like it's legal\nA nigga move around with the Eagle\nI go off! We say you get it if we don't believe you\nThis is 50 Cent and Beanie Sigel, I go off\n\n[Verse 2]\nBig Pop, of the prop on deck\nVersace or LV's on the specks\nMy Gucc Los light up the ground when I step\nLook beat it, the kid ain't mine I contest\nI suggest, you aim above neck\nThe vest cover the chest the pine cover the Heck-\n-ler and Koch, I don't rock for the cops\nHorse with the stick in the hands of the jock\nEveryday gear that I wear on the block\nCan you picture me rolling? (Can you see clear like Pac?)\nWho shot ya!? Who want beef with Big Poppa\nFeel a thousand deaths when I drop ya\nI feel for you like Chaka Khan I'm the don\nMake niggas talk through the wire like Kan\nA trip to the morgue turn a duck to a dime\nYou can catch me on my shit, stuck to a grind\nOn a mission, tryna turn a buck outta dime\nOr in the kitchen, tryna turn a fuck outta nine\nNigga listen, I earned every buck that was mine\nI ain't never cry over a fuckin dime don't make me go off\n\n[Hook: 50 Cent]\nI know it's them again from last time remember them\nThey can't believe we back up in the club\nBecause you sippin on that Henny and my bitch will get the semi\nAnd you fuck with me I'm gon' let it off\nI go off! Off in this bitch like it's legal\nA nigga move around with the Eagle\nI go off! We say you get it if we don't believe you\nThis is 50 Cent and Beanie Sigel, I go off\n\n[Verse 3]\nFirst gear pop the clutch\nSecond gear throw it up, third gear I'm on stuck\nFourth gear I'm at Twelve O'Clock\nI know I probably get it in, twelve a block\nBut it's price to low some I'm scared to cop\nGuns a blow, and I ain't scared to pop\nI know niggas upstate doin life in the box\nI know niggas upstate doin life with they pops\nIt's the bully whether you like it or not\nThe chain cool but you don't look right in a watch\nSo give it up smooth, yeah or the rifle'll pop\nWe'll get you some shoes, probably look nice in the box\nFlow smooth, light on my feet like Heav D\nMoney Earnin all day but I ain't from Mount V\nJust threw a bell on the scale of the tree\nI don't know make 'em two hundred every pea\nWithout rap I could double on a D\nShitt, make it snow in a blizzard like Jeez\nYou don't know a noone 'nother like Sige\nYou don't really wanna see me in the streets don't make me go off\n\n[Hook: 50 Cent]\nI know it's them again from last time remember them\nThey can't believe we back up in the club\nBecause you sippin on that Henny and my bitch will get the semi\nAnd you fuck with me I'm gon' let it off\nI go off! Off in this bitch like it's legal\nA nigga move around with the Eagle\nI go off! We say you get it if we don't believe you\nThis is 50 Cent and Beanie Sigel, I go off\n\n[Outro: 50 Cent]\nI'll give you something to talk about, I go off\nCome around me fronting I'll air you out, I go off\n\nYEAH!!!! YOU CHANGED MAN!!!!!\nYOU LET THE MONEY CHANGE YOU JAY!!!\nYOU USED TO BE, FROM MARCY NIGGA!!!!\nNOW YOU A PASS THE GREY POUPON ASS NIGGA!!!\nYOU DON'T WAN'T THE SHOOTERS!!!! I'LL TAKE 'EM!!!\nNIGGA YOU FEED THE WOLVES AND THE WOLVES FEED OFF YOU!!!\nEAT YOU ASS ALIVE! I LIVE BY CONRAD'S CREED, STRATEGY!\nYOUR MOVE NIGGA!!!!", "image": "https://images.genius.com/48636852c4615f230420bca713fc8057.480x480x1.jpg", "year": null, "title": "I Go Off", "album": null}]}