{"songs": [{"image": "https://images.genius.com/15a79e9b319ecd94a9131a5bc8bbd010.1000x1000x1.jpg", "title": "Coco Chanel", "album": "Queen (Bonus Version)", "year": "2018-08-10", "lyrics": "[Intro: Foxy Brown & Boonk Gang]\nWhole lotta gang shit\nBeatzz\nOh, uh, ugh, ayo, Chun, uh, ayo, Chun\nWe back on that Coco shit, nigga, number one, uh\nWhole lotta gang shit\nHaha, every bitch bloodclaat, girl\nOh, ayo, uh, Brooklyn!\nKick for my stomach, let's go!\n\n[Chorus: Nicki Minaj]\nYo, llevame a la coco, yeah a la a coco\nEllos quieren coco, y yo tampoco\nNever trust a broke hoe, don’t fuck with po-po\nNumero uno, me llama Yoko\nPull up in them thing things and let them things fling\nNiggas know my name ring, and it go \"ding-ding\"\nIf I get a inkling, the thing'll sing-sing\nAin't talkin’ 'bout the singer, the thing'll sting-sting\n\n[Verse 1: Nicki Minaj]\nAyo, if I'm in the Gurkha, then they in the back of it\nIf I tell 'em eat food, then they make a snack of it\nIf they take your cocaine, then they making crack of it\nIf they yap your gold chain, then they make a plaque of it\nNo, we never lack on it, run up with the MAC on it\nPut a couple racks on it, they gon' put the whack on it\nShe got the Nicki bundles, word to Stack on it\nThat's word to Brooknam, that's word to Bucktown\nThat’s word to Harlem World, shout out to uptown\nYou know I shine on ’em, I spray sheen on 'em\nThat’s word to Southside, Jamaica, Queens on 'em\nI'm mad Queens on 'em, runn mad schemes on ’em\nI never scale back, the triple beams on 'em\nMy ice gleams on 'em, Wu-Tang creams on 'em\nI pull up on the block bumpin' Biggie \"Dreams\" on 'em (Woop)\nHunnit degrees on 'em, but I freeze on 'em\nA light breeze on 'em, I might breeze on 'em\nMight do it like it's Christmas and light trees on 'em\nI see the copycats bitin' my steez on 'em\n\n[Chorus: Nicki Minaj]\nYo, llevame a la coco, yeah a la a coco\nEllos quieren coco, y yo tampoco\nNever trust a broke hoe, don't fuck with po-po\nNumero uno, me llama Yoko\nPull up in them thing things and let them things fling\nNiggas know my name ring, and it go \"ding-ding\"\nIf I get a inkling, the thing'll sing-sing\nAin't talkin' 'bout the singer, the thing'll sting-sting\n\n[Verse 2: Foxy Brown & Nicki Minaj]\nGimme some bloodclaat, gunshot\nBrooklyn, where the fuck we at? Flatbush, Bed-Stuy\nThat's my word to Big, I'ma murder them rasclaats\nAll black Chloe straps, gally I'ma skully to the back\nFuck my ratchet at? Come make me dutty that\nPuss dem I chat 'bout, back like I never left\nMan down when I come 'round, all y'all bitches bow down\nKing Fox, King Kong, back on my Chun-Li, nigga\nValentino bling thong, all y'all bitches duck me, fuck\nNick, come fuck it up, bad gyal a back it up\nCoco 'pon my foot dem, C's pon my likkle pretty red bow\nSee dem buss one for baby, see dem, chugh!\nPussy whine chime, ay, ay, ay, ay\nThe bloodclaat this, the Moet let me die\nThem bitches in them bum-ass Louis thigh highs\nI'm on my clip, blue jeep, Van Herpen day-days (Woah)\nGun slingers, let me see y'all gun fingers\nY'all bitches dick riders\nLittle Nicki's, little Inga's, woah!\n\n[Chorus: Nicki Minaj]\nYo, llevame a la coco, yeah a la a coco\nEllos quieren coco, y yo tampoco\nNever trust a broke hoe, don't fuck with po-po\nNumero uno, me llama Yoko\nPull up in them thing things and let them things fling\nNiggas know my name ring, and it go \"ding-ding\"\nIf I get a inkling, the thing'll sing-sing\nAin't talkin' 'bout the singer, the thing'll sting-sting\n\n[Verse 3: Nicki Minaj & Foxy Brown]\nFoxy plus one, it's me, young Chun\nAnd we ah-guh fuck up the place and done\nSo tell 'em run, come and bring a lump sum\nAyo Fox, they don't make us or break us, word to young guns\nPut your hands up\nIllest to ever do it, tell' em Fe recognize\nUnuh Kartel, dem fi free up Vybz?\nThey call me Ms. Bitch, but I don't miss, bitch\nGot real shooters, better D up, guys\nWho me? I'm physically fine\nWho she? Inside we know she dyin'\nBitch ain't see Billboard in 2017\nHad to drop Queen on 'em like a guillotine\nAll these jealous bitches on the jelly team\nKeepin' it a hundred, that's a jelly bean\nUh, uh-uh, uh-uh, uh-uh (Mhm, mhm, ayy, ayy)\nUh, uh-uh, uh-uh, uh-uh (Ihh, ihh, ayy, ayy)"}], "artist": "Nicki Minaj"}