{"songs": [{"title": "Tuffer", "album": null, "year": null, "image": "https://images.genius.com/334d02ee258544e3ac2bc2392d939fb5.405x405x1.jpg", "lyrics": "[Intro]\nAs I get this money\nPass these busters\nThe game gets rougher\nSkin tissue gets tougher\n\n[Verse 1]\nI’m so out my mind that my brain is hard to find\nMerlot, not my wine\nHow you doing? I’m doing fine\nWhere you’ve been? I’ve been on my grind\nThey say I’m broke, them niggers lyin'\nSpit that dope when niggas buying\nThere's no hope but niggas trying\nNigga's pussy, vaginal\nPlaying with that beef I turn you into a vegetable\nYour girl having thoughts of me, sexual\nDon’t get mad at me, get mad at my testicle\nI’m the prescription bitch, antidote\n2 shots motherfucker, medical\nWhere the bucks at and are they gettin no action?\nI got the nigga stomach hurting just call it contraction\nYou niggas playing so fugazi and you wear it well\nI can't be lazy, buy Mercedes for my baby girl\nLooking for me, I’m somewhere across the fucking world\nFucking up the money with no condom like the pussy scared\n\n[Hook]\nTuffer than, tuffer than Nigerian hair\nTuffer than, tuffer than Nigerian hair\nTuffer than, tuffer than Nigerian hair\nNigerian, Nigerian hair\nTuffer than, tuffer than Nigerian hair\nTuffer than, tuffer than Nigerian hair\nTuffer than, tuffer than Nigerian hair\nNigerian, Nigerian hair\n\n[Verse 2]\nScrappy for the hustlers, merlot for you busters\nCooler than the fair, but bitch the money keep me stuck up\nI hear them niggas sayin tell them niggas shut the fuck up\nCause I’m still getting bread bitch balling like Butler\nAnd I don’t need bragging ho, I'm just being valid\nI'm digging dollar pallets, yes I'm winning like I'm Khaled\nGot a fetish for that lettuce so I'm moving like I'm ready\nChips, the bust, what the fuck, tell them niggers we can bet it\nYeh I said it fuck your credit, we can put it all on debit\nI'mma curve you like Nike, ho, go ahead and check it\nStay inside your lane, you can’t steer in my direction\nMel Gibson flow, bitch, call it Lethal Weapon\nI'm textin another B, cause the last one wasn't doin shit\nAnd I'm stupid rich, with a foolish whip\nE Pluribus Unum, y'all counterfeit\n\n[Hook]\n\n[Verse 3]\nAiight\nStampede, damn B\nBitches coming at me, all they see is jewellery\nAll over Scrappy\nBut not me, Merlot\nCan't be no Virgo\nRacing to the money and I'm jumpin over hurdles\nI treat it like a track meet\nHoney you're the trap skeet\nBitch press the mothafuckin game like an athlete\nNiggas got amnesia like they don't know Scrappy\nBitches know my mothafuckin name, (what?) nasty\n\nI get it, get it, get it, I’m gone\nI get it, get it, get it, I’m gone\nI get it, get it, get it, I’m gone\nI get it, get it, get it, I’m gone\nI get it gone, I get it gone\n\n[Hook]"}], "artist": "Lil Scrappy"}