{"songs": [{"title": "Deep End", "album": "Drip Harder", "year": "2018-10-05", "image": "https://images.genius.com/94f5c194cc7629cf060714e5795f6c96.1000x1000x1.jpg", "lyrics": "[Intro]\nCook that shit up, Quay\nI know they ain't feelin' my pain\nI got codeine inside my veins, yeah\n\n[Chorus]\nI don't know who gassed you niggas up, go get a refill\nWe got them sticks, we in the field, we playing defense\nHe got his ratchet, no life jacket, ready to dive in\nLil homie thuggin', he can't even swim, he in the deep end\n\n[Verse 1]\nThey offerin' the shooter the death penalty, won't tell on me\nI know if I go broke today, them same hoes gon' bail on me\nI got them throwin' salt, they steady tryna fuck up my recipe\nAmiri jeans, a hundred a pair, ain't nothin' about a nigga cheap\nSellin' weed in the projects, relapsed on the Hi-Tech\nTold the gang that we up next, put 'em on a G5 jet\nOverseas with my sidepiece, my queen, she gotta be a dimepiece\nWe gon' stick together like assigned seats, on that Dej Loaf, nigga, try me\nWhoever thought I'd put a hundred on my neck?\nWhoever thought that I'd say I'm the one up next?\nWhoever thought they'd ever consider me the best?\nWhoever thought, whoever thought, whoever thought?\n\n[Chorus]\nI don't know who gassed you niggas up, go get a refill\nWe got them sticks, we in the field, we playing defense\nHe got his ratchet, no life jacket, ready to dive in\nLil homie thuggin', he can't even swim, he in the deep end\n\n[Verse 2]\nGo and ask about me in the streets, they heard of me\nIf she find out I been creepin', she gon' murder me\nI ain't trippin', no complaints, I got my currency up\nOut of town, I let the windows down so they can see us\nI take the hitters around the globe, that's all I know (That's all I know)\nI met her last night she tried to give me her soul (Give me her soul)\nI got 'em hatin', they throwin' shots, they on their toes\nOne thing they know (One thing they know)\nOne thing they know (One thing they know)\nAin't gon let up on them niggas, once you try us, ain't gon' stop\nIf it's pressure, let me know, so we can pull up with them Glocks\nTryna dodge the bullshit and tryna make it to the top\nIf I never sell a record I'ma make it on the block\nHow you gon wait 'til I make it then try to help me? Nigga I don't need you (No help)\nI put the food on the table, nigga was hungry, I tried to feed you\nTreat all my niggas like bosses, nobody better, everyone equal (Yeah)\nReal talk this the sequel, hold it down for my people\n\n[Chorus]\nI don't know who gassed you niggas up, go get a refill\nWe got them sticks, we in the field, we playing defense\nHe got his ratchet, no life jacket, ready to dive in\nLil homie thuggin', he can't even swim, he in the deep end\nI don't know who gassed you niggas up, go get a refill\nWe got them sticks, we in the field, we playing defense\nHe got his ratchet, no life jacket, ready to dive in\nLil homie thuggin', he can't even swim, he in the deep end"}], "artist": "Lil Baby"}