{"songs": [{"title": "Clutchin’", "album": "DJ Khaled Presents: Life of a Yungsta", "year": "2008-11-11", "image": "https://images.genius.com/8f031b0da464e94383417f6c4f67cc9f.462x462x1.jpg", "lyrics": "[Intro]\nAlright\nRED ON DA TRACK\nLil Phat\nGet used to me ole bitch ass niggas\nNow nigga I'm clutchin, is you cluthcin, cause I'm clutchin is you clutchin\nNow nigga I'm clutchin, is you cluthcin, cause I'm clutchin is you clutchin\n\n[Verse 1]\nWhat it is, what it do?\nIt's all on u, who gone feel da hecka who gone get stoopid with pooh?\nI'm really thuggin I'm clutchin bitch I ain't scary, I'm a hit u in yo face for ivy, h, ronny an berry\nSo think twice for you come playin with me\nAnd I ain't gon let you feel it till u come playin with me\nIt's on my lap, it's in my pocket, on my hip\nUnder my arm bitch I got it\nBig stacks, can't tote no wallets\nThey hatin cause I'm comin through swervin and bitch I'm wildin\nAnd I ain't playin, I'll burn u like a delli ah yea, ah yea, ah yea bitch I'm ready\nI grew up up in dat top, I'm a southside baby\nI was young runnin these streets I ran my mama crazy\nWhen I was 14, I had a highpoint\nI bust that sumbitch jammed on me\nFuck da high points!\n\nBut I was clutchin, I was clutchin, is u clutchin, cause I'm clutchin?\nMy nigga I'm clutchin, is u clutchin, cause I'm clutchin, is u clutchin?\nYea I'm strapped, bitch I'm strapped\nYea I'm strapped, bitch I'm strapped\nYea I'm strapped, bitch I'm strapped\nYea I'm strapped, bitch I'm strapped\n\nMy son called (hello) say he got his first\nWelcome to redrum spelled backwards is dumb\nThem young niggas they bought it all, they thw sickest, they the dummest and we all dawgs... believe dat!\nI be clutchin at a early age, and I'll buss it...\nPat said fukk dem niggas phat, cause dey ain't clutchin...\nDey be reppin like dey do, but dey don't hold da hood down\nDey was tryin to, but dey stood down...\nGotta b in ya blood, to b a thug, gotta b ready to buss if you scrap up in da club\nCause des days niggas ain't playin no mo, catch you slippinwit yo bitch sprayin you and yo hoe\nYou ain't strapped betta... fukk a left quick... go take a nap cause des streets on dum shit(4real)\nIf you want me betta get me 4 I getchu first, you ain't clutchin? den it's gone really hurt!\n\nBut I was clutchin, I was clutchin, is u clutchin, cause I'm clutchin?\nMy nigga I'm clutchin, is u clutchin, cause I'm clutchin, is u clutchin?\nYea I'm strapped, bitch I'm strapped\nYea I'm strapped, bitch I'm strapped\nYea I'm strapped, bitch I'm strapped\nYea I'm strapped, bitch I'm strapped"}], "artist": "Lil Phat"}