{"songs": [{"year": "2017-09-08", "title": "Overdose", "image": "https://images.genius.com/63434c224d99de7c2fa4646da1ed5c4d.400x400x1.jpg", "lyrics": "[Intro: Sarkodie]\nYeah\nAfae na ma sɔre\nMe tee monka akyɛ\n(what you wan do oo yeah)\nHehehe\nYeah, ok yɛnkc ɛrr\nTie\n\n[Verse 1; Sarkodie]\nFuck you talking bout\n80% of rappers copy me style\nI ain't mad ɛyɛ me anigye and am really proud\nCos apart from Reggie monhu rapper sei its been a while\nYeah, ɛyaa na Ghana mma no pɛ me swag\nYvone Okoro hyia me first time otwaa me hug\nNa Becca koraa deɛ nka Nyame ampata a nka ɔtee me komu chain\nƆse ɔfeeli sɛ nea Sarkodie fa so move’ie ne crowd\nYeah\nI guess you wanna know\nHow I keep on running the game for a decade or so\nƐnyɛ me swag ɛnyɛ punch ɛna ɛnyɛ me flow\nMe secrete yinaa hyɛ me tirimu\nI keep it on the low\nAll you got to do is keep it 1hunnid for real\nObi mfrɛ me lawyer ma me na ɛbɛ gye me will\nSɛ me wu a, ɔnfa me punch no bi nkyɛ me nuanom a, ɔmo a’short’i flow\nMe pa no kyɛw cause I know how it feel\nNkrɔfoɔ fresɛ relevancy depends on your hit\nƆmo boa\nDoes it, that philosophy doesn't exist\nƐyɛ a, mo werefi sɛ my biggest hit was Adonai\nThat was two years ago, but still obidi is the ish\nƐyɛ a, mo kasa pii, mo bɔ mɔden n’check’i me records\nOyankopɔn de me baa ewiase mu ha for a purpose\nI swear to God\nSɛ me tu kwan kɔ yɛ me tour no ba a, Asantehene na ɛbɛ hyea me wɔ airport\nSɛ woa te ma siɛ\n\n[Hook: Jesse Jagz]\nSo what you won do\n(what you won do)\nTwo of the greatest\nHow we come through\n(What you don do)\nWhen we step inna the back inna yah yard aah\nWhat you won do\nWhat you wanna do\nYou won show me\nActing like you don’t know me\nWhat you won do\nWhat you won do!\nWhat you don do\nWhat you don do!\n\n[Verse 2: Sarkodie]\nRap no mafa no overdose\nNti na last year me drop’ie 60 collabos\nMe san so drop’ie a couple of singles\nAnd all of those singles a, me drop’ie ne nyinaa nso yɛ fire mom\nNo kissing verse kraa tumi gye the best rapper\nFinally me ne flavour mom, you know the Xfactor\nWo nua mɛbɛn me na me level no yɛ Kanye ne Jigga\nFa wo bobby schmurda life no kɔbɔ prank masa\nMebɔ dwom a, boys no gyegye ho sɛ pasiguard\nDidi a, na ma da yɛfrɛ me adidas\nSɛ mo nbu me kraa mo nfa me nsi bɛbi papa\nNa yento nipa nkwene, tiefi kraa yɛde yɛ biogas\nƐdwom wei nkɔ ma mo a, mo feel’ie sarkodie no flow\nYankopɔn ne disciples me medea ne mo oo\nWei yɛ by the way me tɔn asaase one plot Oyarifa wo a, w’ani gye ho bɔmɔden brɛ me dough\nFiti mmre a, me drop’ie borga borga\nMo anomu nsɛn ny3lɛ duro, elooki rubber rubber\nMo de ntɔtɔfifii wei compare sarkodie a, ayɛ sɛ deɛ wo de aben wo ha compare Bisa Kdei brother brother\n2017 afutuo a, me de bɛma against\nSɛ yɛ tɔn mo kra a, moso mfasoɔ ntɔ me kɔm mu chain\nNti mo nkɔ so ndwene mo ho na mo guso dwen me ho na mede plane nam m’upampamu sɛ Tory Lanez\n\n[Hook: Jesse Jagz]\nSo what you won do\n(what you won do)\nTwo of the greatest\nHow we come through\n(What you don do)\nWhen we step inna the back inna yah yard aah\nWhat you won do\nWhat you wanna do\nYou won show me\nActing like you don’t know me\nWhat you won do\nWhat you won do!\nWhat you don do\nWhat you don do!\n\n[Bridge: Jesse Jagz]\nIf I dail up my babe, She better halla back (shoddy better halla beck)\nCause, Its too much money and I am like ‘shoddy where ya at’ (where ya at ,where ya at)\n(mese)\nYou won show me, quite acting like you don’t know me\n(mese)\nIt’s too much money and I am like shoddy see you better halla back (halla back, halla back)\n(She is dangerous, bring somebody come save me oo)\n\n[Outro: Jesse Jagz]\nSark\nJezze Jagga\nBumba!\n2017 and forever\nIt’s real", "album": "HIGHEST"}], "artist": "Sarkodie"}