{"artist": "Kidd Kidd", "songs": [{"image": "https://images.genius.com/618dea054f2d84c4713013075be1ad0c.1000x1000x1.jpg", "title": "Better Walk", "year": "2011-03-07", "album": null, "lyrics": "[Hook: 50 Cent]\nNigga, you better walk\nCause I ain't into talking\nI hit you up\nI put you in your coffin\nYou see with me? It's really not a game man\nI hit them up\nLay them down\nBang bang\n(2x)\n\n[Verse 1: Kidd Kidd]\nThis around shack where's is at?\nClick clack gimme dat POW POW BAP BAP THAT'S THAT!\nLet my chiddy bang bang, I ain't wit da chitta chat\nPlay my role script was that the code I'm a stick with that\nBeen made my mind up to be the first dumpin'\nSince a nigga shot at me right after we jumped him\nI told Tity, Baby, and Mane not to touch 'em\nI used fuck wit 'em, now I'm like fuck 'em\nDick in the dust, my rider's gon' do it\nReal nigga shit I give 'em the gun to do it\nNigga shit real you can die over your music\nWhatchu gon do kill a nigga youtube it it look stupid nigga\nYou, you, you, and you a bitch\nNow look how I played you..like I do a bitch\nI don't talk it, I walk it, put your coffin on an auction\nMy zodiac sign says caution, nigga\n\n[Hook: 50 Cent]\n\n[Verse 2: Kidd Kidd]\nJust cause you pussy nigga you ain't got nine lives\nI pack 50 shots you get hit 'bout 30 times\nReady N.Y. time, ownin' L.A. time\nTime pickin' you, another dead body found\nAnother day, another died, triple murder homicide\nYou can stay on the side now your family jeopardized\nYou ain't 'bout this gangsta shit, I can see it in your eyes\nMatter fact I can't, talking with your head down\nM-zone gangsta Rida Gang Lone Ranger\nHand in his pocket, keep his fingers on his banger\nDon't sit behind me, see I don't trust strangers\nFor the green I turn also, don't make me angry\nYou got splenda in your gender, pussy in your persona\nScreamin' at ya so hard but sounding like Rihanna\nYou don't even add up, I know you don't the problems\nI can hit a nigga wit a choppa from a chopper\n\n[Hook: 50 Cent]\n\n[Verse 3: Kidd Kidd]\nI'm that bad kid nobody never wanted to play with\nTryna do somethin' evil and get away with\nGrowing up I wasn't always the family favorite\nNow they don't say shit, cause I'm famous\nI hit the block I wanna see ankles spraining\nI'm aimed and cocked, I'm Bangkok dangerous\nDon't run for cover, run for your gun!\nAnd if you ain't got one... run\nStick a fork in that nigga, he's done\nYou pussy, cause you don't get none like a nun\nLike Lennox with the ox I murder for fun\nDon't charge me with Murder-One, cause I'm a murder some\nUh..yeah, yeah murderer, murderer\nLight 'em up, light 'em up, burn 'em up burn 'er up\nNiggas just talkin' shit, I ain't never heard of ya\nKeep walkin' or be a wheelchair purchaser\n\n[Hook: 50 Cent]"}]}