{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/1296191c98641182cc6ae0378210daf7.1000x1000x1.png", "title": "Look Up In Da Stars", "year": "2009-01-01", "album": "Dat Kid From Cleveland", "lyrics": "[Chorus]\nI've got so much to say\nI know I've came so far\nYou understand my Swag\nThe you should look up in the stars\nThe stars, the stars, the stars\n\n[Verse 1: Kid Cudi]\nNo big names. No big chains\nJust Plain Pat visions with some sick aim\nCool Beans though, 10 Deep Jeans ho\nStampede fitted in the range with a knitted\nNo gimmick: Real time, Real heart\nReal words...Elegant: A piece of art\nNo famous name vouch and I'm still the shit\nNigga first couple songs, no guest appearances\nNow you sick, mayne. I ain't takin stabs\nI'm just taking names, then I'm kickin' ass\nI'll never be retro like a Cool Kid\nWith only two songs, look at what I did\nMe and my nigga Wale let them suckas pass\nTill we fed up and wet up Where niggas keep they swag\nTo the 'R'. Ruin niggas hopes of success\nAfter LeBron, I'm what's next\n\n[Bridge]\nLook up at da stars\nLook up at da stars\nLook up at da stars\n\n[Verse 2: Wale]\nNow I'm back on my grizzle, A plethora of strippers\nI'm throwin around broads playing monkey in the middle\nI'm curious Jorge, Fuck what dem whores say\nMost of them is faker than the horse hair they forced in\nI be in the club looking for a couple more of dem\nSorta like my first date. Fresher by the hullin'\nI don't need your girl. Man I got a lot\nThey say he got a lot of whips, well I got A LOT\nYou can't unwind it. Rising and climbing\nAin't nobody brighter... I'm the man Winona Ryder\nLex Luger, narcissist, the mirrors get excited\nThe game is a store, Then miracle what I am\nMaryland where I am, You niggas is behind us\nThere is not a list to find 'em\nAnti-violent...Stylin, Lyrically inclined and\nWho so ever hate, Mother shower him in violets\n\n[Chorus]\nI've got so much to say\nI know I've came so far\nYou understand my Swag\nThe you should look up in the stars\nThe stars, the stars, the stars"}]}