{"songs": [{"image": "https://images.genius.com/2d55ade9a4adefc87c19af8a78677832.1000x993x1.jpg", "lyrics": "[Intro: Richard Pryor]\nI don’t mess around. I had about four womens in my life. That’s right, ‘cause they drain ya. They do; they fuck all the time. That’s right; if you fuck one of ‘em good, you in trouble. ‘Cause she gon’ tell her friend, she gon’ want some. That’s right; and you fuck her, she gon’ tell somebody. And the next thing you know, you got to fuck eight or nine times\n\n[Verse 1: Mac Dre]\nNow how much money can one black man make\nWhen his game be great and seasoned like a tasty steak\nNo limit, I’m in it to hold loot\nCollectin’ scrill like that Golden Gate toll booth\nOld schoolin’ like La-Di-Da-Di\nStickin’ long donk in every hole in a bitch body\nShe lick pipe, but never would I taste walls\nCatchin’ more hoes than Mike Piazza catch balls\nMac Dre, I keep hoes droolin’\nRagooey, still old schoolin’\n’71 glass house with that white interior\nBlowin’ big bomb, drinkin’, rhyme superior\n151 ways I get dumb\nFor every ten times she cum I bust one\nI got stamina, I fuck ‘til the rooster crow\nPut them legs up and let me goose ya, hoe\n\n[Chorus]\nHoes…love it\nHoes…love it\nHoes…love it\nHoes…love it\n\n[Verse 2: Spice 1]\nBossalini, it’s the muthafuckin’ thug in me\nI got a gangsta bitch pushin’ all my drugs for me\nFuck ‘em then get in my Benz, rob their old boyfriend\nNigga gotta stay strapped with Desert Eagles, .44s, Mac-10s (Blaow!)\nShow her how to pull the trigger\nTalkin’ to this thick ass bitch like she my potna, my only nigga\nAnother way to get the lucci\nIs to hide these ki’s up in your muthafuckin’ coochie\nExtra Large in the heezay, with Mac Dreezay\nPut the mac playa shit down up in the Teezay\nBitch come and go on this lick with me\nBorn Killers like Mickey and Mallory\nYou in love with a fugitive\nBounty hunters on my dick, no clues to give\nGot a muthafucka dodgin’ the pigs but I’mma stay at your crib\nSo we can fuck on the table and barbecue us some ribs\n\n[Chorus]\nHoes…love it\nHoes…love it\nHoes…love it\nHoes…love it\n\n[Verse 3: Mac Dre]\nYou never met a nigga like me\nThe M to the D from the CCC, I’m a G\nColder than 40s fresh out the freezer\nDoper than a muthafuckin’ quarter-piece’a\nI got game that make hoes go get it\nFunkier than two fat hoes that just shitted\nOn the same toilet, don’t spoil it, it’s all gracious\nKeep hoes tied up like shoelaces\nMac Dre, boy, that playboy that hoes love\nIf your hutch act dumb, I’m gon’ shove\nYou can run up if you really wanna see Dre\nBut I don’t give a F-U-C-K\nI take wives, lives, whenever it get funky\nAsk your baby mama, nigga, I got donkey\nGon’ be in the Caddy when I’m in that babby\nShe askin’, “Mac Dre, would you be my daddy?”\n\n[Chorus]\nHoes…love it\nHoes…love it\nHoes…love it\nHoes…love it", "year": "1998-04-28", "album": "Stupid Doo Doo Dumb", "title": "Hoez Love It"}], "artist": "Mac Dre"}