{"songs": [{"album": "DiCaprio", "year": "2015-01-27", "title": "LeStudMuffin", "image": "https://images.genius.com/dccbebb129ae1330d5157ffd021203ef.640x640x1.jpg", "lyrics": "[Verse 1: J.I.D]\nSavage, hard-head living, huh\nDevil on my shoulder, I can't see him, I just feel him, huh\nGod is my witness, focus vision, keep a distance, huh\nDream motion living, being broke got me livid, huh\nBitches after bitches, huh, all my niggas 2Pac\nSpeaking revolution or that shit that might get you shot, huh\nThreatened like I'm Biggie, huh\nKicking like I'm Ong Bak\nBitches love Jid 'cause I got three legs and two socks\n\n[Hook: Curtis Williams]\nI smoke more than I eat\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\nI smoke more than I eat\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\nI smoke more than I eat\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\nI smoke more than I eat\n(you so crazy, you so crazy, you so crazy)\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\n\n[Verse 2: J.I.D]\nSavages, let's get back to business\nI was bumping Webbie, webbing through what's in his vision\nRealize the image, was nothing like myself\nBecame something different, I ain't nothing like no one else\nFunny I would say that, sorry that you didn't\nSorry woman, sorry nigga, I feel sorry for your kiddies\nI can't keep it artificial\nI official, all the whistles\nI won't even argue with you\nI'm so high, it's all medicinal\nImma get you high\nPull up on a lones and it get you shot\nTalk a little shit brrr pop pop\nStill called your nigga like Jid Joe Pa, but is Jid Joe Pa\nYeah no naw\nI just fuck, I hit no raw\nThem talk slick, I twist your jaw\nNo boys on leash don't tempt no dog\nAll I gotta do is let 'em off the wrist though\n10 4 niggas shooting from the hip so\nShut eye I can shoot 'em from a disco\nNiggas shooting on the blitz tho\nTouchdown, had to throw the ball to Christo\nNigga had to get ghost\nMe talking shit, broke, pissed and paranoid I'm grabbing on my pistol\nMy bull in a dismal state for dismissal I dipped my dick in gold girl who sent you?\nTell my dick don't get too hard, we out in public being stars\nI would just take you to my whip\nFucked a bitch, flipped a car\nRidin slab, sipping bar\nI heard it from a G before, I always knew I'd be a star\nHad to talk, me and God\nTold me there was two types of people, me and yall\nSorry I ain't seeing y'all, it's gonna take like 33 of y'all\n45s at 4-5 am, no I ain't sleep at all\nAsk me why I go so hard\nAsk me why my flow so hard\nI ain't tripping, I just ask them niggas what team they going for"}], "artist": "JID"}