{"artist": "Yung Joc", "songs": [{"album": null, "image": "https://images.genius.com/22499e1de4fddec5dee3a6c7062bbea4.420x420x1.jpg", "year": null, "lyrics": "Ohh, uh, huh, shit, what up Chino Dolla?\nNew Joc City', here it is\nBut right now you 'bout to witness a nigga gone off that Patron\nAight, I'm talkin 'bout seven shots up, y' know what I'm talkin' 'bout?\n\nSeven shots, shit\n' Boyz 'N Da Hood ', the next round on you nigga\nNow what I want y'all to do? What chu want me to do?\nTake that shit to the motherfuckin' head to the flo' nigga, let's go\n\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\n\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces ery'time I ride by\n\nC'mon me tell me what it do? I do it for the A\nWhen the top drop, rock the platinum Cartier\nGot that Microsoft so they call me Bill Gates\nIce links 'round my neck lookin' like I build gates\n\nI'm Mr. Amoco, yeah, I got the pumps\nPockets on swoll lookin' like they got the mumps\nI'm 'bout my change, gotta get the riches\nFrom the look of thangs y'all gettin' JC Penney's\n\nPass that Patron, the lime's right thurr\nRock with it, lean with it in my Nike urr\nWink my eye at your bitch now she wishin' she could touch\nSee the J's on my feet and she love the diamond cuts\n\nFresh to death, everyday like I jumped up out a caskets\nAsk Chino Dolla 'bout that dope boy magic\nConnected like apartments, keep one in the cartridge\nChevy seats ostrich, name in the carpet\n\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\n\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\n\nI mix Patron and Everglow, I call it anti-freeze\nTake one sip, her drawers fall to her knees\nMister V.I.P., get it like me\nIce piece on my wifebeat I call it Ice-T\n\nKush by the seven, I call it Mike Vick\nShe call me officer, I hit her with my nightstick\nMy swag so mean need anger management\nYou call it what you want, I'm on some ol' eleven shit\n\nThese niggas wanna hate, God dammit we can handle it\nMad 'cause I got juice, call me Tropicana, bitch\nJoc feel good, joc buy the bar\nCatch me in the hood pimp, rollin' on a gar\n\nI plead to the judge, I'm guilty of the charge\nI'ma ballaholic, can't help it I'ma star\nYou see the yellow ice, you holla oh my God\nTryin to guess the price, about thirty large\n\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\n\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\n\nE'rybody wanna know, how I do my thang?\nYeah I get money and I let my nuts hang\nPull up to curb, cut it to the left\nMy rims sittin' tall 'til I dim the knee steps\n\nI just see what I want then I go get it\nThe apple jelly Chevy with the peanut butter in it\nSo don't get mad, pimp keep it cool\nI hang with them goons and the boys keep them tools\nI hustle all day that's just how I live\nStack them big faces, give the strippers dollar bills\n\nCheck the dictionary for a P I M P\nAnd when you look it up, partner tell me who ya see?\nYoung J O C, yeah that's me\nTwenty eight G's, on my feet twenty three's\n\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\nI just bought a zone, J's on my feet\nI'm on that Patron so get like me\n\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\nE'ry, e'rybody love me, I'm so fly\nNiggas throw the deuces e'rytime I ride by\n\nI'm on that Patron so gone that Patron\nSo gone that Patron, so get like me\nSo gone that Patron, so gone that Patron\nSo gone that Patron, so get like me\nGet like me, get like me\nSo gone that Patron, so get like me", "title": "Patron - Amended"}]}