{"songs": [{"album": "Us or Else: Letter to the System", "image": "https://images.genius.com/4a3af1ad50f638f4b221d88c280afff5.680x680x1.jpg", "year": "2016-09-23", "title": "Black Man", "lyrics": "[Chorus: Quavo]\nBlack man, drop top\nThere go the cops\nThere go the cops\nThere go the cops\nIs it because of my people?\nIs it because of my sneakers?\nIs it because of my jersey?\nIt is because that I'm perfect?\n\n[Verse 1: Quavo]\nRidin' down 85, three in the morning\nWhy you pull me over sayin' you smell marijuana? (Smellin' the gas)\nI said I got a ID, I got glaucoma (I got ID)\nHe said, \"We ain't in Cali nigga, get out, put your hands up\"\nRunnin' real hard shook the taser (shook the taser)\nRunnin' real hard shook the taser (shook the taser)\nI told him can we split it, we gon' shake 'em\nNigga hit my phone when you made it (brrp)\nOut of here, PJ to Jamaica\nNaw I ain't tell ya wrong, get the paper\nBeen fightin' too long against haters\nMy attitude, yeah I'm going for the shaders\n\n[Verse 2: Rara]\nLive from the cracks of the concrete\n12 try to take a nigga off the street\nMake the gun sound off for Mike Brown\nTake a nigga life when you face down\nHoodie gang strong like Trayvon\nGun by the window like Detroit Red\nBring that shit by the neck of my woods\nAnd bet a nigga ass end up dead\nPig in a blanket, fuck was you thinkin'?\nFree that nigga Boosie, runnin' at the police\nLeft him with a slow leak, right outside VC\nTryna keep a Phantom like DC\nHangout the G like free Meek\nKill a nigga reachin' for a cell phone\nHurt to tell his mama he ain't comin' home\nThat's why I stay strapped all summer long\nAnd you know it\n\n[Chorus: Quavo]\nBlack man, drop top\nThere go the cops\nThere go the cops\nThere go the cops\nIs it because of my people?\nIs it because of my sneakers?\nIs it because of my jersey?\nIt is because that you nervous? (damn)\n\n[Verse 3: Meek Mill]\nBlack man\nRunning from the law like Pac-Man\nTry and throw the RAW all in the trash can\nGot smoked by a cop on the dash cam\nMug shot on the news, he a mad man\nWhen all he did was hustle to run the cash in\nHe feedin' kids in jail if he wasn't crackin'\nToo many felonies on my jacket\nAll of my brothers turn to assassins\nWe seen too many brothers get put in caskets\nToo many young baby mothers and baby daddies\nIn the graveyard back then\nI went from sittin' on clubs to the cashmere\nYou shoulda seen how I flossed on 'em last year\nTwo Maybachs and I had a bad year\nYoung nigga countin' money like a cashier\nWhite man wanna pay me like I'm U-N-O\nNiggas wanna see me at my funeral\nNeither of my own homie wanna do me though\nLayin' on my dog crib like I'm Snoopy though\nThat's my nigga, I ain't even wanna do it though\nIf I don't do it, shit I know he gon' do me though\nCause he broke and he trippin' 'bout stupid hoes\nBut I'm a Don just like motherfuckin' Julio\nBlack man\n\n[Chorus: Quavo]\nBlack man, drop top\nThere go the cops\nThere go the cops\nThere go the cops\nIs it because of my people?\nIs it because of my sneakers?\nIs it because of my jersey?\nIt is because that I'm perfect?\n\n[Verse 4: T.I.]\nPolice see I got my hands up\nStill wanna kill me, they don't understand us\nThey be lookin' for a reason just to shoot me\nAnd wanna do me how they do us in the movies\nOr how they do it out in Baton Rouge\nOr Ferguson, or Florida, or Baltimore, they make excuses\nLike I did cause I thought he had a pistol\nOr I did it cause I thought he was a Muslim\nMy message to America, felon or death here\nThe liquor we die, we just substances left here\nFirst you put us in a small hood\nAnd then you beat us and you treat us like it's all good\nAnd then shoot us and you screw us economically, mentally\nKillin' nigga, no penalty, they can do that shit legally\nBet I can make that ass think 'fore you shoot\nYou kill me, man there gon' be more of some riotin' and lootin'\nWe say black lives matter, you say all lives\nBut y'all ain't the ones gettin' hogtied\nPersecuted, executed, one day it gon' be time for retribution\nHope you don't ever see your son in an institution\nI know karma is constant and God ain't no nonsense\nYou doin' wrong just to run shit\nOne day the time gon' run out for the dumb shit\nAin't no deception, tryna get in Heaven\nYou gettin' nailed, bet it's on your Mary\nAnd you know what you did for who how much you really care\nAnd what you really felt, he gon' deny the opportunity to unify\nWith people who look similar to you and I\nCause he don't wanna have a\n\n[Chorus: Quavo]\nBlack man, drop top\nThere go the cops\nThere go the cops\nThere go the cops\nIs it because of my people?\nIs it because of my sneakers?\nIs it because of my jersey?\nIt is because that you nervous?\nBlack man, drop top\nThere go the cops\nThere go the cops\nThere go the cops\nIs it because of my people?\nIs it because of my sneakers?\nIs it because of my jersey?\nIt is because that I'm perfect?"}], "artist": "T.I."}