{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Production by Easy Mo Bee]\n\n[Intro]\nDearly beloved, we are gathered here today for this somber occasion. Please join us in the mourning of this U-47. It was a great microphone in its day until it met it's fate. One evening while it was in the studio\nIt was struck by the lyrical force of the Big Daddy Kane. So ashes to ashes, and dust to dust, may this microphone, rest, in peace\n\n[Verse 1]\nKnock knock, guess who? Yes, ooh\nThe Bigger the B, the Iggah the I, the Jigga the G is comin through\nYes I'm the one with clout, they're all talkin' bout\nTo be frank, I have the flavor like sauerkraut\nThe microphone assassinator and furthermore\nI murdered plenty rappers and believe that I'll murder more\nSo if you ask to give the Kane a go\nYou better treat me like drugs, and Just Say No\nBecause I utilize my skills to brutalize\nAnd in a battle, man, you should see what I do to guys\nWhenever the mic's mine, I'll rock a hype rhyme\nAnd come off, like dirty panties at nighttime\nCause any mic that I caress, I finesse\nWith zest, and just bless, best yet to progress\nKing Asiatic, no other rapper stands this\nYou couldn't be a King if you played hockey in Los Angeles\nI gets pi-daid, top gri-dade, gotta admit-eh\nPoint blank, the kid's stri-daight\nCause when it comes to R-A-P-P-I-N, huh\nI got it locked up like a bullpen\n\n[Scratching]\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"If this meaning doesn't manifest, put it to rest\"\n\n[Verse 2]\nRappers I get em and hit em and slit em and split em and rid em\nAcquit em, when I get with em, you can tell that I did em\nI take em and shake em and bake em and ache em and break em\nAnd rake em, you can't awake 'em from the comatose way I make 'em\nCause when you're messin' with me, you know what?\nYou can swallow a live grenade and you still won't blow up\nPickin' up the microphone, you shouldn't dare\nIt's like being on a Stairmaster, climbin' and goin' nowhere\nYou're perpetratin' like you're ready and able\nBut couldn't rock a show if the stage was a cradle\nYour rhymes are old as an artifact, and you don't want no part of that\nSo don't even start it black\nAnyone riffin', I show them how I'm livin'\nAnd give them some of that treatment like my man Michael Bivins\nI smack em up, flip em and then shove em down\nHuh, oh I-ah-ah-I-ah-I-ah-I don't be fuckin' around\nTo rip this microphone like this today\nSince eighty-seven I came a long, long way\nTo headlinin', all the way from supportin'\nAnd I know you've been watchin' me Norton!\nThrough my whole rap career, a lot of young, huh\nRappers sat there, and listened, a lot of young, huh\nRappers sat there, and wishin', but\nYou couldn't see the Kane with X-Ray vision\nAnd just because you didn't see my crew for a few\nA lot of people thought the Wolfpack was through\nBut if you think the Kane and Scoob and Scrap'll breakup\nI tell you like Marvin Gaye, \"Wake up, wake up, wake up\"\nPut it to rest, it's best to 'fess\nBecause the Kane is breakin' rappers like the IRS\nAnd consider this microphone the deceased\nNow may it rest in peace\n\n[Scratching]\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"May you rest in peace\"\n\"If this meaning doesn't manifest, put it to rest!\"", "image": "https://images.genius.com/b6cc17d62fd6810516cc285d9804a8ab.1000x1000x1.jpg", "year": "1993-05-25", "title": "Rest in Peace", "album": "Looks Like a Job For..."}]}