{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/f4be10e87c4c5135ae076c48430a2318.402x400x1.jpg", "title": "Haunted", "year": null, "album": "The Exorcist", "lyrics": "[Killah Priest]\nMy brain's haunted, I got a conscious full of convicts\nBloody tampons, a blonde chick wit cum on her lip\nHer pimp's whole arm could fit\nShe's fuckin' his fist\nMy brain's insane, four walls full of shit stains\nFloor's full of toilet water\nMy used cum will stop at the drain\nRed blood and black paint rain\nWeed residue, here's a better clue\nThe screws are loose, so my head'll ooze\nMe is so nice wit me lyrics\nSick so order, I'ma hafta, don't, them, put, it, this, with\nHa-ha-ha-ha-ha-ha\nAnd did ever that best ah, no one's this better\nNo one's this clever, measure, me to them\nAnd I'll out-weight them\n120 to 85, and y'all quickly advance to a 360\nFrom 360 to 720 to 1540, you just a shorty\nYou think ya cipher zero is the only number that's infinity?\nI destroy that philosophy wit a eight\nNow let's build, you rappers are no frills\nI'm down by law, you sucka emcees sweatin' me for a funky fresh rhyme\nYou come just in time\n\n(Hook)\nJust in time, for the rhyme of the century\nYou come just in time, for the rhyme of the century\nY'all come just in time, just in time\nJust in time, y'all come just in time\n\n[Killah Priest]\nMy brain's haunted, I got a conscious full of convicts\nThey dwell inside my brain cell\nThey tryna escape from the pen\nWait! You said that before and when I'm writin'\nI know, but my flow got indicted\nI make sure that the bars are unbreakable\nMake sure the God is unreplaceable\nMake sure his heart's unerasable\nMake sure the stars are untraceable\nLaws are unmistakable\nCapable to take you to Galaxies\nJust sit in silence then we'll leave\nLook! We're here, just an idea\nNo travelin', just close ya eyes\nAnd the whole place appeared\nThat's the speed of thought\nLook! You're free to walk\n93 millions miles from the Universe\nSee that little star up there that's Earth\nWOW! You think there's life up there\nIt's just a theory, its gettin' weird\nHear me clear, my name is Adam\nIt's the evenin' of the day\nI'm hungry, let's get somethin' to eat\nLet's walk this way\n\n(Hook)\n\n(Outro)\nYeah Woool, Omega mind\nOmega mind-state, Alpha inside\nYeah, most of our tribes are dozen of them\nYeah-yeah, uh, G/Ciples Ridaz, from beyond\nCame down here just to kick it wit ya for a minute\nBlack dust, Proverb unit, uh, yeah\nAll worlds is in one world; one world is in all worlds\nG/Ridaz the oath, continue on till it's ova\nYeah, lift up ya sword, uh\nCode of arms, you know what it is"}]}