{"artist": "B-Legit", "songs": [{"album": "Tryin’ To Get A Buck", "title": "Way Too Vicious", "lyrics": "[Intro: E-40]\nAy, you want me to spit some shit? Right now?\nWhat you wanna hear? Alright, check it out…\nFunky fresh for the AP-9-Tré\nStraight from the muthafuckin’ northern Bay\nIt’s The C-L-I-C-K, all up in your anus hole\n\n[Verse 1: B-Legit]\nLoungin’ in the deuce getting wild and loose\nA young loc get by fuckin’ with St. Ides\nWatching my brother ‘cause I’m loving a pimp\nAnd I can’t wait until I learn his limp\nSo I can walk that walk, mayne, and talk that talk\nSport his clothes and fuck much hoes\n‘Cause as a youngsta, I never knew Nathan\nBut I knew a Franklin could get me some dank and\nI could get an ounce, break it down to 20s\nMake my money back and I still stack plenty\nWith attitude, man, dude, I knew (What you knew?)\nThat I’ma be a Savage in 1992 (’92, ’93)\nA hog muthafucka, filled with anger\nA 30-round clip with one in the chamber\nAnd my mean mug foul, make me look suspicious (Why’s that?)\nBecause I’m way too vicious\n\n[Verse 2: E-40]\nNow that I’m knowing some thangs\nYou know, like running this here rap game\nSome ol’ scandalous ass muthafucka wanna put dirt in my name\nBoy talkin’ about E-40 and The Click, they the muthafuckas going around here doing all\n\nThis damn jackin’\nKnowin’ we ain’t doing nothing but rappin’\nWe just some rapped out muthafuckas…MUTHAFUCKA!\nNever could be a busta…MUTHAFUCKA!\nHella folks be lovin’ us ‘cause we real about this shit\nMy city is on the map now ‘cause of the different styles that we spit\n\n[Verse 3: B-Legit]\nEeny-meeny-miney-mo, catch a nigga by his curl\nGot my money, let him go, if not, nigga, shoot the hoe\nAnd let it be known that I’m strapped and ready\n‘Cause it’s fonk when you fuckin’ wit’ fetti\nScrappin’ like hogs ‘til the end though\nAnd I was hittin’ muthafuckas like indo\nTackin’ ‘em out, mayne, and that’s fa sho (Who was it?)\nMe and 40 Water, lettin’ ‘em know\n\n[Verse 4: E-40]\nThat we was shakin’ ‘em up, wreckin’ ‘em up, breakin’ ‘em off proper\nBulletproof vest, Glock 10, and a chopper\nI go Sing Sing, sick in the head, Napa State retarded\nHollow point hot ones dipped in garlic\nI ain’t no sucka, so don’t call me Lollipop\nUh, fuck around and make me mad and I’ma blow my top\n(Where you from?) You see, I’m straight from the northern Bay where they spit loogies at\n\nHoochies\nI’m down with The C-L-I-C-K and we smooth old schools, not Suzukis\nBeanie caps, pea coats, and all that\nMuch dap to my little brother Young Mugzi way up there in Sac\n(What he doing?) Strapped after dark and I know he’s with this\nHuh, ‘cause we way too vicious\n\n[Interlude: B-Legit + E-40]\nYeah, man, a muthafucka way too vicious in this whole shit, you know\nA muthafucka just can’t run up without getting done up, you know what I’m sayin’\nMuthafuckas overheads in this, boy, you gotta be on your P’s and Q’s, boy\nWatch your back at all times, mayne\nKnow what I’m sayin’, play your cards right, junior\nYou never know what goes down on this side of town\nAy B, drop that ol’ shit about that other situation, mayne\n\n[Verse 5: B-Legit]\nShit got fonky again last night\nSo I did a drive-by in broad daylight (Broad daylight?)\nMobbed through the ghetto with the ski mask down\nHopped out the Cut’, let loose some rounds\nBoom boom boom (BOOM BOOM), and it was dropper\nOn straight drama, I think I heard a nigga yell “Mama”\nBut she can’t help ‘cause she was hittin’ the dirt\n(What else?) Fucked up her hip, and ripped her skirt\nAnd guess who comes through?\n\n[Verse 6: E-40]\nWho? Me? Perkin’ off some of that Rossi\nMe and my whole Mossie\nAmped, geeked, juiced, stoned\nTwisted, burnt, full of it, gone\nIn a four-barrel Camaro so we can get up out\nReady to melt some muthafuckas and take the under route\nBut here comes the po-po’s (DAMN!)\nHe fucked our whole little PROGRAM\nNow we gotta outsmart ‘em, skee-skrt\nHit a couple of corners, that’ll work\nTurned off the lights, got out the car, and you can kiss this\nBye-bye now, ‘cause we way too vicious\n\n[Outro: B-Legit + E-40]\nAy B, ay, the proof is in the pudding, boy\nAy, muthafuckas way too vicious, boy\nYeah, muthafucka come in here with a master plan, man\nFull diagram and the whole bit\nAy, that’s real though, you know\nAin’t no tellin’, that’s what Jack told Helen\nMuthafuckas like us be like really bellin’, mayne, you know\nYeah, on the gooch though, you know\nAy, been a long road though, boy\nLong road, mayne—we in here doing this shit though for the tré\nFor the muthafuckin’ tré\nYeah, moving on, boy, Sick Wid It Records, boy\nFinna expand on they asshole, too\nYeah\nHahahaha, that’s real though\nYeah\nWe be keepin’ that shit like on the super side\nOn the super super super side\nAy, pass me some of that Rossi though, junior\nHere you go, what\nThe muthafuckin’ Savage is in the house, hahahaha\nYeah\nThat’s real, nigga; that’s my muthafuckin’ nigga", "image": "https://images.genius.com/74a9823de7dc19926792c781ad32b5ec.297x297x1.jpg", "year": "1993-08-28"}]}