{"songs": [{"title": "Hard Hitters", "lyrics": "You can smoke one to the head to this\nRizin Sun, Young Buck (What), First Born (What), and D-Tay\nThem four hard hitters nigga and we back\nAnother dope track, know what I'm sayin' what yo\n\n[Verse 1]\nYo we them hard hitters\nThem drag you out the yard niggas\nBout to squab triggers\nThat leave you in the dark nigga\nWe raw nigga\nThem same superstar nigga\nThem anytime goin' right ain't no bar nigga\nWe blow figures\nTo show you who the boss nigga\nThat drops niggas\nWith the chrome Moss nigga\nYou lost nigga\nSee T.I.P. don't like the game\nYa get outta line and T.I.P. gon' like they aim\n\n[Verse 2]\nIs it my turn to show them niggas we be stars on tracks\nStart up beef, we in yo front yard with gats\nSo don't go with that, we leave you flat paralyzed from the neck\nWith a motherfuckin' hole in ya back\nIt ain't my fault if you balled hard\nStart slimin' up the walls, leave him in his draws\nNigga you know the protocol\nWe were born for hard ball\nStealin' cars and livin' life hard ya heard me\n\n[Hook]\nIf y'all gon' ride with me, get high with me\nThen go and get the straps nigga gunfire with me\nYou'll die quickly, when we apply all fifty\nMy real niggas, hard hitters they ride with me\nIf y'all gon' ride with me, get high with me\nThen go and get the straps nigga gunfire with me\nYou'll die quickly, when we apply all fifty\nMy real niggas, hard hitters they die with me\n\n[Verse 3]\nWe did it all in our lifetime\nDealin' drugs, bustin' them slugs\nRunnin' with thugs, when it get down to them broads\nThey ain't showin' no love\nPut his face in the mud\nFuckin' with the hard hitters, D-Tay my nigga\nGot contracts to get 'em, lyrical spitter\nWe slaved on the figures found out who's better\nFrom Nashville to Chucktown we go round for round\nCity to city and then we knock it down\n\n[Verse 4]\nYeah we'll lock it down\nThen we hit these niggas spot up with fifty rounds\nThe best pound for pound\nRepresentin' the town\nThat'll clown when it's time for the showdown, better slow down\n(D-Tay unload the four pound)\nThis shit's about to go down nigga\nWhoa now leave these niggas shit tore down\nWhole town be locked down\nGot the whole world shocked now\nT.I.P. on top now\n\n[Hook]\n\n[Verse 5]\nI'll put it all on the line for these gangsta ass niggas of mine\nFirst Born, D-Tay we hard hitters combined\nTalk shit and ya dyin' if ya think that I'm lyin'\nAsk that nigga named Bryan, caught six in the spine\nAnd we ain't hard to find we just sleep in the daytime\nAfter the sunshine we duckin' for war time\nYou said you want what now\nSee go to war nigga, hard hitters we buck wild\nJust us four niggas\nSee we live for gunfire, kick in ya door nigga\nIf we come at lunchtime, we afternoon killers\nWho that playa with mine\nMust be some new niggas\nWho done did some time and wanna mitch new figures\nGet the tools niggas, let's show the world how we abuse niggas\nCock back the hammer and just shoot nigga\nAll for the loot nigga\nWe ain't no cute niggas\nTryin' to knock boots nigga\nWe out here choosin' nigga\n\n[Hook]", "album": "T.I.P.", "year": null, "image": "https://images.genius.com/d018174ecb7b887477659509ddf44ca3.499x499x1.jpg"}], "artist": "Young Buck"}