{"songs": [{"album": "Still My Moment", "image": "https://images.genius.com/5642e667af937b3fddc3ff27bc5c68b8.1000x1000x1.jpg", "year": "2018-11-09", "title": "Hooters", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah\nYeah, yeah\nIf I tell my niggas to die for me\nAnd my niggas ask me to die for 'em\nTay Keith, fuck these niggas up!\n\n[Pre-Chorus]\nIf I tell my niggas to die for me, them niggas dyin'\nAnd I'll do the same, this shit ain't one-sided\nHundred racks on me, no re-up, it's profit\nFuck up your city then meet with the pilot (Nyoom)\nYeah, yeah (Yeah,) we outta here\nYeah (Yeah,) yeah (Yeah,) yeah (Yeah,) we outta here, ayy\n\n[Chorus]\nShittin' on niggas, no sewer (No sewer)\nTeachin' these niggas, no tutor (No tutor)\nNiggas run around actin' just like hoes\nGo get a job at Hooters (At Hooters)\nShittin' on niggas, no sewer (No sewer)\nTeachin' these niggas, no tutor (No tutor)\nNiggas run around actin' just like hoes\nGo get a job at Hooters (At Hooters)\n\n[Verse 1]\nTreat these hoes like one point gang (One gang)\nI'm leavin' right after I score (Swish)\nI walk in Gucci like \"What you got in the back?\"\n\"Don't want what y'all got on the floor\" (Exclusive)\nJust bought a crib in The A (Mansion)\nThat bitch look like a resort (Big)\nY'all do the shit for the fame\nKeep the awards, give us the rewards (Okay)\nAyy, remember back when niggas doubted me? (Doubted me?)\nMy Prada fit on, is you proud of me? (Proud of me?)\nAin't got no Activis, Quali- me (Quali-)\nOpps keep droppin', they tired of me? (Bow!)\nHey, little dog, keep my name out your mouth\n(Keep my name out your fuckin' mouth, nigga)\nI'm a big dog, have niggas that'll aim at your house\n(Brrraaa! Pow!)\n\n[Pre-Chorus]\nIf I tell my niggas to die for me, them niggas dyin'\nAnd I'll do the same, this shit ain't one-sided\nHundred racks on me, no re-up, it's profit\nFuck up your city then meet with the pilot (Nyoom!)\nYeah, yeah, we outta here\nYeah (Yeah,) yeah (Yeah,) yeah (Yeah,) we outta here, ayy\n\n[Chorus]\nShittin' on these niggas, no sewer (No sewer)\nTeachin' these niggas, no tutor (No tutor)\nNiggas run around actin' just like hoes\nGo get a job at Hooters (Hooters)\nShittin' on these niggas, no sewer (No sewer)\nTeachin' these niggas, no tutor (No tutor)\nNiggas run around actin' just like hoes\nGo get a job at Hooters (At Hooters, nigga!)\n\n[Verse 2]\nLabel just called\nSaid the check was clearin' now\nTake a dime, pin her down\nScream my name, lemme hear it loud\nI tell a bitch to top me, that bitch gon' top me\nCan't do the same, that shit one-sided\nI just tacked on you a real big diamond\nShit, it's blindin', where did you find it?\nBig face Relly, no tick-tock (No tick-tock)\nBig boy bag, no Ziploc (No Ziploc)\nShe wanna talk to me privately (Privately)\nSendin' me pics of her privacy (Flick)\nPlease don't become a opp to me (No)\nThat's like screamin' body me (Bow!)\nPolice come get me I do like a G\nAnd be quiet like I'm in the library\n\n[Pre-Chorus]\nIf I tell my niggas to die for me, them niggas dyin' (Rah, rah, rah)\nAnd I'll do the same, this shit ain't one-sided\nHundred racks on me, no re-up, it's profit\nFuck up your city then meet with the pilot (Nyoom!)\nYeah, yeah, we outta here (Gone)\nYeah (Yeah,) yeah (Yeah,) yeah (Yeah,) we outta here (Yeah, yeah, yeah, yeah)\n\n[Chorus]\nShittin' on niggas, no sewer (No sewer)\nTeachin' these niggas, no tutor (No tutor)\nNiggas run around actin' just like hoes\nGo get a job at Hooters (No tutors)\nShittin' on niggas, no sewer (No sewer)\nTeachin' these niggas, no tutor (No tutor)\nNiggas run around actin' just like hoes\nGo get a job at Hooters (Hooters)\n\n[Outro]\nYeah, yeah (Yeah,) we outta here (No sewer)\nYeah, yeah (Yeah,) we outta here (No tutor)\nIf I tell my niggas to die for me, them niggas dyin' (Yeah, yeah, yeah)\nAnd I'll do the same, this shit ain't one-sided (No Hooters)\nHundred racks on me, no re-up, it's profit (Yeah, yeah, yeah)\nFuck up your city then meet with the pilot (We outta here!)\nYeah, yeah, we outta here"}], "artist": "Tee Grizzley"}