{"songs": [{"title": "Sick & Tired", "year": "2016-03-09", "album": "Imperial", "image": "https://images.genius.com/c8533a29979af0e2ddda2a88a0639cb0.1000x1000x1.jpg", "lyrics": "[Intro: Green Store Skit]\nMan, fuck that. I've been out here all day man. Let me get one of them things, man\nMan, bruh, I told you 'bout smoking them shits\nMan, I'm a grown ass man, fuck you talking 'bout man? Y'all niggas know I been out here all motherfucking day\nAight, aight. Me too nigga, fuck you mean. Let me see that shit\n: was just chilling -- hold on, hold on. Ay ay ay, hold on bruh, you see that nigga right there, bruh?\nWho the fuck is that?\nI'm telling you, man. That's fool right there\nNaw man his shit all blonde ---\nNaw bruh, I been seeing this nigga, bruh, man, he acting like he been too good for the hood and shit. he don't be coming round no more. That's fool from the other side\nMan look, bruh, this is what a nigga gon do. A nigga gon make an example out of this young nigga. Man, I'm telling you, bruh, we gon capitalize. This is what we gon do. We gon sit out here. We gon make this play bro. I'mma sit out on this nigga right here man. We gon get him\nRonny J, listen up\n\n[Verse 1: Denzel Curry]\nI been peepin', searching for a pussy nigga photo, woo\nGive me all of that or you ain't coming back nor baby boo\nI just need it - I’m anemic and I know it’s critical\nAnd I’m sorry if I up the stick and have to click on you\nI ain't going back to jail, nigga, fuck the feds\nIf I gotta kill a nigga, gotta cut the dreads\nPut him in his spot, nigga, run the bread\nBefore I nut up put a gun to your head\nZ3 yeah Z4, frankly I don’t know\nPosted sellin' green so not no mo’, cause a nigga is tired of being broke\nAnd I’m tired of living off my folks\nMy old girl need some help\nAnd my girlfriend bout to have a jit\nPlus I don’t want him growing up saying that he never had shit\nThat he never had it, but based on analysis\nI never seen challenges, I look at his Roley I know that he flashin' it\nI wouldn't mind seeing blood just like I got off dialysis Lord of the dark and violent\nOnly know imperial niggas move in silence, look that old boy yeah you shining\nSteve got gold, and his girl got diamonds\nHopping in the whip, 2 niggas riding\nWe all gon die nigga fuck reclining, we all got 5 lets get behind em\nLet's go get em\n\n[Chorus: Denzel Curry]\nWho’s that peeking in my window?\nBaby, please pass the extendo\nHey yo, they tryna take my cheese and my steelo\nTwo 44s at your head, don’t be a hero\nI said who’s that peeking in my window?\nBaby, please pass the extendo\nHey yo, they tryna take my cheese and my steelo\nTwo 44s at your head, don’t be a hero\n\n[Verse 2: Denzel Curry]\nI been seeing, watching cause these niggas got it in for me\nFlexing flashy wrists is correlating with my golden teeth\nDiamonds all around a neck and it came with a diamond ring\nI done seen all kind of shit, what niggas do over finer things\nThat’s why I carry the nine on me that’s a three times three extendo, that’s a 10-4\nSeen them niggas on the 191, but a nigga peep game on the 194\nWoah, bending corners just to see if they followed us\nSweating bullets, heater under my cardigan\nThese type of niggas is known to be poppin' shit\nDeep in my thoughts, know who the prophet is\nTryna to take my wealth, gotta protect my wifey and my jit\nGotta set an example if you thinkin' I'm a walking lick\nNever believed in lawlessness, but I could be with the shits\nWhen I’m nervous it's dangerous, if the police pull up then I tell em I’m innocent\nThey tried to run down on us, pulled out the clip then I empty it\nLords of the dark and violent, just ended up on the pavement, quiet\nThis is the reason why niggas divided, pray to the lord I don’t get indicted\nSend me all the way to Rikers Island, dead on the ground now he’s a carcass\nThat’s our guy, nigga, that’s our target\nLet’s go get em\n\n[Chorus: Denzel Curry]\nWho’s that peeking in my window?\nBaby, please pass the extendo\nHey yo, they tryna take my cheese and my steelo\nTwo 44s at your head, don’t be a hero\nI said who’s that peeking in my window?\nBaby, please pass the extendo\nHey yo, they tryna take my cheese and my steelo\nTwo 44s at your head, don’t be a hero\n\n[Interlude: Police Chatter]\n(Calling backup, calling backup, calling back up right now\nWe have a young nigga on the ground right now\nUhh, dreadlocks, black tee, call the paramedics right now\nSuspect is in a white Porsche\n2 other suspects in the vehicle\nPlease follow them, we got a problem now)\n\n[Outro: Denzel Curry]\nAy yo, when I see that nigga again, foo, he ain't gon get away from what the fuck he did to my dawg nigga. I don't give a fuck if the nigga is flashing. imma take his shit, fuck his bitch, kill his jit. that's what I'm gon' say. that's all it is. knotty headed ass niggas out here bruh. we all we got, woo-woo. WOO-WOO. that's all we got\nWOO-WOO"}], "artist": "Denzel Curry"}