{"artist": "Canibus", "songs": [{"title": "Calling All Soldiers", "album": null, "year": null, "image": "https://images.genius.com/86dfaf46c1f97aa0d3bdebf581f58529.1000x1000x1.png", "lyrics": "[Canibus]\n\nWise speech sterilise beats with wide-range reach\nSubsequent to the usage of such applied techniques\nThe Wonderful Wizard of bars, of imagery beyond the stars\nLyrical law behind the beacon of thought\nI'm like Igor with eagle claws ripping meat off\nScreaming \"turn the beat off\", the metaphor is a green hawk\nThat is barefoot with bear gut, black grizzly haircut\nThe barrel of the shotgun bigger than a beer mug\nDrunk operate the iTouch with eyes shut\nPull a file up, try to select Can-I-Bus\nIn the struggle for survival brothers become rivals\nMothers become homicidal cussin' at the bible\nMicrophone check one-two, who is this?\nUniversal personal trainer for lyrical fitness\nAt rehearsals spitting verbals, jumping over beats like hurdles\nI'm here to observe you not hurt you\nThe greater and the lesser can only become better\nBy working together, you'll find this out in your first semester\n\n[Hook]\n\nIn the struggle for survival brothers become rivals\nMothers become homicidal cussin' at the bible\nIn the struggle for survival brothers become rivals\nMothers become homicidal cussin' at the bible\nIn the struggle for survival brothers become rivals\nMothers become homicidal cussin' at the bible\nIn the struggle for survival brothers become rivals\nMothers become homicidal cussin' at the bible\n\n[Canibus]\n\nDelineating what is invading from what is escaping\nSolutions for saving hip-hop that are still in the making\nAs soon as I stop talking I stop producing carbon\nSpitting indigenous verses for medicinal purposes\nAmmonia distilled from dung fills in my lungs\nI feel drunk, but that's where I get my skills from\nTake water from Jordan river and share it with rippers\nMetaphors and lyrics, that's what we call a business\nDo or die, but I survived, who am I?\nAlone in my room staring at the moon, do I cry?\nYes I do, ain't no more tears left for you\nI share the truth and do the best I can do"}]}