{"artist": "Isaiah Rashad", "songs": [{"title": "Gusto", "lyrics": "[Intro: Isaiah Rashad]\nI gotta, um... I been drinking\nI feel like making fun of niggas (Bitch)\n\n[Verse 1: Isaiah Rashad]\nAy, bitch I'm back, nah, I'm just starting\nMan them niggas gonna hold you back, you're retarded\nCrazy loc told me hold that gat, don't be a target\nQuit smoking them blacks, practice performing\nBitch I'm back again, and I'm rolling, see I really mean that shit\nShe 'bout 5'5\" and she rude, man I really queen that bitch\nAnd ain't did shit, and ain't paid\nI ain't tryna seem that rich\nCan I get a discount on these Lays?\nIs he 'bout to kill this rhyme where you stay?\nSo how you different? How you unique?\nWho you tempting? Where's your mystique?\nI just ride around in my Bentley, it's a Civic\nSee the women love when I'm honest, they said it's different\nI don't get how all these rappers be so successful\nThey tell you lies, and nothing helpful\nBut you claim you feel it, yeah that's your man though\nYou stand for him, but what he stand for?\n\n[Hook: Isaiah Rashad]\nI'm just riding 'round getting paid\nFucking bitches, getting paid, gusto\nI'm just riding 'round getting paid\nFucking bitches, getting paid, gusto\n\n[Verse 2: Brian Cameron]\nHey, bitch I'm back, like where the fuck I started?\nThese niggas thinking they the shit, but they ain't even really farted\nReally thinking that a nigga on blaze, I ain't even tryna spark it\nYour chick be all on my cock and balls, now tell your bitch quit gargling\nI promise I'm authentic, straight genuine\nI working out, shit I'm in the same gym you in\nSo he got a big deal? Big deal\nSo what he spit some shit that ain't real?\nGet lit and write some shit you can't feel\nSo you can get expensive shit and switch heels\nGoddamn, that's a problem, y'all fucking up my genre\nSee me? I'm a pro-masturbater\nNigga I be killing and spitting it when I rap\nYearn for the cat, he be earning the map\nGot a hole in her teeth, put my sperm in her gap\nCamerino on the job\nWhy these niggas so wack, let me ask Rashad\nLet me ask a motherfucker like you\nWho speak weak shit, cause the clique said \"Cool\"\nThey say \"Bro you the shit, man the world gonna be bumping this\nWhen you get real big and put us on, are we all gonna be rich?\"\nGet off my dick nigga, we ain't friends\nJust another bitch with another loose end\nSee you at the top, and until then\nJust choke on my pubes and swallow my kids\n\n[Outro: Brian Cameron]\nI'm just riding 'round getting paid\nFucking bitches, getting paid, gusto\nI'm just riding 'round getting paid\nFucking bitches, getting paid, I'm high as fuck", "image": "https://images.genius.com/c7cea3b4e8e2ba385a1b2d5258952e1b.630x630x1.jpg", "album": "Welcome to the Game", "year": "2012-07-27"}]}