{"songs": [{"title": "Rapper Thing", "image": "https://images.genius.com/c519c6649f34e1ff822b69c889d2fc52.304x304x1.jpg", "lyrics": "[Verse 1]\nEverywhere I go I'm trying to do my rapper thing\nI run into a crew of dudes that want to do the same\nWell, listen closely, I'mma give you some game\nHow to get your thing together right and get you a name\nThe first rule is you gotta be you to the upmost\nBring the listener to your world and pull 'em up close\nLet us see how it feels to be in your shoes\nTake the journey that you're on, see what you go through\nWhat is it about you that makes you different?\nAnd what about your story makes it interesting?\nCan you really make me feel it when I'm listening?\nCause if not then ain't nobody trying to give a shit\nThere's a lot better ways of making money\nSo if that's why you're here quit now, take it from me\nThe first decade or so is gonna be hard\nSo the work in itself is gotta be the reward\nIf there's something you could be doing, boy, you probably should\nShit is not how they make it seem in Hollywood\nBut if you can't sleep at night cause your ass gotta write\nJust to feel right, then it'll all be good\n\n[Hook]\nPlease listen to my demo\nI gotta kick a little shit to let my friends know\nNever let go, live out your dream\nJust know that nothing in life is what it seems\nPlease, please listen to my demo\nI gotta kick a little shit to let my friends know\nNever let go, live out your dream\nJust know that it's not\n\n[Verse 2]\nThey call it show business, should've called it business show\nIt's a business first, ain't that how that saying go?\nI say nevermind that shit, just let it grow\nBrother, use your common sense and go for what you know\nThe most important relationship you have\nIs between you and your craft, don't ever forget that\nBusiness only matters when your ass is in demand\nYour success depends on your connection with your fans\nAnd if you plan on taking money from their hands\nYou better give them as much in return as you can\nGive 'em albums they can listen to for years\nGive 'em great live shows, give 'em blood, sweat and tears\nI'm not saying these folk won't try to play you\nBut you stay true, you don't need them to embrace you\nEmbrace yourself, but then brace yourself\nCause you're gon' be staring in the face of hate itself\nCan't get distracted with that kind of shit\nCause fans decide who the real headliner is\nIf you can't get something without being a bastard\nYou have to ask yourself if that's really worth having, man\n\n[Hook]\n\n[Verse 3]\nIt took like 15 years for me to get what I want\nBut that time would've passed wether I was trying or not\nSo what's a fella to do?\nYour life is gonna be what you dedicate it to\nSo everytime we celebrate something new\nIt opens new doors that we get to pressure through\nI guess I knew with every level I grew\nI expect more from me than I'd ever expect from you\nYour work is a reflection of you\nSo put your whole ass in everything that you do\nThis is your life, gotta live it your way\nAnd then you gotta let them chips fall where they lay, my man\n\n[Hook]", "year": null, "album": "Left In The Deck"}], "artist": "Brother Ali"}