{"songs": [{"year": "1994-01-01", "album": "Ass, Gas, Or Cash (No One Rides for Free)", "image": "https://images.genius.com/82ea5b0841bddad3be771a5b1b5f1817.600x596x1.jpg", "title": "Make The Music", "lyrics": "[Intro]\nGirl: Is it good? Do you like that?\nBarry White sounding dude: Ladies and gentlemen. We have a young lady making her way to the mic with some big ass motherfucking lips. She's gonna sing a song that's gonna blow your socks off. But first...it's that nigga K-Dee. Sho' yo' right\n\n[Verse One]\nYou make me woo-woo-woo\nWhen you do what you do to me\nThe K to the Dee\nKissing on my naval\nBut wait one goddamn second\nDo my mic need checking? (Oh yes)\nSo check one, two, one, two, one, two, one, two\nMy balls are blue, they blue, they blue, they blue\nSo what you gon' do is take a trip down south\nBlow my trumpet as I dump it in your mouth\nAnd you can work me like a Slurpee\nDamn, I'm jerking it must be working\nPutting on the hits, the best thing since grits\nGirl I got the shits fo' ya\nSounding like the 5th Symphony\nAnd I'm glad that you ain't no kin to me\nCause if you was my cousin you'd still be a trick\nSo get the lick\n\n[Hook] (Ice Cube)\nAnd make the music with your mouth bitch\n(K-Dee baby!)\nAnd make the music with your mouth bitch\n\"The art of sucking dick\"\nAnd make the music with your mouth bitch\n(K-Dee baby!)\nAnd make the music with your mouth bitch\n(Hoe, you can't be his lady)\n\n[Verse Two]\nI like when you bob and weave when you bob\nI grab your weave\nGirl, you can leave\nWhen the job is done\nMy balls are like Lays\nBet you can't eat just one\nYou start to hum (hummmmm)\nI'm feeling numb\nHere I come, here I come, here I kitty come come\nRed rum\nReady to tear up shit\nWhile you're looking for a place to spit\nNow I appreciate your soup coolers\nOn the one shot, big black automatic pee shooter\nRolling down the street no matter what the day is\nYou can blow for Miles like Davis\nReady?\nNo I won't Wreck like Teddy\nShooting for the stars but watch the parked cars\nThe radio ain't go nothing on this\nGhetto kisses like this\n\n[Hook]\n\n[Verse Three]\nYou said you never do it\nBlew it for the first time\nIf I must say it was dope like my first rhyme\nYou get a nut\nI stuff you like a Twinkie\nAnd certainly\nYou love this smoked beef jerky\nThe flavor of the month so won't you come and taste me\nYou want a lick, got more Dick than Tracey\nJust make the music, don't come with no cheat note\nJust experience my version of deep throat\nGet your knees dirty\nFo' about thirty\nMinutes or more like Prince I'll adore\nYour head in my lap, up and down\nBobbing\nDoing a good job and\nSlopping on my nogging\nNever will admit it\nThat you done did it\nScared to say you suck dick\nKnow you straight with it\nIt's all good cause I know that you a pro with them knees on the flo'\nAnd here we go\n\n[Hook]\n\nBabe you gon' love it {x6}"}], "artist": "K-Dee"}