{"artist": "Khleo", "songs": [{"image": "https://images.genius.com/74a22b0c2b74ae2c317271fa84aa3094.500x500x1.jpg", "title": "5 On It", "year": "2014-02-15", "album": "Raised in the 90's EP", "lyrics": "[Intro]\nKinda broke this evening y'all\nSo all I got is 5\nI got 5\nKhleo\nYou know I had to do it\n\n[Verse 1]\nBaby girl the baddest, been seein' her\nIt’s something bout her aura like her name Rita\nGot ass like her mama and her aunties\nAnd she down to ride like Bonnie\nBonnie, Clyde, open wide\nWhy not? Make it rain for them thunder thighs\nStrip search, can I pat it?\nLet me put this 5 on it, let me grab it\nI’m a G, a mack, whatever you wanna call it\nEither way, yo girl, she in here bout to pop it\nWhy you tryna cuff her? She ain’t even break a crime\nLet that girl loose, let her do it for the Vine\nGo on throw it like you mean it, watch a nigga keep it\nRun into the endzone, intercepted, Darrelle Revis\nLook at all that cheek-age, look at all that cleavage\nGot her butt where my head be like Beavis\n\n[Hook]\nHands on your knees, rotation\nThe way she make it clap, standing ovation\nDo it like you do it when there’s no one home\nDo it like you do when you got nothing on\nPi-pi-pi-pick it up and put it down on it\nShawty ass fat, put a crown on it\nUp and down the pole, the way she grind on it\nHands on that ass, I got 5 on it\n\n[Verse 2]\nGot her hands on her knees, ready set bounce\nBands on me, in a large amount\nTryin' to blow it like a candle on your birthday\nYou tired of these lames cause they all thirsty\nYou got your friend in here with you\nA cup of liquor, and she tryin' to kiss you\nGot Miley all in your system\nTryin' to knock 'em with this wood like I’m superstitious\nWith the quickness\nAll my niggas pull dimes\nGot her heels on, and we call her high 5’s\nWe don’t need much, just a bottle of Ciroc\nSupper club, fireworks, and they comin' from the top\nSlick Living Gang, yeah you know it when you see it\nGirlfriend sending X and O's, but I ain’t The Weeknd\nPhone steady ringin', always getting money\nNever care about a hater long as my bitches love me\nThat’s slick living\n\n[Hook]\n\nHands on that ass, I got 5 on it (I got 5 on it) (x4)\n\n[Hook]"}]}