{"artist": "Waka Flocka Flame", "songs": [{"year": "2014-07-14", "lyrics": "[Produced by TNGHT, Kanye West, Mike Dean, Arca, Carlos \"6 July\" Broady, and 88 Keys]\n\n[Intro: Nina Simone]\nStrange fruit hangin' from the poplar trees\nBlood on the leaves\nBreeze, breeze\nBlood on the leaves\nBreeze, breeze\nBlood on the leaves\nBreeze, breeze\nBlack bodies\nSwinging in the southern breeze, breeze\nStrange fruit hangin' from the poplar trees\nFrom the poplar trees\n\n[Verse 1: Waka Flocka]\nFlocka on that bullshit again\nThe preacher in the pulpit again\nYou fucking losers bout to forfeit gain\nYour importance seems so enormous and then\nYour cooperate friends pull up in that 'fuck is this?'\nTurn pale when you see my fucking bucket list\nLife is super sweet, smoke the finest sour\nI'm 'bout to hand glide form the Eiffel tower\nMy silent hour when I'm on stage raging\nThey used to look down, now I see they face changin'\nThe bass banging\nThe game make them taste fame and\nYou niggas lame so I guess I have to say it layman\n\n[Interlude: Nina Simone and Flocka]\nWaka Flocka!\n(Black bodies, swinging in the southern breeze)\nSquad nigga, you can't fuck with us nigga\nWe knock the fuck ya'll niggas out\n4 years in this shit nigga, what you think?\nBreeze!\nPussy\n\nStrange fruit hangin' from the poplar trees\nBlood on the leaves\n\n[Verse 2]\nFlocka on them trees, that's blood on the leaves\nAll I need a pretty face, little something to squeeze\nAnd it's nothing to me\nMan I came from a different lane\nI'm 'bout to cop four tickets to a Clippers game\nMake sure I wear every single fucking chain\nNot because I can, but because he can't\nBut why wait, I guess it change nothing still\nI wonder why my brothers kill\nOr want to pop another pill\nI'm tryna find another thrill\nIt's another degree\nMan, Flocka on them trees, that's blood on the leaves\nSquad!", "image": "https://images.genius.com/615016a72f645e322ab9388f4cca0404.500x500x1.jpg", "album": "I Can’t Rap Vol. 1", "title": "Blood On The Leaves (Freestyle)"}]}