{"songs": [{"lyrics": "[Intro]\nHow she only 21?\nTake that off, take that off\nOh Lord, Jetson made another one!\n\n[Chorus]\nHow she only 21 and she a savage? (Yeah)\nMy bitch so bad, she make my other bitch look average (Ayy)\nI'm talking nasty, I call her my lil' bad bitch (Uh)\nShe call me daddy, but I am not her daddy (Ayy)\nHow she only 21 and she a savage? (Uh)\nMy bitch so bad she make my other bitch look average (Uh)\nI'm talking nasty, I call her my lil' bad bitch (Ayy)\nShe call me daddy, but I am not her daddy\n\n[Verse 1]\nWho you know to sign a label deal and still don't need her? (Ayy)\nWhat y'all playin' for the pole? 'Cause I got cheaper reefer (Uh, uh)\nI be strapped up at my show, you know I keep a heater (Ayy)\nBlowin' loud to keep a flow 'cause all these people demons (Hey)\nWhen I was down, I was on my own, now all these people need me (Need me)\nI had to branch off on my own, too many people leachin' (Uh)\nAnd I don't like no leaches (Uh), no, I don't like no leaches (Uh)\nWhen I like five years old (Old), I used to like my teacher (Ayy) Food out there I'm eatin' (Eat), I made this freak turn freak (Freak)\nThat's really me, come see me (Me), you know it's a fee for features (Uh)\n\n[Pre-Chorus]\nShe told me she only 21 (One)\nHer record still clean and she young (Young)\nI looked the bitch dead in her eyes (Uh)\nTold her go get some more legal guns, I need that (Ayy, ayy)\n\n[Chorus]\nHow she only 21 and she a savage? (Yeah)\nMy bitch so bad, she make my other bitch look average (Ayy)\nI'm talking nasty, I call her my lil' bad bitch (Uh)\nShe call me daddy, but I am not her daddy (Ayy)\nHow she only 21 and she a savage? (Uh)\nMy bitch so bad she make my other bitch look average (Uh)\nI'm talking nasty, I call her my lil' bad bitch (Ayy)\nShe call me daddy, but I am not her daddy\n\n[Verse 2]\nCan't do another other, got it for me, baby (Uh)\n'Cause I am not your daddy, I'm Da-fuckin'-Baby (Hey)\nI still remember back when we ain't have no money, baby (Uh)\nHad to act like I was watching something, wasn't no cable (Hey)\nI saw the screen, it was blue (Blue), I ain't have no AC it was hot (Hot)\nBut now you can reach in my pockets (Yeah), and pull out a motherfuckin' knot (Yeah)\nNo, they can't stand how I'm rockin' (Yeah), I know I'm the man, I'm so cocky (Ayy)\nAnd we done hit all of these hoes, if she from the city, we got her (Ayy)\nYou better come get him, we got him (Ayy), he tried to come get me, I shot him (Yeah)\nI'm still in the city, ain't hiding (Yeah)\nTouch one of my niggas, we riding (Ayy)\n\n[Pre-Chorus]\nShe told me she only 21 (One)\nHer record still clean and young (Young)\nI looked the bitch dead in her eyes (Huh)\nTold her go get some more legal guns, I need that (Ayy, ayy)\n\n[Chorus]\nHow she only 21 and she a savage? (Yeah)\nMy bitch so bad, she make my other bitch look average (Ayy)\nI'm talking nasty, I call her my lil' bad bitch (Uh)\nShe call me daddy, but I am not her daddy (Ayy)\nHow she only 21 and she a savage? (Uh)\nMy bitch so bad she make my other bitch look average (Uh)\nI'm talking nasty, I call her my lil' bad bitch (Ayy)\nShe call me daddy, but I am not her daddy", "album": "Blank Blank", "year": "2018-09-26", "title": "21", "image": "https://images.genius.com/d5adb2deede7009c588c4e5b88bda515.800x800x1.jpg"}], "artist": "DaBaby"}