{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/643d9675eedcaa5319fa306772e6375b.479x479x1.jpg", "title": "Moneyball", "year": "2013-02-22", "album": "63", "lyrics": "[Intro - Bizzy Bone]\n\"...trust and believe. Oh, my purple homie? (whistles) He keep a turban on.\"\n\n[Verse 1 - Kool A.D]\nCashing in chips, dining and dashing and shit\nMinding a mansion, shiny, diamonds and ashes and shit\nMy goals blow in the shells and live hells and heavens for generations at a time, and climb\nTo the next host, the fresh toast, the heat electrical\nToo hectical, half-ro-futurist, astro-truthfulness\nYoung Fidel Cashflow, using this\nMusic as whatever I really need to use it as\nUse it as shoes on Shabazz Palace floors\nThat we grew callouses upon once, an old tome I did once\nIn a cold road, the kid jumps\nI mean, a cold room, the kid jumps\nThe walls and sees all the ill desert creatures and devils beyond that\nI reach beyond raps\nBut it's still rap though, it's just that though\nBut if they bust then I'll bust back though\nRegardless, any situation, I'm hard as...\nA motherfucker, come on, fight me, yeah\nNah wait, but do you like me though?\nShit, hold up, hold up... you ready? Check it out, yo\nThe revealer, handicap favors the dealer\nThe hand that feeds, um, favors the overeater\nCops wanna kick you like a bill to hand over your heater\nSchools demand overachievers abandon the beliefs of their families and leave them stranded\nIn bland soliloquies of snitches who would call their fam Philistines, nigga please\nFunny, hella books on ecology be killing trees\nEnds is the ends, but the means is still the means\nAnd shit, my jeans were probably made up in the Philippines\nBy a little kid who would kill to live as ill as me or some shit\nMan, I'm dumb, I don't read enough\nSome don't eat enough, food should be free, what up?\nIt used to be, when it was growing on the trees and stuff\n\n[Outro - Kool A.D.]\nI'm an idiot, what's up?\nI'm an idiot, what's up?"}]}