{"songs": [{"year": "2018-06-02", "title": "Nice For What Freestyle", "image": "https://images.genius.com/9c0ba8a9ae10d02f0cfd3617452a873f.500x500x1.jpg", "lyrics": "[Intro: Big Freedia]\nI wanna know who mothafuckin' representin' in here tonight\nHold on, hold on\n\n[Pre-Chorus: Lauryn Hill]\nI keep lettin' you back in (You back in)\nHow can I, explain myself?\n\n[Chorus: Lauryn Hill & Drake]\nCare for me, care for me, you said you'd care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me (Murda on the beat)\n\n[Verse: Saba]\nI'm about to change my lines, tell 'em adios\nPivot gang down for life, Shawty Lo\nAyy, run this shit until I get a charlie horse\nAyy, fe fe on the block she look like mardi gras\nAyy, married to this shit I mean that's common law\nKinda raw plus I got that soul like a commodore\nAyy, commandeer, I'm 'bout to take this shit back\nAyy, at yo' head you 'bout to get your wig snatched\nAyy, what they do for cash look like fear factor\nAyy, but I ride 'round, surround 'em like I'm clear plastic\nRack it up, rack it up\nI just got paid at the show, this shit addin' up\nThinking of packin' up\nLike I could retire right now and they had enough\nI had my managers, I tell 'em we should go U.S. to Canada\nThey hit me back like \"Saba, consider it booked in the calendar\"\nShout out the analysts\nShout out the critics who wait for the beat to drop\nShout out TheNeedleDrop\nDon't care what you rate it 'cause I know that we on top\nIf that's your mans, then how he up and you ain't up?\nMy dirty Vans, I just clocked in, I'm on this work\nI'm panoramic, see the bigger picture first\nI Ray J in the booth because I hit it first\nJust did another right now, records give us merch\nBoy, all I drop is classics in my city merch\nCan't lie, I'm pretty public for an introvert\nDidn't cry, I'm right back to it if it didn't work\nAnd I, look like I serve the block, I know you heard of Tahj\nThe greatest, I soon to occur to ya, we never heard of ya\nMurda on the beat but I'm not a murderer\nI'm who you learn about\nHistory repeat and I feel it's like so many mes\nNiggas talking, we hear bits and piece\nAnd it look like dinner, it's a feast\nMiddle finger to the CPD\nYelling \"free my niggas\" 'till they free\nI don't wanna kick it in the street\nThey can catch a boot like Tennessee\nTell 'em paid in full like Eric B\nAnd I'm telling you to care for me", "album": null}], "artist": "Saba"}