{"songs": [{"title": "Politricks", "lyrics": "\"Many Black voters claim the mistrust that lingers\nCoincides with a widespread belief\nThat people do make deliberate attempts\nEither to thwart African-American attempts to vote\nOr to miscount the ballots once passed\"\n\n[Akir]\nI don't follow the news, they just add to my blues\nPoliticians and they big feets could never fill my shoes\nThey don't care, think we all live off welfare, it's hell here\nWhy should I vote like it's ever been fair?\nMy people in despair, they still balance, we hit hard like steel mallets\nSmile intentions of the founders and they still countin\nNo child left behind, read between the lines\nTryin to control, they precious minds, zombies in the school line\nRidiculed, for tryin Ritalin junkies\nWhat a powerful country, that keeps promotin off flunkies\n18 years old and your brain is like lunch meat\nProgrammed to follow these dummies 'til the suburbs and slums meet\nPull us over soon as they see blacks in the front seat\nSo I'mma run streets, fuck freaks and causin dumb beats\nMe and mine is gonna be fine, fuck standin in the picket line\nI'm tryin to get these dollar signs dodgin time\n\n\"As it turns out, about half of the votes which are thrown out and spoiled\nFor technical reasons passed by African-Americans, why?\nAfrican-Americans get the crappy schools, they get the crappy hospitals\nThey get the bad police protection, they get the bad voting machines\nThe main thing is, there is no coverage on American television\nAnd American radio about the MASSIVE disenfranchisement of, Black voters.\"\n\n[Akir]\nYo, politicians that be garglin that garbage shit\nBargain with anonymous, officers of opposite\nDoctrines for legal tender documents, pocketin the profits\nOff the rockets while they kick us out the projects, logic\nSurprisin common sense, risin occupants up out environments\nSurvive and then they got you doin 5 to 10\nJust the other day, I was pissin out some toxins\nWhen the cops rolled by, I gotta take it on the block again\nSendin letters included, as a child offender for indecent exposure\nI shoulda looked over my shoulder\nMy cousin got locked, Pop's lost his job, we evicted\nWaitin on Section-8, but the list had been restricted\nA Lexus hit and I missed it, I was dealin with some real shit\nMy brother joined the service, not even nervous to get hit\nSayin that he's out kid, geeked they got Saddam ousted\nI pray because he's bout it, now he's tryin to get up out it\n\n\"Are you a criminal?\"\n\"No, never been convicted of any crime\"\n\"But they had you down as a serious convicted criminal\"\n\"Wrong person, I've never been arrested in my life, you know?\nGot out of the military, been in the medical field ever since\nI mean, you can't even work for a hospital being a convicted felon\nAnd I was in the Persian Gulf War, so, you know\nIt's pretty screwed up how they did me but umm, what can I say?\"\n\n[Akir]\nIt makes us wanna shoot the coppers like that nigga Rollin Roberts\nFor the pride in which they rob us every time that they stop us\nHe try to give us vouchers, to move us out the hood\nBut when we try to use 'em, damn them shits is no good\nI got a letter from my brother, said the media confuse ya\nThe Army-Navy game was flippin coins from Fallujah\nNo proper armor when they move us, damn we trapped\nCursed, Shiites is soon to surround us, in Iraq\nKerry lost, Colin Powell threw in the towel\nAshcroft assed off, the shit is even gettin more foul\nNetwork, of elected delegates are all derelicts\nLook how shiesty Kerry get, damn it's all irrelevant\nIt's never how they tell it is\nSo I gotta get my shit straight, and handle my biz\nThe next time we have to go vote, I might go\nPlus I heard, there's a lot of jobs and a lot of fine-ass hoes, in Ohio\n\n\"If we cannot, imagine social relations based on peace and justice\nAnd equality, we will find ourselves caught up in the rhetorical universe\nThat has been fabricated by global corporate dominance\nAnd its major spokespersons in the Bush administration\nSo what does it mean to fight for democracy today?\nAnother, world, is possible!\" {*echoes*}", "year": "2005-07-22", "album": "Legacy", "image": "https://images.genius.com/ec568067b0f966b9ee18a0f87677e60e.1000x1000x1.jpg"}], "artist": "AKIR"}