{"songs": [{"lyrics": "[Intro: Afroman]\n\nMan, my daddy told me\nBoy, when I was your age\nI had to walk 13 miles to school\nI said, \"Oh, is that why you didn't graduate?\"\n\n[Hook: Afroman]\n\nTalkin' noise with all of my homeboys\nFit to go back to school, yeah\n(Her titties bigger than they were last summer, know what I'm sayin'?)\nWith a mouthful of beer and a nose full of weed\nYou know I'm fit to act a fool, yeah\n\n[Verse 2: Afroman]\n\nMama, I'mma\nGo to the University of Smoking Marijuana\nAll of my friends go to USC\nSo I'm gonna tag along and hit the bong with them\nWalkin' through the masses, lookin' for my classes\nI can't concentrate on the teacher, surrounded by titties and asses\nSpent a lot of money on some brand new clothes\nTrying to impress these brand new hoes\nLaugh every time I have sex with a chick\nBaby don't know I'm an ex-convict\nWalking round the campus with my 'fro on thick\nEvery twenty seconds I be grabbin' my dick\nFull of alcohol at the football games\nDoin' more drugs than my nigga Rick James\nMy GPA is dropping at a very fast rate\nIt'll take a miracle for me to graduate\nMaybe I won't, maybe I will\nStressed out, poppin' pills in my Coupe Deville\n\n[Hook x1]\n\n[Verse 2: Afroman]\n\nHow do I party?\nAnd still pass\nI hardly\nEver go to class\nGot a golden eagle on my stolen Regal\nIf you bought it from me, it's illegal\nCause I'm Afroman, the educated Crip\nOn a rock cocaine scholarship\nCook that crack until it's done\nI use that for my Negro college fund\n\nBroke minorities, selling dope to those bitches in sororities\nShe's drinking one too many 40's\nShe took her clothes off, now we're having orgies\nBaby, I don't mean to act rude\nBut you told me you would never fuck a black dude\nColt 45 must have got you in the mood\nTo eat a fat dick like some soul food\n\n[Hook x1]\n\n[Verse 3: Afroman]\n\n(Hey fellas, can I get jiggy with it? Hey, check this shit out right here)\n\nHey homeboy, don't stress, I got the answers to the test\nMy college professor smokes a lot of grass\nShe's gonna make sure we pass\nThat's how you pass trigonometry\nSell dope to your teacher, use nigga-nometry\nOn the microphone, there's not a rapper bomb as me\nAnd under police pressure, nobody's as calm as me\nWait a minute, you know what's fucked up\nBlack people in college act stuck up\nSo self-conscious, and insecure\nYou wanna speak black, but you really ain't sure\nLook at me, what do you see?\nYou see the OG, you ashamed to be\nSo fuck you, you pretty little rich frat boy\nYou can suck my dick just like that boy\n\n[Hook x1]\n\n[Verse 4: Afroman]\n\nI said, \"Honey\nYou got some sexy looks\nYou need money\nTo buy your textbooks\"\nGet it wet, and I can get it hard\nWe can slide your vaginal credit card\nComputer girl, come to my house and be my tutor girl\nBefore we study, can we smoke a little Buddha, girl?\nRaise your shirt, lick the nipples on your hooters, girl\nOpen up your legs, baby you the girl\nStick out your tongue and let me shoot it, girl\nYou was playing with my floppy, then my hard drive downloaded\nDown your throat, and fucking exploded\nTell your prejudice dad and mom\nTo email their comments to suck-my-dick.com\nAfro's the bomb, blowing up like Vietnam\n\n[Hook x2]", "title": "Bacc 2 School", "album": "Sell Your Dope", "image": "https://images.genius.com/0bbd138da6ed935df988e78c78275c51.364x368x1.jpg", "year": null}], "artist": "Afroman"}