{"artist": "Kilo Ali", "songs": [{"image": "https://images.genius.com/c8c0e4156ad694a47cf6026ffe140cc7.466x466x1.jpg", "title": "America Has A Problem (Cocaine)", "year": "1990-01-01", "album": "America Has A Problem (Cocaine)", "lyrics": "[Intro]\nAmerica, America, America has a problem\nCocaine\nDo you believe in love at first sight?\nThe first time I saw you, I fell in love\n\n[Verse 1]\nThere's a white girl in town, name is Cocaine\nGet inside your brain, play you like a lame\nYeah, you on her good side 'cause she make you rich\nThe first time you hit her, break you like a brick\nDress you up and go, the folks know you with her\nThey can lock you up, but what do they do with her?\nThey put you in a cell, while you countin' sheep\nThey slip her out the back door, back to the street\nThis process partner, you will never know\nTwenty years up the river, that girl made you go\nShe's back into the hands of a young black male\nTreat the sucker good, make the sucker sell\nCocaine\n\n[Bridge]\nDo you believe in love at first sight? (Cocaine)\nThe first time I saw you, I fell in love (Cocaine)\n\n[Verse 2]\nCocaine says she loves you, but she really don't\nShe say \"I'll always be there\", but she really won't\nMake you a big man, buy you a Uzi\nShe say \"Go kill your brother, or you gonna lose me\"\nYou don't wanna lose her so you do what you are told\nHeaded for the chair, sixteen years old\nNow you're in too deep, and you can't come back\nWell that's what you get for selling that crack\nCocaine\n\n[Bridge]\nDo you believe in love, do you believe in love at first sight?\nThe first time I saw you, I fell in love\n\n[Verse 3]\nFirst you're on the bottom, you didn't have nothing\nShe bought you a ride and an automatic weapon\nClothes on your body, gold's in your mouth\nTwelve different girls in a house down south\nIn this game you win M.V.P\nMost valuable player in the dope industry\nYou get a call one morning, got a shipment coming in\nYou try to flex it off, so you take your lady friend\nGet to the airport, the dope is in your hand\nFreeze is the and, a badge in your face\nIf he loans to your girlfriend, the answer's very simple\nAnd quite blank, she got jealous of your girl\nCocaine\n\n[Bridge]\nDo you believe in love at first sight? (Cocaine)\nThe first time I saw you, I fell in love (Cocaine)\nDo you believe, do you believe, do you believe in love at first sight?\nThe first time I saw you, I fell in love (Cocaine)\nDo you believe in love at first sight? (Cocaine)\nThe first time I saw you, I fell in love (Cocaine)\n\n[Verse 4]\nPeople killing babies, ladies gettin' raped\nLittle teenage kids pushing cocaine out the state\nThe black man have a fantasy, cocaine is the insanity\nCome out of that dream, back to reality\nLook what it's doing to the people on the street\nCan't eat, can't sleep, just geek, geek, geek\nCocaine"}]}