{"songs": [{"year": "2012-12-19", "album": "The ASF EP", "image": "https://images.genius.com/5ed940c9fcb98261042abb700cd3a191.490x489x1.jpg", "title": "Silent Water", "lyrics": "[Produced by ROME]\n\n[Hook: Kevin Abstract]\nI use to dream of the sea\nAnd everything that you can be\nI use to stay up late\nWondering is this fate?\nI still think we're one\nBut do you think that, huh?\nThings change, people leave\nIt's all good, at least I got the sea\nSee? I got the sea\n\n[Verse 1: Kevin Abstract]\nNow I can start this rap off with some slick shit\nOr go opposite and be mad ignant\nBig chains made some change, real Slick Rick\nBut anyways, I gotta say, you made me sick, chick\nHow you gon diss this sick kid and leave me in a deep ditch\nFor dead heartbroken suicidal put a bullet in my head\nI mean, might as well right? Feels like hell right?\nOne bad night can make ya hate ya whole life\nAnd I learned that back in '03\nWhen my sister lost a friend he took pills an OD'd\nAnd I ain't know how she feel til I lost a homie\nYou came in screaming & crying and begging mommy\nIf we could bring him back with some prayers\nAnd when he ain't return it made me wonder\nIf there's a man up there upstairs\nThat we praying to, praying out loud\nWith life, if they want you gone, then you out\n\n[Hook: Kevin Abstract]\nI used to dream of the sea\nAnd everything that you can be\nI use to stay up late\nWondering, is this fate?\nI still think we're one\nBut do you think that, huh?\nThings change, people leave\nIt's all good, at least I got the sea\nSee? I got the sea\n\n[Verse 2: Ameer Vann]\nSimilar incidents, penitent menaces\nLosing grip of the whip and I'm thinkin' I put a dent in it\nDrinks, finish it, maybe not, swallow oxycots\nMy troubles fade and my head nods off\nNow that papa's gone, things been going wrong\nAnd me and moms is crawling so I guess he's walking strong\nHere we go again, lift off, light a bong\nCheech and Chong, I guess I'm wrong\nCaught in prescriptions verse descriptions getting similar\nNiggas slowly gettin' sick of it\nMention it, me and Mr. Simpson and a group of misfits\nGetting into shit, limitless infinite sentiments\nWhether genius or a piece of shit\nWe'll see what we can make of it\nSteady chasing dreams and I will never walk away from it\nNever see me faking it\nAlways on my path, never see me stray from it\n43 perfectionist, see the songs we making bitch?\n\n[Hook: Kevin Abstract]\nI use to dream of the sea\nAnd everything that you can be\nI use to stay up late\nWondering is this fate?\nI still think we're one\nBut do you think that, huh?\nThings change, people leave\nIt's all good, at least I got the sea\nSee? I got the sea"}], "artist": "Kevin Abstract"}