{"songs": [{"year": "2011-03-28", "image": "https://images.genius.com/ae59ac20cf16e3a440904aa06dd710ac.1000x1000x1.jpg", "title": "Free My Soul", "album": "Return of 4Eva", "lyrics": "[Hook]\nMama, I made it, got my chain now\nI got that Benz too\nI got my Louis Vuitton and my Gucci shoes\nMama, I made it, I got those trues and vogues\nI keep some groupie hoes\nI got that old school with those Lambo doors\nBut I'm scared it all ain’t enough\nTo free my soul\nLord, mama, I made it\n\n[Verse 1]\nFuck what they talkin', nah, it ain’t about talent\nIt’s no longer an art, niggas piss on your canvas and parade\nOkay, so you paved the way, but I rode the road\nFarther than you go before, but still, you block the road some more\nI'm on my last leg and they passing me by\nWith a sign that say \"I rap to eat\" and both my thumbs in the sky\nDamn, when will my time come? Should I just sell dope?\nFor money, cars, clothes & hoes, 'cause they say that's successful\n(I just wanna be successful...)\n'Til a nigga run up on you and unload\nCause he poor and you shine just like the moon glow\nStunting in your Bentley, but it cost you your soul\nWhen God come to collect, I hope you got what you owe\nIf I made it...\n\n[Hook]\nMama, I made it, got my chain now\nI got that Benz too\nI got my Louis Vuitton and my Gucci shoes\nMama, I made it, I got those trues and vogues\nI keep some groupie hoes\nI got that old school with those Lambo doors\nBut I'm scared it all ain’t enough\nTo free my soul\nLord, mama, I made it\n\n[Verse 2]\nForever dreaming, wishing on a star for help\nI give a nigga food for thought, he rather starve himself\nApart from wealth, I think it was the shine that got us blinded\nNot sure of what we reading when we signing our life away\nThey say ignorance is bliss, well I'd like to state\nThe game is just not records and real shit, they don’t like to play\nYou ghetto famous to us, you just Bojangles to them\nTap yo feet, tip yo brim, and sell it back to yo kin\nI don't rap, I spit hymns, my God's bigger than them\nTryin' to blacken your heart and say we children of men\nI sin 'cause I ain't perfect\nBut I'd rather save your life than hurt it, if I made it\n\n[Hook]\nMama, I made it, got my chain now\nI got that Benz too\nI got my Louis Vuitton and my Gucci shoes\nMama, I made it, I got those trues and vogues\nI keep some groupie hoes\nI got that old school with those Lambo doors\nBut I'm scared it all ain’t enough to free my soul\nLord, mama, I made it\n\n[Bridge]\nNow, what if all the things I'm fightin' for, oh, Lord\nDon't get me where I'm going?\nNow, what if I don’t see the signs in time? Oh, Lord\nI'm praying that you show me\nMama, I made it\n\n[Outro: Sample]\nI feel sorry for you, kid\nIf you're smart, you take care of yourself\nThere's nothing you can do for anybody else\nWhat difference do you think you can make?\nOne single man, in all this madness?"}], "artist": "Big K.R.I.T."}