{"songs": [{"title": "FFOE", "album": "Detroit", "year": "2012-09-05", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg", "lyrics": "[Intro]\nThe best drinks, good tree, and bad bitches\nI got the best drinks, good tree, and bad bitches\nI got the best drinks, good tree, and bad bitches\nAnd that's what you gon' get any time you fuckin' with us\nFinally Famous, what's up?\n\n[Verse 1]\nI'm on the west side of my city\nRidin' round like a tour guide\nWith that white girl she got a tongue ring\nThat might as well be a bullseye\nShe half naked walking 'round this bitch\nI almost thought I was poolside\nTryna raw dog my... (oh!)\nLike her tubes tied but that's suicide!\nOne time for my niggas who made something out of nothing -\nCause you could lose it all my nigga look at David Ruffin\n\"You could lose it twice as fast as you got it\"\nGot it - that's what my grandma told me\nAnd you've got to be a dumb dumb dumb motherfucker\nNot to listen to what you hear from the OG's\nRollin' OG 'til I G-O\nYeah G-O, nigga, add an O-D\nThat's what I rep, nigga, 'til I O-D\nCollecting everything that this world owes me\nI told my Momma grab you any kind of car\nGirl cause you my shining star, I love you everywhere you are\nBack to it - to the game I am committed\nMy intentions: stay persistent\nWorkin' overtime like we get paid off commissions\nAnd my wrist bliss, work\nMs. Gliss, man I ain't got time like my wristlit\nNo bitch fit, just a fit bitch\nWho's only job is to make me feel terrific\n\n[Chorus]\nNow we going strong, we'll be going going gone, 'til we on\n\n[Verse 2]\nI'm on the east side of my city\nRidin' round like it's \"Doomsday\"\nAnd if you keep pushing my buttons\nMight fuck around and be a \"Tomb Day\"\nDon't let go of her hand\nOr it might be \"Big-Sean-In-Her-Womb Day\"\n\"Congratulations, dog!\" man, that's what the whole room say\nI want money and security for all of my descendants\nWe up in Hollywood, tryna get our hands cemented\nIf you don't fuck with my songs\nMan, you gotta fuck with the intention\nTryna get my fam and friends-es\nBehind Benz-es, and Cartier lenses, woah\nI believe I can fly, I believe I'm the man\nI believe in God\nMan, they sending shots, shots, shots, shots\nLike they don't believe I can die\nMan, fuck whoever used to tell me to stop\nA legend in the making -\nFuck whoever told me I'm not\n\n[Chorus]\nNow we going strong, we'll be going going gone, 'til we on"}], "artist": "Big Sean"}