{"artist": "Your Old Droog", "songs": [{"album": null, "image": "https://images.genius.com/56c9da49c415957b18820130ae9890d4.300x300x1.jpg", "year": "2019-06-14", "lyrics": "\"How do you cope with all these girls that wanna fuck you?\"\n\"Uh, you know, as David Lee Roth once said: I don't get all the girls I want, I just get all the girls that want me.\"\n\nAy, ay, ay, Yes I can go your way\nBut I might be late\nFuck the MTA\nA cheap trick\nI want you to want me\nBut I don't want you\nI just want the monthly\n\nI never get the girls I want, only ones who want me\nDo better in other states, out the country\nOut here gotta settle for a skunky, who just aight\nBut she let me use the monthly\nTight chubby but the D's is perky\nBuy some loosies and sandwiches, on a roll with turkey\nCheese, lettuce, tomato and mayonnaise\nI run game unashamed of my player ways\nLook in my chest a heart you won't find\nI'm this way and she still don't mind\nWe don't text nor speak\nI just come 'tect her, every four weeks (or so)\nEnjoy each other's company, not her man so there ain't no dumping me\nBlunt to the face no trauma\nComical but she bring no drama\nAll love once I step in the building\n'Cos me and her never have feelings\nNot pressed to smash, just in the pad chillin'\nPop an advil and throw on some Madvillian\nNo pressure, sippin' on a Starbucks refresher\nI could either snuff or caress her\nOr I let her be the aggressor\nJust don't forget to leave that unlimited on the dresser, yessir\n\nAy, ay, Yes I can go your way\nBut I might be late\nFuck the MTA\nA cheap trick\nI want you to want me\nBut I don't want you\nI just want the monthly\n\nAll I got for hoes is just sex and missed texts\nMaybe some Blistex, sike\nMan who am I kidding?\nYour Droog real modest with the girls he be gettin'\nSee it outside your purview\nThe bad chicks all they do is curve you\nThese high-class hoes don't want to get to know us\nAnd why shoot your shot when your form like Noah's\nThey look at you like \"What are you doing?\"\nI'm sick of sex anyway, yo screw screwin'\nNowadays I just jack off\nOn my hermetic shit in the crib with the jack' off\nAct like Yakov Smirnoff, bruh fuck rap I just might take a year off\nPlus I already got a chick who support me\nWho cares if she a little bit portly\nLook better with the clothes off\nGot a nice ass shape and her skin feel so soft\nShe hold me down just gotta slide through once a month\nThat's a fare cap like a pun\nShe anticipate my return like Devin Hester\nWhen I'm gone got bonds like an investor\nUltimate finesser, make sure you leave that unlimited on the dresser\n\nAy, ay, Yes I can go your way\nBut I might be late\nFuck the MTA\nA cheap trick\nI want you to want me\nBut I don't want you\nI just want the monthly", "title": "Monthly (Transportation Album)"}]}