{"artist": "Angie Martinez", "songs": [{"title": "Breathe (feat. Mary J. Blige & La India)", "image": "https://images.genius.com/439f66679a994188cae23c6858565d8a.438x438x1.jpg", "album": null, "lyrics": "[Angie Martinez]\nYo, yo, yo, uhh, uhh, yo, yo, whoo whoo whoo whoo, yo, uhh, hey!\nSometimes you gotta, catch yo' breath and\nAll the time you gotta watch yo' step and\nCatch me all on yo' neck, stressin' 'bout \"What you doin' next?\"\nAnd I ain't got much left; tolerance wit' a hoop-la\nLa hodienda no se para nunca, yeah\nThey give it to you but I\nKeep it movin' while I'm runnin' wit' the rap race\nBut I need a little damn space, to breathe\nI gotta just do me; why I always gotta be sexy huh?\nWould you mind when you spill it like me?\nIn a pair of Air Max sweat pants hoodie huh?\nWould ya, get off my back, c'mon, let a nigga relax\nCause I'm, all woman now, hear me roar\nRight now I'm 'bout to hit the door\nSo I can parle', it's my day, 'bout to pick up my girls at the highway\nGotta get away, gotta do it now, gotta walk into the sun, ah ah ah\n\n[Chorus: Angie Martinez + singer]\nGotta be free, gotta do me\nGotta get away, get away\nGotta gimmie some time to breathe\nGotta walk into the sun, ah ah ah\nC'mon ladies come ride wit' me\nGotta get away, get away\nGotta relax your body!\nGotta walk into the sun, ah ah ah\nI just really need some time to ease my mind and let my spirit gooo!\n\n[Angie Martinez - over end of Chorus]\nGonna fly.. c'mon..\nHow many women cook and clean, wash the clothes\nWork a job, come home - mop the floors, wash the sofas\nNah, no time for that, besides, ya only rest when it's time to wack\nPlus thats that time you can be the gent\nGettin' ya legs tight, gettin' ya head right\nDoin' it every night in summer time almost\nYou wanna ass lookin' firm when they come up close\nOne of single mother types wit' a couple of kids?\nNuttin' come before them, don't give a f**k who it is\nYou a proud ass woman, never cry for help\nBeen doin' it for years all by yourself\nFor cryin' out loud, can ya get your props?\nWanna pull your hair out cause the shit don't stop and\nYa nigga wanna stress, gettin' no rest\nTakin' no breaths, it's PMS\nWanna know when do I get my day\nWanna pick up my girls at the highway\nGotta get away, gotta do it now, gotta walk into the sun, ah ah ah\n\n[Chorus]\n[singer]\nYo necesito un poco de paz.. en mi vida!\nNecesito un poco de paz.. en mi vida!\nSome times a girl just wants to be free\nFrom what you think of me baby please\nGet up off my back and give a girl some space\nBecause we're livin' in a big bad place\nI just really need some time to have a little piece of mind and\nBreathe, breeeaathe!", "year": null}]}