{"artist": "Cappadonna", "songs": [{"title": "I Don’t Even Know You", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro during Chorus: Cappadonna]\nUh, yeah! Yo!\n\n[Chorus: Cappadonna]\nI don't even know you\nI don't even know you\nI don't even know you\nI don't even know you\n\n[Verse 1: Cappadonna]\nPeep the scene, remember Cappadon' from Ice Cream\nI got my nice clean, my ice beam, my nice jeans\nPillage For Life Team, we fight schemes, we bite Beans\nWe mic fiends, we the light means\nWe be ignitin' the scenes, we be enlightin' the teens\nSpicin' up my mental cuisines, my blunt steams\nMy stunts screams, I hunt the princess and I hunt Queens\nGet a Dutch and I dump my greens\nNo seeds in my weed, it's like tangarines\nBut I'm spaced out, muthafuckas, and I'm dope fiends\n\n[Chorus: Cappadonna]\nI don't even know you\nI don't even know you\nI don't even know you\nI don't even know you\n\n[Verse 2: Cappadonna]\nYo, I'm back on the set, like me and the kid LuLu\nFuckin' with the ill hoes that eat doo-doo\nDressed up Manhattan style, walkin' the poodle\nThey put period blood inside noodle\nOn a curious tip, they drop voodoo\nThat's why when we see a bitch, man, we like \"Yo, bitch, who you?\"\nYou know my style, my whole crew keep a nice shoe\nOriginal Don', slut, do you\n\n[Chorus: Cappadonna]\nI don't even know you\nI don't even know you\nI don't even know you\nI don't even know you\n\n[Verse 3: Cappadonna]\nYo, I'm a hot piece, my top piece, they top crease\nI knock beef, I drop teeth, I lock heat\nI boxbeats, I rock cleats, I stop sheets\nI pop a ecst', and I pop treats, my clock beeps\nWith the pussy, my cock meets, my block creeps\nShockin' ya peeps, my police gut is wop ya niece\nWe big niggas and we like broccoli's\nNever let the Ox' leak, we top cheeks\n\n[Chorus: Cappadonna]\nI don't even know you\nI don't even know you\nI don't even know you\nI don't even know you"}]}