{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "Be A Nigger Too", "album": null, "year": "2008-04-20", "lyrics": "[Intro]\nTurn your radios up\nYou are now allowed to listen to the radio\nThe real niggas are back on the radio\n\n[Verse 1]\nUh, no slackin', no beggin', no askin', no fastin'\nNo disrespect to Islam nor Imam or Pastor\nNo answers to questions the media's askin'\nWhy we fight each other in public in front of these arrogant fascists?\nThey love it; puttin' old niggas verse the youngest\nMost of our elders failed us, how could they judge us? Niggas\nThere's verbal books published by niggas, produced by niggas\nGenuine niggas, so I salute my niggas\nNot mad 'cause Eminem said, \"Nigga,\" 'cause he my nigga\nWigga, cracker, friend - we all black within, okay?\nWe all African, okay\nSome Africans don't like us no way!\nA killing happened in Johannesburg, yesterday\nSlain artist named Lucky Dube, hijacked\nSome say N-double-A-C-P, keep us sidetracked\nBut I don't buy that, I buy Aston Martins\nFaster cars than, NASCAR cars and, sparkin' while ridin'\nCritics, eat a dick! Journalists see I'm rich\nWith this N-word jargon I'm just startin', bitch!\n\n[Chorus]\nI'm a nigga, he's a nigga, she's a nigga, we some niggers\nWouldn't you like to be a nigga, too?\nTo all my kike niggers, spic niggers, guinea niggers, chink niggers\nThat's right, y'all my niggas, too\nI'm a nigga, he's a nigga, she's a nigga, we some niggers\nWouldn't you like to be a nigga, too\nThey like to strangle niggers, blamin' niggers, shootin' niggers, hangin' niggers\nStill you wanna be a nigga, too? True\n\n[Verse 2]\nWake up in the morning, shake my third leg in the toilet\nUzi on the nightstand, I'm the man you go to war with\nNot the man you go to war against, patience, I'll get you\nIf that means I can't sleep a whole year, I'ma get you\nI'm official not \"A-Tisket\" or \"A-Tasket\"\nI'll put you in the casket, with the biscuit or the ratchet\nThey smoke hibiscus, they plants or trees, advanc-ed weed\nDon't forsake us, you all are fake bloods like move make-up\nI flow tighter as Tootie's braces, who be hatin' us?\nI be on a state bus in shackles if my .8 bust\n'Cause y'all some tellers, opposite of bankers\nI'm the shit for ages, my clique still real QB gangsters\nClique still movin' like Freemasons\nSo if I'm on the flow for the law, there's lodges all across the nation\nNas is bred for the plan, to hold the Grand\nDragon's head in my hand, come and get me, here I am\n\n[Chorus]\nI'm a nigga, he's a nigga, she's a nigga, we some niggers\nWouldn't you like to be a nigga, too?\nTo all my kike niggers, spic niggers, guinea niggers, chink niggers\nThat's right, y'all my niggas, too\nI'm a nigga, he's a nigga, she's a nigga, we some niggers\nWouldn't you like to be a nigga, too\nThey like to strangle niggers, blamin' niggers, shootin' niggers, hangin' niggers\nStill you wanna be a nigga, too? True"}], "artist": "Nas"}