{"songs": [{"title": "Allstate", "lyrics": "Man I'm tired of all these fake ass niggas\nRiding 'round talking all this shit ass niggas\nAll up in the grass, old snake ass niggas\nKeep something to say, old hating ass niggas\nWe be getting money and they hate that nigga\nBeefing?  Better have Allstate my nigga\nThey be chasing pussy while we caked up nigga\nMad at the world cuz they ain't us nigga\n\n[Verse 1: Yo Gotti]\nReal niggas straight up pay the price for it\nFuck niggas they would trade your life for it\nCool with the Bloods and I'm cool with these Crips\nAnd these Gs and I'm fucking with these Vice Lords\nIf you a real nigga holla: I KNOW\nIf you a fuck nigga, I don't think so\nYoungins in the hood got them Draco\nI be with the paper bitch I'm Kinkos\nReal nigga that life goes be a real nigga like me\nBitch this is how I'm living this shit ain't for TV\nPop a Xan then pop another Perc\nBitch wanna be saved go to church\nNigga wanna get paid get some work\nNigga wanna snatch a chain get murked\nOld project nigga boy I been grimy\nI don't fuck with these niggas cuz they some timey\n\nMan I'm tired of all these fake ass niggas\nRiding 'round talking all this shit ass niggas\nAll up in the grass, old snake ass niggas\nKeep something to say, old hating ass niggas\nWe be getting money and they hate that nigga\nBeefing?  Better have Allstate my nigga\nThey be chasing pussy while we caked up nigga\nMad at the world cuz they ain't us nigga\n\nYou a real nigga on the Internet\nReal street niggas we ain't into that\nReal street niggas we ain't looking back\nTake a nigga's bitch like give me that\nYou be on your cycle you a bitch ass nigga\nFrontin for these hoes you a trick ass nigga\nHeard they took your chain you a lick ass nigga\nPlaying both sides you a switch ass nigga\nYou ain't taking care your kids, but taking care of these hoes\nWhere your OGs?  Where your morals and your codes?\n\nAnd how the fuck you living with yourself nigga\nGot to thank the man that I'am, blessed nigga And everyday I wake up brush my teeth and grab my scrap to start my day man I think about my problems\nAnd every time I go and meet the plug and get the sack and give him his money i think about robbing\n\nNiggas taking selfies with another nigga baby momma fucking on another nigga (Dang) we be riding around with the gutta nigga\nPretty Boys Do't Wanna See Them Ugly Niggas\nLabel say am anti-social (why) cause i don't really fuck with the social (network)\nCause i don't have time for the emojis\nCause bitch am in the hood with the yola\n\nMan I'm tired of all these fake ass niggas\nRiding 'round talking all this shit ass niggas\nAll up in the grass, old snake ass niggas Keep something to say, old hating ass niggas\nWe be getting money and they hate that nigga\nBeefing? Better have Allstate my nigga<\nThey be chasing pussy while we caked up nigga\nMad at the world cuz they ain't us nigga", "album": "The Return", "year": "2015-08-06", "image": "https://images.genius.com/9879d574677bd3d25f853b30ff0264d7.1000x1000x1.jpg"}], "artist": "Yo Gotti"}