{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/5b472f0faec75a7ea8e5ca246c5f8acf.1000x1000x1.jpg", "title": "Anakim Dreams", "year": "2013-02-25", "album": " The Psychic World of Walter Reed", "lyrics": "[Intro: Killah Priest]\nUh oh, yo 4th what’s the deal?\nYo Amir, this is what we got to do right now?\nThe Golden Deer Priest, the Eight Deer Ocelot Claw\n4th, we got to go in again? Aight, let’s go, yo\n\n[Verse 1: Killah Priest]\nAnunnakis with animal bodies scanning safari\nShape-shift, land of Mugabe, that’s where the god be\nWith my Sumerian colleagues, lighters, cameras in lobbies\nI’m channelling Gandhi, killers with hammers and party\nThe Technology Lord fights with a Mechanical Army\nIt’s the writer on the clay tablets, grave of the abbots\nPray through the Sabbath, God word splays at the dragon\nHis captain and his cabin\nEngineer the beast gears with Satan mechanics\nPagans invaded our campus, nation implanted\nThe blood in my veins is true blue, blood in my wings is from Nibiru\nThe blood of a king, celestial beings, the Essenes, now who you?\n\n[Break: Killah Priest]\nYo God\nMatter of fact, what’s today’s mathematics?\nListen God, hold up\n\n[Verse 2: Killah Priest]\nI’m the remnant of God descendants, star defender\nThe kindreds of all existence, start remember\nDivine fist of the North Dipper\nSecrets to challenge your chakras for my lost niggas\nOr aka Walter Killah or meet my fist of the blue sky\nThe Wu cry (Zuuuuuuuuuuuuuuuuu!) Zu\nNow my Zu-Tribe, sacred fist of the Southern Star\nGod governs my bars, my style is above and beyond\nThe Dogon lift up the Trilithon\nThe Poem-Killah had formed, the Rap Christ lay on pillars of thorns\nThe 8 Deer Ocelot Claw, prophet on walls\nGreat as the Lord, great is his name\nSwinging sword at cyborgs and robots\nAnd y’all go watch wind-up toys, ya niggas get your throat chopped\n\n[Outro: Killah Priest]\nYeah, you know what I mean?..\nThe Psychic World, the Golden Deer, the Great Silent\nTold y’all, Priest, told y’all, I’m out of here"}]}