{"songs": [{"title": "The Thieves Banquet", "lyrics": "[Intro: Akala (speaking)]\nOnce upon a time in an obscure part of the Milky Way Galaxy, there was a spinning ball of water and rock ruled by the forces of evil.\nThe Devil himself, proud of the magnificent achievements of his children, decided to call a special banquet for the greatest thieves in all the land\nHe sent invites to thousands of the greatest murders, rapists and general-assorted scum, inviting them to attend his palace at the dawn of the new moon. Each thief would be given a chance to stake his claim as the greatest messenger of murder upon the planet, and the Devil himself would then decide who should be crowned king.\nAfter many days of deliberating, all of the petty thieves, such as street criminals, have been found far short of the required level of wickedness and there were just four sets of thieves left in the competition\nThey were: the monarchs of empire, a cartel of bankers, the heads of religious orders, and the third-world dictators. Each set of thieves appointed a spokesman to give his case to the Devil. We have recorded these events for posterity\n\n[Verse 1 Intro: Akala]\nUh, listen\nUh, okay, yo\nFirst up was the thief of the worst reputation\nDictator of a third-world nation\nHe looked the Devil in the eye as he spoke\nIn an oh-so-serious tone\n\n[Verse 1: Akala (as the Third-World Dictator)]\nDear Mr. Devil\nI am the greatest thief there has ever been on Earth\nPlease tell me who else more than me personifies your work\nI came to power in a military coup, I murdered the elected president\nHe wanted to use the resources of our country for our peoples’ benefit\nI proved to masters in the west\nI could kill my own people just as well as the best\nSo I took over the so-called independent country when the foreigners left\nSent squads of death to those who would suggest\nIn power should be the one they elect\nErected a statue of the great man\nThat raped our mothers, stole our lands\nThat’s how little self-respect I have\nDon’t fight slavery, it makes me glad\nAccount in Switzerland, Rolls Royce\nMurder and rape cos I want new toys\nDon’t want a portion, but a whole fortune\nWith that profit, what’s a little bit of torture\nEven outlawed my indigenous culture\nAnd language and history\nAnd taught our people to only worship colonizers\nAnd of course, ME!\n\n[Hook]:\nThief!\nIt’s the banquet of the thieves!\nCome and dine with me!\nIt’s the banquet of the thieves!\nThe banquet of the thieves…\n\n[Verse 2 Intro: Akala]\nThe Devil was so impressed with this wonderful man\nHe almost ejaculated on his hands\nBut the monarch of the empire said\n\n[Verse 2: Akala (as the Monarch of Empire)]\nExcuse me, Mr. Devil, I’d like to speak if I may\nWho do you think trained this amateur dictator to behave this way?\nYeah, I’m sure before I came along his country was far from heaven\nBut look of the carnage I caused all over the Earth, it’s got to be the work of the Devil\nCountless deaths, mass enslavement\nDeliberate starvation of whole nations\nThe dictator tries his best, but looking at me, he’s just an imitation\nWho do you think pays his wages?\nHe would love to be trading places\nI’ve been doing this ting on the roads\nWay back, way back, way back\nSince the Middle Ages\nEverybody knows he’s a criminal element\nThey think I’m democratic and benevolent\nAnd that shows that I’m really devilish\nCos people think I’m heaven-sent\nI couldn’t care about democracy\nYou all know no one elected me\nThe people love me despite my crimes\nSucka MCs wanna bite my shine\nSo blingin’ out of control you would vomit\nDon’t even touch dough, but my face is on it!\n\n[Hook]:\n\n[Verse 3: Akala (as the Head of Religious Orders)]\nI’m a pervert who’s in the cloak of the clergy\nYes, I’m a pervert who uses the cloak\nI’m a despicable character\nI use my position of authority and spiritual reverence\nI’m a despicable character\n\nMr. Devil, allow me to speak\nFor all of the religious leaders that leech\nIn the world of creeps, I’m initiated\nI take the peoples’ faith and dissipate it\nWith false promises, hollow oratory\nDon’t need a gun, it’s daylight robbery\nDear Mr. Devil\nI thought you would like it\nHow I use their faith in God to keep them blinded\nPut on a nice voice, read them a book\nAnd they believe that I am not a crook\nTell them God will repay them in the next\nThey give me their life savings so I can buy jets\nAll the reports about child sex\nNone of us have ever gone to jail yet\nThis system of stealing, so appealing\nConvinces the victims their lives have meaning\nMonarchs boast about conquest\nBut needed my blessings to get it done\nAnd all of the dictators use my books\nTherefore, they are just my sons\n\n[Verse 4 Intro: Akala]\nThe Devil was sure this was the winner\nAnd was just about to put an end to the dinner\nBut then the man from the banking cartel\nStepped up and said\n\n[Verse 4: Akala (as the Cartel Banker)]\nI think I’m the biggest sinner\nAll of those three depend on me\nAll they ever do is defending me\nCos I paid for all of the things they have\nOf course, and all of the lives they lead\nPaid for the guns, bombs and the tanks\nThat’s why you see, there is always more\nI turned science’s basic appliance\nInto a client of weapon and war\nPaid for monarchies, armed robberies\nI make monopolies out of property\nNever shot a gun nor killed anyone myself\nBut billions die cos of me\nWho needs a threat? I make a debt\nOut of thin air, just sit back and collect\nEvery single day, whatever they say\nThe people need me just to connect it\nYet none of them knows what I look like\nYet all of them spend my money to look nice\nThey want more, no one’s pure\nI hold the keys to every single door\nSell sex and drugs, profit and lies\nEarth and skies, I’ll even sell life\nI’ll even sell freedom for the right price\nBut no one is smart enough to ask me nice\nSo Mr. Devil, give me the medal\nDon’t be biased\nIf you don’t give it to me\nI’ll just BUY IT!\n\n[Hook]:\nThief!\nIt’s the banquet of the thieves!\nCome and dine with me!\nIt’s the banquet of the thieves!\nThe banquet of the thieves…", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}