{"songs": [{"year": "2009-12-31", "album": "Kendrick Lamar EP", "image": "https://images.genius.com/de49545ec6453e829bb3ff6d34d088db.1000x1000x1.jpg", "title": "Celebration", "lyrics": "[Produced by Sounwave]\n\n[Intro]\nFor the record, I used to do a lot of humping when I was little\nI got a lot of whoopings over that shit too, and that's random, but so what? Ha-ha\n\n[Verse 1]\nGimme that beat fool, this a full time jack\nNo really this a Sounwave track\nSo really I ain't gotta steal nothing all I gotta do is kill it\nWhen you press record button let the paralyzed feel it\nI came back with a full time swag\nAnd the critics thought they had me\nNah, I just bought more batteries\nTurned up supercharged, a medium away from living large\nMatter fact where my niggas at?\nWhere my bitches with them pretty weaves?\nEnemies bleed on the maxi pad, pussy you fucked with the wrong one\nI'm on one, I'll make sure your kids breathe pneumonia\nGood kid, mad city evil in my heart\nFrom the blood niggas fucking with me, crip niggas tryna kill me\nMalcolm X mind state, if I raise the crime rate\nIt's a legitimate reason why\nI put on repeat Kanye's \"Touch the Sky\"\nBut I'll be looking past that I'm tryna touch God\nMy heart to the heavens, the rebel of the reverend\nY'all married to the game well I'm 'bout to crash weddings\nI put a lot of pain in the shit I write\nIf you going through something, this the shit you recite\nThis is bigger than life, this is Kendrick Lamar\nThis is Jimi Hendrix guitar on tour, bonjour, I mean war like that!\nYeah, straight like that\n\n[Hook]\nPeople don't be shy\nRelease them balloons to the sky\nI need the world to celebrate me! (One time)\nYou'll never know when I'm gone (Two times)\n\n[Verse 2]\nIn 2010, I'm tryna ball, nigga!\nLike shooting jumpshots in the mall, nigga!\nThat's a quote from Ab-Soul\nI suppose since you laugh that's the ultimate goal\nOn behalf of the Top Dawg conglomerate, shall stay anonymous\nSearching seven continents accomplishing big shit\nBig ass, big tits she on me\nAnd just to get to me she'll fuck the homies... homie's homies\nThe life of a cool nigga, my nigga Tony said\n\"Just do you, nigga!\" Show and prove, nigga\nAnd they gon' play you for a fool that's for sure\n'til they know you got the stinkiest stool, nigga!\"\nI ain't tripping I'm just tipping on fo-fo's\nBack in the city and tipping on four hoes\nThat boy got a cold cold, he's sick con, slick on\nDropin red jewels like a school bar mitzvah, ooh\nStraight like that\n\n[Hook]\n\n[Verse 3]\nWhy y'all complain about OG's?\nI don't look at a legend and say you owe me\nNot Snoop, not Dre, not Ice Cube\nI don't care me and Quik went to the same school\nI look in the mirror and do it myself\nLike a self made nigga, I don't need a maid, nigga\nDo I need a co-sign from Dre or Jigga?\nThey can make me much bigger\nBut do I need 'em though?, I just need a flow\nThe type of shit that make you think you seen Pac ghost\n\"Me Against The World\" on you mothafuckas\nI got my back against the wall and a .45, dog get smoked, Chris Tucker\nUhh, tryna record my steelo\nEven when I'm not there just like TiVo\nThe hoes tell me that I got a real big ego\nAnd weed move slow right now but E go\nYou know what I'm talking 'bout? I look at your Audemars\nTo put ya'll in time out, it's time to unveil the real\nAnd your career is about as frail as Ms. Winehouse\nJust salute, grab a flute, and pull the wine out, ooh\nJust like that\n\n[Hook]"}], "artist": "Kendrick Lamar"}