{"songs": [{"title": "Creep Creep Devilz!!!!!!! 93", "year": "2012-01-12", "album": "King of the Mischievous South, Vol. 1 (Underground Tape 1996)", "image": "https://images.genius.com/fdd539bda019607b0500b7c542f38efa.1000x1000x1.jpg", "lyrics": "[Verse]\nStraight outta Blackland\nThe trill ass nigga named Aquarius\nKillin' [?]\nDenzel is my [?]\nFuck the motherfucking pigs\nThey wanna see a nigga downfall\nAnd want to kill our kids\nJust the way shit ain't been the same\nThey kill my cousin ChynaMan, and bust a slug [?] brain\nNiggas beef for hoe shit\nThat why Raven Miyagi [?] all black like a crow bitch\nThis the type of shit a nigga hate\n'Cause my nigga Muney Jordan said 'My nigga we share the same fate'\n[?] Jitt, the nigga he used to be around\nThe same place he said was the place he was (gunned down)\n[?] God knows I [?]\nBut when I pray to him it's almost I get no reply\n[?] Athiest [?] I know where my vape is\nBlackland and black man, crackers is racist\n\n[Hook]\nCreep, (they wanna beef) so nigga don't sleep\nI see, the [?]\nHe peeps, the predator, that's stalking his prey\n[?] creep\nCreep creep, (they wanna beef) so nigga don't sleep\nI see, the [?]\nHe peeps, the predator, that's stalking his prey\n[?]play, creep creep\n\n[Outro]\nYou already know what I'm saying, know what I'm saying nigga\nI like to dedicate this song, to like\nMan, saying to all the loss, you feel me?\nI dedicate this one to like, especially to my cousin ChynaMan\nI love you brother\nMan if it wasn't for him, you know what I'm saying?\nSo he could watch me do this shit, you feel me?\n(Smoke)\nRight, dog, I am going to make you proud bro\nYou know what I'm saying, Mick Travis, ChynaMan, [?] I love you man\nNever got to tell you that before you left, you feel me?\n(Smoke)\nYou know what I'm saying, we miss you down here\n(Flawless, victory)\nKnow what I'm saying, we're going to make for you\nRaider Klan all day nigga, know what I'm saying\nShoutout Raiders all day nigga, know what I'm saying\nShoutout to that boy SpaceGhostPurrp for telling me about the beat\nMan, everybody who ever lost somebody keep your head up, you feel me?\nWe're all in this together, you feel me?\nLife's too short for that beef shit, you feel me?\nI am still going to dedicate this to like, my dog you feel me?\nRest in peace to my grandmother, I love you\nAnd my [?], I love you\nI'd like to dedicate this to\nAll the loss\nCurry, [?] rest in peace [?], shoutout my boy renegade, Simmie, DC, and Purrp nigga"}], "artist": "Denzel Curry"}