{"artist": "Pastor Troy", "songs": [{"album": "We Ready I Declare War", "title": "Help Me Rhonda", "image": "https://images.genius.com/930f08b82ebc035b1b8a9ab3661f78c0.640x640x1.jpg", "lyrics": "[Skit: Pastor Troy and Peter]\n\n[Peter]\nHey, Troy, hey man\nKD called, know what I'm saying, he left a message said it'd bout, know what i'm saying, 'bout three or four niggas down here in Augsuta with ten blocks, know what i'm saying? You know we fucked up, know what i'm saying, you wanna get them niggas, that's our way out\n\n[Pastor Troy]\nShit, Peter, that's right, shit 'bout to be straight, cuz\n\n[Peter]\nMan, shit, we ain't even gotta do it, my nigga\nI know this nigga, that shit, say he wanna be down with something\nNigga named Big Tomb, shit, we'll let him go do the shit, what's up?\n\n[Pastor Troy]\nNaw, Naw, they say he bury a mutha fucka\n\n[Peter]\nFor real, well, what's up?\n\n[Pastor Troy]\nI got it, I got it, I got it, I got it, I got it\nI got that bitch named Rhonda\n\n[Peter]\nWhat? For real? She deadass?\n\n[Pastor Troy]\nYeah, she ready\n\n[Intro: Pastor Troy]\nYeah, this for all those Down South Georgia Girls that stand shonuff by they nigga. It ain't many, though many claim to be. Mine named Rhonda\n\n[Rhonda]\nRealest bitch in the house\n\n[Pastor Troy]\nKD had called and gave me the word\nSaid this nigga had ten birds, in Augusta for the week\nFrom the islands\nAs soon as K told me this shit, I started smiling\nCause all I could see, my money piling\nShit, on top of money\nNow Haitian with the money for the week, and Chesapeake\nThe heat made my nigga take a break\nIf I could catch all 10 of them bitches, and I don't look suspicious\nI'ma sell the fucking quart for the 'A' the ha ha\nAs I told K bye bye, he shot me advice\nIf you gone do it nigga do it nigga, fuck thinking twice\nThis is ya nigga for life\nGo fight 'em fire for fire\nHit my hip when you finish said his calling card expired\nHung up the phone, contemplating on who help me do it\nThere's Kia and Jessica and then Rhonda Truitt\nNow, Jessica to stupid and Kia lie to much\nI guess I'll take Rhonda, cause Rhonda don't give a fuck\nBut first I got to pump her up\nI'm give her what, 10 g's\nTell her if she really love me she would do this for me\nEternally we'll be together for better or for worse\nBut first we got to take these niggas to the hearse\nBurst in they shit, get the bricks come back out\nI'm be waiting in the chevy, you know I'm ready to take em' out\nIf they front 'cha baby, come on, we make it we rich\nCome on, shit, Rhonda, my down ass bitch\n\n[Hook]\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n[Rhonda]\nWell I'm the realist bitch\nI'm mo realer than reality (well uh huh)\nFuck that dumb shit (uh huh)\nIt take nothing to a casualty (what)\nFBI be after me, quarter ki in my womanly (uh huh)\nComing back from St. Croix\nFirst lady to Pastor Troy (well come on)\nEven I'm a Georgia Boy, cause boy I'm ready jack (well uh huh)\nAll you got to say is where them pussy niggas hangin' at (well uh huh)\nDrop it like a maniac (uh huh)\nSet it off by myself (well uh huh)\nFuck them pussy motherfuckers and who ever else\n\n[Pastor Troy]\nOkay baby, you set it off, there will be no more living single\nI'll be ready to tie that knot after we lick them for them blocks\nGrab the Glock, and shoot out the lot, and keep on bustin'\nThen I'm gone bust in cussin' and leave his punk ass fa' nothing\nNow what's in store for you is 10 g's\n(That's enough for me, I don't give a fat fuck\nWhat's the fucking hold up?)\nAbout this time I saw a truck, to a familiar\nK had said them motherfuckers had a truck similar\nPassengers are him and her, playing some reggae shit\nTwo Aks, me and my bitch, one false move we gone spit\nGuess the driver thank he slick, dread head motherfucker\nGuess he most be know my bitch, Rhonda watch them motherfuckers\nThat owe 'em money, that what, with K.D. in Chesapeake\nHeard that when he spoke with me and now her folk wanna smoke me\nIf he had the keys all I can do now is wonder\nBut for now me and Rhonda filling 'em up with the thunder\n\n[Hook]\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty\n\n(Help me Rhonda, help help me Rhonda)\nI'm the realist bitch\nI'm mo' realer than reality\nFuck that dumb shit, it take nothing to a casualty", "year": "1999-03-16"}]}