{"songs": [{"image": "https://images.rapgenius.com/47fdea4dd780d547cafcb266fcf82346.300x300x1.png", "lyrics": "[Produced by DJ Clockwork]\n\n[Intro]\nLike clockwork, like..clockwork\n\n[Verse]\nWell it's the maniac with zany raps, made millions off of baby Mac\nMy brain, it ain't attached, you love me? It's a little late for that\nThey gave my crazy ass a label, everything is rated X\nI'm far beyond divorced middle aged men who pay for sex\nI work like I ain't made it yet, deserve this motherfuckin' paper\nGet a Kit-Kat, break it in half, save one for later\nDeath to any traitor that's a Benedict Arnold\nI be wildin', goin' broke at international car shows\nI'm a lawn mower, mad face get redder than a dog boner\nThank God I got sober, pot smoker, top roller, thought holder\nWas a little kid until I got older\nWild since a child, pulled my file out of God's folder\nNow let me talk slower, you can understand me now\nWe the originators, your style hand-me-down\nThey got me turnin' up, the amp is loud\nThe apocalypse is comin', so we campin' out at Grannies house\nDancin' with a bitch and pull her panties down, it's bush league\nI love a little nature, addin' flavor to the pussy\nPeople tend to overlook me and my agent overbooked me\nI'mma get it while the gettin' good, feel better than forever\nI'm National Treasure like Nicolas Cage\nI'm a shelter for these animals, got bitches for days\nShe be feedin' on my semen and it's cinnamon glaze\nI tell her keep it or delete it, it's the digital age\nNow I'm muscle buildin' just so I can juggle children daily\nI'm fucked up in the head a bit, I'm Rumplestilskin crazy\nThese bitches gettin' wet when I pull up in a Mercedes\nBitch I be with Mr. T, I'm simply the fuckin' A-Team\nMake dreams reality\nSay hi when you see me, my hello is a formality\nI'm comin' with a cavalry\nOf motherfuckers trained from watching Braveheart battle scenes\nWaste of space and we paint our faces like it's Hallowe'en\n\n[Outro](Repeat)\nBoo!", "year": "2015-04-30", "album": null, "title": "Boo! (Interlude)"}], "artist": "Mac Miller"}