{"songs": [{"lyrics": "[Intro: Action Bronson, Action's mother]\nJust tell me how high you are\nI don't know, what are you giving me?\nJust tell– just tell everyone how high you are\nNo, I can't talk, I'm not telling anyone\nI'm not telling anyone\nCan you please–\nAre you recording me?\nNo I'm not, can you just–\nYou are lying\nCan you please tell them?\nI–I can't describe it, I am so high\nThat's it, it's like I'm tripping\n\n[Intro]\nYeah, Yeah\nYeah, Yeah (Wolfpack)\n\n[Verse 1]\nPuerto Rican Air Force One's at the wedding (Uh)\nI'm only speaking truth\nUh, I might open up for Bruce (I might)\nMy own horn I don't really mean to toot\nSign big deals with yarmulkes on and suede gloves\nIt's safe to say your boy done came up\nToo much lobster on the plane, the plane won't stay up (Uh)\nBitch, I'm butt naked, laid up\nYo, what the fuck?\n(Wolfpack)\n\n[Verse 2]\nThis dick'll make an R&B chick write a song\nAbout the rain when it falls and the pain that it causes (Uh, uh)\nAnd how she always wakin' up alone?\nAnd now Bronson gotta call Tyrone (Gotta call Tyrone)\nFuck that, I'm tryna blow smoke towards the moon\nTill my mind start racing like zoom\nI'm hotter than when Bow Wow dropped in the summer\nGirls scream and I hop into the Hummer like\nUh, I'm a teenage heartthrob\nYou smoke little blunts like Kevin Hart's arms (Uh)\nMy bloodline predate Aardvark and large shark (Uh)\nAnd cookin' flesh off of charred bark (Aaah!)\n(Wolfpack, wolfpack)\n\n[Verse 3]\nI shot dope before I wrote this\nSniffed coke and did aerobics by the ocean\nThis is Blue Chips 7 not Usher (Uh)\nBig muskets get squeezed like mustard\nAnd motherfuckers flee off in the Nissan (Uhh)\nThey say that life is like a see-saw\nI roll solo, why I got these extra seats for?\nHit eject, watch him free fall (Aaaaaah!)\nBetter use both fucking feet, dog!\n\n[Outro]\nYeah, yeah, yeah\nBam Bam, Blue Chips 7\nMy Blue Heaven", "title": "Wolfpack", "album": "Blue Chips 7000", "image": "https://images.genius.com/8b36a83780b8c85770c8ae21c12d19ad.1000x1000x1.jpg", "year": "2017-08-25"}], "artist": "Action Bronson"}