{"songs": [{"album": "3ChordFold", "image": "https://images.genius.com/51f2b6e20460f075460157eae988ce37.600x600x1.jpg", "year": "2013-08-13", "title": "Watch U Sleep", "lyrics": "[Focus...]\nI miss the little things you do\nI'm missin' everything about you\nYou were the best part of me\nNow I'm hardly the man that I oughta be without you\nI know you told me not to call home\nBut you're all that I think about when I'm laying on the lawn\n'Bout how you smell so sweet\nI would caress your face\nJust lay there and watch you sleep\nMy favorite part of the evening\nTrying to guess what you're dreaming\nAnd I would watch you sleep\nSometimes you caught me staring deeply\nWhen I thought I did it discreetly\nI love just watching you sleep\nIt's true, I miss you\nI never meant it like I do now\nGo back in time, I wish I knew how\nFeels like I lost everything\nWhen you gave back your wedding ring\nI miss the days when I'd watch you sleep\nI helped you while you were sleeping\nIt was kinda my little secret\nWhen I would watch you sleep\nWish my mistakes could just be wiped out\nCause I would be there with you right now\nJust watchin' you sleep\n\n[Interlude: Wyann Vaughn]\nI better than she. See, you got motivated. Bad love, good club and great sex helped create this triangle-shaped ship that sails from her to me, and then from me to her. Yeah, I ain't silly as I seem. See, I peeped this game, hearing you speak of happy homes that you used to used to have with her 'til bitter love had you move on to me. So don't worry, baby. Can't you see my halo? It's tilted, and it's rusty, but it ain't like you gon' stay, so I'll rent space in your heart while you rent space in my bed. Find comfort in these thighs, and I'll find comfort in the head of another. Oh, wait, what's that face? Oh, you don't like the taste? I don't know the brand, but it's the same medicine that you spooned with in my French-cut lace, and my big butt and no bra. Last night, yeah, yeah, when you called me her name as you came, for your last flight had landed. But believe me, I wasn't empty-handed, filled with thoughts of another favorite lover. Boo, you're the stand-in. Don't get me twisted just 'cause I bend well in my sheets. See, this here won't last forever, and you and I both know. We both signed that lease. Chord 2: The Renter"}], "artist": "Terrace Martin"}