{"songs": [{"year": "2015-09-03", "album": null, "image": "https://images.genius.com/0fee8ed1b2bac752a7076bfa357fc8cb.500x500x1.jpg", "title": "It G Ma Remix (G&P-Mix)", "lyrics": "[Intro: Keith Ape]\nSquad shit!\n\n[Hook: Keith Ape]\n잊지 마\nUnderwater squad\n여전히 몸엔 camo\nOrca ninjas go rambo\n\n[Verse 1: Da Garça]\nBack in the thing where you need a controller\nBack with a flame with that heat from Angola\nBack with a ting with her back curving over from Spanish descent where she greet me like \"Hola\"\nMy God, my God, Hollup\nWhat you know bout the mix huh?\nHunnid always in this huh?\n94' girl and she come from the 6ixSide\nMan that spell trouble\nI swear in the zone I just might catch a bubble whenever she blow from a stick dipped in subtle transparent-like liquid like ish from a puddle\nI swear to you now....\nIn the club oh you know what I could do\nFor the club oh you know what I could do\nWith the club I would hit it so hard like the way that only tiger wood do\n\n[Hook]\n\n[Verse 2: Jawn Othello]\nHmm, hey\nBack in this bitch yo its jay\nYou gon have to just watch what you say\nCause you might catch these hands like you bout to go pray\nCause don't forget I'm from the streets\nIt G Ma to that me and my peeps\nHave you yellowing all of your sheets\nIf it's beef, let's not turn this to Drizzy and Meek\nCause I come with that heat tho\nHotter than cheetos\nMe and my Dawgs right outside of that peep hole\nSo salvage your goods, your money, your girl\nOh wait, shhh~ I might just get hit with that RICO\nI'm just saying watch it, homie better stop it\nYou already caught it if we step up in a gauntlet\nWanna be a smart ass little Einstein well i don't wanna have to show ya ass to the rocket\n\n\nPlease pardon me, this you gotta see\nThis a lyrical lobotomy, and I oughta be\nAiming at anybody hot as me, no dichotomies\nWith no baby ass rappers looking like the Carter 3, ain't no axe be as broad as me\nAnd obviously, the gift that God brought is me\nBut talk is cheap, so I had to jump to onyx league, cause ain't nobody hard as me, ain't no stopping me, honestly ah!\n\nWas down so I had to re up\nToo many clowns in the factory uh\nEat a pussy rapper just to get my green uh\nCame with a bark all I heard was meows\n\nYou look like where my girl get wet\nNeed something to say then please don't hold your breath\nBon appitet, or bon appetite, I sat down at the feast that you'll never forget"}], "artist": "Keith Ape"}