{"songs": [{"year": null, "image": "https://images.genius.com/a822e5595fc1eee33d5cbbfa1ae70b68.500x500x1.jpg", "title": "C.O.D.", "album": "Delightful Bars", "lyrics": "[Rapper Big Pooh]\nUh, yeah, it's Rapper\nI need some more money nigga\nSome of them tens or them twenties or them fifties, y'know?\n\n[Hook]\nC.O.D. Cash on delivery\nV.I.P. We see it all vividly\nR.A.P. You know you gon' remember me, uh\nYou gon' remember me, uh, you gon' remember me, uh\n\n[Rapper Big Pooh]\nYou gon' remember the name\nSo let me tell y'all why the fuck I came\nJust tryna get paid, you can keep the fame\nEmbarrass a couple niggas that's staking the claim\nThey the best thing living, respect ain't giving\nPut your bifocals on, inspect my vision\nInspect my kitchen, always make the grade\nIntimidated by the flow so they try and throw shame\nMy song's being played, I don't care how you got it\nIf I see you at a show you putting money in my pocket\nBlowing out sockets, me and Mickey Freezy\nGot niggas thinking that this shit is so easy\nNo you don't see me, I'm not in the public\nGrew my hair out cause I knew them hoes would love it\nThey love it! But I let 'em know \"You can't touch it\"\nThem tell 'em it's +Hammertime+ cause we both on a budget\nRight now!\n\n[Hook: 2X]\n\n[Rapper Big Pooh]\nCause I'mma do what I do\nYou wanna talk politics? I can do that too\nWanna speak about a clique? H.O.J.'s the crew\nAnd since I put +Sleepers+ out I been a bit brand new\nBut you knew, you kinda see how it grew\nMake it back for round two is just a limited few\nOnly know what's on the tube, you got a limited view\nI ain't mad, I understand how your judgement is skewed\nHow you preach from a pew, how you teach from a desk\nWhen them chicks grow up it's called leaving the nest\nWatch 'em spread they wings, then fly away\nAnd hopefully I see my child do the same one day\nIt's a shame I say in this game I play\nSeems one too many people done lost they way\nDone lost they pay then lost they mind\nOnce your mind start to go it's kind of hard to find\n\n[Hook: 2X]\n\n[Big Dho]\nYeeeah! You gon' remember us nigga\nYou gon' remember me nigga\nIt's Big Dho staring the commissioner nigga\nLike I said...\n9th! What up son?\nH.O.J.'s in this motherfucker, man you know we happy man\nPun intended motherfucker\nWhat up Rapper Big Pooh? My nigga, what's up?\nWhat up Jozeemo? What up L.E.G.?\nWhat up Away Team? What's going on Sean Boog?\nKhrysis what's good?\nForeign Exchange what up? What up 'Te?\nWhat up Chaundon? What up Scudda?\nWhat's going on D-Brock? What's popping baby?\nY'knahmsayin? Bizness where you at? Where St. Louis at nigga?\nIt's all good though, E. Jones, Jersey, what's good?\nThat's what we do y'all, you gon' remember that\nI guarantee it nigga, Mickey Free!\nBe more nigga, better be more careful"}], "artist": "Rapper Big Pooh"}