{"songs": [{"title": "In the Zone", "lyrics": "[Verse One: Akinyele]\nI swing swords like musketeers, the gun blaze\nLay you down like wave, when you brushin your hair\nI don't care who you are and get, go tell, Ak-nel\nBeen on every record la-bel, CEO's know\nThat I dead Presidents like Lee Harvey Os-well\nLook what they did to Prazwell, put together the Fugees\nYou see how they +Doo+ like +Scooby+\nBut Ak truly use dem for, dey use me\nMoney to make, Spongecake like Suzy\nFool I spill {?} like Lucy - these hot and double slugs\nMake your blood boil and bubble like jacuzzis\nNigga I did Biz like Cool V\nGet it, Biz and Cool V\nThe dude who used to spin for Markie\nGod you small like yawkies{?} fuck the car keys\nYou frail I trail you home like RV's\nAutomatic Desert Eagle haunt me\nCause I keep static, like walkie talkies\nGo to studio with my love, just to talk\nAs my voice skate on the board like Tony Hawk\n\n[Hook]\nAk, ak, come the fuck on\n{*scratched: \"let me set you straight\"*}\nI put rappers and singers in they place\n{*scratch: \"that's right\"*}\nSmack fire out ya ass\n{*\"Sorry if my loud crude vulgar voice is givin you a headache!\"*}\n\n[Verse Two: Akinyele]\nThe real rhyme sayer, that gotta spray ya\nThis dude been rude since Ice Cube used to wear, activator\nWho the fuck you wanna be, \"Boyz N the Hood\"\nNowadays kids grow up, wantin to be Suge\nBut fuck that, buck that, real rap, come back\nClik-clak, and stick yo' ass like thumbtacks\nNevermind where my slugs at, I'm finnin\nTo have your head spinnin down the street, like a hubcap\nMy gat clap, like pitty-pat, fuck a Smith & Wes\nI pack a Funk Flex, cause I bust +Big Kaps+\nI lay you nigs flat\nMy AK spray at your toupee, and push your wig back\nI got lyrics as soon as you hear it\nIt sound sick and psychotic, you be like Ak still got it\nI'm exotic, I'm dope like narcotic\nThoughts so ripe they feedin me antibiotics\nThe world hottest, they say I'm a little too modest\nCause I walk holdin my balls like the Globetrotters\n\n[Hook]\nYou think you can hang with Ak? Ha, come the fuck on\n{*scratched: \"let me set you straight\"*}\nI put rappers and singers in they place\n{*scratch: \"that's right\"*}\nSmack fire out ya ass\nThat's what you get if you step to the Ak\n{*two loud explosions*} {*scratched: \"blown to bits\"*}\n{*scratched: \"blown to bits\"*}\n\n[Verse Three: Akinyele]\nLet's go, yo\nYou don't want no part of, you soft like Jimmy carter\nI'm big like Nell Carter\nSlam yo' ass like Vince Carter, you want harder?\nI, part your head like a barber\nBomb yo' ass like Pearl Harbor\nSlaughter throw ya body in the water\nYou want harder? I'll, straight, slaughter your daughter\nMake your Dame Dash like Shawn Carter\nFuckin jet like a charter\nYou want harder? I dress harder\nI wear a baseball bat cause I'm a troublemaker real starter\nNiggas is fish like tartar, you want harder?\nI, go to Atlanta bust yo' ass like the martyr/Mardi\nTwentyfive to life for four bodies, fourth quarter\nYou want harder? There's no harder\nI'm the hardest, rap artist, yo regardless shit\nIf you a gold or platinum artist\nMy mac-10 stick men like the +Midnight Marauders+\nGet it? Stic men, album cover, \"Midnight Marauders\"\nSplit your coconut, like pina coladas, yeah\n\nCome the fuck on", "year": null, "album": "Live at the Barbecue - Unreleased Hits", "image": "https://images.genius.com/714c6ffaac1750a6957bfaf508e9b391.700x700x1.jpg"}], "artist": "Akinyele"}