{"artist": "360", "songs": [{"album": "Rarities", "year": null, "title": "Freedom", "image": "https://images.genius.com/e43ac3b183667bcbd9c5f60579b33f10.220x219x1.jpg", "lyrics": "[Intro: 360 & [?]]\n\"Take you down to fuckin' Ringwood Station and belt ya fuckin' head in with an axe pipe ya cunt\"\nHot diggity (yo, people don't even realise)\nForthwrite, homeboys\nI'm wearin' an ankle sock on my balls\n[?] nice, so that way it sort of just, just cups under [?]\n\n[Verse 1: 360]\nAyo, Sixty's in the building, and I spit some shit you feel\n[?] leavin' peeps in perfect health in a critical condition\nIt's the limited edition, I write my rhymes\nIn the projects and change my name to Lyrical Commission\nHa! You all get it, you know when Sixty hits the rhythm\n'Cause all the clothes that I rock I bought from This Is It in Richmond\nI sit and listen, when I flip the sickest spittin'\nLike Weapon X and Ken Hell, I live for kicks and women\nA binger with the bitters, drinkin' gin and flippers\nWritin' lyrics with a system with a Liquor Switch in mixtures\nWith rims witnessing, my spit is blinging wicked, yo\nI shift 'em in from England, they're the prince's rings but twisted\nAnd when it comes to chattin' chickies, shit is wicked\nGod, I need some moisturiser 'cause my fist and lips are blistered\nI'm sick of zinging, so I spit some shit, concealing\nHow I'm gifted with the lyrics, throwing dicks up in your missus\nBitches\n\n[Interlude: 360]\n\"Hey, 360, that was a fuckin' good rap rhyme, I fuckin' liked that one. If people don't like it then I'll fuckin' smash their skull in with fuckin' Dove moisturising cream for being soft cocks and swimmin' in dandelions underneath the fuckin' rainbows, the fuckin' cunts. Where's that PEZ cunt?\"\n\n[Verse 2: PEZ]\nUh emphatic\nAyo, now it's PEZ, I'm at it, I'm fixin' to get emphatic\nAnd spittin' my shit as if all my listeners didn't matter\nI'm sittin', I'm kickin' back and I sip on a drink and stagger\nA binger, a liquor addict, no, really I kicked the habit\nBut shit can happen, so listen, I get it crackin'\nMy writtens are really whack but I hit on a spliff and rap\nI've been given it if you clap a legit and it isn't actin'\nI'm thinkin' this bitch is sick 'cause my shit's from a different planet\nYo, I'll give the facts, I'm a hippie with different passions\nI'm livin' off shitty rations, my fifty odd chickens hatched 'em\nOr fish and chips, they're all twisted up in their package\nThe chips, I can get in quick but not fish if it isn't battered\nUh, ditch the wheelchair, bitches all think I'm braggin'\nI'm blingin' with rims, switched 'em and fitted 'em to my wagon\nI'm hittin' on chicks at random and gettin' 'em into tandems\nIf sixty women give in, I will flip and I'll get a tantrum\n\n[Outro: 360]\nYeah\nWe're the best rappers in this country, bitch\nJust don't know yet, it hasn't clicked (ha ha ha)\n\"Yeah, that was PEZ and '60 from Forthwrite, the band. And if you talk shit about them, then I'll snap one off on your fuckin' face and smudge it in ya faggot cunt! Don't be a fairy, eatin' teddy bear biscuits, go run to mummy in your fuckin' ankle socks and Dunlop bollies fuckhead!\"\nHa ha ha"}]}