{"songs": [{"image": "https://images.genius.com/cebafeb87cd3844c18012605b852ac2b.500x500x1.jpg", "year": "2004-12-14", "title": "Criminal Set", "album": "Weapons of Mass Destruction", "lyrics": "{*helicopter flying overhead*}\n\"Outside the South Central area, few cared about the violence\nBecause - it didn't affect them.\" - Tom Brokaw\n\n\"Break 'em off somethin\" - Ice Cube\n\n[Hook]\n\"Back to the criminal set... but they can't catch me yet\" - Ice Cube\nDon't trip you might break your neck {\"break 'em off somethin\"}\nAnd get wet from the rain of the tec, I {\"break 'em off somethin\"}\n\"Back to the criminal set... but they can't catch me yet\" - Ice Cube\nYour gum bumpin gon' lead to gun bumpin {\"break 'em off somethin\"}\nI'm the one when the party is jumpin to {\"break 'em off somethin\"}\n\n[Xzibit]\nI heard the O.G.'s they don't hit\nAnd I'm the only one left from the West that you can't fuck with\nBut lately I've been feelin like Will Smith\nWhy bother with rap when I can get 20 mill' on a flick?\nY'all niggas just started some shit, the underdog\nMakin songs for them hogs, and them Bloods and Crips\nFor the shah by the mall with a Muslim scent\nAfter all, who do you call to rock your shit? {\"break 'em off somethin\"}\nBust the ghetto bird, circle above, reminisce\nOf the dust kicked up, the dirt swept under the rug\nDuct tape, ski-mask, tape recorders\nCue K's, ready to blaze and bakin' soda\nFirst learned how to cook in a coffee pot\nMade the block get hot like lava rock\nGot love for the block cause I came from that\nBut I ain't afraid to go right back {\"break 'em off somethin\"}\n\n[Hook]\n\n[Xzibit]\nIt's a, suicide it's a suicide\nIf you ever get the heart to try fuckin with mines\nNo change, I'm poppin the nine, you ridin the pine {\"break 'em off somethin\"}\nThe heavy metal knock you out of your mind {\"break 'em off somethin\"}\nNow how many really gon' ride, when the war start?\nEaten alive by these hollow-tip darts\nMy 12 gauge'll tear you apart, don't get caught at the light\nThe house party or the neighborhood park\nMr. X marks the spot then pops the mark\nTurn your whole neighborhood to a parkin lot\nI paid the cost to be the boss\nAnd will do my time standin up 'til I get an appeal\nThese weapons too real to conceal, so why bother\nSemper fidelis, I learned from my father\nI always stay faithful to myself and grow\nBut when I catch that ass after the show - {\"break 'em off somethin\"}\n\n[Hook]\n\n[Xzibit]\nI'm slick and slippery\nOn a high-speed chase all the way to the victory\nY'all niggas is stone cold mysteries\nToo weak, can't stand in the ring with me\nPut a pussy back in his place, straightlaced\nWith a Strong Arm Steady gang up in your face\nI run a race with the West to my back\nWhile you're the reason why they say niggas in the West can't rap\nEver since the white Concourse 'Llac, I've been unmatched\nA avalanche in the hood on attack\nJust hardcore actual facts, never wait\nJust react when them killers come at you with gats\nHad to dig the knife out of my back, now I'm back on track\nHittin laps, 'bout to widen the gap yo\nIt ain't the long fall from the top that got 'em\nIt was the sharp sudden stop at the bottom, haha {\"break 'em off somethin\"}\n\n[Hook]"}], "artist": "Xzibit"}