{"artist": "Zaytoven", "songs": [{"year": "2017-12-15", "album": "Zaytoven Presents: Trapping Made It Happen", "title": "No Mo", "image": "https://images.genius.com/40e5e08185918444aece0c4b02fae81a.1000x1000x1.jpg", "lyrics": "[Intro]\nIt's the weekend. So man, fuck your problems, man, I don't give a fuck about your motherfuckin' problems, brah. You know what I'm sayin'? You need to stop chasin' these hoes, my nigga. You know what I'm sayin'? Bitch is takin' all your motherfuckin' check, nigga, you know what I'm sayin'? Like nigga you broke than a motherfucka ‘cause you spend it all on these dirty ass hoes. Find you a real woman, my nigga. Yeah\n\n[Chorus]\nAin’t nobody cuffin’ no mo’ (nooo)\nI can’t fall in love with these hoes (nooo)\nAin’t nobody cuffin’ no mo’\nSmoke a blunt, bust a nut then its back to the dough\nAin’t nobody cuffin’ no mo’ (nooo)\nI can’t fall in love with these hoes (nooo)\nAin’t nobody cuffin’ no mo’ (nooo)\nShe gon’ bust it open, I’ma throw this cake on the floor\n\n[Verse 1]\nMister Officer, Mister Officer\nPlease take the hand cuffs off of her\nWhy you stalkin’ her? Why you stalkin’ her?\nHackin’ phones tryin’ to find out who she talkin’ to\nYou was callin’ her, you was callin’ her\nLast night she ain’t answer, I was all in her all in her\nWe was all in her, we was all in her\nMade her bust that pussy careful, all my dawgs in here\nIt was me, Juicy J, and all my wolves from ‘round the way\nI spend 20, I spend 30, I blow 50 in a day\nThat ain’t nothin’ to a boss, I spend 300 on a Wraith\nI can’t save no mo’ hoes, ain’t no room in my safe (nooo)\n\n[Chorus]\nAin’t nobody cuffin’ no mo’ (nooo)\nI can’t fall in love with these hoes (nooo)\nAin’t nobody cuffin’ no mo’\nSmoke a blunt, bust a nut then its back to the dough\nAin’t nobody cuffin’ no mo’ (nooo)\nI can’t fall in love with these hoes (nooo)\nAin’t nobody cuffin’ no mo’ (nooo)\nShe gon’ bust it open, I’ma throw this cake on the floor\n\n[Verse 2]\nAll these niggas cuffin’ and these bitch really nothin’\nI can’t fall in love, hey bitch, that shit ain’t up for discussion\nTreat you like a freak because I know your ass be bussin’\nHe toss a couple dollars, you gonna let that nigga touch it\nYou used to niggas trickin’ but tonight we fuckin’\nI can’t take you home to momma, I can’t take you out in public\nI don’ spent so much on you I gotta put you in my budget\nShake that ass, make that money, who am I to judge it?\nThese hoes belong to everybody, everybody\nKill that bitch, that's a dead body, dead body\nThese hoes, they be backstage, sellin’ pussy\nThese hoes be on Backpage, sellin’ pussy\n\n[Chorus]\nAin’t nobody cuffin’ no mo’ (nooo)\nI can’t fall in love with these hoes (nooo)\nAin’t nobody cuffin’ no mo’\nSmoke a blunt, bust a nut then its back to the dough\nAin’t nobody cuffin’ no mo’ (nooo)\nI can’t fall in love with these hoes (nooo)\nAin’t nobody cuffin’ no mo’ (nooo)\nShe gon’ bust it open, I’ma throw this cake on the floor\nHey"}]}