{"songs": [{"album": "Politics & Bullshit", "year": null, "title": "Change", "image": "https://images.genius.com/ed873412f2a1033a10fd270c02798a3d.355x352x1.jpg", "lyrics": "[Intro]\nThis purple be having me in a storm man\nThinking bout a whole bunch of shit man\nLemme get this off my chest real quick\n\n[Verse]\nYo\nWell this rap shit {what}\nHas certainly changed\nHow could it ever work for these lames?\nDuck-hunt, with all these birds in the game\nThat's word to my gang\nD-I-P you heard what I claim?\nWriter mayne\nHottest thing on this turf and terrain\nI luagh\nYou ain't as great as you think\nYou hear that?\nThat's me laughing all the way to bank\nCome play in the paint\nI've been a pro\nIf it ain't a give and go {what's that? }\nI see it like it buy it, that what I call a pick and roll\nDig though, I'm eating chump\nI don't need to front\nFor prjoects with the weeks and months\nI ain't take a breather once {no way}\nIt's easy punk, I'm top the line\nRhyme for rhyme\nCouple rocks, and a watch, ock that means it's time to shine {bling}\nLittle guys behind\nBut check it I'm a ride for mine\nIf I was super man the S'll be a dollar sign {Ching}\nI ain't lying, I be styling creep\nHow I'm cheap?\nWhen seven days a week I'm fresher than a bounty sheet {fresh}\nThe bounty hunters couldn't find this little town I creep\nMy lounge discreet\nSome of my niggas meet me down the street {word}\nThey hound the beast on some star struck shit {how}\nCameras out like britney spears on a startbucks trip {flick}\nGet your bars up prick\nUh understand me these queers are candy {candy}\nThrowing jabs but your oscar wearing panties\nI dare you trannies get R uh mad\nI'll carve the fag {why}\nYour album trash\nThe next one should come in garbage bags\nLittle garbage ass could never be a diplomat\nYour shit is wack\nIt's a fact\nYou bastards always been in jack {swag}\nI get a cat to bring a ration where you living at\nGet your clappers, swing around the plastic like a wiffle bat {click clat}\nNow that's a christmas wrap\nGo head with the chitter chat\nWe'll chitty chitty bang bang all over your fitted cap {blaow}\nThe kid is back drowning the mic\nIt's the king kiss the ring niggas bow to the nice\nHow I ain't nice?\nI style for real {real}\nThat's really how I feel {feel}\nI turned a street mixtape into a album deal\nI'm bout them bills\nSo until I touch em millions boo\nI'm a puff a splif or two\nAnd fuck up my perifials\nHolla!"}], "artist": "J.R. Writer"}