{"songs": [{"title": "Cold Summer", "lyrics": "[Intro: Jeezy]\nYeah, this for all the real niggas man, ya know\nWoo! Yeah (it's gon' be a cold summer)\nHahahah, yeah, woo, uhh\n\n[Chorus: Jeezy]\nGon' drop the top, you can feel the breeze\n30 in the Glock, all you gotta do is squeeze\nIt just touched down, all you gotta do is sell 'em\nAnd they gon' ask you questions but you better not tell 'em\nHey I'm 'bout to fuck it up, I'm bought in like 10\nA couple bad tings and they all light-skinned\n\"Hey, how you comin' down?\" In a rose gold Hummer\nWife beater chinchilla, it gon' be a cold summer\n\n[Verse 1: Jeezy]\nGot it snowin' in the city, I'm 'bout to change the weather\nSo many birdies in this bitch, thought I was seein' feathers\nSo many pussies hatin' on me, I just want the love\nHottest niggas in the city, me and Mr. Rugs\nThem young niggas paper'd up, that's straight from water whippin'\nHey, between me and you I think the water trippin'\n$250 in my pocket, I'm a walking lick\nWent crazy at the lot, bitch I'm a lunatic\nMy nigga Bleu got secrets he will never tell\nFree Bale, yeah you know he see me with the scale\nIndicator like I'm Mike, I'm fucking 'round with Jody\nOne time for Raw Cena, that my fucking woadie\nOne time for Ross, go tell 'em free the goat\nTell him in the 305, bitch I'm in on a boat\nGot a 100 in my pocket, Free T. White\nTwo mill' on wheels and they all white\n\n[Chorus: Jeezy & (Tee Grizzley)]\nGon' drop the top, you can feel the breeze\n30 in the Glock, all you gotta do is squeeze\nIt just touched down, all you gotta do is sell 'em\nAnd they gon' ask you questions but you better not tell 'em\nHey I'm 'bout to fuck it up, I'm bought in like 10\nA couple bad tings and they all light-skinned\n(Hey bruh, pull up, what you in?) In a rose gold Hummer\nWife beater chinchilla, it gon' be a cold summer\n\n[Verse 2: Tee Grizzley]\nGet-get that cookie money, on my Oakland shit\n40 on a nigga, I'll blow this bitch\nWhen I shoot, I don't miss or I net that bitch\nFuck her quick on the first night, I barely met that bitch\nToo much money on me, bring that firepower\nKnife on that chopper, they think Michael Myers got 'em\nThe rap fold, I'ma go platinum still\nCause I put my deal money in the blow, crack and pills\nI'm from Detroit baby, that's a wild city\nHop on at yo block party and give the crowd 50\nAye Dex, when I hear that \"huh\", I know I hit it\nI still fuck with Paid Will, Dada winnin'\nPeezy and Pay, let's come together, this our city\nJeezy in the A, he fuck with Meech, that's our nigga\nRest in Peace to Great Lake ruler Darnell Lindsay\nStill hit the kitchen to whip, Chef Boyar-Grizzley\nDetroit!\n\n[Chorus: Jeezy]\nGon' drop the top, you can feel the breeze\n30 in the Glock, all you gotta do is squeeze\nIt just touched down, all you gotta do is sell 'em\nAnd they gon' ask you questions but you better not tell 'em\nHey I'm 'bout to fuck it up, I'm bought in like 10\nA couple bad tings and they all light-skinned\n\"Hey, how you comin' down?\" In a rose gold Hummer\nWife beater chinchilla, it gon' be a cold summer", "album": "PRESSURE", "year": "2017-10-26", "image": "https://images.genius.com/b358ab0c096ffe1f0679f24f6bcf3d47.472x472x1.jpg"}], "artist": "Jeezy"}