{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "Dolla and A Dream", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Intro]\nFor all my ville niggas man\nAll my Carolina niggas man, (lights off and shit)\nAll my real niggas, no matter where you come from\n\n[Verse]\nA dolla and a dream, thats all a nigga got\nSo if its about that cream, then I'm all up in the spot\nI was raised in the F-A-Y (why), a nigga never gave me nothing?\nPops left me, I ain't never cry, baby, fuck him, that's life\nAnd trust me I'm living, look what a nigga made out\nThe shit that I was given, look what a nigga came out\nMomma sewing patches on my holes\nMan, our hoes couldn't put this flame out\nStraight up, I got my back against the brick wall\nI'm from a world where niggas never pop no Cristal, it was pistols\nYou pass through, you better pray them bullets missed y'all\nI thank the Lord, He let a nigga make it this far\nA lot niggas don't, a lot of moms weep\nI gotta carry on, all the weight is on me\nYou never know when a nigga might try to harm me\nRest In Peace that nigga John Lee, I pour liquor, homie\nIt's foul, but yo the world keeps spinning\nGotta keep winning, get up off this cheap linen\nNigga I'mma eat, even if it means sinning\nNiggas want beef, I'mma sink my teeth in 'em\nPause, I go harder, I am all about a dollar\nYou niggas street smart? I'm a motherfucking scholar\nSo trust me, I ain't stopping 'til my money is long\nSo much dough, them hoes will think I'm rocking money cologne\nHave a model at the crib waiting, \"Honey, I'm home.\"\nCooking greens for a nigga, give 'em plenty, a dome\nIt's funny, we dream about money so much its like we almost got it\nUntil we reach up in our pockets, its time to face reality\nThe ville is a trap nigga now\nAnd if you ain't focused you gonna be here for awhile, yeah\nMy nigga Mike rolling with me, riding shotgun\nType a nigga know about every car, but don't got one\nThat's hunger, no wonder niggas fucking with the evils\nPosted on the corner, selling crack like its legal\nBut who am I to judge how a nigga get his paper?\nThis money coming soon, dog, I'm tryna get my cake up\nI guess I gotta wake up these niggas myself\nAn E&J sipper, but my shit is top shelf\nYoung J, the rawest shit you niggas ever heard of\nA journalist nigga, call me the Fayetteville Observer\n\nYou know the routine, man\nFayettnam\nReal niggas can relate\nAnd Ville niggas can relate, man\nMy niggas know about the struggle, man\nWhat you know about your momma sewing patches on your holes, nigga?\nI had the light blue jeans with the green patches, haha, oh shit\nI was in like first grade man, I swear\nIt was like the Sixes came out, the Jordan Sixes\nThem shit was so fly man, I wanted them so bad\nDarryl what up man?\nMy nigga Darryl had them shits on in class yo\nI wanted that shit so bad\nI begged my mom for that shit, you know\nBut she couldn't afford it, yo, she gave me\nGot me some Reeboks black tops, ahaha\nBut that was all good tho, cuz uh\nThe year after that I had, I had some, some no name shits\nSome all black shits, haha\nThem shits had metal, metal shoelace buckles and shit, you know?\nBut you know back then niggas didn't\nNiggas ain't even know he was broke man, no worries and shit\nBut uh, times have changed man, I got bills\nMy mom is in debt, what you know about that?\nCollege loans and shit, nigga\nGotta get this money, ma"}], "artist": "J. Cole"}