{"songs": [{"title": "Crime Pays", "lyrics": "[Young Buck]\nState to state, slippin slate nigga\nThis for the block nigga\nE'ry nigga out there who God damnit maintainin\nOff slangin 'caine and all dem, thangs\nAnd y'knowwhatI'mtalkinbout I feel that (I feel that)\nSee I done been in that situation where niggas flip birds\nY'all know the gangsta, lil' young nigga\nWho thugged out all night on the curb, came up from a GRAM\n\nAnd bitch I got 'em warrin for 10-5, the new nigga in town\nI'm the king of this drug ring, just waitin to be crowned\nYou havin money by the ton, I got thousands by the pound\nAnd the urge to splurge for all you niggas want an ounce\nAin't no problem with the product, long as you got the amount\nAnd every bit of my fetti, cause every bit of it count\nI'mma roll in the low, rain snow hot or cold\nFinish my narcotics and put my bitches on the road\nFirst nigga try and jack, watch murder go kill them hoes\nAll white, no crack, how I get it, how it go\n17 years old, I'm rappin 10 at a time\nTo me, front shit ain't punk shit, long as I get mine\nAnd we can get down to shine, no more sellin them dimes\nPut 20's on our rides, fuck hoes with thick thighs\nThen maybe you can see, how it is to be rich\nYou ain't heard about a nigga? I be servin them bricks\n\n[Hook]\nNightfall to sunshine, 24 hour shifts\nIf crime didn't pay, I'd be still on the strip {*repeat 2 lines 3X*}\nNightfall to sunshine, 24 hour shifts\nLook - if crime didn't pay, I'd be still on the strip\n\n[Young Buck]\nI've survived off this cocaine game, and it's a strain to my brain\nTo front a nigga a thang, 'bout mine he won't complain\nConversation rule the nation, y'all niggas know the sayin\nPrayin I don't catch ya wit'cha watch I'll take ya out the picture\nMoney run the country, similar to Adolf Hitler\nAlways been to drugs but see it's different kind of dealers\nYou pay what you weigh, or should I say, get my scrilla\nNot tomorrow but today, okay, it's on the real'a\nI ain't tryin to be a killer just a nigga 'bout his cheddar\nAnd I ain't got it, you can't cancel the bill collector\nCoulda been did your rump, put your family in the middle\nBut I chose to be a man and keep it on that level\nYour potnahs done told you about this young runnin rebel\nAnd the load he carries behind if I can't get mine\nSo robbin niggas blind is the way I'mma play the game\nGotta respect my mind and if you don't you still payin\n\n[Hook]\n\n[Young Buck]\nI'm a 100% for the Presidents\nI never been hesitant, to leave 'em layin with no evidence\nGotta make the best of this, stack my cheese\nThen come back and get the rest of it, transportin ki's\nIn the Benz with the leather kit, ride with me\nWhen you hear that Desert Eagle click it's world war 3\nThis ain't how it 'posed to be, but ain't no fuckin role model\nBesides people down in hell still want ice water\nNow how you livin nigga? When hard times come\nCan you stand prison nigga, or you gon' run yo' tongue?\nWhat's that on yo' arm? You feel like it make a man?\nWell let me get that and yo' charm, but turn around and count to 10\nCan't turn soldier in one day, the thug gotta just be within\nYour blood or yo' family, the streets gon' tell how good you been\nBut see I'm a young nigga {edited} in his face\nSince 12 I had a triple beam servin them cakes\n\n[Hook]", "album": "T.I.P.", "year": null, "image": "https://images.genius.com/d018174ecb7b887477659509ddf44ca3.499x499x1.jpg"}], "artist": "Young Buck"}