{"artist": "King T", "songs": [{"image": "https://images.genius.com/4ecadf00855c55fe49bd112852218051.704x704x1.jpg", "title": "Just Flauntin’", "year": null, "album": "Tha Triflin’ Album", "lyrics": "Hay-ya!\n'sup\nGot my homeboy Jazzy Ren in the house\nThis is the mighty King Tee\nAnd my homeboy DJ Aladdin is in the place\nBlunt-smokin Mike\nAnd I'mma flaunt these lyrics right here\n\nMoves - I got moves for the mind\nKind of weary but if you hear me, you'll find\nNo one could conquer the Kingdom I resurrected\nPerfected this, watch out, there's a hectic\nMan on the stage, screamin out a page I wrote\nThe type of shit MC's wanna quote\nAnd get broke off somethin real swell\nCause I can tell you try to swell when you bail\nBut you ain't big, don't try to stick out your chest\nJust phantasize you bein the best\nNot a clear picture, huh, not vivid\nMediocre MC's can't deal with this\nAnd what you're hearin now is Tha Great\n(Is that right? - Oh yeah, he's back, for haven's sake)\nYes, I'm comin, I'm bringin what you're wantin\nIt might sound like I'm goin off, but hey, I'm just flauntin\n\n(Suckers try to knock him but they never succeed) --] W.C\n\nBack at home I got a throne where I sit\nPiecin up metaphoric bits\nMy style is the quiet, cool gangster type\nBut when the 40 hits, it gets hype\nNiggas can't understand and trip\nWhen I be rockin that old school shit\nThat I used to play when I rolled like a professional\nHittin side to side in my fo'\nFlauntin the technique just like when I speak\nMy words come above the average peak\nE can get swift with a scratch\n( *E-Swift scratches a quote* )\nPeople keep askin: does King Tee still have his Coupe?\nOr will he flip and make a song like 'Knockin' Boots'?\nCome on, hop, picture that on a flick\nI ain't goin out like a trick\nNo matter what you do, I always pop up, troop\n(Like what?) Sort of like if I was wild rumour\nAnd this is how you pump it when you're livin in Compton\nCause it ain't about nothin but flauntin\n\n(Suckers try to knock him but they never succeed)\n\nYeah, I'm just flauntin'\n\n(Suckers try to knock him but they never succeed)\n\nBreak it down\n\n(Suckers try to knock him but they never succeed)\n\nCome on\n\nNow homes! (What up?) Homes!\nI need headphones to hear the funky tones\nNo more switchin, I'll pitch the bitch and\nNow we're gonna swing\nWith the Coolest King\nThe imperial\nI'm the one that makes you go buy your stereo\nSo you can hear me flow\nAnd bro, on the microphone I'm a flexer\nYou got played, and on the mic you're a extra\nI go deep for the dope style and I stay sharp\nFrame my lyrics up like art\nMC's keep on runnin cause my tracks are stunnin\nBack in '85 is where I spun, and\nUp jumps the crowned royal King of Cool Rap\nAnd when I rock the joint, they be like \"Who's that\nFly rappin nigga?!\" and rappers be like, \"Pull the trigger\nLet's assassinate King Tee Tha Great\"\nBut faith keeps me on top of the crop\nWith a 40oz. of beer and a blunt full of pot\nAnd this is for the suckers that be frontin\nIt's King Tee Tha Great, in '92 I'm just flauntin\n\nBaby!\n\nJust flauntin'\n\nI wanna say peace to my homeboys DJ Aladdin and DJ Pooh\nMy homeboy MC Jazzy Ren\nBlunt-smokin Mike\nYouknowmsayin?\nAnd we outta here\nOn out"}]}