{"artist": "The Weeknd", "songs": [{"year": "2016-03-30", "lyrics": "[Intro: Bryson Tiller]\nThis is\nThis is not a mothafuckin' game, why you playin', boy?\nI'm just sayin', boy\nYeah\n\n[Hook: Bryson Tiller]\nYeah, Rambo\nThey beggin' for mercy, like the Lambo'\nKnow they told me kill 'em all, goddamn though\nI know they want to see me fall, look where I am though\nOn two feet, that's where I stand though\nI'm a true fuckin' killer, like Rambo\nNo ammo, they see me on the Sanyo\nNigga, I just kill 'em 'cause I can though\n\n[Verse: The Weeknd]\nI just signed a deal so big that it's a secret\nVictoria's Secret Angels dancin' 'round me for a reason\nSpread your wings for me like I'm Freddie Mercury\nBut baby, you should call me king, you know that it's my season\nI'm out to re-up, made another killin' in Reno\nI couldn't leave her until I paid a visit to P.O\nToo much tequila, I had too much tequila\nThey cuffed me like I was single, fuck it I'm back to Henny\nThank the lord, didn't kill me in the elevator\nWasn't my time, saved my soul, save it for later\nCheat death that day, never played fair\nRoll stress all day, blow it in the air\nHad to kill the pop game so they know what's up\nNow I'm poppin' back swift, had to shake it off\nSobriety is an enemy, I'm sorry momma\nSociety now acceptin' me, pray for the young ones\nI'm from the Scar town, city no love\nFrom the town where a nigga never ever blow up\nNow they love me cause I shine, shawty\nIf you ain't fuckin', then it's time, shawty\nI see the truth inside your eyes, shawty\nIf you don't love me then you lied to me\nIf you don't love me then you lied to me\nSwallow all your pride for me\nOr you can swallow all the time for me\nNow you can tell me how that taste, girl\nGene Simmons tongue but I ain't down for the kissin'\nMy nigga got a scope, and I ain't talkin' 'bout the rinsin'\nMy nigga’s hittin' notes and I ain’t talkin' ‘bout the singin'\nI'm breaking billboards for my city, got me thinkin'\nI'm a motherfuckin' villain in my town\nHeath Ledger, 'bout to O.D\nMarried to the game, I ain't never gettin' cold feet\nKillin' all these lames, lot of motherfuckers owe me\nI just stay quiet, I just let the money climb high\n\n[Hook: Bryson Tiller]\nLike Rambo\nThey beggin' for mercy, like the Lambo'\nKnow they told me kill 'em all, goddamn though\nI know they want to see me fall, look where I am though\nOn two feet, that's where I stand though\nI'm a true fuckin' killer, like Rambo\nNo ammo, they see me on the Sanyo\nNigga, I just kill 'em 'cause I can though\n\n[Outro: Bryson Tiller]\nThis is not, this is not a\nThis is not a mother-\nA mothafuckin' game\nThis is, this is not\nThis is not, this is not\nThis is not\nA mothafuckin' game, why you playin' boy?\nI'm just sayin', boy\nI'm just sayin', boy\nThat's all\nGod! Tiller!", "image": "https://images.rapgenius.com/bd7f00aec748641908210302ac39ef42.500x500x1.jpg", "album": null, "title": "Rambo (Remix)"}]}