{"artist": "Wiley", "songs": [{"year": "2008-11-10", "lyrics": "5, 5am, it's so strange to be here again\nFalling, falling down\nSomeone help me, before I hit the ground\n[Wiley:]\nThese are the hours when I capture most of my\nMagical moments on the power book, money by the hour book\nLet them into my ward and show them how I took\nA sound from there, a sound from here\nSaid I never leave the hood but now\nI look back don't matter where you live you're alive and kicking\nI'll always try and stop you tripping\nBut it's awkward if you slipping up yourself, I ain't perfect though\nThat's why I haven't stopped my search yet\nLooking for what? I don't know, in the end it's all worthless\nSee the world's just a place full of workers\nNon-workers earning like workers, born to not work\nFeels like I ain't worked a day in my life but\nI've worked every hour, work any hour\n5am's cool; I get paid by the hour\n\n[Chorus:]\n[Scorcher:]\n* Sigh *\nWhere's my phone?\nWhat's the time?\nWhat?\nCan't be, can't be\n5am and I can't sleep it's been the same for the past week\nI've been up from morning, my daughters clogged up ???\nI smile cus she's breathing; I turned on my line in the evening\nIt's Friday, I know I've gotta grind through the weekend\nSo even if it's 5 o'clock, there's no way that my grind can stop\nMy funds rising, the suns on the horizon, I stop and admire it\nThen it's back to curb work, as the birds chirp\nI'm out trying to catch the first worm\nNo hourglass, no sun dial as the hours pass, not one smile as\nI wipe the cold from my eye; I'm colder than ice\nI look down and the phone saying 5\n5, 5am, it's so strange to be here again\nFalling, falling down\nSomeone help me; help me before I hit the ground\n5, 5am, it's so strange to be here again\n5, 5am, it's so strange to be here again\n5, 5am, it's so strange to be here again\nFalling, falling down\nSomeone help me; help me before I hit the ground\nOne, Two-three, Four, Five, Five. (4x)\n5, 5am, it's so strange to be here again\n5, 5am, it's so strange to be here again\n5, 5am, it's so strange to be here again\nFalling, falling down\nSomeone help me; help me before I hit the ground", "image": "https://images.genius.com/629f0b8ec8902db1727df12bab4b1c0c.240x240x1.jpg", "album": "See Clear Now", "title": "5am"}]}