{"songs": [{"year": "2008-08-10", "album": "Not 4 Sale", "image": "https://images.genius.com/f0a901d03b5db37284706922ef6d3d03.1000x1000x1.jpg", "title": "Numba 1 (Tide Is High)", "lyrics": "* album version features Rihanna, single version features Keri Hilson\n\nLight it up!\nEverybody light it up!\nCome Rihanna light it up!\nKardinal light it up!\n\n[Hook: Rihanna]\nThe tide is high but I'm holding on\nI'm gonna be your number one\nNumber one\nNumber one\n\n[Kardinal]\nShe just my part time lover, pretty likkle ting\nNothing I would ever think about giving a ring\nNothing but a pretty likkle overnight fling\nEven though she wanna be the queen to my king\nShe ain't nothing but a work for my ginseng\nSomeone I would use to bust my box spring\nShe would a number one, not di badda-bing\nBad man nah go badda wid di wife-wife ting\nShe gotta know she the girl on the side\nOn the left of the rest, number two on my mind\nThere's no way she could be my girl\nBut she steady tryna come into my world, not uh!\n\n[Hook: Rihanna]\nThe tide is high but I'm holding on\nI'm gonna be your number one\nNumber one\nNumber one\n\n[Kardinal]\nYo! She's just my trophy piece, mi hot hot gyal\nNever ever would I call her Ms. Offishall\nNever ever would I bring her around my fam\nShe be crying on the phone but she knows who I am\nMr. Kardinal - voice of the people\nBlack Jays family our verses are lethal\nI don't have time for the play play\nShe a good chick yo but I'm married to the game\nMarried to the fame, related to the paper\nTryna get my name put up on a skyscraper\nThere's no way she could be my wife\nBut she's steady tryna come into my life, not uh!\n\n[Hook: Rihanna]\nThe tide is high but I'm holding on\nI'm gonna be your number one\nNumber one\nNumber one\n\n[Rihanna]\nThose other girls ain't nothing like me\nJust give me the chance and boy you will see\nThat I'm not the kinda girl\nWho'll just get down like that\nOh no!\n\n[Kardinal]\nOn the real, I ain't gonna front ya\nThe fox to a lot of hound dogs on the hunt\nYou the push to a lotta kush, rolling a blunt\nYou the hottest in the dance but you ain't what I want\nI'm a business man! Tryna get the business\nJust tryna wuk out ya physical fitness\nThere's no way you could get that ring\nBut I hear all the hotty-hotties in the place sing\n\n[Hook: Rihanna]\nThe tide is high but I'm holding on\nI'm gonna be your number one\nNumber one\nNumber one\n\nThe tide is high but I'm holding on\nI'm gonna be your number one\nNumber one\nNumber one\n\nLight it up!\nEverybody light it up!\nCome Rihanna light it up!\nKardinal light it up!"}], "artist": "Kardinal Offishall"}