{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Situations", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Intro: Obie Trice]\nAyo, this Obie Trice, motherfuckers\nAnd I got this wild ass, crazy motherfucker with me right now\nDemented\nWho the fuck is King Gordy?\n\n[King Gordy]\nKing, emperor, Dalai Lama, I'm [?]\nRuler, god-like, East side's only hero\nKeep a cape in the ground, homo sapiens bow\nCome and take a sit down with me at the table that's round\nGot 50,000 soldiers ready to blow you the fuck away or die tryin' after one of my orders\nSo I tried to be King, so I died to be King\nBut I be the only one that [?] on the scenes\n\n[Interlude: Obie Trice]\nKing motherfuckin' Gordy, motherfuckers\nYeah, I wanna hear about some street shit though, Gordy\nI wanna hear that shit about that spotlight, nigga\n\n[King Gordy]\nI'm in a crack house sweatin' with my [?] of the door\nNailed to the floor as I pull my floorboard\nThe cops ain't gettin' in\nGot crack head zombie watchin' out for me\nGot the fiends to rock for me\nIn return I break 'em off a piece\nNow obviously I'm smokin' hashes with my partners, E\nSome are into larceny or straight up a robbery\nComin' hot [?] out try and shop for keys\nWe can work a deal, but you gotta coppin' threes\n\n[Interlude: Obie Trice]\nThat's right, my nigga\nBut yo, you got these bitches out here tryna stick you for your dough and shit\nThey want rent, diapers, babysittin'\nWhat do you think about a bitch?\n\n[King Gordy]\nGet rent from me? Bitch, you ain't worthy\nYou're nothin! Been suckin' dick since the age of thirteen\nOh, I ain't know you for that damn long? Bitch please\nWhat? Not using tampons? Bitch, bleed\nOh yeah, you gave me some head, you were on bent knees\nNow you deserve a Bentley? Bitch, stop trickin'\nSuckin' dick and ass lickin' must've got to your brain\nHe's a blunt, some Hennessey, and $50 in change\n\n[Interlude: Obie Trice]\nStank bitch, haha, ayo, Gordy\nLet these niggas know how us Detroit niggas come through when we mash out on 'em\nThrow that shit on on they ass, come on!\n\n[King Gordy]\nThree piece alligator suits, alligator boots\nWith a navigator, interior alligator too\nHaters wanna shoot\nPlatinum and diamonds is beatin' the sun [?]\nSupermodels that's knockin'\n[?] when they tongue kissin'\n[?] style [?] sippin'\n[?] out to Italy, want leave? Come visit\nChillin' in castles with dimes that run the villiage\nBroke niggas spit brick shit, bitch done did it\n\n[Interlude: Obie Trice]\nDone did it, bitch\nAyo Gordy, now I know you a weed kinda sort motherfucker\nSo if you had some weed here, what would you tell marijuana?\n\n[King Gordy]\nOh yeah, she my first love, I don't know where to begin\nYou my only friend, taught me how to reason within\nWhen I was down, showed me how to exhale and breathe again\nWhen I was blind, made me open my eyes and see again\nJust the aroma and the taste of you makes me laugh\nPut a spell on me everytime I fuck with you you make me hungry\nSometimes I put my blunt in a thong, it sleeps with me\nY'all niggas just smoke, I [?] with weed\n\n[Interlude: Obie Trice]\nYeah, ay Gordy\nI want massacre now nigga, I want death\nYou ain't killed a nigga on a track yet\nI want you to kill these motherfuckers\nKill 'em!\n\n[King Gordy]\nFresh flesh under my fingernails\nShe gouging your daughter's crotch out\nYour father got knocked out\n[?] sneakers cut off, and locked [?]\nNiggas smile when he's still pissin, ooh and pee still shootin' out\nThey don't have a prison that could stop King Gordy from performin' nasty sadomasochism\nAbusin' my children until they just badly injured\nThreatenin' wives and tell the cops they mama did it\n\n[Outro: King Gordy & Obie Trice]\nHahahahahaha, King Gordy motherfuckers\n(Obie Trice motherfuckers)\nSituations\nA subject [?]\n[?]\nEmperor! King!\nHahahahahahahahaha"}]}