{"artist": "King T", "songs": [{"image": "https://images.genius.com/734dbdd658aa37c105571e25c4af3ce2.600x601x1.jpg", "title": "Act a Fool", "year": "1988-11-15", "album": "Act a Fool", "lyrics": "[ VERSE 1 ]\nIt's Friday night on the streets of L.A\nI'm goin' out, been hangin' 'round the house all day\nSo i take me a shower, dress like a big daddy\nStop at the Arco, put some gas in my Caddy\nArmor on my wheels, shine up my Daytons\nCheck my 12-gauge, I see jackers just waitin\nGot in my car, rolled up the tinted glass\nLooked for my Zapp tape to pop in my dash\nCan't find it, forget it, went under my seat\nFound my old fired tape of the song \"Knee Deep\"\nSo I popped it in, then I pumped it up\nLove hearin' Funk because Disco sucks\nBody got chills when the basses started poundin'\nI took off because I'm goin' to town, and\nWon't be back 'til mornin', don't have to go to school\n(Better get ready) I'm finna act a fool\n\n[ VERSE 2 ]\nNow I'm on the move, got a grand in my pocket\nReached for my phone, plugged it in the socket\nHeard the dial tone, so I dialed up Aladdin\nHe answered the phone and said \"What's up?\" I said \"What's happenin\"\nHe said, \"Where you been? I been tryin' to get in touch\nThe party's in Watts,\" I said, \"I don't give a fuck\"\n\"If you wanna go, just wear neutral colors\nIf anybody asks you, just tell 'em you're my brother\"\nStopped at the store to buy me a Cisco\nA 40 ounce and some crackers by Nabisco\nA pack of Dentyne and I pulled out a 10\nAnd said, \"Fuck it, Super Socco and gin\nI'm finna act a fool\"\n\n[ VERSE 3 ]\nNow I'm drivin down Compton on my way to get Aladdin\nFeelin' like a pimp till my tape started draggin'\nIt's a old tape anyway, it ain't no thing\nPulled it out and slapped in Dana Dane\nGot to Aladdin's house and I honked my horn\nHe said, \"When we comin' back?\" I said, \"6 n tha morn\"\nSo he got in the car, lookin' half-dead\nSo I gave him my Cisco and took the 40 to the head\nNow I'm feelin' tipsy, and I'm headed for Watts\nBut wait, what do I see sittin' at the bus stop?\nSexy Susanna, had a butt that kills\nPretty long hair, but they say it's not real\nAladdin yelled \"You fake tramp!\" She threw a rock in my glass\nSo I got out my car and drop-kicked her ass\nI checked out my window, everything was cool\nShe was lucky I was nice and I didn't act a fool\n\n[ VERSE 4 ]\nWe finally arrived at the party, drunk as a jerk\nGot out my car, pressed the clip so the alarm would chirp\nAfter that we made our way, I tried not to fall\nCouldn't walk a straight line if they let me crawl\nGot to the door, and what spots my eye?\nMy homeboy Mr. Prince, and he's smokin' some Thai\nSo I stumbled his way and said, \"Hey, pass the J\"\nI took a hit then a hit from my mouth spray\nThis girl asked me to dance, but I told the hoe no\n'Cause she was on my tip 'cause of my big gold rope\nBut it seems she got offended - that's splendid\nBefore she starts somethin', I just slap her and end it\n'Cause I feel like a gangster, and I just don't care\nAbout a girl with fake drag, fake eyes, fake hair\nFake clothes, fake nails and all that fake jewelry\nAll she wanna do is tell her friends that she screwed me\nI get nutty, act a fool when I want to\nRun up when I'm drunk and I just might pump you\nTake your car, your wife, keep talkin', your life\nBeat you down like a cluck and have you smokin' the pipe\n(You know why? 'Cause I'm cool)\n\n(Well, kill me!\nShoot me, muthafucka! *gunshots* Pie-yow! Ah shit!)\n(I gotcha)\n(Oh goddamn)"}]}