{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "Ghetto Music", "album": "Hannicap Circus", "lyrics": "Hey yo, this is your high guy in the sky, flying by\nAnd right now I'm probably on Van Dyke and Harper\nSmokin' a long one paper swisher of some fire ass greens\nWhich is way more important than returning your phone calls\nAnd listening to any messages that you have left me\nPlease have a fucked up day!\n\n[Bizarre]\nWhooo! This is a wonderful day!\nThe sun is shinin', it's eight-five degrees in Detroit, Michigan! (Yeah!)\nThe kids is outside playin' (Alright!)\nAnd I'm HAPPY! I'm happy!\nCause I just came from thirty-six Dichan Court!\nAnd I'm a free man! (Alright!)\nNow I'm a go to the store, and get me a Bud Lite!\nAnd a fat, bag of weeeed!\n\nWakin' up lookin' for a bag of herbs! (AAAHHH!)\nSmokin', drinkin', all on the curb (Whooo!)\nChristmas trees, leany B's, all types of ?\nMeds, hydro, even ?mint green?\nShiiiit, I don't rap for weed! (Hahaha!)\nFreestyles, hooks - whatever you need (Whatever, dog)\nCome to my house we can go to the G-room\nTake some shrooms, and look up at the moon! (AAAHHH!)\nKick off your shoes, relax your feet\nWhile I roll some herb and roll up a fat sweet\nCookies and brownies, whatever you wanna eat\nCause you know Bizarre, he be lovin' some sweets!\nI smoke so much weed, my pee is green! (Eeeewww!)\nNext week, it'd be all clean!\nBizarre's in the back, 84 'Lac\nPoppin' some pills listenin' to Fleetwood Mac!\n\n[Hook 2x: King Gordy]\nYes, I wanna get high! (Get high)\nAnd listen to music! (Listen to music)\nSome of that good old hip-hop! (Hip-hop)\nStraight ghetto music! (Ghetto music)\n\n[Swifty McVay]\nHA! I'm from Detroit, bitch, where nothin' is splendid\nI'm with niggas that light up trees like the month of December\nI'm in the kitchen smilin', cookin' brownies, drownin' Long Island\nAllow me to finish this off with a Valium\nNow we, physical zombies gettin' in touch with hip hop\nAnd R&B, laughin' at shit around me (Yeah, niggas!)\nYou overstep your boundaries, I ain't slappin' your hand\nYou tryna snatch my gan, I'm in casinos slangin' Vicodin\nCloudy, what can you say to niggas that sniff?\nMore dust than Saudi Arabia and I get rowdy\nI'll be smoky as a kettle black\nIf you ain't Clinton, then you inhalin' that!\nSo I'mma force you to smoke hella crack!\n\n[Hook 2x: King Gordy]\nYes, I wanna get high! (Get high)\nAnd listen to music! (Listen to music)\nSome of that good old hip-hop! (Hip-hop)\nStraight ghetto music! (Ghetto music)\n\n[Stic.man]\nI love to see the homies cliqued up, fist up\nKhakis on sag, bandanna, rags twist up\nHood pry, unified, G's up, ride or die\nLivin' by the code of the street, an eye for a eye\nGraffiti on the wall, ghetto life\nHomies hangin' at the pool hall, out on the block, shootin' dice\nEvery set of push ups is for my locked up comrads\nAnd for the ones we lost during combat\nPourin' out Cogniac on the concrete\nWhere the junkies sleep, little kids runnin' the street\nMy life is full of pain, but it's positive, still\nNow that I'm hip to the game, I'm harder to kill\nGhetto waterfalls comin' from the hydros, watch out for the cars, lil homie!\nYou the cards, lil' homie!\n...Yes, you are, lil' homie!\n...We all stars, lil' homie!\n\n[Hook 2x: King Gordy]\nYes, I wanna get high! (Get high)\nAnd listen to music! (Listen to music)\nSome of that good old hip-hop! (Hip-hop)\nStraight ghetto music! (Ghetto music)\n\n[King Gordy]\nSome of them old Jay-Z!\nOr higher blaze! (Yes!)\nSam Cooke! Some Al Green, Anita Baker\nGive me a pound of that"}], "artist": "Bizarre"}