{"artist": "Problem", "songs": [{"album": "Famous Again", "title": "Like Whaaat (Remix)", "image": "https://images.genius.com/2e82a1615513208f3c7954e22259b877.600x600x1.jpg", "lyrics": "[Intro: Problem]\nNo Limit forever\nDiamond Lane, Master P in this motherfucker\n(League of Starz)\nProblem, it's 'bout to be a motherfuckin' problem\n(Sorry Jaynari)\nFrom my hood to your hood\nMy lil niggas 'bout to wild out\nHow you do that there?\nNigga, we don't care\n\n[Verse 1: Problem]\nWho that, talkin' 'bout, who that?\nRun up on me? You get your ass beat blue black\nGo on get nerve, I'm off the curb\nPush mountains of herb, you niggas already heard\nThe bro Berg keep a pistol grip pump on his lap at all times\nWherever, however, 'cause young niggas stay tryin'\nSee 'em and be like, “Huh, nigga, what?”\n“Huh? Give a fuck like what?”\nUh, hell yeah, this the remix, these bitches comin' harder than cement\nThe kind that put the blow to they nose, no Kleenex\nShinin' like the sun, no Phoenix\nDiamond Lane gang, wear it big, no 3X free Miller\nYou gangbangin' foolie chucker\nMore niggas still good on the block, Timmy Duncan\nKnockin' niggas out they style like a fuckin' 50 dumpin'\nLabels can’t advance me, that Cali nigga that got Diddy dancin' (ha)\n\n[Chorus: Problem]\nYeah, I'm just doin' my thang\nFingers in the sky\nBang- bang- banging my gang like ooh\nGo on fall back\n'Cause you don't want no problems like that\n'Cause we gon' be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like\n\n[Verse 2: Wiz Khalifa]\nHahaha, uh, what’s smackin'?\n30, under 30, I'm a young rich black man\nOoh, what’s happenin'?\nNo, it ain't Taylor, less my hands is in\nGrands I'ma spend, grams put them in\nSeen that Bombay, ran from the gin\nStayin' low key, still they know me\nSmokin' OG, and I blow it by the O-Z\nWe faded, hoe, please\nI'm gettin' stupid high, me and P-R-O-B\nMy J’s super old, Rick Owens, no sleeves\nWe at the after-party, you can bring your own weed\nAnd we gon’ take shots until someone has to drive us home\nCome from a place where they do tote that chrome\nSmile on they face, but ain't nothin' a game\nStackin' that paper, don’t get in their way or rat-tat-tat\n\n[Chorus: Problem]\nYeah, I'm just doin' my thang (hahaha)\nFingers in the sky\nBang- bang- banging my gang like ooh\nGo on fall back\n'Cause you don't want no problems like that\n'Cause we gon' be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like\n\n[Verse 3: Chris Brown]\nLook, okay, it’s OHB so nigga, bag bag\nI got an ounce of that bounce in a Glad bag\nMolly fuckin' up my liver, got a bad back\nAnd if you tryna fuck with her, I'ma tax that\nAss all on the floor, I'm tryna pour it up, bitch\nLean on my dick, so slow it up, bitch\nAnd the police tryna pull up on the scene\nThen they ask you what you seen? I ain't seen shit\nA hundred niggas right behind me that’s the drum line\nAll you hear is, \"Blat, blat,\" hit it one time\nFuck a punch line, nigga, had bread since the lunch line\nI can put them soldiers on the front line\nOpen season, just nigga give me the reason to bust\nAnd just let it squeeze and my rope-a-dope is the meanest\nI box you up in the freezer, comatose, paraplegic\nI'm dodgin' the misdemeanors hopin' I don’t get subpoenas but I\n\n[Chorus: Problem]\nYeah, I'm just doin' my thang\nFingers in the sky\nBang- bang- banging my gang like ooh\nGo on fall back\n'Cause you don't want no problems like that\n'Cause we gon' be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like\n\n[Verse 4: Tyga]\n(Ha!) Huh, bangin' out the truck\nI'm T-Raww, bitch, gon' let a nigga fuck\nHuh, bitch, you heard what I said\nYour bitch is a bird, but I don’t give her bread\nWhat? Problem pass the weed\nThese niggas claim they ballin', then why they clothes free?\nThese motherfuckers cheap like a nosebleed seat\nYou ain't gotta go to Miami, bitch, to feel the heat (woo!)\nLA, burner to your belly\nMy niggas OGs, keep the burner in the telly\nGettin' head 'til it ache, that’s a motherfucking headache\nDo this shit tonight, send it straight to felly felly\nNigga, why? I'm selling dreams, the money team\nNiggas spend crack but they ain't got no fiends\nGot the juice and the cream, Wu-Tang, Rakim\nI'm a motherfuckin', money machine, nigga\n\n[Chorus: Problem]\nYeah, I'm just doin' my thang\nFingers in the sky\nBang- bang- banging my gang like ooh\nGo on fall back\n\n[Interlude: Master P]\nHow ya do that there? (whaaat)\n\n[Verse 5: Master P]\nMe and Problem gettin' paid\nBut don’t fuck with you broke hoes, niggas, or you haters\nMan D. Howard with the motherfuckin' Lakers\nI represent the street, No Limit is the label\nThrow your hoods up, motherfucker, where you from?\nWe in this bitch deep and it can get dumb\nNiggas in the back, motherfucker, poppin' bottles\nChasin' bad bitches and them niggas throwin' dollars\nLouis V down from my head to my toes\nC-Murder in the pen, and that iron gettin' swole\nNever gave a fuck ’bout no niggas wanna hate\nKeep the chopper in the car, 'case a nigga wanna play\nShe showed me the titties, I call them bitches Dhali\nI know she a freak, 'cause she gone off molly\nPushin' 160 when I'm ridin' in the Ghost\nYou ain't from 'round here, nigga, better walk slow, or get smoked", "year": "2013-07-10"}]}