{"artist": "V-Nasty", "songs": [{"title": "Murder", "year": "2011-04-07", "lyrics": "[Intro]\nIts the murderer, its the murderer\nIts the murderer, its the murderer\n\n[Verse 1: V-Nasty]\nJust got some stacks, got the pistol in the backpack\nOne in my hand, leave a nigga with no get-back\nI'm on some solid shit, what you niggas callin' it?]\n[?] that you niggas [?] it\nYou know me and my real niggas show off, we ball off\nLate night creepin' in the rental, tinted windows\n\nGot bitches sayin' suspects didn't know, leave no witness though\nBad bitches say', \"V-Nasty you a all star!\"\nI'm kilin' bitches, come back in a new car\nThey shot up at my whip but it didn't get 'em far\nI'm aimin' at bodies, bitch, I don't shoot at cars!\n\n[Verse 2: Kreayshawn]\nCome back on the murder game, Kreayshawn has a thang\nWell, that's a big thang\n[?] really make a bitch sang\nWe can [?} if you buy a [?]\nGot your bitch ride, whole [?} grown out\n187 on a ho is what I'm talkin' 'bout\n\n[?] poppin' off the couch\nShe don't believe what we always talkin' bout\nRun out, talk shit get pushed back\nWhite girls got clips like we in Baghdad\nWe active, a real savage\n\nA murder charge? We ain't havin' it\nWe [?] the passport\nWe ain't scared of a bitch, passin' Newports\nI smoke it slow man, [?] the bro man\nI pull my pistol out, and let the trigger pull man\n\n[Verse 3: V-Nasty]\nWoke up in the middle of the night on some freaky shit\nBusters callin' me askin' why I'm never speakin [?]\n[?] ask me why I knocked them down\nFiled a missin' report, but bruh was never found\n\nHad to chop his body up, in the river he drowned\nI'm on some psycho shit, kill a bitch [?]\nLeave no evidence, no fingerprints\n187 homicide coming close to where you sleep at\nYeah these voices ain't let me get my sleep back\n\n3 AM outside in the mornin'\nCreepin' through your window while its rainin' pourin'\nGot these  keys to my whip and my whip game far\nHaters actin' like they adore me, but fake bitches on that type of shit [?] me\nCome through the front door, break your whole family\nNiggas talkin' shit but you knew you was my enemy", "album": "Don’t Bite Just Taste", "image": "https://images.rapgenius.com/0b35affcc29f58beb30c35e5f0b2908f.500x500x1.jpg"}]}