{"songs": [{"year": "1999-10-26", "title": "25 Ta Life", "image": "https://images.genius.com/9841a200e7b94485d7e2a91b3dbd2520.700x700x1.jpg", "lyrics": "Peace\nHere to explain to you 25 to life\nIt's not no criminal shit\nBut then again it is\nIt's some lyrical shit\nFrom the abyss\n\n[ VERSE 1: Saafir ]\nWhat else am I to do, I'm not seein no more\nRevenue, I try to detach myself from life\nSo catastrophies never grace my path\nI couldn't never play (what?) the part, so I started\nWith heartmarkers never mark me\nI never crossed the Parker's Brothers path\nThe absent minded applicant denied\nSee, these rhymes are designed to stretch the skin\nAnticipation of the Junction\nJerkin your ass into a ??? worker answer to fly by night\nVision emulates precision\nA trait for greatness related to liquidation of the character\nWhen animation consumes your whole conversation like vapor\nI'mma mangle that ass like a acre, I'm a get-paider\nYou're on my land, my ancestor's mindstate\nMake platinum in the ears of a large resident\nI be in charge of the canibal's canabis\nWhere hot shit, ain't no fannin this, when I write it's 25 to life\n\n(For every rhyme I write it's 25 to life) --] Havoc\n\n[ Saafir ]\n25 to life\nIt's a mindstate, straight up and down\nStay hard\nIn your foundation keep mobbin\nYouknowmsayin?\nDon't slip like these gased at paid niggas\n\n[ VERSE 2: Mahasin ]\nI get a strike every time I touch the mic\nMarks got a bounty on my head from scripts read\nMahasin lyric assassin leave yo ass for dead\nYou have no stamina, amateur\nAnd don't know my caliber\nI make the party say ho at the show\nFrom the verbal calico with nuff ammo\nQuick to clown these tricks and these broads\nCause they rhymes ain't hard\nWack MC walk away scarred\nCause they didn't know what they was in fo'\nDidn't have the proper info\nI'm an underground soldier savage on the rhyme\nAnd I'm goin for mine, can't knock it\nDare not try to stop it\nCan't get with the sick shit that I spit\nI ain't yo punk bitch\nYou have no stash, so how can you profit?\nRob you of your props, run, get the cops\nBut I'll disappear into thin air\nMake your life a misdemeanor\nKnow what I mean, huh?\nCrime scene clean smooth getaway\n\n[ Saafir ]\nYouknowmsayin?\nNon-detectable\nCan't be seen\nBut we the usual suspectuals\nYaknawmsayin?\nYou can find us\nAll you gotta do is look baby\nPeep\n\n[ VERSE 3: Saafir ]\nMentally I'm here, Saafir is focused like Minolta\nYoko Ono couldn't sow no linen like this\nI'm on the john shittin these writtens\nLickin my fingers like a banker\nSwingin it like a shanker\nPaint a picture like a Van Gogh\nFlow faster than a locomotive\nI bounced a ho as sho' as holdin my balls like boulders\nBustin shots through the holster\nA quarter century\nTo life means describin the lyrical pimp in me (bitch)\nWhen I write for the likes of criminals at night\nStriking through the night for life\n\nJunction riders\nPuttin it down\nH.J.'s\nDeflectin these hate rays\nKnowmsayin?\nFrom '98 to whatever\nThat's how it goes down\nWest Oakland solider\nBiatch", "album": "The Hit List"}], "artist": "Saafir"}