{"songs": [{"year": "2013-09-22", "image": "https://images.genius.com/92957c678b79fcd30629317a1c4b852f.1000x1000x1.jpg", "title": "Dismal", "album": "No Poison No Paradise", "lyrics": "[Verse 1: Black Milk]\nHold up\nHow you go from bein' on to havin' no riches?\nHoes all in your phone to havin' no bitches\nUsed to be highroller, now look how you sittin'\nThinkin' that your life is over, out here tryin' to make a living\nTold my conscience \"Shut the fuck up!\", tryin' to get it together\nPut my hands on my face, can't look myself in the mirror\nI swore to God, I said I'd never go back bein' broke\nFeelin' like I'm back at square one, fuck a nigga bein' po'\nGuess he didn't answer your prayers or help your affairs\nNow that no one cares, what's the point of bein' here?\nYeah yeah,  you had it all, hit a broad all night\nNow shit is comin' full circle, didn't play your cards right\n\n[Hook: Black Milk]\nTrip\nA'yo, a'yo, hey, uh, right there\nLay low, a'yo, uh, right there\nThere they go\nA'yo, lay low, right there\nA'yo, hey, a'yo, right there\nLay low, a'yo, hey, right there\nRight right\n\n[Verse 2: Black Milk]\nNow you askin' \"Was it worth it?\", since your fame did surface\nNow you see your purpose, didn't turn out picture-perfect\nThousand-dollar purchase, guap all in your pockets\nUsed to be on top but now they sayin' you ain't got it\nSo a'ight then, watch me get it even if they goin' to knock it\nDollar out of fifteen cents, I turn my shit into a profit\nPut myself in a hole, money, it got me stressin'\nFrontin' to force a smile while tryin' to battle depression\nNigga, you lost your grip up, nigga, you 'bout to slip up\nGrab that bottle of liquor, pour cup, pour cup, then sip up\nHopin' the story ends, hope a new one begins\nLeavin' from where I been, wake up out the sleep I'm in\nHuh\n\n[Hook]\n\n[Outro: Black Milk]\nFor my niggas, and my bitches\nOn they hustle, tryin' to get it\nWhen you think you know big dough, then what is it for?\nYeah they talkin' mash, woah, what I'm in it for?\nYeah, yeah, yeah\nThey on that, we on that\nRight now"}], "artist": "Black Milk"}