{"artist": "E-40", "songs": [{"title": "Blessed By the Game", "image": "https://images.genius.com/75964a69add920b848c42ae823acd72f.500x500x1.jpg", "album": "The D-Boy Diary: Book 1", "year": "2016-11-18", "lyrics": "[Verse 1]\nIt’s a game of cat-and-mouse in the Bay\nEverybody know where everybody stay\nSomebody didn’t make it to the house\nSomebody got shot in they mouth\nGotta keep you a thumper, on the tuck, on the under\nCan’t be shinin’ too flossy, they’ll turn you into a body\nCan’t be stuntin’ too often, they’ll turn your car to a coffin\nHave you coughin’ up blood while you was smokin’ your bud\nAnd sippin’ your barre, or should I say lean\nHim and his hoe, now it’s a crime scene\nI’m a master of reality\nRap about good times and casualties…UH!\n\n[Chorus 2X]\nFrom the bottom, and I ain’t ever changed\nFrom broke to having my change, mayne\nGet up and get it, don’t always place blame\nI’ve been blessed by the game\n\n[Verse 2]\nThis morning, the Lord tapped on my head\nSaid ‘If it wasn’t for me, you would be dead’\nGot up out my bed, got on my knees and thanked Him\nI was hecka scared, it was cloudy and rainy\nWhen it come to communication, you gotta be smart\nPut your pride to the side and have a heart-to-heart\nWith your family and folks, your friends and your foes\nLife can be short or taller than a stripper pole\nI’mma get my shit together, bruh, I promise, I betcha\nI’m slappin’ E-40, don’t shoot the messenger\nPack a Mac or a 40 just in case they test ya\nWatch out for the Porky, pigs, they arrest ya\nSome crooked, corrupted, attitude like ‘fuck it’\nSome do they job and care about the public\nI’m a master of reality\nRap about good times and casualties…BIATCH!\n\n[Chorus]\n\n[Verse 3]\nTechniques and tactics, mammoth mathematics\nRunnin’ through paper like it’s a laxative\nSince I toddler valued a dollar, ya hear me?\nI’m the same the dude, I ain’t an impostor, ya feel me?\nWhen you get on your feet, don’t forget your peeps\n‘Cause they the ones that hold a nigga down in the streets\nWhen it’s all said and done my testimony ain’t gon’ be phony\nSometimes I lose count on how many people owe me money\nForget about it, hustla, just love ‘em and keep it pushin’\nNever know when you gon’ need a brother, we hoodlum\nBoss, not a sucker, I love my loved ones, we folks\nMy bloods and my cousins grew up together, so dope\n\n[Chorus]"}]}