{"artist": "Apathy", "songs": [{"title": "Compatible", "image": "https://images.genius.com/4713c4caaa1cd36b71f2e76c60c7b8b5.600x600x1.jpg", "album": "It’s the Bootleg Muthafuckas! Vol. 1", "lyrics": "[Sample]\n\"It's the first of The Demigodz series\"\n\n[Intro: Apathy]\n(Yeah) Yo, This is The Demigodz. (Uh) Apathy. Open Mic. (Yea) Metropolis. Celph Titled. (Uh) One Two. Rise. (Yea) Yaggfu Front. (Yea) Mr. Mayday. (Uh) Unpaid Bill. 181 (Yea) and Jabberjaw. (Yo) We 'bout to show you how the raw shit go (Yo!)\n\n[Verse 1: Apathy]\nNone can match the accuracy of Apathy, my brain thinks rapidly\nAutomatically adaptin' when competition is tappin' in my Mainframe, bitin' my styles like downloadin' files\nBut I react with raps when suckas hack, y'all can get the scrotum\nI manifest the cybernetic explosion to overload your modem\nWhen I decode 'em and break their cryptic, simplistic firewalls\nI assault with fireballs through fiber-optic lines and flyin'\nWith rhymes in cyberspace, my face prints across the screen\nGlow bright-green, digitizin' a fight scene\nIn actual reality, I'm sittin' in my basement\nIn virtual reality, I'm fightin' Matrix agents\nOn planet Earth, I control your mind when I say shit\nIn cyberspace, I control computers 'cause they're basic\nBinary code talks with tons of zeroes and ones\nBut this hero's begun to master their tongues\nSo I'm speakin' to your Pentium, beyond the new millennium\nSo ready 'em for greater forms of data when I enter them\n\n[Hook: Apathy]\nDigital, physical, spiritual, or mathematical\nYou motherfuckers better be Apathy compatible\nDigital, physical, spiritual, or mathematical\nYou motherfuckers better be Apathy compatible\nDigital, physical, spiritual, or mathematical\nYou motherfuckers better be...\n\n[Verse 2: Celph Titled]\nAlias: Max Fabulous, my tongue attacks hazardous\nQuantum leap continuously through time passages\nI pull you right out the truck by your earlobe\nAnd throw you off the roof and still be considered your hero\nI'm hungry for the dinero, don't make me see you\nVice grip your torso and squeeze you 'til you're see-through\nMy fam is wild, even my grandmoms'll snuff you\nAnd yoke you up in a tussle and beat you with a belt buckle\nI make Master P-ieces with enough Silkk to Shock shit\nYou can C-Murder, No Limitations when my Glock spit\nI get goosebumps after givin' niggas two lumps\nStraight up fuck your shorty and leave that bitch with a loose cunt!\nCelph Titled, the man with razor sharp talents\nAnd accurate, authentic techniques to leave you off balance\nWith raw talent, my rhymes will shatter through your physical\nRepeat my voice in digital, sync-mode residual\nThe Rubix Cuban, sell out in every vinyl store\nDon't make me lift your skull and have to whip you with your spinal chord\nMy skills will keep your ears open... like a Vulcan\nAnd put you out of work like Chevy Chase and Macaulay Culkin\n\n[Hook: Celph Titled]\nDigital, physical, spiritual, or mathematical\nYou motherfuckers have better be Celph compatible\nDigital, physical, spiritual, or mathematical\nYou motherfuckers have better be...\n\n[Verse 3: Apathy]\nJust give me a chance to explain, I'm enhanced in the brain\nHip hop MC, b-boy stance ingrained\nIn my neural fabric, fuck internet static\nMy status is static free, now imagine me\nSweatin' what they say about the A-P, I never let it faze me\n'Cause y'all are soft as Teletubbies and Beanie Babies\nFor emcees I kill, French 40s are poured\nBut you can still never see me like Geordi LaForge\nGot your shorty in a Ford Explorer to explore her\nGive her foreplay, make her beg for more and ignore her\nI store a backup disk of every diss\nScroll down a long list, click to inflict\nHard drive flickers while it figures out the route\nComputating the data that could be phatter then lets it out of my mouth\nIn every rhyme bout, I'm victorious (I'm victorious)\n'Cause I train with the brain, jumping jacks with raps laborious\nWork like a wrestler... I'm rippin' through the shirt\nBody slam your mind in the dirt, suckers get hurt, jerk\n\n[Hook: Apathy and Celph Titled]\nDigital, physical, spiritual, or mathematical\nYou motherfuckers better be Demigod compatible\nDigital, physical, spiritual, or mathematical\nYou motherfuckers better be Demigod compatible\nDigital, physical, spiritual, or mathematical\nYou motherfuckers better be Demigod compatible\n\n[Outro: Celph Titled and Apathy]\nExxon Valdez type steez\nDemigodz baby\nGet your tools at Chrome Depot\nNo questions\nStay on the D-Low, son\nMonkey wrench in your whole productions\nFor real, for real\nY'all suckas\nCelph Titled, the Rubik's Cuban. Apathy. Demigodz\nYo, yo, uh, uh, uh\nYou don't want it\nBring it on like that, uh\nFuck that\nUh, uh, uh, uh, uh, bring it on like that\n\n[Apathy]\nYo, y'all suckas tryna bite the name... yo, fuck that, man! Y'all better watch out we'll fuckin' throw \"Roots Beers in Your Fridge\", son!  We ain't fuckin' around with y'all, man. Y'all tryna be fuckin' soft on tracks or somethin' like that? Nah man, Demigodz is comin' for heads, no matter how y'all do. So fuck y'all, straight up!", "year": null}]}