{"artist": "Big Ed", "songs": [{"lyrics": "Master P(O'Dell):\nYa know what(I miss you)\nIts' like, uh?  How many times(I really miss my homies)\nWe must go through this how many records we gotta make like this\n(I miss you) but ya know what?\nIt seem like uh?  It's a never ending game\nAll right P(I miss you) to all the fallen soldiers out there\n(I'm prayin for you homies)\nAnd Big Ed, people, Cory Green(I miss you) rest in peace\n\nBig Ed:\nI'm fightin tears back, the lord knows it hurts\nAll my family dressed in black, cause a love one rising to ???\nReminising on good times, some bad times too\nBut i gotta keep on smiling cause he would want me to\nBut it's hard to accept this loss\nIt's drivin me crazy, see my aunty suffer the death of her only male baby\n(Be strong)\nI'm at your funeral strapped, ready to kill\nI look in the eyes of my new born and they told me to chill\nI will always keep you with me\nCory can ya hear me\nI feel cheated but to cope I keep, pourin out henney\nYour youngest sister took it the hardest\nCouldn't let go of your casket\nBegging you to come back, times are gettin so drastic\nI spoke at your funeral and broke all to peaces\nTears overflow from friends, nephews and nieces\nYour girlfriends is pregnant, so you left your mark\nAnd to al our memories I'll keep them close at heart\n\nO'Dell:(x2)\nI miss you\nI really miss my homies\nI miss you\n\nMac:\nI remember we used to sit in class\nWe was either yappin bout rappin or lookin at some ass\nTalkin bout one day we was going to make it in this rap game\nLike normal teens we was young, black and broke\nSo all we had was dreams\nYou got a record deal and that's when everything changed\nYou started, hanging with the wrong niggas and thangs\nI wasn't trippin when you saw me, I still smoke and say wooo\nIt's funny how you never really get a chance to say good bye\nCause you never know when they gone go\nWe was suppose to do ???\nBut I remember your last night\nSome nigga told me Mac your boy, daddy all gone and I said ya right\nNext day it was official(official), give me some tissue\nI'm a G, but still I miss you\nMay God be with you\n\nO'Dell:\nI know it's a dream but I wish you could come back to me,homey(my homey)\nBut your long gone away, so I'm missin you\nI miss you\nI really miss my homies\nI miss you\nI miss you\nI'm prayin for you homey\nI miss you\n(I miss you)I miss you\n(I miss you)I really miss my homies\n(I miss you)I miss you\n(I miss you)(ohh ohh)\nI miss you(ohh ohh)\nI'm prayin for you homies(ohh ohh ohh)\nI miss you(ohh ohh)\n(Ohh ohh ohh)", "image": "https://images.genius.com/d1645663d13224ddd74a3441afd4c58c.772x768x1.jpg", "year": null, "title": "I Miss ’Em", "album": "The Assassin"}]}