{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/e36cca6877052650fd9e8a2ea1392989.220x220x1.jpg", "title": "Bank", "year": "2015-12-25", "album": "Summer In The Winter", "lyrics": "[Hook]\nI bring in the cash on a fuckin' crane\nI lost count again, who's to fuckin' blame?\nCount that shit\nI just blew a crib on a fuckin' chain\nI do what I want, I'm the fuckin' bank\nI bring in the cash on a fuckin' crane\nI lost count again (flip that shit)\nI just fucked two girls on a fuckin' plane\nI do what I want, I'm the fuckin' bank\nI'm the fuckin' bank\n(I do what I want) I'm the fuckin' bank\nTell your bitch to hurry with my fuckin' change\nI do what I want, I'm the fuckin' bank (okay)\n\n[Verse 1]\nI do what I want, I'm the fuckin' bank\nWatch me run it up, baby you can chase\nI sell water to a whale then take that shit to Wells\nTeller, what's the balance? She say that you're doin' well\nWell, well, doin' well, 'member back when we was broke?\nNo, no, I must add the mention, niggas gettin' old\nOh, oh, niggas hit me up like I'm the ATM\nAnd I check my bank account more than you check your Instagram\nGrams on top of grams on top of grams of all this fuckin' dank\nJump in, dive in, swim into the money, walk me to the plank\nSince a youngin' I've been tryna eat, show me where the plate\nI'm just tryna eat, let me say my grace\n\n[Hook]\nI bring in the cash on a fuckin' crane\nI lost count again, who's to fuckin' blame?\nCount that shit\nI just blew a crib on a fuckin' chain\nI do what I want, I'm the fuckin' bank\nI bring in the cash on a fuckin' crane\nI lost count again, flip that shit\nI just fucked two girls on a fuckin' plane\nI do what I want, I'm the fuckin' bank\nI'm the fuckin' bank\nI'm the fuckin' bank\nTell your bitch to hurry with my fuckin' change\nI do what I want, I'm the fuckin' bank\n\n[Verse 2]\nI do what I want, act an ass in this bitch\nI done lost count again, seen the ass on my chick\nAll these bitches here, nobody even asked for the address\nCountin' all this dirty money got my house in a mess\nMessage after message, pretty clear just check your texts\nI still know niggas with kis that's givin' out piano lessons\nSaid that's some shit you ain't know, your party I will rain on\nWatch it disappear, I make it come right back, shit David Blaine, oh\nWhip it, horseback ridin' in the 'Rari\nI'm Usain runnin' through my city for coins like Mario\nEvery time I party at the crib, it's like Mardi Gras\nBaby throw that money maker, I'm just tryna withdraw\n\n[Hook]\nI bring in the cash on a fuckin' crane\nI lost count again, who's to fuckin' blame?\nCount that shit\nI just blew a crib on a fuckin' chain\nI do what I want, I'm the fuckin' bank\nI bring in the cash on a fuckin' crane\nI lost count again, flip that shit\nI just fucked two girls on a fuckin' plane\nI do what I want, I'm the fuckin' bank\nI'm the fuckin' bank\nI'm the fuckin' bank\nTell your bitch to hurry with my fuckin' change\nI do what I want, I'm the fuckin' bank"}]}