{"artist": "Andy Mineo", "songs": [{"title": "Shut ’Em Down", "album": "Saturday Morning Car-Tunez", "year": "2011-06-28", "image": "https://images.genius.com/2f9cf695968b74ddbacf05e3de6499c3.300x300x1.jpg", "lyrics": "[Verse 1: Andy Mineo]\nI'm from the 'Cuse but I live in N.Y. to that third letter\nPlus I work words with a purpose I serve rhetoric\nAnd Jesus took a degenerate herd\nLet 'em in his presence by his blood\nAnd I don't deserve the benefit\nYou can't move my team like we elephants\nShorties can't remove my jeans, I'm being celibate\nTil I find a wife then we get it, get it\nBut I ain't no friend with the benefits 'less I'm committed, get it?\nThere they go again calling me Eminem\nThey talking who's better than\nCus I don't got melanin\nI ain't the Christian version of nothing\nNor am I the second coming of someone\nI am the first... Me\nThis ain't no scheme to be relevant\nI just represent for the Messiah while rocking my fly pelicans\nBreaks told me never arrive\nI'm getting better with the pen\nThey like \"Who the best, dead or alive?\"\nWell, my God was dead and alive\nHe's coming back again\nWhen he cracks the sky, you ready to fly?\nYou gonna answer for the things that I'm asking\nThat's why I'm aiming high like Yao Ming's assassin\nBang!\n\n[Hook (samples)]\n\n[Bridge: Co Campbell]\nThere I go, There I go\nGone in the blink of an eye\nCause you're just another star in the sky\nWe're dyin, dyin dyin\nSayin goodbye, and bye, and bye\nTil the day that I'm gone, I'm gettin my own\nTake me Hiiiigh\n\n[Verse 2: Andy Mineo]\nStep up on the microphone now everybody upset\nCus they know what I'm about\nAnd what's gonna be the subject\nI'm just gettin started\nI ain't even had my lunch yet\nI'm hungry and I ain't tryna blow like a trumpet\nBut this life ain't about me\nI'm thinking so much bigger\nMy life would be so wasted if I put me in the center\nThey wanna stack the paper well I wanna stack it also\nBut I really don't wanna stack it for the reason that you thought so\nGet a big car, with a big crib, No\nIf I make a killin stacking millions to the ceiling\nDo you know how many children we can feed up in them villages?\nSee money by itself isn't evil\nWhat really is being the heart of people\nSo tell me is the visual skewed\nOr is it just the lense that you see through\nWhatever I'm given I'm grateful\nWith a lot or a little, just wanna be faithful\nPraise due to the most high\nKnow why he took a poor blind pitiful fool, made him a whole guy\nWas a slave to my sin and it stopped, change dropped\nPlanted churches uptown then now we open up shop"}]}