{"songs": [{"image": "https://images.genius.com/6e672c139a6e77928ac847b6c6f61258.422x421x1.jpg", "title": "Watch Over Me", "album": "Exclusive Audio Footage", "year": null, "lyrics": "[Verse 1: Pusha T]\nLord, I've seen em comin\nPlease don't take my breath away from me while I'm runnin\nThey got me jumpin, from these slugs that they gunnin\nSimple and plain, it ain't a game no more, they headhuntin\nListen, Lord, I'm scared, fearin for dead\nI'm racin with these hollow points which slip past my head\nWho ever said that life's easy? Come teach me Lord\nCause it's the only way for you to reach me\nSo - many - nights - I've - cried\nSo - many - times - I've - lied\nSo - many - of mine - have died\nBut I - still keep you - inside\nLord, help me get away, give me some wings\nSo I can fly away, please don't let my family cry today\nNo longer am I choosin the wrong over the right away\nAnything you say, just show me a brighter day, huh?\n\n[Hook] X2\nMy eyes are so scarred\nBlind, so I go hard\nNo matter the robbery\nI hope he watches over me\n\n[Verse 2 Malice]\nLord, I never asked you for none of this\nNow I'm contemplatin' suicide, how it come to this?\nLord, please explain what we livin in\nHow I know right from wrong but still choose livin in sin\nLord, if this a test, can you tell me that\nWill I pass or at the end will I feel your wrath?\nI try to do right but the wrong always held me back\nMy moms tell me this but the flack tell me that\nLord, listen, I know you see the way we act up\nWith no remorse for the cats who got clapped up\nI told them once, turned around, even told them twice\nTried to let em live but by the third it was nothin nice\nLord, is there a clue that you can send me\nTo help me out just so that you don't condemn me?\nWhat would you have done had you would've been me\nHow was I to know money bred envy? Uh\n\n[Hook] X2\n\n[Verse 3: Malice]\nLord, how do I live in a world that is so insane?\nWith little joy but there's double pain\nI know you gonna see everything that's on my brain\nAnd I don't make the rules, I only play the game\nAnd I'ma win, lying, cheating or stealing\nIf robbing means that I'm eating, I will\nIf I gotta live this life then I'm packin a steel\nSurvival of the fittest and I go for the kill\n\n[Verse 4: Pusha T]\nUh, Lord, if you want then I will listen in\nTemptation is a bitch, diamonds be glistenin\nIt's like the Devil be comin up and kissin men\nHad Terrar out there hustling, missling\nWhen I speak, you don't always respond back\nRight now, you got me waiting on the call back\nLord, I beg that you don't ever let me fall back\nRegardless what I do, you know where my heart's at right?\n\n[Hook] X2"}], "artist": "Clipse"}