{"artist": "Preme", "songs": [{"album": "Dear America", "title": "In This Cup / Cry For You", "image": "https://images.genius.com/228f06b6beee88a4c4c3a7b063ae1044.500x500x1.jpg", "lyrics": "[Part I: In This Cup]\n\n[Hook: P Reign]\nHow did I get here?\nI should be home by now\nEach time you pull me back\nYou seem to pull me down\nWhat the fuck is in this cup?\nHow did I drink so much?\nI can't remember a thing\nTell me how's been your man?\nBaby where are you from?\nWhat the fuck is in this cup?\n\n[Verse 1: P Reign]\nI blame her body'\nWho she's been tanning four months, she's a fucking hottie\nWe got a couple dozen bitches, waiting in the lobby\nAnd half my niggas on the run, but it's still a party\nGo head, go head, show up, pour up\nRoll up, blow up, light up\nAnd I bet I fuck the night away\nBefore you fuck our night up\nAnd I'm sorry if the sparkles on them bottles don't excite us\nBut we been getting money before OJ picked that knife up\nJust shot a baby, don't chase it\nIf you was were I'm at, you'd be wasted\nJust met a white girl that looked Asian\nAnd I'm gonna fuck her till she speak Haisian\nBeen up all night with this cognac\nNo sleep, Insomniac\nLet me put this dick where your thong be at\nAnd go spin cycle, laundry mat\nJust me, her, and them sheets\n'Til that pussys' deceased\nGot dimples in her cheeks\nIf she's a beauty, I'm a beast\nSolo, might forget your name by the morning\nDon't be mad at me\nTime for that pretty face to come and face reality\n\n[Hook]\n\n[Verse 2: P Reign]\nI blame it on the vodka\nWell go on fill my cup up\nSay she got a daughter\nWell I'm such a motherfucker\nI got two hoes that been calling\nAnd two hoes in my lobby\nI said who ever make it to the room first gon' get boddied\nI'm a bad boy, bad boy\nI hit that bitch 'til she in tears nigga, sad story\nI hit that raw without a care nigga, call Maury\nShe gave me head right on her knees, she must've fell for me\n(Ha, wassup)Just grab that lipstick out 'cha purse look at that ass in heels\nGo on and flaunt that deadly weapon it's licensed to kill\nWe smoke and talk I say \"What's up with you?\"\nShe said her exes hate me, well shit what else is new?\nI never run from the truth, baby I barely deny\nShe had her heart broken so many times she barely could cry\nI say \"Don't let them steal your heart, never forget how to try\nSometimes you just gotta' thank the Lord you found a good in goodbye,\"\n\n[Hook]\n\n[Part II: Cry for You]\n\n[Verse 1: P Reign]\nBack then she ain't want me\nBut look at now, I'm blowing up\nThought I knew it'd all end\nGuess I ain't really know enough\nRemember I hit it, when  she ain't call back\nWell, guess the ho wasn't all that\nYou really made a nigga fall flat\n(uh)So I figured I should fall back\n(Yeah)Them hoes ain't winnin'\nMatter of fact, them hoes ain't women\nOnly the good girls get a man on one knee\nTo give them the whole world, these hoes don't get it\nI got one heart, but I said let's split it\nBut she broke that heart, please don't kill it\nNever let a good thing go, cause when a good thing's gone\nAll the other good things go with it\nYeah when the tables turn, like you renovating\nHope you feel the burn, like you in bed with Satan\nGot lots to learn, it takes lots of patience\nYou taking turns, like it's an occupation\nGod damn, oh well\nKeep a few bad hoes in the hotel\nLearned a life lesson that I know won't fail\nNever tell hoes, cause you know them hoes tell\nMan, ain't it tough?\nI guess just being light skin ain't enough\nThat's why all the good girls like to get it rough\nAnd word around town is some girls wanna' fuck\nWell get ready for the ride baby girl buckle up\nBut I want more then that\nSo she texting me, and I ain't calling back\nAnd she acting like she bout to have a heart attack\nBut she lucky that even left her heart intact\n\n[Outro]", "year": null}]}