{"artist": "Angel Haze", "songs": [{"title": "Deep Sea Diver", "image": "https://images.genius.com/4890084144da97ab8408130d90ede415.560x558x1.png", "album": "Dirty Gold", "lyrics": "[Intro]\nLa la la, la la la la\n\n[Verse 1]\nRage colored lilies, brave covered in pity\nLights smother this city\nI pray he doesn't forget me, I pray he doesn't forget me\nThat lonely night in November\nWhen we fell into the hands of the coldest day in December\nThen became the product of the trust that we had lost and found\nGot you deep in the emotion just to watch you drown\nAnd I had never left the land’s sand\nCause I was busy building castles for a dead man\nShouldn't have taken my eyes off you\nI shouldn't have straddled the lines crossed too\nAnd now I've been searching but can't find you\nHence me being lost since you're the one I'm entwined to\nSo, is love the picture that we’ve tainted now?\nNo, Am I still with you when I ain't around?\nAm I the subject you tip-toe or walk around?\nAnd if this love is on the ledge I’m trying to talk it down\n\n[Hook]\n(Bring me your love)\nWe were deep sea divers\n(Bring me your love)\nOn another man's planet\n(I need your love)\nAnd I fell for you hard babe\n(Bring me your love)\nBut I never quite landed\n(Bring me your love)\nNow I can't be with you\n(Bring me your love)\nAnd I can't be with you\n(I need your love)\nAnd I screamed for your name and I call for you babe but I can't be with you\n(Bring me your love)\nAnd I can't be with you\n(Bring me your love)\nStill can't forget you\n(I need your love)\nAnd I screamed for your name and I call for you babe but I can't be with you\n(Bring me your love)\nAnd I can't be with you\n(I need your love)\nAnd I can't be with you\n\n[Verse 2]\nSo, instead of sailing I live like a human parachute\nThe more I'm falling the further I am compared to you\nIt's like I'm stuck in the air while you're pale and blue\nChasing clouds and hoping they lead a trail to you\nSee, we were deep sea divers\nAnd I was focused on survival\nAnd death does you part when you're focused on its rival\nDefibrillator love, I'm just focused on revival\nYou could, you could put your hands in mine\nAnd we'll walk through the sand, in the sands of time\nUntil we paint the end of this love scene\nUntil I'm laid to rest in your blood stream\nUntil I hear the strings of your heart playing\nUntil I hear the things you are not saying\nUntil I find out what it really means\nAnd hopefully it's everything it really seems\n\n[Hook]\n\n\n[Bridge]\nBreaking me open again\nOh darling\nChasing what's gone with the wind\nOh no\nI can't be with you\nOh no no\nI can't be with you\nI can't be with you\nOh no no\nI can't be with you\n\n[Hook] 2x", "year": "2013-12-30"}]}