{"artist": "Bas", "songs": [{"lyrics": "[Verse 1: Bas]\nI had a 5 year plan\nBut in 24 months, bitch I got it all done\n24 blunts of the skunk, toast the glass to winners\nDrinking 'til I vomit scallops, I guess that was dinner\nI’m blown, got my shades on\nBut it’s funny right, ‘cause this life\nNever been this bright\nDon’t be foolish, boy, it’s always more to it\nStuck between a rock and a boiling pot\nLead a whole block, leading all for doctors\nWhat you on? I’mma put us on\nI ain't talkin' pebbles when I tell em that I'm stoned\nOh so fade, bitch I’m oh so faded\nShine like my life, gold plated\nHungry like it’s Budapest, Shawty who da best?\nRoll the mook, let me do the rest, yeah\n\n[Pre-Hook]\nRide around on volks, holler at my folks\nGot a lot of smoke, pockets on halitos'\nStinky green, stinky green, let me set the scene\nFlee the scene and my weapon clean, fiend\n\n[Hook]\nThat’s my story and I’m sticking to it\nThat’s my story and I’m sticking to it\nThat’s my story and I’m sticking to it\nThat’s my story and I’m sticking to it\n\n[Verse 2: Bas]\nThis ain’t Amsterdam, but we go Dutch\nTrick, you could pay for your own lunch\nYou clearly have the wrong one\nI mean you clearly must be on one, un uh\nYou wanna see me? lately see me when it’s all done\nSorry hun, it was all fun, um\nLiving out my dreams, I don’t need to sleep\nGoing offroad, I don’t need a Jeep\nI’m a leader, sky beaming, I seen it, had a vision\nPurple drapes, high ceilings, purple haze, high ceilings\nI just keep on getting better, I amaze high ceilings\nI Never cap like the snapple fact, matter fact\nMake em double back, every fuckin' track – cat attack\nHere kitty, catacomb, dead to me\nBreakfast in bed, honeycombs and some head for me\nPut me in a song, what she said to me\nWell alright\n\n[Pre-Hook]\nRide around on volks, holler at my folks\nGot a lot of smoke, pockets on halitos'\nStinky green, sticky green, let me set the scene\nFlee the scene and my weapon clean, fiend\n\n[Hook]\nThat’s my story and I’m sticking to it\nThat’s my story and I’m sticking to it\nThat’s my story and I’m sticking to it\nThat’s my story and I’m sticking to it", "image": "https://images.genius.com/39c68731f53df590ac095e6694ceb1c8.500x500x1.jpg", "year": "2013-05-22", "title": "That’s My Story", "album": "Quarter Water Raised Me Vol. II"}]}