{"songs": [{"title": "Swervin", "album": "Hoodie SZN", "year": "2018-12-21", "image": "https://images.genius.com/557f4ca436aaabc4210bd3850f96b954.1000x1000x1.jpg", "lyrics": "[Intro: A Boogie wit da Hoodie & Skooly]\nUh\nYeah\nOh, that's London On Da Track, run that shit back\nWe got London On Da Track\n\n[Chorus: A Boogie wit da Hoodie]\nSwervin’\nHow you look so perfect on your worst days?\nDouble C your purses, you deserve it\nNiggas in your DM, they be thirsty (Thirsty), and in person\nBut you're curvin'\nCurvy little body, love your surface (Surface)\nYeah, I’m all on your body, make you nervous\nI like the way you keep up with your earnings\nYeah, it's okay, 'cause you swervin'\n\n[Verse 1: A Boogie wit da Hoodie]\nI fuck you from the back and leave you turnin' (Turnin')\nThe type to make you feel like I'm so worth it (Worth it)\nBlame my ex, that bitch, she did me dirty (Did me dirty)\nHad me fall in love and then she curved me\n(on God, swear to God, I don't wanna leave you, no)\nNew Louboutin, you would think I’m bleedin’ from my toes\nDick all inside of you, make you freeze, make you pose\nI want you to get up on your knees and your toes\nI see one of my enemies, they gon' freeze like they cold\nI swear I ain’t no killer, but test me if you want\nYou don't want my adrenaline rushin', leave me alone (Leave me alone)\nSo much shit up on my mind, I can't think, yeah\nAll my niggas rock designer like they scream (Grrat)\nGot the AP covered, diamonds with baguettes, yeah\nI thought everything was right, that’s when you left, yeah\n\n[Chorus: A Boogie wit da Hoodie]\nSwervin' (Swervin')\nHow you look so perfect on your worst days? (Worst days)\nDouble C your purses, you deserve it\nNiggas in your DM, they be thirsty (Thirsty), and in person (Person)\nBut you're curvin'\nCurvy little body, love your surface (Surface)\nYeah, I'm all on your body, make you nervous\nI like the way you keep up with your earnings\nYeah, it's okay, you be swervin'\n\n[Verse 2: 6ix9ine]\nWhere these bitches at? I'm in the V with the tints\nGot the FN on my body and the clip on hollow tips\nNiggas say they gon' rob me and they still ain't do shit\nCatch her waitin' in the lobby, I'ma give her this dick\nMan, where these niggas at? Man, where these niggas at?\nWe gon' pull up big bodies with the Rugers in the back\nI got Rugers and the MAC's, pump leave a nigga flat\nTalkin' hot, we spin the block, we gon' leave him where he at\n\n[Verse 3: A Boogie wit da Hoodie]\nLike, where these niggas at? Ayy, where these niggas at?\nI'ma pull up in the big body with the fuckin' MAC\nIf the opps try to turn my song off, run it back\nUsed to have the pack in my long johns, now I rap\n\n[Verse 4: 6ix9ine]\nIf a nigga wanna act out, got the MAC out\nI ain't got no fuckin' back-up, that's a man down\nI ain't got the fuckin' forty, knock his teeth out\nSpin back with the Ruger, air the block out\n\n[Chorus: A Boogie wit da Hoodie]\nSwervin' (Swervin')\nHow you look so perfect on your worst days? (Worst days)\nDouble C your purses, you deserve it\nNiggas in your DM, they be thirsty (Thirsty), and in person (Person)\nBut you're curvin'\nCurvy little body, love your surface (Surface)\nYeah, I'm all on your body, make you nervous\nI like the way you keep up with your earnings\nYeah, it's okay, 'cause you swervin'\n\n[Outro: A Boogie wit da Hoodie & Skooly]\nThe way that I live my life is amazing\nBack to back big bodies, no more dreams, yeah\nSo much shit up on my mind, I couldn't think, yeah\nAll my niggas rock designer like they scream, yeah\nGot the AP covered, diamonds with baguettes, yeah\nSay my name in your song and it's lit, yeah\nBeen waiting for a nigga like this, yeah\nWe got London On Da Track"}], "artist": "A Boogie Wit da Hoodie"}