{"songs": [{"image": "https://images.genius.com/36133106f6b3e4f69b5248ee3c6a2e47.1000x1000x1.jpg", "lyrics": "[Intro: Ugly God & Wintertime]\nUh\nTell me how you feel\nOoh\nUh\n\n[Chorus: Wintertime]\nTell me how you feel (Uh), tell me how you feel (Ayy)\nTell me how you feel (Okay)‚ tell me how you feel (Alright)\nTell me how you feel (How?)‚ tell me how you feel (Wow)\nTell me how you feel (How?)‚ tell me how you feel\n\n[Verse 1: Wintertime]\nSo how do you feel? (How do you feel?)\nAnd how are you feeling? (How are you feeling?)\nStack up that money, all the way to the ceiling\nYou are a fan, you belong on the ceiling\nTold all the labels that I need a million\nI'ma need back the swag you stole (You stealin')\nI just be counting up‚ chilling\nTen thousand just to get me to walk out the building\nFind me somewhere on an island (Island)\nSmoking on gas, running through mileage\nHigh in the sky like a pilot (Pilot)\nTake out the coupe, ghost ride it (Nyoom)\nI lost the roof can you find it? (Find it)\nYou look at my wrist and you blinded (Blinded)\nPark in the front‚ the engine behind it\nMy life a movie but I don't rewind it\nI'm posted up in the mountains (Mountains)\nThe way that I'm counting I feel like accountants\nI got that water like fountains (Splash)\nI lost my swag, you seem to have found it\nI guess I don't really mind it (Mind it)\nJust remember where you got it (Got it)\nHow you worried about another man pockets?\nLil' nigga, need to stop it (Wow)\n\n[Chorus: Wintertime]\nTell me how you feel (Uh), tell me how you feel (Ayy)\nTell me how you feel (Okay), tell me how you feel (Alright)\nTell me how you feel (How?), tell me how you feel (Wow)\nTell me how you feel (How?), tell me how you feel\n\n[Verse 2: Ugly God]\nSo how do you feel? (How do you feel?)\nAnd how are you doing? (How are you doing?)\nFuck a bitch once then I keep it moving\nGot a new house to switch up the viewing\nWalk in the party, you know that they choosing, drooling\nStaring at me in amusement (Choosing)\nPause, now resume it\nNiggas run off with the sauce, I oughta be suing\nNew bitch and the booty sit right (Sit right)\nAnd I'm on the road, no hitch hike\nWhy do you hate when you know that I'm the shit, right? (Why?)\nNiggas really don't wanna fist fight (Nope)\n32K for the new fit 'cause I spent 30K just to get the wrist right (Gang)\nI rather fuck on the wife of another man\nI want the bands in a bag wrapped in rubber bands\nRich as fuck, on top of that, I'm a colored man\nJs on my feet 'cause I don't fuck with other brands\nGet the bag then I go back to the motherland\nPull out this chopper then you do the running man\nYou think you shitting on me? You a funny man\nCould've went pro and balled out with the Lakers\nDon't fuck with niggas that's not in my nature\nWintertime, all the time, cold like a glacier\n\n[Chorus: Wintertime]\nTell me how you feel (Uh), tell me how you feel (Ayy)\nTell me how you feel (Okay), tell me how you feel (Alright)\nTell me how you feel (How?), tell me how you feel (Wow)\nTell me how you feel (How?), tell me how you feel (Wow)\n\n[Outro: Ugly God]\nTell me how you feel (Ooh), tell me how you feel (Tell me)\nTell me how you feel (Ayy), tell me how you feel\nNigga, say it with your chest (Chest), tell me how you feel (Ooh)\nTell me how you feel, nigga, tell me how you feel", "title": "Tell Me How You Feel", "year": "2019-08-09", "album": "Bumps & Bruises (Deluxe)"}], "artist": "Ugly God"}