{"songs": [{"image": "https://images.genius.com/4a44666b97102a56080addd73e57f2aa.1000x1000x1.jpg", "lyrics": "Yeah, yeah\nYeah, yeah\n\n[Verse 1: U-God]\nI keep my third eye 20-20, every day looking sunny\nGod's told me: \"Nothing move but the money, money\"\nHeadstrong, backbone, hit them on the Batphone\nCould there be back home? Feeling like fresh chrome (Yeah, yeah)\nSomething for your headphone, build the establishment\nQuit while you're ahead, save the embarrassment (Yeah, yeah)\nElect me for president, thought I was irrelevant?\nBattled all the elements, overcome their hardships (Yeah, yeah)\nAnd struggled with accountants, **** got rocky\nI trained in the mountains, now the world is mine (Yeah, yeah)\nGot us spraying from the fountains, drive by the housing\nReminisce, take a ****, staircase, we made thousands! (Thousands)\nWe was Park Hill, rugrats, fishermen, thug hats\nFive dollar snapbacks, never got no love back\nThat's why I sold packs, damn right, I stole that (Yeah, yeah)\nGranule, hold that now I want the whole stack\nChanged my life, now it's rap, ain't no turning back\n\n[Chorus: Ghostface Killah & Raekwon]\nTell, tell, golden arms, maintain the fort! (Fort, fort, fort)\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\n\n[Verse 2: U-God]\nI'm on a mission, bred from the poorest conditions\nBaby fed from the pots, from the poorest of kitchens\nGot bread in the streets, from the rawest addiction (Yeah, yeah)\nMade a 180 turn, with the Lord's conviction\nIt's a riding prison (Yeah, yeah)\nKeep the iron on my side, to avoid the friction\nIn this modern day slavery I survived the lynching (Yeah, yeah)\nWith no rap pension, the price of living is too high\nTwo jobs working, this nigga is too tired (Yeah, yeah)\nNo more babies, she needs them tubes tied\nWord on the tweets, \"I heard he's a new guy\" (Yeah, yeah)\n“Heard he was too fly”, damn maybe we should get scooped by a new ride (Yeah, yeah)\nThe ghetto's up in flames, think we should calm down\nMy insides is evil, you in the wrong town (Town)\n\n[Bridge]\nWhatever you want, better watch yourself\nWhatever you want, better watch yourself\n\n[Chorus]\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\nTell, tell golden arms, maintain the fort (Fort, fort, fort)\n\nYeah, yeah\nYeah, yeah", "title": "Golden Arms", "year": "1999-10-19", "album": "The Keynote Speaker"}], "artist": "U-God"}