{"artist": "Immortal Technique", "songs": [{"title": "Impeach The President", "lyrics": "(Saigon)\nWhen 2Pac comes back the beef is on, W\nYou wonder why the Black and Latin people don't love ya\nWell I'm first, we can start with the church\nYou're politicizing religion, you and your father's the worst\nAnd um, next: Ya'll took welfare cheques\nGive us diseases and then collect health care debts?\n(Whatever, what else?)\nYou only think about yourself\nYou sendin' niggas to war while your rifle is on the shelf\nGeorge, you're something else\nOsama, could be 10,000 times worser than you\nFind him your fucking self\nAnd why act like you care about the troops in Iraq?\nCause if you did, you would let them fly back\nIt's because of you that those planes got hijacked\nYou're also the reason Katrina victims had to die like that\nThey say you was hesitant, we say you was negligent\nIt's about time for niggas to\n\n(Chorus)\nImpeach the President\nImpeach the President\nImpeach the President\nImpeach the President\n\n(M-1)\nHow many times do I gotta state my position\nBefore ya'll say \"This lip service, he's wishin'.\"\nI been organizing, I've got a thousand petitions\nBeen up before sunrise, writing. I'm on a mission\nIf I could be president, I would lower the rent\nAnd make stic.man my secretary of defense\nMy whole cabinet would be niggas who ain't havin' it\nYou think it's fucked up now?\nJust watch how bad it gets\n\n(Just Blaze)\nInvasion!\nI'll push Bush off the White House roof\nCalling chickens coming home to roost, it's overdue\nNiggas taken advantage of, taken for granted\nFor the hungry, for the 'hood, for the good of the planet\nBut not to get it twisted, Bush is only a figurehead\nIt's bigger yet. The whole system needs to be put to death\nIf I was president, then I'd get rid of the whole office\nPimp the system out and make the people the  bosses\n\n(Chorus)\n(Motherfuckers don't realize how serious this mother fucking shit is.)\n\n(Immortal Technique)\nEither stand him, wear the rifle or reach him\nOr some bitch give him a blow job so we can impeach him\nTeach the motherfucker about the drama I bring\nAnd cut Dick Cheney's hands off for pulling the strings\nThis is for all my niggas locked in the P\nThat'll never see the sun until the revolution is bring\nGeorge Bush: the puppet king of the planet\nNigga, he don't care about the marriage of faggots\nHe's got a supreme court full of religious fanatics\nLet me break down the mechanics:\nAl-Qaeda and America been doin' business well\nThey're tighter than Interscope and XXL\nFrom the patriot act to rape in Iraq to\nRussia's war with Afghanistan taking it back to Texas\nGovernor, your state is the most polluted\nAnd you had the most niggas executed\nNow you're born again, alcohol and talking to god\nYeah, dog, I read the book your friends wrote\nInsert the footnotes about how you used to sniff coke\nFrontin' like drug-free role models in harmony\nYour family in florida lives in a pharmacy\nCorporate larceny, tax cuts, that's how you started\nTwelve IQ points from being fuckin' retarded\nSo I gotta represent what I sell, niggas\n\n(Chorus)\nImpeach the President", "image": "https://s3.amazonaws.com/rapgenius/1-immortal_technique-20101005.Jpg", "album": null, "year": null}]}