{"artist": "Casey Veggies", "songs": [{"title": "Odd", "album": "Customized  Greatly Vol. 1", "year": null, "image": "https://images.genius.com/dd17019850fcbc3859bfd737bd599ed8.500x500x1.jpg", "lyrics": "[Intro]\nYeah, Ace the Creator\nCustomized Greatly\n\n[Verse 1]\nOh, turn the volume up\nYou still talking that Mass & volume stuff\nIt ain't a test to me\nY'all niggas ain't even heard the best of me\nGot you going like ecstasy\nUh, yeah\nIt's Case-eezy and it ain't easy being me-eezy\nI mess with the Yeezy and the Jeezy\nAnd oh yeah, the Weezy\nLeft me right where, where you leave me\nI got it all, it's no need to tease me\nI'm coming in the game, you niggas ain't even see me\nTold you my lines and you didn't even believe me\nAnd I'm a book come and read me\nI'm blood, come bleed me\nSlip straight to 90's, get off of my sleezy\nYeah, because the haters always acting up\nAnd I'm attacking ya, never back it up\n\n[Verse 2]\nFirst song get oh boy'd\nNow all the girls like \"Oh boy, oh boy\"\nAnd I don't wanna hear that weak shit no more\nAnd I'm coming to a store near you\nNigga why would I fear you?\nYou can't tell me nothing, I didn't hear you\nI'm riding from night til the next day\nMaybe balling spent 50 on the coat sway, no way\n(Yo, because)\n\n[Verse 3]\nIt's only one way up so I ain't going down\nThey around know I'm around when I come around\nYung Joc because it's going down\nFrom [?] and first to Supreme\nAll these niggas know the kid stay clean\nCustom, why you think my momma named me Casey?\nSo I can change into it\nRap with me, I was [?] into it\nI'ma get signed cause Ye can do it\nThe moment I put the pen to the paper\nI'ma keep moving, going through and through it\nWeatherman 3,000 [?]\nNow Casey playing chess with Monopoly\nAin't no nigga stopping he\n[?] kid, nigga what you supposed to be\nBubbly flows and that I'm toastin' he\n[?] in the ground, yeah I'm growin' deep\nOn my mind yeah, I flow when I sleep\nAnd I keep going until I hear that beat beep\n[?] just creep creep\nWhenever I take nothing, fake niggas always tryna take something\nYeah, I'ma lay low, my time will come\nKeep writing til my hands is numb\nVegas trips [?] fun\nWhy compete when it's already won\nCall me daddy nigga, you are my son\nShoot for the stars, she is my gun\nShe's so bomb, I call her a bad one\nSee Casey Gucci killer figure\n[?] SBs and Nike Maxes\nArm & Hammer and axes\nYeah, I'm fresher than air itself\nAnd if I had anymore swag, I would scare myself\nAnd I dare myself to own it all\nAnd all you fake niggas known to fall\nAt age fourteen, I'm known to ball\nI'm too priceless, even if the crew didn't exist\nY'all would swag jack me if I dress like Kriss Kross\nAnd all these lil mommas loving my kisses, no lipgloss\n\n[Outro]\nYeah, yeah\nTyler, the Creator\nAce, the Creator\nCustomized Greatly\n(Keep it goin')"}]}