{"songs": [{"title": "Coochie", "lyrics": "[Dolly Wilson]\nChorus (4x)\nMy coochie is soo juuicy, yeah\n\nThis right here is for all the girls\nWho I used to talk to who didn't amount to be shit in life\nYou know what im sayin? All the girls who used to call\nTheir man on me when I was in front of the building\nJust tryin' to get their numbers\nTry'na put my seed up in 'em, you know..\nAll the girls who gave me a wrong number\nWhen I just asked them for their fuckin' phone number\nTryin' to call 'em and hook up for a date and all that shit...\nAll the girls who left me in restaurants eatin'...\nTalkin 'bout they gonna use the phone\nAnd left me with the fuckin bill....\n\nHA! It was all a dream, I used to read Playboy magazine\nNiggas gettin' their dick licked with whipped cream\nWomen from all places, no matter what their race is\nMami wanna put punani where your face is\nI said \"Ha, Whut?\" Put my face by her trap\nSmoke weed, bamboo, lick her in her private spot\nWay back before niggas even started smokin' crack\nThey used to act, proooo black\nRemember Brand Nubian, 'One for all'?\nWho ever thought Akinyele would get paid for grabbin' his balls\nNow I'm in the strip bar, big rap star\nTime to get laid, which one of y'all girls wanna get paid?\nThe lieu..tenant, sit behind windows tinted\nRemember when I used to push cars that was rented\nNow I cop the drop top, made thier hearts stop\nDrive another block , they be like \"yo, that was Ak!\"\nHuah! I stay away from the A-I-D\nPack condoms like guns cuz thats the way I be\nOne love to the late great Easy E\nLarry Flynt, Hugh Heffner, and Ron Jeremy\nHuah! I get pussy you know how I do\nCall the crib last four numbers, ten-eighty-two\nWhat the fuck??\n\nMy coochie is soo juuiicy, yeah (4x)\n\nI can take the girl from the local streets\nAnd take her to Cancun and fuck her on the beach\nAnd Im far from cheap, I make sure all my niggas get laid\nOpen your legs girl, make some way, Hey-ay!\nAround the way they used to diss me, girls never kiss me\nNow they writing letters how they miss me\nI never thought that hard work could pay off and shit\nI was too used to jerkin' off and shit\nNow the hunnies play me close, like the butter play the toast\nWhen I'm grabbin 'em, I'll be baggin' them like a Coach\nCondos in Queens, head blown for weeks\nFeelin' up the cheeks of the 'put it in ya mouth' freaks\nRaw sex is what I fear, so I pack condoms when it comes to this here\nI hump bitch! A bunch of bitchs grabbed the family jewels\nConsidered a fool cuz I get more ass than a mule\nStereotype of a perverted nigga misunderstood....and its still all good\n\nChorus (9x)\n\nYea this for all the girls when I used to call they house\nThey see my number on the caller ID\nAnd they never pick up the phone..fuck you...\nThis for all the girls when I call 'em\nThey answer their phone like \"Hello\" and when I say\n\"Its Ak\" they act like their fuckin 'sleep..\nYeah fuck you...\nThis is dedicated to the Notorious B.I.G\n\nOh my-my coochie oh its so fuckin' juicy\nTalkin bout my coochie oh its fuckin' juicy(8x)", "year": null, "album": "Aktapuss", "image": "https://images.genius.com/9d7b35df62f9d7e92de929e57dd943e9.395x400x1.jpg"}], "artist": "Akinyele"}