{"songs": [{"album": "T.I. vs T.I.P.", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg", "year": "2007-07-03", "title": "Act II: T.I.", "lyrics": "[Intro: T.I.]\nMmm, God mm\nWhat the fuck, what time is it?\nI coulda swore I parked my car (shit)\n\n[T.I.]\nAy, light hit my face sun brought the heat\nOpen my eyes see my car parked across the street\nAnd then it hit me I ain't really slept at all in a week\nMatter fact I don't even remember fallin asleep\nAlantic office claimin J. Geter keep callin the heat\nIs it an emergency or somethin you need to talk to me?\nJ said - \"I thought you needed to talk to me\nIf it's a change made aware I think it ought ta be\nYou makin ultimatums now you don't talk to me\nYou make shit way worse then it ought ta be\nI ain't arguin on the phone, come talk to me\nI'll be waitin on you dawg at the office, peace\"\nNow, thinkin hard as I walk out my house\nWhat the fuck have I done now, what could he be talkin 'bout?\nI been stayin outta trouble, shit I been on the couch\nJust workin on the album, I was listenin now\nThen, Doug called (ay you spoke to J?)\nYeah is it somethin I don't know that I was supposed to say?\nAll I know is for the hour I been woke today\nNiggas comin with the riddles and the jokes today\nI'm real close to J, I seen ups and downs hit\nBut I ain't never heard him sound the way that he sounded\nReally caught a nigga by surprise, I was astounded\nHe a real cool dude but why he call me clownin?\n\n[Doug Peterson] + (T.I)\nYou sayin you don't know 'bout it? (Know 'bout what?)\nAtlantic Records said you called the office and went nuts\nMakin death threats talkin loud gettin buck\n(Man they said I did what? Folk I'm just gettin up!)\nSay you waitin out your deal 'til you year is up\nYou plannin to make away with 20 million bucks\n(You bullshittin me right? Is you serious bruh?)\nYeah they said from now on they'd rather deal with us\nI talked to Craig, Jules and Kys' a long time\nLong story short they said you done lost ya damn mind\nAnd they runnin off deeper across ya deadline\nYou crossin a thin line, don't give 'em a deadline\nOr they suin the shit up out ya, they don't give a shit about ya\nSaid you ain't doin nothin they couldn't have done without ya\nMan you ain't never been hotter, worked a whole lotta\nYears and came up to go way back to the bottom, what\n\n[Repeat to fade]\nHustle pimp, hustle pimp\n\n[Outro: T.I.]\nMan, the hell is y'all talkin 'bout?\nI been in the house all night\nI don't know nothin 'bout that shit man\nI got the album right here!\nMan send this to 'em"}], "artist": "T.I."}