{"artist": "Andy Mineo", "songs": [{"title": "Donuts", "album": "II: The Sword - EP", "year": "2018-09-21", "image": "https://images.genius.com/69e8876052e0171c6e6f24304d344330.1000x1000x1.jpg", "lyrics": "[Chorus: Andy Mineo]\nGoin'\nGoin'\nWould you still be good to me?\nGoin'\nCould you still be good to me?\nGoin'\nWould you still be–?\n\n[Verse 1: Andy Mineo]\nYeah, this one for donuts, this one for all the grownups\nI keep my cards close 'cause I don't deal with jokers\nMan, I'm sick of bein' dope, but why they hardly notice?\nAnd these the joints that never sell, but yo, they still the coldest, ha\nThis feel like Philly, a steak down at Ishkabibble\nThe things I scribble make you think a little\nThey tell me to choose a side, but I decided to pick the middle\nI can handle that, and yo, the kid could dribble\nAn over-thinker, with the ink I'm like Tinker Hatfield\nAt will, design rhymes in 20 years\nYou tryna think of mind over mattress\nBlinded by the fatness\nIt's hard to live righteous, but I'm tryna practice\nAnd me and Del collect the addresses of anyone who ever hated\nWent to Hallmark, bought all the cards that said \"Congratulations\"\nWaitin' for the day to pay myself\nTo mail these cards out, they all say \"You played yourself\"\nThat's so petty\nMy wife said I need a mani\nI been nervous, bitin' my nails 'cause, look, I don't got no plan B\nI remind myself that my worth is not in sales\nHis purpose gotta prevail, we planted a church\nInhale happy thoughts, exhale negativity\nWith this Macintosh, I make apple sauce\nBetter believe it\nSee, in this life there's only three things that you can depend on:\nThat's death, taxes, and Jesus, they all get you\nAye, and yeah, they all get you\n\n[Chorus: Christon Gray]\nGoin'\nWould you still be good to me?\nGoin'\nWould you still be good to me?\nGoin'\n\n[Verse 2: Phonte]\nBig breath\nThis one's for donuts, a sweetness anyone can taste\nWords from Uncle Tay\nYour relative is crunk and drunken at your function with a Krispy Kreme or a Dunkin'\nSingin' through a Telefunken and spelunkin' through the sunken place\nFor 16 bars, been sick and got discharged\nRap was a wrap like a Swiss wrist watch\nHe ain't lookin' like a weird mishmosh in freaks and geeks\nThen I don't understand, damn, am I this washed?\nBut this get part–Tigallo flow still flawless\nAnd so lawless, I'll prolly get disbarred\nSigned seal, get a notary\nWait till they get a load of me\nMy peeps who molding me could never see this far\nYour boy made it out of Fraggle Rock to Iron Man and Ragnarok\nAnd 4K HD straight off the Magnavox\nNot to be a chatterbox\nJust in my bag handin' out some bars in the real world\nAll y'all co-stars is faux pas, they the laws  in the real girl\nManufactured affection for a plastic connection\nBut my selection slow and low like brisket\nGet a plate, sop it up with a biscuit\nOn the couch, toes out, with your spouse, watchin' \"Love It or List It\"\nTigallo bring the soul and the mischief\nAnd we do it like this, one time\n\n[Chorus: Christon Gray & Phonte]\nGoin'\nYes sir\nWould you still be good to me?\nGoin'\nBe good to me, baby\nWould you still be good to me?\nGoin'\nBut could you still be good to me when I don't even know where I'm goin'?\nBut could you still be good to me when I don't even know where I'm goin'?\nWould you still be good to me?\nGoin'"}]}