{"songs": [{"title": "Bossanova", "album": "We Love You Tecca", "year": "2019-07-04", "image": "https://images.genius.com/5c4f5c6cd068e01fe84cc68f75821178.640x640x1.jpg", "lyrics": "[Intro]\nYeah, oh my, oh my God\nOh my, oh my God, oh my\nOh my, oh my God, oh my\nOh my (uh, uh-uh-uh-uh)\n(Nick, you're stupid)\n(Uh, uh, uh, uh)\n\n[Chorus]\nMy baby, she flexin' all up on my blessings\nI get a flash, nigga with baguettes (Yeah)\nWe just seen a opp and we sent 'em to heaven (Yeah)\nAnd it been so long, so the vibe so distant\nShe say I'm Lil' Tecca, so she let me hit it (Uh, uh)\nAin't respond to the text, nigga but I read it\nShe told me she love me, nigga had to dead it (Yeah, yeah)\nYeah, run to the pack, lil' nigga gotta get it\nI don't know, are you gang, slime?\nI don't know your gang sign\nI don't know your intentions wit' my energy, see you later\nShe said \"oh my God\" like Lil Keed (Oh my)\nAnd you givin' me stress, baby I don't need (Oh my)\nShe said that she love me, she fuck with my team (Oh my, oh my)\nHow you say that you love me and fuck on my team? (Oh my)\n\n[Verse]\nI'm countin' the cash, yeah I count the green (Green, cash)\nI'm countin' the cash, yeah I count the blue (Count the blue)\nI got no pressure, nigga game two\nYou know that you poppin' if they hate you\nI use it as motivation, 'cause I know that I'm going to be greatness (Motivation)\nSpin the block like tornado\nYou a lost nigga, you are outdated\nPut me in Olympics, I run to that sack (Sack)\nI feel like a doctor she give me that back\nI said, \"Yo Wave, pass the MAC\" (MAC)\nFinnessin' that pack and I might get it back (Finesse)\nAlways grindin', nigga I cannot slack\nI fucked your bitch, ha, that's a fact (Thotty)\nI fucked yo' ho, nigga that's a fendi (Schemin')\nI mixed the Prada nigga wit' the Fendi\nI fuck on yo' bitch her name Betty (Betty)\nYou fall in love then it's deady (Deady)\n'Cause I don't need no one, I don't know if I'm ready\nI ain't goin' to the party baby, we goin' to the getty\nI ain't tryna' touch you baby, shawty you jus' met me\n\n[Chorus]\nMy baby, she flexin' all up on my blessings\nI get a flash, nigga with baguettes\nWe just seen a opp and we sent 'em to heaven\nAnd it been so long, so the vibe so distant\nShe say I'm Lil' Tecca, so she let me hit it\nAin't respond to the text, nigga but I read it\nShe told me she love me, nigga had to dead it\nYeah, run to the pack, lil' nigga gotta get it\nI don't know, are you gang, slime?\nI don't know your gang sign\nI don't know your intentions wit' my energy, see you later\nShe said \"Oh my God\" like Lil Keed (Oh my)\nAnd you givin' me stress, baby I don't need (Oh my)\nShe said that she love me, she fuck on my team (Oh my)\nHow you say that you love me and fuck on my team? (Oh my)\n\n[Outro]\nOh my, oh my, oh my, oh my"}], "artist": "Lil Tecca"}