{"songs": [{"year": "2013-07-02", "image": "https://images.genius.com/31ad7ad89604d87d69b3e57bfba4ac85.936x936x1.jpg", "title": "Pro Wrestling", "album": "Dour Candy", "lyrics": "When i Looked into your eyes, I saw walls, walls filled with fear - Ultimate Warrior\n\nWe don't even understand freedom anymore. We are a country that is heading towards socialism, totalitarianism, beyond your wildest imagination. - Glenn Beck\n\nBecause I'm rich in ring prowess. Blessed with technical skill. And extremely well of when it comes to wrestling ability. - Ted Di Biase\n\nVerse 1\nThey do interviews, veins bulging out the neck\nMock outrage, or is they really vexed\nAnybody's guess\nFacts don't matter, make them twist\nAnd shout, much beating at the chest\nPopcorn buttered, feet up, eyes glued to the set\nIt never gets old, like Pro Wrestling for NES\nThey be goin' off the top rope, Suplex\nPay-Per View to your Double-Wide and Duplex\nA swing an' a miss, but he still hit the deck\nBadly choreographed cheap shot, meet the press\nLogic is a foreign object to who cheats the best\nYells the loudest in the snake pit\nIssuing cowardly threats\nWork the crowd with oiled Pecs\nEmmanuel Goldstein on screen, grotesque\n\nCome on down the aisle with your flag waving, with your music playing, and all your little fans standing and then\n\nYou must get a weapon, you must have a weapon, you must get any weapon that is legal to have and keep it in your house, and not worry so much that you're going to use it to kill yourself\n\nCan i finish please? Yes, Alright. Absolutely, Death threats against my children - Star Parker\n\nVerse 2\nWriggled out the 8 count, razors in his mouth\nSteel cage match if the ratings keep going south\nThe heel plays his bow to perfection\nSteps on toes, comes out throwing blows at your septum\nApply the sleeper hold just in time for elections\nTalking heads tap the sides of their nose, as it grows\nCatch a tiger by his toe, wag the dog, thousand pound gorilla in the room\nFresh Meat in the claw\nBring home the bacon\nHigh on the Hog\nPulled stuffing out the turn-buckle\nBrass on the knuckle\nFan favourite\nHGH in the muscle\nAre you not entertained\nFor this, better men, crippled and maimed\nIt's all in the game\nGrab the mic, hit your mark, spit those scripts\nPretty girls on the screen, showing some tit\nFolding chair to the spine, cold line to the jibs\nDry eraser battle lines\nOne eye on channel 9, like \"can I live\"\n\nRoll us into a new global government, environmental fasicm, dictatorship of the banking cartel- Alex Jones\n\nCathy, get off my phone. Get off my phone you little pinhead. I don't care. You people don't care about the trillions. Get off my phone. - Glen Beck\n\nFirst thing I'm gonna, I'm gonna take Piper's integrity. It's like Jacques Cousteau trying to find a dry spot in the ocean, I ain't got no damn integrity. How you think I got so far - Roddy Piper\n\nI was born with a golden spoon in my mouth. Nobody likes it. It's the old adage of: \"You like to hear somebody is doing pretty good, but you don’t want to hear they’re doing better than you.\"\nYou see, the bottom line is I’ve always done better than everybody else. Only because of one reason—I was born with a golden spoon. I inherited the ability, I inherited the money, I inherited the God-given best looks in the world today\nAnd with this, I dress myself in ultra suede; I dress myself in cashmere, yeah. I dress $100 pleated slacks. I dress myself in alligator shoes. I wear a $15,000 Rolex. I got a Mercedes Benz, Roles Royces. The biggest house, on the biggest hill, on the biggest side of town. You know, why I got all that... Because I was born with a golden spoon. - Ric Flair"}], "artist": "​billy woods"}