{"songs": [{"album": "Fuck A Mixtape", "image": "https://images.genius.com/6f08c14dfef32114f3f4458805c96968.500x500x1.jpg", "year": "2010-05-27", "title": "Bitch Who", "lyrics": "[Intro]\n\n[Chorus]\nHe ain't really from that block (Bitch who?)\nHe ain't really getting that guap (Bitch who?)\nHe ain't on top (Bitch who?) I beg your pardon\nYou bumped your fucking head? Is you retarded?\nHe ain't really got it like that (Bitch who?)\nI bet he gon' be quiet after that (Bitch who?)\nThat nigga's shit wack (Bitch you?) I beg your pardon\nYou bumped your fucking head? Is you retarded?\n\n[Verse 1]\nGangsters all sport just look\nShook, who me? I've never been nothing of the sort\nWant the title? Buck for it, it's yours\nGetting ignored 'cause you so piss-poor\nForced me to pull, kick doors, need mine on time\nYou could be sure shawty's gonna shine, trust\nLeft niggas in the dust, Trap Muzik\nTry to let you catch up, but you niggas just suck, bad\nFall short, not enough swag\nSo I had to give you niggas so much gas\nGet a maid costume and a broom 'cause you finna get\nSwept off your feet tryna step up to me\nI'll put your ass Down Under if it's left up to me\nLike boomerangs and kangaroos, now tell me I ain't a fool\nStack money like jewels\nLet a nigga take something from me, I refuse, who?\nI'm so cool, rock my jewels wherever\nRob me? Dude, I dare ya\nHave ya hats in a box and ya soul in the air\nSay your prayers and say hello to Laya\n\n[Chorus]\nHe ain't really from that block (Bitch who?)\nHe ain't really getting that guap (Bitch who?)\nHe ain't on top (Bitch who?) I beg your pardon\nYou bumped your fucking head? Is you retarded?\nHe ain't really got it like that (Bitch who?)\nI bet he's gon' keep it quiet after that (Bitch who?)\nThat nigga's shit wack (Bitch you?) I beg your pardon\nYou bumped your fucking head? Is you retarded? (Nigga!)\n\n[Verse 2]\nI hate you be comparing my shit to theirs, dare and try\nDon't even think it's fair that guy could breathe the same air as I\nI'm out there, way left field like Jamiroquai\nPharaoh fly, running chicks in and out the Merriott\nThey come get served then leave like a carry-out\nRestaurant, resembling some young Gloria Estefans\nListen, one, don't violate or I annihilate\nOpposition out of play, hatin' I don't tolerate\nCame out the gates dead serious\nAin't a lot changed since then, atop the top ten\nGod favors me like I'm without sin, go figure\nGet bigger every year, still the same old nigga\nMoney don't change no nigga\nYou started out a lame and get fame, but you the same hoe nigga\nAin't no flow sicker, everything I made dumb, crazy\nDeranged insane I say\n\n[Chorus]\nHe ain't really from that block (Bitch who?)\nHe ain't really getting that guap (Bitch who?)\nHe ain't on top (Bitch who?) I beg your pardon\nYou bumped your fucking head? Is you retarded?\nHe ain't really got it like that (Bitch who?)\nI bet he's gon' keep it quiet after that (Bitch who?)\nThat nigga's shit wack (Bitch you?) I beg your pardon\nYou bumped your fucking head? Is you retarded? (Nigga!)\n\n[Verse 3]\nI woke up this morning, I jumped up\nI heard some wack music, what the fuck?\nI guess these niggas Gumped up\nI wish some fuck niggas knuckle up\n'Cause we done slaughtered niggas every year\nBought the cleanest, all our tears\nPark the Chargers over there, park Ferraris over here\nNiggas never been a pimp, all they's really been a square\nAnd I dare a nigga try to run the cap, aim for the chair-\nMan, what? We got them rifles and we Tali-\nBan, and we break it in like the Mexi-\nCans, stacks on me, boy, I got them heavy\nPants, strap on me, nigga I make you do that\nDance, you playing with the Godfather Trilogy\nY'all boys ain't never seen my squad in a century\nWrong move, so I hit you with a penalty\nThis non-profit, nigga, westside ministry\n\n[Chorus]\nHe ain't really from that block (Bitch who?)\nHe ain't really getting that guap (Bitch who?)\nHe ain't on top (Bitch who?) I beg your pardon\nYou bumped your fucking head? Is you retarded?\nHe ain't really got it like that (Bitch who?)\nI bet he's gon' keep it quiet after that (Bitch who?)\nThat nigga's shit wack (Bitch you?) I beg your pardon\nYou bumped your fucking head? Is you retarded? (Nigga!)\n\n[Outro]"}], "artist": "T.I."}