{"songs": [{"year": "2010-09-28", "image": "https://images.genius.com/ae59ac20cf16e3a440904aa06dd710ac.1000x1000x1.jpg", "title": "Country Shit (Remix)", "album": "Return of 4Eva", "lyrics": "[Intro: Ludacris]\nI've been waiting to tell them about this country shit\nI'ma learn ya! You ready? Luda!\n\n[Verse 1: Ludacris]\nLet me tell you about these old-school Chevys, Cadillacs, SS Impalas\nIf you smoking then we got more sacks than Troy Polamalu\nYour partners want some quarters, my partners want some keys\nIn Atlanta we get that paper, can you haters say \"cheese\"?\n10,000 watt amps, 6 15-inch kickers\nMy truck bumpin' like injecting ass-shots, like a stripper\nNo insurance on these whips, tags all outdated\nI might not be shit to you, but my momma thinks I made it\nWe gon' ball 'til we fall or this Conjure get us wasted\nAnd I never drink that white, all my women think I'm racist\nOn that brown with the twist, tell these hoes to reminisce\nThat my name is Ludacris and I'm like \"bitch!\"\n\n[Hook: Big KRIT]\nLet me tell you bout this super fly, dirty dirty, third coast\nMuddy water, shawty pop that pussy if ya wanna\nLet me tell you bout this, old school, pourin' lean\nCandied yams and collard greens, pocket fulla stones riding clean\nLet me tell you bout this country shit, country country shit\nLet me tell you bout this country shit, country country shit\nLet me tell you bout this country shit, country country shit\nLet me tell you bout this country shit, country country shit\nCountry country shit\n\n[Verse 2: Big KRIT]\nI told 'em, \"aw man hold up,\" country is what country does\nM-I-crooked letter, ho, who you know do it better, folk?\nPull up, hop out: clean, in my old-school time machine\nKeep a parachute for this altitude\nCause when you riding this high, make it hard to breathe\nMay Day, hollering out payday\nKnockin' pictures off the wall when I creep\nPros get wet as fuck when I speak\nSouthern drawl, it's just the way it be\nHeavy like sumo, numero uno\nPourin' up brown, she sipping on Nuvo\nPimpin' so cold, never trick on a ho\nOuter space with the flow like I'm living on Pluto, you know\nBitch, I'm UGK influenced\nSlow it down, chop, chop and screw it for the folk in Texas\nThat forever reckon with the styrofoam cup and the purple fluid\nReturn of 4eva, I thought you knew it\nCountry shit, that's all I see\nThat's all I know, that's all I feel, that's all I am, that's all I'll be\n\n[Hook: Big KRIT]\n\n[Verse 3: Bun B]\nCandy painted ‘Lac Biarritz, sitting on 24's - Vogue\nPull up on my scene and I mack your bitch\nIt ain't hard to tell, I suppose she chose\nTo send over the clothes, the wigs and shoes\nThis Charlie Sheen pimping too big to lose\nRoll with trues and keep girls in twos\nBoy, you must've heard wrong, why you be confused?\nSee, I'm the big brother of Sweet James\nI know all about these street games\nBut the trick gon' pay, the chick gon' say\nSo she can't lie about what she bring\nI'm certified like USDA\nRepresenting Texas, straight up out the PA\nGraduated the School of Hard Knocks with a BA\nRight under the nose of the Vice and the DA\nAnything we say, take it as law, nigga\nWhen I'm in the booth, no rubber, I'm raw, nigga\nTalk about getting busted in your jaw, nigga\nLike I'm your pa, run go tell your ma, nigga\nNo flaw nigga, 100 percent\nOld school no glass house, I'm under the tint\nAsk anybody here who running this shit, it's Big Bun in this bitch\n\n[Hook: Big KRIT]"}], "artist": "Big K.R.I.T."}