{"artist": "BONES", "songs": [{"album": "Disgrace", "title": "BedfordFalls", "year": "2016-12-15", "lyrics": "[Intro]\nMr. Emil Gower: I owe everything to George Bailey. Help him, dear Father\nGiuseppe Martini: Joseph, Jesus, and Mary. Help my friend, Mr. Bailey\nMa Bailey: Help my son, George, tonight\nBert: He never thinks about himself, God, that's why he's in trouble\nErnie Bishop: George is a good guy. Give him a break, God\nMary: I love him, dear Lord. Watch over him tonight\n\n[Verse]\nGeorge Bailey I'm wishing on it daily\nBut I don't get the luxury of visions of my vanquish\nI'm stuck assuming it's fine\nSmoke in my eyes burn my retina make me blind\nEverything in line hold my breath then I dive\n100 story drop until my brain's offline\nI power down just to restart again\n100 tabs lost, wait, now what was I sayin'\nWhat I was thinkin' I feel so much better now\nMy favorite joke is life because it's \"us\" it's based around\nWhat I was thinkin' I feel so much better now\nMy favorite joke is life because it's \"us\" it's based around\n\n[Hook]\nI always get a laugh out of it in the end\nI hope you understand because I know I...\nAlways got it fuck the profit I do this for nothing\nYou so off your shit still actin like you onto something\nYou don't bring a splash of difference to the scenery\nYou are doomed to be the one that never finds the missing piece\n\n[Outro]\nGood luck you're gonna need it (what, what, what, what)\nGood luck you're gonna need it (what, what, what, what)\nGood luck you're gonna need it (what, what, what, what)\nGood luck you're gonna need it (what, what, what, what)\n\n[Post-Outro]\nClarence: You sent for me, sir?\nSenior Angel: Yes, Clarence. A man down on earth needs our help\nClarence: Splendid. Is he sick?\nSenior Angel: No worst. He's discouraged\n...\nClarence: Sir, if I should accomplish this mission, I mean... um. Might I perhaps win my wings? I've been waiting for over 200 years now, sir, and people ARE beginning to talk\nSenior Angel: What's that book you've got there?\nClarence: Oh, oh, The Adventures of Tom Sawyer\nSenior Angel: Clarence, you do a good job with George Bailey and you will get your wings\nClarence: Oh, thank you, sir, thank you", "image": "https://images.genius.com/85708e26050198500098b80ad1f2cb0c.500x500x1.jpg"}]}