{"artist": "Will Smith", "songs": [{"year": "2002-10-25", "lyrics": "[Tra-Knox]\nOoooooooo- gotta know ya\nBaby, baby, baby, baby, baby, baby\nAll right fellas- let's do it\n\n[Verse 1]\nYo ma, we got this thing right? (Thing right)\nIt's like, makin' me think like (Think like)\nIt's like fillin' my heart up\nNot makin' me hazy, just\nFillin' my mind up with all of these maybes\nI'm trying to figure exactly the thing\nIt's like, got me wreckin' my brain\nIt's like, tryin' to put words to a smile (Smile, smile)\nBut like, trying to figure out, forget it- look\nIt's really kinda hard to explain\nHow ya smile been burnt in my brain (Oh ya)\nAnd how ya purfume sing a sexy song to my nose\nAnd how ya finger tips gentle like the petales of roses\nMaybe it's the way you comb your hair (Comb your hair)\nOr maybe it's them stylish cloths you wear (Style you wear)\nOr maybe it's them little things you do\nOr maybe it's just you (Maybe just you)\n\n[Chorus]\nMaybe it's your attitude (Attitude)\nMaybe it's your point of veiw (Point of veiw)\nMabye it's the time we spend together (Together)\nMabye we could do this thing forever\nMabye it's your soldier ways (Soldier ways)\nMabye it's your golden gaze (Golden gaze)\nMaybe it's the way we blend together (Together)\nMaybe we should do this thing forever\n\n[Verse 2]\nRemember we met with shakin' T-shirt that first night?\nThat was the worst night, right?\nWell, I mean, we had fun and all, ya, that's true\nBut you had somebody else and I did too\nSo it felt like karma and fate had formed a team\nTo keep me from the girl of my dreams\nBut in the end, I made friends with hope and destiny\nAnd then, well, the rest is history\nBut yo, it wasn't easy though, trust\nI mean, tryin' to turn you and me into us\nYou my hommie, my lover, my best friend\nThe White House to the ghetto\nYou blend right in and I dig that\nI could never imagine this passion I feel\nI mean, couldn't imagine it could last what I feel\nBut if somebody do something to you?\nShoooot, girl I might just.....\n\n[Chorus]\n\n[Tra-Knox]\nI must tell you how I love you\nMaybe your my soul-mate\nMaybe my best friend\nYou made me and molded me\nA better man, yes I can believe in love\nOoo ya ya ya, maybe, maybe, maybe\nNo, no, no, no\n\n[Chorus]", "image": "https://images.genius.com/76048d37e73e3e383749923c401de4f0.1000x1000x1.jpg", "album": "Born to Reign", "title": "Maybe"}]}