{"artist": "Iggy Azalea", "songs": [{"title": "Elephant", "lyrics": "[Intro]\nOoh, yeah, yeah, woo\nWoah, oh\n\n[Verse 1: Iggy Azalea]\nBeatles, Elvis, Jackson, I'm a king in this hoe\nRest in peace, Martin Luther had had a dream in this hoe\nAnd what happened is that elephant grew big as a bitch\nAnd that motherfucker said, \"Take a sniff, you the shit\"\nWhite girl with a fat ass and a rap game, I know I make you mad\nVacays on a private plane for my own scene I hit Trinidad\nI know you probably hope I'm doin' bad\nI know you probably think I'm over-privileged with a rich dad\nPut a check down and get my new pad, but that's too bad\n'Cause I did this shit on my own, yeah\nI had to pick up the phone, yeah\nMake calls, leave home, yeah\nTake falls, get grown, yeah\nPlay records for a whole lot of people\nWho just couldn't see me go for it\nKept runnin' like go Forrest\nI got the awards to show for it\nBut they still don't believe me\nAnd they think this life is easy\nMade it far without suckin' dick\nBlinde girl, no pink head\nWhy these people all despise me?\nYet these dudes wanna wife me\nI must be doing somethin' right, please\nBack the fuck up, you lil' side piece, peace\n\n[Chorus]\nI hope they see this elephant\n[?] like you, this irrelevant\n[??] excellent\n[I hope they see this elephant\n[?] like you, this irrelevant\n[??] excellent\nI hope they see this elephant\n[?] like you, this irrelevant\nI hope they see this elephant\n\n[Verse 2: YG]\n(Four hunnid)\nAyy, ayy, look\nI need to Grammy after my nomination\nAyy, ayy, look\nBetter turn this verse to a conversation\nI got a question, is it politics or is someone racist?\nY'all one YG speak nah, nah, nah, nah that nigga brazy\nNah, nah these niggas brazy\nThey don't talk about the gun shots\nThey don't talk about the deals I got\nBirds I popped, the what not\nOh, I can't spit about the block?\nWhat, I gotta turn punk rock?\nOh, oh, I get it, they wanna see a mosh pit when the beat drop\nI don't need a chick to make me pop\nI just need my breakfast hot\nWhether you's a show up or not\nI'd rather slide my own drop\nRecord game fucked up\nRappers turned pop, that's why they don't speak up\nI spent my last hunnid on ten of your albums\nNow tell me why the fuck you leadin' us\nSpeak up, speak up, speak up\n\n[Refrain: Iggy Azalea & YG]\nI'm just a girl who loves stacks (Oh)\nDon't want no problems, don't want no problems (Oh)\nYou wanna know me? Come and ask me for your collar\nFor your collar (Oh)\nSpeak up, speak up, speak up\nSpeak up, speak up, speak up\n\n[Chorus]\nI hope they see this elephant\n[?] like you, this irrelevant\n[??] excellent\n[I hope they see this elephant\n[?] like you, this irrelevant\n[??] excellent\nI hope they see this elephant\n[?] like you, this irrelevant\nI hope they see this elephant\n\n[Verse 3: Iggy Azalea]\nYou can't deny it, I'm here, will never let go\nUnless I'm buyin' a Phantom, will never get ghost\nChordz and Stix you my brothers, you know the DRUGS code\nFuck it if it's pop this year, then raps gettin' grown\nHow the fuck can you complain about evolution?\nWhen most rappers spittin' trash called the rap pollution?\nYou can call them what you want, see this is a movement\nGame change, know a better bitch, introduce me, the elephant\nUh, I'm standin' right here and you see me, the elephant", "image": "https://images.genius.com/a5c16badc65ae40f6034b0d404bab2c9.1000x1000x1.png", "album": "Digital Distortion [Shelved]", "year": "2017-06-01"}]}