{"artist": "Boogie", "songs": [{"album": "Thirst 48, Pt. 2", "title": "Two Days", "year": "2016-10-12", "lyrics": "[Hook]\nProbably the reason I ain't seen you in like two days\nYou say you love me then turn around and you judge me\nI ain't text you in like two days\nYou say you want me then turn around and say fuck me\nI ain't seen you like in two days\nYou say you love me then turn around and you judge me\nI ain't text you in like two days\nYou say you want me then turn around and say fuck me\nI ain't seen you like in two days\n\n[Verse]\nIt ain't no honoring in death and then you follow with regrets\nWhat a whip, I think I pocket dialed my ex\nReally you was purpose I noticed my message green\nWhen I just seen you made that Tweet and ain't responded to my text\nHow it take a little freedom for me to see that I'm whipped\nHow you give me paradise and turn around and make me trip?\nDucking these broke hearts while making it make sense\nLoving that dog filter, but hate when I say bitch\nI see you unfollow me, got your ratio poppin\nYou know I been lurking, you been erasing my comments\nYou know I got that app, you better know I had your back\nDon't be no lady in the streets and then a thottie on the Snap\nI know it's wack because I ain't seen you\n\n[Hook]\nProbably the reason I ain't seen you in like two days\nYou say you love me then turn around and you judge me\nI ain't text you in like two days\nYou say you want me then turn around and say fuck me\n\n[Bridge]\nI'll be fine, it's cool if you let go, let me know, I'll be alright\nAs long as you still know, hit my phone, I might reply\n\n[Hook]\nI ain't seen you in like two days\nYou say you love me then turn around and you judge me\nI ain't text you in like two days\nYou say you want me then turn around and say fuck me\nI ain't seen you like in two days\n\n[Outro]\n(\"To disconnect, press 1. To record your message, press 2.\")\n(\"Are you still there? To disconnect, press 1. To record your message, press 2. --beep--\")\nI was gon' text you and tell you I miss you, but... I wasn't wit it. Figure I'll wait", "image": "https://images.genius.com/897bf6a1704e8f4822fba8ab981fa2b3.1000x1000x1.jpg"}]}