{"artist": "Problem", "songs": [{"album": "Understand Me", "title": "Let Em Die", "image": "https://images.genius.com/743b9dd171644a59afc08e0a82ba3e57.1000x1000x1.jpg", "lyrics": "(Intro)\nWhat?\nWhat?\n\n(Hook)\nWhere the love, niggas\nSurrounded by white girls, yea they love niggas\nI really was, you just dressin like a drug dealer\nGot no love for these motehrfuckin fuck niggas\nFuck it it, I let em die\n\n(Verse)\nStay with a zip, no fly\nZone getting dome while my chauffeur drive\nIt’s precious cargo, it’s Diamond Lane\nThe same niggas fore the diamonds came\nWe going in on yall cus them larger lanes\nI keep 3 bad bitches, Frankie Lawton mane\nProblem so good, the irony mane\nMoney straight like I ironed it mane\n\n(Hook)\nWhere the love, niggas\nSurrounded by white girls, yea they love niggas\nI really was, you just dressin like a drug dealer\nGot no love for these motehrfuckin fuck niggas\nFuck it, I let em die\nMoney straight like I ironed it mane\n\n(Verse)\nI made it like I designed it mane\nMade them niggas sit back, I reclined the game\nI decline the lane but redefined the game\nEvery flow I know is bout it either time or game\nFranklins… pay me bitch\nWhoever thought talkin shit would make me rich?\nPull out this dick and I bet she strip\nNever ever let a thirsty nigga make me piss\nIt ain’t possible, thought M’s was impossible\nNow I’m feelin unstoppable\nAnd I’m higher than colossal go\nYea, that’s 6 flags\nMake a bitch cum fast in that 6 jag\nMiddle to the bitch ass niggas\nThat’s forever with the faking\nJust got a young shooter, Nick Young to the Lakers\nLet’s turn up, put me in the urn if I don’t earn up\nI burn up this whole fuckin buiding, rollin, 4 wheelin\nMy only guarantee is taxes and more children\nCuz I’m a motherfucker, fuck a nigga mother while his brother watch\nI think I’m bout to buy another watch\nCook cookin boy, I’m oven hot\nFuck these niggas from here, I came in for the other other other spots\nYou know, legendary\nMet a few rappers that found out somebody’s legend scary as a…\nWhat?\n\n(Hook)\nWhere the love, niggas\nSurrounded by white girls, yea they love niggas\nI really was, you just dressin like a drug dealer\nGot no love for these motehrfuckin fuck niggas\nFuck it, I let em die", "year": null}]}