{"songs": [{"title": "Yours and My Children", "lyrics": "[Verse 1]\nRight here, dangerous idea\nIf we did this, then we couldn't feel fear\nIf there's no fear, there's no control\nIf there's no control, someone's gotta let go\nThey say I shouldn't say too much they might delete me\nRealize I don't really care about TV\nKeep your awards, your applause I'm easy\nAll I can do in this life is just be me\nPilger can say it, so can Naomi Klein\nIts free speech for them, that's fine\nYoung black rappers should utter the same words\nUtterly absurd, nutter, insane, nerd\nEven the fact I call myself black\nSocial conditioning and that's a fact\nThe idea of races has no factual basis\nIt was made just to serve racists\nTo justify to doing to some what couldn't be done\nTo others, but they all are our sons\nBlack or white all of our sons\nMuslim, Christian all of our sons\nLook up in the sky that's all of our Sun\nLast time I checked we only had one\nSo if some were superior, others inferior, based on exterior\nWell then surely the sun would know and fall in to line?\nIt would rain on your crops and not mine?\nAir would prefer to inhabit your lungs?\nFood would prefer the taste of your tongue?\nIf that's not the case then nature has declared\nDespite what we say the worlds in fact fair?\n\n[Hook]\nKids in Iraq\nYours and my children\nKids in Iran\nYours and my children\nAfghanistan\nYours and my children\nEven Sudan\nYours and my children\nKids in Brazil\nYours and my children\nPolice drive by the favela and just kill them\nKids in Brazil\nYours and my children\nPolice drive by the favela and just kill them\n\n[Verse 2]\nProblem is, it feels better to feel better\nAnd reap without sowing\nWhatever is growing\nNever ever slowing, turn days to dark nights\nTheir backs still bent from the weight of our life\nLook what I spent and gents it's half price\nCos he is bent over the sewing machine half his life\nDon't matter that we don't pull it\nIf we don't care that's our breads buttered with the bullets\nOur cars choke on blood\nLimbs in our diamond tip rings go rotten\nThere's something we forgotten\nPillars of the temple may seem separate\nBut they support one roof\nIf your really checking it\nAll of our slaughters\nOnly our daughters\nOnly our self in a war that we fought with\nAll corrupt laws it's, we are the causes\nCos we can't see they're all of our daughters\nKill a couple of us you're a devil\nIf you kill a couple million of them\nGet stripes and medals\nGenerals conduct the great death symphony\nPlayed in the key of hate\nBy musicians with no rhythm but offbeat killing\nHear the harmonies the screams of young women\nThey're not important\nThey are just orphans\nHow can that be if they're all of our daughters?\nThey're not important\nThey are just orphans\nHow can that be if they're all of our daughters\n\n[Hook]\n\n[Verse 3]\nIf we decided to not be divided\nSaw no one that we could side with\nAll the gun and stupid violence\nAll the fun of stupid tyrants\nThe blood of our defiance of the laws of natural science\nWould have subsided or died a death or had no hiding left\nInstead it provided the horse to ride on to the ride of death\nWe're enlightened but we don't know right from left\nCos we're so frightened\nIts like we're blinded to the sight of death\nFor all our writing only writing on the doors of death\nWe're only fighting for the right to resort to theft\nWe would steal the air if we could as if we're short of breathe\nOnly if we're sure that it would have the cause and effect\nIf some part of us good, tell me where it is kept\nCos we are saying nothing while we crush them like a fucking pest\nIf you discuss it, everybody is turning fucking deaf\nLook down at your kids, what if they were next?\n\n[Hook]", "year": null, "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}