{"artist": "Ace Hood", "songs": [{"title": "I Solemnly Swear", "album": "Starvation", "year": "2012-03-30", "lyrics": "Ace Hood Talking\n\nYeah I'mma live by the code, I die by the code\nBe a real nigga till my casket door close, huh?\nLive by the code\nYeah I'mma ive by the code\nI'mma live by the code, coulda went to school, this the life I chose\n\nChorus\n\nI'mma live by the code, I die by the code\nKeep it 100, never snitchin' on a soul\nI'mma ride for my niggas, until my eyes close\nIn love with the money, I dont love these hoes\nI solemnly swear\nI solemnly swear\nI solemnly swear\nI solemnly swear\nI'mma live by the code, I die by the code\nI be a real nigga till my casket door close, huh?\n\nVerse\n\nNow twelve years old, mama in the kitchen\nTold her if my brother went to jail, I'm never snitchin'\nShe said \"boy go wash them dishes!\", she must think I was trippin'\nTwelve years later, boy I still hold my position\nJust that G-code in me, won't let no pussies get me\nI go to court, I'm drunk as fuck, I'm stressin' on that Remy\nI hit the stand, I raise my hand, and all yall against me\nThe judge man trippin', tryna give my youngin's twenty\nI'm like \"No sir your honor, I don't know any gunners\nDon't know when and where, and who it was, that's such a bummer\nWe good?\"\nI'mma live by the G shit\nAnd I solemnly swear to keep a bad bitch\n\nChorus\n\nI'mma live by the code, I die by the code\nKeep it 100, never snitchin' on a soul\nI'mma ride for my niggas, until my eyes close\nIn love with the money, I dont love these hoes\nI solemnly swear\nI solemnly swear\nI solemnly swear\nI solemnly swear\nI'mma live by the code, I die by the code\nI be a real nigga till my casket door close, huh?\n\nIce Berg\n\nHold up\nPark the Chevy hopped in the back seat or somethin'\nSeats reclined, curtains closed, they ain't seen me coming\nBlack jack, no even money\nYou act bad, you gon' get your ass whacked , while I'm beating somethin'\nYous'e a lame, yous'e a lame\nIf you get hit, you gon' rat, with your punk ass\nSteady putting on, like you on that\nI got an AK and a chrome Mac, with a shoulder strap, thats gon' clap\nWith a soft trigger, that stall niggas, every time I hold it back\nI done lost too many niggas to be slippin'\nNow I dont even fall asleep around these bitches\nAnd it ain't no secret, these niggas out here snitchin'\nAnd them bitches are the ones who are considered the realest, damn\n\nChorus\n\nI'mma live by the code, I die by the code\nKeep it 100, never snitchin' on a soul\nI'mma ride for my niggas, until my eyes close\nIn love with the money, I dont love these hoes\nI solemnly swear\nI solemnly swear\nI solemnly swear\nI solemnly swear\nI'mma live by the code, I die by the code\nI be a real nigga till my casket door close, huh?\n\nAce Hood Talking\n\nLive by the code, live by the code\nI'mma live by the code, coulda went to school, this the life I chose", "image": "https://images.genius.com/ee1f29169e460342b88aa5c8d75ede59.500x500x1.jpg"}]}