{"songs": [{"year": "2012-10-22", "album": "good kid, m.A.A.d city (Deluxe Version)", "image": "https://images.genius.com/e016e65e47dcc0e8c3e2067af75c80af.1000x1000x1.jpg", "title": "Compton", "lyrics": "[Produced by Just Blaze]\n\n[Verse 1: Kendrick Lamar]\nNow everybody serenade the new faith of Kendrick Lamar\nThis is King Kendrick Lamar\nKing Kendrick and I meant it, my point intended is raw\nFix your lenses forensics would've told you Kendrick had killed it\nPretend it's a massacre and the masses upon us\nAnd I mastered being the master at dodging your honor\nAnd the chapter that read at 25 I would live dormant like five in the morning\nThey raid your spot while Kendrick's performing\nAnd if they take everything, know I got\n\n[Hook]\nCompton, Compton, ain't no city quite like mine\n\n[Verse 2: Dr. Dre & Kendrick Lamar]\nAy, Dre what's happening wit' it my nigga\nStill I'm at it, peel the plastic off it, you can feel the magic\nStill I'm laughing at the critics talking, I can see 'em gagging\nWhen I'm back in the back of my city, back in the 'bach\nWith a batch of them banging Dre Beats with me, look where I'm at\nIt's the murder cap' and I'm captain at birthing this gangsta rap\nIt's a wrap when I'm done and I come a long way from a hundred dollars a month\nTo a hundred mil' in a day, bitch I'm from\n\n[Hook]\nCompton, Compton, ain't no city quite like mine\n\n[Verse 3: Kendrick Lamar]\nSo come and visit the tire screeching, ambulance, policeman\nWon't you spend a weekend on Rosecrans nigga\nKhaki creasing, crime increasing on Rosecrans nigga\nKendrick Conan nigga\nWhere you sword at, hand on the cross and swore that\nI do it big as Rasputia for them shooters\nKama Sutra scream fuck your position and make you hold that\nI'm trying to stay grounded like four flats\nBut I know flats and Piru Crip tats\n\n[Bridge]\nWill swarm on me like a beehive\nHop in the G ride\nFrom the West to the East side\nKnow that's just how Compton roll\n\n[Verse 4: Dr. Dre & Kendrick Lamar]\nAnd that's a given\nI pass the blunt then pass the torch of course that's my decision\nI crash the Porsche then you report that you see me in Benzes\nI must report that we import the narcotics you bought it\nThen talked about it when crack hit the speakers, the music business\nI blow up every time we throw up a record\nDepending on what you expecting, I'm sure it's bigger than your religion\nPerfected by niggas that manifested music to live in\n\n[Hook]\nCompton, Compton, ain't no city quite like mine\n\n[Verse 5: Dr. Dre]\nSo tell that gangster throw his set high\nRoll it up in a blunt, I'mma take you on the next high\nI did exactly what I wanted that's what made them checks fly\nIn my direction, you never questioned when I said I\nWould be a mogul before I visit 2Pac and Left-eye\nEazy and Aaliyah when I see you we gon' test drive\nA Lambo in heaven but for now I'm on the redeye\nFlying back to my city cuz I'll forever standby\n\n[Hook]\nCompton, Compton, ain't no city quite like mine\n\n[Verse 6: Kendrick Lamar]\nNow we can all celebrate\nWe can all harvest the rap artists of NWA\nAmerica target our rap market, as controversy and hate\nHarsh realities we in made our music translate\nTo the coke dealers, the hood rich\nAnd the broke niggas that play\nWith them gorillas that know killers\nThat know where you stay\nRoll that kush, crack that case, ten bottles of rosé\nThis was brought to you by Dre\nNow every motherfucker in here say:\n\"Look who's responsible\nFor taking Compton international\nI make 'em holla\"\n\n[Outro]\nAyo Just Blaze, good looking homie\nJust Blaze\nAin't no city quite like mine, yeah\nIn the city of Compton\nAin't no city quite like mine\n\n[Skit]\nMom, I finna use the van real quick!\nBe back, 15 minutes!"}], "artist": "Kendrick Lamar"}