{"songs": [{"year": null, "image": "https://images.genius.com/dcc907148124284a9abc48db9df5e500.500x500x1.jpg", "title": "Get It In", "album": "Fat Boy Fresh, Vol. 1: For Members Only", "lyrics": "[Intro]\nThis is how we get it in over here, don't stop don't quit\nWe get it on some hip-hop shit, this is hip-hop kid\nLet the strings blow, here to let you all know\nMe and my dudes, we come equipped and we ready to get it in, uh\n(Sing to 'em!) We get it in, uh (Sing to 'em!)\nWe get it poppin from beginning to the end, uh (yeah!)\nAnd this is rough rugged and raw, like throwin slugs to your jaw\nWe surpassin 'em all, the hardest you saw is...\n[Rapper Big Pooh]\nWho you know jump straight off a bus\nFall back into the booth, who fuckin with us?\nI adjust to any circumstance, handle my affairs\nShake the hatred off, show 'em I don't really care\nNo we don't compare, I'm on another stair\nCase in point, you ain't fuckin with my last year\nWe raisin glass here, to toast the good times\nGettin money is the theme, here's the dope rhymes\nTo quote mine, you in tune to the world's greatest\nI see a star up ahead, it eclipse the latest\nPut me on ya playlist, yeah I said it twice\nIt sound better than the first, cause I'm that nice\nWe roll that dice, and watch it bounce back\nIf I bet it on the past, I'd prob'ly rolled craps\nSo I stack one chip at a time\nAll these other niggas out ain't fuckin with mine\n\n[Chorus]\nWe get it in, uh! We get it in, uh!\nWe get it poppin from beginning to the end, uh\nWe get it in, uh! We get it in, uh!\nWe go hard, my nigga, no pretend, uh\nWe get it in, uh! We get it in, uh!\nWe get it poppin from beginning to the end, yea!\n(And this is rough rugged and raw, like throwin slugs to your jaw\nWe surpassin 'em all, the hardest you saw is...)\n[Rapper Big Pooh]\nAll Henny, no ice\nNo Coke chase so my throat sacrificed\nNo I'm not leanin on a vice, celebrate throw rice\nWhen them numbers go UP, then there's the price\nThis is the life, call it what you will\nI call it skill, I call it feel..\nGood, what the deal? Never missed a meal\n20-plus years on this Earth, I'm still\nTryna get a handle, gold on the mantel\nCan I get a sample, chicken on the toothpick\nWalkin thru the mall, patrons like, \"Nigga, you sick\"\nOnly if they said the same goin to the store\nGoin on a tour, goin 'round the globe\nIt's not a na'an 'nother like me you been told\nSoul never sold for the money and fame\nIf I had to again, I'd prob'ly do it the same\n\n[Chorus]\nI get it in, uh! I get it in, uh!\nI get it poppin from beginning to the end, uh\nI get it in, uh! I get it in, uh!\nI go hard, my nigga, no pretend, uh\nI get it in, uh! I get it in, uh!\nI get it poppin from beginning to the end, yea!\n(And this is rough rugged and raw, like throwin slugs to your jaw\nWe surpassin 'em all, the hardest you saw is...)"}], "artist": "Rapper Big Pooh"}