{"artist": "Casey Veggies", "songs": [{"title": "Life Rhymes", "album": "Customized Greatly Vol. 3", "year": "2012-01-01", "image": "https://images.genius.com/28eb51ba21c0b473fc0f5f74d662ccb2.500x500x1.jpg", "lyrics": "[Verse 1: Casey Veggies]\nIt's that young nigga, that\nAlways spit them life rhymes\nAlways slept with the right dreams\nI evolve in the night time\nBaby give me them pipe dreams\nWash it down with some white wine\nDon't be thinking that I drink\nOne shot and I feel fine\nOnly fuckin' with bright queens\nI done made up my mind if you focus on right things\nAnd realize that it take time\nYou will have a great time, everything go intertwine\nThat's what they told me mixed with how they show me\nPlus what I'm already knowin, let's get this money!\nOh, oh, oh, oh\n\n[Hook: Casey Veggies + Jhene Aiko](x2)\nYeah, I got all the shit in motion\nI got so much shit to do\nI'm just grindin gettin focused\nMan I put that on my crew!\nI've been brushing girls off but baby\nI've got time for you\nI've got thirty thousand on me\nMight run to the whole crew\n\n[Verse 2: Casey Veggies]\nThe concentration this shit that's basic\nAnd niggas hating is the same reason we ain't faded!\nCould have lift the nation\nI know girls that's in love with racing\nCan't stand to be patient\nAnd she need her friend approval just for her to mess with Casey\nHe a rapper girl, that nigga crazy\nBut you contradict yourself tryna down a nigga caking\nTalking about this boy came in and paved it\nFor himself and his fam man, that's some great arrangements\nI wouldn't call me famous\nJust a kid that's gonna change shit\nWhen I walk in this world, I thought I ought to make it!\nKeep customer service, never automate it\nPlease don't worry, you know I got some plans\nWhen that school bell ring my next grind start up\nHoes wanted sex when them checks got brought up\nGirls complex, swear I don't even judge her\nTell me who is next, when the best grind is all us\nHave you ever felt that like it worth it?\nOh, oh, oh, oh yeah!\n\n[Hook: Casey Veggies + Jhene Aiko] (x2)\n\n[Verse 3: Casey Veggies]\nThe lifestyles of the young and wild\nI done crossed roads in my life\nSwear he's trying to tell me something now!\nBut I'm rocking, no stopping, my best girl in Compton\nMy ex girl never got me, my dream car, Bugatti\nBut I settle for Audi, my camera is a paparazzi\nMy checks read young veggies, my dad read young king's\nThe way I love her like Amerie\nCause it's one thing,\nI really think she should stay with me\nCause young girl dreams\nShout-out my G'ma\nCause she made me a young believer\nThis day is beautiful\nThey respect us, play Aretha\nI told my momma, I'mma take her where palm trees at\nAnd buy her houses with dish washers and laundry mats\nOn tour no time to do chores, three months on my course\nStacking dollars for sure way better than before\nI think that's just what life's about\nTrying to figure it out\nFinding new things to add, and hope that it all amount"}]}