{"songs": [{"album": "Memoirs of a Playbwoy", "year": null, "title": "Make It Hot", "image": "https://images.genius.com/20c5987e929dec87b6e59767b98df4d2.277x277x1.png", "lyrics": "[Intro:]\n\"Na na na na naa na!\" [x8]\n\n[Verse 1:]\n\"I'm riding down the grove in my black Deville\nLooking for some pro's that perhaps can chill\nHigh as I glide by Summerhill\nBathing Ape, Lacoste, I'm dressed to kill\nCan't be swerving, my cup could spill\nMy pimp game worth 'bout a half-a-mil\nI'm heavy in the trunk, so the front pop a wheelie\nHer face be an eight, and her ass is so pretty\nI step into the room & illuminate the haters\nThey hating on a kid, cause I'm a super-fly player\nHeavy hitter, rhyme spit'er, ***** now or later\nBut still I get respect from Detroit to Decatur\nHere to get paper\nAfter that I'll see you later\nBig and I'm major\nHomie you a faker, faker\nThis is where I take ya\nGo head, do your thing\nWhile you do your thing, I'm a do my thing chuuh!\"\n\n[Hook:]\n\"So what you want\nWhat you got\nWhat you need brothering\nI'm a make it hot\"\n[X4]\n\n[Verse 2:]\n\"Now I'm a make it hot, I'm a make you sweat\nNever out of line, I keep my girls in check\nFrom the bottom to the top of the deck\nI ain't no chump nigga I demands respect\nWe stay high, yeah we puff the cess\nWeed on my breath, diamonds on my neck\nTatted up, I splatter guts when I sex\nShe gave it a test drive, she never drove a Lexus\nSee when I'm in your city man they treat me like Diddy\nGot to give a shout out to my cousin frank nitty\nFly by-coastal from LA to Philly\nExcuse me if I bump you, I'm a little bit tipsy\nYou can ask fifty, my city's so gritty, gritty\nHo's say they miss me, but still they know the dilly, dilly\nDigga stay crispy\nSee I'm a do my thing\nWhile I do my thing, you go do your thing chuuh!\"\n\n[Hook x4]\n\n[Refrain:]\n\"Dangerous\nWe're so dangerous\nMy whole entire unit is dangerous\nWe're so dangerous\nSo dangerous\nMy Starbwoyz crew be dangerous!\" [x2]\n\n[Hook x4]\n\n[Outro]"}], "artist": "J-Diggs"}