{"artist": "The Game", "songs": [{"title": "Bang", "album": "Doctor’s Advocate", "year": "2006-11-14", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg", "lyrics": "[Intro: Kurupt]\nG shit. What we do? Bang\n\n[Chorus: Game, Kurupt & Daz]\nYou got them funny ass colors on, take it off\nIf you in the club with ice on, we takin' off\nThought you was a gangsta nigga, you better shake it off\nDo what? Sh-sh-shake it off, or get banged on\n\n[Verse 1: Game, Kurupt & Daz]\nGettin' my bang on, red strings on\nLuis Vuitton kicks, Luis Vuitton frames on\nLuis Vuitton belt holding the fo'-five\nYou know who I am bitch, I'm Mr. Westside\nThis West West or nothin', get your pistols, get your flag\nGangstas we love to sag, we cock it back and blast\nLike booyaka-booyaka, we lay the party down\nG-G-Game, Dogg Pound\nEverybody get down\nLook nigga, I nurture and breed\nI ain't never gave a fuck about a bitches needs\nAnd bitch niggas try to invade our town\nI'mma lay 'em down, spray the 'K and get out\nSay goodbye to the '6-4, hello to the '6-trey\nHe ain't never seen hydraulics, look at his bitch face\nUp, down, now watch my shit scrape\nDaz call Snoop, I'mma Crip-walk to get Dre\nAnd Blood Bounce back, heat on the track\nDribble rock like Wade and bounce like Shaq\nThrow a O in the pot and watch it bounce right back\nLike that, Like that? Like that\n\n[Chorus: Game, Kurupt & Daz]\nYou got them funny ass colors on, take it off\nIf you in the club with ice on, we takin' off\nThought you was a gangsta nigga, you better shake it off\nDo what? Sh-sh-shake it off, or get banged on\n\n[Verse 2: Game, Kurupt & Daz]\n(Homie Game what's up)\nWe street connected, respected, I gets pathetic\nWhen I did it I must've meant it, so nigga go and rep it\nLil' homies around her constantly on smash mode\nLil' niggas with pistols that blowin' out your asshole\nBang how we give it, the culture that we live in\nFresh out the hospital or fresh out the prison (prison)\nReal niggas for life, the roots of the G tree\nN.W.A., Dr. D-R-E\nWe not S-T-A-Rs, we don't put stars in our shoes\nBitch, we put the whole car on the shoes\nYou don't wanna see my car on the news\nI'll Set It Off like Queen Latifah, red beam on the nina\nBang out, chippin' in traffic, dippin' the classic\nDippin' to classics, whoopin' that ass, it's hood niggas\nReady to get it, your bitch can get it\n'Cause I know she'll suck a dick in less than a minute\nCuz, I'mma have to show him where the house at (at)\nTwo milli Macs (Mac), semi-automatic situational attack\nIn the back with a sack, Cadillac all black\nLike this and like that\nBang, broken like glass and plastic\nBang out on him with the mask and plastic (motherfucker)\nWe got access to massive plastiques\nPurchased last week, D.P.G.C, Bang\n\n[Chorus: Game, Kurupt & Daz]\nYou got them funny ass colors on, take it off\nIf you in the club with ice on, we takin' off\nThought you was a gangsta nigga, you better shake it off\nDo what? Sh-sh-shake it off, or get banged on\n\n[Verse 3: Game & Kurupt]\nHere come them outta town niggas\nWhat up Blood? What up Cuz?\nThey don't even know what 2Pac first album was\nShould I tell 'em Blood? (Nah, fuck 'em loc)\nMe and Kurupt three-wheelin' on the hundred spokes\n(Dash, brake, bounce and scrape)\nRun up on the '6-4, see the AK (Bang)\nLike Eazy (Bang) like Dre(Bang)\nLike Snoop (Bang) in L.A (Bang)\nLike Crips and Bloods from now on\nWear a Bathing Ape hoodie get stripped in the club\nLike a bitch in the club, watch him strip in the club\nYou like ice creams? Get a banana split in the club\nNo jewelry, you can't wear shit in the club\nAnd that go for every nigga and bitch in the club\nSo you better take it off 'fore you get in the club\nGame and Dogg Pound along side sittin' on dubs\nRemember that\n\n[Chorus: Game, Kurupt & Daz]\nYou got them funny ass colors on, take it off\nIf you in the club with ice on, we takin' off\nThought you was a gangsta nigga, you better shake it off\nDo what? Sh-sh-shake it off, or get banged on"}]}