{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro: Wrekonize]\nYup, I know alot of yall' been wonderin'...\nWhere is Paradise?\nBeen thinkin' that too...\nBut as the years pass by I started to realize...\nIt's to be created\nThere's nobody else that could do it but you\n\n[Verse 1:]\nBack when I was just a little kid trying to get a grip on this big world with my fingertips\nI was ignorant to the viciousness\nOf a human being being dissonant\nMomma always taught me kindness\nTreat em' just the way you wanna be\nKept my friends covering my back\nKept my enemies right in front of me\nKept an eye on the prize, eye to the line, nope, I don't wanna drown\nOh it's killing me this negativity, and now it's tipping me I'm going down\nSomebody help me, please help me\nGot no money but I'm feeling wealthy (Nope.)\nNo Insurance but I'm feeling healthy (Nope.)\nI'm just trying to play the hand they dealt me (C'mon!)\nFew players at the table folded, couple others went to do they own shit\nI don't judge 'em really I still love 'em\nI just hope they find a world that truly coats them\nCause this rock is beaten up and broken, by the promises that we've been hoping\nStay golden, and unfrozen, until we finally get to find the quotient\nYou got answers? (You got answers?)\nWell I got questions (Well I got questions.)\nIs this banter? (Is this banter?)\nOr is it lessons? (I don't know.)\nA lot of evil cats running round without a bit tact or discretion\nI'm trying to climb a little higher up to get the blessings\n\n[Hook]\nEvery time I come down, I'm trying to find some high ground\nHigher Ground [x2]\nEvery time you're around, you make me feel like I'm bound for higher ground\nHigher Ground\n(Higher!)\n\n[Verse 2:]\nBut the views obstructed, seen 'em smiling but I never trust it\nWhat a way for human beings to function\nWhat fuck shit, to be stuck with a bunch of people that we ain't grew up with\nTrying to pretend, that we'll be friends, but they actions speak a different gumption\nYou got a phone, don't ya know the code broseph?\nYou could just reach out once in a while\nTo get the tone know this ain't a drone blowin' a bunch of smoke out on the river Nile\nMan with friends like these I'm glad to have a woman like I do to hold me down\nIt's her and I against the tribe I don't abide I never needed to fit in the crowd\nSo get climbing out into the vibrant miles of sky we like to call the higher sound\nAnd find a person you can fly with and keep an eye for those who tryna circle round\nAnd just breathe\nSometimes I bite my lip until it bleeds\nSee, this is just a message for my inner messes buried underneath the pounds\nSeeing all these people know me I'm still lonely\nHomie I'm just here and wondering how\nAnd when I'm happy evil thoughts get at me still they pull me out into the deeper shroud\nI wanna leave it all behind so when you look you'll find me up on the higher ground\nHigher ground\n\n[Hook:]\nEverytime I come down, I'm tryna find some high ground\nHigher ground [x2]\nEverytime you're around, you make me feel like I'm bound for higher ground\nHigher ground\n(Higher!) [x2]", "title": "Higher Ground", "year": "2017-05-05", "album": "Into the Further", "image": "https://images.genius.com/6f3dc8fd85f67bd995f87b15cb9bb3a1.1000x1000x1.jpg"}]}