{"songs": [{"year": null, "image": "https://images.genius.com/f85c1a562a0a260e061aa6a73251d4ef.1000x1000x1.jpg", "title": "Breathe Again", "album": "Monsterifik", "lyrics": "[Chorus: Irv Da Phenom and Big Scoob]\nI just want to breathe again\nCan you help me breathe?\nI just want to breathe again\nCan you help me breathe?\n\n[Verse 1: Big Scoob]\nGun and knife in my hand, jumpin around\nThe crowds getting loud, getting wild\nYou on a power trip, [?]\nIt was lightning in a bottle, it was misery shown\nWe was hotter than them other niggas, right from the start\nMe plus the gutter, one for the heart\nScreamin with my villains livin, that was the way of the art\nReal vision in prison, now we wanted the doe\nIndependent but we get it, the spearet of hope\nWeed dealer switched to the hustle game, tryed to be dope\nTook our muscle, we could finally use it\nTake the pain and the struggle, put it into the music\nAll my dogs on the stage, while I'm roc\nPour the liquor, gutter picture coming of age\nIn the hood it's understood, so it's finally good\nShows on froze, all back in the hood\n56 to 57, crowds screamin it loud\nGutter villains out of misery, we doing it proud\n\n[Chorus: Irv Da Phenom and Big Scoob]\nI just want to breathe again\nCan you help me breathe?\nI just want to breathe again\nCan you help me breathe?\n\n[Bridge: Irv Da Phenom]\nIt's been so long\nLong since I felt so alined\nI was gone\nThere's something missing all my life\nAnd when I think about it now\nI sware I finally lost my mind\nI need your help so I can breathe again\n\n[Verse 2: Big Scoob]\nStill trippin [?]\nStrange Music, Tech a N9na signed them goons\n[?] some ribs\nAin't no faking, ain't no acting, just the life I'm living\nI've been hustlin, I've been strugglin, I've been fightin for life\nAin't no feeling like the feeling when you rockin the mic\nOn stage with my dogs, actin a fool\nWith the crowd actin wild, following sute\nEvery word hit a nerve, it's a thrill to be heard\nUsed to surve on the kirb, gettin money for birds\nNow I'm feeling like a bird, just learning to fly\nGutter living, gutter villain, found my place in the sky\nGive my all to this music, all I know is the truth\nI'm different how I live it, I'm so raw in the booth\nLet my fans get the best of me, my heart on my sleve\nWhen the industry rejected me, I could hardly breathe\n\n[Chorus: Irv Da Phenom and Big Scoob]\nI just want to breathe again\nCan you help me breathe?\nI just want to breathe again\nCan you help me breathe?"}], "artist": "Big Scoob"}