{"songs": [{"lyrics": "[Intro]\nThe ritual goes, same window, different visual\n\nWing of wax? Or wing of gold leaf? Choose one\nFloat or plummet 20,000 cold leagues\nMy nourishment's provided in the summer\nSo then I wonder how y'all chasing dreams when what's tangible still outruns you!\nHail dirty doll immaculate performance\nWarm as the march of a billion torches forward to burn what I'm born in\nCut and paste alertness to current settings provided quick\nShimmy the pirate ship mass, spot the island, sound the siren\nAnd about face\nLet's salute the embraced pertinent generals\nWho turned innocent hermits to burning spectacles\nFlirtin' with a serpent working overtime, drain the battery\nSiphon the poison to flood his majesty's hatchery\nI was riding on a yellow bus to where the brush thickens\nAnd it ain't exactly plush pickings\nI'd rather take the time to burn every last bridge\nI've ever crossed beneath the sun\nThan live my life knowing you may one day follow me over one\nSnake bite, breath too heavy to hold\nCaught up in the wake of the red witch trying to swim it\nRan for the sake of dead cliques stripped of idyllic image\nSteal a sloppy earth meal\nFeed my pottery wheel to model colossal vision\nThrill, trucking with a bucket of pennies\nI'm 'a drag my sneakers through the dirt like alligator bellies 'til the cloud burst\nHonor and a loud thirst submersed in a trap\nLittle drummer boy vs. thunderclap\n\n[Hook] x2\nIn a city of garbage, trying to reap the harvest\nAdaption is the trap in which the artist meets the forest\nSwing your little ax or be an oak tree if you can't\nEither way; adapt to circumstance or play your final hand\n\nYou don't know enigma\nAn attempt to bury the hatchet rendered me victim of deviltry\nPlus wounded like stigmatics\nSomething's huffing hazardous\nI smell an inch of difference in this morning's pollution pistons\nAnd how the loose ends drifted\nMy sour patch institution slipped in amidst the invaders and pardon my tone\nBut this garden's grown fucking acres since my visit\nItching to count the layers in the blizzard\n'Til that chapter where my family inserts the dagger and twists it\nIt's a carnival\nHave you any sweets for my weary kin? It's a carnival\nHave you any feed for my cheery grin? It's a carnival\nWelcome, play our games, you'll never win\n'Cuz it's that carnival where every freak show spectacle's your friend\nAnd I'm a ghostly galleon tossed upon cloudy seas\nAnti-freeze to glacier, cookin' a look of fiery nature\nIt's the ceiling feeling too heavy to bliss the I-beams for a fraction more\nCollapsed and left 'I'm sorry' tacked to you door\nPitching my back to hell's kitchen\nBack burner murder machinery released regardless of the pardons\nHitching my life to the leash of one minstrel\nSick of same window different visual\nSame agnostic hostage different ritual\nPlague, cooperative super colony clash\nI heard you got a dust collection, lemme see it\nI duel as underdog vs. forced adaptation to the marvels of the now\nSince then, my knuckles haven't once dragged on the ground\n\n[Hook] x2\n\n[OUTRO] x8\nThe ritual goes, same window different visual", "title": "Garbage", "album": "Float", "image": "https://i.genius.com/097177ea52f6ad0147914b68157107a588f47fb2?url=http%3A%2F%2Fwww.mushrecords.com%2Falbum_art_front%2FMH202_D.jpg", "year": "2000-09-05"}], "artist": "Aesop Rock"}