{"songs": [{"year": null, "image": "https://images.genius.com/830988646a2380b0dc105fa3260156a9.700x700x1.jpg", "title": "Soundcheck", "album": "Otherside of the Game", "lyrics": "[Intro]\nYeah man, turn that up\nMy vocals is mad loud\nShould I turn this thing down?\nWe gon' get the mics right in this bitch\nC'mon man, get the monitor straight right here\nTwo two, yeah, yeah\nI'm feeling that right here\nThis one's good\nGet them levels popping, P\nYou know what I'm saying?\nThe song's going to be bananas tonight, man, for real\n\n[Verse]\nCock the hammer, shoot first mentality\nAnd you're a fantasy to us, a reality\nWhen it comes to the streets, I am the innovator\nWhile you're sitting down at Wendy's eating a baconator\nI keep my rhymes cool up in the refrigerator\nWhile you rock them baby rhymes spit from the incubator\nMy kicks is flavored up like the Now and Laters\nAnd I'll smash your think ass skull like it's a soft tomato\nYou got a switch in your walk like you's a hot potato\nAnd I'm serving hot lead like I'm the gangster waiter\nTwice as smart as you, I'm the great debater\nWhile I spit it from the streets, you's a perpetrator\nYou way lesser than me, you know that I am greater\nPlus you gay as hell trying to act straighter\nI'm loving my life while you remain a hater\nYou's a weak-hearted cat, need a defibrillator\nPreem take it way, slap the crossfader\nWhile I show these motherfuckers exactly what I'm made of\nWith the mind of a pimp, beef like a gladiator\nI bring life up to this game like a human resuscitator\nHit you and taser ya, then I rob you for your glaciers\nNow you're singing to the cops like Julio Iglesias\nCut up your body, scatter it in different places\nNow it's off to Aruba spending your big faces\nYou need some gangster shit, give me a call\nAnd I'll attack them all like a caged animal\nTomb raider, while you remain an agitator\nYo Sing, get the bags, let's meet up in Jamaica\nUh huh, uh huh\n\n[Outro]\nYeah, yeah\nThese mic is straight right here, P\nJust make sure when we come back to do the show\nEverything is like this\nYou know what I'm saying?\nSoundcheck is done, man\nI hope they got some good food in the dressing room\nI'm out of here\nBig Shug\nAha"}], "artist": "Big Shug"}