{"artist": "Wiley", "songs": [{"year": null, "lyrics": "[Intro]\nYo\nEskiboy, Tunnel Vision Volume 6\nYou know me\nHold tight the ladies\nYeah\nEskiboy\nYo\n\n[Chorus]\nI can remember when we first met (Yeah)\nYou was looking in my eyes from the table over there (Hello)\nI had just received my first cheque (First cheque)\nI was signed to XL but I had to move away\nI can remember when we first met (Do you remember?)\nYou was looking in my eyes from the table over there (I remember)\nI had just received my first cheque (First cheque)\nI was signed to XL but I had to move away (Yo, yo)\n\n[Verse 1]\nBrixton academy, it was me and Target\nPay As You Go\nYou were sitting on the table with Ms Dynamite\nMe and Maxwell was rolling\n[?], Ace, Geeneus, Slimzee\n[?] in Prada shoe\nYeah, we first met (Then you'll be yours)\n\n[Chorus]\nI can remember when we first met\nYou was looking in my eyes from the table over there\nI had just received my first cheque\nI was signed to XL but I had to move away\nI can remember when we first met (We first met, yeah)\nYou was looking in my eyes from the table over there (Table over there, yeah)\nI had just received my first cheque (Do you remember?)\nI was signed to XL but I had to move away (Hello, yo, yo, yo)\n\n[Verse 2]\nAnd that weren't the first time I saw you\n'Cause a year later, man had a booking\nDriving up to Holloway Road now like 'get to the booking'\nGet on stage, doing the ting now\nAll of a sudden, I like, I sight you over there but\nI weren't sure if it was you though\nBut then I look back though and I said\n\"You know what? That is her\"\nAnd you know what? The first time, I left it\n\n[Chorus]\nI can remember when we first met (Yeah)\nYou was looking in my eyes from the table over there (From the table over there)\nI had just received my first cheque (First cheque)\nI was signed to XL but I had to move away (Ooh)\nI can remember when we first met (We first met, ooh)\nYou was looking in my eyes from the table over there (From the-, from the table over there, yeah)\nI had just received my first cheque (Do you remember [?]?)\nI was signed to XL but I had to move away (You remember)\n\n[Verse 3]\nSo like, the next time I saw you was like the same place\nBut it was the next booking\nSo when I walked in like, I thought \"you know what? It's time now\"\nI've seen her like three times now, it's definitely time\nThen one yout come up to me and said \"yeah, bla, bla, bla\"\nSo it looked like, we both recognise like, what was going on, innit?\nAnd it all went from there, really, you know what I mean?\n\n[Chorus]\nI can remember when we first met\nYou was looking in my eyes from the table over there\nI had just received my first cheque\nI was signed to XL but I had to move away\nI can remember when we first met\nYou was looking in my eyes from the table over there (From the table over there, yeah)\nI had just received my first cheque\nI was signed to XL but I had to move away (Had to move away)\n\n[Verse 4]\nThe next day though, you was going up to Scotland, innit?\nSo like, we was talking on the phone, you told me to come up\nI made my way up\nAnd that was the very first date (Ooh)\n\n[Chorus]\nI can remember when we first met (First met, ooh)\nYou was looking in my eyes from the table over there (From the table over there)\nI had just received my first cheque (First cheque)\nI was signed to XL but I had to move away\nI can remember when we first met (First met)\nYou was looking in my eyes from the table over there (Table over there)\nI had just received my first cheque (First cheque)\nI was signed to XL but I had to move away\n\n[Outro]\nEskiboy, Tunnel Vision Volume 6\nYeah", "image": "https://images.genius.com/69962f266a3b134c548bf544c8c645de.700x700x1.jpg", "album": "Tunnel Vision Volume 6", "title": "1st Met"}]}