{"artist": "Andre Nickatina", "songs": [{"title": "Pimp Hop", "album": "Khan! The Me Generation", "year": "2010-04-20", "image": "https://images.genius.com/a40bfc48fac301c14baf8ed031c3f584.600x600x1.jpg", "lyrics": "(Intro)(hook)\nPop-pop the Gucci seal and pour up that fo'\nX8\n\n[nickatina]\nCHEEA, im dippin hella hard, man using all my credit cards\nAnd i dont show nobody where i live, its like a poppy farm\nIm grand theft auto, holdin on to a Hennessey bottle, somethin like Carlos Delgado, not the perfect roll model\nI like to hang with barracudas and them gun shootas that like to walk up in the club with mo gold then Rick The Ruler\nYou go and name the price. I like the sound of shaking dice. Always up in Vegas man, but especially when they have a fight\nI like the leather in my 500 S benz. Hangin with The Peoples Champ, a very well known Texan\nI like breakfast, all up into midnight. Ask me how im living and you can see its straight up city life\n\nIm straight gwaped up, man blade fresh and chopped up. Pimp hop is in affect, cause hip-hop is knocked up. (x2)\n\n(Hook)\n\n[paul wall]\nIm help. Leaning hard off them handle bars\nMarried to my Cadillac, man broke up with my foreign car. Riding with the top extract\nHigher then the planet Mars. inhaling this magical greenery outta lit cigars\nAlready you know the paper is stacked up, the pimpin is mac'd up. Broads wanna get shacked up. Haters better get back bruh, the strong arm is Shaq tough\nI ride with the trunk cracked up, my foes never clak up\nBack up on top, the paper is quite a lot. Please someone go and tell these haters to get up out my chop mayne\n\n[nickatina]\nI like to smack these edgey assholes like im Wile E. Cleaver. Comming out the dry cleaners, with magnificent gear. I parlay like its 3 a.m. at the Waffle House. Someone said it was a drought, then why we got our benzs' out?\nMy manicured nails got me on my paper trail. I can tell you bout my life its money, weed and pony tails\nIts like it never fails. You can see im in the crime, doing it since Melle Mell was rapping bout them white lines\n\n(hook)"}]}