{"songs": [{"title": "Back Jack Do It Again", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Intro: Sample]\nAgain and again and again and again\nDo it again, do it again\n\n[Verse 1: brandUn DeShay]\nUsed to be the one in trouble\nNow I'm in trouble when the beat is played\nI've got to bring my family to the Grammy's\nSo there's no goodbyes when I greet the fame\nWhen I'm bored, I play board games\nIf life's a game, that's surprising when you beat the game\nSome people try to tell me: \"Grow up\"\nBut I sit and play while they beat the stage\nI know it's my bed, I must lie in it\nBut I can't sleep when the sheets are stained\nThey say the streets are paved for gold\nBut those lost their way that the streets are paved\nI'm stuck at a crossroad\nBut who dare would cross roads when the streets are rage\nMy soul wants to fly free\nBut it's locked behind the, keyless ribcage\n\n[Chorus: Sample]\nAgain and again and again and again\nDo it again, do it again\nAgain and again and again and again\nDo it again, do it again\nAgain and again\n\n[Verse 2: brandUn DeShay]\nLong drives calls for dashboard confessions\nLearn that you're a student, teacher's life lessons\nYour mental health, kid, that's what's in question\nKeep acting obscure, and you'll keep them guessing\nSometimes, I feel like sin is a blessing\nThey need the naked truth, so I'll keep them dressing\nI wonder if she'll ever get the message\nYou can make mistakes, without making messes\nBad relationships end in exes\nOh, I guess there's no more hugs and kisses\nI bet a lot of people didn't get it\nSometimes, less focus can help you see the image\nWhoever said the sky is the limit\nMust have never seen the stars, how could you forget them?\nSeashells play the shore if you listen\nBut with my senses, I can see what I'm listening\n\n[Chorus: Sample]\n\n[Outro: brandun DeShay (sample)]\nThey say home is where the heart is\nBut for all of those who are heartless, when do they address it?\n(Again and again)", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}