{"artist": "Iggy Azalea", "songs": [{"title": "Leave It", "lyrics": "[Produced by The Invisible Men]\n\n[Verse 1]\nFirst things first, I'm the realest\nDrop this and let the whole world feel it\nAnd I'm still in the murda bizness\nI can hold you down, like I'm givin' lessons in physics\nYou should want a bad bitch like this\nDrop it low and pick it up just like this\nCup of Ace, cup of Goose, cup of Cris\nHigh heels, somethin' worth a half a ticket on my wrist\nTakin' all the liquor straight, never chase that\nRooftop like we bringin' '88 back\nBring the hooks in, where the bass at?\nChampagne spillin', you should taste that\n\n[Chorus]\nStuntin', Ric Flair on yah\nMy stock high, blow the whole share on yah\nAye, gotta know that I'm prepared for yah\nTell me how you want it, I could leave it right there for yah\nAye, I could leave it right there for yah\nTell me how you want it, I could leave it right there for yah\nAye, gotta know that I'm prepared for yah\nTell me how you want it, I'mma leave it right there for yah\n\n[Verse 2]\nI said baby, I do this, I thought that, you knew this\nCan't stand no haters and honest, the truth is\nAnd my flow retarded, each beat dear departed\nSwagger on stupid, I can't shop at no department\nAnd get my money on time, if it ain't bout money, decline\nAnd I swear I meant that there so much that I'll give that line a rewind\nSo get my money on time, if it ain't bout money, decline\nI just can't worry 'bout no haters, gotta stay on my grind\nNow tell me, who dat, who dat? That do that, do that?\nPut that paper over all, I thought you knew that, knew that\nI be the I-G-G-Y, put my name in bold\nI been workin', I'm up in here with some change to throw\n\n[Chorus]\nStuntin', Ric Flair on yah\nMy stock high, blow the whole share on yah\nAye, gotta know that I'm prepared for yah\nTell me how you want it, I could leave it right there for yah\nAye, I could leave it right there for yah\nTell me how you want it, I could leave it right there for yah\nAye, gotta know that I'm prepared for yah\nTell me how you want it, I'mma leave it right there for yah\n\n[Bridge: Skeme]\nNow tell me how you want it, and tell me how it feels\nWhen you ride with the queen in the fast lane, makin' fast change\nBaby, uh, for real though\nNow let it, pour that, leave it right there for yah\nSo now you ain't scared, are yah? Still down for me\nI'm on the go, hope you bound to get around with me\n\n[Chorus]\nStuntin', Ric Flair on yah\nMy stock high, blow the whole share on yah\nAye, gotta know that I'm prepared for yah\nTell me how you want it, I could leave it right there for yah\nAye, I could leave it right there for yah\nTell me how you want it, I could leave it right there for yah\nAye, gotta know that I'm prepared for yah\nTell me how you want it, I'mma leave it right there for yah", "image": "https://images.genius.com/76f39b66b2b431165a5f0061f648d4b2.1000x1000x1.jpg", "album": null, "year": "2013-12-05"}]}