{"songs": [{"image": "https://images.genius.com/8affb1996586e96bdd142d670fe19c74.500x500x1.jpg", "album": null, "title": "Warm Up Session [SBTV]", "lyrics": "[Intro]\nListen, fuckin...\nLook, cool\n\n[Verse]\nMy life's hectic, I just went from rapping for expression to chats with Jamal Edwards and I'm just getting started\nI couldn't quantify my vision nor explain my hardship\nWhile we come a long way from Tenison's and Brixton Market\nWhere do I begin? I'll start just after my brother's case\nWhen the judge threw him life I swear it still hasn't touched my brain and that will come with pain, travel in that thunder rain\nGrindin' when that summer came, we bagged and tagged a hundred eighths\nAnd I started shottin' I'm not a gangster I won't tell you lies\nI've been dead and alive from football to peddling white\nMy school excluded me for minor crimes\nI grind for mine\nMy group went 20 to 5, investing in semi's and nines\nTeachers used to love me, Rapz & Jussy, we went from Lucozade's to ah, that's the good, the bad, the ugly\nI couldn't tell you 'bout a light offence, quiet in Year 9 and 10\nWith a flick shank in English like this life is 'Of Mice and Men'\nI could feel myself changing, as I started ageing, my mind started fading, and my back started aching\nYear 11 fought depression popping pills inside my lessons\nYes I smile but I was stressing, music's such a blessing\nSo much spare time, I put that music in my plan\nI taught myself to play piano, I put that music in my hands, then I lost her to diabetes man I do this for my gran\nIt's better yet, I never said that I do this for my Dad but I do\nI do this for my older brother too, it went from us seeing Chris to me and Mum seeing you\nNow two brothers in the prison that had me feeling the next way\nWhy? Cos word to God my g died on the next day\nImagine tryna' bang your music, but them channels, they were clueless that you're broke beyond your wildest dreams, TT's used to shout 'em fiends\nAnd [?] needs the food, so that message was an SOS on SMS\nIf he's acting we clap 'em like SFX\nGirls call me a waste of time, cos I ain't tryna' make her wife or go on dates, but if you think about it them girls are wasting mine\nI need a stable mind, drop me out your useless beef\nI just spent a grand on cab and then I spent two on teeth\nAll I wanted was some words of wisdom, guidance and the love is real, all them olders showed me how to do is steal, sell drugs and kill\nI came to them with problems, and they encouraged me to touch the steel\nI said I needed P's they tried to send me cunch, it's fucking real that\nThem niggas think they're putting on for you by buying chains\nTry and send that gold, to a mum that has to buy a grave\nTry and send that silver, to a prisoner that's riding eight\nA prisoner that's riding ten they ride on us we ride on them\nWe ride and miss we ride again\nThey wonder why we're rago, my generation's plateau'd, we had burners from young like Alexandre Pato\nThem niggas couldn't come my yard, so why'd you think my younguns up-front, like Huntelaar\nRunning errands like I had three feet, I've been tryna' get my mum a yard\nFeeling like I can't breathe, life in South London's hard\nI think back I should blaze 'em fam, niggas try to claim me\nWhen I couldn't put in for a pizza, dem olders they wouldn't pay for man\nMy dog's have got rabies fam, see that yout'? Raid his gaff\nWith a rusty ready to send her son to God like Abraham\nDen manna don't speak to them, and I ain't got beef with them\nI just keep my moves in house like 120 bpm\nAnd blacks are the richest, but we mis-manage riches\nWe have gold, oil, coal and earth and we ended up the victims\nMost Arabs and Jews, inherit land, riches or property but as a black in South London I inherit madness and poverty\nThey won't teach you how to get a job, but they teach you how to use a stick\nLeave school, sell food, make p's, you know the usual things\nTill' you're eighteen with ten grand and now you don't know what to do with it, and your donnies they want a chunk of it, so now you let a Luger spit\nI never came from a broken home, system came and broke my home and now my bro's are sitting in cells, like chromosomes\nI hope the dough, don't tear us apart, but I know the roads, I know my bro's got love for me I love them back I know the code\nBrother would you ride for me? Or are you like these lying guys who say that they're the starscream, but when they see the iron hide\nBrother would you check me on my birthday and grind on my worst day? Or was all this a lie, in the worst way?\nWould you kill me for a million?\nWould you turn me for the p's?\nWould you lead me to die, if I got burnt in the beef?\nAnd if my name got tarnished, would you disown me for the roads?\nOr would you roll with me regardless 'cause you know that we are bros?\nListen, brother would you ride for me? I ain't asking you to ride for shit\nThe roads are for these hyped up pricks, a couple man have died for this\nYeah...", "year": "2015-11-12"}], "artist": "Dave"}