{"songs": [{"title": "Nor’s First Song", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Intro: brandUn DeShay (sample)]\n(Hold it now!)\nAlright\nShould be real simple now\nOf course\nJust\nYou already asked her out\nSo sit in the movie with her\nSay hi, say something nice\nKeep your hands to your pockets, man\nOkay, here she comes\n(Hold it now!)\n\n[Verse 1: brandUn DeShay]\nI usually think I’m the coolest, but now I think I’m the loser\nIt’s obvious that you knew this, but here we are at the movies\nI didn’t think I could do this, went into this kind of clueless\nBut what the heck? I’m trying to live my life out to the fullest\nBut now it’s like, I’m trying to live my life out like a Buddhist\n‘Cause I ain’t saying a word, but be one with the ruler\nAnd all that I really know is that you’re living, no rove\nAnd you’re not into the guys that rock the bullets\nI’m at the end of the road, you’re two seats to the right\nI should be sitting next to you, but it’s all on me\nI don’t want to walk to the lows, I had to walk on my toes\n‘Cause I think you might be a little taller than me\nBut yet and still, I feel like there could really be a chance\nIf I could turn from my friends and give you a chance\nLooks like I’m gonna end this hype with my face in my hands\nHow to sneak a cue from Cupid, but nah that nigga is stupid\nI’m sorry, I left before the credits could fly\nWalked out of the movie theater and didn’t say bye\nI couldn’t believe that I choked like I was some number one fan\nCouldn’t even say “good night”, I just grabbed my friends and ran\nSo much for future plans, us building castles in the sand\n‘Cause now it’s all over and I won’t get another chance\nDamn, now I’m on my way home\nThat’s when I got a call on my phone\n\n[Verse 2: brandUn DeShay]\nShe says, “You might not be the coolest, but I swear you are the cutest\nAnd I really like your music, I heard you on MySpace\nD.O.A. really almost brought tears to my face\nAnd I bet you were probably just giving me my space\nWhen you sat so far, I could tell that you were nervous\nSo better than you try to touch on me like a pervert\nBut that was kind of rude, how you just walked out\nIt’s bad enough that you didn’t have nuts to talk about\nWell, don’t beat yourself up ‘cause I’m not that mad\nBut this really was the most awkward date that I had\nYou lost a few cool points, but I got a few for ya\n‘Cause you remembered that my name was Nor and not Nora\nYou remembered the fish and the dog that I have\nDr. Pepper is my fave and I love slow craft\nSo with that said, it’s getting late\nCall me tomorrow around eight”\n\n[Outro: brandUn DeShay (sample)]\n(How you feeling right now?)\nI feel like… a million bucks\n(Is y’all there?)\nOh, I’m here\nI’m ready to go\nLovely\n(How you feeling right now?)\n(Yeah me too)", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}