{"songs": [{"album": "Route of Evil", "year": "2012-06-25", "title": "Route of Evil", "image": "https://images.genius.com/49699219c57f3d579fccb266aff48aad.442x442x1.jpg", "lyrics": "[Intro]\n\n[Verse 1]\nI'm hella inconsistent when it come to some bitches this A.K.A fuck me over I'ma fuck some of her sisters\nAnd this shit's already twisted 'cause I fucked some of her sisters, I opened it up, dicked in, and I stretched it like a gymnast\nShe said she wanted to end it 'cause she wants us to have friendship, she said that via text and that's hell of a way to end shit\nAnd then I felt silly 'cause I let Siri read it to me\nIt's a bad feeling inside my tummy put some loud to it\nExpress my pain through my music, let the crowd do it\nThey all like my style because I'm wild foolish\nI hit a bitch with a smile and tell her I'll do the honours of being your bone jumper\nUgga ugga, a caveman descended of slave damn, who used to grow that weed in the cotton fields nigga amen\nBrought my grandparents greats used to wake and bake, so for them, I'ma take a [?] to the face\nYou scrape, You scrape\n\n[Interlude]\nYo, what's good?\nOh so now you wanna answer the phone? Where the fuck have you been in?\nI've been waiting on yo' ass, where have you been?\nDon't even answer that 'cause I don't want a goddamn answer I'm over this shit now\nI was waiting on yo' ass last night, in the house, in the bed [?]\nFuck that, and fuck you, and fuck everything you're about, you ain't ever gonna be shit, you ain't shit 'till the day you die nigga your momma ain't shit, your daddy ain't shit, your uncle ain't shit your auntie ain't shit, your whole family ain't shit\n[?]\n\n[Verse 2]\nUh\nTypical night, invisible white, my visions entice my delights [?] the fucking lights\nAnd salt's getting thrown like rice after the invite\nSo the join of two beams you ain't feeling what I'm seeing so I'm leaving\nAnd I won't leave with no fucking demons, so I'ma place all my sins on the damn table, in front of God and whoever able to see the fables I created\nLies, imagination, and hatred\nDeath to making love, without really actually love making, faking it just to get you naked, flexin' and flakin'\nI'm a filthy nigga face it, but not just too complex to fuck with someone basic, That's a overstatement"}], "artist": "JID"}