{"artist": "YG", "songs": [{"image": "https://images.genius.com/ba2a73211e21ff3e11eba91f3f156e9d.1000x1000x1.jpg", "year": "2014-03-18", "album": "My Krazy Life", "lyrics": "[Intro: YG]\nHey, hey, hey, hey\n\n[Hook: TeeFlii]\nAnnie, girl, let's play house\nAnd you can show me what that's 'bout\nGirl, nobody beat the pussy up like me\nWho you know that beat the pussy up like me?\nGirl, I'm gonna lay you on your back\nBam-bam, beat it like that\nI'mma do it to ya, do it to ya\nI'mma do it to ya, if you, if you let me\nGirl, I'll do it to ya, I'll do it to ya\nGirl, I'll do it to ya, do it to ya\nEat it, beat it, bang like ah!\n\n[Verse 1: YG]\nI know you had a long day baby, I know!\nThe 9 to 5 shift probably seem like all day baby\nYou 'bout your money so you're probably working overtime, huh?\nCause that minimum wage just ain't enough\nLong as you're getting it, more power to ya\nMake a nigga that got it wanna to give it to ya\nLong as you're not sitting up on your ass\nThat'll make a real man say hallelujah!\nYou got a son and you're raising him by yourself\nYou need a real one in your life\nIt ain't no probably, it's obvious that\nYour baby daddy didn't do you right\nI got a mama, girl I know how to treat a woman\nI like dessert, girl I know to eat a woman\nLay with it, then play with it, I beat it up\nI know I'm sinning but before I eat it I'll say my grace in it\nWhat?\n\n[Hook: TeeFlii]\nAnnie, girl, let's play house\nAnd you can show me what that's 'bout\nGirl, nobody beat the pussy up like me\nWho you know that beat the pussy up like me?\nGirl, I'm gonna lay you on your back\nBam-bam, beat it like that\nI'mma do it to ya, do it to ya\nI'mma do it to ya, if you, if you let me\nGirl, I'll do it to ya, I'll do it to ya\nGirl, I'll do it to ya, do it to ya\nEat it, beat it, bang like ah!\n\n[Verse 2: YG]\nI'm going down on you first\nThe real definition of down to earth\nI ain't the one you ask to buy you a purse\nI'm the one to make your insides hurt\nFrom the back with your face in the pillow\nFrom that position I know that you can only take a little\nBut missionary she can take the whole thang\nIt's so good I have her screaming out my government name\nAnd she ain't never got to tell me how she want it\nI'm a real one baby, I'm already knowing\nShe said her nigga's shit's weak\nCause he ain't make her nut and they was fucking 'til the morning\nYou know it fire when she's telling you to nut in her\nBut I'm a nigga, I'm thinking something up with her\nI know the homies might think a nigga's krazy\nBut you could fuck around and have my first baby\nWhat?\n\n[Hook: TeeFlii]\nAnnie, girl, let's play house\nAnd you can show me what that's 'bout\nGirl, nobody beat the pussy up like me\nWho you know that beat the pussy up like me?\nGirl, I'm gonna lay you on your back\nBam-bam, beat it like that\nI'mma do it to ya, do it to ya\nI'mma do it to ya, if you, if you let me\nGirl, I'll do it to ya, I'll do it to ya\nGirl, I'll do it to ya, do it to ya\nEat it, beat it, bang like ah!\n\n[Verse 3]\nI said face down ass up\nThat's the way we likes to fuck\nDo my dirt on the low\nThat's the way shit's 'sposed to go\n\nBut I be tryna hit it right at the wrong time\nI said it's yours, you say it's mine, Shit we both lying\nWe both tryna 69 and some more time\nMy girl tryna FaceTime hitting both lines\n\n[Skit]\nMeanwhile, while YG is fucking his side bitch\nHis main bitch is creepin' on the low\nTypical nigga shit!", "title": "Do It To Ya"}]}