{"artist": "C-Rayz Walz", "songs": [{"title": "Balance", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Intro: Sample from [?]]\n[?]\nYou force me to use God’s skills against you\n\n[Verse 1: C-Rayz Walz]\nBrothers will ice pick you for a food stamp booklet\nI walk a straight path, smile crooked\nFiends in the Alley like Bookman\nThe good times seem so gone when you stand over caskets looking\nOut of boredom, I taught myself to make bombs\nI learned that hot lead keeps the snakes calm\nIn the killing fields, I’m strapped with the 23rd Psalm\nAlert when the trees blazed like the Viet Cong\nDirty street signs make me want to release 9s\nAnd flash middle fingers instead of peace signs (Please, please)\nKeep a swan at a distance—the beef closing\n“Dressed in all black like The Omen” - Lil' Kim on Puff Daddy's \"It's All About the Benjamins (Remix).”  Head swollen\nThe results: dice rolling, running wild, mouth foaming\nControlling this land slowly, clips on and still showing\nThe fear, son?  Might get the point from a spear gun\nMy Jackets is Full Metal—you wanna wear one?\nMind state in a place (Come on) where the great dare come (Come on)\nMy mind state in a place (Come on) where the great dare come (Come on)\n\n[Hook: C-Rayz Walz]\nI tote L’s, polly on life and death\nI can’t be alright/all right (Why?)—there would be no left\nDeal equal—bring new life and kill people\nYou gotta be good when it’s evil\nMake liars believe you ‘til blind people see through\nDeaf heads heed you, gun tongue speak truth\nI tote L’s, polly on life and death\nI can’t be alright/all right (Why?)—there would be no left\nDeal equal—bring new life and kill people\nYou gotta be good when it’s evil\n\n[Verse 2: C-Rayz Walz]\nThe cypher’s ill—go hold your seat on a Ferris wheel (Watch out)\nBalance the scale.  The other day, I did something ill for real\nAte pork then drank spring water distilled\nThings switched up—bubblegum feet stand still\nI’m the last piece of love in your heart\nThe anger dark from the start\nBig-puzzle rap—I’m just playing my part\nI write light to escape the dark, but it’s still here\nI don’t give a fuck, but I still care\nGreedy ones share riches, stairs become stitches\nDepicting vision—I’m getting better at the sick shit\nSome say I got the illest, most nasty flow\nBut I’m the sun—you don’t have to gas me, yo\nI ship kis/keys, mail Swizz Beatz a Casio\nGet serious, in fact, like Jim Carrey jokes\nDo the knowledge, inspect my truth—I’m sincere\nThe shadow of the circle is a square\nSo I don’t care if your brain is pierced with purple hair\nI’m from the essence.  Be easy or you’ll get sent there\n\n[Hook: C-Rayz Walz]\nI tote L’s, polly on life and death\nI can’t be alright/all right (Why?)—there would be no left\nDeal equal—bring new life and kill people\nYou gotta be good when it’s evil\nMake liars believe you ‘til blind people see through\nDeaf heads heed you, gun tongue speak truth\nI tote L’s, polly on life and death\nI can’t be alright/all right (Why?)—there would be no left\nDeal equal—bring new life and kill people\nYou gotta be good when it’s evil\n\n[Verse 3: C-Rayz Walz]\nKing in the ring on some diamond shit.  Rhyming quick, I switch directions\nSome lust, self-combust—just read expression\nMajor league, make it hard to breath, bloody your fatigues\nStudy your sneeze and think how I’ll bless you—“Degrees”\nIn the morning, I choke L’s, then brush my teeth\nFuck fighting—most heads get snuffed with heat\nThe killing fields.  Unconceal plots for real\nBlocks is hot like the average cop shot plot\nIn junior high, my people brought guns to school\nFuck the rules—the mentality was “Buck the blues!”\nAnd don’t get suspending blowing smoke, burning incense\nSome got married to a life sentence—no repentance\nThe murder incidents is endless, death is business\nThe best defense is the fences.  No coincidences\nBastards classic like Vlasic Pickles\nBad habits get you blasted with massive missiles\nIf cash is the issue, in the grave, stash it with you (Take you)\nUnder that stone with your first, middle, and last initial\n\n[Hook: C-Rayz Walz]\nI tote L’s, polly on life and death\nI can’t be alright/all right (Why?)—there would be no left\nDeal equal—bring new life and kill people\nYou gotta be good when it’s evil\nMake liars believe you ‘til blind people see through\nDeaf heads heed you, gun tongue speak truth\nI tote L’s, polly on life and death\nI can’t be alright/all right (Why?)—there would be no left\nDeal equal—bring new life and kill people\nYou gotta be good when it’s evil"}]}