{"artist": "Abstract Rude", "songs": [{"lyrics": "[Verse 1: Riddlore?]\nI'm a Blowedian but I'm trotting the globe as it spins\nPlotting my course down the road as it spins\nOutlaw from the Wild West like I should be on Horseback\nGettin' high in the saddle while I ride to the battle\nGettin' live like the ammo when the hammer strikes the pin\nRhymin' Riddlore? strikes again\nNo water for your garden will have your pansies dying\nFor blowing it on the mic like dandelions\n\n[Verse 2: Ellay Khule]\nGrew up as a LA kid, struggled through this Cali culture\nServed em up by the ton so you know I kept a fatter quota\nI am the master Yoda but you in a bad position like yoga\nPuffin' on some doja, crushing like a bulldozer\nShould have listened when I told ya, now I spit like a cobra\nI'm Ellay Khule or Rifleman so fuck what they told ya\nGeneral from the Life or the Blowed when I'm on that Hip Hop Kclan shit\nGood life bullies are the crews that I ran with\n\n[Verse 3: Shames Worthy]\nName's Shames Worthy but you probably know Raphi\nFrom the Good Life or Blowed from the early years I suppose\nThat's where I paid dues, before my crew made moves\nIt was all about the stylin' and servin' fools\nI wrote my first raps on Pico & Fairfax\nLinked up with the LPG and started the Tunnel Rats\nSome other cats would laugh we made our own path\nI'm a shooting star travel so far with an 8 bar paragraph\n\n[Verse 4: Gel Roc]\nOriginal Gel Roc, Life Seen Differently\nEX2, don't forget Mass Minsitry\nUnderground rap kings yes the epitome\nIf y'all don't know, this yo epiphany\nNo future in yo' frontin' when you recognize history\nVillains no sympathy, never been busier\nThe output is linear, my outlook is grittier\nFrom LM to Whittier, y'all just shittier\n\n[Verse 5: JRoz]\nThey see me on the street and they go\n\"JRoz I remember you back from the Blowed\nSpittin' in the cypher twisting up a optimo\nPiecing in my black book so when's your next show?\"\nTell em go check the website, might catch the next flight\nKeep the text at the pen write tight like left right\nSleep on Abstract, that's a rude awakening\nMy dude's home weighing things I'm doing my lady things\n\n[Verse 6: Brandi Kane]\nSuper California-istic super collab\nSuper sick with it, who is this chick? Who is that?\nIt's them Project Blowedians, act like you know me bitch\nShout out to them flows we kick and the out of town shows we did\nAnd all them MC's murdered that don't exist\nResting in they own piss, yeah go on poor a sip\nThey done forget the pump at your front door\nNow you unsure blood clot, they don't want more\n\n[Verse 7: Jizzm]\nWe're ancient alien b-boys transforming into dinosaur mode\nAbstract underground fossils you can find us at the Blowed\nHeating MC's up, heating up when times are so cold\nLeading them up, eating them up machete slice em with a flow\nWe stay ready, they all deadly illosophic merciless medley\nIs holding steady, life's too short to sweat the petty\nThe throne was heavy, wimpy whip a can out don't ask me for a handout\nLike herpes on your thumb and you can stand out\n\n[Verse 8: Self Jupiter]\nCadillac Coupe Deville em, been chillin like a villain since \"Top Billin'\"\nThat \"hippy to the hippy the hop\" feeling\nKill em off, convertible soft ceiling\nMorbidly obese black Matt Dillon\nWhen I tell you I'm one of the best that ever did it, I'm not kiddin'\nShocks go a little bit lower when I get in where I fit in grinning\nPrince Fielder on the mic in the 9th inning\nI walk off homie cause I like winning\n\n[Verse 9: Zumbi]\nDamn where's my heart at, where did I leave it?\nThey call me constant can't fucking believe it\nOr maybe it's nonsense, I'm being facetious\nPuffin' the reefer still stuck in the speaker\nDeeming me conscious marvelous content\nLooking in the mirror can't see if you haunted\nI'm after Marcus, still chucking a Ohm bustin' a poem\nAnd long after I'm gone I'm still moving the moon\nSun and the stars, that's who we are\nWhen I'm blessing a bar, my squad rep for God\nPeace to the Earths, seeking a birth\nThat's why I'm speaking in verse of what you feel is church\n\n[Verse 10: Myka 9]\nIt's all love it's my mantra, my vocal Merkabah\nMy choke hold hurts robbers, I told all of my obsessed\nHype show at my concerts like you info sponsored\nSo when you go bonkers off this song then bomb first\nI thirst for the unrehearsed verse that conquered\nThe warmonger found armor from the Dalai Lama\nThe dilemma that became our delivery I foundered\nThen I burn like the 23rd psalm, word to my mama\nI'm stronger more harm than Hood who's good living\nSo I stood in prison I should listen to the Good Book written\nLet wings emerge like birds shittin'\nSaint Myka, rhyme archangel splittin'\nThis trans dimensional veil of the game hittin' from ballers\nLike badminton all hail radio Good Life, Project Blowed\nThese MC's that been bitten but they gotta feed they children\nListen\n\n[Verse 11: Medusa]\nHow can I squeeze it all in?\nBefore I was Medusa with the hot damn pen\nThey call me Lady Tick Tuck for my pop locking\nBreakin' one radiotron, groove-o-tron, et cetera\nNot being cocky, but I only have 8 bars for moving on\nStepped from a cage S.I.N. to the Good Life stage\nAnd Stranger Inside is the film you can catch me on\nProject Blowed icon\nOn the bra strap many of these broads done dangled from\nAnd got a Grammy with Ozomatli to show you the type of shit I'm on\nYou seen me, rocking stage, dropping jewels for your seedlings\nNeed I go on?", "title": "Kan of Whoop Ass (TeamSupreme x Project Blowed Remix)", "image": "https://images.genius.com/253e884caab83020713e4ea5d108eba4.1000x1000x1.jpg", "album": "Keep the Feel: A Legacy of Hip Hop Soul", "year": null}]}