{"artist": "Fabolous", "songs": [{"year": "2015-11-26", "album": "Summertime Shootout", "image": "https://images.genius.com/7a5aea7c661ee0f8c16585c99ec86077.800x800x1.jpg", "lyrics": "[Verse 1]\nYo, I just got the new thing for the summer\nNow I need me a boo thing for the summer\nWe can kick it like Liu Kang for the summer\nYou can't tie me up though\nShit, I don't even tie shoe strings for the summer\nI just let 'em hang (yeah) like a new chain for the summer\nSpeakin' of I doubled the Cubans for the summer\nBlack girlfriend like \"Really, two chains for the summer?\" (really?)\nBut I done blew change on a few things that was dumber (really?)\nThat's why it's cash rules like it's Wu-Tang for the summer\nWith that said I might cop two things for the summer (oh)\nThey both gon' be blacker than Luol Deng for the summer (oh)\nAnd then I'm nicknamin' 'em Hussein and Osama\nThat's a Saudi and an Afghan, new slang for the summer (whoa)\nThat's the Audi and the Aston's new names for the summer (whoa)\nCup in my hand, it's D'USSÉ for the summer\nEvery night a dark night, I'm Bruce Wayne for the summer - Lord!\n\n[Chorus]\nSummertime shootouts, the wild west (uhh)\nBrand new kicks and white tees, my style fresh (uhh)\nTalkin' fly to every shawty walkin' by, she could get it\n(She could get it!)\nFor the summer but at least give me a weekend with it (yeah)\nSummertime shootouts, the wild west\nGive it up like a gun pressed to your sundress\nRunnin' game like the summer tournaments\nSmoke somethin', sip somethin' with a player on the bench - Lord!\n\n[Verse 2]\nIt's all or nothin' for the summer\nJust coppin', we ain't cuffin' for the summer\nPlaylist poppin', let it shuffle for the summer\nMe and this fly chick with a duffle for the summer (Lord)\nAss like a carry-on, marijuana marathon\nOn them nice Saturday's people be gettin' married on\nBut we just tryna catch the party, flip it like a spatula shawty\nGot bands, matchin' Carti's\nStrippers like the bachelor parties (ahh)\nI'ma butt smacker when I'm off the nutcracker (ahh)\nBarry Sanders on hoes, hell of a cut backer\nSlut back up, too much act up\nAin't no cash behind you, I got too much backup\nI mean paper keep comin', can't do nuttin' but stack it\nSwag too crazy, can't do nuttin' but jack it\nMy studio's a padded room, I'm flowin' like I had a shroom\nShould've dropped this for summer like the son I had in June, Lord!\n\n[Chorus]\nSummertime shootouts, the wild west (uhh)\nBrand new kicks and white tees, my style fresh (uhh)\nTalkin' fly to every shawty walkin' by, she could get it\n(She could get it!)\nFor the summer but at least give me a weekend with it (yeah)\nSummertime shootouts, the wild west\nGive it up like a gun pressed to your sundress, uhh\nRunnin' game like the summer tournaments\nSmoke somethin', sip somethin' with a player on the bench - Lord!\nLord, Lord, Lord...\n\n[Verse 3]\nAyo, L.A. for the winter, New York City for the summer\nGotta bring you with me, you too pretty for my number\nNo time for hopin' you call\nI mean girl you so dope I might go through withdrawal\nFall in love for the summer then elope in the fall\nYou ain't even gotta pack soon as they open the mall\nShe can hit it, she could get it, she could get it, yeah\nIt's too early for the title but feel like we committed\nIt's the B-K Nets games at the Barclays\nBustin' off in the bed, soundin' like eight-K's\nBrrrat, brrrat, brrrat\nAll up in it like 'where it at?'\nNever had a real one in your life, took care of that\nWhen you fuckin' with the gold chains on you hear that\nBling, bling, every time I hit it from the back\nBling, bling, fuck around and go another round ding, ding\nYeah that money got me on my Mayweather\nGoing for the winter at least until that May weather\nIt's too cold back home, I had to stay weather\nNever did this before, don't ever say never\n\n[Outro/Skit: Fabolous & Female]\nFab: Hey so um, what you doin' for the win'er?\nFemale: What you wan' do?\nFab: I don't know what you doin', You know I wanna take you to L.A. for the win'er\nFemale: I don't know what you're talkin' about, taking me to L.A\nFab: You know what I'm talkin' about. I'mma take you to L.A\nFemale:I don't know you. Where I know you from?\nFab: Look you ain' never had somebody that wanted you to be with them...\nFemale: No, I don't know you\nFab: Are you sure that you was good?\nFemale: No. This guy's crazy\nFab: See I know what it is,you ain' never had a real one\nFemale: (inaudible mumbling)\nFab: I ain't never had a real one til you", "title": "For the Summer"}]}