{"artist": "Fabolous", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/8e2843dcf4a386d5de04cd6e203899e1.391x391x1.jpg", "lyrics": "Wanna start makin some real money?\nYeah yeah\nGet ya money money f*ck them broke niggas\nGet ya money money f*ck them broke niggas\nGet ya money money f*ck them broke niggas\nGet ya money money\nNow I could ride through and scoop up a shooter\nI find a nigga that could spot a whore like a hooper recruiter\nThen I sit 'em on the stoop with the Ruger\nCause them groupie intruders'll\nRush ya spot like a group of them Lugers\nI got a one, two as super as Judah's\nFor them niggas thats *disturbing the peace* like the group who with Luda\nAnd I just met the connect who hit Snoop with his buddah\nSo I'm probably lookin as high as Jupiter to ya\nShorty say I'm cute, but in the coupe I be cuter (damn)\nExplain, she gives me brain like she Superhead's tutor\nOn another note, she like Betty Crock\nWith ready rocks\nGet pounds of that shit that smell like sweaty socks\nBut I did my share of choppin' and baggin'\nSwappin' and draggin'\nPoppin' the Mag in\nAnd gotta see to believe just stop and imagine\nI'm shoppin' with swag in\nPoppin' them tags in (yeah)\nI do alot of shit poppin' and braggin'\nAnd flip my middle finger as I hop in the wagon nigga\nI'm too fly for the hi and goodbyes\nAnd the hate is too obvious to try to disguise\nI keep my hand on my gun, my eye on the prize\nHigh as the skies\nNah pimp I ain't suprised (come on)\nI knew you would like it\nMaybe I'm psychic\nThought you would love it\nYou know they can't get enough of it (come on)\nAnd every verse was cold\nMy first one sold\nAnd as a matter of fact my worst was gold\nI'm as good as any rapper you know\nCapital -L capital -O capital -S capital -O\nYou rappin' too slow\nI laugh at ya flow\nI'm about ta force niggas go back to trappin' for dough\nAnd I grew up with the arm they be hatin' since knee high\nThats why me and Cain is like Payton and Eli (yeah)\nStrong like the Clitzgos\nBall like we crazy\nSplurge like skitzos\nYou see the way my shits froze (damn)\nAnd its hangin' off me like icicles\nI used to pedal hard but its not on bicycles (no)\nThis is way back when everybody would buy nickels\nNigga I was blowin' through them lincolns like the tunnel\n'97 3 quarter minkin' in the tunnel\nGod damn you got a nigga thinkin' of them bundles\nGet ya money money f*ck them broke niggas\nGet ya money money f*ck them broke bitches\nGet ya money money f*ck them broke niggas\nGet ya money money\nGet ya money money money\nGet ya money money f*ck them broke niggas\nGet ya money money f*ck them broke bitches\nGet ya money money f*ck them broke niggas\nGet ya money money\nGet ya money money money\nYou know what this is?\nDO YOU KNOW WHAT THIS IS!?\nChump change\nBut it belongs to me\nI don't care if its a million dollars\nI don't care if its a hundred dollars\nI DON'T CARE IF ITS 20 DOLLARS!\nWhen you take something thats mine\nYou spit in my face\nAnd it hurts me", "title": "Get Yo Money"}]}