{"songs": [{"year": null, "title": "Blow Up Da Spot", "image": "https://images.genius.com/53f16f1056910d3ec4e02bf056abbb6b.200x177x1.jpg", "lyrics": "[KRS-One] (Sadat X)\nYeah, KRS in the building now\n(Sadat X) JS-One, I had to be here man\nI had to be here man, Sadat X\n(I'm honored to be here with the Teacher)\nI'm on one knee right now\nKRS in the building!\n\n[KRS-One]\nLook, retire? Not yet! Out my fire? Not yet!\nYour skills higher? Not yet!\nYou wanna be called kings and 'siahs\nBut you sing for hire, you free? Not yet!\nFace the truth, but not yet!\nYou blazed the booth but you still ain't hot yet!\nNot yet! KRS rhymes next, I'm complex\nI came too far to drop bars for Sadat X\nBX is on the block yes, this the top set\nSome of them others are not yet!\nBut they act like they got the top rep\nClaiming king, but y'all ain't put a thing back into Hip Hop yet\nGot checks? We got pockets\nGot TECs? We got rockets\nYou got clubs, we got sockets\nYou got beats, we got topics\nCome in Sadat X!\n\n[Sadat X]\nSadat X and the teacher, it's a creature, a beast of burden\nEnergy exerting is few, cause rule is\nThe fool is shot with his own gun\nI'm up with the sun in the earliest\nIt's no more about the burners\nYou've seen The First 48, murder is rap now\nSo is smoking crack now, it's a new hustle, new gaffle\nYou can win a raffle and be a rapper\nShe's just telling the truth and you get mad and want to slap her\nI'm not a banger, never heard me with a real R&B singer\nI never had that, but I'm not mad at them tunes\nI've been through bitter cold Decembers and brilliant Junes\nBlack man hold your seed up to the moon like roots\nAnd let 'em digest these fruits, it's good to live on\n\n[Chorus: Notorious B.I.G. scratches by Rahzel]\n\"I blow up the spot\"\n\"I blow up the spot\"\n\"I blow up the spot with my man Sadat\"\n\n[KRS-One]\nYo, open up your eyes now\nEveryone talking bout crime now\nIt's like we going back in time now\nI'm ready to shine now, get mine now\nBut the more I climb now, I find now\nCats don't want you to rise now\nThey want to hold you back\nBy replacing the facts with the lies now\nBut watch the skills I apply now\nI'm gonna be +BIG+ but I ain't +Ready to Die+ now\nWhy mothers gotta cry now?\nCause some dumb ass kid now is believing in the lie now\nWhat's the lie now? The lie is you ain't gotta try\nCause everybody out getting high now\nWhy now? Cause you might see Chinese bombers\nFlying across American skies now\nMan, I'm telling you to rise now\nDon't worry about your size now, it's time to get wise now\n\n[Chorus]\n\n[Sadat X]\nNow I'ma show you charm and keep you away from harm\nAnd then I'ma throw you something on the arm\nI'ma show you pull, show you how to keep your calendar full\nWith show dates in Europe and the States\nEastern District, one-sixty-first, where the new Yankee stadium\nUse has built over the park, it only take a spark\nTo light the bomb, then I'm off to four Auburn or I'm\nPassing the Millbrook projects\nThe Nine Life Crew, one-five-two\nPark Avenue, Grand Pu' to {?}\nI'm a problem on all joints, I need all points I touch\nHad Rahzel do the Biggie chorus, we loved him that much\nSee Miss Jacob stayed on the hutch\nShe can't wait till I stop, she pop myself with the clutch\nSometimes she real tender to touch\nI stray, but she don't really hold no grudge\n\n[Chorus]", "album": "Brand New Bein’"}], "artist": "Sadat X"}