{"artist": "Ice-T", "songs": [{"title": "Dear Homie", "lyrics": "[Hen-Gee]\nDear Homie, whats the hap, since your up in the sky?\nWith God by your side\nHomie what's it like?\nI know your bein' treated right\nNo more worries\nPlus you're bein heard G\nI guess you know niggas is still trippin\nI don't know why, they see a future in it\nWe're headed for self-destruction\nCan't function\nOnly thing I can do is pray\nAnd thank God, for another day\nYes Homie, it's rough down here. I gotta watch my back\nCos it's hard being black\nIf it ain't the other\nIt's my own colour\nTryin to work me\nTryin to hurt me\nAin't no L-O-V-E\nPlease tell me why, Dear Homie\n\n[Ice-T]\nDear Homie, gang-bangin ain't joke\nAnd I'm lookin over ya loc\nAlways knew there was fools out to get me\nI didn't even hear the gunshots till after the slugs hit me\nI grabbed for my chest and my neck, hopin\nWhen my head hit the ground my skull busted open\nYou used to ask for my advice\nWell Dear Homie, dyin ain't nothin nice\nAnd the place I'm at is overpacked\nWith young blacks who crash crack and gats\nI can only pray\nYou don't come this way\nYou gotta stay alive, you got a kid G\nI feel ya partner but I worry alot\nBust shots\nI know you're tryin' to comfort me\nBut I don't want no company, Homie\n\n[Hen-Gee]\nDear Homie, even though you're gone\nI still fell your presence\nSometimes I can sleep\nCos I just can't see\nReality like it really should be seen\nI still reminisce on how we used to kick it\nStrollin' the yard, just hangin' out together\nDown for whatever, whenever\nAnd now I'm hopin, you're seeing a true friend in me\nWe where meant to be\n\n[Ice-T]\nDear Homie, you used to call me O.G\nNow ya really gotta look up to me\nCos the place I'm at, is way high in the sky\nI didn't want to die\nBut the life I lived was just to reckless\nToo many bad marks on God's checklist\nAnd many many brothers will go out\nJust tryin to get that hard-core street clout\nBut a street reps final test, is when you're lying in a coffin\nWith you're hands folded on your chest\nThen ya hear the girls cry\nThen ya hear the brothers lie\nTalkin' about how down you was\nThen the next week the back on the street, they cold forgot ya cuz'\nDon't wanna see ya on your back\nSo for me stay sucka free, cos you don't need that, Homie\n\nDear Homie...\nDear Homie...\nYa know I miss ya Homie...", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg", "album": "VI - Return of the Real", "year": null}]}