{"songs": [{"image": "https://images.genius.com/7600dcfbffef8659f06c125c84cacd41.947x947x1.jpg", "title": "Hands on the Wheel Freestyle", "album": null, "year": null, "lyrics": "[Verse 1: Nitty Scott, MC]\nIt ain't hard to tell, you trying to keep the mozzarell'\nWhile the whole damn game done gone to hell\nI dominate you like a dominatrix\nHate my greatness cause you clearly ain't this\nSend you on a permanent rap hiatus\nToo much noise, gotta change your muffler\nSuper Nitty, I'm a full-time juggler\nJuggernaut aiming for the jugular, yeah\nNow don't be trying to say you got your hands on the wheel\nJust because you got your little hands on a deal\nWhat'd you have to do to get your brand on the seal?\nMight look good, but you just not real\nMy flow raise eyebrows and the crime rate\nFull time is my motherfucking mind state\nSlim thang, but I got a big brain\nBig enough to know that these rappers never eating off of my plate\nI ain't show to your little cipher\nDamn right, bitch, cause I'm way more nicer\nThan all these little chicks on the hip-hop scene\nGot 'em gassed up like they popped them beans\nProbably think we got a whole lot in common\nRhyming for Gucci, rhyming for rhyming\nWhy? Cause we both got tits and a mic\nAnd making words rhyme is a thing that you like?\nHeard about your diss track, sorry that I missed that\nI would never identify you with a diss back\nHop in the booth and the past goes missing\nI passed class without the ass kissing\nPlay' em, spray 'em, slay 'em, man this shit is getting gory\nI will tell my fucking story before I let you tell it for me\nBitch!\n\n[Outro]\nHey, the name is Nitty Scott comma MC dot\nDon't forget the mother fucking MC\nHey yo, I see you niggas out there fucking hating\nSending tweets and shit\nSay that shit in my face\nI'm tired of this bullshit\nI've had some shit to say for a long time\nI'm tired of being politically correct, you feel me?\nStop trying to fucking classify me\nI'm a fucking human being, feel me?\nI'm not a fucking femcee, I'm an artist"}], "artist": "Nitty Scott"}