{"songs": [{"year": "2014-09-30", "title": "Deception", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro]\nAiyyo (what's up?)\nAiyyo this nigga Saigon ever tell you why he in here man?\n(Naw, naw, why that nigga here?)\nYo Sai', tell 'em why you up in here son\n(What you here for son?)\n\n[Verse]\nI had a lot of respect for her, lil' Erica\nSupposedly so sweet and now I regret that I messed with her (what happened?)\nAs I recollect I be wonderin’, “Was it reckless?”\nIf this happened to you, would you label this incorrectness? (tell me)\n'F' it, he ain't deserve to keep his light\nI remember E tellin’ me 'bout them sleepless nights callin’ on Jesus Christ (word?)\nHe also used to beat his wife—that's the reason she split\nBlames it on Erica, said that she'd never be shit (never be shit?)\nIt made me sick the way she asked if I could keep a secret\nSaid \"Sai', you all I want but not the only one I sleep with\"\nI'm thinkin’, “Freak bitch,” but she said, \"Naw, this is some deep shit\nI trust in you—that's the reason I'm tellin’ you—just peep it\" (what she said?)\nShe said \"Boo, I don't know what to do.  Since I was two\nPop touched me in places that made me feel so uncomfy (fuck him)\nHe said if I ever told a soul, he’d be my Lord\nAn agent over the course, he forced me to havin’ intercourse (fuck that)\nNo, I ain't seekin’ your sympathy (damn).  I just need to be held intimately\nPromise not to look at me differently\" (what you do?)\nAt that moment, I knew that I would have to off pops (word)\nHe blatantly rapin’ my shorty, hit my sore spot\nTold her from here on, I'd shed her from harm\nJust confide in Saigon, she sang a song and just cried in my arm (damn, man)\nTold her confide in Saigon\nShe sang a song and just cried in my arms (this shit sad)\nShe said, she said\n\"I don't know how he could do it\nLet his own flesh and blood go through it\nAll I know is I can't take it no more!\" (So what you do?)\nI plotted for three days on when and how to leave him twisted (uh-huh)\nThe D's are too swift with biscuit ballistics, can't risk it (true)\nI asked E.  She said if she was me, she'd find a big stick to beat him with (damn)\nThen cut off his dick and feed him it\nI was thinkin’, \"Damn, why you so belligerent, boo?\"\nThen it hit me, like maybe it's ‘cause of all of the shit that she went through\nBein’ so badly trapped, word to God it's too bad he black\nViolatin’ whenever his daughter sat on daddy lap\nHow the fuck I make him fathom that?\nSaid the time she tried to spaz back, got back-slapped (What happened?)\nCollapsed and had an asthma attack (damn)\nSee black? The tongue is as ill as a fatal act\nHe never portrayed that type, down the tube to my table, Jack\nI'll preach him some [haps?] about keepin’ my paper stacked\nI used to use that advice (but now) but now it's a bit too late for that\nHumble up on the outside, within was so cruel\nI talked and watched sports, ate soul food with this old dude (damn)\nWhoever thought a ex-newspaper reporter be rapin’ his daughter? (pssh)\nSon, this sport is worth more than just eight and a quarter (I agree)\nThere now.  Decided to do it, care style (how?)\nSlit his throat and smother him so when he scream, you don't hear a sound (right)\nHe let me in.  Let's see—in five flat, was on the rug murdered (murdered?)\nThe jugular turnt and burned rubber before the blood squirted\nWent to E, and told her that he was done with (what she said?)\nNever had to worry 'bout your pops with all that dumb shit (no, what she said?)\nShe looked at me like, \"Nigga, you playin’\nFuck you mean my pops is done with? (She said WHAT?)\nExactly what the fuck is you sayin?\"\nI said \"Erica, what the fella did was foulin’ me and foulin’ you too\nShe said, \"Oooh, you done did what I doubted you'd do\"\nStarted lookin’ hysteric, lookin’ like she was possessed by a superior spirit\nWasn't tryin’ to hear it (fuck that)\nI grabbed her arm, shook her up, spoke on some calm shit (man)\nAsked her \"What's the matter, I thought it was what you wanted?\"\nThought it was what you wanted? (That's what I thought)\nThought it was what you wanted?\n\n[Outro]\n(That's why you in here?) Yeah man, so yeah\nCome to find out, the bitch father was never even rapin’ her, son\n(What?! Get the fuck outta here)\nYo, I go and I take homie out and shit (you took him out?)\nThen come to find out she was settin’ homie up to get some insurance money\n(What? Insurance money?)\nNow I'm up in here with y'all motherfuckers (you got to be shittin’ me, man!)\nNah, I ain't here for that, I'm just fuckin with you man\nI'm here for some other shit man (ahh, you stupid!)\nY'all some stupid muhfuckers.  Anyway, man… (nigga, you's a stupid motherfucker)\nAnyway, man I gotta go use this phone, I'll be back\nI gotta use this phone real quick (fuck that!)\nMake sure shorty come right this time\nI'll be back, y'all (lyin’-ass nigga)", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}