{"artist": "R.A. The Rugged Man", "songs": [{"album": null, "year": null, "lyrics": "I walk in the Pentagon with a blood soaked hatchet\nLeave the president's nose shattered\nStretch his neck like go gadget, and toe tag it\n\nYou a stone cold faggot\nI hold the chrome in a jacket\nGo toe to toe with a savage\nAnd roll you over a cactus\n\nFuneral's are closed caskets, coke addicts\nChrome ratches, the whole package\nI'll beat Moses on the head with them stone tablets\n\nI killed Kennedy, brains blown all over Onassis\nI'll hold my own with the axes\nAnd turn the pope into ashes\n\nDesigned frequency, I'm a holy divine lyrical deity\nEven atheists and heathens and non-believers believe in me\nThe punk-ass devil was born soft\nI'll piledrive you like Paul Orndorff\nSteal his pitchfork and rip his horns off\nI'm the born force\n\nSick fuck, I'll skin you alive and then carry the bones\nLoad the ruger up and shoot you up like I'm Marion Jones\nVinnie is out of his dome\nGuinea that carry the throne\nGimme, it's that or be stoned\nTrinity, that'll be home\n\nWe bout to spaz, R.A. and Vinnie Paz\nWe don't give a fuck\n\nNew jack pussy, young rappers think their rapping is good\nYoung rappers get treated like fetuses in planned parenthood\nThis ain't no Mickey Mouse, zip-a-dee-doo-dah Disney\nIt's the claws of a grizzly\nIt ain't Wayne and Drizzy, it's Thorburn and Vinnie\n\nAnd R.A., that's my brother there, anyone who unaware\nI'mma leave em stumbling as if they had a ton of beer\nI'm from Philly, it ain't a sucker to ever come from here\nYou a pussy, you see confrontation and you run from there\n\nWhat kind of dirty bitch did your daddy put his sperm in?\nKiddie porn web searchin', pervert jerkin, you serpents is Satan's servants\n\nYou get slain for certain if you put your faith inside of Satan serpents\nStick the blade in you while I embrace you like my favorite person\n\nStay in Hell burning, slaves with chains on your brain like a turban\nI make Abel kill Cain and get bible pages reversin', brains burstin'\n\nIt takes a taste of bourbon for me to rape a virgin\nAnd Vinnie deal with mathematics like an Asian person\n\nWe bout to spaz, R.A.Annotate and Vinnie Paz\nWe don't give a fuck\n\nHands like Roberto Durán, it's the flight 103 Pan Am\nIt's the Gulf War between Iraq and Iran\nTreat you like Indians I'm snatching your land\nI'm more dapper than Dan, I'm Rakim I master the plan\nI bring the roots without having a band\n\nWithout having a fan I coulda never took care of my fam\nI coulda never done all the tours on the shores of Japan\nStill would've slaughtered your man, still would've aborted the plan\nStill an apostle from Sham, still I'm like God in Sudan\n\nWe bout to spaz, R.A. and Vinnie Paz\nWe don't give a fuck", "title": "Sam Pecknpah", "image": "https://images.genius.com/8fff7f98b3275b4fa6a6a43f01159e31.899x899x1.jpg"}]}