{"songs": [{"year": "2014-01-09", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Before I Commit Suicide", "lyrics": "[Intro]\nBefore I commit suicide, lives will be taken\nMmm, real hip-hop, west coast\n\n[Verse 1: Kendrick]\nYo, yo\nBefore I commit suicide\nI see to it that a million MCs die, lyrical homicide\nWalk up on 'em, circle the block\nHit 'em again less than 5 minutes exact, then fleeing the spot\nThis is Armageddon, two weapons, two palms\nGuns drawn, bang! Motherfucker, bang!\nOne man Vietnam\n.45 popper, rhyme like the 9-5 big poppa\nOn a seven deck yacht, eat lobster with my comrades\nHead doctor, knee pads\nGave it to her out of courtesy\nCurtains close on that Maybach\nLay back as I hop on my underground shit\nLike a subway, derail the track, the real is black\nTrue rhyme sayers, hitmen, crime payers, llama throwers\nHustle in front of corner stores\nStreet catered, for been living on minimum wages\nIt's not a threat, I'm doing myself a favor\nWith suicide\n\n[Hook]\nBefore I commit suicide\nBefore I commit suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\nI got my mind on the murder and the murder on my mind\n\n[Verse 2: Kendrick]\nYou a liar, you and I are not alike\nI flow like water, purify mics\nAsk Sean Carter, Nasir Jones\nOr anyone sitting on the throne\nDon't get your career postponed\nWomen, children, I rode past in traffic\nCan't steer, cars crash\nI got a death wish, you might be on my guest list\nI wrap rappers on stretchers\nGuns clap in the direction your sepsis\nNo matter your gender, not sexist\nYou MC? You better surrender\nI love breakfast, lunch and dinner\nKilling these rappers\nSparring in the winter, training in the summer\nMore practice, let's continue\nDoing numbers like an accountant\nYou wonder like knife, how much money I'm counting\nYou're damn right, I spit it pretty precise\nAnd whenever the verse is done, means I took me another life\n\n[Hook]\nSuicide, it's a suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\n\n[Bridge]\n(Oh, you motherfuckers think I'm playing, huh? Let me hop on my Daddy Kane shit, jump on my shit, 'Naw mean?)\n\n[Verse 3: Kendrick]\nI delete MCs under concrete\nVerbal mass destruction, you want it? Then call me\nA killer, I put these rappers on their death bed\nOne shot to the heart, one more to the head\nMy rhymes so clever I never fall off\nFrom an industry nigga, they all get hauled off\nBut not from a sawed-off, but more like an uzi\nSpit rap, and these succulent MCs get chewed, B\nMoney, power, respect, pussy and pistols\nHoes pop pills like it's a modern day ritual\nBut I don't sweat 'em y'all, I just behead 'em y'all\nAnd leave the party jumping like players of B-ball\nThe B-board, those will die who decoy\nDestroy any rapper thinking he make noise\nIt's K-Dot, the terminator\nFake rapper rhyme slayer\nThose who live now will die later\n\n[Outro]\nThe suicide"}], "artist": "Kendrick Lamar"}