{"artist": "50 Cent", "songs": [{"album": "Bulletproof (Soundtrack)", "image": "https://images.genius.com/a67b37e2a3aaa0ddad59cdae813b6aa8.500x500x1.jpg", "title": "I’m a Rider", "lyrics": "[Intro]\nYeah\nFeels good\n\n[Verse 1]\nI might be the crookest nigga movin' around with 3 felonies\nI get a laugh at all the bullshit niggas be tellin' me\nMy hood full of niggas like Marky and Bill Bellamy\nThem funny niggas will get ya, so keep the heat with ya\nIt's Ferrari\nNigga, my name hold weight, like a diesel nigga on a bitch pressed up state\nHere's my number, 94R6378\nIn case you thought the shit I say in my line's fake\nI make a mess in the mess hall - cause a brawl\nCaught you catchin' no charge; oh God\nWhy's my life so hard?\nCause I ain't book-smart, they think I'm a retard\nNo, I dont know much about the French I talk\nAll I know is when that drama pop off, these pussies is shook\nThis is Rikers Island pain talk; your phone time’s my chalk\nMy time is my time, and your time's mine, punk\nCut you from ear to ear, [?]\n\n[Chorus]\nI'm a rider\nWherever I'm in or out, I'm me\nWhether I'm locked or I'm free\nWhatever I'm at, I'm who I be\nYou know you wanna be a rider like me\nI'm a rider\nWherever I'm in or out, I'm me\nWhether I'm locked or I'm free\nWhatever I'm at, I'm who I be\nYou know you wanna be a rider like me\n\n[Verse 2]\nAny nigga with a glass jaw gotta get his shit cracked\nSoon as I touch the bricks, I bust a clip and take the strip back\nGive me [?] money for a week; I could flip that\nThey had my face while I'm juxin' you when I push your shit back\n[?] used to carry billy clubs, Trey-eight slugs\nNow they carry nines but I got hollows in mine\nI see my homies on the corner, burnin' a dutch\nTake a [?]; next thing you know, I'm [?] fucked up\nEvery Tuesday I'm in parole, listenin' to niggas\nLyin' through they teeth 'bout how they holdin' fingers\nYou make police contact? (Nope)\nStayin' out of trouble? (Nope)\nGot a job yet? (Nope)\nI'm still sellin' dope\nI'm just playin' [?]\nLet me piss in a cup\nAnd I got shit I gotta do; you really fuckin' me up\nSee you, I could talk to you; you know what's up\nAll that drug program shit be slowin' me up\n\n[Chorus]\nI'm a rider\nWherever I'm in or out, I'm me\nWhether I'm locked or I'm free\nWhatever I'm at, I'm who I be\nYou know you wanna be a rider like me\nI'm a rider\nWherever I'm in or out, I'm me\nWhether I'm locked or I'm free\nWhatever I'm at, I'm who I be\nYou know you wanna be a rider like me\n\n[Spoken Outro]", "year": "2007-07-23"}]}