{"songs": [{"year": "2015-12-11", "image": "https://images.genius.com/c03c0a3f9195d374975890a9196565bb.1000x1000x1.jpg", "title": "Carpe Diem", "album": "Zuhältertape Volume 4", "lyrics": "[Verse 1]\n14.30 Uhr\nIch fahr' im Benz durchs Viertel\nAn den Streetgangs vorbei mit verspiegelten Scheiben\nEllbogen aus dem Fenster, um den Bizeps zu zeigen\nTrete aufs Gas und rausch' ab mit quietschenden Reifen\nHab' Weedpacks und Weißes im Handschuhfach verstaut\nDie Handschusswaffe schaut aus der Anzugsjacke raus\nIch halte am Streetballcourt\nDer Typ zieht sich 'ne Line und danach ein' Bündel lila Scheine aus den Reebok-Shorts\nMein Stoff hat Top-Niveau\nQualitätsware, der Boss ist keiner, der die Nase streckt wie Pinocchio\nVermiet' am Block die Hoes als Bondage-Sexsklaven\nDamit die Umsätze rumkommen wie Comic-Sprechblasen\nIch krieg' von Mafiosis Bares\nDu machst auf Gee, doch bist kein echter Gangster wie DiCaprio in \"Departed\"\nDu hast Rauschgift bei? Ich nehm' gern ma' 'ne Probe!\nDoch find', die haut nicht rein wie Seals Dermatologe\n\n[Hook]\nBei dir hat's gebrannt? Bitch better have my money!\nDu hast Schulden bei der Bank? Bitch better have my money!\nKein Essen mehr im Schrank? Bitch better have my money!\nDeine Kinder sind schwer krank? Bitch better have my money!\nStreetlife - Hood-Prestige - Kilos in den Straßen\nDie wahre Nummer eins, der primus inter pares\nCrackrocks aus Argentinien\nStraßenkriege - Cashflow - Carpe Diem\n\n[Verse 2]\nKurz nach Mitternacht, ich bieg' am Stripclub ab\nPaar Balkaner springen hinten auf den Pickup-Truck\nWir fahren im Licht der Nacht vorbei an den Straßenblocks\nMit ihren Bars und Shops zur Einfahrt der Hafendocks\nIch hol's Schmiergeld für den Wachdienstbeamten raus\nGeb's ihm durchs Fenster und er macht mir die Schranke auf\nWir halten an 'nem Kran an, öffnen Schiffscontainer\nGehen rein und leeren Boxen, wie die Klitschko-Trainer\nIch tick' an Diskoschläger, steig' aus dem Cadillac\nLass' im Hotelsuite-Bett zwei Hoes stöhnen wie 'n Tennismatch\nDu willst endlich Sex, doch kriegst die Schlampen nicht\nDenn du hast ein Schwanzgesicht wie Elefanten, Bitch\nIch red' im Cafe mit OGs in sorgenfreiem Ton\nVon vergangenen Coups, verschwundenen Mordbeweisen und zur Morgenzeit\nVon Dingen, die dann über kurz oder lang Bedeutung kriegen, wie Morsezeichen\n\n[Hook]\nBei dir hat's gebrannt? Bitch better have my money!\nDu hast Schulden bei der Bank? Bitch better have my money!\nKein Essen mehr im Schrank? Bitch better have my money!\nDeine Kinder sind schwer krank? Bitch better have my money!\nStreetlife - Hood-Prestige - Kilos in den Straßen\nDie wahre Nummer eins, der primus inter pares\nCrackrocks aus Argentinien\nStraßenkriege - Cashflow - Carpe Diem\n\n[Outro]\nIch pump' das Zuhältertape 4 im Mercedes\nUnd hör' mich rappen: \"Ich pump' das Zuhältertape 4 im Mercedes\"\nBitch, Bitch, Bi-, Bitch be-\nBetter have my money\nIch pump' das Zuhältertape 4 im Mercedes\nUnd hör' mich rappen: \"Ich pump' das Zuhältertape 4 im Mercedes\"\nBitch bet-bet-bet-better have my mon-mon-money"}], "artist": "Kollegah"}