{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "Real Power Is People", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "(Sample)\n\"They are a secret network of international pirates\nWho identify with no nation, no national flag\nAnd no established religion\nTheir flag is the skull and cross bones\nAnd their God, G.O.D. spells Gold, Oil, and Drugs.\"\n(Prodigy talking)\nOne, two, aiight\nYeah, that's right, uh-huh\nUh, uh\n\n[Prodigy]\nLive from the belly, they got me behind the fence\nI run shit from the inside of the fucking President\nOf the Infamous Gang - get whiff from my stank\nI got that iky-iky cotton picky shit that have you dazed\nI'm a quadruple O.G., a O so call me\nThe reincarnation of the Pharaoh with an Olde E\nThe barrel full of hot lead; shoot a pot head\nTalking that shit about Hip-Hop dead\nNah it's alive behind the gate; permanent smiley face\nAny nigga stunting on the God; nah you outta place\nI beat a lot of cases had to take an L\nI see you in a hot sec', yep hold it down\n\n(Chorus)\nMoney's worthless, real power is people\nReal strength is in the streets where everybody's equal\nFuck jewelry, fuck rims; let's spend on our protection\nGet armor, get cameras, get wit' it lil nigga this man's shit\nReal power is people\nReal strength is in the streets where everybody's equal\n\n[Prodigy]\nThis is live from behind the wall\nSitting, starring at the wall\nI'm fit to pop out this bitch like a newborn\nI'm fit to cut out all the smoking and the drinking\nThe wine and the spirits is evil where you take it baby\nSo I'm telling the truth, you live it then you see it\nYou breathe it then you be it\nI'll tell you a lil secret\nIt's a secret government that worship an owl\nThey practice witchcraft to harness their power\nPedophile rape lil kids for energy\nThe Satanic rituals; W.T.C. (R.I.P.)\nThey let the Pentagon on fire\nThat's lightening the pentagram on fire\nAll these bodies for what?\nSo you could scare everybody into one world huh?\nAll my grime's is on deck\nSo if you ain't come for war then run\n\n(Chorus)\n\n*Crowd protesting and gunfire*", "year": "2008-04-22"}]}