{"artist": "A$AP Rocky", "songs": [{"title": "Holy Ghost", "image": "https://images.genius.com/dc72683bf8dde390161846b4a8892563.800x800x1.jpg", "album": "AT.LONG.LAST.A$AP", "lyrics": "[Produced by Danger Mouse, additional production by DJ Khalil]\n\n[Intro]\nAy, I have a message from the Most High that says:\n\"This negra kept his soul from the Devil\"\nIt's true, I guess I mean, wait a minute now\nIs your people really that God damn ign'ant? Really? Really?\n\n[Verse 1: A$AP Rocky]\nChurch bells and choir sounds, tell 'em, \"Quiet down\"\nBow your head, the Most High's around cocktails\nGuys and gals miss me, ties and gowns happen now\nMy entire sound is how you tryna sound? Stop it now\nThey ask me why I don't go to church no more\n'Cause church is the new club and wine is the new bub\nAnd lies is the new drugs, my sister the next stripper\nMy brother the next victim, my usher the next tricker\nSatan givin' out deals, finna own these rappers\nThe game is full of slaves and they mostly rappers\nYou sold your soul first, then your homies after\nLet's show these stupid field niggas they could own they masters\nHoly smokes, I think my pastor was the only folk\nTo own the Rollie, Ghost and Rolls Royces with no Holy Ghost\nAnd get your shit prepared, face your fears, all you niggas scared\nSay your prayers, pray you fit upstairs, it's our only hope\n\n[Break: A$AP Rocky]\nChurch bells and choir sounds, tell 'em, \"Quiet down\"\nBow your head, the Most High's around, Lord\n(These things are not right, these things is not right) Lord\n(Hell, nobody's ever defined) Lord\nThe pastor had a thing for designer glasses\nYeah, I'm talkin' fancy plates and diamond glasses\nThe ushers keep skimmin' the collection baskets\nAnd they tryna dine us with some damn wine and crackers\n\n[Verse 2: A$AP Rocky]\nWho's more important than your Lord and Savior?\nWon't let the pearly gates up in this\nProbably due to all your poor behavior\nMy mental got a couple tips to save ya\nJust be sure to count it as my only favor, thank me later\nUh, every night I stayed up sayin' prayer, made me greater, uh\nLet's savior chasin' green for collard greens and baked potatoes\nOn the table, pray for cable, hit the label, now we major\nHa, I got my own relationship with God, Lord\n\n[Chorus: Joe Fox]\nHoly Ghost, I'm on my knees, I'm on my knees\nHoly Ghost, you're all I need, you're all I need\nHoly Ghost, I'm on my knees, I'm on my knees\nHoly Ghost, you're all I need, you're all I need\nHoly Ghost, I'm on my knees, I'm on my knees", "year": "2015-05-26"}]}