{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/9e883c930374c1c92c7094a3280231be.491x491x1.jpg", "title": "Drinkin’ With the Devil", "year": null, "album": "I Killed the Devil Last Night", "lyrics": "[Killah Priest]\nYeah me and the devil was cool\nWe both dropped out of high school\nStarted gettin' high and shootin' pool\nHe taught me all of his rules, which was none\n[Lemme show you this gun]\nYeah we was wild about havin' our fun\nWe played cards and shot dice\nFour, five, six, ha-ha-ha-ha\n[Bet you can't roll that twice]\nSo we drove in this expensive car\nHe introduced me to broads, who loosen their bras'\nAnd seduced me in bars\nHe showed me the loot; it was fun being a rap star\nAll the drugs he snort and shoot then pull out a black card\nEverything charge, we neva max, we livin' large\nThe flyest suit, but it was all a facade\nBut somethin' in me was empty\nThose mass of smiles was buried by me laughin' out loud\nAnd our nights ended wit countless of women\nIt was temptin', a smooth dude I befriended\nBut then he said... and that made me go\nOh shit, then at the end of the night we broke out to a fight\nSome he said got to my head\nSomething about him had me really on edge\nAnd the ho's were laughin', I mean it was embarrassin'\nAnd the devil got mad and told me to take a cab\nI said you take a fuckin' cab\nThis is my car, my whip\nAll these of chicks, all these ho's that gave me away\nThis is mine and not yours\nI looked 'em in his face\nThen a hand touched my shoulder, and said:\n\"Sir you had too much to drink, come out the bathroom\nGet out of the mirror\"\nHuh? What? Where's Sheila?\nAhhh, now I remember, I had beef wit this mothafucka\nWhere he at \"Who sir?\"\nThe mothafucka who brought me out here\nNigga was standin' right here\n\"Sir I don't know what you're talkin' about, but we about to close\"\nSo I staggered to the couch and hit the door\nIt's cool, you mothafucka \"Get home safe sir\"\nI feel bad, but I'mma get you"}]}