{"songs": [{"year": null, "image": "https://images.genius.com/9c7203e565e56a244f10c1741d29f204.640x640x1.jpg", "title": "I Need You", "album": "A Song for You", "lyrics": "[Intro: sample of James Brown's \"Try Me\"]\nTry me (try me) tryyyy me (try me, ooooooooh)\nAnd your love, will always be true\nOhh, I need (try me) tryyyy me (try me, ooooooooh)\nGod'll tell me.. I need you\nTry me (try me) tryyyy me (try me, ooooooooh)\nAnd your love, will always be true\nOhh, I need you\n\n[Bizzy Bone]\nBut you know if I love unconditional\nThis the residual, world individual\nIndivisible, little old me\nKeepin me lonely, no woman to hold me\nWhere my lady? My lady ain't crazy, my love\nMy lady is all that I have\nWhy am I low, and what do ya know?\nThis is the path, so narrow the arrow is pointed\nAt somethin and I just can't do me\nIt doesn't suit me, just boot me - I'll make it alone\nI'll make it with Bone, I'm gon' make home\nBaby I don't accept clothes\n'Member the tone, the tone, the hollerin is dumb\nWhere is she from? She needs to be gone\nMy word is my bond, your word is your bond\nWhatever whatever, bring David this song and I'm gone\n\n[Chorus: sample of James Brown's \"Try Me\"]\nTry me (try me) tryyyy me (try me, ooooooooh)\nGod'll tell me.. I need you\nTry me (try me) tryyyy me (try me, ooooooooh)\nAnd your love, will always be true\nOhh, I need you\n\n[Bizzy Bone]\nWhat's she doin, my darling, let's get away fast\nI give you no money, don't give me no ass\nWe upper-class players, riders forever\nThey never will get us so get us remember\nEleven times comin, she's stuntin, she frontin\nWhen you ridin me then ride Ezra, it's nothin\nI make him go fuck the flo', you know\nMi casa mi casa now watch, that ho\nSay boy, that ain't no money, this money is money\nJohanna, you're so fuckin hungry, it's funny\nMessin my body, my eight-pack and tummy\nBe fast and, can you run it?\n{\"Try me, you can't buyyyyy me\" - James Brown}\nCan't fuck with my book baby\nI read the rook for you baby, ha ha ha\n\n[Chorus]\n\n[Bizzy Bone]\nTell them quit with that foolish, this schoolin is due\nDon't mean to be rude, with no attitude\nJust that gratitude, latitude, gradually after you\nHow could I ever be mad at you?\nOne in their face, with one in their place\nWhat should I taste? Give me a woman, I'm straight\nI said one in yo' face, one in yo' place\nWhat should I taste? Give me a woman, I'm straight man\n\n[Chorus]"}], "artist": "Bizzy Bone"}