{"songs": [{"lyrics": "[Intro: Jay-Z (Pharrell)]\nWooo! Uh, uh, bounce is back\nUhh, uh-uh uh uh, geyeah, uh, your boy is back\n(Sexy, sexy) I know y'all missed the bounce\nYou need to bounce for the sexy, y'know?\nHah, haha, uh, let's get it in\n\n[Verse 1: Jay-Z]\nYeah ma, your dude is back, the Maybach Coupe is back\nTell the whole world the truth is back\nYou ain't gotta argue about who can rap\n'Cause the proof is back, just go through my raps\n(New York, New York!) Yeah, where my troopers at?\nWhere my hustlers, where my boosters at?\nI don't care what you do for stacks\nI know the world glued your back to the wall\nYou gotta brawl, do that\nI been through that, been shot at, shoot back\nGotta keep a peace like a Buddhist\nI ain't a New Jack; nobody gon' Wesley Snipe me\nIt's less than likely, move back\nLet I breathe, Jedi Knight\nThe more space I get the better I write\nOh, never I write, but if, ever I write\nI need the space to say whatever I like, now just\n\n[Chorus: Jay-Z (Pharrell)]\n(Change clothes, and go)\nYou know I stay fresh to death, a boy from the projects\nAnd I'ma take you to the top of the globe, so let's go\n(So let's exchange numbers and go)\n(And girl I promise you, no substitutes) It's just me\n\n[Verse 2: Jay-Z]\nAnd I ain't gon' tell you again, let's get ghost in the Phantom\nYou can bring your friend, we can make this a tandem\nOr you can come by yourself if you can stand him\nBest believe, I sweat out weaves\nGive Afro Puffs like R.A.G.E\nAww you get if could move it\nBack it on up like a U-Haul truck\nThen run and tell them ducks you heard Hovi new shit\nHe and the boy Phar-real make beautiful music\nHe is to the East coast what Snoop is\nTo the West Coast, what 'Face is to Houston\nYoung Hov' in the house is so necessary\nNo bra with that blouse, that's so necessary\nNo panties and jeans, that's so necessary\nNow why you fronting on me, is that necessary?\nDo I, to you, look like a lame\nWho don't understand a broad with a mean shoe game\nWho's up on dot dot dot and Vera Wang\nMa are you insane? Let's just\n(What you want me to do?)\n\n[Chorus: Jay-Z (Pharrell)]\n(Change clothes, and go)\nYou know I stay fresh to death, a boy from the projects\nAnd I'ma take you to the top of the globe, so let's go\n(So let's exchange numbers and go)\n(And girl I promise you, no substitutes) It's just me\n\n[Break: Pharrell (Jay-Z)]\nHa ha! Sexy sexy, ha ha! Sexy sexy\n(It's so necessary ma)\nHa ha! Sexy sexy (woo, that's right, it's a groove)\nHa ha! Sexy sexy (uh, uh, it's a groove, uh, bring it back)\nHa ha!\n\n[Verse 3: Jay-Z]\nYoung Hov' in the house is so necessary\nNo bra with that blouse, that's so necessary\nNo panties and jeans, that's so necessary\nWhy you frontin' on me?\nLet's go to my hotel, cause this don't go well\nWith those S. Dots, gotta stay fresh ma\nMa, I don't shop where the rest buy\nHo no ma, please respect my\nJiggy this is probably Purple Label\nOr that BBC shit or it's probably tailored\nAnd y'all niggas actin' way too tough\nThrow on a suit, get it tapered up, and let's just:\n\n[Chorus: Jay-Z (Pharrell)]\n(Change clothes, and go)\nYou know I stay fresh to death, a boy from the projects\nAnd I'ma take you to the top of the globe, so let's go\n(So let's exchange numbers and go) uh huh yeah, uh\n(And girl I promise you, no substitutes) It's just me\n\n[Outro: Pharrell (Jay-Z)]\nHa ha! Sexy sexy (uh, uh, WOO, sing along)\nHa ha! Sexy sexy (yeah, uh.. turn your radio up)\nHa ha! Sexy sexy (woo, put your hands in the air if you in the club)\nHa ha! Sexy sexy (snap your fingers now, uh, woo!)\nHa ha! (Your boy is back, uh-huh, uh, uh)\n(The bounce is back, uh, uh woo!)\n(Uh, Young is back, hahahaha - PEACE!!!)", "title": "Change Clothes", "image": "https://images.rapgenius.com/63de8f606effb28a9497203dd416e396.300x300x1.jpg", "year": "2003-11-04", "album": "The Black Album"}], "artist": "JAY-Z"}