{"artist": "Ace Hood", "songs": [{"title": "Make a Toast", "album": "Ruthless", "year": null, "lyrics": "[Intro]\nThis is no longer music\nIt's a celebration homie\n\n[Chorus]\nLet's make a toast (Toast)\nTo the young don\nAnd to the gangsters, until they postpone\nTo all the hustlers, that's on the cash grind\nTo those we lost to war and looking for a lifetime\nI do it for the G's, I do it for the streets\nThis one for history, I'm toasting this to me\nGlasses in the air! (It's a celebration baby)\nI'm toasting this to me\nGlasses in the air! And this for history\n\n[Verse 1]\nTrue story I was born into the Lord's glory\nHustle and ambition, vision first class ported\nAnd that's according I was cordial on my first formal\nTrying to make a mill' coming off of four quarters\nI am so Florida Marlin in my own water\nSwimming with the sharks, slaughter anyting by the\nFeeling like an orphan, never knew my real father\nGuess that's why I'm going harder than my role model\nSigned to the biggest label that enable Carter\nNow they paying Hood out there to my armor model\nAnd every Ace of Spades bottle till the last swallow\nOnly taint to ever trained to get the last dollar\nBlack flag scholar, Louis Vuitton don\nA hundred for the watch, just waiting for the right time\nI just realized in my money state of mind\nI'm on another level devils meet me in the sky\n\n[Chorus]\n\n[Verse 2]\nI used to wake up morning, yawning where I want to be\nPeople I want to meet, and places I've been dying to see\nNo hope of selling coke or dope, I'm going back to sleep\nNow I awake with paper bags, cash under feet\n\nThrow up the W to represent my dynasty\nAnd all honesty the prodigy see no defeat\nKeep all apoligies, the modesty is all to me\nIt's ruthless mindframe is the way to be\nI burn a hater, blow the ashes on his daddy feet\nMay he be deceased, look until you see the beast\nWhile I could see you getting rich and niggas envy me\nIt's deeper than the rap, the realist shit a nigga speak\nPrivate planes take me everywhere they wish to see\nAnd Khaled taking me to heights they only wish to be\nFlyest without a wing, the American dream\nIt's a bird, it's a plane, naw it's just me\n\n[Chorus]\n\n[Verse 3]\nShout out to Khaled, shout out to Def Jam\nShout out to We the Best, what up Dollas and Deals?\nShout out to A.D., what up Fo' Fifth?\nWhat up Kitgo? What up P Bo?\nBlood no go, what up A.C.?\nI love you Blonde D, I love you big sis'\nI love you little sis', I love you 2Pac\nAnd I will never stop, let's toast to the top\n\n[Chorus]\n[Outro]\nAce Hood baby!\nThis is no longer music\nThis is a celebration baby\nI've been introduced to the finer things in life\nThank you Lord\nThank you Lord!\nKhaled! I told them\nMake a toast to them\nHi haters!", "image": "https://images.genius.com/53ac3721e503404e628fbbe13e8ddd8e.600x600x1.jpg"}]}