{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/3f0572196a3433291b8b1ff8011634a9.612x612x1.jpg", "title": "Get You High Today", "year": "2013-09-23", "album": null, "lyrics": "[Bridge: Kid Ink]\nI said I just rolled one, kush hanging out the blunt\nSwisher Sweet, no I don't do papers\nOkay, living everyday like it's Friday\nYou ain't doing nothing, let me get you faded (Gon' pass that my way!)\n\n[Hook: Kid Ink]\nYou ain't got no job, I'mma get you high today\nMight as well go hard, I'mma get you high today\nForget all your plans, I'mma get you high today\n28 grams, smoke it all in a day\n\n[Verse 1: Kid Ink]\nBreaking down anywhere, I never hesitate\nYou know OG what I'm smoking got a type of taste\nElevate your peace of mind baby piece of cake\nWe too faded, hairline like Lebron James\nBlowing kush clouds make a ho precipitate\nIt's peer pressure baby I think you should come participate\nThe hot box going I don't wanna hear you ventilate\nNow take a hit, slow and close your eyes like you finna' pray\nReal nigga say what, I swear to God that you been a fake\nPuffing on that Reggie turn a nigga face to Stevie J\nRiding round with a quarter pound on the interstate\nDucking from the CHP, my fucking enemy\nMe, myself, and a bad bitch; stay round' trees like a hammock\nTryna' roll better hold on the handle wait\nGot a light gon' put it to the candle, wait\nYou ain't even drop on the work but, you've been holding that blunt like a newborn\nTalking bout \"I got 5 on it\", nigga need to cut that shit out like a coupon\nSaid you don't know what that costs\nWhen you going through an ounce 20 times in a month\nPulling up to the bank 20 times in a month\n3-65 nigga high as a monk\nKeep it low key getting high is a must\nStank in the blunt got it smelling like Must'\nOG gee golly, got a nigga stuffed the sativa really don't do much\nI said...I just rolled one, your rotation never done\nNigga eyes sitting low like I've been looking at the sun\nWhat you want? Man it's safe to say I'm the highest nigga working\nNobody perfect, these bitches lurking (they know!)\n\n[Bridge]\n\n[Hook]\nYou ain't got no job, I'mma get you high today\nMight as well go hard, I'mma get you high today\nForget all your plans, I'mma get you high today\n28 grams, blow it all in your face\n\n[Ad libs: Kid Ink]\nYeah\nHuh?\nI said\nOkay\nKid Ink!\nAlumni Bitch!\nI'mma get you high today (hey)\nI'mma get you high today\nThese niggas talking crazy, I'mma get you high today\nJust put your blunt away, I'mma get you high today\nI'mma get you high today (x4)\n\n[Outro]\nAy, I know you don't smoke weed, I know that, but I'mma get you high today"}]}