{"artist": "Yung Lean", "songs": [{"album": "Warlord (This Record is Dedicated to the Memory of Barron Alexander Machat (6/25/1987 - 4/8/2015))", "image": "https://images.genius.com/66b392735c116cafa707de794609d712.1000x1000x1.jpg", "year": "2016-01-25", "lyrics": "[Hook: Yung Lean]\nAll I roll is potent (potent), we stay golden\nWe gone hocus pocus, they think they know us\nI'm flying in a lotus, in a Range Rover\nIs my life over?\n\n[Bridge: Yung Lean]\nTake, take, take, take\nTake control of, take control of me\nTake control of Lean, take control of me\nAll I roll is potent (it takes control of me)\n\n[Verse 1: Yung Lean]\nWhite powder like a hill, take control of me (take control)\nWhen it hits my body, you know there's no stoppin' lean (Leandoer)\nI don't like red, paint the roses green (green)\nPut a price up on my head, there's no controllin' me (lean)\nI thought I was dead (dead), but I'm livin' free\nWalk up in the spot, bitch, it's SBE\nStack the money green, turn it into leaves\nSix Air Force on my feet just like a centipede\n\n[Hook: Yung Lean]\nAll I roll is potent, we stay golden\nWe gone hocus pocus, they think they know us\nI'm flying in a Lotus (Lotus), in a Range Rover (Range Rover)\nIs my life over? Is, is it over?\n\n[Verse 2: Yung Lean & Bladee]\nNever will I rise to fall, I've seen that light from very far\nI pack my bag, I pack my bag, bet you could never match the stars\nKeep my boys 'round, they watch my back\nFollow the lights, we in the cab\nHash is from Uzbekistan, I ball like asics 'cross the land\nYou see my face, I see your hands\nShe don't want to understand, but I have a plan\nMixing alcohol and xans, with my, with my gang\nYou can find me where I stand, Disney wonderland\nI don't ever get attached, doesn't work like that\nDoesn't work like that\nBlack bracelet, never show faces\nTwo pills runnin' 'round in the matrix\nNever show faces, never show faces\nTwo pills runnin' 'round in the matrix\n\n[Hook: Yung Lean]\nAll I roll is potent (potent), we stay golden\nWe gone hocus pocus, they think they know us\nI'm flying in a Lotus (Lotus), in a Range Rover (Range Rover)\nIs my life over? Is, is it over?\nAll I roll is potent (potent), we stay golden\nWe gone hocus pocus, they think they know us\nI'm flying in a Lotus (Lotus), in a Range Rover (Range Rover)\nIs my life over? Is, is it over?\nLotus, Ranger Rover, Rover, is, is, it over?", "title": "Hokus Pokus"}]}