{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/56dcad99efdaf894b78b8a9cecdf0a55.900x900x1.jpg", "title": "Just What I Am", "year": "2012-10-02", "album": "Indicud", "lyrics": "[Verse 1: King Chip]\nI'm just what you made God - not many I trust\nI'ma go my own way, God, take my fate to wherever you want\nI'm out here, on my son, won't stop 'til I get me some\nClub-hoppin', tryin' to get me some, bad bitches wanna get me sprung\nEarly in the morning, I'm wakin' bakin', drinkin', contemplatin'\nAin't no such thing as Satan, evil is what you make it\nThank the Lord for that burning bush\nThat big body Benz I was born to push\nOn my way I'm burning kush, nigga don't be worried 'bout us\nNeighbors knockin' on the door, asking can we turn it down\nI say, \"Ain't no music on\" she said, \"Naw, that weed is loud\"\nNigga, we ballin', straight swaggin', lost Hawk, but I'm maintainin'\nI've been told that I'm amazing, make sure keep that fire blazin', we livin'\n\n[Chorus: Kid Cudi]\nI need smoke\nI need to smoke\nWho gon' hold me down now?\nI wanna get high y'all\nI wanna get high y'all\nNeed it need it to get by y'all\nCan you get me high y'all?\nI wanna get high y'all\nI wanna get high y'all\nNeed it need it to get by y'all\nCan you get me high y'all?\n\n[Post-Chorus: Kid Cudi]\nI'm just what you made God, just what you made God (Nee-need it)\nI'm just what you made God, I'm just what you made\n(Nee-need it) I'm just what you made God\nI'm just what you made God, I'm just what you made God\n\n[Verse 2: Kid Cudi]\nLet me tell you ‘bout my month y'all, in the shop and I had a ball\nI had to ball for therapy, my shrink don’t think that helps at all\nWhatever, that man ain’t wearing these leather pants\nI diagnose my damn self, these damn pills ain’t working fam\nI- In my spare time, punching walls, fucking up my hand\nI know that shit sound super cray but if you had my life you’d understand\nBut, I can’t fold, some poor soul got it way worse\nWe’re all troubled, in a world in trouble\nIt’s scary to have a kid walk this Earth\nI’m what you made God, fuck yes I’m so odd\nThinking 'bout all my old friends who weren’t my friends all along\nHm, when it rains it pours, whiskey bottles on the sinks and floors\nEveryday to find sane’s a chore, amidst a dream with no exit doors\n\n[Chorus: Kid Cudi]\nI need smoke\nI need to smoke\nWho gon' hold me down now?\nI wanna get high y'all\nI wanna get high y'all\nNeed it need it to get by y'all\nCan you get me high y'all?\nI wanna get high y'all\nI wanna get high y'all\nNeed it need it to get by y'all\nCan you get me high y'all?\n\n[Post-Chorus: Kid Cudi]\nI'm just what you made God, just what you made God (Nee-need it)\nI'm just what you made God, I'm just what you made\n(Nee-need it) I'm just what you made God\nI'm just what you made God, I'm just what you made God\n\n[Outro]\nNeed it to get by, ya\nWilly"}]}