{"artist": "Pink Guy", "songs": [{"album": "Pink Season", "title": "Dumplings", "image": "https://images.genius.com/138b472d03d228aebb4f01278cf72bd4.500x500x1.jpg", "lyrics": "[Intro]\nYeah, PinkOmega\nYeah, PinkOmega\n\n[Chorus]\nOne bad chef in a kitchen full of dough\nThree bad bitches with their hands on the stove\nMaking home movies with a handful of stoges\nI'm cooking all the dumplings\nI'm cooking all the dumplings\n\n[Verse]\nMotherfuckers want to act funny\nTryna be a man when your nose all runny\nGo to pre-K, put your bag in your cubby\nMotherfucking gimmick, like your man Jeff Dunnie\nBut who am I to talk? Making preteens laugh for the money\nAct dumb, slicker than honey, whoops\nRapping in the kitchen but got no silver spoon\nBut I feed on the bitches, bitches\nBad to the bone, prone to the homegrown\nGirls moan when I come home, dick like an ozone\nWanna step in the ring?\nJust skin and a sack of shitty meat like dumplings\nBoy, I don't wear Gucci\nStill classy, but rotten like blue cheese\nWe're about to make a movie\nWith a handheld Sony, puffing on a loosie\n\"Cooking the dumplings all day\"\nIs the only thing I say when I mind my business\nGet the fuck out of my kitchen\nI'm cooking up a storm, boy, none of that beef shit\nThey say I'm the man in your nightmares\nYour girl in the bed screaming \"right there\"\nI'm high on the weed and the xanny\nI find it uncanny there's so much poonani\nThey found me in the lab doing stem cell research\nI was trying to grow you some balls\nThe police came, but I explained about your bitching\nNow they want to pitch in and support the cause\nHate my ways? That's a personal issue\nBecause you're thinking about me, put down the tissues (ew)\nWhy you still yapping to me?\nDidn't Mommy tell you not to converse with a stranger?\nAre you crying in the stall with a belt and a razor?\nAre you really that mad or just a bad imitator?\nOh, because I never heard of your dumb ass (nope)\nGo fuck yourself in the mouth with a taser. (whoop)\n\n[Bridge]\n'Cause I'm cooking all the dumplings\n'Cause I'm cooking all the dumplings\n'Cause I'm cooking all the dumplings\n'Cause I'm cooking all the dumplings\n\n[Chorus]\nOne bad chef in a kitchen full of dough\nThree bad bitches with their hands on the stove\nMaking home movies with a handful of stoges\nI'm cooking all the dumplings\nI'm cooking all the dumplings", "year": "2015-06-04"}]}