{"songs": [{"album": null, "year": "2014-02-23", "title": "Intro (Return of Greatness)", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "[Verse 1: J.R. Writer]\n\nUghh, I hear you Big\nNever mind these Thots\nIt's a dog eat dog world\nI'm at the Chinese spot\nTry me not, They gone make me rise these Glocks\nAnd have em' looking out a box\nThat's a ID shot (blat, blat)\nNo flexin', I'm still a known legend\nThat been out doing his own deal since '07 (facts)\nThat's word to everything\nYou ain't never been near me (nope)\nJust tell me anything\nThen you better be Siri (word)\nHear me, Hear ye you looking at the king\nSwing my arms around, till I gotta put em' in a sling\nWanna put me in the bing (but what?)\nBut yo, even the Adams family know\nI ain't really looking at a thing (at all)\nJust a minor setback\nFor a major comeback\nNiggas' who respect rap\nThey don't really want that\nBut thats the way the eggs hatch\nEven on a comeback(what?)\nAll them cats you said rap (what?), gonna' still be dumb wack\nI came in the game thinking Niggas's was Fam'\nTill it hit the fan\nAnd seen all this shit was a scam\nI'm a bigger man though\nI got infinite plans\nGet off your peanut butter shit when niggas get in a Jam\nDamn (damn)\nYou can't ignore\nI got bundles of raw (that crack)\nWhen it came to radio\nI was the one you would call\nYou don't recall, then I call your bluff (hello)\nI ain't talking tough\nBut these niggas' change overnight\nSoon as you lawyer up\nThe game is disgusting\nI lace my constructions\nIt ain't about paper im touchin'\nIt ain't a discussion\nHear me? (hear me?)\nIm trained to go\nAll this shit Im thankful fo'\nI might be the greatest\nBut a nigga ain't ungrateful though (not at all)\nI always was sick (sick)\nNever was Riff (never)\nAbove lit\nAnd that's word to all my club hits (that's my word)\nI will forever be and always was dip\nJust hurt to see some niggas you fuck with on some fuck shit\nBut fuck it (fuck it)\nFind me in the Jects' with the Thunder (thunder)\nIn the pee jays like I'm dressed for a slumber (sheesh)\nStretching the wonder (wonder)\nPosted up, just like a Tumblr (tumblr)\nYou finna' watch a vet do his numbers (cha-ching)\nFronter?\nYou selling dreams, but I'm into Fettuccin' (chine?)\nIf it ain't about that evergreen\nIm off the 'effin scene (im off it)\nWho told you you was nice, they mean you're never mean (mean)\nScarface told me I was nice when I was seventeen (that's a fact)\nI'm a great\nDon't be talking out of place (please)\nIt's all locked money, I ain't talking 'bout a safe (safe)\nAnd all these new rappers that you talking 'bout ain't safe (safe)\nNational Geographic when you talk about the Ape (huh huh)\nI'm Mobby? (mobby)\nYou cats were never Gotti\nIm gon' lift weights and come home slapping everybody (ha ha ha)\nUntil then I'm as high as a trip\nTo Maui and shit\nLeaving y'all with powerfulness\nWriter!"}], "artist": "J.R. Writer"}