{"songs": [{"title": "Visions", "image": "https://images.genius.com/139389227078ed02f0befaef964c2f11.1000x1000x1.jpg", "year": "2019-04-19", "album": "Still Summer in the Projects", "lyrics": "[Intro]\nMustard on the beat, ho\n\n[Chorus]\nLately I been having these visions\nLocked inside a cell with no windows\nHope I make it out of this prison\nI'll be coming back with a vengeance\nI'll be right back when I'm ready\nWhen I get back, I'll be richer\nLately I been having these visions\nLocked inside a cell with no windows\nLately I been having these visions, I'm out my mind\nLately I been having these visions, I'm out my mind, yeah\n\n[Verse]\nPeep guns in the lot, peep guns on the yacht\nThis time they ain't ours, cousin locked behind bars\nI done had a life that's hard, yeah\nI done made it out the tar, yeah\nI was stuck in the pavement, hey\nWhile them peoples in the grave\nSo much shit we got away with\nMake me wanna get saved\nI been prayin' on my knees\nSince they shot me in the leg\nI been goin' through ups and downs\nOff the uppers and downers, no seesaw\nTell me have you ever been in a ride\nWhile trying your hardest not to sleepwalk?\nFuck all your promise, don't need one\nI got the money on me\nFuck all your fake little Nina\nI got someone who love me, hey\n\n[Chorus]\nLately I been having these visions\nLocked inside a cell with no windows\nHope I make it out of this prison\nI'll be coming back with a vengeance\nI'll be right back when I'm ready\nWhen I get back, I'll be richer\nLately I been having these visions\nLocked inside a cell with no windows\nLately I been having these visions, I'm out my mind\nLately I been having these visions, I'm out my mind, yeah\n\n[Outro]\nHello, this is a prepaid call from...\nFrom Greedo\nAn inmate at the Potter County Texas Adult Detention Facility\nTo accept this call, press 0\nTo refuse this call, hang up or press 1\nTo prevent calls from... *beep*\nYour current balance is 46 dollars, 64 cents\nThis call is from a corrections facility and is subject to monitoring and recording\nYes sir, 03 live from C12, right here in the Texas jail, you feel me?\nBeen rockin' with DJ Mustard more than ten summers\nI ain't never hated, I just waited\nAll that negativity ain't get a nigga nowhere\nI ain't talkin' 'bout no positive shit\nBut gangbanging, no selling dope in my music\nI'm talkin' 'bout the past life, you feel me?\nWhen I get out I'ma be a millionaire, I came in here with nothin, feel me?\nYou ain't never got to cross no nigga to get where you're goin'\nThat ain't gon' do nothin' but get a nigga hurt\nI'll be back sooner than May, they callin' it 20 on paper\nBut I'll be right back sooner than you think\nYou dig?\nAyy, that shit gonna be hard, niggas gonna be like, \"This nigga a fool\"\nYou tryna, you tryna hear some bars while you out here?\nYou tryna rap some shit?"}], "artist": "03 Greedo"}