{"songs": [{"title": "WISH", "year": "2019-05-31", "album": "ZUU", "image": "https://images.genius.com/46305882475b3a5ad14a778ce5fd555f.1000x1000x1.jpg", "lyrics": "[Intro]\nYour wish is my command\nI'm your genie\nYour wish is my command\n(He's heating up)\nCan't you feel the magic?\n(FnZ)\nOh damn\n\n[Chorus: Denzel Curry]\nDreads to the top, gold in my mouth, woaday\nHoes by the flock, no, let me stop, woaday\nAnd I keep a Glock, nah, it's a Glock .40\nHands on a knot, hands on your bop, woaday\nShe gon' bust it open for a nigga in designer\nThat's gon' be the reason why she let you get behind her\nYou might be the nigga that's gon' probably wine and dine her\nI'ma take her home only usin' one-liners\n\n[Verse 1: Denzel Curry]\nPull up in an navigator truck, Excursion\nBad bitch on the side of me, half Persian\nI don't got a car, but I got car service\nSo many chains, make a, uh, feel nervous\nWait, I meant to say my chick from Nicaragua\nPut her on the team 'cause we both makin' dollars\nHit her with the stroke, get her wet like aqua\nIf she was a bop, I would hit, then I'll drop her\nHang with the bros 'cause you know blood thicker\nI miss my vros, so we pour more liquor\nAnd you don't want smoke, you don't want no Swisher\n'Cause you don't want war with a South Florida nigga\nMiami-Dade on my motherfuckin' back\nI'm Polo'd down to the socks to the nutsack\nIt's R.I.P. X and R.I.P. Tree\nI'ma do it for my dawg, this for all of my G's\n\n[Chorus: Denzel Curry]\nDreads to the top, gold in my mouth, woaday\nHoes by the flock, no, let me stop, woaday\nAnd I keep a Glock, nah, it's a Glock .40\nHands on a knot, hands on your back, woaday\nShe gon' bust it open for a nigga in designer\nThat's gon' be the reason why she let you get behind her\nYou might be the nigga that's gon' probably wine and dine her\nI'ma take her home only usin' one-liners\n\n[Verse 2: Kiddo Marv]\nBossed up, came a long way from bein' a manager\nGlocks up with the sticks and the clips lookin' like banana-na\nNever pay for pussy, these bitches ain't gettin' nuh-uh\nMy name alone gon' make me press on your ho like a button\nIn my city ridin' vert to Uzi, Lil Uzi Vert\nEvery week another funeral, only time we go to church\nRunnin' all these rappers down a check, they wanna splurge it\nStep up in the scene, so fresh, so clean, like a detergent\nQuick to cut a pussy nigga up just like a surgeon\nI'ma need a Perky 'cause a young nigga be hurtin'\nSlidin' like a Taliban with a turban\nPull up all black in a suburban\n'Cause he ain't die, so we gotta slide back, Mike, Thriller\nPay my young nigga to get you whacked for five figures\nThey gon' rip him, flip him, cut his ass up\nPut him in a box, and ship him, yup\n\n[Chorus: Denzel Curry]\nDreads to the top, gold in my mouth, woaday\nHoes by the flock, no, let me stop, woaday\nAnd I keep a Glock, nah, it's a Glock .40\nHands on a knot, hands on your back, woaday\nShe gon' bust it open for a nigga in designer\nThat's gon' be the reason why she let you get behind her\nYou might be the nigga that's gon' probably wine and dine her\nI'ma take her home only usin' one-liners\n\n[Outro]\nYour wish is my command\nCan't you feel the magic?\nYour wish is my command\nCan't you feel the magic?\nYour wish is my command\nI'm your genie"}], "artist": "Denzel Curry"}