{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/7a51c0ae033b11af2b858645e8922783.709x709x1.jpg", "year": "2008-11-17", "album": "Stereo: A Hip Hop Tribute To Classic Rock", "lyrics": "[Intro]\nHello Chevy\nChevy? There you go\nReally? Well, listen to you\nYou wanna go for a ride?\nWell let's go then\n\n[Verse 1]\nOnce upon a time in a land of 'Bama\nI met a little girl with a bent antenna\nI was on the skateboard cruisin' by when I\nSeen her in the yard with a sale sign in her\nDidn't have a dollar to take her to dinner\nAll I really wanted was a chance to get her\nWent to my piggy bank shoebox\nThen skated right back and put my bid up\nLook I know you want 3 for her, but I got 25 hundred in cash\nPlease nobody better deserves to sit upon a box Chevy like that\nNot a stall, not a pause, not a chirp when I turned the key, man, everything worked\nAnd I think I gotta new girlfriend\nBlack on black-white wall dessert\n\n[Chorus]\nMy box Chevy that's my girlfriend\nShe's always ready, always ready to run\nBox Chevy, that's my baby\nBody so clean\nI'm leanin' back in my box Chevy\nThat's my girlfriend\nShe's always ready, always ready to run\nBox Chevy, that's my baby\nBody so clean\nI'm leanin' back in my box\n\n[Verse 2]\nHello little baby, you're lookin' like a 10 with that there wax on\nFunny how I never thought about another love like uhh\nCadillac on chrome\nOr another way to ride home\nAt night I'm crazy, but little buddy you're such a lady\nGotta put rose petals on your dashboard\nYou never let me down, when we go to town\nAnd you gotta beautiful sound\nOut the back of the pipes, you breathe\nRum t-t-tum tum yessiree\nYou never wanna get there in a hurry\nYou can run a corner with no swerving\nI pull up and hop out of her lap quick\nWith the AC blowin' out them snow flurries\nCold in the woods, storms in the winter\nI just let her run under the hood, let her get warm and then I enter\nCan I re-introduce my buddy, try not to let her get ugly\nBut if I gotta hit a ditch and dip this bitch I'll leave a piggy muddy\nIt's\n\n[Chorus]\nMy box Chevy that's my girlfriend\nShe's always ready, always ready to run\nBox Chevy, that's my baby\nBody so clean\nI'm leanin' back in my box Chevy\nThat's my girlfriend\nShe's always ready, always ready to run\nBox Chevy, that's my baby\nBody so clean\nI'm leanin' back in my box\n\n[Verse 3]\nThis is is my box, this ain't no Maybach\nBallers say \"Why Yeler?\", Yeler says \"Why not?\"\nDo it for time watch\nMy whip is timeless my address says classic\nAddress my box as your highness\nRoll around the city with my girl\nCome on everybody and meet my love\nI know it wanna make you hurl\nSo I keep a brown paper bag in the glove\nSpewing this, your new Buicks\nYou're new to rich, we're winning weds\nMy bitch is better, whatever, baby\nThey hate greatness greatly my lady\nThey can't persuade me to put in suede seats\nTake off my hubcaps, that just ain't me\nHere we go again you and I ride, off into the sun of an Alabama sky\nRum t-t tumtum, say bye bye!\n\n[Chorus]\nMy box Chevy that's my girlfriend\nShe's always ready, always ready to run\nBox Chevy, that's my baby\nBody so clean\nI'm leanin' back in my Box Chevy\nThat's my girlfriend\nShe's always ready, always ready to run\nBox Chevy, that's my baby\nBody so clean\nI'm leanin' back in my box", "title": "Box Chevy (Part 2)"}]}