{"artist": "ILL BILL", "songs": [{"title": "Only Time Will Tell", "lyrics": "[Verse 1: Necro]\nMy religious beliefs are to kill snitches and any bitches that beef\nYour grill in stitches, get buried inside a ditch in your briefs\nLife is enslavement and suffering, crazy snuffings, attacks\nOverdosing like David Ruffin, craving, puffing some crack\nHell is endless and friendless to the Hitlers, Mengeles, and Himmlers\nMangled, ripped to pieces by characters like Pinhead, no forgiveness\nReincarnated as God and Satan, logical psycho sadist\nMy cadence hits like razorblade tips or when Vader invaded\nCorresponding with demons, bonded in blood\nLike the Ugandan president Idi genocide like Rwandans in bondage\nDivine comedy, mind lobotomy, do the math like Ptolemy\nA bloodbath, you're split in half, dichotomy\nThe honorable, horrible, incorrigible, adorable death oracle\nBeautiful like a funeral floral, you heard the stories: Murdering for glory\nSent to purgatory for doing something perverted and gory\n\n[Hook: Everlast]\nWhen your heart won't beat, your eyes go black\nThere's a light in the tunnel and you can't turn back\nYour friends can't save you, your family's gone\nYou're waiting on your judgment at the foot of the throne\nWill you beg for some mercy? Will you cop some pleas?\nWill you stand on your own or get down on your knees?\nWill your angels release you from where demons dwell?\nWill you make it into Heaven or go right back to Hell?\nOnly time will tell, only time will tell\nOnly time will tell, only time will tell\n\n[Verse 2: Tech N9ne]\nI fall upon my knees like, \"Lord forgive me\"\nOut of the commandments I've broken ten out of ten now\nBlasphemy passed to me because now Satan's my pen pal\nPart of me Asmodeus, the other side is an evangelist\nGod gave me melodious but I'm sick, psycho, and scandalous\nOutbursts like bismillah, hallelujah\nOn the other hand I lust for flesh in my quest for gouda\nShaboobalaboopy time, I choose and the coochie's mine\nMy booze through the nine and I ooze at a groupie dime\nI threw B-signs, but the Cs got more patnas\nEverything dead, blasting at peep ma poor patois\nTrying to bring you peace but the beast brings forth kaka\nI really feel like I hate you but it's eep opp ork ah-ah\nYou don't know what that means? Then ask Jet Screamer\nTrash that lingers will cause the enemies to blast that femur\nOnly time will tell if I crash between her\nGod forgive me, I'm torn because I'm an angel\nWith a crass demeanor\n\n[Hook]\nWhen your heart won't beat, your eyes go black\nThere's a light in the tunnel and you can't turn back\nYour friends can't save you, your family's gone\nYou're waiting on your judgment at the foot of the throne\nWill you beg for some mercy? Will you cop some pleas?\nWill you stand on your own or get down on your knees?\nWill your angels release you from where demons dwell?\nWill you make it into Heaven or go right back to Hell?\nOnly time will tell, only time will tell\nOnly time will tell, only time will tell\n\n[Verse 3: Ill Bill]\nFor whom the bells toll, it's the clock, tick tick tick\nThe truth is the future is now\nHow many lifetimes have I taken you through in this hour?\nI trust nobody cause Babylon destroyed my uncle\nSo many lessons I've applied to my life that taught me to function\nIn this hell on the earth the dark clouds have silver linings\nUntil the lightning strikes down upon the unrighteous and frightening\nThe non-believers like eighty year old atheists on their death bed\nCrying and begging for forgiveness from God\nAtrocities committed against mankind\nMonstrosities that span time leaving impressions of hatred in man's mind\nDon’t let time trap you, it’s vital that you realize that there's a new beginning\nAt the ending of the hour of reprisal", "image": "https://images.genius.com/457870257e417a35d5715090c07a987d.1000x1000x1.jpg", "album": "The Hour of Reprisal", "year": "2008-09-16"}]}