{"artist": "Boldy James", "songs": [{"album": "Trapper’s Alley: Pros and Cons", "title": "Runnin’ From the Police", "year": null, "lyrics": "[Intro]\nGetting to old for this shit\nRunning from the police\nOG said \"go get a job\"\nRunning from the police\nYou can't spend your whole life\nRunning from the police\nConcreatures Shit\n\n[Verse 1]\nCause it's maximum prison if I get caught with this package of Skittles\nThis for all my critters on the block with that mag on their britches\nThat be feeling like them cops with the badge is against them\nFresh out, released, go back in the system\nWhen they get out the police go back where they flicked them\nSix mob the street where the traffic be clicking\nSo them jump out boys stay hassling niggas\nGrabbing their pistols yelling, \"Freeze! Don't move!\"\nWhile you standing there looking, thinking please don't shoot\nEither this booking's got to plead to a duece\nOr beat him on foot, I'd rather flee and allude\nAnd leave him in the dust, hit the gate, threw the Glock\nThinking that I must get away and not get caught\nYou can catch me if you can like the gingerbread man\nHit a bitch, trying to catch my second wind\nStill running from the police\n\n[Hook]\nCause my license is spun\nAll my niggas living life on the run\nStill running from the police\nCause we got felony 1's\nAnd we can never get our record expunged\nSo we running from the police\nMag and my uncle dodgers playing laser tag cops and robbers\nStill running from the police\nAnd Helicopters\nWe running from the police\nHere come the coppers\nWe running from the police\n\n[Verse 2]\nKept the burner had to throw the set\nWanted for triple murder and I ain't going back\nWhen I get nervous, I cock the .40 back\nIt's the delivery man, but I ain't order that\nIt's out of my hands, I'm just a quarterback\nWhere I'm from, 52 grams will get you 40 flat\nI write raps for niggas who write back\nDoing life max, running laps on the back ???\nGot sidetracked, tried sidestep\nMade a side bet and the dice crapped\nIt's like that\nConcreatures right back, with lead\nWhat the fuck you said? I'll be right back\nThen holler you down, Jay holler they style\nPut you bitches to bed, no nightcap\nMy metro wiretapped\nOn the low from the feds like my dawg Black\nRunning from police", "image": "https://images.genius.com/06f819733860ea6f65fb77cc4e85eb44.500x500x1.jpg"}]}