{"artist": "The Game", "songs": [{"title": "Angel", "album": "LAX", "year": "2008-08-26", "image": "https://images.genius.com/bba1920bee43a618432ce43748293ec6.1000x1000x1.jpg", "lyrics": "[Intro]\nAngel, angel\nAngel, angel\n\n[Verse 1: Common]\nI spent my day so, first I pray yo\nThen I lay low, looking for the halo\nOr more yayo, my little angel\nReminded me to stay playful\nFaithful walks I take in the woods, thinking what's good\nThings that I can change I should\nThings I can't, need to be understood\nTh-this is the bliss, I used to drift from the hood\nFor a second at least, I'm resurrecting the peace\nPipes that Indians used to light, we called it Chief, right?\nStepping on the leafs right to reach heights\nTh-th-th-that I never seen, it's so so evergreen\nSome use it for medicine, or to write better things\nI was in Amsterdam man, bike pedalling\nTo the nature spot to taste the flavors they got\nMy eyes drop, I like it a lot\nYeah, my angel\n\n[Hook]\nI wanna turn up the sound and spread my wings\nBecause I'm riding with my (angel)\nGoing through the city of the Chi\nMakes me feel like I'm in the city of (angels)\nOhh, I wanna fly, fly away with my (angel)\nShe takes me high, she will always be my (angel)\n\n[Verse 2: The Game]\nTh-th-the way that I rhyme blow nigga's mind\nLike the first time you heard Mary J. and you were standing in line\nTo purchase tickets to see her blow like Chicago wind\nAnd I'm ridin with Common looking for Chicago Zen\nAnd like Chicago winds, I was once a Street Disciple\nRockin every Jordan shoe, Nike put out by Michael\nThat made me feel like I could fly, sometimes I wanted to die\nProlly cause the angel dust was fuckin with my third eye\nSo I start hip-hop and I understand why Common used to love her\nShe got me open so I even had to fuck her\nBut I used the rubber, cause she was married to Rakim\nSo I bought me a gold chain, pretendin' that I was him\nSo I can get close to the girl I loved the most\nBut she left Cali and went on tour with Ne-Yo and Ghost\nBig gave her one more chance and she took Big down\nI should've knew when Shock G and Pac told me she get around\nAn angel\n\n[Hook]\nI wanna turn up the sound and spread my wings\nBecause I'm riding with my (angel)\nGoing through the city of the Chi\nMakes me feel like I'm in the city of (angels)\nOhh, I wanna fly, fly away with my (angel)\nShe takes me high, she will always be my (angel)\n\n[Verse 3: The Game]\nFly away, fly away\nMy love for her is not about jewelry and cars\nI love her cause she love me, just for who I are\nWho I is, who I am, resembles the rims on the Lam'\nI shine like Shyne when Barrington Levy was sayin\n\"Didilly whoooa!\", I got love for the streets\nPeace to New York and every hood in the East\nBefore I was duckin' cops, gunshots\nI used to be an L.A. Dodger, now I'm a (angel)\nFrom the city of lost souls, Impalas and polished gold\nBetween the car and the rims, we got a lot of chrome\nYour hood not alone, they knockin, we not at home\nAnd when they bust in, we not Caesar, but gotta roam\nCause they try to wire phones, I'm talking Verizon phones\nThe ones they put wires on, they got us on tap\nBut I put wires on, my Bentley in fact\nI spit it through the wires on a Kanye track\n\n[Hook]\nI wanna turn up the sound and spread my wings\nBecause I'm riding with my (angel)\nGoing through the city of the Chi\nMakes me feel like I'm in the city of (angels)\nOhh, I wanna fly, fly away with my (angel)\nShe takes me high, she will always be my (angel)\n\n[Outro: Common]\nYeah, it's The Game and Common\nSpread your wings, follow your dreams\nThings will be so serene\nL.A. and the Chi is a team\nYeah, angel supreme, yeah, keep on\nYeah, it's for the world boy\nWe do it forever, yeah"}]}