{"songs": [{"title": "I Rap Now", "album": "Good Job Larry", "year": null, "image": "https://images.rapgenius.com/25408261fe24b342b7ee98e43603c582.600x607x1.png", "lyrics": "[Intro: Larry June]\n\n[Verse 1: Larry June]\nTook a bad bitch shopping I was feeling good today\nCopped the Chinese chopper, had to use it yesterday\nEating pho with my niggas, rice, noodles, and the steak\nIf this lick go good, my whole crew'll be straight\nWhy these niggas wanna hate? I just checked another eight\nBitch we eating hella good, maybe you should get a plate\nDo the lobster and the steak, old school on 28s\nAll I do is count money, designer shades on my face\nThank God for the trap, 20 bands on my lap\nShe only knew me as a pimp, she was surprised that I rap\nI don't need a record deal, bitch I need another strap\nWake up early, take my vitamins, and blow another rack\n\n[Hook: Larry June]\nThey done fucked around and let me in the rap game\nI treat the rap game just like the trap game\nI was so excited when them fucking packs came\nI treat the rap game just like the trap game\n\n\n[Verse 2: Larry June]\nDon't hit my phone on no motherfucking holiday\nIf you wouldn't hit my phone on no fucking normal day\nLoading up the chopper, ammunition unlimited\n.223, God damn. Oooh wee. Aye\nPaper stacking gun clapping niggas at the cinematic\nTake the money then I'm bouncing like a mattress\nNever bring a punk bitch to the palace\nIf I really wanted could've been had it\nSee a nigga winning, now they swagger jacking\nI'm the realest nigga point period, know they wanna rob me but it never happen\nHit a nigga on his trap phone\nTwelve hours on the interstate\nGiving rap niggas platforms\nWhen I re-up make the block shake\nWent up for it, then I pump faked\nHad to throw these little niggas off\nChoosy Susie, had to cut her off\nFaggot bitch, playing with a boss\nI don't give a fuck about the cost\nRemember days I was dead broke\nDamn, I didn't have nobody\nMan now these niggas want a free verse\nEveryday I'm in the trap serving\nTell me what you need\nBut I'ma need a fee. Ain't shit free\n\n[Hook: Larry June]\nThey done fucked around and let me in the rap game\nI treat the rap game just like the trap game\nI was so excited when them fucking packs came\nI treat the rap game just like the trap game\n\n[Outro:\nAye, check it out nigga though, nigga look, 100 though\nI might quit rapping today, nigga\nI'd rather go fishing, nigga look\nAye check it out, God damn, sock it to me\nNow listen here sweetie\nDo you understand now?\nLook, fuck the motherfucking rap game nigga\nRealest nigga in this shit,nigga straight up nigga\nI'm at motherfucking Whole Foods getting my motherfucking vitamins and orange juice, nigga\nI gotta stay healthy on a punk bitch doe\nGod damn, sock it to me\nYee Hee, aye aye\nLook, check it out"}], "artist": "Larry June"}