{"artist": "Watsky", "songs": [{"year": "2016-08-19", "lyrics": "[Chorus]\nI’m going down\nI’m going down\nI’m going down\nOn you\n\n[Verse 1]\nI’m breathing deep then I leap in\nI’m going under\nLike eating that V’s the key to how we can beat global hunger\nAchieve total peace on earth\nI’m a freak, I’m a local wonder\nMore lung capacity than Freddie Mercury vocal numbers\nI plunder the briny deep\nA spelunker plunging in, hunkering down in between those puffy pink walls\nLike a fallout bunker\nAnd if I never emerge to the surface don’t gimme shit\nIn twenty years I’m back like Kimmy Schmidt (wassup)\nHold up, wait (Hold up, wait)\nCause I really gotta set one thing straight\nI’m not chowing on the chocha so that you’ll reciprocate\nI just go in (go in)\nNo strings (no strings)\nTastes great (tastes great)\nFun times (vitamins!)\nI got a wand tongue\nI’m doing sorcery\nIf you don’t want none\nWell that’s just more for me\n\n[Chorus]\nI’m going down\nI’m going down\nOn you\n\n[Verse 2]\nI’m going down on you like I like it but bruh I’m lyin’\nCause I don’t like it, I love it that shit’s my valentine\nOne tiny warning—I’m dining on your gourmet form until the morning\nPerforming like it’ll stop global warming\nMy palate has got no equal\nTalent could vanquish evil\nAnd maybe make Rick Moranis be in the Ghostbusters sequel\nOne taste and I’m wailing “god bless!” (god bless!)\nUntil you quiver I will not rest (not rest)\nLicking repeatedly like your beaver’s a square reader\nAnd my tongue is a VISA debit card that failed to process\nIt’s like the Miracle Worker and I’m blind and I’m deaf and dumb\nPlus each inch of my body’s numb except for the tip of my tongue\nAnd each Wikipedia topic’s printed in microscopic raised ink on your clit\nSo the single option I got to know something about this wonderful globe that\nWe come from so locate your swollen bean and then probe the folds of it\nFiendishly til you cum about infinity times\nAnd baby that isn’t a crime\n\n[Chorus]\nI’m going down\nI’m going down\nI’m going down\nOn you\n\n[Verse 3]\nGiven our planet’s gender ratio\nIt’d be a mockery glossing over fellatio (there he go)\nMeaning that really fucking quick\nI gotta touch on sucking dick\nMany guys visualize giving BJs and say “eww”\nBut can we just please give smoking pole a calm objective view?\nI’m pretty straight, but I’ll state: sexuality’s an arc\nMaybe I can suck a flashlight so my soul will not be dark\nWhy couldn’t I get sexual with a man at all?\nAt thirteen I was in my bedroom fucking stuffed animals\nIf I can bang an inanimate object can’t I jam the crotch of a man in my jaw and softly massage it?\nFellas vomit like “what if the sausage is smelling hella funky?”\nDon’t you wash your fucking junk, B?\nOf course I wouldn’t devour icky salami\nBut that goes the same for encountering stinky punani\nSo in this scenario where I brush my teeth with a penis\nLet’s assume that the penis we’re dealing with sparkles the cleanest of all\nPenis penis on the wall\nWith those well proportioned balls\n\n[Chorus]\nI’m going down\nI’m going down\nI’m going down\nI’m going down\nI’m going down\nDown, down, down\nI’m going down\n\n[Verse 4]\nSo let’s say you’re okay with your lips around a cock\nBut you still can’t wrap your mind around the final moneyshot\nDon’t give up! If the nut is what truly makes it foul\nThen just get him close to busting and hand him a paper towel\nYup! No gravy on your chin!\nYup! Everybody wins!\nYup! Squirrel to an acorn\nDudes like to look at dicks in their straight porn\nPut your hands up if you got hangups\nPut your hands up if you got hangups\nIf I could get with it I’d have a wider ocean I’m fishing in\nBut I’m inhibited by my social conditioning\nSo where my head’s at present the odds are gloomy\nThat I would agree to feast on a D that’s presented to me\nBut I’m not officially ruling out\nThat at some point in my life I’ll have a dingaling in my mouth", "image": "https://images.genius.com/caf3c17709b04ff24300da4d62da46fa.630x630x1.jpg", "album": "x INFINITY", "title": "Going Down"}]}