{"artist": "Ace Hood", "songs": [{"title": "Clarity", "album": "4 Da Fuck Of it", "year": "2015-10-14", "lyrics": "[Verse 1:]\nI ain't really with the talkin'\nI ain't with the flossin'\nMan what's the word?\nI can't call it Ace, where you been?\nBitch been ballin, smokin what you call it\nPockets lookin brolic\nDiamonds on me polished\nAnd smoking chronic\nYeah, bout it bout it boy\nI've been in the dungeon\nAin't no easy does it\nLike its Shaq in center\nAin't no easy buckets\nThis that couple million nigga fuck a budget\nIf you starving for it, know that sucker comin'\nI've been up to something, yeah I'm up to something\nIn that mansion, laughing at you up and comings\nGotta a chick who pussy like the faucet running\nI've been out in Europe getting foreign money\nThis the jump-back like I never left\nSwitch the flow cause they bite mine\nFunny how them niggas analyze, funny how them niggas analyze\nFuck you niggas on that other side\nAll you pussy rappers out here tellin lies\nI've been waiting patient niggas swear to god\nKnow the revolution will be televised\n\n[Hook:]\nAnd please understand that y'all niggas ain't scaring me\nLet's get some motherfuckin' clarity\nDiamonds in my watch, clarity\n\n[Verse 2:]\nI'm insane nigga, taking pain killers\nAin't know small talkin', got the chain bigger\nNiggas claim triller but I know they not\nYou the type to go and testify\nYou the type to get your dog shot\nYou the type to be a mall cop\nYou the type to go pillow talkin' with the bitches put a nigga business out\nI'm the type to goin see a body\nMost y'all ain't never seen a body\nGimme gimme, semi so retarded wet the fuckin party\nWho coast-guarded? I am so sorry to my loyal fans\nFree shows for the live band, tell my CEO I'm goin back\nTell em' to issue me a new advance\nDon't compare me to these other rappers with these same flows\nAnd their songs whack. I am better breaded, I am Hercules\nI am such a genius, and your tempurpedic\nNigga soft as ever, talking pigeon feathers\nKnow the storm coming, better check the weather\nYou will see me never, talking Stevie Wonder\nThey been sleeping mama, time to wake the monster\nI am sick of playing, I am sick of talking\nI been doing yoga just to keep me calmer\nCountin hella money in my new recliner\nGot my stripes in it like I'm Carson Palmer\nIf you hatin' on me nigga fuck your life\nI Wish your mom and daddy woulda worn a condom\nI'm in beast mode, I'm talking Marshawn, talkin Ronda Rousey, nigga Lebron James\nIn the studio, no shirt smokin loud dawg with some gold chians\nJay with me, G with me, P too, Hood Nation\nCall ya bitch, whenever dog, 9 o'clock, reservation\nBe patient, fans waiting\nFourth one, Starvation\n\n[Hook:]\nAnd please understand that y'all niggas ain't scaring me\nLet's get some motherfuckin clarity\nDiamonds in my watch, clarity\n\n[Outro:]\nClarity, motherfucker\nI'm talking 24 karat gold not that 18 shit\nYa Dig?\nClarity\nI'm talkin' about stones so motherfuckin' then clear, clearer than blue ice nigga\nClarity\nSee these hoes back of that big Rolls nigga\nThese flows made of gold, pussy nigga\nI'm taking 3D not HD, ya dig?\nYou gotta put your 3D glasses on for this nigga\nAyo Broward, we got this shit nigga\nLet's make this shit clear\nWe gonna change the game with this shit nigga\nS4 nigga let's get it\nHood Nation", "image": "https://images.rapgenius.com/643ebbd0f1d245f2caacb4aac49157a7.500x500x1.jpg"}]}