{"artist": "Bow Wow", "songs": [{"album": "Wanted", "title": "Do You", "year": null, "lyrics": "[*chants of girls screaming \"Bow Wow\" over and over*]\n\n[Bow Wow]\nUh-huh, uh-huh, UH..\n106 & Park ain't been the same since I had it\nSo I'm back at it - freeze\nStill a Juvenile at 400 Degrees\nLil' girls still fallin' out, I'm still ballin'\nCrawlin' out the hottest speeds on these ATL streets\nFrom the Garden, to the box office, I shuts down both\nAnd no matter where I go I'm still, O-H-I-Ohhhhhhh\nE'rybody know this is MY turf!\nWho had it crunk first, and had girls of all ages off one verse?\n(YOU!) Ain't nobody else can name\nAnother seventeen year-old manye that do it this HARD\n\"Oh LORD\", that's what them old niggas say about me\nYoung niggas play, can't go a day without me\nIf bling was a drug, I'd DIE from an overdose\nFresh Prince to Sugarloaf, Homey I'm the most you've seen\nI got the same affects on both coasts\nAnd e'rything hot on fo' wheels, homey I'm ghost\n\n[Hook 1]\nDo you - stop tryna be me, stop tryna be he\nStop tryna do what you see\nDo you - Cause right here is my love homey\nGo back to where you came from and get yo own homey\nDo you - It's so-so sloppy and the fans know a copy\nWhen they see one, I would neva wanna be one\nDo you - As long as it sound right\nE'rybody in town like it\nDon't worry 'bout nobody else, else\nDo you\n\nNot just the rap game, the whole industry the same\nE'rybody wanna look and sound like the next manye\nBut I'm definite there ain't another me\nAnd I'm So-So-Definite, back wit J.D\nBack to give these little imitators sumthin' to talk on\nBreathe, Stretch, let it go, homey get yo walk on!\nBlack Beat, Teen People, can't forget Right On!\nA lotta things changed since the young don's been gone\nWhat chug on roll with? The future is me!\nOnly youngins that's movin' units is.ugh.ME\nYoung Ali, float like a butterfly\nGet up out them stores quick, why wouldn't you wanna buy?\nThe carbon copy, not the copy\nImitators mimic, but them guys is sloppy, heh, heh\nAs for me, I'm the leader of the new school\nI can just ad-just, so the rest of y'all just\n\n[Hook 1]\nDo you - stop tryna be me, stop tryna be he\nStop tryna do what you see\nDo you - Cause right here is my love homey\nGo back to where you came from and get yo own homey\nDo you - It's so-so sloppy and the fans know a copy\nWhen they see one, I would neva wanna be one\nDo you - As long as it sound right\nE'rybody in town like it\nDon't worry 'bout nobody else, else\nDo you\n\n[Jermaine Durpi - talking]\nSee?!\nIt's rare to find people like us..\nEverybody out there doin what I'm doin!\nOr tryna do what I'm doin, you can't man!\nAt one point in ya life, man, you gotta get in yo own lane and stop swervin' in mine!\nSee what I do, I do my way!\nWhat about you, huh?! HUH?! CAN YOU SAY THAT?!\n\n[Hook 2]\nDo you - stop tryna be me, stop tryna be he\nStop tryna do what you see\nDo you - Cause right here is my love homey\nGo back to where you came from and get yo own homey\nDo you- [Choir singing]\nDo you\nDo you\n\n[*chants of girls screaming \"Bow Wow\" over and over*]", "image": "https://images.genius.com/c31e82700b0078d6105302d26898085a.500x500x1.jpg"}]}