{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/keith-murray-e1302009751237.jpg", "title": "Whut’s Happnin’", "lyrics": "Intro:\nNiggas can't hold me back\nWe ain't comin' for no bullshit\nNiggas talking all that yackedy yack word up\n\nVerse 1:\nHere's to Mrl Keith Murray\nThe Mr. Pictionary\nThe Mr. quicck to fuck shit up in a hurry\nON the mic I'll squash you little Ms. Philosoophy\nWith atomic technological atrocity\nI find it very ironic that niggas try to rhyme behind me\nThe supersonic Def Squad MC\nGet bird's eye view\nAnd don't miss the crispiest nigga in the nucleus\nWith futuristic linguistics\nBallistics be twisted like physics (word up)\nNiggas be like how you come up wit this shit\nBut it's automatic, I'm inorganic\nWith the ability to travel nine planets\nNiggas can't undrstand it, please\nI spark the brain of your G's\nWe could battle for car keys and car titles\nHouse deeds and bank accounts to make it final\nI got what you need\nThe most homicidal words to co9me out of a human being\nMind state sick like Idi Amin\n\nHook:\nYou can do what ya got to\nAnd say what you may\nBut niggas gonna come outside wit gun play anyway\nSo I play the game\nAnd let the ball bounce where it may\nAnd roll with Def Squad and L.O.D. everday X2\n\nVerse 2:\nAbracadabra talk shit I'll reach right out and grad ya\nThe hype got you like gimmy\nDon't let it have ya\nI'll knowck you skeezas pleasers black like Jesus\nNever lost in the jungle\nNavigators with caesars\nInstead dare iz a dark side said by Red\nI'm consciously, crusciously coming for your head\nI'm from a small coast call stay out my path\nAnd from a big city called foot up in your ass\nJeepers, weepers, peepers get snuffed\nBy the sneakiest, throughout the speakers\nLike fist to cuffs\nWho the fuck is this paging me?\nOh, it's my creepy, greepy, grimy\nRough rhyme, crimy Reggie, I'm saying\nFuckwho, went where, when, why and how\nGet my shit to me not now but right now\nLucky niggas went platinum\nThinkin' they can see us\nWe swoop down on crews\nLike angels on dust\nI'll leave you mental so broke\nYou can't pay attention\nWhen I get inside your head\nAnd take your brain to another dimension\nI'm itching for a scratch\nAnd somebody to try to match\nThe battle cat constatly be on it like that\nThe doom has dawned in\nWe knockin' niggas out without warning\nAnd pissing on them\nThe configuration is brain cell wastin'\nRenegades of funk\nLike Africa Bambatta and the Zulu Nation\nYou facin' a maniac\nPacing over the track\nConstantly bringing drama like Jason\nIn fact I'm L.O.D.ing it and there go planet Def Squad\nPuttin' it down play for play like Ahmad Rashad\nFor the cause, I\"m wiring jaws\nGot niggas eating full-course meals out of crazy straws\nAnd if it win't def it ain't shit\nI'm taking it to the limit\nAnd killing it each and every minute\nCause Keith Murray takes the beef a major step higher\nAnd peace makers will get causght in the cross fire\nHip Hop's filled with back stabbers\nBlunt grabbers, cats with dirty claws, dogs with filthy paws\nThen you got rap artists\nClaimin' to be the hardest\nBust them in their shit\nAnd they're quick to press charges\nSpot rushers, block busters, rockin' diamond clusters\nComin' to stick the rich out you motherfuckers\nEducated black man on premises\nL.O.D. and Def Squad forever Arch nemesis"}], "artist": "Keith Murray"}