{"songs": [{"album": "Soul Searchin’ / Big Bad Wolf", "image": "https://images.genius.com/39f0d825a2b87a843ea1a8f3fb08d4c5.306x304x1.jpg", "year": null, "title": "Big Bad Wolf", "lyrics": "[Hook]\nI've got my\nGun on spray, so don't try to *pop* *pop*\nRun away, hit 'em with the big bad wolf\n86 sick streak inside of me\n\n[Verse 1]\nI'm giving 'em a dilemma\nThe coming of a killer, the phantom\nOf all niggas who wanna be Nina\nBut listen\nI kill a bitch in a vision of \"Milli-Vanilli\"\nMotherfuckers who's being murdered by the big bad wolf\nComputerism, I'll give em a Push\nRipped you and your mocking crew\nWhat you gonna do when I pop at you, Glock at you\nFill em with the venom. Who the fuck are you talking to?\nBetray me? you crazy! The Keyser Söze, Kevin Spacey\nNiggas hate me, can't face me\nBitches like Cagney and Lacey, basically, you can't ace me\nI put that on school is the Lil Tracey, ya better mace me, 'cause I'mma fuck up a niggas career\nIf you think you trying to bite me, taste me; listen to me\nLike guerilla monsoon, I'mma a wolf, so I howl at the motherfucking moon\nI can smell a rotten fella, cotton dwella; hella props to the jella, my nigga loom\nTwo little pigs, niggas who wanted to be the big bad wolf, Tecca Nina clone\nThat's why this little piggy hit the carpet and the other little piggy stayed home\n\n[Bridge]\nChrome, huff and I'll puff\nAnd I'll blow that fucking mic down and stuff\nHit me with a silver bullet and get it outta me\nCause a weak bullet is only a mini-technicality\nFollow me nigga\nIf you gotta be Nina to get a bigger salary, motherfucker\nTo bust flows like Joe's or like those\nWho make relish and throw midwest blows at foes\nTake another look, you ain't off the hook, you been peeking in my book nigga, look [x3]\nYou being a bitch as in Brooke, you're nothing but a crook\nSo you niggas can't fuck with the big bad wolf\n\n[Hook]\nI've got my\nGun on spray, so don't try to *pop* *pop*\nRun away, hit 'em with the big bad wolf\n86 sick streak inside of me\n\n[Verse 2]\nYou thought you built your rhyme out of some brick\nTech N9ne blew 'em away like stick\nLet's find, who got the way tight licks\nI bet mine, you'll get em, cause they like this\nThe real shit, Mama Mia, Disagree-A, I really better see a-then be a\nCause when a nigga flowed what he wrote, sorry\nThat's all folks Ah-Ba-Dee-Ah-Ba-Dee-Ah-Ba-Dee-Ah\nYou little niggas, you can't fuck with the wolf\nYou a devil with hooves and death books\nCame to a Tech N9ne show and got took\nBy the lyrical anghellical voice that's shook\nSatan, the lord rebutes ya. The power of Christ compels you\nTo get the kcuf away from the ish\nI'm spitting; you're losing, I'm sorry to tell you\nWho the man now? Who the man now?\nMotherfucker, you a student, put ya hand down\nTryna growl like a wolf, tryna pop like a Tech N9ne\nLittle nigga, you can peck mine\nI'mma hairy motherfucker with whiskers and I flips a\nHella script from here to Lamaviska\nKiss the fist of a nigga who walks so hard on niggas like you\nI'll get a goddamned blister\n\n[Bridge]\nNigga, huff and I'll puff\nAnd I'll blow that fucking mic down and stuff\nHit me with a silver bullet and get it outta me\nCause a weak bullet is only a mini-technicality..\nFollow me nigga\nIf you gotta be Nina to get a bigger salary motherfucker\nTo bust flows like Joe's or like those\nWho make relish and throw midwest blows at foes\nTake another look, you ain't off the hook, you been peeking in my book nigga, look\nTake another look, you ain't off the hook, you been peeking in my book nigga, look\nTake another look, you ain't off the hook, you been peeking in my book nigga, look\nYou being a bitch as in Brooke, you're nothing but a crook\nSo you niggas can't fuck with the big bad wolf\n\n[Hook]\nI've got my\nGun on spray, so don't try to *pop* *pop*\nRun away, hit 'em with the big bad wolf\n86 sick streak inside of me\n\n[Outro]\nI've got my gat on ya tongue, so don't try to...*pop* *pop*\nDuck and run\nCause I'mma let ya know that wolf in reverse says flow\nI gotta big bad flow and I'mma let ya nigga know that I rip it, Cause I believe\nSix, six, triple eight, forty-six, ninety-nine three\nDo ya know\nBig...Bad...Wolf...Smash...Chrome...Dome...Long...Gone..."}], "artist": "Tech N9ne"}