{"artist": "Paul Wall", "songs": [{"album": "Fast Life", "title": "Fly", "image": "https://images.genius.com/fc476c06b3838ac78e721d7557b67ca4.1000x1000x1.jpg", "lyrics": "I believe I can fly, fly, fly\nI believe I can fly, fly, fly\nI'm so high, I'm so high\nI'm so high, I'm so high\n\nI believe I can fly, fly, fly\nI believe I can fly, fly, fly\nI'm so high, I'm so high\nI'm so high, I'm so high, I believe I can fly\n\nBitch I'm sittin' so high, I believe I can fly\nThe coupe looks delicious, the rims are waving bye\nMoney long like Diddy, I put on for my city\nCologne Kush and Henny, I'm gone in that hemi\nI'm gold but you don't hear me\nFour to the dome if you can hear me\n\nI'm so high, I'm so high, I'm so high\n\nThey say I need a pull up, when I pull up I'm the shit man\nWhen I grow up I wanna be like T-Pain, a hit man\nBut do yourself a favor partner, don't be talkin' shit man\nYou're broad done up and broke your heart\nMy whole squad hit man\n\nHold up I see dead people\nIt's just the dead white guys on my bread people\n\nFly, fly, fly, I believe I can fly, fly, fly\nI'm so high, I'm so high, I'm so high, I'm so high\n\nI believe I can fly, fly, fly\nI believe I can fly, fly, fly\nI'm so high, I'm so high, I'm so high, I'm so high\nI believe I can fly\n\nI'm high as the moon and I'm flier than a mosquito\nStackin' my chips, I got a bag full of Doritos\nI'm too cool for school so I'm teachin' a class\nChiefin' on that purple rain partner, puff, puff, pass\n\nSee I'm higher than the price of gas, gone off vanilla cream\nRollin' off of Mac Dre leanin' like a triple beam\nI got my wrist froze up like computer screens\nSo fresh, so clean exhale sticky green\n\nI got the top steady droppin' like record sales\nPaint changin' colors like Tyra Bank's finger nails\nChoose the fast life, I'm the flashy type\nDiamonds in my mouth sparkle look like sprite\n'Cause I'm fly\n\nFly, fly, fly, I believe I can fly, fly, fly\nI'm so high, I'm so high\nI'm so high, I'm so high\n\nI believe I can fly, fly, fly\nI believe I can fly, fly, fly\nI'm so high, I'm so high\nI'm so high, I'm so high, I believe I can fly\n\nI believe I can lean spite and codeine\nSomeone's sleepin' on the scene\nThat's a hell of a dream, I'm a hell of a guy\nThat's a hell of a blunt, fire it up, lets' get high\n\nYou can call me G five 'cause I be in the clouds\nSomewhere in the club with my clothes smellin' loud\nAnd never will I smile 'cause I be bitin' down\nRollin' off a P probably muggin' with a frown\n\nBut no, ain't nothin' wrong how could he be on rich\nBitch looked at my whip, bitch looked at my wrist\nMy wrist is tricked in ice, my neck is dripped in ice\nBitch look at my life, don't you wanna be my wife?\n\nWould you like to be my girl?\nDon't you wanna change your life?\nI can change your life\nGrab the credit card and swipe, like see?\n\nFly, fly, fly, I believe I can fly, fly, fly\nI'm so high, I'm so high\nI'm so high, I'm so high\n\nI believe I can fly, fly, fly\nI believe I can fly, fly, fly\nI'm so high, I'm so high\nI'm so high, I'm so high, I believe I can fly\n\nFly, fly, fly, I believe I can fly, fly, fly\nI'm so high, I'm so high", "year": null}]}