{"artist": "C-Rayz Walz", "songs": [{"title": "Guns and Butter", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nThe loca.  Caliente.  Hey, god.  (Rich, rich).  R'Thentic.  C-Rayz.  Guns and butter!\n\n[Verse 1: C-Rayz Walz]\nGo back upstairs.  Eat your mac cheese and fish sticks\nYou not 50—you gon' die tryna \"Get Rich\"\nI spit sick—my lungs' disease is from Asia\nMy LP's a \"Funcrusher\" too—my Fantasia's\nRoy Jones, knock opponents out and ball too\nI'm a MC!  (Yo!)  What the fuck they call you?!?\nPussy.  My grammar's truth, y'all\nYou wanna be a player just to dive for loose balls\nDickhead, come out your face, say somethin' slick\nMy lines get all up in your ass like your uncle's dick\nThat chick said you're a small piece of wood\nStuck in her fingertip—(Huh?)—little prick!\nYou ain't even on my son's level—he just a little sick\nThis ain't really nuttin', devil—it's just a little bit\nIllegitimate trip through my scenic path\nIf I really spit, the kids would hate English class\nDo the math—my science will blow up your lab\nSlow up your staff.  I laugh at your arts and crafts\nYou ass, smelly socks and jocks—gym trash\nDrag back those who study honies with [drab bags?]\nSon you, have your moms yellin', \"Hey, they bagged dad\"\nCome through, bomb you like schools in Iraq\nDumb dude.  Fact: you fiction.  Stop you spittin'\nRaps collapse your ear where wax'll stack.  Listen\nDrum tap, young cat, old vision, soul glisten\nGun clap, one-track mind, rhyme, whole-rhythm creatin'\nInstead of waitin', refrain from thought patterns\nOf your dame givin' me crazy brains like horseradish\n\n[Hook: Natural K.A.W.S. and C-Rayz Walz]\nGet those props, follow my light\nSpit so hot.  Last week, I had to swallow my ice\nWe in the year with a token ending, swollen sentence\nOff the chain like a stolen pendant\nGet those props, follow my light\nSpit so hot.  Last week, I had to swallow my ice\nIn the gutter where suckers'll cut ya, mothers'll hug ya\nIt all comes down to guns and butter\n\n[Verse 2: C-Rayz Walz]\nI already seen a mill'/Amil, but you ain't even heard me yet\nShe moves well without the Roc like the Jersey Nets\nYou can't get in the game, your position is lame\nStay on the bench—enjoy the wood, you Marc Twain character\nI'm holdin' back!  So I won't melt the polar caps\nSo good off the top, my hairline's growin' back\nI make sense/cents now.  I'll make dollars later\nHolla, hater.  Catch a scratch from the Cut Creator\nThese is Reebok lines—they supposed to be pumped\nAnd get your smoke for free like promotional blunts\nYour style standard.  My style is simply candid\nI don't jerk off no more—I came empty-handed\nHoneydip said, \"You spit like you sprayin' a clip\"\nAnd wipe my mouth off with tissue—I be sayin' some shit\nSo you can stack cracks, clap gats, or rap\nWe where the wild things are and it's a fact I max\nSubtract the whack.  Now divide the stacks\nMultiplied by the feel of the real and I'm back\nAnd my DAT contains the masters, so I maintain disaster\nPolly with NASA, master tracks\nAnything less than that?  I'm bridgin' the gap\nLike African tribes, I got pussy sewed up—it's a wrap\nBut if it's that deep, dap me—clap me too\nI fear none of you characters, like Scrappy Doo\n\"C'mon, put 'em up!\" Make the rumors greater\nMy name's fate—we gon' meet up, sooner or later\nGive you fools Juelz like a Santana verse\nAnd wreck the beat 'til your bandana burst\n\n[Hook: Natural K.A.W.S. and C-Rayz Walz]\nGet those props, follow my light\nSpit so hot.  Last week, I had to swallow my ice\nWe in the year with a token ending, swollen sentence\nOff the chain like a stolen pendant\nGet those props, follow my light\nSpit so hot.  Last week, I had to swallow my ice\nIn the gutter where suckers'll cut ya, mothers'll hug ya\nIt all comes down to guns and butter\n\n[Outro: C-Rayz Walz]\nThis is crazy, boy.  Yeah, we cray, yo.  Yo, no doubt.  Guns and butter.  That boy love that breast.  That's what's up.  We gon' keep all of that too.  Yo!"}]}