{"artist": "Apache", "songs": [{"title": "A Fight", "image": "https://images.genius.com/7b040bdcfb9c6c3e03af2d9b25c4c25d.500x500x1.jpg", "album": "Apache Ain’t Shit", "lyrics": "\"Fight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\nFight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\"\n\n[Apache]\nShould I give it to 'em straight, water it down, fake or front?\n(]]?) Nah fuck that, let's be blunt\nI fought one of Yacub's crafty caucasoids\nMy burner's smokin all American whiteboys\nSaid, \"Excuse me,\" he ignored me I figured\nEverything's peace 'til he yells, \"You dirty black nigga!\"\nHold on, stop, don't that word mean ignorant?\nNah, fuck that, I know what the nigga meant\nCrack that jaw, what's more bring it\nI'll rip your fuckin arm out the socket if you swing it\nMotherfuckers think cause they're pink they're immune to me sure\nI'm a virus you don't have a cure for\nGuard your grill caucausian, you want clout?\nLet him swing first then I knocked his ass out\nShoulda shanked him, could get sued too\nFuck around my next single'll be with the Lifer's Group\n\n\"Aiyyo a fight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\nFight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\"\n\n[Apache]\nHere comes five-oh (five-oh) at least four or five deep\nTryin to creep cause I put paleface to sleep\nI'm with it, you're damn right I did it\nCause his punk-ass provoked me and you ain't gonna smoke me\nStab or snuff me, tried to bumrush\nDidn't think I was quick enough to slip the cuffs\nI for one spun around but knuckled up\nLeft jab, right cross, then an uppercut\nTried to dodge duck dip on the flip tip\nTurned my head and my grill caught a nightstick\nThings looked dim, not for me, for him\nCause out of nowhere, my troops stormed in (YEAH)\nPosse up, time to roll and show no fear\nCome prepared and oh yeah, wear your right gear\nI won't attack a cracker for nothin\nIf a black and a white's in a fight I'm jumpin in\n\n\"Yo it's a fight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\nFight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\"\n\n[Apache]\nI got 'em hopin and prayin for a great white hope (yeah)\nBut all they come up with is great white dopes (huh)\nClumsy honkies tryin to damage\nTheir best friend in the ring is a towel and the canvas\nYou feel mighty? Don't play fight me\nWe won't tussle straight up I'mma bust ya shit whitey\nYou'll rupture, your structure's narrow\nMy body is the bow, the left, the right jab, the arrow\nSo who's next to test? It's not wise or smart\nIt's a brawl, and I'mma flush all your vital parts\nSo you want me you little Marky\nLet's play a game - it's called PIN THE TAIL ON THE HONKEY\nToo much of the black fist, he couldn't hack this\nPound for pound his body became, target practice\nIn a fight with a white if I don't win\nThe whole crew jumps in!\n\n\"Aiyyo a fight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\nFight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\"\n\n\"Yo it's a fight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\nFight, fight, a nigga and a white!\nIf the nigga don't win then we all jump in!\"\n\n(Yo Apache you really fucked that white kid up!)\n\"Ay Vinnie, I kicked the fuckin mooley's ass y'know?\"\n\"Yo fuck this, all this nigga chit!\nLet's lynch all these black mudafuckas!\"\n\n{*beat starts again*}\nFuck it up! Fuck 'em up! Fuck 'em up!\nFuck 'em up! Fuck 'em up! Fuck 'em up! Fuck 'em up!", "year": null}]}