{"songs": [{"year": "2015-01-01", "album": "My Garden", "image": "https://images.genius.com/013b47b8215acf4440599b8453b44511.640x640x1.jpg", "title": "My Garden Commentary", "lyrics": "My GardenWell the concept of it is actually kinda sexual. It's about a women, who is inviting you into her garden and she is offering her vagina to seduce this man and for him to ultimately become her sugar daddy.Gangsta\"Gangsta\" was a record I wrote, at this point, three years ago and it was just  an autobiography of my life and it ended up becoming this kick off to...you know, where the rest of my career and artistic landscape was gonna to take me basically. \"Gangsta was a song that I actually wrote in my first independent EP called \"Shades of Gray\" and it came out completely organically and it was actually a song that, if I had never written it and never came out of that project. None of this would of happened, my garden would have never existed so...it's really exciting.Crazy\"Crazy\" is a song that when I first heard it made me feel like it makes everyone else feel and that's why I'm so grateful for all the reaction that it gets. It's that you know...sometimes we do go crazy about people and we you know, we fall for someone really hard and we feel like we are insane and that's basically what the song is evoking and that's what I wanted to evoke in the video. Just all these different emotions that a girl is going through. When she's kinda feeling a certain type of way and she doesn't know how to handle her emotions.Saturday Sunday\"Saturday Sunday\" a record, it's almost like a turn up record disguised as this kinda like really robust and kinda sexy, mysterious song. But it's really talking about turning up on the weekends and then showing up to church the next day like \"hey!\"I Think I'm In Love\"I Think I'm In Love\" again is a record that actually came up from a conversation. Someone asks me \"Hey, Kat, so what does a love song sound like from you?\" and I was like, \"I don't have no love songs\" and then I was like \"well, maybe I do, I have one.\" So I played it and it ended up getting this amazing reaction, so we decided to kinda revamp it, record it and put it on the album and now it's one of the favorites.Tumbao\"Tumbao\" is a record on the album that is in Spanish. It was inspired by Celia Cruz's \"La Negra Tiene Tumbao\" and I thought it was really important to put a Spanish record on the album just to give a shout-out to my Latinos out there.Mirror\"Mirror\" is a record on the album that we put out and it kinda just grew organically, on it's own and it ended up being something that so many people related to. It's just a song that talks about universal love and so many people have put out YouTube videos, covers, and songs and dances to it and it's a record that grew organically kinda like love grows organically and it felt like really important to have it on the album.Lava\"Lava\" was a really fun record to do. I did that one with Salaam Remi. We where just in the studio and there was really no pressure at all. We really weren't planning on...we just wanted to get the record done 'cause we just were tired and we wanted to go home. So I was like \"yo, just let me go in the booth and I'm just gonna like, let's just finish this and put something down.\" It ended up, I don't know, I was reading a really intense book that week and really sexual book that week. The book was called \"Sex and Punishment.\" Yeah the book was called \"Sex and Punishment.\" It was like a, what was it called four-thousand years of judging desire and it talks about like basically the history of sex and women's suppression and homosexuality and all these things. So then, I don't know, I went into the booth and I just must've been feeling extra sexual and we finished the song in like thirty minutes.Walk On WaterSomebody had sent me that track, and only like a snippet of it and I didn't know where it came from. And they were like \"yeah, I want you to get on this, you know I'm a be on the verses and you can be on the hook and da-da-da-da-da.\" And I listened to the track and I was like \"oh my God, this is like amazing\" and I was like \"yo, let me keep this for myself\" and they're like \"nah, nah, nah, nah, this is for me!\" I was like \"alright\" and then I went to the studio and I cut it anyways. So I wrote \"Walk On Water\" and I cut it and then I was trying to hit him up to ask him like \"yo so, you know, where'd you get the track?\" Just trying to be lowkey and he's like \"nah, nah, nah, I'm not telling you.\" Come to find, that it turns out, that is was from the movie, Inception. So we ended up having to reproduce it and revamp it and just like redo the whole thing over, but it still sounds super-amazing. It's one of my favorites actually on the album. So yeah it had a long journey of deception and deceit and in so many ways, in more than one, but it made it to the otherside. Ching!Clocks\"Clocks\" is another record that I did with Salaam. Super fun. It was like right after New Years Eve and we basically wrote it - we were talking about right \"when the clock strikes twelve\" because that New Years Eve we were turnt up as ever. So we just wrote a song about the night.Just Another Dude\"Just Another Dude\" is a record on the album I wanted to keep completely acoustic. It's the only song on the album that's totally acoustic and I felt like it was important because so many songs on the album tend to be a little more produce. I felt like the way I cut it that day, I just went in the booth and I was just feeling a certain type of way and it was another song I just finished real quick and I wanted it to have that same emotion, that same vocal cut and I wanted it to have the guitars, you know, really, really stripped. Yeah it was important for me to have it on the album, to make sure that it was there and that it was received just the way that I heard it and the way that everybody experienced it, the moment that it happened, 'cause it was so, it was so in the moment. That whole thing. You know most of the whole song was done in like one or two takes, you know, just like run through. So I wanted to keep that emotion, like you felt like you were right there in the studio when it was happening."}], "artist": "Kat Dahlia"}