{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/a8906126ae46a874605d38c7d1e89e9e.1000x1000x1.jpg", "year": null, "album": null, "lyrics": "[Hook]\nCinder blocks hold up the porch\nGrandpa, grandpa hold up the fort\nBilly's got the ball on an open court\nRolling dope as a summer time sport\nHold up! I'm on the hill\nIf you shake it up, better let it chill\nCreekwater still spills\nBaby's gotta eat so I steal that meal\n\n[Verse 1]\nRapper with a steel shield\nPedal the big wheel\nKind of a big deal\nBlack like a wet seal\nWhite like an x pill\nFight like a trailer park, boy!\nRaw best still\nLook for the best deal\nLook no further\nI put habaneros on your hamburger\nI pull bow and arrows out on you\nYou would think it's murder\nLeave me with your bitch in a mini-skirt\nAnd I might serve her\nPark on the curber\nTreating the beat like a pervert\nFuck it, eat it, beat it, see us\nLike a cleavage on a\nScenic route through my city\nI bleed it, believe it I breath it harder\nMama! Pick up hella weed and\nHello papa tis' the season\nMine is coming, his is leaving\nSally ain't looking good, what's she breathing?\nMeth addicts, dead rabbits\nCome up! But I'm good at it\n\nPull out the needles, let me see if I can leave them tatted\nI got that shit is selling homie? habit\nTo avenues cuts alleyways dirt roads paddle boats paddle through lake? Through a fork!\nStill got a duffel bag in the trunk\nIf I'm going out, I'm going out with a honk\nWho, what, when, where? Buddy I'll be there\nWatch my Paw Paw pull a sawed off out of the rocking chair (POP)\nI don't know how to stop it, stop where?\nHere? Alright, cool.. I guess I'll leave it there, dude\n\nNow pick it up\n\nMoonshine in the noon time, give me the hiccitup\nStick it up. Baby, you just ain't thick enough\nPut a brick in your butt, let's thicken it up\nThat's how we live it up\nThat's movin' weight, call it and pick the kitties up\nSit in this pick up truck. Let's go hit the city, slut\n808 black and give you many nuts\nVibrate on a highway. That's Catfish Billy up\nGo pop a pilly I'm a toon like I'm mitted up\nOn a mushroom oppurtune' let's kick it up\nGitty up, gitty up. Horsey I'll rock your pretty up\nIdiot shouldn'ta took a loan from a loan shark\nYou owe me money as soon as the fucking song starts\nI am a thrown dart, don't walk in front of it\nDon't be a football to the boot that I punt it with, nice kick. Field goal!\nI spit ice picks.Cypress Hill. bro\nThat's some tight shit, but that's what I'm here for\n\nWe ain't going out like that", "title": "Ain’t Going Out Like That"}]}