{"songs": [{"lyrics": "We in your pussy, We fuck slow, We pull it out then we make your ass blow. We never stare like a trick, we make the pussy come and pay for the dick\n\nWe in your pussy, We fuck slow, We pull it out then we make your ass blow. We never stare like a trick, we make the pussy come and pay for the dick\n\nHo stopping all over the world. I got something for your big mouth girl. Hydrolics on your neck and head. Hitting switches on my dick in bed. Go in the pussy, then I roar. You can't walk cuz your pussy sore. Walk faster you ain't that fly. You caught a smelly pussy in the candy ride\n\nWe in your pussy, We fuck slow, We pull it out then we make your ass blow. We never stare like a trick, we make the pussy come and pay for the dick\n\nWe in your pussy, We fuck slow, We pull it out then we make your ass blow. We never stare like a trick, we make the pussy come and pay for the dick\n\nDont wanna see you bitch. Unless you make me rich. Bring me a ton of cash. Before I whoop your ass. Keep your heads bobbin, keep your pussies popping. Afroman is back, we call it ho stopping\n\nWe ho stopping, we ho ho stopping. We ho stopping we ho ho stopping, we ho stopping, we ho stopping, we ho ho stopping, we ho stopping we ho ho stopping\n\nStill low riding on 13's. Sagging khakis, sporting ghetto jeans. Color coordinate with my stars. Car jacking divas for their cars. You got tint on your ride. But it don't help i know who's inside. Ho stopping, losing my breath, fuck it to the right then back to the left\n\nWe in your pussy, We fuck slow, We pull it out then we make your ass blow. We never stare like a trick, we make the pussy come and pay for the dick\n\nWe in your pussy, We fuck slow, We pull it out then we make your ass blow. We never stare like a trick, we make the pussy come and pay for the dick\n\nThis is for my gentlemen, chillin in the penal ten. Irritated with a girl haters and players say oh. this is for the shitty no ass no titty. Stuck up sadity supposed to be pretty oh. Ima step back and pop her like a real ho stopper. Get them in you tees get them in you tees, you can't get them standing up get them on they knees say oh get them in you tees, get them in you tees, you can't get em standing up get your knees we ho stopping we ho ho stopping, we ho stopping we ho ho stopping we ho stopping we ho ho stopping", "title": "Ho Stopper", "album": "Waiting to Inhale", "image": "https://images.genius.com/9a4062521e7bceaeec8fcfcf6308b5c0.500x500x1.jpg", "year": null}], "artist": "Afroman"}