{"artist": "Warren G", "songs": [{"year": null, "lyrics": "Chorus:\nIt's kinda easy when you listen to the g-dub sound\nPioneer speakers bumpin' as i smoke on a pound\nI got the sound fo' yo' ass and it's easy to see that this\nDJ be Warren G\n\nCan I get in where I fit in, sit in, listen\nLet me conversate better yet regulate\nShake the spot with my knot, may fade\nCuz I don't like to dream about getting paid\nI played ball through the halls of C-I-S\nWith Snoop Dogg's big brother, call him Dirty Left\nRack 'em up, crack 'em up, stack 'em up against the gate\nThe homies tryin' to catch me but they can't. Wait\nDamn, the street lights just came on\nAnd my momma's on the streets tellin' me to come home\nI hit the gate and I hops on my Schwinn\nAnd I tell the homies, \"aiight then\", yeah\n\nChorus x2\n\nVerse two, now what the fuck i do?\nCatch the bus to Cal State or chill with the Voltron crew\nAnd make a few ends on the side\nHere comes a baby blue van, time to ride\nSo i hops in the van with my nigga Tick\nAnd Baby Poppa, back then, that was my click\nWe groovin' to Santa Ana\nAnd we plan on makin' hellafied 'mount of money hell yeah\nAnd what I did for extra fees\nWas break niggas after work playin' get like me\nI was fourteen years old, havin' a sack\nJust a young mutha fucka eatin' Valupacks\nShootin' dice in the corners of the public schools\nAnd i used to gangbang, but now it's a G thang\nAnd i still know how to make those ends\nYou don't believe me? Go ask the twinz mutha fucka\n\nChorus x2\n\nYeah, check dis out, dis is I'm O.G.L.B\nKnow what I'm sayin? I'mon my little O.G. Warren G\nAnd he just droppin dis to let you B.G.'s know\nWhat's happen, y'all got to recognize\nCuz this is ya know a Long Beach thang\n21st Street, but check dis out\nG gonna go out there, ya know what i'm sayin'?\nAnd handle that shit ya know? yeah\n\nChorus x2\n\n(Hey Greg, I hope yo' was tapin' that shit)", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "This D.J. - Remix Version"}]}