{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": null, "lyrics": "[Intro]\nYeah, you motherfuckers shooting each other in the club and shit\nThe girls, the girls they love me\n\n[Verse 1]\nPeople say I'm a disgrace to the human race\nI love overweight women when they sit on my face\nI'm the obscene, overweight, obese\nNo peace, when we come call police\nTrash talk, now you got no teeth\nWho I be? Rugged-Rock-the-Party\nOne shot, leave your legs bubbly\nI'm the 2004 version of Heavy D\nI'm a fat fuck but girls, the girls, they love me\nYeah I know, I'm dirty and crusty\nAnd ugly, and I smell real bad\nBut bitches still fuck me\nYeah, you might heard about me and\nMy wild ass crew\nThe Port Jeff house it was the Long Island zoo\n\n[Hook x2]\nHey, yeah, yeah-yah, (Girls, the girls)\nThe girls, the girls, the girls\nHey, yeah, yeah-yah\nHey, yeah, yeah-yah, (Girls, the girls)\nThe girls, the girls, the girls, the girls they love me\nHey, yeah, yeah-yah\n\n[Verse 2]\nNow why you wanna try to get funky on me?\nAnd there ain't nobody out here that is as hungry as me\nI'm a top ten all time dope MC\nYou got Chuck D, Rakim, Daddy Kane and Kool G\nBut right after that you gotta mention me\nThe most underrated artist of the century\nIn controversy, I'm Eminem to the tenth degree\nThose bullets that hit Pac were probably meant for me\nThey call me R.A. \"Mr. Burnin Bridges\" Rugged Man\nAt the record label with a shotgun in my hand\nAmerican lowlife, dirtbag, my team\nI'm the ugliest motherfucker you ever seen\n\n[Hook x2]\n\n[Verse 3]\nI'm the modern day Busby Berkeley\nReincarnated from early 1930's\nSteal your bitch, dirty hit your girlie\nSlap my dick on your mouth, giving you the birdie\nPale ass squirting Hershey on your bitch stomach\nYou must have not heard me\nI’m the disease scurvy, world’s most dirty\nI'm in my man basement\nBegging for free studio, and some free beats\nI paid my dues, here's my receipts\nWhen you hear the ill voice stick mad bass in\nRip your bitch drawers off, put my face in it\nFingerfuck, do the worm breakdance in it\nWhen I'm done leave the crib\nShake hands with it\n\n[Hook x2]", "title": "Da’ Girlz, They Luv Me", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}