{"songs": [{"title": "Deep Down", "image": "https://images.genius.com/8r8ajx2cbm92408bt8tkjbsdy.300x300x1.jpg", "lyrics": "[Brotha Lynch]\nYeah I could load a 9 up everyday, but why\nMy locc's told me homie make them tapes\nAnd keep that 24 block alive\nBut if I feel I'm in need, I got's to ride\nCarry a 9 for straight business, not just a side\nMan it's the night-mare, creepin up in the cut\nI'm hittin dice games, barbeques, no matter what\nThe things I've seen'll make ya throw up\nFlaunt your flag, shoot your gats, hit your dank\nWhere I'm from that's how ya grow up\nMan it's that wicked and 9 millimeter\nCarrier bein stereo-typed daily\nYa got's to feel me, foo it's that baby\nKillas run around everyday that's why I'm strapped\nYa heard it I got my own back-fade\nOut into the 'lac and hit the city of Sac\nThem homies given me that\nBut you got them fools that want a foe then\nThey wonderin why I'm carryin me a 12 gauge pump\nMan I ain't no punk\nThe average everyday thug that's how it sounds\nI'm defendin myself, and loadin that mili\nAnd leaving em layin\n\n[Hook] X 4\nDeep down, there's a place for hope\n\n[Mr. Doctor]\nI guess it's hard to explain why I'm feelin how I'm feelin\nI guess I'm feelin sorrow cus my homies got some steel in em\nAnd foos would say that it's my fault I bet\nSee because I wasn't strapped yo, but I can't fuck my set\nHow could I know that them fools would blast?\nLater on, on my folks\nIt's funny how this bangin's got its different strokes\nI think about my loccs and how they made it\nThough I'm stressin from the fact\nThey gotta suffer from a bullet hole\nAnd Mr. Doctor just don't have hope locc\nIt's only been a month, since my last down partner got smoked\nAnd rivals is deep, up in my city foo\nSince I'm on the underground team, I can't have no peace\nMy life is tore up so I guess I'm stuck\nYeah, I got my St. Ides, I'm turnin it up\nTo get drunk, then I pore some on the street\nWhile I say to myself, for the block\nHomie rest in peace\n\n[Hook] X 4\n\n[Brotha Lynch]\nThey say that ain't the way to handle that type funk\nBut now I'm loadin up the strap, smokin on that blunt\nJust cus the Brotha Hung is flag-up\nWhat that mean, I can't ride?\nWhy G's up in my face, I'm bout to help them ride\nI keep a low pro, drink the 4-0\nAnd lounge until it's time to go\nShinin up the forty-fo\nRollin up the boogey-boo, indo\nAnd hopin if I should die, before I'm high\nThat they bury me in 50 pounds of chocolate thai\nI got them homies from the south-side givin it up and\nThem homies from the east-side slangin that stuff and\nI'm right up in the middle tryin to hang on and\nTryin not to end up like them niggas doin time in the pen\nBut then again\nI'm down for when the homies is ready to roll em up\nYou know, stick in a dark-blue cut\nAnd as I'm creepin through ya set\nTrip, don't get caught up, shot up\nThe gardenblock locc's, man we leave em layin\n\n[Hook] X 4", "year": "1995-02-28", "album": "Season of Da Siccness"}], "artist": "Brotha Lynch Hung"}