{"artist": "Famous Dex", "songs": [{"year": "2018-04-06", "album": "Dex Meets Dexter", "image": "https://images.genius.com/28f937ec280844563aa5e406146b4cab.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, know what I'm sayin'?\nYeah, hah, Dexter\nHah, huh, ooh, ayy, yeah, huh, hah, yeah (oh man God damn, what, yeah)\nWhat we doin'? Hah, yeah, uh, ah, uh (yeah, what, ooh)\n\n[Chorus]\nSmokin' dope real heavy, got a bitch, Ms. Betty (what?)\nI can't trust her, I don't love her, runnin' to the fetty (what?)\nGot a Bentley, I was broke, was ridin' in the Chevy (skr, skr skr)\nAnd my diamonds heavy (what, hah)\nI'm a champion (yeah, Dexter)\n\n[Verse 1]\nWait, fuck that bitch, what's happenin'? (Ooh, what?)\nYeah, that bitch was cappin' (cappin')\nYeah, kidnappin', huh\nI'm so crazy, yeah I'm a bastard, huh, yeah, huh (what?)\nI got diamonds on my teeth, huh (diamonds on my teeth, what?)\nAnd your man so broke, yeah he a wannabe\nHe can't be like me, yeah he so broke\nOoh, huh, I just put my dick in your bitch throat, huh (put my dick up in your bitch what?)\nOoh, huh, and she sniffin' coke up in her nose\nHah, yeah, ooh, that's the way it go, hah (that's the way it go, hah, Dexter)\n\n[Chorus]\nSmokin' dope real heavy, got a bitch, Ms. Betty (yeah)\nI can't trust her, I don't love her, runnin' to the fetty (oh man God damn)\nGot a Bentley, I was broke, was ridin' in the Chevy (skr, skr skr)\nNow my diamonds heavy (hah)\nI'm a champion (hah, yeah, what?)\n\n[Verse 2]\nI was so broke, huh, yeah, ooh\nI was sleepin' right on the floor, huh\nSwear to god now I'm sellin' out shows\nOoh, look to god, I ain't goin' broke no more\nWait, huh, let me speed it down, huh\nGot a bitch, she wanna drive downtown, ooh (skr, skr skr)\nRidin' a ride, drivin' downtown, ooh, wait (skr, skr skr)\nHuh, yeah, fucked up in the days, huh (what?)\nNow I'm gettin' paid (gettin' paid, yeah, ooh, hah)\n\n[Chorus]\nSmokin' dope real heavy, got a bitch, Ms. Betty (yeah)\nI can't trust her, I don't love her, runnin' to the fetty (yeah, Dexter)\nGot a Bentley, I was broke, was ridin' in the Chevy (skr, skr skr)\nNow my diamonds heavy (hah, yeah)\nI'm a champion (oh man God damn, what?)", "title": "CHAMPION"}]}