{"songs": [{"image": "https://images.genius.com/1e9d47cc7d2d89c839c4ec32d0815a5e.929x929x1.jpg", "lyrics": "[Intro:]\nGood lookin' for this one Primo! East New York! Summertime Shootouts!\n\n[Hook]\nI ain't talkin bout the weather when I say it's hot (I'm not)\nIt's the summertime, mad bodies gon drop (Bam!)\nNiggas that got beef gon be in the same spot (oww)\nLike here them niggas go, somebody's gon get shot (they right there)\nHere them niggas go, somebody's gon get shot (right there)\nIt's the summertime, mad bodies gon drop (Bam!)\nThat's what I'm talkin bout when I say it's hot (ya heard!)\nIt's the summertime, mad bodies gon drop (drop, drop)\n\n[Verse]\nAny day goes when it's warm (any day!)\nDudes done even shot up my grandmama door\nIf the dude want beef with me, tell him whatever\nWhen I kill him, tell his kids that they fuckin pop should've known better (daddy dead)\nI don't play games, I ain't Nick Cannon\nWhen I wild out (ya heard) dudes gettin headshots from the cannon (Bam!)\nCan't roll with me and be no bitch nigga\nI eat you fool like I'm blood and you crip nigga (I'm 31)\nCan't be around GMG and be a rat\nIt's like being the only Blood in a crip house screamin out brrrrat\nThis for them dudes in the can behind the bars\nWhen they listen to my music, they close they eyes and think they in the car (yup!)\nThey think about that money they was gettin (oww)\nThem hoes they was hittin (oww), the bricks they was flippin, they was chillin (DAMN!)\nMan, nothin don't last forever, first time I shot at a cop I had a Beretta (PIG!)\nIt's a 100 degrees and my AC broke\nFirst nigga look at me wrong gon get smoked\nMy attitude is fuck whoever, he gon get clapped\nMy grandmom's like, boy I raised you better than that (I know)\nI'm like grandma -\"it's hot\", I ain't with the bullshit (I ain't)\nI'm ready to pop, my Mac got a full clip (50 shots)\nI'm the kid that fuck up the dice game\nIf I lose my money niggas gon lose they life mane (aww)\n\n[Hook]\n\n[Outro]\nYA HEARD!\nSummertime Shootouts, you know how it's goin down in the summertime nigga\nNiggas that got beef gon be goin to the same clubs, the same block parties, niggas is fuckin the same bitches\nAnd I feel sorry for the nigga that don't got his hammer on him man\nDon't get caught slippin in the summertime nigga\nNiggas will make you primetime news nigga, ya heard!!!\nShout out to all my niggas that's in jail\nI know it's hotter than a motherfucker in there right now man\nHold your motherfuckin head tho nigga\nI'm workin on them appeals, ya heard\nFree my nigga Dbo Brown\nBrooklyn!!!", "title": "Summertime Shootouts", "year": null, "album": "The Battle for NYC"}], "artist": "Uncle Murda"}