{"artist": "Yung Bans", "songs": [{"album": null, "image": "https://images.genius.com/bc013772c7e5476d7bed7ed9ac294fb9.500x500x1.jpg", "year": "2015-05-20", "lyrics": "[Intro: Yung Bans]\n25/8 678 (Bans)\nI just asked my good lord for another day (Thank God)\nGot my niggas in the bay, shooters in L.A (Yeah)\nKeep some hitters in Atlanta, boolin' every\nStop that, bring it back, this shit is hot\nThis is a certified hood classic\n(Four tablespoons, four tablespoons)\nDamn son, where'd you find this?\n(Four tablespoons, four tablespoons)\nWhat, you ain't know?\n\n[Verse 1: Yung Bans]\n25/8 678 (Bans)\nI just asked my good lord for another day (Thank God)\nGot my niggas in the bay, shooters in L.A. (Yeah)\nKeep some hitters in Atlanta, boolin' everyday (Boolin')\nBaby give me good face with that pretty face (Yeah)\nGot a nice slim waist, high end taste (Goddamn)\nBet a nigga need his space, always in my way (My way)\nDon't bring that shit my way, we not cool by the way (By the way)\nBitches hoppin' on my wave, swallowin' my babies (Yeah)\nIn that new G-Mercedes, bitch named Mercedes (Skrrt, skrrt)\nUh, uh, bitch named Mercedes (Yeah)\nIn that new G-Mercedes, bitch named Mercedes (Goddamn)\n\n[Verse 2: Playboi Carti]\nBitch come my way but don't bring nothin' my way\nAll I want is face then get out my face\nYeah that nigga hate but he stay in his place (Place)\n38 right in your face (Face)\nPlayboi keep a bunny right in his face (Face), uh, uh\nAss so fat, she gon' give me face (Face), ayy\nFerragamo waist (Waist)\nBurberry my taste (Taste)\nNigga hit my line, two phones come my way\nI'm with a rich hoe, wait\nTell me where you stay, tell me where you at\nBe right there, go pick 'em up, hit me right back (Ayy)\n(Four tablespoons, four tablespoons)\nOn this lean, 24 nigga\nDogs sendin' twenty foes, nigga\n\n[Outro: Playboi Carti]\nCoke, dope, crack, smack, weed, Es and CDs, they got it all\nFour teaspoons\nThis is a certified hood classic\n(Four tablespoons, four tablespoons)\nLaughing all the way to the bank\nWe ain't new to this, we true to this\nThis is not the hottest thing smokin'\nYou must be out of your goddamn mind\nDamn son, where'd you find this?", "title": "4tspoon"}]}