{"songs": [{"year": null, "image": "https://images.genius.com/a51dcea6b49ee87e76d235126166aaf9.600x595x1.jpg", "title": "Fully Loaded", "album": "5 ★ Stunna", "lyrics": "[Intro]\nYeah pops and the peach. (Believe Dat) That’s what the fuck I'mma do (flip that shit)\nYea. Clear my motherfucking save (yea), everything, spit that shit. M. O. B., M. O. E. hunned million here, hunned million here, hunned million here, hunned million here, a hunned million up there, (a hunned) in a three month run, bitch\n\n[Hook]\nIm gotta get it\nIs you with me?\nIm gone get it\nNigga I'mma hit it\nTell me if you with me\nIm gone get it\nNigga I'mma hit it\nNigga we did split it\n\nIm fully loaded homie\nIm fully loaded homie\nIm fully loaded homie\nYea im fully loaded homie\nIm fully loaded homie\nIm fully loaded homie\nIm fully loaded homie\nYea im fully loaded homie\n\n[Verse 1]\nI gone and get it\nIm in my shit, nigga ready go flip a whole clip, nigga empty these bricks\nGet it and go, nigga and wrap it like shit\nBring it to my neck of the woods, we hit licks\nHustle like all the time\nLivin like do or die\nWe in the streets gettin money nigga stayin fly\nJumping outta parachutes\nBirds in a Bentley Coupe\nWe flippin blocks dump the feds, when they come thru\nThat’s how we did it homie\nIt ain't no flippin but we dippin like, dippin off the dip, when we toastin on em\nYou know the money is a must and these hoes dont trust\nUptown souldier nigga played it from the gut\nLive mines, split mines, tap mines, grind for mines, take mines. Nigga let me live or let med bitch, before I let a nigga fuck with my strife, bitch\n\n[Hook]\n\n[Verse 2]\nAll the time, Im the one that brought em on this grind, brought em on this line, brought them in this time\nShowed them a good time, showed them I got mines, showed them I make mines, showed them I'm bout mines\nOff the rip nigga\nBout my shit nigga\nStill get this money homie\nFlip it and dip, nigga\nStay in these pearly whites\nBrand new gucci frames\nFresh as a motherfucker, bitch watch me do my thang\nHard in a eleven hunned\nDo that shit every sommer\nOne of a kind, 5 Star, and them bees comin\nLet them flees go\nBitches we get mo\nNigga they all know\nWe bout to cash flow\n\n[Hook]"}], "artist": "Birdman"}