{"artist": "Porta", "songs": [{"album": "No es cuestión de edades", "title": "Sigo buscando respuestas", "image": "https://images.genius.com/1d76236de7af6962571eed68e31756dd.768x768x1.jpg", "lyrics": "Hay millones de preguntas sin respuesta, el quizá, muchas preguntas se plantean, se busca una respuesta… pero no se encuentra\n\n¿Por qué? ¿Por qué pregunto tantas cosas?\n¿por qué en el jardín que planté ya no existen las rosas?\n¿por qué los recuerdos malos cuestan tanto de olvidar?\nSon cosas de la vida que nadie puede explicar\n\n¿Y es que por qué me dieron tanto si nunca merecí nada?\n¿por qué la autoestima se esfuma cuando es necesaria?\nMe pregunto tantas cosas, sigo buscando respuestas\nEstoy harto de hablar solo porque nadie me contesta\n\nQuizá soy un estorbo, quizá no sea nadie, para nadie\n¿a quién le importo? yo le pregunto a este folio…\nSoy un paranoico y sé que muchos me entendéis\nTambién sé que a la mínima la esperanza perdéis\n\nPor qué buscas venganza por todo y le echas la culpa a cualquiera\n...cuando es tuya ¿por qué están siempre encerradas tus penas?\nMira dentro de ti puedes buscar en el corazón\nPorque allí existe una pequeña luz en algún rincón\n\nDime, por qué poco a poco desvanece el cariño?\n¿por qué solo existe felicidad cuando eres un niño?\n¿por qué quiero seguir existiendo solo si es contigo?\n¿por qué quiero tanto y nada? ¿por qué le tengo miedo al olvido?\n\n¿Por qué está todo nublado? ¿Por qué solo quedan ganas\nTan solo de llorar, empapar y hablarle a la almohada?\n¿por qué? ¿por qué al recordar me caen lágrimas?\n¿por qué la historia es corta y casi ya no quedan páginas?\n\n¿Por qué me siento solo? También triste y solitario…\n¿por qué no sé casi nada ni del mundo ni del barrio?\nTú qué sabrás lo que siento yo desde que soy un crío\nSolo son penas, preguntas. Un pensamiento sombrío\n\n¿Por qué todo está gris de nuevo al subir la persiana?\n¿por qué siempre al despertar veo llover tras mi ventana?\n¿por qué me pregunto tanto? ¿por qué tengo tantas dudas?\n¿por qué siempre espero que alguien venga y me ofrezca su ayuda?\n\n¿Por qué todo es tan negro? ¿por qué todo es tan oscuro?\n¿se me ha nublado la vista o es que cada día es más duro?\nCada día va peor para salir pa’lante es jodido\n¿por qué siempre estás en mi recuerdo y nunca en el olvido?\n\nEsclavo y prisionero soy de la monotonía\n¿por qué no desveláis ya cuál es la misión de esta vida?\nTenemos miedo al futuro, miedo a que cambien las cosas\n¡la vida no es más que una incógnita! …escondida entre rosas\n\nPor qué estoy siempre en un laberinto y me siento perdido\nEn un lugar sombrío y áspero? Temo a lo desconocido\n¿por qué al intentar salir nunca se encuentra la salida?\nAcabas perdido entre dudas y en una eterna caída\n\n¿Por qué en el puzzle que hago hay una pieza que no encaja?\n¿por qué Dios existe solo en fe y eso a poco relaja?\nQuiero dormirme y esta vez será para no despertar\n¿el infinito existe? Quizá eso jamás se sabrá\n\nSigo haciéndome preguntas. Sigo en busca de respuestas\nSigo mirando hacia el cielo pa’ ver si alguien me contesta\nSi no buscas por tu lado, nadie lo va a hacer por ti\nDime el porqué de esta vida hay objetivos que cumplir\n\n¿Por qué el camino es tan largo lleno de espinas y alambres?\n¿por qué se aprende de caídas y de palos y no de clases?\n¿por qué nunca nada es tan bonito como te lo pintan? todo es tan distinto, distinto a cómo te lo cuentan…\n\nSigo buscando respuestas, yo sigo preguntando y nadie me contesta, y nadie me contesta…", "year": "2006-06-11"}]}