{"songs": [{"year": null, "title": "Conflict", "image": "https://images.genius.com/8b24619eca032daebf0caa5c44aa746d.512x341x1.jpg", "lyrics": "I would rather be\nWho I'd rather be\nWhat I would rather be...\n\nI conflict with those who are tricked\nBy the gimmick market and can't think with logic\nLogic!\nThey're in the distance when I begin to pop lip (hip)\nPoppers asking why does this kid does talk shit\nJust I'm never breaking even so I'm throwing art fit\nSick of rappers saying \"fresh!\"\nBut stink like armpit\nAnd couldn't test a single member that's within our clique\nI bring it to you right now, but you don't really want it\nUnwarranted, salsa make your heart skip\nIf you rolled as much as you told you'd get carsick\nAccosted by pistol forty audience at your concert\nSitting in the front row\nGetting wet by what they all spit\nI'll be standing in the back hitting you with a tall stick\nI could join your ass and still you're not slick\nWhen in over your fan base\nMake them say \"aw shit!\"\nRight in your damn face\nConfidence: you lost it\n\nNow these super thuggy dungs say\n\"Bring that hard shit\"\nIn a conflict\nSimple simon Simon Says to sing the pop hit\nIn a conflict\nCorny white boys just want jokes, this isn't a comic strip\nIn a conflict\nStill I bring a conflict, that sting of conflict\nI'm in a conflict\nI'd rather be artistic\n\nPainting pictures with my words while freaking a topic\nYour broad strokes are filled with lead\nSo what you're eating's toxic\nBut this poison is self-destruction, you're feeling\nStop it!\nTaking more than god's name in vain\nMaking your beating heart quit\nPush you on the floor, then pull the carpet\nOut from under your feet, then watch you drop quick\nFlying through the airwaves, hit you with a dropkick\nOn the WWF raw is war tip\nRun up in your crib and watch that horse strip\nPlaying healthy mind games to keep her thoughts sick\nThe plot is not the only thing that thickens in this porn flick\nOnce I'm done when her, you really think she wants your dick?\n\nThat's not how I'd rather be\nThis is not who I would rather be\nThat's not how I'd rather be\n\nI am not lit\nHitting on some club hopping bot chick\nStart to flit, name-dropping on a superstar trip\nOnly for the sake of seeing her jump on the jock quick\nSimply get that cock trick spit what your mom drink\nNow, back to these bastards who claim they got grip\nTake the finger off your safety and let the Glock click\nAim for the back of my fist, make it your target\nStigmata\nI let the blood from my palms drip\nI've got a cold of socials in the arctic\nSingle-handedly rip through your family\nMake it look like a mob hit\nBetter stiffing if your biscuit got limp\nI go down head down like Fred Durst\nFor a hot lick of this lolly pop stick\nSick of suckers thinking they can rock it\nHip hop rip offs over a good tall lick\nThat little bitch'll slit her wrist\nWith this good tar pick\nI stick to my convictions\nThat don't make me a convict\nI compliment only those who deserve the props, prick\nNever tried the chronic, chocolate tired tonic\nNot your normal human assuming a bionic\nAbout to blow up, listen to my inner time-bomb tick", "album": null}], "artist": "Sage Francis"}