{"artist": "Amil", "songs": [{"title": "Y’all Dead Wrong", "album": "All Money is Legal", "year": null, "image": "https://images.genius.com/48d6fc16e6c826f1eb305466c8fedcc8.500x500x1.jpg", "lyrics": "[Verse 1]\nAmil outlaw fly indeed\nGot every chic's man eyeing me\nThink you could crush this try and see\nIts the major coin i-n-c\nAnd am too hot to just be warm\nI start fire alarms from dusk to dawn\nCatch me with the diamond clusters on\nAnd Gucci feathered sandals with the mustard thong\nModel Mommy\nThe body like a cola bottle mommy\nMulatto up in the galoino mommy\nOne in a Amiliyon killin' em\nMight have to change my name to billioyn\nVoice so ill you'll wanna speak my shit\nJoints so hot you'll wanna leak my shit\nPlus haters sneak peek my shit\nBut still I be the only one to freak this shit\n\n[Hook]\nY'all dead wrong\nIf you think you fuckin' wit this\nAnd you'll know\nThat y'all got nothing on this\nY'all want that\nOr you want something like this\nThose who hate\nYeah y'all just fronting on this\n\n[Verse 2]\nWhy chicks don't wanna rap on the same song as me\nYou need a verse ma, its on me\nSee all this publishing belong to me\nJust imagine how the second album gonna be\nNon-stop party hopping\nRoc roc rocs and keep on rocking\nEverything I spit be popping\nAnything Amiliyon want she copping\n(Whoop Whoop) Ain't nothing change\nAnd I play more ballers then them rucker games\nLight gray studs, ring, watch, plus the chain\nWill I ever be broke what's my name?\nHave you ever seen a chick like this?\nEver heard one spit like this?\nI dead 'em all put my word on that\nAll money is legal and I murder tracks\n\nChorus\n\n[Verse 3]\nCute as a button\nCan't tell this bitch nothin'\nGhetto fab whole click bubbling\nDiana Ross the boss of the rock\nShit  you know me I got to floss at the spot\nWit a dime as nigga who be tossing knots\nEvery bitch hating cuz I'm scalding hot\nIt can't be because I got begets on\nCause niggas love this bitch even with seats on\nI'm the A-m-i-l-liyon\nStrictly be on that shit major coins be on\nI got joints making competition wanna drop dead\nI got joints making you bop your head\nI got joints that will have your eyes blood shot red\nFuck the doe I want my props instead\nStay real with it\nMight pack stell wit it\nYou can hate but you still gotta deal wit it\n\nChorus(3x)"}]}