{"artist": "Cam’ron", "songs": [{"title": "Do It Again", "album": "S.D.E.", "year": "2000-09-19", "image": "https://images.genius.com/61effe5c9676b450f29c101e5563907e.960x960x1.jpg", "lyrics": "[Intro: Cam'ron]\nMan I fucked a lot of bitches man (true)\nMade a lot of money (true)\nMade a lot of enemies (true)\nWould I do this shit all over again, I dunno\nThat's a good question, (You right about that) would you do your life over again?\nI know I fuck fat ass Tasha one more time if I have nothing else to do\nI fuck that bitch one more time, that ass was fat\n\n[Verse 1: Cam'ron]\nYo, shorty get a desk and chair\nNow let the guest appear\nBut if you knew my life you'd shed a tear where\nFrom the fucked up scar to the tough luck bar\nTo my cousin's final chapters in a crushed up car\nA hero I be from the plural IVs\nCapisce a few cats tried to muralize me (for what)\nCause I drive a fresh Benz and collect ends\nBut I lost brothers and best friends\nWord life, we all brethren\nBut we don't speak and ain't nobody budgin\nCause we all stubborn\nYeah, we let the hate rise\nGive each other fake fives\nLook back peripheral give each other snake eyes\nTrue in all sequels (true)\nYou too of all people\nGuess they right money is the root of all evil\nA nigga front on them though I trigger the M\nI don't know guess it's just the type of nigga I am\nI live my life a thug\nLive my life with drugs\nFuck everybody else, I live my life for Blood\nSo Lexus, [?] and I got keep trees near\nCause Blood supposed to be here\n\n[Hook: Destiny's Child] (x2)\nAll them rhymes we sung\nAll those crimes we've done\nAll those times was fun\nBut would you do it again?\n\n[Verse 2: Jim Jones]\nUh\nOne of my worst fears, is being stuffed in a hearse\nSix feet deep getting crushed by the dirt\nBury me with rings so when I'm plucked from the earth\nEvery mothafucka see how much it was worth (we makin money)\nI see y'all discussing my best misjudging of my worst\nAnd all my life put in nothin but work\nDon't talk about how I was such a big flirt\nI never slowed down cause I was fuckin with skirts\nI mean since the early days I was cuttin from church\nY'all talk about things I've done to my life\nYou talk about things that I've done to my wife\nI know where I'm going second coming of Christ\nI do this for my niggas, who never get no cheddar\nFor my niggas upstate, that'll never get a letter\nFor my vitally sick, that would never get no better\nFor my niggas in the cold, that would never get a sweater\nFor the life I lead, things I done\nA nigga went to school I had to bring my gun\nA nigga had to hustle I had to sling them jumbs (I feel you man)\nAs the man of the house I had to bring income\n\n[Hook: Destiny's Child] (x2)\n\n[Verse 3: Cam'ron]\nYo, this life I should rock again? (huh)\nStand on this mothafuckin block again?\nAlmost get shot again (it was tough out there yo)\nSee alotta men get shot up bad\nBack up hobblin sister out gossipin (get em' to the hospital)\nSo I don't rhyme for executives\nIt's imperative do it for my jail bird consecutive\nGet my messages, hell no\nOn my block nigga never live, one room 7 kid\nScreamin mother overhead, no one fed\nTwo plates, one fork sour milk and a loaf of bread\nBut I shook it off smiled of course kid\nMy girl wild out on some child support shit\nOut exhausted obsolete y'all (y'all)\nBut girls will flip like Dominique Dawes\nI'm not here to teach y'all, just here to reach y'all\nIf I do my life over, I'd repeat all\n\n[Hook: Destiny's Child] (x4)\n\n[Production by Darrell \"Digga\" Branch]"}]}