{"artist": "Isaiah Rashad", "songs": [{"title": "Dressed Like Rappers", "lyrics": "[Intro]\n(My nigga made sure you were living for real)\n(How could you ever bring a pill pack)\nControl the speed\nI won't let you go, no\n(My nigga made sure you were living for real)\n(How could you ever bring a pill pack)\n\n[Hook]\nI control the speed, and I won't let you go, no, no way\nYou're everything I love, hoes and weed\nAnd I could testify, 'cause, who's ashamed?\nSo I might testify\n\n[Verse 1]\nI got a face that only your bitch could love\nYour type niggas don't mix with us\nAin't this special like just because\nBackpack full of that wrist and lung\nBoarding pass, pass my troubles\nHigh as fuck, lost my wallet\nGoing back, back to Cali\nSaw my son, miss my daughter\nReal life, what does it feel like?\nI got my pills on, you know I'm real numb\nGettin' ready for this motherfucker\n\n[Hook]\nI control the speed and I won't let you go, no away\nYou're everything I love, hoes and weed\nAnd I could testify, 'cause, who's ashamed?\nSo I might testify\n\n[Verse 2]\nI can admit, I've been depressed, I hit a wall, ouch\nI hit the bank, you hit the dab, I hit the ball, out\nPraying, God, pay my cable\nSplurging out, one more favor\nLittle boys dressed like rappers\nCan that road make them daddies?\nI talked to God, I got approved, I got a lifeline\nIf I should die, while I'm awake, I had a nice time\n\n[Hook]\nI control the speed and I won't let you go, no away\nYou're everything I love\n(Everything I love, how could you ever say no?)\n\n[Outro: Dave Free]\nDawg, I just looked at your Wikipedia bro and it's some information... you know you see some information you already know? But you look at it more cause it's right in your face again? Bro, you was born in 1991, my nigga! That's weird, dog! It's creepy man. You was born in 1991 dog, you talk about this nasty shit in your music, all this crazy shit in your music, all this life shit in your music dog. Girls, bro, the girls you meet dog they're like born in 1994 bro, that's creepy dog, that's nasty dog", "image": "https://images.genius.com/63ae3497b74634d538e6bd9eeaaac0a8.1000x1000x1.jpg", "album": "The Sun’s Tirade", "year": "2016-09-02"}]}