{"artist": "Watsky", "songs": [{"year": "2009-10-14", "lyrics": "[Intro]\nAlright, first of all—there's already a popular reggae artist with the name Elephant Man. Second of all, as my mother always said to me, there’s nothing cooler than being yourself. And third of all, and most importantly...\n\n(clears throat)\n\n[Chorus]\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fucking emcee name)\n\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fuckin' emcee name)\n\n[Verse 1]\nIf I go spit a poem If I go kick a flow\nDoesn't really matter man cause the jam is a Watsky\nWhen I get a mic and I go rip a rhythm ain't a name in the whole damn game gonna stop me\nProbably gonna rip it too\n'Cause the city wants a hippy with a bit to prove\nI got shit to do I got the sickest crew\nAnd so what the fuck is it to you, dude?\nIf I got no stage name I got stage game out the ass\nAnd a master plan, It's an avalanche\nWhen I spit a little bit of slam\nAnd I hit you with the battleram\nGot a cattle brand \"GW bar none\" so what do you park man?\nGot money and cars? damn, I study the stars\nAnd I couldn't care less who you rep in your set show respect\nI'll be rapping I bet\nLean to the left flow right Oh my god!\nA rose by any name got thorns as sharp\nYo, stage names are for porno stars\nAnd Watskeet skeet skeet skeet is far\nFrom what I'm trying to do, who I'm trying to be\nMother f-f-f-fuck this industry\nIf I gotta be MC U to do MC Me\nGeorgewatsky.mp3\nF-F-F-F-Fuck the limit I got a keep it coming if I wanna make it to the top\n'Cause I be giving you what I been doing during the minutes that other rappers have been napping on the clock\n'Cause if I walk the walk and I talk the talk and I'm popping off cause my flow is hot\nThen I'm pretty motherfucking positive I never gotta try to be somebody I'm not\n\n[Chorus]\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fucking emcee name)\n\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fuckin' emcee name)\n\n[Verse 2]\nWhat's in a name, man, flow comes first\nI'm never gonna curse—that I got it worst when I roam the earth\nIt's a ridiculous coincidence that shows my worth\nYou know my parents went and chose my emcee name at birth\nI don't need a mask To cover my ass\nSo why would you ask? Go put me on blast\nI'll take you to task\nThis name is my last (gasp) so put it on my tombstone when I pass\n(Here lies a fine emcee, the kind who grasps the fact\nThat these aren't circus acts to make you clap, it's rap to make you think and act)\nI think you understand by now the thought involved\nThat if I wanted to be called another name I would have scrawled it on the bathroom wall\nI'm not apologizing for a policy that makes a college kid go call himself Thugdog and not expect assault\nI'm marching on and calling all dissenters who\nWould like to be included in this emcee designation coup\nI'm set to get a crew\nWe're gonna get a clue and then we'll put it up for you to view\nCoo coo ca choo I am the \"insert you\"\nCome on everybody do it too\n\n[Chorus]\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fuckin' emcee name)\n\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fuckin' emcee name)\n\n[Bridge]\nI invoke the spirits of the great nameless emcees who came before me:\n2Pac Shakur\nAli Shaheed Muhammad\nSean Price\nSaul Williams\nDahlak Brathwaite\nMichael Franti\nGabriel Teodros\nJoell Ortiz\nMike Jones\nMike Shinoda from Linkin Park\n\nI invoke the spirits of the great nameless professional athletes turned rappers who came before me:\nDeion Sanders\nRoy Jones Jr\nShaquille O'Neal\n\nI invoke the spirits of the great nameless white emcees who came before me:\nFred Durst\nAaron Carter\nKevin Federline\nOmmm...\n\n[Chorus]\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fuckin' emcee name)\n\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name!\nI got nothing to hide, you got something to say?\n(George Watsky doesn't need a fuckin' emcee name)\n\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name\nI got nothing to hide, you got something to say?\n\nF-F-F-F-Fuck an emcee name\nI don't need a goddamn emcee name\nI got nothing to hide, you got something to say?\n\nF-F-F-F-Fuck the limit I got a keep it coming if I wanna make it to the top\n'Cause I be giving you what I been doing during the minutes that other rappers have been napping on the clock\n'Cause if I walk the walk and I talk the talk and I'm popping off cause my flow is hot\nThen I'm pretty motherfucking positive I never gotta call myself somebody I'm not", "image": "https://images.genius.com/3433966a73a598eca7e6120b7f0cbab3.1000x1000x1.jpg", "album": "Guilty Pleasures", "title": "Fuck an Emcee Name"}]}