{"songs": [{"album": "Para Tu", "year": "2013-10-21", "title": "Grand Theft Auto", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Intro: J.I.D & Chiiirp]\nSystem overload (Overload system)\nWatch the throne (You'll get overthrown)\nAt the bar drunk (Overthrown)\nUnder the influence (In the overcoat)\nRoll up that kill (I'm tryna oversmoke)\nWord to Mr. Willie Nelson (Now tell me what's a weed head overdose)\nI'll wait (Let me know)\nI got the flow (But I want all of the boatload)\nSo let me go\n\n[Verse 1: J.I.D]\nI told niggas, I ain't no rookie\nI ain't no punk bitch and I ain't no pussy\nI know pussy like a gyno\nYou are what you eat, treat the pussy like a gyro\nDuckin' duckin' shots, duckin' cops, like the 5-0\nSwerve on the beltway I drive with a blindfold\nI unfold truth, palm reader just spittled\nEyes low, nigga tote a smith like Milo\nNiggas act pussy, I thought you niggas was guys though\nAbsent dad, they need guidance, I spilt like a broke fire hydrant\n\"How you's a bitch?\" My bitch shout when she spot 'em\nShawty a miss but there there she's a rider\nRidin' through the city with my nigga right beside me\nAnd my bitch that I just scooped from pilates\nThe same one that popped at ol' boy, who shot ya?\nSeemed kinda monotonous ol' boy, yo' posse\nStart resemblin' pasta, pussy ass kids\nMake me sick like shrimp, crab and lobster\nLife is a film needin' a dope porn oscar\nDick chopper, blocka blocka\nYoung niggas hop off the block and fuck the block up\nJust to get locked up and seen by the balls they got\n'Cus by the bar and the law they talk\nIt's already and to owe a nigga menage a trois\nI look up to the sky and thank God I are\nA reflection of himself set inside my flaws\nSet aside my sins, set aside my love\nSilly bitch get inside my car\n[?] bitch\nGotta go bitch\nB-b-bitch\nJ.I.D bitch, uh\n\n[Verse 2: J.I.D]\nAll black on at my wedding, bucket ass naked at my funeral\nCan't 9 to 5 in no lil' ass cubicles\nBoss yellin' at me, say it's weed in my cuticles\nPut it on the scale, the rap shit lookin' beautiful\nStretch my palms into the atmosphere, I fear nothing\nI hear I hear nothing, fuck a tear for buckets\nWarren Buffett, buffet rap, dinner for lunches\nDelightful, y'all seem spiteful\nI too used to be a little bit like you\nNah who I'm lyin' to, if I was ever like you\nI would need some pills, a knife, prob'ly a rifle\nSomethin' I could die to\nAnyways, they shine, I wan' shine too\nLet the diamonds blind you\nWhile the blood of the child who mined- never mind\nI'm diggin' through your mind, do you mind? Whatever's fine\nYou very fine and I can't pay you no never mind\nLight skin girl transform to decepticon\nI'm tryna catch mine like megatron\nBut she don't hear me on the megaphone jack\nThis make a uhh hella bomb\n\n[Outro: Marian Mereba]\nInside\nYou're all in a twisted mind\nOther bright then go misfit ride\nOn your feet when you hear the sound\nInside\nThe diamond of mind of mine\nWhat a find\nThere are no ordinary thoughts\nIn an extraordinary mind\nMind\nAre no ordinary thoughts\nIn an extraordinary mind"}], "artist": "JID"}