{"artist": "Pimp C", "songs": [{"album": "The Naked Soul of Sweet Jones", "title": "Believe In Me", "image": "https://images.genius.com/0d642196ad89f3b471f3e7f78223006a.558x558x1.jpg", "lyrics": "[Intro: Ivory P.]\nSay bitch, you know what I'm talking 'bout\nAye, if you gon' believe in something, why not believe in us?\nYou know what I'm talking 'bout, this Mr. Ivory P\nYou know what I'm talking 'bout, something very young active and attractive\nReady to be elected, its elected ya' dig by a bad bitch\nYeah lets go to the moon and form the stars on the way ho\nYou know what I'm talking 'bout, that's for real ya' dig\nYeah Mr. Ivory P., a pimp said that ho you know what I'm talking 'bout for real\nYou either gonna go fast or slow bitch you know what I'm talking 'bout\nAye and I want a ho you know what I'm saying with a turban ass like kin' said ya' dig\n\n[Verse 1: Pimp C]\nI just knocked your ho give up her clothes, it's gone\nIf I was a mother fucking band, I'd be a baritone\nIf I was a mother fucking car I be a Phantom stretch\nI got a 850 Benz, they ain't made that bitch yet\nLeft the money with the dealer, come out I'm a get it\nYou say that you a baller, but you leasing your rent\nLeaning, scheming, sinning, you need the lord\nSo when I’m in front you, she think she speaking to a God\nAin't indecisive but a ten percenter\nThe girl tired of losing so she choosing a winner\nGrip so much wood bitch my hand got a splinter\nCall my bottle told 'em guess whose coming for dinner?\nShe said who? I said a horse like you\nTo suck her pussy out, no dick 'til she drop it out\nPush it out big money stay drug free\nIf you gon' believe in something bitch believe in me\n\n[Chorus: Pimp C]\nIf you gon' believe in something, well well well, why not believe in me\nPimp game never die, live to tell the truth even when I tell a lie\nIf you gon' believe in something, well well well, why not believe in me\nCause I'm ice cold, bend over let me see it, don't touch your toes\n\n[Verse 2: Cory Mo]\nPlease believe it, if I said it, I meant it\nI keep it pimping at all times, you with it, I'm with it\nThe windows be tinted, them 4's be spinning over the speed limit\nIt's Cory Mo, where the dro at my nigga? I ain't tripping\n\n[Verse 3: Hezeleo]\nIt's easily on the high rise\nNigga we trill, give a fuck about the rest of you guys\nI'm a truth around yonder\nI'm flipping the Benz, while you flipping in yo' baby-mama's Honda\nI'm a O.G bonafide, old school so cool\nSock it to a bitch and make it stick like soul food\nIf it ain't about the money then what we gon' do?\nIf I teach you how to get it, could you bring me some money boo?\n\n[Verse 4: BankRoll Jones]\nNeed a pimp bankroll, don't just take a application\n365, ho ain't taking no vacation\n24/7, I'm the man to dedication\nOne of the few you should believe in me and early doctor patient\n\n[Chorus: Pimp C]\n\n[Verse 5: Young Toe]\nTake notes from this pimp shit\nBut don't choke when my dick in your throat bitch\nI'm Young Toe aka wake a bitch quick\nSlash take a nigga bitch slash make her make me rich\nPeep swag ho, I'm a Pimp C like Chad ho\nUnderdawg, young hogg, want some asshole\nIt's UGK all day I want the purse first\nGon' believe in the D, believe in T.O.E church\n\n[Verse 6: Doe B]\nAye, aye\nYoung B Doe keep two quarter piece, cross breeze\nFresh braids, fresh shades, riding in something from cross seas\nFrom P.A to the Bay, I got some brain surgeons\nThey'll get me 6 figures a year, so daddy stay flirting\nIt's nothing close your eyes and see I'm still that nigga\nYour bitch chose me she follow me on Twitter\nYou better get her 'fore I show you how I do 'em\nI bleed they ass dry and let my partners ride through 'em\n\n[Chorus: Pimp C]\n\n[Outro: Pimp C]\nYeah and all these old fake ass pimp niggas up out here\nNigga get yo' shit together, you know what I'm talking 'bout\nI remember one time mane, me and Good Game we at the track\nMayne these niggas picked up they mother fucking hoes up mane\nYou know what I'm talking 'bout\nAnd they hollering pimping around this mother fucker\nNigga get your shit together boy, you mother fuckers ain't pimping\nMane ya'll scared as a mother fucker mane\nYeah, but these hoes believing in the truth around here\nYou know what I'm talking 'bout bitch\nAnd we is the truth in and out the mother fucking booth\n365 man I'm so mother fucking live bitch and high\nI can believe I can touch the got damn sky\nYeah this ? ho you know what I'm talking 'bout\nAnd we got trophies to prove it in this mother fucker mane", "year": "2010-10-05"}]}