{"artist": "3rd Bass", "songs": [{"lyrics": "You do not dig them, so you say\nTRY THEM! TRY THEM and you may\nTry them and you may, I say..\n\n[Pete Nice]\nSlave drivers on your dollar bills that builds upon your ignorance\nSignificant, you never beat one-two one-two semblence\nSince I ain't supposed, no boastin\nI'm keepin soaps in my mouth like coke stem\nFor the silence of the swine, sittin slick on my slim chews\nLiquor on the lamp, sippin booze as a cow moves\nLose my head over speak of a censor\nMorse code but Three had no family credenza\nFriends of mine align swine on the backstab\nGrabbin greedy, now it's Rikers or rehab\nMy walkin stick just flips, it's a stick up\nMisdirected like Charlie Babbitt, mixed up\nThree-fifths, three-fifths, like this\nHe used to roll, a man with three-fifths, a man without his soul\nSo is this equal or blowin up your ass\nSmoke sticks who got your vote and rather slit your throat\n\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\"\n\n[MC Serch]\nNo no no, green eggs and swine\nBut they keep edgin to my plate, I step back and say\n\"Thanks, cause I just ate,\" not that I would eat it\nEven if I was hungry -- all the ills of the streets\nThat could have done me in I stay clear of all the evil all the envy\nAnd ex-homeboys who used to be friendly\nPretend to be down, but changin real fast\nSo heed the word, heed the word of my FOOT up your ass\nKickin a bone out, castin a stone out\nMakin water ripple but got nothin the middle\nSo now you sit there, makin big waves\nTalkin about my ancestors used to be from caves\nIt's time to wake up, bake the cake, and turn the page\nFor now is the birth, the birth of the mind age\nWe you and me -- all in a new time zone\nAnd give you somethin much better to dine on\n\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\n{I will not eat them with Prince Paul\nI will not eat them with Low Rawls\nI do not like green eggs and swine\nI do not like those 3rd Bass rhymes}\n\n[Pete Nice]\nMy loops and loops and rhymes you never censor\nI'm scramblin eggs on your family credenza\nAttend to your owns or you're blown to bits\nYou're eatin green eggs while I'm swallowin the grits\nYou sits on your bony ass I'm passin on the rhythm, I give em\nGassin me, you try to geez I'll SWING em\nLike a 40 ounce the choice is constitutional solutions\nArrest in domes of ignorannce full\nI'm dickin down swine, I stick my neck out\nGive a slap here, and shorty'll put your head out\nFive G's explicitly you see the story tells\nYou put a sticker on my record and my record sells\nSam I am not, with the not but Sam Sever is\nSo the critics all think they know what clever is\nI never seen you 40'd up at the corners Pops\nSo what a Senator knowin about hip-hop?\n\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Try them..\"\n\n[MC Serch]\nFreedom of speech that is spoken in loose lips\nTo those who appreciate large tips, tippin the scale\nSlum is in favor of the man who can't stand the live flavor\nBob's a jerk and he worked for the ex-friend\nNot X-Clan, but wax get taxed even if it's bland\nBranded for educated street credentials\nAnd can't talk about life's bare essentials\nPut it to plate, cause the plate they won't deny it\nBut won't give you a chance, or even a place to buy it\nCry for freedom, but music's not free, it's choking\nCould never could ever could say what needs to be spoken\nPut this out, before I depart\nBefore I hit the Killdrews, he started with the arts\nI got much much better things, to do with my time\nThan to worry about the green eggs and swine \"Try them..\"\nThe green eggs and swine\nMuch much better things to do with my time\nThan to worry about the green eggs\nThe green eggs the green eggs and the swine\n\n\"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\"Try them..\" \"Bacon souflee!\"\n\"No I ain't gonna eat none of that\"\n\n{I will not eat them here or there\nI will not eat them anywhere\nI will not eat green eggs and swine\nHehehehe... BUT MY BALLS ITCH!}", "image": "https://images.genius.com/ba67f25eba0c6951171aa44e82a3051a.600x600x1.jpg", "album": "Derelicts of Dialect", "title": "Green Eggs and Swine", "year": "1991-06-18"}]}