{"songs": [{"image": "https://images.genius.com/857a416f44825b13b2e0155587142ae2.600x600x1.jpg", "year": null, "title": "My Life, My World", "album": "Man vs Machine", "lyrics": "Ok, alright, alright. You got me up? Is the Mic On?\nYeah. I pledge allegiance to the un-united streets of Los Angeles\nCheck this shit out, yeah yeah...Come on, Ha!\nYou thought I was about to start right there right?\nY'all motherfuckers turn this shit up, it's X to the motherfucking Z\nYeah...Ha, welcome to my planet..\n\n[Verse 1]\nSome things money just can't buy\nFrom what I seen now that's a God damn lie\nBeen involved in some other shit, ran from the government\nLanded the mother ship, thanks for the ride\nMy niggas still bang like the wrath of Cain\nFast lane, smack ya bodyguard and take ya chain\nAnd it's all in another day's work for me\nI spit the truth, the truth gone set y'all free SO-\nWhat's my anti-drug? Drugs!\nAnti-drugs is when I can't get none, for fun\nI drop flows, punk the punk rappers\nLoad clips for nines and clap with gun clappers\nListen, too many motherfucking cooks in ya kitchen\nMissin' the most important part of life cause you bitchin'\nBitchin' so much you should tuck ya nuts\nAnd dick between ya thighs and color your eyes\nAnd wax your legs and buy some bras and thongs\nAnd go crazy in the nightclub for sisqo's songs\nYou a hook motherfucker with the Jordache look\nBring lead with ya heat so the beef can cook\n\n[Hook: Xzibit]\nWho's sticking to the script like pistol grip?\nXzibit, tradition of X-cellence\nHit 'em up, this westside G.S.B\nOpenbar all night drinks for free\nVictory cause we make history\nNiggas actually have the audacity\nWe the shit from the get and we set to win\nStraight hard on a bitch y'all sensitive\n(singing)\nMy life, my world, X to the Z\nThe streets done took so much from me\nFuck what you heard this is realityyyyy\nI close my eyes and pray just to see\nAnother day I live to breathe\nMy life, my world, this is realityyyyy\n(Yeah, Welcome to my planet)\n\n[Verse 2]\nI done had sleep for dinner, natural born sinner\nWatched fiends suck crack through car antennas\nNow that we winning motherfuckers aim to get us\nThe game is vicious constant hostile conditions\nFor the times I dropped Jewels and nobody would listen (nope)\nA new position, got a couple of pots to piss in\nGot the aim of Oswald nigga I ain't missin'\nIf everybody eating' who the fuck gone clean the kitchen\nI got vision, and a real deep suspicion\nAbout a lot of rappers reps and they street conditions\nEverybody got bricks of yay, claim they do crimes that pay\nAnd tell you that it paved the way (BULLSHIT!)\nWell only a few niggas really came up this way\nWith gunplay day-to-day quick to blow you away\nTrying to sound like snoop, trying to ball like Dre\nI just think you mutherfuckers ain't got shit to say\n\n[Hook: Xzibit]\nWho's sticking to the script like pistol grip?\nXzibit, tradition of X-cellence\nHit 'em up, this westside G.S.B\nOpenbar all night drinks for free\nVictory cause we make history\nNiggas actually have the audasity\nWe the shit from the get and we set to win\nStraight hard on a bitch y'all sensative\n(singing)\nMy life, my world, X to the Z\nThe streets done took so much from me\nFuck what you heard this is realityyyyy\nI close my eyes and pray just to see\nAnother day I live to breathe\nMy life, my world, this is realityyyyy\n(Yeah, Welcome to my planet)"}], "artist": "Xzibit"}