{"artist": "50 Cent", "songs": [{"album": "Power of the Dollar", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg", "title": "Da Heatwave", "lyrics": "[Intro]\nThey don't do it like we do\nThey don't do it like we do\nWe keep it gangsta\nThey don't do it like we do\nCause they don't live like we do\nWe keep it gangsta\nDi-di di-da, di di-di, dida di-day\nNiggas is scared to death of me, they know I don't play\nDi-di di-da, di di-di, dida di-day\nNiggas don't want it, I bring it to 'em anyway\n\n[Verse 1]\nI'm gettin' paper, things are changin', bitches love 50\nThey in da club wit' me, poppin' the bub wit' me\nYou should see I'm in the tele, in the tub wit' me\nRubbin' all on my back like they in love wit' me\nI'm a grimey ass nigga, I'm far from a don\nStill a million niggas come at me, kick it like Farrakhan\nI'm in your club wearin' whatever, I ain't tryna be cute\nDeuce-deuce in my booth, fuck you lookin' at dude?\nWe the reason that the D's is searchin' for bundles\nThe reason that they make you take your shoes off at the tunnel\nParty wit' us and get ya link popped, I got ya bank stopped\nDiesel like a nigga home on furlow in a tank top\nYou know how we roll, back to back, expose, sippin' V.S.O\nI D.W.I., I'm a real wise guy\n\n[Interlude]\nThey don't do it like we do\nCause they don't live like we do\nWe keep it gangsta\n\n[Chorus: 50 Cent]\nThey don't thug niggas out like we do\nThey don't stay iced out like we do\nWho keep the bar priced out like we do?\nWe thug 'em out, what-what, bloody his mouth, what-what\nThey don't thug niggas out like we do\nThey don't stay iced out like we do\nWho keep the bar priced out like we do?\nWe thug 'em out, what-what, bloody his mouth, what-what\n\n[Verse 2]\nSome wanna check me, some respect me\nSome sit around tables plottin' to wet me\nWhen y'all niggas come y'all better come correctly\nDo you understand me?\nDo-do-do-do-do-do-do-do, gangsta shit\nI'm laughin' straight to the muthafuckin' bank wit' this, haha\nInside we got razors, outside we got MACs\nThat's why we act like we don't know how to act\nWho wanna got chopped? who wanna get shot?\nWho wanna get these Cristal bottles smashed all across they knot?\nDupe, I run wit' grimey niggas that's down to tear the club up\nYou run wit' dirty niggas that wash and tear the tub up\nMy niggas get knocked wit'out Glocks, there go the shop\nThey get sticked six months, then come right back to the block\nI told Tony, we approaching the game strongly\nI don't give a fuck if I'm rubbin' these niggas the wrong way, what-what\n\n[Chorus: 50 Cent]\nThey don't thug niggas out like we do\nThey don't stay iced out like we do\nWho keep the bar priced out like we do?\nWe thug 'em out, what-what, bloody his mouth, what-what\nThey don't thug niggas out like we do\nThey don't stay iced out like we do\nWho keep the bar priced out like we do?\nWe thug 'em out, what-what, bloody his mouth, what-what\n\n[Verse 3]\nYo, yo in the local club niggas stay gettin' hit\nAll they do is clean up the blood, change the name and reopen the shit\nI watch niggas sip cups and cherish Hennessy as they hard\nThey get drunk, then they wanna thump\nThat's why I get a kick outta makin' em sick\nIce on the wrist, big as the shit Titanic hit\nNow shorties in my hood sayin' they like my style\nHoes in Hollywood sayin' I'm too wild\nI'm gettin' plenty paper, my head is still nappy\nI'm still plottin' to pop police like Pappy\nMason, niggas clearly don't understand what they facin'\nLet them get outta line then I have to lace them\nThey runnin' for they life then I have to chase them\nAnd let shot off in bump-a-clot head\nStyle's awesome, ain't it?\nThe flow's flawless, flip like a cordless jack\nApplaud this black, this ain't ya average rap\n\n[Chorus: 50 Cent]\nThey don't thug niggas out like we do\nThey don't stay iced out like we do\nWho keep the bar priced out like we do?\nWe thug 'em out, what-what, bloody his mouth, what-what\nThey don't thug niggas out like we do\nThey don't stay iced out like we do\nWho keep the bar priced out like we do?\nWe thug 'em out, what-what, bloody his mouth, what-what\n\n[Interlude]\nGangsta shit, 2000 shit\nYo, ayo first they didn't like me, now they let me hit it up\nShawty is a pro son, she know how to get it up\nYou ain't got keep it on the low son, her head game is crazy\n\n[Outro]\nErick Sermon, 2000 shit\nDef Squad nigga, 50 Cent nigga\nWhat-what nigga", "year": "2000-07-06"}]}