{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Verse 1]\nGo\nThe movie starts\n\"Sweet Emotion\"'s playing in the background\nKids are smoking weed with slater\nMan he's such a class clown\nAll the cars are full of beer, Bacardi and Liquor\nBecause tonight there is a giant house party at Pickford's\nIt's the last day of school\nSlater is trippin'\nTony had a weird dream\nAnd tells mike he should listen\nIn his dream he had a naked girl her boobies were decent\nBut then the naked body's head belonged to Abraham Lincoln\nWhoah\nDon gives Randal Pink a pledge sheet for football that says\nHe can't do drugs while Benny's making a paddle\nJodi begs the guys not to hurt her brother Mitch Kramer\nBut they still plan to damn they're such assholes\nThey're breaking it down, for the football coach\n\"You have to use substance?\nRandal pink you better be giving yourself an attitude adjustment.\"\nSo they drive up to the middle school to make a big announcement\nMitchy, Mitchy, Mitchy do not run don't think about it\nMitch asks the teacher if they can escape through the back\n\"50 going on a mission, 25 ain't coming back,\"\nSchool is over but they're getting chased like fuck it lets be out\nCarl's mom pulls out a gun, \"But there's ruffians about,\"\n(Air raid you freshman bitches!)\nThey're smoking weed in Pickford's room\nThe beer man brought the kegs too soon\nThe party's cancelled, ruining the plans that were in store\nCause if you go to Pickford's house and knock his dad answers the door\nMitch is at his game he's pitching' and he's terrified\nOh holy shit he looks up in the bleachers and right there's the guys\nThey catch him and then end him over beat him 'til his canny's pink\nNow he can hardly walk and so he gets a ride from Randy Pink\nThey pick him up later like he's a foolish little kid\n\"You got a joint?\" \"No i don't,\" \"Well it'd be cooler if you did.\"\nAlright, alright, alright, theres Wooderson he's such a crazy fool\nThey go to the emporium to meet some girls and play some pool\nYou leave the dance, you can't come back\nBut fuck it those kids didn't care\nThey wanna walk around a bit but Herschfelder was \"Gettin' there.\"\nNow they're getting chased and they get liked by O'Bannon\nWee, Wee, Wee squeal like a pig oh my god they can't stand him\nNow they're breaking mailboxes with cans that's meant for trash\nGet a gun pulled on em \"fuck this old man, Pickford hit the gas!\"\nThey get revenge on O'Bannon, with Hardy laughter dude scours\nWodderson plotted a beerbst, awesome party at the moon tower!\nPresident George Washington was not a homosapien\nAin't you ever hear the song: \"The Presidents are Aliens?\"\nMitch and Julie hit it off, theyre prolly gonna get it on\nThe beer is flowin nicely then abruptly everything went wrong\nSmells like someone’s smokin reefer! i’m the one thats smokin reefer\nPush him, sucker punch him, oopsie daisies put him in the sleeper\nDominant alpha male mothafucker you fuckin disgust me i hate your guts\nHe’s kickin his ass hes punchin and kickin and killin him til they break it up\nGod damn it, he’s lucky that he’s still alive\nStupid mothafucka had to ruin shit and kill the vibe\nThe party’s over, keg is tapped, it’s get up in the car time\nLets go smoke a joint right on the 50 fuckin yard line!\nBreak down! giggling! party in the hot night!\nMustve been too loud or something theres a fuckin cop light\nCops are talkin shit like they can smell beer and smell smoke\nRandy Floyd is gettin high well wait til i go tell coach!\nCoach comes, mad as hell, Randy Pink, let’s speak\nDitch your loser friends right now and sign your freakin pledge sheet\nSorry coach I got a speech for you it goes like this\nYa see I might play football in the fall but nope i won't sign this, peace!\nMitch and Julie making out until the sun rise\nMama grabs him by the ear you’re off the hook this one time\nMitchell are you drunk right now? heck no mom\nHappy end Mitch Kramer goes to sleep with headphones on\nDazed and Confused", "year": "2011-01-27", "album": "YouTube", "title": "Dazed and Confused in 120 Seconds"}], "artist": "Mac Lethal"}