{"songs": [{"title": "Confedi", "lyrics": "[Dialogue from the movie \"Superfly\"]\nLook Eddie\nThis is a chance, and I wanna take it\nNow... before I have to kill somebody\nBefore somebody ices me\nAre you with me Eddie?\n\nChorus:\n\nNiggas always claim they've got confedi\nBut too many niggas wanna hop out, before they ready\nGet they hand on a block of dough, try to live like Frank Nitty\nPlay it broke until you get out the game, cause the shit gets heavy\n\n[C-Loc]\nZo No in the bucket with ho chicken not made bucks yet\nNigga couldn't meet me in my spot so I say fuck it\nThem niggas don't stick to the program, no white folks hang on Beemer\nFrom O-Z's to keys, now ain't no time to change em\nSee that's why niggas fuck up, chakra made em money\nAnd they stopped makin money, ain't got shit to do with cut\nGo from twenty G's grind for the week with no expenses\nTil ya splurge and put your biz up in the streets, a nigga snitches\nNow them bitches lookin at you shitty and, you done attracted\nEvery beggin bitch up in the fuckin city, it's a pity\nWith you, honey used to spend a week, jumped up\nA few G's, since she wanna fuckin play gold dig\nThey never knew you had that much grip, now you got\nEvery clown in the city tryin to peep out your shit\nStart splurgin 'fore they time up real dummies they smoked\nBut that's the main two reasons why niggas go broke\n\nChorus\n\n[Max Minelli]\nMain most of these niggas need to slow they roll\nClaimin balla but they never played the game befo'\nToo many niggas hindsight, wide right, doin what ya cain't\nSuicide my eyes wide-eyed, bein what you ain't\nWhy so many motherfuckers claim they movin that weight\nBut wouldn't even know a dime if it shit in they face?\nSo why pussy ass niggas flashin Benz car keys\nShowin ass but they barely even seein O-Z's?\nAnd got the whole neighborhood thinkin they ship keys\nAnd them makin hoes thinkin that they really OG's\nBut boy if you only knew, you shouldn't be\nSomethin that you never been, bitch niggas ain't veterans\nI'm tellin them, lay it low til on the way out or\nEnd up a dead motherfucker with your dick in your mouth\nCause when the shit gets heavy, to you it's like a movie\nThat's scary and real, niggas let the pistol play Freddy, confedi\n\nChorus\n\n[Young Bleed]\nUhh, seldom seem in the platinum dream, hustlin for cream\nBy any means necessary, top it off with a cherry\nFor every nigga that know, it comes natural, don't rush your life\nAway playa potnah stack up your cashflow and take your walk\nA day at a time, from a nickel to a dime\nSmokin weed drinkin wine, keepin it on my mind\nA blind fury as a shine, jewelry flashin\nNiggas playa hate cause bitches love it with a passion\nBut fuck em though; I live untouchable, a hustler high\nTryin to make it out the game like Superfly\nLivin do or die, and I'm on it 'fore I bail out the do'\nAsk my hoes before I go; you want a blow? Smoke somethin\nAin't no future in your frontin my naigga\nGotta get the ground beneath your feet first potnah\nAnd take it how it come, and play it like it go if you ready\nAnd let em know you all about your 'fedi nigga huh?\nHear me say what...\n\nNew Chorus:\n\nHoes up on the dick, cause you're drivin Lexus\nBut where all the bitches was, before you was flexin\nHe's a money hungry nigga to have, B-L-E-S-S-E-D\nBut the white folks'll have your ass dreamin bout the street\n\n[Lee Tyme]\nI see, most nigga shit cream\nThem hoes know, when they gets caught by the team, believe me\nThey get hotter than that, your stack will scream\nOnce The Man gets to diggin on 'fedi\nYou spend it so lavishly, obviously you ain't recognize\nThat them laws do have eyes\nAnd what you do attract, is like dick to cat\nBefore you know, they'll be pullin burglar boys off the door\nThe Caddy, whose gonna ride inside? Well not you\nYour folks had to slang em, bank em\nOn another appeal, nigga these streets is real\nYou reminiscin, do you still get a thrill?\nI tell you it'll fail you every time, these material things\nGet your pride up, got these fools thinkin they kings\nAnd your punk ass team can't help, or will they?\nBecause you didn't choose wisely\n\nHey, look playa -- you wanna be rich?\nWell the key to bein rich is paisleys\nOh yeah but you gotta make sure you make progress daily\nBut if your mind ain't right, get your fuckin mind right\nBIOTCH!", "album": "My Balls and My Word", "year": null, "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}