{"songs": [{"lyrics": "[Jay-Z talking]\nUh huh\n(scratching) \"chi chi chi chilly chill\"\nThis gangsta gangsta uh\nUh huh\nThis gangsta gangsta shit\n\"chi chi chilly chill\"\n\n[Chorus: Jay-Z]\nI'm from murder murder Marcyville\nMy nigga you heard we clap you we certainly will\nSouth Philly mothrfuckers kill at will\nBet the nine milly make you niggas \"chilly chill\"\nMurder murder Marcyville\nMy nigga you heard we clap you we certainly will\nSouth Philly motherfuckers kill at will\nBet the mack milly make you niggas \"chilly chill\"\n\n[Jay-Z]\nCheck the four corners of the earth I'm a man of respect\nMarcy projects motherfucker I'm demanding respect\nThe niggas done fucked up and they called in the cleaners\nJayo you're not a felon you're a misdemeanor\nDon't let the Nina hit you and split your bean up\nFuck the punks with you we hit your team up (buck buck)\nY'all niggas hurtin'\nThat publicity stunt is not workin'\nYou made a bad situation worsen\nY'all wanna see me out this game like Rider\nYou fuckers better stop that ?we came from a game wider\nHow the fuck you gone try us?\nYou can't deny us\nOf a dollar it's the Roc bitch holla!\nBeef ain't nothing to a boss nigga\nYou crossed the line\nThe orders go out to kick in your doors\nWavin' the 4 4\nAll I heard was Jigga I don't want it no more\n\n[Chorus]\n\n[Bleek]\nYo you heard a nigga fronted on Bleek word?\nNigga, never fronted on Bleek word\nIf it's written I wrote it\nYou spit it I spoke it\nSo...Never forget Bleek totin'\nI'm from murder murder Marcyville\nIf y'all look in the mirror do y'all see real?\nWe see through your facade\nY'all soft like Q-tip cotton\nY'all dudes ain't hardly real\nThe boss spit off impulse certainly will\nIf I smack this kid you'll probably squeal\nSo open the hydro we firing steel\nWe clear out the building like a fire drill and\nMoney too long for y'all to fold\nYou know to catch a case to me is like a common cold\nSo get your guns out you ain't ready for war\nYou know the R-O-C too strong for y'all\nMotherfucker\n\n[Chorus]\n\n[Geda K]\nYo, I'm in a zone\nYou niggas done disturbed the peace\nI try to relax\nStill got word off the street\nHear you frail bastards tryin' to get your name back\nYou ain't achieve shit since you got your name in rap\nWe can't be misjudged you hear the flows and the lyrics and\nThe fifth slugs'll tear holes in your spirit and\nIt's like rap turned y'all to kill and hustle\nKnowin' y'all gone snitch if I hop one touch you\nTalk that gangsta slang be a gangsta slain\nThese N-Y-M-P gangstas bang\nHow you talk real but need your click to live?\nAll I need is the fifth and two clips to give\nGeda keep the unsane ratchet\nFor y'all who swear y'all can dodge the rain put on your rain jackets\nIt's the game y'all ain't fit for drams with us\nAnd we pop the big guns that tear through armored trucks\n\n[Chorus]", "title": "Murda Marcyville", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}