{"artist": "A$AP Ferg", "songs": [{"title": "Cocaine Castle", "image": "https://images.genius.com/6a2f58fb40c2a44463c586658c8fc9ae.1000x1000x1.jpg", "album": "Trap Lord", "lyrics": "[Chorus]\nEverybody going to this cocaine castle\nYou'll probably see your reverend at this cocaine castle\nPimps and prostitutes at this cocaine castle\nDoctors in their suits at this cocaine castle\nBabies in they Pampers at this cocaine castle\nCrying with they grandma at this cocaine castle\nMomma doing drugs at this cocaine castle\nTryna get some buzz at this cocaine castle\n\n[Verse 1]\nAll another day in the crack house, where demons be talking to fiends\nCouple hits and they blackout, needles be stuck all in their veins\nAu revoir, sing a song that be stuck all in your brain\nThat shit so potent, it have you doing devilish things, yeah\nTake a walk through the dark side, where a nigga don't see no light\nOne hit is all I need, that nigga gon' take your life\nWhat about your wife? What about your kids?\nWhat about your crib? What about your moms? What about her tears?\nWhat about that shit? What about your uncle? He died last year\nFrom the same thing, you kissed that glass to hide your fears\nBring nothing to your life, you die, you die\nBasing your life upon the hope that you gon' get the same high\n\n[Chorus]\nEverybody going to this cocaine castle\nYou'll probably see your reverend at this cocaine castle\nPimps and prostitutes at this cocaine castle\nDoctors in their suits at this cocaine castle\nBabies in they Pampers at this cocaine castle\nCrying with they grandma at this cocaine castle\nMomma doing drugs at this cocaine castle\nTryna get some buzz at this cocaine castle\n\n[Interlude]\nI remember when I was, when I was lit the fuck up\nI was, I just, I just, I just remember that day\nI remember what it feels like\n\n[Verse 2]\nTripping off this weed got a nigga slow motion\nChills all over my body like some cold lotion\nTryna wrestle demons like I'm fucking Hulk Hogan\nLooking for the cure but I'm seeing no potion\nTryna sleep it off but it only gets worse\nSeems like my whole life fucking been cursed\nDevil tryna get me in this fucking paradise\nFucking all these bitches raw just to roll the dice\n\n[Breakdown]\n\n[Outro]\nWhy you in my dreams?\nWhy you in my dreams?\nWhy you in my dreams?\nWhy you all in my dreams?", "year": "2013-08-20"}]}