{"songs": [{"album": "E.B.A.H.", "image": "https://images.genius.com/ecaf59e8351d366bc86005cc66afe532.800x800x1.jpg", "year": "2012-08-30", "title": "Earregular", "lyrics": "[Intro: Tech N9ne]\nThe Great Omnipotent Doc Strange is my name!\nSix-six-triple-eight-four-six-nine-nine-three\nNever don't try find me\nWhy? Why? 'Cause I'm lost in the clouds\nN9ne? Earregular boss in the house\n\n[Verse 1: Tech N9ne]\nI don't hear what you hear, nigga\nBecause I hear different you label me a wierd nigga\nI like that, and I like mixing dark and some clear liquor\nFor the night cap, although we ain't the same I cheers with ya\nThen I'm right back listening to Doors records\nWhile I get groupie whores naked\nIf it's a blood and gore message in a movie I'll sure catch it\nMy brain's a vorplex, it got many levels, your message\nMake a nigga want to ignore that shit, y'all pissy poor, that's it\nIntricate bred, I'm a bit pompous, if I want it then I'mma get\nWhile you're mad at your bitch\n'Cause you know she at the back of the bus kissing the tat on my dick\nYou gotta be sick, then I had her, thick anatomy, hit with the flattery tricks\nStagger these raggedy battery pricks\nSnake and bat ain't average, that'll be quits\nOn one, two, three, my nigga!\nDoing four much with five, I be, my nigga!\nSix thousand and seven hundred degrees, my river!\nAte an earregular mind state, but it fried N9ne's liver!\n\n[Hook: Tech N9ne]\nEarregular, we're nebula\nDear secular listeners, we're here next to ya\nGiving you fear messed with original weird stress for ya\nPeer pressure, the ignorant near deaf niggas!\nEarregular, we're nebula\nDear secular listeners, we're here next to ya\nGiving you fear messed with original weird stress for ya\nPeer pressure, the ignorant near deaf niggas!\n\n[Verse 2: Tech N9ne]\nI know that my style is diff'rent!\nMeanwhile I get frowns and lips bent\nHe better know, we let it go, flee, never throw, glee at a ho, see that a pro\nWill make the sounds breaking down the distance\nI get my psyche blown, when I sit and I write these songs\nThen I fuck with my Nikes on: \"Plop, plop, plop, plop!\"\nTo the women it might be wrong, 'cause in the middle of the night he gone\nAnd the wife for the night she's home: \"Stop, stop, stop, stop!\"\nSo many sicknesses that I get medicine, I get it up off a nigga\nBut it can never disappear, I know many get with this\nBut it's a couple of really stupid individuals looking for the Nina fate\n'Cause I innovate, and I be the Yates, they can disintegrate\nGuess my sin it begins with the number before ten\nAnd being a clown, always been and raised!\nWhen I rhyme my design isn't mindless\nYou can find Tech, flowing up the divine stretch\nNever spineless, spider K's a rhyme vet\nAnd we ain't the only earregular since I got Stevie, Mayday and I signed Ces\n\n[Hook: Tech N9ne]\nEarregular, we're nebula\nDear secular listeners, we're here next to ya\nGiving you fear messed with original weird stress for ya\nPeer pressure, the ignorant near deaf niggas!\nEarregular, we're nebula\nDear secular listeners, we're here next to ya\nGiving you fear messed with original weird stress for ya\nPeer pressure, the ignorant near deaf niggas!\n\n[Verse 3: Tech N9ne]\nY'all motherfuckers stuck on stupid (duh!)\nI tried to slow it, but my flow's no lucid thing\nI gotta be clever to do \"This Ring\"\nYou can feel it if you 67 or you 15\nAggin! Yeah, that's \"nigga\" backwards\nTech N9ne be that spitter master\nWith a Cris, with her mugs, and I'm with a grasher\nLet a chick on the bus and I'm finna smash her\nCould have been a bastard\nSwimming in cash and the laughter, I'm a sinner faster\nBetter get a pastor\n\n[Hook: Tech N9ne]\nEarregular, we're nebula\nDear secular listeners, we're here next to ya\nGiving you fear messed with original weird stress for ya\nPeer pressure, the ignorant near deaf niggas!\nEarregular, we're nebula\nDear secular listeners, we're here next to ya\nGiving you fear messed with original weird stress for ya\nPeer pressure, the ignorant near deaf niggas!"}], "artist": "Tech N9ne"}