{"songs": [{"album": "Piece of Mind", "image": "https://images.genius.com/531276122f86bcf961f88676e93191bb.700x700x1.jpg", "year": null, "title": "Survival", "lyrics": "[* People screaming in background *]\n\nHey, hey come here, bring yo ass over here right now\nPut the money in this motherfuckin', FUCK THEM!\nJust put the money in the got damn bag, just do what I say\nHey, hey show me them hands, ooh shit girl\nGET WHAT I SAID GOT DAMN IT!\nKeep showin' em' ooh shit girl\nGOT DAMN IT DID YOU HEAR ME! DON'T STOP, DON'T STOP!\n\n[Verse 1]\nI do get me some grain, ridin' me a Stang\nGo inside this bank, decide to get em' for them thangs\nThat's what had in mind, some nitro and some nines\nPipe bombs and napalm, shit you think I'm lyin'\nAs quickly as I flee them folks come to take it\nLeft my ass no choice but to go off and shake it\nShake it to the left, no no, shake it to the right\nI'm gonna shake it to the left because they left my ass to die\nShit off in ya I cause that green I multiply\nAllergic to that shit back in 1989\nWhen I sold that dope or that purple traded soap\nAll that bullshit for a highly ass rope\nThey make it for that soap, that's all that she wrote\nBroke kibbles to bits , brought my mom's to pokes\nI'm stuffin' bags possessed, my dope I will compress\nShit I would invest in some quakers on the cut\nSee most of the time I got my ass in\nThen most the time I took the fuckin' ass end\nOf the stinkin' paddle, beat my ass like a rattle\nSnake because they fake, took a piss off in my shadow\nAn adult lesson, I couldn't get no Wesson\nI dropped down depressin' a broke nigga stressin'\n\n[Hook (x3) with various ad-libs]\nSurvival\nSurvival, in these streets\n\n[Verse 2]\nIt's killin' me here, we livin' on the hill\nNext to a crazy motherfucker you can't feel\nThat's why I keep the four-four, the mask and the boat\nTey ass fuck with me, they ass cuttin' close\nLike those on the eighty, say hoes weighty\nShit for me, niggas takin' half, I don't play that\nI want my cakes and eat it, the goods and delete it\nThis shit could be repeated but my ass just seem to meet it\nLike winds through a pipe or candles to the night\nHoes to a pimp, or a Sphinx to a dyke\nCall me what cha' like but I ain't headin' bike\nExcept for twenty days and that was twenty nights\nA fuckin' December that was thick as timber\nWolves and they tryin' to hit my rims as I deliver\nShit to keep me goin' hoes they keep throwin'\nMonkey tools at my shoes, keep my toes swollen\nCause I just go on fast and niggas might blast\nIf I had some bullshit about who's side is grass\nSo why you fuckin' cuttin' disrespectful askin' nothin'\nAin't got shit to do but you wanna be doin' something\n\n[Hook (to end) with various ad-libs]"}], "artist": "Tela"}