{"songs": [{"year": null, "title": "Kiddie Litter", "image": "https://images.genius.com/0f304f2931f4639046b2949db51132f6.359x350x1.jpg", "lyrics": "Lights flicker on the frame of a light sleeper...watching sports\nIn a stained wife beater and boxer shorts\nNight creeps in-between the uneven slides of venetian blinds\nAnd it sees signs of struggle\n\nHe resides in a jungle where the weeds dry and tumble\nEvery time he deserts love and leaves behind his troubles\nThis time it seems he's finally humbled;\nDefeated by the feline he's been trying to subdue, beaten while they cuddle\n\nNow subtle differences got him running from images\nWeird as it is, circus mirrors are a serious fear of his\nHe stays a safe distance from the scary kid\nHis beard is big and he wears a wig in public appearances\n\nHere he is...half alive in the flesh suit\nCurious and appetized by the fresh fruit\nServed on a dish at his nightly help group\nWho dreamt of catching better Z's? Most people would've slept through it\n\nIf you ain't been through it, then you don't know the way the days\nJust waste away. A change of pace needs to take place\nI play with razor blades and I shake\nUntil I shave my face and the break....\n\nOf day lights flicker on the frame of a light sleeper...watching sports\nIn a stained wife beater and boxer shorts\nSun rays creep in-between the uneven slides of venetian blinds\nAnd it sees signs of struggle\n\nHe hides a bundle of demons behind the stubble\nSleep dehydrates him 'til the dreams dry and crumble\nBleeding from his eyes, the scene of the crime's a puddle\nWhere he cries Uncle...and doesn't realize he's lovable\n\nLover girl doesn't purr because she sees\nSomething of hers stuck in a world that needs to be freed\nThis cat's got tongues tied 'til she leaves\nA curiosity that could kill an entire species\n\n\"See these fingers of mine?\" Yes\n\"It's time to see if one of them fits the dark ring around your eyes,\" She says\nSo she sends me to a guy who signs permission slips\nAnd if his finger fits...\n\nHe's going to poke inside to see what's alive\nSo I went to where she sent me only to find a blind man\nWith worn down fingertips\nAnd his neck was a library full of razor bumbs\nHe placed a cup on a tabled labeled \"Talk to Me\"\nAnd he snuck a smile passed the customs of his scruffy face\nHe just stared in my general direction and said...", "album": "Sickly Business"}], "artist": "Sage Francis"}