{"songs": [{"title": "Pillow Talking", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro: Lil Dicky]\nAyy, ayy, damn\nL tapped twice on some ass, like grams\nI just fucked, ay\nNow what I'm doin'?\n\n[Chorus: Lil Dicky]\nI'm just pillow talkin' with a bitch, ayy\nI'm just pillow talkin' with a bitch, ayy\n(Do you fuck with the war?)\nI just finished spazzin' on a bitch, ayy\nNow I'm pillow talkin' with a bitch, ayy\n\n[Verse 1: Lil Dicky & Girl]\nI'm like, \"Girl, that was great, talk about a connection\"\n\"Am I alone in my praise, do you share my assessment?\"\nShe like, \"Heh, yeah, that was nice\", (eh) \"I enjoyed myself\"\n\"Great\", \"Yeah\"\nShe like, \"Can you reach that shelf for my phone?\"\n\"I'll take care the alarm\"\nI'm like, \"Oh, for the mornin', like, to sleep?\"\nShe like, \"Yeah, heh, we just had sex\", (eh) \"What did you think?\"\n\"I was just gonna fuck you and leave?\"\n\"No, I— I hadn't thought that far ahead\"\n\"But of course, can I get you a t-shirt—\"\n\"Oh, can you not tickle my hair?\" (eh)\n\"It's just a personal thing, it's not you\"\n\"Okay, sorry for doin' it, heh\"\n\"No, no, this just a personal thing, it's not you\"\n\"Okay, cool\" (eh)\n\"Yeah, uh, so, you're from Minnesota?\"\n\"Only thing I know is that it's colder\"\n\"Break it down, how's it compare to livin' in LA?\"\n\"Well, I can't compare them, they're so different\"\n\"You know what I'm sayin'?\"\n\"Yeah, for sure\"\nShe like, \"Apples to oranges\"\n\"Well, you can still compare them, but I hear you\"\n\"Uh, what's the deal with your family? Got any siblings?\"\nShe like, \"I have a brother\"\nI'm like, \"Oh, what he do?\"\nShe like, \"He in the Army\"\n\"Oh, true\"\n\"Uh, do you fuck with the war?\"\nShe like, \"Huh? What did you just say?\"\n\"Uh, like, just now?\", \"Yeah\"\n\"Do you fuck with the war?\"\n\"No, I don't fuck with the war\"\nI'm like, \"No, I don't fuck with the war!\"\n\"Just don't know how to react to the forces\"\n\"I should have just thanked you, of course it's not—\"\n\"Uh, why would you thank me?\"\n\"Uh, I guess I assumed it extended to families\"\n\n[Verse 2: Lil Dicky & Girl]\nBut, okay, while we're on the topic, I been actually thinkin'\nAbout some shit, about the Army and Navy\nWhat if tomorrow is the day that the fuckin' aliens came and invaded our nation?\nLike, would we even be able to fuck with their shit?\nLike, do we got the type of weaponry to fuck with their ships?\nOr not at all, like, would they just walk up in this motherfucker\nLaughin' at us, and blastin' at us\nAnd makin' everybody disintegrate and assimilate without a hint of intimidation?\nOr could we do some shit to be makin' they heart race?\nGranted, I don't know the alien heart\nBut, you get what the fuck I'm sayin'? \"Uhm\"\nLike what the fuck would it be like?\nWould they be like \"Earth go hard\" (eh)\nOr is it just another conquest? (oh)\nOr would they be like, \"Damn, Earth go hard\" (eh)\nThey was harder than Simian\nYou ever talk to your brother about this, uh, type of stuff?\nThen she like, \"No\"\nI'm like, \"Well, what you think?\"\nShe like, \"I don't concern myself with hypotheticals that couldn't be\" (eh)\nI'm like, \"Girl, what you mean?\"\nShe like, \"I don't believe\"\n\"In the war?\", \"In aliens\"\n\"Oh, hold up, hold up, wait\"\n\"Girl, what you sayin'?\"\n\"That all of the life in the universe happens to be where you stand?\"\n\"I– I guess\"\n\"What an enormous coincidence that shit would be\"\n\"Do you see what I'm sayin'?\"\n\"I can't hear what you're sayin'\"\n\"Well, the universe always expandin'\" (eh)\n\"There are infinite galaxies\" (infinite)\n\"Why would we be the anomaly?\"\nShe like \"That's no coincidence\", (uh) \"I call that shit God\" (hold up)\nI'm like \"Oh, you're religious, bitch\"\n\"You think it's all God?\"\n\"No, I know it's all God\"\n\"No, I know that there might be a God\"\n\"First off, nobody knows there's a God\"\n\"Girl, I think we should drop this\" (eh)\n\"No, what's goin' on in your brain right now?\"\n\n[Verse 3: Lil Dicky, Girl & Brain]\nBrain, ayy, Brain on some other shit though\nI been all up in the club for a year, hey (Brain)\nI been killin' shit, don't mind me, eh\nUh, I'm just top flight, ah\nUh, I could sure use a Sprite\nI'm thirsty as fuck\nWho gettin' money? That's Brain (Brain)\nWho make decisions? That's Brain (That's Brain)\nWho make the hits? That been Brain (Oh, that Brain?)\nWho run this whole operation? That been Brain since—\nBrain, can— can you just get back to the issue here?\nUh, really? Can you just remind the Brain?\nYou're such an idiot, we're talking about God and if He exists\nDon't call Brain names, uh\nThe Brain couldn't recall\nBut if I'm not mistaken, this bitch to my left\nGuaranteed there's a God\nI believe in a God, yes\nSo, God never wrong?\nGod never wrong, right?\nHeh, yeah, that's, like, the whole point\nBrain, just get there, please\nHold up, so, God made the Earth\nAnd God was like, hold up\nThis shit is borin'\nIt need more shit\nGod was like, \"I'ma put dinosaurs on that bitch\"\n\"Dinosaurs on that bitch\"\nThen He like, \"Why'd I put dinosaurs on that shit?\"\nWhat is your brain even saying?\nCan he get to the point?\nHold up, Brain, you just did it! Ah\nGod ain't wrong, what the fuck was He thinking?\nAbout what? Bitch, the dinosaurs!\nHe made the Earth for them, but then He like, 'Nah'?\n'Dinosaurs are just blah'? What's your point?\n'I'ma cook up some blondes'?\nLike, He was way off, I don't look like a dinosaur\nHo, them things thirty-five feet\nI'm like five-foot-eleven (Up on Tinder, I'm six-foot)\nSeen that Bronchiosaurus?\nThat thing fuckin' neck go to heaven (Good shit, Brain)\nAnd that's just an expression, bitch\nThere ain't no heaven (eh)\nFunny – I'm just messin', but if he ain't wrong\nI guess this the exception\nCan I talk now? Go ahead\n\n[Verse 4: Lil Dicky & Girl]\nLook, everything in life has purpose (eh)\nYou, chickens, a midget at a circus\nWhat? I don't interpret\nShe like, ”That's not for me to determine”\nSo dinosaurs' purpose was to just die?\nThat's not for me to determine\nBut, okay – I'm just a person\nOkay, but think of the root of the argument, girl (eh)\nView how we started this, girl\nLike, you don't believe in the aliens\nYeah, I just—\nYou confine God to Earth, girl, I find that shit salient\nI just don't presume to know the plan\nBitch, me neither, but that's not what I've been sayin'\nWell, what are you saying?\nWhy can't God fuck with aliens?\nWhy can't Earth be like a fuckin' small side project for this guy?\nOkay, look, we just don't see eye to eye\nYeah, but logically, like, you don't believe in your side\nWell, you're bringin' up fuckin' dinosaurs\nLike, we could have shared the Earth with them, nobody knows\nYeah, there is hard soil evidence, girl\nLike what's next, you don't fuck with Pangaea?\nShe like, \"Let’s change the subject\"\nOkay, this bitch don't know 'bout Pangaea\nBrain, leave it alone\n\n[Verse 5: Lil Dicky & Girl]\nUh, I'm starvin' – are you hungry, by chance?\nOh, my God, I'm so hungry\nYes, do you wanna get a pizza?\nFuck yeah, Fuck yeah, I'm on it\nAlso, I'm sorry about that whole interrogation thing\nCome on, dude, I'm a grown up (eh)\nI'm capable of having intelligent conversations\nOkay, I just— fuck it\nBack to this pizza, I lean pepperoni\nUgh – sausage?\nHow can you eat that shit?\nNo, no, no, this not Domino's, this legit\nIt's high quality meat and shit\nNo, no, I'm vegetarian\nOh, right, well, we can get half pepperoni (eh)\nAnd half of whatever you like\nUgh, ew, I can't have that shit in the same box\nUh, s— seriously? – Yeah\nYou're that against meat?\nNo, I'm that against us being gluttonous\nThinkin' that animals live on this earth to get eat\nOkay, is it how we treat them?\nHeh, that sure doesn't help\nOkay – she like, ”I'm not opposed to us huntin'\" (eh)\n\"But now we not trackin' them down\"\n\"We just breed 'em to eat, that's disgustin'\" (eh)\n\"You should honestly read on the subject\"\n\n[Verse 6: Lil Dicky, Girl & Brain]\nAll right, hold up\nJust because we're not runnin' around with a bow and arrow\nDoesn't mean we're not huntin' these chickens\nWe just set the place to do our huntin' intelligently enough\nTo manipulate these animals and get them to do exactly what we want\nThat's my point, we just incubate animals\nInstead of just letting them live how they come\nYeah, but, that's your God at work, bitch!\nWhile we go hard on Earth\nWhat you think would happen right now if you left my place\nAnd there were like three wolves waitin' for you?\nWolves? – Bitch, they would tear your ass up!\nViciously, like, they would eat your titties (and your pussy)\nThat's what they do (and your face and shit, eh)\nHumans are smarter, bitch, that's what we do\nShe like, ”Apples to oranges”\nBitch, that phrase don't make no sense\nWhy can't fruit be compared?\nShe like, ”I'm gonna leave”\nThere's just all of these conflicting principles\nRight, enjoy your pepperoni pizza\nI will, that's my God-given right (eh)\nShe like, ”Where is my bag?”\nOh, that leather one next to the trash?\nThat's the one, right? Made out of cow, I think?\nUgh, why are there no Ubers in this area?\nSo you don't eat the meat (eh), you just be wearin' that shit\nI'm not listenin', dude – that's barbaric as shit (eh)\nDo you come from the vikings?\nWhy are you even still talking?\nDo you take peoples' land? I'm not listenin', dude\nDo you fuck with the war?\nHow are there no Ubers anywhere?\nJust download Lyft (eh), they are bigger in presence out here\nI don't wanna add shit to my phone\nOkay, the choices are clear, ho\nUbers are not around here, ho\nTaxis will come, but they real slow\nAyy, the Brain gotta poop\nT minus five 'til the Brain gotta shit\nI just downloaded Lyft, but it's being so glitchy\nUh, look, do you just want to sleep here?\nUh, no thanks – It's past 2 AM\nI'm not sharing a bed with you\nYou can sleep in my bed, I'll sleep on the floor\nFine, you're sure? Yeah, it's cool\nI won't throw you out to the wolves\nOh, my God, you are so annoying\nI couldn't help myself, but can you at least throw me a pillow?\n\n[Chorus: Lil Dicky]\nI'm just pillow talkin' with a bitch, ayy\nI'm just pillow talkin' with a bitch, ayy\n(Do you fuck with the war?)\nI just finished spazzin' on a bitch, ayy\nNow I'm pillow talkin' with a bitch\n\n[Outro: Lil Dicky, Girl & Brain]\nBrain gotta poop, still\nPlease don't neglect the Brain\nPlease don't neglect the Brain\nHold on, is that my Lyft? I don't know if I—\nNah, I got a pizza – full pepperoni, too\nSo, you're not gonna wanna be a part of it\nBut first you should poop\nPlease don't neglect the Brain"}], "artist": "Lil Dicky"}