{"songs": [{"year": "2011-10-14", "album": "The Nebulizer", "image": "https://images.genius.com/108c1549cb9fa7e49685238b78f6936d.600x600x1.jpg", "title": "Don’t Fuck With Kerser", "lyrics": "[Interlude 1]\nOi, you reckon you could pour us a drink? I'll go ya halves\nYeah, sick...\nKeep going man, fuck me, half\n\n[Intro]\nDon't fuck with Kerser\n\n[Interlude 2]\nThere you go\nPretty fucking dodgy, huh?\nOh, fuck\n\n[Hook 1]\nDon't, Don't, Don't, Don't, Don't, Don't\nFuck, Fuck, Fuck, With, With, With, With\nDon't fuck with Kerser\nDon't, Don't, Don't, Don't, Don't, Don't\nFuck, Fuck, Fuck, With, With, With\nDon't fuck with Kerser\n\n[Verse 1]\nDrinks poured, ice cubes, drugs are my crew\nCall them what you want, ma'fucker I don't like you\nGlide through with a shiv on the hip\nI do recommend that you listen to this\nPump loud, got em shocked and they're staring and shit\nMost of them fucking love it but they're scared to admit\nI don't give a fuck what you think, I'm from the street\nPow pow past your house when I stomp the beat\nMe and Nebs making shit you never heard before\nCharlie Poulton and cunts like \"that ain't raw\"\nI'm a motherfucking maniac, brain attack, ain't you wack\nEyes on your lips motherfucker, can you say it back?\nDi-di-didn't think so, staying on my thug shit\nTell me no progression when we just made a club hit\nFu-fu-fuckwit, best admit that we run shit\nNever knew we run it then we calling you a dumb prick\n\n[Hook 2]\nI'm so drunk that I can't stand up\nSo much bourbon in the glass, with the joints rolled up\nNow I'm running through your club with my dick in hand\nNever ever gave a fuck, never know to give a damn\n\n[Interlude 3]\nOi buddy, you seen me up there or what?\nYeah it was all right?\nAll right? What do you mean all right?\nLike, all right\nI'm fuckin', I'm a sick cunt mate. Fucking give me your money\n\n[Hook 1]\nDon't, Don't, Don't, Don't, Don't, Don't\nFuck, Fuck, Fuck, With, With, With, With\nDon't fuck with Kerser\nDon't, Don't, Don't, Don't, Don't, Don't\nFuck, Fuck, Fuck, With, With, With\nDon't fuck with Kerser\n\n[Verse 2]\nBack on track, bet your tracks are wack\nOnly making boom-bap 'cause you can't adapt\nDon't-don't get me wrong lad, I'm into that\nJust like to switch it up every time I spit a rap\nIf you hate me for that, get your fuckin' brain cracked\nGet your house ran through, get your brother's chain smashed\nFuck Aussie hip hop man, I'm finding it boring\nHear ten percent, the other ninety is corny\nBringing something for them people wanting a switch up\nSwitch up, shit bruh, always being a sick cunt\nThere's a fat slut\nPunch her mouth now her teeth look like fat chub\nGrab the-grab the handbag, only had loose change\nTic-tac, dollar coin and a bit of food, mate\nToo-too-too late, still up in my shit though\nYou got the wrong idea if you pictured a disco\n\n[Hook 2]\nI'm so drunk that I can't stand up\nSo much bourbon in the glass, with the joints rolled up\nNow I'm running through your club with my dick in hand\nNever ever gave a fuck, never know to give a damn\n\n[Interlude 4]\nOi, can I have your number?\nNah, fuck off\nFuck off, you look like a pelican anyway\nHuh\nFucking whore\n\n[Verse 3]\nOn a train with a chainsaw, tell me that I ain't raw\nWalking barefoot, twelve at night through Claymore\nFuck, fuck, fuck em, fuck em\nFuck em all, shut the front, I want a breast pic\nTop-topless no nonsense [?]\nPull your pipes out and get the motherfucking rocks li-li-lit\nWhat if they never ever give it up\nCome on bruh, you really think I give a fuck\nI'm the realest rapper holding the mic\nMy other personality even told me I'm right\nGet them hands up\nToo fucking drunk, can't even stand up\nI'm the man, bruh, you're a fan, ah\nJust admit you're a fan of the man, nah\nSomething wrong? It's-it's-it's-it's all good though\nAin't say my name 'cause you motherfuckin' should know\n\n[Hook 2]\nI'm so drunk that I can't stand up\nSo much bourbon in the glass, with the joints rolled up\nNow I'm running through your club with my dick in hand\nNever ever gave a fuck, never know to give a damn"}], "artist": "Kerser"}