{"artist": "Ice Cube", "songs": [{"title": "Dead Homiez", "lyrics": "[Verse 1]\nUp early in the morning, dressed in black\nDon't ask why? Cause I'm down in a suit and tie\nThey killed a homie that I went to school with (Damn!)\nI tell ya life ain't shit to fool with\nI still hear the screams from his mother\nWhile my nigga laid dead in the gutter (Shit!)\nAnd it's getting to my temple\nWhy is that the only time black folks get to ride in a limo?\nIt makes me so mad I want to get my sawed-off\nAnd have some bodies hauled off\nBut no, I pay my respects and I'm through\nHug my crew, (whaddup Cube?) and maybe shed a tear or two\nThen I wanna get blitzed\nGrab my 40 ounce and then I reminisce\nAbout a brother who had to be the one and only\nSo I dedicate this to my dead homiez\n\n[Verse 2]\nAnother homie got murdered on a shakedown {3 gun shots}\nAnd his mother is at the funeral, havin' a nervous breakdown\nTwo shots hit him in the face when they blasted {2 gun shots}\nA framed picture and a closed casket\nA single file line about 50 cars long\nAll driving slow with they lights on\nHe got a lot of flowers and a big wreath\nWhat good is that when you're six feet deep?\nI look at that shit and gotta think to myself\nAnd thank God for my health\nCause nobody really ever know it\nWhen it's gonna be they family on the front row\nSo I take everything slow, go with the flow\nAnd shut my motherfuckin' mouth if I don't know(Word!)\nCause that's what Pops told me\nBut I wish he could have said it...to my dead homiez\n\n[Verse 3]\nI remember we painted our names on the wall for fun\nNow it's \"Rest in Peace\" after every one\nExcept me, but I ain't the one to front\nSeems like I'm viewin' a body after every month\nPlus, I knew him when he was yea big\nPour beer on the curb before I take a swig\nBut somethin' ain't right\nWhen it's a tragedy, that's the only time that the family's tight\nLovin' each other in a caring mood\nThere's lots of people and lots of food\nThey say \"Be Strong\" and you're tryin'\nBut how strong can you be when you see your Pops cryin'?\nSo that's why Ice Cube's dressed up\nBecause the city is so fuckin' messed up\nAnd everybody is so phony\nTake a little time...to think about your dead homiez", "image": "https://images.genius.com/6c223fafae72a06b4952ce4b3f7e6b7a.992x991x1.jpg", "album": "Kill at Will EP", "year": "1990-12-18"}]}