{"songs": [{"lyrics": "[Intro: Foxy Brown & Jay-Z]\nUhh, uhh, uh-huh\nUhh, paper chase\nBonnie and Clyde\nY'all motherfuckers know how it's going down\nGotta get that paper dog\nThat's right, uhh\nUh-huh uh, yeah, right, yeah\nPaper chase y'all, paper chase WHAT? Uh\n\n[Verse 1: Foxy Brown & Jay-Z]\nGreyhound bitch, stay down bitch\n‘Bout to set up shop with Jay, round this bitch\nHalf a brick of yay, 'bout to lay down this bitch\n('Til November?) Nah, I'm here to like May down this bitch\nAnd I'm thinking, I don't wanna have to spray down this bitch\nCall my whole team, from around the way down this bitch\nI'm trying to stay down this bitch, play down this bitch\nHad a sound, so my nigga Jay drown the six\nRoll the windows down and, wave round this bitch\nBut there's a couple things 'fore it's OK round this bitch\nGotta talk to the natives, let 'em know I'm here\nFor all to get the paydays, first I line up all the haters\nI got jobs for ya, drop Saabs for ya\nMore arms than Green Bay's Brett Favre for ya\nMoney propositions hope that's not a prob' for ya\nIf so, Jigga be here, day after tomorrow for ya (that's right!)\n\n[Chorus: Foxy Brown & Jay-Z]\nGotta get that paper dog\nGotta touch that, love that, paper dog, uhh!\nGotta get that paper dog\nGotta have that grab that paper dog!\nGotta get that paper dog\nGotta spend that, bend that, split that, get that\nGotta get that paper dog\nWhen I needs that, G stack, tell me where the weed's at?\n\n[Verse 2: Jay-Z]\nI got my two guns, I came to scoop ones\nA down ass bitch and she down to click\nGot a nice little hooptie that I get around with\nAnd my plan is, not to leave this town 'til I'm rich\nGotta find a nigga selling all them ounces and shit\nTell them get down with the clique or get found in a ditch\nSee I drop down and strip, I turn around and spit\nNot to hit em, just to let 'em know the sound of shit\nReturn later that evening in the club with Fox\nAnd I got the snub nose for those that love to box\nI'm in search of them young niggas that hug the block\nAll day, 'til it's light gray outside\nShoot dice talking shit all day outside\nAnd even when it's hot, they outside\nLet em know how its gonna go, Bonnie and Clyde\nAnd ayo, you would want me on your side\n\n[Chorus: Foxy Brown & Jay-Z]\nGotta get that paper dog\nGotta touch that, love that, paper dog, uhh!\nGotta get that paper dog\nGotta have that grab that paper dog!\nGotta get that paper dog\nGotta spend that, bend that, split that, get that\nGotta get that paper dog\nWhen I needs that, G stack, tell me where the weed's at?\n\n[Verse 3: Jay-Z]\nYo, yeah, I got that stress and I got it the best\nI ain't got it to give, but I got it to test\nAnd if you wanna get down, all you gotta invest\nIs your time, I gotta move this in a week or less\nFor the next couple of days I brought out all I possess\nThe Rolex, necklaces with the VVS\nBetween the driver and the passenger where the TV rest\nFor my top draft picks I cop the new GS\nNow all the little soldiers wanna roll with my team\nCause I ain't sold em a dream, I just showed 'em the cream\nPicked em up in the afternoons and told 'em some things\nYou know the regular shit you do when you molding them teens\nYo, never lay your head where you holding them things\nKeep the family then your business, nothing goes in between\nNever feared no man, put four in his bean\nDrop your gun then, blow the scene, ya heard me?\n\n[Chorus: Foxy Brown & Jay-Z]\nGotta get that paper dog\nGotta touch that, love that, paper dog, uhh!\nGotta get that paper dog\nGotta have that grab that paper dog!\nGotta get that paper dog\nGotta spend that, bend that, split that, get that\nGotta get that paper dog\nWhen I needs that, G stack, tell me where the weed's at?", "title": "Paper Chase", "image": "https://images.genius.com/1f3b917b779cd80ad127e64f21d6010a.1000x1000x1.jpg", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}