{"artist": "360", "songs": [{"album": "What You See Is What You Get", "year": "2008-03-22", "title": "Don’t Worry About How It Looks", "image": "https://images.genius.com/b01a68880fdf408d16b94407da51e8b8.600x598x1.jpg", "lyrics": "[Intro: 360]\nWord life yo, huh\nI've fin' and done bin', Doin' that shit\nHomies, word, Hahaha\nYeah, yeah\n\n[Verse 1: 360]\nTalk about most media, \"I hate it\"\nThey should report the news and not create it\nEveryday obsessing with anybody that's famous\nAnd make up there own little stories and go and claim it\nAustralia needs for Damien Leith\nTo save all his money made and go and straighten his teeth\n\"I'll fight you for it\"\nAnd last week I went to lay on the beach\nAnd saw this hottie getting burnt, so I gave her some cream\n\"There you go\" I went to dinner with this elegant chick\nMade my mission to yell and tell her what arrogance is\nMade her shout me a feed and embarrass the bitch\nDropped a fart and then screamed \"Your fucking manners are shit!\"\n\"I beg your pardon!\" Yeah, you bet i farted\nBuy me a drink, I'm planning to get retarded\nAnyways I'm off, you better not get me started\nBut you better check the present I left in your parent's garden\n\n[Hook: Joelistics & (360)]\nAin't trying to get ???\nAnything that you tell me to do\nYou and me got something good\nDon't worry about how it looks\nIt ain't like we're new to this\nSlow down, let me give you a kiss\nBaby come, gonna take my time\nLay back and let your body recline\n\n[Verse 2: 360]\nYeah, Dudes with no teeth are like, free sixchty\nIf I got kidnapped they'd say, Free 60\nI brush my teeth with colgate, 360\nI only play the Xbox, 360\nYeah that's right, Bill Gates did a guest spot\nBut I'm sueing him for not putting me in the press shots\nI'll change my rap name to thingymabob\nSo it sounds weird when anybody's givin' me props\n(Hey, thingymabob's dope) yeah this kid is a fox\nI'm so good I mack girls while I'm flipping em' off\nOnly big in Australia, Like Erin Mcnaught is\nNah, I'm fucking universal banging Jennifer Hawkins\nAnd cats say that I'll never make it platinum\nSo I'll buy my shit enough times to make it happen\nThe Aussie scene will probably hate my rappin'\nCause really I'm a pommy, I just fake my accent\n\n[Hook]\n\n[Interlude: 360]\nYeah, hey Joel\nDo you reckon you could just\nLet the beat play for a little bit man\nI'm gonna whip out my Yazz flute and show\nRon Burgundy how to do it\nHey check this out, ready?\n\n[Verse 3: 360]\nYou all envy me, I'm rap's MCG\nCos that's where I like to walk my pet TV, \"good boy\"\nI gotta say this is the best CD \"? vagina pussy\"\nI'm the MVP, I'll be chillin' at the barber shop\nTrying to have a threesome with Tara Moss and\nLara Croft, \"Womb Raider\"\nI'm gonna tell you why I'm hard to stop\nYou know why?, Its cos my motherfuckin' cars a dog\nAnd he's silent looking for a parking spot\nThat's the only time you'll ever hear his barking stop \"silence\"\nI'm at the vet clinic, tryin' to book my next visit\nFor my pet midget,for havin' sex with it\nChillin with black panthers, coppin lap dances\n\"get the fuck out bitch, you don't meet my fat standards!\"\nI'm a passionate rapper I'm Matt candid\nIn every interview I do, I only rap answers\n\n[Outro: 360]\nSo 360, where did you grow up?\nHey yo Melbourne\nOk and ah how long have you been rapping for?\nYeah, yo, about 14 years\nHahaha yeeeees\nAsk your mother cos she knows it\nShe's seen it, she's done it\nShe's lived it and she's loved it\nThat's how it goes bitch, 360\nRecognise, Identify or step aside\nMotherfucker, ok"}]}