{"songs": [{"year": null, "image": "https://images.genius.com/da38feb1c7ca636243c52d23e325bbd4.500x500x1.jpg", "title": "For The Homies", "album": "Thugs Revenge", "lyrics": "[Intro: Bizzy]\nDon't let the light skin fool you nigga\nThis your real homeboy\nLil' Bizzy the Kid, is definitely in the motherfuckin community\nAs I sit down and I write this letter to my dear brother\nDear brother, heavenly grace and peace be unto you\nIn your time of persecution, dear brother\nI pray this letter greets you in good spirits and peace and health\nI love you\nFor the mothfuckin hood and the ghetto\nAin't nothin you need but a homie\n\n[Bizzy Bone]\nFor the homie, doin it tight, give you the shirt off of my back\nFor the homie I sing songs in fact\nFor the family, I'll never forget you whatever you need\nFor the family, I'm walkin the streets, I know you see\nFor my momma, I'm doin it again - I'm doin the best that I can\nGotta love my father, he fathered a man, man, man\nFor my sister, I help you on out with the nephews\nI do the best that I can, for my sister I tell 'em to spread the love\nFor my brother, I greet you with a spiritual kiss\nFor my brother, spiritual kisses sellin peace\nOne, collaborations only to spread that joy\nOne, for my father, the best homeboy\n\n[Chorus: Mr. Silent]\nYou can find me with my homies, I'll never run\nI'll never hide from my homies, I'm down to ride\nI'm down to die with all my homies, kickin with the West Coast soldiers\nReppin for my homies, deep in the streets we stayin up\n\n[Mr. Capone-E]\nMy homies, they're my young thug outlaws\nDown for whatever when it's on Jermaine makes his call\nWe miss you O.G., from the families locked away\nUpstate behind bars up in Pelican Bay\nAll the rappers, who lost their life in the struggle\nFrom Biggie Smalls, 2Pac, Eazy-E we'll miss your hustle\nThe trouble, when the lights went out\nIt's still a war zone and you still the homie, no doubt\nLife of a vigilante, with the street authority\nMy homies are forever 'til, eternity\nEnemies get bucked, trust no, man\nI'm in the land where they bangin every kids on they hand\nPropaganda, in this white man's world\nA devil's reject, with a meth-amphetamine burn\nThe world turns, never leave you lonely\nI'm your confidant, your one and only homie\n\n[Chorus]\n\n[K.O.]\nMy definition of a homie is a brother with pride\nTherefore that I'll always have your back not givin a care who's down to ride\nTo never leave you astray, to put his life in front of yours\nI'm havin a vision in my mind, my dogs are seepin up through my pours\nCause I'm a true blue thug, and I'm keepin it real\nMy dogs ain't never given away, that's what you call the real deal\nAs I poured a little liqour for, those who passed\nMy true, soldiers in the green the game of life and they crashed\n\n[Mr. Silent]\nMy definition of a homie\nMy dogs ain't never gonna leave me lonely\nStraight riders, we ain't no phonies\nMy criminal styles and Mr. Capone-E's\nStraight ridin, through the city\nGivin it up for Bizzy Bone and Frank Nitty\nMr. Silent puts it down showin no pity\nRollin it up for all my homies that are with me, with me\n\n[Chorus]"}], "artist": "Bizzy Bone"}