{"songs": [{"title": "Walk", "lyrics": "[Verse 1]\nThey was tryna' get me\nThey was tryna' get me out\nLike y'all don't know what I'm about\nY'all do it for the clout\nThe streets like, \"where you at?\"\nI told niggas I'm en-route\nI was working at the house, in the stu'\nSleepin' on the couch, tryna' figure out\nWhat my next move is\nCome move with the movement\nI see through you old transparent niggas\nWho you guys think you foolin'?\nWe bhillen' bhillen'\nPinky ring drippin' drippin'\nMy necklace is droolin'\nTre-pound got a buck\nPark a nigga like amusement\nNo clowns over here\nNo haha, no amusement\nNah, nah, we ain't losin'\nY'all got us confused with them other niggas over there\nWho 'dem? Who 'dem?\nAnd I'm hoppin' out the Benz\nGivenchy by the lens\nI ain't come here for friends\nI came here to make money, save money, then I spend\nM.A, where you been\nDon't you do that shit again\n\n[Interlude]\nYou think I give a fuck what a hater gotta say about me?\nThat's exactly what they hate about me\nThey around me when the sun rise, when the sun shining\nBut where the fuck y'all was at when it was cloudy?\nFake niggas please get the hell from around me\nI don't even know why these niggas is around me\nThat was the same niggas that doubt me\n\n[Verse 2]\nLouis pack got me buggin' out\nLouis scarf, gotta thug it out\nNew chain, had to flood it out\nMy money never runnin' out\nCut the check bih\nTell them hatin' niggas cut it out\nWhere the lighter at? The blunt is out\nPour me up when my cup is out\nDidn't mean to fuck her\nShe had a cramp, so I rubbed it out\nKick bitches out, wave bye with my rubber out\nYour opinion doesn't matter\nThat's one thing I don't give a fuck about\nDick riding, ass kissing\nThat's somethin' I know nothing 'bout\nEverybody in the same lane\nSo I went and took the other route\nBaggin' weed at my mother house\nIf she knew she would cuss me out\nSame black tee, same sweatpants\nOh well, had to bum it out\nYoung M.A this, Young M.A that\nDamn, nigga, what the fuss about?\n\"Nah, niggas just tryna figure out\nWhen the next joint coming out\"\nOh, nowadays niggas want favors\nBut if you talk about money\nWell homie then we can work somethin' out\nLouis scarf for my right side\nYeah nigga that's the right side\nGive my blood niggas high-fives, hi five\nHer eyes chink and her pussy pink like high eyes\nBad chick, but that don't mean I won't bring her ass right to Popeyes\nTwo piece and a thigh for you\nI ain't paying if the price high\nGet money, act broke, that's the motto I apply by\nNever boujee, we on vacay, pourin' Henny in our Mai Tai's\nNever change, I'm still the same\nDrinkin' Minute Maid with the hot fries\nIn the club, in V.I.P with y'all bitches and my guys\nWe get money, we don't want beef\nTake that beef shit to Five Guys\nStart shit, got five guys with five 9's, hit you five times\nExtendos on the chopper, niggas thought we was carryin' a tripod\nNiggas like \"where the hoes at?\"\nMy bed is where the thots hide\nThem lame niggas there\nIt's more poppin' here on my side\nFake niggas move left, real niggas move clockwise\nBlew a check at the jeweler\n'Cause I won't wear it nigga if it's not\nFuckin' mine", "album": null, "year": "2017-11-02", "image": "https://images.genius.com/b5057cf3c88f6109f48627fad731b6b6.1000x1000x1.jpg"}], "artist": "Young M.A"}