{"songs": [{"image": "https://images.genius.com/502e64ad8b70f4992bafe55475ce7dd4.892x892x1.jpg", "year": null, "lyrics": "Nunca le hemos dedicado un canción a los morros\n\"So\" esta canción se las vamos a dedicar a ellos:\nSon historias como nos las sabemos\nAsí es que nunca digan que no hacemos nada para los niños\nEscuchen ¿eh? Y ahí les va (¡vamos!)\n\nDesde niño yo he tenido cuentos pa' contar:\nCosas medias atrevidas pero no vulgar\nAlgunas son mentiritas pero \"de a verdad\"\nDéjame te cuento, dame otra oportunidad\n\nUna vez en el bosque me topé con un chavo:\nEra de palo con tirantes chapeados\nIba chiflando cargaba su mochila\nCurioso, yo, le pregunté pa' dónde iba. (¡hey!)\n\nIba de gira el cabrón:\nSe la había pintado por andar de mamón\nDijo que andaba en busca de una chinita\nPorque Caperusita le salió embarazadita\n\nMe amenazó con sus pinches amiguitos\nSon la pandilla de los Tres Cochinitos\nYa me contó que cohetearon al Lobo\nQue fue en defensa propia, que fue por un robo (¡ja!)\n\nSin darme cuenta olvidé que era jueves\nTenía una cita con mi novia Blanca Nieves\n\"Ponte las pilas\" me dijeron sus hermanos\nPorque anda caliente con uno de los enanos (¡uh!)\n\nSe me hizo noche y me puse a buscar\nEn el bosque en 'onde me iba a quedar (¡mentia!)\nCasa de citas (¡Ay, no!), \"Bueno, ya de menos\"\nEra de pan con arcos de caramelo\n\nToqué la puerta salió una viejita (¡Hola!)\nTenía visita, fumando una pipa\nMe dijo \"Joven, ¿Qué rollos? ¿No gusta?\nTengo dos morros guisándose en la estufa\" (¡Ay, no!)\n\nDesde niño yo he tenido cuentos pa' contar:\nCosas medias atrevidas pero no vulgar\nAlgunas son mentiritas pero \"de a verdad\"\nDéjame te cuento, dame otra oportunidad\n\n(¡Hey, hey, hey! ¡Asi no es!)\n\nTe la contaron mal güey: Pinocho no embarazó a Caperusita\nYa todos saben que es flojita\nA mi me contaron los enanos\nQue es una bicicleta y le gustaban mexicanos (y que y ¿en dónde?)\n\nLes pregunté que 'ónde escucharon (¿'ónde escucharon?)\nMe contesto el mas menso que ya todos se la echaron (¡ja!)\nQue no sabían de quién es\nIban a la clínica los güeyes a sacarse un \"test\"\n\nMe quedé medio espantado: (¡ay!)\nQue bueno que no saben que también me la había echado\nOjalá y no me toque\nYa la manosearon todos los compas aquí en el bloque(!yeah! ¡uhg!)\n\nY me contaron lo de la Bella Durmiente:\nQue es bien borracha y le gusta el ambiente (¡uhg!)\nSegún le hizo un hechizo la Viejita\nNi madres, anoche andaba peda a gatitas (!yeah, borracha!)\n\nLa vi en la fiesta con la Cenicienta:\nUna morra pobre que antes era una sirvienta\nAhora pasa y le habla a la raza\nAnda en un carro que parece calabaza\n\nSon jaladoras y bonitas las muchachas\nA mi se me hace que las dos son marimachas\nDicen que son amigas desde chiquitas\nY por eso se agasajan cuando se echan sus copitas\n\nEs como me contaron a mi las historias (¡sí!)\nY son exactas según a mis memorias\nNomás no estoy seguro del embarazo\nA ver cómo chingados me va con este caso (¡Ese no es mío!)\n\nDesde niño yo he tenido cuentos pa' contar:\nCosas medias atrevidas pero no vulgar\nAlgunas son mentiritas pero \"de a verdad\"\nDéjame te cuento, dame otra oportunidad\n\n(¡Ja, ja!)Así es, morros\nOjalá y les haya gustado la canción que les dedicamos\nPorque así es como nosotros nos acordamos de esas historias\nPero, si ustedes se las saben de otra manera, \"Oh, well!\"\nÉsto ya se acabó, nosotros ya nos vamos (¡Wouf!)\n\n(Peace out!)", "title": "Cuentos Pa’ Morros", "album": null}], "artist": "Akwid"}