{"artist": "Boogie", "songs": [{"album": "Thirst 48, Pt. 2", "title": "Won’t Be The Same", "year": "2016-01-01", "lyrics": "[Intro: Boogie]\nTurn me up a little bit, Dart\nHaha, yes\nThree mixtapes in, still talking about the same person\nThirst 48\nAha\n\n[Verse 1: Boogie]\nTempted to text you and call you stupid, uh\nTempted to text you and tell you how much you blew it, uh\nShit, we was in it to win it, the way I view it\nBefore the strings got loose and I promised we was a shoo-in\nI know it ain't organic when they always say they got me\nFuck what texts say, no X-ray could see what we embodied\nWe was everything\nBefore I met you, I would sleep and I ain't never dream\nAnd then that door closed like something I ain't ever seen\nWhat if that doorbell done turned into a wedding ring?\nWould you be with it? You never seen no melody\nI fell in love with the beat of your heart\nThen you went acapella and produced your leave in the dark\nSee, you was never normal, I perceived you as art\nBut now your music never reaching my chart\nMan, I'm just saying, you know\n\n[Hook: Ayo]\nI don't know what they told you now, they lied\nBut, there's nothing more for me to say, if I tried\nBut, I won't be there to hold you now, no more\nBut, you know it wouldn't be the same (no)\nWouldn't be the same no, no, no (same)\n\n[Verse 2: Boogie]\nWhoa-whoa, I went from running through your mind\nTo feelin' I need a wheelchair\nMight just write a eulogy, say my feelings got killed here\nLook up in my soul to see if feelings is still there\nMight hit you to argue just to see if you still care\nI play games, baby, 'cause I need clarity\nSee, I ain't believe you them times you say that you cherished me\nYou say that'd you'd carry me 'til that moment I got bigger\nWhy your mama always hating?\nShe just mad she got no nigga\nI might give her what she asked for\nYou put yourself first; that really never last, though\nI had to swerve on a girl I'm willing to crash for\nIt's just a sad song, but I ain't really sad, though\nI know it won't be the same, no, it won't\nWhoa-whoa, whoa-whoa, whoa-whoa\n\n[Hook: Ayo]\nI don't know what they told you now, they lied\nBut, there's nothing more for me to say, if I tried\nBut, I won't be there to hold you now, no more\nBut, you know it wouldn't be the same (no)\nWouldn't be the same no, no, no (same)", "image": "https://images.genius.com/6fe13c234f5fee471ca2722a37239a8b.500x500x1.jpg"}]}