{"songs": [{"year": null, "album": "Firestarter Vol. 1: Quest For Fire", "image": "https://images.genius.com/d1c3e48f7789c764dbfe19acbf9cb0b9.300x300x1.jpg", "title": "Man By Choice", "lyrics": "INTRO [Kardinal Offishall]\nHe's got the green timbs with the fat laces, hahaha\nYo, yeah, uh huh\nChecking in, nigga\nYou say why I call you nigga, think about it\nYou went from what...\nFrom an African, straight to a nigga, you know what I'm saying\nWe traveling over to what, to what\nNegro, and then we went to what\nThen we went to black\nThen it was on some Afro-American stuff\nAfro-Canadian what have you, but guess what\nIt don't matter what you call yourself\nIt's what they call you behind your back\nNigga, straight up\nStraight up and down, you know what I'm sayin\nY'all know\n\n[Kardinal Offishall]\nA yo\nWalkin through the uptown a black man (nigga)\nWalkin down Yonge St. a black man (nigga)\nWalkin through Flatbush a black man (nigga)\nWhen the revolution comes I got a finger on the trigga\nI was born a regular man of the Earth\nWith a curse to walk like a soldier since birth\nMy exterior is shaded in by my melanin\nStereotype of my type is a felon\nMy people cause static cause automatically now a days we fire automatics\nGrammatically adequate my people come equipped\nWith enough lyrics to move battleships\nBlood brother ever since the slave ships\nIt doesn't matter who I am when I walk by\nThey still see me as a nigga whine I walk by\nThat's O.K. - this nigga will play the role and come again and take back the Earth another day\n\nCHORUS\nI'm a nigga baby, we some niggas baby\nSome do walk, some do talk, some may buss their Glocks\nBut I'm a nigga for lie and a man by choice\n\n[Kardinal Offishall]\nWalkin through London a balck man (nigga)\nWalkin through Rexdale a black man (nigga)\nStrollin through Dectaur as a black man (nigga)\nYo, I was born to emcee representin with the Figurez\nI can taste the history livin in my bones\nFor the thickness I got a love jones\nI like my girls with the nappy dug out hips and chest buss out\nLips real full, gettin ready to cuss out\nParasuco gettin insulated by the structure\nBody so powered that the labels be stickin out in 3-D\nWe salute the ladies - raped over time pushin out light babies\nThe slave masters with the devil in their eye\nSaw nothin but a nigga when you walked by\nBut you the mother of creation\nLet's bring back the family aspect and try to build a strong nation\n\nCHORUS\n\n[Kardinal Offishall]\nWalkin through Chinatown a black man (nigga)\nWalkin through the projects a balck man (nigga)\nStrollin through Africa a black man (nigga)\nSome try to disrespect to make themsleves look bigger\nI am a nigga since birth, a man by choice\nSome men act niggerish pushin Rolls Royces\nThinkin them toys make a man\nWhile you johnin them hookers\nWe tryin to make a stand\nWhat you believe in?\nChris Rock? Or crack rock?\nSoft rock? Or hard rock?\nWhen I talk the whole world rocks\nLIke the vote, we can change thinkin\nBefore you set a float your whole concepts sinkin\nYou know I like to see you back that ass up\nBut before you pass up, you should get your damn class up!\nTake the hood out your mouth and parle!\nSo we can take back the world right now, today! *Vocal scratching*\n\nCHORUS X3"}], "artist": "Kardinal Offishall"}