{"songs": [{"year": null, "title": "Real Circus", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir the Saucee Nomad\nAlbum: Boxcar Sessions\nSong: Real Circus\n\nI bought my ticket ten years ago when in demand\nWas the candy caramel. I submerged like a\nMurk on the mental. But it was hard to tell if\nNails pitched on my tent on time, with the ringmaster\n- God - had a whip. Hit me on my hip, now I'm on\nA hop, but it don't stop. Now I advise the wise\nWhy, why did you let me out the flock? Now I'm\nFlowin pro, flippin flu, germs wit a new perm\nI'm hittin different regions. It's winter season\nTryin to forget the treason of my twisted sister, so\nI turn my face when Rockin Rollin in myst-ic\nSo side show freaks can't peep the mask task-force\nBehind the jacket, so I'm packin not because I'm\nHard. I'm paranoid, I'm far away from\nGod. He can't see me. I ignorantly thought he caught me\nDreamin, in comes the demon tryin to shoot me\nThat semen. One way I'm off the brink, the detour\nWas unblocked. I'm strictly on instinct, I'm walkin\nOver barriers. I'm spooked cause I keep hearin\nThe word spades. They tryin to pull my card\nThey're goin to get it, I won't forget it like an\nElephant, tiger, lions rely on the funky monkey\nDyin in the real circus\n\nI'm finally out of my cage, it's been ten swings since\nI quenched the silence. Sure to erupt eyes-lids\nTill they're queasy from the degree of the tilt of\nA trapeze performer that's proven succession in\nThe progression of a juggler, vain slitter, my spear\nShifted. Saafir's gifted like black Santa. I was\nBorn a flipper with sticks and balance beams\nI learn to differ swift stimulation of a soul snatcher\nOh! Here they come Jay-Z, 15 deep\nIn a clown car wit make-up, but I got make-up\nFor ya - wake up. I lay material like dogs upside\nDown cakes. I give pounds to fakes so my cleets\nStake claims, skills have belittled spittle. What's\nComing from that grill - waffles, ya shit is awful\nFurther let's implore for more speech reach back\nFor the cage where the elves are plottin schemes\nYou ask me to explain what I mean, I will in\nThe afterlife kill death, I verify the untimid\nBreath, I'm trustworthy to the busting of dirty\nThirty-thousand year old authentic, I'll win it\nJust as the thought has brought into focus comes\nThe real traveling circus\n\nI'm jumpin through hoops, can you dance like a\nPanther? I can. I pick my prey in shades of\nGrey, but I'm not color blind on the rhyme. The\nCircus is in my scalp. I'm higher than the Alps\nI'll make you break camp. I tame crews like shrews\nI bust nuts without screws. Can you do that - hardly\nYa too stiff malarky art kits, give up the drawings\nYa never saw swings cling when the grip whips\nThat makes you feel like the Real Circus", "album": "Boxcar Sessions"}], "artist": "Saafir"}