{"songs": [{"year": "1988-03-01", "image": "https://images.genius.com/1ef8feabc371b7d36cc623b253f8f5dc.598x598x1.jpg", "title": "Make the Music With Your Mouth, Biz", "album": "Goin’ Off", "lyrics": "[Biz Markie]\nAh one two, ah one two\nAh one two, ah one two\nI'd like to.. introduce myself..\nMy name is.. ah Biz Markie..\n\n[Verse One]\nWell I'm the human orchestra called Biz Markie\nMakin music orderly is my specialty\nWhen I go {*BOOM*} ah one two, girls get excited\nWhen they hear my lyrics they wanna recite 'em\nI know y'all in the mood, just go with the flow\nAnd I can play rappin records and all disco\nLike \"Beat It,\" \"Billie Jean,\" by Michael Jackson\nOr the Treacherous 3 record, they call \"Action\"\nWhen you hear me do it, you will be shocked and amazed\nIt's the brand new thing they call the human beatbox craze\n\n[Hook]\nMake the music with your mouth, biz!\n{*Biz Markie beatboxes*}\nMake the music with your mouth, biz!\n{*Biz Markie beatboxes*}\nMake the music with your mouth, biz!\n{*Biz Markie beatboxes*}\n\n[Verse Two]\nWell I don't just do the beatbox, I rock on the mic\nAnd all the rhymes that I say, all the people like\nI get the crowd jumpin, get the girl's hearts pumpin\nAll the party people say, \"Isn't he somethin?\"\nRock from New York City all the way down South\nSayin rhymes and makin music, with my mouth\nI'mma tell you party people how I began\nIt started when I'm livin in Long Is-land\nHey when I was a kid I used to play in the streets\nMakin sounds with my mouth, all sorts of beats\nGrown people, used to say - WHAT?\nGrown people, used to say - WHAT'S..\n.. wrong with that kid makin that strange noise\nIt was like, for all the fly girls and all the homeboys\nThen I tried it at a homeboy's basement par-ty\nThey thought it was a record, they ain't know it was me\nWhen they came by the DJ, and saw who it is\nThey said, \"Make the music with your mouth, Biz!\"\n\n[Hook]\n\n{*song continues as just a beat for a while*}\n\n[Verse Three]\nIt may look and sound easy doin the human beatbox\nBut it's real difficult, even knocked me out my socks\nIt's a movement combination with your lip tongue and throat\nUse your teeth and your nose for a mysterious high note\nI like doin it as a hobby or a job\nPeople treat me like a star and surround me in the mall\nIt's not all the props, spittin, breathin hard and doin\nYou need practice, be ambitious in the schoolin\nLet me tell you party people, you gotta admit\nAnything than you want you gotta work hard for it\nThat's why I like doin sounds, that's hard to achieve\nMakin two or three sounds at one time you can't believe\nWhen I walk down the street, people crowd around me\nAnd say, \"HOW YOU MAKE ALL THEM SOUNDS at one time, Biz Markie?\"\nI tell 'em it takes a lot of practice, and lip control\nI've been doin it since, fifteen years old\nAnd everywhere I do it, the people say I'm good\nI even get big respect in my own neighborhood\nI'm tellin you a fact, it's just like it is\nEven moms, pops, and cops say, \"Whattup, Biz?\"\nEverywhere I go, I always rocked the boat\nGonna end this rhyme, with this one note\nNot gonna act conceited and say I'm the best\nBut I'm guaranteed to pass any kind of test\nI say def rhymes, with funky fresh lyrics\nWhen I do the beat the party people go into HYSTERICS!\n\n[Hook]\n\n[Verse Four]\nYou heard the proceedin, now here's the sequel\nAll human beatboxes is not created equal\nThat's why I'm here, to say today\nThat I'm doin my beat in a special way\nMakin musical tunes, orally, I have perspective\nI'm very well known, and greatly respected\nI like to thank people, without no doubt\nPeace hi party people it's time to break ou--\n\n[Outro - singing while Biz beatboxes]\nMake the music.. make the music..\nMAKE THE MUSIC.. with your mouth!\nMake the music.. make the music..\nMAKE THE MUSIC.. with your mouth!\nMake the music.. make the music..\nMAKE THE MUSIC.. with your mouth!\nMake the music.. make the music..\nMAKE THE MUSIC.. with your mouth!\n\nMAKE THE MUSIC.. with your mouth!\n\n{*Biz continues beatboxing and scatting to the end*}"}], "artist": "Biz Markie"}