{"songs": [{"year": null, "image": "https://images.genius.com/af6ab7cce8af2e6ecd2342d0fa842b7d.189x189x1.jpg", "title": "Hell’s Angel (feat. Bj The Chicago Kid)", "album": null, "lyrics": "Summer breeze in the Keys\n\nOff the coast of Belize\n\nIs where I'd rather be\n\nThen walkin' in the rain, two left feet\n\nTryin' catch the beat\n\nTryin' to dance with the stars, in the presidential suite\n\nSideline judges want me impeached\n\nLike the world against me, I wanna drive right like I'm born a lefty\n\nThe score in the war, rise and uproar\n\nPlace like hell, but blessed with?\n\nMan, I need my amore\n\nWith a taste I never had before\n\nTo sooth my desires she soars\n\nWith the wings, removes the halo\n\nWe both hate the devil, but she's hell's angel\n\nThey say you gotta go through hell just to get to heaven\n\nWell, I've been goin' through hell since before eleven\n\nBaby girl, you were meant for me and I was meant for you\n\nBut we'll see, just don't let me down (down, down)\n\nTan brown skin, nigga gotta cash in\n\nCondone that good sin\n\nHair curly like Sue\n\nNatural hair-do and I'm lovin' the view\n\nFrom the side, from the front, or the back\n\nGod was smilin' when he made that\n\nBurnt his hand when he made that\n\nPrecision intact\n\nAttitude ready for combat\n\nLumbar pad, as she grazed my back\n\nWhen a nigga was backsliding off the track\n\nThroughout the thespian, I was through with the acts\n\nAnd the games, Sun break clouds when I speak her name\n\nComes down with her wings, no halo\n\nBoth hate the devil, but she's hell's angel\n\nYeah, I'm flawed and imperfect\n\nBut my soul can never be purchased\n\nConditioned to worldly ways\n\nMaterial slave with wrongful praise\n\nTaught to live like every day's my birthday\n\nEye for an eye,? four-ways\n\nHer actions slap me out that phase\n\nThe way she gives so selfish, kind of high\n\nUnconditional love like a?\n\nWarms like my heart like cold it get thawed\n\nNot many folks makin'?\n\nAs a person she take hold and I let her\n\nGod puts folks in your life for a reason\n\nSome for a day and some for a season\n\nComes down with her wings, no halo\n\nWe both hate the devil, but she's hell's angel"}], "artist": "BJ the Chicago Kid"}