{"songs": [{"album": "More Politics", "image": "https://images.genius.com/2b173e3d3bd02f85d5edd743f3588568.600x600x1.jpg", "year": "2016-11-10", "title": "Top Shotta", "lyrics": "[Intro: Joey Bada$$]\nTop shotta, boy\nYa feel me?\nTop shotta, boy\n\n[Verse 1: Termanology]\nSippin' this liquor off the 8th floor balcony\nThinkin' how I made the whole world bounce for me\nI had to bubble on the low and blow silently\nNo longer wanna be the one to live violently\nTwo baby mamas, two baby's, that's four mouth's to feed\nA hundred friends but none of em looking out for me\nGot tax issues, got debts, and got accountant fees\nBut I just wanna heal my pain with this cloud of tree\nIs it all in my mind, or am I paranoid\nIs this karma in the air, one I can't avoid\nCan I, lord?\nAsk you to gimme the strength to not lust for anything I can't afford\nI don't need no awards or nothing immature\nI was more thinking less nightmare\nAnd mental wars\nThinking how my Aunt Tammy died last month\nGot me smoking every el like it's my last blunt\nI keep it humble don't chill with people that's gassed up\nSome of my friends rich, some of them on they last buck\nHow could I stop showing you love cuz you had bad luck\nAnybody could vouch for me—any hood I get mad love\n\n[Verse 2: Joey Bada$$]\nThe fusillade get sprayed, never delayed\nI'm just coming for a blaze, every time I blaze\nTake a minute just to look back in the days\nAs I reminisce the maze\nBut I'm still a caged rat, that's a staged fact\nAnd you should page 8 that\nTrying to get the papers\nCaught up, up on the vapors\nHiatus to my haters\nThe pupil's dilators\nSee 'em how they traitors\nAnd then they rate us greatest and then they slave us\nAnd enslave us in and engrave in our mind\nThat we can't be the greatest\n\"We wasted too much time\"\nTaking time for granted\nThe food of life I planted\nI pomegranate—last man repping for the planet\nI guess they granted\nAll my African Bambaataa patois\nPot of gold, I make that Harry Potter \"poof\"\nYou rappers not a sun;\nYou not hotter\nPick up like papa to the realest top shotta\n\n[Outro: Joey Bada$$]\nTop shotta, boy\n\n[Produced by Statik Selektah]"}], "artist": "Termanology"}