{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/692606fdd3b8633e17a5f02a90ec07ac.500x500x1.jpg", "title": "Ric Flair", "year": "2011-05-17", "album": "PL3DGE", "lyrics": "[Intro: Ric Flair speaking]\n\"I'm going on tour, and I'm gonna show anybody out there that thinks for one second that maybe I'm second guessing myself, that I am the greatest of all time forever and ever. One surprise, one surprise ... shhhh! Wooo! I'm back.\"\n\n[Verse 1]\nTo make it out the ice cold streets of the city\nYou better have a Christopher word game, witty\nYou better have a dance game similar to Diddy\nOr play b-ball above the rim like Smitty\nJosh, Chris Bosh, Pau Gasol\nOr any other nigga that ball and tall\nI used to sell it white as Paul Wall\nGave my young boi three of them in the mall\nAnd he gon' bring me $75K back tomorrow\nYou know what Bigga 'bout, you know what Bigga do\nIce water in my veins, heart pumpin' igloo\nI'm familiar wit the money so ... who the fuck is you?\nWhat the fuck you do? Where the fuck you from? Who you knowing?\nSomebody get this nigga, I don't know him\nAnd I'm 'bout to jet off on his ass like a Boeing\nGoing, going, going, gone ... song\n\n[Interlude 1: Ric Flair speaking]\n\"You don't like the prestige that I have in life. You don't like the notoriety. You detest the fact that I got more cars than most of you have friends! I got a big house on the big side of town ... I got life pretty much the way I want it!\"\n\n[Verse 2]\nTo make it out the ice cold streets of the city\nYour mindstate gotta be as wicked as Fiddy\nCan't love life suckling on mama's titty\nCause life is a bitch and a bitch ain't with it\nYou gotta have faith livin' life on Biggie\nI'm ready to die for the money, who is with me?\nLife after death, hey this must be hell\nI asked for six figures, God gave back seven\nI'm on my way to heaven in a Porsche 911\nBuried in my car, I'm surrounded by a harem\nSurrounded by my brethren, my funeral is legend\nBuried like a pharaoh with my jewelery in the desert\nThe government will hate me like Jesus, but fuck 'em\nI did it for the grind, I did it for the hustle\nI did it for the people on the bottom in the struggle\nI did it for my comrades, did it cause I love 'em\n\n[Interlude 2: Ric Flair speaking]\n\"Custom made brother ... Wooo! And I mean custom made! From the alligators to the Oleg Cassini right here. Ric Flair! There's only one. And I don't care if it's Tokyo, Japan; Greensboro; Richmond; Charlotte, North Carolina; Asheville; Atlanta, Georgia; Charlotte; L.A. ... I'm the man that's makin' it possible!\"\n\n[Verse 3]\nTo make it out the ice cold streets of the city\nYou gotta politic your situations like Clinton\nIf you chase power you ain't gotta chase women\nSo take some advice, take cash over ass\nWhen you get money you ain't gotta take shit\nSo, long as you broke she ain't gotta take dick\nCapiche?\nNow you know what motivate your beetch\nCapiche?\nPay the mortgage or the pussy up for lease\nCapiche?\nChurch ladies goin' gaga for the Gucci (Yah!)\nGot two Nickis ménagin' for some Louie (Yah!)\nWork with the keys, get acquainted with Alicia\nAnd every other girl named Rihanna wanna meet ya\nThey in it for the money, not the swag or the features\nPretty parasites might suck you like leeches\nJust some information for a student from a teacher\nReal life shit, I'm Mike Bigga, nice to meet ya ... gone\n\n[Outro: Ric Flair speaking]\n\"At Delta, the girls call me cool. At Eastern, the girls call me Slick Ric. And all the other women around the world just say ... awww, there goes the man ... Woo!\""}]}