{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/6899b851929e0ce00a3ce59fe1cb1f6e.500x500x1.jpg", "title": "Blaze Wit Ya’ll", "year": null, "album": "The Giancana Story", "lyrics": "[Kool G Rap]\n(Yo!! G Rap nigga) See y'all thought it was a game right?\nLike y'all ain't know this was gon' happen? (Jinx Da Juvy)\nWe {*censored*} for life, we known for holdin it down\nGun brawls, hand to hand combat, whatever (word)\nWe ain't havin none of that, you heard? (word)\n\n[Hook: G Rap + Juvy]\n[Kool] If you about dough, we can get paid wit y'all\n[Jinx] Wanna ball out, we can get laid wit y'all\n[Kool] You got beef?  We can draw heat and blaze wit y'all\n[Jinx] Get locked up, sharpen up the blades wit y'all\n[Kool] You wanna smokeout, blow the purple haze wit y'all\n[Jinx] You wanna show out, spend money for days wit y'all\n[Kool] You wanna do dirt, keep it in the shade wit y'all\n[Jinx] You wanna act up, pull out guns and spray it at y'all!\n\n[Kool G Rap]\nThis one goes out to my Queens thugs, that steam slugs\nMy real killers out on the corner that's seen blood\nMy wild niggas schemin with snubs, fiendin for grub\nEatin off the streets, triple-beamin the drugs\nThe ones that put a red beam in your mug\nThe ones that bug and be in the clubs\nAnd hide whips, gleamin with dubs\nThis one goes out to my peoples\nThat hit the hot blocks to cop the diesel\nIn back of the spots but chop on the lethal\nThen pop goes the weasel\nIf niggas want it, then pop goes the eagles\nWe can draw guns and rock like The Beatles\nDrop pots of evil, ghetto D with shots from a needle\nLay you down with shots that are cerebral\nBefore rap, my click was hot as Segal, now we clock legal\nHop like Kenieval, pass the cops in our Regals\nAbove blowin like diplomats, me and my click of cats\nDuck when we spit the gat or get your shit twisted back\n\n[Hook]\n\n[Jinx Da Juvy]\nThat young fella straight from the slums and that's that\nGot kicked out of school cause I used to carry guns in my knapsack\nBeen a serious dude, never the one to laugh at\nSo play crazy and this 380'll twist your cap back\nBefore rap, I played the slums where the cash at\nDuckin the boys in blue, with jumps in asscrack\nNow I switched over, but still tote the big toaster\nFor niggas schemin so I'm fiendin to bend your wig over\nYou might catch the kid herbed out, bent over\nWithout a license, gettin brain in a tint Rover\nBut not for nuttin, a frontin dude get popped for frontin\nY'all the type to snitch when a cop's comin\nBut that don't stop nuttin cause trust me the cop's duckin\nA badge don't mean shit, when the Glocks is gunnin\nAnd I don't think the pig's tryin to get, popped in the stomach\nOr be worse, layin with they wig hotter than the oven\n\n[Hook]\n\n[Kool G Rap]\nG Rap as real as it gets, peel with the fifth\nBust down a mill' with the click, ill with the chicks\nWheelin the 6 to cribs on hills in the sticks\nMetal we pack is heavy you can feel when it spit\nUsed ta, reel in the chips, slangin krills on the strip\nNow we, spillin the Crist', niggas still with the hits\nWon't stop until I cop a half-a-mill' for the wrist\nRule with a iron fist but still in the midst\nG Rap and his squad of guerillas, carve your grill up\nHarsh killer hold the hammer like 20 bar villains\nSpit flames like Godzilla, menage-a-trois in large villas\nPack the trey-pound God pealer\nIt's a hard thriller mob chiller\nDecide your fate like a Tarot card dealer\nY'all niggas is yard squealers; play around and be a scar feeler\nA shot down man on the tar feeler chick witchu the gem star spiller\n\n[Hook]\n\n[Kool G Rap]\nWhat? (G Rap nigga) Black {*censored*} fam baby, uhh\n(Jinx Da Juvy) The new milleny niggas, knahmean?  2000 shit\nHere to rule shit\nAll y'all weak niggas fall back\nBrrrap! Brrrap! Get the fuck out of here"}]}