{"songs": [{"year": "2015-12-01", "title": "Deserve", "image": "https://images.genius.com/24e1bfe9bcc0239864c20610fe6cb49b.1000x1000x1.jpg", "lyrics": "[Hook]\nMan I feel like I deserve this shit\nI bought a Bentley because I deserve a new whip\nShe cheated on me so yes I deserve a new bitch\nThese niggas wasn't with me, they didn't help me grind for this shit\nI buy some chains for the bro's, I don't got shit for these ho's\nIs you a friend or a foe? Is you gonna cut a nigga throat?\nAin't no more going back broke, ain't no more sharing no clothes\nAin't no more selling dope, 12 can't arrest me no more\n\n[Verse 1]\nShootouts on shootouts on shootouts on shootouts\nYoung nigga done been on them shootouts\nWhere yo ass was at dog?\nWhen we was in Wynhollows, nigga, with them tools out\nCompton Red's in the cut tryna hit the dope, nigga where the cut in\nTied his partna up in the cut\nMe and Lil Harold had took a laptop\nThat nigga had bussed so the nigga got popped\nMe and Johny tried to rob everything\nMookie tried to tell us, do the right thing\nLarry died man I cried twice\nChevy went down the road nigga twice\nThey tried to give my nigga Teetay life\nTip and Metro nigga ready to fight\nI keep Lotto with me, real ripe\nPussy niggas, nigga we don't like\nFree Lil Tooto, he gon' open a fight\nRIP Tayman that's why I got that knife\nI don't get excited about the fame\nBitch I'm still with the same gang, bitch I still claim the same thing\nStill take a pussy nigga chain\n\n[Hook]\nMan I feel like I deserve this shit\nI bought a Bentley because I deserve a new whip\nShe cheated on me so yes I deserve a new bitch\nThese niggas wasn't with me, they didn't have me grind for this shit\nI buy some chains for the bro's, I don't got shit for these ho's\nIs you a friend or a foe? Is you gonna cut a nigga throat?\nAin't no more going back broke, ain't no more sharing no clothes\nAin't no more selling dope, 12 can't arrest me no more\n\n[Verse 2]\n12 can't arrest me no more, ain't no roaches on the floor\nAin't no flowers in this clique, ain't no flowers in this shit\nWe done cut the snakes off, had to cut them niggas off\nNiggas don't wanna see you with nothing, unless you giving these niggas something\nI had to get me some money, bitch and that drum hold a hunnid\nYou run up, you know that I'm gunning, 2Pac nigga, thugging\nA lot of niggas changed on me, I just bought some chains on me\nI just bought a Range Rover, this shit ain't 'bout the fame homie\nMookie told me I deserve it, momma told me I deserve it\nI know if Tayman was alive, he would tell me I deserved it\nI got the sack and start splurgin', balling like I'm James Worthy\nPussy niggas ain't worth it, before I did some other murders\n\n[Hook]\nMan I feel like I deserve this shit\nI bought a Bentley because I deserve a new whip\nShe cheated on me so yes I deserve a new bitch\nThese niggas wasn't with me, they didn't have me grind for this shit\nI buy some chains for the bro's, I don't got shit for these ho's\nIs you a friend or a foe? Is you gonna cut a nigga throat?\nAin't no more going back broke, ain't no more sharing no clothes\nAin't no more selling dope, 12 can't arrest me no more", "album": "Slaughter King"}], "artist": "21 Savage"}