{"artist": "PARTYNEXTDOOR", "songs": [{"album": "PARTYNEXTDOOR 3 (P3)", "title": "Come and See Me", "image": "https://images.genius.com/c22072bd490dc96d39aca812eba22296.1000x1000x1.jpg", "lyrics": "[Verse 1: PARTYNEXTDOOR]\nDoesn't make sense now\nShit just got real, things are gettin' intense now\nI hear you talkin' 'bout \"we\" a lot, oh, you speak French now?\nGiving me the signs so I gotta take a hint now\nI hit you up like \"Do you wanna hang right now?\"\nOn the East Side and you know I'm with the gang right now\nYou say do I own a watch, do I know what time it is right now\nIt's after 2AM and that's askin' a lot of you right now\n\n[Chorus: PARTYNEXTDOOR]\nAll she talkin' bout is, \"Come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\"\nAll she ever say is, \"Come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\"\n\n[Verse 2: PARTYNEXTDOOR]\nI been up for two whole days thinkin' what I did to keep you goin'\nThumbin' through the voicemails that you left me tellin' me where I went wrong\nI'll admit I'm sorry when I feel I'm truly sorry\nThings change, people change, feelings change too\nNever thought the circumstances woulda changed you\nYou said you never traded no\nYeah you said that\nAnd I believed you when they told me don't\nYeah thought you meant that\nBut either way you're still invited and I can't even lie to you\n\n[Chorus: PARTYNEXTDOOR + Drake]\nSwear these days all you say is, \"Come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\"\nAll she hit me with is, \"Come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\"\n\n[Verse 3: Drake]\nWhy you gotta start, girl, why you gotta start?\nI know we make time for the things that we want\nI know you got another nigga tryna play the part\nJust 'cause he got a heart don't mean he got heart\nCould be standin' in a field, and he still ain't in the field\nIf anything should change then I thought we had a deal\nLately you keep questionin' what you get out the deal\nDoin' things to make me feel the way I make you feel\nHow hard is it to let you know when I'm comin' home?\nThat way you can be prepared\nMaybe take a couple sick days and not miss pay\nI don't even know what things are looking like inside of your place\nOr how it's decorated\nThis thing is gettin' one-sided, I can't even lie to you right now\nYeah\n\n[Chorus: Drake]\nAll she talkin' bout is, \"Come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\"\nAll she hit me with is, \"Come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\"", "year": "2016-03-20"}]}