{"songs": [{"year": null, "title": "Remember That", "image": "https://s3.amazonaws.com/rapgenius/sadat-x.jpg", "lyrics": "[Intro]\nYeeah! It’s been a journey man\nThis is some feel good right here, I, I remember a lotta shit!\nYeah! Thinkin’ back yo, you done a lotta things you gotta remember though!\nYou gotta remember… I remember\nUnderstand!\n\n[Verse 1]\nI done had many cars, many bars\nRemember the first whip you grinded for? Stack!\nWent to the dollars with a fistful of dollars\nKnowing nuthin’ about the paperwork… Bring the car jerk!\nI’m going to the carwash and the club, and I'mma bounce with summin’\nRemember the first time? The first rhyme that made niggas say, “Son! You got summin’!”\nRemember planning the day out, the whole layout\nPrecision every hour, taking that shower?\nClothes already laid out!\nRemember that first time you stayed at a honey crib?\nAnd came home with the sun…\nRemember that son?\nRemember break night, Remember break white?\nRemember you sold in front of the police like it was nuff, remember that?\nIn December that year, remember when you failed to appear to the court?\n\n[Hook]\nDo you remember!?\nWhen we used to play shoot ’em up, Bang-Bang?\nShoot ‘em up, BANG-BANG!\nYou remember!?\nWhen we used to play shoot ‘em up, Bang-Bang?\nShoot ‘em up, BANG-BAANG!\n\n[Verse 2]\nDo you remember when the used to have house parties?\nAnd you’d find that girl that was the most in your world?\nAnd for them fine slow jams, y’all got it in!\nRemember your first chain?\nYou’d go out when the store closed\nI’ma kill these hoes!\nRemember boosting clothes?\nSo you was fly on Easter\nPlaying the goose\nRemember when son died? How we all cried\nAnd for his daughter we provide\nRemember Rikers Island on the inside?\nRemember the boat parties we wouldn’t let in?\nYou swore you was winning\nWent home spinning\nRemember Flex first dropped the bomb?\nSummin’ nice on your arm?\nYou didn’t wear the glove, so you made baby love\nRemember that!?\n\n[Hook]", "album": null}], "artist": "Sadat X"}