{"artist": "YG", "songs": [{"image": "https://images.genius.com/fb0f7aa9f1c828c708022058c27179f5.1000x1000x1.jpg", "year": "2016-03-30", "album": "Still Brazy", "lyrics": "[Intro: YG]\nJust when I thought it wouldn't get no sicker\nWoke up one morning and heard this weird ass mothafucka talkin' out the side of his neck\nMe and all my peoples, we always thought he was straight\nInfluential mothafucka when it came to the business\nBut now, since we know how you really feel\nThis how we feel\n\n[Chorus: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\nYeah, fuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump, yeah\n\n[Verse 1: YG]\nI like white folks, but I don't like you\nAll the niggas in the hood wanna fight you\nSurprised El Chapo ain't tried to snipe you\nSurprised the Nation of Islam ain't tried to find you\nHave a rally out in L.A., we gon' fuck it up\nHome of the Rodney King riot, we don't give a fuck\nBlack students, ejected from your rally, what?\nI'm ready to go right now, your racist ass did too much\nI'm 'bout to turn Black Panther\nDon't let Donald Trump win, that nigga cancer\nHe too rich, he ain't got the answers\nHe can't make decisions for this country, he gon' crash us\nNo, we can't be a slave for him\nHe got me appreciatin' Obama way more\nHey Donald, and everyone that follows\nYou gave us your reason to be President, but we hate yours\n\n[Chorus: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\n(I don't like your ass, nigga)\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\n(I really don't like you, nigga!)\nYeah, fuck Donald Trump\nYeah, nigga, fuck Donald Trump\n(This for my grandma!)\nYeah, yeah, fuck Donald Trump, yeah\n\n[Verse 2: Nipsey Hussle]\nNigga am I trippin'? Let me know\nI thought all that Donald Trump bullshit was a joke\nKnow what they say, when rich niggas go broke...\nLook, Reagan sold coke, Obama sold hope\nDonald Trump spent his trust fund money on the vote\nI'm from a place where you prolly can't go\nSpeakin' for some people that you prolly ain't know\nIt's pressure built up and it's prolly gon' blow\nAnd if we say go then they're prolly gon' go\nYou vote Trump then you're prolly on dope\nAnd if you like me then you prolly ain't know\nAnd if you been to jail you can prolly still vote\nWe let this nigga win, we gon' prolly feel broke\nYou build walls, we gon' prolly dig holes\nAnd if your ass do win, you gon' prolly get smoked, nigga\nFuck you!\n\n[Chorus: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\nYeah, fuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump, yeah\n\n[Interlude: YG]\nWe the youth\nWe the people of this country\nWe got a voice too\nWe will be seen\nAnd we will be heard\n\n[Verse 3: YG & Nipsey Hussle]\nHold up, I fuck with Mexicans, got a plug with Mexicans\nWhen the low low need a switch, who I call? A Mexican\nThis Comedy Central ass nigga couldn't be the President\nHold up, Nip, tell the world how you fuck with Mexicans\nIt wouldn't be the USA without Mexicans\nAnd if it's time to team up, shit, let's begin\nBlack love, brown pride in the sets again\nWhite people feel the same as my next of kin\nIf we let this nigga win, God bless the kids\nGod bless the kids, this nigga wicked and wigged\nWhen me and Nip link, that's Bloods and Crips\nWhen your L.A. rally? We gon' crash your shit\n\n[Chorus: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\n(I don't like your ass, nigga)\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\n(I really don't like you, nigga!)\nYeah, fuck Donald Trump\nYeah, nigga, fuck Donald Trump\n(This for my grandma!)\nYeah, yeah, fuck Donald Trump, yeah", "title": "FDT (Fuck Donald Trump)"}]}