{"songs": [{"image": "https://images.genius.com/8b85f0ed9200b8df277ffa6a0112e36e.1000x1000x1.png", "title": "Ciroc & Simply Lemonade", "album": "M.O.", "year": "2013-09-30", "lyrics": "[Intro]\nCiroc and simply lemonade\n\n[Verse 1: Nelly]\nI said that this Saturday night, we about to turn up\nWe about to get wasted on everything I love\nCall all of my partners, said I’m getting the word we weedin\nI told them meet at the same spot around the same time as last weekend\nNow I’m off to the barber shop, I’m fresh and had lime and\nThen to the carwash, I’m shinin that my line yea\nFresh from the mall we all, J’s nothing but fine yea\nWell we all big faced, I can see it’s bout that time\n\n[Hook]\nWhat can I get you babe?\nCiroc and simply lemonade\nWhat about the rest of yall?\nCiroc and simply lemonade!\nWhat for your lady friend?\nCiroc and simply lemonade\nI think I want some more\nCiroc and simply lemonade\nHow bout a little more?\nCiroc and simply lemonade\nI really want some more\nCiroc and simply lemonade\n\n[Verse 2: Nelly]\nNow we the only ones in this club, DJ what’s happenin'\nWhat the fuck you waitin on? So go and play something ratchet\nRiddle tell me they got it, Juicy J wussup\nPut Benjamins, put bands on\nThis drink will make her fuck\nNow these babes want each other, the 3-4 with a 5\nKissin one another, I hope we’re next in line\nI wait for my attender, I swear I don’t mind\nThen we know we all ready, got that Transporter outside\n\n[Hook]\n\n[Verse 3: Yo Gotti]\nI’m like motherfucker boo, I’m standin on the bar\nCoconut Ciroc, remind me of my car\nAll white Rolls with the blue top\nAll clear bottle with the blue dot\nLike sippin lemonade, we should mix it up\nLil drink, tight heels when I pick her up\nMe and Gotti keep it real, Shawty pink as fuck\nBut she still from the hood so she ratchet as fuck\nGold chain, gold Rollie, I be mixin it up\nWhite Rolls, white Rari, I be kickin it up\nI be killin them hah, now you feelin the hah\nWhen they pass me the glass I be spinnin it up\n\n[Hook]"}], "artist": "Nelly"}