{"songs": [{"year": "2017-11-10", "album": "Engraved In The Game", "image": "https://images.genius.com/d2a4d928684e2efa403cd26a8dc80fa5.1000x1000x1.jpg", "title": "Run Down", "lyrics": "[Verse 1]\nThis game is cut throat, lame as fuck though\nSay they got your back, but they hatin', uh oh\nWhy we even shocked man?\nSoon as I made it the face say god damn\nThey were spewin' and I knew it\nWhat you doin'? Did you do it?\nWhy they copyin' my moves bro?\nAnd this and that the same time, whats the rules yo\n[?] Nah shit that's the cold game, relevant Kers never be a old name\nAnd all the little bitches wanna come and suck your dick, it's like you never did exist shit\nWhat's the difference, bitches sendin' pictures, bitches start bitchin' over bitches, did I hit this?\nSo I roll on fuck [?] platform, why you think half these rappers even have floor\nThey can have more, do what the Kers done, if i'm giving you advice then its word up\nListen up hear the way you got to do things, only roll with the crew you came through with\nIgnore haters, get to the big biz, buy a house, get property, but with this, comes fake friends or even you closest, hate your doing while they turn before you notice\n\n[Hook]\nI'm giving you the run down\nTell you what the life like\nCase you're thinking that you ever grabbing my mic\nIt's night night, on the flight flight, why's my back sore? 'Cause they stabbin' with the knife like\nNever meant what they said, they hate you bro\nHate your new house, jewels, and your new car\nThey pretend cause' they wanna be friends\nThis the life I can't explain 'til I want it to end, yeah\n\n[Verse 2]\n[?] getting into drugs man this shit is a trap\nHold you back 'til you snap, and you struggle to rap\nOr even struggle to write words, hit with a tight verse\nIf they racking up, make sure you watch them try first\nPlus rappers are snakes, they don't like you\nDon't let them in your ear they just hype you\nWhen people turn, man they goin' wipe you\nIf i could go back they wouldn't be on my tune\nAnd my moves were made out of nothing\nI'd be down with the street had it pumpin\nBut that there brings trouble in it's own right, lucky i got moves that would shoot never know right\nPlus i keep my blade tucked, cause' i'm paranoid, I ain't getting jumped by ten cunts I'm [?] boy\nMedia and websites shat on my name, cause' i was reppin a gang, and I just couldn't be tamed\nThey had me on the TV defending rap\nAnd fuck Aussie rap, they won't defend you back\nIf you're taking advice, then take it from me\nThe Kerser same cunt that was selling tapes on the street\nNever kissed ass, never sucked up to labels\nNever bowed down, never fuck you I'm able to stand at the top and look what I fought through\nKers made it yeah, who would've thought true\n\n[Hook]\nI'm giving you the run down\nTell you what the life like\nCase you're thinking that you ever grabbing my mic\nIt's night night, on the flight flight, why's my back sore? 'Cause they stabbin' with the knife like\nNever meant what they said, they hate you bro\nHate your new house, jewels, and your new car\nThey pretend cause' they wanna be friends\nThis the life I can't explain 'til I want it to end, yeah\nI'm giving you the run down\nTell you what the life like\nCase you're thinking that you ever grabbing my mic\nIt's night night, on the flight flight, why's my back sore? 'Cause they stabbin' with the knife like\nNever meant what they said, they hate you bro\nHate your new house, jewels, and your new car\nThey pretend cause' they wanna be friends\nThis the life I can't explain 'til I want it to end, yeah\n\n[Bridge]\nYeah, I'm giving you the run down\nWhat it takes to actually live this life\nGonna come across some fake friends\nBut to think it was all fun and games\n\n[Hook]\nI'm giving you the run down\nTell you what the life like\nCase you're thinking that you ever grabbing my mic\nIt's night night, on the flight flight, why's my back sore? 'Cause they stabbin' with the knife like\nNever meant what they said, they hate you bro\nHate your new house, jewels, and your new car\nThey pretend cause' they wanna be friends\nThis the life I can't explain 'til I want it to end, yeah"}], "artist": "Kerser"}