{"artist": "Papoose", "songs": [{"album": null, "title": "Get Right", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro: Papoose]\nOh!!! This the one right here!!! Swizz Beatz you a fool for this!\nI done took y'all everywhere, ain't nowhere to take y'all but to the club\nPapoose, Pa-poose!!!\n\n[Chorus: Busta Rhymes]\nWe got a riot outside homey (Huh!) and every hood with a thug\nNiggas try to rush the door of the club\nWe 'bout to get right niggas! (We 'bout to get right niggas!)\nWe 'bout to get right niggas! (We 'bout to get right niggas!)\nAll my bitches with the bangin shit on, alot of Louis Vuitton\nYou know the shit then sing the words of the song\nWe call it get right bitches! (We 'bout to get right bitches!)\nWe 'bout to get right bitches (We 'bout to get right bitches!) Let's go!!!\n\n[Verse 1: Papoose]\nWhat you mean let's go?! go where?!\nThis my city I ain't goin nowhere (Nah)\nMatter fact, Bus let's go over there (Come On)\nTake all of they girls and bring 'em over here (Come Here)\nNew York City, have no fear, Flipmode, Streetsweeper oh yeah!\nOooh I like her, shake yo' rear\nYou look nice who did yo' hair?\nSyke!!! Shorty over there look way better than you, I don't care\nViolator, I brought Chris Lighty with me\nI know he ain't seen a buzz this big since 50\nI walk through the club let the liquor spill (Cris!!!)\nYour girl chasin me down with her high heels (Oops!)\nAnd I'm so glad I waited for a bigger deal\nCause now I got the club on me like a steering wheel\n\n[Chorus]\n\n[Verse 2: Papoose]\nI got a damn good lawyer\n(Yeah!) the best management and the realest DJ on the streets (Drama King)\nSo how the hell I'm 'gon lose\nO one of y'all dudes when the album drop I'm 'gon eat (Nacirema)\nYou got the number one spot, really think you hot\n(Oh Yeah) then homeboy just don't blink (Don't sleep)\nWhen you open yo' eyes the game 'gon be mine\nAnd I'm a bring it back to the East (Let's Get it)\nSince the Touch It remix put the face to the voice\nThe ladies love my style, they get moist (They wet)\nChose with my mouth closed they ain't have a choice\nI came from the bottom but I Rose like Royce\nMan these boys can't mess with me on my worst day (Nope)\nSo how the hell 'gon mess with me on my birthday (Yeah!)\nThat's right, this is the day I was born\nThe music is my mama, I'm the son of song\n\n[Chorus]\n\n[Verse 3: Papoose]\nWho's that with the Red Monkey Jeans? My shirt was made by Gino Green (Nice shirt)\nMy jewels was made by David Bling (David) They call me the underground king\nChain bling bling I'm the mainstream dream (Yeah) The Nacirema Dream you lames ain't seen\nI was in the club holdin my fifth tight, this dude keep grillin me I had to get right (What)\nShorty her face, her ass, and her hips tight (Oooh)\nTook her to the Mariott had to get right\nCutie the bomb she live in the beauty salon\nSo her beauty is strong rockin like Louis Vuitton\nCause these dudes never wanna see the new kid signed (No)\nThey always wanna shine like the sun all the time\nFall back you passed yo' prime\nEven the sun gotta go down so we could see the moon shine\n\n[Chorus]\n\n[Outro: Papoose]\nYeah! The East Coast get right! Yeah! The West Coast get right!\nYeah! The dirty South get right!\nBusta Bus, Kay Slay Drama King, Streetsweepers, Violator, Flipmode, Sissy!!!!!!", "year": null}]}