{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "I Got To", "album": "Birdman", "lyrics": "[Lil Wayne]\nBitch look up in the sky it's the bird fucking man\nJunior daddy - shitting on the game\nYou probably see me sitting on the Range\nI'm hustling - look up in the sky it's a bird of some cain\nAye, I flip it twice and I serve in the game\nShout it \"Ride fly, 20 birds on that thang\"\nI say shout it \"Ride high dro burn my brain\"\nGotta let a boy - I re-earn my thang\nAnd my five pound germ might sing\nA song - if you wanna sing say \"Bling\"\nAnd if you ever see my pa say \"King\"\nAnd if you ever see his son say \"Weezy baby!\"\nNew prints of the Big Easy baby\nYa'll niggas can't see me, but I see you lil Pha Pha baby\nYa dude can't lose - I'mma spread my wings and fly away brrrr!\n\n[Hook]\nKnow why I stay so fucking fly?\nStay dipped in every kind of ice?\nBig rims on every ride?\nCause I got to, I got to nigga\n\nLive life you ain't gone live it twice\nPop 'cris, smoke dro, and get that white\nDon't worry 'bout the price\nCause I got you, I got to nigga\n\n[Baby]\nIt's the king of the flyer\nThat ride skinny tires\nI'm so so high and I'm so so higher\nIts me and Jr. that's so so fly\nFuck them other niggas cause they need to retire\nWe pluck polar bear winter on my side\nSitting on the swine - alligator punch-line\nSuper stitch in my leather - pockets full of cheddar\nSmoke sticky, icky, icky, icky\nWe drank absolute cristal for breakfast\nNew whips come out - I puts it together\nTell you how I do it - I change my leather\nNo stock Blackwood with the foreign feathers\nAnd German eyes with them Gucci sweaters\nBought mami the matching shit and plucked her feathers\nI wipe it down bitch - bird lady forever\nBirdman switch from Rees to (?) leather\n\n[Hook]\n\n[Baby]\nShe was a raggedy bitch, switched her up, cleaned her life\nYou no longer a scrub you the Birdman's wife\nSo don't you think twice about this mink and leather shit\nYou drive by the hood and bird shit on a bitch\nDrive anything you want cause you the Birdman's bitch\nGet anything you need and you roll with the clique\nGo to the club and get a front row seat\nPop mo Don P just shit on a bitch\nSee your fly now mami - used to be a dirty bitch\nGot all these hoes trying to ride your dick\nYou maintain mami - you never just wild out\nThat's why Stunna put you in that big ass house\nWith the German floors with the wood grain side\nMink on the door with the foreign G ride\n(?) Bird berry Gucci be a surprise\nNo cost too high for my bitch to stay fly\n\n[Hook 1x fades to talking]"}], "artist": "Birdman"}