{"artist": "WC", "songs": [{"year": "2002-10-22", "lyrics": "[Intro: W.C.]\nAhh shit, god damn, niggas done fucked up\nW.C. and Face done hooked up\nFrom the West to the South, worldwide nigga\nY'all know what I'm talkin' about\nWe gon' do it like this for all my gutter niggas\nOn the frontline gettin' theirs, check it out\n\n[Hook] - X 2\nDi-di-di-dada dada-di-di we know\nIt's hard if you ain't got pounds or kilos\n(Riders don't die, we multiply, shift gears\nToss fingers in the sky, fuck hoes and stay high)\n\n[W.C.]\nI started off small-time\nSnatchin' purses and robbin' niggas for all mine\nUsed to love to catch you niggas known to high sign\nBomb on they ass from the blind side\nMy big daddy was a squabbler like Joe Frasier\nSo understand I was born to ride by nature, blast for paper\nA teenager, hollow-point slugger\nIn the Regal with the french braids and the cake cutter\nGots to get mo' money, mo' money\nCan't get pussy with no money, it's funny\nWhen I was broke bitches laughed\nTil' I met this bitch by the name of rap\nNow with my Night Train it's X.O\nSo Mr. Officer, fuck you and my ex-hoes\nI know it's hard to see a nigga make the bumper swang\nBut I convert the jack game to the rap game, motherfucker\n\n[Hook] - X 2\nDi-di-di-dada dada-di-di we know\nIt's hard if you ain't got pounds or kilos\n(Riders don't die, we multiply, shift gears\nToss fingers in the sky, fuck hoes and stay high)\n\n[Scarface]\nThe real niggas is back, cause there's too many\nBullshit records, out on the racks, fuckin' up the craft\nBut I'm about to put the thug, G back in it\nThe viscous Facemob with W.C. back in it\nYou feel me daddy? The game need Bradley\nCause nowadays your subject matter's so shabby\nI rap about the shit I do, or the shit I've been through\nCause I was taught you up your shoot\nI've got a body count beyond belief, cause there's an arm in me\nDon't take my word, ring the alarm and see\nI can act like I'm your homie 'til the timing is right\nSneak up on ya when you're sleepin', put this nine in your life\n(Now who the fuck thinkin' they want it with Mob?\nWhen I can map out a job to have a nigga come and level your squad)\nOne deep, you play for stripes, I'm playin' for keeps\nWho gives a fuck about some braggin' rights, they talk in these streets\n\n[Hook] - X 2\nDi-di-di-dada dada-di-di we know\nIt's hard if you ain't got pounds or kilos\n(Riders don't die, we multiply, shift gears\nToss fingers in the sky, fuck hoes and stay high)\n\n[W.C.]\nI'll break niggas, shake niggas, fake niggas\nLike weight apply pressure with my finger when sprayin' niggas\nW.C. and Face nigga, on the trigger deliverin' blood clots\nBuggin' these niggas with buckshots\nIn the six drop with fetti to drop, ready to pop\nHot rocks keepin' it hot from yo' block to my block\nWhether illegal or legal we gon' shine on these haters\nKeep it gutter, get the paper motherfucker\n\n[Hook] - X 2\nDi-di-di-dada dada-di-di we know\nIt's hard if you ain't got pounds or kilos\n(Riders don't die, we multiply, shift gears\nToss fingers in the sky, fuck hoes and stay high)\n\n[Scarface] (W.C.)\nI'm from the Southside, and I'm killin' with the flow\nAnd I'm here to let these niggas know\n(I'm from the Westside, and I'm dippin' in a fo'\nAnd I'm here to let you niggas know)\nI'm from the Southside, and I'm killin' with the flow\nAnd I'm here to let these niggas know\n(I'm from the Westside, and I'm dippin' in a fo'\nAnd I'm here to let you niggas know)", "image": "https://images.genius.com/9dca4fc634fb841debe25e0b0a92d67b.503x500x1.jpg", "album": "Ghetto Heisman", "title": "So Hard"}]}