{"artist": "Pink Guy", "songs": [{"album": null, "title": "Pink Guy Cooks Takoyaki and Raps", "image": "https://images.genius.com/2e0ea0eff080494fcfbee80f9df5aed9.999x999x1.jpg", "lyrics": "[Verse 1]\nIf I said this verse was fucking whack then I'd be lying\nYou said you're going platinum but your momma should have gone latex I'm crying\nBecause you're trying way too fucking hard to be what I am\nGive it a break and sit the fuck down\nNow it's pink in the flesh and I ain't talking about vaginas\nIf you wanna sniff a line of cocaina up in a diner and pop a molly or stupid shit\nReflect on using it but use it again just to make sure that you're not used to it\nI'm snapping necks like it's a bad picture\nI got these faggots throwing up like they were bad pitchers\nCuz this cranial tumor is not so humorous to bitches new to this uterus spilling girls with a million cramps that are thicker than their fluid gets\nNow that's a stupid bitch\nI get offended by these girls with their useless shit\nSo if you got a problem write it on a piece of paper\nAnd shove it up your ass I probably wouldn't read it later\nI'm so faded like your grandma in the hospital with alzheimers\nShe won't remember this joke, but just remember\nEven when she's losing her brain, she won't hesitate to wake up\nAnd start screaming my name\nLike in the hospital\nShe gonna be screaming my name\nIn the grave\nShe gonna be screaming my name\nIn the wheelchair\nShe gonna be screaming my name\nWho am I? who am I? yup yup it's pink guy\nSo who am i? yup yup it's pink guy\nKissing too much ass and you might contract pink eye\nThey said I wasn't smart enough to get some A's again I wrote some essays (ese's) up like arresting a few Mexians\nSo what the fuck is with this estrogen?\nEverybody's bitching about my work my dick starts to hurt again\n\n[Verse 2]\nThat's why I'm making all these octopus balls\nCuz yall need to grow your own\nCome and tickle my tentacles and tell me that I'm weak I got ink and some balls\nI said balls like fucking twice but I gotta emphasise on my testicle size\nI meant tentacle size whoops\nFirst you pour the batter then include the invertebrate\nLeave it for a couple minutes spin it like Beyblades\nThen you eat some fresh balls\nThen you eat some fresh balls\nThen you eat some fresh balls homie\nThen you eat some fresh balls homie", "year": "2014-08-28"}]}