{"artist": "Immortal Technique", "songs": [{"title": "Land of The Gun", "lyrics": "[James Nichols from Bowling for Columbine]\nThem people, law enforcement, if you want to call them that\nWere here and they were shaking in their shoes. They were physically\nShaking, scared to death. Because certain people, said I'm a radical\nI'm a wild man, I got a gun under every arm, if you say anything\nI'll shoot you. If the people find out how they've been\nRipped off, and enslaved, they will revolt with the blood\nRunning in the streets\n\nYo, Ticket to ride, the white crime, highway\nBring all the guns, the funds will come my way\nWhether we deliverin' high grade\nTo the people in the pit of the tri-state\nOr dabble in the hood like fly weights\nLock and load in the range with rock the globe\nMade any aim possible\nTil the leadbelly lost control\nIn the hold of the paper that fold\nAt one time was related to gold\nMade many men lose their soul\nTo the price of the dice that roll\nHow can a light so bright make a man so cold?\nSo another man's plans unfold\nCan you really see the truth til it happens to you\nIts so severe what the hopeless will do\n\nAin't no pickin' your position to beginning your life\nNot every man want to stand by his kids and his wife\nToo many lost kids in the night\nHand on heat, grippin' it tight\nAny man want beef could get it right\nFollowed by enough flame to put a permanent end\nTo the learning of men\nClass session, too many the blast the last lesson\nOften taught like the wars that are often fought\nAs old as mankind\nNow outta his damn mind\nStand on the gunpowder landmine\nReady to blow at any second\nI'm checking for the signs of the end\nOf all-time, I figure its on time, my last thoughts forming the rhyme\n\nGot me running through the streets\nThat reek of the dead, its more food to the wealthy\nMy niggas on welfare, nobody givin' up healthcare\nNothing but heat, how you gonna tell me it ain't hell here?\nGeorge Bush having a swell year\nSwingin' the gat, ready to clap, anything on the map\nYou done seen what they bring to Iraq\nNow bring it back to the source, land of the physical force\nLand of the gun, land of the gun, land of the gun, land of the gun!\n\nThis is the place where the cops rush in the building\nParamilitary death squads murder your children\nEmpty shell of a man rippin' shots in the air\nSoldiers dying out there, but nobody cares\nPrepare for the future but make note of the past\nOr be condemned to live it again and get blast\nClass warfare kept outta the news\nReplaced by a corporation's political views\nCause this is where the guns are manufactured and sold\nThe land that was stolen stripped of all of its gold\nOld timers on the death bed speakin' the wisdom\nImmigrants crucified by conservative Christians\nNow we all got freedom to die in the street\nBut the difference is more of us die in a week\nThan they die in a year I made it clear\nWhere I stand when the line is drawn\nBut now the line is gone\nAnd nigga anything goes\nThe land where the guns don't let anything grow\nAnd what the fuck you niggas know about living in hell\nYou not built like me you never lived in a cell\nYou never gambled with your soul\nFuck the ice on your hand, gun in your palm\nBut you got a niggas life in your hand\nYoung man, just remember that slicing a gram\nIs a bloody game, like throwin' mice in a fan\nMy words flow like the rivers thats west of Iran\nThe fertile crescent moon, with the star in the middle\nI reveal the depth of history's scars when I scribble\nI gave you the world, and I ain't even charged you a little\nThe martyr is crippled\nThe prophets are dead and buried, but the message is simple\nAnd its not written down in holy books as a riddle\n\nNow we running through the streets, starvin'\nOn that guerilla warfare\nMy people stuck in a guerilla warfare\nInnocent children screamin' in tears\nYou actin' like the army ain't put hell here\nMilitary industry havin' a swell year\nSwinging a gat while lying in heaven\nLiving off a blank check after 9/11\nBut I'm have the truth brought back to the source\nFight for my land with physical force\nSpeak through music, the subliminal course\nI need a tech and a clip, fuck a chain and a Porsche\nLand of the gun, land of the gun, land of the gun, land of the gun", "image": "https://s3.amazonaws.com/rapgenius/1-immortal_technique-20101005.Jpg", "album": null, "year": null}]}