{"artist": "Canibus", "songs": [{"title": "Doomsday News", "album": "2000 B.C. (Before Can-I-Bus)", "year": "2000-07-18", "image": "https://images.genius.com/e0d83a5acc29c3591a0ecf95686b2db4.1000x1000x1.jpg", "lyrics": "[Verse 1: Canibus]\nIf I had half as many bars in gold as I had in lyrics when I flowed\nI'd be the richest man on the globe\nNiggas wanna know is Canibus gold?\nThat's a stupid-ass question motherfucker, is Canada cold?\n'Bout a thousand degrees lower than liquid nitro is\nFive thousand degrees hotter than flame throwers\nI reflect light, bounce off walls and wreck mics\nDisconnect your windpipe by cuttin your neck with a knife\nRip through everything from tissues to blood vessels\nMy ninjitsu kill you with the art of Tenchu\nI zig-zag-zig, crushin a kid\nWith G-forces violent enough to crush your ribs\nLike pilots that fly Russian MIG comin to punish you pigs\nGive a fuck who you is nigga, Canibus in ya biz\nFrom the lowest point in the planet to Mt. Everest\nI kick the illest shit, spray-paintin my name across the pyramids\nThe rap terrorist, Professor Emeritus\nFuck forbidden fruit, I was eating pussy in Genesis\n\n[Hook: Panama P.I]\nWhat you got niggas that's ready to brawl?\nI'll give you the phone card and the celly to make a call\nWhat the fuck y'all bitch niggas actin like y'all tough for?\nWe'll stuff y'all, uppercut y'all, gun butt y'all\nOn stage we break arms, legs, backs and jaws\nEnough damage to cancel your tour (Fuck y'all!)\n\n[Verse 2: Canibus]\nNow I said it once and I'll say it a thousand times\nI got thousands of rhymes, the rechargeable alkaline kind\nYou wanna a piece of mind? Fine, we can take it outside\nOtherwise you're wastin your time, cause I'ma shine\nFor the one-triple-9, niggas gamblin damage they eyes\nGoin blind, tryna keep up with these lyrical lines\nThe type of nigga you can't flow behind without a dope rhyme\nYou fuck around and get clotheslined til you nosedive\nWe can rhyme fair and square or fair in the sphere\nAny place, anywhere, you niggas don't have a prayer\nCause doomsday is near, faggot niggas is scared\nThey stand and stare as I appear upon a cushion of air\nWith a long white beard flamin, hot enough to sunburn Satan\nHotter than white people takin vacation out in Jamaica out in the sun bathin\nSun bakin in gamma ray radiation til they skin color look Cajun\nMotherfuckers start ageing to the point where they faces shrivel up like raisins\nAnd they become cancer patients\n\n[Hook]\n\n[Verse 3: Canibus]\nYo, yo, yo.. I manipulate the metaphysical\nPower to hold my breath for half an hour\nContinuously breathin outward; you ain't an MC you a coward\nI make wack rappers lose control of they bladders\nAnd piss in they trousers\nPink pussy possum niggas play dead\nWhile my heat waves hit, and verbal x-rays evaporate shit\nWater molecules get transformed to vapors\nMy lyrics turn the Pacific into a dry lakebed\nElectromagnetic cassettes melt tape decks\nNiggas battle in space; tryin to hold it down\nBut they can't cause they weightless\nAmateur swordsmen gets stabbed through they face mask\nTrying to escape death\nA world where the whole globe will contract Ebola\nFrom drinkin spring water darker than Coca-Cola\nHuman with AIDS, computers with Y2K\nI rock rhymes counter-clockwise until doomsday\n\nFuck y'all, fuck y'all, fuck y'all"}]}