{"songs": [{"lyrics": "[Intro]\nAction\n\n[Verse 1: Action Bronson]\n05' pounds in the Laredo, they gotta get there today though\nAin’t no time for tryna lay low, bay bro\nIf you can’t do it all you gotta do is say no\nI’ll take it from there, Ace is on Grand ready to work it\nDisplayed a smirk like Mr. Perfect\nUnder the bridge, behind the van, in the cab, I made the drop off\nThank science that nothing popped off, since I was young, had a lust for foreign vehicles and things\nMy father wore the ring when he pushed me in the swing\nPlus he pushed that red thing, I wanted to be like him so bad\nWear the same shoes that he stepped in, of course I need paper\nI want to ride the one-seater like speed racer\nIn the Jetta smoking a one sheet in the green acres\nListening to bullshit music, thinking how I’m gonna do this\n\n[Hook: Rico Love]\nUh, temptations real\nEven though we feel we’ve been here before\nSomebody help me\nLord have mercy\nIt’s like the world we live in was only designed for\nSomebody wealthy\nBut what about the rest of us?\nWhat about the rest of us?\nScreaming, somebody help me\nBut what about the rest of us?\nIt’s like the world we live in was only designed for\nSomebody wealthy\nTurn the lights on\n\n[Verse 2: Joey Bada$$]\nI’m from a place called the jungle where the living is rough\nIt had me low for a while now I’m picking it up\nHolding the spot straight sticking it ripping it up\nI dropped 99 problems, switching and not giving a fuck\nSo what you what you want? Got your bitch nigga gripping her butt\nHer and my dick, taking pics nigga flicking it up\nMy click is wassup get buck if you want?\nYou end up dumped chump, in the pond lake in a truck in New York\nThere’s no ducking me, the Bada$$ time, but no fuckery\nWon’t find a chick who got a dime or take a single buck from me\nThese hoes be loving me, I keep it so G\nRespecting where I be nigga check your OG\nMy rap flow, imperial fad flows\nWell here it go my, visions is linear when I’m ripping the video\nIt’s a lyrical miracle when I enter your stereo\nThe rarest breeds, sick like venereal diseases\n\n[Hook: Rico Love]\nUh, temptations real\nEven though we feel we’ve been here before\nSomebody help me\nLord have mercy\nIt’s like the world we live in was only designed for\nSomebody wealthy\nBut what about the rest of us?\nWhat about the rest of us?\nScreaming, somebody help me\nBut what about the rest of us?\nIt’s like the world we live in was only designed for\nSomebody wealthy\nTurn the lights on\n\n[Bridge: Rico Love]\nDying for nothing\nKilling to live, fighting for something\nToo bad we don’t know what it is\nWhat you think all of this cash for?\nTrying to put stamps on my passport\nMan I’m just scheming on new hoes\nI already forgot about my last broad\n\n[Hook: Rico Love]\nUh, temptations real\nEven though we feel we’ve been here before\nSomebody help me\nLord have mercy\nIt’s like the world we live in was only designed for\nSomebody wealthy\nBut what about the rest of us?\nWhat about the rest of us?\nScreaming, somebody help me\nBut what about the rest of us?\nIt’s like the world we live in was only designed for\nSomebody wealthy\nTurn the lights on", "title": "What About the Rest of Us?", "album": "Southpaw (Music From And Inspired by the Motion Picture)", "image": "https://images.genius.com/c4eafbf7343fa7fa7eb7374ea6f1eb63.1000x1000x1.jpg", "year": "2015-07-24"}], "artist": "Action Bronson"}