{"songs": [{"title": "3rd Girl", "album": null, "year": "2016-07-26", "image": "https://images.genius.com/a25b6fb82c2655bdb2fc3f6b1c6704f5.500x500x1.jpg", "lyrics": "[Intro]\nCookin' Soul\n\n[Hook: Larry June]\nAye, how you doing bitch?\nI love you sweetie, we can rule the world\nI swear to God, you ain't my hoe, baby\nAye, you my bitch, you just my third girl\nMy third girl, aye, how you doing bitch?\nI said, \"Yo, how you doing bitch?\"\nFor real though, damn\nHow you doing bitch?\nLet me tell you, you ain't my hoe\nYou just my third girl\n\n[Verse 1: Larry June]\nAll a nigga do is talk shit and count hundreds\nBoard another jet, meet my bitch out in London\nOne thing I learned being a P, never cuff 'em\nEvery whip I got a push start and they run it\nBitch looking like some real work, I might run her\nNever would of knew she sold pussy on the under\nAtlantic city cracking, she just hit for twelve hunnid\nShe told me when I met her, she didn't need a P for nothing\nI looked her in the eyes like, \"Bitch quit fronting\"\nShe glancing at my rollie like, \"Damn, he get money\"\nPhilly cheese steak, I'm in Philly with snow bunnies\nBodega out in Boston, fuck it, let's cop somethin'\n\n[Hook: Larry June]\nAye, how you doing bitch?\nI love you sweetie, we can rule the world\nI swear to God, you ain't my hoe, baby\nYou just my third girl\nMy third girl, aye, how you doing bitch?\nI said, \"Yo, how you doing bitch?\"\nFor real though, damn, how you doing bitch?\nLet me tell you, you ain't my hoe\nYou just my third girl\n\n[Verse 2: G-Eazy]\nListen to me\nFuck a bitch, you on a team of winners, baby\nCome and sign up\nYou on the bench right now\nBut one day you'll be starting lineup\nSome bitches got potential\nSometimes they just need to shine up\nIf you ain't getting money, bitch\nThat's your fault, get your grind up\nYeah, I can buy whatever, I ain't tripping what it cost now\nI pull up in that skrrr, they say, \"Damn it, Gerald got style\"\nYou talking out your neck, bitch\nNow you gon' make me hostile\nAre you a fucking software update? Cause not now\nBay Area bosses, bitch, yeah, I fuck with Larry\nI purchase real estate, you rappers making money, barely\nSpend your money wisely, yeah, I recommend it highly\nBitch, you know where I'll be, to that green just like wasabi\nAnd I need some extra in my soy sauce, I like my sushi spicy\nI'm from the land of hyphy, bitch, there ain't nobody like me\nI'm so international, shouts to $hort and [?]\nI'm out in Argentina with a Becky doll Christina\n\n[Hook: Larry June]\nHow you doing bitch?\nI love you sweetie, we can rule the world\nI swear to God, you ain't my hoe, baby\nYou just my third girl\nMy third girl, aye, how you doing bitch?\nI said, \"Yo, how you doing bitch?\"\nFor real though, damn, how you doing bitch?\nLet me tell you, you ain't my hoe\nYou just my third girl, yeah"}], "artist": "Larry June"}