{"artist": "YG", "songs": [{"image": "https://images.genius.com/0234c65f6d6514702072da47412b8cc3.500x500x1.jpg", "year": "2011-05-02", "album": "Just Re’d Up", "lyrics": "[Intro: YG]\nRight, ayy, haha\nCuff yo' chick\n\n[Verse 1: YG]\nShe asked me if I wanted right there and I said, \"Hell yeah\"\nStarted kissing on my ear, and I said, \"Hell yeah\"\nThen I told her like you know what, we can do it in my Rover\nYou can get from the side, like the pistol in my holster\nShe says she want it rough, so I beat her up and I choked her\nGot that Dodge Ram dick, bitch I'll leave that pussy dented\nThat pussy'll probably end up dead before I finish\nShe be all at my mouth like the dentist\nThen she started playing with my balls like tennis\nNo ties, no suit, no boot, but I give her the business\nI got her saying, \"that's my dick\" like she had it rented\nOff my shit, you my bitch, now sit right here and ride my dick\n\n[Chorus: Chris Brown]\nShe said, \"Daddy do you want some?\" I said, \"Hell yeah\"\nDo I want in the chair? I said, \"Hell yeah\"\nDo I want it in the kitchen? I said, \"Hell yeah\"\nDo I want it in the bed? I said, \"Hell yeah\"\nLady, say, \"Hell yeah,\" lady, say, \"Hell yeah\"\nLady, say, \"Hell yeah\" (Woah, oh) hell yeah\n\n[Verse 2: Tyga]\nUh, open up your leg, your thighs, let a nigga gon' peek inside\nDon't worry about where your car is, I'ma get this dick to ride\nI know it's Christmas Eve, I'll fuck you under that tree\nL-Legs in the air that's yo' gift from me\nRick James Super Freak, grab your waist and now let me eat\nPipe game I'm a beast, you can say that I'm MVP (Haha)\nMP3, same song go on repeat (Repeat)\nSuck your bottom lip, now climb on top of me\nI'm hard as a rottweiler, beat your butt like a piñata\nSaid she love Young Money so I let her taste my dollars (Haha)\nWe fell asleep ('sleep), wet dreams (Dreams)\nHer fantasies ('sies) woke me up and she said (Haha)\n\n[Chorus: Chris Brown]\nShe said, \"Daddy do you want some?\" I said, \"Hell yeah\"\nDo I want in the chair? I said, \"Hell yeah\"\nDo I want it in the kitchen? I said, \"Hell yeah\"\nDo I want it in the bed? I said, \"Hell yeah\"\nLady, say, \"Hell yeah,\" lady, say, \"Hell yeah\"\nLady, say, \"Hell yeah\" (Woah, oh) hell yeah\n\n[Bridge: YG & Chris Brown]\nShe said, \"Do you want it in the kitchen?\" I said, \"Hell yeah\"\nShe said, \"Right behind them dishes,\" I said, \"Hell yeah\"\nShe said, \"Do you want it on the floor?\" I said, \"Hell yeah\"\nShe said, \"Right behind the door?\"\n\n[Chorus: Chris Brown]\nShe said, \"Daddy do you want some?\" I said, \"Hell yeah\"\nDo I want in the chair? I said, \"Hell yeah\"\nDo I want it in the kitchen? I said, \"Hell yeah\"\nDo I want it in the bed? I said, \"Hell yeah\"\nLady, say, \"Hell yeah,\" lady, say, \"Hell yeah\"\nLady, say, \"Hell yeah\" (Woah, oh) hell yeah\n\n[Outro: Chris Brown]\nHell yeah, lady, say, \"Hell yeah\"\nHell, hell, hell yeah\nWoah, oh, hell yeah", "title": "Hell Yeah"}]}