{"artist": "Cappadonna", "songs": [{"title": "Cap’s Back Again", "album": "The Cappatilize Project", "year": null, "image": "https://images.genius.com/9e39a26e8da8941483c3579ba53558e3.1000x975x1.jpg", "lyrics": "[Malcolm X sample]\nWhen you study the historic nature of revolutions\nYou may change your goal and you may change your mind\nLook at the American Revolution in 1776\nThat revolution was for what? For land\nWhy did they want land? Independence\nHow was it carried out? Bloodshed\nNumber one, it was based on land, the basis of independence\nAnd the only way they could get it was bloodshed\nYou don't have a peaceful revolution\nYou don't have a turn-the-other-cheek revolution\nThere's no such thing as a nonviolent revolution\n\n[Cappadonna]\nThe hard times, tough pain, heavy rains coming down on me (Cap's back again)\nUp all night, sleeping in the streets, life ain't treating right (Cap's back again)\nA fatherless child, escaped from work release, and plus blew trial (Cap's back again)\nReptiles in the BM-Dub, lizards and fake wizards (Cap's back again)\nThe dirty staircase, pissy hallways, I'm in the grind, always (Cap's back again)\nTwisted ass record deal, spiritual albums, I feel like Malcolm X (Cap's back again)\nCab driver status, wild baby mothers, two sisters and two brothers (Cap's back again)\nTwo tours with Ghost, the chrome toast, no calls from Rae (Cap's back again)\nFall off, then I get back on, ya'll best to be warned (Cap's back again)\nFrom bum to rich, broke, back to fly again, baby what's what? (Cap's back again)\nThe ill rapper, try'nna feed my triplets and still flip on this shit (Cap's back again)\nFrom New York to Baltimore, I'm coming hard, no matter what, kid, I still want more (Cap's back again)\nCats is still sleeping on me, but so what, cuz these streets put a beating on me (Cap's back again)\nTwo Benzes, Cadillac truck, head in the whip, still living it up (Cap's back again)\nI'm in the projects for life, pain so deep that it cut like a knife (Cap's back again)\nI'm going all the way with this, and to them stupid reptiles\nThat admit they did this (Cap's back again)\nNone of ya'll cats can see me, ya'll got it mixed up when you see me on MTV\n(Cap's back again)\nForever pushing the pain, never fall back, it's like I'm pushing the train\n(Cap's back again)\nFronts in the mouth, ACG's, golden brown army fatigues (Cap's back again)\nMomma in the housing, I'm trying to make thousands, what you gonna do now?\n(Cap's back again)\nFake cats never show 'em no love, when I see 'em, yo, I'm throwing slugs (Cap's back again)\nIt's all over for dudes, the time is now, Staten Island side chika-pow! (Cap's back again)\n\n[Outro: Cappadonna]\nPing pong with this...\nIt's how I be beating your head against the words...\nDiggaler, Deini, yo...\nRespect the king..., the first...\nUh-huh, Staten Island stand up...\nStraight up and down, right here\nThis is Tyzeen street music\nCrack barrels of rap... get 'em... yeah..."}]}