{"songs": [{"title": "No Justice No Peace", "album": "The Lost Tribe of Shabazz", "year": null, "image": "https://images.genius.com/ccff32ca0eedb6ac1f785643772e94fa.400x399x1.jpg", "lyrics": "(We were stripped from our land\nThey took our families and deliberately broke them apart\nTook the father one place, the mother some place else\nAnd then they had the child whose mind was white\nOnce they indoctrinate him with all this inferiority talk)\n\n(...in Africa with your blood relatives)\n\n(I'm mad as hell and I ain't gonna take no more)\n\n(This business of justice is not new)\n\nNo justice\nNo peace [x2]\n\nWhat is the world comin to?\nWhat are we gonna do?\nI'm disgusted, so we must get\nReady to become militant rebels\nCause there will never be no peace without justice\nI'm tired of my people treated unequal\nThat's why I'm ( ? ) I gotta face this\nSo I speak out and those who don't like it, they freak out\nAnd they label me a racist\nI'ma keep sparkin, me and brothers like Al Sharpton\nWe don't like what they did to Yusef Hawkins\nWhy was the trial prolonged for so long?\nThey shot him in cold blood, they knew they was dead wrong\nLet a brotherman shoot the other man\nNowadays they lock em up in a second and throw the key away\nHold up, you think I fold up? No, I'm geased\nWithout no justice there'll be no peace\n\nNo justice\nThere will never be...\nNo peace\nWithout...\nNo justice\nThere will never be...\nNo peace\n\nSee, I'm a programmed warrior, built to last\nA Five Percenter who descends from the Lost Tribe of Shabazz\nBarin the truth, I'm not scared of ya\nIs this the United States or the United Snakes of America?\nThis is a livin hell and I'm not ( ? )\nI refuse to burn in America's melting pot\nI'm angry, you can't refrain me, I make em all see\nWord is bond it was wrong how they did [Name]\nAs far as I can see her privacy was exploited\nThey beat her and raped her, put her in the back of manure\nEngraved 'nigga' on the stomach\nUp to this day a lot of people think she fronted\nIs it a lie or is it incidental?\nPeople who are raped names' supposed to be kept confidential\nBut she was exploited at a young age, it's such a shame\nI never heard the Central Park jogger's name\nBut straight to the point and on the ball\nI be the universal true Son of Man and and a ( ? )\nI pity you idiots like Arsenio Hall\nJokes about our sister, he thinks it's funny, y'all\nIt's sad to see ( ? ) so much as a minor\nI'm glad to see the Nation of Sslam refined her\nYou want peace, well, let the unjust stuff cease\nIf we don't have justice, there will be no peace\n\nNo justice\nThere will never be...\nNo peace\nWithout...\nNo justice\nThere will never be...\nNo peace\n\nBreak it down\n\n(I think that the solution rests with the people\nIt's a mistake to rely on professors\nRacism is learned\nNobody is born a racist\nAnd some people have Ph.D.'s in racism)\n\nThe Mighty Maestro created a beat that was lethal\nThe source to bring forth power to the people\nThe rhythm was made to be rolled by the host\nSo I'ma ride the rhythm from New York to the West Coast\nBrotherman takin a stand, demandin respect\nI'm not with the situation in Teaneck\nThey said he was dangerous, well, I'm concerned\nHow could he be so dangerous with his back turned?\nThey said, \"Freeze! Halt!\" The brother stopped\nThrew his hands in the air, yeah, and still he got shot\nThey said he had a shiny object in his hand\nSo they killed the man\nAnd is this justice, no way, José\nHe didn't get arrested, he was suspended with pay\nTalk about armed and dangerous, accounted\nHow come I never heard nothin else about it?\nI'm dead up, I'm goin head up, see, the buck stops\nHere, I'm sick and tired of corrupt cops\nI gotta drop cause I don't think it will ever stop\nMy brain is a Tec-9 and it's kept cocked\nAnd it's got just a few more rounds to go\nThey're goin pound for pound, blow for blow\nYou want peace, let the unjust stuff cease\nIf we don't have justice, there'll be no peace\n\nNo justice\nThere will never be...\nNo peace\nWithout...\nNo justice\nThere will never be...\nNo peace\n\nNo justice\nNo peace\n\nPeace to Allah's Nation\n\n(...they come together in dialogue and solve the problem)"}], "artist": "Lakim Shabazz"}