{"songs": [{"image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "Go Motorcycle Go", "album": "40 Days & 40 Nights", "lyrics": "[Mac Lethal talking]:\nNo officer. Everything is fine. I'm just going to beat your wife dead. Beat your wife dead\n\n[Verse One] [Mac Lethal]:\nAngel, Angel of Hell, Satan as well it's like\nYou can see the smoke screen beaming through the metal pipes\nSpiked jacket better hide your wife and kids\nCause if I find 'em you're gonna have to hide your wife and kids, get away now\nGotta get that engine revving, cops are coming cause they see the patches on my jacket\nPull the rachets on them...faggots\nI take 'em all apart and blow 'em like Mazucker\nThis is it, in the art of fucking motorcycle (madness)\nMurder sail through the sky\nOn a chopper with the blood shot eyes\nI'm immortal, no I must not, DIE DIE DIE DIE!\nKill a hooker, smoke a little crank into my lung\nGot a chopper, got some shit to rob a bank inside my gun\nInside my chopper, my daddy never told my sister, \"Smile Chelsey.\"\nBut I'mma give her Chelsey smile till your life is healthy\nRoadside demon, Highway heathen\nKill a meth addict trucker every weekend\nBAM!\n\n[Hook] [Mac Lethal]:\nSo here, here we go, fuck it here we go like\nGo motorcycle go, go motorcycle go\nSo here, here we go, fuck it here we go like\nGo motorcycle go, go motorcycle go (what we got Mac?)\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\n\n[Verse Two] [XV]:\nIn the midst of rappers wearing gymnast's jeans\nI took a turn for the worst put a patch upon my sleeve\nThrow a jacket on my bitch, and I'm back onto the scene\nLike you tell, like a rabbits ass on my batch of keys\nHe's\nRhyming while he's defying lions, lambs, and rap gods\nRapping over A Milli, doing wheelies on back bars\nHello, my motos blowing smoke into the sky\nNo roof, so I can shoot up in the air and fly\nI shed light on the hood like helicopters\nChange the type on everything you type on the teleprompter\nI'm the dude that they threw into\nMiddle school lockers\nCame back riding through the halls on a metal chopper\nJohnny Blaze, fire coming from my wheels\nCome into the darkness, eat 'em up like Kryll\nLady in a red dress, Devil's on my heels\nGhost rider, rhymer find out I can not be killed\n\n[Hook] [XV]:\nSo here here we go, fuck it here we go like\nGo motorcycle go, go motorcycle go\nSo here here we go, fuck it here we go like\nGo motorcycle go, go motorcycle go (what we got Mac?)\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow\nI got the psycho/cycle flow\nGot the, got the psycho/cycle flow"}], "artist": "XV"}