{"songs": [{"year": "2001-09-21", "image": "https://images.genius.com/3749c060f89eca4eb3dac2193a559a45.991x1000x1.jpg", "title": "Why?", "album": "Be Yo Self", "lyrics": "[Syke talking]\nDamn, the world's so crazy out here\nNever know what's going on\nNever know why things happen\nBut they do\nWell just take it\n\nVerse 1:\n\nAs my inner thoughts of reality set in, another day begins\nCause you never know you were alseep until ya wake up\nWill me and my ex-girl make up?\nI don't know but life's a question\nAfter death is there a resurrection?\nCause the chaos and the mayhem got me crazy\nWhen will I have my first baby?\nBut is there love there?, do I really care?\nI swear, life ain't fair\nSo much pain and sorrow\nWill I see tomorrow\nMake a path for my kids to follow\nSo it's me against the world\nCan't nobody talke to me\nI need psychotherapy\nForever I cry inside\nI can't hide\nJust tell me why\n\nChorus:\n\nWhy do we do the things that we do? (Just tell me why)\nWhy do we do the things that we do? (Tell me why)\nWhy do we do the things that we do? (Tell me why)\nWhy do we do the things that we do?\n\nVerse 2:\n\nA little kid's refelection is a shadow of death\nJust behind him are his first steps\nBut nobody cares it's just everybody for theyself\nSo pray to Yahweh if you need help\nCause love don't love nobody alone\nCan I stay strong? can I move on?\nBut I gotta get used to my past being my future road\nSeldom travelled but never told\nThe world is crazy my mind is paralyzed\nAnd hypnotized by these walk-bys\nFamilies cry from dead souls lost\nI guess our future pays the cost, I wanna floss\nBut we drownin' in poverty\nMy homie said he was gonna get wid me but ain't got wid me\nIt's so hard on a G tryna elevate in the game\nAnd there's no way to escape the pain\nTell me why\n\nChorus\n\nVerse 3:\n\nSo many trials and tribulations\nWe livin' in desperation\nEveryone's givin' up there's no motivation\nOrganization or self determination\nThe youth is fallin' and callin' the OGs\nHand up some kis or get degrees, Lord please\nI can't take it the world is comin' to an end\nSo God forgive me for my sin\nCause I ain't never had a thang, will it change?\nSo I can rearrange\nThe game ah life is the hardest game yet\nCause nobody knows what's coming up next\nNo respect, for our elders cause they fightin' us scared\nWhta happened to the love we once shared, noone cares\nSo I soak my pains in Remy Martin and gettin' high\nI know that's not the answer\nSo I ask why?\n\nChorus\n\n[Kid #1]: Syke why everybody die?\n[Kid #2]: Why the world so crazy?\n[Kid #3]: Why everybody go to jail?\n[Kid #4]: Why little kids get kidnapped?\n\nChorus ('til fade)"}], "artist": "Big Syke"}