{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Intro]\nThis song here was written by Calista\nFor Danny\nHere we go, ey, yo, uh\n\n[Verse]\nDear Danny, I'm so upset\nWill you ever change for me? I won't hold my breath\nIf I need a hand, you won't even stretch\nAll you do is say I nag and I bitch and I stress\nI guess I'm just a crazy-ass bitch in a dress\nIf you're nice to me it's just so you can get you some sex\nAll you wanna do is get laid\nYou wouldn't tell me to stop if you saw me holding a blade to my wrist\nI swear to God I don't exist\nOf the people that you love, I'm at the bottom of the list\nI'm 'bout to shut my mouth, you can talk to my fist\nFallin' in love with you, it was such a risk to my health\nAnd to my kids and my family\nTo my happiness and to my sanity\nTo every single friend, every man I see\nYou ain't never been a husband or a man to me\nI ask you to take me for some fries\nYou tell me I got some chubby ass thighs\nI ask you to take me out for some ice cream\nYou say a skinny girl would be such a nice dream\nI ask you to take me for a burger\nYou say I need a salad, inside it feels like murder\nYou're a big Mac Lethal fan\nHopefully, he raps this and you become a changed man\nI don't wanna leave but I swear that I have to\nFirst I got some questions that I gotta ask you\nWhat the hell did I do to make your heart bust?\nWhy do you look at me with so much disgust?\nWhy do you trample my goodwill and trust?\nWhy did you cheat on me and why do you lust other women?\nYou're selfish it's true\nI guess you can't spell the word \"us\" without \"u\"\nI guess you can't spell the word \"us\" without \"u\"\nI guess you can't spell the word \"us\" without \"u\"\nWell, you can't spell the word \"wedding\" without \"we\"\nAnd you can't spell the word \"home\" without \"me\"\nAnd you can't spell the word \"love\" without \"L-O\"\nAnd you won't even look me in the eyes and say hello\nCan secretly hate me\nWell guess what, fuck you\n'Cause these days I secretly love you\nYou say I'm fat, you say that I'm chubby\nYou say if you left me, I'd never find a new man to fuck me\nWell, I just wanna tell you with this song - -\nBy the time you get home tonight, I'll be gone, mhm\nI just wanna tell you with this flow- -\nYou can't spell the word \"goodbye\" without \"go\"\nIf you want proof that I can resist ya':\nYou can spell the word \"Danny\" without \"Calista\"\n\n[Outro]\nSo peace!\nSorry Danny, I don't know what to tell ya' man!", "year": "2019-07-20", "album": "YouTube", "title": "A 26 Year Old Mom Wrote This About Her Boyfriend"}], "artist": "Mac Lethal"}