{"artist": "Planet Asia", "songs": [{"album": "The Grand Opening", "title": "Paper Up", "image": "https://images.genius.com/cb88bb05cdeba97350da2c7dd2f127f2.500x492x1.jpg", "lyrics": "[Planet Asia]\nYeah\nYe-ye-ye-yeah, ye-ye, ye-yeah\nAh one two\n\n[Repeat 4X]\nLa la la la la LAH, la la-lah\n\n[verse One]\nI was chillin on the corner, just me and my fam\nAnd everybody had at least a G in they hand\nThat's when one of my brothers came with this master plan\nHe told me, \"As' - no more sellin this hand to hand\nYou got talent then you should use it don't waste it man\nThere comes a time in your life one must take a stand\"\nI looked at him and said, \"You got me mistaken man\nIt'll all come in time, just be patient man,\" but\n\n[Chorus: repeat 2X]\nMy peoples gotta get they paper up\nCause nowadays these streets ain't safe for us\nHow many more lives they gon' take from us\nThis life will make you crazy like angel dust\n\n[Verse Two]\nI wrote this for my peoples who stay on the grind\nThe Lord might not come when you call but he's always on time\nLike this friend of mine I know who was left behind\nHad no one to care so therefore it vexed his mind\nBut then he transformed his energy, utilized his strength\nAnd took it as a blessing as a part of his identity\nNo need for worry just keep your pride\nCrooked cops on the block with the piece inside, but\n\n[Chorus]\n\n[Asia] Now everybody sing it!\n\n[Repeat 4X w/ ad libs]\nLa la la la la LAH, la la-lah\n\n[Verse Three]\nIf you ain't got no dough, get your paper up\nAll the mothers on the Earth, just pray for us\nIt will be many more lives that they take from us\nBut in the end there really ain't no escapin us\nI used to think that I would end up paperless'\n'Til the homies in the hood started cakin up\nBut I'm an artist, no not as in paintin brush\nBut a hustler's theme song, your favorite stuff\n\n[Chorus]\n\n[Asia] Now everybody sing it!\n\n[Repeat 8X w/ ad libs]\nLa la la la la LAH, la la-lah\n\n[Planet Asia]\nC'mon\nKutmasta Kurt, Planet Asia, G.C.M\nC. Ayyyy! {?}", "year": null}]}