{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/b294ecc265a79f3e4ef86c41b208e8e4.500x500x1.jpg", "title": "Woke Up This Mornin’", "year": "2008-07-08", "album": "I Pledge Allegiance to the Grind II", "lyrics": "[Intro]\nWhat's hapnin', sweetheart?\nHigh as a muh fucker\nI got some cool shit planned, baby, just pack ya bag\nJust throw whatever. Really you'on even need to pack a bag\nI'ma...I'ma take care of that when we get there\n(High as a muh fucker)\nNah, we ain't goin' outta town\nWe just goin' downtown\nAnd then I might...be goin' downtown\n\n[Chorus]\nI woke up this mornin'\nI woke up this morning'\nI got high as a motherfucker\nHigh as a muh fucker\nI awoke to this woman\nI awoke to this woman\nShe was fine as a motherfucker\nFine as a muh fucker\nAnd we woke, and we spoke, and we smoked\nAnd got high as a muh fucker\nAnd we woke, and we spoke, and we smoked\nAnd then we Fucked like a muh fucker\n\n[Verse 1]\nHey baby, hey baby\nLast night was real crazy\nThe Compound was shut down\nThe A-town was so at it\nNiggas screamin' at Alex\nTo get in, paid a stack\nUp in the back with the twins it was cracked\nRoll all my blunts fat\nLike ya ass, like ya breast\nGot damn, how many times I'ma look at ya breast?\nI'm trippin', Jermaine Dupree only come to ya breast\nAnd I caught Beyoncé lookin' like, \"That bitch fresh!\nWho she is? Where she from? She a stripper I bet\"\nBut to the contrary, yo man hustles and gets\nWhich enables you to whip around in that 'Vette\nWhich enable you to were such enormous baguettes\nWhich enrages them hater hoes and faggots\nThat wish they could trade places, them maggots\nAy, fifth of the trash\nI got a fistful of ass\nReminiscing on this morning as the blunt gets passed I'm like\n\n[Chorus]\n\nHey cutie, hey cutie\nLet me rub on yo booty\nYou can call anyway, we gone chill, make a movie\nWe can clean out the closet\nTalk about a few topics\nI'm gone admire ya brain, you gone give me some knowledge\nA hot pepper in bed, and so sweet in the sheets\nWe in the intercontinental rental suite for a week\nGot Room 420 buzzin' like a bumbling bee\nThe size of ya ass and beauty just astonishing me\nYou a down ass chick, hey, what mo' could you be?\nYou say, \"Michael, do it to me like you punishing me\"\nNot a player, but I crush it like I'm Punisher, see\nFuck you to sleep\nAnd wake you up with weed and something to eat\nOkay\n\n[Chorus]\n\nSweet baby, sweet lady\nCan you roll up a sweet\nSo we can reminisce on this, it's been a hell of a week\nYou are my Louie bag lady when we in the streets\nAnd Fendi freak-a-leek when we between the sheets\nI blow you shotguns baby in ya nose and cheeks\nAnd later on, like blunt smoke, you'll be swallowing me\nI be layin' in ya hair\nLookin' in ya stare\nFacetime baby, if you need it, I'm there\nBaby, I'll do it\nTill it leak fluid\nAnd I'm a Superman, I make that pussy go \"Yuuuuueee\"\nWindow to the wall\nBae we did it all\nYou even had a friend to come and walk around in draws\nWouldn't let me fuck her, told her \"Nigga, hell nah\"\nTold me ya ain't trust her when we made it to the mall\n5 bands, goddamn girl, what you bout?\nAww fuck it, hit the room, make love, get high, AY!\n\n[Chorus]"}]}