{"songs": [{"album": null, "year": null, "title": "GOAT", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "[Verse 1 - J.R. Writer]\nI'm the greatest of all time\nNigga, ask around -- I've been great for a long time\nOn grind, I be amazing, I'm off mines\nYou ain't gotta pass the crown, I'm taking what's all mines\nWho don't shine? My wristwatch make the chicks hot\nA lil' head in the car -- that's a whip-wop\nThen tell her kick rocks, thinking she gon' get guap\nAin't got enough for the train, I tell the bitch, hop\nThis is real hip-hop, what the kid drop\nYou couldn't slow the dog down at a pit stop\nI play like 'Melo, but I keep a big shot\nShoot you while you pushing your work -- that's a sling shot\nI'm already king, I've chin-checked the ring\nYou waiting on the right pitch, you don't never swing\nMask, black gloves, all-black everything\nBlack Mag, black snub, floormat, everything\nYou'll respect me then, would you, shouldn't you\nI'm sick of you niggas talking on what you wouldn't do\nI mean, look at you -- I make it hard to look at you\nCome through and shake the whole block down -- I'm shook of who?\nI'm live-er than that, hotter than that\nI leave the whole strip red, no Prada to match\nI body a track, bottle the crack\nThese niggas act like I woke up and forgot how to rap\nI'm back\n\n[Verse 2 - Cassidy]\nHi haters; I keep getting high, haters\nI'm grown, no chaser, I'm high as a skyscraper\nHomes, you at home with your mom -- I own acres\nI own so much land, man, I'm my own neighbor\nYou a beggar; you need a loan, a favor\nI get cash, you just mad, you got the vapors\nA lot of niggas wish they was Cas, but can't be me\nMy diamonds probably make you go blind, you can't see me\nCause my diamonds shining like the finger on E.T\nYou on a bus, I'm in a truck with three TV's\nI dropped three CD's, but I'm just getting started\nMy new album coming out -- it's 'bout to get retarded\nShit! Pardon my French, motherfucker\nBut I'm hustling, got it jumping like Vince, motherfucker\nYeah, the boy in the zone\nAbout to show his ass like the artist formerly known as Prince, motherfucker\nAnd I'm about to convince motherfuckers\nThat I got more bars than AT&T and them Sprint motherfuckers\nGo ahead with that nonsense, motherfucker\nCause you said you make it rain but can't even make it rinse, motherfucker\nYou never fought a homicide or attempts, motherfucker\nYou jokes could get smoked like incense, motherfucker\nGee I'm hung, but I ain't get lynched, motherfucker\nThat's why I walk with a limp, motherfucker\nI'm a pimp, motherfucker"}], "artist": "J.R. Writer"}