{"songs": [{"year": "2003-01-01", "title": "Hood Life", "image": "https://images.genius.com/cff949e333e91bd4776ee32fef57ea4a.360x360x1.jpg", "lyrics": "[Intro: Saigon]\n(Fuck all that.  They hit Vern last night, man.  Grab the fucking gun, man).  Can’t believe this shit.  (Hit this nigga back, man).  Yo, Lizzy.  (Want that nigga dead, son).  Niggas hit ‘round here last night, man.  Yo, king.  (They hit Vern, man)\n\n[Verse 1: Saigon]\nQuiet storm, militant form, I stand firm\nFlat footed in a shootout (What?) my son Vern got burned\nNow my spine squirm (Damn).  Damn, they pushed my man face in\nGod, come and sentence these dudes to damnation\nContemplate the plan, pacing bad act and falled off\nLove all our [?] up in the law, cocked sawed-off\nWent from cropping a crop to shop ‘til you drop\nProlly bump into him there, ya, ‘cause that’s the popular spot\n‘Member, ain’t a cop in the plot\nIf you spot him, hurry, put a shot in his top, come out and hop in the drop\nScaling through the mall floors, securing all nine of ‘em\nLater, for finding ‘em, I don’t see not a sign of ‘em\nPlus it’s getting dark and hot.  Niggas sparking pot in the parking lot\nSay they see the shock a lot up top\nGrab the milli grip, fill a clip to the tip\nAim for what you know to rip—strictly head and nothing below the hip\nThis nondescript nigga make a thug flip.  I’mma make his blood drip\nSoon as the slug hit.  Aim for his nugget.  Cousin\nLean over.  Son, he drove a, drove a blue Nova\nLoud motor.  Slow up, Jehovah, look below the decoder\nIt’s him.  Him and his slim.  Pull out, cock the toast at him\nDon’t discriminate women and, man, pop both of them\nShit\n\n[Hook: Saigon]\nAnd that’s how we living in this hood life (Hood life)\nWe do it dirty out here.  We do it so dirty out here\nBoy, you better walk with your knife tonight\nDon’t get caught up slipping in this hood life\n\n[Verse 2: Saigon]\nWhy the police always wanna send me back to my hell?\nBe another lost soul—young, black, and in jail\nProlly rapping to the rat in my cell, saying shit like\n“Rat, them crackers ain’t had to do me like that”\nHe said, “Pssh.  You better hold it\nI take them six years and you could be the rodent”\nI thought “Nah, get over it”\nI said, “Fuck you, rat.”  He said, “Fuck you back!”\nYou ain’t getting no more potato chips, then you flipping\nI ain’t scared no more.  I will jump down there\nAnd get your bucktooth ass a quit whipping if you keep tripping\nThen I snapped out my daydream (My daydream)\nLooking at the rat eating errything (Eating errything)\nI can’t see myself in state greens (state greens)\nI gotta hit the bricks, go home, and try to stay clean (Stay clean)\nBut the street life is sucking me up\nI ain’t giving a fuck.  Just living it up\nKeep a deuce in my pocket, keep a clip in the cut\nAnd I put six in your gut to get rid of your butt\nSlut.  Faggot\n\n[Hook: Saigon]\nAnd that’s how we living in this hood life (Hood life)\nWe do it dirty out here.  We do it so dirty out here\nBoy, you better walk with your knife tonight\nDon’t get caught up slipping in this hood life", "album": "Saigon A.K.A. Da Yardfather Vol. 2: On the Go Back"}], "artist": "Saigon"}