{"songs": [{"album": "On Behalf of the Streets 2", "year": "2016-10-28", "title": "All Around Me", "image": "https://images.genius.com/80ad94a37ba095ea6693dc11f160722c.733x733x1.png", "lyrics": "[Verse 1: J. Stalin]\nI left school and went to sell coke at lunch time\nEver since a lil nigga I been gettin' mine\nI seen real niggas die up in the ghetto\nWrap him up in the sheet and dig the hole with a shovel\nBangas out the window, I been ridin' with the devil\nNiggas get smacked but the coke still yellow\nWeed still movin', bitches still choosin'\nIf I ever bounce out trippin', believe I'm gon' use it\nI see a lot of tough talk but don't nobody prove it\nIf you ever think I'm broke, nigga, you hella stupid, stupid\nYou niggas worser than these fuckin' groupies\nWe was sellin' coke like the boat movie, movie\nMy connect say I'm his best student, student\nYou talkin' money then I speak it fluent, fluent\nYou talkin' money then I speak it fluent, fluent\nFunk season'll leave your block in ruins\n\n[Hook: J. Stalin]\nI ain't got nothin' but gangstas, killa niggas all around me\nAll around me\nMurder for hire, they get the job done\nBut they gon' charge you a fee, charge you a fee\nI ain't got nothin' but dope dealin', hustlin' niggas all around me\nAll around me\nWe gon' weigh in on the brick and break it down, we all gon' eat\nAll gon' eat\n\n[Verse 2: J. Stalin]\nKept my mouth closed, kept my ears open\nSqueeze first, that's how you survive in West Oakland\nCokeland, California where the dope made\nReal killas made a livin' off the D game\nBefore they ever get a job, they'll jack and rob\nYou doin' good then you better thank the game god\n'Cause these white folks, they'll do you like you Trayvon\nLately I been gettin' to the green like I'm dre mob\nYou ain't ever changed up on me, you my day one\nReal niggas know it take one to know one\nCertified 10th shit, I been A1\nAnd everywhere I go you know I keep a gun\nThese bullets heard, they gettin' shot, ain't no fun\nKedr on my lap with the cinnamon bun\nAnd them lil niggas with me, they gon' slide for fun\nAnd them lil niggas with me, they gon' murder for fun, pussy boy\n\n[Hook: J. Stalin]\nI ain't got nothin' but gangstas, killa niggas all around me\nAll around me\nMurder for hire, they get the job done\nBut they gon' charge you a fee, charge you a fee\nI ain't got nothin' but dope dealin', hustlin' niggas all around me\nAll around me\nWe gon' weigh in on the brick and break it down, we all gon' eat\nAll gon' eat"}], "artist": "J. Stalin"}