{"songs": [{"album": "Celcius", "image": "https://images.genius.com/44b96a02c4ad68840aa7a37b7345ba30.1000x1000x1.jpg", "year": null, "title": "Boss Doggs", "lyrics": "[Hook 1: Big Scoob] x4\nGun in my hand\nHot 'til I land\nBoss Doggs!\n\n[Hook 2: Short Nitty]\nBoy this I'm tied\nRebellin' on the corners of Highland\nAnd if I die in this violence rest me\n(Gun in my hand, hot 'til I land, boss doggs!)\nBut if I live past these sirens\nNiggas best beware of this tyrant\nCuz I got some true mid-westsiders with me\n(Gun in my hand, hot 'til I land, boss doggs!)\n\n[Verse 1: Big Scoob]\nRogue dog, rogue dog 57th street\nBout a craft from the past that was excused by my peeps\nThe same gang but a new game, no more cocaine\nRap thang we maintain, hot like propane\nUp and here we pumpin that fear, lend me your ear\nThe tightest shit you'll ever hear, at least this year\nAll my lyrics is simple and clear, and sincere\nFull of that beery, rockin them shows, and fuckin them hoes\nLike we suppose we dealin with foes, leave em exposed\nThat's what you chose for fuckin with Rogues, now you know\nWe bout to explode, now here we go, all my Rogues\nGrab your scratch it's time to scrap, rear it rap\nYou take a nap and that's a fact, all my hogs\nWho got my back, where you at, bring the pain\nTo damage the brain, who's to blame, it's my gang\nWe full of them flames I won't explain, it's in your veins\n\n[Verse 2: Bakarii]\nKing of the hill, countin my skrill, protecting my grill\nGun on my hip, tryin to conceal, this killa shit\nThat nigga Bakarii runnin that game, hold me back\nI'll break them chains, slap yo face, with this strap\nMore than a rap nigga we hogs, down the brawl\nTake yo bitch, make her scream, for them dogs\nMurderers you can't touch my style, too complicated\nCamaflouged in the bushes, now I'm waitin\nReady to get off in yo shit, feel my vengeance\nSoon as you slip I'll make the hit, no repentance\nTryin to be rich and I can't be broke, I'm so relentless\nAsk me if it was potent dope, I'm offended\nShould've seen me comin nigga, them killa traits\nCouldn't detect this boss's greed, that's yo fate\nUnder-seed smokin leafs, that killa fog\nCan't be tweak, so you sleep, on these doggs\n\n[Hook 1] x4\n\n[Verse 3: Short Nitty]\nCriminal play, all day, give me relish\nYou going to war in all ways, max to devilish\nRemember when niggas seen me flow, on them corners\nWantin to be like shorty chrome, never done\nHittin em up with 56's, dookie browners\nKickin it with them wicked bitches, all around us\nGive me my money with blood on it, cuz I'm wicked\nAnd if the game with love on it, til I'm lifted\nNitty would never be without, my three 80\nGiven a chance to up and dump, he must be crazy\nReady to roll no matter the fault, if he's seeded\nTell him to meet me at my show, fully fleeted\nHearing shots pop pop pop, at my enemy\nIt's better than seein that nigga drop, y'all ain't feelin' me\nMaking my verse my worst then first, are y'all with me\nDiggin my dirt for what it's worth, signed Nitty\n\n[Verse 4: Tech N9ne]\nCrumple this page, welcome mitch bade, hold my genitals\nWe in a rage, if we don't get paid, nothing but criminals\nPut in the gun, nigga let's come, from the shoulders\nHere come the fun, watching 'em run, from these soldeirs\nWho be the doggs? Who be the hogs? Niggas on Highland\nDoing the broad, doing it for, straight out stylin'\nUsed to be down, look at me now, makin' them heaters\nNiggas they frown, when they hear the sound, of nine millimeter\nFlowin in fog, who do you call? Donny Quest's in\nHaters with yall, nigga they all, learn they lesson\nBianca zone, at my home, think I made it\nAll on my bone, cuz it was on, Gang Related\nSeeing my face in magazines, up in The Source man\nDo we plan on makin that green? Well of course man\nMid-westside, give me the track, and I will attack her\nScoobie do wild, check yo style, and flip it backwards\nI'm off on Highland, smoking that bud, drinkin that bud\nThat Tecca Nina, be up in your fuzz, up in the club\nI lost yall, but I'mma return, do you recall?\nI'm killin em all, nigga we raw, boss doggs\n\n[Hook 1 + Hook 2]"}], "artist": "Tech N9ne"}