{"songs": [{"image": "https://images.genius.com/639af7c3779547263444a0acdd2ffcde.1000x1000x1.jpg", "title": "Prayer Song", "album": "Room 25", "year": "2018-09-14", "lyrics": "[Verse 1: Noname]\nIf you wanna help me then kiss me and fuck me later\nGentrify all my people, there's emptiness on the table\nIf you wanna help me to put me inside the cuffs\nPut the cigarette in my back\nKeep the hospitals overrun-run-run-run, Chicken Little\nHow my city gonna run off shits and giggles?\nPoliticians overzealous with the provolone\nIshkabibble's and incidentals\nDont crash the rental, its God and temple, and bible\nDon't nobody got no holy, everybody got an iPhone\nIf you wanna help me then kiss me and fuck me\nGood-good-good tonight, Inglewood tonight\nLA be bright but still a dark city\nSo come get your happy and your new titties\nSaid go find your doctor, you can get Kimmy\nSaid oh how we used to love you\n\n[Chorus: Adam Ness]\nAmerica the great, this grateful dead and life for me\nApple pie on Sunday morning, obesity and heart disease\nCan you hear the freedom bells?\nCan you see the rusty nails chip chip away on all the coffin?\nApproach with caution, hallelujah, amen, amen\nI was lost but thinking I was truly free (amen, amen)\nDarkness lingers in the wake of slavery (amen, amen)\nHold me close, don't let me fall into the deep (amen, amen)\nThe lost have risen, a new religion, hallelujah, amen, amen\n\n[Verse 2: Noname]\nPut your hands behind your back, ante up all your crack bitch\nI seen a cell phone on the dash, could've sworn it's a gun\nI ain't see a toddler in the back after firing seven shots\nA demon 'bout to get me, he watching me kill his mom\nThe hood is overflooded, these niggas is on the rise\nBake a cake with flour, it's better to gentrify\nWhy, oh why my dick getting bigger, this violence turn me on, me on\nMy mama finally seen her baby on Channel 2\nShe love me better when I be keeping the streets clean\nWhy, oh why my house getting bigger, corruption turn me on\nAin't no police locking up these niggas better than me\nAnd my wife think I look like a man, I feel manly\nI tell Stanley, when you grow up you gon' be like your dad\nA free man in the land of the noose\nThey ain't tell me how to cry, just shoot\nI did, they only taught me how to check her pulse, she dead\nWhen I win it's like confessional, trying to find me a therapist\nThey taught me how to say amen, amen\n\n[Chorus: Adam Ness]\nAmerica the great, it's Grateful Dead and life for me\nApple pie on Sunday morning, obesity and heart disease\nCan you hear the freedom bells?\nCan you see the rusty nails chipping away out on the coffin?\nApproach with caution, hallelujah, amen, amen\nI was lost but thinking I was truly free (amen, amen)\nDarkness lingers in the wake of slavery (amen, amen)\nHold me close, don't let me fall into the deep (amen, amen)\nThe lost have risen, a new religion, hallelujah, amen, amen"}], "artist": "Noname"}