{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "Spinning Out", "image": "https://images.rapgenius.com/77fac9cb635136345d2df6c14f88ad3b.1000x1000x1.jpg", "lyrics": "[Verse 1: Professor Green]\nMy mind, I'm out of it\nGot a bottle of Jack, time to drown in it\nI made it here but don't know how I did\nWho'd have thought that the sheer amount of shit I been through would amount to this?\nHow about a spliff? I feel like I'm spinning out\nIt's kind of surreal, all of the shit I've been around\nNine months since I licked an ounce out\nShit just switched around, I still haven't figured out how\n\n[Hook 1: Fink]\nWith your feet on the air and your head on the ground\nTry this trick and spin it, yeah\nYour head will collapse if there's nothing in it\nAnd you'll ask yourself\nWhere is my mind?\nWhere is my mind?\nWhere is my mind?\nOh, way out in the water, see it swimming\n\n[Verse 2: Professor Green]\nMy life's a rollercoaster, a fucking hurricane\nGot a past which I wouldn't wanna tuck away\nThere were minutes when I wished I could've run away\nStuck, I stayed, suffered but I lived to see another day\nAnd look how quick it changed up, it's insane blood\nFuck the fame, I'm still the same as when I came up\nBut now I get paid, get laid quicker\nDrink straight and make a face like I hate liquor\nI had a lot to prove, from I had to shot for loot\nNow my nan turns the TV on and I'm on the tube\nSummer time with Lil and we're on a yacht with Muse\nIf you could see the gap between the from and the to, it's crazy\n\n[Hook 2: Fink]\nWhere is my mind?\nWhere is my mind?\nWhere is my mind?\nWay out in the water, see it swimming\n\n[Verse 3: Professor Green]\nFrom the gloom and the upset\nTo women coming in pairs and I'm enjoying the fruits of my success\nStill adjusting, I ain't adjusted just yet\nUnkept, scruffy and I puff cess\nSo how's success? I guess it's okay\nSo long as you don't mind a little cocaine\nNo sleep and women who go both ways\nIt's easier to appreciate when you've known pain\nBuying things I never thought I'd ever own\nAbout to buy a crib and I ain't ever home\nSeeing places I never thought I'd ever see\nI guess it had to even out eventually\nIt might've evened out, but even now\nWhile I'm flying high, I can still see the ground\nThe clock's ticking but I ain't watching the time\nFor now I'm enjoying the ride\n\n[Hook 2]\n\n[Outro: Professor Green]\nYeah, you know it's mad cause I ain't even a fan of change\nI'd much rather have notes in my pocket but\nFor once things changed for the better\nI took a risk and it payed off, haha\nIt might've taken a while to do so but it finally did\nAnd what's left to do but enjoy?", "year": null}]}