{"songs": [{"lyrics": "[Produced By: Mark the 45 King]\n\n[Intro]\nTake the bass line out\nUh-huh, Jigga\nUh-huh, uh-huh, uh-huh, yeah\nLet it bump though\n\n[Chorus]\nIt's the hard knock life for us\nIt's the hard knock life for us\nInstead of treated, we get tricked\nInstead of kisses, we get kicked\nIt's the hard knock life!\n\n[Verse 1]\nFrom standin' on the corners, boppin'\nTo drivin' some of the hottest cars New York has ever seen\nFrom droppin' some of the hottest verses rap has ever heard\nFrom the dope spot, with the smoke Glock\nFleein' the murder scene, you know me well\nFrom nightmares of a lonely cell, my only hell\nBut since when y'all niggas know me to fail? Fuck naw\nWhere all my niggas with the rubber grips, bust shots\nAnd if you with me, mama, rub on your tits, and what-not\nI'm from the school of the hard knocks, you must not\nLet outsiders violate our blocks and my plot\nLet's stick up the world and split it 50/50, uh-huh\nLet's take the dough and stay real jiggy, uh-huh\nAnd sip the Cris' and get pissy-pissy\nFlow infinitely like the memory of my nigga Biggie, baby!\nYou know it's hell when I come through\nThe life and times of Shawn Carter, nigga, Volume 2\nY'all niggas get ready!\n\n[Chorus]\nIt's the hard knock life for us\nIt's the hard knock life for us\nInstead of treated, we get tricked\nInstead of kisses, we get kicked\nIt's the hard knock life!\n\n[Verse 2]\nI flow for those 'dro'ed out\nAll my niggas locked down in the 10 by four, controllin' the house\nWe live in hard knocks\nWe don't take over, we borrow blocks\nBurn 'em down and you can have it back\nDaddy, I'd rather that\nI flow for chicks wishin', they ain't have to strip to pay tuition\nI see your vision, mama\nI put my money on the longshots\nAll my ballers that's born to clock\nKnow I'ma be on top whether I perform or not\nI went from lukewarm to hot\nSleepin' on futons and cots to King Size\nGreen machines, to green 5's\nI've seen pies, let the thing between my eyes analyze life's ills\nThen I put it down type Braille\nI'm tight grill with the phony\nRappers, y'all might feel we homies\nI'm like, \"Still, y'all don't know me.\"\nShit, I'm tight grill when my situation ain't improvin'\nI'm tryna murder everything movin' – feel me?\n\n[Chorus]\nIt's the hard knock life for us\nIt's the hard knock life for us\nInstead of treated, we get tricked\nInstead of kisses, we get kicked\nIt's the hard knock life!\nIt's the hard knock life for us\nIt's the hard knock life for us\nInstead of treated, we get tricked\nInstead of kisses, we get kicked\nIt's the hard knock life!\n\n[Verse 3]\nI don't know how to sleep, I gotta eat, stay on my toes\nGot a lotta beef, so logically, I prey on my foes\nHustlin' is still inside of me, and as far as progress\nYou'd be hard-pressed to find another rapper hot as me\nI gave you prophecy on my first joint, and y'all lamed out\nDidn't really appreciate it 'til the second one came out\nSo I stretched the game out, etched your name out\nPut Jigga on top and dropped albums non-stop for ya, nigga!\n\n[Chorus]\nIt's the hard knock life for us\nIt's the hard knock life for us\nInstead of treated, we get tricked\nInstead of kisses, we get kicked\nIt's the hard knock life!", "title": "Hard Knock Life (Ghetto Anthem)", "image": "https://images.genius.com/67bff9279147de1fb310538f29df7c3a.1000x1000x1.png", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}