{"artist": "C-Rayz Walz", "songs": [{"title": "Mood Swing (Clean)", "album": "Mood Swing / Make It Happen", "year": "2001-01-01", "image": "https://images.genius.com/997ef6cef6768ef403ed6eedec5c2452.528x528x1.jpg", "lyrics": "[Verse 1: C-Rayz Walz]\nI keep it moving like frog legs before the Cajun recipe\nI hope I die on the mic so everyone can inherit me\nI don’t spit on bars.  I drool on lava rocks\nAnd keep my essays elevated like Guatemala potheads\nIn real life, there’s a time when the drama stops\nAnd the teardrops goes plop like llama snot\nCaught between Timberlands and travel fox\nPast and present, from club nights to block fights\nAdolescence to a grown man with worries and bills\nI’m like a smart shopper looking for a deal\nAnd all I find is bargains—a hungry artist never starving\nPutting cyphers on squeeze like Charmin\nI drink water when the money’s low, race my runny nose\nAnd think stronger, longer to help these dummies grow\nI don’t give a fuck like a celibate mind state\nIf you don’t see what I’m saying, consider this a blind date\n\n[Hook: C-Rayz Walz]\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  Mood swings\n\n[Verse 2: C-Rayz Walz]\nIf you ready to die for something, you better live it\nI never dropped a album—The Prelude was a snippet\nBeat a midget to death with my short end of the stick\nLife is hectic and stressful—you must fight this\nMood swings.  Emotional days in the park\nThe light is but a shade of what stays in the dark\nI used to blaze trees.  Now I cherish the bark\nPlant the seeds deep, speak and inherit the art\nI got roots in this, stealing spinach out the register\nTravel light years—my peers is interstellar\nNow get your groove back.  Life’s a beach with broken glass\nWhere your boots at?  Pitching fast?  I’ll get a hit and roof that\nI see the swerve in your curve made of bourb to be slurred\nWe preserved eternally on the street curb—word\nForever I bless.  Sometimes, I get stressed and furious\nConstipated like George—this shit got me Curious\n\n[Hook: C-Rayz Walz]\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  Mood swings\n\n[Verse 3: C-Rayz Walz]\nBattery tested.  When sound checked, it was fully charged\nDo not eat the remix.  Overstand the wooly gods\nSpreading views.  Intuition is the weapon used\nSeeing myself as the winner, I never lose\nI throw claps back at you and receive what I give\nReading letters my pops wrote that he never did\nTruly fact, my life booby-trapped like the groovy cats\nI could die and be back before the credit reenact the intro\nYoungest in charge, living large, pushing the Pinto\nEvidence coincides—this ain’t coincidental\nI got new headphones.  Lines busy, brain off the hook\nA sight for sore eyes—when you go for self, it’s a strained look\nMy hindsight turned to ketchup and served burgers\nDeath whispered life in my ears—I heard, “Birth murder”\nLike a sword and a shield, I hold the rhyme and the pen\nSometimes I lose it.  On the mic, I find it again\nMy throat goes hoarse, of course.  I might need some hay\nRemember my name.  You’ll be screaming it someday\nIn the mist of lead showers beyond gun spray\nLife as a traffic cop, nothing goes one way\nOn to Peter Pan listening to Pirate Radio\nFull-moon clocks.  Lunatics going crazy, yo\nRhyming on a train, I became one with the track\nUsed to stay in my shell like slugs in a gat\nI forced to react from a powerful impact\nFrom the essence.  With blessings, I will be sent back\n\n[Hook: C-Rayz Walz]\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Emotional days in the park\nMood swings.  The light is but a shade of the dark\nMood swings.  Mood swings"}]}