{"artist": "Pouya", "songs": [{"album": null, "title": "Max", "image": "https://images.genius.com/05280718d7d6814454003fb87cd1861d.500x500x1.jpg", "lyrics": "One in the morning\nGot a phone call from his homie\nAnd he told him\n\"Wake the fuck up 'cos we got a job we must do\"\nWe got the crew\nCouple of brews\nAnd everybody was packing a tool\n\"What do I have to do?\"\nHe asked the man in charge, responded \"Just be cool\"\nGo in the alley, hop out the whip and shoot one of the kids with they friends\nPop, just like that, and you'll be with us till the end\nThought to himself\n\"Damn, this don't make me a man\"\nBut, he proceeded to open the door and walk up with the nine in his hand\nHe took to the car, driver pulled out\nCongratulations, you one of us now\nHe wasn't proud. This life he had, he didn't want it\nBut he got it there's no turning back\nWishing that he never touched a mac\nEveryday he wakes with a conscious on his back\nAnd now he looks up in the sky, like \"Who the fuck am I?\"\nJust wondering and he be asking God when is his time\nFucked up in the masses of jail and know max\nBeen through a lot of shit\nSo why I be feeling remorse for the kid\nWhen the violence in others be forcing him\n\n-Freeze motherfucker, turn around!, turn around, I'm just gonna fuck you\nTurn around motherfucker! ...Shut the fuck up!\nI'm gonna fuck him up! ...Shut the fuck up!\n-Please don't shoot me, alright?\n-Shut the fuck up!\n??...??\n\nNext morning he rolling solo on his way to his school\nStill thinking about the tool that he used to end somebody's life\nHe turned around and headed back to his house\nHe had this mean weight on his shoulder that he had to get out\nHe walked in and grabbed the gun and sat back in his car\nHe wants to throw the gun in a river and get rid of the scar\nSo, he driving and ducking and diving the traffic with graphic visions of what occurred\nNot paying attention he slammed on the brake and turned as he hit the curb\nWitness approached and called the 9-1-1\nHe was sitting up in his car\nMore blood than Red Rum\nIt was rolling straight down his cheek\nAs he thought it was fate that he was 'bout to meet\nBut with all his strength, he managed to stand up on his two feet\nAs the ambulance took him away, he wishing that he gon' live another day\nHe feeling like this was the price to pay (pay)\nFor yesterday\nRemorse and sin, they go together\nMax learned this lesson for worse or the better\nSo looks like he's gon' have a couple more storms to weather", "year": "2013-11-22"}]}