{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "One for the money, two for the show\nHit the Louis store right on Rodeo\nWhite SL, the color of Yayo\nPass the cup to my girl and told her to sip slow\nThis my show, watch me baby, The way i go can't stop me baby\nSeatbelt beside me baby, LA just drive me crazy\nWe could float through the city night, im drunk and your lookin real pretty right\nMake love i ain't finna fight\nNot once, we can go till we get it right\nWhat it cost i can fit the price\nGot a house in hills you can spend the night\nWhen they ask who turns you out\n\n(Chorus)\nShe came from over-seas\nTo be a star on the boulevard\nShe wants sex on the beach\nWe can share, its only fair\nIve got paradise on call, its ours, its ours!\nShe got a little taste and she wants more, some moreee\nWe run L.A!\nYeh, cut alot of girls, cut alot of cheques\nThats the life here on sunset\nRich and famous i am sucess\nMet her at Les Deux and she do love sex\nIma sip this, you do the rest\nYou know what you do, you do the best\nDo me a favour, lose the dress\nIts nice by the way, Chanel i guess\nLAMB handbags i know where they sell those\nMaybe later on we can hit Melrose\nAll you gotta do is hit me on my cellphone\nBaby girl me and you can kick it like a field goal\nKnow who i be, call me YB\nRed carpet i dont need the I.D\nCazals on my face, you dont see what i see\n(Where) Girl you know where i be\n(Where) Hollywood Swingin'\n(Thats right) Hollywood Swingin'\n(Thats right) Hollywood Swingin'\n(Where) Girl you know where i be\n(Where) Hollywood Swingin'\n(Thats right) Hollywood Swingin'\n(Thats right) Hollywood Swingin'\n\n(Chorus)\nShe came from over-seas\nTo be a star on the boulevard\nShe wants sex on the beach\nWe can share, its an all in affair\nIve got paradise on call, its ours, its ours!\nShe got a little taste and she wants more, some moreee\nWe run L.A!", "title": "We Run L.a."}]}