{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/2di5rcerbrjygst071mrs6bkg.500x500x1.jpg", "year": null, "album": "Ball of Flames: The Ballad of Slick Rick E. Bobby ", "lyrics": "[Intro:]\nHey\nAin't you ever heard'a my boy\nCatfish!\nBilly\nHe say he the shit\nBest believe that shit too maine\nRun all up and down your ass with that\nFour Wheeler!\n\n[Hook: 2x]\nIf you bounce and you throwed\nAnd you know who got the deal\nIf your mouth is all gold\nAnd you know who got the grills\nHoller\nI'm The Shit (Nah)\nI'm The Shit (Uh uh)\nI'm The Shit (No way)\nI'm The Shit\n\n[Verse 1:]\nOh my Lord the south done birthed another Bay Bay Kid\nOut the woods I come in scoring with a Peg Leg kick\nOver the head and threw the net (net)\nPass the goalie with this rock (rock)\nThat's a point for the home team\nYou can't hold me, I won't stop\nAll my Billy's grinding throw your chewing backer up!\nPop your members only collar Dixie mafia!\nYeah we twerk, yeah we work (work)\nAnd we'll give your girl a squirt\nWe got hats, we got shirts\nRock that shit and go bizzerk!\n\n[Hook 2x]\n\n[Verse 2:]\nInternet connection via satellite, on Myspace\n24 hours a day, I'm pimping out my rhyme page\nI'm certified, my prescription ain't filled out though\nI keep some kicks on my feet that killers would kill fo'\nSee there I'm nutty\nAnd my shoe game is mean\nI could kick your face and keep my shoe laces clean\nGotta plate full of stew\nA couple of home brew\nI'm leaning left looking for walls to hold on to\n\n[Hook 2x]\n\n[Verse 3:]\nI'm cleaner this year (year)\nWindows gleaming and clear (clear)\n1987 'Stang is pulling up in your rear (Whoa!)\nHeadlights on this, blinding your vision ho\nYou can't see me cause I'm stunting ridding in your whip I stole (Err)\nI'm on the scene (scene)\nThey rolling tape (They rolling tape)\nIt's looking good (I'm looking good)\nI'm feeling great (I'm feeling great)\nThat's my people watch your mouth or I might peel your grape\nWith this number 2, that I conceal in my bass (Aye)\n\n[Hook 3x]\n\n[Outro: Rick E. Bobby & Lucius]\n\nRick: WOO! Alright man! We did it!\nLucius: I- I don't wanna be raining on your parade,(Yeah) but I gotta tell you, that was some of the dumbest driving I ever seen in my life. (Thank You) I know you won the race but you're not gonna live forever\nRick: I'm not stupid Lucius. No one lives forever, No one. But uh, advances in modern science and my high level income. I mean it's not crazy to think I can't live to be 245, maybe 300", "title": "I’m The Shit"}]}