{"songs": [{"year": "2019-06-16", "album": "I.C.a.B.S.", "image": "https://images.genius.com/223cb1288fedb4f41d9c1f909207de02.1000x1000x1.jpg", "title": "All Is There", "lyrics": "[Chorus]\nAll is there\nIt's a fast life\nCan't catch my\nAll is there\nIt's a fast life\nCan't catch my\nCan't catch my\nCan't catch my\nAll is there\nIt's a fast life\nCan't catch my\n\n[Verse 1]\nI've been looking inward and I been on this mission\nFeel like I'm warming it up, put the key in the ignition\nRegular scheduled program and we getting back to business\nMost of my thoughts are so manic they might derail my vision\nIf you sat in the seat I sit in you would see this shit much different\nAll I'm doing is existing, I don't consider this shit living\nDelusional mental limits, solitude, got me in prison\nThey say karma is the result of ill intentions, shit if it isn't\nBase's loaded, blow for blow, off'a the juice, swing for the fences\nYou gon' do what you gon' do so it's on you if you defenseless\nCommon sense was never common, that's why most these niggas senseless\nLooking outwards, the mask was inside\nMan that's a cowards disguise, realize\n\n[Chorus]\nAll is there\nIt's a fast life\nCan't catch my\nAll is there\nIt's a fast life\nCan't catch my\nCan't catch my\nCan't catch my\nAll is there\nIt's a fast life\nCan't catch my\n\n[Bridge]\nWon't you let me hold some?\nAnd I could tell you what this peace of mind worth\nFeeling like I got nothing\nAll I have is my pride and my mind and these words\nFeeling like I'm on something\nFloating in the sky with the planes and the birds\nHope you live it to the fullest\n'Cause you could lose it quicker than you got it, yessir\n\n[Verse 2]\nAll of my thoughts coming together and falling apart at the same time\nPerspective is key, I weigh it in gold, I'm taking control before you take mine\nNever let these humbling times direct my trajectory\nTaken a couple of losses, the lessons was learned separately\nKeep my eyes wide, analyze mental dissection shit\nPlease don't be surprised that I survived through all these energies\nPaid your dues in tithe but deep inside you lacking empathy\nThe question is when will you comprehend and understand it?\n\n[Chorus]\nAll is there\nIt's a fast life\nCan't catch my\nAll is there\nIt's a fast life\nCan't catch my\nCan't catch my\nCan't catch my\nAll is there\nIt's a fast life\nCan't catch my\n\n[Outro]\nAll is there\nCan't catch my\nAll is there\nA-A-All is there\nA-A-All is there\nCan't catch my\nCan't catch my\nCan't catch my\nAll is there\nA-A-All is there\nA-A-All is there\nCan't catch my\nCan't catch my"}], "artist": "K.A.A.N."}