{"songs": [{"lyrics": "[Intro]\nFuck you doin'\nYeah, yeah, so, bitch\nYeah, yeah, so, yeah, yeah, so\nYou wanna smoke?\nYeah, yeah, so, yeah, yeah, so\nYeah, yeah\n\n[Chorus]\nTold that bitch like, \"Hold up, short, where you goin’?\"\nBitch, come pull up and show me some, show me some\nTold that bitch like, \"Hold up, shorty, where you goin'?\"\nBitch, come pull up and show me some, show me some\nWith my niggas countin' paper just like usual\nAye, just like usual, woah, aye, just like usual\nWith my niggas countin’ paper just like usual\nAye, just like usual, woah, just like usual\n\n[Verse]\nHo, you know I got that Rollie 'cause a nigga pressed for time\nCame up on that block where niggas known for sellin' dimes\nAnd niggas known for doin' crimes, but catch me doin' rap shit\nAll you niggas clap shit, my niggas come through, clap shit\nThe fuck is you? Fuck is you from?\nCame up in this bitch like too deep, me and my gun\nHoes, they look at him like, \"Who's he?\"\nYeah, they know that nigga Dolla, baby\nCome through, I'ma catch your baby momma\nMake her swallow, baby, huh\nCatch me ridin' Bimmer, no S\nWith some bitches sniffin’ so much powder, they hear snow bells\nFuck her for a couple hours, as soon as my phone ringin’\nCan't fuck with you or your mans, I heard that you was both singin’, so\nPrivate location, can't see me\nEuropean bitch always askin' for the wi-fi\nTold that bitch to shake it fast like I was Lil Weezy\nAnd she baby father, bitch, you know you wanna be me\n\n[Chorus]\nTold that bitch like, \"Hold up, short, where you goin'?\"\nBitch, come pull up and show me some, show me some\nTold that bitch like, \"Hold up, shorty, where you goin’?\"\nBitch, come pull up and show me some, show me some\nWith my niggas countin' paper just like usual\nAye, just like usual, woah, aye, just like usual\nWith my niggas countin' paper just like usual\nAye, countin' paper just like usual", "album": "Is He Dead Yet?", "year": "2018-09-11", "title": "Usual", "image": "https://images.genius.com/4bdd73552c7ea43afbaed1d93ed35818.1000x1000x1.jpg"}], "artist": "Da$H"}