{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/fed8facbaf87daaa9c461566cd84b113.425x425x1.jpg", "year": "2017-08-09", "album": "I’m So Anonymous ", "lyrics": "[Intro]\nThe reason why black people are so addicted to materialism is, we use materialism to vicariously add wealth to ourselves\nIn other words, I don't think much of me. I ain't nobody. But if I put these Air Jordans on, I will be\nIf I buy this house in a white suburb, I will be. You understand? If I get this white woman, I will be\nIf I get this Louis Vuitton bag, I will be. So, we use wealth to replace self-worth\n\n[Verse 1]\n'Kay, some may think I'm insane. Just a sprinkle of brain\nI'm on the brink of a change. Clearly the underdog, but the dude is winning\nI'm onto new beginnings. Race and just choose your engine\nAnd living confused with sinning\nI done got some problems. Trying to save this Gotham\nNiggas robbing and killing, but it's up to me to stop them\nBut it drives me insane. Niggas grimy and slimy\nSo find me a change. I'd rather buy me a Range\nBut I've been removed from popping tags. I'd rather cop a Jag\nDamn, can't stop the swag. Open gates, lock 'em back\nGot us all in prison. Income from writtens\nFlow is so persistent, but the fame got me tripping\nI done moved past the shoes, bags, the waves and do' rags\nYour wave is due past. It's over, was too dragged\nNever on a newcast in cars that move fast\nSave up, don't lose cash to working for two sacks\n\n[Hook]\n'Cause we all about the guala. Trying to get the dollars\nDesigner clothes, lot of hoes, Gucci collar\nNever been fronting. All come from nothing\nGetting them checks, you expect I'm stunting\n'Cause we all about the guala. Trying to get the dollars\nDesigner clothes, lot of hoes, Gucci collar\nNever been fronting. All come from nothing\nGetting them checks, you expect I'm stunting\n\n[Verse 2]\nI dreamed of earning mega millions, least a hundred or two\nPenthouse apartment with just a wonderful view\nCameras flashing, paparazzi always front of the news\nGold chains and lots of Jordans, I'll have bundles to choose\nI want diamonds and watches and straight shining on carpet\nAnd my Bugatti, I park it. Issey Miyake my closet\nAnd this money that I'm making, I'm gon' show it off\nOdd are, couple years, I'm gon' blow it all\nCan't resist the urge to spend. My problems are worsening\nI'm going to church to sin. Please close the curtaining\nYour whole life's been open, explain the pipe you're smoking\nPlus, like the pills you're popping, the way to deal has got 'em\nStraight up going insane. It ain't flowing the same\nIt seems like y'all start to change with the hoes and the fame\n'Cause a nigga got some dollars, gotta change up my homies\nStraight become a new person, while forgetting the old me\n\n[Hook]\n'Cause we all about the guala. Trying to get the dollars\nDesigner clothes, lot of hoes, Gucci collar\nNever been fronting. All come from nothing\nGetting them checks, you expect I'm stunting\n'Cause we all about the guala. Trying to get the dollars\nDesigner clothes, lot of hoes, Gucci collar\nNever been fronting. All come from nothing\nGetting them checks, you expect I'm stunting\n\n[Verse 3]\nFuck family, fuck friends. All I want is designer\nFuck a peace of mind and conscience with my leather recliner\nFuck attention and a Grammy, all I want is the dollars\nFuck being a role model, all I want is the sponsors\nSad that I sold my soul for money, the hoes and gold\nI'm stressed and blowing dope because the Holy Ghost\nMade the wrong decision, like the longest living\nBut got the strongest vision, clouded by thongs on women\nBut I know all these vices. Gotta stay enlightened\nWith the fame, I won't change. I'mma beat it, I'mma fight it\nBlowing up the first year, talking 'bout the birth year\nBecoming what I hate, a false prophet, that's my worst fear\n\n[Hook]\n'Cause we all about the guala. Trying to get the dollars\nDesigner clothes, lot of hoes, Gucci collar\nNever been fronting. All come from nothing\nGetting them checks, you expect I'm stunting\n'Cause we all about the guala. Trying to get the dollars\nDesigner clothes, lot of hoes, Gucci collar\nNever been fronting. All come from nothing\nGetting them checks, you expect I'm stunting\n\n[Outro]\nNigga, you just wait 'til I come up, nigga\nY'all- Y'all think I'm playing, like it's a joke or something?\nWhen you see me come around in that Bentley truck and I'm fucking shit up\nYou're gonna want to ride with me\nWhen you see me step out the car, huh, but let's see how I could run this\nHuh, $500 on my ass\nHuh, 700 on my feet\nUh, these niggas is cheap\nI'm talking V.V.S. down to the motherfucking toe\nI'm talking 'bout motherfucking 6 karat for the pinky ring, nigga", "title": "Price Tags"}]}