{"artist": "Problem", "songs": [{"album": "The Separation", "title": "Made A Mil Before The Summer", "image": "https://s3.amazonaws.com/rapgenius/Problem_The_Separation-front-large.jpg", "lyrics": "[Hook x2]\nI made a mil before the summer\nI made a mil before the summer baby\nI made a mil before the summer\nJust gimme my money I'm smoking with the homies\n\n[Verse 1: Problem]\nSmoking with the homies made a mil before the summer\nBaby I'm a player let me stick it like a drummer\nYou hotter than the summer\nShe ride it and she cum all over my dick\nHo yell out my clique\nDiamond Lane\nY-Y-Yeah that's us\nBlowing Laker purple got me goin' like Buss\nRIP E ho don't ask us\nMy homegirls ride big and I don't mean no bus\nOh my ma-ma, they'll fuck you up\nKnow some niggas babies mamas that'll suck me up\nGot a tour with some niggas like \"fuck he buff\"\nStill punch til his nose swoll as Humpty Hump\nOn ma-ma\n\n[Hook x2]\n\n[Verse 2: Bad Lucc]\nI go, I told her\nOG, please roll it\nOT like OV man I'm so keyed she loaded\nSo beast - can't hold him\nDrinking a SoBe, so cold\nWhen I'm so deep in a OP\nBaby know me, she on it\nOh see, she knowing\nMan I blow trees with the homies\nSo much weed to that boy B\nI could OD at the moment\nMoney heavily on em\nI suggest, eh rest\nTickle on that Nestle\nMake her grab it like a Espy\nCheck me? Never, I be coolin\nRappin out of my mind\nIt's murda inc. and I'm Ja Rulin'\nAll about the game\nI'm in control you kids [?]\nPlus I got the city cracking all the slappin' we be doing\n\n[Hook x2]\n\n[Verse 3: Kent]\nBlack bitch white bones\nFuckin ya baby mama in the Doms at her mom's\nNow leave me alone\nDrop a 4 in a deuce to make my life speed up\nI've fucked every bitch in this club\nThe homie got the burner tucked\nGot Problems and Bad Lucc (What)\nTell yo bitch I used to love her\nEverybody been up in her like the homie back house\nI remember everything bitch, I ain't blacked out\nPay me right now\nPop it pop it make that ass go down\nPull them Vicky Secrets down\nFuck her good make your bitch say ouch\n\n[Hook x2]", "year": "2013-06-13"}]}