{"songs": [{"title": "Too High", "album": "So Hard", "year": "2013-05-22", "image": "https://images.genius.com/701a46350909affbfec12488b53a9b66.500x500x1.jpg", "lyrics": "[Intro]\nWassup, wassup y'all\nLD aka Young Dick\nHad to make a track about smoking weed, man\nEvery rapper got a track about smoking weed so I didn't really have a choice\nBut, I guess I made mine a little bit different is all\nIt's like, it's like, it's like\n\n[Verse 1]\nBlowin something sticky word to pre-cum dicks\nI'm with my team in this bitch, and we all getting lit\nI mean the weed hella loud, like a teenage chick\nAnd we been smoking for a minute, yeah we blowin on that ganja\nAnd now I'm huffin and puffin, I'm choking on that bong\nAnd the dope I'm on is bomb I'm smoking that Vietcong\nGetting real high\nWatching funny videos of Bill Nye\nTell me that this jam isn't still fly --\n\n[Skit]\n[Bill Nye theme song playing in the background]\n\"Ayo, check this out... hahahaha...\"\n\"Oh, my god... I forgot all about this shit\nThis shit is fucking crazy... hahahaha...\"\n\"Holy shit..!\nWow, I'm like, uncomfortably high...\"\n\nNow I'm getting hungry than a muthafucka\nPut some chicken nuggets in the oven at 400\nWhere'd I put that honey mustard\nLookin all around the cupboard for that muthafucka\nUntil I discovered a custard, I covered wit butter from last week\nHow long do them thangs keep?\nGuess I better ask Jeeves\nGo get ma computer but I'm staring at the damn screen (wow)\nDamn D, you forgetting what ya task be\nThe puff puff pass, gotcha gassed\nNow ya man is fucked\n\n[Chorus]\nAnd I was tryna get a little buzz, so I took a little puff\nBut I think I'm way too high\nAnd I ain't wanna come off like a bitch, so I took another hit\nBut I think ma brains too fried\nAnd yeah I'm fuckin faded but I hate it\nI'm praying that I make it\nAfraid I'm goin to dieeeee\nI'm too blazed, it's too late\nTo save Dicky from this fuckin place, cause he too high\n\n[Verse 2]\nNow I'm freakin out up in this bitch\nCan't control it and ma homies passin round another spliff\nSo I bolted to the BR\nConsulted with the mirror\nLil Dicky please step up, you pathetic\nCause the weed in you beating you\nThen all a sudden I'm on the toilet beating ma penis blue\nBut I ain't cummin because as I'm imagining fucking something\nThat pretty girl I'm humping\nBecoming my fuckin cousin, or mother or brother\nOr some other fucking disgusting person\nMa brain is bein strange, cause I'm high as a plane\nI ain't deranged, I'm just saying it's a violent strain\nSo I go back to the back where they packing up cigars\nDipping snacks, kicking back, staring at some Avatars\nThen I flipped, took a decade and a half to make that shit\nYet they couldn't put a second and a half up in that script\nHow the fuck a human being wanna fuck a\nBlueish green 7' 3'' tail having ass thing\nMan I'm high as fuck\n\n[Chorus]\nAnd I was tryna get a little buzz, so I took a little puff\nBut I think I'm way too high\nAnd I ain't wanna come off like a bitch, so I took another hit\nBut I think ma brains too fried\nAnd yeah I'm fuckin faded but I hate it\nI'm praying that I make it\nAfraid I'm goin to dieeeee\nI'm too blazed, it's too late\nTo save Dicky from this fuckin place, cause he too high\n\n\n[Verse 3]\nRock hard cock, cause I'm watching Katy Perry\nAnd in her video the whole world's made of candy (wow)\nDamn, I ain't even got no candy\nSo now I'm at the fucking C store\nWhere ya man be torn than a mafucka\nPeanut m&m's or a Twix\nCan't commit, so I count the benefits on ma hands\nGoddamn now I'm weary of the man -- yeah the cashier\nHomeland, Nazir!\nS-s-s-so damn tweaked I can't even cross the mothafuckin street\nGotta wait until that muthafucka's green\nNow I'm back up at the crib, and I'm laughin at giraffes long necks\nGotta shit, but the path to the bathroom is complex\nCrafted a long text, took about an hour\nTook a scary shower, now I'm sitting naked on the ground\nMan I'm fucked up. I'm bout to call ma mom up and tell her what's up\nThis sucks I'm high as fuck\n\n[Chorus]\nAnd I was tryna get a little buzz, so I took a little puff\nBut I think I'm way too high\nAnd I ain't wanna come off like a bitch, so I took another hit\nBut I think ma brains too fried\nAnd yeah I'm fuckin faded but I hate it\nI'm praying that I make it\nAfraid I'm goin to dieeeee\nI'm too blazed, it's too late\nTo save Dicky from this fuckin place, cause he too high\n\n[Outro]\nOh my god\nThis shit is not fun, man\nI can't stop thinkin' 'bout weird ass shit\nWatching Lady Gaga\nI can't stop thinking about who the fuck Alejandro is\nWho the fuck is he?\nJerking off, I came during the position change\nLike, in the porn, like when they was chaning positions, I came\nAin't nothing worse than that\nNothing worse than that shit, everybody knows that\nAye, but like, I've been thinking 'bout like\nWhen the sun goes behind the clouds, what does it do?\nLike, does it smile?\nLike, what does it do, does it show it's dick?\nIt's something to think about\nLike it's doing something, and we can't see it\nSo like, what's it doin? I don't even know like, what it's doing\nBecause, if it's showing it's dick, I'm tryna see that\nI bet the sun got a big ass dick\nAlright, I gotta go to bed\n\nFuck, I forgot about them chicken nuggets from the first verse\nThey still in the oven, damn, probably burnt as shit by now\nI guess I gotta go get them, fire hazard\nGoodnight"}], "artist": "Lil Dicky"}