{"artist": "C-Murder", "songs": [{"title": "They Don’t Really Know You", "album": "Trapped in Crime", "year": "2000-09-05", "image": "https://images.genius.com/415d3692989ebe9e5966bfe9f80905c3.500x500x1.jpg", "lyrics": "[Intro: Master P]\nYo C, that's where your boo stay at?\nOh they ballin' like that huh?\nWhat they think about you fool?\n\n[Chorus: Erica Foxx]\nBoy they don't really know you, like I really know you\nI don't care what they say\nBoy they don't really know you, like I really know you\nI don't care what they say\n\n[Erica Foxx]\nI'm down with you, 'til the end boy\nWhen the strugglin', hustlin', thuggin', lovin'\nSo I ain't trippin' on what they sayin'\nAbout you, cause I got you, even if your creepin'\n\n[Chorus]\n\n[C-Murder]\nIt's like one plus one, equals me and you, boo\nI know you forever TRU by the things you do\nNot only would you ride, die, and cry for me\nYou'll even take my charge, kiss your baby bye for me\nNow that's love, that unconditinal kind\nIf we broke up, or you throw up, you might lose your mind\nYou catch me red-handed, with my hands on the goods\nBut you let me slide cause you know I'm straight out the hood\nYou say it's because of all the little things I do\nIf minds only knew the real things we been through\nBut most of all I like the way you be scratching my back\nAnd grabbin' my pillows and pulling the sheets, when you're lovin' me\n\n[Chorus]\n\n[Master P]\nNow you gonna ride with me wodie when times get hard\nNow if my luck change, then we both live large\nTake care of the kids, cause I'll be home in a week\nAnd that diamond bezzle you wanted, it's under the tree\nSix carots, two minks, I'll be bringing with me\nThem ?? get out cause I'm ready to flee\nSee I like a thug girl that's gonna keep it real\nAnd when the cops pull us over, she's gonna hide that steel\nAnd my boonapalist post bail when a soldier be down\nAnd she even hit a lick, just to keep me 'round\nMy little boo don't even trip when they be wanting her man\nCause when she go shopping, is it you and a friend\nTattooed my name on her back cause she loved a thug\nAnd before we go hustlin', it be kisses and hugs\nAnd don't mess with no scrub, cause she love that bud\nAnd there ain't no limit to this ghetto love, ya heard me?\n\n[Chorus]"}]}