{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "Brooklyn Bounce", "lyrics": "[Daddy-O]\nI'm comin with the bomb, so watch me begin to explode\nAnd unload - like the Grand Funk Railroad\nNon-stop, like a Vette with a soft top\nIt's ninety-three and I'm comin for my props\nAnd what better way than to bounce?\nSo you can get paid by the pound; and more for the funkin ounce\nIt's the Brooklyn sway\nAnd as I let the music play I wouldn't have it any other way\nAnd if it sounds like somethin you heard before\nIt's all the more reason to get on the dance floor\nAnd rock with the play by play I announce\nOf the Brooklyn Bounce\n\nChorus: {samples}\n\n\"This is the way..\"\t\"Brooklyn Bounce!\"\n[vocoder] Brooklyn Bounce\n[Daddy-O] C'mon!  This is the way, \"Brooklyn Bounce!\"\n[vocoder] Brooklyn Bowwwouuunce\n\"This is the way..\"\t\"Brooklyn Bounce!\"\n[vocoder] Brooklyn Bounce!\n[Daddy-O] C'mon!  This is the way, \"Brooklyn Bounce!\"\n[vocoder] Brooklyn Bowwwouuuouuunce\n\n[Daddy-O]\nI confess, to bein strung out on the funk\nSteamin up my trunk like a tank full of skunk\nBlowin down doors like a big bad wolf\nAnd like a magician says POOF!\nYou see me dissapearin deep in the bush\nCrushin all cave-men; without an Operation PUSH\nBut with the skills that the people call mad fat\nAs I stalk like a saber-tooth cat\nWith the sway, that makes you say\n\"Hey - Daddy-O's out of school today\"\nAnd yeah I'm comin out to play\nWith them hydrogen bombs and shit\nIgnitin MC's like the World Trade got hit\nAnd if it sounds like somethin you heard before\nIt's all the more reason to get on the dance floor\nAnd rock with the play by play I announce\nOf the Brooklyn Bounce\n\nChorus + minor variations\n\n[Daddy-O]\nAnd I remember fightin fair with your fists in a fight\nBut now I got a mac-one-one in the case with my mic\nCause it's best to be safe than sorry kid\nForget the funeral, I'll take the murder bid\nAnd make beats from inside like Slick Rick\nMight even do a duet, now that's some other shit\nBut I gotta keep bouncin, that's my style\nSo the Brooklyn crew can get buckwild\nAnd start treadin the party and lookin for vic's\nWe see a lot of 'em - so who is gonna be my pick?\nTight red dress, or will I make it tight black\nHave I seen you before - I say with no slack\nAnd if it sounds like somethin she heard before\nIt's all the more reason to get on the dance floor\nAnd rock with the play by play I announce\nOf the Brooklyn Bounce\n\nChorus w/o Daddy-O (2X)\n\n\"Go.. Brook-lyn!\" (16X)", "year": null}], "artist": "Daddy-O"}