{"artist": "AWOL One", "songs": [{"title": "Revolution", "image": "https://images.genius.com/3ffc5ccd8b7cc7bbc1d2efab4c88c3ce.640x640x1.jpg", "album": "Souldoubt", "lyrics": "(Verse one)\nHeaven must be missing an angel\nOr the devil counted one demon short\nKnock knock who's there. Nobody, go to hell\nPeople go away. Don't bother me today\nThe statue of libertys mouth is three feet wide\nThe earth will open up and swallow everyone inside\nBut my band will break up just to have a reunion tour\nBut only if the crowd wants more\nI get drunk and make beautiful things fight each other\nI get drunk I make pretty things get ugly\nI make dead things come alive and die twice\nSo precise\nEveryone's worried about saying something they'll regret\nBut let me out of this ugly shell and represent\nI've grown out of my physical presence\nI never let people know my real emotions\nNow are you part of a musical revolution?\nI can drink my way out of an ocean\n\n(Chorus)\nLiquid love, baby, never cheat on me\nLet me watch you dance\nLiquid love, baby, looks like a bottle\nLet me watch you dance your way to my liver\n(2x)\n\nDon't be afraid to admit your down falls\nWe all got 'em and I think that I've got 'em all\nIt was my homie that I used to hit trees with back in the day\nLets get some beer that's all that we say\nI have more dirt on you than you have on me\nGive me a shot and put it on my tab\nA picture is worth a thousand words mad\nA thousand words is only worth a memory\nDon't do stupid stuff just to get attention\nLike the other suckers with fake addictions\nDon't be the leader of my fan club\nAt the Walrus One convention\nAppreciate 2 o'clock and all of its lessons\nShe wants to meet a man and squeeze out his kids\nBut downing Colt 45's that's all he ever did\nYou will never amount to nothing\n\n(Chorus)\nLet me watch you dance\nLiquid love\n\n(Verse one again)\nI'm always woried worried about saying things I'll regret\nBut let me out of this ugly shell and represent\nI've grown out of my physical presence\nI never let people know my real emotions\nYou are now part of a musical revolution\nI can drink my way out of an ocean\n\n(Chorus)", "year": null}]}