{"artist": "Ice Cube", "songs": [{"title": "I Wanna Kill Sam", "lyrics": "[Intro]\nThe army is the only way out for a young black teenager\nWe'll provide you with housing\nWe'll provide you with education\nWe'll provide you with everything you need to survive in life\nWe'll help you to be the best soldier in the U.S. of A\nBecause we do more before 7 A.M than most niggers do in their whole lifetime\n\n[Bridge]\nI'm comin!, I'm comin!\nI'm comin!, I'm comin!\n\n[Verse 1]\nI wanna kill him, cause he tried to play me like the trick\nBut you see, I'm the wrong nigga to fuck with\nI got the A to the motherfuckin K, and it's ready to rip\nSlapped in my banana clip\nAnd I'm lookin'\nIs he in Watts, Oakland, Philly or Brooklyn?\nIt seems like he got the whole country behind him\nSo it's sort of hard to find him\nBut when I do, gotta put my gat in his mouth\nPump seventeen rounds make his brains hang out\nCause the shit he did was uncalled for\nTried to fuck a brother up the ass like a small whore\nAnd that shit ain't fly\nSo now I'm settin up, the ultimate drive-by\nAnd when you hear this shit\nIt make the world say \"DAMN!\", \"I wanna kill Sam.\"\n\n\"Do the niggas run this moth-er-fuck-er?\" (repeat 2X)\n\n{​​​​​​​​​​​​​​​​​​​​​​*door knocking*}​​​​​​​​​​​​​​​​​​​​​​\n\"Momma! Some man at the front do'!\"\n\"Sit yo' ass down.\"\n\"Uh hi, I have reason to believe that someone in this household has just turned eighteen, am I correct?\"\n\n[Verse Two]\nHere's why I wanna kill the punk\nCause he tried to take a motherfuckin' chunk of the funk\nHe came to my house, I let 'em bail in\nCause he said he was down with the LM\nHe gave up a little dap\nThen turned around, and pulled out a gat\nI knew it was a caper\nI said, \"Please don't kill my mother\", so he raped her\nTied me up, took me outside\nAnd I was thrown in a big truck\nAnd it was packed like sardines\nFull of niggas, who fell for the same scheme\nTook us to a place and made us work\nAll day and we couldn't have shit to say\nBroke up the families forever\nAnd to this day black folks can't stick together\nAnd it's odd\nBroke us down, made us pray - to his God\nAnd when I think about it\nIt make me say \"DAMN! ...I wanna kill Sam.\"\n\n\"I'm comin'!\" (repeat 3X)\n\n[Verse Three]\nNow in ninety one, he wanna tax me\nI remember, the son of a bitch used to axe me\nAnd hang me by a rope till my neck snapped\nNow the sneaky motherfucker wanna ban rap\nAnd put me under dirt or concrete\nBut God, can see through a white sheet\nCause you the devil in drag\nYou can burn your cross well I'll burn your flag\nTry to give me the HIV\nSo I can stop makin babies like me\nAnd you're givin' dope to my people chump\nJust wait till we get over that hump\nCause yo' ass is grass cause I'ma blast\nCan't bury rap, like you buried jazz\nCause we stopped bein' whores, stop doin' floors\nSo bitch you can fight your own wars\nSo if you see a man in red white and blue\nGettin' chased by the Lench Mob crew\nIt's a man who deserves to buckle\nI wanna kill Sam cause he ain't my motherfuckin Uncle!\n\n\"We've gone nowhere in 200 years?\" \"That's correct.\"\n\"We-we-we've gone nowhere in 200 years?\" \"That's correct.\"\n\"We-we-we've gone nowhere in 200 years?\" \"That's correct.\"", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg", "album": "Death Certificate", "year": "1991-10-29"}]}