{"artist": "Boondox", "songs": [{"album": "Krimson Creek", "title": "Straight Out the Crops", "year": "2008-05-13", "lyrics": "Straight out the crops\nStraight out the crops\nStraight out the crops\nStraight out the stix\nStraight out the stix\nStraight out the stix\nStraight out the stix\nStraight out the crops\nStraight out the crops\nStraight out the crops\nStraight out the stix\nStraight out the stix\nStraight out the stix\nStraight out the stix\n\nWho it be? The doc?s comin straight from the crops\nI?m thinking switches for these bitches as dirtay as Woodstock\nAnd when I chop, the shock goes straight up your vertabrate\nThey pickin at yo bones, and at your watch just like a bird of prey\nA sick son of a bitch call me the scarecrow\nA face-painted doll, the Blair-witch with a foe foe\nAnd I stay on the prow, my nose like a blood hound\nStraight stalking muther fucker showing this how it goes down\nThis sight of blood it gets me higher than an astronaut\nA backwoods monster shot gutted a master plot\nTo burn yo cities and murder all yo committees\nDo? to Do? slangin lead never showin no pity\nI bring the pain to ya brain though they callin me drama\nChoking at ya neck, with a chain I think ya dead mama\n\nIt ain't da same since the sane went insane mama\nTime to show these haters how to play da fucking game mama\n\n[Chorus x2]\nStraight out the crops I won?t stop ima POP! POP! POP!, until they all drop\nStraight out the stix I won't quit, I know you feeling this shit, you must be feelin this shit. YEAH!\n\nI comin? straight out da stix, and all da shit dat I spit\nIt be as dirty as a gathering of 2006\nAnd yea I grip like a tee write the words of these pricks\nWho all hatein throwin away because they say im a hit\nBut I ain't apologizing, hell no I say fuck em\nAfter sunning with a hatchet then these hoes ain't doin nuthin\nSo just quit of all ya?ll frontin and then get down on yo knees\nPray to God dat I don?t find you and then dislocate yo spleen\nCause you never wanna see me bitch jumping out of trees a shear\nWrap my hands around yo throat and send you up to Jesus bitch\nQuick to see ya to ya maker, quicker than the undertaker\nPut you through a shredder and then spread you on a hundred acres\nKeep my name upon your mouth, keep yo ass upon da south\nYa mami ain't raise ya right, ima bout to show her how\nPlease don?t make me fetch da steel, make this cap an extra pill\nPop you like a cherry mutha fucka never test my will\n\n[Chorus x2 until song ends]", "image": "https://images.genius.com/880085d49aff9217e77dc1187f030306.500x500x1.jpg"}]}