{"songs": [{"year": "2014-06-13", "album": null, "image": "https://images.genius.com/214f4cc51eadce650131efd872a18cae.1000x1000x1.jpg", "title": "0 - 100 Freestyle", "lyrics": "[Verse 1]\nThey be on that rap to pay the bill shit\nGot a couple partners on the trap to pay the bill shit\nI Am Legend, Will Smith\nYou worry about that lil’ shit\nYou shop at the mall, and buying fake J’s, these real kicks\nConstruction work, we built this\nYou can’t even fit my shoes yet, you a size 6\nMy partners dominate the block, Shaquille O’Neal shit\nI’m real sick of people saying all I rap about is tacos, nachos, shut up lil’ bitch\nBut until then rap game adopted me, Matilda\nI ain’t with the girl drama, no Jerry Springer\nAt the street grindin’, tryna make it bigger\nThey say, “You a rapper? You look more just like a singer”\nBut nah homie I’m spitting facts, I’m spitting crack, I’m chasing racks\nAnd my suits be tailored, I can play in Men in Black\nLet them migos go to Mexico, they bringing plenty back\nGot the CD on my back, like a piggy bank\nAnd my calendar is full, like and almanac\nIf the call drop, nah I ain’t gon’ call her back\nMexico throw back, look like I play up in a soccer match\nEverything I do they try to copy that, ey 10 – 4, copy that\nTryna’ make it out, we tryna’ live there where the Cosby’s at\nWe ain’t getting money, ooh stop with that\nWho she bang (bang), ooh she [?] that\nSouth side, where I be at ooo\nAnd my migos’, they do not follow the rules\nI’m just really tryna’ be 22, pulling up in 22’s, oo, oo, oo\nEy (brr, brr, brr,) ey that’s the bird call real shit\nMy migos; they just tryna’ see Hulks wrestle Wilson\nAlways be ready cause’ this shit can happen real quick\nYou lookin’ for a real man? Well I’m lookin’ for a real bitch\nMy studio a Lamborghini body, hit the kill switch\nMy girl got on all yellow, she be on that kill bill shit\nIts levels to this shit man, I be on that Meek Mill shit\nEven paralyzed mother-fuckers, they can feel this\nNo disrespect, but my bad that’s a metaphor\nI might go to Ecuador, Got money in my bottom drawer\nYour [?] you need [?] more\nAnd I stay with money, like Ryan Lewis yeah be with Macklemore\nAnd baby I ain’t with the arguing back and forth\nFor a round draft pick, I’ll make a [?]\nTryna’ get a set of Ray Lewis, yeah I tackle more\nPeople just keep telling me, and that’s why you were chosen for\nAnd you gon’ get your first check and you gon’ blow it on a Michael Kors\nAnd ima get my first check, and blow it on my auntie first\nSo she can get up out that place, so she can get her papers first oo\nYou ain’t know? And how the fuck in Mexico\nBut they still movin’ snow (but they still movin’ snow)\nWhy? Cause its poor! Why you think they do it for?\n\n\n[Bridge]\nI go 0 to a hundred migo real quick\n0 to a hundred migo real quick, real shit\n0 to a hundred migo real quick\nI go 0 to a hundred migo real quick, real shit\n0 to a hundred migo real quick\nI go 0 to a hundred migo real quick, real shit\n0 to a hundred migo real quick (vato, vato, vato)\nI go 0 to a hundred migo real quick\n\n\n[Verse 2]\nI go 0 to a hundred migo real quick\nFresh Prince, R.I.P to Uncle Phil yea\nReally I’m a Fresh King, and the top missing\nAnd mi Madre told me, “go ahead and kill this”\nAll my vatos on that real shit (whole squad on that real shit)\nWhole squad on that real shit\nThe other night my brother told me I’m like Jesus\nIn the bible it say he gon’ resurrect and I’m the closest to it yet, just look at me\nI’m like living proof, and I got stuff to do, and I got stuff to prove\nI’m worried about money, you worried about honeys like Winnie the Pooh\nAnd I be hustling every day, I can’t go on a cruise\nMy FAM relying on me man, this shit a lot to lose\nAnd my vatos they keep Coronas, they drink lots of booze\nI got a model ass flat, like some inner tubes\nBut keep a stripper ass fatter than [?]\nOo, oo, oo, oo\nWasn’t with me from the bottom, don’t know you\nStill the same migo, riding Honda 02’\nI’m like dark rivers, come on baby let me coach you\nUsed to leave me hanging, like a coat too\nThat’s why I turn up in the club, super saiyan, Goku\nAnd I got some engineers, and they stay with the [?]\nGirl just hit my phone, and ima roll thru\n\n\n[Outro]\nWhole squad on that real shit (Kap Fe)\nWhole squad on that real shit\nWhole squad on that real shit"}], "artist": "Kap G"}