{"songs": [{"year": "2010-12-17", "album": "G.O.O.D. Fridays", "image": "https://images.rapgenius.com/87b5f38974f52c9b688628167a4500ca.580x580x1.png", "title": "Christmas in Harlem (G.O.O.D. Fridays Version)", "lyrics": "[Produced by Hit-Boy]\n\n[Chorus: Teyana Taylor]\nChristmas in Harlem\nRight after autumn falls\nSoakin' it all in\nThen we go hit the mall\nEven though we ain't ballin'\nFeels like we bought it all\nThe mistletoe's right here\nCome give a kiss to Santa Claus\n\n[Verse 1: Kanye West]\nMerry Christmas to all, and all a good night\nHuh, now we all livin' the good life\nYeah, though it's forty below the wind chill\nAnd we wipin' snow up off the windshield\nIt's still wonderful night to be alive, baby\nAnd I'm so happy I'm with my baby\nAnd we a little late with the Christmas gifts\nRushin' for the mall, don't trip, you know I drive crazy\nThe streets lit up, it feel like Christmas officially\nTold her that \"You the star at the top of my Christmas tree\"\nMy only question is, \"Where my presents?\"\nShe said, \"Shhh,\" she got a gift for me that ain't for the kids to see\nWell, I like the way you think, mami\nNow pour some more eggnog in your drink, mami\nYou've been a bad girl, give Santa three kisses\nGave her the hot chocolate, she said, \"It's Dee-ricious\"\nHahahaha, yeah\n\n[Chorus: Teyana Taylor & Kanye West]\nChristmas in Harlem\nRight after autumn falls (Uh, uh)\nSoakin' it all in\nThen we go hit the mall (I'm like Bad Santa though)\nEven though we ain't ballin' (Somebody sit on my lap)\nFeels like we bought it all\nThe mistletoe's right here\nCome give a kiss to Santa Claus\n\n[Verse 2: Vado]\nMerry Xmas, Santa Claus cherry X6\nThey ain't hear my rain, dear, make it snow on the next chick (Yes)\nGot enough toys, wonderin' what's my next pick\nBefore my exit, it get diamond Rolex reckless (Huh)\nBig bags, got everything on the checklist\nNecklace, baguette wrist (Uh-huh)\nPockets fat, they precious (Uh-huh)\nGive Ma a peck kiss, look and tell her she precious (Mwah)\nLightin' up the sour, this tree give me the best gifts (Vado)\n\n[Verse 3: Jim Jones]\nAnd I remember when I couldn't play Santa Claus (Uh)\nNo reindeers, just horses and a Panamera Porsche (Vroom-vroom)\nWe on two fifth shoppin', what the damage cost? (At most?)\nI got your fam while you biddin' in the can up north (I got you)\nWhoops, I'm at Neimans, I hope they still got em (Word)\nYou want the thigh-high spikes with the red bottoms (Size 37)\nErr, let's make a toast 'cause Christ is born\nWe gon' party all night 'til the lights come on (Amen)\n\n[Chorus: Teyana Taylor]\nChristmas in Harlem\nRight after autumn falls\nSoakin' it all in\nThen we go hit the mall\nEven though we ain't ballin'\nFeels like we bought it all\nThe mistletoe's right here\nCome give a kiss to Santa Claus\n\n[Verse 4: Cyhi the Prynce]\nYeah, Mom and Dad, I won't be home for the holidays\nHa, I'm over 800 miles away\nIn the city that's so pretty\nWhere the hustlers dash through the snow without a sleigh\nTell my family that I'm sorry that I gotta stay\nI'm with Ye at the Macy Day Parade\nLettin' the snow fall on my aviator shades\nEven though I'm in New York, I'm still reppin' for the A\nCyhi!\n\n[Chorus: Teyana Taylor & Pusha T]\nChristmas in Harlem\nRight after autumn falls\nSoakin' it all in\nThen we go hit the mall\nEven though we ain't ballin'\nFeels like we bought it all (Yes, it's G.O.O.D. Music, y'all)\nThe mistletoe's right here (Check it, uh, uh)\nCome give a kiss to Santa Claus\n\n[Verse 5: Pusha T]\nOn the stoop of that Brownstone, shovellin' the brownstone\nSanta's on a diet, gotta get the pounds gone\nDowntown got me feelin' like it's Dow Jones\nBut uptown got me feelin' like its down home\nSnow like sugar hill, chains on wheels\nWe turn our two doors into snowmobiles\nWe got our own style, no Soho feel\nPut on your play clothes, how that logo feel?\n\n[Verse 6: Big Sean]\nOh, pose for them photo stills\nYou don't wanna miss a moment, where's your NoDoz pills?\nI caught her lookin' at my Rollie as my mojo spills\nSnowflakey on the bezel, hope you know those real\nOkay, my white girl Veronica, black girl Monica\nGot me celebrating ChristmaHanuKwanzaakah\nRock-rock-rock-rock-rock-rock-rockin' dashikis with a yarmulke\nWhere the Christmas tree at? Let's design it up\n\n[Chorus: Teyana Taylor]\nChristmas in Harlem\nRight after autumn falls\nSoakin' it all in\nThen we go hit the mall\nEven though we ain't ballin'\nFeels like we bought it all\nThe mistletoe's right here\nCome give a kiss to Santa Claus\n\n[Verse 7: Cam'ron]\nUh, Lenox Ave to Saint Nick, never seen Saint Nick (Nah)\nJust niggas sellin' the same nicks, the same bricks (What up, y'all?)\nSame hustlers running' up to Broadway\nThat's where the snow's at, taste it, foreplay\nNo turkey or greens, just Jimbo's (Jimbo's)\nChristmas lights in project windows (Yes)\nShouts to the coldest on my barometer\nBerkman, Shapiro, Kalina, Hanukkah (My lawyers)\n\n[Verse 8: Teyana Taylor & Musiq Soulchild]\nAll the flashin' lights up on a tree\nThe house lit up nice\nWith your family is where you wanna be\nHere on Christmas night\nWhen you wake up and you see the gifts\nDon't that make you feel good?\nSo since we all snowed in in Harlem\nLet's have Christmas in the hood\n\n[Verse 9: Teyana Taylor]\nAll of the flashin' lights\nYeah, them things shine so bright\nAlways for you and me\nBaby, you're Christmas Eve\nIf you like what you see\nWon't you come sit on my knee?\nAnd tell me everything that you want\n'Cause, baby, I'm your Santa Claus, yeah\n\n[Chorus: Teyana Taylor]\nChristmas in Harlem\nRight after autumn falls\nSoakin' it all in\nThen we go hit the mall\nEven though we ain't ballin'\nFeels like we bought it all\nThe mistletoe's right here\nCome give a kiss to Santa Claus"}], "artist": "Kanye West"}