{"songs": [{"lyrics": "Yeah, say what\nNow how the god damn pot go and call the kettle black? that bull shit\nYo, but this ain't though\nChapter 7, Verse 1, Attention\n\n[Hook]\n\nAll Balls Don't Bounce, some balls roll and some balls hang\nAnd some people have a ball doin' they thang\nNow what's the result? Your life is biased\nAll one-sided surrounded by liars\n\nTrials and tribs\nIt's all ad-libs, and all breakin' you a coupla ribs\nNow what if I breaks the tail on the lizard\nIs it gonna grow back?\nIt is and you know that\nBut that ain't the case\nI picture the place\nI capture a kodak and show dat face\nYou're just a shit stain on the draws of life\nAnd the trials of life, and the styles of life\nYou won't be happy 'till you lost your life\nOr lose your mind, or die of boredom\nOr try to kill 'em all and let your God sort 'em\nBetter earn your keep, and learn to leap\nOr burn in your sleep\nTryin' to get a little somethin, yo I peep\nYou bein devoted, but you shoulda let it seep thru the mask you sported\n\n[With Hook in background]\nYou ended up a swiggler caught in a swiggle\nJust gimme the signal\nAnd I'll state the terms\nAs long as I can be there with fate to change\nYou smokin sherm\nOr whatever the name, you're a trivial part in a trivia game\nNow what's your aim? a presidential campaign\nLike Ross Perot, he lost it though\nBut he got a billion in da bank for show\nOh me I'm po' and you like me\nBut I don't like you, nigga you all fronts\nAnd I won't let one apple spoil the bunch\nNow get yo' hat & get yo' coat\nAll afloat, we goin' back to the real\nI got a question, answer me this\nWhat if me and you got caught in a twist\nAnd you accidentally got caught by the fist\nWhat's the gist, or what's the justice\nOr better yet what if I had got busted\nFor tryin to go out like General Custer\nWell kiss yo' family, meet me at the juncture\nBetter have a little bit a acupuncture\nI reckon that you gonna have to smoke another bongload to get you enough\nTo open your mouth\nBecause I doubt that you know what it's really about\n\n[Hook]\n\nHeard you keep your jewels in a safe\nThat ain't safe with a $10 locket\nI keep mines in between my front pockets\nCause I'm a darkie and they want me\nCastrated, assassinated, well here's your merit\nBetter wear it\nWith pride, just don't get all mushy inside\nAnd don't get pushy\nOr wishy washy, your heart is squishy\nWhen it should be strong, your tail is bushy\nWhen you shouldn't even have one\nDo you want another big hit of the bong?\nAll Balls Don't Bounce, now you wanna get indignant\nShow your stupidity and act all ig'nant\nNow you got pigment, so you my kin\nIt's like the hand it's still on ice\nSo you might starve tryin' to carve you a slice\nWith a little brown rice and some black eye peas\nOr 2 black eyes and 2 broke knees\nAnd 2 broke niggas tryin to steal the cheese\nGot family ties, your family's giving\nYour family tries, your family's living\nYour family croaks, dies of a stroke\nAnd that's the end, but then you awoke\nAs a baby again\nSo in your next life you can be squabbler\nAnd eat peach cobbler till you get fat\nYou can even live in a manshion or a wigwam\nJust remember all balls go flat\n\nAll Balls Don't Bounce, All Balls Don't Bounce and the Nonce know\nAll Balls Don't Bounce and Punish know\nAll Balls Don't Bounce and DJ Kilo know\nAll Balls Don't Bounce ....Mikah 9 know\nAll Balls Don't Bounce....Abstract know\nAll Balls Don't Bounce....Fat Jack know\nAll Balls Don't Bounce....????? know\nAll Balls Don't Bounce....CV Shack (????) know\nAll Balls Don't Bounce....Ganjah K know\nAll Balls Don't Bounce....my nigga Jupiter know\nAll Balls Don't Bounce....Volume 10 know\nAll Balls Don't Bounce....????? know\nAll Balls Don't Bounce....????? know\nAll Balls Don't Bounce....Tyrone know\nAll Balls Don't Bounce....The West Coast know\nAll Balls Don't Bounce....The East Coast know\nAll Balls Don't Bounce....The World know\nAll Balls Don't Bounce, All Balls Don't Bounce, All Balls Don't Bounce", "title": "All Balls", "album": "All Balls Don’t Bounce", "image": "https://images.genius.com/0a698560532b7c3e70ca27a9e71bd6e8.948x936x1.jpg", "year": null}], "artist": "Aceyalone"}