{"songs": [{"lyrics": "[Introduction:]\nI'm twice born, once in 7-something\nOnce as the resurrection of honorable function\nBeen shoveling coal as the engine's doctor\nLong enough to see my silhouette acquire a permanent kink in the posture\nThe maintenance of icicle spirit by the warmth of true endearment\nWas, is, and forever will be a luxury\nI'm a sovereignty columnist fathering doom document\nCurséd version of a certain Virgin Mary womb occupant\n\n[Interlude (spoken):]\n(Oh my Lord, what have I gotten myself into?\nSeems like I woke up in yesterday again\nAnother day, another dream…)\n\n[Verse One:]\nI know swamp rats who never suckled oxygen purification\nSure as blurry mayhem had ‘em spent (Zen freeze)\nStuck until my friend leaves, puppet for the plummet committee\nSputtering bum, numb enough to stomach the city\nWho’s that hugging the silhouetted willows where the hill’s crest pan out?\nBarter candy-coated crab apples and sugar-dipped death hand outs\nI got a plan, I'll tourniquet my quest\nThen feed a needle in the bad ending to mute the mess\nWhen patience gallops with absentee ballots, I shove in the button\nStrutting to exhibit mankind’s hostility function with a (heave)\nPaling in comparison to Matthias, Goliath\nLies the rickety frame of the wicked silence\nI died the day my nameless creator and I bumped eyelids\nSwear to Christ we saw the same thing for a second (What’s that?)\nThe grand mosaic depicting historical glory of the legend\nNursed me through the time stick-and-stone mixers hexed my fertile crescent\nNow all's well, I'm laughing on the inside I swear\nJust trying to keep my head above red tide despair\nMy imperfections pair off with buddy system symmetrics morbidly\nSo every second of discontent’s logged accordingly\nNow let’s turn mummy subtle perfection to preserve glory condition\nAnd pray for the day a starchild tugs the ribbon\nBetter land a two-hand grip on that spoonful-of-sugar medical chaser\nCredible crazer antidote's terrible, taste her\nBarter with a Stolen Soul Peddler, pigeon backed feather pen\nNever said a grin implied health\nConsider me a mobile advertisement for that hybrid blend of fabrics I deemed practical\nNow is you is or is you ain’t compatible?\nI feel the wind in my opinions\nPlus hyper clutched to crush one’s gingerbread tenement awful\nIt’s like the day the great oak met the sawmill\nA lifeline of spectacular expansion meets the reaper at the hand of one man’s tantrums\nMy friend’s got a book about dreams. I look and laugh\nI dreamed a book about my friends and still can’t decipher the half\nChatterbox. Now let a soothsayer major cater to a kinked breed\nBattered on the brink of disease\n(Well) I am (skin and bones), I am (sin and poems), I am (tin and chrome)\nGrin and groans, fuck it, I’m tinted quinacridone\nBlow the petals off a dandelion trying to make my little gypsy blush\nAnd felt as if I’d actually accomplished something\nFortify the bullies, let a joke soak in the treatment\nSit and watch the percentages teeter on the evening\nCaught a ghost up in the fuselage seconds before the cog dropped to the sticks\nAnd stared him down until he fixed it\n\nOh, fashion? It’s cool and all, but what about God?\n(Oh God? well he’s the man, but I mean, what about reading?)\nWhat like novels? Man, that don’t hold my attention. How about television?\n(Television hurts my brain. How about walking in the rain?)\nOh I hate walking. It’s boring. How about some old-fashioned gone fishin'?\n(Yeah, fishing’s great, but I just hate hooking the bait. Let’s dance)\nNah, I got two left feet plus motion sickness. How about breakfast?\n(Man I’m hungry, but that means I'mma have to borrow some money)\nLet’s fly a kite. (Let’s burn the generals). Let’s sell lemonade. (Let’s drink)\nLet’s poke a hole inside the tugboat, ease on back, and watch it sink\n(Nah, let’s fail a pupil once a year at random to shake the academy)\nCasually note the blossom of phantom alignment. (Strategy)\n\n[Verse Two]\nWell, I’ll make a waterfall out of water and autumn\nSorta caught ‘em when their guards mimicked the vintage knuckle drag sagged in the coffin\nI affiliate my rag dummy appearance with a most cohesive spirit\nCried a river yesterday, ain’t shed a tear since\n‘Gimmie gimmie’, crooned the Old Yeller community cartoon\nThe carousel ballooned extravagant. Aware\nInviting, yet I’m sworn to adamant manner and saddle in worn head, thorax, and abdomen\nTo primitive horseback galloping\nMy index finger’s dressed in my talisman\nBranded up in the jackal skin, I spy mark of the product\nWell, one must pardon ye old common sheep detour weaving graceful through the prime directive column\nPray the virus retreats to allotted phylum\nBeanstalk with a fiend walk and my name is mud\nBut that’s got a ring to it, so my soil welcomes the flood\nI walk as God’s practical joke on man, practically broke\nAnd if they raise my rent again, I’ll spend my nights practically soaked\nWho spit silk dimension through the noose looped by the rafters?\nAfter lack of reasoning, dead ‘em. (It’s like \"three, two, one, bedlam\")\nOoh, I’m hung. I clung to hope, but see you in hell\nI’ll be that clear blue icicle that simply refused to melt\nSturdy iron grillage, tin can skeleton\nSkull of a thousand dilapidated dream remnants\nHere to convict based on a tin bucket of evidence\nThat stairway to heaven’s merely a legend so the peasants dream well\n\n[Outro]\n(Blesséd peasants, blesséd peasant dream well\nEvery blesséd peasant’s just trying to dream well…)", "title": "Oxygen", "album": "Float", "image": "https://i.genius.com/097177ea52f6ad0147914b68157107a588f47fb2?url=http%3A%2F%2Fwww.mushrecords.com%2Falbum_art_front%2FMH202_D.jpg", "year": "2000-09-05"}], "artist": "Aesop Rock"}