{"songs": [{"image": "https://images.genius.com/a771fd3e611d5c86a13b17b05dbb15f9.500x500x1.jpg", "lyrics": "(Intro + Sample: Curtis Mayfield + Nobody)\n\nI like everything we do, honestly\nI like everything we do, true\n\nYeah du do du do du\nYeah man I’m with the Peacemakers\n\nG Block!\nWoo!\n\n(Verse 1: Nobody)\n\nIf this is by design - every second every step (Yeah) - before I go I hope I get this all off my chest (Yeah)\n\nMan to be honest (Yeah) - most my life I’ve been depressed (Yeah) - inhaling all different kinds of smoke in my chest (Chest)\n\nAlways smoke alone - mostly always in my zone (Yeah) - freedom fighter mode - I’m singing songs about redemption - like a Jedi Knight\n\nI take your soul in the dead of the night - I’m always on a mission vision in the distance (Yeah) - stealth mode lowkey (Yeah)  scooping out the scene\n\nFeels like I’m living out just one of my dreams (man) - be careful what you wish for cause it’s never what it seems - funny what my people do with freedom once they get it\n\nIt’s embedded in my conscious - understand the process - Choose success because it makes more sense (Woo) - I got money on my mind\n\nDoesn’t matter how I get it (Yeah) - always on the grind because it makes more cents (Yeah)\n\n(Chorus + Sample: Curtis Mayfield)\n\nI like (The time is now) everything we do, show me how?\nI like (The Time is now) everything we do nothing less, true\n\nI like (The time is now) everything we do, show me how?\nI like (The Time is now) everything we do Trust, honestly I like nothing less\n\n(Verse 2: Kid Wasabi + Curtis Mayfield)\n\nCooking up another masterpiece\nNiggas getting charged for rape cases I’m on my least\n\nWell fuck a hoe I’m moving at the best\nI’m chopping up the best samples\n\nI hit it up when ever I want too (I like)\nShe pulls down her skirt when she wants too\n\nHit her up at five in the morning it’s going good (I like,I like)\n\nShe replies\nOh shit she’s telling me\n\nI don’t wanna take no L’s\nHope to see your albums on the shelves\n\nBookings high\nApple bongs for the low\nBack to the drawing board\nWe back, back to the drawing board\nBaby girl we back to the drawing board\n\nI hit you up at five and (I like,I like)\nI hit you up at five and\n\nEverything we do\n\n(Chorus + Sample: Curtis Mayfield)\n\nHonestly, I like (so cool)(your so cool) everything (your so cool) we do, honestly\nI like everything we do, true\n\nI like everything we do I like\nI like everything we do, honestly", "title": "Everything We Do", "year": "2019-07-01", "album": null}], "artist": "Unknown Artist"}