{"artist": "E-40", "songs": [{"title": "Do It To Me", "image": "https://images.genius.com/a5f1f8095418f1fd91f86ca97ac169c0.1000x1000x1.jpg", "album": "The Element of Surprise", "year": "1998-08-11", "lyrics": "[E-40] Charlie Hust', Busta Bust', let's do it\n[Busta] Hehehehe, Flipmode, Sic-Wid-It\nYou know what's best for you, you better get widdit\n\n[E-40]\nI heard him talkin, but then he walkin, now tell me why\nThey never been incarcerated in a correctional facility\nFor doin this kinda street chemistry (hell yea)\nI'm an original rapper, retrospected by plenty, hated by people\nMe, 40, we took it back as street soldier\nYou got my back I got your shoulder\nPeas and toes, tryin to make it, it's all oh's\nImpossible is a hit never get caught diggin in my nose\nEx d-boy used to be a big time neighborhood rock star\nAlthough I never owned a gui-tar\nI-uh-I'm lyrically inclined with my start stutter scrilla\nType delivery, 40 and Busta Rhymes, was drinkin\nAnd smockin hickory, on the porch one time\nWhen I came up with this line: I was perkin\nOff of some of that Carlos Rossi wine -- whatcha playa patnah got\nFlows, like a latina female orgasm\nHoes, be yellin and screamin causin contractions at my\nShows, they take off they clothes and throw they pantyhose on stage\nAny appliable age from dookie braids to suki braids, deal widdit\n\n[Chorus]\nDo it to me baby, do it to meeeee!\n(Do it to me baby, do it to me baby)\nJust do anything you want to do to meeeee!\n(We go do it, do it, do it)\nDo it to me baby, do it to meeeee!\n(Do it to me baby, do it to me baby)\n[Busta]\tJust do anything you want to do to me [2X]\n(We go do it, do it, do it)\n\n[Busta Rhymes]\nCheck it out yo\nDo it to me I'ma do it to you\nRubber you glue, bounce off of me I stick it on you\nWeather whatever you could never ever measure my pleasure\nDig in my treasure, be making your lungs cave in together\nBlow smoke out my face, pick up the pace\nSpeed up the race, never let a hot joint go to waste\nMy dogs'll bark when your marksman trespass\nYou better use caution, your body parts might get auctioned\nNo need for you to keep stalkin, HELL but what you talkin\nHave you dusted like a zombie lookin straight Christopher Walken\nShorty tried to call me and warn me and E-40\nAbout these other corny rappers that ain't got nuttin for me\nYou know they all blew it, time to move it\nBlow the spot you knowin how we do it, capitalize\nUpgrade to gold now we platinum-eyes\nKeep my flavor holy sacred and pasteurized, WHAT!\n\n[Chorus]\n\n[Busta Rhymes]\nWe doin this to blow through it til you suffocate, losin your breath\nTil you satisfied, you know we do it to death\nAy you know we do it to keep you flippin, do it for whylin\nDoin it for me to get my hustle on, do it for profilin\nDo it for the love affair because I'm lovin it\nWhen we clubbin all you hear is the live DJ rubbin it\nRunnin it all into the ground, doin it for days\nDo it for money, know I gotta keep my bills paid!\n\n[E-40]\nMy reals be pokin and stickin out like nipples\nThe felines, be lookin at us like we some popsicles\nBusta Rhyzzzimes, and Charlie Hustle, or should I say Fonzarelli\nPoppin they collars and workin they star jelly\nUp in the club, order the one, the party's just begun\nLove, batches outnumber the fellas ten to one push come to\nShove, forgot my gun, but it won't hurt fool\nMy music come up out the woodwork, beatch!\n\n[Chorus w/out Busta (3X to fade)]"}]}