{"songs": [{"title": "Pray For Me", "image": "https://images.genius.com/0d6839530413c8ca4d5d4da399f117ee.640x640x1.jpg", "lyrics": "[Hook]\nSomebody pray for me\n(Bless his, bless his heart)\nSomebody please pray for me\n(Bless his, bless his heart)\nSomebody pray for me\n(Bless his, bless his heart)\nWhat more could you say to me?\n(Bless his, bless his heart)\n\n[Verse 1]\nThe first day of third grade\nTopic of discussion at the kick ball game\nIs who's the new student why he look that way?\nA eight-year-old expert determined I've got AIDS\nA vote must've been taken, it became my name\nI mean literally AIDS is my name okay\nIt made its way around the school and eventually\nI heard a teacher try to catch herself as she yelled it to me\nI tried to be invisible honestly\nWishing that the ground would just open up, swallow me\nWhat kind of crime did I commit for this mockery?\nGuess I must've lost some kind of cosmic lottery\nHow am I processing this at a baby's age?\nIt felt like I had a gut full of razor blades\nI fantasized someone else would come take my place\nBecause they taught me to hate my face\n\n[Hook]\nSomebody please pray for me\n(Bless his, bless his heart)\nSomebody pray for me\n(Bless his, bless his heart)\nSomebody please pray for me\n(Bless his, bless his heart)\nWhat more could you say to me?\n(Bless his, bless his heart)\n\n[Verse 2]\nImagine how my mama felt\nObviously she want to offer me some kind of help\nPretty white lady never probably dealt\nWith this particular type of hell\nIf she dyed my hair blonde maybe I can blend\nGet a better response maybe even a friend\nShe took me to the salon, put chemicals in my head\nWhen they took the towel off, it was purple in the end\nLot of money spent just to get me presentable\nMessage that it sent, the real you ain't acceptable\nI knew what she meant, what else could she expect to do?\nThat was just the lens that she viewed protection though\nAnd so eventually I began to see that\nWhat grows out of me is my dirty little secret\nHad to go back every few weeks to keep it\nI think that part depressed me the deepest\n\n[Hook]\nSomebody please pray for me\n(Bless his, bless his heart)\nSomebody pray for me\n(Bless his, bless his heart)\nSomebody please pray for me\n(Bless his, bless his heart)\nWhat more could you say to me?\n(Bless his, bless his heart)\n\n[Verse 3]\nThank God for the grown ups\nThat roll up when they know it's time to hold us\nThe elder queen showed so much homegrown love\nShe said \"hair doesn't die but your soul does\"\nShe said \"Elvis wore his hair in a pompadour\nSo he could try to look like Muddy Waters more\"\nBut he would fry his crown so that he could lay it down\nLike a white boy they called it a conk before\nUntil James Brown came kicked down the door\nSay it loud, I'm black and I'm proud my boy\nThat's the meaning behind the afros and all\nGet free being what it is that you know you are\nShe said \"Beauty's the splendor of truth\nYou will never cut loose 'til you're suitable to you\nAnd your living is the proof just let it do what it do\nNow watch them follow suit and try to catch up to you\"\n\n[Hook]\nSomebody musta prayed for me\n(Bless his, bless his heart)\nSomebody prayed for me\n(Bless his, bless his heart)\nSomebody musta prayed for me\n(Bless his, bless his heart)\nWhat more could you say to me?\n(Bless his, bless his heart)", "year": "2017-05-05", "album": "All the Beauty in This Whole Life"}], "artist": "Brother Ali"}