{"artist": "Ice Cube", "songs": [{"title": "Cave Bitch", "lyrics": "[Intro: Dr. Khalid Muhammad]\nGive me a black goddess sister I can't resist her. No stringy haired, blonde hair, blue eyed, pale skinned buttermilk complexion. Grafted, recessive, depressive, ironing board backside straight up and straight down. No frills, no thrills, Miss six o'clock, subject to have the itch, mutanoid, caucazoid, white cave bitch...\n\nVerse One: Ice Cube\n\nEase back white bitch, I don't play that\nJust because I got on my L.A. hat\nStalkin' walking in my big black boots\nIs my jingle, now you want Mandingo\nBig, black and handsome\nI should hold your devil ass for ransome\nSorta like Patty Hearst, but I'll burst first bitch\nAnd you know what's worse\nI'm coming from the land where the choppers roam\nSo fuck you bitch and your Coppertone\nStringy hair - no derrier - frontin' and fakin' with your silicone pair\nDo I wanna fuck? Not hardly\nThat's kinda like Barbie fuckin' Bob Marley\nIt ain't gonna happen, I keep rappin'\nMotherfuck Tennille, but see I'm the Captain of this ship\nAnd I'm true to the game\nYa all look the same\nStandin' by my backstage door, hopin' that'll switch\nSpread out you little cave bitch\n\nVerse Two: Ice Cube\n\nWhy everytime we get famous\nYou wanna play us like Andy and Amos?\nThe devil sent you to try and tame us\nBut you can't tame me, with no bitch named Amy\nLookin' for the dark meat\nBut ho, I ain't tryin' to go out like Barkley\nCuz everytime I turn on the TV\nI see several brothers with she-devils\nSmilin' cuz you out on a date\nBut sooner or later, the bitch'll yell rape\nSoon as daddy found out you a jigaboo\nHe'll kill like he did Emmitt Till\nYah, he tried to kick bass\nBut the bitch probably threw it in his face\nSouthern Belle ain't nothin' but a trick\nNasty as hell, stanky little cave bitch\n\nVerse Three:\n\nNow don't think that I hate you\nCuz I won't date you, bitch I gotta stay true\nYou can be a fan, but don't expand\nAnd try to get my dick in your hand\nYou better run to the minute man\nPale as snow, so act like y'know\nCuz if I slap it, flip it, and rub it like that\nYeah, it gotta be black\nPlus yo ass too flat\nI need a butt big enough that can clap\nRat-a-tat-tat\nYou can't get mine ho\nI'd rather fuck an albino\nAtleast I know, she's comin' from the Nubian\nAnd not the Ku Klux Klan that you be in\nAnd I don't give a fuck if your family is rich\nYou're still a little cave bitch", "image": "https://images.genius.com/7130347bb47a4a618915a6de2818699a.1000x1000x1.jpg", "album": "Lethal Injection", "year": "1993-12-07"}]}