{"artist": "A$AP Rocky", "songs": [{"title": "Been Around the World (Chopped & Screwed)", "image": "https://images.genius.com/5ff1cf6959ea5afde5004b68062591ff.500x500x1.jpg", "album": null, "lyrics": "[Intro]\nYeah, last track on the mixtape\n'Preciate everybody listening, you know what I'm talkin' bout?\nAnd we'll see you on the next one, you know what I'm talkin bout?\n\n[Bridge]\nDon't cry dry your eyes call me a jerk\nNot cause the size of my jeans but how I hurt ya\nI know this relationship is never gonna work\nBut I plant thoughts in your head that only do ya dirt\nAnd I said this once before, we make the perfect team\nWe barely get along forever making scenes\nYour crying on my sleeve what does it really mean\nIt doesn't really matter to me\n\n[Hook]\nCause I go, I go all around the world\nFuck different girls, cause when they see ya boy\nThey scream and as sad as it seems\nIt doesn't really matter to me\nCause I know, I know there's the perfect girl\nWho I can share my soul with but I can only see\nIn my dreams and as sad as it seems\nIt doesn't really matter to me\n\n[Verse 1]\nNow you can cry me a river or cry me a ocean\nMaybe the Pacific, that's just to be specific\nI gotta keep it pimping these hoes they say I'm tripping\nI don't care about your nails and your new hair, do your lipstick\nDip-dip next ho, they be on my dick like\nAll on my testicles, I can't even piss right\nAfter we fuck you won't see me again after this night\nReal niggas know what I mean\n\n[Hook] + [Bridge]\n\n[Verse 2]\nNow you can go go where you want front who the one gotta get that vibe\nDid I hit that? Quit that? How did I hit that? Niggas know how I keep it live\nLive try this suprised but she just say I'm on her eyes\nWhenever get it in that Prada or Del Agua\nNow I be the man Peter Pan, I fly high cause you like my drift\nShe know how I do it cause I got possess and I'm so swift\nGet her girlfriend in this whirlwind how we spin\nIt don't really matter cause I'm pimping bitch until the end\n\n[Hook]", "year": null}]}