{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/156826eec8abcbfc5b1bc92593d06634.640x640x1.jpg", "title": "Get Down Get Down", "year": "2016-12-25", "album": "Jonah", "lyrics": "[Intro]\nHere comes the get down get down\nHere comes the get down get down\nHere comes the get down get down\n\n[Verse 1: KJ 52]\nThe one I serve is the most high\nPull up to the curb in my '05\nGot the rims on tens when I roll by\nNo Benz but I got ten friends in an old ride\nWalking in with a limp and a closed eye\nFanny pack and I'm strapped for the whole night\nAnd the spots all packed and its so live\nFrom the front to the back and its show time\nGonna hate play the wall for the whole night\nWant beef? Get a burger and a cold fry\nAnd a steak and a shake and a whole pie\nYou salty, I see that you throat dry\nTwo coffees I dance like an old guy\nCan't stop cause I'm down for the whole nine\nLike Rocky I punch till I go down\nIt's my party this how it goes out\n\n[Chorus]\nHere comes the get down get down\nWhy you wanna sit down sit down?\nWe come to get down get down\nJunk that we bump so lit now\n\nThis the part where your mom gone dance\nHey mom, please don't dance\n\n[Verse 2: KJ52]\nOne time I was up in the Sam's Club\nThen a fan ran up put his hands up\nSaid he moved from Atlanta to Tampa\nWhipped out a camera game me a pamper\nCan you sign this quick for my grandma\nCan I get a little pic for the fam-a\nMy nana is a fan of your grammar\nHe's doing duck lips while he's holding the camera\nYour song is my number one jam-a\nIt's like I'm your number one fan-a\nThis is really so random\nCan we be friends like Ross and Chandler?\nYou gifted kind of like Santa\nYou up there with the guy who sings Panda\nDc Talk my favorite band\nWait... What did you say?... Man what?\n\n[Chorus]\nHere comes the get down get down\nWhy you wanna sit down sit down?\nWe come to get down get down\nJunk that we bump so lit now\n\nThis the part where your mom gone dance\nHey mom please don't dance\n\n[Verse 3]\nSometimes I feel like I just don't fit in\nAnd I feel like they just don't get it\nAnd I feel like I'm just so different\nWhen I rap for the cats who clap with no rhythm\nHalf pay attention, half didn't listen\nSome wanna laugh at the fact that I'm a Christian\nSo when I state that I rap for a living\nSome wanna hate for the sake of Religion\nBut my Saviour is risen\nBack on a mission, back out the prison\nMouth is a motor, rap is the piston\nNever gonna fail for your wack little system\nBut now I'm asking for wisdom\nJust to deal with the cats that will listen\nStill on a path that path of the vision\nBack in the lab and I'm back in the kitchen\nLike\n\n[Chorus]\nHere comes the get down get down\nWhy you wanna sit down sit down?\nWe come to get down get down\nJunk that we bump so lit now\n\nThis the part where your mom gone dance\n\n[Ending]\nThis the part where the song fade out\nSong fade out\nThis the part where the song fades out"}]}