{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/c9baa1386283e37588df0198d65847fd.640x640x1.jpg", "title": "Aztec Yoga Part Un", "year": null, "album": "Aztec Yoga 2", "lyrics": "Aztec Yoga, baby\nYo, I came to the [?] shows\nEverything, Peace Allah Ericka Huggins\nYoung Gaddafi with The Green Book\nLSD sold on the sidewalk\nFuck how high you got\nBuild a new soup kitchen for every stupid theoretical conversation you ever had\nTheory is an action of the brain, though\nAction is a theory, one might even say\nYoung temporary autonomous\nBrave New World, hip hop\nHippopotamus, Nostralogical\nMy rhymes are gargantuous\nSicker than six strong gargantuan tarantulas\nRamaha, Panama, man alive, animals, loves greed, avarice, vice, gluttony\nWhatever be anything spit freestyles for your pleasant little memories\nGaze into the raps and then let them be what they will\nBring joy, dutty trill. Puff, pill\nDrank a little, take these little styles to the bank and kill\nDang, I'm real. Dang, I'm true\nSing a little ditty for the kids to learn something\nBurn one, switch, reverse lanes, kiss my perverse mind\nFire Nerf gun higher than the fuckin' cross on the church, son\nCan I [?] words done?\nLife is a circle, simple as pi, three point one fours\nDeliverin' Hawaiian-style pizzas to the gun store\nWhippin' through the motherfuckin' Lincoln Fo-Deep, that's a rush mode, ha ha\nStone like a rock\nHey, young Wes An with the Bottle Rocket\nI think I'm Jason Schwartzman\nPenny loafers with the salmon-pink shorts, man\nOf course man\nDoggy I'm, like, fuckin' hung like a horse man\nBut that's neither here nor there now\nUh, the man main fact of the matter is\nVictor Vasquez is the best master rapper in the world\nGiving fuckin' master classes in fuckin' rap and examine all my scholarly styles and make your own groovy little rap career happen\nAnd then, um, what next?\nHuh, I dunno, your boy pretty much do nothin' but flex\nI never thought of the next steps\nSuckers is less fresh\nYa'll whack, I'm less whack\nRun through the Somar Bar\nRoll you for your fuckin' vest stack\nYoung chest box\nA most fuckin' ignorant rapper, the young cracker slapper\nThe booty grabber, the brutish and horrible, Bad Bad Not Good\nGhost of ray rad rad hot, hood hope\nHop the Jayquan\nFully tinted drop like pay swan\nPeace, Allah, Rae Chong, Rae Dawn Chong\nLet's blaze one Tommy Chong, I'm up in Seattle like Jayquan\nBlazin' with the keyboard kid, hella base done\nKarma's [?] so I face one\nHundred moon, hundred goons\nThe tunes is cookie dude\nKool A.D., real attitude\nBring it to you Rude Boy\nShatta"}]}