{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3ae84b594a511297bd256cc5b9c33afa.600x600x1.jpg", "title": "Fresh At My Funeral", "year": null, "album": "44108", "lyrics": "[Verse 1: King Chip]\nKing Chip up in this ho\nFresh up out the liquor store\nSwagging, if you didn't know\nYeah, I bet them bitches know\nKnow a nigga straight up out the hood on Wikipedia\nKing Chip you fucking looney all up in the media\nStraight up out the ghetto with the knowledge of a oracle\nMost these rap niggers is some ho's, how the story go\nUp until age 19, I was very po'\nStarted selling raps moved right up out the ghetto fo'\nSt. Clair Ave, that's where you get your head bust\nSeen a lot of shit, when I was young I never said much\nOnly if I knew you, would I be all on some cool shit\nSeen a lot of my nigga's dead on the pool pit\nI could get my hands on the blam in a heartbeat\nOnly when you had no fear of death, do you start beef\nI'd seen some nigga's, getting hunted like some fucking deer\nWonder why I have no heart, that's all I known for all my years\nNigga's know, make it out my hood on some rap shit\nTherefore, I am legend living fantastic\nIf you roll a nice one, motherfucker pass it\nLight my air mags up before you drop the casket\nYeah, King Chip\nIf you roll a nice one, motherfucker pass it\nLight my air mags up before you drop the casket\n\n[Verse 2: GLC]\nGLC, The Ism is a visionary\nSeen my face next to Ism in the dictionary\nThese pussy ass lames, they just can't compare me\nMy bitches they just don't complain when they gotta share me\nI was 16 when I got a Chevy\nCame up from a pack to a fucking heavy\nGospel, talk to apostles\nWho you know that knew that shit and fuck like Costco\nI know, the truth will get you goofy niggas\nHolding nigga's balls, y'all some groupie niggas\nFlexing and finessin', riding hoopty niggas\nI be manifesting [ - ] sushi nigga\nCool out, that silk shit I rule out\nChip got it cracking out in Cleveland, so I flew out\nGot these hoes going down low, like a lou out\nI'm about that money and the power, what is you 'bout\n\n[Verse 3: Chevy Woods]\nI'm balling' just like John Walk\nBitch, call me the wizard!\nCouple years before, you know a nigga had that wizard\nWhite T from the corner store was my shizzurt\nBreaking angles, cross serve, I know that it hizzurt\nFresh from the corner, smell the fiends I was chilling in\nI was smoking Kush up in them hotels in Michigan\nWhat'd you think I came from? Lil niggas pressed for time\nWhen you hear G speak, hurry up and press rewind\nAll we do is cash checks, I be in them'  Bo Jacks\nTen in the rubber band, no less, I need 90 back\nMind of an old nigga, tell the ' is fully you\nWith your point guard ass, you ain't never try to shoot!\nNiggas saying won't you just play something that I'm nice\nPussy niggas, what's your bet? Nigga, I don't need the price\nI keep it Pittsburgh nigga, but it's weekend\nChip said it got it popping, quit traffic to Cleveland\n\n[Outro]\nLight my air, light my air mags up before you (repeats)\nLight my air mags up before you drop the casket\nLight my air, light my air mags up before you (repeats)"}]}