{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Can’t Tell Me Nothing (R.O.C. Remix)", "lyrics": "[Verse 1 - Beanie Sigel]\nYou can't tell me nothing\nGangster? I don't buy it -- you can't sell me nothing\nI'm everything you thought I wasn't\nNow check out how I does it on this K. West production\nAll your bullshit, I will flush it\nAnd I got the paper to wipe that ass\nEvery little song and dance come out, y'all hype that trash\nAnd yo, I'm far from a hater\nCause suckers gotta eat too -- get y'all paper\nI ain't mad at cha -- I just can't deal with these fake rappers\nCause most of these niggas wear they boxers backwards\nNiggas claim king but can't govern they household\nNow real niggas doing time from shit they mouth told\nWhy dick-eating niggas always rap with a mouth full?\nBut you know they don't play with me\nThe realest nigga alive -- what can these niggas say to me? Nothing\n\n[Hook - Kanye West]\nLa la la la, wait 'til I get my money right\nLa la la la, then you can't tell me nothing, right?\nExcuse me, is you saying something?\nUh-uh, you can't tell me nothing\n\n[Verse 2 - Freeway]\nI had a dream that Jay and Dame was back together\nAnd in that second, everything was back the same\nIn reality, your boy went to Mecca, came back\nAnd said that I would never rap again\nBut I'm back and that's the way the ball bounce\nA verse is a ounce, a album's a brick -- now it's time for traffic game\nY'all lame, I am the product\nHotter than lava, they wonder how this Roc-a-fella package came\nFirst you take a brick of Jay, a brick of 'Ye\nCouple quarters of Freeway, an ounce of Beans\nThen you kill 'em with the flow\nWe the realest; even Dontrelle Willis couldn't out the team\nWe speak the truth and they believe us\nTell FEMA even Hurricane Katrina couldn't out the flames\nRoc-a-fella here to stay, we airing out y'all lames\nFree At Last on the way, so clear 'em out my lane\n\n[Hook]\n\n[Verse 3 - Kanye West]\nYeah homie, this the theme song\nFirst I get my money right, then I get my team on\nIf I always prayed to have gleam on\nThree hundred dollar jeans on, do that mean I dream wrong?\nAnd I was high as a Lear jet\nFly as the insect even though we in debt\nAnd it don't matter if I get her number cause\nWhen I get my money right, she gon' come running\nAnd I be good like God with a extra \"o\"\nGod knows that my check needs some extra O's\nAnd you know that you need to bring some extra\nNot in jogging pants, either -- tell 'em wear some sexy clothes\nNow my game so professional and my chain so fresh, they go\nBut after the fame, did you gain anything?\nDamn, 'Ye, would you change anything?\nWell, [Young Jeezy: If I had a billion dollars]\nI'd cop more pink Polos and pop those collars\nMisery love company, her nickname \"Sorrow\"\nMy Benz need company, her nickname Tahoe\n\"Wait 'til I get my money\" everybody motto\nSo I'mma need a bravo for everything that I wrote\nYeah -- hey mama, they can't hate 'em\nCause after all of the drama, K slayed 'em\n\n[Hook]\n\n[Verse 4 - Uncle Murda]\nListen -- I ain't worried 'bout shit\nIt's a Roc-a-fella/GMG invasion, bitch\nYou hear them niggas talking 'bout me? Ain't that some shit\nThese niggas is like bitches -- they all on my dick\nThey don't want no real G to get in position\nI opened up the door so all my real niggas could get in\nRoc-a-fella, Def Jam, GMG it's on\nUncle Murda coming for the motherfucking throne\nListen, you could call me the king of New York\nYou can't front, I'm doing my thing\nIf it wasn't for the chronic and these bad-ass ho's\nI'd be shooting motherfuckers everywhere I go, oh\nBut the head I be getting got me chilling\nGot a nigga like, let me focus on these millions, man\nIt got me not thinking 'bout these lames\nThey don't really want no beef, they ain't life-threatening\nI'm puffing purple haze with that sour diesel\nCan't forget that kush -- I'm high as a eagle\nAnd just cause I'm high off that marijuana\nDon't mean I don't see them niggas creeping around the corner\nThey goners"}], "artist": "Kanye West"}