{"songs": [{"title": "Burnin Up", "lyrics": "[Verse 1: Jeezy]\nGive me the whole bag\nI ain't trippin' on a push\nIn a world of street niggas\nGot more money than George Bush\nSo nigga I understand 'em\nI ain't never seen the leader of our nation in a Phantom\nThat's why I spit that real shit, real niggas can ride to\nG's and the street niggas like to get high to\nSpent a grip round my neck, nigga just because\nSo in the words of Kink B, nigga, stall my balls\nGot that crazy cash\nThat insane money\nFall off in Magic City, make it rain money\nCount all night, co-caine money\nThat do whatcha gotta do, I ain't ashamed money\nYou burnin' up, daddy\nAnd I ain't never gone stop\nGotta a hunnit thou- sittin in the parkin' lot\nI paid hella dues\nThat's why that bitch sittin' on some chrome tennis shoes\nAnd it's a show stopper\nCuz we shop at 404, not Foot Locker\nAnd yeah nigga, that's real\nNow was ya man doin' that before his deal?\n\n[Chorus]\nYou burnin' up daddy, ya too hot\nThem other niggas wanna get what ya got\nYou burnin' up daddy, ya too hot\nThem other niggas wanna get what ya got\nYou like this daddy, you like that? (Now break it down for me)\nYou like this daddy, you like that? (Now break it down for me)\nYou like this daddy, you like that? (Now break it down for me)\nYou like this daddy, you like that? (Now break it down for me)\n\n[Verse 2: Slick Pulla]\nGot million dollar plans, but I ain't Ted DiBiase\nSneeze on ya with the snub nose to get ya off me\nWe make bread like a mint, nigga\nUnited Streets Dopeboys in this bitch, nigga\nWe pull broads off the benches, turn 'em to some starters\nWe pop choppers that'll spray ya patna like Binaca\nWe big talkers cuz we live it, this is more than rappin'\nMy mack furs got me sittin like a carriage wagon\nSo when we come through, clean the slate\nG'd up, my feet clickin' with my Bathing Apes\nAnd we can get this shit crackin'\nMob through the smoke chokin' 'thrax nigga, What's Hatnin?\n\n[Chorus]\n\n[Verse 3: Blood Raw]\nRaw the truth, Dwyane Wade of the street nigga\nFlorida Marlin, but I stay packin' Heat nigga\nAnd the man mouth glow like a bottle of Cris'\nLemme hear ya, shawty know he got a hell of a wrist\nCame through, Chevy lookin' like a Big Wheel\nBanana guts, sittin' high up on them big wheels\nAnd the trunk sound like the band at FAMU\nI'm lookin' down on them clowns on them 22s\nShawty rock game sorta like I'm Barney Rubble\nSo many colors in my charm, look like Fruity Pebbles\nRespect the shield, USDA, yeah we came thru\nWe gettin' money while you niggas ain't countin' clues\n\n[Chorus]", "album": "Can’t Ban the Snowman", "year": null, "image": "https://images.genius.com/3e5baf6a5046dabf4bb3726d99c4b625.320x320x1.jpg"}], "artist": "Jeezy"}