{"songs": [{"image": "https://images.genius.com/18ad63b44b0a1f6f669d4d900943b4a3.500x500x1.jpg", "title": "NO NAME", "album": null, "year": "2018-01-19", "lyrics": "[Verse]\nLook, people ask me what the future is\nAll I know is I'll be doin' this\nAll I know is things are moving quick\nThat's convenient for me 'cause that's how I live\nNow they see me out here movin' up\nYou don't like me, that makes two of us\nTime change, yeah, I can't adjust\nYo, it’s who you are not who you was, oh my\nYeah, just went to Europe, they said the single is working\nI think I'm learning\nI am way more than what people might think when they look on the surface\nWhat is my purpose? Yeah\nThat is a question that I have been asking myself and it hurts\n'Cause it's prolly something I should already know but I don’t know it yet, I'm tryna grow as a person, woo!\nI'm sick of people tellin' people I'm here 'cause of marketing dollars, oh\nYou think that everything is gonna blow just 'cause you market it harder? No\nI got my hands in everything, now they out here tryna get to me, stop tryna lecture me\nYou don't compare to my level of thinking, so why do you think you compare to my energy, huh?\nSmall circle, but the number's growin'\nFame called me, I'm like, \"How you doin'?\"\nHung up on him, I ain't ready for it\nI'll get back to that when I make album four\nLess talkin', I've been workin' more\nBetter me is what I'm workin' towards\nY'all judgin', but we not in court, no, we not in court, oh Lord!\nLast couple years, let's recap\nI make a livin' off of writin' out my regrets\nI'm doin' me, I don't care where the scene's at\nTry to give me feedback, I don't really need that\nI used to walk on stage in a V-neck\nI used to wear a lil' tie with a black vest\nI came a long way, why you lookin' upset?\nI'm tryna paint a picture, get the vision, you ain't hear it yet, woo!\nLook, hold up, hold up, wait a minute, please\nFlow's switchin', I got ADD\nBrain scatters when you play the beat\nIt don't matter what you say to me\nI'll be doin' this at 83\nI've been doin' this since ABCs\nIn the major leagues doin' major things, don't play with me, woo!\nI'm livin' life in the fast lane\nWake up every morning thinkin' I'ma have a bad day\nDrive my own car, I don't like the valet\nPark then I go into my mind with an AK\nShoot every thought in my head then it rotates\nLosin' it all, but I think that I'm okay\nWho is involved? I don't know, but I'm insane\nPoof! And I'm gone, wanna call me a no name, what!?\nI'm prolly not what you thought\nI'm prolly not what you thought\nI used to judge everybody that wasn't like me 'til I learned it was wrong\nGirl told me I should get it together and get out the dark\nI'm tryna give her my heart\nThat's when I sit in my car, writin' for hours until I can barely talk\nI mean, where do I start?\nFeels like I'm fallin' apart\nAct like my image is hard\nI always put up my guard\nEven when talkin' to God\nSit in my room and I plot\nEverything that I'm not\nComes out in the music I jot\nI give it all that I got\nI give it all that I got!\nI'm tryna think out the box, no!\nYeah, I got people standing outside a bus screaming my name\nI don't come out and take pictures, they tell me I changed\nI don't smile in VIPs, you get mad like, \"You know what I paid?\"\nGuess I don't know what to say\nGuess I don't know what to say\nI leave it all on the stage\nI leave it all on the stage"}], "artist": "NF"}