{"songs": [{"image": "https://images.genius.com/b7b5106532f23217d46a0d126c3da364.800x800x1.jpg", "lyrics": "[Verse 1: Prodigy]\nAll I got for these niggas is expletives and slugs\nAll I got for these bitches is big dick and drugs\nAlcohol and guns\nDon't be scared now you got it thug\nSmart enough to chill the fuck out\nUntil it's time to dump\nRelease so much rage in such a short space\nI'll put your face in your cornflakes, mobb style\nYou gave them Goma power\nYour honey want it, nigga, hold it down\nHood nigga she love my style\nI knocked the cat out\nNigga I'll pull a Lufthansa\nNigga is that your bitch I took that back to the casa\nI'm always pulling the heist I can't help that\nBitches wanna\nYou know what that ride be like with just one night\nI blow up mine and get low\nThere's to much dough out here to be broke\nSo I hit the curb\nAnd bend a few corners bumping this shit here\nTurnt all the way up\nNiggas getting robbed tonight, let's be clear\nCome up off of them things\nA nigga gone die tonight, I leave you here\nYou give me your valuables\nNo funny moves, I swear\n\n[Verse 2: Mac Miller]\nUhhh\nMan walked in with a smile on his face and a\nLoaded 45 in his hand\nTold the clerk \"Don’t move, I didn't come here to shoot\nBut I will, so you must understand\" Bang!\nShots in the air, No time to waste\nBeen doin' drugs all day, now his mind erased\nFuck the register, he better find the safe\nGet the money, hit his homies up and congregate\nI need bread, my kid need to be fed\nThis is the recession, going through depression\nI ain't done sinning cause I ain't done winning\nGotta be fucked up to make it to the top, where the money at?\nI could be next to me, Death in Venice\nWork at CBS and one day you’ll manage\nRejects, emotionally damaged\nYou kids need a shrink, let me call Rick Moranis\nWant to get a crib in Atlantis\nKnocked the bitch out cold, she Rick Rambis\nTell Dorothy we ain't in Kansas, Livin in this world\nBut we don't understand it, No!\nBullshit, you can't sell that\nAll these kids will get held back\nA cup filled and my L fat\nThinking we just want Dave Chappelle back, well, until that\nI’m coming through the function with some subjects for discussion\nYep, thats Alchemist in production\nLittle bit of Larry Fish yeah it's nothing\nGod versus man, lion versus lamb\nCompetition ain't shit\nIma treat you all like my bitch\nStart by sucking this dick!\nBIOTCH!!!", "year": null, "album": "R.I.P.", "title": "Confessions of a Cash Register"}], "artist": "Mac Miller"}