{"artist": "Aminé", "songs": [{"title": "Turf", "album": "Good For You", "year": "2017-06-16", "image": "https://images.genius.com/9af350a0542196d9f7ad567f6d07b819.630x630x1.jpg", "lyrics": "[Verse 1: Aminé]\nWalking on the pavement I chipped my pride and my teeth on\nThe girl I grew up with lives a couple houses down\nThe 8 Bus run the same, dogs howl when the train...\nComes like my ex girl and next girl\nUsed to rock the S curl, wanted me a Nextel\nBut my momma copped a Razr, that's why I couldn't blame her\nFlippin' through my past like I used to flip the phone\nThey kickin' out the blacks and all the houses getting clones\nFriends used to do pills and only eat at Du's Grill\nThe food was pretty good but the times was better\nThese are the only days I missed, like the first shawty I kissed\nI used to have dreams, now I dream\n\n[Chorus: Aminé]\nI look around and I see nothing in my neighborhood\nNot satisfied, don't think I'll ever wanna stay for good\nPacked up my bags, told Mom and Dad I've gotta go, go\nAnd once I do, they'll finally see the inner me\n\n[Verse 2: Aminé]\nEverybody wanna be a star, everybody want a nice car\nEverybody wanna live great, have a good damn time\nNever trip with the law\nThe popo up in PO dirtier than BO\nBullies from the past act like I'm they fucking hero, uh\nLivin' in LA for the weather, I FaceTime mom when I miss her\nI got some homies that'll never leave my hometown\nWhen I pull up to the corner, it smell like Miley Cyrus\nI told 'em I don't smoke, they say \"Boy, you fuckin' wildin'\"\nInnocent and young, reckless and we dumb\nOur heart is like our earth and memories the sun\n\n[Chorus: Aminé]\nI look around and I see nothing in my neighborhood\nNot satisfied, don't think I'll ever wanna stay for good\nPacked up my bags, told Mom and Dad I've gotta go, go\nAnd once I do, they'll finally see the inner me\n\n[Verse 3: Aminé]\nMentality the same from my folks\nMomma wanna see me happy, she don't wanna see me broke\nI sip red wine, sauvignon, Rastafar, Babylon\nMy youth will never die if I live it like a prize (Hey!)\nWho knows who I am, who knows who I are\nMost people pretty sketch like a night at Echo Park\nThat's why I just keep it cool but my time is in a leisure\nEverytime I'm home I catch emotion like a seizure\n\n[Interlude: Recording]\n(I cut the first night, we fuck around, I put my finger in her bootyhole 'cause you know you gotta test the water with hoes. A-a-and then...)\n\n[Bridge (Spoken): Aminé]\nI slip and slide through the times in my youth\nWhat's age? Too young to worry, too old to dream\nWhat's age? Imagination to me, tragedy to some\nWhat's age? I guess we'll find out when we're older. Touché\n\n[Chorus: Charlie Wilson & Aminé]\nI look around and I see nothing in my neighborhood\nNot satisfied, don't think I'll ever wanna stay for good\nPacked up my bags, told Mom and Dad I've gotta go, go\nAnd once I do, they'll finally see the inner me\n\n[Outro: Charlie Wilson]\nOh\nOoh, oh, ooh, oh yeah\nOoh, ooh, oh yeah, ooh\nYeah-eah-eah-eah-eah\nOo yeah-eah-eah-eah\nOhhhh hmm\nOhhhh hmm\nHmm\nHmm\n(Turf)"}]}