{"artist": "King Los", "songs": [{"image": "https://images.genius.com/4d9c32a9b90541ce4c0c3d143d56f7c9.1000x1000x1.jpg", "title": "Black Lights", "year": "2017-12-25", "album": "Moor Bars", "lyrics": "[Intro]\nDear all you little rappers here I'm finna black like\nPure carbon in the atmosphere turn on the black lights\n\n[Verse 1]\nToo cool, I hula hoop with Cuban chains\nWho can change the frequency and move the game?\nWho maneuver through the pain?\nWho the truest to the name?\nWho do you, do you acclaim, you are lame?\nYou, and you, and you, and you the same?\nOh fuck it, homie do your thang\nI ain't even gotta stretch for this one\nI be bumpin' Dipset, getting sets of dips in\nFlexing different, make you niggas cut a check to kick it\nMan tell 'em this a easy run\nIf you the best you the easy one\nI'm a nigga with a attitude, I Snoop, Cube, Dre and Eazy son\nLine 'em up like the Yeezy's coming\nGot 'em shook like Jesus coming\nFuck peace, get a piece of something\nEveryday we smoke at least a onion\nGet some vegan pizza, mac and cheese or something\nCan't believe that they imagine me with nothing\nHeaters bucking in my hood and we was ducking\nReaper coming, repercussions squeeze the drum and\nMake it even, even preachers running\nI take the kids and teach 'em something\nThey don't fuck with me for nothing\nWe agree to this on me to leave 'em something\nKeep it coming, keep it coming\nAin't no secret fuck with me, and I'ma Ether something\nEven keep it peaceful feed me beats and keep me blunted\nGod body, God body, the young God hard body\nHard top big body, talk tough get bodied\nShe down to be in my DMs, John Gotti, Yo Gotti\nMy Saint Laurents go prolly, I ain't playing with nobody\nI'ma fuck around and had to murk a nigga\nMake a verse 'bout one of you niggas and go hurt a nigga\nIt don't concern a nigga in about the paper playa hater\nPerpetrator greatest innovator ever nigga\nGet down like James Brown in \"Funky\"\nMan watch you girlfriend 'cause she want me\nAnd you're not me, you can't stop me\nMan, you who's army gon' block me\nThey drop so cocky, it's not me\nI did not need to say that\nBut I take the drop-top to the top speed\nAnd to catch me you need godspeed\nIf you bitch stare, I shift clauses and switch gear like a five speed\nI don't dig these artist niggas push my buttons and get me started but my cause is greater\nThe sheer mechanics of a nigga in the hood is known to take your bitch to alternate her\nGod body, God body, who is God? Y'all prolly—\nThink God exist, outside of y'all body\nI ain't playing with nobody\nYellow Lamb red Ferrari, look like KYLE and Lil Yachty\nHeard your metaphors and your punches\nI ain't diggin' not a damn line\nJesus Christ wouldn't cross me\nAnd I'ma blow up 'cause I land mine\nI'll align the stars create the path\nMay sunshine for many moons\nThrough your soul all it is a sacred math\nWait wait hold up let me take that back\nI said Jesus, crosses Allah\nI'll align stars, suns, moons (Bars)\nMa-son shine, mars\nAnd your soul is all sacred math\nIt's cosmic because the solar is sacred math\nI could out rhyme a don and break his fast\nExcuse my french like my Moroccan brother\n'Bout to make fans dessert rappers like that album cover\nY'all don't deserve me, y'all niggas lame\nMy shit too early, my shit is perfect\nOnly way I'm a fuck-up, is if I do that shit on purpose\nWhat's these niggas purpose? Most these niggas worthless\nFuck we gon' do when all that shit is surfaced\nMan you lie, man you really hurt us\nI should serve you as you would diss for dips serves\nI should go and get your bitch some dick service\nMake her cum, give me mouth and lip service\nTell these pussy niggas hop up off my sack\nI am from the hood where ain't no fathers at\nBut I'm at just like my father met\nI'll be flexing thinking that I'm Hercules\nWhile your momma clap, just like my momma clump\nThink I'm a chump, how you wanna act?\nOh Hercules! Hercules! Hercules!\n\nMoor Bars"}]}