{"artist": "Andy Mineo", "songs": [{"title": "Desperados", "album": "Uncomfortable", "year": "2015-09-18", "image": "https://images.genius.com/9a23efdbe421de59647ed95b73952a34.1000x1000x1.jpg", "lyrics": "[Intro: Mali Music]\nYou know I'm a wanted man\nFor reasons you won't understand\nPrices on my head, for like a hundred grand\nCause I'm wanted dead or alive\n\n[Verse 1: Andy Mineo]\n(Bang, bang!)\nYou woulda thought I was whippin' and pushin' and sellin' this dope\n(Bang, bang!)\nThe way that they tell me to get out of town and then aim for the throat\n(Bang, bang!)\nThey trying to ghost your boy, they pullin' the gun out the holster\n(Bang, bang!)\nBut I'm doin' me, I'm doin' me like I'm 'posed to, yeah!\nYou're smart\nOut here like the Wild Wild West\nShawty right here with the wild, wild dress\nThey tell you can be more if you show less, hol' up\nI been around the block a few times, I got a new mind, I'm lit\nMan, I was sleepin' on futons, bread small as croutons\nNow my business legit\nHow many beats do I got to poop on to prove I'm not a fluke?\nI want true, a true sign a growth\nFor you find ways to refind yourself\nYou win when you lose, aye!\nSeem like every team them got a Judas\nBut I don't care\nGive me a snake and I'll make a nice pair of boots, yeah\nI ain't tryna be liked, man, I'm tryna be a light, bang!\nI ain't tryna make a livin', man, I'm tryna make a life, bang!\nAyo, that's way different\nNowadays I pray different\nUsed to ask for mo' blessings\nNow I thank Him for the ones He givin'\n\n[Hook: Mali Music]\nYou know I'm a wanted man\nFor reasons you won't understand\nPrice is on my head, for like 100k\nNow they want me dead or alive\nBang!\nThey gunnin' for me now\nBang!\nThey got they weapons drawn\nBang!\nThey say get out of town\nCause I'm wanted dead or alive\n\n[Verse 2: Andy Mineo]\nHow do you terrify a man that ain't scared to die?\nSo while I got a mic, I'ma air the lies that paralyze my people\nI live by the fear of God (uh)\nI'm sick and tired of songs that don't dignify a lady\nBut, baby we givin' them power\nThe moment you go out and buy it and give 'em yo' dollars\nWhy they try to define us by how many commas we got?\nThey don't know what's inside us\nBut let me be honest, there's somethin' beyond us\nYo, homie, preach!\nI gotta speak on my peace\nMan, I can't keep it a secret\nThe only way that you get acceptance is when you know you don't need it, yeah\nFreedom is a mindset, and I ain't in my prime yet\nMiner League and one sixteen, yeah\nThem my folk I grind with\nI think about all that time spent way before success\nGet to see the kid shinin', that's the glimmer from the sweat\nGet up and go\nHomie, we live by the code\nWe don't got minutes to blow\nTime is more precious than gold\nSharp with the flow\nMix it with lyrics that fix up your soul, oh\nI ain't tryna be liked, I'm tryna be a light, bang!\nI ain't tryna make a livin', man, I'm tryna make a life, bang!\n\n[Bridge]\nAlright, now we some desperados (we are)\nLivin' by the motto (you know)\nIf I die tonight, man, I'm ready for tomorrow (you got)\nThey say get out of town (hay)\nThe truth won't let me lie though (what else)\nThey gunnin' for me now (alright)\nThey know the way I go (lets go)\nThey want me dead or alive\nI'm wanted dead or alive\nI'm wanted dead or alive\nI'm wanted dead or alive\nI'm wanted dead or alive\nI'm wanted dead or alive\nI'm wanted\n\n[Hook: Mali Music]\nYou know I'm a wanted man\nFor reasons you won't understand\nPrice is on my head, for like 100k\nNow they want me dead or alive\nBang!\nThey gunnin' for me now\nBang!\nThey got they weapons drawn\nBang!\nThey say, \"Get out of town\"\nCause I'm wanted dead or alive\nBang!"}]}