{"songs": [{"title": "Caption This", "lyrics": "[Intro]\nYou niggas never listen\nI'm just sayin' man, get your shit together\nCheck\n\n[Chorus]\nI been whippin' in my bitch's kitchen\nWe got him for his bag and left with no description\nRun that check up, bitch I told you listen\nGet your racks up ho, why don't you listen?\n\n[Verse 1]\nI got ninety-nine reasons I should leave niggas not breathin'\nPull up and just leave him, just say fuck my freedom\nI'm trafficking my own sack, tell 'em I don't need 'em\nBitch I got my own back, I'm bustin' when I see 'em\nLoco with the coco, I'm a dog with the food\nI'm posting and my caption is what y'all wanna do?\nFuck them other niggas and the other side too\nDraco after draco, y'all know I'm gon' slide through\nBut right now I'm in this trap\n\n[Chorus]\nI been whippin' in my bitch's kitchen\nWe got him for his bag and left with no description\nRun that check up, bitch I told you listen\nGet your racks up ho, why don't you listen?\nPush the dope hole I got tunnel vision\nPush your button, bitch it's no ignition\nRun that check up, bitch I told you listen\nGet your racks up ho, why don't you listen?\n\n[Verse 2]\nNo, we don't walk around with beef nigga\nEverybody hungry, all us gotta eat nigga\nMy booster bitches from the projects stay on fleek nigga\nReal shit, real Gucci, real cheap nigga\nReal bricks, real shooters, real street nigga\nIt's a jet, bitch where it's at?\nFifty twenties, do the math, it's a stack\nI seen the paperwork, I did the math, it's a rack\nI go berzerky with the perkies, hand to hand with the xan\nC-O-D, you gotta bring your bands when it land\nCan't let these niggas trick me off the street, bitch quit playin'\nFuck these niggas sayin', lil bitch I been the man\n\n[Chorus]\nTrap, I been whippin' in my bitch's kitchen\nWe got him for his bag and left with no description\nRun that check up, bitch I told you listen\nGet your racks up ho, why don't you listen?\nPush the dope hole I got tunnel vision\nPush your button, bitch it's no ignition\nRun that check up, bitch I told you listen\nGet your racks up ho, why don't you listen?\n\n[Outro]\n(I told you niggas get it)\nGet your racks up ho, why don't you listen?\n(I told you niggas get it)\nGet your racks up ho, why don't you listen?", "album": "10 Street Commandments", "year": "2017-12-01", "image": "https://images.genius.com/c8c001c500e10c798b9d3c2924b8643d.1000x1000x1.jpg"}], "artist": "Young Buck"}