{"artist": "IDK", "songs": [{"title": "How Long/Last Song 2 (Outro)", "lyrics": "[Pt. I: How Long]\n\n[Verse]\nHow long have I been a nigga?\nSince the day I was born\nOr since the day I decided a trigger would be the way to get all the money I get\nRob my brother for Benjamins then I spend them on kicks\nThem Louboutins looking sick\nIn fact they make me look rich\nIn fact they make me get all the women, I mean every bitch\nI got a watch that don't tick\nI got a watch that don't tick\nBut if I walk out the house with it I'll be a lick for another nigga\nHow long has he been a nigga?\nSince the day he was born\nOr since the day he decided the liquor store by his house\nAcross the street from his school\nWould be the same place he sold drugs and acted a fool\nHis father wasn't around\nHis mother was in the streets\nGrandmother did what she could with barely nothing to eat\nJust for the sneaks on your feet\nHe probably make you deceased\nFuck every priority\nThe money's the priority\nThe white man asked how long have we been some niggas?\nSince the day we was born\nOr since the day Martin Luther said that enough is enough?\nWe got to fight for our rights\nBut we to worried about seeing money that we losing sight\nOf everything that's ahead of us\nOnly seeing in front us\nWe don't see what the money does\nWe just that the money is\nThe answer, the key, the false reality\nThe hope, the love, the only thing we need\nIn fact we need it so bad we make ourselves bleed\nGreen is the reason for my black mentality\nThat's how long I been a nigga\nSince the Jackson's, the Lincoln's, the Washington's, the Hamilton's, the Jefferson's, the Franklin's\nThese are all white men\nShout out to Harriet Tubman\nIf it's true then maybe that'll bring change in the end\nTo the reason why I am a nigga\n\n[Pt. II: Last Song 2]\n\n[Hook]\nBitch niggas gone hate\nBitch niggas gone talk\nPussy niggas gone say\nYou are not what you are\nMan shouldn't ever hate\nJigga man taught me that\nThe way the world looking now\nIt ain't a lot of men left\n\n[Verse 1]\nI just did another show\nPacked it out the ratio\nHalf man, half hoes\nI'm a just call it a [?]\nBack when Justin use to drive in a Centura\nThat was his momma shit\nThat was back before I ever thought that I would be in LA trying to get that Obama dish\nWaffle with chicken, no omelette\n\n[Hook]\n\n[Verse 2]\nThey gone say this Drake flow\nBut still know it's Jay though\nI'm still getting paid though\nEvery time you scream hoe\nGet the choppa, give them blocka\nMiddle finger\nFuck a problem\nWe gone solve them\nModels here\nCredit card, no limit\nSilkk Da Shocka\nWe gone do it real big\nFor my momma\n\n[Hook]\n\n[Outro]\nI ain't never been this happy recording music before bruh\nLike these songs\nI feel...When I'm recording them right now\nThis the first time I feel like while I'm recording them that I fuck with the shit\nYou know what I mean?\nLike usually it just be like I record,record and then after it's done I'm like oh yea, this is tight or I don't like this\nBut this is the first time I'm recording it and I fuck with it\nYou get what I'm saying?\nIt ain't a lot of men left oh\nNa na na na\nI don't really have no verse for this to be honest\nAll I got is that (laughs)\nThat's all I got\nI was still writing that joint\nFly the hook in\nBitch niggas gone hate", "image": "https://images.genius.com/d97b0ca6e4041c74908a8955878702c7.500x500x1.jpg", "album": "The Empty Bank", "year": "2016-09-09"}]}