{"songs": [{"lyrics": "[Verse 1: Action Bronson]\nHere we are\nJust us\nI know you want from the first time you seen me in the movie\nHanging on the shoulder of a villain\nShe could flatten a village\nYou know I'm usually chilling out with Bruce Willis\nSomehow, you and my man met first\nI was still stealing the money outta my gram-gram's purse\nBut you were\nRunning the streets, letting the blam-blam work\nBack then we smoked nickels of dirt\nNowadays it ain't shit to drop a grip on dessert\nAnd you wanna tell the feds about some shit and it hurts\nFuck it, so be it, you 'bout to know Jesus\nTurn this motherfucker back into a fetus\nPhone's tapped so speak Swedish when you call the crib\nRich forever motherfucker I was born to live\nDie happy, knowing that my family's straight\nI hope they didn't see the numbers on that Camry plate\nI been a grown man since I had a baby dick\nThese motherfuckers ain't saying shit\nClose my eyes, spray the whip, hit your rib twice\nNow your kids gotta deal with this shit 'cause this is life\n\n[Outro: Big Body Bes]\nYeah, and I'm fucking here now\nIt's fucking Body\nWhat the fuck I'm doing?\nWhole bunch a shit\nI'm out there wilding\nGot a fucking 50-year-old Puerto Rican with me\nHe don't even know my name\nBut he gon' stab something for me\nHe know what time it is\nNo watch on the wrist\nFuck outta here man\nSmack the shit outta you then slap your son five\nYour own family loves me more than you\nSalute me every time\nEvery time I come to your fucking crib, it better be a plate wrapped up on the stove motherfucker\n'Cause you know I'm coming to eat\nFuck that I don't even want firsts, I want my seconds first\nThat's right, I eat right out the motherfucking pot\nFuck a spoon, I been eating hand to hand my whole life\nI motivate myself motherfucker\nAnytime I need to think about some shit man\nI just go back and close my motherfucking eyes man\nAnd go back to the sorrow\nFuck outta here man\nMy whole life is a fucking discography, B\nYou stupid? Quadruple platinum\nOops, what's that? Another one", "title": "72 Virgins", "album": "Saaab Stories", "image": "https://images.genius.com/661250cc679db57ceede833855e82710.460x461x1.jpg", "year": "2013-06-11"}], "artist": "Action Bronson"}