{"artist": "Fat Joe", "songs": [{"year": "1998-07-14", "album": "Don Cartagena", "image": "https://images.genius.com/f5c1dde7c10db5efcf281667957c213d.953x953x1.jpg", "lyrics": "Nobody said it would be easy, ha hah\n[Puff] What y'all wanna do hah? (2X)\nNobody wanna handle it\n[Puff] AS WE PROCEED, TO GIVE YOU WHAT YOU NEED\n[Puff] What y'all wanna do hah? (2X)\n[Puff] NINE-EIGHT, IT'S THE GREAT\n[Puff] What y'all wanna do hah? (2X)\n\nVerse One: Fat Joe\n\nNow why the sad face, jealous for fellas that's diamond laced\nTryin to find a place to recline, shine my face\nUnder the sun where it's warm, runnin with Pun til I'm gone\nThat's word is bond on my moms\nThat's the squad motto, got beef we call Rallo\nDame Un Trago, he go to war wit a bottle\nSimple as dat, flip out the mack and cripple a cat (\"take that\" 4X)\nRight through your back tissue with any pistol I pack (c'mon)\nPhysical rap means we live the lyrics\nLong as niggas fear us you could never entirely dissapear us\nWe the realest you ever gon' see\nIn all honesty, ain't another brother that's hotter than me\nModesty'll get nowhere, that's why I go there (yeah, yeah)\nLike lettin you know where to buy the new Fat Joe gear (that's right)\nFive sixty (five sixty) only the Squad ride with me\nUnless you a Bad Boy, and roll with Puff Diddy (eheheheh)\nIt's my city, and everything in it\nAin't a thing rented (c'mon) it's my Benz, if you see me in it (yeah)\nWe invented floodin the watch, and runnin the spots\nThat's why, I'm not a player, I just crush a lot\n\nChorus: Puff Daddy\n\nWhat you thought, we ain't run the streets?\nNow you can't sleep ten deep, convoyin in the Benz jeep\nRollin deep with the Don-Tana\nI put the chrome in your cara, adios to manana\n(repeat 2X)\n\nVerse Two: Fat Joe\n\nYea, uh, yo\nYou better slide or catch this homicide\nAin't no match for Joey Crack I'm blowin backs out the other side\nBrothers died and mother's cried at wakes, these are The Breaks\nKurtis Blow your head off like Jake (like Jake)\nSo take heed and read between the lines, ain't no cheatin mines\nPlayer haters never wanna see my shine\nUp in the Range or in the Lex Coupe\nRockin a fresh suit with dress shoes, on my way to Les Boo's\nLet's choose the life we rather live, on the streets stabbin kids\nOr livin mad sweet in lavish cribs\nFix marriages for my kids, six karats, I'm a whiz (mm, mmm)\nExotic tokin parrots on my wrist\nIt ain't shit but for sex, money, and drugs\nTrue thugs with slugs and wrap bodies in rugs\nWhat the fuck, Joe Crack, twist your cap back\nLeave your heart rate flat, once Terror Squad attacks (yea yea yea)\n\nChorus 2X\n\n(Puff Daddy talkin over chorus)\nTerror Squad, and Bad Boy\nJoey Crack, Big Pun\nI see you\n\nCan't sleep, ten deep\nYea, uh-huh\nAdios to manana\nTerror Squad, what?\nBad Boy, khanmean?\nJoey Crack, Big Pun\nI see you, I see you\nC'mon, yea, yea, say what say what?\nSay what say what?\nUh-huh\n\nI see you.. take that..\nAdios to manana!", "title": "Don Cartagena"}]}