{"artist": "Pusha T", "songs": [{"album": null, "title": "What Would Meek Do? (Demo)", "image": "https://images.genius.com/66e8896c8c1bb069880e68e1abc3f74f.900x900x1.jpg", "lyrics": "[Chorus: Pusha T]\nNiggas talkin' shit, Push—how do you respond?\n\n[Verse 1: Pusha T]\nI'm top five and all of them Dylan\nI am the hope, the dope dealers won\nPrice and the quote, the dope dealers want\nFeds takin' pictures like it's GQ\nThis Avianne collarbone is see-through\nAngel on my shoulder, \"What should we do?\"\nDevil on the other, \"What would Meek do?\"\nPop a wheelie, tell the judge to Akinyele\nMiddle fingers out the Ghost, screamin' \"Makaveli\" (come with me)\nHail Mary, the scale fairy\nTwo sides to every coin so we bail ready\nHow do you respond?\nI let the monies and the fools talk\nI let the jewels and the hues talk\nWatch face came with a fuse box\nChanel's on ya bitch\nThe coupe is 320, the roof's hit or miss\nMurder on the highway, the news is at six\nSee, I did it my way, the proof's in the bricks\nEghck! Smell it through the Tupperware (Tupperware)\nTwo can get you four like a double dare (woo!)\nI'm the king of the oven-ware (oven-ware)\nYou can piece the whole puzzle here\n\n[Chorus: Pusha T]\nNiggas talkin' shit, 'Ye—how do you respond?\n\n[Verse 2: Kanye West]\nI am the don of Vuitton\nI am the Sean of Sean John (That's the boss nigga)\nThis is the [?]\nI'm too complex for ComplexCon\nYou heard Cole on that song, he was tryna' hate\nI am out of touch, I cannot relate\n\"Hallway too long, bitch too bad\"\nGot a surrogate,\" my kid \"gets two dads\"\nHow can one man take a company down?\nI can see Nike contemplatin' that\n\"Like bro, we're fucked, what's the best plan?\nI don't know, hire Ye's best man\nMaybe sign Travis, sign Don C\nMaybe get the [?]\"\nRicky came by unattended\nSent Donda out in heaven, up with Avery\nI be thinkin', \"What would 2Pac do?\"\nYou be thinkin' \"What New Kids on the Block do?\"\n[?] like cribs on the block too\n[?] we got cribs on the block too (Haa)\nDrizzy wearin' Yeezys on the low though\nOnly reppin' Nike for promo\nThe company growin' faster than Flo-Jo\nAnd we did it with no logo\nIt don't feel right 'til I feel like Phil Knight\nGoin' for six rings like what Phil told Mike\nWhat was the six", "year": "2019-06-16"}]}