{"artist": "A$AP Ferg", "songs": [{"title": "Make a Scene", "image": "https://images.genius.com/6a2f58fb40c2a44463c586658c8fc9ae.1000x1000x1.jpg", "album": "Trap Lord", "lyrics": "[Chorus: MAAD]\nNeighborhood is rough and livin' ain't easy\nStreets are so mean, 'bout to make a scene\n\n[Verse 1: A$AP Ferg]\nOoh, come and fuck with the Trap Lord\nIn the neighborhood where all my neighbors hood\nCome in your crib and they blast for us, for us\nFlowers in your casket\nSemi-auto Tec finna leave a nigga wet, you asked for it\nFor it tore him, bitch came to his crib to allure him\nIt was all a part of the forum\nFuck that nigga, take the stack and the Jordans\nGet what you wanted, the bitch ain't important\nYou saying she fire, the devil be scorching\nSay bye to your momma, say hi to the coffin\nYou die from that llama, you live near the Lord and\nThat why rain pouring, you in the sky with Whitney and Marvin\nYou do or die, be all in your touring\nClaim you the shit, you get flushed in the toilet\nYour crew ain't gon' ride then when you is comin'\nWho is this goon claiming he balling?\nTwo in your ride if you pump in the morning\n\n[Chorus: MAAD]\nNeighborhood is rough and livin' ain't easy\nStreets are so mean, 'bout to make a scene\n\n[Post-Chorus: A$AP Ferg]\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\nRiding with my top down 'bout to make a scene\n\n[Verse 2: A$AP Ferg]\nBlocka-blocka like them shottas, hit your poppa and your mother\nLet your brother lick the blood up, talking shit, you get another\n(Motherfucker) Ready to start the ruckus\nTake your supper, lit the snubbas if you talking like you tougher\n\n[Chorus: MAAD]\nNeighborhood is rough and livin' ain't easy\nStreets are so mean, 'bout to make a scene\n\n[Outro]\nAyo Ferg! (Ayo, come on, Lord)\nAyo Ferg, wake up Ferg!\n(Wake up, Lord, wake up)\nYo, wake up! Ayo Ferg (get the fuck up)\nWake up Ferg, wake up (get this nigga up, man)\nYo, Ferg, wake up man (come on, Lord, come on)\nFerg, yo wake up, bro (wake the fuck up)\nYo, Ferg! (coughing)\nYo, damn (come on Ferg)\nFerg, wake up, man, wake up (come on)\nYo, Ferg wake up, man, wake up\n(Damn, my nigga, right now, get up, man)\nYo, Ferg", "year": "2013-08-20"}]}