{"songs": [{"image": "https://images.genius.com/9bc78de515a998eed4e40863e21c20b6.1000x1000x1.jpg", "year": "2006-10-17", "title": "On Bail", "album": "Full Circle", "lyrics": "[Intro: Daz Dillinger + (T-Pain)]\nYeah, help for the helpless!\nBig money, big cars.. big weed! [T-Pain adlibs]\nY'all know what time it is! But you better stack that money!\n(Awww shit! Ha ha ha ha...)\nFor baaaiiilll....\n\n[Chorus: T-Pain]\nI'm on bail, got that weight for sale\nStrawberries and blueberries all on a nigga's tail\nI'm on bail, bet not 'nare nigga tell... bet not 'nare nigga tell\nYeah!\nI'm on bail, got that weight for sale\nStrawberries and blueberries all on a nigga's tail\nI'm on bail, bet not 'nare nigga tell... bet not 'nare nigga tell\nYeah!\n\n[Verse 1: Daz Dillinger]\nI'm on a two million dollar bail\nCaught with the product that them young niggas sell\nI'm fresh outta cells, twelve hours later.. my clientele hit my pager\nThe situation gettin thick, Dat Nigga Daz is major!\nI live the life of a gangster, I rob gangsters\nTen years up on the table, I deny that flavor\nShe a fighter to the fullest, if I lose I catch a bullet (bullet)\nCan't tell a nigga nuttin when he starvin and losin\nNow I'm back up on the street, completely correctly\nYou disrespect me, it's the same that's it's gon' be\nAutomatics get tragic when you let niggas have it\nThen I'm caught back up like before, I gotta stack my cabbage\nMonday morning, 8:30 right back in court\nCouple of homeboys, my momma give me full support\nRaised up filthy but the Lord be with me\nLike an addict, it's the verdict and the jury, \"NOT GUILTY!!!\"\n\n[Chorus: T-Pain]\nI'm on bail, got that weight for sale\nStrawberries and blueberries all on a nigga's tail\nI'm on bail, bet not 'nare nigga tell... bet not 'nare nigga tell\nYeah!\n\n[Verse 2: Xzibit]\nThey used to have me on that paperwork\nCause I used make my paper.. work, lifestyle covered with dirt\nSee I was first on my block with .40 caliber Glocks\nSimilarities to my uncut, they ready to rock (ready to rock)\nCause everybody wanna ball, nobody wanna get caught\nOnly the pros and the cons get to stack these knots\nMotherfuckers want that Benz with the millions by the karats\nWhen they fencing all day, they start talkin like a parrot\nInformation they sharing so be cautious where ya walk\nNever pillow talk behind closed doors in the dark\nIt might creep back and bite you, indict you, convict you\nTo a five by nine for a very long time\nFuck droppin dimes, niggas is droppin whole hundreds\nSo the hood's gettin skinny and the one-times love it\nIf I don't go get it, then the next nigga will\nSo I kill at will with my gauge in them killin fields\nYeah!\n\n[Chorus: T-Pain]\nI'm on bail, got that weight for sale\nStrawberries and blueberries all on a nigga's tail\nI'm on bail, bet not 'nare nigga tell... bet not 'nare nigga tell\nYeah!\n\n[Verse 3: The Game]\nYo X, tell my momma to put the house up, wait, the house cost too much\nTell her to get a hundred grand out the Porsche truck\nIt's just like a house cause I take a bath in it\nGet ass in it and I gotta stash in it\nSmoke hash in it, blueberry chocolate tah\nSmokin chronic make me see shit, like 2Pac alive\nBandana knotted in the front like 2Pac alive\nWalkin out the courthouse spittin on the camera guy\nI bang (Thug Life), but this ain't Death Row\nThis some gangster shit for my niggas down on death row\nExhibit A - watch how I let the tec go\nAnd Exhibit B - burn the rubber on the West coast\n\n[Chorus: T-Pain]\nI'm on bail, got that weight for sale\nStrawberries and blueberries all on a nigga's tail\nI'm on bail, bet not 'nare nigga tell... bet not 'nare nigga tell\nYeah!\nI'm on bail, got that weight for sale\nStrawberries and blueberries all on a nigga's tail\nI'm on bail, bet not 'nare nigga tell... bet not 'nare nigga tell\nYeah!\n\n[Outro: Xzibit]\n(laughing)\nY'all know y'all miss that shit"}], "artist": "Xzibit"}