{"artist": "Zaytoven", "songs": [{"year": "2019-03-09", "album": "Make America Trap Again", "title": "Cease & Alamo", "image": "https://images.genius.com/e82ab55d15ce6e8ac5d0b2d42b168e83.939x939x1.jpg", "lyrics": "[Intro: Quavo]\nZaytoven\nYeah, Huncho\nIt's time\n\n[Chorus: Quavo]\nDon't play with your boy, don't play with your boy (hey)\nGot your hand out, hell no, I'm not your boy (no)\nToo many real niggas, hell nah, you can't ignore (can't ignore)\nHow I'm feelin', biatch? (bitch), Ask the Forbes (biatch)\n\n[Refrain: Quavo]\nPut that bitch on that motherfuckin' oil (drank, lean)\nI pick that pussy, then I score (huh, ayy)\nLook at the birds, they comin' (brr)\nLook at the birds, they comin' (brr)\nWe wrappin' 'em up, mummies (wrap 'em)\nWe wrappin' 'em up, mummies (gone)\nI got a Uzi tummin' (Uzi), flamed a nigga for snitchin' (graow)\nFlamed a nigga for runnin' (graow), me and my niggas, we honest (uh)\nI got a Uzi tummin' (Uzi), me and my nigga, we honest (agh)\nI got a Uzi tummin' (ayy), me and my nigga, we honest (let's go)\nFlamed a nigga for runnin' (flame), flamed a nigga for snitchin' (flamed)\nFlamed a nigga for flexin', poppin', talkin' that shit to these bitches (flexin')\nFlamed a nigga for flexin', poppin', talkin' that shit to these bitches (flexin')\nFlamed a nigga for flexin', poppin', talkin' that shit to these bitches (uh)\n\n[Chorus: Quavo]\nDon't play with your boy, don't play with your boy (nah)\nGot your hand out, hell nah, I'm not your boy (no)\nToo many real niggas, hell nah, you can't ignore (real)\nHow I'm feelin', biatch? Ask the Forbes (uh)\n\n[Verse 1: Quavo]\nReal lean spill, grippin' wood-grain wheels (wood-grain)\nGot my bitch out, French tip-toes and her heels (French)\nIf I pour a four, nigga, what you gon' pour? (huh?)\nFeelin' like Rich Homie with Cease and Alamo (hahaha)\nUsed to sell Ps on Ps at Amaco (pounds)\nReal kick-door, ran from the po-po (twelve)\nReal bankroll, got a pack of four-four (grah)\nDwayne Johnson in the pot, the People's Elbow (uh, go)\n\n[Refrain: Quavo]\nLook at the birds, they comin' (brr)\nLook at the birds, they comin' (brr, birds)\nWe wrappin' 'em up, mummies (wrap 'em)\nWe wrappin' 'em up, mummies (wrap 'em, birds)\nI got a Uzi tummin' (graow), we flamed a nigga for snitchin' (flame)\nFlamed a nigga for runnin' (flame), me and my nigga, we honest (flame)\nI got a Uzi tummin' (Uzi), me and my nigga, we honest (flame)\nI got a Uzi tummin' (ayy), me and my nigga, we honest (obtain)\nFlamed a nigga for runnin' (uh), flamed a nigga for snitchin' (flame)\nFlamed a nigga for flexin', poppin', talkin' that shit to these bitches (okay)\nFlamed, flamed, flamed, flamed, flame, flame, flamed\nFlame, flame, flame, flame, flame, flame, flame\n\n[Chorus: Quavo]\nToo many real niggas, hell nah, you can't ignore (real)\nHow I'm feelin', biatch? Ask the Forbes (how I'm feelin')\nReal lean spill, grippin' wood-grain wheels\nGot my bitch out, French tip-toes and her heels\nIf I pour a four, nigga, what you gon' pour? (huh?)\nFeelin' like Rich Homie with Cease and Alamo (hahaha)\nUsed to sell Ps on Ps at Amaco (gas)\nReal kick-door, ran from the po-po (twelve)\n\n[Verse 2: Takeoff]\nI done found the pint, now I'm formin', movin' slow (woah)\nTwo-two litres poured, of fours, that's four-by-four (four)\nTwo pots on the stove, don't fold, that's the G-code (code)\nGot your hand out, hell no, aim at your fro (no)\nReal lean sipper havin' real lean shows (shows)\nDon't understand the double cup? It keep my drank cold (cold)\nPull up in the Rolls, them rose-curtains is closed (froze)\nBad hoes front row at all my shows (shows)\n\n[Chorus: Quavo & Takeoff]\nDon't play with your boy, don't play with your boy (Takeoff)\nGot your hand out, hell no, I'm not your boy (no)\nToo many real niggas, hell nah, you can't ignore (uh-uh)\nHow I'm feelin', biatch? (bitch), ask the Forbes\nDon't play with your boy, don't play with your boy\nGot your hand out, hell nah, I'm not your boy\nToo many real niggas, hell nah, you can't ignore\nHow I'm feelin', biatch? Ask the Forbes\n\n[Outro: Quavo]\nReal lean spill, grippin' wood-grain wheels\nGrippin' wood-grain wheel\nReal lean spill, grippin' wood-grain wheels\nHow I'm feelin', biatch? Ask the Forbes"}]}