{"artist": "360", "songs": [{"album": "What You See Is What You Get", "year": "2008-03-22", "title": "Tormented Kid", "image": "https://images.genius.com/b01a68880fdf408d16b94407da51e8b8.600x598x1.jpg", "lyrics": "[Intro]\nI really—I really do love ya mate. I really love ya. I'm really sorry I hit you all the time. I promise it won't happen anymore. I promise you. This is the last time. I'm so sorry\nI don't fucking need you! I hate you! You mean nothing to me! Get out of my fucking face!\nThis is my house, I will do whatever I want!\nGet the fuck out of my way!\nDon't tell me what to do! Where do you think you're going?! Get back here! Don't walk away from your father!\n[?]\n[?] I really do love ya mate. I do. Don't tell me what to do, I own this place! You get out!\nI hate you!\n\n[Verse]\nHe was a young kid, tormented and hurt\nHis father nearly pushed him to the end of the earth\nOn his birthday, December the third\nThat day his dad was drunk, couldn't even remember the birth\nAnd he'd wish he'd go on holidays and never return\nHis whole body was cut up and severed and burned\nUsed to wake up shaking with an image of dad's face\nAnd how he use to use his body as an ash tray\nNo one suspected shit, always acting fake\nThe kid was forced to smile put on a happy face\nHe used to try and keep his chin high\nIf he let an ounce of sadness out, he'd see a fist fly\nTeachers asked about the bruising and he'd give lies\nA kid's mind with no reasoning to live life\nA thin line between hate and depression\nIf it wasn't with his fist, he'd hit his face with a weapon\nThe thought of suicide, he'd jump a lake in a second\nWithout him, his mum wouldn't be safe and protected\nHe often thought of standing up and fighting back\nWas too scared, he knew he'd cop another strike and bash\nExcept for one day, he came home from school\nHe was about to leave to a mate's home for pool\nHe heard screams from upstairs in the bedroom\nMum was yelling but it sounded like sex too\nHe was raping her, cold blooded and fearless\nNobody was near it and nobody could hear it\nAnd why did they deserve this punishment for?\nThen he snapped; he couldn't give a fuck anymore\nThen he ran to the room, possessed by a demon\nSaw her throat seething and her nose bleeding for no reason\nShe hobbled down stairs, broken her leg\nPoured his gin all over his wife, an emotional wreck\nAnd the kid stood in the doorway, eyes darkened and black\nThe father was smashed, laughing as he start to attack\nHe ducked the first swing, it didn't connect\nOut of nowhere the dad grabbed the kid at the neck\nSqueezing his life away, stared in to his eyes, it rained\nHe didn't show it hurt, he managed to hide the pain\nHe sat squeezing and screaming and crying\nBut the kid let him do it and squeeze it in silence\nIf he kept going, he would dead him for sure\nThen his grip let loose, he flopped next to the floor\nAnd the mum stabbed him in the back with a kitchen knife\nRipped inside screaming in pain, ready to give her life\nHe saw his mother on the tiles of tears\nIt was the first time he'd seen his mum smile in years"}]}