{"songs": [{"year": "2018-12-07", "image": "https://images.genius.com/80e366d2b08e909dd44f09fc7ce98806.1000x1000x1.jpg", "title": "Crystal in der Town", "album": "Monument", "lyrics": "[Intro: Junkies & Kollegah]\n„Ey, Bro, ich brauch' da mal… kannst du mir was geben, Bruder?\n„Erstmal nicht ‚Bro‘, das ist immer noch ‚Boss‘ für dich\n„Ey, Boss, Alter, ich hab' noch zwei…“\n„Junge, halt mal Abstand, halt mal zwei Meter Abstand!“\n„Ich blas' dir auch ein'n!“\n„Ehh, du Ekelhafter! Eh, mach ma' Abstand! Ey, Jungs, Jungs, ganz ruhig Blut! Was wollt ihr?“\n„Bisschen Crack und Crystal!“, „Ehh, Crack!“\n„Crystal? Kannste haben, hier!“\n„Ich hab' seit zwei Tagen nix mehr geraucht!“\n„Ja, ist gut, nimm das, Junge, hier, ich werf' dir das hier vor die Füße. Heb's dann gleich auf, ja?“\n„Danke, Boss!“\n„Yeah, ja, nehmt das mit, Jungs. Ist auch mit…, eh, ist auch ohne Rattengift gestreckt. Tfuh“\n\n[Part 1: Kollegah]\nEinfluss wie das Medellín-Kartell (hey)\nGeb' ich's deiner Freundin schreit sie stundenlang am Spieß, als wär' die Biatch auf Repeat gestellt\nGuess who's back? Ah, du hast besser die Nummer vom Notarzt parat (Obacht)\nDenn ich hab zwanzig Margaritas intus mit Koksrand am Glas\nK zu dem O, omnipräsent\nViel Kontrolle durch Geld in der Orwellschen-Welt\nRegel' Waffendeals in Jordan-Tretern mit Ordensträgern aus Nordkorea\nMeine AP diamantenbesetzt (bling)\nDu brauchst 'nen Bodyguard, weil du das Haus nur mit Kanten verlässt\nUnd gern hinterm Schrank dich versteckst wie in flagranti beim Sex\nGönnjamin-Wochen, du wirst befördert von Putze zum Pflegekraft zweiten Grades (nice)\nHeißt, du machst das Gleiche, doch darfst ab jetzt dabei ein Abzeichen tragen (Glückwunsch!)\nYeah, das ist zukunftsreich\nGenau wie der Porno, den ich mit der Mutter von dir produziere, denn das Ding kriegt locker mehr Views und Likes als PewDiePie\nIch mach's übers Netz, so wie Volleyball-Spieler (ey)\nJa, die Bitch ist gebrechlich, doch folgt dem Gebieter wie'n Golden Retriever\nYeah, und zwar auf allen Vieren, wie die Ho es verdient hat\nSpaß beiseite, kein Grund, sich so anzustellen, Bitch (yeah, ah)\nIch meinte natürlich Pitbull, weil der Boss nur Kampfhunde besitzt (Bitch)\n\n[Pre-Hook: Kollegah]\nIch tick' Crystal in der Town, als Junkie checkst du irgendwann\nDas Mittel frisst dich auf und du gibst mittelfristig auf\nAber bis es dich dann auch letztlich hinrafft\nKriegst du von mir selbstverständlich weiter Crystal in der Town\n\n[Hook: Kollegah & Harry Quintana]\nEs sollte niemals seine Wirkung verfehlen\nSondern fröhlich zirkulier'n in der Vene wie'n Zirkus-Tier in der Manege\nCops sagen nix, doch wissen es genau\nIch tick' Crystal in der Town, Crystal in der Town (Town, Town, Town)\nAlso bitte halt dein Maul, ich fahr' mit Bitches durch die Town\n20 km/h und halt' dabei den Mittelfinger raus (ja, ja)\nIch mach' Holiday in Saint-Tropez und ficke deine Frau (ah, ja)\nDoggystyle in der Suite mit 'ner Kippe in mei'm Maul (yeah, yeah, yeah)\n\n[Part 2: Harry Quintana]\nHoes in Cartagena (oh), Hoes in Ipanema (okay)\nDer Himmel tiefblau wie die Dose von Nivea\nBitch, ich bin ein Unternehmer, also lass was unternehm'n\nWie, du hast gar kein Budget? Das ist doch alles kein Problem (alles kein Problem)\nWir fahr'n direkt in Richtung Sunset in mein'm neuen S 500 (yeah)\nRamm' dich einfach von der Straße, du steigst aus und sagst dann danke (haha)\nMein Lifestyle überzeugt dich nicht, dann schau wie deine Freundin mein'n Schwanz leckt\nDas ist mein proof of concept (ja, ja)\nKannst du mir erklär'n, wozu du weiter frontest?\nGuck, ich hab' die Desert Eagle in der Hand, I teach you how to stunt (ja)\nUnd nein, ich tick' kein Crystal in den Streets, doch meine Bitches sind aktiv\nEs geht zwei Mal pro Woche von Bujana nach Paris (ah)\n\n[Pre-Hook: Kollegah]\nIch tick' Crystal in der Town, als Junkie checkst du irgendwann\nDas Mittel frisst dich auf und du gibst mittelfristig auf\nAber bis es dich dann auch letztlich hinrafft\nKriegst du von mir selbstverständlich weiter Crystal in der Town\n\n[Hook: Kollegah & Harry Quintana]\nEs sollte niemals seine Wirkung verfehlen\nSondern fröhlich zirkulier'n in der Vene wie'n Zirkus-Tier in der Manege\nCops sagen nix, doch wissen es genau\nIch tick' Crystal in der Town, Crystal in der Town (Town, Town, Town)\nAlso bitte halt dein Maul, ich fahr' mit Bitches durch die Town\n20 km/h und halt' dabei den Mittelfinger raus\nIch mach' Holiday in Saint-Tropez und ficke deine Frau\nDoggystyle in der Suite mit 'ner Kippe in mei'm Maul"}], "artist": "Kollegah"}