{"artist": "C-Rayz Walz", "songs": [{"title": "Camouflage", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Hook: Sample from [?] and (C-Rayz Walz)]\n\"Don't camouflage, don't camouflage your feelings\" (Camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\"\n\n[Verse 1: C-Rayz Walz]\nFrom 41 shots, we Dodge like Neons\nStill smelling foul from the bullshit we be on\nMore than word—you heard the actions of speech\nI seen a lot of things change like blacks with money\nCats say they pack heat but the boiler's broken\nIt's easy to be iced out when your mind's frozen\nThe proof is absolute truth.  We call it raw\nIt rains and most still go chasing waterfalls\nExcited by the night life and the trife streets\nI recall the pictures of Elijah staring at me\nNow we hustle with the grim reaper in gym sneakers\nPhlegm speakers.  When it comes to reefer, it's deeper\n(We was young flowers!) surrounded by weeds\nCamouflage feelings blend in with the trees\nBefore “Degrees,” I studied with the fiends in the park\nAnd the fire from the crack pipe made the day dark\nAnd it's still art!\n\n[Hook: Sample from [?] and (C-Rayz Walz)]\n\"Don't camouflage, don't camouflage your feelings\" (Camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\"\n\n[Verse 2: C-Rayz Walz]\nYou want wealth?  Search for self.  Find what you looking for\nI got a Boogie Down mind with a Brooklyn jaw\nMy Queen’s life through your eyes—my sneakers is your size\nTo speak it through the rhyme sound better equalized\nBurnt down buildings, pyramids, project piss\nIt's like life revolves around cliques, clips, and spliff\nChicks in whips.  Here's a tip: hollow ones'll split ya zipper\nAnd the triggers get you stuck on the Island like Skipper\nAnd the Gilligans'll kill again.  Blank spots?  Fill 'em in\nTank tops?  Metal men.  Train stops?  Adrenaline\nRush hour, change seats, the pain seeps\nRun straight through every town like Main Street!\nMy brain keep the days of high-top fades, Gazelle shades\nAnd MCs getting live on stage\nGym star, bar scars—act like you doing time\nSee through the fine lines ‘cause the mind's design as camouflage\n\n[Hook: Sample from [?] and (C-Rayz Walz)]\n\"Don't camouflage, don't camouflage your feelings\" (Camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\"\n\n[Verse 3: C-Rayz Walz]\nBulletproof gun-brellas for the rain in the TEC\nRubber-grip nines will test, split ya vest, kiss ya chest\nFor the hell of it, I live where life is irrelevant\nDead friends stay in my head like elephant.  Memory\n(Necessary by any means!)  This too shall pass\nChalk outlines your body like a sick art class\nCrack is eighteen years old.  So young but treacherous\nThe destruction of the hood is effortless—the error is\nMad kids be like “Yo.  Why she had me?”\n“Ayyo, who daddy is?”  “This my other baby daddy”\nWhat a fucking shame.  I'm drunk in the rain, ducking the pain\nMy soldiers sling.  I meditate with a migraine\nYou want my chain?  I hope you know white crane\nOr get flamed left in a puddle of money.  Maintain\nI want change—tired of drugs and rats, thugs and gats\nThere's still love for you, black—hip hop and rap\nIt's camouflage\n\n[Hook: Sample from [?] and (C-Rayz Walz)]\n\"Don't camouflage, don't camouflage your feelings\" (Camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\" (We all camouflage)\n\"Don't camouflage, don't camouflage your feelings\"\n\n[Outro: C-Rayz Walz and Samples with Black Panther Scratches]\n[C-Rayz Walz]\nCamouflage.  (C-Rayz Walz).  Stronghold on the prowl.  Camouflage.  Black Panther on the prowl.  Camouflage.  Big god on the boards.  (You don’t see it).  “Days easy”—say it proud.  Yo, camouflage.  Hearing it in the lounge.  (You don’t see it).  It’s going down.  It’s camouflage\n[Samples with Black Panther Scratches]\n\"Life as a shorty shouldn't be so rough” - Inspectah Deck on Wu-Tang Clan’s “C.R.E.A.M.” (x5)"}]}