{"artist": "50 Cent", "songs": [{"album": "The Massacre", "image": "https://images.genius.com/ca36dfbff5c6dfcea453afdb61476f86.1000x1000x1.jpg", "title": "Build You Up", "lyrics": "[Intro: Jamie Foxx & 50 Cent]\nLa la la… Yeah!\nLa la la la la la la la… Uh huh\nOoh I’d lie for you baby\nOoh I’d die for you baby\nI like the way that feel\n\n[Pre-Verse: 50 Cent]\nI’ll build you, but if ever I fall down\nAnd I need you to pick me up\nPromise me, you’ll be around\nHold me down, I’ll build you up\n\n[Verse 1: 50 Cent]\nListen, if you let me, I’ll be the reason you shine\nIt’s the secret, I want the world to know that you’re mine\nBut on some real shit, communications could be better\nSo I’m writing this song instead of a love letter\nThey gon’ play it on the radio a hundred times a day\nI figure when you hear it you gon’ stop and think of me\nI wanna get to know you, and be the reason you smile\nGirl you know where I’m from, you know how I get down\nWhen times get tough, tell me that I’m special\nNot rap, I mean me, that I’m special\nYou know they say diamonds are a girl’s best friend\nPrecious stones, could you put me before them?\nIf so, I’ll see to it they always around\nNothing but the best, now how does that sound?\nIf I drop a jewel when we talk you can keep it\nGirl you on my mind all the time, that’s a secret\n\n[Chorus: Jamie Foxx]\nBaby, I build you up\nGirl, if I know for sure I have you by my side\nI’d build you up\nGirl, I need to know for sure you’re mine\nI need to know for sure\nGirl, if I know for sure I have you by my side\nI’d build you up\nGirl, I need to know for sure you’re mine\n\n[Verse 2: 50 Cent]\nI thinkin’ ’bout you thinkin’ that you feel the same way\nOr is it just my imagination that get runnin’ away?\nIf you ready to ride, girl, c’mon, let’s roll\nG-5-5 fly, ma, let’s go\nIt’s hard to measure the pleasure of havin’ you in my presence\nYour smile makes me smile, I’ll show you my style\nYou can shop a little bit, I’ll pick out some shit\nOne pair at a time ’til your shoe game sick\nNow who knows what the future holds we’ll be together probably\nFor better or worse, like Whitney and Bobby\nIf you wanna play house, we can play house then\nBut wait, why pretend when you can move in?\nBefore I be your buddy in bed let me be your best friend\nGirl, it’s more than lust, I want your trust\nYou keep it real with me, I keep it real with you\nCause I know with you by my side there’s nothing I can’t do, yeah\n\n[Chorus: Jamie Foxx]\nBaby…\nGirl, if I know for sure I have you by my side\nI’d build you up\nGirl, I need to know for sure you’re mine\nBuild you up, baby, when you’re down\nGirl, if I know for sure I have you by my side\nCuz your smile, like a frown, yes I will\nI’d build you up\nGirl, I need to know for sure you’re mine\nI’m gon’ build you up baby\n\n[Outro]\nLa la la, la la la la la la la la\nLa la la, la la la la la la la la\nLa la la, la la la la la la la la\nLa la la, la la la la la la la la", "year": "2005-03-03"}]}