{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Time to Die", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Hook: King Gordy]\nI'm all alone in my basement with a gun. (I'm so high)\nI'm all alone in my basement with a gun. (Time to die)\n\n[Verse 1: King Gordy]\nAll the stories I'm livin. Paintin portraits of me being hanged\nAnd tortured by midgets. Am I worth the minion?\nLife of a skitzo\nThat's playin a normal person. Hides it so good though\nHe's prayin with you at church and he's takin your kids to football\nGames, your favorite neighbor\nWho really just wants to cook your brains, and taste 'em later\nI'm that guy at that McDonald's that be serving your food\nYou heard the news. Local worker done murdered to morning crew\nGod told me to do it. I'm deaths angel\nCalm only when doing that Mary Jane girl\nThe nicest person that you never want to meet\nHas to restrain himself from killing everyone he sees\nBlastin your brain with shells, hittin seven of your peeps\nA bastard that made hell, I'm who the devil wants to be\nBlack magic, I'm sayin spells hoping the dead will come to me\nI'm all alone in my basement with a gun\n\n[Hook: King Gordy]\nI'm all alone in my basement with a gun. (Pull the trigger, pull the trigger) (I'm so high)\nI'm all alone in my basement with a gun. (Pull the trigger, pull the trigger) (Time to die)\nI'm all alone in my basement with a gun. (Pull the trigger, pull the trigger) (I'm so high)\nI'm all alone in my basement with a gun. (Pull the trigger, pull the trigger) (Time to die)\n\n[Verse 2: King Gordy]\nOngoing investigations\nI've been compared to Jason\nThough he's for choppin up fourteens by the lake\nFor God sakes\nTheir only fourteen\nEyes open like they wide awake been dead for four weeks\nSmokin weed takin Thorazine\nDeath is certain. Help me please, thinkin morbid things\nSelf murder was corsin through my veins\nHorrible, hurts the brain\nListen to Jimi Hendrix. Worshippin Kurt Cobain\nThe ghetto Edgar Allan Poe\nSever your head with a staff to the throat\nYou're better off dead. Roll his ashes to smoke\nA sorry orphan kid that lived in foster homes\nStarved and torn man. Wish he had some parents of his own\nNow he walks the streets. Everyday thirsty for blood\nHe been stalkin me, everyday running for us\nGive me some more lithium, I have the urge to bury shit\nI need some help for this, I got to stop killing my therapist\n\n[Hook: King Gordy]\nI'm all alone in my basement with a gun. (I'm so high)\nI'm all alone in my basement with a gun. (Time to die)\n\n[Verse 3: Bizarre]\nI'm supposed to be playing professional hockey\nShort and stocky. With a hook like Rocky\nI'm deadly than full blown AIDs\nMatta fact, I got full blown AIDs from fuckin John Bennet\nMy little girl got a heat exhaustion\nI thought that she would be alive after two weeks in Boston\nSexy women... I fucking hate\nTie me up with a rope and feed me corn flakes\nMy grandmother... She just turned 75\nFor a gift I'm giving her a black eye\nSex offender who calls himself Ronald\nJacking my dick, watching the excersise channel\nMy mother... she's a known slut\nMy job is ear her pussy and make sure the grass is cut (Like this mommy?)\nOn Van Dyke and Harper eatin a big baby\nIt's not a hamburger... It's a fucking old lady\n\n[Hook: King Gordy]\nI'm all alone in my basement with a gun. (I'm so high)\nI'm all alone in my basement with a gun. (Time to die)"}]}