{"artist": "Immortal Technique", "songs": [{"title": "Reverse Pimpology", "lyrics": "[Intro: Immortal Technique]\nHypocrites, hookers, sex offenders\nY'all niggas wanna be pimps and players?\nThis ain't 1997 nigga\n\n[Verse 1: Immortal Technique]\nI'd rather be rich and unhappy than broke and miserable\nCause the game don't give a FUCK if you lyrical\nAnd that's pitiful, so my position is pivotal\nYou can hate me all you like but you worship the principle\nI inspire revolution, the government's not invincible\nVietnam to Venezuela, trick knowledge, they pimpin you\nAll up in the hood like McDonald's and liquor\nSelling AIDS medicine, when we know you got the cure nigga (woo!)\nYou leery of conspiracy theory but hear me\nFrom a business perspective, it makes more sense clearly\nCause moreover, that's what we go to war over\nAnd numbers don't lie unless we do Bush and Gore over\nFree markets make money disingenuously\nBut I invest in agriculture, biochemistry\nSmart nigga from the hood, pussy, what type of crime is that?\nBut exec's are like, \"You from Harlem? Where your diamonds at?\"\nStupid\n\n[Chours: Mojo and Immortal Technique]\nCan't dodge the game\nIf you lookin' for the money or the fame (oh-ohh)\nThe players and the rules ain't changed (oh no)\nBut see we tryin' to leave a name\nSo we're turnin' out\nYeah, this is how pimps get pimped and players get played\nRich people get robbed and, broke niggas paid\nNew York, London, Chicago, Philly and L.A\nMiami, D.C., B-more and out in the Bay\nWe're tearin it out of the frame\nSee we deserve to stake that claim\nIf we didn't it's a cryin shame\nWhat we're concerned about is how to turn it out\n\n[Verse 2: Immortal Technique]\nShow me a pretty girl, with the world stuck to her\nAnd I bet you there's a brother that's tired of fuckin her\nLots of niggas girls is someone else's one night stand\nI probably made some bitches nervous listenin with they man (ha ha)\nAnd if that offends somebody, I'm sorry, fuck you!\nWhat you think, revolutionaries don't like to fuck too?\nYou just gotta beware of dangerous coochie\nCover ya head like a kufi, some rappers think that they live in a movie\nUntil they get herpes or clap from a groupie\nAnd I don't need to shout you out, nigga you know who you be\nLook, most people are only players cause they got played\nAnd have not, let go of that, shit since the 7th grade\nYeah you got your heart broke, life sucks, doesn't it?\nBut you shouldn't fuck up someone else's life because of it\nSomeone did your mother like that, that's why you fatherless\nBefore jail or racist cops, that's what the problem is\n\n[Chours 2: Mojo and Immortal Technique]\nSee who's the one to place that blame\nWe getting trapped in cycle of pain\nWith a generation headed down the drain\nThat's how we're turning out\nThis is how pimps get pimped\nAnd players get played\nBeautiful women get cheated on\nAnd gangsters strayed\nJersey, Detroit, Denver, Phoenix, Atlanta\nTexas, Vegas, Seattle and fuckin Louisiana\nRegardless of the money you're paid\nYou spend it on a watch and a chain\nBut can't offer your children a thing\nWhat the hell is goin' on in your brain?\n\n[Verse 3: Immortal Technique]\nYeah, I'm not a crack rapper, I'm not a backpacker (ha ha ha)\nI'm not a wack rapper, moonlighting as a bad actor\nI treat labels like the projects, cause I'm a hater (what!)\nGo to the Sony building and piss in the elevator\nCater to hustlers, crooks and cheap smugglers\nBootleg my own album, to reach customers (yeah)\nEvery city, state and country, the hood love me\nEven Aborigines, in Australia bump me\nThey say underground fans are all the color of talcum\nBut who the fuck you think buy 50 and Jay albums?\nWho the fuck you think made Snoop and Dre platinum?\nCall up any major record label and ask 'em\nBut there's some, devils in disguise in hip-hop\nThat belong at Republican fundraisers with Kid Rock (bitch!)\nI hope one of my fans has one of your kids shot (bitch!)\nAnd blames it on Acid, Prozac and Slipknot\nYou a pussy actin hard like a bitch cop\nI'll drop you to the floor like a reverse wristlock\nEat your food and shit on you, like a highway pit stop\nAnd make, revolutionaries out of kids that used to flip rocks\nThe government, pimped 9/11 to go to Iraq\nAnd history, repeats itself right on track (how?)\nFirst as a tragedy, and then the comedy begins (why?)\nCause it's funny, motherfuckers don't see it come around again\n\n[Outro: Mojo and (Immortal Technique)]\nWhere, can we be free? (FUCK we gon' be free man?)\nWe only wanna live our lives\nLive our lives, with our eyes open\nOpen your eyes open your eyes\nYou stupid motherfuckers - you stupid motherfuckers\nOpen your eyes, before you die", "image": "https://images.genius.com/cbb36cff0867b087bc47fcf98b7cd803.300x300x1.jpg", "album": "The 3rd World", "year": "2008-06-24"}]}