{"artist": "Benzino", "songs": [{"lyrics": "[Inrto: Benzino]\nSo vicious, Yellow City, Zino\nThis beat is crazy\nLR, yeah c'mon\nMario, you did it this time\nUnh, this that shit right here, dawg\nLet's talk about it\n\n[Benzino]\nWould you love me if I fell on hard times?\nLost everything, down to a dime?\nWould you, let me fuck if I didn't stack cheese?\nDidn't see my face on BET?\nWould you, stop for me, if I wasn't on dubs?\nDidn't buy the bar when I walk through the club?\nWould you, let me slide if I wasn't so live?\nAverage joe working nine to five?\nWould you still wanna ride?\nStill wanna freak if the ice wasn't bright in the masterpiece?\nIf you didn't lose sight when I flashed the three\nWould you still be shakin that ass for me?\nWould you, creek, let me run in it?\nKiss the first night, take it to the limit?\nIf I had to go to jail would you hold it down?\nIf not, shit I'ma leave ya now, I need to know\n\n[Chorus: Mario Winans w/ ad libs]\nI gotta know, baby\nWould you be right here beside me when I'm gone\nStill have my back without promise to have it all\nBaby this is what I'm fighting for\nOh tell me cuz I gotta know\n\n[Lisa Raye]\nDon diva, first name Lisa\nRaye, freshly dipped in Burberr-ay\nMy team is green with red cherr-ay\nIf I was broke would you still wanna marry?\nIf I wasn't on the screen, would you still fiend?\nAnd would I still be your dream?\nIf I didn't gleam on my own\nWould you still be in that zone?\nWould you never leave me alone?\nIf I was a Reebok hood rat would you still book that flight\nOutta town, if I didn't stay laced?\nCouldn't cook would you still be in my life?\nNow, Made Men, act like ya know then\nLisa Raye, Benzino, a perfect man\nYellow Man, Yellow City, here we go again\nAnd with a beat like this ya know it's sickening\n\n[Chorus]\n\n[Lisa Raye]\nWould we, fall apart if things got hard?\nWill love still stand when everything's gone?\n\n[Benzino]\nIf I get too comfortable, drop my guard\nWould you let the next man come and take my job?\n\n[Lisa Raye]\nNah, never that, LR got your back\nI never let another man come between that\n\n[Benzino]\nThat's right, I know I got a good girl in my corner\nThere when I need ya, run when I want cha\nMe and you L, we takin it there\nSo stop playing games, you ain't keepin it fair\nI'm down to ride wit'cha, use to cry wit'cha\nAll them otha chicks, they outta the picture\nMaybe it's a rap, I don't know for sure\nYou gotta let me know or I'm out the door\nLike I told you before, you'll always be my girl\nTogether we can come for the world, I need to know\n\n[Chorus] - repeat 2x", "image": "https://images.genius.com/6e1c33f62c229b45d503c4857602a733.1000x1000x1.jpg", "year": null, "title": "Would You", "album": "Redemption"}]}