{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Hook]\nSet it off Kane (go, go) get busy (go, go) [repeat 8x]\n\n[Verse 1]\nWho's that smooth fellow flowin to this tune?\n[\"Big Daddy\"] Back so soon?\nThe fact is, I never left\nCause I'm everlastin and my rhymes keep blastin\nSoon as I pick up the pen and relate it to paper\nThat's the beginning\nAnd for you Filthy McNasty MC's, that's the ending\nCause when I grab the microphone just like a gun\nYou know them doo-run-run-run, them doo-run-run\nHeh, I'm not your ordinary lyricist\nNone'll compare at this, as far as raps, pssh\nI'm takin care of this\nI work the stage like a slavehand\nAnd keep the girls screamin' just like Captain Caveman\nI did shows at the same arena that held Ike and Tina\nAnd the Chi-Lites, song have you seein her\nPuttin' me on after Jennifer Holiday, ain't no thing\nBecause I still come off, after the fat lady sings\n\n[Hook] [repeat 4x]\n\n[Verse 2]\nHere we go, Shalamar style\nThat means the Second Time Around so pump the sound\nAs I progress to bless the mic and strike the stage\nEnraged arouse the crowd to jump and pump their fists\nAnd twist their waists with grace and clap and snap\nAnd move and groove cause I'm still, so, smooth\nIf you compare the Big Daddy to a Caddy\nI'd be an Allante, suave as Belafonte\nInterplanetary and extraordinary (hmm, what about poetic?)\nMmm, very!\nI've even heard it said that I was the ultimate\nWelllll.. maybe just a little bit\nAnd competition I'll explain to them\nThat this don't even pertain to them\nTo try to flow like this will crack your cranium\nSo to the rear and let the Prince of Darkness spark this\nLike a vampire, bloodthirsty, uhh, have mercy\n\n[Hook] [repeat 4x]\n\n[Verse 3]\nAs we enter into the third half, for this paragraph\nI wanna take all of the people that's leaping along with this tune\nTo another plateau they never been too -- as I continue\nWith somethin funky to get into\nGive me a James Brown, Funkadelic, or Prince beat\nAnd watch me turn the microphone to minced meat\nI tear the roof off the mother as soon as my lips pucker\nCause I'm a bad mother *TWEET!!*\n\n[Hook] [repeat 8x]\n\nI'm a baaaad man!", "image": "https://images.genius.com/a2b6c1f81a06fdc0135b948af50859be.400x397x1.jpg", "year": null, "title": "Git Bizzy", "album": "Prince of Darkness"}]}