{"artist": "Z-Ro", "songs": [{"album": "Legendary", "title": "Come With Me", "lyrics": "Come with me\nGun with me\nDo you wanna ride or die\n\n[Chorus]\nCome with me, real niggas ain't no bums with me\nWhat do we have here now? Do you wanna ride or die?\n\n[Verse 1]\nI'm out on bond but I thank god cause right now I'm not in jail\nTrying to hang me over nothing can't tell me I'm not in hell\nAin't got shit on me so they wanna catch me making a sale\nJust wanna lock up a rapper to have a story to tell\nIf I was walking she keep walking since I'm not she gon' choose me\nCause it got 200 on the dash and the \"B\" on its booty\nThe inside look like a basketball call it Spaulding in here\nFeel like i play for Houston Rockets bitch I'm balling in here\nSign this disclosure no picture taking no calling in here\nSit up straight and don't touch nothing act like the law is in here\nGo head and take off your panties take off your bra up in here\nIt's just marijuana, cocaine ain't what you saw up in here\n\n[Chorus]\nCome with me, don't be afraid I've got my gun with me\nWhat do we have here now? Do you wanna ride or die?\nCome with me, real niggas ain't no bums with me\nWhat do we have here now? Do you wanna ride or die?\n\n[Verse 2]\nLook 2002 drove an intrepid all through mo-city Texas\nDrunk so much codeine my nasal passage was never congested\nNow when I wake up i just might blow 1000 on breakfast\nThis ain't your usual salad that ain't no regular lettuce\nI got a hell of a schedule I got a lot going on\nEveryday it seem like i say look like we not going home\nI don't talk to these broads\nI only talk money on my phone\nIf they ain't coming with none of that\nThey can't come in my home\nI love my haters for hating me cause they keep me promoted\nThey're the reason i get more money but they dont even know it\nAssault rifle in every room in case they come kick my door in\nI know they think I'm a rapper they better watch where they going\n\n[Chorus]\nCome with me, don't be afraid I've got my gun with me\nWhat do we have here now? Do you wanna ride or die?\nCome with me, real niggas ain't no bums with me\nWhat do we have here now? Do you wanna ride or die?\n\n[Verse 3]\nNine people murdered in the church my nigga I ain't the one\nI'm in here singing and praying but I brought more than one gun\nPolice don't write no more tickets just trying to murder someone\nMight as well say rest in peace as soon as another one come\nThey on my bumper if I go left then they making a left\nWant me to reach for my wallet so they can tase me to death\nMad at me cause what they make in a year I make in one check\nMad at me cause I did that shit without me breaking a sweat\nI'm on my way to pick up a bag hoe you making me late\nI got a warrant and the jail is where you taking me straight\nKnock out my bond and my lawyer without me breaking the bank\nBack at the crib before you get off bitch I'm dranking some drank\n\n[Chorus]\nCome with me, don't be afraid I've got my gun with me\nWhat do we have here now? Do you wanna ride or die?\nCome with me, real niggas ain't no bums with me\nWhat do we have here now? Do you wanna ride or die?", "year": "2016-11-11", "image": "https://images.genius.com/799a9f5c14f8c15dbd33ecb8fe6a4906.640x640x1.jpg"}]}