{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Bitch Please", "album": null, "lyrics": "You ain't trying to hot box with me, I swing hard liquor\nGoing down by the second round, all hail the underground\nHow that sound? Xzibit backing down from a conflict\nFuck the nonsense! Terrorist, hidden bomb shit\nGlass and metal in every direction\nInnocent bystanders taught a very hard lesson\nI'm the reason there's no time to reach for that weapon\nAnd reason why niggas with problems keep on steppin\nXzibit ready to scrap like Mike Tyson with his license back\n9 to 5 minimum wage? What type of life is that\nFor me? It's blasphemy, you fuckin around\nWith the Sundance Kid and Butch Cassidy\nYou had the audacity to wanna tangle with the X\nStrangle your neck, slap you like the opposite sex\nDrunk driving, trying to stack my loot\nWhile other rappers getting \"Treated Like a Prostitute\"\nSo check the SoundScan\nAll I wanna be was a G, ha!\nMy whole life, nigga please, ha!\nBreaking off these motherfuckin keys, ha!\nLet's get these motherfuckin G's, ha!\nNigga you don't wanna fuck with this\nOh no, big Snoop Dogg\nBack up in the heezee bay-bay\nYou jocking my style? \"You so cra-zy\"\nDre say, ain't \"No Limit\" to this\nAs long as we drop gangsta shit\nLook here bitch, you fine and I dig your style\nCome fuck with a nigga and do it \"Doggystyle\"\nI'll be gentle, sentimental\nShit, we fucked in the rental\nLincoln Continental\nCoast-to-coast, L.A. to Chicago\nI get this pussy everywhere that I go\nAsk the bitches in your hood cause they know\nBitch please! Get down on your god damn knees\nFor this money, chronic, clothes and weed\nLook, you fuckin with some real O.G's\nBitch, please! Now what you need to do is\nHem my coat, and roll me some dough (f'real)\nDiff'rent strokes for diff'rent folks\nOh, you like setting niggas up and getting them loc's?\nA cute lil' bitch with a whole lotta heart\nShit gets thick when the light gets dark\n\nShe say she got a lick for me (well hook it up)\nWorth about 200 G's and 30 ki's!\nNow check this out Dre: now, if I don't move\nThen a nigga like me, shit, I don't lose\nBut you know me, Dogg I'm movin!\nAin't nothing to it but to get to groovin\nYou've been waiting on a nigga like me\nTo take that chance and rob your man and beat up the pussy\nA victim of the circumstance\nThat's the devil, they always wanna dance\nSee we go out with a bang (bang BANG!)\nI'm trying to work this cold thang\nAnd take this whole thang\nI get the money everywhere that I go\nI bust a bitch and take her money fo' sho\nI get the money everywhere that I go\nI bust a bitch and take her money fo' sho\nAiyyo.. aiyyo aiyyo!\nYou don't wanna step to me\nStill claiming D.P.G. til the day I D-I-E"}], "artist": "Xzibit"}