{"artist": "Boosie Badazz", "songs": [{"album": "Touchdown 2 Cause Hell", "title": "Black Heaven", "year": null, "lyrics": "[Intro]\nBlack heaven is a place where people like me go\nUp there in black heaven, black heaven\n\n[Verse 1: Boosie]\nKnow Dr. King still preachin' about togetherness\nBut probably lookin' down sayin' it's irrelevant\nWhitney Houston, she was heaven sent\nA song bird prolly smilin' right now listenin' to her own words\nRosa Parks so much heart, she an OG\nKnow she smilin' lookin' at the blacks in the front seat\nBernie Mac jokin' right now, him and Richard Pryor\nTrayvon prolly lookin' down sayin' them niggas wild\nI know who givin' knowledge up there, 2Pac\nHe lookin' down like what happened to this hip hop?\nBiggie Smalls prolly swagged out, laid back\nHim and Eazy talkin' bout how it was way back\nNate Dogg prolly reminicin' about the A-Trak\nPimp sayin' prayers that Bun and Jay stay strapped\nMichael Jackson? He prolly maxin' and relaxin'\nHim and Marvin Gaye makin' a classic\n\n[Hook: Keyshia Cole]\nI know you smilin' down up there in black heaven\nI know you're really proud of me up there in black heaven\nI know you smilin' down on me in black heaven\nThinkin' of you til the day we meet again\n\n[Verse 2: Boosie]\nBillie Holiday thinkin' about the old days\nJohnny Taylor makin' mixes with the Ojays\nRodney King prolly thinkin' bout his old ways\nThinkin' bout how they burned the city down bout his old case\nMalcolm X prolly wishin' he was down here\nTo take our hoods back from the people who ain't from round here\nJames Brown still hollin' it's a man's world\nBut thinkin' damn all these girls takin' man's girl\nKnow Jackie Neal talkin' bout how people roll\nKnow Tooki Williams still stickin' to the G code\nWilt probably still saying nobody broke his record\nMac Dre still represent as a bay legend\nKnow I and Bleek prolly talkin' bout me\nThem niggas prolly jam with Big Stone, out the three\nDJ Screw lookin' down at the culture that he started\nRest in peace Bob Marley\n\n[Hook: Keyshia Cole]\nI know you smilin' down up there in black heaven\nI know you're really proud of me up there in black heaven\nI know you smilin' down on me in black heaven\nThinkin' of you til the day we meet again\n\n[Verse 3: J. Cole]\nWhere do my niggas go to when they pass?\nAnd why do good niggas never last?\nSome get addicted to the fast route\nThe hand in hand, you know that cash route\nI pray to God that we see better days\nI caught a record while the record plays\nI'm thinkin' Lord don't let 'em carry me\nSee I know one day when they bury me\nI'll go straight to black heaven, black heaven\nYeah I go straight to black heaven, black heaven\nDon't let the paranoia get to me\nCan't take a trip to penitentiary\nI make a flip and take the summer off\nA half a brick? Now that's a somersault\nI look to God, it's been along road\nI got my braid up, like a cornrow\nI've been through hell, one day I'll find my way\nIf not then maybe I can buy my way to black heaven", "image": "https://images.genius.com/8927e3d1157b8dc7a6d11e144b27a0b7.498x498x1.jpg"}]}