{"artist": "King Los", "songs": [{"image": "https://images.genius.com/a9bc5b4fe746b1be8d76a46edd25590e.500x500x1.jpg", "title": "All On Me", "year": "2014-03-24", "album": "Zero Gravity 2", "lyrics": "[Hook]\nIt's all on me (all on me)\nMan it's all on me, man it's all on me\nMan it's all on me, man it's all one me\nAnd that's what it's gon be\nRich nigga don't sleep\nBitch nigga gon creep\nBut a nigga gotta eat\nMan it's all on me, yeah it's all one me\nI guess it's all on me man, it's all on me\n(All on me)\nIf I'm number one I'm gon get this shit on my own\n(And that's what it's gon be!\nCause it's all on me man, it's all on me.)\nThen they fucked around and got a nigga back in their zone\n(I ain't worried 'bout you, why you worrying 'bout me nigga?)\nMan it's all on me, man it's all on me\nMan it's all on me, man it's all one me\nRich nigga don't sleep\nBitch nigga gon creep\nBut a nigga gotta eat\nSo it's all on me\nYeah it's all on me, man it's all on me\nMan it's all on me!\nRich nigga don't sleep\n\n[Verse 1]\nU ain't know nothing nigga\nIt was touching blocks and got chill\nFeds are calling my niggas\nI still made it off the block and got rich\nYou ain't know nothing nigga\nHad it harder in the slums\nLost my cousin to the streets\nLost my father to a gun\nYou know we famous for the blow\nEverytime we roll, dropping hella bands, 50K or more\nKnow I got brothers in the game 1 locked up and just came home\nDo anything for my niggas\nSo fuck you lames I'm back in my zone\nI'm back in my zone, I'm reloaded bang\nFort like Norte Dame, buddish rollie\nMy little nigga told me put you out\nAll he want is a frozen chain, And this shit go bang\nI don't really know what's in his brain\nBut I tell you niggas simple and plain\nIt fall on me, My nigga said he need bail\nFuck it! Charge it to the game\n\n[Hook]\n\n[Verse 2]\nU ain’t know nothing nigga\nLost a homie to the feds\nLost a record deal still said imma get this bread\nMan U ain’t know nothing nigga\nSaid imma hustel hard, they can take away the fame imma trust in God\nYou know i’m famous for the flow\nEverywhere I go, pumpin' hella fast 50K or more\nYou know it’s suckers in the game, they do lame shit like faking they wrong\nTold my city imma get it, i’m just mad it took me this long\nIt took me too long, how [?] running with the feds\nHella shit was running through my head, niggas ending up dead\nHate to see marty like that, they took his girl and they hit him for the bread\nNigga we was bread, right in the [?] shit\nWhere love don’t really mean love\nWhere smile don’t mean a nigga really happy for you\nSo since the day I found out what it was\nIt’s all on me!"}]}