{"songs": [{"lyrics": "[Hook]\nI can’t fuck a lame nigga\nPut some diamonds on your teeth so you can give me brain nigga\nCount a check and fuck me next, I’m hanging with the same niggas\nYou can’t even handle bitches, we are not the same nigga\n\n[Verse 1]\nNice smile, pretty face, I cum\nHe like the way I taste\nNever force it on a nigga, backwood’s how I start the day\nYou a pussy, you a rookie, I can see it in your face\nGangster bitch, but I’m a freak\nHe fell in love, I ain’t amazed\nAsian Doll, Young Carti\nI’m tryna fuck, but hardly\nHe liking all my pictures, got these lame niggas salty\nTold that bitch to catch up, she be geeking on a Molly\nLately I’ve been wasted, ride my boat and go to Charlie’s\nDamn\nI’m geeking I be taxing for a feature\nShe be fucking for a feature\nThese niggas they real good leechers\nGrab my hair it’s thirty inches, skinny bitch that like it deeper\nSame goals, road to riches\nDoing drill, but I ain’t snitching, yeah\nBut I ain’t backing out, smoke you like a black and mild\nFree 600 Breezy, he the first to eat my cookie out\nI don’t understand what all the cap about you Mickey Mouse\nMan it’s all the bullshit, bitches talking, I be living proud\n\n[Hook]\nI can’t fuck a lame nigga\nPut some diamonds on your teeth so you can give me brain nigga\nCount a check and fuck me next, I’m hanging with the same niggas\nYou can’t even handle bitches, we are not the same nigga\n\n[Verse 2]\nUzi vert, oou I'ma skrt\nPrada purse and I’m a flirt\nPop the trunk like it’s my cherry, leave your bitch ass in the dirt\nLying nigga, playing stupid, I’m not your hoe so I don’t care\nCreeping on the dick, he going swimming now my stomach hurt\nTake my skirt off, school swag make a nigga work\nText him, \"Baby you gon’ give me neck till I'ma fart\"\nHe put his all in me, cause I’m the bitch to do it first\nApologize for what? I’m crazy grew up like the purge\nFuck you thought nigga?\nFuck with me it cost, nigga\nAsian Doll the boss, nigga\nMe me and Young Dolph, nigga\nPhilly nigga on his bike, he pop a wheelie in it\nChasing all the milly only fucking with saddity bitches\nYou need a slut, what?\nI’ma let you cuff some\nWhen they get too comfortable, is when I gotta cut them\nYou need a slut, what?\nI’ma let you cuff some\nWhen they get too comfortable, is when I gotta cut ‘em\nYou need a slut, what?\nAlmost let you cuff some\nWhen they get too comfortable, is when you gotta cut ‘em\nGang! Scissors", "album": "ChiTexas3", "year": "2017-07-30", "title": "Lame Niggaz (Remix)", "image": "https://images.genius.com/69a7fee41156e220692409a997ec3979.640x640x1.jpg"}], "artist": "Asian Da Brat"}