{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/15f6e5c5e09f71c035331315412025ea.450x450x1.jpg", "title": "Catch the Beat", "year": "2007-09-16", "album": "Money", "lyrics": "[Verse 1]\nOkay good evening everyone and welcome to the track\nThat you probably downloaded from your PC or your Mac\nYes, I'm the main topic in the barbershop chat\nNow you can call me Chip, or you can call me crack\nI'm in a comfy condo with every one of your ladies\nNow say hi girls...\nSsh, okay how about some silence?\nLet's see if I can focus while these girlies tickle my privates\nYes, baby I'm the Ripper\nBaby, I'm a winner\nThick girl's a freak but she say she's a beginner\nI'll put you on a diet if you're trying to get thinner:\nBabies for breakfast, babies for dinner\nI grip the damn grain 'til my hands get splinters\nI control the ball before the snap just like a center\nBut this ain't football\nCuz if it was then your bitch would be the wide receiver crawling on the rug\nAnd I would be the quarterback telling her to go long\nAnd she would catch the touchdown pass above her thong\nSomething must be wrong\nWhat is going on?\nEverybody's T-shirts are still too damn long\nYeah, that was cool a couple years ago but now it's different\nI don't pay for the jeans, I just pay true religion\nAnd of course the man on my shirt's riding a horse\nAnd I wear so much DC they should endorse\nLive life denim\nI live life in 'em\nWear so much Live Mechanic people ask did I invent 'em\nPeople tend to forget where I'm from here and there\n'Cuz I'm on Saks Fifth Avenue more than I'm on Da Clair\nAnd if you owe me a dollar you on Death Row\nThat .45 hurt to swallow like strep throat\nFuck a lady, get the money, sip the liquor\nThese bitches ain't shit, mother nature was a stripper\n\n[Hook 4x]\nNow watch me catch the beat\nCatch the beat\nCatch the beat\nCatch the beat\n\n[Verse 2]\nPimp, I get my limp on\nWhat the hell is Chip on?\nIn a five fifth the same color as my skin tone\nBig balls, dick long\nPants was a thousand\nP.R.P.S baby girl, I be stylin'\nThat nigga be wildin'\nTrend setter, ho\nThat means if you got it on then I don't\nThat means if you doing that, the I don't\nIf you niggas is buying out the bar then I won't\nI'll just take them hoes that you had to my crib\nGive them Tanqueray to sip\nThen sit back and watch them strip\nThen sit back and get my dick sucked\n(Get my, get my dick sucked)\nHoes will do anything for a nigga with big bucks\nAnd we got them big bucks, that's a no brainer\nMy CuDi got the top dropped I'm driving a no brainer\nThen I upgrade, we don't test drive it\nI'm in the sky cracking jokes with the pilot\nI'm on the DoLo\nCatch me in that polo\nYou fuck with my money, I'm in your ass (No homo)\nI'll be in the fo' do'\nCounting that fa'sho dough\nI don't do promo, cuz promo means no dough\nHop on the train, let's get wicked\nI'm the train conductor, I hope you have a ticket\nGirls want to kick it, but I just want to stick it\nI should put a counter on my balls like Skip-It\nI got a Ruger and I'm not afraid to shoot it\n(What the fuck is that smell?)\nOh yeah, I pooted\nMy stomach is bubbling\nI have to take a shit, umm\nWhere's the nearest toilet or corny rapper to shit on?\nGet money, get goin'\nUsed to get picked on\nNow all the hoes watch me just like a sitcom\nSLAB in this bitch don't get punched and kicked on\nNobody is on the level that Chip's on\n\n[Hook 4x]"}]}