{"artist": "Pharoahe Monch", "songs": [{"album": "W.A.R. (We Are Renegades)", "title": "Clap (One Day)", "image": "https://images.genius.com/2694343eb76859336bf01cf74ae9f24b.250x250x1.jpg", "lyrics": "[Verse 1]\nYou should never in your wildest dreams shit on a nigga\nPolice eat a dick, straight up, you know why? Clap!\nClap on, clap off\nClap at them and I do not mean applause\nRap nicer than Santa with no Claus\nTrack twice as bananas with no chorus\nUh, yeah, it's suicide murder\nIn the hood like catalytic converters\nOn the block like Lego\nIn the streets like street light\nThree Little Pigs is what I be on these beats like\nIn other words the police, say it, say it like Pac: \"the Po-Lice\"\nFuck' em, and that's straight from the underground\nWhere little kids got it bad cause we brown\nNow who am I? P-Monch, from Do or Die, South Suicide, Queens, where I get down\nI peep surveillance in the street every summer\nYou may not play lotto, but you know these numbers\nThe 105th, the 103rd\nMy peoples in Queens doing 13 if we get the urge to get on some Todd Scott shit\nMy brains a Glock clip\nMy lames be on some 1-800-COPSHOT shit\n\n[Hook]\nSay we were gonna, say we were gonna get it together, yeah, yeah, yeah\nOne day, one day, one day, one day, one day I said the people gon' clap!\nWatch me clap to this!\n\n[Verse 2]\nWe went from niggas to porch monkeys, to negroes, to blacks, back to niggas again\nYet niggas is still hungry\nAbolish the N-word, the plan's so corny\nWhile homeland security cams are all on me\nThey watch through the fiber optics\nIt dawned on me that cops can just run in your spot quick without warning\nThey educate the masses to follow, it's so boring\nI sat in the back of class, asleep, snoring\nAnd they ask me why I'm vocal and adamant\nCause I lost my focus like governor Patterson\nAnd the ghetto is impossible to escape\nAnd the first obstacle is this tapeworm in my abdomen\nSpear-chucker, fuck that, I toss javelins and $5,000 bills in the face of James Madison\nThis is an American post mortem, to focus on you bogus, Novus Ordo Seclorum, clap!\n\n[Hook]\nSay we were gonna, say we were gonna get it together, yeah, yeah, yeah\nOne day, one day, one day, one day, one day I said the people gon' clap!\nWatch me clap to this!\nNow everybody watch me clap! clap!\nNow everybody just-\n\n*clapping*\n\n[Verse 3]\nNo respect, no manners, it's Mad Max with multiple macs\nMad banana clips, and a black hammer that hits the back of a black talon\nA slew of hollow tips through the wall of your blue silence\nAnd selective theatrics, collective dramatics\nI'm systematically pissed, clap automatic for Mumia Abu Jamal\nMaybe I’m Crispus Attucks, P’s a fanatic for peace, but you angered a pacifist\nThe Gospel, I spit it like Jesus of Nazareth and then emphatically clap\nAt any obstacle, an impossible feat, the fathom is not logical\nBut chronicle the thought of the people cause on day we gon' clap!", "year": "2011-01-18"}]}