{"artist": "Cadet", "songs": [{"title": "Gipset Flow", "album": "The Commitment EP", "year": "2016-02-19", "image": "https://images.genius.com/0201973804fabde671b6c59cddb79e18.600x600x1.jpg", "lyrics": "[Chorus]\nThis is my Gipset flow, ahh\nGipset flow, ahh\nThis is my Gipset flow, ahh\nMy Gipset flow, ahh\nThis is my Gipset flow, ahh\nMy Gipset flow, ahh\nThis is my Gipset flow, ahh\nMy Gipset flow, ahh\nThis is my Gipset flow\n\n[Verse]\nAight, cool, let me show them\nThey think it's all singalong bars and emotional shit\nMan, bro, are you dumb?\nEverybody from the Gipset Tally been shows\nAlways have a Gipset Tally [?]\nNuttin' but Gipset Tally in your speakers\nMCs don't wear gold in the ends\nAll of my dogs dem are golden retrievers\nNah, nah, nah, nah, where? Are you dumb?\nDon't you know who's in the room?\nMan was out screaming sky\nMan was out screaming kaboom\nCool, I'm back on my Gip stuff\nNo motivation, man get lift up\nReal talk, yo, ever since that I did stuff\nIt's like man forget that I'm Cadet, Cadet\nCool, let me remind you\nWorld war, man a typhoon if I find you\nKill an MC calm if I've got time to\nFam have to talk through a box like a drive-thru\nA bunch of street fighters\nBut none of us Ryu\nAnd nah, don't send for man\nCause word, it will get shocking if I write you (Raichu)\nYeah, a tune I can vibe to\nWent from a teardrop phone into iTunes\nIt's my time for the hit like bat 'em up\nGot Konan in the back like \"pattern up\"\nUh, MCs get nervous\nAll of their shutdown bars ain't working\nMad ting, when I say Cadet, it's curtains\nEven had Charlie Sloth like (perfect)\nUh, C-A-d-d-d-d-d-d-d-d-d, I'm back\nMan never cared about dough, no\nMan only cared about being on the map\nBrudda, we had the whole sound from smash\nEverybody knew the bruddas, even before we rapped\nAnd that's right now, if I open the shell\nBro, you ain't getting that shell back\nAnd man chat shit, that's Jme, Giggs\nCause man don't really care about all that\nAnd mandem are even forcing punchlines\nWell, you ain't gotta do all that\nI don't wanna hear man talk about sick\nAnd meaning vomit, bro, that's basic\nI don't wanna hear man talking 'bout defeat\nAnd meaning feet, bro, that's basic\nCool, let me show you\nHow to punchline every line, let me go through\nI just wanna sell gold hair, that's Goku\nYoung nigga tryna eat right, that's Nobu\nSonic in the tunnel, I tell dogs roll through\nAnd they show up at the door, that's postal\nMan don't really want beef, that's tofu\nBarbarian, Konan flow, old school\nKiller, calm, let me switch it\nYeah, they know I've got powers, I'm a Misfit\nThese girls love a nigga's rhymes, that's diction\nSo the girls wanna see me, I'm a chick flick\nHolding my team together like I'm Pritt Stick\nI just wanna get off the ground like I'm a [?]\nTryna be the star on top, yeah, that's Christmas\nI can let the girl twist up, yeah, that's lipstick\nOh man\n\n[Chorus]\nThis is my Gipset flow, yeah\nThis is my Gipset flow, yeah\nThis is my Gipset flow, yeah\nThis is my Gipset flow, ahh\nGipset flow, ahh\nThis is my Gipset flow, ahh\nMy Gipset flow, ahh\nThis is my Gipset flow, ahh\nMy Gipset flow, ahh\nThis is my Gipset flow, ahh\nMy Gipset flow, ahh\nThis is my Gipset flow"}]}