{"artist": "Bas", "songs": [{"lyrics": "[Verse 1]\nWe gon make it baby, no discussions\nBas is nasty, spit disgusting\nGunna and 500 know a nigga hustling?\nGot a 20? Fuck it, cop the buds and eat some Ruffles\nFar as mook? We gon need a duffle\nDo it by the book. Nigga we don't need a duffle\nNo police, no more trouble\nBut I'm troubled, got a homie who ain't heed the warning till they slugged em\nNow we miss em and we love em\nYea we love em\nLord, I just wanna see his face!\nI browse the profile page of my homie slain\nI saw a post from a lady and this is what it say\n\"I cried when you passed away I still cry today\nAlthough I loved you dearly, I couldn't make you the stay\"\nLive the Land of the Free, but we missin' the brave\nThey tell me \" Remember me when you hittin' the stage\"\nIn the darkness of night, I'm just missin' the days\nThat's why I spit on this mic, like I was kissin' the grave\nYea Boi I\n\n[Chorus]\nRhyme a few bars so I could buy a new car\nAnd then I kick a few flows, so I could pimp a few hoes\nRhyme a few bars so I could buy a new car\nAnd then I kick a few flows, so I could pimp a few hoes\n\n\n[Verse 2]\nI used to know this girl she was the Devil in disguise\nOne look in her eyes\nYou would turn to gelatin\nShe only fuck with rappers if you ain't one you irrelevant\nOnly fucks with athletes if you ain't one then she take off like a track meet\nYea exactly\nWhen I rap she know exactly what I'm saying ( I'm saying)\nAnd when a nigga ball she know exactly what I'm playing now\nIf we go to eat, she look at me till I'm paying now ( I know )\nHold up now\nYou're a groupie. Say it loud, say it proud!\nBitch you lazy or you just a fool?\nShout out to Misha, had her baby and still finished school\nI'ma believer\nOne day I'ma sit on a stool\nOn top the world and remember I used to sit on a stoop\nNever swerve in the coupe\nWhen it's work in the coupe\nNow I pirate the game, tryin' to earn me some loot\nI tell em \" Stop being Nazi you better serve me my soup \"\nBut this ain't Seinfeld\nI flip that like some clientele\nYea motherfucka'\n\n[Chorus]\nRhyme a few bars so I could buy a new car\nAnd then I kick a few flows, so I could pimp a few hoes\nRhyme a few bars so I could buy a new car\nAnd then I kick a few flows, so I could pimp a few hoes", "image": "https://images.genius.com/3a8075617f644e56b5052719b9461d85.1000x1000x1.jpg", "year": "2013-05-22", "title": "Stronger", "album": "Quarter Water Raised Me Vol. II"}]}