{"artist": "Bas", "songs": [{"lyrics": "[Produced by Ogee Handz]\n\n[Intro]\nFuck a penny for your thoughts, nigga, anyhow\nI just called my nigga Ron, he brought the Henny out\nGot them things in the Kool-Aid in this motherfucker\nLike a gang of Gorillas in this motherfucker\n\n[Hook]\nThat's a closed book, when she with me got your bitch open\nAnd she don't get mook, when she with me got your bitch smokin'\nBe alert, be alert, be alert, be alert, be alert, be alert\nBe alert, be alert, be alert, be alert, be alert, be alert\nThat's a closed book, when she with me got your bitch open\nAnd she don't get mook, when she with me got your bitch smokin'\nBe alert, be alert, be alert, be alert, be alert, be alert\nBe alert, be alert, be alert, be alert, be alert, be alert\n\n[Verse 1]\nNo tats but my passport got plenty\nI board flights and I ask, \"Do you got Henny?\"\nAnd she say, \"Courvoisier\"\nI say, \"Fuck it, I would like plenty\"\nHow many these nights do I got in me\nCouldn't really tell, blind every day, the same time\nPicture every face drawn on got on a for sale sign\nMe? I gotta stay sharp, can't afford a stale mind\nSee? I'm 'bout my bread, motherfucker\nAnd I can't afford a stale mind\nMy city grimy, that Rollie shiny, well, you can't afford to tell time\nAnd they gotta take squats on the jail time\nCause nobody got guap for the bail bonds\nAnd they had to get street cause college ain't cheap and\nMama gon' eat, if we gotta pop heat so be it\nPuttin' in work, Soviet, and that shit work, you see it\nPut your latest work in a hearse and I send it to the dirt\nLil nigga, that's where your CD is, CC 'em\nAh, put 'em on alert, me? I make art cause it's from the heart\nLove me 'til I'm gone, when I die you gon' have to hit a fuckin' museum to see it, Bas\n\n[Hook]\nThat's a closed book, when she with me got your bitch open\nAnd she don't get mook, when she with me got your bitch smokin'\nBe alert, be alert, be alert, be alert, be alert, be alert\nBe alert, be alert, be alert, be alert, be alert, be alert\n\n[Verse 2]\nYeah, you know the models on the coupe\nBut you don't even know what's in your food\nNigga, Google it, be alert, be alert\nBe alert, be alert, be alert, be alert\nPut your young ass in debt\nNow they got hands on your handsome check\nYou in check, nigga, be alert\nBe alert, be alert, be alert, be alert\nShe catchin' VD's and passin' 'em off like TD's and you knee deep\nBe alert, be alert, be alert, be alert\nYeah, whole country at war\nAnd you don't even know what for cause we only want more\nBe alert, be alert, be alert, be alert, be alert", "image": "https://images.genius.com/8c8242497a7ae3f9893198c96eeca87b.1000x1000x1.jpg", "year": "2014-04-29", "title": "Mook in New Mexico", "album": "Last Winter"}]}