{"songs": [{"title": "Always Knew", "album": "All Things Work Together", "year": "2017-09-22", "image": "https://images.genius.com/747844e49a25266360c34f8cab2cc4de.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, this right here is dedicated to my family, my friends, my lady, everybody that helped me down through the highs and lows. Especially the Lord, you know what I mean? You held a bright light in my life, you feel me?\n\nShine a light on me\nYou shine a light on me\nYou shine a light on me\nYou shine a light on me\nYeah, ayy\nShine a light on me\n\n[Verse 1]\nLearned a lot over these last few years\nIndustry people ain't friends, just peers\nI learned that these girls easy like the morning of a Sunday\nThey don't love you 'til you gone like Harambe\nStill killin' over colors, now it's black and blue\nWe dyin' every day, B, we just don't make the news\nWhen you speak out for your race, just watch\nThey gon' twist and say you hate these cops\nI'ma take these shots\nHow can he love Jesus, Kanye, and K-Dot?\nMartin, Malcolm, and Schaeffer, Mitsubishi, and Maybach?\nContradictory, nah, it's complimentary\nUnderstanding me ain't for the simple and elementary, oh\n\n[Pre-Chorus]\nI know this might go over some heads\nBut I come from being government fed\nCould be running from feds\nBut now I give the government bread\n'Cause you playin' back the words that I said\n\n[Chorus]\nI can't believe we made it through\nMy momma said she ain't surprised, told me that she always knew\nMy day ones still the same ones, love to the crew\nI told my lady, \"I ain't never met nobody like you\"\nI thank you\n\n[Verse 2]\nNow I remember, uh, I was sittin' in my room\nGlued to my television daily after school\nAnd I never saw me goin' to college\nHigher learning was a different world, I can acknowledge\nI used to imagine me in a black Range\nGettin' paid from doin' this lil' rap thing\nAnd now I'm payin' these professors couple thousand for a lesson\nGraduated, in recession, Sallie Mae just wanna check in, I'm stressin'\nRap music, it was all a dream\nNow I'm in a session chasin' my dream\nWho would have knew? Man, it's crazy\nS1 introduced me to JAY-Z\nNever met my dad, but I met the music that raised me\n\n[Pre-Chorus]\nI know this might go over some heads\nBut I come from being government fed\nCould be running from feds\nBut now I give the government bread\n'Cause you playin' back the words that I said\nThat's crazy\n\n[Chorus]\nI can't believe we made it through\nMy momma said she ain't surprised, told me that she always knew\nMy day ones still the same ones, love to the crew\nI told my lady, \"I ain't never met nobody like you\"\nI thank you\n\n[Verse 3]\nListen, I know God did it, can't take the credit\nPaid off all of my debts, but I still feel so indebted\nBeen all over the world with these songs I wrote\nMy life story oughta to give y'all hope\nWithout a doubt I've been doubted and counted out\nI've been down for the count, about to quit\nMomma told me keep going 'cause I was made for this\nI either get a scholarship or I could get a hit\nI still can't believe I made it here\n\n[Chorus]\nI can't believe we made it through\nMy momma said she ain't surprised, told me that she always knew\nMy day ones still the same ones, love to the crew\nI told my lady, \"I ain't never met nobody like you\"\nI thank you\n\n[Outro]\nShine a light on me\nYou shine a light on me\nYou shine a light on me\nYou shine a light on me\nYeah, ayy\nShine a light on me\nYou shine a light on me\nYou shine a light on me\nYou shine a light on me\nYeah, man"}], "artist": "Lecrae"}