{"artist": "IDK", "songs": [{"title": "Porno", "lyrics": "[Chorus: IDK]\nYour strawberry lemonade lips\nMake a nigga blood pressure go drip, drip, drip\nBad hoes is the devil, like six-six-six\nBad hoes is the devil, like six-six-six\nWhen I got you on my mind ain't no room for a thot\nWhen you layin' on my chest ain't no room for my heart\nGirl, you know we wastin' time like tick, tick, tick\nGirl, you suckin' up my time like tick, tick, tick\n\n[Verse 1: IDK]\nThe bible say beatin' my dick and killin' is equal (Huh?)\nBut that don't add up (Right?), 'cause the amount of times\nThat I milk my shit I'll probably be considered serial (Ayy, hahaha)\nThem Cocoa Puff tittie balls make a nigga balls\nFall inside of her jaws while her drawls fall\nAll like a nightstand in the earthquake caused\nBy the backstroke, dog style, all wild\nKill the pretty kitty, leave a X over its eyes like a KAWS clown\nShit! That's a fuckin' bar\nFuck her in a '69, that's a fuckin' car\nRolls Royce and the roof is the fuckin' stars\nKillin' niggas every time I write like it's fuckin' \"Saw\"\nLeave 'em charred, leave 'em Charmander without the tail spark\n(That mean that nigga dead!) Oh well, I have no fuckin' heart\nBack to my banana, this brain food is why she smart\nYellow and her head on point, it's like her brother's\nBart Simpson, no O.J, it ain't fit so she must acquit\nTake my Johnnie Cochran out and sit it on her pretty lips\nSex addict with no intent to ever quit\nThis what happens when you exposed to porn at the age of six\n\n[Interlude]\n(It's goin' on, it's goin' on)\nThere's something goin' on\n(Something's goin' on, you know it's goin' on)\nThere's something—\n\n[Bridge: Kapri Styles & IDK]\nYo!\nI hit him with the charm, make him put it on my arm, like\nYou don't need no job when ya pussy is the bomb\nBackshot, backshot, ATM, now she gone, like\nYou don't need no job when ya pussy is the bomb\nI wanna, I wanna, I wanna, I wanna, I wanna\nYou don't need no job when ya pussy is the bomb\nI wanna, I wanna, I wanna, I wanna, I wanna\nYou don't need no job when ya pussy is the bomb\n\n[Verse 2: Pusha T]\nIf she sellin', she workin', no lyin' (What?)\nThe price right? No flirtin', I'm buyin' (What?)\nSame day, airfare, I'm flyin' (What?)\nLove trappers, love rappers, love diamonds (Woo)\nI got it, I give it, come get it\nBirkin bags, bad bitches come with it\nCity girls, come count up my digits\nCan't break 'em, can't shake 'em, I live it (Hahaha)\n​i8, I Robot, I never  (Hahaha)\nI only, big foreigns, I pedal\nShe chase us, speed racer, daredevil\nIDK, King Push, it's levels, yugh\n\n[Interlude]\nOh my god, that fuckin' dick\nOh shit! Woo! Woo! Ah!\nLike this\n\n[Chorus: IDK]\nYour strawberry lemonade lips\nMake a nigga blood pressure go drip, drip, drip (Go 'head)\nBad hoes is the devil, like six-six-six (Go 'head)\nBad hoes is the devil, like six-six-six (Go 'head)\nWhen I got you on my mind ain't no room for a thot (Go 'head)\nWhen you layin' on my chest ain't no room for my heart (Go 'head)\nGirl, you know we wastin' time, like tick, tick, tick (Go 'head)\nGirl, you suckin' up my time, like tick-tock, tick-tock, tick (Go 'head)\nWoo!\n\n[Verse 3: JID]\nShe wanna lock lips, I just pulled over, made her stop it\nInside of my whip, when I'm drivin' it's called a cockpit\nObviously, if she ride with the kid then she givin' knowledge\nLike institutions disguised in the schools and collectin' profits\nI missed\nGive her the shit that she like some type of magician (Go 'head)\nMy magical wand mission, this clitoris infamous (Go 'head)\nGod-given, devil insidious (Go 'head)\nNo condoms in the condominium (Go 'head)\nIdiot, she do this shit for any and many men or 50 Cent (Go 'head)\nShit, I am 50 Cent, haha, word to my nigga Keem", "image": "https://images.genius.com/b77211ed800701c5cc8dc9a5a6ec95fa.1000x1000x1.jpg", "album": "Is He Real?", "year": "2019-09-04"}]}