{"artist": "Plies", "songs": [{"album": "100% Real Nigga", "title": "Bid Long", "image": "https://images.genius.com/e0a35e364bbe7570899c10c1af5b0ffc.529x529x1.jpg", "lyrics": "[Intro]\nAy, dog\nThis one here for all my motherfucking niggas that's locked up, dog\nAll my niggas who bidding in prison, my nigga\nA lot of niggas forgot about you, but I ain't forgot about you\n\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n\n[Verse 1]\nWhat can a young nigga at 19 do with 40 years?\nNot a motherfucking thing but hope for an appeal\nThem crackers giving niggas more time then they done lived\nAnd where I'm from, these crackers hiding niggas at the crib\nI asked my homeboy, \"How in the fuck you do 40?\"\nHe told me, 'You just do it, you don't think about it'\nThem crackers don't sell liqour in prison, you gotta think bout it\nBut like he told me, time ain't the thing that hurt the most\nThe motherfuckers that forget 'bout you that you thought was close\nIf he had to do it all again, he wouldn't even take it to da door\nI told him, he ain't got to tell me 'cause I already know\nHe thought he had himself some soldiers on the front row\nBut like I told him, dog, you ain't breaking bread no more\nIn these streets, dog, that's all a bitch care for\nThe real niggas in these streets are at an all time low\nAnd these hoes and homeboys ain't riding no moe\n\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n\n[Verse 2]\nNobody care about you when you ain't got shit to give\nBut when you got it, they love you while you're out of here\nThey was my niggas when they was out and they my niggas now\nRight now, they need me the most, so I got to help em out\nI turn my back on them, that mean I'm the pussy nigga, then\nAnd me being flaw is something that I don't believe in\nThere's niggas everyday that's getting lost in the system\nThe fucked up part about it: don't nobody miss them\nMy own brother can't even tell me where the crackers shipped him\nTold me that with a straight face and kept dipping\nI'm looking at dog, like, man this pussy nigga tripping\nYour own brother, you can't tell me where the crackers shipped him?\nLove don't love nobody, the streets fucked up\nThat's why I pray every day that I don't get jammed up\nTo be honest with you, I'm scared to find out what's what\nThe ones that let you down are the ones you loved so much\n\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n\n[Verse 3]\nWhat happened to niggas accepting a couple of phone calls?\nAnd what happened to niggas sending flicks to they dog?\nYour dog down bad right now, go on and break them off\nYou got to answer his calls for y'all to even talk\nIt ain't like you can call him, shit, when you wanna talk\nSome niggas doing time right now, that ain't they fault\nIn this world, it's a black law and it's a white law\nA street nigga, dog, we don't die of old age\nA street nigga, dog, we die one or three ways\nWe get shot, die in prison, or we die of AIDS\nI know it's already written, how I'ma leave here one day\nBut all the niggas locked up, I pray for you every day\n\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n[Chorus]\nI got some niggas in prison that ain't coming home\nAnd they main hoe done put a block on the phone\nAnd all the niggas they was running with done left him 'lone\nMotherfuckers forget about you when your bid long\n\n[Outro]\nAy, dog\nIt's a lot of good motherfucking niggas locked up, dog\nIt's a lot of niggas that's locked up\nThat when they was out of here, my nigga\nThey took care of a lot of you motherfuckers, man\nMade sure a lot of y'all was good, dog\nIt's a lot of niggas doing time\nBecause of some of the motherfuckers out here, dog\nAnd now, when a nigga get locked up, man\nY'all can't make sure dog got cantine money?\nY'all can't make sure y'all send dog flicks, man?\nY'all can't accept dog's phone calls, man?\nYou put a block on the phone 'cause you fucking anotha nigga, man?\nDog, keep it real with yourself, homie\nIf dog looked out for you and took care of you, my nigga\nFor 2, 3 years while you was out of here, dog\nThe least you can do is take care of dog for 2 or 3 years, dog", "year": "2005-03-01"}]}