{"artist": "The Game", "songs": [{"title": "Big Dreams", "album": "LAX", "year": "2008-03-18", "image": "https://images.genius.com/bba1920bee43a618432ce43748293ec6.1000x1000x1.jpg", "lyrics": "[Intro]\nCool & Dre\nBack on the motherfuckin Westside\nL.A.X. niggas, yeah\nY'all know who the fuck I am\n\n[Verse 1]\nI'm free as a motherfuckin' bird I swear\nDisappear in thin air, there go Game, nigga where?\nPosted on the block, in them black Airs\nIn that all-black Phantom, hug the block like a bear\nYeah, that V-12 is roarin\nFlyin' through the city with the pedal to the floor then\nI put them 26, inches on the curb\nTell the hood I'm back, give me a corner let me swerve\nSwerve, I'm still dope, that's my word\nAll I did was switch the kitchens and subtract all the birds\nIrv... Gotti know I'm a murderer\nHalf these niggas beefin' with me, I never heard of them\nIf I was the old me, I would murder them\nMatter fact, if I was the old me? I would CURTIS them\nCourtesy of my Smith & Wesson\nI kill tracks like AIDS nigga, get infected!\n\n[Hook]\nThe whole world been waitin' on him\nHere I come, droptop Phantom I'm skatin' on 'em\nLook around, all the bitch niggas hatin' on him\nMad cause I'm Chronic 2008'n on 'em\nBig cars, big wheels, big chains (Yeahh)\nBig pimping, big money, big dreams\nDreams (Dreams) big dreams\nDreams (Dreams) big dreams, dreams\n\n[Verse 2]\nI \"Get Money\" like Junior M.A.F.I.A. used to\nOn my way to school, ten thousand in my FUBU\nLunchtime I was sellin'\nBehind the bungalows, baggin' up rocks the size of melons\nThat's when the fiends start tellin'\nYou can catch 'em on the couch, everyday at 4 o'clock like Ellen\nPrimetime nigga, is my time nigga\nJacob ain't got shit to do with my shine nigga\nCause when the sun come up\nFrom behind the sea, niggas see me behind the B\nENT, don't stand for entertainment\nIt stand for zero to 60, anybody see where Game went?\nTo the hood, parked crooked behind that chain fence\nAnd I'm goin' down behind my dogs but I ain't Vick\nTell me one album I put out that ain't sick?\nNo I'm not the Doctor, but I produce the same shit!\n\n[Hook]\n\n[Extended Hook]\nBig cars, big wheels, big chains (Yeahh)\nBig pimping, big money, big dreams\nDreams (Dreams) big dreams\nDreams (Dreams) big dreams, dreams\n\n[Verse 3]\nThe Chronic, Makaveli to Doggystyle\nBad influences, so my momma told me to turn 'em down\nShe went to sleep so my father said I could turn it up\nWhat did he care, he in the bathroom sherm'n up\nSo I let that Dogg Pound rock\nLet that Ice Cube knock, 'til my sister pressed stop\nSoon as she left out, like Diddy, I Pressed Play\nThat's when that Hard Knock Life, introduced me to Just Blaze\nI would sit in my room, and just blaze\nBefore chronic had all these funny names, it was just haze\nNo hash, cause it was just haze\nAnd I would get so high, nigga that I would just gaze\nI mean I was so amazed somethin' so fuckin green\nCould turn this little-ass house into a maze\nChronic 2001, got me through my hardest days\nAnd just think, my momma said marijuana was a phase\n\n[Verse 3 Street Single (Alternative)]\nYo Jay, what it do, nigga?\nI done rocked enough fellas to be you, nigga\nI got my 40-40, they my two Jiggas\nThey’ll make you ‘Holla Holla’, I Ja Rule niggas\nThe lions in the room, what up Fat Joe?\nI’m Curtis' Kryptonite, and the nigga Joey Crack know\nWhoever said “The Game over” must’ve had a hangover\nGet money, my driveways sponsored by Range Rover\nI got Blood Diamonds, straight outta Angola\nThe way my red rag in the air signal Lil Wayne over\nYeah, that’s when the Cris start poppin'\nThe pills start droppin' and the haters start watchin'\nThe DJ starts spinnin', the panties get to droppin'\nFor album number 3, and going Platinums not an option\nI’m back with Cool & Dre, AKA ‘The Monsters'\nAnd I got one word for you motherfuckers..\nCOMPTON!\n\n[Hook]\n\n[Outro]\nYou was wrong momma\nShit I love you but I'm still smokin\nI love you momma!\nChronic 2001 to infinity MOTHERFUCKER, haha\nDr. Dre started it\nI just finished it! I mean, a-hem\nPicked up where the big homey left off, FEEL ME?\n(IT'S COMPTON)\nAhahah"}]}