{"artist": "Beanie Sigel", "songs": [{"lyrics": "Ay Lo, run to the fridge and pop that other bottle of Cris' homey\nI'm off the weed but I'm back on my juice nigga\nPour me up an ounce and a couple of th epurps\n\n[Beanie Sigel]\nAs I skate through the city in that black cuatro\nYou fake Willies frontin like you got dough until I prove 'em it's not so\nI shine like a brand new penny from that Franklin Mint\nThat black Masi', it don't make no cents/sense\nBut to drive and make dollars, your pockets flat like tires\nYour money still ALL SLOW like new drivers\nI pop more than the collar\nYou niggas poppin cheap-ass bottles of Moet\nThat bullshit Chandon, that little chick on your arm be long gone\nWhen she recognize a real don\nI'm in the club in the cut sippin on aged grapes\nLaughin at them brolic car thieves, in their slim-ass jeans and Bath' Apes\nLookin half gay, halfway out of the closet\nYou don't believe me, nigga ask Sway\nWhat the fuck is that? You niggas need to be slapped\nWhoever co-signed bein a sucker wasn't stacked\n\nHHEH! {*echoes*}\nHHEH! {*echoes*}\n\n[Beanie Sigel]\nUhh, sit back, relax, let's rap for taste\nTrack 10 from the fits, peep my old head face\nYou see if real niggas respect it, the squares gon' rep it\nI'm guessin, that's why this bullshit keep progressin\nBut I ain't stressin, nigga class in session\nI'm here to teach you a lesson like KRS'n\n\"Criminal, Minded, you've been blinded\"\nLookin for a nigga like Sig', you won't find it\nI'm a dinosaur~! You niggas more like\nWhat I look for in a whore, heh, PUSSY!\nNuttin more, nuttin less, I'm nuttin to second guess\nI'm him, point blank period, the end\nWhen I'm long gone, they gon' dig up my bones\nAnd study my poems and learn I was MORE than the gun in the song\nEven though I spit a gat\nQuicker than I spit a rap, now go 'head sonny, run along\n\nHHEH! {*echoes*}\nHHEH! {*echoes*}\n\n[Beanie Sigel]\nNow when that sizzurp in my system, ain't no tellin\nWill I bust that four-fifth and, catch another felon'\nI'm a thug by blood, not just off drugs\nEven though I love, that purple mug\nUHH, drunk off syrup, perks and zaneesSpit a word make a bird lose her skirt and her panties (and them panties)\nI know it's been a while, since I left a stain on your brain\nGave you some game that you can gain from\nI'm here to end it now\nBreak the cycle of that bullshit same ol' same, that these lames run\nIt's a shame it's they names where they came from\nThese niggas fly-by-nights, they couldn't fly my kite\nTie my shoes, lace my boots\nThey money run short, they couldn't chase my loot\nPaper small like Coupes, I'm that Sport sittin butter soft\nHe nothin but a boss - who? Me - Sig', but of course\n\nHHEH! {*echoes*}\nHHEH! {*echoes*}", "image": "https://images.genius.com/356ca6b0db6d8d8b7be50568bdfb53c0.700x695x1.jpg", "year": null, "title": "H.H.E.H.", "album": "The Solution"}]}