{"songs": [{"year": null, "image": "https://images.genius.com/4faa518970e19e22ecdc868732305777.640x640x1.jpg", "title": "My Mind", "album": "Sleepers", "lyrics": "[Rapper Big Pooh]\nIt's a bitch sittin here tryna forget about loss\nGettin caught in the effect and lose sight of the cause\nAnd because certain things take me outa the picture\nDoesn't mean that I ain't really missin ya, it cut a brother deep\nSome nights I can't stand to sleep\nCause I'm thinkin bout them times that I played you cheap\nLike you gon' be here tomorrow, I don't need to speak\nPeep on, it be aight, I'll check 'em out next week\nNext week never came before months went by\nWhen I did get the call I found it hard to cry\nKept on bout my daily routine\nContemplatin on \"Should I go? Should I stay? What would it mean?\"\nThat we weren't as close as it appear to be\nEven though he carry the same name as me\nWishin I could go back and change history\nBut I can't so I'll dream on... for a better us\n\n[Hook: Darien Brockington]\nNow that you are gone\nLately you've been on my mind\nAnd since you've been gone\nSunny days ain't been as bright\nI've been thinkin on\nAll those days that passed us by\nNow I'm hopin for\nJust one day to make it right\n\n[Darien Brockington]\nI've been thinkin baby (it was left undone)\nYou always drivin me crazy (but you are gone)\nAnd I'm hopin someday (I'll see your face)\nAnd I'll pray we'll be together (in those pearly gates)\n\n[O-Dash]\nHidin in the midst of confusion in a game we all losin\nTryin to escape the claws of death\nThugs - pistols usin, but in reality God's choosin\nBut it seem nobody is left\nBut the ones closest to us that never knew us\nAnimatin style like somebody drew us\nComin up in this life thinkin I'm the shit\nMaybe cause I was raised in sewer\nSeen my man get stretched out with the doula\nI couldn't react cause my feet was stuck in the crack\nOften stuck with a sack of bud just to relax\nKept thoughts racin to keep my mind on track\nBein broke, how I'm 'posed to cope with that?\nNo priest, no pope can provide hope for that\nSo I kicked religion off the map, set a trap\nGot caught in my own shit, need a game to forfeit\n\n[Hook] {X2}"}], "artist": "Rapper Big Pooh"}