{"songs": [{"image": "https://images.genius.com/2fcfd1ce473ca4646149f4c51152068e.500x500x1.jpg", "title": "Shaded Summers", "album": null, "year": "2015-08-04", "lyrics": "[Intro]\nCan I talk a little bit, you dumb ass nigga. like. shit\nI really don't even like any of you guys to be honest, bro. like\nNone of you guys are about this sound shit, like you don't even make these sounds\nThis shit gotta like swing, bro\nJust let me do my shit for real\n\n[Verse 1: Night Lovell]\nYuh\nStraight calling all the hoes, where they at\n'Bout a hundred k if that ass stay fat\nStay down, never fucking with a pack full of niggas claiming that they really wanna say a fact, yeah\nSo fly with my all white shoes\nFuck that nigga, put you in a snooze\nI never really wanna give you any clues, man\nStay back and we all just cruise\nSide bitch for the foreplay\n'Bout a hundred thousand niggas coming my way\nCut, cut, cut you really down and I must say\nShe wanna try to tell me that I got no way\nDrop that shit, bitch\nLay back down, Imma sip these shots, fuck with a real nigga\nLil' nigga, but my thoughts stay bigger when I talk that shit, man please don't figure\nThink back when I'm mustn't\n'07 Teacher named Ms. Cobdess\nSaying what the fuck, nigga, what the fuck you mockin'\nJust forget that nigga, I'm plotting\nOnly shit I care about is getting nice top and\nKnowing that these bitches really never stop talkin'\nSwoop by to my place in the mornin'\nMan you lucky if your ass get parking\nYuh\nAnd the dogs stay barking\nNigga, 10 PM all my niggas stay stalking\nRunning, running, running, running never stoppin\nSomething with the cash and the fame stay calling\n8 O'Clock and my brace stay loaded\nIn the white dress and my bitch stay focused\nWalk away, miss, you probably never know this\nShe say Lovell, man you so damn atrocious, so damn atrocious\n\n[Verse 2: Night Lovell]\nNever gon' let up, Fuck a trendsetta'\nWhite chick said I got so much betta'\n12k stack, another k stack\nCalling to the fuck ass niggas pay back\nYuh, she say you bad, she say you really bad\nMan, I really really think that you the best I ever had\nYeah, thoughts stay running, cash stay jumping\nDrop that bitch quick, cause that ass stay fucking\nYeah, 50k for the condo\nI fuck around and pay 100 for the Lambo\nReal niggas pay niggas by the handful\nBust it, bust it, bust it for the man though\nBitch I think you got it\nGot a name like Leia\nI don't do shit and she say that I'm a playa\nTake it to the mayor\nBitch, back please, man, don't say shit just get on your knees, man\n\n[Hook]\nNever gon' get her, never gon' get her, never gon' get her\nThat bitch I never met her\nNever gon' get her, never gon' get her, never gon' get her\nShe say that I'm a playa\nNever gon' get her, never gon' get her, never gon' get her\nThat bitch I never met her\nNever gon' get her, never gon' get her, never gon' get her\nShe say that I'm-\n\n[Outro: Lovell's Father]\nAll of them girls from california, yeah\nGirls from Oakland they be in LA\nBronx, Brooklyn, Queens, I don’t need a jet\nPut your hand on the ear and say"}], "artist": "Night Lovell"}