{"songs": [{"title": "Daily duppy", "lyrics": "Yo, I don't give a rats arse or rassclaat are your spars hard when your par par\nDon't start are your bars hard, have you mastered how to spar with a bastard?\nWe been dark since the march of the spartans\nBefore Eve ate the fruit of the garden, I was in pursuit of the truth like a slalom\nDodging these sergeant, slave masters whether they're cuffs or ?\nSame shit, different jargon\nSame clip, different cartidge\nSame whip, different master\nLook closer we ain't got past it, the shackles are not tackled they're just different\nThe cattle rattle and rattle but they collect the dividends\nWe're fuel for someone else's engine we don't run a damn thing we're just pretending\nSo all the big talk, don't affect me, my elders licked banks so you can't impress me\nWith all the talk about another mans gun, which we use to kill each other for fun\nWhen the master sends their overseers to see us we toss the weapon and run\nBoydem run in your yard, diss your mother, dashing her knickers all out of the cupboard\nThey got us face down, with our feet on our necks but we still believe we are vets\nBut who makes the straps and the scales, who packs the jails so please ask yourself, who's the gangster?\nWho owns the planes and the boats that import the coke so please ask yourself, who's the gangster?\nWho makes the straps and the scales, who packs the jails so please ask yourself who's the gangster?\nWho owns the planes and the boats so please ask yourself...\nWe blow each others brains, so entertaining\nThey drop bombs of depleted uranium\nYou broke the law, you go to prison\nThey kill a couple million stack a billion\nBusiness as usual, death on the colonies\nWhat is that but state to state armed robbery?\nIt's just a road move on a bigger level\nWe think we are mountains but we're just pebbles\nBetter yet ? pop a little champagne but people in the south of France are not our fans mate\nWe love to live nice and happy too\nBut ask yourself this does anyone you know control the flow of capital\nThe answer is no\nAnd if you knew the business deals man are negotiating\nYou would know you could never ever claim that I'm hating\nVegan cuz, but I get the bacon, and eggs just fine in case you're mistaken\nBut if I don't like that, I don't like that\nGrew up on big yout and Gregory Isaacs\nNo suprise that, revolution on my track\nHas been right there from right back\nSacred geometry, don't follow me\nStill just an angry yout that spits horribly\nI'm trying to live peaceful, I remember what happened the last time I lost my temper\nAnd believe I'm not trying to be hard\nThe abuse that I suffered, I'm emotionally scarred\nI'm supposed to be ? holding the bars\nInstead I'm a professor that never went to class\nI write literature, they write bars\nThe Celtic warrior, Maroon from yard\nSo when you compare me to these little tarts\nAll you are showing is you're not very smart\nReal mc, it's my culture\nGrew up on the sound systems with the toasters\nYou man are foot down, it's third gear to me\nTenth planet, ain't not another on near to me\nWhen I orbit, cliques forfeit\nCorset flow my yout don't force it\nOr try rush man off as just concious\nCome out my face with that nonsense\nThug revolution, that's what it is\nNever do we run from one of these kids\nIf we ain't shook of the owners of the plantation, why would we run from a slave?\nWe've all got goons that love us enough to wanna die for us so just behave\nCause man are old school, straighteners\nOne, two, one, two face of the haters\nChasing the papers? Na\nMan are chasing freedom but papers I'm making\nThey're blatantly shaking and quaking in their boots\nAnytime we talk about breaking enslavement\nSo I do feel like Neyo in the Matrix\nCause I don't understand, why everybody's so scared of the agents\nWhen they are powerless blatant\nGot a little bit, but I put it on the line\nListen to the shit that I spit in my rhymes\nAli at his prime, principle first\nEven if that means I don't get heard\nCause the heards are absurd\nThey're hating the nerd, but the nerds controlling the face of the Earth\nSo I tell man so straight on my nerves, I'll duppy a track at my worst\nCold as a blizzard in a furnace\nThe wizard of a wordsmith\n? that I chisselled in stone, perfect\nAsk for yourself on the road, they'll tell you Akala is cold\nHe kicks knowledge for the block\nNever gonna stop\nThe progression of my albums never gonna flop\nWhen that shits on, it starts to ?\nThis whole things chess, and everyone has to celebrate the fact that we are just pawns\nBut man are not on it, the last thing they want is man with road energy\nTo stop killing one another and think cleverly\nAnd ask why you're living, where you're living, how you're living\nDid you create the condition, that you were raising your kid in?\nIf you didn't who did it?\nIs it really for the hood if our oppressors like our lyrics\nOnly by crushing your aspirations can we maintain this ? situation\nOnly by crushing the dreams of your kids quick, can we keep our unearned privilege", "year": null, "album": null, "image": "https://images.genius.com/3222ca5815132f2ac56b73bacb186bf1.1000x672x1.jpg"}], "artist": "Akala"}