{"artist": "B-Real", "songs": [{"album": "Smoke N Mirrors", "title": "6 Minutes", "lyrics": "[B-Real]\nSo whaddya do when the game starts changin fast?\nArrange for your ass to find a way to stay in the class\nSales declinin, downloads are risin\nNewbies shinin, and we stuck askin where did ya find him\nHe ain't a diamond but he really got some incredible timin\nSo sign him and put him out, he's a star that's shinin\nGive him a ringtone deal, a commercial with T-Mobile\nMan he can global, depends if he acts noble\nTake his photo and put him on the cover of Vibe\nRolling Stone and The Source mag both gave him a five\nNow he thinks that his shit don't stink\nAnd every drink's from a bottle of Crist', and he's flyin on mink\nHe's, young and dumb and don't sync with the drum\nBut all the little girls love him cause he's number one\nOn top of the Billboards winnin Grammy Awards\nGoin to red carpet events with the media whores\n\n[Hook: Tek]\nLights camera flash you're on!\nUh-uh uh, uh, uh-uh on!\nTime's up, six minutes you're gone!\nG-g, gone! G-g-gone!\nTell me where'd they go, tell me where'd they go\nTell me - where did they go, where did they go\nTell me - where did they go, where did they go\nTell me - where did they go, where did they go\n\n[B-Real]\nThere's a new kid in town climbin the charts but still\nHe's alright, but he's not real\nRegardless they want a cameo for Freddie Puccini\nHe's a freezer, he's leanin back like the Tower of Pisa\nHe's on top of the mountain, ain't got no one around him\nTo tell him the truth, let him know, people are clownin\nThey found him and wound him up like a toy for the children\nHe don't believe it, he's only worried about his millions\nCollectin his cake, coppin whips, buyin estates\nLyin in wait, the birds flock to get that taste\nBeautiful bait for the new kid but don't be stupid\nCause they don't love you they love your money as soon as you lose it\nThey skate with the very next dude releasin an album\nBy any means necessary thought I'd quote it from Malcolm\nThe outcome is all the same and that part don't change\nChalk it up to the game cause it's a part of the fame\n\n[Hook]\n\n[Young De]\nThese rappers just, don't, get it\nBetter wake the fuck up, but you think you got it figured out\nDiggin a hole so deep you can't get up out\nYou don't give a shit about, if they say you losin touch\nJust another one hit wonder motherfucker screwin up\nBut not me, not Young De\nI let the, veterans guide me so nothin surprise me\nAll them moves you be makin 'em blindly\nBut the big homies B-Real and Young Gotti got me\nSo you can get the cover of the XXL now\nBut when your boy hit, all that shit gettin shut down\nNursery rhyme lines goin back to the kids\nAnd that bitch that you wit comin back to my crib\nThese execs got you gassed, put 10 on 2\nAsk me who gon' last, won't bet on you\nBut you could, bet on me cause your boy come through\n\n[Hook]", "image": "https://images.genius.com/a84f5f2a93fac34de0ebb0407f26b392.600x600x1.jpg", "year": null}]}