{"artist": "Wax", "songs": [{"year": null, "lyrics": "Intro:\n\nI had to write something for the females, man\nCause you know how they be affecting you\nYou walk up to them\nAnd you're so flabbergasted by their appearance\nThat when you finally get the courage to talk to them\nYou say some childish shit\nSome shit like this, check it\n\nHook:\n\nDo you think it'd be okay\nFor me to be your man? (Baby, baby)\nAnd do you think it would be okay\nFor me to hold your hand? (Shoobadoopbadooo!)\n\nVerse 1:\n\nCheck it out girl-\nAyo, what did your parents feed you as a kid\nTo have you turn out as beautiful as you did?\nFresh strawberries all in your crib\nMorning Similac\nTell your parents take notes so we can remember that\nYou got a smile so bright that it smolders\nAnd transmits beauty through eyes of all beholders\nYou all natural, actual, no fake shit-\nType of girl you take to the carnival and eat funnel cakes with\nI wanna take you on paddleboat\nYou got me reminiscing\nBack to when I passing notes\nYou've turned a grown man into a sixth grader\nThis is what you'd read on the little piece of ripped paper:\n\nHook:\n\nDo you think it'd be okay\nFor me to be your man? (Baby, baby)\nAnd do you think it would be okay\nFor me to hold your hand?\n\nVerse 2:\n\nYo, yo-\nI bet your sweat tastes like it's got sugar in it\nI bet your nose ain't never had a booger in it\nI bet you've never had a pimpled on your face\nAnd your shit probably smells like that Cinnabon place (chica)\nYou got me weaker than S.W.V's knees\nYou're the bees knees;\nHoney please grab your keys\nIt's too loud, let's break out of the bar\nAnd hit the parking lot and make out in my car\nI'm trying to get a free sample of them cute pink lips\nPonder that over your last few drink sips!\nI don't mean to be up front\nI'm just making suggestions\nThis ain't rocket science girl\nThese are very simple questions\n\nHook:\n\nDo you think it'd be okay\nFor me to be your man? (Baby, baby)\nAnd do you think it would be okay\nFor me to hold your hand?\n\nVerse 3:\n\nYou ain't the type of chick I just wanna get it on with\nYou're the type of chick I wanna cook a breakfast omelette\nAnd make it real cheesy\nKinda like this song hit\nCause usually I'm spitting this raw shit\nBut for you I've lost it\nYou make my knees buckle\nAnd I can see the freak in you beneath of that sweet chuckle\nCause when the time comes you'll be acting like a slut-\nTelling me to pull your hair\nAnd smack you on the butt\nAnd I'mma do it real fast\nNo questions asked\nWhatever the task, that feminine adrenaline blast\nIs going to come\nI got the future on the brain\nI wanna marry you-\nBy the way, what's your name?\n\nHook:\n\nDo you think it'd be okay\nFor me to be your man? (I'm trying to ask politely, Baby, baby, cause I've been staring at that ass )\nAnd do you think it would be okay\nFor me to hold your hand?\n\nBridge:\n\nI know you've seen this on the video\nProbably never on the radio\nGirl I want to feel your titties though\nI'm thinking you could have my baby, though\n\nI know you've seen this on the video\nThey need to play this on the radio\nGirl I need to feel your titties though\nI'm thinking you could have my baby, yo\n\n*acoustic guitar solo to end*", "image": "https://s3.amazonaws.com/rapgenius/Big_Wax_in_Front_of_a_Fence.jpg", "album": null, "title": "Do You Think It Would Be Okay"}]}