{"songs": [{"year": null, "album": "Yes!", "image": "https://images.genius.com/be32b21b842fd6685747a4e750c7dc8c.1000x1000x1.jpg", "title": "Mr. Telephone Man", "lyrics": "I keep it rocking now knocking on heaven's door\nLooking for answers from a Femme fatale hardcore\nWhat am I looking for?\nI just don't know\nI orchestrate flows but not for dough\nAnd really though\nI got a triple seven area code\nFrom the side of the road\nAbout way past suppertime\nBust a rhyme on her\nTo alleviate the drama\nBut the more that I explore her\nIt's double I feel ignore her\nAnt on the hill, a worker bee to the queen\nOf vocabulary arts burning hearts of human beings\nTrue human becoming I'm running\nBut cunning the number one stunner\nPersona is chaseable\nMaking one replaceable\nAnd damn every time I think I want to face her\nWith some tickets to the ball standing in the elevator\nOn my way to her palace I get up to the seventh floor\nThen jet to the fire exit door with faith no more\n\n[Chorus] Mr. Telephone Man won't you help me with my line\nWhen I call the triple seven I get machine every time\nAnd I wonder if it's possible you're playing with my mind\nAnd I really want to know you won't you please give me a sign\nAnd whoa it's a long way down\nSaid whoa it's a long way down from the fall from grace\n\nWe went from pagers, beepers, phones, to creepers\nRingtones, text messages, not reaching\nSpeaking close all up in my receiver\nAfraid to meet in person the dial tone deceiver\nPick up, hang up, break up, banger\nMan I wanna press every button Atlanta\nArea code South Beach number I forgot it\nWe cross bionic style exotic forget about it\nNow here's what I'm thinking\nIs this ship sinking?\nWhile we're dancing and drinking\nCould we be at the brink and?\nMr. Telephone Man I call you every night\nYou never answer my call I'm starting to get uptight\nI guess I'll keep rhyming designing and flipping the script\nAnd dancing on my own time\nIn my own mind but wait\nIt seems this Mr. Telephone Man\nIs a woman with a man in the palm of her hand damn\n\n[Chorus]\nMr. Telephone Man won't you help me with my line\nWhen I call the triple seven I get machine every time\nAnd I wonder if it's possible you're playing with my mind\nAnd I really want to know you won't you please give me a sign\nAnd whoa it's a long way down\nSaid whoa it's a long way down from the fall from grace\nI said I really want to have a talk\nGet your hands off my mic don't grab it off\nI said I really want to have a talk\nGet your hands off my mic don't grab it off\nI said I really want to have a talk\nGet your hands off my mic don't grab it off\nI said I really want to have a talk\nGet your hands off my mic don't grab it off"}], "artist": "​k-os"}