{"songs": [{"year": "2014-11-21", "lyrics": "[Hook]\nTell me what you wanna do\nCause we can do that soon as your ass come on through\nWe can do that all day too\nAlright tell me what you wanna do\nCause we can do that\n\n[Verse 1]\nCadillac with the sun roof hanging out the motherfucker like \"who is him?\"\nAh baby that's DRAM\nMatter of fact he's stepping your bitch with chest hair spitting game smooth as silk\nWhat type of shit he on?\nI'm on molly, I'm on motherfucking tree\nI don't know how to motherfucking believe in love\nI got me all in a zone\nI'm in a body\nNot fucking with the Bugatti\nI brought my liquor on my own\nIt's in the car baby\n\n[Interlude]\nGirl 1 - What's the matter is he drunk?\nGirl 2 - Yeah he drunk\n\n[Hook]\nTell me what you wanna do\nCause we can do that soon as your ass come on through\nWe can do that all day too\nAlright tell me what you wanna do\nCause we can do that\n\n[Verse 2]\nLong print silk with the chest hairs out\nCircle I rest with these golds in my mouth\nI fuck with (?) for keeping hoes in they house\nIt's a fucking bachelor pad, it's what it's supposed to be bout\nI be chilling at my cuz spot high as a fool\nIn this little back room and the light bulb dull\nAnd I ain't Young Thug but I'ma ask for the hookah\nI'ma be geriatric, still coughing off buddha\nWith a kango hat and the (?) real cute\nWith the old school jewelry and the tear drop booty\nBaby when I do ya, I'ma do ya\nWhen we screwing you gon' think there was a dick in your medulla\nThat's a mind fuck\nI wish that I could stay baby but time is up\nYa gotta go, ya gotta go, soon as I nut\nSike, nah you gon' get the round two of this\nFinger tips, take a lick your booty, pussy lips\nYou put it on a crucifix, got resurrected with your baby\nIf I want it on your face, I wonder if you'd let me\nI wonder if I (?) she didn't tell me\nWell either way they call me D.R.A.M. but you can call me Shelly\nEither way they call me D.R.A.M. but you can call me Shelly\nFriends ain't ya, friends\n\n[Hook]\nTell me what you wanna do\nCause we can do that soon as your ass come on through\nWe can do that all day too\nAlright tell me what you wanna do\nCause we can do that\n\n[Outro]\nFor the summer, for the summer, oh\nOh-ohhh, haha, I said oh-ohhhhh\nYeah, yeah, yeah, yeah, yeah, yeah\nHah, oh-ohh-ohhhh-ohhhh", "title": "Get Money", "album": "#1EpicSummer", "image": "https://images.genius.com/e6707cbe88b21207d4fedad203379cc7.500x500x1.jpg"}], "artist": "DRAM"}