{"artist": "Pimp C", "songs": [{"album": "The Sweet James Jones Stories", "title": "Get My Money", "image": "https://images.genius.com/d5984a79c276e0748a892e587a93e941.772x768x1.jpg", "lyrics": "[Intro]\n(Piiimp!)\nYeah I'mma step up to this mic like Marvin Gaye, y'knahmsayin?\nBack up off me like them O'Jays, y'knahmsayin?\nSpin on it like the Bar Kays, y'knahmsayin?\nBitch ain't nuttin funny, bitch I ain't Bugs Bunny\nGet my money bitch, I mean ho yeah you up under pimp arrest bitch\nY'knahmean? Yeah ho you upstate, you out of pocket bitch\nBut y'knahmean? Bitch you gotta get my money bitch\nYou understand it's Pimpin' Ken for the money bitch\nWe can put it on the dotted line, Houstin time bitch y'knahmean?\nYeah bitch you understand\nLet it be Pimpin' Ken for the record and the money y'knahmean?\nYeah bitch I'm out here with Pimp C bitch\nGet this motherfuckin money ho\nMakin hoes plant their feet on the conrete, ya dig what I'm sayin?\nYeah red hoes who sold out on ho strolls\nDoin it every day the American way y'knahmean?\nReal motherfuckin pimpin y'knahmean?\nSmoked out with this shit y'knahmean?\nYeah bitch it ain't gon' never quit ho\n(Piiimp!) Yeah bitch throw it up in the air ho!\n\n[Pimp C]\nSweet Jones, what'chu know about it bitch\nGet out there and go get my shit\nI ain't got time to save you ho\nI ain't got time to play with you ho\nYou talkin 'bout you wanna be down with me\nYou need to get some money wanna be with Pimp C\nUhh, cause I'm real to the core\nAnd give a damn 'bout a bitch and I pimp on a whore\nYou can tell yo' momma, about the drama\nYou was fuckin for free, befo' you met me\nGet your mind on your money, get some big faces\nBefore you come around here catchin cases\nPimpin, panderin, bitch I'm handlin\nPaper and cheese, comin down with ease\nIn a 2001 Benz with the screens\nSippin a big cup of lean, uhh\n\nYou gotta get my money bitch\nUhh - get it! Uhh\nBitch get it now!\nMake the trick say it feels good, uhh!\nYou gotta get my money bitch\nUhh - gotta get it, get it, bitch!\nBitch get it now!\nMake the trick say it feels good, uhh!\n\nGet my money ho, I ain't playin\nBitch you heard what the fuck I'm sayin\nI'll bust you in your eye ho\nIf you don't get out for the dough\nYou talkin that shit, you a lazy punk\nYou need to get out there and pop the trunk\nAnd make the motherfucker see all the cock\nAnd get that money, shake what you got\nSell that pussy ho, suck that dick\nBreak that trick ho, hit that lick\nGet yo' mind up on my grill\nPunk-ass bitches, always trill\nYou a yellow ho, and you a dyke\nThe type of bitch, that I don't like\nYou think you come and gon' wreck my stable\nI keep a fuckin bitch on a line or cable\n\nYou better get my money bitch\nMake the trick say it feels good bitch!\nBitch get it now!\nMake the trick say it feels good, uhh!\nYou gotta get my money bitch\nGet it, get it, uhh\nBitch get it now!\nMake the trick say it feels good, uhh!", "year": "2005-03-02"}]}