{"songs": [{"year": "2019-06-14", "image": "https://images.genius.com/632cbe474a2ab6a525c2a0da36a43d67.1000x1000x1.jpg", "title": "Head In My Lap", "album": "I Am Me", "lyrics": "[Intro]\nTay Keith, fuck these niggas up\nBitch, bitch, bitch\nYeah, yeah, yeah\nYou got some nice lips on you, bitch\nHah\n\n[Chorus]\nPut your head in my lap, uh, uh (In my lap, ho)\nI just want some head in the trap, uh (In the trap, ho)\nIf I ever hear you run your mouth (Run your mouth)\nI'ma cut you off right now (ASAP, ASAP)\nPut your head in my lap (Yeah, yeah)\nI just want some head in the trap (In the trap)\nBitch, you better not ever run your mouth (Run your mouth)\nOr I'ma cut you off right now, ayy (That's on my mama)\n\n[Verse 1]\nAyy, let me tell you 'bout these buster ass, fake ass hoes (Hoes)\nBitch, don't ever say you love me if you fuckin' my bro (My bro)\nI hit that bitch up in my bed, ayy, that's a TV flow (Woah)\nI smacked her ass with all my might, ain't that's a DB though? (Woah)\nFrom watchin' DVD's (Yeah, yeah, yeah)\nBitch, you know I got more hoes than a pack of CD's (Huh?)\nBitch, I'm a dog, you see this collar? I ain't attracted to fleas\nI told that bitch that I couldn't call 'cause I just wax it and leave (Woah)\nThat bad lil' ho say she a bird, I'll teach her the birds and the bees (I teach her)\nSwitch the narcos outside (Outside)\nHit him in the pupil out the window, I'm a deadeye (Deadeye)\nThen go to his son's school and tell him keep his head high (Head high)\nAnd fuck his mama, now he callin' me his dad now (Stepdad)\nOoh, I'm stepdaddy too, I turned mom to a prostitute (Woah)\nNigga robbed him, play me 'bout that bread, now I gotta shoot (Rrah)\nDon't think daddy, but a bitch throw a mask on\nTime to do a kick door (Rrah)\nWe shoot the gun like dice (Rrah)\nBitch, tell me what do it hit for? (Rrah, rrah, doon, doon, doon)\nLil' Keshia, she an eater, she freaky, I know her mama (Her mama)\nShe said she hungry, took that bitch to the nearest McDonald's (McDonald's)\nShe got an attitude, what you want, some Benihanas? (What?)\nI can't go up there no more 'cause I gave all them hoes my number (Freaky)\nFreaky bitch Lashawna give me head up in the Hummer (Hummer)\nShe already know what's goin' on, she put her hair up in a bunna (A bunna)\nHad to cut that lil' ho off, she thought that she was gon' get some bundles\nGet her head all covered in pipe, but I kicked her out on summer\nI'm a felon but I still can go to Mexico (Yeah)\nI'm in Dubai, smokin' dope up in the sky (Yeah)\nTwo hundred dollars for a gram, that shit was Reginald (Woah)\nBut I'm still fly, so that still mean that I'm high (I'm so high)\nIf a nigga put his hands on Simi, he gon' die (He gon' die)\nHe six feet under but he somewhere in the sky (In the clouds)\nPut a nigga in a blunt, roll him up, ayy, Lil Jugg, let's get high (Ayy, let's get high, Crip)\nI would be 12 if I told you where we was smokin', right? (Right right?)\nWhere I'm from, we kill a nigga, then turn up and let the night go (Take a night go)\nCan't trust these niggas, they act like bitches on they cycle (Period)\nI'ma swerve this car, get it on two wheels like a motorcycle (Woah)\nAnd it's off with the head, this shit off of the head\nNigga, this is not typewrote, bitch (Yeah)\n\n[Chorus]\nPut your head in my lap (Yeah)\nI just want some head in the trap (In the trap)\nBitch, you better not ever run your mouth (Run your mouth)\nOr I'ma cut you off right now (That's on my mama)"}], "artist": "BlocBoy JB"}