{"songs": [{"album": null, "image": "https://images.genius.com/d7944659703675e0082123aa7dae9a93.750x750x1.jpg", "year": "2019-02-14", "title": "Fuck Nigga", "lyrics": "[Intro]\nYeah\nTo all the fuck niggas of the world (fuck nigga!)\nAll the niggas that get up, say \"Fuck you\" to everybody else\nTalking to you\n\n[Chorus]\nDamn, it must suck to be a fuck nigga\nOl' greedy ass nigga only thinking 'bout himself\nThey get the fame, then get the wealth\nBut people are struggling, who did you help?\nPeople are struggling, who did you help?\nWho did you help, fuck nigga?\nDamn, it must suck to be a fuck nigga\nOl' greedy ass nigga only thinking 'bout himself\nThey get the fame, then get the wealth\nBut people are struggling, who did you help?\nPeople are struggling, who did you help?\nWho did you help, fuck nigga?\n\n[Verse]\nI ain't made as much as you have\nPurses you grab could feed some countries out in Africa\nYou just go buy a Lamb or Bugatti\nOr something else that depreciate when you drive it off the lot\nAnd holla \"Fuck it,\" but fuck it, I'll change the subject\nThe greatest reward comes with some obligations\nYou owe the generation after you\nSince they gon' live in the world that you made\nMan, where your gratitude?\nYou act like wasn't no more poor people struggling after you\nGuess you were the last, nigga, you trash\nYou wouldn't never got big as you is\nIf the folk in the hood wasn't supporting your ass\nSee them same people that's taking a stand\nGive you the chance, you showing your ass\nI don't give a fuck how much money you have\nWhat did you do with it?\nHow did you use it to make an impact and influence the world for the better?\nYou rather go buy some jewelry, whatever\nBut never should you ever think that it's going to last forever\nAs soon as you blink, it'll be gone as quick as it came\nAnd you talking about when you were doing your thing\nMan, all of them profits, man, how many scholarships?\nHow many properties did you donate to the people in poverty?\nMan, I bet if any, it's not enough probably\nMade it equivalent to hitting the lottery\nSelfish just make you a target for robbery\nCould it be possibly you don't know people are starving and dying\nIs this shit not on your mind?\nWhat is you thinking 'bout, just 'cause you make it out\nDon't mean you shit on people tryna be equal\nEvery day fighting oppression and you just gon' side with the evil\nMan, what do you care about?\nDid you not hear about black women missing?\nWe don't know their whereabouts\nSee that's what you should be calling the mayor about\nOffer whatever is a fair amount\nThere's a water crisis down in Flint, and ain't you from Michigan?\nWhere is your empathy, nigga?\nI promise you I see the bitch in these niggas\n(Dah dah dah dah dah)\nDo more with less 'cause I ain't richer than these niggas\nI think I just had an epiphany, listen to ego\nWhere the creeps go when they're sacrificing they own people\nI swear, all the money in the world ain't enough, nigga\nIf it mean I gotta live like a fuck nigga\n\n[Chorus]\nDamn, it must suck to be a fuck nigga\nOl' greedy ass nigga only thinking 'bout himself\nThey get the fame, then get the wealth\nBut people are struggling, who did you help?\nPeople are struggling, who did you help?\nWho did you help, fuck nigga?\nDamn, it must suck to be a fuck nigga\nOl' greedy ass nigga only thinking 'bout himself\nThey get the fame, then get the wealth\nBut people are struggling, who did you help?\nPeople are struggling, who did you help?\nWho did you help, fuck nigga?"}], "artist": "T.I."}