{"artist": "Casey Veggies", "songs": [{"title": "Finally Something Different", "album": "Customized  Greatly Vol. 2", "year": null, "image": "https://images.genius.com/1a029e524a5e116fb4512ade4b883627.756x720x1.jpg", "lyrics": "[Verse 1]\nI was the most innovative, the most creative\nI used to make space ships then I would fly away\nMy swag at 100, mind thinking brighter days\nI want that big money right away\nNow I just sit up in my room and write away like let's do it\nI'm ready for whatever, I'm ready for the cheddar\nMy biggest vendetta was being the best dresser\nSo Lauren, this that shit you could get dressed to\nI this that rhythm I can think about my ex to\nAnd look to the left [?] what I'm next to\nSo who next fool? I'm the best contender\nI'm rolling up my summer thinking winter\n\n[Hook]\nWhat you saying though? How you living kid?\nWhat you mean by that? Oh this another hit?\nMan this is that shit, something different\nAnd this is me and I ain't worried bout fitting me\nWhat you saying though? How you living kid?\nWhat you mean by that? Oh this another hit?\nMan this is that shit, something different\nAnd this is me and I ain't worried bout fitting me\n\n[Verse 2]\nI always think the good life when I write\nAlways leave the laces loose on my Nikes, yeah\nAnd I can give a damn in my Vans\nLiving life in a trance, always feel like the man\nI'm pulling my pants and lean back like that\nI don't be in moods, that's why I act like that\nThat's why I rap like that\nThey gon' have a hard time telling me what I lack\nTelling me that I ain't that\nI tell 'em now they gon' see\nYeah I'm the 09 freshman\nThe young CV, I thank PNC\nThe Creator on the drums, we so OD\nY'all ain't nothing like me, y'all some lil hypebeasts\nWhite T, neck V [?]\nWith the homies posted up until they get me\nI'm iffy on you niggas, y'all ain't with me\nSo I stay solo and let the dough blow\nLet's go\n\n[Hook]\nWhat you saying though? How you living kid?\nWhat you mean by that? Oh this another hit?\nMan this is that shit, something different\nAnd this is me and I ain't worried bout fitting me\nWhat you saying though? How you living kid?\nWhat you mean by that? Oh this another hit?\nMan this is that shit, something different\nAnd this is me and I ain't worried bout fitting me\n\n[Verse 3]\nThe west coast, I'm bragging while I boast nigga\nLet's propose a toast homie, I'm focused\nSo easy and you already know this\nI'm not worried bout you niggas, y'all ain't on my radar\nI mean what I say dog, girls get piped down\n[?] they are [?] he ball\nYou short niggas, he tall, he raw\nNumber uno, you zero\nYou wack rappers catch a lock jaw\nLocked down, I got y'all, not far\nI'm too stand up, you in the crowd put your hands up\nAnd what\nIn 09 man, I'm balling like a free throw\nStunting on you niggas like I'm Evil Knievel\nIt's [?]\n[?]\nI don't know what you see though\n\n[Outro]\nWhat's good, this [?]\nJust to let niggas know this shit bout to take off soon\nCasey Veggies, Customized Greatly Volume 2\nIt's totally something different\nWatch when my nigga blow\nAll y'all niggas bout to be [?]\nSwag up and I'm out"}]}