{"artist": "​iLoveMakonnen", "songs": [{"title": "Forever", "lyrics": "[Hook: ILoveMakonnen]\nYou needed a love that lasted forever\nFor how long? Forever\nI remember when you said\nYou needed a love that lasted forever\nFor how long? Forever\nYeah yeah you did\nYeah yeah I needed it\nYeah yeah you did\nYeah yeah I needed it\n\n[Verse 1: ILoveMakonnen]\nI won't be sneaky if you treat me like the last time\nYour heart is cracked because you said I was the last guy\nThat you would ever let get inside\nI'm tryna find out how you feel inside\nYour heart was bleeding when you needed\nNow you left me and I'm feeling so defeated\nBecause I thought that we would always be\nBut something's changed now between you and me\nAnd I don't understand, not again, I can't be your man\n\n[Hook: ILoveMakonnen]\nYou needed a love that lasted forever\nFor how long? Forever\nI remember when you said\nYou needed a love that lasted forever\nFor how long? Forever\nYeah yeah you did\nYeah yeah I needed it\nYeah yeah you did\nYeah yeah I needed it\n\n[Verse 2: 1st]\nShe said it's over, over, over and over again\nI just play dumb, retarded, act like it's pretend\nThen she got the nerve to give me shit from a friend\nNow I'm stuck here with a fucked up bitch\nI remember when you told me that you loved me\nAin't never gonna let me go, yeah\nAnd you meant that from the bottom of your heart\nDeep down in your soul, yeah\nYeah you made me feel good good from my highs down to my lows\nI ain't saying you was a hoe but girl you need to learn your role\nFirst we started fuckin', it was cool\nThen everything we liked to do just wasn't new\nWhat's the point of playing games that we gonna lose?\nSorry baby, this is what I do\n\n[Hook: ILoveMakonnen]\nYou needed a love that lasted forever\nFor how long? Forever\nI remember when you said\nYou needed a love that lasted forever\nFor how long? Forever\nYeah yeah you did\nYeah yeah I needed it\nYeah yeah you did\nYeah yeah I needed it\n\n[Verse 3: Santigold]\nMama used to say, read what's written on the wall\nBeen around, beneath it all, we still neanderthal\nDidn't I give it all I got? Did I get my own way?\nI don't know, no use in wondering, got other giants to slay\nMy hands up, see you late, see me out the door\nKeep counting all your money, can't count me out for sure\nNo excuses, not the evil one, nothin' more to say\nWon't lie down, not for your love, never out your way\nWhen you hitting that, hitting that\nThink you can give it all you got like that\nI just keep on getting that, getting that\nYou'll never get ahead with a hoe like that\nGot a thousand rocks all in your bed, no bitch hard like me\nIdolize you, I was your big gun you see\nSaid we were forever, not 'til you reach the top\nUse me to hold you up, just use me to hold you up\n\n[Outro: ILoveMakonnen]\nYou needed\nA love that lasted forever\nFor how long? Forever", "image": "https://images.rapgenius.com/d5f35da6f7d9d045d2bf8bf10601940c.600x600x1.jpg", "album": "I LOVE MAKONNEN 2 ", "year": "2015-11-19"}]}