{"artist": "Half A Mill", "songs": [{"album": "Milíon", "lyrics": "(Biggie Sample)\nWhere BK at? Where BK at?\n(Repeat 4x)\n\nVerse 1:\nWe gon' blow off the roof ya'll\nI cop somethin' from the juice bar\nHoldin', rollin' in a new car\nBK be my borough, mad thorough\nMake sure that cash double\nGats blast through your ass muscle\nI got the pieces to the puzzle\nMy Dogs don't wear leashes or muzzles\nEveryday's a hustle\nWe used to roam the streets, hoppin' trains, back of the bus too\nPlay stick ball\nNow we stick ya'll\nOut to get it all, been through it and did it all\nWit' it all, plan to cop a new World and split it all\nBeen rich, been poor\nSpendin' ends in the Benz store\nShittin' like Diarrhea\nWith enough cash to buy Aaliyah\nBuy her some weed, drive high speed, take her to the projects and beat\nHer\nMy name Mill, pack Millimeters\nSilver heater, tracks kill the speaker\nIll speaker, ill wisdom leaker\nBuild from the street up\nReal from my feet up\nMill 'bout to heat up a meal you can eat up\nI'm from the streets where them crooks is at\nWhat you lookin' at?\nWhere Brooklyn at?\n\nChorus -\nWhere ya at? where ya at?\n(Where Brooklyn at? where Brooklyn at? Where Brooklyn at?)\n(Repeat 4x)\n\nVerse 2:\nBrooklyn, Brooklyn, funky funky fresh\nI be the greatest entertainer since Dough E. Fresh\nBring the pain like my Man Kane\nGucci frames like Dana Dane\nIt ain't a game, but things change\nStill spit flames, lyrical flame\nLyrical rain, my slang bang and injure your brain\nWith minimal game rap indivuals get slain\nGo get your crew\nWhoever you bring is gonna lose\nOfficialist dude\nWho wants a lyricists fued?\nI'll make lyrical food out of you gimmickal fools\nGive him some weed, give him some dust, give him some booze\nHe ain't ballin', he fallin', better give him some room\nHe him up, split him up, let his bodyguards get him up\nWe party hard in Brooklyn and we don't give a fuck\nOf course money, I floss money like Sauce Money\nPop Cris' and poor bubbly 'till we all ugly\nI'm a Mack, chicks all love me\nWhether on the train or in a Porsche buggy\nI get brain lovely\n4.6 Range, keep the change money\nJigga, Bleek, and Dame is doin' they thing Money\nM.O.P.'s a friend of me, Buckshot's the energy\nCocoa Brovaz a kin to me, O.G.C.'s the entity\nI'm a real MC, somethin' most pretend to be\nBut you get fried in the end when you pretend to be....from them streets\nWhere the crooks is at\nWhat you lookin' at?\nWhere Brooklyn at?\n\nChorus -\n\nVerse 3:\nRap cats wanna screw me\nWho me? my crew be unruly like B.I.G. thats why I brung Uzi's\nWho wanna move me?\nI'll send shots through your Coogi\nHop in a Benz drop Coupe smoothly\nDippin' through blocks when I lick shots\nRippin' through drops\nSinister plots\nSinnin' to deminish your spot\nCriminal niggas with knots\nGlistenin' watch, Linen's is hot\nKeep lyricists fearin' to rock\nMission is stopped\nWe gon' do it like this to the top\nTwistin' the pot\nDon't get it twisted or I'm twistin' your knot\nPickin' the lock\nWhat I spit leaves your sick in your socks\nKickin' the box, mad rappers lookin' at Ox\nI smash rappers\nStocked in this market, I crash rappers\nSlash rappers, they nothin' but garbage so I trash rappers\nFront on me and be ass backwards\nI got it mastered, pack gats to blast Bastards\nI'm from the streets where them Crooks is at\nWhat you lookin' at?\nWhere Brooklyn at?\n\nChorus", "title": "Where BK At?", "year": null, "image": "https://images.genius.com/23e45bc88de0a6f6a0ac73d6b9f6b05f.500x500x1.jpg"}]}