{"songs": [{"image": "https://images.genius.com/b7bcbd18f4df90fee8a1067f0b2b3a7b.1000x1000x1.jpg", "title": "Wish You Wouldn’t", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Verse 1]\nWe gotta talk about things\nWe gotta do something different\n'Cause this isn't working, this isn't working\nI don't, I don't know if I can do this\nRiding 'round the city, baby\nI know you wish you could change me\nWhy you mad? Girl, why you angry?\nYeah, why you angry?\nBack and forth, you love you hate me\nArguing about the same things\nI don't, I don't know if I can do this\nI don't, I don't know anymore, baby I don't know anymore\n\n[Chorus]\nI wish you didn't say things, I wish you didn't say things\nThat you don't mean, that you don't mean\nI wish you didn't say things, I wish you didn't say things\nThat you don't mean, that you don't mean\n\n[Verse 2]\nYeah, I mean she wants somebody that's working a 9-to-5\nI apologize, but those ain't my hours, yeah you never been with a man\nWho's working this kinda job, who works with this kind of drive, I wouldn't be with me either\nHold up, yeah I think that's work on the other line, I gotta go, we can argue some another time\nHang up the phone, I regret it right after\nThis is the chance that I just  couldn't pass up\nSee I signed a deal, you said I should've asked ya\nI guess I was scared to see how you reacted\nOr maybe I knew I'd be selfish\nThese are the things I ain't proud of\nI's always the type to get jealous, there's always two sides of the story\nAnd you're not the one that I blame when I tell it, that's real, yeah\nYou ain't the one, you ain't the one\nI mean I should've manned up and that's hard to say as a man\nThe older I get the more I understand a relationship's more than just holding her hand\nI'm sorry, you can blame me, yeah, you can blame me\n\n[Chorus]\nI wish you didn't say things, I wish you didn't say things\nThat you don't mean, that you don't mean\nI wish you didn't say things, I wish you didn't say things\nThat you don't mean, that you don't mean\n\n[Verse 3]\nWhat's going on?\nI just wanna feel something, I just wanna feel something\nThere's too many things I'm tryna deal with\nAnd I understand that you don't feel this\nI said there's too many things I'm tryna deal with (No)\nAnd I understand I'm hurting your feelings\nI know you don't feel this, yeah (Baby)\nI'm just expressing the way that I'm feeling\nThe things that I'm trying to deal with\nI guess I've been trying to hold it all inside\nBut it's obvious that that ain't working\nYeah it's obvious that that ain't working\nThe only thing we got in common\nIs that we got nothing in common (Woo!), baby"}], "artist": "NF"}