{"artist": "Watsky", "songs": [{"year": "2016-11-08", "lyrics": "Tell me how it used to\nHow it used to\nHow it used to be\n\n[Adam Vida]\nOne time, a psychic had told me something 'bout my future life\nHow I would live to be a hundred with my future wife\nSurrounded by my great grandchildren\nReading the funnies and telling ‘em stories\n'Bout how things were different in my 20’s, like:\n\"Gather round, you two, shut off the TV\nI got a story, and maybe you youngins might not believe me\nBut 80 years ago, the world wasn’t so kind, then\nNow it sounds silly but I remember a time when\nThere was so many of us in love with one another\nAnd tried to show it but couldn’t 'cuz they wouldn’t let a pair of people\nShare a life together 'cuz they said it was evil and against the law\nBut them laws wasn’t fair or equal\nPeople debated and shouted and demonstrated and spouted hatred\nInstead of trying to have a conversation about it\nBut soon it led us to having celebrations about it\nLook at what my generation sprouted\" (Marriage is legal!)\nThen the psychic took her small fee\nI thought about the way things were before me\nAnd how every generation gets a little more free\nI felt hope thinking how things could all be\nIn eighty years I guess we gon' see when our grandkids saying to us\n\n[Chorus]\nTell me how it used to be\nCause we’ve come so far\nTell me how it used to be\nTell me how it used to\nHow it used to\nHow it used to be\n\n[Watsky]\n\"Grandpa, is it true what they say?\nThat way back in the day day\nYou know? Like way back, like mad long\nThat President Riff-Raff used to write rap songs?\nAnd I heard the people lit nicotine\nBut they weren’t allowed their sweet, sweet sticky green\nAnd they let a kid be shipped to Iraq\nBut they wouldn’t let him sip on a whiskey when he was back!\"\n\nYep, that’s back when life was a terminal illness\nBefore that doctors learned that we came\nWith a little switch every person turned in their brains\nWhen life was overwhelming and so we turned from the pain\nBack when slums grew in the shadows\nOf a 170 story chateaus\nAnd the people under ‘em fought\nFor the crumbs that fell from the windows up at the top\nWe claimed freedom but our elections were bought\nBy a high-spitting executive, not a second of thought\nBack when corporations were people but people weren’t even people\nAnd people just weren’t connecting the dots\n\n[Chorus]\nTell me how it used to be\nCause we’ve come so far\nTell me how it used to be\nTell me how it used to\nHow it used to\nHow it used to be\n\n[Watsky]\nPeople would hate you over what spirit you prayed to\nYou talk and they wouldn’t hear it\nThey fear it and decapitate you\nAnd back in the states all we’re doing is just always say that they're doing\nPlacing humans in boxes over what appearance they're near to\n\n[Adam Vida]\nI fill in boxes, they said inside of it was a future\nThey bomb a school full of students and do away the computers\nTechnology, we can use it on mother earth to improve her\nInstead we steady abuse her but was it worth the maneuver?\n\n[Watsky]\nWho are we kidding? You and me didn’t ruin the system\nBut soon the kids who crawled out of the sewers grew to be different\n\n[Adam Vida]\nBrutally killing for power’s not our true intuition\nSo we flip the script now we living with the newest traditions\n\n[Watsky]\nSmashing the walls and dancing and drinking\nWine in the kitchen\n\n[Adam Vida]\nKissing and hugging and laughing\nFuck it we shining and winning\n\n[Watsky]\nWomen and men looking back and telling\n\n[Adam Vida]\nReminding the children of how it\n\n\n[Watsky]\nHow it\n \n[Adam Vida]\nHow it\n\n\nHow it\n \nHow it\n\n\nHow it\n \nHow it\n\n\nHow it\n \nHow it", "image": "https://images.genius.com/1aacc5c51f6e3a30a154e12a7fc3100f.1000x1000x1.jpg", "album": "Oops! All Berries", "title": "How it Used to Be"}]}