{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/306390ca78fbc242ffe05c552a8403bc.1000x1000x1.jpg", "title": "Hotel", "year": "2015-01-09", "album": "Full Speed", "lyrics": "[Intro: Kid Ink, Chris Brown & Both]\nI said why you over there lookin' at me (whoop)\nWhile I'm with my girlfriend?\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, oh, woah, let's take it to the hotel, oh, woah\n\n[Verse 1: Kid Ink]\nYeah, I said why you over there lookin'? (Woah)\nGot a staring problem or you fuckin'? (Whoop)\nI know you see my girl, stop frontin' (wait)\nI could tell you up to a lil' somethin', hol' up\nI'ma play it cool, baby, roll one (yeah)\nWhile you make your way and get over here (yeah)\nMy girl ain't down, then it's over (woo)\nJust tell her that she look good when I'm over there (yeah)\nIn the first place, pour one up\nBaby, don't be too thirsty\nGroupie love ain't ever gon' work see (uh)\nHoes ain't loyal and never keep it lowkey\nThat ain't alright (yeah)\nI'ma take a shot, couple shots through the night\nTell a joke, keep it fun, make her feel it's alright (whoop)\nGive you the game wholesale (whoop)\nAnd bet a hundred that I take 'em to the hotel\n\n[Chorus: Kid Ink, Chris Brown & Both]\nI said why you over there lookin' at me (whoop)\nWhile I'm with my girlfriend?\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, oh, woah, we could take it there (woah)\nLet's take it to the hotel, oh, woah baby, we could take it there (woah)\nTake it to the hotel, baby, leave with me\nKnow I got a penthouse suite\nI said why you over there lookin' at me\nWhile I'm with my girlfriend??\n\n[Verse 2: Chris Brown]\nIt's kinda hard when I see you lookin' over here with them eyes\nI got a girl but I'm feeling your body, so I'ma have to just play both sides\nI hope she don't come over here 'cause I'm with my girl, you know I love her\nI got two of my bitches in the club and they know about each other, oh, no\n\n[Verse 3: Kid Ink]\nUh, but a nigga never Paranoid\nYou fuckin' with a man, not a little boy\nWhat? I could barely hear your lil' voice\nIn the club but your body makin' all the noise\nClap it up, stack it up\nBaby, where your purse? Just pack it up\nAnd grab her hand, tell her we should go now\nIf you really wanna take this party to the hotel\n\n[Chorus: Kid Ink, Chris Brown & Both]\nI said, said why you over there lookin' at me (whoop)\nWhile I'm with my girlfriend?\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, oh, woah, we could take it there (woah)\nLet's take it to the hotel, oh, woah baby, we could take it there (woah)\nTake it to the hotel, baby, leave with me\nKnow I got a penthouse suite\nI said why you over there lookin' at me\nWhile I'm with my girlfriend?\n\n[Verse 4: Kid Ink]\nOver there lookin' all suspicious\nGet a clue, girl, don't be a mystery\nI see you likin' on all my pictures\nOf me and my bitch up in all of our business (woah)\nSo, you gotta know it ain't a limit to\nWhat a pill and the liquor do (nah)\nMake a straight girl go down, just spit down\nI might fuck around and lick her too\nIt ain't a problem, my metabolism high\nEat you both up for dinner (woah)\nJust keep it real with a real motherfucker\nAin't got time for no pretenders\nNow just bring it to me\nThat fleek, that freak, no classy stuff (uh)\nBeen pushin' up, don't pussy out (uh)\nBitch, what you really on? (Nah, what?)\n\n[Chorus: Kid Ink, Chris Brown & Both]\nI said, said why you over there lookin' at me (whoop)\nWhile I'm with my girlfriend?\nWhy you over there lookin' at me and my girlfriend?\nLet's take it to the hotel, oh, woah, we could take it there (woah)\nLet's take it to the hotel, oh, woah baby, we could take it there (woah)\nTake it to the hotel, baby, leave with me\nKnow I got a penthouse suite\nI said why you over there lookin' at me\nWhile I'm with my girlfriend?"}]}