{"artist": "Wale", "songs": [{"title": "Chillin’ (dirty)", "year": null, "lyrics": "Na Na Na Na... Na Na Na Na... Hey Hey Hey... Goodbyeeeeee... Hey!\n\n[Lady GaGa:]\nLookin at, lookin at, lookin at me\nLook at that, look how they lookin at me\nEyes all sticky like honey on bees\nLook at that, look how they lookin at me\n\n[Wale:]\nYeah DC chillin, PG chillin\nMy name WALE and I came to get It\nCame to get it, came to get it\nMy name Wale\n\n[Verse 1: Wale]\nSHIIIT This how you start of 09\nKickin in the door, and I'm everybody problem\nStuntin in some other Jordan Nines\nI got Phil Knight talkin about \"How you got them? \"\nLet's talk about the cars ya'll got\nYou say you got alotta whips, well I got a Lot\nI got the right to be cocky\nGet so much cut disc jockeys jock me\nYou niggas mad that you not me\nI remain a Giant and your Jeremy Shockey\nAnd if you ain't heard me properly\nIf you speak garbage, then we no capice\nDC chillin, PG chillin, floor to the ceilin\nStuntin in my Billion-Air, gear on my\nMillionaire Frames, that's money on my mind, WALE\n\n[Bridge: Lady GaGa]\nGet em all, get em all, pack it all up\nStack up your funds like a million bucks\nAcross the pond, they all know us\nInternational... Whoaaaa!\nDriving my car to a foreign place\nLookin at me, now they know my face\nWe want it all now, we got all YESSSS\nLook At That, Look at how they lookin at usss\n\n[Verse 2: Wale]\nYea, they keep sayin whale but my name Wal-e\nHo's call me \"Mr. Never Wear The Same Thang\"\nYou redundant, you never ever change\nAnd I'm the same way, M.I.A\nAnd me Cool and Dre get high like planes\nYour man Wale in his own damn lane\nCan't control the box, you are no Mills Lane\nAin't heard DC since Sardines came\nHa! And I made ya'll love it\nWe don't cop plea's, but ya'll don't cop nothin\nPolice come around don't nobody say nothin\nAnd you be with the cops, you niggas is McLovin\nDark liquor till we busted\nTill I got a buzz like that nigga Chris Mullen\nDistrict Of Columbia\nYou Bernie Mac funny, we ain't scared of none of ya!\n\n[Lady GaGa:]\nGet em all, get em all, pack it all up\nStack up your funds like a million bucks\nAcross the pond, they all know us\nInternational... Whoaaaa!\nDriving my car to a foreign place\nLookin at me, now they know my face\nWe want it all now, we got all YESSSS\nLook At That, Look at how they lookin at usss\n\n[Wale:]\nYeah DC chillin, PG chillin\nMy name WALE and I came to get It\nCame to get it, Came to get It\nMy name Wale\n\n[Verse 3:]\nDre, pick 'em, ah, pick'em, I'll shut em all down\nHaters in the crowd, if you see 'em point them out\nStacks in my jeans, broads on the scene\nFolarin be ballin for all ya'll to see\nAin't I something? The way I'm stuntin\nMy material girls give 'em A-Rod moneyyy!\nLV on my luggage\nThem Bammas goin hate, and I love it, fuck 'em\n\n[Lady GaGa:]\nLookin at, lookin at, Lookin at me\nLook at that, look how they lookin at me\nEyes all sticky like honey on bees\nLook at that, look how they lookin at me\n\n[Wale:]\nDC chillin, PG chillin\nMy name WALE and I came to get It\nCame to get it, came to get It\nMy name Wale", "album": null, "image": "https://images.genius.com/e0cde0eabe61c1ddca97cce2386792d2.421x421x1.jpg"}]}