{"songs": [{"album": "Gravitas", "image": "https://images.genius.com/54775ab17c42667fc0aa1f24ca5154f5.500x500x1.jpg", "year": "2013-12-15", "title": "Inner Monologue", "lyrics": "[Intro]\nRemember, whatever discipline you’re in, whether you’re a musician or a photographer, a fine artist or a cartoonist, a writer, a dancer, a singer, a designer — whatever you do, you have one thing that’s unique: You have the ability to make art. Sometimes life is hard. Things go wrong — in life and in love and in business and in friendship and in health. And when things get tough, this is what you should do. Make good art\n\n[Verse]\nThis about to be the realest shit you ever heard\nI lynch rappers, got them hanging on my every word\nThese bitch rappers be claiming they slinging heavy word\nReally snitch rappers, niggas singing like every bird\nRich rappers, nah, I don't know them niggas\nNiggas don't get rich rapping, they selling clothes or liquor\nMy flow is sicker cause I flow with vigor\nI'm no beginner, peep the whole agenda\nControl my center cause I gravitate with Gravitas\nThis my inner monologue\nBurning down your party cause our cocktails is molotov\nMy crime mob make you stop, lock and drop, don't get wollywop'd\nActually battery in my back like a copper top\nGot it popping, started on the B-side of Body Rock\nDirect to fan, I'm running my shop like my mom and pop\nModern day slavery today to be an artist, watch\nThey treat them like a product and try to mount like a hot 'n tot\nMolly pop, niggas not caring if they body rot\nPartying like Mardi Gras, get the cream like Häagen-Dazs\nGolly gosh, this is Utopia, cornucopia\nI'm known to start revolts against the Romans like Zenobia\nHoping to keep coping copious amounts of opiates\nTried to start a union, but they blocked me like a Soviet\nI hope they get it, I'm sick of explaining history\nI'm rolling with a circle of winners, we claimin' victories\nIt ain't a mystery, the hate'll make it bittersweet\nThey hate when I engage to debate 'em like Wale's Twitter feed\nWho I'm kidding? I'm the great debater\nMy crew stay winning, we stay innovating\nYour circle is rotten as great tomatoes\nThey get high with you then start dry snitching like Jose Canseco\nProsecco, I'm sipping vino with a vivid hue\nHaberdasher rocking Borsalinos like Hasidic Jews\nPitiful, rappers never stand up to the ridicule\nThat's why I had to get at you\nWear it if it fit the shoe, nigga\n(Baby, just shine your light\nIf you've gotta dim yours, so they can shine brighter\nJust stay bright, so shine your light)\n\n[Outro]\nWe're in a transitional world right now because the nature of distribution is changing. The distribution channels that people have built over the last century or so are in flux. The print, the visual artist, the musicians... which on the one hand intimidating and on the other, immensely liberating. The rules, the assumptions, the now-we're-supposed-tos  of how you get your work seen and what you do then, they're breaking down. The gatekeepers are leaving their gates. You can be as creative as you need to be to get your work seen. The old rules are crumbling. And nobody knows what the new rules are, so make up your own rules"}], "artist": "Talib Kweli"}