{"artist": "Knoc-turn’al", "songs": [{"image": "https://images.genius.com/6fade8c4fc0be289776bb35d74635cf6.640x640x1.jpg", "title": "Love Slave", "year": null, "album": "The Way I Am", "lyrics": "[Knoc-Turn'Al & DJ Quik (Talking)]\nK: What up Quik?\nD: 'Ey Knoc\nK: What up?\nD: I'm just trippin' off of how you sound to this beat, man!\nIt's like, it's that kinda shit that make niggas in the street be like\nDamn! And the bitches like -\n\n[Knoc-Turn'Al]\nI'm just lookin' to have a good time and find some ass to grab\nA nice bush to stab and hit, minus the bullshit, minus the two bit\nUp her knowin' I'm ruthless and need of a good bitch\nSo independent, more than my mistress, more than to fuck\nShe comes, reopen the guest list\nMy bunny rabbit, most men want but can't have it\nI'ma tap it, and get pornographic, it's automatic\nShe turns heads, everywhere she goes\nMen that's young and old\nAnd bisexuals, would like to go low\nAnd deliver low blows and high off sex and no do's\n\n[Chorus]\nI just need me a little good lovin'\nSex she wants but she wasn't my cousin\nSexually, she can be, so misleadin'\nSecretly, between the sheets, and she's leadin'\nMy love slave (love slave)\nLove slave (love slave)\nPretty skin, high yellow, dressed in all black leather\n\n[Knoc-Turn'Al]\nUp in the place, doin' the thing, amazing grace\nAmazingly shakes ass and cakes\nDressed in drape and all lace, breakin' me off\nBreakin' it down, breakin' a sweat, touchin' the ground\nUp at the lounge, up at the club, and up at the spot\nUp in the bathroom, living room, or out on the block\nI won't stop, I won't quit, drinkin' a 5th\nBangin' some new shit from Dre & DJ Quik\nShakin' the miss fist & miss hit, call up the smile and fake tits\nHollywood and fakeness, good and greatness\nEverything, a difference is, the difference is\nIn this bitch is, she ridin' dick\nUp this place to be, playin' the game\nMakin' the dame, ignorin' the fame, ignorin' the things\nThat make a dream and stressed out, simply plain\nI maintain a main gain of material things\n\n[Chorus]\n\n[Knoc-Turn'Al]\nThinkin' bout goin' home, freakin' the ho\nBringin' the drink, bringin' some dank and get on the floor\nI'ma, rock it right and separate the men from mice\nLive yo' life, fuck the limelight rap hype\nLookin' to have a good time by midnight\nAnd get mines off and chill with a few dykes\nReady and willin', sorority pledgin'\nLessen them and breast be puttin' work in\nHer man won't know when she craves what she do\nWhen she ain't up in the club and she up in my room\nI seen some guy for less, die for nothin'\nThen seen some rest in peace over fuckin'\nStay in the place to be, doin' the same thing\nMaintain my good game and things won't change\nNiggas is some timey, salty as one grain\nI stay a G, and handle mine, stay out to get paid\n\n[Chorus]"}]}