{"songs": [{"title": "Shit Happens", "image": "https://images.genius.com/4bfbec7dec8482e14a6821dd917c2616.600x600x1.jpg", "lyrics": "Intro (Brother Ali speaking):\nI have this dream all the time shit. Everybody has sex dreams\nMine, you know they gotta be fucked up at the end\nLike get caught cheatin' and shit\nI can't keep my shit right. I can't. So far that is\n\nChorus:\nBe careful, what you pray for\nCause you just might get it and it might come true\nNine times out of ten you're not prepared for\nHow to react if it happens to happen to you\nBe careful, what you pray for\n\nCause you just might get it and it might come true\n\nNine times out of ten you're not prepared for\n\nHow to react if it actually happens to you\n\nVerse One:\nTours is like Ground Hog Day\nEveryday is exactly the same\nAnd don't shit change but the Hanes and the name of the cities that we're rappin' in\nSet the Kool-Aid stand up and hope to pack them in\nOne day this lady got caught in my eye\nLike Rosario Dawson standin' off to the side\nPlease\nMy post show game is none other\nGentleman mack, elderly cat stalk the young Brother\nWho did you steal this section of the floor from?\nUnderground rap show she stuck out like a sore thumb\nShe write for whatever-the-fuck magazine\nAnd she got up on the guest list just to come and check this\nArtist that she heard about\nWord-A-Mouth\nLittle did she know she could bat her eyes and turn 'em out\nHere's me\nForrest Whitaker, pretty baby maker\nNever mind I've been wearing these same pants for three days\n\nChorus [X2]\n\nVerse Two:\nDon't get me wrong\nIt's not in my personality to cheat\nBut I'm a charming motherfucker in my sexual peak\nAnd I swear to God it's not done out of greed\nIntelligence ?, y'all see where this is gonna lead\nI've just seen the bootie in it's natural habitat\nBut never as fat as that\nShit god damn\nShe can't even keep the elastic back of her jacket down\nShit, she came across the street and made a clappin' sound\nGot hips like the holsters of a gunslinger\nOne thing touchin' her thing will make your nuts tingle\nSend a shiver up the middle of your spinal cord\nLettin' your mind explore that's what the vagina's for\nHumpin' it like I got up in the Final Four\nOn a wild card, double team and it's time to score\nLet a primal roar like a fuckin' dinosaur\nAnd filled her with a pint or more of fine white slime dijour!\nBut once the life juice leaves your little head\nIt makes your big one want to take back everything you said\nAnd now I can never look my kids in the eye\nI would probably rather die then to live this lie\n\nChorus [X2]", "year": null, "album": "Scribble Jam Volume 2"}], "artist": "Brother Ali"}