{"artist": "Papoose", "songs": [{"album": "Most Hated Alive", "title": "Blame", "image": "https://images.genius.com/28e7d5ba08f0e096e289be88b85528d7.500x500x1.jpg", "lyrics": "[Intro]\nPapoose, Pa-poose\n\n[Verse 1]\nI came in the game with the fame on the brain\nWhat a shame I was in and the changes are taming\nAll the lames of the game kept staying on my lane\nBut this train on the brain it was drained\nNo pain, no game, cocaine, dope game\nWe was raised by the things we were slinging\nShot us straight in the veins and I ain't been the same\nSo they staying that I was facing the rainman\nReal cake is the same, you were wasting your chance by making it rain\nI was raining!\nTo depend with the thing were you bang with your gang\nIf you bang with your gang better claim it!\nAnd in fact I stayed it was never ever caded\nSo what I thought was caded related\nWe got the pitcher in our places soon as I lace it\nCreated pain and frame it!\nI can send the races with snakes\nFakeness the hatred straight to the Matrix\nDrop tune just so you can face it\nBasic, embrace it, raise it, bass it appraise it\nEverybody wanna be boss when it's all good\nWhen it goes to the left they complain it\nThe responsibilities for your own action\nWhat did happen captain\nStop blaming!\n\n[Hook:]\nIs this for your fault, my fault their fault, out fault\nStop blaming!\nI was gonna play fingers to go to bad guy\nHe did it, she did it, stop blaming!\nSometimes she happens cause it happens when it happens\nGotta stop blaming!\nEvery time you put your fingers back at somebody else\nYou hold your finger point back at you!\nStop blaming!\n\n[Verse 2]\nI took my chance to my stance to enhance in events\nYou're the champ, I'm a take your belt\nSniff coke, shoot dope, take bats off\nSo you can swallow pills to disgrace your health\nYou'll be spending on the strippers\nChecking on benches giving all your riches\nYou just waste your wealth\nThe song goes on, you're a poor old pal\nWhen all goes wrong gotta blame yourself\nI will be yarning some carrying still revolve\nWas pop take a grudge to his grave\nThese feelings he feel were hard\nI will be honored to bury your filthy coffin\nBuild in all this filthy nuisance\nJust to ease your guilty conscious\nI never walk without a strap closer then a lag\nCloser to my lap put the blaze the weapon\nYou pointing on the rap woke us out of sense\nPull a lot of racks, damn momma raised a legend!\nWe're tolling on the check tolling on a jet\nPut the tool behind your back ain't paper toward us\nWe go to total getting names just to hate a lame\nNever would have take the blame, but you take the credit!\n\n[Hook:]\nIs this for your fault, my fault their fault, out fault\nStop blaming!\nI was gonna play fingers to go to bad guy\nHe did it, she did it, stop blaming!\nSometimes she happens cause it happens when it happens\nGotta stop blaming!\nEvery time you put your fingers back at somebody else\nYou hold your finger point back at you!\nStop blaming!", "year": null}]}