{"songs": [{"year": "2018-11-26", "image": "https://images.genius.com/9e431bb722953366fa1d04dfd1d5f16b.750x750x1.jpg", "title": "Licks", "album": null, "lyrics": "[Intro]\nBeatmonster\nYeah, yeah, ha, bitch\nHa, ha, word, ha, word\nHa, ha, word, yeah, BlocBoy, word\nYeah, BlocBoy, yeah, yeah, yeah, yeah\nBlocBoy, word, word\nWord, word, word, word\n\n[Chorus]\nI just hit the club with 'bout 30 on me (30 on me), with my 30 on me\nHe tried to rob me, had to bury homie (Had to bury homie), shoot like Curry, homie\nHuh, swish (Swish), I look like a lick (A lick)\nHow the fuck I look like I'm a lick when I be hittin' licks? (I'm hittin')\n\n[Verse]\nI just left Foot Locker, I got me some Jordan kicks (Swag)\nAnd I RKO these hoes on my Randy Orton shit (Randy Orton shit)\nRest in peace to Hot Boy Juice, you know that we is startin' shit (Startin' shit)\nIf you ain't rockin' with the gang (Huh), then you niggas counterfeit (Word, word, word)\nBitch, I'm shiny (Shiny)\nIf I was a tape, bitch, you'd come rewind me (You'd come rewind me)\nEvery label in the world, they wanna sign me (They wanna sign me)\nCourt just tried to find me (They tried to find me)\nThey put a charge on my jewelry for aggravated blindin' (Blow blow)\nWhat the fuck type charge is that?\nUp the 40 on 'em, see where his heart is at (Bow bow)\nThat nigga say he a king, where his car is at? (Where you're car?)\nWe got dracos and them things, where them carbons at? (Where them carbons?)\nAy, we gon' spark in that (We gon' spark)\nStupid drive-by shooters (Huh, huh, huh)\nWhy you shoot that lil nigga? He didn't do nothin' to ya (Yeah, yeah, he ain't do it)\nThat young nigga had a future (Had a future)\nWhen I see you niggas, it's on sight, we gon' do ya (Ay, we gon' do ya)\n\n[Chorus]\nI just hit the club with 'bout 30 on me (30 on me), with my 30 on me\nHe tried to rob me, had to bury homie (Had to bury homie), shoot like Curry, homie\nHuh, swish (Swish), I look like a lick (A lick)\nHow the fuck I look like I'm a lick when I be hittin' licks? (I'm hittin' licks)"}], "artist": "BlocBoy JB"}