{"artist": "Canibus", "songs": [{"title": "Bar War Sample", "album": null, "year": null, "image": "https://images.genius.com/610ec27b5a9b61eb4645d86cc8864516.480x360x1.jpg", "lyrics": "[Intro: Black Sabbath sample]\n{\"Has he lost his mind?\nCan he see or is he blind?\nCan he walk at all\nOr if he moves will he fall?\"}\n\n[Verse: Canibus]\n...like a pit bull\nOn full moon, man switch to wolf\nFull proof verse from Hell to Turnbridge Wells\nYou never seen an MC do it this well\nEveryday we battle at Saint Germaine's Chapel\nBut it's practical, I'll smash you and nobody laughs at you\nThe Ripper rip you up, drag you behind the basilica\nThey find drugs, lyrics and blood, I hit you up\nLonely heart vocal throwing dart oligarch\nCreates art from an upstate New York motor park\nAnd won't get off his high horse to come talk unless it's important\nAnd it could cause a spark, but it's dark so he stays dormant\nYou don't want it, you just act like it\nYour style ain't flawless you just rap like it\nI'm level 3-A like Curtis LeMay\nThe Blackhawk bird of prey with superb taste\nI re-inject my blood to give me a buzz\nThen I re-inject the buzz, blow out your earplugs\nScrub your eardrums, suck the air out of your lungs\nYou combust in a vacuum of solar flare from the Sun\nI walk through a gestalt of thought to the sound of a harp\nFrom afar playing the notes I was taught\nI was caught, shackled, sold, re-bought\nGlobal mind forced to restart, my rhymes skipped forward\nThe HRH of time and space\nAnd rhymes through the bars, my lines displace\nConcentrate, mitigate concrete debate\nGreat how I create what you hired me to make\nExtrapolate, update rap at a rapid rate\nFans hate it ‘cause I can't practice everyday\nNumismatic treasure chest stashed in the attic\nSpondulix in exchange for the musical magic\nWith two tablets placed on the cabinet, I wonder who will grab it?\nIf no one does, I'll have it\nBoth lobes connected, flow been perfected\nWhatever method, select it, let's spit\nIncredulous lyrics, the breath of life spreading through the spirit\nHip-Hop never knew what hit it\nStubby beard, chubby skin under the hair\nI spent my wonder years carrying nothing but guns and gear\nWith a focused rap flow, tongue snap like a hybrid bow\nMy quotes end up inside your throat\nRespect for Hip Hop balance the Biosphere\nBut I've been there before so why go there?\nI soar through the air, my clarity so clear\nThat my Dali Lama prayer give me cauliflower ears\nI've been rhyming for years\nClimbing the monastery stairs being involuntarily prepared..."}]}