{"artist": "Pill", "songs": [{"album": null, "title": "Why It Gotta Be Like Dis (Mama)", "image": "https://s3.amazonaws.com/rapgenius/Pill-31.jpg", "lyrics": "[Hook]:\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\n\n[Verse One]:\nCan't even eat right\nStreet life, ma don't even sleep nights\nThinkin' 'bout your tender loving care roamin' these street lights\nHe might, lose his fuckin' mind is what the people think\nKeep a drank, drowning in my sorrows for the reason ain't\nEnough time in this song to tell you how much I miss you\nTears falling at every wall that carries your picture\nI remember them days, begging you please to stop\nYour little son needed love but you needed a rock\nDamn\nBut you made sure there was meals on the table for us\nCan't even describe how I drew strength from your faith and glory\nA story you told me that made me think\nIf you believe you can achieve, ain't no such thang as can't\n\n[Hook]:\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\n\n[Verse Two]:\nGeraldine Carrie\nRivers it's been scary\nLiving without your presence but I know you up in Heaven\nSmiling down on your child still chasing his dream\nBut I can't kiss your beautiful face and it's making me scream\nThe situation that I'm going through is making me tougher\nSometimes I bow and ask the lord why is he making me suffer?\nLove ya\nLike no other, I look up at the clouds\nHoping that you hear me clearly cause I'm saying it loud\nHow\nCan I be a better man and make the right decisions?\nI try so hard to be in charge of this life I'm livin'\nI'm lonely, crying to myself sitting in the dark\nOne thing I promise is you'll always be within my heart\n\n[Hook]:\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\n\n[Verse Three]:\nColder as the day goes\nRemember playing with Legos\nWatching you in the kitchen cookin' chicken and potatoes\nAin't no, comparison to compassion and character\nThat you instilled in me, filled with things, helping me carry the\nLoad on my back, a book bag full of pain and grief\nAlmost three years since you've been gone, I'm still in disbelief\nI miss the sweat reflections when you were stressing\nTold me to smile, it'll get better, we'll receive a blessing\nA lesson, to the wise, value your mother's every breath\nCause if she goes, you ain't got 'nother left\nA lesson, value your mother's every breath\nCause if she goes, you ain't got 'nother left\n\n[Hook]:\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy\nWhy it gotta be like this?\nWhy it gotta be like this?\nI lost my baby and it's gonna drive me crazy", "year": null}]}