{"songs": [{"title": "Do It Like Me", "lyrics": "[Intro - Young Buck]\n\nAll my thugs and thugettes\nWalk where I walk, see what I see\nNow I welcome you to Cashville, Tennekee\nAll my life, I hustled all night\nNow I'm alright, my wrist is all ice\nAnd I did it all, without y'all advice\nI done been to hell and back, twice\nYou can't do it like me\n\n[Verse - Young Buck]\nNow as the world turns, I let my blunt burn\nPolice writing down my tags, like I'm concerned\nI graduated from the nickels and dimes\nYou need the fed's bitch to come get mine\nGet on the grind ho and stay the fuck outta mine for\nThe kids find daddy laid out with his eyes closed\nI know, can't be humble in the jungle\nGave a nigga an inch, he'll take a whole mile from ya\nSo I bust first, fuck this earth nigga what's worse? Waking up in the pen, or sleeping under the dirt\nBoo yow is the sound of the 40 cal\nAK's, banana clips hold a 100 rounds\nTest me, rude boy don't want none\nGot Jamaicans and Haitians buck, buck, buckin' they gun\nWhere the hood at? nigga, that's where I come from\nWhere shoot dice, snort white, sell crack and heroin\n\n[Hook - Young Buck (50 Cent)]\nYou can walk like I do, and talk like me too\nBut nobody gon' rock with you\nCuz you can't do it like me, nah you can't do it like me\n(Hold on a second homie, let's get this clear)\nYou can walk like I do, and talk like me too\nBut nobody gon' rock with you\nCuz you can't do it like me, cuz you can't do it like me\n(Hold on a second homie, let's get this clear)\nG-Unit!\n\n[Verse - Young Buck]\nSomebody tell me what this world coming to\nWhy they go get they metal detectors when we come through\nYa I know we got beef, and niggas say they wanna kill us\nBut you can't get mad, cuz the whole word feel us\nDo the math, half of these niggas lying in they rhymes\nThey don't even read the paper work, just sign on the line\nI got a 9, and a heart to go get mine\nAnd I'll be God damn, if I take a loss this time\nI'm fishline, in the water, nibble only to get caught\nMay I take ya order? Ya, I can get it in New York\nSee the streets know, this nigga here'll let the heat go\nBe low, don't be no muthafuckin' hero\nA kilo'll get a nigga whole click killed\nYou ain't gotta spend shit, niggas'll hustle up a mil'\nWhen you live with all the roaches, you kill all the rats\nAnd the thugs that ain't focused, get they head cracked\n\n[Hook - Young Buck (50 Cent)]\nYou can walk like I do, and talk like me too\nBut nobody gon' rock with you\nCuz you can't do it like me, nah you can't do it like me\n(Hold on a second homie, let's get this clear)\nYou can walk like I do, and talk like me too\nBut nobody gon' rock with you\nCuz you can't do it like me, cuz you can't do it like me\n(Hold on a second homie, let's get this clear)\nG-Unit!\n\n[Verse - Young Buck]\nI know I got a dirty mouth, bitch I'm from the South\nI'm nothing like what you done seen or you done heard about\nI'm in my best on the block, a vest and a Glock, and the rest in my sock\nUnless I was Pac, you won't see me with a cross on my back\nGotta do my own thang, can't copy that cat\nLet me holla at ya for a minute man\nIf ya stand for nothing nigga, you'll fall for anything\nI'm busting any brain, they say that I'm insane\nBut I came in this game with cocaine in my veins\nWhat I'm saying, that I'm trained to go and turn a penny to a 20\nYou complain, I'd rather work with what he sent me, ain't it strange\nHow I went from a hooptie to a Bentley, I ain't changed\nI'm in the hood, you want me? come and get me\nFeel my pain, but don't feel sorry for me\nCuz there some kids in Somalia with nothing to eat\n\n[Hook - Young Buck (50 Cent)]\nYou can walk like I do, and talk like me too\nBut nobody gon' rock with you\nCuz you can't do it like me, nah you can't do it like me\n(Hold on a second homie, let's get this clear)\nYou can walk like I do, and talk like me too\nBut nobody gon' rock with you\nCuz you can't do it like me, cuz you can't do it like me\n(Hold on a second homie, let's get this clear)\nG-Unit!\n\n[Scratching - 50 Cent - hold on a second homie, let's get this clear]", "album": "Straight Outta Ca$hville", "year": "2004-08-24", "image": "https://images.genius.com/c4f8631214daf9f3357f633e0f045d6c.1000x1000x1.jpg"}], "artist": "Young Buck"}