{"artist": "Porta", "songs": [{"album": "Equilibrio", "title": "Realidad virtual", "image": "https://images.genius.com/aa27426d55342fc5e77da95dffc19068.799x799x1.jpg", "lyrics": "[Intro: Piter G]\nDamas y caballeros, sean bienvenidos al enfrentamiento entre las dos mejores casas de videojuegos\nA mi derecha Zarcort, a mi izquierda Porta\nPlaystation VS Nintendo, caballeros que comience la batalla\n\n[Verso: Porta]\nPuedes llamarme  Sir Daniel Fortesque\nTú estás aquí sin flow como en Parappa The Rapper\nYoutuber, te invito a participar a mi Tekken\nSúbete a este ring,  mi Kame-hame contra un Hadōken\n\nEres un Limo, un Únimo en Ni No Kuni\nJin Kazama es mi Nakama, me como una Akuma no mi\nPiyo a Akuma y te hago un combo capaz de tumbar a un Zombie\n¡Zarcort! Me zampo a los cerdos como tú en el Tombi!\n\nTe atrapo en mi red como Spike en Ape Escape\nTomo un Diazepam para este tiro\nCon solo 16  te dejé mudo como a Abe en Oddworld Oddysee\nSoy Solid Snake acechando al dragón Spyro\n\nCon Sonic y Tails no te daré ni un respiro\nTe dejaré pixelado como en 3d Dot Game Heroes\nVeréis, domino la keyblade con estilo\nHaré de Nathan Drake porque después de esta follada me retiro\n\n[Verso: Zarcort]\nYo voy a hacer que te vistas de verde como Link\nTe daré tu saco rojo y tenemos la copia del Grinch\nAsí que guárdate tu rupia y dame perlas\nYo no tengo rubia, pero tengo una morena que no es \"cerda”\n\nBienvenido a mi terreno, pilla asiento\nCon el tiempo eres como tu fontanero, gordo y lento\nDame el tempo que me lo fulmino como Sonic\nMi sonido es parecido como al de un rabioso Rabbids\n\nVoy, voy, mira como subo el nivel\nNo necesito meterme una seta para crecer\nYo me compré una Nintendo 64 con 64 juegos que tiré\n\nDame una doble con queso, con gráficos extras\nSi quiero jugar clásicos pues llamo a Bethesda\nMe gusta el rollo mágico y una buena orquesta\nVoy a tener que darte clases con mi gran espada maestra\n\n[Estribillo: Piter G]\nDamas y caballeros\nEstá en juego el ganador, este es el mayor pique de consoleros\nUno frente a otro, mandos, juegos y que comience la batalla\nSolo va a dar la talle el que, deje a ralla a quién esté jodiendo\nDentro de este ring personajes en pantalla, ¿tú de que lado estás? ¿Del de Sony o Nintendo?\n\n[Verso: Porta]\nEsta es mi Ultimate Battle 22\nTe hago un 1080 a 1080p como Tony Hawk’s\nTe dejo K.O, con un  par como Lara Croft\nCompararte a mi es decir que Square-Enix es Squaresoft\n\nGLaDOS me guió por Portal hasta el plano espectral\nLa Soul Reaver me hace inmortal\nVoy con Ebony e Ibory por Devil May Cry\nOmnislash desde Nibelheim, como Cloud Strife\n\nHago equipo junto a Jak and Daxter y Ratchet and Clank\nLoco, solo te  provoco porque soy el Tank\nChico, agárrate de Ico\nMi diestra es el puño de Rayman, mi zurda la Mega Buster Gun\n\nVete niño rata a jugar al Minecraft un rato\nNo rapeo como Dios, rapeo como Kratos\nMira mi disfraz de Helghast, yo seré The Last Of Us\nTu solo eres un racoon yo un bandicoot como Crash\n\n[Verso: Zarcort]\nVoy a hacer que Kirby te coma sin hacerte daño\nYa que te lo comes todo sin importar el tamaño\nAntaño eras mejor, solo te queda la marca\nMira tu cara Porta cuando me ves como portada del año\n\nNo tengo nada que temer, fuerte como Donkey\nMe acerco con sigilo a tu trasero y YipiYeii\nMás patético que el juego de los chuchos\nVoy a soplarle a tu nuca como soplaba cartuchos\n\nMucho ladra, bla, bla, bla, poco morder\nVoy a ponerte firme, como Price estamos en la mili\nEras el protagonista hasta que llegué\nY de repente estás en un segundo plano como Luigi\n\nBaja los humos porque tan poco eres tan bueno\nNo soy de los que corren y mucho menos te temo rapero\nMira mi temon que quemo como un volcán\nVoy a humillarte 150 veces como a Pokémon\n\n[Estribillo: Piter G]\nDamas y caballeros\nEstá en juego el ganador, este es el mayor pique de consoleros\nUno frente a otro, mandos, juegos y que comience la batalla\nSolo va a dar la talle el que, deje a ralla a quién esté jodiendo\nDentro de este ring personajes en pantalla, tú de que lado estás ¿Del de Sony o Nintendo?\n\n[Verso: Porta]\nFan, vives de lo que inventé, aún tienes mucho que aprender\nYo Sembré una idea que hoy otros solo han de recoger\n¿Donde estabas tú los 10 últimos años que triunfé?\nY sigo en pie, mi ciclo aguantará más que el de la Play 3\n\n[Verso: Zarcort]\nPrepárate porque voy a quitarte la fama\nNo me ganas ni con manos atadas jugando con los pies\nAcércate yo te daré la pana\nMe das mas verguenza que Nintendo llorando en el E3\n\n[Verso: Porta]\nSoy imprevisible, eléctrico como Cole\nMás difícil de vencer que un  jefe del Demon’s Souls ¿You know?\nTriángulo, Cuadrado, Equis y Circulo, mis vínculos\nNo haré un Fatality porque tu vanity es ridículo\n\n[Verso: Zarcort]\nVoy si, más aburrido que el housing\nDicen ¡Oh shit! solo cuando suena mi music\nNo me gusta Fox McCloud, yo quiero a Foxy\nCómeme un huevo y cágalo como Yoshi\n\n[Verso: Porta]\nTu sangre se queda aquí, del cáliz de Belomnt bebo\nCon León y Chris Redfield  voy tan O.P como Trevor\nYo digo el blanco al que fijo, John Marston aprieta el dedo\nCazo junto a Amateratsu, Zarcort, tú eres solo el cebo", "year": "2016-10-21"}]}