{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/81c1e00d3e677ec86b70ef93aa219de3.425x424x1.jpg", "title": "Mr. 187", "year": "2009-08-13", "album": "King of Horrorcore, Vol.2", "lyrics": "[Intro]\nSatan made this lane, from Hell he came\n\n[Hook]\nAll I see is murder, murder my mindstate\nPreoccupied with homicide, trying to survive in this crime rate\nYou are listening to a violent felon\nSo say hi to Mr. Kill yo ass, Mr. 187\nMurder, murder my mindstate\nPreoccupied with homicide, trying to survive in this crime rate\nYou are listening to a violent felon\nSo say hi to Mr. Kill yo ass, Mr. 187\n\n[Verse 1]\nI'll break bones to take home what I can’t hold inside of my stomach\nDrunk his blood and ate his ankles\nButtfucking a five year old\nPut the knife inside her hole then slice her throat\nShe's been dead for days, I still put new dresses on her\nThen spread her legs and lick whatever's left on her\nI never met Dahmer\nBut if I would I would’ve drugged him and fucked him, cooked and served them to Jeff's father\nI'm not a maniac dressed in all black\nGot on a polo shirt bifocals and some nice dress slacks\nThen I'll take some Ex-Lax\nThen shit on your chest\nThis is the best, the smell of death only makes the sex last\nYou've been in the shower for hours, can't wash off rape though\nI hear her holler as hot water hit where I made those\nIncisions I vetoed the rope with Mako precision\nI hate hoes and women\nNow listen now, Mr. 187\n\n[Hook]\nAll I see is murder, murder my mindstate\nPreoccupied with homicide, trying to survive in this crime rate\nYou are listening to a violent felon\nSo say hi to Mr. Kill yo ass, Mr. 187\nMurder, murder my mindstate\nPreoccupied with homicide, trying to survive in this crime rate\nYou are listening to a violent felon\nSo say hi to Mr. Kill yo ass, Mr. 187\n\n[Verse 2]\nI'm inside of a state prison\nWhere if you rape women you'll be a rape victim, motherfucker\nI decided I hate living\nHey warden, fake this one without the pick and hit that motherfucker\nI’m ready for death row, baby let’s go\nEither show's labelled on the table\nGettin’ myself poked\nWith needles, or they'll lead you to a chamber with gas in it\nThey see that I'm too evil so they hang me my last minute's  dangling\nTurnin’ red, death's coming, before it do\nI'll speak in the tongues and voodoo, my songs shall go into you\nGot the Jigsaw killer tatted on me\nI feel him, although he's never killed anyone\nIt was your decision\nMotherfucker, I'm a walking summer vacation that went wrong\nBlood all over the cabin, I'm hacking blood on your bitch form\nI'm savage, I can't believe period blood is this warm\nAss murder mixed with sick porn, Mr. 187\n\n[Hook]\nAll I see is murder, murder my mindstate\nPreoccupied with homicide, trying to survive in this crime rate\nYou are listening to a violent felon\nSo say hi to Mr. Kill yo ass, Mr. 187\nMurder, murder my mindstate\nPreoccupied with homicide, trying to survive in this crime rate\nYou are listening to a violent felon\nSo say hi to Mr. Kill yo ass, Mr. 187"}]}