{"songs": [{"image": "https://images.genius.com/172fd11d985cafaf1a69338ab1207c15.600x600x1.jpg", "year": null, "lyrics": "[Intro]\nSí, un tema muy diferente algo serio, no?\n\n[Verso 1]\nTe recuerdas cuando estabamos juntos tú y yo?\nTeníamos un detallito, malentendidos\nPensar que estaríamos toda la vida juntos, solos sin despedidas\nFue un engaño que yo mismo merecí\nPensando que todo lo tuyo era para mí\nDecidiste jugar juegos y perdiste\nY ahora te la pasas en la vida triste\nCómo pensar hallar otro como yo\nEstás loca?, no existe en este mundo\nFui el unico que te dio todo y te valió madre\nY te awitas cuando me ves en la nave paseando\nHoy lo que me admira es que quieres regresar\nY me dices que soy yo el que quieres más\nYo te dañé tu corazón sin tratar\nY por eso sé que no me puedes olvidar\n\n[Coro]\nSé tú no puedes aunque intentes olvidarme\nSiempre volverás una y otra vez\n\n[Verso 2]\nCómo he de hacer pa'olvidarte, niña mía\nHoy te juro nunca mas volverme a enamorar\nNo miento sin recordar ningún momento sufrido\nSigue con tu vida te lo pido\nNada más una vez se rompió mi corazón\nTu decepción mi peor desilusion\nY aquellos tiempos salieron por la ventana\nMujeres como tú no valen nada\nLamento pensar también que fuiste mia\nY aquello que vivimos era solo una mentira\nPor eso mismo te conpuse esta canción\nDireccionada a tu falsa decisión\nYa ves? cómo son las cosas\nTiempo que pasó y ahora ¡todo me vale madre!\nCon este tema aveces siento que me quema\nIgual que cada trago que corre por mis venas\n\n[Coro]\nSé tú no puedes aunque intentes olvidarme\nSiempre volverás una y otra vez\n\n[Interludio]\nSí, cómo no? de ves en cuando\nHay que hacer las cosas aunque nos valga madres\nPero en esta ocasión se han volteado las cosas\nY ahora.. qué será de ti?\n\n[Verso 3]\nMi intención no es de hacerte sentir mal\nSimple decirte todo lo bueno que perdiste\nY no me hagas malas caras por decirte la verdad\nTe lo mereces y no te puedo esperar\nYa no puedo ser el mismo o regresar contigo\nEso con huevos te lo digo\nPor qué no buscas otro menso para hacer sufrir\nY por el tiempo, así te voy a dejar ir\n\n[Verso 4]\nQue triste es recordar y no saber aprovechar\nTodas las cosas que siempre te quice dar\nY ahora me ves cómo gozo de la vida\nMientras que tú finges siendo la sufrida nada te queda\nQue mala suerte no lo crees?\nPorque las cosas se voltearon al revés\nVive tu vida y déjame vivir la mía\nCrees que valió la pena tu mentira?\n\n[Coro]\nSé tú no puedes aunque intentes olvidarme\nSiempre volverás una y otra vez", "title": "Tu Mentira", "album": "Komp 104.9 Radio Compa"}], "artist": "Akwid"}