{"artist": "Ice Prince", "songs": [{"title": "Can I Talk", "lyrics": "[Produced by: TMXO, DABEATFREAKZ, SAMMY GYANG, CITYMONSTER(G.R.U)]\n\n[Intro: Iceprince]\nCrazy beat TMXO, I be here with my man\nCity monster, can I talk?\nLet me advise you. Aah\n\n[Verse 1: Iceprince]\nI wake up in the morning, fucked up and lazy\nI had an all night, d shit is fucked up and crazy\nI look inside d mirror, and I cldnt even face me\nMy face look like some shit that was buried in the 80s\nNiggas looking up to me for everything\nMy chick been looking up 2 me for wedding ring\nAm tryna stack it up and be a veteran\nAm David to Goliath and imma put it on every sling\nNow they wanna take this crown off me\nBut imma take the longest route softly\nAnd imma get to the top of the top and as long as I wear\nThesame shoes MI Abaga bought me\nNiggas acting like I started yesterday\nI been spittin 99 nigga, yes for days\nAm from J-city go investigate\nWe go to church on d top of the mountain nigga just to pray\nAllahu Akbar? dawg\nMy single been getting a world premiere dawg\nAnd thats a bigger reason I should fear God\nAnd any rapper coming close to me is just a mere hug\n\nWohoooo!!!\nWohooo!!!\nRarrrr\nMonster\nYeah!!\n\nAnd at the end of the night am the last one\nMy grand dad gotta be proud of his grand son\nI gotta get him a chevy if thats it\nI gotta follow God in the book of Ecclesiastes\nYeah I know Jesus and Allah\nMore than I know Yeezus and Prada\nNigga I been ruthless from tata\nWhen am in the booth my boots can make em' Dada\nAm in my 2pac shit,I might switch it up and come back with a hook thats sick\nThrow a punch, flip it over with a good ass kick\nAm still flawless, nigga imma do that sick\nAnd amma do that shit, Audu I promise imma do that shit\nGet you a space in my saloon ass whip\nFew years back you told me I would blow my clique\nAnd am looking at you Boss, how you know that shit?\n\n\n[Hook: Iceprince]\n\nWhen them man dem win them talk\nWhen the man dem loose dem yawa\nWhen the man dem sabi They yimu yimu night and day\nAah Yee\n\n[Verse2: Joell Ortiz]\n\nBathe in poison or go with the lotion\nTotal devotion or over commotion\nYou could be misguided in the valley or\nClimb to the mountain top and hear the voice always open to coaching\nAsk yourself who team do you wanna play on\nWhen its rough you gon ask to be traded or u gon stay on\nBe a leader dont follow whatever they on\nYou Follow that black and white let the lost ones follow crayons\nSee God mehn, He be working on me lately\nHis voice done got louder his feelings they fully shape me\nHe tryna wake me, wake me, and thats a blessing in itself\nLying in d Lords gift you can't measure it in wealth\nAm just living in this world out here bettering myself\nIf am sick I say a prayer, dont need your medicine to help\nAnd even after all of my sins, I ain't worried about nothing\nGod said put it all on him\n\n[Verse3: MI Abaga]\n\nIce Prince, Joell Ortiz, MI Abaga dis gon' end all speech\nThese rappers still stink so here's some menthol sweets\nThis for the top mehn we can't all reach\nSo most of my time nowadays are just spent on beach\nCouple new disciples round me spit the cyphers then I mentor and teach\nSee the game needs rearranging\nLike the bed-sheets need some changing\nAnd the pillows needs some fluffing\nThe flooring needs some scrubbing\nI can't leave rap I gotta do this for heredity\nAlready got prosperity, am doing it for legacy\nEverything I spit is like some tissues for your issues\nSo they diss you till you gon and they gon miss u\nMiss me with that Kony shit Or we rich as homie spit\nPolicing this hiphop academy like am Mahone bitch\nNiggas always look for me to kill them Joseph Kony shit\nFuck u pay me I dont fuck with u so u dont owe me shit\nFocus and hustle's what am all about\nDude I been relaxin, call me when u bought a couch\nWhat more you all about?\nI kill shit in the studio so technically its thesame thing as a slaughterhouse\nI am the GENESIS of rapping, see I began the EXODUS now we making it happen\nStill doing my NUMBERS, and God alone JUDGES\nIts JUDE the REVELATION of the year we been big budgets\nRocking ice with ice, chopping jewels with joellz\nKing that has been silent but still on the throne, who else?\nMI a greatest ever. haters they can hate for ever\nNigga I just flow better, I didn't create the river\nAct like u dont know me But homie when u lonely\nAt home I see u callin my name\nAnd right next 2 d hall of fame, is d wall of shame\nSo you see me on the throne my man\n\n\n\n[Outro: Iceprince]\n\nIt's all love dawg\nWe no dey fear person\nWe not friends and so I no dey hear person\nNever dat, me na hear shit about u, oh yes\nJokes on u bro, waddup\nThey call me Iceprince Zamani, Choc boi shit\nJoell Ortiz, bang bang bang\nMi Abaga, shots shots shots\nReal generals ya know, we on the map now\nWe never start yet, we ain't started yet", "image": "https://images.genius.com/b9fe1dd3dff4a0ce728922d53172fea6.1000x1000x1.jpg", "album": null, "year": "2014-05-21"}]}