{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "[Intro: Will Smith (Tra-Knox)]\nUh, Uh, I'm comin'...\nWatch ya back, I'm comin...\n(Ooh, ooh, ooh, ooh...)\nBig Will for the Y2K, ugh\n\n[Verse One: Will Smith]\nFeel the Earth tremble, see the skies turn red\nEclipses, shooting stars, turn ya head\nVolcanoes erupted, rage in the sea\nAin't the second coming of Christ\nIt's the first coming of me\nThey say if you damn up the Nile\nIt would throw off the rotation of the Earth\nWell, messing with me is worse\nFeel the rain, button up you overcoat\nWatch the illadelph bad boy go quote for quote\nWell, ya'll want the best, well, I'm right here\nYou looking for competition, ain't no one there\nYa'll in the stands dissin', kickin' dirt and missin'\nMy heavenly flow put MC's in hell's kitchen, ugh\nAnd I'm so, I'm so hot, hot, ya'll burnin' up, HOT\nI step in, it's like the wedding between Hope and Armaggedon\nThe Hip Hop Moses to where we headin' y'all\n\n[Chorus: Will Smith (Tra-Knox)]\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me!\nI'm comin', I'm comin' (Comin'... comin')\nCan't hold me back! Uh uh (Yeah, I'm comin', oh!!)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me (Oh no, no, no...)\nI'm comin', I'm comin'...\n\n[Verse Two: Will Smith]\nWhen I was born there was a rainbow formed with no sun\nRoy G Biv marking the path for the chosen one\nAn angel, my grandma, told me before she died\nSmart folks don't need to put no cursing in they rhymes\nSo from CD to TV to movies back to rhymin'\nMy lifestats makes Jordan's six rings look common\nYa'll hate, I retaliate, just by being great\nBig Will the enemy of your mental state\nWith the same rhyme I used to burn your idol in a battle\nTo screw you into saying, \"Look, I don't wanna battle\"\nM.I.B., WB mad respect\nBlack stealthbombarama, radar can't detect that\nI'm comin' is what I screamed\nAs a teen armed with discipline, faith, and a dream\nAfter smoke clears, after life's roller coasters\nSee who stands putting his mic into his holster, what!\n\n[Chorus: Will Smith (Tra-Knox)]\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me! (No no, no no)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't hold me back! Uh uh (You can't hold me back...)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me\nI'm comin', I'm comin'...\n\n[Verse Three: Will Smith]\nBatton down the hatches and latch the doors\nYou wanna try to match my whits with yours\nThree hits, I hit you, you hit the floor\nThis track is the third hit, that's for sure\nBeat thick reminiscin' of a bodacelli\nI'm like a cheetah huntin' out on the Serengeti\nI got my X-ray vision through all in my way\nNo Plan B, it distracts from Plan A\nStay splitting in half, earthquake style\nEvacuate your premises, the hardcore nemesis\nI never miss, my flow never flawed\nGrab mics and send electric shocks through the cord\nQuest for the rings my only weapon's intuition\nMy future position is determined by past decisions\nSo young George Bush, I'm thinking bout runnin'\nMaybe not this time, but trust dude, uh\n\n[Chorus: Will Smith (Tra-Knox)]\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me! (You can't stop me...)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't hold me back! Uh uh (Can't hold me back, no...)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me (Ohhh...)\nI'm comin', I'm comin'... (Oh oh! Oh oh!)\nYou can't hold me back! Uh uh\n\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me! (You can't stop me...)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't hold me back! Uh uh (Can't hold me back, no...)\nI'm comin', I'm comin' (Comin'... comin')\nYou can't stop me, you can't stop me (You can't stop me...)\nI'm comin', I'm comin'...\nYou can't hold me back!", "image": "https://images.genius.com/6d35ec81cf7a17dcc359661f467d19b0.899x899x1.jpg", "album": "Willennium", "title": "I’m Comin’"}]}