{"songs": [{"album": "Quality", "image": "https://images.genius.com/639d018fa60e7677cf3ab227ccd69dfc.300x300x1.jpg", "year": "2002-11-19", "title": "Gun Music", "lyrics": "[Talib Kweli]\nNow, If I'm out of town my crew take of ya bodies the more the merrier\nPoint and spray the area\nNiggas is quick to bury ya\nPunk niggas feel inferior\nGuns make us superior\nCats start acting scarier\nSituations get hairier, yo\nYou know who killing it, niggas saying they militant\nThe only blood in the street is when the government spilling it\nYou could have a hand gun or a cannon\nAnd you still (?)\nWithout the knowledge and wisdom and understanding of\nA 22 derringer\nA 38 long\nA 44 desert eagle\nA Glock Nine\nTime to protect the fam I'm a cock mine\n\"I make the streets run red like a stop sign.\" Stop lying\n\n[Hook]\nCo Coi Coi Clak Clak Clak Clak Clak\nGun man music never take shot back (oh!)\nCo Coi Coi Clak Clak Clak Clak Clak (Come On)\nGhetto Red Hot 'round the world you hear that (oh oh oh come on)\nCo Coi Coi Clack Clak Clak Clak Clak\nGun man youth never take shot back (Yes!)(Brooklyn)\nCo Coi Coi Clak Clak Clak Clak Clak\nGhetto red hot 'round the world you hear that\nIn Jamaica (Kingston), In Brooklyn (Flatbush), In Ethiopia (Yep)\nWe Go There and Back (Come On)\nTo all my real live soldier cats where you at\nDogs don't hold them back\nThose the cats that go to strapped to blow a back\n\n[Talib Kweli]\nYou could be whoever, a black panther or lap dancer\nWhen respect is the question folks coming with the gat answer\nShoot at your feet like spider, you a tap dancer\nWhat am I amusing to you?\nYou better have that answer\nToys for guns? I got guns for toys\nSilencers bring the heat without bringing the noise\nBringing the funk of dead bodies, go ahead bring in your boys\nYou'll see the soul of black folk like W.E.B DuBois\nIsraelies got tanks and Palestinians got rocks\nInmates got shanks and dirty cops they got Glocks\nWe got tribes in Africa that listen to Pac\nFighting with brothers who pump Biggie like they live on the block\n\n[Hook]\n\n[Cocoa Brovaz]\nThese are the tools of the trade\nThat we use to get paid\nWhen we cruise on escapades\nAnd escalades with guns to blaze\nWe been this ways since the younger days\nSafe from the hunger pains\nPop Bang when the trouble came\nPioneers of gun slang\nSupply you with them things\nA little something, something\nSet fire to the game\nMy system be thumping\nCo Coi Coi! the sounds of guns busting\nCo Coi Coi! your heart just start pumping\n\n[Talib Kweli]\nFrom a 22 derringer\nA 38 long\nA 44 desert eagle\nTime to protect the fam I 'ma cock mine\nI make the streets run red like a stop sign stop lying\n\nGun Music y'all"}], "artist": "Talib Kweli"}