{"artist": "Plies", "songs": [{"album": null, "title": "Check Callin", "image": "https://images.genius.com/de38488ed6af447c3bb00f64ee5ac438.600x600x1.jpg", "lyrics": "[Hook: Youngboy Never Broke Again]\nBaby, don't worry if I\nCome home late like 3 or 4\nWhen that check call, I gotta go\nBaby, I'm sorry\nThat check, it keep callin'!\nThat check call like brrr\nThat check call\nMy phone boom\nMy phone boom like brrr\nMy phone doin' numbers on 'em\nNumbers on 'em like brrr\nBaby, I'm sorry\nThat check, it be callin'!\n\n[Verse 1: Plies]\nI don't need no calculator, I'm too advanced (I'm too advanced)\nSomebody call up Future, I need some Percocet (I need some Percocet!)\nToday my ten-year anniversary of my first hundred grand (Woo!)\nTold my teacher in elementary I'm gon' be the man (I told ya!)\nTold my bitch that she could leave me if she don't understand (Woo!)\nThey say more money bring problems; give me the problems, then (Give me the problems!)\nIf you hatin' 'cause you ain't eatin', then I'm not a fan (I'm not a fan)\nIf the lick bigger than $50,000, I'm all in (I'm all in!)\nEyes open like I just snorted an 8-ball! (Woo!)\nChase the money like they just called for the \"last call!\" (Woo!)\nDon't say you rich if you ballin', but your dawgs starving (Woo)\nDon't say you hustlin' if you laid up and the money callin'! (I swear!)\n\n[Hook: Youngboy Never Broke Again]\nBaby, don't worry if I\nCome home late like 3 or 4\nWhen that check call, I gotta go\nBaby, I'm sorry\nThat check, it keep callin'!\nThat check call like brrr\nThat check call\nMy phone boom\nMy phone boom like brrr\nMy phone doin' numbers on 'em\nNumbers on 'em like brrr\nBaby, I'm sorry\nThat check, it be callin'!\n\n[Verse 2: Youngboy Never Broke Again]\nThat check call, I get up; gotta make it!\nFive in the mornin' I be chasin'\nWhen it come to money, I be racin', I'm impatient\nLike brrr\nBaby, it's a play, can't miss it, gotta take it!\nI be at it by the minute, it be coming by the daily\nI ain't got it, I go crazy!\nI got habits and three babies\nWe got lean by the cases, it take care of the tribulations\nFamily problems, gotta face it\nI go hard, can't let it break me (I won't let it break me)\nLiving wild, I pay dues\nIn that Lamb on cruise, hit the gas and it go zoom!\nPlay up on my cell, every day my phone boom!\nAin't got no time for my girl\nI'll make it up; I'm on the move!\n\n[Hook: Youngboy Never Broke Again]\nBaby, don't worry if I\nCome home late like 3 or 4\nWhen that check call, I gotta go\nBaby, I'm sorry\nThat check, it keep callin'!\nThat check call like brrr\nThat check call\nMy phone boom\nMy phone boom like brrr\nMy phone doin' numbers on 'em\nNumbers on 'em like brrr\nBaby, I'm sorry\nThat check, it be callin'!\n\n[Verse 3: Plies]\nI'm all All About the Benjamins, like Cube said\nAnd I ain't arguing with you niggas, I'm putting it on your head\nI'm on my Bone Crusher shit, I Ain't Neva Scared\nYou keep the accolades and the fame, I just want the bread!\nWant every day I wake up to feel like tax season\nI ain't never been a flagger, bitch, I'm really eatin'\nI told my mom she straight forever, bitch, I swear to God\nI'm ten toes down and I ain't movin', bitch, like Rosa Parks!\nAnd for that money, I swear to God, bitch, I'm a bloodhound\nAnd if it's out there, I'm going to get it, bitch, I'mma run it down\nI want a billion and some change, fuck a hundred mil\nAnd if that check go to call, then babe, I'm outta here!\n\n[Hook: Youngboy Never Broke Again]\nBaby, don't worry if I\nCome home late like 3 or 4\nWhen that check call, I gotta go\nBaby, I'm sorry\nThat check, it keep callin'!", "year": "2017-10-05"}]}