{"songs": [{"lyrics": "[Produced by: Statik Selektah]\n\n[Intro:]\nYeah, Bronson\n(Nina Sky)\nThis my mothafuckin' game man\nI don't give a fuck what nobody says no more\nNo more playing the sidelines (Yeah)\n\n[Verse 1:]\nAlbanian style: rock leathers in the sand\nI’ll shoot my cousin for nothing: dominant man\nGo visit fam with no problems - on some normal shit\nStraight from Skopje, Macedonia, the floral lit\nLicorice liquor, one cube, a touch of water\nWatch it mix, turn white like the Duchess' daughter\nI’m in the corner puffing Ganja with the musky odor\nDestination back of your throat - cup of soda\nUh. This is Bam Bam Bigelow, Queens to Asbury Park connect: Figaro\nMy uniform Carhartt sweats and Gore-tex athletic horses on my chest and on my short sets\nThe Leslie Nielsen of the weed and the words\nThis is Action Bronsolinni, 33 and the 3rd, kid\nNaked gun, the serial is scratched off\nArmed like Rocket in his prime, blast off\n\n[Hook: Nina Sky]\nOn and on, push it through, we won\nNever stop till the day we there\nOn and on, push it through, we won\nNever stop till the day we there\n\n[Verse: 2]\nPush your seat back. The Ricky Henderson of rap\nJets hat, underneath a little blubber lie the 6 pack\nSummer time I cop the musket with the kick back\nThen sit back, stand up, eyes low, hit that\nThis happens continuously throughout the night\nNow my eyes are like diamonds, that’s looking blue-ish in the light\nLike a prism, shooting out hope, honor, and optimism\nNever stop it till we're coastal on the aqua mission\nReach my hand in the water and grab a tuna\nSilhouette you see reflection of light, right off the Mezzaluna\nThat’s a half moon, wavy like my man’s fade\nThe European carry-all. Color: tan, suede\nHandmade, hand blades, carve up your features, I’m a creature\nSection 39 - I’m in the bleachers\nFiends get washed up like turtles on the beaches\nIt’s mating season make the verbal for your speakers\n\n[Hook: Nina Sky]\nOn and on, push it through, we won\nNever stop till the day we there\nOn and on, push it through, we won\nNever stop till the day we there\n\n[Verse: 3]\nIl prosciutto\nLegend, Phil Rizzuto\nMarijuana like the pussy, I keep it crudo\nThat’s raw, now I declare war\nYou in the women’s league\nI show you how a man score\nLook at my beard and my body like a grizzly\nI’m shoulder pressing 3 plates\nObama - EBT. I'm a G. Supermarket sweepstakes\nStill drinking vintage out the bottle with the cheese plate\nThe Derek Harper with the low Caesar, flow fever\nMore than likely digging in your ho's beaver\nDrug smoke to my neck just like a turkey\nDough dirty, make your brother do a curtsy. no mercy, Van Buren cop Hershey\nSquare Tyson and I’m in the mountains eating rare bison\nClam chowder, you ain't fucking with this man-power\nStraight from Queens, where we're known to make your plans sour\n\n[Hook: Nina Sky]\nOn and on, push it through, we won\nNever stop till the day we there\nOn and on, push it through, we won\nNever stop till the day we there", "title": "Cocoa Butter", "album": "Starving on Reality", "image": "https://images.genius.com/c1ede5df22693a914ce708ed308bbad9.316x316x1.jpg", "year": "2011-10-25"}], "artist": "Action Bronson"}