{"songs": [{"album": "All I Wanna Do", "image": "https://images.genius.com/0e18e80aa2c388e90929ae1abe72769b.600x600x1.jpg", "year": "2014-02-25", "title": "Go For It All", "lyrics": "[Bridge]\nI don't wanna be okay, I just need to hear you say\nWhen nothing really goes your way, tomorrow is a brand new day\nLet me help you ease your mind, I'mma make you realize\nThat tonight's your night\n\nUh\nI just want you to fly like a first class ticket on a mission through the sky\nNever listen to the lies, keep me racing to the moon\nI just be slighter than the whispers in the room\nAnd them critics just assume you will never get do\nAll the things you really love, such a pessimistic view\nWell let me tell you like mama told me\nEverything comes back, it's never always gon be\nSo mama never home, and papa never sober\nYou gotta keep climbin, the top is never closer\nThe truth is like a fight that'll take you to the white\nAnd tomorrow gets brighter is you make it through the night, right?\nYou got it, they can never take it\nThey just gonna hate it cus they could never make it\nBetter days are coming in this thing called life\nWhen rain go away a rainbow will say\nIt's alright\n\n[Hook x2]\nI don't wanna be okay, I just need to hear you say\nIt's alright\nWhen nothing really goes your way, tomorrow is a brand new day\nIt's alright\nLet me help you ease your mind, I'mma make you realize\nThat tonight's your night\nSo baby let's go for it all\n\nWhy? You can find a smile\nWe done made it to the sky, we ain't never comin down\nRemember all the nights you was wishin on a star\nI told you if you fight it'll get you from them all\nSee? You just gotta say\nAnd I will bring you blue skies I'll make all your fake friends go away\nAll they do is throw shade\nIt's time to get the sunshine back and watch all these gray clouds blow away\nOkay you got it, they could never stop it\nThey just gonna hate it cus they could never top it\nAnd even if you block it there's gotta be a way out\nIf our work pay off there's gotta be a pay out\nStay on start of bizzoc, stack your own brizzocks\nInto a building when you was feeling light\nGiving up you never did\nSo I just came to let you know that if you never hit\nIt's alright\n\n[Hook x2]\nI don't wanna be okay, I just need to hear you say\nIt's alright\nWhen nothing really goes your way, tomorrow is a brand new day\nIt's alright\nLet me help you ease your mind, I'mma make you realize\nThat tonight's your night\nSo baby let's go for it all\n\n[Bridge]\nKeep your eyes to the skies\nAnd baby, we'll go for it all\nDon't ask why, that's just right\nSo baby, let's go for it all\n\n[Hook x2]\nI don't wanna be okay, I just need to hear you say\nIt's alright\nWhen nothing really goes your way, tomorrow is a brand new day\nIt's alright\nLet me help you ease your mind, I'mma make you realize\nThat tonight's your night\nSo baby let's go for it all"}], "artist": "T. Mills"}