{"songs": [{"lyrics": "[Introduction: Eazy-E & unknown Dopefiend]\n[knocking on the door]\nYo man what you need?\nYo, uh, man I need something man, I need a twenty, man\nWhatchu got, man?\nEy, I got this rope chain, man\nMan, this shit look like a gold on the roll shit (What the fuck is that?)\n(It's a fuckin dud!)\nIt's real man\nThis shit ain't real\n(That nigga sellin' that shit again, man?!)\nGet the fuck outta here and come back with some money\nC'mon man, be cool man\nY'all Mexicans always comin' with this shit\n\n[Verse 1: Ice Cube]\nIt was once said by a man who couldn't quit\n\"Dopeman, please can I have another hit?\"\nThe dope man said, \"Clucka, I don't give a shit\nIf your girl kneel down and sucked my dick\"\nIt all happened and the guy tried to choke her\nNigga didn't care, she ain't nothing but a smoker\nThat's the way it goes, that's the name of the game\nYoung brother getting over by slanging 'caine\nGold around his neck in 14 k heaven\nBitches jocking on his dick 24-7\nPlus he's making money keeping the base heads waiting\nRollin' six four with the fresh ass daytons\nLiving in Compton, California CA\nHis uzi up yo ass if he don't get paid\nNigga begging for credit, he's knocking out teeth\nClocking much dollars on the 1st and 15th\nBig wad of money, nothing less than a twenty\nYo, you want a five-oh? The dope man's got plenty\nTo be a dope man, boy, you must qualify\nDon't get high off your own supply\nFrom a key to a g it's all about money\n10 piece for 10 base, pipe comes free\nAnd people out there are not hip to the fact\nIf you see somebody getting money for crack, he's the\n\n[Hook]\nDopeman, dopeman!\nHey man give me a hit\nDopeman, dopeman!\nYo man fuck that shit\nDopeman, dopeman!\nWe just can't quit\nDopeman, dopeman!\nWell, suck this bitch!\n\n[Interlude: Dr. Dre]\nWait a minute -- who the fuck are you talking to?\nDo you know who the fuck I am?\nMan, I can't believe this shit -- this bitch is trying to gank me\nI'll slap you up side your head with nine inches of limp dick!\n\n[Verse 2: Ice Cube]\nYou need a nigga with money so you get a dopeman\nJuice that fool for as much as you can\nShe likes his car and he gets with her\nGot a black eye cause the dopeman hit her\nLet that slide and you pay it no mind\nFind that he's slapping you all the time\nBut that's okay, cause he's so rich\nAnd you ain't nothing but a dopeman's bitch!\nDo what he say and you keep your mouth shut\nPopping that trash might get you fucked up\nYou'll sit and cry if the dope man strikes you\nHe don't give a fuck - he got two just like you\nThere's a another girl in the dopeman's life\nNot quite a bitch but far from a wife\nSh'es called the strawberry and everybody know\nStrawberry, strawberry is the neighborhood ho\nDo anything for a hit or two\nGive tha bitch a rock, she'll fuck the whole damn crew\nIt might be your wife and it might make you sick\nCome home and see her mouth on the dopeman's dick\nStrawberry just look and you'll see her\nBut don't fuck around or she'll give you gonorrhea\nAnd people out there are not hip to the fact\nThat Strawberry is a girl selling pussy for crack to the\n\n[Hook 2]\nDopeman, dopeman!\nHey man give me a hit\nDopeman, dopeman!\nHey yo man fuck that shit\nDopeman, dopeman!\nIn yo face\nYo Dre, kick in tha bass\n\n[Verse 3: Ice Cube]\nIf you smoke 'caine, you're a stupid motherfucker\nKnown around the hood as the schoolyard clucker\nDoing that crack with all the money you got\nOn your hands and knees searching for a piece of rock\nJonesing for a hit and you're looking for more\nDone stole a Alpine of out Eazy's 6-4\nYou need your ass whooped cause it's out of this earth\nCan't get a 10 piece need a dolla fifty's worth\nKnucklehead nigga, yeah, you turned into a crook\nBut swear up and down, boy, that you ain't hooked\nYou beat your friend up and you whooped his ass long\nCause he hit the pipe till the rock was all gone\nYou're robbing and stealing, bugging and illing\nWhile the dope man's dealing\nWhat is killing your pain, cocaine, this shit's insane\nYo, E, she's a berry, let's run a train\n\n[Eazy-E]\nMan, I wouldn't touch that bitch\n\n[Ice Cube]\nMe neither; Ho, go home and wash out your beaver\nAnd niggas out there messing up people's health\nYo, what the fuck yo gotta say for yourself?\n\n[Eazy-E]\nWell, I'm the dopeman - yeah, boy, wear corduroy\nMoney up to here but unemployed\nYou keep smoking that rock and my pocket's getting bigger\n\n[Dr. Dre]\nYo, got that five-0 - double up, nigga\n\n[Eazy-E]\nYeah, high rolling, big money I'm folding\nBitch on my tip for the dick I'm holding\nStrung strawberry jocking me so early\nHo, you want a hit you gotta get your knees dirty\nWell, that's my life that how it's cut\n\n[Girls]\nHey, dopeman!\n\n[Eazy-E]\nBitch, shut the fuck up\nGotta make a run, it's a big money deal\nGankers got the fake but you can get the real from the\n\n[Hook 3]\nDopeman, dopeman!\nYeah, that's me\nDopeman, dopeman!\nYo, can I get a \"g\"?\nDopeman, dopeman!\nClock as much as he can\nFuck this shit, who am I?\nTHE DOPEMAN!\n\n[Krazy D]\nYo, mister dopeman, you think you're slick\nYou sold crack to my sister and now she's sick\nBut if she happens to die because of your drug\nI'm putting in your culo a .38 slug!", "album": "N.W.A. and the Posse", "year": "1987-08-13", "title": "Dopeman", "image": "https://images.genius.com/d29364bc59827ecb4f436e6c53380aa6.502x500x1.jpg"}], "artist": "N.W.A"}