{"artist": "Canibus", "songs": [{"title": "4, 3, 2, 1 (Original Verse)", "album": null, "year": null, "image": "https://images.rapgenius.com/738f186f0a586b9c419d096cb421de87.600x600x1.jpg", "lyrics": "Method, where the gods at? Redman, where the squad at?\nYo L, is that a mic on your arm? Let me borrow that\nWho's the God of rap you saying is nice?\nI'll beat a dead nigga to death and beat a dead nigga to life\nIf you look at me long enough, I'll start to read your thoughts\nIf the signal was strong enough and then I'll call your bluff\nLet's see how many rhymes you got\nI can go on for more Millenias than Mazdas got in a car lot\nAnd there's nowhere to run to, when I confront ya\nNigga, I'll call your bluff like you had a phone number\nWho wanna see Canibus get wild?\nWho wanna act fly and get shot down with a surface-to-air missile?\nI take them in all shapes, sizes, and forms, spit on\nAny emcees who ain't close enough to shit on\nZero to 60? I'm already doing a hundred when I'm blunted\nAnd I give it to any nigga that want it\nYour head will spin so fast, you'll catch whiplash\nI practice lyrical witchcraft on your bitch ass\nMake your hard drive crash, the C colon backslash\nAnd I'll go back to the booth to school your whack ass\nBecause the object of the game is to spark every cell in your brain\nAt degrees hotter than blue flames\nPropane gasses, it incinerate you into ashes\nI got you breathin' harder than girls in Lamaze classes\nStop bitchin' about if it's written or freestyle\nGot the whole Spanish community saying I'm muy mal\nCharging niggas with booty styles $50 fines\nIn addition to $25 for whack punchlines\n’Cause I'm the top dog running the yard\nAnd I represent cause I never chained to the fence\nHence to battle me is impossible\nI'll put your whole crew in the hospital with IVs all in their nostrils\nStop sleeping on me, I ain't a mattress\nPut you through more drama than a soap opera actress\nDon't even think about pulling out and opening fire\nGunshots wound but I remove bullets with pliers\nI aspire to kick the fattest that you've ever witnessed\nFrom a far side, that's even confusing the fat lip\nRhymes designed from lines of pure knowledge\nI'll make your head nod 'til your neck runs out of cartilage\nI think it's obvious that I can bring the ruckus\nScream on your crew like a military drill instructor\nWhen I come through, niggas stand stiller than statues\nIf I have to, I'll battle your whole rap crew\nThen I'll attack you with words that's absurd\nAnd rip your fucking skin off just to get on your nerves"}]}