{"artist": "Wax", "songs": [{"year": "2013-10-31", "lyrics": "Verse 1:\nThey call me Big Wax aka Michael Jones\nThey say I make the type of music that you feel in your bones\nThey say something happens every time I rock microphones\nThat puts all the fly bitches in their comfort zones\nThey get moister and moister\nCircling the pearl like the world is your oyster\nAs I get more boisterous\nShe gets more and more poise to bust\nIntense Imagination really ain't no choice but us\n\n[Hook]\nIt goes: goodnight\nYeah, sleep tight\n\nVerse 2:\nYou can catch me out in Cali'\nLike your boy was a palm tree\nWe're in the vicinity of wherever your mom be\nProbably got her at my house doing my laundry\nBitch does a good job, it comes out so softly\nShe be folding my pants\nWhile she water my plants\nShe like to dance butt-naked in a three point stance\nShe's such a slutty undresser\nTell her to fuck she says \"Yes, sir\"\nBut her weight fluctuates like the Nutty Professor\n\n[Hook]\nI tell her goodnight\nYeah (Mrs. Klump), sleep tight\n\nVerse 3:\nI found my self out in Los Angeles\nY'all ain't ever found shit\nYou're just lost and jealous\nI ball some like Martha\nAnd y'all the Vandellas\nY'all be like \"let's do whatever the boss man tell us!\"\nI'm the baddest of the bad\nThe raddest of the rad\nI'm the worst nightmare that your dad has ever had\nCause your mom don't miss him\nShe low-key diss him\nCause he tastes my balls every time she kiss him\nSaying\n\n[Hook]\nGoodnight\nYeah, sleep tight\n\nVerse 4:\nI'm way above anybody in this musical genre\nI just blew on some ganja\nThen flew on Lufthansa\nMid-flight fuck the beautiful stewardess Sandra\nSo when I say a mile high\nThat's a quadruple entendre, count 'em\nI'm a barbarian\nYou a librarian\nI'm taking kids out like doctors do on cesareans\nYou're chances are very slim\nIf a rapper steps up I will bury him\nHe should watch where he swims the wrong aquarium\nThis is the shark tank\nGo back to the koi pond\nWhere the little baby guppy girls and boys bond\nYeah, I don't respond to them\nI just keep on talking about your mom again\nCause she be sucking my dick\nAnd licking my balls\nAnd she don't stop licking until she get an applause\nAnd when I'm about to bust a nut she sit up and pause\nThe bitch looking like the shark in the picture from Jaws\nShe Like..\nKnaw'mean?\nTurn it up loud like radio Raheem\nWanna do the right thing when It comes to your spouse?\nBetter tell that bitch stay in the house (house)\nI tell her\n\n[Hook]\nGoodnight\nYeah, sleep tight\n- And we out", "image": "https://s3.amazonaws.com/rapgenius/Big_Wax_in_Front_of_a_Fence.jpg", "album": null, "title": "Good Night"}]}