{"artist": "Valete", "songs": [{"title": "Revelação", "year": "2006-10-05", "lyrics": "[Intro]\nA minha mãe rezava todos os dias\nIa à missa todos os domingos\nMas nós sempre vivemos mal, sempre passámos fome\nDo pouco que tinha\nPartilhava até com pessoas que precisavam menos do que ela\nMorreu miserável e sem nada, parece que foi tudo em vão\nQue mal fez a minha mãe a Deus?\n\nToda a gente, CIVILIZAÇÃO!\nToda a gente tem de ouvir isto\nToda a gente, CIVILIZAÇÃO!\n\n[Verso 1]\nEsta é a palavra dos teus filhos que tu nunca amparaste\nAqueles que te amaram e tu abandonaste\nAqueles que te chamaram e que tu desprezaste\nAqueles que guerrilharam quando tu recuaste\nAqueles que acreditaram sem que tu te revelasses\nAqueles que mendigaram e tu não alimentaste\nAqueles que se esgotaram, tombaram, arrastaram-se\nDefinharam, imploraram-te e tu não levantaste\nQue mundo é esse que se alimenta da nossa amargura\nE que se sustenta o seu progresso com a nossa penúria\nSerá que não ouves as lágrimas afilhadas da sorte\nE os corações que batem resignados à espera da morte?\n\n[Verso 2: \"Deus\"]\nEu sou o vosso Deus, sou o vosso criador\nEu sou a vossa luz, pai, juiz, protector\nEu nunca vos abandono eu estou sempre por perto\nE através da fé, sentirão meu afecto\nBasta acreditar em mim e seguir os meus ensinamentos\nQue terão a salvação e acabará o tormento\nFraquejarás se duvidares da minha existência\nPorque a chave da libertação reside na crença\n\n[Refrão]\nMas onde é que estás?\nQuando o sofrimento nos aprisiona\nQuando até a esperança diz que já não vale a pena\nQuando todo esse Mal se apodera dos homens alastra-se\nE elimina, todo o Bem que nos abrigou\nOnde é que tu estás?\nQuando a fome abate mais um crente\nQuando a felicidade passa a utopia dos dementes\nQuando a escuridão invade o nosso espaço assume-se\nSoberana sobre o Sol que nos criou\n\n[Verso 3]\nEu vi-te nos versos que a beleza tornou poesia\nNa esperança que o sol trazia em cada novo dia\nNo cravo vermelho que resistia nas noites sombrias\nNo amor destes homens de bolsos e mãos vazias\nEu vi-te na espada que ensanguentou Lúcifer\nNo futuro que florescia no ventre duma mulher\nNa causa dos justos que a ambição não destruiu\nE no sorriso das crianças que a inocência pariu\nMas perdi-te intensidade desta dor permanente\nNo estrondo das balas que levaram gente inocente\nNa frieza dos tiranos que a democracia formou\nNa exploração dos fracos o mundo legitimou\n\n[Verso 4: \"Deus\"]\nEu não sou a única força transcendente deste universo\nO Diabo também existe, é o Senhor do Mundo Perverso\nÉ ele que divide e atrai os homens ao pecado\nTu tens que resistir o Diabo é obstinado\nEu dei-vos livre arbítrio, liberdade total\nCabe a cada um de vós decidir entre o Bem e o Mal\nÉ a falta de moral que traz desordem e desgraça\nSe viverem por mim o Mal deixará de ser ameaça\n\n[Refrão]\nMas onde é que estás?\nQuando o sofrimento nos aprisiona\nQuando até a esperança diz que já não vale a pena\nQuando todo esse Mal se apodera dos homens alastra-se\nE elimina, todo o Bem que nos abrigou\nOnde é que tu estás?\nQuando a fome abate mais um crente\nQuando a felicidade passa a utopia dos dementes\nQuando a escuridão invade o nosso espaço assume-se\nSoberana sobre o Sol que nos criou\n\n[Verso 5]\nEu não percebo a tua existência e o teu poder transcendente\nDo que vale saberes tudo se continuamos inconscientes\nDo que vale poderes tudo se nós vemos sofrimento\nDo que vale veres tudo se nunca te fazes presente\nQuando parece que te manifestas, escondes-te num\nÁpice\nComo te escondeste naquele nevoeiro que encobriu\nAuschwitz\nNaus partiram com escravos e tu ficaste à varanda\nCamuflaste a mancha de sangue que inundou o Ruanda\n\n[Verso 6: \"Deus\"]\nSeria tudo assim bem fácil a culpares-me de tudo\nMas são os homens a causa do descalabro do mundo\nEu não posso interferir, apenas assisto e analiso\nSó no julgamento final é que eu corrijo e decido\nLembra-te que a vida terrena é só uma passagem\nE depois da morte ainda terás uma portagem\nOs pecadores serão punidos e arderão no Inferno\nOs bons serão felizes no Paraíso eterno\n\n[Valete]\nNah... Não tem sentido...\nEntão porque é que não nascemos logo no Paraíso?\n\n[Verso 7: ''Diabo'']\nTu fazes muitas críticas, acusações e perguntas\nAgora vou abrir o jogo, só para ver se tu aguentas\nDeus só existe fantasiado na vossa mente\nEu sou Diabo, o único ser superior existente\nVocês são minha criação, feitos à minha semelhança\nPor isso é que o mundo é um palco de Malevolência\nQuando praticam o Bem é só um acto de desobediência\nVossos instintos naturais são o ódio e a ganância\nTerão sempre a ditadura, a escravatura, a opressão\nDescriminação, censura, repressão\nMinha função foi criar-vos para auto-destruírem-se\nPara fustigarem-se, invejarem-se, consumirem-se\nPara mergulharem na imperfeição, erro e pecado\nEnlamaçarem-se no Mal que eu tenho libertado\nVou assistir, desperto e alegre ao vosso caos inquieto\nAté este planeta se tornar na Terra-Mãe do inferno\n\n[Valete]\nDeus só existe fantasiado na vossa mente\n\n[Outro]\nSerá em vão rezares por um sonho que não verás\nE ambicionares por um Mundo que não terás\nNão esperes Justiça onde nunca houve Paz\nNão há salvação nas terras de Satanás (x2)", "album": "Serviço Público", "image": "https://images.genius.com/d3741ecc251896ab2b2ce66b00104389.800x800x1.jpg"}]}