{"artist": "Peewee Longway", "songs": [{"album": "State of The Art", "title": "Ice Cube", "image": "https://images.genius.com/2dadbf19c08c86264460984bb5009064.1000x1000x1.jpg", "lyrics": "[Intro]\nWhat you workin' with? That my facecard\nThat's your facecard\nCicero on the beat\nTie his motherfuckin' facecard\nWhat you workin' with?\n\n[Verse 1]\nWhat you workin' with? I'm workin' with my facecard\nBreak your damn wrist cookin' up that straight hard\nYeah, and I'm goin' straight hard, dumb with the K\nThen make bond on my face, 'cause I'm done with the case, beat it\nTwelve-fifty, twelve-fifty, two bands on my shoes\nShoot a fifty, shoot another fifty, 'til we make the news\nWent full petty in a minute, Asian bitch showed me her boobs\nWish for opps tellin' game, and they swipin' and start scammin'\nI'm on Xannies in the Lamby, might do the dash and go crash it\nI'm on perkies while I'm workin', I'm booted, got bad habits\nI put blues on the jeweler, got VV's on top of baguettes\nI'm the dapper don with that, I wear Dior, new Air Maxes\nFour-four-forty-eight, we fax 'em\nThousand we made out the plastic\nShe tokin' on dick like it's acid\nI pull up in coupe, Jurassic\nWings, pterodactyl\nI'm on a bean, pop a capsule\nRollie freeze, I'm Alaska\nServin' chicken platter like it's pasta\nI want every dollar like Little Rascal\nMy daddy dead and I'm a bastard\nI got a buck fifty, cut you like a Bronx nigga\nReal swamp nigga, pump gon' make you jump, nigga\nBoom, baow, two-step, DJ Unk, nigga, huh?\n\n[Chorus]\nYeah, in my black tee I still trump niggas\nI hit licks in my black tee, I'm still a gold-digger\nTake your chain and your Rollie, come up out your shoes, nigga\nGrabbed my chain and my Rollie 'fore I went to school, nigga\nI'm a walkin' ice maker, I wear nothin' but cubes\nAll my diamonds bling blaow, look like molly cubes\nAin't no tuckin' in my chain, I feel like Ice Cube\nGot that 'stendo with my forty, I might make the news\n\n[Verse 2]\nNeighborhood crippin', all my homies got the blues\nLockin' Enz' in the pen, chain gang rule\nHe just got ten with a ten, everybody food\nI popped a bean once again to match my attitude\nI put them Forgis on that bitch to match my gratitude\nI put a lift kit on my raps to lift my longitude\nI bang a left, I bang a right, get out my latitude\nMargiela steppin' on the radical, I serve you rabbit food\nI watch my plays like Mark Cuban, got my eyes on every move\nI just flooded two new Cubans just to make they eyes move\nI'm a walking brick of dog food, with them bill jacks\nWay I cut the brick in half, call my Longway lumberjack\n\n[Chorus]\nYeah, in my black tee I still trump niggas\nI hit licks in my black tee, I'm still a gold-digger\nTake your chain and your Rollie, come up out your shoes, nigga\nGrabbed my chain and my Rollie 'fore I went to school, nigga\nI'm a walkin' ice licker, I wear nothin' but cubes\nAll my diamonds bling blaow, look like molly cubes\nAin't no tuckin' in my chain, I feel like Ice Cube\nGot that 'stendo with my forty, I might make the news", "year": "2018-11-30"}]}