{"songs": [{"image": "https://images.genius.com/8e2457547e1e2e89c1925e4959baf2c5.800x800x1.jpg", "album": null, "title": "JKYL+HYD", "lyrics": "[Intro: Sharon den Adel]\nSee the mirror in your eyes\nSee the truth behind your lies\nYour lies are haunting me\n\n[Verse 1: Dave]\nThis is a tale of two men, this is Jekyll and Hyde\nHave you ever had a war with your mind? Its like I'm two men\nTryna' juggle college and money but this is useless\nCause either way one of them suffers because of music\nTelling Jussy on the phone, bailiffs climbing windows\nTryna' run up in my home and take everything I own\nThem girls will never know, the choices that I made\nAll the nights that I pray got aired to the road that I chose\nBruv, I'm local to home, making phones calls for dough\nI implode or I blow?\nBut you couldn't buy my attention, its either there or no\nYou ever spoken to the devil? You'll lose the fear in God\nHe doesn't come round here, it's crazy right?\nHow a judge can give a life and take a life\nI nearly died that night, it's crazy right?\nThat's why you don't get involved when they play with knives\n\nNah, but let me tell you about my life,  I came from a family of 5\nIf I try to tell my story 'swear down you would cry\nBut all you need to know is I've lost every single man inside my life\nAnd so I lost my way\nIt's like who do you follow when your time feels borrowed\nAnd your idols gone astray? My words carry weight\nIt's like who do you follow when your time feels borrowed\nAnd your idol's gone astray? And so I put my heart in my friends\nStarted writing bars, I was trying to be the hardest on endz'\nAnd then we split half of the endz'\nA few altercations in a week, we lost half of our friends\nWe was selling draws, and then-a little more\nAnd back then all the girls in the school were busy giving corn\nI never had a fresh trim, I had braces\nThis is for the brudda's in life that weren't rated\nStarted thinking way beyond my age when I hit 17\nI had a smile of a child but a mind like I'm 23\nI mean 35, I lived a dirty life\nAround a bunch of man I didn't feel like Shirley's guy\nAnd now these clowns couldn't sit with me\nLiterally, I stand on my own like Sicily\nI've never been known for wifing hoes and twitter beef\nI'm  tryna' turn green and white to red like Italy\n\nI don't need to chat shit my family is active\nMadness, I've seen death like sign language\nAnd life's so precious, I don't want wanna die so young\nReal talk I don't like this pressure\nMan are still beefing over endz\nWe don't own this land and we don't even like this weather\nMan are still beefing over money and you're all broke\nOutside your endz there's a life that better\nOutside your endz there's a life that real\nWith a job and a wife, that's real\n3 baby mums and a whip, that's fake\nLeaving your kids that's fake, man you kids so lame\nI shouldn't need to say what's real\nThis is common sense for the man who got their head set straight\nI have to state the obvious, youth's move proper sick\nTrust me these bars are for them mans sake\nSo listen, now it's like Dave man you have to blow\nCause I've seen pain like Nagato\nYeah you know my picture, you ain't never spent a day inside my camera roll\nThinking about my image, younger donnie's listen\nAnd this message that I'm giving is so easily miss written\nI wanna say, leave the beef alone and chase the figures\nMan, I wanna say, leave the beef alone and chase the figures\nBut it's never been that simple\nWhen you get em hold the dippers\nI'm leading by example, all them little nigga's on that trap wave\nJump of it's not gonna run\nI don't care about how many doors you got on your car\nNo one cares about how much corn you got on your gun\nMan they wanna hear your story, this trap thing bores me\nAnd word to Jamal my time soon comes shortly\nIf your my right hand then my beef is your beef\nMy vid' is your vid'- the scene can't ignore me\nCause when I turned  14, I wasn't cutting cake in a party for my B-day\nI was online hitting sales like E-Bay\nSee music is a change, still chasing snitches\nLike why you lying to the jakes?\nGet nicked, get a deal, then set fire to the rain\nPassa is never worth it, trust me man knows\nThem youths look raggo, them boy there  plateaued\nDied in battle, I still wonder why we had burners from young\nLike Alexandre Pato\nThey're beefing with these low lives, for them cold nights\nI'm tryna' make music my whole life\nI can't do it on my own fam I won't lie\nSo if you're on your own grind and you don't know a bag of man\nYou can be my Santan Danielle or my Halli Tam\nIf you're on your own grind and you don't know a bag of man\nYou can be my Santan D--\n\n[Outro: Dave]\nThis is Jekyll and Hyde\nHave you ever had a war with your mind? Its like I'm two men\nThis is a tale of two men this is Jekyll and Hyde\nHave you ever had a war with your mind? Its like I'm two men\n169\nYou feel me?", "year": "2016-01-06"}], "artist": "Dave"}