{"songs": [{"lyrics": "* Originally Performed on N.W.A's concert at Anahiem, California 1988\n\n[Opening Skit: MC Ren Speaking through 3\" Glass and the 2 ways Phone]\n[MC Ren] Yo, what's up nigga?\n[Train]  What's up G?\n[MC Ren] Yo man, I'm in this motherfuckin' kick it, tired of all this shit, man\nI was lookin' for some bitches, nigga has gone to jail, you know what I'm sayin?\n[Train]  Yeah man, just tell me what's up?\n[MC Ren] Cause nigga I ain't.. I ain't with no bitch, no ride\nYou know what I'm sayin?\nNiggas said come on Ren, uhh, just let's go try to get some whores\nAnd this kind of shit, I'm like; Alight, let's go\nProbably, tried to talk to these bitches\nThese motherfucking Police bitches, you know what I'm sayin?\n[Train]  Y'all shouldn't have been fuckin' up down there, no way man\n[MC Ren] I gotta get.. I told the motherfuckers not even to go around that way\nNot down that street, you know what I'm sayin?\nI told niggas to go down here, down here in Corson and Compton\nThese niggas wanna go way up in Hollywood\n\n(*Beats started*)\n\n[MC Ren]  When we're on the stage, we're in a motherfuckin' rage, so Dre\n[Dr. Dre] What up?\n[MC Ren]  Why don't you get the 12 guage?\n[Dr. Dre] Aww, yeah\n\n[MC Ren]\nAnd show them how Eazy-Duz-It\nSo if you punks wanna lay somethin' of it\nStep up, run up, get up, what's up sucker?\nYou want some of this?\nThen you're a stupid motherfucker\nKickin, like the kick from a kickdrum\nYella boy on the drum gettin' dumb\nProgrammin, a beat that's hittin' \"that's what?\"\nAnd if you listen then you'll know we're not bullshittin'\nDope, like a pound or a Key, yeah\nSo shut the fuck up and listen to me\nI make the killin'\nI got fatter shit to the ceilin, why's that?\nCause I'm the mothafuckin' Ruthless Villain\nMC Ren, stompin' any fool in my way\nWith some help from my homeboy Dre\n\n[Dr. Dre]\nWell, check this out\nNow my name is Dre, uha, the mothafuckin' doctor\nYo, rippin' shit up, awww yeah, and here to rock you\nWith some help from my homeboy E\nThe criminal of the Ruthless Posse\nCold funkin' it up \"word up\" is what we do\nThe reputation of the N.W.A. crew\nGettin' busy, because we're cold stompin'\nAnd we're born and raised\nAnd we're born and raised\nAnd we're born and raised in Compton\nNow, all the ladies, all the ladies\nAll the ladies if you're good to go\nCome on, say Aaooowww                  \"Aaooowww\"\n\n[Break]\n[Dr. Dre] Ayyio Ren, won't tell them what the fuck you are, home boy\n[MC Ren]  Ruthless Villain superstar\n[Dr. Dre] Yo, I don't think they heard you, won't tell them what you are\n\n[MC Ren]\nI'm a Ruthless gangster, definition Villain\nLeave your shit unlocked and he's stealin'\nSo call the police cause that's all you could do \"but what?\"\nHe'll get away without leavin' a clue  \"yeah\"\nKeepin' shit in control like the neighboorhood chief\nBut, referred to as a walkin' thief\nThey say he's a bad influence for the kids, home boy\n\n[Dr. Dre] Why the fuck they're blamin' him?\n[MC Ren]  Cause he's the one that they jock\n[Dr. Dre] Cause he's the... (*explosion*)", "album": "N.W.A. Greatest Hits", "year": null, "title": "Compton’s N the House (Live Mix)", "image": "https://images.genius.com/9d0ba3a690d9816750a7d66f86166147.500x500x1.jpg"}], "artist": "N.W.A"}