{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/d0d3d451c2f1b26cf3b4746339f7b173.700x700x1.jpg", "title": "​m0rgan stop =͟͟͞͞ʕ•̫͡•ʔ =͟͟͞͞ʕ•̫͡•ʔ =͟͟͞͞ʕ•̫͡•ʔ =͟͟͞͞ʕ•̫͡•ʔ =͟͟͞͞ʕ•̫͡•ʔ", "year": "2014-05-13", "album": "impatiens", "lyrics": "Baby Is the door closed? are you keeping focus, are you moses, are you why i’m inside\nOf this swarm of locusts? and if so can you walk on the Red Seas\nAnd see into the dark and make it light again (please please please)\nPrince of Egypt, prince of Persia, Prince of Paris\nYou’re the prince of champagne and sunning on the terrace\nYou’re the prince of bubble bath, the crush i have is terrifying\nSuffer, but i bear it. i know love will tear us apart again\n\nLove love love love _______\n\nYou are nailing me to the wall, you shackle me like a slave\nI’m failing, i feel you fall off the back of me like a wave\nA factory made Impala roll fast on the interstate\nI’m mad that you say you’ll call, but you bastard, you made me wait\nLike a mastiff, you’re the hydrant\nRaise my mast with your flag on it like a pirate\nI’m a good girl with a Master's in wasting time, and i’m the pearl being cast among all the swine\nThe sky turned light blue while we were inside and i don’t mind\n\nYou say to spend the night, too late cuz the sky’s already light blue (x2)\n\nBlah blah blah blah, you’re always fighting with me\nRah rah Ra, sun god, i need your vitamin D, i need your chemical x\nSo i can smile at whatever little mess i’m in next (x2)\n\nBecause i think the sky turned light blue while we were inside and i don’t mind\nYou say to spend the night, too late cuz the sky’s already light blue (x2)\n\nBlah blah blah blah, you’re always fighting with me\nRah rah Ra, sun god, i need your vitamin D, i need your chemical x\nSo i can smile at whatever little mess i’m in next (x2)"}]}