{"songs": [{"title": "Ballin’ Like a Piston 3", "album": null, "year": null, "image": "https://images.genius.com/816cd52786b2727068f20c7150ab6b30.500x500x1.jpg", "lyrics": "[Intro: Lil Yachty]\nI gotta tell ya Chad, feel good to be back in this bitch\nMy nigga C.J. in this bitch with me\n\n[Verse 1: Lil Yachty]\nI make you niggas uncomfortable, I can tell that y'all truly not feelin' me\n12 just kicked in my back door, but my brother already stashed in the ceiling, b\nThis isn't the first or the second, my nigga this shit right here, this is the trilogy\nShe off the molly, so she into me\nWithout the molly, trust me, she still into me\nFeelin like Drake with the enemies\nLeveled up, I got the energy\nYou the Castro of catastrophe\nI'm in the sky like astronomy, trust me I know y'all not finding me\nThat pussy is wet like a pond to me\nMy D.J. is Deano from 6 OD and he spin it back that's the recipe\nGot an extra key for locked doors\nWhere the bad whores get fucked good\n9/10 my niggas ain't gonna smoke with you if it ain't no Backwoods\nI ran it up like I said I would\nI fucked that bitch on the cardboard\nAll of my niggas from wish-you-woods\nThey totin' clips like a hard drive\n\n[Hook: Lil Yachty]\nMoney's lookin' good, but now I'm really really ballin'\nI was up before but now I'm really really ballin'\nBallin' like a Piston, bitch I'm ballin' like a Piston\n\n[Verse 2: Lil Yachty]\nBallin' like the Piston's owner\nWhy you acting like a loner?\nNiggas swear they be \"skrr skrr\" but when they hop in my whip, they be scared\nNone of my fights have been fair\nEither got jumped\nOr I jumped on a player\nTook one L in my life but I promise, it won't happen no more\nGot the choppa sittin' on the floor\nImma bust in at a nigga nose\nI got way too, way too many hoes, chain on my neck, yeah, this shit real gold\nI need to start doing more shows\nI need to start buying more clothes\nI already got a lot of clothes\nBut nigga I want more clothes\nThis shit here is flex music (huh)\nNigga gon' and flex to it (huh)\nDouble cup drinkin' fluids\nFlyest shit, nigga you knew it\nNut on her face just like cool whip\nDive in that pussy like pool dip\nAlot of these bitches say Yachty is igorant\nBut I can not change cause that shit is foolish\n(Ahhh!)"}], "artist": "Lil Yachty"}