{"songs": [{"year": "2014-09-16", "image": "https://images.genius.com/c55205c8cf58b001357f72c8ec8b00fc.500x500x1.jpg", "title": "Drinkers Club", "album": "See Me On Top IV", "lyrics": "[Hook: Big K.R.I.T.]\nWelcome to the drinkers' club (x3)\n(Roll it down, roll it round, pour it up, where yo' cup?)\nWelcome to the drinkers' club (x3)\n(Roll it down, roll it round, pour it up, where yo' cup?)\n\n[Verse 1: Big K.R.I.T.]\nBrown bottles in my system, hoes all at my door\nHeard it was going down, and they just wanna go\nDirty all in my grill, Three 6 got this bitch rockin'\nSwear I was still in college, look like a hotel lobby\nHo, get on the floor, throwed as fuck and it shows\nOn another level, let the smoke settle, ho\nWe runnin' out so get mo'\nI got a empty cup, I might fill it up wit' yo' bitch pussy if she go\nI ain't even trippin' if the room spinnin' long as I could ride it out slow\nTwerk team for me, pro, camera phone is yo' lights\nTake this here to yo' dome, you don't need no ice\nEyes red and they tight, two in the morn', we just started\nHangin' onto my chandelier screamin' she just wanna party, bih!\n\n[Hook]\n\n[Verse 2: Juicy J]\nHomie, where's yo' cup? Purple in my slush\nKeep sippin', no quittin', ain't no such thing as too much\nJuicy ain't no lame, I got yo' dame in my truck\nAnd shawty ain't got no shame in her game, she a slut\nI'm in yo' city for one night only\nSame old shit, she wanna ride like a pony\nCome here, pretty bitch, rock my mic\nYou just might get you a signing bonus\nDiamond studded, the fine hoes love it\nLook yo' chick in the eye, she blushin'\nPull yo' chick to the side, we fuckin'\nWalk yo' chick outside, she suckin'\nAnd she gon' blame it on the molly\nYou could take her back, she sorry\nThe way I killed that pussy, I swear my dick be catchin' bodies\nI turn her face to a target, she blow me like a cartridge\nI got game like an old Atari - poof - I'm gone in my Ferrari\n\n[Hook]\n\n[Verse 3: Rittz]\nShit, I'm drunk in love or gettin' drunk or buzzed\nSo wanna come get drunk wit' us?\nIt's like my heart [?]\nTake a Xannie bar and crush it up\nAnd twist the cap on a Jack in a jug and chug\nI'm drinkin' straight a bottle, fuck a shot glass\nBumpin' OutKast, bout a half or too many, gotta fall back\nThat Bulleit Bourbon got me feelin' bulletproof\nWakin' up in [?] like \"Where the hell is the dog at?\"\nSo fuck Tylenol, I take another shot of Fireball\nAnd bounce back in no time at all\nThe same night, I'm met my homies wit' some bitches\nGettin' drunk and it's too late for me to drive 'em home\nI got that B plan but I usually got the slow cruise on\nBut tonight I got these hoes threwed on\nMy homeboy's futon, I'm bout to fuck somethin'\nWhere ya cup, woman? Drink, ho, I know you wan'\nUp in this drinkers' club\n\n[Verse 4: A$AP Ferg]\nWelcome to the drinkers' club, I'm sippin'\nLookin' for some cootie cat to slip in\nMagic City, booty clappin', strippin'\nIn the club, I'm slippin' off this Henny\nI see potential in that cutie right there\nJust imagine Paula Patton, fatter ass and\nBaby oil on her back and\nDrippin' down that thong and crack and all her man\nWonder in the world can she do on the gas\nAnd tell ya this and tell ya that\nTell ya how she get screwed and just strip for cash\nI don't wanna hear that shit no more\nCause I'm drunk as fuck and my vision gone\nThey mixed my Henny up wit' Patron\n\n[Hook]"}], "artist": "Big K.R.I.T."}