{"artist": "Pharoahe Monch", "songs": [{"album": null, "title": "Jungle Freestyle (Tim Westwood)", "image": "https://images.rapgenius.com/092482af558da1e092b743e31d9a2a7f.695x250x1.jpg", "lyrics": "[Talib Kweli] What up Pharoahe?\n[Pharoahe Monch] -What up Talib? What's the deal, what we doin'? UK style-\n[Talib Kweli] I heard you got some rhymes...\n[Pharoahe Monch] -Yeah yeah, check me out now, Pharoahe Monch, Queens representin' one time, Brooklyn in da house\n[Talib Kweli] That's how we do it, how we do it, how we do it... (like music~)\n\n[Verse 1: Pharoahe]\nYou see them gorillas over there in the park? -They my niggas, after dark we spark up and pull triggers\nYou gotta talk Urang Utan slang and pull capers, the cops are the cheetahz in the trees or the sky scrapers\nSpeakin' of jungle we often rumble for loot, some of us just stumble around, Hi to boo - Pfsshoo\nYou'll get shot, shit, play humble like last year when a white man tried to capture my uncle\nWhen you come through you can get bumped too if you don't got at least four-five gorillas amongst you\nThe bigotry here will shock and amaze, .41 shot is hot, about and ablaze\nIf not, they ship your ass to the Bronx in a cage, and to the Island when you spend your time countin' the days\nBut still acting vulture-ly, this kinda ill, we blow mills, they make a killin' and build new landz in the jungle\n\n[Verse 2: Talib]\nYo, one time in tha place to be, the illest niggas you'll hear on the BBC\nA lot of cats like to get on the microphone and front, steady rollin' the paper like they ran outta blunts\nTell you how much they sound scared of the month\nThe man tells you to jump, you threw it - we'll never let the man take advantage of us\nYou get props off the diamonds you rented, I get my props for the rhymes I invented, cause I spoke my mind and I meant it\nLike Tae Bo with a bowtie, kick yo' ass with class, and I still take it to Brooklyn when I'm ready to splash\nMe and Hi-Tek got shit ready to blast, I'm never ready to last, I stay hungry like I'm ready to fast\nMarried to the movement like a Betty (Shabazz?)\nA rhyme veteran, you actin' a real bitch right now, like a... lesbian thesbian\nSo let me in the pack, I've been dropping jewels, plugged in like pasta noodles, and stayin' fresh and clean like hospitals\nIn the world of Chris Poppins, big wallet to wrist watchin'\nYou ever think your wrist watch is watching you? -That's why the cops is stoppin' you?\nNigga please, they can track you anywhere, through cell phones transmitting radiation through your ear\nA two way is way too new and obsolete next year, navigational system shows you how to get there\nIf you ain't thinkin' 'bout how you got here then do you know where you are?\nWhat happened today, well back in the day they used to follow the stars\nI distilled it so much you need to catch it in bottles and jars and make emcees eat their words and swollow their bars\nOh my god...\n\n[Verse 3: Last Emperor]\nYeah yeah y'all, Last Emp y'all, check it out y'all, bust it-\nYo, Last Emp is in da house, now don't y'all go trippin'\nI break rappers up like Tom Cruise - Nicole Kidman, hijack a Concorde jet full of gold shipments\nAnimalistic rapper that is known for throat rippin'\nA lot of people know me as the Great Pretender, a college graduate and a gang member\nBut ever since then I been tryin' to convince y'all that I'm just a robot that was built by Prince Paul\nYou know you heard the voice before somewhere, and when I said I was the Emp, you said \"Oh, yeah!\"\n\"That brother who dissed the CIA with Kris, so he's nice!\"\nOw yeah, y'all know what time it is\nWhat it is? I got a style that's mentally powerdriven, a symbol of these interesting times that we live in\nNow listen close, as the best explanation is given, while parents enjoyin' them lyrics I be kickin' to the children:\nI'm raw hardcore but easy on the violence, the perfect combination of sorcery and science\nUh, you know another rapper, tell him not to try it, and look at me as this 21st century tyrant\nWho controls the mic like helicopter pilot, a man on small knees with the power to drop a giant\nWith fans of all ages; \"Children, run out to buy it! Batteries not included, some assembly required\"\n\nLike that y'all, it's like that y'all\nAyo, Westwood drop it, and keep it animated just like Wallace and Grommit\nLike that y'all, it's like that y'all, it's like that-at-at-that, ayo we can't fall, Rawkus y'all\n\n\n\n[2nd Take]\n\n(Last Emp and Pharoahe can't stop laughing)\n\n[Talib Kweli] Okay, here we go, I need the headphones man...\nWhat up Pharoahe?\n[Pharoahe] -You got it Talib, do your thing\n[Talib Kweli] Alright... Yo-yo-yo-yo-yo, I needa come up wit' some new rhymes, aight let's do this one... (laughs)\n\n[Verse 4: Talib Kweli]\nI don't know what to say so I'mma freestyle, I let my cats get busy in the meanwhile\nI got my man Chaps, he represent the Shark Body, we come to Jam In The Park and we rock the whole party\nI got my girl singing background\nYo, if you got my album you gotta put it back down on the turntable\nAyo, I burn... stable nigga, ayo I come through, you just like fable niggas\n(Aesop?), Ayo peep the way that I rock, I come through like Long Island on a (???)\nAyo I come though like Long Island with the (???), ayo you know how I do it when I drop\nLike a bomb, like Flexican Westwood, y' know it's all good, we all from the hood\nLike we do it, yo I ain't... checkin' for you nerds, yo I'm dark like cigar reserve\nYo the way I drop my bars, all the cars don't swerve\nGoin' the wrong way, I go... long way... from the express way... My way...\nI'm just buggin', y'all like my cousin or my fam\nGive me a slap on the black hand side, come through yo, hop back in the ride\nTake it back to Brooklyn, the Melting Pot was cookin', you could tell it was hot when they overcrowded Central Booking\nEverytime you lookin', cats took it for they jewelery, African-Asian-Jewish communities\nYo, lyrics so deep that it reads like a eulogy, yo you die - don't ever get confusing me\nAyo, this is how we do it, ancient like (Truarts?) when we flowin' like fluid\nYo, we rockin' over the beat as Erick's on the music\nYo, we come through, it's the truest, yo we on...\nYo... I'm just buggin', yo I said that three times but I got three rhymes, it's like I got three minds the way I come with ill lines\nAyo, my man Pharoahe is one of a kind\nLast Emp, he from Philly in the 2-1-5\nI'm from the 7-18, and I keeps it live\nOn radio 1, I only just begun like Jimmy Castor, catch me in The Village chillin' on Astor, yo, it goes like Casper, after the rhyme...", "year": "2001-01-01"}]}