{"songs": [{"album": null, "year": "2009-07-28", "title": "DJ Enuff Freestyle", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1: J. Cole]\nFast lane, looking bad thang with them brains\nFrom the passenger side of the ride while I drive\nAnd I swerve, vision blurred, make it hard to observe\nBlame the liquor I absorb and plus I’m high as God\nWhy is it Lord that I can’t seem to slow the whip down?\nThe same boy standing up when them teachers told him sit down\nLook now, I done growed up and still don’t follow rules\nCarter blues, nigga hold up, y’all still don’t got a clue\nYeah, all the cool niggas from high school that still ain’t doing shit\n‘Member when y’all used to fuck niggas till they blue and shit?\nNow your ass broke as a joke and them niggas doing it\nFunny how the tables turned and life, nigga, you ruined it\nThree kids that never see they daddy ‘less he need a dollar from his baby mama\nAnd y’all still don’t wear a condom, is you stupid nigga?\nFalling in love with these hoes, is you Cupid nigga?\nYou better learn ‘fore you burn boy, see me stay on top of my game, David Stern boy\nDid this dirt like worms, now my mom was more concerned with the future\nY’all niggas stuck in neutral, this a city where police tryna shoot ya\nThe army tryna recruit ya, I’m here to get ya higher baby so this here the booster\nI’m tryna be the king, this that Martin Luther\nShit is crucial, now let me introduce ya to the real\nFrom the ‘Ville, still pourin' liquor ‘fore my niggas killed\n\n[Verse 2: XV]\nLook, it’s too bad that he’s too good\nNever giving up but it’s sad that you would\nMy crew like a couple of clansmen, too hood\nAnd when it came to putting on Kansas, who would?\nVizzy, no trying, couple figures on and I’m sitting on Bryants\nGame started buzzing so I’m sitting on hydrants\nNah Joe, I’m highjack, you can call me a Somali pirate\nAll black wallet, inside Irish, mean it’s all green\nYeah, I’m mean with this fly shit, they buzzing like bees in a high nest\nGirls getting on they knees for your highness\nAnd I’m running these streets, no bright vest\nStick to the paper, damn, I’m a fly catch\nI’m tryna live more, die less and if you tryna get yours, holla X, XV\nYou should OD off of this rhyme ‘cause I’mma change minds like cold feet\nIn store for a meal, groceries but they be like “We don’t normally come out at night mostly”\nGo and get your rosaries ‘cause I’m about kill this, no halo like Sony\nAnd if your girl a little horse like a pony, ahem, well of course, start pointing\nFly Boy Club, well of course I’m soaring, always gonna\nAlways be in the air like Jordan\nAnd they always gonna stare, just ignore ‘em\nNow you with the X man, I’mma call you Storm\nI’m touring her, under that hood and um it’s foreign up under that hood and um\nI feel like a dude this cool should feel so I guess I feel good and um XV, J.Cole, we in\n\n[Verse 3: J.Cole]\nBusting, I'm going off, sting like a bee, float like it's Noah's ark\nYou know it's hard, flow is sharp like I'm blowing darts\nNiggas bear with me, these hoes out here looking like some spare kidneys\nThey give it up, how gracious, ass outrageous\nUp in the club, you could spot her, a Dalmatian\nSaid she found God but to me, she found Satan\nShe only getting hotter, what's good with the Ramada Inn?\nGot a game tighter than them jeans her ass hiding in\nI got that D baby, ain't talking vitamins\nShe said “That's cool nigga but can you buy the Benz?”\nShe playing niggas like a violin, I hit that ass just a little more violent\nShe hitting notes, then I'm ghost like it's Shaolin\nI'm on the prowl maybe soon I'll throw the towel in\nUntil that day’s found, this is my playground\n\n[Verse 4: XV]\nLook, I’mma spit it from the top of the dome, don’t normally do this\nBut I’m feeling real cool, I am ruthless, like Eazy-E was, I am toothless\nLike that one fiend was, I am killing shit like I never do this\nI never do this but I’m gonna spit it straight from the top oh\nAnd I know niggas done heard about Kansas but I’m about to do this motherfucker\nI done ran shit since ‘02 and I was like oh and y’all niggas don’t know\nI’m about to prove man what everything that I’m doing is about to do a movement\nX to the V, who you booing? Look, I don’t even do this normally but I’mma do this\nAccordingly, cordially, I am dope, yes dude\nI have never wrote this shit down in my head\nI have spoke shit you that never ever said\n‘Cause I’m dope, y’all niggas dead, fresh, chill nigga, I am gonna get this\nX to the V, y’all niggas witness, I’m about to throw ‘em back, ruler this\nY’all niggas doing this, y’all niggas know that I’m moving shit\nAnd if you don’t know it right now, google it, I’m about to be on every blog\nDoing shit, I’m about to do this shit like E told me do, look, look, I don’t know\n\n[Verse 5: J.Cole]\nWhat do I gotta do to prove to you I’m not the dude for you to just try to fool with?\nNiggas ain’t got a clue bitch, niggas wanna bullshit\nDon’t know that my crew thicker than these cute bitches, we normally knocking boots with\nToo slick to grip, my nigga should stop that\nThat verse was so old that I done forgot that\nBut now I come off the top with the hot raps\nNiggas know you better stop that\nComing through, got the Glock cocked back\nNigga I ain’t even got one\nNigga, I’m aiming at your face with the shotgun\nLyrically, spiritually\nNiggas tryna mirror me but I’m vampire and I’m so damn higher than the average nigga\nCan you get witcha ya? I just signed with Jigga, nigga how high you figure?\nDamn, I’m slipping up on my words but my verbs so sick that I never slip\nNiggas know uh-uh, please save me XV\n\n[Verse 6: XV]\nThey be like Vizzy on some other shit, on his MCDs ‘cause they loving it\nPockets fat like the Klumps in it, my flow is something sick, no asking\nProactive couldn’t stop bumping it, nowadays I be on some other shit\nLadies think I’m gone kinda like my upper lip, wrong\nLike a broken condom, pause, ‘cause Hoff go raw\nIt’s something you really shouldn’t be fucking with\nCame through whipping, paint still dripping\nThey say like Sheneneh, oh no you didn’t\nKnow that one saying when your palm start itching?\nWell mine do some much, I had to start to wear mittens\nAnd you think that I’m kidding, if I don’t slow down\nThey gon’ think that I’m driven, if I don’t go down, she gon’ think I hate fishing\nChill for a minute and I was like listen, Vizzy, gettin’, gettin’, gettin’\nY’all motherfuckers know I’m about to spit it straight up off the top of the dome again\nHow this nigga doing that? He be going in, I don’t even know shit\nI be just blowing shit, I don’t even smoke and shit, how you know this?\nBy enrolling it, I don’t even know I got a backpack on\nIf you see me, take a flick of me and you niggas gonna blow the shit\n‘Cause you were pointing at me like he gonna blow and shit\nAnd them niggas be knowing it, if I be doing this shit all around the world and shit\nAll around the globe with it, man y’all niggas spit it in, I just get it in\nFlow out here and manager from Switzerland, nigga from Kansas\nAnd y’all niggas whipping it, how you motherfuckers doing it?"}], "artist": "J. Cole"}