{"songs": [{"lyrics": "[Intro]\nDo me a favor, with that, light the candle\nIs that the Hawaiian Rayman?\nAight I get the same one every single time, I don't understand this\n\n[Verse 1]\nAt the piano with a glass of pino\nAll red silk like I'm nino\nCustom made shit, I weight 140 kilos\nSneeze on 100G's, hoes on their knees blow from Montego\nThe way my hair look you swear my name was Rodrigo\nLay low, if you can't do it then just say no\nIf you ain't built to play this game then you get halo'd\nI put a lot of fiends in k-holes\n\n[Skit 1]\nHello\nHi\nWhat's up mama?\nI just watched  perform\nHow do you feel about it?\nThey ain't you baby hahaha, you're better than all these shit heads\n\n[Verse 2]\nI'm just a bastard with a bad habit\nBad back in a black Volkswagen Rabbit\nShit I gotta have it\nBlack magic woman put a spell on me\nFuck around and win a spelling bee\nI could walk under ladders, still win the lotto\nTen minutes flat, built a boat in a bottle\nRoy Rogers bathroom, sniffin' coke with a model\nTold her to Google me, shit I might paint the Cougar green\nAll this lechuga in my jeans\nI still see Freddy Kruger in my dreams\nAin't nothin' moving but the cream\nShit, know I do it for team\n\n[Skit 2]\nI just wanna hear em announce your name, that's all I care about\nHow's your knee?\nMy knee is... It's not bad these past few days\nYou been alright?\n\n[Verse 3]\nThat's all I care about\nTook a meeting up at Paramount\nTypecast as a romantic lead\nI'm classically trained for drug dealing\nBut I wasn't good at drug dealing\nSo I flipped shit, rug, ceiling\nDry water, five daughters all stood 5'4\"\nOr got 5 quarters for the store\n\n[Outro]\nFuck knows what I'm saying anymore mane, my mind is shot, been working so motherfuckin' hard\nSo I'm bout to light this motherfuckin' dab up\nTil the next time, peace", "title": "Galactic Love", "album": "Mr. Wonderful", "image": "https://images.genius.com/3f40c65495de257e6acc2dabe3749b6b.800x800x1.jpg", "year": "2015-03-23"}], "artist": "Action Bronson"}