{"artist": "Booba", "songs": [{"album": "Autopsie, volume 4", "title": "Bakel City Gang", "year": "2011-09-30", "lyrics": "[Intro]\nA4\n2093\n92izère\nSénégal DKR\nBakel City Gangster\n\n[Couplet 1]\nMon meilleur srab est mort j’suis blasé de la life\nLes démons sortent la nuit négro j’suis guerrier de la night\nIci que de la frappe, du bif et de la chatte\nLaisse-les jouer des maracas Gorilla Thug, chien de la casse\n92 pas de fioritures, j’veux pussy, gamos, nourriture\nLe reste j’le laisse aux bolosses hein, j’les laisse la couler dur\nLe vice est àl bien vi-ser, la haine est viscérale\nVaisseau mère faucon mili, flow intersidéral\nLève ta main si t’as du Jack, des gros culs à ta ble-ta\nNos meufs sont trop malades, les négros pètent un ble-ca\nToujours plus haut je grimpe, plus dur je vais tomber\nLe savoir est une arme j’suis calibré donc j’suis pas te-bé\nUn grec après minuit, salut ma clique de Gremlins\nEuro, Dollars US, Izi Livre Sterling\nLa banlieue devient mahboul, Kopp olympique, Swagg Brahim Asloum\nBim Bam Boom la chatte à Mac Doom\n\n[Refrain]\nJ’ai jamais été suicidaire même avec rien dans l’frigidaire\nJ’préfère niquer des mères sur l’rainté mode paramilitaire\nJ’défouraille lui ou elle, criminel depuis le minitel\nVole de mes propres ailes B.A.K.E.L. City Gang\nGang Gang Gang Gang\nB.A.K.E.L. City Gang\nGang Gang Gang Gang\nB.A.K.E.L. City Gang\n\n[Couplet 2]\nFace à ton équipe, t’inquiètes un seul homme s’adapte\nDis-leur de rester tranquille, personne va sodom’ Saddam\nSaddam Hauts-de-Seine, Bakel City Gangster\nGuinée Conakry, Clamart c’est àl que j’veux qu’on m’enterre\nOn a perdu meilleur soldat, j’suis blasé de la life\nJ’te tire dessus comme Cobra (brrah) j'danse plus la hype\nLa vie n’est pas un rêve d’ailleurs j’en fais des cauchemars\nÜ sur le polo, Versace sur le costard\nFais pas d’bizz avec mes négros si tu peux pas les yép\nMa force de frappe est militaire tu parles en coup d’tête balayette\nAllez, nique ta mère! j'tire dans le crâne, j'vise pas dans les ieps\nSi tu l’es ap joue pas le gangster dans la street fallait y être\nMoi j’ai rien à prouver, mon casier parle en ma défaveur\nEux ils ont des godes, nous on est des godfathers\nIzi train de vizie soucizi calvitizie gros bre-chi par icizie\nDans Oz j’suis Adebisi (Izi, izi, izi)\n\n[Refrain]\nJ’ai jamais été suicidaire même avec rien dans l’frigidaire\nJ’préfère niquer des mères sur l’rainté mode paramilitaire\nJ’défouraille lui ou elle, criminel depuis le minitel\nVole de mes propres ailes B.A.K.E.L. City Gang\nGang Gang Gang Gang\nB.A.K.E.L. City Gang\nGang Gang Gang Gang\nB.A.K.E.L. City Gang\n\n[Couplet 3]\nRajoute des 0 pour qu’on conclue, barbu comme Carlos Boozer\nC’était juste moi dans ton cul, t’as cru qu’on était plusieurs\nJ’dis pas ce que j’fais ni à ma pute, ni sur Twitter\nJ’finirais en taule avait prédit mon instituteur\nPas besoin d’être marabout pour savoir que j’tournais mal\nPas besoin d’allumer ta radio à tous les feux rouges on est àl\nJ’ai fait mes classes à la ZUP, quand j’aboie ça chuchote\nLa France d'en haut, porte mini-jupe, donc je vois sa culotte\nLes keufs te questionnent rappelles-toi quand on t’a dit chut\nAulnay-Sous-Bois l’ASB te tombent dessus pas le temps de dire \"zut\"\nMon kho était le meilleur, j’suis blasé de la life\nTous plus intelligents que l’plus haut-gradé de la BAC\nSouvent j’pense à la téss’ man j’ai pas vraiment la pêche\nLes putes passent à la caisse que des vrais négros dans la pièce\nSouvent j’pense à la téss’ man j’ai pas vraiment la pêche\nLes putes passent à la caisse que des vrais négros dans la pièce\n\n[Refrain]\nJ’ai jamais été suicidaire même avec rien dans l’frigidaire\nJ’préfère niquer des mères sur l’rainté mode paramilitaire\nJ’défouraille lui ou elle, criminel depuis le minitel\nVole de mes propres ailes B.A.K.E.L. City Gang\nGang Gang Gang Gang\nB.A.K.E.L. City Gang\nGang Gang Gang Gang\nB.A.K.E.L. City Gang", "image": "https://images.genius.com/7c9c860fff5bdd6e90cdd9c9524c0259.1000x1000x1.jpg"}]}