{"songs": [{"lyrics": "(Hook)\nAyo I represents Queens\nYea, you already know, come on\nYou know what time it is\nAyo I represents Queens\nPlease, let em know\nAyo I represents Queens\nBam bam yea yea uh\nStatik\nYo I represents Queens, I prop scenes up\nYea\n\n(Verse 1 - Action Bronson)\nYea the cops set me up, tried to play Action\nGood thing I’m like Peyton with the play action\nGold wagon need a diaper cause I’m shitting on em\nNo lying, engine like a retarded lion\nVery special, twist pussy like pretzel\nThe driver named Fletcher\nSit in the back of the Cadillac stretcher\nMaroon dash, air bloom when the platoon blast\nBlue grass in the Jag playing jazz\nBeige rider glove on my hand\nDamn call me Bam Bam Baklava\nSell ten out the minivan like a soccer mom\nBack flip out the eight\nDoctor Octagon, Aqua Huaraches on\nPut the fork in the pasta with the Shiitakes on it\nAin’t a dime, get a move without Papi on it\nGreen paper, motherfuckers left sloppy for it\nCome on, come on\n\n(Hook)\n\n(Verse 2 - Action Bronson)\nThrow the left hook, knock a horse out\nWorld came from across town, I put the fork down\nThrough the knapkin and the dessert disgusted\nLick the mustard, kiss my cousin\nMotherfuck you know I do my thing, it’s nothing\nSuede patches on the elbow of the jacket\nFodd saver bags for the green crack\nToast to Sesame seeds on the sea bass\nCandy skywalker Adidas\nSitting courtside heat jazz\nPlease, my bitch squeeze at 45 degrees\nWhile I shift the V with Mystique\nKiss on your cheek, go to sleep\nI roll the leaf up uh, cut through the block with Queen Latifa\nA hundred grand wrapped in a flag of Trinidad\nI been a dad, smoke dope, got the same taste as a lemon head\nI wanna meet the bitch that invented head\nKorean meats laid on a lettuce bed, roll up\n\n(Hook)", "title": "Live From Kissena Blvd", "album": "Who You Mad At? Me Or Yourself?", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg", "year": "2013-04-18"}], "artist": "Action Bronson"}