{"artist": "Cam’ron", "songs": [{"title": "Dinner Time", "album": null, "year": "2017-11-25", "image": "https://images.genius.com/4d0f6d8a1aaa753e90027f92b5782a9c.1000x1000x1.jpg", "lyrics": "[Intro]\nI need somebody to talk to me tonight (Yes I will)\nYou remember how well you use to sing it? (Yes, sir)\nY'all know I can't sing that song\nYoung man looked at him and said \"Why you can't sing it?\" (Why?)\nYou know what he told him?\n\"Since you saw me last, something happened to me\"\n\n[Verse 1]\nTime to get the facts across\nOhh, somebody pissed the pastor off\nI'm all for the jokes, bundle up, get your coat\nBut I only go for the throat, I'm a chimney, I want the smoke\nYou done opened up a door, I'm petty, ready for war\nI ain't got a sister, only sister I fucked was yours\nI know the bars off The Program touched you\nHow you mad at me, though, you let Mr. Royce touch you (facts)\nDo what you must do\nMe, I'm getting my just due\nBut who you talking tough to? Blinky just snuffed you\nPuff fucked you, we've seen it, no binoculars\nPassed you to 50, he was finger popping ya\nThen he took it back like a fly bitch that was popular\nYou're 42 still saying \"Ain't no stopping ya\"\nYou know my deals—liquor, movie, and flashy kicks\nHow you talking deals? Your last deal was '96\nYour flight book it, talking about I'm crooked\nMan, I don't steal; if I took something I took it\nPastor Mason, no fabrication, we're winnin'\nSee all these people you spinning, I'll take it to the beginning\nWhen Corey Wright japped you, Baby Maine yapped you\nRoc open-hand slapped you, you still gave him dap, too\nThat's when I asked you, \"Murda, what's the verdict?\"\nYou said, \"Nah, chill, Cam, I feel like I deserved it\"\nWhat kind of shit is that? Nigga, you a queer\nMy crib in Orlando, I had that for years\nThe Program gave you the biz\nYou know exactly what this is\nI got homes where you hide, I hustle where you live\nMax B from my building, nigga, who you getting wavy off of?\nFugazi baby, going off that water not Avianne\nListening to Suga J, look, he gon' play you wrong\nCarmelo took Lala, Meek Mill took his baby mom\nAnd let the church talk, hallelujah\n\n[Hook]\nNo, it ain't a game, I still roll with the stainless\nAnd you know my slogan, nigga, I'll make you famous\nI'll use my brain so I will leave you brainless\nSo where you wanna meet at, nigga?\n(YOU NAME IT!)\n\n[Interlude]\nSo you gon' tell me when you was staying with Puff, and I came over there and used the bathroom, it wasn’t a dildo on the sink?\nI asked you, \"What the fuck is going on, man?\"\nFACTS!\n\n[Verse 2]\nRemember when you dissed trap? You said it was the devil's work\nLook at this nigga, yo—see how the devil work?\nWolves on your ass though, I told them all to pardon ya\nWhy you talking Harlem? You from Jacksonville, Florida\nI used to give you all my clothes, don't forget you was bummy\nI fed you when you was hungry, crash test, dummy\nBut the shit he said next, I swear it ain't funny\nSaid \"Cam, become a deacon, them deacons be getting money\"\nThat's blasphemous, word to Jesus and Lazarus\nYou got bad karma, stay away, he hazardous\nCollection plate money in his pocket, he a klepto-\nAnd to get a dollar dollar you were suckin' Creflo\n2 albums, 20 years, come on, this is dead, bro\nOnly time they mention this nigga when it's retro\nMoney gone, jewelry fake, you could hear an echo\nI'm what you could have been, you was too petro\nI took your broad, they all know you a fraud\nAnd the only show you got, the Lady of Soul Awards\nHe might be nominated, I'm your little mama favorite\nAny hood I go to, I'm accommodated\nWhat you mean I'm selling liquor now? You a jizzerk\nForgot 10 years ago I gagged out on Sizzurp\nOh Boy cologne, I was giving niggas that wizzork\nI ain't even spend that Killa Season money, man, you hit dirt\n\n[Hook]\nNo, it ain't a game, I still roll with the stainless\nAnd you know my slogan, nigga, I'll make you famous\nI'll use my brain so I will leave you brainless\nSo where you wanna meet at, nigga?\n(YOU NAME IT!)"}]}