{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/f874eefae7769c856e0798ae1034ba09.260x260x1.jpg", "title": "I Am King", "year": null, "album": "The Untold Story of Walter Reed Part Two", "lyrics": "[Intro: Killah Priest]\nWe do this for sport\nYeah\n\n[Verse 1: Killah Priest]\nThe vocal words from the prince from Persia\nSilent weapons for quiet wars, expensive murder\nSavage [?], snakes, half man half ape\nThe migration of the black space, fat lake\nThe [?] his own fate\nReflection eclipse on lunar\nThe medicine man with boxwood should have came sooner\nHeavy breathing, the fox feeds on tuna\nThe pusher's drug, the moon lit his blood under a tree\nThe warrior priest bush ran spear pinpoints the deer\nThe armor shows his drama, the blood shows his honor\nHis mug show the horror, his tongue show the herb of garlic\nMilk weed and seeds above the starlit\nBelow the prophet, the stone breeds the warrior\nGolly his body submerged in garment\n\n[Hook x2: Killah Priest]\nWho am I King? Who am I Lord?\nWhat was I a peasant? What was I a boy?\nWhat I do pray pull me out the grave\nDuring my journey back this is what I'll say\n\n[Verse 2: Killah Priest]\nMy kingdom of glory, rose as scrolls of stories\nBehold 8 million eyes before me\nThe test of resurrection, my steps to edge of perfection\nI leap into the force of winds to sounds of organs\nHarps are flying dormant since God's angels are calling\nWhirlwind from the orbit\nInfinity runs down the vacuum wings, they crown me Black King\nThe hands of time push me forward\nMy face frosted 'til I forewarned them of the warlord\nAll embrace all, the sword take off limbs\nLeaping through rims, the space horse\nGreat thoughts, if my name died, then rap is back\nThe psychic on a prophet, I write it, you watch it\nUnder clouds are dark rings strumming harp strings\nI ask this question, who am I?\n\n[Hook x2: Killah Priest]\nWho am I King? Who am I Lord?\nWhat was I a peasant? What was I a boy?\nWhat I do pray pull me out the grave\nDuring my journey back this is what I'll say\n\n[Outro: sample]\nNow clear your minds, it knows what scares you\nIt has from the very beginning\nDon't give it any help, it knows too much already"}]}