{"songs": [{"album": null, "year": null, "title": "Kill Em Dead", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "[Hook - JR Writer]\nI get the bread while you in the red\nI be getting fed, and you be getting Fed\nPlayer-hater it's the truth: I've been ahead\nYellow paper in the booth: I kill em dead\n\nForget the fighting, that nigga down to front?\nHe getting hella-lightning popping out the trunk\nLet him think he Tyson, fuck around and jump\nI've got my liquor license; how many ways you want?\nI'll led the K spray, tell em niggas make way\nBefore I street sweep his ass and get on my K Slay\nLet him trip; I pull it then it's May Day\nI'm from the Knick, but my bullets stay in AK\nI don't play-play when it's pay day\nWe'll take so many shots you'll need to go to AA\nTake a vacay, put me in your stupid flow\nWe'll have the funeral right there at the studio\nWhen I clap and I spray, caps in the K like ?\nHappen to play, clashing with J I'll put you\nWith ? to back in the day\nHey, you cats in the way\nI don't give a fuck what you happen to say\nI kill em, kill em, kill em dead\n? in his grave\n\n[Hook - JR Writer]\nI get the bread while you in the red\nI be getting fed, and you be getting Fed\nPlayer-hater it's the truth: I've been ahead\nYellow paper in the booth: I kill em dead\n\n[Verse 2 - Lloyd Banks]\nI kill em dead, try to steal his bread\n.44 spilling lead; floors, walls, ceilings red\nSport Porsche getting head, they here but I came though cleaner\nTake care of everything on the meter\nI'm cool with an eye on the Nina\nBeemer, few goons on the set but I got mine too\nIt's too late to hate, killed em for 9\nAte 9 more before you fill this plate\nAin't from here, I'm just visiting\nBig is the house I'm living in. My car\nFly, I'm super-cool. When it ?\nThis game I'm turning balls, fuck these niggas I burn em all\nI'm a strange case, not the average Jack\nYou can have em back. Fell in love with Miss Mary\nWe fucking with the web on these clips\nPreparing for the day we gonna be rich, shit\nCorpse off the cliff, impound in the ground\nBitch find out how awful it gets\nWake up, riding this all for the chips\nI can't afford to be side-tracked\nI'm chilling, winning, rims spinning\nReal nigga, on contact: Banks\n\n[Hook - JR Writer]\nI get the bread while you in the red\nI be getting fed, and you be getting Fed\nPlayer-hater it's the truth: I've been ahead\nYellow paper in the booth: I kill em dead"}], "artist": "J.R. Writer"}