{"songs": [{"image": "https://images.genius.com/3dfcdaab94652abd75c7788fce09ed7f.398x400x1.jpg", "year": null, "lyrics": "[Akrobatik]\nThis is some serious business right here\nCome on\nYo, bust it, this is a remix\nAfu-Ra up in the spot\nBreez Evahflowin' up in the spot, yo\n\n\"Yo Afu!\" -] Jeru the Damaja\n\n[Afu-Ra]\nYo, yo, yo\nI know you heard of Afu, tryin to get witchu\nKnowledge be the foundation, eff the gun fool\nOne of the best to blaze the spirits who lyrical\nSpittin' so much what? My aura's makin miracles\nSummon the powers of Bob Marley\nOr Marcus Garvey, flip it on the train to run a Harley\nTouch you in the mind like virgins on all fours\nDrag you through the streets of wars and give you sores\nOf righteousness, I learned my patience in The Matrix\nLevitated evaluated now celebrate it\nThat's calibrated, lessons be stated, you're salivatin\nSo many rhyme about hymens, and shiny diamonds\nAfu-Ra keep it mentally climbin\nFound a balance in positives and negatives\nLike laser beams, (?) couldn't (?) with these maimin teams\nFoes stunned with bait, never hate\nAll you rhyme about is decay, that shit is fake\nStab my stake, through triple darkness and spark this\nSince the bullseye's your fate, watch my darts hit\n\n\"Yo just set it off man!\" -] Afu\n\n[Hook: Akrobatik]\nYo, people in the party it's time to get RUFF\nPeople in the party it's time to get RUFF\nEverybody in the place, it's time to get RUFF\nCause we know that they style's not RUFF, ENUFF\n\n\"Ak, hold back.. nah, never that!\"\n\n[Akrobatik]\nYo, straight out the gate like a Preakness candidate\nBut ain't no time for horsin around, I hold my weight (no doubt)\nStraight legislatin shit like the governor\nHip-Hop's my Wiz, I ain't fuckin her, I'm lovin her\nWhen Akrobatik brings the flows in, to stop rap's erosion\nAnother +Detonator+ explosion takes place\nWith the force of T-N-T\nAnd it's embodied in the form of these three MC's\nWhen Afu, AK and Breez \"Whirlwind Thru Cities\"\nThe place bounce like your girlfriend's two titties\nLyrical force so strong it murdered punks\nThe combo of Stronghold plus Perverted Monks\nAnd this perception is (what?) lyrical perfectionists\nRazor sharp rhyme slice leaves you midsectionless\nRock your torso, Ak's ruff enuff, even MORE SO\nFlavor to the very last morsel\nI don't force flows, shit comes natural\nThat's actual factual from Ak to you\nBring the boom bap to you without the fluff\nWhen Ak's in the spot it's time to get ruff\n\n[Hook]\n\n\"Breez tell me what's the deal yo?\"\n\n[Breez Evahflowin']\nThis shit is senseless, somebody need to do somethin\nSo many, moments of silence the club stopped jumpin\nSpot somethin similar in some of these MC's\nFell to the various ways that Satan tempt me\nWithout no sense B, hate and envy\nAddress assemblies, fuck a crown where would you be\nWithout sound; they stood firm holdin they ground\nSame spot I pray soon that a cordless is found\nWho holdin it down? Who showin love, who got the style out?\nWho got these press people all expectin me to wild out?\nBOOM BOOM BOOM to the pigs in they hideout\nNiggas so pussy they spit and dicks fly out\nBricks fly out the whip like any challenger\nMark off, another fuckin day on your calendar\nCritical caliber, holocaust cobra clutch\nTwist your wick like the skin on a dutch spliff\nRuff shit!\n\n[Akrobatik]\nAnd we bringin it\nCause we know that your style's not, RUFF, ENUFF!\n\n[Hook]\n\n[Akrobatik]\nWord Akrobatik, Afu, Breez Evahflowin'\nPerverted Monks y'all, Strong-Breezy\nPerception is, +Detonator+ bee-ya-ITCH!\n\n\"Ruff like Timberland wear, gear!\" -] Raekwon", "title": "Ruff Enuff (Re-Mix)", "album": "The EP"}], "artist": "Akrobatik"}