{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/296e117412a63a5584236cdc71e8dccd.1000x1000x1.jpg", "title": "Dose of Dopeness", "year": "2012-02-20", "album": null, "lyrics": "[Intro]\nUh, oh-oh-oh\nYeah\nUh, oh-oh-oh-oh-oh\nYeah\nUh, oh-oh-oh\n(Headbanger)\n\n[Verse 1]\nMovin' wit out movin', Pure crush groovin'\nRight on track, right on and I'm back\nRap Ex-Lax yeah, I be pooin' on ‘em\nDamn right, Mr. Cudi he be dippin' on ‘em\nSay it loud, y’all want the new-new\nExplorer like Dora, that’s how I got a clue too\nSo fucking underground, barely on Youtube\n'Till Day N Night, now they all got a clue who\nTook me a minute man, took me a while\nHard headed nigga ever since I was wild, a child\nBut my ambitions made bitches beg for attention\nDJ’s un-mixin' their mixes, just to toss in some Cudder\nAnd I tried to tell my mother\nBut she ain't underdig, figure me on some other\nBut see my mommy 'ain't a fronter\nSo nowadays she calls me a bad motherfucker\n\n[Hook]\nAnd, just when it seemed that the game is hopeless\nWe arranged some thing for a dose of dopeness\nI, I do, what I do\nAnd, I, I do, what I do\nAnd, just when it seems that the game is hopeless\nRearrange some things for a dose of dopeness\nI, I do, what I do\nAnd, I, I do, what I do\n\n[Bridge]\nDo my little dance, sippin' out a cup\nAll my people in the back, my people in the front\nI, I do, what I do\nAnd I, I do, what I do, do\nDo my little dance, sippin' out a cup\nPullin' up my pants, she come walkin' up, and I'm like...\nI, I do, what I do\nAnd I, I do, what I do, do\n\n[Interlude]\nWhoah, Nigga!\nY'all motherfuckers need to understand the fuckin' game\nShit ain't gon' change unless a motherfucker come in this shit, switch it up\nNiggas need to open they fuckin' minds, Nigga!\n'Cause this is some shit, that y'all niggas ain't ready for\nYa underdig, ya understand me?\n\n[Verse 2]\nMovin' wit out movin', pure crush froovin'\nRight on track, right on and I'm back\nYou make songs about some new dances\nI make songs 'bout the black man advancements\nI'm talkin' classic homie, I'm talkin' monumental\nAnd I don't need much but Dot instrumentals\nThat's how I lay the stencil, me smilin' up out the window\nI'm in the leaner dome, that's my crib on the moon\nAnd I'm livin' in hotel rooms\nIn the mirror, laughing at my crooked tooth\nHow a nigga eat, is how a nigga speak\nAnd how a nigga live, is sacrifice was big\nAnd I'mma say it right before the hook\nMaybe in due time, Pimpin', I'mma write a book\nBut now I'mma play my Andre 3000\nAnd dream about an island wit model girls eyein'\n\n[Outro]\nUm... hello\nHey baby\nUm... yeah\nSome people call me Cudi, some people call me Scott\nIt don't matter what you wanna call me, as long as you call me something\nAs long as you call me, baby\nBut um...\nYou know...\nYou seem real pretty\nAnd I ain't talkin' bout how you look\nI'm talkin' 'bout your, your vibe\nYour vibe is pretty\nI'm pretty hungry, you want to go get something to eat?\nSip on something?\nWhere we going?\nThe moon..."}]}