{"songs": [{"image": "https://images.genius.com/826c5df8eea3fb88d213c3fb10f319a8.1000x750x1.jpg", "lyrics": "You know I'm bald so hard that my whole head’s shiny\nSo it's easy to find me\nWhat's Rogaine to a mothafucka like me could you please remind me?\nBald so hard this shit’s grey, gotta sweep all the hair in the trash again\nGotta buzz it, gotta keep it really short, i gotta shave it, or I'm looking like I'm Khloe Kardashian\nSee I'm a bald, bad-ass like Dana White\nWhen I roll up on your bitchy ass, in a slick Prius\nAnd I fight you when I'm high as fuck like I'm Nick Diaz, I never get rehab\nI'm getting cinematic with it, anybody wanna try to fuck with Lethal for their benefit?\nI'mma kick you so hard that my shin’ll split, lil bitch, better get a mental grip, or I’mma run you over in a rental whip\nI'm givin a kiss to Beyonce’s chest\nYou wiggaz are bangin ya head like Kanye West against a stop sign\nYou thinkin they're makin guns illegal? I don't care, i already bought mine\nI slip in the clip then I finger the trigger and pop nines\nI'm gonna burn the flag, got the Constitution up in my pocket\nI’m thinkin like a prophet, superhuman when I rock it, let's turn down the beat and watch it\nCheck it you gonna get shredded, beheaded, deaded\nMy head is red like I fed it unleaded\nEmbedded etiquette, mega-prophetic\nNever been hesitant, every devilish measurement of my lyrics is 77 megabits\nSippin on a little hot sake watch me\nAll the rappers always tryin to copy is sloppy\nI'm sick in the booth I'm stickin and movin and kickin a groove and I'm musically bomin you like Nagasaki\nSo fuck anybody if they don't like sushi\nI smack Demi Moore on her old white booty\nCuz\nKiddo when I'm bonin\nI push a girl's slot to 12 am like Leno did to Conan\nGet the telephone and call the cops\nCome and search my head for the baldest spot\nI'm like Bonnar and Griffin when I be bombin the rhythm\nAnd all you lil booty bitches is just Donner and Blitzen\nBlitzin a Black and Decker rhythm man the mackest mechanism waitin for the day that BREAKIN BAD IS BACK ON TELEVISION listen\nI'm hoping your flow's gonna be tighter fuck anybody that ever stole one of my lighters", "year": "2013-06-11", "album": null, "title": "Mac Lethal - Dude remakes a Kanye West song with hair products. Then KILLS it."}], "artist": "Mac Lethal"}