{"artist": "Kodak Black", "songs": [{"image": "https://i.genius.com/93da6aa6c8b0bfd4ce020972fc380ba7c99246ed?url=https%3A%2F%2Fcdn.spinrilla.com%2Falbums%2F45683%2Flarge%2Fc593bd0e9d3a1a4072fc.jpeg%3F1468964444", "title": "Down N Out (Freestyle)", "year": "2014-06-07", "album": null, "lyrics": "Yeah I'm that youngin from the projects\nStolen cars, but I'm gettin' money now, so I bought a Jag\nShe want me to love her, eat that pussy good\nSlide it in her ass, but I'm not familiar with that\nI'm not the student at the front seat of the class\nTeacher's pet, a class clown cause I ain't go to class\nWhy go to school? I know all I need to know\nAnd I'm gettin' cash for gold money so why should I pass now\nI'm sittin' on a crate chillin' in the shade\nFresh cut, Kodak fade\nOn my corner with them thangs\nCome get you a pillow sack 5 for 20\nI got nicks and dimes\nWhat you want? Zone or high grade?\nShoot it you fade away\nMoney come every day\nYou can get it anyway\nSee I'm gettin' it every way\nLil Kodak\nSalute me I'm Mr. K\nWhere is my cake?\nSuper cold [?]\nI can't be fuckin' all these hoes\nAnd I can't be makin' friends\nDon't be them foes you don't know they hatin' on the low\nI'm that lil nigga from the 'Noya\nThat lil zo\nI be Polo to the floor\nBoy, don't act like you don't know\nI came up shootin' dice by the dope hole\nThrowin' licks, the youngest nigga out here posted on the scroll\nSnatchin' chains, I fell in love with that gold\nShe be shinin', she's so pretty\nBoy, I love that hoe\nMy people be tryna tell me leave the streets alone\nBut they see I just won't listen\nThey say \"just let him go\"\nThey got me at running back and now I'm runnin' them back\nAnd Coupe say when I get older I be runnin' the sac\nI'm that ratchet jay baker rap maniac\nWhere's that? Pockets fat\nHit my first lick I don't know how to act\nNew cracker say I look like lil Boosie\nAnd plus I rock the Boosie\nThey call me Boosie, they say I'm so easy to catch\nThey say I'm ADHD, schizophrenic\nMy pistol panic, it just be firing\nGet nervous, I can't handle it\nProject Baby, and you know that I am him\nMy nigga found me, he was with me shootin' in the gym\nI was settin' him up for 3's, but I was scorin' more than him\nHe wanted to be the team, grabbed my ball straight off the rim\nMy main bitch be trippin'\nShe not my main, but the only reason she my main cause I ain't got no other bitches\nI be stolo slidin' foreign\nShe be nervous when she in it\nI be drivin' on the mollys, I be rollin like a filly\nGhetto child, posted with that 9 like Ibaka\nUgly corner jet, 40 cal hit you like [?]\nLil nigga big old pistol, I can't shoot no chopper\nRock designer, Ferragamo, Prada fly like Harry Potter"}]}