{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/d51a09ab284e0481b02b4d6ecfda5c73.1000x1000x1.jpg", "title": "Life After Death", "year": null, "album": "Behind The Musik (A Boy Named Jonah)", "lyrics": "[Verse 1]\nI rolled out the bed as the alarm started going off\nI rubbed my head with my arm, it was the crack of dawn\nI'm late for work, and I really just hate my job\nI kissed my wife goodbye, and then I walk across the lawn\nGot in the car out the driveway and I'm riding on the road by the mall\nPast the highway that I'm flying on but\nIt slows to crawl cause some guy was just driving wrong\nAnd I'm getting mad, cuz I wonder why it's going on\n\"Get out the way,\" I just scream as I'm driving on\nI hate my day and this way that it started off\nI change lanes and I thought that I was pulling onto\nThe main lane but just then I saw this green Honda\nIt straight came next thing it was the window shattered\nFelt a great pain my body being bruised and battered\nIt all changed went black and I knew I had it\nI coughed blood, breathed my last breath, that was it\n\n[Hook]\nWhat you gonna do when there's no time left?\nWhat you gonna do when you take your last step?\nWhat you gonna do when you take your last breath\nOut your chest and find out that there's life after death? [x2]\n\n[Verse 2]\nNext thing I know everything just got real quiet\nI opened my eyes to my surprise now it's real silent\nI realized I had died now it's my judgment\nI'm standing before the Most High now and all of the sudden\nHe said to me, \"Why should I let you into my Heaven?\"\nI told God, \"Well usually I'm a good person.\"\nHe showed my life and all the times now that I was sinning\nFrom every line, to every curse, to every bad decision\nFrom every lie, to every word; there was nothing hidden\nHe showed how Christ died and with my life that I'd killed Him\nHe showed me time after time how I'd reject Him\nI never cared about the sacrifice God had given\nI never cared about my life or the way I lived it\nAnd now I've died and it's too late to be forgiven\nGuilty of my crime I'm sentenced to eternal prison\nIt's dark, I'm alone, I feel my flesh burning\n\n[Hook]\n\n[Verse 3]\nI rolled out the bed as the alarm started going off\nI scratch my head and then I yawned it was the crack of dawn\nI'm praying and I'm thanking God that I got my job\nI kissed my wife good-bye then I walked across the lawn\nGot in the car out the driveway and I'm riding on the road by the mall\nPast the highway that I'm flying on but\nIt slows to crawl cause some guy was just driving wrong\nBut I'm not mad I just wonder why it's going on\nI use the time to pray for my family now and for my mom\nI'm thanking God for the way my day had started off\nI change lanes and I thought that I was pulling onto\nThe main lane but doesn't that guy see my green Honda?\nIt straight came next thing it was the window shattered\nFelt a great pain my body being bruised and battered\nIt all changed went black and I knew I had it\nI coughed blood, breathed my last breath, that was it\n\n[Hook]\n\n[Verse 4]\nNext thing I know everything just got real quiet\nI opened my eyes to my surprise now it's real silent\nI realized I had died now it's my judgment\nI'm standing before the Most High now and all of the sudden\nHe said to me, \"Why should I let you into My heaven?\"\nI told God, \"I never was a good person.\"\nHe showed my life and all the times now that I was sinning\nFrom every line, to every curse, to every bad decision\nFrom every lie, to every word; there was nothing hidden\nHe showed how his Son died and with my life that I'd killed Him\nBut He showed the time I chose Christ and I didn't reject Him\nHe showed the time when I took the love that God had given\nHe tried to serve through my life whenever I lived it\nAnd now I've died but I thank God that I'm forgiven\nHe wiped the tears from my eyes as I cried and thanked Him\nCuz forever I'm a be with Him just in Heaven\n\n[Hook x2]"}]}