{"artist": "60 Second Assassin", "songs": [{"title": "Remarkable Timing", "album": "Remarkable Timing", "year": "2010-06-08", "lyrics": "[Intro: Popa Wu]\nYeah, yeah, y'all\nThis is the famous Popa Wu\nYou know how it go down baby\nYou understand? The Remarkable Timing by the 60 Second Assassin baby\nWe coming thru man live, just live baby\nWe doing our thang now, man\nComing straight from the mind, straight with the math\nYou understand?\nWe gon' put it in for y'all right now\nYou understand?\nWe gon' take it all thru the degree of knowledge man\nAnd bring it back man to the foundation\n\n[Hook: sample]\n\"When I rhyme with Remarkable Timing\"\n\n[Verse 1: Masta Killa]\nOne-two, now, one-two, now, listen\nMeditation soulful strings, wisdom overflowing, mind blowing\n60 Sec, Masta with the Bronze Naz, classic Chamber Musik rapture\nBefore the laughter came tears love, hell or right\nBlack, brown, red, yellow, white\nMy mic bless nations with the perfect timing\nLyrics build the universal thought\nRhyming is the leads, my magnetic substance is speech\nAttracted a-alike\nNow ladies when you hear the God speak squeeze ya legs tight\nThis is Irief, you know what I bring\nThe murder word play, intensity danger\nChi-Town P-Stone Ranger\nTeach the truth, Black!\nUnited we can fight it, divided, well you know what that do\nWhen crews separate hate, when family suffer, friends kill friends\nBrothers gotta stand together we can make it\nTake it to another level, peace to Rebel INS\n\n[Hook: sample]\n\"When I rhyme with Remarkable Timing\"\n\n[Verse 2: M-Eighty]\nIt’s so remarkable, spark a bowl up blow out an arsenal\nDutch, touch, phenomenal, crush, rush to silent hill\nThe timing I’m in, has got me vibing on assignment\nWhere all the livest live men, silence upon my entrance\nThat dude, formerly introduced heavy on revenue\nWho generate only new 'cause you never knew\nThe history, the chapters, the saga, the seconds after\nI almost called it quits, and realized that I’m the..\nHigh exalted, yet falted, slighted Almighty Titan\nKeep fighting the good fight, and prosper Remarkable Timing\n\n[Hook: sample]\n\"When I rhyme with Remarkable Timing\"\n\n[Verse 3: 60 Second Assassin]\n60 Sec, for creating the impossible\nRemarkable Timing, concoctional\nBullshit can step into my arch of flow\nNon-un-lockable, my hourglass still tick-tock-able\nLike some of y'all birds I know they stay flock-able\nCoo-coo 'cause I still lock in the sock, you know\nMade contracts but fuck everything optional\nFuck an infrared I got you cross-line telescopical\nYou know you here today but gon' tomorrow\nYou know like years took hip-hop ago\nNothing right now is really marketable\nAll talk is philosophical\n60 Sec they scared to death, I'm unstoppable\nHow you gon' stop every Sec can stop a flow\nMy mission impossible, I'm hard to kill\nSomebody guard his grill and let him know that God is real\n\n[Break: 60 Second Assassin]\nTime be the master of illusion\nCause the level of our mind stay grooving\nNever be no time to be losing\nOnly once in the time shows and proving\nTime be the master of illusion\nCause the level of our mind stay grooving\nNever be no time to be losing\nOnly once in the time shows and proving\n\n[Hook: sample]\n\"When I rhyme with Remarkable Timing\"\n\n[Outro: Popa Wu]\nPopa Wu baby\nRemarkable Timing, 60 Second Assassin\nStraight from the mind\nWe gon' put it in for y'all right now\nYou understand?\nWe gon' take it all thru the degree of knowledge man\nAnd bring it back man to the foundation\nYou understand?\nWe gon' make it rain on y'all this time\nYou understand?\nAnd y'all gon' wonder who caused it to happen\nGive you 60 minutes of your time baby\nAnd what you gon' get the Remarkable Time baby\nYou understand?\nYeah, 60 Second Assassin y'all", "image": "https://images.genius.com/1d2892cda7088abed9797fd13ab159e5.500x500x1.jpg"}]}