{"artist": "Ice-T", "songs": [{"title": "Lethal Weapon", "lyrics": "[Ice-T]\nE-V-I-L E and Ice-T are on a jack move\nLayin down the dope groove, smokin those who disapprove\nWreckin the deck, you'll regret if you cross punk\nRollin like a Mack truck, waxin those who talk junk\nViolent your end, I got your face in my crosshairs\nWanna see your dome bust sucker cause I don't care\nNuttin bout you, your crew, because you talk shit\nI'm the Lethal Weapon boy, ridin the apocalypse\nIf you're in my way, then lay beneath the ground soon\nViolence is my business fool, the microphone of doom\nMission that's to cure all punks as I bust caps\nPeelin your back, my ammunition hollow-point raps\nYou try to run, that makes it even more fun\nI just cold lamp and vamp you with the shotgun\nCops try to flex.. but guns they'll never find..\nMy Lethal Weapon's my mind!\n\n[Hook: Rakim]\nA lethal weapon..\nA lethal weapon..\nA lethal weapon..\nAn assassinator, if the people ain't steppin\n\n[Ice-T]\nYou hit the deck, as rap busts from my lips\nYou think I'm finished - I load another clip\nLook in my face, I crack an evil grin\nLyrics bring death from the microphone Mac-10\nSucker MC's, you ain't down with the Syndicate\nTry to kick game, but end up talkin weak shit, yo\nYou're weak, you're wack, you need to quit you lil punk bitch\nGo and freak your mother, go dig a damn ditch\nGet out my face, I'm tired of the press too\nYou write about me, I write about you\nYou think I'm violent, but listen and you will find..\nMy Lethal Weapon's my mind!\n\nChorus\n\n[Ice-T]\nUp against the wall - it's Valentine's Day\nThe Massacre's about due for a replay\nI'm about to explode - like a hand grenade\nEvil E do damage on the crossfade\n{*Evil E scratches*} Cuts like a battleaxe\nYou try to bite, get iced, my raps are boobytraps\nClaim of mine, designed by the Ice himself\nYou beg for mercy as you read the hand you're dealt\n{*screaming \"Ah ahh ahh AHHHHHHHHHHHHHHHHH!!!\"*}\nCause there's no let up, you walked into a set up\nIt's suckin you down and now you can't get up\nWhy because you froze the moment we met up\nAnd I never run punk, I go head up\nI ain't no fool and new jack poppin fake rap\nI rap from the heart and soul, where only facts are kept\nMany rappers sell-out pop and other MC's slept\nI ain't in no playin mood, so nigga watch your step\nCause if you cross the boss, you go to bed quick\nKnow my situation boy, don't diss the Syndicate\nCause when we chose to move, you're gone\nAnd no remains they'll find..\nMy Lethal Weapon's my mind!\n\n[Hook]\n\n[Ice-T]\nMore bodies than John Gotti, the Lethal Weapon is slaying\nJust open any book, that's ammo to the brain\nWhat really matters, is how well is your weapon trained\nSome would say genius, while others would say insane\nThe Weapon power has been witnessed upon my page\nFrom Martin Luther's \"dream\", to Hitler's psycho rage\nWhat's more powerful - the brain or a twelve gauge?\nThe words I speak have scared many people to this stage\nBut promote violence, I really have to disagree\nIt's entertainment, like \"Terminator\" on TV\nBut some'll never see, you're stupid ignorant and blind\nThe Lethal Weapon's the mind!\n\n[Hook]\n\n[Ice-T]\nThe mind..\nThink!\n\nThe mind..\nYouknowhatI'msayin?\nI got my jammy with me at all times, youknowhatI'msayin?\nThey can't take this one thing away from me\nThat's got more power, than any gun in the world, youknowhatI'msayin?\nI'm talkin bout brain power homeboy\nThey can't mess with me cause I'm too smart for them out there\nYouknowhatI'msayin? Fully strapped, always packed\nGo to the library and get some more ammo, youknowhatI'msayin?", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10"}]}