{"songs": [{"year": "2016-01-18", "lyrics": "[Chorus]\nOhh it's a funny game\nDon't believe that it's all the same\nAbout that flat thing that I just said\nWas cause there's something upon my head\n\n[Verse 1: B.o.B]\nRiding fastlane with the top back\nSpeeding no brakes where the gas at\nCrooked ass cop put your cap back\nSo you already know where the strap at\nMan you already know we in beast mode\nMan you already know a nigga pass that\nEverybody false flaggin', man you already a nigga blessed\nYou already know, you already know\nYou already know, you already know\nI could tell you cause you already know\nYou already know, you already know\nYou already know, you already know\nI could tell you, but you already know\n\n[Verse 2]\nI'm sick of running with my hands up\nI'm just fucking all they bands up\nSimple man I don't demand much\nI'm just trying to roll these grams up\nWhat you wanted me to say to you?\nGive you something to awaken you\nFind a topic that's conveyable?\nA prophecy that's inescapable?\nThis the world that they portray to you\nSovereignty is unattainable\nJustice, too, is unavailable\nThe judge's ruling is persuadable\nSlavery is generational\nWho you worship, who you praying to?\nWatch these fakers what they say to you\nYou see the truth it's unmistakable (Naw)\nThey wouldn't lie to me, dawg (Naw)\nThey wouldn't lie to me, bro (Naw)\nThey wouldn't lie to the world (Naw)\nThey wouldn't lie under oath (Right?)\nNo man can be high as the law (I guess)\nThe law that was sworn to uphold (I guess)\nIt's too late, the door has been closed (uh-huh)\nToo many stories' been told\nBandz\n\n[Chorus]\nOhh it's a funny game\nDon't believe that it's all the same\nAbout that flat thing that I just said\nWas cause there's something upon my head\n\n[Verse 3]\nStarted out for the love of the song\nWoke up and saw the blood on the phone\nWoke up and seen the sun, it was cold\nWondering where the fuck did I go wrong?\nWhere has the time gone, where has the time gone?\nLost in the time zone, must got the time wrong\nWhere does the time go?\nI don't wanna die alone, don't wanna die alone, die alone\n\n[Verse 4]\nAt a glance, you'll never truly understand\nCascading thoughts will form an avalanche\nEventually the shit gonna hit the fan\nNiggas that sick of suffering got demands\nClimb up the mountain just so we can stand\nBig brother hang you off it by your pants\nNo more allegiance to no more leaders\nTo people that put the law above the land\nIt's a scam like Iraq and Iran, Afghanistan\nCreated targets, create the martyrs\nDemocracy artists, good hearted people enlisted to fight\nFor this system that stripped all your rights\nAnd the bitches delivered in doses so potent that when they’re administered people turn sinister\nThe retina, the all seeing retina\nThe mark of the beast, the mark of the predator\nGod bless, God bless America, god bless the regular\nFar from the regular\nDon't kill the messenger\nBandz\n\n[Chorus]\nOhh it's a funny game\nDon't believe that it's all the same\nAbout that flat thing that I just said\nWas cause there's something upon my head\n\nRide in that lane with the top back\nSpeeding no brakes where the gas at\nCrooked ass cop put your cap back\nSo you already know what a strap back\nMan you already know when you in beast mode\nMan you already know a nigga pass that\nEverybody false flaggin', man you already a nigga blessed\n\n(x2)\nYou already know, you already know\nYou already know, you already know\nI could tell you cause you already know\nYou already know, you already know\nYou already know, you already know\nI could tell you, but you already know\nYou already know, you already know\nYou already know, you already know", "title": "False Flag", "album": "FIRE: (False Idols Ruin Egos)", "image": "https://images.genius.com/f848443490c092a3b586e54658aa26d7.800x800x1.jpg"}], "artist": "B.o.B"}