{"songs": [{"image": "https://images.genius.com/e0b1851157e96e4ea48ecc8de3f63ccb.500x492x1.jpg", "lyrics": "[Verse 1: Mac Lethal]\n\nHey yo speak low, your voice can’t shatter my eagerness\nThese kids still draw sand patterns with fingertips\nAnd try to catch balloons so they can stuff em in their shirts\nI finished all the puzzles that are underneath the skirts\nOf these girls plagiarizing didn’t read without something\nIn my lungs vaporizing, hit the weed without puffing\nIt’s like I can’t acknowledge misery without bluffing\nThe most violent fights tend to be about nothing\nAbsolutely nothing, nothing but a lack of control\nOr the need to make another person back up, patrol\nComes siren spinning eagles beaming even with the cherries lit\nPeople rather die before they feel any embarrassment\nPretty and careless with witty old phrases\nJust to get a giggle the world’ll spit in your faces like pew\nBut what you gonna do? Let it cripple your steps\nThe end is serious in death, infinite jest\n\n[Hook]\n\nSweet love, won’t you please speak low?\nYou got a sweet love, won’t you please speak low?\nYou gotta hush, understand there ain’t no rush\nAnd that my patience is a little too sensitive to touch\n\nSo sweet love, won’t you please speak low?\nYou got a sweet love, won’t you please speak low?\nYou gotta hush, understand there ain’t no rush\nAnd now my patience is a little too sensitive to touch\n\n[Verse 2: Mac Lethal]\n\nSpeak low, you’re weakening the stock\nCause all you do is talk talk talk talk talk like 2Pac\nIn interviews so crass and ravenous\nPassionately soaking me in old-fashioned adages\nReload, my ego is so damn savage\nThat it sometimes convinces me that I’m above average\nBelow madness, right here, right there\nIf I never heard your voice again I probably wouldn’t care\nSo just stare with the jolly crooked stare\nFinding people like me in Hollywood is rare\nSee I don’t act, I don’t retract any statements\nAnd I don’t give a fuck where all the cuteness in my face went\nI got a belly and I’m balding on my skelly\nAnd I’m not in need of food, love, or money so I’m wealthy\nMy well-being works like this, I’m satisfied with my life\nTherefore I’m rich, get it?\n\n[Hook]\n\nSweet love, won’t you please speak low?\nYou got a sweet love, won’t you please speak low?\nYou gotta hush, understand there ain’t no rush\nAnd that my patience is a little too sensitive to touch\n\nSo sweet love, won’t you please speak low?\nYou got a sweet love, won’t you please speak low?\nYou gotta hush, understand there ain’t no rush\nAnd now my patience is a little too sensitive to touch\n\n[Verse 3: Mac Lethal]\n\nEverybody’s fucking out their minds\nEverybody’s acting like we’re running out of time\nLike time is so precious, your patience is tested by this place\nThis place of rotten rancid faith\nThis taste, this cotton candy taste\nComes when I spew waste out over the boom bass\nSo let’s discuss time, I see you get upset when you gotta wait in line\nWhen you’re in a traffic jam getting plagued with personal troubles\nThe whole entire universe is bursting your bubble\nLike this world is yours, so selfishly sure that\nEverybody’s else’s intentions are impure\nThe universe is shaped exactly like the earth\nIf you go straight long enough you’ll end up where you were\nThe only thing that matters is the changing of the shapes\nIf you want to time travel just stand in one place\n\n[Hook]\n\nSweet love, won’t you please speak low?\nYou got a sweet love, won’t you please speak low?\nYou gotta hush, understand there ain’t no rush\nAnd that my patience is a little too sensitive to touch\n\nSo sweet love, won’t you please speak low?\nYou got a sweet love, won’t you please speak low?\nYou gotta hush, understand there ain’t no rush\nAnd now my patience is a little too sensitive to touch", "year": null, "album": "The Love Potion Collection 5", "title": "Speak Low"}], "artist": "Mac Lethal"}