{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/d098075a677d44022667137d3c0db87a.320x320x1.jpg", "title": "Good Evening", "year": "2012-01-23", "album": "Tell Ya Friends", "lyrics": "[Intro]\nYeah, pour me something purple\nNot pink, I said purple nigga, yeah\nWe livin' good! Wassup, niggas? Yeah\n\n[Verse 1]\nEverybody know we getting it, that new thing, I'm sittin' in it\nI ain't got no license and I don't really give a shit\nThis bitch in my girl name, I paid for it, I'm whippin' it\nThat codeine, I'm sippin' it, we on shit, we kickin' it\nTell them hoes good evening, when I walk in the room it's over wit'\nHer face got “I wanna let you fuck” written all over it\nGood evening, it's over, we out here, we showed up\nThey hoes wanna go home with us\nWe ain't from here, they don't know us\nWe goes in, we po's up, 6 Os in the two liter\n6 hoes in a two seater, yeah, Chip cold, did you see her?\nTurn down your block, yeah, you smell that odor\nDropped her off in that Rover, and this what I told her\n\n[Hook]\nGood evening (And my Chevy sit on 24's)\nJust copped a brand new Benz\nBitch you knew we get these ends like\nGood evening (And my Chevy sit on 24's)\nJust copped a brand new drive\nI pulled that bitch up off the lot like\nGood evening (And my Chevy sit on 24's)\nYou niggas try to play me\nUp that 40 cal baby like\nGood evening (And my Chevy sit on 24's)\n(And my-and my Chevy sit on 24's)\n\n[Verse 2]\nWe thuggin', we thieving, I'm the coldest out of Cleveland\nI ain't got no record deal and I don’t really need one\nWhichever bitch I fucks wit', make you that much cooler\nWe don't drink no Ciroc, we got Jameson in the cooler\nI just met her, you knew her, you friends with her, I screw her\nI fucked like McGruber, them cold hoes and cougars\nI move like a ninja, live like Frank Lucas\nSittin' there wit' her top off, just like the coupe is\nSomebody better roll up or bowl up\nOr vaporize up while my paper rise up, yeah\nDJ, stop the music, two moments of silence\nI murdered the parking lot and the club, I am your flyness\n\n[Hook]\nGood evening (And my Chevy sit on 24's)\nYou know we sip that Crown\nYou know we shuttin' niggas down like\nGood evening (And my Chevy sit on 24's)\nYou know we run the town\nWhenever we come around, it's\nGood evening (And my Chevy sit on 24's)\nPullin' up and shake the ground\nKnow we puffin' on that loud like\nGood evening (And my Chevy sit on 24's)\n(And my-and my Chevy sit on 24's)\n\n[Outro]\nYeah, I know you haters mad, we living good!\nBitch, haha, yeah, Chip\nChip Tha Rip nigga, yeah\nExtra clean bitch, what? Extra clean bitch\nGood evening, good evening, good--"}]}