{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "A Prince Among Thieves", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Intro: T-Bone]\nI tried to be there but you wouldn't let me in\nBefore hustlin', we were friends\n\n[Verse 1: Sha/Tru]\nDamn, what a price to pay\nShows the thought you can't take away\nNow, forever, sleep is where your body lay\nRestin' in peace is what I hope and pray\nShit, what I won't tell your moms\nAs she breakin' down in a brother's arms\nBut she don't know the truth, so I throw on the charms\n\"He started buggin', callin' in to work\nCaptain of the fiends so they called him Kirk\nAfter he got caught, he got real berserk\nFound out he was smokin' from who gave him work\nI wanted to be the first one to tell you that\nYour not son only sold but he used crack\nAnd this is somethin' that I can't believe\nComin' from a Prince Amongst Thieves\n\n[Hook: T-Bone]\nSometimes I wondered but I didn't understand\nJust where you were trying to go, only you in the plan\nI tried to be there but you wouldn't let me in\nBefore hustlin', we were friends\n\n[Verse 2: Sha/Tru]\nI thought it woulda been better if I'd just let him be\nBut he started showin' two faces: one for you, one for me\nI watched him change, shit was missing, which was strange\nLeave on the train, get dropped back off in a Range\nOur friendship taking a back seat to cocaine\nLookin' at your mommy, I too can feel your pain\nYour son, my man, addicted to crack\nWhat in the world would have pushed him to do that?\nA god-fearin' boy is how you raised him\nMommy, don't blame yourself, on you, I give praise\nRaisin' two kids, struggling all alone\nTaking what life had to offer ya head-on\nHe chose to take the route of a loser\nA cocaine seller, a cocaine user\nReality's sometime hard to believe\nBut who ever thought it woulda happened\nTo the Prince Among Thieves?\n\n[Hook: T-Bone]\nSometimes I wondered but I didn't understand\nJust where you were trying to go, only you in the plan\nI tried to be there but you wouldn't let me in\nBefore hustlin' we were friends\nThere's a place for thugs like me\nThere's a place for thugs\nThere's a place\nThere's a place for thugs like me\n\n[Bridge: Prince Paul]\nWhat ya wanna do son, how do you feel?\nLivin' in a life when everything is real\nWhat ya wanna do son? Yo, what's the deal, yo?\nLivin' in a life when everything is right\nWhat ya wanna do son, how do you feel?\nLivin' in a life when everything is real\nWhat ya wanna do son? Yo, what's the deal, yo?\nYo, what's the deal, yo? Yo, what's the deal?\n\n[Verse 3: Sha/Tru]\nI never thought that losin' you would've left an empty space\nIn my heart, when I pour me out, it ain't going to waste\nAnd every time I see your son, I remember your face\nI'm locatin', minding my way, raising him like he was mine\nI mean the joy he brings me kinda hard to define\nKnowin' how tight we was, how shit coulda been\nYou was more like my brother but that fried me in\nAnd since you can't now your son has someone to depend on\nSo take this, son, and rest in peace\nI wish you woulda known how I felt 'fore you was deceased\nOr gave this shit enough time to get released\nEvery time I hear \"Prince,\" I'ma remember you\n\"Among Thieves,\" what the fuck I put you through?\n\n[Interlude: Sha/Tru]\nMan, the messed up part about all this is, I gotta live in this screwed-up world without you...\n\n[Hook: T-Bone]\nSometimes I wondered but I didn't understand\nJust where you were trying to go, only you in the plan\nI tried to be there but you wouldn't let me in\nBefore hustlin', we were friends\n\n[Outro: T-Bone]\nIt's not my fault that you're gone\nIt's not my fault that you're gone\nIt's not my fault that you're gone, that you're gone\nIt's not my fault that you're gone\nSix feet under is where you're gone\nI'm gonna carry my all on my own\nSix feet under is I'm going\nWe'll be friends again, we'll be friends again, all along\nI'm gonna meet you one day, I'm gonna meet you one day\nI'm sorry you're gone, but I gotta...", "year": "1999-02-23"}]}