{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legendary Classics Volume 1", "year": null, "lyrics": "[Verse 1]\nYo yo yo\nMiraculously the blacklist could not rid me\nSissy pigs frisk me, it's me\nEverybody in the club tipsy\nFuck that, bring hip hop back to New York city\nGet busy with the white grizzly, wiggy wiggy wiggy\nBlowtorch leave ya ass crispy - hidden delivery\nNo tricking me with evil and trickery, history, misery\nMystery like Agatha Christie\nMy enemies wanna physically cripple me, bitch strictly\nSpecifically wordplay, Slick Ricky, I'm slicker than Slick Ricky\nI'm the top notch, the elite, we meet, me defeat\nMe be beat, repeat in this street life is cheap\nBaa baa black sheep, no shoes, dirt black feet, pack heat\nTrack meet run from cops, ghetto athlete\nI'm back that deep, you lack lyrical heat\n\n[Hook x2]\nI'm supa (supa, supa)\nI'm supa (supa, supa)\nI'm supa (supa, supa)\nI'm supa (supa, supa)\n\n[Verse 2]\nI used to sneak in windows and steal Nintendos\nPimp hoes, white mandingos, I wear black, I don't wear pink clothes\nSuffolk county anything goes\nWhy you trying to copy my shit like Kinkos?\nI drop brickloads, sick flows, I done did those\nHit hoes, ripped shows, quotables kicked those\nAll the criminal shit and the sinning\nThey wanna know do I have a religion\nIs there a god, do I believe in him?\nOh yes, how the fuck else could I be so blessed?\nGod put me on this earth to be one of the best (of all time)\nAnd don't question it, it's a definite\nThe all time best in it, kept in it, repping it\nThe last one left in it\nI'm A plus, you get a F in it\nNegative, pessimist, effortless\nCaucasoid, leprosy, lepedist, method in repping this\nFresher, so fresh in this, catching the specialist\nI'm ol' D, special K, treacherous, I'm supaaa\n\n[Hook x2]\n\n[Verse 3]\nI gets papers in small amounts\nOoga booga bounce\nSmall fry born 4 pounds 8 ounce\nI like to drink, milk, it helps me grow\nAnd think like a champ\nSuckers I vamp\nI, I don't care, I'm ugly as shit bitch\nStop and stare, American nightmare\nI'm super duper, I'm the newschool\nOf the oldschool school\nVoice is smoother than Luther\nDon't let the ugly grill piece fool ya\nI'm Kostya Tszyu, you Zab Judah\nTwo rounds through ya forget the past, I'm the future\nCrowd mover, I'm super duper duper\nSupa supa supa\n\n[Hook x4]", "title": "Supa", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}