{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "Advertisement", "year": null, "album": "IV Life", "lyrics": "Christian Brothers man\nNo, (burp) excuse me\n(Watch your manners man, what the fuck is wrong with you?)\n\n[King Tee]\nCheck it out (keep on) boo-yaow!\nAh one-two, yeah bust it bust it\nWhat the fuck is goin' on man?\nAh one-two, who's comin' through the door?\nOh shit, well there he is! Tha Alkaholik funk in person\nYo, what should I do?\nPlay like Heavy D and \"Don't Curse\"\nHe's a mean one, no a clean one, he's the King hon\n(Sniff) I smell blunts\nHey, ask him has he seen one!\nIt doesn't look like he has blunts in his handles\nLooks, more like, a fifth of Jack Daniels\nLook what you dropped!\nSome crazy-ass shit for the listeners\nUp against the wall with the bitches\nDamn, I wonder why he don't got the Chronic like Snoop\nBecause he's from Tha Alkaholik group!\n(Oh yeah yeah that's right)\nThere's one thing that can be certain\nWhat's that?\nThey be mixin' Tanqueray with the Squirt and\nDownin' St. Ide's like water, oops smells like water (What?)\nLet's sell water, y'all can get looted\n'Cause King Tee with the stupid fat funk, hey\nWhat is this?\nAdvertisement\n\n[Hook]\nHah, ah one-two\n(When you're in that Benz)\nIt's advertisement\nThat's some shit, shit!\nYo, ah one-two (yo yo yo)\n\n[King Tee]\nDid you peep his walk?\nYeah he walks real cool\nI guess that bulge in his coat is a tool\nYeah but for what?\nFor those who don't know who he is\nThe neighborhood jackers that bum rush kids\nBut yo I think he's straight, it looks like a 9 millimeter\nYeah (pow-pow), nice to see ya\nLook, he's dressed like he just got released from the county\nWith a gang of little hoochies all around me\nWell he always been a pimp\nHaha, yeah that's true\nSince '85 with the K-Swiss shoe\nAww, you're buggin'\nNah man, that's the truth\nThey say, Tela got hoes like Luke\nFuck Luke!\nYeah his records kinda shitty\nKing Tee'll bust rhymes for the whole city\nHe's from Compton\nYeah, just like Most Wanted\nHe drives a grey beamer with the blue pearl on it\nIt's advertisement\n\n[Hook]\nAh one-two uh\nAh one-two\n*scratching*  (keep on)\nHuh, yeah, ah one-two\n\n[King Tee]\nWell, guess who got the fat shit for 1994? (Who is that?)\nAlkaholik crew\nYeah, I seen 'em on tour\nThat shit's wicked, wait, Oopsy Daisy, here's your ticket\nWe paid $20 to see E-Swift mix\nYeah he wrecks shop\nYeah that kid is kinda groovy\nRip the turntables then step with a cutie\nJust get down, get down, the man like Ed Lover\nYeah, take his picture for the cover\nAdvertisement"}]}