{"songs": [{"year": "2015-05-11", "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Dr. Kanye West Honorary Doctorate Speech", "lyrics": "Prof. Nick Cave: Kanye, you join us today to be recognized for your transformative, genre-defining work across music, performance, film, and fashion design. Your visionary and ambitious career is a true reflection of the creative spirit. So, by virtue of the authority vested in me by the Board of Governors of the School of the Arts Institute of Chicago and the Board of Trustees of the Art Institute of Chicago, I now confer upon you the degree of Honorary Doctorate of Fine Arts, Dr. West\n\nDr. Kanye West: I’m sorry, that was just my opinion\n\nI am a pop artist. So, my medium is public opinion and the world is my canvas\n\n“I’m sorry” is something that you can use a lot. It gives you the opportunity to give your opinion, apologize for it, and give your opinion again. People say you should not be sorry for your opinions. George Bush… has some very cool self-portraits. I didn’t know he was an artist\n\nI felt my nerves a bit, and I don’t feel that feeling a lot. The nerves of humility and modesty when being honored; a humanization, a reality of being recognized. And all I thought as I sit here kinda shaking a little bit is “I need to get rid of that feeling.” I need to not be nervous\n\nThis honor is gonna make your lives easier. Two reasons: you don’t have to defend me as much, and I’m gonna make all of our lives easier. And it’s these Floyd Mayweather belts that are needed to prove what I’ve been saying my entire life. Whether it’s the cosign of Paul McCartney grabbing me and saying, “It’s okay, he doesn’t bite white people,” or the New York Times cover, or the Time “Most Influential” cover, and now a doctorate at The Art Institute of Chicago\n\nWhen I was giving a lecture at Oxford, I brought up this school because when I went on that mission to create in other spaces – apparel, film, performance – it would have been easier if I could have said: \"I have a degree at the Art Institute of Chicago.\"\n\nThank you"}], "artist": "Kanye West"}