{"artist": "Yung Joc", "songs": [{"album": "New Joc City", "image": "https://images.genius.com/c8d5a7e86b7ff9f7536f527abd4fc252.500x499x1.jpg", "year": null, "lyrics": "[Hook: repeat 2X]\nEver seen a do or die, ride or die nigga (well I'm him)\nEver seen a nigga flip a pie quicker (well I'm him)\nWell have your ever seen a young fly nigga (I'm him)\nWell have your ever (I'm him) well have you ever (I'm him)\n\n[Yung Joc]\nI'm a grown man, lil' boy get gone\nThis is my life my hustle my song\nIs your maaaad? I'mma mastermind\nHit you with the fo'-five, leave your ass absent-mind\nMe a fuck boy? That's asinine (whassup with that?)\nAin't a nann 'nother Chevy out here fast as mine\nTwenty-six, no inch with the Alpine\nI meet a bitch, break a bitch in my pasttime\nI'm the truth dog, that's my word\nDo yourself a favor, don't get served (you don't want none)\nAnd if you got questions, here's the business\nGotta stay on top, of your competition\nIf your work good, just hold out\nSo when the drought come, e'rybody sold out\nThat's when your double up, and watch it bounce back\nDo that again times ten then your count that\n\n[Hook]\n\n[Yung Joc]\nIn eighty-eigh I took your J's and your bomber coat\n(Take it off nigga) Nowadays it's your J's and your bomber coke\nY'all cats turn gangsta on ProTools\nI'mma professional gangsta with pro tools\nYou got beef? Whoa man\nTo me you as soft as a wo-man\nBitches'll never know how I get mine\nWhen I put her on the track better get mine (bring it back shawty)\nYeah, that's how it's done 'round here\nQuiet as kept (shh) nigga I'm the Don around here\nNow check my rap sheet, I ain't a convict\nGo to jail, get right out, and they cut shit\n\n[Hook]\n\n[Yung Joc]\nI know a lot of cats, real hood niggas (what's happenin)\nSome steal, some kill, some good niggas\nBut they'll never be, quite like me\nI love the mighty dollar, that excites me\nYung J-O-C come see me\nI got heat, see it up close 3D\nI give you brainfreeze, I'm so raw\nLike coke turn your cabbage into coleslaw\nSqueeze trigs, split your wig like a mohawk\nYa brought it on yourself, it's yo' fault\nNow e'rybody on the block know who did it\nBut uhh, where your body and the dope? Man I hid it\n\n[Hook]\n\n[Hook] - 1/2 with instrumental fading out", "title": "I’m Him"}]}