{"songs": [{"year": null, "image": "https://images.genius.com/8bcb4f13231c32e3d05c93927a59e931.300x300x1.jpg", "title": "Girlfriend", "album": "The Purple Tape", "lyrics": "[Chorus]\nGirlfriend, boyfriend\nIf we together then tell me who's him?\nBoyfriend, girlfriend\nIf we together then tell me who's him?\n\n[Rapper Big Pooh]\nKnock, knock, knockin at the front door\nIf we together then tell me what you cryin fo'?\nWhy you all upset? What you lyin fo'?\nI'm just tryin to figure out who this nigga is\nBetter tell me somethin better than he here for biz\nNow I got a few questions, pop quiz\nPlease tell me this his first time at the crib\nMatter fact, why the FUCK he know where we live?!\nOh I get it, try to catch me at the studio\nSo you could run around, play the little house hoe\nAnd to think I almost made you my spouse yo\nI couldn't DREAM of this shit that I'm goin thru\nI put my life on the back burner just for you\nI believe what niggas told me wasn't true\nAnd to think this whole time I was playin the fool\nPut you out, put ya dumb-ass back in school\n\n[Chorus]\nGirlfriend, boyfriend\nIf we together then tell me who's him?\nBoyfriend, girlfriend\nIf we together then tell me who's him?\nKnock, knock, knockin at the front door\nIf we together then tell me what you lyin fo'?\nGirlfriend, boyfriend\nIf we together then tell me who's him?\n\n[Rapper Big Pooh]\nYeah, I packed everything you came with\nThe trash bag by the door, you a lame bitch\nI hope that nigga turn around and do the same shit\nHad ya heart broken up, that's how the game is\nYeah, I'm on my Oran \"Juice\" Jones\n+The Rain+ is the tears you can cry when I'm gone\nLuther told me that +A House Ain't a Home+\nWhen you cain't even trust ya main bitch with a clone?\nHow'd you let me find your secret out? No phone, tapped\nThe furs, the jewels, I need it all, back\nMater of fact, I'm thru talkin\nThat nigga waitin for you outside, START walkin!\n\n[Chorus]\n[Outro]\nGi-gi, g-g-girlfriend\nBo-bo, b-b-boyfriend\nGi-gi, g-g-girlfriend\nIf we together, then tell me who's him?"}], "artist": "Rapper Big Pooh"}