{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "The Other Line", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Verse 1: Breeze/Tariq & Heroine/Tammy]\nHello, good morning?\nGirl, I know the dawn and clear skies\nYeah they vibe just to honor the persona of my boo\nWhat are you smoking?\nListen to this one, you’re joking! You’re so funny!\nWhat happened, no money? What do you need?\nWhat do you mean?\nThe corny compliments, you playing with my confidence\nFuck around and consequence be dial-tone\nWatchin out, yo, I’m just like hey, what’s the deal\nBut you want some steady ballin’\nHold up, wait a minute, girl, this nigga got a call\n\n[Interlude 1: Breeze/Tariq & “Niecy”]\nHello?\nWho this?\nThis Tariq, who this?\nThis Niecy, where Tru at?\nHe stepped out\nWell, you tell that worthless, pathetic deadbeat motherfucker\nOh, yo, yo, not for nothing, I’m on the other line\n\n[Verse 2: Breeze/Tariq & Heroine/Tammy]\nSorry, Tam!\nSorry, damn right, Tariq!\nMight I speak?\nState your claim, rather, state your game, having fucking fun?\nWhat I done? You sorta grimy!\nFrom Caller ID, you with Tru, shit, no surprise!\nSo?\nGimme the lies\nWhat’s the new shit? His grandmother died again? Give my love\nYou got in an accident, oh my God, are you okay?\nYou got abducted on some X-Files shit from up above?\nWhatever the fuck, I ain’t calling your job, nope, no way\nI guess you know it all?\nYo, listen, I don’t know nothing\nExcept I’m getting sick and tired of helping y’all niggas frontin\nFor real, them people at your job done heard it all\nYou gonna get fired, Tariq!\nHold up, girl, I gotta get this call\n\n[Interlude 2: Breeze/Tariq & “Tray-Bae”]\nHello?\nAyo what’s up it’s Tray-Bae, let me speak to the god\nWhat’s the deal?\nYo yo yo, I gotta pay the rent, son, I gotta speak to the god\nYo, he kinda busy yo, I think he just stepped out\nOh he definitely just stepped out\nI’ll run this by him on this other call\nAyo, peace, one love\n\n[Verse 3: Breeze/Tariq & Heroine/Tammy]\nOkay, you half-right, I’m calling you to call my job\nBut girl, this here’s the last—\nRight, the last time? That’s what you said the last time\nTariq, you gotta stop playin\nLook here, that’s what the fuck I’m saying, girl\nFor real, I’m working on some big shit\nSo what you saying?\nI ain’t saying a word, I ain’t tryna jinx it\nSo you fixing?\nTammy, trust me, it’s something like an interview\nFor more money?\nNo doubt!\nBut wait a minute, why I’m calling in for Tru?\nIt’s like a hook-up with his peoples\nI done heard some stories about ya boy\nTariq, is this shit legal?\nLove, this shit is all legit, but check it out, I gotta go\nYou gotta know by now I’d do anything for your stupid ass\nI know that, girl, good looking, for real\nBut yo, this best be the last time\n\n[Refrain]\nSomeone’s calling on my phone\nSomeone is ringing my bell\nSomeone’s calling on my phone\nSomeone is ringing my bell\nSomeone’s calling on my phone\nSomeone is ringing my bell\nSomeone’s calling on my phone\nSomeone is ringing my bell\nSomeone is ringing my bell\nSomeone is ringing my bell\nSomeone is ringing my bell\nSomeone is ringing my bell", "year": "1999-02-23"}]}