{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "3 Strikes Ya’ Out", "year": null, "album": "IV Life", "lyrics": "{*whispered*}\nLove me.. give me love..\nGive me love food..\nGive me love, so that I can.. kill..\nGive me love, because I can.. kill..\nHe's not real.. (the devil) and she must die..\nDie.. (he is the son of man, he is the son of God)\n{*beat drowns out whispered vocals*}\n\n[King Tee]\nThree strike you're out they're makin niggas behave\nNo more slaps on the wrist gettin 90 days\nWelcome to the next level, it's the new world order\nSnatch ya like a tractor, might kill ya for a quarter\nI put that on my moms, that's on everything I love\nNigga what? Catch a L, make you cry like a dove\nSo sucka free is the only way for me\nYou don't get paid just for bein O.G\nWe've been had, we've been tricked, we've been played\nRight when we, went left, for what? We shoulda stayed\nStressed all the homies just to show they mean business\nRushed 'em with the quickness, killed 'em with the sickness\nTried to save his life, give him CPR, huh\nSomethin for the lungs, fat African drums\nSo clear up your sinus and keep your nose clean\nKhakis so hot it makes the one-time stop\n\n[Hook]\nThree strikes, you're out, then a nigga pays\nWe in the cage, black man is bein slayed\nThree strikes, you're out, then a nigga pays\nWe in the cage, black man is bein slayed\n\n[King Tee]\nGet with the lyrical miracle whippin up\nGingerbread cookies out you rookies, huh\nI can't stands no more, grab the floor\nHit the deck when I let loose the tec (c'mon)\n'Nique, freak any beat nigga\nWestside 106 (?) Street, uhh\nThe loco's, chocolate like cocoa\nGet your punk-ass balled up in the trash (AHH!)\nYou stepped on my stars, motherfucker say sorry\nThis wild style's like lion country safari\nThis is for my loc's back at the Ponderosa\nCheck my file, bring it to trial\nGet with that new, ninety-fo' shit\nYes it's funky like a jackass, don't even trip\nI got pages and pages of metaphoric phrases\nToo complex for the human eye to catch\nIt's the, gangsta boogie, do you want a example\nOr do you just wanna taste a sample?\nOut of control, gone, warped, zoned, toned\nHand me the heater, I need the speakers\nSparks, flames, no name but peep game\nSmoke like a choo-choo train\nIt's the criminal minded nigga King Tee\nWith the Westside Riders, comin creepin crawlin like spiders\nWe've been bit by the dog, call the catcher stretcher\nJudge Fletcher betcha, raise your blood pressure\nThe unsolved mystery, mixed up our history\nPut us in the twist, we no longer exist, like\n.. dinosaurs dissapeared, then it's like\n.. mine and yours dissapear, so it's like\nServin soon, here comes your doom\nRight when the world go ka-boom, so am I\nSane, or, sick in the brain?\nOr do everybody style sound the same? (Yep)\n\n[Hook] - 2X\n\n[Outro]\nYeahh... beat terrorist.. (?)\nTR, the funk ignitor\nMy nigga King Tee with the funky West shit right?\nCheck this out..\nBeat terrorist, beat terrorist, beat terrorist, beat terrorist, (?)"}]}