{"songs": [{"lyrics": "Hunters with their dogs and deer rifles\nThousands of them line the pavement\nLike patient pupae waiting to become worms\n\n[Sample: Mr. Lif]\nThe people are dead, but the money keeps talking keep-keeps-keep-keeps talking\nThe people are dead, but the money keeps talking, keep\nKeeps-keep-keeps talking\n\n[Aesop Rock] + (El-P) + {Mr. Lif}\n(Another dark night) Teething I'm marking a beast sheep\nLike I walk in front of 39 thieves in a \"v\"\nSmores over warm helvetica brown proper\nFor the odd God or monster, propped to teleprompter\nWild blue yonder, blue in the face, angel\nBlew into the bugles in lieu of the euthanasia\nUsually the shooter community chew the corpse\nBut I see the wolves have already gotten to you and yours\nDay of the dead, play the ledge closely\nTrain a barrel of monkeys to aim at the lowest bogey\nDope the gonzo I've always felt choked socially\nStole the golden fleece with the culture of total nobodies\nEarth rised, divided by fighting tribes\nAll we do is watch 'em waddle back and forth lighting fires\n{Money money}\nDetonator, wire cutter, pliers\nTwo cities enter, one is broken up in tiny tiles\nAnd I wonʼt pose arm in the heart of the lionʼs throat\nFor a photographic token of my primordial growth\nYou parade around and kill, so damn proud\nLike a flatline fetish, had it's feathers fanned out\nWar taught him symmetry, skipped into it gingerly\nSilk worms ping-pong ministry to ministry\nHell's bells every which way the the wind blows\nSo I bang my head against any wall you can build, go\n\n[Hook: El-P]\nAnother dark night, another not alright\nAnother bad ritual, more botched surgery\nBetter follow the bread crumbs back in fact, urgently\nOr waddle through this section where the natives feel \"murdery\"\nVicinity wander, claim no soul\nNever let an anchor drop\nNever had a home, never talk to strangers\nNever trust a friend\nThis is the life and the life will not end\n\nMoney (Repeat 8x) - - ] Mr. Lif\n\n[Aesop Rock] + (El-P) + {Mr. Lif}\nNext time think\n39 thieves are quicker than 40 winks...\nRaise your drinks\n39 thieves are quicker than 40 winks\n\nWe're not concerned with the community aloofness\nDude, we're animals, we just go where the most food is\nLower the toast, most formal etiquette is useless\nTruth is you're equally expendable if spoon-fed\n{Money money}\nMoney is cool, I'm only human\nBut they use it as a tool to make the workers feel excluded\nLike the shinier the jewel the more exclusive the troop is\nBullets don't take bribes stupid, they shoot shit\n\n(Another dark night)\nCalicos tread around the rabbit hole\nWeapons to the heavens and arsenic where the carrots grows\nPiss warm sugar water, what a summer canteen\nPlus burned rubber like \"green is the new green\"\nRubber neck froze, slows by the multiplex\nRodeo commotion, I'm open to see what culminates\nBougie on the right, left rep rebel force\nBoth say the feud will prove the parking lot was never yours\nBlack top pebble wars\nSoldiers molded where the jonesʼs every grown-up\nWants decoded came to grow in\nNo motive, it showed up in gross quotas\nHog barn burner come see if your homes hold us\nEighty-five rattle-trap parked and fancy\nYou could swear he was stepping out of Comanche, antsy\nLet us in the jetty when they jettison the medicine\nAnd paranormal hatchet and cadets to break the levees in\n{Money money}\nBoth know the totem camaraderie\nToken of equality, they post it horizontally\nCrown the golden loading dock, they crawl to lodge the colony\nHalf-mast flags, half cabs loiter properly\nAnd sleep the sleep of the just ready on the left\nWhere the witchcraft spun out of a neighboring sect\nWith the usual undesirables and the big brother cutters\nOn the day your name became \"This Motherfucker?\"\n\n[Hook: El-P]\n\n[El-P]\nThis-is-the-life (Repeat 3x)\nThe people are dead, but the money keeps talking - - ] Mr. Lif\nThis-is-the-life\nTalking - - ] Mr. Lif\nThis-is-the-life\nMoney money - - ] Mr. Lif\nThis-is-the-life", "title": "39 Thieves", "album": "None Shall Pass", "image": "https://images.genius.com/3d6c4d11084714cc67f880d71310d197.288x288x1.jpg", "year": "2007-08-28"}], "artist": "Aesop Rock"}