{"artist": "Westside Gunn", "songs": [{"year": "2019-07-05", "lyrics": "[Chorus: Westside Gunn]\nAyo, I want me and my niggas to have back-to-back yachts\nLick the M16, I got one on my opps\nOne nigga thought he had hops, he tried to jump the fence\nLord, why he do that? His kids never seen him since\n\n[Verse: Westside Gunn]\nLord (Ah), threw him in the shower with the chainsaw\nThe cocaine war, give up the waps, take the chain off (Boom boom boom boom)\nBleed the wall, wipe the brains off, 'caine rain cough\nI pray to God that the scale ain't off (The scale ain't off)\nThe Prada slippers, jewelry glisten, pull up, half the roof missin'\nRuth's Chris, stuffed chicken gettin' fed by two bitches\nTyin' up the loose enders\nSmack 'em with the forty, now his tooth missin'\nLaid 'em on the table, had to pool stick 'em (Ah)\nIt's glory, it's glory, it's Flygod (It's Flygod)\nAyo, I want me and my niggas to have back-to-back Dracos\nKeep shootin' his house down 'til I say so\nI got the yayo, my nigga doin' thirty in Laredo\nYou still got the time and date, though\nWe not the same, yo (Not the same, yo)\nThe shit ain't even bust down\nShit ain't even bust down (Shit ain't even bust down)\nAyo, the shit ain't even bust down (Ayo)\nThe shit ain't even bust down\nMy Colt pop like particle, cappin', ho\nMy microwave rock and roll, let's lock and load (Ah)\nTiffany handles on the white gold stones (White gold stones)\nThirty in the oven, these niggas say I'm buggin' (Niggas say I'm buggin')\nI'm on the yard with the bone crusher like a lunchin'\n(Like a lunchin', like a lunchin')\n\n[Chorus: Westside Gunn]\nYo, I want me and my niggas to have back-to-back yachts\nLick the M16, I got one on my opps\nOne nigga thought he had hops, tried to jump the fence\nLord, why he do that? His kids never seen him since\nLord\n\n[Outro: Keisha Plum]\nImagine if this was the last poem I write\nImagine your moms snortin' lines of white\nImagine the feeling when the judge gave him life\nImagine if Westside Gunn never touched the mic\nOr imagine if Con never got shot\nImagine if time just stopped\nImagine if all of this and then imagine it again\nIt's Griselda Records 'til the fuckin' end\n\n[Skit]\nUh, Gucci, and, uh, you been a longtime supporter, you still supporting after the controversies?\nWhat controversy?\nI'm sure you heard, you know, black, you know, they, they had the blackface sweater and, you know, a lot of prominent artists, dropping them, you know...\nMan, listen, I don't got nothin' against nobody\nReally?\nUm, my thing is this, I support everybody I like, everybody, and my thing is this, I like to live life and do, and do what I like to do. I'm not no follower, I do what the fuck I wanna do\nRight\nBecause everybody say, uh, wear this, or don't wear this, I'ma wear what the fuck I wanna wear. I'm 'bout to go into Gucci\nWere you disrespected at all by the whole blackface controversy?\nI'm 'bout to go into Gucci", "image": "https://images.genius.com/cba8fa98f034da65ce2df6fa9da711cf.1000x1000x1.jpg", "album": "Flygod Is An Awesome God", "title": "Lunchin"}]}