{"artist": "Anderson .Paak", "songs": [{"title": "Drugs", "album": "Venice ", "year": "2014-10-28", "image": "https://images.genius.com/191886c169efed5bfde4d7c531629aca.1000x1000x1.jpg", "lyrics": "[Hook]\nShe don’t give a fuck\nShe don’t ever stress me\nWe don’t even talk\nAll we do is sex and leave\nNo there’s no love\nShe don’t even like me\nBut if we have drugs\nShe can be my wifey\nWhen we have drugs\nWhen we have drugs\nWhen we have drugs\nWhen we have drugs\n\n[Verse 1]\nI got lost up in it, got lost up in it, got high for a minute\nSaid my lust for life and these lights are bright and I love these women\nSaid we bopping slow and we do the dance like we more than winning\nSaid she off the beat but she’s fine as fuck so I find the rhythm\nNo love is greater, in this whole world we made up\nThis love is made-up, it’s made-up\nIt’s made-up, it’s made-up, it’s made-up (say, aye)\nI don’t know this bitch but I love this shit and we both feel splendid\nAnd she loud as fuck so I grab and touch and she don’t get offended\nThey goin call the law if we don’t get lost in parking lot\nShe don’t like me dog, she just like the drugs my nigga, don’t get it twisted\n\n[Bridge]\nHow many more can you give to me?\nHow many more can you give to me? I know you’re feelin me\nGrinding and biting and kissing me\nWho gives a fuck bout your history? nobody mentioned it\nI coulda taken them all, I coulda taken them all, look at me dog\nLook at me dead in the eyes, tell me you ain’t in love\n\n[Hook]\nShe don’t give a fuck\nShe don’t ever stress me\nWe don’t really talk\nAll we do is sex and leave\nNo there’s no love\nShe don’t even like me\nBut if we have drugs\nShe can be my wifey\nWhen we have drugs\nWhen we have drugs\nWhen we have drugs\nWhen we have drugs\n\n[Verse 2]\nYou my one and only, my one and only, I’m on one homie\nI don’t know your name I just love that ass, and I’ll pull that pony\nSaid I hate the club, but I make the club when I walk into it\nSaid you hate to drink, but you take the drink when I offer fluid\nNo love is greater, in this whole world we made up\nThis love is made-up, it’s made-up, it’s made-up, it’s made-up, it’s made-up\nI can say right now that I’ll lay you down, I got lots of rubbers\nI don’t give a fuck, you don’t give a fuck, we was made for each other\nYour friend ain’t cute but my nigga’s a trooper, he’ll take the L\nI’m high as fuck and you high as fuck so we parasailing\n\n[Bridge]\nHow many more can you give to me? How many more can you give to me? I know you’re feelin me\nGrinding and biting and kissing me, who gives a fuck bout your history, nobody mentioned it\nI coulda taken them all, I coulda taken them all, look at me dog\nLook at me dead in the eyes, tell me you ain’t in love\n\n[Hook]\nShe don’t give a fuck\nShe don’t ever stress me\nWe don’t really talk\nAll we do is sex and leave\nNo there’s no love\nShe don’t even like me\nBut if we have drugs\nShe can be my wifey\nWhen we have drugs\nWhen we have drugs\nWhen we have drugs\nWhen we have drugs\n\n[Outro]\nAyyy, Ayyyyy, we have drugs\nWhen we have drugs\nSaid ayyy, We love it, we’re in love\nWe’re in love, we’re in love, we’re in love\nSaid ayyy, yes lord\nAyyy, shout em niggas ayyy\nSame\nSay love, say love, say love"}]}