{"artist": "Fat Joe", "songs": [{"year": "2005-06-14", "album": "All or Nothing", "image": "https://images.genius.com/07b605de3e64892070232ced7e01e190.1000x1000x1.jpg", "lyrics": "[Hook: singer repeats 2X]\nI can do you, do you, better better better than he can, baby baby\n\n[Fat Joe - over Hook]\nYeah, uhh, it's Cook\nThe voice is so floetry, it's so magnetic\nHahahaha, aowwwwwww, Al. B Sure attracts the ladies\nSeriously, uh, yo - aowwwwww\n\n[Verse 1: Fat Joe]\nI don't usually do this, but I\nHad to push upon you, excuse if I stutter\nD-d-d-DAMN, it gets no better\nI'm pretty sure you heard it flies no matter the weather\nGot a girl, you got a man, this'll be our secret\nHe plays for the Heat, well that's so convenient\nI'm at the games all the time\nWhile your man runs game, it's a shame how he lies\nI can lend a little more than a earful\nI know ma, you're more than a Dior and a hairdo\nYes, furthermore let me prepare you\nNow get it on the floor ma, don't mean to scare you\nBut I'ma, punish that, then run it back\n'Til the sun come up, you screamin let us Crack\nNow how you do that, that thing when you do that\nMa if I could sing, I would whisper to you that\n\n[Hook]\n\n[Dre over Hook]\nOh yeah? C'mere pretty girl let me talk to you\nOh what? You just got off the phone with who?\nWith Crack? C'mete pretty girl let me talk to you real fast\nDaaaamn!\n\n[Verse 2: Dre]\nDamnit baby, let me talk to ya\nFly, put your cell back in your purse, let me tell you why\nA nigga like me gotta be in your life\nDamn this evening is nice, let me share some advice wit'chall\nHmmmmmmm, hmmmmmmm\nYou're lookin like you need a reason to smile\nYou're lookin kind of... welll, lookin kind of right\nHas anyone ever told you you look like Karen White?\nSprinkled with some Beyonce, a little bit of Janet Jackson\nWay before them actions, girl quit actin, like you ain't feelin me\nWhen you feelin me damn baby please get up off your kneeeeeeeez-ah\nWooooo! Yeah\n\n[singer]\nAnd we can flow, we can fly, we can do it ba-ba-ba-byyy\n\n[Dre over singer]\nSay what? Uh-huh, c'mon, yeah, let's, now let's go\n\n[Hook]\n\n[Verse 3: Fat Joe]\nYeah, uhh - aowwwwww\nYeah, yo, uhh\nWhat'chu know about your main man Flow Joe?\nChicks say I resemble that nigga Boss Kojo\nAnd the way I move is oh-so-fly\nMa take a look in my eyes and jussssssssssssssssst\nHa ha, watch yourself\nYeah I know them doors swing open awkward\nMan I don't know why they made 'em like that but\nSip some Patron, slip off your clothes\nGirl let's get it on, ma turn off your phone\nCause we don't need no interruptions\nHop on your good foot, let's get into somethin\nAowwwwwww - and don't it feel so right\nGot a T you can wear for the rest of the night\nYup, yup, yup!\n\n[singer]\nAnd we can flow, we can fly, we can do it ba-ba-ba-byyy\n\n[Fat Joe over singer]\nYup! Yup! Yup! Uh-huh, haha\nGot me feelin like Teddy, now let's go\n\n[Hook] - 2X", "title": "I Can Do U"}]}