{"songs": [{"title": "F-U (Fuck You)", "lyrics": "[Hook]\nFuck you, fuck you\nFuck you, fuck you (Tell a hater I said)\nFuck you, fuck you (Pussy)\nFuck you, fuck you (Tell your bitch I said)\n\n[Verse 1: Yo Gotti]\nMe\nAss up, face down\nOne night only, I'm from out of town\nPound, new rules we ain't waiting on it\nAnd if that pussy good we spend a cake on it\nPlane ticket, hotel, new bag, new Chanel\nGiuseppe sneakers, his and hers\nIf you a hater I just got two words\n\n[Hook]\nFuck you, fuck you\nFuck you, fuck you (Tell a hater I said)\nFuck you, fuck you\nFuck you, fuck you (And tell your bitch I said)\n\n[Verse 2: Yo Gotti]\nYou, and the bitches that you came with\nAll in my section drinking my shit\nYou ain't fucking, you ain't sucking what you doing ho?\nInstagram and taking pictures, but you don't know me though\nDamn, she said that she a fan\nYea I understand, but I want to get in her pants\nCause she thick as fuck and she sticking her tongue out\nShe said she don't fuck with rappers\nAnd I'm like what you talking about bitch?\n\n[Hook]\nFuck you, fuck you\nFuck you, fuck you (I got two words for you)\nFuck you, fuck you\nFuck you, fuck you (Tell a hater I said)\n\n[Verse 3: Meek Mill]\nOh, I said fuck ‘em\nI don’t like 'em, I don’t love 'em\nWhen the money come\nHomies turn to haters, I don’t trust 'em\nIf the brick ain’t coming with a stamp, I don’t touch it\nI want that BMF with the Scorpio when I’m bustin'\nLike a bitch when she twerkin’, y'all niggas workin'\nClown ass niggas, we should put you in the circus\nIn the cage with the lion, let him have you for dessert\nAnd testifying on your homie, took a deal, but was it worth it nigga?\nI met this bitch, she said “my friend, she want to fuck you\"\nI like your friend, but really though, I wanna fuck you\nAnd if I get my roadie though, he gotta to fuck too\nNow put your middle fingers up and scream\n\n[Verse 4: Yo Gotti]\nHaters, nigga mad at the paper\nBig crib, ten cars, twenty acres\nTwenty chains, ten watches, I'm a jewler\nLil’ watch with the jest, don’t let it fool you\nI could school you on how to look like money\nHustler of the year, could write a book ‘bout money\nDon’t pop them bottles tryna impress them hoes\nWith your re-up money better tell them hoes, bitch\n\n[Hook]\nFuck you, fuck you\nFuck you, fuck you (Tell a bitch I said)\nFuck you, fuck you\nFuck you, fuck you (Tell a hater I said)", "album": "Nov 19th: The Mixtape", "year": "2013-11-19", "image": "https://images.genius.com/1eb099b80721e25afbf1a53829623641.940x940x1.jpg"}], "artist": "Yo Gotti"}