{"artist": "Asher Roth", "songs": [{"title": "Fuck Up Da Fun", "image": "https://images.genius.com/e7be0abebf7a2ead2080b2dbd056152e.500x500x1.jpg", "album": "The Greenhouse Effect Vol 2", "lyrics": "Who want it?\nWho-who want it?\nGimme 4 5’s at the door for a 20\nTell ya grandma I'm a need more money\nAnd we getcha wide eye little Steve Buscemi\nReady, steady, Chase like I'm Chevy\nGotta make a move like I need a new tenant\nStarted with a tune got the whole room pregnant\nNow one dudes cool, now there’s one too many\nPetty, Freddie, nah don’t sweat it\nIn the top 5, now I’m ten times better\nKept me outside, and I come back dreaded\nWith a thick patois, like what now boi (boy)\nWoolly, Bully, bang bang bullet\nLet that thang rang, when I slang slang fully\nWe got gang bang, when I think things gully\nBut the big bank game getting strange like a mullet\nHoly Moly, boy look at him\nMore like Tom Boyd when he's bored in the gym\nWhatcha die for, was it poured to the brim\nReported by George or According to Jim\nRecord for the win, horde for the grim\nDrawing and scoring, restoring the Zen\nLord I adore him the story of Lin\nWhen you thrive on the court in New York and then sent\nDown in the South where I'm browsing about\nAnd my style's unbalanced a cow to a mouse\nVowels can vouch style don’t slouch\nBouncing a thou’, for a thousand an ounce\nNow's for the towel, stick around for the bout\nArousing aloud, you could tell how i tout\nPound for the pound, knock him out for the count\nWhen I 1-2-3-4-5, yo he’s out, Choi\nYo he’s out\nYou feel me though?\nWho want what? I can dance on the floor\nWith two left foot\nWhen I stand with a sword, making nuance cut\nMake a man unsure, got his two nuts cup(ped)\nGod damn so pure only two buck chuck\nNo Zanax, the poor, I don't do that stuff\nI've been sayin, I’m sore, till I (blew out?) lust\nRuss Brand Richard Brandson a dual mesh off\nIt’s a true best of\nUnderstand it's a sham and your plans a no no\nMe and this rap game\nIt's like T and cocoa\nWaiting for the shows doing jams and go go\nFor those who don't know it\nIt was ropes and go mo(re)\nHoes’ go broke, with the blow up their nose\nShow's a bozo, but oh you dodo\nDough was so low don't impose the growth bro\nKnow your role ho, I flow pro bono\nYou two don't get shit confused\nI bruise if you goose\nAnd ooze like prune juice\nLose a tooth goofin’ off you goof troop\n(First half?), Say doof like who’s who\nBooze and brew, boobs, and boobs is what I do\nDude enthusiasts get moody when I come through\nShow the true meaning of brilliant evolution\nOnly a true theory, now Judas, ya don’t be rude\nFood for thought\nWars were fought over a god\nThanks a lot dog\nNo wonder they say you’re fraud\nPacs got shot making strange, insane, odd\nThey take our best men and lay them up in the sod\nAin't a façade, I parade in a fog\nAnd I pray for the day we can stray from the sob\nChanging the game, you can thank when I'm gone\nGet the one thing straight, I am great when I'm on\nStrong\nHella strong\nLook at these huge biceps", "year": null}]}