{"songs": [{"lyrics": "[Don Bishop Agallah]\nUh-huh\nHappy Valentine's Day to all the ladies out there\nI know some of y'all ladies is lonely, hurt, y'know\nDisgusted with, with a nigga bullshit, y''know but uh\nY''know it's hard to forgive a man, and build forgiveness\nYou know you'll never forget, y'know?\nCheck it\n\nThe chemistry was crazy from the get-go even though she was a trip though\nMade me realize runnin these streets ain't shit though\nReal love, formed simple and rough, turn it gentle\nPut the physical aside and I'll get inside your mental\nOverreact, from all of this passion and pain\nAnd we can try this again, but it'll never be the same\nIf we start it all over, it'll never be a change\nFind another player to go and try to entertain your games\nGhetto girls need real love, lookin for a real thug\nNo time to go back and see what the real was\nThey say you find love on a two-way street\nWell I had a bad accident at the wheel fallin asleep\nThe woman asked me, what kind of girls do I keep\nWhat type of, man that I am, what kind of goals did I seek?\nA good girl's hard to find with an intelligent mind\nSo let me know boo if you ready to shine\n\nIs it yessss? (You already know the answer)\nOkay so let me know if you gon' ride with me\nYou gon' shine with me\nBottom line is you gon' die for me?\nIs it yessss? (Baby, my love)\nTo all the ladies out there, it's your boy Agallah\n(And I'll be faithful, I'm for real) You know what it is\n(And with us you'll always know the deal) Uhh, yeah\n(Been too gone, for too long - and I can't be without you baby)\n(And I'll be waitin up 'til you get home - cause I can't sleep without you baby)\n(If anybody who's ever loved you know just what I feel)\n(Too hard to fake it, nothin can replace it)\n(Call the radio if you just can't be without your baby, yeahhh)", "title": "Be Without You Remix", "album": "Propane Piff", "image": "https://images.genius.com/ab353b8de59632f23966d854de3b262e.360x360x1.jpg", "year": null}], "artist": "Agallah"}