{"songs": [{"lyrics": "I pilot a lion heart\nMy polar halves negotiate it (right)\nShook upon the difference between tumbleweed and sacred\nRead a hostel gospel attributed to land shark Apostle squad\nUnfroze the hideous image like hostile plots\nBat up in the belfry (help me)\nI wanna be the reinvention of fire\nIn a most stagnate tension basket\nFenced in a cognitive learning facility built by the makers of stinger repellent\nBut fresh as the active element\nBag of bricks roped to a Saturn atlas hooked to madness\nAnd I swear my new fresh air till the goblin cried, \"fuck the rabbits\" and rose\nMost soloists cannot defend the mighty kingdoms that their passages propose, that's why I am the rose\nNew day, new reign, same old\nAches and pains, same old\nEmaciated frame game, same name\nSpring water ain't enough anymore\nI wanna see the river and bottle my own crystal drizzle liquid dinner\nWell aren't we the phoenix of irritant method\nHere to steer the flock out the farmland while every shepherd rested\nWith a, head on the wall\nOf sovereignty's halls\nI be the head shaker in a sea of nodding novelty dolls\nLet's, crush the arena\nFlush the pipe dreamer\nTouch the skull of each and everything\nEverything everything\nI am a scarecrow\nBullied by the bullies\nBut the masters had 'em walking in circles like eye patches\nFor the madness\n\nOne day, one ran\nOne cold, one poem\nOne way, one plain\nOne rose, one home\nOne strain, one pain\nOne fold, one zone\nOne element to many to made a hungry man moan\nI'll be leavin now (I'll be leavin now) (it's not cool)\nI'll be leavin now (I'll be leavin now)\nI'll be leavin now (I'll be leavin now) (na-na nana na-na)\nNo I'll be leavin now (I'll be leavin now)\n\nEverybody plug into the bludgeon\nFollow your hunch and align the hunt collection\nTo count their blessings in abundance\nOnce in a crescent moon I'll adapt\n\nTo capture the essence's breakfast's participant's fishin' dissin' adventures\nHeads gather from every battered aspect of the march\nTo swap gossip\nWho parted what sea? and\nWho's hungry? and\nWho's parched?\nAnd it gets tiring wiring the populace an anti grin and list of accomplishments\nBeyond basic. Residence\nStick figures stand at attention, deficit\nAnd all's well that blends well with a warm hazardous combine\nThick as thieves are they?\nI bullied the wooly mammoth and champs\nGerminate frantic decamped to the wino migration, examine\nEager to sport motley mosaic illustrate fallen pen-dragon\nI'm from a room flooded with punishment\nI've seen drunken sailors pilot they vessels to split the light house\nLaugh at brown bag liquor list on there way home from the blood bath\nHalf angel with broken halo; half primitive rugrat\nSpoken for by wild life's hybrid mutations and slum cats\nDoom for dominion sluggish posture\nSee I wait a lifetime just to pierce these spears through the bellies of every monster\n10 little warriors sit on a picket fence\nOrdering themselves for protection of nonsense\nCatapult the stone that struck the leader in the back and\nMarked the beauty as the other 9 warriors worlds collapsed\n\nOne day, one ran\nOne cold, one poem\nOne way, one plain\nOne rose, one home\nOne strain, one pain\nOne fold, one zone\nOne element to many to made a hungry man moan\nI'll be leavin now (I'll be leavin now)\nI'll be leavin now (I'll be leavin now)\nI'll be leavin now (I'll be leavin now)\nNotice I said I'd be on my way out the door\nI'll be leavin now\nI'll be leavin now\nI'll be leavin now\nI'll be leavin now\nI mean the doors almost closed\nI'll be leavin now\nI'll be leavin now forget it\nI'll be leavin now\nI'll be leavin now\nI'll be leavin now…", "title": "The Active Element", "album": null, "image": "https://images.genius.com/64fbb9620a6b5e79e87c654b74da5441.640x640x1.jpg", "year": "2000-03-07"}], "artist": "Aesop Rock"}