{"artist": "C-Rayz Walz", "songs": [{"title": "Spit Hard (Renegade Remix)", "album": "Off the Radar: Exclusive Lacerations", "year": "2003-09-25", "image": "https://images.genius.com/45bc71d58be69256a0b5f9c5f3abc51d.1000x1000x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nCome here to waste no time.  Spit hard or don’t spit at all.  Spit hard bars.  Keep rocking the mic.  Spit hard.  This is no ho’s bars\n\n[Verse 1: C-Rayz Walz]\nSpit hardballs—I ate the jail cell\nA hot boy for real.  What the deal?  I made hell\nTo come out right and dumb out like\n“Yo!  I’ll get my day together after I break night”\nI break records—mostly wack vinyl\nI’m a Bad Boy—don’t let my Shyne blind you\nI bling like cash registers in microwaves\nThis beat got me flipping like Psycho Rayz\nBut see, Walz is the name I claim\nI spit so nasty, I’ve actually stained my fame\nAnd it won’t come out like white pants with grass stains\nBlast brains out the side of your frame at close range\nI want change, treble, and bass\nTo the point my impact might crack a track and level the place\nAll devils gets chased ‘til I catch a case\nLike a UPS worker with a box in your face\n\n[Hook: C-Rayz Walz] (x2)\nSpit hard!  Keep rocking the mic\nSpit hard!  (Yeah!)\nSpit hard!  Keep rocking the mic\nSpit hard!  Bitch, no ho’s bars\n\n[Verse 2: C-Rayz Walz]\nWhat's a hot verse without a fire chorus?\nI’ll knock you out, punch you in the Eye of Horus\nHuman gat rap clapped off safety\nToo much games out right now to play me\nSpit it off top like sunroofs with a Uzi out\nAnd bubble in the place to be like Jacuzzi house\nHorrible like Hägar, Hawkmen in the hood\nFly killer.  Wish you would and could touch mine\nThat’s my dick.  Don’t clutch mines\nI’ve been spitting rhymes since Monroe High School lunchtimes\nPicking rhymes in stairways.  My lines is hearsay\nStupid critic.  When I spit it, you hear what I say\nPolitic with smart niggas on dumb blocks\nA place where basslines sound like gunshots\nWhen the cops come, the fun stops\nWhen I spit heat, you see sunspots and get burned without sunblock\nCome/cum watch like sperm on your clock\nYou should work for my knuckles and start earning your knots\n\n[Hook: C-Rayz Walz] (x2)\nSpit hard!  Keep rocking the mic\nSpit hard!  (Yeah!)\nSpit hard!  Keep rocking the mic\nSpit hard!  Bitch, no ho’s bars\n\n[Verse 3: C-Rayz Walz]\nSteel cage match, 12-gauge rap\nIf you feel Rayz’ clap/Rayz, clap—what a powerful impact\nIn the zone, smoking bones alone with “Bones” Malone\nCutting spades the same way I scraped your dome\nBases loaded—right here’s where I take it home\nYour face exploded from being laced with a basic poem\n(Spit hard!) Like I’m chewing a stone\nTo a glass pipe (Yeah!)—still rocking a mic\nDropping it like a shot—you get wobbly, wobbly\nLike crooked cops on block who try to follow me\nNothing I splash is weak.  I speak like acid leak\nPlay it to the rhythm and give ‘em a masterpiece\nDoomsday dialect dominate dialogue\nChange your dull college dorm to a dancehall (Dope)\nI’m heroin, crack, X, liquor, and weed\nI’m Brand Nubian—I “Slow Down” to catch speed\nI’ll slap MCs who don’t spit hard like C\nAnd the front row is beef—prepare to catch teeth\n\n[Hook: C-Rayz Walz] (x2)\nSpit hard!  Keep rocking the mic\nSpit hard!  (Yeah!)\nSpit hard!  Keep rocking the mic\nSpit hard!  Bitch, no ho’s bars\n\n[Bridge 1: C-Rayz Walz] (x8)\nSpit hard!\n\n[Bridge 2: C-Rayz Walz]\nNo ho’s bars.  No ho’s bars\nSpit hard!  Keep rocking the mic\nSpit hard!  Keep rocking the mic\nSpit hard!  (Bitch!)  Keep rocking the mic  (Yeah!)\n\n[Outro: C-Rayz Walz]\nKeep rocking the mic.  Keep rocking.  Keep rocking.  Keep rocking.  Spit hard!"}]}