{"artist": "Webbie", "songs": [{"year": "2016-05-20", "lyrics": "[Intro: Webbie]\nHuh, What? [x8]\n\n[Hook: Boosie Badazz & Webbie]\nNigga, do you gotta problem?\nCause you can get exposed\nHope you got your hittas let 'em know\nNigga, you fucking with a problem? (A problem)\nWe be throwing 4's (4's)\nStomping out niggas like the zone\nNigga, we solve problems (problem)\nWe come to your door\nKnock, knock, chop, chop (knock knock knock knock knock...)\nHere we go\nCause we heard you had a problem (A problem)\nGotta problem, nigga? (A problem)\nGotta problem, nigga? (A problem)\nGotta problem, nigga? (A problem)\n\n[Verse 1: Boosie]\nI went to gutter school, Boosie Boo a problem solver\nMe and my a lil goon and my .38 Revolver\nCut your throat twice, thug life, bulldoggin'\nBitch, if it's beef, we don't sleep, we stalkin'\nSend a ride to see your pussy-ass and won't be late\nBitch nigga, you got a problem, you must don't want your face\nYou fucking with a ace in the hole, a maniac, nigga\nSmoke fire all that, Boosie bringing that, nigga\nBust your head in the 'lac, rip the threads off the seats\nTattletaling-ass nigga, \"Boosie messing with me!\"\nThat's you letting em drugs make you fuck with a G\nYou got a problem, bitch, I'm putting you to sleep\nBitch ya ass gotta...\n\n[Hook: Boosie & Webbie]\n\n(I'm telling you, Savage Life... What's Happening? Look.)\n\n[Verse 2: Webbie]\nSay what's on your mind, let me know how you feel\nBoy I do this all the time and you know I'm for real\nAnd you know I'm with Trill\nHunt your dog like a deer\nBut we ain't gotta get retarded\nMan, I'm just tryna chill\nGot the ball no fumbling\nCross us, we rumbling\nFuck ya'll niggas, we don't need no company\nCalifornia Ganja and\nYou know how we coming, it's\nNever 1 on 1, you know everybody jumping in\nPumps in the trunk, just in case we have to hunt again\nHit you in your legs see that you don't ever run again\nPut that dick up on her, got her moaning, finna cum again\nLook, I know you pussy boy, but I was still wondering...\n\n[Hook: Boosie & Webbie]\n\n[Verse 3: Boosie & Webbie]\nBoy you fuck with Boosie, you gon' get your shit wet\nIt's like Mouse on the track, it's a hit after that\nYou're a bitch, you're a rat, you're a stone-cold sucka\nI'm a G from across the tracks and I'm a stone-cold hustla\n\n[Webbie]\nAnd plus I got in me\nYou know why I get to pimping\nR.I.P to Pheezus, still got bustas I ain't get yet\nRappers get to tripping\nWe pop the full clips in\nWe scrape the track with niggas\nThis ain't just here for the dissing\n\n[Hook]", "image": "https://images.genius.com/199525855c585bd11c954f230cf8e095.170x170x1.jpg", "album": "Savage Life V", "title": "Problem"}]}