{"artist": "Andy Mineo", "songs": [{"title": "Honest 2 God Tyshane/DSTL 1.0.mp3", "album": "Work in Progress", "year": "2019-08-23", "image": "https://images.genius.com/4fa9eaa4fd9645485a3d2928421edda8.1000x1000x1.jpg", "lyrics": "[Intro]\nHonest, uh, look\n\n[Verse 1]\nHonest moments, some days I'm too afraid to create\n’Cause I'm fearful all my greatest ideas have gone to waste\nI know that if I would they would probably be good\nBut who got time for being good when you wanna be great\nBeen super critical, plus my heart growin' super cynical\nPeople hang around actin’ like they super into you\nMeanwhile, all a scheme to see what they can get from you\nPrayers in these cab rides, that became a ritual, uh\nI told God I wanna live for You, but\nIt's hard to live righteous when it costs residual cuts\nAnd plus, for my faith, I face ridicule, but\nIn light of that glory the comments all minuscule, uh\nAnd my wife feeling competition with my career\nBut I'm feeling competition with every rapper I hear\nThe day I stop doing this probably my biggest fear\nBut she the only one to be there when nobody cared\nSo my priorities change, who even keeping score in this game?\nThe price of fame quite the chore to maintain\nRecord exec's they always wanna pour you champagne\nIt all stop when the record sale reports ain't the same\nWho really love ya? Who really love ya? Who really love ya?\nLet me ask again, who really love ya enough to hug ya?\nAnd tell you when you actin' like a sucka, and never judge ya\nThat's not rhetorical, give a call to whoever that is\nSay thanks for everything that they did\nLife is fragile, we here for a blink, and then it end\nThe definition of family the same for the friends\nThe loyalty thicker than the blood that's under yo’ skin\n\n[Break]\nHonest moments\nHow often do we have ’em?\nReal ones\nCan I have one?\n\n[Verse 2]\nWe goin' public with our highlights, uh\nPrivate with our sin, throwing up pictures at the party\nBut not the one throwing up at the end, oh Lord\nHonest moments, how often do we have ’em?\nEven with our closest hard questions, hope that they never ask 'em\nIronically, they feel the same, we both actin'\nI'm feelin’ like a joke, that's why I try to keep 'em laughin'\nCrisis happen in my faith, I felt trapped and\nDidn't know if God was just something I imagined\nMeanwhile, people got questions, they askin'\nMe about Jesus, but I ain't got the answer, Sway\nIt's kinda crazy when you're known for your faith\nYou supposed to give it but you never get grace\nSo show up on stage, put on that face\nI'm just tryna hold on, hope I finish my race, uh\nAnd I just wanna hear Him say \"Well done\"\nHow I feel right now? Well, done\nAin't nobody askin' me how I'm doin'\nThey just like, \"Ayo, where the next album?\"\n\"Here it is\", honest to God, that's all I can be\nThey want the old Andy, girl, don't tempt me\nAnd as of late, I'm lookin' into therapy\nForget scarin' other rappers, man I'm scared of me\n'Cause mental health issues in my family tree\nMy grandmother died of Alzheimer's\nLast time I see her, yo, she ain't even remember me\nI gotta wonder if the same end is meant for me, yeah\nWent through depression in December 2016\nThe worst year I could remember\nI was sittin' at the table with my wife, started weepin'\nTears fallin' down my face, I ain't even know the reason\nStarted readin', learned it's my body's way of releasin'\nStress that I been carryin' over these seasons, uh\nAnd in my darkest time, friends are what I needed\nBut I hadn't sown there so wasn't much for me to really reap and\nLosin' faith in things I once believed in\nEven myself, I think Satan sent his illest demons\nMust be doin' somethin' right to get this opposition\nMeanin' I should go the hardest when I feel like quitin'\nGod, kill me if I ever start mixin'\nPersonal ambition and call it a righteous mission\n'Cause from a distance, most people couldn't tell the difference\nThat's the thing that make me ashamed to say I'm Christian\nGod, they lyin' on your name on the television, uh\nThey Benny Hinn gettin' Benjamin's, uh\nAnd yeah I get it, why most hate religion\n'Cause division and oppression is what Ben depicted\nBut two choices young man, make a decision\nThrow your hands up and say \"Forget it\"\nOr be the difference\nFour minutes of sharin' how I felt\nHonest with y'all 'cause now I'm bein' honest with myself\n\n[Outro]\nHonest moments\nHow often do we have 'em?\nAm I allowed to have one? (Ayy, yeah)\n'Cause we go live with the highlights\nWe go silent with the pain\nWe don't tell nobody\n'Cause we don't want no shame\nBut if you only knew\nIf you only knew\nEveryone you scared to let down\nDon't you know they're scared like, like, like you"}]}