{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg", "title": "Freestyle Jam", "year": "2009-02-09", "album": null, "lyrics": "(We just... we just here, talkin' shit. Asher! You owe me a rhyme!)\nAsher: I owe you a rhyme?\n(The last time we talked...)\nAsher: Alright man, turn it up, man. Turn it up. Yo\n(Yo, Cudi, you wanna get in on this?)\nCudi: Yeah, It's whatever, man\n\nAsher: I think I got somethin' special for you, too\n(You want me to introduce you?)\nAsher: Cause you know, Cudi and I, we go all over the place We, we.... we cross over. We don't like to... We like to go all... We walked in on some foreign talk\n(Alright! Hahaha. Let's go!)\nCudi: Let's go\nAsher: My shit is like this when people walk in\n\nWe do this, we do that, we do rock, we do rap\nWe do jazz we do funk and then classical\nWith a clash to Outkast, back to Johnny Cash\nFlash from Black Thought and A Tribe Called Quest\nLes from Primus, Mos Def and Kweli\nZepplin, Onyx, Beck, and Chuck D\nFeelin' of Bob Dylan, hints of John Lennon\nMixed with a bit of Pimp C and Bun B (Woah!)\nMarley in my heart with parts of Charlie Parker\nMozart's art and all of Shawn Carter\nBjork to Tom York, Europe to New York\nMorrison of The Doors, and Morsel of Too Short.(hey!)\nIn short this list is long and just goes on, y'all\nMe and Cudi, we unstoppable!\n\nCudi:\nYeah, I be freshman, next in\nKickin' up the dirt and they be blessed then\nWhen you come arrest him, we'll be out, in minutes\nI don't give a fuck what bail-bondsman are spittin'\nI'mma let y'all niggas know they well wishin'\nKid Cudi fall off? Never bossy, I'm getting money\nBounce all around the world; similar to bunny\nRabbit, you want my dick? Come grab it\nI will break skull, motherfucker\nKid Cudi's in the mall poppin' tags and I'm duckin' 'em\nEverytime they try to play the games, all the model girls claim\nThat they runnin' round town and they fuckin' him\nNo, they ain't fuckin' with him, no, not on that level\nI never love the hoes, cause a nigga got several\nI'm not tryna be caught up, like I'm\nIn this, movie that you, know\nI'm not tryna be up in court\nBaggin' all these hoes, no nigga\nI am just trying to sit back and smoke my kush\nYou want doobie? No, what you know is hit the puss\nYou wish you weird, nigga, my nigga, Asher Roth\nWe the motherfucking bossiest of boss\nWhat you know about that, boy, yes the ball I will toss\n\nAsher:\nYeah, and this is it, down to this\nTo the nitty gritty, my finger nails as dirty as any, but anyway\nWe slice it, it's goin' against me, fightin' to show [?]\nI'm tryin', but no one lets me I'm tired, so don't upset me\nCause I'm, tryna fight with both arms tied behind me\nWith a blindfold on, throwin' shots at my body, but I\nContinue on like I carried the cross\nStroll past the crossroads to the land of the lost\nAnd then, skip right to Satan, throw some penny's at his feet\nSay I'd give him my soul, but I sold it to the industry, so\nNot up to me, attached a couple of strings\nAnd before decisions made I'm in different directions\nIt's nothin' but reps and, record execs and\nYou and the next man go get your investments, cause\nNow more than ever, I'm hot with hostility\nIt's now or never and never's never a possibility\n\nCudi:\nIf you'd listened to Day'N'Nite in reverse\nYou'd probably think I was suicidal, with the knife in the bible\nI don't give a fuck with niggas sittin' back and so idle\nI'm that nigga, I'm you'r father, get in your room and study\nI'm that nigga in the back, you can call me your buddy\nCause I'm rollin' up the weed, so we can smoke the next plenty\nHey, so talk records homie\nWe do it bigger than you ever could imagine\nI'm something like Big Pun and Biggie Smalls\nCombined, but on half paid\nI let these niggas know I dry heave\nWhen I spit the heat, motherfuckers better bundle up, air tight\nI be in the club all day through the midnight\nYou could get it spit right, yeah\nI'm tryna let these motherfoes somethin wrong in here\nThere's somethin' wrong up in my brain\nI'm not the same as everyone else\nNiggas know the flow is the best in the elf\nAnd stealth, Metal Gear Solid\nMove when I'm runnin' in the game, can't stop him\nAsthma, nigga Asher Roth and Hamilton\nWe put the game over and we gon' win\nThey losin' the game if we choosin'\nWe off and playin' beer pong all day we boozin'\nWe choosin' the nice hoes, we tryna get it poppin' after every show\n\nAsher:\nI want to admit that I have a track for you\nIt's called \"She Don't Want A Man\"\nI think you would... rap to\nBut I don't mean rap to, I need you on the hook\nShit, I hate to go outside the book, but look\nI stole someone's Poland Springs, didn't mean to\nI think it was yours and all, but shit, I'm just drinkin' to\nTry to stay hyrdrated, you know all day\nHydroplane when I make my way to NY-hey-C\nSee me on MTV soon, but please, no drama to you\nWhen I was in the Woodies, with the cool kids\nWe was chillin, I was in the same fuckin' Sperry's as these\nPlease, can't see me gettin' fuckin' cheese\nBut hey, in my pockets, these the same dirty jeans\nI work for three weeks, same fuckin' jeans, same K-mart tee\nI mean this is a K-mart sweatshirt that I haven't washed in two weeks, but fuck it, I'm fuckin' dirty as shit\nBut now it's off the top talkin' bout nonsense\nI don't care cause it's all ral- relevant, hell of it\n(Cudi starts hook)\nHell of this, fear this MC shit\nSo Cudi gonna give me a hook right here\nThere, for your ears\n(Cudi restarts hook)\nCrystal clear, it's enough, this is enough\nSo what, I don't give a fuck, where's my man Snuff at?\nSnuffaluffagus, from Sesame Street, deep, you can't see me\nI'm like The Beets and Doug Funnie\n\"The Killer Tofu\" is oh who?\nWho? Asher Roth, motherfucker, and now you knew\n\nCudi:\n[Hook]\nHear them callin', me\nAnd I ain't playin' no more\nSay, oh I hear 'em callin', me\nAnd I ain't playin' no more, hey\nNow I will show you what's in store\nNigga further more, I'm that young boy out in the game, hey\nAnd I can hear 'em callin'\nAnd I can hear 'em callin'\n\n\n\nAsher: There you go. You got -- You just got a whole song!\n(I love it. I love it. I love it. Where's the applause? [cheering] That's what it is, baby. Peace out radio.)\nCudi: That hook was off the dome\nAsher: Yeah, we love you enough\n(Wait, was that really off the dome right there?)\nAsher: That was love right there\nCudi: That hook was off the dome\nAsher: That was love right there\n(You guys are good people, man. I like to have real talk with you guys.)\nAsher: But for real, yo, I came here because I was like, yo, let's do it"}]}