{"songs": [{"year": "2009-09-16", "image": "https://images.genius.com/bd05030acbab5bd1282d022a0a647920.500x500x1.jpg", "title": "Money to Blow", "album": "Pricele$$", "lyrics": "[Intro: Birdman & Drake]\nRicher than the richest\nMore money, bitches\nYeah, coming to you live from the city of Houstatlantavegas\nSo what it do young nigga? One hundred\n\n[Verse 1: Drake]\nI am on a 24-hour champagne diet\nSpilling while I'm sipping, I encourage you to try it\nI'm probably just saying that cause I don't have to buy it\nThe club owner supply it, boy, I'm on that fly shit\nI am what everybody in my past don't want me to be\nGuess what? I made it!\nI'm the motherfuckin' man, I just want you to see\nCome take a look, get a load of this nigga\nQuit fronting on me, don't come around\nAnd try and gas me up, I like running on E\nI, I-I-I'm on my Disney shit - Goofy flow\nOn records I'm Captain Hook, and my new car is \"Rufio\"\nDamn, where my roof just go?\nI'm somebody that you should know\nGet to shakin' somethin' cause that's what Drumma produced it for\nYes I make mistakes that I don't ever make excuses for\nLike leaving girls that love me, and constantly seducing hoes\nI'm losing my thoughts, I said \"Damn, where my roof just go?\"\nTop slipped off like Janet at the Super Bowl\n\n[Chorus: Drake]\nThey can't help it and I can't blame 'em\nSince I got famous, but bitch, I got money to blow\nI'm getting it in\nLetting these bills fall all over your skin\nI got money to blow, oh, I got money to blow\n\n[Verse 2: Birdman]\n(Cash Money millionaires)\nYeah, richer than the richest, we certified getting it\nCM, YM, Cash Money business\nHigher than the ceiling, fly like a bird\nHit the Gucci store and later get served\nWe smoked out, with no roof on it\nThem people passing, so we smash on 'em\nBallin' out, we keep the cash on deck\nLamborghinis and them Bentleys on the V-set\nLouis lens iced up with the black diamonds\nCartier, Ferrari, the new Spider\nNo lie, I'm higher than I ever been\nBorn rich, born Uptown, born to win\nFully loaded, automatic 6 Benz\nCandy paint, foreign lights with my bitch in\nBorn hustling, too big nigga to size me up\nKept stuntin', more money, burnin' up\n\n[Chorus: Drake]\nThey can't help it and I can't blame 'em\nSince I got famous, but bitch, I got money to blow\nI'm getting it in\nLetting these bills fall all over your skin\nI got money to blow, oh, I got money to blow\n\n[Verse 3: Lil Wayne]\nWell I get paid every 24 hours\nMoney and the power\nCome-come to V.I.P. and get a champagne shower\nI don't have to worry because everything ours\nAnd I got a big bouquet of Mary Jane's flowers\nThat kush\nI promise that's my dude\nBut we don't smoke that Reggie Bush\nAnd I'm with two women\nMake you take a second look\nWe popping like champagne bottles\nBut we never shook\nAnd we gon' be alright if we put Drake on every hook\n\n[Chorus Drake]\nThey can't help it and I can't blame 'em\nSince I got famous, but bitch, I got money to blow\nI'm getting it in\nLetting these bills fall all over your skin\nI got money to blow, oh, I got money to blow"}], "artist": "Birdman"}