{"artist": "Casey Veggies", "songs": [{"title": "I’m Right Here", "album": "Customized  Greatly Vol. 2", "year": null, "image": "https://images.genius.com/1a029e524a5e116fb4512ade4b883627.756x720x1.jpg", "lyrics": "[Hook: Casey Veggies]\nSo, so, so homie where you at?\nI be like \"yo, yo, yo yo, I'm right here\"\nGet a lot of money and I throw it in the air\nNow hater he can hate cause I don't really care\nSo, so, so homie where you at?\nI be like \"yo, yo, yo yo, I'm right here\"\nGet a lot of money and I throw it in the air\nNow hater he can hate cause I don't really care\n\n[Verse 1: Casey Veggies]\nUh, you want it all? I got it\nThat rap-rap ain't shit, it's no logic\nSo I threw on some fresh shit so we can be logical\nYeah I got a logic flow oh\nYeah, they go crazy in the party\n\"Casey do you have hard days?\" I'm like hardly\nGot a lot of girls, they looking like Barbies\nThe flow so hot, I just got it from the barby-que\nYo we got a deal like I'm ought to do\nYeah we going high, we on altitudes\nYeah, to-totally dude\n\n[Hook: Casey Veggies]\nSo, so, so homie where you at?\nI be like \"yo, yo, yo yo, I'm right here\"\nGet a lot of money and I throw it in the air\nNow hater he can hate cause I don't really care\nSo, so, so homie where you at?\nI be like \"yo, yo, yo yo, I'm right here\"\nGet a lot of money and I throw it in the air\nNow hater he can hate cause I don't really care\n\n[Verse 2: Casey Veggies]\nSo let me check my itinerary\nUmmm alright\nAnd I'm going to Japan, I'll be on the next flight\nAnd my walk wasn't right so I copped the Air Nikes\nI record music all day and all night\nAnd I do a lot of things, I ain't saying they all right\nBut when I started rapping, all I saw was light\nAnd everything I dropped, i-it was all tight\nNo I'm not soft, my pants might be tight\nWhenever I start spitting, all they do is see fright\nAnd yeah, yeah homie, we eat right\nCasey are you done? I'm like nah, not quite\n\n[Hook: Casey Veggies & Reese Dollaz]\nSo, so, so homie where you at?\nI be like \"yo, yo, yo yo, I'm right here\"\nGet a lot of money and I throw it in the air\nNow hater he can hate cause I don't really care\nSo, so, so homie where you at?\nI we like \"yo, yo, yo yo, we right here\"\nI get a lot of money and I throw it in the air\nNow hater we can hate cause I don't really care\n\n[Verse 3: Reese Dollaz]\nYep it's Reesey, ladies love me\nSo baby, maybe I'll put you in a may-b\nSky is the limit, you know get Shwazy\nBack on the block, old school Chevy suede seats\nWe getting paper so we stay tailored\nDressed in the best, we Supreme to the rest\nExpensive taste, pink champagne\nJewelry shining, cameras blinding\nResorts and island, ski trips dining\nThe haters is crying cause my whole clique's shining\nYou rocking with the best, nothing more, nothing less\nAnd we shining on these lames til the death, yes\n\n[Hook: Reese Dollaz]\nSo, so, so homie where you at?\nI be like \"yo, yo, yo yo, we right here\"\nWe get a lot of money and we throw it in the air\nNow hater he can hate cause I don't really care\nSo, so, so homie where you at?\nI we like \"yo, yo, yo yo, I'm right here\"\nI get a lot of money and I throw it in the air\nNow hater you can hate cause I don't really care"}]}