{"artist": "360", "songs": [{"album": "Falling & Flying", "year": "2011-08-26", "title": "Killer", "image": "https://images.genius.com/72b448ec1b8ce818c8a0a6c28fb6a019.600x600x1.jpg", "lyrics": "[Verse 1:]\nIf you don't know we were sent to kill\nSome have mentioned and said we're ill\nThey don't know what our illness is\nSo we're left to just kill this shit\nTake a look and see the armies forming\nHear the steps as we're marching forward\nFight back and just ask for more blood\nOne touch turn your arse to sawdust\nWe step from above\nBurning our feet on the edge of the sun\nMurder the streets in a way that it's never been done\nWho said this ain't meant to be fun?\nPray to Jesus cause he's your savior\nRight now not even he will save you\nBut at least you're gonna meet your maker\nTell him that 60 said hi, I will see you later\n\n[Hook:]\nWhat if you were to know a killer, killer?\nWhat if you were to know a killer, killer?\nHow would you feel to know a killer, killer?\nWhat if I was a killer, killer?\n\n[Verse 2:]\nYou can go ahead and judge me but\nYou don't know how good this feels\nWhat it's like to be finally murdering something that should be killed\nYo, I gotta get my license to kill\nSo I'm down here to tighten my skill\nIf I spend the right time in the field\nThen I know that I finally will\nNo more fear is inside of us\nNo laws here gonna apply to us\nBetter be aware, you'll be seeing your death bed\n'Cause of us, a lot of people have slept there\nThis is intimidation, right?\nThe kingpins, you can face em\nGotta see there's a killing to be made\nSo it's off with their head, win win situation, killer\n\n[Hook:]\nWhat if you were to know a killer, killer?\nWhat if you were to know a killer, killer?\nHow would you feel to know a killer, killer?\nWhat if I was a killer, killer?\n\n[Outro:]\nKiller, yeah, yeah, yeah\nKiller, yeah, yeah, yeah\nKiller, yeah, yeah, yeah\nKiller, yeah, yeah, yeah\nIf you don't know we were sent to kill-kill\nKnow we were sent to kill\nSome have mentioned and said we're ill-ill\nI-i-i-i-ill-ill\nIf you don't know we were sent to kill-kill\nKnow we were sent to kill\nSome have mentioned and said we're ill-ill\nI-i-i-i-i-ill-ill"}]}