{"artist": "9th Prince", "songs": [{"album": "Granddaddy Flow", "lyrics": "[singer]\nHmm.. oooh.. ooh..\nKilla Beez.. Killarmy..\n\n[9th Prince]\nEh-yo\nA Soviet deep in Paris, Playboy rabbits want carrots\nLuxury marriage, 9th ain't havin it\nI keep the forty-five automatic like Mathematics\nStart terminatin savages, I'm raw like 'caine to easy addicts\nStreet tactics, million dollar caskets\nOn biblical war, perform Michael Jackson Thriller but way iller\nA slave killer, protected by Shaolin and Brooklyn Zu guerillas\nUnder my pillow, I sleep with grenades, untraceable heaters\nLay deeper than scientific readers\nMy cipher sounds will ding pound, I blast you on ya nightgown\nKidnap ya child, might give him to the crowd\nOn my way Uptown in my '95 Millenium\nSeen Killa Sin and 'em, let niggas sound feminine\nRemember 9th Prince ill forever, I get up in 'em\nMy style is like runnin' up in small town banks\nBulletproof tanks, never bust blanks\nAlways suffer with shank\n\n[singer]\nKilla Beez.. we will sting you..\nKilla Beez.. Killarmy..\n\n[Islord - over singer]\nAiyo aiyo once again\nWe stingin' y'all mothafuckas cuz I don't give a flyin' fuck\nAbout none of y'all niggas out here\nCuz if you ain't none of my mothafuckin' Killarmy comrades\nFuck y'all!\n\nYo, check the topic to this essay\nIt's murder in the first, ese?\nAs I bust a slug through yo' fragile statue\nAnd that's actual, precise timed and on point like a marksman\nFour-four, rubber grip, Summer of Sam specialist, so take this\nFour-hunded grain thought that'll pierce ya cranium\nFrom the rear, I don't give a fuck, this is my year\nI'm takin this rap shit back from the wack\nFuck who you are kid, fuck where you representin at\nCuz basically my mentality is on some '93 shit\nWhen you had to Protect Ya Neck in this shit\nTo be an MC, now it's al about the tight clothes\nCrossed over flows, platinum jewelery to get a plaque in the industry\nBut never the I-S-L-to the O-R-D\nI keep my shit muddy like my Timbs be, you fake ass MC's\n\n[singer]\nKilla Beez.. Killarmy..\nKilla Beez.. we will sting you..\n\n[P.R. Terrorist]\nAiyo Terrorist\nI'm on the block like any man\nThe difference between me and you is I understand\nYou askin' questions, \"What's that shit up in my hand?\"\nAnswer your questions, I fire that shit up in ya pan\nBitch nigga, understand? I'm the P-R-T, era is this\nHis lyrics are unique and his vocals are crisp\nBang that shit in ya Jeeps or on ya block with the fifth\nSo front on his, kid, front on this\n'Til I could let this shit that's in my hand light up my wrist\nAnd let this shit descend in like E-V ya chest\nI'm far from the best, I'm more like the worst you ever seen\nSpit green phlegm from blood same color as my jeans\nAnd my boots'll be brown, get up, the street's down\nLet the beat hound cuz beef pound, 'round the block\nThis is hip-hop, niggas fucked around and went pop\n\n[singer]\nKilla Beez.. Killarmy.. (x3)\nKilla Beez.. we will sting you..", "year": null, "title": "Slang Killaz", "image": "https://images.genius.com/aee759b8fa2fa70e9bb2b738d3297e33.462x462x1.jpg"}]}