{"songs": [{"lyrics": "[Intro]\nSniff a little coke, please, don’t go to sleep yet\nI kn-I-I know, I know\nPour some water on your face, do some jumping jacks\nWe about to leave, it’s me, it’s me, yo\n\n[Verse 1]\nWho could it be? It’s me, running down brick lane\nWith a visible limp (Uh), and an alligator pimp cane (Uh)\nRubies where the eyes go (Yeah), car so low (Yeah)\nGotta drive this slow (Yeah, yeah)\nBlack windows like we hiding, ho\nFuck the 5-0, unless we talking ‘bout the ‘Stang (Mustang)\nMan, I’m just watching all these actors from the rafters like Sting\nIn the surveillance van, fucking with computers like Ving (Ving)\nHundred milli’, that’s a light ching, shoot him in the right wing\n\n[Chorus]\nDon’t wanna drink, don’t wanna smoke\nDon’t wanna smoke no more\nYou fucking stupid? I’m tryna do all that shit\nDon’t wanna smoke, don’t wanna drink\nDon’t wanna drink no more\nYou fucking stupid? I’m tryna do all that shit\n\n[Verse 2]\nListen, tiger, my shit fire (True), hard to forget like a thick Maya (Damn)\nI like my mind a little bit higher (Higher)\nI need the violin section tighter (Make it tight)\nAnd if you need to drive the ‘Vette (What)\nI left the keys by the tire, tiger (Thank you), just be humble\n‘Cause if I punch you in the chest, you’ll do a hundred yard tumble (Uh)\nStanding over victims like Mutumbo with the finger waving (No, no, no, no, no)\nI’m such a motherfucking player\nMy hair should be in finger waves, uh (God damn)\n\n[Chorus]\nDon’t wanna drink, don’t wanna smoke\nDon’t wanna smoke no more\nYou fucking stupid? I’m tryna do all that shit\nDon’t wanna smoke, don’t wanna smoke\nDon’t wanna smoke no more (What)\nYou fucking stupid (What)? I’m tryna do all that shit\nI wanna drink, don’t wanna smoke, don’t wanna drink no more\nYou fucking stupid (What)? I’m tryna do all that shit (I know)\nI wanna drink, I wanna smoke\nIwanna smoke some more (Some more)\nYeah, I’m tryna do all that shit", "title": "Picasso’s Ear", "album": "White Bronco", "image": "https://images.genius.com/af7ca91e5021a5401fbcc503b74fbc53.1000x1000x1.jpg", "year": "2018-11-01"}], "artist": "Action Bronson"}