{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/fc08a4018680b3979b913a15b46cd21b.1000x1000x1.jpg", "year": "2019-06-07", "title": "More Than Friends", "lyrics": "[Intro]\nI can't wait for you to come home, I really miss you\nOh, is that right?\nNo, it's me\nI recorded, no tapes right there\nYeah, yeah, yeah, yeah, yeah\nAyy, ayy, ayy, ayy\n\n[Verse 1]\nYou ain't ever been in no Lear, huh? (Lear, huh?)\nYou ain't ever been in no yacht, huh? (Yacht, huh?)\nYou barely been out the house, huh? (House, huh?)\nHe ain't wanna let you come out, huh? (Out, huh?)\nWell, you free, it's about time\nFree a day up, you on my time (My time)\nDo you make up on your outline?\nNo more stress, you can smile now (Smile)\nShe live on the Southside (Southside)\nNo man, had to move, downsize (Outside)\nI buy her Chanel, I know she got dues and I ain't tryna get outshined (Outshined)\nBut I ain't gon' force it, let it come natural, I'ma really take my time (My time)\nWe gon' really catch our vibe (Our vibe)\nNow I got her in the coupe, mouth wide\nTalkin' bout\n\n[Chorus]\nWhat type of games are being played? How it's going down? (What you mean?)\nOn 'til we gone, then I gots to know now\nPeople changed on me, are you with me or what?\nPlease don't waste my time, niggas did that shit enough\nWhat type of games are being played? How it's going down? (What you mean?)\nOn 'til we gone, then I gots to know now\nPeople changed on me, are you with me or what? (I just told you that)\nPlease don't waste my time, niggas did that shit enough\n\n[Verse 2]\nYou ain't ever did it like this, huh? (This, huh?)\nYou ain't ever been this close to real, huh? (Real, huh?)\nPull my dick out, sit on it\nAlready wet, you ain't even got to spit on it (Huh?)\n'Bout to get your back cracked, pull up Bentley, matte black\nGet her wet-wet, super slimey like she slatt, slatt\nYou want me on top, huh? (Top, huh?)\nOh, you tryna make love (Make love)\nYou ain't ever tryna break up (Break up)\nWanna see me when you wake up (Wake up)\nYou know I can't do that (Do that)\nI ain't tryna go through that\nI think we movin' to fast (Too fast)\nWhen you ready for that, but you knew that\nNow she's talkin' 'bout\n\n[Chorus]\nWhat type of games are being played? How it's going down? (What you mean?)\nOn 'til we gone, then I gots to know now\nPeople changed on me, are you with me or what?\nPlease don't waste my time, niggas did that shit enough\nWhat type of games are being played? How it's going down? (What you mean?)\nOn 'til we gone, then I gots to know now\nPeople changed on me, are you with me or what? (I just told you that)\nPlease don't waste my time, niggas did that shit enough"}], "artist": "Tee Grizzley"}