{"artist": "Cam’ron", "songs": [{"title": "Hot Mess", "album": "Public Enemy #1", "year": null, "image": "https://images.genius.com/93b307f21c101613e827cd273b1a7a51.640x640x1.jpg", "lyrics": "[Cam'ron]\nIts young 60 minutes AKA 1 hour\nAKA SK, AK gun powder\n50 bullets aka one shower\nI walk in nike town\nI tell em wipe me down\nBut the fun begun\nYes its summer hun\nSomebody call chuck and flav im PE #1\nGet the S1W's professor griff\nLet it slide? nope im at home plate with the catchers mitt\nThere go cam braggin\nNana mad cause my pants saggin\nAll she said is \"you's a hot mess\"\nI tell her I ball, baby look at my walls\nShop on the ground I get it out the skymall\nIts young CNN, NBC, CBS, TNT, HBO, showtime, CBS\nSee the borrough G5, yes sir GPS\nOne diamond 100 carats yes sir V.V.S\n\n[Chorus]\nWhen i got dressed\nRather when i got fresh\nPants sag, gun on, nana said you's a hot mess\nYou's a hot mess, you's a hot mess, umm you's a hot mess\nBoy you's a hot mess\n\n[Verse 2]\nYall are my clones, fresh whips fly homes\nCareful when u drive home, youll walk into a cyclone\nOver them dry stones\nFiends slept in front of my crib for 2 days straight, like I had the iphone\nPies on i'll bet some pies on\nThe 2,4 and 6 train the only thing theyll ride on\nAsk em why play with my pay\nI pitch China in Boston, like Daisuke that white yay\nAnd all this carrot cake, well its enough to irritate\nBut im so fly high i fuck around and wear a cape\nAnd pardon if you in the garden just beware of bait\nThey starvin, niggas eatin, nope they wouldn't share they steak\nYoull find em out of state near a lake severely raped\nGettin ate by some apes, deers, bears or snakes\nSo I tuck the llama, yeah enough with drama\nI seen a nice slut, big butt with a touch of honor\nI let her touch the ganja\nI could be ya sponsor\nI got one mother right, but i could use another mama\nDid I pop? yes. hit it hard got dressed\nAnd all the bitch said \"killa you's a hot mess\"\n\n[Chorus]\nWhen i got dressed\nRather when i got fresh\nPants sag, gun on, nana said you's a hot mess\nYou's a hot mess, you's a hot mess, umm you's a hot mess\nBoy you's a hot mess"}]}