{"songs": [{"album": null, "year": "2016-09-16", "title": "Hell Yeah", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "[Intro]\n(You think there's a perception that you're slowing down a little bit?)\n\nEverybody slows down when they get older. I think if I can just be smarter than all the youngings that's comin' I'll be fine. Am I slowing down? Maybe a little bit, maybe not\n\n(You have a chance to win a championship here?)\n\nWhen I'm on a team, we've got good guys around me, then yes, yes, hell yes\n\n[Verse 1: JR Writer]\nLook it's funeral wakes, graveyard flower time\nNo studio breaks, trey balls, power grind\nY'all on Ramadan, save that I devour mines\nSomeone (?) I came back with them power lines\nChasin' down the skrilla\nQuit playin' with a killer\nI ain't a dermatologist, you ain't gon' get a filler\nYou claimin' niggas iller? Must be from Cincinnati\nWell I triple dare you crawl up in this cage with a gorilla\nRight hook, left hook, I'll give you the best look\nEver think of checking me? I better see check books\nI don't think you understand whenever the chef cook\nPlayin' with the thunder gang? You better be Westbrook\nTrigger finger itchy\n.22 to .50s\nI don't which one a nigga pickin' up, I'm picky\nYou think you finna get me?\nYou little niggas really got me fucked up\nWhich one of y'all hit me with a (?)\nDig me I'm in the Porsche\nOnly 5th or boss\nThey've been screamin' all day so the engine is horse\nChristian Diors\nYou ain't know it nigga I floss\nGators on the kid like I'm down at Disney resort\nDog who you cats foolin'? I will finish you\nIt's principle, I'm past true it\nWho your class schoolin'?\nI'm on the ave cruisin'\nHeaded to the party and I'm hittin' everything movin'\nThat's some mad shootin'\nPocket and cash, you see I got the ave boomin'\nBody in trash, I mean what kind of bag you in?\nYou don't give up that scratch then your hat fumin'\nWhat's the nickel pack, pack, you can ask Hue and\nWhen I put on a show I got these cats hootin'\nWhat you put in the flow and how is that human?\nGat come with the extendo, your ass poolin'\nI grab money out the window, I'm fast foodin'\n\n[Verse 2: Dave East]\nI had to Rollie the wrist, I put in the order, get hit\nI come from the border, touching quarters, order be rich\nPull up in that foreign, my bitch so foreign, take a pic\nRather get money than lay with a bitch\nThem youngin's that's with me, they stay with the shits\nI do VVS so flawless\nThese rap niggas so garbage\nPut an infrared on that carbon\nWe taxin' niggas no bargins\nMade a couple racks, that's a good night\nWhen I took flight, first class\nPorsche 911, that'll mrk past\nThat's Milly Rock in the 3rd Ave\nSection full of bottles, I don't ever do the bar\nI'm always in the buildin', them bitches know who we are\nI'm smokin' on the finest, this shit look like a cigar\nHear you ridin' like Raiden nigga get up out the car\nGoin' out my way to finally come up out that dark\nI couldn't see no lights, livin' trife, me and my dog\nStop askin' questions, mami you gotta take it off\nLiquor, weed, and molly, them bitches'll probably take it off\nI don't know nothin' about you but I just chase the money\nI went too hard to ever let a nigga take it from me\nI'm in Neiman's rememberin' every day was bummy\nMaking pick ups in the projects, addicted to filthy money\nThe last bid, I promise I will put that work down\nGod bless the child that hold his own, let's go to church now\nThe devil on me\nHope you can dig it, I got a shovel on me\nHard for me to walk through detective's I got that metal on me\nMeek already told you niggas in life it's levels homie\nThese niggas switch like the seasons, I'm feelin' better lonely\nAll by my dolo, Polo when I do fall gear\nIn public hard to get close to me, just know we all here\nIn one year I did a song with Nas, did a song with Styles\nDid a song with Jada, give a fuck about haters\nDid records with Wyclef, got a drink with Noreaga\nPusha T, that's my nigga\nAdidas come in flavors\nIn the 'jects blastin' music, fuck all my neighbors\nHavin' conversations with Trigger bout bitches and liquor\nHe told me go get the money and don't get caught up with niggas\nBlog sites be on me, watch how I talk to these niggas\nWe was trappin'\nBreak the package, split it all with my hittas\n11.99, dimes light up a forest on niggas\nThey ain't East"}], "artist": "J.R. Writer"}