{"songs": [{"image": "https://images.genius.com/31d292c82b0bd3742f39fc65fe0c1bf7.500x500x1.jpg", "album": null, "title": "Control", "lyrics": "[Intro]\nHello, my name's Daniel and I don't really see what's so special about this \"no control\" stuff\nLet me put it in another way:\n\n[Verse 1]\nKendrick Lamar did a verse and everybody's going crazy\nCan somebody explain to me why it's considered so amazing?\nAll I hear's another rapper running his mouth\nSeriously, tell me what the fuck the fuss is about?\nHow did rap get into such a sorry state?\nWas it folly? Fate?\nOr is it the fact that I've only just arrived? Sorry I'm late\nI was busy refining my craft\nWriting a rap\nTo strike and attack\nAnyone who's ever spoke a line on a track!\nI'm a frightening madman, the violentest chap\nSo please let's have a moment of silence as Dan drops the most violent of raps!\nEvery MC in the charts is a pile of crap\nMost of you pussies still have your hymen attached\nThis fellow Kendrick's going to get ended\nHe raps like he's choking on his own vomit; Hendrix\nIt leaves me with a sour taste to acknowledge ya'\nI'll straight up demolish ya'\nHey, Jay Electronica!\nI saw you on \"Crap Rappers Gone Wild\"\nThe hottest thing you managed to put out is Kate Rotschild\nI'm hostiler than a Rottweiler with rabies\nLook at the state of Jay-Z\nMan it's a shame, jeez!\nNow he's reached the top of the game he's refraining\nFrom saying things even vaguely interesting! Amazing\nHow he used to be the voice of people from the streets\nNow he's the mouthpiece of a Korean phone company\nUnbelievable\nAnd if you believe I'm being unreasonable\nI'd love to hear your contribution to this free-for-all\nBut I'm not seeking beef at all\nI'm just speaking things we all\nOught to take on board\nShut up, Drake! I'm bored\nLeave the door\nShut behind you on the way out\nAs I lay out\nJuicy J\nTake his inhaler away, ow...\nFuck Rick Ross\nYou're as hip hop as lip gloss\nI'm a Brit posh\nAnd still hit harder than this tosser!\nRap fans should be pissed off\nAt how they're ripped off\nMajor labels making pay from selling people this dross!\nI came to change the game\nTaking aim at famous names\nDay to day\nI blaze the lamest\nOf you up in Satan's flames!\nI don't care whether you burn on Hell or freeze!\nJoel Ortiz\nCan go to town on deez\nNuts!\nI'm a beast that's\nCome from out the blue\nEvery rapper on a major label: Run, I'm out for you!\nHa! It took a geeky prick like me\nTo show you how to do hip hop?\nWell that proves you really need a sound that's new\nSo here I'll be hopeful\nWith a serious proposal:\nLet's start talking about things that are real in our vocals\nSocial issues\nScience, reason, actual feelings\nOn beats that are banging enough to smash the ceiling!\nNow I don't know about you, but I think that's appealing\nBringing back the thing that rappers lack to bandage up the bleeding\nThey say the pen is more mighty than the sword\nI say the way I handle mics is mightier than yours\nIt's indisputable that I'm the king of New York\nAnd that's despite the fact I've never been to New York!\nIt's Dan Bull\n\n[Outro]\nI mean, I hope you understand my point there?\nIt's not difficult to just rap 50 bars and insult some people\nIt is slightly more challenging to touch people's hearts\nTo be honest\nTo connect with the world around you by confessing your weaknesses to it\nI'm afraid of butterflies, that's my phobia\nButterflies!\nMoths! Urgh...\nMoths...", "year": "2013-08-17"}], "artist": "Dan Bull"}