{"songs": [{"title": "Awe Stars", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nTake a look at me and they can tell I've\nRapping so long, I got more bars than cell blocks\nEvery interview, they asking if I want the deal or not\nAsking if I sell lots\nNigga, is hell hot?\nThere go your answer, that pessimism's your cancer\nBest to beat it like [?] beat it like Micheal Jackson\nMost of these niggas lacking the skill it takes to make classics\nThey come to me, looking plastic, real hearts is made out of molasses\nI'm hard and they looking plastic, please say I'm not the only one\nFlyest nigga up in the club, ain't even twenty-one\nQuit my day job to make a living off having fun\nMaking beats; better yet, made a killing, that's hella sweet\nGuaranteed I'll bet I get that money, like, pronto\nBut trust me, I'ma get you in the end, Tonto\nDon't play me like a console and we'll be all good\nTodos, bien, let the games begin\n\n[Verse 2: Casey Veggies]\nIf this XXL cover Obama, I'm the hardest of McCains\n310, said it first, I'm just staying in my lane\nCrashing into haters 'cause my speed is insane\nDreams on my brain, trying to scheme to make a change\nTo get cream and the fame and my team do the same\nI'm alcohol on the track, yeah, the kid, the one to blame\nI remember two years ago, they didn't know my name\nNow these hoes scream me out like I'm putting them in pain\nThe young boy, I came to kill them again\nSorry rapper, I ain't really feeling you, man\nGot the call from [?] I told him the weekend\nWould be the best time, school on the weekdays\nSchoolyard niggas, y'all suspended for three days\nIt's two types of niggas: real and fake\n'Cause your bros turned sour when you talking 'bout cake\n'Cause they can't be fair when you splitting up what you make\n\n[Verse 3: Rockie Fresh]\nOkay, I rock these dope bands, but I make the game step up\nGot that doctor money, I'm just trying to get my check up\nBalling, balling, somebody call a ref up\nView these boys in hindsight, think they need to catch up\nPeople say I'm next up, [?] throw them up like [?]\nPlus my clique's some animals and y'all boys just some Cheetah Girls\nGotta stay protected, dog, you know that it's a crazy world\nWhen niggas put that hit up in your head like a pressing curl\nYeah, they repping hard, know how to play they cards\nHandle the right like guards, they call me Charizard\nWhy? Because I spit that fire, your flow is like rims, it's tires\nSo I must detach your wires with this steel, I call it pliers\nAnd your girl love me, dog, I am the best, man\nLook at you like Wolverine, why? 'Cause you a ex-man\nGot a lot of paper and you'll never take it from me\nYeah, this Rockie Fresh, bitch, and I'm busy getting money\nMotherfucker", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}