{"songs": [{"title": "7-1-3", "album": "Undaground King", "year": null, "image": "https://images.genius.com/37d697fdf2a877e070869cbcf7cc9322.151x151x1.png", "lyrics": "[Lil'Flip]\n\nLil' Flip\nRepresent\n7-1-3\n\nNow when you see me in the Lamborghini speeding, bumpin Screw\nI know you see my license plate, \"Lil' Flip #2\"\nI use to skip summer school, hit the block and move work\nThat was enough to buy some shoes, pants, and a new shirt\nNow I'm shinin like Puff, wearin diamonds like Puff\nWe got everybody else music sounding like US\nSo hold up! You better get your own style\nCause we been bumpin Screw down here for a while!\nAnd when you see me at the mall, Just me and my dawg\nI'm shoppin with them, Cause I ain't trickin for a broad\nI do shows and rock crowds, And then I get paid\nSummer time, I'm on dubs, Winter time, I'm on blades\nMy whole click livin laid, man we all got Vets\nMy crib so big, I ain't even see my room yet\nBut hold up! You better get your own style\nCause we been buyin six-figure homes for a while!\nNow when you see me in the Vibe, Murder Dog and The Source\nAnd the XXL, standing next to a Porsche\nI get paid with my voice, so I pimp these beats\nI hate commercial rap, so I pimp these streets\nYou don't work you don't eat, that's a known fact\nI just don't rap, nigga I know how to act\nBut hold up! You better get your own style\nCause we been fuckin with magazines for a while!\n\n[Chourus x1]\nBecause we represent the 7-1-3!\nThe type of Rappers y'all never goin be!\nWe makin money y'all never goin see!\nBecause we represent the 7-1-3!\nHouston, Texas nigga!\n\nNow when you see me with Tigga, On BET\nOr 106 and Park, with AJ and Free\nOr MTV, come take a look at my house\nAnd after that, come take a look at my mouth\nYea I represent the South, like Pastor Troy\nAnd I'm still Fresh and Clean, like Andre and Big Boi\nBut hold up! You better get your own style\nCause we been talkin shit on TV for a while!\nNow when you see me with a sweet, blowing smoke out my nose\n9 times outta 10, I'm probably blowin Hydro\nSo don't blow my high, just leave me alone!\nCause I get high like Cheech and Chong\nCall me 'Afroman' when my hair ain't braided\nI got 20 tatoo's but I'm still educated\nBut hold up! You better get your own style\nCause we been smokin high-time weed for a while!\nAnd when you see my at the club, I gotta get my floss on\nTechno, my ring shinnin, and I got my cross on\nI gotta brand new phone, Cause I'mma rich nigga\nAnd when people call, you can see they picture\nI'm still Lil'Flipper, but my money got taller\nAnd my Benz got wider, and your hundred got smaller\nBut hold up! You better get your own style\nCause we been acting bad, drivin cars for a while!\nWhen you see me Big Pimpin, like UGK\nI'm choppin on blades, candy-paint, Jog Grey\nI'm sittin on Twenty's, but I'm twenty-one\nI'm ridin with an AK, you still got a B-B Gun\nSo you need to Back, Back, and gimme 50 feet\nCause you ain't sellin records like Sucka-Free\nBut hold up! You better get your own style\nCause we been ridin around with straps for a while!\n\n[Chourus x2]\nBecause we represent the 7-1-3!\nThe type of Rappers y'all never goin be!\nWe makin money y'all never goin see!\nBecause we represent the 7-1-3!\nHouston, Texas nigga!"}], "artist": "Lil Flip"}