{"songs": [{"lyrics": "[Intro]\nYeah, yeah\n\n[Verse 1]\nJust like bums, we used to stay in the slums of LA by the way\nGang-bangers killin' each other for rep, sellin' rock cocaine on my doorstep\nHad a ball to bounce, bike to ride, but my mama never would let me play outside\nBut when I got enrolled in elementary school, started bangin' like a fuckin' fool\nSo cool, throwin' up gang signs to the gangster beat, shot an enemy from across the street\nMama came home, said she got a good job. Daddy did too. Now they don't squab\nFinancially, we improvin'. 2 months later, son, we movin'\nNo more duckin' from shotgun shells. Bought a two-story house in East Palmdale\n(give it to me now.)\n\n[Chorus]\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\n(Check it out, check it out, check it out.)\n\n[Verse 2]\nNo more rats and no more roaches, livin' next door to football coaches\nNow I got a new place to sell me crack. Now I got little white kids to jack\nI stopped wearin' blue, wasn't trippin' on red. Too busy squabbin' with the skinheads\nStupid questions, distract the class. Rubbin' little girls all on the ass\nI didn't really care if I passed or failed, figured I was headed for the NFL\nUntil the playoff game, shoulder got hurt. I thought about my future, layin' in the dirt\nI can't jump, I can't flinch. Superstar player, ridin' the bench\nGraduate from school? Don't make me laugh. I got an F+ in basic math\n(give it to me now.)\n\n[Chorus]\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\n(Check it out, check it out, check it out.)\n\n[Verse 3]\nI knew I couldn't make it in the corporate world, so I bought me some khakis and a Geri curl\nI knew I couldn't make it to the NFL, went to East Palmdale and started slingin' yayo\nFor sure! I was makin' crazy dough. Should've dropped outta school a long time ago\nBought a cell phone, like a nut. Now I deliver like Pizza Hut\nI drunk whisky and Bacardi. I sold weed to anybody\nMe and my homies sold dubs and dimes, took turns bustin' rhymes just to pass the time\nPolice drove up to my spot. Asked, \"Hey, homeboy, what you got?\"\nI put a fat rock inside his hand. About 25 sheriffs jumped out the van\n\n[Chorus]\nPalmdale, (Hell, yeah) come back to me\nI need you and I love you, baby\nPalmdale, come back to me\n(check it out, check it out, check it out.)\n\n[Verse 4]\nNow I got a fucked up life. Five bad kids and a naggin' wife\nDead end job at the airport. Check too short to pay the house note\nTurn on the TV, then I see different homeboys that went to school with me\nPlayin' in the NFL. We used to kick back in East Palmdale\nRodney Williams. Lorenz Tate. Zeno plays for Colorado State\nI wish my homeboys much success, but at the same time, I still get depressed\nWalkin' through the wind with a cup full of gin thinkin' 'bout things that could've, would've, should've been\nI wipe my tears, sip my beers, wish good luck to my peers from\n\n[Chorus]\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\nCause that's where my heartache began, heartache began\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\nCause that's where my heartache began, heartache began\n\n[Interlude]\nOh yeah, oh yeah, all the Palmdale Falcons, past and present. All the little ones I don't even know, you know what I'm sayin'. Everybody, wherever you're at, aye, aye, aye, aye\n\n[Refrain]\nYo, let me get a Palm (Palm!)\nYo, let me get a Dale (Dale!)\nYo, what do we sell? (YELL!)\nYo, where we fittin' to go? (We fittin' to go back to jail!)\nYo, let me get a Palm (Palm!)\nYo, let me get a Dale (Dale!)\nYo, what do we sell? (YELL!)\nYo, where we fittin' to go? (We fittin' to go back to jail!)\nPalm (Palm!)\nYo, let me get a Dale (Dale!)\nYo, what do we sell? (YELL!)\nYo, where we fittin' to go? (We fittin' to go back to jail!)\nYo, let me get a Palm (Palm!)\nYo, let me get a Dale (Dale!)\nYo, what do we sell? (YELL!)\nYo, where we fittin' to go? (We fittin' to go back to jail!)\n\n[Outro]\nDale, Palmdale\nDale, Palmdale\nDale, Palmdale\nDale, Palmdale\nDale, Palmdale\nDale, Palmdale\nDale, Palmdale", "title": "Palmdale (Palmdale Sessions)", "album": "Happy to Be Alive", "image": "https://images.genius.com/5833155c0c1381ea982132707226ffa9.800x800x1.jpg", "year": null}], "artist": "Afroman"}