{"artist": "Boosie Badazz", "songs": [{"album": "Bad Azz Mixtape Vol. 2", "title": "Big Dog", "year": null, "lyrics": "If u ain't got shit on your vehicle and a pocket full of money wit a big ol' pistol u ain't no big dog nigga..If yo girl ain't got her hair fixed and all she do is gossip,the problem she ain't got no big dog that got her..If yo block ain't got dat fire and yo soldiers ain't gon ride, that mean they big dog jive..I got dat big dog 45 wit tha spinners and im stuntin, and when im outta town man im still gettin money. That's a boss. I payed a big dog cost, i got a big dog mouth. Bad Azz up in diamonds i barely could talk. I got a mink on ma back wit tha matchin hat.. nextell all black wit tha matchin gat. I got a big dog watch am ticky tock..blue diamonds in that bitch yeah play wit me nah..warner brothers tol me boosie i think ya ready right nah..well im a big dog on tha mic im a celebrity nah. You put dem camras on me wohdie u gon see a big dog..if u ain't know i been retarded way befo' i met yall..in tha mall i big ball wit big boy stacks..ten G's wortha throwbacks, give me tha whole rack..ma nigga bleek call me big dog cat. He in tha streets wit a pocket fulla satch how ima knock em' 4 that..we doin big dog things in a big dog way..we at tha superbowl watchin all tha big dog's play and ima big dog, a big dog..ima big dog, a big dog...i got a big dog team..we doin big dog things we rockin big dog jeans watching them big dogs scream and ima big dog,a big dog..ima big dog,a big dog..YEAAHHH i got a big dog click..we doin big dog shit..and ima big dog on tha mic wit this big dog spit..and ima big dog..i move lean like oscar myer, i more hot dog..i watch screens when im chillin on da block dog..i shot call,and i get all ma people 'cause look we all we got dawg fa real..gucchi look so sick wit tha matchin lights loui vattan dahn wahn we gon ack tonight..i got dem dogs in the trunk and they trashin right..u can hear me 4 u see me thas that savage life..keep ya chain hand low wit dem big ol rims..jeans fit so sick wit dem big ol 10's..ol lady go crazy but she down to ride, she smilin at a big dog wit a 2 on her side..fixin to hit 106 and chill on da couch..but i ain't commin by maself Free im brangin dat south..ceo den did it big and got a big dog house.. 7 rooms and a pool we fixin to set dis bitch off..and ima big dog, a big dog..ima big dog, a big dog..i got a big dog team we doing big dog things we rockin big dog jeans watchin dem big dogs scream. and ima big dog, a big dog..ima big dog, a big dog...YEEEAHHHH..i got a big dog click..we doin big dog shit..and ima big dog on dat mic wit tha big dog spit..and ima big dog..i ain't lyin..im fresh up out tha cleaners i ain't eva gotta iron..got some runners on ma team i ain't eva gotta grind 'cause big dogs they lay back and count stacks and shine! And i smoke i drank..i tote dat iron..but all these rappers out chea trynna still dat line..i got ma hat to tha back like a baseball playa..TRILL ENTERTAINMENT big dog and we takin it there..no belt rocka wear pants hand to ma legs..make it easy for dem skeezers who gon hit dat head..was happnin low legs.. i see u swervin and ackin..herd u kicked tha habbit now u really livin lavish..be on big dog planes..first class me mayne..sit me right on side ghost face and tha wu tang clan..thas how big dogs play..in 2 suits wit 2 freaks sippin alazaye, thas tha big dog way..and ima big dog, a big dog..ima big dog a big dog..i got a big dog team we we doin big dog things..rockin big dog jeans watchin dem big dogs scream..and ima big dog, a big dog.. ima big dog, a big dog..YEEEAHHH...i got a big dog click..we doin big dog shit..and ima big dog on tha mic wit tha big do spit..and ima.........", "image": "https://images.genius.com/bc2a8b48704b247169e8a655e7394834.500x500x1.jpg"}]}