{"songs": [{"lyrics": "It goes welcome the pop off, some pop soft. We bang b-bang b-bang bang out loud. Ready on the left with a face full of death. We slanged out fang mouth bang out now\n\nThis is a never dug disco, Zoo York tycoon, memorandum bonanza banter clamp crunk out the fish bowl. Gorgeous how struggling gills wriggle out water, ain't it? Same scape as the walls crawling with paranoia's plaintiffs. The robo-komodo promo Zen patience a-alike to this jittery drooling mess. Bitterly unruly on mud hugger alert, he usher dirt to the kick circus. Deflected labor ethic questions peeled at the field workers. Is it raw? Please... does a priest need a ten-foot pole to baptize little Linus minus the lap ride and tease? Evolution is a leader depleter, seeker needy sheep idol feeder beware, once complete you might not want to be there. Dead straw to gold bar spin fiber. Lost and fond in a smitten kitten's incisors. They Aphrodite all over the burgle of a purple heart compartment. Marched a burgundy carpet alarmed and far to parched to bark it. Lil' Abner. A real firecracker. Grows to throw 'bows with vehicular hijackers. To eavesdrop plots cops hired a wire tapper. That's a whipper snapper trapped beneath my grip on the fire ladder. Took drums over to deril' to once over the line tones. Punch toothy ticks 'til they find homes like three ruby clicks. The roof is on fire where snoopy sits right now. You should have shot yourself in the foot when it was in your mouth\n\nCHORUS\nThieves in the strobe deep freeze your pose. For the disease that grows underneath your toes holds up a reason y'alls gold never seems to glow. Now we can all breath slow once the fiend's exposed. It goes heave ho. You never got the grit right. Bark fame but you never put the grit down. Hawk styles but you never got the grit right. Put the grit down. Grit right. Get down\n\nThis is a never dug disco defamation of dog and pony grappled out chincey, chipping Leo Da Vinci phonies pushing kill of hill bloated. Nobody got you. While biggest brother's watching bigger brother watching big brother watch you. Nothing says circus fun quite like nuclear holocaust over breakfast on the terrace. Hash browns and peril. Old ironsides or good ship lolli-popper, Davy Jones still got a locker, ak, the opera's more than docs and soccer moms. Now before you kick your feet up, I married and divorced mother nature after sweet-talking that old hag out of a pre-nup. This information's neither braggadocio nor secret, just know as of now the world is technically not yours, peanut. It's a day in the life of the carnie dog-faced boy escapist. Living large, watching Springer, smoking beedies wrapped in bacon. At night his get busy disease leakage peaketh. Merk the he say/she say, BK Jesus turn peg legs to Adidas on the down stroke. And they like 'what's up with the name?' I tell'em y'all made Bazooka Tooth I's about to ask the same. But before you curfew the city and shut down every block, I'd like to say I still Aesop the fuck out of the Rock\n\nCHORUS\n\nThis is a never dug disco. Spread feelers. Tonka zonk Gepetto bred beezers. Jeepers, gee wilikers, goshes galoshes, Christ, god almighty. They tore his limbs off kilter, still the hostage moshes slightly. Hung off the balcony by the skin off his doctor's psyche. He hopes it holds but knows the locusts kamikaze nightly. He woke, corroded buggy facial, insect chopper biting. He's only bones by the time the ungodly body's sighted. He saw the puddle, full color hideous monster Viking. He used to survey if the vermin dined on others like him. He found the fucks indigenous to him and awfully feisty. He grew old awkward grinch and settled into bonkers nicely. I alert vital spider works to cultivate grit, ship the bulk rate shit. Herbie the love bug drugs pulsate whips. Tie in spite for commoner idiocy and good old-fashioned biblical plague. We move units off your pagan escapade. And it's pits to the peg legged. Megas eclipse cripples so that pimp limp's wheel chair basketball when 15 minutes fizzles. Your flimsy frame marks hip-hop's second most tragic event and will 'til Jam Master Jay's resurrection and second death\n\nCHORUS", "title": "Freeze", "album": "Build Your Own Bazooka Tooth", "image": "https://images.genius.com/c13c3481c6173850ec8655539c273134.1000x983x1.jpg", "year": null}], "artist": "Aesop Rock"}