{"songs": [{"title": "I’m So Cool", "lyrics": "[Verse 1: Akala]\n\nIm an emcee first so guess what shithead\nI can be an arrogant prick too dickhead\nWe all got tugs on the road that spit lead\nWhat you choose to promote what’s your intent\nMan done hundreds of shows no deal\nCan count countries I been and I still\nIll shit kill shit red and blue pill shit\nTalk sense but tugs still feel shit\n14 in coliseum with big women\nEvery other week when the shots kept ringing\nSo parden me if I don’t give a fuck lately\nBut half of these bars emcees wanna spray me\nOnly care if you wanna educate me\nOr great emcee like Biggie was baby\nI’ve no response if you hate me\nDon’t lie to yourself claim that you don’t rate me\nWho else can make intelligence seem sexy\nGirls try hard, still can't get me\nGotta be a queen, stay select\nGrown man don’t run when I get a wreck\nNot any girl that can feel the sweat,  heat\nPush the mind sex and I change the technique\nWho the fuck, you wanna claim you rep street\nYou ain't out there with the youts and get deep?\n\n[Hook: Akala]\n\nIm so cool playing the game\nBut I make my own rules\nI'm so cool stay in your lane\nOr you'll get took to school\nIm so cool playing the game\nBut I make my own rules\nI'm so cool, so cool so fucking cool\n\n[Verse 2: Akala]\nMany man talk shit but they got no talent\nEverything that I spit classic\nKnown from Sudan to Zimbabwe the hard way\nLivin’ off the work of the words that the bard spray\nTeaching my shit in the schools since the first disc\nWhat would you think when im there, im a wordsmith\nIn the truest sense of the word have you heard prick\nIt’s a new day absurd with my nerd shit\n…We know Akala we know that he reads\nNever run from no guy and see men bleed\nWe all talk tough on the track oh please!\nYou ain't out there on the steet\nI am not superman\nYou are not superman\nBut I dont need to pretend that I am\nI’de rather fight with the right foe that has stole land\nSoul stone cold put a price on your soul man\nYou can take my wisdom for weakness sweetness\nDon’t belive that ‘turn the other cheek’ shit\nFuck Akala with all that deep shit?\nPlease tell me, really whats street shit\nItalian designers, chilling on the block with you\nShot rocks, pop Glocks, hop blocks with you?\nWe own the straps and the scales?\nOr the fasion sales?\nOr…just pack the jails\n\n[Hook]\n\n[Verse 3: Akala]\n\nA military mind since back in 04\nWho’s relevant from then its oh so poor\nEmcees come through and the last one sees\nAnd im bleeding and breathing the meaning we feel it\nDon’t want credit for the message I discuss\nNuff’ conscious emcees are boring as fuck\nCredit cos my swag, is fly through the roof\nA bop when I spit the fire in the booth\nCredit cos I am the best emcee\nOh lord dear god Just flee fuck me!\nCredit cos I am oh so original\nYou ain't the only bro that knows criminals\nDon’t shout out my OG’s on the track\nThey’re way too serious for all of that crap\nMans that buy yard and (yawnin) in Ghana\nMight be gangstas but always were fathers\nCan't rate man that is smuggling parada\nCos yout dem a struggle its dumb fuck retarded\nFew emcees have got the game twisted\nDon’t be ashamed you’re earnin’ an honest living\nHow many fucked up cos our dad’s in prison\nAnd if they were around there would be less killing\nAnd if you must die then die for the right cause\nDie like a muthafuckin man in the right war\nDie like Toussain\nDie like Dessaline\nDie like Malcom\nScheming on a better dream\nDie for your family\nDie for your Kids home\nDon’t die for a dumb block that you don’t own\n\n[Hook]", "year": null, "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}