{"songs": [{"year": null, "album": "Joyful Rebellion", "image": "https://images.genius.com/d607e78515b082308509a430c21cab39.405x405x1.jpg", "title": "B-Boy Stance", "lyrics": "[K-Os]\nYeah, it's so hard to remain authentic\nEverything around me is changing\nEven the earth is moving through different places in outer space, but one thing remains the same\n(yeah) Til the end of time (uh-huh) I think I'll remain... (yo)\nI think I'll just stay...\n\n[Chorus:]\nA B-Boy, standing in my B-Boy stance [7x]\nA B-Boy, standing in my... yeah...\n\n[Verse 1]\nFrom the top of the highest summit, again we run it\nA hundred and forty-four shimmering lights stunning\nToo quick for the human eye to catch a glimpse\nYou know pimps cannot convince with bigger attempts of MCing\nBlowing word to the wind\nWhile we ascend to limit the sins and pretend\nWe're still human, when in fact we're only half\nThe other path extends infinity do the math\nI try to laugh, but they pull me down like crabs in a bucket\nWith hands in my pocket, how long will it last?\nHeaven only knows, so Kheaven keeps inventing the flows that turns black pros\nTo white foes...You're just supposin'\nHave you heard my words moving at light speed and getting blurred?\nIt's all so incredible, decibels at a glance standing in my B-Boy stance\n\n[Chorus]\n\nThis one leads the way...\n[K-Os]\nBreak\nBreak\nNow cut it up, cut it up back to back\nOn the wheels of steel, cut it up back to back\nBreak\n\nElevate, Meditate, eliminate\nThoughts from my past keep knocking upon my gate\nShouldn't let 'em in, the answers not to debate\nBut to observe the debating and then we can understate\n\n[Verse 2]\nYo party people listen up at the drop of dime\nThey took cameras to africa for pictures to rhyme\nOver old...yes, the great pretenders\nReligious entertainers who want to be life savers\nDamn...another diamond from the mine, another cold secret hoping\nThey can't find, they can't copy or get pictures with no lines\nI guess it's just a case of the blind leading the blind\nBut, I'm flipping and stepping and rocking the roll, taking control\nPaying my tolls, who's in control?\nI'm playing a role so people will remember that\nI'm just a servant of rap, hoping to bring it back\n\n[Chorus]\n\nThis one, leads, the way...\n[K-Os:]\nBreak\n\n[Breakdown]\nI'm just a B-Boy...\nAnd it brings me joy...\nI'm just a B-Boy...\n[???]\nI'm just a B-Boy...\nAnd it brings me joy...\nI'm just a B-Boy...\n\nI'm just a B-Boy...\nYeah"}], "artist": "​k-os"}