{"songs": [{"image": "https://images.genius.com/55c6bfb6928ee69fa076f8f2a3218981.700x700x1.jpg", "lyrics": "[U-God]\nBrand new magnetic Killah Hill scorches\nMonster talk bosses, spank 'em, step into my office\nCrunch time steroid big boy ditches\nEyes that lay for blood money riches\nSwitches thug men gunmen dirty lung sticker\nArch-crime Hitler, lurking with the lifter\nShift the man vs. man heavy on the hands\nChef in the kitchen cooking love love..slam!\nBlow out the stash; keep the bundle in the bush and the trash\nD-up, burn brother for the real..fast\nTerrible lung split frame for reala\nOne-man go low hit man guerilla\nWhispering there something of a thriller, killer\nDrift, dirty fiend snore, scratch and sniff\nDirty tombs diggin' you and my duty\nRudy, mighty rap now toss another beauty\nTruly yours Golden Arms New York native\nTalk, shank in my mouth now gangsta walk\n\n[Hook: U-God]\n(effect)..Rock! Dat's Gangsta\nWhat? Dat's Gangsta\n(effect) Rock! Rock on Dat's Gangsta\nWhat?!\n\n[U-God]\nWhen I pump pump you'll prepare for a lump\nMagnificent funk plus it's wild on the dump\nSuckers can't fuck with the rhymes I conduct\nI fuck this mic like some big Mike slut\nPut your big shoes on now walk your struts\nThought your last rugged cuts was rough enough? Right?\nSnuff you buck you stuck in the guts\nUnattainable thrust plus that hammerhead busts\nOnce I splash acapella wind shaft\nThis sick wild behavior can't shield from the BLAAST!\nThrash mash the pedal now dash\nOutta town slangin' two bricks in my stash\nSound cage of rage livin' that status\nThat murderous thirst that's reign of the baddest\nYou heard it here first one verse then you're caught\nEverybody jumpin' out gangsta walk rock\n\n[Hook : U-God]\n\n[ U-God]\nRaw, cold winds energize rebels\nAll our doors swingin' killing floor level\nExplode code of silence my violence you respect\nLiver than flesh that this mic head the best\nVeteran chest never say die never say rest\nThe hang time derange in this rap game divine\nNow change of the range bang with gansta our line\nBust the falcon mic mountain men you know the outcome\nDefine we pro dynamo I'm still scalpin'\nThe body countin' rhyme drop put it on kill now\nToil your girl in your Cadillac Seville chill\nGolden arch stolen heart no I'm robbin' fed\nBaddest women in the bed nigga mobbin'\n\n[Hook: U-God]", "title": "Dat’s Gangsta", "year": null, "album": "Golden Arms Redemption"}], "artist": "U-God"}