{"artist": "King T", "songs": [{"image": "https://images.genius.com/4ecadf00855c55fe49bd112852218051.704x704x1.jpg", "title": "Black Togetha Again", "year": null, "album": "Tha Triflin’ Album", "lyrics": "And that's how we do\nSmokin em muthafuckas\n\nNo justice, no peace then, Mr. Policeman\nSave a life for your kids and your wife\nNo more donuts and coffee\nAnd I'll be back once I get off these concrete streets\nInfrared scope and I'm mad as fuck\nI'm on the roof tryin to duck from the pigs, cause they suck\nPick em all one by one, cause they all got a strap\nTryin to beat us with the stick and the gat\nLookin at the news and now I see pals\nCarlton, Koons, Hearns comin up sooner than he thought\nIt might be at a stop light or maybe at the station\nEither way it go, I'm stilll makin bacon\nStuff him with a apple in his mouth, make sure he's gaffled\nTie his ass up and bring him back to my castle\nThrow him in the dungeon, leave his badge and his gun\nIn the car, turn it upside down, burn it up\nAnd let it blaze, all I got left is one guage\nI slung all the ones that I brung from the gun\nStore, I gotta get at least three more\nAnd I could give a fuck what you think I got em for\n\nAnd all the King's hoes and all the King's men\nGo try to put this shit black together again\nCome on\n\n12 whites on a black, what's next?\nPull a man out his truck and get stretched\nI got a grudge with the judge\nCause he don't show no love for chocolate fudge\nHe only likes vanilla\nBut we do all the work like Cinderella?\nAnd I'll be damned if I get paid at a minimum wage\nWhile they afford to eat like a smorgasbrod feast\nAnd leave us here down in the dumps\nThe place where Donald Trump would get his ass jumped\nSlavin at Mickey D's for 4 bucks and a quarter\nAnd can't afford a Big Mac with a soda\nThe biggest crooks, the biggest thugs there ever was\nWas the ones that they vote for and hope for\nQuicker than a zig-zag, they got big bags\nFill em to the ceilin, now who's doin the killin?\nThen they point the finger at the young male black\nWorkin two jobs, so he gotta sell crack\nSo all the King's hoes and all the King's men\nGo try to put this shit black together again\nCome on\n\nLet's do it like the wild wild west\nTake off your holster and your gat and let's scrap\nBut Porkey the Pig don't wanna get em up\nUnless you got your hands in some cuffs\nWill I break the law if I break your jaw?\nTurn around take two steps and draw\nAnd make sure your plastic kill\nCause I came to get busy for real\nSo when you jump in my fo'\nMake sure you slam the do'\nAnd no bullshit on my flo'\nCause all the King's hoes and all the King's men\nHelp put this shit black together again\nAnd I'm Audi"}]}