{"songs": [{"year": null, "title": "Come Come Now", "image": "https://images.genius.com/c91c4b7e3aa8a9503855d1070f1f85cd.640x640x1.jpg", "lyrics": "[Verse 1]\nLet me rub my back against the notches on your bedpost\nScratch these afterthoughts off my flesh and shed ghosts\nMy head's close to your closet door, I've got the glass to my ear\nMy nose is in your business I smell something fishy here\nI hear bones rattling. Poems battling for space and time\nPhones that'll ring when I make judgment calls with pick-up lines\nSexual hang-ups leave me waiting nude and while alone\nIt just gets aggravating masturbating to a dial tone\nI'm the home to run-away trains of thought\nMy one track mind is a collision inter-course where victims cross\nBedroom eyes...Uncross their legs exposing inner thighs\nI disrobe and show my most convincing disguise\nI've lived so many lives each death has left my face scarred\nHid so many lies under my breath that I can't face God\nDig into my mind deep enough you'll find a graveyard\nI get nervous bodies will resurface every time it rains hard\n\"Don't cry, girl.\" Let me outline your short comings\nWhile my world is full of them and they're all in the long runnings\nIt's all fun and games. It's all done in vain. It's all a fucking shame\nI ain't the one but I'm the one to complain?\n\n[Hook]\nI'm the one to come home. Compare. Contrast\nCome fast. Make love to the present, fuck the past\nMake love to the present, fuck the past. Nothing lasts\nDon't you dare worry about the morning aftermath (yeah!)\n\n[Lead-in]\nDon't you love how much you paid for your education? (yeah)\nDon't you love your job and spending every day there? (yeah)\nDon't you love your girl? You have such a healthy relationship. (yeah)\nDon't you love having that break-up sex, that make-up sex? (yeah)\n\n[Verse 2]\nTaking an acid bath, pissing on the shower curtain\nThe gal just laughs and starts dissing my towel turban\nI had to ask if she knew how to listen now I'm certain\nNow my task is just to get up in her like I was a surgeon!\nI'm a virgin who makes exceptions at sunset\nMy dirty skin gets cleansed by the summer sweat\n\"Self, have some respect! I don't need you new and clean\nBut I don't want the procedure routine!\"\nA screw machine! with a few bolts loose. Robot response touch tone\nHair trigger, happy-go-lucky emotion monger wants a love poem\nRun home. Dip into your closet and jump bones\nYour secret admirer's stuck higher up and he's unknown\nLooking down on you. Can you bare the burden?\nMy ears are hurting. I found a few gears are turning\nWith squeaky wheels. They get the grease cause its a damn nuisance\nUnderstand the blueprints for our mechanical movements\nIt never ran smooth since we abused the Earth\nGrabbed a hand full of pubics and removed the turf\nRefused its worth, we lose our shirts. She assumed the worst\nAnd needed proof of birth? I'm leaving this universe\nIt seems doomed and cursed. See if you come first then come fast\nCome here. Come back. Compare. Contrast\nComplain. Constrain. Constantly ask\nComplicated questions contain scientific answers in your flask\nCondone. Condemn. Come home. Come friend\nConfuse. Common issues. Condelude. Comprehend\nKarma. Chameleon. Come again?\nContinue to come in you. Come to daddy. Condescend\nCome and bring us (Confidence). Cunnilingus (Compliments)\nCome to think us went from guilty consciousness to common sense\nCalm down. Complete. Compound. Come eat\nOur Common ground meat from man-made concrete\n\n[Hook]\nCome to the street. Conquer the weak. Come to terms with coming last\nMake love to the present, fuck the past\nMake love to the present, fuck the past. Nothing lasts\nDon't you dare worry about the morning aftermath. (yeah!)\n\nDon't you wanna take a shower with me? Clean me up. (yeah)\nKill yourself...while you're still alive\n(Kill yourself) while you're still alive while you're still alive. (3X)\n\n[Poetry]\nSee when you put a shell to your ear, it is not the sound of crashing waves\nThat you're hearing. It's the amplified current of your own bloodstream\nIt was your self-pulse that created that post-human illusion of me. Your\nTireless heart pumping out an ocean of lies and I foolishly tried filling\nImpossible shoes resulting in my stumbling as I fell into the trap of making\nA woman my element. Now I just can't get comfortable being out of you...", "album": "Still Sick... Urine Trouble"}], "artist": "Sage Francis"}