{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "Intro Joint", "lyrics": "Daddy-O, Daddy-O from Stet?\n\tWord black!\nC'mon man, you buggin\n\tYo, the one and only\nYou zonin now with that\n\tDaddy-O money, I'm tellin you!\nYo (?), yo hold up hold up hold up\nBrother's comin back\nBut what's Daddy-O gon' come with in 1993?\nHe better come right\n\tI don't know!\n(Yeah, here we go)\n\n[Daddy-O]\n1993, and we say..\nI'd like to give a big up to my East coast peeps\nShowbiz and A.G., P.E., B.D.P\nG. Rap and Polo, Lords of the Underground\nThey got it goin on\nThe West coast got flavor too though\nCause they got the Fellowship Shop and uh\nHieroglyphics got props\nAnd I couldn't wait for Snoop Doggy Dogg's LP to drop\nBig up to my man Ice-T! (Big up..)\n+Cop Killer+ and all that, congrats on the new label kid\nBlow up, blow up!\nYo, I'd like to give a big shout out\nTo my producer on the board, my man Ed man\nBreak it down Ed (ahhhhhh)\nYo one more time one more time (Ed, Ed..)\nI like that.. my man, Rich Crash is on the set\nThe engineer, we don't wanna say all-star\nCause we ain't down with that Juice Crew thing\nBut anyway, after this roll come up right\nI wanna give a big shoutout to my management record company\nMy little bro Kedar, shinin like a star\nTo my Atlanta crew, Arrested Development and all them\nThey got it goin on\nMy crew in Minneapolis, the Inner Sanctum\nBig Tim from the Group Home, they got it goin on\nAnd to everybody from Brooklyn for stayin behind me all this time\nLatin Quarter days, (??) allathat, check this out\n\nDo you believe in survival?\nHere's a little touch of that new school stuff\nCan't grow it on trees, it's a special blend\nOf them herbs and spices that make you go nutty\nBrand new year, so I gotta make the style match\nNine-to-the-three still equals three\nThat's one for the money and two for the show\nThree for the rhyme and the way the horns blow\nSorry if you missed me, now I'm back\nSo you can all get with me, that's a fact\nDon't ever try and diss me, if you do\nI'll turn you blue, and have to bury my shoe\nInside your dome, I'm back from my stay away\nWhen you bought my tape, you declared a Daddy-O day\nWhen I make music, they play it in the Jeeps\nAnd it sounds SO good, you wanna run and tell your peeps\nThat the O's got a new way, of makin the rhyme flow\nYou know I ain't (?) so act like you know\nThose who doubted and continue to bite\nThey can deepen it in and you can chew all night\n\nBig up to my man Little Rob he's in the house\nAnd he got it goin on\nTo my Uptown crew, my nephew Hasi Boom\nOn the tapes and all that\nTo all the Uptown DJ's\nRon G and Kid Capri and all of them\nFor makin them bad ass tapes we play in the Jeeps and the cars\nCongratulations, the Fever's back open\nGotta thank my man Big Sal for that\nAnd before I get outta here\nI just got one thing to say to y'all\nY'all got a lot to worry about\nMike Tyson is a Muslim now, I'm out\n\n(Yeah, yeah, give it to 'em Daddy\nGive it to 'em Daddy, a let me have it Daddy\nAlright Daddy, bring it to me Daddy\nGive it to 'em Daddy, a let me have it Daddy..)", "year": null}], "artist": "Daddy-O"}