{"artist": "Cam’ron", "songs": [{"title": "Dipset Hot 97 Freestyle", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Cam'Ron]\nNew York City, you are now tuned in to America's # 1 station, Hot 97\nIn conjunction with America's # 1 DJ, Funkmaster Flex\nIn collaboration with America's, pardon me, #1 independent rap label\nDipset\nAnd right now I'm accompanied by greatness\nUhh-huh\nMy man Hell Rell's in the building, BX borough. Uhh-huh\nJ.R. Writer's here, you know he's the writer of writer's\nRight now, I don't know where Santana's out, he probably in Brazil\nAct up homie. They told us not to stay at Def Jam, we eatin' over there\nYou was right, put work on they block. Sell more than they sell\nI feel you. Ayo Capo act up. Do what you do homie. Go ahead homie\nI'm waiting in the wings for somebody to act stupid. I'm right here\nYou heard. I used to be Jaffe-Jo, I used to be Killa\nI think I'm go with something different this year. I'm go with\n\n[Hook: J.R. Writer and Cam'Ron]\nYo! We Guerrilla breathin', we Guerrilla breeding\nIt's the Dips, get the drift, This is Killa Season\nWatch him kill the season, Paid checks heavy\nIt's King Jaffe-Jo get ya tape decks ready\nWe Guerrilla breathin', Killa Season\nFeel the Evening, Killin' Season\nWatch him kill the season paid checks heavy\nIt's Diplomat Records get ya tape decks ready\n\n[Cam'Ron]\nSay what cats did I hang with, slang with, bang bang with\nBlain gangsta ganked it left lane to the banquet\nLive from the borough where Rich Porter became Rich\nPurple Rain in the rain explains it, on that same spit\nTo the day of a reign, I aim and flame for your lame\nThe clips change, obtain bricks, exchange bricks\nBricks exchanged, throw the kid some change\nLook homeboy, I ain't trying to get no names\nMust of sniffed cocaine, looking at my Diplo chain\nThe biscuit turn you to bisquick mixed with shrimp lo mein\nOld ladies just stop and say \"it's yo thang\"\nCan't deny 'em, look down my wrist go bling\nBling bling, listen in, come and get some cash\nFirst kiss my ring, ohh no, well kiss my ass\nBack in my zone homes, get ya mind right\nThe 2-3 or 3-2, nah it's the twilight\nIt's the highlights of my life\nEvery gun, car, crib, chicken-head that I like\nTen on the dope, ten that's beside knife\nTen in the hood, ten that's besides night\nAnd they tied tight, my family ties tight\nTen town, 200 bricks, forget 5 mics\n\n[Hook: J.R. Writer]\nYou gotta feel the heathen, we guerrilla breathin'\nIt's the Dips, get the drift, this is Killa Season\nWatch him kill the season, paid checks heavy\nIt's King Jaffe-Jo get ya tape decks ready\nYou gotta feel the heathen, we guerrilla breathin'\nIt's the Dips, get the drift, this is Killa Season\nWatch him kill the season, paid checks heavy\nIt's King Jaffe-Jo get ya tape decks ready\n\n[Cam'Ron]\nThat's 1 and out, let's go, let's keep it moving. That's 1 song\nI mean let's go, you want to get... I mean Hell Rell you ain't say nothing that song\nLet's go, Let's go. I mean that's 1 and out. That's 1 song down\nThat's heat rock. Let's go. I'm step out. J.R. lace 'em up\nI'm come back in a minute. Ya'll get busy\n\n[Hell Rell]\n\nAlright we got this man\nLet me hear a hook on this\n\n[Hook: J.R. Writer]\nIt's kind of hard to doubt that we ain't a slaughterhouse\nDip radio you're now tuned in to the Hardest Out\nSlash the first to ride, you ain't never heard of fly\nCall it how you want in nigga my G's is certified\n\n[Hell Rell]\nYo I slow flowes y'all to death\nThese hustlers acting like they coke hard to stretch\nAny broads wanting me to put cash in they purse\nLike they wrote half of my verse, nope\nI give a few some credit,tell ya dude bring my cash on the first\nPlus I hold a welfare card cause that's how I work\nI'm bout to buy a Aston Martin, throw you in the trunk\nBe at the Funk Flex show, with you in the trunk\nIf they said I couldn't do it, they put me to the test\nBut I proved to all them suckers I was worthy of success\nTeacher said I was a uhh, was wasting time in her class\nIt was more like she was wasting mine, I had them dimes on the ave\nMamma said I was a dead shot locked up in a can\nNope, got it popping with Cam, up in a drop like Shabam\nBut why they knocking that man, cause of the rocks on his hand\nOr the Air Forces they'll never see cause they got copped at Japan\nDamn, man I know he a gangsta, and he pop his steel\nHe supposed to be dead or locked up why he got a deal?\nHe was just shooting a uzi, now he shooting a movie\nAnd all his mans starting to act like groupies\nI slow flowed y'all to death\nThese hustlers acting like my flow hard to catch\nMan Diplomats we the strongest force\nOn or off the court we ball and ball the sport\n\n[Hook: J.R. Writer]\nIt's kinda hard to doubt that we ain't a slaughterhouse\nDip radio you're now tuned in to the Hardest Out\nSlash the first to ride, you ain't never heard of fly\nTake it how you want it coward our G's is certified\n\n[Hell Rell]\nSleepin' high with visions of my enemies\nBeggin' for mercy crawling on the floor like a centipede\nScreaming Rell please don't shoot me I got children\nShould've thought about those snotty nose kids when you was snitching\nBut now I'm on a mission, yeah fresh out the kitchen\nA stand up dude who only sit when he shhh\nYou sit when you pissing, dude listen\nMy talent was God-given, got wise by hard living\nI Sleep all day, smoke haze, ménage women\nI spit these hard rhythms it feel like a car hit 'em\nSo leave that boy a lone can't you see he in the zone\nDudes try to be like 'em can't you see he getting cloned\nAll this blue and this yellow can't you see it in the stones\nAnd yeah we brought them hammers Cam we never leave 'em alone\nSo move back, I'm poppin off the 4\nHeaven let me in because I'm knocking on ya door\nIt's Prada on my whores\nAnd nah I don't really do to many funerals, but I gotta go to yours\nI gotta see the face of a coward\nPlease man let the homie breathe give me a taste of the power\nMy chain hate my watch, my watch hate my ring\nMy jewelry going crazy, gotta get some new bling\nSo all praise is due to Hell Rell it's the new religion\nSmack ya girl pop 2 in her True Religions\n\n[Hook x2]\n\n[Cam'Ron]\nThat's 2 and out. Let's go Dennis. You moving slow Dennis\nLet's go Dennis. That's 2 and out good work. Good work\nJ.R. you up man. Hold on. Stop it. Stop it\nD, I mean, you got something to say. That's 2 and out\nWe early. Koch put that E.P. together. That's 2 songs\nNuts and dirty (Funk Flex). I mean come on. I mean excuse me Flex\nExcuse me, 2 minutes. Can I get 2 minutes. Let's do what we told to do\nNew York we run this here. I mean Pardon, listen it's J.R.'s turn\nI'm do the chorus, you ready? Let me get this son. I just wrote son\nLet me see I'm... It's my turn I ain't get a chorus off yet\nI'm go in first then. Alright\nThat's 3 songs and out. Let's do it\n\n[Cam'Ron]\nMy dude riding, he riding in Lamborghinis\nThe oyster mixed with Linguine, you hear me?\nHe's a rider!\nAll in together, together we getting cheddar\nYo cheddar we get together, you hear me?\nHe's a rider!\nMy dude riding, he riding in Lamborghinis\nThe oyster mixed with Linguine, you hear me?\nHe's a rider\nAll together, together we getting cheddar\nYou dude's you know better, why?\nHe's a rider!\n\n[J.R. Writer]\nListen pal, I ain't gotta spit, child you was not as sick\nFoul for a while, look my style is anonymous (Anonymous!)\nPound for pound of piff, smile cuz I'm drowning it\nYous a fake G like a thousand in counterfeits\nI can show you how to flip that bird\nHow to hit that curb, how to get that served\nYoungin, I'm the shhh, that's word\nYous a prick, fag, herb, you get pimped slapped heard?\nHuh, come get wit a rebel, I'll put the kick to the pedal\nThe clip and the metal, I'm sickening nephew\nListen here...Your F-in engineer couldn't get to my level\nDipset is forever B, bet y'all remember me\nStretch all my enemies, heckler send 'em three\nBut, I got a tek that'll get a G\nTo drop his flag like a ref on a penalty\nI'm fresher than lemon squeeze, wrist wrap chill\nPitch black car wit them pitch black wheels\nNice more stash box, big black steel\nLeave you at the red light, the kid's that real!\nStepping in his Nikes, freshest in your sight\nYou ain't never seen these F-in Pella in ya life!\nI throw on fresh gear, throw on fresh wear\nThis is something you will have to throw on next year, Yea!\n\n[Hook]\n\n[J.R. Writer]\nListen scrap believe me, you need crack to see me\nI'm a classic, one of your old scratched up CD's\nNigga Check my swag it's easy\nThat you can see I do the damn thing and I ain't Fab or Jeezy\nI stepped through the trap wit Weezy\nFront of the tenements\nPosted up on post, hundred Dominicans\nThat'll clap you soon as you go to beef wit J\nThrow a couple at you once they hear Dida Le!\nPut your brains all across the pavement\nYou niggas singing like you singing how you talk to agents\nBut drop my name, and I'm a stop\nThrow in a box like some cats at a hop-scotch game\nI copp drops mane, come peep what I whip whore\nA 62, got it jumpin like a 6-4\nSoon as I hit tour, brrr, caught a chill\nSleeves on freeze, add up to a quarter mil!\nI'm bout to talk my deal, that's what a thug about\nKilla, hit Sharon, tell her I need another house!\nI dig ya mother out, then put her in a cab\nGas her up then hit the hooker wit them slabs\nWhat you think? Naw I ain't a rookie wit it fag\nShe'll have to boof that in a cookie like a pad\nYou rookies are just mad, you can't say shit to me\nYou gotta get rid of me, I'm bout to make history\n\n[Hook]\n\n[Cam'Ron]\nI mean, hold on, that's three and out, hold on\nDon't even play yet put that on pause B\nNew York City, we gonna take a slight intermission\nBecause if you do this up here, you bitin\nWe knocked three songs out. You can only do it in one take\nThat means we didn't punch in. That means I one taped it\nJ.R. one taped it. Hell Rell one taped it. We chorused it out\nThat means the business is right\nThe rhymes is right and if you come up here and try freestyle a song\nYou're bitin (you swagger jackin)\nI mean you did a solo song Hell Rell right\nThat means you repped BX Borough, you repped the Dominicans\nI'm 140 and Lennox to the death\nSo we might as well do something together\nCapo get ready to take the motherfu...uh\nCapo take the Maserati up to 200, we goin in, lets go\nTape this for Santana when he get back\nLet's get 16's off, I got the chorus on this, y'all back up\nLet's go, I got the chorus\nYou ready, New York City we run the motherfuckin building, pardon me\nTake it, take it back B I messed up because I'm talking too much\nTake it from the top. Take it from the top\nNew York, I mean, I mean I know y'all gon home and write hard tonight\nI know y'all gon home and write hard tonight\n\n[Cam'Ron]\nYa'll Diplomats, y'all kickin this chicken scratch\nWhat you can't g-get wit that, homeboy go flip a pack\nDip-Dip-Dip-Dipset!\nDip-Dip-Dip-Dipset!\nI said It's the Diplomats, what y'all kickin this chicken scratch\nYa'll can't g-get wit that, homeboy go flip a pack\nDip-Dip-Dip-Dipset!\nDip-Dip-Dip-Dipset!\n\n[J.R. Writer]\nListen, I'm worth a couple figures, always hurting all these niggas\nThat I'm OC, tryin to stuff the purple in the swisher\nConvertible just picture, how I swerve up on your sister\nWit a dance, tip dance that'll turn her to a stripper\nYa the burner by the zipper, burn em, turn 'em to a pisser\nShit 'em mister in a river, you going to learn that I am sicker\nDetermined to be bigger, birds I serve 'em to these niggas\nCall the cops, they ain't seen these type of murderers since Hitler\nShit if I know em, I'm quick to expose 'em\nWristery frozen, reason why your chick on my scrotum\nI'm lifted and potent on some shit that is potent\nFresh out the pot, 2Pac couldn't picture me rolling\n\n[Hook: Cam'Ron]\nI said It's the Diplomats, y'all kickin this chicken scratch\nYa'll can't g-get wit that, homeboy go flip a pack\nDip-Dip-Dip-Dipset!\nDip-Dip-Dip-Dipset!\nI said It's the Diplomats, what y'all kickin this chicken scratch\nYa'll can't g-get wit that, homeboy go flip a pack\nDip-Dip-Dip-Dipset!\nDip-Dip-Dip-Dipset!"}]}