{"artist": "Immortal Technique", "songs": [{"title": "The Cause of Death", "lyrics": "[Intro]\nImmortal Technique\nRevolutionary Vol. 2\nYeah, broadcastin' live from Harlem, New York\nLet the truth be known!\n\n[Verse 1]\nYou better watch what the fuck flies outta your mouth\nOr I'ma hijack a plane and fly it into your house\nBurn your apartment with your family tied to the couch\nAnd slit ya throat so when you scream only blood comes out\nI doubt that there could ever be a more wicked MC\n'Cause AIDS-infested child molesters aren't sicker than me\nI see the world for what it is, beyond the white and the black\nThe way the government downplays historical facts\n'Cause the United States sponsored the rise of the Third Reich\nJust like the CIA trained terrorists how to fight\nBuild bombs and sneak box cutters onto a flight\nWhen I was a child, the Devil himself bought me a mic\nBut I refused the offer, 'cause God sent me to strike\nWith skills unused like fallopian tubes on a dyke\nMy words'll expose George Bush and Bin Laden\nAs two separate parts of the same seven-headed dragon\nAnd you can't fathom the truth, so you don't hear me\nYou think Illuminati's just a fuckin' conspiracy theory?\nThat's why conservative racists are all runnin' shit\nAnd your phone is tapped by the Federal Government\nSo I'm jammin' frequencies in your brain when you speak to me\nTechnique will rip a rapper to pieces indecently\nPack weapons illegally, 'cause I'm never hesitant\nSniper-scopin' a commission controllin' the President\n\n[Hook]\nFather, forgive them, for they don't know right from wrong\nThe truth will set you free, written down in this song\nAnd the song has the Cause of Death written in code\nThe Word of God brought to life, that'll save your soul\nSave your soul, motherfucker, save your soul!\n\n[Verse 2]\nI hacked the Pentagon for self-incriminating evidence\nOf Republican-manufactured white powder pestilence\nMarines Corps. flak vest, with the guns and ammo\nSpittin' bars like a demon stuck inside a piano\nTurn a Sambo into a soldier, with just one line\nSo here's the truth about the system that'll fuck up your mind\nThey gave al-Qaeda six billion dollars in 1989 to 1992\nAnd now the last chapters of Revelations are comin' true\nAnd I know a lot of people find it hard to swallow this\n'Cause subliminal bigotry makes you hate my politics\nBut you act like America wouldn't destroy two buildings\nIn a country that was sponsorin' bombs dropped on our children\nI was watchin' the Towers, and though I wasn't the closest\nI saw them crumble to the earth like they were full of explosives\nAnd they thought nobody noticed the news report that they did\nAbout the bombs planted on the George Washington bridge\nFour non-Arabs arrested during the emergency\nAnd then it disappeared from the news permanently\nThey dubbed a tape of Osama, and they said it was proof\nJealous of our freedom? I can't believe you bought that excuse!\nRockin' a motherfuckin' flag don't make you a hero\nWord to Ground Zero\nThe Devil crept into Heaven, God overslept on the seventh\nThe New World Order was born on September 11th\n\n[Hook]\nFather, forgive them, for they don't know right from wrong\nThe truth will set you free, written down in this song\nAnd the song has the Cause of Death written in code\nThe Word of God brought to life, that'll save your soul\nSave your soul, motherfucker, save your soul!\n\n[Verse 3]\nAnd just so conservatives don't take it to heart\nI don't think Bush did it, 'cause he isn't that smart\nHe's just a stupid puppet takin' orders on his cell phone\nFrom the same people that sabotaged Senator Wellstone\nThe military industry got it poppin' and lockin'\nLookin' for a way to justify the Wolfowitz Doctrine\nAnd as a matter of fact, Rumsfeld, now that I think back\nWithout 9/11, you couldn't have a war in Iraq\nOr a defense budget of world conquest proportions\nKill freedom of speech and revoke the right to abortion\nTax cut extortion, a blessing to the wealthy and wicked\nBut you still have to answer to the Armageddon you scripted\nAnd Dick Cheney, you fuckin' leech, tell them your plans\nAbout building your pipelines through Afghanistan\nAnd how Israeli troops trained the Taliban in Pakistan\nYou might have some house niggas fooled, but I understand\nColonialism is sponsored by corporations\nThat's why Halliburton gets paid to rebuild nations\nTell me the truth, I don't scare into paralysis\nI know the CIA saw Bin Laden on dialysis\nIn '98 when he was top ten for the FBI\nGovernment ties is really why the government lies\nRead it yourself instead of askin' the government why\n'Cause then the cause of death'll cause the propaganda to die\n\n[Outro]\nHe is scheduled for sixty minutes next. He is going on French, British, Italian, Japanese television. People everywhere are starting to listen to him—it's embarrassing!", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}