{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f1ce17fdad92806e2e9b19241838f42f.1000x1000x1.jpg", "title": "Southern Fried", "year": "2012-05-15", "album": "R.A.P. Music", "lyrics": "[Verse 1]\nWelcome to this country fried bonafide\nAnd my flow is sweet as a potato pie\nNever been a sour apple, I'm a now-or-later guy\nI'mma tell her something sweet and she gon' lick me later, guy\nHello to my hater guy, how you doing sir\nI know you got mean words\nBut keep them to yourself unless those murders will occur\nCause I'm from killa kill Adamsville right next door\nBowen Homes and Dixie Hills, Allen Temple Wildwood and Plainville\nThese motherfuckers murder here in plain sight\nEveryday broad daylight, they ain't right\nShit's loco out in Zone 4\nSince the '80s it's been that way though\nMy nigga uncle died shooting back at the po-po\nHe went out but he ain't go slow though\nEven hit the cop back with the 4-4 though\nGot buried in the Rolex, Jordans and a Polo\nNigga died pretty as a pimp in a photo\nWoah-Woah-- Yeen heard fat boy\nHe ain't say that boy, don't even try to act, boy\nThat fat black motherfucker got a way with the words\nI tell you, he can rap, boy\nRespect my words like a rabbi\nI'm a porterhouse, you a motherfucking ribeye\nHate on me to your girlfriend, she gonna look you dead eye\nTell you \"So? Motherfucker he still fly.\"\n\n[Hook]\nAin't I fresh, Ain't I clean?\nAin't I riding through the city in the meanest machine?\n(Ain't I??)\nAin't I one-hundred player for sure\nAin't I slick bout pimp game and just might mack on your ho\n(Ain't I??)\nAin't I fresh, Ain't I clean?\nAin't I riding through the city in the meanest machine?\n(Ain't I??)\nAin't I one-hundred player for sure\nAin't I sleep my pimp game and just might mack on your ho\n(Ain't I??)\n\n[Verse 2]\nSo fresh, so clean, rolling down the street so slow, so sweet\nLike a cup of codeine. Smoking on that Irene\nWith a sweet country girl named Irene\nI lean, Feeling irie, I be\nStrapped to the motherfucking T so please don't try me\nMy Chevrolet lay butt naked on the asphault slow flashing her high beams\nAnd I'm still in the company of Irene and we been joined by Maxine\nWe maxing, relaxing, chilling, double-stacking\nAnd me being the West Side player that I be I'm trying to see what's happening\nAnd what's happening? But not menage, in my garage\nWith these two young ladies, is the reason I I-dee-daz\nThat's \"All Day I Dream About\" That sexing\nYou texting, hoping that they call you\nI just barbecue and call 'em up and say \"Hey fall through\"\nYou know it's shrimp and lobster tails\nAnd they into a room with lots of players\nMy partners young black millionaires, and they all about some money\nYeah youngin it's a double entendre, you ain't gotta wonder when you ask for Wanda\n\"What you been doing?\" \"Hanging out with Shawnna.\" Yeah, you nuttin' honey\n\n[Hook]\n\n[Verse 3]\nMoet? Rolex. Big Benz, no flex\nWedding ring on finger, I married a Trina\nPretty as a singer, Fine as a stripper\nWhen we in the strip club strippers try to tip her\nI don't want no dance, ho, get up off my zipper\nYou ain't try to rip me if you ain't try to rip her\nWe like Bun and Pimp bitch, see we is a duo\nThis that Ball and J shit, we don't need no new ho\nSee I've got a suave mouth which purchases my suave house\nThis that 2Live Crew Shit, I rap a lot about new shit\nThis that country rap tune southern fried funky shit\nI am the antithesis or opposite of monkey shit\nAnd that's some education for ya'll thinking we unlearned\nCause I often play that Gucci crew and walk around with perms\nAnd we bought them '95 Impalas paint them bitches orange\nWe gang-stars like Preem and Guru cause respect was hard to earn\n\n[Hook]"}]}