{"songs": [{"year": null, "image": "https://images.genius.com/a96ea234d3e0ea068a71f09414207f4b.360x360x1.jpg", "title": "All Day, All Night", "album": "The Story", "lyrics": "[Intro: Bizzy]\nAin't she bueno, mi amor\nI represent a, dios, the uno\n\n[Bizzy Bone]\nAnd I was told to write this\nMiss you in the worst way, I can't fight this\nGive me a stick or a candle so I can light this, c'mon\nBaby I love you, and I was told to write this\nMiss you in the worst way, I can't fight this, huh\nGive me a stick or a candle so I can light this\nBaby don't wanna hit it, is you chicken like Tyson?\nBaby you hear me, for the moment while I'm walkin in the Garden\nMadison Square, New York, New York, whatever I beg your pardon\nI been lookin for you, not to be a stalker so I'm keepin my distance\nI'd rather sing to you and hope that you'll listen\nI'm reminiscin on the rib, how much did I give?\nKeep that money honey, I can eat Ramen Noodles and live\nWhat about the kid, ain't the children, better watch those numbers\nI got on my silk clothes, I'm so prepared for the slumber\n\n[Hook: Bizzy Bone]\nWe go all day, all day, all day\nAll night, all night all night\nAll day, all day, all day\nAll night, all day all day all day all day... {*echoes*}\nAll day all day all day all day... {*echoes*}\n\n[Bizzy Bone]\nI hear you whiskin me away, in a brand new ride\nI don't have to worry 'bout the Caeser, and the money's inside\nThe father tellin me to win, and I'm goin for mine\nYou can reject me if you wanna, it's the sign of the times\nI like the {?} after the rhyme, the beef prime\nBaby I don't believe you but I'm feelin you Bryon\nIt's all good, wanna cry, your presence steadily takin me\nIn the same direction, of the Father who made me\nIt's gettin crazy in the Garden of Eden without my lady\nBaby, can't you see, that I'm yo' baby\nWalkin around and I'm thinkin of you\nAnd I feel like you cut my fuckin head off, but I know it's not true\nI see you throwin up the one more and more and more and more than ever\nForever your love I spiritually kiss you I can remember\nI see you throwin up the one, more and more and more\nForever your love I spiritually kiss you I remember\n\n[Hook: Bizzy Bone]\nAll day, all day, all day\nAll day, all night all night\nAll day, all day, all day\nAll day, all niiiiiiight... in another life {*echoes*}\nBlast on these motherfuckers!\n\n[Bizzy Bone]\nIn another life, when you held me close\nSaid it'll be all right, and you love me so\nScreamin your name and I'm feelin like you predicted it\nBut baby I didn't plan it but it happened little baby, didn't it?\nYou feelin it the love of the Father, so subsidiary never\nIt's the love of the people that we cherish like September\nI cherish your voice, your spirit and yo' life and your breath\nI feel you righteous, I feel you righteous to death\nSo tell Alicia, love and respect, and of course, the kid in love\nI got a question what they say I've been waitin, from up above\nTryin harder everything, but you stay in my heart\nI'm finna cry little baby don't even start\nYou better believe it, 'lieve it\nAll day - you better retrieve it, 'trieve it {*echoes*}\n\n[Outro: Bizzy]\nAll day, all day, all day\nAll day, all day all day\nAll day, all day all day\nHaha, yeah\nOne time for they mind, what?\nOne time for they mind, what?\nBuck, buck buck, buck buck\nOne time for they mind, what?\nOne time, one time, one time for they mind, what?\nOne time, buck buck buck buck buck buck buck buck!\nBrrrra, brrrra, brrrra, brrrra, brrrra, brrrra, brrrra, brrrra!\nOne..."}], "artist": "Bizzy Bone"}