{"songs": [{"lyrics": "EPILOGUE\n\nOprah and I have since gone on to become friendly acquaintances, after having only observed each other warily from a distance. But it was a fascinating moment to me. Rap, as I said at the beginning of the book, is at heart an art form that gave voice to a specific experience, but, like every art, is ultimately about the most common human experiences: joy, pain, fear, desire, uncertainty, hope, anger, love--love of crew, love of family, even romantic love (put on \"The Miseducation of Lauryn Hill\" some time and tell me rap can't be romantic--or if you want to keep it street, put on Mary J. Blige and Method Man's \"I'll be There for You/You're All I Need to Get By\"). Of course, in the end, it may not be the art form for you. Oprah, for instance, still can't get past the n-word issue (or the nigga issue, with all apologies to Ms. Winfrey). I can respect her position. To her, it's a matter of acknowledging the deep and painful history of the word. To me, it's just a word, a word whose power is owned by the user and his or her intention. People give words power, so banning a word is futile, really. \"Nigga\" becomes \"porch monkey\" becomes \"coon\" and so on if that's what's in a person's heart. The key is to change the person. And we change people through conversation, not through censorship. That's why I want people to understand what the words we use - and the stories we tell - are really about.\n\nAnd that's why I wrote this book. I love writing rhymes. There's probably nothing that gives me as much pleasure. There have been times in my life when I've tried to put it to the side--when I was a kid, so I could focus on hustling in the streets, and when I was an adult, so I could focus on hustling in the boardroom--but the words kept coming. They're still coming and will probably never stop. That's my story. But the story of the larger culture is a story of a million MCs all over the world who are looking out their windows or standing on street corners or riding in their cars through their cities or suburbs or small towns and inside of them the words are coming, too, the words they need to make sense of the world they see around them. The words are witty and blunt, abstract and linear, sober and fucked up. And when we decode that torrent of words — by which I mean really listen to them with our minds and hearts open — we can understand their world better. And ours, too. It's the same world.", "title": "Decoded: Epilogue (Excerpts)", "image": "https://images.genius.com/cd82af9edae1d0812bf89a57ee3a25ba.722x890x1.jpg", "year": "2010-11-16", "album": "Decoded (Excerpts)"}], "artist": "JAY-Z"}