{"artist": "Fabolous", "songs": [{"year": "2007-06-12", "album": "From Nothin’ to Somethin’", "image": "https://images.genius.com/8950eda6d686928a4bd0d69fd87a0b3a.1000x1000x1.jpg", "lyrics": "[Intro - Funkmaster Flex]\nIs Brooklyn in here tonight?!?!?!?\n\n[Hook: Notorious B.I.G.]\nWhere Brooklyn at?\n\n[Verse 1: Fabolous]\nWe right here, Big\nYour boy sitting on top like a hair wig\nBed-Stuy fly, Bushwick sick\nEast New York walk the Brownsville grill, ill\nYou see, I got a Fort Greene lean\nClinton Hill chill, Red Hook look, man\nAin't no shook hands in Brooklyn\nSon, your life can get took, man\nThen threw off bridges\nOne hard top, two soft bitches\nRide through the borough with two four fifths-es\nPhantom open up like two door fridges\nI make 'em change the New York digits\nFrom 718 to 187, from 212 to 211\nYour boy's back with a new one son, huh!\n\n[Hook]\n\n[Verse 2: Jay-Z]\nI'm right here Fab, waving the flag, I'm from Nostrand Ave\nI came to take the game in my Daddy Kane chain\nNiggas gave it up smooth\nThey ain't want to hear the bang, BANG\nI'm back on my bully shit\nThat Flatbush, Bushwick black hoodie shit\nHalf a billie in the bank roll\nBank stop anybody, what's your bank, ho?\nBig B's on the wheel\nSpread love the Brooklyn way, B how's it feel?\nI'm on my Robin Thicke shit\nShit ever gets thick, back to robbing niggas quick\nTrick, click, ante up\nAll you niggas Britney, pull your panties up\nWhole borough is with me, hold your cannons up\nBuck one for Bucktown, Brooklyn, what the fuck?!!\n\n[Hook]\n\n[Verse 3: Uncle Murda]\nI'm right here Hov! East New York, Uncle Murda feeling good\nI hooked up with Jigga, got my grandma out the hood\nMarcy is back -- now look at niggas\nNow they can't say Jay ain't sign a Brooklyn nigga\nWhere Brooklyn at? Where Brooklyn at?\nShooting somebody up or getting off the packs\nOr going to the club looking for something to dap\nOr running up in the crib like, \"Where the safe at?\"\nEast New York will shoot you -- they dap your homey\nBrownsville will rob ya -- they clap your homey\nBed-Stuy will get you killed for a hundred grams\nGet a Coney Island nigga to pull the trigga, man\nAsk Flex -- he used to run the Tunnel\nBrooklyn had dudes scared to rep they borough\nUncle Murda, I'mma rep to the fullest\nLike Shyne, in the club I throw bullets\n\n[Outro: Fabolous]\nHa son!!! It's a like it or not thing, nah mean?\nThis one is for Brooklyn, I'm in my Bed-Stuy fly, you know\nBushwick sick, I walk that East New York walk, Brownsville grill\nGot my Fort Greene lean, ha ha, Clinton Hill chill, Red Hook look\nThat Flatbush push, nah mean Cypress Hill feel\nCrown Heights tight with it, the Williamsburg swerve\nConey Island styling on 'em, Canarsie flossing\nPark Slope dope you know, ya dig?", "title": "Brooklyn"}]}