{"songs": [{"image": "https://images.genius.com/95140c7c576a68cc10d708ff71ef761a.500x500x1.jpg", "year": "1991-12-03", "lyrics": "[Intro]\nYeah, baby, what’s up with me and you?\nI wanna be yo ho\n\n[Verse 1]\nLick ‘em low is my motto\nSit on my face, and baby I’ma swallow\nI’m just a freak for you, and you and you\nI’ll lick your toes until they turn blue\nI got a new exercise for ya\nGuaranteed not to bore ya\nCan I kiss ya lips? The ones in between ya hips\nI’ll make you cum ‘til ya cum\nAnd rub your back like I oughta\nThis is what I do to your daughters\nSo fathers, don’t get too mad\nYou did a pretty good job, dad\n‘Cause your little girl got a big ass, a cute face\nAnd direction to my place\nSo you can’t say shit, I like the bitch\nSo I let her know…\n\n[Chorus]\nI wanna be yo ho, I wanna be yo\n(I wanna be yo) I wanna be your hoe, I wanna be your ho\n(Come on now) I wanna be yo ho, I wanna be yo\nI wanna be yo hoe, I wanna be yo ho\n\n[Verse 2]\nBe your hoe, indeed I can’t wait\nTo feed you big dick ‘til your back break\nBecause you asked for it\nWhat’s up? Give a dog a bone or a nut\nYeah hoe, I eat kibbles and bits and shit\nSo introduce your lips to my dick\nAnd don’t be trippin’ when I stick ya\n‘Cause you’ll be drunk full of dick liquor\nAnd no not Erkin’ and Jerkin’\nI’ll have you smellin’ on dick while you’re workin’\nAMG, baby, stands for “All Man”, and G stands for “Give it to me”\nAnd baby you know that I’m a giver\nHow my dick feel way up by your liver?\nDon’t answer that\n‘Cause I know that you know that you know that I know that\n\n[Chorus]\nI wanna be yo ho, I wanna be yo\n(I wanna be your hoe) I wanna be your hoe, I wanna be your ho\n(Baby baby) I wanna be yo ho, I wanna be yo\n(I wanna be your hoe) I wanna be yo hoe, I wanna be yo ho\n(Check it out, let me break it down)\n\n[Verse 3]\nSince you the bitch and I’m the nigga\nI’ll play the hoe ‘til you get sore, and yo\n(Put in your booty and your mouth)\nAnd baby, your big fat booty just drives me crazy\nSo have a dick and a smile, Compton style, freak\nI’ll see you in the swap meet\nAnd when you see your name on my tape, don’t say it was rape\n‘Cause you know the shit was great\nAnd when I bent ya over, your name was Rover\nWhen you was on top, you said “Don’t stop!”\nAnd when you sucked it long and strong, how could I go wrong?\nAMG just had to make a love song\nAbout a girl like, you honey color coated\nAnd your pussy ain’t corroded\nSo that’s a plus, and big butts I nut\nWord to the stunt, I wanna be yo…\n\n[Chorus]\nI wanna be yo ho, I wanna be yo\n(I wanna be your) I wanna be your hoe, I wanna be your ho\nI wanna be yo ho, I wanna be yo\n(1991 and ’92)\nI wanna be yo hoe, I wanna be yo ho\n(I’m yours)\nI wanna be yo ho, I wanna be yo\n(I’ll do anything you want)\nI wanna be your hoe, I wanna be your ho\n(Give you what you need)\nI wanna be yo ho, I wanna be yo\n(Kiss you where you wanna be kissed)\nI wanna be yo hoe, I wanna be yo ho\n(Lick you where you wanna be licked)\nI wanna be yo ho", "title": "I Wanna Be Yo Ho", "album": "Bitch Betta Have My Money"}], "artist": "AMG"}