{"artist": "Astronautalis", "songs": [{"title": "Dimitri Mendeleev", "image": "https://images.genius.com/4dd688aadb10cbb24fc4cbdb8604ecdd.1000x1000x1.jpg", "album": "This Is Our Science", "lyrics": "[Hook]\nI dreamed up the maps\nGive me charcoal and the paper now\nWe invent paths they cannot see\nAnd they're too scared t' walk\nBetween my hands rests fifty-two plain old playing cards\nAnd I trapped God somewhere between\nThe trump and the kind of hearts\n\n[Bridge]\nJoni Mitchell said \"We are stardust\nWe are golden, we are all the same\"\nBlood paints the story of our love\nAcross the bathroom floor towards the drain\n\nFunny how everything just piles up, till one day\nYou can't believe how far you came\nI'm made of mountains, made of metal\nMade of whiskey, and waves!\nYou won't believe your own breath\nWhen the bold words finally escape your mouth\nKeep your secrets hidden\nTill yer certain of just what we've found\nYeah, they bleed just like us\nBut our calling is what shapes us now\n\nWon't be held back, won't be tied up\nWon't be pinned down (x4)\n\nWon't be held back\nWon't be - not now!\n\n[Hook]\n\n[Verse 2]\nIt came to me, as strange as it seems\nFrom a simple deck of cards laid ace to kings\nWith my fingernail slipped under King Charlemagne\nI flipped the edge and traced the grain\nAnd watched it fall like a breaking wave\nThe ace of spades was last to splash\nTrump to suicide kings, they all turned Bicycle backs\nI stared at the pattern, a pair of seraphim flashed\nAnd it just fit, elegant, \"aww shit!\". That's that\nIts strange how you can waste away pained with one thing\nThe watchmaker breaks sweat, he can't tame a dumb spring\nThen one day its as plain as the nose above your smug grin\nLike, \"look what the cat dragged in!\"\nWoke from a dream, hands heavy in cold sweat\nJumped from the bed, snatched the charcoal quick\nSketching frantically upon the bedroom brick\nIt came together and it fit like this:\n\"Give me a lever and a place to stand, I'll move the world\"\nYou think you're clever, but you never, seen how it really works\n\n[Hook]", "year": "2011-09-13"}]}