{"songs": [{"title": "The Last Martians", "image": "https://images.genius.com/aaf56ae60fae4d44b352ce468d059376.595x558x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nShe said, “I wouldn’t kiss you even if you was the last man on Earth”\nWell, how about the last Martian?\nI feel so alone on this planet\nDamn it, maybe it was Mars I was from\nAnd I just missed the last starship\nHonestly, it’s hard just breathing this air\nThey trying to say I got asthma they trying to getting my ass out and leave them from here\nIt’s Bran-DUN, not Bran-DON\nSo I’m not the one that you should be putting brands on\nIs that too much to ask? If I told you all of my goals\nYou’d be growing old, so I’d done too much to brag\nI feel like none of you people try half as hard as me\nI seen your work, look at you Jerkers half-heartingly\nYawn, so how can you expect success?\nThis game is Chess, and you must expect what’s next\nSo just respect doing life blaze blunted\nNo matter what you do, you’re just not gonna cut it\nBlaze blunted, you’re not gonna cut it\nNo pun intended\n\n[Verse 2: brandUn DeShay]\nI don’t have young niggas to blast for me\nYou have to see me in person to realize me saying that’d be blasphemy\nI’m guilty of getting the girls with the ashy knees\nYou know what I mean, they take ones like soda machines\n‘The older, the meaner the world gets’, my mother would say\nAnd more every day, I’m saying stuff my mother would say\nI ain’t gonna be a teenager for long\nI enjoy hot games and rocking chains like Razor Ramon\nEvery time you see me, I’m getting bigger, Raven-Symoné\nI had a son, his name is Bart, I had to raise him alone\nBeen dropping all these hot bars, I’m amazed at this song\nThey pick ‘em up (what?), pick me up, taking me home\nAnd that don’t mean that I’m gone, in case I do disappear\nI’m going to always have a fan, so long as you in here\nMe quitting, you tripping, bring back a souvenir\nYa dig?", "year": "2009-04-29", "album": "The Super D3Shay EP"}], "artist": "Ace Hashimoto"}