{"artist": "Papoose", "songs": [{"album": null, "title": "CC", "image": "https://images.genius.com/2f54ecf2f0d26b82342616b0343d1769.750x750x1.jpg", "lyrics": "[Verse 1: Papoose]\nThey run for the clout like *PYUNG!*\nEverybody real 'til a real nigga walk in the room\nActin' like you G'd up and rich, CC\nSoon as somethin' happen, you go snitch, CC\nTalkin' but you never drop a addy, CC\nWhy you actin' tough?  You ain't staticy, CC\nGot your ass out, you a model, huh?  CC\nYou just tryin' to get some more followers, CC\nFrontin' like you in New York bangin', CC\nThe truth is, you be false claimin', CC\nYou a Blood, used to be a Crip, CC\nHeard you got kicked out the whip, CC\nGoofy-ass niggas talkin' spicy, CC\nBut it's all-cap, you ain't like me, CC\nTalkin' real crazy on IG, CC\nFrontin' like you don't know where to find me, CC\nNiggas talkin' 'bout they got paperwork, CC\nThey tell lies, when the fuck they hate the word CC?\nGave it up on the first date, CC\nNeed some money, now you screamin' \"rape,\" CC\nGot 'em thinkin' you the big homie, CC\nRunnin' 'round with that fake Rollie, CC!\n\n[Chorus: Papoose (Remy Ma)]\nClout chaser, clout chaser (You a CC!)\nClout chaser, clout chaser (You a CC!)\n\n[Verse 2: Remy Ma]\nThey run for the clout like *PYUNG!*\nEverybody real 'til a real bitch walk in the room\nMoney-phone pics need to stop, CC\nSingles with the 100 on the top, CC\nBought your own ring, that's how your finger icy, CC\nThe truth is, you ain't nobody wifey, CC\nSaid your pussy costs and he can't afford it, CC\nLyin', you on your third abortion, CC\nSwear niggas be in your DMs, CC\nBut you just another big BM, CC\nIn the club, your mother got your kids, CC\nLook fly and got a dirty-ass crib, CC\nSaw you post a pic of your meal, CC\nBut y'all was arguin' about the bill, CC\nBraggin' that you fucked mad chicks, CC\nThe rumor is, you got a lil' dick, CC\nTakin' pics from the parked car, CC\nWe all know that whip ain't yours, CC\nAlways talkin' 'bout your piece hit, CC\nBut you sellin' take designer shit, CC\nPut up \"RIP\" when he die, CC\nBut you ain't love him when he was alive, CC!\n\n[Chorus: Remy Ma (Papoose)]\nClout chaser, clout chaser (You a CC!)\nClout chaser, clout chaser (You a CC!)\nClout chaser, clout chaser (You a CC!)\nClout chaser, clout chaser (You a CC!)", "year": "2019-05-13"}]}