{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/262291710caa7539d9af407eeb4c181e.400x400x1.jpg", "year": "2011-08-08", "album": "Radioactive", "lyrics": "[Verse 1: Yelawolf]\nYou ain't gotta lay down on your back\nTo know you already fucked up\nLetting me in the muthafuckin' game is like\nLetting me drunk drive in ya truck\nWhen Yelawolf arrived in this club, already had 5 in my cup\nThen I took another hit and I run into a bitch\nThat's looking lifeless and stuck\nBaby, what's wrong with you now?\nWhat, you ain't happy with Red Bottoms?\nMad cause I'm in VIP with a fuckin' Jack bottle?\nWith Tom, Dick and Harry\nI got up in this bitch with a tank top cause I spit so very, darn quick and scary\nThat's why they're so quick to compare me\nBut fuck my critics with a spiked dick\nWhen it can fit barely. They probably think I'm a Limp Bizkit\nThat spits jelly, when I put them in the woods I'm a redneck\nI'm a hick? Tell me: go ahead, yeah!\nWhat the fuck does it matter to me?\nCause after me there'll only be wannabes\nAnd mostly ain't never gonnabes\nYeah in this forest I'm a lonely tree\nMy limbs are covered in tattoos -and my roots they run deep\n\n[Chorus 1]\nI'm 2 bottle shawty, 2 bitches waiting\nTwo 10's: that's a \"win-win situation\"..\nHappy birthday, I'm feelin' brand-new\nDrinks on me! For ME: not you\n\n[Chorus 2]\nUp in the club, don't give a fuck\nUp in the club, don't give a fuck\nUp in the club, don't give a fuck\nUp in the club, still don't give a fuck\n\n[Verse 2: Yelawolf]\nI don't know what to say after that first verse\nI mean like damn, I just killed it\nWhat the fuck am I supposed to do with this cow?\nI done already milked it\nSmoke another cigarette unfiltered\nLet go of anything that I’m feelin’\nThey done broke me down so many times before\nThat I'm no longer rapping I'm building\nWith one brick, two brick, three brick, four\nUnderneath the steps of my single wide door\nRaised by them dope boys, so I know how them thangs look\nThanks for the recipe: rest in peace, Wayne Bush\nI don't cook my shit, I don't break it down for you muthafuckas\nOut there waiting around for some rap savior\nYou better look up at what it is that you facing now\nCause Jesus drives a Harley, the Devil wears Prada\nIf God was one of us, he'd probably drink vodka\nI still kick it at the party when I get rich\nCause rich or broke, I'm still as dope\nThe realest ain't as real as this\nDead or alive, I'll put a stamp in this bitch\nYou'll never seen rock and roll do hip-hop like I did\n\n[Chorus 1]\nI'm 2 bottle shawty, 2 bitches waiting\nTwo 10's: that's a \"win-win situation\"..\nHappy birthday, I'm feelin' brand-new\nDrinks on me! For ME: not you\n\n[Chorus 2]\nUp in the club, don't give a fuck\nUp in the club, don't give a fuck\nUp in the club, don't give a fuck\nUp in the club, still don't give a fuck\n\n[Outro]\nYeah ya\nY'all know we dont give a fuck!\nIt’s Gheto-Vision\nYeah!\nShady\nYeah!\nStill dont give a fuck\nNaaaahhh!… your boy, lil John… we rep the South!\nHappy birthday, Alabama\nHey! hey!\nUp in the club\nTogether: dont give a fuck\nAaah…\nUp in the club, still dont give a fuck\nI ain't in the building, I own the building, Bitch!", "title": "Hard White (Up In The Club)"}]}