{"songs": [{"album": "Prenuptial Agreement", "year": null, "title": "Everyday My Birthday", "image": "https://images.genius.com/120e77f1186060bdc73f0c721ba49267.1000x1000x1.jpg", "lyrics": "Lookin' back and all them years I spent in the kitchen and I slide threw with my mu'f*ckin' rims listen everything I do got something to do with curve pitching if it ain't about dough and it ain't about mentionin' and if you ain't talkin' stack and n*gga I ain't tryna listen, I can take a b*tch from a n*gga and she feelin' him. Live wire, shirts, live wire killin' em, live wire in em, n*gga Im dressed in em. So git so my money so nice, my money love me, I ain't gotta ask twice, my money look real right to a bad b*tch, take her back to the hood show ah b*tch a whole kick jump back in the car then I make her suck a whole dick she know I sit up at the table with them papa chips buffin' on the cat piss. you can ask my last bitch. Young Stalin go hard for them Benjamen's\nI'm gettin' money like errday my birthday, AYE! Like errday my birthday. I'm gettin' cake like errday my birthday, AYE! Like errday my birthday. I'm spending money like errday my birthday, AYE! Like errday my birthday. I'm gettin' cake like errday my birthday. Live wire n*gga's they make em made in the worst way\nI do the coogie and the louie and the new j's brand new in the box I keep a new k Lil' mama say I make em feel like the whole j's Im countin' money\nMoney on top of fifty's and when it come to b*tches you know a n*gga real picky, you know Im still in the game like Barry Bonds fuck wid me I get it 6 to 5? sh*t I try, keep a n*gga stuntin' on em, if they ain't comin' on the fo's I dont even won't it, cuz Im the n*gga that'll stick d*ck to yo women an I don't care you can gon' an f*ck my b*tch as long as you don't get in the way of a n*gga's chips, that's why I tighten up my game like vice grips. You n*gga''s like banana peels but I never slip, west solo n*gga keep a big bird on a sip N*ggas hate cuz they money lil like micro chip but real n*ggas bounce back like Michael Vick. Im from the hood so you know I stick to the script. I came from nothing, I remember I was born a misfit but now a lil n*gga way too legit to quit\nI'm gettin'' money like errday my birthday, AYE! Like errday my birthday. I'm gettin' cake like errday my birthday, AYE! Like errday my birthday. I'm spending money like errday my birthday, AYE! Like errday my birthday. I'm gettin' cake like errday my birthday. Live wire n*ggas they make em made in the worst way\nI still get it, I whip it, like a bird flippin'. Count stacks like a n*gga sold da whole chicken. Its Young Stalin reporting live from the kitchen, fly n*gga in the coogie and the true religion, I'm from the ghetto but a n*gga worth 6 figgas, I'll put yo ass on the permanent visit, on the way to meet cha maker cuz n*ggas don't listen, I got my money up so we can let the games be--gin\nIm gettin money like errday my birthday, AYE! Like errday my birthday. Im gettin cake like errday my birthday, AYE! Like errday my birthday. Im spending money like errday my birthday, AYE! Like errday my birthday. Im gettin cake like errday my birthday. Live wire n*ggas they make em made in the worst way"}], "artist": "J. Stalin"}