{"artist": "3rd Bass", "songs": [{"lyrics": "\"At the sound of the tone, the time will be twelve A.M.\"\n\n\t* about a dozen alarm clocks and grandfather clocks go off *\n\n[MC Serch]\nReady in the intro, cue up the Serch-lite\nPoint us to the center stage (I'll grab the first mic)\nProjectin the voice with this mic that I'm cuffin\nYou ain't my nucka, SUCKER I'm snuffin\nThe word of the 3rd stands true, so no panickin\n(Man verse man) you freeze up like a mannequin\nPetrol, you let go, the wax for the new jacks\nTo dwell upon you're steppin on the trigger as the tune smacks\n(Square in the butt) Pete gave me the cue\nSo I'ma put up or shut up until my jam is through\nBut for now I wanna freak em, so I'll embark\nTo spark your mission posse, til way past dark\n(Don't park there's no standin) or I'll play the five-oh\nYou don't stop movin until the Serch says so\nTo keep the tribe open, shootin out to play em\nThree the hard way'll keep you steppin to the A.M\n\n{*Richie Rich cuts \"steppin to the A.M.\"*}\n\n[Pete Nice]\nMy mind has a question, I respond\nTo a silver domed microphone (one step beyond)\nStraight to eighty-eight to the curves of the 90's\nI'm universal, I set a line free\nBehind me, the three the hard way, the jackpot\n(Awaitin Satan's, tryin to take cheap shots)\nWe groove crowds, the three stand proud\nThe brothers round the way sit down and say\n(How'd you do this?)  Ludicrous rhythm of rhyme\nAnticipate like a bottle of Heinz.. KETCHUP\n(No catch up!)  Cause you fell behind\nI'm steppin to the A.M. -- dickin down swine\nPete Nice skims over lyrics, I pick em\nStrong and long, you're wrong, I stick em\n(He's the law with the sword) with my cable swingin\n(Like _The Pit or the Pendulum_)  Pete Nice bringin\nThe sunrise with no lies, legitimate (and you despise)\nEnvy this MC's magnitude (so realize)\nThe MC emceed (The DJ deejayed em)\nUntil the next time I keep you steppin to the A.M\n\n{*Richie Rich cuts \"steppin to the A.M.\"*}\n\n[MC Serch]\nNo weight on the felt plate, deep bass below rise\nNeedle torture groove, move the record til the wack stride\n(Schoolin the swine on the strength of my vocab)\nBet you wonder you're a goner\n(You're thinkin that you had)\nLyrics to the A.M. but the house needs a swinger\nYou st-st-st-st-stutter, but I'm a stinger\n(My rhymes so potent, I wrote em and it's evident)\nYou're just a stunt, seekin a settlement\nThe lyrical line (The artical original)\nAfflict like a convict, I ain't no criminal\nScheamin on a cable or slobbin the knob\nYou played me like a foul ball\n(How you livin Hobbes?!?!!)\nNow groove into the A.M., the master spoon feedin\nOut a jumper, you're bumpin a freak while I'm G'n\nPeter let the record spin (Serch'll get a second wind)\nMOTIVATE THE CROWD, til it's steppin to the A.M\n\n\"What's the time??\" -] Beastie Boys\n\t\"It's about that time\" -] Schoolly D\n\"What's the time??\" -] Beastie Boys\n\t\"Time to get stupid!\" -] Chuck D  (\"At the sound of the tone\")\n\"What's the time??\" -] Beastie Boys       (\"The time will be three A.M.\")\n\t\"It's about that time\" -] Schoolly D\n\"WHAT TIME IS IT????????\"\n\t\"for.. for the A.M.\"\n\n[Pete Nice]\nI slide swiftly, keep a brother steppin\n(loungin, strength in my throat)\nSweatin as you get hit with the rhythm\nMy lines sustain like a crane, so I lift em\n(slow and smooth)  Flowin like fluid\nThe mass did worship the lyrics the three did\n(amid all crisis)  Droppin like a guillotine\n(You're moist) fearin the voice of the rhyme fiend\nWho scene is set, Pete Nice is your worst dream\nFulfilled your illed I thrilled (I heard a LOUD scream)\nMy mind is cued, so I run down a menu\nThat downgrades the weak as my lyrics tend to\n(the needs of a shaker, sweatin to the point of exhaust)\nSo listen to the mission horse\nBlinded by the science, my mind starts flexin\nSexin down females to the A.M., perplexin\nA complex reflex (you wonder if we slumber)\nThe three don't sleep (Aiyyo Pete Nice take em under!)\nSteppin to the A.M., I'm steppin to the mic\nTo snatch up and smash up the club until daylight!\n\n{*Richie Rich cuts \"steppin to the A.M.\"*}\n\n\t\".. for the A.M.\"", "image": "https://images.genius.com/66b094b3f4ff3a3de57feb7e3b9816d8.300x300x1.jpg", "album": "The Cactus Revisited", "title": "Steppin’ to the A.M. (Remix)", "year": null}]}