{"songs": [{"album": null, "image": "https://images.genius.com/5563bbf194e7e590fedb74ee45cc4953.596x597x1.png", "year": "2017-09-01", "title": "Beef", "lyrics": "[Intro: Tee Grizzley]\nHelluva made this beat, baby\nHaa\nMeek, you got your strap?\nAin't nothin' to talk 'bout\nLet's get it\n\n[Chorus: Tee Grizzley & Meek Mill]\nI don't sleep on no beef\nWe ain't sleeping on these niggas\nYou know I'm on top of everything, nigga (Lurking)\nI come on your street\nWe're just creeping on these niggas (Yeah)\nFuck talking, let that metal bang, nigga\nMurk 'em\nI don't squash no beef\nWe ain't throwing no flags\nI was taught to handle everything, nigga (Handle that)\nI don't play with  no beef\nWe ain't play with no pussy\nRun in his crib and kill everything living, you hear me? (Brr)\n\n[Verse 1: Tee Grizzley]\nIf I wanted a nigga gone, he a dead man (He through)\nSay my name on his song, he a dead man (That's your ass)\nTryna hide behind your niggas, that's your man's ass (nigga)\nI leave his whole body bloody, call him Red Man\nHit the club in them Audi trucks and threw bands\nDon't get it twisted, bitch, we still got them Scooby Doo vans (Still slidin')\nFuck with me, I'ma come to where you stayin'\nAnd walk in your house with big shit like I'm finna move in\n(Tell that bitch, we in this bitch)\nLet me say that I don't wanna see you bustlin' (Kill the niggas)\nNiggas in your backyard and on your front grass (We here)\nAnd then don't shot cribs, they gon' give you one chance\nLike nigga, come outside or we gon' come in, boy\n\n[Chorus: Tee Grizzley & Meek Mill]\nI don't sleep on no beef\nWe ain't sleeping on these niggas\nYou know I'm on top of everything, nigga (Lurking)\nI come on your street\nWe're just creeping on these niggas (Yeah)\nFuck talking, let that metal bang, nigga\nMurk 'em\nI don't squash no beef\nWe ain't throwing no flags\nI was taught to handle everything, nigga (Handle that)\nI don't play with  no beef\nWe ain't play with no pussy\nRun in his crib and kill everything living, you hear me? (Brr)\n\n[Verse 2: Meek Mill]\nYeah, nigga diss me in these raps, how we gon' go about it (We gon' go about it)\nWhen we wack 'em, shit Obama prolly gon' know about it (Brr)\nLoad the chopper, crack the window when we rollin' by (There it go)\nFuck a drive-by, run 'em down so we know we got 'em (Hit 'em)\nKnow we chopping, test 'em and we leave you Holy Bible (Woo)\nAll this money got me thinking what I owe my rivals (Pussies)\nA nigga said we tried to squash it then you know he lyin' (Fall)\nI told my youngin' grab that rifle, set that boy on fire (Brr)\nCouple niggas used to be with us, we ain't make it to they funeral, they said that we did it\nIf we make it through the summer, we gon' leave niggas (Like what?)\nLike it's auto with that auto, we gone squeeze niggas (Facts)\n\n[Chorus: Tee Grizzley & Meek Mill]\nI don't sleep on no beef\nWe ain't sleeping on these niggas\nYou know I'm on top of everything, nigga (Lurking)\nI come on your street\nWe're just creeping on these niggas (Yeah)\nFuck talking, let that metal bang, nigga\nMurk 'em\nI don't squash no beef\nWe ain't throwing no flags\nI was taught to handle everything, nigga (Handle that)\nI don't play with  no beef\nWe ain't play with no pussy\nRun in his crib and kill everything living, you hear me? (It's on)\n\n[Verse 3: Tee Grizzley]\nI see the fear in your face, nigga (Lying)\nAnd ain't no turning back, I got my mind made, nigga (For real)\nI chase nigga, eliminate niggas (Ayy)\nTell 'em Leek, that lemon squeeze ain't  for lemonade, nigga (No)\nI ain't no hatin' ass nigga, but I hate niggas (Hate 'em)\nWhat they gone do, that doctor ain't got shit to save niggas (It go)\nI'm through the city in that Range with my thang, nigga (On my momma)\nSay my name and get banged, that's on gang, nigga (Gang, gang, gang)\n\n[Verse 4: Meek Mill]\nStill putting Draco's on the plane, nigga (Draco)\nStopped the PJ in your city, we ain't playin' nigga (Skurt)\nHeard he sneak dissing, seen him, what you sayin', nigga (What you sayin'?)\nLoss of memory, he must have had them Xans in him (On them Xans)\nStill ride SRTs with the yams in 'em (SKurt)\nRental in my cousin's name with the grams in him\nCatch his homie out in traffic, that's your man, nigga? (That's your man?)\nHe say he don't fuck with you and he a fan of us, pussy\n\n[Verse 5: Tee Grizzley]\nThese niggas tweet a lot, these niggas text alot\nWhat they gone do when I pull up and make em' catch a lot?\nBlue beam on that choppa Kamehameha\nI throw them dragon balls at you like I'm Kakarot (boom, boom, boom)\n\n[Verse 6: Meek Mill]\nCircle through your hood, where your crew at? (Where your crew, nigga?)\nSend your whole squad a message like a group text (Uh, brr)\nHit your dawg 20 times, nigga, you next (You next)\nSqueeze that Glock until my trigger finger blue-black (Bow)\n\n[Chorus: Tee Grizzley & Meek Mill]\nI don't sleep on no beef\nWe ain't sleeping on these niggas\nYou know I'm on top of everything, nigga (Lurking)\nI come on your street\nWe're just creeping on these niggas (Yeah)\nFuck talking, let that metal bang, nigga\nMurk 'em\nI don't squash no beef\nWe ain't throwing no flags\nI was taught to handle everything, nigga (Handle that)\nI don't play with no beef\nWe ain't play with no pussy\nRun in his crib and kill everything living (Brr)"}], "artist": "Tee Grizzley"}