{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Burn Wit Raided", "album": null, "lyrics": "[Verse 1]\n\nWhat is fear?\nHesitation, excuses, procrastination\nJustifyin' lack of action\nThis shit is exasperatin'\nWhy lie?\nI probably cry buckets of tears\nStagnated, stuck in a cell doin' nothin' for years\nWhen niggas that have hatred flowin' through they're veins like plasma\nSo much tension in the air it's hard to breathe like asthma\nKnowin' in they're brain\nThat they contribute nothin' but pain\nBut continue to do it because we've been through nothin' but flames\nSo let it burn\n'Til we in Hell\nWith all the niggas that never learned\nNothin' about love so fuck everything that it tells\nAnd I meant well but I never had a father that'd spoil me\nNever educated about faith, patience, and loyalty\nDedicated my love to the streets, seekin' royalty\nTrying to be king of the hill\nBonny means for real\nAnd then tryna scheme for scrilla\nKill whoever try to foil me\nLife is a dirty game\nI'll be a writer 'til you story me\n\n[Hook]\n\n(Motherfuckas never loved me so I EARN your hatred\nI've been in Hell, join the militia and BURN wit Raided\nLocked in a cell 'til the day the ashes fill the earth\nFinal words before the last gasp \"I will return\") x2\n\n[Verse 2]\n\nWhat is hope?\nUndenial and optimism for survival\nBlock missions got niggas locked in prison dead on arrival\nTryna balance scales before the day that we meet the Lord\nMore positive than negative as we wanna even the score\nTryna balance Hell and Heaven but I keep steppin' in traps\nPlus my melon is black\nI keep in held in them sacks\nI'mma\n(???) action results in years\nTrained to slaughter\nBellin impacts drownin' my brain with water\nLiquor sick\nFears of bangin' get washed out with this Sisco\nMore beef, fuck peace, cuzz go get your pistol\nScreamin' \"Fuck life\" the penitentiary can't scare a G\nBut when they catch you with your hair (???) fallin' out like chemotherapy\nStressed out, you was the Locest nigga walk with your chest out\nBut now you just a broke nigga cause your whole family done check out\nHopeless nigga, stretched out\nIn the pen ready to smoke dope and you step out\nAbout to go the death route\n\n[Hook]\n\n[Verse 3]\n\nWhat is love but a manipulator's lies?\nThat's why I'm bangin' and ain't changin'\nThis'll be the way that I die\nStrapped to a table sedated with a needle stuck in the vein\nWith a lethal injection travelin through the arteries to the brain\nAnd I'm evil infected\nPeople neglected to give a fuck here\nPapa bust a nut cut\nLeft a nigga stuck here\nSo fuck tears, I'm all cried out\nLike Lisa Lisa\nWhen I'm hurtin, I'mma silent nigga unless the heaters speak up\nA vile nigga that'll creep up\nAnd get the iron of a nigga's streets up\nLeave him stiff like I sprayed him with starch\nBrave in the heart\nLike Nas and Mel Gibson\nYou can find me in Hell trippin'\nHoldin Satan for ransom\nCall God waitin' for answers\nTell him \"Let us outta here or we'll rise til Hell's risen\"\nYou can find Lucifer crucified with his tail missin'\nFuck a jail sentence, too claustrophobic for cell livin'\nI'm on a male mission, dodgin' opponents whose shells spittin'\n\n[Hook]\n\n[Outro]\n\n(What is love? Huh?\nWhat is fear? Huh?\nWhat is hope? Huh?\nWhat is hate? Huh?) x4\nYeah, go!"}], "artist": "X-Raided"}