{"songs": [{"title": "Can’t Touch Him", "lyrics": "AKIR - “Can't Touch Him”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n[Scratches: [?]]\n\n[Intro: AKIR]\nI know some of y’all niggas like, “Who’s this nigga right here,” you nah’mean?  But we’ve been doing this for years, son.  And I’ma explain something.  Yo, yo\n\n[Verse 1: AKIR]\nIller than ever, AKIR, the trendsetter appear like a\nBeretta bucking straight in your ear, the shots clear\nGot as my witness, my word is my bond.  Let’s get\nIt on, write my life down, reflect it through song.  Running\nThis shit like a marathon.  Just getting warm, hotter\nThan summer sex, wet like the sweat from my balls\nSee, before I buy Smirnoff or Christian Dior\nI’ll be busting nuts while your knees scraping the floor\nPick you up and drive you off and have ‘em cleaning your drawers\nHad a wife.  She did me trife.  I ain’t trusting these whores\n“No More Drama” in my life like Mary J. Blige\nI’m a king.  My entourage got to have new cards.  My fam\nDo music large like it was out the barge\nLivewire inspired by the niggas in charge\nFly, I’m nasty with the shit I be on.  You just\nA peon.  My name’s in neons, embraced for eons\n\n[Hook: AKIR] (x4)\nY’all can’t touch him\n\n[Verse 2: AKIR]\nYo, don’t touch\nThe dial—I’ma keep it in tune.  Niggas is gassed like\nBalloons, showing their ass like baboons\nI don’t wet it like Gremlins and chickens\nPretending they don’t suck cock.  Now what the blood clot?\nHeart stop.  I’m in the vein with my art\nResume pumping, I’m thumping.  Stainless, I’m sharp\nAnd, in the dark, I’m sight.  I’m like a hawk in the\nNight, spitting sparks for light to guide you through the flight\nLike Mike Tyson fights, I don’t bark.  I bite\nI don’t talk that hype.  I just do it like\nMikey.  Might be one of the most vivid since\nSpike Lee.  Hype bleed, the crowd gets in it\nTurn it out like the lights when we finish\nFinally, we did it.  Now ask, “Who’s the illest?”\n\n[Hook: AKIR] (x4)\nY’all can’t touch him\n\n[Verse 3: AKIR]\nNever I claim to be the best, got respect for the vets\nThough I stay on your set like video cassettes, and the\nMediocracy leaves me bored.  Spit\nFreestyle cinema, produce the Scar\nTake different avenues and open new doors, but this\nTime, I’ma rhyme using all metaphors\nGirl jock like Shaft, blow brains like gats\nRelease mainstream cream like this rap and\nShe can’t save face like Mike Jack\nSon is a fag.  That’s all he know about crack\nYou over here on some tracks.  I’ll oversee like\nA MAC.  Hungry like turkey, spread like herpes, attack\nBack to basics, y’all niggas still faking that wack shit.  Head for\nThe hills ‘cause we only letting out classics, nigga\nY’all can’t touch him", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}