{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Ain’t Cha", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Hook: Pharrell]\nHmmm, you trynna get some good fame ain't cha?\nHmmm, you trynna slang in tha rain ain't cha?\nHmmm, you trynna save for tha Range ain't cha?\nHmmm, you trynna perfect your aim ain't cha?\nHmmm, you trynna get a big chain ain't cha?\nHmmm, with the medallions and the rings ain't cha?\nHmmm, gon' getcha air force plane ain't cha?\nSay what? So you can get that hood fame ain't cha?\n\n[Verse 1: Pusha T]\nThrough despair I traipse, baking pies, baking cake\nHustling them E's and that C's and that H\nWhile you probably talking frantic on the tape\nNiggas in the hood ain't trynna to hear \"Man it was a mistake\"\nThey'll call you a bitch, not a bandit at ya wake\nEpitaph reading how much damage you could take\nWhile I'm on the boat with ya bitch, salmon on the plate\nI know why you liked her, the head, it was great\nLoving these bezels sets, change with no space\n86 karats, you know how much digging in the planet this could take?\nPatent leather Bapes... (Uh, uh!) Closet like planet of the Bape!\nMonkey see, monkey do, monkeys following in place\nLike I'm living in an episode of Planet of the Apes\nYou're watching the evolution of one of rap's greats\nYou niggas trynna take my place? Never happen\n\n[Hook: Pharrell]\nHmmm, you trynna get some good fame ain't cha?\nHmmm, you trynna slang in tha rain ain't cha?\nHmmm, you trynna save for tha Range ain't cha?\nHmmm, you trynna perfect your aim ain't cha?\nHmmm, you trynna get a big chain ain't cha?\nHmmm, with the medallions and the rings ain't cha?\nHmmm, gon' getcha air force plane ain't cha?\nSay what? So you can get that hood fame ain't cha?\n\n[Verse 2: Sandman]\nDig it, every time I do it, encore\nSlide out the Lincoln with the suicide doors\nMa, and I'm blingin' like Baby with all that shit on\nMy block pop til all that shit gone\nWhat? You pussies hardly eat\nWhat you spend on a home is a gaudy piece\nOn the chest of a biz-oss, it's a must I fliz-oss\nMy dream team wrestle for cheese like Eric Bischoff\nFrom the kickoff to tip off, I give off rays from the VVs\nIce glazed like lip gloss\nThinking they can see me, I beg to diff-arr\nLook up in the skiz-eye, it the big dip-arr\n(That's cold!) Its chilly in Philly, its that real\nNobody know karate, more bodies than Kill Bill\nSomebody get beside me, Lord, will his blood spill\nLike a waterfall, fuck around make me slaughter y'all\n\n[Hook: Pharrell]\nHmmm, you trynna get some good fame ain't cha?\nHmmm, you trynna slang in tha rain ain't cha?\nHmmm, you trynna save for tha Range ain't cha?\nHmmm, you trynna perfect your aim ain't cha?\nHmmm, you trynna get a big chain ain't cha?\nHmmm, with the medallions and the rings ain't cha?\nHmmm, gon' getcha air force plane ain't cha?\nSay what? So you can get that hood fame ain't cha?\n\n[Verse 3: Malice]\nOh you just gon' take without asking ain't cha?\nYou just grabbin', you ain't earnin' for shit, that's too old-fashion\nLook, tulip, I will never tuck a jewel up\nKindergarten did they not tap your knuckle with the ruler?\nI'm the era of the Juice Crew, don't let that dookie noose you\n1 and 1 is 2, its just as simple as Blue's Clues\nThe nine will get most of you, turn yourself around\nFor he who want to run up and earn himself a crown\nMeanwhile study something nigga, this Gucci, Parker\nFrom France where the kids sing Frere Jacques\nIf not there, I'm somewhere mixing vodkas\nIn a far off land, where they shake maracas and shit\nKeep it moving like in kis of coke\nYou The Hunted motherfucker, and I'm Benicio\nNot Tommy Lee, see we never involve the law\nIf it seems the walls are closing in, it's only ‘cause they are\nMotherfucker\n\n[Hook: Pharrell]\nHmmm, you trynna get some good fame ain't cha?\nHmmm, you trynna slang in tha rain ain't cha?\nHmmm, you trynna save for tha Range ain't cha?\nHmmm, you trynna perfect your aim ain't cha?\nHmmm, you trynna get a big chain ain't cha?\nHmmm, with the medallions and the rings ain't cha?\nHmmm, gon' getcha air force plane ain't cha?\nSay what? So you can get that hood fame ain't cha?\n\n[Verse 4: Ab-Liva]\nI'm a natural born hustler, I, the risk taker\nI get it cross the border, the Alpha the Omega\nMy life, I scripted the paper posh like the wrist in the cradle\nThat hug the diamonds that kiss for you haters\nGrimaldi, is so gaudy\nBut its just so picture-perfect as I lean in that six-forty-\nFive CI, I'm on them blades likes T.I\nThe niggas hate to measure ‘cause they knee high\nStill slingin' that P-I, E what I bring by\nMe 50 cal, pretty desert up my sleeve, I\nStill hugging that corner so tight it can't breathe, I\nCan't let it go, ‘cause a nigga got to eat, I\nCame to conquer the game, the flame and the powder\nAnd the pot, stirred it crazy, I'm a lead-a\nStill in the game, tipping the scale like Libra\nYou don't really want that halo over your Caesar! No!\n\n[Hook: Pharrell]\nHmmm, you trynna get some good fame ain't cha?\nHmmm, you trynna slang in tha rain ain't cha?\nHmmm, you trynna save for tha Range ain't cha?\nHmmm, you trynna perfect your aim ain't cha?\nHmmm, you trynna get a big chain ain't cha?\nHmmm, with the medallions and the rings ain't cha?\nHmmm, gon' getcha air force plane ain't cha?\nSay what? So you can get that hood fame ain't cha?"}], "artist": "Clipse"}