{"songs": [{"title": "10 Years", "image": "https://images.genius.com/5abca0400b268dff8e0e88a43e3e446f.593x593x1.jpg", "lyrics": "Children struggle to find someone to listen, that's why\nAll they have is the music that they listen to\nMeet the world, it's trife (trifle) and frost bitten\nOur generations youth wander around like lost kittens\nDodging stray bullets and advertise bulletins\nFatal attractions, placed to pull you in\nThe media is feeding us with poison\nPeople eat it up like it's valuable when really it destroys them\nSociety is blind with so many distractions\nThere's only one God but we're chasing after fractions\nAnd fiction, full speed with no cause or mission\nThat's why, most live a life of contradiction\nAnd words like love have lost their definition\nThe best way to make a statement is through actions\nI'm through acting, I can't control how it goes\nI take it one step at a time, walking this long road\n\nI, Keep, Wondering\nWhere, Will I Be\nI, Keep, Wondering\nWhere, Will I Be\n\nI would like to let you know that you\nCan't predict what might go down next\nLife goes in many directions and sometimes\nIt takes us by surprise\nI've been caught off guard by many challenges and challengers\nThat arrived un-announced, unexpected\nI was once a young child filled with innocence\nWho I am now after many instances and experience?\nHow many times did my dreams change?\nHow many times did my mind change?\nTen years ago I was in seventh grade with no worries\nBut now I got plenty bills to pay\nYou know how it go when you got no dough\nAnd the bills stack up while the interest rate grows\nIt's like the more that you save up, the more that you owe\nAnd sometimes we do the same thing with our soul\n\nI, Keep, Wondering\nWhere, Will I Be\nI, Keep, Wondering\nWhere, Will I Be\n\nLooking back ten years ago\nI didn't know I was walking this road\nNow that I'm on it, if I'm honest\nI'm not sure that I want it\nSometimes my mind goes back and forth\nTrying to figure out, what I'm working towards\nWho am I working for? gotta do this right\nThe patterns I set now will follow me through life", "year": null, "album": "Shades of Grey"}], "artist": "Braille"}