{"artist": "Immortal Technique", "songs": [{"title": "No Me Importa", "lyrics": "Look I ain't never been afraid to tell how I really feel\nNunca, I think everybody should know that\nYo creo que todos ustedes deben saber eso\nFuckin' ought to know, yo\nSo I gotta tell these chicks a lot of times, mira\nTu estás actuando en una manera muy mala\nBien mala y no me importa ya, yeah, so I gotta let you know\nLet 'em know. Here we go, dígale a la gente, B\nGotta let you know for real. Son drop that\n\n[Verse I]\nSiempre me encuentro con la mujer equivocada\nA superficial mami con la alma comprada\nYo I'm sick of stupid chicks que hablan de nada\nLet's go to my house conversación acabada\nYeah we can fuck but you gotta go after mañana\nYou walking bowlegged porque te deje clavada\nDon't ever talk shit about niggas and get enojada\nThere's a reason that you never been properly amada\nCause you fuck niggas and suck dick como si nada\nPara la porquería and save the drama\nDon't come to the fucking club con una actitud mala\nYou've been drinking too much Bacardi and smoking lala\nEscúchame señorita, if you don't respect yourself\nDon't expect respect from anyone else\nDon't expect an hombre to support you with wealth\nGo to college and be successful, do it for delf\nNunca vas a ser shit without knowledge of self\nMamis with cultural ineptitude are bad for your health\nThat's the type of mujer that I put back on the shelf\nAnd go back to the packed crowd to look for somebody else\n\nAdiós, check it\n\n[Hook]\nWe keep it moving properly\nNo me importa lo que haces, ain't no way of stopping me\nMoving through property, like I own every monopoly\nSmoking broccoli, compartiendo ideologies\nPero solamente pasa on a special occasion\nWith beautiful intelligent mamis that stay blazing\n(Stay blazing!)\n\nY ahora for you motherfucking niggas\nYo... si\n\n[Verse 2]\nImmortal Technique the resurrected Che Guevara\nBut y'all cats are just a bunch of fake Tony Montanas\nI bring drama like Revolución Cubana\nAnd rock stages like my last name was Santana\nComo puedes comparar your entourage to my squad\nYou motherfuckers is faker than Resurrection Boulevard\nDon't try to be hard cuz I don't stress fake good fellas\nI'll burn your house down and empty the clip in tu abuela\nMucha gente try to convince everyone that they trife\nHablando mierda but you never shot a gun in your life\nSiempre gritando how you keep it real in the cife\nBut most of you rappers can't even keep it real with your wife\nI'll sacrifice a puto cabrón for running his mouth\nCarjack and kidnap you in front of your house\nAnd while you tied up riding shotgun while I'm driving down south\nI'll push the pedal to setenta and kick you the fuck out (Fuera)\nSolamente to look back and have something to laugh about\nI doubt you really want Technique as an enemigo\nFuck with me I'll make your people turn up desaparecido\nMy 'stilo is Túpac Amaru Y Zapatista\nI'm a rebel soldier murdering rap artistas\nColombian necktie emcees, hasta la vista (huh)\nTaking over the fucking country like a socialista\n\nCobardes, yo\n\n[Hook]\nWe keep it moving properly\nNo me importa lo que haces, ain't no way of stopping me\nMoving through property, like I own every monopoly\nI'll blow your fucking brains out and spread your philosophy (God damn)\nThis is for all the celoso motherfuckers that's watching me\nI don't make threats bitch lo que hablo is prophecy\n\nDe verdad, para que toda la gente sepa que no me importa\nCuanta mierda ustedes hablan o cuanta mierda\nI'm gonna still be on my job. Forever, I'll still be here (Claro que si)\nI'll still be doing my thing. Para siempre. Cojudo\nPara siempre. I'll be in everybody's parade\nImmortal Technique, se ha acabado la mierda..", "image": "https://images.genius.com/9c9631e16897ed9bc090afd0a05da5ae.1000x974x1.jpg", "album": "Revolutionary Vol. 1", "year": "2001-09-18"}]}