{"songs": [{"album": "DiCaprio", "year": "2015-01-26", "title": "LeTumbapart1", "image": "https://images.genius.com/dccbebb129ae1330d5157ffd021203ef.640x640x1.jpg", "lyrics": "[Intro: KEY! & J.I.D.]\nHello?\nNot from the top, I wait till the beat drop\nLet's feel back it, cause it's that lil' space right there\nGrraa, grrraa, ayy\nCan't do shit like that, just leave it\nI can do one song\nYeah\n\n[Verse 1: J.I.D. & KEY!]\nY'all niggas lookin' like money, ching-ching\nLight shine, starin' at your wrist, bling-bling\nLightweight J.I.D., get drunk off a Yuengling\nLet that thing sing, sing, sing, send him to Sing Sing\nBut I ain't got time for no jail time, no\nPick them shells up, let 'em cool down, blow\nPull up to your big ass crib like Hello?\nNobody here? Y'all ready to go?\nI got division like Mansa Musa\nCan fuck your bitch like a barracuda\nUzi tooly Boolie, who the shooter?\nYeah, it's not mine, cause I forgot the ruger\nNever been a gangster, I'm riding with my seatbelt on\nTryna drive and roll up all of this weed in my palm\n\n[Verse 2: J.I.D.]\nTwenty-five to life, it all started with a coca leaf\nI swear I been the dopest this not how its supposed to be\nNiggas spent the bend and shot at everybody close to me\nAnd they killed my nigga T, dome shot, R.I.P\nNiggas killing niggas I ain't even get the notion\nThey out here catching bodies and a nigga ain't provoke em\nOh shit, guess I need to pick me up a strap now\nNowadays, niggas don't even know how to act (Bow)\nRun to the hills to avoid the high waters\nThey flooded the crops, kill pops, they tryn done us\nThey Marshawn Lynch with the Glock, they ran rumpus\nDunk us, Jordan signs seen clear when they stomp us\nSick of Atlanta, I hit my girl, then flew to Dulles\nBumping Dwele, dwelling on the past they ain't tell us about\nAll we do is accept they bullshit they sell us\n\n[Bridge: Key!]\nOkay!\nNiggas ain't talking how they living\n(Mumbling, repetitive 'For real!' 'Okay!')\n\n[Outro: Leonardo DiCaprio and Interviewer & KEY!]\n*Do feel or do you think that it's a human nature that we always want more?*\nI think it's not just in human nature I think it's a characteristic of all life, I think opportunism and greed has really been the key to you know, survival\n*Can you relate to that, always wanting more?*\nWell, the truth is, it's you know, we all have good and bad in us and that, you know, you have to stop yourself, you have to stop yourself. You know and ultimately create a balance and think about others\nI think everyone can get into that addiction I mean it's an easy trap to get into, you know, on a personal level uh, you know I think that you find people like this and I've met a lot of people like this who's entire world is consumed by wealth. And and you meet them and you talk to them and you realize they dont have a lot of foundation in their life whatsoever\nAnd so therefore this becomes the root of all hapiness for them. And of course I like money like everybody else, that would be an absolute lie, but I think its important to be responsible at the same time. And I also think it's important to give back to if your in a privilaged position. I think that that should be  a pre-requisite to anyone who's gotten to accumulate a lot of welath in their life\nI think that it should be standard\nFor real\nFor real\nFor real\nOkay"}], "artist": "JID"}