{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "Be Right", "album": null, "year": null, "lyrics": "[Verse 1 - Nas]\nIf Macy's don't have it\nA hatred addict\nI need faces mad with frowns when I'm around\nOr I'm wasting fabric\nI don't feel great until my plushest pieces\nCause you to suck your teeth\nSome mean-mugging on my clean thugging mean nothing\nWomen dream I'm your husband\nI'm Alex Pushkin, the black poetry writing Russian\nIce disgusting. I started bling\nHow could you question my direction?\nI'm king, I'm cultured, not just cause of\nThe foreign movie posters, the frames\nStarring French names, look closer\n? to the worm food\nI despise and watch fake wise guys who turn stool\nAnd speak highly of late made guys who once ruled\nHard-bottomed shoes, chauffeurs flaunt ambrosia\nMy baby moms wrote a book that couldn't harm a soldier\nMuhammad Ali hobbies, no pilates, jogging, jumping rope\nTil my body cut up like a bag of dope\nAnd hope I die ?\n\n[Hook - Nas]\nWorked too hard, stayed up too many nights\nIf I'm wrong for being me, I don't wanna be right\nNah! No not never, no not ever\nI don't wanna be right, hood star, we are\n\n[Verse 2 - Nas]\nDiggi-diggi-dignitaries, Carhart congress\nFitted hat high rank officials\nWorld Bank like Rothschilds\nTake the wool from over your eyes\nWho conspired to deceive you and I\nIt's easier for a man to believe a big lie\nThan a small truth. Money's not evil\nIt's the love of money that's the root\nNot a luxury car worshipper, but I purchase\nParticular vehicles, so me and my dudes, we can cruise\nUpsetting policia They study my natural sleepy eye\nTo see if I'm high. I got my piece of the pie\nMy 40 acres is my 40 karats on my piece, that's fly\nCarti bracelet, you talk that talk and walk that walk\nYou wouldn't understand our thoughts\nHow many black leaders are bought\nWhy the fuck you care if I rap about\nHow much my sneakers cost? I'mma floss\n\n[Hook - Nas]\nWorked too hard, stayed up too many nights\nIf I'm wrong for being me, I don't wanna be right\nNah! No not never, no not ever\nI don't wanna be right, hood star, we are"}], "artist": "Nas"}