{"songs": [{"title": "Causing Havoc Freestyle", "album": null, "year": "2017-02-28", "image": "https://images.genius.com/4750f04c69551898fa82ae6080020963.686x687x1.jpg", "lyrics": "Oh MY God who's this? An L beat?\n\n[Intro]\nYeah, yeah margielas on the gas\nThey say we gotta another smash\n\n[Verse 1]\nG-g-g-g-g-got that fifty clip its filled up to the top, I'll let it rock\nIn Milwaukee they say it's a drought, so I set up shop\nFuck her then I kick her out the loft\nI can't trust a thot, 'cus all these bitches fucking with them niggas from another block\nFeds tryna wake the spot, damn them youngins got it hard\nSo they all talk to MP. but you know I love them Glocks\nYoung niggas totin like  lil shawty off of belly, n my old heads moving fish scale, got it smelly\n\nOh MY God who's this? An L beat?\n\n[Verse 2]\nLook, thirty clip under the [??]\nOne in the air so we ready yeah\nNigga just got out the Benz, well over 33 shots in his belly look\nSwear that lil nigga  didn't know I'm 22 but I'm heavy yeah\nMy foreigns, they got a stash-box\nMy choppers, they come with machetes\nMy shooters, they ready to score, ready for war and we got choppers galore\nMy brother just had a lil boy, he like to play with that money, that nigga too small\nI got bitch, she thirty years old, I keep me a vet, yeah\nAnd she know a nigga got 53 hoes , I keep 'em in check, yeah\nMy homie just come from the pen [??]\nAnd you know I told him I would, n then I put that on the set, yeah\nMy chain VVS, I flooded my chest, yeah\nYou play with the game, we pull up with sticks and put you to rest , yeah\nI'ont give a fuck who got it, I put 20 in your... savage, and make do who got the ratchet\nFuck them shells, just let 'em have it, shooters come with automatics\nCall them Steph,  they automatic\nWhen your [??], you got a package, shit was tragic, close a casket\n\nOh MY God who's this? An L beat?\n\n[Verse 3]\nShawty old enough to be my mama, she call me daddy\nChopper hit a pussy nigga, now he shook and threw a baggy\nThis one for my young-ins, yeah\nThey're the ones causing the havoc, yeah\nThey're the ones causing the havoc, yeah\nThey're the ones causing the havoc, yeah yeah\nAll of young niggas savage\nThis one for my young-ins, yeah\nThey're the ones causing the havoc, yeah yeah\nAll of my young-ins be causing a havoc, yeah yeah\nAll of my young niggas savage, yeah\n\n[Outro]\nEvery niggas causing a havoc (Eheheh)\nI'm good , eh (Heh)"}], "artist": "Lil Bibby"}