{"songs": [{"title": "Games", "image": "https://images.genius.com/d609e1b49e9f4cfb1bb9aa51a29211de.1000x1000x1.jpg", "lyrics": "[Intro - Brother Ali - talking]\nAh, what's up man? (What up Ali?)\nAh, you still standing on this motherfuckin corner?\nShit ain't you 30 years old, motherfucker?\n\n[Verse 1 - Brother Ali]\nAh, so when I pick up the microphone I know what I'm sayin\nWasn't long ago was facin the same situation\nCarpet got ripped from me pacin\nThe rent's a month late, ain't shit on the way, I'm straight prayin\nEnds don't meet unless you make 'em\nThe people don't eat unless you scrape and you see they ain't playin\nCorner store credit is way thin\nThe World got it's way of weighin on your shoulders, it's degradin\nIt's like we got frowns tattooed on our faces\nThe school's ain't savin our new generation\nStare at our kids, they need a paradigm shift\nThe paradox is that parents aren't shit\nWhy you got cable? Your life is not stable\nLights not paid for, Nikes on layaway though\nIt's like we wanna look good while we drownin\nShould grab a paddle and scrap our way out\n\n[Hook - Brother Ali] - 2X\nLife's not a good when you livin it like this\nLeave your lane for a minute, you might flip\nIt's like chains on your neck with a tight grip\nUse your brain in this shit and you might live\n\n[Verse 2 - Brother Ali]\nWhile you in the drug game, my hustle got another name\nYou dyin, makin somebody rich, it's the fuckin same\nSo quick to call a square job, Brother lame\nTruth be told, you might wanna choose another lane\nYeah I'm bussin 'til my bitch ass job\nYou on the corner, pushin them bitch ass rocks\nAnd yes I'm gettin sweated by my bitch ass boss\nYour ass steady runnin from them bitch ass cops\nThis shit don't stop, the game ain't new\nThe pen's full of dudes who thought the same shit too\nThat TV is a blind fold, here to keep your eyes closed\nSell your crack and it's all dough and fly clothes\nShit ain't nothin like \"The Sopranos\"\nReal talk, you're probably better off at McDonald's\nRappers all say they went from hustlin to rhymin\nBut look, everybody say the other one's a liar\n\n[Hook]\n\n[Break - Man - talking]\nMan, fuck you Brother Ali\nYou always runnin your mouth\nJust cause you got that rap shit cool\nMan we on these streets motherfucker\nGet out here and see how it is\n\n[Verse 3 - Brother Ali]\nIt don't matter about me rappin, my ass is still scratchin\nSome day, I'm a be the \"yo, remember back when?\"\nWhile I'm hear I got to really make it happen\nTry to have emergency landing, instead of crashin\nFuck sayin I've been here, brother I am here\nMight not live here this year but I still care\nNot talkin down to you, straight to you\nNo player hater my dude, it's plain true\nGotta live like don't nobody love you but you\nAs long as your blood move, tragedy could touch you\nStruggle ain't nothin new, cards ain't gonna always land how you want\n'em too\nFuck it though, thug it through\nCan't give up, as much as you'd love to\nThere's certain shit as a man we must do\nYou God damn right they made it like this\nBut I ain't tryin to wait for the day they might fix\n\n[Hook]", "year": null, "album": "Us"}], "artist": "Brother Ali"}