{"artist": "Petey Pablo", "songs": [{"album": "Diary of a Sinner: 1st Entry", "title": "Diary of a Sinner", "image": "https://images.genius.com/0d2bbb0b347544f2a5d6ad0222f2fcda.220x220x1.jpg", "lyrics": "[*In Backround*]\nI feel you Pablo\n\n[Petey Pablo]\nThis Petey Pablo\nApril the 9th, 19-2000\nDiary of a sinner, huh, 1st entry\n\n[Verse 1]\nDear diary, this the 1st time\nI had a chance to sit and just think with a clear mind\nHas a homeboy stressed out for a little while, few things ain't work out\nCould somebody come out or it's about 3:29, i'll give it about another hour\nI'm over here at your man house\nOn your man couch, just puttin these thoughts down\nMaybe this right here one day will be worth something\nBefore we start messin up\nYou know you get big when you leave, it's a damn shame\nBut that's the way that it gotta be huh\nLook at Malcolm X, Martin Luther King\nMarvin Gaye, 2Pac, B.I.G. and Big Pun damn this pen messy\n\n[Hook]\nA motherfucker had thought\nAnd I had to write em down\nIt's the diary, of a sinner\nA motherfucker had thought\nThen I had to write em down\nLiving life as a born loser\nLiving in a world that I didn't choose ohhh\n\n[Verse 2]\nDamn, I'm back, I had to change pen, I done got ink everywhere\nAll over my hand, and on my pants and, how in the hell I get it way down there?\nJust can't get it right\nSeem that everything I do just fall on one side\nBut I can say one thing, I don't always get mine, and I don't ever stop tryin'\nFeel like I was here before my time\nPeople say when they hear my rhyme\nPeople see it when they look in my eye\nIt's like [?], like 35 years on a 26 year life\nI done walk so many miles in these shoes\nI'm surprise that the bottom ain't wore out\nI'm about to go take a walk right now\n\n[Hook]\n\n[Verse 3]\nMmmm hmmm\nIt wha good to me\nA little walk, just what I needed\nCool breeze, nobody on the street with me\nMy own little world of peace\nBut reality gotta be what it gotta be\nAnd nothing in the book said, life will to be sweet\nI'm pleased with the life that was given to me\nI could of still been sleep\nOn my way so please when none this here will matter to me\n'Cause, know when I messed up, several times\nI just done something tonight\nAnd I know I know right from wrong\nAnd that's what kill me\nI still do the wrong thing\nAm I crazy? Can't believe I got a damn diary\n\n[Hook]\n\nOh oh oh  ohh\nLiving life, living life\nOhh a diary, a diary ohh\nAnd it's written on paper ohh\nCan't you just see it\nAll of my life oh\nAll of my life oh\nAll of my life\n\nAll of [x3]\nAll of my life oh all right\nOh it's the diary of a sinner\n\n[Petey Pablo]\nThere it is, my life\nRight there, right in your face\nThe diary, I wanna thank everybody that went out and picked up the album\nGot the album, and got a chance to understand who, who I'm is\nKnow what I'm saying, everything I gave ya'll was the truth\nDamn I ran out of time", "year": null}]}