{"artist": "Inspectah Deck", "songs": [{"title": "No Good", "lyrics": "[Sample]\nI miss her secretly\nAnd it's no good for me\n\n[Verse 1]\nUsed to run the streets every night and day\nMomma love pray please don't throw your life away\nAnd momma used to say, \"Take time young man. Use your mind wise and devise a strong plan.\"\nThen the devil roll up, with his girl temptation\nPeople obey cause they too afraid to face him\nMe I wasn't even tryna break the mold\nJust sick of the shit, tryna take control\nThrough the rain, hail, snow gotta make the dough\nThat's the life, right, slowly it'll take your soul\nFelonies adding up, just take my rights\nRelationship goals I had to change my life\nGot jealous ones judging me\nCops wanna fuck with me\nWanna get the strap but the seeds looking up to me\nLiving through scrutiny\nEyes on my destiny\nBlowin' on blue dream\nListening to Can It Be?\n\n[Hook]\nDying to keep it so hood\nAt the end of the day you find it no good\nThe lifestyle, wow it feels so good\nGet the girls, sip the Hennessy and smoke woods\nYou the talk of the town, through the whole hood\nOn your grind, getting money like you know you should\nSell your soul for the gold, yeah I know you would\nCan't knock you, racked up all the dough you could\nYo, I ain't gotta tell you if you know the hood\nWatch your back, though, bro they up to no good\n\n[Verse 2]\nTeach the young ones, help them make their life better\nSee it's cold now, even in the nice weather\nA lot of attitudes, people being treated kind of senseless\nSo relentless, the negativity is endless\nAin't no love in the city's heart\nThis is deep water fit for the biggest shark\nMurder, death, killed check the crime rate\nKnow what a khazer is?\nThat's a pig that don't fly straight\nIf you ain't straight then you crooked\n99% of the time, if you ain't make it then you took it\nLook, I spit a jewel that the gambler gave you\nNever count your money, while you sitting at the table\nAnd all of that won't even save you\n'Cause when you in too deep, these mean streets will claim you\nAll your soldiers gotta move in line\nOr you could be the one that's on the news at 9\n\n[Hook]\nIt's fine, I know you wanna keep it so hood\nAt the end of the day you find it no good\nThe lifestyle, wow it feels so good\nGet the girls, sip the Hennessy and smoke woods\nYou the talk of the town, through the whole hood\nOn your grind, getting money like you know you should\nSell your soul for the gold, yeah I know you would\nCan't knock you, racked up all the dough you could\nYo, I ain't gotta tell you if you know the hood\nWatch your back, though, bro they up to no good", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}