{"artist": "​iLoveMakonnen", "songs": [{"title": "Sound Like Who?", "lyrics": "[Hook]\nThem niggas tryna sound like who? us? ay, us?\nThem niggas tryna sound like who? us? ay, us?\nThem niggas tryna sound like who? us? yeah, us?\nThem niggas tryna sound like who? us? yeah, us?\n\n[Verse 1]\nNigga I hit the club, all these fucking songs\nSound the god damn same, what the fuck these niggas on?\nBoy these niggas lame, out here rapping the same shit\nAnd when I pull up on these niggas, they never have no bricks\nOr no weed, or no molly, or no motherfucking coke\nMan this shit is not funny, these niggas ain't even got no jokes\nBoy they broker than a joke, I'm out here really selling that dope\nAnd I'm talking on tracks, niggas speaking these facts\nAnd my dope is fucking art and nigga, my art is dope\nSo please don't misconstrue my dope for meaning I'm here selling coke\nCause I do not sell no coke, unless it's Coca Cola that's on me\nWater products, no, nigga on us, fucking get a sponsor\n\n[Hook]\nThem niggas tryna sound like who? us? ay, us?\nThem niggas tryna sound like who? us? ay, us?\nThem niggas tryna sound like who? us? yeah, us?\nThem niggas tryna sound like who? us? yeah, us?\n\n[Verse 2]\nAll my fucking songs nigga, watch my flow\nAnd come and see your nigga out here when I'm doing out my show\nI be standing on the stage, hit them with the old dances\nLike the butterfly and then maybe tootsy roll\nCause this nigga out here snapping, I got bitches who clapping\nYou know I shut it fucking down when it come to this rapping\nFinna wake up in the morning and get back to the trapping\nI call my nigga in Atlanta and I call him the captain\nCause that nigga be telling all the boys what to do\nWe got soldiers in the street who be wearing red and blue\nI got soldiers in LA and they look like mamba too\nThe way them niggas shooting, they should be a number 2\nWith a 4 on their jersey, tell that nigga, come and hurt me\nI be out here in New York, putting Rodman down the jersey\nMotherfucker got the best work, nigga it's a damn jerk\nMotherfucker on Sunday, I'm still preaching at the damn churches\nServing from the pool pit, nigga ain't on no bullshit\nNigga unless I'm in Chicago wearing my fucking Bulls fit\nNigga what's up though? You know my flow is goddamn sick\nThat's why a nigga fuck around and god damn throw up on this bitch\n\n[Hook]\nThem niggas tryna sound like who? us? ay, us?\nThem niggas tryna sound like who? us? ay, us?\nThem niggas tryna sound like who? us? yeah, us?\nThem niggas tryna sound like who? us? yeah, us?", "image": "https://images.genius.com/ec02efc692cd2274b85d5e771ec83d76.500x500x1.jpg", "album": "Red Trap Dragon", "year": "2016-05-11"}]}