{"songs": [{"image": "https://images.genius.com/246e4408dbf779ecc2275ceef46c850e.453x450x1.jpg", "year": "1992-04-16", "title": "Crazy Than A Muthafucca", "album": "Psycho Active", "lyrics": "{Verse 1: X-Raided}\nNowadays, A nigga gotta be a lunatic\nA straight double blind nigga going triple six\nLyricists, Get with this, Nigga I don't think so\nUnless you wanna be treated be a damn Skitzo!\nI'm knocking them out the box, Get off my jock\nBefore I smoke your ass like a rock\nAnd I'm a take a serious hit shit\nI never will quit you thinking you could fade me, Nigga forget it\nI'm on an impossible mission, Like a fisher, I'm fishing\nWhen will you step up, Because I'm wishing\nI ain't had to slay in a while\nI haven't had a chance to show off my new style\nOn an insane pearl, Straight Loccing up\nKilling motherfuckers, Cause I know what's up\nBut the X is a nigga taking his time\nAnd if you talking shit, Then you can bite my nine\nMy finger might slip on the trigger\nBut who cares? It's another dead nigga\nYou got a problem with that? Then step up\nBut be real, we're crazy than a muthafucka\n\n{Chorus: Sample from Ice Cube}\nA crazy ass nigga\n\n{Verse 2: X-Raided}\nOne hard motherfucker, Going loco\nYou piss me off, And I'm a smoke yo\nAss, I blast with the nine\nDouble M, The X is insane to the mind\nThere ain't no cell that can hold me\nBe insane, Was what the niggas in Hell told me\nThat's why I'm going on a rampage\nAnd if I get the gauge, Suicide's on the front page\nSacramento newspaper, All you motherfuckers got the vapers\nAll on the Lynch Hung dick and shit\nMotherfuckers is stuck on stupid\nBut I'm a killing on the willing, Bitch\nAnd if I get rich, It don't mean I'm a switch\nI'm a always be Mafia, Nigga\nMidtown hold, Sac Town, We're all there, yo\nI know what the deal is\n(That's right?) Damn right, I know what it is\nAnd don't let that be the reason\nYou get your neck broke, Cause I ain't no joke!\nNiggas don't understand, One nigga deep\nIf you wanna jack me, Don't sleep\nCause we know what's up\nThe whole Mafia's crazy than a muthafucka\n\n{Chorus: Sample of Ice Cube}\nGoddamn they ruthless\nMotherfucker said what?!\n\n{Verse 3: X-Raided}\nX-Raided, The MC, Kicking that hard shit\nWith the help of Tech, Lynch, And Triple Sicx\nA nigga like the X has is going on\nKicking raps to a beat that's pumping strong\nThe whole posse is dressed in black\nNiggas try to step up, And get the Prozak\nCause I'm a nigga that's rotten\nFor a sucker motherfucker to hold the Glock\nX is a nigga from the S-A-C\nHomicide came first, But that don't concern me\nIt's my turn, Like Schizo\nBut that still don't concern me, hoe\nI'm clowning, Damn right I'm clowning\nI'm clowning and I'm clowning\nPunk ass niggas that don't know\nIn my language, X means Skitzo!\nSo little fool, Don't trip, Unless you wanna get the Triple Six\nConcept, One more time, Concept!\nI say what I say want, Motherfuck your rep\nI get it going on, I got it going\nCatch myself with a beat, Then I'm flowing\nKeep my cash flow on hold, But don't press your luck\nBecause I'm crazy than muthafucka\n\n(X-Raided talks until the song fades out)"}], "artist": "X-Raided"}