{"artist": "Wax", "songs": [{"year": "2010-01-01", "lyrics": "1st Verse:\n\nShe was from the other side of the train tracks\n\nA classic tale of Romeo & Juliet played back\n\nI was from the city, the inner parts\n\nShe was from the hills attending fancy dinner parties but still\n\nWe managed to see each other I had a weekly bus pass\n\nShe has a merecedes c-class and trust it was much faster\n\nI am a rapper she is a classic pianist\n\nI sleep in boxers while she has a pair of fancy pajamas\n\nWhen we’re together both our social status don’t even matter\n\nWe should just go to Nevada, get married and don’t ever look back\n\nShe was the classiest, sassy, with a passion for fashion sense, smashin on any of those nasty ass hoodrats\n\nUncomparable, but only if her parents approved, maybe they got something against asian-american dudes, just playin\n\nEither way I'm sayin its just terrible news, can't give you 14 karats but can serenade you with tunes\n\nChorus (Sam Ock):\n\nYou and me, we are two stars from different galaxies\nWill we cross or be aligned? I guess that we'll see in time\n\n2nd Verse:\n\nI swig on 40 ounces she sips on champagne, she has a huge backyard I do the landscapin\n\nI get her single roses, she gets me laker tickets, call her on my prepaid phone when I can't wait to kick it\n\nWe're quite the odd couple, but who are you to judge, I know it dont make sense, you can call it stupid love\n\nBut its the whole world against us, they can try to stop us but we're going out like gangstas, I know that I'm hated by her camp\n\nBut I swear this'll end like the lady and the tramp, I'm just waiting for my chance\n\nThey keep saying that shes way too good for me, sometimes I wish sugar momma was sugar free\n\nCause I ain't in it for the dough, I ain't diggin for the gold, I just wanna show all yall what both of us been knowin\n\nI don't want any problems or any of her dollas, I just want yall to leave us alone and don't call us\n\nChorus (Sam Ock):\n\nYou and me, we are two stars from different galaxies\nWill we cross or be aligned? I guess that we'll see in time\n\nYou and me, we are two stars from different galaxies\nWill we cross or be aligned? I guess that we'll see in time\n\n(Piano Solo)\n\nBridge:\n\nIts the whole world against us, they can try to stop us but we're going out like gangstas!\n\nIts the whole world against us, they can try to stop us but we're going out like gangstas!\n\n(DJ ZO Scratches)\n\nChorus (Sam Ock):\n\nYou and me, we are two stars from different galaxies\nWill we cross or be aligned? I guess that we'll see in time\n\nYou and me, we are two stars from different galaxies\nWill we cross or be aligned? I guess that we'll see in time", "image": "https://images.genius.com/44dd39d0615b4c8bfa0139233cabe52e.425x425x1.jpg", "album": "Clockwise", "title": "Different Galaxies"}]}