{"artist": "Casey Veggies", "songs": [{"title": "Ridin’ Roun Town", "album": "Sleeping in Class", "year": "2011-09-19", "image": "https://images.genius.com/aaf0da7a07e05d17ff3c822d7769bd09.500x500x1.jpg", "lyrics": "[Intro: Josh Peas]\nSwag, swag, swag, what's really wavy, man?\nIt's Josh Peas, ain't shit funny\nI'm here with my young boy Casey Veggies\nBeen shittin' on you niggas since '06, they know, they know\nAnd I just want y'all to, close your eyes, take a deep breath\nAnd appreciate this real nigga shit, Peas and Carrots, Carrots and Veggies\nWave, swag, chop!\n\n[Hook]\nRidin' roun' town, mo' change, mo' steelo\nNew girl with me, but I keep it on the d'lo\nAll these things goin' down, what you think she with me for?\nLook like she from Rio, sweeter than Tampico\n\n[Verse 1]\nYoungin' on my fly shit, fresher than a peacoat\nGrew up nice, so when I sit back and write\nI touch my life and every single thing I think of at night\nMind was in the dark, had to reach and switch on the lights\nDiggin' deeper, tryna figure whats right\nShit be cuttin' like knifes, but I just try to numb it with life\nI'm, ridin' roun town, mo' change, mo' steelo\nNew girl with me, but I keep it on the d'lo\nIt's a lot of things goin' down, what you think she with me for?\nSpread out bigger, got my people on the East Coast\nCook it up, for the bucks, what you tryna be for?\nModel for the kids, man, that's why I keep my sneaks low\n\n[Hook]\n\n[Verse 2]\nI'm a cocky young nigga, but I know when to cut it out\nYour girl amused by me, when she talk, she got stutter-mouth\nRidin' roun town, mo' change, mo' steelo\nNever been to NY, but I'm 'bout to pay the fee though\nThen hit ATL, rockin' sales far as we know\nPress play grind, no TiVo, that's the G code\nKickin' with friends will get yo ass no ends\nAnd she gone regret I pass, when I pull up in a Benz\nI'm just wiping off my lens, I don't see these niggas\nMade a promise to myself, \"I won't be these niggas.\"\nGirl, you don't know if I hit it! You ain't seen me wit her!\nYoung boy, so cold, I'll let you see me get her\nThese girls see me on MTV, nigga\nShe throw it at me, went ahead and caught the TD with her\nIt’s all about what you earn not what the feebies get ya\nDon't say LA, without CV in it, feel it?\n\n[Hook]\n\n[Interlude]\nAhh man, we ridin' roun' town, top down\nDreamin' big, nigga, Peas and Carrots\n\n[Verse 3]\nFour doors, girls goin' loco\nOver Four Loko, we was poppin' that night\nShoutout my nigga KY, she was droppin' that right\nMe and the homies be shaded up, with yo girl out of sight\nMade a right on Hill St., comin' off La Cieniga\nMy girl ridin' with me, like she my manager\nLike she got plans for us, but I just got plans to bust\nNiggas think I'm runnin' out, but I stay gassed up\nBlew my shit up, from the ground like NASA\nThis for everybody roun' town with they cash up\nThis for all the girls, and bitches, Louis-bagged up\nPray it all go down, happily ever after"}]}