{"songs": [{"year": "1994-06-28", "image": "https://images.genius.com/da485f2d908437a49ed62020b7d39795.800x800x1.jpg", "title": "Ghetto Love", "album": "Somethin’ Serious", "lyrics": "It's like this\nI'm 17 and I feel I need to get my ass on out\nOf my grandmama's house\nFeelin like I don't need to obey no rules\nAnd I choose to make money and fuck hoes over school\nSo I cruise up and down the block\nWith a gang of niggas and a pocket full of motherfuckin rocks\nAnd a whole lotta game for the fiends\nCause this black-ass nigga on a mission ain't takin shorts by no means\nAnd I seen everything from hoes I used to know sellin ass\nTo motherfuckers dead from the blast movin fast\nGettin caught up in the drama\nNow I'm able to do things for my little mama\nAnd she appreciated every little bit of it\nSpendin all her time lookin out for me and shit\nLettin me know when the situation's gettin shady\nAnd I'm startin to feel love for this young lady\nCause she was downer than a motherfucker\nIn love wit a nigga like me, but yo she kept it on the undercover\nShe used to say our business ain't show business\nAnd them other bitches business ain't yo business\nSo I had to keep her close at hand\nWhile I was comin up, cause she was down with her man\nUnderstand she grew up with next to nothin\nAnd was sick of seein her shit gettin stole every month then\nCause her mama smokin up the whole house\nNow she gotta get her shit together cause she gots to roll on out\nAnd the only motherfucker showin love is her nig'\nThat's why she did the shit she did\nHit the mall, steal me and her some clothes\nHit a lick and break a nigga off some vogues\nFor my motherfuckin car\nShe looked out for me, so I looked out for her\nLike that? Yeah, it was like that\nDidn't sweat a bitch cause when I left she'd know I be right back\nWe might fight, black, but it never last long\nIf you try to come between us, nigga, get yo ass on\nLike them niggas that I hang with\nLet me know they ain't down, they tryina get at my thang and shit\nHad to know what has happenin\nWasn't like the average nigga gettin caught up in that high cappin\nWhat you got don't mean shit\nAnd I was quick to get in the mix behind my bitch\nFar from a trick, and never did she ask for shit\nEverything she got, she deserved it\nYoung love in the ghetto, hello\nKnew I had a down hoe, didn't wanna let go\nStraight based on trust\nAnd while other motherfuckers got crushed they couldn't fuck with us\nTo fuck with while we were rollin was unwise, G\nCause we were fully strapped, jammin them Isleys\n(Drifting on a memory)\nToo deep\n(Ain't no place I'd rather be)\nRollin with somethin sweet\nSo unique\nYou know where I wanna be?\nYeah\nKnow where I gotta be?\nYeah\nYou know where I'm at?"}], "artist": "Big Mike"}