{"songs": [{"year": "2018-09-11", "image": "https://images.genius.com/8fd7bba15fa2a318f26c4adbade88758.640x640x1.jpg", "title": "Choose A Player", "album": "We over Famous", "lyrics": "[Intro]\nBlueface baby (Mop)\nThis is an Ace production\nYeah, aight (Bleed 'em)\nMr. \"Only Call a Bitch When I Need Her,\" yeah\n\n[Chorus]\nFuck a boyfriend, lil’ baby, choose a player (Blueface, baby)\nGot her lost in the sauce, kickin' flavor (Too much flavor)\nMr. \"Only Call a Bitch When I Need Her\" (Over)\nGrammies on my neck, froze like a freezer (Eugh)\nFuck a boyfriend, lil' baby, choose a player (Blueface, baby)\nGot her lost in the sauce, kickin’ flavor (Too much flavor)\nMr. \"Only Call a Bitch When I Need Her\" (Over)\nGrammies on my neck, froze like a freezer (Eugh)\n\n[Verse]\nMr. \"Only Call a Bitch When I Need Her\" (Blueface, baby)\nFuck a boyfriend, lil' baby, choose a player (I'm a player)\nGot her lost in the sauce, kickin' flavor (All this sauce)\nOnce this mack can get her, can't nobody save her (You can't save her)\nI ain't talking app, but lil' baby, let’s Facetime (I need Facetime)\nOnly when it’s face, you can keep your damn time (Keep that damn time)\nCall her when I'm horny like the bitch a hotline (Hotline)\nAll I got for you is hard dick and hot lines (Hot lines)\nCall me mistress, send the bitch straight to voice mail (Straight to voicemail)\nTime is money, so you better make it worth it (Over)\nMoney, money, all I want is the cheese (Ooh)\nPulled up so cold, I gave the bitch the chillys (Eugh)\nI’m just too player, lil' baby, hate the game (Hate the game)\nKeep that love and affection, give me brain (Brrang-dang-dang)\nBoyfriend always hating on a nigga mackin'\nI let this MAC go brrang-dang-dang-dang (Brrang-dang-dang-dang)\nHelp a nigga fall back like November (Like November)\nI need a lil' baby that’s ugly with the shits (Whatever)\nDick the bitch open like she a condiment (Nasty)\nGet what I want out the bitch then I dip (Then I dip)\n\n[Chorus]\nFuck a boyfriend, lil' baby, choose a player (Blueface, baby)\nGot her lost in the sauce, kickin' flavor (Too much flavor)\nMr. \"Only Call a Bitch When I Need Her\" (Over)\nGrammies on my neck, froze like a freezer (Eugh)\nFuck a boyfriend, lil' baby, choose a player (Blueface, baby)\nGot her lost in the sauce, kickin' flavor (Too much flavor)\nMr. \"Only Call a Bitch When I Need Her\" (Over)\nGrammies on my neck, froze like a freezer (Eugh)"}], "artist": "Blueface"}