{"artist": "C-Rayz Walz", "songs": [{"title": "Showgun", "album": "We Live: The Black Samurai EP", "year": "2004-09-07", "image": "https://images.genius.com/6db5062033813b4d2fef23bb8ec78afa.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nAll rebels run.  All devils hung\nAll rebels run.  All devils hung\n\n[Verse 1: C-Rayz Walz\nPersistence and patience the sword we keep\nTo make a long story short and your existence brief\nFor instance, peep my invisible stance\nAnd hear how we make sick lines with mineral hands\nIf you listening, my discipline is more than a tattoo\nCome face to face with the eyes of a statue\nThe vibe that’ll grab you and grapple, trapped in the castle\nThe rhythm’ll bash you, the samurai’ll slash you\nMore cuts like this?  They gonna send some bonds\nYou on point, Walz?  Yeah, I’m a ninja star\nBehind a waterfall is pain rain, the science of tears\nDefiantly clear.  When the tyrant appears, it’s fear\nAnd yeah.  In the air is the aroma of death\nThe true victor is the soul controller of breath\nBlue sister, where is red brother?\nOut with yellow Rayz, getting J’s off purple haze with mother\n\n[Hook 1: C-Rayz Walz] (x2)\nThe Shogun bow down to no one\nDiscipline’s the code ‘til the flow’s done\nSunlight empowers the flower drum\nAs soon as the hour comes, you’ll witness the black samurai\n\n[Verse 2: C-Rayz Walz]\nWhen the rice fields, the bamboo shoots\nAnd the slice heals in the brand-new truth\nThe grasshopper speak to the [?]\nAnd the snake in the grass moves to the dead leaves\nTo increase much sight, use the blind route\nIf one knows, two must find out\nNow who will hide out in search of self?\nAnd enter the mental mansions of wealth and stealth?\nWell, no one knows why the caged bird sings (No)\nYou must live intelligently for everything\nIn life, you go through hell to come out right\nIt’s light!  Cary was born in the midst of the fright\nI write, using my pen as the last katana\nClash with karma, slash your armor, snatch my honor\nNow my spiritual reflect high chi energy\nConsistently, the chemistry of my word wizardry is heat\n\n[Hook 2: C-Rayz Walz]\nThe Shogun bow down to no one\nAll my rebels run.  All devils get hung\nSunlight empowers the flower drum\nAs soon as the hour comes, you’ll witness the black samurai\nAll my rebels run.  All devils get hung\nSunlight empowers the flower drum\nAs soon as the hour comes, you’ll witness the black samurai\n\n[Verse 3: C-Rayz Walz]\nIt’s my duty to spit—the Mount Vesuvius flip\nOff a cliff into a pond and I disturbed the fish\nHardly ditected—I rain in the form of a mist\nPunch snakes in the face, stop the form of a hiss\nBefore they yang the yin, talk with slang and grin\nWe remain the same and then watch the chains begin\nThe strangest phlegm treated as a house guest\nRemove your shield at the master’s request, I guess\nThe shells not needed for seafood\nWhen you see fools and see through like a wise sifu\nI got black hawks down to white-crane roundhouse your crown\nRight where the jewels is found\nSeven dojo palms, five elements strong\nCold wind, water, earth, firebomb, bomb your storms\nTigers crouch low, dragons fly high\nKihontenkini, [?]\n\n[Hook 2: C-Rayz Walz]\nThe Shogun bow down to no one\nAll my rebels run.  All devils get hung\nAll my rebels run.  All devils get hung\nThe Shogun bow down to no one\nAll my rebels run.  All devils get hung\nThe black samurai\n\n[Outro: C-Rayz Walz]\nDJ Black Static, Stronghold Number 8.  It’s about time.  The Def Jux beast.  C-Rayz Walz, the black samurai.  Welcome to the chambers of anger, swordsmanship.  Sharp lyrics.  [?]"}]}