{"artist": "King T", "songs": [{"image": "https://images.genius.com/cf87abd2f39a5810ebc8f3707912ea12.500x500x1.jpg", "title": "I Don’t Wanna Die", "year": null, "album": "Thicker Than Water (Soundtrack)", "lyrics": "[Verse 1]\nJust another night in my Philly\nWill get dreams ain't worth a penny\nWe celebrate life every night, toast a (?)\nI feel it in me, it's frustratin' enough\nTo watch the lil' homies on the grind tryin' to come up\nBut look at me: the older generation O.G\nTryin' to shake these nine-ounce into a key\nThinkin' major, knowin' all the time I need to save ya; the anger\nI thank the feds for playin' on my pager!\nHuh, but in still I smash out without fright\nAnd raise the six hundred headlights through the night\nKeep it tight! My reputation stands well\nCuz all the good niggas are either dead or in jail\nLet's ?pretend? For one second hustlas who had riches\nStop flossin' for these fake ass bitches\nPuttin' all these G's turned snitches but it's (?) these days\nYa homeboy will put you in ya grave...\n\nChorus: [2x]\nAnd I don't wanna die but if I do\nHomies, don't cry! I did so much dirt I should fry\nAnd, loc, sometimes I don't wanna come outside\nBut I'm all G'up, so let's ride!\n\n[Verse 2]\nI wake up every morning the same\n?Hollowed? with my grains\nPeepin' out my window for the change\nBut all I see is pain. I sold out my soul for the game\nFamiliar. Dat's why I gang bang, dat's why I slang 'caine\nI gots to maintain for what's I head\nMy baby-momma bringin' mo' drama than the feds\nBut I ain't scared of all the automatic full of lead\nI'm proof for the livin' walkin' dead!\nI'm rollin' wit some niggas prepared for anything, anywhere\nAnytime fag in the hood are over there\nDat's my outlook on life until it ends\nA pocket full of chips and a Benz\nShakin' all them so-called friends because they scheme and they plot\nTo lay me down and get what I got\nWe're runnin' off their spots wit Glocks and fo-fo's like vets\nAnd before I leave I cross out their set!\n\nChorus: [2x]\n\nInterlude:\n\"But, you know, it's like everybody I hear\nWanna be a tough guy killa, a gangsta, you understand?\nBut, ah, most of the gangstas and killas I know (?) dead\"\n\n[Verse 3]\nI don't wanna die but I see the devil's walkin' his flame (?)\nCallin' my name like he know me\nI pray dat god (?) his (?) foe me, show me a sign!\nI be right here on the front line in this war zone\nTryin' to get mine before it's time\nBut as I step over bodies dat I peeled\nThe vision hell's angels and the field (?)\nWavin' at me, getting close witta fat grin on the (?)\nBut they always take the niggas dat I killed\nG, the situation is ill, I feel my turn's probably next\nDat's why I sport a bulletproof vest, but I stress\nAll it takes is one shot to the dome\nNow your family's sittin' in the front row when you're gone\n\nChorus: [4x]"}]}