{"artist": "3rd Bass", "songs": [{"lyrics": "[Intro]\n“No static at all...”\n\n[Verse 1: MC Serch]\nBeef not needed to waste one\n'Cause trouble don't feed the bass drum\nSome so feeble, so play the hoodlum\nA humdrum liver in bedlam\nBet your last buck, you don't laugh to this\nYour horse came last behind the cactus\nBack so strong, you thought wrong a fallacy\nThe groove will whip and flip, 'cause it has to be\nIn there, like Belvedere in his underwear\nOn the new year, my dear, so make it clear\nI'm gonna ask do you wanna live small?\nStatic? Nah troop, none at all\n\n[Pete Nice]\nWhy meddle in the middle of a ruckus\n[?] sip slowly on Snapple in hand\nNot these hands of mine holdin' clippers\nSlip and clip your flat-top to Ceasar\nEase your ego, I go toe to toe\nThrow my voice like I throw my yo-yo\nAnd ho-ho-ho, on the mic, is life support\nAnd toward a crumb static ain't my sport\nI swing to this, Serch swings to that\nAnd as you noticed, they always wear hats\nBoots and loops produced by Prince Paul\nSlaps ya skull, no static at all\n\n[Verse 2: MC Serch]\nStatic mixed in, but it don't cling\nTo a fat rope dope Gucci link or an earring\nHand now gropin' for stabbin'\nBut the hand is used to get skins\nSkim the cream, but it seems you still rise\nFor some who lives more, now life lifesize\nAll are lepers in my SwingDom\nGroups and troops get friends and they bring them\nIn goes, props so pop til the mornin'\nHome to the young, pop still snorin'\nWake up, you blockhead, and heed the call\nAy o, no static at all\n\n[Verse 3: Pete Nice]\nI flip on kicks, my DJ tricks\nThe a.k.a code name Richie Rich\nDaddy Rich\nDaddy\nDaddy Rich\nD-d-d\nDaddy Rich, you never watch him on TV?\nStraight no takes, the iron had Eastbridge\nFull on 1210's flippin' the beats\n\nSome bust nuts, Daddy Rich bust cuts\nSuch transform over rhythms on dust\nI rush this rhythm, hold like Mingus\nI swing this joint, no static to sting this\n\n[Nice]\nA bitch's brew, who snappin' gyro\n[Serch]\nScabs can't craft what only the fly knows\n[Nice]\nGot skins all in on schemin'\n[Serch]\nScandalous hooks grab on to what's gleamin'\n[Nice]\nI'm seemin' vexed in my rhymin' texts\n[Serch]\nOpened up shop to chop off the hairnets\n[Nice]\nI put off punks like junk so sporadic\n[Serch]\nStashed away like old drawers in my attic\n[Nice]\nOr drawers on my legs, figures what I says\n[Serch]\nSnack on Jolly Rancher or Orange Pez\n[Nice]\nYep this ain't no collect call\n[Serch]\nSo peace, yo Pete\n[Nice]\nNo static at all!\n[Serch]\nTrue!", "image": "https://images.genius.com/ba67f25eba0c6951171aa44e82a3051a.600x600x1.jpg", "album": "Derelicts of Dialect", "title": "No Static at All", "year": "1991-06-18"}]}