{"songs": [{"lyrics": "[Intro: Christy Love]\nI fucks with Hova\nI want you to know\nIt's something about you\nI fucks with Hova\nI fucks with Hova\nTrackmaster's XO\nThis remix is for you\nLet's go!\n\n[Pre-hook:]\nUntouchable, unbreakable, unshakeable, (it's Hovi baby)\nCan't see the unseeable, reach the unreachable\nDo the impossible (it's Hovi baby)\n\nI got another one!\nThis is ludicrous! It's preposterous! It's impeccable!\nYes... (Remix!) Yes... Yes... Baby (it's Hova)\n\n[Verse 1:]\nFirst I had streets, then I had the charts\nFirst I had they ear, now I have their heart\nRappers came and went, I been here from start\nI see them put it together, watch them take it apart\nSee the rovers roll up with the ribbons\nI see them repo, resold, and redriven, so when I reload\nLeave holes, The number one positions, when you hot I'm hot\nAnd when your feet cold, mines is sizzling\nIt's plain to see, niggas can't fuck with me\nCuz I'm gonna be that nigga for life\nOh this is not a gimmick\nThis is God given, this is hard livin'\nMixed with cristal sippin\nThis is the most consistent (Hov!)\nGive me the most hits that you can fit inside a double disc\nHomie I'm home on these charts, you niggas visitin'\nThis Hov tradition, Jeff Gordon of rap\nI'm about to claim pole position\nHolla at ya boy!\n\n[Hook:]\nCan't touch the untouchable, break the unbreakable\nShake the unshakeable (it's Hovi baby)\nCan't see the unseeable, reach the unreachable\nDo the impossible (it's Hovi baby)\nCan't move the unmoveable, stop the unstoppable\nTop the untoppable (it's Hovi baby)\nYes... (Remix) Yes... Yes... Baby (it's Hovi)\n\n[Verse 2:]\nI'm so far ahead of my time\nI'm about to start another life\nLook behind you, I'm about to pass you twice\nBack to the future, got it slow for the present\nI'm fast, dude can't get past my past\nHow do you propose deal with the perfect present\nWhen I unwrap \"The Gift & the Curse\" with a different verse\nAnd I'm so far ahead of my time\nMy grandpop just met my grandmom at a high school prom\nAnd I'm so far ahead of my time\nThese rhymes is waiting\nTill four years later, they on time release\nHe'll probably take them, cop your four copy\nYou realise that every track needed a autopsy\nThe more tracks I'm on, the more I catch bodies\nIf not, listen further, you're missing a murder\nLike NYPD, LAPD, NYDA, OJ's Jury(Yep!)\n\n[Hook]\n\n[Verse 3:]\nCrush linen, what's winning\nIf it ain't him in the flesh, continue to guess\nI'm about to retire my jersey, fuck Mitchell and Ness\nI'ma throwback old school kicks in the Vet\nSixty-nine, yeah, same year I was born\nFlip the numbers, yeah, same year I got on\nNinety-six, yeah, I used to rhyme with the Don\nShout out to Big, Brooklyn I got this shit\nHere is something haters can't figure out\nHalf a milla first week, man they still jigga'd out\nSee, I even sell CD's in the crowd\nThe hardest dude out since Reasonable Doubt\nHovi Baby, love me, or blow me baby\nFuck you, you'll pay me to owe me baby\nThey're in denial\nCheck the charts, I'm wearing you out\nI'm about to drop The Black Album in a year\nAnd I'm out\n\n[Hook]", "title": "Hovi Baby (Remix)", "image": "https://images.genius.com/6958c38783268a8538a3765943f07244.500x500x1.jpg", "year": "2003-03-11", "album": "Dysfunktional Family Soundtrack"}], "artist": "JAY-Z"}