{"artist": "G Herbo", "songs": [{"title": "Don’t Worry", "album": "Ballin’ Like I’m Kobe", "year": "2015-09-29", "image": "https://images.genius.com/fce05223ccad3afd182baeaef351e35f.640x640x1.jpg", "lyrics": "[Intro]\nI know...\nDon't worry, I'm determined to...\nDon't worry, I'm determined to...\nDon't worry, I'm determined to...\nDon't worry, don't worry, don't worry, don't worry\n\n[Verse 1: Lil Bibby]\nI be with pistol tottin', kush smokin', lean pourin' crazy ass niggas\nNigga want some work?\nJust pull up, make sure you bring the cash with ya\nI be blowin' money fast nigga\nTry me that's your ass nigga\nNigga talkin' down bout Buckz probably\nCause I don't fuck with that nigga\nI say I did this shit for my dogs\nJust make a call, they'll risk it all\nOr if it's that I just send 'em a text\nHave my youngin's come through make it rain on your set\nSleeping on couches, had pains in my neck\nNow I got three or four chains on my neck\nBitches be trippin', I can't fuck with that\nCut that bitch off cause I ain't for the stress\nThese niggas be set trippin'\nSwitchin' sides, set flippin'\nPocket watch, sneak dissin'\nWhy you worried about the next nigga?\nWhy you all in my pockets?\nWhy I'm always a topic?\nNigga get up off of your ass\nGo and make you a profit\nBuy the mall when I be goin' shoppin'\nGot a habit, really need to stop it\nWe be tottin', Lil Squeak got it\nThese niggas know that he'll pop it\nNiggas know I spit that ether\nBitch I ain't doin' no features\nBout to cash out on that Porsche just to ride past my teacher\n\n[Interlude]\nAnd for Big Bucks I'mma go cause that's my big bro nigga\nNLMB, never leave my brothers man\nDay 1 niggas, no new niggas in my ass, ten year shit\nReal shit nigga\n\n[Verse 2: Lil Herb]\nI be with trigger happy, pill poppin'\nDrug dealin' wild ass niggas\nI'm a young black male dropout\nWorth a couple hundred thou ass nigga\nI'm a Truey, Louie\nI’m Truey Louie rockin, you can smell me before I come around ass nigga\nCause I'm a leanin' ass, loud ass, rollin' out the pound ass nigga\nAnd I got it from the mud\nLil Bibby that's my blood\nWe was in the trap and we was in the stu'\nAnd we was out there tottin' guns\nTook hard work to run them bands up so we fuck it all for fun\nAnd G-Fazo would be proud of me so I fuck it all for 1's\nAnd we got choppers with the drums\nAll type of fuckin' guns\nKnow the Feds watchin'\nNiggas prolly workin', I ain't talkin', I'mma run\nWhen they find me, I be high\nChiefin', chokin', coughin' up my lungs\nRobins full of Hunds\nI don't check for hoes in the club\nI buy crushes, fantas, dutches, swishers with my ones\n80 dollar cups\nBut I'm through with that shit, tryna give it up\nYeah I fell in love\n'Member saying I could never get enough\nBitches on me, they can't ever get enough\nCall 'em up, any day I'm gettin' fucked\n5AM, in the hill just me and Bucks\nWho the hottest from the 'Go? Just me and Bucks\nTake it how you wanna, I don't give a fuck\nNigga run up on me, all you hear is buck\nNow somebody pick him up\nTreat me notepad like it's Spalding ball every time I pick it up\nRecord labels calling now\nNigga balling like I'm tryna pick 'em up, nigga (huh)\n\n[Outro]\nUgh, hey, hey, hey Bibby what's up bro, you already know how we rockin' it man. 150 dream team the campaign man. Free all the 150 demons, RIP all our niggas man. Look. -\n(Don't worry, don't worry, don't worry, don't worry\nDon't worry, don't worry, don't worry, don't worry)"}]}