{"songs": [{"lyrics": "[Produced by DJ Premier]\n\n[Intro]\nUh-huh uh, the saga continues...\nMotion picture shit\n\n[Verse]\nI'm done talking\nRan up in the spot gun smoking\nShot it in the air, one woke him\nSon soaking, sweating in his bed like dun' loc'in!\nThinking to himself what done provoked him\nHis thoughts is racing like a Vulcan\nI swear I saw a light bulb when\nHe finally realized who was the culprit\nI said yeah, remember me from Friend or Foe when\nI told you don't ever ever come around here no more\nTime to pay now, you try to rise, I wave the gun - lay down\nThis time you're really going to listen to Jay now\nI try to talk sensibly, hoping that eventually you realize\nI had this locked and it just wasn't meant to be\nPlus I had sympathy when we all bought rims with your keys\nAnd it was an afterthought that maybe you'll try to avenge me\nBut I was like \"Nah\", Homes had to know he was wrong\nAnd if you caught me on the foul now you sing me the same song\nPlus you promised\nAnd that's really no fun\nAnd here I find you in this Motel 6 with all these guns\nAnd all your goons, lined up in adjoining rooms\nLike some wild cowboys coming to get me at high noon\nBut my mind's like a flower in bloom\nPeep how my eyes just scour the room\nI'm alert, plus I paid the clerk I got it laid out\nYou think you the first nigga I played out, in a two-hotel town?\nCome on now, I peeped your Lexus as you\nLeft the exit got some niggas on that side of the town\nMoney well invested, rudely interrupted\nJamaican accent (Boy you know who you dun fucked with?)\nA gun in your face and that's all you can come up with?\nI'm done talking, back up and clap him, one in the abdomen\nDo me a favor dude, get two ice cubes I pass them\nTake that ice up, for the nicest MC\nAnd please yo, tell BIG, he's unbelievable\nFriend or foe BIOTCH!", "title": "Friend or Foe ’98", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg", "year": "1997-11-04", "album": "In My Lifetime, Vol. 1"}], "artist": "JAY-Z"}