{"artist": "Knoc-turn’al", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/knocturnal.jpg", "title": "Cash Sniffin’ Noses", "year": null, "album": "L.A. Confidential Presents... Knoc-turn’al", "lyrics": "[Slip Capone]\nMac flossy Where you at? (aaah!)\nI wish they all could be California\nI wish they all could be California\nI wish they all could be California hoes\n\n[Too $hort]\nCalifornia bitches (Tim Dog)\nSome bad hoes\nBitch you digging in the wrong dirt bitch\nAin't no gold in here\nFucking with the wrong niggas\nKnoc-Turn'al, Slip Capone, Short Dog\n\n[Slip Capone]\nI knew a tight white bitch named Marianna\nShe lived right around the corner from Temecula\nSee I was bored, I fucked both of them whores before\nSo I called my other bitch Elsinore\nShe wasn't cracking so I called up Hesperia and Monrovia and Valencia\nI got some pussy from Pomona and her sister Corona\nIt ain't nothing like them hoes in southern California\nI knew a bitch named Irvine\nShe had a cousin with the name Santa Ana, it was short for Anaheim\nI got high in Riverside with Receda and Rosarito\nAnd Santa Clarita and [Rameda???]\nI'm pleased to meet you\nI've been all around the world\nAnd with over a thousand girls\nAnd homeboy I don't know what you have been told\nBut eskimo pussy is mighty cold (brrrr!)\n\n[Hook - Slip Capone]\nThese hoes, these hoes, these hoes\nGot cash sniffin' noses\nAll around the globe back to California\nEverywhere I go they all up on us\nThese hoes, these hoes, these hoes\nGot cash sniffin' noses\n\n[Knoc-Turn'al]\nYou might be gold but lately I been doing the platinum pose\n[Girl 1] Knoc-Turn'al's on 128 girl\n[Girl 2] What? I'll be right over\nMagazines choreograph me in photos\nI put out with three dime pieces slamming four doors\nAnd if I can use cities in relation to hoes\nI probably fucked San Fernando's daughter, Santa Barbera\nAnd her best friend Alameda and Sierra\nAnd Ramona's little sister Covina\nAnd I don't know what you thought\nWhether you turned the cat in the night bitch\nStill the only manipulation weapon you got\nKnoc-Turn'al ain't the one to fall victim to your plots\nBefore I save a ho from the block\nHer great grandchildren's corpses will rot\nFuck a ho\nI'd rather have money and a multiple round spitting Glock\nFour mansions with multiple cars investing my chips in stock\nEven if I can't spell dow jones I still pull out fat knocks\nIt don't stop\n\n[Hook]\n\n[Too $hort]\nThey say this is a man's world\nCan't understand it girl\nAll you ever wanted was a man like Chante Moore\nYou know us ballers never have one woman\nAnd when you need us we never come running\nThat's why now you think about your ex again\nYou want to page him just to have sex with him\nBut instead you better call your next of kin\nAnd complain these ballers won't let you in\nShe don't love you she loves money and sex\nBitches shoot you in the head for a rolex\nI know the bitch is a dick fiend\nI fucked her one night when she was sixteen\nI know it seems like a long time ago\nBut I fucked her again when she was twenty four\nBitch I'm an old school vet they call me Too $hort\nLook your woman in the eyes\nWhat she do it for? Biyatch!\nYou know these hoes man\nThey'd do anything if they think it's for the money\nThat's why\n\n[Hook x2]"}]}