{"artist": "Astronautalis", "songs": [{"title": "1515 Washington", "image": "https://images.genius.com/e789c1eee5bf67c9330ead32545b7bf5.1000x1000x1.jpg", "album": "Cut The Body Loose", "lyrics": "[Verse 1]\nPack 'em all in, 4 folks up inside a 3-bed\nFuck a landlord, make a room out the practice space\nRun an orange line through the laundry room and be living\nThree hundred a month, yup, all bills everything\nLiving off of rap, Ramen noodles, and the kindest friends\nDrugs will pay the rent, keep that party moving everyday\nVegan with the tracks, ain't no beef inside anything\nHomies at your back, yup, you survive everything\nExcept that heat, believe in that\nThat smoke will fucking choke your lungs\nBoy, that draft back will flash like a dagger drawn in a club\nSmolder on the mattress till that O2 rolls through and blows it up\nTurn everything to ashes, watch them firefighters soak it up\n\nSo, what would you grab\nIf your fucking house was burning down, two seconds to dash?\nYou ain't reaching for no Nikes, bitch don't make me laugh\nSee how simple your whole life is in the palm of your hand\n\n[Bridge]\nOh! The smoke will lead you home!\n\n[Verse 2]\nAs I write this, Ukraine is burning\nAnd the flames in Venezuela made Valencia an urn\nMy own personal history feels so damn worthless\nAnd I wonder if I grabbed the right things\nWhen I escaped the burning building?\n\nThat silly feeling making your problems feel small\nWhile simultaneously feeling helpless and numb to it all\nFeel like a fucking asshole\nFor all the shoes that I bought\nKnowing they all just turned to ashes\nWhen the laces all caught on fire\n\nAll night I couldn't sleep a wink, while looters broke in\nAnd picked through our singed things\nTo sell it all for scratch so they could chase dreams\nOr chase a high, or chase something else that's in between\nMaybe I shouldn't have kept a god damn thing\nLet it all burn down start over, just slate clean\nThat's easy for me to say cause I didn't lose much...\n\nExcept when I lost touch", "year": "2016-05-13"}]}