{"artist": "C-Rayz Walz", "songs": [{"title": "Childhood", "album": "The Dropping: Colonic Progression", "year": "2006-12-09", "image": "https://images.genius.com/6b25ad51eed6c2fabb94a09773ba6ca1.700x700x1.jpg", "lyrics": "[Intro: Samples]\n“Yeah boy!” - Sample from Flavor Flav\n“I know you gonna dig this - Sample from Car Wash (1976)\n“Pump up the volume - Sample from Rakim on Eric B. & Rakim's \"I Know You Got Soul\" (x8)\n\n[Verse 1: Kosha Dillz]\nI was a real hothead out the twin-sized bed\nMom woke me up.  Melted cheese, egg on Jewish challah bread\nSixth grade, getting paid into duels proper\nHustled five crackers at my middle school locker\nPiggybank grow fat like Diddy bankroll\n[?] and jaws that can’t blow\nSelf done changed.  Fascinated by the game, I bugged out\nThey raised twenty-five cent prices for my video games\nMortal Kombat.  Time for no contract\nBack to the Future—no one told McFly, but where my moms at?\n[?], face shining\nDrug-addicted, no label would sign me\nWe grew up three sons.  I was the youngest\nMost talented, dumbest, stuffed my face\nWith garlic peanut hummus.  The hardest lesson learned\nWhile my varsity sports team that never succeeded\n\n[Hook: C-Rayz Walz and (Kosha Dillz)]\nMy rhymes ain’t good?  My rhymes misunderstood?\n(Pardon me again, dog), ‘cause that’s my childhood\n(We grew up playing, running bases)\nTen years later, I was on the streets, running with baseheads\nMy rhymes ain’t good?  My rhymes misunderstood?\n(Pardon me again, dog), ‘cause that’s my childhood\n(Always kept my mouth shut), thought I was about bucks\n(My pops put the house up).  He said:\n\n[Verse 2: C-Rayz Walz]\nScruff-faced for life, enveloped cheap talk out the side of his mouth\nDue to the [science, god pressed it?] but had the appetite for extra cheese\nNo justice.  Just iced and freezing\nSolidifying steeze at thirty-two degrees\nPast twenty-five and black?  You a funny guy\nAnd rap will get you clapped like crack money stacks\nHigh in the lab.  How can you relate to, uh, soon as this drop, yo\nI will stop eating tuna fish and tacos, waffles and falafels\nIs there more in store in the floors and storage?\nSerial numbers all scratched off the porridge\nSuper-Bowl-smashed your helmet after good hits\nI’m a ghetto lighter.  If I’m losing you, I’ll show you hood flicks\nI could be raking the dough, but I’m leaving where it falls\nMy concentration’s on flow and that’s war, that’s raw\nBlack pain stain my face, drape like tatted tears.  I\nRough the beat up in revenge of my battle here to see justice\n\n[Hook (Overlapped with Matisyahu Adlibs): C-Rayz Walz and (Kosha Dillz)]\nMy rhymes ain’t good?  My rhymes misunderstood?\n(Pardon me again, dog), ‘cause that’s my childhood\n(We grew up playing, running bases)\nTen years later, I was on the streets, running with baseheads\nMy rhymes ain’t good?  My rhymes misunderstood?\n(Pardon me again, dog), ‘cause that’s my childhood\n(Always kept my mouth shut), thought I was about bucks\n(My pops put the house up).  He said:\n\n[Verse 3: Matisyahu]\nUsed to be me in my room with no DJ, eh\nJust a PA and a pair of JBL speakers\nIn the attic of my parents’ house.  Not a mouse was heard\n1 PM in the afternoon, trying to\nSuck some resin from the pipe before pops gets home\nPut my lips to the mic when the king got\nHis power from a ground amplifier, no\nEarplugs and I’d beatbox in the shower for song\nWe reverberation, just trying to make it back from a long vacation\nStill trying to find my way home, but, all along, I knew\nI was never alone.  No, you’re never alone\nSmoking all that weed’ll make a man-a jump sound, stereo\nWe used to mix our Frosted Flakes with Cheerios\nLSD, Ecstasy, slice through reality\nOnly seventeen, trying to find my queen\nI never developed a center, so my heart’s empty\nSleeping in the rain just to feel something\nYoung bucks never think that they’ll damage their brain\nI was roaming through your world, looking for some milk and honey\nAnd still am.  Some think that life is just funny and some\nJust stare at the Sun ‘til they can’t see me\nI’ll stick to my guns and do what we’ve always done\nWhether burned in the oven or lost at sea completely\n\n[Hook (Overlapped with Matisyahu Adlibs): C-Rayz Walz and (Kosha Dillz)]\nMy rhymes ain’t good?  My rhymes misunderstood?\n(Pardon me again, dog), ‘cause that’s my childhood\n(We grew up playing, running bases)\nTen years later, I was on the streets, running with baseheads\nMy rhymes ain’t good?  My rhymes misunderstood?\n(Pardon me again, dog), ‘cause that’s my childhood\n(Always kept my mouth shut), thought I was about bucks\n(My pops put the house up).  He said:\n\n[Outro (Overlapped with Matisyahu Adlibs): Matisyahu]\nYeah.  C-Rayz, Kosher Dillz, Matisyahu.  [?]"}]}