{"artist": "Big Boi", "songs": [{"lyrics": "[Intro: Big Boi +Killer Mike]\nYeah\nATLiens style on y'all ass\n(Do or die, Aquemini)\n(Killer Mike-Roc-A-Fella collaboration—holla!)\n\n[Chorus: JAY-Z +Big Boi]\nYoung Hov' in the place to be\nBig Boi in the place to be (Young!)\nAndré 3000 (Cash!) Shout out to public housing, bitch\nI brought (Holla!) the whole hood with me\nYou got red dirt in your afro\nYoung Hov' in the place to be (Yeah)\nOutKast in the place to be (Yeah)\n\n[Verse 1: Big Boi]\nDid you ever think that you would be the nigga on the block?\nDidn't have to break a steerin column, didn't have to cook a rock\nA damn goodie two-shoes, that what they call ya\nNever judge a person or a book by it's covers\nJust because my tone is darker than yours, a little tanner\nYou never took the time out, examine yourself boi\n.. are you black, white, Asian?\nIndonesian, or Borean; that's black and Korean\nWe on the same team if we breathin\nI jumped off the subject to see if you was seein\nThat we drop a little science off in every verse\nThey put that P.A. sticker on it cause they scared we gon' curse\nBut the knowledge is the power, the cowards get devoured\nAny hour, any cipher, any way to any height\nBecause I might just snap on a fuck-ass nigga\nMight clap a cap at a sucka-ass nigga\nIn the meantime, Daddy Fat Sax gon' chill out\nHe might just, pull out his pistol\nAnd let that thang whistle at your windshield or your residence\nSuperman to Clark Kent, you better be way harder\nThan the park bench to start this\nMarcus, Jason, my little brother James\nAll my brothers from my momma but Andre is just the same\nAin't no uno, we a duo; deuce dos to a pair\nA player stiffen the competition\nPressed like Levi's and tough skins, one minus one\nNegative one minus negative one is nothin\nBustin d-boy raps and player poems\nThe 'Kast shit ain't plastic, we smash it and move the crowd\nAnd rock the crowd original material while you bore 'em\nYour live show consists of everybody's shit but you're-uns\nDo your own shit! In your live show (Bitin'-ass nigga)\n\n[Chorus: JAY-Z]\nYoung Hov' in the place to be\nBig Boi in the place to be (Young!)\nAndré 3000 (Cash) shout out to public housing, bitch!\nI brought (Holla!) the whole hood with me (Yeah, yeah)\n\nYoung Hov' in the place to be\nBig Boi in the place to be (Young!)\nAndré 3000 (Cash) shout out to public housing, bitch!\nI brought (Holla!) the whole hood with me (Yeah, yeah)\n\n[Verse 2: Big Boi]\nPenelope Ann Cruz couldn't snooze\nWith her Eyes Wide Shut, before I asked to hit her gut\nIf you brunette, Legally Blonde I might respond\nTake you to Swan Lake and beyond\nAntwan raps on, raps on, clap off clap on\nI switch the flow so quick you cannot fa-thom\nI take a submarine two thousand leagues below the sea\nAnd try to grab one line or sentence\nRhyme repentance, find the illest lyricist\nAnd give him a clean bill of health\nWealth might make you look good but you sound like shit\nAnd your team lookin shitty to death\n\n[Verse 3: Killer Mike]\nMy nigga Big Boi said, watch 'em as they gawk and they gander\nYou can follow or lead like Commander Picard\nYou can have \"The Whole World\"\nOr be satisfied with the boulevard, overstand\nThis young player's rhyme\nI foregoed the crime and I focused on rhyme\nFocused on every word, and line\nLike a young Cassius Clay in his prime\nI was born to talk shit and prove mine, and I'm\nThe epitome of raw rhyme\nGot signed, got serious about the craft\nOf raw rhyme and I got mine—Aqueminis\nMurderous monster move minds\nDid it so hard that it oughta be a crime\nWhen you see I'm comin holla one-time, holla one-time\nWhen you see I'm comin holla one-time (One-time)\n\n[Chorus: JAY-Z]\nYoung Hov' in the place to be\nBig Boi in the place to be (Young!)\nAndré 3000 (Cash) shout out to public housing, bitch!\nI brought (Holla!) the whole hood with me (Yeah, yeah)\n\nYoung Hov' in the place to be\nBig Boi in the place to be (Young!)\nAndré 3000 ('Kast) shout out to public housing, bitch!\nI brought (Holla!) the whole hood with me (Yeah, yeah)\n\n[Interlude]\nDon't, you, like, to groove\nIn your hooptie on your old, flip, flop, sweatshoes\nTo run yo' tennis shoes\nDon't, it, matter to you\nThat OutKast we got that slump for y'all\nKeep that funk for y'all\n\n[Verse 4: JAY-Z]\nWhen I'm in the mood I rock the S Dot tennis shoes\nAt the interlude, I got the Gucci flip-flops\nAnd I, fix it up like gin and juice when I'm in them interviews\nDudes wanna know what he copped\nAnd where you got that, and how could they buy that\nWhere the million dollar watch at, stop that!\nWhy that, why this, niggas wanna hijack the flyness\nI'm on a whole 'nother plane\nA whole different lane, a whole 'nother game that I'm playin'\nUnderstand what I'm sayin'\nHov' and OutKast, whatchu think about that?\nReally don't matter though what you niggas chatter though\nAnybody get out of line then you trust\nThat the MAC'll go b-r-r-r-r-ap, got you killed for that alone\nBack on the shit, back on the strip\nAnother hit, I'm not gon' miss\n\n[Interlude]\nDon't, you, like, to groove\nIn your hooptie on your old, flip, flop, sweatshoes\nTo run yo' tennis shoes\nDon't, it, matter to you\nThat OutKast we got that skunk for y'all\nKeep that pump for y'all", "image": "https://images.genius.com/547d6239cd014bda1acb0078d0ddaafc.999x999x1.jpg", "year": "2003-09-23", "title": "Flip Flop Rock", "album": "Speakerboxxx"}]}