{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": "2004-11-16", "lyrics": "[Intro]\nThey used to call me Bobo\nR.A\nHe's rugged\nAlright friends, on your feebles\n\n[Verse 1]\nYo, see how they go, hip hop R.A., hey oh\nI'm a special ED student, with an A+ flow\nUsed to call me Bobo, Busby Berkeley\nBronson, Paul Kersey, Disco Derby\nI'm a modern day Ozzy Osbourne\nBiting bats heads off and busting nuts in your popcorn\nWonderingg how this ugly motherfucker got on?\nThe whole white trash nation, rock rock on\nNow wait a minute, let's bring it back a little bit\nWhen you first started rapping, you was all on my dick\nYeah, you went multiplatinum, but you bit my shit\nWhat you rapping is my life, you ain't live that shit\nSee all the others say I'm twisted, and I'm over the edge\nAnd my whole crew they say is all sick in they heads\nSledgehammer, break pay phones, still calling\nStay out the trouble, stay home, Rugged Man, J-Zone\n\n[Hook]\nHere we come from Suffolk County and you might not heard about me but we poor\n(It's time for a showdown, between you and I)\nYou might not wanna be about me cause the shit bout to get rowdy cause we brawl\n(If we gonna do war, fuck 'em up fat)\nHere we come from Suffolk County and you might not heard about me but we poor\n(Come on sucker, let's get on)\nYou might not wanna be about me cause the shit bout to get rowdy cause we brawl\n(Good thing you're looking for trouble, cause we're gonna give it to you)\n\n[Verse 2]\nThe way we recreate shit, Rugged Man\nWe don't make hits, we stay broke, sleep, fuck sluts and take shits (Uh-Uh)\nAnd roll with the real life whores that appreciate dicks\nFuck they asshole, dick full of shit, taste bitch\nIt's easy to criticize me for being so foul\nIt's worse when you looking down a shotgun barrell (BANG!)\nThey say, \"Rugged Man, he can't keep no deal\"\nIt's mental, I like the way being broke feel\nI'm at the homeless shelter, finagling free meals\nI'm like Buster Keaton and W.C. Fields\nI'mma die broke, no success\nWhen I'll, die I'll be choked up, jerking off like INXS\nNow wait, this is the place where stars are born\nStrictly business, too potholes in my lawn\nUzi weighs a ton, public enemy number one\nDon't you dare sleep on the spot that we come from\n\n[Hook]\n\n[Verse 3]\nYeah, it's true motherfuckers, I'm alive and shit\nThe mainstream motherfuckers, trying to hide my shit\nYou hear your man's rap flow? I invented that shit\nYou see his whole stage show? I invented that shit\nThey say I could have been, but I never been\nThat's bullshit, I'm a underground rap veteran\nI'm like get-get-get-get, get off my dick\nI'm the wrong kid you don't wanna fuck with\nCall me Big Dog, Mr. Crustified Dibbs\nWhen I think to all the devious things I did\nThis is a hold up, get your asshole to' up\nBitch drink cum, when this fat fuck roll up\nYeah, six million ways to die, choose one\nTrue hood one, two tons, I'm the sequel\nFuck Mandingo, you can call me Drum\nStupid dumb, Long Island hoodlum\n\n[Hook]\n\n[Outro]\nR.A\nHe's, he's rugged\nFuck 'em up fat", "title": "Brawl", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}