{"artist": "Fabolous", "songs": [{"year": "2013-12-25", "album": "The Soul Tape 3", "image": "https://images.genius.com/49e177394dae5f943f3fa2f702c358b8.500x500x1.jpg", "lyrics": "[Intro]\nThough we gotta say goodbye for the summer\nBaby, I promise you this\nI'll send you all my love everyday in a letter\nSealed with a kiss\n\n[Chorus: King Chip]\nThese hoes keep calling, I ain't picking up (yeah)\nThese hoes keep calling, I ain't picking up (yeah)\nTold these hoes I'll be back around June (around June)\nTold these hoes I'll be back around June (WHAT?!)\nBetter yet I'll change my numbers for the whole winter (who?)\nDamn, it's so cold in the fucking winter (whooo)\nThese hoes keep calling, I ain't picking up (what)\nDamn, I'm so cold in the fucking winter (yeah)\n\n[Verse 1: Fabolous]\nYou was in La Marina all summer (every Sunday)\nYou was up in Toxic all summer (turn up)\nNow it's getting chilly, that's the fall coming (wooo!)\nNow a nigga get a call from her\nWhat's up? How you been? How was summer? Hotter then\nI'm like some bitch stringing me along like a violin (dumb bitch)\nShe was too busy hosting, on Instagram posting\nHashtag #nofilter AKA #hofilter\nWith the innocent face, but she so guilty (she did it)\nNow I'm a take her in like a ho shelter (whaaat)\nWhen there's a few niggas that I know killed her (whaaat)\n4 Celtics, Knicks guard, you know Felton\nThis nigga in Atlanta Airtran her, no Delta (haha)\nBeen naughty all year trying to end it nicely (niiice)\nSummer hoes turning into winter wifeys\n\n[Chorus: King Chip]\nThese hoes keep calling, I ain't picking up (yeah)\nThese hoes keep calling, I ain't picking up (yeah)\nTold these hoes I'll be back around June (around June)\nTold these hoes I'll be back around June (WHAT?!)\nBetter yet I'll change my numbers for the whole winter (who?)\nDamn, it's so cold in the fucking winter (whooo)\nThese hoes keep calling, I ain't picking up (what)\nDamn, I'm so cold in the fucking winter (yeah)\n\n[Verse 2: Fabolous]\nYou was in club Liv every Sunday, you was in KoD every Monday\nJust like Lil Wayne said: Liv on Sundays, King of Diamonds Monday\nOh, you been working out? (Word?) You think I'm dumb or what?\nI know how a winter gut turn into a summer butt\nShe bartend, he paid for the shots (for the shots)\nBudweiser Limearita for the thots (for the thots?)\nHard dick and bazooka, maybe a little hookah\nShe thinking Philippe, I'm think Chipotle (yeah)\nI heard bitches commit  cyns(sins) for Chipotle\nEvery rapper in a cypher, every player in a huddle (whoa)\nYou really wanna fuck, but you say you want to cuddle (whoa)\nYou posting like you balling, but you really in a struggle (yeah)\nYour captions be deep, but you shallow as a puddle\nTurn down for what?\n\n[Chorus: King Chip]\nThese hoes keep calling, I ain't picking up (yeah)\nThese hoes keep calling, I ain't picking up (yeah)\nTold these hoes I'll be back around June (around June)\nTold these hoes I'll be back around June (WHAT?!)\nBetter yet I'll change my numbers for the whole winter (who?)\nDamn, it's so cold in the fucking winter (whooo)\nThese hoes keep calling, I ain't picking up (what)\nDamn, I'm so cold in the fucking winter (yeah)", "title": "Cuffin Season"}]}