{"songs": [{"year": "2012-03-05", "image": "https://images.genius.com/c827d7823eca2625dae750eca362369f.320x320x1.jpg", "title": "Handwriting", "album": "4eva N a Day", "lyrics": "[Intro:]\n(Handwriting's on the wall)\nYeah, it's on the wall\nI'mma keep drinking til they toss me out this motherfucker man\n\n[Verse 1]\nExcuse my tone of voice but today was just a bad day\nLabel hit me about another single and said I ain't had play\nSince Country Shit, hell they thought that was a regional record anyway\nBut thank God for Bun B and Ludacris because they had faith\nThat shit would take off and it did, guess I was too country to quit\nI make albums not hits, these rich folks don't know about this\nBut that's cool, I'm back to that K.R.I.T. Wuz Here\nPray to God this was meant for me, a king to be\nHoping my time was near\nMaybe I'm rapping in vain, maybe this wasn't my lane\nMaybe I'm hurting myself, talking 'bout real life instead of the fame\nHow can I change? Shawty I swear I think I'm wasting time\nOn the phone with my pops like, \"I just wanna save some lives\"\nI just wanna do some right with the wrongs I was dealt\nMy pride might be my downfall, but I ain't asking for help\nI wear my heart on my sleeve, don't run into me cause it bleeds\nNo disrespect to your craft, but I make my own beats\nShit the handwriting..\n\n[Interlude 1:]\n(The handwriting's on the wall...)\nMan the Hennessy do something to a nigga man sometimes that shit...\nI just can't hold back, you feel me?\n\n[Verse 2]\nFirst quarter got me like boiling water with soda in it\nDrop my project in the pot watch it lock up like those in prison\nGotta prove these people wrong that don't see the vision\nThree nominations, number one on 106, hell I forgot to mention\nTwo free albums minus label support\nFired my publicist cause I forgot what I was paying him for\nDrunk til I'm barely conscious, call Jonny tell him put Sha on 3-way immediately\nCause I'm sick of being lied to and I'm waging war\nThen I'm going back to Sippi-land and I'm quitting rap\nAin't that bad cause when I was poor, hell I was fairly happy\nDealing with the critics and the comments got me trippin'\nLike my accent and my tone make it really hard to listen\nI was scarred but I was driven before the politics came\nLynching rappers and dropping albums, and watching 'em hang\nI pushed mine back with fear that they might just do me the same\nCause I rebel I might get shelved, but that's part of the game\nHell, the handwriting...\n\n[Interlude 2:]\n(The handwriting's on the wall...)\nGoddamn right it's on the wall\nI take this shit seriously man\nThis is my life, this all I've ever known\nThis all I'll ever do and I promise to God I won't let nobody take it from me\n\n[Verse 3]\nI did it for all of mine and all of yours\nTen toes deep in the game I'm in\nI'm bound to lose if I'm living in sin\nIf I play to win will I make it out?\nI'm tired of feeling my heart Lord I just wanna scrape it out\nThis the road less traveled, shit I just gotta stay the route\nI hear the hate and all the betrayal I just gotta phase it out\nWith another shot, better chase it down with a glass of Crown\nPut that on my tab, yeah I'm doing bad\nCuz music's all I've ever known, shit, all I've ever had\nTryna say something, tryna do something, tryna be better\nAin't much time left, I gotta make do, I can't live forever\nAin't that what makes me me? No smoke and no mirrors\nAnd I don't even wear Loc's, so they can see me clear\nAnd you can say that I'm bitter but tell me if I'm trippin'\nThey stick their noses up and talk down on Mississippi\nImagine how you'd feel to know you work hard, and you educated\nAnd they treat you like you never made it\nThe handwriting...\n\n[Outro:]\n(The handwriting's on the wall, final curtain's about to fall\nJust ain't no feelings left at all, the handwriting, handwriting's on the wall)"}], "artist": "Big K.R.I.T."}