{"songs": [{"title": "The IV", "image": "https://images.genius.com/ec5d1855836657508c02c9103758522f.640x640x1.jpg", "lyrics": "[Intro: Braille (Cuts)]\n\nYeah, so, uh, we got this thing here, uh.... (The IV) Yeah, yeah! Braille Brissik in the place! Like this!\n\n[Hook 1]\nThe IV! Defines my name! Know'msayin? Yeah! Yo, man, what is it? The IV, wha-wha-what defines my name\n\n[Verse 1]\nLyricism don’t sell no more, that’s what they say but I just ignore it, I won’t forfeit, I push forward, the fourth record, this is a force to be reckoned with, I’m like a wrecking ball tearing down the wall, kick open the door when I step to the bass drum, passion in my lungs, spit till my face is numb, worldwide, but I’ll never forget where I came from, I’m going long-distance with short circuits, I’ll leave behind more money for more purpose, have you ever heard an emcee like this? I tell it how I see it like an eyewitness, then I broadcast all the true facts, 12 years in the game, walking a narrow path, climbing uphill, this is dedication, constant elevation, bringing the medication\n\n[Hook 2]\nYo! The IV! As far as rap, I-I-I-I-V, what defines my name?\n\n[Verse 2]\nYou didn’t know you could be the IV did you? The solution to the social issues is you, it’s me too, if you have the ability to respond, then it’s your responsibility, excuses are useless, the truth is it takes more than music to bring forth improvement to this, jungles of concrete, the streets are John Blaze, the beats rotate on plates, I speak faith, over the most hopeless circumstances, advance with perseverance and stay focused, take notice, the tapes rolling, smile for the camera, high caliber, mark your calendar\n\n[Chrous 2]\n\n[Verse 3]\nRevolutionary lyricism, flowing poetic, the dialect you’d expect from my genetic inheritance, confidence and arrogance are opposites, I’m offering concoctions of hotness, rescue the hostage, hostile with hot styles in piles and piles, travel many miles to arrive right here, and survive through the torture and treachery, I battle principalities with spiritual weaponry, my technique, pose threats like four techs, I blow sets, explosive, I’m on deck, it’s code red, I touch your brain through your forehead with forceps, squeeze minds instead of triggers, I’m on a mission, fully automatic, with phonographic static, opponents mad at it, take them out like bad habits, savage on tracks with milliliters of spit that blast faster than gats or millimeters with clips, you feel the beat when it hits cause Marco Polo did it, my only limit is the flesh but my soul's infinite, eternal life and internal peace, I was infected with sin but I found the IV", "year": null, "album": "The IV Edition"}], "artist": "Braille"}