{"artist": "G-Eazy", "songs": [{"title": "Last Night", "album": null, "year": "2014-01-23", "image": "https://images.rapgenius.com/16417df55e49191ce7884177a67b784e.600x600x1.png", "lyrics": "[Verse 1: Kyle]\nFruit snacks and cups of Patron, parties on buses with hoes\nMe and my bros on a mission\nTo leave with your riches, your bitches, and even they clothes\nYeah, I don't know, probably give it to charity or somethin'\nEvery girl nowadays wanna marry me or somethin'\nHate that shit, all I needed was a pic\nBut yo ass always sendin' me a narrative or somethin'\nNaked pic of tits bitch, I ain't even knowin' it\nBoyfriends hate me and I ain't even noticin'\nLemme tie a girl down, I ain't never roll with them\nHella blunts heavy but I'm second hand smoking them\nReally real, it's me and Gerald, tell all those lame niggas hide their girls\nGoing dumb 'till I'm numb, couldn't even tell your ass how this feels\nTrying to write a rap when you're drunk is a skill though\nBottles and bars and they're both being killed though\nTrying to talk to these bitches is hard\nCause I sound like Boomhauer from King of the Hill though\nGirls do wanna come, wanna stay\nSex and Super Smash Bros, hoes wanna play\nTruly fuckin' hard and I wasn't trying to party\nBut ah fuck it, okay, turn up!\n\n[Chorus: Devon Baldwin]\nI don't know why I get so high\nWake up tomorrow and my whole day has gone by\nDoing what the fuck I feel like\nWill someone tell me is this real life?\nLast night was a movie\nI swear last night was a movie\nI swear last night was a movie\nI swear last night was a movie\n\n[Verse 2: G-Eazy]\n'Kay, last night was cinematic\nI'm a women addict, it's been established\nShe pulled my shirt then ripped the fabric\nWoke up shirtless, just in a jacket\nRoll a spliff of cabbage\nI'm living lavish, you're living average\nThis isn't new man, I've been a savage\nRolled every swisher that's in the package\nYeah, I'm just young and blessed\nPass that trash, I'm unimpressed\nThese hoes get kicked out, that's sudden death\nI'm on one, probably could've hung with Hunter S\nNow I'm gonezo, cross-faded\nTook another shot, should have waited\nWhen tomorrow comes, I'mma hate it\nUp until then I'mma make it\nMy mind is so gone, rollin' up more trying to get in my zone\nFuck goin' out man I'm all good at home\n'Bout to call an old girl I know I can bone\n\n[Chorus]\nI don't know why I get so high\nWake up tomorrow and my whole day has gone by\nDoing what the fuck I feel like\nWill someone tell me is this real life?\nLast night was a movie\nI swear last night was a movie\nI swear last night was a movie\nI swear last night was a movie\n\n\n[Bridge: G-Eazy]\nSo faded, so high\nSo faded, so high\nIf I do some more I'll pass out on the floor like I'm waving goodbye\nSo faded, so high\nSo faded, so high\nEvery night on tour we all do drugs galore\nMan I stay in the sky\n\n[Chorus]\nI don't know why I get so high\nWake up tomorrow and my whole day has gone by\nDoing what the fuck I feel like\nWill someone tell me is this real life?\nLast night was a movie\nI swear last night was a movie\nI swear last night was a movie\nI swear last night was a movie"}]}