{"artist": "C-Bo", "songs": [{"title": "Forever Thuggin", "album": "Enemy of the State", "year": "2000-07-11", "image": "https://images.genius.com/1022971e425e0540a354e0df5b13ef9c.500x483x1.jpg", "lyrics": "[Chorus feat. 𝐷𝑜𝑡𝑡𝑦]\n𝐴𝑙𝑙 𝐼 𝑒𝑣𝑒𝑟 𝑤𝑎𝑛𝑡𝑒𝑑 𝑤𝑎𝑠 𝑡𝑜 𝑏𝑒 𝑎 𝑡ℎ𝑢𝑔 𝑎𝑛𝑑 ℎ𝑢𝑠𝑡𝑙𝑖𝑛 𝑤𝑎𝑠 𝑎𝑙𝑙 𝐼 𝑘𝑛𝑒𝑤\nForever thuggin! Forever thuggin!\n𝐴𝑙𝑙 𝐼 𝑒𝑣𝑒𝑟 𝑤𝑎𝑛𝑡𝑒𝑑 𝑤𝑎𝑠 𝑡𝑜 𝑏𝑒 𝑎 𝑡ℎ𝑢𝑔 𝑎𝑛𝑑 ℎ𝑢𝑠𝑡𝑙𝑖𝑛 𝑤𝑎𝑠 𝑎𝑙𝑙 𝐼 𝑘𝑛𝑒𝑤\nForever thuggin! Forever thuggin!\n\nForvever thuggin I keep my mind focus and risin above skies\nThug til i die slang drugs til I rise\nWill I ever fly or will I die from a drive by\nWitness my victims writhe til they die\nDear LORD will you ever forgive a nigga's sin\nCause I stay surrounded with trigger men\nAnd it's on until they kill again\nI'm in the finest clothes, fucking the finest clothes, pushing the finest loads\nI'm a thug by nature they got these motherfucking fists hitting a nigga on his pager\nThey got me trapped in Seattle sleepness, tryna blame me for my homie's death\nI'll make you muthafuckas reap this\nAnd any niggas want to ride on me\nStep forth and you could die on me\nBullets fly like the fourth of July torches in the sky\nWatching [?] die, forever thuggin!\n\n[Chorus]\n\nYou niggas wanna see me fall off, get caught up and get hauled off\nBecome a victim of a sawed off\nLife's been full of trifes in ways but soon I see better days\nPassing my pistol away with better ways\nStay away from all this madness, and all these suckers lookin at me evil wishing that they had this\nGiven through traffic something new\nProtected by bullet proof close my eyes hoping that is true\nThankin the LORD for all the stress he put me through\nTeaching me right from wrong don't want to spend life from home\nHoping that I wasn't wrong for slinging ki's, bringing home g's\nCause in the water it's so hard to breath\nBless the LORD for my baby girl, gotta get her ready for this crazy world\nAin't nuthin worser than a lazy girl gotta get your mind right\nFirst and learn to love school and believe in everything you do Forever thuggin!\n\n[Chorus]\n\nIt's g's up hoes down though they slang kilos and pounds\nStay flossin the whole town navigators with the tv's in em\nCan't believe it when you see me in em with the six changer dvd in em\nStraight up out the gardens, lowlife ass nigga\nSince day one always been a trife ass nigga\nAnd ain't none changed but the change\n4.6 range blew our brains, phat house on the hills\nNow they callin me C-boss because I be playing with about six mills\nSince my deal with warlock fuck some pork chops\nTaking Lobsters tossing wine glasses with the mobsters\nOff-shore bank accounts, swiss have a nigga piss\nDam can you imagine this thug nigga wit mo money than\nThat uhh nigga and that mexican border brotha wit a plug nigga\nI'm flooded nigga, Dom P, Cristal\nBudded nigga, beenie cap, pistal\nThuggin nigga, killafornia, cap it out\nWithout direction, muthafuckas best to map it out\nStraight gangsta baby don't get it twisted\nDubs on my sports car, everything owed is lifted\nAnd this fast stack I'm holdin ain't foldin all\nBig face swollen, bitch I'm west rollin\n\n[Chorus]"}]}