{"artist": "C-Rayz Walz", "songs": [{"title": "Rhyming Hood", "album": "The Dropping: Colonic Progression", "year": "2006-12-09", "image": "https://images.genius.com/6b25ad51eed6c2fabb94a09773ba6ca1.700x700x1.jpg", "lyrics": "C-Rayz Walz ft. Money Carson, Gino Green, and Kon Yak - “Rhyming Hood”\n[Emcee(s): Money Carson, C-Rayz Walz, Gino Green, and Kon Yak]\n[Producer(s): 4ourCee]\n\n[Intro: Money Carson and (C-Rayz Walz)]\nYeah, yeah, yeah, yeah, yeah.  Money Man, C-Rayz, Yak, and the Green.  (They have arrived) Straight off the Lincoln Tunnel.  (The fame) Live and in the flesh (Give me your wallet).  Pause that.  Uh, yeah (Yo, yo, yo, Rhyming Hood)\n\n[Verse 1: Money Carson and C-Rayz Walz]\n[Money Carson]\nMy inner thoughts like\nConstant, one of the best, bullseye\nType of archer—partner, one to your chest\nMoney puffing the Lucy.  I’m into loot, see\nCamelot canned in tree ash and taxes\nRob from the rich, style feeding my team\n[C-Rayz Walz]\nI seen God from the cliff while breathing the green\nIn the rainforest, I train hardest.  Untame artist\nFire-breathing madman with a plan to flame markets\nAs I stick up scripts, this is a Stone Hedge mage\nConstructing the category of chaos on page\n[Money Carson]\nI jumpstart the rage.  Therefore, whatever you’re here for\nWe could flare force for the God and state\nUp the NY, test mine\n[C-Rayz Walz]\nI’ll scar your face\nGuard your plate, lacerate garden snakes\nScalping your wig.  Rotten Apple out the mouth of the pig\nPlot and tackle.  Yeah, you know what it is\nRhyming Hood\n\n[Hook: Money Carson and C-Rayz Walz]\n[Money Carson]\nWe’re\nPursuing jewels, woke the wolves\nIn a hood where you get forced to fall, we\nRise up\n[C-Rayz Walz]\n‘Cause sleep is the cousin of stupid\nPut your life on a track and loop it.  Rhyming Hoods\n[Money Carson]\nWe’re\nPursuing jewels, woke the wolves\nIn a hood where you get forced to fall, we\nRise up\n[C-Rayz Walz]\n‘Cause sleep is the cousin of stupid\nPut your life on a track and loop it\n\n[Verse 2: Gino Green and Kon Yak]\n[Gino Green]\nYo\nI’m taxing four hundred off of your brick.  This is mili-\n-tary black shot, extortioner shit.  I’ll take you for thirty\nThou and a brown bag.  While we’re talking, you’re six\nOur six larceners.  Bitches aren’t tricks.  Organize and\nNavigate numerous licks.  Hoes, barbeques, and\nBuffets and the bricks.  I’ll stick dice games and wrap the prize\nMoney for young mothers all week, flash the semi\nFor the chain with the heaviest drip (Kill, drip)\n[Kon Yak]\nThe boy ready with a clip of them arrows\nFitted Timbs and black tees, circle apparel\nIt’s really nothing.  Yak bad to the marrow\nI’m a steady jewel dropper.  Keep your eyes on the barrel\nAnd J-Zone here to bring the paper home\n[?] like the Lakers zone\nFlow is splendid.  Whip, yeah, I rimmed it\nBut still in the jungle with more green intended\n\n[Hook: Money Carson and C-Rayz Walz]\n[Money Carson]\nWe’re\nPursuing jewels, woke the wolves\nIn a hood where you get forced to fall, we\nRise up\n[C-Rayz Walz]\n‘Cause sleep is the cousin of stupid\nPut your life on a track and loop it.  Rhyming Hoods\n[Money Carson]\nWe’re\nPursuing jewels, woke the wolves\nIn a hood where you get forced to fall, we\nRise up\n[C-Rayz Walz]\n‘Cause sleep is the cousin of stupid\nPut your life on a track and loop it\n\n[Verse 3: Money Carson, Kon Yak, Gino Green, and C-Rayz Walz]\n[Money Carson]\nI’ll rep\nHostile, live life running the ash\nThe kid spot you.  Gossip, one in the head\nNowadays, women run to the Feds and I’ma come deep\nIn it for the money alone like J-Lo be\n[Kon Yak]\nTap Yak two-way—page can’t fold me\nRats had AKs like they [?]\nThat cat want to act and now he’s sorry\nDog, that’s the end of the story (True story)\n[Gino Green]\nI touch\nAthletes and rappers when it come to Saint Nick\nAnd kick back with trap money.  Hoes get at they pimp\nNo chorus, paying for it quick.  I got Wayne Perry\nListen if you getting it kid (This is it)\n[C-Rayz Walz]\nPhlegm from the dungeon, automatic static from attics\nCats [?] when I [?] apart shells, magic\nThis is hell’s fabric, the spell graphic.  We sell\nCaskets.  Don’t make us snatch your baskets, faggots\n\n[Hook: Money Carson and C-Rayz Walz]\n[Money Carson]\nWe’re\nPursuing jewels, woke the wolves\nIn a hood where you get forced to fall, we\nRise up\n[C-Rayz Walz]\n‘Cause sleep is the cousin of stupid\nPut your life on a track and loop it.  Rhyming Hoods\n[Money Carson]\nWe’re\nPursuing jewels, woke the wolves\nIn a hood where you get forced to fall, we\nRise up\n[C-Rayz Walz]\n‘Cause sleep is the cousin of stupid\nPut your life on a track and loop it\n\n[Outro: C-Rayz Walz and (Gino Green)]\nMoney Car, C-Rayz Walz, the boy Kon Yak, ([?]) Money Green, Gino Green Money.  Belief on the [?].  Chopping your face, it off.  Fathers with [?].  [?].  Time is good.  Rhyming Hood"}]}