{"artist": "Ace Hood", "songs": [{"title": "Picture Me Rollin", "album": "Ace Won’t Fold", "year": null, "lyrics": "Gutta understand that boss\nIt's me again\nThis time I'm in my flyest shit, nigga\nIf yee ain't think I'm going to the top\nSpeak to that huh\nPicture me rollin in that new 600\nWith the big rims on it, gettin blunted counting money\nAntother day in my side, I'm living the star life\nPicture me strollin that louis bag and fresh nikes\nAnd many nights I pray right, that sleep tight\nWith many vision I'm now living that lime lite\nThey could'ntpicture me dead and preaching that man christ\nLord watch over the kid and let me say it twice\nAs I'm becoming the man walk me through life\nI give a damn about a hater that can die twice\nI put it on my only mom who provide life\nFor the youngin promise I'm a see a meal twice\nPicture me rollin in a deep sea ocean\nA yacht keep floatin, imagine me coastin\nI'm on the top with a free?\nDrinking H's face giving thanks for the potion\nLinen suits, swade shoes and I'm focused\nIt's one motion I'm filled with emotion\nPicture me roll with the best in the business\nDef jam tag just to add to the vision\nI give thanks all praise to the man\nWho in hand given hand, he the best with decisions\nDon't get it twisted the mind frame gifted\nShow me watu got like it's hoovers invention\nPicture me rollin I'm in the city vibin\nA dark boys hidin' my eyes through the violence\nI'm in a whip with'a b*tch from the islands\nThat 2Pac bang as I lead I'm a ride\nPicture me rollin if you can't just imagine a 22 C just creep on a wagon\nI'm ace hood I'm just trynna live lavish\nStraight from the hood were the blocks be savage\nI here 'em talking, I'm just tryna get cabage\nTrynna put moms in a crib wita passion\nIt's gon happen the mind is the focus\nIt's one motion, I'm filled with emotion\nPitcure me rollin\nYeah rollin, str8 the top\nPicture me rollin, Ace Hood\nMr Makalister\nPicture me rollin'\nGutta!\n305 You can't feel my vibe\nYou can't be were I'm at just,..\nThis what I want you to do!", "image": "https://images.genius.com/01b7a106f8f5ef0638db5b7410c71eee.500x500x1.jpg"}]}