{"artist": "Boondox", "songs": [{"album": "The Harvest", "title": "They Pray With Snakes", "year": "2006-07-11", "lyrics": "In the belly of the beast, a place thats miles away\nIn a deep southern town where the devil comes to pray\nA choir sings with their eyes sewn shut\nBy a stream the children playing, water flowing with blood\nThe pastor stands on his pulpit, while preaching of hell\nOn the hilltop church with demons ringing the bells\nThey toll twice for the missing and the recently departed\nIn the pews the congragation sits a hundred days rotted\nSuffering is all around the stench of death in the air\nNobody seems to notice or nobody seems to care\nIts just an everyday life and a normal routine\nPeople walking right by, but never notice the screams\nA backwoods philosophy passed down thru the ages generations of murder, written down in these pages\nOf a book overlooked and forgotten in history\nA place where the secret is surrounded by mystery\n\nI can hear them screaming thru the forest at night!\nThey pray with snakes. . . and they poison my mind!\nI can hear them screaming thru the forest at night!\nThey pray with snakes. . . and they poison my mind!\n\nWas it a curse or a sickness that raised in the minds\nOf these sacreligous hillbillies raised with the swine?\nNo remorse in the soul and their hearts pitch black\nThirsty for the blood hound murder contact\nFeasting on the brains of the ones they call sinners\nCousin cletus in the kitchen carving torsos for dinner\nIn a barn on a meat hook bodies are hanging\nIn a cellar by a chain more bodies are swinging!\nAnd in the fields like a scene from a no parking lot\nAbandoned for so many years cars start to rot\nAnd buried in the garden in a hole dug deep\nAll the bones and belongings all piled in a heep\nUngodly sounds of torture echo thru the trees\nThe screams of suffering still blowing in the breeze\nNot on any map undiscovered, never surveyed\nThe secrets of a small town kept locked away. . \n\nI can hear them screaming thru the forest at night!\nThey pray with snakes. . . and they poison my mind!\nI can hear them screaming thru the forest at night!\nThey pray with snakes. . . and they poison my mind!\n\n(On just about any warm afternoon you can find a weathered looking white haired man wondering the hills searching for poisonous snakes, not to kill, but to bring back with him. . . to church. . .he is a serpent handler)\n\nI can hear them screaming thru the forest at night!\nThey pray with snakes. . . and they poison my mind!\nI can hear them screaming thru the forest at night!\nThey pray with snakes. . . and they poison my mind!", "image": "https://images.genius.com/9bc5140eadd19250a34c88748f1ddafa.500x500x1.jpg"}]}