{"artist": "Post Malone", "songs": [{"album": null, "title": "Remember", "image": "https://images.genius.com/fc7e20f4fe2f7dd19a877bb5cb1677bc.937x937x1.jpg", "lyrics": "[Intro]\nAyy, ayy, ayy, woah\nAyy, ayy, ayy, woah\nMhm\n\n[Verse]\nAnd everything is all cool, until I say it's a go\nThey talking all the shit, they said that I would not reach my goals\nI kept on going for sho’, but they don't know it, I know\nShe said she wasn't with the shits, I told her to stay in the cold, ayy\nI ain’t got the time to paint the sign for you, ayy\nBut it's okay, don't wanna fight with you, ayy\nPut a couple thousand on the side for you, ayy\nHop up in the 'Rari, take a ride with you\nShit was jumping, I grabbed the shotty\nI swung my door fully open and then I close it\nThen lead the party, bitch, it coming, it keep on coming\nAnd I ain't post it, but I show it\nI let you know it, and now I own it, ooh\n\n[Pre-Chorus]\nRemember when I had a dream I pull up in the 6?\nRemember when they said Young Posty wasn't gon' be shit?\nRemember I was starving, hungry? Ain't no way to live\nShit, everything is different now\n\n[Chorus]\nWhen I step up on stage, this shit go up\nYeah, I blow a bitch brain when we show up\nYeah, bitch the whole squad on the glow up\nI remember we was nothin’, now they know us\nSeem like every damn night that we pour up\nAll these bands right now, I’ma blow 'em\nYeah, bitch the whole squad on the glow up\nI remember we was nothin’, now they know us, yeah\n\n[Instrumental Break]\n\n[Pre-Chorus]\nRemember when I had a dream I pull up in the 6?\nRemember when they said Young Posty wasn't gon' be shit?\nRemember I was starving, hungry? Ain't no way to live\nShit, everything is different now\n\n[Chorus]\nWhen I step up on stage, this shit go up\nYeah, I blow a bitch brain when we show up\nYeah, bitch the whole squad on the glow up\nI remember we was nothin’, now they know us\nSeem like every damn night that we pour up\nAll these bands right now, I'ma blow 'em\nYeah, bitch the whole squad on the glow up\nI remember we was nothin', now they know us, yeah\n\n[Outro]\nAyy, ayy, ayy, woah\nAyy, ayy, ayy, woah\nMhm", "year": null}]}