{"artist": "Porta", "songs": [{"album": "La voz de la gente vuelve a ser", "title": "Carta de sinceridad", "image": "https://images.genius.com/3c5aae49d177c8773b06cee3dc28645a.720x720x1.jpg", "lyrics": "[Verso 1: Piter-G]\n¿A ti de pequeño no te dijeron que creyeras\nQue de mayor, podrías ser quien tú quisieras?\nEstás ahí quién quiera que seas, pues dime algo...\nDime si la vida es una prueba y si no me salgo\nDeshice el avión de papel y escribí\nCada detalle que quiero cambiar por mí\nPorque ya está bien de confesar y mentir\nPorque ya está bien de suicidarme en cada canción por tí\nNo soy tan valiente como oyes en canciones\nEstoy asustado, tacho mis oraciones\nTengo miedo sin seguridad...\nHe sido el tonto de la clase, al que todos trataban mal\n¿Qué miras?, ¿qué quieres?\nLa vida me ha enseñado a ser así\nPero no pregunta si así lo prefieres...\nCuarta copa, he notado que cuando uno crece ve más cosas\nPero también se ciega más de otras...\nEn vez de vivir, lo llamaría morir\nPoco a poco con el tiempo, ¿no es así?\nProtesto señoría, tengo pruebas\nEs que hace tiempo que no tropiezo con piedras nuevas\nYa no soy el de antes, ni tampoco el que quiero ser\nViviendo el margen de soñar con un tal vez\nY vuelvo a escribirte, para meterte bulla\nPorque estoy cansado de mandarte cartas, y no recibir la tuya\nDe pequeño me dijiste que creyera\nDe mayor que cerrara los ojos, y me fuera\n¿Estás ahí quien quiera que seas?\nPues dime algo...\nDime si la vida es una prueba y sino me salgo, Vamos\n\n[Puente: Piter-G]\nDímelo, te escucharé\nAdmitiré que tengo medio pie dentro de tu puerta\nY te suplicare que la dejes abierta\n\n[Verso 2: Porta]\nY en el fondo nadie me conoce y tu tampoco lo haces\nHe tenido malos rozes por eso yo uso disfraces\nDe que coño te quejas si tu me hiciste así\nY me paraste cuando intente alejarme de ti\nMe enseñaste a desconfiar a ser valiente\nAsí que me pare a pensar un día y decidí hacerte frente\nCuenta cuantas veces me has dejado vació y ausente\nUn chico frió al que le cuenta bastante abrirse a la gente\nNo demuestra sentimientos aunque se muera de ganas\nY si fuera por él muchos días ni saldría de la cama\nVente que te lo diré a la cara\nQue tienes contra mi, yo era feliz antes de que te lo llevaras\nY ahora me levanto aparentandolo ocultando el dolor\nIntentando encontrar lo que perdí en mi interior\nY creo que me lleno de cosas solo para hacer bulto\nVivo en una cueva oculto, vida claro que te culpo\nAunque yo tampoco tengo las manos limpias del todo\nYa que tropecé y las apoye mas de una vez sobre el lodo\nEs una carga llevar este apodo\nPor suerte me diste una gran familia que nunca me deja solo y\nLa consola me consuela cuando no estas tu\nTe odio tanto y a la vez te doy mi gratitud\nLa vida pasa, estés en casa o estés un club\nY el tiempo nos meterá a todos en un ataúd\nY a ti que me ves por YouTube, ya que me escuchas\nNunca me lo puso fácil, jamás me rendí sin lucha\nMe hiciste duro y tan frágil como un diamante\nYo solo quiero que todo vuelva a ser como antes\n\n[Piter- G]\n¿Y ahora me vas a pedir que cambie?\n¿Tu cambiaras algo?\nDime si eres una prueba\nYo dicidiré si salgo o si sigo permitiendo que me uses como embargo\nTu no eres nadie pa' decirme lo poco que valgo\nDímelo, te escuchare\nAdmitiré que tengo medio pie dentro de tu puerta\nY te suplicare que la dejes abierta", "year": "2014-12-27"}]}