{"songs": [{"image": "https://images.genius.com/72443e1c5db877848399a87d8311cc59.352x408x1.png", "year": "2000-01-01", "lyrics": "[Mr. Eon (speaking as announcer)]\n\"After further review, the play stands\nFirst Down!\"\n\n[Akrobatik]\nThis is the jump off, face off, kick off and first pitch\nOpening serve or tee off, take your pick\nI'm the mailman delivering styles that I'm concocting\nWhile my man Mr. E assists like John Stockton\nI stay wilding, mad range like Ray Allen\nAnd while you rock your anthem I refuse to stay silent\nLyrics powered like a fullback, the rap Jared Bunch\nCatching opponents in the kidney with the rabbit punch\nStep up in a doubles match to E and Ack and it's over\nYou get served like an ace from Martina Navatomona\nOr Pete Sampras, this camp is very nice\nGetting deep like Joe Montana to Jerry Rice\n\n[Mr. Eon]\nI stuck up the concession stand for cracker jacks\nRhyme over hot beats, from the box seats\nEon got cleats, spike you like Ty Cobb\nStraight '89 Michigan, a tight squad\nI challenge John Daly to a drink off\nFrom illadelph with iller-force ????\nTo get some (censored) on a roller derby\nAfter me your career will end early like Bobby Hurley\nA combination Willie Mays and Babe Ruth\nWith a touch of viciousness like Rae Carruth\nPlayers you a leader, you an NFL scab\nMillennium photo type like Donovan McNabb\n\n(scratched)\n\"I love sports\"\n\n[Akrobatik]\nAy yo linebacker frame, general manager mind\nTaking me out would be a shock like when Magic resigned\nI never caught a flag for illegal use of the hands\nI got the fans waving theirs in the air up in the stands\n\n[Mr. Eon]\nI be the franchise brain trust in the rain gust\nGo back to the fog bowl when the hogs roll\nBeen rhyming ever since super bowl shuffle\nEver since the Larry Bird Dr. J scuffle\n\n[Akrobatik]\nYo all you rap cats that do your thing straining\nNeed to bring your asses back to spring training\nGetting strong like the swing of Mo Vaughn, as the beat goes\nI'll have you betting against your own team like you was Pete Rose\n\n[Mr. Eon]\nYah I take the medicine (sniffing)\nWhen I put the coke in the drink like Hollywood Henerson\nPlay book burning, still learning\nStep to the Vick get your back broke like Michael Irving\n\n[Akrobatik]\nYo, you need to get your stuff and go chill\nBefore you catch consecutive losses like the buffalo bills\nNo Cinderella stories here, you ain't doing no damage\nBecause me and Mr. E got the home field advantage\n\n[Mr. Eon]\nI'm coming, Eon, Boom-bye-yay\nWith color commentary and play by play\nWith no reason, I'm iller in post season\nLike Moses, \"Fo-fo-fo\" is what I'm screaming\n\n(scratched)\n\"I love sports\"\n\n[Akrobatik]\nAkrobatik yo\nMr. E yo\nHigh & Mighty yo\nEastern Conference yo yo yo yo yo", "title": "Sports Center", "album": null}], "artist": "Akrobatik"}