{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/6899b851929e0ce00a3ce59fe1cb1f6e.500x500x1.jpg", "title": "It’s Nothing", "year": null, "album": "The Giancana Story", "lyrics": "Giancana back at y'all niggas\nThis shit is bigger than killin the President\nIgnor-Entertainment up in this motherfucker y'all\n\n[Verse One]\nIt's nothing! Infrared beams laser the place\nTwo straps, radiate at the waist, I'm a marksmith\nThem things bark man, sprayin with haste\nShit razor gladiator your face, soakin your strip\nHoodied up, loc in the whip, pokin the clip\nArm extended out the window, chokin the fifth\nLegend or myth seek a Taliban, hit Babylon\nDon't misinterpretate the smile of a Don, I'm fowl as a swan\nGet at you, spit at you with ya child in ya arms\nClap at your bitch, full semi'matics eclipse\nDisplay rage like an evil omen\nTrust me in the backseat when you drivin\nI'll pop your fuckin cerebral open\nTake position when them snakes hissin\nEnd up nickel-plate kissin, out of state missin\nGet gravelled in the battles and wars, rattle the four\nCause cattle when you rhyme big you sound like you horse\nLet's do it\n\n[Hook: Joell Ortiz]\nIt's nothing! Dudes'll talk like they killers\nBut they eyes can't disguise the fact they really fear us\nIt's nothing! Them big rims on the truck\nThat slim ho that you pluck? That flossin'll get you stuck dude\nIt's nothing! This ain't your ordinary rap\nIt's extrordinary scrap - Cris', pour the Henny back like\nIt's nothing! (What's my name?) G Rap, Giancana\nNo throwbacks are fitted, we own rap and spit like\nIt's nothing!\n\n[Verse Two]\nFive star general ranked in the game I don't respect y'all seargeants\nI wreck you varmints, eject them comments, and wet y'all garments\nI bank sure as the flames from out them Texas orange\nKeep fresh hoes in flesh and bondage, collect and garnish\nThis ain't a threat it's a promise; give you a hospital bed\nAnd a harness, reps get tarnished if you don't hit that deck\nFor homage and beg for your pardon, G Rap head of the squadron\nKid be sent to alarmin; you flipped and stepped out of margin\nYou infuriated the Gods and the stars and\nThe sky's bout to thunder, you low-life come out from under\nAbout to heat your winters and drought your summers\nOne right up on your fort, forty-five Colt buckin the horse\nGive your body your nuts in divorce\nDick in the dirt, you flip to the earth\nCheck where the hit tip grippin the shirt\nGet a flashback, flick to your birth\nIt's war for you mo-rons, we wave four arms\nDraw with arms, more arms and more arms and more arms\nG Rap Giancana that raw Don made my bones\nWhen I was a young buck I played with chrome\nBlaze Stallone, get your brains blown, grazin the dome\nGet my stage on, the rage is on, my nigga\n.. Yo chill G\n\n[Hook]"}]}