{"artist": "Iamsu!", "songs": [{"title": "High As Ever", "lyrics": "[Verse 1]\nFuck bitches\nMoney then them\nEuropean whip, pretty engine\nFly pigeon\nYou talk about it, I really live it\nThey say I'm hot, I can't call it like 5 digits\nDialing out, to the head like a Tylenol\nYou ask me if I smoke, I say not at all, yeah\nI'm just tryna get higher like I'm not as tall\nAnd the rest figure me out like I just got installed\nOn your PC, fuck em, VD\nCase closed, space flow, young Suzy E.T\nExtra terrestrial, Piazza couldn't catch me though\nI'm just looking for a bad bitch who could bless me though\nSuzy, the real niggas choose me\nReal recognize real, I peep em like \"who's he?\"\nUh, please give me room, 5 feet\nAnd I'm feeling something like a Marley cuz nigga I am\n\n[Hook x2]\nHigh as ever, high as ever, high as ever, high as ever, high as ever\nI'm feeling like I'm fly as ever, fly as ever, fly as ever, fly as ever, fly as ever\nFeeling like I'm\n\n[Verse 2]\nZoning, show me my opponent\nHigh as ever, you ain't gotta guess what my cologne is\nReal talk is found wherever the microphone is\nI'm composing, this symphony I was chosen\nLet me be the voice for those who never had one\nTake you on a ride get your seatbelt fastened\nI continue to put on like fashion\nAutobahn flow call me Martin, Aston\nI'm a big ticket like a DUI\nAviator dreams but they don't want to see Su fly\nI hit the stage but you can't see me from the seats you got\nBut I ain't tripping off you fruits I just watch you rot\nYou can call me a local grocer\nJust show me a flow that's grosser\nLike [?] I am closer\nJust trying to make the most of\nWhat I was given, work like it's my religion\nQuitting is not an option so kill 'em is my decision\nAnd you can work the hardest, but I'ma work the smartest\nI'm the man behind the wheel while you rappers carless\nI swear you rappers garbage\nSoon to be dearly departed\nMinus the dearly\nMurder them clearly\nNot with the bull so don't try to steer me\nNobody near me, give me an ounce of space\nMe plus this beat, the amount is great\nThe rap game's at stake\nSo call me black angus\nI'm just trying to get to the green like a park ranger\n\n[Hook x2]", "image": "https://images.genius.com/00b40325316616c0a1eeed2b05f49d72.600x300x1.jpg", "album": "Su! The Right Thing", "year": null}]}