{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Hugs & Kisses", "image": "https://images.genius.com/e2498ebfb1bf16a3aa20d4001b9f08d1.1000x986x1.jpg", "lyrics": "[Intro: Professor Green]\nHaters can be so lame and vicious\nHating on me because I'm ambitious\nThey sound like they need lots of love, lots of love\nThat's why I'm sending them hugs and kisses\n\n[Verse 1: Professor Green]\nHugs and kisses, you can suck my di-dick, critics\nI did it without gimmicks, you really want some? You're dumb\nYou really wanna run that rid-isk? I'm ridiculous\nYou don't know that? You man are looking like poom poom to me\nAnd it's hard not to get a semi when I bowcat\nI ain't really into any of your broke chat\nWhy you talking about P, fam?\nWhy you talking about me, fam?\nI went number one off a meaningful song\nNot none of that edam\nProbably should've been on Crimewatch\nMean and high, Prof Green am I not?\nWhen I say the paps snapped me with a funny looking Roley\nYou know I don't mean a snide watch\n\n[Hook: Professor Green]\nHaters can be so lame and vicious\nHating on me because I'm ambitious\nThey sound like they need lots of love, lots of love\nThat's why I'm sending them hugs and kisses\nI don't know why they hate on me, they should be inspired\nGet up off their backsides and chase their desires\nThey sound like they need lots of love, lots of love\nThat's why I'm sending them hugs and kisses\n\n[Post-Hook: Professor Green]\nPages of papers\nThe dangers of being famous\nWhere there's no shade from the sun\nWhen everyone knows what your name is\nLooking in the mirror\nSeeing yourself looking back at you\nTell em they can kiss my class\nAnd suck my fucking attitude\n\n[Verse 2: Fekky]\nWho the fuck are you hating on?\nYou decide that\nYeah, tryna someone to blame it on\nYou want beef, then bring it on\nMan's got the filet mignon\nHeard man wanna make a move\nWhat the fuck are you waiting on?\nCome on den!\nAll that hate won't get you rich\nHave you seen this watch on my wrist?\nYou should know what time it is\nYou dun know, you can't chat man\nIn a Porsche, looking like Batman\nI'm gone, can't catch man\nShut up\n\nHahaha, hugs and kisses\nYou know what, Pro? I totally get what you mean\nThey're tryna blame us for their life! Hahaha\nFucking lazy *beep*\n\n[Hook: Professor Green]\n\n[Verse 3: Stormzy]\nYo, I got a drop in my email like \"yo, it's Pro Green\"\nI get love in the club, no cup, yet they all know me\nI get love from the thugs and some of the so-called Gs\nMy lyrics are drugs, tell em all smoke up till you all OD\nCan't chat to me about karma\nDone dirt, man, I'm feeling like a killer with the verse\nTell a pussyhole to work harder\nRound my link, my bro? Then go Ghana\nGet my shit to go with no starters\nMan, I might hit the road, yeah, I'm tipped to blow\nGet my flick involved with no dramas, easy\n\n[Hook: Professor Green]\n\n[Post-Hook: Professor Green]", "year": "2014-09-22"}]}