{"artist": "6ix9ine", "songs": [{"year": "2018-11-15", "title": "EXODIA (Remastered)", "album": null, "lyrics": "[Chorus: Xen Black]\nIt's that Titanic iceberg, bitch, I'm fucking sinking\nIt's that Titanic iceberg, I'm over-fucking-thinking, yeah\nTitanic, iceberg, bitch, I'm fucking sinking\nIt's that Titanic iceberg, I'm over-fucking-thinking, yeah\n\n[Verse 1: J $tash]\nHold up, riding with the two Glocks\nWho hot? You not, hoes call me 2Pac\nTitanic on my left wrist, cost me two block\nJ $tash, chain splash, red, yellow, blue watch\nMind you a flip, tell a bitch through a tube sock\nTruck, get up front, no top when I do drop\nRolling up a blunt, take a puff, getting too high\nTwo white girls on my dick, gettin' creampied\nUh, shit get nasty, Susie, Tanya Leslie, Ashley\nUh, bitch, come catch me, Louie, Gucci, Fendi, flashy\nEh, bitch, you ashy, can't talk to me, bitch, you trashy\nUh, keep it classy, got me a new bitch, look like Ashley\n\n[Chorus: Xen Black]\nIt's that Titanic iceberg, bitch, I'm fucking sinking\nIt's that Titanic iceberg, I'm over-fucking-thinking, yeah\nTitanic iceberg, bitch, I'm fucking sinking\nIt's that Titanic iceberg, I'm over-fucking-thinking, yeah\n\n[Verse 2: 6ix9ine]\nRun it, run it, run it (Run it), gun it, gun it, gun it (Gun it)\nTaking souls, digging holes, pulling triggers, yeah, we busting\nWatch your eyes fake the dump, when this gun fuckin' buck\nConcrete shoes and all, body lay under the tongue\nRun dead on a nigga on the back block\nClosed door jig, get ya head popped\nStraight drop, 40 caps lookin' like a laptop\nRed beam on the gun, sound like cyclops\nBitch, what the fuck is you thinking?\nBitch, what the fuck is you thinking?\nBitch, what the fuck is you thinking?\nAll of my niggas gon' spray it\n\n[Chorus: Xen Black]\nIt's that Titanic iceberg, bitch, I'm fucking sinking\nIt's that Titanic iceberg, I'm over-fucking-thinking, yeah\nTitanic iceberg, bitch, I'm fucking sinking\nIt's that Titanic iceberg, I'm over-fucking-thinking, yeah", "image": "https://images.genius.com/400254c4419a4372679f9b0787d6ea62.500x500x1.jpg"}]}