{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/83c3c3600e593cd70983b16b400ba31e.939x939x1.jpg", "year": "2018-11-09", "album": "3", "lyrics": "[Intro]\nThink it's a game?\nDo-do-do-do-do-do-do-do, do, uh, uh, yeah\nAyy, ayy\nUh, uh, hey\nAyy they gon' think I lost it, yeah, hey, hey\nUh, hey, lost what? Bitch, I ain't lost shit, hey, uh\n\n[Chorus]\nAyy they gon' think I lost it, and the top, I lost it\nForgiato offset, and I'm drippin', faucet\nAyy they gon' think I lost it, they gon' think I lost it\nAnd her top, she lost it, so the top, I lost it, yeah\n\n[Verse 1]\nThis shit big as a Suburban, she never heard of it\nI'm in both lanes just to swerve it, she puttin' that work in\nAyy, I got less than five percs and can't see a person\nAyy, if I had to pay for it girl, you know I'd purchase\nUh, let me purchase, let me, let me purchase\nBuy her Fendi purses, buy Chanel and Birkin\nAyy that pack land on Thursday, so much, make you nervous\nHow you fly a bird in? How you fly a bird in?\nUh, ayy like 2Pac, I'm Birdie, huh\nI just made a mil off servin'\nI spent a whole mil on some jewelry, huh\nI know only the real gon' feel me\nAnd I know the deaf gon' hear\nI'ma sleep on the mail this year, huh\nTryna have five M's this year\nHave 'em lookin' like M, M, M\n\n[Chorus]\nAyy they gon' think I lost it, and the top, I lost it\nForgiato offset, and I'm drippin', faucet\nAyy they gon' think I lost it, they gon' think I lost it\nAnd her top, she lost it, so the top, I lost it, yeah\n\n[Verse 2]\nOkay, look, work it, bitch go'n and work it\nI done threw 'bout me a quarter in this bitch on purpose\nThe way my wrist hurtin', probably broke it\nAnd the bank, I broke it\nI can't fuck no broke bitch\nI can't stand my old bitch, yeah\nGirl, come bend it over for me\nTell me what all you need\nI won't tell you it's guaranteed\nNow she yellin' out, \"Marry me\"\nBut I'm married to the money\nLove carats like a bunny\nIn Paris with a bunny, yeah, look\nEverything painted red, I got different bread\nGot some white, wheat, honey oat, and Panera bread, yeah\nPlus I'm thoroughbred, yeah, and my dogs fed, yeah\nPlus my girl know I like that pussy bald head\n\n[Chorus]\nAyy they gon' think I lost it (Lost it), and the top, I lost it (Lost it)\nForgiato offset, and I'm drippin', faucet\nAyy they gon' think I lost it, they gon' think I lost it\nAnd her top, she lost it, so the top, I lost it, yeah", "title": "Think I Lost It"}]}