{"artist": "Angie Martinez", "songs": [{"title": "Never", "image": "https://images.genius.com/fa4abffe2c6164a010ae6b833f491d67.1000x981x1.jpg", "album": "Animal House", "lyrics": "[Intro: Girl]\nAnd you will never break me til the day I die\n\n[Verse: Angie]\nYo everytime I turn around they say\nHow I deal with that weak shit\nI told y'all of the stages I can't agree wit\nWe showed y'all, promoted y'all on how to freak shit\nBut here's a little secret...\nUh uh we still number one, blazin Hip-Hop and R&B quick\nCuz it's simple and plain, now can you sit and complain quick\nWhen we payed the way for you to get in the game chicks\nNigga's wuteva...it's only the real that they recognize by the real\nAnd since you dont recognize you know the deal\nHow I feel? I don't know emotions get showed\nIf anything I feel violated being that we been cloned\nReporterz quit, I dont get caught up in the mix\n10 years deep, I was brought up in this shit\nOG , big truck series, the cars is gone\nAny questions? I'll be directing your comments\nTo alkatron...sing that shit\n\n[Hook]\nA primitive mind is all I, all I ever had\nAnd you will neva break me til the day I die\n\n[Verse: Angie]\nMy reputation and my name is superb\nNow add that with animal house and a flow that's like rain down a curb\nCuz I, write a verse and I change a few words, edit and perfected it ..\nAnd and... I'm still on the air about the dough\nBe clear, you gotta go each year we lock and load\nBeware I'm outta control animal mode will let you know not to\nHand me no goal\nEverything I write hot like my hand on a stove\nThe (?) know bullshit dont effect me like a \"Die Hard\" knicks fan\nSo no mas if's and's\nI could show you how power shit get ran and I can't get budged\nCuz when your best friend is the jury bottom line is you can't get judged\nAnd that last line went over ya head so\nYou'll probably never know til your dead either way\nWhat I said is real, sing!\n\n[Repeat Hook]\n\n[Verse: Angie]\nUh yo uh..\nAnd I'm not bein cocky\nCuz I work my way up\nAnd even tho' it hurt never gave up\nWent from handin' out fliers to number one major.. I don't\nI'm about dollars, hold your to cents saved up\nDropped my first album never rock in my life\nDid everything on mah own wrote the songs, hit the mic\nGet the beats all nice stayed up got it right\nMinimal help, felt alone\nNow you got a problem right?\nCuz it's animal house, the team is here\nIt's a new day with me this year be clear, I'm focused\nBest coaches, way too many peeps\nPro to machines and way to much heat\nStill grounded never been way up in the sky\nWorkaholic still spend days inside\nAngie, you could never break me, I move wise\nAnd that's til the day I die, ohh, my, GOD\n\n[Repeat Hook]", "year": null}]}