{"songs": [{"year": null, "image": "https://images.genius.com/809737792a8459e937896e9550e530ba.600x600x1.jpg", "title": "Spanish Fly", "album": "Life Story", "lyrics": "[Black Rob]\nYo look clown I come through bully down\nKeep thinkin that you hard take a look around\nI got soldiers stationed up to bring pain\nAnd when it go down my hoes do the same thing\nWe all in the same game, we all willin to bang\nAin't nobody going against the grain, so take aim\nB.R.'s evasive, cut all the faces, catch all the cases, this real\nYou rather bet'cha life than face me\nI mean I got this rap game locked with more cake than Tastee\nBlack the feindest, this title I hold I won't relinquish\nAnd this type shit you shouldn't sting wish\nAnd one phone call and I'll extinquish, I mean this you seen this\nBlue steel fo-fo the caliber, Excalibur, Im'a destroy my next challenger\nB. Rob high post MC, quick to spray Raid on the roach MC\nSo don't be apporachin me without the cross and rosary\nWho this nigga 'pose to be, I blast him in the open beef\nDamn Black, how you do that der?\n'Cuz we..dont..care, I'll take 'em there\n\nChorus: Jennifer Lopez\n\nLast night, I dreamed of some more dough\nSome crystal, sixty thousand, and ten dimes of 'dro (I'll take 'em there)\nLast night I realized I'm dreaming\nToo late now, guess I'll finish what I started baby\n\n[Black Rob]\nY'all niggas heard the first verse no doubt shit bangin\nVerse two make sure none of y'all left hangin\nGot honies lovin this shit too, one wit'choo\nLong as you know my pants don't fit'choo\nMoney good look, understand why he shook\nShit I'm rich, face all up in the Guiness Book\nCheck, all the records I set, its major\nCheck, that the sets I wreck with flavor\nFuck that cajun, guns stay bond cock\n?Boiler on lock? hold shit down like Fort Knox\nMan, knock the rhyme unorthadox\nWhat'cha barely understand, shit I deal with the L.O.X\nGive me the props, Im tryin set a mark this year\nAnd bring the equipment out to the parks this year\nSo y'all could see how it used to be\nI'm lookin towards the future see\nBlack here to stay, its time y'all got used to me\nPuff said Black ain't tryin to fit in\nUp and down the coast can't count the spots I've been in\nPut'cha bid in\n\nChours\n\n[Black Rob]\nI hit a ??? if my name was Teddy Bender\nHot beats and hot rhymes tossed in a blenda'\nI want ch'all to feel hardcore, nothin tenda'\nBlessed this mic for as long as I remember\nY'all can't see the Rob, uh-uhh, y'all must be stupid\nIf I owe Shawn Combs any money then I recouped it\nI looped it, this fly shit from ?Nebogada?\nMe and Yogi and Hard Pierre from You Dont Know Me\nI dare you to come against me, run against me\nUse your gun against me, you finito, finished\nI've seen wild cats diminished, foldin for, Bad Boy's known to ball\nInternationally, I'm sayin actually\nI have to be the next cat to go and sell a million records casually\nSo, prepare yourself for the storm, Nineteen-nine-nine its on\nAnd I'm just gettin warm\n\nChorus"}], "artist": "Black Rob"}