{"songs": [{"year": "2000-11-28", "album": "Lyricist Lounge 2 ", "image": "https://images.genius.com/bb2a12043d5bed3ffa2d2b0d3814b69b.600x600x1.jpg", "title": "Makin’ It Blend", "lyrics": "[Verse 1: Q-Tip]\nUh...\nAbstract, Queens cat, what we lookin' at?\nSixth sense, too immense, smellin' is the fact\nOut here, you got your shiesty cats stabbin' backs for some track\nUntil we take it back, you prob'ly won't be feelin' rap\n\n[Verse 1: Wordsworth]\nWORDSWORTH, Brooklynite, what it lookin' like?\n5 senses, 9 inches, 5 foot in height\nOut here, you got your crooks and heists\nShook and shiest, look alike\nPayed off the books from dice, good lookin' and hookin' tight\n\n[HOOK 1: both]\nUs, you, they and them\nYO.. her and him\nWe make it blend I say we makin' it blend\nYO... uh uh uh uh uh uh\nUs, you, they and them\nYO.. her and him\nWe make it blend I say we makin' it blend\nYO... uh uh uh uh uh uh\n\n[Verse 2: Q-Tip]\nBack when I came out, first joint I hit it out\nNew styles to talk 'bout, new ground to walk about\nStill breakin' shit wit the hammer of Thor, god\nBigger than Asgard, hittin' your ass hard\nAct it out 'cause there's no time to word shit\nYou never win with Wordsworth the wordsmith\n\n[Verse 2: Wordsworth]\nThe verse gets tighter every second the earth twists\nHeard its Q-tip and Words you had to purchase\nPrefer this, now wait a minute, what's that I heard skip?\nNerves twitch, play this so much it's probably your third disc\nOn purpose, at your service, basement to surface\nLearn this, how can you rehearse something that's perfect?\n\n[Verse 3: Q-Tip]\nIsn't it funny when you use your favorite pen\nAnd get your rhyme pad, write shit that's truly bad?\nEmbarrass yourself, make a fuckin' mockery\nEnd the hypocrisy, you never toppin' me\nI'm the monopoly, in jail is your cacophonies of unfair policies\nIn there you're rottin' B\nYou hit the lottery, well then you spottin' me\nI'm extortin' you of all your natural bodilies\n\n[Verse 3: Wordsworth]\nAyyo it gotta be the way I respond that makes honor me\nSong hittin' award winnin', y'all just the nominees\nPlay it safe, I'll arrange your wake\nMy paper mate will have my label mate's album released a later date\nPolice patrol the city 'til I'm as old as 50\nHat back, clothes won't fit me, causin' 5-0 to frisk me\nMy hands are ammunition, banned like contraband in prison\nI'm who you wanna be blowin' out your candles wishin'\n\n[HOOK 2: both]\nMakin' it, makin' it blend\nYO... makin' it blend\nMakin' it, makin' it blend\nYO... makin' it blend\nMakin' it, makin' it blend\nYO... makin' it blend\nMakin' it, makin' it blend\nMake, makin' it blend\n\n[Verse 4: Wordsworth]\nYo, I like a woman wit a bangin' body, the face and frame of Halle\nAttitude - angry, snotty, speaks slang and cocky\nTime to hang ain't gotta bring a posse\nThrough rainy days she got me, like Whitney stay wit Bobby\n\n[Verse 4: Q-Tip]\nYo, your cake is in the kitchen, your wishful premonition\nIt's turned around by my firm thoughts of demolition\nIt's time to numb your run and dim your vision\nIt's time to give up the hopes and dreams of major acquisition\n\n[Verse 5: Wordsworth]\nAin't got a drop top that goes 0 to 60\nBut after shows, ladies drop tops and show they titties\nAcross the globe can't oppose, it's risky\nOr even go against me, I'm Words\nSo every time that you flow you spit me\n\n[Verse 5: Q-Tip]\nWe in the asphalt, you cause your last fall\nInsult to injury is when we curse the salt\nDouse the open wound to the tomb\nIts time to sit back and watch professionals in full bloom\n\n[HOOK 1]"}], "artist": "Q-Tip"}