{"artist": "Pacewon", "songs": [{"album": "Won", "title": "World Reknown", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "[Pacewon]\nThis is W-O-U-T, with a quick caller question\nCaller, can you name a quick three countries\nCan your friends?  Depends?\n\nYo! It's the Pacewon-er, more hot than late summer\nEighth wonder of the bass drum\nWho can touch your melon you can tell 'em PACEWON!\nYou only do what Pace says\nBottle up the product and serve it to the bassheads\nI keep it corporate, ain't with that talk shit\nWon made to bust like the guns the cops walk with\nHold a four-fifth, all kids vacate\nTesty to press me like a can of spray paint\nCause by the time a policeman appears\nThey'll be cuttin down the bodies I hang like chandaliers\nHip-Hop prisoner, Alberto V-O-5\nIn your scalp like conditioner, hit you by the eye\nFuck your 20/20 vision up, used to be a pilot\nNow he can see light - now who his girl gettin high with?\nNowadays I'm humble, strictly on some shy shit\nUsin my ears, keepin my affairs private\nLivin that life of a righteous rap giant\nPack the black iron that roar like Mad Lion\nStingy, Ebenezer, never freeze up\nForever be the rapper that drunk that one\nThat black out like a seizure - burnin hot with fever\nRight lung failin, from inhalin cheeba\n\nWorld reknowned.. world reknowned.. world reknowned.. world reknowned\n\nIn my hood it's people fiendin, screamin like the opera\nCuz was up early, drinkin dirty aqua\nNever put they Glock up, restless like the young kids\n40's, they tongue-kiss, like who can get the drunkest?\nWear the right gear like them Nike Air strap-ons\nMC's write rap songs, hoochies wear platforms\nIt's all G Broad Street down to Stuyvesant\nNiggas got talent, move like Allen Iverson\nRappers by the number, Redman, Artifacts\nLords of the Under - sprint to get a glimpse\nBet the fireproof lighter troop make yo' eyes swell\nWord to my _Fu-Gee-La_ and my nigga Praswell\nPacewon flips, I piss on niggas like the urinals\nYou keep on blurrin those WACK-ASS RHYMES\nI break code and make access, grab my gun attack feds\nWith somethin that the rap heads can't pass by\n\nWorld reknowned.. world reknowned.. world reknowned.. world reknowned\n\nYo, mommy never knew I'd grow up to be a thug or\nBe best friends with the neighborhood drug lord\nIronic lifestyle - who woulda thought that tomboy\nYou used to diss - got to be your wife now?\nSex in cars, money like the lotto\nBrother try to foul me, Audi, cuatro\nCrews fake bullshit and act stupid\nI'm lootin, usin my third eye like a mutant\nRollin with the big men, ign'ant men fly\nMistaken motherfuckers, thought they had it locked\nAnd along comes the Pacer - with ecstasy!\nGot juice like a warden that can set you free\nChronicles of \"Won\", Pace the rhyme felon\nWatch for my album..\n\nWorld reknowned.. world reknowned.. world reknowned.. world reknowned", "year": null}]}