{"songs": [{"lyrics": "[Produced by Kanye West]\n\n[Intro]\nThank you, thank you, thank you!\nYou're far too kind\n\n[Chorus]\nNow, can I get a encore? Do you want more?\nCookin' raw with the Brooklyn boy\nSo for one last time I need y'all to roar\nNow what the hell are you waitin' for?\nAfter me, there shall be no more\nSo for one last time, nigga, make some noise!\n\n[Verse 1]\nWho you know fresher than Hov'? Riddle me that\nThe rest of y'all know where I'm lyrically at\nCan't none of y'all mirror me back\nYeah, hearin' me rap is like hearin' G Rap in his prime\nI'm Young H-O, rap's Grateful Dead\nBack to take over the globe, now break bread\nI'm in Boeing jets, Global Express\nOut the country, but the blueberry still connect\nOn the low, but the yacht got a triple deck\nBut when you Young, what the fuck you expect? Yep, yep\nGrand openin', grand closin'\nGoddamn, your man Hov' cracked the can open again\nWho you gon' find doper than him?\nWith no pen, just draw off inspiration\nSoon you gonna see you can't replace him\nWith cheap imitations for these generations\n\n[Chorus]\nNow, can I get an encore? Do you want more?\nCookin' raw with the Brooklyn boy\nSo for one last time I need y'all to roar\nNow what the hell are you waitin' for?\nAfter me, there shall be no more\nSo for one last time, nigga, make some noise!\n\n[Verse 2]\n(*Sighs*) Look what you made me do! Look what I made for you!\nKnew if I paid my dues, how will they pay you\nWhen you first come in the game, they try to play you\nThen you drop a couple of hits, look how they wave to you\nFrom Marcy to Madison Square\nTo the only thing that matters in just a matter of years (yeah)\nAs fate would have it, Jay's status appears\nTo be at an all-time high, perfect time to say goodbye\nWhen I come back like Jordan\nWearin' the 4-5, it ain't to play games with you\nIt's to aim at you, probably maim you\nIf I owe you I'm blowin' you to smithereens\nCocksucker, take one for your team!\nAnd I need you to remember one thing (one thing)\nI came, I saw, I conquered\nFrom record sales to sold-out concerts\nSo, motherfucker, if you want this encore\nI need you to scream 'til your lungs get sore\n\n[Interlude]\nOwww, it's star time\nThis man is mean, he's killin' all y'all jive turkeys\nDo y'all want more of the Jigga man?\nWell, if y'all want more of the Jigga man\nThen I need y'all to help me bring him back to stage\nSay \"Hova!\" – c'mon, say it!\nAre y'all out there? [crowd chants \"HO-VA! HO-VA!\"]\nC'mon, louder!\nYeah, now see that's what I'm talking about\nThey love you, Jigga! They love you, Jigga!\n\n[Break]\nI like the way this one feel\nIt's so motherfuckin' soulful, man!\n(Whoaaaaaahhhh, whoahhhhhhhhhhhhh, whoahhhhhhhhhhhhh)\nYeah [crowd still chanting] okay\n\n[Verse 3]\nSo this here is the victory lap\nThen I'm leavin', that's how you get me back\nAfter a year of them 16's, it's 1.2\nAnd that's 2.4, and I'm only doin' two\nYou wanted to gain attention, new dudes\nI can get you BET – and TRL, too\nYou want to be in the public, send your budget\nWell, fuck it, I ain't budgin'\nYoung did it to death, you gotta love it\nRecord companies told me I couldn't cut it\nNow look at me: all star-studded\nGolfer above par like I putted\nAll ‘cause the shit I uttered was utterly ridiculous\nHow sick is this?\nYou want to bang, send Kanye change\nSend Just some dust, send Hip a grip\nThen you gotta spit a little somethin' like this\n\n[Outro]\n(What the hell are you waiting forrrr?)\n[piano plays out as crowd cheers loudly]", "title": "Encore", "image": "https://images.genius.com/43eaa97ed558d8bc39aa0f9a4089f7a4.500x438x1.jpg", "year": "2003-11-14", "album": "The Black Album"}], "artist": "JAY-Z"}