{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/8aaa0a119c995f68c57360a1c18d583a.600x600x1.jpg", "title": "Keep It Movin’ (feat. Knowdaverbs)", "year": "2000-01-01", "album": "7th Avenue ", "lyrics": "Intro (KJ-52):\nYo\nYo, is this mic on?\nSomeone turn my mic on, man\nStop playin', man, turn my mic on\nYo, is this mic..\nYo, is this...\nYo\n\nVerse 1 (KJ-52):\nIs this mic on? Grip it like a python\nBlow up like pipe bombs or even planet Krypton\nI'll grab a napkin if it's all I gots to write on\nI hittin' ya so hard ya feel it in ya protons\nHold on\nNah son, now ya dead wrong\nI'm hittin' ya dead on, now, it seems that ya read it wrong\nThe cross that He bled on is all that I flips on\nAnd every mic I grip on, that's the mic that I rip on\nI got more lines than girls gettin' hit on\nI'm stayin' calm\nI'm writing these rhymes like Davidic psalms\nAnd if you cut me now, I'll probably bleed some Krylon\nBut Christ has got me transformed like Decepticons\nI'm pressin' on, I'll make ya feel it in ya chest and arms\nGrabbin' ya palms and makin' hits like Mafia Dons\nThe blood now got me covered like some napalm\nMy word is born now so what's your crew waitin' on?\nMy sin is gone, swingin' swords like Voltron\nAnd I can go on, like sentences that run on\nAbout my God who from now to the eons\nHe's runnin' things no matter what planet you be on\n\nHook (KJ-52):\nFrom the L.A. to the NYC\nDirty South and all points in between\nAll my peoples, worldwide, keep it movin'\nIt ain't where you're from or where you're at\nIt's where you're goin'\n\n(Hook)\n\nVerse 2(KJ-52):\nI'm grabbin' pens, open up the folders\nI got my pages through Motorola Boost slaves like a soldier\nYou couldn't move the crowd with dynamite and a bulldozer\nI'm lettin' Jehovah rock it like a boulder\nIt's showin' love from the younger to the older\nSo hard knocks keep them blocks in the holsters\nSo come on over cause nobody gets the cold shoulder\nNow it's my God who awoke me from the coma\nNow, to me, MC means the Microphone Controller\nI'm stayin' in this syllabus with the verbs like the Knowda\nWe hold it down, now, from here to Arizona\nJust keep it movin' now in case we never told ya\n\nVerse 3(Knowdaverbs):\nI'm a speak this, so hate me now if you want to\nBut it'll be kinda hard to do when still claim to follow Christ too\nI'm a mosey on in like this very track's tempo\nAnd mosey on back like word is heard from the demo\nIt's mighty hard when it's not that fast, enough timin'\nOn hearin' from a label after showcasin' ya best rhymin'\nSending them an envelope with a note attached to the cassette sayin'\n\"It's our new stuff, kinda rough and ain't been mixed yet\"\nBut stay anxious for Nathan, take some time to bill\nCause they automatically up the ante when ya on the playin' field\nSo come closer to the speaker, because y'all don't wanna miss this\nI reckon I rank real high on the Enemy's out-to-get list\nAn extra expose, exposin' all the creeps\nDid you catch the taped series on how they told ya to pull the sheets?\nCause a lot of us is Christians sleepin' with the opposition\nThen we snappin' under pressure, leavin' funky dispositions\nWe supposed to speak bold but then we fold 'til it hurts\nAnd this life requires passion set to action through the works\nIt's how we do, you know how we do\n\nHook, 4X"}]}