{"songs": [{"image": "https://images.genius.com/d8ab635827060eb71d3130b28c7cd04f.1000x1000x1.jpg", "title": "Champion", "album": "Pink Friday: Roman Reloaded", "year": "2012-04-02", "lyrics": "[Verse 1: Nicki Minaj]\nThis a celebration, this is levitation\nLook at how you winning now?\nThis took dedication\nThis is meditation, higher education\nThis the official, competitor elimination\nI-I-I-I was taking trips, with Web to move weight\nCame back to Queens, to hit up a new state\nBitches don't know the half, like they flunk they math\nBitches ain't have cut up crack up in the stash\n50 Cent Italian, icy flow\nThis is that Run-and-Get-a-Dollar-for-The-Ice-Cream-Cone\n'Cause they killed my little cousin Nicholas\nBut my memory's, only happy images\nThis is for the hood, this is for the kids\nThis is for the single mothers; niggas doing bids\nThis one is for Tee-Tee, Tweety, Viola, Sharica\nCandace, Thembi, Lauren, Aisha\n\n[Hook: Nicki Minaj]\nIt's a celebration (Put one in the air for the ghetto, ooh)\nIt's times like these (Ooh, ooh)\nThey know who we are by now (They know who we are)\nChampion, the champions (Champion, champion)\n\n[Verse 2: Drake]\nYeah, okay, we made it to America\nI remember when I used to stay with Erykah\nLabel transferred 20 million to Comerica\nIt's fucking terrible, it's got me acting out of character\nYoung T.O. nigga, either riding range\nOr Ferrari top down, screaming, \"Money ain't a thang!\"\nTell me when I change, girl, but only when I change\n'Cause I live this shit for real, niggas know me in the game\nThey know! Making hits in three acre cribs\nCooking up tryna eat niggas, steak and ribs\nI made a couple stars outta basic chicks\nNowadays blow the candles out, don't even make a wish\nHaving good times, making good money\nLot of bad bitches, but they good to me\nI make them do the splits for a rack\nWish you niggas good luck, tryna get where I'm at\nStraight like that\n\n[Hook: Nicki Minaj]\nIt's a celebration (Put one in the air for the ghetto, ooh)\nIt's times like these (Ooh, ooh)\nThey know who we are by now (They know who we are)\nChampion, the champions (Champion, champion)\n\n[Verse 3: Young Jeezy]\nStraight balling in this bitch, Jeremy Lin; 'Melo\nTell me one thing you won't do: settle\nGive me one word for your chain: yellow\nPocket full of money, black cars; ghetto\nCritics say I ain't in the game, A.I\nJeezy, how you deal with the fame? Stay high\nStay putting on for the town, may I?\nWhat you call a crib in the sky? Play-high\nOver a mil in three weeks, yeah, I did it like a champ\nMomma taught me pride, yeah, she did it with the stamps\nWait a minute, everybody pause for the photo\nSomebody tell these local hating niggas, I'm global\nTell me what I gotta do to get this champagne going\nWhat I gotta do to get this coconut flowing?\nDon’t let me hit up Shawn Carter, hundred bottles of the Ace\nLet me hit up Sean Combs, hundred cases to my place, let's celebrate\n\n[Hook: Nicki Minaj]\nIt's a celebration (Put one in the air for the ghetto, ooh)\nIt's times like these (Ooh, ooh)\nThey know who we are by now (They know who we are)\nChampion, the champions (Champion, champion)\n\n[Verse 4: Nas]\nWhat up, Nicki? It's Nasty, yeah\nI saw my first two million dollars, I was 23\nI'm barely a man, yet, I had some killers under me\nThis ain't rated PG, this rated PJ\n'Cause that's where a nigga from; murder on replay\nMy 24th b-day, I'm sailing to Bermy, you can see me on a yacht\nBlasting Pac, little knot, I ain't greedy\nI'm back to thugging, bitches\nBack to making them kiss other bitches\nMy man sister like me, I don't fuck my brother sister\nI just aspire your desire to be different\nMy ten year old plan is just one year to finish\nMy list looks like this, first thing that you'll discover\nThe difference in pussy: white, black, Latin and other\nHere's a man who clearly isn't basic\nWaiting list, just to hear me or witness the greatness\nLoud laughter, while writing my next chapter: Fast Cash Life\nHappily ever after\nChampions\n\n[Hook: Nicki Minaj]\nIt's a celebration (Put one in the air for the ghetto, ooh)\nIt's times like these (Ooh, ooh)\nThey know who we are by now (They know who we are)\nChampion, the champions (Champion, champion)"}], "artist": "Nicki Minaj"}