{"artist": "Pras", "songs": [{"album": "DJ Skribble’s Traffic Jams", "title": "You Can’t Stop The Pras", "image": "https://images.genius.com/462f588f1e4fc3602c8fee336874a8c3.297x300x1.jpg", "lyrics": "[Prakazrel \"Pras\"] - One Verse\nIs this fuckin' mic on or what?\nYeah...\nIn a daze, I walk for miles like Isaac Hayes\nRun relays where your team gets delayed\nShe keep a magnum by the ashtray\nWhen Pras come to visit with John Forte' !\nDining out, in a five star cuisine\nStretch, double R invisible limousine\nRiding down your block never to be seen\nThe supreme dream team is a money machine\nYou a fiend, I'm a king\nWatch me, do my thing\nMoney like DeNiro\nThe squad's sub-zero\nYou chicken parmesan hero eatin' while I'm winning\nI've been living, my team's stealing, you're still wishing\nStill bitching, still fishing, still snitching!\nPenny pinching, having meetings in your kitchen\nSend my man shotty, clips to your body\nJewels from Liberace, partin like Dolly (Parton)\nHA-AH! AH-HA! AH-HA! AH-HA!\nYo, Yo, Check it!\nI dedicate this piece to my peeps who roam the streets\nGod bless their soul, may they each rest in peace\nThere's those who finance and those who choose to lease\nWhatever suits you, whether on a term of your lease\nDifferent strokes for different folks, GOD!\nI refuse to going back to being broke, LORD!\nHe got struck with lightning he got hit, HARD!\nFaces twenty like two maximum\nHis whole life was scarred!\nThe Preacher's Son and I, came off the Santa Maria\nTen case amount of, then caught the diarrhea\nWhole load of Refugees on the aircraft carrier\nSome say Dirty Cash? We never heard of ya\nYou never heard of me? Yeah, well check your Billboard, yeah, you'll see!\nFrom the heart of Kingston, to the streets of Brooklyn-Marcy\nAll the way to the highest peak of any frequency, unhh!\nIllegal aliens, them all run invasions\nBroadcasting all over your radio stations\nMathematics, lead me to believe\nThere's mysteries in numbers\nLightning and thunder\nEnough, ribbons in the sky\nTo make Stevie Wonder\nAnd man it works, to say I come from down under\nThe wiz kid got no ride\nYou frontin' at the bar\nYou ain't a star\nYou rolled up in somebody else's car\nYou know the deal! BMW, Black Man Walking, came home your\nTimberland was talkin'!\n\n[Pras - Outro]\nWhat?! Ha Ha! Ha Ha Ha!!\nYo, Skribble man this is some bugged out freestyle! For the Nine-Seven!\nThis is Dirty Cash, Pras, and I'm out!\nYo, man thanks for lettin' me be on here yo, you know what I'm sayin'?\nPick up The Car---!\nPick up The---!\nPick up The---!\nPick up The---!\nPick up The Carnival y'all! Pick up The Carnival!", "year": null}]}