{"songs": [{"title": "HOHO!", "album": null, "year": "2017-01-02", "image": "https://images.genius.com/42c926527f930f1adb272b5e69dc602f.500x500x1.jpg", "lyrics": "[Intro]\nIt's Seiji, baby\n\n[Chorus]\nI be with my gang\nShined up with my crew\nDon't give a fuck 'bout you\n\n[Verse 1]\nFucking classy hoes, dirty bitch, nah, you ain't kissin' me\nSlide to your mamma house unlock her like I got the key\nIgnore a fuck bitch and I know that bitch won't talk to me\nHoes look hella short 'cause they always on they fuckin' knees\nSkanks think they hard, nah bitch, you ain't really bout it\nSmoking on that shit, bitch my eyes looking really clouded\nDidn't hear me first time, bitch I guess I gotta fucking shout it\nI don't fuck with broke boys, my brothers bands cannot be lackin'\nDo a double take, see that she got some back to her\nFinesse it, then plow that shit just like a tractor\nGood looking rapper, bitch I look like an actor\nLearn it from my brother, now the money comin' faster\nI be scheming and rapping like I'm an activist\nGet the cheese I be stacking it\nAll you lame's you be lackin' it\nBitches cannot come back from it\nMoney I be attacking it\nImma be getting chicken and grammies while you still rationing\n\n[Chorus]\nI be with my gang\nShined up with my crew\nDon't give a fuck 'bout you\nI do what I do, HOHO!\nI be with my gang\nShined up with my crew\nDon't give a fuck 'bout you\nI do what I do, HOHO!\n\n[Verse 2]\nYeah, I just got that new thing\nAll black fit like I'm Bruce Wayne\nIced out like I'm 2 Chainz\nAll I-All I-All I want is that puntang\nRunning up the money, that's the cash (Ay)\nI've been on this shit, can't turn back  (Ay)\nYou switching lanes, you a cat (Ay)\nRun it, Run it, Run it back (Ay)\nYeah, I just got that new thing\nAll black fit like I'm Bruce Wayne\nIced out like I'm 2 Chainz\nAll I-All I-All I want is that puntang\nShawty call me Disney 'cause my diamonds always frozen\nIcy ass wrist, that's why your bitch already chose up\nRolling with my brothers and you know we finna go up\nSleazy Japanese boy, I'm a fucking shogun\n\n[Verse 2]\nI be with my gang\nShined up with my crew\nDon't give a fuck 'bout you\nI do what I do, HOHO!\nI be with my gang\nShined up with my crew\nDon't give a fuck 'bout you\nI do what I do, HOHO!\n\n[Outro]\n(HOHO!\nHOHO!)\nIt's Seiji, baby"}], "artist": "​lil ricefield"}