{"artist": "B-Real", "songs": [{"album": "The Gunslinger Vol. 1", "title": "Motivation", "lyrics": "B-Real\nWhen options are few, and opportunities fewer\nThey treat you like manure so you feel you got no future\nYou feel left out and overlooked\nNow its the same story with a different book\n\nThey said I'd never make it hey, but they were sadly mistaken\nI tried to use the hatred to rake in the dough that I'm making\nI never look back, but I can feel their envy upon me\nI'm an outsider but I ain't gonna do it for money\nImma do it for my family and for those who believe\nNot these fake cats who come along when goals are achieved\nWhen you got nothing they gone, they turn off their ringer\nBut when you're on top they'll be here at the snap of a finger\nI wish it was different but that's only wishful thinking\nIt takes all you got to go after the shit that you dreamin'\nAnd if you let them get in your way, you got no one to blame\nThey treat you like a lame and they don't even see you the same\n\n[Chorus]\nWhat are you searching for?\nWhat do you need in life?\nWhatchu willing to do to succeed in life?\nWhats your destination?\nWhats your motivation?\nWhat you celebratin'?\nAll your time is wasted\n\nWe have ambitions to makin' something out of nothing from dark places\nThe streets embrace us you can tell by the look on the faces\nBeen through it all so don't ever think that you can get over\nHit me with your best 'cause I'm sportin' the heart of a soldier\nSome say a rebel, a trouble-maker,a bad example\nWho's head ain't level. they wanna see my hood show cancelled\nThey can change the channel, they just gimme ammo\nThey gettin' nervous I can see them smoking the camels\nI fought more battles when the loser keep movin' to prosper\nFuck a Grammy, maybe one day I'm winning an Oscar\nYou can hate me after let you hear the laughter\nIts just another chapter you can feel it in my stature\nI'm tryn'a feed my fam, and give them something different\nSo they dont ever have to put on my shoes and relive it\nThey asked me how I did it, I say ignore your critics\nAnd pay your dues, and to your dreams you have to be commited\n\n[Chorus]\nWhat are you searching for?\nWhat do you need in life?\nWhatchu willing to do to succeed in life?\nWhats your destination?\nWhats your motivation?\nWhat you celebratin'?\nAll your time is wasted\n\nLIFE is a game that we haven't got mastered\nAnd no matter whos playing you just have pick up the action\nAnd we taking the chances every single day that it passes\nTalkin to the masses doesn't make a difference to\nWe in it together if we look beyond our colors\nWe only tryn'a feed our family and take care of our mothers\nBut we kill each other for nothing then society wonders\nHow they can keep us down forever being fair to our brothers\nThis ain't no way to live, we' lookin' for a change in the system\nWe got a ways to go, but they just gotta stay on the mission\nIts a struggle and you feel you're in the eye of the storm\nBut if you make it through, there's no stop in the path that you're on\n\nChorus", "image": "https://images.genius.com/a62c5a7a2bd35606ac0c14c7e2ef2ba4.799x799x1.jpg", "year": null}]}