{"songs": [{"title": "Crossover", "album": "Real Talk", "year": "2004-05-20", "image": "https://images.genius.com/68e8189b3197c1baa63304483bb572c9.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYou can find me in the Church\nFocused and alert\nNo suit and tie\nJeans and a t-shirt\nI'm into praising God\n'Cause He made us out of dirt\nAnd plus He gave His life\nFor this world's evil works\nSo flirt with that\nMost of y'all can't jerk with that\nCause it ain't no benefits and no perks with that\nStill gotta live your life on this earth with that\nBut we live eternally and I can work with that (holla)\nYeah I cheated, yeah I lust within\nBut guess what, that's why I trust in Him\nSee you thinking that you ain't that bad\nYou just lying to yourself playboy\nYou better check your health\nWhile you all about the cash and ice\nHope you ready for change\nYou just broke the first commandment twice\nAnd I know that you done stole before\nIf it wasn't a gun, it was some gum from the grocery store\nIt's all sin to God, man look into God\nYou guilty, you ain't even a friend to God\nSin gotta high price, it'll cost your life\nBut God fit that bill on the cross with Christ so\n\n[Hook]\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\n\n[Verse 2]\nI don't catch the Spirit, I'm all filled up\nI can't lose it either, I'm all sealed up\nAnd you can bet your life, I'ma rep for Christ\nOne taste, He'll get you right\nFolks is, thinking they Christian, but when they sinning they don't Feel the conviction that the, Spirit is giving, and they\nKeep living life like, that's cool with me, y'all people ain't fooling me\nTry to play me to the left like I'm trying to get deep on em\nThis is real talk dawg, you better peep something\nThis ain't that philosophic rap like homonym, and I ain't talking about the God you heard about from mom and them\nPut that blunt out dawg, put down that Heineken\nMan God understands, what? Come again?\nI guess you think that God is kinda like yo momma huh?\nLike He ain't even tripping on your sinning and your drama\n\n[Hook]\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\n\n[Verse 3]\nLife's way more then ice and rims\nAnd you don't make enough to pay the price of sin\nAnd God's gon judge you dawg, that's reality\nSaying you don't believe is like saying there ain't no gravity\nThen running off to go jump a cliff\nAnd when you hit the ground tell me what you get?\nWhy you running from the freedom of the gospel?\nYou hostile, you looking like you're Lucifer's apostle\nBut God got you, and though we all deserve death\nHe still keep putting breath in your nostrils\nBut you treat Him like an obstacle\nSee Him come at your convenience like a Stop-N-Go\nWaiting for a sweeter deal or a sign or something\nLike God ain't come down and die or something\nTrust me dawg, God wants the best for you\nThat's why the gospel of Christ is addressed to you\n\n[Hook]\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\nCrossover\nFrom death to life\nWhat's the hold up\nAccept the Christ\nWe flex the mic to rep for Christ\nSo we can put your soul at rest tonight\nCrossover"}], "artist": "Lecrae"}