{"songs": [{"year": null, "album": "Allow Me To Re-introduce Myself", "image": "https://images.genius.com/3b2283d9008265c54952b9dadead1160.360x360x1.jpg", "title": "Mr. Parker", "lyrics": "[Verse One]:\nI'm from a city where the go getters get that gold quick\nAnd get that gwop and lay both money and the chicks\nNobody has a monopoly over Grindin'\nSome people pull the clips out with no rhymin'\nThey the pushers but I don't have Malice though\nThey smoke everything without touchin' the chalice though\nI tried to give a damn, ain't nobody want it though\nSo I held on to it and took it personal\nI lived around crack dealers and preachers\nStreet graduates becoming the teachers\nPoliticians talkin', they couldn't reach us\nSo we becoming the six o'clock features\nDon't study me\nYou won't graduate\nBut my life's good money, you can't tabulate\nGet that doe, but hold your head high\nA piece ain't enough we deserving the whole pie\n\n[Hook] [Shi Wisdom]:\nDear Mr. Parker you made me this monster\nCause what don't kill me makes me strong\nAnd I decide where I belong\nDear Ms. Mahalia, got something to tell ya\nIf they never made you, they can never break you\nJust remain the real truth, you decide your fate\nGo on\n\n[Verse Two]:\nIf you can't take the heat, then why you got your hand out?\nIn Hell's Kitchen, the regular never stand out\nIn high school they told me I wouldn't be nothin'\nWouldn't make it out the turf, wouldn't see nothin'\nThey saw my gang and made up they mind quick\nBut I would never let the evil in their minds stick\nFurther more, some of the hoodlums I ran with are doctors and lawyers\nTrick, I hope you feelin' it\nWatchin' us on television with your daughters\nSay cheese girl, wave to your father\nWhile his life is Welcome Back Carter\nI'm at the ACC with Shawn Carter\nBackstage thinkin', \"Look at my life now.\"\nI done did good got a house in a white town\nJust so that whenever them white folks talk\nThey gotta respect the rapper who bought the whole block\n\n[Hook] [Shi Wisdom]:\nDear Mr. Parker you made me this monster\nCause what don't kill me makes me strong\nAnd I decide where I belong\nDear Ms. Mahalia, got something to tell ya\nIf they never made you, they can never break you\nJust remain the real truth, you decide your fate\nGo on\n\n[Verse Three]:\nThe teachers got the kids from nine to three\nBut we got 'em 24/7 in they I.P.O.D\nSo respect my P.O.V\nWhen I'm fillin' their ears with love, that's on me\nSee the driver in the fancy car, that's on me\nBut it is only a fraction of who I be\nNever leave my Common Sense like No I.D\nWhat my daddy taught me got me into V.I.P\nYou see\n\n[Hook] [Shi Wisdom]:\nDear Mr. Parker you made me this monster\nCause what don't kill me makes me strong\nAnd I decide where I belong\nDear Ms. Mahalia, got something to tell ya\nIf they never made you, they can never break you\nJust remain the real truth, you decide your fate\nGo on"}], "artist": "Kardinal Offishall"}