{"artist": "King T", "songs": [{"image": "https://images.genius.com/4ecadf00855c55fe49bd112852218051.704x704x1.jpg", "title": "Triflin’ Nigga", "year": null, "album": "Tha Triflin’ Album", "lyrics": "{*opening skit: man talking to girlfriend in car*}\n[M] You won't have to worry about anything when you're with me\n[M] cause I'm.. (?) reliable (?)\n{*while he's speaking, thug runs up and opens his car door*}\n[T] Nigga WHASSUP nigga? Get out the car nigga!\n[T] Give me your jew-els, fool!\n[M] What, what do you want from us?\n[T] You and your BITCH, nigga!\n{*car door slams*}\n[T] Get out here.. nigga you better get off this motherfucker punk\n[M] Look.. look out baby\n[M] I'm not givin up anything! You're just gonna have to..\n{*gun blasts*}\n\n\"Screamin!\"\n\n{*second skit: argument between thugs over money*}\n[1] Where my motherfuckin chips at nigga?\n[2] Yo homey I already told you nigga I'd have it Friday nigga\n[1] Man FUCK what you told me nigga!\n[2] WHAT?! Nigga, fuck you motherfucker\n[1] Nigga what's happenin then nigga? Nigga!\n{*beatdown starts*}\n[2] Awww shit!!\n{*beatdown continues*}\n\n[King Tee]\nI gotta leave this crazy place, but my feet won't budge\nThe niggas always ask am I a Crip or a Blood?\nI am what I am and that's all I can stands\nI can't stands no more so I'mma scram\nSell me a couple of ki's and buy a crib far away\nA place that the map don't say\nCause I'm gettin kinda timid, at first I was with it\nTalk about jack moves, I did it\nI took cars, snatched jewelry, and boy I'd run\nWith the colored rag over my gun\nAnd there was times I had to pop fools {*BLAM*}\nBecause they didn't believe that the Glock rules\nWhen I say get out, get out! And I might not shoot\nThen I'm off to put your Dayton's on my Coupe\nBut nowadays I have to figure\nWhat goes around comes around for the triflin nigga\n\n{*third skit: G's discussing a hit*}\n[1] There the nigga!\n[2] Nigga nigga fuck that, I'm gonna shoot this nigga right here\n[2] Man, watch this\n{*gun being cocked sounds*}\n[2] I ain't got time to be playin with this motherfucker nigga\n[2] Show this nigga what time it is nigga\n[1] Yo yo hold up\n[2] Nigga watch out nigga\n[1] Come on man\n[2] Nigga watch out nigga {*incomprehensible*}\n[2] Fuck that nigga man, fuck that nigga\n[1] We don't need to get indicted\n[3] Yo yo the nigga got a gat!!\n[2] Nigga fuck that nigga nigga! Nigga FUCK that nigga!\n[2] Nigga FUCK THAT NIGGA!\n{*BLAM! BLAM! BLAM-BLAM-BLAM!*}\n[2] NIGGA FUCK THAT NIGGA!!\n\n[King Tee]\nBack in the days I used to stand on the block with my box\nWatchin my boy run up to cars and sell rocks\nHe was young and bold, lot of money and gold\nKept a gat on hold in case suckers tried to roll\nA car stops, he trots, yellin here comes the cops\nHe's only sixteen, but he's braver than his pops\nHis mother and father, smoke crack like I drink brew\nSurvival's on his mind so he serves them too\nSchool isn't important, he's importin big packages\nAcross the border, a little shorter than a million quarters\nAll the women ride his jock like a jockey\nHe says \"I'm on top, there ain't a cop who could stop me\"\nBut confidence, is his best defense\nAt night he carries a gauge he fit inside of his trench\nHe says \"A punk try to run up, I'mma pull the trigger\"\nWhat goes around comes around for the triflin nigga!\n\n{*fourth skit: a drug deal in progress*}\n[1] What's happenin man you got those birds?\n[2] Yo you got the money homey?\n[1] Aiyy man whatchu gonna ask me somethin like that fo'?\n[3] Look man, fuck all the bullshit\n[1] Man here you go right here man\n[2] Show the money dawg\n{*briefcase is opened*}\n[1] Nigga, there you go, so what's happenin?\n[?] I like that, we in business\n[?] Man - fuck you nigga, this is a jack, it's a jack nigga\n[?] Always gettin him, hey what's up?\n[2] Nigga, strip down, get butt-naked nigga\n\n[King Tee]\nI heard one-time wanna peel my cap\nFor the gangster rap to make niggas start fightin back\nBut I don't even give a fuck\nPass the AK, and one-time better duck {*automatic fire*}\nCause I don't give a fuck about a piece of tin\nI [*scratch*] shit off your chest and then grin\nAnd move on to the next motherfucker\nCops ain't nuttin but the Klan undercover\nAnd they be lynchin motherfuckers up nightly\nThat's why they need mo' motherfuckers like me\nTo stand on the scene and pull the [*trigger*]\nCause I'm a triflin nigga\n\n{*fifth skit: passengers in a car*}\n[1] Yo yo, yo they got the lights on, that's the cops\n[2] Aww god damn!\n[1] Pull over!\n[2] Y'all just chill out, y'all just chill out, y'all just chill out\n[2] Chill out alright? Here he comes, here he comes\n[C] Can I see yer driver's license registration and proof of insurance?\n[2] What did I do officer?\n[C] Get get your hands on the wheel!\n[2] Man what did I do? What you talkin about?\n[1] Man fuck that nigga man\n[?] Blast that motherfucker, blast him!\n{*BLAM, BLAM BLAM BLAM, BLAM*}\n{*car peels out and takes off*}"}]}