{"songs": [{"image": "https://images.genius.com/89026ea1dc7518eef373c3891314768f.300x300x1.jpg", "year": null, "lyrics": "(Ali)\nC'mon, oooooooooooooooooooh, no, yo\n(Just the north, south, east, west coast and us)\nHey, uh, it's Lee I'm amazin', original Asian\nLime blazin' hatin'll get you nowhere, but get me\nHotter than Cajun, spontaneous combustion\nMy temperature's raisin', nigga for days and days\nMinutes I was just I been waitin'\nFrom a shine, to reduce your regrimes\nDimes to raisins, you talkin'\nMe? Naw naw player I'm sparklin'\nStraight up parkin', hoppin' out with a Eagle barkin'\n(Pop pop) Money, my car chop chop\nHot spot for the jewels, man I'm keepin' the Glock\nYou might get popped, I'm good ain't no duckin' the dot\n2000 number J truck mansion and yacht (Ooooh!)\nI say like uh uh (Ooooh!) I say like uh uh\nShould let you know, I'ma bring it really raw\nIt be like pat-b-b-b-b-b pat-b-b-b-b-b really raw\nCome again now\n\n(Chorus: Ali)\nHey! Hey! Ore-ore-ore-ore-o\nIf you real, let me hear you say\nHey! Hey! Ore-ore-ore-ore-o\nIf you all about your paper then you say\nHey! Hey! Ore-ore-ore-ore-o\nIf you real, let me hear you say\nHey! Hey! Ore-ore-ore-ore-o\n(Just the north, south, east, west coast and us)\n\n(Ali)\nI need a trillion dollars for every breath I take\nFor heaven's sake, just to keep righteous food on my plate\nAnd I'm gon' get it, whether it be rap-rockin' if not\nIt's back to crack-poppin' out the back of the barbershop\nNo holds barred, back streets to boulevards\nGain way, throwin' house parties in the PJ's\nCars square village, love joy lane\nBuddha 88 man it's still the same\nI can't complain, I know niggas that lost they brain\nGot they chest removed, straight vestibules\nDon't test a fool, who ain't got shit to lose\nThat ain't cool, now he gotta rep off of you\nThat's why I stay to myself, stay alive and teach\nPuff that oohwee and keep the snub-nose in reach\nI ain't a thug, so nigga I ain't gon' start that now\nI'm Mr. Nigga that kept work and carried the four pound\n\n(Chorus: Ali)\n\n(Ali)\nYou want to feel made? Roll with me for a day\nExcursion weight, absolutely splurgin' way\nOkay first, my team a hundred deep at least\nRespected highly on the street\nCause we don't start no beef, in the club\nMurphy suede, human grenade\nAnd some handmade, hide the haze\nBehind the Cartier Rolls tinted\nE'er word I speak I'm in it\nHip hop; we in it, from now until infinite\nWe like ten foster kids bringin' daddy business\nWe turn the heat up to Tae-Bo in the club we post the Guinness\nWe had the guard spook one of my gods then broke loose\nHad to buck a clown, too much Crown with no juice\nIcy noose, bluey suit outside cute\nInside room ugly as a pea-green suit with ruffles\nWe fold up chairs in a tussle\nOutside we gon' put somethin' harder than muscles\n\n(Chorus: Ali)\n\nHey! Hey! Ore-ore-ore-ore-o\nHey! Hey! Ore-ore-ore-ore-o\nHey! Hey! Ore-ore-ore-ore-o\nHey! Hey! Ore-ore-ore-ore-o\n(Just the north, south, east, west coast and us)", "title": "Ore-Ore-O", "album": "Heavy Starch"}], "artist": "Ali Jones"}