{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/da732ae2fff001033c5054aeffc0ef78.1000x1000x1.jpg", "title": "Faith Healing", "year": "2015-11-26", "album": "O.K. ", "lyrics": "[Verse 1: Amaze 88]\nDrinking Modello, concerned about the concerto\nWhere is my oboe? Got lyrics by the boatload\nGot beats like you don’t even know, though\nCouldn’t copy my steez even if you worked at Kinko’s\nI think, though, faster than you think, though\nMake moves faster than Plinko, slap the bass\nBlow the horns, and it ain’t safe, rough patch\nNo time for a nap, my mind gone\nSpeeding through traffic, pass all the hasslers\nLike, [?], peace to [?]\nThe world didn’t have to do that to you, you drop dimes like a stitch\nI drop dimes like I’ma make you rich\nHere’s a plan, stay out of my way\nAnd I’ll put the whack to sleep like tryptophan\nStay out of my way and I’ll change the game\nNow, how’s that for [?], mane?\n\n[Verse 2: Kool A.D.]\nAyo, spit ‘em, boy\n[?] zooted\nToo stupid, Amaze 88\nThe dude looped this, same hand that he hoop with\nCount the loot with, steer the coupe with\nBro, we in the building and we near where the roof is\nYo, I appear where the truth is\nSee how the fear drink the juices\nOf the soul\nThe foolish wanna know all the boolish details\nWhile others cop it wholesale and move it retail\nAnd drown they sorrows in the coochie and females\nI burn like the grooviest trees\nMailed to me through indubious means\nWait, what’s indubious mean? Scratch that\nMake it dubious means, man, this doobie is mean\nMan, it’s truly obscene how I move through unruliest dreams\nAnd I truly come clean\nLike [?] did, I’m nice when I do this\nI’m twice more than too sick, that’s like four\nYou nice? I’m nice more\nWe eating, mane\nLike we just ran up inside the rice store\nMore shine than an ice store, get your mind right\nGet aligned with the life force, ain’t nothing sweet\nLike diabetes, type 4, that’s my word\nYo, the fuck I gotta lie for?\nWe major, you minor, sucker"}]}