{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/00182a249cf80a48b47ce8eb29bcc329.1000x1000x1.jpg", "title": "Dead Time", "year": "2013-12-26", "album": "Project Baby", "lyrics": "[Hook]\nI'm running now, I'm on dead time I might kill the clock\nI'm wondering why my niggas ain't my niggas now\nCause I'm rocking beats and I shift the streets and put the pistol down. I cropped me out lil Kodak see the big picture now\nI ain't jackin now I'm rappin now\nI'm bout business now\nI love yall on the rap way to the different route\nYou ditching now, you tripping out, you dissin now\nYou switchin out\nI get it now\n\n[Verse 1]\nOh dat body is in the air\nI feel it now\nYou speak in bad, you really mad\nMy ticks tocks\nBoy you different niow heard you bang a whole nother clique now\nI got my deposition, you said I did it you snitchin now\nWen u see a G don't speak to me put ya head down\nYou tellin now you bail in out\nNo bail bond\nI moved on, ion do the shit that I used to do\nI'm rappin now fuck nigga don't make me do you\nWhy my niggas ain't my niggas like they used to be?\nAnd I got niggas show in moe love now, who're new to me\nDon't call me now I'm ballin now you out da game\nI see it clear, I cropped us out u out da frame\n\n[Hook]\nI'm running now, I'm on dead time I might kill the clock\nI'm wondering why my niggas ain't my niggas now\nCause I'm rocking beats and I shift the streets and put the pistol down. I cropped me out lil Kodak see the big picture now\nI ain't jackin now I'm rappin now\nI'm bout business now\nI love yall on the rap way to the different route\nYou ditching now, you tripping out, you dissin now\nYou switchin out\nI get it now\n\n[Verse 2]\nI can't believe you tattle told on me, the rules, the combination, you hacked da code on me\nLike icee. FREEZE you went cold on me\nYou sold your soul, paper sheets\nBruh you fold on me\nI was blind but now I see\nI feel bad nigga let me be\nI'ma g, you ain't cut like dat\nI bleed these streets\nBut now Ima rock these beats\nI ain't runnin in no stores nigga I promise, I got my deposition, you told Bruh I saw it\nAnd nah you ain't my nigga no more get from round me\nAnd don't say shit to me no more nigga be quiet\nAnd I can't believe my niggas actin like my hoes now\nThey on my instagram they steady watchin my profile\n\n[Hook]\nI'm running now, I'm on dead time I might kill the clock\nI'm wondering why my niggas ain't my niggas now\nCause I'm rocking beats and I shift the streets and put the pistol down. I cropped me out lil Kodak see the big picture now\nI ain't jackin now I'm rappin now\nI'm bout business now\nI love yall on the rap way to the different route\nYou ditching now, you tripping out, you dissin now\nYou switchin out\nI get it now"}]}