{"songs": [{"album": "All 6's and 7's", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg", "year": "2011-06-07", "title": "Am I a Psycho?", "lyrics": "[Intro: Tech N9ne, Hopsin & B.o.B]\nI see you looking at me\n(Psst, hahaha, over here)\nLooking at me, so I ask\n\n[Hook: Tech N9ne, Hopsin & B.o.B]\nAm I a psycho?\nAm I a psycho?\nYeah, I’m a psycho\nI guess I’m a psycho\n\n[Verse 1: Tech N9ne]\nYou’re crazy! I like you, but you’re crazy\nMy tours paid me, so I used that dough to allure ladies\nTo manure bathe me\nNever that, my mind's for sure shady\nPure Hades, Rev X said that he couldn’t endure to save me\nWhy do I let this stripper burn me on my arm with a cigarette in the same spot ten times in a row?\nWhen I felt that burn, I palm the clitoris, I'ma get her wet\nSorry to get carried away\nI feel stupid 'cause I ain’t did her yet\nMaybe she never let a fine nigga stare at her breasts\nI get vexed so N9ne bit her neck\nOpen! I try to contain it, but that dame thang’s soakin'\nAlter ego say: \"Why you let them gangbang folk in?\"\nStrange Lane hopin' I can maintain copin'\nBut ain’t nobody talkin' when the insane mane spoken\nI like fire on my skin, blood on my draws\nFrom up on her walls, I’m sufferin', I’m stuck in her claws\nStuffed in her jaws, huffin' and puffin', hollerin', I'm a dog\nAfterwards I like really hot scaldin' water on my balls\n\n[Hook: Tech N9ne, Hopsin & B.o.B]\nAm I a psycho?\nAm I a psycho?\nYeah, I’m a psycho\nI guess I’m a psycho\n\n[Verse 2: Hopsin]\nMom? Dad? I’m no longer the boy you're used to seein'\nI’ve changed a lot, plus I’ve grown to hate every human bein'\nMy mood swings have now turned\nMy dreams into gruesome scenes\nNow I’m doin' things I don’t normally do when illusion seem\nTo be the only pleasures I can gain\nHeck, if I was sane I would've put down the mic\nAnd said, \"Fuck it, I'll never rise to fame.\"\nBut with the wicked wreckage I contain\nI could probably jeopardize your name\nNo lovey-dovey, let’s ignite the flame\nIf you’re lucky you'll survive the pain\nSorry, that ain't very merry to say\nWhy is this game so scary to play?\nWell, let me think, 'cause every day\nMy balls are gettin' too hairy to shave\nPause a minute, I'm stressin' again\nIf I go to Hell, then Heaven's to blame\nI don’t mean to come off crazy\nBut you mothafuckas seem to think I’m hella deranged\nWhen I was seven years old\nI fell on my head and I severed my brain\nYou think I’m lyin'? Then ask my mama\nNigga, she'll go tell you the same—\nShould I be ashamed? No\nI’m livin' my life so ghetto fabulous\nBefore you get bent out of shape\nMy nigga, let me ask you this\n\n[Hook: Tech N9ne, Hopsin & B.o.B]\nAm I a psycho?\nAm I a psycho?\nYeah, I’m a psycho\nI guess I’m a psycho\n\n[Verse 3: B.o.B]\nI stab you with this mic, and rap this verse I'm rappin' to you\nMatter of fact, I’m rappin' through you\nNever say my motherfuckin' name\nUnless you absolutely have to\nI am not no fuckin' jacket with no matchin' shoes\nAnd you are not no fashion guru\nCan’t even see you niggas, y'all wish I was rappin' to you\nMatter of fact, act like I'm rappin' to you\nIf that gives you passion to use this as an excuse\nThen just jump up out of conclusion\nThat I'm attackin' you dudes; it's just like old-fashion voodoo\nY'all ain’t even the shit, no, y'all ain’t even the doodoo\nI got more flavor on the tissue paper under my two boots\nSo I’m slappin' you fools with wooden paddles, you stupid\nBabysittin' little bastards like little afternoon children\nYou can call me psychotic, but it’s more like schizophrenic\nAnd I can't sleep, can anyone tell me\nJust where my medicine is?\nGuess I gotta show these minors just what my avenue is\nMan, I swear I'm all about my brain like graduate students\nI'm sorry, I didn't mean to hurt your feelings\nI see your tears, come here, give me your face, let me clear it\nBut I wonder how it would look\nIf I were to peel it back with a skillet\nThen I'ma feel it crack when I hit it\nThen I'ma split it back when you heal it\nDamn it, Bobby boy! What in the hell?\nWhat in the heaven? What in the Earth?\nWhere is your mom? What are you, cursed?\nWhere are you from? Where was your birth?\nWhere was you first? Why weren’t you in church?\nWhy is there dirt all on your shirt?\nMan, I think that you’re goin' berserk\n\n[Hook: Tech N9ne, Hopsin & B.o.B]\nAm I a psycho?\nAm I a psycho?\nYeah, I’m a psycho\nI guess I’m a psycho\nAm I a psycho?\nAm I a psycho?\nYeah, I’m a psycho\nI guess I’m a psycho"}], "artist": "Tech N9ne"}