{"artist": "Vanilla Ice", "songs": [{"title": "Unbreakable", "year": "2001-10-23", "lyrics": "[Hook]\nDarkman\nV-Ice\nTrust me ain't nothing nice\nHardcore\nMy dog's unbreakable like dice\nHardcore\nMy dog's unbreakable like dice\nHardcore\nMy dog's unbreakable like dice\n\n[Verse 1: La the Darkman]\nI've been in bloody pictures\nIll as Hitler back in Germany\nKid's think they're burning me\nYou really ain't concerning me\nKing B hold a Mack 8 plus 3\nAnd I draw rhymes fast as Zorro draw that Z\nDraw guns - fast as white boys on TV\nYou can't fuck with me! Trapper conti\nWarfare my clan specialize in putting cats in\nWheelchairs\nPack a .38 Snubnose name brand clothes\nWhat's money to my clan was death to my foes\nThat's how it goes, My Niggas is gung-ho\nGod advocates sniping weak rappers with a crossbow\nStay on the low with a M-16 flow\nIn the Benz with a dime bitch, puffin hydro\nI'm CEO you're TKO, John Doe\nMy raps is like cheap keys straight from Mexico\nYo, I flow like a UFO, All-Pro\nRich kid, get my dick sucked in a Tahoe\nWhen I hear a beat it's like putting tims on my feet\nThen run a track meet away from the beats, fuck police\nI run the street with a Mack Milli for rappers who act silly\nCock it back, then smoke a Nigga like a Philly\n\n[Hook] - repeat\n\n[Verse 2: Vanilla Ice]\nI draw my rhymes like a bow\nShoot 'em out like an arrow\nSwooping on suckers like an eagle, not a sparrow\nWalk a wide path, never ever walk it narrow\nStep on stage with funky hip-hop apparel\nGot the funky rhymes sometimes they leave you scared bro\nIt's like looking down a shotgun barrel\nHardcore\nRuns through my veins like cocaine\nV-Ice, In your brains like bloodstains\nPsycho!\nWhen I step to the mic, bro\nYou know the Ice'll do it right, what I'm saying is \"Yo\"\nSuckers fronting what you wantin is for me to fade!\nThought I was outta here, I ain't going away!\nBack with the track, I keep my bank fat\nYou know I got the flavor for the funky format\nYou're not giving up, the credit I seek\nDarkman's in the house he's ready to creep\nNow what you gonna do\nWhen my boys are on you\nYou know a hard head makes for a soft shoe\nNow crank it up for your passenger - LOUDER\nCause it's the thrilla killa, I bring this hardcore hour\n\n[Hook] - repeat\n\n[Hook] - repeat", "album": "Bi-Polar: Bomb Tha System", "image": "https://images.genius.com/a16d4d55e67b3b23d045b99ddb30bd72.220x217x1.jpg"}]}