{"artist": "Ace Hood", "songs": [{"title": "All The Way G", "album": null, "year": "2016-05-11", "lyrics": "[Hook]\nI respect it like a real OG\nFew racks and the gun on me, I keep that shit on me\nWhy these lames wanna shit on me? Wanna see a nigga RIP\nKeep it all the way G\nI'mma do it like a young Ali\nYou know the boy don't need ID, I do it BIG\nI thank God everyday I see\nI keep it all the way G\n\n[Verse 1]\nI'mma shine cause I know they mad\nMiddle finger, tell them kiss my ass\nWhen I was on my last, they was talking 'bout the boy so bad\nYou know damn well that shit won't pass\nNever trip on that, young nigga had to jump right back\nReal niggas know that this all facts\nI gotta keep my strap, sick and tired of being stabbed in the back\nFor the cheese, gotta feed to the rats\nI was only 18, 100 G's, in that brand new 'lac\nTold my city that I'd be right back\nI just can't relax, fuck that, ain't cut no slack\nFuck a defense, I run through sacks, I got my mojo back\nHood Nation, the time is now\nHeard some people tryna calm us down, I want them commas now\nGood Lord, man this dough's allowed\nThink it's funny when them hoes around\nAll this ice on my neck and my collar\nHad a dream and a dollar, never seen as a scholar\nShit, more money, more problems\nCame with a crazy baby mama\nDon't really get no sleep\nI been up late thinking of the ways to eat\nCause my team and my kids, they depend on me\nI depend on them, we depend on us\nGot me riding through the city, only God I trust\nCame a long way from my mama driving a bus\nCouldn't name 'nother niggas that was louder than us\nName ring in my city in case they calling a bluff\nAs I walk through the valley and the shadow of death\nTryna squeeze all the juice outta life itself\nHad to get this shit right at the time I left\nThey don't wanna see you win, you can save your breath\nOn a motherfucking mission of redemption\nThe devil calling and I'm tryna resist it\nI gotta smile every time I see the wrist lit\nThey tryna shut a nigga out, I been a misfit\nI been praying, praying, praying, praying\nHennessy and kush demand\nOut by the live show\nAce why you never by them rap gods?\nHow you never in the media? You mad underrated\nWhen them suckers nigga really gon' realize?\nI'm just a different breed\nAin't no in between\nI'm the quiet type\nFlow on a dope pipe\nShining like a strobe light\nI won't roll back\n\n[Hook]\nI respect it like a real OG\nFew racks and the gun on me, I keep that shit on me\nWhy these lames wanna shit on me? Wanna see a nigga RIP\nKeep it all the way G\nI'mma do it like a young Ali\nYou know the boy don't need ID, do it BIG\nI thank God everyday I see\nI keep it all the way G, nigga\nI respect it like a real OG\nFew racks and the gun on me, I keep that shit on me\nWhy these lames wanna shit on me? Wanna see a nigga RIP\nKeep it all the way G\nI'mma do it like a young Ali\nYou know the boy don't need ID, do it BIG\nI thank God everyday I see\nI keep it all the way G, nigga", "image": "https://images.genius.com/b44b8aa922dfa0fdc208eae592cb39d5.650x650x1.jpg"}]}