{"artist": "Webbie", "songs": [{"year": null, "lyrics": "Wassup wassup wassup\nTurn it up\nWebbie\nTrill E-N-T. Young Savage\nJust some gangsta shit for the gangstas to ride to\n\n\"Damn mane, what you don't fuck with a nigga no mo? \"\nDon't even come at me like that!\n\"Damn nigga, Webbie, where you been at? \"\nOut here gettin rich nigga. Fuck out my face\nI'm a fuckin hustler nigga, I ain't got time to be playin nigga, I'm tryin get it\n(I'm tryin to do somethin.)\n\nCheck me out, Look\n\n[Verse 1:]\nNow I'mma tell you like a man, I don't owe ya'll shit\nAnd I'm gonna say this shit again\nI don't owe ya'll shit\nBut before a nigga had somethin, (shitt)\nI ain't have nothin (my kids)\nYeah they still love me (friends)\nI had a couple of em\nWasn't nobody fussin, tryin to see what was up\nWhen my shoes was been dusty, with a hole in the front\nAnd I'd get mad at Lil Slugger, he put a hole in the blunt\nWhen my daddy lost the house, moved with grandma for a month\nThen that month turned into a year\nAnd I turned strait to them streets\nThen my dog gave me that b\nI turned the shit to that heat\nThem school fights turned to that beef\nAnd we was gon fall for that street\nThen my nigga turned to that piece\nI ain't seen him since I was 13\nI get home and catch my knees\nThis rap shit was just a dream\nWasn't nobody mad at me tellin me about how I need to come see em\nI ain't have a car, I just need some new rims\nJust tell ole boy he just got a new Benz\nMy daddy used to tell me that I needed some new friends\nI guess back then, it just didn't make sense\n\n[Hook:]\nNow come on\nKeep it trill\nYou been knowin me since I was lil\nAnd you ain't even take me serious mane that's why a nigga feel like (You a Trip!)\nHow you be trippin (You a Trip!)\nI be trippin (You a Trip!)\nHow I be glistenin (You a Trip!)\nIt's a trip over postiton (You a Trip!)\nIt's a trip how you miss me (You a Trip!)\nNow don't take it wrong and think I'm trippin cause I'm on\nBut um really you can go on and leave me the fuck alone (You a Trip!)\nHow you be trippin (You a Trip!)\nI be trippin (You a Trip!)\nHow I be glistenin (You a Trip!)\nIt's a trip over postiton (You a Trip!)\nIt's a trip how you miss me (You a Trip!)\n\n[Verse 2:]\nI had to tell lil nigga from the club\nI'm still the same nigga from the mud\nSo watch how you be runnin up questionin me about stupid stuff\nI'm well known from the boot and up\nDon't come up to me with that bootin up\nMane how I been movin up\nI really hate to have to go and shoot ya up\nIn just 2000 I was ridin a bus\nShow up at school, get expelled, fuck it\nI'm out here, If I go to jail, fuck it\nDidn't this many people care for me\nNow a nigga rich you is there for me\nAnd I owe you this and I owe you that (What?)\nYou not nothin till you got somethin, everbody love ya\nPops told me that\nNiggas ain't shit, life showed me that\nThey done stole from me\nThey done hold me back\nYou round here actin like hoes would act\nTell me how I'm supposed to act\nI see yo ass, be yo ass\nComin up, I ain't barely see yo ass\nTryin to be me, be done beat yo ass\nHard head, make a nigga teach yo ass\nTell you the truth, I don't need yo ass\nAll I really need is my dog fans\nAnd all my people that I feel fam\nThis big Glock 40 and Trill Fam\nYa'll look mad, I'mma steal laugh\nThem new Camaros go real fast\nThey don't come out till \"09\" already got mine\nMan I'm fittin to act a dog now\n\n[Hook:]\n\n[Verse 3: Big Head]\nLook, Big Head the same nigga till he dead and gone\nThe same nigga that wasn't allowed in yo home\nThe same nigga that did that same dirt with that chrome\nThe same nigga that did them same jokestas all along\nWhy would I change now\nJust because the camera's on\nAnd yo girl got my dick in her camera phone\nMane let me do my thing\nI'm in that zone\nYou hatin cause I'm makin and you dead wrong\nWell if you ain't gon kill me\nAin't no stoppin me\nWatch, I get the whole board on Monopoly\nMatter fact, fuck ya'll with a apostrophe\nThat is how you want it\nSo that is how it gotta be\nI probably pop yo ass approximately with 6 slugs\nWhile Turk and Mel buy the judge\nYou got a grudge but remember I don't give a fuck\nWhenever you get mad enough\nTry yo luck!\n\n[Hook:]", "image": "https://images.genius.com/c34737bbafed45ab75562f625e46ec8f.640x640x1.jpg", "album": "Savage Life 2", "title": "You a Trip"}]}