{"songs": [{"image": "https://images.genius.com/369afe88f604eba1cc44f9cb55ac50c7.1000x1000x1.jpg", "title": "I Don’t Know", "album": "AI YoungBoy 2", "year": "2019-10-11", "lyrics": "[Intro]\nWho made this beat?\nAyy, Marc, what it do?\n\n[Chorus]\nPick up, I been calling all night\nI just wan' see where your head at\nI just pulled in front your house inside that Maybach, yeah, yeah\n’Cause if we lovers, why we scared?\nCome jump in, come jump in, pop a Perky, this a 10\nLet's stakeout at the Drury Inn\nWe can fuck in the room and pretend that we on the island\nMake sure our time well spent\n\n[Verse 1]\nI fuck you good and smack your ass like I'm your daddy (I’m your daddy)\nAround the globe, bitch, I got Don Dada status (Dada status)\nWe keep extensions, you want static, let you have it (Let you have it)\nBack to back Addies, mathematics like an addict (Like an addict)\nShe bounce her ass and shake it low, yeah, she get ratchet\nI got extras from the dough, not from the blow, if you could bag it\nStraight out the slums, got marble floors, if I go under, I could stash it\nFull of Xans, tryna catch you 'fore you leave, hope I don't crash it\nAnd I, I got some things I need to change by myself\nI, I seem to start to put that blame on myself\nI'm startin' to think that I bring pain to myself\nSlime, I am me and I am nobody else\nAnd I'm starting to think I been here before\nSeen my grandmom can fit right across the road, oh, oh\nThey would've never known I lived here before\nThe way I pull up in these fancy cars and clothes, 'othes\n\n[Chorus]\nPick up, I been calling all night\nI just wan’ see where your head at\nI just pulled in front your house inside that Maybach, yeah, yeah\n’Cause if we lovers, why we scared?\nCome jump in, come jump in, pop a Perky, this a 10\nLet's stakeout at the Drury Inn\nWe can fuck in the room and pretend that we on the island\nMake sure our time well spent\n\n[Verse 2]\nYou better not play with me\nI won’t play with you, but every couple fight (Fight)\nHublot shining on my wrist and your shit shining bright\nIf 4KTrey the case, it's me and you, shit, we gon' die tonight\nWe bought plenty ammo, plenty guns, we got every type\nThis that Hellcat switching lanes on a bloody night (Let's go)\nNigga snuck him in the club so he had bloody ice (Bet)\nBoom, baow, boom, baow, boom, boom, bitch, that’s right on sight (Bitch)\nYoung nigga loaded, he just hopin' that he see the light\n\n[Chorus]\nPick up, I been calling all night\nI just wan' see where your head at\nI just pulled in front your house inside that Maybach, yeah, yeah\n'Cause if we lovers, why we scared?\nCome jump in, come jump in, pop a Perky, this a 10\nLet's stakeout at the Drury Inn\nWe can fuck in the room and pretend that we on the island\nMake sure our time well spent, yeah"}], "artist": "YoungBoy Never Broke Again"}