{"songs": [{"image": "https://images.rapgenius.com/97d610c58fd0b63b11510c0c4ba85860.500x500x1.jpg", "title": "Between Us", "album": "Mailbox Money", "year": "2014-01-28", "lyrics": "[Intro: K. Camp & Nipsey Hussle]\nYeah (Yeah)\nHah\nThat's right\nYoung Hussle\nWhat? What?\nWhat? What?\n\n[Chorus: K. Camp]\nNigga, I’ma live like it’s my last (That's true)\nYou worried 'bout them bitches we done had (That's true)\nBaby, I’m so focused on this cash (That's right)\nI said, baby, I’m so focused on this cash (Trust)\nShe wanna roll 'cause she see me in that ride (What's up?)\nI ain’t got no time, gotta put her on the side (Nah)\nYou can’t come between it, between it\nNo, you can’t come between it\nBaby I’m so focused on this cash\n\n[Verse 1: Nipsey Hussle]\nLook, VS bezel my Ro', perfected my role\nFocused my mind and got to this dough\nI'm one of a kind, not like what you know\nTrue to my oath, they proud of my growth\nI come from the turf, I doubled my worth\nI made some mistakes, but that’s just part of my search\nThey connect with my words, right at the part where it hurts\nThis life is a bitch, my hand up her skirt\nHad a thirst to get rich, couple stains on my shirt\nEvery reason to fail, but we was makin' it work\nWe was walkin' on water, you could say it was church\nAll this money I’m makin',  every day I’ma splurge\nBoy!\n\n[Chorus: K. Camp]\nNigga, I’ma live like it’s my last (Yeah)\nWorried 'bout them bitches we done had (Ayy)\nBaby, I’m so focused on this cash (That's true)\nI said, baby, I’m so focused on this cash (Yeah)\nShe wanna roll 'cause she see me in that ride (What's up?)\nI ain’t got no time, gotta put her on the side (What's up?)\nYou can’t come between it, between it (Nah)\nYou can’t come between it\nBaby, I’m so focused on this cash\n\n[Verse 2: Nipsey Hussle]\nYeah\nWe on that Clicquot and kush, all yo buttons, I push\nWe pull up in that Benz, all them pictures they took\nPaparazzi gon' flock, that's 'cause both of us hot\nAin’t no limit like Percy, but we like Jada and Pac\nLet’s invest in these stocks, let’s vacate on these yachts\nLet’s go chill out in Bali, let's make a tape and let’s watch\nLet’s buy two of those watches, let’s go do it on Collin\nLet’s fly out to Atlanta, you play that role, got you poppin'\nI fuck wit' yo style, you should be somebody stylist\nEvery time we have sex, you makin' noises the loudest\nFaces you makin', paper I’m chasin'\nIf I make you my girl, you ask if I could be faithful\nI’m stuck to these streets, I'm sprung on this loot\nAddicted to crime, but I’m attracted to you\nPull up in that Porsche, then hop in that coupe\nPull off in that Benz, it's me and that’s you, uh\n\n[Chorus: K. Camp]\nNigga, I’ma live like it’s my last (Yeah)\nWorried 'bout them bitches we done had (Uh huh)\nBaby, I’m so focused on this cash (That's right)\nI said, baby, I’m so focused on this cash (Yeah)\nShe wanna roll 'cause she see me in that ride (What's up?)\nI ain’t got no time, gotta put her on the side (What's up?)\nYou can’t come between it, between it (Nah)\nYou can’t come between it\nBaby, I’m so focused on this cash (That's right)\n\n[Verse 3: Nipsey Hussle]\nGirl, your sex the best, hickies on your neck\nLove the way you dress, plus that pussy wet\nDo it 'til you sweat, and your hair a mess\nHave you late for work, but you been carin' less\nYou been livin' more, you been lettin' go\nYou been havin' fun, just to let me know\nThat you down to ride, you down to roll\nYou know the game and how it go\n\n[Chorus: K. Camp]\nNigga, I’ma live like it’s my last (Yeah)\nWorried 'bout them bitches we done had (Uh huh)\nBaby, I’m so focused on this cash (That's right)\nI said, baby, I’m so focused on this cash (Yeah)\nShe wanna roll 'cause she see me in that ride (What's up?)\nI ain’t got no time, gotta put her on the side (What's up?)\nYou can’t come between it, between it (Nah)\nYou can’t come between it\nBaby, I’m so focused on this cash (That's right)"}], "artist": "Nipsey Hussle"}