{"artist": "Papoose", "songs": [{"album": null, "title": "Menace To Society Part 2", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "Then Hurry Up And Buy\nJust Pay And Leave\nAy Man I Said Imma Pay You, Why Dont You Calm Your Motherfuckin Nerves?!Damn!\nHurry Up And Go\nWhy Dont You Give To My Homeboy His Change?\nI Dont Want Any Trouble, Just Get Out\nIts A Damn Job\nI Feel Sorry For Your Mother\nWhat Did You Say About My Momma?You Feelin Sorry For Who?!Ha?!\nI Dont Want Any Trouble, Just Get Out!\nWhat The Fuck You Said About My Momma?!\nI Dont Want Any Trouble, Just Get Out!\nYou Talkin Shit, Everytime I Come To This Motherfucker You Got Something To Say!\n[Gun Shots]\nYeah Yeah\nAy Where's Motherfuckin Video Tape?Gimme The Motherfucking Video Tape, Bring The Motherfucking Video Tape Right Now!\nAy Nigga, Ay Clean The Cash Register!\n\n[Papoose:]\nThis Is Menace 2 Society Part Two\nImma Menace 2 Society The Streets Is Mine\nYou Crap Rappers Admire Me\nI Wrothe Manace Part Two, Ya'll Can't Move Me\nI Graduated From Rhytm And Rhymes, Dont Try In Movies\nSucka, Without The Ass Whooping From Pac\nMe Is Slaving To 2006 Hughes Brothas\nI Got You Open Nigga\nRoll Up Your Weed. Pour Some Liqour\nAnd Yeah, Get You Pop Corn Ready Motion Picture\nOu Dog Still Locked Up In Jail\nIm Going To See Him Some Times, And Sending Some Mail\nThat Fagget Nigga Chunsy He Decided To Tell\nHe Gaved Tape To The Cops,He ? In Hell\nCain Wanted To Be Like My Father Parnell\nI Know You Remember Me,I Served You Memory Well\nI Was Riot My Big Will, Im The Reason You Fell\nHe Tryed To Protect Me When They Bustin Them Shell's\n\n[Movie Cut's]\n\nYou Really Fuckd Up Nigga\nFuckd\nGet Your Ass Out Of Car Nigga\nGet The Fuck Out.Break Your Self Nigga, Break Your Self!\nSon Of The Bitch!\nGet You Motherfucking Ass Out Of Car!\nAllright Nigga, Chill\nCain You Gotta Out Of Car Man\nNigga Dont Make Me Rush You, Get Your Ass Out Of The Car, Get Out Of Car\nAllright\nGet Out!\nAllright Nigga,Im Commin\nI Got Your Life, Get Your Motherfuckin Ass Out Of Car Now!\nBitch Move!\nShoot That Nigga Do You?!\nFuck You [ Gun Shots]\nAwww Shit...\nOu Shit Thats Cain,Ay They've Been Jack'd Common\nShit Thats Cain And Harold\n\n[Papoose:]\nIm Tellin Niggas 'brase Your Self\nYa'll Know The Slain\nIm Jacking These Fools, Just Like Them Do Jack Cain\nRemember When He Thought Me How To Hole That Thing\nNow Im Holing For My Self, Shit Dont Change\nI Gotta Vengance Steff, Im Streight Thugin\nImma Twistas Cap, When I Catch Arlinas Cousin\nSee Them Niggas Over There, They Scheamin To Rob You\nWhen ? No Body Gonna Harm You\nBut Yo, Imma Bout To Leave, I Can't Control It For You\nGimme Your Chain And Your Watch, Imma Hold It For You\nGimme Your Ring Too, Yeah Im Giving It Back\nStupid Niggas Fall For Some Shit Like That\nYou Ain't Even Got Stick Or Swee Like That\nYou Can Talk ? Juewls He Is Bitch Like That!\nThats Why Give It To Him, Give It To Him, No Hesitation\nYou Are Coward I Push Shit Back Like Cost Of Pation!\n\n[Movie Cut's]\n\nLook Aight,Not Me Allright, Im Not Killing Kids\nYou Know What Nigga?You Acting Like Lil Bitch Right Now!\nYou Act Real Paranoid And Shit\nThese Mothercukers Smoked Your Goddamn Cousin In Front Of You Nigga!\nBlow His Head Off, In Front Of Your Face, And You Ain't Go Do Shit?!\nYou Acting Like Lil Bitch Right Now Nigga\nMan Fuck That, I Ain't Letting That Shit Ride!\nWe Gonna Smoke All These Motherfuckers, I Dont Care Who The Fuck Out There!\nGod Damn It, Is You Down Nigga?!\nMan, Both Of You Shut The Fuck Up!\nNow Niggas Hurry Up,Go In There And Bump Them Niggas And Get The Fuck Out\nDont Be Playin, Dog, Cain You Hear What Im Sayin, Kill Them Niggas And Get The Fuck Back\nSo We Can Stab By, Imma Be Chillin Right Here\nAy Nigga I Wanna Now Are You Ready To Do The Shit?Is You Ready To Do The Shit Or What Motherfucker?!\n\n[Papoose:]\nThis Low Niggas Came To My Hood, Cops ? Had A Tatoo On His Arm And Red Arlina\nHe Said He Was His Moms, I Started To Feel Eager\nI Tap My Man, Like Yo ?\nThat Cain Got Pregnent, Yo You Got Your Nina?\nHe Said No, I Said Damn Cuz I Ain't Have My Fever\nI Put My Head Down, Like I Was Looking Down My Snickers\nWe Pumped Nigga Out So Bad, He Cought Amnesia!\n\n[Movie Cut's]\n\nHey, Witch One Of Ya'll Is You Cain?\nWho Is This Fool Man?I Dont Know\nA Friend Homie\nAww Homie, I Think That You Dont Know Me\nCheck This Out, Im Arlinas Cousin Partner, She Dont Like You Dogin Her, And I Dont Either!\nWe Suppose To Fight For Bitch?\nI Think You Should Watch Who To Call Bitch Partner\nYeah,And I Think You Should Watch Who You Fuck Too!\n[Fightnig] Aww Shit, Rush Him Nigga Rush Him!\nCaide! Caide!!!\n\n[Papoose:]\nAll I Ever Wanted To Do Is Ride Like Cain\nBailin Like Ou Dog, Drive By Like Cain\nLaid Back Like Vax, Life In The Fast Lane\nI Never Realized That I Will Die Like Cain\nTo All Of You Movie Thugz, I Hope You Get The Message\nName One Movie, That Gangsta Lives In The Endin\nNever Tryed To Beat Next Man, Thats How You Parish\nWhen This Movie Go Off, Man Make Sure That You Read The Credits\n\n[Movie Cut's]\n\nYo, Whats Up Now Partner?\n[Gun Shots]\nAfter Starting Arlinas Cousin Like That,I Knew I Will Have To Deal With That Fool Some Day\nDamn I Never Thought He Will Come Back Like This, Blastin!\nLike I Said,It Was Funny Like That In Hood Sometimes\nBut You'll Never Knew Whats Gonna Happen Or When\nIve Done To Much To Turn Back, And Im Done To Much To Go On\nI Guess In The End, All Catch's Up With You\nMy Grandpa Askd Me One Time, What Care, Live Or Die?Yeah I Do\nNow Its To Late", "year": null}]}