{"songs": [{"album": "The Gates Mixed Plate", "image": "https://images.genius.com/7efd1fa33fbd953a08bc1d44fae9f6a7.600x600x1.jpg", "year": "2010-07-27", "title": "Afterparty", "lyrics": "[Intro]\nYo, what's up where you at? (Leaving the club)\nMeet me at the crib baby (Alright)\nHow many you got with you baby? (Three)\nAlright we gon' party, let's go (Alright)\n\n*Phone rings* (Hello?)\nWhat's up, where you at baby? (Leaving the spot)\nMeet me at the crib baby (Okay)\nHow many you got with you? (Four)\nAlright we gon' party, let's go! (Let's do it)\n\n[Verse 1: Tech N9ne]\nAfter the club we usually go straight to Chubby's\nThat's where the 3 in the morning grub be\nAnd even though Icons is lovely\nTonight the pad is gonna be a must see\nCause hussies are coming to give up they pussies, trust me\nThey comin' to muff me, plus three:\nMakzilla, Irv and Big Nick we's 'bout to bust V\nOpen until we lust free, she sucked D\nGushed me, then roughly rode this ding-a-ling like a Huffy\nLuck-ily, another 36 cup D abruptly, came into the room to fuck me\nShe said, \"Tecca Nina touch me, your dick is thick and husky\nIt must be like a ride at Cedar Point in Sandusky\"\nWell, what do you know, baby girl rushed me\nThe TNA was so silky and fluffy, unjustly I crushed, B!\nAnd not one of these broads is ugly, 'til the next morning\nWhen they crawl in they hubby Snuggie, looking rough as rugby\n\n[Hook]\nYeah, we hit the spot if we choose her\nThen she dipping out\nTo take her to my house (It's the afterparty)\nWe can all (Get naughty)\nAnd take our clothes off\n\nYou can take the under-route\nTell your man you at your mama house\nNo but really (It's the afterparty)\nAnd we all (Get naughty)\nAnd take our clothes off\n\n[Verse 2: Kutt Calhoun]\nFull of that liquor, ready to stick all this dick up in a-uh\nBitch out at Nina's, I never seen but I'm fixing to fuck\nAlready popping I'm running late, but just minutes away\nWas told to grab condoms from up at Wal-Mart and bring 'em with me\nSoon as I enter, my cock's attending a chicken brigade\nSomebody's pussy's about to get cooked, rather chicken filleted\nFound me a victim, we made our way through the kitchen escape\nInto the garage and the lip massages was about to began\nLethargically sucking, hardly fucking with Pinky to me\nSo I told the slut to hike up her butt and let Kutt intervene\nAll in her guts in between, the Benz and the bucket and screamed\n\"Nigga you're fucking my whole lining up with my husband to be\nDrowning too much and if he-\" shut the fuck up and I ease out\nTake off the condom and I sprout on her butt with relief\nJust another episode of back to naughty\nTecca Nina I can't thank you enough for the afterparty\n\n[Hook]\n\n[Verse 3: Devin the Dude]\nWhen freaks come out at night, the freakiest stays out the latest\nThey hit the afterparty, they got somebody take care of they baby\nSo it's cool, no rules, no security guards\nLet your hair down, yeah, now do what you want\nMan fire up the weed, whenever you please, best believe\nThat you got the green light, the special guest is me\nAnd we've, been drinking and smoking all night\nIt's time to find a ho to be stroking my pipe\nA bitch quickly grabbed my dick and asked why it was so soft\nI said that it wouldn't go off, she gave it a quick blow off\nAnd she did and me dick start to rise\nShe opened her eyes to a surprise and\nHer thighs was moist, it was my choice to go up in it\nFor a minute put my dick up in it, she said it was splendid\nShe usually charge niggas, they like to rent it\nI told her put it on my bill bitch and send it\n\n[Hook]"}], "artist": "Tech N9ne"}