{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Dumb It Down", "lyrics": "[Intro]\nAli, mix it\nHa ha ha, Lady G, Whaddup?\nHa ha ha, Bad Love, Whaddup?\nHa ha ha, ha...\n\n[Verse 1]\nI spaz out 'til I pass out\nThere’s clarity in my vulgarity for a sass-mouth\nYour parody’s not funny\nApparently you ain't nothing but industry crash dummies\nAs long as the lord love me, I’m good\nI could: be the best rapper but I’d rather be the answer that capture the violence that coincides in my hood\nI should: stick a fork in this music business\nBut I’m too deep in it like pussy on my penis\nDevil’s kitchen in Phoenix; that’s the heat that I’m bringing where the shade at?\nI’m L.A. radio and good music, boy, I don’t play that\nUgh, Walking a thin line from thinking like Einstein\nAnd rhyming like Rakim in ’89\nDon’t wanna pack a nine just a mind full of wisdom\nLike a man 99 years old locked in prison\nDon’t freeload on my vision\nGet exposed like an R&B ho with a sex tape hidden\nI’m always for the business, forever you can feel it\nWhether you Crip blue or a nigga that hemorrhage\nMy penmanship is like me and Langston combined to the hip\nAnd my hip to the hop don’t stop as I rock\nI got a buzz like a shot of Palmer Sun\nAnd the women fall in love as they fall in my crotch\nNow understand that I’m all that you’ve got\nGive me chance, give me ears, give me hearts, give me props\nHear the difference? I’m cool like that\nOh, you spit? Well the retarded drool is back\nSee, I’m the author of the authors, the father of the Austin Power fajja\nWho can bust like a charter, why bother?\nI know a jealous serpent is a burden to my life\nBut still I carry on like luggage on a flight\nThe realness in my bones is the DNA to life\nI can give you insight only if you’re in sight\nI’m looking past y’all like a fastball - strike!\nAnd I ain't even tryna give it my all - yikes!\nI’m comfortable enough to go and chill out with a Huxtable\nYou couldn’t see my pedestal, because you’re afraid of heights\nCloud 9, where you can find\nMe in my dime like Roosevelt in his prime\nWait 'til I’m in my prime\nThe moon and the stars will align on my Louis V. belt like Orion\nTo whom say he cool: but the irony is I could hold the bottom of an iron with the bottom of my palm\nI say so much, so little all action, no talk like a mime throwing up gang signs\nIt’s not all about punchlines, I don’t do that\nI’m a Jaguar; you’re just a new cat, now move back\nKendrick Lamar on the radar for success\nAiming for the top like an AR aimed at your neck\nI can never digress, ‘less I get demoted to death\nEven then I’ll be the best still, like a petty theft\nI will: conquer my biggest dreams\nOnce you open the cage, I bet that I’ll spread my wings\nNipsy got street cred, Jay Rock got street cred\nAnd all I got is bad credit, big ears and big head\nBut still they’ll feel me, cause we all ate cereal\nHumped our momma's friend's daughter while they bump the stereo\nBackflips on shopping carts, free lunch at the park\nWatched Power Rangers after school; here we go\nI’m so Comptonized, I will never compromise\nFor no faulty ass A&R or CEO\nWe ain't what you think and you think we’re back\nBut we’ve been here for decades, and I vouch for that\nOpen your mouth for that, speak well like a great debater over iChat\nGet your other eye cracked\nI don’t rap, I-Iraq and declare war\nI enjoy watching enemies' blood pour\nI came up lower middle class, not poor\nSo don’t feel sorry for me, I don’t need y’all to love me\nI need y’all to feel me\nAnd if you feeling froggy to leap, then feel free\nMy feeling’s all aside, my pride is deprived\nBy the ultimate prize I'mma get when I see your suicide"}], "artist": "Kendrick Lamar"}