{"artist": "Post Malone", "songs": [{"album": null, "title": "Honest", "image": "https://images.genius.com/fc7e20f4fe2f7dd19a877bb5cb1677bc.937x937x1.jpg", "lyrics": "[Verse 1]\nBaby, can I be honest?\nI just want some money\nAnd don't you ever lie to me\nThis a fourty in a foreign, yeah\nYou will never show me off, though\nWhen you always goin' to the club\nYou ain't never met your father, yeah\nIt's no wonder [?] wrong with ya\nWe hit Rodeo, then we mobbin', yeah\nThis up a fourty in my cuppie, yeah\nI pull up in that new Rolls Royce\nAnd I wanna up my dame\nYeah, lil' mama hotter than Wasabi, ohh\nI got a hunnid racks, it's all for sure\nMama lit up, throw a party, yeah\n\n[Verse 2]\nAnd I swear I know a place where everybody go\nWe could all go\nI got a place where everybody see\nThat we could all go\nI got place we could go\nRidin' on the wave we go\nTell me that it's sorrow\nIt's a motor and you tell me so\nAnd I wanna let the gammon go\nAnd I wanna let the comma go, got women to lay\nSomeone had a fourty and I beat your own way\nHad some minor fun, bitch, I surf on a wave\nAnd the bitches wanna fuck, I need to go on a break\nPlease, let go, yeah\nDon't I know ya?\nLo-love ya, so I know ya\n\n[Verse 3]\nBaby, just be honest\nAin't a fourty in my [?] day, ayy\nI'm so tired of ménages, ayy\nNeed a bitch that call me \"father\", ayy\nAnother homie hold me down, yeah\nI might take you to the water, yeah\nIt's a fourty in my [?], yeah\nNo it's only in the morning\nI swear, baby, you, mhm\nI swear, baby, you, mhm\nMhm-mhm\nAyy, baby, I swear to you\nAyy, ayy, ayy, ayy\nShe said, \"I don't fuck with Fairfax\nCan we go down that Rodeo?\"\n'Cause I don't fuck with streetwear, yeah\nIt's a matter if I say so\nI don't want it on my Dior, yeah\nTook her to a lil' ronto\nHad her wantin' on a detour, yeah\nThen we flew out to Toronto\n\n[Outro]\nMoney, monies on me and yeah I want it, yeah\nMy lil' mama, she say she want it, yeah\nHunnid monies on me, it's in the 'Rarri, yeah\nI know ya", "year": null}]}