{"artist": "Andy Mineo", "songs": [{"title": "Coquito", "album": "Summer Eighteen", "year": "2018-07-20", "image": "https://images.genius.com/02267cebe001533229bde918c3c0c2f5.1000x1000x1.jpg", "lyrics": "[Verse 1: Foggieraw & Andy Mineo]\nLightskinned friend she look like Michael Jackson\nGot a darkskinned friend she look look like Tito (Tito)\nPull up to that rim, I can't miss like D. Rose (D. Rose)\nBaby make coquito, you know she from Puerto Rico (aye, yah)\nLike like James Bond in my black tuxedo (hmm)\nSouthside cooling, I been incognito\nYeah, always spend the bread, baby I'm no cheapo\nHuh, shoutout Uncle Billy, he just beat the chemo (aye)\nPretty Spanish mommy, and she call me chico (hmmm)\nShe said, \"Como estas?\" I said, \"Me no speako\"\nYeah, fake it 'till you make it, I call that placebo (got 'em)\nFather, Son and Spirit, that's the three amigos (aye)\nWoke up in the morning, I just did my devo (my devo)\nThat's the way I doodoo on my ego (on my ego)\nI think I just might of disappointed primo (dang)\nThat's okay, we just did this for the people (uhh)\n\n[Chorus: Andy Mineo]\nFeelin' sorry for yourself like (oo, oo)\nPoor me, poor me\nPour me a glass of coquito, coquito, coquito, yeah\nLost in the sauce\nShe went M-I, M-I, M-I, M-I-A\nShe went M-I, M-I, M-I, M-I-A, aye\nShe went M-I, M-I, M-I, M-I-A\nDown in M-I, M-I, M-I, M-I-A yeah\n\n*Interlude*\n\n[Verse 2: Foggieraw & MannyWellz]\nLightskinned friend she look like Michael Jackson\nGot a darkskinned friend, s----- like Tito\n(Tito)\nLightskinned shawty I won’t trade her for no one\nNo one, nah\nGot a darkskinned friend, she look like Kelly Rowland\nGot a darkskinned shawty, I can't trade her for no one\n*interlude*\n\n[Verse 3: Andy Mineo & MannyWellz]\nYeah, I know a caramel queen, she look like Bruno Mars\nAll them jokers want her heart, but she don't play them cards\nNo, lightskinned shawty I won't trade her for no one\nI gotta lightskinned shawty, she look like Pocahontas\nAnd she always set it off, that's why I think she the bombest\nYeah, lightskinned shawty, I won't trade her for no one\n\n*interlude*\n\n[Chorus: Andy Mineo]\nFeelin’ sorry for yourself like\nPoor me, poor me\nPour me a glass of coquito\nCoquito x3\nDon’t get lost in the --\nShe went M-I-M-I-M-I-M-I-A\nM-I-M-I-M-I-M-I-A\nM-I-M-I-M-I-M-I-A\nShe went M-I-M-I-M-I-M-I-A\nYuh"}]}