{"songs": [{"image": "https://images.genius.com/fa375366504b46eef8de1d192c20976b.790x790x1.jpg", "year": "2015-05-01", "title": "Chapter 10/Riot", "album": null, "lyrics": "[Intro]\nLuke White on the beat\n\n[Verse]\nYou ever seen a nigga hung with a gold chain?\nI'd rather sing about the same things that we claim\nSuch is bashful, but niggas like the task force\nMobbin' on the streets and robbin' stores in ski masks, bruh\nNiggas ask for peace in a riot and bring violence\n'Cause it's a game of cat and mouse and you gon' bleed silent\nWhat's the justice in sayin', \"Fuck it,\" and grab the pump?\nThen kill a woman with many children makes you a chump\nLook at all the stores you wreckin', nigga I reckon\nThink about the people who own it for about a second\nI know you got your problems, but brother, they got theirs\nThis is not a game, quit violence and grow a pair\nBut yo, you'd rather hear me say, \"Fuck the black prejudice\nLet's murder different races, grow hatred, and form irrelevant\nViews\" and etcetera, knives thrown\nDamage 'em, lives blown, oblivion hole cold, oblivious\nI won't dare say that you should stop the fuckin' ignorance\nMurder ops, killin' shit, I'd enjoy the thrill of it\nBathe in blood of officers, different corpses, offin' 'em\nAuction 'em, don't you bark at 'em\nMurder 'em, never heard of 'em\nI could preach the peace but say, \"Fuck it,\" and preach the murder\n'Cause this ain't fuckin' life that we livin'\nGo ahead and grab the extension\nGrab another one: uncle, cousin, brother, son\nGlory to all the chosen ones that will rid you of the innocence\nBut in a sense, innocent will soon behold the ignorance\nBlasphemous, killin' our own, murderin' black—\n\n[Outro]\nWe see, I see, death before the children\nWhite guys and white girls hanging from the buildings\nWe hate niggers!\nWe hate Jews!\nWe hate faggots!\nAnd we hate spics!\nHooray!\nWe don't have to have a reason to hate them\nJust because they breathe we hate their filthy bums!\nYou people need to get off your ass and wake up\nThis is America, the niggers are taking it over and the Jews\nMake a stand, join the klan\nWhite power! White power! White power!\nAnd I hate Jews! I hate them because they exist!\nI hate them because they breathe!\nI hate them because they're scum!\nThe goddamn niggers are the scum of the earth!\nWhite power!"}], "artist": "XXXTENTACION"}