{"artist": "Papoose", "songs": [{"album": "Law Library Collection (Mixtape)", "title": "Law Library (Part 5)", "image": "https://images.genius.com/932443ed9cf85b205250c111f4b660eb.300x300x1.jpg", "lyrics": "[Papoose: Speaking]\nThe Law Library Saga Now Continues\nI Promised Y'all The Continuation\nArticle 4.90 Terrorism\n\n[Song Begins:]\nImagine bein' on the 81st floor, with a fire inside\nAn open window is your only way to survive\nFor those who jumped out of the Twin Towers and died\nWelcome to Law Library Part 5\n\n[Hook: x2]\nTake these bars and play 'em for each and every\nWidow of a soldier who died is necessary\nWhen will we see the land of the free, nevuary\nSo where is the home of the brave, the cemetery\nHappy New Year's, I hope your Christmas was merry\nI'd like to welcome you to my Law Library\n\nTerrorism\nIt's wicked, it's exorcism\nWhere are the terrorist?\nAre they locked in prison\nOr are they in the government in different positions?\nAre they the suicide bombers or the politicians?\nDid the Twin Towers fall cause the planes hit 'em\nOr did they collapse cause of control demolition?\nWitnesses heard an explosion blast off\nThey say found some torn out Saquamies Passport\n9/11 was catastrophic\nHow could they find the passport\nBut not find none of the black boxes\nWeeks in advance the owner of the 7th Tower\nTook out an insurance policy for billions of dollars\nWhy would they let innocent people get devoured\nSo they can step in and play some hero of ours\nGood guy, bad guy, they kanivers\nNow they can take, do, say what they want\nBush did it for power\nToo many lies, now it's revealed that they snakes\nSo the United States\nGotta save face\nAnd what better way to restore then peoples fate?\nObama and Hilary In a Presidential Race\nSome say this is our time to rule\nFirst black president, powerful move\nBarack Obama could change the complection\nOf the white house\nBut can he change the direction?\nThat's what I doubt?\nWhy did they assassinate Benazil Buno?\nWas that a warning shot at Hilary? Who knows\nA terrorist person influence conduct of a unit\nOr government by intimidation or coherse\nAnd if you threaten a civilian population\nTo commit\nOr cause to be committed a specified offense\nCause intimidation or fear of incomission\nWhether you had the capabilities or you didn't\nYou can still be sentence, of such offense\nThat's a D felony, u made a terrorist threat\nCause conduct of a unit and government to happen\nBy murder, assassination, or kidnapping\nSo whose to blame for all the Hijacking?\nAl-Qaeda, George Bush, or Bin-Laden?\nThe government trying to find out, who bombed Manhattan\nTake a look straight in the mirror, your lookin' at 'em\nThe home land security, the patriot act\nLook at Afghanistan, the war in Iraq\nWhat's the next chapter in my glossary?\nArticle 1.60 robbery\nLaw Library [echo]", "year": null}]}