{"artist": "Petey Pablo", "songs": [{"album": "Still Writing in My Diary: 2nd Entry", "title": "Stick Em Up", "image": "https://images.genius.com/ad7098f2dca34e5ed96e2af4d16875b9.220x220x1.jpg", "lyrics": "\"Yeh I seen him come through here a couple of times...\nI didn't think nothing of him, you know... You know what I'm saying?\nThen that shit jumped off there man...\nThat shit shocked everybody...\"\n\n[Chorus]\nPut the money in the bag bitch before I blow your head off\nGet your ass on the floor nigga, think a motherfucker playing wit y'all?\nThis right here came from Mr. Charles and naw, it ain't got serials on it\nAnytime I got a personal problem its the only homeboy I call\n\n[Verse 1]\nI wonder how many thought about Petey Pab\nWhen I was in the pen\nRapping in the penitentiary yard\nBuying any weed outta canteens\nSmoking on my roll ups\nStroking on my love meat (Ha ha)\nWaiting for the day where they turn me free\nSo I can get outta here, make Momma proud of me\nDo the right thing\nRun up on the right man\nPull on the right strings\nPut them where they s'posed to be\nHad to get a jacket with a game of coke\nWhen the motherfucker slammed they door\n\"Oh no \"\n\"Hell no! \"\n\"Say what?!\"\n\"Get lost\"\n\"Hold up! Wait a minute, dogg\"\n\"Sorry, Charlie.\"\nFucked around one night when I was in New York\nMet one of the brothers up in ?\nEver since then, money been a real long end\nThat about ceases it all (Come on)\n\n[Chorus]\n\n[Verse 2]\nOh this? It's just something I carry with me all the time\nJust in case one of these motherfuckers lose they mind\nAnd run up on me like I ain't gon hold it down for mine\nI can show you better than trying to tell you about it\nSee once upon a time, I think it was in county\nWhen a nigga used to run up and armed and robbing\nAnd what's this little boy by the name of Mosey\nHad to run home to keep from getting his jewelry stolen\nTill one day niggas caught a hold to him\nDid what they wanted to him\nStole my little Gucci coat\n\"Oh no\"\n\"Hell no!\"\n\"Shit, yeh they did\"\n\"What you do about it?\"\n\"What the fuck you think I did...?\"\nTold Grandma, Grandma told Grandpa\nGrandpa took the grandson in the back yard (Here boy)\nGave me something, 'sposed take the pressure off\nAnd said he would teach me how to shoot at them all (Awwwe!)\n\n[Chorus]\n\n[Verse 3]\n(I'ma get up, got 'em!)\nIt ain't certified till the nigga ran up in the house\nPut the thang in they mouth and blow everything they think out\nRunning around acting like bitches (Talking about everybody)\nYou're gonna make me lose it all, (I swear to God)\nRun with it, talk about it\nBut godammit this motherfucker bout to piss me off (HMMMMM!)\nAnd this dick-riding, radio-station-ass\nMotherfucking nigga down here in ?\nI don't give a fat bitch, big titty\nFat one of y'all motherfuckers play my shit (My nigga)\nAnd a couple of spins that y'all sons\nHat ya did with me came with my mans and them (Devious!)\nMan fuck that church boy grab and look\nCome on motherfucker roll with us (Crush your homeboy)\nAnd if I said anything that ain't supposed to be said\nPut it in the air and buck (HA HA!)\n\n[Chorus 2X until fade]", "year": null}]}