{"artist": "Wax", "songs": [{"year": "2016-09-02", "lyrics": "[Chorus]\nI been living in this city for a long while\nSometimes I feel like I just need to slow down\nI'm packing up a bag I'm 'bout to roll out\nHeaded back to my hometown\n'Bout to take a little trip to my hometown\n\n[Verse 1: Intuition]\nWhen I left it was big city dreaming\nTraded tall trees for the cement\nTraded calm peace for the steep rent\nCold for the beach\nBut still head to mom's street for the reset\nRun to the midnight\nSun gon' get right\nMe and my little bruh probably gon' fist fight\nAnd I don't have shit to do\nMy dad sick we listen to his music on the couch\nWith the dog\nAnd just sit tight\nI lived life\nWhere B.B. gun fights\nHide and seek be fun nights\nWhere the lakes stay freezy and the skeeters gon' bite\nWhere your high school sweetie might complete your love life\nWhere shit talkers get beat up so you keep your tongue tight\nBeen known to take a long walk down a dirt road\nAnd think about the glow the world shows after first snows\nRave in the backyard\nWhere the red fern grows\nI wasn't made to stay here\nI'm glad I had a turn though\n\n[Chorus]\nI been living in this city for a long while\nSometimes I feel like I just need to slow down\nI'm packing up a bag I'm 'bout to roll out\nHeaded back to my hometown\n'Bout to take a little trip to my hometown\n\n[Verse 2: Wax]\nI watched a lot of television as a teen\nI used to see the screen as a window to a dream\nI wanted to be in it but so far away it seemed\nHad to leave my native land like Semmi and Akeem\nMoved myself to the west\nPut myself to the test\nLots of ups and downs\nLots of failures and success\nI'm a grown man now I think I'm changing for the best\nI used to want it all now I'm tryna want less\nI visit my hometown looking for some relaxation\nAnd every time I find a whole lot of inspiration\nVia conversations I had with a lot of good friends\nThat do not look at life through no Hollywood lens\nAnd I probably would've been a different person if I'd stayed there\nWorking 9 to 5 to afford the cost of daycare\nBut, I was put on this Earth for something different\nI'd never move back but I'd love to fucking visit\n\n[Chorus]\nI been living in this city for a long while\nSometimes I feel like I just need to slow down\nI'm packing up a bag I'm 'bout to roll out\nHeaded back to my hometown\n'Bout to take a little trip to my hometown\n\n[Outro: Wax]\nIt's just hard to be at a barbecue and not drink man. It's like watching pornography for hours on end and just not touching yourself at all\n\n[Audio Snippet]\nYou'll find yourself getting upset or irritated about things that usually don't irritate you, you know? Things that never bothered you when you were drinking every day, so... it's normal, it's part of it. Just try to relax and breathe and try to you know, just blow it off", "image": "https://images.genius.com/7c1dd79f5e740daf40ac14e92f0f0bef.999x999x1.jpg", "album": "The Cookout Chronicles", "title": "Hometown"}]}