{"songs": [{"image": "https://images.genius.com/0085dfe13301744dcd29dbdcdc9900fc.620x656x1.jpg", "lyrics": "[Intro]\nOne\n\n[Verse 1]\nWhen we come through we fly as fuck though\nI can mess with you but what for (hey)\nIf I play with you it'll be a draw\nMatch made in heaven, who's keeping score?\nEverywhere, every door there's nowhere where we won't go\nEvery step, every blow we're always going to get goals\nRelationship goals are you and me\nFighting H-A-T-E with L-O-V-E\n\n[Pre-Hook]\nRide of your life, better bring your GoPro (bring your GoPro, man)\nDon't need no pros 'cause we're gonna go slow (we don't need them hoes)\nLove is the answer, what's the question? I don't know (no one knows)\nStaring at the wall and I'm waiting for the call\n\n[Hook]\n(You said) Pick up your receiver, I'll make you a believer (call it)\nPick up your receiver (go ahead and call)\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (leave yours on the ground I walk on)\n\n[Verse 2]\nIt started when you asked me, \"What are those?\"\nI looked at you and I was glad you don't know\nI started walking by and it was special\nThat little dance you did was the best show\nI drove to the store when my fuel's low (bang, bang)\nI'm still heading somewhere and it feels raw\nBaby, when we play it'll be a draw\nA match made in heaven, who's keeping score? (kick out)\n\n[Pre-Hook]\nRide of your life better bring your GoPro (you know though)\nDon't need no pros 'cause we're gonna go slow\nLove is the answer, what's the question? I don't know\nStaring at the wall and I'm waiting for the call\n\n[Hook]\n(You said) Pick up your receiver, I'll make you a believer (call it)\nPick up your receiver\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (leave yours on the ground I walk on)\n\n[Verse 3]\nWould you, cry me a river, cry me a river (will you)\nWould you let me flow or set me on fire\nGonna need you more like the ground I wear (liquid fire)\nWe can make a pair like breath and the air\nGo to the top or be low\nTastes better than any combo\nXs and Os playing tic-tac-toe (tic-tac-toe)\nWe best friends, I guess so (guess so)\n\n[Hook]\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (bah, bah, bah, bah, bah)\n(You said) Pick up your receiver, I'll make you a believer (come on)\nPick up your receiver (leave yours on the ground I walk on)\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (oh, oh, oh, oh, oh)\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (oh, oh, oh, oh, oh)\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (oh, oh, oh, oh, oh)\n(You said) Pick up your receiver, I'll make you a believer\nPick up your receiver (oh, oh, oh, oh, oh)", "year": "2017-06-07", "album": null, "title": "Goals"}], "artist": "M.I.A."}