{"artist": "Pastor Troy", "songs": [{"album": "We Ready I Declare War", "title": "Eternal Yard Dash", "image": "https://images.genius.com/930f08b82ebc035b1b8a9ab3661f78c0.640x640x1.jpg", "lyrics": "Come on cuz, we almost there\nWe almost there cuz\nGoddamn, where the finish line?\n\nFuck this shit, I need some cheese\nAnd I need it quicker than Nestle\nIf I have to kill then God bless me\nAll these pussy motherfuckers, they shouldn't have test me\nLeft me looking like the villian , I was thinking of ending\nNobody knew what I was going through\nAll these motherfuckers saying what they gonna do\nBut then again all these motherfuckers ain't true\nSo who am I gonna trust, am I going on and bust\nMyself nigga, damn this shit\nFuck riding round' nigga, fuck being rich\nI can't take it, the shit to thick\nAnd it ain't my fault\nSo I ought to give the motherfucker telling lies to me\nHey the say, what its gonna be, but empty pockets all I goddamn see\nD-E-F, no ones left, then again, shit no ones right\nI'm a kill my damn self the night\nI get fear, it ain't my fault he couldn't fight\nIt ain't like, when I motherfucking die, this whole world gonna fall apart\nBut it's a race, and I got a bad heart\nBreath in the mouth, and I got a head start\n\nI'm running for nothing, I'm running for nothing (x8)\nSo I'm gonna kill myself\n\nA muthafucka tellin me what he gone do\nWhen I knew the muthafucka wouldn't do shit\nA nigga tease you, then a nigga leave you\nCause he heard that the shit done got thick, punk bitch\nI get in the mood for cocaine\nCuz it's the only thing I see when a nigga look\nCome and get the baking soda, then I flip the powder over\nThen I got good dope when the shit cooked\nBut it crippled my to really understand that it really don't matter\nWhat the fuck you been through\nIf a muthafucka see you doin better my nigga I'm here to tell ya\nMuthafuckas gonna hate you\nNot a clue, If I really woulda knew, muthafuckin 22\n2 years wasn't far away\nI never would have had a chance to enjoy Pastor Troy, woulda killed myself on\nYesterday\n\nHook\n\nThis heaven, where the streets of gold, and why the hell is the a/c off?\nWhere the fuck, all the loved ones that I lost?\nFuck this shit, take me to the boss\nDo you understand the cost that was paid\nIn order for me to be here tonight?\nNigga whats up, something ain't right\nTell the Lord to turn on the damn light\nFeeling like an angel when I take flight\nShit, as I try with all my damn might\nAll my power seem out my damn sight\nLook, why the fuck I was packed so tight\nNigga I ain't Mike, I'm Micah\nThink I'm in the wrong spot\nNot only do I have on black, its too hot\nBut why am I by the motherfucker ain't shot\nI got no halo, hello, motherfucker shit nigga, I'm talking to you\nSlap the clip in the tech 22\nLet the shit fly and it went straight through\nNow I got a clue, where the fuck I'm at\nShot him with the tech and the nigga didn't budge\nNigga just bleedin', motherfucker out of blood\nLooking at me smilin', asking me what\nI got guts, but guts, goddamn\nParadise,shit I can't tell\nWent from dwellin' in hell on earth\nNow I'm living in hell in hell", "year": null}]}