{"artist": "Bas", "songs": [{"lyrics": "[Interlude]\nWhen they see you are inferior do not believe a word they say. Fiends. Resist. When they say they need billions of dollars to build bonds instead of schools open your eyes. Fiends. Resist. When they say they want to reserve our way of life so they must take life, this is a lie. Resist. Super Mook. Speak truth of power, do not comply.\n\n[Verse 1]\nListen up, I'm gone like ET\nNo prone alloy, all white GT\nWaking up early morning not easy\nBas is a fiend, snort 'til at least 3\nComing up, watch me peak\nWhite home with a loan, this not DC, but I be the president\nRun the confederate of the generous\nWell, bitches never sell a bit\nTrying to get in my city better sell a bit\nSell a bit, sell 'Piff, nigga sell a brick\nSell tricks up, make your stretch boy\nNew Jigster, that's my next toy\nGoing like Wall Street after exploits\nOff that, bomb weed that I explore\nCalmly, board the next plane at the airport\nWhere I'm going? Who knows\nAnywhere it ain't snowing with two hoes\nPenthouse, condo with two floors\nDipping through minor coke and two doors\nNew ports, shit, they ain't hotter than me\nKick up my feet like an [?] G'\nWake up, my bed makes itself\nBake up, inhale, take deep breath\n\n[Interlude 2]\nDo not believe. Do not accept. Do not be afraid. Do not surrender. Do not judge. Super Mook. Do not [?] against my neighbor.\n\n[Verse 2]\nSo high I can never find a fucking thing\nBut I always find my fucking bling\nWhere was I?\nRiding on the rings\nSaturn, swagger, got me all rapping out of pattern\nSmoking good, give your bitch wood like a tavern\nIf they could, bet them niggas would\nDoesn't matter, cause they can't serve them hoes\nThey ain't on a platter, took my bank\nEminem, nigga Marshall Mathers\nThat's a couple milli' hoe, stuntin' like a video\nBurning on the piccolo, green\nNew York City Fiend\nCity colder than the ghoster\nEDM mean\nStreets like a cobra, until you get bitten you probably wouldn't even know what I mean\nThey ask, but they never know what I seen\nSo busy trying to scheme a nigga forgot to dream\nI'm dreamin' lucid\nChess not checkers ya'll niggas stupid\nBet's not check cause ya'll niggas foolish\nBas serve 'em hot ya'll at the [?]\nDamn, revenge is a dish best served cold\nSo, I wish that to them assholes\nYeah, wave goodbye to my last goals\nSet sight on the flag poles\nBas", "image": "https://images.genius.com/90ed5acc5725bddf1d8feb24c15ed9f9.300x300x1.jpg", "year": "2011-06-07", "title": "Degenerate Confederate", "album": "Quarter Water Raised Me Vol. I "}]}