{"songs": [{"title": "Glock 40", "album": "Larry", "year": "2015-05-19", "image": "https://images.genius.com/0980cd0aa530cd3d50b4fcfd32e31c46.1000x1000x1.jpg", "lyrics": "[Intro]\nAye, sock it to me\nDamn, yeehee!\nAye\nOh!\n\n[Hook]\nGoddamn (aye!), Ohhwee (yeeeheee!)\nGlock 40 with the... Beam (damn!)\nAye, everything ain't what it... Seem (aye-aye-aye)\nGlock 40 with the... Beam\n(Shit! Yee! YeeHee! Damn! God! YesLawd!)\nGlock 40 with the... Beam\n(Bop Bop Bop BOP! YEEEEHEEEE! SHIT!)\nGlock 40 with the...Beam\n\n[Verse 1: Larry June]\nHandguns choppers, grass like a farmer\nTuck like Osama, Smoking on Obama\nJuggin' in the winter, juggin' in the summer\nNever graduated, but i'm riding foreign\nI'm walking in the sand, condo in Hawaii\nI'm living what i'm saying, you niggas steady lyin'\nFuck the radio, I can do without it\nI'm riding with the whammy, I don't trust nobody\nI'm the Pusherman\nI can get it to you\nGet out the pussy\nChopper in the bushes\nSlide through the blade\n2's on the six\nTo these rap niggas I'm a father figure\nRiding by myself I don't need a nigga\nPut the heat to em like a TV dinner\nI'm a real nigga I can get it off\nTell me what you need I can get it to you\nI ain't in to all that fake shit\nWhy the fuck you speakin' on my name?\nHit my phone on some groupie shit\nBut pillow talk to yo main thing\nOkay I see that you a fuck nigga\nOn my momma man these niggas bitch made\nHit a pussy nigga with a switchblade\nHo i'm getting money bitch 3 ways\nNigga YeeHee!\n\n[Hook]\nGoddamn (aye!), Ohhwee (yeeeheee!)\nGlock 40 with the... Beam (damn!)\nAye, everything ain't what it... Seem (aye-aye-aye)\nGlock 40 with the... Beam\n(Shit! Yee! YeeHee! Damn! God! YesLawd!)\nGlock 40 with the... Beam\n(Bop Bop Bop BOP! YEEEEHEEEE! SHIT!)\nGlock 40 with the...Beam\n\n[Verse 2: Larry June]\nThey say a nigga changed, dammit I got aim (good job Larry)\n8 thousand for the paint, dammit I am paid\nSmoking on the finest, birkin for my bottom\nI like stripper bitches, I like hoes in college\nI'm standing on the couches, I'm drinking out the bottle (fuck!)\nDon't fuck with broke niggas, they schemin' and they plottin'\nI'm not a fuckin' rapper, I'm chillin' on a island\nI shop at whole foods, I'm really havin' guala\nYou say you want beef but I bet you won't run up\nOne hitter quitter I bet you get done up\nWe all about money so this is a come-up\nGrind in the winter and shine in the summer\nHop out the Benz and I jump in the hummer\n(Phew! Phew! YEEEEHEEE!)\nI made it safe that's a touchdown, smoke a nigga like a hookah lounge\nYou don't wanna hear that ruger sound (goddamn)\nI got bitches that'll get it now\nI ain't lookin' for a friend bitch\nHo I need another hundred thou', I wake up early then I run a mile\nHit the blunt then I'm to the trap, I turn off then I take a nap\nWake up with another 50 racks! (aye, damn)\n\n[Hook]\nGoddamn (aye!), Ohhwee (yeeeheee!)\nGlock 40 with the... Beam (damn!)\nAye, everything ain't what it... Seem (aye-aye-aye)\nGlock 40 with the... Beam\n(Shit! Yee! YeeHee! Damn! God! YesLawd!)\nGlock 40 with the... Beam\n(Bop Bop Bop BOP! YEEEEHEEEE! SHIT!)\nGlock 40 with the...Beam"}], "artist": "Larry June"}