{"songs": [{"title": "In Charlotte", "lyrics": "[Intro]\nWhat watch should I put on though? (Yeah)\nAyy, what car should I drive today?\nAyy, somebody roll up a blunt\nYeah, big money shit\nIf Young Metro don't trust you, I'm gon' shoot you\n\n[Verse 1]\nMillion dollars cash, all twenties in the closet (millions)\nBought a short bus because my ice game retarded (damn)\nSelf-made millionaire, now I'm labelled a target (it's Dolph)\nFucked that bitch and put her out 'cause her pussy was garbage (get out)\nYeah, them bitches bad so I pass 'em to my lil' niggas (bitch)\nThey wanna act up so I pass them boys to the hitters (bitch)\nDon't ask me why they mad, I don't know, I'm gettin' too much scrilla (I don't know)\nMy bank account got big and my head got even bigger\nWhite Audemar, gold bracelet, big rocks\nA whole month straight ain't been bumpin' shit but Pac, ayy\nCoogi sweater on, R.I.P. B-I-G (Biggie)\nI just left LA on the way to NYC\n\n[Chorus]\nCall me water boy 'cause I'm drippin' all this water (water)\nMet her down in Florida but I fucked that bitch in Charlotte (thot)\nBorn a dope boy, never wanted to go to college (fuck that)\nBad Puerto Rican, New York bitch, met her in Starlets (huh)\nI shut down the party (party), I shut down the party (party)\nWent and parked the 'Rari then I go jump on the Harley (yeah)\nPull up, go and throw a dub at Cameo in Charlotte (Charlotte)\nI shut down the party (party), I shut down the party (party)\n\n[Interlude]\nGoddamn, man. Who the fuck is this? Hello?\nHello, hello, hold up. Are y'all straight, bruh?\nYeah, wassup, bruh?\nAyy, y'all straight, you straight? Man, what the fuck happened man? We heard about this shit, what the fuck happened up there, man? What y'all got going on? Huh?\nThat nigga shot all the motherfuckin' bullets, man, ain't hit shit. Stupid ass nigga\n\n[Verse 2]\nJust 'cause my money keep runnin' like Forrest Gump (run it up)\nI got niggas hate me like I'm Donald Trump (damn)\nWhere I'm from you don't make it to see 21 (shit)\nThat's why all these young niggas ridin' around with their gun\nFront page newspaper, number one topic (it's Dolph)\nNiggas mad at Dolph Obama just 'cause I'm the hottest\nCan't nobody stop me, man my neck so rocky\nSaid she seen Flippa dancin' and that's how she spot me\nTwo things that I just can't respect (what's that?)\nA fuck nigga and a lyin' ass bitch (yeah, me either bruh)\nThat lil' nigga keep on runnin' up that check (run it up)\nI gave my dogs the recipe to get rich (go get the money)\nThey started shootin', we didn't even break a sweat, ha\nApril Fools, the trick's on you bitch (April Fool's)\nYou playin' checkers lil' boy, I'm playin' chess (bullshit)\nI just scored again boy, all nets (hey, hey)\nPaper Route, we got now and next (for real)\nThat's a motherfuckin' mansion 'round my neck (for real)\nI'm in a Chevelle, but the motor it came out a Vette\nI might sign with DJ Khaled, because we the best, hah (why?)\n\n[Chorus]\nCall me water boy 'cause I'm drippin' all this water (water)\nMet her down in Florida but I fucked that bitch in Charlotte (thot)\nBorn a dope boy, never wanted to go to college (fuck that)\nBad Puerto Rican, New York bitch, met her in Starlets (huh)\nI shut down the party (party), I shut down the party (party)\nWent and parked the 'Rari then I go jump on the Harley (yeah)\nPull up, go and throw a dub at Cameo in Charlotte (Charlotte)\nI shut down the party (party), I shut down the party (party)", "album": "Bulletproof ", "year": "2017-04-01", "image": "https://images.genius.com/29fa753e2bd1858eb69c5dceb7d28c64.1000x1000x1.jpg"}], "artist": "Young Dolph"}