{"songs": [{"year": "2014-03-07", "image": "https://images.genius.com/13aca1a0803c515646f80b95792b028e.611x475x1.jpg", "title": "Egyptian Cotton", "album": "Week of K.R.I.T. ", "lyrics": "[Verse 1]\nI'm out in Sweden this evening, Stockholm this summer\nChampagning with pretty models that pose while they slumber\nYou have to see to believe it, Eiffel my tower\nA long way from that bopper house, game playing there for hours\nThat was breakfast in bed, too high up to be scared\nNo key card, you a fraud, ain't no taking the stairs\nComplimentary the emphasis on compliments\nI really didn't need a suite, but the view beneath is ambient\nHonestly, I'm really at a lost of words\n300 block to seeing half the world\nFrom the slumest of conditions to living in the 'burbs\nNiggas claim they selling out, but that sound so absurd\nCause wasn't we younguns watching the cars pass by, like \"That's mine\"?\nVisit my father's friends on Christmas like they rich and we not\nThey had a pyramid of presents, stacked 'em up to the top\nGet back home like, \"Damn, Zac, I think this is all that we got\"\nNo disrespect to my pops, Winn-Dixie just wasn’t paying\nMy mama did what she could, as a kid I heard patience was a virtue\nOn the first day of school those last year shoes, could hurt you\nStains on those Paco jeans belong on Tide commercials\nSo they talk and they laugh, I swore I’d get back\nNow them double RL’s is hard and my G-Star’s they got slack\nAnd we grown, those dead stock J's, I had them flown\nDidn't even put 'em on, ain't nothing set in stone\nOnly Egyptian cotton\n\n[Hook]\nLife could be as smooth as Egyptian cotton\nLife should be as cool as Egyptian cotton\nI can't seem to lose on Egyptian cotton\nFalling to the grooves of Egyptian cotton\n\n[Verse 2]\nIt's getting harder not to sleep in\nWhen every day is the first day of a well-deserved weekend\nI halt the sun in my blind so it won't peek in\nThen roll over on the damsel down for freakin'\nRoom service replenished, energy needed\nShe opened the door and she barely decent\nAss out, I dig her like, \"Who gon' stop us now?\"\nI might not see her again, let's go another round\nThat's how it is when you come and go\nThat's how it is when we come and go\nThat phrase never meant so much to me before\nNow, as it stands, it's the only motto that I know\nDad ain't get money, but we do that\nPrivate jets first class, I been flew that\nWho that trying to sum up my success?\nIt's like sleeping on the best, Egyptian cotton\n\n[Hook]"}], "artist": "Big K.R.I.T."}