{"songs": [{"image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg", "title": "Five-O", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "Chorus\nWhere my straight jacket at, I’m a psycho\nWhere that white blow?, Why they copy my flow?\nIf it’s not Young Money, it’s a typo\nThere them lights go, we don’t talk to five-o\n\nWe don’t t-t-talk, talk to five-O\nThere them lights go, we don’t talk to five-o\nIf it’s not Young Money, it’s a typo\nThere them lights go, we don’t talk to five-o\n\nJae Millz\nMister officer, mister officer\nI’m sorry I don’t wanna take a walk with ya\nMatter of fact, I ain’t try'na talk to ya\nWe ain’t got no business, so what we talking for?\nThere ain’t no need to bring me in for no interrogation\nCause about that boy who just got shot, I gots no information\nThese broke ass snitch niggas still gram shaving\nAt the precinct writing statements on which trap house is the station {​DAMN}​\nNot I, tattle-telling is for homos\nBesides, thats the Number 1 Young Money no-no\nPolice, we don’t chat with them\nWe ain’t got no rap for them\nYou in the cop car pointing niggas out from the back of them {​THERE HE GO}​\nBack seat informer, your papi shoulda warned ya\nYou even tell PoPo I’m black, then you's a fucking goner\nYeah you get high, but I get higher\nManyana, I just might go to the halfway house and ask your supervisor\n\nChorus\n\nNicki Minaj\nYo… 4, 3, 2\nCocka doodle do\nI was out in Africa, Shaka Zulu crew\nHo ho ho, red stockings too\nComing down the chimney, you're chopped n' screwed\nIt’s me bitches, eff you snitches, gimmie the heebie jeebies\nSo excuse my twitches (Excuse me!)\nLemme get that brewski, niggas know them bitches can’t do it like I dooski\nI just pull up, chuck the deuce in some blue denim, and I just heard he running with the lieutenant\nI’m the mistress, I be in the District of Columbia\nYes uh huh, Washington\nBetter ask around, cause I’m what's popping-ton\nI’m who they think about, playing with they pee pee\nGotta count sheep b, cause I’m never sleepy\nYes, I’m the chief, you can find me in my teepee… BITCHES!\n\nChorus\n\nGudda Gudda\nYoung Money psycho, straitjacket on me\nBreak a nigga jaw if he turn to informant\nI bring it to your door step, loose lips sink ships nigga\nSo I’mma bring you to the bottom of the ocean [uh chuuch]\nI hear you preaching like a fucking reverend\nShould've killed you in the first place, no second guessing\nCould've killed 'em with the first and the second weapon\nDJ Unk 'em with the hand, I two-step and deck 'em\nThen I grab the choppa, blue flame Houston wreck em\nKick a snitch head through a goal like David Beckham\nMake way, respect em\nI could AK attack em\nYou looking at a gangster in his essence\nNow bitch bow down when a gangster in your presence\nCause I’m God’s gift like a present\nFor one don’t try me I could give you two lessons\nYou peasants get murdered if you do test 'em\nGudda Gudda biatch!\n\nChorus"}], "artist": "Nicki Minaj"}