{"songs": [{"image": "https://images.genius.com/2d55ade9a4adefc87c19af8a78677832.1000x993x1.jpg", "lyrics": "[Intro]\nHello?\n(Who is this?)\nWillis\n(Willis who?)\nWill this dick fit in your mouth!\n\n[Pre verse 1: Rockwilder]\nUh, hey what's up?\nThis Rockwilder with Sleep D and Mac Driznay\nAnd we finna talk about these hoes we like\n\n[Verse 1: Mac Dre]\nBig pimping jumping off\nShe fuck with me she got to call\nDollars up, swallow nut\nI want a top notch bitch with a lot of butt\nTwo on one, ménage à trois\nSuck a gold ball through a coffee straw\nThem the hoes I like to fuck\nTaller sitting down then he is sitting up\nGood job, game to give\nShe can't be broke with a gang of kids\nI can do bad on my own\nSome of them hoes say, \"Ou he wrong\"\nPunk bitch get sliced in as bait\nCome around me with all that fake\nI like hoes with pretty toes\nDon't need makeup or pantyhose\nHella saucy, sweetest dame\nKinda square, hella fame\nA bitch with money is necessary\nI want a bank tellers and secretaries\nHustlers, cum guzzlers, come ride on these nuts\nThese are the hoes that we like to fuck\n\n[Pre verse 2]\nYo we ain't fucking any of you [?]\nYou know who you be\nAss smelling real rashy\nLike wet wood, yeah\nThat ass be wetter then that puss\nThat ass be the part of your body that you need to dush\nYou know who you be\nBrown banana eating bitch\n\n[Verse 2: Sleep Dank]\nYeah, Mr. Gambini bitch, I'm in your area code\nFuck what a cheap nigga holler, I'm taking the dough\nI'm hollering twosome, the gambler, the slick type, snitch type, weed like\nAll up in a bitch nigga D. Rice\nWhat it be like, fucking the puss, dropping her off\nWhat you know about me? Sleep Dank breaking her off\nKeep her packed petty, lay the puss and get to swallow duck\nDrinking the puss keep my pocket stuffed\nBitch I'm [?] smoke\nBitch you fuck with square niggas, dollar joes\nI fondle hoes that [?]\nShe got my posters on the wall\nSprung, clinging to these balls\nType of bitch I like 'em fireproof\nI strive too, convicted felon, cracking you niggas safe with [?]\nHook my celly up, pick me up in the clean Q45\nIntelligent, [?] hairstyle\nRocking the Gucci fit, man this suit is sick\nTalking about some [?] shit\nBut see I never split the dough with the hoe\nYou know?\n\n[Pre verse 3]\nYeah bitch coming at you two cent funky hoes\nYou know what I'm saying?\nI'm talking about getting bomb booty\nI mean getting bomb booty, getting it big\nYou know what I'm saying?\nTight pantyhose and all that, though\nYou know what I'm saying\nWe coming at y'all like this\nRound me outside\nRowdy outside baby\nMan, I want a bitch with one eye and one leg\nAnd a gang of money\n\n[Verse 3: Mac Dre]\nA want a big dollar freak, across the board\nWith a gang of ye all the way from Florida\nWhen I say get up, she get to hopping\nSoft as cotton, booty big ass Stockton\nShirley Temples, dimples, no pimples\nDo what I say, plain and simple\nNo arguing, 'cause I R-U-N\nThe whole show, I let a hoe know\nIf she don't feel me, I will get felt\nWhen I tell a breez-nitty to get my belt\nSkimpy thongs make her love the song\nShe will hit a Backwood, but she love a bong\nThem the hoes I like to G\nRomped the fuck O-U-T\nBitches with riches, come ride on these nuts\nThese are the hoes that I like to fuck\n\n[Outro]\nYeah, one mo in this motherfucker\nThis Decon, owner of this bitch\nYou ain't the one\n[?] get with it or quit it you tramp\nYou ain't know I see you out there with your helmet on\n[?]\nBoth of you need to be selling though, for real\nGet my [?] bitch, uh and I'm out\nFuck that nigga, ain't no more takes or nothing", "year": "1998-04-07", "album": "Stupid Doo Doo Dumb", "title": "Hoes We Like"}], "artist": "Mac Dre"}