{"artist": "Canibus", "songs": [{"title": "Dead by Design", "album": "Melatonin Magik", "year": "2010-02-09", "image": "https://images.genius.com/eab20e1acfa343ff4b9ea6c53ff8ac79.500x500x1.jpg", "lyrics": "[Intro: Professor Griff]\nCanibus\nThrowing melanated molotov cocktails\nEngineer directly out of Full Sail\nRipping the jacker, ain't nobody nastier\nSpitting and grabbing facts and data to enhance ya\nCanibus the lyrical adjective killer\n\n[Verse 1: Canibus]\nMy Melatonin Magik is enhanced by the melatonin tablets\nCome take a walk with Canibus\nArdipithecus Ramidus, what the fuck is Melatonin Magik Bis?\nI still ain't understanding this shit\nOkay, my brain is a microchip\nMy two balls with a cane is a macro-dick, I rap so sick\nI created swine ploo out of an infinite mix\nYou tried to diss but can't even spit, you just stand there and wish\nWith your hand on your hips, man you a bitch\nWho the fuck is you to criticize a lyrical king\nYou see, that's my problem, I spit a thousand bars y'all was silent\nI ain't heard nothing about it\nI had to give you three years to recognize\nAnd then I realized, can't nobody even fuck with my rhymes\nThe Internet is an early telepathic building set\nMy lyrics are international nuclear missile threats\nThe blogosphere is where you vent frustration and discontent\nBut children don't understand the concept of consequence\nSo yes, it's immature to express disrespect\nBut no I will not accept what the media says\nThey are the reason we are being misled\nThere are forces above them that feed off our stress, suffering and debt\nI am Dead by Design, cause nobody tells me what to rhyme\nI make up my own fucking mind\nThere are more of us than them\nBut at the same time they are gods and we are just mortal men\nThirteen levels above 33, let me say it again\nThey are gods and we are just mortal men\nI cannot imagine their power\nThey put a black family in the White House just so they can take away ours\nYou tryna to plan a great escape? You're a coward\nThey gon' make us march into a gas chamber make us think we're taking a shower\nMommas and babies is crying\nThe children of Zion belong to Skynet, nobody knows who's behind it\nSo if you don't care, fine then, I don't care either\nBut I ain't spineless like you, I'm a true believer\nIn the metaphysical aether, you listening to the lyrical reaper\nThe spiritual teacher, empirical speaker\nAfter this album they gon' call me a leader\nBut I'm not, Killuminati just gon' murder me like Pac\nBlood sacrifice or not, I don't even wanna be alive\nIf it's like that, then fuck Tiamaat\nYou can laugh at my appearance\nWell fuck you for standing there staring, fuck everything on this planet\nIncluding the evil spirits, notwithstanding the aliens\nActing like they don't hear us, there's no need to fear us\nJust come done and help us, I love James Brown more than I love Elvis\nBut that don't mean I'm selfish\nSoft but hard on the outside like shellfish\nCrispy, crunchy, black crawling out of Hell's pit\nYou scream for hardcore, I felt it\nBut what you gon' do when they kill me on some Eminem and L shit?\nYou won't do a motherfucking thing\nCause let me tell you why, you a coward and you don't know shit\nCause if my Brothers stand next to me, the energy expands collectively\nThe world was never ready for me\nAnd they ain't ready for their own freedom neither, they perish from the heater\nThe fire breathers crawl out of their cage to eat 'em\nLike thin crust pizza, Cthulhu creatures with rough features\nJeepers creepers, good luck with Jesus\nHow many meters? Reload and squeeze it\nI run up in the Vatican with demons, just to get even\nThat's where the biggest demon is\nIt's no secret, but nobody else sees it, so they won't believe it\nBut that's when I calm back down, the key word is back down\nI got possessed by my own raps, wow\nKnock knock, who's home? The black Dan Brown\nI didn't mean what I said, please don't kill me now\nMy ghostwriter's not around, plus it was just a freestyle\nBut at least I got better beats now\nMeanwhile, motherfuckers still mad, I feel bad\nI'd apologize but you acting like a real fag\nWhat the fuck I'm supposed to feel like?\nTwelve years later I still don't get acknowledged for shit that I write\nBut I don't want to talk to you now\nIt'd be a motherfucking miracle if you even see me walking around\nThey still ask me about 'Second Round' even now\n(Interviewers voice) Canibus can you tell us of what happened again? - Look at this fucking clown\nCan't get over it, they ask me a loaded question\nAnd act like I was the one promoting it, hang up on 'em\nYou a cyborg unit with no soul to it\nStupid surrogate, twelve years later I'm on some other shit\nAnd so is the whole world, look at the mother ships\nAnd so is the whole world, look at the mother ships\n\n[Outro: Professor Griff]\nAfter this album they gon' call me a leader but I'm not\nThe Illuminati just gon' murder me like they did Pac\nBlood sacrifice or not\nIt's Professor Griff the ex-minister\nSigning out"}]}