{"artist": "Fat Joe", "songs": [{"year": "2010-07-27", "album": "The Darkside Vol. 1", "image": "https://images.genius.com/a346ed5d5bb8736594a9565557319edf.1000x1000x1.jpg", "lyrics": "[Chorus: sample]\nAll around the world today, the kilo is a measure\nA kilo is a thousand grams, easy to remember\nA kilo is a thousand, but can you remember?\nWhen we measure kilograms (?)\n\n[Intro: Pusha T - over Chorus]\nYo Joe, what up?\nIt's ya neighbourhood Pusha\nSee my man, my man May May locked up for like 25 years\nHe in the Feds right now, right\nHe said he locked up with this old Spanish man\nAnd they was sitting down watching TV\nAnd you popped up on the screen\nThe man said, \"hey, what's Joey doing on TV?\"\nHe didn't even know you rap, haha\n\n[Verse 1: Pusha T & No Malice]\nK-I-L-O, the king saying hello\nFrom my Sugar Hill Ray Nathan he's Romello\nI plays it like a cello, I pull them strings\nTo make them scales teeter totter like balance beams\nIt's everything it seems, the guns and the glamour\nThe re-compressed birds broked down with sledgehammers\nSmile candid camera, goddess in zoom lenses\nUnclaimed taxes, sitting in new Benzes\nChampagne drenches, the loafers of bosses\nLord forgive me, it's blood diamonds in these crosses\nSuffered major losses to repeat the past\nGuess I never learned a hard head makes a soft ass\nUgh, and soft white makes for hard cash\nAnd Continental GT's with the soft rag\nLike soft batch, cookies out the oven\nGetting 13 at a time, now that's a baker's dozen\n\n[Chorus: sample]\nAll around the world today, the kilo is a measure\nA kilo is a thousand grams, easy to remember\nA kilo is a thousand, but can you remember?\nWhen we measure kilograms (?)\n\n[Verse 2: Fat Joe]\nIt's Coca baby\nKrills mania, BX, TS nigga!\nAyo, it's blood on the cocaine, a scene out of Psycho\nDope so pure, fiends cling to the light pole\nWet purer than holy water, your wife know\nAnd she ain't gotta fly to Columbia for that lipo... (Darkside)\nCut keys like a locksmith\nBlasphemy, but it feels like it's God's gift\nOne sniff'll have you kneel down and praise me\nNodding out, holding onto your babies\nA new connect means a few more dreams\nNow watch a nigga flood the streets like New Orleans (get it?)\nBlow like trumpets, snorting on the second line\nFucking with that white bitch'll have you on the borderline\nPenthouse in the city got the scenic view\nAnd maybe you can fuck Madonna like you Peter Shue\nSnowcaps dripping off rock mountains\nCrack in Wonderland got coke dripping out the fountains\n\n[Chorus: sample]\nAll around the world today, the kilo is a measure\nA kilo is a thousand grams, easy to remember\nA kilo is a thousand, but can you remember?\nWhen we measure kilograms (?)\n\n[Verse 3: Cam'ron]\nOkay baby, got you Crack, Killa!\nI said a kilo is a thousand grams, but can you remember?\nCheck my agenda, snow like December\nCoke, I'm a emperor, go head and taste it numb up your dentures\nMoving in renters, probably a sentra\nNo I won't serve you, don't mean to offend ya, 'fend ya\nRoundtable, glass up, all hail us\nToast the life, one they told me will fail us\nWe prevail from the corner, now (?)\nStill got wet, they on water like a sailor\nMe and Cook Coke (Cook Coke), cook coke (cook coke)\nNo fracture, but damn you look broke\nKnow my pedigree ready is what you better be\n(Better be) put two holes in yo' ass like the letter B\nMy parameter homie is where you need to be\nGambler? Nah, Janitor, I keep the keys... Killa!\n\n[Chorus: sample]\nAll around the world today, the kilo is a measure\nA kilo is a thousand grams, easy to remember\nA kilo is a thousand, but can you remember?\nWhen we measure kilograms (?)", "title": "Kilo"}]}