{"artist": "Vast Aire", "songs": [{"title": "T.V. Land", "year": "2008-06-24", "lyrics": "(Intro)\n(Yo son, Willie Dynamite said 'He wanna hit you son')\n(What you gon' do?)\nOh nah, he don't want it with me\nOh nah, shit, I'll bring the Earth, Wind & the Fire\n(Word!?!)\nWhen God made rap, he came to me\nHe said 'What you wanna do?'\nI said do this!\n\n[Vast Aire]\nThis ain't Parker Lewis but you gon' lose\nCuz I can do karate in platform shoes\nHold your breath till your face turns blue\nI'm like Dolemite mixed with Doctor Who\nWith a little bit of Sonny Chiba\nI like to smoke cheeba and keep a fly bird\nThen I tie my sneaker\nYou need to keep ya mouth zipped\nIf this was pre-school, I got the Cheese Nips\nI seen Popeye get done in (Uh-huh)\nSurvival of the fittest, we will eat yo spinach\nI think Olive Oyl tried to mix in\nHer ass got broke cuz she was too thin\nDid she have a chance? I don't think so\nCall Pink Panther - Inspector Clouseau\nLet's get 'em for info, see what he knows\nAnd watch the face of grown Pinocchio\n\n[Interlude]\nNo'm'sain, so I ran up there, we hopped in the car\nIt was like six of us deep, we wasn't having it\nI went straight to that nigga's club\nI was like yup...\n\n[Vast Aire]\nHell up in Harlem uptown Saturday night\nFoxy Brown and Claudine had a fight\nAnd even though it was awful\nIt got a little worse once they jumped Sparkle\nBlack Caesar fell out the wagon\nBut he can switch his hand like Enter the Dragon\nSuperfly running shit like a gentleman\nCleopatra Jones smacked Lady Heroin\nBad Ass got mad cuz he lost his hat\nThat dude's a bad mutha - stop that!\nHe smacked a girl\nBack flipped her, rocked her world\nAnd then he went for Cornbread Earl\nHe choked him out, had him in a headlock\nWe was like 'What Judo does he got?'\nYou know my style is Bulletproof\nLike Clark Kent when he slips out of the phone booth\n\n[Interlude]\nYo it was crazy dawg, yo chairs was thrown everywhere\nTables was flipping, I was like let's get the hell out of here\nLet's go home\n\n[Vast Aire]\nWe had to bounce - we did the Hollywood Shuffle\nI kissed my girl; she was like 'I love you'\nHopped out the car\nChecking my body for scars\nThat's when me and my brother saw the Drug Czar\nIt was Willie Dynamite\nHe just left the fight\nHe was like 'It wasn't me, I was here all night'\nThen he pulled out, and he shot my brother\nHopped in the car, 'I'm gonna get you suckers!'", "album": "Dueces Wild", "image": "https://images.genius.com/eb42f00f56a165e0e57e8f51a829caad.536x536x1.jpg"}]}