{"songs": [{"year": null, "title": "Do You See", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "[Puff Daddy]\nYo Puff Daddy\nGet off me\nLadies & gentlemen\nYou're about to witness something that you've never witnessed before\nSauce Money's in the house & he brought his man with him\n\nI leave rap in a state of shock\nWhere to rock, from the figures still\nPlay the block with my niggas\nIll lush, game 20 pounds, but all my niggas still crush\nStill stack chips galore\nChicks want out the ghetto, try to hit you raw\nBetter know that everything I love - roll back\nCop my first gold plaque, soon as my man blew\nStill spittin' the fly, hits you can't do nigga\nYou ain't gainin', you game in, barely maintainin'\nI push fly whips without strainin', my cliques smother\nGet tougher, hits rougher, Puff is deep in the streets like Chris Tucker\nMy wrists cluster, on a mobile\nP-Diddy, rap mogul, thought I told you that we don't stop\nThought I told you that when I drop, platinum plaques\nI cop, push Bentley's without the tops, nigga\n\n[Hook] (Puff Daddy)\n\nTry to see if you see what I see\nGive my game & spit my G\nWhen it's all done, stack, funds, & I'm the one\nOn top is where I be\nTell me, do you see what I see?\n(When I look in your eyes, I see you hatin' inside, so tell me)\nDo you see what I see?\n(I know you're hopin' I'm blind, cause you don't want me to shine)\n\n[Sauce Money]\nNo secret, undefeated, I'm top seeded\nWhenever I drop hits, you don't want it, you need it\nThis a hot joint from Sauce, you feel cheated\nUnanimous decision, love the way I freak it\nBrooklyn, shogun, beat the 4-1\nNiggas want to bite off my flow son\nI don't think no one, got that, rock a hot track\nLike me, nice to the Sauce? Naw\nSpit rounds, it's rough did I mention the thorough?\nBK forever representin' my borough\nPush fly whips, quick to stack my chips\nToo easy for you to understand my hits\nWhen the album drops every pocket hold some\nSauce motherfuckin' forever, I told son\nHypnotic, heard the ? war 'fore I shot it\nBetter cop it, cause all that fly shit, I got it\n\n(Chorus)\n\n[PD]\nI took rap by the throat & locked it\nP-Diddy fixed all those who tried to stop it\nSome of y'all tried to blast off, but couldn't rock it\nIf my flow ain't like a door, how could you knock it?\n\n[Sauce Money] (PD)\nAs a matter of fact, yo don't you hate that? (hate that)\nWhenever cats playa hatin' from way back (way back)\nMad at you, just because they whack (they whack)\nAnd I bought your style, older than 8-track (8-track)\n\n[PD]\nOnly way to react though\nMake hot joints & stack dough\nLaughin' at your whack flow\nTry to catch my G\nJust so you can rap like me\nAct like me\n\n[SM]\nRap like me\nBut it seems as though you dreamin' a lot\n(PD)\nI'm the cream of the crop\n[SM]\nSoon to be seen in the drop\n(PD)\nBlow the spot for the not\n[SM]\nControl the block, watch his name bubble like a soda pop\n(PD)\nWhen he drop\n\n(Chorus 4X)\n\n[Puffy ad-libs throughout Hook]\nSauce Money\nPuff Daddy\nBad Boy forever\nB.I.G. forever\nHitmen\nPrestige, rock on playboy", "album": "Middle Finger U"}], "artist": "Sauce Money"}