{"songs": [{"image": "https://images.genius.com/cb4ee6a1e6caf6643101c3a03c78c58a.939x939x1.jpg", "album": null, "title": "Congratulations.", "lyrics": "[Intro]\nBoyinaband!\nIt's your big day!\nIncredible job!\nI know we had our differences\nBut today, I just want to tell you\n\n[Chorus]\nAyy congratulations, it's a celebration!\nParty all day, I know you've been waiting\nAyy congratulations, it's a celebration!\nWith the chorus at the start to reel people straight in\n\n[Verse 1]\nDear dear David\nBig congratulations\nYou're raising the game with these big collaborations\nSeriously, David\nBig congratulations\nFor the trail you're blazing for Midland rap creatives\nEspecially the ones like you and me with \"D.B.\" names and pasty faces\nSince DBGames you've risen up like pastry in a spaceship\nI have been spectating your rise to success\nWith a strange combination of pride and distress\nOne the one hand it's amazing, my mate is elevating\nBut on the other hand I feel like I'm still waiting\nAnd on the other other hand it's so frustrating\nThat I can't even count the number of hands, it's embarrassing\nI knew that rhyme would sink in well with you\nYou saw me force it, just like how you foresaw me\nSaying a tap is called a faucet\nWe used to sit and write together sharing lines and jokes\nYou weren't like those other rappers trying to share me lines of coke\nIf we'd met on Grindr I might find you were my kind of bloke\nWhoa, no homeloaf, homeslice!\nNo, tonight, I'm going to dine alone\nTuck into a microwave meal for one, what a rubbish cooking show\nI know I suck at choruses, let's look how low this hook can go\n\n[Chorus]\nAyy congratulations, it's a celebration!\nHey David, what do you think of my Roomie impersonation?\nI can't make a hit track, so I made a miss track\nI miss my mate, I wish we could bring our friendship back\nAyy, it's time for wild celebration, and mild inebriation\nBy which I mean some English tea and mindful meditation\n\n[Verse 2]\nYou and Pewds and Roomie have produced the perfect pop song\nCatchy tune, half happy/gloomy, humour, verses not long\nNot too complex, not too racist, except maybe in some places\nLet's wait and see what the mainstream media lets you get away with\nYou made some of my favourite sounds\nBut I want to just say this now\nAlthough on the global stage you're Boyinaband\nTo me you're David Brown\nI know I suck at choruses, let's see how low this hook can go\nSorry - no, I can't keep up this flow, it's far too fucking slow\nSo let's ramp it up a teeny tiny tad\nOh yes, I'm kind of enjoying this\nBut even trying to rap and keep in time to match the rapid speed of light Boyinaband can reach might be pointless\nI've only met two lyricists who can really twist language as tight as I can\nAnd that's my arch nemesis, The Stupendium, and Boyinaband\nI've only met a few people who equal my level of irony\nAnd that's you, David, isn't it?\nHehe!\nYou and I and me\nWe had a thing for forced rhyme\nA vlog called intercourse time\nA gaming channel I neglected, which I think's a sure sign\nI'd never parallel your forceful fortitude or foresight\nI'd always be the frickin' Jim Davidson to your Forsyth\nYou seized every opportunity that I wasn't prepared to\nAnd capitalised on every potential link it led to\nI watched you get on stage and win the crowd while I was scared to\nYou helped me with my head, I only helped you with your hairdo\nBut unlike your luscious locks, our bromance has been cut and doesn't grow\nI know I suck at social stuff, like I suck at hooks\nBut I love you bro!\n\n[Chorus]\nAyy congratulations, it's a celebration!\nI'm too scared of repercussions to make fun of Asians\nThis isn't a diss track, it's more of a miss track\nI can't diss you David, I'm afraid of how you'd hit back\nWe both know how to twist facts into a fucking bitch slap\nAnd somehow still sound so profound even when saying \"piss flaps\"\nWe stopped communicating\nAnd I've been feeling vacant\nMaybe this correlation does equal a causation\n\n[Verse 3]\nWe used to be the best friends\nTeam up on League of Legends\nI was Sivir, you were Heimerdinger and together we could reach the heavens\nBut despite our fancy vocals, we both can be antisocial\nWe went from speaking daily\nTo maybe an annual phone call\nDave and Daniel's bond is like our gaming channel:\nGone\nThat's why I made this song\nI want to say that I was wrong about you\nGuess I got distracted by what your diss track did\nI thought I was gonna diss RiceGum with iDubbbz\nBut I got subtracted\nNext think I knew it was you Ian would choose to rap with\nBut if it had to be anyone apart from me\nWell then I'm glad it was you because you smashed it\nI bow down with humility\nTo your YouTube ability\nI used to boast that I was bigger than most\nBut now you're clearly bigger than me\nYou said that I didn't take any risks, just relaxed in making game raps\nWell I listened to your criticisms and came to the decision to bring that flame back\nWe met in Berlin last year in the summer\nIt was good to catch up, but it was really a bummer\nWe agreed we'd see each other soon\nBut I knew we wouldn't do it from the feel in my stomach\nI messaged you on WhatsApp\nMaybe you can talk back\nIf I'm honest, I don't care if I come across as a twat\n'Cause if I'm honest and I come across as a twat\nWell then honestly then I'm obviously a twat\nA twat that's asking awkwardly:\nOpen up and share your thoughts with me\nDon't make me forcefully break into your place so you talk to me\nNo, please, don't call the police!\nOf course I don't mean it, Jesus, it's just a joke\nI know I suck at choruses, but this one's yours, it's fucking dope!\n\n[Chorus]\nAyy congratulations, it's a celebration!\nParty all day, I know you've been waiting\nThis isn't a diss track, it's more of a miss track\nI miss my mate, I wish we could just bring that ***** back\nAyy, I bet you thought I swore then\nBut I just bleeped the word \"stuff\"\nOr did I?\nGot the algorithm trying to call my bluff\nBut I already said \"fuck\"\nSo that's kind of redundant\nI don't really miss you, Dave, I'm just chopping some onions\n\n[Outro]\nCrying with AutoTune is weird...", "year": "2019-04-05"}], "artist": "Dan Bull"}