{"songs": [{"album": "Javotti Media Presents: The Cathedral", "image": "https://images.genius.com/ef6dedd7fb7fbfd332ff9ea334d4188f.500x500x1.jpg", "year": null, "title": "Hypnotized Snakes", "lyrics": "[Intro:]\nCalling to the coach\nLet me know where it is talk to them\n\n[Verse 1:]\nReady on three\nPlease pour me perry\nSkeptics in the residence like uh\nWhat the hell he ya\nIm on that new wave. hell yea\nIts like the water from the waterboard\nNow comparing to heavy on the puberty is not comparable\nThe taste of it is terrible\nI sip the nectar of the Gods\nAnd now i'm writing records with the gods\nAnti-social but the pocket full of dead friends\nAnd the peanut butter goes inside of the red benz\nAnd my purata momma causing accidents\nEarthquakes, meteor strikes volcanoes, eruptions and air spins\nAs a mastermind in my DNA\nI don't got no time for no VMA\nMix the Y with the EMG and it's time for some TNA\nCause i grind til i see the day i expire\nBlaze fire\nNo days off just just asking yulo\nGreat rides drink live in a glass full of\nRap cooler, and i jab like zab trooger\nBe down for the count like Dracula\nIm a fool for the cash mad mula\nI can't put my finger on it, that's lula\nPull up with that foreign , a black bulla\nOh lord kakala Hallelujah\nGt a gold digging bitch who wanting diamonds and purses\nGot my head in the clouds she got her hand in my pocket\nI gave her an habitual criminal stare\nShe text me, not proceeding down invisible stairs\nThe rap game is full with pitiful imbeciles who dare\nRemember was it fictional fear?\nSo i trip before i kick in the stairs\nSpittin medical peers\nSmoking medicinal like i'm living in the biblical years\nJesus!\n\n[Music]\nWe Out here you, shit i Hope you live a hundred years\n\n[Verse 2:]\nI been a boystar call me\nStop at the indian spa order a bag of good shit\nShout out to Roger he just street talking shit\nNumber 23 dropping that swoosh\nCowards wanna get loud with me\nAnytime brother\nThat shit not gonna fly with me\nDo not civilize or criticize or hate\nBut i got grass i rather emphasize the great\nEnterprise is grey, dim the lights grey\nPlay the indian flute i can hypnotize a snake\nYou a bastard can't say we serve ya\nI gravitate universal\n\n[Indian Music]"}], "artist": "Talib Kweli"}