{"artist": "E-40", "songs": [{"title": "Doin’ the Fool", "image": "https://images.genius.com/6ef4f347fd9bda992f74b839338dc1a0.500x500x1.jpg", "album": "Loyalty and Betrayal", "year": "2000-10-10", "lyrics": "[Intro: E-40]\nNigga up in this motherfucker\nI mean I been fuckin' with this motherfuckin' burgundy carpet pimpin'\nWhat about you, pimpin'? I mean I know you fuckin' around with that\nPurple bag, youknowhatImean? That Crown Royal, oh boy!\nI mean, we got, we got a whole bunch of player-ass niggas\nUp in this muh'fucka right here today\nWe got that nigga.. E-Feezy, Too $hort, nah'mean\nPimp C up in this motherfucker, nigga Pastor Troy\nOh boy!\n\n[Verse 1: Too $hort]\nI hits free (Free), it ain't wholesale\nJust got through hittin' it so well, at a hotel\nBut don't tell (Don't tell) I cuss your fuckin' ass out, bitch\nFuck yo' drunk-ass and watch you pass out, bitch (Beitch)\nAnd when you wake up, I tell you anything\nYou fucked me so good, bitch, you deserve a wedding ring\nI practice what I preach, ridin' Vogues and findin' hoes\nI told her I'd buy some clothes, but I'd be lyin' to hoes\nI ain't buyin' shit, bitch, I can't do that\nI had to jump in my car, and call you a cab\n'Cause I'm out, you know I'm all about fuckin' hella good\nTake the rubber off I'm in your mouth\nComin' to a town near you, real soon\nInfiltratin' hoes, nigga, we some real fools (Real fools)\nAnd it's true, and baby girl knows it, too\nAsk her shit, she'll tell you how I do it fool\n\n[Chorus: Al Kapone]\nDoin' the fool! - Ain't no love, motherfucker, we breakin' the rules\nDoin' the fool! - Niggas like me ain't got nuttin' to lose\nDoin' the fool! - We servin' you haters straight off the top\nDoin' the fool! - Just to let you know this shit don't stop\n\n[Verse 2: Pastor Troy]\nOkay, okay, up next, oh, it's the boss, from the home of the Braves\nDown here chillin' with E-40 'cause it's time to get paid\nC'mon, actin a fool, 'cause y'all know how I'ma do\nShe fucked me, Pimp C, and $hort, too\nI drank no brew, it's Remi, that special kind\nDon't fuck with who? My nigga, you out yo' mind\nFresh off the grind, my niggas is the killers\nActin' a fool 'bout this motherfuckin' scrilla\nNo one no trill'a, but tell them, I'm down, mayne\nGo grab my leather, and get into some gangster shit\nSo if it's cool, it's cool\nBut just that quick, I act a fool\n\n[Chorus: Al Kapone]\nDoin' the fool! - Ain't no love, motherfucker, we breakin' the rules\nDoin' the fool! - Niggas like me ain't got nuttin' to lose\nDoin' the fool! - We servin' you haters straight off the top\nDoin' the fool! - Just to let you know this shit don't stop\n\n[Verse 3: E-40]\nBut I ain't never been a sucker\nI ain't never been a mark\nI ain't never been a busta\nI ain't never been a simp, potna, I always had heart\nPapered up, hustlin', never 'posed to handcuff a beyotch, mayne\nHector the ho protect a trick bitch, mayne\nBe extra mannish (Extra mannish), get some skull\nPurple bag, Crown Royal (Royal)\nGotcha beyotch actin' mannish, think she spoiled (Spoiled)\nNorma Kamali all over her body, she used to that (Used to that)\nThis potna big 40 had it like that\nCadillac (Cadillac) sittin' on buttons, 32 valve\nThe DTS (DTS) half a gallon to the mile\nPlatinum chest (Platinum chest), light bright, love to smile\nWhat a mess (What a mess), horny, fucked me on my desk\nKitchen tile (Kitchen tile), then she swallowed up the rest\nAsk me how (Ask me how), a fat ass cum shot on her breast\nShe said, \"It's been a while since I had sex\" (What she say?)\nShe said, \"It's been a while since I had sex\" (What she say?)\n(She said, oooh oooh.. oh boy!)\n\nC'mon c'mon, okay okay!\n\n[Chorus: Al Kapone]\nDoin' the fool! - Ain't no love, motherfucker, we breakin' the rules\nDoin' the fool! - Niggas like me ain't got nuttin' to lose\nDoin' the fool! - We servin' you haters straight off the top\nDoin' the fool! - Just to let you know this shit don't stop\nDoin' the fool!\n\nC'mon c'mon\n\n[Verse 4: Pimp C]\nUh, comin' down in candy car, smokin' on some candy bar\nEvery day I'm choppin' blades, comin' through on old school Maze\nI'm in this game so heavily, just like Frankie Beverly\nSell a nigga that Southern girl\nPut cocaine up in your world\n'Cause I'm a young ass nigga on the slab\nComin' through in a whippin' Nav'\nI used to be out on the ave\nBut now all my keys got the Midas stamp\nChange my name to Sweet Jones\nSmell like sixty-four dollar cologne\nComin' down in burgundy Brougham\nAnd I keep a chip off in my phone\nSweet Jones, bitch! Hold up\nSmoke somethin'\n\nC'mon c'mon"}]}