{"songs": [{"title": "Mask and Knife", "image": "https://images.genius.com/14da381769975ec5c53bf1de0edb7baa.500x500x1.jpg", "lyrics": "[Intro Skit]\n\n[Dude 1]\nAy my nig, is that some weed right there, my nig?\nLet me hit that shit, man ya feel me? Pass that shit\n\n[Dude 2]\nNaw, this ain't weed, nigga, you know what this is\n\n[Dude 1]\nI don't know what it is...\n\n[Dude 2]\nYou see how shiny the cigarette is, nigga (hehehe)\n\n[Dude 1]\nAwww, that crippler dippler!\n\n[Dude x or G-Macc(?)]\nRoberto, let's do it again!\n\n[Verse 1: G-Macc]\nClear my throat, then I\nPull a butterfly knife out the back pocket chop it with a semi\nHalf of the body left in the closet\nThe other half in the cutlass with me\nWanna come back with the gonorrhea\nFeed it to 'em, stomach empty\nLook at her fifty stab wounds, hit her with ten\nDroppin' the knife, then pickin' it up, then shiv her again\nDeliver it to the meat grinder, makeshift grade weed finder\nDig her back up, eat the eyes up\nBeat your wife up, keep the knife cut\nI got decay, put it to your face, piece releasin'\nI bury your face deep to the sea creatures' region\nI'm knee deep in your niece's feces\nRight of the pee/tree(?) screamin' finger up, back from the guts, eat these\nYou can look at me, I'm three people\nOne of em axe murderer, one of em cat burglar, other one pure evil\nLil' Ripgut 'bout to pick it up and then rape shit, sake shit\nAlcohol and razor blade kit… (Let’s rip it!)\n\n[Hook]\nEvery single day I take a fetus with me (eat it!) x8\n\n[Verse 2: Bleezo]\nFrequent, with a black ski mask and a knife!\nThe freak hazardous type\nGot sick habits to beat rappers, deceased afterlife\nI'll sneak in your pad and catch you while you sleep stab you twice\nAnd with no knee pads knee pads I'll tea bag your wife!\nNigga, I breathe gass in the mic\nNo 2 Chainz, but I be in the trap with bean bags all right\nDid I mention G-Macc, I hope you got a beast appetite\nSpit at nuts and guts and chunks of human meat slabs tonight…!\nI eat the beat alive, I'm a mic vulture\nPlay all my money, I carve you niggas like an ice sculpture\nMy mind’s kinda bipolar\nI'm a high roller, eye swoler\nI'll probably stab a bitch before the night's over\nMy flow's dope bitch, I rhyme yola\nI be eatin’ niggas like side orders, when I ride on 'em\nA scoundrel\nRun up in your household with a scalpel and scalp you\nFor one hundred thousand and counting, I suicide note’cha\n\n[Hook]\nEvery single day I take a fetus with me (eat it!) x8\n\n[Verse 3: Brotha Lynch Hung]\nEverybody 'bout to get chopped up\nMeat grinder, heat finder, we find her\nPuttin' her up in the cut, with a couple of razors up in her butt\nYa boy be fucking it up, and there ain't nobody that can touch\nI ain't lyin' nigga, I'm Kobe Bryant in the clutch\nGrrr, Mask and the Knife\nRun up in your house, nigga, and I'm slashin' your wife\nKidnappin' your infants, I'm rippin' shit, I get into shit\nRun up on 'em, gun up on 'em, I won upon ’em, sickle sick! (Grr)\nKill a nigga like cancer if he think about fucking with me\nSticking a .50 caliber up the gut, hit the kidneys\nRapin' a nigga, scrapin' a nigga off the plate\nI think my brain is off the slate\n(Ay nigga, ay, come here nigga) Altercate\nRunning through niggas like Walter Payton\nDead wife at the altar waiting\nGrr, splitting the cleavage, I got the meat cleaver\nCuttin' em up when I eat people!\n\n[Hook]\nEvery single day I take a fetus with me- (at it!) x8\n\n[Outro Skit]", "year": "2013-02-05", "album": "Mannibalector"}], "artist": "Brotha Lynch Hung"}