{"songs": [{"title": "Spring Water", "album": "Heist of the Century", "year": null, "image": "https://images.genius.com/29aed50e708381cab4e55222550f38fa.962x925x1.jpg", "lyrics": "[Intro: Raekwon]\nYo. Yo. Yo. Yeah, No doubt. No doubt\nThat's my... 1997. That's my word\nThat's my... that's my word\nThat's my... that's my word\n\n[Raekwon]\nYo, yo, yo, up in the Hilton, buildin, playin outfieldin\nThe black 90210 cat was chillin\nThen spottin this, somethin look fabulous with ice on\nFly night's on, fitted up with fly tights on\nStarin at me, approach a God, represent right\nPeep this, James Bond, BM look tight\nDelightly, that I could see shorty liked me\nPolitilly, [nigga], get it right g\n\n[La The Darkman]\nDay plannin, jump up, watch the landin\nStay cool, fannin, polly, eatin salmon\nAt the grill, reminise over who got killed\nAnd if they were here today, pa, how would they feel?\nSun shinin, jet past the block, cats rhymin\nSee King Gunner, he gained cream this summer\nRolled up a Dacari, blessed my man\nMarvelous, wally rocker, lex, 450 land\n\n[Raekwon]\nYo, the barbeque's bangin and my sons look charged up\nWhat up? Fresh cuts buildin when we rest up\nTeam is righteous, fresh cologne on, probably roll on\nSome next club, no slag, throw my gold on\nInfo, like a hotel, phat, she got stacks\nShe's a big girl, cover girl laced, wig curl\nGoin through the struggles of life is trife\nGet your things right, maybe one day you'll be rich wife\n\n[La The Darkman]\nYo, picture good days, young, no bills to pay\nI can't 'til I grown, that's what all kids say\nCame a long way, cashin checks, duplex\nTo lampin on planes, rockin 5 g chains\nWell known, just bought moms a new home\nCheck shorty on the swing, playin the cellphone\nLookin lovely, green sundress, no stress\nNails look fresh, painted to impress\nIt's only love\n\n[Raekwon]\nYo, yo, son, that's my word\nConnect dots with all live [niggas] in the world\nStart some thesis, exiled, long releases\nThough we got family there with little nieces\nSix a crash with king Nike Air, yo\nRockin them new Wu glasses, lace my lab, kid\nMagazinin', swim, watch, long dreamin\nPeace, I'm out, golden globe rapper low-keyin\n\n[La The Darkman, (12 O'Clock)]\nYo, Cuban linkin, lampin at the park here drinkin\nWatch the seeds play here free, mind thinkin\nBirthdays, presents, learnin, readin lessons\nNine God year, livin in impressions\nSplashin, La medallion flashin\n(Son, talk your jewels 'fore you jump in the pool)\nAight, du', I stay blacked out by the leaf\nCuz I eat to live, not live to eat\nSayin peace, Nah'I'm'Sayin?"}], "artist": "La The Darkman"}