{"artist": "Planet Asia", "songs": [{"album": "The Grand Opening", "title": "16 Bars of Death", "image": "https://images.genius.com/cb88bb05cdeba97350da2c7dd2f127f2.500x492x1.jpg", "lyrics": "What the fuck?  Yeah!\nYo y'all niggas get'cha rhymes up\nI'm sick of this shit, get your bars up niggas\nSixteen bars of death my niggas\nAy Planet, let's go, c'mon!\n\n[Planet Asia]\nAll it takes is sixteen bars of death\nRain hail snow, I make the clouds drip to get you wet\nAnd that's a bar no matter East to West\nDon't get this rap shit twisted, I'ma star that'll meet your threats\nAnd we can bet, cause if I go deep in death\nThen it's a rap, face it, you could never beat the best man\nAnd even as a little kid - niggas knew I had it in me\nCause the way I used to spit at the assemblies\nAnd unless you remember me from now on\nEverytime I spit then it's a special delivery\nMy world is of ability, women give neck willingly\nNiggas respect me lyrically - my, city is feelin me\nFrom the inner to the optic jewels\nFrom the beginnin to the endin I am not to lose\nI'm not the fool, spit 'til no bars is left\nAnd all y'all teams can feel my sixteen bars of death\n\n[Chorus: Planet Asia]\nSixteen bars of death\nRap monster on cassette, never runnin out of breath\nYes, sixteen bars of death\nAnd when I spit I spit bars 'til it ain't none left\n[repeat 4X]\nGet your bars up (yeah) get your bars up (yeah)\n\n[Planet Asia]\nIn the apartment, the artist get it started for hours\nHeartless, like the department of the water and power\nYeah - fuck your hot showers, and while you watchin the fight\nI cut your cable just to show who really got power\nNow I'm, minutes from ass-kickin sessions\nAsswipe, we tax niggas like Pacific Gas & Electric\nBar spitter, {?} cigar splitter, tar getters\nHard-hitter hater niggas wanna war with us\nBut get your bars up, cause niggas know about me\nAnd they know about my squad, so as far as us\nI ain't got to answer the shit, so if you see me in the club\nKeep your mouth closed and dance with a bitch\nCause I'm bout to be the hood philanthrophist; get down or lay down\nAnd how I got up in the spot wasn't an accident\nJust love blood tears and sweat, and large respect\nAnd sixteen bars of death, yeah\n\n[Chorus]\n\n[ad libbed outro by Asia's hype man]", "year": null}]}