{"songs": [{"image": "https://images.genius.com/c5fe8c69f859aaa9ed69ceaf98e9e9f8.901x972x1.jpg", "year": "2016-01-13", "lyrics": "[Verse 1: Kevin]\nHomie ik zit shotgun on my road to riches\nLaat ze achter kinderzitjes\nGeef me ruimte ik ben gone\nAf en toe dan tape ik ewa maybe komen hitjes\nZelfs m'n homies uit de wijk zeggen maar Kevin je doet lang\nOf ik ben in de stad ik heb kaas verdient\nIk buy twee nieuwe shoes maar ik draag ze niet\nIk wil 't land uit geen Walibi\nM'n connecter in Marx heeft Spaanse wiet\nFuck m'n oude docent en de buurtagent\nEn dan wordt je maar en anderhalf uur agent\nJe bent een SD als je niet sturen can\nM'n portiek ruikt naar wiet fuck die buren hè\nKijk al mijn mannen nemen risico's\nTerwijl jij blijft vragen om video's\nIk heb die ruggen voor het grijpen als je fysio\nAcht per jaar zijn verlies omdat ik liters rook\nIk zweer het gaat lukken ik ben vastbesloten\nIedereen in Lacoste niet eens afgesproken\nJe praat alleen shit minder takkenrook\nIk wil rijden in de Benz ik heb te lang gelopen, ik heb-\n\n[Hook]\nEwa kifesh, wat is die schets, wat gaan we verdienen?\nWaar gaan we laag, blowen we saaf, gokken we tientjes?\nWat is die actie, wat is de move, wat is de beweging?\nBen on the run, altijd actief voor een nieuwe beleving\nEwa kifesh, wat is die schets, wat gaan we verdienen?\nWaar gaan we laag, blowen we saaf, gokken we tientjes?\nWat is die actie, wat is de move, wat is de beweging?\nBen on the run, altijd actief voor een nieuwe beleving\n\n[Verse 2: Sevn Alias]\nAlias iceman 't is 7\nIk ben aan 't trappen in die wijk voor die beker\nIk ben met Kev in the back\nDraai een zwen, doe relaxt\nSnel weg, ben met Jonna, we racen\nWat is beef man? Ik ken alleen paper\nWat is love man? Ik heb alleen haters\nWant ze doen alsof ze net met je menen\nAls het erop aankomt nemen ze de benen\nIk ken mannen die ballden als Kobe\nIk ken mannen die ballden als Lebron\nEn diezelfde mannen staan weer broke op the block\nWaar die shit alleen maar begon\nLife is niet eerlijk, maar dat maakt het heerlijk\nWe stacken ze toch met veel kleuren da's tropisch\nFree al m'n homies\nIk kom van de jungle net Mowgli\nIk ren, man die ding hou het low-key\nHijs rook let op Casper het spook lay low dat is logisch\nHey broertje ik wil 4 white bitches en 2 nieuwe rollies\nIk wil doekoe pakken en verdwijnen, laag liggen net Kony\nIk wil zeggen tegen mama, hier alsjeblieft neem een stack, blow iets\n\n[Hook]\nEwa kifesh, wat is die schets, wat gaan we verdienen?\nWaar gaan we laag, blowen we saaf, gokken we tientjes?\nWat is die actie, wat is de move, wat is de beweging?\nBen on the run, altijd actief voor een nieuwe beleving\nEwa kifesh, wat is die schets, wat gaan we verdienen?\nWaar gaan we laag, blowen we saaf, gokken we tientjes?\nWat is die actie, wat is de move, wat is de beweging?\nBen on the run, altijd actief voor een nieuwe beleving", "title": "Beweging", "album": "Twenty Four Sevn 2"}], "artist": "Sevn Alias"}