{"artist": "Canibus", "songs": [{"title": "Curriculum 101", "album": "Mic Club: The Curriculum", "year": "2002-11-19", "image": "https://images.genius.com/b9fe759f8aa3195631fd3906b4b1ed0a.1000x1000x1.jpg", "lyrics": "[Intro: movie sample]\nClaims are being made that for me go far beyond the available evidence and in fact in many cases are contradicted by the evidence and that bothers me\n\n[Verse: Canibus]\nForensic psychologist Samuel Dubios explains\n\"You'll probably never understand Germaine\"\nIncoherent speeches, puzzles in pieces\nThe sub-chemical deepness of his glandular excretions\nRealms of Heaven and Hell\nGlowing angelic gel spliced with bovine leukaemia cells\nDemons in Hell they call to me, I scream, \"What can you offer me?\"\nThey reply, \"Techno-Sorcery\"\nThey tell me the meek will never inherit the world\n'Cause they're weak standing on two 12 inch feet\nI dream quasi-Draconian dreams when I sleep\nPeyote leaves mixed with the blood of a priest\nIn a room where the ceiling leaks of crimson grease\nWhere the living eats the dead and the dead reek\nRock bottom transforms human beings to beasts\nWhy the fuck you think we got canine teeth?\nIt's the optical stimuli of watching men cry\nI hope I've got time to repent before I die\nBury me at the beach if the sea is out of reach\n'Cause when I speak what's fluid becomes concrete\nLike a falcon up in the sky, ten thousand feet\nLooking down at you bitches looking at me\nPhase shifting to 45°\nI'm too crooked to see, I memorize the books that I read\nSucking from the breast of knowledge – constantly weaning\nUnbeseemingly a genius without meaning\nTry to visualize what Harry Houdini was feeling\nHandcuffed underwater without breathing\nNear death on a fatal quest for air\nBut why should anyone care? He put himself there\nHis career was based on facing his fears\nTo take destiny from the hand of the man upstairs\nHe didn't mind the cold stares he got from his peers\nThey couldn't tell him where he was going or how to get there\nIt's better to be prepared and fail\nThan to be scared and unsure of yourself and still get killed\nDon't rhyme like I used to but I still got skills\nMore than a couple confirmed kills under the belt\nHunting MCs like hunting elk\nCamouflaged in the dense brush for stealth, determined as Hell\nI don't do this for anybody except myself\nStuff a motherfucker like a trophy on my shelf\nFuck the promo nigga I do this for dolo\nFlow from the first hour to 24:00\nRound the clock as long as I've got a cup of cocoa\nBut I'll be a no-show if my girl cries, \"Don't go!\"\nAnd she gives me blow more than two times in a row\nI'd rather chill with her than kill you with a rhyme that I wrote\nCount how many mics I smoke minus the G.O.A.T\n'Bus is dope, my battling average higher than most\nWhen I'm on the mic I release fire from throat\nIf you disagree please do it quietly folks\nAnybody better than Bis must be a hoax\nBlack man? No! What about the Great White Hope?\nWhat? Man you must be sniffing great white coke\nDon't you know that's like Gary Coleman fighting the Hulk?\nStill not even quite that close, a great white\nBiting your rubber dingy boat 50 miles out from the coast\nWhat the fuck is the Mathers with you?\nI'll beat you black and blue then I'll get a tat of you too\nBetter yet I'll put a tattoo of me on you\nA ten by ten 'C' logo – neon blue\nThe most theatrical MC battle of all time\nI rip jackers like you, you know my call sign\nKiller cobras that hover over Jehovah\nIn motorized auto-giros with sycamore rotors\nHydrogen-peroxide, gaseous vapors\nTechnically these words shouldn't even rhyme off paper\nIn theory, for every soul that can hear me, I'ma blaze them\nIn practical practice my style's even greater\nCan't you see what I'm spitting? Can't you hear the difference?\nCompared to me you're energetically inefficient\nYou need ten times the enzymes to process one of my rhymes\nYou've got to rewind every one of my lines\nDo you know how to paraphrase?\nDo you even understand what the narrator is tryna say?\nThe climax explodes, nobody can foreshadow my flow\nFiguratively the language is too dope\nAcademic journals print my lyrical quotes\nThey show parallelism in all the albums I wrote\nOn any track I come off strong automatically\nWhether I write in an active or passive capacity\nPoetry that I spit is synonymous to a glyph\nWritten on tablets of clay mortar mix\nSuperb, truly superb! Analyze the words\nIt's like observing the birds fly above the Earth\nThe Eye of Horus, the miniature torii within a giant torus\nWith singularity on the chorus, I still sound enormous\nBorderline insanity trying to break through humanity's border\nWith a new curriculum every quarter\nI'm the porter of the portal of the Secret Mic Club Order\nBaptize you with Jamaican white rum and water\nIf you've got a hundred bars then I know you're a warrior\nI'll be the one who awards you and pins the medal on you\nDedicate a song to you because now you're honorable\nYou want a record deal?\nExplain the lyrical Grand Unified Field so I can test your skill\nDo it in front of the class, chart diagram it\nAnd write it in Latin not Spanish god damn it\nStep back so I can look at it\n(No puede entender las palabras que digo senior Williams?)\nHuh? What the fuck is that wack shit?\nYou're clumsy and dumb like a hand with five thumbs\nWelcome to Mic Club: Curriculum 101"}]}