{"artist": "Cadet", "songs": [{"title": "Don’t Take It Personal", "album": "The Commitment 2", "year": "2017-07-21", "image": "https://images.genius.com/85ddb72228b820b4534d88b0aebcb4be.750x734x1.jpg", "lyrics": "[Verse 1: Cadet]\nStepped in, underrated legend in the place\nThought the energy came from you\nUntil I touched mic, got the whole booth rearranged\nNew school, yeah I'm improved in a way\nWay better than them niggas that you used to behave\nThe shotty in a tracksuit like who's brave\nGot me walking like I'm using a cane\nAh shit, who's this?\nWho's tryna get busy with the kid?\nI was really getting fizzy with the fifth\nSincerely get Lizzie in the bits (Cadet, Cadet)\nBilly in the gip\nDumb money, tryna get silly with the chips\nShooting up your Apnas, Karlas, and Kuras\nI bet you can't see through the Mist\n\n[Verse 2: Ghetts]\nI'm back on my bullshit, Chicago murder spree\nIf I hit him with the full clip, his soul might end up in purgatory\nIt's nothing personal so don't take it personally\nBut I will give a nigga the whole Bible if he's got one verse for me\nWashing machine to these niggas, I wash an MC when I spin him\nWhat's an MC to a killer? Like, what's an MC when I kill him?\nYou don't wanna MC when I'm spitting, it's a serpent's phlegm\nVenomous business, earth these man when I'm firing\nHow they gonna win?\nAll kinds of elements in this\n\n[Verse 3: Cadet]\nMm, yeah I hear you, but I ain't tryna hear none of that\nIt's my team that's got these youts running back\nWhen these niggas quit grime and they ain't coming back\nAnd you had the galdem singing for you, I never had galdem singing for me\nBut them gal would fistfight for the kid, look I had the galdem swinging for me\nBro, what's your thoughts like?\nYou can see I've got diamonds in my teeth so don't be surprised every time that I talk right\nWe've got them tings that would come with a torchlight\nThey hear one Drake album, now these fuckboys think they can talk like\nThat's a newspaper, I'll put your dad on the cover for talking More Life\n\n[Verse 4: Ghetts]\nIf I didn't tell him I was coming\nAaliyah would've wrote another four-page letter to his cousin\nPress trigger and then press people button (BUCK-I)\nYou dead, nigga, mi gone: reaper suh'in (BUCK-I)\nHead full, me gwan leave it runnin' (BUCK-I)\nSome man a come on like Wayne in Shutters\nHow you mean?\nMax. Done 'im\n(10. 9. 8.) These are countdown rocket bars\n(7. 6. 5.) Sound off beat. I can show you where the pockets are\n(4. 3. 2.) You got so much so much potential\n(Listen to me) You'll be 'round a long time\n(1.) Just paste and copy dawg\n\n[Verse 5: Cadet]\nBuh!\nGot me buggin'\nKnow what I'm like when I'm under attack\nEverytime a nigga body something they be buggin'\nThey be saying I'm the reason that they never commin' back, nigga wait\nPut the whole scene on my back on my ones (Cadet calm down!)\nFuck that I ain't done\nThey got they' forearm muscles from gym\nMan come from whippin' a nigga with a gun\nAin't one of these new school niggas\nUber, Shoreditch and YouTube niggas\nRudeboy I come from a dirty jit\nI would shoot and move quick the roof off niggas\nFlip the script quick and hit these niggas\nBlew your eye quick and crip these niggas\nCadet, Cadet\nI'm Cadet, Cadet, due to evict these niggas\n'ow you mean?\n\n[Verse 6: Ghetts]\nDead man. Graveyard. Tombstone\nContract killer no loopholes\nMonopoly, chess, Cluedo\nMan's bored of the games, and you know\nTai-chi, muay thai, judo\nFuck that shit, I'm in shoot mode\nRolex, Breitling, Hublot\nI'll take man's time on the route home\nMercury. Neptune. Pluto\nGive a nigga some space you're too close\nObese heavyweight sumo used to put food on scales like Bruno\nBruno\nWho's Bruno?\nBruno. From you know\nAs in Bruno in Danger\nBruno with a Uno"}]}