{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "K-9", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1]\nSou assassino lirico, levito e ensino-te a sentir rap satirico\nSe m'atiro e vingo, é culpa do vinho onírico!\nTu bebe o sangue do saber empírico, típico..\nVivo no rídiculo, mais lívido que um mímico\nUm químico dá-me o kick e eu tipo um king fico\nChillin no cubico, com um bico de três - cúbico\nE co beat vomito do dick, vês q'sou estúpido?\nQ'som estúpido! tou longe do lúcido\nSo penso em coxa, cutchi, poncha, kush e um bom estúdio nah\n\n[Bridge]\n«we tend in our culture to make a radical distinction between drugs and foods\nWith what we call spices sort of falling somewhere in the middle..\nIn point of fact, a culture is what it eats...»\n\n[Verso 2]\nO rap game é misto mano\nBob marley nisto son\nLisbon a kingston\nCedo ou tarde invisto mon-ey!\n«2 chainz, lupe, us ou uk...»\nMas o teu ass eu troquei qd o chess eu matei!\nO game eu mudei, big banger no teu play\nTua kenga no meu plate, 'té rebento no koweit\nLoada a dica q'eu waito, solto a dica - tá feito!\nSolta a dica - tá feio! solta a brita dá um cheiro\nSol tá a abrir no canteiro, semente rebenta co telheiro\nE a planta que nasce da terra logo morre no cinzeiro..\nSó pombo no meu poleiro rumo à ponte do meu roteiro\nNao espero pela morte, falo com ela primeiro!\nSorte, donzela? solteiro! só com a bela eu me deito\nSa fodam pornostars, eu prefiro filme caseiro!\nChupo o mel e ela o leite, unha na pele, ultimo take\nLet them niggaz hate, é o meu motto tipo o Drake\nEscrevo linhas sem tinteiro dedicadas a bradas\nQue dedicam o dia inteiro a barras pesadas!\nE se sentirem um formigueiro são tropas armadas\nSubindo o teu cagueiro pa' matar as cigarras!\nVou com punhos de punheteiro fazer-te um fisting no ouvido\nAmasso a massa, pão caseiro, cuspo fogo, ficas cozido tropa\n\n[Bridge]\n«we can think of numerous examples:\nThe influence, for instance, of sugar on the growth of 19th century mercantilism\nOr the way in which the british manipulated opium policy in the far east\nOr, as you mencioned, alcohol, which has always been the drug of choice in western culture..\nWho can imagine modern industrial office culture without coffee?\nThese are major drug dependencies that have placed their stamp on the lives of\nMillions and millions of people, its simply that we chose to linguistically define it in such a way\nThat the effect is not something most people are cognisant of....»\n\n[Outro]\nComo é que querias que eu baitasse se eu a terra que tu lavras\nPa' que lavares os dentes se o que suja são palavras\nIsto e morte ao dracula, lobisomem ataca\nEsquece a bala de prata, no sono espeto-lhe a estaca\n\nComo e que querias que baitasse se eu sou cão e tu não ladras\nNo rap barko, no biter, tu já nem baitas, enfardas\nIsto e cirugia na boca de um vampiro\nConspiro com flow canino pa' te arrancar o canino", "year": "2014-06-06"}]}