{"artist": "Plies", "songs": [{"album": null, "title": "Fight Night Remix", "image": "https://images.genius.com/142f4d6c2e6ce44c7607f441746bff25.1000x1000x1.jpg", "lyrics": "[Intro]\nIf you know me know this ain't my feng shui\nCertified everywhere, ain't gotta print my resume\nTalking crazy, I pull up andele\nR.I.P to Nate Dogg, I had to regulate\n\nPublic Service Announcement\nWhere all my rich niggas at man?\nMIGO!\n\n[Hook: Takeoff]\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mamma, she keep looking at me (lil' mama!)\nIm'a knock the pussy out like fight night\nHit it with the left, hit with the right\nIm'a knock the pussy out like fight night\nBeat it with the left, beat it with the right\nIm'a knock the pussy out like fight night\n\n[Verse 1: Plies]\nNigga I walked up in the club with a rubba on\nFuck these bitches in the club, I don't bring em home\nNigga rob you before so we can't do a song\nTold that bitch I wanna force em like a fuck-a-long\nIf she don't like it in her face I told them where ya going\nIf you don't like giving head then bitch leave me alone\nDon't talk about dope on cell phones\nI pour my liquor out for niggas who got snitched on\nWhen my cuz came I told him I had a brick for em\nOther cousin told em I ain't had shit for em\nYou gonna hug me in the club, I got my pistol\nIf you don't like me pussy ho write a diss song\nChurch\n\n[Hook]\n\n[Verse 2: Takeoff]\nIf you know me know this ain't my feng shui\nCertified everywhere, ain't gotta print my resume\nTalking crazy, I pull up andele\nR.I.P to Nate Dogg, I had to regulate\nPocket rocket fire, watch him disintegrate\nIt's a truckload coming on the interstate\nSirloin steak all on my dinner plate\nYour main bitch say she wanna make a sex tape\nRich nigga, I could never be a broke nigga (rich nigga)\nBroke niggas I can never get along with them!\nAlways been hated since a little nigga (always)\nIt's forever pussy nigga gotta deal with it (rich nigga!)\n\n[Hook]\n\n[Verse 3: Quavo]\nFloat like a butterly, sting like a bee\nRumble young nigga rumble!\nLil' mamma want a nigga like me in the sheets\nIce cube knock it out like Deebo\nNow who's that talking that gangsta shit?\nSomebody gonna kick your ass\nWhen I walk up in the club I better make a thunderstorm\nLet them know that this a whole lot of cash\nRich niggas on the right all night (rich nigga)\nBroke niggas to the left by yourself (brokanese)\nNow who the hell just said that the roof on fire?\nCall 911 like Wyclef\n\n[Hook]\n\n[Verse 4: Offset]\nI'm a rich nigga, I don't like a bitch nigga\nNigga broke nigga, I don't deal with you\nAll of my niggas, official, My bitches they strippers\nMy niggas they criminals trying to get to the M&Ms\nIf your bitch is so innocent, why she sucking my children\nLast time I asked I dine and dashed and bitch I go in the building\nBad bitch make it clap, let me know ya\nYoung rich nigga on the couch talking to Oprah\nBottles in the VIP while I stand on the sofa\nI don't speak your language, Brokanese, I thought I told ya\nThese bitches they be smokin' on hookah, my nigga ballin' like Hoosiers\nGeeked up in the Double R, I scare ya bitch, Freddy Krueger\nFreddy Vermeulen\n\n[Hook]", "year": null}]}