{"artist": "L’A Capone", "songs": [{"title": "Brothers (100%)", "album": "RN4L 2 (100%)", "year": "2014-02-19", "image": "https://images.genius.com/20c0cb80fa0fd4131321ffaf10fa5efa.500x500x1.jpg", "lyrics": "[Intro: L'A Capone]\n\nBrothers . .  . I'm here with my brothers\nBrothers!\nBrothers!\n\n[Transition: L'A Capone]\n\nSee now you can fuck my bitch, cause nigga I'm the shit, I'll salute ya'!\nBut y'all know who I'm wit', so try to take my shit, I'mma shoot ya'!\n\n[Hook: L'A Capone]\n\nAnd we all lost a couple this year, so all us right here with each other\nI'm here with my brothers, in here with my brothers\nI'm here with my brothers, in here with my brothers\nI'm here with my brothers, in here with my brothers\n\n[Verse 1: L'A Capone]\n\nOnly each other, only each other\nRiding round town on that same shit, niggas get changed quick\nYou ain't seen shit\nI hope you got a blunt of loud, you can't hit my shit\nI guess I'm caught in the mix, riding the six\nAnd hell yeah, I'm on paper still toting the nick\nI promise I won't switch, you son of a bitch\nAt 16, had a dream, we was gonna' get rich, put on\nWe gone, wake up, put the pipe on\nAlways been on my own, but I stay strong\nAct got me put in my zone, feeling like I wanna' go home\nBut I'm out here, I put that bud in my ear\nI gotta' see a mil' one year\nSquad they fear, Jakes all up in our hair\nOne of us snitch, that's rare\nAnd that's on bro, I'll never ever go broke\nNigga I'll take yo' coat, while I froze\nMy lil' nigga Steve got smoked, throwing up Owe Six Owe\nGotta' lay low, niggas ain't really yo' bro, niggas ain't really yo' bro\nGotta' lay low, niggas ain't really yo' bro, niggas ain't really yo' bro\n\n[Hook: L'A Capone]\n\nAnd we all lost a couple this year, so all us right here with each other\nI'm here with my brothers, in here with my brothers\nI'm here with my brothers, in here with my brothers\nI'm here with my brothers, in here with my brothers\n\n[Verse 2: RondoNumbaNine]\n\nOnly my niggas, we all some hitters\nI'm in that glory lane, just trynna' get richer\nI'm in that glory lane, loud in my system\nThey took my bro L'A, man I can't even picture\nThey took a  fucking savage, man, bro was a killer, man\nBro was going crazy, now shit done got real\nFuck this rap shit, I say shit done got real, bro\nRun up and we kill stuff, act up, we gon' let it bust\nAnd let's get it!\nAll that fu shit I ain't wit' it, put the Glock to his muh' fucknig fitted\nNigga you wit' it, trynna' act like you ain't wit'!\nPut the pipe to his mouth like a dentist\nOn Lil' Steve, bitch I'm throwing up D's, nigga that's where I be\nSmoking on trees, a lotta' fucking money on me\nRiding up and down Front Street and I keep that heat\n\n[Transition: L'A Capone]\n\nSee now you can fuck my bitch, cause nigga I'm the shit, I'll salute ya'!\nBut y'all know who I'm wit', so try to take my shit, I'mma shoot ya'!'\n\n[Hook: L'A Capone]\n\nAnd we all lost a couple this year, so all us right here with each other\nI'm here with my brothers, in here with my brothers\nI'm here with my brothers, in here with my brothers\nI'm here with my brothers, in here with my brothers\n\n[Verse 3: Lil' Durk]\nLost Lil' Moe, feeling so weak\nLost a couple niggas in these cold ass street\nI lost my brother so I keep my heat\nMake me turn up when I see the opps tweet\nL'A my bro, Rob, Odee, Lil' Moe\nAll these hoes gon' go, when I claim my gang\nNiggas never my chain, out here looking for a stain\nAsk anybody I ain't change\nNiggas switched up for that chain\nL's or shells, they're in line\nTweak with the guys then you get flat lined\nTake that nine, free my guys\nMy bro Nine on his grind\nOTF, my niggas they shine\nTop from a opp, she blow my mind\nKeep my gun, shit real I say on my son\nI'm trynna' get rich early in the morning, for the squad\nBetter put Kush in that blunt, put four in the crush, I stunt\nI can't trust, any nigga [?] his gun, that mean he ain't real at all\nI'mma ball, lil' nigga 'bout to do it tall\nI just wanna' live it all!\nI call my bro, do a drill for the squad, I go\nTwo gun cases, I'll blow, so let 'em all know\nI'mma ride or die for my squad!\nI'mma ride and die for my squad!\n\n[Hook: L'A Capone]\n\nI'm here with my brothers, right here with my brothers\nI'm here with my brothers, right here with my brothers\nI'm here with my brothers, right here with my brothers\nI'm here with my brothers, right here with my brothers"}]}