{"songs": [{"year": "1989-10-10", "image": "https://images.genius.com/7c84ab3a345d944b61d4c41970988d2c.1000x1000x1.jpg", "title": "I Hear Music", "album": "The Biz Never Sleeps", "lyrics": "One two, one two\nYou're listenin to the grand groovin sounds\nOf the diabolical energetical B-I-Z\nEmmezah-A-Rrrah-K\nAnd this goes out to my DJ\nThe cutmaster that no one cuts faster than\nC-double-oh-L V\nDrumroll V\n\n[Verse One]\nIt's a different kind of sound that's in the air\nIt's not shots, firecrackers, or a car that's there\nA little different noise for your listenin pleasure\nA sample from a record that's a four bar measure\nAdults think this music is just a big headache\nThey think all this hard work, is just a piece of cake\nThey must be buggin, right out of they socks\nWhy don't they get up and try to do, the human beatbox\nCause back in the days when there was just block parties\nA DJ would set up his equipment, and start these\nLive performances, and DJ tricks\nA lot of different DJ's was on the mix\nIt is a proven fact, music is a universal language\nFrom the tip of Long Island to the Verrezano Bridge\nWe won awards and served them by the millions\nThe more more years go by, the more we be killin 'em\nThey said it's just a fad, it will never last a year\nAll of a sudden, ten years later - \"I hear music\"\n\n[Chorus: Cool V scratches \"I hear music in the street\" over and over]\n\nCool V, give me a drum roll\n\n[Verse Two]\nI can't believe how hip-hop has progressed\nWith more and more groups that have finesse\nWe have groups on the East and West coast with different names\nWe all play a part if we didn't we'd go in flames\nWe all got to stick together as one\nBut at the same time, still have fun\nCause you don't wanna lose the love for the music\nWhen you have it keep it, and make use of it\nThis is a lesson from the S-K Biz\nCause nobody else is gonna tell you like it is\nEveryone thought that rap was just a phase\nBut it still continue, to muse and amaze\nIt gives people chance to show they true talents\nInstead of submittin to the crime and violence\nPeople said to me the S-K-B\nIs rap gonna stay until infinity?\nAs long as me and V be makin up the beats\nYou will hear people sayin - \"I hear music\"\n\n[Chorus]\n\nCool V, give me a drum roll\n\n[Verse Three]\nThis is the ending, conclusion, kapiche?\nOf this new hip-hop masterpiece\nAbout people countin chickens before they're hatched\nRecollatin on somethin that they can't match\nThey're creatin sounds of a hip-hop human bein\nWhether you're American or European\nOr even if you're from the West or East coast\nI'd like to thank all of you, save the most\nDon't diss each other by sayin who's better\nJust do it the best way, and stick together\nWith different rhyme techniques and DJ cuts\nAnd be crazy ambitious, and have a lot of guts\nAnd the people buyin, thanks for your support\nCause if it wasn't for you, we'd all fall short\nAs long as there's radio, cars and jeeps\nYou know what you will hear?\n\n[Chorus]\n\nWhat, what?  What, what what what what?\nYo V, yo yo what what what what what what what you hear?\nI can't hear you man, scratch it up one mo' time!\nYo what you hear?\nYo Paul Sea, yo yo, what wha-what you hear?\nYo Godfather D, I ain't hear what he said, what you hear?"}], "artist": "Biz Markie"}