{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "Let Me Rap", "year": "2014-01-01", "lyrics": "[Intro]\nI love you women, but I hate you bitches\nLet me rap\nI love you women, but I hate you bitches\nLet me rap\n\n[Verse 1]\nYeah, uh\nI'm like a bougie soccer player, I can't kick it with niggas who got no goals\nHow is you driven if niggas all in your road?\nEven potholes feeling like Apollo\nShit done got Rocky, uh\nThat ain't ever stop me, uh\nMommy played poppy, uh\nPoppy played bitch, uh\nLeft us in a ditch but somehow we never flinched, uh\nSitting on this bench, looking at these starters\nDamn these niggas weak, knowing that we harder\nThey tryna guard the--\nThey tryna guard the best player in some slippers\nI hope my background could fit up in your picture\nSpeaking of picture, she posing for the social\nShe think she global, but she forever local\nThat pose get you big likes, huh?\nYou hoes think that shit tight, huh?\nBut let me stop, I see a diamond in your past\nAnd gems are carried but you only show your mask\nAnd now your ass is getting treated like smashes\nAll beat up, but you done seen Cassius\nTook the Clay, formed the gun then I shot\nLike nigga, hey, this 'bout as fake as your plot\nAnd word to 2Pac, but I'm all like X-Pac\nTelling all you hoes \"suck it\"\nYou won't get no next shot, uh\n\n[Hook]\nI want some real women to touch y'all bitches\nUntil then I'mma say \"fuck y'all bitches\"\nMan, real rap\nI want some real women to touch y'all bitches\nUntil then I'mma say \"fuck y'all bitches\"\nReal rap\n\n[Break]\nI love you women, but I hate you bitches\nLet me rap\n\n[Verse 2]\nUh, now let that resonate\nSame shit that got you feeling bomb can make you detonate\nDon't hesitate\nTried to elevate her, but she gotta learn these steps as she stares\nIn that mirror, what the fuck you think reflect?\nIt ain't no real shit\nNever put a chain over niggas I'm in the field with\nAnd never let a ratchet leave me whipped, uh\nIf life is a bitch I swear she think she used to own a nigga\nNow she a slave to my motherfucking dick\nI built this Underground Railroad to get me out this hellhole\nWalking in my shoes'd be the first time they felt soul\nBrenda Had a Baby? No, Brenda had a sister too\nBut it's crazy cause she grew up with a different view\nRecognized the problem, and figured out the answer\nShe grew up in detention, and now she got standards\nThat's real rap\n\n[Hook 2]\nI swear that story should touch y'all bitches\nAnd if not I'mma say fuck y'all bitches\nMan, real rap\nI want some real women to touch y'all bitches\nUntil then I'mma say \"fuck y'all bitches\"", "image": "https://images.genius.com/967988d72ade953e4d1121eb78757aa7.1000x1000x1.jpg"}]}