{"artist": "G-Eazy", "songs": [{"title": "Calm Down", "album": "When It’s Dark Out", "year": "2015-12-04", "image": "https://images.genius.com/d4ef9c5995a8ce0a118dd8381b4f1169.959x959x1.jpg", "lyrics": "[Intro]\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\n\n[Verse 1]\nI've been sitting on the charts like a beach chair\nMy last album spent 52 weeks there\nAlmost finished with the second, you should be scared\nStorms coming you should go inside and prepare\nNo shortcuts there ain't no cheats there\nI brought the whole city out like a street fair, yeah\nAnd fuck it I'm the coldest white rapper in the game\nSince the one with the bleached hair\nYeah, you love it when I talk shit\nI get around, yeah I'm on my 2Pac shit\nI kinda feel there's no girl I could not get\nI'm not found at the function if it's not lit\nYeah, it's nothing that no one can tell me\nI made it here dolo, nobody to help me\nFrom the Bay, the birthplace of the hyphy\nSo bitch, come and say to my face you don't like me\n\n[Hook]\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\n\n[Verse 2]\nIt's like I'm always found where the troubles at\nDrinking brown shit now I'm off cup of that\nYour girl's on me, what's up with that?\nIf I like her, all this shit will really take is a double tap\nHaving visions of fucking an A-list singer, Kardashian, or a Jenner\nBut Ye's got Kim, Tyga swooped up Kylie\nSo there's one left watch me go get her\nYeah, they tell me calm down\nFuck that I'm too lit can't calm down\nI'm so drunk right now I might fall down\nAnd I don't give a fuck how boring do y'all sound\nUp and down on a Wednesday\nThen we do the same shit the next day\nThe next star out the Bay is Eazy\nYadadamean? For sho'\nYadadamean? For sheezy\n\n[Hook]\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?\n\n[Outro]\nMy love is, working hard yadadamean?\nMy love is, working hard yadadamean?"}]}