{"artist": "Bow Wow", "songs": [{"album": "Like Mike - Music From the Motion Picture ", "title": "Basketball", "year": "2002-01-01", "lyrics": "[Hook: Fundisha]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\n\n[Verse 1: Lil Bow Wow]\nYeah, now basketball is my favorite sport\nI like the way they dribble up and down the court\nI keep it so fresh on the microphone\nI like no interruptions when the game is on\nI like slam dunk, to take me to the hoop\nMy favorite play is the alley-oop\nI like the pick-and-roll\nI like the give-and-go\nIn this basketball, Bow Wow, let's go\n\n[Hook: Fundisha]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\n\n[Verse 2: Lil Bow Wow]\nI got the rock in my hands\nAin't no telling what I'm gonna do with it\nWhen I come position I'mma act a fool with it\nI might cross you up fake one way\nTurn around and hit you with you with the MJ fadeaway\nI'm throwing dime passes like J. Kidd\nTaking cats to the rack\nAnd I'm dunking on them like T. Mac\nWhen I'm in the paint I play with that Alonzo style\nI'm like Darius cause I can shoot two miles\n\n[Verse 3: Fabolous]\nDon't too many players get offers like me\nBack and forth, I'll likely\nShake the checks off your Nikes\nThey almost had me in a suit at the draft\n'Cause it look like a free throw when I be shooting from half\nThe first step like Iverson - blow past you\nUsually nothing but net, but I can go glass too\nWhen I'm in the paint the defense so shook\nThey dont know if I'mma put up a slow hook, or dish off a no-look\nTo drive the lane would be dumb, though\n'Cause I send it back at you then give you the finger like Mutumbo\nShorty, over the summer, you might've boosted an inch\nBut as long as Fabolous is playing, get used to the bench\nSee my game consist of a whole lotta\nMoves you would think I learned from the Harlem Globetrotters\nJ.D. gon lead us to a ring\nFab and Bow Wow the only players that make cheerleaders wanna sing\n\n[Hook: Fundisha]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\n\n[Verse 4: Jermaine Dupri]\nNow tell me were you in the joint\nThe night MJ scored 63 points\nWhen the Lakers won titles back to back\nDidn't give nobody, no kind of slack\nWhen Vince Carter came and stuck his arm in the rim\nEverybody went crazy in the whole damn gym\nDikembe Mutombo standing tall\nPlaying D with desire, it's basketball\n\n[Hook: Fundisha]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball", "image": "https://images.genius.com/b13a477bc123909fa992a5b520acc2a3.300x300x1.jpg"}]}