{"artist": "Willie D", "songs": [{"year": null, "lyrics": "Hey, what's up, shit\nIt's Willie D\nA.K.A. Gangster of Love\nOh, me? I'm a scorpio\nAnd, uh, you know what they say about scorpios\nYou know they say we're vindictive\nAnd we like to get freaky and shit\nAnd that might be true\nMyself, I like women that, uh\nSuck a nut, chew a little butt\nAnd uh, shit, if you like women, shit, that's cool too\nWe can mix it up and make a gumbo or something like that\nYou know, shit\nBut you know what pleases me most about a woman\nIf she can suck some good dick you know\nNow that's, that's the shit right there\nAnd uh, and if you fit this description baby\nHa, ha, yeah, this is what I want you to do\n\n[Gerome Hulett]\nTake my manhood\nDeep throat it baby, like a woman should\nWhy don't you show me how good it can be\nLay it all on me, I want you to\nThroat, throat, throat, throat on  (4x)\n\nVerse 1: [Willie D]\nWhat's my name? (Willie D)\nWhat's my game? (R.A.P.)\nWhat's my sign? (scorpio)\nNow let me tell y'all about this ho\nI knew this bitch named Alexia\nShe fronted on the pussy cause she thought she was sexier\nThan any other motherfucker that I fucked with\nOne week later she was sucking on my homie's dick\nLike a pro, you know she did the whole crew\nI heard that she sucked a little pussy too\nShe licked my dick and my nuts from behind\nThen she ran this line (you know it's my first time)\nBitch stop lying, and pick up your fade\nYou been a freak since the third grade\nThat's what I told the little heffer\nWalking around thinking her pussy's special\nNiggas think she's a square\nBut she done seen more dicks than Hanes underwear\nSo if a bitch want to fuck I'll make her holler\nBut before I nut, the bitch gotta\n\n[Gerome Hulett]\nThroat, throat, throat, throat on   (4x)\n\nVerse 2: [Rasir X]\n\nYeah, it's that big daddy y'all\nAnd this shit's kind of freaky tonight, yeah\nCarrie, motherfucking scorpio\nI like big hoes cause I like to make gumbo\nBig bitch that like to fuck\nTake my dick, let her friend have a quick suck\nGot a mouth sopped like a mop\nWhen it comes to dick slop, she don't waste one drop\nLike to eat and get her pussy ate\nIn a room full of bitches, she'll masturbate\nBig and sexy, wear a lot of lipstick\nI like to watch her tongue-kiss with my other bitch\nTake her finger, slide it up her pussy\nShow her girlfriends that Carrie make whooptie\nAnd you niggas just shit out of luck\nYou a wasted fuck cause her fantasy's locked up\nBut I'm the key to her imagination\nWhen your girl's filling out my application\nShe have\n\n[Gerome Hulett]\nThroat, throat, throat, throat on   (2x)\n\nVerse 3: [Sho]\nVirgo, a nigga named Sho\nI like a bitch to lick from elbow to asshole\nThe type of bitch that never quit\nThe type of bitch that comes to my crib and bring her own flick\nShe's a freak and she ain't scared to let it out\nThe type of bitch to wake a nigga up with my dick in her mouth\nShe's a ho, but she's undercover\nAnd quick to take advantage of you friendly ass motherfuckers\nFor the ones who step and don't know her rep\nKissing in public with my nut on this bitch breath\nShe want your ass for security\nYou leasing the body, but the pussy belong to me\nAnd when you in the pussy don't you get the notion\nThat you just a little rock in the ocean\nI know you all serious and shit\nAnd you'd probably have a fit if you knew I told your bitch this\n\n[Jerome Hulett]\nThroat on, throat on....", "image": "https://images.genius.com/64f58472036475b394d3cdeb5a8c499f.770x768x1.jpg", "album": "Play Witcha Mama", "title": "Throat"}]}