{"songs": [{"title": "Don’t Forget", "lyrics": "[Intro]\nI'ma tell you three bitch-ass hustlers that I don't like\nOne of 'em is a bitch-ass nigga who just got a job and with his first check he gon' score some dope and quit\nThen you see his bitch-ass two weeks later, now he dead broke on his ass\nNow you ain't got no job, bitch-ass nigga\n\n[Chorus]\nOne, get some paper (Paper), two, ya get some more (Some more)\nThree, it's time to put them burglar bars on the doors (Fo' sho)\nFive, watch for 12, nigga, they gon' kick it in (In)\nSix is for the 1st, my nigga, what you tryna spend? (Tryna spend)\nSeven, don't ever put that pot down, nigga (Nah)\nEight, don't forget 'bout how that Glock sound, nigga (Nah)\nNine, sucker snitches bring your stock down, nigga (Nigga)\nTen, don't forget to let your top down, nigga (Let's go)\n\n[Verse 1]\nThem ninas is sixty-five, you what that nigga spent? (Woo)\nWe countin' them blessings, nigga, we know that they heaven sent\nMy future I'm manifestin' is all in this vision board\nWhen you're willin' to risk it all that's when you know that your vision bold (Ha-haa)\nAll this Spam and Ramen noodles, I swear that shit gettin' old (Old)\nAll them stamps in the middle, nigga, just like a centerfold (Yeah)\nStepped on like Sigma Phi, that shit'll be hard to sell (Yeah)\nWrapped up like Saint Nick, sometime it be hard to tell (Tell)\nServin' in front of church so I can pray for my sins (Woo)\nSorry to bother, Lord, but I want that black Benz (Yeah)\nPray I can call the pug, cash out a flat ten (Ten)\nPlug get to playin', though, I'ma show 'em that MAC-10\n\n[Interlude]\nSecond one is old hustle-to-get-high-ass nigga\nBuy a motherfuckin' ounce of weed and tryna sell half of it and smoke the rest\nBitch-ass nigga, you gon' get them old skimpy-ass sacks away from me, bitch-ass nigga\n\n[Chorus]\nOne, get some paper (Paper), two, ya get some more (Some more)\nThree, it's time to put them burglar bars on the doors (Fo' sho)\nFive, watch for 12, nigga, they gon' kick it in (In)\nSix is for the 1st, my nigga, what you tryna spend? (Tryna spend)\nSeven, don't ever put that pot down, nigga (Nah)\nEight, don't forget 'bout how that Glock sound, nigga (Nah)\nNine, sucker snitches bring your stock down, nigga (Nigga)\nTen, don't forget to let your top down, nigga (Let's go, yeah)\n\n[Verse 2]\nBlue when they wrapped right, got smoked like a crack pipe (Damn)\nIf I'm playin' with it, they gave 'em that act-right (Woo)\nMy cousin was traffickin', he got stopped for a tail light (Damn)\nHe went in and came out, never said what that cell like (Nah)\n'Cause when he was in middle school, start hustlin' and dropped out\nPublic defender, he caught a case and he copped out\nLittle light skin what's-his-name, he was gettin' his bread right (Yeah)\nSmoked him on Madden Ave, he got killed by the egg fight (Woo)\nWhat about chitty-chat? He be keepin' that bread on him\nI be keepin' my distance, though, 'cause I heard the feds on him\nAn apartment with Ceddy-boy, he taught me to stretch that (Stretch that)\nLong live his brother Alph, where the fuck was his vest at?\n\n[Interlude]\nThe third one is an old dope fiend-ass nigga who be bringin' you a lick\nAnd every time they bring you somethin' they ask for somethin'\n\"Yeah, you know I brought them to you, drop me somethin'\"\nYo, get yo' bitch-ass away from me, ho-ass nigga\n\n[Chorus]\nOne, get some paper (Paper), two, ya get some more (Some more)\nThree, it's time to put them burglar bars on the doors (Fo' sho)\nFive, watch for 12, nigga, they gon' kick it in (In)\nSix is for the 1st, my nigga, what you tryna spend? (Tryna spend)\nSeven, don't ever put that pot down, nigga (Nah)\nEight, don't forget 'bout how that Glock sound, nigga (Nah)\nNine, sucker snitches bring your stock down, nigga (Nigga)\nTen, don't forget to let your top down, nigga (Let's go, yeah)", "album": "TM104: The Legend of the Snowman", "year": "2019-08-23", "image": "https://images.genius.com/bc6135011548a24a95a5c16c968a3106.1000x1000x1.jpg"}], "artist": "Jeezy"}