{"artist": "50 Cent", "songs": [{"album": "Takin’ It to the Streets (G-Unit Radio Part 3)", "image": "https://images.genius.com/d0f9be998c061b94448578d7511cd0de.496x500x1.jpg", "title": "Freestyle (Takin’ It To The Streets)", "lyrics": "[Intro: 50 Cent]\nYeah word to B.I.G. man, you niggas have some audacity\nSell four mil' then you're half of me\nGet off my dick on this shit, I know y'all niggas copying my style\n\n[Chorus: 50 Cent]\nThey stay at home all alone in the zone off of 50 shit\nThat gangsta music, that makes 'em wanna grab the chrome\nAnd just roam on they own\nThen do it how the gangstas do it, aye\n\n[Verse: 50 Cent]\nYou niggas want problems you're welcome\nFrank's not around anymore, New York's mine\nBlood set, Crip set, gangsta respect\nI give niggas the green light, ya get ya whole crew wet\nYou've been rappin' a long time you ain't got chips yet\nYou had that ounce a whole week, nigga you ain't flip bricks\nBefore I leave the crib I make for sure I don't forget shit\nMac, check, clip, check, vest, check, I'm ready to roll\nIt's no contest, I'm the coldest from the East\nNiggas mad I'm doin' good so I wake up to new beef\nNiggas sayin': \"yeah, I know 50 back when his name was Boo\"\n\"When he used to pump rock on that roof, before he blew\"\nThen when they come through sayin' what's up, I'm like: \"who are you?\"\nWe ain't never made no money together then we ain't cool\nCocaine, baking soda, pot full of boiling water\nTeach ya how to cook crack, nigga, how ya like that?\nTurn a buck into a stack, man I mean a G stack\nJust took you from three-and-a-half to fourteen, you peep that shit\nDeep shit, keep shit on the low nigga\nWe roll shit, smoke shit, pass the dro nigga\n\n[Chorus: 50 Cent]\nThey stay at home all alone in the zone off of 50 shit\nThat gangsta music, aye, that makes 'em wanna grab the chrome and just roam on they own\nThen do it how the gangstas do it, aye\n\n[Outro: 50 Cent]\nYeah man, keep it real gangsta like, you know what I'm sayin'\nNovember Fourth, G-Unit album in stores\nNovember Fourth, G-Unit sneakers in stores\nIt's goin' down like that you know what I'm sayin'\nSilverback guerillas in the concrete jungle baby\nYou gotta love it", "year": "2003-08-13"}]}