{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/8518dd2d23ac286b62bc5bd0d0d3d6db.1000x1000x1.jpg", "title": "Blessed Are Those", "year": "1998-03-10", "album": "Heavy Mental", "lyrics": "[Intro]\nNo monument will mark my resting place. I will leave only this, the story of my life. I have lived fully and deeply. I have tasted passion, crime and even murder. It is for you to judge me. You must weigh the good against the evil, the passion against the tenderness, the crime against the charity, the pleasure against the pain\n\n[Chorus: Killah Priest]\nIt goes: life, difficult times and mad crimes\nSome pay the price, while others refine\nBlessed are those who struggle, God loves you\nAnd Wisdom is the principle thing for Kings and Queens\n(repeat 2X)\n\n[Verse One: Killah Priest]\nMany of lives will end, it's like a sad song from a violin\nTrapped like Daniel's in the Lion's Den\nTryna pierce the iron skin of Leviathan\nSouls blowing in the violent winds\nGod help us, if we die in sin\nI hear the trials in the cries of men, that's when the riot begins\nLike things never get better, we forever\nServing Nebuchadnezzar since the days of our ancestors\nSlaves to a mad pleasure, building great architectures\nSharp dressers, smart professors\nStart my lecture, I build lyrics like an art director\nShow it to you like the film projector\nBlessed Are Those who struggle, from day to day we all hustle\nComing home with sore muscles, scarred faces\nScuffed knuckles, we all share the same trouble\nSeparated couples, sometimes it seem like\nThere's no escaping, the clutches of Satan\nSpending years in state pens, awaiting patient\nDreams of a scholarship, ended by a hollowtip\nPolitics and number slips\n\n[Hook]\n\nVerse Two: Killah Priest\n\nOnce shoved in ships, now we Bloods and Crips\nThugs with clips, niggas who love their cliques\nHit the clubs and shit so they can rub their hips\nHugs and flicks, niggas with drugs and whips\nCash Rules this Rotten Apple, they got a worm in it\nCorrupt sinners, in my man's Jeep\nWith the windows tinted, sipping Guinness\nObserving all the clinics and liquor spots\nThey make me lick a shot through the rooftop\nI never seen the glory, in the ghetto it's the same story\nCigarette butts and cold coffee\nBlack faces and white mouths\nThey cry out, for the White House\nAin't no wealth shared, it's welfare\nAnd poor health care, self scared\nIt's senseless, the way they got our black princess\nOn public assistance to end our existence\n\n[Hook]\n\nIt's a blessing... to struggle\nIt's a blessing...\n(repeat 2X)\nYeahhyeahhh, it's a blessing, just a blessing\nIt's a blessing... *fades*"}]}