{"songs": [{"year": null, "image": "https://images.genius.com/bfae6ca47734fc949e897a8d7d4f060e.498x500x1.jpg", "title": "On That Natural High", "album": "Back With the Thugz", "lyrics": "[Intro]\nYeah, Capone, we back at it again\nShoutouts Bone Thugs 'N' Harmony\nWassup, young Layzie Bone?\nYoung Krayzie Bone? Young Wish Bone?\nCongratulations, Flesh N Bone\nFor finally gettin' up out of jail\nI am Bizzy Bone, the Kid\nYoung Glory Fend in full affect after the assention\nYes, indeed no tension\nAnd just remember, never forget to mention\nGod first, uh, come on, come on\n\n[Verse 1]\nYeah, I say my preachy flow like cream stackery umbrella\nHoly water to shower my skeletons\nAnd gather my Bones together\nLet the world wind swirl inside of my vessel\nHave no association with the Devil\nNah, nigga, Heaven is on my level\nYou never speak to the Savior\nCastin' them down quietly, pick me against the irony\nTelevision with wings, be gang-bangin' the spirit\nLeave me the fuck alone, I've been cool since Jesus feel us\n\n[Chorus]\nTake a breath and breath it\nThat's what I do when I'm on that oxygen\nTake a breath and breath it\nIt's just like Heaven it puts me on a natural high\nTake a breath and breath it\nJust take a breath and you will touch the sky\nTake a breath and breath it\nYou know that oxygen puts me on a cloud\n\n[Verse 2]\nI'm smoother then Omarion, strong soldier like Gibson\nBelly-dancin' like gypsies, carryin' on a mission\nTipsy upon this oxygen, snortin' the toxin given\nFocusin' on the molecules, no focus on vixen\nCrack money my recipe, Kentucky Fried Chicken\nLifted up with wings of angels with no predictions\nI'm posted up like missin' dogs, barkin' towards expedition\nFather Jesus keep on servin' them, uh, and I won't listen\nIt's like revalations, they took us to the beginnin'\nAnd even if we lose, we still winnin'\nWatch out 'cause Judas isn't\nAnd time is so forgivin', but some of us overdid it\nGoodfellas, we hoodfellas, you know I'm on this mission\nHolla back!\n\n[Chorus]\nTake a breath and breath it\nThat's what I do when I'm on that oxygen\nTake a breath and breath it\nIt's just like Heaven it puts me on a natural high\nTake a breath and breath it\nJust take a breath and you will touch the sky\nTake a breath and breath it\nYou know that oxygen puts me on a cloud\n\n[Verse 3]\nAll lions need a lion, and God don't need a thing\nI sing to the most masterful: we slaves, not kings\nAnd I bring fire from the Heaven if I could not ming\nI'm like a shadow, you enlighten me to tend so many beings\nI said send me twelve thousand, and ruben the same thing\nBenjamen get to sayin' we just gon' take the shame\nSlain lambs on credus, like pigs with no breakfast\nKids with no destiny, loyal to Christ excellent\nMathematics and excellence\n\n[Chorus]\nTake a breath and breath it\nThat's what I do when I'm on that oxygen\nTake a breath and breath it\nIt's just like Heaven it puts me on a natural high\nTake a breath and breath it\nJust take a breath and you will touch the sky\nTake a breath and breath it\nYou know that oxygen puts me on a cloud"}], "artist": "Bizzy Bone"}