{"artist": "Baka Not Nice", "songs": [{"lyrics": "[Intro]\nBruh, you got me turnt up?\nGyah, gyah!\n\n[Chorus]\nI'm all year 'round the road, man (yeah yeah, yeah yeah)\nFell in love with the dope game, ooh (ooh)\nOn the corner, yeah, I'm with that thang (on the corner, yuh, yuh)\nYeah, I'm 'bout to sell the whole thang (sell the whole thang)\nHit my celly, I got that weed, I got the ease, I got the molly\nWhat you need? I got anything (anything, yuh, yuh)\nAll these fiends hit my phone, mayne (buckets)\nI got used to the dope game (gyah, gyah, gyah)\n\n[Verse 1]\nI got the clout so they actin' like they love me now (love me now)\nThey never seen me so they makin' all these stories now (stories), yeah\nI'm 'bout my money, I'm all in the road and I'm doin' these shows (show, show)\nTold him to meet me in person, he met me in person, he froze\nWatch me whip, watch me churn\nLight the spliff, watch it burn\nYeah, I came to take your turn\nAll these niggas 'bout to learn\n\n[Chorus]\nI'm all year 'round the road, man\nFell in love with the dope game, ooh\nOn the corner, yeah, I'm with that thang (on the corner, yeah)\nYeah, I'm 'bout to sell the whole thang (woo, woo, woo, woo)\nHit my celly, I got that weed, I got the ease, I got the molly\nWhat you need? I got anything\nAll these fiends hit my phone, mayne (buckets)\nI got used to the dope game (gyah, gyah, gyah, gyah)\n\n[Verse 2]\nI said it's all, I said it's all (said it's all)\nI'm gettin' thrown, I'm in my zone (in my zone)\nI played this song, she ran the dome\nI sent her home, now she gone, yeah\n[?], I'm on the road (I'm on the road, yeah, yeah)\nMiddle of the summer, I got that snow (woo)\nI got that dope (yeah), government know (yeah)\nAnd like [?], I'ma run the chopper\n\n[Chorus]\nI'm all year 'round the road, man\nFell in love with the dope game, ooh\nOn the corner, yeah, I'm with that thang (yeah)\nYeah, I'm 'bout to sell the whole thang (yeah, yeah, yeah, yeah)\nHit my celly, I got that weed, I got the ease, I got the molly\nWhat you need? I got anything (Kelly, Kelly, Kelly, Kelly, Kelly)\nAll these fiends hit my phone, mayne (buckets)\nI got used to the dope game (gyah, gyah, gyah)\n\n[Bridge]\nI'ma whip it real slow (whip, whip)\nI'ma break it down, hoe (break it, break it)\nBangin' of all these hoes (bang, bang, bang)\nI'ma whip it real slow (whip, whip)\n\n[Chorus]\nI'm all year 'round the road, man (yeah)\nFell in love with the dope game, ooh\nOn the corner, yeah, I'm with that thang\nAnd I'm 'bout to sell the whole thang\nHit my celly, I got that weed, I got the ease, I got the molly\nWhat you need? I got anything\nAll these fiends hit my phone, mayne\nI got used to the dope game (woo, woo, woo, woo, woo)\n\n[Outro]\nGyah! Get it!\nTurn it up, on them niggas so we get it, yeah\nAll you bitch niggas know that we 'bout it\nIf it were about my squad, [?]\nWooh! Come on", "image": "https://images.genius.com/6f65557f06a535664706802e2235db50.1000x1000x1.jpg", "year": "2018-08-03", "title": "Dope Game", "album": "4Milli"}]}