{"artist": "Canibus", "songs": [{"title": "Benny Riley", "album": "Hip-Hop for $ale", "year": "2005-11-01", "image": "https://images.genius.com/b82ecfb1a2e65da6dae50388ae145f8f.600x600x1.jpg", "lyrics": "[Intro]\nDJ's, cuttin up beats and stuff like that and\nThat was my first exposure to the whole, artistry in hip-hop\nThere is nothing in this music, that I don't wanna hear\nThere is words, that are kind of syncopated and rhythmic\nAnd there's this hot drum track, it's great!\n\n[Hook: repeat 2X]\n\"This is, this is great!  This is, this is great!\"\nAnd I could hear, this enormous\n\"This is, this is great!  This is, this is great!\"\nThis is music, I've been waiting all my life to hear\n\n[Canibus]\nAiyyo!  I don't give a fuck, if you gettin some cash\nOr gettin some ass, if I was there I'd pick up the tab\nTalk to a rag, tell you to wipe your stinkin ass\nGet back to the lab, make sure hip-hop last\nThrough death or dishonor, I do this cause I wanna\nYour body armor don't protect you from your karma\nI'm ready for the encounter like a titty bar bouncer\nOr Muhammad at the Mini-Mart counter with four-pounders\nQuick Draw McGraw spitter, let me see your hands jitter\nI'll hit'cha where the good Lord split'cha\nYou faggot-ass niggas are see-through\nI treat you like we in the same cell, but I'm Bugsy Siegel\nSmack your teeth loose, the street juice\nGo to court in cheap suits, givin testimony over beat loops\nTake 'em to my hood, show the evil I'm from\nThey can't blame me for the evil I done, now they see where I run\nAnd why I keep a tight leash on the gun\nWhy my speech is so revered by the young, cause my spirit is young\nA nigga spittin LIKE THAT, got SERIOUS LUNGS\nYo I'm serious SON, he a FURIOUS ONE!\n\n[Hook]\n\n[Canibus]\nYo, the name Benny Riley, the trip took twenty-eight days\nFrom New York to Cali, drivin through alleys\nMy mom mad at me, my dad laughs at me\nMy life's a track meet, I need this record deal\nPrecious, she got the freshest breast-es, and the ass from heaven\n36-24-37\nShe the second broad I ever humped, under a bridge\nBut she the first broad I ever fucked with in the record biz\nDesi told her I was crazy and she called the feds\nThe bitch didn't know any better, I let her live\nShe don't know Desi is a greasy fuckin pig\nAnd he's settin me up for somethin he knows I never did\nWhen I see him I'ma put the Smith & Wesson to his head\nTo change his outlook on life\nMaybe I'd show him what it's like to be DEAD\nLike the way I look at lyrics, I kill it 'til they DEAD\nIt's that vivid; got skills to kill the rap business\nGot bills to put a contract on the witness if he rat-snitchin\nYou niggas in the back, thinkin holds 'til your next actin role\nGet buried wit'cha cash and gold\nActs that sold, family of Marlon Brando broke\nShattered hopes, rappers choked, took it like a man though\nBenny Riley is the closest thing to Canibus yo\nNiggas just don't be understandin his flow, until the hammer let go\nGrab the mic and cold damage the show\nGet split with bananas, flows of the Canibus blow\n\n[Hook]\n\n[Outro]\nThis is music, I've been waiting all my life to hear\nAnd I didn't know it"}]}