{"artist": "WC", "songs": [{"year": null, "lyrics": "[Verse 1: WC]\nNineteen-ninety-eight, damn I can't believe it\nWhoever thought, throughout the drama, we'd live to see it\nSo many of us done lost lives to the streets\nAs we reminisce I'm pourin liquor for the deceased\nThinkin bout the times that I spent with many of em\nHopin that the Lord let me see the millenium\nTrapped in this ghetto main, seekin better days\nFightin for my conscience, tryin to shake these wicked ways\nI know it's wrong but it's hard to change\nAll my life, all I ever knew was hustle and game\nLookin for answers ever since I was a adolescent\nFaced with rejection, early age stressin\nBut now ten years later with doodoo respect\nI'm bustin million dollar raps and six digit checks\nShowin love to my peeps and my love don't change\nHere's a toast to you fakes, huh, here's to better days\n\n[Chorus: Jon B]\nMight sound strange, but I just can't run away\nI can't run, run, it might sound strange\nBut I just can't run away\nI can't run, no, run away\n\n[Verse 2: WC]\nTouch a meal ticket, shake a spot for good\nNever, I still got love for the neighborhood\nAnd even though now it's infested with gunplay\nOn most days like Bootsy I can't stay away\nCause if I shook like y'all shook on me\nThen whose gon' stay and guide the way for the lil homies?\nI can't turn my head on my folks\nSo I stay visible in these streets and try to give hope\nBorn in the ghetto, raised in the ghetto\nGot love for the ghetto, I can't forget the ghetto\nHow come everytime we get some change in our can\nWe run away and try to move out as far as we can?\nI know that jealousy's the devil's greed but you worse\nThan a devil when you turn your back on these young G's\nNow feel every word that I say, hear my cry\nAs I struggle out of thirst and search for better days\n\n[Chorus: Jon B]\nMight sound strange, but I just can't run away\nI can't run, run, run away!\nSaid I just can't run away\nI can't run, run, run away\nNo I just can't run away\nI can't run, run, runnnnnn away!\n\n[Verse 3: WC]\nAnother day another dollar, it feels good to look around\nAnd see I'm surrounded by real riders\nChildhood comrades I ran with for years\nShared the same beer and tears over the same peers\nPlayer haters swearin that all we all G's\nOff each others strength with these, regulates the same cheese\nNo jealousy we all family like Sister Sledge\nLace each other with game, so I can spin beer cans\nWatch our kids grow together, as we get old together\nLoc I mean this, let no one come in between this\nKeep our business among us, behind doors and eyes closed\nOn those we consider as foes\nOutsiders never exposed to your hustle\nPlus I'm, never been one likely to trust em\nNo negative association, just dedication\nTo watch our paper sprout like this bud mutation\n\n[Chorus: Jon B]\nMight sound strange, but I just can't run away\nI can't run, run, run away!\nNo I just can't run away\nI can't run, I can't runnnnnnn away!\nNo I just can't run away\nI can't run run run run runnnnnn away!", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "Better Days"}]}