{"artist": "Drake", "songs": [{"year": "2013-03-07", "album": "Care Package", "image": "https://images.rapgenius.com/8e698228ca0819b4a694cb2ecb1b8787.500x500x1.jpg", "title": "5 AM in Toronto", "lyrics": "[Intro]\nYeah\nThis on some old Tommy Campos Dice Raw shit, you know?\nFor my niggas, though\n\n[Verse]\nUh, you underestimated greatly\nMost number ones ever, how long did it really take me?\nThe part I love most is they need me more than they hate me\nSo they never take shots, I got everybody on safety\nI could load every gun with bullets that fire backwards\nProbably wouldn't lose a single rapper\nNiggas make threats, can't hear 'em over the laughter\nYeah, that's 'cause I'm headed to the bank, nigga\nSinatra lifestyle, I'm just bein' frank with ya\nI mean, where you think she at when she ain't with ya?\nWildin', doin' shit that's way out of your budget\nOwl sweaters inside her luggage, you gotta love it\nDamn, this shit could go on a tape\nBitches lovin' my drive, I never give it a break\nGive these niggas the look, the verse, and even the hook\nThat's why every song sound like Drake featurin' Drake\nStr8, Y pree? Why is it always me?\nGot us watchin' our words like it's wiretaps on the team\n'Cause I show love, never get the same outta niggas\nGuess it's funny how money can make change outta niggas\nFor real, some nobody started feelin' himself\nA couple somebodies started killin' themself\nA couple albums dropped, those are still on the shelf\nI bet them shits would have popped if I was willin' to help\nI got a gold trophy from the committee for validation\nBad press during the summer over allegations\nI ain't lyin', my nigga, my time is money\nThat's why I ain't got time for a nigga whose time is coming\nA lot of niggas PR stuntin' like that's the movement\nAnd I'm the only nigga still known for the music, I swear\nFuck them niggas this year, I made Forbes list, nigga\nFuck your list, everything's lookin' gorgeous\nWithout me, rap is just a bunch of orphans\nBut if I stay, then this shit is a bunch of corpses\nAnd me and my dread nigga from New Orleans\nStashin' money like hoarders off multi-platinum recordings\nEatin' like I’m seated at Swish, Sotto, and Joso's\nNothing Was The Same, this shit for Ezee and Coco\nThis shit for Karim, this shit for Jaevon\nThis shit for Julius, Milly Mill, boy, we do this shit for real\nAll them boys in my will, all them boys is my Wills\nAnything happen to pop, then I got you like Uncle Phil\nWeezy been on that edge, you niggas just need to chill\nIf anything happen to Papi, might pop a nigga for real\nComin' live from the screwface, livin' out a suitcase\nBut I'm feelin' good, Johnny got me pushin' two plates\nMy weight up, I refused to wait up, I started a new race\nIt's funny when you think a nigga blew up after Lupe\nNiggas treat me like I've been here for 10\nSome niggas been here for a couple, never been here again\nI'm on my King James shit, I'm tryna win here again\nA young nigga tryna win here again, man, what's up?\n\n[Outro]\nAyy, yeah, a young nigga tryin' to win here again\nIf I like her, I just fly her to the city I'm in\nI got her drinkin' with your boy\nI got her fucked up, shorty, aww yeah"}]}