{"artist": "Ace Hood", "songs": [{"title": "Motive", "album": "Starvation 2", "year": null, "lyrics": "[Verse 1: Ace Hood]\nUhh!, wait 'til I get my money right\nBet'cha then, she'll fuck me right\nBet'cha then she'll fuck me long\nDo anything jus so she'll be on!\nThat lean in my cup and I'm blowing on loud\nToday is the 4th and she coming in town\nRemembering back when a nigga was down\nIt's funny how money could turn 'em around\nWomen that is highly sophisticated\nBottoms are red and their lips are painted\nPay for that body they waist deflated\nAss is fat and them hoes will hate it\nBag is Gucci, Louie and Berkin\nBody amazing, dress fit perfect\nBeautiful girl, but is it worth it?\nIs it my fame? Tell me your purpose\nFucking me good, just for them purses\nJust for them cars, in love with the splurgin'\nGuess I'm a man who livin' and learnin', boy\nI promise her pussy can get her the world\nTo get what she want and she suddenly plays an innocent girl\n\n[Hook: Kevin Cossom]\nGirl I know you better, cut it out\nActing like you love somebody\nActing like I might not notice\nYou should know just like I know\nThe motive, the motive\nMy motive is your honey\nYour motive is the money\nSo now we're back together\nBut it won't last forever\nOoh the motive, I want a motive\n\n[Bridge]\nShe do it for status, put the brain on hold\nHer body have talent, she gave up her soul\n(She gave up her soul), she gave up her soul\n(Straight to the top, she gon' climb that pole)\nShow her for the life, show her for the lights\nSay you make a deal, it's all for the night\nWhat's your motive? (What's your motive?)\n\n[Hook]\n\n[Verse 2: Ace Hood]\nWait 'till I get my money right\nBet'cha then, she'll fuck tonight\nTemptation running as high as ever\nI'm trying to see what that pussy like\nI'm still in my section, she stearing me down\nWondering how she can draw my attention to bring her around\nShe loves the life, admire the ice, my diamond's bright\nWatching her body, that dress that she rocking is fitting her tight\nLord, she could be somebody's wife\nBut everything that shines ain't a diamond right?\n\n[Hook]", "image": "https://images.genius.com/a8ccf68732bfc41deafb0b2d7ab2be48.500x500x1.jpg"}]}