{"songs": [{"album": "S.I.D. ”Shining in Darkness", "year": null, "title": "Weirdo", "image": "https://images.genius.com/405a5067b45fd58bd084f3542906675a.1000x1000x1.jpg", "lyrics": "Live Wire\n\n[Verse 1: J. Stalin]\nI came in his motherfucker high though\nFriday night I'm trying to let go\nReal one, don't confuse me with them weirdos\nBoxers no Speedos\nWest Oakland where them niggas move kilos\nWhy your bitch wanna fuck on me though\nI hit it in the bathroom and passed her to P-Lo\nI play the bar i'm to cool for the dance-floor\nI'm a dog like Cujo\nDon't get me wrong still do the (?) tiptoe\nThere's money on line nigga what they in for\nMe I been a G since the get-go\nTrying out the coochie on like clisco\nI'm the dope and she's a nympho\nI'm the dope and she's a nympho\nBut little momma you don't hear me tho\n\n[Hook: J. Stalin]\nBad bitch, she know what i'm in for\nReal nigga, flyer than a G4\nI'm the shit, cause you said so\nAnd your boyfriends a weirdo\nBet your boyfriends a weirdo, weirdo\nBet your boyfriends a weirdo, weirdo\nAnd he ain't get no dough\nI rock foreign that's for show though\n\n[Verse 2: J. Stalin]\nI left up out this motherfucker still drunk\nHenny shots and them cookies ain't no punk\nI'm in the wind, i'm stackin' paper again\nYou stick out like a sore thumb, in all places I fit in\nYou kiss her in the face, I leave it on her chin\nI bagged her and her sister nigga both of the twins\nBack of the Porsche, back of the Benz\nRockin' the car, crackin' the rims\nNo weirdo shit when i'm gone in the wind\nHome for a day then i'm gone again\nI got women to get, nigga money to spend\nI be up all night then I do it again\nThis little game we play yeah I'm in it to win\nAnd if your bitch come around I'ma hit it again\nSay this little game we play yeah I'm in it to win\nAnd if your bitch come around I'ma hit it again\n\n[Hook]\n\n[Verse 3: Lil June]\nUgh, I'm off the molly girl wassup\nMy hand was up her dress on her butt\nSmooth, I'm too sharp like a tux\nI pour up the Henn, then I roll up the dutch\nUgh, she hella nasty though\nBust it open like a nut, pistachio\nDid her like my player on a rope\nGot my top blew then I wrote\nYour boyfriend huck, he a weirdo\nI keep my circle small like a cheerio\nRun it back just in case they didn't hear me tho\nFuck a tip,  gangster shit, nightmare, miracle\nOn 10th street, everywhere i'm 10 deep\nWith 10 freaks, baby both hella cheap\nHer boyfriend caught her up in a text\nShe turned around and said, \"Babe it was only sex\"\n\n[Hook]"}], "artist": "J. Stalin"}