{"artist": "Pharoahe Monch", "songs": [{"album": "Oz: The Soundtrack", "title": "What is the Law", "image": "https://images.genius.com/f54811c2c7f54daa594c3e3b8adb0293.200x196x1.jpg", "lyrics": "[Verse 1: Pharoahe Monch]\nOfficer Frank Pagliarule, heh, shit, I hate spics and moolies\nOn the trains they be actin insane and unruly\nIt's the \"Planet of the Apes\"\nThese gorillas be blastin they tapes\nOut of they cars like a cinematic movie\nRespondin, to a domestic dispute, the culprit\nA younger monkey who went ape-shit and decided to shoot\nHis older brother in the brain\nHis baby's mother couldn't refrain\nKeepin sex out the family name\nAnd that keeps me smiling like racial profiling\nForever nigga pilin inside Rikers Island\nNew York's most violent, black wall of silence\nReact with black talons when wolfpacks are wyling\nFor a white cat, gotta admit I can rap-ta-tat-tat\nMy nightstick, on the top of your cap\nMy blackjack you'll be swallowing for protestin and hollering\nThe policy is quality of life and zero tolerance\n\n[Hook]\nWhat is the law? Know you heard this before\nWe find contraband in your car, we breakin your jaw\nWhat is the law? Nigga, mathematics for sure\nIf they walkin in packs of four, they tryin to score\nFor any - drug bust or cocaine that's raw\nBetter believe we takin our twenty percent at the door\nWhat is the law? Wolfpacks, movin on all fours\nI'm flawless with weaponry, mentally ready for war\n\n(What is the law?.. What is the..)\n\n[Verse 2: Pharoahe Monch]\nAny formalities in the case of police brutality\nI've escaped on finer details and minor technicalities\nHere's a verbal medley of deadly force used\nReadily abused in that old Ku Kluk pedigree\nYou better be heavily armed, forever we ready your song\nSteadily ready to move and bomb\nI'm like - Hercules, when I work my knees\nIt's a - search and seize that'll hurt indeed\nGod bless when the bullets hit the chest you'll backflip\nSWAT - Special Weapons And Tactics; theatrics hot\nOn your block we lock down all shenanigans\nWhen we roll you stand stiff like mannequins\nTake the position for broomstick penetration (uh)\nLegal under the Mayor's new administration\nYOU - better forever have your identification\nI broke the mold for holds that cause asphyxiation\n\n[Hook]", "year": null}]}