{"songs": [{"album": "Para Tu", "year": "2013-10-21", "title": "Drew", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Intro]\nYou give me a month and I'll make a mountain move\nYou give me two months and I'll make a moon for you\nIt's still J.I.D. Route, just a little bit smoother\nI pray for you\nAnd I know it seems hard\nWhen its crazy in your mind, but you know what's in your heart\nAt the top of the mountain where the Earth meets God\nSeems far but\nI pray for you\nSeems far but\nI pray for you, I pray for you\nSeems hard\nI pray for you\nSeems far but\nI pray for you\n\n[Verse 1]\nAnd I know you hate the sight of me\nAnd everything I sit, jump, and stand for\nBut when you see me you know I'm doing good\nDidn't mean to leave your world dismantled\nOr you would say shambles\nGave ample time to blow out the candles\nOn to the next chick, thought it was a scandal\nNow on to my ex something shorty couldn't handle\nIts crazy but, I pray for you\nAnd to those who wish I never make it\nHope you know I'm forever praying\nNot for no jewelry or no wrist bracelets\nBut that I can change lives in my heaven placement\nAt the gates I, I pray for you, I pray for you\nDon't stray, you'll make it, I'll make it too\nI pray for you, I pray for you\nYou knew it, the fact that I'm a human\nMistakes, I'ma do it, pursue it, I pray for you\nI pray for you, I pray for you\n\n[Bridge]\nDouble triple joining souls step in\nStep hoes step left, right directions\nNo hoes left\nShow me something\nShow me something\nShow me how to prove my point\nAlways believed being last is best\nGive me last\nEven if you give me least I'll give complete\nWhy not?\nFeeling this intrinsic interdependance\nYou knew me before your fingers had tips\nAnd your tips had prints\nAnd your prints had grooves\nYou knew\nWe know\nYou knew\nWe know\nEven if no one else had the bag\nScars sustained\nAnd cuts suspended\nCompletely free from both sides of the word \"then\"\nFeel this reciprocity\nWhy not?\nWorst case I'm back to first base\nWoo\nHold me no confusion\nHold me no illusion\nPromise is not on purpose\nPurpose is not promise\nPromise is not on purpose\nI'll pray for you\n\n{Verse 2}\nYah, four hundred something years\nSo many tears that it could start an ocean\nNot to dwell in the past 'cause I live in the moment\nYou gotta know where you been to see where you goin'\nSee where I'm goin'?\nThe hoodies all black for a reason\nThe clothes all black for a reason\nYou probably just gotta see it\nYou hate that God called his angels back for a reason\nShit happens, reactions and actions\nBut still I pray for you, I promise I'll pray for you\nDon't stress, you'll make it, I'll make it too\nBecause I'll pray for you, I promise I'll pray for you\nDon't stress, you'll make it, I'll make it too\nYeah"}], "artist": "JID"}