{"artist": "Cage", "songs": [{"title": "Underground Rap Star", "album": "Weatherproof", "year": null, "image": "https://images.genius.com/fee65d811c41738bdfccdf4a1f22ad15.400x395x1.jpg", "lyrics": "[Intro]\nEvery rapper in the house, shut the fuck up\nEvery rapper in the house, shut the fuck up\nEvery rapper in the house, shut the fuck up\nDon't go against the weathermen\nYou gonna get fucked up\n\n[Verse 1]\nAnd I ain't fucked up now bluffin' the basics\nLet stuff in the Asics from that kid huffin the matrix\nI let my brain cells fight it out and throw the lighter out\nYou ain't even got hands to hold the guns you write about\nAin't got a heater and why Cage need more than four fists?\nI stay puttin it down and don't come off this ?\nComplice not needed spray dolo\nWith more letter combinations in my blood than K Solo\nLSD, THC, PCP, the only three I need left is GED\nYou know you can't stand the manic\nEven if you don't get the picture the point of view's still panoramic\nChemical organic, leaf is clouding\nGet your contact back in in 3 plus two thousand\n\n[Hook]\nThis is Federal hate the dead are awake the medical's great\nThis is the life of a underground rapstar\nGet lots of brain but the birds are vain and peck at anything\nThis is the life of a underground rapstar\nYou spit it you bit it and then you got your car kitted, you get it?\nThis is the life of a underground rapstar\nTravel on somebody else's dime and can still pull out the nine\nThis is the life of a underground rapstar\n\n[Verse 2]\nThis is my brain on drugs these are the drugs on my brain\nI stab the shit out of Clyde just like I bludgeoned his dame\nAfter I fucked her insane ?\nThat sex pistol got a chest to spray\n.. the fuck?\nYou think my identity was born yesterday?\nBeen the prince elite since the purple rain was in the street\nI parted the projects for that sea of sulphur you seek\nAnd if bein by my gun matched the drink in my glass\nThis incredible ho, lick on her incredible ass\nLick with care, Snake Pliskin drift in and tear off\nEscape from New York and come back when the 'shish wear off\nPersonality pair off til my skin frays\nBeen off for ten days feel like two still light blue\nThe blast Ferarri bed\nAin't forgivin a ho for givin' up sorry head\nVintage electronic and Barbie wed\nLabel's try to hype you up like you goin' fight Royce\nLike Def Jam fucked around and signed the wrong white boy\n\n[Hook]\nThis is Federal hate the dead are awake the medical's great\nThis is the life of a underground rapstar\nGet lots of brain but the birds are vain and peck at anything\nThis is the life of a underground rapstar\nYou spit it you bit it and then you got your car kitted, you get it?\nThis is the life of a underground rapstar\nTravel on somebody else's dime and can still pull out the nine\nThis is the life of a underground rapstar\nThis is the life of a underground rapstar\nThis is the life of a underground rapstar\nThis is the life of a underground rapstar\nThis is the life of a underground rapstar"}]}