{"songs": [{"year": "1990-01-01", "album": "Tell the World My Name", "image": "https://images.genius.com/c8cb0eb6bea9e54f6900f53c29556243.400x400x1.jpg", "title": "Spellbound", "lyrics": "[Hook]\nCheck it out\nS to the O L O\nI'm Spellbound\nWhen I S-P-E-L-L very W-E-L-L\n\n[Repeat 4x]\n\nCheck it out\nLike this...\n\n[Verse One]\nHey - what I'm about to say\nMay hit a lot of people in a real strange way\nSome - said I should've spelled this a long time ago\nBut I stayed amateur while others turned pro\nP-R-O now I'mma throw - letters in my word\nSo I can make a Spellbound flow\nRead it slow, see how it S-O-U-N-D sounds\nK S-O-L-O Spellbound!\n\nWhen I S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\nI'm Spellbound\n\nWhen I S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\n\n[Verse Two]\nFirst I'd like to say I'm the K-E-V-I-N\nMy last name is M-A-D-I-S-O-N\nAnd when I R-A-P they call me K S-O-L-O\nMy rhymes are heavy like a rock, so I'mma throw them like a bolo\nRhymes are def, beats are hittin' it's workin'\nThe alphabet's in the coffee pot to keep the spellin' perkin\nI S-P-E-L-L very W-E-L-L\nI only spell so all can T-E-L-L\nRhymes I got or write will S-E-L-L\nFor rappers who don't believe me go to H-E-L-L\nRhymes I write are made by M-E\nTurn the M around and it spells W-E\nWe K-I-C kicked the B-E-A-T on the S-T-R-E-E-T\nNo one got rhymes like T-H-E-S-E\nThese rhymes you can R-E-A-D\nRead! See how it sounds - My fundamentals are spellin'\nAnd K S-O-L-O Spellbound!\n\nWhen S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\nI'm Spellbound\n\nWhen S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\n\n[Verse Three]\nI'm not a G-A-M-E to say the S-A-M-E\nR-A-P-P-E-R whose style's O-L-D\nI'm N-E-W for Y-O-U\nAny C-R-E-W paralyzin' vowels\nA-E-I-O-U nothin'- you're frontin' - and rappers almost Q...\nU-I-C-K to T-A-L-K\nSome are real quick to W-A-L-K\nYou can S-A-Y say what you M-A-Y\nWhen I spell or write a rhyme I won't P-L-A-Y\nPlay around when it's time to get down\nRead it slow when K S-O-L-O is Spellbound!\n\nWhen S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\nI'm Spellbound\n\nWhen S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\n\n[Verse Four]\nOh yeah, I must drop this line\nFor MC's who try to spell or put spellin' in the rhyme\nThey can't get it - I'm the B-E-S-T best\nSpellbound got a hundred while you failed the T-E-S-T test\nNext time try things I didn't spell\nVerbs and nouns, action words and adjectives\nAdd it together and ask R how it sounds\nAnd maybe a rapper out there could be spellbound\nBut for now I'm the S-P-E-L-L K-I-N-G\nAnd this song I S-I-N-G\nAnd thanks to E-P-M-D, I-M O-U-T-T-A H-E-R-E\nSpellbound!\n\nWhen I S-P-E-L-L very W-E-L-L\nCheck it out\nLike this...\nI'm Spellbound\n\n[4x]\n\nS to the O-L-O\n\nNineteen Nine O K-Solo ? with EPMD\n\nBiggie Smalls\n\nS to the O-L-O\n\nFade out"}], "artist": "K-Solo"}