{"songs": [{"image": "https://images.genius.com/4e938672ba331b168f4f463f35fdd247.637x637x1.jpg", "year": "2000-12-12", "title": "Been a Long Time", "album": "Restless", "lyrics": "[Saafir as radio host]\nRrrah, uhh, bitch!\nIt's radio radio station, cat Xzibit huh?\nK-W-Balls, Daniel Thompson hold like this\nLike that in fact, with a fat-ass Battlecat track\nI'm takin caller number one, that is..\nRrrah uhh, bitch - you took too long\nCaller number two like this..\n\n[Verse 1: Xzibit]\nBounce up out of the house close to midnight\nFull rack up in the back, shit is tight\nFull charge and I'm out for somethin'\nMass production, Battlecat bang percussion\nEnd of discussion, hittin' some corners, rearrange things\nAnd bring change, we expand California\nListen, I lost more than I can ever gain back\nFrom this road to riches, makin' my heart turn black\nSo I'm cold to bitches, and I never call back\nPlus I'm stoned and vicious, lay your whole hood flat\nGet your, shit together nigga big Snoop Dogg told me\nDo music and leave that other shit alone homie\nWe came from dust, the X-odus, the hard to touch\nY'all niggas ain't fuckin' with us, and plus\nIt ain't nothin' like standin' on your own two\nSo run them streets, but never let 'em run you\n\n[Chorus: Nate Dogg]\nTime is steady wastin', steady wastin'\nSince time won't wait for me, yeah, won't wait, won't wait\nJust give me a beat that's bang, give me a beat that's bangin'\nI'll bust 'til I'm deceased yeah, wooh-ooh\n\n[Verse 2: Xzibit]\nTune in, witness the rise of a icon\nThe python wrap around 'til your breath gone\nThe upper echelon, and I'm the cat you pull a weapon on\nAnd wanna squeeze 'til my life is gone\nBack to the wall and trust nobody\nSippin' Cognac with Kurupt, Young Gotti\nSomebody gotta recognize this\nThrow fo' fingers up, add a thumb, then make it a fist\nNumber one draft pick, lead the league in assists\nGive a fuck how you decorate your neck and your wrists\nYou just settin' yourself up for the twist (gimme that) it's like this\nOnly a few slide through like the Schindler's List\nWho's the bitch, who's the mack, what's worse\nThe niggas that bring in the coke or smoke the crack?\nMetaphor figure four let it break your back (yeah)\nIt's been a long time, where the gangstas at?\n\n[Chorus: Nate Dogg]\nTime is steady wastin', steady wastin'\nSince time won't wait for me, yeah, won't wait, won't wait\nJust give me a beat that's bang, give me a beat that's bangin'\nI'll bust 'til I'm deceased yeah, wooh-ooh\n\n[Verse 3: Xzibit]\nDamn it feels good to be back in the saddle\nOn top of the game, crackin' the frame, the heat of the battle\nBeen a long time comin' but we waited\nXzibit went from bein' hated, to makin' the whole world say it\nGive a fuck if the radio play it\nNiggas fall like the domino effect and you can't delay it\nIt ain't about who you are when you're makin' your stack\nIt's the look that's on your face when you givin' it back\nPicture that\n\n[Outro: Nate Dogg & Xzibit]\nTime, keeps on slippin', slippin'\nKeeps on slippin' away, mm-hmm\nMy mind keeps on trippin'-trippin'\nTrippin' like every-day, mm-hmm (word, yeah)\nYeah, it's been a long time\nTime is steady wastin', steady wastin'\nSince time won't wait for me, yeah, won't wait, won't wait\nJust give me a beat that's bang, give me a beat that's bangin'\nI'll bust 'til I'm deceased yeah, wooh-ooh\n\n[Phone skit: Steve Rifkind]\nVoicemail machine: First message, message marked urgent\nXzibit, it's Rifkind. Remember me? You know Loud Records?\nYou haven't called the label in 6 months I know you're a big star and everything right now but you know we would really need this record. Sony's on my throat. Please, please call me\nSteve Rifkind, Loud Records"}], "artist": "Xzibit"}