{"artist": "9th Prince", "songs": [{"album": "Prince of New York", "lyrics": "[Intro: Islord]\nHaha, muthafuckas, yeah, muthafuckas\nWe gonna spread ya niggas like Smucker's\nBitch ass niggas... word up, yeah, niggas\nYou thought we left, right?\nBut we ain't went no muthafucking where\nMuthafuckas... cuz we don't -- youknowhatimsaying?\nYo, 9th Prince, youknowhatimsaying?\nYo tear these niggas up, man\nLet these niggas know what really time it is and shit\nKnowhatimean? Let these niggas really fucking know what time it is\nBreak these niggas muthafucking jaws if you have to\nKnowhatimsaying, son, yo give it to these niggas real raw, son\n\n[9th Prince]\nAiyo, Staten Islanders, rhyme challengers, carry silencers\nI spit like the snipers, right through the shot\nMartin Luther King off the banister, lyrical dillinger\nCame to battle cats, the contender\nI'm a terrorist, not like P.R., but more like Pablo Escobar\nAnd the Al Qaeda squad of Gods, do a drive-by\nJust because of stupid, I adjusted in a beat up car\nTake heads like Wallace D. Farad, holy war scriptures\nWritten in my dialogue, digital vocals\nI'm far from analog, smash you with a Garth Brooks guitar\nThen blow like M-80's, have my lady, wave the three 80\nShatter your glass, on your Maybach Mercedes\nPoisonous rhyme venom, spark shit like 'ism\nStill terrorizing, corporation your organisms\n\n[Islord]\nAiyo, ya'll niggas must be really fucking stupid\nGoing up against me, don't you know, kid\nI put end to careers, be\nSo who gassed ya'll? Who put batteries in ya'll back\nFor ya'll to step up, to get viciously attacked\nBy this animal, who tears the hearts out of challengers\nEveryday, everywhere I go, everywhere I be\nI tear the hearts out of challengers\nAnd ya'll definitely ain't no different, who the fuck is you?\nI put one, two, three, four, five, six, plus ten slugs in your muthafucking crew\nBitch ass nigga, get slapped nigga\nGoing against my muthafucking style, nigga\nCuz I'm straight from Staten Island, where niggas be wilding\nKillah Hill 10304, where shit is crazy raw like the meat market\n\n[Chorus 4X: 9th Prince, Islord]\nKillarmy, we never left\nWe never went nowhere, we still here\n\n[Outro: 9th Prince]\nNiggas, yeah, ya'll know what time it is\nIslord, 9th Prince, Beretta 9, P.R. Terrorist\nKilla Sin, I see you kid, ShoGun Assason\n4th Disciple, get ready for the camouflage entourage\nYeah...", "year": null, "title": "Sniper Challengers", "image": "https://images.genius.com/5491ced6515f8b9c5af8dbaefebec9df.300x300x1.jpg"}]}