{"songs": [{"year": null, "album": "I’m Good", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg", "title": "Drop Dead Gorgeous", "lyrics": "[Murphy Lee]\nWhooooooooooo\nDamn, that girl fine, that girl fine, that girl fine\nYo, yo, Kanye, yo turn it up, a little bit, whoo\n\n[Hook]\nTake notes while I take tokes to the marijuana smoke\nOne look and murder she wrote\nShe drop dead gorgeous, she drop dead..\n\n[Kanye West {*over the hook*}]\nYo, this is a Roc-a-Fella, St. Lunatics collaboration\nChi-Town and St. Louis\nShe said she ain't never seen Murphy Lee befo'\n\n[Verse 1: Murphy Lee]\nI called her back from an earlier beep\nFo' in the mornin' they be like \"Nah, I wasn't sleep\"\nConvenient whore stay on top of convenient stores\nKeep pictures of me in their Victoria Secret drawer\nI keep somethin' hot on tour\nCan ya, Kenyatta, make sure they know before what is really in store\nSee I adore the ones that call me Torhi, true story\nI created 'hood rats so these new mice bore me\nSee I normally settle for sevens, but eights I can't wait\nNines be wantin' time and dimes be wantin' dates\nSo know I got elevens and twelves\nWith at least thirteen or fourteen reasons why they fine as hell\nI hit 'em up like Blu Cantrell\nHehehehehehehehe hell, I remember when she smashed LaBelle\nSee most women kinda sneaky like a six-year old\nHey yo they always in the summer, somethin' wrong with their nails\n\n[Hook]\n\n[Verse 2: Kanye West]\nWhat's the point of havin' a girl that's drop dead\nThat you know don't like you?\nShe'll run over your head with a motorcycle\nI mean the way you look is nice, but there's more to life boo\nCuz I could go to videos and get fo' just like you\nI talked to your ex-boyfriend and took a census\nBut you don't read the cookbook, you just look at the pictures\nMatter of fact, when's the last time you looked at the kitchen?\nThis is gettin' ridiculous, how you gettin' defensive?\nJimmy Choo, Frankie B., bitch you gettin' expensive\nI know you fuckin' around, my sixth sense told me\nThat ain't no male friend that bought you the stereo\nShe said \"He gay anyway, you don't know nothin' about Jamario\"\n\n[Hook]"}], "artist": "Kanye West"}