{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "I Need You Tonight", "image": "https://images.genius.com/187d2cdbd793839f84834a9d30c7c5e9.1000x1000x1.jpg", "lyrics": "[Intro]\n(Hello?)\nHello babe, what's happening, you cool?\n(Ah yeah you alright? What's happening?)\nYeah I'm good, what's goin' on?\n(Yeah, nothing er chillin')\nAlright, what you up to later?\n(Oh yeah about that, um, dya know what I'm really busy can I call you back?)\n\n[Lyric 1]\nThis ain’t so stereotypical man, not for a stereotypical man\nIt should be me that wants to get rid of you\nInstead it’s you that don’t give a damn (what?)\nIt was meant to be a one night ‘ting\nNothing more than a little one night fling\nNow when I’m in need you’re the one I ring I (I need you tonight)\nBut she’s playing hard to get\nBrunette with such class she’s hard to forget\nSee at first I wasn’t after her heart\nBut I couldn’t stop thinking about her after I left\nI’m beginning to lose my cool, it appears in love I have fallen (whoops!)\nI’m ready to put my all in and all she does is ignore my calls\n\n[Hook]\nShe’s everything I want, but all that I don’t need\nHow can she be so hot, yet be so cold to me\nHow can it be so wrong, and yet it feels so right\nI wish I never, but I need you tonight!\n\n[Lyric 2]\nThis lady is driving me crazy\nShe blows hot and cold like the AC\nI just can’t figure her out\nNext time I’m with her I’m pinning her down (Oi)\nI’m gonna’ figure out if she’s on it or not (not, not)\n‘cos all of this shit is long (long, long)\nSee I front like I’m okay but I’m not\nI’m being played at my own game and it’s long (long blud)\nI ain’t no idiot (nope), I’m pro, I’m no intermediate\nSo next time she phones me I’m ain't even gonna pick up the phone to speak, innit?\n(ring) nope, swear down\n(ring) wait a minute, that’s her now\n(hello?)\n(I really wanna’ see you today)\nAlright, just give me a time and a place and I'm there\n\n[Hook]\n\n[Bridge]\n\nI need you, I need you\nI need you, I need you\nI need you, I want you\nWon’t stop until I’ve got you\nThere’s nothing that I won’t do\nI need you tonight\n\n[Lyric 3]\nLook, I ain’t never been the type to be this (nope)\nI ain’t never been the type to be with\nShe's exposing a side of me that\nI’m tryna’ fight, I’m tryna’ hide!\nMy pride, I’m tryna’ find it\nBut ain’t seen it, (umm) I’m an eejit\nI know I can’t help it, I'm fiending!\n(I need you tonight)\n\n[Hook]\n\n(Yeah, bad place. This does not happen to me. I am me!)\n\nI need you, I need you\nI need you, I need you…\n(I swear down. It's just a song - in real life, this would never happen to me. I am a pimp. Women chase me, I do not chase women. I swear down... Swear down...)", "year": "2010-04-09"}]}