{"artist": "Pouya", "songs": [{"album": "Fuck It", "title": "Fuck it (Freestyle)", "image": "https://images.genius.com/5f086642bb017b316364f0af4f7031eb.500x500x1.jpg", "lyrics": "Fuck it, flow give you shivers and the motherfucken blisters\nShout out to my haters and the opposite the listeners\nIf you fuck with me well then im bringing out the killas\nTalk shit, eat shit, but make sure that they feel us\nDont give a fuck i told you twice i told you once\nLooking at the bitch i put my dick up in the cunt\nChilling with my homies then im kicking back like punt\nFuck a runt, get the fuck up out my crib i told you once\nAnd i told you twice, if i told three times better believe that im coming out the crib with a knife\nPut it to your fucken throat now you gonna fucken choke and this dick real quick\nYa my phone just rang, what the fuck that bitch is fucken up my song\nMy bad bitch is wearing nothing but a fucken thong, whats wrong with ya\nOff the dome bitch, my chromosomes are hot in the spot when i come through with the cock\nI put it in your fucken pussy and that shit is gushy\nWhy the fuck you stupid ass hoes so pushy?\nAsking for all this shit like im gonna fucken buy it\nStupid ass trick better not fucken try it again\nSuck my cock, suck my head\nI dont need a motherfucken pen fuck a book\nGot all these motherfucken haters so god damn shook\nWheres the food at? wheres the fucken cook?\nI spit that crack thats a fucken fact\nAll of you haters is so god dam wack put you on your back now kiss my ass\nI dont give a motherfuck broken flask on the floor cause your hoe sucking my dick so fucken so\nWhat the fuck do you know my dad? imma spit that crap three times four times five times again i dont give a motherfuck fuck a fucken pen\nFuck a pen, fuck a pen, fuck a book, fucken got these haters so shook bitch stop fronten im hunting for the motherfucken pussy cat open up your legs and wrap it up and send the bitch right back little kid with the mentality of big guys, dont act suprise cause my shit fly, uh, flyer than jumbo, airplane ???? nigga fuck same hoe different day ain't shit change. im rocking (??) from my head to my sneakers, go ahead and judge blasting through my speakers, fuck the school fuck the school, lets fuck the teachers listen up like imma motherfucken preacher, my flow, wanna know, im sorry can't teach ya imma monster a motherfucken preacher better believe that better believe this, bitches on my motherfucken motherfucken dick, get the fuck up off of it imma spit that fucken shit till they know who pouya is, thats my motherfuck name hoe! get it right get it right fuck it fuck it fuck it thats the mixtape fuck it...\nMan i wrote the first 2 words then i was like \"fuck that\" thats why i call this shit \"fuck it\" cause fuck it", "year": "2012-06-11"}]}