{"songs": [{"image": "https://images.genius.com/b82f944f1e382eb7c1f8bc9e27322f5f.500x500x1.jpg", "year": "2014-05-11", "title": "FUCK V2", "album": "Ice Hotel", "lyrics": "[Intro: XXXTENTACION]\nFuck V2, I'ma say it again, Fuck V2\nWhat the fuck is V2? (Ayy, ayy)\nWho the fuck is Nyora Spouse?\nWe kill this nigga on tracks every fucking time\nTrash ass rapper\nNigga just stop rapping, what the fuck you rapping for?\nFucking Tensaki nigga, what the fuck that even mean?\nDon't make no fucking sense (Ayy, ayy)\nAll your bitches ugly, you skinny as fuck\nYou fucking bathe in Clorox\nHe's dirty as fuck, don't take showers\nYou ashy as fuck, your lips fucking chapped (Ayy)\nNigga kill yourself, fucking kill yourself nigga (Ayy)\nYou dirty, and I mean that\n\n[Verse 1: XXXTENTACION]\nDick all in her throat's hole, YOLO (Ayy)\nWanna fuck a bitch take a photo, Yoko (Ayy, ayy)\nAsian bitch London Tipton, slow sippin' (Ayy, ayy)\nDouble up, fuckin double cup, fuck a butt sluts, when I fuck (Ayy, ayy, ayy)\nJust run fuck a pun in the bun, slit her throat, suck and fuck a soul (Ayy)\nVegetate, slave, when a fade, fuckin renegade (Ayy)\nI'm a young Kelly Clarkson, fuckin princess (Ayy)\nFucking incest, wincest, give her sex, sex in the vest (Ayy)\nStrapped come my way say, he a gay, in a V fuckin' 2 (Ayy)\nMatter fact, I'ma slap his momma just for having him (Ayy)\nAnd slap up on her daddy just for speaking to the broads (Ayy)\n\n[Verse 2: $ki Mask The Slump God]\nFuck a V2 tryna go like the buttons on R2-D2 (Skrt, ayy, ayy)\nMothafucka' who you (Ayy)\nBut the new niggas act like the snakes do\nBut like a fat bitch I'm tryna move where the cake move, ayy\nFineto, magneto, fatality your earhole\nI'm fuckin' while she breath slow\nThat's Nyora Spouse main hoe\nStep up in the paint and I'm Picasso on yo face though\nPicasso when I paint ho\nYour bitch suck me like a leech, all her loss of speech\nTell the bitch to breath, dick by a muthafuckin' G\nWhen that K gone, let it spray nigga I ain't playin'\nI'm a come to your muthafuckin' house, okay\nShe always tryna suck, give her ashy knees\nI ain't tryna please no thot, no cape on me\nI ain't tryna save no ho, no games I'm done\nYou a pussy and this song was for play play (Ayy)\n\n[Outro: Ski Mask The Slump God]\nFuck V2\nI'ma say it right know\nHit up first [?]"}], "artist": "XXXTENTACION"}