{"songs": [{"image": "https://images.genius.com/246e4408dbf779ecc2275ceef46c850e.453x450x1.jpg", "year": "1992-04-16", "title": "Still Shootin", "album": "Psycho Active", "lyrics": "[Verse 1]\nI'm still shootin mothafuckas the warpath never stops\nDr Jekyll and Mr. Hyde is causin a homicide\nYa popped if you're plottin on a jack punk\nI'll see you comin from a mile away and light yo ass up\nSo if the funk is on you betta be strapped\nCuz you'll be bitin the nine once again black\nCall me agent double O deuce four\nI got a mini 380 in the sleeve of my coat\nI'm a killA the mothafuckin X to the R-A-I-D-E-D L-O-C\nSmokin niggas like some green bud\nSo if you see me in your hood you better duck\nCuz I'm jackin every thang from a cut to a mini truck\nBetter not be trippin never slippin\nIt's just another mothafuckin grave that I'm diggin\nForties swiggin got a nigga bent and wanna kill\nFools try to catch me slippin but they never will\nI'm the mothafuckin X loc no joke\nI'm from the garden block where mothafuckas get smoked\nIf your Daytons got a little more shine than the ones I got\nI'm gonna get my nine and your shit is mine\nYou hella bold if you reach for your gat\nCuz I'm gonna put a hole in your ass and it's like that\nLynch, (You gonna be heaven sent fool)\nNiggas nuts on the wall I'm shooting mothafuckas\n\n[Chorus]\nCuz I'll shoot your punk ass in a minute\nI'll give you some of this (ginshots) or some of this (more gunshots)\n\n[Verse 2]\nI'm a trigger happy nigga I prove it every time that I ride\nI'll kill a punk at the drop of a dime\nFor instance a nigga talkin shit\nBetta yet a fool tryin to front for a bitch yeah\n(I'll give you some of this (gunshots) or some of this (gunshots)\nNigga aim nigga hit wanna trip nigga trip\nFuck a fool's gun if he got a empty clip\nBrotha Lynch (I'm a blast, I'm a blast)\nWhere your bullet land? (in that ass, in that ass)\nNiggas ain't shit a bitch is a dead bitch\nIf she fuck wit me she gonna be shittin led bricks\nCuz I treat a ho like a ho should be treated\nInstead of a queen I treat a bitch like a thief\nI'll have a ho terrified thinkin I'm a looney\nSettin up her folks so I can jack em for they jewelry\nKickin down doors wavin gats fuck a discussion\nAll I want is money if there ain't none then I'm bustin yeah\nI'm killin mamas, daddys and nephews\nI'm killin sons, daughters and sparin you\nYou can play the Rambo role like you're a down black brother\nBut picture this I'm still shootin mothafuckas\n\n[Chorus]\n\n[Verse 3]\nYou crazy if you think you're gonna get some\nThe only thing you're gonna get is yourself smoked punk\nAnd if you ever wake your ass up\nYou're in a box 24 deep cold as a mothafuck\nTo ya niggas that dissed me\nOr either tried to blast and ya missed me\nKeep your strap on cuz I'm a get my jack on\nWhen I put my black on payback is fin to be on\nYour brains gone I'm a let it be known trick\nX Raided was never the one to be fucked with\nCuz you was sayin you was hard and all that shit\nBut when you found you couldn't quit you moved your ass out of town with\nYour bitch\nDumb nigga I'm like the Terminator, loco\nKickin down doors with Brotha Lynch lookin for yo ass\nBlast everybody in the house and fuck gettin caught\nBullet wounds will get a nigga caught\nThey tell the cops that they shot ya\nYou go to see the doctor then they got ya, huh\nA niggas like me leaves no evidence sucka\nWhen I'm jackin me a fool, I shoot the mothafucka\n\n(Talking)\nYeah, once again it's on you know what I'm sayin?\nThat nigga X mothafuckin Raided never gave a fuck about shit\nYou run up and you gone that's how it is you know what I'm sayin?\nDon't have your back against the wall like my boy Mick said\nIf you don't talk that shit, I might let your punk ass live\nYou know what I'm sayin? sayin? sayin?\n(then again he might not)"}], "artist": "X-Raided"}