{"songs": [{"album": "Kingdom People", "image": "https://images.genius.com/88613def626e58194d33cae2db4c5764.600x600x1.jpg", "year": "2006-10-03", "title": "Do You Feel", "lyrics": "Hook:\nDo you feel? Do you feel like reppin Him now, because if no one did then I wouldn't be reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\n\nNow I was dirty and lost in sin, all my sins I had sought for them, hunting girls with the softest skin, with the whip they be flossing in\nHad no thoughts like incompetence, lust confusing my common sense\nMy flesh had the dominance telling me Go like Common Sense\nI was lustful guy, trust me my, eyes wandered like a nomad, taking snap shots like my eyes had came from Kodak\nOne of many struggles from my past like a throwback\nIt's tuff, it's a struggle but still a sin dog I know that\nI was trippin getting caught up in the same old trap, unmortified sin suffering the same old crap\nThat's until my boy stepped in with the love of the Father, preaching the Jesus you hearing through these speakers and monitors\n\nDo you feel? Do you feel like reppin Him now, because if no one did then I wouldn't be reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\n\nNow let me know if you in the mood yet, and if you are then why is it you ain't moved yet?\nIs it because you're amazed with this world of lust? What does it take for you to see that this world is crushed?\nI promise, we all die plus this world is snuffed, but I struggled with this too until my world was crushed, so\nLet's take a look at what's surrounding us, and take a look at life's predicament that's drowning us\nSee we al l born in sin but Christians are born again so if your livings old living then live in the live again\nDelivered since we began to live in this til the end, defeated living is lifted to live it just live in Him\n\nDo you feel? Do you feel like reppin Him now, because if no one did then I wouldn't be reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\n\nDo you feel like reppin Him now? Souls are lost without the cross, times are treacherous now\nKids admire snowmen instead of reverends now, they'd rather make instead of become the president now\nTrap fights for trap spaces in your residence now, crack pipes and crack babies that's your evidence now\nAin't no time to recline learn the regimine now, just tell me potna do you feel like reppin Him now?\nSee the times are too tuff ain't no stepping it down, all of my cousins looking for clubs when they step into town\nAll the hoods infatuated with them rims that go round, and Christians believe the lie, Ain't no helping it now\nBut it's I who beg to differ the indifference found because I refuse to believe that God left us to drown\nSee since He gave us His life then I present to Him mine and because of His grace I feel like reppin Him now\n\nDo you feel? Do you feel like reppin Him now, because if no one did then I wouldn't be reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now\nBut somebody did so dog I'm here reppin Him now, encouraging you as believers to start reppin Him now"}], "artist": "Tedashii"}