{"songs": [{"year": "2008-09-09", "album": "Not 4 Sale", "image": "https://images.genius.com/f0a901d03b5db37284706922ef6d3d03.1000x1000x1.jpg", "title": "Digital Motown", "lyrics": "Listen (x12)\n\nBoo…\nWhen you givin' Sunday to Monday\nThe ghetto lights flash like we dere pon de runway\nThe underground king, yeah... Do it the bun way\nI pimp so you can see how you can do one day\nWhat do you want, the Phantom or a Hyundai?\nHonk your horn (BEEP BEEP) chill with the gun play\nThe ghetto yout sufferin' they needin a fun day\nI’m bleedin’ to see you succeedin one day Me SEH!!!\n\n[Hook]\n\nTurn this up on your radio\nThey say they want that je-ne sais quoi well mine they keep go\nWe’re coming in through high definition on your stereo…\nTakin' you higher than your supplier with the bag of dro…\nMy people singin' la la la la la la la la\nThey crushin' la la la la la la la la\nThey smokin' la la la la la la la la\nLa la la la la la la la\n\nEasy… it is not to be me…\nBut I’ma pay the high price so I can be free (BOO!)\nBut of a high, bye, doesn’t it find me\nI like rum with a twist of a lime and a lychee (YO!)\nAt's how de ting go some of them like me\nAnd some of them will try anything to hype me\nAnd never fall for the yes man on a pipe dream\nCause when you on your face none of them will be seen (Zaid!)\nThe whole scene is nothing but obscene\nFiends who use green trying to get you on their team (UH UH)\nThe way I was at sixteen\n'as neva gone away everyday is a new ting (BOO!)\nAiyyo let me leave y'all with one ting\nA man is not a man if he nah stand up for something\nI stand firm you an a see me and I run tings\nI RUN tings! With the propaganda they pumpin'\nYou KNOW!!!\n\n[Hook]\n\nAiyyo!\nAnd we givin' Sunday to Monday\nThe ghetto lights flash like we dere pon de runway\nThe underground king, yeah... Do it the bun way\nI pimp so you can see how you can do one day\nWhat do you in, the Phantom or a Hyundai?\nHonk your horn BEEP BE-DE BEEP BEEP chill with the gun play\nThe ghetto yout sufferin' they needin a fun day\nI’m bleedin’ to see you succeedin' one day…. Me SEH!!!\n\n[Hook]\n\nMy people singing la la la la la la la la\nThey crushin' la la la la la la la la\nThey smokin' la la la la la la la la\nLa la la la la la la la"}], "artist": "Kardinal Offishall"}