{"songs": [{"image": "https://images.genius.com/3dcaa04fd82ef50384551fd2ed536b30.300x300x1.jpg", "year": "2017-12-10", "title": "​hate will never win", "album": "? (Deluxe)", "lyrics": "[Intro: Donald Trump]\n—ference, but a very important one, and it was scheduled to talk about the great things that we're doing with the secretary on the veterans administration.  And we will talk about that very much so in a little while, but I thought I should put out a comment as to what's going on in Charlottesville. So, again, I want to thank everybody for being here, in particular, I want to thank—\n\n[Chorus: XXXTENTACION]\nMind me while I sit and pretend to make amends\nWith all these false loves, I pray the cement\nWill fuckin' swallow you, I'll follow you down road\nTo this broken-hearted love for you, my heart has gone as still as a corpse\nNever mind me while I sit and pretend to make amends\nWith all these false loves, I pray the cement\nWill fuckin' swallow you, I'll follow you down road\nTo this broken-hearted love for you, my heart has gone as still as a corpse\n\n[Verse: XXXTENTACION & Donald Trump]\nWhy the fuck should I apologize? Country's orderless, it's a lie\nBy these fuckin' government scumbag dicksuckers with ties\n(Great people, they're great people)\nWanna fight for my future, it's right in my hands\nAnd the future of many youth if I play my cards can advance\nAnd genuine dime, I opened my mind\nAnd where can I find this future?\nSever your mind or you will be blind\nAnd trapped in a mind of lies within our walls\nI'm feelin' like my mind within a war between myself\nBetween this slavery of media, it's poor presentation\n(Violence on many sides)\nThe youth within our nation\nSuch is a pity, dependin' on people resemblin' Bible Satan, uh\nSet 'em up off and wet 'em up off like it's PlayStation, uh\nOpen up your minds and come together as a nation, why?\nWhy?\nWhy?\nWhy?\n\n[Outro: Donald Trump]\nThis has been going on for a long, long time. It has no place in America.  What is vital now is a swift restoration of law and order and the protection of innocent lives.  No citizen should ever fear for their safety and security in our society.  And no child should ever be afraid to go outside and play"}], "artist": "XXXTENTACION"}