{"songs": [{"year": null, "image": "https://images.genius.com/792e21c5d339d16d34ae4e802dd31c69.500x500x1.jpg", "title": "No Where Else to Hide", "album": "Illustrious", "lyrics": "[ VERSE 1 ]\nStraight out the slammer, grab a hammer, a new shiny Mac\nNigga front on me, I'm puttin two up in his back\nWhich means a nigga stunt on me, he gettin clapped\nIt's a fact, won't catch me in the street and not strapped\nNot at all, your boy Noyd keeps it raw\nI came a long way from stuffin cracks in my drawers\nTo goin on tour to hangin plaques on my wall\nYou try to stop that, I take your fuckin head off\nI just drive by slow\nAnd point the heat right out the window\nA nigga want beef, I'm lettin that thing go\nIn other words I let that machine gun blow\nWhen it come to my foes\nMy gangstas, dealers, some real live niggas\nHustlers, killers, gettin guap niggas\nReady to pop off, somebody gotta die\nNigga, I'm everywhere, how the fuck you gon' hide?\nWhen it's\n\n(No where else to)\n(No where else to)\n(No where else to hide)\n\n[ VERSE 2 ]\nI said it's hot in here, the cops here, the homie got the Glock, yeah\nThey say we hood cause you can find us right here\nSippin on a light beer, dipped in Carhartt gear\nAnd I know niggas on the Island doin life there\nThey ain't got a slight, yeah, ready to fight, yeah\nMy name's Rapper, America's nightmare\nAnd we don't fight fair, nah, cause we quite sick\nI got homies that'll bang you with a ice pick\nThey beat up police with they own nite sticks\nYou get on my nerves, no question that I might flip\nLook dunn, I'm not dumb, I roll with a big gun\nAnd I spit heat at you faster than Big Pun\nI got a lotta rhymes but all I gotta say is one\nOnce they hear me spit on the drums, their career is done\nYou could try to run but where you gon side to?\nYou ain't here, I was in the street, you been lied to\n\n(No where else to)\n(No where else to)\n(No where else to hide)\n\n[ VERSE 3 ]\nI woke up one mornin, turned my radio on\nI couldn't find my money, I knew it was on\nDamn, I was dead bent, sippin Henny's, drownin beers\nIt couldn't be that chick cause that bitch still here\nWhere my gun, hit my dunn, damn, this hangover killin me\nParty poppin last night, the streets feelin me\nBut stop, where's my guap, though?\nDon't make me have to wake this bitch up with the .44\nEverybody know how I bang for that dough\nWhether a gangsta or a ho - what's this over here?\nOh shit, she lucky, there it go\nListen ma, I don't wanna sound mean\nBut damn shit, a nigga had to bang for this CREAM\nAnd even though it really ain't nothin to me\nI'm tryina get you, I can't let you get me\nYou lookin real sweet and you fly, too\nBut think about it - you get me, tell me where the fuck you gon hide, boo?\n\n(No where else to)\n(No where else to)\n(No where else to hide)"}], "artist": "Big Noyd"}