{"artist": "Pimp C", "songs": [{"album": "The Sweet James Jones Stories", "title": "My Angel", "image": "https://images.genius.com/d5984a79c276e0748a892e587a93e941.772x768x1.jpg", "lyrics": "[Intro]\nI wanna dedicate this song to my momma, knahmtalkinbout?\nHappy birthday momma (hey momma, sheeeit) happy birthday\nThrough all the bullshit niggas tryin to kill us, yup\nYeah, y'knahmsayin? Uhh\nThe false divorces, child support court (that's right), all that\nNigga droppin out of school you stuck by me knahmtalkinbout?\nThank you... goin to jail\nSo a lot of motherfuckers be sayin stars up in the sky\nBut my star right here, that's my angel, knahmtalkinbout?\nCheck this out\n\n[Verse 1: Pimp C]\nI been on top of the world, and been on bottom of the grind\nI came through in the fresh cars, playin' surround\nI been in the city sellin' crack at the dopefiends\nTryin' to come up Houston be strung out on promethazine\nI used to smoke fry, wasn't scared to die\nEvery day when I wake up I wanted to get high\nMy momma came and got me from that devil dope\nAnd keep me good even though I used to choose hoes\nAnd sometimes with her older family members a lil' bit wrong\nBut that's how I came up, makin' rap songs\nI been in this shit since 16, comin' up\nAnd puttin' motherfuckers up on this thang up in this rap scene\nUhh, and when they took my money\nMomma never ever looked at me funny, now check it out\nThe manager I had wasn't shit\nThe nigga stole everything and snorted coke like a bitch\nMy momma stepped into this shit and went to every town\nThat we came to, every city puttin it down\nAnd when them niggas wanted to kill me, my momma said\nFuck that bitch, I know you motherfuckers feel me, uhh\nSo when you see me in the city with my T lady\nBest believe we comin up and we ain't livin shady\nI'm her baby, and that is my only momma\nI'll kill you bitch-ass niggas if you brang the drama\n\n[Hook]\nMy angel... an-gel, that angel is mine, annn-gel\nI found my an-gel, annn-gel, that angel is miiiine\nAnnn-gel\n\n[Pimp C]\nYeah tight, that's right\nI was young, I used to get sick a lot\nNow I'm rich puttin' it down with Rap-A-Lot\nI used to have the flu, cold, and pneumonia\nNiggas always tried to come and try to move on ya\nCause in my city you either got to be a hustler\nOr you're out on the corner, smokin' crack and a buster\nSo I had to come up fast\nWhen niggas come through I put that {?} on his ass\nAy, ay, ay\n\n[Hook]\nMy angel... an-gel, that angel is mine, annn-gel\nI found my an-gel, annn-gel, that angel is miiiine\nAnnn-gel", "year": "2005-03-02"}]}