{"songs": [{"year": "2019-08-20", "title": "The Right One", "image": "https://images.genius.com/bf82419aaf9ef7886cfb65dff17e56ad.1000x986x1.jpg", "lyrics": "[Intro]\nE.A. Ski what’s up my nigga?\nGuess this means I’m officially out the house huh?\nOK\n\n[Verse 1]\nBeing humble I guess you don’t condone\nAs you pull strings from your throne\nBut I ain’t never bother nobody\nBut still I see you can’t leave well enough alone\nSo this is me not bending\nI reject what you’re sending\nThis ain’t nothing but a rerun, but the extended version with a alternate ending\nHabitual line crossers\nClearly oblivious to what remorse is\nTaking Sauce Money for weakness\nBut this ain’t the Preakness, my nigga hold your horses\nAnd I don’t need no help\nI guarantee y’all I will be felt\n\n[Verse 2]\nI ain’t here to blow smoke or act hard\nOr bow down to sucker niggas with black cards\nWe know your work all to well, you fuck niggas over for a living nigga, that job\nWe can start with Black Rob\nBlack I hope you rhyming again\nYou sent Mase to seek God, Dep Loon reside in the pen Shine did 10\nBut let’s not confuse the people\nLet me address all your blackball shit\nYou tried to silence my voice for what reason? Now what the fuck you think that gone get?\nMe to be quiet? Nope\nI hope you don’t think it’s cool to interfere with how I feed my folks\nYou guessed wrong my nigga\n20 years, that’s how long my nigga?\nHuh, or maybe I need correcting cause if it ain’t you then who the fuck you protecting\nAs I start my mission. Your Co-D I got my suspicions\nAnd all I did was give you some hot verses and songs deep enough that you can sing in churches\nAnd if you Godly and bless with the faith, then why the fuck am I out here addressing your hate\nSon please, what I gave you for Young G’s\nThe only way you stand next to the greats BITCH ASS NIGGA!\n\n[Verse 3]\n20 fucking years and never said a word\nWithout being in jail time get serve\nWhen you all alone your mind just swerve\nTrying to figure out how do lines get blurred\nGod hear my prayers, lift a nigga up\nI got these snakes all around, just wish a nigga luck\nAnd leave the rest to your man\nThe proof is in the pudding if I’m to be everything I say I am\nI’m confused, don’t hide your hands nigga\nLets spread the news ain’t you the man nigga?\nBut if you a bitch then I understand nigga\nFuck with me cuz you think you can nigga, yeah I doubt it\nMy name Sauce Money homie and I’m about it\nFor all the years and careers that you re-routed\nI guarantee you before the nights done\nYou will know motherfucker you got the right one", "album": null}], "artist": "Sauce Money"}