{"songs": [{"lyrics": "Introducin' Chance the Ruthless\nTrip 'shrooms and lucy\nDreams is lucid\nLoosely based on music\nSwallow my mucus\nHope your pussy get herpes and yo' ass get lupus\nDeuces Douches, deuce deuce I'll shoot ya (BANG)\nShoes might boot cha and a suit might suit cha\nThey be on bullshit but they really don't do shit\nThey use of illusion could confuse Confucius\nNasty, ashy, cigarette ashing, 'til my voice get raspy\nLast week suspended\nLast night kissed Va$htie\nParleyed with Ashley\nAlways in the hallway, so I never been classy\n(Ha ha ha) Shut up\n\nNa na na, na na na\nNa na na, na na na\nNa na na, na na na\n(Igh, igh, igh, igh!)\n\nAcid acid, get it? Acid\nMelts through plastic, I spit fired\nPad my palette, talkin' paper\nIf this was work, I'd get higher\nPardon my mishaps, burp and get murdered\nFart and get bitch-slapped, like bourbon mixed with jack\nLickety-split, Look it! He slipped on a shell\nFrom peelin' banana splits back\nGive me my Kit-Kat\nDon't break me off shit, batch, fack is you mean bitch?\nZan with that lean bitch, zan with that lean bitch\nZen with that chakra\nI eat it like Idi Amin, Ya Kna Wha Mean\nHit me back when that mean shit\n\nNa na na, na na na\nNa na na, na na na\nNa na na, na na na\n(Igh, igh, igh, igh!)\n\nIntroducin', It's Bronsonlino\nWith my hair slicked back, I look like Rick Pitino\n3 Japanese dykes in my El Camino\nLettin' trees blow, oh\nI rep the East Coast, I got a team of hoes like Pat Summit\nI look like Arnold Schwarzenegger in a black hummer (get to the chopper)\nI splash summer like a fast brother\nWith a number on his back, ain't no fumblin', in fact, I'm\nBack, acid in my hat\nShoot then pass the gat, it's at the bottom of the river in a plastic bag\nMy new shorty got a gymnastic back\n87 emerald green on a classic jag\nShe had the cleft palate, I ordered chef's salad\nShe had the club foot, with that little arm\nI couldn't help but laugh, she ordered Chicken Parm\nI had the full Bulls warm-up with the Pippens on\n\nSuck my motherfucking dick, it's the young Randy Velarde\nQueens, baby\nBlow me", "title": "NaNa", "album": null, "image": "https://images.genius.com/4c92d833aae01e64b71a556bb1cb9f0b.990x660x1.jpg", "year": null}], "artist": "Action Bronson"}