{"songs": [{"image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "year": null, "lyrics": "*samples Capone-N-Noreaga - Invincible from album \"The Reunion\"*\n\n[Hook]\nThe invincible untouchable Ali Vegas y'all\nYou ain't...you ain't ready yet\nThe invincible untouchable Sleepy Eyes\nYou ain't...you ain't ready yet\n\n[Ali Vegas]\nAyo it's a stick up\nY'all know how the game go\nCop the milk trucks and fuck the Range Rove\nWe stained those game hoes, and spit at same flows\nLeave D's in they clean clothes with they brain exposed\nExplain to foes that diamond is what I seek to do\nMy rhymes is more electrifying than Pikachu\nPoke'mon, hoes stroke the don in every town\nFuck Cristal, my team sip very fine Welches grape\nBefore rap I delt with niggas that delt with 8's\nHeavy not welter weight\nWe could bust gats\nY'all gotta cut crack to touch stacks\nI rather bust raps\nWhat black, y'all bust at me I bust back\nThrow your middle fingers up and yell fuck that (Fuck That!)\nWe all know that I could drench yo crew\nAnd Vegas and his Wolves is invincible\nSo what y'all want?\n\n[Hook]\n\n[Ali Vegas]\nAyo Vegas leave niggas sitting scared in they homes\nLet a flare from the chrome that'll tear thru yo dome\nMy raps is more exclusives than a pair of new foams\nEverybody know suicide is what I really condone\nDon't want nobody in the hood swearing on tone\nB.I.G. was the king of NY and I am here to heir the throne\nFuck who's the realist MC, cause I'm the livest one\nY'all Jordan, Magic, & Bird and I'm Iverson\nGot no respect for the best of them\nCan't be checked by the rest of them\nThat's why I neglected them\nAll drama I'm addressing them\nFuck the refs and them\nI know me and team be vexin' them\nThey know my Wolves deserving\nWhat happen when we start splurgin\nCome thru yo block swerving in two Serbians\nBack to back blue Excretions\nYeah my team need the benefit, cause we put the work in\n\n[Hook]\n\n[Sleepy Eyes]\nSleep is like a soldier at war, explosive and raw\nSqueeze the black toaster you fall\nAnd leave yo back broke with yo jaw\nMr. Pick Yo Lock And Open Your Door\nHit yo spot at 6 o'clock in front the grocery store\nSpeaking the slang loudly\nFloss braids proudly with suede Ballys\nRemain rowdy with guns that'll keep my brain cloudy\nBang like a gang rally as the earth is twisting\nBurn the insect, liquor burned my system\nRapping was my third addiction\nNever preferred to listen\nServing chickens\nLiving where civilians and innocent children turn to victims\nTrying earn a living, I'd rather drop some words of wisdom\nTook the urban rhythm, poetry mixed with journalism\nWho wanna harm me?\nI'm equpited enough to rip your arm piece\nSqueeze, them clips breeze like leaves on plam trees\nSick with it, spit lyrics that grip spirits\nMade of art, fuck a turn it to posion cause the kids hear it\n\n[Hook]", "title": "Invincible", "album": "Generation Gap"}], "artist": "Ali Vegas"}