{"artist": "Anotha Level", "songs": [{"title": "On Deck", "image": "https://images.genius.com/48100ad58310882b16f5882d30b4164b.763x768x1.jpg", "album": "On Anotha Level", "lyrics": "[Verse One] [Bambino]\nWe got the flows on deck and got the tracks on deck\nAyo the hoes on deck, a fat sacks on deck\nA pack of beers on deck, you know the gears on deck\nThe Level is like a frat we knock boots and then step\nInto the A.M\nStill to the P.M\nThought that you could play them and really you can't see them\n\n[Stenge]\nWell can I wreck this?\nGet rich and flex a Lexus\nCheck this rhyme from a couple of west kids\nFor some strange reason when I'm splifted\nI'm gifted\nAnd I got the flows to keep the hoes on my shit\n\n[Ced Twice]\nAnd I straight shift into fifth then back into fourth\nI once drank a fifth but I hurled on the porch\nStill I skeeeez\nFrom here to Tel Le Viv\nTell the fees\n+Don't Stimulate+ these\n\n[Bambino]\nEven in school you know I pulled straight tens\n(Pretty Butt is what they called him)\nAll them cheerleaders callin' my name I had two\nMary Jane and Mary Lou\nSo I smoke one and then I poke one\nOh what the heck, we got so many hoes on deck\n\n[Chorus]\nWe got the flows on deck and got the tracks on deck\nAyo the hoes on deck, a fat sacks on deck\nUmmmm, thanks for the jockers, I gotta get my propers\nIt's on deck, it's on deck, it's on deck\n\n[Verse Two] [Stenge]\nI got faaaaame\nBut I'm not Dana Dane\nSo much on deck, oh heck, but who's to blame?\nI blame it on the flows cause they grows like a tree\nYou can't see me with a telescope\nI'm hella dope\n\n[Bambino]\nWell I'm back on deck and extra strength like Advil\nIf a hoe don't give me time then my tag will\nIt's no biggie\nHoney come over, take a swiggy, then I diggy\nWe can get blowed like Ziggy's\nFather, don't bother me after I bust one\nNever get done son cause I never trust one\n\n[Ced Twice]\nPlus one\nThat makes two\nBut that won't do cause there's five in the crew\nAyo, I think I hear a cho cho\n(Yo I hear it)\n(Yeah, me too)\nTaaaaag me, now I'm in\nGrab your ticket and your twig and let me begin\nShe rode the night train\nWe gang banged the booty\nJust a few hooties\nNow we makin' movies\nWe filmed a flick called \"Freak Me, Freak Me\"\nShe said, \"Don't break it\nTake it easy.\"\n\n[Chorus] [x2]\nWe got the flows on deck and got the tracks on deck\nAyo the hoes on deck, a fat sacks on deck\nUmmmm, thanks for the jockers, I gotta get my propers\nIt's on deck, it's on deck, it's on deck\n\n[Verse Three] [Stenge]\nI'm on deck like a pirate\nCause I rip\nThe mic with the Lev\nI write more rhymes than was in Charlotte's Web\nRip down all the freestyles also\nI slam like that kid from Charlotte, I'm all pro\nAlthough\nY'all know I'm the sporty shorty on deck\nI shoot the gift, I'm all net\n\n[Bambino]\nWell excuse me, suckers don't run, you can't lose me\nA little more than flows to make the hoes choose me\nThe retros, the hoochies, the groupies, the floozies\nThe newbies, the shoobie doobie whop, they jock and won't stop\nCheck what I said\nFuck what they said\nI'm feelin' Guinness Stouty, rowdy, outty I'm wasted\n\n[Ced Twice]\nI'm the most flow havingest\nI know you're glad that it's\nOn deck\nI mic check\nA whole check\nI cash checks\nI eat Chex\nWhat's next?\nFlex\nTime to have sex\nRoll a phat Lex\nDrink a quart of Becks\nAnd I still hit my ex\nFrom the coast that's the best\nCall it the west\nDon't second quess\nI'm buddah blessed\nConfess\nI open eyes like Zest\nForget the rest\nI'm the best\nYour high-ness\nAnd it's all on deck\n\n[Outro]\nYeah it's all on deck! Fo' the nine fo' season. Yeah! It's all on deck\nFor the nine fo', know what I'm sayin'? Buckle up\nEcho rippin' up shit. Yeah, Lawhouse Production\nLawhouse. D's in the house. Law's in the house", "year": null}]}