{"songs": [{"year": "1993-06-02", "image": "https://images.genius.com/9703d795ec6c8c350b9674639f3fa5b8.500x500x1.jpg", "title": "Hooker Got a Boyfriend", "album": "All Samples Cleared", "lyrics": "[Verse One]\nAiyyo here's a tale, about a female I once messed with\nOr better yet, skins that I swung eps with\nFace full of grace, waist shaped like Vanessa Del Rio, oh-me-oh, my but the heffer had\nBig juicy lips, wide hips you had to call fat\nStacked back to mack, yo the hooker was all that\nAnd lots more, and baby girl I had the hots for\nBut I'm really not sure, who she spread the twat for\nHeard it was a kid across town named Hector\nBut I don't give a heck, so I still went and checked her\nOn the down low, he ain't around so\nOut of sight, out of mind, get your coat and let's go\nSo we dipped, hopped in the whip and we was gone\nOff to City Island cause they had it goin on\nTwo yuks a foo, now the mood was set\nCaviar at the bar, Red Star, Moet\nSilk suits, spendin loot like a straight up mack\nWhen I felt somebody finger tappin me on my back\nAnd turn around quick, but before I could begin\nAll I seen was a big mac-10, aiyyo it's her boyfriend\n\n[Hook]\n\"Hooker got a boyfriend!\"\n\"Why do she do this boyfriend?\"\n\"Ohh ahhh.. why do she do this boyfriend?\"\n\n[Verse Two]\nCheck it, yo\nI broke camp, ran like a champ, yep I jetted\nOff to the trunk for the pump, time to set it\nMoney kept screamin some CRAP that I dissed him\nSo I started lettin off {*gunshots*} but I missed him\nHoney got scared, and called the five-oh\nSo yo, you know the half Dukes, time for me to go\nCause I ain't the type to be doin no bid\nFor a dame or a lame-brained punk Spanish kid\nSo I chill, call the hooker up the next day\nShe told me come over yo, bet I'm on my way\nBe there in a sec, yo I'm not too far\nShe said, \"Park around the back so he don't see the car\"\nMet me at the door with a kiss and a smile\nI said, \"Sorry about last night, money kinda wild\"\n\"Umm yeah I know, small thing don't worry\"\nJust show me to your room so we can do this in a hurry\nKissed her from her earlobes down to her chest\nWent for the bellybutton and to hell with the rest\nGot her butt-naked and before a second passed\nI had her on the bed with my fingers up her {ahh!}\nNow she's ready, set for a good steady bangin\nUntil she looked down and seen Moby Dick hangin\nShe told me, \"Take it easy yo trust me just chill\"\nKnowin once I get up in it yo I'm goin for the kill\nSo she spread 'em, thick rich and creamy like mayo\nAiyyo, lay-o, the tip is on the way-o\nPinned her legs back, just about to slide in\nWhen the door burst open {*SLAM*} damn it's her boyfriend!\nDid it again!\n\n[Hook]\n\n[Verse Three]\nNow I'm mad, money done spoiled all the fun\nOn top of that he beefin and he ain't got a gun\nFlippin the jibs, I guess he wanted to brawl\nSo I started hookin all butt-naked and all\nThrew a right, caught money dead in the jaw\nBOOM with the left and his fronts hit the floor\nNow I had him, time to put his head for rest\nSo I beat him unconcious and I started gettin dressed\nHoney all hysterical and screamin all hoarse\nSaid she seen a box car pullin up in the yard\nJust bout to jet, yo guess what I saw\nSome old big black {*HMMM*} bust in the door\n\"Now hold up, what the hell you doin in my house?\nGet your ass off the floor, put your teeth in your mouth\nNow everybody better be gone by the count of one\nLook, better yet, y'all stay right here\nI'm goin to get my gun\"\nNow that's it! Enough is enough, I ain't with it\nI'm catchin mad beef and yo I ain't even hit it\nHoney looked good and yo the buns was fat\nBut ain't a coochie in the whole WORLD worth all that\nSo umm, I got my coat and I was on my way\nThat's when she started breakin down, and beggin me to stay\nKnock it off, it ain't that much beggin in the world\nNext time I want some skins, I'll go and hit my own girl\nMan I'm out, and I ain't tryin to see you again\nSo eff you, eff your pops AND YOUR FAGGOT-ASS BOYFRIEND!\n\n..\n\n[Hook] - repeat 2X to fade"}], "artist": "Biz Markie"}