{"songs": [{"year": "2013-04-13", "album": "The ASF EP", "image": "https://images.genius.com/fab425c6cbff990a43f331ff132e4dcd.500x500x1.jpg", "title": "Ian Mad", "lyrics": "[Intro]\nKevin lab rats, nigga, Abstract, nigga, ask that\nNigga, bring it right back, nigga, missed the all caps, nigga\nNigga, nigga, nigga, nig, yeah\n\n[Verse]\nFell from the sky at the age of three\nAlways wondered why the kids in class looked so different than me\nDidn't bother me much, took my crayons to lunch\nI ain't give a fuck, made my own squad, weird bunch\nDodi Mob in this bitch, get used to it\n\"Fuck your dreams, your a teen, stay being a student\"\nThat's what Mrs. Saenz said\nWell, it don't really matter 'cause Ms. Saenz dead in my mothafucking head\nI'm a dreamer, I'm a leader, I'ma mothafucking star\nPyramids fell from the sky and landed on my front lawn\nNow my mom thinks I'm crazy and a little bit gone\nOut of my mind, but we'll be fine I'ma give her six months\nTo think about the situation and just understand me\nBut you know how parents be, when it comes down to parenting\nExcuse me for the ranting, but I hope you understand me\nHello, I hope you feel me\nAmerica can you hear me?\nAnd I just recently moved to Atlanta\nI'm an outcast here and I ain't close to Savannah\nI don't roll with no tools, I ain't holdin' no hamma\nI don't roll with them fools who be wearing bandannas\nNo hype beast, nah nah nigga\nRather raw-dog a dog and jam out to Rahdigga\nAt the same damn time, yeah, bitch, that's right\nNo metaphor within these lines, no dollar signs in these eyes\nIt's the passion with this shit, that's gon' make the squad rise\nI ain't gotta rap on old ass beats, or talk about my third eye\n(Oooh why? Why he say that shit?)\n'Cause I'm tired of all these bloggers postin' lame ass shit\nThat same ass shit, one train ass shit\nI've been telling you exactly what that bullshit is, ass shit\nYou can ask ya squad or ask ya god\nWe go so got damn hard, word to big brother Dom\nAnd I ain't goin' out without no fight\nWe deserve the praises that you serve to the most high, most lie\nSo I'ma be on stage screaming, be on stage singing\nRepresent every teenager in they bedroom dreamin'\nBring something to the big screen and finally have a meaning\nShut shit down, go so hard\nRest in peace to Steve Jobs, said I go so hard\nNigga squad, Dodi Mob\n\n[Break]\nThirty five in this bitch\nLab rats, all nine 'til forever, nigga\nYeah, that shit right out\nKeep goin', business\nKeep go\n\n[Outro]\nI rep, I rep alive 'til forever\nI rep, I rep, I rep a nine 'til forever\nI rep, I rep, I said ALIVESINCEFOREVER\nI rep, I rep, I set a nine 'til forever"}], "artist": "Kevin Abstract"}