{"songs": [{"title": "007", "album": "Larry", "year": "2016-06-16", "image": "https://images.genius.com/4256a30cd1700e088ea3308b2325408f.450x450x1.jpg", "lyrics": "[Intro]\nHow you doing sweetie?\nNames Larry. Larry June now\nSweetheart can you please go to Whole Foods and get me 3 farm raised chickens sweetheart? I swear to God, sock it to me\n\n[Hook: Larry June]\nI got bad hoes like double oh seven\nTuck spot in a foreign like double oh seven\nBig choppa on my arm like double oh seven\nI got a hundred thousand dollars and a plug named Kevin\nLike double oh seven\nLike double oh seven\n\n[Verse 1: Larry June]\nThe bitch said it's slow but I think she's catting off\nMade one phone call, hundred pounds to the south (shit!)\nNumber one rule never keep it in the house (good job Larry!)\nReal street nigga you can hear it when I talk\nThey gave my nigga ten but we mobbin' 'til he out\nSit a bitch down like a motherfucking couch\nYou a house nigga with some internet clout\nThe bitch got knock now your feelings coming out\nIt's six in the morning and a nigga still trapping\nI don't even want it if that bitch ain't got navi\nMob to the V I'm in the crest with a ratchet\nHit my nigga Shaq for the pack like \"What's happening?\"\nBackwoods only when I'm in a smoke session\nThe bitch doing good so I bought the ho a necklace\nCashed out for a bitch I'm balling like a pastor\nThe first car I had was an E-class Lexus\nThen I bought the Benz off the lot straight trap shit\nFunny ass nigga choppa made him do a backflip\nWith my black bitch in the hood eating catfish\n(Hey bitch gimme that motherfucking hot sauce ho?\nThank you sweetheart)\n\n[Hook: Larry June]\nI got bad hoes like double oh seven\nTuck spot in a foreign like double oh seven\nBig choppa on my arm like double oh seven\nI got a hundred thousand dollars and a plug named Kevin\nLike double oh seven\nLike double oh seven\n\n[Verse 2: Larry June]\nI'm chilling on the beach and I'm trying to catch a tan\nIf the bitch get a car then I'm hoping it's a band\nThey not fitting in my Prius so I gotta rent a van\nThat's a hundred fuckin' bales from that Arizona land\nRemember in the 90's, thirty six was for the ten\nThat's that A1 Becky if you dig what I'm saying\nRest in peace Mac Dre, rest in peace T Woods\nRest in peace Lil Corky, they my niggas from the hood\nWhen you really having money nigga you never show it\nAll the sudden niggas callin', everybody want something\nI could fall off today, still be the same nigga\nI swear to God I never change, my bank just got bigger\nWhen I slide to the point I keep MAC-10 with me\nI don't owe you niggas nothing I don't fuck with new niggas\nI'm from the motherfuckin' Bay, where Jack Boy will get you\nSipping Fiji on the beach with a bitch from Costa Rica\n\n[Hook: Larry June]\nI got bad hoes like double oh seven\nTuck spot in a foreign like double oh seven\nBig choppa on my arm like double oh seven\nI got a hundred thousand dollars and a plug named Kevin\nLike double oh seven\nLike double oh seven"}], "artist": "Larry June"}