{"artist": "Vado", "songs": [{"title": "The Greatest", "year": null, "lyrics": "I’m like Ray Charles sitting courtside, I can’t see the game\nThese rappers get deals that need to change\nToo much carrying like Aaliyah’s plane\nI’m in the jungle cutting trees and things\nArmy fatigue pants, hat on, where it’s ten for a key of caine\n\nIt’s a bigger picture, you don’t need a frame\nOn the road to riches for a minute but just starting to see the lane\nFrom linux ave to Cedar lane\nI know niggas that get it fast and heed a bang\n\nFreeze the Muller, dining at Peter Luger\nLarge platter under the napkin I keep the ruger\nCigar tapping, ashes is dropping, speaking to shooters\nWere schooled to the game by street teachers and tutors\nJail preachers and movers\n\nOG’s I make em proud\nEnough to go wholesale but I'mma break em down\nTake a pound leave out the back and don’t make a sound\nBout to shake the crowd, so y’all can start the hating now\n\n(Chorus 2x)\nBallin’ you not\nYou ain’t getting money stop\nWhere your work at on the block?\nWho you got pumping the rock?\nThought you was sitting on the top\nSee me shitting in the drop\nHow I’m living you can watch\n\nTrap all day trap all night\nMoney in the bank when that crack all white\nFront around me, get clapped on sight\nHigh top airs, got em black on white\nHat on right, tilt on the waves\nAll white xj got milk? on the plates\nKnow some real dudes that’ll kill for the yay\nClip spray, get your whole chest filled with the k\nStill to the day, niggas need to hate\nJust came from the A\nDid a part with Lisa Ray\nLittle light joint you can still see my face real quick\nHand shake then me n flee leave the place\nHigh-speed chase, yellow canary charm\nIn a Carrera 4, I got my Carreras on\nGreeting me at the door, she naked don’t wear a thong\nTatted from ear to arm, the neighbors can hear her yawn\n\n(Chorus) 2x\nBallin’ you not\nYou ain’t getting money stop\nWhere your work at on the block?\nWho you got pumping the rock?\nThought you was sitting on the top\nSee me shitting in the drop\nHow I’m living you can watch\n\nLock doors when I step in stores\nDamier checkerboard\nDough I collect like I’m waiting for you to accept a call\nYour metaphors like old ladies menopause\nNever thought you was real anyway like Santa Clause\nYou need to get up and do something baby boy\nWord to ma every morning I heard that lady’s voice\nKept bud and guns that made a crazy noise\nMy next car all red like most of baby toys\n\nGat fully aimed sluggers\nSee me with little wearer’s hat, hoody same color\nPretty boy on the low black skully waves under\nTom Cruise in the v speeding thru days of thunder\nBlow haze and wonder like who the next nigga?\nIt gotta be me, hands down I accept nigga\nIt was your catch but yeah I intercept niggas\nThought they was reppin the Bronx the way I x niggas\n\n(Chorus 2x)\nBallin’ you not\nYou ain’t getting money stop\nWhere your work at on the block?\nWho you got pumping the rock?\nThought you was sitting on the top\nSee me shitting in the drop\nHow I’m living you can watch", "album": "Slime Flu", "image": "https://images.genius.com/450bb04055170c173165f2ba8510a395.200x200x1.jpg"}]}