{"artist": "IDK", "songs": [{"title": "24", "lyrics": "[Intro]\nUh-huh, uh, uh, uh, uh\nUh-huh, uh, uh, uh, uh (BLWYRMND)\n\n[Chorus]\nOoh (Ooh)\nWhy you do that like that? (Like that)\nIt's a lot of money, why you mad like that? (Like that)\nOoh (Ooh)\nI'm in my new bag, my bag (My bag)\nYou ain't gettin' shit, bitch, too bad, my bad (Yeah, uh)\nFirst of the month, I'ma run it back (Ayy)\nSame day why I'ma run it back (Yeah)\nFriday, payday, run it back (Ayy)\nRun it back, run it back, run it back (Ooh)\n48 yards, I run it back (Ayy)\nI cop a car, I run it back (Yeah)\nFuck on your broad, then run it back (Uh)\nRun it back, run it back, run it back\n\n[Verse]\nHello? That's the check callin' (Talk it)\nLet me click over real quick, then let my check talk it (Talk it, talk it)\nI eat, ooh, Pac-Man, that's the way my neck talkin' (Right)\nI ain't never comin' back the way the stress talkin'\nYou don't make no clap back when you backpack, my bad\nBut I'm past that, with a NASDAQ, that's cash\nWhen the money fall, I'ma slap that ass, clap\nWhen the money go, you don't slap ass, that's facts\nIf the money low, I'ma wear a strap where I'm at\nWhen it come back, I'ma give it back, my bad\nWhen the check hit, the direct hit, I'm glad\nWhen the check miss, the direct hit, I'm sad like–\n\n[Bridge]\nWho's that knockin' at my window? (My window)\nThey say that it's the money, I'm like 10-4 (Over and out)\nThat stick gon' make you duck like a limbo (Brap-brap-brap-brah)\nShe say she not a thot, she a nympho\n\n[Chorus]\nOoh-ooh-ooh (Yeah, ooh)\nWhy you do that like that? (Like that)\nIt's a lot of money, why you mad like that? (Like that)\nOoh (Ooh)\nI'm in my new bag, my bag (My bag)\nYou ain't gettin' shit, bitch, too bad, my bad (Yeah, uh)\nFirst of the month, I'ma run it back (Ayy)\nSame day why I'ma run it back (Yeah)\nFriday, payday, run it back (Ayy)\nRun it back, run it back, run it back (Ooh)\n48 yards, I run it back (Ayy)\nI cop a car, I run it back (Yeah)\nFuck on your broad, then run it back (Uh)\nRun it back, run it back, run it back", "image": "https://images.genius.com/322a1b112ea1365644cd1a12eaf74fb1.461x461x1.png", "album": "Is He Real?", "year": "2019-07-23"}]}