{"artist": "Pacewon", "songs": [{"album": "Won", "title": "Nobody", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "[Young Zee]\nWho fuckin wit us?\nNobody\nOne more time, nobody\nNobody\nYeaaah, hah\nAnd we don't appreciate (what the fuck?)\nPeople throwin' they little two cents in (Outsidaz)\nSpreadin' rumors (rah digga, young zee)\n\n[Pacewon]\nAll grace, Pace the MC with great powers\nNiggas play my tape and blank out for eight hours\nAt 9 PM you get caught up in my rhyme flow\nThen before you know it, it's morning/Mourning like Alonzo (good morning)\nTo the beat y'all, I mack like Peetie Wheatstraw\nGirls say my speech, y'all inflated like a beach ball\nYa see the misfits and real sister's Digga (yeah Pace!)\nNiggas know we Soul 4 Real like the singers\nTo the fiends, my tape's like a drug now\nRappers smokin' it, choke and spit blood out\nMCs watch me, clock me, keep charts\nI'm a seat and they refuse to get up like Rosa Parks (sit down)\nAll MC's, here to Vancouver\nPace carry cans of pubic lice remover (yeah)\nFor crab MC-type intruders, I carry cans of pubic lice remover\nHigh as fuck, drunk off the chardonay\nPacewon, represent the Garden State\nMachete sharpener, Kurrupt like Daz's partner\nDark, too smart to fake moves like Ron Harper\nI wil' on jokers more than Oprah got papes\nAnd live to stop fakes like anti-lock brakes\nWhen the cops chase I fiend like a crack buyer\nTo locate the joints pointed at this rap guy, ah\nWeave a spell to make they're guns backfire\nAnd hit their Michelins, giving them a flat tire\nFoul to Cali, renowned, too (??)\nStroke up and down through pussy that will drown you\nThis is for MCs soundin' like me\nPace Won, I tell 'em not to dick ride me\nYeah, for crab MCs type intruders\nI carry cans of pubic lice remover\n\n[Hook: Young Zee]\nWho the fuck in here can rock like me?\n(Zee, Digga, Pace): Nobody!\nAnd what the fuck click get more props than we?\nNobody!\nWho want to get it on with the O-U-Tz?\nNobody! Nobody!\nWho the fuck in here can rock like Zee?\nNobody!\nWhat the fuck click get more props than we?\nNobody!\nWho want to get it on with the O-U-Tz?\nNobody, nobody!\n\n[Pace Won]\nFrom the door I despise you\nSay one word I'ma fuck you up worse than St. Ide's do\nSo don't blast off, mouth get gassed off\nAnd say something I'm gon' have to whip that ass for (we gon jump you!)\n'nuff said, talk and get your fly ass caught up in my web\nSit and break bread, shake hands and make friends, cop a grey Benz\nGot you like heavy metal, rock until the tape ends\n\n[Young Zee]\nAnd I can't forget the heads that get me high for free\nThat liked my shit back when we was rockin' Lees\nAnd them fake niggas always think of robbin' Zee\nThey just mad cuz they don't get more fucking props than we\n\n[Pacewon]\nYo- men like me play with swords like Zoro\nFags like you could test positive tomorrow (for AIDS)\nYou gay as Rock Hudson, puffin'\nPlayin' like you somethin', frontin', suckin'\nMore dick than hoes do, parallel parkin'\nJump out your car then walk like Dolly Parton (lil' chicken)\nThis for the crews soundin' like us\nOutsidaz, try not to dick ride us\n\n[Hook]\n\nBreak it down\n\nOuthouse\nWho can rock like Zee?\nNobody, nobody\nOuthouse\nYeah Yeah, what up?\n\nWho the fuck in here can rock like Zee?\nNobody!\nWhat the fuck click get more props than we?\nNobody!\nWho want to get it on with the O-U-Tz?\nNobody, nobody, what?\nWho the fuck in here can rock like P-A-C-E?\nThere's nobody, nobody nobody...\nAnd who get more props than Zee?\nNobody!\nWho wanna fight me?\nNobody, nobody!\n\n[Digga] Uh, Rah Digga, nobody...\n[Zee] In the Outhouse world, there's still nobody that can fuck.... uh", "year": null}]}