{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Just Another Day", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "MOM (UNDER NARRATION): Yo, dunn, you better represent! Stop baggin’ up chickens and get in the know! Don’t stack your chips… [etc.]\n\nTARIQ (NARRATION): Damn. Monday morning. Same bullshit, different day. Ma Dukes don’t understand the hustle. Ever since I graduated five years ago, she been on my case about everything. Getting a better job, getting out of this neighborhood, keeping an eye on my sister, whatever. But yo, as soon as I get my record deal, everyone’s gonna know what time it is. Especially my boy Tru. He had his chance. He even taught me how to rhyme. But he gave up like a sucka. He blames me for his quittin’. Yo, I couldn’t help it if people thought I was doper than him! Regardless, we s’posed to be like brothers! One for all, all for one! Jealous or not, that’s still my nigga. Yo, all I know is this: Thursday, I got this meeting with the Wu… Yo, it’s gon’ be on, that’s my word. Only one problem. I gotta scrape up a fuckin’ G before Wednesday to finish the demo. Fortunately, my boy Tru got dough. He should be able to lace me until I get this record deal. He knows I’m good for it. We’re like brothers\n\nMOM: As for you, just make some money, baby, and be a man\n\n[*doorbell rings, door opens and shuts*]\n\nSISTER: Tariq! Tru’s here!\n\n[*footsteps, door opens*]\n\nTRU: Ayo, what up, dunn? Oh, hello, Ms. Jenkins. I swear, no matter what time of day it is, you always look radiant\n\nMOM: Oh, boy, stop. You boys better be gettin’ on yo way\n\nTRU: You’re right, ma’am. Hey, Tariq, you ready?\n\nTARIQ: Yo, let’s be out\n\nMOM: And Tariq! You remember what I told you!\n\nTARIQ: Aight, ma!\n\n[*door shuts*]\n\nTARIQ (NARRATION): Little did I know, this ride to work would change my life forever\n\n[*radio playing, driving noises*]\n\nTRU: Ayo, dunn, what’s up? You looking a little tired. What’s up? Yo, you was up again late last night with that studio shit, right?\n\nTARIQ: Yeah, man. You know I got that meeting with the Wu next week. I just wanna make sure I got that bomb shit, yaknahmsayin’? You know how we do\n\nTRU: Aight, aight. I hear that. So how’s it comin’?\n\nTARIQ: You know, I’m glad you asked. Yo, I’m almost done. I just gotta put the lyrics and mix this one joint, and then remix the two joints I played you last week. But check it: I’ma need your help though\n\nTRU: What, rhymin’?\n\nTARIQ: Nah, nah, nothing like that! I need you to loan me this G\n\nTRU: Say word\n\nTARIQ: Word, I’m saying! You know I’m good for it! You know I’ma hit you off as soon as I get this deal!\n\nTRU: So let me peep what you got!\n\nTARIQ: Yo, bust it!", "year": null}]}