{"songs": [{"title": "Black Eskimo", "lyrics": "[Produced By: Cardo & Johnny Juliano]\n\n[Hook]\nAll the nigga talk ‘bout bricks and birds\nChinchilla shit, nigga his and hers\nAP, Rolex, he’s a professional\nThey call him Snowman bitch, the Black Eskimo\n\n[Verse 1]\nIn a black full length mink, getting this money\nTry to stop me, lay you down like a perm nigga\nIPhone on you hoes, taking selfies at the store\nStrike a pose with them hoes like “look at me!”\n’04, ’05, little nigga, I was getting tight money, don’t fold up\n2 door, 250\nBitch you better open my door when I roll up\nHad them coming to Atlanta for the Hawks\nHad the ticket, was the man in the city\nHad the city so motherfuckin hot\nDamn near bought a fan for my city\nHey you talkin’ bout\nUsed to get money with the milli, OG shared his cell with\nIf he tell you anything\nThen he’ll tell you nigga that I ain’t ever tell shit\nAin’t no need to be excited, I ain’t ever been indicted\nPussy nigga I ain’t told shit\nThe nerve of you niggas, signed with these rappers that never sold shit\nHad that Rolls gold, Rose Bowl\nJacob all Rose gold everything (Trinidad!)\nTalkin’ ‘Rarri 430 with the piping on the seat, it was everything\nNigga made a quarter mil at the Texaco\nTook his thing in the club like he’s Plaxico\nAlways fresh from head to toe\nKnow his name in the mall nigga? Every Sto’\n\n[Hook]\nAll the nigga talk ‘bout bricks and birds\nChinchilla shit, nigga his and hers\nAP, Rolex, he’s a professional\nThey call him Snowman bitch, the Black Eskimo\n\n[Verse 2]\nI ain’t talk to be talking\nI don’t talk to just talk\nSnow say something y’all better listen up\nYou going in your bag, what you goin’ by your jeweler\nNigga you icing out your wrist or what?\nYeah, I got a few trophies\nBitch that Hublot looking like a Heisman\nI’m so motherfucking high up in this bitch\nI swear I’m thinking ‘bout diving\n5 quarters on chill\nWrist looking like a grill, nigga Mike Jones (who?)\nYou gone learn ‘bout this niggas\nLoaned sperm out these niggas\nWhat they is nigga? my clone\nGotta keep the grass cut\nKeep your eyes on these snake ass niggas cuz they pythons\nThe God of this bitch, the MJ of this shit\nAnd you can tell these niggas Mike home", "album": "Seen It All: The Autobiography", "year": "2014-09-02", "image": "https://images.rapgenius.com/ae2a60577117039d1649c820ee234875.600x600x1.jpg"}], "artist": "Jeezy"}