{"songs": [{"title": "EBT to BET", "album": "Free Crack III", "year": "2016-08-26", "image": "https://images.genius.com/e3c32eacd60e3592d9fdad3af8af9a56.1000x1000x1.jpg", "lyrics": "[Produced by DZL]\n\n[Intro]\nYeah\n\n[Verse 1]\nI'mma be one of the greatest I can feel it in my veins\nPeople sell they soul just to try to get a name\nLost homies to the streets, had to charge it to the game\nSeem like everybody changed, I guess that's the price of fame\nBut I knew you motherfuckers was gonna come right back\nI sit back, relax, while I count these stacks\nBibby show up to your city, I need 10k flat\nGot a couple homies with me that was in that trap\nNow what the fuck do I need with a GED?\nI went from EBT to BET\nWhat the fuck can a damn high school teach me?\nMan this rap shit got me set up, now I gotta keep my head up\nI sit back and think, this weight on my shoulders\nI might need a shrink, living drug free, man I might need a drink\n(I'm goin' crazy and shit man)\nSay I'm finna cop a Jesus piece cause niggas, they ain't seein' me\nCritics, they critiquin' me, love when they don't believe in me\nThis real life, real facts, this ain't rap\nWalk into that corner store, we had to stay strapped\nYeah, most of these niggas can't relate to that\nAskin' all these questions, get the fuck up out my face with that\nShit, real talk, that's on everything\nDesert Eagle, you don't wanna hear that bird sing\n\n[Hook]\nThat's all I know\nIn these streets I can't let go\nAnd I put that on everything\nDesert Eagle, you don't wanna hear that bird sing\nYeah, that's all I know\nIn these streets I can't let go\nAnd I put that on everything\nYou don't wanna hear that bird sing\nNow what the fuck do I need with a GED?\nI went from EBT to BET\nAnd what the fuck do I need with a GED?\n\n[Verse 2]\nHad a dollar and a dream, momma was a fiend\nBaggin' up the green while I plot and I scheme\nCars and the hoes that I watched on the screen\nCome to find out shit is not what it seems\nI'm bout to kill this shit, I feel this shit\nWish somebody would have warned me, I'd have quit this shit\nSometimes I wish I never did this\nYou know what man? Forget this shit\nCause sometimes I be thinkin' bout offin' myself\nIt's no one that I could trust, so I talk to myself\nI understand this shit, that's how it feel to be the man and shit\nA lot of niggas want this life, I swear they couldn't handle it\nI stay in the newest shit like a mannequin\nI got these niggas panicin' like \"Bibby goin' HAM again\"\nGoin' hard, I want that Ghost and that Benz\nFucked up last night, smashed my man's girlfriend\nNow she talkin' that EPT\nTryna have me back on EBT\nNo not me\nI had to clip her like CP3\nMan you niggas can't flow like me, hah\n\n[Bridge]\nThat's all I know\nIn these streets I can't let go\nAnd I put that on everything\nDesert Eagle, you don't wanna hear that bird sing\nYeah, that's all I know\nIn these streets I can't let go\nAnd I put that on everything\nYou don't wanna hear that bird sing\nNow what the fuck do I need with a GED?\nI went from EBT to BET\nAnd what the fuck do I need with a GED?\nAnd what the fuck do I need with a GED?"}], "artist": "Lil Bibby"}