{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "Give Em Hell", "image": "https://images.genius.com/459c7b64c165fbc76e02360f338fe60b.600x600x1.jpg", "lyrics": "[Intro]\nThey took permanent vacations in Hell, if you know what I mean\nWow, I must have been away too long, because my feelings are dead\nI feel no remorse…\n\n[Verse 1]\nGlobal state of mind, I’m seein’ far beyond my nose\nTen years from now, I’ll still be around, spittin’ my flows\nTen years from now, you’ll be a memory that no one knows\nI don’t feel sorry for you niggas, my feelings are cold\nPeople dyin’ – life goes on, it’s…\nNothin’ you can do about it, just be strong, yeah\nDead-weight niggas try to pull you down with ‘em\nThey like psychic vampires, suck the life out you\nMentally, I’m focused, think like a Marine\nWho ride? I ride or die for shit that I believe, like…\nNobody could stop me\nI’m the illest rapper probably on the earth, niggas copy\nEvery line that I draw, these rappers is frauds\nMy artwork expensive, they cannot afford\nRSVP, Circa 2012\nHow dare a nigga to try and stop me, give him Hell\n\n[Hook]\nOh, word? They put a hit out on me?\nGive ‘em Hell\nThey wanna threaten my wellbeing?\nGive ‘em Hell\nAnd tell Satan throw some heat rocks up\nFor the world’s most hottest rapper spittin’ flames like a volcano\nYeah, they wanna turn on me?\nGive ‘em Hell\nThey wanna stretch me out in the street?\nGive ‘em Hell\nAnd tell Satan throw some heat rocks up\nFor the world’s most hottest rapper spittin’ flames like a volcano\n\n[Verse 2]\nAye yo, aye yo, they know, they know\nI’ll blow a nigga away like tornados\nNiggas with me, they move whenever I say so\nWatch out for the D’s, unmarked cars and plainclothes\nNiggas must be crazy, they gone off that yayo\nMaybe smokin’ stones, I don’t know, I’ll be okay, though\nI’m God’s solider, devil’s apostle, it’s harvest time\nYou reap what you sew when you cross the line\nIt’s beyond repair – I am so beyond fear\nThat shit is childish, do what you must, niggas beware\nI am – slippery when wet off that ‘maldehyde\nSmoke a Dutch full of dust, pull a homo\nNiggas wouldn’t side with you if they knew what I know\nI can see you bullshit niggas with my eyes closed\nI’ve got a deadly rap\nSo these jokers wanna ruin my time, I’ll handle that\n\n[Hook]\nOh, word? They put a hit out on me?\nGive ‘em Hell\nThey wanna threaten my wellbeing?\nGive ‘em Hell\nAnd tell Satan throw some heat rocks up\nFor the world’s most hottest rapper spittin’ flames like a volcano\nYeah, they wanna turn on me?\nGive ‘em Hell\nThey wanna stretch me out in the street?\nGive ‘em Hell\nAnd tell Satan throw some heat rocks up\nFor the world’s most hottest rapper spittin’ flames like a volcano", "year": null}]}