{"artist": "Gangsta Boo", "songs": [{"title": "This is Personal", "album": "Enquiring Minds", "year": "1998-09-29", "image": "https://images.genius.com/5283d1f21d20bdec4953ec12b3d4e43a.300x300x1.jpg", "lyrics": "[Project Pat]\n1 - Walked up to your house\nKnocked on your door and blast\nKickin' down your fuckin' shit\nThen snatchin' up the mass\nThis is personal bitch\nSo we gon' leave the cash\n\"What you niggas want with me?\"\nTo torture your ass\n\nRepeat 1\n\n[Gangsta Boo]\nThe blazin' sun refers to us as the sun is blindin' me\nBesides infrared wine, Hypnotize Minds right behind\nPackin' plenty heat for you niggas wit some beef\nBeef is what I ? to be\nKeep your mom up off the streets\nNever said you were my friend\nFuck this rap, I'll get revenge\nStick a knife up in your stomach\nPull it out and stick it in again\nGhetto kings and queens if you wit me, let me know\nPull up off your fuckin' blunt, hit another line of blow\nBadder than a school of kids, they just want to fuckin' see\nClicked up with the triple 6, you don't know who you're fuckin' wit\nNot to play for cheap\nGot you ? to JB\nAnd some gas wit your ??? live as you could be\nTalkin' shit about Miss Lady cuz you think that you the shit\nBeat you with a fuckin' bat, dump your body in a ditch\nGuess you know who you are, keep a watch out on your car\nIf you open up a door or bump, I'll blow your ass to Mars\n\nRepeat 1\nRepeat 1\n\n[Project Pat]\nNicky nack, patty wack, slap a chick in the back\nWith the yak, ? paper red, just another Black dead\nWas it dope? Nah\nLove? Was they weak and soft?\nHoney says weed got a nigga sayin' fuck a job\nKill and rob\nGettin' up on some dope\nThe mentality of the Black male\nIf he dies, that's a casuality\nIt gon' be even worser times in the time to come\nBigger blunts to blaze, so you best pack a bigger gun\nGive me some, give me some, drop it off you selfish bitch\nMotto of a killer when he's out here tryin' to take your shit\nProject spit nothin' but the real, so my niggas kill\nWhere I'm comin' from, south side out the ghetto slums\nWith them guns always stayin' cocked\nWhere them killers hang\nPlayas slangin' rocks\n??? where your niggas bang\nWhen you sing like canaries do\nThen you feel my niner slugs comin' right through your door\nIf you can dig\n\nRepeat 1\nRepeat 1"}]}