{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/46024c599af33cab0a41bb7a1d4ca633.1000x1000x1.jpg", "year": null, "album": null, "lyrics": "[Intro]\nYung Lan on the track\nHow  you do that Cujo?\nFigurez  made it\nYeah\n\n[Chorus]\nTrappin', cappin', super dabbin', bandin' out on Gucci jackets\nQuater-pounder,  gun to pack, I stretched that shit like it's elastic\nBoy,  you fake, I know you plastic, molly got her flabbergasted\nPull up with them .223 Russian AK's and automatics\n\n[Post-Chorus]\nPussy  super soakin', splashin' water on her Gucci shirt (Oh my God)\n[?] Smith & Wesson, packin' dick inside the dirt (Oh my Lord)\nGivenchy flavored drippin' on her Fear of God mini skirt (Yeah)\n30. clip with forty Glocks and semi-automatic bursts\n\n[Verse]\nFuck  all of that talkin' shit, you know lil' Melly shootin' first\nCatch a nigga slippin' and we bussin' at his ass on [?] (On [?])\n.223's and MAC-11's, knock that boy right off the earth (The earth)\nYeah, that lil' boy a bitch, get the percs\nYeah, that lil' boy a bitch, get the percs (Get the percs)\nGet a ho some molly, rockin', watch them bitches smooch each other (Smooch each other)\nGreat young nigga broke his pockets, shorter than some coochie cutters (Coochie cutter)\nMainly posin', pistol totin', keep a pocket full of Trojans (Full of Trojans)\nPussy soakin', buss it open, wetter than Pacific Ocean (Pacific Ocean)\nHit him wit' that F&N, now that boy body decomposin' (Mushroom)\nPop that pussy for my clique and you might get some self promotion (Mhm)\nDrako for all the commotion, up this bitch wit' no emotion\nShorty got me overdosin', ride that dick, a roller-coaster (Oh)\nRoller-coaster that shit lil' bitch (Lil' bitch)\nPull up on him wit a stick (A stick)\nMelly baby, hittin' licks (Them licks)\nRun in yo' house wit' the shits (The shits)\nYeah, I ride wit' them young jits (Them jits)\nYou niggas be handin' out bricks? (Bricks)\nYou niggas shippin' them pounds? (Them pounds)\nYou niggas got Glocks wit' fifty rounds? (Rounds)\nYou got niggas, pull up, don't make a sound? (Lil' bitch)\nGet it, repeat, believe\nHe wanna [?] bitch, I want Patek Philippe, yeah\nI might just fuck on a freak (Freak), I wanna get back to me\nAnd I might get a jet-ski (Yeah)\nBitches so wet, need a jet-ski (Ski)\nYeah, that my bitch bestie (Yes)\nHit that lil' bitch with the SK (My bitch)\nHit that lil' bitch with the SK (The Glock)\nSmoke his ass, just like a ashtray (Pssh)\nOoh, damn, ho (Damn, ho)\nI swear to god I'm 'bout my fam' though (My fam' though)\nFeel like [?], finna [?] a nigga\nMelly baby, tryna rap a nigga (Huh)\nI'ma scammer, I'ma robber and a motherfuckin' trapper nigga\nNo, I am not no trapper nigga\nAnd I think they just untapped a nigga (Huh)\nThe feds in a young niggas phone (Phone)\nThese bitches won't leave me alone ('Lone)\nI think that she gone off Patrone\nShe gone off Patrone (Patrone)\nWhat the fuck goin' on? (On)\nLet me get back inside my zone (My zone)\nAnd tell that bitch stop callin' my phone, yeah, my cellular\nShe eat the dick up like a pizone, when she eat it up (Ooh-oh)\nGo and suck it slow, I don't want that bitch no mo'\nGivenchy drippin' all over her sneakers (Huh)\nGot molly and we whip it out the beaker (Out the beaker)\nThat's Melly jammin' through yo' fuckin' speakers (Yeah it is)\nMy bitch gon' set it out, no Queen Latifah (Yeah)\nI'm smokin' now, I'm smokin' on that reefer (That loud)\nYou got it good, but I get the pound for cheaper (Okay)\nWe bust it down, we break the shit and then crumble it (Brumble it)\nThese niggas fallin', yeah, they crumblin'\n\n[Chorus]\nThey trappin', cappin', super dabbin', bandin' out on Gucci jackets\nQuater-pounder, gun to pack, I stretched that shit like it's elastic\nBoy, you fake, I know you plastic, molly got her flabbergasted\nPull up with them .223 Russian AK's and automatics", "title": "Gucci Jacket"}]}