{"artist": "Casey Veggies", "songs": [{"title": "Everything Wavy", "album": "Life Changes ", "year": "2013-06-25", "image": "https://images.genius.com/7676a7a556d8afeb36851a1fc1b85a3e.500x500x1.jpg", "lyrics": "[Intro]\nPulled up stuntin' man, everything wavy\nWhip half a hunnid, jeans cost $580\nI can tell she want it, cause she actin' so complacent\nYou can say I'm wrong, well I guess the boy crazy\n\n[Verse 1]\nRunnin', runnin', runnin', man that's all a nigga sayin'\nHunnids, hunnids, hunnids, man that's all I'm really paid in\nLifestyle flows, yeah that's all I'm really sprayin'\nShe called me on the weekend and we head straight to the deep end\nWe been, ballin' so hard from the mornin' to the evenin'\nAnd I make her do the cleanin', then I make that girl sleep in\nTurn me up, one time. I ain't got no punchlines\nLil mama so fine, so I had to give her that punchline\nLike wait, hol' up. All I do is show up\nShe sweet like some fruit roll ups, so all I do is go up\nLike wait, hol' up. They let the boy get his dough up\nMy girl watched me grow up, right before her eyes I blow up\nThey came thru makin' that noise, like that boy went in for sure\nGettin' money on tour, I might bring back velour\nSuicide my doors. I'm flyin' out, you tryin' out\nGot diamonds and designer, but come find out what my mind 'bout\n\n[Hook]\nPulled up stuntin' man, everything wavy\nWhip half a hunnid, jeans cost $580\nGirls in the crowd, and they all screamin' \"Casey!\"\nYou know you my baby, you knew I would make it\n\n[Verse 2]\nIt amazes, like where the days went\nIn amazment. I'm chasin', stupid commas\nIt ain't no stoppin' us. Period\nShe so furious, cause I dropped her\nI'm in this ho, get some mo' though\nMo' niggas is watchin, I got this\nYou get knocked off, wit' the lights out\nAnd the top off. On the block wit' Rottweilers\nThat boy so cold, but I'm not soft\nI'm poppin' now, she used to play me off so I knocked her down\nAll the way to the ground, and after that she ain't make a sound\nLike wait, hol' up. Tell somebody to roll up\nI from killer Cali where, all we do is grow up\nLike wait, hol' up. Baby girl come over\nAll we do is get older, so let's get it in for it's over\nWhen I swerve up, she get piped down\nI get paid off of my lifestyle\nAll the real niggas say, \"Ayee!\", all the bad girls say, \"Oww!\"\nEveryday is payday, and every night I get wiped down\nEverything been crazy and I pulled up and it's wavy\n\n[Hook]"}]}