{"songs": [{"year": "2004-10-19", "image": "https://images.genius.com/d6fd033db31db720da7b9183bf57cc98.591x591x1.jpg", "title": "Stick Ya Hands Up", "album": "Colton Grundy: Tha Undying", "lyrics": "(Chorus)\nLife in the city, is out of control\n(Stick ya hands up, Stick ya hands up)\nLife in the city, is out of control\n(Stick ya hands up, Stick ya hands up)\n\n(Blaze)\nI catch'em while they sleeping, always on point\nNever fall off\nKnown as a black hearse, who came to haul your ass off\nAll your talking, need to stop\nBefore I get stupid, and then let the motherf**kin' gat pop\nI got a rumor for you bitches, at the core\nI strangle seven hoes, and I'm looking for a couple more\nSo if you get in my way, we got beef, and I'ma gut you like a fish, with my razor sharp teeth\nI'm a pit-bull without a muzzle, held down by the Psychopathic family (Family!)\nCheckmate motherf**ker, this is Colton\nTurn your body into dust where you standing\nDarkness is my weapon, and caution is advised\nI'll spit some shit\nAnd draw the blood clear up out your eyes\nGo on and stick your hands up, and empty your pockets\nI'm leaving with our money, your rings, and your momma's life\n\n(Chorus)\nStick yo' hands up, this is a robbery\nStick yo' hands up, come up out your jewels and your money\nStick yo' hands up, you know that you done f**ked up 'cause!\nStick yo' hands up, now you in the presence of a thug\nLife in the city, is out of control\nWhat you gonna do? Where you gonna go? How you gonna live?\nBloody bullet holes, should have stayed safe, in with yo' shit, and laid low\n\n(Anybody Killa)\nRaise'em up, let me see the blood rush\nWe only coming for the good shit, so give it up\nLife's a obstacle, and the object is\nTo get with it or just get dealt with\nSo put them bitches sky-high, you think they care if you die\nF**k that tear in your eye (man why you crying)\nI ain't playing, do you see my homie smiling?\nMan, let me see the watch\nIs this gold? Are these diamonds? (Cha-Ching)\nDawg, give me all your shit (Give it up)\nAnd all rest of you, better sew them lips\nActing like I'm playing a game\nWho wants to be the first victim, to reveal they brain\nI suggest you keep them up, you heard what my homie said, bitch check nuts\nStick'em up, keep'em up, don't move\nCause you f**king with some killers for real (ooh)\n\n(Chorus)\nStick yo' hands up, this is a robbery\nStick yo' hands up, come up out your jewels and your money\nStick yo' hands up, you know that you done f**ked up 'cause!\nStick yo' hands up, now you in the presence of a thug\nLife in the city, is out of control\nWhat you gonna do? Where you gonna go? How you gonna live?\nBloody bullet holes, should have stayed safe, in with yo' shit, and laid low\n\n(Blaze)\nPut your hands up, this is a motherf**king stick-up\nDon't nobody move, or they gonna get they throat cut\nI'm low on fetty, and I got to get paid\nI want it all, so go on, and empty the safe\nMy homies in the lobby, hand on the 4-5\nDon't even think about running, you move and you die\nWanna test me, no vest can protect thee\nAm I lying ABK?\n\n(Anybody Killa)\nMan, I suggest we let them see\nPut your backs to the wall, keep your hands where I can see'em (see'em)\nYou messed around and got caught up, best believe it (yep)\nBack again, drive-bys, gunshot wounds\nAnd if you ever doubt it, than you doomed\nDeath by us, cooperate\nSmartness is the key factor, to give your life a whole new chapter (real)\nMister tough guys don't live long, cause I'm down to take them out with the chrome\nYou know what I mean?\n\n(Chorus)\nStick yo' hands up, this is a robbery\nStick yo' hands up, come up out your jewels and your money\nStick yo' hands up, you know that you done f**ked up 'cause!\nStick yo' hands up, now you in the presence of a thug\nLife in the city, is out of control\nWhat you gonna do? Where you gonna go? How you gonna live?\nBloody bullet holes, should have stayed safe, in with yo' shit, and laid low"}], "artist": "Blaze Ya Dead Homie"}