{"songs": [{"year": "2017-01-12", "title": "Saba’s Sway Freestyle", "image": "https://images.genius.com/dd759534bdde8c343fa3e704f2100eef.1000x1000x1.jpg", "lyrics": "[Prod. by Cam O'bi]\n\n[Intro:]\nOh, oh ok we got some Cam O'bi, we got some Vic, alright I can do this, I can do this\n\n[Verse: Saba]\n\nAnd if I die today, my phone will stop ringin'\nLike halloween or it's hell how I got demons, they\nFakin' a fight it is not real, John Cena\nTell em' I'm the man, little did they know, Vow Venus\nRap meanest demeanor, fuck a page up my penis [?]\nPicture from pluto, I'm on future shit that you chose\nKudos you kudos, you little dogs I'm a bigger part\nI'm not unanimously called the best but I'm not bitter dog\nJust better than every single little bit of y'all\nFilled of frost, on that Wendy's city shit\nDropping classics on some Pac & Biggie Shit\nAnd my pocket big [?]\nLike Ash Wednesday, rap is in a basement still\nCadence that kill, savin' a lil', for\nStudio time, my shit sounded like the majors with deals\nOn high school, on itunes comparing my shit like yo\nThis who y'all like dude?\nName: N.A. Badu\nWith the fam like Caillou, listenin' to Badu\nKilla Cam and [?], watching T-Mac vs. Ivu\nYo, Poetry in motion how my haiku's movin'\nFan base universal not just high school students\nFuck a targeting audience, everybody nod to this shit\nAnd I'm callin' it quits\nIf they tell me that my message lacks enough direction\nI'm the voice of the city that's the fuckin' vessel\nAnd y'all ain't bleedin enough to be competing' with us\nSo who better than me could literally be the leader\nI'm Peter Petrelli, a hero\nGood in the hood like Pelli Pelli, I'm ready to rock\nLike Redman fran, drop shit like confetti\nDrop bodies they deadly\nGo with the flow like Levy, Levi ready, rockin' steady\nHush little baby don't you cry\nLook, huh\nMockingbird, y'all gon' learn\nOn, top of my game, that's a surfer\nM, Like clockstoppers I'm about to, go\nUh,I skipped college no honor, roll\nM, that dream changed now I'm on a, roll\nLike arts and crafts, I'ma make it, that's on my, soul\nLike poltergeist I stick out I'm a porcupine\nI'm about to be problematic for any rapper that's trying\nTo get money this year and the following\nHuh, standing on my own ground like I'm carpeting\nCar full of 5 and that's followed by 4\nUh, Travelin'? Nah, nigga D. Pivot Swole\nSend in guard, send in coal\nIn denial up in the pose I been denied  in the post\nI probably get struck or stuck, in the dough\nThat tennis, tennis I been in venice, I been invented\n08' event that sonically make sense, until I'm senseless\nThat's doing numbers I'm all about business all my niggas\nAbout to eat, devour beat like this shit so delicious!\nDoctor Lipschitz, since a rugrat, on the move like hubcap\nWhen they ask: Where yo buzz at?\nI done came a long way and out a long town\nUh, I been on the waiting list the long line\nUh, steady stayin' patient I know it's alright\nCause we on top we timeless in no time\nUh, hahaha", "album": null}], "artist": "Saba"}