{"songs": [{"year": "2018-04-18", "album": "KB4*", "image": "https://images.genius.com/dac5ecc0f06bec5faa34f36f66d9dbed.1000x1000x1.jpg", "title": "No Chains", "lyrics": "[Intro]\nAye, aye\nA-K, Ok, Ok, Ok, Ok\n(A-K, Ok, Ok, Ok, Ok)\n\n[Pre-Chorus]\nI was running with the set (Yeah)\nRunning with the set (Yeah)\nWe don't never flex, we just rep\nHear me, no, what did you expect? (What did you expect?)\nI don't need respect\nI'm the threat (Ah)\n\n[Chorus]\nTell em I'm so free I got no chains on me\nI'm so free I got no chains homie\nNappy hair, nappy hair, no shame, homie\nI'm so free I got no chains on me\nI'm so free I got no chains on me\nI'm so free I got no chains on me\nI'm so free I got no chains homie\nI'm so free I got\n\n[Verse 1]\nRunning through the, aye\nRight back where I started with it (Aye)\nI've been on since college with it (Aye)\nThey hit the club, I hit religion (Aye)\nJesus, Jesus I'll admit it (Aye)\nI just give 'em livin' raps (Aye)\nYou just give 'em Insta snaps (Aye)\nDo we need another post? (Aye)\nYou insecure, you do the most\nMy side we revive God through the WiFi\nT'Challa partner, never colonize 'round of high-fives for the top guys\nMade us dangerous\nAim to bust, flame to dust, every idol bring to us, gangs of us\nTrained to trust, the name that's blood stained on us, Christ gained us\n\n[Pre-Chorus]\nI was running with the set yeah\nI was running through with chains yeah\nWe don't flex, we invest hear me, yeah\nThis is what you get, yeah\nI don't need respect\nI'm the threat\n\n[Chorus]\nTell em I'm so free I got no chains homie\nI'm so free I got no chains on me\nNappy hair, nappy hair, no shame, homie\nI'm so free I got no chains on me\nI'm so free I got no chains\nLook at my neck\nNo chains, no shame, rapper\n\n[Verse 2]\nYeah come get your opinion, it don't matter\nMoney or the faith, I chose the latter\nOhh, I can see them trying to keep us on the outside now\nWe pull up and watch you scatter, yeah\nRunning through the woo (Aye)\nHeaven got a playlist\nI promise that's my favorite placement (Woo)\nFaithful over famous\nYeah faithful over famous\nNew rappers that's sure to blow are really drug addicts with a studio\nYou gotta pop pills on the usual then that paradise ain't really coolio\nIf your world is really that flame then why you always high, tryna to escape?\nGram flexin' that's too fake and them money phones really money loans\nAnd that real life is you coming home, empty house and a heart of stone\nBad chick super savage but for a bigger bag she movin' on\nOh yeah you making moves but these folks don't really love you\nIndustry only love dudes that they can use, don't get confused\nInterviews that don't tip toe\nGo on take down my info\nHis glory that's simple\nRiding around with that tempo\nThat's liberal that's conservative, that's charismatic and reformed too\nMy wife happy and Jesus love me ain't nothing left to conform to\nHaha (No chains on me, I got no chains on me)\n\n[Pre-Chorus]\nI was running with the set (Yeah)\nRunning with the set (Yeah)\nWe don't never flex, we just rep\nHear me, no, what did you expect? (What did you expect?)\nI don't need respect\nI'm the threat (Ah)\n\n[Chorus]\nTell em I'm so free I got no chains on me\nI'm so free I got no chains homie\nNappy hair, nappy hair, no shame, homie\nI'm so free I got no chains on me"}], "artist": "KB"}