{"songs": [{"year": "2005-01-01", "title": "Real Niggaz", "image": "https://images.genius.com/9817f1884f3ccbc4ed6fd77a8d9049eb.300x300x1.jpg", "lyrics": "[Verse 1: 1st MC of Coalition9]\nEverything that glitters ain’t gold\nYou can’t discredit the flow, so now live by the code\nNonchalantly, the cypher the spirit, my poetry’s vivid\nFall back like my ways ain’t rigid\nCatch a charge in a New York minute\nWe set trip like I’m losing my pivot\nAnd twist blunts like the case was acquitted\nCatch a visit if you calling me out\nShit, I’mma show you what my crew is about for running your mouth\nI’mma send goons to run in your house without second-guessing\nThe pump’s my protection, my investment\nWelcome to BK, the borough where the beef stays\nIt’s replays of pigs popped in the PJs\nI think fast in this self-[?]\nWhile [?] the booth, I shatter the mic like glass\nHarassed by cops—a chip off the block\nI’ll put Fury and Ox next to RZA and Pac\nShit, I’m the rap Martha Stewart of stocks\nNow watch me toss your demo off the roof just to hear it drop\n\n[Verse 2: Saigon]\nLook, don’t get it fucked up—I ain’t in it to entertain\nAin’t in it for the fame, ain’t in it to get a name\nI am what many consider a spitter of flames\nWhat niggas done did to the game, the shit is a shame\nEverybody’s shit is the same\nNinety-nine-point-ninety-nine percent of niggas lyrics is lame\nWhen I spit, the room temperature change\nYou would swear I inherited 2Pac’s soul and both Christopher’s brains\nMind state of La Rock, wittiness of [?]\nSpirit of the sidewalk, grittiness of the block\nYou wanna play gorilla?  For what?\nDrama with Saigon, shit’ll get uglier than Jabba the Hut\nI catch you with a ill uppercut\nThen watch your nose bleed enough blood for you to fill up a cup\nYou don’t want the 9 milla erupt\nJump out the back of a truck like “What up?!?”\nCommit to clapping you up, bitch\n\n[Verse 3: 2nd MC of Coalition9]\nPunk veteran severing heads—no new rookies\nBlaze penetrate you quick like loose pussy\nI rap with the attitude of a school bully\nStrapped with two fully automatics at necks\nI cut your life shorter than an asthmatic’s breath\nMasochist past step with traffic get clapped next\nHandle my past steps, back smack you\nSnap, strangle your man’s neck.  It’s cold like clan setups\nMendoza bring static like broken Nintendos\nI strip tracks naked like Nino Brown’s chemist\nThen I inspect the premises like a dentist\nPlace metal in your mouth, get the shovel from the house\nThen bury you next to this rap game that I’m out\nClap flame at your brain, leave you laying on the couch\n\n[Verse 4: 3rd MC of Coalition9]\nSeem like rap’s a quick meal—catch a case, hit a deal\nHustlers switch they field when fake became real\nCats’ll do anything to sell—clap themselves\nOr try to hit the cover of the Doub’-XL\nIt’s too gimmicky.  Read a book, advance lyrically\nYou must be kidding me.  You ain’t a crook—you too jittery\nGlorifying correctional facilities but\nThe closest you’ve been to a cell was a episode of O-z\nOunce, pound, no gram never touched your hand\nDamn, you got more issues than news stands\nIncriminating lines with feminine vibes\nOnly crimes you know about was written down in your rhymes\nOnly catch a charge on the courts, balling\nOnly lick shots when you on the courts, balling\nI bang with those that move with authority, street seniority\nNot them clowns that need to pledge into a sorority", "album": "Abandoned Tracks Vol. 2"}], "artist": "Saigon"}