{"songs": [{"title": "Immortalized", "album": "Immortalized", "year": null, "lyrics": "[Phone conversation for 25 seconds]\n\n[Bart]\nWe on a paper chase!\nI see it all through my third eye\nYou played it fast so we ??? push it worldwide\nIt's juss a mental suicide, Kamakazie\nGot the plug on this game, so we on the plane Friday\nFinally, its a motherfuckin hit\nClicks fists of four-fifths, Steady Mobb in this bitch\nI see his eyes wide, his wig split up\nOn some murderous an half of his mutha\nFuckin clan was on some other shit scramblin\nThem bullets through his skin tissue\nIt's America's host\nYou knew the game never fit you\nIt's all official\nHis last breath was on his line front\nImmortalized, his time has come\n\n[Hook 2X: Bart]\nImmortalized!\nBlood shot red my eyes\nWhen the gun shots spread the skies it ain't no where to hide\nI swear to God, a credit card can't account for the hate\nBoy it's too late, theres no escape we already plannin ya wake\n\n[Keek Da Sneak]\nUh, break me down\nRoll me up an hit it\nDon't shake me now\nTake another hit, I want you to feel it\nThis the realest\nThis is what you'll be hearin through the backstreets, starrin\nHit the baron\nBut dont forget, always check ya side views, an ya rear-end\nNiggas fearin, for the fact that you havin paper, an you dealin\nRidin fetti, an a couple of hatas gon catch you when you ain't ready\nLike Redman, take it ??? ??? from the back\nTo the head from lettin it seen ???\nCasket bed me\nBut instead me, I'mma live through it all\nI spit an fall\nI've been feelin like that since 2 Raw\nLike Above The Law\nI was off that V-S\nBitin titties through the bra\nAn nigga we juss\nGet a kick outta breakin the law\nAn then dig this\nCuttie that be breakin me off\nAn I need this\nSo I'm tryin to snatch it all\nIts scratch an fall\nI'd rather stay on top an ball\nSo my family is set when death calls\n\n[Hook]\n\n[Ridah of Mob Figaz]\nNow what they thought?\nThat I'd give up an get caught\nAfter I\nGrab the nine an headed straight for the vault\nWhen there ain't never been a battle that I fought an lost\nWit out my... opponnent bein traced out in chalk\nBut I still ain't satisfied\nSo peep the rapid-fire\nThis'll be the day I die, fuck rappin, I'll retire\nNegotiators said he'll provide, the paper I desire\nBut he's a liar\nAn I'm tired of bein lied too\nSo we die too, when I ride through\nBustin in wit the hostages\nKillin me, the guilt in me, fuck the cops an shit\nSpectators see the caper, holla \"Stop this kid!\"\nBut its too late\nI fear no fate, plus shootin straight\nAn its funny\nCuz all I ever wanted was some money\nAn someone to suck me like they had no teeth\nNow all of a sudden these motherfuckers wanna know me\nCall me down, sayin \"Ridah let the hostages free!\"\nBut I'm on some, fuck the world shit, an I don't know\nI guess I'm stressed off the bullshit\n\n[Fed-X of the Mob Figaz]\nI've done adapted to this environment\nNow they can't stop me\nA Mob Figga\nMilitary tactics menace to society\nOne of the chosen five\nThat lead immortal lives\nSnatchin' all the product\nBreakin' every bone in the closet\nI'm out to get the data\nThe top secret information got me took\nI'm bendin' every law in the book\nI fled the scene with two nines in the sky\nSereal number scraped with no trace\nAnd known to race\nTo get this pace\nImported weapons\nArmy fatigues and body vests\nI'm restin', for armageddon, with the illuminati\nTales of Demias, Twentieth century, raised right\nIt's third war!!\nBusted hinges and broken doors\nInterrogation and infiltration on the five\nImmortalized!\n\n[Hook]\n\nNigga!\n\nYou know what I'm sayin?\nWe've known to hustle since the beginning of civilization\nUntil this motherfucker\nYou know what I'm sayin.... burn out\nThat's all it's gon be\nWe ain't did nothin but breed in this shit\nYou know what I'm sayin\nYoung niggas... you know what I'm sayin... all of us\nYou know what I'm sayin\nAll of us\nGet ya money, watch them lights\nKnock on you, knock on me\nFuck it, you know what I'm sayin, til it's over wit\nThug it out til the end of civilization\nYou know what I'm sayin?\nAgainst all odds\nUntil we die, ride until we die\nMobbin it out, Money Ova Bitches\nMoney ova all that shit\nFirst priority, it's over all of it\nNiggas ain't goin no where, we in this motherfucker\nUntil this motherfucker\nGo, until this motherfucker burn out!\nFUCK IT!! {*echoes out*}", "image": "https://images.genius.com/2417c02a0230db056bb96cdac58d5dd6.400x384x1.png"}], "artist": "3X Krazy"}