{"artist": "PARTYNEXTDOOR", "songs": [{"album": "Jahron B. Collection", "title": "Faithful", "image": "https://images.genius.com/0c676afb30da9299aba65de0f4ea40c2.600x600x1.png", "lyrics": "[Intro]\n\"What can I say, I have one though. I only have one. Get that on camera, I only have one. Christain Moat, love you.\"\n\n[Hook]\nYou ain't gotta worry\nWhat I've been doin' lately\nCause your my baby\nOnly baby\nYou know I stay faithful\nAnd Im'a always stay faithful\nListen here baby\nYou ain't gotta trip\nGirl I respect you're my lady\nMy one honey dip\nSo for that Im'a stay faithful\nGirl Im'a always stay faithful\nFaithful to your love\n\n[Verse 1]\nShe want a baller\nI just want a queen\nShe want to plot\nI just live in feen\nNever thought I see the day that we would change\nShe said I love you\nI said I need space\nFabricating stories about you and him\nIs this something that we really gotta do again\nKeep your rabbit in the hat\nNo tricks needed\nI got this sick feelin' no vicks needed\nAim right but I'm mistreated\nMisleaded that just make me\nMiss be\"levein\" that this just happen this evening\nI was doin' me to get us everything\nBut now I'm taking everything\nDistrust will get you dismiss\nThis isn't an argument just couple thoughts brought to consciousnesses\nI can't stand what I'm livin' in\nTo think that I'm would be singin' this\n\n[Hook]\n\n[Verse 2]\nI know I know\nYour tried of me disguising love\nSo I gotta let you know\nI don't wanna let you go girl\nCause I'm in love\nBut you know you know I'm tired of just tryin' love\nWith a little bit of us and\nA whole lot of god it's a different kind of love\nI'm glad you decide to love me though I'm out on the rode\nPreformin' what I'm recordin' doin' thousands of shows\nSo you ain't got ask can we afford it\nYou already know\nIf you want it girl then it's important you already know\nNo limits pastor p I got the hook-up ask for me\nYou got me shock up so look love anything you want you can have for free\nWe know we know we wanna stay faithful\nHe hoes she knows it's hard to stay faithful\nI'm in it to win it\nGirl I finished before you started\nJust like the ring we became a thing before you thought it\nYou ain't gotta worry or never be broken hearted\nKnow I love you forever it's whatever you know you got it\nI love you girl stay faithful\n\n[Hook]", "year": null}]}