{"artist": "Indo G", "songs": [{"title": "Chillin’ Like A Villain", "lyrics": "[Sample]\n\"You better not try and change it, oooooh\"\n\n[Verse: Lil' Blunt]\nHere's something for the brothers that can flow\nAnd go where the P.O.L.I.C.E. don't grow\nA place where the brother C.L.V. is smoking chicken\nBut when they smoking that chicken then their nines start to clicking\nSo yo withstand from the drama yo here's something for yo' mama\nCan't tell you what to do or not do, do what you wanna\nDon't worry about creeping just chiefing on a half\nThe only time a brother shuts up thinking, won't care\nThis type of chilling mode will make a person wonder\nIf this was an everyday thing a lot of people wouldn't be under\nSo I'm legit, keep myself from having fits\nStay calm, feeling numb with a fat philly blunt lit\nNow I'm feeling straight, falling back\nBottom's up, smoke a sack\nConjac is on the deck\nIn my lap's a twelve pack\nNow you tell Blunt how he living\nDon't have a worry in the world\nI'm chilling like a villain\n\n[Verse Two: Indo G]\nYeah I just keep on kicking lyrics from the one into the two\nClocking, jocking make them duckets, not just me but the whole crew\nSo just sit back and relax and let the rhythm cold take over\nMoving and grooving the party people, taking 'em to a higher level\nYo try to C.L.V. take it from me boy I'm gon' tell ya\nYou ask me what it is, just shut the fuck up I'ma tell ya\nTo see if you don't know you must be smoking, 'C' standings for 'Chilling'\nThe L it stands for 'Like A' and the 'V' it stands for 'Villain'\nThere ya have it I'm chilling like a villain, don't try to take the broken beat\nThe first one to jump up the first one to catch a clip in ya butt bro\nI'm doing the kind of music girlies love to freak to\nBringing the bass and kicking it with the brothers in my crew\nMaking the tape but bullets will break a sucker [?]\nStabbing and capping, flipping and flapping, yep I shut your lip up\nIf you're chilling, where you go? The liquor sto'? Texaco?\nGet a 40 or a six pack that's the only way to G.O\nP me up I like [?] hot\nCulture got the [?] liquor\nGive me a brew, ya ask for four big girls cause I'm all for down with chilling\nWhen I down a fourth I know it makes me wanna chill\nMy other brothers drank it and it makes them wanna kill\nHey man that ain't the subject for right now cause I'm top billing\nI won't give up, no not tonight cause I'm just chilling\nI'm chilling like a villain\n\n[Hook]\nChilling like we chilling so you chilling like a villain\nYou chilling like I'm chilling so you're chilling like a villain\nYa ya\nWe chilling, so ya ___ a villain\nYou chilling like I'm chilling so you're chilling like a villain\nYou chilling like we chilling so you're chilling like a villain\nYou chilling like I'm chilling so you're chilling like a villain\nYou chilling like we chilling so you're chilling like a villain\nYou chilling like I'm chilling so you're chilling like a villain\nYou chilling like we chilling so you're chilling like a villain", "image": "https://images.genius.com/8a35b53d46ce35344ebaa0666bcb53f7.489x489x1.jpg", "album": "The Antidote", "year": "1994-01-01"}]}