{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/b59b51bf880fd8415e9f016385674205.400x399x1.jpg", "year": "2005-01-01", "album": "Piss’n In a  Barrel of Bee’z", "lyrics": "[Hook]\nSee I might go to jail, but I will make bail\nIf I don't make bail then I'll see your ass in jail\nThe cops might catch me, but if they do, fuck 'em\nCause dude'll call me out and I'll be damned if I don't touch him\n\n[Verse 1]\nSee that dude? He's ready, huh?\nFace lookin' like he got hit with the funk\nYou smell shit and can't spot it?\nThat's a habit hard to break 'til you run into a dropkick\nFrom the balcony like Chuck Norris\nIn a pair of Timbos and the king sits in the forest\nWolf, you just threw away your Rolex, you're wasting time\nCereal box MC's, keep wasting lines\nYour cornballs get popped, your captains get crunched\nYou might be frosted but you a Mini-Wheat, punk\nI'm bails of haystack, a whiteboy that'll hit the pump\nYou grab a AK, I'll drive a tank out the trunk\nBe humble, the written word is upon to you\nEarthquake the L Train shakes and the rubble pumbles you\nSome folks were born to rap, I was born to utter truth\nThou art with me, and your art stoop\n\n[Hook]\nSee I might go to jail, but I will make bail\nIf I don't make bail then I'll see your ass in jail\nThe cops might catch me, but if they do, fuck 'em\nCause dude'll call me out and I'll be damned if I don't touch him\n\n[Verse 2]\nRush 'em, leave 'em out like a bad pet\nTake his money like Las Vegas in debt, that was a bad bet\nWho told you to do that, damn it? Who?\nWhen you get up, go right back to him, and tell him to come over here too\nI'm a clique rusher, havin' sex with the flu, a sick fucker\nWith the winds with no chapstick, a lip buster\nWhere're your 24's now, SupaRich?\nUp under my sister's double-wide trailer just for kicks\nI took the bricks, put 'em under the axle of your new shit\nNow you got a Flintstone's Crown Vic\nPut me in cement shoes and throw me in the lake\nTie my hands behind my back, duct tape my face\nThat wouldn't kill Yela Copperfield, I'm David Wayne\nI got tricks up my sleeve like I got hoes, trackin' over lane\nDon't get hit with the stiff arm, Cadillac is runnin'\nPut wannabe-gangsters on my grill like burgers on a Foreman\n\n[Hook]\nSee I might go to jail, but I will make bail\nIf I don't make bail then I'll see your ass in jail\nThe cops might catch me, but if they do, fuck 'em\nCause dude'll call me out and I'll be damned if I don't touch him", "title": "Go to Jail"}]}