{"songs": [{"lyrics": "[Verse 1: Aesop Rock]\nBefore shooting troops was cooler than hula hoops\nHigh noon was your basic who's who of brutal truth\nHot summer gun or box-cutter slow dance\nTurn a young'n to a dozen paper dolls holding hands\nAnd tricky was a wooden horse pushed up on your porch\nSo chicanery was yours to engage or ignore\nI was on the latter, but a lot adopt pawns\nSo we carried lawn chairs and buckets of popcorn\n(Pass the popcorn) Brawl fair, cop car\nVoyeur hawk him out his hinges, storm door splinters\nClamoring about, hammers out about to ring\nInfiltrate each others tribes and murder each others queens\nPacked to the very last rafter\nClung to the rafts and the cameras to capture the damage\nNeck swivel with a chop chop volley\nWhere the ants leave nothing, but the bones and the car keys\nPardon if his two feet fester, it was rude of me people, meet left and lefter\nPlanted like a model of civility and honor for the sector\nBut never got his extra extra\nPeace for the better but it wasn't entertaining\nSo they waited for the tazing from the safety of his haven\nLike bees to the honey when they lumped you up\nCause bumper cars are only funny when they bump\nKnow that...\n\n[Bridge]\nHot summer gun or box-cutter slow dance- popcorn, popcorn...\nHot summer gun or box-cutter slow dance- capture the damage\n\n(Yo, this dude talks real slow yo... Crazy\nYeah man that's my boy Steve; he just talks like that, it's weird\nThat is weird.)\n\n[Verse 2: El-P]\nTune to \"Hellemundo\" for action packed blasphemy\nBig city translate your face til it atrophy\nI let the schadenfreude boy out actually\nDeployed to void with grin to watch laughingly\n(Yeah bitch) Pass the P's it's a laugh in\nI can smell the tragedy when hatchin'\nHappily dispassionately patched in\nAlive with the menace of demise\nLike, \"Yes!\" the pain dazzles men, pass the popcorn\n(Pass the popcorn) It's reality at it's fastest\nAnd yet it still unravels at a pace like molasses\nI guess the last of the seconds before the worst of disasters stretch past us\nWouldn't you agree that it is fabulous?\nIn the corridors of entropous wars contort drastically tilted fits\nI adjust to climates of the wilderness\nWalk along my spine take the pilgrimage\nUp in to the section that's reserved for the smirk of the coldest witnesses\nWork you motherfuckers (hooray!), there's all day to die\nInnovate the mayhem with grace\nThe good-form-fall, fuck if I'mma warn y'all, nah\nI got the front row to the greatest entertainment that an angel never saw\nSixty thousand watts of that raw\n\"Pull the claw out of the trunk\" fun, each one teach one how to club one\nLook at how they bathe up in the dove blood\nIt's gonna be a night of thrills and chills where the sacred is made of mud mud...\n\n[Bridge]\nEach one teach one how to club one- popcorn, popcorn...\nEach one teach one how to club one- popcorn... wouldn't you agree that it is fabulous?\n\n(Yo honestly, if your man Steve really talks like that... uh, that's not really normal...\nYeah, that sucks... Yeah, it's pretty bad...\nNobody's voice should sound like that.)\n\n[Verse 3: Aesop Rock]\nIt was a lazy day, it was amazing grace\nIt was a half-a-dozen claymores daisy-chained\nIt wasn't daisies and crazy\nEights, it was an ace of spades over a waiting game of slaves\nAnd saints, and every trainee face-painted while his great\nEscape grazed and ate\nHe'll never make it, when he aims he shakes\nAnd I was overly engrossed from a very locked door\nWith a couple milk duds and buckets of popcorn\n(Pass the popcorn) Clap clap, encore, monkey in the middle study\nHow the bunker took the missiles, age of machines with nary a green\nScreen, so the hecatomb is every bit as cutty as it seems\nI could tell the pet from the vet, money where his canine's spread\nAnd never welched on a bet, that said, know the over-under\nOn your local hunter and you'll profit off his widow-maker's\nNumbers every summer, bump in the night, funny, will he catch and release 'em?\nHas he mercy, will he hack 'em to pieces?\nIs he dirty, will he hassle policeman and security breach until impurities leak over the circuitry?\nAnd nada milk and honey there is only skulls and bunnies\nThat hop around drunk in the land of a hundred Mondays\nGod damn, pop the Redenbacher proper and\nFor Christ's sake get this man a doctor!", "title": "Gun For the Whole Family", "album": "None Shall Pass", "image": "https://images.genius.com/3d6c4d11084714cc67f880d71310d197.288x288x1.jpg", "year": "2007-08-28"}], "artist": "Aesop Rock"}