{"songs": [{"image": "https://images.genius.com/555558f78b2a5011a89eb0d74b1c479a.401x401x1.jpg", "lyrics": "[Intro]\nIt sounds like Nyge\n\n[Chorus]\nOpp bitch still wanna tek' this meat\nShe wants time and love from a t'ug but I'm too prestige\nStill get different types of IG freaks when I dump on beats\nThe 9 don't talk or chat, them boy debate with the YouTube neeks\nOn my block I'm the youngest t'ug, you can get man pitched for a violent speech\nI got a grown bad B tryna give man uck on the bed, turn around and jeet it\nLatinan bitch, she can arch her back on the beat and her face on fleek\nI should've been a local dentist, youngest one to supply them teeth\nHow can a man try to hop on me? I back my track, run back and let's see\n\n[Verse]\nWe was tryna raise that gauge in a opp boy's home, call it knock down ginger\nI dare man mention Shegz, we'll grip that 4 like my brody Sinner\nThis stoley ain't from ends, tell my young g, \"ride with the wap and chinger\"\nHow's man bad and you ain't been grabbed? Tell my opps I'm a silent driller\nMan been tryna step on road on a 125 and bruck down Vauxhall\nAnd I been tryna dab up a certain opp on the roads but there's nuttin in Vauxhall\nWe both know when the niners ride on the streets, make it beat like brothels\nLet me make it clear on the track, them boy ain't the truth, it's waffle\nStill had to buss that M in a year, I attempted to turn man fossil\nI'm knees deep in the beef, real deep, now my life ain't Gospel\nI'm knees deep in the beef, real deep, now my life ain't Gospel\nReal talk the beefs intense but I still gotta dig out my light skin model\nBack cheffs, straight heat on the opp, we don't shake and wobble\nMan get turned like the page of a novel\nHow many opps been G checked, turned on their clique and waffled?\nNumerous pricks been dipped, more time I keep this bottled\nBro-bro watch how I flex and buss me some Gucci goggles\n(It sounds like-)\n\n[Chorus]\nOpp bitch still wanna tek' this meat\nShe wants time and love from a t'ug but I'm too prestige\nStill get different types of IG freaks when I dump on beats\nThe 9 don't talk or chat, them boy debate with the YouTube neeks\nOn my block I'm the youngest t'ug, you can get man pitched for a violent speech\nI got a grown bad B tryna give man uck on the bed, turn around Latinan bitch, she can arch her back on the beat and her face on fleek\nI should've been a local dentist, youngest one to supply them teeth\nHow can a man try to hop on me? I back my track, run back and let's see\n\n[Outro]\nRun back and let's see\nOpp bitch still wanna tek' this meat\nRun back and let's see\nOpp bitch still wanna tek' this meat", "title": "MEAT", "year": "2019-04-18", "album": null}], "artist": "Unknown T"}