{"artist": "Wax", "songs": [{"year": null, "lyrics": "And I\nRun around girl\nI guess I mean business on this one y'all\nIt's not like I can just stop doing this shit\nI guess sometimes you just need a little help\nGet your bravery up, y'know what I'm saying?\nDrop that shit\n\n\n\n[Verse 1: Wax]\n\nI got a pen in my right hand\nBeer in my left and I have no fear of death\nYour ears are left with that spearmint fresh type of feelin'\nWax and EOM put your hands to the ceilin'\nGet 'em up, where the fuck I can see 'em\nWhile you bang this in your jeep\nOr your truck, or your BM\nI don't care what you drive\nE-lectric chair, we survive\nIt feels like I'm barely alive\nI've-\nGotta refill my prescription\nMusic and alcohol that's my addiction, listen\nMy diction defies descripition\nI ain't keepin' it real\nI keep it science-fiction\nMeet Zorg, I'm the \"Bionic man\"\nHit the chronic and slam like a high Onyx fan\nDut-dutter did I stutter, the flow's so gutter\nIt's attached to your roof collecting water\nMotherfucker!\nThis is grade A material\nUpscale Maryland, crab imperial\nIf I'm not lyrical the earth's not spherical\nAnd the virgin giving birth to God's son's\nNot a miracle\nThe way I bust is incredible\nWhile your shit just isn't credible\nAnd the nectar that drips from my nuts\nIs an edible source of protein\nEat it up with some vegetables\nYummy, a well balanced meal\nBy the look on your face I can tell how you feel\nWhen you listen to the music\nYou can tell how it's real\nYou can tell how we're able to sell without a deal\nYeah, I spit that cooked-up coke shit\nCan't find my rhyme book, Mayor Barry smoked it\nWe got the dope boys sellin' it\nBig Wax cookin' with my homeboy Elements\n\n[Interlude]\nSo raise your motherfuckin' glasses up\nEverybody, here-here, I'd like to propose a toast\nFirst of all I'd like to propose a toast to my man EOM for providing this musical backdrop on top which I do dumb shit, such as propose toasts\nI'd like to propose another toast to you, the listener\nIt doesn't matter how you got this shit, you bought it, you downloaded it, your grandma gave it to you\nIf you're listening to this dumb shit\nLastly I'd like to propose a toast to me, for being the motherfuckin' illest motherfucker alive!\n\n[Verse 2: Wax]\n\nI got these haters lookin' at me like \"how is he human?\"\nGetting all mad like Alfred E. Newman\nThey truly trippin', undoubtedly shroomin'\nA true emcee, the crowd'd keep movin'\nSo girls get down on the floor\nWe at a level nobody's ever gone before\nWe got, songs galore, and I'm on to more\nWe celebratin' like we're Jewish\nAnd it's Yom Kippur or\nRash Hashanah\nSpark lots of ganja\nPour lots of shots of vodka\n[unsure]\nRock the mic properly who I be\nA way fuckin' better than average emcees\nSo, Merry Christmas, here's my album\nI hope that you're all satisfied with the outcome\nAnd if this one fails I'm thinking that I\nWill move to Hawaii and drink 'till I die\n\n[Outro]\nI'm dead serious man\nI could move down there and uh, be a bartender\nI already like to drink\nI already know how to do half the shit\nI know how to get a beer\nI know how to make Rum & Coke\nIt ain't fuckin' rocket science\nI could take a class or two\nMove to a little bungalow somewhere\nGet a job in one of them bars on the pier\nWhere the fuckin', uh...\nLittle girls do the ukulele, the hula dances\nListen to that shit\nOh, I'll learn how to play the ukulele!\nI'm not to far away, I already play the guitar!\nI mean, it's not that fuckin' different\nDifferent amount of strings or whatever", "image": "https://images.genius.com/80a8f98d2de41e1d691e1395431f7e34.700x700x1.jpg", "album": "Liquid Courage", "title": "Liquid Courage"}]}