{"artist": "Will Smith", "songs": [{"year": "2005-05-29", "lyrics": "[Willow]\nDaddy can you tell me a story?\n\n[Will]\nOh you wanna hear a story? What kind of story you wanna hear baby?\n\n[Willow]\nA scary story\n\n[Verse 1]\nOh, ok\nOnce upon a time there was a kid who wanted nothin' more than to rhyme\nAlmost like he was born in the rhyme\nHe thought of his rhymes almost all of the time\nAnd he fought with his mom\nHis school getting caught with his rhyme book\nAnd he knew he shouldn't of took it there in the first place\nAt least he shouldn't of been sittin lookin there in her face with it\nTeacher told him get it out of her class\nWicked witch, trick told him that's probably why you won't pass\nNow if you shy you won't last but you're new\nSo underneath his breath before he left he said I'm a be richer then you\nWhat you say? She said\nWhat you mean? He said\nBoy don't you play, she said\nWhat you mean? He said. Damnit\nTen minutes later standin up in the principles office\nGetting handed the phone clammed up cause his father was talking\nAnd he was pissed he wasn't listening to his son\nYou testing me? You messin up again\nYou done boy\n\n[Hook]\nThis is just a story about a young man comin up in the rap game\nA real scary story\nWent from rags to riches it has goblins in it haters and witches. Uh\n\n[Repeat Hook]\n\n[Verse 2]\nFirst thing he did was find somebody to give him some money\nHe wasn't stupid but wasn't using his senses honey\nThe guy's he meant was a little shady, a little funny\nBut they gave him the money so they played the record company\nIt sounds silly but when he grew up in Philly rhymin wasn't what it is today\nDeals wasn't a dime a dozen\nToday every sister, uncle, or mom or cousin gotta record deal\nBut for real it wasn't like that then\nAs you could imagine when he started risin to fame and fortune he was\nHavin Started antagonizing the guy's he was with\nAt the same time he started realizing\nThe deal he got from them guys in his eyes didn't fly with size of his hits\nHe called a meeting to find a solution\nHe said I'm gettin beat out of my loot\nAnd I'm not recording no more until we find a solution\nThe dude's said we found a solution its this .44\nHe ran for the door a little shaken\nBut the next day he found a lawyer, told him the situation\nHe said I'm breakin this contract for ya\nHe said how much the lawyer said I'm a charge you a quarter cause I like you\nJust do me a favor\nGet your life in order\n\n[Hook]", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Scary Story"}]}