{"artist": "Wiley", "songs": [{"year": "2010-07-08", "lyrics": "1, 2, 3.. Let's go!\n\n[Verse 1 - Wiley]\n\nYo, the last time I told 'em I showed 'em\nRolled through the cold in an old black Corolla\nHolding a grudge against olders\nWe can go bar for bar, sober\nI ain't looking over shoulders\nI'm standing firm, no (??)\nNo bars allowed that are swag in a folder\nSay they're on another level but i'm having them over\n\n1, 2, 3.. Let's go!\n\n[Verse 2 - Ghetts]\n\nTwo against two\nCheck the outcome and it's done\nMan I swear Wil's gonna wanna do a next tune\nWhen I write and I spot man are doing excuse\nI'll be writing them off no comebacks due\nG-H I be the reason there's a heatwave\nSuntan\nIt's about to heat up like a gun cannon\n\n1, 2, 3.. Let's go!\n\n[Verse 3 - Shifty]\n\nThey wanna lyrical war so i'm on it\nThem man are shit homegrown, i'm chronic\nThem man are coming like tails, i'm Sonic\nThem man are bad bellyache, i'm vomit\nIn front of them there car boots and bonnet\nThey're not real at all, they're far from it\nYou ain't a gun man you wish you was on it\nYou hate 2pac like Christoper Wallace\n\n1, 2, 3.. Let's go!\n\n[Verse 4 - Devlin]\n\nDon't be mad at me, i'll put you into casualty\nQuicker than an MP snatches up their salary\nDevlin's in the gallery, rapidly savaging these savages happily\nCalmly and callously\nBreak down your strategy with pinpoint accuracy\nWhen I set you alight like a candles wick\nYou'll get burnt like a spliff or a calorie\nYour mind is adrift from reality\n\n1, 2, 3.. Let's go!\n\n[Verse 5 - Ghetts]\n\nWho's after? Better come harder\nI helped Wil' become faster\nSkippy with the flow that's nothing but talent, credibility\nI locked it like a governed prison facility\nAnd ever since all my activity\nMan are like G G G but I done a man similarly\nWork with the spirits I done spiritually\n\n1, 2, 3.. Let's go!\n\n[Verse 6 - Wiley]\n\nSilly choice, silly move, silly again\nSilly with him, you're silly with them\nWho's got lyrics, I ain't gotta tell them again\nIf I never had any of them, we'd be singing again\nWhen I'm not around man will start living again\nYou wanna live in a two, I wanna live in a ten\nGo and ask PPL fam I did it again\n\n1, 2, 3.. Let's go!\n\n[Verse 7 - Devlin]\n\nYeah lager and spliffs\nYou silly MC's sound dry like your mouth after you spit\nNow pass me a spliff, biro, a pen and a pad and let me show you what arsenic is\nI make the ravers shake like a Parkinsons fit\nI going on dark in this shit\nMC's wanna act up but their shoes just don't fit\nSo they can't take part in this script\n\n1, 2, 3.. Let's go!\n\n[Verse 8 - Shifty]\n\nI fry mic with hype, my mind's too frightening\nSo try bite I might decide to strike him\nI'm like Iron Mike my rights too frightening\nMy minds high like I've been trying the white shit\nBut I like the dust been writing at night shit\nI rise high like heights, this guy's too firing\nSo like bright lights this guys crew's shining\n\n1, 2, 3.. Let's go!\n\n[Verse 9 - Wiley]\n\nMagic, magic, magic effect\nPanic, panic, flow like a strally\nExcept I throw a little rap in there\nAnd if you want it I'll be catching up\nCan't see me yet like a present that needs wrapping up\nHad enough nar I've been killing lyrics\nWhen I'm in the yard chilling watching Madagascar\nI see starch like a pan of pasta\nI am a rasta\n\n1, 2, 3.. Let's go!\n\n[Verse 10 - Ghetts]\n\nHad it, had it, gave it to another MC\nI washed my whole style vanish\nCan't get it out cause it's not his flow\nGive him twenty goes and he still won't have it\nMC's get spun over see\nA number one ain't one over me\nI'm erratic to a cabbage\nI'm the best on the planet\nSo if niggas want beef then they'll see the matic\n\n1, 2, 3.. Let's go!\n\n[Verse 11 - Shifty]\n\nWait, i'm not one for fussing a fighting\nBut if it goes off I will but him and bite him\nHook him like Tyson, I will uppercut him and strike him\nTreat him like butter, knife him\nWho's on the floor I can look at him frightened\nFuck all this running and hiding\nCause every bodies doubting that Shifty's running this grime ting\nCome on firing\n\n1, 2, 3.. Let's go!\n\n[Verse 12 - Devlin]\n\nFucking deep like life in the Mayans\nLook into my mind and you're likely to find\nA microchip of the tiniest size, telling me to paralyse guys\nJust like Iron Mike in his prime\nBut you ain't got the IQ to even decipher my rhymes\nAnd now you're pushing your look\nLike sleeping with sluts and bussing inside them twice\n\n1, 2, 3.. Let's go!\n\n[Verse 13 - Wiley]\n\nBrain freeze got a trick up my sleeve\nBelieve the hype, if not if it's written in green\nI mean your G's deceased, couldn't flow with a team\nWe beamed on, R8T 40 g's\nPlease, 40 fees when I go on an earner\nAll 40 p's when I go on a burner\nWhite square with a red L cause you're a learner\nYou're talking top three when it don't concern ya\n\n1, 2, 3.. Let's go!\n\n[Verse 14 - Shifty]\n\nA few of them hate on the team that a rep\nThat could be seen as a threat\nThem man think their big dogs\nTil I put dogs down like I work on the machine in a vet\nDon't care if you think that your team is the best\nI'm a big bird don't dare put your beak in my nest\nI'm waiting\nAnd I created a bigger buzz than a million bees in a nest\n\n1, 2, 3.. Let's go!\n\n[Verse 15 - Ghetts]\n\nI liked it so I tried it\nAnd when I tried it I realised it was my thing\nNo accent but rhymes that I'm writing are inspiring\nAnd driving all the up and coming dons in this grime ting\nStarted with lightening back in '04\nWho said the top three don't concern me\nBut I dont think my mercy's 4th (?)\n\n1, 2, 3.. Let's go!\n\n[Verse 16 - Devlin]\n\nI'm a danger with a pen in my palm like Joe Pesci\nKeep your backs to the wall like a flat screen tele\nI'm actually thin but with lyrics i'm naturally heavy\nSo how many can match me not many\nI'm picking any adversary in a second what do you reckon\nCause i'm on the ball like Lionel Messi\nHave your clientele ready\nI'm hotter than the fucking Serengeti", "image": "https://images.genius.com/87a5545feb4357c6164f7d50261903cf.500x500x1.jpg", "album": "Zip Files 2", "title": "123 Go"}]}