{"songs": [{"image": "https://images.genius.com/cc60009fe3a8e9f4e0bf0ecb050bb51a.1000x1000x1.jpg", "title": "Unicorn Wizard", "album": "Strawberries and Cream", "year": "2012-09-24", "lyrics": "[Intro]\nSometimes I wish\nI was even more awesome\nThan I already am\nWhat would my life be like\nIf I turned that shit up to eleven\nOut of a possible five?\n\nNinja Brian, hand me my cloak\nAnd my staff, and my horn\nAnd that thermos of soup\nI'm hungry but also thirsty\nAnd you can kind of like eat and drink soup at the same time\nLet's go!\n\n[Verse 1]\nRiding straight out of your imagination\nUsing my magic to fight against crime\nDestroying evil with powers most awesome\nProtecting the weak almost all of the time\nBut not on Sundays, Game of Thrones is on\nNow is the time for a man of conviction\nThe world needs a hero, and I am that guy\n\n[Girl] Look! Who is that masked man?\n[Danny] That's Ninja Brian, but shut up about him\nLet's focus on me, because\n\n[Chorus]\nI am the Unicorn Wizard\nRiding for justice on a comet of stars\nWith the help of my sidekick Princess Handjob\nI'm more awesome and smarter than I already are\n\nI am the Unicorn Wizard\nMy spells are amazing, and my reflexes quick\nMy horn is my strength and my strength is my power\nAnd my power is my horn and my horn is my dick\n\n[Interlude]\nHere's your opportunity to stop listening\nIf this song got too amazing for you\nNo? OK\n\n[Verse 2]\nMy life is a party, the guests are supermodels\nOperation: I Rule is a total success\nEach day I invent a new form of karate\nThat changes the way that Japan views the West\nNow's that's progress! Doitashi Mashitay!\n\nThen we retire to the Chamber of Passion\nAnd bathe in pool of strawberries and cream\nThe strawberries rub and exfoliate gently\nThe cream travels places you can't even dream\n\n[Girl] Ugh, I think I just dreamed it\n[Danny] How was it? Amazing?\n[Girl] Uhh..\n[Danny] You mean Uhh-stounding? Yeah you did\n\n[Chorus]\nI am the Unicorn Wizard\nJust like Danny Sexbang, I'm handsome and strong\nWith the help of my hellhounds Tinkles and Gary\nWe punish the wicked then break into song\n\nI am the Unicorn Wizard\nA superhero for the entire human race\nMy wand casts a spell that will unlock the door\nAnd the wand is my junk and the door is your face\n\n[Outro]\n[Mom] Danny, Danny, wake up!\n[Danny] Oh, oh, Oh hey mom. I had the craziest dream!\nI was the Unicorn Wizard!\n[Mom] Awww, shut up\n[Danny] Unicorn Wizard!\n[Mom] I said shut up\n[Danny] You shut up"}], "artist": "Ninja Sex Party"}