{"artist": "Petey Pablo", "songs": [{"album": "Still Writing in My Diary: 2nd Entry", "title": "Boy’s Bathroom", "image": "https://images.genius.com/ad7098f2dca34e5ed96e2af4d16875b9.220x220x1.jpg", "lyrics": "(psst..hey i bet you thought the record was over didn't you?)\n\nCome away from that air time\nMighta gunned your ass\n(COME ON!)\n\n(chorus)\nMeet me in the boys bathroom (COME ON)\nMeet me in the boys bathroom (COME ON)\nMeet me in the boys bathroom (COME ON)\nWhat you wanna do with all these girls? (COME ON)\nMeet me in the boys bathroom (COME ON)\nMeet me in the boys bathroom (COME ON)\n\n(verse 1)\nThat boy that love the rock\nMy homeboy got more sound than a goddamn jukebox\nThat nigga like 2Pac\nWanted to do derrty songs but one day (dont stop)\nThat boy gon hurt sumthin\nWhen they come out at dis time watchin numbers\n(money jangling) (5,10,15) while the money keep pilin up\nHad to get another money machine\nCause the first one i had dont work no mo'\nHadda get me some new cars, with new rims and chrome bars\nKinda glad that they made a h2 with the button in the middle\nI miss my uh-uh\nLike i miss my grandma\nWith a crisco can on the back of the stove\nBeda fry me up some catcus with a side of okra\nYa'll ready to have some fun?\nGimme a holla at the back of the club\nI got that what they want\nThey want that bumpty-bump\nI know what nigga shit hot right now\nDawg, but his shit is cold\n\n(chorus)\nMeet me in the boys bathroom (COME ON)\nMeet me in the boys bathroom (COME ON)\nMeet me in the boys bathroom (COME ON)\nWhat you wanna do with all these girls? (COME ON)\nMeet me in the boys bathroom (COME ON)\nMeet me in the boys bathroom (COME ON)\n\n(verse 2)\nBig bird, big bird got a new flock\nAnd when they flap comes over to the next block\nWe parked got our cars on the place\nWith the space with signs that say ain't no park\nIf i come outside and they boot my guys (so?) i just snoop doggs drivin\n3 wheels go on one side, hard knocks, crank the 9\nWith a carolina baseball hat pulled down so the sun dont go in my eyes\nWe the type of guy the girl they dad dont like\nWith that ol colonge on they used 12 they come in here smellin just like it\nMy hand just banch the lightin\nHis daughter apples ripe\nJust squeeze the dad out and pull one down and lemme just bite it\n'whatchu doin in there with the lights off? yall get in the livin room right now'\nNow i wish he take his ass to a motherfuckin bingo store (bingo)\nHe can make that mine my bad he forgot where he put the viagra (HEY!)\n\n(i bet you thought the record was over didn't you?)\n\n(bridge)\nMeet me in the boys bathroom i said\nMeet me in the boys bathroom i said i said i said\nMeet me in the boys bathroom i said i said i said\nNow what am i gunna go with all these girls,girls? (HEY)\n\nCoochie coochie ya ya oo\nPut yo hand on the back of that stool\nUh-uh, you beda not move\nStop actin like this ain't sumthin you used to\nI know you since high school\nWhen they come to you in a jam how they put you ina tutu\nYa name ring bells in the neighborhood\nBest head in the whole wide world\nPrettiest chest the all be gapin wallin\nAlmost make a nigga a he steal\nBet ya ass next time fore your ass\nCome somewhere you ain't spose to come\nAnd get tapped on till that thang come\nAnd ya face swell up like it busted open\nTrojan, hip hop got a whole lotta bump\nNow get on outta here (thru them doors)\n\n(bridge)\nMeet me in the boys bathroom i said\nMeet me in the boys bathroom i said i said i said\nMeet me in the boys bathroom i said i said i said\nNow what am i gunna go with all these girls,girls? (HEY)\n\nGood afternoon, my name is thomas jefferson leon-matthews the fourth\nI am a resident of the carolinas\nAnd has been a citizen of the united states of america\nEver since the day i was born\nUm, i come from a small town called kenansville\nOn the other side of wilmington, north carolina\nAnd i'd just like to say that\nThis, um, hippity-hop, um, (rap music) rap music\nThat they got in the communities today\nIs destroying our community\nAnd we could go to the store\nWe could buy (bread) tomatoes and mayonaise\nWe could get everything we wanted\nAnd without worryin about driveby shootings\nAnd um, gang violence, and i just wanna ban their souls to hell\nI, i curse their names i, i can't stand the motherfuckers\nI wish that..i..they're, look these fuckin dubs, and\nHEY SHUT THE FUCK UP!", "year": null}]}