{"songs": [{"year": "2012-11-15", "lyrics": "[Hook]\nA bitch and her best friend\nGo to the club, party every weekend\nGet in for free cause she know she a freak, yeah\nShe a freak, yeah\nShe know she a freak, yeah\n\n[Verse 1: B.o.B]\nPopping, popping, popping tags, always with a shopping bag\nShe go to Clark Atlanta but she always hopping class\nAll-star weekend, she be where the lobby is\nLooking for that slap stick, all she need is hockey pads\nShe just be scrambling, looking I did be clean\nTossing that box like shipping and handling\nShe be going, yeah, she be doing anything\nNatural, stage jumpin off, she a trampoline\nStraight, straight boinking this bitch\nI'm 'bout my head, flip up coin in this bitch\nShe brought her overnight bag and it's fendi\nShe wanted Benihanas but she settled for some settle for some Denny's\n\n[Hook]\n\n[Verse 2: Iggy Azalea]\nRed bottom ass heels on\nHair laid, it's fly shit\nTwerk something, I might let you through\nBut don’t touch nothing, that’s my shit\nOh that’s cute, same outfit\nDifferent color, same swag\nShe jumping off when she leave the club\nBody spray in her Gucci bag\nPole going ass ho\nYou and your main bitch front row\nHoes lined up outside\nWanna shake that ass at my show\nLet me tell you something you don’t know\nOn my neck and wrists is trap gold\nMy ass fitted in Levi\nSwag so rodeo\nIt’s bitches in the building and it’s bitches on the couch\nShe tidy up her best friend, before she leave that house\nShe got her best friend, that's a freak bitch\nA freak bitch, tickets to my concerts on her wishlist\n\n[Hook]\n\n[Verse 3: Mac Miller]\nB.Y.O.B, bring your own bitch\nShe don’t sleep, she smoke trees\nNo boyfriend, got cold feet\nLow key, she’s so sweet\nJust lonely, but so freaky\nActing wild like ho please\nFly around, I go deep\nShe don’t creep, I fuck hoes\nShe cool with that, she love those\nIt’s funk so her gusto\nIf not so she one of those\nTil it’s come close, gotta love Jones\nWhat’s under your clothes I wanna know\nHer ass huge, her back screwed up\nWith a bunch of bad tattoos\nMe she make an exception but she usually fuck black dudes\nMy cashews all in her mouth\nIn the club, more than her house\nCome through, she might hit the loud\nGo animal like in and out\nThreesome, I need some\nMy hoes is European, Norwegian, Puerto Rican, even some vegan\n\n[Hook]\n\nA bitch and her best friend...\n\n[Outro: Iggy Azalea]\n\"This bitch, came to the club, with an overnight bag. She was so ready. She came, to the club, with an overnight bag, with a separate set of clothes in it. Took her shoes off. This bitch was back in the car with me and fuckin' B.o.B, tryna talk to B.o.B's friend, with her overnight bag. Had done fuckin' changed shoes. And I was like, 'wait a minute B.o.B, isn't that the same bitch from earlier tonight? But she in a whole different outfit?' And this bitch had a plastic bag READY. Ready for her fucking vacation. Just fuckin' crazy. YES! A 24-hour vacation. She was fuckin' ready. For the 24-hour trip of a motherfuckin' lifetime. And she knew what she was comin' for before the club opened. She packed! She probably had some wet wipes in there, like everything. THAT GIRL was crazy though, you know she was crazy. AND THEN was like, 'but I got a boyfriend' - BITCH, you don't have a boyfriend! Fuck outta here. That was the crazy shit. Remember that?\"", "title": "Best Friend", "album": "Fuck Em We Ball", "image": "https://images.genius.com/c15dbab29cd7e31286511ae5be6d5fed.500x500x1.jpg"}], "artist": "B.o.B"}