{"artist": "Ice Cube", "songs": [{"title": "It Was a Good Day", "lyrics": "[Produced by DJ Pooh]\n\n[Intro]\nBreak 'em\nYeah\nYeah\nYeah\nUh\n\n[Verse 1]\nJust wakin' up in the morning, gotta thank God\nI don't know, but today seems kinda odd\nNo barking from the dog, no smog\nAnd Momma cooked a breakfast with no hog\nI got my grub on, but didn't pig out\nFinally got a call from a girl I wanna dig out\nHooked it up for later as I hit the door\nThinkin', \"Will I live another twenty-four?\"\nI gotta go 'cause I got me a drop-top\nAnd if I hit the switch, I can make the ass drop\nHad to stop at a red light\nLookin' in my mirror and not a jacker in sight\nAnd everything is alright\nI got a beep from Kim, and she can fuck all night\nCalled up the homies and I'm askin' y'all\n\"Which park are y'all playin' basketball?\"\nGet me on the court and I'm trouble\nLast week, fucked around and got a triple double\nFreakin' niggas every way, like MJ\nI can't believe today was a good day\n\n[Verse 2]\nDrove to the pad and hit the showers\nDidn't even get no static from the cowards\n'Cause just yesterday them fools tried to blast me\nSaw the police and they rolled right past me\nNo flexin', didn't even look in a nigga's direction\nAs I ran the intersection\nWent to Short Dog's house, they was watchin' Yo! MTV Raps\nWhat's the haps on the craps?\nShake 'em up, shake 'em up, shake 'em up, shake 'em\nRoll 'em in a circle of niggas\nAnd watch me break 'em with the 7, 7-11, 7-11\n7, even back door Little Joe\nI picked up the cash flow\nThen we played bones, and I'm yellin': \"Domino!\"\nPlus nobody I know got killed in South Central LA\nToday was a good day\n\n[Verse 3]\nLeft my nigga's house paid\nPicked up a girl been tryna fuck since the 12th grade\nIt's ironic, I had the brew, she had the chronic\nThe Lakers beat the Supersonics\nI felt on the big fat fanny\nPulled out the jammy and killed the punani\nAnd my dick runs deep, so deep\nSo deep put her ass to sleep\nWoke her up around one\nShe didn't hesitate to call Ice Cube the top gun\nDrove her to the pad and I'm coastin'\nTook another sip of the potion, hit the three-wheel motion\nI was glad everything had worked out\nDropped her ass off and then chirped out\nToday was like one of those fly dreams\nDidn't even see a berry flashin' those high beams\nNo helicopter lookin' for a murder\nTwo in the morning, got the Fatburger\nEven saw the lights of the Goodyear Blimp\nAnd it read \"Ice Cube's a Pimp\" (Yeah)\nDrunk as hell, but no throwin' up\nHalfway home and my pager still blowin' up\nToday I didn't even have to use my AK\nI gotta say, it was a good day\n\n[Outro]\nHey, wait, wait a minute!\nPooh, stop this shit!\nWhat the fuck am I thinkin' about?", "image": "https://images.genius.com/87c8b6ecc80526fb041ce3d4d66a2592.500x498x1.jpg", "album": "The Predator", "year": "1992-11-17"}]}