{"songs": [{"lyrics": "[Verse]\nBoy I'm tryna tell you\nFuck it, go in off the muscle\nNiggas never love you, don't respect your\nEvery time they see you, dap you up in public\nSecond that you turn your back, they all like \"Fuck you\"\nWhat the fuck wrong with these niggas?\nI wouldn't even get on a song with these niggas\nYou might as well go put a thong on these niggas\nI smell the perfume or cologne on these niggas\nAh, time to turn up in the city\nI pull up broad day with that choppa, let's get it\nThese niggas act like they can't get they issue\nBring Swerve out the cut and I send him to get you\nPull up like, \"Who wanna see me?\"\nTry me if you don't believe me\nI got 'em like, \"Who Baby Jesus?\nThe one that cashed out on that new yellow Beamer?\"\nNo play-play, no play-play, I'm bustin'\nI'm 'bout whatever, won't back down from nothin'\nPerfected my craft, exercising my muscle\nTwo guns in the club, kill the first nigga touch me\nThat's why I be chilling and minding my business\nI'm half-way retarded, my mind is specific\nWelcome to Charlotte, and this how we livin'\nFrom East to the West, better be 'bout your business\nIn North to the South, fuck around, get your issue\nRe-up in Charlotte then come with your pistol\nDon't leave it in the car, I bring it in here with me\nPlease don't get me started 'cause I don't like quittin'\nOn I-85 blowing smoke out the window\nVroom, I'm Ricky Bobby, I send hits like Boozie\nThe first nigga try me, I pay for the bodies\nJust call me John Gotti, yeah\nIt ain't shit to send a hit\nSend a DM on the Gram, hit your bitch\nGot a MAC-11, 32 in the clip\nKeep a .45 with 15 shots off the hip\nGlock in my tote, we strapped up in the V.I.P\nFuck the security, we in the club with them pistols\nCatch him slipping, go knock the mug off a nigga\nAsk what happened, \"Sorry, I do not remember\"\nKnow how we do in the fold\nNo pressure, I know what do with your hoe\nBet I make her feel special, I know what to tell her\nI sell her a dream, let her put on my necklace\nThen give her right back, know I had to finesse her\nBaby Jesus got more bitches than Elvis\nYou know I got 'eem, got me feeling like Welvin\nYou already know that all dogs go to heaven\nAll my dogs is some felons\nFuck the law, ain't no tellin'\nI switched up the pace on the rental\nPull up on whoever, just tell me who want it\nI'm flat about all the subliminal messages\nMy confirmation and niggas respect the shit\nI go to work like a muhfuckin' Mexican\nI'm so unimpressed with these niggas\nI expected the best from these niggas\nI'm disappointed, that's to say the least\nSomebody wake me up, I'm on the way to sleep\nI find it funny how these niggas changing on me like I didn't do this thing by my lonely\nLike I ain't put work in, no handouts, I earned it, please don't say my name, lil' nigga, you don't know me\nI make it look easy, but don't get it twisted, you ain't built for this shit, I promise\nI love getting money, I love getting pussy, and both of 'em come with a whole lot of problems\nI'm the future of rap in my city, not to mention I'm known to fuck up some commas\nWhat you kids know about taking niggas money just to go and give it to your mama?\nIf I love you, I will never let you struggle, I'll give you my last, know I got ya\nAnd it's Baby Jesus, you already know it, ayy", "album": "So Disrespectful", "year": "2015-04-29", "title": "No Compadre", "image": "https://images.genius.com/6ff254999523aaef397c77d64a1b89f5.727x671x1.jpg"}], "artist": "DaBaby"}