{"songs": [{"year": null, "title": "Worship The “D”", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir\nAlbum: Boxcar Sessions\nSong: Worship The \"D\"\n\nNow I'm takin' my shroud and I'm\nPuttin'\nIt on my head, not even a semi-fraud\nMore like a demigod in bed-post\nI be hostin' a buck fifty is the rate\nSo the shower comes late. They call\nMe get 'em sick cause I be fillin'\n'Em wit dick. So I get a dance and a\nCandle cause I got handles. When I\nDrop a load in the cock, block this if\nYou can. They try cause they see\nThat\nI'm the mutha fuckin' man\nDemanding\nThe dick, commanding the bitch to do\nMy bidding, I'm not kidding when it\nComes\nTo rockin' the cradles cat. I don't jock\nBrats. Let's use the synonym of gats\nThey play with 22's, I'm like an h-k\nDouble M caliber, when I'm in the\nTrim\nStabbin' the guts like a butcher. Put\nYa in a trance. Watch me hump you\nI got muscles in my ass so I hump\nFast\nAt last the eyes meet mine, within her\nAbyss I see concepts for the rhyme\nDimes\nWill be dropped definitely when I see\nYou, about how you served the\nHobos the\nButt like EU, leave you to me in two\nOr three weeks I'll have you whole\nWells\nFargo cargo. I know fools who be\nSellin'\nIt, that's why niggas like me is damn\nNear\nCelibate. So the next time she puts\nIn an\nOrder, even if it's a lick, tell her to bob\nTwice and worship the dick\n\nI got a rep, ah, like salt 'n' pepa\nCause\nI'll push definitely my nuts will please\nLike the aborigines, I'm from the\nBush\nFrom the land down under the\nAsshole\nI mash ho's into potatoes. I love to\nBreak\nA fake ho and then make her over\nShit\nI'll do Sybill, I'll make the hips swivel\nAnd swerve. I'm licking every curve\nTill\nThey're sprung on my tongue. I won't\nGet caught down in the vault cause\nMy\nLungs help me catch wreck. Yeah\nBaby\nI'm nasty, but I'm not gonna tell you\nWhat\nI'll do, \"cause you'll lose reality, you'll\nBe acting under the age of 2, like\nGoo-goo\nLoo-loo, yes daddy, fuck me honey\nLike\nI owe you money. Gotcha girl, now\nYou'll\nSpread the word and tell ya friends\nOn\nThe low and lady if you try to play me\nThen I'll take your dough. I'll keep the\nStyle simple, so I won't lose you\nHo's\nI'll bruise you in between the thighs\nIf you're\nLookin' for the high, I won't be the\nSyringe\nFor the binge. They want me to hit\nThe crack\nLike a dope fiend. It's all good\nBut I hope\nYou're clean. Cause if you're not\nThen you'll rot. Cause ah...Saafir\nWon't tell you if\nYour shit smell like shit. From 10\nPaces\nBack you'll be worshippin' the dick\n\nA true blue collar, when I'm hollerin' a\nPoint. They wanna fade blunts\nSo I can\nPlay the cunts. I'm like hunts - slow &\nThick\nI'm so raw they've got alters for my\nShit\nAnd a little incense lit, of course\nShort on\nCash, don't trip cause Saafir will fuck\nFor\nFits. They make pit stops so I can\nTune-up\nThe cock, brakes are free, but rape, it\nAin't me. Can u dig it? I don't wanna\nServe\nIt if the bitch don't wanna give it. I'm\nLike ribbit - leap to the next freak\nWhy\nTest the ho, I might get lucky and\nFuck\nMe a bisexual. No discrimination as\nLong\nAs I'm facin' the guts, and not some\nUnder\nCover nigga wit some undercover\nNuts\nBefore you bow down to Saafir I\nWanna see if ya\nShit gotta spill, cause if not you'll\nCatch a\nClip - you'll go out", "album": "Boxcar Sessions"}], "artist": "Saafir"}