{"artist": "E-40", "songs": [{"title": "Bitch! (Remix)", "image": "https://images.genius.com/b6b6f7723f982a1bccc3f00b8f982e59.220x220x1.jpg", "album": "Revenue Retrievin’: Day Shift", "year": "2008-02-12", "lyrics": "[Hook]\nNigga don't act like a BITCH! (haha!)\nThat's why I never love a BITCH! (yeah!)\n50 Cent, Too $hort and E-40 say BITCH! (Remix!)\nShe sucked me off, don't kiss that BITCH!\n(From New York to the Bay! - From New York to the Bay!)\nOhh, why? Ohh, why'd you marry that BITCH?\n\n[50 Cent:]\nHe said he love her mayne, he really think he love her, mayne\nShe a superfreak, freakier than he understand\nShe's not the type of girl that you take home to your mother\nShe's the type you take to the track to come up on sucker\nWatch her deep throat! - See her D.P\nIn and out both holes like it's easy\nIt's not a big deal, she doin' what she do\nShe doin' it with everybody, not just you\nHello! (haha!) - I'm tryna put you up on game\nYou get emotional, then you could get the fuck on, mayne\nYou buy her everything, you let her treat ya like a trick\nYour sugar daddy mentality it make a nigga sick\nShe ask for it you just run and get it for her\nNo matter how much you give her, she wants more\nI hate to tell you, but you in love with a whore\nAnd chances are if niggas try they gonna score. - Man fuck that bitch! - (Hahaaa!)\n\n[Hook]\nThat's why I'll never love a BITCH!\n50 Cent, Too $hort and E-40 say BITCH!\nShe sucked me off, don't kiss that BITCH!\nOhh, why? Ohh, why'd you marry that BITCH?\n\n[Too $hort]\nI get everything I wanna get\nI have some fun with it. - And make her momma trip\nCause if I'm in her life - it's a problem!\nA real player's at your girl, you better stop him! (whooooooo-whooooooooo!)\nTurn your back on the bitch she ain't actin' right\nHe hit it way before you now he's back in her life. (haha!)\nWhat'chu gon' do when you lose her?\nShe got a nigga on the side just to use her! (AAAAAAHHHHHHHHHHHHHHH!)\nIf it's me, I'm parkin at the front door\nAnd you be knockin on her bedroom window\n\n!\nYou see the shadows! - You hear the sounds\nBut you don't do nothin' you just turn back around\nLike a BITCH! - Feelings hurt, ready to cry!\nYou cain't believe, everything she said was a lie\nShe got a lot of bitch in her but not more than you\nI never underestimate - what y'all boys'll do!\n\n[Bridge: 50 Cent]\n(BITCH!) - You love her. - I fuck her!\nShe my jump-off she yo' baby mama\nYou kiss her. - I twist her\nAnd send her ass back to you before you miss her! (BITCH!)\n\n[Bridge]\nI'm a playa, baby!\nI don't play no games (BITCH!)\nI remain the same, I ain't never gon' change my ways for no BITCH! (No not for you baby)\nThat's why I'll never love a BITCH! (I'll never love her)\n50 Cent, Too $hort and E-40 say BITCH!\nShe sucked me off, don't kiss that BITCH!\n(Please don't kiss her, please don't kiss her)\nOhh, why? Ohh, why'd you marry that BITCH?\n\n[E-40]\n40! Never-slippin'-and-slippin'-and-skippin'-and-drippin' and missin'! (missin'!)\nThese cats that I be hangin' around don't listen! (don't listen!)\nI-be-hippin'-and-sippin'-and-smokin'-and-drinkin' and spittin', (spittin'!)\nAnd these musty mouth broads they be trippin'! (they be trippin'!)\nI mean the bitch thought she was bad. (bad!) - I knew what that batch was thinkin'\nWhen she thought what she was thinkin'. - But she shouldn'ta thought that!\nI told her the money costs too much and I ain't got a dime (got a dime!)\nYou got to pay me! (pay me!) - Or pay me no never mind! (uhh!)\nI-I don't sit on the toilet when I go piss (piss!)\nYou-you got feminine tendencies like a bitch! (bitch!)\nMe-me I'm solid and concrete I keep it funky (funky!)\nWe-we we pull up in somethin, actin a donkey. (donkey!)\nShe-she she liftin' her dress up showin' her monkey, (monkey!)\nSee-see he trippin, he trickin, throwin her money! (money!)\nB-B-I-T-C-H, all in her face (face!)\nE-E-40 so laced, stay on the case! - AHHHH!\n\n[Hook]"}]}