{"songs": [{"title": "Take My Breath Away", "image": "https://images.genius.com/66ebf67824311b9591d74736feeae9c8.777x777x1.jpg", "lyrics": "[Verse 1]\nYou were someone I took interest\nHow did you get upon the guest list?\nSoon as you moved through the entrance\nBond a fragrance and your YSL footprints\nI studied you and your guy friends\nDéjà vu like I had met you look in past tense\nKinda makes me wonder what your name is\nPeople taking pics so I know you kinda famous\nSmile that will drive a girl saneless\nAnd your swag super clean, stainless\nI'm tryna get to you, Nesquick\nMilk chocolate skin smooth, a good investment\nLooks like lonely who you came with\nBut I know who you could leave with\nSeems like you got the vibe but you can't see that\nWay you got me charged up, boy I need that\n\n[Pre-Chorus]\n(Watching every motion in my foolish lover's game)\nRed dress\nIt was my most favorite red dress, how I fit\n(On this endless ocean finally lovers know no shame)\n[?]\nI am just happy that I got to see him that night and... my favorite red dress\n\n[Chorus]\n(Take my breath away)\nOh my, what have I done? Damn!\nNo bullets left in the gun, in the gun\nGirl down, I'm on the run\nI took a breath away, I took a breath away\n(Take my breath away)\nOh my, what have I done? Oh God!\nNo bullets left in the gun\nGirl down, I'm on the run\nI took a breath away, I took a breath away\n\n[Verse 2]\nDays past couple times we passed by\nWay I'm looking plenty men saying hi\nWay I'm looking boyfriend saying bae\nWay I'm looking fat boys running out\nYou would never notice, though\nHave taught my man and my pet\nHave appointments in the cardio\nWe are 17, man, carryin' in a new bag\nEven put your last name in my hashtag\nI took a picture of myself, I took a picture of ya\nI put 'em two together, lookin' at you as a couple\nWill not be lookin' at you, thinkin' I be seeing double\nDon't want nobody else picking, put you in a bubble\nThey dream about the day you say my name, baby\nThen a thunderstorm came, purple rain, baby\nMy prince, seal these lips in this quick kiss\n[?]\nShe was Therese and I was [?]\nShe was Therese and I was [?]\nHe was blind to my beauty and my booty\n'Cause he had a look cutie [?]\nBlacked out when I came thru\nEverybody lookin' at me, lookin' at me him too\nTears in his eyes, gun in my palm\nNo life in her body, oh my, what have I done?\n\n[Chorus]\n(Take my breath away)\nOh my, what have I done? Damn!\nNo bullets left in the gun, in the gun\nGirl down, I'm on the run\nI took a breath away, I took a breath away\n(Take my breath away)\nOh my, what have I done? Oh God!\nNo bullets left in the gun\nGirl down, I'm on the run\nI took a breath away, I took a breath away", "year": "2013-01-14", "album": null}], "artist": "Brianna Perry"}