{"songs": [{"year": null, "album": "I’m Good", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg", "title": "Blueprint Compilation", "lyrics": "{*The song starts with Jay-Z - Izzo (H.O.V.A.)*}\n\nLadies and gentlemen let's put our hands together for the astonishing\nH to the izz-O, V to the izz-A\n\n[Jay-Z]\nWelcome ladies and gentlemen to the 8th wonder of the world\nThe flow of the century, oh it's timeless, HOV'!\nThanks for comin' out tonight\nYou could've been anywhere in the world, but you're here with me\nI appreciate that, uhhd\n\n*The song changes to: The Jackson Five - I Want You back*\n\n*The song changes to: The Doors - Five to One*\n\n[Kanye West talking]\nYo this song right here, I remember I used to play\nThis sample for people before I hooked up\nAnd I used to tell people \"you know, this, this gon' be like The Truth\nBut it's gon' better than The Truth\", and to all my niggas, my nigga ??? said:\n\"I mean ask these but it ain't no Truth, that ain't no Truth right there!\"\nAnd he was all like, the Takeover\n\n[Jim Morrison]\nFive to one, baby, one in five\nNo one here, gets, out alive, now\nYou'll get yours, baby, I'll get mine\nGonna make it, baby, if we try\n\nThe old get old, and the young get stronger\nMay take a week, and it may take longer\nThey got the guns, but we got the numbers\nGonna win, yeah we're, takin' over\nCome on!\n\n*The song changes to: Jay-Z - Takeover*\n\n[Jay-Z]\nR.O.C., we runnin' this rap shit\nMemphis Bleek, we runnin' this rap shit\nB. Mac, we runnin' this rap shit\nFreeway, we runnin' this rap shit\nO and Sparks, we runnin' this rap shit\nChris and Neef, we runnin' this rap shit\n\nThe takeover, the break's over nigga\nGod MC, me, Jay-Hova\nHey lil' soldier you ain't ready for war\nR.O.C.'s too strong for y'all\n\n[Kanye West]\nAc'right nigga!\n\n*The song changes to: Jay-Z - Heart of the City (Ain't no Love)*\n\n[Jay-Z]\nUh, uh, listen\nFirst the Fat Boys break up, now every day I wake up\nSomebody got a problem with Hov'\nWhat's up y'all niggas all fed up cause I got a little cheddar\nAnd my records movin' out the store\n\n*The song changes to: Bobby \"Blue\" Bland - Ain't no Love in the Heart of the City*\n\n[Bobby \"Blue\" Bland]\nAin't no love, in the heart of the city\nAin't no love, in the heart of town\nAin't no love..\n\n*The song changes to: David Ruffin - Common Man*\n\n[David Ruffin]\nYeeehh\n\n*The song changes to: Jay-Z - Never Change*\n\n[Jay-Z (David Ruffin)]\n(Never, never, never, never change)\nI never change, this is Jay every day\n(I never change!)\nI never change, this is Jay every day\n(I never change!)\nI never change, this is Jay"}], "artist": "Kanye West"}