{"artist": "Anybody Killa", "songs": [{"title": "Nevehoe", "image": "https://images.genius.com/e8235b7763da2f99c14011dff35a2d0f.400x400x1.jpg", "album": "Dirty History", "lyrics": "[Intro] -x3\nNeva Neva\nNeva Neva\nNeva Neva\nNeva Neva\nStay up off it!\n\n[Verse 1 - Anybody Killa]\nQuit frontin', actin' like I don't know what you up to\nI see right through you, so what you gonna do?\nNever will you step a foot around me again\nCause hangin' with you, I can't win\nSome of the people in this world is some straight up hoes\nBrown nose, I suppose, that's how it goes\nBut I sit back watchin', clockin' dollars\nWith a smirk on my face waitin' for you to holla\nSo I can say nevehoe, nope, what you thinkin'?\nAll up in my face, tryin' to thug, breath stinkin'\nYou can get the barrel from my homie Shaggy's shotgun\nAll up in your face in case ya wanna taste a hot one\nI got no love for them marks, punks, hoes, snitches\nGrown ass bitches\nSo stay away and don't come too close\nCause you may never fuckin' know who wants to slit ya throat\n\n[Hook]\nNevehoe, you ain't gettin' shit\nNevehoe nevehoe, stay up off it!\nNevehoe, you ain't gettin' shit\nNevehoe nevehoe, stay up off it!\n\n[Verse 2 - Shaggy 2 Dope]\nI can't stand a motherfucker like you\nWhen my pockets in mind, I don't care what you into\nI got too many mouths to feed, from kids to mothers\nMy wife and brothers, and too many others\nSee I'm being tryin' to speak on\nWhile you sit back and see me as a jar of Grey Poupon\nI should've just stuck my dick in your mouth\nGave your eyes chocolate donuts and bounced the fuck out\nI go home and meditate with some sage\nTryin' to brush off these forked tongues like back in the day\nBut your new name is fittle fingers\nCause you're a bank account raper tryin' to steal my dinners\nJust another undercover crackhead\nIt comes down to you ain't rapin' me again\nNevehoe, bitch, for now and nevermore\nJust get your hands out my cookie jar you fuckin' whore\n\n[Hook] -x2\nNevehoe, you ain't gettin' shit\nNevehoe nevehoe, stay up off it!\nNevehoe, you ain't gettin' shit\nNevehoe nevehoe, stay up off it!\n\n[Verse 3 - Anybody Killa]\nNevehoe, not no mo'\nCause all your true colors is startin' to show\nGreedy ass, hand in the cookie jar\nTryin' to get a fistful but it's just too hard\nLet me catch you again, I thought I said never\nTryin' to take what's mine but you ain't that clever\nRunnin' with a hatchet, Psychopathic, we don't stop\nSo you gets no cream of our crop\n\n[Verse 4 - Shaggy 2 Dope]\nTwelve years in this game, for what?\nSo you can a bank teller out my butt, BITCH!\nNaw fuck that, it's time for some chokin'\nCrackin' those legs open, cause your drunk and smokin'\nSpittin' out babies like your spit your game\nShit loads of money in fifteen minutes of fame\nWell nevehoe, no, I ain't the one\nI don't pack one, but I do got a gun\n\n[Hook] -x2\nNevehoe, you ain't gettin' shit\nNevehoe nevehoe, stay up off it!\nNevehoe, you ain't gettin' shit\nNevehoe nevehoe, stay up off it!\n\nWhat, what? Bring that shit in bitch, what?! (Stay up off it!)\nMan, don't even touch my weed dogg I will bust yo ass (Stay up off it!)\nNope nope nope, you ain't gettin' no ride\nFuck you, you ain't got no gas money (Stay up off it!)\nNaw, hoe don't even worry about my motherfuckin' bank account bitch!\n(Stay up off it!)", "year": "2004-07-27"}]}