{"artist": "King T", "songs": [{"image": "https://images.genius.com/44cb8027b1b36e7a944f9b7cfc1d7a45.600x600x1.jpg", "title": "Liq Hittaz", "year": "2005-07-05", "album": "San Andreas: The Original Mixtape", "lyrics": "[Verse 1: King T]\nWhere I'm livin', they twistin' big Benz's and excursions\nI reminisce the days right before I start servin'\n2-11's come to mind, grab the nine, good to go\nFinna run up in the sto', everybody hit the floor!\nPalms on the ground, face down, don't make a sound\nTellin' you now, any sudden moves I'm dumpin' off rounds\nMore sales on the register, popped it like a charm\nBitch, give up the grip, don't even trip the store alarm\nEmpty each and every money slide quick as possible\nOne time come, before I'm done, you a hostage, ho!\nYou moving too slow, my crime is on parole\nAnd I ain't tryin' to go, so everybody break your billfolds\nLift up the tray and get the Franklins and grants\nI want pennies, nickels, dimes, quarters and food stamps\nWe advance out the sto', smashed in the Ford\nAll they know, it was three niggas and one had a fro', Liq Hittaz!\n\n[Interlude: King T & Young Maylay]\n\n[Verse 2: King T]\nYou need to keep your business to yourself, I find out who got the keys\nI'ma creep up behind ya house and put me down a robbery\nSo watch ya mouth clown, we invadin' homes\nNext day, come around and blow tree like Nathan Rome\n(You know, they just got me for some cheese) No shit!\n('bout a hundred and fifty G's) Oh wee, cold twist!\nWasn't even all that, but still a cool grip\nEach amount vary every time a fool slip\nWe gon' get him, back to back, like a rerun\nThat nigga that lick a whole pack of suckers when I see some\nThe bag snatcher, limit your chatter\nFor you had me going backwards, cause I'm really after rappers\nPeepin' out them big mansions in Calabasas (Oh my god!)\nBallin', flossin' and gave them the state addresses\nThey ain't down, they can't hang with us\nSki mask to straight face, nigga, ante up\n\n[Outro: King T]\nThe Liq Hittaz!\n*police sirens*\nAw shit! Now a word from our sponsors\nJust because you're rollin' now\nDon't mean that you can't fuck around and\nGet yourself killed, 'cause these niggas hate\nTo see you ball, and that's real"}]}