{"songs": [{"year": "2016-03-07", "album": "El Southside", "image": "https://images.rapgenius.com/993f4e70cc1d1067cbaf06156145d051.950x950x1.jpg", "title": "Girlfriend", "lyrics": "[Intro]\nWhy the fuck this bitch texting my phone?\nYou're not my girlfriend\n\n[Chorus]\nI just took a flick with your girlfriend\nI been kickin' shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna to tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\n[Verse 1]\nRidin' through the city, I ain't know that she was with it\nShe was tryna get with me so I had to get busy\nSee I met her at the Lenox, she was tryna buy some Jimmy's\nAnd that ass like Serena like she had to play tennis, ayy\nSwervin' on corner like skrrt (skurrrrt)\nShe said, \"Can I text you?\" I'm like sure (surrrre)\nAnd I got on Gucci like burr\nShawty you gon' have to shave the fur (cut it off)\nAnd I might come ballin' like I'm Stephen Curry\nSpace Jam, Bill Murray, Munchies, Oreo McFlurry, whoa\nI can't even lie, shawty thick and she purty\nWork at the Blue Flame she doin' tricks up on that pole\nI ain't even know that's your girlfriend\nI'ma pass her like I'm Kyrie Irving\nI'ma just take trips to Berlin\nWhy you tryna flex like you a virgin?\n\n[Chorus]\nI just took a flick with your girlfriend\nI been kickin' shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna to tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\n[Verse 2]\nGet out my lane, that's candy paint\nTook out the brain, I'm at the flame\nWe not the same, Louis V frame\nLook where I came, from Marta trains\nLook at my game, I'm like King James\nI'm making movies, just like the Wayans\nFuck what she sayin', she want a ring\nPimpin' ain't easy, Big Daddy Kane\nBaby Ion't even know yo name\nHundred on the dash like I'm Dame\nShe wanna take trips to Romane\nCall me David, I'm the one to blame\nI can't even do it, babe, sorry, I can't even lie\nWhy you tryna fuck with me babe? You got another guy\nShe said, \"Can I come again?\" Maybe, girl, another time\nTramp stamp on her back, what is that a butterfly?\nBlowin' on the gas from the Amoco\nI just hit yo girl in my Polo Pajamas tho\nGotta stay strapped like I'm Rambo tho\nAnd she thick and she pretty (like who?) like Amber Rose\n\n[Chorus]\nI just took a flick with your girlfriend\nI been kickin' shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna to tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend"}], "artist": "Kap G"}