{"songs": [{"image": "https://images.genius.com/8c64802e67b984f2079bb623b41eb3e6.500x500x1.jpg", "year": "1999-01-01", "lyrics": "[Verse One: Mr. Eon]\nKing Solomon to your Senate and Congress\nLyrical trial fest, turnin thugs Amish\nQuadruple to ya uno, what you know?\nGot weight like two sumos on Pluto\n\n[Evidence]\nYes E, my flow is stunning, cunning with expertise\nEvidence, effortlessly, the exor-cist, I meant cist\nObtain poison fists, spiritual combat is how I'm rockin this\n\n[Mr. Eon]\nThrow smoke screens in heaven, weed lace adrenaline\nYour three loaves of bread couldn't fuck wit the eleven\nBring ninety-five thesis to one page of feces\n\n[Evidence]\nI'm not the one to loop shit, chop drums into pie-ces\nAt least these days, I got lyrics in abundance\nShoutout to homey block in Greenpeace and London\nAnd for production, it's all on how you truncate\nRecords take up space and get heavy, hold the weight\n\n[Hook] [Mr. Eon, Evidence]\nMost MC's, I don't care what they're sayin\nRight they're on the right track but they on the wrong train\nWrong destination, wrong reason for the action\nI come equipped with flows and pack game like Paxson\nMost MC's, I don't care what they're sayin\nThey're on the right track but they on the wrong train\nWrong destination, wrong reason for the action\nMy name is Ev, I take you out like subtraction\n\n[Verse Two: Evidence]\nMy mind is attached in my physical form\nI stress my, emphasis as I enter this\nIt's gettin warm, storm clouds start to darken\nMy rhymes flood like Noah in the Arc an'\nIt's worst nightmare, wear your shades for the glare\nMy skyline turn sharp hues in knock 'em turquoise\nToys turn to girls, boys turn to men\nI'll end the situation by not starting\nIn this case I'm committed, serve em like Lendal\nSmoked out in interviews but still intellectual\nSo check the perpetual, escalation from Dilated\nThe mic icons who roll thick like pythons\n\n[Mr. Eon] (Evidence)\nE=MC squared  (So run scared)\nWe droppin mathematicals, you ain't prepared\n(The equation shows that we're truly amazing)\nDividing up your crew wit nothing remaining\nE=MC squard (So run scared)\nWe droppin mathematicals, you ain't prepared\n(The equation shows that we're truly amazing)\nDividing up your crew wit nuttin remaining\nTo unscramble my mandibles untangible\nUnhandable tantrums from this scandalous vandal\nThe pitcher's a balker, foul like street parkers\nTeleport like Nightcrawler into sleep walkers\nFought up beatboxers, rushin ?cheap toxins?\nHob goblins hob-nobbin, hoes be knob-slobbin\nCheck this direct dialect on sandscript\nClaimin that they fresh, they spit breath that's rancid\nRepeelers to DAT and catscan, the last champ\nPut on my shit and watch thugs try to slamdance\nIt be the Dirty Decible spillin grungy\nFacin me is like Bizarro and Solomon Grundy\nNot to mention man, you just need to try more\nHow you matchin a neanderthal verse a cyborg\nElementals, wit pens and pencils, utensils\nSilhouettes get my shit crunched by more mentals\n\n[Evidence]\nEvidence, Alchemist, Mighty Mi, Mr. Eon uh uh", "title": "E=MC2", "album": "Eastern Conference All Stars "}], "artist": "The Alchemist"}