{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/643d9675eedcaa5319fa306772e6375b.479x479x1.jpg", "title": "Airplane Flight", "year": "2013-02-07", "album": "63", "lyrics": "We took a airplane flight [x3]\n\n[Hook: Kool A.D.] [x2]\nWe took an airplane flight\nNothing quite like an airplane right?\nWe got schemes of the hair-brain type\nPlus a couple water tight ones, alright then?\n\n[Verse 1: Kool A.D.]\nThe machinery, TV eye, free greenery\nChinese opium war, why you scoping me for?\nYouTube instructional, un-with-fuckable\nUnibomber swag, you don't wanna ask\nYoung log cabin, lemme have what y'all havin'\nArtisanal mall cabins, what's the cost of fun?\nBorn in jail, shout out to carmike?\nViolence is simple but its conditions of repercussions is all trifling nuance\nCops want to fuck with truants to fill their quotas\nWalking around like fat Ray Liottas\nBlack cop just a fat, black Ray Liotta\nRemember Kool A.D. I told ya, pride is a wild ride, rollercoaster\nPlaying Ohio, spinach, lay in the phyllo, phyllo dough, Dostoevsky, Cee-Lo bro, tower of power\nWelcome to the O-doh buddy, blud, you don't me from nobody\nLampin' in nice houses but spots to smoke huddy\nThey telling me to sing on more hooks, I'm like shut up already, damn\n\n[Hook: Kool A.D.] [x2]\n\n[Verse 2: DaVinci]\nJumped straight out my pajamas\nHopped the bird to Atlanta\nKept it knit like a candle\nChunk deuces to the camera\nI'm an ana-more for the dough\nPay your toll\nWhen you're coming to the city bring a hammer, nigga\nBlock nothin' like the Tanners\nCops grindin', bitches all scandalous\nI'm a bandit, outlandish\nSo I just brush them off my shoulders like dandruff\nThis is how a G move\nRap, I'm a beast du'\nRappin' since hide and go get it back in preschool\nNigga, I'm still hair-brain scheming\nLove a bad bitch who ain't scared to drink semen\nClear in the morning, dark liquor in the evening\nStyrofoam cup, jolly rancher with the lean in\nI'mma knock it down for johnny vandalism?\nRap aneurism, yeah thoroughbred rockin' now\nBlock scientist, y'all know what time it is\nSteaks on us, homie I am all about it then\nHey a hella holly olly oxin free\nIf its bout gettin' paper you can rock with me\n\n[Hook: DaVinci] [x2]\n\nWe took a airplane flight [repeated]"}]}