{"songs": [{"title": "What it Is (Strike a Pose)", "album": "VYP: Voice of the Young People", "year": null, "image": "https://images.genius.com/8bb2fd2501fbd45c34aeed2c09155cbd.500x500x1.jpg", "lyrics": "[Lil' Mama - Intro]\nI'm what it is..\nI'm what it is..\nI'm what it is..\nHa-hah, eh-hah, eh-hah, ha ha\nI'm what it is.. (What it is) what it is (what it is)\nWhat it is (what it is) what it is (what it is)\nWhat it is (what it is) what it is (what it is)\nHa, ha, ha-ha-ha - I'm WHAT IT ISSS!\n\nI used to get fresh for the block, Friday nights, party nights\nFresh for the block, cause everybody in the party\nStraight from the block, but what they gon' stop?\nMy dutty wine is sick, my heel toe wit twist-a\n360, this is - (NON-PLAYWITABLE!)\nMy toe-wop is sick, hit that then hit the\n360, this is - (FIVE STACKS CRITICAL!)\nAnd I ain't tryna brag to you (no!)\nAnd I ain't definitely tryna keep UP, cause I'm ahead of you\nOne word, and I murder you\nImagine with a verse-a, dude\nAnd that's just somethin that ain't changed yet, straight wreck\nOn anybody talkin material cause I take checks\nSo let's, make this a foreclosure\nBeen where you nev-ah, been real and the game's ov-ah!\nY'all mo' the, crust of these rap chicks (YEAH!)\nPeep what it is, but they not like this - I'm WHAT IT ISSS!\n\n[Hook: T-Pain] {Lil' Mama}\nShe fine (she fine), she sexy, cool\nAnd don't n'am dudes know what to do with her (know what to do with her)\n{I'm WHAT IT ISSS!} All these chicks can keep hatin\nBut they know that they can't fool with her (they can't fool with her)\n{I'm WHAT IT ISSS!} She hit the spot and shut it DAOWN! (DOWN!)\nNo messin around, strike a pose, girl\n(Aw yeah, aw yeeeeaaaah) Strike a pose, girl!\n...Now get off, GET OFF!\n\n[Lil' Mama]\n(I'm WHAT IT ISSS! - WHOA) \"She's so aggressive, the girl pressin\"\n(I'm WHAT IT ISSS! - WHOA) \"But she's a wack adolescent\"\n(I'm WHAT IT ISSS! - WHOA) Successin is my only mission\nIt's impossible for anybody, come and get it\nDefinition of raw talent and I write all bars\nFlay cars in the hood they call me No Holds Barred\nBorn star like my lil' brother ?Onstar?\nAnd I will, eat you rappers plus the candy's inside\nLil' Mama nicka-nicknamed Dharma {?}\nI'mma truth in the booth, +Shawty Gets Loose+\nAnd they way I eat guys so mean\n\"Lil' Mama, YOU'RE SO MEAN!\" - SO?!\nI like to rock the party and I like to rock the show\nWhen they step into my league, I gotta use all force\nWhen you START tryin to play with my brain like I'm crazy\nOh baby! That's when it's rock-a-bye baby!\n\n[Hook]\n\n[Lil' Mama]\nWhy don't you come around here, dawg?\nLook for me, type ease in bees we breeze\nPass your team, cause I been to where you sightseen\nNothing that you do or could ever do to excite me\nCan't see, like we know maybes or more than likely\nShe gon' have flow {?}, which means I got flow sick disease\nWhich means I have no sympathies, no antedote, y'all heard of me!\nPlease, wit these CB-4 chicks\n'fore I get up on some see mo', feed me mo'\nThis is what I been sayin for some time now (time now)\nIf anybody got an object-ion, time's now!\nMo' fitted and mo' stroll cause she's ON\nShe's on - (wha?) SHE'S ON!\nWake up in the mornin, go to sleep at dawn\nMy mama shoulda named me Dawn, ah-uh-uh, ONNN!!\nEither way, I woulda been a trip, the way I flip {YEAH!}\nThe script and switch then get down like this - I'm WHAT IT ISSS!\n\n[Hook]\n\n[\"I'm what it is\" ad-libs and chants continues 'til the end of the song]"}], "artist": "Lil’ Mama"}