{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/d55597aef7ddcd938a2bfc161537e7d5.1000x1000x1.jpg", "year": "2011-11-21", "album": "Radioactive", "lyrics": "[Verse 1: Yelawolf]\nYeah, hell of a day\nTo load a .22 and take it to the woods and let it ring\nInto the night and break a bottle with the bullet\nYes I'm 'bout it motherfucker, not a single solitary thing\nIs missin' from my southern roots I'm liable just to take a Chevrolet\nAnd run it through the mud for giggles\nHuh, what a son of a bitch my momma raised into a rapper\nWho could tell story like my uncle when he's drinkin'\nProduct of a workin' environment, fuck is y'all thinkin'?\nMeanin' I'm workin'-workin' harder than any artist\nCan ever do it simply cause I'm made that way\nI build a house around your ass before you could realize\nThat you were in the neighborhood that Yelawolf made\nSo call me a redneck and tell your boys about it\nTell 'em I'm an Alabama wanna-be, I be that\nI'll just take it to the studio\nAnd drop a bomb on you from a motherfuckin' beanbag\nI need that..\n\n[Hook: Yelawolf]\nGet away, tell my folks roll up the J’s\nBring Yelawolf a deuce, we’ll sit up on the roof of the broken Chevrolet\nTalk til there’s nothing left to say\nCause if I don’t get away, you gonna see my trailer park ghetto ways\nThen you gon’ have to get away from me\nDrink some, smoke some\nYou gone have to get away from me, load up the guns, load up the guns\nThen you’ll have to get away from me\nDrink some, smoke some\nCause if I don’t get away, you gonna see my trailer park ghetto ways\nThen you gone have to get away from me\n\n[Verse 2: Shawty Fatt]\nMan, I done been through it all\nI done been up and know what it is to fall\nPunk police feeling all on my balls\nWithout a probable cause, cause a nigga sittin’ tall\n\"Dawg, you gotta do something Fatt\nOn the road with Wolf, why did you come back?\"\nCause them up there, don’t wanna play fair\nGot me pinned to the wall, like a fucking thumb tack. \"Dumb fat!\"\nDumb hell, criticize a nigga for the crack I sell\nLike you could give a shit if a nigga eat well or eat at all, wanna see me fall\nLet ‘em see that? Naw dawg, them lies\nOnly cause I got Catfish on my side\nBitch I'm headed up, up to the sky\nRoll up, let's get high\nWavin' them bye, I need that\n\n[Hook]\nGet away, tell my folks roll up the J’s\nBring Yelawolf a deuce, we’ll sit up on the roof of the broken Chevrolet\nTalk til there’s nothing left to say\nCause if I don’t get away, you gonna see my trailer park ghetto ways\nThen you gon’ have to get away from me\nDrink some, smoke some\nYou gone have to get away from me, load up the guns, load up the guns\nThen you’ll have to get away from me\nDrink some, smoke some\nCause if I don’t get away, you gonna see my trailer park ghetto ways\nThen you gone have to get away from me\n\n[Verse 3: Mystikal]\n20 plus 20 still spittin' 'em out\nStill piss on your porch and still shit in your house\nThen put my dick in your mouth, take it back out, put it back in\nFuck on the floor, skeet on the couch\nWhich one of you ugly muthafuckers think you thug enough or rugg enough\nOr gutter enough, fast enough to keep up (huh)\nThe most retarded motherfucker in the whole wide world\nAin’t stupid or dumb enough to fuck with it\nIf you in say you in, and if you is handle your mutherfuckin’ business\nKnuckle up, buckle up, hustle up, huddle up. What we gonna do? Win!\nNot a nan’ ‘nother nigga outta there can compare\nTo what I do to these boys on these bars and these scales\nIn these clubs in these bars on these tables and chairs\nI need that!\n\n[Hook]\nGet away, tell my folks roll up the J’s\nBring Yelawolf a deuce, we’ll sit up on the roof of the broken Chevrolet\nTalk til there’s nothing left to say\nCause if I don’t get away, you gonna see my trailer park ghetto ways\nThen you gon’ have to get away from me\nDrink some, smoke some\nYou gone have to get away from me, load up the guns, load up the guns\nThen you’ll have to get away from me\nDrink some, smoke some\nCause if I don’t get away, you gonna see my trailer park ghetto ways\nThen you gone have to get away from me", "title": "Get Away"}]}