{"songs": [{"lyrics": "[Intro]\nMembers of the citizen's coucil, I am a simple soldier\nAnd as a soldier I see things simply\nI don't say all humans are evil, simply because their skin is white\nNo!\nBut our great law giver tells us that never, never will the humans have ape's divine facility\nFor being able to distinguish between evil and good\nThe only good human-is a dead human!\n\n[Verse]\nNowadays I find myself smoking more than I used to\nArguing with my bitch a lil more than usual\nI'm getting famous now, tryna to figure out who's who\nSacrificing somethings, sometimes it feels like a lose-lose\nSome say I act the same age as my Jordan's\nI feel the most at home when I'm in front this mic, recording\nI slept my way through school cause I felt like the shit was boring\nTeacher said I wouldn't be shit, in November I was touring\nNow I'm packing up my suitcase, a new stage, new state\nSome new weed, a new bitch who's fixing me up a new plate\nWith some new pussy and Newport, my mom say I should quit\nMy reply is life is too short, tryna cop shit out the Dupont\nRegistry to be exact, 2-0-1 is where I'm at\nBut I'm scheming on this cheese like a New York City rat\nYou can bet it, shooting movies, Heir Gang on the credits\nNever taking no days off, bitch my name isn't Ferris\nBlame my age cause I'm careless\nGive a fuck 'bout what they saying, no\nYou getting in your bitch car, my CD is always playing, yo\nKnocking haters off they ass, \"why you had to slay 'em for?\"\nI tell 'em \"what the fuck you think this rap shit isn't paying for\"\nA few things to be honest, I ain't tryna to be modest though I'm arrogant, lobster tail, and cheese on my asparagus\nWhen somebody say \"better\" I hear \"never\"\nEighth letter representer 'til they put me in a carriage, kid\nI meant a casket, lost a few eggs out my basket\nOn the way to 18, chasing bitches, making cream\nYou think I'm lying, you ain't know me\nI'm looking for Naomi, Campbell for example\nDrank about half of this handle\n\nFuck it, roll another one, I guess...", "album": "ChRon Burgundy", "year": null, "title": "Dead Batteries", "image": "https://images.rapgenius.com/8b20b2e431b6ff249b9a84387b2bf8d5.300x300x1.jpg"}], "artist": "Da$H"}