{"songs": [{"year": null, "image": "https://images.genius.com/8979e195a075754dfc6965f7356b0293.700x700x1.jpg", "title": "Crazy", "album": "Rapper’s Delight", "lyrics": "[Rapper Big Pooh]\nI wanna welcome y'all to the Rapper Big Pooh experience\nThe experience is everything\nYou in a privileged position to learn a thing or two\nSo get your pens out, get your tape recorders ready\nGet your mental thing going\nMe and Khrysis bout to take you on a journey\n\nIt's Rapper baby, take you home maybe\nLike to play the bottom so girls call me lazy\nUh, kinda crazy, nah rather cute\nWear the T3 button or a Ralph Lauren suit\nThe ball's in my hands, no pass, rather shoot\nBaby of the group but I'm no junior\nShe said see you later but I wanna come sooner\nOn that LL, I be Doin It, doin her\nHuh, I'm so outa the box\nI'm so left field like I play for the Sox\nI'm a homerun hitter, show time spitter\nDamn he's so mammish, no I'm so mammy\nQuite uncanny, hoes can't stand me\nWhen the time coming let's fly to Miami\nTamika, Tammy, Lisa, Randy\nTopless tanning on the beach I can be\n\n[Hook] {X2}\nYeah, you wanna know what it is?\nYou say I'm crazy, well I'm crazy baby handling biz\nYeah, you wanna see how I do?\nWell I'm crazy when I do it baby, how bout you?\n\n[Rapper Big Pooh]\nI talk with a slang and I walk with a swagger\nHe got an aura like shit don't matter\nThrow a lil' chatter, watch your heart start to patter\nPity, why these girls be acting so silly?\nFine young philly, hometown's Philly\nReally? I really got a taste for Ishkabibble's\nScribbled-down numbers, twenty on the button\nTold her holler back if she ever needed something\nWanting something, that something is him\nShe want a major man, he tryna be her friend\nWell look baby girl, this where the conversation ends\nDon't be mislead cause he flashed a few grands\nShowed a lil' dimple, showed a lil' charm\nI got one occupying my arm and that's work\nI'm on the horn tryna make this thing work\nIf you hear me let me hear you say chuuch... chuuch\n\n[Hook] {X2}\n\n[Rapper Big Pooh]\nSo I ain't the cutest, you already knew this\nPooh is chasing them down to say I hate you\nNo I won't date you, your life shouldn't end\nGo do like I and take it out on the pen\nJotting down emotions, pencil in your diary\nI read, I inspire to make millions\nBuy a couple buildings, flip them bricks\nYou want the story of my life? Well you hearing the script\nNon-descript, nigga with a forty-six hip\nTook a trip down South, never came back\nVA alum' do his thang on the track\nHoes begging me to come back\nThey ain't want a nigga cause they thought a nigga was fat\nNow I'm fat cause they see me on the box and they think I'm all that\nHoes is wack, wonder why I don't go back\nCause of silly ass shit like that, now keep down\n\n[Hook] {X2}\n\n[Rapper Big Pooh]\nYeah, I said how bout you?\nWhen I'm doing what I'm doing baby, how bout you?\nYeah, uh, I said how bout you?\nWhen I'm doing what I'm doing baby, how bout you?"}], "artist": "Rapper Big Pooh"}