{"songs": [{"year": null, "album": "The Dusty Foot Philosopher", "image": "https://images.genius.com/0939cced5a2b8162cd5d38cb17171350.640x640x1.jpg", "title": "If Rap Gets Jealous", "lyrics": "So good things come to those who wait\nSure, I've waited about pop-pop-pop-pop\nThat's four cousins shot!\nI got grudges, let's discuss this\nMy music needs no touch ups\nI got a long record of fuck ups\nTrust me you don't know a past as weird as mine\nOr a life as hard as mine\nI had to hustle, chop, sell drugs, grind\nWhatever you want to call it is fine\nBut just listen, and don't prejudge\nI don't want anyone dismissin' me as another thug\nOr some shit like that\nNo Sir! If I fall I will get right back\nI got circumstances, but let me stop dancin' around the issue\nAnd tell you straight forward, I'm poor\nA refugee, been in prison and survived the war\nI come from the most dangerous city in this universe\nYou're likely to get shot at birth!\n\nSo how can rap quench my thirst\nI don't even hear verses no more\nI hear jerkin' off punks with lip glosses and purses\nI don't see nobody operatin' shit anymore\nI see nurses, fuck that! I'm gonna stay alive!\nI'd rather do a stage dive!\n\n[Hook]\nAnd if rap gets jealous cause I rock heavy\nIt don't worry me if m'aa fuckers don't get it\nYo, if rap gets jealous, words that were admitted\nI used to be a public enemy don't forget it\nAnd if rap gets jealous cause I rock heavy\nIt don't worry me if m'aa fuckers don't get it\nYo, if rap gets jealous, cause of where I'm headed\nAggression, obsession, where pain live again\n\n[K'naan]\n\nSo yeah, basically I gotta realease occasionaly\nI gotta let you know what's goin' on with me\nAnd facing me are some tough choices\nI got a good side and a bad side\nInside my head, I hear screams, not voices\nAnd I can't lie, ain't got Shit!\nI ain't got to brag\nI'm hard pressed for some cash to send to my ill dad\nYou're so superficial!\nOf course it's for shizzle\nNow my choice is to piss on you boys\nCause my mission is the world\nTo know my name\nMy aim is plainly success\nBut I still gotta come fresh\n\nSo, how could rap quench my thirst\nI don't even hear verses no more\nI hear jerkin' off,punks with lip glosses and purses\nI don't see nobody operating shit anymore\nI see nurses, Fuck that!, I'm gonna stay alive! I'd rather do a stage live!\n\n[Hook]\n\n[K'naan]\n\nHe, He, He, That's what it is,it's pain,know what I'm sayin'?\nI don't know man it's like\nYou spend years developing your artistry\nKnow what I'm sayin', perfecting your skills\nYou can't do shit with it, Ha!\nThat's gotta be Fucked up!, know what I'm sayin'?\nHa! That's gotta be Fucked up\nYou know,just imagine like, imagine you build a Fuckin' castle\nAnd you can't live in it, ha, That's what it is\nYou can't live it you know\nAnd you got problems, you got family to feed\nI got family to feed moment of truth right\nAnd I still gotta come fresh\n\nSo how could rap quench my thirst\nI don't even hear verses no more\nI hear jerkin' off, punks with lip glosses and purses\nI don't see nobody I can reach anymore\nI see nurses, fuck that, I'm gonna stay alive, I'd rather do a stage live!\n\n[Hook](x2)"}], "artist": "K’naan"}