{"artist": "Bas", "songs": [{"lyrics": "[Verse 1: Bas]\nSmokin that good\nNo Reggie, No Theus\nMy niggas the G'est\nDon't shit come between us\nNo money, No hoes\nDon't shit come between us\nHow we play dirty but step out the cleanest?\nG shit bitch learn the meaning\nFrom here to Medina, I bag all the model chics\nCall em Athena, cause they are some Godesses\nMy politics don't got no policies just livin life everyday no apologies\nApologies for the delay I was up in the stars rollin up on astrology\nEconomies in disarray but a couple mixtapes gon put me in ecology\nEcology?\nEcology, that's green nigga\nGlobal Warming, that's me nigga\nHeatin up, They ain't keepin up\nHad a taste, I ain't eat enough\nHoes fast like they let a whole day pass without eatin none\nIf the 44's rung, Hemdi's the one\nIf them hoes open, I'll leave with them\nOne\n\n[Hook]\nYou in a hot air balloon\nYou could be around the moon\nYou eat a pound of the shrooms\nYou'll never be higher than I am\nYou could mook all of the keef\nYou could blow all of the schneef\nYou go as high as you reach\nYou'll never be higher than I am\nYou'll never be higher than I am ( so high)\nYou'll never be higher than I am (so blown)\nYou'll never be higher than I am (I'm Mooked)\nYou'll never be higher than I am ( I'm Mooked)\nI'm Super Mooked\n\n[Verse 2: Hemdi]\nShould I tell my story?\nOr should I show my scars?\nThis is Hemdi and Bas, this is avant garde\nNiggas swear they smart, till they ass get snatched thru the fog\nI got a couple bitches think they slick, but far from espionage\nMe and 3 bitches, that's just a collage\nI'm an artist of a rare kind, you just a facade\nThe quiet sun, metamorphosis, I have just evolved\nMy horizon bright and I box thru life like Cus was involved\nMuhammad Ali, the Iron Mike-ness\nIf I lay somethin' down and it's war time nigga no women no kids that kill is righteous\nGot blood on my glasses, give me a second to wipe it\nLets proceed when it touch white folks I guess that's when it becomes a crisis\nBut we still in the ghetto, where we chase money and hoes\nThe OG's said \"Thank you, young fella\nI guess nobody had the courage to write this\"\nAnd we drive foreign cars, But the evil drives us\nAnd we ride on each other so easy\nCause the demons ride us\n\n[Hook]\nYou in a hot air balloon\nYou could be around the moon\nYou eat a pound of the shrooms\nYou'll never be higher than I am\nYou could mook all of the keef\nYou could blow all of the schneef\nYou go as high as you reach\nYou'll never be higher than I am\nYou'll never be higher than I am ( so high)\nYou'll never be higher than I am (so blown)\nYou'll never be higher than I am (I'm Mooked)\nYou'll never be higher than I am ( I'm Mooked)", "image": "https://images.genius.com/865edacbc763f649092af26ad1c5f1d2.400x400x1.jpg", "year": "2013-05-22", "title": "Mook II", "album": "Quarter Water Raised Me Vol. II"}]}