{"artist": "Andre Nickatina", "songs": [{"title": "July the 4th", "album": "Hell’s Kitchen ", "year": "2002-01-15", "image": "https://images.genius.com/b227b7fafa0c5b48a1be729a4b5d519d.499x499x1.jpg", "lyrics": "How should I start? I'm so confused\nBy now I'm sure you heard the news\nCats I got workin' on the block\nGot a plot for me to stop\nIn my heart, I can't even say they wrong\nCuz in the game all the playas sing the same song\n\nI done seen cats do back flips when the bullets hit\nGotta to go and bring Jesus in they life\nCounterfeit to the pulpit\nBut anyway\n\nI'm so loved and hated 'round the community\nMy mother wonder what money, drugs can do to me\nI swear to God, I seen the Devil in my bag of weed\nWhere you live, I might freeze\nGotta get this cheese\nCats is makin' side deals with these other dealers\nAnd slappin' five with a player\nMan, like I'm they nigga\n\nI paged Nickatina, he didn't call me back\nHe must be on tour, but I'm not sure\nBut once again, it's July the 4th\nAnd once again\nGod I'm goin' to war, for sure\n\n\"There's gonna be fighting\nAnd somebody's gonna get hurt, that's for sure\"\n\n.... \"And everything we worked for will be wiped out\nAnd I don't think we can let that happen\nI mean that makes sense\"\n\nMan I taught these cats how to move this coke\nTaught these cats about the weed they smoke\nTook they mind from bein' broke\nNow they wanna have me smoked?\n\nMy woman said to me, 'her or my friends?'\nI said my friends cuz we bowed our ends\nShe said, nigga please\nThem muthafuckas is ya enemies\nBaby I love you but I gots ta leave\nBecause you don't sleep\nSome nights man, you don't even eat\nSmokin' weed, nigga\nRunnin' the streets\nBut check it, I don't complain\n\nI hate the fact her face is stuck in my brain\nIt's like razors just to hear her name\nPut that on double Glocks\nThe beef is burnin' every tick of the clock\nEven the rain won't stop the plot\n\nGot a page from Nickatina\nBut right when I was 'bout to call him back\nMy windshield had suddenly cracked\nFrom the impact\nGave shotty, glass half cut off my body\nI can recognize the shooter\nIt was little Shotty\nAnd I gave that muthafucka, yea his name\nHe tryna' to take a cat out the game\n\nYo, I'm full of blood (?)\nYou know bullets give you hot love\nI go in shock from the heat of the slug\nI think I'm 'bout to die\n\nThis is my last time to testify\nAnd after that there was no reply\nPut that on double Glocks (Shit)\n\n\"What did you say your name was again?\"\n\"I didn't\""}]}