{"artist": "Andy Mineo", "songs": [{"title": "Paganini", "album": "Never Land", "year": "2014-01-28", "image": "https://images.genius.com/efa9a287b8cbe8765afd1f050871c286.1000x1000x1.jpg", "lyrics": "[Intro]\nUh, huh\nYeah\nYeah\nYeah\n\n[Verse 1: Andy Mineo]\nWhat you wanna do, act loco?\nHit 'em with the old to the flow that I grew up on, then I grew up on 'em\nAnd funny now how I flow for Hova, heh\nWords twisted, but yo, I'm sober, uh\nNever really been the type to pour up\nWhen I get this thing goin' I don't like to slow up\nMouth movin' like a motor when I bite the flow up\nBut I bet they won't stop, let me go, let me go, woo\nI'ma show off every ability God's given me to go off in\nNobody mad about the beauty of the Vatican and the tabernacle\nSo when I'm rappin' you can add it in\nBreakin' 'em with the shatter\nThey're gonna wanna put me in a place with paddin', and I'ma damage 'em every time like a player that's on the cover of Madden\nGod, the original\nWe bright, look out!\n\n[Chorus: Andy Mineo]\nI feel like I'm Paganini\nHuh, who?\nPaganini\nHuh, eh\nI feel like I'm Paganini\nWho? (Freestylin')\nPaganini\n\n[Verse 2: KB]\nLet me do it\nK to the second letter, finna get it poppin'\nComin' out the pocket like, everybody get to rockin' doin' the Paganini\nKillin' the beat, my tongue is like a violin\nGive it to 'em like I'm not a human\nWhen I'm doing what I'm doing\nKeepin' it comin' like an automatic shooter\nWhen we get to rippin' it ridiculous\nAnd everybody gets to speakin' about these driven brothers that's goin' in again\nBut they don't know even when they got that flow (Got that flow)\nI don't know why they boast, everybody's gifts borrowed (look)\nProducers, directors, skilled architectures\nDo what they do to whom they're connected\nTrue was the God that chooses to bless them\nWho is the one you think they reflectin'?\n\n[Chorus: Andy Mineo and Canon]\nI feel\nUh-huh, yeah (God given) like I'm Paganini\nHuh, who?\nPaganini\nHuh, eh\nI feel like I'm Paganini\n(Ai-ai-ai) Who?\nPaganini\nCanon\nYeah, woo\nHey Andy, ok, ok\n\n[Verse 3: Canon]\nSo down for my clique, shut up (y'all corny)\nOh shoot, shut up\nI've been itchin' to stick 'em up with this killer Canon\nComin' to cut 'em and hit 'em harder, ooh, kill 'em!\nHold up, I've been hittin' everything up in me like I'm Paganini\nHittin' every rhythm like a milli chopped ya\nI know you heard Twista, and Tech-a-Nina hittin' ya\nBut Canon's original, I'm a Midwest monster, kill 'em!\nBlat! Blat!\nMineo and Kevin got adrenaline\nComin' to drill 'em with the real gospel\nComin' up to the game\nStill the same, bigger the name, bigger the fame\nTo the glory they follow Him and the Father\nWhile I'm comin' and killin' the game\nI'm breakin' 'em off and we know\nThey steady tryna imitate the steelo\nI'm hittin' with the fire, spittin' super wild\nRunnin' with the young and unashamed\nI'm Paganini on a kilo, amigo\n\n[Chorus: Andy Mineo]\nUh-huh, yeah (God given)\nI feel like I'm Paganini\nHuh, who?\nPaganini\nHuh, eh\nI feel like I'm Paganini\nWho? (Freestylin')\nPaganini\n\n[Outro: AnointedS]\nShow off"}]}