{"artist": "Pouya", "songs": [{"album": "The South Got Something to Say", "title": "Cruisin’ in the MIA", "image": "https://images.genius.com/acf70667ef0a748f2ca4485b706fa611.1000x1000x1.jpg", "lyrics": "[Intro: RAMIREZ & Matthew Healy]\nMan, you know I'm sayin’, people?\nI come through like old Saint Nick\nBreak a bitch off, give her the gift, you know I'm sayin'?\nI’m a pimp, I need my money, you know I'm sayin'?\nPurse first, ass last\nYou see the good Linens\nChinchilla on my shoulders, lookin' like a real pimp\nBreak a bitch down like a motherfuckin' Bronco\nLet 'em know, you know what I'm saying?\nPurse first ass last, bitch\n(MIA, cruisin' in the MIA)\n(MIA, cruisin’ in the MIA)\n\n[Verse: Pouya]\nSo I’m back in that matte black Cadillac\nGas on E, by my lonely, my homie\nHe told me he got five on the whip\nScoop him up, now we rollin'\nDippin’ back to the crib\nLooking for some shawties\nDown to kick it and sip forties\nDown to suck on my big homie\nBoobie rollin' up, eyes rollin' back\nMiami bitches throw it back\nPurse first, ass last\nNever tell 'em where the cash at\nNow we headed back to the whip\nMy hoes ready to trick, any corner that I pick out\nKeep my dick on flaccid ’cause I'm 'bout my chips\nAnd I can't let these hoes think that I'm with that\nI'll break a bitch off, no Kit Kat\nButterfingers, Snickers, you's a lick and I could hit that\nBaby Bone, in my city I'm respected and known\nTo all my enemies, but hate to admit that\nAnd the body frame so skinny\n5'5, but the moms, they still fuckin' with me, yeah\nAnd I gotta get my pennies up by any means\nIt's my energy, don't you fuck it up\n\n[Outro: RAMIREZ & Matthew Healy]\nCheck it out, bitch, you know I'm sayin'?\nI'm comin' through with Baby Bone just to let you know what it is and what it ain't\nI need my money in my hand, ho\nIf you don't bring these chips to my pocket, you know I'm sayin'?\nYou finna get a slap in the motherfuckin' face\nPalm up and everything\nPurse first, ass last, ho (Bitch)\n(MIA, cruisin' in the MIA)\n(MIA, cruisin' in the MIA)", "year": "2019-07-01"}]}