{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/2252a5e8174ec1374ba16f711a81fd68.1000x1000x1.jpg", "title": "My Thoughts on This Whole Danny Brown Oral Sex Thing", "year": null, "album": null, "lyrics": "At the moment, I'm on tour with Danny Brown. This means that in between hours of watching dudes smoking weed, I've had some time to start cultivating the sociological theories that will be the cornerstone of the book I'm writing on the weird and unexpected shit rappers do. We haven't been on the road for a week yet, but I've already got reams of material. This past Friday, in Minneapolis, the tour made some waves when a female fan pulled Danny's pants down in the middle of the show and started performing oral sex on him. The internet thought this was a big deal, so there are articles here, here, and here, mostly harping on the fact that Kendrick Lamar tweeted at Danny after he heard about the deed: \"@XDannyXBrown u really just got head on stage stanny???\"\n\nThe way I see it, there are two types of female Danny Brown fans: quiverers, and gropers. The quiverers are native internet users and are probably the ones who'll read this article, even though it's longer than what they're used to. They're the ones who watched Danny's Pitchfork doc 20 times, and they draw intricate portraits of him with colored pencils and have X's on their hands. I like talking to these girls because they are my kin, but when I do they either scoff at me because I’m not that cool online or they get all weird and don’t know what to say. They pay $75 to meet Danny before the show, and when he puts his arm around them in a picture, they quiver.\n\nThen there are the gropers, and the girl who blew Danny onstage is one of these. Gropers watch a lot of MTV and tweet about A$AP Rocky until YouTube recommends them “I Will,” which they listen to 500 times and don’t pay attention to anything else. They take everything Danny raps about 100% literally, and assume that before the show we're all backstage licking molly off each other’s buttholes. They often wear tube tops, even in Michigan where it was cold as fuck. Sometimes they come back to our hotel with us, and I’ve even parked their cars for them when they’re too drunk to drive. Usually I like them, because they all try to suck up to me and it's hard to hate people who are being extremely nice to you. I also usually like them because everyone should have the chance to seduce their favorite rapper.\n\nI fuck with both of these groups heavily, because Danny is great and I want him to have fans that appreciate his intelligence and also fans that will show him their boobs. I want him to have everything he wants, because he's my friend.\n\nHere's another thing Danny wants. Like anyone else, Danny wants to be respected as an artist and a human. Like any other male, especially those in the public eye (and especially those who spend a lot of time talking about licking vaginas), he wants to be respected as a “man.\" I'm only putting man in quotation marks because my ideal man is currently at home in NYC lighting cupcake-scented candles and taking bubble baths.\n\nBut we all know what happened last week at our show in Minneapolis, an event that we're currently referring to in the bus as \"The Thing,\" because we all kind of want to forget about it. Ever since it happened the universal respect Danny commanded has splintered into two groups: one side thinking he’s way more awesome than they should, and the other thinking he's an awful misogynist and hack. This bothers me a lot. Him too, but mostly me. I’m mad as hell, to be honest.\n\nI’m mad that a person thought it was okay to pull another person’s pants down during their performance in front of about 700 other people. I’m mad that a person thought it was a good idea to perform a sex act on another person without their consent. I’m mad that nobody made her leave. I’m mad that Danny had to actually wonder what he was supposed to do at that point. I’m mad that when I went home and said I had no respect for that girl, I was attacked for being a “slut-shamer” (after literally leading a girl to his hotel room at 3AM at her request) and, even more outrageously, for being jealous of the girl who sucked his dick. I’m mad that when two dudes pulled my pants down onstage, other people got mad too, but when it happened to Danny the initial reaction was like one big high-five. I’m mad that people are treating \"The Thing\" like it’s some legendary event. I’m mad that even though they know exactly who the girl is, nobody in the media will even talk to her. I’m mad that I get a bunch of emails a day asking me to talk about my best friend’s “misogyny” and “classless behavior”, from people who have heard only rumors and seen only one very blurry and inconclusive iPhone photo.\n\nI won’t go into detail about the actual events because I was pretty drunk and I don’t want to tell the wrong story. I will say that it happened so quickly that nobody I talked to after the show even knew anything had happened (there was only one photo and no video—how rare is that). I will also say that whoever wrote on Reddit that Danny was “walking around the stage getting girls to grab his dick” is 100% false, and to blame someone for their own molestation is a shitty thing to do. Anybody who is exaggerating this tale to climax is also a lying fool, and to call it a blow job is even going a bit far because it was probably the fastest thing I’ve ever seen. \"The Thing\" was not a thing that Danny facilitated—it was an actual sexual assault, and somehow nobody gives a fuck about that but me.\n\nIt's obvious that the reason nobody cares is because a girl did it to a boy. I said this on my blog, but I’ll say it again here—I had my pants ripped off onstage, and didn’t know what to do either because being naked in front of 1000 people is incredibly scary and there’s not much quick decision-making happening in your brain during that sort of thing. Now I’m prepared to kick a motherfucker in the teeth if he touches me at all, and I equip myself with giant boots for that reason. What is Danny supposed to do? The girl was at mouth-to-dick level already and to push her away, he would've had to either pushed her face or kicked her, and even the most gentle of either motion would immediately be labeled “abuse” by anyone watching. Guys pushing girls is not a good look when people are taking photos. So what was Danny supposed to do, other than back away, which he did? And if he had figured out a way to gently push the girl off him immediately without looking like he was smacking her in the face, he’s faced with attacks on his masculinity by every douchebro in the building. Yo dude, you don’t want your dick sucked, bro? Are you gay? Haha you’re gay you don’t want girls to suck your dick haha gay dude bro man swag! And that’s a rapper’s literal nightmare.\n\nSo now we all sit in this van and play videogames and check our Twitter mentions and don’t speak at all of \"The Thing,\" because it’s all we’re thinking about and it’s very lame. First of all, accusing me of being jealous is hilarious, because I’m like getting married and whatever. Also I have no qualms with sluts. I love sluts. I’d walk a slut walk if I liked my body enough. Also, does Minnesota really have that little going on that this is the biggest headline they have? The answer is yes, but even so, why doesn’t Ricky Smiley or whoever just talk to this girl? I know why. It's because everyone wants the option of blaming it on Danny, because people can’t accept the fact that a white girl raped a black dude in front of a bunch of people.\n\nWe all read To Kill a Mockingbird, and if we didn’t read it we at least read the SparkNotes, so unfortunately I'm sure this girl will never be brought to justice anywhere besides my stupid Tumblr. But to watch my best friend go through this weird racist/sexist sensationalism is 1% exciting and 99% heartbreaking, and I feel like actual Scout Finch at the moment so I will leave you with this statement:\n\nI am a small white girl who does have society’s permission to at least attempt to kick the shit out of you."}]}