{"songs": [{"year": "2012-01-01", "title": "Tell Lie Vision", "image": "https://images.genius.com/36bad11771c31ec8c20394a0020dd3d0.225x225x1.jpg", "lyrics": "[Intro]\nI want the young motherfuckers in here tonight\nNo matter what your nationality is\nTurn the motherfucking TV off for one week\nAnd see if you can survive\n\n\n[Verse 1]\n\nClick, Click\nYou've been brought in to the tube\nThe message gets projected that alters your mood\nAn infectious deathwish right in front of your face\nGlorification of tanks, bombs, guns and grenades\nCall of Duty: Black Opses, military control\nNot the game but how they engauge you to enroll\nReality shows influence hatin' the boss\nContradicting programs, food challenge, weight loss\nExploitation of blacks, fights posted on the Internet\nBinary codes now promote smoking cigarettes\nTrick-knowledgy but the knowledge is trick\nSo you buy bigger things to compromise for your dick\nPlastic surgeons, fake tits, strips to racist themes\nSex addiction, cocaine, we host a place for fiends\nSixteen pregnant gang wars, rapists and crime\nLose control, die, LCD raping our minds\n\n[Verse 2]\n\nIt's a media brain trap\nWe became slaves to the screen\nCorporations run stations on the station we see\nOdd attention into poverty, the threat in economy\nThe pressure of providing with the message of autonomy\nSuicide, murder, drug dealing police\nPill poppers, prostitutes, what's real in the streets\nIt's the beef, the conflict, the overload of aggression\nIt's the power struggle leading to the mode of depression\nWe love the entertainment when the cameras go up\nMillionaire aspirations in the bad girls club\nCops 'n' robbers, mobsters, we're stable for days\nCan't afford a decent meal but the cable is paid\nIt's more than Big Brother, this is brain control\nDeleted emails are saved on a station in Rome\nThe Kinect for Xbox scans your body for heat\nIt sends rays through your brain til your body's diseased\n\n[Outro]\nIt's called \"tell a vision\" programming\nThey tellin' you visions being programmed. You bein' programmed\nYou watch it on the news, 'It was on CNN, it's true. I seen it on FOX, it's real.' It's BULLSHIT!", "album": null}], "artist": "Sabac"}