{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Big Daddy Kane]\nPeople people, we gotta get over\nBefore we go under, and I wonder\nWhy we can't find a little piece of mankind\nInstead of always step back, gimme my damn nine\nLivin the thug, like the shoot up the drug type\nThey love to hear the people sayin, \"Yo that kid is bugged right?\"\nJust a game, so please, out here men die\nThe average black man today don't make it to see twenty-five\nCause someone else got the clock rocked\nTryin to get the neighborhood locked, to be the new man on the block\nBut if you asked me who's the man I'm like, \"You tell me?\nI don't know, Ed Lover, Dr. Dre and Heavy D?\"\nI got my mind on comin up, if not in first place\nThen damnit I plan to be the first runner up\nBut it seems, I got a lot of problems under my belt\nAnd everday I gotta ask myself\n\n[Scoob]\nAh what's goin on, in our society\nWhat's goin on, in a de country\nWhat's goin on, in your community\nWhat's goin on, tell me\n\n[Reggae chat] - can't translate\n\n[Big Daddy Kane]\nI seen a kid freshly dipped with mad gold\nFifteen years old, with plenty drugs bein sold\nBut then somebody caught him for his Air Jordans\nHis drugs the cash and the jewels he was sportin\nYou wanna call your girl a B-I-T-C-H\nYou can't appreciate so now she's humpin your man, then she ain't\nCause when you teach her that ho mentality\nThey accept that as reality and give all your friends the skin\nYou need to show some love for your people\nAll men are created equal, that's why with everybody I always\nSpread love, and keep my pockets full of dol-dollars\nBut check it out now\nWe're not the uncivilized, the Kane?\nSo let's get it together, man we did it when we were slaves\nInstead of always tryin to blame someone else\nTake a look around, and ask yourself\n\n[Scoob]\nAh what's goin on, in your community\nWhat's goin on, in a dis country\nWhat's goin on, in our society\nWhat's goin on, whoahhhh\n\n[Reggae chat] - can't translate\n\n[Big Daddy Kane]\nNowadays it's all about provin you ain't nuttin soft\nAnd everybody's always talkin about bustin off\nBut that ain't where we gotta go, kid we can throw\nAnd handle this thing like Holyfield and blow\nThen when we get it off our chest, let's put it to rest\nAnd try to make some money progress\nBecause if I got a dollar, and you got ten\nAnd you can get a hundred from a friend if five others kick in\nShoot, we can take that stack and put it back\nIn a community that's black, to make our people attract\nLike somethin magnetic, cause word is bond it's pathetic\nWe always talkin about this piece of the pie\nBut it seems we can't get it\nUnless we field the life of a drug dealer\nAnd start stellin llello but you know where they go\nUp to the penile, because they chose to be wild\nAnd now you're upstate kid, uh, waitin patiently to see trial\nNow let that whole gangsta route slide\nThere's too much money and skins here on the outside\nFor me to ever let my freedom go\nCause I got mine, now get yous, and let me know\n\n[Scoob]\nAh what's goin on, in our society\nWhat's goin on, when you nah haf no money\nWhat's goin on, people on the street\nWhoahhh, why is it so..\n\n[Reggae chat] - can't translate", "image": "https://images.genius.com/c57181cdaaeb4f7bcf3a5a0f89a83315.1000x1000x1.jpg", "year": "1994-09-13", "title": "W.G.O.N.R.S.", "album": "Daddy’s Home"}]}