{"artist": "50 Cent", "songs": [{"album": "God’s Plan", "image": "https://images.genius.com/7488990258b7e75bb8e35de7a131ec87.697x694x1.jpg", "title": "If Dead Men Could Talk", "lyrics": "[50 Cent]\nHold up\nSon them niggas know who hit that nigga son (I know, I know)\nThey - how the fuck, we gon' know who hit him, and they don't know who hit him?\nThe hood talkin man, e'rybody know~! (I know, it's fucked up)\n\n[Intro]\nNow I lay thee down to sleep\nNiggas try and lay me down wit heat\nAnd if I should die though before I awake\nI pray my Lord my soul to take\n\n[50 Cent]\nIf dead men could talk in your sleep your homey told you who got him\nWould you have the heart to shoot the nigga that shot him? (Huh?)\nOr would you start switchin upv\nYou thinkin 'bout the penitentiary and bitchin up?\nWhat if he said money ain't everything, the hood raised us wrong\nAll jux'll get your money long but look here I'm gone\nWould that touch your heart? Have you feelin funny inside?\nWould that be enough to make your punk-ass ride?\nWhat if he gave you a little list of things to do?\nSaid he wouldn't have to die, he could live through you\nWould you load the gats, and get ready ro ride\nOr would you lock the door at yo' crib and hide?\nIt's a cold world even when it's hot outside\nWhether sunshine or rain, you still feel pain\nHit him cause he was your strength, now you in a daze\nYour homey turnin over in his grave... cause you PUSSY!\n\n[Hook: repeat 2X]\n\"Y'all know who killed 'em, filled up\" - B.I.G. {*repeat 3X*}\n\"Y'all know who killed 'em, filled up with the lugers from they Rugers or they Desert\"\n(RIGHT~!!)\n\n[50 Cent]\nThem boys smoked your homey, ye ain't gon' do nuttin back?\nNot even if he told you you next to get clapped?\nIt don't take much for them shells to make the best of you\nYour peoples gon' probably cremate and burn the rest of you\nYou done did too much dirt to try and make it to heaven\nNigga is you down for this 1-8-7?\nWhen you reach the pearly gates, how you gon' explain\nYou gon' try and tell God you've been framed?\nY'all did everything together, he was your dog\nNow you Uptown coppin, and he in the morgue\nThem niggas he gave packs to, they kept the cake\nHis sister and his baby momma talkin to Jake (uh-huh)\nNiggas that rocked him, they came to the wake\nBut they ain't come inside, they sat out in the ride\nAt the funeral, homicide all in the buisness\nWalkin 'round askin niggas to tell 'em who did it\nNiggas is throwin blows now you ready to rumble?\nThirsty niggas are animals, the hood is a jungle\nBroke nigga'll body somethin over a bundle\nMan a three-year-old kid in my hood know what a gun do\n\n[Hook] - repeat 'til 15 seconds left\n\n[Outro]\nSha Money, XL!\nShadyville, teamwork, music", "year": null}]}