{"songs": [{"lyrics": "[Intro: Jay-Z]\nUhh, yeah, uh-uhh-uh\nUh-huh, uh-uh-uhh, uhh, uhh\nI ain't tryin to be rude dude\nBut give a nigga some space\nI ain't tryin to be rude dude\nJust, give a nigga some space\nJust tryin to talk honey dog\nI ain't got time to waste (check it)\n\n[Verse 1: Jay-Z]\nWhy is you over here lookin' at me\nWhile all these girls up in here?\nWhat you gay? Nigga, Jay straight like Indian hair\nY'all don't want me to spray the semi in here\nI mean if you a fan I consider you fam'\nBut shake a nigga hand, well shit god damn\nAll that (\"Do you remember me dawg?\") Nah I'm drawin' a blank\nYou got me feelin like a fish, in a fish tank\nJust think, if you came to a club\nTryin to find a little hon for some one-night love\n'Stead you got another nigga all up in your mug\nYou make me uncomfortable thug, go thatta-way!\nAnd kill the ice grill holmes\n'Cause I keep enough heat to melt that away\nI came in some sweats, I came to get met\nTryin' to find a chick that make it hard for me to \"next!\"\nWe exit stage left, hop in her Lexus\nTreat me like a baby, mouth on her breast-es\n.. may I suggest that it's\nA lot of long-legged chicks in short-ass dresses\n.. go find you one\nGo get your dance on, go grind on one, damn\n.. go find you one\nGo get your dance on, go grind on one\n\n[Chorus: Jay-Z]\nQuick question - yo, why you over here?\nSo many hoes in here\nMy office hours 9 to 5, whyon'tcha call me there\nIt's so many hoes in here\nI ain't tryin' to be rude dude, whyon'tcha disappear?\nThere's so many hoes in here\nI understand you got issues but I really don't care\nThere's so many hoes in here\n\n[Verse 2: Jay-Z]\nYeah yeah yeah I know you rap and your sister spit too\nYou been callin' the office and you can't get through\nI understand all that, but now ain't the time\nI came to the club to get that off my mind\nAnd all you thugs with your war stories startin' to bore me\nI ain't tryin' to hear about your guts and glory\nI'm tryin' to hear B.I.G. and some cuts from N.O.R.E\nAnd you keep talkin' over the beat like Clue (\"Do you remember?\")\n.. go find somethin' to do\nYou're a janitor, go find somethin' to screw\nDisappear like Copperfield, go cop a feel\nPlay hide and seek witchaself for real, huh\nThe chick came dressed up just to get messed up\nShe got her hair done, just to get it sweated up\nShit I'm tryin' to help her out\nWhyon'tcha help me out and be out?\n\n[Chorus: Jay-Z]\nQuick question - yo, why you over here?\nSo many hoes in here\nMy office hours 9 to 5, whyon'tcha call me there\nIt's so many hoes in here\nI ain't tryin' to be rude dude, whyon'tcha disappear?\nThere's so many hoes in here\nI understand you got issues but I really don't care\nThere's so many hoes in here\nJeah, jeah, jeah\n\n[Timbaland]\nYou're invadin' my space\nYou need to, be easy, ahh\nYou're invadin' my space\nYou need to, be easy, ahh\nYou're invadin' my space\nC'mon dawg, be easy, ahh\n\n[Timbaland]\nUh-uh, I don't know why they do that\nHeh, I don't understand\nHeh, what you need to do, is..\n\n[Timbaland]\nStop spittin' in my face and go talk to them hoes in here\nStop spittin' in my face and go talk to them hoes in here\nStop spittin' in my face and go talk to them hoes in here\nC'mon dawg, stop spittin' in my face and go talk to them hoes in here\nBe easy", "title": "2 Many Hoes", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}