{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/b00bc126ff085dc7857c5c0135e584cf.640x640x1.jpg", "title": "The Big Bang", "year": null, "album": "Gift Raps", "lyrics": "[Verse 1]\nThank god a nigga saw another year\nBesides almighty god I dont have another fear\nThe big bang the same as anarchy right?\nImagine niggas in the hood with no passion for Christ\nYikes, blowing niggas out they Nikes\nBefore shit hit the fan I'm a grab me a flight\nSt. Thomas beach house\nJamaica for the winter\nSeasons South Beach summer\nThen bring it back to Cleveland\nFor the weekend\nScoop up my niggas before the world end\nTake ‘em to the planet I be hurled in\nYoung nigga on some grown man shit\nGetting more bread than yo old man get\nThe finest women that you ever seen at my crib\nFixing me up big ass sandwich and shit\nOh yeah boo, hurry up and roll up\nBefore the world blow up\nShe turned back and said sure enough\n\n[Hook]\nCause now they trying to compare god to Santa Clause\nDammit y'all we was doing good what happened y'all\nLock us up for weed when we dying from alcohol\nCigarettes, Xanax, ex and adderall\nWhat happened y'all?\nWhat happened?\nWhat happened y'all?\nWhat happened?\n\n[Verse 2]\nKnowledge is power but wisdom is even stronger\nI won't be fucking with these leech as niggas any longer\nThese tattoos and for decoration they represent pain\nFrustration trying to exercise my fucking will to gain\nIn this world where it wasn't designed for me to shine\nI took mine, gimme that shit you better respect my fucking mind\nYou niggas ain't saying nothing your time has come to an end\nI’ve been blessed with this voice to make you niggas comprehend\nUnderdogs to the fullest, fuck you was in my facial\nBut thank you, to all my supporters I'm very grateful\nFateful, and I promise not to waste you niggas time\nThem niggas ain't saying nothing these words to live by\nBe aware of what's real and whats not\nCertain products that we consume we should stop\nStay away form high fructose corn syrup\nThese niggas think they slick trying to poison the whole world\n\n[Hook]"}]}