{"artist": "Fat Joe", "songs": [{"year": "2011-10-31", "album": "The Darkside Vol. 2", "image": "https://images.genius.com/f2f9e529c5e6328625a53474a16fcb2a.640x640x1.jpg", "lyrics": "[Intro: Keisha from New Jack City]\nI mean what, you goin' crazy over this?\nI mean, really it look like, cracked off pieces of soap\n(Mark Henry...)\n\n[Verse 1]\nYeah, you's a pussy boy, you heard that pussy boy?\nYa daddy should have never nutted in that hoe's pussy, boy\nBut since you on this earth, it's time to take you off it\nThis what you want, huh nigga, that hardcore New York shit\nThat black cement, 3 Jordan shit\nTrue religion -- jeans, Polo tee and a Portland fit\nNo defense when I grip the handle, boy\nI got a deadly shot, no Brandon Roy\nMy niggas in Detroit call me Megatron\nBack in '88, we moved mega tons\nNow I push the 'Rari down 8th Ave\nBitch face on my lap, call it face math\n\n[Interlude: Wesley Snipes from New Jack City]\nThe Colombians and the Dominicans have shown us the way\nThe shit is large, but we gon' do it differently\nGone are the days of sellin' on a street corner\nYou change the product, you change the marketin' strategy\n\n[Verse 2]\nYeah, uhh\nThe streets lookin' like Thriller\nMinus the chick and red jacket with the zippers\nJust zombies, psychos and killers\nQuick to choke you out, ya (?), Reggie Miller\nIt's a drought, we need a hurricane\nBoat movin' slow, niggas screamin' \"hurry, 'caine\"\n3 pistols on me just in case you tryin' to bang\nI got that 9-9-9 plan like Herman Cain\nYeah, we occupyin' raw street\nGood morning, no sugar in the coffee\nJust cocaine, Medina and some morphine\nOne whiff of the pure, make ya jaw lean\n\n[Outro: Wesley Snipes from New Jack City]\nI'm not guilty. *You're* the one who's guilty\nThe lawmakers, the politicians\nAll you who lobby against makin' drugs legal\nJust like you did with alcohol durin' the prohibition\nYou're the one who's guilty, ain't no Uzis made in Harlem\nI mean, not one of us in here owns a poppy field\nThis thing is bigger than Nino Brown\nThis is big business, this is the American way", "title": "Big Business"}]}