{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/692606fdd3b8633e17a5f02a90ec07ac.500x500x1.jpg", "title": "So Glorious", "year": "2010-05-17", "album": "PL3DGE", "lyrics": "[Intro: Killer Mike]\nMan, my story is, so glorious\nYou know, I started off so notorious\nI will die a legend like Notorious\nMy story is, so glorious\n\nGrind, grind, grind, grind, grind, shine!\n\n[Verse: Killer Mike]\nMy story is, so glorious\nFat fly boy, young Notorious\nNotorious, for move makin'\nI got a pistol for a pig, cook bacon\nI'm a young G\nI'm a E.V., educated villain\nWho fuckin' with me?\nI'm a book reader\nI'm a gang leader\nTriple bang and salute when the gang see him\nI'm in position that these other rappers envy\nThey major, broke, and I get rich indie\nYeah, I said I Get-Rich-IN-D\nTrill definition of that G.R.I.N.D\n\nGod looked out, because my life changed\nIt weren't for rap, I'd have a job of sell cocaine\nThey say I celebrate the pusher, that's profane\nI say to feed my babies y'all I'll do anything\nI'll sell H, I'll sell C\nBecause Malik, Aniyah, Pony, Mike have gotta eat\nAnd I refuse, cause I promised I would not lose\nUntil I'm gone, I'mma give these sucka' niggas blues\nHere come the blues, nigga!\nYoung Muddy Waters\nIn the club sweating hot with your Slutty daughters\nYoung 8Ball, on my way to legendary\nEven Pun will have to point and say, \"That nigga's very heavy!\"\n\nTo son me, you gon' have to get a Bun B\nBecause the Pimp C in me won't let you pump me\nAye watch your mouth nigga\nI'm from the South nigga\nAnd you might smell my cologne at your house nigga\nMoney, money, money\nSeems that's all that I'm about, nigga\nI got a bad queen\nShe want a lot of things\nAnd she gon' have it all\nTear down the mall\nGood riddance to my ex-bitches, I holla y'all\n\nI see you and your new nigga at my show\nHe love Pledge 2, he love song 4\nI love the West side, I love Zone 4\nDixie Hills, Simpson Road that's what I do it for\nMartin Luther King, Bankhead and Ashby\nBut now it's Lowery\nThat's where the loud be\nAnd everywhere I be that's where the crowd be\nBut I'm a street nigga, partner don't crowd me\nAnd don't push me, and don't shush me\nCause I'm the opposite of whatever is pussy\nAss nigga, you ain't talking cash nigga\nThen it's lost in translation\nGet up out my face and\n\nGo to the room where the sucka' niggas sit\nSit around and talk some of that sucka nigga shit\nThe way y'all cackling (?) is like y'all sucking nigga's dick\nNo homo promo, but y'all suckas acting like a bitch\nI fell off and came up again, I am 50 Cent\nI know you don't love me\nI'm black and I'm ugly\nBut I got money, so these fly bitches fuck me\nAnd I got hits now, so you haters can't duck me\n\nMy life has turned to magic, this is David Copperfield\nThe pretty women hug me and beg for me to cop a feel\nThem crackas call a nigga they want me to cop a deal\nBut I don't talk 360 unless we talking 'bout a mil\nIf they talking major money, we can talk and that's what up\nIf they ain't talking 'bout that then I remain indie as fuck\nThey say I'm underrated and they sorry for my loss\nAnd I reply I'm sorry that y'all broke and got a boss\n\nOn Pledge 1 I told the world what I'm about to do\nThe blind couldn't see it so I showed 'em Pledge 2\nGod In the Building had to help 'em gain focus\nPledge 3 is here, I give you the magnum opus"}]}