{"songs": [{"year": null, "title": "Best Mistake", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro - G. Martin (Saigon)]\nDa da-da-da-da, da-da, da\n(\"Man, are you crazy!\")\nDa da-da-da, yeah, yeah\n(It's from the heart)\n\n[Chorus - G. Martin]\nGirl I did you wrong (did you wrong) I hurt you bad (I hurt you bad)\nBut you must admit, I'm the best mistake that you had\nI didn't mean to hurt you baby, I know I don't deserve you lady\nJust know that I ain't perfect lady, but I gave you a beautiful baby\nAt first our love was strong (love was strong) then it all went bad (it all went bad)\nBut I must admit, you're the best mistake that I had\nYou didn't mean to hurt me baby, you know you don't deserve me lady\nI know that you ain't perfect lady, but you gave me a beautiful baby\n\n[Adlibs over Chorus - Saigon]\nLook...\nLook what we did, uhh\nI did... look\nLook what we did\nJust look at our kid\nUhh, uhh, uh\n\n[Saigon:]\nI done been called e'ry kind of dog you could think of\nFrom a big Great Dane on down to a small Teacup\nReason I don't speak up, it's not a lot of truth in it\nIf I'ma get accused of it you gotta have some proof of it\nHow you gon' say Brian Daniel a Cocker Spaniel?\nLike I'm runnin 'round with way more women than I can handle\nThis is like a (Scandal) minus the Kerry Washington\nHard for me to breathe, it's takin my very oxygen\nI got a reputation, it's all speculation\nMe and her wasn't goin nowhere, so I changed destinations\nOnly problem is we share the same offspring\nThis shit takin its toll and it's costing\nThough she probably feelin lower than the Everglades\nThough her life probably seen a lot of better days\nGot to admit that when she look into that lil' face\nShe knew I was the best mistake she ever made (ha ha)\n\n[Chorus]\n\n[Saigon over Chorus:]\nI did, I know I did\nLook...\nJust look at our kid\nJust look what we did\nUhh... I did...\nBut you, uhh, let's go\n\n[Saigon:]\nI stabbed my teacher with a pencil in the second grade\nCrashed a brand new Benz into an Escalade\nBut got to admit that when I look into that lil' face\n(What?) I knew you was the best mistake I ever made\nThe devil gave me a lie detector test\nAsked me if I ever loved my baby mom and I said yes\nHe said \"You know that this is life or death\nAnd if you lie you die so tellin the truth is what I suggest\"\nI looked at the devil and I said yes\nBlinked twice then that nigga took my last breath\nI guess, I never really loved the mother of my offspring\nThis shit takin its toll and it's costing\nThough she probably feelin lower than the Everglades\nThough her life probably seen a lot of better days\nGot to admit that when she look into that lil' face\nShe knew I was the best mistake she EVER made!\n\n[G. Martin (Saigon):]\nGirl we should try to get along (think we should try to get along)\nIt's hard because the love is gone (it's like the love is all gone)\nYou got mine, I got yours, and I thank God for lookin out for us\nThis gift that you gave to me means eeeeeeeeverything (sing!)\n\n[Chorus - first half]\n\n[Saigon:]\nIf I was a mistake, and you was a mistake\nThen how can two mistakes create somethin so great?\nEvery day I awake and I look in that lil' face\nI see beyond the bitterness, it diminish the hate (yup)\nFor the next 18 years we gotta orchestrate (what)\nA way to correlate, it's a fine line but I walk it straight\nFor my son and my daughter's sake\nSo when they get older they listen to this song and see OUR mistakes\nIt's fate\n\n[Chorus - first half]\n\n[Saigon over Chorus:]\nI did, I know I did...\nLook at our kid\nJust look what we did", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}