{"artist": "AZ", "songs": [{"title": "Hold No Grudge", "image": "https://images.genius.com/fb708d94440fffe20eb3e9b4d6487268.297x297x1.jpg", "album": "Decade 1994-2004", "lyrics": "[AZ talking]\nThis is vintage\nAllow me to vent\nStreet of course, gangsta because its necessary\nHomie to homie\n\nUnited we stand, divided we fall\nOnce divided, both got excited to ball\nPlans on living major, no intentions to fall\nAnd if indicted, guess the judge would be lynching us all\nFrom breadcrumbs we made a loaf, it made us close\nChampagne toast, our glasses to the game in our oath\nBut its funny, so many stories go untold\nUntil faced with incarceration and shit unfold\nWas we ever friends or was we just chasing the win?\nSo many niggas wanting paper just to make it and spend\nPurchase jewels, get a whip, lace it with rims\nGuess greed's the state of mind, must escape in the wind\nLike so many plots, guns played a part in our feuds\nFor the fact nobody got shot, shit was excused\nGuess its all the game we go through in life sometimes\nWin or lose, you pay dues in this life of crime\nMade for thugs in the world of sex, money and drugs\nLove is love, but live niggas hold no grudge\n\n[someone talking]\nWhat up son? We was gully from day one\nIf we had drama, both'll bust our gun\nFeds came with 848's, it wasn't hard to find K-1\nI was the pure mastermind of organized crime\n\n[AZ]\nI touched more than the average nigga's touched in this game\nHow many niggas fucked stewardesses up in a plane?\nLived the best of worlds till the shit went foul\nFrom rich to being fucked up and wondering how\nWas it the, negativity all in my midst?\nGetting sick of all the cars, bitches all on my dick\nGuess that there was the living that burned me out\nFrom the hoes, clothes and money rolls that turned me out\nPaperchase, saw the whole shit explode in my face\nYoung hustler, with good intentions going to waste\nIs the road that we all take, thinking its right?\nHypnotized by all the bright neon lights in the night\nFascinated by the pretty things and growing wealth\nCan saturate the mindstate and make you go for self\nMade for thugs in the world of sex, money and drugs\nLove is love, but live niggas hold no grudge\n\n[someone talking]\nY'all niggas trying to shine\nBack in the day, we was before our time\nWe had more determination on our mind\nThan all the big niggas in the Fed joint combined\nY'all need to wake and get this money\n\n[AZ]\nWas it all a dream? Sometimes I sit and I laugh\nWas it for the cream we sit there, subtracting the math\nReminscing how we had it smashed, chopped it in half\nFirst Lex coupe kitted, niggas copped it and crashed\nMoving fast, still kept the cops on our ass\nThank God for the radars on top of the dash\nWhat a life, scrambling nights\nWas it right, or was we just hustlers caught in the hype?\nPoor or rich, I suggest niggas never to flip\nIts cheddar to get, today we get whatever and split\nSo till death do us, from O.D.-ing with the Tech shooters\nTo Lex Lugers in this game full of late doers\nMade for thugs in this world of sex, money and drugs\nLove is love, but live niggas hold no grudge\n\n[someone talking]\nI know the game is y'all fix\nRule number one, anything can happen in the mix\nReal niggas don't lie and real niggas don't die\nThey get eye to eye and meet each other halfway across the sky\nThats why we stand like we stand, talk like we talk, bop like we bop\nJump in the motherfucking Maybach, and hop like we hop\nKnow'm sayin? We been doing this shit since British Walkers\nLees with the sown-in crease, ten thousand dollar Jesus piece\nRooftop of V.I.P., fondling Patrice\nWhose that, whoever the champagne kings meet\nNow y'all niggas into rap and don't know how to act\nTalking like y'all retarded, y'all niggas wasn't getting G packs\nYou know about the real acts?\nMetro, Scorpio, Socker T...\n{*begins to fade out*}", "year": null}]}