{"songs": [{"lyrics": "[Intro: Vast Aire & Aesop conversing]\nYo, (Alright Ok)\nCan I get a quarter or something?\nLittle hungry, you know what I'm saying? (Alright Ok)\nHomeless...\nI need a loosey, yo...\n(Yo...)\n\n[Verse 1]\nWalk into the store with a pocket full of nickels\nAnd a city full of horns, jackhammers, and rape whistles\nThe alley cats manipulate the blocks with gutter magic\nToday my heart beats only out of habit\nCheck it, it's like..\nMy man Jus used to keep an ox between his teeth\nSaid he could spit it with pinpoint accuracy if there was beef\nWe chuckled out loud\nStill the thought of it intrigued me, (right)\nSo now I keep a jackal under my tongue to spit with related reasoning\nThe earthworm turbulent murder burnout Gerber baby no-brainer memoir stardom\nAlarmed, pardon the old buzz deader\nRobert Crumb ugly dumb image\nBarely sprung fairly numb grimace\nNearly cut cherry blood spicket wrists back in high school (now it's like)\nSlide, with a millipede pedagogue pirate\nNavigates city sump systems, urbanite turbines, twisted Pistons, Termites that infect sturdy grillage\nThere's roaches in the pillars, spillover\nAnd crawl across commuter-clean wingtips and loafers\nIt's the theme park I built\nPocket full of nickels for cigarettes, gum, and milk\nBitterness, love, and violence\nI'm writing a petition to have smoking as a sport\nIn the 2002 Summer Olympic Games (wanna sign it?)\nNow look, I jux germs draggin a gavel knee deep in a maggot hatchery\nOperation capture flag by any means\nIf this means anything at all, anyway it's a riddle\nWalking to the store with a pocket full of nickels\n\n[Segue 1: Vast Aire & Aesop Conversing]\nAy uh, yo excuse me (Ay Yo) yo\nCan I borrow a dollar or something? (Ah sorry man) Nickel?\n(Sorry man, I can't help you out dog) Quarter?\nSomething, man? (Yeah I only got enough for like cigarettes and shit man)\nAlright man, I see how it is. (I'm straight)\n\n[Verse 2]\nWalk into the store with a pocket full of nickels\nAnd a city full of World Trade Center victim candle vigils\nThere's anthrax in our mailboxes and Xanax in my tummy\nThere's a single Spanish female out west traveling the country\nFreak of Fantasia leak laser major. Running bases\nNeighborhood watch weasels pace in ugly acres more than often\nIf I ever make it big, I'm gonna build a skyscraper\nTall enough to piss on Cloud 9 egos from my corner office\nYou can't pull the plug on a catapult (nope)\nI toss a nickel to a bum's cup from twenty paces thumbs up\nGot twenty ways to tell you shut the fuck up\nNineteen of 'em are 24 bars long, the other one goes (SHUT THE FUCK UP!)\nAnimatronic daddy long legs stay grimy up in your zoning wall, gobbling villagers trying to hide behind the windmill\nI joust riding pig-back through subway tunnels with a third rail lance\nWhile most still try to penetrate the alligator glance (It goes)\nBack of the class, throwing pencils at professors\nIt made the Barbarellas giggle\nThat's when life's pleasures were simple\nNow it takes a dancing bear jumping through flaming hoops\nTo even make em buy the god-forsaken single!\nThou shalt not desecrate the soothing spiral\nOffered by a classic cut to vinyl\nFind that in the Bible!\nMiter saw militia fix ya up\nHow bout a pyramid shaped torso\nWith your hollow numbskull balancing on top\nNow if you gotta rock a gas mask outside of your own apartment\nYou could pretty safely quote Shamar\nLife's Ill, sometimes Life might kill, sometimes prayers dwindle\nWalking to the store with a pocket full of nickels\n\n[Segue 2: Vast Aire & Aesop Conversing]\nYo (ay what's up man?) Yo can I ohh...\nNo.. Never mind, man. (I can't help you out man)\nAsshole! (Yo man, I'm trying to help myself out right now)\nFucking asked you for a loosey and you turned me down. (Dog, I'm sorry dog!)\n\n[Verse 3]\nWalk into the store, same pocket, same nickels\nIn a city where every crack in the sidewalk's a symbol\nWhere there's crack in the basement, where there's krakens and slave ships\nWhere there's crack whores and corrupt pigs killing cats trying to crack cases\nMy boombox runs on a baboon heart transplant (This is hell!)\nI got a poltergeist on a leash trained by Carroll Ann herself\nTwo Thousand something...\nWhen technology ate itself glutton\nEvery move I make's from a robot gepetto pressing a red button\nIt's Vietnam in the fumes...\nSo I run with cannibals that bite the hand that feeds cuz it tastes better than the food\nThe prickly outer shell's genetic, it helps defense mode\nBut it also helped to fuck up a couple of sacred friendships\nWatch a six legged insect crawl out of the billy goat beard\nWatch a sick makeshift bitch threat fall out when the filthy smoke clears\nWatch the insect's stinger sting threat till it has sweat a bullet\nSweat a full clip, sweat a river, dead the bullshit, sail away and wither\nYou're the kind of cat that rolls a pimped out Caddy\nDropped with rims and limousine tints bumpin Enya\nInsert laughter here\nI wanna rap a lot and stack cheddar by the fistful\nBut for now, I walk into the store with a pocket full of huhh...\n\n[Outro: Vast Aire & Aesop conversing]\nExcuse me, man. (alright ok)\nCan I... Can I borrow a dollar or something to eat?\n(alright ok) I'm... I'm hungry\nI'm saying yo... (alright ok) (Look at that..)\nI'm homeless, man. (Look at that bum) (alright ok)\nI fought for this country, man. (yeah)\nSleep on park benches... starvin'\nAll I need is like a loosey and like a sandwich or somethin', man..\nWiping my ass with the Daily News man... c'mon man...\nSleepin' with squirrels... (Oh my god, What are you doing with that squirrel?)", "title": "Nickel Plated Pockets", "album": "Daylight", "image": "https://images.genius.com/7aee135d16898a4fac2a490d41fb0b19.600x600x1.jpg", "year": "2002-02-05"}], "artist": "Aesop Rock"}