{"artist": "Papoose", "songs": [{"album": null, "title": "Faces Of Death", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "I like to welcome ya'll niggas to Faces of Death... take a deep breathe... don't be afraid\nPapoose, let's go!\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nTake a taste of your flesh\nI break the plate in ya flesh\nI hope you takin ya breath\nCause this is faces of death\nI left the flesh molded\nCause I'm the best and all the rest know it\nI'm papoose, the life or death poet\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nA young hustla on the block selling his jacks\nThey told him he can't hustle now he dressed with his gat\nHit him right between the eyes, dead in the head with the mac\nHeard how his melon just cracked? Faces of death!\nFinally got her in the telly, she prettied that ass fat\nPulled out a condom, and she told you \"don't use that\"\nBut you ain't see the monkey is sitting right on her back\nNow you positive and you trapped, faces of death!\nStick up kids see a big woolie who flossin\nBack the nigga down and took his jewelry off him\nBut he ain't pat him down good enough and it cost him\nHe gripped up on the larson, faces of death!\nThis nigga drunk drivin while he smoking his ganja\nThey told him \"slow down\" but he told em \"I gotcha\"\nHe crashed, everybody died 'cept for the driver\nHe the only survivor, faces of death!\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nTake a taste of your flesh\nI break the plate in ya flesh\nI hope you takin ya breath\nCause this is faces of death\nI left the flesh molded\nCause I'm the best and all the rest know it\nI'm papoose, the life or death poet\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nThis wild nigga always known for pickin his gun up\nGot caught for a body from some nigga he stuck up\nThe judge gave him 25 to life, he f*cked up\nWent to his cell and hung up, faces of death!\nThis girl got a boyfriend, she taking him seriously\nShe love him so much that he broke her virginity\nAfter that he called her and told her it was quits\nShe went in the room and slit her wrists, faces of death!\nThis lady goin' to work tryin to feed her children\nThe ain't know it was war cause she just a civilian\nTwo airplanes crashed into the buildings\nShe got crushed by a ceiling, faces of death!\nA father left a loaded gun under his mattress\nHis 4 year old son walked in and grabbed it\nHe thought it was a toy so he cocked it and clapped it\nHis body fell down backwards, faces of death!\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nTake a taste of your flesh\nI break the plate in ya flesh\nI hope you takin ya breath\nCause this is faces of death\nI left the flesh molded\nCause I'm the best and all the rest know it\nI'm papoose, the life or death poet\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nThe projects look like oversized tombstones\nGuess the ghetto is a graveyard, we do em homes\nBeen here before, so my spirit carry a used soul\nMy soul can't carry my flesh, so I use bones\nI'm a death poet, through life I consume poems\nWords can't kill em, so I use chrome\nNext time you looking in the mirror, you better pinch your flesh\nMake sure the face in your mirror ain't a face of death\nNext time you eating your food, take a deep breath\nMake your the taste in your mouth ain't a taste of death\nNow I laid me down to sleep\nI pray to lord my soul will keep\nIf the reaper come for me I put a hole in my sheets\nEvery time I go to sleep I sleep holdin my heat\nIf these upcoming rappers die before I wake\nThe industry will be mine and I get all this cake\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium\nTake a taste of your flesh\nI break the plate in ya flesh\nI hope you takin ya breath\nCause this is faces of death\nI left the flesh molded\nCause I'm the best and all the rest know it\nI'm papoose, the life or death poet\nI take the grace from him\nBreak his fate when I'm blazin him\nPlace him straight in the grave and then\nTake his fate off the face of his cranium", "year": null}]}