{"songs": [{"album": "The Real World, Vol. 3", "year": null, "title": "Still Thuggin’", "image": "https://images.genius.com/1083d2758ed9a9c6199a687df4188409.512x512x1.jpg", "lyrics": "[J. Stalin]\nMama I'm still thuggin, but I still pray\nIt ain't your fault a nigga ended up sellin' yay\nIt ain't your fault I was goin' down the wrong way\nMama I'm still humble, you raised a real hustla\nGave me the third eye to see them fake mothafuckas\nTold me change my ways cuz' we livin' in the last days\nI was livin' fast all I can say is crime pays\nYou smoke but never let me go without the new J's\nMama I'm all around, cuz I'm a star now\nIf (?) was alive, he'd be so proud\nSome how, I came out the dark clouds\nJust like when I stopped smoking black and milds\nMama I'm not a child, you'd be so surprised\nAt times I think you can see the black in my eyes\nThe world is a maze, life is a game of spades\nBut I can separate the angels from the devils\nMama this shit crazy, I play with heavy metal\n(Mama this shit crazy, I play with heavy metal)\n\n[Hook]\nMama I'm still thuggin'.. The world is a war zone\nMy niggas is inmates, and most of em'  dead and gone\nThat's why I stay with my chrome.. That's why I stay with my chrome [x2]\n\n[J. Stalin]\nMama these eyes have seen a whole lot of tragedy\nThat's why I fuck with Jaz cuz I know he'll blast for me\nLivewire took over the game like a catastrophe\nNow every fuckin' gold diggin' bitch is after me\nWest Oakland remind me of Iraq, so many niggas I miss that ain't never comin' back\nThe niggas is sellin' coke, and the bitches stay on the track\nI'm whippin' and gettin' scratch (?)\nI'm hustlin' and stayin' strapped, but these haters don't like that\nGot it on me right now, I ain't gotta come back\nMama it's cold outside and the sky gettin' black\nTold me never get attached to nothing I can't leave\nAnd never believe in honor among thieves\nLivewire, you fuckin' with some real Gs\n\n[Hook]\nMama I'm still thuggin'.. The world is a war zone\nMy niggas is inmates, and most of em'  dead and gone\nThat's why I stay with my chrome.. That's why I stay with my chrome [x2]\n\n[J. Stalin]\nI really miss my nigga, that's why I be smoke hella weed\nIf I wanted to be professional I had to stop poppin' E's\nI appreciate the man that you made me\nDaddy was gone so West Oakland raised me\nI look like Gregory and act like (?) and even though we be fightin' like the navy\nNo matter what you do you're still my number one lady\nGot my shit together then I made the game pay me\nShe ain't raise a nigga to be lazy\nMy number one fans say these niggas can't fade me\nKeep a nigga grounded never let the fame break me\nShout out to my mom cuz I'll never forget who made me\nNigga shout out to my mom cuz I'll never forget who made me\n\n[Hook]\nMama I'm still thuggin'.. The world is a war zone\nMy niggas is inmates, and most of em'  dead and gone\nThat's why I stay with my chrome.. That's why I stay with my chrome [x2]"}], "artist": "J. Stalin"}