{"songs": [{"year": "2015-12-04", "lyrics": "[Hook]\nOoo you in trouble\nThey 'bout to send them folks to your front door\nOoo you in trouble\nWatch out for them foes, you know they cut throat, like\nDon't hold your tongue if you ain't scared nigga\nDon't hold your tongue if you ain't scared nigga, yeah nigga\nOoo you in trouble\nWatch out for them foes, you know they cut throat, like\n\n[Verse 1]\nAnd they be like \"you sound retarded\nWhy you talkin' all that shit, you just a artist\nObviously politics ain't yo' department\nYou gon' fuck around and make yourself a target\"\nAnd I'm just tryna do the right thang, do the right thang, ha\nYou the right slang, you the right slang, yeah\nSo just read up who own the stations that your favorite shows come on\nRadio stations your favorite songs come on\nThe truth ain't unknown, even the paper that I'm on\nShit even the label I'm on, shit even the paper that I own\nThe federal reserve ain't even owned by the government, I'm on some other shit\nI'm on a mothership, fuck are we voting for?\nWho is this congressman, Fortune 500's\nBe funding the Democratics and Republicans\nIn case you was wonderin'\n\n[Hook]\nOoo you in trouble\nThey 'bout to send them folks to your front door\nOoo you in trouble\nWatch out for them foes, you know they cut throat, like\nDon't hold your tongue if you ain't scared nigga\nDon't hold your tongue if you ain't scared nigga, yeah nigga\nOoo you in trouble\nWatch out for them foes, you know they cut throat, like\n\n[Verse 2]\nI'm sorry there's enough wealth in the States\nTo give a million dollars to each person and they still be straight\nI'm talking wealth too big to measure, cheddar that don't fit in the shredder\nTreasure that don't fit in a dresser, the best investor for a business endeavour\nBut you're distracted by the ratchets\nBy the racket, by the bad bitch\nThey broadcast the madness using the same crisis actors\nThey used for the last disaster but you didn't catch it\nRemember Katrina when they blew up the levees\nAll the people that said they was hearing explosions, they chopped out the edit\nTell me do you remember, or would you rather forget it\nIt's the sixth-Earth parellel world Armageddon\nBandz\n\n[Hook]\nOoo you in trouble\nThey 'bout to send them folks to your front ...\n\n[Skit]\n*Banging at door*\nPolice, get down! Fuck on the ground. Stop resisting\nI'm not resisting, I'm not - I'm not resisting. Y'all, do ya'll see this?\nTurn this shit off\n\n[Interlude/Outro]", "title": "Cut Throat", "album": "WATER (We Are The Enemy Really)", "image": "https://images.genius.com/0fb63f56a90a658f950a838126f7ce63.800x800x1.jpg"}], "artist": "B.o.B"}