{"songs": [{"lyrics": "Part 3: POLITICS As USUAL\n Poor people in general have a twisted relationship with the government. We're aware of the government from the time we're born. We live in government-funded housing and work government jobs. We have family and friends spending time in the ultimate public housing, prison. We grow up knowing people who pay for everything with little plastic cards — Medicare cards for checkups, EBT cards for food. We know what AFDC and WIC stand for and we stand for hours waiting for bricks of government cheese. The first and fifteenth of each month are times of peak economic activity. We get to know all kinds of government agencies not because of civics class, but because they actually visit our houses and sit up on our couches asking questions. From the time we're small children we go to crumbling public schools that tell us all we need to know about what the government thinks of us.\n\nThen there are the cops.\n\nIn places like Marcy there are people who know the ins and outs of government bureaucracies, police procedures, and sentencing guidelines, who spend half of their lives in dirty waiting rooms on plastic chairs waiting for someone to call their name. But for all of this involvement, the government might as well be the weather because a lot of us don’t think we have anything to do with it--we don't believe we have any control over this thing that controls us. A lot of our heroes, almost by default, were people who tried to dismantle or overthrow the government--Malcolm X or the Black Panthers--or people who tried to make it completely irrelevant, like Marcus Garvey, who wanted black people to sail back to Africa. The government was everywhere we looked, and we hated it.\n\nHousing projects are a great metaphor for the government's relationship to poor folks: these huge islands built mostly in the middle of nowhere, designed to warehouse lives. People are still people, though, so we turned the projects into real communities, poor or not. We played in fire hydrants and had cookouts and partied, music bouncing off concrete walls. But even when we could shake off the full weight of those imposing buildings and try to just live, the truth of our lives and struggle was still invisible to the larger country. The rest of the country was freed of any obligation to claim us. Which was fine, because we weren't really claiming them, either.", "title": "Decoded: Part 3 (Excerpts)", "image": "https://images.genius.com/cd82af9edae1d0812bf89a57ee3a25ba.722x890x1.jpg", "year": "2010-11-16", "album": "Decoded (Excerpts)"}], "artist": "JAY-Z"}