{"songs": [{"image": "https://images.genius.com/54500d80e30b81f3a2607247d50c3cf6.600x600x1.jpg", "year": "2012-06-22", "title": "Bang, Bang, Bang", "album": "Awesome EP!", "lyrics": "[MAKING OF THE BEAT by DJA]\n\n(Verse 1)\nReality's harsh, so I dream through it\nTry to give exhale, and I just breathe through it\nSee I can make a hit, no thing to it\nBut all y'all do is miss, no ring to it\nWhat I bring to it's like sheet music that he wrote\nI'm F'in sharp but the lines have brought\nMe nothing but some C notes\nMy girl ass never be flat, yo girl look like a minor\nI've been unemployed forever, but this 'bout to get me higher\nTo the sky-er, now I test my wings\nI got Victoria's Secret angels doing devilish things\nTryna mess with a king they say I mainly model\nBut I'mma get into acting\nI say go break a leg, you might just get casted\nAnd they asking why XV?\nAt 15 I started rapping. Most of us don't see 21\nSo when I was young I made it happen\nNow look they eyes. I'm 26 and I'm fly\nI'm reloaded, I'm reloaded and I'm aimin' til I...\n\nChorus\nSky high, that's where we aim\nWe just shootin' for the stars like\nBANG, BANG, BANG\nRiiiiight, it will never change\nThe sky is where we aim like\nBANG, BANG, BANG. (x2)\n\n(Verse 2)\nJackasses thought I was done, hoping I crash in fire\nStill amazed at all the ones that these raps inspire\nSweet as driving Miss Daisy but streets be driving me crazy\nSo I'm feeling just like De Niro in Taxi Driver\nWatching the growth, you see the flow, you see the shows get live-r\nWhat I gave em was dope, but my new shit get you higher\nI was Richard Pryor to my dreams of Brewster's millions\nNow I refuse and let a few fans be my ceiling\nA Kansas kid with small town hardships\nBut flew around those big cities, I'm like Clark Kent\nAstronaut dreams, yeah we knew 'em since\nSo I brought my camp, yeah my crews in tents\nWe gotta have it, see those stars and gotta grab it\nGoofy nigga with a bad bitch. I think I'm Roger Rabbit\nBut I ain't framing a thing but them plaques I get with my rhymes\nI'm reloaded, I'm reloaded and I'm aiming til I'm...\n\nChorus"}], "artist": "XV"}