{"artist": "Canibus", "songs": [{"title": "DJ Flam Freestyle", "album": null, "year": null, "image": "https://images.genius.com/86dfaf46c1f97aa0d3bdebf581f58529.1000x1000x1.png", "lyrics": "[Canibus]\nWhen I say \"Can-I,\" you say \"bus\"\nCan-I-Bus\nCan-I-Bus\nWhen I say \"Can-I,\" you say \"bus\"\nCan-I-Bus\nCan-I-Bus\n\nYo\nI can kick a freestyle any time you demand it\nBrain's high-density and my memory's expanded\nBreaking sound barriers like the Lockheed\nEven with knock-knees I run across rough terrain at Mach speed\nBarefoot, Canibus is crazy enough\nGenetically engineering eight-leaved clovers for twice the luck\nCanibus is my name, play the freestyle game\nPhysical brain is in better shape than Jack La Lanne\nWhile you sit and wonder how I just took the life of another\nMe and my brother jump in the Jeep and burn rubber\nWord to my mother, switch cars, that was clever\nShe said, \"Son, I love you, but they're going to handcuff you\"\nCold War veteran, used to assemble weapons for the Kremlin\nDisciplined like Olympic gold medalists\nRemember this, never ever \"F\" a chick protection-less\n'Cause nowadays what you can catch is very infectious\nLest you got a death wish and you want to mess with\nWomen who poison the walls of their wombs with asbestos\nThese streets are treacherous, listen to me when I tell you this\nWhatever you're trying to buy somebody is selling it\nSomewhere, somehow you get gunned down\nWhen the guns go \"blow,\" just 'cause you were running your mouth\nAll my people in Toronto say a \"no doubt\"\nYou a punk, stop fronting and put the gat down\nKick a rap now, let me see if you can freestyle\nThrow on the DAT know, let me show you how to blackout\nNext year you'll be walking around the 'How Can I Be Down?' conference with a laminate\nThat says, \"I got played out by Canibus\"\n\n[A+]\nWhen I say \"A,\" Y'all say \"plus\"\nA-plus\nA Plus\nWhen I say \"A,\" my dogs say \"plus\nYo, A-plus\nA-plus\n\nYo, A plus, I gotta be in hip hop shows atrocity\nThere isn't anyone under 21 that could rock with me\nYou feelin' this, 48-track ventriloquist\nThe astrophysicist, passing out the class syllabus\nJust imagine,  if I rip your crew into fragments\nDestroy the evidence, nobody'll know what happened\nWalkin' through the neighborhood full of dead men\nDoing head-spins, pickin' 'em up like Redman\nLyrically modified to kick the hottest rhyme at the drop of a dime, I limbo below the bottom line\nKickin' tight rhymes, send Method Man to another lifetime\nKeep Erica all to myself, because I like dames\nRadiation from the bright shine, meltin' MCs with hype lines\n'cause I'm very selfish with my mic time\nWhen I recite mine, my rhymes explode like a pipe-bomb\nNobody in their right, or in their left mind can test mine\n\n[Canibus]\nWhen I say \"DJ,\" y'all say \"Flam!\"\nDJ Flam!\nDJ Flam!\nWhen I say \"DJ,\" y'all say \"Flam!\"\nDJ Flam!\nDJ Flam!"}]}