{"songs": [{"image": "https://images.genius.com/55c6bfb6928ee69fa076f8f2a3218981.700x700x1.jpg", "lyrics": "[U-God]\nFeel the heat from the streets, I got to eat\nTalk what I walk, I stalk with bronze feet\nAncient spells, yell durag sheet\nJump on the jame with with 36 peak\nBeat up the beat, overload rap treat mix\nCape in the wind like the John Woo flicks\nNow, take the spirit, crash more clearer\nThe sweat of the body, covers the man in the mirror\nKick down the door, unlease the Terror Fam\nCracklin, screamin, crime who I am *echo*\nWho else could cut, well budge, eye on the tiger rap\nRuler rough mind snap, cryin, his eyes strapped\nBeneath clothin, prehaps speed glowin\nThe golden wise domes, blizzard unknown\nThe unforbidden, got to live, wildstyle begun\nSo uplift the mind, boy I'll bring out the sun\n\n[Hook x2: U-God]\nYou trapped in this rap in this world bizarre\nAnd ya hit pretty hard in the city of frauds\nBut uplift the mind and I heal ya scars\nCuz rich, tall or small, we all shinin stars\n\n[U-God]\nNow, first of all, yo, we ain't no saints\nCan we lay in the trench and rock the war paint?\nThe same villain scheme, temper made the rhythm mean\nMy self-esteem, my '98 blade hit 'em\nLink spot blast, even though I shot last\nThe underdog stranger, superfreak hot blast\nThe hard drop rip is a hostile swing\nKiss my Redemption with a fist full of sting\nSwift with the gifts, it's the God Body Squad\nIt's not a myth, we defy all odds\nNow, reach for the stars, now top to the limit\nBut, all in the all be\nGrateful to be livin\nWhile we work the muscle, we meditate the hustle\nSerious the world, experience this struggle\nThe razor voice, flavor choice steam, redeem\nWe feelin prominent now to dominate the scene\nThe grass more green, attack speed lean\nThe cliffhanger vaccine, man & machine *echo*\nNow from round one, mayor style sum\nI won't stop the war till y'all drown in my drums\n\n[Hook x2]\n\n[U-God]\nNow, here come the rhythm, style that's moist\nNow, it's up from the Hell with the olive oil voice\nNow hurry my hurt, bury dirt deep within\nAgainst sweaty rap war starvin, robbin the wind\nOut the great blue skies and the bright red birds\nFrom the pitch black city with the long link furs\nGolden Arms yours truly to restore the Earth's beauty\nGrant me a beast, now kill me with the jury\nWhen I tell on a capell, Hell has no fury\nA force has awakened, breath-takin vengeance\nMidnight power plant, seekin the menace\nMy wrestler's vest, livin fresh, dry bone\nMy appetite distruction is official cyclones\nThai poems, my throne\nOne shot fill, bigger homes, bigger stones\nIt's on now!!!\n\n[Hook x2]\n\nKung Fu movie sample:\n\n[Man #1] We're the best, I assure you\n[Man #2] That's not what I've heard\nThere's a lot of Shaolin men around here\n[Man #3] They're not important\n[Man #1] Are you trying to deceive me?\n[Man #2] Those damn Shaolin students. They're just a bunch of rebels\nTime and again in the past, the court has given orders\nTo wipe them out!\n[Man #4] Be the Shaolin, and a good teacher\n[Man #3] Who is this man?\n[Man #4] The God of War!", "title": "Bizarre", "year": null, "album": "Golden Arms Redemption"}], "artist": "U-God"}