{"artist": "Canibus", "songs": [{"title": "Good Equals Evil", "album": "The ‘C’ of Tranquility", "year": "2010-10-05", "image": "https://images.genius.com/bcd4d41b609a532514c5daa8d24d2bbd.600x600x1.jpg", "lyrics": "[Hook: Canibus]\nA man pays dues, do this become an angel\nGood and evil, a man stays true\nThere are other ways to win\nGood and Evil, it's the same thing\n\n[Canibus]\nA decade after my debut, the game changed; I got the same views\nTo me it's just baseball and I'm Babe Ruth\nBambataa from Planet Rock, trade op commander Hip Hop\nWhat? We grimlock smash Spitbox\nYou can never be the best, until you complete the competency test\nWith Rap pattern parameters I set\nAre you deaf? Do you need me to repeat what I said?\nI said you'll never be the best unless you pass this test\nOkay, fill out registration form 88\nName, social, date of birth, address, city and state\nWhen the form is complete pass it on to Angela Clark\nTo determine your eligibility and get you insured\nEvery morning the board panel assembly judges man by his bars\nCourage of heart and what he offers the cause\nIf he's accepted he'll be sworn in tomorrow\nIf he's rejected he's recycled and retested on stage at the Apollo\nI had to and so do you, are you solid or hollow?\nDepression is normal, a challenge to climb out of your sorrow\nForget about the world around you, the truth is\nThey are nothing without you but you will be nothing without the truth\n\n[Hook: Canibus]\nA man stays true, a man pays dues\nIf a man can do this, the man become an angel\nThere are other ways to win, a consequence for every sin\nBut we are blind because Good and Evil is the same thing\n\n[Canibus]\nDo not be confused by the choice of words used\nFor every battle we win, there's something we lose\nBut you still have to choose and choosing not to choose is still a choice\nSometimes silence is a powerful voice\nThe body is of no use if the mind is enslaved\nBut theses slaves can not bind your light or your sound waves\nHowever, we must to train to increase our strength\nThe final test is presented when we least expect\nWe look forward, we see 180 degrees, what's left?\nWe eyeball right to left but see nothing, what's next?\n180 degrees of regret, what's that?\nIt's everything we left behind unchecked, it wants revenge\nThey want revenge against us because we fight for our freedoms\nDie for what we believe in and they know we don't need 'em\nI know you disagree, you think it's fortune cookie shit\nBut I guarantee you this, our future was prefixed\n\n[Hook (x2): Canibus]\n\n[Canibus]\nI look towards the sky for the answers to why\nI analyze the great divide and saw God on both sides\nGod didn't do this, we did this to each other\nSo keep his name out your mouth, you fucking cock suckers\nHow could you own all of it, when we are all apart of this?\nThe Earth belongs to every living thing that walks upon it\nWe are all perfect creations, with imperfect justifications\nBut just the patient fuck the subject of Satan\nThe Universe is too huge, does Satan live out there too?\nOr is he just after me and you?\nBelieve what you perceive\nLook at the Sun, tell what do you see? 360 degrees of light beams\nIlluminating Hip Hop, Spitboss'll bag your pops\nYou ain't ready for the shit that I got\nIt's called Hip Hop homey, that's the only way that you know me\nAnd knowing people can still be lonely\nAt the Maharaji spa for the whole week\nI just go to sleep because when I wake up I am not an emcee\nI get back on the clock when I hear the next beat\nI'll write about another century of heat, I'm a beast\n\n[Hook (x2): Canibus]"}]}