{"artist": "Bobby Creekwater", "songs": [{"album": "Revenge", "title": "You and What Army", "year": null, "lyrics": "[Intro]\nYou will be a weapon\nA minister of death praying for war\nBecause I am hard you will not fight me\nBut the more you hate me the more you will learn (yeah)\nI am hard but I am Fair\n\n[Verse 1]\nTry this on for size:\nGrow up broke\nStand in the cold with a hole in your coat\nStay next door to a woman who smokes\nA whole pack of cigarettes with a hole in her throat\nMy mama's in the church, high off hope\nMy uncle's in the trap, my aunt don't know\nMy cousin went to school so she could be a writer\nMet a nigga with some money and thats all she wrote\nAnd here I am, runnin' these streets\nTrying to find a bit of my identity\nMeanwhile everyother nigga I knows getting money\nRidin' in the droptop like Kennedy\nFuckin' with all the young girls I like\nI could be a hater but it ain't my right\nI could could go fuck with the big booty girl, but\nThe whole hood hit her and she ain't my type\nI came from the bottom, like it or not\nThey'll put a gun to you if they like what you've got\nAnd they might break, but they don't bend\nAnd they don't talk, because thats not the trend\nBut thats not news, so y'all won't know\nIt ain't yall's boat, so yall won't row\nYou gotta pay attention to be up on this\nAnd why would yall pay what yall don't owe?\nAnd why would yall ever give a fuck about me?\nAnd why would I ever give a fuck about yall?\nTheres no need to smell, I know I'm the shit\nAnd where I come from, nigga, shit dont stall\nAnd where I come from you can rob, rob rob\nTalk shit all day, nigga that don't harm me\nYou're gonna stop who? You and what army?\n\n[Intermission]\nSee, thing is you only have to fuck up once\nBe a little slow, be a little late\nJust once\nAnd how you Ain't never be slow, never be late?\nYou can't plan for no shit like this man\nThis is life\n\n[Verse 2]\nCame up broke, the game was fixed;\nHow are you gonna win if you dont play?\nThey say be humble and all that shit, but\nHow are you gonna be the man if you dont say?\nI shall not stop, or reconsider\nCall in favors, I don't waiver\nAnd even though I bring your hunger to a halt with food for thought\nNigga I don't cater\nI don't talk just cause I can\nI don't let a nigga disrupt my plan;\nI don't let a nigga disrupt my paper -\nIm gonna get money 'till I meet my makers\nTalk my shit kick back on Acers\nWalk away in the end with all that money like Idris and Paul at the end of takers\n\n[Outro]\nWho's the judge?\nJudge is god\nAnd why is he god?\nBecause he decides who wins or loses, not my opponent\nAnd who is you opponent?\nHe doesn't exist\nAnd why doesn't he exist?\nBecause he's a mere dissenting voice to the truth I speak\nThat's right\nI speak the truth", "image": "https://s3.amazonaws.com/rapgenius/bobby-creekwater.jpg"}]}