{"artist": "Cam’ron", "songs": [{"title": "Golden Friends", "album": "Ghetto Heaven Vol. 1", "year": "2013-10-01", "image": "https://images.genius.com/01b2584dd85d0bcfad6cde9603330f8b.500x500x1.jpg", "lyrics": "[Hook: Cynthia Fee]\nThank you for being a friend\nTravelled down the road and back again\nYour heart is true, you’re a pal and a confidant\n\n[Verse 1: Cam'ron]\nKilla season has returned y'all\nWanna say thank you\nTo that cocaina\nThat coke I got off the boat\nThat I made float, then copped that Beamer\nOver her I cock the Nina\nLoad the 9 or swerve the Tommy, and yes, I love her\nGot my mother out the gutter, word to mommy\nWhere your real friends at?\nPoverty, put an end to that\nYou ain’t got it, they don’t come around\nOnly come around for your income tax, but...\nShout your homeboy or your homegirl\nThat know your game\nThat let you hold they car\nClaim the kids, put your phone in they name\nTrue, they're along for the ride with ya\nEven when you’re dead wrong\nRight by your side with ya\nIn the club, bump, ya'll pose for the right pictures\nSomebody act, they're down to fight with ya\nI held his kicks, he let me hug his chicks\nOh, pardon me y'all I’m just talkin 'bout Huddy 6\nSo if you're with your girlfriend, wake up your eye\nAnd if you're with your homeboy, put a drink in the sky\n\n[Bridge]\nHigh fives (high fives)\nHigh fives (high fives)\nHigh fives (high fives)\nNow tell 'em this...\n\n[Hook]\n\n[Verse 2: Cam'ron]\nThanks to British, he’s some other guy, word\nWe make mothers cry\nHad to sing their sons a lullaby, whoa\nAlibis, alibis, we kept more than one\nWet T-shirt, no water gun\nHe a business man, now all are young (yes, he is)\nGrandma raised me, Lennox Ave took it over, though\nThanks to Zekey, he kept my pockets on overflow\nUn gave me my first deal, Benz gave me my first wheels\nBut thanks to Hector Garcia Sr. – gave me my first meal (gracias, papi)\nWanna thank God, my Lord and savior looking over me (looking over me)\nThanks to Tanya, for years I tore up her ovaries (what up, girl?)\nThanks east, west, north, south, overseas (Peru)\nNo thanks to these rats that think you owe'em cheese\nBut you're with your girlfriend, start swinging your hair\nIf you're with your real piece, put a ring in the air\n\n[Bridge]\nHigh fives (high fives)\nHigh fives (high fives)\nHigh fives (high fives)\nNow tell 'em this...\n\n[Hook]"}]}