{"songs": [{"year": "2017-02-03", "title": "Footaction Family Cypher", "image": "https://images.genius.com/dd759534bdde8c343fa3e704f2100eef.1000x1000x1.jpg", "lyrics": "[Intro: Saba Pivot]\nYo it’s Saba and you’re watching the Footaction Family Cypher\n\n[Hook: Shout out Martin Sky]\n\n[Verse 1: KR]\nFrom the boondocks\nIn the back of a bat cave\nLies a black slave\nI ain't concerned with these whips and the nice chains\nNice brains from dimes don't need em\nLoose change\nI make a salary from me spittin these hot flames\nCold hitta, prolly go shirtless in cold weather\nStack money, rhyme, elevate, that's my vendetta\nI'm sleep catch z's every fall like 6 letters\nThe rhyme chill you try to jack it like my sweater\nLook, take a dive in the lyrical rap\nThe rat pack\nGet cheese never get trapped\nI'm a threat so they back back\nFlow nasty the whole world resemble Kat Stacks\nProfessor of this ish\nSchool you boys like back packs\nOpen doors full of bars\nValet parking the car\nScurry and fu** a broad\nPop a pill to f-loss\nHoly presence of God\nThe messiah the great Allah\nWatch em resemble me\nLost in the knowledge you see\nThis the type of flow you need to mop\nLyrics they will never stop\nWhile you're drinking on that peach Ciroc\nI'm finding my peace with Pac\nApocalypse is hot the block is hot\nLil Weez I spit a flow I bet you freeze\nI got the honey's because I beeess\nThe hottest MC to ever achieve\nThe things I believe\nAnd I got red eyes chasing the green\nThe green is the leaf\nHearing me speak the sighs of relief\nThe lyrics the beat\nPut me in the mood to start a killing spree\nF*** a empty stomach\nI'm starving I'm tryna eat\nGot an entree full of rappers\nIt's time to begin a feast\nWhy the labels signing rappers who can't even stay on beat?\nLike that\nAnd it's sickening killer flows of delivery crack\nAnd I'm shittening\nOops I meant to say shittin' with gnats\nBoys bickering\nBut I remain a mystery\nLike Scooby Doo\nSo I do me, you should do you too\nBoys clueless foolish and stupid like Boo Boo the fool\nOoooooouuuu\n\n[Verse: 2 Bizzy Crook]\nThis is Kurt cobain meets 2Pac at Barnes & Nobles\nYou all talk but I'm anti social I could swim thru the money playing Marco Polo fly\nRebel I go Han solo I stay in a good fit, gold chain And some Fly\nDenims My kick game like the 5 venoms Ya BMs DMs I'll slide in them I\nSwear I'm going in Like a two time felon I'm under rated but that's\nYour mistake Cause while you sleeping on me Shorty up late telling me\nHow much she love the the tape I never hate I just mediate The sound\nTrack to my life got no skips I just let it play I'm tryna own it They\nTryna clone on it If they would've asked me nicely I would of loaned\nIt Instead I ain't gon give them a chance Better watch what you say to\nThis young Avalanche I stay on track like a Nike fuel band So many\nGigs I need more data man Ya plan A only work when u don't got a back\nUp plan I fall down, and I get back up man\n\n[Verse: 3 Jimi Tents]\nMan I swear\nI can jump off of a building\nLeap over rooftops\nGlide over ceilings\nWhile sealing my soul in a pyramid\nKing tuts descendent\nSending a note\nThrough a time portal\nNailed to the sail of a boat\nIf my album was for sale\nWill it fail? Will it float?\nLike parades, out of space\nIn this game but I'm close\nTo the rim, like Dwayne or some spokes\nHoly water for my sins\nJesus chain for the rope\nChurch roof as stool\nPlay the fool, it's a joke\nLeap of faith on face\nI'm deranged and I know\nThat the day will approach\nThat I'll slip & I'll fall\nHollow tips hit his jaw\nCall em lacy duvalle\nHold up, wait..\nLet me pause..\nPlay, sipping re(d) wine\nSpitting four words\nMoving forward\nOn demand, like a order\nNot an Hors d'oeuvre\nHomie I can do this all day\nLantern to a lamppost\nWhere ya damn coat?\nWear ya damn coat, cause the camp cold\nYou just damn dirt in a compost\nThis a calm post, let ya mom know\nYa saddam know, we the bomb\nOh, where the congos?\nI'm the king, where did kong go?\nYou a console, game boy\nGetting controlled by the council\nCount bread, but I lack toast\nBussing lactose on her back slow\nBitch I'm lazlo, lead the camp like a masco-\nOww, a mascot\nBasquiat mixed with Van Gogh\nTryna tango to merengue\nBeen a sensei, since the tenth grade\nTummy empty, I'm an MC\n\n[Hook: Shout out Martin Sky]\n\n[Verse 4: Saba Pivot]\nThere were clones wanna bes like a copying machine\nI'm me like wayne before you bought the carter 3\nCopying then They paste I control alt delete\nAuthoring\nOpportunity will call let it ring\nLet it go\nLet my people go Moses when I sing\nWhen I see\nPeople scared to be they self\nI'm just me\nSetting by example when it's ample y'all following\nTryna trend\nFinals mvp I'm just tryna win\nI had a dream that I had a run in with the law\nThe same dream I was in a magazine\nHoping I don't mess it all up\nNever been wack Look my catalog up\nNever pitched crack but the adderall plug\nLooking out for me like nanny or cub\nI been in the game but I just made dub\nAll them boy lie and they shit made up\nWhat is ya problem\nKept this shit 100 like change for a dollar\nPimping this game got a cane and a collar\nBest rapper living bitch I'm Wayne on the carter\nSmooth young nigga and it came from my father\nBitch I'm from Austin\nWestside cautious\nApproach with\nRoaches\nSmoking\nWrote this on off day\nAnd still sound better than most shit\nOh shit\nGottem in check like coaches\nThat's Nothing but the truth\nTrue so help me god\nI'm aite\nBut I see it differently since Relly died\nReally I\nNever cared much about fitting in with y'all\nWhen it all\nComes down to it I can do it on my own\nWrote a song\nFor the free I might sell it for the fin\nPut it on iTunes\nPutting on for the fam\nI'm just chilling with my dogs\nLike its Jake like I'm fin\nTryna tell the whole story\nFrom the start til the end", "album": null}], "artist": "Saba"}