{"artist": "Beanie Sigel", "songs": [{"lyrics": "Ghost, Sigel, real niggas load up\nThrow your fuckin' hoodies on, it's goin' down\n\nNah, you can't hang, nah, you can't bang\nYou better get yo' gang\nIf you see me on the road better switch yo' lane\nIf you see me on your strip, bitch, get yo' thang\n\nFuck that before rap had to flip cocaine\nKnockin' EMPD, nigga, it's yo' thang\nHad the fisherman hat, with the 40 bottle twistin', the cap\nOutside all night pitchin' the crack\n\nBut now things are a lil' bit different\nI could start the car without the key in the ignition\nNow I be Vivo sippin', nigga, strapped with the mac\nIn the book bag bitch, when I go road trippin'\n\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\n\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me\n\nThe bully harder than them bars in the lifer's house\nYou don't know me, see the Ghost when the lights go out\nKill yo' ass while you daydream, nigga\nI put your big man to sleep and let him fly like the A-Team nigga\n\nYou niggas puss, dick startin' to get hard\nMan, we always strapped, catch shit when you run in the bitch raw\nI go off when the shit's off, I usually turn it up when it go down\nIf you didn't you know now, you know it's the Ghost\n\nAnd the bully in this bitch, two hawks up\nYou know I got the fully in this bitch\nIn the best shape of my life, I know I could roof niggas\nI send 'em back down Sig', I know you 'The Truth', nigga\n\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\n\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me\n\nGhost and Sigel, P-89 and the Eagle\nGet stretched by the skinny or diesel\nHardest two out, so it's gon' be plenty of evil\nSo run and tell all of the people\n\nYeah, what? Gun check, rope check\nHit the club, rob shit during coat check\nJust for the fuck of it, nigga\nI like the four-door big\n\nHeard you bust with it nigga like to blow a pound of weed\nHeard you puffin it nigga, let anybody front and we touchin' it, nigga\nYeah, what? I get berserk when I'm high on them perks\nYou fuck around like, you don't want your kidneys to work\n\nI get the family, the doggie, the kitty get murked\nMan, what you know about puttin' in work? Yeah, what?\nAnd you know you ain't ready for me\nGot a young boy, turn your shit to spaghetti for me\n\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\n\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me, yeah, what?\nYou ain't ready for me, you ain't ready for me\nYou ain't ready for me", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "U ain’t ready 4 me", "album": null}]}