{"songs": [{"lyrics": "B High: When we were kids, we'd be outside playing basketball. We'd be a man short and he's supposed to be on our team, and we'd be waiting for him, and you'd go get him and he'd still be upstairs writing, and, reading dictionary's, understanding words and putting them together inside his head. In the projects you live in dog years right? I remember once this lady told me \"you guys might never live to be 21 years old.\" So at 14 or 15 years old you're damn near a grown man in your mind. You're doing things, you're hanging out all night, you might be carrying a gun, you might be selling drugs. You might have a car, you might be paying your parents rent and taking care of the household. So those years living the way you are to be 25 is like being 50. You have knowledge far past your youth. So as you get older you just accumulate more things, as you're learning more things. He just learned to play both sides of it. I remember we was driving down Nostrand Avenue one day. Listening to some music. And I was telling Jay \"Yo you need to be spitting such and such man, giving them some real knowledge\" and he was like \"Nope, it'd be too deep. I can't be too deep I have to spoon feed them. Everything I do I have to spoon feed them lightly. If I give them too much they won't take it. Once I spoon feed them lightly, feed them sugar feed them sugar, and then give them some knowledge on top of that, and then they'll take that in and start growing with you, and you know, follow me.\" So you know, he had the plan.\n\n[Musical interlude: \"Politics As Usual\"]\n\nTone Hooker: I remember one day we was chilling, and Dame told me yo think of a name for us as a rap crew. In ten minutes I wrote down ten little names. Roc-A-Fella happened to be the first name, and everybody was like \"yo that's a dope name.\" But Dame was like \"Why Roc-A-Fella, like what made you think of that?\" We rock fella's on stage, you guys are flashy guys, you're about getting money, cause the Rockerfeller's were known as a rich and powerful family, so we just took the name, changed the lettering a little bit, R.O.C., it went from just a game of a group of people to an actual record company. Reasonable Doubt showed a mentality of the bosses versus the runners. The irony is to this day everybody is a boss or trying to appear like Jay first appeared in that album, Reasonable Doubt, versus when in the 90s everyone just wanted to be the best rapper, now everybody wants to be the best hustler.\n\n[Musical interlude: \"Politics As Usual\"]\n\nKareem \"Biggs\" Burke: A lot of people just kind of glorified the hustling aspect of it. But if you really listen to Reasonable Doubt, he does glorify it, but at the end he shows the repercussions of it, so I think if they got the whole message, they can understand exactly why he's celebrating. Like this kid who father left him, and the environment around him and around all of us. There was always something, like Dame his mother died, his father left as a kid, and me being evicted when I was 10 years old, and living in a shelter for years. It was always that one thing in our lives that we had in common that we knew we wanted to take over the world and do something that's groundbreaking, and that's that drive that we had as we started to get older and see things and get in the business, and then having the money was always a celebration for us, but it was a celebration because of our circumstances, and I don't think people knew that. And it was always from the smallest to the tallest, like being able to get your first $100 pair of sneakers, being able to get your first bottle of champagne was a celebration. It's just that things kept growing for us, so we were celebrating all the time.\n\n[Musical interlude: \"Politics As Usual\"]\n\nKareem \"Biggs\" Burke: You know I am blown away by the talent and Jay lyricism, I'm blown away by what the producers have done. I'm blown away by the artwork, I mean Jonathon Mannion's career started from that right? He did Jay's next 8 albums, he did DMX, he's doing Kendrick now and Eminem, I'm seeing interns become execs right, these kids now who build businesses and want to be part of companies and want 50/50 ventures and want to build and buy and sell. And some of the millennials don't even know where that came from, I mean that came from us, from Reasonable Doubt. I mean it's a great feeling just to be a part of that. To know that we're a part of history. Jay right now have more number 1 albums than Elvis Presley, behind The Beatles, we didn't plan that. It's just a celebration.\n\nDJ Premier: I knew Jay already just from him with Jaz and we see each other in all the same hot spots, the fly spots where you wanted to get into where hip hop was underground, you had to be somebody to get in, you didn't have to be a platinum artist but you had to be somebody.\n\nKyambo \"Hip Hop\" Joshua: I basically met Jay through my brother Biggs. Kareem Burke when I was in high school. At a party he was performing at, we was on the line, and they basically told him \"Hey this is Biggs little brother\" and he said \"Well come with me\" and he basically took all of us off the line and we went into the club, and I've been with him ever since. Drinking Cristal the first time I was in the club.\n\nMemphis Bleek: I grew up just knowing him as Shawn from the 5th floor. I knew his moms, his sister, his nephews, I used to babysit his nephews, his mom used to pay me a few dollars, so I always known him. I used to get in trouble for hanging with him, cause my mom knew they was the dope boys, you too young to be with the dope boys.\n\nKyambo \"Hip Hop\" Joshua: I believe it was the first day they opened the office up, and then asked if I wanted a job. At one time I had the album and nobody in the world had it. I was about to graduate so I had to, it was rehearsals, and I just remember listening to it, like nobody knows what I'm hearing, nobody knows what's about to happen. I wish I could have took my headphones, flipped them around, and let the world hear it.\n\nMemphis Bleek: My favourite song on the album had to be \"D'Evils.\" Hands down, I stole a copy of the song I liked it so much. To where Jay and B High came to my apartment, like \"Yo I heard you giving out copies of this song, the word came back to you,\" they was ready to beat me up, drop me from even hanging with them cause they like \"you a thief\" but they didn't understand I needed that record for my soul, like you are talking to me.\n\nDJ Premier: When I DJ gigs now, soon as I drop \"D'Evils\" the crowd goes crazy. And they're singing it, I'm watching them in the crowds mouthing the words, \"Friend or Foe\" too. \"Friend or Foe\" for the gigs I do, always makes the crowd go crazy. Soon as they hear it come on, it's on. \"Friend or foe yo, state your biz\nYou tint the door, ah, there it is\" Even when he says \"you tint the door?\" I drop the fader and it's silence, and the whole crowd go \"and there it is\" like in unison. And that's the proper place to drop the fader to see if they're following along cause they're die hard fans of those songs. Yeah \"Friend or Foe's\" heavy.\n\n[Musical Interlude \"Friend or Foe\"]\n\nKyambo \"Hip Hop\" Joshua: He said he was only gonna make one album, so it was really like he put everything in and he had his whole life to make it. And the producers that worked with him were people that knew him for years, so he made like 10 or 20 songs with them before he even made the ones that were on Reasonable Doubt. At least the bulk of them, like Clark Kent and Ski. They both had a lot of songs with Jay so their whole sound had a chance to get refined. And by the time we finished it off with Premier and a couple of other producers there was already a sound\n\nDJ Premier: Ski was a major part of Reasonable Doubt being that he was already around Jay with Original Flavour so once his section of the album was placed, he to me is the root of it. I was the icing pretty much, so, to close it out. But you heard it once you popped it again and again, we talking CDs and cassettes back then. Cassettes are a huge part of our culture. We come from riding in cars and having a big radio, we used to having a big radio on our shoulder or down here to walk with, or having a ride with a big system. So I gear everything towards that, so that's my mentality even now, I love driving, I drive all the time, just to bang out and listen to dope music. Reasonable Doubt is one of those that will carry you to your destination and back.\n\nMemphis Bleek: Look where it took us. That album took us on tour with U2. It took us to Africa to do Water for Life. Bring clean water to villages that didn't have. That album got us able to do a 9/11 charity show to give back to families, after Columbine, the spectrum is enormous. It took him to the White House, you can stop there.\n\nJonathan Mannion: So the first time I went to Roc-A-Fella offices, kind of ripped through the book, and you know Jay was like this is dope, you know I went in to see Dame and he was like \"flip flip through the book\" like two or three pages and he was like \"alright cool, how much are you charging?\" And I was like \"oh man like I dunno, cover my expenses, let me do what I want to do, and execute my creative perfectly, and I'll do it for $300 less than the next lowest bid.\" And he looked at me crazy. What does that even mean? 300 less than the? What are you even talking about? It wasn't really about the money, that's what I told him, I just want to do it, I need this chance to set the pace, the ideas I have are crazy. That's when the album was originally called Heir to the Throne, and from there it switched to Reasonable Doubt the following day. I think ultimately it ended on being classic portraits, it really established him as this Brooklyn, already established OG. It's clean its sharp its styling. We wanted to create something that was lasting, that we could have taken on that day in 1996 or yesterday in 2016. When the title switched and it became Reasonable Doubt, it was like OK, he knew who he was and was really confident in the album, he's always been one to allow people to discover for themselves, cause he felt like when you discover it for yourself it becomes part of you and then you represent i harder because you decided to love it. \"Dead Presidents\" was the first I ever heard, and as soon as I heard it, with the two different versions, I was like he's out of here,  I fought so much harder to get the album because of that, even though I hadn't heard the rest of the album, which ends up being such an incredible complete thought.\n\nSki: I was at this music conference, and Nas had just dropped Illmatic, and everybody was out there playing Nas' album on the strip, and every car was going past playing \"Whose world is this\" and I was like \"Yo this song is crazy!\" So I just kept listening to the record and I was like damn when I get home I want to find something similar to that, that vibe, so I started digging, dropped the needle, found the [?] sample, chopped it up, I put Nas vocals in there to hear if he would fit. I was like yeah that's that vibe. Then I played it for Jay, and when Nas' vocals came I said \"Don't worry about that, Imma take that out.\" He was like \"Nah keep that, that shit is dope\" and that's how it came out, and you know, he killed it.\n\n[Musical Interlude: \"Dead Presidents II\"]\n\nSki: Yeah mean, we definitely got paid for the work we did, they took care of us. I remember getting on the train with the backpack, with 20 grand in the back pack on the train, if people would have known I'd have been done.\n\nEmory Jones: You know, the statute of limitations, but you know, it was one of those things. We was hustlers. You know. You gotta figure like this: Wouldn't you rather get paid cash money than get jerked about somebody telling you we need to do this deal with you, and we need to check these royalties and never see them? Soon as you got this cash money you go play them bills quick.\n\n[Musical Interlude: \"Can I Live\"]\n\nEmory Jones: \"Can I Live\" means so much because, as I said it goes back to us in Vegas and real, you know ringside at the Tyson fight, and we see B.I.G. and Puff, and Dr. Dre sitting in front of us, and it was like y';all really here ring side. The lyrics alone were like, that's where my nickname Vegas Jones come from. \"We at the crap table the one that starts a G up.\" \"This way no Fraud Willies present gambling they re-up.\" That was me. I stand at the Craps table, two chicks with me, one with a bottle of Dom, one with a bottle of Cristal, I'm up 20 thousand, that's a free trip. That was a moment in time we was just on our mojo, in the streets, living life and just doing what we do.\n\n[Musical Interlude: \"Can I Live\"]\n\nJonathan Mannion: From start to finish, you may not like everything, but it's like a complete thought ,delivered, executed perfectly without the pressure of anybody telling you what to do. It's just what felt right for him, and all the people he surrounded himself with.\n\nSki: The music is just honest. It was from your heart. Anytime when you speaking the truth when you being honest about whatever you do people gonna feel it. That's all it was. Honest lyrics, honest creativity always resonates. No labels, nobody telling us how to do it. This creative freedom, just being your own person, your own boss, in whatever you do. And just not being afraid to do your thing, to express whatever you need to express however you're gonna express it.\n\nEmory Jones: That album has a spot in my heart forever. It's the sound of the heart, when you got the family you got the kids, you got mom, you got God but I have Reasonable Doubt. I thin kit represents that culture of what we are, who we are, the world is set up to give the Good, the Bad, the Ugly, some of you might like it, some won't, but that was a language that we know a lot of people spoke.\n\nSki: It's relatable you know? There's still people out there hustling they want to get theirs. They're on their entrepreneur shit, they need that motivation, they need their \"Politics as Usual,\" they need those songs, that get you up and make you want to do stuff, and give you inspiration to keep on pushing for what you pushing for, and this a good album for that, it just embodies that energy.\n\nTyran \"Ty Ty\" Smith: Jay and I grew up together in Marcy Projects. I lived in 552, he lived in 530 something. Like across the park from me. I used to set up battles, I used to talk so much shit to other rappers around the neighbourhood, Jay would be out of town and I would just have battles set up on the other side of the project, and Jay come back I don't even know he back and someone say \"yo be back\" and I'd be like \"oh yeah,\" and I just call him out the window, and Jay would come down and he would go battle these guys. And he never once even asked me who we going to battle, or I'm busy I got shit to do, he knew I was talking so much shit he had to back me up. I don't think there was one person that didn't think that Jay was the best rapper in the world, out of our whole crew. Whatever I had to do, it was never a problem, you just gotta be humble and do it. If you believe in someone it's not even a thing, you just do it. I remember passing out CDs to people you know in Atlanta in the mall passing out Jay's CDs I was down for all of that cause I wanted it to work.\n\nGee Roberson: Oh man 17 John St was the hub of it all. Like it was this small office, that was in the Wall Street area, a staff of about 8 of us, and you know it's amazing cause just think about this, you have a staff of 8 doing the job of 200, making it happen, everybody was just a family, huddled up, rolling out full steam to make it happen, on one accord, pushing one goal, just to drive the album, push the album. I was the intern,m straight out of college, so I'm starting at the bottom grinding, making it happen, just playing my part, my role.  So I was calling every college radio station, every college rep, that was one hat I wore. And then that hat morphed, remember with a staff of 8 you do more than one thing. I was wearing the radio hat  for the day, and then when I left the office to do the field work, as far as I would do retail promotion, so at the time I would go to all of the local mom and pop record stores and make sure the posters was on the windows, make sure we were getting prime placements. at the time we were going up against everybody, it wasn't a situation of the Jay Z of today, it was like \"Who's he? Who's that?\" It was more so turning the \"who is that\" to \"I'm the one.\" In all reality as the record was growing, Jay was on the road, he had to win people over, and he would do whatever it takes to win that crowd over. From spitting acapella, to throwing a stack in the crowd, whatever it took to win that crowd to walk out of there, oh \"who was that guy? This Jay-Z guy is real, this Jay-Z guy is crazy, oh my goodness I just left this Jay-Z show\" like he had the presence of mind from day one to always know I don't care how many people in here know me, I don't care how many people in here don;'t know me, I know one thing, I'm gonna walk off this stage with everybody knowing me. That drive and that focus when it came to his show from day one, that was something instilled in him, that was just part of his DNA.\n\n[Musical interlude: \"22 Two's\"]\n\nTyran \"Ty Ty\" Smith: Rapping to Jay was probably the easiest thing, he probably didn't realise, I don't know he never said, but if you can do something so easy, you can look at it like it's amazing cause it comes natural to you. Everyone else is looking at you like \"this is sick.\" Jay's a smart guy, so he's looking like \"I can do something with this\" you know?\n\nDJ Clark Kent: I knew Jay and Jaz since we were all teenagers, through a guy named Fresh Jordan. And I always thought they were the best MC's I ever heard, so I wanted to sign them no matter how it was supposed to happen. It just never happened for Jaz, so Jay hit the streets running, it worked out for him, it was never a \"yeah I'll go back to that,\" he was unfind-able. When you making that paper, the only people you gonna let find you is the connect maybe. He didn't just have the best rhymes he had the other part that makes the rhymes believable. Try to imagine knowing that for 8 years in advance, then trying to find somebody, and then trying to convince him \"let's do this records,\" and him going \"eh, that's what you do this for? I had that already.\" It's crazy when you know this guy's talent it out of this world. When I finally got in contact with him, it was make records, but let this guy manage you, because of how relentless Damon was. He was dead serious about these artists whether they were good or not, so it was really to me a good idea to introduce him, so that Jay wouldn't have to think business. All he had to think about is making the best records. I would say it's the most right thing I've done in the music business, because I wasn't gonna let any of these A&R's tell me he wasn't the one. And I just didn't quit.\n\nPeter Panic: I'd already put out house records and reggae records,  independently, and as like the only college dude in the whole crew I was already researching where to press records, who is the cheapest as far as printing, where to go get your mastering, I started helping Damon with that part way before. It was him trying to shop the material to majors after a while it became obvious that nobody was biting. There was one meeting between Damon and Clark Kent at 1am at Clark's house, and Damon was explaining the frustration with regards to getting the industry to realise Jay is a dope MC. They decided they wanted to put it out independently, and Clark explained to Damon that putting a record out independently is totally different than putting it out with the support of a label, financially as well as administratively.\n\nDJ Clark Kent: It's partly Maria Davis' album too, she let us perform every week. It was Ty Ty's album cause he held him down, it was B High's album cause he was his cousin that wouldn't let nothing happen to him. It was the Lexus dealers album too cause he was the one who was like yeah we'll let you get the car. It was everyone's album cause it all made what you hear, what you hear.\n\nPeter Panic: Everybody's hopes and dreams and aspirations are pumped into those records, and I think when the listener listens to that, they can feel that, that earnest that you have when you're working on your first album, it;'s a lot of a hope, mixed with a lot of doubt, mixed with a lot of determination. Nobody else kind of put that  into their music as far as like educational value, let me tell you how to move in these streets. He captured it perfectly, it's going to touch recurring generations.\n\n[Musical Interlude: \"Feelin' It\"]", "title": "RD20", "image": "https://images.genius.com/db4033fd8e5f1aaa49e15edf406061f0.640x358x1.png", "year": "2016-06-25", "album": null}], "artist": "JAY-Z"}