{"artist": "Fat Joe", "songs": [{"year": null, "album": "Bad Boys II - The Soundtrack ", "image": "https://images.genius.com/3f1933e4953c8ae99c8fd6f8b565e612.220x220x1.jpg", "lyrics": "[P. Diddy]\nTerror Squad...Bad Boy...Joey Crack\n\n[Hook: Dre]\nGirl I gotta do what I gotta do\nChange my life (Change my life)\nMake things right (Make things right)\nAnd girl I'm a bad boy so I gotta do what I gotta do\nRisk my life (Risk my life)\nIn the late night (In the late night)\nCause girl I'm a bad boy yeahhhhhh\n\n[Verse 1: Fat Joe]\nI know at times you feel stressed out\nBut I'm tryin' to set you up so later I can buy you up this guest house\nBut for now I gotta hug the block\nI know you sick of visits from undercover cops\nRunnin' to the kitchen tryin to hide the box\nJust give me a minute and I'm gonna flood you with rocks\nI gotta wicked jump shot but let's be real\nAin't no scouts gonna give a sad nigga a deal\nI gotta do what I gotta do that's whats up\nWhat's with this new attitude you know bitch that is what's up\nI'm a Bad Boy like 'Mike Lawry'\nHow you think you got that rainbow Louis\nNot with a legal job's salary\n\n[Hook: Dre]\n\n[Verse 2: P. Diddy]\nMa' we got you stuck off the realness\nYou know the infamous\nYou heard of us\nIt's your Bad Boy business men\nMe and Joey Crack gettin' benjamins\nSittin' in the Vanquish, the same color as cinnamon\nMa' I'm tryin' to be your knight and shinin'\nTo put you in the house on the Cayman Islands\nSpend your whole life with stylin'\nWith that light that got me\nThrough it all you was right behind me\nAnd ma' I know I gotta change\nBut right now a nigga is dealing with alot of things\nIt's not the same\nGirl with me you can achieve whatever\nBut I can't change, I'm a Bad Boy forever\n\n[Hook: Dre] + (adlibs from Fat Joe and P. Diddy)\n\n[Verse 3: Fat Joe]\nNow we livin up in Ja-sery\nIn the t.v. in the car got the game on starrin' Marbury\nAnd your ring gotta rock the size of strawberries\nEverything that you want I got it don't worry\nAnd I know it ain't about the chips\nJust my way of sayin thanks for the years you put up with my shit\nI had to change like the chorus said\nAnd I'm reminded why everytime we do our thing in the waterbed\nTo me this is more than head\nIt's more than a crush\nIt's all about us\nIt's love and trust\nTook the time out to make things right\nIt may seem nice\nBut I'm gonna be a Bad Boy for life\n\n[Hook: Dre]\n\n[P. Diddy]\nJoey Crack\nThey call me Diddy\nCool and Dre\nBad Boys 2 the Soundtrack\nGood lookin' Joe\nTerror Squad baby\nBad Boy Collabo\nYeah, and we won't stop", "title": "Girl I’m A Bad Boy"}]}