{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "I Don’t Fuck Wit U", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Pimp C]\nYeah, E. Vicious y'knalmtalkinbout?\nSweet Jones, Tony Snow\nAll you ole bitch ass niggas on that ole goofy section of the newspaper\nKnalmtalkinbout? (Mr. Magoo ass niggas)\nAll that ole comedy shit, that ole fantasy island shit, knalmtalkinbout?\n(Bugs Bunny ass niggas) Say man, missed me with that bullshit\nKnalmtalkinbout?\nHold up...\n\n[Hook] + (Pimp C)\nRound here runnin ya mouth (runnin ya mouth)\nFuck around and hit that nerve, I put a gun in ya mouth (BLAH)\nYa dead... and can't believe how you lied on me (uh)\nBut you'se a simp so I'ma let it slide homey (uh)\nIt's outta control, the game is cold\nThought he was down, come to find out the nigga's a ho, a ho (nigga's a ho)\nJust ain't keepin it true, wonderin why I don't fuck wit'chu\n\n[Pimp C]\nUh, talkin that big dick shit\nYou a ho, I said it (I said it), what chu gon' do about it bitch? (bitch!)\nUh, talkin to the laws (laws)\nNo balls just sugar in ya drawers (drawers)\nIf you don't like me, kill me (uh)\nI'm only dyin one time, nigga feel me (uh)\nCowards die a thousand deaths\nBorn to die but you can't take away my rep (my rep, my rep)\nAnd I ain't goin no time soon\nGotta broad on the plane, pussy full of balloons\nAin't nothin happenin on some bamboo monkey shit (uh)\nKeep my name outcha mouth, nigga you counterfeit (uh)\n\n[Hook]\n\n[Verse Two]\nI walk around this motherfucker, trippin on these weak niggas\nPullin all this ho shit, callin themselves street niggas\nTalkin down, wishing the worse and straight hating on me\nPraying that I fall off, bitches keep waitin on it\nI ain't got no friends, niggas take it how ya hear it\nWhere was y'all for the bid? I did five fuckin years!\nWhile the chill turned to lab dap, after all that I took back\nNever go broke again, bitch I know how to cook crack\nLearned to stack a dollar, hold the power in a black Impala\nTry to swerve and hit the curb and watch the crackers follow\nBitch nigga got my name in his mouth\nWe go pistols when we pissed, that's how we play in the South (play in the South)\n\n[Hook]\n\n[Verse Three]\nBitch I'ma triple O.G., superhood grown, heavyweight (heavyweight)\nI'm no magician but my magic tricks will make you levitate\nRound of applause for the plastic pieces\nRight now the clip up in nickels in solemn night releases\nAye, aye.. no joking or playin, I'm sayin we sprayin for real\nStraight out the gate, no hesitation bitch I'm bustin my steel\nThe shit is helter-skelter\nAnd you gon' need Jesus Christ, a gimmick, plus a fall-out shelter\nWe cast wet toiletries upon bitch ass snakes\nFor cheesecakes, the dirty rats gon' put ya tongue on a plate\nDiarrhea mouth niggas, 1-800-IMA-TELL\nFuck around wit'em, you gon' be dead or in jail (jail)\n\n[Hook]\n\n[Pimp C]\nSay this Young Pimp y'knalmtalkinbout?\nSay Mike Dean, go and draft some  of that vinyl for the South knalmtalkinbout?\nMe and Slim Thug finna ride on out on these bitch ass niggas!\nHold up... {*echoes*}\n\n[Slim Thug]\nSmoke somethin, bitch! {*starts laughing*}", "year": "2006-07-11"}]}