{"artist": "Yung Bans", "songs": [{"album": "Yung Bans, Vol. 5", "image": "https://images.genius.com/00d2e68d4011bae701f660f1be6d7afd.999x999x1.png", "year": "2018-06-27", "lyrics": "[Intro]\nMarvy Ayy\n\n[Chorus: Yung Bans & Tracy]\nYeah, I put in work, I got stacks in my slacks\nThis jacket cost some racks, I can't spill nothin' on that\nYeah, she said my dick like crack\nYeah, let her ride up on her back, huh\nYeah, rob that nigga with no mask\nYeah, that's a 100K in cash\nYeah, put my feet up and relax\nYeah, sippin' champagne out the glass\n\n[Verse 1: Yung Bans]\nYeah, ayy yeah, ayy yeah\nAyy, real water, diamonds make 'em stare, yeah\nHitting off the light, look how they glare, oh\nGot a lotta money like the fair\nYeah, man, this shit ain't come easy, hmm, ayy\nFuck your bitch, I leave her greasy\nI'm like why that lil' ho wanna tease me? Huh\nCome around, I just need you to please me\n\n[Verse 2: Lil Tracy]\nI put some ice on my wrist like it's broke\nThese niggas be lyin', call that boy Pinocchio\nOh, that's your ho? I seen her front row at the show\nI took her home, you don't wanna know what went on\nOoh yeah, ooh yeah\nMy money legal, I don't trap\nOoh yeah\nI love this money and I won't cheat on 'em racks, yeah\n\n[Verse 3: Yung Bans]\nHuh, ayy, I ain't cheatin' on 'em racks, huh, ayy\nFuck your hoe and give her back, hey, yeah\nIf it ain't 'bout money then don't hit my jack, yeah, huh\nSlap a nigga with the MAC, ayy, huh\nSlap a nigga with the fire, yeah\nFuck around and pop a Perc', OD and die, yeah\nNigga think he sweet, then come around and try, oh, yeah\nI feel like R. Kelly, damn, I can fly\nOh yeah, oh yeah\nHit her from the back, pull out her hair\nOh yeah, oh yeah\nStraight out this jungle with the lion, tiger, bear\n\n[Chorus: Yung Bans & Tracy]\nYeah, I put in work, I got stacks in my slacks\nThis jacket cost some racks, I can't spill nothin' on that\nYeah, she said my dick like crack\nYeah, let her ride up on her back, huh\nYeah, rob that nigga with no mask\nYeah, that's a 100K in cash\nYeah, put my feet up and relax\nYeah, sippin' champagne out the glass", "title": "Stacks in My Slacks"}]}