{"songs": [{"lyrics": "[Intro: Woman]\nLesson 2 : Gently place the balls into the mouth and\nHmmmmmmmmm..\n\n[Hook]\nGet it all baby\nGet it all baby\nGet it all baby\n(What you want me to do with it?)\nDon't matter just don't bite it\n(\"She swallowed it\")\nSuck this dick for daddy\n(\"She swallowed it\")\nJuicin' at the lips\n(\"She swallowed it\")\nIt's the world's biggest dick\n(What do you want me to do with it?)\nDon't matter just don't bite it\n\n[Verse 1: MC Ren]\nSlow is the tempo - now talkin' but a nympho\nSo peep it out here goes the info\nThis is a bitch that did the whole crew\nShe get it so much we make bets on who the ho would love to go through\nAnd for the shit that she does, give her a drum roll\nBecause the dumb bitch licks out the asshole\nAnd she'll let you videotape her\nAnd if you got a gang of niggas, the bitch would let you rape her\nShe likes suckin' on dicks, and lickin' up nut\nAnd they even take the broomstick up the butt\nJust to say that she did it with a rapper\nBut the pussy was more fishy than red snapper\n\"But how many licks would it take,\" she asks\n\"To make MC Ren start gooshin' up vanilla shakes?\"\nShe took her tongue out her mouth, put it on top\nLike a cherry, started movin' it like a snake and it was very irresistable\nI couldn't pay the bitch to quit\nCuz the ho' was doin' some ol' crazy shit\nThat made me start havin' a fit'\nCuz the bitch sucked a hellified dick [suck this dick]\n\n[Hook]\n\n[Verse 2: MC Ren]\nNow one night I was at a drive-in\nAnd a car full of niggas straight drove in\nI thought they wuz commin' to start trouble but no\nFive niggas in the bucket with the neighborhood ho'\nNow what do you expect they're gonna dogg her like a doggy\nThirty minutes later and the windowz all were foggy\nAnd I'm off in my car havin' a fit cuz the bitch that I'm with\nSaid no fuckin' on the first date, shit\nAnd I'm like Damn! I wish I was in the bucket\nTo be the sixth nigga with the ho' and I can fuck it\nSo I told the bitch I was with that I'm goin' to the snack bar\nAnd got the fuck out the car\nWent to the bucket and I looked through the window\nIt was some niggas that I knew they let me in yo\nAnd my turn was like next\nI couldn't see her face, all I saw was her pussy and her chest\nI wanted to see the face, I felt I oughtta\nPeep over the seat, Oh shit! It's the preacher's daughter!\nAnd she's only 14 and a ho'\nBut the bitch sucks dick like a specialized pro\nShe looked at me, I was surprised\nBut wasn't passin' up the chance of my dick gettin' baptized\nI told the bitch to do it quick\nYou little ho' hurry up and suck my dick!\n\n[Hook]\n\n[Verse 3: MC Ren]\nNow I'm a break it down with a fact\nSince the last \"Just don't bite it\" girls don't know how to act\nSayin' that they never would suck a dick\nBut when they've tried it they couldn't quit\nCuz ninety percent of the bitches today they love that shit\nAnd those are the main ones that say they don't do it\nBut MC Ren knows the bitches are used to it\nSo fellas, next time they try to tell a lie\nThat they never suck a dick, punch a bitch in the eye\nAnd then the ho' will fall to the ground\nThen you'll open up her mouth\nPut your dick in and move the shit around\nAnd she'll catch on and start doin' it on her own\nActin' like she's tryin' to suck the meat off a chicken bone\nAnd then she won't let go\nBecause bitches suck nut out of a dick just like Drano\nGet the last drop, unclogging the pipe\nThen the stupid bitch is out doing that same shit the next night\nBecause she just can't quit\nCuz she's addicted, addicted, she's addicted, addicted\nShe's addicted to suck a good dick\n\n[Hook]", "album": "Efil4zaggin", "year": "1991-05-28", "title": "She Swallowed It", "image": "https://images.genius.com/378262f83025b434fc5375a332bd1a1f.800x800x1.png"}], "artist": "N.W.A"}