{"songs": [{"year": "2007-09-11", "album": "Graduation", "image": "https://images.genius.com/680d4985b1fccdf554ab887abb63a453.1000x1000x1.jpg", "title": "Big Brother", "lyrics": "[Produced by DJ Toomp]\n\n[Intro]\nStadium status\n\n[Hook]\nMy big brother was B.I.G.'s brother\nUsed to be Dame and Biggs' brother\nWho was Hip Hop brother, who was No I.D. friend\nNo I.D. my mentor, now let the story begin\n\n[Verse 1]\nIt's the Hard Knock Life Tour, sellout\nPicture us in the mall, coppin' Iceberg and yell out \"Jigga\"\nYeah, that's what we'll yell out, yell out\nYou know the name do I gotta spell out or tell 'bout\nJ-A-Y, and 'Ye so shy\nNow he won't even step to his idol to say hi\nStanding there like a mime and let the chance pass by\nBack of my mind, \"He could change your life\nWith all these beats I did, at least let him hear it\nAt least you can brag to ya friends back at the gig\"\nBut he got me out my momma crib\nThen he help me get my momma a crib\n\n[Hook]\nBig brother was B.I.G.'s brother\nUsed to be Dame and Biggs' brother\nWho was Hip Hop brother, who was No I.D. friend\nNo I.D. my mentor, now let the story begin, begin\nLet the story begin\nIf you feel the way I feel why don't you wave your hands?\n\n[Verse 2]\nFresh off the plane, I'm off to Baseline\nNothing handed out, I'm 'bout to take mine\n'round the same time of that Blueprint 1\nAnd these beats in my pocket was that blueprint for him\nI'd play my little songs in that old back room\nHe'd bob his head and say \"Damn! Oh, that's you?\"\nBut by The Black Album, I was blacking out\nPartyin' S.O.B.'s and we had packed a crowd\nBig brother got his show up at Madison Square\nAnd I'm like \"Yeah, yeah, we gon' be there\" but\nNot only did I not get a chance to spit it\nCarline told me I could buy two tickets\nI guess big brother was thinkin' a little different\nAnd kept little brother at bay, at a distance\nBut everything that I felt was more bogus\nOnly made me more focused, only wrote more potent\nOnly thing I wanna know is why I get looked over\nI guess I'll understand when I get more older\nBig brother saw me at the bottom of the totem\nNow I'm on the top and everybody on the scrotum\n\n[Hook]\nMy big brother was B.I.G.'s brother\nUsed to be Dame and Biggs' brother\nWho was Hip Hop brother, who was No I.D. friend\nNo I.D. my mentor, now let the story begin, begin\nLet the story begin\nIf you feel the way I feel why don't you wave your hands?\n\n[Verse 3]\nHave you ever walked in the shadow of a giant?\nNot only a client, the Presidito, hola, Hovito\nThe game gettin' foul so here's a free throw\nI was always on the other side of the peephole\nThen I dropped \"Jesus Walks\" now I'm on the steeple\nAnd we know, \"New Jack City\"—got to keep my brother\nBut to be number one I'mma beat my brother\nOn that \"Diamonds\" remix I swore I spazzed\nThen my big brother came through and kicked my ass\nSibling rivalry, only I could see\nIt was the pride in me that was drivin' me\nAt the Grammys I said, \"I inspired me\"\nBut my big brother who I always tried to be\nWhen I kicked a flow it was like pick-and-roll\nCause even if he gave me the rock, it's give-and-go\nI guess Beanie's style was more of a slam dunk\nAnd my shit was more like a finger roll\nBut I had them singles though\nAnd them hoes at the show gonna mingle, yo, heh, y'all know\nI told Jay I did a song with Coldplay\nNext thing I know he got a song with Coldplay\nBack in my mind I'm like, \"Damn, no way\"\nTranslate, español: \"No way, José\"\nThen I went and told Jay Brown\nShoulda known that was gonna come back around\nShoulda talked to you like a man, shoulda told you first\nBut I told somebody else and that's what made shit worse\n\n[Bridge]\nMy big brother was B.I.G.'s brother\nSo here's a few words from ya kid brother\nIf you admire somebody you should go on 'head tell 'em\nPeople never get the flowers while they can still smell 'em\nA idol in my eyes, god of the game\nHeart of the City, Roc-a-Fella chain\nNever be the same, never be another\nNumber one, Young Hov, also my big brother\n\n[Hook]\nMy big brother was B.I.G.'s brother\nUsed to be Dame and Biggs' brother\nWho was Hip Hop brother, who was No I.D. friend\nNo I.D., my mentor, and that's where the story ends\n\n[Outro]\nToomp killed this shit"}], "artist": "Kanye West"}