{"songs": [{"image": "https://images.genius.com/9e4b5eaf2f72657fee4fc26a5963cac9.325x325x1.jpg", "lyrics": "[Intro: (Mac Dre) imitating a Middle Eastern convenience store clerk]\nHello my friend, How you do my friend? What would you like?\nYes, what would you like?\n(I want uh... pack of Backwoods...pack of Backwoods\nGive me a fifth of that privilege Hennessy and uh... thats it)\nThank you very very much\n\n[Verse 1]\nWhat you know about me? I'm Mac Dreezy\nCall Hennessy heem and a blunt a bleezy\nI keep a fat sack wrapped in a Backwood leaf\nSmoke trees that make me look Japanese\nGreen seedless, mean when I'm weedless\nNever in denial, I'm a fiend and I need this\nAny day is a bad day for Mac Dre\nWhen he ain't got it, they ask why he act that way\nI smoke champ, kush and Naid\n\"Man, what's Naid?\" Bomb that's sprayed\nI can't fade a beezy who don't keep a bleezy\nRolled for a neezy\nI ask her, 'What the feezy?'\nI gotta have weed to go get weed\nYou don't like it, kiss my ass 'til your lips bleed\nThis one's for the club so I'm kinda like keeping it clean\nSing it with me y'all...\n\n[Hook (x2)]\n(Bleezies n heem)\nI gots to have my dope\nEverywhere I go (Bleezies n heem)\nWhen they ask me, what's my drink?\nI say heem, man, what you think?\n\n[Verse 2]\nI L-O-V-E H double-E M\nI drink like ten of them things that swim\n\"He's heeming again\" is what they say when I come around\nI'll get dumb drunk and fuck up your compound\nYour building, your establishment\nMobbin', saying \"Cuddie, I'm hella bent\"\nOh what a feeling when you're looking at the ceiling\nAnd it's spinning and the earl starts spilling\nI drink heem when I perk, don't like Erk and Jerk\nIt don't work, when a nigga chillin'\nMight spill it on my Abercrombie Fitch\nKnow I got the man at the liquor store rich\nWell baby would you please run and get...\nMe another Hennessy fifth?\nBleezies n heem\n\n[Hook]\n(Bleezies n heem)\nI gots to have my dope\nEverywhere I go (Bleezies n heem)\nWhen they ask me, what's my drink?\nI say heem, man, what you think?\n(Bleezies n heem)\nI gots to have my dope\nEverywhere I go (Bleezies n heem)\nWhen they ask me, what I drink\nI say heem, man, what you think?\n(Bleezies n heem)\n\n[Verse 3]\nFire up, lets get drunk\nGet your cup, fill it up, don't be no punk\nA party ain't a party if every damn body\nAin't lifted and a little bit tipsy\nBut don't drink and drive, I remember one time\nMy cuddie Joogy, wrapped his fifty, rap this with me\nAnd if you don't understand\nYou a inbred, your daddy and your uncle was the same man\nI gotta have dope everywhere I go\nWhen they ask me what I drink I say, \"Heem, what you think?\"\nI gets heem in me, only substitute is Rémy\nIn Sac with Jimmy, or in Portland with Kenny\nI'm danked out, dranked out, can't talk, can't count\nIf I want some more I'm making baby pull her bank out\nYou cool on the bomb? What do you mean?\nSing it to him y'all...\n\n[Hook]\n(Bleezies n heem)\nI gots to have my dope\nEverywhere I go (Bleezies n heem)\nWhen they ask me, what's my drink?\nI say heem, man, what you think?\n(Bleezies n heem)\nI gots to have my dope\nEverywhere I go (Bleezies n heem)\nWhen they ask me, what I drink\nI say heem, man, what you think?\n(Bleezies n heem)", "year": "2001-11-20", "album": "It’s Not What You Say...It’s How You Say It", "title": "Bleezies N Heem"}], "artist": "Mac Dre"}