{"songs": [{"image": "https://images.genius.com/fe7b2d9af535866969cc7963ac422da8.900x900x1.jpg", "lyrics": "[Intro]\nThis is for anyone wishing they could do their entire life over:\nQuit sulking, you fucking pussy\nYeah yeah yeah, clown on my accent all you want\nI'll whoop your cat's ass. I'll whoop your grandmothers ass\nI'll whoop your sisters ass. I'll whoop your ass\nI'll beat your moms ass. I'll kick your ass\n\n[Verse One]\nIts the anti-socialite not-so-christian\nThat'll talk more shit than bitter and old women\nOn puny ass rappers with little-to-no rhythm\nFuck veganism give me some General Tso's Chicken\nI write weird songs that got hooks like Journey\nAnd if I grew my hair out I'd probably look like Fergie\nBut I'd never tinkle in my pants while I was on stage\nCause I was potty trained when I was four years of age\nI think a lot of people these days are bitches\nI also think that emo and emotional are different\nBut more so I hate white girls that talk like\n\"Aww hell no, girl I'm gettin' this shit crunk\nYou know what I'm sayin'?\"\nI'm not jokin', it's nothing but bark, I feel lost\nCan't remember where the fuck that I parked\nThe world is gray and blue but what skates me through\nIs knowing that I have a better music taste than you\nI used to like Tool until they made the same album\nThat they made the last time they made the same album\nEvery time they make a damn album its the same album, really\nAnd only stoners listen to their music, it's silly\nI still think the Deftones are dope\nAnd I like Nick Drake on the days I wanna let go of hope\nWilco is great and Ice-T is still clever\nAnd no matter what its ALWAYS Wu-Tang Forever\n\n[Hook] [x2]\nCalm down baby\nDon't you talk because\nCalm down baby\nDon't you talk because\nI don't need lovin' and I don't need help\nI'd rather ride in the car by my goddamn self\n\n[Verse Two]\nI'm 25 I started rapping as a sophomore\nIn those days I'd hide my cigarettes in my sock drawer\nUntil I heard my mom snorin' sleeping on the green couch\nAnd then I'd secretively sneak out\nMy first taste of heartbreak was at the park late one summer night\nI had a big crush on a girl named Sarah\nI was gonna ask her out until I saw Tim Phillips kissing her grabbing her butt\nAsshole!\nI was madder than FUCK and walked home\nOh, Tim Phillips smells like Cool Water cologne\nWell fuck him, his Mustang and all his other friends\nI vowed I would never love again\nAnd since then I've dated but fuck that I can't give nothin'\nI'd rather sail alone than have my damn ship sunken\nBeing single's par for the course\nI don't wanna cause a marriage\nCause I don't wanna cause a divorce\nIts probably important and its better for health\nBesides, I get the whole damn bed to myself\nBut what the hell everybody yells for me to drop down my guard\nNo! this heart of mine's for me, it's locked down and it's scarred\nGo home, I don't need me a wife, I'm happily single for life\nAlright?\nMy name is Mac Sheldon I'm a fire-sign Leo\nAlcoholic, anti-mall, anti-hero\nAnti-soccer mom, anti-hipster\nPro-eating Captain Crunch cereal for dinner\nPro-taking bong hits to cure your depression\nAnd pro-demo CD\nIf you got one let me check it\nBut never ask me what the hell I'm laughing about\nSee ya later\nI'mma go take a nap on the couch, alright?\n\n[Hook] [x2]\nCalm down baby\nDon't you talk because\nCalm down baby\nDon't you talk because\nI don't need lovin' and I don't need help\nI'd rather ride in the car by my goddamn self\n\n[Outro]\nGee, Mac... what are we gonna do about this Kansan accent of yours?\nWell, self, since you're asking in the third person\nWe're gonna fuckin' keep it!\nBecause it makes us pretty... and unique... and beautiful. Like birds!\n\nI'll whoop your mother's ass", "year": "2008-04-08", "album": "11:11", "title": "Calm Down Baby"}], "artist": "Mac Lethal"}