{"songs": [{"title": "Bustaclip", "album": "I Need Mine (Disc One)", "year": null, "image": "https://images.genius.com/ec6fd0ec1dc958208ad742d28e069f81.800x800x1.jpg", "lyrics": "[Lil' Flip]\nYeaahhh\nYeaahhh\nYeaahhh\nLet's take it back to the streets niggaaaaaaa\nEast coast\nWest coast\nMidwest\nTo the dirty dirtttyyyy\nIt's Flip Gates\nThe #1 fly boy\nI'm strapped nigga\nLet's get it poppin'\n\n[Verse 1]\nI got a brand new MAC I hope this bitch don't jam\nI had to bulletproof the Lam, I learned that from Cam\nYou want a thang got em yams go straight to Money Gram\nI'm from the hood, so you know I'm down wit any money scam\nBlack Glocks, white Glocks spit like sheet rock\nYou know a drank on me, this concert gon' stop\nA lot of cops at the scene tryin' to shut shit down\nYou was a nobody, but now you famous now\nI be out in Chi-town wit some real OG's\nMatter of fact one of them had dinner wit me\nYou gotta play by the rules when you on these streets\nYou lil' niggas tryin' to mimic what you see on beef\nYou betta\n\n[Hook]\nBustaclip (repeatedly w/ Lil' Flip ad libs]\nI can't deny it, I'm a straight rider\nYou don't wanna beef wit meee\n\n[Verse 2]\nI know some Long Beach Crips (fo' reeeall?)\nI know some Inglewood Bloods (bloods)\nAnd you can ask ??? fans I got Cali love (love)\nI got a strap waitin' for me everytime I land\nJust to send you a message, I'll clap your man\nNow he under white sheets like the Klu Klux Klan\nYou lil' boys shouldn't beef wit a grown ass man\nI got stripes in the hood, I put in work fo' real\nAnd mentioning me, will get you put in dirt fo' real\nHow much that gramma yay, bitch you carry weigh\nCause I'm on this Alize and I carry cake\nI came back to the streets I had to let y'all know\nAnd by the way my new deal worth 8.4\nSo I'mma\n\n[Hook]\nI'm strapped nigga\nI'm strapped nigga\nI'm strapped nigga, what about you?\n\n[Verse 3]\nThis for my Nap-town niggas all my G-town killas\nThe ones wit the blow and them 18 wheelers\nCross the state lines wit it on them waist line cocked\nCross lope and you know it's goin' doowwnnn (like Yung Joc)\n40 cal, 50 cal, what you workin' wit nigga?\nI'm in a Maserati what you swervin' in nigga?\nAnd when I'm out in Cleveland, I'm fuckin' wit X\nIt's been 'bout 5 years he still holdin' my tech\nI be in the gun range like everyday\nYou betta pray no drama ever come my way\nI'm in the studio now wit a gun on my hip\nAnd I'm tired talkin' 'bout the beef wit me and\nYou betta\n\n[Hook]\n\n[Lil' Flip Talkin']\nThis some shit for the street baby\nWe bust a clip everyday\nYou know what it is\nI do what I wanna do nigga\nWhen I feel like it nigga\nTrack And Productions on the muthafuckin' track\nFull Effeck is the muthafuckin' future\nCross them niggas, I shoot you nigga\nAny nigga, who got a gun and a chain nigga\nAnd that dough, that's a true d-boy\nCan't be a dope boy without a gun and a chain\nMake sure you got them extra clips nigga\nBut on the real nigga, don't hate on a nigga when you see me pull up on that Maserati\nI'm done wit the muthafuckin' Maybach\nFuck that shit nigga, I'm on some drop top flashy \"Flash Gordon\" type shit\nBiatch, BUSTACLIP!"}], "artist": "Lil Flip"}