{"songs": [{"title": "5 Bucks (5 On It)", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-31", "image": "https://images.genius.com/77c8c4775e5c1d31fe5ab3d65845291d.500x500x1.jpg", "lyrics": "[Verse 1: Big Sean]\nOK, I'm smoking loudly, I woke them all\nI pick up that tree, when it's not fall\nI'm gone off that tree, when it's not tall\nI'm in love with tree, I'm an avatar\nI pick up a O from, my nigga Ralphy\nMy bro and me, but he is not alphy\nGone off that goo punch, it makes me drowsy\nRoll up the windows, it makes it cloudy, Damn, if you ain't know\nI made these girl night, smoke a paper and bowls\nMy ladies like blunts, hit 'em twice if not once\nThen I blow 'em off and just pass 'em to my bro\nNow catch you getting brain if a nigga not learning\nI be spending money if a nigga not earning\nCatch me in the backseat if I'm not stirring\nAnd I be rolling up if a nigga not burning, boy\n\n[Chorus: Michael Marshall]\nI got five on it (Got it, good), grab your 40, let's get keyed\nI got five on it, messin' with that Indo weed\nI got five on it (Got it, good), it's got me stuck, and I'm tore back\nI got five on it, partner, let's go half on a sack\n\n[Verse 2: Chip Tha Ripper:]\nYou know a nigga like to stay at that cruising altitude up in the sky\nTry to fuck with paper planes but it's not the same high\nCleveland niggas ain't no bitches we prefer the cigarillo smoke\nIf you say it take away from taste then get some better smoke\nCause this shit I blow can get smelt on the next block\nAin't no middle mans every thing you need is in stock\nThis Glock is all the security I need\nI be solo dolo, when you see me blowing on some weed\nWhy speed, no need, I be just taking it slow\nI be so clean, diesel over powers my cologne\nNow all the bad bitches who blazed on shifting this way\nY'all just some white belts, with leaves I am the sensai\nNow bow to the bag never, save the best for last\nWhen I come around niggas know to hurry up and pass\nFuck a dime sack, let's cop a quarter pound now\nWhat the fuck is you gon' put down?\nNigga I got five\n\n[Chorus: Michael Marshall]\nI got five on it (Got it, good), grab your 40, let's get keyed\nI got five on it, messin' with that Indo weed\nI got five on it (Got it, good), it's got me stuck, and I'm tore back\nI got five on it, partner, let's go half on a sack\n\n[Verse 3: Curren$y]\nHot wired, 6-4 hydraulics\nNot stolen, lost my keys, I was high partna'\nFuck you want? This the raw paper not a blunt\nYou must, got me mixed up with Chip cause, This Spitta\nZig zag a whole zip up, shit strong shoulda' came with a bed pick up\nBitches calling me, wanna smoke beggin' for me to pick up\nShe blow me while I'm blowin' rings of that killa'\nThat weed you smoking brown, fake weed too much make up, clown\nGet real smoking green, strawberry fields\nHigh standing up feelin' like I'm layin' down, couple boujee Judy's came round\nActin' all stuck up, now they just stuck from smokin' with us\nHad the hallway smellin', Is my windows opening enough?\nI hear walkie talkies, Is security coming up?\nFuck\n\n[Chorus: Michael Marshall]\nI got five on it (Got it, good), grab your 40, let's get keyed\nI got five on it, messin' with that Indo weed\nI got five on it (Got it, good), it's got me stuck, and I'm tore back\nI got five on it, partner, let's go half on a sack"}], "artist": "Big Sean"}