{"artist": "Beanie Sigel", "songs": [{"lyrics": "You know my name, bitch\nUhh.. yeah.. hold up\nThe streets gave me heat, and the Eagle was the thing that they gave me\nIt's the rap guerilla that still clap.. fucka\nYeah, guess who's back?\n\n(Verse 1)\nMack, bitch - I move blocks and pounds\nI move out with small blocks from towns\nMove out with small Glocks and pounds (uh-huh)\nAnd I take everything to the table bag and rock it down\nFuck who watchin now; the neighbors, they in pocket now\nFuck you haters cop some pocket now\nWhen it come to coke you can't outwit me, mine cheap\nBout to take over the city of Philly like John Street\nNigga ask all y'all fiends, they call me Chef Boyar-Beans\nBeanie Crocker, cook coke proper\nRight amount of flour siffin it up\nCoke spots runnin by the hour shiftin it up\nGraveyard shifts, move packs in bundles\nBraveheart kids, use gats don't rumble\nGorilla niggas goin ape in this concrete jungle\nBanana clips'll make them monkeys humble\n\n(Chorus)\nBEANIEEEEEEEE! Sigel was the name that they gave me\nBEANIEEEEEEEE! Sigel was the name that they gave me\nBEANIEEE, BEANIEEE - Sigel was the name that they gave me\nBEANIEEEEEEEE! Yeah, but guess who back\n\n(Verse 2)\nIt's Mack, bitch - uh-huh, back in the mix or the scuffle\nI'm in the hood with them chips like Ruffles\nBoxman, Frito Lay, for that free dough boxin\nYou will lay, nigga I'm not playin\nListen, whether I make cash or take cash\nI'm in the hood eatin with my dog like when we break-fast\nB's on the hood and the wheel and the brake pad\nSheeit when I skate past, bitches shake ass\nI sit four-thirty deep in wheels\nYou bout, four-thirty cheap in wheels - small Benz\nLook at your small rims, small wheel, small grill\nBig Beans, sittin in Bentley my heart peels\nZero to sixty so quickly how you want it? You can have it\nDrop top, stick shift, automatic\nBack wheels still smokin\n64 still rolling, 3 wheel motion, it's ferocious\n\n(Chorus)\n\n(Verse 3)\nMack, aiyyo\nOn the low doe (shh!) the whole city is mine\nI'm trying to flood the whole city with dimes (yeah)\nI'm in the kitchen yeah, with that vision wear\nGet them digits clear you can come and get them pigeons here\nNiggas talk about the crack game slowed up, BULLSHIT\nYou switch to hustle when the rap game showed up (uh-huh)\nWhile you wastin your time spittin the rhymes\nI'm gettin mine spittin them rhymes, but still pitchin them dimes\nAnd the spot still sick with da grime\nGlock 26 nigga but I'm sicker than nine\nI'm live with the pound, small silencer calmin the sound\nStick with the seven, strickly smith with the seven (shit)\nWhen I drop back and cock back\nAnd pop that, I'm poppin for keeps -\nI'm not gettin stopped in the streets\nImagine that a nigga tryin to rock Mack\nOnly nigga did it was Jay and he did it when I signed the contract\n\n(Chorus - 2X)", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "Beanie (Mack B****)", "album": null}]}