{"artist": "Bhad Bhabie", "songs": [{"lyrics": "[Intro]\n30, you a fool for this one, Cheeze\n\n[Chorus: Bhad Bhabie & Plies]\nGu-Gucci flip flops, fuck it, hit your bitch in my socks\nThis a big watch, diamonds drippin' off of the clock\nPull the 6 out, wintertime, droppin' the top\nGive it to that pussy ass, turn the shit up a notch\nGucci flip flops (Fuck it), make it kick rocks (Bust it)\n(Aye, Bhad Bhabie)\nThis a big clock, check the wristwatch (Check it)\n(Aye, Plies checkin' in)\nGucci flip flops, fuck it, hit your bitch in my socks (Bust it)\n(This a Florida thing, they wouldn't understand)\nThis a big watch, diamonds drippin' off of the clock (Off the clock)\n(Aye, lemme tell it to 'em)\n\n[Verse 1: Plies]\nIf a nigga snatch your chain, then he ain't down with yo feature, bruh\nIf she let the whole gang hit, then she a eater, bruh\nShe yo lady, she ain't got a bag, then what you teaching her?\nNo, you ain't goin' up and let it rip then what you reaching for?\nBust it open, ain't like what I smell, this ain't no Captain D's\nYou a Whopper Jr., I'm a Whopper, I got extra cheese\nGrass it got my eye-lids low, look like I'm Japanese\nWah, wah, wah, like Lil Baby, bitch yes indeed\nHe never call about it, he just trollin' again\nWanna see the snakes in your yard, you better mow it again\nAye, Christian Louboutin got my whole shoe bloody\nAye, went to H-town got my whole cup muddy\nAye, I got a bag I can't snooze, bitch\nI got the tool on me\nI'm from the south, I hit the gas\nRrr, that is the doors on it\nIf ya house nasty, I don't wanna poke\nThat's just the rule, mommy\nHit her in some Gucci flip flops, you can't lose, homie\n\n[Chorus: Bhad Bhabie]\nGu-Gucci flip flops, fuck it, hit your bitch in my socks\nThis a big watch, diamonds drippin' off of the clock\nPull the 6 out, wintertime, droppin' the top\nGive it to that pussy ass, turn the shit up a notch\nGucci flip flops (Fuck it), make it kick rocks (Bust it)\nThis a big clock, check the wristwatch (Check it)\nGucci flip flops, fuck it, hit your bitch in my socks (Bust it)\nThis a big watch, diamonds drippin' off of the clock (Clock)\n\n[Verse 2: Snoop Dogg]\nI only smoke when I drink\nGot silk, rock mink to the floor\nAnd everything I get is on the ho\nGot cars, got homes with pools and saunas\nLake with piranhas and some blue iguanas\nGot cops on my tail, call Shamiqa and Darnell\nBad, bad, bad to the bone is what these bitches is\nText bad, 187 that's what the business is\nGet away, smooth on the slide\nNow I'm in the 305, I'm getting high, ride\nSo I hit up Plies, we the big macs\nMunching on these small fries\nGangster shit, straight hip-hop\nFuckin' your bitch in Gucci flip flops\nBig Snoop Dogg, I'm hard to deal with\nRest in peace triple X, that's on some real shit (What? What? What? What? What? What?)\nYeah, that's on some real shit (What? What? Yeah)\n\n[Chorus: Bhad Bhabie]\nGu-Gucci flip flops, fuck it, hit your bitch in my socks\nThis a big watch, diamonds drippin' off of the clock\nPull the 6 out, wintertime, droppin' the top\nGive it to that pussy ass, turn the shit up a notch\nGucci flip flops (Fuck it), make it kick rocks (Bust it)\nThis a big clock, check the wristwatch (Check it)\nGucci flip flops, fuck it, hit your bitch in my socks (Bust it)\nThis a big watch, diamonds drippin' off of the clock (Clock)", "image": "https://images.genius.com/d062c8d0c00ea79f5b6cdc222ec922a3.500x500x1.jpg", "year": "2018-10-02", "title": "Gucci Flip Flops [Remix]", "album": null}]}