{"songs": [{"image": "https://images.genius.com/2cbec7b745c109ceb67758132235acd9.600x600x1.jpg", "year": "1998-08-25", "title": "Don’t Let the Money Make You", "album": "40 Days & 40 Nightz", "lyrics": "Intro: [An interview with Xzibit]\n[I] I want to ask you, what is more important to you guys?\nAll the money that you guys are talkin' about?\nOr the artform? Or, what is more important? The Lyrics?\nOr the leather sized stuff?\n[X] I think, what we tryin' to do is suck alot of dick`\nYou know what I mean, that, that like he said, is a fine\nLine where gotta pleas the crowd or pleas the artists\nThat are listenin' to you. And pleas the real hip-hop\nUnderground people that, that, that is looking for that\nYou know, that real cock. It's only a certain way that\nThat you can go up and doin' it\n\nVerse 1: [Xzibit]\nXzibit keep it on dick\nLive, vinyl, CD or cassette\nWhatever you select\nI keep you bouncin' like a bad cheque\nSee I should have a trigger tattooed on my dick\nTo represent all the times i ejaculate early\nNow you can take the highs out of the beat\nBut never take the rucked out of the rhyme\nOr tribalize, look into the eyes of the emotional\nYour whole style is promotional\nA dead giveaway to me is just another business day\nXzibit here to stay\nMy life, a tribute to the A.K\nYou wanna play with my balls?\nA situation only one man can walk away from\nThe same way he came\nWhen I spit flame, it spits flames like your middlename\nSo why do I say fuck the fame\nBecause it come and go\nThe industry's a pet without refused to be that gigolo\nI put the dope in, got fo's and tatoos\nNiggas make ya money\nBut let the money make you\n\nHook: [King T] x2\nWe make, make money, money\nTake's money to survive\nThe meanin' of life with statted chips is stay alive\nCause it's all about the C-notes\nGonna be fuckin' when you're rollin' this too\nDon't let the money make you\n\nVerse 2: [Soopafly]\nIt's Soopafly\nComin' with that gangsta\nThat shit that only gangstas be gettin' gangsta with\nThe pimps, hustlers and the players know the rank I get\nNever have to get no money from the bank, I get shit\nI Stomp down your whole compound\nTakin' all the shots\nDevice from the few I'm rise\nLet the others drop\nI elevate my erect dick\nWho drop when a dime never got me straight im gay\nI'm still goin' for broke\nI push you to the stroke\nAnd one man loc and say high\nSmokin' to keep an open, mind\nFocus on military time provokin'\nThe G in me, nigga\n(?) when he tried to step the Soopafly\nAZ you are shit\nNow gettin' down with the Pound\nNow who can shake it till it break ground\nMany motherfuckers are greedy\nThere's only one thing needed like E.D.I, Amin / I mean business\nWhen it comes to the cash, I'm movin' quick\n(Xzibit: Any other nigga eat my hard dick)\nFuck type shit\nMake ya step back\nSoopafly, hit like crack\nLife is a jet\nMaintainin' the top figures deliver\nThe raw, rugged likwidation that be runnin' the river\nNow, whether if a nigga step up\nBe prepared to kick your rap up\nTry to die in line for you cheque, huh nigga\n\nHook: [King T] x2\n\nVerse 3: [Xzibit]\nSo when I die\nBury me upside-down\nSo the whole world can kiss my ass\nLive fast\nSippin' from my bottomless glass of Hennessy, straight\nSo I catch you (?)\nXzibit comin' down like a saint\nSo prepare for the judgement day\nBe careful what the fuck you say\nRhyme these parts\nAmadeus and Mozart\nThe love for the arts and crash\nParagraphs to bust niggas in half\nThat's what I fuck with\n(?) time to get my duck sit\nMiss me if you try to make a buck with\nI mean a quick buck, only got alot of men to fuck\nBlack cash every black trash\nNever relax, never get attached to anything\nThat's not gonna hand so life\nI come back like Joe Mama\nPacific natural ice\nWith Sharif makin' sure R&B, was well done\nMight live by the gun\nBut keep livin' through my asshole\n\nHook: [King T] x4\n\nOutro:\n[King T]\nWe make, make, money, money, make, money, money, money (x4)\nWe take money, take money, take money, money, money (x4)\n[Soopafly]\nDon't let this money make you"}], "artist": "Xzibit"}