{"songs": [{"year": null, "image": "https://images.genius.com/8bcb4f13231c32e3d05c93927a59e931.300x300x1.jpg", "title": "Blueprint", "album": "The Purple Tape", "lyrics": "[Intro]\nUh, yeah\nRapper\n\n[Rapper Big Pooh]\nSo many albums in the six-year span\nGettin pats on the back like, \"Nigga, you the man\"\nI am, in a trance, this is movin too fast\nFallin out of touch, you would think of the past\nFull blast, here we go, on tour, 'nother show\nPeople don't know the difference, only had a video\nHe's Tay, I'm Pooh, no 9th, get it right\nWhen the sun comes up, that's the ending of my night\nTake flight, overseas, tryna stack a few Es'\nHad a couple pounds, come home, make 'em Gs'\nI see shit change in the matter of some years\nWe the older brothers gettin lacked by our peers\nNo tears, you surprised? Huh, clap for 'em\nShout to Little Brother, we gave 'em the platform\nI'm a storm when it's calm, the great agitator\nPeace to Jaycee, take me out with the fader\n\n[Chorus]\nYou can say what you wanna say about my crew\nMost new niggas out been influenced by who?\n(JUSTUS!) We the blueprint, watch how we do shit\nPeace to Jaycee, take me out with the fader\nYou can say what you wanna say about my crew\nMost new niggas out been influenced by who?\n(JUSTUS!) We the blueprint, watch how we do shit\nWe inspire all of y'all through our music\n\n[Rapper Big Pooh]\nSo many shows in the six-year span\nGettin pats on the back like, \"Nigga, you the man\"\nI am, in a trance, this is movin too fast\nPound on my knees, pray to God that it last\nI been down to my last more times than I could count\nShould I sell my soul for a sizable amount?\nThat's a no-go, slow-mo, now I'm out the front do'\nHands up, on stage, 'round here like a go-go\nI said \"FUCK promo!,\" we gotta get paid\nTouchdown indy city, know the club get slayed\nNiggas used to think we would blow like grenades\n'til life played the barber and she cut us all fades\nNow when I'm out, certain niggas throw shades\nCause they listen to the (station) when I ain't bein played\nWhy get mad? Get even, when I feel like leaving\nI plan to be full off lemonade\n\n[Chorus]\n[Outro]\nI mean, real talk man..\nAt the end of the day\nWe made it possible for you niggas to be you\nI mean, it's ain't e'en on no \"on my dick\" shit\nThis is real talk, nigga\nI mean, we were the muh'fuckin guinea pigs, niggas\nHeh, bow down and respect nigga\nYou can say what you wanna say, ha yeah, yo\nYou can say what you wanna say, ha yeah, yo\nYou can say what you wanna say, ha, listen\nYou can say what you wanna say"}], "artist": "Rapper Big Pooh"}