{"songs": [{"year": "2003-01-01", "title": "Hooligan Rap", "image": "https://images.genius.com/cff949e333e91bd4776ee32fef57ea4a.360x360x1.jpg", "lyrics": "[Intro: Saigon]\nHold that.  It’s hooligan raps (Haha).  Niggas is (It’s hooligan raps) out here at 7:30, thinking you could fuck with me, nigga (It’s hooligan rap).  You fucking niggas can’t rhyme, nigga (It’s hooligan rap)\n\n[Verse 1: Saigon]\nAyyo, I’m powerful.  I shower you Power-U’s with a Calico\nYou could know how it feel to have a slug in your clavicle\nAnd I ain’t even mad at you.  I just like making\nAny tragedy more tragical.  It sounds sick but it’s actual\nThirty-five thousand and forty hours of watching cowards\nGet killed in the showers.  Blood clump like milk when it sours\nI’ve even seen grown men that broke home-zoning\nBrother where his mother of his kids was home boning\nThe same cat that caught him and the cat phone-jonesing\nFinally hung up—they found him at four in the morning\nNothing your queer crew do could compare to\nThe shit that I had to bear through.  I ain’t trying to hear you\nYou never was a Glock slinger, pop singer\nRun this or you gon’ tongue-kiss this mop wringer\nYou niggas better get low ‘cause Saigon is destined to blow\nIf not, I’ma get locked for unlocking and letting it go\nProfessional flow, spit unquestionable\nTold you I’d make you a vegetable\n\n[Interlude: Saigon]\nYo, that’s crazy (Yo, yo, hooligan rap).  What else you got, though?  That’s all you got (What’s that, man?).  Take that shit, nigga\n\n[Verse 2: Saigon]\nI said: here I am twenty long years since my child birth as\nStill remember the nurses who said I’d grow to be worthless\nOne said, “Look it.  Another youngin born a sinner”\nShe didn’t say, “Youngin,” though, yo.  You know she used the n-word\nI looked at the bitch.  Was only here for a minute\nThe bitch looked back grinning.  I know when I’m comprehending this shit\nAll the noise in the nebulizer was hard to listen\nBut when she went to pick me up, yep, I started pissing (Take that)\nBut ever since benevolence wasn’t in the frame of my thought\nI became shorts who kept his moms in and out of the courts\nActually, man had bigger mans to fracture me\nFigured he creep, rock me to sleep, come and capture me\nBut naturally I caught on.  Thinking I’m sneaking but, see, I thought wrong\nThey placed in juvie somewhere near Hawthorne\nWasn’t my turn to burn.  That only made me more lethal\n\n[Outro: Saigon]\nNah, nah, nah, listen, fat man.  Don’t even do it like that, nigga", "album": "Saigon A.K.A. Da Yardfather Vol. 2: On the Go Back"}], "artist": "Saigon"}