{"artist": "360", "songs": [{"album": "Please Be Seated 3", "year": "2016-02-22", "title": "Jungle Jimmy", "image": "https://images.genius.com/88c1e39a08ef59af4f7539446b1fc7a4.500x500x1.jpg", "lyrics": "[Intro]\nMotherfuckin' yo\nIt's Tommy Sixx\nJungle Jimmy cunt\nWhat's good cunt?\nLet's fuckin' get it cracking cunt\n\n[Verse 1]\nDo you feel what I say? (I do) 'Cause I say what I feel (Whoo!)\nI'm high as fuck without takin' a pill (sober!)\nNot aimin' for a killing but I'm aimin' to kill\nWon't say no that I'm makin' a mil'\nPlenty of fish so I aim for gills (straight for the gills)\nI start rolling, arsehole with my arms folded\nMark Holden, say something that ain't nothing, my heart's cold as\n[?] anybody want it, they're like \"hell no\"\nI just want to know if Adele wrote \"Hello\" doing hard times on the cellphone\n\n[Bridge (sampled)]\nThey ask me what's my goal, then they like \"what the fuck\"\n'Cause I don't want the crown, for me, that's not enough\nYo, I can see the future, I'm the best that's ever livin'\nAnd I've got four years, that's twenty-twenty vision\n\n[Verse 2]\nBent dick's what I'm known for (Yep), bagged a ten since '04 (Yep)\nShe see the D she like \"no more\", then she feel the tip she like \"No, more!\" (Ha)\nI'm so raw, you don't wanna be the one to know more\nThey turn it out, go work it out, I got a perfect house, no floors\nThree-Six-Oh the name brand, check it while I rain-dance\nI yearn for the moot, head first in the bush, faceplant\nFindin' yourself is like findin' your keys\nFind the best tits and you sign them and leave\nIf you be cold and you're likely to freeze\nHug on my dick 'cause it's ninety degrees\n(I hope you actually get that) I had to redefine peace of mind\n(Whaddup?) Kidnapped DJ Khaled just to key his ride\nThat's another one, anybody wanna get into it\nYo, they never do it 'cause they fuckin' run, won't stop till we number one\nI gotta shout your mum ('sup babe) yo, that's my favourite lover\n(She is) 'Cause, when we fuck, we like to do it like we hate each other\n(Take it bitch!) I'm on a beast mode tip, I got the cheat code, bitch\nGo find the best porn star, tell her to deep throat this\n(Deep throat this, babe) See you don't know how big my ego is\nYo, I might travel the world now that's an ego trip\nI'm on fire, I don't have to warm up\nYo. I thought that Instagram was an app to score drugs, go\n\n[Outro]\nYeah\nSo, I might be sober and off all the drugs and all that shit, but\nI'm still kinda scattered from my last bender\nSo, I'm still gonna make out of it songs like this all the time\nUh, my brain is forever fuckin' cooked\nJungle motherfuckin' Jimmy\nTommy Sixx\nForthwrite bitch"}]}