{"artist": "6ix9ine", "songs": [{"year": "2016-10-30", "title": "SINALØA", "album": null, "lyrics": "[Intro: Shotti & 6ix9ine]\nScum Gang!\nProject GHXST\nYo, 6ix9ine, talk your shit, Blood\nNiggas don't want no parts, it's rundown season, hold it down\nIt's only the squad\n\n[Chorus: 6ix9ine]\nThey say when they see me they gon' wet me\nStill ain't wet shit (They ain't wet shit!)\nThey say when they see me they gon' test me\nStill ain't said shit (They ain't said shit!)\nThey said when they see me they gon' rob me\nStill ain't took shit (They ain't rob shit!)\nThey said when they see me I'ma run\nI don't duck, bitch\n\n[Verse 1: 6ix9ine]\nAll that talking, boy, stop (Boy, stop)\nHeard you dancing, boy, stop (Boy, stop)\nNeed a lesson, boy, stop (Boy, stop)\nIntermission, boy, stop (Boy, stop)\nQuit that popping, boy, stop (Boy, stop)\nI know what's cracking, boy, stop (Boy, stop)\nWhat you jacking? Boy, stop (Boy, stop)\nWhat you saying? Boy, stop (Uh!)\nAll that talking that you doing gon' get your boy shot (Grrah, grrah!)\nAll them hollows to his chest gon' make his heart stop (Blaow!)\nPut that .30 in your face, like, \"What's in your spot?\" (Grr, grr!)\nRun that bitch, run that cash, fuck with us you cannot\n(Fucker, fucker!)\n\n[Chorus: 6ix9ine]\nThey say when they see me they gon' wet me\nStill ain't wet shit (They ain't wet shit!)\nThey say when they see me they gon' test me\nStill ain't said shit (They ain't said shit!)\nThey said when they see me they gon' rob me\nStill ain't took shit (They ain't rob shit!)\nThey said when they see me I'ma run\nI don't duck, bitch (We don't duck!)\n\n[Verse 2: 6ix9ine]\nYou don't know what it is, being on T.S.O (You don't know!)\nYou don't know what it is, facing fifty 'front the judge (You don't know!)\nYou don't know what it is when your bid 100k\nWhat it is, stickin' up commands on the fuckin' tip (Stick it up!)\nThis jail shit'll show you, who's a fraud, who a fake (For real)\nWho just talkin' just to talk, who just hatin' just to hate (For real)\nDo my thang, I'm a real individual (A real one)\nFuck a fraud nigga who's goal is try to swindle you (Fuck 'em, fuck 'em, fuck 'em, fuck 'em)\nGoons all around me, killers all around me (Squad, squad)\nSnitches get from 'round me, get that 40 on me (Clip, blaow)\nGoons all around me, killers all around me (Squad, squad)\nSnitches get from 'round me, get that 40 on me (Clip, blaow)\nYeah, we rolling T-T-T (Got the gat)\nAnd I keep it E-B-E (Got the gat)\nShout Y-G-C, on my block banging N-D-G (Squad)\nYeah, we jackin' E-B-K (Got the gat)\nNo man is G-B-G (Got the gat)\nY-S and D-O-D\nGang signs all L-O-D (Got the gat)\n\n[Chorus: 6ix9ine]\nThey say when they see me they gon' wet me\nStill ain't wet shit (They ain't wet shit!)\nThey say when they see me they gon' test me\nStill ain't said shit (They ain't said shit!)\nThey said when they see me they gon' rob me\nStill ain't took shit (They ain't rob shit!)\nThey said when they see me I'ma run\nI don't duck, bitch (We don't duck, nigga!)", "image": "https://images.genius.com/859ef2b1cd3882bdd81051014912a483.899x879x1.png"}]}