{"songs": [{"lyrics": "[Verse 1]\nI'm so far ahead of my time I'm 'bout to start another life\nLook behind you; I'm 'bout to pass you twice\nBack to The Future, gotta slow up for the present; I'm fast\nNiggas can't get past my past\nHow you propose a deal with the perfect present?\nWhen I unwrap The Gift & The Curse in one session?\nAin't no living person can test him\nOnly two resting in Heaven can be mentioned in the same breath as him\n7 straight summers; critics might not admit it\nBut nobody in rap did it quite like I did it;\nIf you did, I done it before\nYou get it, I had it;\nI got mad at it, I don't want it no more\nAnd that comes from everything, from flippin' that raw\nFlippin' whores, flippin' vocal cords\nDon't get it twisted, get it right\nDid it different, did it better, did it nice\nDid the impossible, and then I did it twice\nYoung!\n\n[Verse 2]\nYoung H.O., fresh from Italy\nTrip financed by my best ability\nSame one helped me in extra realty\nFor my mom, for my nephews, a bunch of lil' me's\nFlip flop by Versace, hip-hop got me here\nMusic made me a millionaire, yeah\nMulti for what's inside of here\nInside my heart, besides that, I'm smart\nPrepare poems with a passion, at the same time cash in\nTook the best of both worlds minus the madness\nThough controversy follows me everywhere I dock\nEverything I hear I block\nOut like the jealous clouds do the sun\nThen I sit back and recline since my shine has shone\nAnd then sure nuff bust out something foreign with the doors up\nMaybe the lilac Porsche\nThe lavender Retriever\nI only bring my homies back purple reefer\nI only smoke in Ibiza\nIn Capri, somewhere foreign that you need your visa\nYup, Hovi's home; but it's like I never left, I had the global phone\nYup, yeah I stayed in touch\nI heard y'all back home complaining, y'all complain too much\nSo hateful, bunch of dudes I put on out there acting so ungrateful\nBut daddy's home, and he brought the forty autie-matie chrome\nFor all the chatty-chatty y'all been doing\n\n[Verse 3]\nWhile y'all was running your mouth complaining about Summer Jam\nI was in flip-flops in the South of France\nSee how it flip-flops with the number one station for hip-hop and r&b?\nYou thought Summer Jam was starring you? It was starring me\nEven in my absence, my presence is felt\nThat gotta tell you I'm the king, dog, if nothing else\nI'm on another continent, you still ain't content\nI'm in the Mediterranean, you still ain't vent\nExplain to me why I want to be you again\nYou on the radio crying, I'm learning to swim", "title": "2002 Funk Flex Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}