{"artist": "YG", "songs": [{"image": "https://images.genius.com/59064082da48f1c48bf96d62c598b6c3.1000x1000x1.jpg", "year": "2018-08-03", "album": "STAY DANGEROUS", "lyrics": "[Intro: YG]\nUh\n\n[Verse 1: YG]\nStars in the roof, sittin' in the Wraith\nGot it all off these bars, man, this shit kinda crazy\nI been out wildin' with these young niggas lately\nFuckin' all the pretty bitches, man, this shit kinda crazy\nI'm blessed so it’s brazy, lifestyle too much for ladies\nI been on some player shit, hoops my nigga don't make\nYou is not the reason I'm pullin' up in the latest\nWestside nigga, ho, I don't need no favors\n\n[Pre-Chorus: YG]\nAyy, damn this beat got bass\nEverything that's bad for me right here in my face\nI been on the fo' block, I been on the A\nGun up on my waist like I'm tryna catch a case\n\n[Chorus: YG & YoungBoy Never Broke Again]\nMove bitch, a nigga need a little space\nStank look on my face, that's too much drugs and drank\nBein' haunted  'bout my past, someone help me get away, damn\nWhat you think I do? I buy more drugs and drank\nMove bitch, a nigga need a little space (uh-huh)\nDon't tell me I'ma be okay 'cause this shit not okay (uh-uh)\nGive a fuck 'bout what you think bitch, fuck what you think (fuck you bitch)\nBut don't come judgin' me 'cause I had too much drugs and drank\n\n[Verse 2: YG & YoungBoy Never Broke Again / Both]\nI ain't in the mood bitch, don't come inside my gate\nThat's trepassin' you bastard, I can shoot you in your face\nIf I run past you, my bad, my whole life feel like it's a maze\nBeen drinkin' my life away, they can't stop me, I go crazy\nDrunk drivin' in that G-Wagon, they tell me it ain't safe\nBut I'm drunk drivin' that G-Wagon\nGet your square ass out my face\nThe homie just got a Wraith (Wraith)\nPo-Po brought him my name (name)\nThey know we from the gang, this shit out my range\nThis shit out my fuckin' range bitch\nI ain't plannin' on a change bitch\nI'm goin' through a field of pain bitch\n4Hunnid gang, click-clack, bang bitch\nI'm haunted by these demons, yeah, I see 'em walk (walk)\nSo you know I got the devil in my thoughts (thoughts)\nI be seein' the devil in my living room hall (hall)\nI just hope I ain't got the devil in my little Heart (this shit for real)\n\n[Pre-Chorus: YG]\nAyy, damn this beat got bass\nEverything that's bad for me right here in my face\nI been on the fo' block, I been on the A\nGun up on my waist like I'm tryna catch a case\n\n[Chorus: YG & YoungBoy Never Broke Again]\nMove bitch, a nigga need a little space\nStank look on my face, that's too much drugs and drank\nBein' haunted  'bout my past, someone help me get away, damn\nWhat you think I do? I buy more drugs and drank\nMove bitch, a nigga need a little space\nDon't tell me I'ma be okay 'cause this shit not okay\nGive a fuck 'bout what you think bitch, fuck what you think\nBut don't come judgin' me 'cause I had too much drugs and drank\n\n[Verse 3: YoungBoy Never Broke Again]\n(And I'll pull up)\nAnd I'll pull up with a hundred in each pocket bitch (skrrt)\nFresh up out the slammer, that lil' nigga on some cocky shit\nPlay me like a jit and you get hit up\nYou ain't stoppin' shit (grrah, rrah)\nTell me when to pull up\nMake the train ride in the lobby bitch (all in the lobby)\nMove bitch, get shot up in your face (bitch)\nNiggas 'round me hate, tryna figure what I made (damn)\nCan't make it to my house if I don't buzz you at the gate (beep)\nSecure 'bout my gang, bitch I gotta play it safe\nPlenty racks off in the safe, shit (racks)\nCheck it, you get mate, bitch\nFive, that's my Blood blatt, strictly that 4L shit\nQuick, a shooter 12 shit, without the dope, young nigga rich\nChallenged at your own risk\nI up and bust your dome bitch (boo-bow)\n\n[Pre-Chorus: YG]\nAyy, damn this beat got bass\nEverything that's bad for me right here in my face\nI been on the fo' block, I been on the A\nGun up on my waist like I'm tryna catch a case\n\n[Chorus: YG & YoungBoy Never Broke Again]\nMove bitch, a nigga need a little space\nStank look on my face, that's too much drugs and drank\nBein' haunted  'bout my past, someone help me get away, damn\nWhat you think I do? I buy more drugs and drank\nMove bitch, a nigga need a little space\nDon't tell me I'ma be okay 'cause this shit not okay\nGive a fuck 'bout what you think bitch, fuck what you think\nBut don't come judgin' me 'cause I had too much drugs and drank\n\n[Outro: Albert \"Alchemist\" Thompson]\nLord, help me Lord. These kids Lord, they playing with all these guns and drugs, they remind me when I was young. See, in the 80s, we didn't play that shit. But we was crack babies. No Lord, I'm not no hypocrite, I'm just an old motherfucker, tryna save some shit. Lord, I ask my son \"Why it is just thugs he hang out with?\" He looked at me and said \"Pops, I'm staying dangerous.\" Help me Lord, I tried to tell him there are many ways to stay dangerous. Power is dangerous, knowledge is dangerous, having them dollars is dangerous. He just looked at me Lord and said \"Pops, I'm talking dangerous.\"", "title": "666"}]}