{"songs": [{"image": "https://images.genius.com/8e64a159a548b0937569e7140d104c1c.500x500x1.jpg", "year": "2011-02-08", "title": "G.O.O.D.", "album": "Thanks for the Doughnuts", "lyrics": "[Hook] [XV]:\nI'm G. double O.D\nI'm G. double O.D\nI'm good, good, good\nI'm feeling G. double O.D\nAnd the girls on me look good, good, good\nI show up to the club and the owner show me love and say I'm good, good, good\nYep, and all around the globe, everybody bout to know that he's good, good, good\n\n[Verse One] [XV]:\nI'm G. double O.D\nI hope you O.D. off of this rhyme\nCause I'm about to change minds like cold feet\nIn store for a meal, groceries\nBut they be like, \"It mostly don't come over night...mostly\"\nGo and get your rosaries cause I'm about to kill this, no Halo like Sony\nAnd if your girl a little horse like a pony?\nUh hmmm, well of course start pointing\nFly boy club, well course I'm soaring\nSo my logo gonna always be in the air like Jordan\nAnd they always gonna stare, just ignore them\nCause now you're with the X-Man, I'm gonna call your Storm\nI'm touring, say goodbye to that hood and ummm\nIt's foreign enough under that hood and ummm\nI feel like a dude this fly, dope and cool should feel\nSo I guess I feel good\n\n[Hook] [XV]:\nI'm G. double O.D\nI'm G. double O.D\nI'm good, good, good\nI'm feeling G. double O.D\nAnd the girls on me look good, good, good\nI show up to the club and the owner show me love and say I'm good, good, good\nYep, and all around the globe, everybody bout to know that he's good, good, good\n\n[Verse Two] [Really Doe]:\nJesus piece official and Yeezy's check\nWe was running shit last time I check\nIf I'm in the building, best believe its a check\nInvolved, cause we ball\nShe say, \"My throat clear now Doe. Thanks for the Halls.\"\nI say, \"I love giving back.\" Baby, down for the cause\nCage us up like animals who stop at the mall\nFound the spotlight at the end of the fog\nThey say I party too much, T.O. up in the endzone\nBut back when I was broke, they didn't even have a show room\nNow I walk up they go, \"There go Doe, mooooove.\"\nTo the sounds of C hugs and pounds\nDifferent weight class like sumo\nI'm out like UNO if you're trying to get knocked up like Juno\nUnfortunately, sent you off\nBut you know, if Doe killing these niggas, go start the promo\n\n[Hook] [XV]:\nI'm G. double O.D\nI'm G. double O.D\nI'm good, good, good\nI'm feeling G. double O.D\nAnd the girls on me look good, good, good\nI show up to the club and the owner show me love and say I'm good, good, good\nYep, and all around the globe, everybody bout to know that he's good, good, good"}], "artist": "XV"}