{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/4fd44ab3b93f85d2dd3a6c82f4bc29a3.479x479x1.jpg", "title": "New World", "year": "2013-02-07", "album": "19", "lyrics": "[Kool A.D.]\nDon't watch me, watch Vimeo\nBeats by Plinio, trees like really whoa\nReally though, Kool A. Dilly so guillotine\nMoving like I got hella legs like a millipede\nFor real indeed, billed to make krill for the seas\nContractor, open up the door, I am a velociraptor\nHulu nation in the 90s in front of Wendy's\nI have my own chapters, [?] to a hole for laughters\nHelicopter blade, Fambo, Everglades\nCheddar made\nCheddar spent on me is better never spent\nI mean, wait, maybe never better spent (yeah)\nDead presidents for me, me, me, me for president\nG3 Matisses from the Met leave no evidence\nEye of Providence in the pediment\nWeather sedimentary rocks\nIt's elementary my dear Watson, never forget it like an elephant\nHella bent, get a pen\nTake it as a letter from the resident medicine man\nIntelligent tan, Umbrella Man, Rain Man\nMr. Make-it-rain damn brain damaged\nBrain changed, a little strange\nBut still the same man\nHalf brand X [?], name brand\nInsane fam, two holy cities on the same land\nChitty Chitty Bang Blam\nDamn, dang, damn, lam-blam\nThe rest is just Pebbles to the Bamm-Bamm\nBlindfolded in a handstand\nYour man kick it Van Damme\n[?] can-can\nCan you do the [?]\nNo I should probably come into little [?]\nCrow like the rooster do\nYou know it's like they don't hooty hoo like they used to do\nI Do the Dew to you, I'm pushing sugar waters\nTo all the baby mommas and sugar papas\nStop it, stop it, shit, stop it\n\nMaking burgers with Bizzy\nFeeling dizzy huffing computer cleaners with super seniors\nSuper soaker\n[?] chicks call it an investment\nPay me like rent, I'm expensive\nThough sometimes I lend to friends on some friend shit\nEverything I say, I think I meant it\nOh I think I meant it\nOh I think they like it when I say I think I meant it\nOh I think I like it when they like it when I say I think I meant it\nPlus I meant it when I said I think I like it when they like it when they say [gibberish]\nNah nah nah nah nah nah...\nNah nah nah...\nNever mind, never mind, never mind\nNever mind, never mind, aha\n\nLooking at my Casio, it's classy-o, it's cheddar time, ha\nNever a better time than cheddar time to let it shine\nInteriors is leather-lined, serious, a clever mind\nHere he is better designed, clearly it's better with time\nYearly it's better than wine\nLet it rewind"}]}