{"artist": "Boosie Badazz", "songs": [{"album": "Incarcerated", "title": "Chill Out", "year": null, "lyrics": "[Intro: Lil Boosie]\nLil Boosie Bad Azz\nA lot of these niggas ain't ready to be no gangsta\nSo my word of advice to y'all niggas, chill out\n\n[Verse 1: Lil Boosie]\nNobody hate me cause they love me\nThey know I'm thuggin' I ain't backin' down from nothin' I ain't stuntin (patna)\nI'm from a real street with real heat called G street\nCross the track we 50 deep how them thugs creep\nBein' niggas from fat, skinny, ta thin niggas chill out for you be up in that jail house\nMama's ain't bring us up to be no gangstas, The hood got us all with anger hood got us all in danger\nNiggas throwed on every corner bottle after bottle, another kidney gettin' weak, from every swallow\nThought he was gone kill one when he bust that choppa\nHe let it off and killed wohty, and all his patnas\nNow he locked up in a 6 man cell (Gettin fucked)\nWhen he touch down he a straight up gal\nWanna be a husle ain't even got no street sense\nYou don't deserve it anyway\nAin't from that dirty anyway\n\n[Hook: Lil Boosie x2]\nIt's too late to be the dope man (chill out)\nHoes love you till you broke man (chill out)\nWatch ya friends real close man (chill out)\nThey give you life up in court Lil nigga chill out\n\n[Verse 2: Lil Boosie]\nYou wanna life sentence? (think about it)\nYou wanna get put on lockdown were you can't write niggas?\nYou wanna get threw on that wrong line to fight niggas?\nIf you wanna be a rapper you gotta be dedicated (see mee)\nNigga couldn't tell Boosie shit that's how Lil Boosie made it Nigguhhh chill out, take that grill out yo mouth\nGo and sell it fo 300 go get a half a oz (haaha)\nMoney talk, bullshit walk a thousand milles\nHo's go say they love a nigga but they love the shinee\nSo many niggas want my shine so I keep a 9\nIf I'm stressin I need purple 2 ease my mind\nYou don't know 'bout taken losses you don't know 'bout throwin' crosses\nYou got yo gold in yo mouth and got yo pistol now\nAin't nobody done ya nothin' but, you a killa now\n\n[Hook: x2]\n\n[Verse 3: Lil Boosie]\nYou ain't tired nigga? You can't see that yo momma eyes ain't dried yet? (look at 'em)\nYou get caught on that ride you gone be quiet (G code!)\nYou got that pistol you ready for that fire play where ya mind at?\nYou got screws in ya head you ain't retarded in a retarded way\nBut I guess you thuggin so you better be 'bout that pistol play donkey chill out\nEva since he been out laughin' lookin' happy his Lil cause takin' ova the south but all the boys already thuggin\n\nI'm mister 106, can't fuck with no b! tch tryna chill my ass out\nLil Boosie on that other shit shoulda told glen 2 chill out and slow his roll\nBut I told him to go get laptops and 44′s forgive me God\nMy heart was cold real gangstas don't see 25 what I was told\n\n[Hook: x2]", "image": "https://images.genius.com/d9d6e55f32ffdf0538d438019664bba5.640x637x1.jpg"}]}