{"songs": [{"year": "2003-01-01", "title": "Scarred 4 Life", "image": "https://images.genius.com/cff949e333e91bd4776ee32fef57ea4a.360x360x1.jpg", "lyrics": "[Intro: Saigon and Rough]\nSaigon: This nigga Rough used to always come talk about his deadbeat dad.  Like he the only one that had one and shit.  You crazy-ass nigga.  Fuck him, nigga.  Fuck it.  Tell ‘em ‘bout it, then, nigga\nRough: Screw that.  Oh, you don’t wanna talk to me?  Bring me here?  Now you just wanna leave?\n\n[Verse 1: Rough]\nCan’t tell me\nA reason for leaving, no hug or nothing.  Just walking out\nOne finger silencing me, nothing to talk about\nNeglection, indirectly showed me how to be a man\n‘Til this day, gave me no reason to try and understand\nMore than likely, you’re the cause of mommy’s hatred for man\nLeaving me to choose between school and bubbling grams\nWhat kind of guidance was that?  Scarred me for life\nMa saying you love us, she denying the fact\nBefore I decided to rap, that’s what stuck in my cap\nA kid’s childhood is something they can never get back\nOut of anything in the world, this is all that I ask:\nDon’t feed me to the wolves or throw me away\nHow could I make it in this world if you don’t show me the way?\nWalking past me on the streets, having nothing to say\nToying with people’s feelings a game you shouldn’t play\nYou wants to hold it down without eventually running away.  I’m like:\n\n[Hook: Rough] (x2)\nI thought you loved me.  Hurt me for nothing\nIt’s like you slugged me, put me through pain and suffering\nSon without a dad, wife with no husband\nScarred for life with no intentions of trusting\n\n[Verse 2: Rough]\nAnd my generation was eighty percent born with addiction\nTwenty percent don’t listen, ten pack and .40 spitting\nRemainding thirty is pitching.  Any way you put it or take it\nBest believe somebody tricked ‘em\nGovernment send drugs to the hood as an invite to prison\nTurn around, lock one of us up like they made a difference\nWhen playgrounds and daycare centers, that’s what we’re missing\nAlong with employment availability, college tuition\nThat’s why the majority of us blooding and cripping\nInstead of becoming Muslims, gods, Sunnis and Christians\nIn order to get the point across, my team put me in a\nPosition.  Who don’t get it, shut up and listen\nAll we knew is: “Soldiers, stand firm and play your position”\nWant to live life to the fullest, three-quarters of us can’t go the distance\nAm I lying?  Naw, I’m just being true\nYou was never there for me, so I did what I had to do\nPut the weight on mommy’s shoulders, but what I really wanted to ask you...\nPut the weight on mommy’s shoulders, but what I really wanted to ask you:\n\n[Hook: Rough] (x2)\nI thought you loved me.  Hurt me for nothing\nIt’s like you slugged me, put me through pain and suffering\nSon without a dad, wife with no husband\nScarred for life with no intentions of trusting\n\n[Verse 3: Rough]\nFamily, friends, and foes there to witness your last\nFamily and friends mourn while the foes bicker and laugh\nMa dukes still in your corner, though she know you was bad\nWin or lose, when it blew, you was all that she had\nPlayed two roles as a parent: the mom and the dad\nCan you imagine how her and problems must’ve clashed?\nProbably be alive today if you wasn’t so fast.  They say\n“The good die young and the bad die last”\nWanna question which one of you.  I’m like, “Why should I ask?”\nPastor preached at your service like never before\nMom’s crying, realizing she won’t see you no more\nThis the first time I seen you since you reached for the door\nWho would think my help for you would put you six feet?\nWhat goes around comes around.  Yeah, that much is true\nYou was never there for me, so I did what I had to do\nPut the weight on my mommy’s shoulders, but what I really wanted to ask you:\n\n[Hook: Rough] (x2)\nI thought you loved me.  Hurt me for nothing\nIt’s like you slugged me, put me through pain and suffering\nSon without a dad, wife with no husband\nScarred for life with no intentions of trusting\n\n[Bridge: Rough]\nIf you was alive, I’d still feel like, “Why would\nYou bother?”  I got a mother, never had a father\nIf you was alive, I’d still feel like, “Why should\nYou bother?”  I got a mother, never had a father\nIf you was alive, I’d still feel like, “Why should\nYou bother?”  I got a mother, never had a father\n\n[Outro: Saigon]\nYeah, you start that sad shit, man.  Why?  You always did that sad shit, man.  I used to be sitting there and he looking at me, look at me in the face.  Now, I’m looking at the nigga.  I’m like, I’m like, “Man, get over that shit, man”", "album": "Saigon A.K.A. Da Yardfather Vol. 2: On the Go Back"}], "artist": "Saigon"}