{"artist": "Fabolous", "songs": [{"year": "2015-05-02", "album": null, "image": "https://images.rapgenius.com/c2f3d0327f82641df18eac0df9fe3ea7.1000x1000x1.jpg", "lyrics": "[Intro]\nLive from the 702, y'all know what this is\nTa-ha, thank God it's Friday\nFelt it was only right\nIn case you ain't think I could do it again\nOh, I'm a do it again\nThat Brooklyn flow, nigga, ha\n\n[Hook]\nThrow they hands up (Yeah)\nThrow they hands up (Oh)\nThrow they hands up (Oh)\nThrow they hands up (Yeah)\n\nThrow they hands up (Yeah)\nThrow they hands up (Yeah)\nThrow they hands up (Yeah)\nThrow they hands up\n\n[Verse 1]\nYou know how your boy come through on a Friday\nI'm a smooth operator like Sade\nI'll put you in your place like valet\nBut they ain't really about nothin' like Wale\nYeah, I ain't talkin' 'bout no album\nTime to turn up, I ain't talkin' 'bout no volume\nCrazy up in here, I ain't talkin' 'bout asylums\nYou ain't talkin' income, then walkin' outs the outcome\nYou ex on a nigga, I ain't talkin' bout no Malcolm\nBird from Atlanta, I ain't talkin' 'bout no falcons\nNo 'Julio' Jones or 'Roddy' White\nBut she could catch it like them if her body tight\nIf she walk in them Zanottis right\nIf she stretch it like Pilates, right\nIf she ride it like Ducati bikes\nBut you ain't fuckin' everybody, right?\nYou ain't out here bein' thotty, right?\nI mean, I see a lot of thots whenever I'm in the club\nI play my cards right, grab a dime in the club\nSippin' Ace of Spade, got my nine in the club\nCause niggas be tryin' to jack a diamonds in clubs\nSee, you know how I be, posted up on IG\nGet under they skin like IV\nCheck a Internet thug down by IP\nHe ain't carry guns, all he carry was ID\nAnd, see, now a nigga bitchin' up\nTalkin' quick, in your face, now the story switchin' up\nHow they gon' pray for your downfall, then wish they up?\n\n[Bridge]\n1 a.m., on my way to the club\n2 a.m., it was goin' up\n3 a.m., bad bitches with us\n4 a.m., now they leavin' with us\n5 a.m., at the after hours\n6 a.m., now we at the house\n6:15, I be diggin' her out\n7:15, Uber en route\n8 a.m., ESPN\n1 a.m., I'm gon' do it again\nWe gon', we gon', we gon' do it again\n\n[Verse 2]\nHow the fuck you gon' talk about emcees on my heels\nWhen all I see is Timb trees on my heels?\nNew black Spur, them Bs on the wheels\nPull up anywhere, Tim D. in your grill\nDon't come at me on some, 'She still my girl'\nI'm rich, boy, I throw some Ds in your girl\nAll I be givin' is some G to your girl\nDick in a box from me to your girl\nSo, you got a flow, that's cool with me\nI hear the freestyles, that's cool with me\nI see your little cars, little jewelries\nBut none of y'all motherfuckers can fool with me\nYou know that funeral flow spit eulogies\nYou tryin' to fool a Gs, I'm tryin' to fool a G\nPut some gas in the game, few jewels for me\nYou tryin' to trick us with a fake chain, foolery\nI just hit two mil on the Instagram\nI should post two mil on the Instagram\nGet this on if you ever go against the fam\nI sit on thrones, I don't sit on benches, fan\nFuck the snakes, I'm ridin' with Kane\nWhen I bring that Dodge Vipe out, python piped out\nThe wave is mine, I never wiped out\nIf you was countin', you would have less to type out\nGet your money up, hustlin', grindin' zoein', finessin'\nFuck that, everybody, come on\n\n[Hook]\nThrow they hands up\nThrow they hands up\n\n[Bridge]\n\n[Outro]\nY'all know what it is, world-famous DJ Clue\nDesert Storm, that kid Loso\nBar for bar, best in the game, nigga\nI said it, uh-huh, live from the 702\nThat street fam\nThrow they hands up", "title": "Do It Again (Throw Ya Hands Up)"}]}