{"songs": [{"lyrics": "[Background singers] + (Acey)\nFi-yah! Fah fi-fi-fi\nFa-fiii-yah, fa-fa-fi-yahhhhh (Love life let it love you back)\n\n[Acey talking as background repeats]\nYeah, what's really goin on?\nYeah, Aceyalone\nHa, yeah love life let it love you back\nC'mon\n\n[Aceyalone]\nYo there's somethin wrong with my radio dial\nSome of these fools just ain't got style\nI don't know why and I don't know how\nBut I do know a dude low and you so foul\nLet's do the thing most people do with it\nWho could it be but the one that done did it\nI come with it, yeah rain or shine\nI lit it up I hit it up I came to grind\nAnd the game ain't mine but it will be when I'm done\nRight now I like to kill MC's for fun\nLet your momma know, she'll feel me like a son\nAnd when I'm dead and gone I'll still be #1\nI got heat like underneath your seat like\nStoppin at the street light, but I ain't the beef type\nI got the herb though, when it's green and crystal-ly\nI smoke a joint and hit the mic the rest is history\nAceyalone, but you can call me Acey\nI'm a real O.G. like Count Basie\nHook up the recipe so nice and tasty\nWhen I'm done they screamin out Aceyalone, lace me\nI'm outspoken, I'm not about jokin\nI'm from California but I'm not from Oakland\nBut they my folks now, fool I'm from SoCal\nPut it down like a champion on vocals\n\n[Background starts to repeat again]\n\n[Acey over background]\nYeah! We always rockin\nIt's always tight around here\nYeah! Look\n\n[Aceyalone]\nPull everybody in this bitch close the doors up\nMines up, yours up, get your bars up\nHold up, freeze up, G's and hearts up\nHoes up in your face lookin for stardust\nDidn't you notice by my swagger I was an ar-tist\nI came here to party out with you and your partners\nSquare as a dollar bill, twice as harder\nBefore I start up, I put my guard up\nMy timeshare's open to whoever can use it\nMy music make more love than you did\nMy new shit rock, RJ produced it\nNew kid on the block, nah I'm used to it\nSlide through, ride through, technicolor my\nTechnique spit heat like no other I'm\nLow key, high signed yet discovered\nLone wolf, sho' nuff, like no other I\nCome through, one-two, that's all it takes for me\nOld school, new school, servin 'em basically\nAll in the future so just don't wait for me\nWorld class champion forever and faithfully\nLifestyle freestyle tryin to get past it though\nHold mine, goldmine, keepin it classical\nHow we rock it just so cunnin and masterful\nAnd that's that flow that the people was askin fo'\n\n[Background repeats again]\n\n[Acey over background]\nYeah man, I mean\nI try to tell 'em from the gate man\nWe just spreadin this out, we gon' give it\nWe gon' give life a good ol' shot, yeah umm\nI'm shootin for mines, I'm puttin everything in a pot\nYeah, huh, bet that, bet that\n\n[Aceyalone]\nProject Blowed, Leimbert Park's finest\nBilly Higgins, the world stage, Dynasty and rhymers\nI'm like primer, underneath your fresh paint\nDon't you ever fix your lips and try to say the West ain't\nWhattup {?}, Mikah 9, Medusa\n2Mex, PEACE, Ave, 'Driver and Jupiter\nBen Caldwell, aw hell, the whole hood\nBig Pun, no name, up to no good\nEllay Khule, T-Dac, Missing Page\nParty ain't over 'til I disengage\nBut shut your mouth up you always barkin\nWhat'chu gonna do when your world get darkened\nPull up on the side of you right where you're parkin\nLight flash in front of you and life start sparkin\nHold me down and I'll hold you up\nI'm hot ice, cold in the cut, nigga what\nI take flight, soarin to higher heights\nI'm so tight that God bless everything I write\nPlus I stick to your ribs at night\nI'm like oatmeal, peanut butter, beans and rice\nI said - I take flight, soarin to higher heights\nI'm so tight that God bless everything I write\nPlus I stick to your ribs at night\nI'm like oatmeal, peanut butter, beans and rice\nC'mon!\n\n[Background starts again]\n\n[Acey over background]\nYeah, respect to all my fallen soldiers\nThat had to leave this lifetime early\nBig up to my homies that's already here\nBig up to my my my homies, my family\nMy peoples, my uncles, my aunties\nMy cousins, my two sisters my brother\nMy mother and father, one love to everybody\nYou know, do good, do good on yo' - on yo' journey\nI'm tryin to do good on mine, I'm holdin it down {*Acey speech fades*}", "title": "Fire", "album": "Magnificent City", "image": "https://images.genius.com/d377dd352876664b03799298f4325e48.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}