{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/26d65093c145e92972f6e95f41326a21.300x300x1.jpg", "title": "Deuces Wild", "year": "2006-11-21", "album": "I Pledge Allegiance to the Grind", "lyrics": "[Verse 1]\nRolling old school on second avenue in second gear\nRe-ing up already the first gone and the second here\nOut the window, see an image, kind of fuzzy but it's getting clear\nIt's a nigga, with a pistol, moving quick and he's getting near\nHot hand reaching for the heat on the other seat\nOh shit, 'nother nigga, at the window, on the creep\nHold up but it, I ain't trippin' I was slippin', got me\nIn fact lil buddy let me show you just how G I be\nYou can have this 4-4-2, and you ain't got to worry 'bout me\n2 stacks on the seat, half an O' in the trunk\nIf you don't mind can I keep the purp sack and the blunt?\nThat's when the second nigga said \"let's put him in the trunk\"\n\n[Speaking]\nWhat? I can't let you do that. You can have this motherfucking car and this money, but nigga you are NOT getting me in this motherfucking trunk. Fuck that. Shit, we all fix'n to go to jail, hell, or the hospital tonight\n\n[Verse 2]\nLook shorty, understand, I heard what yo nigga said\nBut I'm a grown man, (?), I ain't about playing\nI told you, you can have the money, have the car, have the rock\nBut putting me in the trunk, shit, that's where all that shit stops\nThat second little nigga must ain't like what I said\n'Cus that faggot little fucker hit my fat ass in the head\nThat's when I realize this little shit about ready to bust\nPupils dilated, and this little fucker geeked on dust\nI'm dealing with a greedy junkie with a monkey on his back\nThink fast before that junkie monkey go click clack\nSo I asked the number one, \"You got fiends in ya pack?\nWhat kind of glass dick sucking Omar shit is that?\n\n[Speaking]\nYou gonna let this mother fucking junkie get you a murder case nigga?\nAnd you\nGot an easy lick nigga? Take this car nigga, take this dope, take this money\nGet the fuck from 'round here nigga. Don't let this motherfucking fiend fuck up\nYo life\nThis nigga don't love you, this nigga love dope, nigga. Fuck you talking about?\nPussy niggas get that motherfucking gun away from me nigga\n\n[Verse 3]\nHopping out, \"Where the brick at?\" \"Its at ya momma's house.\"\nHe geeked up, sounded like a demon talking out his mouth\nTalking 'bout he gonna put a pistol in my momma's mouth\nSimultaneously I'm spazzing, nigga dimeing out\nFor me or you tonight, nigga, liquor they'll be pouring out\nGrabbed his pistol, pushed it left, and near tried to knock him out\nHe's screaming for his homeboy, I'm reaching in my pocket now\nStick him with that sugar, where the fuck is that 3-80 now?\nMy fat ass running round that car, like a kid playing hide-and-get\nNumber one shooting at me, yelling all kind of bull shit\nGot that rocket out\nMy wallet pocket, now I'm talking shit back\nHe bit the clip, so I shot him in his ass as he ran back\n\n[Speaking]\nI told you motherfuckers! You can have the car you stupid mother fuckers\nGod, this nigga getting me shot at. You stupid motherfucker\nHey look, number one left, you a geek (?), you stay down\nMother fucker, y'all young niggas so fucking greedy..."}]}