{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Attitude been stuck", "lyrics": "[Chorus]\nI'm not scared of your stolen power\nSee right through you any hour\nYou'll be taking it slow\nFeeding my flame\nShuffling the cards of your game\nAnd just in time\nIn the right place\nSuddenly I will play my ace\n\n[Verse 1]\nA fucking mess man [?]\nI wanna see your head slam\nI threaten with weapons\nThey say they hold my blessing\nIn a shitty rap scene, fucking rappers do my head in\nThink they on my level but they Facebook on a webcam\nI wear my gold wherever, you might catch me in an ally\nIf you say you gonna get me, god have mercy on your balley[?]\nRi-ridiculous, so sick of this, predicted it that I ripped the shit\nThe critics hit, try rip to bits the difference is that I live for this\nThey criticize how I live my life but I come from the bottom\nGot rich, you cried\nWhy oh why did I hate so much deny and deny now they ain't my stuff[?]\nI'll take you to my old style that'll leave you in a hole stole[?]\nYou realized that the whole world these rappers took my whole style\nNever been mad just move along, I made it clear that I'm moving on\nTill I die make abusive songs, my main victory I proved em' wrong\nJust go hard till album 10\nBlame xanex or the valium\nCause at the top it's kinda strange\nABK till my dying day\n\n[Chorus]\n\n[Verse 2]\nI chase the dreams and I make sure that they all come true\nThat's why they hate cause they can't make theirs real\nYeah they got 1 too\nFuckin' skitzin lately attitude been stuck on fuck you\nIf you think that's gonna change, you fucking sucked the nuts too\nBlacklisted from Triple J, they didn't think I'd get by\nBut I topped like every chart, my names now in the headlines\nWhat you think about Kers or Scott? Fuck school too\nI was burning pot, bad advise fucking turn me off\nHere's some more never work a job\nWhat you take me for a piece of shit?\nTill I saved your kid he was feening this\nI helped when harm, I'll leave a twist\nMy last enemy had bleeding lips\nThat stopped the talking, why you stalking?\nKerser round you see me balling\nMy boys strapped with itchy fingers\nTalking stops when it hits your winders\nFucken crazy ain't it, don't care if you rate it, hate it\nSince I came into the game, the most hated is what I stay with\nNo one ever cop the hate first like the Kers man\nAnd fuckin' spin out, half you haters turn to Kerser fans, facts\n\n[Chorus]"}], "artist": "Kerser"}