{"songs": [{"title": "Sleeping on the Floor", "album": "FC3 the Epilogue", "year": "2016-08-26", "image": "https://images.genius.com/e3c32eacd60e3592d9fdad3af8af9a56.1000x1000x1.jpg", "lyrics": "[Intro]\nWhere your ass was at when I was sleepin' on the floor?\nWhere your ass was at when I was sleepin' on the floor?\n\n[Verse 1: Lil Bibby + G Herbo]\nThat .40 got a drum, bitch I feel like Nick Cannon, ay\nRaised in the slums so you know I'm still damaged, ay\nTold her let me fuck, ho you know I'm real mannish\nI get love from the plug, I be makin' shit vanish\nAnd we from 79th & Essex but the migo speakin' Spanish\nSometimes he be talkin' plays, I can't even understand it\nI'm like Manny?\nDon't you panic, double wrap and keep it landed\nHave the pack gone when it land, I get the racks and rubber-band it\nBitch don't get it twisted, I'm No Limits, I'm a savage, ay\nBlow a nigga down if he pull up right here cappin', ay\nBitch I be with shooters, all my niggas don't be rappin', ay\nDrop a nigga, tell the coppers \"I don't know what happened,\" ay\nGot my .40 and it's on me, dolo, lowkey, I'm in traffic\nTony fly back to pay 100 off an oz, I was trappin'That 800 I just spent it on Margielas, call it cappin'\nWeek before I had to show ya'll line G Herbo's niggas clappin', ay\nAll my niggas bout that action, quit that yappin' 'fore I slap 'em\nWe got 30s in them rugers, have my shooters get to clappin\nAnd we don't got no love for you rappin' ass niggas\nUp there pistol tell them strip, with your faggot ass nigga\nI got boogers on my wrist, got your sister on my dick\nGot your condo in my pocket, spent your car note on my kicks\nAnd since I cut the lean habit, I've been shoppin' like a bitch\nI just bought Givenchy T-Shirt shit that woulda been a 6, ay\n\n[Verse 2: Lil Bibby + G Herbo]\nI'm just a trappin' ass nigga, you a rappin' ass nigga\nAnd I'm still in the field with my savage ass niggas\nYou could catch me on the block got my youngin's totin' Glocks\nWe be ridin', flippin' blocks, see the opps, send some shots\nNow we ridin' on the e-way gettin' high, bitches hotBitches on me everyday, they just wanna give me top\nYeah, you ain't gotta flex like you ain't fuckin', baby stop\nYou know my Balmains full of knots and your favorite rapper flop\nAnd I be gettin' guap, ho\nTell 'em come and shop, ho\nHood name Poncho\nI'm trappin' out my condo\nGotta make it happen, rappin', fuck up, I'mma rob ho\nReal street nigga, I had a nine before Rondo, hah\n\n[Hook: Lil Bibby]\nYou can tell by the flow that a nigga from the 'Go\nAnd if niggas want some smoke, have them shooters at your door\nAnd I throw my gang up just to let a nigga know\nAnd she suck it like a pro but she can never be my ho\nTell her, where your ass was at when I was sleepin' on the floor?\nBitch, where your ass was at when I was sleepin' on the floor?\nSay my lil cousin call me and he say he need some dough\nWhere your ass was at when I was sleepin' on the floor?"}], "artist": "Lil Bibby"}