{"artist": "Yukmouth", "songs": [{"album": null, "image": "https://images.genius.com/fe4ce80636a153d477eafc54f843fd09.900x900x1.jpg", "year": null, "lyrics": "[Intro]:\n\nY'all niggas in trouble, should've never fucked with Yuk\nG-G-G-Gay Unit!\nBitch ass Game you could never fuck with Yuk you bitch!\n\n[Chorus]:\n\nWe keep them gats clappin' to a nigga like him, fuck G-Unit, you know the Game's about to end, Regime Life! We back up in this bitch again, You can run with snitches or run with killaz and win\n\n[Verse]:\n\nYou ain't no thug, you a faggot ass tongue ring mush face\nBitch that won't talk that blood shit in front of Suge face\nYou ain't a Compton blood, M.O.B. mobbed out\nHow you got a million when you living at your mom's house?\nOn the Interscope DVD at your mom's house\nSee me on my DVD drop coupe, rocked out!\nThis nigga faker than Eminem on Wash house\nCome down South to get knocked out, popped out!\nWatch Out! Make strategic movements, J Prince already ran\nThe G-Unit outta Houston\nY'all niggas music, I peeped the blueprint\nSuge Knight slapped that nigga, he didn't do shit!\nGot slapped two different times, he didn't do shit!\nDisrespect the Eazy tattoo, you ain't Ruthless!\nDropped the album with JT, that didn't do shit!\nNow he mister hard body since he with the Unit\nWanna beat my ass? Then prove it! What you gon' do?\nSucker punch me and run, and D'mack for da gun?\nI don't play that!\nI'll put you in da coffin with nuns, prayin' for you, you ain't Eazy-E's son\nGet off his dick!\nThat's why yo lips filled with Eazy-E cum\nHow this nigga from the slums man he got an earring in his tongue. Bitch!\nHow I'm getting fucked?\nDroppes Benz, big spokes, nigga gotta fuck Yuk rich and Chris Hicks broke! Master biter, The Game the mark, the stainless heart\nI'll rip yo fuckin' brain apart\nTryin' to tell you at the club bitch nigga play yo part\nYou that bitch nigga from \"Change Of Heart\"\nTongue Ring!\nYou the internet thug, the war ain't ended with Yuk, until I put some hollow tips in yo mug\nWhy diss now?\nYou wasn't talkin' shit at the club\nThat's cute he tryin' to prove to 50 Cent he a thug\nCall 40 he'll let you know I devour boys\nAnd he let you know that my family is the flower boys\nEd Flowers, Joe Flowers, real power boy!\nGot shot with yo own shit you a coward boy!\nYou runnin' with snitches, you sleepin' with fishes\nI'll put yo brains on them fuckin' new G-6's\nSaw you in da club, wasn't talkin' that slick shit, so why wait three months to come with some diss shit?\n\n[Chorus 2x]\n\n(Yukmouth)\nNigga, you sound phony as fuck!\nYamean!\nRegime Life!\nNigga!\nWho you fuckin' with nigga?\nBlood niggas don't know you nigga!\nYadadamean!\nYou ain't M.O.B. nigga!\nYou ain't no real blood, you fuckin' basketball nigga!\nYadadamean!\n\n[Chorus 2 2x]:\n\nI know you gon' let me shine and get mine, this bitch nigga Game has stepped up on the line\nThe boys in yo brain, yo brains is on the line, but I hope they don't let Yuk in with his nine'\n\n[Outro]:\n\nI can't believe you nigga\nI saw you at the club nigga, I told you I had beef with 50 Cent nigga\nYou said,\"That's between y'all nigga\"\nYou said you didn't want no beef nigga\nYou gave a nigga dab, I gave you dab, it was cool\nI thought we didn't have no beef nigga\nYou fuckin' internet thug nigga!\nYou keep gettin' slapped by Suge Knight nigga!\nYou bitch, you ain't no blood nigga\nYadadamean! Fuckin' coward nigga!\nYamean, you got them niggas tryin' to get you to rap against me nigga?\nI'm the king of the west nigga, you fuckin' poodle!\nGet it right bitch! Yadadamean!\nI end niggas careers baby! Look at Master P nigga!\nEvery nigga, I wrote on has been silent nigga!\nAll my niggas in L.A. is them niggas thats jackin' them niggas at the club nigga\nYou know how we get down, you bitch ass chump! Nigga!\nThat lil' fake ass G-Unit chain you was holdin' on when you was talkin' to me, if you checked me why was you holdin' on your chain when we talkin'?\nIf you wanna box me, you gon' tuck yo chain, you ain't gon' hold yo chain, that's a bitch move nigga!\nA bitch move is showin' a nigga yo gun and not usin' it, nigga I'm not Joe Budden nigga!\nThis is the M.O.B. nigga!\nJ Prince nigga!\nYou could neva come to Houston nigga!\nNeva come to the Bay you bitch!\nNeva come to the midwest Chicago!\nMaan I tell you, you bitch, my nigga Speedy came to the Jim Jones video shoot and checked yo ass nigga!\nHe said, \"Bo and Yuk got beef nigga\"\nAnd you said, \"If 50 was to die today, I'm gettin' paid from a white boy at Interscope nigga\"\nBe real nigga!\nLet a nigga know what really happened nigga!\nQuit fuckin' with me like that you bitch! Nigga!\nAnd I don't box I hit niggas wit glockz in da head you bitch!\nYou know how I do nigga\nYadadamean!\nIt's Oakland on mine nigga, Regime life nigga\nYeah you see me in my Benz you bitch\n\n[Music Stops]\nI got jewelry for everyday of the week punk\nFuck that lil' ass yellow-gold, whatever the fuck you rockin' with, step yo shit up bitch!\nHand me down jewelry nigga\nAnd Compton ain't fuckin' with you!\nChump!\nYou fuckin' bum, I'm outta here nigga you... see this shit on the forum you chump!\nInternet ass thug\n[Gunshot]", "title": "Game Ova"}]}