{"songs": [{"image": "https://images.genius.com/bc0beae0bf858af78e691c98ca147377.626x626x1.jpg", "title": "​better", "album": "ruiner", "year": "2018-04-13", "lyrics": "[Intro sample]\nAnd now, for my next number, I'd like to return to the classics\n\n[Verse 1]\nGrowing up, I had a dream in my mind\nThen it came true, now it got me losing my mind\nI don't wanna seem ungrateful so I keep it inside\nGot me reminiscing, thinking of a simpler time\nLike me and Lopez used to skate down the block\nPassing time, spitting rhymes at the old parking lot\nI can't even drive past all the spots that I love\n'Cause they're nothing even close to anything like it was\nBut when I see a group of kids in the spot\nI wanna shake 'em, wanna tell 'em they don't know what they got\nWish that I could travel back and try to tell me to stop\n'Cause I had everything, I never needed a lot\n\n[Pre-Chorus]\nIt's like I woke up one day and suddenly I grew up\nI can't remember what had happened, it was all too abrupt\nDrive around my old town, it's pathetic, I know\nThe only time that I was happy and I can't let it go\n\n[Chorus]\nWas it all really better then?\nOr am I just getting in my head?\nAnd I just wanna go back\nI wish that I could just go back\nWas it all really better then?\nOr am I just getting in my head?\nAnd I just wanna go back\nI wish that I could just go back\n\n[Verse 2]\nI would never trade a friend for the fame\nBut I been on the road touring and it isn't the same\nLosing touch with all the ones that I love\nHow many calls I gotta miss 'til they stop giving a fuck?\nBeen feeling down so I hit up my mom\nShe told me everything will pass so put it all in a song\nI know my family can see I got a lot on my plate\nSeems like every time I'm home it's only just for the day\nSo I been putting all my thoughts in this verse\nAnd I don't know that if it's helping or it's making it worse\nI just know its been a while since I felt like I'm fine\nI've been trying to learn to live my life one day at a time\n\n[Pre-Chorus]\nIt's like I woke up one day and suddenly I grew up\nI can't remember what had happened, it was all too abrupt\nDrive around my old town, it's pathetic, I know\nThe only time that I was happy and I can't let it go\n\n[Chorus]\nWas it all really better then?\nOr am I just getting in my head?\nAnd I just wanna go back\nI wish that I could just go back\nWas it all really better then?\nOr am I just getting in my head?\nAnd I just wanna go back\nI wish that I could just go back\n\n[Outro]\nGo back"}], "artist": "​nothing,nowhere."}