{"songs": [{"title": "Who Knew", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro]\nLD a.k.a the Time Traveler's Wife\n\n[Verse 1: Lil Dicky]\nI like to play it cool like I'm not that\nOn the low, who'd assume that I got that?\nI don't know, but the dude with the tall frappe\nLooking all aloof being all that\nEven Babe Ruth wouldn't call that\nI don't even sweat it though\nThey been hesitant as if my credit low\nAnd shit'll hit them quicker than an edible\nI'm 'bout to run for Senate ho', you ain't even centerfold\nBeen on top of cheese, I ain't talking 'bout oregano\nI'm talking 'bout your cheddar, homie, revel in that\nI'll hit a college and I'm fucked, like I'm pledging a frat\nThey 'bout to silhouette my nuts on American flags\nEstoy contento, muy estupendo\nBetter Hertz word to rent-a-car, Dicky Tony K\nY'all the Le Batard speaking to you lames, that's a seminar\nI'm straight like a pleasant bar, ain't nobody ready for my repertoire\nI wasn't getting credit, like a debit card\nBut never mind, had to give them time to adapt\nI'm kind of a rap rendition of a fry in a wrap\nJust try it as that\nYou rappers Rebel Wilson's vagina, you stank!\nI take it back, I don't know that ho\nAnd bro they used to\n\n[Hook]\nLook around the boy, wouldn't raise they head\nNow they looking at the boy like the main event\nHe don't even got a rap sheet, looking like a mathlete\nHow the fuck is he the one that come in with the crack?\nWe like \"Who knew, who knew?\"\nUsed to look at me like \"who you, who you?\"\nNow they look at me like \"Who knew, who knew?\"\nNow it's Dicky with this, who knew, who knew?\nNow they look at me like\nI am hip hop's Heisenberg\nYoung boy got dope for a quiet nerd\nI am rap game Walter White\nYou might get killed thinking that he all polite\n\n[Verse 2: Lil Dicky]\nBuzz around the city, coming out of Philly\nI'm about to get a milli', being meek that's word to milly\nI'm looking super silly, but cooking like at Chili's\nYou look at me like \"Really?\" but I look at you like \"Who that?\"\nOh you new here, I'm the bomb\nOkay I'm Lebron, okay I'm the one\nOkay all that shit confusing that's a quandary\nWhat you call a pussy with a movement, that's a Gandhi\nI'm tryna get better, but science preventing\nBecause I'm undeniably clever, the highest of levels\nI'm high in a sweater but rhyming like I'm lying in pepper\nDon't mind the endeavor, I bet I do better than veterans\nCheddaring, let him on Letterman\nGet him on Ellen I'm on, boy\nI think I need a therapist, way I get in my dome\nDoing D like they was Syracuse, when they up in they zone\nUsed to load it on chrome, now I really ball\nLiving like a fucking letter man, never mailing the song\nThough the dime flow rubbing combos in Tom's shoes\nWith blonde hoes getting pay-a-ton like the Broncos\nI'm on, ho', vanilla looking but the rest of y'all the John Does\nIt's pretty odd bro, 'cause they used to\n\n[Hook]\nLook around the boy, wouldn't raise they head\nNow they looking at the boy like the main event\nHe don't even got a rap sheet, looking like a mathlete\nHow the fuck is he the one that come in with the crack?\nWe like \"Who knew, who knew?\"\nUsed to look at me like \"who you, who you?\"\nNow they look at me like \"Who knew, who knew?\"\nNow it's Dicky with this, who knew, who knew?\nNow they look at me like\nI am hip hop's Heisenberg\nYoung boy got dough for a quiet nerd\nI am rap game Walter White\nYou might get killed thinking that he all polite\n\n[Outro]\nGet up off my dick, ho\nThat's an unassuming dick, though\nGet up off my dick, ho\nThat's an unassuming dick, though\n(\"Who knew, who knew?\"\nUsed to look at me like \"Who you, who you?\")\nGet up off my dick, ho\nThat's an unassuming dick, though\n(Now they look at me like \"Who knew, who knew?\"\nNow it's Dicky with this, who knew, who knew?)\nGet up off my dick, ho\nThat's an unassuming dick, though"}], "artist": "Lil Dicky"}