{"artist": "Capital STEEZ", "songs": [{"title": "Jay STEEZ kickin it at the Entree office", "album": null, "year": "2011-03-21", "image": "https://images.genius.com/126d3d8ed37f6738b16f5c405b0c0aab.431x431x1.png", "lyrics": "(Intro)\nAlright\nThis one goes for Mr. Shawn Carter. I know you probably not listening, but, I'm gonna go for it anyway\n\nUnh, Jay to the STE. to Mr. Jay to the Z\nJust trying to find the place that you be\n\n(Hook)\nSaid it's not Mr. Jay to the Z, but it's more Mr. Jay to the STEEZ\nI'm just trying to find the place that you be\n\n(Verse: 1)\nLook\nSaid first things first, I STEEZ, i'm looking for Mr. Carter\nYup, and I'm just getting started\nI appreciate the game, and the way that you fathered it\nBut I've been up to par with all them artists that you partnered with\n\nI noticed I got the home-field advantage\nSo eye show skill, the flow ill, the ho's seem panicked\nAnd i'm so real. Homie's just a ghost and a mannequin\nAnd trying to know who he is, under-wraps like bandages\n\nNot to mention that I haven't found a management\nManagers try to manage us, but they just couldn't handle it\nSo I had to make a better image, homie became aggressive wit it\nNow the block say that i'm the best to spit it\n\nWell, i'm overflowing with confidence, and charm\nIt's obvious i've been up on my cocky shit\nTo back it up I got the bars for days\nThat's why it took us about a month to make a marvelous tape\n\nSo tell me where you are Mr. J, so I can stop calling ya name\n\n\n(Hook)\n\n(Verse: 2)\nComing from the home place of way too many mouths to be fed\nWhen you make it to be the greatest, or you're probably dead\n9 to 5 is the only time you can spend\nThis is coming from the bottom of my heart and off the top of my head\n\nFreestyling in them hallways all day\nThought that we was balling, that's until we seen Lebron play\nWas like you betta step ya shit up kid\nWe in the school of hard knocks, with the stick up kids\n\nIts not the fame, your man just turn, switch quick\nThe unspoken truth so you betta keep your lip zipped\nAn infant to the game about to hit 6 years writing verses and I still ain't get rich?\nI guess I'm looking for a man to blame, getting older realizing it'll have to change\nSo by the age of 21 I'ma have a champagne range rover, J roller, and a platinum chain...\n\nAsking me a lot to sing.. fuck it\n\n(Hook)\n\n(Verse: 3)\nI said there's J-HOVA, J-Cole, J elect, Jadakiss\nWale Falorin used to be one of my favorites\nListening to Floetry, Ambrosius was amazing wit it\nBeen a fresh prince before Will met with Jada Pinkett\n\nI am working part-time just so I can save a few g's\nBy the time i'm eighteen, make a stable living\nMy older sisters trying to pay tuition\nAnd i'm just hoping that I can make it Cablevision\n\nCause i'm out here scrubbing toilets\nJust so i can be the perfect son my mother wanted?\nMy older cousin doin time for a gun charge\nThe other moving weight, got niggas tryin to run up on him\n\nMy old man took his head off, so you'd be dead wrong for thinking that I fell off\nI just been on vacation for a minute, but the game won't be the same when I'm finished\nDo you feel it?\n\nLook\nThe flows I had to switch em up, cause I ain't plan on giving up\nI got more wheel power than a semi-truck\nAs a youngin, I really couldn't remember much\nBut listening to Juicy when I copped my first sippy cup\n\nI done came full swing as an artist\nAnd kept the underground mind-state like an ostrich\nBut I still pull strings like guitar picks\nSo telling me to go harder is no problem!\n\n(Hook)\n\n(Verse: 4)\nAnd I swear to everything, when I leave this earth\nIt's gonna be on both feet, never knees in the dirt\nI mean, try me, fucking, but when I squeeze it hurts\nLose two lives, yours and mines\n\nGive me any amount of time, don't let my momma grieve\nAt the funeral parlor dripping tears down her sleeve\nGive me any amount of time, don't let my momma grieve"}]}