{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse 1]\nYo\nTwo steps out the door and I'm back for more\nFuture Vintage Tour, feel the rhythm of war\nGot 'em spinning before off a limited score\nBut now we back with big stacks so give me the floor\nMe and my brothers known to cover the gang of the bloodsuckers\nZombies, werewolves, mud-chuckers\nThey throwing dirt on their name, but still some love us\nThe real ones recognise not to run from us\nSo, we keep running through the States come join\nMean Town, Chi-city, to the morn\nI'm in your barcade pocket full of coin\nMezcal Mule and a half smoked joint\n(Love!)\nWhere would I be without all this love?\nAll these drugs, especially the legallest ones\nThat the doc prescribes me to get a little kick back\nI ain't even sick man, forget that\nI'm moving through this world just trying to get scraps\nRugrats out on the road chilling with Big Cat\nAnd I'm guzzling stems\nRolled too much got me in trouble again\nBut it's all good please let me beg your pardon\nThe music's a bargain for all who rob us like\n(Love!)\nGo 'head and call it the future sport\nRunning man updated to shoot your force\nI'm going break neck speed\nMake Wrek bleed\nIt'd take about a weightless dream\nBake up steam\nI'm trying to get a makeup scene\nFor great things\nAnd I can do this all night no vacay needed\nSo what you got for us?\nIs it a Grammy and accolades?\nA chain for me to rock out to the matinee\nGifs in my inbox Jif on my bread\nNo complaints we just came to kick it instead\n\n[Verse 2]\nTech told me to handle 'em\nBattle for champions\nThey all mismanaging the keys to the palace\nAnd we walking in famished like\nGive me a sample\nAnd I don't give a damn what rapper your pandling\nI'm on a wrong train running\nAll stops are low key and all mean something\nSo\nGive me space let me get y'all bumping\nFilter all off bout to tell y'all something\n(Love!)\nGet it now only 2 days left\nFV Future vintage fuck the rest\nI've been killing\nCopycats with no rhythm\nProbably best that they didn't\nTry to get all onboard for the killing\nEverybody wanna get a piece of the filling\nBut we just here to kick it up way past the ceiling\nEverybody come on out support\nThis one's gon' be special now part for course\nAnd if you don't believe me you can head to the source\nCause I was once told that you just can't have cause without\n(Love!)", "title": "Long Time Coming (WrekMix)", "year": "2015-09-15", "album": "#WrekWednesdays", "image": "https://images.rapgenius.com/37051bc02028199adf49ade1c8f95b80.693x703x1.jpg"}]}