{"songs": [{"image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg", "title": "Beef Stew", "album": null, "year": "2008-03-01", "lyrics": "Just when they thought I was done for the summer\nCame out the cupboard, show my ass like a plumber\nI ain't Chinese, but you're worth two dolla'\nTee get the bleach, I'm a show my true ca-la\nTell a nigga holla in the peach Impala\nOnly if he give good brain like a scholar\nA-la, a-la, a-la eyy!\nKnock your top off like a holiday\nDang, little mama, I should be in your pot\nCause everywhere I go they saying Nicki you're hot\nI catch more eyes than the letter with the dot\nSuper-size fries, my pies better be hot\nShe got it twisted like a cock-eyed bitch\nThat's why I be in Mr.Chows, you a Popeye's bitch\nYou the type to get some money, go spend it on some boots\nSave just enough for some douche for your cooch'\nIt ain't about money, you ain't speakin' my lang'\nCuttin' any bitch off if she enter my lane\nAnd it really ain't a thang, when I bang, I bang\nAnd my goons swing by like orangutans\nFuck wrong with you? I am the Don-dada\nI show you how to do it, like I'm your mo-mother\nYou can't beat me, so don't do-don't bother\nYou soft like butter,and no, I don't stutter\nYou Romeo and I'm Master P\nThat's why they mention me first, then you after me (Next!)\nI'm the up and comin' that the streets talk about\nThe twenty-two slugga, make a bitch walk it out\n(Now walk it out!)\nNicki get it poppin' like I came unannounced\nStay with a goon and my goon dumbin' out\nSo, first thing first, I'm the queen of the crew\nI could cook crack or cook a mean beef stew\nBeef stew, beef stew, whatcha gonna do?\nI could cook crack, or cook a mean beef stew\nBeef stew, beef stew, whatcha gonna do?\nI could cook crack or cook a mean beef stew\n\n[Outro]\nI am the president, I am the president\nDirty Money\nQueens, New York is in the motherfuckin' building, building, building\nBuilding, building, building, building, building, haha\nYou gotta love me, mayne\nGravy what up? Get your fat ass in the booth, nigga"}], "artist": "Nicki Minaj"}