{"artist": "Vast Aire", "songs": [{"title": "Take Two", "year": "2008-06-24", "lyrics": "[Verse One - Vast Aire]\nGimme two takes and I'm gone with the wind\nI know piranha rap niggas that'll eat you thin\nWhich means their flow is sin\nYou better learn how to swim\nSo chill out Hero\nI move my blade like Beatrix Kiddo\nWith the illest of Haiku riddles\nOn top of a mountain, playin a fiddle\nYou don't really wanna dance you just dabble...\nYo...\nYou are not the better man\nLike wacko Jack-O ain't Peter Pan\nActin like you ain't nervous\nNow that's a True Lie like Jamie Lee Curtis\nYou backwards like sock on shoe\nDon't let me catch you where they rendezvous\nYou got you your own shit that means God blessed you\nBut that means I don't gotta like you!\nSon, the God's spit spiteful...\nC'mon dude I was born to rap\nWhen delivered I had a rhyme and the doctors clapped\nThe nurse beatboxed\nHarmonizing while the cradle rocked\nYou got problems let me know\nShit I got your back like C3PO\nYou thought rap was dead\nNah, you was on Prozac it's all in your head\n(It's all in your head...)\n\n[Hook]\n\nSo take two of these but don't call me\nIn the morning cause I'll be snoring\nIn the city or somewhere touring\nNext to a cutie I'm wakin up yawnin\nI guess I was blessed with the callin\nI keep soaring, you keep falling\nAnd if it was up to me?\nWe would just all evolve just like Darwin\nYou need to quit stallin\n\n[Verse Two - Vast Aire]\nSorry kid, you got overpaid\nI know some hungry ass cats and they're on their way\nWe like girls with Oil of Olay\nNo sausage here we like fish fillet\nAnd I don't need no one behind me\nI do my dirt all by my lonely... HOMEY\nI used to listen to gangsters with jheri curls\nAnd make cheese sandwiches with no frills\nMy favorite groups was EPMD\nPE on TV? Now thats therapy\nI came up in the streets, you came up\nIn a Smurf village; there is no comparison\nAnd if this was the search for the Holy Grail\nYou besta believe I'm Harrison\nFord. The whip is the mic cord\nWith an invisible string if I drop sword\nYou put that together\nWe can do this to a beat or go accapella\nWhen I spit these sentences change the weather like...", "album": "Dueces Wild", "image": "https://images.genius.com/eb42f00f56a165e0e57e8f51a829caad.536x536x1.jpg"}]}