{"artist": "Anybody Killa", "songs": [{"title": "Retaliate", "image": "https://images.genius.com/e8235b7763da2f99c14011dff35a2d0f.400x400x1.jpg", "album": "Dirty History", "lyrics": "[Verse 1 - Anybody Killa]\nRetalition is a must, watch your back, stay on que\nShould've never fucked with us, now you got me after you\nDevious and beady eyes, quick to jump and take your life\nWhat the hell you think this is? ain't no way you walkin' by\nIf you see them, let them know just how far you lettin' shit go\nYou fuckin' with some OG's, Detroit weirdos\nWe bombin' on whoever dirty situation chasin'\nAnd makin' you fuckin' bleed, put you on a permanent vacation\nHammer time on your face with my right boot\nFor loose river dance, do the jit into a spongy spit\nMy homies Twiztid got you listed\nHave you all hemmed up like \"What the fuck is this?\"\nWe bigger than you thought, the whole crew be representin'\nPistol whippin all haters, have 'em twitchin' and flippin'\nRetalition, beat 'em down, call up all the fellas\nWe been known in the hood as some eye ball swellers\n\n[Hook] -x4\nRetaliate\nHunt 'em down\nGet 'em where it hurts\n(Retaliation)\n\n[Verse 2 - Monoxide]\nI'm in the back with the windows cracked, I heard shots\nSomebody on the side of me, bitch I ain't Pac\nGive me a second to shoot back\nAnd I just happened to be smokin' a blunt and got the hops in my lap\nNow I'm pullin' up behind you\nSteady tryin' to hide out in traffic, but you know that I'ma find you\nBlind side you, scared to death\nKeep shootin' til I burn up all the skin on his chest\nGod bless the dead\nGo against me and you'll rest up in a bed with a hole in the head\nDon't fuck with me, it ain't worth your life\nIt ain't worth watchin' your moms die tonight\nIf you start it I'ma finish it, diminish it to nothin' but rubble\nAnd you just opened a trunk of some trouble\nIt's Monoxide and Killa, roll it up and relax\nRetaliatin' on you bitches, watch your back\n\n[Hook] -x4\nRetaliate\nHunt 'em down\nGet 'em where it hurts\n(Retaliation)\n\n[Verse 3 - Jamie Madrox]\nAin't nobody playin' bitch, this ain't no motherfuckin' game\nYou fuck with ours, you ain't never gonna be the same again\nLeave you chillin' in a wheel chair, K chopped your legs from knee down\nNow who you gon' see now?\nYou touch ours, get touched back with force\nAnywhere you at it's on, of course\nWe don't sleep at all, give all my homies a call\nEverybody in your crew is sure to fall\n(Sho Nuff!) Retalition in effect\nFuck wit ABK and my brother you get a rusty shovel all up in your neck\nUse the same weapon to bury that ass in the ground\nSo don't play hard, put your piece down or get peaced out\nDon't be starin' like you gon' do shit\nWithout your weapon and your mouth, bitch you're useless\nMy crew gets pissed the fuck off\nAt all these mediocre thugs, claimin' to be hard When they soft\n\n[Hook] -x4\nRetaliate\nHunt 'em down\nGet 'em where it hurts\n(Retaliation)\n\nYou ever think about death?\nYou ever look death in his eyes?", "year": "2004-07-27"}]}