{"artist": "Inspectah Deck", "songs": [{"title": "The Cause", "lyrics": "* multiple gunshots *\n\n[Intro: Inspectah Deck]\nYo, when we do this, we do it for real\nWe do it for the love, we do it for the money\nFor the cash, for the women, the birds\nWe do it for the foundation, for the people\nNo matter how we do it, we do it for The Cause\nYea, yo\n\n[Hook: Inspectah Deck]\nWhat you in for? What you live for?\nWhat you die for? I hope its for The Cause\n..\nWhat you work for? What you stand for?\nWhat you strive for? I hope its for The Cause\n\n[Inspectah Deck]\nInspectah, rhyme beretta nine in ya sector\nWet the scenery with extreme measures\nSupreme lecture, bless the heads, you dare enter\nThe 9th Chamber, dance with the mind bender\nSurrender your thrown, there's no room for pretenders\nBystander pollyin worldwide with nine members\nDistributin, my verbal sharp shootin\nWhile I execute the deadliest moves with fine tunin\nDuel of the Iron Mic bound to spark fusion\nMovin at the speed of light, nice at what I'm doin\nDrop it in ya brain like spice, without the five mics\nHeads roll off hilltops when I strike\nSniper aim, stick you up for your price of fame\nLike the flame, watch you get hot inside the game\nRecognize my name, I.N.S., your highness\nI rep for live sets, place ya bets, make ya threats\nThere's no cure, even the experts are stunned\nMy work is done as soon as I've just begun *echo*\n\n[Hook]\n\n[Streetlife]\nStrictly, Streetlife, I never play a fan of the fame\nJust build on my name, and master the slang\nI'm hittin harder than a lot of artists in the game\nI'm lyrically inclined, rockin just the same\nThan any MC who ship platinum or gold\nAnd only recoup to pay back what you sold\nOver budget your video, got pimped like a ho\nMy niggas move slo-mo like robotic clones\nI'd rather be alive and paid, than dead broke\nMy life is like a thin line, on a tight rope\nA fiend with no dope, wrong way to provoke\nThe man behind the scope, tucked, ready to smoke\n]From the same place you from, different hood, the same slum\nMother's third seed, father's first son\nBastard child runnin wild, livin foul\nRan into some juvenile niggas in design\nP.L.O. Style, sign my name on the dotten line\nYour beef is mine, dangerous minds combine, we all carry nines *echo*\n\n[Hook]\n\n[Inspectah Deck]\nHitman like Thomas Hearns, bustin while the weed burns\nShorty, sixteen, yearns for my crew to take turns\nI'm a loose cannon, medically examined\nFound deadly as a plague, soon to spread like famine\nSplurgin, livin out the dirty version\nThrowin rocks at the ghetto birds circlin the urban\nWorkin overtime, you notice the shine\nNiggas scope mine, models won't work Capone nine\n\n[Streetlife]\nWe travel in pairs, you got the front, I watch the rear\nGot money on my mind this year, by all means\nPut an end to your cold stairs, crush your small dreams\nWhat you hear is the truth, fuck what you used to\nI provide you with street music you can ride to\nPush through, sound blastin through the sun roof\nStreet surfer, lurkin, thirsty for the loot\nI'm in it to fuck fans and rock mic stands\nI work for cash and fans, and die for the Clan", "image": "https://images.genius.com/19b06abfed788ae492f578fa0afb063f.1000x1000x1.jpg", "album": "Uncontrolled Substance", "year": null}]}