{"songs": [{"album": "Afro Samurai Soundtrack Album", "image": "https://images.genius.com/934a82446b3da7846960f0df79197fa9.592x592x1.jpg", "year": "2007-01-30", "title": "Certified Samurai", "lyrics": "[Intro: Talib Kweli and Suga Bang Bang]\nHahahahahaha, we gon' do what we do right here, baby\nYou already know what it is, Division, back in the building\nBrooklyn, you see 'em? Haha (yeah, come on) {soldier hold ya sword high}\n{Swing it like a Samurai} Who are we?\n\n[Verse 1: Talib Kweli]\nWe them breadwinning baby making, pill popping, liquor sipping, blunt smoking, gun toting, see how these niggas living\nEarn, burning word for ya, curb serving\nGot you hooked by the first purchase, birds chirping\nCops listening, with the gun sitting on they lap\nCuz of that, the t-shirt's on the block, like 'stop snitching'\nLiving by the code of the samurai\nDreams put on hold like operators standing by\nWhat you craft with your heart or your weapon\nIt's a question, what you craft with, a Glock or a message in a rhyme\nI teach you little savage part of a lesson and choice\nBetween being a gangsta and an artist, is the start of your ending\nYou can front like you a gangsta artist, but that ain't the smartest\nDecision, niggas'll test you\nSay you ain't the hardest, regardless, what you spare homey\nRZA told me that the game is flipping, nobody bent for me\n\n[Interlude: Free Murda]\nHaha, you already know what it is\nMurda is back in the building\nDivision, back in the building\n\n[Verse 2: Free Murda]\nFree Murda, dick longer than the O.J. trial\nHave your bitch backstage with the Colgate smile\nI'm on the back Glocks where the coke ring loud\nBullets got flat tops like they stole Kane's style\nWarm 'em kid, you wanna flow, drain now\nGet your whole brain out, where your hoes hang out\nIt's killing me, everybody got cocaine nail\nStealing Free is like trying take a old stain out\nYour boy's on fire, my boat stays out\nIt's gon' take more than a wire, to close they mouth\nGot a slice of that bread, bags that you stole\nYou had a price on your head, now that tag's on your toe\nAnd you know that nigga dead when the casket is closed\nOff with his dreads, keep the mag' in my clothes\nI'm trying, real good, the semi' got loud up\nYou can die in your hood, like Kenny from South Park\n\n[Bridge: Free Murda]\nHow many licks does it take\nFor me to hit the tootsie roll center of a break?\nYeah, how many hits must you make\nBefore a man'll get his mule and his forty ac's\nHow many licks does it take\nFor me to hit the tootsie roll center of a break?\nYeah, how many hits must you make\nBefore a man'll get his mule and his forty ac's\n\n[Hook: Suga Bang Bang]\nSoldier hold your sword high\nSwing it like your certified\nNow don't get all out of pride\nFrom the Afro Samurai"}], "artist": "Talib Kweli"}