{"songs": [{"year": null, "image": "https://images.genius.com/a96ea234d3e0ea068a71f09414207f4b.360x360x1.jpg", "title": "Bizzy’s Story", "album": "The Story", "lyrics": "[Intro: Bizzy]\nThe one baby!\nAs a child, army days, cancelled the fun childhood\nAfter runnin away with mom so many times\nIt's tearin their relationship apart\nI wasn't doin anything but bein a kid, no evil in my heart\nNever played in the area of they minds, anything like that\nJust a normal kid, yeah, yeah\nI remember messin with these little girls around the corner\nMy stuff wasn't even hard\nRemember a brother was lookin for a little candy out the park\nMy mother went, my mother vent, momma what happened, momma I'm scared\nMomma my head, so won't you get it baby\nWe carry on, we carry on, we carry on, we carry on\n\n[Bizzy Bone]\nExperience with different women, my dreams\nAnd Sirita was a Cleveland and Sirita was clean\nNow I'm explorin, the world around me very much learnin\nAnd a, nurturing phase and a, lurchering phase\nGod with dirty people comin against me\nIt's the life of the dead, record of company defend me\nStill workin, the musical group, is that the crew?\nAre they with me? It's Mr. Majesty, Capo and (Que!) Que, huh\nFrom the West Wing, soldiers of the West Wing\nMoney straight flowin, it's the best thing, best thing\nThey say sacrifice is I-N-C\nWith my buisiness partner Kanardo Davis, D.A.P\nThat's the love, that's the love, that's the Lexus, that's the Benz\nThat's the thug, that's the thug, that's the thug, that's the thug\nThe owners, it started in the night life\nI don't even remember havin fun, all I can remember is a trife life\n\n[Hook: repeat 2X]\nBizzy's... story (we want Bizzy's story)\nBizzy's... story (we want Bizzy's story)\n\n[Interlude: Bizzy]\nTime to clean up and get sober man\nThe kids came moved over I took the last $90,000\nAnd put it on a $5,000 square home and got $10,000 worth of furniture\nFrigerator full of food, it's for the kids\nWe moved on and we got a nanny\nAfter much struggle we had a home, finally\n\n[Bizzy Bone]\nMy early manhood, strange bein the man of the house\nWithout Sirita it was terrible, small as a mouse\nSoon I met up with the women in the park got married\nIt's the way that we do it now it's time to get carried\nLas Vegas at the time wanted a mother of mine\nMyself I needed somethin I could shine\nFortunately, goin to the fast, gettin at last\nHey, I'm bein tested...\nIrreconcilable differences, it's not over\nI lost my house and my jewelry got stolen\nAnd the kids were back with Sirita - it was the worst feelin\nThat you could think anybody could have, and Lord I need ya\nI'm runnin around the struggle, runnin around the crib\nWe ain't gettin robbed again, we ain't gettin robbed again\nPaperwork's an issue, attorneys and lawsuits\nAnd the lawyer fees concocted to get me fucked up and keep me on recruit\n\n[Hook]\n\n[Interlude: Bizzy]\nYeah, the \"Resurrection\" and \"The Gift\" came out\nBeautiful deal and we worked it out for about a year hittin shows\nDoin the road workin real real hard\nWell shit, we had a new team and fresh settings and a healthy body\nFor the road after 11 months of sobriety\nShit recorded that album in L.A\nAnd of course we gettin the kids back\nI think I'm gon' get married\n\n[Bizzy Bone]\nStill never could I fight the night\nAll the women tryin to take my girl's place\nHa, ha, ha, ha, ha, up above, up above\nDo you feel it? Do you feel it? Feel the love, feel the love\nI could not, find in a physical looks, it wasn't there\nAfter goin back and forth to L.A., L.A. cares\nHandlin business, we under new management\nBut I'm growin, you know I'm still flowin\nAnd another year passed, we still gettin gold and dash{?}\nIt's the greatest appearence, and they showed it like wow\nDodge, quick, move!\nYou know you got to be slick and watch out for that bullshit\nWatch out for that pulpit, they got me standin and I'm duckin the guns\nAnd yes I'm duckin the bullets and it's always 'bout the one\nThe one, we represent it forever\nIn the name of the Father, the Son and the Holy Spirit I still remember\n\n[Hook]\n\n[Outro: Bizzy]\nI can remember drinkin with Uncle Damon and his buddy\nWhile we shot ball in the back\nAnd finishing up I was thirstier than a muh'fucker\nI ask Uncle Damon for a drink of the water, shit he said \"Sure, drink it\"\nIce cold cup sweatin and I gulped it\nIt was Gin, wasn't water, but I still downed it\nUncle Damon said, \"You got a rock gut boy\"\nI used to think about Man Man often (Man Man often)"}], "artist": "Bizzy Bone"}