{"artist": "Boosie Badazz", "songs": [{"album": null, "title": "Chill Out - 895203", "year": null, "lyrics": "Intro:LiL Boosie Bad ass\nAlot Of theese niggas ain't ready ta be no gangsta So my word of advice to yall niggas, chill out\n\n1st Verse\nNobody hate me cause they love me.They know im thuggin i ain't backin down from nothin i ain't stuntin (patna). Im from a real street whid real heat called Gstreet, cross the trap we 50 deep how the thugs greet. Bein niggas from fat, skinny, ta thin niggas chill out for you be up in that jail house mamas ain't bring us up to be no gangstas, the hood got us all with anger hood got us all in danger. Niggas throwed on every coner bottle after bottle, another kidney gettin weak,from every swallow.Thought he was gone kill one when he bust that choppa. He let it off and killed wohty, and all his patnas. Now he locked up in a 6 man cell (Gettin Fucked). When he touch down he a straight up gal.Wan be a husla ain't even got no street since.You dont deserve it anyway. Ain't from that durty anyway\n\nChours; Its to late to be the dope man(Chill Out)\nHoes Love You Till You Broke Man (Chill Out)\nWatch Ya Friends Real Close Man (Chill Out)\nThey Give You life up in court LiL nigga chill out\n\n2nd Verse:\nYou wanna life sentence?(think about it) you wanna get put on lockdown were you can't write niggas? you wanna get threw onthat wrong line to fight niggas? you wanna get 20 to life come home stressin on that pipe nigga? if u wanna be a rapper u gotta b dedicated(see mee)nigga couldn't tell boosie shit thats how lil boosie made it nigguhhh chill out, take dat grill out yo mouth, go and sell it fo 300 go get a half a oz(haaha)money talk, bullshit walk a thousand milles ho's go say dey love a nigga but dey love da shinee so many niggas want my shine so i keep a 9, if im stressin i need purple 2 ease my miiind u dont know bout taken losses you dont know bout throwin crosses u dont no bout communicatin wit bosses u got yo gold in yo mouth and got yo pistol now ain't nobody done ya nutin BUT, u a killa now\n\nChours; Its to late to be the dope man(Chill Out)\nHoes Love You Till You Broke Man (Chill Out)\nWatch Ya Friends Real Close Man (Chill Out)\nThey Give You life up in court LiL nigga chill out\n\n3rd Verse:\nU ain't tired nigga? u can't c dat yo momma eyes ain't dried yet?(LOOK AT EM) you get caught on dat ride u gone be quiet(g code!) u got dat pistol u ready for that fire play where ya mind at? u got screws in ya head u ain't retarded in a retarded way but i guess u thuggin so u betta be bout that pistol play donkey chill out, eva since he been out laughin lookin happy his lil cuz takin ova the south but all the boys already thuggin, will it come back to haunt him, come back on our baby mommas me? im mister 106, can't fuck wit no bitch tryna chill my ass out lil boosie on that otha shit shoulda told glen 2 chill out and slow his roll, but i told him to go get laptops and 44's forgive me god my heart wuz cold real gangstas dont see 25 wut i was told", "image": "https://images.genius.com/681f4bb9ff46a631f887773f54f74156.1000x1000x1.jpg"}]}