{"songs": [{"title": "Gangsta Gangsta", "album": "Bred 2 Die Born 2 Live", "year": "2010-12-17", "image": "https://images.genius.com/0ec27b6023fdef052011e493255845b9.900x900x1.jpg", "lyrics": "[Intro: Lil Scrappy]\nZone 3, Aye!!\nWe finna crank this bitch up (BME!)\nShow yall what some real gangstas is at\nSome of yall niggas just dunno (G-Unit!)\n\n[Hook: Lil Scrappy & Lil Jon]\nI'm a gangsta, gangsta, ay 2-4-5\nGotta charga on the boost, baby girl you wanna ride?\nWith a gangsta, gangsta\nAye! Yeah that's me, tinted out ridin' dirty, comin' down ya street\nI'm a gangsta, gangsta\nGet triggas squeezed up!\nGot fifty killas with me, straped down, G's up!\nCause I'm a gangsta, gangsta\nYea top of the list\nBME motherfucker, getcha mind right bitch!\n\n[Verse 1: Lil Scrappy]\nSo many ways, you can spray, git hit\nWith tha' K, anyday, ain't gon' motherfuckin' say (Aye, Aye!!)\nDat you might git touched\nCuz em gangsta ass niggas, they don't talk too much\nCome around, fuck with me, and then you might git rushed\nNawh, I ain't with the yappin', but I make the gat go bust\nKeep fuckin' with us, we off the danger-ous\nShow you the meanin' of ash to ash, is just a dust\nIf you laid back in the 'Lac\nI dunno If them hatas gon' handle dat\nKeep my motherfuckin' hand on my fuckin' gat\nAye, yall motherfuckers betta git back\nYea, all the young ladies call me +Get It Mayn'+\nI don't know if yall lames gon' undastand\nYou can see the phat stacks off, in my pants\nTried to keep it like a lame, you ain't got a chance bwoi, cause\n\n[Hook: Lil Scrappy & Lil Jon]\nI'm a gangsta, gangsta, ay 2-4-5\nGotta charga on the boost, baby girl you wanna ride?\nWith a gangsta, gangsta\nAye! Yeah that's me, tinted out ridin' dirty, comin' down ya street\nI'm a gangsta, gangsta\nGet triggas squeezed up!\nGot fifty killas with me, straped down, G's up!\nCause I'm a gangsta, gangsta\nYea top of the list\nGuerilla Unit motherfucker, getcha mind right bitch!\n\n[Verse 2: Lil Scrappy]\nWhatcha lookin' at? - Yee'in hard like granite!\nHardest nigga on the planet, err punch I throw landed\nYee'in gon' be standin' afta me, Goddammit!\nKnock you off ya balance, if ya ass try to challenge\nWho, me?! Nawh, I ain't say I was no killa\nI just sayd dat I ain't no bitch nigga\nYee'in think I was gon' pull it up now, did cha?\nBesides, dat's my lil' hommie pullin' dat trigga\nI hit the mall by my self, the hood by my self\nWhen I'm in L.A. I rock the Kakhi's with the belt\nOn the Beach of Miami rock Versace with the silk\nI'm so gangsta - I eat the cereal without the milk\nAnd nawh I ain't actin', I'm just real like dat\nMake my grill look good with the 45 stack\nSome of yall motherfuckers ain't built like dat\nI got gangsta in my blood, so you can kiss my ass\n\n[Hook: Lil Scrappy & Lil Jon]\nI'm a gangsta, gangsta, ay 2-4-5\nGotta charga on the boost, baby girl you wanna ride?\nWith a gangsta, gangsta\nAye! Yeah that's me, tinted out ridin' dirty, comin' down ya street\nI'm a gangsta, gangsta\nGet triggas squeezed up!\nGot fifty killas with me, straped down, G's up!\nCause I'm a gangsta, gangsta\nYea top of the list\nBME motherfucker, getcha mind right bitch!\n\n[Verse 3: Lil Scrappy]\nGot the white walls on the Old School (Dat's gangsta!)\nWhen I whip up, all the ho's choose (Dat's gangsta!)\nI git money like I fuckin' posed to (Dat's gangsta!)\nYea, I know I'm gangsta - but how 'bout you (Not gangsta!)\nAll black shirt with the black out shoes\nBlack tube socks and a matchin' hat too\nAnd my G-Unit jeans straight raw blue\nCuz where I'm from bein' a playa is gangsta smooth\nI'm a Guerilla on it all, keep my lil' pimpin' straight on G' mode\nAll up in the club with my pockets on swole\nOh, you think I'm sweet?! - Then try me ho'\nGit stomped to the flo'\nI was born in the A, raised in the A\nWhen I did my durrt nigga, I ain't gon' say\nShiit, I was gon' grow up and be a gangsta anyways\nGotta couple of war wounds on the gangsta face\n\n[Hook: Lil Scrappy & Lil Jon]\nI'm a gangsta, gangsta, ay 2-4-5\nGotta charga on the boost, baby girl you wanna ride?\nWith a gangsta, gangsta\nAye! Yeah that's me, tinted out ridin' dirty, comin' down ya street\nI'm a gangsta, gangsta\nGet triggas squeezed up!\nGot fifty killas with me, straped down, G's up!\nCause I'm a gangsta, gangsta\nYea top of the list\nGuerilla Unit motherfucker, getcha mind right bitch!"}], "artist": "Lil Scrappy"}