{"artist": "Porta", "songs": [{"album": "No hay truco", "title": "Rumores, lo que se comenta por allí", "image": "https://images.genius.com/8d2637d189e14c6096a3e8262f996719.605x605x1.jpg", "lyrics": "[Intro]\n\"Cuado uno adquiere un poco de fama, la gente le observa. Todos buscan el modo de hundirle.No creo que mucha gente de crédito a esas sandeces. Cuando se atisba un resquicio de felicidad, siempre hay alguien que quiere destruirla. Deberías tener cuidado con lo que anda diciendo la gente. No sacaría el tema si pensara que son rumores pasajeros. No me sorprende… ¿Y qué dicen?\"\n\n\"¡Eh tío, tío, me he enterao' de que el Porta, hostia, que el Porta es un pijo tío, que el Porta es un pijo, es un niño de papi!\"\n\"¿Pero, cómo puede ser eso? Pero, si es un super rapper, ahí, va de\nGangsta en su barrio, que le quieren meter y todo por ahí tío\"\n\"Que no, que no, que no que es un puto pijo\"\n\n[Verso 1]\nMira, mira…\nMira, que sólo son rumores, y me sudan los cojones\nAl final dirán que Bazzel y yo somos maricones\nNos hemos montao' una crew de pijos en Lebu, ¿que no?\nMe puse a currar como un cerdo pero me lo pagó papi todo\nJuzgáis sin conocer, habláis sin saber\nQue se han llegado hasta a inventar que las letras me las hacen\nSé que os jode que sea tan bueno y buscáis la explicación\nJoder, no hay truco, por las noches me masturbo en mi habitación\nPensando, en todas estas cosas\nEn vuestra absurda manipulación de la prensa rosa\nSobre el rap, sobre Porta\nSois los típicos tontitos que riman Porta con \"la tiene corta\"\nY la envidia que os consume por dentro\nYo me divierto viendo esto, lo siento si os enfurezco\nEs cierto, Porta paga el estudio\nLo que os inventéis por ahí de mí de verdad que me come el prepucio\n¿Que me tiraron un huevo en la cara y que no hice nada?\nCada uno que se inventa paridas, os la tengo jurada\nDejadme en paz, hostia, es que la fama no va conmigo\nAsí que si ni me conoces, no digas que se me ha subido\nHablar por hablar, juzgar sin conocer, cosa de tontos\nEl criterio es algo que saben utilizar muy pocos\nY luego hablan de respeto los rappers de la sala\nQue voy de gangster, de ghetto, de pijo, hippie y bakala\nLo que me faltaba, se inventan que pago por colabo\nHay que ver como esta el panorama de los rap-aficionados\nYo soy repetitivo y que tengo la voz rayante\nClaro y además, que sepas que me hago el interesante\nAmo al que me tiene odio, me da entretenimiento\n¿Soy un ricachón con pelo pijo y plumón en invierno?\nAh, ¿qué me dedico a robar bases? Pura coincidencia\nProductores segundones, flipo con vuestra incompetencia\nVender bases y luego venderla a otra es de Xinkoa\nSeñor Traidor, todavía espero esas cartas de Boa\nPor estoy de-acuer-do con vuestras críticas\nMás falsas que la Iglesia y el beso del señor Judas\n\nMe buscan por mi barrio, y no sé ni por qué\n¿Será por eso de no ser barriobajero y ser MC?\nQue sí pesaos, que soy chulo, pijo y prepotente\nDímelo por Messenger y mejor si estoy en ausente\nMe agregan 20 personas al día, eh, pero soy un borde\nQuién me conoce sabe que mi cuarto es puro desorden\nSoy un niño de papá y mamá que lo tengo todo\nNo tengo tanta imaginación al meterme en un foro\nEh, no molo, porque no fumo ni bebo, y eso no es de rapper\nA la peña les gusta inventar porque son unos Casper\nJoder, estoy triste tío, ¿por qué la pilláis contra mí?\nPor favor, no digáis que morí estampado a lo Lady Di\nTus amigos comentan por ahí que tú en freestyle me follas\nSabes dónde encontrarme, demuéstrales que se equivocan\nEn realidad podéis juzgar mi rap pero no mi persona\n¿Qué mi rap es lo de menos? Sé que es bueno, normal que os joda\nPapá siempre decía que no aunque mamá me consentía\nNo pasa nada, yo os perdono, ya que es cosa de la envidia\nHay tontos que se hacen pasar por mí pa' meterme peña en contra\nY luego están los típicos que quieren ser como Porta\nMi maqueta ocho cientos mil eurazos\nLas letras, el estilo, el flow novecientos mil, ya de paso\nTrabajo en automatismo \"¡ignorante!\" ¿no sabes qué es?\nSoy autodidacta hago letras de quinceañero, ya lo sé\nCon tus amigos vas de chulo y seguro que me vacilas\nSi te cruzas conmigo en la calle solo ni me miras\nSi lo haces es por admiración, vivo en un barrio pijo\nEso un chaval que vive en Pedral D'Esprobijo\nOs inventáis chismes, mentiras secundarias\nNo podéis atacar mi rap, porque está guapo, eso os da rabia\nLa envidia es mala, ¿no lo aprendisteis en el cole?\nLas apariencias engañan, tú mejor deja de ir de malote\nDecir que tengo un tema con alguien que ni sé quien es\nHe rapeao con Andy y Lucas, Melendi y Miguel Bosé\nNo te jode, decid que escucho maquina y reggeaton\nQue el Porta con sus cadenitas se cree muy vacilón\n\nMira, os contaré una cosa, que quizá no sabéis\nBueno, ¿para qué decirlo si algo ya os inventareis?\nImaginación no os falta, ¿qué pasa?, vivo en Sarrià, ah\nQue es un motivo más que me impida hacer rap\nBuah, reconócelo, sabéis que lo hago cojonudo\nMis palabras os las meto por el culo con embudo\nQueréis engañaros y decir que yo soy un mierdas\nSé que os gusta escuchar en un cuarto a oscuras mi maqueta\nPero que nadie lo sepa, sigue el líder de los tuyos\nOdio a las crews porque suelen estar compuestas por capullos\nComentad sobre mi rap, no sobre mi vida personal\nPorta no es de puerta gracioso, sé más original\n¿Me echaron de un bolo a patadas?\nAntes os doy hostias, os lo juro\nCuando se dice micro libre, es micro libre y punto\nYa os gustaría que yo me fuera por patas\nLo que pasa es que pa' quedar bien a tu forma lo relatas\n¿De dónde coño sale lo de que soy un pijai?\nPapá no pagó nada, flipo con lo que os inventáis\nHay mil rumores rulando por ahí, hostia puta\nQue sepáis que el Porta se parte la caja y lo disfruta\nRumores los inventan anónimos porque sí\nSois MCs del club de los sin nombre porque os aburrís\nNo es sólo llegar arriba, también es mantenerse\nQuién no tiene medios es porque no sabe moverse\n\nEscuchad, voy a ser sincero\nLa calidad quizá sí, pero hacer buen rap no es cuestión de dinero\nSois la pena del rap que da risa\nHablan de mí por la espalda y a la cara siempre falsas sonrisas\nDecidme algo que no se ha dicho, algo que no sepa\nAgradecer a todos los que me habéis dedicado temas\n¡Eh! No voy a nombraros, que no os daré promoción\nQuién se de por aludido, será por alguna razón\nTú, tú pierdes el tiempo si crees que me joden rumores\nCanciones, señores escuchen\nVerás que me río de quien intente inventar pa' tocar mis cojones\nCritican sin escuchar, sin saber mucho se inventan\nNo existen comentarios tontos, si no tontos que comentan\n\nEs acordar mi directo, se marchó más que encantada\nAunque fueras al Soma con pasta, te echaría a patadas\nHabla lo que quieras, no me molesta para nada\nLos que me insultasteis pa' hacerlo antes pagasteis la entrada\nEl doble de Cheewaka, mide sus traumas sin careta\nSu careto es tan feo que hasta es de portada de maqueta\nMe libro de saber que hacer, cambias tu voz cada dos por tres\nTe masacro y grabo en Lebu con el Singstar, joder\nA ver si lo pillas, hombres de día\nA eso se le llama ragga y yo lo hago con picardía\nPesado, a ver si callas ya, el lunes ve a limpiarlo\n\"Eh tío, Carlos, ve y págale un calo\"\nEs interesante, otro gilipollas\nM-Ku de mariquita y Valle y Lechoso me comieron la polla\nSandy, 6 plaza de tontos\nP.D.: Espero tener noticias vuestras muy pronto\n\n(Tío, pero ponme la base que no he terminao')\nY el que-dir-án a mí no me importa, gilipollas\nSiempre acabo viendo las firmas de alguna maricona\nVe y lámele el cimbrel al primero que pase\nMe como unas Lays hasta que acaben todos los compases\nY empieza la puta saga del puto Xinkoa\nNo os fiéis de sus bases, porque todas las roba\nPrimero te la da a ti y luego se la da a otro MC\nNegro, pijo gill, latin Sergy, pimpín\nSi leer no te gusta, no te mientas en tus raps\nMaltratadores que no son nada y se creen unos cracks\nSoy dócil casi siempre, menos cuando me joden\nPuteo al quien me putea, siempre y cuando lo merece", "year": "2007-01-29"}]}