{"artist": "Aminé", "songs": [{"title": "STFU", "album": "Good For You", "year": "2017-07-28", "image": "https://images.genius.com/6c500d02619570dd5d1c8b6f77bc796e.1000x1000x1.jpg", "lyrics": "[Intro]\nAy man, say man\nWe starting to get really tired all that, all that hoopty hollering\nWhoopty whoo, blaze blah y'all been talking lately, man\nGo somewhere with all that, man, for real, shut up, shut up\nAll that talking y'all been doing man, for real\n\"I'ma do this, I'ma do that,\" ugh\n\n[Verse 1]\nEvery day you're talking, every day you're in my ears\nAnd every time we fighting, I gotta go and wipe your tears\n'Cause if I don't do, you gon' throw your problems on me\nAnd then we'll fuss and fight when I just really wish you'd...\n\n[Chorus]\nShut the fuck up, don't complicate it\nShut the fuck up, you're overexaggerating\nShut the fuck up, just have some patience\nShut the fuck up, quit giving me hell\n\n[Verse 2]\nWe keep locking eyes, petty so you're silent\nYou keep talking signs, heart is in the science\nSleep, weep, don't cry on me, don't die on me\nAll up in my face with the oochie wally wally\nSounding like girls at a party on the molly\nI ain't tryna link or build\nBubble space, bubble space, still, nigga, chill (Move)\nOh, you got a chain? Sick\nOh, you got some fame? Sick\nGot a new Rolex and you knew he had to flex\n'Cause the hoes gon' check\n500K in my stash\nWhy you flex the only couple hundreds that you have?\nScrew needing security for your insecurity\nCalling niggas broke, you should choke on your own words\nName dropping, pic cropping, dick hopping, bill dodging\nBoy, you know who you are\nMan, why you wanna try so hard?\nBe yourself, be yourself and please\n\n[Chorus]\nShut the fuck up, don't complicate it\nShut the fuck up, you're overexaggerating\nShut the fuck up, just have some patience\nShut the fuck up, get out my head\n\n[Bridge]\nI'm waiting my whole life, but I'm tired, tired of wishing for you\nI'm waiting patiently, but my mischief wishing for something new\n\n[Verse 3]\nMoney come right back, never had to fight that\nBut I come back, back\nThought it was a night cap, life hit a hijack\nGirl, let's be face, face\nHeartbreak Drake for my first heartbreak\nI was 17 and I made mistakes\nWent to dances but I never did dance\nGot pretty fly, but I never did pan\nNow I'm 23, loving and learning from all the lovers that I see\nNissan babes with the body burgundy\nLove my car same way I used to love key\nFriends need a Uber, sis need tuition\nFans want the music, but they want a politician\nPressure, pressure, pressure, pressure, pressure\nShut the fuck up, I don't need the extras\nSpice girls sitting in the red Mercedes\nAttitude like I'm tryna have your babies\nBut I ain't tryna have no babies\nNo, I ain't tryna have no baby\n\n[Outro]\nBeen waiting my whole life but I'm tired\nTired of wishing for you\nI'm waiting patiently but my mischief\nWishing for something new"}]}