{"artist": "Waka Flocka Flame", "songs": [{"year": null, "lyrics": "[Waka Flocka]\nPow x8\nShoot first, ask questions last. Thats how these so called gangsta's last\nWaka Flocka Flame 1017\n\n[Hook - Waka Flocka]\nPow x4, Bitch I'm bustin' at 'em\nPow x4 , Bitch I'm bustin' at 'em\nPow x4, Bitch I'm bustin' at 'em\nAin't no talkin' homie, I'm jus' bustin' at 'em\nPow x4, Bitch I'm bustin' at 'em\nPow x4, Bitch I'm bustin' at 'em\nPow x4, Bitch I'm bustin' at 'em\nAin't no talkin' homie, I'm jus' bustin' at 'em\n\n[Verse 1: Waka Flocka]\nI been gettin' this, see like then like my neck was killin'\nGrow a sumo on my face, call me flockaveli\nNigga what's the dealy, Lemme know what's brackin'\nAin't no flamer's round here, nigga stop that actin'\nBitch I'm 'bout that action, so drink 'em like a fraction\nEverybody packin, like nick minaj ass\nKush smell like garbage, nigga pay some homage\nThen got a hood, now that bitch call me finest\nMizay made as mess shit that my mother\nYella diamonds fuzzy chain shit that bitch like butta\nBitch I'm like no otha', rap nigga\nYou can call me good, broke-ass strap nigga\n\n[Chorus]\nKY Engineerin', fuzzy got 'em steerin'\nFuzzy diamond earin's, M6 what I'm steerin's\nWoke up to next year in, re-rack diamond earin's\nThat some John Dearin, nigga who you scarin'\nShawty I'm tatted up, you can call me inky\nAll I do is get brains, you can call me pinkie\nMy gooch is like winky, right nigga\nI got my swag up, right nigga\nI heard they got a price tag on a nigga head\nYou got a better chance snitchin', nigga goin feds\nYou dug your own grave, let me make yo' jail bed\nSuicide shawty shot his own self red\nRIVERDALE!\n\n[Chorus]\nWaka waka waka flocka flocka waka waka yeah!\nWaka flocka flocka flocka FLAME!\nWaka flocka flocka waka flocka flocka waka flocka FLOCKA! Waka flocka flocka waka waka flocka flocka yeah! Waka flocka Flocka flocka BRIIIIIIIIICCCCCKKKKKK SQUUUUUAAAAAD!! FLOCKA!", "image": "https://images.genius.com/2c0ce44440f772f4cebdfb4d0195df8e.836x836x1.jpg", "album": null, "title": "Bustin’ at ’em - amended"}]}