{"songs": [{"image": "https://images.genius.com/a771fd3e611d5c86a13b17b05dbb15f9.500x500x1.jpg", "lyrics": "Derrière leurs cravates et leurs airs de diplomates\nSe cachent les pirates de l’extrême droite\nJ’veux pas m’embarquer dans l’débat d’la souveraineté\nMais laissez-moi vous exprimer ma façon d’penser\n\nChacun a ses valeurs, pour la plupart j’respecte les leurs\nMais c’est bin d’valeur, pas celles des conservateurs\n\nAwaillez les gais, décalissez?\nMême chose pour les fauchés pi les femmes qui veulent pas d’bébés?\nC’est quoi ces conneries d’agir comme un camp nazi?\nPendant qu’Obama s’adoucit, on d’vient les nouveaux États-Unis!\nNos artistes vivent dans misère, le cash d’la culture passe dans guerre\nJ’vous dis ça, ça m’crisse à terre, connaissez-vous Thomas Mulcair?\n\nTant que Harper sera chef des lieux\nMoi pi bin d’autres malheureux s’sentirons même pas chez eux\nMoi pi bin d’autres malheureux, on veut un registre des armes à feu\nMoi pi bin d’autres malheureux, avec Harper, ça fait deux\n\nMoi, moi, j’tanné d’ce pays, moi\nMultitude de pays s’mordent les doigts pour des droits\nDes droits qu’on a, mais qu’on perdra au compte de trois, si on s’lève pas\nUn, deux, trois, on marche tout droit\n\nC’est un débat qui va au-delà de la souveraineté et du combat acharné pour que notre belle langue soit conservée\nOn est en train d’reculer, c’est retardé, j’ai eu beau chercher aucun autre mot j’ai pu trouver!\n\nJ’respecte certains fondements d’la droite économique, j’pas non plus un communiste qui déteste l’odeur qu’a le fric\nJ’pas plus raciste que communiste, r’garde, j’aime bin la culture qu’a l’Afrique\nMais notre gouvernement m’lève le cœur, j’leur lève mon doigt d’honneur\nOn est d’la même couleur mais leurs valeurs me font criss’ment peur\n\nOh! Maman! Un peu comme notre gouvernement, j’oubliais l’environnement!\nOn a quitté Kyoto, car économiquement parlant, c’était pas enrichissant, soi-disant…\n\nJ’sais pas pour toi mon grand, mais moi j’veux qu’mes enfants grandissent dans un pays ouvert, vert pi pas toute viré à l’envers\n\nQue ton pays soit l’Canada, que ton pays soit l’Québec, faut qu’justice soit faite!\n\nSi Harper gagne un autre mandat, j’sacre mon camp sur une autre planète", "title": "Derrière les cravates", "year": "2012-05-01", "album": null}], "artist": "Unknown Artist"}