{"songs": [{"album": "Hood Hop", "year": null, "title": "Welcome to Tha Hood", "image": "https://images.genius.com/dc1e313d046fcee39f7241ff6abdcee0.600x600x1.jpg", "lyrics": "[Intro - J-Kwon]\nI make erry mu'fucka in this bitch do the whop (J-Kwon)\nThis the new improved Hood Hop\nI make erry mu'fucka in this bitch do the whop (TrackBoy music nigga)\n\n[Verse - J-Kwon]\nI ain't tryin' to change hip hop (hip hop)\nPut one in ya side to make ya hip hop (hip hop)\nKnock derty right out his flip flops (bing)\nBoy fifth cock, derty get rocks (get rocks)\nGee I'll just lean on him (lean on 'em)\nMiss business herre then he swing on 'em (swing on 'em)\nProblem too big, put the team on 'em (team on 'em)\nThey still runnin' up, put the beam on 'em (there he go)\nI don't give a damn if you don't like me (so what?)\nI ain't gon' \"Do The Right Thing\", I ain't Spike Lee\nSpike cyanide in ya ice tea\nI'll choke her while I sex her like Ike T\nSt. Louis ain't ridin' and they likely (yeah they likely)\nI roll wit real fellas that's on strike three (strike three)\nSnatch ya ass up if you strike me (uh)\nYou ain't happy with that, coward bite me (huh)\n\n[Hook - J-Kwon] - x2\nNow do you got a gun? (Welcome to the hood)\nGot a pocket full of crack? (Welcome to the hood)\nLost your money shootin' craps? (Welcome to the hood)\nHave you ever been car jacked? (Welcome to the hood)\n\n[Verse - J-Kwon]\nUncle Charles said the game needs me (needs me)\nSo I keep the red beam to make the aim easy (easy)\nYou put me on game like Baby Train Weezy (Weezy)\nAnd all they told me dude pimpin' ain't easy (keep it cool)\nUsed to pop Big Papa work\nNow my diamonds big and blue like Papa Smurf (the little guys)\nAnd dude I'll pop a jerk\nAnd my homie rob his brothers now his pockets hurt (let me get that)\nLike Jay I did it my way\nI ain't get it for Freestyle Friday\nCardinal curve hand north talk sideways\nI got work up and down Kingshighway\nPlus dude bring the hood to the rap game (rap game)\nWanna bet? some like a crap game (crap game)\nWork a sex, better have my exact change (exact change)\nOr I'll run in the boardroom, let it clap mayn\nGLACK mayn\n\n[Hook - J-Kwon] - x2\nNow do you got a gun? (Welcome to the hood)\nGot a pocket full of crack? (Welcome to the hood)\nLost your money shootin' craps? (Welcome to the hood)\nHave you ever been car jacked? (Welcome to the hood)\n\n[Verse - J-Kwon]\nThrid District's who I represent\nOne of the watches look like a peppermint\nShake your frame is what Salt-N-Pepa meant\nCops can't spray the dude's face wit peppermint (Hey it wasn't me!)\nMan cause I put the iron on 'em\n+Heavy Starch+, put \"Da Hol' 9\" on 'em\nHeavy spark, now the dirt lyin' on him\nOops my bad, found out they was lyin' on him (oh well)\nGot a flat? need a car jack?\nBetter yet, need a strap cause the car jacked (let me catch him)\nTrackBoyz where the stars at\nHave you got to the track like Tall Cat? (keep it movin)\nBut I'll never leave my hood derty\nIf I fell and got my hood dirty (got my hood dirty)\nEven when I get this good thirty\nI'mma be in the hood wit a good birdy (a good birdy)\n\n[Hook - J-Kwon] - x3\nNow do you got a gun? (Welcome to the hood)\nGot a pocket full of crack? (Welcome to the hood)\nLost your money shootin' craps? (Welcome to the hood)\nHave you ever been car jacked? (Welcome to the hood)"}], "artist": "J-Kwon"}