{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse 1: Wrekonize]\nIf they got chains, I got aim\nTo be livin' in the middle of the lane\nAnd they feel it's strange that I'm plain\nBut it feels quite right to be sane\nI've been locked down to the lounge\nAnd I can't get a route to be proud of, I'm living in code\nEverything I plant in the ground comes back to me now\nHow stylish I'm feeling en vogue\nWhat you got a house in the hills just south of Brazil sounds nice we been gettin' roundhoused to the grill\nBut it's cool, we don't need whole lotta clout doused to be real\nEverything I ever wanted just right here\nSmiles bout a mile wide, yes, my dear\nLotta health, little wealth, and a check I clear\nWithout somebody trying to come and wreck my gears\nGod damn what a day to be walkin' tall\nBottle full of whiskey and barking dogs\nFrom South Beach out into to Arkansas\nThey tellin' me the evils about to fall\nSo we just keep on doin' what we all been doin' bruh\nI let 'em know\nThat they can't get a stand if we ain't on the ground\nDon't walk with me now ya just float\n\n[Bridge: Wrekonize]\nSoon as you turn the pages I'm sure that you will find\nThis vibin' is contagious, it's known to blow your mind\nSee death has many faces, but life is mighty fine\nSo if you think you're outta time\nJust come now and turn the pages, I'm sure that you will find\nThis vibin' is contagious, it's known to blow your mind\nSee death has many faces, but life is so divine\nSo if you think you're outta time (come on!)\n\n[Hook: Wrekonize & Lindy Miller]\nI could show you how to float\nAh ah ahh! Ah ah ahh! Ah ah ahh!\nI could show you how to float\nAh ah ahh! Ah ah ahh! Ah ah ahh!\nI could show you how to float (come on!)\nAh ah ahh! (come on!)\nAh ah ahh! (come on!)\nAh ah ahh! (come on!)\nI could show you how to float (come on!)\nAh ah ahh! (come on!)\nAh ah ahh! (come on!)\nAh ah ahh!\n\n[Verse 2: Wrekonize]\nIf I got aim, they got pain\nAnd they keep blowin' up into the blame\nOn a people that just came for some change\nLike we don't have a right to complain\nI been goin' downtown with the sound bros\nAll the real people that are in the town know\nThat when we come around we bring the party down low\nFor the ones that could never hear us on the outro\nI got fam in all states, puttin' jam on all plates\nI've been battlin' the rates but the tides are changing\nSee the spice is cajun, mics are blazing\nYou might recognize the arrangement\nI'm a boom-bap child with a trapped out style that keeps Ben in the basement\nWith a bowl full of soul and nobody I could talk to I'm awfully patient\nWhatchu got? Whatchu need? Who you were? Who you be?\nHere's a detailed statement\nWhat you believe in can also be a page you are not even aware that you're tracin'\nBut we keep it all goin' for the day in day out love of the nation\nIf you need to float with me take your legs to the head and forget about the pavement\n\n[Bridge: Wrekonize]\nSoon as you turn the pages I'm sure that you will find\nThis vibin' is contagious, it's known to blow your mind\nSee death has many faces, but life is mighty fine\nSo if you think you're outta time\nJust come now and turn the pages, I'm sure that you will find\nThis vibin' is contagious, it's known to blow your mind\nSee death has many faces, but life is so divine\nSo if you think you're outta time (come on!)\n\n[Hook: Wrekonize & Lindy Miller]\nI could show you how to float\nAh ah ahh! Ah ah ahh! Ah ah ahh!\nI could show you how to float\nAh ah ahh! Ah ah ahh! Ah ah ahh!\nI could show you how to float (come on!)\nAh ah ahh! (come on!)\nAh ah ahh! (come on!)\nAh ah ahh! (come on!)\nI could show you how to float (come on!)\nAh ah ahh! (come on!)\nAh ah ahh! (come on!)\nAh ah ahh!", "title": "Float", "year": "2017-05-05", "album": "Into the Further", "image": "https://images.genius.com/6f3dc8fd85f67bd995f87b15cb9bb3a1.1000x1000x1.jpg"}]}