{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/b00bc126ff085dc7857c5c0135e584cf.640x640x1.jpg", "title": "Hang Out", "year": null, "album": "Gift Raps", "lyrics": "Just got this text from this lady, says she wants to hang out\nHope both of our intentions are headed down the same route\nCuz hanging out to me is; chilling, choking, smoking something potent\nAnd i'm stroking not too long after you come though the hotel door\nDon't tell no one. it's a request you don't even got to make\nYou might as well not even come if you think its getting too late\nCuz baby, let me tell you. Grown ass man don't play no games\nYou know, headed to something official\nDon't pay these lames no attention\nAll these niggas want is some attention\nReal niggas get that paper middle finger to your feelings\nStraight killing, making moves\nBackstage with something pretty, she's so confused\nShe putting on a front and trying to get a G to choose\nYou gotta choose me, PYT you know the rules\nTalking dirty sipping hennessy with apple juice\nShe finally kept it real and said can I come back with you\nI said what you trying to do?\nShe said hang out\nI caught a flashback of when i got played out\nSame situation i thought it was going down\nShe wasn't real, just wanted to see the life and hangout\n\nShe say she wanna hangout, don't know\nI hope we on the same page, you know\nShe say she wanna hangout, don't know\nI hope we on the same page, you know\n\nPeace to them ladies who stay gettin higher\nCan buy their own attire, and don't need a supplier\nLet's smoke a purple and discuss all your priors\nShe's polite and nice to hood, I come from shittin on the wire\nBecause im poppin, shorty think I be lying\nCuz if she was in my shoes, she would be lying\nChicks ain't slick, got 'em all in together now\nIn my hotel,smoking, ready for another round\nIntroduce myself, hoping later on we can do something\nNot just one maybe two of them, three of them\nFuck it the more the merrier, now roll the mary up and blow me very much\nYou cold baby you got potential to be in my world\nGirl, it's you that i'm into\nCouple stallions? bitches who decide to jury and mix some last names??\n\nShe say she wanna hangout, don't know\nI hope we on the same page, you know\nShe say she wanna hangout, don't know\nI hope we on the same page, you know"}]}