{"artist": "Ant Banks", "songs": [{"title": "Lead the Way", "image": "https://images.genius.com/1c2d1a64d2c42fd9013cbcb50fe0fdbc.711x711x1.jpg", "album": "Lead the Way", "lyrics": "[Intro: Ant Banks]\nHuh, I mean, this is nothing, man\nBosses will be bosses, man\nHey V, what's happening, baby?\nTalk to me\n\n[Vidal Prevost]\nHey man\nThis ain't no harder than drivin' a big wheel\nThrough a Georgia cotton field, man\nThis ruthless\nThe original game detector\nYeah, you know what I mean?\nAbout you niggas smugglin, switchin, you know what I mean?\nRunnin' off with all my game..  \"Oh boy\"\nAll over, man\n\n[Too $hort]\nOh, who really made this shit possible, nigga?\nThem Town niggas  \"Eastside\"\n\n[Verse 1: Ant Banks]\nNow let me take you to the Land that's still the greatest\nWhere the game we display is real contagious\nIt's filled with players, real G's and innovators\nBeatin' on haters like the Oakland Raiders\nAt the club we dance with a gangster limp\nPlayers pop collars and pose like a pimp\nStrike out in the fall, ridin' a haul\nNow who the hell you thought taught rappers to ball?....\n\n[Verse 2: Too $hort]\n10'000 studio sessions\nUp all night, gotta count your blessings\nYou better take lessons\nWho you testin?\nWe taught you everything you know, ain't no guessin'\nLike Iceberg Slim and Donald Goines\nTown niggas from the Bay got it goin' on\nSpittin' game, that's what you like\nSo when I'm rappin' on the mic\nDon't bite, bitch...\n\n[Chorus: Dionne Jackson]\nDid you know we do this all the time?\nAre you trying to find some peace of mind?\nAll you need to do is let us lead the way\n\n[Ant Banks]\nI mean, Oh boy Pimping\nThis is what we do all day, every day\n\n[Dionne Jackson]\nAre you looking for that place to go\nWhere the true players kick game for sure\nAll you need to do is let us lead the way\n\n[Dolla Will]\nBosses will be bosses\nSo quick\n\n[Verse 3: Dolla Will]\nYeah, it's the new millennium, yeah, Y2Yey\nWe been puttin' it down right here in the Bay\nKeepin' new game to spit, what is it?\nWhile the game ?proof? your ear ?hustle takin' a nap?\nLike they invented it\nAll in your video poppin' your collar, what is it?\nThat's a Bay thing, take it from Dolla\nI'ma tell you what's real, ain't no time to play\nWe here to stay, the whole damn Yey, let me sweep away.....\n\n[Verse 4: Captain Save'm]\nI got kids that look up to me, and you can bet\nI even made on-line investments on the internet\nWith overnight Fed-Ex's and faxes\nYoung producers and C.E.O.'s worldwide makin' it happen\nIndependent distribution was the solution\nFor the CD's and computer-generated barcode we was usin'\nStreet teams posted at the retail shops\nMovin' units out the moms & pops....\n\n[Chorus: Dionne Jackson]\nDid you know we do this all the time?\nAre you trying to find some peace of mind?\nAll you need to do is let us lead the way\n\n[Vidal Prevost]\nEither you gon' be with it or without it\nBut us Bay Boys, we gon' be about it\n\n[Dionne Jackson]\nAre you looking for that place to go\nWhere the true players kick game for sure\nAll you need to do is let us lead the way\n\n[Ant Banks]\nI mean, this is a everyday way of living for us pimping\nOh boy\n\n[Verse 5: Vidal Prevost]\nFrom doin' burn-outs in old school Coupe De Villes\nTo popping X and gettin' court dates for shootin' to kill\nWho was the first artist you ever heard to say the 'b-i'\nAnd what was the first CD you ever known to keep it p-i\nWho was the first to work the ???? creases with the Levi's\nThe same soldiers on the frontline claimin' Eastside\nOakland, known for totin, we showboatin'\nRockin Roleys in 500's and keep the tires smokin...\n\n[Verse 6: Ant Banks]\nIt's rough in the hood tryin' to raise your seed\nWanna hide all your problems, blaze the weed\nA lot of homies is dyin, boy, I gots to live\nBefore I go I better stock a grip for my kids\nAnd that's all that counts to me\nBut what it amouts to be\nIs who will look out for me\n(If I) didn't turn out to be\nA G, laced with game essential\nI'm tryin' to keep my kids from goin' through what I went through...\n\n[Chorus: Dionne Jackson]\nDid you know we do this all the time?\nAre you trying to find some peace of mind?\nAll you need to do is let us lead the way\n\n[Vidal Prevost]\nIt's real simple, man\nFollow the boss and you will never get lost like what\n\n[Dionne Jackson]\nAre you looking for that place to go\nWhere the true players kick game for sure\nAll you need to do is let us lead the way\n\n[Outro: Ant Banks]\nYey Area bosses doin' it so big\nJ Spencer Oh boy\n\n(*sax solo by J Spencer*)", "year": "2000-10-03"}]}