{"songs": [{"album": "Writers Block 4", "year": null, "title": "Back in the Lab", "image": "https://images.genius.com/1f0fd6347441756be6a3b0a912737071.500x500x1.jpg", "lyrics": "[JR Writer]\nWriter, okay\nUhh, I got 'em, DipSet, uhh\n\nBack to the lab, rap in the bag\nRoll me a blunt, pass me a pad, the dude's goin in\nI mastered the craft, laugh at the past\nFo' in the trunk, mashin the gas, you're too slow to win\nWho's dope as him, latent'll lie\nSo high, you'd swear he had a license to fly\nLook up, you might even see him right in the sky\nSo high, I should give skydivin a try - know why?\nI'm gettin loot and bread, got these lil' duellers fed\nCause this rap shit to me is easier than Superhead\nWhen she move the bed, prick I'm on the grind\nLyrically inclined, every sentence get rewind\nThe kid is in his prime, a monster on the track\nTauntin all these cats, where's the competition at?\nJR spittin crack, The Carter couldn't match\nSharper than a tack hold Harlem on his back\nIt's a fact you couldn't yell our shit is whack\nI helped build the team that put Harlem on the map (DipSet)\nCome holla at a mack, who got this in a wrap\nSo next album'll have your girl polishin his - plaque\nUhh, then it's right to the streets\nLight on my feet, goonies that'll light you for cheap\nWipe you deceased, knife you to sleep, for some sneaks\nEven though my pockets deep as Barry White on the beat\nSheesh, I'm a beast with a flow like a jab\nPlus the game's so weak that the dough's up for grabs\nSo I'm low on the ave, with the toast on my abs\nWaitin for this bitch so I can put the ho in the bag\nIt's sad, but nigga I'm a pro with the pad\nPut the mic down, you're washed up and old as my dad\nGet a load of his swag, you couldn't fly without a pilot\nYou're bummed out and better off findin you a stylist\nUhh, the future is me, and soon as can be\nRuger to T, shoot you for free, salute to the G\nWho's nothin but nicer, gun in his cypher\nBottom line, ain't nobody out as hungry as Writer, uhh\n\nYou hear that man?\nY'all can't fuck with me at all man\nI got this shit on lock and key\nAnd I think I mighta lost the key so y'all assed out man\nHuh, let me get my zone on man\nLet me finish smokin this purple, countin this money\nAnd uhh, turn the music up and get in my zone man\nLet's do it~!"}], "artist": "J.R. Writer"}