{"artist": "Pharoahe Monch", "songs": [{"album": "W.A.R. (We Are Renegades)", "title": "Assassins", "image": "https://images.genius.com/2694343eb76859336bf01cf74ae9f24b.250x250x1.jpg", "lyrics": "[Intro: Pharoahe Monch & Jean Grae]\nIn 2013, the World Government placed sanctions against freethinking individuals in order to force people to adhere to one way of life\nAn independently funded organization called poh pih evas nac ew dna eerf rof cisum gnidaolnwod gnikcuf pots hired one hundred assassins to infiltrate the headquarters where files were kept\nOf these one hundred, ninety-seven were captured, tortured, and executed\nOnly three remained\nThe third of which was said to own an arsenal that would rival an entire city's police force\nThe second was rumored was to be able to move throughout space and time And the first... (One)\n\n[Verse 1: Jean Grae]\nFasten your seat belts for the last of the three assassins on earth\nThe first flashing her purse where a heat stealth\nThey call me Jean McCoy, beast in me employed, deploy deplorable\nThrough audible destructive actions, attractive decoy\nThen pass it to Troy after I'm passing your life over\nHe'll deliver it through river Styx, Hades, I'm cold, deliberate, ladies\nMy foes limited, pray me some praise (whispering)\nStay on your toes villains, it's Grae and your day's whittling\nBlistering lines packed in six, stick to spine\nWracked with a sick mind, trapped in thick bitch frame\nDrug you with strychnine in nine drinks, you drunk, and it's my\nKidney, you dickbrain, I'm just itching to slit veins\nStitch lines, Rick James, fuck yo lives, sip brains, bitches\nNiggas, kick rocks, or kick rhymes, it's to the pain\nLiquor riddled liver, sieve in it, sipping it like Capri Sun\nIgnint as ever, she's clever, equivalent be none\nA ball breaker, call fakers out with passion\nYou got the gall, bastard, to brawl with the broad brashest\nThe ball's in your court, pass it - but warning - fall faster\nThan asses with age slack on the back of a Kardashian\nThe walls crash in, you all on the floor gasping\nThe gas pour in the corridor, racking your jaws, blacking out\nCatch Grae backing out the back door, cackling\nStill make it back to the bar for last call\n\n(Two)\n\n[Verse 2: Pharoahe Monch]\nThey ask me why I'm highly regarded, this God body probably\nMonch is a mixture of Marcus Garvey, Miles Davis and Bob Marley (radical)\nNever skateboard slang like gnarly, more like:\nWeed in my whip on the way to get top like Charles Barkley\nYou are hardly prepared to spar with a marksman - spark me\nI'm Gambit with the ace of spades, a master in archery\nVehicular, particularly the vernacular\nSpecifically the fit so when I spit it it's spectacular and accurate\nWhen I attack I'm more legend than Acura\nFlip Bloomberg the bird, bitch, more blood than Blacula\nMore Crip than cryptic scriptures encrypted with backwards vernacular\nPlus sicker than most like Glenn Close in Fatal Attraction\nI am that nigga for real\nPer capita smacking the next rapper that uses the term swag or thereafter\nThese three assassins get to ass whipping\nPrepare to for a professional ass that can\nShape shift, spit, hollow tip clips mainly\nSick, ain't he - mind control\nMake you shoot your best friend in the face, Dick Cheney\nMy life is like a documentary film depicted in black and white\nFlick's grainy (geronimo)\nI'm on Guantanamo Bay taking pics in a Captain Morgan pose\nWith my left foot on a pile of detainees screaming\n\"We are renegades!\"\nFuck you. Pay me\n\n[Skit: Pharoahe Monch & Jean Grae]\n(Jean Grae) Two. Where the fuck...no. Where the fuck is Three?\n(Pharoahe Monch) I know. I know. He's gonna be here. He gave me his word, trust me\n(JG) Yeah, but he does this every time\n(PM) He's gonna be here, trust me\n(JG) He's gonna ruin this mission for us again\n(PM) Look, here he comes now\n[Car crash]\n\n[Verse 3: Royce Da 5'9\"]\nI be riding round with a stripper-slash-burlesque model\nI make it pop like my cock in a Durex condom\nI'm a opposite artist I find irony in going\nFrom being like a stone in the grass to rocking the Garden\nThe same irony as going from fully automatic in the backyard\nTo having the whole machine behind me\nI take my Australian bitches and show her some other thangs\nShe know my stroke is deadly so she gave me bloody brain\nDon't try to get familiar, if I don't feel you in person\nI'll flip the script and I'll accidentally kill you on purpose\nThe bad is what I'm flailing, I got so many furs\nPETA gonna paint splash me when they see me no matter what I'm wearing\nYour bitch about to open up, sniff some blow off of my dick\nGuess you could say she on my coconuts\nI'm on point like Chris Paul\nYou on point like an Atlantic City hooker that licks balls\nI'm about to flip in this bitch like Dominique Dawes\nAnd shut shit down like a car when it stalls\nI am the deadliest rapper, you claiming that you flow like water\nBut really y'all niggas Evian backwards\nMarshall hit the jackpot with this flow that I got\nI know when I'm hot, it's my show to stop, holding my crotch\nMy whip cleaner than Amish men in honest ends\nTwo dimes with me like I'm a twin cause I'm a ten\n\n[Pharoahe Monch]\nOkay... I'm in", "year": "2011-03-15"}]}