{"songs": [{"album": "Epiphany", "image": "https://images.genius.com/cf73b3c0367ce45f5a6bebbc8b65ed71.1000x1000x1.jpg", "year": "2007-06-05", "title": "Backseat Action", "lyrics": "[Intro: T-Pain]\nOHHH! OHHH!\nI'm about to pull over, and give you the business\nHolla at me (OOOH) can I get a witness?\nNow here we go - hmm, hmm, hmm\nHere we go - hmm, hmm, hmm\n\n[T-Pain]\nBaby~! I've been waitin for you to come home\nCause I done cleared off the backseat\nCleaned the top, and put some new 24's on the Brougham\nLately~! I've been waitin to try something new\nCause we done did every last one of yo' fantasies\nBut we ain't did nothin I wanna do\nCause we done did in in the elevator (been there, done that)\nNow it's time to do it my way (I know you want that)\nAnd pullin your hair, won't even compare\nTo what I'm 'bout to do to you on this highway\n\n[Hook: T-Pain]\nI'm talkin 'bout that backseat action (ohhh)\nOut in the middle of the traffic (ohhh)\n'Bout to pull over, and give you the business\nHolla at me (OOOH) can I get a witness? Now here we go\n[Bridge: Shawnna 2x]\nHere we go, back and forth (hmm)\nBreak it down, or take it slow (hmm)\nTake control, make it last (hmm)\nBreak it down, now here we go (here we go)\n\n[T-Pain]\nShawty~! you can call me whenever you need\nWorkin in the Excursion, kissin in the Expedition like yes indeed!\nBaby~! It's all gravy - it's all good\nCause we gon' need to open up the back do' and let your legs out\nOr I'mma put you right on the hood\nI've been down like an elevator (been there, done that)\nI know you like to do it my way (I know you want that)\nAnd pullin your hair, won't even compare\nTo what I'm 'bout to do to you on this highway\n\n[Hook]\n\n[Bridge 2x]\n\n[Verse 3: Shawna]\nFace down, ass up - that's the way I like it rough\nCloud it up, back it up - driver's seat to the passenger\nBack to the back, all in the act - smack, smack, smack, smack\nShinin like that that good old kid, hands on the window foot on the wheel\nFace in the seat, wait for the beat, rockin 'n rockin 'n makin it squeak\nStop, stop, stop, stop - what'chu gon' do? Somebody might see\nSo make it fast, take it slow\nBreak it down and make it roll\nTake control, make it swoll\nNow one mo' time cause here we go\n\n[Hook]\n\n[Bridge 2x]"}], "artist": "T-Pain"}