{"songs": [{"title": "Double C’s", "lyrics": "[Intro]\nSushi on the beat, it's a wrap (Sushi)\n\n[Chorus]\nThis drip is Chanel (Bitch)\nHow you gonna talk about dates when half of my team is in jail? (Bitch)\nI made Forbes' \"30 Under 30,\" I might go flood out my girl's (Wrist)\nSee-through Louboutin heels, I might just blood out my girl's (Kicks)\nMan's doing tour in Chanel (Kicks)\nThis drip is Chanel (Bitch)\nHow you gonna talk about dates when half of my team is in jail? (Bitch)\nI made Forbes' \"30 Under 30,\" I might go flood out my girl's (Wrist)\nSee-through Louboutin heels, I might just blood out my girl's (Kicks)\nMan's doing tour in Chanel (Kicks)\n\n[Verse 1]\nMy new girl's not a keeper (Nah)\nF moves, might use her as a striker (I might)\nShe's way too fast and hyper (Very fast)\nShe can tell that I really don't like her (Why not)\nBut it's cool, she don't like me either (Uh)\nShe thinks that I love Dua Lipa (Haha)\nShe ain't wrong but the wife ting's deeper (Uh)\nI feel like girls want me locked in a sleeper (Look)\nMan's got bars for days, bars for hours (Yeah)\nGirls get my bed all wet after showers (Uh)\nI can't chat, talking out, that's for cowards (Nah)\nGot hoes from The Hague to Broward (Down here)\nMan's got bars for days, bars for weeks (Weeks)\nGirls wanna spray their tings in my sheets (Wow)\nI hit once, then online they wan' pree (Yeah)\nNikes, Truey jeans, they come free (Wow)\nAnd my dick's Fashion Nova the way girls promo (Haha)\nHi-Tech, Sprite, got me slow-mo (Yeah)\nCome a long way from evading the teachers and po-po (Bye-bye)\nNow I duck girls, taxman solo (Haha)\nDrop-tops and a heart on my polo\nUsed to touch hard yellow bricks like Toto\nMy posh ting said my work rate's Kanté (What?)\nThat's why she always wanna bend and go low\n\n[Chorus]\nThis drip is Chanel (Bitch)\nHow you gonna talk about dates when half of my team is in jail? (Bitch)\nI made Forbes' \"30 Under 30,\" I might go flood out my girl's (Wrist)\nSee-through Louboutin heels, I might just blood out my girl's (Kicks)\nMan's doing tour in Chanel (Kicks)\nThis drip is Chanel (Bitch)\nHow you gonna talk about dates when half of my team is in jail? (Bitch)\nI made Forbes' \"30 Under 30,\" I might go flood out my girl's (Wrist)\nSee-through Louboutin heels, I might just blood out my girl's (Kicks)\nMan's doing tour in Chanel (Kicks)\n\n[Verse 2]\nMy headteacher couldn't manage me (Or Danny)\nFuck Mr. Hall, he's a prick (Hah)\nAnd I'm still getting money in the Grove where the bangers be (Fuck him)\nI could never get served like a Canapé (Uh)\nI got my stack thick like Hannah B (Like who?)\nI got my stack thick like Kim K (Like who?)\nI got my stack thick like Demi Rose (Like who?)\nI got my stack thick like a manatee (Ah)\nTold fans that I'm not a role model (Nope)\nLive by the Majin rules and the anarchy (Like who?)\nI won't let 'em down, that's a guarantee (Hah)\nThe last one, I'm defending the galaxy (Yeah)\nBros call me Shisui\nI lay low so they diss me (Huh?)\nI draw swords all swiftly (Swift)\nHand tings to blow your mind like a gypsy\nDidn't know who when it blew like Nipsey (Nipsey)\nUh, with that shit you can miss me (Yeah)\nAJ didn't shot, AJ bumped me\nAJ's moist but AJ dipped me (Wah)\nPick one, if you're really on man, stick me (Come)\nG-R-O-V-E where the kid be (Grove)\nYou really ain't there (No)\nRude ting, this ain't Brazilian hair (Ah)\nCooly, I brought the Trinian hair\nGet drilly, it's clear (Brrt)\n\n[Chorus]\nThis drip is Chanel (Bitch)\nHow you gonna talk about dates when half of my team is in jail? (Bitch)\nI made Forbes' \"30 Under 30,\" I might go flood out my girl's (Wrist)\nSee-through Louboutin heels, I might just blood out my girl's (Kicks)\nMan's doing tour in Chanel (Kicks)\nThis drip is Chanel (Bitch)\nHow you gonna talk about dates when half of my team is in jail? (Bitch)\nI made Forbes' \"30 Under 30,\" I might go flood out my girl's (Wrist)\nSee-through Louboutin heels, I might just blood out my girl's (Kicks)\nMan's doing tour in Chanel (Kicks, Sushi)\n\n[Outro]\nSo if you don't know names, it's just rumours, I don't know what you're talking about\nIf you know something and you feel like you... well if you feel like you know something, I feel like you need to speak up\nOtherwise, that is it at all, if it's just a rumour\nThen we're grown, we don't need to bring things up like that\n'Cause you know there's enough people that talk shit about you daily\nAnd there's no reason for me to come back to you unless it's real\nOr unless I thought it was real\nSo, invalid", "year": "2019-01-08", "album": "AJ Tracey", "image": "https://images.genius.com/589b9cacc4ac662673a7a7bab3cd179e.1000x1000x1.jpg"}], "artist": "AJ Tracey"}