{"songs": [{"year": "2005-02-08", "image": "https://images.genius.com/4faa518970e19e22ecdc868732305777.640x640x1.jpg", "title": "Now", "album": "Sleepers", "lyrics": "[Intro: Murs (Rapper Big Pooh)]\n(Cheah), yeah\n(Uh), Big Pooh, (what?)\nMurs, (what?)\n(It's like, I'm like, we like)\nWe the only three niggas it seems like the rap game\nWithout baby brothers (It's like, I'm like, we like)\nSo we all Little Brothers (I'm like)\nJustus League, Living Legends\nYeah (check me)\n\n[Verse 1: Rapper Big Pooh]\nWell it's Rapper, Pooh, chill type fellow\nLike to play the cut, observe, be mellow\nNiggas want to test the boy, they want to mess with boy\nI tell 'em \"Not tonight, my nigga, hello\"\nI got a chip on my shoulder bigger than a boulder\nI swear I told you or warned you son, I'm not the one!\nWhen you see me comin to the booth\nYour best bet, just reverse pivot and run\nTop dog, I'm a son of a who, wanna run with the crew?\nTold you we the illest there is\nJ-Lizzy always handle they biz, I got no time for these kids\nWho gonna pout cause I ain't speak to him\nWhen I talk, it sound Greek to them\nCause homie I don't protest\nSo fuck you, I ain't tryna be friends\nBetter yet, I'm the realest that come\nLike hel-i-um, on the rise, bout to be the one!\n\n[Hook: Rapper Big Pooh]\nPeople wanna stop my shine\nAnd they wanna take what's mine\nEver since I came out the gate niggas\nSuck on the kid and they wonder why I hate niggas\nNiggas see me doing my thing\nThey wanna be a part of my team\nAnd they wonder why I stay on the low\nTo avoid fake niggas tryna steal my glow\n\n[Verse 2: Rapper Big Pooh]\nAnd this is for anybody not checking for me\nOr the cats from the League, or the state of NC\nWe put it down like, or get around like\nShock G when he playin Humpty\nAnd now these chickens getting wet to hump me\nI guess I got to go and make \"Groupies Pt. 3\"\nSo pardon me for my foul demeanour\nEver since The Listening, Pooh's got a lot meaner\nI seen her, and she ain't pretty\nThe other side of the dream when it do get gritty\nRandom niggas wanna cling to your side, and family members arise\nWho you ain't heard from since five\nI wish, you can get a closer look in my eyes\nAnd realise this is pain brewin from the inside\nBut my pride won't let me quit\nAnd I'm the man that I am just because of it, biatch!\n\n[Hook]\n\n[Verse 3: Murs]\nThis is Murs, CST 1-9-7-8\nSince then been a G from the Golden State\nFirst touched a four-track since back in 1992\nNow I'm busting on tracks with a Rapper named Pooh\nYour crew (shut up, put in on) inconsequential\nWe intercontinental over Khrysis instrumentals\nNot as simple as it looks, sixteen and a hook\nThere's a lot more to this rap game, nigga look\nThat's exactly how you up and coming artists get shook\nAnd took, for all your green, broke for self-esteem\nYour hopes and your dreams, it's not as easy as it seems\nTo get your CD on the scene, keep rappin for fun\nFreestylin to yourself bout how you clappin your guns\nWhile I'm stackin these huns, till they thick as a tiller\nHow you got a glass jaw, tryna spit like a killer?\nI rhyme, write hooks till your transpare remandable\nShatter, leaving shards of you showbiz animals\nThat trained to look hard for these video channels\nSo they, mean up they mug, and they, hardcore strut\nWhen they soft as that porn that they showin uncut\nWanted to fuck every single last one of y'all up\nBut Big Pooh told me chill, plus the label called me up\nAnd said that you would probably sue cause your crew was too timid\nPlus it wouldn't be good for my backpackin image, hahaha\n\n[Hook]\n\n[Outro: Rapper Big Pooh]\nCheah, uh, what? What?\nIt's like, I'm like, we like\nIt's like, I'm like, we like\nI'm like"}], "artist": "Rapper Big Pooh"}