{"songs": [{"image": "https://images.genius.com/88547a705adcf151f726a2e02e45f9f0.480x360x1.jpg", "title": "BODY BAG MATERIAL", "album": null, "year": "2016-06-02", "lyrics": "{Intro}\nBodybag material...\nBodybag material...\n\nScratch off the serial...\n\nBodybag material\n\nYeah. Yeah\n\nBodybag material\n\n{Verse 1}\nSlang stradavarius, arrow in ya skull like sagittarius\nScary lyricist, water torture you aquarius\nNefarious with various types\nThat will smoke you in broad daylight\nLike Marion Berry's crack pipe\nRoll up in a charriot (clap) trough ya barriers\nBody bag a badge, thirty slugs in dirty Harry's chest\nGapes in ya stomach, like hairy vaginal areas\nYou never lived the streetlife, you live vicarious\nHit you on the motherfucking block bitch, there he is\nYou got beef with a crew of agitated barbarians\nAggravated assault on your majesty, tear his face to bits\nYou are to fragile sniffing magic fairy dust\nCatch you at the bus stop, it's tragic when the ratchet bust\nSmash you with the fist, pain like ovarian cyst\nI can't stand you bitch, i'm anti gregarious\nI rock dope gear, professionally fly aerosmith\n\n{Hook}\nBodybag material...\n\nBodybag material...\n\nScratch off the serial...\n\nBodybag material...\n\nBodybag material (Bodybag material scratch off the serial)\n\n{Verse 2}\nAlmost fish-hooked by a sprat pisces\nIce you in the trunk of crysler\nWith no license a crisis, wipe feces on the diocese\nThen i piss on the pope, drop em in the high seas\nDie please, you send threats to an inbox\nI send shots, to ya top gemini twin Glocks\nPurgatory on turbo, Manson on dabs\nYa fergie virgo give you cancerous crabs\nTryin to act the norm, i'll send ya bitch back to porn\nRip through ya grill split ya cap, you're corn\nGot a libido for giving beatings i gallivant\nScorpio killer aiming a torpedo at callahan\nYou won't get bail ya fucked, it sucks\nLeft to rot in jail like a schmuck, the libra scales are corrupt\nCheck this i'm the chief of O.G. BEEF\nReckless rocking a necklace, with leo teeth\nAries fire burn you like a forest full of wood\nPop a taurus bullet at your bullshit hood\nZodiac killer lyrical cryptic cryptogram\nRun up on you at night, flip in the clip and BLAM!\n\nBodybag material...\n\n{Instrumental}"}], "artist": "Necro"}