{"songs": [{"image": "https://images.genius.com/46246a8ab5cb3dd15477ef4a9e77c90b.1000x1000x1.jpg", "album": "Game Over - EP", "title": "Question Time", "lyrics": "Look\nA question for the new prime minister\nHow'd you have a heart so sinister?\nHow are you so wasteful when people are dying in Somalia\nAfghanistan, Egypt, Libya?\nThe irony is we have no business in Syria\nBut kids are getting killed for all the business in Syria\nAnd then they try and tell you it's ISIS, it's ISIS\nIn their attempts at killing it, how many civilians\nDied, so what's the difference between us and them?\nWhen you got drones killing kids just touching ten\nThen when a bomb goes off, every politician's lost\nLike that last strike that didn't kill a hundred men\nYou ain't the same as them\nBut all that fuel for the fire is what you gave to them\nAnd what you take from them\n\nAll my life I know my mum's been working\nIn and out of nursing, struggling, hurting\nI just find it fucked that the government is struggling\nTo care for a person that cares for a person\nSo where's the discussion on wages and budgets?\nHow they made them redundant when I was a young'un\nThe letters in our car said my mum was overdraft\nBut somehow I still had dinner money in my pocket\nAnd even the little things like ordering pizza\nWere probably the reason for overtime in the evening\nFive till ten, six hours of sleeping\nFor 22 years my mum was doing the cleaning\nDreaming that her kids would have a better life\nGo in bed at night, struggling with getting by\nThat's the reality for millions of people in a nation\nWhere a lot of us were looking for a second try\n\nA question for the new prime minister\nAnd please, tell me if I'm being narrowminded\nBut how do we spend so much money on defence\nAnd weapons to wage war when the NHS is dying?\nBursting at the seams, and what about them people\nThat voted for us to leave for the money that it would see?\n350 million we give to the EU every week\nThat our health service needs\nBut now them politicians got what they wanted\nCan you see an empty promise or a poster on the street?\nNurses in tears 'cause they're working every hour of the week\nAnd they still don't have the money that they need\nYou brought the heart of the nation to its knees\nUnderpaid, understaffed, overworked\nAnd overseen by people who can't ever understand\nHow it feels to live life like you and me\n\nPatients lying in the corridors\n'Cause doctors can't even find a bed for them to sleep\nI remember A&E and all them sickening screams\nOf a little girl waiting for a surgeon to be seen\nPrivatized healthcare, guns for police\nIncreased uni fees, is this what they're selling us?\nWell let me remind you just in case you've forgotten\nThat we live in Great Britain, not in Donald Trump's America\nSpeaking of America, state and the president\nWith all due respect, I've got something to say to them\nI just find it funny you can't give a hand to Palestine\nBut you can trade whole arms with Saudi Arabia\n\nLook, look\nI've got a question for the new prime minister\nAt Grenfell Tower, your response was ridiculous\nYou hid like a coward behind your 5 million\nDodged responsibility and acted like you're innocent\nAnd I can see you're terrified, you're not good at telling lies\nI'm getting why you stay away from everything that's televised\nYou look like a robot and you don't speak with any life\nIt feels to me like any guy in press could've said them lines\nImagine going to the council for the safety of your block\nAnd you've got kids but they're ignoring you at every time\nEveryone who knew about that cladding\nShould really be going prison under rule of joint enterprise\nBut if it ain't a little kid with a knife\nI bet that judge is going easy when he's giving him time\nThey don't deserve to be free\nAny builder, MP that knew about the conditions but did it to save cheese\nWhen I listen to the things that the residents had seen\nI was so shocked I couldn't even speak\nFamilies they know that had died in their sleep\nHow you choke on the smoke when you're struggling to breathe\nThe glow from the fire\nThe panic when you hear all the sirens\nThe crackling, the popping and the muffled-out screams\nThe fear in the eyes of a man that was trapped\nWho jumped 15 floors from the tower to the street\nI could only hear a fraction of the pain and the grief\nClosing my eyes, trying hard not to cry\nAnd the joy and relief in the face of a man\nWhen a woman from the flat said his neighbour was alive\nNo help from the council in keeping any list\nOr the people that survived, his neighbours and peers\nAnd for that whole meeting I could see that he was trying\nSo his smile was an island in a sea full of tears\n\nLook, I've got a message for our old prime minister\nDavid Cameron\nI mean you fucked us, resigned, then sneaked out the firing line\nI wanna know how you managed it\nAnd are you bathing in the sun while them papers have a run\nAt the woman that you left here to handle it?\nYou gonna teach your little lad to be the man that's got a plan\nAnd then the moment that it fails to abandon it?\nAre there bullies in his school?\nAnd when you pick him up after class, can you feel his embarrassment?\nI mean you never gave a fuck about the youth and that's the truth\nThere's no sympathy for you or your cabinet\nI really wish I could've seen how you were scramblin'\nWhen you lost the referendum that you had to win\nI feel like politicians are all addicts\nIn a big fat game but it's lives that you gamble with\n\nI've got a question for the leader of the Labour Party\nJeremy Corbyn, where do you wanna take the country to?\nHonestly, I wanna put my trust in you\nBut you can understand why if I've got trust issues\nDo you really have the faith of your party?\nDo you really have faith in the party that will come with you?\nAnd how do you plan on keeping all the promises?\nMan, if I'm being honest, sir, I'm struggling to get with it\nI just ain't getting it\nEverybody's great until you get them into office and then guys start forgetting things\nProve to us you're different, don't promise me anything\nGo and get justice for Rashan Charles and Edison\nAnd if you haven't had the thought to vote yet\nOr protest 'cause you don't really see the progress\nI hope you know that what they're saying is affecting us\nThe small steps are way better than no steps", "year": "2017-10-09"}], "artist": "Dave"}