{"artist": "Yung Bans", "songs": [{"album": "MISUNDERSTOOD", "image": "https://images.genius.com/96f7e4381a7e85c9840d3d332b3496f5.1000x1000x1.png", "year": "2019-07-24", "lyrics": "[Intro: Yung Bans]\nMurda on the beat so it's not nice\nHmm, yeah, yeah\n\n[Chorus: Yung Bans]\nHmm, ayy, yeah, I got so many enemies, ayy\nIf I die today, is you gon' remember me? Yeah\nGo and get it or get got, that ain't sin to me, yeah\nI done seen a lot, product of these streets\nYeah, yeah, yeah, yeah, yeah\nI can't put my trust in you, huh\nI can't put my trust in you\n\n[Verse 1: Lil Durk]\nThat Glock come dark skin\nCaught a case, I was locked in\nStreet shit, I was locked in\nCame from them apartments\nGotta watch, you plottin', 'cause niggas flodgin'\nBullets, we dodgin', gotta take precautions\nWhat you gon' do when you run out of money?\nWhat you gon' do when you can't serve a junkie?\nAsked you once, \"Do you really love me?\"\nKnow you a snake 'cause you snaked your cousin\nI take drugs, prescription, how you love them niggas?\nDurkio too official, we ain't into it with niggas\nThem statements got your initials, I can't get caught with pistols\nUndercover agents, they was shoppin' with you\nI take a lot to get to, I take a lot to get to\n\n[Verse 2: Yung Bans]\nThis shit ain't new to me, the streets ain't foolin' me\nThis shit ain't new to me, the streets ain't foolin' me\nThis shit ain't new to me, the streets ain't foolin' me\nThis shit ain't new to me, the streets ain't foolin' me\nHundred thousand all hundreds, young nigga been thuggin'\nI been juggin', not juggin', came straight out the gutter\nPussy niggas with money, they get on my fuckin' nerves\nLeave that bullshit for the birds, in a hotbox gettin' curved\nMama told me, I ain't learn, had to do that on my own\nRidin' with that fuckin' chrome, this is why I wrote this song\nI ain't even write this song, swear this shit straight off the dome\nPut the chrome to your dome, send your pussy nigga home\n\n[Chorus: Yung Bans]\nHmm, ayy, yeah, I got so many enemies, ayy\nIf I die today, is you gon' remember me? Yeah\nGo and get it or get got, that ain't sin to me, yeah\nI done seen a lot, product of these streets\nYeah, yeah, yeah, yeah, yeah\nI can't put my trust in you, huh\nI can't put my trust in you\n\n[Verse 3: NAV]\nCoffins, get some coffins (Coffins)\nI'm tired of hearing all this talkin' (Tired)\nChalk in, get the chalk in\nMy dogs gon' bite, they ain't just barkin' (Yeah)\nCan't trust her based off what she would do for a Birkin (Hell nah)\nShe from the hood, her cousin jackboy puttin' work in\nWhen she met me, tried to tell me she a virgin (Me, cap)\nKnew she was lyin' as soon as I seen her twerk it (Twerk twerk, yeah)\nAnd catch the ones from the sky (Work work, yeah)\nI know that look in her eyes (I know)\nSince my first milli', I don't who I can trust, dawg (Yeah)\nFeels like lately all my loose ties gettin' cut off (Yeah)\nAin't tryna fuck lately, I'm tellin' bitches fuck off (Yeah)\nWorkin' hard, never dependin' on no luck, dawg (Yeah)\nCelibate the way I never gave a fuck, dawg\n\n[Chorus: Yung Bans]\nHmm, ayy, yeah, I got so many enemies, ayy\nIf I die today, is you gon' remember me? Yeah\nGo and get it or get got, that ain't sin to me, yeah\nI done seen a lot, product of these streets\nYeah, yeah, yeah, yeah, yeah\nI can't put my trust in you, huh\nI can't put my trust in you", "title": "Enemies"}]}