{"songs": [{"year": "2013-11-08", "image": "https://images.genius.com/fc3c5ac207b810bbfabe4cace34bc549.480x480x1.jpg", "title": "Freestyle Nocturne Planète Rap", "album": null, "lyrics": "Han, 45 tours pour chanter la sère-mi, 45 chtars dans le rétro j'suis zehaf. Ca pue les 45 jours de tard-mi\nPanamovic à le \"zen\" loin du Kérosène, mais il a les cernes dans l'insomnie\nJ'arrive sur le rap-game en bulldozer\nQui ne saute pas n'est pas de Paris\nAnimé par les moteurs, les ein-s, la zeb, les tissus des XXX d'Italie\nDepuis tout petit j'entends qu'faut faire d'l'oseille, Paname je suis l'homme de ta nuit!\nRap indépendant financé par les profils à cocaïne, Hôtel, Champaign\nLa vie s'enchérit tellement le sourire des bicos s'payent! No Pain - No Gain!\nMais je les arrose à la kalash en pleine euphorie, fucking concurrence à vomir!\nEntre Drive-by en bolide! Zlat'Hayce compte plaider la folie!\nDès l'enfance on est différent comme 2-Chainz!\nC'est le diable qui tient ton couteau!\nC'est normal que tu t'prennes des coups d'chaises!\nFallait pas nous donnez pouki ton puto!\nJ'vois cette putain d'vie couleur kaki\nJ'sors le mili des yeux c'est car-ci\nCar-Jacking, ta l'cœur qui palpite à la sortie du parking!\nHold-Up, Ratatat'Hayce\nRatatat'Hayce, Zlat'Hayce connaît pas l'Rap-Game mais le Rap-Game connaît Zlat'Hayce!\nLass, Oussem, Dino solo sur un compét'\nOn vend d'la zipette pour faires des emplettes\nAttraper de belles bitchs, pas d'baraque au bled\nMoi j'suis parano mec, j'suis pas renommé, à part pour la monnaie, j'suis pas malhonnête\nJ'suis ce parolier, qui peut renier, que j'vous parraine au mic' bande de marionnettes ?\nJ'vais niquer des reu-mé, tu vas pas m'reconnaitre\nJ'ai rien à espérer, rien à promettre\nNul n'est à l'abri d'une rafale dans les pommettes\nDe finir à Fleury, Fresnes, aux Baumettes\nPassez pas la pommade, j'vais devenir vulgaire\nJ'voulais juste une limonade et des chiennes de guerre\nComme un pointeur en promenade rentre sous terre\nSur Paname ramène pas tes textes de merde, bico !\nJ'ai tenter de pardonner, la rue m'a donner l'amour que je n'ai pas donner!\nNé en Algérie j'part de rien! Les plus belles années de ma jeunesse à charbonner!\nTous les soirs interpellées, Ils veulent que j'finisse ma vie derrière des barbelés!\n6 du mat', Ils débarquent, me soulèvent; J'ai le fou-rire en voyant le commissaire gueuler!\nRythme de vie dégueulasse, on vit comme ça depuis qu'on a la morve au nez\nL'illicite une longue impasse que l'on emprunte pour survivre, on en a marre d'voler!\nUne main de fer dans un gant de velours\nJ'm'adresse a tous ces batards qui veulent me testent : Venez!\nVous n'allez pas me voir venir! As-tu déjà eu affaire avec un bico décervelé!\nIl s'agit d'faire du blé! Etant minot j'rasait l'mur pour allez l'tenir!\nManque de money, j'me démenais pour en obtenir quitte à m'faire cueillir si les shlags saignent du nez!\nIci c'est dur d'aimer son prochain, l'appât du gain pour nous attrayez!\nTout ça pour fréquenter des boites de nuits, nul n'est à l'abri de tomber amoureux d'une trainée!\nOn va tous payer, pour le mal qu'on fait chaque jours, On va tous payer!\nOn va tous crever, chacun son heure, chacun son tour, On va tous crever!\n\nElectron Libre, je vais où je veux, j'viens du four, j'ai le cœur geler!\nEt de ma vie je n'ai jamais douter que j'entendrais mon heure sonner!\nC'est mon come-back, je retourne au combat! Fidèle à mes principes jusqu'à la pierre tombale\nJ'refuse qu'on me compare à ces putos j'en bave! Mes lokos sont parti, ne reviendront pas!\nRelève la tête au lieu d'maculer! De larmes tes draps! Les vrais lokos ne baissent pas les bras!\nP'tit con ma hargne nait dans les drames! (Braah' !)\nPure Bico, Pur Malfrat, j'opère en pure indé' comme Alpha!\nJe n'ai pas de pipo juste une plume trempée dans l'hémoglobine des kehbas\nTu rappes une comédie dramatique, J'rappe la street comme un automatique!\n'Laisse des scènes de crime grammatical! De nos jours seul la haine est gratuite!\nJ'empoigne le micro comme un glaive pour mes lokos dehors comme aux shtars\nHier ils marchaient sur mes rêves, demain je serai leur pire cauchemar\nJ'ai bossé dur pour en arriver là, j'ai débuté dans la cave en acappela\nC'est le retour de l'arabe en parabellum, pur comme cette poudre près du Venezuela\nC'est l'retour d'Hayce Lem, j'manque de sommeil, blanche porcelaine est ma gow\nSi ces bikos veulent ma peau : qu'ils craignent un drive-by en vago\nC'n'est pas une mixtape c'est un braquo, qui veut m'empêcher d'conquérir la Gaule ?\nSont sérieux les jaloux ils parlent comme si j'avais 3 Murcielago la gow!\nSi tu veux qu'on s'entendent, faut qu'tu soit consentante pour que j'ten sanglante après le show case!\nJ'ramène 4 bouteilles monte sur ma bistouquette ça fait bang bang bang\nBitch You XXX , you pay on avance en bande\nLes p´tites macrelle sont souvent présentent , en entrant sans gants\nJ'entends toc toc toc , Vic mackey le rap on s'en branle\nMon frère on s'comprend , mais dit moi s'que t'en pense\nTu tape Hayce lemsi , la rime transcendante , j'les étrangle sans blagues ils repartent sans dents , leurs putes m'harcèlent\nWesh monsieur l'agent pose le six hours pour voir\nLa mort est au bout du couloir , l'insomnie c'est de l'or , ils dorment\nMais le temps c'est d'l'argent , la vitesse c'est l'pouvoir !\n133 piges colonisé, voilà pourquoi sur la France ont a miser\nTrès tôt dans la délinquance , on a glisser , tous des cas isolé , camisoler\nSois pas [déloné?], XXXX touche le baveux!\nPour le beurre et l'argent de la barrette!\nJ'suis du #XVBarbare, par où les morveux touchent la drrrogue, le Glock et la bavette !\nRéglé comme le big-bang! J'ai la barre de plus et eux deux j'ai toujours envie de ken!\nPet'Hayce tu es tellement cette chienne de vie qu't'as choisi d'mener cette vie d'chienne!\nD'où je sors c'flow de taré! La fourche; La J; L'allée ! Où sont mes soldats sanguinaires au cœur du pavé?\nMes bicos font de la money! Mes blackos font de la money! Mes blancos font de la money! Mes lokas font de la money! Mes bicos font de la money! Mes blackos font de la money! Mes blancos font de la money! Mes lokas font de la money!\nElle veut pas de toi bico c'est ma Bitch! Elle veut pas de toi bico c'est ma Bitch! Je crois qu'elle cherche un homme riche, elle aura que l'hotel, une teille, un sandwich! Elle veut pas de toi bico c'est ma Bitch! Elle veut pas de toi bico c'est ma Bitch!\nWelcome to my Hood! On fait d'l'oseille, On Charcute les snitchs!\nHip-hop se sél médicament nou ni\nMuni de ma kalash prémédite le murder\nMa jolie t'as les yeux de la même couleur que ma money!\nMais j'n'ai pas le compte en banque à Birdman!\nTu te donnes en deux minutes si je sors le bolide;\nJ'ai le dos tourné mais je sais que tu me regardes!\nJ't'emmène à l'Holiday Inn, goûte à mon insomnie\nLe lendemain j'monte avec mes potes à me-Da!\nJ'arrive dans l'carré vip : all eyes on me, j'lève mon verre à mes amours et mes ennemis!\nJe ne dormirai pas cette nuit, je ne (x3) dormirai pas cette nuit\nJ'voulais viser la lune avant de monter la colline, j'fais ma route comme un homme j'me fout qu'les gens parlent!\nJ'fais ma route solo, carré d'Hayce all in, Wai gars sortir le Rhum le Champagne!\nMes lokas sont coquettes le videur est sous cocaïne, elles enflamment la piste\nTant que les bikos payent, puis-je t'offrir un cocktail ?\nZina arrache ton phone-tel, je te prendrais comme telle\nComme t'es, tu seras dans mon top ten\nOkay ! Pas d'balade en hélicoptère, laissons brûler le feu de la passion rien n'stress!\nNo stress, j'laisserai pas les autres bikos t'plaire, j'suis ton prince charmant j'te ramène en six point tres\nLa street fait de nous des troubles fêtes courtois, toutefois\nJe me demande encore pourquoi tu me crois fou, loka je suis juste fou d'toi\nJ'ai les mains faites pour l'or, elles sont faites pour toi\nRends-moi loko ma loka, Rends-moi loko ma loka,, Rends-moi loko ma loka,, danse pour Mister-Mister Vida Loca!\n\nOù seras-tu le Lundi 4 Novembre ? (x8)"}], "artist": "Hayce Lemsi"}