{"songs": [{"album": "Bad Season", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg", "year": "2010-12-23", "title": "Ego Trippin’", "lyrics": "[Verse 1: Tech N9ne]\nAy, by now everybody breathing should be into this\nWith us, even have a membership, loving me when I begin to rip\nBut there be some that wanna hinder the sinister nemesis\nCause I'm grim a bit, I am at the end of what I'm finna get\nIntricate, I finish it with a diss for the hiss, but I get no benefit\nI am not a demon cause I'm always beamin' and on some sinner shit\nThis shall replenish this menacing glitch that men have set\nOn my syndicate, this genesis will spit and diminish it\n\n[Hook: Krizz Kaliko]\nI done took all I can stands, and I can't stands no more\nWhen we bust they clap their hands, clap, clap, 'till the hands are sore\nAnd possibly, could you be afraid of me? (Afraid of me?)\nBe careful who you fuckin' with\nBoy, don't let your ego trip\n\n[Verse 2: Tech N9ne]\nI can't stands no more like I was Popeye\nThen I got my spinach and now the industry drop by\nWhen I rock the spot my, plot's to be shot high\nIn a dark sky, in hopes I! Will not die\nThey really are scared of me, they said that T would not fly\nAnd credit was deaded, but he kinetically sped up and guap rised\nOff the top I, will not lie, bread is my fetish\nAnd I really get it, that's why I'm a dreaded hip hop guy\nSo stop try, do not pry\nAnd me won't have to bring the Glock by, nigga, hot fry\nLeave ya mammy with a soft sigh, lost why?\nBecause the jammy did her man like standing on pot pie\nAnd now I keep bitches that'll make Dennis Hoff buy\nTwat, I be so paper that it make the cops spy\nAnd now the haters try to mock my walk to the top\nDynamic and they not I, Boss Nine!\n\n[Hook: Krizz Kaliko]\nI done took all I can stands, and I can't stands no more\nWhen we bust they clap their hands, clap, clap, 'till the hands are sore\nAnd possibly, could you be afraid of me? (Afraid of me?)\nBe careful who you fuckin' with\nBoy, don't let your ego trip"}], "artist": "Tech N9ne"}