{"songs": [{"image": "https://images.genius.com/b7b393f78ee77ed54e14650b402403a6.770x768x1.jpg", "lyrics": "[Chorus 2X]\nI play err thang—video games to pretty hoes, mayne\nErr thang from fly fishin’ to badminton\nDo err thang from surfin' to skiin'\nStay shittin', not peein', in somethin’ European\nErr thang\nErr thang\n\n[Verse 1: Mac Dre]\nI'm the only nigga you know that walked before he crawled\nSo give it to me you beezie, I want it all\nAll of it (all of it), you know, err thang\nI need it before I start hittin' that hairy thang\nThis is a game, and I'm in it\nDick so good I charge by the minute\nIs you lost? It cost to be around the boss\nI play bitches better than Tiger play golf\nAn all-star, never drive a small car\nDavins on mine, shittin' on y'all car\nErr body know Gotti roll the a big body\nAnd err body know I turn out the party\nCatch me at Vlade's, in the Tunnel\nDrinkin' like a fish, mouth like a funnel\nOn err thang—thizz, weed and drank\nAnd whatever else I wanna put in my tank\nWhat y'all think, I was scary, mayne?\nI’m Dre Ghost (Dre Ghost), I do err thang\n\n[Chorus (PSD)]\nI play err thang—video games to pretty hoes, mayne\nErr thang from fly fishin’ to badminton\nDo err thang from surfin' to skiin'\nStay shittin', not peein', in somethin’ European\nErr thang (I slide up, it’s paid for)\nErr thang (And you know it’s all on a hoe)\n\n[Verse 2: PSD]\nI slide up in a German shepherd, minked out leopard\nTailored down suits with my gators checkered\nI’m a ghetto millionaire, hoes pay me from everywhere\nI send them to the track, they bring me, money back\nState to state, Tony is great, money is made\nCatch me in Miami with Miami movin' weight\nI came in the door, haters on the floor\nPocket full of money, my bitch is ready to hoe\nBring daddy dough is all they wanna do\nWhy fuck the bitch when you'll pay her to fuck you\nPawns slide through, I'm with a chosen few\nFifth’d up, feeling like vapors, I’m chipped up\nPull the 6 up, got ‘em lookin' like ‘whoa’\n‘Is it paid for?’ It's all on a hoe\n\n[Chorus]\n\n[Verse 3: Mac Dre]\nGive me a OPD with err thang on it (all of it)\nThat’s right, Alice, you know how I want it\nEvery lady in my palace is named Alice\nDre run things like J.R. from Dallas\nOr Blake Carrington or Victor Newman\nIf another nigga bite me again I’m suing\nWho in, the hell, didn't know\nI do err thang err where I go\nMan, your game is lame, it's very plain\nYou need to quit rappin’, I put that on err thang\nI need some Mary Jane and some Champelli, mayne\nA smelly thang\nJoe Pelly is my relly, mayne\nMac Dregos got hoes in Barbados\nAnd like Suga Wolf, I gather up stables\nRecord labels want me to sign\nBut I’m signed to Thizz and Thizz is mine!", "year": "2004-07-20", "album": "The Genie of The Lamp", "title": "Err Thang"}], "artist": "Mac Dre"}