{"songs": [{"image": "https://images.genius.com/cd51cff3cc6f39e9b12b0dc232dcd334.500x500x1.jpg", "lyrics": "[Intro: Yukmouth]\nLittle ones, yes\nYa nigga Yukmouth in this bitch, what!\nYeah, FM Blue in this bitch, what!\nYeah, Fast Life in this bitch, what!\nReal Oakland niggas, yeah\nEast Oakland niggas, bitch, yeah\nThis when the real meet the real ya nigga, yeah\nUh, yeah\n\n[Verse 1: Yukmouth]\nYuk ain’t Georgy Porgy but the bitches adore me\nSo many condoms on the floor you think it’s an orgy\nSo many choppas in the car you think it’s an Army\nOr a Navy the way blaze K’s at them shady niggas\nSo many throwbacks you think it’s the ‘80s\nThe coupes and trucks back-to-back, Lincoln, Mercedes\nFucked so many bottom broads you think it’s your lady\nOr your bitch, niggas crazy, she drinkin’ my babies, ugh\nSo much ice in the blue chain you probably think it’s Wu-Tang\nSah-dah-tay every day like it’s Pootie Tang\nYuk and FM Blue, mayne, team up like the Kings in a hoop game\nAlley-oop to your nigga with the two chains\nAnd watch me shoot flame, bank shot off the glass, right?\nSmoke-a-Lot and Fast Life, nigga, what your cash like?\nStep it up, I’m like Scrooge McDuck\nIn a coupe gettin’ sucked with the Uz’ to bust, I’m too much\n\n[Chorus 2X: Yukmouth]\n4 Much, in a Chevy swingin’ donuts ‘til the cops show up\nYou know I’m too much, 4 Much, in the kitchen cookin’ dope up\n‘Til the cops the show up, niggas know I’m too much\n\n[Verse 2: Mac Dre]\nI’ll tell you one thing, I run tings like Papa Smurf\nNo matter where I’m at, the Earth is my turf\nRun on niggas like they AstroTurf\n‘Where am I? What happened?’ is what you ask your nurse\nSee, I’m blastin’ first, after that, we can talk\n1-87s, 2-11s, assaults\nNever let ‘em see me sweat, never show my faults\nI’m strict and I stick to the script I was taught\nEverything I ever bought was all on her\nEverything I ever want is all on her\nI’m so fly, your guy, the one you elected\nAnd them goons bow down, they gots to respect\nI’m the one you selected,  but not what you expected\nI’m game-infected and I bring it hectic\nDone broke a gang of records, I’m a Hall of Famer\nI’m the hardest artist like Picasso the painter", "year": "2004-10-19", "album": "The Game is Thick Part 2", "title": "4 Much"}], "artist": "Mac Dre"}