{"songs": [{"album": "E.B.A.H.", "image": "https://images.genius.com/ecaf59e8351d366bc86005cc66afe532.800x800x1.jpg", "year": "2012-09-18", "title": "Boy Toy", "lyrics": "[Intro]\nTech: Yo, Krizz\nKrizz: Hm?\nTech: I really knocked the boots on those two big-butt females last night\nKrizz: Yeeesh!\nTech: Yeah, man. I'm on my way to Westport to find two more freaks\nKrizz: Woooooord\n\n[Sample & Hook]\nI already played with your friends, honey\nNow I wanna play with you\nI already played with your friends, honey\nNow I wanna play with you\n(Sample continues)\nBoy toy\nBoy, boy, boy toy\nBoy toy\nBoy, boy, boy toy\n\n[Verse 1]\nI should not be one you take to Mom\nUnless your mom's buttocks, tits, face, the bomb\nI don’t wanna know if you have some Grey Poupon\nJust great punan and a leg coupon\nI’m excited for you to find me invited\nI’ll get your hiney ignited\nI’ll get you slimy and slide it inside\nI might even bite it, can get mighty and violent\nBaby why even fight it you and your girl Heidi's invited\nTo come right over in your PJ’s\nToday with your B.F. was not easy\nSo you’re telling your girls the game we play\nCalled \"I’m in love with your VJ\"\nSign me up to get behind the butt\nAll you gotta have is TNA to wind me up\nAll creeds even laos beauties needing the coy coy\nAussie women - oi oi, they lovin' this boy toy\n\n[Sample & Hook]\nI already played with your friends, honey\nNow I wanna play with you\nI already played with your friends, honey\nNow I wanna play with you\n(Sample continues)\nBoy toy\nBoy, boy, boy toy\nBoy toy\nBoy, boy, boy toy\n\n[Verse 2]\nTurn me on I'mma let the black mamba loose\nReally sexy ladies meet my anaconda swoop\nWomen wonder who's got the long masseuse\nPop my stick in your mouth and it's as sweet as Jamba Juice\nReal hard it will barge into a lady's 'nani\nWill card teeny boppers that get the spill guard\nHills stars for women standing Amityville\nYard this fantasy now real time with Bill Maher\nTime is tickin', come find this dick and be mine for stickin\nI love it when I find she lickin' on me\nGrind and twitchin' design for pitchin'\nThe line for missin' I dug it I’ll be hind the thicket homie\nDon’t rate I’m horny and don’t hate\nOn any permanent situation - Yeah God, I don’t date\nBut I’m gon' mate and my power stay on late\nAnd the best thing about this boy toy is I don’t break\n\n[Sample & Hook]\nI already played with your friends, honey\nNow I wanna play with you\nI already played with your friends, honey\nNow I wanna play with you\n(Sample continues)\nBoy toy\nBoy, boy, boy toy\nBoy toy\nBoy, boy, boy toy\n\n[Verse 3]\nB-O-Y T-O-Y\nMe so fly, wanna play with me?\nShe know why she’s gon' buy\nThe boned guy - ’cuz I display the D\nIf nothing else, I'm good for your fuckin' health\nYou’re looking for love and help and sick of just rubbin' self\nI got you, I don’t fake with this boy toy shit\nIf you wanna play, just hit me up and kiss my joystick\n\n[Outro]\nGirl: Mhm, I love it!\nTech: You love what?\nGirl: That\nTech: What about me?"}], "artist": "Tech N9ne"}