{"artist": "YC", "songs": [{"image": "https://images.genius.com/ddb89bd2a59f0d1244043ad1427a532e.500x500x1.jpg", "year": null, "album": "Amber Kush Mixtape", "lyrics": "[Intro: YC]\n(YC!) Whatchu got? Racks on racks on racks\n(He got) racks on racks on racks, (we got) racks on racks on raaacks (Leh'go!)\nAyy! I got, racks on racks on racks\n(She got) racks on racks on racks, (they got) racks on racks on racks\n\n[Hook: YC]\nGot campaign goin' so strong, gettin' brain while I'm talkin on the phone\nSpend money when ya money gets long, real street nigga, ain't no clone\nWe at the top where we belong, sip lean, rosé, Patron\nSmokin on thousand dollar worth of strong, when the club 'bout to hear this soooong (Whatchu got?)\nWe got racks on racks on racks (racks), racks on racks on racks (racks)\nRacks on racks on racks (racks), got racks on racks on raaaaacks\nGot racks on racks on racks (racks), racks on racks on racks (racks)\nRacks on racks on racks (racks), nigga ain't even tryna hold baaaack\n\n[YC]\nGot a car lot in my garage, got a condo down in the stars\nI'm geaked up off them bars, got a car I don't even gotta park\nNo keys push button start, she ain't a dime I won't get hard\nGot hoes that need a green card, say I'm a dawg but I don't even gotta bark\nGot swag that bite like sharks, one hit I'mma knock it out the park\nTrap beatin' so goddamn hard, got kush, got lean, got barre\nGot remix hard as scale, got bricks don't need no scale\nI'm plugged in with the mail, I'm part of the cartel\nGot rerock ain't no cling, 6 two hundred for a nin\nThen fuck it all up on jeans, I'mma true religion fiend\nGot bands in the pockets of my jeans, need a kickstand way I lean\nPromethazine fiend, stamped on sprite and lean\n\n[Hook]\n\n[Wiz Khalifa]\nUh; racks on, racks off, see that blonde stripper, my hat's off\nLookin at my Rollie, 'bout thirty grand what that cost\nSmoke like I'm in Cali, fuck takin flight, I blast off\nNiggas talkin tattoos, we should have a tat-off\nGot racks on racks on racks... naps on naps on naps\nJust made a mil, count another mil, so put that on top of that\nWay back in 2004, I told 'em it was a wrap\nNow my life ain't my life no mo', I told you, nigga it's a wrap\nOOOH! you claim you a dog, my nig, I'm the vet\nWe cain't even talk 'less you cut the check - I guess that's why all of these niggas get bad\nThey said, \"Fuck a young nigga! Fuck a young nigga!\"\nI know it's some girls in the crowd right now who wanna fuck a young nigga - yeah!\nI roll one and roll another one bigger\nNiggas thinkin they sick, well, I'm sicker\nI'mma smoke, my weed and I’ma drink, my liquor\nBetter make, sure you fuck ya girl right 'fore I dick her, down\n\n[Hook]\n\n[YC]\nY'all know I keep them racks, I stay counting them stacks\nYa girl won't leave me lone, wanna fuck now she attaaaached\nFlow hot don't need no match, sell work don't pay no tax\nI'm turnt up to the max, don't even know how to relaaaax\nI drank so much that lean, had to wake up on a bean\nRacks all in my jeans, man bustin' out the seeeeams\nGot kush all in my lungs, get high like Cheech and Chong\n800 a zone I ain't blowin' unless it stroooong\nCatch hell on my iPhone, catch mine and then I'm gone\nThe girl won't leave, I can not take her hoooome\nI'm gone on them bars, bitch I'm not a star\nI'm driving foreign cars, strapped up no bodyguaaaards\n\n[Hook]\n\n[Outro: YC]\n(YC!) Racks on racks on racks\nRacks on racks on racks, racks on racks on raaacks\nRacks on racks on racks\nRacks on racks on racks, racks on racks on raaacks", "title": "Racks (Wiz Khailfa Remix)"}]}