{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "Come, come on\nCome on, come, come on\nMIB\nThe black suits comin'\nThe black suits comin'\nI'm comin', I'm comin' I'm comin', I'm comin'\nI am the man in black, I'm back\nBreaking the back of the random attackers\nSo can the flak, yo I'm dangerous\nI've been trained to bust\nWhen a stranger fuss try to endanger us\nPraise me y'all, don't nothin' faze me y'all\nWhen they see me their gaze be all crazy y'all\nThey say I'm a myth, trust me if somebody riff\nOut of the depth of your imagination appears Will Smith\nBlack suit, the black shades, the black shoes\nBlack tie with the black attitude\nNew style black Ray Bans, I'm stunnin' man\nNew hotness pitch black six hundred man\nDon't you understand?\nWhat you thought I wouldn't come again?\nLeave you hangin' without bringin' you the fun again\nTanglin' with the alien scum again\nMind your manners or the black suits runnin' in\nNod ya head\n(The black suits comin')\nLet me see you nod ya head, like this\n(The black suits comin')\nLet me see you nod ya head, like this\n(The black suits comin')\nLet me see you bop your head\nNod your head, come on\nNod ya head\n(The black suits comin')\nLet me see you nod ya head, like this\n(The black suits comin')\nLet me see you nod ya head, like this\n(The black suits comin')\nNod ya head\nCheck it, yo it's this chick right\nSerlena, makin' me sick right\nEarth is worthless to her she be trippin' like\nThreatenin' me and my mens, tryin' to get the light\nThinkin' she's Superwoman\nBut black Kryptonite finishin' whatever you start son\nThe best lookin' crime fighter since myself in part one\nBetter act right and play nice and sing along\n'Cuz K is back and he hype, what? Bring it on\nUhh, wanna brawl with me? Trying to brawl with me?\nUhh, uhh, what? What?\nYo, what? What? Then lemme see you just\nCome on, just come on and\nNod ya head, like this\n(The black suits comin')\nLet me see you nod ya head\n(The black suits comin')\nLet me see you nod ya head, like this\n(The black suits comin')\nLet me see you, nod ya head\nLet me see you, nod ya head\n(The black suits comin')\nLet me see you, nod ya head\nCome on, come on, let me see you\nNod ya head, like this\n(The black suits comin')\nLet me see you, nod ya head\nCheck it, check it, yo, case closed, erase my foes\nChased away by the black suits, shades, and clothes\nWe above the law, Feds can't touch me y'all\nHighly ranked black blank I.D. card, so disregard\nWhat you think you saw, put that phone down now\nWho you think you callin' huh?\nOne little flash then good night dear\nJust open your eyes honey look right here\nThank you mission completed, I mean it we won't be defeated\nYou seen it we did it even with weapons depleted\nGalaxy defenders don't act like you don't remember\nTakin' contenders and provin' they only pretenders\nLadies and gentlemen, boys and girls\nThe Men In Black is back to protect the world\nWhen the enemy is near the elite is here\nSo have no fear just let me see you\nNod Ya Head\n(The black suit's comin')\nCome on, nod ya head, like this\n(The black suit's comin')\nLet me see you, nod ya head, like this\n(The black suit's comin')\nLet me see you, nod ya head\n(MIB)\nNod ya head, woo\n(MIB)\nNod ya head, uhh\n(The black suit's comin')\nNod ya head\n(MIB)\nYo, yo, nod ya head\nYo, Yo\nIf you wanna rock then say\n(Ooh, oh)\nTell me if you wanna rock then say\nIf you wanna rock then say\n(Ooh, oh)\nCome on if you wanna rock then say\n(Ooh, oh)\nYo if you wanna bop then say\n(Ooh, oh)\nTell me if you wanna rock then say\n(Ooh, oh)\nIf you wanna nod then say\n(Ooh, oh)\nTell me if you wanna rock then say\n(Ooh, oh)\nHa\nNod ya head", "image": "https://images.genius.com/8624e4a6fdfb9b83008647b72d71bbee.371x371x1.jpg", "album": null, "title": "Black Suits Comin’"}]}