{"songs": [{"year": "2012-04-10", "image": "https://images.genius.com/bdb1ca23b418b0572caba92910aaa741.600x600x1.jpg", "title": "Freedman’s Bureau", "album": "History Will Absolve Me", "lyrics": "[Elucid]\n25k starting pay play the game\nMake a name for youself\nPut the blame on someone else\nOh he reached to resist\nEmpty clips and spent shells\nJust how many in defense it's all blurred\nAllegations waiting where's the autopsy\nToxicology labs they knocking\nIf it was one of your own I bet they'd have the city sewn the fuck up\nMuscle down the weakest link\nYou can't stop the bumrush\nTactics of a lesser god\nFeed the beast scan ur [sic] card\nCarbs in charge quota time mnumbers talk\nJeers and taunts fuck 'em all\nDamage control procedures right out the book\nBe honest for one\nYou shoot cause u [sic] shook\nDeath squads answer to who? Furtive movements make 'em nervous\nBet they grabbing their tool\nThat murder bloody murder\nWhich weasel u [sic] gonna hide behind?\nState appointed pervert the story it's all designed\nVulture time crooked dicks and deep pocket\nLifetime desk job offers with full coverage\nOne hand wash the other loyalty is a given\nWho you calling a victim?\nStay away from twice fried pork\n\n[Hook]\nEverybody wanna be a nigga\nNobody wanna be a nigga\nFurtive movements\nTrigger blast they got a right to\nAin't no telling what they might do\n\n[billy]\nThey wanna know if you live what you say\nBut talk is cheap and I'm in the dollar store erry day\nI've half a mind to rob the place\nClean getaway to stalk streets with a pocketful of bad pennies\nJuvenile Techniques\nDouble Vinyl, paint train Lionel\nMind you, the last time shit went down we couldn't find you\nSo, revolution? Color me skeptical like swine flew\nCrackers still win when they lose, like Rocky\n88, King Jaffe, 7th grade, Coming To America, slightly out of touch\nI wasn't black enough the back of the cheese bus\nSwiftly dumbed it down, started acting up (you see where that got me!)\nThey dark as Chris Tucker calling me a spear chucker\nKid, they really mindfucked ya\nBut make no mistake, I'm Quinn Buckner\nBlack on Black\nMatter fact errybody in the hood Benjamin Button\nIt's just black don't crack\nErry corner Babylon strapped with gats, more plastic than Chinese export\nAnd it's looking like we caught\nTill he use the force\nThere are not the negroes you're looking for\nWhether synth or beatbox, heat rocks like pipe dreaming in detox\nNow all I need is a tape fulla disposable cheap shots\nTo get the moniker buzzing like doors to 90s weed spots\nSuper Cat cousin, I'll play the fiddle while ya ghetto red hot\n\n[Hook 2x]\n\n[Note: I'm pulling directly from the album sleeve lyric book. I'm not sure why Elucid's verses use \"u\" and \"ur\" but I figured I'd stick true to what he wrote]"}], "artist": "​billy woods"}