{"songs": [{"title": "I Don’t Think They Want It", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "I Don’t Think They Want It\nI-I Dont think they want it\nI Don’t Think They Want It\nI-I Dont think they want it\nSoon as I walk in all the bad bitches on it\n\nI saw you perform yeah, you put on a light show\nI walk up in this bitch looking like a light show\nGot a team but I’m by myself ISO\nKilling shit lights on, lights on, lights off\nOn my job bitch, no nights off\nAnd on my nights off, it still might cost\n\nI Don’t Think They Want It\nI-I Dont think they want it\nYour girls on my dick and she trying to sit up on it\nShe hopped on my lap even took a pick up on it\nAnd I passed her to my niggas cause I don’t really want it\n\nI Don’t Think They Want It\nI-I Dont think they want it\nBrand new whip but I push it like it’s stolen\n7-11 a nigga keep rollin’\nI’m headed to the top bitch and I dont think you going\nAnd how my checks look, stupid as hell\nSo tell me how my ex look, stupid as hell\n\nI Don’t Think They Want It\nI-I Dont think they want it\nI Don’t Think They Want It\nI-I Dont think they want it\n\nAy, now every time I stepped in\nYou could tell I stepped out\nI saw your girlfriend only from the chest down\nI’m so dressed up but I pull her dress down\nBy the time she wake up, I’m in the next town\n\nI Don’t Think They Want It\nI-I Dont think they want it\nI met your main bitch and I put my niggas on it\nAnd she bust it wide open, hotel picture phoning\nSend it all around the World so I don’t even want it\n2,3 I’m in my zone bitch\nWhere’s the competition?\nI need a clone bitch\n\nI Don’t Think They Want It\nI-I Dont think they want it\nAnd I run GOOD music nigga Usain Bolt’n\nGetting music so the drinks the only thing thats pouring\nDamn thats what I like and it feel good\nAnd it look right, tell her keep going\n\nI Don’t Think They Want It\nI-I Dont think they want it\nI Don’t Think They Want It\nI-I Dont think they want it\n\nWhat you got? nothing!\nWhat I got? everything!\nYou was straight gassin, I put that on kerosine\nI just give her dick dog, you give her a wedding ring\nYou need her at the alter now that is just embarassing\nLet em talk shit though, go ahead, carry on\nI just walk up in this bitch higher than a carry on\nFlyer than a carry on, sipping on Pérignon\nGripping on derriere, gripping off Derrion\nSomebody show these weak niggas where the exit is\nCause they always trying to be where my section is\nAy for real though, the number one question is:\nWhy is your girlfriend always where the sexing is?\n\nI Don’t Think They Want It\nI-I Dont think they want it\nI Don’t Think They Want It\nI-I Dont think they want it"}], "artist": "Big Sean"}