{"songs": [{"year": "2018-04-05", "title": "BROKEN GIRLS", "image": "https://images.genius.com/c9d9eb7cb4997367a0e3e83a79a34489.919x919x1.png", "lyrics": "[Intro]\nI'm in love with broken\n\n[Chorus: Saba]\nI'm in love with broken girls, girls, girls\nHey girl, girl, girl, girl\nI'm in love with broken girls, girls, girls\nGirls, girls, girls, hey girl\n\n[Verse 1: Saba]\nReally I'm broke myself, and I think she might help\nReally I love a story, and I think she might tell\nReally I'm not your crutch, really you're not my girl\nReally she usin' me, but it's cool, we use each other\nI'm in love with contemplatin' 'bout the pressure\nConversations 'bout depression\nConfrontation cause we care too much about each other\nWe know it ain't permanent but temporary\nReleasin' your Issa Rae, insecure\nCollect them like Pikachu, Venusaur\nWe go 'til you done or my penis sore\nSleep with the TV on then we don't speak no more\nAnd I know when I'm with you, or maybe when you're with me\nEven if I don't feel a thing, for a second I feel complete\nI still'll keep in my back pocket\nI know that I'm not shit, I know that it's toxic\nI know that apocalypse, that was where your heart is\n\n[Chorus: Saba]\nI'm in love with broken girls, girls, girls\nHey girl, girl, girl, girl\nI'm in love with broken girls, girls, girls\nGirls, girls, girls, hey girl\n\n[Verse 2: Saba]\nTread light like broken glass, really I'm not my past\nReally I snatched her soul, really that's not to brag\nReally when I'm alone, really I'm not that happy\nReally I know you're empty but I think I can fill your glass\nFetishizing all your problems\nI wanted you more since I found out you heartless\nHarborin' feelins' for niggas who hurt you\nKnow you on the surface but not on a personal level\nI play the game of hearts, missin' piece, we ain't a part\nDepend on me until I'm bored\nI return your heart as quick I return your call\nTables turn quicker cause after a weekend I miss ya\nI don't want you but I'm conflicted\nI know that back and forth yo-yo shit over with\nBut you gon' take me back, I'm gon' convince ya\nPain ain't never looked so temptin'\nLonely never looked so distant, we just gon' ignore the tension\nYou know we both not shit, I know that shit toxic\n\n[Chorus: Saba]\nI'm in love with broken girls, girls, girls\nHey girl, girl, girl, girl\nI'm in love with broken girls, girls, girls\nGirls, girls, girls, hey girl\n\n[Bridge: Saba]\nThis whole time, been obsessed, being sad\nShe was my, quick escape, made me forget\nHear her speak, see her weep, made me feel big\nCry on me, she down me, treat me like shit\nSecond time, round two, what I learned\nShe wasn't mine, that wasn't love, I wasn't hers\nI'm not hurt, anymore, took some time\nFound a girl, now I'm hers, and she mine\nAnd she make me, feel whole, heal me\nAnd it's, mutual, and we still in love\n\n\n[Part II: Care For]\n\n[Outro: Daoud]\nCan't you care for (me, no)\nCan't you care? Can't you care?\nCan't you care for? (me, no)\nCan't you care? Can't you care? (me, no)\nCan't you care? Can't you care? (me, no)\nCan't you care? Can't you care? (me, no)\nCan't you care? Can't you care? (me, no)\nCan't you care? Can't you care?", "album": "CARE FOR ME"}], "artist": "Saba"}