{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "Fly Away", "album": "Birdman", "lyrics": "[Baby]\nHey\nWassup pimp?\nBirdman motha fucker!\n\n[Baby] + (TQ)\nThe financial adviser of this get money game\nIt's stunna the big money man\nSo loosen up your strings cause you can get shot\nThe Crystal absolute on the rocks (on the rocks)\nEy nigga I gotta stay fly money\nNo baseball player I got the a-ride money\nI go to Jamaica homie and ball like a dog (ball like a dog)\nThe leaf that sticky homie and fog up the car (fog up the car)\nIt's nothing to the icky icky Harlem world sticky sticky\nFifty fifty a gram raw cut dilly\nGot minks on my body cause it cost too much (cost too much)\n250 on the bird had to frost me up\nSee these gangstas pimps and thugs make the world go round (gangstas, pimps and thugs)\nRide for uptown and till they lay you down\nBirdman with them big chips with the bird lady and the benzes (benzes)\n\n[Hook: TQ]\nIt's the fly away\nFly fly away\nOr you can hit the highway\nThat's the only way that we do it\nLove when we do it\nFly away, fly away\nFly away, fly away\nCause we gon get you high today\nI know you wanna see how we do it\nYou know how we do it\nFly away, fly away\n\n[Baby] + (TQ)\nSo get your stock up nigga\nGet our brains rapped right\nThe hood fucked up cause the nigga changed like\nThe birdman daddy keeps the bricks taped tight\nA hundred of them things got my chips same night\nPull up in the Bentley with them skinny ass tires\nIce all over cause a nigga so fly (so fly)\n? and I'm doing what I'm doing\nIf them clubs gone pop I'm getting straight to em\nNothing on chain put them dubs on the thangs\nWipe a nigga down bitch give a nigga brains (wipe a nigga down bitch give a nigga brains)\nCall a nigga changed ma wash a nigga range\nBird baby down with them cardier frames\nGucci from head to toe and stunna my name\nMake winter weather and that's my thang\nI'm iced up nigga smoke pounds of dro\nAnd I'm labeled as a pimp and I mack a ho\nBiatch!\n\n[Hook: TQ]\nIt's the fly away\nFly fly away\nIt's the fly away\nOr you can hit the highway\nThat's the only way that we do it\nLove when we do it\nFly away, fly away\nFly away, fly away\nCause we gon get you high today\nI know you wanna see how we do it\nYou know how we do it\n\n[Baby] + (TQ)\nIt's the world wide callin' and the boss of the ballin'\nThe hood rich nigga money tall as all\nThe youngers of 20 cheerin' and nobody starvin'\nNobody borrowin' cause nobody starvin'\nEy ey TQueezy! the dro man callin'\nGet it in the jar Jeff pense is callin'\nBuy ounce, buy pound, buy enough for the rounds by mouth\nCause ya know how it's going down\nDro party with the magnolia chicks\nSmoke just fly nobody givin' lips\nThey all on the floor cause the brains is flying\nOn the outside it's just them 20 inch tyres\nBentley, lexus, lams & vets\nThem ragtop guccis with the smitt n wess\nGot the old school caddie's and them new school too\nPlatinum mouth niggas and them gold mouth too\nBiatch!\n\n[Hook: TQ]\nIt's the fly away\nFly fly away\nIt's the fly away\nOr you can hit the highway\nThat's the only way that we do it\nLove when we do it\nFly away, fly away\nFly away, fly away\nCause we gon get you high today\nI know you wanna see how we do it\nYou know how we do it\nFly away, fly away\n\n[Voice]\nThe birdman bitch\nComing to a city near you\nNow how you luv that nigga\nNow I know what this is\nYou know what you need to do?\nYou need to look on the back of your cd cover\nAnd get that sticker for the mom burberry g-nites\nYou want to come pick them up? come pick them up on 6 and magnolia\nAnd holla at ya boy c-ya?\nYou understand?\nAnd we gon holla at ya another time\nHolla! biatch!"}], "artist": "Birdman"}