{"artist": "G-Eazy", "songs": [{"title": "Let me Work", "album": "Rapture (Netflix Original TV Series)", "year": "2018-05-18", "image": "https://images.genius.com/34fd2366b8d3b1ae4876436f069c58d3.1000x1000x1.jpg", "lyrics": "[Intro: G-Eazy]\nLet me roll up my sleeves and go to work\nBeautiful and Damned (Just Blaze)\n\n[Verse 1: G-Eazy]\nIt’s that motherfucking time again\nTell my diary what’s on my mind again\nJust play a beat, I'ma crack an ice cold Heineken\nThe studio that Pac got shot in, currently I’m rhyming in\nIf you told my younger self that this the place you find me in\nI would not believe you, these results are so astonishing\nDemons chasing me, I ran from Lucifer Leviathan\nThe beautiful and damned, I got a fetish for the finer things\nThat’s a quarter million on some tires that I’m driving in\nPull up the McLaren like that's just some shit to travel in\nRussell Westbrook triple-double averaging\nMost improved player, they don’t know what the fuck is happenin’\nThe homies like \"You're snappin’\"\nMy mood's Olympic champion throwin’ a fuckin’ javelin\nEpisode 3 Anakin\nMy favorite rapper’s Gerald, I’m a very big fan of him\nYou won’t get nowhere stalling and you standing like a mannequin\nWhy the fuck you panickin’? I understand the task at hand\n\n[Chorus]\nLet me work\nWhat do you know about work?\nLet me work\nI'm talkin' about getting up five days a week, brushing ya teeth, washing your ass, going into your office and working some old guy rich paid hours\nLet me roll up my sleeves and go to work\nThat's a motherfucking job\n\n[Verse 2: G-Eazy]\nIt's still that muthafuckin' time again\nBlacking out, don’t give a fuck about a thing\nFuck the world that’s just the state of mind I’m in\nThat’s the place you find me in\nLook, ain’t nobody live as him\nMillion dollar smile that I just went and put some diamonds in (yeah)\nThese rappers sneak diss when I came up, they prolly mad I’m on\nBut then they transformed and changed up like a Decepticon\nBunch of bootleg Geralds copying what I went platinum on\nBut the real, it's me myself and I, you all be dead and gone\nDisrespect me, don’t come to the bay, your pass is gone\nMy Obi-Wan is E-4-0, he givin' game, I pass it on\nStudy him 'cause he the one that lasted long\nThis beat I go assassin on\nI just took some acid, hit the booth, and started rapping strong\nTreat the studio like a decathlon\nNever slowing down, I'm tryna put my whole damn family on\nWork every night, I go 'til after dawn\nTo be the biggest thing in the world, I’m not the one to pass up on\n\n[Chorus]\nLet me work\nLook, you could be a fuckin' bank teller, you could be a waitress\nLet me work\nOr wash cars, sell clothes at a fucking boutique. Alright listen, you're makin' somebody else rich. You're punching that clock. You clock in, you clock out, you making that money\nLet me roll up my sleeves and go to work\nHow does that work?\n\n[Verse 3: G-Eazy]\nA fucking hater's always looking, tryna search for targets\nIf you don’t know me, don’t speak on me, stick to your departments\nWhile they debate if I’m an urban artist\nOr if I’m merging markets\nAll I really know, I’m just working hardest\nAnd 'til the day I die, I’m hustlin’, doing work regardless\nI’m in my twenties, if I go I leave a perfect carcass\nA polarizing artist\nBut you could love or hate me\nBut try and say I don’t pay my dues, fuck off, how dumb could they be\nNobody help to make me\nI did it by my lonely\nWho else did songs with everybody Britney Spears to Mozzy?\nYou New York Times aristocrats you should just relax\nYou miss the facts\nBitch, I’m from the Bay, was born to bridge the gaps\nAnd I’m a legend in my city, they say \"His shit slaps\"\nSaid I'ma go and sell a million, I'ma get these plaques\nAnd bring 'em back to inspire every kid who raps\nI’m Michael Phelps, get out my lane, I’m swimming different laps\n\n[Outro]\nYeah\nLet me work\nLet me roll up my sleeves and go to work"}]}