{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro: Beanie Sigel]\nUhh.. yeah\nUhh, what, what, uhh\nB.I.G. rest in peace, baby bay be\nUhh, uh huh, what\nUh huh, uhh, uhh, uh\n(REST IN PEACE, B.I.G.)\n\n[Verse 1: Beanie Sigel]\nI said a lime to a lemon, my Philly women\nLiving large off credit cards, charging and checking\nTapping niggas debits, you gotta respect it\nBitches true to the game, now be more careful, check it\nWhat you expecting?\nTime is money and I'm counting every second\nYou get mines or get naked\nCheck my track record, it be stretching\nLonger than Jackie-Joyner going for the gold necklace\nI'm dog nice, and I ball right\nPush the Hummer for the summer, chrome kit with the fog lights\nYou talk shit, grip the four long tight\nAnd quick to give you twenty like Kobe on a off night (what)\nI can get you soft or that hard white\nGet yours delivered on bikes\nMy niggas answer doors all night, go to war on sight\nHustle in velours and Air Force Nikes\nHoodies, fatigues, tan trees on tight\nPounds of that green, niggas breathe all night\nGallons of Promethazine be on lean all night\nNiggas be calling lean all nights\nHow can niggas stand up on what I dump just to get mellow?\nA dozen of Xannies, Percs (?) and yellow\nTook niggas chains gassed up on Carmello\nRookie of the year, king James, nigga HELLO\nB. Sig the veteran, now I'm 20 steps ahead of 'em\nStill play the Late Night like Letterman\nStill Con you like Edison, yes\nIt's the Mac with the craft that'll bring the cheddar in, uhh\n\n[Chorus: Nicole Wray]\nYou can't stop the reign, you can't stop the reign, no\nWhen it starts to pour (when it starts to pour)\nNo one else to blame (no one else to blame)\nYou can't lock the door (you can't lock the door)\n\n[Verse 2: Beanie Sigel]\nUhh, uhh, uhh, uhh...\nB. Sige'll kill ya for 'bout million dollar figures\nSilencers and beams on the triggers\nYoung niggas is shooting, but I do my duty\nStrictly on the dolo, shells on the scene is a no no\nForensic team taking photos\nIRS tryin to take my show dough, can't tax me, uhh\nAdamant efforts to attach me\nTo the hustle, Feds in the mix of the scuffle (what)\nBefore I plead out, I white knuckle\nWitnesses take the stand and buckle, shake like\nPolaroid pictures with my soldiers come and get ya\nKick in the door, waving the chrome four\nBitches wanna screw me, niggas wanna shoot me\nD.A. try and prosecute me\nLose me in the system, stuck in prison with male groupies\nVisits, commissary slips, cartons of loosies, uhh\n\n[Chorus: Nicole Wray]\nYou can't stop the reign, you can't stop the reign, no\nWhen it starts to pour (when it starts to pour)\nNo one else to blame (no one else to blame)\nYou can't lock the door (you can't lock the door)", "image": "https://images.genius.com/cea88e2a4994d399a7c1a4edff03cb96.600x600x1.jpg", "year": null, "title": "Can’t Stop The Reign", "album": "Public Enemy #1"}]}