{"artist": "Ace Hood", "songs": [{"title": "Pain", "album": null, "year": "2014-12-05", "lyrics": "[Verse 1]\nMichael was shot in the street\nMurdered by fuckin' police\nSisters, the brothers, the fathers, the mothers\nThe streets are beginnin' to weep\nInnocent brothers who covered in color\nIt seem like we die every week\nFuck it, I'm Malcolm X\nMy people in critical need of a speech\nShould I be worried?\nShould I be worried to walk out the door?\nPlease do not shoot me\nPlease do not shoot me, I'm goin' to the store\nMy mama be worried\nShe just expectin' for me to come home\nThe world is crazy\nThe reason my daughter gets schoolin' at home\nFather forgive me, you know I be sinnin'\nI woke up this mornin', I'm panickin'\nStill can't believe it\nThat Robin Williams, the suicide death was so troubling\nPeople are dyin'\nCity of Ferguson started a riot\nShoot up another\nThey just want people afraid of the siren\n\n[Interlude]\nA local 18 year old was shot and killed by police in Ferguson\n\n[Hook]\nMy city in pain, my niggas in pain, the world is in pain\nHow much more pain do we gotta contain?\nHow much more pain do we gotta contain?\nI pray that one day all this shit gonna change\nMy city in pain, my niggas in pain, the world is in pain\nHow much more pain do we gotta contain?\nHow much more pain do we gotta contain?\n\n[Verse 2]\nFuck is still wrong with America?\nObama got us hysterical\nWe gon' need God, we gon' need savin'\nI think we need us a miracle\nThey say the plane never made it\nWhy can't nobody explain it?\nMeanin' to tell me that all of them people are missing?\nIt's fuckin' outrageous\nHow many soldiers gon' die again?\nPeople so filled up with violence\nTakin' our lives and it's done by the ISIS\nThey kill us to send us the messages\n\n[Interlude]\nSo any attempt by you, Obama, will result in the bloodshed of your people\n\n[Verse 3]\nFuck 'em, we never love 'em\nInnocent babies are taken from mothers\nWe are in trouble and life is a struggle\nSee we need some guidance, we turn to each other\nLord, don't get it twisted\nBrenda, she can't find her lil' baby\nShe's 17\nWhat the fuck are you gon' do with a baby?\nThese niggas crazy\nChallenges burnin' theirself on the daily\nFuck your complainin'\nI seen the look on them babies in Haiti\n\n[Hook]\n\n[Interlude]\nYou took my son away from me. You know how hard it was to get him to stay in school and graduate? You know how many black men graduate? Not many, because you bring them down to this type of level where they feel like they don't got nothin' to live for anyway, they gon' try to take me out anyway\n\n[Hook]", "image": "https://images.rapgenius.com/b07c5206aa629bd222c7a6b6e82e07d8.500x500x1.jpg"}]}