{"songs": [{"year": "2005-01-01", "title": "I Know", "image": "https://images.genius.com/9c2849cfac5218c726612b73adab589c.300x300x1.jpg", "lyrics": "Saigon - “I Know”\n[Emcee(s): Saigon]\n[Producer(s): Sha Money XL]\n[Sample (Melody): Nelson Ned - “Jurame”]\n\n[Hook: Saigon]\nI know, I know, I know, I know (I know)\nLife got much more to offer me\nAnd I know, I know, I know, I know (I know)\nThe system treats us unlawfully\nAnd I know, I know, I know, I know (I know)\nThat a new day is yet to\nCome, and I know (And I know) that\nI’ll be right here with the nation\n\n[Verse 1: Saigon]\nWe live in a\nPlace where babies are born addicted to base\nIf you get arrested, you’re likely to get kicked in your face\nA lot of bitches is sick with the “H.”  If you don’t want the\n“I.V.,” think before you put your dick in her waist\nIt’s a disgrace.  There’s only one particular race\nThat got fucked ever since we got shipped to the States\nLike being trapped in a pit full of snakes.  They’re calling the coke\nDandruff—the ghetto been infected with flakes\nI listen to rap but wouldn’t let my kid listen to that\n‘Cause if my kid listen to that, then it’s a wrap\nNiggas replace wisdom with materialism\nI use the rhythm to preach about imperialism\nI get on it like Martin Luther King and do the damn thing\nFar as snitching go, I’m like J-Lo—I can’t sing\nBut I’ll eat you like a planet wing.  Let’s pop\nA cop and then pop some champagne, then listen\nHear you sing\n\n[Hook: Saigon]\nI know, I know, I know, I know (I know)\nLife got much more to offer me\nAnd I know, I know, I know, I know (I know)\nThe system treats us unlawfully\nAnd I know, I know, I know, I know (I know)\nThat a new day is yet to\nCome, and I know (And I know) that\nI’ll be right here with the nation\n\n[Verse 2: Saigon]\nThey got\nDrugs of all sorts coming through their airports\nOnly once every five years somebody get caught.  How many\nLives must heroin cut short?  How many black folk\nGotta grow up to smoke, shoot, sniff, or snort? (Damn...)\nWe’re no longer serving them dimes to maneuver through turbulent\nTimes, me and my niggas murdering rhymes, my life\nRead like a verse in the psalms, so it’s in the Quran\nWord, bond, y’all gon’ worship the ‘Gon.  Con-\n-vict since a young age, face plastered on the front page\nPicture me working for minimum wage.  I went in\nA rage, packed the MAC-10 and the gauge.  In\nThe streets, I seen more action than Nicholas Cage\nBuck one for my niggas locked for using a gun\nBuck two, hit them niggas that bucked Rule—fuck you!\nBuck three for Lucky, buck four for all my dawgs\nUp north.  Let’s get this jump off jumped off\n\n[Hook: Saigon]\nI know, I know, I know, I know (I know)\nLife got much more to offer me\nAnd I know, I know, I know, I know (I know)\nThe system treats us unlawfully\nAnd I know, I know, I know, I know (I know)\nThat a new day is yet to\nCome, and I know (And I know) that\nI’ll be right here with the nation\n\n[Outro: Saigon]\nWhat you know though?  What you know?  What you know?  Uh.  Yeah.  Salute, all-mighty Abandoned Nation.  Everybody in jail, get your education.  Yeah, yeah.  Teamwork music.  Uh, Sha Money XL, Saigon.  We’re back.  Yeah, yeah, teamwork, A.B.  Yo, let that, let that fade out real quick, man.  Yo, I need you to take me back to the 80’s, man.  Give me something that I can dance to, man.  On some 80’s shit, Saigitty", "album": "Swizz Beatz Presentz: Abandoned Tracks Vol. 1"}], "artist": "Saigon"}