{"artist": "IDK", "songs": [{"title": "Lil Arrogant", "lyrics": "[Verse 1: IDK]\nThis is what you all been waitin' for, ain't it?\nWhat people paid paper for, dammit\nThis that goin' to the gun range with the click-clack-pow aiming\nThat boy from PG but D.C. still claim him\nAnd I ain't gotta act like I'm from there, I'm real\nSome rappers magicians, they trick you, they Copperfield\nAct tough as a gold medal, you link 'em, they daffodil\nMeanwhile, I'm just runnin' back kick returns on the field\nWhere the Redskins be losin' but we gon' support 'em still\nThat's how you know where our loyalty at\nSo place a bet against me, where your royalties at?\nI bet I leave your ass streamed of your 14 percent\nThen fuck on your bitch, my dick named Mutombo, I'm lit\nI rub on her clit, she drip, then I cum on her tits\nHow common is this to spit like a fuckin' attempt?\nI'm murderin' shit, I flip, then I leave your ass flipped\nI flip the script, then skip to your fuckin' event\nI take the check and dip, moments later it's spent\nYou take the check and shit, it's enough for your 'rents\nSo how the fuck you telling me that I ain't good enough, prick?\nAhhh, I think that I'm top ten, top five\nTop three, top two, top one, and I'm still not done\nTrump supporters' daughters love me, so I still think we won\nShe on her knees for that black thing, no Kaepernick, I copped the neck\n\n[Verse 2: Joey Bada$$]\nYo, yo, yo, Badmon! Uhh\nHere's what you been waitin' for, ain't it?\nIt's a portrait if you can see the picture, paint it\nI ain't got to explain it, this lane, I done paved it (right)\nI done paid my dues now I'm just collectin' payments (collect)\nOne verse, that's gon' be your whole life savings\nIf I was you, I'd be makin' funeral arrangements (true)\nThese bars, I could leave your mind in enslavement (what else?)\nHit you with the bar that I'm raisin', I come in, gun blazin' (facts)\nWe gon' see who get the last laugh (hah)\nIt's funny 'cause these niggas always trippin' off the past (hah)\nThink this shit a joke until somebody get smoked\nChoked, off the very words that they spoke\nListen here though, it's gettin' near close\n'Bout to blow your brains through your fuckin' earlobes\nThis one, the kid been gon' for a while, they missed him\nPatient with the shot, when we blast off, won't miss him\n\n[Verse 3: Russ]\n(Somebody gon' die tonight)\nRappers see me but don't say shit like they don't have vocals\nAnd they be dissin' on the socials like they don't have Pro-Tools\nThey big you up until you're big enough\nI guess the love was never real as if I really give a fuck\nI'm already eight figures up\nY'all are in the minors still, I'm Willie Mays\nY'all still jumpin' out of bed for 50K\nI roll back over and continue fuckin' all y'all's favorite\nI'm the greatest, I'm not stoppin' until all y'all say it\nI'm courtside, closin' multi-million dollar deals\nThen we celebrate it, eat Italian, thousand dollar meals\nI'm in Lake Como, you stay in NoHo, the hate is promo\nI play solo, women take photos, ride me like they play Polo\nMy crew solid, new problems, my day ones deserve two commas\nA few dollars moves nada, we still act the same, you not a—\nPart of the formula that put me here, so fuck you\nWhen the second album drops, watch who they all run to\n(Haha)", "image": "https://images.genius.com/ee8516cf69a7c0cc736ff239f4d09092.1000x1000x1.jpg", "album": null, "year": "2018-03-30"}]}