{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "One Hundred", "album": "Perception", "year": "2017-10-06", "lyrics": "[Intro]\nYeah\nHey, I'm on a hundred right now\nYeah\n\n[Verse 1]\nThey say the flow is soundin' like a mixtape\nThey ain't see it comin' like a fast break\nThey ain't see it comin' like Jordan hittin' jumpers, yeah, they ask me\n\"When that new music 'bout to drop?\"\nAin't that what I gave you last week? (Last week!)\nYeah, oh, you done it now\nFeels like I'm comin' up, but spit it like I'm underground\nWonder how I come into your city like I run the town\nLove the sound\nStarted on the stage, now we in the crowd, woo!\nYeah, what's with the hype though?\nTold me that your record was the greatest, but you lied, though\nTold me they consider you a god, yeah, well I don't\nSay you never lived until you found something to die for, woo!\nYeah, and that is so true\nForget the haters, remember people you're close to\nNow I'm doing things they told me I ain't supposed to\nThey treat me like a player, that's funny, I'm here to coach you! (Coach you!)\nGo back to the bench, know where you belong\nSay that you've been practicin', well maybe you should do it more\nSay that you the boss, yeah? Well, who did you employ?\nAll these sucky rappers—I don't listen to, I'm so annoyed!\n\n[Chorus]\nI'm on a hundred!\nYeah, I said I'm on a hundred right now, hey!\nWe on a hundred!\nYeah, I said we on a hundred right now, oh!\nI'm on a hundred!\nYeah, I said I'm on a hundred right now, hey!\nWe on a hundred!\nYeah, I said we on a hundred right now, oh!\n\n[Verse 2]\nYeah, you shoulda left this on a high note\nDifferent cities, different time zones\nYou had me open up for your tour\nI leave it lookin' like it's my show\nThe fans beggin' for the encore, woo!\nYeah, and what you know about\nSelling merchandise right out your house?\nI got 40 boxes in my living room on the couch\nYeah, me and my girl 'bout to ship them out, oh lord!\nYeah, yeah, I thought I told 'em last record\nI'm out here grindin' on a mad level\nAlways on a hundred, they don't understand the mad hustle\nNah, but that's what happens when the fans love you, I know!\nYeah, I ain't the norm, but I like it though\n'Bout to move the family out to Nashville\nI'm sleepin' on the floor, got no curtains in the bedroom\nHang up the sheets, yeah, that's the way that I roll!\nYeah, they think the money 'bout to change me\nThat type of talkin' got me angry, yeah\nA lot of people tryna play me\nMe and the fan base lookin' like the A-Team, woo\nHow you tellin' people that we family?\nHold up\nYeah, when you ain't even met me\nThat's the type of thing that may upset me\nThat's the type of thing that may upset me\n\n[Chorus]\nI'm on a hundred! (Hundred)\nYeah, I said I'm on a hundred right now, hey!\nWe on a hundred! (On a hundred!)\nYeah, I said we on a hundred right now, oh!\nI'm on a hundred!\nYeah, I said I'm on a hundred right now, hey! (Woo!)\nWe on a hundred!\nYeah, I said we on a hundred right now, oh!\nI'm on a hundred!\nYeah, I said I'm on a hundred right now, hey! (Woo!)\nWe on a hundred!\nYeah, I said we on a hundred right now, oh!\n\n[Outro]\nWe on a—we on a hundred right now!\nBoy!\nAgh!"}], "artist": "NF"}