{"songs": [{"lyrics": "[Verse One]\nThe first thing I wanna say is that I'm open\nI listen to anyone in the world, any time, any place, any moment\nMy nature is the lone wolf, I travel in a pack of one\nI'm Acey de uno, you know, from the Sun's son\nWhen I landed, our planet, my standard on the drum\nLeft handed, right handed\nI was abandoned like scum\nThat's when I learned my little time test\n(Time test)\nHow much time would it take to get my mind to the best\n(Time test)\nI hope you brought your rhyme vest\n(Time test)\nYou'll be put in the woods beneath the pine crest\n(Time test)\nNow I don't wanna do you no harm\nI'm just a head and some legs and a couple of arms\nAnd I'm a skeleton covered up with skin\nBut it's more complex than that see\nI'm a man who rocks the whole jam\nI live in a ten by ten room over there on the sun\nSpending my summers on Earth, heating up the bass drum\nAcoustic, boosted\nMechanical stereo, audio tomb\nWith the tables and the mic\nReact a fool\n\n[Hook]\nNever let nobody get you down\nNever let nobody turn you out\nNever let nobody open they mouth and tell you what you all about\nNow I got a lot to learn in life just like every single one of us\nBut none of us got the right to say some of us are odd\nUnless they name is God\n\n[Verse Two]\nNow I am a musician, but I used to be a magician\nI went to magician school I paid my tuition\nI found musicians make more than magicians\nNow what a position\nOur mission?\nOnly to find the real definition\nNow listen\nIf I could take the world and put it inside my head\nI would, no kidding\nJust due to the fact that I'm good\nWell I'm a little good, I'm average\nWell I'm alright, at least I ain't shy or bashful\nI rock a party all night\nYeah, I'm silly\nWanna bet?\nBet on, bet I led off\nBet off\nWanna let me just proceed to take your head off\nGet off\nYou're off on your own and you're off\nThe set\nWanna bet?\nWe ain't really started jamming yet\nOr frying in a pan just like a salmon croquette\nYou know I ain't really silly hill billy willy, I'm a vet\nIn this game\nAnd I got your brain as a pet\nYou're wet and washed up and despicable\nUpset, tossed up and pitiful, yet\nI don't wanna hear ya say shit\n\n[Hook]\n\n[Verse Three]\nNow check it out\nSomebody jot this down\nWord got around that you'se a loser\nZero, zilch\nUnadulterated filth flaren filth\nOh you're a nobody\nYou wanna be somebody\nAnd you'll prolly sell your soul\nGood golly almighty\nSmile boy\nThat's the least that you can do\nAnd who you are is a mystery\nAnd you got the devil spooking you\nNow who can you trust?\nWhen everybody else is kicking up dust\nThus is another saga\nA paperback book type novel\nYou're a good guy? Bravo\nWell three strikes and you're outta there\nYou might as well be floating in a shuttle in the stratosphere\nCheck it\nMy body is my temple and my temple is my prize\nMy mind shine like the sun do and here's a little word to the wise...\n\n[Hook]", "title": "The Nobodys", "album": "All Balls Don’t Bounce Revisited", "image": "https://images.genius.com/5afdae8c12d9c72303cb15a766b901de.700x700x1.jpg", "year": "2004-01-01"}], "artist": "Aceyalone"}