{"artist": "Fashawn", "songs": [{"year": null, "album": "Boy Meets World", "image": "https://images.genius.com/4eb0769f2fa647dc2e26d40d1390094b.1000x1000x1.jpg", "lyrics": "I'm a traveling man, baby. You gotta respect, gotta accept it. I'm on the go, man. The world is calling. Check it out\n\n[Verse 1: Fashawn]\nLate night, I would write\nSee the world through my composition, thirsty\nStay strong in the face of adversity\nNow my rhymes took me further than I imagined\nTorin, Atlanta, Sicily, Manhattan, Staten\nIsland right back to the Valley\nJust to show em how we do in central cali, my home\nOn the map now, they tell me sit in the throne\nI tell ‘em I'm not concerned with the crown or the robe\nJust wanted to meet the world, become a man on my own\nAnd I did, now the name's household, Santiago\nCA get hot, as I ran I hit Chicago\nIt's the heart that guides me, my mind just follows\nI go where the wind takes me\nSamsonite bag full of clothes\nLike Jack hit the road\nTo the next city\nFuck it, let's travel the globe\nLuggage already packed\nWho knows when I'll be back\n\n[Hook: Fashawn]\nThey say I'm a rolling stone, where I rest my head is my home\nI let it be known that I'm a Samsonite man, yeah I'm a Samsonite man\n\n[Verse 2: Blu]\nI was reflecting where I been and realized there wasn't nowhere\nBack home looking at life in one long stare\nThere comes a time in every man's mind he gotta get out\nGet something, bring back something, don't sit around\nSlumped, blunt in your hand, running from what, living for what\nParents, so you can fry they can front\nLike your peace but you keep the distance\nCause your piece of mind is so small\nGiving the attention to y'all\nBecause they listening\nListen, I'm just one reflection\nYou see me on stage and think of God reflecting\nBut see I'm really just John, look my passport says so\nFolks say I'm retro and I guess so\nBag over my shoulders no pack of clothes on the metro\nAlone again looking out the window at the road again\nAsk myself why I left home to roam\nWhen I've never been home or to Rome\nBut I'm gone again\n\n[Hook]\n\n[Verse 3: Fashawn]\nTo the fans that supported me when I was down\nSaid I went Hollywood cause I don't come around\nOn the road seems like I'm always out of town\nI could even reach the globe or keep it underground\nEveryday is a journey, I'm just trying to find my way\nLeft teardrops on my girl pillowcase\nMy unc' said we ain't got no time for that\nBig sis said make sure your mind intact\nIt get lonely on the road don't forget about home\nGot to know where you been to know where you going\nEverything changes, before you know it\nYou in the mirror realizing you getting older\nI never thought that I would make it out the F\nGot the respect that I ain't expect\nLast night, can't remember where I slept\nOne city at a time then it's on to the next\n\n[Hook]\n\n[Outro]\nSo on that note, I'mma pack my bags\nHit the road, yeah, I'm gone\nPeace", "title": "Samsonite Man"}]}