{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "Way Out There", "year": null, "album": "IV Life", "lyrics": "Let's give it up for the fabulous {*scratched: \"King Tee*}\nFa-fabulous {*scratched: \"King Tee*}\nLet's give it up for the fabulous {*scratched: \"King Tee*}\nFa, fa-fa-fabulous {*scratched: \"King Tee*}\n\n[King Tee]\nAll aboard the mothership, prepare to set sail\nLyrics fat, swell as a killer whale\nEnemies approachin, identify yourself\nThey're raisin up the flag, backin up they get to blast\nOpen fire, cannons let loose\nShut 'em down like the spruce goose\nCaptain aye aye, they still floatin\nGive the order - blow they punk ass out the ocean, got 'em\nDrink hit the dank as they sink to the bottom\nSchools of sharks circles then the sea turned all purple\nEven Jacques Costeau punk-ass was scared to go\nAnd that just goes to show to uhh, let you know, uhh\nAs I chill again like Gilligan and the Skipper\nA nigga kickin it with two hoes like Jack Tripper\nSwabbin the deck, just stabbin in my cabin\nRubbed the magic lamp and out popped Aladdin like \"What's happenin?\"\nI said, \"What's up? I want my rhymes to be the dopest\nAla.. cadabara.. hocus pocus\nYou think they can see me?\" He said, \"Nope not really\nCause the fog's in the air plus you're way out there\"\n\n[Hook]\nWhen you look up in the sky, ohh me oh my\nIt's a bird, it's a plane, it's a god damn shame\nTela come wicked and you best beware\nYou will see when he kick it that he's way out there\n\n[King Tee]\nMy style pattern's unique, exquisite, so come visit\nExhibit A through G, through Z, E-N-T\nStuck your equilibrium on activate\nCaptivate the ear and then his eyesockets upon my pockets\nI left him in suspense, who's the, tribes and crews?\nCompetition none exists bitches be blowin me kisses\nOthers fall like missiles, the cap was artificially flavored\nMy first verse, it quenched your thirst\nFor instance, I'm makin people boogie but yet\nFrom long distance, causin it to interfere with your hemisphere\nFlee, it's a G recipe\nIt get you hooked, havin fits off my shit\n\n[Hook]\n\n[King Tee]\nThey wanna wipe us out! I think they hate us\nKillers with the pencils and the papers and erasers\nI'm comin through ya living room boom, shok-a-lok-a boom\nShake ya whole area, break your sound barrier\nSo wake up if you sleep cause like a clock I tock I'm tickin\nEarly bird, get the worm, and I stopped slangin chickens\nBut I still be kickin facts, black, black on black crime\nWhy the hell you jackin me? I don't have a damn dime\nMy skills kill you like a deer with my spear\nWhen it rains it pours he fell from the tier off the third floor\nThe pieces of the puzzle huh, figure it out\nAnd start fuckin around and we'll be diggin you out\nAnd it's just that simple put the thang up to your temple\nAnd now you got a permanent dimple\nIt's King, Tee, the name nigga and don't get snotty\nBetter knock on some doors and ask somebody (yeah)\nSo fuck that other shit and grab my hand with all your might\nCause I'mma show you what that West coast like\nThe flavor's unbelievable, nutritious, delicious\nNigga when the Tee get loose it gets vicious\n\n[Both parts scratched ad lib for four bars]\nLet's give it up for the fabulous {*\"King Tee\"*}\n\n[Hook] - 2X\n\n{*\"King Tee\" scratched*}"}]}