{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Autobiography", "album": "Sucka Free", "year": "2009-05-14", "lyrics": "[Spoken]\nThis is the autobiography of Nicki Maraj\n\n[Hook: Nicki Minaj (Shawn Wright)]\nMay the lord protect me, as the world gets hectic\nMy voice projected, my life reflected\n(The more I cry, the more I try)\n(Can you hear me? Yeah)\n\n[Verse 1]\nDaddy was a crack fiend, two in the morning\nHad us running down the block like a track team\nWhen you burnt the house down and my mother was in it\nHow could I forget it? The pain is infinite\nShe's my Queen and I ain't even British, she's the only reason\nThat I went to school and I finished (yeah)\nShe told me that I had talent, got on her knees\nAnd prayed for me when I started being violent (okay)\nShe saw something in me that 'til this day\nI don't know if I could be that (yeah)\nBut I'ma die tryin' and when I'm done cryin' grab the iron\nAnd black out like I'm retiring (kyuh)\nNightmares of you killing my mother\nThe reason that I sleep with my head under the covers\nAnd they should've thrown a book at you\n'Cause I hate you so much that it burn when I look at you\n\n[Hook: Nicki Minaj (Shawn Wright)]\nMay the lord protect me, as the world gets hectic (I'll keep trying)\nMy voice projected, my life reflected (keep, keeping on)\nMay the lord protect me, as the world gets hectic\nMy voice projected, my life reflected\n(The more I cry, the more I try)\n\n[Verse 2]\nDamn, I wanna run to you, hold you and kiss you\nAnd tell you how I miss you (I miss you baby)\nThought I would have a son for you but now it's official\nIt's over and I can't let you go (oh)\nBut I gotta let you know, all the shit I did made me feel like\nI'm dying real slow\n'Cause no one understands me\nThey don't know what to do when I'm hurt\nAnd when I'm angry (kyuh)\nYou was my friend and my man and my daddy\nYou was there when that bitch tried to stab me\nAnything I ever needed, knew you had me\n'Cause of you, all them chicks couldn't stand me\nSo why I hurt you? That's the question\nIt took this long, for me to learn my lesson\n'Cause now all I want is peace and get drama\nFinally understand the true meaning of karma\n\n[Hook: Nicki Minaj (Shawn Wright)]\nMay the lord protect me, as the world gets hectic (I'll keep trying)\nMy voice projected, my life reflected (keep, keeping on)\nMay the lord protect me, as the world gets hectic\nMy voice projected, my life reflected\n(The more I cry, the more I try)\n\n[Verse 3]\nPlease baby, forgive me, mommy was young\nMommy was too busy tryna have fun\nNow, I don't pat myself on the back for sending you back\n'Cause God knows I was better than that (kyuh)\nTo conceive you, then leave you, the concept alone seems evil\nI'm trapped in my conscience\nI adhered to the nonsense, listened to people who told me\nI wasn't ready for you\nBut how the – would they know what I was ready to do?\nAnd of course, it wasn't your fault (no)\nIt's like I feel you the air, I hear you saying\n\"Mommy don't cry, can't you see I'm right here?\" (yes)\nI gotta let you know what you mean to me\nWhen I'm sleeping, I see you in my dreams with me\nWish I could touch your little face, or just hold your little hand\nIf it's part of God's plan maybe we can meet again\n\n[Bridge: Nicki Minaj (Shawn Wright)]\n(The more I cry, the more I try, gotta keep on)\nMy voice projected, my life reflected\n(The more I cry, the more I try, gotta keep on)\n(The more I cry, the more I try, gotta keep on)\nMy voice projected, my life reflected\n(The more I cry, the more I try, gotta keep on)\nMay the lord protect me, as the world gets hectic\n(More, more, more, more, more, gotta keep – mo-o-o-o)\n(The more I cry, the more I try, gotta keep on)\nMay the lord protect me, as the world gets hectic\n(The more I cry, the more I try, gotta keep on)\n(The more I cry, the more I try, gotta keep on)\n\n[Outro]\nMay the lord protect me, as the world gets hectic\nMy voice projected, my life reflected\nMay the lord protect me, as the world gets hectic\nMy voice projected, my life reflected\nMay the lord protect me, as the world gets hectic\nMy voice projected, my life reflected\n(Can you hear me? Yeah)\nMay the lord protect me, as the world gets hectic"}], "artist": "Nicki Minaj"}