{"artist": "Azealia Banks", "songs": [{"title": "Idle Delilah", "image": "https://images.genius.com/4bb9df7f0fa6fa6ee25e87e45758a634.1000x1000x1.jpg", "album": "Broke with Expensive Taste", "lyrics": "[Verse 1]\nIdlest Delilah\nDarling, do ya like beige in your coffee? Tea? A wild-?\nWild breeze on a day, a dawn\nOft' indeed a child, smiles at me cause I'm made of yarn\nDolly, me? Am I? I'll trade a dollar for ya dime, oh\nIdlest Delilah\nTrout and trees remind me of my\nDarling 'D the Diver,'\nDiver D was a satyr - a\nFather figurine\nI made him run away with his stale lung\nFolly me am I? Oh, Idol-less Delilah\nDarling Miss Delilah\nWhile you're wasting your days alone\nAll your friends are hired, all your friendships are fading\nDon't try to cheat the dial, don't look the other way\nIt could play out wrong\nAre you suicidal?\nAre you in denial?\nIdlest Delilah\nWhile you're 'wake hear my latest song\nGlad to see you smile\nGlad to see you so stable\nWhat's all of these divided by the pile of peas on the nape of your..\nDolly me am I? I'll trade a dollar for your dime\nI'll take you\n\n[Interlude]\n\n[Verse 2]\nSlick snapper, Soul Clap on 3\nHi-hatter the dip-dapper pretty pat this \"p\"\nTip-tapper the chit-chatter, ready rap AB\nCan't deal with the bullshit cause the crab ain't me\nHe took you to cruise ships, put a yacht on me\nHe said, \"The puss deeper than the deep blue sea\"\nIndeed, the puss deeper than the three fugees\nLoopy!, the Lucy, said she loses no winks!\nStay up in ya face beverage with ya ~ baby!\nApplauded the favorite, so clap on 3\nThey loving the mixed flavors, lift ya pink and clink!\nThey loving the mixed flavors, lift ya pink and clink\nSomething to sip savor, made ya blink and think\nStay puffin the piff, paper-making-hits ain’t cheap!\nYep, and I flew Jamaican Jake for dick and Ki\nThey loving the mixed flavors lift ya pink and clink\nLondon to main state, I’m major, Miss AB\nThey fucking with young savior, make her rich and sweet\nLoving ya luck lady, lick ya lip and wink\n\n[Outro]\n(It’s that jam g, it’s just flavors-\nRhythm and dance beat, so what up?\nLit that damn green and it’s blazin-\nBitch, i’m stance, steez in the cut\nUpton N-Y-C is famous, london fam\nPlease throw it up little bam-bi with the latest\nGive her that stamp, g - put it up!)", "year": "2014-11-08"}]}