{"songs": [{"title": "I Don’t Think My Momma Ever Loved Me", "image": "https://images.genius.com/7fd34c05170fbf0f207b4d1804a8232f.600x597x1.jpg", "lyrics": "[Intro: Brotha Lynch Hung]\nThis song right here, I made this song to... eh\nReally say what's on my mind so I hope... ah\nNobody gets mad at me for saying what's on my mind\nThat's what I'm known for, you know what I mean?\nSaying what's really on my mind\nYeah! Ay!\n\n[Verse 1: Brotha Lynch Hung]\nI don't think my momma ever loved me\nDidn't even hug me, tackled me like rugby\nI don't give a fuck, I'm just tired of being lonely\nWhen they beat you up I had to go buy me a chrome piece\nI was only fourteen, maybe 130, soaking wet\nThree years later I'm at a homeboy's smoking wet\nNewport cigarettes, OA English\nOne year later, now I'm higher than a Phoenix\nTwo months later I was GBCin' it\nCouldn't wait to see my 98 human beings\nLight blue regal\nI was in the streets before you bitch niggas was three thogh\nSky blue eagles\nMomma didn't see nothing, she was off that old\nRocks in my pocket like the bottom of the sea though\nHad the fiends walking like C-3PO\nNow momma's gone and it's all up to me, so...\n\n[Hook: Mr. Blap]\nHey momma!\nI saw everything but love\nHad a struggle growing up\nWondered why you don't hold me in your arms\nAnd say that it's allright\nHey momma!\nThe pleasant memories fade away\nMany things I wish she said to me\nBut I don't think that momma ever loved me\n\n[Verse 2: Brotha Lynch Hung]\nI don't think that nigga ever loved me\nI feel it in my tummy, shit's getting ugly\nAll over a bitch playing games cause she want me\nPrank calls talking about they really gonna hunt me\nThey don't understand I was hungry\nMadesicc they said, but we wasn't running\nGot me an investor with a whole lotta money\nBack on Twitter talking \"May 6th coming\"\nAbout to eat thanksgiving dinner, nigga yummy\nThey played me like a dummy, what...\nWhat the fuck you want from me?\nFelt like it's a wrap like a mummy\nHit 'em up with text messages\nI wondered what kind of success this is\nNigga I was set up\n63 days and I watched them throw their set up\nThey never got fed up\nLife is like a fat ass bitch that won't shut up\nMoney ain't everythang, shit can get wet up\n\n[Verse 3: Brotha Lynch Hung]\nI don't think that label ever loved me\nMaybe it's a West Coast thang, cause they fucced me\nEven in my new situation I'm struggling\nFeeling like nobody on the label even trust me\nWaiting around till I see if they gon' cut me\nI'm so giant, rap game's Kobe Bryant\nWho would wanna try to touch me?\nRunning for my life again, running for the Heisman\nNigga if you're my brother you won't hear the fucking lies again\nWhere the fuck is summer? Maybe I'mma fly again\nFuck you came with I got a box of Timing\nMight have to die again, come back to life again\nMight have to eat your motherfucking wife again\nThunder and lightning\nStanding in the bedroom window, sliding in\nGive 'em a headache without a vitamin\nTry again, I think we should start all over\nTry again, If you say we ain't starting all over\nShame on me again\n\n[Outro: Brotha Lynch Hung]\nIt's what it is\nI been through a lot while I was recording this album\nSo within it anyway\nEverything that I said, man\nI really mean it", "year": "2011-01-01", "album": "Coathanga Strangla"}], "artist": "Brotha Lynch Hung"}