{"songs": [{"image": "https://images.genius.com/2ad9053d8933f289bd1d5b788c18dde2.500x520x1.png", "year": "2011-12-12", "title": "Chaka Shao Khan", "album": null, "lyrics": "It's these girls that be needy\nLabels that be greedy\nThat keep me hitting these bottles hoping I find a Genie\nNo shave November, hair growing out in my beenie\nBenny the Jet hits got chicks on my L7 weenie\nMusical chair rhymes, they thinking it's their time\nThe game like Lebron's hairline, always receding\nAll I'm needing is a little space\nOnce I get a little taste\nYou niggas should grab a chair, no Triple H\n\nTechnique you a fool for this!\nThis feels soulful, but powerful\nChaka Shao Khan!\n\nWelcome to the city of pretty women that can't take denial\nAnd cry enough to turn a small lake into the Nile\nHead's great, but they be a head case on file\nWith contraceptive pills she ain't take in a while\nSo I'm putting on a glove like OJ in the trial\nFor me to calm down, it's gon' take a while\nVegas for the night we got drinks at Tao\nLike Calvin in Paid in Full, we pop Ace so wild\nWhile, niggas who were hating all in our faces\n24 hour diners, they all shakes and smiles\nIt was all hate til now\nNow I'll take my bow, little hoes, weak little hoes\nIf this was 5th grade, I put you in a figure 4\nUsed to keep a flag on us like Pookie's clothes\nJust a bunch of Lost Boys, Bangorang, Rufio\nChaka meet Shao Khan\nAnd in my downtime, since weed is a trend now, I sell it by pounds signs\nAnd still deliver classics through Alpines\nSquarians say, \"Vizzy blowin' up? It's about time\"\n\nAnd this just the beginning..\nYou know how people say, \"This is my year\"?\nNaw, this is my generation\n\nThis is that Chaka Shao Khan\nMortal Kombat bangin on that loud tom\nWhen I spit that blacka blacka blaow rhyme\nLosing my mind even though I sound fine\n8 blunts deep, think I'm about to be on Cloud 9\nCoupe changing colors, the new name is mood rings\nSquare in the circle, four eyes and 2 chains\nUnder the illest conditions, I'm winning: flu game\nHashtag Squarian, intergalactic crew name"}], "artist": "XV"}