{"songs": [{"title": "Escobar", "lyrics": "[Hook]\nLast night I had a dream\nPablo Escobar gave me 10 bricks\nAnd then I showed up on the scene\nLooking like I hit about 10 licks\n\n[Verse 1]\nWhat’s up my friend? como te llamas? my name is Jizzle\nI heard you had them whole white squares down to the Medow\nGive me everyone of them bitches you got I get ‘em off\nWe can sit back and split up the profit minus the cost\nRight now I’m on my “get money” shit , no time to floss\nMan I’m talking so much money in the room I’m getting lost\nAnd you know we do it face to face not on the selling\nIf you want ‘em send them shots of the sea just like on belly\nAnd this bad bitch I got from the plug she snort the eight\nTold that bitch you should be same as yourself bitch wipe your face\nOn the floor my columbian nigga I told ‘em Cubo\nSay you ’bout to drop me a hundred I need 2 more\nAll I fuck was mucho , wait, I’m talking sumo\nI play them cards just like they go I’m talking uno\nGo to sleep in the hood, woke up in that versace\nWith the feds outside it’s snapping like paparazzi\n\n[Hook]\n\n[Verse 2]\nWe make a million, spend a million life is a fairytale\nIf they catch me in the crew they gon’ throw us in the jail\nIf I think that they ain’t right then I ain’t making a sale\nFBI, DEA , shit how can you tell?\nYou know I’m kicked back , just peeping the conversation\nNigga set me up, get me indicted be complication man\nThis why I stay on top of my game, my shit is smooth\nYou know we ain’t playing no games, my niggas rule here\nIf they get you in , you say that you won’t I’m just that dude\nIf he ain’t get stopped then you won’t make in the news\nYou know this shit was boom in the day, I made a killin', nigga\nI’m sick of trying countin’ these millions fuck is the billions\nGot money in the couch, money all up in the ceiling\nThat sick shit bitch all we need is penicillin\nThink I need to slow down the weed, I lost count\nRan through the first three point 8 and passed out\n\n[Hook]", "album": "It’s Tha World", "year": "2012-12-12", "image": "https://images.genius.com/8fe302531b6c0c71a4640962eee4d417.499x499x1.png"}], "artist": "Jeezy"}