{"songs": [{"image": "https://images.genius.com/4186ee36b844bd7bbde71da3b370390b.500x500x1.jpg", "lyrics": "[Hook: Josh Everette]\nShe looking fly, real fly in her Nikes\nFresh new Jordans or fresh pair of Ice creams\nOoh she's a dime, she keep 'em iced so nicely\nThe way she's rocking them kicks, gotta make her my wifey\n\n[Verse 1: Mac Miller]\nYou're looking fly, real fly in them Nike shoes\nI'm looking for a wifey and it might be you\nMenage a trois, spend the night with two\nIt's alright with me, if it's alright with you\nFeel my hands rubbing up and down your backside\nMa, you've got curves like a half pipe\nThat's right ma yous a ten\nAnd your man? You be rocking nicer shoes than him\nI'm in the spot with some juice and gin\nCome to me\nYou're a beauty with your Louis and Gucci\nBaby girl I don't wanna be your man, but let me just write my number on your hand\nAt the party with a whole bunch of honeys here\nYou got your Forces laced up with some bunny ears\nBut now I got you all alone, and the booze gone\nSo slip outta your clothes, but keep them shoes on\n\n[Hook: Josh Everette]\nShe looking fly, real fly in her Nikes\nFresh new Jordans or fresh pair of Ice creams\nOoh she's a dime, she keep 'em iced so nicely\nThe way she's rocking them kicks, gotta make her my wifey\n\n[Verse 2: Mac Miller]\nYou looking like fresh, like WOAH!\nGoddamn, looking so fly that you probably got a man\nYour looking right and he ain't here tonight so\nI won't tell him if you don't OHHH!\nSo let's roll, roll back to the crib\nGrey Goose, lights dimmed, girl that's how I live\nYou know you got them kicks, fat ass, and some lips\nBaby you ain't gotta ask for a kiss\nShorty look proper, with kicks like Foot Locker\nAll done up, she a good shopper\nNew jeans, blue tee, and her shoes clean\nLooking like she 'bout to seduce me\nJust touch me, tease me, cute caressin'\n100 thousand pairs in your shoe collection\nI know you like to tell, but let me just lay back while you light my L\n\n[Hook: Josh Everette]\nShe looking fly, real fly in her Nikes\nFresh new Jordans or fresh pair of Ice creams\nOoh she's a dime, she keep 'em iced so nicely\nThe way she's rocking them kicks, gotta make her my wifey", "year": "2009-01-01", "album": "The High Life", "title": "Fly In Her Nikes"}], "artist": "Mac Miller"}