{"artist": "Boondox", "songs": [{"album": "Krimson Creek", "title": "Death of a Hater", "year": "2008-05-13", "lyrics": "[Verse 1: Boondox]\nGive up my soul to hell, and tell heaven I did my best\nOne love for family, the juggalos and fuck the rest\nI'm tired of all these snakes and demon leeches on the vein\nI've bled enough and now these bitches 'bout to feel my pain\nYou know you name the haters bitter with a point of view\nPussy motherfuckers talking shit but never had a clue\nCome with your attitude, cocksucker fuck your life\nI tie you to a chair and make you watch me fuck your wife\nI'm just the type to catch you slippin' like a bar of soap\nI catch you while you're sleeping fast and then I slit your throat\nI watch you bleed and gargle, choking for your last breath\nThen close the wound apply some pressure to delay your death\nSee what it means? Your whole existance don't mean shit to me\nIt ain't nothing but time to kill to make you history\nAnd all you had to do was keep your fucking trap closed\nBut now your got your hands folded, clutched onto a single rose\n\n[Hook x2: Boondox]\nJust close your eyes\nSay your last good byes\nGet down on your knees\nDry them eyes bitch and make your peace\n\n[Verse 2: Jamie Madrox]\nJamie not a hater, if I was it ain't no killing me\nI live forever, never die, surviving off the infamy\nMiss me with that everybody wants me dead same ol'\nAnd switch my hatchet to a target hanging off my cable\nIf you criticize my fashion, you a faggot like Tim Gunn\nI'm a juggalo scrub, established since day one\nSo kill the hater, replicator, dissing with a foul tongue\nTake my magic marker and blacken his fucking left lung\nWith my box-cutter I'm'a cut his eyes wide\nAnd put broken pieces of mirror replacing both his eyes\nGot a demon inside, that's been along for the ride\nSince the release of my first LP back in '95\nEver since that day, I've been embracing the hate\nAnd basically not giving a fuck, what none of y'all say\nSo fuck y'all bitches, black flowers up on your casket\nYou get what you deserve, burn in hell hating bastard\n\n[Hook x2]\n\n[Verse 3: Boondox]\nI see the shit ya pulling, looking like a trailer hitch\nCome to your hood with goons and snatch you out your trailer bitch\nPut on your knees, and close your eyes wait for the execution\nSome call this first degree, but I call it my retribution\nYou had your chance to keep the sun and now you're in the rain\nI be the scarecrow, but you the one who's missing brains\nI put the barrel to the bone and now you're skull fucked\nTwo times eleven to your dome and now you're out of luck\nSo many times I spit just dwelling thinking of the day\nUp to the point I sit for hours thinking of a way\nTo make you suffer, make your blood spill like a wine\nSix feet up underneath the ground, have you smelling pine\nIt's how we do a punk bitch with a frosted mouth\nLost in the woods till you discovered by a boy scout\nStupid little mother fucker, what was you thinking\nNow your body in the bushes like this rotting and stinking\n\n[Hook x2]\n\nI take your life, out here tonight you wanna try, die!\nI take your life, out here tonight, you wanna try, die!\n[x4]\n\n[Hook x2]\n\nI take your life, out here tonight, you wanna try, die!\nI take your life, out here tonight, you wanna try, die!", "image": "https://images.genius.com/880085d49aff9217e77dc1187f030306.500x500x1.jpg"}]}