{"songs": [{"album": "You Can’t See Me", "image": "https://images.genius.com/43fe3a454901e63e0ba59d34229099be.824x824x1.jpg", "year": "2005-05-10", "title": "Beantown", "lyrics": "\"Big up Boston!\"\n\n[Intro: John Cena]\nYeah whassup baby? We gon' do some things right now\nShow you how we do 'em in the Bean, y'knahmsayin?\nN.Y. representing, Dirty South representing\nChi-Town, L.A., they all doin their thing\nWe got a lil' somethin bubblin in Beanpot over here y'know?\nI got my crew right back gon' show you how it's done\nStraight up, hittin one-two like Manny Ortiz ya heard?\n\n[Verse 1: John Cena]\nIt's John Cena baby, and we heatin up the Beanpot\nBig up Boston, you know the whole team hot\nYo we fresh, y'all a little bit stale\nAnd we 'bout to make it ugly just like Kevin McHale\nCena taking over - I'm 'bout to make the scene mine\nI got a tea party, baby meet me on the Green Line\nAin't too many kids that flow better than me\nRoll thick like Yaz's sideburns in seventy-three\nLike Tom Brady and the Pats, we rollin kids\nCross me and pay a toll like the Tobin Bridge\nFrom the home of the curse, y'all know what I mean\nWe like the left field wall, we stackin Monster Green\nKnock you out of the park, you land on Yawkey Way\nMy shit be butter, but around here we say Parkay/parquet\nI rent my own team, we takin over the industry\nLike the Big Dig, baby nobody can finish me\n\n[Hook x4: scratched]\n\"Big up Boston!\" \"No one shows pity\"\n\n[Trademarc]\nYeah, it's Trademarc baby, biggin up Boston, yeah\n6-1-7, 9-7-8, 7-8-1, 5-0-8, and 4-1-3\n\n[Verse 2: Trademarc]\nAnd I don't mean to brag, but it's in the bag\nAnd we alone on top like we goin stag\nIt's a dynasty, that's how I see things\nIn four years we countin three rings\nI'm the MVP, baby gimme that key ring\nAnd me, Brady and Branch'll own our sweet thing\nYeah, and we ain't gon' stop\nWe at the Eagle flap, cook 'em all as they flop\nAnd T.O. takin on the B roll and that's the past\nBeatin everybody and the salary cap\nWhat now? You say titan's your rep\nThat's like Peyton winning big games out on Gillette\nWe don't forget y'all, we're keepin it grimy\nHad the Steel Curtain lookin like venetian blinds\nYeah baby, that's how it go\nThat's why next year it's lookin like 3 in a row\n\n[Hook x4]\n\n[Esoteric]\nYeah, uhh\nIt's Esoteric, tuning in\nPutting it down, for Boston, Mass\n\n[Verse 3]\nYo, I rep the Bean, y'all see the way it be\nHome of Source magazine, the Pats, and Edo. G\nSteadily poetically I'm Bill Russell in command\nPeace to Dorcester, Roxbury, Mattapan\nPack a man down quick like neanderthals\nStanding tall after brawling up in Fanueil Hall\nAs a young buck moms said I disobey\nAll she heard was no-ma/Nomar like fans in Fenway\nBut they sent him to the dugs, I'm like Manny when he shrugs\nAnd it bug to the sinning women wearing 7 in the club\nA deadly combination like venom hit your blood\nJason Varitek with the glove, it's all love\nI'm like Schilling with the red sock, when I get hot\nMy aim is dangerous, like the Larry Bird set shot\nIt's clear now, you living in fear now\nBig up Boston, the champ is here now\n\n[Hook]"}], "artist": "John Cena & Tha Trademarc"}