{"artist": "Booba", "songs": [{"album": "Lunatic", "title": "Jimmy Deux Fois", "year": "2010-11-22", "lyrics": "[Intro]\nWesh re-noi ?\nJimmy deux fois\nOuest Side\n\n[Couplet 1]\nC'est izi, izi, ça se passe ici, ici\nC'est lourd ? Oui, oui, oui, oui, Bakel City, City\nUne à une mes cases s'allument comme dans Billie, Billie\nJean, millionnaire en euros, milli, milli\nMes dernières vidéos en Wi-Fi, Wi-Fi\nJ'aime les défis, défis, les fans mimis, mimis\nJ'suis le meilleur, j'te mets fanny, t'es fini, nini\nRidicule en mode aplati, t'es un panini, ni\nJe suis venu, j'ai vu, j'ai vici, vici\nTrop de vlots-tra dans ce game comme à Clichy, Clichy\nParle à ma secrétaire, j'suis busy, busy\nOu bien va niquer ta mère comme dirait Fouiny, Fouiny\n\n[Refrain]\nJe swagg sur la gauche, je swagg sur la droite\nAutomatique sur les genoux, bouteille de Jack sur la table\nPremier samedi du mois en décrypté sur la 4\nGros décolleté, 9.2.I. tatoué sur la chatte\n(Je vais chercher des clopes, je vais chercher des clopes)\n\n[Couplet 2]\nJ'suis Super Mario, t'es Luigi, Luigi\nT'emmènes ta go dans l'Ontario, moi aux Fidji, Fidji\nJ'aime les gros culs, pas les gos skinny, skinny\nLes meufs des îles bien dodues, j'leur dis vini, vini\nMon expression est directe, demande à Weedy\nJ'veux la chatte à Fatoumata, la chatte à Windy\nB.2.O. ours, grizzly, grizzly\nNégros pendus aux arbres dans le Mississippi\nJ'suis traumatisé depuis, depuis\nÀ la 0.9 aromatisé, j'suis de-spee, de-spee\nHomme d'affaires, j'ai ralenti le te-shi, te-shi\nAvoir les idées claires, laisser le pe-ra en sursis, sursis\n\n[Refrain]\nJe swagg sur la gauche, je swagg sur la droite\nAutomatique sur les genoux, bouteille de Jack sur la table\nPremier samedi du mois en décrypté sur la 4\nGros décolleté, 9.2.I. tatoué sur la chatte\n(Je vais chercher des clopes, je vais chercher des clopes)\n\n[Couplet 3]\nFondant au chocolat au dessert, mi-cuit, mi-cuit\nLe rap français est sur le grizill, j'fais méchoui, méchoui\nJ'suis dans le strip club, j'suis airy, airy\nJ'suis pas au Pink Paradise, j'suis à Miami\nAvec mon pote l'affranchizi Jimmy, Jimmy\nMinimum 4 zéros en poche, pas moins de 10 000, 10 000\nMalekal Morte est sur tes pas, chacun est suivi, suivi\nDonc si tu aimes quelqu'un, dis-lui, dis-lui", "image": "https://images.genius.com/137effe262651a743219a429d19c2adf.1000x1000x1.jpg"}]}