{"songs": [{"year": null, "title": "Lie Detector Test", "image": "https://images.genius.com/53b6cf23d3b9c3491d5918ea4087005b.640x640x1.jpg", "lyrics": "Got a caveman banging on my back door\nGot a hang man hanging on my front lawn\nGot an old maid wasting away in the living room\nKids in the kitchen with their mouths full of silver spoons\nGot a paper full of yellow journalism\nA restaurant waiter selling me words of wisdom\nThe small town crier is chilling with the village idiots\nThe big city slickers are still busy building pyramids\nGot a diploma but no wall to hang it\nTags on the bathroom stall to make me famous\nA job description that don't fit the bill\nA fatal femme fatale dressed to kill\nGet me out of this, lie detector test\nMy pupils inhale and exhale\nMy breath is a microphone check: 1, 2, what is this?\n\n(I wanna give a big special shout out to all the real people out there, keeping it real, because reality is worth maintaining, you know what I'm saying? keep it up)\n\nIn a world where these girl's got retro tattoos\nAnd all I've got is a gut and Velcro black shoes\nAnd elbows that move in a way that makes space\nI'm looking at you (stay awake, stay awake)\nNatural face affected by the chemical leaks\nGrammatical mistakes in every sentence I speak\nIt doesn't matter, I make enough sense to seem deep\nNow look at me (go to sleep, go to sleep)\n\n(You know I wanna give a shout out to my boy Reanimator, keeping it misanthropic and shit. My man Chris doing his damn thing. Give a shoot-out to my mic for keeping me company in this dark ass room, and to my girl killing all the ants in the kitchen. Peace baby.)\n\nI'm a poor man's version of a rich man\nI've got a small van swerving through a big land\nI've got a road map that's looking a lot like a math test\nA blocked phone number and a bunk home address\nI've got a way out but I ain't trying to use it\nCause I've got some ins and I'm a bet all my winnings\nIf it hurts me more than it hurts you, then I won't hurt you\nI've got more sense than virtue\nI've got a curfew, it's 12 o'clock\nAfter that I'll start trembling if I get fed hip-hop\nWhy? Cause I'm a G to the r-e-m-l-i-n\nIf I wasn't then why would I say I am?\nGet me out of this, lie detector test\nMy pupils inhale and exhale\nMy breath is a microphone check: 1, 2, what is this?", "album": "A Healthy Distrust"}], "artist": "Sage Francis"}