{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/fed8facbaf87daaa9c461566cd84b113.425x425x1.jpg", "year": "2017-08-15", "album": "I’m So Anonymous ", "lyrics": "[Intro: Malcolm X]\nFor instance, the average so-called Negro, he doesn't think that he can go into business and provide jobs for himself\nAnd because of this, he thinks that he can only get a job from the White man\nOr he can only get clothes from the White man, or he can only get food from the White man\n\n[Verse 1]\nUh, we're takin' over the the racist motive, the hatred's older\nThe empire's retired, I'm just an ageist Yoda\nGet some powder and baking soda, don't take the culture\nThey flip faster than racing motors. I'm made to blow up\nIf you don't understand now, then you will later\nI'm from a place where they bust Glocks and steal paper\nNah, I'm talking assassination, they kill mayors\nBut can't overtake me because my skill's greater\nRap politician. Nominate my Congress\nNever understood the Obama-hating nonsense\nBlack president. Dog, you hever had an option\n'Cause, boy, I go monster way better than the Loch Ness\nLet's get back to the subject: Blacks in the public\nIt seems like all other rap doesn't touch it\nSee, I tend to be the industry's redheaded stepchild\nI've spoken too much. I'm surprised I'm not dead now\n\n[Hook]\n'Cause they got dead bodies in the street\nNiggas on a leash\nFacts show they want us all diseased\n'Cause I found dead bodies on the ground\nNiggas, not a sound\nThe cameras and the lights come around\nBut I've always wondered (I wonder)\nYeah, I've always wondered (Always wondered)\nIf we'll ever make it\nShit that we're facing\nThese rap politicians\nThe game is getting basic\nYeah\n\n[Verse 2]\nYou see, these rap politicians are really something else\nThey start blowing all their funds moment they discover wealth\nI mean, cop another belt. Shit, maybe even two\n'Cause if you're not wearing designer, then crazy, you\nWhen actuality, these guys are lazy goofs\nThey're the type to go dap a Piru in baby blue\nStraight stupid. And these are the niggas who make music\nInfluence a generation, nobody relates to it\nNigga, now you see the problem? Do you see the trouble?\nThey're fucking up our brains for generational struggles\nThat black waitress works doubles just to get by\n'Cause her son needs some Jordans, dog, just to get fly\nI used to smoke an eighth a day, nigga, just to get high\nAnd Nelqueisha didn't get the job that Jessica got\nAnd when we get the 9 to 5s, we become satisfied\nAmend the rap politics. Constitution ratified\n\n[Hook]\n'Cause they got dead bodies in the street\nNiggas on a leash\nFacts show they want us all diseased\n'Cause I found dead bodies on the ground\nNiggas, not a sound\nThe cameras and the lights come around\nBut I've always wondered (I wonder)\nYeah, I've always wondered (Always wondered)\nIf we'll ever make it\nShit that we're facing\nThese rap politicians\nThe game is getting basic\nYeah\n\n[Verse 3]\nIt's time to overthrow this government. Military coup\n'Cause if we don't soon, they'll still bury you\nAnd the first plan of action: Man, y'all gotta stop the shooting\nAnd no dickriding, that's technically prostitution\nNo backwards progression, always constant movement\nEverything is in your hands, you just gotta grind to do it\nBut first things first needs diplomatic correction\n'Cause rappers like me in the systematic oppression\nHuey Newton of this rap shit. Y'all don't understand me\nThe same reason why Nas and Snoop still don't have a Grammy\nWhy you gotta blow thousands when you fly to Miami?\nAnd why you can't be a rapper if you drive in a Camry?\nThey make it uncool to budget, want us blowing our cash\nThen Uncle Sam makes us broke again when taking our tax\nSo depressed from this hex they supply in prescriptions\nModern day drug war, these rappers fighting addiction\n\n[Hook]\n'Cause they got dead bodies in the street\nNiggas on a leash\nFacts show they want us all diseased\n'Cause I found dead bodies on the ground\nNiggas, not a sound\nThe cameras and the lights come around\nBut I've always wondered (I wonder)\nYeah, I've always wondered (Always wondered)\nIf we'll ever make it\nShit that we're facing\nThese rap politicians\nThe game is getting basic\nYeah\n\n[Outro: YBN Nahmir]\nListen, man, I ain't gonna lie, this shit is ass\nThis shit is not good\nI need some coonery in my life\nI'm tired of this black power, woke shit\nAight? You gonna have to cut all that shit out, B\nSeriously, I needs the crank\nYes, that's what I'm looking for, the word \"crank\"\nI needs that\nThat is not this\nThis shit is ass. Turn it off\nNot a good song (Ass)\nTrash (Garbage)\nGarbage (Boo-boo, stank-stank)\nNigga Motherfuckin'", "title": "Rap Politicians"}]}