{"songs": [{"title": "Doin Hits", "album": "The Best of Lil Herb & Lil Bibby: Heir Apparents", "year": null, "image": "https://images.rapgenius.com/44d3c4924618c89cb0b1b98f0c56b608.1000x1000x1.jpg", "lyrics": "[Intro]\nThe morning dance is not a good way to start 2013\nAnd the numbers are climbing\nWhen it comes to gun violence in the city of Chicago\nWe’re learning so far this weekend\nAll the victims have been teenagers\nWe have learned about at least five different shootings since Friday afternoon\nAnd at least 6 teens have been shot, two of them have died\nIn just 12 days into 2013\nAnd there's now a total of 22 homicides\n\n[Hook x2]\nWe be doing hits\nWhen we get off the shits\nWe ride on your block and get to lettin off clips\nWe be doing hits\nWe be doing hits\n\n[Verse 1]\nUh, my youngins with the shits, they be doing hits\nWhen I get in the booth, I be making hits\nNina on my hip, the 40 in the dip, (yeah)\nNigga ride through, his car getting flipped\nNo this is not a myth, I know you know Lil Chris\nI have 'em blow you down, now its hot up your strip\nMy lil bro he a trip, he don't care about shit\nAnd he'll hit you up, while you riding with this bitch, (yuup)\nKill them if you get, (fuck it!)\nWe got guns to pick, (yeah)\nI just bought a Glock 9 with the rubber grip\nKeep that in the whip, dirty Sprite I sip (sip)\nRoll up gettin lit, when they bored, they do hits!\nWe gonn park da whip, and (gone spot a pick?\nLet the choppas whip, R.I.P, you will be missed\nSay we gonn park the whip, and (we gone spot a pick?\nLet the choppas whip, R.I.P, you will be missed\n\n[Hook]\n\n[Verse 2]\nI work late nights so it's no sleep\nAnd these broke niggas be so cheap\nAnd every nigga that know me\nKnow, I will never ever go sleep!\nSellin dope ducking police\nYoung nigga riding foreign now\nCause niggas pay to hear me and bro speak\nThese niggas is so weak, and I’m so hot, they so not!\nNiggas talking that gangsta shit\nBut I don't never see you on your block\nFind out where you hiding at and\nGo Masked up and run up in yo spot\nGot K rounds, put ya face down\nWhere the cash at?\nI shouldn’t even have to ask that!\nMake a move\nImma blast that\nDropping bodies like Mad Max\nRed bone and her ass fat\nImma smash that, then pass that\nLike Chris Paul on the side line til I get called\nNiggas ain’t on shit y'all, they just talk a lot, but don’t shoot shit\nSame nigga that got shot, and ain't do shit!\nFeeling good buy a new whip\nSome new kicks, a few fits to come splurging\nKnew I'm back when I was serving\nNow I'm foreign car swerving\nLil Bibby go too hard and these rap niggas get nervous!\nI got shooters at my service..."}], "artist": "Lil Bibby"}