{"artist": "Boondox", "songs": [{"album": "Krimson Creek", "title": "Love/Hate", "year": "2008-05-13", "lyrics": "[Verse 1]\nLooking out across the crowd, see painted faces all around me\nMoving to that shit I'm saying, bouncin to that bass that's pounding\nY'all know my lyrics, spit that shit just like a fuckin wrote it\nNever can deny a Juggalo’s the one that's most devoted\nI see y'all on the streets and repping for the common scrub\nHatchetman on window tinted, repping for that family love\nUp in the mall wit my kids and y'all don't know it’s Dox\nTill you see the chain, a tat, a shirt and stop to show the prop\nWalk into the Conoco, grab some shit before the show\nParking lot of \"Hatchet Rise\" I see that line of Juggalo\nIt's world renown, the Faygo flies and screams of Family\nI love y'all muthafuckas, y'all the one's that set my soul free!\n\n[Hook]\nYou can't hate us cause\nWe don't give a fuck!\nBump that wicked sound!\nRock a fuckin hatchet and we represent the underground!\n[2x]\n\n[Verse 2]\nI see some shit don't change, haters born seem every minute\nThey see the paint, the clothes and loathes and they don't fuckin get it\nI see the news and read reviews and start to load the Glock\nSnitches talking shit, they got me loading quarter synthesizers\nI know the way it is and knowing that I freaking feel ya\nBorn to murder masses, kill they asses fuckin way familiar\nBut they won't break us fuck the world just like the clowns said\nRep the hatchet, psychopathic till my body's found dead\nWe got the shows and music shit that they can't take away\nWe run the underground so fuck 'em, what they got to say?\nJust throw your middles up and let the hoes know where they stand\nThis shit ain't 'bout no money bitch, this shit is more than just a brand!\n\n[Hook]\n\n[Verse 3]\nThe ones that know it, feel it, keep it and they won't forget it\nThis thing ain't dyin, it ain't fading cause they just won't let it\nY'all take the punches to the haters, I know what ya feeling\nI was there not long ago I know the shit in which your dealing\nBut fuck, we Juggalos, so they can all just go to hell!\nWe got the pride and love, we scrubs, so fuck 'em go to hell!\nJust keep them hatchets swinging, screaming, always keep it wicked\nKeep one in the chamber for them fuckin hating sons o' bitches!\n\n[Hook]\n\n[Outro]\nRock a fuckin hatchet and we represent the underground!", "image": "https://images.genius.com/880085d49aff9217e77dc1187f030306.500x500x1.jpg"}]}