{"songs": [{"title": "30 DAY RUN", "album": "Very Peaceful", "year": "2018-11-30", "image": "https://images.genius.com/7afce300a52c0e8fda1f5112bfe3676b.750x750x1.jpg", "lyrics": "[Verse 1: Larry June]\n\nShe couldn’t find a better nigga\nSo she came right back\nBut I’ma need about 20 if you’re trying to do that\nI can’t be your boyfriend but I can fuck with it (sock it to me)\nShe brought me ten Band-Aids, I had lunch with her\nIf I can’t help the bitch, then I don’t fuck with it\nShe had a drug problem, I couldn’t fuck with it\nA couple of whips in the Bay, I barely touch the shit\nMy stock rims at Jonze house\nShit it’s been a minute (good looking bro')\nI couldn’t make this shit up\nMan this the life I’m living\nFamily changed on me\nThey said I’m acting different\nI can lose it all today still be the same nigga\nI never had a job, my credit’s 750\nNigga do the numbers\nI’m not a dumb nigga\nI paid attention to it, manifested it\nIf I want it, then I get it, I don’t question shit\nAnd nigga never check me, nigga check the bitch\nWhat’s hattening?\n\n[Hook: Larry June]\n\n30 days, 30 days\n(30 days)\n30 days, 30 days\n(30 days)\n30 days, 30 days\n(30 days)\n30 days, 30 days\n\n[Verse 2: Larry June]\n\nIf I want it, I’ma spend whatever [Ay, Ay, Ay God damn]\nCop the whip and customise the leather\nThumbing through it, it ain’t nothing better\nGreat juice, expensive sweater\nShe came through a little past eleven\nI hit it twice and then I wrote this letter\n[?] in this 911\nPinky dancing like Michael Jackson (Yeehee)\nEat a sandwich, go online, cop another classic\nI ain’t even wanna fuck, I told the bitch I’m fasting\nSame whip but mine faster, bitch I’m chasing cabbage\nAll money ain’t good so bitch you can have it\nSo much money I can’t stash it, bitch fuck rapping\nI’m riding bikes on the beach living so fancy\nI’m trying to stay motivated so I can drop these classics\n3000 Woodgrain, Cartier glasses\nBitch what’s hattening?\n\n[Hook: Larry June]\n\n30 days, 30 days\n(30 days)\n30 days, 30 days\n(30 days)\n30 days, 30 days\n(30 days)\n30 days, 30 days\n\nAy, Ay, Ay\nShit, man, damn\nShit\nAy, Ay, Ay\nSock it to me"}], "artist": "Larry June"}