{"songs": [{"year": "2009-01-01", "title": "I Warned You", "image": "https://images.rapgenius.com/e457f23fe0eb2717332ec38cf9063d6d.1000x1000x1.jpg", "lyrics": "[Intro: Saigon]\nIt ain't over.  Fuck it\nThink we need an encore, man (yep)\nCan't be over\n(\"Clap your hands, to let, to let it start this one off... Can you?\")\nUh-huh (come on)\n(\"Please?\")\nYou know what?\n\n[Chorus: Sample]\n\"I warned you baby\"\n\"That what goes 'round must come 'round\"\n\"And I warned you baby\"\n\"That someday I'll put you down\"\n\n[During Chorus: Saigon]\nI warned you\nTold you.  These niggas was gon' get exposed (yeah)\nAll of 'em—lot of these frontin'-ass\nFake gang-bangers, fake thugs\nJust fuckin' punks, man.  Tell 'em, look\n\n[Verse 1: Saigon]\nYou actin' like you was puttin' it in when you couldn't have been\nYou bust guns and ain't never stepped foot in the pen\nYou scream, \"thug.\"  If you was, you wouldn't have been\nDogs that bark don't bite—they woof for attention\nSince you so in love with the spotlight\nPut the dot right on your beanie—you're blind in your third eyesight\nAm I gon' hit you?  I might\nDon't believe I squeeze a couple these and then breeze?  Alright\nBut don't say I didn't warn you when the coroner's on you\nGot 44 bulldogs—siccin' all of 'em on you\nWhat you gon' do when I swarm through?\nLong blue trench coat, shotty down my leg long too\nBump heads with the wrong crew—shame is on you\nThe blame is on you when the flame is on you\nAnd what you gon' do when the aim is on you?\nNigga, I live every word you hangin' on to\nLil' bitch!\n\n[Chorus]\n\n[During Chorus: Saigon]\nWarned you\nShit... I was the one locked up, bustin' them hammers, man\nHaha.  Hear y'all talk about it (yeah)\nI'll put you down\nBut I'll put you up on some real shit\nSome true shit\n\n[Verse 2: Saigon]\nHEY, YOU! Get off my CLOUD\nYou don't know how my gun go BLAOW!\n'Nother brother confused and I'm so foul\nAnother mother will lose one mo' child\nPeople said, \"Josephine, your son's so wild\nWhat could make him run so wild?\nYou better keep his ass out of the street or else he gon' go down\nRun around here with guns like he the king of the whole town\nYesterday, he showed me a fo'-pound\nLoaded clips, swearin' to God he won't waste no round\"\nMy mom give 'em a fake smile and turn them away\nShe used to seein' her baby with the burner and hey\nBut yo, before she let him get away, she stop him and say\nYou know what she say? (No, what did she say?)\nShe say, she say, \"What do you say to a kid that'd take his life and give it away\nAnd only live for the day?\"\nI was just talkin' to the lil' nigga today\nAnd when he play with that thing, I make him put it away\nShe say, \"What do you say to a kid who been in and out of court\nSince his ass was like four feet short?\"\nI don't know what the fuck y'all thought\nThat lil' nigga is crazy\nHehe (hahaha)\n\n[Bridge: Saigon]\nHaha (We just fuckin' with these niggas!)\nY'all won't even understand that shit, nah'mean?\nStatik Selektah, Saigiddy\n\n[Chorus]\n\n\"I warned you baby\" (*echoes*)", "album": "All in a Day’s Work"}], "artist": "Saigon"}