{"artist": "Khia", "songs": [{"image": "https://images.genius.com/fe0432a9282ff835cf35a98c7c77af7c.400x400x1.jpg", "title": "Hit Him Up (YG Diss)", "year": null, "album": null, "lyrics": "Fuck y'all niggas!\n\nMustard on the beat, hoe\n\nWait a minute, ain't that me on the track?\nWhy you ain't call and put me on the track?\nMy hands on ya neck and Imma be on ya back\nWhy you ain't call and put the queen on the track?\nWait a minute, ain't that me on the track?\nWhy you ain't call and put me on the track?\nGot my foot on ya neck and Imma be on ya back\nWhy you ain't call and put the queen on the track?\n\nYo, I know a bitch-ass nigga named YG\nPussy ass, soft ass, nigga done tried me\nAll you had to do was pick up the phone\nAnd ask the queen did I wanna get on ya song\nI woulda said \"Okay\" and passed you the baton\nBut ya had ya girl call me and that's wrong\nBitch started lyin', I had to hang up the phone\nFire your manager quick\nDial tone, bitch\n\nBitch, I'm the man, you the bottom, I'm the top\nI'm 'bout to turn ya ass out\nBend ya ass over\nStop runnin' from me, suck this pussy like I told ya\nImma put my strap on so you can get ya rap on\nI'm hittin' switches\nNip you and ya hustle\nNiggas don't trust him\nJanet Jack me?\nSneak past me?\nBitch, I'm the queen!\nWorld War Khia, fire, pop it!\n\nAll my ladies pop yo pussy like this\nShake ya body, don't stop, don't miss\nAll you ladies pop yo pussy like this\nShake ya body, don't stop, don't miss\nJust do it, do it, do it now, lick it good\nDo it, do it, do it now, lick it good\n\nAll my ladies pop, shake that ass, stop\nBack that ass up, money pilin' to the top\nNiggas lookin' like they want it, throw some cash on it\nLong-haired like a stripper, damn right ya gone tip her\n\nDon't beat around the bush\nTalk to the pussy\nTell her that ya love her and ya always thinkin' of her\nGet real familiar with it, a-do it baby stick it\nYou just fuck them other hoes, but ya love Thug Misses\nImma pop my pussy like Orville Redenbacher\nSweet, hot, meltin' butter drippin' all over ya mouth\nRoyal queen of the South\nAin't another like me\nHustle bitch grind\nStop wastin' time\nIf it ain't about the cash, get that shit off ya mind\nPop it, get it up, make it stand up\nSalute Thug Misses, when ya see me, throw it up\nImma pop my pussy, and the ladies ridin' with me, pop it!\n\nAll my ladies pop yo pussy like this\nShake ya body, don't stop, don't miss\nAll you ladies pop yo pussy like this\nShake ya body, don't stop, don't miss\nJust do it, do it, do it now, lick it good\nDo it, do it, do it now, lick it good\n\nI would say fuck you, YG, but I already said that, so...\nThank you, YG!\nYou have been sentenced to licking my ass for the next 25,000 years...\nHa ha ha ha ha ha ha ha!\nNew album, MotorMouf aka Khia Shamone, July 17th!\nHa ha ha ha ha!\nThe queen has spoken...\nThere's nothing you can give to the queen that the queen hasn't already gave to herself\nBe gone... bitch!"}]}