{"songs": [{"lyrics": "[Intro]\nWhooo! Whooo!\n\n[Hook]\nMemph Bleek always smoking that la la la\nBeanie Sigel always smoking that la la la\nNeptunes tracks smoke like la la la\nIt's the Roc, baby; sing our lullaby (C'mon)\nExcuse me miss, I'm the shit\nYou should come hang with me, basically\nHold up -- skip all the singing, let's get right tonight, mami\n\n[Verse 1]\nI know my English ain't as modest as you like\nBut come, get some, you little bums\nI take the cake from under the baker's thumb\nI bake the cake and two it up from one\nThen I moved the weight like I'm Oprah, son\nUhh, I show you how to do this son\nYoung don't mess with chicks in Burberry patterns\nFake Manolo boots straight from Steve Madden\nHe patterns his-self, the rap JFK\nYou wanna pass for my Jacqueline Onassis, then\nHop ya ass out that S-Class\nLay back in the Maybach, roll the best grass, I ask\nHave you in your long-legged life\nEver seen a watch surrounded by this much pink ice?\nLook but don't touch, motherfucker, think twice\n'Cause this gat that I clutch gotta little red light\nNeed a light?\n\n\n[Hook 2]\n(To smoke that la la la)\nBeanie Sigel always smoking that la la la\nMemph Bleek always smoking that la la la\nIt's the Roc, mami; sing our lullaby\nC'mon\nExcuse me miss, I'm the shit\nYou should come hang with me, basically\nHold up -- skip all the singing, let's get right tonight, mami\n\n[Verse 2]\nWe got bottles full of Arme, mamis in Manolo\nBags by Chanel or Louis Vuitton logos\nAll attracted to Hov because they know dough\nWhen they see him, whips be European\nIf you're a 10 chances you're with him\nIf you're a 5 you know you riding with them\nSick with the pen, nigga -- no physician in the world could fix him\nNo prescription you can prescribe to subside his affliction\nHe's not a sane man, he's more like Rain Man, twitching\nYou can't rain dance on his picnic\nNo Haitian voodoo, no headless chickens\nCan dead his sickness, no Ouija board\nYou can't see me, dog; nigga, ya CB4\nThis ain't Chris Rock, bitch -- it's the Roc, bitch\nAnd I'm the franchise like a Houston Rocket\nYao Ming?\n\n[Hook 3]\nStill smoking that la la la\nMemph Bleek still smoking that la la la\nBeanie Sigel, Desert Eagle the .45\nIt's the Roc, baby; sing our lullaby\nC'mon\nExcuse me miss, I'm the shit\nYou should come hang with me, basically\nHold up -- skip all the singing, let's get right tonight, mami\n\n[Verse 3]\nForget English, talk body language\nI be all over mamis like body paint is\nPink diamond necklace, strawberry wrist\nPlease excuse yourself, you're very sick\nDon't confuse me with Marbury out this bitch\nRun up on me at the light, you could lose your life\nMotherfuckers must be smoking they la la la with crack\nForty-five gun smoke, choke off that\nLet's get back to the music, I ain't with all that\nPlus the Feds tapping my music -- y'all get all that?\nI'm the public industry #1\nPublic industry #2 is my whole crew (R.O.C.!)\nNow I ain't down with who like me or who like you\nThat's gay, I ain't into liking dudes no way\nBut get a pen, I can tell you pricks my plans for the future\nI never make the news again, my man'll shoot ya\n\n[Hook 4]\nAs we smoke that la la la\nMemph Bleek still smoking that la la la\nBeanie Sigel, Desert Eagle the .45\nIt's the Roc, bitch; sing our lullaby\nC'mon\nExcuse me miss, I'm the shit\nYou should come hang with me, basically\nHold up -- skip all the singing let's get right tonight, mami", "title": "La-La-La (Excuse Me Miss Again)", "image": "https://images.genius.com/63787635bc1e2d90d4c70c0167166a42.600x600x1.jpg", "year": "2003-07-15", "album": "Blueprint 2.1"}], "artist": "JAY-Z"}