{"songs": [{"year": null, "lyrics": "[Mr. Kee]\nYeah\nHustler's theme\nWorldwide\nCome on\n\nHook: Mr. Kee\nAll money ain't good money\nStack your chips\nLet it flip like some hood money\nCock them rims\nLet 'em spin on them haters, man\nAnd all the players\nWorldwide, do your thug thang (The hustler's theme)\nAll money ain't good money\nStack your chips\nLet it flip like some hood money\nCock them rims\nLet 'em spin on them haters, man\nAnd all the players\nWorldwide, do your thug thang\n\nPre-Verse: Baby Bash\nI take a slow beat (Slow beat)\nAnd spit a hard rap (Hard rap)\nPobre, I ain't retarded, you know we off that (Off that)\nFrom the west, my brother, to the east\nBack down\nTo the diggy dirty for sherzy (What the feezy?)\n\nRepeat Pre-Verse\n\n[Verse 1: Baby Bash]\nNow I walk around like I got a rock in my sock\nWhen it's just a limb, from this money right in my pocket\nPimp\nI know you smell it cause it's gettin' you naucious\nCause the shit I'm layin' on this track is Brown as the Foxy's\nI'm the done dealer\nDon Dadda, fresh out of Guatemala\nSome say, \"Bash, you the shit\"\nIn Spanish, I'm the dada\nIt's the million dollar Mexi, the mack, God he done bless me\nGirls wanna caress me, like I'm Elvis Presley\n\nChorus: Russell Lee\nIt don't stop\nStraight to the top til the game lock\nYou know I gotta rep for my hood and my block\nStackin' up my bread, make me stand a little taller\nCollectin' my winnings without punching no Glocks\nThe game's gettin' hard, so I gotta get smarter\nWatching out for cops, cause my homies got knocked\nDrought seas in our cheer, but my pocket's ain't starvin'\nThat's why I stay chargin'\nYou know we won't stop\n\n[Verse 2: Don Cisco]\nThis is for my heavyweighters\nPullin' strings like elevators\nWhere my ops in full swing, I'll be standing on top of skyscrapers\nSeventy stories or more\nEventually the public'll\nKnow my story, fa' sho\nMake a household\nName out of Don Cisco\nGo from a hustler\nBorn and grind, tryin' to find some dough\nTo the billion dollar\nBoy club\nMexicali thug style\nI got\nMoney to get back, I'm fresh off the drug drought\nFED's couldn't stop me, head shots didn't pop me\nWouldn't lock, never got me, I'm the same player, still cocky\nBossed out\nHoppin' out of the drought\nLookin' flossed out, everything chopped, even the crop\nBelieve I'm the don, listen, everything I'm breathing on\nRepresent west side til the rider in me's dead and gone\nMe and Bash do things\nButch Cassidy, sing\nLet 'em know it's all know, the cash prestine\nCome on\n\nBridge: Butch Cassidy\nAin't nobody gonna stop me now\nI'm gonna do everything I can\nAnd ain't nobody gonna stop my flow\nYou gonna hear me from coast to coast\nBut\nSomebody's gonna make me mad\nAnd I'm a take everything they have\nSo put it all in the past\nAnd do it so quick, so fast\n\nRepeat Hook\n\n[Verse 3: Nino Brown]\nHomeboy\nI got the grid locked\nThat good yatch, gone breezes\nAnd they serve rock\nSome motherfuckers can't caught blocks\nTrey hop\nRoley bezel for you got swapped\nYou like spider monkey, Nino Brown's sasquatch\nThem little haters, they be tickling me\nBrush 'em off, like the dust, on my Stacy, homie\nOnce again, it's that motherfuckin' Mexican with attitude\nPaid my dues\nSteady, grindin' through the avenues\nDogder blue, homie\nThe city that I represent\nLos Scandulous, city where my homies did\nFuck a fed\nKeep 'em Presidential stacked up\nHear what I said, little soldiers gettin' taxed up\nBack the fuck up, move, biotch\nGet out the way\nYou know the set, holmes\nAnd my\nA. stompin'\nWalkin' in my big brown boots\nFlossin'\nStankin' eagle, that's my roots\nMotherfucker\n\nRepeat Chorus\n\n[Verse 4: Mr. Kee]\nNow put your money where your mouth is, anybody who doubt this\nWherever you see the westside, that's probably where the south is\nUnited like a gang truce, khakis pants and house shoes\nBut out in the Yay, it's throwbacks, beanies and bulletproof\nSpinners in their mouthpiece, heat up, and the old school\nFunk jump, no questions asked, ride like we supposed to\nUp in my city, see the bridge and the fall\nKnow where the place on earth to be, than where this real turn off\nI'm smashing off a side show, but money must come first\nThis ain't no overnight choice, I'm been a hustler since birth\nThey call me Mr. Kee, the Latin boss\nLatin king, Latin don\nSpittin' like the Latin play, tryin' to put his Latins on\nAnd they say money is the root of all evil\nBut there ain't nothing in this world to make me cross up my people\nI swear to God, I'll be a soldier til I'm six in the dirt\nMy Henny bottle in my casket and a fist full of words\nThe hustler's theme\n\nRepeat Chorus", "title": "Outro (The Hustler’s Theme)", "album": "Super Saucy", "image": "https://images.genius.com/3bbeca42281816def7889910eb5416f9.220x220x1.jpg"}], "artist": "Baby Bash"}