{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/026af4624fc7a5d281b93f8ccaf11259.650x650x1.jpg", "title": "God Complex", "year": null, "album": "Sunday Morning Massacres", "lyrics": "[Pulp Fiction sample]\n\"The path of the righteous man is beset on all sides by the inequities of the selfish\nAnd the tyranny of evil men\nBlessed is he who, in the name of charity and good will, shepherds the weak through the valley of the darkness\nFor he is truly his brother's keeper and the finder of lost children\nAnd I will strike down upon thee with great vengeance and furious anger\nThose who attempt to poison and destroy My brothers\nAnd you will know my name is the Lord when I lay My vengeance upon thee.\"\n\n[Killer Mike]\nHeroin flow, y'all niggas heat your spoons up\nThe cocaine speech keep the audience geeked up\nMy dope boy flow turn good girls to freak sluts\nLike crack in the 80s, the flow so crazy\nYou hit this, bitch it'll retard your baby\nThat promethazine queen got you listenin' lazy\nI'ma stimulate you bitches, drive your heart rate crazy\nNigga see the flow brutal, it dilates pupils\nSo desperate for a hit a teacher sucked off a pupil\nYou heart it right, rewind nigga, listen again\nI sent the bitch to rehab, made the kid a kingpin\nAnd ain't no 12 steppin' this, bitch hit it again!\nI deserve an indictment for the shit that I write when\nI'm high as a motherfucker, burnin' and lightin'\nI'm God, nigga, shit thunder, piss out lightning\nMy raps dirty like the piss pissed out by white men\nIn celebrity rehab, but this ain't rehab\nWhen Danny Bonaduce check out of rehab\nI'ma be right there, fat sack of crack\nSayin' first hits on me, here go a free gram\nWhite girl, white girl, Tatum O'Neal\nSuckin' dick to get a hit of that cocaine kill\nFor real, motherfucker I'm ill\nI'm dope, I'm coke, I'm the new NyQuil\nLike junkies with AIDS smokin' dope in Dixie Hills\nTurnin' tricks and suckin' dicks just to live\nMy metaphors make a motherfucker's face go \"Ew!\"\nLike stank on shit, my metaphors is real\nAnother Simpson Road saga, real life real girl\nDaughter to a degenerate dope boy named Earl\nTrap name was Squirrel\nCause all he did was chase them sluts\nIn the cuts and try to get nuts\nLike these junkie ass rappers that you pay big bucks\nThese commercial ass niggas be industry sluts\nTo get ahead they give head and take it in their butt\nBut ain't no Raz B'ing me, I'm holding my nuts\nYou too l'il for this, young'n run and get me a Dutch\nNah make it a Swisher, I'm from the SOUTH, l'il nigga\nAnd I'm fat, and I'm black and wear Polo religiously\nDope boy dress code, why you think these bitches be\nAll on me like I got a pocket full of ecstasy\nProbably cause I got me a pocket full of ecstasy\n4X's be right where the Ralph label be\nBig dick, fat, fresh nigga, label me\nI done fucked half the fine bitches in Decatur\nI got a bitch in every Zone and three strippers in Zone 3\nKing Kong heroin dick on a bitch\nShe tie her leg, tap her vein and say poke and stick\nHer best friend a dick fiend, chasing pipe dreams\nShe suck dick until her teeth showin' like crack fiends\nFuck your favorite rapper motherfucker, Mike' mean\nFuck your favorite rapper motherfucker, Mike' mean\nJust a l'il violent\nI'll see you motherfuckers next Sunday\nSunday Morning Massacre\nNext time I won't be so late, motherfuckers\nA l'il violence for your Sunday morning\nBANG! BANG! BANG!"}]}