{"songs": [{"year": "2017-03-15", "album": null, "image": "https://images.genius.com/e7e2d21e3dcab066322437f261696459.640x640x1.jpg", "title": "For Everybody", "lyrics": "[Intro]\nHey, ladies?\nHave you ever had to call one of these lil' hood rats?\nAnd... and she tried to act like...\nYou don't know who the fuck your nigga is?\nMan, these bitches done lost they mind, don't do that\nYeah, she gon' say somethin'\n\n[Verse 1]\nListen, don't hit my line\nAsking why my number in yo nigga shit (What?)\nYou wasting ya time (You just waitin' on me)\nProbably shoulda asked that nigga bitch (I did)\nProbably wouldn't fuck with that (Bitch you sound stupid)\nProbably want a bad bitch in his life\nI mean how the fuck am I suppose to know?\nI mean you said that he was yo nigga right? (And you know that!)\nCuffing is dead\nYou heard what I said, bitch cuffing is dead\nThese new niggas don't know how to act\nThey in and out of everybody (No, bright-ass)\nNever trust no nigga bitch\nAll these niggas counterfeit\nBaby girl when you gon' learn?\nThat is not yo nigga, shit (Oh yeah you know what time it is)\n\n[Chorus]\nThese niggas for everybody (Nah not mine)\nThese niggas for everybody (Bitch you for everybody)\nThese niggas for everybody (You for everybody)\nThese niggas for everybody (You for everybody)\nThese niggas for everybody\n\n[Verse 2]\nI suck and fuck when I want to (Me too)\nRun his pockets when I want (Bitch)\nRun his check up at Saks and Fifth (That's it?)\nThat's what this good pussy do (It's whack)\nCame through on dat late night\nSent fo' me first class flight (Commercial)\nFollow me might learn something\nStop trippin' might earn somethin' (Ha ha ha)\nHe won't ever love a square bitch (A square bitch?)\nBaby you gon' have to share him\nYa nigga been down with OPP\nI hate to be the one to tell ya\nI seen him in Houston with Lexis (I know her)\nWhen he leave you he gon' text me (Uh-huh)\nAnd I'ma ask him what that mouth do (But what yo mouth do?)\nI can't help it that I'm this sexy\nSee you might be able to cuff some\nBut that nigga ain't gon' be none of 'em\nSee, that nigga love him a bad bitch (Which is me!)\nAnd everybody havin' fun wit' him (That's why he wifed me)\nSee that nigga ain't no exclusive (Yes he is)\nGirl, you out here looking stupid (Bitch, you look stupid)\nI ain't being funny\nI'm just telling you that you don't know what you doing (I wanna beat this bitch ass bro!)\nThe type of nigga you pursuing\nIs the type that ain't gon' love you back (But he love me though)\nHe love what you do for him\nBut he know I ain't doin' none of that\nSee, he know I ain't having none of that\nAnd I won't ever be his wifey (But you ain't got no choice)\nWhenever you get out ya feelings bae\nYou might wanna do it just like me (Like you?)\nSee, me and my bitches don't save em (You a rat!)\nWe catch his ass and we throw it back\nBreak his ass down like a pound\nWhen I'm done you can have him back (You proud of dat, huh?)\nBitch don't play yo self ain't nothing 'bout that nigga godly (That's mine)\nHe ain't just for you, baby, he for everybody\n\n[Chorus]\n(Nah, no he ain't bitch, bitch, you for everybody) These niggas for everybody\n(Bitch, but I done let you fuck along some little bad bitch you got beside yourself) These niggas for everybody\n(Let me beat some motherfuckin' nerves up in that ass, where you at?) These niggas for everybody, these niggas for everybody\n(Lil' weak bitch) These niggas for everybody\n\n[Verse 3]\nYou say you'll never be his wifey\nAs if you ever had the option (What?)\nThe way dem titties sag\nMilk that gon' bad bitch, I promise he ain't coppin' (Girl!)\nEverybody know you boppin'\nThe whole hood know you fair play (And?!)\nThat little change that he throw yo way\nHo, I spend that shit everyday\nLet me make some shit clear\nI'm fuckin' off what you make in a year\nYou ride in Uber's, I ride in a Leer\nWe not cut from the same clothing, my dear (Yeah)\nTalking that shit but bae must I remind you?\nI am that bitch, I will pull up and find you (Pull up!)\nEverything got my name on it (Yeah)\nRing finger got his rang on it\nDon't nothing move 'til I sign shit\nYou might as well be my side bitch (Ha ha ha)\nYou probably wanna be quiet Miss\nCause I ain't never been tried, sis\nThat nigga don't even know you\nNo contact, no photos\nNever seen 'em in the daylight\nDo you know what the nigga really look like? (I don't care)\nI mean wow,  thought you were winning 'til now?\nSonin' you bitch, you my child (Nah, you ain't my mom)\nYou living foul, you need to polish up bae\nBasic shit I don't allow\nAnd that nigga about to get his too\nJust as soon as I'm done with you\n'Cause them other niggas might be for everybody but\nI'm who that motherfucker belong to (He for everybody)\nSo get it right bitch, I'm wife bitch\nAnd can't nun of y'all hoes replace me\nYou proud to be this nigga cumrag?\nHo, you down bad and you crazy\nGon' knuckle up cause I'll fight for mines\nYo pussy petty, you wasting time\nYou seasonal, part time\nYou get fucked up fuckin' with mine you lil' bitch\n(Okay Keisha!)"}], "artist": "Kash Doll"}