{"songs": [{"lyrics": "[Verse One]\nMy sister can't afford me and there ain't no other way\nI need to find a place to stay or make my pennies in a harder way\nI'm on 19, turnin' 20 in months\nWith all that stress on my chest, I need to puff on some blunts\nNow I'm on the job hunt to put the food on my plate\nI gotta get this APC but all I G.E.T. is section 8\nChecks from unemployment with assistance from the public\nThe way I'm falling down, it's like my life is almost done with\nThe way my confidence died, it kinda makes me teary eyed\nThe easy life I was denied, now I'm breaking down inside\nNowhere to hide, but my life I gotta run\nWith all these problems on my shoulders and they weigh out to a ton\nYeah I used to dream, now I'm runnin' from a nightmare\nI used to have goals but now it seems like it was never there\nNo one's aware of my silent cry for help\nThey tend to walk on by and let it ride and go all out for delf\nI was put here, now I'm gonna leave here\nDidn't ask for struggle and I didn't ask to be here\nAnd my situation? Some people thinkin' suicide I'm contemplating\nIt's the time that I'm wasting\nOn the run with devil's chasin'\n\n[Hook]\n\"Fallen\" - Busta Rhymes\n\"My life, my life, my life, my life\" Mary J. Blige 'My Life'\n\"Fallen\"\n\"Cause in my physical I can't express through songs\" - Nas 'It Ain't Hard To Tell'\n\n[Verse Two]\nI'm slowly slipping through the cracks of this society\nThey said I'm gonna make it now I'm thinkin' that they lied to me\nI'm in the race I never win cause in this world there ain't no finish line\nCause there's only time to shine then your life turns to a flat line\nFor me to get mine, is like a never ending story\nCause I'll never start to get it so there would be nothing for me\nGot nothing but experience upon my resume\nBut I never understood why I never got a decent pay\nI bust my ass, I even went away for class\nFor all the A to Z's I had in life, one on one I couldn't pass\nI guzzle down the Crooked Eye, inhale the lah\nBefore I get my wings and fly, I'm gonna cut me out a piece of pie\nAll I have is crumbs, I wanna multiply my sums\nBy the time my day will come I might be shaking hands with God's son\nMy life is in the hole and I keep on falling\nDeeper in a ditch, I cry for help, nobody hears me calling\nIt's a cold cold world, I wasn't born with a coat\nAll I ever had was hope and all them rhymes that I wrote\nSo through the walks in my life I'm going out for a stroll\nTo put it simple and plain, it's just my life in the hole\n\n[Hook]", "title": "Fallen", "image": "https://images.genius.com/b32e74d81cb12ffdcc5c3dd2c75161d4.700x700x1.jpg", "album": "Dream Merchant, Vol. 1", "year": "2005-01-14"}], "artist": "9th Wonder"}