{"songs": [{"album": "King", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg", "year": "2006-03-28", "title": "Goodlife", "lyrics": "[Hook: T.I. & Pharrell]\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\n\n[Verse 1: T.I.]\nI was born into poverty raised in the sewage\nStreets will always would be a part of me, they made me the truest\nAnd even when my days wasn't the bluest\nI never ran from adversity, instead I ran to it\nFear ain't in the heart of me, I learned \"just do it\"\nYou get courage from your fears right after you go through it\nNow I come through in a Coupe on 22's\nThat ain't bad for a nigga who ain't even finish school\nDon't get me wrong I ain't never been a fool\nI just put off graduating for a pair of tennis shoes\nI used to use the beats to paint my pain\nBut nowadays man I can't complain\nI got several automobiles and they all on them thangs\nSeveral solitaires and they all in one chain\nThey used to see me in the mall, I'm the same\nAnd gettin brains from a couple of broads on the plane\n\n[Hook: T.I. & Pharrell]\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\n\n[Verse 2: Common]\nI come from Chi-Town lost and found in the struggle\nWhere dudes say \"stay safe\" and \"say out of trouble\"\nSpeakers muffled, the law and BMs try to cuff you\nThose with duffles move weight and have muscle\nI dug through the dirt with a verse for the people\nOpen up for Daddy Kane and Eazy at the Regal\nThe radio rarely put their needle on my record\nThey ain't see how the hood and heaven were connected\nSounds projected, ain't show how effective\nLessons learned, sessions turned to life reflected\nAnd everything I found real in life, yo I kept it\nThey say life's a teacher, you're gonna get tested\nWhen a nigga changed they kept saying \"that nigga strange\"\nThey couldn't see how my mind on bigger things\nAhead of my time now I caught up with the game\nMaking good music, making paper, making change\nAnd it's good\n\n[Hook: T.I. & Pharrell]\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\n\n[Verse 3: T.I.]\nGasoline drawers, I stood in the fire\nWith enough heat to set the hood on fire\nMan you niggas think Suge was off the wire\nYou should've seen the squad before I had Messiah\nWe assumed the title as the number one supplier\nFelt like I was selling blow since I was in diapers\nAnd we wish a nigga would come try us\nWe was cool with the killers, best friends with the lifers\nQuick to up and scrap if a nigga wanna to deny\nFor what we considered then a lucrative empire\nBut like that pimping time flash by you\nNow I wonder what the judge think as he reading my priors\n'Cause prisons ain't full and the reaper ain't bias\nAnybody telling ya different's a damn liar\nGave the jail hell and shot birds at the hearse\nLived through worse and reversed the curse\n\n[Hook: T.I. & Pharrell]\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI keep telling myself \"Man, I'm living the good life\"\nI'm living the good life\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world\nI'm on top of the world"}], "artist": "T.I."}