{"songs": [{"lyrics": "[Intro]\nKeep in mind this flow is used for practice\nEven so still top choice off the track-list\nFar as I know we've been blacklist\nFor as long as the earth rotate on a 23 degree axis\n\n[Verse 1: MF Doom]\nI can stop any time I want to\nFamous last words that came back to haunt you\nAll your life, like permanent dried tears\nSome cats get it like no bright ideas\nHe broke the record then bowed\nSaid he couldn't do it without the crowd, for crying out loud\nEven took the time to contaminate the rhyme scene\nAnd drop a lot before he was out, in the time machine\nA lot of rappers are drama queens (buddy dutty ?)\nWhen they come to the mic, I'm a feel ya's. (buddy buddy ?)\nFuck around and get your title took, cut and dry\nHe doesn't lie, even like who and where, what and why?\n\nHold it like a cue a button, button fly (boom boom) (?)\nOnce they leave the room, they be like, Doom! Doom! Doom!\nIt's no use. Blessed to design\nAnd the villain has left the building, dressed to the nines\nLike, I'ma do mine. Ya'll do yours\nHe stay reppin' the game like Lou Rawls\nThe super MF villain, feelin' like two balls\nFor the microphone, he joins like two falls. (?)\nWell we'll see after these criminals who falls\nA lot of ya'll is reminiscent of Rupaul\nBall to ball and we'll be needing new drawers\nDrawers, the one-twos that run through walls\n\nKeep in mind this flow is used for practice\nEven so still top choice off the track-list\nFar as I know we've been blacklist\nFor as long as the earth rotate on a 23 degree axis\n\n[Verse 2: Aesop Rock]\nAll in it together now\nSome of the misadventures of a father crop\nMy provider chop's flashin'\nSee, I'm a stop that gut reaction\nBound to tackles when a battle runs in circles\nLike rodeo clowns with paddles\nPoked in the belly by petty sarcasm\nGentlemen, start your laugh tracks\nPush pins for the lab rat breed\nAll I wanna be is a fat cat sleeping 40 nights (nights)\nIn hopes that when I rise\nThe hacker mass will have seen there's more to life\nLet's recreate a perfect service rooted in labor lust\nAnd a discipline prisoner\nI don't work a thick antithesis\nParallel park your burning prod adjacent\nTo the flagrant iron ego valve\nLet us study a weaker outlet\nI found peace (I found peace)\nI found peace, it tap me on the shoulder\nAsking where's the closest war and how to make it sleep\nI pointed toward the exact place my sneakers met the credence\nSaid If I could answer questions (who), I would be relief\nNow classify don't got em shook by exposing the skeletons\nYeah I sorta stick to a more murky-hurt development\nSome of these kids are spittin' just a bit too delicate a thesis\nIf only Yeah, but holy jumpin' Jesus!\nI get torn swiftly from a planet while it tilts, 23\nLook buddy, we've gotta talk\nGod made me a fine instrument of style\nZig zag zisfiss?\nDon't make me holy sleep bolts blindly until your mood shifts\nNow here comes 40 acres of congruence pistons\nPurple skeleton key immunity systems\nAw, it'll be something incredible\nSee, I know the limit\nThat's why I do my best to stay quiet\nWhenever I ain't spittin' the gimmick\n\nKeep in mind this flow is used for practice\nEven so still top choice off the track-list\nFar as I know we've been blacklist\nFor as long as the earth rotate on a 23 degree axis", "title": "Black List", "album": "Vocal Studies + Uprock Narratives", "image": "https://images.genius.com/87ab49ac27ab0f52de3fd83fd66ca760.700x700x1.jpg", "year": "2001-06-11"}], "artist": "Aesop Rock"}