{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/54f9deaabb5422c3c966f58fecec24c7.600x600x1.jpg", "title": "La Raza (Cantina Mix)", "year": "1990-07-10", "album": "Hispanic Causing Panic", "lyrics": "Hey homie, I'm getting tired of dudes just getting over la Raza\nYeah, this is for the Raza\nYeah, this is for the Raza\nYeah, this is for the Raza\n\n[Verse 1: Kid Frost]\nQ-Vo, aqui estoy, MC Kid Frost\nYo soy jefe, maton, yes the Big Boss\nMy cuete's loaded, it's full of balas\nI put it in your face and you won't say nada\nVatos, cholos, you call us what you will\nYou say we are assassins an we are sent to kill\nIt's in my blood to be an Aztec Warrior\nGo to any extreme and hold no barriers\nChicano and I'm Brown and I'm proud\nGuantes, chingazos, simon tu sabes, get down\nRight now, in the dirt\nWhat's the matter? You afraid you're gonna get hurt?\nI'm with my homeboys, my camaradas\nKicking back millaje, y pa mi no vale nada\nYo soy chingon ese, like Al Capone ese\nControlo a todos solo never try to swept me\nSome of you don't know what's happening que pasa\nIt's not for you anyway, cause this is for the Raza\n\n[Chorus: Kid Frost]\nThis for La Raza, Raza\nThis for La Raza, Raza\n\n[Verse 2: Kid Frost]\nThe form I'm speaking is known as Calo\nY sabes que loco? Yo soy muy malo\nTu no sabes nada y yo vienes halo\nBeen hit in the head too many times with the palos\nStill you trying to act cool, but you should know\nYou're so cool that I'ma call you a culo\nYou're just a pee wee, you can't get it ever\nYou're a leva\nYour own barrio doesn't back you up\nThey just look at your ass and call you a poolbutt\nAnd so I look and I laugh and say que pasa\nYeah, this is for the Raza\n\nHey homie, I'm getting tired of dudes just getting over la Raza\n\n[Verse 3: Kid Frost]\nCruising in the calle, headed for the volo\nNo want to go with me, so I had to go solo\nAnd when I go out alone I'm packed\nI touch all that chavalas when they know that I'm strapped\nEverytime that I pack my piece\nI pull it out quick all the nonsense desease\nJust like the song when you're 18 With A Bullet\nGot my finger on a trigger, I'm not afraid to pull it\nIf it gets out of hand I know some mafiosos\nQuick to pull out cuetes on some stupid ass baboso\nSitting there wondering what's happened, que pasa\nYeah, this is for the Raza\n\n[Chorus: Kid Frost]\nThis for La Raza, Raza\nThis for La Raza, Raza"}]}