{"songs": [{"year": "2016-10-27", "title": "Bucket List", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Verse 1: Saba]\n(Huh!)\nSkydiving, hoping my pilot land and my 'chute is good\nAnd my show went well and my cheque about to go to the hood\nIf I die before I can make change, 'least I made a tape\nAnd I pray someday you're inspired by it and make your way, look\nIt's some legends gone so I'm paying homage, they paved the way\nAnd them stars aligned, I know they be on, I bet they in space\nI might buy a trailer, we taking this bitch across the states (Sab!)\nAll aboard, it's just like the Green Line, we finally off the train\nSole heir to the booth, you can let the fans take a vote\nGet the bread, then take a loaf\nI just put the work in then take a load, off\nGotta butter bread like some toast\nWrote a bucket list and approached\nThen they said that one, like my last one\nAnd they been waiting since my last one and look what happened, yeah, ay\n'Cause I mean it, if I doubt it, then I did it\nIf I caught it, then I dish it, how I started, how I finish\nShow a hater, that impossible's what we major\nI cross another one off that paper, 'cause I don't believe in that caper\n\n[Hook: Saba]\nAy, I come from the bottom but a nigga feeling grateful\nMy life wasn't fatal, swear I must got angels\nI know that the sun'll come up any time the rain go\nI been in the rain though, they said what I can't do\nI come from the bottom but a nigga feeling grateful\nMy life wasn't fatal, swear I must got angels\nI know that the sun'll come up any time the rain go\nI been in the rain though, they said what I can't do\n(Huh!)\n\n[Verse 2: Saba]\nI'm mountain climbing that's never seen on this part of town\nHot air balloon on my wedding day getting off the ground\nIf I'm back at school, shit I'll commute maybe try to dorm\nJust wrote a book on how not to fit into social norms\nI ain't never smoke, fuck it? Why not? Guess I'm trying pot\nMight just say, \"Fuck it,\" get my hair cut and say bye to locks\nYeah, yeah, this for all of my hood homies\nFuck, give in, it feel good don't it\nLook at all the shit you accomplished\n\n[Bridge: Saba]\nHeard money make the world go round\nThirsty for it, hope you don't drown\nI believe it, do not doubt\nHead high, no, not down (Sab!)\nYeah, thinking outside them squares\nWhole world know what it is\nScratching off my bucket list\n\n[Hook: Saba]\nAy, I come from the bottom but a nigga feeling grateful\nMy life wasn't fatal, swear I must got angels\nI know that the sun'll come up any time the rain go\nI been in the rain though, they said what I can't do\nI come from the bottom but a nigga feeling grateful\nMy life wasn't fatal, swear I must got angels\nI know that the sun'll come up any time the rain go\nI been in the rain though, they said what I can't do (Oh!)\n\n[Outro: Matthew Santos]\nI got a gift to give\nJust like this life we're living\nOnly a flash across the sky\nJust an increment of time\nWhat will you do with yours? Oh\nI know what to do with mine\nEven when the lights go out\nStill they never die\n\n[Skit]\nHmm, alright, I knew you was gonna hit me up or whatever 'cause I know you miss me. You already know who this is. It's your ex or whatever. I ain't finna' say my name for these thirsty ass b-(bleep) but I'm gon' give you my bucket list and it consists of beating your motherf-(bleep) ass, fina-fucking-lly, with your ugly ass", "album": "Bucket List Project"}], "artist": "Saba"}