{"artist": "C-Rayz Walz", "songs": [{"title": "Fuck the Mayor", "album": "The Prelude", "year": "1999-12-31", "image": "https://images.genius.com/ec963359d22a35a29c442701ff7a7d34.500x500x1.jpg", "lyrics": "[Intro: Skit]\n[Officer]\nHey buddy, got any weapons here?  Hey, what’s that on your hip?  Hey, let me check that\n[Civilian]\nYo man, that ain’t no fucking gun.  That’s my beeper.  Get the fuck out of here, man\n[Officer]\nHey, hey, what’s that, what’s that?  The brick fist gang?\n[Civilian]\nThis ain’t no gang symbol.  It’s a Stronghold t-shirt, you dickhead!\n[Officer]\nHey, hey buddy, wanna [?] me?\n[Civilian]\nWhat you, what you gon’ do?  Arrest me?  Come on\n[Officer]\nHey, hey, come here.  Officer requesting backup.  Officer requesting backup.  Officer requesting backup\n\n[C-Rayz Walz Talking over Skit]\nFuck them niggas\nLike a hundred niggas right there.  Stronghold, OBS, People’s Army.  I’ll kill y’all niggas.  Fuck Rudy\n\n[Verse 1: C-Rayz Walz]\nI wrote this one blunted.  Get that bitch in Gracie Mansion hunted\nNY, do or die.  Who done it?\nBlue suits coming?  Fuck that—I ain’t running\nOn point, shooting sharp shit like ninja gunmen\nSlugs for Uhuru.  STD niggas is voodoo\nUs against the pigs something brutal—nothing neutral\nFuck what you used to.  Rudy wanna swing ya from trees\nWith the noose loop for a deuce deuce\nBlocks is hot, politics this dragon breathes\nGet a nigga 25 to life for a bag of weed\nThey ain’t catching me.  Cappadonna said, “Run”\nI hold knife-sized guns and sell branch until I’m done\nLike stic.man, rolling out for dead presidents\nStill know the plan of the hit man.  Evidence:\nThe blue van.  On some bullshit like a tourist\nI got the eye of the tiger like Horace in the jungle fortress\nUndercover cops think they Bruce Willis on some fake shit\nBut I’m Keanu Reeves in the Matrix\nQuick to run with speed through a building basement\nBeats got my heart racing\nGiuliani think it’s mad niggas in the street that need replacing, long vacation\nI’m saying, “Hold up.”  They roll up, my shots make ‘em leak donuts\nClip bombs in the precinct frequent\nStations are like the phoenix when I’m done creeping\nOn the D train, I see flames like “Douse him”\nFuck hell—jog through Central Park\nCatch you while they can’t tell I hold clips.  TNT patrolling my dick\nI’ll blame it on Judy ‘cause he put out the hit\nFucking faggot.  Made my hustle hard\nCan’t even swipe [?] with my metro card\nFucking transvestite.  Yo, where you dressing your wig at?\nIf that bitch get shot, bet green money I did that\n‘Cause police smoke crack.  Even rats carry gats\nRacism relax where I’m at\nDrinking malt liquor.  Push ups in the slum\nAll my niggas act dumb and get smart when cops come\nThey think they musketeers with shotguns\nFuck a badge number—this summer, I’m grudge-thirst with mad hunger\nRevenge for my black ass without the plunger\n41 shots?  I send 82 drama-full\nTo kill Rudy Giu—rest in peace Amadou\nFuck the mayor!"}]}