{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/0abd3b30926dd397c70dd83eb3d0524a.500x500x1.jpg", "title": "Popped Off", "year": "2017-06-02", "album": "Return of the Don", "lyrics": "[Chorus]\nYou wanna get it popped off?\nYou wanna get it popped off?\nY'all wanna get it popped off?\nY'all wanna get it popped off?\nYou wanna get it popped off?\nYou wanna get it popped off?\nYou can bop your head to it or get it popped off\n\n[Verse 1: Kool G Rap]\nYeah the clique got niggas with names\nAnd they pitstop to get at your dame\nAnd if you riff pop I'll spit at your frame\nDon't get it mixed up just get it arranged\nYou gonna need a syringe and a needle to get it in vein\nKeep them wolves on his back like he Grizzly Adams\nI get rejected by a chick I throw my whiskey at 'em\nYour best friend will curse you out like, \"bitch you had him\"\nAnd he right the lights is low and the ice is still blowin'\nAnd he got a whole waist of big faces like Samoans\nChest piece like I got stoned by the Romans\nAnd don't try to keep up if your money Gary Coleman\nNothing but Sprewell, V12's yeah what else?\nBe still stuck with that V8 what you tryna stay healthy?\nKeep the cost of your whip, I blow them chips out in L.V\nFar as brick spots more ki's passed than Dell, B\nAnd G Rap lost? He falling off as soon as hell freeze\n\n[Chorus]\nYou wanna get it popped off?\nYou wanna get it popped off?\nY'all wanna get it popped off?\nY'all wanna get it popped off?\nYou wanna get it popped off?\nYou wanna get it popped off?\nYou can bop your head to it or get it popped off\n\n[Verse 2: Sean Price]\nConcealing my lines\nUnappealing at times\nCan't rap worth a damn\nFam I really can rhyme\nShot to your temple\nPuss pour, pop at your pimple\nIndeed the G-shock with the watch, presidential\nGoofs and bagoons\nBitches got balloons in their wombs\nLiterally shitting bricks in their Fruit of the Looms\nThug in his essence\nDrug is the preference\nBitch, the mother, father, sister, brother, love is the message\nP, a primate in his prime\nThink of violating the ape, ape be changing your mind\nThe fellow saw dumb shit\nFuck cops that popped at Eleanor Bumpers\nI came to lean haters\nFaggot ass church niggas and tambourine players\nRuck thuggin' machine\nYou a nothin' butt plugin' and nut huggin' your jeans\n\n[Chorus]\nYou wanna get it popped off?\nYou wanna get it popped off?\nY'all wanna get it popped off?\nY'all wanna get it popped off?\nYou wanna get it popped off?\nYou wanna get it popped off?\nYou can bob your head to it or get it popped off\n\n[Verse 3: Randsom]\nCould care less about your shooters and street respect, you still a wreck\nThis killer strapped, two guns smoking big as Gorilla Black\nShit is facts, I don't do fantasy when the hammer squeeze\nGreen thumb D1 gun rose and plant your seeds\nGet it popped off in a second, I don't plan to freeze\nToo Legit, tool'll spit, got 'em shaking like Hammer's knees\nWhat you niggas know about murders, that you did yourself\nRed dot, headshot, body drop and shit itself\nI flip scripts and spit out a motion picture\nI'm Scorsese they all hate me, I'm poured liquor\nYou poor baby, I court Lacy and owe your sister\nThe whore made me get all crazy, I know you miss her\nI blaze first then ask questions, who want the interview?\nI'll send a few, causing a racket, blow off his tennis shoes\nSo make way for the bad guy\nIf I'm masked out best believe I'll make your ass die\n\n[Chorus]\nYou wanna get it popped off?\nYou wanna get it popped off?\nY'all wanna get it popped off?\nY'all wanna get it popped off?\nYou wanna get it popped off?\nYou wanna get it popped off?\nYou can bop your head to it or get it popped off\nYou wanna get it popped off?\nYou wanna get it popped off?\nY'all wanna get it popped off?\nY'all wanna get it popped off?\nYou wanna get it popped off?\nYou wanna get it popped off?\nYou can bop your head to it or get it popped off"}]}