{"songs": [{"image": "https://images.genius.com/134aec1024a9790ac74d7383124949f3.800x800x1.jpg", "title": "Beautiful", "album": "Moments ", "year": "2010-11-29", "lyrics": "[Chorus]\nThere she goes\nShe's so beautiful, she's so beautiful, yeah\nBut she's so broke\nShe's so incredible, wonder if she'll ever know, yeah, oh\n\n[Verse 1]\nShe lays in her bedroom and she cries\nYeah she cries (Whoa)\nAnd she feels depressed as tears fall from her eyes\nFrom her eyes (Whoa)\nAll she wants is love, but she never finds it\nIn herself (Whoa)\nAnd she just feels broken, I can tell that she's hopeless\nLooking for help (Whoa)\n\n[Chorus]\nAnd there she goes\nShe's so beautiful, she's so beautiful (Whoa)\nBut she's so broke\nShe's so incredible, I wonder if she'll ever know (Whoa)\n\n[Verse 2]\nShe gets attention from every direction\nBut she doesn't care (Whoa)\nShe prays for protection, scared of rejection\nIs anyone there? (Whoa)\nShe used to laugh, but now she's crying\nSick of the pain (Whoa)\nShe puts on her mask, pretends, and she acts\nLike she's okay (Whoa)\n\n[Chorus]\nAnd there she goes\nShe's so beautiful, she's so beautiful (Whoa)\nBut she's so broke\nShe's so incredible, I wonder if she'll ever know (Whoa)\n\n[Verse 3]\nThere she goes again, putting on that fake act\nHard to see the real her when she got that fake mask\nDaddy left it, he ain't never came back\nTears her apart but, she would never say that\nShe wants love, but don't know where to get it from\nIt's hard to learn respect from a man that never gave her none\nSo she cries and she yelling in the mirror\n\"Is anybody out there? Does anybody care?\"\nAnd people think they know her, but they don't really have a clue\nWorking three jobs, yeah she's doing what she have to do\nGetting stressed out, and boys say she's beautiful\nBut that don't really mean a thing if she don't believe it though\nInsecurity starting to take over\nShe looking for warmness but keeps getting colder\nYeah, I know ya tripping on your looks and such\nBut quit looking to world, and start looking up\nGod made you beautiful\n\n[Chorus]\nAnd there she goes\nShe's so beautiful, she's so beautiful (Whoa)\nBut she's so broke\nShe's so incredible, I wonder if she'll ever know (Whoa)"}], "artist": "NF"}