{"artist": "Ant Banks", "songs": [{"title": "Stragglas", "image": "https://s3.amazonaws.com/rapgenius/58573415.jpg", "album": null, "lyrics": "{*belch*} Ahhhh.. Trademark..\nYeah, for all you stragglers out there, y'know?\nKev-Deezy (whassup?)\n\n[Verse One]\nLet's talk about these stragglers (stragglers)\nYou know motherfuckers that always claim they down\nOnly come around when they need you\nWhen you need them they ain't nowhere to be found (nope)\nYou know stragglers, fake motherfuckers, lie to kick it\nAlways talkin about what they fin' to do, fin' to get\nRunnin their mouth all the time when they ain't fin' to do shit (mm-mm)\nStragglers mayn, bitch made from the start\nHarder than the motherfuckin Tin Man but still ain't got no heart\nJust some stragglers, strugglers, mean-muggers I suppose\nAlways wanna borrow some shit\nWith a big ol' green booger hangin out they nose (uggh!)\nThe stragglin, broke-ass little po' pimp\nTalkin about he was supposed to been on tour\nBack stage with $hort and them\nStragglers mayn! Man you know them motherfuckers hate us\nSo stay away from they ass cause them niggas is contagious!\n\n[Verse Two]\nYou know they scragglers\nYou know the ones that's always claimin they got the hook up\nBut when shit gets faulty the motherfucker's standin around shook up\nScragglers man, you know! Hoes always want a back stage pass\nBut the bitch ain't talkin about, givin up no ass\nScragglers, the ones who says they is but they ain't\nAnd the first one in the club hollerin, \"HEY! Will you buy me a drink?\"\nUhh, scragglers I just call 'em how I SEE\nBaby wanna be yo' friend tonight cause she see you parlayin in the VIP!\nScragglers, Rolexes laced with diamonds, Lexus filled with timahs\nAs we arrive, gotta mash the lamers; \"Kevin, can I drive?\"\nScragglers, the one who always has a problem wants you to fix it\nThen they find out y'all got a show tonight - can we have some tickets?\nScragglers, whether it's in the NBA, NFL, rap or R&B\nYou got scragglers, even Marvin Hagler had some scragglers\nScragglers man, you know you can't win and you damn sho' can't fight it\nEven I done fucked around and caught some scragg-itis\n\n[Hook]\nSTRAGGLERS!\n(You can break 'em and fake 'em take 'em but just can't shake 'em)\nSTRAGGLERS! (Stragglers!) Stragglers, Stragglers (That's right)\nSTRAGGLERS! (Mmm)\n(You can break 'em and fake 'em take 'em but just can't shake 'em)\nSTRAGGLERS! (Stragglers!) Stragglers, Stragglers\n\n[Verse Three]\nYou know them stragglers man\nMotherfuckers that's always tryin to get what you got\nSame car, same clothes, same hoes\nAnd always tryin to hang out at yo' spot\nJust stragglin mayn, all up in a nigga face tryin to be cool\nSteady lyin to motherfuckers tellin 'em y'all potnahs from the ol'skool\n\nScragglers, I hate the ones that act like they got psychic powers\nYou know voodoo\nMotherfuckers always findin out and knowin shit about you before you do\nScragglers, you know the ones who always askin for this and that\nThe bad part about is she never the super fine chick\nIt's a two dollar HOOD RAT\n\nStragglers mayn (stragglers mayn) all up in a nigga grilled cheese\n(mm-hmm) Tryin to fuck with these real G's! (that's right)\nStragglin mayn, motherfuckers that's always tryin to be up in yo' mix\nTryin to find out what ho you fuckin\nSo they can get it back to yo' main bitch\n\nScragglers, I'm convinced these fools just might take over\nLast night I seen a scraggler drivin somebody's Range Rover\nScragglers man this shit is gettin kinda crazy\nI think the last broad I was with was mixed with black and scragnazzy!\n\n[Hook]\n\n[Verse Four]\n{*belch*} Mmm! Stragglers mayn! (stragglers mayn) You know\nThe motherfuckers that always come around and listen to yo' shit\nThen two weeks later they got some shit sound just like it!\nJust stragglin mayn, they're always tryin to get some shit for cheap\nCome around talkin about Banks I got two G's can I get a piece?\n\nScragglers man y'know the one who always walk around act like they ki'd\nBut when you pull out your joint they wanna hit yo' weed?\nScragglers man, y'all know y'all JESUS in your life\nYou niggas need to stop smokin on that GLASS pipe\n\n{*belch*} You know them stragglers man (that's right)\nThe motherfuckers that's always comin around poppin they collar\nWalkin on solid ground get knocked the fuck down\nFor thinkin they too good to holla (mm)\nJust stragglin man (just stragglin man)\nAlways talkin about the bitches they be taggin man (taggin man)\nMost of them niggas is in denial, straight saggin man\n\nAlways in YO' face, when you up in THE place\nBut they scared to see how yo' DICK taste\nScragglers man, these hoes just won't give up\nNine times out of ten these hoes out to scag and not to fuck!\n\n[Hook]\n\nAight, that's it", "year": null}]}