{"songs": [{"image": "https://images.genius.com/473015f3e66b12723dfc053e408b3718.600x600x1.png", "title": "Boss Ass Bitch (Remix)", "album": null, "year": "2013-12-30", "lyrics": "[Chorus 1]\nI'm a boss-ass bitch, bitch, bitch, bitch, bitch, bitch, bitch\nI'm a boss-ass bitch, bitch, bitch, bitch, bitch, bitch, bitch\nI'm a boss-ass bitch, bitch, bitch, bitch, bitch, bitch, bitch\nI'm a boss-ass bitch, bitch, bitch, bitch, bitch, bitch, bitch\nI'm a boss-ass...\n\n[Verse 1]\nYo, I employ these niggas\nThey be grown men, but I Little Boy these niggas\nWant the cookie, so I gotta Chips Ahoy! These niggas\nBut I never iPhone, Android, these niggas\nUse rubbers with 'em, I don't ever raw, these niggas\nMore money than 'em, I'ma son all, these niggas\nI ain't shoppin', but it's like I gotta store, these niggas\nPut 'em on time out, and never call, these niggas\nPussy like girls; damn, is my pussy gay?\nIt's a holiday: Play-With-My-Pussy Day\n\"Pussy this, pussy that, pussy taken\"\nPussy ride dick, like she a Jamaican\nPussy stay warm, pussy on vacation\nYou loose bitches, need a pussy renovation\nYou could eat it, with a pussy reservation\nPussy 'bout to get, a standin' ovation\nClap, clap-clap for this pussy, nigga\nBut I can't give this pussy, to a pussy nigga\nAw man, slow down\nI'ma get you something that you could hold down\nBut I can't give you head, I'm too ill for that\nI'ma  make a movie still, Kill Bill for that\nCause what the fuck, this ain't Chanel, nigga? Custom done!?\nWhat the fuck, I ain't smokin' hot? Bust me down!?\nYou the same clown nigga, that was runnin' me down!?\nNow you all up in the sauce, cause you wanna be down!?\nI said, \"Rule Number 1: To Be A Boss-Ass Bitch\"\nNever let a clown nigga, try to play you\nIf he play you, then \"Rule number 2:  -\nFuck his best friends, then make 'em 'yes' men\"\nAnd get a dick pic, and then you press \"Send\"\nAnd send a red heart, and send a kissy face\nAnd tell him that his friends, love how your pussy taste\nAnd that's rule 3: I'm the school T\nMy wrist look like, I am a jewel thief\nBut that's just 'cause I am a boss bitch\nNow macaroni cheese, and grill my swordfish\n\n[Chorus 2]\n(Bitch, bitch, bitch, bitch, bitch, bitch, bitch, I'M A BOSS ASS) -\nBitch, bitch, bitch, bitch, bitch, bitch, bitch, I'm a boss-ass  -\nBitch, bitch, bitch, bitch, bitch, bitch, bitch, if-if-if-if-if-if-if-if -\n\n[Verse 2]\nIf he catch my drift, he could catch my jizz\nI be out in Cali, runnin' all my businesses\nI be out in Cali, watchin' back my Christmas vids\nEvery time I fuck 'em, yes, I tell him \"This is his\"\nLooked down at it, and I said, \"This is big!\"\nMan, my game so cold I said, \"This is rigged\"\nBest flow in the game, this is not a lie\nTell 'em bitches, cross their T's and dot their I\nI-I-I-I-I-I- I came back, bitches' flows still boring\nI said, \"Damn, man, go back to whoring\"\nYou know I still lead the league, in scoring -\nYou know I'm still bad, and I'm still foreign\nI'ma give bitches, time to get hot\nChill out at the game, New York, Knickerbock\nIf they actually got bars, they could rock\nBut if not, I'ma destroy chicks a lot, OH -\nBut on the real, I'm in album mode\nI just dropped this freestyle, 'fore these files get old\nWhen I lay low, bitches be safe and sound\nWhen I come back, they better not make a sound\n\n[Interlude]\nI hear you...\nWhen I'm back on the prowl\nYou bitches better have my money\nCause I'm comin' for you\nOoh, ooh...\n\n[Bridge]\nUh, okay, I order rich bitch sauce\nRich bitch cold, got a rich bitch cough\nWhich bitch want it? I go rich bitch off\nCause you know my style gettin' bit, ripped-off\nWhen I'm at the restaurant: rich bitch sauce\nRich bitch cold, I got a rich bitch cough\nWhich bitch want it? I go rich bitch off\nAnd you know my style gettin' bit, ripped-off\nOff! Off! Off! Off! Off! Off! Off!\nI'm a bo-I'm a boss\n\n[Outro]\nAsk Lil Wayne who the five-star bitch is\nAsk Lil Wayne who the five-star bitch is\nAsk Lil Wayne, ask Lil Wayne\nAsk Lil Wayne who the five-star bitch is\nAsk Birdman who the five-star bitch is\nAsk Young Money who the five-star bitch is\nWho the five-star bitch is, who the five-star bitch is\nAsk Birdman who the five-star bitch is\nAsk Lil Wayne, ask Lil Wayne\nAsk Lil Wayne who the five-star bitch is"}], "artist": "Nicki Minaj"}