{"songs": [{"lyrics": "[Intro: VladTV & Asian Doll]\nOkay, so you got a single mom with four kids, the, you know, the father just went to jail, I can imagine that being pretty tough\nYeah that shit was crazy, it was real crazy but it made me who I am\nAye, yeah!\n\n[Refrain]\nDeep up in these streets, I was hanging with them drug dealers\nIt was me and Dreanesha, we had two slugs with us\nThuggin, I came from nothing, I hung with drug dealers\nYou can’t take away my heart, it ain’t no love in it\nLet me tell you ‘bout some real shit\nI had a deal, but I ain’t wanna have to split shit\nBy December, set a goal, and that’s to get rich\nI ain’t got no friends, but it’s okay, I got a Mill sitting\n\n[Verse 1]\nTalking to my brother, from a jail cell\nI heard the police tell him hang up, you ain’t got no mail\nAny nigga disrespect my mother, going to hell\nI ain’t posting, with no nigga loving, niggas frail\nBitches sucking, snitching disrespecting, other misses\nYou ain’t in my lane, bitch you can’t sit up in my breeches\nTalking like you tough, saw you in person, you ain’t with it\nCrunching on these bitches, chocolate glizzed on the kitty\n\n[Pre-Hook]\nCrunching on these bitches, I got hundreds, throwing fifties\nCrunching on these bitches, you a hoe, just go and admit it\nCrunching on these bitches, heavy weight,  you ain’t even fitted\nCrunching on these bitches, fix your face and fix your titties\n\n[Hook]\nCrunch time, crunch time, crunch time\nCrunch time, crunch time, crunch time\nCrunch time, crunch time, crunch time\nCrunch time, crunch time\n\n[Verse 2]\nRich nigga where that bag, wanna orgy with bitches\nLast nigga, went out bad, he a hoe\nSpot you like a hawk and put your nose up on the scope\nIf you want some smoke I got a hookah, let it blow\nBitch!\n\n[Refrain]\nDeep up in these streets, I was hanging with them drug dealers\nIt was me and dreanesha, we had two slugs with us\nThuggin, I came from nothing, I hung with drug dealers\nYou can’t take away my heart, it ain’t no love in it\nLet me tell you ‘bout some real shit\nI had a deal, but I ain’t wanna have to split shit\nBy December, set a goal, and that’s to get rich\nI ain’t got no friends, but it’s okay, I got a Mill sitting\n\n[Verse 3]\nIf the world against me, who gon’ hold my shoulder?\nIf I wasn’t the doll would you stay down until it’s over?\nNiggas love the moment, different person when they sober\nPussy so good, know he miss it but it’s over\nAnd it’s so tight like a choker, it’s gon’ hold you\nBitch you ain’t no money, I ain’t speaking cold shoulder\nRest In Peace my homies, chase the bag until it’s over\nIf you in my way you get ran over, like a soda\n\n[Pre-Hook]\nCrunching on these bitches, I got hundreds, throwing fifties\nCrunching on these bitches, you a hoe, just go and admit it\nCrunching on these bitches, heavy weight,  you ain’t even fitted\nCrunching on these bitches, fix your face and fix your titties (bitch!)\n\n[Hook]\nCrunch time, crunch time, crunch time\nCrunch time, crunch time, crunch time\nCrunch time, crunch time, crunch time\nCrunch time, crunch time\n\n[Outro]\nRich nigga where that bag, wanna orgy with bitches\nLast nigga, went out bad, he a hoe\nSpot you like a hawk and put your nose up on the scope\nIf you want some smoke I got a hookah, let it blow\nBitch!\nDeep up in these streets...", "album": "Doll Szn", "year": "2018-05-04", "title": "Crunch Time", "image": "https://images.genius.com/30dd3a8bdc3a5a5e3492c52a90ce804a.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}