{"artist": "Big Boi", "songs": [{"lyrics": "[Big Boi]\nNah nah nah\nThat's part of the\nThat's, yeah\nI got ya good that time, shawty\n\n[Debra Killings]\nStart over again\nEverything happens for a reason\nGood doesn't come without pain\nStart over again\nEverything happens for a reason\n\n[Big Boi]\nAin't it funny how you're born and then your life begins\nJust like a baby all alone, that's if you wasn't a twin\nYou must begin to fend for self when the umbilical's cut\nThe doctor put you under the heating lamp, your spirit is touched\nYou know what, I take that back, why? You was alive\nDate of conception, interception cause the sperm did collide\nFrom T 'n A to DNA, feelings turn to children\nThe morning after pill didn't put a halt to our very existance\nWe livin, breathin, soon we'll be teethin\nOur granny got a gold and now we want one for that reason\nAn adolescent mind is so impressionable in those stages\nBut parents got to parent their kids to keep them out of cages\nCell therapists beware of this lugie that I spit\nIncarceration without rehabilitation really don't mean shit\nLittle Ricky's home, he gotta serve probation for six months\nBut Uncle Darnell and Ol' Dirty Bastard still in the joint\nReset\n\n[Debra Killings]\nStart over again\nEverything happens for a reason\nGood doesn't come without pain\nStart over again\nEverything happens for a reason\nStart over again\nEverything happens for a reason\nGood doesn't come without pain\nStart over again\nEverything happens for a reason\n\n[Khujo]\nGood does not come without pain\nMeaning, before it gets better, it's goin get worse\nLike my homies on the sick side still dyin over turf\nThat don't belong to urse; I mean us, left in the dust\nTry to catch up with massah\nI used to wanna wrap my hands around the esophagus\nOf them crackers, but Ephesians 6:12\nSaid it wasn't flesh and blood that we wrestle against\nPrincipalities, powers of this world\nRulers of darkness and spiritual wickedness\nIn high places, so throw that whole armor of righteousness\nI spark this thang, but my name ain't Bubba\nI got a problem with racist cab drivers, like Glover\nAnd brothers that wax fat and forget all about the struggle\nYeah, come on, come on, guess what, guess what\nTime to reset this thang\n\n[Debra Killings]\nStart over again\nEverything happens for a reason\nGood doesn't come without pain\nStart over again\nEverything happens for a reason\n\n[Cee-Lo]\nListen to me, I awaken to sunlight\nThat's beyond bright; this day will be done right\nThere is a war just waiting on the other side of the door\nBut I'll be bringing God to the gunfight\nCan't live forever, so have some fun, right?\nLife's a bowl of candy, you can have one, right?\nYou can handle if tomorrow never come, right?\nYou'll get used to singin if only for one night\nBut I intend to raise two daughters and a son right\nAnd I couldn't have wrote this if I was hopeless\nAnd see I focus to provoke this\nSo open wide for my opinionated opus\nStop playin Go Fish, but not below this\nBefore I go, I thought that you all should know this\nRecognize and realize before any regretting\nBefore you relapse, perhaps you'll consider resetting\nHmm?\n\n[Debra Killings]\nStart over again\nEverything happens for a reason\nGood doesn't come without pain\nStart over again\nEverything happens for a reason", "image": "https://images.genius.com/547d6239cd014bda1acb0078d0ddaafc.999x999x1.jpg", "year": "2003-09-23", "title": "Reset", "album": "Speakerboxxx"}]}