{"songs": [{"year": null, "title": "Pushin’ Buddens", "image": "https://s3.amazonaws.com/rapgenius/1374583262_saigon.jpg", "lyrics": "[Verse One]:\nFirst things first, this nigga Joey is the worst\nI'll unload a clip in his head put him in a hearse\nPrior to the jerk, releasin his lil verse I went on the Internet\nAnd did me a lil search\nI got on his website, took a look at the forum\nThis nigga got some white kids makin up lines for him\nHere I am thinkin', \"I wonder what he gon do with 'em?\"\nHis record came out and this mothafucka was usin' 'em\nThat should be a crime\nYou had enough time\nHe even called Royce Da 5'9\" asked him for lines\nAnd this is why I don't take this guy serious\nHe bi everything, bi-polar, bi-curious\nWasn't he actin' like a gangsta at the Applebee?\nWhen his man got slapped he blamed VladTV\nAnd I ain't a battle MC but nigga wanna battle me\nFuck it, I love it, Joe Budden's my first casualty\nI notice he thinkin' he smart like he can think me apart\nHow he The Brain when he's Pinky at heart?\nLook, now the nigga frontin' like thuggin' somethin' he used ta\nWatch when it gets hectic, he turns into Martin Luther\nI'm a two time felon, a full time shooter\nLoser, talk shit and hide behind a computer\nYou rhyme about guns, you never used a Rutger\nPlayin' with Sai' is like sayin' \"goodbye\" to your future\nYou wasn't the man when you did have a record\nDropped by Def Jam, Desert Storm now you desperate\nYou got a nice like buzz on the message board\nBut you shit is collectin' dust in the record store\nNow you givin' us a reality show\nStarrin' little Gay Tray and that raggity ho\nYou tapin' your friends talkin' I'm out of the state tourin'\nEntertainin' this cause the game is straight borin'\nTalk about Austin\nI ain't with the bitch, I don't give a shit, trust me it's nothin' important\nYou made Just all this money but you a dummy\nWhere is he on your new shit?\nWhy he ain't do shit?\nI got 10 Just joints, super exclusives\nNobody will be in the Mood for your Muzik\nHow is he lyrical? This coward is pitiful\nTalkin' 'bout he doin' it big on Amalgam Digital\nThis nigga is frontin', listen to my voice\nHe was dropped, he is not independent by choice\nMakin' homo jokes, well hardy har har\nBut it's ya son playin' with barbie dolls, pa\nJoey you better buy 'em a basketball\nBefore you catch the lil' nigga suckin' dick in the bathroom stall\nI heard Slaughterhouse, Crooked ripped you to pieces\nAll of 'em did, you was the weakest\nYou lack the iron and the niacin, but you be poppin' Vicodin\nFrail mothafucka, you need to be poppin' vitamins\nNow it gets frightening\nNiggas said I fell for the bait\nI cross his old ass over like Iverson\nYou talk about jail but from the look in your eyes\nAnd the fact that you frail, I know you couldn't survive\nThe ones that get raped in the prison?\nThe light skinned, scrawny niggas like you, so play your position\nOkay now I battled you, now you gotta box me\nScared Humpty Hump ass nigga? I ain't Shock G?\nTake away the mic this nigga is a coochie mayne\nI slap this bitch like Gucci Mayne\nYou in the barbershop beggin' Fab to be on his mixtape\nKnowin' that he nut in your bitch face\nYour flow you don't own it\nYou stole Grafh flow, everybody know it\nJust go and listen to Focus\nNow can you name five people that felt Touch & Go?\nDon't worry, I'll wait...hell fuckin' no!\nHe tried to diss Hov thinkin' you would get on\nHe took you and he didn't even have to respond\nFuck that I'll end it a better way\nI have him the letter 'P' now here is the letter 'J'\nJoey just jots in his journal\nNo jackin' no jugglin', just jerkin' his jimmy, Joey is a gerbil\nJoey ?, jig him in the jugular\nJap him in the jaw, jet to Jersey or we jumpin' ya\nJackass is jealous I'm the Jason of the jungle\nI'm the Jesus of the Jews, you Judas's are in trouble\nThe juvenile in the jail for juxin' jokers for jewelry\nBut I'm the Weapon X, yep Joey you're Jubilee\n\n\"You win\"\nWhat you say?\n\"You win\"\nThat's right\n\"I want to take the time out and apologize to um...to any of um, any Joe Budden fan out there.\"\nBack to business '09. Joe Budden always wanna battle niggas and shit. That's all he can do. When are you gonna write a fuckin' good song nigga? I only know one song you got. Matter of fact...fuck it. I ain't done with this nigga\n\n[Verse Two]:\nPump It Up\nThis nigga Budden a slut\nBe gettin' fucked in his butt that's why he be sayin' \"Uuugh\"\nWhat kind of grown as man be sayin' \"Uuugh\"\nFuck that, he called me out and now it's \"Uuuugh\"\nBoxin' gloves off, mask and glove \"Uuuugh\"\nAnd I'm back faggot\nHe threw the first tap, worst rap I have ever heard that\nCrap it was weak, it was nerd rap\nYou deserve that slap that Ran gave your man brother\nAmalgam writin' checks your ass can't cover\nTakin' me to a battle, I'm takin' you to the ring\nAs soon as he hear the ding he won't be sayin' a thing\nBut I hear he a fag either way, nothin' he could say\nAfter eatin' Fab DNA, now the whole world knows Tray's gay\nBut blame you dude, cause you the dick head that put him on Youtube\nHe's the one who brought the kids into this\nAnd that's why this faggot is finished\n\n[Outro] [Saigon talking]:\nDone. I ain't doing this shit no more nigga. You go ahead and make a million fuckin' diss records. I'mma see you nigga. Hold your head Ransom. You got Ransom jammed up man. Gettin' niggas locked up faggot. Go ahead and make some more diss songs. That's all you know how to do anyway nigga. I'm back to business. I make real music. Dumb motherfucker", "album": null}], "artist": "Saigon"}