{"artist": "Warren G", "songs": [{"year": null, "lyrics": "(Warren G)\nMic check, time for me to make that connect\nWith the so so def so I can make my collect\nPrivate jet in motion, over the ocean\nTouch down jungle air strip, CD's to flip\nFeds having a cow\nGotta stay on the down low for now\nAm I living foul?\nFuck that I'm living fat, I got the track\nDon Chi Chi and Nate they got my back\nAnd it's like that\n\n(Jermaine Dupri)\nY'all the type of niggas to blink and to come up all assed out\nI'm the type to say fuck that and go cash out\nAll glassed out with the count of the bitch\nScreaming nigga I ain't having that shit\nI represent niggas that love to ball, and still be trappin'\nAnd only drink outta the bottle with the gold wrappin'\nIf it's gon happen I'm the one that make it go down\nCool JD how you like me now?\nI keep...\n\n(Chorus x2)\nHavin' things\n(We havin' things, havin' things)\nHavin' things (yeah)\n(We havin' things, havin' things)\n\n(Warren G)\nI reminisce when it's like this\nReal niggas get together they don't like this\nSo I'mma spice this\nATL, Long Beach to Cada\nWe been doing this for years for you paper haters\nWhen the beach turned out fresh dress in eighty fo'\nWhen JD was poppin' in houdinni's videos\nMe and Nate was serving on the east side fo' sho\nAnd in a game fo' a minute got a minute to go\nWhat?\n\n(Nate Dogg)\nThey should know now\n(We havin' thangs, havin' thangs)\nDon't sell your soul now\n(To have things, have things)\nDo what you feel now\n(If you want things, want things)\nKeep it real\n(Keep it real y'all)\n\n(Chorus x2)\nHavin' things\n(We havin' things, havin' things)\nHavin' things (yeah)\n(We havin' things, havin' things)\n\n(Nate Dogg)\nCome on out to my castle lady\nSee you thangs on your mind\nGo on up to my bedroom baby\nTonight everything is just fine (all right)\nStay with me just little while longer\nIt's only a quarter to five\nI can stay up late\nDon't work in the morning\nHavin' things is just fine\n\n(Jermaine Dupri)\nI'm a south coast nigga so fuck y'all niggas\nWith hate, Me and G V.I.P. at the gate with Nate\nBringing bitches to the table with they belly out\nFine as fuck, but steady trying to tell me how\nThey got a man but still wanna get they drink on\nI'm lookin at this hoes like \"You ain't heard this song?\"\nIf you drink this shit, it's time to leave\nFo' shi's\nFo' c's\nIt's 12:18\nAnd we be...\n\n(Chorus x3)\nHavin' things\n(We havin' things, havin' things)\nHavin' things (yeah)\n(We havin' things, havin' things)", "image": "https://images.genius.com/fc9c13a653a7912a5dca703cc2caab0a.800x800x1.jpg", "album": "I Want It All", "title": "Havin’ Things"}]}