{"songs": [{"album": "CakeWalk", "year": "2010-05-17", "title": "Jid Freestyle", "image": "https://images.genius.com/d737d032384784252b6795bbaad6ddf0.800x800x1.jpg", "lyrics": "[Intro]\n(Grade A, Grade A, Grade A)\nTake a bitch shoulder\nFinna introduce y'all to Lil Reuben\nAKA Mr. G6, G Swig, me swig\nTalk to ’em bro\n\n[Verse 1]\nNigga, I'm clean as in detergent\nStunting on purpose\nThrow out on some cocky shit, nigga I'm perfect\nPussy, you peep it, the red, black, green shit\nMarc Jacob glasses ’cause I'm e-classic\n(This is a Tay James exclusive)\nFly so classic, pocket full of plastic\nGetting active with a actress who loves shagging\nMagnums, baggage, Louis, ooh\nHe fruity, stupid\nJury on, taking pictures with a groupie\nI move smoothly into the club like what the fuck up\nBars getting bought by me and I'm bout to roll up\nSo what's the hold up?\nAnd there ain't enough liquor in this club\nFor me to intoxicate a female\nYou gotta give it up\nTell her tricks alive, so she believe\nJust enough to do exactly what I say\nWhen I'm about to catch my nut\nBut my money on, my money is extra on\nAnd if you ain't getting paper, this is not where you belong\nThe life I'm living, rockstar bitch (Fly rockstar bitch)\nCarseat and hash ’cause I sparked up\nRetarded stacks, I’m heat balling\nDisplay in the clutch, I'm Chris Paul-ing (Bake)\n’Cause he balling and everybody know it\nIt's lit in the club, plus everybody smoking\nEverybody drinking, psyched out, choking\nMoney in my pocket and everybody knows it\nSo what's frozen, the neck or the G Shock\nThe kush green diamonds, the necklace is on detox\nShawtie look bad, maybe I could hit her g-spot\nHer man look lame, a bugle boy, he's the Rebox\n3 shots down the drain and I’m rolling\nWhere the fucking waitress at, with my potion?\n'Cause this potent, mixed with this potion\nCould have a nigga dazed for days and I ain't joking\nIf it ain't the purple haze or blaze, they ain't smoking\nI don't do the mid by kid, I hate choking\nFocus, back to me, myself, I\nLittle room, dressing room, the kid remains fly\nI'm doing my thing, I am truly insane\nTry to play me in vain, I'm removing your brain (Haha)\n\n[Interlude 1]\nYou gotta go man\nFor real bro, go in bro\nAlright\nGo in bro, show 'em what time it is\nChill, chill\n\n[Verse 2]\nI got the respect from the hood, the hood from respect\nThat's why whenever they make a move I be at they neck\nI feel so analystic, statistics analyzed\nThat's why my percentages come correct when baking pies\nMaking it, take it live\nI fuck a bitch, kill a guy\nNigga just give me the bird and the boss is taking mine\nBut slut, I'm on my grind like sex work\nThat's why she hang off my every word like tax work\nCall me Mr. Mister, fucked her with her sister\nTell the boy to roll the gun and go buy my elixir\nDranking little sips, that's why I got temper\nProblems, I'll probably murk them as soon as they enter\nA hot-boy, hot-boy, but colder than the winter\nWood grain, hood lane, touch it get a splinter\nI am just a winner, an easy bullet lender\nYou can have it, you can have it, nigga go hit her\n\n[Interlude 2]\nGrade A, gangster\nThese niggas starvin' now\nMurder everything now\nThat's lil' roof\nIt's lil' somethin', you feel me? I'm out here\nSo I'm bouta go, I'ma talk about bitches\nWhat I tell a bitch?\nGo bruh, lay it on\nNigga, shit\n\n[Verse 3]\nMight shed the amor, this door awaits\nWaits to see how many whores this floor can take\nFate is victim to take place in times erased\nTaste is remember to spread the love all over your face, face\nI come from flyness, I'm fly as a pilot\nNo style, style just comes to me\n'Cause if the shirt match the shoes\nAnd the shoes match everything I got on\nThen bitches, they just come do me\nAnd I'm back up on the track like your ass right?\nYou niggas think you could have the fucking last laugh (Nah)\nI'm in the black jack, blood cock, black ass\nShoot him in the head and now the nigga dead\nBlack bag\n\n[Outro]\n(Grade A, grade A, grade A)\nThat's all I gotta say\nLike I told them bruh\nIt's the monster, aka Mr. fancy swag\nThis man right here and I am KC\nThese are your soldiers\nWe take it here, we don't lie\nWe got him, we got him\nAnd my lil' bruh, he tearing this shit apart\nLil, lil boy, lil' boy\nFuck niggas taking over the station\nWow\nAnd we the flyest niggas doing this shit, man\nSee over here, see them, them\nHey, like I said\nThis man, JID, goddamn, we boys around\nCrush all you fuck niggas, fuck nigga\nFuck with us, fuck nigga\nI'll say anything, check the chain\nCheck the wrist, check the feet\nGoddamn\nHey what it do, it's your man Rosco\nNow, you're tuning into the sound of DJ James, man"}], "artist": "JID"}