{"songs": [{"year": null, "album": "Kon the Louis Vuitton Don", "image": "https://images.genius.com/b7758602aa6883d6e056a8f30703a549.591x591x1.jpg", "title": "Better Than Yours", "lyrics": "[Chorus: Kanye West]\nMy raps is better than yours\nMy plaques is better than yours\nMy tracks is better than yours\nYou can have one but I have to charge\n\n[Verse 1: Kanye West]\nWe can start with the hits on my arm I already got the bomb\nNow all I need is my first LP to go gold\nThen I will have the qualm uh-uh uh-uh uh-uh\nI'm Kon the Louis Vuitton Don\nBought my Mom a purse now she Louis Vuitton Mom\nStill might throw on a little low arm they want me to stop go on gon\nThey don't want me to shop and me spending that hard\nOh my God is that a black card\nI turned around and replied why yes\nBut I prefer the term African American Express\n\n[Chorus: Kanye West]\nMy raps is better than yours\nMy plaques is better than yours\nMy tracks is better than yours\nYou can have one but I have to charge\n\n[Bridge: Kanye West]\nLa La La La La\nOff MTV\nLa La La La La\nWhen you gonna go out with Me\n\n[Verse 2: Kanye West]\nBrains Power and Muscle like Dame Puffy and Russell\nYour boy back on his hustle don't know you don't discuss you\nEvery rapper want to know when they can get to work\nEvery stylist want to know where they can get the shirts\nEverybody ripping my style like the shit that hurts\nBut they don't give me my credit that's the shit that hurts\nThere's something I might say There's something I might play\nA beat I might made might make they life change\nAnd save they whole deal They wrist is on chill\nThey house is on hill You could be Lauryn Hill\nSee y'all write songs to keep the lights on\nI'mma go in Def Jam and turn the brights on\nMan I'm just sayin\nWhen I wanted to rap y'all thought I was just playin\nNow y'all just prayin\n\n[Chorus: Kanye West]\nMy raps is better than yours\nMy plaques is better than yours\nMy tracks is better than yours\nYou can have one but I have to charge\n\n[Verse 3: Common]\nYou was a vic in high school, now you a thug?\nBetter step in the name of love\nBefore you giving pain a hug\nNeeding dope is like pain to drugs\nOr aiming slugs til the game unplugged\nLike a scoreboard with vice and warlords\nHot merchandise prices they want more for it\nYou was pink as ice single need to think it twice\nOver the bitch and you came out like freaks in the night\nFreed your mind at a cheaper price\nOn the street trying to seek advice\nI'm on point like I speak to dice\nTook the underground at a steeper heights\nMay real niggas see the light, got fat girls eating right\n\n[Outro: Kanye West & Common]\nHaha, we in this bitch, yeah\nHahaha\nIt's Common and Kanye\nY'all niggas know what time it is, motherfuckers\nChi-Town, DJ Pharris\nHeavy Hitters what up?\nMike Love What Up?\nDJ Enuff\nPharrell! That's my favorite producer by the way\nThat's why I had to rap on this\n'Cause is tracks is better than yours\nMy tracks is better than yours\nJust Blaze tracks is better than yours\nYou can have one but we all gonna\nCharrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrgeaaawwwww\nPlain Pat, what up?\nBig John, what up?\nJohn Mnop, what up?\nDon C What Up?\nJ.B., what up?\nGLC, what up?\nBang, what up? Yeah\nReally Doe, what up?\nArrowstar, what up? Yeah!\nOh, and did I mention the new head of my management, Benny Medina?\nYo G, Hop, we taxin these niggas right now\nPlain Pat What Up? That's all"}], "artist": "Kanye West"}