{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "Do You Really Want Me?", "lyrics": "Do you really want me, baby?\nCause I want you\nDo you really want me, baby?\nCause I want you\nAye two things I know for sure\nPimpin' hard and love hurt\nTrying to make love work\nWhen you're dodging love's curse\nWhoever may object\nTell them fall in love first\nUsed to think it was simple\nJust throwin' dubs on a bird\nBut it's hard, giving someone your heart\nLowering your guard\nAnd now you towing a scar\nCause someone tore it apart\nYou ask God and the stars why it is like this\nYou recall the start, it didn't begin like this\nIt was a bright day\nBlowing the hay\nDrawing the L\n65 Impala\nThe breeze blowin' your hair\nIn some nice shades, riding the the subs, grabbing your rear\nIn my lap on the way from the club in no underwear\nI remember rushin' home just knowing you was there\nAnd now I feel alone, ain't even knowing if you care\nDon't spare my feelings\nYou don't share my feelings\nIs it as strong as it was in the beginning?\nDo you really want me, baby?\nCause I want you\nDo you really want me, baby?\nCause I want you\nRemember time and time again, just tryin' to make it work\nWe'd kiss, fuck, and break up again\nMan, we're making it worse\nRelationship was solid, shit was sacred at first\nI did my dirt, and you thinking I'm just a fake and a flirt\nI thought you said that hurtful shit you said cause you was mad at me\nBut slowly I realized you said it cause you ain't happy\nAm I meant to grow old alone, just like my daddy?\nA bullseye for bitchest throwin' they pussy at me?\nI respect us too much to stand to see you sad\nI'd rather let you go and find the man you never had\nArguments and \"I'm sorry\" that we ain't bothered to say\nJust made it harder to remember why we bothered to stay\nHow can the good outweigh when we fight everyday\nRemember I used to be the nigga who would brighten your day?\nAnd you used to say \"I miss you, wish I could've saw you today\"\nNow if I call you, you know all I gotta say is\nDo you really want me, baby?\nCause I want you\nDo you really want me, baby?\nCause I want you\nYou can catch me in the Maybach\nLaid back, puffin' on the finest tree\nOr chillin' with two or three chicks\nThat could crush a nigga's top ten picks\nWith ease, darlin'\nEven though my pimp hand is strong\nMy patience is long\nAnd I'd give it all up just to see you in them thongs\nOne more time, baby\nOne more time, darlin'\nDo you really want me, baby?\nCause I want you\nDo you really want me, baby?\nCause I want you\nNow let me tell you somethin'\nI know I ain't your first\nAnd you won't be my last\nUnderstand, but still, if we gonna make this thing work\nWe gotta put the past in the past\nAnd leave it there\nYou leave it\nDo you really want me?"}], "artist": "T.I."}