{"songs": [{"year": "1989-10-10", "image": "https://images.genius.com/7c84ab3a345d944b61d4c41970988d2c.1000x1000x1.jpg", "title": "A Thing Named Kim", "album": "The Biz Never Sleeps", "lyrics": "One two, one two\nThe Diabolical's back again\nWith the Cutmaster Cool V\nAt the boards my man Paul Sea\nBut this goes out to my man Danny Dan\nThe beat man that makes you understand\nHe want me to tell somethin bout this girl named Kim\nI'ma do it like this\n\n[Verse One]\nWell it was one of those days when nothing's right with the world\nI was half broke, bored, and fed up with my girl\nLookin for somethin to do but wonderin how long\nIt would take for the next thing to go wrong\nSo I decided to hang, go out and ease my mind\nI told myself you would never know what you might find\nI took a hot bubble bath, instead of a shower\nGot rid of \"The Dragon,\" it took me a hour\nDecided on a sweatsuit, Gucci red and white\nSome rings and some ropes, and then I'm on for the night\nThe Gucci sneakers some cologne, I think Aramis\nI look in the mirror and said, \"Biz you look - marvelous!\"\nI jetted out the door, and hailed a taxi\nAnd said \"54 in a hurry,\" and jumped in the backseat\nWe arrived he said, \"$8.50 and that don't count my tip\"\nI said, \"Don't drink and drive -\nGIMME MY CHANGE before I bust ya lip!\"\nThe club was jumpin and word is bond\nI saw girls walkin around with jeans painted on\nSplittin they skirts up the middle, tight leather and lace\nBoth me and Jimmy agree, we're gonna like this place\nTook a seat at the bar, the girl said what are ya drinkin?\nA Coke and a smile child, and slid her a Lincoln\nTook a sip of my four dollars, she looked at me strange\nI said, \"Psych I bet you thought you was gonna keep the change\"\nI made my way through the crowd, it was plain to see\nSame everywhere I go, all eyes on me\nI sat down at the table, and one of the staff\nSaid, \"Ain't you the Biz\" I said, \"Yeah but no autographs\"\nI sat alone in the corner, and sipped my drink\nHappened to look across the room and somebody winked\nI did the only thing the Diabolical could do\nLooked down to see what that I was attached to\nSure enough it was a girl, a sweet female\nHer hair and eyes sparkled like ginger ale\nI looked lower to her lips, her chin and her neck\nAnd fantasized about the rest, then decided to check\nI sent champagne to her table, the waiter asked her name\nHe returned with Kim, and I almost came\nI checked myself and made sure, I looked alright\nAnd told my dick, \"Don't worry - we're fuckin tonight!\"\nThrew her the Kool-Aid smile, and a dash of charm\nI stepped to the lady and tapped her arm\nBut when she turned around, my smile turned to gloom\nShe didn't look none like she looked across the room\nShe had big broad shoulders and her titties was big\nThey were filled with silicone, and her hair was a wig\nShe had more makeup than Boy George and Phyllis Diller\nUgly enough to be a monster in \"Thriller\"\nHad hair on her chest longer than King Spade\nEven though I got a band, I don't need the AIDS\nSo I hurried out and left, she said, \"Please stay\"\nI said, \"Sorry money grip, I don't go that way\"\nSo I stepped out in a hurry, to gather my wits\nAnd thought that's a damn shame, he had nice tits\nAnd that's the last I ever saw of Kim\nYou wanna know why?  Cause she's a he and her's a him\nLike that and-a, like that and-a\nI'm not the man called Dantana\nYou go on and on and on and on and on and on and on\nDon't go to Getty, go to Exxon.. {*echoes*}\n\n[Biz Markie shout outs and ad libs]"}], "artist": "Biz Markie"}