{"artist": "Kidd Kidd", "songs": [{"image": "https://images.genius.com/618dea054f2d84c4713013075be1ad0c.1000x1000x1.jpg", "title": "Reach Out To Me", "year": "2014-05-30", "album": null, "lyrics": "[Intro]\nFor my grandmother, she was always there for my when I needed her. Rest in peace [?]. My little nigga [?] just got hit up for a minute ago ya herr me. He out here with me ya. All real shit, don't just get it confused with music my nigga. Josh and Kiddie I love you! Hun! Ma...\n\n[Verse 1: Kidd Kidd]\nI'm laughing to the bank, not to be funny\nBread all around the board like Monopoly money\nBut how can I eat good when everybody hungry?\nYou not a reallionaire, you don't keep it a hundred\nBig diff between wifey and bitches I fuck with\nMy real friends is niggas I'm just stuck with\nI rapped with Lil Wayne, but I ain't stunted\nI can always go back cause I never fronted\nYou ain't up in the hood, you just checked under it\nI'm on the way home, [?] I'm coming\nLiquor shot in the air for my little cousin\nI hope the bullet land on the head of who done it\nYou would get punched from thinking these lines punches\nThis is food for thought like school lunches\nMy moms abandoned me, but I still love her\nYou don't have to wonder, you my Wonder Woman\nI took my nothings and made something from it\nGot a pot to piss in, but the toilet wasn't flushing\nI started hustling, told to slow down, but I was rushing\nI was being more [?] than a Russian\nI had to shallow my rocks when the laws was coming\nThen threw 'em up and got back to pumping\nOn the corner where the streets chris cross\nYeah, the block was jumping\nThat was back then, I had fat racks then\nWe had each other backs back then like I wish a nigga would jump in\nUh, now guns blowing like second line band trumpets\nNiggas staring like ''and what, bitch?\nI was born with talent, I'm glad it found me\nBefore a casket or a bounty\nHaters can't talk to me so they talk about me\nNow they praying Kidd Kidd reach out to me\nHaan"}]}