{"songs": [{"year": "2018-04-05", "title": "PROM / KING", "image": "https://images.genius.com/c9d9eb7cb4997367a0e3e83a79a34489.919x919x1.png", "lyrics": "[Part I: \"PROM\"]\n\n[Verse: Saba]\nThis remind me of before we had insomnia\nSleepin' peacefully, never needed a pile of drugs\nEverybody was college-bound, no dollar amounts\nIn God we trust, senior year my prom ain't had no party bus\nMy cousin hit me on Facebook like, \"What shorty you takin'?\"\nI'm lyin', I'm playin', I'm sayin', \"I got one to take\"\nAnd I'm waitin' on her response, wrote her a three-page letter\nIt's three days later, never hit me back, she broke my heart\nSo now he IM'ing me shit like, \"Yo, is shorty bad?\"\nI pretend not to be depressed, she never wrote me back\nI hit him back like \"Yo, well fuck her, it's on to the next\"\nI wrote that message thinkin' I'm awkward, prolly never have sex\nYou know in high school, 16, you prolly late\nMy cousin hit me back, \"Don't trip, bro, I got you a date\"\nSo he sent me this link to some girl I had never seen\nHe said to call and tell her \"Walter sent you, you with me\"\nI think about it for a minute like what's his intentions?\nI mean we never really got along or used to kick it\nIn fact if I remember vividly, he picked on me\nHe used to beat me up and take my sneakers every family visit\nI'm skeptical to let her know I'm Walter' little cousin\nWhat if this shit all a joke? Then again, what if it wasn't?\nWould I really risk the chance of me potentially fuckin' on some stranger daughter\n'Cause I barely know if I can trust him?\nProlly not\nI finally called her, tell her \"Walter sent me, my name Tahj\"\nShe asked me what's the color scheme that we gon' wear to prom\nI'm actin' like I'm not excited, tryna play it off\n\"So what's the car we're takin'?\" Worst come worst, her mom can take us\nI'll call Walt to thank him, he said \"Don't trip and just wear black\"\nHe said she cool and they go back, if any problems, hit him back\nI never had to, but now we in tune\nHe Facebook messaged me like, \"Sorry, not to be a nuisance\"\nBut he like 30 dollars short on all his prom suit shit\nI'm like, \"I got you, cuz, that's the least that I could do\"\nHe tell me send him the addy and he'll slide after school\nI'm like, \"Okay, bet,\" never knew where he stayed at\nHe walked down the street hella surprised\n\"This where y'all place at?\nUncle Carl, Auntie Deborah, my cousin Rena?\"\nAnd I'm surprised too, my family knew, kept this a secret\nMe and cuz stay down the street, living different lives\nEvery day he on the bus, me, I get a ride\nI gave him 30 on the porch, he never went inside\nHe tells me, \"Thank you,\" then he walked back home with a smile\nHe tryna hide it but I see his dimple\nI'm thinkin', \"Damn, that transaction was simple\"\nI'm talking shit, I know he hoop, I'm like, \"Ay, where the rim, bro?\"\nHe like, \"Tomorrow if you free, you prolly weak as shit though\"\nI know my brother not\nSo all three of us went to the park and ran some niggas off the court\nI'm hella passive, I was passin', I ain't have to score\nThe next day the prom, I couldn't sleep, I stayed up\nMy granddad gave me a condom then walked away, didn't say nun'\nShe hopped out of her car and said that her name was Jada\nMy heart's racin', I'm focused, I'm tryna keep it playa\nGave her the croissant or corsage or whatever the fuck\nMy mom handed me, and said, \"Now put it on her hand, Malik\"\nFamily ties, my grandfather taught me how to tie up a tie\n'Cause my dad lived in NY\nThat's prolly why I was shy, so self-conscious\nTook pictures on the porch and then we headed for the prom and\nWalter went on prom the same day, but to a different place\nSo he text me like, \"Cuz, this the spot, let's meet up later\nAnd bring Jada through,\" prom flashed, I kept it cool\nWe show up to the function where she brought a change of clothes\nI'm lookin' around like, \"Damn, I don't know nobody\"\nWe at this party out west, and Jada left to get dressed\nI fake like I'm sendin' text, some stranger get really close\nI swear that I hear his breath then he put a knife to my neck\nGave me the run down like, \"Jada my sister\nAnd if you hit her, fuck her, make her miss ya, I'ma kill ya!\"\nAt this point, I'm just exhausted wonderin' where the fuck's Walter\nHe shows up like 30 minutes after our altercation\nI never mentioned it to him, he kinda overprotective\nAnd I know if I tell him, that he'll beat this nigga's skull in\nTurn his body a skeleton, and our night'll end terrible\nI exhale and say, \"Fuck it\", and I just chose to let it go\n\n[Part II: \"KING\"]\n\n[Skit]\nFuck with you boy\nSaid you're used to getting everything your way\nThis not how that happens this time\nShe tryna fuck with you boy\n\n[Verse 1: Saba]\nWalt went to St. Louis, had a full ride for his hoopin'\nHim and his coach got into it, now he back home doin' music, ay\nI was at Columbia, a damn near straight A student\nI had one B in a hip-hop class, I thought that shit was stupid\nHe transferred to Robert Morris, oh its lit, we down the street\nMy class let out at 2:40 and his class let out at 3\nMama asked me where the hell I been at, where the hell I be\n\"I'm with Walter, mom, I'm safe\" I keep walkin' in here late\nI might fall off in your bae, I get girls now, I get laid\nI get caught up I blame Walter, I'm a product of my age\nHe talk to every girl downtown Chicago, wingman, I cannot fly though\nHe was in Cal white Impala, he was that nigga in the party\nAwfully popular for someone that they barely mention\nPlus we from the part of city that they barely mention\nJust logged into Twitter and somehow we was barely mentioned\nWe signed our names on the open mic list and then they skipped us\nAnd then they skipped us again like a week later\nLike obviously this fuckin' host can't read the paper\nHella' intimidatin', a big guy didn't have to flex\nSo Walter walked to the host and said, \"This the name you callin' next\"\nBullied our way to the stage and then overstayed our welcome\nAn apple never get too far from the tree that it fell from\nJust like my father tryna do music and hope I make it\nWalter joined me for the journey said the city waitin'\nPIVOT\n\n[Verse 2: Saba]\nWalter invincible, dodged death like a mad magician\nMore times than a mathematician\nI'm in L.A. workin' on Bucket List Project\nI get a call and get a fishy feeling\nNormally Walt joke on the phone, this time he over-serious\nMy heart dropped and I'm like, \"Yo, what is it?!\"\nHe say he with T-Y on the highway and some niggas just tried to kill him\nEmptied the clip on the car but somehow they didn't hit him\nSometimes I fuckin' hate Chicago 'cause I hate this feelin'\nInnocent niggas get shot at in the broad day, the A.M.\nI asked him for a play-by-play of how their whole day went\nHe say he went to XSport and they ran a full court\nAnd I cannot retort without thinkin' that this can't be the reason\n\"So what else you do? What about Ty? Is he still cool?\nWhere you on your way from and where you on your way to?\"\nHe say he just left a dinner at a friend crib and that's it\nHe say, \"Ty don't do shit but smoke, honestly, Saba, that's it\"\nGive him sympathy, another case of mistaken identity\nThe news prolly gon' run this as two gangs from different streets\nPolice questionin' him like he just shot at a trooper\nMy boy walked away unharmed and we did Lollapalooza, yeah\nSix months pass by, every day we celebrate, every day a better day\nI just dropped Bucket List, Walt about to drop a tape\nEverything goin' perfect, couldn't paint a better way\nPIVOTGang is on the way\nWe just sold out Lincoln Hall, then I went to talk to Sway\nI got back home and got back on it\n'Cause Walt was doin' two-a-days\nSendin' me links to songs that he made\nKid Cudi, we are not ridin' no waves, ayy\nGrandma made his plate, we played 2K, that's just a day before\nFatimah got a show tomorrow, he text me, \"Ay, we in that hoe\"\nI went to the barbershop the first thing the next mornin'\nThen I got up with LEGIT, we supposed to do some recordin'\nTen minutes into the session, I got a call from a number\nThat I don't got saved, but I answer anyways\nShe says, \"Hello, Malik, have you or Squeak\nTalked to my son today? He was just on the train\"\nWe got in the car but we didn't know where to drive to\nFuck it, wherever you are my nigga, we'll come and find you...\n\n[Outro: John Walt]\nJust another day in the ghetto\nOh, the streets bring sorrow\nCan't get up today with their schedule\nI just hope I make it 'til tomorrow\nI just hope I make it 'til tomorrow\nI just hope I make it 'til tomorrow\nI just hope I make it 'til tomorrow", "album": "CARE FOR ME"}], "artist": "Saba"}