{"artist": "Young Thug", "songs": [{"year": "2015-04-20", "lyrics": "[Intro]\nThugger!\nAye!\n\n[Hook]\nYSL gangbang like we from Compton (Bompton)\nYoung Thugga big B nigga I'm from Bompton\nI don't mind bringing pain but I just won't function (On God)\nNigga pull up with them tummies ain't talking stomachs\nCop that bitch and run with it (what!)\nWhat these nigga try to cuff a nigga done with it (Oh God!)\nYeah Yeah, I'm the don nigga, with it\nTrayvon told me to take over your hoody (What? Ooo!)\n\n[Verse 1]\nAnd Imma do that\nRed coupe...\nSuwu that!\nI caught you bitch and I nailed her now she won't screw that\nHow you do that?\nWho are you at?\nI know they meat because I'm ready to bleach a blue back (On God!)\nTrue that!\nFrom this day forth my bank accounts I renew that\nI, live, life, like an uncle where my loot at\nWhy you weren't with the band, bring me them bands\nI'm a cat, cop-killer, YSL the clan!\nMan!\n\n[Hook]\nYSL gangbang like we from Compton (Compton)\nYoung Thugga big B nigga I'm from Bompton\nI don't mind bringing pain but I just won't function\nNigga pull up with them choppas ain't talking stomachs\nCop that bitch and run with it\nWhat these nigga try to cuff a nigga done with it (woo!)\nYeah Yeah, I'm the don nigga, with it (woo!)\nTrayvon told me to take over your hoody (R.I.P)\n\n[Verse 1]\nAnd Imma do that\nI got the juice\nMolly tell me where the boot at\nI'm living life like a movie this ain't no Kodak\nI'll whip it out at a concert yeah Imma show that\nI think you need to know that\nThe corvette got the low jack\nThey been creeping around town like lil' rat\nAnd now you livin' cold where your toetag?\nThese pussy niggas wanna know why the paper copping fine white gold rollie-pollie-ollie-o!\nRollie... Rollie, Rollie\nBitch I'm I'm a boss, boss, boss, I know you know that\nRed carpet rules take off the shoes I hit the door jack\nI pressed a pussy nigga for his diamonds and I still showed that (you know that?)\n\n[Hook]\nYSL gangbang like we from Compton\nYoung Thugga big B nigga I'm from Bompton\nI don't mind bringing pain but I just won't function\nNigga pull up with them tummies ain't talking stomachs\nCop that bitch and run with it\nWhat these nigga try to cuff a nigga done with it\nYeah Yeah, I'm the don nigga, with it\nTrayvon told me to take over your hoody\nWoo!", "image": "https://images.genius.com/1ff663fe1c5ce2b9137e3f833071eb7a.736x490x1.jpg", "album": null, "title": "Bompton"}]}