{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "Fried Chicken N’ Thighs (Excerpt from Commissary Kitchen)", "image": "https://images.genius.com/015950b3092b97e7f62f43fdc3dbfd04.260x319x1.jpg", "lyrics": "Correction officers were corrupt as shit. There was a whole prostitution ring happening in the prison. I guess you could say the inmates were the pimps and the COs were the hookers. A lot of the inmates in there – they got game. They’re from the hood, they’ll be talking that shit and the girls that work there, they’re from the hood too (most of them). So they’ll be feeling the inmates.\n\nNot all of them were into prostitution. Some would just have sex with the inmates for free. But the ones who were down to prostitute had a whole system to it. The way they got paid was the inmates would have their family send money through Western Union. Then the inmates would pay the COs and they’d get busy in there. And they’ll be having sex everywhere in the jail, in all kinds of places. It’s a power thing though for the inmates, especially when you feel like you have no power in prison.\n\nIf you find one of them female prison guards who was down to fuck, you could get whatever you want from her after that. ‘Cause they’ll sneak all kinds of stuff over to you then: extra food, cigarettes, whatever. At least until they got caught.\n\nWhen I was in there, somebody had just gotten locked up. One of the officers got locked up for having sex with an inmate in the shower, and the reason they got caught is because some other inmate snitched. Fucked up, right?\n\nI had a favorite CO, but I ain’t fuck her. Her name was Officer Butz. Imagine that? Butz. And her ass was real nice too. She was cute. As far as I knew, Butz wasn’t about sex with inmates, especially not for money. She was good people. But she was a little flirt and shit. She would call me in the bubble and show me pictures on her phone of her and her girls at the beach in bikinis. I was like okay nice, Butz.\n\nOne night Butz called me out to the bubble. It’s a bulletproof glass bubble, where the CO sits. And then outside of that is a hallway, and then it’s two dorms on each side of the hall. So the CO is never in the dorm, and we’d be in there dolo. So when you need help, the CO is way out there. Rikers Island is dangerous because of that alone.\n\nOne night after chow, Butz called me out to the bubble over the microphone. I come out, and she buzzed the door to the bubble. I walk to the open doorway, and she’s like, “Come inside.” She reaches in her pocket and I’m like, What the fuck?” In there, she had two pieces of fried chicken wrapped in brown paper towels from the bathroom. She was like, “Here, eat up boy.”\n\nI only had one piece of chicken from chow that night, everybody always only got one piece. They’d put it in the little window for you and walk away. So here come Butz with two more pieces. I was like, “Oh shit, good looking.” Word. She hooked me up.\n\nI should’ve fucked her for that alone because I was hungry as hell. I didn’t, though. Pussy wasn’t worth stretching my sentence or getting Butz in trouble. So I ate the two pieces of chicken and walked out.\nFrom commissary kitchen: my infamous prison cookbook published by Infamous Books.\n\nYou can download the audio version of commissary kitchen: my infamous prison cookbook for free on Amazon", "year": "2016-10-10"}]}