{"artist": "Arabian Prince", "songs": [{"title": "She’s Got A Big Posse", "image": "https://images.genius.com/7bc512fd05b0f3c7f0fc8b8f5fe9d41c.400x400x1.jpg", "album": null, "lyrics": "[Skit: Announcer + Arabian Prince]\nGood morning\nFellow Big Posse anonymous members\nToday I'd like to introduce to you-\nBrother Arab\n\nGood morning fellow Big Posse members\nI'm Brother Arab\n\"How ya' doing, Brother Arab?\"\nI'm here today to tell you that I haven't had a Big Posse, in 90 days\n*Clapping*\nAnd I'm also here to tell you, my story\n\n[Intro]\nYou do understand she wanted a Big Posse\nSaggin'\nI ain't standin' in no line, man\nHey, wait, wait, wait\nYou can't go in there with those pants on\n\n[Verse 1]\n[? 0:50] on a Saturday night in L.A., yo\nFeelin' kinda funky, lookin' for some play, yo\nBut I couldn't find a good freak anyway\nSo I [? 0:58] like intensive care\nThat's when I glanced at the dance floor\nShe glanced back and I knew it was a chance\nFor Brother Arab to get busy\nI stepped on the [? 1:07], feelin' kinda dizzy\nI said yo T' what's the scoop on the beauty\nHer face is cute and she's got a big booty\nT' said yo, I wouldn't mess with baby [? 1:15]\nThe list of the possy reeks like roll call\nI tried to get her face in focus\nI took another sip and blam, hocus-pocus\nI made up my mind, yeah it's her I gotta meet\nThe posse's deep and I'm still gonna creep\nT' said If you're gonna step you ain't gotta say please\nShe's jammin' out like a [? 1:31] machine\nI paused for a minute, took another sip\nI think she winked at me, she's on my tip\nI decided to step, and get with the program\n[? 1:39] slowjam\nT' leaned over and said the way I see\nYou better be packin' homeboy, she's got a big posse\n\n[Hook]\nYou ought to leave it alone\nYou ought to leave it alone\nYou ought to leave it alone\n\n[Verse 2]\nI stepped with the [? 2:05] , cuz' it was showtime\n[? 2:07] gotta spit those lines\nI took my place in her face-y\nI asked her name, she said her name was Tracy\nI said Tracy, yo\nYour body's kickin' strong\nLet's dance some more and play a different song\n[? 2:18] but somethin' freaky, my god\n[? 2:21] more like we could spend a night\nMy mouth dropped open and the licker start talkin'\nThe hell with fools that grab your girl and start walkin'\nMove, but [? 2:29] too slow\nRed walked up boy, yo man yo!\nThink for a minute before you get with that\nI hope you got [? 2:34]\nI looked over my shoulder and said\n\"What you say?\"\nIt's just that my boys said shes 'sposed to get busy\nI tried to ignore it, stepped to the bar\nBaby said \"Everybody knows who you are\"\nI said funny, I had the same idea\nJust speak a little louder, make yourself clear\nI said nevermind baby, just disregard\nI grabbed her by the arm and I headed for the car\nAnd as we walked I heard a brother whisper behind me\n\"Be ready homeboy, she's got a big posse\"\n\n[Hook]\nYou ought to leave it alone\nYou ought to leave it alone\nYou ought to leave it alone\n\nThen we were in the parkin' lot, jettin' from the place\nBy now it was wide so I was hidin' my face\nA bitch rolled up in her car, horn soundin'\nShe said \"don't worry, that's some fellas that I'm down with\"\nI said oh no, how bad could this get\nThen I saw my boy and I started to sweat\nHe said \"Yo why you [? 3:33] oh I see\"\nTo hook with that big posse freak named Tracy\nI asked my man if he had the scoop\nHe said \"Yo Arab if you want the truth\"\nAt the Jimmy hotel or the Jimmy inn\nBrothers check in and are never seen again\nI said hold up, how could this be?\n*Record scratch*\n\"How many [? 3:49] was in the posse?\"\nHe said \"Well, if you really must know\nThere's Will and Phil and my homeboy Joe\n[? 3:55] and my partner Fred, that guy, and [? 3:58]\n[? 4:00] and this dude named Shine\nAnd the list goes on and on and on\"\nI said nevermind, I get the drift\nThis ain't the freak I need to mess with\nBut after all of that, I just had to see\n*Record scratch*\nNigga that bitch had a big posse\n\n[Hook (Interpolated with outro)]\nYou ought to leave it alone\nYou ought to leave it alone\nYou ought to leave it alone\n\n[Outro]\nSo there you have it members, that's my story\nNever mess with a big posse\nOr you're gonna end up like me\n*Snoring*", "year": "1989-11-28"}]}