{"artist": "Pimp C", "songs": [{"album": null, "title": "Free", "image": "https://images.genius.com/755227370d0d3fffabe599d486856318.960x960x1.jpg", "lyrics": "(Intro: Pimp C)\nHuh! It's goin down... knalmtalkinbout?\nHold up! Yeah... dedicated to everybody that's been apart of the struggle\nKnalmsayin? Hold up! Everybody who's got love ones locked up in that system\nSay man if ya people locked up you need to stay down wit'cha folks!\n(Stay down wit'em man) This commentary is very necessary knalmtalkinbout!?\n(Believe it...) Young Pimp out here representing for y'all! Hold up!\n\n(Pimp C)\nI'm back on the slab (slab!), back on the block (block!)\nWith the hustlers pleading a album, the crank, they froze on water rocks (rocks!)\nThe boy Emmitt had me shining when I stepped out the door (door!)\nI thought I had enough but James Toney gimme some more (more!)\nAnd the same damn day I went to the Bentley lot (lot!)\nOff the show room floor, I copped and splurged, that thang was hot (hot!)\nBut I bet all you busters already knew that\n'cause I was all on the internet gettin my shine back (back!)\nMaking rhymes stack (stack!), pimpin with my mic (mic!)\nEverybody want a piece just 'cause Sweet Jones is what they like\nThey like the pimp shit, take a trip, if I like it a pimp get\nBack floor, laid flow, UGK is back ohhh!\n{*Tom Petty sample*}\n\"Free!\"\n{*scratched*} \"I'm free!\" (then they got the word that they freed Pimp C)\n{*scratched*} \"I'm free!\"\n{*scratched*} \"I'm free!\" (even life after life, they ain't stoppin me!)\n\n(Pimp C)\nIt was \"Free Pimp C,\" but now see, the pimp free (free!)\nOld school gave me that before I left that CT (T!)\nTerrell check my bezzle on this platinum Jacob watch (watch!)\nThey locked up my body but my mind never stopped! (stopped!)\n'Cause I was plottin and plannin and schemin everyday\nGettin ready for my release so I can steal the game away\nFrom all these clone type niggas tryna sound like Pimp C (Pimp C!)\nHe's okay but he's not me! (uh!)\nBy a long shot, cuzz 'bout, tryna instill to me (me!)\nThem boys might run BET but trick we run the streets (streets!)\nIt's me and Bun B, that's for life, we the trill\nWhen ya see a pimp shinin, trick, tell me how ya feel! (how ya feel!)\n{*Tom Petty sample*}\n\"Free!\"\n{*scratched*} \"I'm free!\" (then they got the word that they freed Pimp C)\n{*scratched*} \"I'm free!\"\n{*scratched*} \"I'm free!\" (even life after life, they ain't stoppin me!)\n\n(Pimp C)\nI did 4 years tops (tops), never hit PC (C!)\nDid my time in Population with the real ole G's\nI seen a whole lot of pain, men doin they bids (bids!)\nMost of them just prayin and who tryna get home to they kids\nWasn't nothin like \"Oz,\" a bunch of iron and bars\nBunch of player hatin snitches, talkin to the guards\nAnd a whole penitentiary bein ran by broads\nSome of 'em kept it one hundred, most of them was frauds\nSeen a whole lotta chumps (chumps!), hard men and hustlers\nSome big time dealers, kidnappers and busters ('nappers and busters!)\nPimps and playas, I seen some kill with they hands\nBut I still don't believe the pen is no place for no man! (for no man!)\n{*Tom Petty sample*}\n\"Free!\" (P: But I still don't believe the pen is no place for no man!\nKnalmtalkinbout!?)\n{*scratched*} \"I'm free!\" (then they got the word that they freed Pimp C)\n{*scratched*} \"I'm free!\" (P: modern day slaves is down here knalmsayin?)\n{*scratched*} \"I'm free!\" (even life after life, they ain't stoppin me!)\n\n(Pimp C)\nYeah! Dedicated to everybody ain't gon' never make it up out there\nKnalmsayin?\nTo everybody doin life... keep y'all head up! (keep it up)\nDon't get fed up! Uhh...\nDo yo' time, don't let yo' time do you\nYoung Pimp!\nPicture me rollin knalmtalkinbout, like 'Pac told 'em when he came home...\nJumped in the five hundred...\n{*Tom Petty sample*}\n\"I'm free!\"", "year": null}]}