{"songs": [{"year": "2015-09-20", "album": null, "image": "https://images.genius.com/1020a41faaeb66aa3dabb5d3bc56e918.500x500x1.jpg", "title": "4for1", "lyrics": "[Verse 1]​\nAs a child I dealt with abuse, I'm fusing pain with the mic\nFelt like the world was on my shoulders, took attempts on my life\nI understand that isn't healthy\nLike, how the fuck could it help me?\nReflecting as an adult and realising I was selfish, but\nYou couldn't tell me no different\nTry all you want I'm not listening\nWe had no shelter or place we could turn\nThis shit is routine and the lesson I learned\nIs keep your mouth shut, the more quiet you are\nNo yelling or screaming inside of the house\nCause that wasn't ever allowed\nSee, I wasn't raised to believe I could possibly be anything that I wanted\nThere is no support for the kid with the home that is hectic\nWe were dissented\nTell me the way I should go\nEverything I should already know\nAll the emotions I'm willing to show\nMy adolescence, progression, and growth were stunted\nSo I'm feeling mentally stuck\nI live on the edge and I don't give a fuck\nA handful of pills, that was never enough\nThe way that I cope with this is living this up\nBut if I recall we had been through it all\nYou niggas are speaking no problems of poverty\nAs if you actually seen it\nBut bitch, when we lived in that trailer we never had nothing but roaches around and we couldn't complain\nMy parents would bicker, it's always the same\nMy mother was picking us up after school\nWe'd be in the back of that old station waggon\n96.3 on the radio blastin'\nSmokey Robinson would have us relaxin'\nQuiet Storm before we step in the madness\nAll of the peace that we had is now past us\nWalk in the door but there's yelling and screaming\nThere wasn't a place where I ever felt safe\nAnd I couldn't relate to the kids that I saw\nCause I felt that they all had it better than me\nCause they don't have to deal with the shit that I deal with\nI stay in the middle of arguments\nShitting myself and believing this shit is my fault\nEvery time they would fight it was grief\nClosing my eyes and my ears in my room\nWhen I opened them up, man, that shit never ceased\nAnd I want to be free but there's nowhere to leave\nI wondered why people keep fucking with me\nCause when I was in school they would tell me I'm slow\nCause I never attend anything I was told\nSo they put it on me like that shit was my fault\nCause there couldn't be something that was in the way or the place that I stay\nCause I never got help\nMy mother got tired from busting her ass\nLike, dropping us off and then going to work and then picking us up and then bringing us home\nTo a man that appreciates nothing at all\nWhile he burning a cigarette, staining the wall\nMonday through Saturday crushing us all\nBut gets up on Sunday to go praise the lord\nBut there's no time to time in those moments to spare\nI figured it out, that life isn't fair\nSo do what you can\nCause nobody cares\nIt's all about loving the memories that you have made in your happiness while you are here\nI pray that you live without fear\nAnd you never think you're in need of materials just to complete you\nCause that is the truth\nDon't be dependent on things that can dissipate or disappear when you need them the most\nLawd!\n\n[Verse 2]\nLook here\nI've been the man for a while\nMy definitive plan\nAnd I'm attentive to my terror lyrics of part too quick\nStyle constipated, I could never give two shits\nComing through your speaker like you need to go \"Who this?\"\nNow you need a nigga that's only giving you elegance\nI gotta kill 'em, regulator, moving with malevolence\nI try to paint a positive picture while feeling negative\nA sedative, I soothe 'em, assuming that I'm a sinner\nWhile sending you serendipity, I live in misery\nI'm playing Mister Misdemeanour, changing my demeanour\nFeigning for the fountain of youth\nI wanted wisdom and truth\nI know these other mother fuckers try to give an excuse\nBut my style is too loose, prefer to be reclusive\nI give a simple sentence, serenade ya with acoustics\nI been showing the way but nobody is tryna follow me\nBelievin' what I'm doing, I'll never make an apology\nI built the foundation for a fuckin' mauseoleum\nWith a citadel and mural like the Roman Colosseum\nInfiltrated by an infidel, I'll see ya when I see ya\nSippin' White Zinfandel\nI'm a connoisseur and conqueror\nA commodore with the cadence\nOccasionally I kill it\nI'm giving you food for thought, it's enough for a starving village\nMy image you won't acknowledge\nThe mileage up on my brain\nTime for an all-chain\nNow pay attention, I switch it\nEfficiently give a vision\nThe mission is motivated\nI make it a point, I plan it\nI done managed to manoeuvre\nThe music is too melodic\nDon't play it for any novice\nI'm modest? My nigga, never\nI focus on getting better\nEmbarrassing anybody\nYou niggas plotting for profit\nAnd politicking with others, evasive is what we are\nI'm working but never seen\nIt's all a part of the plan\nThere's a method to the madness\nYou'll never understand\nI can spit it any way that I want\nBut you thought I want the flow they never really noticed\nWhen you giving up your time\nAnd in your mind you're thinking \"Man, I'm just a Diamond in the Ruff\"\nI know it's hard, you're feeling down\nBut when you get above the ground\nI guarantee that you'll survive with nobody up on your side\nWhenever you do decide you finally feel alive\nWe in love with the truth, we never telling a lie\nI promise to give you honesty for the rest of my life\n\n[Verse 3]\nMan, I swear to god I would never give you nothing that was average\nA young black savage\nFast rap bastard\nEither way, you see me as the master\nOwned a plantation, delicious destruction\nMy shit is salacious\nDistribute discussions, attributing to how I think I can function\nThese guys on the internet think they something\nOh no\nTime for me to put them in their place, quick\nLyrically impeccable, punctually embracive\nFace to face, your fade, it fades, refrains to fame is fake as fuck mistakes that I make\nI gotta work with that selective amnesia\nFocus on the text and follow all of the procedures\nMaybe I'll take a break cause I'm tired I want a breather\nI know these evil mother fuckers would like to deceive us\nJesus are you there, do you hear a nigga talking?\nI been calling you for years but I feel you just ignoring\nLike telling your secretary, \"Jot it down, he's not important\nTake his name and his number and tell him I'm busy\nI'll call him when I can\nIf I ever get the chance\nIf he's giving you attitude then just fuck him in advance\nI ain't blowin' him up\nCause I know that nigga needed me for forgiveness of his sins\nHe need a pen and wanna run but he dependant on the pain\nCause that's all that he's got man, I know that's the truth\nSubjecting myself to silent solitude\nWith no silence inside of me, soon to subdue\nI'm submitting myself when I plummet\nI pray they put poems inside of my casket\nMy posthumous spirit is piercing my peers\nDon't adhere to the fear\nOr the feel I appear at the peak of a pyramid\nPissing on pitiful peons for penance\nThere's plenty pretty petty pressing matters that I know that I need to address\nMy sobrieties\nFirst I get I high in excess\nThat don't equal success\nIt just means I feel less than alive\nI'm surprised that I made it as far as I have when I'm lacking a moral compass\nAin't ashamed of my past\nStill remember when them niggas told me I was trash\nI wanted to spit a couple of bars, but I'm aware that they would laugh\nNow I never think about them cause all I did was surpass them, lawd!\n\n[Verse 4]\nI said I'm tryna make a way\nI need the world to make a masterpiece\nThe devil's on my ass\nThat dastardly deviant chasin' me\nReplacing my emotions\nI'm motioning towards the negative\nMy nepotism navigates\nI'll never reach the narrative\nYour negligence is never necessary\nIt's nefarious\nThe window's getting smaller\nLooking down a narrow barrel\nBullets flying like an arrow\nAllocated by your hatred\nHindering the possibility to possibly make it\nAye please, when you rise, tell me what the fuck you really see\nI pray that you can recognize and find spirituality\nHoo!\nDon't you know fatalities and fallacies are definitely on the way?\nIt's babies killing babies basically\nCause don't nobody think I know they have secret agendas\nTo generalize a people of color\nFormally cover but covet cash and account for a drinking\nA diamond link\nAnd give them all the tools they need to make sure that they become extinct\nI try to tell all of my niggas\nWe are an endangered species\nBut am I the only one that sees or actually believes to see this\nSick and in my seat I seem to see the seed they planted\nPlants are thrown out of the window of a moving vehicle\nI mean I veer and steer\nA benefit that fear is fabricated\nFace it\nBase it in my lease of predjudice and poorer confidence\nIgnoring the injustice of a judicial system\nThat puts a race of people away at a rate that's faster than rabbits\nAttack it from the inside, destroy a black family\nContra' did a lot of hurt that we have not recovered from the 80's\nThey put drugs and guns inside of our communities\nAt least the inner cities to make sure there isn't unity\nConfusing that you think this isn't a genocide\nWe statistics mother fucker but we in need of some rest\nAnd I supply the sentiment if there's actually any left\nCause it's either incarceration or seeing an early death\nIn the depths of my soul like the test of control like a test\nI've been tested, they lessen the blow\nOn the spot they align and combine as a full\nWhile exposing a posing impressionate person you'd personally\nWith their personal preference\nNo pardon for passes presented for people to place an opinion\nOf pitiful, pungunt, disgusting provisions\nI need to prepare as I peek with a pair\nThat's my pain and my passion, you cannot compare\nIs it clear that I'm here?\nCause I hear that they heeding my messages\nHeated with heathens, they heavin'\nA heater to heat up the block\nAnd then chop when they eat up the people\nThey call up the cops\nBut they can't stop the evil\nThere's forces at work that will not embrace change\nIt's insane how they think all black people the same\nLawd!\n\n[Outro]\nEh! 4for1. That's it. T-that's it. Next week we gon' give you 5for1 then the week after that we gonna give you an entire mixtape that's just one fuckin' track. That's it\n(Good work dude.)\nI appreciate that, I appreciate you recognising all the work. It is a lot of work. It is a lot of work. Fuck! That's it, 4for1"}], "artist": "K.A.A.N."}