{"songs": [{"lyrics": "( *scratched line from the Aceyalone recording \"Mr. Outsider\"* )\n(Get involved on how the world revolves and evolves)\n(...solve all that you can solve before your mind dissolves)\n\nGet down right dirty on em hella quick\nPut air in your tire, step in the shit\nBust raps, caps, throw rocks or pick up a stick\nHow you gonna handle it when it get thick?\n\nI learned real early that life is hard\nSit down at the table, get dealt yo cards\nMight get a good hand, could get a bad hand\nThe hood lands and bad lands done turned you to a mad man\nBarely can sleep at night\nTryin to make the ends meet just to keep it tight\nYou want what he got but he ain't got much\nIt's a beautiful thang that you cannot touch\nAnd you want what she got but she ain't got much\nAnd to do or die, you never heard of such\nWell, it's the luck of the draw, some come up short\nI know you wanna keep your boat and you're bumpin afloat\nI wanna double my notes, I don't wanna vote\nI want everyone to read what I wrote\nBut most likely life ain't a bowl of cherries, though\nSame old scenario\nSometimes it's just sour milk\nIn the hour of guilt your flowers wilt\nAnd it's all in the power of what you built\nYou wanna lie in your casket with gold and silk\nAs for I, wrap me in Kinte cloth\nGive me my respect due and then step off\nCause people nowadays'll straight twist you up\nHave you broken up but can't nobody fix you up\nI was sayin to myself I was gonna do somethin about that tomorrow\nYo yo, check it\nBut you was lyin to yourself and that can make you sick\nSo get down right dirty on em hella quick\nPut air in your tires, step into shit\nBust raps, caps, throw rocks or pick up a stick\nHow you gonna handle it when it get thick?\nHow you gonna handle it when it get thick?\nHow you gonna handle it when it get thick?\nGet down right dirty on em hella quick\n\n(The world is full of bullshitters\nLiars and triers and quitters\nCoulda-been's, wanna-be's...)\n\nI learned real early that life was hard\nNever ever shit in your own backyard\nNever fake the funk or front to play the part\nBe smart, live life love, respect the art\nCause people take kindness for weak and prey\nAnd they take for granted when you say what you say\nThey take advantage of the fact you give your heart away\nYou should be able to see through these games people play\nCause people just use you, it just won't stop\nYou won't say nothin and it makes you hot\nThey say they're your friends but they really are not\nBecause they only out to try and get what you got\nThe Jones' - what a classic case\nIt can turn a nigga into a bastard case\nI know they all runnin to see who is the fastest in the race\nYou might as well get on your knees and ask for grace\nCause many will lose but some will come in last place\nAnd many get bruised but some get blasted in the face\nSomebody once told me that people were strange\nI never knew what it meant till I seen some people change\nI know you really want it but it's out of your range\nAnd if you plan to get it then you gotta take some pain\nYou gotta master the fear\nYou just say: \"Fear, come here,\" and drop a bug in his ear\nAnd tell him to disappear, rid him, buy him a beer\nNo hard feelings but some people turnin the tricks\nSome say it's just a natural pick\nIt's like Darwin's theory, but y'all don't hear me\nStrong is how they skim me\nNever with the gimme-gimme\nBottle water or a shot of Rémy?\nMy name is Ace One, baby, not Timmy\nAnd you can get the jimmy\n\nYou get down right dirty on em hella quick\nPut air in your tires, step into shit\nBust raps, caps, throw rocks or pick up a stick\nHow you gonna handle it when it get thick?\nHow you gonna handle it when it get thick?\nHow you gonna handle it when it get thick?\nGet down right dirty on em hella quick\n\n(I was taught to be badman, shoot yo shot)", "title": "Down Right Dirty", "album": "Accepted Eclectic", "image": "https://images.genius.com/4f38e699f6f80a3255420adf5e98a0a8.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}