{"artist": "Bone Crusher", "songs": [{"album": "AttenCHUN!", "title": "Ghetto Song", "year": "2003-04-29", "lyrics": "[Intro-Bone Crusher]YeahUn-huhWhoa!Vainglorious, open ya ears and listenBread and Water just place meyes, indeedBone Crusher, whoaYes!Some of that Break 'Em Off (the terror spectrum to what I do)Okay, listen closelyListenListen\n\n[Chorus]I'm just riding in my homeSinging this ghetto songIn this hood I call homeSinging this ghetto songWhoa! Singing this ghetto songSinging this ghetto songSinging this ghetto songSinging this ghetto songSinging this ghetto\n[Bone Crusher]I told y'all I'm gheto for lofeI'm always heavy I'm never in lifeBare last from Chevy gotta keep it tightAnd my hood run through me so I'm repping it rightVainglorious, my niggas can trustThat I got they back when it's time to attackKeep grinding and trapping for ya paper\nYou know they gon hate so you keep it struggle, player\nGonna hustles, the grown muscles\nMy uncle told me that these streets touck ya\nAmazing, huh I just love it\nI still hear my grandma fussing\nI'm country cousin\n\n[Chorus]\n[Lil Pete]\nLil Peezle\nBone Crusher\nD.S.G.B\nY'all know how we do it\nWhat's up\n\n[Lil Pete]\nNigga ghetto for life and I'm Be here forever\nThug niggas from these streets and we hustler for cheddar\nSo we can live better and have bigger thangs\nBlow joke all day and sip on champagne\nSee in this that I call home\nWe slang crack all night till the early mourn\nFirst street across the Georgia where I got it on\n\nSticky pants and t-shirts with my fucking stone\nMean-mug on my face everyday, home\nI keep my radio tune to this ghetto song\nAnd pray to God that it won't be long before we hit the top\nI shit blow up nigga and hit the fucking chart\nA nigga riding\n\n[Chorus]\n[Bone Crusher]\nHit the rib shack for a little snack\nI see this little shawty with the donkey in the back\n\"Only in the hood with ya fineness, just so fine ghetto princess\"\nWhy not? My focus is all that I got\nShout's out to Goodie Long stay strong Cool Joe\nWe done it we all foe\nI wish them young niggas would get off the blow\nBut it's like this in every ghetto\nBut I stay strong maybe thers's some hope\nI like to have fun but life ain't a joke\nSometimes I just wanna sit back and smoke\n\n[Chorus] (2x)", "image": "https://images.genius.com/f876b4f8425da6aa087ea52964273bfc.180x180x1.jpg"}]}