{"artist": "G-Eazy", "songs": [{"title": "Dear Ms. Rose", "album": "The Outsider", "year": "2010-01-01", "image": "https://images.rapgenius.com/969ca41528b3bf938eea0ee236f0e02f.800x800x1.jpg", "lyrics": "[Produced By: G-Eazy]\n\n[Hook]\nBaby, I could rule the world\nWith a girl like you, in my arms\n\n[Verse 1]\nHigh up, I was chillin in class\nWith a magazine open, trippin' staring at that ass\nAnd think I fell in love, or maybe it's the grass\nSittin', thinking to myself we could forget about your past, see\nI wouldn't care if you were, a, prostitute that you\nHit every rapper that you ever knew, see\nIt wouldn't matter, we let them blogs chatter\nSee I love your whole swagger, and I know you like rappers so\nLet me know I'm tryna find what you're open to\nI kiss both lips I got pipe for the both of you\nFantasize about you so long, now I'm hoping to\nTry to get you home and put it down like I'm suppose to do\nYeah, and see I'm trying to get close to you\nI'm just being real cause I ain't found nobody 'dope as you\nDreams of fuckin' a bad stripper bitch, turn super star chick, swagged out super rich\n\n[Hook]\nBaby, I could rule the world\nWith a girl like you, in my arms\n\n[Verse 2]\nMan, hell nah she ain't a gold digger;\nWhy she only fuck with rappers then? Go figure\nLow bank account, you ain't gettin laid\nIf you fuckin' with this girl then you better be paid, know why?\nTakes too much, believe me\nFrom what I've heard she got a baby by Yeezy\nSomebody even told me that she fucked with Amari\nLeave the club and drive off in somebody's ferrari\nHeard she used to fuck with Fabolous and Wiz\nOr at least that's what the tabloid says\nYou the baddest in the game; baddest in the biz\nAnd if i ever met you I would tell you what it is\nSee, the only person I could see myself with is\nYou Ms. rose but I'm tryna make you misses\nA top notch for you, set a bar for these bitches\nAnd I flipped the fuck out when world star leaked pictures\n\n[Hook]\nBaby, I could rule the world\nWith a girl like you, in my arms"}]}