{"songs": [{"album": "Killer", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg", "year": "2008-07-01", "title": "Can’t Shake It", "lyrics": "[Intro: Tech N9ne]\nAnother piece that I wrote, about me\nBeing stuck in my ways, yeah\n\n[Hook: Krizz Kaliko]\nAnd I can't give up what I'm in love with\nI guess I'm a mess and I just can't shake it\n(I just can't change what I am)\n\n[Bridge: Krizz Kaliko]\nWhat did I do to be so wrong?\nCould I be so different?\nIs there a remedy?\nWill you be forgivin' me?\n'Cause this ain't my life\nOr the way it was supposed to be\nWaiting here for you to come and tell me\nWhat I do so wrong?\n\n[Verse 1: Tech N9ne]\nListen to me, this talent was given to me\nBy his omnipotence, so dig it\nMusic is livin' through me\nEven through prisons I've arisen he big and is in movies\nIs him as if his is a hit, the vision is in beauty for women\nWhen I'm writin' I'm winnin', so excitin' I'm grinnin'\nThen you strike and now the fights are beginnin'\nI gotta be sharp as a knife when I'm on the mic and you sinnin'\nBy stiflin' my spinnin', what imaginary life has you been in?\nBy thinkin' you be the reason, no speakin' to you this evenin'\nI'm deep in this music reachin' for the piece I dilute the season\nBut you be illin' because my attention you truly stealin'\nPursue the millions, come in second-would you be willin'?\nDon't think so, you be thinkin' time and I think dough\nLove is what you need from me, but in time it'll shrink mo'\n'Cause I be on the grind for this rhyme and the ink flow\nI go for mine and you think it's a crime, and I think \"WHOA\"\n\n[Hook: Krizz Kaliko]\nAnd I can't give up what I'm in love with\nI guess I'm a mess and I just can't shake it\n(I just can't change what I am)\nAnd I can't give up what I'm in love with\nI guess I'm a mess and I just can't shake it\n(I just can't change what I am)\n\n[Verse 2: Tech N9ne]\nEverything in my closet is black, white and red\nMost of my homies was bosses but got life or dead\nNow I move in they shadows but I got the mic and bread\nBut this life it seem ya destiny is a knife or lead\nYes I was brought up in a Christian house\nBut my mother marrying a Muslim threw the Christian out\nAnd what they did to Malcolm X threw the Islam out\nSo my homies with money seemed to be the glistenin' route\nWhat I found was funerals and I found it was real friends\nBut I paid attention and then I found it was real men\nTakin' care of their families automatically built in\nRiskin' they life in the street as long as the wheel spin\nSo, what I gathered from it is simply my prerogative\nI only wish the organization was more positive\nI maintain, and continue to gain thangs\nI bust and I claim Strange but I'm reppin' the gang bang\n\n[Hook x2: Krizz Kaliko]\nAnd I can't give up what I'm in love with\nI guess I'm a mess and I just can't shake it\n(I just can't change what I am)\nAnd I can't give up what I'm in love with\nI guess I'm a mess and I just can't shake it\n(I just can't change what I am)"}], "artist": "Tech N9ne"}