{"songs": [{"image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg", "lyrics": "[Produced by Black Diamond]\n\n[Intro]\n(What are you afraid of?)\n(What are you afraid of?)\n(What are you afraid of?)\n(What are you afraid of?)\nUh... 1 2 1 2...\nSometimes I see the uh\n\n[Verse 1: Mac Miller]\nSometimes I see the world for how fucked up it really is\nI tell myself I'll be the one to make a change in it\nI could die tonight, not make it to the sunrise\nThen I couldn't heal the pain in it\nI'm gettin' high to forget about the lows though\nGet a pay check, spend it all on polo\nDesigner brands cover up my insecurities\nPersonally I ain't nothin' but an average Joe though\nNow I'm dressin' so expensive, for no reason\nCold world we livin' in, it's below freezin'\nI got a family, can't afford a coat\nSo I leave a little paper there before I go\nSpend a thousand on a hotel, they poor and broke\nMade me wonder who I'm prayin' to before the show\nThis a letter to whoever, I'm just tryna set you free\nRemember love, if you can't, remember me\n\n[Chorus]\nDear people on earth after I die, what's the weather like?\n1, 2, 3, 4, 5, 6, 7, 8, and I ain't perfect but I try\nHey, I wonder if I'll maybe get a second life\nThis time I'm a get it right\n\n[Verse 2: Mac Miller]\nIt's either God or the devil with these drugs I'm on\nI don't know if we were meant to see it all like this\nStill, plantin' seeds so my money long\nMoney addict, it's a habit that palms gon' itch\nI wish we could just all get rich\nSometimes not havin' money is all I miss\nAnd yet these hoes that roll up on my dick\nThe all American girl, that's just a blond head bitch\nAm I supposed to have some thoughts like this?\nCould we figure out what God might've miss?\nIt's funny that these questions never get an answer\nLife a bitch sometimes you got to reprimand her\nNever understand her, why should I even try?\nLive forever then you never feel the need to die\nThis a letter, open it to set you free\nRemember love and remember me\n\n[Chorus]\nDear people on earth after I die, what's the weather like?\n1, 2, 3, 4, 5, 6, 7, 8, and I ain't perfect but I try\nHey, I wonder if I'll maybe get a second life\nThis time I'm a get it right\n\n[Bridge]\nWhat does it mean to be a sensation? Do you have to be sensational?\nAnd how you know you made it?\nWhen you're with Killa Cam, watchin' Paid in Full\nI never had good grades in school but, shock the world is what I came to do\nI got a song I wanna play for you, so can you sing that back to me?\nWhat does it mean to be a sensation? Do you have to be sensational?\nAnd how you know you made it?\nWhen you're with Killa Cam, watchin' Paid in Full\nI never had good grades in school but, shock the world is what I came to do\nI got a song I wanna play for you, so can you sing that back to me?", "year": "2012-03-23", "album": "Macadelic", "title": "1 Threw 8"}], "artist": "Mac Miller"}