{"artist": "Apache", "songs": [{"title": "Keep it Real", "image": "https://images.genius.com/66f24da907f003ff87b754c05433c20b.366x366x1.jpg", "album": null, "lyrics": "[Intro]\nAnd you don't stop\n\n[Verse 1]\nRappers grow, develop flows, do shows, get hoes\nMake it big, then start steppin' on toes\nBut you missed one, mine, now you can't last\nStep on my toe, you get ten toes up that ass\nDon't even think about tryin' some snake shit\nOkay, today we're talkin' about fake shit\nWas it a friend or colleague, tell me what was it?\nYou flipped your script when you got your bullshit budget\nYou went gold and can't speak no more\nFuck you, your crew, and your fuckin' tour\nPoppin' shit behind my back, time to get got\nThe penalty for that is five to ten speed-knots\nI'm here to bully and bogart, I hit hard\nSet em up to get wet up, dump em in somebody's yard\nTie em up and make em squeal\nThe last three words he hears is 'keep it real'\n\nKeep it real\nAnd you don't stop\n(And I'ma let you know)\nKeep it real\n(Probably a punk)\n\n[Verse 2]\nIndustry rule number 4080-one\n(If you come to battle, bring-bring a shot-shotgun)\nI hate the fake, if you perpatrate, flee\nTime to wreck shop, and all you can do is stop speakin' to me\nMC's that get too big for their britches\nEnd up in stitches or gettin' robbed for their fuckin' riches\nForgot where you came from, gassed up\nGo back to your old block and niggas smack that ass up\nYou know the rules, challenge him to a rap scrimmage\nSha said (Yo, 'Pache chill, that's just his image\nAnd shit) So I chill and won't say shit, see\nNo bull, I got pull, only a handful can fuck with me\nBringin' misery is my mission in '93\nSo be nice and think twice before steppin' to me\nTie him up and make him squeal\nThe last three words he hears is 'keep it real'\n\n[Verse 3]\nSome new fame is like a flame, let me explain\nIt can blaze for days, then it's out, but who's to blame?\nYou, or is it the things you do or did?\nIn fact, sometimes I think back to when I was a kid\nTimes were hard, I got harder\nCouldn't afford a 40, so you didn't wanna be bothered\nWouldn't pass a spliff, couldn't get a lift\nStarted runnin' with the Flavor U and got swift\nNow you come around talkin' that 'we boys' shit\nThe way I live, I forgive, but I don't forget\nTie him up and make him squeal\nThe last three words he hears is 'keep it real'", "year": null}]}