{"artist": "The Game", "songs": [{"title": "400 Bars (The Skeemix)", "album": "The Red Room ", "year": "2010-04-15", "image": "https://images.genius.com/c29ad051157cf4c1ccc0b446193e685b.1000x1000x1.jpg", "lyrics": "It's been a long time, get re-acquainted with the world famous\nYou know how on point my aim is\nLong range sniper's, clash of the titan's, chrome pipen'\nIn this 300 like Leonidas\nSnub in the bubblegoose, riding down the interstate\nWhere fiends put them needles in they arm and let 'em penetrate\nLeanin' sideways with my fitted straight\nThe 27's on point, the paint job a New York minute late\nCheck my Audemar, no cloud's in my stones\nProject's ringin', standin' by the corner store\nTwo Glocks on me, BANG BANG if you wanna war\nThat was '05, now we ballin' on this tour\nScreamin' out \"Thug Life\", pourin' Belve on ya whore\nMoney I'm involved with it, wake up and ball with it\nKobe/Gasol with it, uncut raw with it\nChop bricks take trips ot\nBefore I had a goatee, I used to bag the Oz\n(Yeah, fish-scale nigga, What up Ghost!?)\nThen stash 'em by the oak tree, move it by the coke leaf\nDrama let the llama Knick niggas like Charles Oakley\nNigga don't insult me, I banana boat B.R.C.K.S.'s\nAnd stuff 'em in the Lexus\nI'm sitting fat like Precious, Christ up on the necklace\nAnd I keep them clips on a dresser\nYes sir, I'm bout to ball, Louis bag the fuckin' mall\nBitches, money and fast cars, nigga I want it all\n(Yeah, word to my kids nigga, I want it all)\nNascar Game, why the fuck would I stall!?\nI'm the franchise nigga, Chris fucking Paul!\nEmpty out the cannon hit ya bitch, you the truck and all\nWithdrawal 200 thousand, and then FUCK it off!\nKing of the hill, gotta dime bitch cuttin' raw\nShe bagged the last nick', I unzip, she suck it soft\nBlack Superman, yeah, I'm above the law\nI put this hollowtip a quarter inch above ya jaw\nEat out a FUCKIN' straw!\nBlindfold your bitch toss her in the trunk\nAfter the first 48 that bitch smellin' like a skunk\nIt's a wrap, I rap, when I wrap the punk\nThrow me in the gang module and tell 'em wrap the bunks\nThe breakfast club nigga, no Captain Crunch\nThis for my dog nigga's that eat cat's for lunch\nI'm hungry like I ain't trapped in month's\nSo nigga act and stunt, my Glock pack a punch\nOr I can Heckler-Koch, and seal your pine box\nLeave your head wrapped for months, while I pass the blunt\nTo my niggas, we all Roc'd out, what's up Jigga?\nSometimes I be in BK, with Fab' on the freeway\nLincoln Continental and I copped it off a eBay\nI pop cham. like it's my b-day, horse power\nUnder my hood like it's an olympic relay\nMy flow right on time, no delay\nI raise a million dollars, send it off to Chile\n(Word to my red cross, I don't fuck with the Red Cross)\nI'm All-Madden nigga, EA, I'm in VA\nMoney talks with Dre and Pharrell on 3-Way\nThem 28's, that's my DJ, they spinning shit\nWhen I took trips OT, I never rented shit\nI just drop then cop, and then I tinted shit\nDiddy and Mike Epps, I'm All About The Benjamins\nIn it for the benefits, I'll be down in Ten to 6\nTell 'em get me a Porterhouse and some eggs-Benedict\nDamn that was good, but I'm still hungry\nAnd I'm living it, I be out in Venice, shit\nThey say Weezy-Jordan, nigga I'm on my Pippen shit\nThey say Drake-Lebron, I'm on my Moe Williams shit\nIf T.I.P. is Kobe then fuck it, I'm Derek Fisher, shit!\nLong as I'm in the starting five, I'm a get it in\nCause I promised the city of Compton, I would get it in!\nI was OutKast'd... Andre Benjamin\nNow I slide through with my Dominican woman friend\n(She like puttin' No Ceilings in, yeah)\nGiuseppe Heels, expensive wines, Perri seal\nIt ain't tricking, I just spend money on cheap thrills\nBig Phantom's, sweet wheels\nBack seat like a club, make them bitches eat pills\nTake Patrone shots to the purse with chrome Glocks\nJay Electronica, this a dome shot\nSo I had to steal it, nigga I had the kill it!\nI was the turtle in the race, I made the rabbit feel it!\n(Yeah, keep runnin' nigga)\nHousing by the subway, feel it through the projects\nCome through the Murcialago, a foreign object\nNumber one prospect, the day that I was drafted\nAftermath-matic unleashed a fuckin' bastard!\nDon't respect none of you niggas, get in the casket!\nTalking ratchets, never touched a fuckin' automatic\nDrama this is tragic, put it in the plastic\n88 bars and runnin', throw it with my other classics\n(Drama you should've warned these niggas, I'm bout to kill 'em)\nYeah, trash bag it, this is crack\nAnd I know you been fiendin' for this, come get your packs\nI do it for the music nigga, fuck the Plaques\nAin't on no beef shit, but it's still FUCK the rats!\nAnd when I'm in New York, I set a bunch of traps\nPut the cheese where they can see it, and if you stunt, you clapped\nCatch 'em in the club, that's when I stomp 'em flat\nNigga get up after that, go get a fucking bat\n(I tell you bout these fucking rats!)\nThey either snitch or bend over to catch\nNo matter how you look at it, I hate fucking rats!\nGet my bottle of Ciroc and I twist the cap\nSit back watch the NBA play-offs and roll a bat\nYeah, real fat, yeah, all I do is stack bread\nIn the hood on the wall like a fucking Phathead\nTwo nines on your back, Warren Sapp, yeah!\nThis my block and you niggas can't trap here\nUnless you wanna get clapped here, head wrapped, yeah\nI'm killing niggas, I should have a hundred tat tears\nCelebrate your death, toast bottles and clap beers\nIt's gon' be a cold summer, come through like burr!\nThe red Phantom bullshittin, the 25, Steve Kerr\nThe beat insane, Just Blaze in this mothafucka\nThe cars outside, the 'K is in this mothafucka\nI should let off a couple strays in this mothafucka\nFuck that, I'm tryna get laid in this mothafucka\n(Yo, tell your friends to get with my friends... Yeah)\nMeet me in the parking lot, license plate Aftermath\nScreamin' out \"Fuck 50\", wouldn't snitch for half his cash\nIf he wasn't such a bitch, nobody would've had to blast\nThey stood us down in Jacksonville, don't make me have to wrap ya Jag'\nCause I rather be in Saint Tropez, unpackin bags\nWith bitches that speak French, how you say: \"catch a cab\"\nI don't trip Euros, I don't trip Pounds\nI bowlin' ball bitches, till I knock 'em all down\n(Like the '93 Pac, I Get Around)\nDuffles by the staircase, crack by the backdoor\nNavigate my way through the South, I used to trap ho\nAll the way through Queensbidge moving packs yo\nMight've lost a couple friends, but I got my gat though\nBlast fo', my Rap foes could never stop my cash flow\nHad a Nike box of hundreds, when I was in that RAV4\nBut now I pull up in that truck with the crash board\nWith the mag low, give you everythin you ask for\nSometimes, I can be a fucking asshole\nIn the bank with my mask on, look at this nigga A-R\nDon't take your fucking mask off, bitch empty out the cash drawer\nWe on a suicide mission, but we don't give fuck\nCause if we make it out, bigger house bigger truck\nI'm in a strip club with a Glock, nigga what!?\nGimme your bitch, she got a cuter face and bigger butt\nI ain't gon' do shit but pour champagne on her\nHit it from the back and watch half of the Laker game on her\n(Don't put that back on, too many cum stains on it)\nRun a train on her, call Cartoon\nHave 'em tattoo my name on her, Star Trak too\nYou know what? Fuck it, Aftermath too\nPut a little smoke around it then take it home and pound it\nHelicopter outside, nigga I'm surrounded\nHad a spot in the Jungles till the fuckin Fed's found it\nMomma, your son got a public announcement\nI got 5 million in the walls and the couches\n(Don't even think about it... We got cameras, dogs and guns)\nAsk Pe-Pe, he was there, he can vouch it\nThrow it in the trashcan on some Oscar The Grouch shit\nA bunch of green popped out, time to re-route shit\nSettle down in Mississippi, gotta down South click\nAnd my niggas like, \"we ain't know all about this\"\nAnd any nigga ever snitch, got his fuckin' mouth fixed\nYou get 25, he get his fuckin' throat slit\nCut 'em like Filet Mignon and throw em off a boat, bitch!\nFeed 'em to the sharks then dock the yacht\nOil in the water, damn the ocean so thick\nTime to finish off his niggas on some trench coat shit\nIt's a drug war, real life, Grand Theft\nCatch you in the streets fuck you up and hit ya man next\nCome through on some retarded shit, just sprayin' techs\nWhere my dogs at? tell 'em I'm crazier then DMX\nLazier then Chinese eyes, when I'm puffin that\nBlueberry, I ain't talking where the muffins' at\n(Roll up the sour diesel if you want nigga)\nI split open the dutch, then I'm stuffin' that\nYou should get a flight to California, come fuck with that\nThat's all you, go ahead, hop in the truck with that\nTake it down in Cashville and hit Young Buck with that\nDon't bring nothin' back, Border Patrol cuffin that\nI ain't trying see the pen, and have to get my knuckles wrapped\nI wake up real early, keep lunchin fags\nThis shit easy, you Rap niggas my punchin bags\n(I got some combinations nigga, Pacquio shit)\nTalkin 'bout you poppin tags, talkin 'bout u poppin Cris'\nWhere u get it poppin at? Nigga u ain't poppin shit\nBut a X pill, as I turn the Lex' wheels\nI got a mean Phantom, very upset grill\nTell'em why you mad son, that nigga pulled a fast one\nYou know who you are, when I see you that's ya ass son\nBut I'm in the club, throwin' shots like my last gun\nIt's 2o'clock, YURR, gotta make a cash run\n(Yo, go get the truck from around the corner, tell Wack I'll meet 'em outside)\nInto the 7-11 bout to blast one\nThis nigga A-R will not keep his fuckin' mask on\nDeal with it when we get to the crib\nYou niggas is wildin'! Wait till we get to the crib\nAnd split this fuckin' money up\nHit the block and dummy up\nShave the onion, slice it down the middle, that's a tummy tuck\nThat's how we do it in Compton, FUCK the Police!\nDefend my hood like an NHL goalie\n(Sometimes it's cold on these mothafuckin' streets nigga)\nIced out Rollie\nAnd I still remember everythin' that Dre told me\nRed Polo fleece, sippin on that O.E\nNever been to jail cause I never had a cold D\nDo it just like the O.G.'s\nCut the Impala in half, insert the gold D's\nThen bounce this mothafucka till it got a slow leak\nFlatbed pick it up and you know me\nI'm goin with the car, all night, no sleep\n(Gotta get this mothafucker back on the strip)\nNext day we in the red Phantom, 4 deep\nKids runnin up to the car, block off the whole street\nIt's the ice cream man like the Ol' P\nCali like the Lion's o-line, it's where the holes(hoes) be\nBC runnin shit like a nose bleed\nDon't get it confused or screwed like Codine\nMore swag then the niggas from the show-me\nThat's ya bitch I'm bout to Mac her like Goldie\n(Shit, together we can rule the world baby)\nBlacked out Cartier, Four Season's caviar\nSpray a lil Diddy on it, that'll get their panties off\nNigga see me in the lobby lookin like \"damn he soft\"\nCatch me outside where I can let this cannon off\nSoo to the Woo, bet I let this cannon off\nAnd put everything in the clip right where u standin, dog\nRide off in a Mazi' like can I ball?\nFor the bucks, I'm tryna get it like Brandon dog\n(Young Money clearly NBA rookie of the year)\nI'm still standin tall wish the Twin Towers was\nTake innocent lives, that's the type of shit a coward does\nI'm just reminiscin', smokin' on the sour, blood\nTake a couple more hits and pass the shit around the bus\nU can't tell me shit I done seen a thousand drugs\nHundred rounds in ten drums, that's a thousand slugs\nOne day I flipped the kitchen table, found a bug\nKept lookin', found another one, right around the subs\n(Ayyo, Fed's can u hear me? God damn)\nI was takin a shit, then I seen one by the tub\nFeedin' my fish, there's a wire right by the rug\nDumb mothafuckers this is not where they buy the drugs\nThat's Salami in the kitchen that we fryin up\nThe world full of bitches, all the niggas dyin' up\nThey strechin' niggas out for crack, all the fiends tryin dust\nWe got some mean smokers for the sack they tie u up\nQuarter sack and get the pound, brick burn the house down\n(The connect ain't gon' think that shit is funny)\nThe fuck these niggas laughin at? Run up, u got some cash in that?\nKnock on ya momma's door, ya head sittin' in a bassinette\nWhile I'm on a G4, smokin' up half the jet\nAll season in New York, smokin' up half the Jets\n246 bars ain't broke half a sweat\nJust got half a mil', gave the hood half the check\nAnd I done shot it out with probly over half the 'jects\nSometimes just for the love, the other half, respect\n(That's that HOOD shit, I'm livin' GOOD bitch!)\nOut of my mind like breakin' off half an X\nMovin through Hollywood faster than a bag a Meth\nYup, nigga's better watch they step\n'Less they in a fraternity, but that ain't concernin' me\nLet's get back on this ape shit, back to the basics\nCold words, flip birds in the kitchen with cake mix\nYeah, Betty Crocker that, then hit the block with that\nCut off khakis, house shoes and a stockin' cap\n(Hit the Swapmeet... Get me some white T's, red-tip socks)\nMy flow a 38. don't make me have to cock it back\nShoot it like Olajuwon and bring the old Rocket's back\nTwo holes in ya face where ya sockets at\nBring the whole hood out and show 'em how to drop a rat\nThey got them brand new Porsche's out, I'm coppin that\nV12 under the hood, ain't no stock in that\nPanoramic sunroof, me and this chick watchin glass\nMy hood is like cameras in the bumper, watch ya ass\n(Get ya ass smoked around these parts, youngin')\nWhat the fuck u thought? Ride up bangin Too Short\nSmoke u like a Newport, nigga this ain't New York\nI be in the jungle with lions or in the zoo lost\nOr with my wolves that's dyin' to get they tools off\nCity Of Angels, be careful who you cross\nNiggas'll run in Mr.Chow's and take them fuckin' jewels off\nRappin' all that goon shit, we all know that u soft\nA baby's ass in the Martha Stewart face cloth\n(Or a box of cotton, stay pushed 'til your rotten)\nSo, nigga you stay on your Rap shit, while I stay on my trap shit\nMy, bust a gat shit, Busta hit me like: \"u wrote 400 that quick? \"\nNaw, 282 and that's just cause the track sick\n120 more, welcome to the liquor store\nSame one that frog sent me, lil' nigga get the raw\nAnd I did it, Cedar Block, I'm with it\nWho you think got all these niggas in them Cincinnati fitted's?\n(Yeah, took America and Ken Griffey'd that)\n7-5-8's, throw on my crown, throw on my khakis\nThen brush the Nike's down\nJump in the 'Lac and push to Nike town\nWhere Them Space Jam's? I need 'em right NOW!\nJordan sweatsuit on, OH Let's Do It!\nGo Wocka Flocka on them nigga's in these new kicks\nYou know how that go, new kick's, new whip\nBlue 6, loc'in on the set like a new Crip\n(That line was so crazy I had to say that shit, Blood)\nInterior coke white, smooth like Cool Whip\nSold the shit to Rick Ross, 80 thou', a cool flip\nThen I got that vibrant thing, my lil' Q-tip\nThat Maserati a problem, especially with the dual shift\n0 to 60, and WHOO! It's like a mule kick\nI swear to God like the preacher in the pool pit\nSpeakin of pools, mine heated, come through bitch\nLong as it's La Perla, I don't care who you come through with\n(Canadian, Spanish, French, nigga whatever!)\nMinage in the deep end, head on the back end\nI wanna fuck the Asian bitch, next time leave your fat friend\nWhy the fuck y'all in the Honda all packed in?\nHeaded to Inglewood, say wassup to Mack 10\nSay wassup to Glock 9, I'm back on you nigga's heads\nL.A. would be a ghost-town if I wanted nigga's dead\nRun with my Goon Squad cause more than half you nigga's Fed's\nIt's either that, you ATF or one of 50's friend's\n(I see the wires hangin' out you nigga's Levi's)\nWell fuck it though cause the nigga did let me in\nBut he ain't wanna see the Game in HD on ESPN\nI think the boy's John-in', we was the best of friends\nThen shit flipped, went to his holmes like I was Mexican\nWe all know the rest, put the burner to his chest\nHit him with \"300 Bars\" and let the streets do the rest\nYes! Terror is over you can eat now, Jayceon(Jason) killed Freddy\nThe WHOLE world can SLEEP now!\n(Dream-snatcher, that's ME now)\nTake your money lay yo' bitch ass on the beach now\nI can see it, a G-Unit beach towel\nAnother man on it, ya'll 'bout to tan on it?\nSend some lil' goons by to kick some fuckin' sand on it\nWe ain't watchin', go 'head nigga, jam on it\nDamn homie in high school you was the man homie\nYou was lucky in Manhattan, the clip jammed\nBut come to Cali you a moose in some quicksand\n(Sink nigga, like a fuckin' boat with bullet-holes in it)\nButtersoft Banks, you a bitch man\nMe and you was cool 'til 50 unscrewed your kickstand\nAnd Yayo, turn in your senior citizen wristband\nSlap the shit out you for @LilHenchman\nAnd just like the old days, I play the bench man\nDre play the big hand, I'm cool with the 6th man\nNever selfish nigga, I'm eatin shellfish nigga\nMy legacy will never die, the black Elvis nigga\n(Come check me out in Graceland nigga, pull the guitar out and e'rrything)\nGlock by my pelvis, clip by the waistline\nOn the block like Chris Bosh, shoot it from the baseline\nWe at the 350 mark, it's break time\n(Ayyo, go get the L out the car man...\nNaw, this Purple Haze nigga, I'm 'bout to roll this shit up\nGet high nigga, finish this mothafuckin' \"400 Barz\"\nNaw, my key's right there... By that, by that, Cocunut Ciroc... Yeah, Let's Go\nYo, and tell The Runners I'm hungry man\nGet me some Frech Toast, Bacon and shit)\nRun up on you with 50 bean's and 50 chef's\nNiggas thinkin' it's a game, tryna push \"select\"\nCall a time out, like I'm OUT!\nAll these soft ass Rappers fakin' the crime route\nNiggas got real quiet now that Shyne out\nDon't make me smuggle 'em outta Belize and pull them 9's out\nNiggas scared now, my Goon Squad here now\nWe turnin' on the headlights and runnin over deer's now\n(Yeah... All up in the wood's, what's good!?)\nAnd I'm the only one you Rap niggas should fear now\nYou see a G-Unit poster, you better tear it down\nI'm talkin' to you mothafucker, so turn around\nThe beef forever lives, never ever put ya burner down\nI beat the shit out these niggas, they Tina Turner now\nStripped of their manhood, ass naked like they Shermin' out\nWhile I peel the top on the block and just burn it out\nHit the strip club with my niggas and just turn it OUT!\n(Ayyo, that's Jeezy mothafuckin' Lambo'? Shit cold nigga)\nThey got free hot wings, they bringin full serving's out\nIt's all good, we straight, time to perm' it out\nKatt Williams, run up in ya house, tie you up\nAnd make you watch while we run through your spouse\nRip off her fuckin' blouse! Tiger Woods been in this?\nNo thank you, pass that bitch to Menace\nGet what I came for, stuff it inside the Range doors\n380 bars and get ready for the main course\n(Yo, gimme a couple of them napkins, a salad fork... I'm starvin' nigga!)\nJune 15th, one of us gotta change course\nBut not the one that spit 400, blunt'd and ain't hoarse\n8 plaques on the wall, hang yours\nBefore you get one, I'll probly have 8 more\nIt never been about the money with me\nJust been about tryna get my nigga somethin' to eat\nTake 'em on a couple of tours, get 'em somethin' to beat\nNever satisfied, that's why we keep the gun's on his feet\n(Yeah... All I know is block's, Glock's and Ciroc... Let's Get It!)\nWho got a blunt I can chief? Nigga's runnin around like Indians\nBut near not one of'em chief\nKilla California, I'm just one of the beasts\nTake a fuckin' blood bath and bathe myself with the beef(UHH!)\nIt's the home stretch but I ain't even home yet\nOnly thing can stop me, is ME, I'm my own threat\nEatin' Lobster's, writin' Al Capone checks\nI still ain't on the level of N.O.R.E. or Capone yet\n(Nigga's gon' learn, respect the veteran's... Nigga, apologize to Cube)\nBut after this year, and after this here\nNiggas won't see the throne for another 6 years\nP.S. mothafucker, ain't no bitch here!\nI'm goin' out the same way I came in, 5th gear\nI see the finish line, SHIT YEAH!\n(It's time to celebrate, Kanary bring that Cris' here\nSticks tell Crack bring the car around the back)\n400 and 6 bars... BITCH, it's a WRAP!"}]}