{"artist": "Fabolous", "songs": [{"year": "2016-04-14", "album": null, "image": "https://images.rapgenius.com/47933bf14e28d8d3174a60122820d0f4.500x500x1.jpg", "lyrics": "[Intro:]\n*Crowd chanting Kobe*\nKobe!\nFell asleep watching SportsCenter\nWoke up on some shit\nGotta appreciate the greats\n\n[Hook]\nGot 'em screaming encore, they just want more\nGot 'em screaming encore, they just want more\n\n[Verse]\nWho you know did it like Kob'? 60 to go\nThat's some cold shit, call it 60 below\nI mean, he play like he got ice in his veins\nShoot it in ya face from far, man, that boy gotta be nice at the range\nI talked with him twice at the games, once at the Trade it All video\nI'd say we had a nice little exchange of words\nHe said, \"You gotta come and spice up the games\" say, \"Word?\"\nKobe giving me advice it's insane, absurd\nYour favorite player you watch slice through the lane\nIs putting you on the game and the price of this fame\nThese the things that let you know that your life's gonna change\nAnd that shit stuck in your head like a knife in your brain\nSee back then, I just wanted ice in my chain\nSome sneakers, some jerseys, some flights on a plane\nI mean, I was getting money started pricing little things\nChasing all the girls didn't have a wifey to explain\nJust a light skinned in the Range, the nicest with the brain\nThat head that make you cum before the light could even change\nWoah, back to the other scoring leader\nSee, I was fucking with son when he wore Adidas\nNumber 8 and the 'fro, they was hating him though\nWhen you blow up why do people try deflating you though?\nLike, they ain't got 5 rings of they own\nBut these peasant niggas still try kings on the throne\nI mean, this chick told me give her a ring or she gone\nAnd after that she couldn't get a ring on the phone\nThe number you have reached\nIs no longer in service for a leech\nRemember you Lisa Turtles try to treat me like I'm Screech?\nBut I was Zach Morris, guess some things you can't teach\nLike them game winning shots, you gotta wanna take it\nSame way you can miss it is the same way you could make it\nThat's that Kobe 4th quarter shit, you saw that shit\nIn 2000 he threw it up and Shaq caught the shit\nNigga I be on my Jordan shit, Reggie sent the Kobe pack: Jordan 3, Jordan 8\nLaker jersey coordinate\nMatter of time before they call your name\nHope you ready for that Hall of Fame\nApril 13th, Mamba Day forever\nKobe gone, but his legacy gon' play forever\n\n[Outro]\nA quick 40 for my man Kobe\nThey said he gave 40 to every team in the league\nSo I just gave y'all a quick 40\nI'm on the wake up\nGot 'em screaming encore, they just want more\nGot 'em screaming encore, they just want more\nSaid I got 'em screaming encore, they just want more\nGot 'em screaming encore, they just want more\nFrom the Brooklyn boy wassup", "title": "Black Mamba Freestyle"}]}