{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/306390ca78fbc242ffe05c552a8403bc.1000x1000x1.jpg", "title": "About Mine", "year": "2015-01-30", "album": "Full Speed", "lyrics": "[Intro: Trey Songz & Kid Ink]\nShe ain't doing nothin' wrong\nEgh, Trigga, Trigga\nIt's Kid Ink\n(Mustard on the beat ho)\n\n[Verse 1: Trey Songz]\nIn the club and this nigga looking at me kinda strange\nI got the woman he love sipping my champagne\nBut she ain't doing nothing wrong, she just fucking with a young, rich nigga\nTell that boy stop acting like a bitch nigga\n\n[Hook: Trey Songz]\nYou should get some money, why you bullshitting?\nYou should get some money, why you bullshitting?\nMy nigga you should get some money, why you bullshitting?\nI'm about mine, is you 'bout yours?\nGirl I'm about mine, is you 'bout yours?\n\n[Verse 2: Kid Ink]\nYou could bet that, check my stats, from way way back nigga we've been doing this\nSame old clubs and the same bitches you just met, nigga I ain't got time\nIf the bezel ain't diamonds, presi Obama, pool in the Bahamas, black ferragamo\nNeed me some condoms, we fucking up commas, honest\nRight now this rap shit is cracking for me, if it didn't work out we'd be back to the streets\nSee life is a bitch crazier than Kelis, but I'm picturing money, my nigga say cheese\nFeel fresh like Axe on me, nah y'ain't gotta put up no act for me\nYour girlfriend already said you act so cheap\n\n[Hook: Trey Songz]\nYou should get some money, why you bullshitting?\nYou should get some money, why you bullshitting?\nMy nigga you should get some money, why you bullshitting?\nI'm about mine, is you 'bout yours?\nWhy you bullshitting\nGirl I'm about mine, is you 'bout yours?\nI'm about mine, is you 'bout yours?\nWhy you bullshitting\nGirl I'm about mine, is you 'bout yours?\n\n[Verse 3: Kid Ink]\nI'm about mine, tell me is you 'bout yours? Yeah she say I'm a dog but she down on all fours\nYeah she down on the floor cause there's money all over, then back on the pole with it\nNow I got time, cause now I got change, shit the cup got drank and we 'bout to get high girl\nWhat did you think? I say God to your dress but no you ain't no saint, shit\n\n[Verse 4: Trey Songz]\nYou know you coming to the crib girl ain't cha? You drinking all this liquor girl ain't cha\nI'm feeling on your booty girl ain't I? Show you how to have a real good time\nSo bust it for me, elbows on your knees\nWe don't care who's looking, Mustard on the beat\n\n[Verse 5: Kid Ink]\nBall hard and yo bitch tryna reach\nNo it ain't my fault that she's running through the streets\nDumb blonde, got you looking like a fool, nigga\n\n[Hook: Trey Songz]\nSaid, you should get some money, why you bullshitting?\nYou should get some money, why you bullshitting?\nMy nigga you should get some money, why you bullshitting?\nI'm about mine, is you 'bout yours?\nWhy you bullshitting\nGirl I'm about mine, is you 'bout yours?\n\n[Outro: Trey Songz, Kid Ink, & Both]\nI got all bad bitches at my table\nWhat I'm gon' do with all this money that I can't hold?\nThrow some to em, said\nOnly bad bitches at my table, that, that's all I got\nWhich one of y'all I'ma take home? (Oh, oh)\nI'm about mine, is you 'bout yours?\nGirl I'm about mine, is you 'bout yours? You should get some money, why you bullshitting?"}]}