{"songs": [{"lyrics": "[Intro: Jay-Z]\nNigga I can make four more albums off memory!\nY'all ain’t never gonna be better than me\nI’ma do this 'til I’m 80\n\n[Verse 1: Jay-Z]\nEverybody wanna rhyme like Hov'\n'Cause I rhyme like I be rhyming in the Rov'\nClimbing in them hoes\nMind like a diamond, I’ll blind you at the shows\nI don’t shine, I glow, I remind you of that dough, don’t I?\nDid I? Hustle the game just the thought alone\nGive me a boner, coach cater to a coma\nCan’t out hustle a hustler, you can’t outplay a player\nThis rap shit is a layup\nIn my former biz, motherfuckers would spray ya\nIn the music biz, motherfuckers just say stuff\nSpit on you and spray yeah niggas just play tough\nWhen the cameras on, When the cameras gone\nNiggas want to set up meetings\n'Cause they know most likely when I see em’ I’m a set up a beating\nWindows no tints, cars no rims\nThat’s because we handle ours like grown men\nI ain’t touch a wheel since I drove the Bent\nThat’s cause it was a coupe, nah I ain’t souped\nI was telling the truth and you Tom Cruise\nYou can’t handle it, handle it nigga is what I do\nI tried to be modest on Blueprint 2\nBut y'all don’t respect modest, y'all respect my dollars\nYou got to believe I think like a artist\nBut my bills through the roof can’t do numbers like The Roots\nNo disrespect I be trying to disconnect\nBut niggas keep pulling me back in, I’m trapped in\nMy pops got a liver disorder\nMy whole living's disordered, and I just got his living room ordered\nAnd you wonder why the chip on my shoulder is more like a brick or a boulder\nYou’ll understand maybe when you get older\nGot a hundred niggas on your dick saying you ought to record like this\nOr what have you, niggas is back stabbing you\nBitches mad at you, ‘cause they can’t have you\nPress want to know about the daughter of Matthew\nNow it’s back to the hood again, all black hood again\nBack to old ladies saying what I could’ve been\nBack to the gats – you forgot I’m real good with them\nThey goin put a nigga in jail, oh well\n\n[Hook: 50 Cent]\nIf I can’t, do it, homie it can’t be done\n\n[Verse 2: Jay-Z]\nI’m the one – I’m not the two not the three not the four the five\nI take the pain from my life pour it all aside\nTake my strain and my stride, take my ego and pride\nUsed them to kick down the door, brought my people inside\nAnd I hope you, ain’t think I wrote this\nTo entertain you, 'cause that ain’t what I came to do\nI will bang you, I will act like orangutans do\nI give you hot wings turn niggas to angels\nUnderstand my angle, I’m safety first\nDon’t make me act like the safety don't work\nTough niggas get it the worst, I’m begging you come for us\nI’m giving motherfuckers dirt comforters\n\n[Outro: Jay-Z]\nNight night nigga, take a dirt nap…\nI know you hear the footsteps...", "title": "If I Can’t (Freestyle)", "image": "https://images.genius.com/0572d3c2a8305ab228c6cfdc3005ee89.300x300x1.jpg", "year": null, "album": "The S. Carter Collection"}], "artist": "JAY-Z"}