{"songs": [{"image": "https://images.genius.com/1347c8a031c29a20889e17df64f84846.300x300x1.jpg", "title": "Nas is Not", "album": null, "year": null, "lyrics": "[Verse 1]\nThis goes out to them sensitive niggas\nI'll put dent in y'all niggas\nIf it's extension my niggas\nRunnin out like half-back pressin for y'all\nConfiscate you at the light now your weapons dissolve\nConfiscate your fuckin life now steppin to the fog\nLast record was debate, wait now I respond\nSilly rappers that lacked the credibility, killin me\nShoutin out the hood, though the hood show hostility\nSo that you know here is the truth about Nas:\nIn the window so long, chipped his tooth on the bars\nNigga never got involved, he was none to clown\nTry to front on my block and I'mma knuckle you down\nYou hear me\n\n[Verse 2]\nI gots to chew you, cops sue you\nBeside Ether, Build and Destroy is lots of doo-doo\nAnd even if the Bravehearts sign, it ain't poppin\nJust tell 'em make Oochie again, if not drop 'em\nCause we don't want to hear the shit they tryin to do\nBefore they get to drop and album they retirin too\nDividin the crew, you Jung, Wiz, and Nashawn\nWith out you which one of them can stay on\nSo think about it yo\n\n[Verse 3]\nThe nigga 'Pac called you out, you ain't neva respond\nB.I.G. put it down and you knew he was warned\nJay-Z called you right in front of your home\nEverybody called you out cuz you runnin alone\nUse to be a shorty buster wit Killa and High\nBlack head in the jeep, you was feelin my size\nComing through every other day changin your ways\nWas it fate, why you showin so many anger today\nTalkin Ill Will neva even feedin his moms\nWhy she livin in Queensbridge still eatin them worms\nYou be at the fortune teller probably readin your pomp's\nMislead your own kind can't you see it's wrong\nIt's about time, all the shit come to and end\nAnd this time all the hood see its current event\nNiggas know you got ice, why you tuckin it in?\nYou supposed to be a fighter why you stuck in the trench?\nTerrorized by a nigga named Nut, tied time move\nDiggin it like this shit is made up, you might find truth\nCallin for my niggas for help\nWhen you was cornered then you tell me you come by yourself\nYou was recordin, I'm cool we had a team\nBut your thugin was warrin'\nAnd you wouldn't sold double if it wasn't for Lauryn\nSo the next time you talkin if you lyin for is foul\nNigga brace your self for the drama dunn the time is now\n\n[Verse 4]\nNas is like...King Jafi, the mummy returns\nAss whole of the year, maggot runnin with worms\nThe little freaks that we see on tapes\nFuckin R. Kelly raw, did he pee on your face?\nA false prophet, Lucifer son\nSpreadin lies to people, amusin the young\nSayin that I stole cars and I took pocket books\nJust to cover the fact that...the hood got you shooked\nThink about it, a scared little boy on the corner\nI'm prepared to go as far you wanna\nFrom the winter to the summer, you be hirin cops\nTellin niggas you a thug sendin right to a box\nLife like J Reed, you In Too Deep\nFaggot voice ass rappin nigga been too sweet\nSo the next time I see you, we can straight it out\nAnd if you don't know what Nature is about\nNow you know nigga"}], "artist": "Nature"}