{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "(Hook)\nThey want to come and see me for my swag\nI disappear like the genie in a aladdin\nI don't mean to be so bragadaucious...\nBut I got this thing on lock, and you know this\n(on lock) and you know this (6X)\n\n(Verse 1)\nShorty shorty know I got the game on click clack\nShorty know I stay fresh no zip-lock\nShe know the price I payed for my wrist watch\nShe know my jewelry get cold when I get hot\nWhen she cheat on her man she don't get popped\nI'm in Japan we gon' we gon' when I get back\nAll action baby no chit chat\nMet her at a kick-back, did her like a kit-kat\nUgh, YB so CA\nTwo light-skinned girls that's a three-way\nThey know I got game like EA\nSo you know I move fast like freeway\nEverything for sale i'm like ebay\nNo D.Wade ma keep cream-ay\nI'm balling and I don't need a teammate\nHave this thing on lock get a key made\n\n(Hook)\nThey want to come and see me for my swag\nI disappear like the genie in a aladdin\nI don't mean to be so bragadaucious...\nBut I got this thing on lock, and you know this\n(on lock) and you know this (6X)\n\n(Verse 2)\nShorty know I got it sold like a dope man\nI'm from the city cross the bridge from Oakland\nI'm drinking, she smoking\nLittle tiny purple nike pill got me rolling\nBroke? My bank account swollen\nIn my own lane like a nigga going bowling\nThem hoes say they love me but i don't know them\nThem hoes give it to me but I don't owe them\nIn the V.I.P. chilling like champaign\nAll the pretty girls trying to join the campaign\nGirl you know I had bitches before I had fame\nDrunk in the club singing, but I can't sing!\nI feel so fly with my shades on\nYou a hater i'm the nigga you should hate on\nLike star in the function it's gon' rock\nCan't get in he got it on lock\n\n(Hook)\nThey want to come and see me for my swag\nI disappear like the genie in a aladdin\nI don't mean to be so bragadaucious...\nBut I got this thing on lock, and you know this\n(on lock) and you know this (6X)\n\n(Verse 3)\nSo cool no LL\nAnd I got it on lock no jail cell\nPolo T-shirt with a chanel smell\nSay baby girl have you ever done Girl-Girl?\nLast night I had patron in my OJ\nNow i'm sippin that Polo Olay\nI want her, and she want fore-play\nImma drink that like rozay\nAnd your girl know I'm dope like cocaine\nSo your girl on my neck like gold chains\nI swear your girl don't play no games\nShe do she do everybody, no shame\nYB, I be in the door I don't need a ID\nAll this champaign got me on my body\nGot this thing on lock and I swallowed my key\n\n(Hook)\nThey want to come and see me for my swag\nI disappear like the genie in a aladdin\nI don't mean to be so bragadaucious...\nBut I got this thing on lock, and you know this\n(on lock) and you know this (6X)", "title": "On Lock"}]}