{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legendary Classics Volume 1", "year": null, "lyrics": "[Verse 1]\nAyo, I seen your bitch at the club eyeing the grimy\nRugged low life rapper, no life rapper\nWhat she wanna look at me for?\nI ain't got shit, I got a little, white dick\nSix inches, the bitch want it, she can get it\nI don't got nice shit\nI don't got platinum and ice shit\nI got no life, bitch - get it right, bitch\nCome to the crib, we gon' handle this\nI don't care who your man is\nI got a dirty apartment with roaches, that's where I take her\nQueens Hillside Avenue in Jamaica\nBuy her later when I hit that, tap that\nPull the ass out, smack that\nShe a freak bitch, she like to eat dick\nShe be telling me your secrets, your weaknesses\nThis is who you dream, bitches\nI'm in your crib now busting nuts on your silk sheets\nSoiling your mattress\nBend her over backwards and sideway\nLast Friday you was home\nI was busy tearing her back out in the driveway\nYeah, I'm probably the ugliest guy you ever saw\nTo you I'm probably poor\nI'll probably get your bitch screaming for more\nI got the bitch fiending for dick, I'm probably right next door\nYou the shit, right? Big wheels shit\nYou making platinum hits, I'm still fucking your bitch\n\n[Hook]\nFucking your bitch, fucking your bitch\nFucking your bitch, fucking your bitch\nFucking your bitch, fucking your bitch\nFucking your bitch, fucking your bitch\nI be fucking, fucking, fucking your bitch\nFucking your bitch, fucking your bitch\nFucking your bitch\nI be fucking, fucking, fucking your bitch\nWhen you're not around, I be fucking your bitch\n\n[Verse 2]\nYeah, she ain't grizzly, chicks be on my dick meat\nYour bitch be probably with me\nIt's so funny how a dirty motherfucker like me\nMight be the one sticking dick up in your wifey\nYeah, it's true I'm a piece of shit and I'm proud of it\nIt's true I'm here to defy the public\nIt's true I'm tapping that ass, every ounce of it\nPlaying with her clitoris, in your crib where your  kids live\nIt's ridiculous how this bitch live\nShe the gang bang, take dick on her first date bitch, your bitch\nShe like it when I choke her, smack her, yolk her\nTwisting her like yoga, friends [?]\nWhite Buffalo, white trash soldier\nBend her over, cobra\nBusting nuts on your sofa\nYeah, I'm R&B, half rap shit\nI got your bitch on some ''hit-it-from-the-back'' shit\nSex maniac shit, no prophylactic\nMy whole clique tapped it\nShe a bad bitch, she talk shit, but she back it\nI don't care if I'm a born loser\nI fuck the dog shit out your bitch while you make love to her\n(He ain't shit, right?\nYou're killing it\nI love you\nYeah, love you too)\nYeah, you right, see that, I'm not shit\nBut I never lie on my dick, I never pop shit\nIf I said I fucked your bitch it gotta be true\nI got STDs, now you got 'em too\n\n[Hook]", "title": "Effin’ Yo’ Bitch", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}