{"artist": "Ice-T", "songs": [{"title": "Check Your Game", "lyrics": "Chorus:\nIt's 99 players check your game\nMake sure them young boys respect your name\nKeep your heaters at close reach cocked and ready\nCause the streets will catch you slipping, rock ya steady\nWatch your back with your homies that you feel is real\nYour homeboys from your crew, yeah them the ones that do you\nThe suckas that got the player hater venom\nI wanna take 'em outside and lay some slugs up in em\n\n[King T]\nWhen they need work\nThey call the cali drug expert\nSmashing in a six hundred dollar bill burnt\nLooking flossy living costly\nOff the edge, out of state\nThey gots to break bread, for sho\nI needs mo' ice drops for the lexo\nBriggetts sets blow when I'm sipping the mo'\nFreelancing, trying to build a mansion\nAnd stay faded\nHave hoes walk around my crib butt naked...\n\n[Ice-T]\nTrue, pop the remy kick back and let the players represent\nHigh floss true boss game and take aim\nThese sucka wannabe's\nNigga please - you're green\nI'll bend hoes on the downlow - banks obscene\nWanna chill with these niggas, bet you wish you could\nAnd suck game out my ass like sponges\nI run this\nYou can't fuck with the steelo\nYou niggas wanna be low\nWhen I'm on the east I play ceelo\nCash flow\nOne track mind serial hustler\nQuick to break a buster ya snitch bitch?\nI'll dust ya\nBentley ballin' bastard\nNo hustler faster\nGame maker\nI knock a white bitch and break her\n\n[King T]\nBut Ice, Chronic got me bruising my brain\nBut soothing my pain, I'm true to the game\nI got my mind made I gotta be that rich motherfucker\nSet it up so my grandkids don't suffer\nThe phat hummer\nThe phat drummer - what's your choice?\nTrying to find a sister with a voice\nMake her moist\nI'm throwing up the W\nBringing trouble to\nThose in sight\nKing T and Big Ice\n\nChorus:\n\n[Ice-T]\nBut T that's trippin' and that ain't my sport\nI'd rather lamp in my crib and flip the Robb report\nAnd set my v-dozen on the streets\nBump my beats\nCause when I'm twisting my dubs\nCan't nobody compete\nImagine this:\nA hundred G 'lex on your wrist\nImagine this:\nAbout ten karrots on your fist\nImagine this:\nAll dime hoes on your list\nHa - that shit would be nice\nBut your name ain't \"Ice\" - kid...\nI'll screw the silencer on - rock you softly\nHow you gonna step to me kid? You grew up off me\nTV, Movies, and Records and Tours\nSo many busters wearing Versace I don't wear it no more...\n\n[King T]\nBut this will be a classic\nMany facets to get that ass kicked\nThe alchoholic Don, call me King Tragic\nWatch me speak the magic\nWatch me teach that old habit - full of havoc\nAnd Ice'll tweak the mix when it statics\nPeople pay\nJust to have me stay\nAnd say a verse\nI'll freak a couple words unrehearsed\nThen I burst\nI mean I bust\nFrom all angles\nGuarunteed platium on your single\n\n[Ice-T]\nYo T, I really must admit I'm blessed\nMaster V does some other shit TV's in the head rests\nNever wear no vests because I got mad love\nI catch respect when other niggas catch slugs\n1, 2 I bust shit to load guns to\nBeats for the hoodlums\nSomebody's gotta do'em\nFed's screw 'em\nFaggot's got my whole crib bugged\nMad tapps on the phone cause I deal with the thugs\nDrugs? never\nNo, the Ice is too clever\nI'm overseas\nCheckin G's\nNigga please\nBallin' since the 70's - yeah baby\nBlew up in the 80's\nNow you niggas hate me\nYou can't see me motherfucker your focus is off\nYou can't be me motherfucker, you're broke and you're soft\nToo many niggas try to pert my lifestyle - romancing\nI was kickin game while them kids was breakdancing\nOverlord - so why the wack niggas ain't dead?\nProbably because my aim is over nigga's heads/\nEast coast - west coast, I play the whole map and bounce/\nThey got a benz but live in their mom's house...\n\nChorus\n\n[King T]\nTo all my G's rock on\nGet your ride on - when you hear it\nThe forbidden Gangland lyric\nPlayer Haters fear it\nGet you right up close near it\nPossessed by the Eazy-E spirit\nIce-T set the limit\nAnd niggas won't cross this line\nSuicide - and niggas won't cross this nine\nIn your mouth\nPuffin' with my niggas down south\nWhat the fuck this really all about? man..\nI'm coming out\nFront and back, 98 brougham\nAll you fake G's stay home\nLeave that shit alone\nKing Tee's back on the throne\nAnd that nigga on the mic - straight gone\nCra-zy, y'all niggas wanna know the real deal?\nI'll freestyle and smack you in your grill\nBomb lyrics, no special effects or gimmicks\nThe Syndicate will put you in the mix - biatch...", "image": "https://images.genius.com/64f26659fd999b48a36adf8773cb8eb0.1000x1000x1.jpg", "album": "The Seventh Deadly Sin", "year": null}]}