{"songs": [{"title": "2nd Time Around", "image": "https://images.genius.com/5aaf650b9eac1ac5a3dd87cd40d304dd.500x497x1.jpg", "lyrics": "[Wale]\nYou gotta understand man\nPersonifying hip-hop\nTry to\n\n[Verse 1: Wale]\nI rely on no man, but him that's speakin'. Him that lead him\nBleed on a track, like a pole vault freakish\nAccident victim. Meanwhile beatin' up the beat via Benzi\nHaters eyes gettin' wide like bench seats\nI bring Maybach. You getter get me\nWale, yeah. All them haters get me\nOsmosis, now niggas get me\nI spit that halitosis. You got Listerine\nI'm that extreme, So haters complain\nSo Blame It On my Rain. You all lip sync\nWale: I turn beef into mince meat\nYour condescending ways don't convince me\nAnd I didn't know what condescending meant till yesterday\nSo I threw it in a rap so I'd remember that\nYeah, it ain't nothin' to me\nI play the background whole time Mario 3\nGone\n\n[Hook: X8]\nSecond Time around\n\n[Brother Ali]\nHa. It's Brother Ali. Hey Benzi my man. You gotta forgive me\nI might go a little long. I got some shit I gotta get off my chest right now\nBring it back for me\n\n[Verse 2: Brother Ali]\nRappers can't clap me\nJackers can't gat me\nOriginal meaning of Jazzy Fat Nasty\nI don't bite rapper's lines, I bite the captain's arm off\nI don't throw shots in the air, I throw that Molotov\nCocktail, reservoir dog my collar off\nY'all scared to get that revolution popping off\nYou really got the guns you claim in the track\nThen my question to you is who you aiming 'em at\nYou complain that the rap police caught you with a gat under the seat\nMisdemeanored that twenty bag of weed\nBut little old me with the few facts that I speak\nThe homeland security gaffeled me over seas\nFroze my bank account and seized my guarantee\nAnd y'all are soundscanning like a hundred more than me\nThey kicking you off tour for freaking a chick or two\nVerizon dissed me too cause I was too political\nY'all are all safe and shit, y'all are not saying shit\nYou just snap your fingers and dance and make your label rich\nGotta pay back that advance, so they ain't gave you shit\nThis is your chance to say something and you're wasting it\nPeople are starving, you talking bout balling\nCan't think of nothing more important than that jargon\nHundred different ways to describe diamonds sparkling\nEighty percent of kids are listening to y'all shit\nI heard that statistic I almost cried\nNever wanted so bad for 2pac to be alive\nWhat the fuck happened to rap when\nThe gangsters are scared of upsetting they industry masters\nIt ain't my place to say and I hear all that\nBut fuck that, I live in the hood and we need y'all cats\nSo as soon as I hear y'al on some real pro black\nThen I will gladly go back to my emo rap\nThey say the truth don't belong to nobody, if you see it you speak it\nIt would be a sin to keep it a secret\nSo if I need to breathe then believe that I mean it\nQuit trying to be somebody's boss and be a leader\nIf it wasn't bad enough your labels are hoeing you\nYou can't even scan, your fans are downloading you\nThere's no connection, so they're not supporting you\nYou ain't never shed light on nothing that they're going through\nWe ain't buying CDs, we striving to live\nAnd these artists don't need me they already rich\nI ain't hating on you, rock them shines\nJust remember us from time to time when you drop them lines\nRappers can't clap me\nJackers can't gat me\nOriginal meaning of Jazzy Fat Nasty\nBusy raising babies and living on tour\nSigning off Brother Ali, sincerely yours", "year": null, "album": "The Rope-a-Dope"}], "artist": "Brother Ali"}