{"songs": [{"title": "Castle Bricks", "album": "Young B!tch", "year": "2014-11-24", "image": "https://images.genius.com/ada1db8e1659e66b5760e92d955d2ba4.600x600x1.jpg", "lyrics": "[Intro]\nCocaina, Cuba, Colombia, Peru\n\n[Hook]\nThe princess told you no deal if I don't know you\nI'm 'bout to make another trip for what?\nFlip, flip\nTalkin' 'bout them castle bricks (bricks, bricks, bricks)\nCastle bricks (bricks, bricks, bricks)\nCa-ca-castle bricks (bricks, bricks, bricks)\nCastle bricks (bricks, bricks, bricks, bricks)\n\n[Verse 1]\nBricks, bricks, bricks so exciting to me\nBricks, bricks, bricks, they are whiter than me\nThirty six six sound right for the key\nGot 'em off the ship sail right from the sea\nIt's a party going on it's like four in the morning\nIn a millionaire's home he be calling and calling\nMan I'm already coming, engine already running\nThey can feel the rush coming, yeah, they already numbing\nThis that Hannah Montana fasho\nThis that Lindsay Lohan, that blow\nThis that Hilary D, it's that Hilary Duff\nYeah, I'm even Britney stoned\nThis that Mary-Kate, Ashley yo\nSo many bricks that I got for the low\nYou got the money I'm letting it go\nPlenty snow bunnies, yeah, I got the flow\nAnd I'm letting you know, yo\n\n[Hook]\n\n[Verse 2]\nYou want that Keira Knightley, nightly?\nYou been up with Chelsea Lately, lately?\nIt's something 'bout that girl that excite me\nHillary Swank whippin' that million dollar baby, baby, baby\nDuckin' the Duke Tracy, pitchin' Warren Beatty\nI got that Jack Nicholson, you should come and pay me\nLike the Cocaine Cowboys gettin' in the 80's\nClint Eastwood, servin' that Slim Shady\nWhippin' that, whippin' that Vanilla Ice\nThat is my Miami vice, hoppin' out drippin in ice\nFuck what you heard, I'm flippin' these birds\nAnd I'm never droppin' my price\nHonestly, that's being nice\nJust call you wanna get right\nFor sure I got that white\nI'm so raw that I could do life, but not in this life though\n\n[Hook]"}], "artist": "Lil Debbie"}