{"artist": "Fam-Lay", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/afa2ab405191cb56ddd347760b643234.600x600x1.jpg", "lyrics": "[Pharrell] OWW!! Getting!!\n\n[Hook - Fam-Lay]\nWhen the car roll up and windows roll down\nAnd you see the sawed off, nigga better hit the ground\nWe getting busy!! You better haul ass dawg!\nYou better haul ass! You better haul ass dawg!\nYou better haul ass! (OWW!! getting!!.. OWW!!)\n\n[Verse - Fam-Lay]\nI'm blasting, nigga laying in the street cause\nTalked shit, so I hit 'em wit the heat\nRunts moving, keys like oz's\nLike a cliental, errbody know me\nRunning! running from the 5-0\nDrug life, and it's all about survival\nHustla, known worldwide dawg\nI'm in the game and I'm bout to drive by y'all\nGambler, 4 - 5 - 6ing it\n10 grand in the bank and I'm sticking it\nBitches, got 'em by the dozens\nFrom their mammy, to their sisters to their couzins\nStar Trak, is the crew that I run with\nNigga don't get murdered over dumb shit\nFuck you! it's how I'm caring if\nNigga try to start beef and we burn it\n\n[Hook]\n\n[Verse - Fam-Lay]\nHey look I'm sick of niggas saying what they gon do when they see me\nSoon as they see they don't do shit\nThe nigga Fam-Lay too slick\nI got a handful of guns and a few clips stupid\nYou keep sending death threats, uh! and I ain't seen death yet\nNigga I can't help that I ain't been murdered in my life, look\nLook I been stopped giving a fuck about living\nEver since I got beat up by them faggot ass cops\nBut now I just stand on my block and drink liquor\nWit my niggas and my bitches and we keep them gats cocked\nUh! won't hesistate to blast you niggas\nSpray your corner, bodies falls in the Ac my nigga\nUh! I'm pulling out the dagger nigga\nCause when I finish wit these shells I'm a stab a nigga\n\n[Hook]\n\n[Bridge - Pharrell Williams] (Fam-Lay)\nLet me tell ya boss ballin, I'm boss ballin (Fam-Lay!)\nI'm boss ballin, I'm boss ballin (Norfolk!)\nI'm boss ballin, I'm boss ballin (Huntersville!)\nI'm boss ballin, I'm boss ballin but let me tell ya\nBoss ballin, I'm boss ballin (with the Clipse!)\nI'm boss ballin, I'm boss ballin (Coldchain!)\nI'm boss ballin, I'm boss ballin (Star Trak!)\nI'm boss ballin, I'm boss ballin\n\n[Verse - Fam-Lay]\nNigga fuck all that punchline shit, that young rhyme shit\nThat shit that might blow only one time shit\nCause when I rhyme bitch, my rhymes fit\nThe mind of a gangsta is all time, bitch!\nKill who you riding wit\nI got some niggas from Virginia riding wit me\nAnd them niggas trying to buy this shit\nSo fuck who you party wit!\nCause we get high as the Karate Kid, now let's go!\nPop junk, I pop trunks; Got a 10 shot Glock pump\nThat'll stop trucks, ya cocksucker!\nShoot a lead trying to get a rep\nI shoot the lead at his head now his man tryin to get 'em help\nFam don't play wit chirin [children]\nAct stupid, act dumb, act foolish, act deaf like you ain't hear em\nBring it to the forefront, I got a lotta niggas that tote guns\nNow let's do it!\n\n[Hook] (w/ bridge in background)", "title": "Git Busy"}]}