{"songs": [{"title": "Threatz", "year": "2013-09-03", "album": "Nostalgic 64", "image": "https://images.genius.com/945187a8975b603a0337b8fd911db7a4.500x500x1.jpg", "lyrics": "[Hook: Denzel Curry & Robb Bank$]\nNigga Klan be the set, we don't take kindly to threats\nNigga we don't take kindly to threats\nBitch S.S. be the set, we don't take kindly to threats\nWe don't take kindly to threats\nNigga Klan be the set, we don't take kindly to threats\nWe don't take kindly to threats\nBitch S.S. be the set, we don't take kindly to threats\nNah we don't take kindly to threats\n\n[Verse 1: Denzel Curry]\nSlide for the free, kill for the fee\nPull out the stick then I pull out the ski\nPut a motherfucker face on a white tee\nThat's what a nigga get being P.I.E\nSweet, nigga you D.I.E\nSleep, motherfucker that's six feet\nDeep, no tender, no love, no care\nBut a nigga here still gon' creep\nT.L.C. put it to ya Lisa Lo' that's a nigga left\nEye, kill a nigga, get ghost, that\nPatrick Swayze, come equipped with a vest\nI'mma point that shit to your motherfucking neck\nK's all in my trunk, so you best to get a chopper\nIt's nothing but goon action, I ain't talking Waka Flocka\nThat 2.7.5. goons bout' to do a fucking gank\nBumping Waka Flocka Flame in a underwater tank\nCause nigga die right now, bullet or a fucking shank\nNiggas always tryna' be the hardest in the fucking paint\n\n[Verse 2: Yung Simmie]\nNever take kind to the threats\nI be off for your neck 'for you reach for the TEC, Simmie\nNiggas gon' hear me then fear me, feel me?\nWhole bunch of green in my Philly, turn up\nWhole bunch of niggas if you run up\nTryna' act hard with your gun up, I shoot your son up\nGrinding till the sun up, middle finger flashed\nThat's a one up, I'm a young gutta\nDog I mutter, Curry said cut ‘em with his brudda\nLeave them boys wet like water\nOff with his neck, posted with the set\nI don't take kindly to threats, take kindly to threats\nRatchet for life, I'm hood, tryna' smoke bad but I’m good\nBust a nigga head for the cake\nJumping over gates can't wait\nNine to the face, fuck nigga you ain't safe\n\n[Hook: Denzel Curry & Robb Bank$]\nNigga Klan be the set, we don't take kindly to threats\nNigga we don't take kindly to threats\nBitch S.S. be the set, we don't take kindly to threats\nWe don't take kindly to threats\nNigga Klan be the set, we don't take kindly to threats\nWe don't take kindly to threats\nBitch S.S. be the set, we don't take kindly to threats\nNah we don't take kindly to threats\n\n[Verse 3: Robb Bank$]\nSavage life, nigga, you don't wanna see me live\nPop more than a quarter, so tell that dime piece\n\"Bitch, don't kill my vibe\", man\nI know your bitch love me, I know your bitch want me\nShe let me pillow pet that kitty when she climb under this Snuggie\nBitch, South Florida, I only smoke mid in Broward\nBut end the flame of that Magic Dragon and kill that Charmander, bitch\nGone on you niggas, two phones on you niggas\nThink I made it? You don't wanna see me ball on you niggas, bitch\n\n[Hook: Denzel Curry & Robb Bank$]\nNigga Klan be the set, we don't take kindly to threats\nNigga we don't take kindly to threats\nBitch S.S. be the set, we don't take kindly to threats\nWe don't take kindly to threats\nNigga Klan be the set, we don't take kindly to threats\nWe don't take kindly to threats\nBitch S.S. be the set, we don't take kindly to threats\nNah we don't take kindly to threats"}], "artist": "Denzel Curry"}