{"artist": "B-Real", "songs": [{"album": "Smoke N Mirrors", "title": "Stack’n Paper", "lyrics": "[\"Scarface\" movie samples for opening 0:18]\n\n[B-Real]\nIt's, so phenomenal, it's no optical illusion\nI give you a transfusion\nI'm from L.A.C. with West coast hustle\nIt's a worldwide ride from L.A. to Brussels\nDef Jams like Russell and I'm gettin older\nYo check the Blueprint homey just like Hova\nPlannin to take over, the streets are mine\nI couldn't get away if I tried to run away blind\nWe're attached to the hip, like my sig in my clip\nGettin money, gettin honies you know fish 'n chips\nFrom the belly to L.B., what can you tell me\nIt ain't healthy, you fuckin with us\nI didn't come for any foolishness, I'm so cool with this\nI make you Stand Up like my name was Ludacris\nI can lift you, and never pretend to\nBe somethin I'm not so I never offend you c'mon\n\n[Hook: repeat 2X]\nStraight up we stackin our paper\nWe got no time to waste either\nTrue life don't come with no favors\nGimme time and I'll make you believers\n\n[B-Real]\nI've, played the game and you heard my name\nAnd I've laid to waste so many lames it's off the chain\nPeople come and go every day, but family stays\nI guess it just depends, on how you were raised\nFor my success you givin me praise and poppin champagne\nBlazin up the sticky kush, on my campaign\nI'm, highly trained to provide you with joy and pain\nKeep it movin don't ever stop, just let it rain\nWe whippin through L.A.C. in the candy cars\nThat bounce, like the honies when they dance on bars\nI love my city, and everything in it\nSummertime don't miss it in Cali or you'll regret it\nSo many hot birds, God damn they fly\nSo much kush weed can't help but to get you high\nCome in peace or you're leavin in pieces\nYou're dealin with the cold clique as the heat increases\nHeat it up\n\n[Hook]\n\n[B-Real]\nI relate to the thug ones, those are my loved ones\nI represent for all of those who live where I come from\nI relate to the hustle cause I don't like starvin\nFuck with the bread, triggers get squeezed like Charmin\nI relate to the ballers cause I get my figures\nYou want a piece of mine but you can't buy that nigga\nThey say people are plastic, in the City of Angels\nAnd it's dangerous, when you go talkin to strangers\nYou might run into a banger, them boys with colors\nThen hammers start clickin like camera shutters\nBe careful of any shit talkin you might utter\nI don't wanna scare you but you need to take some cover\nWe livin with the beauty and beast, I'm doin my duty\nBut beast is lookin for a little release\nThis world is so cold, but you wanna grow old\nIn life there's no hold, in the game I don't fold\nI rock shows in the House of Blues\nOver beats that J. Stoner made to make you move\nAnd it Feels So Good, but I ain't Tony\nIt's the realest heart homey not made for phonies\n\n[Hook]\n\n{*scratching: \"betta have my money\"*}", "image": "https://images.genius.com/a84f5f2a93fac34de0ebb0407f26b392.600x600x1.jpg", "year": null}]}