{"songs": [{"year": null, "image": "https://images.genius.com/809737792a8459e937896e9550e530ba.600x600x1.jpg", "title": "Muscle Game", "album": "Life Story", "lyrics": "[Verse 1: Black Rob]\nYeah, ah\nAh-oh, startin' to feel this\nAh, yeah, startin' to feel it (nigga, this crazy)\n\nYo, who these cats think they is\nTakin' they business 'round here?\nYo, dawg, don't even go there\nThis is ours, we built this from the ground on up\nNow it's flowers, I think you best to round on up\nYour entourage, slim chance of y'all gettin' large\nIt's non-cipher, that's because B R's in charge of the set here\nCats is known for gettin' wet here, and left here\nTill the cops come pick us up\n\n[Verse 2: Mark Curry]\nSteppin' in territory that's corrupt\nPushin' your luck\nIntrudin' where shit's already sowed up, nigga fold up\nYou and your two amigos'll get slain\nThis ain't the place to try to gain fame from\nYou gets burnt in the streets a nigga worked hard to make\nAnd I'll be damned if I let another brother take it alive for his own sake\nThey better vacate promptly\nBefore they get they ass stomped\nListen, take heed to what we sayin' niggas\n\n[Chorus]\nIt's all in the muscle (muscle game)\nIt's all in the muscle (muscle game)\nIf you don't have the muscle (muscle game)\nAnd you gotta have muscle (muscle game) (We lay down the muscle game)\n[Voiceover: Diddy]\nYou see, in this game, only the strong will survive, and the weak shall pass\nSee, a lot of cats think with they brawn, not with they brain. Ha\nC'mon, man. Fuck with me, I'll drop a million dollars on your head\nErase you and your whole family. Beeyatch. Come on. Now that's muscle\n\n[Verse 3: Black Rob]\nWe won't lie, sometimes we stick 'em up\nLast time it wasn't us, though, word\nLike some hoes did 'em up\nAnd nine Glocks hit 'em up\nHow I know it was your dough?\nCuz I was right there when they split it up\nSee I could tell you where to find the corpse\nBut that cheddar, I'm afraid, dawg, that's gone forever\n\n[Verse 4: Mark Curry]\nGreed for wealth got us stingy\nWe got a spot that's hot, niggas envy\nThe fact we clock mad dough\nThey wanna see us shut down, but no\nI don't think so, the crew is still rakin' in the cash flow\nFor every dimebag sold on this block, we want in\nOne slung behind the back, it's under the skin\nWhen niggas try to step to the block and bogard\nWe can't see it happenin', warned them first, \"Get the fuck out of Dodge\"\nBetter believe that, test it, and see if we don't put you on your back, niggas\n\n[Chorus]\nIt's all in the muscle (muscle game)\nAnd you gotta have muscle (muscle game)\nIf you don't have the muscle (muscle game)\nAnd you gotta have muscle (It's all in the muscle game. We lay down the muscle game)\n[Voiceover: Diddy]\nSee, talk is cheap, but Bad Boys move in silence. You ain't even gon' hear me comin'. Ha ha. You just gonna wake up with a bunch of angels flyin' around your head. You feel me? You're dealin' with another type of muscle\n\n[Verse 5: Black Rob]\nNow bein' that it's all out war\nI'm bringin more than that 4-4 (Come on, take that, take that, take that, take that)\nWatch me dispose of all y'all\nY'all fraud-ass niggas, tape-made-me-bored-ass niggas\nGun-bigger-than-sword-ass niggas\nNow enter in the ring, gun drawn, makin' moves like pawns\nTwo at a time, comin' for mine like it's on, nigga, CBS\nHe can't be serious, Finesse\nHe don't believe I keep a gun under the vest\n\n[Verse 6: Mark Curry]\nYou think you can destroy this empire we built from scratch, you're stupid\nI wouldn't care how ruthless your crew is\nWe got defense for this area\nTry to attack, mad niggas on the barriers\nJust dyin' to blast back, bitch\nThere'll be no givin' and no takin', definitely no breakin'\nLaws we lay down, here's the situation:\nSevere torture is what those who offend us face\nI show no love for a punk-ass nigga we hate\nTryin' to pay me no brow and then come up missin'?\nHappens to hardheaded niggas when they don't listen\nI gave you fair warnin' bout the danger you're messin' with\nA stranger invadin' a street corner is a goner\nTry me if you think it's a lie, the attitude many niggas have\nBut in the process many die\nThinkin' they can step to the block and bogard\nI couldn't see it happenin', warned 'em first, \"Get the fuck outta Dodge\"\n(\"Get the fuck outta Dodge\")\n\n[Chorus]\nAnd you gotta have muscle\nAnd you gotta have muscle (it's all in the muscle game)\nIf you don't have the muscle\nAnd you gotta have muscle (it's all in the muscle game)\n[Voiceover: Diddy]\nThis is our game right here. We ain't playin' with you weak niggas. Come on, now. I been doin' this for too long, man. If you ain't got the muscle, better have that hustle. It's 1999. No more mister nice guy. I've been nice too long. I'm just gon' start makin' y'all niggas disappear, man. First, I'm gonna take your records off the radio, then I'm gon' motherfuckin' erase your social security number, you know, take your birth certificate out of the file. I'm gonna do that to your whole fucking family, I ain't gonna have no mercy for you. You understand? Come on, mister nice guy. If you ain't got the muscle, you'd better have the hustle, or keep your motherfuckin' mouth shut, beeyatch\n\nIf you don't have the muscle\nAnd you gotta have muscle"}], "artist": "Black Rob"}