{"artist": "Pacewon", "songs": [{"album": "Won", "title": "I Declare War (remix)", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "{*Jon Lovitz and co. from the movie \"High School High\"*}\n\"Hey listen, I have a record I want you to play\nDon't you think the kids would enjoy a nice song with a melody?\"\n\"What you got, homez?\"\n\"It is a rare, one of a kind, original pressing...\"\n\nThis is a world premiere\nYo, yo, yo (Pacewon)\nYo, yo, yo (Pacewon)\n(Roc-A-Bloc) yo, yo, yo\n\nYo, yo, Pacer Full clip, one up in the chamber\nDanger, ask you what you want, what's the flavor?\nI got thirty-five when I sign with a major\nInvested twenty-nine point eight, spent the change up\nNever been the type to take advice from a stranger\nGun next to me like my neighbor, stay tough\nSpit the hot shit to get the paper\nI roll with more force than Darth Vader, let's see what you made of\nTo hip hop heads, I'm like a saviour\nNigga that ball like Big Pun, but don't wanna be a player\nThis year I declare war on the mayor\nLike let my niggas out the devil's lair, or I'll spray ya\n\nPark your here, spark your fears\nMan without dog gone care, walk on air\nCheck before I mark your gear, call y'all queers\nCould rock steady for four more years, all y'all scared\nTerrorist niggas want to bomb, I'm here\nQuick to cop, pop me in their cd-rom and stare\nEven if our cliques don't get along, who care\nYou still be glaring at the clothes me and my crew wear\nYou need to lighten up, digest a few beers\nBefore you end up meeting the man you do fear\nThis year I declare war on the mayor\nLike let my niggas out the devil's lair, or I'll spray ya\n\nNiggas thought they couldn't be beat, no love\nThink it's all coming we speak, no sir\nThe fact, that I'm usually deep in most clubs\nYou know it's going down when I'm creepin' close up\nYou non-descript niggas might sneak and throw duds\nBut when the bomb go off, those who sleeping woke up\nPacewon, cock my heat back, and blow slugs\nMaking you gangsters with tree and grow bud\nMy Outsider posse meet and show fucks\nWhen hip hop was like where we had to grow up\nThis year I declare war on the mayor\nLike let my niggas out the devil's lair, or I'll spray ya\n\nHa, ha ha ha, ha ha\nRoc-A-Bloc\nHa, ha ha ha, ha ha\nOutsidaz\nHa, ha ha ha, ha ha\nPacewon\nHa, ha ha ha, ha ha\nPacewon\nHa, ha ha ha, ha ha\nRoc-A-Bloc\nHa, ha ha ha, ha ha\nOutsidaz\nHa, ha ha ha, ha ha\nPacewon\nHa, ha ha ha, ha ha\nPacewon\nHa, ha ha ha, ha ha\nPacewon\nHa, ha ha ha, ha ha\nHa ha, ha ha, ha ha\nRoc-A-Bloc", "year": null}]}