{"songs": [{"year": null, "album": "Firestarter Vol. 1: Quest For Fire", "image": "https://images.genius.com/d1c3e48f7789c764dbfe19acbf9cb0b9.300x300x1.jpg", "title": "Gotta Get It", "lyrics": "INTRO [Kardinal Offishall]\nIt's a Kardi Kardi party, what!\nWhat, yeah\nYo this be the Kardi Kardi party, what!\n[Saukrates]\nAnybody coming through here, gotta expect\nThe hottest, hottest, hottest hottest\nThe hottest hottest shit for real\n[Kardinal Offishall] {Saukrates}\nYo yo, {you bitch ass niggas}\nYo yo yo, {you bitch ass niggas}\nYo yo yo, {you bitch ass niggas}\nNiggas know\n\n[Saukrates]\nI ain't spittin', I hock a luggy\nThis ain't no motherfu---- verse, I write movies\nPicture this, how a nigga get sicker than itchy syphilis\nBurn radio waves 'til I hit your bitch Christmas list\nHa, I drop rocks like a fifty cent piece from Terror's twenty\nAimed at your Bentley son\nNumber one when my shard be blast\nMix with hash, made your heart beat fast\n[Kardinal Offishall]\nBack at your ass in full flash\nCome to mash every last class of (emcee)\nPass the baton when I get on\nAnd go on until I got it on\nSpark it up and inhale this (emcee)\nMasterly, masterfully I be the (emcee)\nSo many can't rock the mic, so they hold the Glock tight\nAnd I give thanks I wasn't born a sucker\nPucker for this hard fist lyricist\n'Nuff butter like BBJ's grocery list\n[Saukrates]\nYo, hoes be this hoes be that\nBet if I flash this watch my nigga, that ho be back\nAnd I ain't even rocking a Rolly or fronting with cash\nI'm at the bar with George Costanza arguing for tax\nThe first to let you know, get some flood insurance\nIt ain't a rare occurrence when I overflow\nYou'll be backstrokin' from Alaska to Oakland\nWhen me and my Circle be in a yacht... (floating) *echo*\n\nCHORUS [YLook] {Saukrates} (Kardinal)\nYou know this money man\nGot us acting funny man\nWe sick of living crummy man\nWe got to get this money man\n(New houses), {got, got to get it}\n(Real figures by the thousands), {got, got to get it}\n(Big stacks for the family), {got, got to get it}\n(Big tunes playing annually), {got, got to get it}\n\n[Kardinal Offishall] {Saukrates}\nYo, easy rude bwoy, give me a little second to breeze through\nWe make the track jump, so it's hard to roll trees to\nNo matter give me no daps nigga, I ain't trying to please you\nWant to flow with me, can't afford the fees duke\nClaiming street raps when Jeff Healey could see through\nYour wonder bra rah rah, {garbage like bad pot}\nGo ahead like punk trick and watch where you land\nI'm a shady black slim, you a nigga I can't stand\nMove! kid, this some celebrity next shit\nStep up and watch the next celebrity hanging by they necklace\nPeasants! Think about what you getting into\nWe hardcore, bump those little fist fights we've been through\nWe done did it, never mind can or can do\nWe trying to make it easier for our fam to Land Cruise\nYou sell the same weed at the same spot\nWe graduated to the high grade lyrics pon cock\n[Saukrates] {Kardinal}\nI've been autobahn rhyme ever since primetime\nSaw George and Wheezy sipping on fine wine\nThe ghetto scream {rewind} like daylight savings time\nBring it back, firing legal hollows out the Ac'\n{Who's that?} MC's of leisure, Sauk and Kardinal\nWe bring the ebony stone, now watch me carve it out\nBump my shit in tenement housing\nIt's a vocal revolution for 2000... \"1!\"\n\nCHORUS\n\n[KO] Ayo, you better come strapped when we attack\n[S] Cause only strapped cats have a shot at the rap\n[KO] Bullet holes in the map leave a trail to where we at\nBut stop short of we\n[S] We got them sucking the bowl like they speaking Portuguese\nSo bitch freeze, your motivation evident\nRhymes milky, chocolate has heaven sent\n[KO] Ayo, I'm older now, arguing with back clerks\nAnd presidents and crack heads smoking too close to the residence\nWhat!\n\n[Kardinal Offishall] {Saukrates}\nYo yo, {you bitch ass niggas}\nYo yo yo, {you bitch ass niggas}\nYo yo yo, {you bitch ass niggas}\nYo yo yo, {you bitch ass niggas}\n\n[YLook]\nYou know this money man\nGot us acting funny man\nWe sick of living crummy man\nWe got to get this money man\n\n[Kardinal Offishall]\nYo, big Sox, Kardinal Offishall\nCircle IV, big YLook, cousin Spoke\nLet the motherfu---- beat ride\n\nDon't sleep niggas"}], "artist": "Kardinal Offishall"}