{"artist": "Andy Mineo", "songs": [{"title": "Paganini Remix", "album": null, "year": "2014-03-09", "image": "https://images.genius.com/f766d08afeeec0b0bbe1e55c701bc85b.480x360x1.jpg", "lyrics": "[Verse 1: Andy Mineo]\nWhat you wanna do, act loco?\nHit 'em with the old to the flow\nThat I grew up on then I grew up on\nI'm funny now how I flow for Hova\nHeh, words twisted, but you know I'm sober\nNever really been the type to pour up\nWhen I get this thing going I don't like to slow up\nMouth moving like a motor when I bite the flow up\nBut I bet they won't stop let me go let me go\nWoo! I'mma show off every ability God's giving me to go off\nAnd ain’t nobody mad about the beauty of the Vatican and tabernacle\nSo, when I'm rapping you can add it in\nBreaking 'em with the shatter\nThey're gonna wanna put me in a place with padding\nI'mma damage 'em every time like a player that's on the cover of Madden\nGod be the original, we brag\nLook at Him\n\n[Hook: Andy Mineo]\nI feel like I'm Paganini\n\n[Verse 2: KB]\nUhh, lemme do it\nK to the second letter\nFinna get it popping\nComing out the pocket like oooo!\nEverybody get to rocking doing the Paganini\nKilling the beat, my tongue is like a violin\nGive it to them like I'm not a human\nWhen I'm doing what I'm doing, keeping it coming like an automatic shooting\nWhen we get to ripping it ridiculous\nAnd everybody gets to speaking about these riveting brothers that's going in again\nBut they don't know, even when they got that flow (when they got that flow)\nI don't know why they boast, everybody's gifts borrowed\nLook, producers, directors, skilled architects\nJust do what they do to whom they're connected\nTrue was the God that chooses to bless them\nWho is the one you think they reflecting\n\n[Hook]\n\n[Verse 3: Canon]\nCanon, Yo, hey Andy, okay\nSo down for my clique, shut up, y'all corny, oh shoot, shut up\nI've been itching to stick 'em up with this killer Canon coming to cut 'em and hit 'em harder Ooh kill 'em\nHold up, I've been hitting everything up in me like I'm Paganini\nHitting every rhythm like a milli chopped ya\nI know you heard Twista, and Tech-a-Nina hitting ya but Canon's original\nI'mma Midwest Monster, Kill em!\nBlaaaat! blaaaat! Mineo and Kevin got adrenaline\nComing to drill em with real gospel\nComing up to the game\nStill the same\nBringing the name\nBringing the fame\nTo the glory they follow Him and the father\nWhile I'm coming and killing the game\nI'm breaking 'em off and we know\nThey steady tryna imitate the steelo\nI'm hitting with fire, spitting super wild\nRunning with the young and unashamed\nI'm Paganini on a kilo amigo\n\n[Verse 4: Eric C. The Tempa Tantrum]\n\"It's that\nColorado Demon Killa comin' to kill every demon up inside of yo body...\nReppin' the name of The Name Of The Father in Heaven when I be covered up in the blood dat drippin' to attack illuminati..          Steppin' up into the party and pullin' out a fully automatic weapon that  be ready for whenever you thinkin' that you be ready go to war witta brotha from Colorado because I'ma hittem up witta million bullets (Yeayuuuh)\nBut the weapon of the warfare that I be taking them shots with ain't carnal, steadily mighty up in the Heavenly Father when I be slippin' the clip in breaking everyone of ya strongholds\nTantrum\" feelin' the Holy Spirit up inside of me, demons betta get ready to ruuun\nSee the Devil up inside of you makin' yo body shake he be the ONE that rippin' it when you be bumpin' yo gumz\nAin't nobody that be stepping to the Father, gotta get rid of any demon that wanna argue rippin' the tongue up outta yo mouth, you lookin dressed to kill, gotta Columbian neck tie for you\nAlready knowin' that we be winning, copping the \"W\" to the wisdom of the Father Father in Heaven given His only begotten to be crucified on the cross for my sins,couple of days later arisen"}]}