{"songs": [{"lyrics": "[Verse 1]\nRaw, I'mma give it to ya, no trivia\nRaw like that Aesop rock iron-fisted bliss militia\nA bent funny bone, drone community\nSpit a thousand and one ripples to cripple the continuity\nTapwater builds character. Right\nI irrigate it straight to mainline\nYou want to do the same? Fine\nThese pretty profit grommet teams solidify to clot the slippery city sump piston pump drain\nBehold \"Old King Credible\". Kind soul with a Russian-roulette bad mood spin-off\nWhere every day, a thousand strangers pray for empty chambers\nOne sixth buckle\nFive sixths sweat bullets trying to keep it subtle\nBut I'll get you (I'mma get at you)\nMy novelty, wobbly rope bridge broke inches prior to dry land\nBut duck skull stepping-stones suit the mix down well\nWell, when the rumor spreads that y'all stupid\nI'll be the cat with guilty look on face and shirt that reads, \"I didn't do it\"\nGod, is it on? Is it beyond basic?\nDoes it ice-grill you? Or is every song faceless?\nDoes it have a title? If it didn't would you name it?\nDoes it babble about nothing like a drunk atheist?\nWe could run that Orwell's '84 warp for the Room 101 detour\nUntil each client fidgets with his or her own worst fear specifics\nSwerve around the cobra kisses\nSee if the venom overloads this vision, I'mma suck the poison out and spit it\nStole my sneakers but your feet just never fit in\nServes you right for trying to walk a mile outside your limits\nI'mma tiptoe across this yo-yo string\nUntil you walk the dog out from under my feet and skip town, sit down\n\n[Hook]\nIt goes boom boom boom (x4)\nBoombox (x4)\nC'mon\n\n[Sample: C-Rayz Walz]\nI originate with the drums\n\n[Verse 2]\nEarth to A.R. vertical\nBurden has increased at an alarming rate\nBliss is down a point, murder up, glee down, and still falling\nStill crawling out of bed at 2 on Saturdays came this blind soldier-burning confessional\nEase back, let a heart thump echo normalcy for 10\nLet the back burner boiling point descend\nI race the derby in the first heat (strike personal)\nStrike personal space with a most utterly putrid version of grace\nSpit the gimmick, sit and fidget wild\nIn five you'll be jumping through hoops like Coney Island freak show midgets\nWant to be a fighter pilot?\nDriving that childish early Wright Brothers experiment prototypic model fossil\nSitting sweating bullets on a console\nBusting accidental dirt bike donuts outside the most ridiculous poison tongue brain silo\nDead before the chubby debutante conquered the high note\nSchooled by the cruel intention invention's pensive sideshow\nSee contrary to popular certainty, I alone advance\nWithout an earthly poem, and dance on a handful of zoning fans\nCombing every chance to own the land, I roam with dome in hand\nAnd truly be its only camper happy with the scrap heap\nSee I convince myself it's on, therefore it is\nAnd the melody settles beneath the fact that I'm just spitting for these kids\nI tried to get 'em all open, and once I quit and said I didn't care\nThat's when they all threw their hands in the air\n\n[Hook]", "title": "Boombox", "album": "Labor Days", "image": "https://images.genius.com/6a16cbbd76c264fec96a9675981e9556.1000x1000x1.jpg", "year": "2001-09-18"}], "artist": "Aesop Rock"}