{"artist": "Canibus", "songs": [{"title": "Dr. C. Ph.D", "album": "Mic Club: The Curriculum", "year": "2002-11-19", "image": "https://images.genius.com/b9fe759f8aa3195631fd3906b4b1ed0a.1000x1000x1.jpg", "lyrics": "[Intro]\nDoctor C\n\n[Verse 1]\nYo, I plan to build a myself a facility before I'm forty\nA molecular archeogenetic laboratory\nThat can analyze complex poetry data for me even if it was recorded poorly\nHow extraordinary\nI frog leap over awkward beats\nThen I separate rappers by their Carbon-14's\nTo determine the age of anything ever made\nRegardless of how the outside surface has changed\nI put a curse on your name, bombard your brain\nWith gamma X-rays 'til you burst into flames\nWith the scientifically quantifiable megalomaniacal viable style\nIt's like trying to ride a bull\nLet's have a dictionary duel after school\nCheck into me a nice Cedar Sinai room\nSo I can get sick as the flu, spittin' the truth\nIf you ain't got this album, you missing the proof\nPrepare for your doom my nuclear rocket plumes\nGlow against the pale background of the moon\nToxic fumes spoil complete stocks of fruits and foods\nBurning your flammable boxes and booms\nGot in the groove even though I'm not in the mood\nMotherfucker you didn't win 'cause I can't lose\nGive the fans the chance to choose, fuck you!\nWho's the illest? Who's it really up to?\nRapping fire, you better run for the pacifier\nTie you up and drown you in the saliva quagmire\n'Til your oxygen expires and your lungs dry up\nCause you said Bis ain't dope, you a damn liar\nDisaster for hire over beats by Kyros\nFlow like the Tigris, Euphrates with the eye of the tiger in my iris\nCanibus is a fighter\nMotherfucker, my great grandfather was Irish\nLet's roll the dices, I'll break you like young Tyson\nGive me the mic man, I don't need no hype man\nPut a thousand on me, put one on him\nI tear off his limbs, throw him in and tell him to swim\nYo, I soak that sugar-coated shit in soy sauce\nTell the FCC boss, turn that noise off\nCall Detroit's Mafia Boss\nTell him, \"Yo, I got a job for you, I want you to bust his balls\"\nDrop him off by Niagara Falls\nWrite my name on a banana and put the banana between his jaws\nNobody disrespects lyrical law\nI'm the best there ever is and the best ever was\nTraining like a grunt face down in the mud\nWith blood, sweat, and tears, sucking it up\nYo, you wonder where I am right now?\nI'm probably somewhere on the microphone fucking it up\nDead or alive, Canibus will live through the rhyme\nTo be the illest on the mic is a mission of mine\nSpittin' divine, you can't get it twisted this time\nVocal with a mirror to make sure my lips align\nDoctor C, Ph. D, graduated from UMG\nBright as the LCD display on a new MP\nPrototype of a true MC\nWith 3D topography maps you can't see\nButcher on Broad Street, wrapping CD's\nIn butcher paper, doing artwork with Sharpies\nIf you don't like the quality, then talk to me\nWhat the fuck you on the website for you creep?\nPunching the keys, remember that sound\nThat's exactly what it sounds like when I'm punching your teeth\nKick a rap, bitch, if you've got the gumption to speak\nStand next to me, I might put a lump in your meat\nDiss you and your man, double the beef\nTo tell you the truth, I thought your rebuttal was weak\nRound the outside, blah blah, et cetera et cetera\nThe body of my literature is bigger than South America\nNigga look, this is all I got to say\nSuck my P-H-D-I-C-K"}]}