{"songs": [{"lyrics": "[Intro]\nAlright, alright, alright, alright, alright\n\nAlright we gonna rock this 1\nListen, it's easy\nAlright, look\nWe gonna do it like this\nYo' this is Aceyalone\nGiving a big shout out to Ed O.G. and The B.U.L.L.D.O.G.S\nYo i'm a rock this, look, look\n\n[Verse 1]\nYo brown is my complexion, I got that electric connection\nNow who needs some protection?\nWe rocking hip-hop, come in and turn your gun off\nGave you the mic and off the head you couldn't come off\nI only say it cause nobody wants to shoot ya\nI'd rather teach you science and work on the future\nAceyalon-e not a phoney, not by any means\nAnd by any means necessary be supreme\nI am the poet to flow it and get lyrical\nI write songs like Smokey and the Miracles\nI'm from L.A., city of the Big Bang\nBut everywhere around the world they screaming \"Get thangs!\"\nAnd at the same time I'm screaming out \"I want mine's!\"\nIt ain't really nothing new under the sunshine\nBut sometime you got to put away the fun time\nGet it, cause you only living one time, I got to have it\n\n[Hook]\n360 knowledge of self (I got to have it!)\nRecords all over the shelf (I got to have it!)\nThe wind underneath my wings (I got to have it!)\nMoney and fancy things (I got to have it!)\nThe food for my family to eat (I got to have it!)\nThe raps that can ride these beats (I got to have it!)\nMy own piece of this Earth (I got to have it!)\nFor everything life is worth (I got to have it!)\n\n[Verse 2]\nI got to have it in the 2 triple O\nIt's either work nine to five or you rip a flow\nOr rob a nigga, but how low can you go?\nI ain't a thief, I just want relief for sho'\nI got to get mine's, no different from everybody trying to get theirs\nSo I was getting prepared\nInstead of spitting shots through the air, maybe getting a chair\nYeah, I got ta, got ta\nHave it, have it\nLike peas and carrots, broccoli and cabbage\nBread and butter, now did I stutter?\nDon't you utter another word, you mouth is in the gutter\nAnd I can't take it, don't want nothing from you\nAnd I can't stay, I got this bitch something to do\nAnd it's more important than Michael Jordan\nOr Oprah Winfrey or Billy Cosby\nTo the death like a kamikaze\nHuh, I got to have it\n\n[Hook]\n360 knowledge of self (I got to have it!)\nRecords all over the shelf (I got to have it!)\nThe wind underneath my wings (I got to have it!)\nMoney and fancy things (I got to have it!)\nThe food for my family to eat (I got to have it!)\nThe raps that can ride these beats (I got to have it!)\nMy own piece of this Earth (I got to have it!)\nFor everything life is worth (I got to have it!)\n\n[Verse 3]\nSee I want everything that I don't have\nSo don't laugh when I tell you I want half\nBut I don't want your half, I just want my half\nAnd on my behalf, put it on a phonograph\nCD's tapes, packaged with a photograph\nAnd respect the ancestors when we walk the path\nTalk the math, speaking like a genuine\nBless the Gods, bless the mic, and then you rhyme\nAnd keep it going until you end up at the finish line\nAnd when you see the light beaming, then it's time\nWe kick/king a four alright, but this without a space ship\nDon't want to take your life, I know I can't replace it\nSo while you're sitting around the house getting wasted\nYou know you're not using your full potential now you're facing\nAnd plus, ain't nothing wrong with riding the bus\nSo put on your Nikes and kick rocks\nI got to have it\n\n[Hook]\n360 knowledge of self (I got to have it!)\nRecords all over the shelf (I got to have it!)\nThe wind underneath my wings (I got to have it!)\nMoney and fancy things (I got to have it!)\nThe food for my family to eat (I got to have it!)\nThe raps that can ride these beats (I got to have it!)\nMy own piece of this Earth (I got to have it!)\nFor everything life is worth (I got to have it!)\n\n[Outro]\nUh, yeah, all right, do it like that", "title": "I Got to Have it Too", "album": "Accepted Eclectic", "image": "https://images.genius.com/4f38e699f6f80a3255420adf5e98a0a8.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}