{"songs": [{"title": "Snakes and Ladders", "lyrics": "Chorus [AKA]\nRiding with my gangster on\nSeat level and it really don't matter\nOn my way to make her fall\nLast two was tryna get famous\nI just wanna play my part\nThis game of snakes and ladders\nOnly gonna make us strong\nGonna make us strong\n\nVerse 1: [AKA]\nSomebody tell me what we doing in this Goddamn club\nParty all night drink too much\nLooking in the wrong place if you trying to find true love\nLiving life in a polystyrene cup\nPlastic! Everything I touch is a drug\nAnd every girl I fuck got a grudge\nEverybody watch what I does\nWarm handshake between my old ace ain't what it was\nGirl, understand me now\nAll of a sudden everybody family now\nAll of a sudden everybody: \"Hand me out\"\nI could never let you motherfuckas drag me down\nStrike a pose for the Kodak moment\nTake another shot keep the good times rolling\nPussy like the ocean, he is moses\nThe good die young guess I'm one step closer\n\nChorus [AKA]\nRiding with my gangster on\nSeat level and it really don't matter\nOn my way to make her fall\nLast two was tryna get famous\nI just wanna play my part\nThis game of snakes and ladders\nOnly gonna make us strong\nGonna make us strong\n\n\nVerse 2 [AKA]\nMe and the money got a fatal attraction\nThey put it in my hands still evaded my taxes\nPaper clips and rubber bands, pardon my fashion\nMy pockets on sag, I be pulling my pants up, but never mind\nEverybody rap these days\nTrapped in a maze full of rap cliches\nSummertime, in the limelight we bake\nOn the way to get any bottle he say\nBut wait\nWhere the fuck was you when I was uncomfortable but didn't have a spare buck for change\nAll black tux better handcuff your bae\nThrow your hands up paper bags up we paid!\nHey!! don't stop till 6 in the morning\nTake a tape and confetti keep falling\nBlack parade, say a prayer for your daughters\nFuck maintain bro I gotta keep... (laughs)\n\n\nChorus [AKA]\nRiding with my gangster on\nSeat level and it really don't matter\nOn my way to make her fall\nLast two was tryna get famous\nI just wanna play my part\nThis game of snakes and ladders\nOnly gonna make us strong\nGonna make us strong\n\nVerse 3 [AKA]\n\nSeems like everybody got a hidden agenda\nScreen time make it hard to figure who friends are\nPeace sign baby I'll be gone till November\nPetite size, in between thighs I end up\nStreet lights!\nBaller types pulling they Rolls up\nGirls in the bathroom powdered they nose up\nThe old ones thinking \"Not one of them showed love\nBefore we had dough got a wife at home\"\nBut the gold dust, keep calling them backwards\nBankers, athletes, balling for practice\nBack seat, got a bitch, better than last week\nNew freak shit is all part of the routine\nModimo! girls keep swelling my ego\nBlockbuster nights and my life is lead role\nThe fame change nothing about you, the fame change people around you\n\nChorus [AKA]\nRiding with my gangster on\nSeat level and it really don't matter\nOn my way to make her fall\nLast two was tryna get famous\nI just wanna play my part\nThis game of snakes and ladders\nOnly gonna make us strong\nGonna make us strong", "year": null, "album": "Altar Ego", "image": "https://images.genius.com/04dba2cb161f7bd426cc0ca9e52a2d54.1000x1000x1.jpg"}], "artist": "AKA"}