{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Beats, Rhymes & Phife", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "Malik, what are you gonna do with your life?\nAre you gonna stand on the corner?\nAre you gonna sit around with your friends?\nYou wanna wear new sneakers, you wanna have nice clothes\nHow 'bout gettin a job?\nHow 'bout finishin school?\nHow 'bout gettin your life together?\nDon't you wanna prosper, don't you wanna be somebody?\n[ *last sentence is in a foreign language - suggestions appreciated* ]\n\n[ VERSE 1: Phife ]\n11-20-70, who would have known\nThat premature born will be grabbin microphones? (Mutty Rankin)\nCalled Malik Isaac Taylor to Walt and Cheryl\nGrew up bein a sports fanatic, wantin to box for gold medals\nInfluenced by the likes of Ali and Sugar Ray\nMagic Johnson, Tony Dorsett and Doctor Jay\nThen came the Cold Crush, L.L. Cool J\nPops said he had to move to Cali, but nah, I had to stay\nNew York was all I ever knew, plus hip-hop started tweakin\nBlock parties every weekend, come home late, catch a beatin\nGettin grounded for months, to the jams young Phife was speedin\nOnly 4'8\", still the ladies had me cheatin\nI reminisce about them hot New York, nights grabbin mics\nAnd hell, God forbid if your flow wasn't tight\nQueens, L.I., nothin but flavor over here\nI could tell you but so much, cause you had to be there\nGrowin up I spent much time with my nana, Mom was at work\nKnew every version of Bible, I damn near lived in a church\nNana was 7th Day Adventist, those days I can't forget\nAll day, Saturday, I have to wait until the sun set\nFriends would knock on my door: \"Can Malik come out to play?\"\n\"No hon, no way, not today, he has to pray\"\nThose famous words that my granny would say\nTherefore I run my ass upstairs and sneak on the TV\nAw shit, _Soul Train_, better act like you know\nI used to turn the volume down, so nobody would know\nNow while I stared at Jodey Watley, I would practice my flow\nLook at all them asses, yo, no doubt, on the low\nSteady enjoyin the show, everything good to go\nLow and behold, granny was right at the do'\nNow I'm dealin with the punishment of pain - I sure deserved it\nProceedin to the fullest, only three hours since the sermon\nThen comes the fatal question: \"Did you learn anything from service?\"\nBut in the name of hip-hop - for real - it's all worth it\nYou know my name\n\n[ Dave West ]\nPhife, Phife\nPhife, Phife\nPhife, Phife\nPhife, Phife\n\nPhife, Phife\nPhife, Phife\nThis is your life\n\n[ VERSE 2: Phife ]\nGrowin up in a West Indian household, it was real\nAll my Trini, Bahians, Haitians, Jamaicans, they know the deal\nSo many days doin nada, watchin cartoons on the couch\nUnderdog, Mighty Mouse, with the twizzler in my mouth\nMom dukes used to say, \"That's all you care about\nEat, drink, sleep, shit up the toilet in my house\"\nDropped out of high school, went to get a G.E.D\nThe only thing though on my mind is how I'm gonna emcee\nGod kicked out the crib, moved with my aunt in D.C\nUsed to make my housecalls, by sellin nickel bags of weed\nHere and there I copped some gear, but I would stay with my dough\n80 bucks a hour, just to hit studio\nEveryday, every night, I be spittin my flows\nEntered talent shows, would lose, cause they love the go-go\nWalkin off the stage vexed, \"y'all muthafuckas don't know\"\nFinally made a decision, to take my ass back home\nCopped at job at Mickey D's, flippin burgers with cheese\nHad to find a better way, cause this wasn't my speed\nTight uniforn pants, with the arch in the back\nPhone ring, it's for Phife: \"What up Shaheed, where you at?\"\n\"Jive, muthafucka, we just signed a contract\"\n\"Say word?\" \"Word bond, now give that uniform back\"\nNow I'm happy than a mutha, yo, you can't tell me shit\nCouldn't wait to tell my mama: \"I'm a celeb now, I quit\"\nFrom the tender age of 9, this is all I dreamed of\nHip-hop, the first chick, to ever have me in love\nTell the world my name\n\n[ Dave West ]\nPhife, Phife\nPhife, Phife\nPhife\n..singin this damn hook", "year": "2000-09-26"}]}