{"songs": [{"year": null, "lyrics": "[Verse 1]\n(It's that 5th floor...)\n\nTell a bitch to ride the dick\nLike I ride the beat, like I ride the beat\nIn the suites looking over the streets and all that\nAnd when I leave for the summer and winter, she fall back\nCan't have no creases up in the shit that's coming off the head\nSo I told her wrap my shit up before we go to bed\nHungry ass bitch told me take her out to dinner\nKnowing damn well she'd order half the shit that's on the menu\nReverse game, hit her with a cold line\nTold her I don't want her pussy, yeah that really fucked her mind\nLearned that from a cold mack\nHow to make them come back\nHow to make her run back hanging off your sack\nHow to make a bitch take a bullet like the secret service while you sit back and watch the Kentucky Derby\nHow a nigga sound so clean and never talk about a chopper or a key, motherfucker?\nHow a nigga sound so clean when he pull out his piece and fuck the mouths of the beasts like that?\n\n[Hook]\nReally now? Yeah, really now?\nBout to make her feel it now, but when she look the city down that\nReally now, really now?\nNod your head, this crazy ho\nI'm too hard for that radio\nRomeo and Juliet, hot sex, hot sex, hot sex\nRomeo and Juliet, hot sex\nOn the walls of the 5th floor really how I do it, yeah\n\n[Verse 2]\nTell a bitch to ride the dick\nLike I ride the beat, like I ride the beat\nShe think this shit a mirage and that her ways are the lodge\nAnd my dick game colder than a condo in Tahoe\nBitch I'm running every ho\nBougie bitch stay on the phone\nPut that dick up in her while she argue with a nigga\nMid-fuck-you she caught a hit of steel\nHung up said she want the real, it's all good she on the pill\nI declined and I put that pussy in the bleachers\nTold her suck my dick\nMy shaft the song, my balls the feature\nHottest 2 man duo from here to Costa Rica\nPut 3 fingers in her while nodding the music leave the speakers\nPlay my shit to some hoes they never nod their head\nCause I'm probably speaking on some shit that they already did\nJust keeping it real\nI'm on the 5th floor, on the phone, bottle of privilege up in the bathrobe\n\n[Hook]", "album": "Ice Cold Perm", "title": "Brick $ell Phone", "image": "https://images.genius.com/98d3e3369facf82ee69688c5e541f1f3.1000x1000x1.jpg"}], "artist": "100s"}