{"artist": "Ant Banks", "songs": [{"title": "Something Like That", "image": "https://images.genius.com/929cacd7483396413e8968b427318292.968x968x1.jpg", "album": "Straight Outta Compton: N.W.A 10th Anniversary Tribute ", "lyrics": "[Intro: Ant Banks]\nHah yeah, Right about now\nAnt Banks and J-Dubb in the mothafuckin' house\nOakland is in mothafuckin' full effect\nAiy, mothafucker kick the beat in\nAnd let's do what we do\nYou understand what I'm saying?\nAiy yo, J, what the fuck we gonna call this shit?\nTell them what you named is\n\n[J-Dubb]\nYeah, Something Like That\n\n[Ant Banks]\nWell, let's do it\n\n[J-Dub]\nBack by demand, now we big as fuck\nBecause you was the public, you should know what's up\nBig Thangs got us swoll, it was more than gold\nIt was the hit cause it was based on some crazy shit\nSo our final conclusion, has been permitted\nPunks made us a target and knew that we would hit it\nBut that was a part of showbizz\n\n[Ant Banks]\nAiy yo homeboy\nWhy don't you tell them what your name is?\n\n[J-Dub]\nNow, for the record it's Dub, and on the streets it's Villain\nSquares keep chillin' cause I'm peelin' like Matt Dillon\nOn Gunsmoke, but I ain't the man of the law\nI'm livin' raw, smokin' weed by the nuts with cough\nAnd pullin' stuff\nNiggas better check their necks\nI put a hex and shoot with slugs\nAnd all the wrecks with techs and bullet vest\nAnd every bitch I met would bet I kept it wet\nCause I'mma pimp but don't sweat\nAnd players don't test\nNow, who the man in the mass?\nThere ain't no reason to ask, I'm just gettin' my cash\nCause that's the part of the showbizz \"ha ah\"\nAiy yo homeboy\n\n[Ant Banks]\nWhat's up ?\n\n[J-Dubb]\nWhy don't you tell them what your name is?\n\n[Ant Banks]\nAnt Banks, the Big Bad Ass\nThe nigga that's known for twistin' bitches when I tap that ass\nI leave them stuck on stupid \"stupid?\"\nAnd known for stressin' \"uha\"\nSo now, let's get the motherfuckin' session goin'\nFlowin, it's time to start throwin'\nRhymes, so keep in mind all the Dollars I'm foldin'\nWhen everybody knew in the time \"yeah\"\nI'm just a down ass mothafucker goin' for mine\nUnlike a lot of niggas who claim they're gettin' busy\nTryin' to be like me but can't fuck with me\nYou need to quit runnin' off with the mouth\nAnd nigga thank you, for stop puttin' that bullshit out\nIt's not hard mothafucker, you could do it fool\nTryin' to make somethin' funky and original\nYou're either talkin' about busters and bitches\nWhat you gonna do, \"yep\" or you can't do shit\n\n[Ant Banks]\nHa ha awww yeah\nThat's what I'm talkin' about, Dubb\nThese mothafuckers don't know what mothafuckin' time it is, nigga\nFuck it (*Burp*)\nI guess we gotta kick another verse\n\n[Ant Banks & J-Dubb]\nThis is real shit, somethin' to fuck with your ear\nJ and Banks will appear, the pimps of the ear\nTo fuck it up like we always do, and that's the trick\nSayin' some shit to make the bitches wanna suck our dicks\nBut it's an everyday thang\nOf the heezy, for sheezy, with the Oakland slang\nBitch, now we're back in the house and your appartment\nSo open your door, by the way, so we can start it\nTest the monitors and the call is mic\nCause the way we feel, we're gonna fuck it up tonight (*Echoes*)\n\n[Ant Banks]\nAwww yeah, Ant Banks and J-Dubb\nYeah, shootin' much respect out to them Old School, O.G. Niggas\nN.W. mothafuckin' A\nYeah, you know what I'm saying?\nAiy yo J, what fuck we gonna call this shit\nTell them what you named this?\n\n[J-Dubb]\nYeah, Something Like That\n\n[Ant Banks]\nAlright", "year": null}]}