{"songs": [{"image": "https://images.genius.com/bd9da26c2793699b67c6c4e84300f432.500x500x1.jpg", "album": "Generation Gaming XVII", "title": "Connor’s Soliloquy", "lyrics": "[Verse 1]\nI've been ordered here for a purpose\nDue to my experience from a career in the service\nTo all appearances I'm merely a person\nBut there are circuits concealed in the surface\nBut nobody's perfect, not even mine\nI can see the fear she's feeling inside\nBut can't quite empathise with the reason she is crying\nBut I don't need to deal with it, my priority\nIs reaching the scene of the crime, high rise horror scene\nI'm only even here to provide quality authority\nOn whatever unfolded on this property\nSo once I told it to the SWAT I'll see what subtletly I can reveal\nAnd employ in my appeal\nTo the android with whom I'm gonna have to deal\nSeems antisocial, but on closer inspection\nThere's definitely some personal connection\n\nWhether he was turned due to hurt or rejection\nThere's a little girl needing urgent protection\nWho doesn't deserve this aggression, now for me\nTo be stepping out to the penthouse balcony\nOw, did he really fire a round at me? Ding!\nHow could he think it'd help anything\nNow we're really in a painful conundrum\nI'm gonna begin with a straightforward introduction\n\nI'm Connor, would you do me the honour of stepping off the ledge\nNo, not the edge, are you off your head?\nHe's gotten scared, had enough and said if we stepped any closer\nThey'd be dropping dead, fate hanging by a cotton thread\nOr a copper wire or it might be fibre optic\nI am trying to inquire into what has got his clock ticking\nBut there isn't time for the whys and the whats\nThis is life on the line and it's my job to stop this\nIt's not a trick you can fix with a drop kick\nClifftop cliffhanger logic that is toxic\nIt's rock solid but he's standing on a rock cliff\nSo no SWAT longshot's gonna stop this\nNo sudden change of heart from a soft kiss\nNo M. Night Shyamalan shock plot twist\nThis is an uncommon situation I do not wish\nThat one of my songs had a really big drop, shhhhh\n\n[Hook]\nIf only things could have been different\nIf only things could have been different\nIf only\n\n[Verse 2]\nIf I'd have just listened better I could have sussed this in a second\nThe blood dripping on the dresser, couldn't have been any fresher\nI guess I must have given into the pressure\nBut luckily I've been given a little refresher\nTo experiment and test a different method\nTo better fix the dilemma enveloping us at present\nGetting under the desk and then I pick up a weapon\nThen getting under the skin of this particular specimen\nNon citizen, he's never been convicted a felon\nSo I must sift through the evidence when predicting his temperament\nThen commit to whatever decision that I've eventually given\nAs if I was there with the kid and I'm staring into his retinas with her\nEven thinking it's making me shiver\nAnd if we mess it up, how could the parents ever forgive us\nFor such a deadly decision\nWe must be there with precision and from every position\n\nIt's a roulette and this could go so many ways\nHead spinning like a set of helicopter rotor blades\nIf there's a God, then God just wrote a play\nIs it a comedy or tragedy, we've got to know today\nThere's no escape, no doctor note or stay of leave\nNo hope and pray, you've got to vote remain\nIf you don't then the shot will blow your brain\nSo rough the shockwave will mean you'll suffer loads of pain\nSo look the other way, oh, just a little late\nPulled back my elbow and then I stuck it in your face\nLook, I'll do whatever stuff the predicament takes\nJust to make the guarantee that our abductee is safe\nIs this the fall of mankind?\nNah, I hear this all the damn time\nAndroids are the people with the cellphones\nTalking to the humans who would tell them \"Call the land line\"\n\nCan high artificial intelligence\nReally be aware if it is committing a deadly sin?\nOr is it synthetic and it is merely pretending to think?\nWhether it is or isn't, their existence can end in a blink\nIn the end it doesn't matter, flesh and metal are another matter\nAnd I guess it's just another chapter\nIn the neverending epic of connected interaction\nThat ascend from elements and chemicals up into passion\n\n[Hook]\nIf only things could have been different\nIf only things could have been different\nIf only", "year": "2018-05-08"}], "artist": "Dan Bull"}