{"songs": [{"image": "https://images.rapgenius.com/8fbf8f4648641cd98c2ce57e52d50032.1000x563x1.jpg", "title": "It Is What It Is", "album": null, "year": "2015-05-09", "lyrics": "[Intro: Reading of The Vanity of Existence]\nOf how many a man may it not be said that hope made a fool of him until he danced into the arms of death, then again, how insatiable a creature is man? Every satisfaction he attains lays the seeds of some new desire so that there is no end to the wishes of each individual will. And why is this? The real reason is simply that, taken in itself, Will is the lord of all worlds: everything belongs to it, and therefore no one single thing can ever give it satisfaction, but only the whole, which is endless.\n\n[Hook]\nEven though you used to call my name\nI turned a cheek, I looked the other way\nMy hands are weak, my soul is laced with shame\n'Cause I'm the only one whose left to blame\n\n[Verse 1]\nParked car and I said it with a hard \"r\"\nGot wounds like a scar from a hard spar\nNo wind and I’m stuck on the sandbar\nYou say you're the man, sports bars and a charred heart\nOn some slick rick shit,\nEye patch, chain, black shirt - misfits\nThrow a bitch fit\nMan I don’t really gotta\nI'd rather just cry\nOriginal don dada\nOriginal Kinsella\nYeah, that's better\nShed mad tears in a Thursday sweater\nCan’t keep telling me it gets better\nI’ve read too much Nietzsche for your speech to impeach\nMan I don’t need company\nTattoos, black heart see they run from me\nSo I lurk in my dark and I stay\nComfortably.\n\n[Bridge]\nMan I got these demons\nMan I've been engaged to the road\nUsed to be skating with friends now there's nothing to show\nPretending I'm pensive\nI know that you know that I know\n'Cause death is a bitch and you better enjoy before you go\nI got so many damn thoughts in my mind\nAnd I can't find the time to replace all the space\n\n[Hook]\nEven though you used to call my name\nI turned a cheek, I looked the other way\nMy hands are weak, my soul is laced with shame\n'Cause I'm the only one whose left to blame\n\n[Bridge]\nYou don't know where I've been\nSo don't expect me to come home\nYou don't know what I've seen\nSo don't expect me to come home\n\n[Outro: Reading of On The Sufferings of The World]\nOne man, it is true, may have faults that are absent in his fellow; and it is undeniable that the sum total of bad qualities is in some cases very large; for the difference of individuality between man and man passes all measure. In fact, the conviction that the world and man is something that had better not have been, is of a kind to fill us with indulgence towards one another. Nay, from this point of view, we might well consider the proper form of address to be, not Monsieur, Sir, mein Herr, but my fellow-sufferer, Socî malorum, compagnon de miseres! This may perhaps sound strange, but it is in keeping with the facts; it puts others in a right light; and it reminds us of that which is after all the most necessary thing in life—the tolerance, patience, regard, and love of neighbor, of which everyone stands in need, and which, therefore, every man owes to his fellow.\n\nAnd, chapter one, On The Sufferings of The World."}], "artist": "​nothing,nowhere."}