{"artist": "Cappadonna", "songs": [{"title": "Dream", "album": "The Cappatilize Project", "year": null, "image": "https://images.genius.com/9e39a26e8da8941483c3579ba53558e3.1000x975x1.jpg", "lyrics": "[Intro: Martin Luther King Jr. sample]\nI have a dream, today...\nIn what will go down in history\nAs the greatest demonstration for freedom\nIn the history of our nation\nI have a dream...\nTo make justice a reality for all of God's children\n\n\"Tell me, this is a dream\" - The Delfonics sample\n\n[Cappadonna]\nOf a big house, too many whips\nMad wives and kids running out, what's that all about?\nOf me taking trips, overseas\nGetting my stacks up, cuz baby, now I'm getting big cheese\nTriple platinum sales, walking down the isle\nWith my cream in the background, what, I'm hearing church bells\nOf getting back all of my paper\nThat Razor Sharp stole from me, yea, kid it's only one me\nA crush and an R&B chick, she looking real thick\nBut she was only after my chips\nA free of momma love, out of the slums\nInvested all my property into my daughters and sons\nOf connecting the dutch, with the haze\nFeeling mad tired, from guards, I ain't slept in four days\nOf hooking up with all of the top rappers\nJust came home from this club called Cappa's Nappy\n\n[Chorus: Cappadonna]\nTell me, this is a dream, somebody, please\nTell me, this is a dream, somebody, please\nTell me, this, is, a, dream\n\n[Cappadonna]\nOf receiving awards, for the best album of the year\nAnd oh yeah, for still having the best broads\nOf doing my thing, everybody hating\nBut once I hit the top, they be up under my wing\nOf producing these tracks, that sound phat\nStarting my own label, now, nigga how you like that?\nOf my baby mother's hurting theyselves\nThinking they was jerking me, but they was jerking theyself\nOf all of the police that like my style\nThey wasn't feeling me, but now, they loving me now\nOf being down on my luck, heading for the come up\nLiving in the hood, but yo, still it's all good\nOf my brothers locked away, they came home\nDon't give a shit about slot time, they carrying the curf' phone\nOf my people, stop busting them slugs\nStart united our people, stop fucking with drugs\nWhat up?\n\n[Chorus]\n\n[Outro: Cappadonna (Martin Luther King Jr. sample)]\nDream, this my last dream, this one is for you\nKeep the mack milly by your side, don't let nobody stop you\nDream, me getting on\nMe and Quazolla, gotta get that corn\nMe, keeping it real\nStaten Island, what, slash, Homicide Hill\nDo what you do, don't forget about your people\nThey won't forget about you\nAnd everything is all good\nAfraid of God, man, do what you could\n(I have a dream that one day\nThis nation will rise up\nAnd live out the true meaning of its creed\nWe hold these truths to be self-evident\nThat all men are created equal)"}]}