{"artist": "Becky G", "songs": [{"lyrics": "[ Intro: ]\nYeah, Latinos\nI can go all around the world\nBut there’s no place like where you come from\nC’mon, Yeah\n\n[ Verse 1: ]\nMic check one two baby!\nFresh off the blizzy, New Adidas track suit\nWhite, green, and red stripes\nI might get a tattoo\nI’m so Mejico, No pavement\nDirt roads I walked those and I finally made it\nThis is for my grandfather who came\nWithout a penny now I’m rapin ‘bout my shoe game\nLet me check myself, everybody need that\nGrandma listen to my records but she doesn’t speak that\nI’ve seen poverty, I know how it feels\nTo change the life of a kid with some big wheels\nJust like Santa Claus, In Jalisco\nGivin presents to these kid-no tree though\nI do it for my roots, and I ain’t talkin hair\nCan’t drive into the USA so we walkin there\nI love my heritage, I’m so irrelevant\nNew Vicente Fernandez I’m blarin it\nEstephan Lopez, George and Jenifer\nI’m so focused\nI speak it fluently, I might rap in it\nUntil then, Ha\nIt’s a wrap ain’t it\n\n[ Hook: ]\nOwww, Yeah\nIt just feels good\nTurn that music up\nIt just feels good\nTurn that music up baby\nIt just feels good\nAsi, Asi – C’mon Hahahaa\n\n[ Verse 2: ]\nAnd now my family live in Inglewood, there’s a whole block of us\nI signed my deal and took the doc to a taco truck\nThat’s just who I am, Viva Vismo\nI’m on TV now, Telemundo!\nSee my dad’s daddy work his finger to the bone\nFor less than I made and so I’m bringin that home\nNever goin broke again, we lived that\nDollar menu dinners for my family won’t miss that\nAnd when I touch down, to the motherland\nIf I can’t cry cuz I’m happy that my mother can\nSo I pay my respect to the fallen ones\nSelena was a star, Can’t believe they call me one\nChannel Pancho Villa Wen, I'm tryna conquer\nI know we saw the white light, you is blanca\nI’d rather die on my feet in this battle ground\nThen live one day on my knees, How that sound?\nI’m bringin everything I know to the masses\nTequila shots, Raise your glasses\nNot for me, though, a bag full of Fanta\nLight a candle on the window sill for the Hanta\n\n[ Hook: ]\nOwwww, Yeah, C’mon\nIt just feels good\nTurn that music up\nIt just feels good\nTurn that music up baby\nIt just feels good\nAsi, Asi, C’mon, C’mon\nBecky Becky Becky G\nLatinos stand up!", "image": "https://images.genius.com/8a77bc84364963db0428ba78ee736ef3.1000x1000x1.jpg", "year": null, "title": "Turn The Music Up", "album": null}]}