{"artist": "Cam’ron", "songs": [{"title": "Fairytale", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Hook: Avery Storm]\nI keep the lights on, nothing you can tell me\nI'm moving past you, none of you facing me\nI'm in that White House, I'm what all that hype's about\nI am the general\nI keep the lights on, the head of this family\nI moves mountains, there's nothing you can sell me\nI tear the world down just to build it back again\nLike it's a fairy tale\n\n[Verse 1: Cam'ron]\nBoy, chill -- 'course the boy will\nDo you greasy -- BP oil spill\nBoat rides, bow ties\nCoke flies so high, oh my\nListen, scram, Cam'll turn you into maggot food\nBaby girl, you coming or not? \"Damn, Cam! You rude!\"\nNah, I'm Eric Wright, [nigga] with a attitude\nThen I hit her with some 'Pac -- \"I ain't mad at you\"\nY'all stay shook, I'm straight crook\nI made appointment for head, that face book\nAnd I stay in drama, but anything with honor\nI hit your BBM -- your broke baby momma\nAnd I won't stop, I'm on my Diddy [shit]\nYeah, they start to like me, then they find out I'm a idiot\nAll they do is look and say, \"Mmm-mmm, pretty slick\"\nAnd your girl is like my knot -- pretty thick\n\n[Hook]\n\n[Verse 2]\nShout to my black president, Obama\nTell the cops chill, though; find Osama\nSecret Service, sorry -- I don't want no drama\nYou'll be enemy of the state; whoa, mama!\nGucci boots with the strap, all brown, though\nYou're worthless, same circus -- different clowns, though\nMy scoundrels on Greyhounds with pounds, though\nWe take trips with bricks -- hey, you down, ho?\nDon't question me, play enough clown, yo\nI get the whistle cause you're way out of bounds, mo\nWe fly high, fly guys, aideo!\nY'all burgers like Five Guys, adios\n\n[Hook]\n\n[Verse 3]\nYoung girls say I'm fly, cute -- I reply mute\nF5 coupe I pull up to my stoop\nKissing in public? That's preposterous\nSuperman? Nah, but the crip is Metropolis\nMy day? It consists of driving bricks\nPicking money up, getting head, copping kicks\nThen the studio -- I don't even stop and piss\n\"Go shopping now, Cam?\" -- c'mon, stop it, miss\n\n[Hook]"}]}