{"artist": "Pras", "songs": [{"album": null, "title": "Mistakes", "image": "https://images.genius.com/5f4f397c7311486910ee54514a7ad678.1000x1000x1.jpg", "lyrics": "What's life without you baby\nI know I made a lot of mistakes\nAnd I ask you for forgiveness\nAnd if lovin you is a crime, then I plead guilty\n\n[Chorus 2X: Pras Michel]\n(1) Hey yo I made my mistakes, and real talk is\n(2) Made my mistakes, and real talk is\nThis time I gotta do whatever it takes cause I\n{\"hear you call\"} and I ain't leavin without you\nGoin nowhere, yeah, I'm standin right here\n\n[Pras Michel]\nI need you more than ever before, girl for sure\nYou know, it's all fair in, love and war\nThrough, health and sickness, rich or poor\nYeah life never seem to tell us what it has in store\nBut you're my angel in the mornin when the rain falls\nAt my beck and call whether I ball or stall\nNever intimidated, we can make reservations\nPolly 'bout Revelations...\nGet deep like subway stations, you love the conversation\nYou love this nappy-haired, natural born Haitian\nCheck it, make you feel good like Dr. Feelgood\nParty in the hood baby, it's all good\nNever mind that, forget 'bout the small talk\nLet's conjure up some thoughts, and take a short walk\nUp the driveway, straight to my crib\nCommitin sex crime and the kids'll be the bid\n\n[Chorus]\n[Pras Michel]\nI'm just a, simple man, can't you, understand\nIf you know like I know you know I got a master plan\nIce up that finger with this, wedding band\nNow our bank card reads Mr. and Mrs. Geechy Dan\nShare wit'chu, my life of sin\nScripted with this liquid pen, come again\nMighta lost a couple battles but this war we win\nEven though our enemies baby lies within\nWit'chu by my side I got nothin to lose\nYou and I against the world, what the hell we got to prove?\nUnconditional love, let's swing an episode\nI'm stocked up and my mojo is overload\nI adore you baby, from head to toe\nAnd you know my style is so unbelievable\nBut I've made my mistakes and I do realize\nPlease listen babycakes cause I do apologize\n\n[Chorus]\n[Pras Michel]\nI like to, greet the sun, and walk among the stars\nWatch you from afar even though men are from Mars\nThe way I treated you and made your life so hard\nCan't really express it all in 48 bars\nCause sometimes in life we all have pain and sorrow\nWit'chu by my side I look forward to tomorrow\nI give you everything I own, you shelter me\nYou taught me how to cry, baby you set me free\nI know love don't love nobody\nIf that's to be true don't rain on this party\nWe'll bang all night to kill the sunrise\nI'm the first one you see when you open your eyes\nWhen it's all said and done girl you're my soulmate\nI made some mistakes, hope I'm not too late\nFrom the bottom of my heart hope my light shines through\nLike Donny Hathaway I wrote this song for you, ju know\n\n[Chorus]", "year": null}]}