{"artist": "Will Smith", "songs": [{"year": "1999-11-16", "lyrics": "Mic check, mic, mic, mic, mic, mic, mic\nUh gimme more heat\nUh gimme more heat\nUh, uh, yeah, yeah, yeah\n\n1 - Everybody in the front now (whoot, whoot)\nEverybody in the back now (whoot, whoot)\nEverybody on the side now (whoot, whoot)\nLa fiesta (whoot, whoot)\nAll the ladies in da house now (whoot, whoot)\nAll the fellas in da house now (whoot, whoot)\nEverybody in the house now (whoot, whoot)\nLa fiesta (whoot, whoot)\n\nIf I approach you correctly\nAnd step up to you respectfully\nWill you please ma'am bless me with the next dance?\nI don't intend to offend you\nI only intend to befriend you\nBut you're willing me, thrilling me, killing me\nWith those hot pants, not a chance\nI'mma let you go without saying something\nA little hotter in the bottom mama that's all that I'm wanting\nNo frontin' if it is illegal for you to be that fine\nI be McGruff mama taking a bite out of crime\nLiterally, first it'll be dancing with me\nThen it'll be dinner with me\nThen it'll be back to my crib\nHold up, I'm about to get ahead of myself\nAnd I'm playing myself\nThe type of brother that when I'm thinking of stuff\nI'm saying the stuff\nMy bad, back it up let's start with a dance\nOn good behavior, maybe later\nMaybe your apartment, your pad\nSike, joke, walking a tight rope\nMy foot in my mouth\nLook, all I hope is that you'll dance with me\nWhat's up?\n\nRepeat 1\n\nShe was smiling I was kind wiling\nThinking I was dialin' in\nShe gave me the impression that she was getting my message\nSo I'm testing\nI through it out there 'Let me buy you a drink'\nCause when I buy you I think it'd be fly if we link\nWhat'cha think?\nShe responded with a grin and a glance\nThen my eyes tried to seduce her to the forbidden dance\nThe body of a Latin goddess, sexy but modest\nThe hottest mami chula from Cuba, a cutie with promise\nThe other night I seen her dancing\nDuty was over\nShe did a split into a spin\nAnd put her leg on his shoulder\nAnd he was over\nIf that was me and I was he\nWe'd probably still be dancing\nMami can you feel me?\nStill she said nothing\nWhy she be fronting?\nNever seen another mami move like you\nGroove like you\nI'm saying I wanna dance with you\nWhat's up?\n\nRepeat 1\n\nTo me when I'm dancing it's aphrodisiatic\nIt's automatic that I look in your eyes to help fantasize\nSome people dance socially not emotionally\nCloser to me, come on close as you can be\n(Can you feel me?)\nCome on mama cut me no slack\n(Can you feel me?)\nCome on mama forward and back\n(Can you feel me?)\nCome on mama as hard as you can\nIt's part of the plan\nIt happens when you start with the man\nOn your mark, ready set, baby let's go\nBaby let's flow, baby let go\nBaby no, no, gotta a lot more\nLettin' it rip, gimme some of that\n*girl yells*\nYeah that's it\nSweatin' with me, getting it wetter with me\nIt's better with me\nGain it, other girls I dated ain't famous\nSo take it or leave it\nJust the way that I eat it\nI bring, I swing it\nSo you like that?\nTell me what's up\n\nRepeat 1 till end", "image": "https://images.genius.com/6d35ec81cf7a17dcc359661f467d19b0.899x899x1.jpg", "album": "Willennium", "title": "La Fiesta"}]}