{"artist": "​​wifisfuneral", "songs": [{"year": "2015-01-12", "lyrics": "[Verse 1]\nOh yes I love her like the sweetest\nTaboo since a fetus, I witnessed the genius\nI feel like were connected when dreaming\nMy moon goddess as wet as Poseidon when she’s gliding through my fantasies\nI could mold her, but never control her\nForever hearing her voice over my shoulders\nFeeling boulders in my conscious\nSteady rocking to my own beat\nShorty introduced me to hypnosis when scoping her figure\nIf you the canvas I’m painting pictures like who you kidding?\nFiguring riddles just to get in the middle of your mixture\nPerfect colors when blending\nSee from my personal preferences a angel touched you from heaven\nCatching myself from half stepping, but I just fall since I’m reckless\nIts like domino effect how I’m stretching\nSee, But I’m just crawling, falling in hell\nToo obsessive over yo frame, and quite frankly, I don't care\nPleading that you help me well, stop and stare\nWitness how I’m under yo spell, Ms. Jazzy Belle\n\n[Verse 2]\nOh yes I love her like the oxygen that I breathe\nLove her like lovers that would love each other when its eye that they see\nMouth to mouth when they speak, soul to soul when they meet\nIts temporary for you, yet everlasting to me\nI’m tryna stretch you out like elastic, you acting as if I’m lacking\nBeen practicing for this moment in my mirror\nI fuck up my script and my posture whenever I’m near ya\nHope you hear me when I love more then I fear\nText message was deadly, I’m ready to die by yo side when I ride\nJazzy, Jazzy, oh Jazzy, heard you leaving and now you happy\nMy sunflower never grows since my sun isn’t active\nUs again could never happen\nYou, you're just a memory, lost in my satisfaction\nAnd me? I’m just craving, bathing in your desires\nNever the type to fall head of heels if around my neck there's a wire\nCigarettes burning, hoping they calm me down\nI’m out of tune, feeling never well\nWitness how I’m under yo spell, Ms. Jazzy Belle\n\n[Outro: André 3000]\nOh yes I love her like Egyptian\nWant a description? My royal highness\nSo many plusses when I bust that there can’t be no minus\nWent from yelling crickets and crows\nBitches and hoes to queen thangs\nOver the years I been up on my toes and yes I seen thangs\nLike Kilroy, chill boy because them folks might think you soft\nTalking like that, man, fuck them niggas, I’m going off\nAnd coming right back like boomerangs when you throw 'em...", "image": "https://images.genius.com/8a6459edf531c32e841bf0edb981ef34.535x535x1.png", "album": null, "title": "Jezebel"}]}