{"songs": [{"lyrics": "[Intro Sample]\nCheckmate sucka, not a move, game's over!\n\n[Hook]\nWho's that walking with a hole in his head?\nBig bad Bazooka Tooth, I came to break bread\nWhat's a troop's recipe for treacherous times?\nI tell 'em... ah, fuck it, yo!\n\n[Verse 1]\nI pull the elephant tranq out of my neck\nGaffle a tank, count up the chips, wrastle the fangs off of my fist\nFlood a little soldier blood over the ogre acres\nOn some holiday in Cambodia with motor-home appraisers\nPagans fade into the Kodachrome - now, later\nWith a lid to brow staple\nRevisit the cobra loading zone\nMolar foaming, but he hold his own wound\nCauterized, by the Zippo he had stole that afternoon\nAnd my dog tags jingle by the monster island heart he built\nGrew up with a jughead crown tilt and tardy slip\n\"Be all you can be\" just never soothed us (Nope!)\nYou lost me in that part about scrubbing piss with a toothbrush\nHoller scum's lullaby\nLive from the ultra-fly, sham city bunker\nWhere the coldest cults multiply alarmingly\nHush little baby, timeout!\nThe black market mockingbirds can not sing a lick\nBut learn to peck your eyes out\nOf commission with love, out a tradition of wraiths\nPick on the visions that buzz, bet on the kitten's escape\nSolder the piston to pump - out a veteran amplifier\nAnd magnify through the same lens that set the ants on fire\nFlush the moppet hootenanny\nWho could fancy, honor circuit when the circle's every duke is clammy?\nTrooper, scoop the food in pantry\nAnte up, stupid!\nMay delusion feed em foofi candy\nAnd pry the gold out of his tooth when lamping\nPocket all you can now\nBlock' will lead the lambs down\nTo the cold cutlery outfit, slaughter beef and cow tip\nPour the chief some fountain soda, motor prone to pen the holy opus\nAnd pry this monkey off the Scoliosis like\n\n[Hook]\nWho's that walking with a hole in his head?\nBazooka Tooth, gemini, I came to break bread\nWhat's a troop's recipe for treacherous times?\nI tell 'em fast cars, danger, fire and knives, let's go\nFast cars, danger, fire and knives\nFast cars, danger, fire and knives\nFast cars, danger, fire and knives\nI got her majesty Athena riding shotty wide-eyed\n\n[Verse 2]\nIt's like never mind the bullocks\nFuck, like every other week these hipster tabloids\nJumping on and off my Sex Pistol's bullets\nLike every other week he spins the bottle\nLike every other week these fucking fanzines forget if they spit or swallow\nToo bad your inner sheep never forgets to follow\nCause my inner greed to feed your hate for loving us is hostile\nFortunate for me, it coincides with what comes natural\nSo the mongrels that I run with turn the \"fuck you's\" into fast food\nLike a little freak sick of the 3 o'clock bully knuckle dust\nNursing his last shiner, finds the shoebox in his mother's truck (uh-oh)\nTomorrow's extra curricular punching bag\nWill finger daddy's widow maker out a brown lunch bag (bang)\nThis is where the hunch back snake oil peddlers\nStuck under the burgundy sky of spaghetti westerns\nTend to bubble up, weathermen huddle up\nToday, the son of one too many \"yes sir's\"\nKings his checkers, watch the double jump\nBack with a platter of hot leeches that'll drink up-every bloody drop down\nTo the last diseases, it's A-E-S-O-P-R-O-C-K, the peak twister\nDefender of the son of Vaughn Bode's Cheech Wizard\nI used to pray the treatments got easier with my aging\nLike Serotonin weekends was merely comedic hazing\nWrong, but along his travels located the key to world peace:\nKill every motherfucker but me\nYou cool with that? Cool, bang\nYou? Cool, hang\nYou? No? Uh..bang? Cool\nSorry, dog, rules is rules\nAnd too long have I followed yours\nI'm trying to get them years back\nAnd walk through every Cypher with dynamite in a beer hat\n\n[Hook]\nWho's that walking with a hole in his head?\nBazooka Tooth Krueger, I came to break bread\nWhat's a troop's recipe for treacherous times?\nI tell 'em fast cars, danger, fire and knives, let's go\nFast cars, danger, fire and knives\nFast cars, danger, fire and knives\nFast cars, danger, fire and knives\nI got her majesty Athena riding shotty wide-eyed", "title": "Fast Cars", "album": "Fast Cars, Danger, Fire, and Knives", "image": "https://images.genius.com/2434fa81c5b8e4d6767c0b655d69bd1b.498x500x1.jpg", "year": "2005-02-22"}], "artist": "Aesop Rock"}