{"artist": "E-40", "songs": [{"title": "$999,999 + $1 = A Mealticket", "image": "https://images.genius.com/a5f1f8095418f1fd91f86ca97ac169c0.1000x1000x1.jpg", "album": "The Element of Surprise", "year": "1998-08-11", "lyrics": "[E-40]\nHuh? Want me to speak the real?\n\n[Kaveo]\nSpeak the real man\n\n[E-40]\nNigga speak the real\nSpeak the real\nSpeak the real\nSpeak the real\nSpeak the real\n\nIt's a quarter after nine on my AM FM\nRadio Shack digital motel six o' clock alarm reads\n\"40, get your ass up, time to hit the grind\nYou can't afford to pass no money I know you heard about that\"\nWhat, what? \"Task raided Millersville Ms. Miller had a heart attack\"\nDude, that's some cold shit, ain't it huh?\nI know, she was a good person for certain I know\nV-Town, California where I was born, raised and grown\nAnd since 1979 I been a hustler on the go\nYou know the drill, my mission for real, a mealticket\nYou feel, we slowly but surely approachin seven digits\nFigurines, sticky doo-hicky and angel dust\nMescaline, niggas know better than fuck with us\nI'm pimped out flossin in Reno in the casino\nBig bid, fuckin off feddie I could've put down on a crib\nI does that, I do, rejuvenate, redeem\nTake a lose, take a lose\nDon't make a scene\nNigga charge it to the triple beam\nFuck the stress\nI let that orange box of baking soda do the rest\nHoller at my neighborhood chef, Raul\nKnown for cloning chickens and turning one into two\nThat's all he do for a living\nThat's all he's used to\nPlaytex rubber dishwashing gloves and residue, Biotch!!!!\n\n(Hook)\n[Kaveo]\nBullshit ain't nothin\nYou see we gone keep this thuggin\nAnd mean muggin jump until it's a done deal\nYou see E-40 and Sick Wid It bring the real nothin but\nWhat if I bring this back down?\nYou gots to be about it or be without it\n\n[E-40]\nBe about it or without it\nAy, you know what? I smell you on that playboy, look\nWe fin to run down a a whole tac on these bitch ass niggas\nNiggas ain't smellin this shit\nWe do this shit\n\nLast night I slapped a bitch upside her dome\nWith my faulty phone\nThat heifer's tired\nShe tried to slash my tire\nCaught me in the bed with her cousin Tanji\nFrom the track\nShe use to hold my sack\nI use to dick her down way back in 86\nShe use to look just like a skank\nBut now that bitch got a ass, tits, body and boy that bich is bad\nFor what it's worth, the pussy smelled like Certs\nVictoria's Secret\nNow folks just remember I never said I thought about lickin pussy\nI said I never thought about eatin\nKeepin it and treatin it nice\nFuck that I'm a hog\nI put it down, I'm from the hood\nWhere I live, on the outskirts\nAnd down on the tuck in the cut\nIn Clemente Apartments man\nI'm a baller so you know I ain't got shit in my name\nI'm strictly ghetto celebrity, niggas get buried\nReady for combat if you plottin and plannin\nOh if you come for me and confiscate my dough\nLet the buzzer be the bail\nBut my suggestion is to stay within your envelope\nI'm block to block, swingin on vines\nCommunity service, put up stop signs\n\n(Hook)\n\n[Kaveo]\nUhhh!!! Hold the fuck on!!\nDid you or did you not tell these niggas to stay within they envelope?\nSheeit, these toddlers are green to the game\nThey ain't know nothin about these tramps\nSix bedroom flats and gettin dealt and held a hand across the mat\nYou see we from the Yay where we control they minds\nAnd put these hoes on the grind\n\n[E-40]\nAin't got to but I still touch it\nWent to the Seven Eleven picked up a traders book and bought a bucket\nUse to have a perm taller than the Charlotte Hornets\nBut I had to cut that bitch off cause see your patna had warrant\nThat I ain't even handled yet although I'm havin cake\nThe little homie from the hood want me to put out his tape\nHe kinda tight too, remind me of The Click crew\nCause they was spittin that old high powered\nGodzilla ballin guru ass type shit you\nCan relate to, wake to, 'scape to when it's sunny\nRide by, slide by, get at a honey\nI know these streets like I know my dick\nI can tell you who the nigga is that's about to get jacked\nAnd the nigga that pulled the lick\nI got this bitch on lock\n999,999 plus a dollar in a safe deposit box\nMarijuana crops still in this roster\nKilogram, coca leaf and morphien\nWhat about my niggas in the 4-1-5\nLook what they made\nMy niggas in the city\nThey call it made\nTop grade regeneration, uncut\nDesigner weed, straight hempilation, what the fuck\n\nSheit, sheit, sheit, sheit, sheit, sheit sheit, sheit...\nHell yeah, sheit!!\n999,999 plus a dollar, plus a dollar man\nPlus a dollar, plus a dollar man equals a mealticket bitch\nBiotch!!!\nSheit! Sheit!"}]}