{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/ddb74dfab0d2ccdc33403725587ccf5f.1000x1000x1.jpg", "title": "La Piñata", "year": "2012-01-01", "album": "51", "lyrics": "[Intro: Mister Rogers]\nAnd you know, you can do many things that grown-ups can't do anymore. For one thing, you can pretend you're all grown up and then when you've finished pretending, you can be just the way you are\n\n[Verse: Kool A.D.]\nKool A.D., habitual script flipper\nThe lip zipper, the big fisher\nThe fish getter, the wish giver, the inserter\nThe do you really want to be\n\n[Mister Rogers]\nJust the way you are\n\n[Kool A.D.]\nKool A.D. the Dum Shiny\nCome find me, young Hi-C commercial\nI circle like sharks while y'all panic, I work magic\nYou probably wouldn't understand it\nThe kid go, think fast, live slow\nHella Urkels, win slow\nBut I still win, though, Every wall a window\nEvery window a wall, though, I'm Waldo\nCome find me, Dum Shiny\nAin't nobody really\n\n[Mister Rogers]\nJust the way you are\n\n[Kool A.D.]\nReally, though, Kool A.D., pay me, Big Baby\nAmaze 88 on the beat\n3 Feet High and Rising\nCheat sheet, see why I'm smiling\nStyling, a wild king, a lion\n\n[Mister Rogers]\nJust the way you are\n\n[Kool A.D.]\nA tiger, et cetera, F. Gary Gray, Set It Off\nY'all hecka soft, all human flesh is soft\nI drop megaton bombs more faster thank you blink though\nWhat the fuck is up chico man I'm Rico Suave, ya tu sabe\nJewish Eddie Murphy in your barbershop, Jewish Mel Gibson\nBlack Tintin, black Bart Simpson, half-black Bill Clinton\nHalf this half that, 50 cups of coffee and you know its\nJust the way you are\n\n[Mister Rogers]\nJust the way you are\n\n[Kool A.D.]\nExactly\nI'm Drake versus Common; who cares\nWhen the elevator breaks, I do stairs\nI'm new here, 2012, wait, 2013, a new year, what you want to do here\nLamp on the couch, smoke weed, drink two beer\nYeah, me too, y'all know how we do\nYoung Black Hebrew scriptures\nVictor, the channel flipper, the camera picture\nYo, y'all banana sniffers, maybe Hitlers\nAiming guns in all my baby pictures"}]}