{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/9546441ab467d0ff8079eccdfb824801.500x500x1.jpg", "title": "Get Mine", "year": "2011-10-10", "album": "Wheels Up", "lyrics": "[Verse 1: Kid Ink]\nUh, first off, eat a dick, try to tell me I ain't work hard\nWhere I'm from yeah, I could be worse off, life is a bitch, it was her loss\nBut I made it through the pain like a tattoo, turned me to a young nigga with an attitude\nWhat it do? Ain't shit changed, west side, you know the fucking name\nIt’s Kid Ink baby, came real far, back then yeah they used to call me rock star\nI'm still a rock star, 2 fingers up, like one just ain't enough, ah\nUh fuck the world now we making love, been doing this shit you niggas making up\nFast life full shift, never breaking up, I got bars nigga, never breaking up, you hear me?\n\n[Chorus: Kid Ink]\nYeah we came a long way from nothing\nMade it through it all so it must be something\nBetter get ready, tell them we coming\nNever back down, even when they all fronting\nI gotta get mine\nGet it go, get it go, get it go go\nI gotta get mine\nGet it go, get it go, get it go go\n\n[Verse 2: Kid Ink]\nYeah, cause they ain't gon' give it to me, take shots but they ain't sending to me\nWant something done right better do it nigga, on the wild ride with a bunch of fluids in us\nBeen letting nigga slide like a playground, anyone wanna tell them there’s enough to go around\nYeah, it’s going down, beef ain't nothing but a quarter pound, ah\nAnd I'm ill, cancer, gon' bust a move like a soul train dancer\nYeah I'm on they heads, antlers, can you feel the fire, campers?\nYou already know who I roll with, Alumni, Bat Gang, better get focus\nUh they all looking hopeless, just tell them you can hold this\n\n[Chorus]\nYeah we came a long way from nothing\nMade it through it all so it must be something\nBetter get ready, tell them we coming\nNever back down, even when they all fronting\nI gotta get mine\nGet it go, get it go, get it go go\nI gotta get mine\nGet it go, get it go, get it go go\n\n[Verse 3: Nipsey Hussle]\nBelieve that, I'mma need that, please no opinions if I ain't ask for your feedback\nLook, nigga, we that Stevie Wonder can see that, all of these shows sell out, and all of my hoes to see that\nWait, niggas relax, I'm in the son, B-act but take it before they miss us, we back real\nNigga respect anywhere that we be at still, niggas special when reach the level we at kill\nJealous niggas  catch the case but we gonna beat that still, cash rules everything that nigga we got bills\nMy seat back, Dickie pockets with G' stacks, play with me wrong, I promise you get lead too fast\nYeah I sing that, said that we achieved that, built the shit out from nothing now\nBaling my reflex nigga, where you came at? Baby yeah where'd you be at?\nWe killing competition, no condolence, get the Kleenex on\nPissing on pots at the repass\nFull time grind no recess\nExpensive ass pussy if I need that\nBaby suck it so good, I'm like \"Damn, where your teeth at?\"\n\n[Chorus]\nYeah we came a long way from nothing\nMade it through it all so it must be something\nBetter get ready, tell them we coming\nNever back down, even when they all fronting\nI gotta get mine\nGet it go, get it go, get it go go\nI gotta get mine\nGet it go, get it go, get it go go"}]}