{"songs": [{"year": "2010-01-01", "title": "16 Years", "image": "https://images.genius.com/124ced80167d056671039400238da2c2.220x220x1.jpg", "lyrics": "The sun flies through the sky leaves darkness in it's wake\nAnd now I hear the hellhounds barking at the gate\nTo be honest sometimes I want you to relate\nThis ain't up for discussion it's not a topic for debate\nEntrepeneurs that want to bottle up the hate\nAnd slap a label on the glass so hard that it'll break\nAnd if you break it you buy it and we sold it by the case\nIt's ok if you just try it you can hold it to your face\n\nHow close can you get without touching it?\nHow far removed can you get from the public?\nCan you keep a secret?\nIf not, can you tie a slipknot?\nCan you stand high up on this brick block?\nListen to the clock tick tock and switch gears\nIt's been one, two, three, four, five, six years\n\nAre they all dancing now? Are you joining the party?\nAre just celebrating your life just by destroying your body?\nIt's a part of your psyche that I want to sight-see\nI don't need you as a tour guide and I don't want you to like me\nI was voted least likely\nThat's it just least likely\nSo pardon me if I seem fiesty\nBite my tongue like a bullet, take a pull from the peace pipe\nPush past the low expectations of me each night\nI leave light in my wake and I moonwalk across the floor\nUntil I hear the sex kittens all purring at the door\nThere's something outside that we all want\nBut inside there's an ex who marks a soft spot\nTill it rots and decays and then no one else cares\nIt's been seven, eight, nine, ten, eleven, twelve years\n\nNow I sell pennies to the well-wishers\nI fish through the coinslots\nI fall through a girl's bait participate in boycotts\nI demonstrate a demon's trade\nWith a face void of thoughts\nIf that don't launch a thousand ships\nThan that's a helen of troy's loss\nThere's nothing in this horse\nIt's hollow, it's empty, its entry will not be forced\nLike an eyesocket stripped clean of tears\nIt's been thirteen, fourteen, fifteen, sixteen years", "album": "LI(F)E"}], "artist": "Sage Francis"}