{"songs": [{"year": "2008-05-13", "album": "Puff Puff Pass", "image": "https://images.genius.com/29a1b3d4dc2e263b0658dbe35538a01f.500x500x1.jpg", "title": "No Matter Where You Be", "lyrics": "[Hook: Jaz]\nNo matter where you be\nThe Streets gonna test\nSlugs in your chest\nNo matter where you rest\nBetter step back\nCause we be the best, yeah\n\n[Verse 1: Keith Murray]\nYo, niggas talking reckless cause they think they could\nMeanwhile, killers is lurking in your hood\nNiggas go to jail, and be dying left to right\nMeanwhile, yall promoting bullshit on the mic\nThe wages are war, your cross means death\nAnd we gon’ keep banging, till none of us left\nI’ve done grew up with some too many real niggas that passed\nAnd let you cross my path, and knife get up in yo ass\nI see my first body ? future\nWhere I first bare to witness what the gats do to ya\nNiggas yelling static, getting outta place\nMeanwhile, Doolam with a hole in his face\nYou can’t live forever, sometimes you gotta go\nBut Where? When? And How? Only we know\nHe just got about the system, when ?\nNow ? I was just with em’\n(You fucking with the best, boy)\n\n[Hook: Jaz]\nNo matter where you be\nThe Streets gonna test\nSlugs in your chest\nNo matter where you rest\nBetter step back\nCause we be the best, yeah\n\n[Verse 2: Keith Murray]\nMy pops passed in ’85 and my moms ‘91\nEver since then, I’ve been in the streets on the run\nYou come into this world alone and you leave alone\nBut somebody coming with me, cause I keep the chrome\nI roll with Def Squad and Legion of Doom\nBut you can feel the devil, when he’s inside the room\nIts like only happens to real terror ones\nMeanwhile, you cowords still alive and you having your fun\nThey say, karma is when you get exact energy back\nA lotta good dudes pass, where the karma in that\nAnd faggots is looking for some type of directions\nMeanwhile, my squad is taking the section\n25-to-life or few to the head\nAnyway you look at it, both these niggas dead\nMy all day, forte is plotting to scheme it\nEven when I’m dreaming, I be chasing demons\n(You fucking with the best, boy)\n\n[Hook: Jaz]\nNo matter where you be\nThe Streets gonna test\nSlugs in your chest\nNo matter where you rest\nBetter step back\nCause we be the best, yeah\n(Happen Just That Fast)\n\n[Verse 3: Keith Murray]\nI trying to cherish these small things I get in life\nCause' you can wake up in the morning and be dead daylight\nMan, drink to my memories, fuck the sorrow\nCause you too, can be in today and gone tomorrow\nMe and 50 Grand was walking by Quad studios, where Pac' got hit up\nBut that ain't when he died though\nSince the lil nigga, running from the scene outta breath\nAlways seem to come up close brush with death\nNo stranger, I lost like 10 over the years\nAnd thats not count of like 50 of my peers\nSo you can try to deceive the masses with lies\nBut telling the truth nigga, do you wanna die?\n(You fucking with the best, boy)\n\n[Hook: Jaz]\nNo matter where you be\nThe Streets gonna test\nSlugs in your chest\nNo matter where you rest\nBetter step back\nCause we be the best, yeah"}], "artist": "Keith Murray"}