{"artist": "Yung Bans", "songs": [{"album": null, "image": "https://images.genius.com/1619d7c45afa971698ca9b09a99342b1.640x640x1.jpg", "year": "2019-04-26", "lyrics": "[Intro]\nPooh, you a fool for this\nYeah\nOh Lord, Jetson made another one\nAyy, yeah\nYeah, yeah\n\n[Chorus]\nShe wanna lick, lick, lick, lick, lick, lick\nWanna lick all on this dick (Yeah)\nLook at this Rollie on my wrist, wrist\nIt don't tick, tick, tick, tick, tick (Tick)\nAnd I know they gettin' money\nBut they ain't gettin' to it like this (To it like this)\nKill a nigga whole gang\nBut we ain't tryna go to prison\nThey want that old Bans back\nThey want me on that dumb shit\nHow the fuck I catch a murder?\nI ain't even touch the nigga\nYeah, I got murder on my mind\nYeah, I got murder on my mind\nI got murder on my mind\nThis time got murder on my mind\n\n[Verse 1]\nI feel like Hercu-, Hercu-, Hercules\nNiggas wanna murder me\nDemons in my ear, they talkin' to me, sound like Turtle Beach\nHavin' good steak, young niggas, know they've heard of me\nTake a nigga main, she wanna fuck me for a Birkin, please\nAll my shoes say double C's\nI was just broke with nothin' to eat\nCatch 'em down bad, pop top\nPow, watch 'em bleed\nGettin' to the guap, I'm with this lil' hoe, she on lock (Yeah)\nWhen I was on the block I had the dope all in my sock (Yeah)\n\n[Bridge]\nStraight out the jungle (Oh, ah)\nReady to rumble (Yeah)\nThe chopper snub him (Yeah)\nPull out and rub him (Ooh)\n\n[Verse 2]\nLong live T-Money, he was shooting at the police, shit\nAll my niggas hurt, though they really on that greedy shit\nFuck this bitch, I send her home\nReally, I don't need a bitch\nAll she want is money, I got plenty, I'll spend it quick\nWhere these hoes was at when I was out here down bad on my dick?\nHundred thousand on my wrist\nVVS's, watch they drip\nAll my niggas killers, and they with it, I can't let 'em slip\nGo ahead, choose your side\nYou really with me, gotta take your pick\nFoh, foh, foh, nigga, you hear that\nOnly got one life, you can't get back\nBetter stop flexing like you gangsta, know you ain't near that\nWe gon' leave your ass stanking, we the shit bag (Woo woo)\n\n[Chorus]\nShe wanna lick, lick, lick, lick, lick, lick\nWanna lick all on this dick (Let's go)\nLook at this Rollie on my wrist, wrist\nIt don't tick, tick, tick, tick, tick (Yeah)\nAnd I know they gettin' money\nBut they ain't gettin' to it like this (To it like this)\nKill a nigga whole gang\nBut we ain't try'na go to prison\nThey want that old Bans back\nThey want me on that dumb shit (On that dumb shit)\nHow the fuck I catch a murder?\nI ain't even touch the nigga\nYeah, I got murder on my mind\nYeah, I got murder on my mind\nI got murder on my mind\nThis time got murder on my mind", "title": "TIK TIK TIK"}]}