{"songs": [{"year": null, "title": "The Corner", "image": "https://images.genius.com/e419c674f3606427aa03bb9748a8b873.360x360x1.jpg", "lyrics": "[Intro: Saigon]\nMark Ron.  Saigon.  Paint the windows black.  It’s over now\n\n[Verse 1: Saigon]\nFinally home from up\nNorth, shit.  Already, talk leaking through the faucet\n‘Cause I ain’t slinging horse shit, they think that I’m on some soft shit\nWhatever, God.  I’ma work hard to find me a job\nIf that don’t work, let them be the first jerks that I rob\nBut no, I’m trying change it around.  Tired of being\nChained to the ground.  From Africa, we came with a crown\nWhen you’re locked down, your mind frame remaining in town\nYou hardly ever had nightmares of getting slain on the Nile\nFast as they released me, I done turned out my man who want\nTo piece me with a key, see, to flip it whenev’ it easy\nBut now I’m job hunting, feeling the more aggravation\nKnowing when they seen “Convicted,” they tore the application\nThey probably placed it in the wastebin while I’m at the crib\nPacing, waiting impatient for a call they ain’t making\nAnd if I baked a cake, then my momma be stressing honesty\nHere and now like, “Honey, what happens ain’t what you promised me”\n“Mommy, honestly, look: I got strikes first.  With a nigga, second\nThey think I was living hectic ‘cause I got a prison record\nYou think they believe I did dirt but was disinfected?\nNo, they just neglect to tell me if I come in there, I was misdirected”\n\n[Hook: [?] with Background Vocals by Saigon]\nFrom the\nStreet corner to the jail cell block\nLost souls, crack fiends, and crooked cops\nCrime sprees, cheap wine, trees, and drug spots\nThey say it’s all good when it’s really all not\nSomeone is crying.  I feel your pain\nSwallow your tears and call out my name\nA lifetime of sorrow gets burned in the flame\nThe sun comes tomorrow to chase away the rain\n\n[Verse 2: Saigon]\nYo, how\nCouldn’t I serve fiends?  There was fifty-six in my building\nI even hit the souper with something for fixing our ceiling\nI was the only kid at thirteen out at four in the morning\nNiggas was in their mirrors, I was on the corner yawning\nRunning with kids that was wanted—murder ones and beyond.  The\nPolice reacting off any info the informants respond with\n(There was I), captivated by garments, Rugers with the\nChrome compartments, teenagers with keys to their own apartments\nYoung king, my corner park bench.  Sold this nigga Drab\n50 slabs.  Just got out his sixth rehab.  The fuck\nDid I care?  The hell of a hole in his cerebellum come\nDummy wanna smoke jumbs?  Dammit, I’m selling him some\nThat was my attitude after that street life molested me\nListen so you can see how shit indirectly affected me\nSame nigga Drab who I told you I sold them slabs to\nNeeded more to maintain and was down to do what he had to\nWalked up on this old lady, put his hand in his pocket and told her\n“Give me the purse!” She screamed, hoping the coppers would roll up\nHe grabbed the purse, which was strapped to her opposite shoulder\nShe hit her head and leg when she fell, but her noggin was swoller\nBefore anyone could stop to console her, Drab was showing me\nWhat he got in his hold-up.  Noticed my mother wallet—hold up!\nMy brain blanked, swore before God.  Looked to see\nOne of my old report cards splattered, drabbled over the courtyard\nNo, my ma never recovered from my backless war\nFractured skull.  Said she might walk again, but they ain’t sure\nDrab moms still wanted relentlessly.  When they sentenced\nMe, she requested that I get no less than infinity\nAll of this is fiction, but just as well could’ve been real\nWhat they call killing four patients with one pill and it’s\nIll, but it’s real\nAnd it’s ill, but it’s real, and it’s ill, but it’s real\n\n[Hook: [?] with Background Vocals by Saigon] (x2)\nFrom the\nStreet corner to the jail cell block\nLost souls, crack fiends, and crooked cops\nCrime sprees, cheap wine, trees, and drug spots\nThey say it’s all good when it’s really all not\nSomeone is crying.  I feel your pain\nSwallow your tears and call out my name\nA lifetime of sorrow gets burned in the flame\nThe sun comes tomorrow to chase away the rain", "album": "The Best of Saigon A.K.A. The Yardfather Vol. 1"}], "artist": "Saigon"}