{"artist": "Pharoahe Monch", "songs": [{"album": null, "title": "Yayo", "image": "https://images.genius.com/4c25d91d2559c6f7b2476ec5c1c16437.384x384x1.jpg", "lyrics": "[Verse 1]\nMelodic embargo, please you know what’s in the cargo\nI ship keys my nigga never eat escargot\nKey a cops car cop keys in Key Largo\nQueens get cheese we don’t bang\nY’all niggas get caught with the keys and all sing\nSinging ass niggas be out of key, you can’t hang\nThe whole key to why shits fucked up in the game now\nYou’re lame, ya'll get your lyrics from Narcos\nFabulously fabricated crime fantasy Fargo\nGod bodies behind bars y’all see the bar code\nIn the 80’s we used to put a little bit in a Marlboro (Keys)\nSkinny ones, fat ones, tall ones, short ones, white ones, black ones\nTurned perfectly brand new ivory keys into cracked ones\nThe reason these crack babies can't rap and they act dumb\nNow everybody turn up don’t front\nDon’t sleep, Let’s eat, Get live, Get crunk\nHow’s about some hardcore?\nYeah we like it! Yeah we like it raw!\nGet money turn a 20 dollar bill into a straw\nAnd just do it! Just do it! Just do it, do it, do it, do it!\nJust!\n\n[Chorus]\nYay yo\nYay yo\nYay yo\nYay yo\n\n[Verse 2]\nNext to blow, connect get it through Mexico\nInstagram shoot yourself, Plaxico\nReduce molecules pass thru Trumps wall with the bass line\nThen I’ll inbounds the ball\nSo nice with the rock that your head might swirl\nI’m in the bathroom doing the bump with that white girl\nLines make black chicks bone strangers\nThe white horse in a hotel room the Lone Ranger (Sniff)\nAnd they try to remain sober\nBut the hangover got them hanging over the roof on the top of a Las Vegas hotel like The Hangover\nSmack, heroin, pcp\nI had digital dope before Smack DVD’s\nOriginal Coke before it was Less Than Zero\nHigh like Pacino, Fly like De Niro\nBenicio del Toro etc\nMaria Full Of Grace on a flight to Kill The Messenger\nCocaine Cowboy\nSwerving with that bird in a black suburban merging in Irving Texas, texting serving Michael Irving\nCocaine Cowboy\n\n[Chorus]\nYay yo\nYay yo\nYay yo\nYay yo\nYay yo\nYay yo\nYay yo\nYay yo\n\n(You are now rocking with the best...scratch sample)", "year": "2019-01-04"}]}