{"artist": "Fabolous", "songs": [{"year": "2012-11-07", "album": "The Soul Tape 2", "image": "https://images.genius.com/82b1f5651f6eeea592ec747fc3987f89.968x968x1.jpg", "lyrics": "[Intro]\nWould you do it for the love?\nWould you do it for the love?\n\n[Verse 1]\nCould've left a long time ago, fuck it where I’ma go?\nA brother back in the house couldn’t let Obama go\nDo it cause you love it nigga, advice from my momma go\nThose that just follow green, be the first kind to go\nBeing broke ain’t a joke, I’m too comical\nSeven digits nigga, 2 commas ho\nMake your first million and don’t make it your last\nDon’t come if you ain’t ready, don’t try to make it too fast\nYou can’t learn shit, if you never make it to class\nYou can’t just recycle what should be placed in the trash\nI started wanted more money, and a Stacey dash\nA car that cost a house and a place to crash\nPull the hammer like a camera; you don’t wanna face the flash\nCause you’ll lose one of your sons and it’s no replacing Nash\nBet the faces you show be the same faces you stash\nThere’s more where that came from, y'all know where I came from\nIt’s all about that boy that call me papi\nSo I’m a keep making that paper copy\nYou squares could never stop me, that triangles to play me\nTwo lines for you fuck boys, now pause that, play me\nRight from where I left off that, let’s get back to that real shit\nThat sit back just chill shit. With packs of that kill shit\nI chit chat bout trill shit, spit that hot feel shit\nI give you four bars it’ll be a Kit Kat of some real shit\nWho fucking with me? I mean besides your bitch\nI Deebo your ho, you niggas should hide your bitch\nLike the chain red’s grandmomma gave him\nI got a thing for women, I like them misbehaving\nYou know like bad, mike bad\nSo I’ma check’em when I see’em Nik(e) AD\nCause in this life things come and go like fads\nAnd I’m not one who favors using words like had\nI’m into having shit, turning dreams to average shit\nBring your trophy to the club, Dallas Maverick shit\nNiceeee\nI came from first of the month money\nTo waking up whenever I want money\nNiceee\nI chase paper, I hunt money\nMake 50 racks at 3pm and call it lunch money\nNiceeee\nNigga ya stunt money is blunt money\nYour boo only got a text back once from me\nAnd that was “What the fuck you want from me?”\nBut I know what the fuck she want from me, yeah\n\n[Bridge]\nYou ain’t gotta front for me\nI know, I know what you want from me\nI know, I know we all want the money\nIt’s only right we getting to it\nQuestion I come to you with is...\n\n[Hook]\nWould you do it for the love?\nWould you do it for the love?\nWould you do it for the love?\nWould you do it for the love?\nWould you do it for the love?\nWould you do it for the love?\nWould you do it for the love?\nWould you do it for the love?", "title": "For the Love"}]}