{"artist": "Kid Ink", "songs": [{"image": "https://images.rapgenius.com/64ef0971c497329fa37a86cf6c5550bf.500x500x1.jpg", "title": "Fuck Sleep", "year": null, "album": "Almost Home", "lyrics": "[Intro: Rico Love]\nBet you ain't know, you ain't know\nWhen you dozed off, I was gettin' money\nYeah, I was gettin' money nigga\nFuck sleep, so fuck sleep\nFuck sleep, gettin' it\n(Turn the lights on)\n\n[Verse 1: Kid Ink]\nUh, eyes wide open\nWe've been up all night, I ain't even notice, fuck sleep\nYou know the money is the motive\nTo the morning, I be hungry every moment, man a nigga gotta eat\nCookin' up, no pyrex, if's IMAX my weight up\nYou could check my biceps\nI'm puttin' for on my team, holdin' me down like Maurice\nI ain't in no hurry, to ain't got no worries\nSo, ain't no rest for me now\nLook around and I got mo' bills than Destiny's Child\nEverywhere that I go, you should know the motto\n\"My time is my money\" and I always need mo'\n\n[Hook: Kid Ink & Rico Love]\nSo fuck sleep\nCause I got a lot of bills, and nobody gon' pay 'em, but me\nI keep my mind on my money, nigga I don't love these hoes\nFuck sleep!\nUhh, you could chill, when I stack these bills\nWhy you think these bitches love me?\nFuck sleep\nBet you ain't know, you ain't know\nWhen you dozed off, I was gettin' money\nSo fuck sleep, fuck sleep\n(Turn the lights on)\n\n[Verse 2: Kid Ink]\nI got her legs wide open\nLate night, undercover freaks so you know it's no sheets\nThen it's back to the work, fuck first and then the fifthteenth\nI'm tryna get pay day erry'week\nAnd it's tha only way to be, work hard, cause I need soft leather on the seat\nSee the money all the top, and the only thing I breathe\nIs that California Kush, God blessed me like a sneeze\nI gotta keep it real, but I'm livin' in a dream\nIf you made it from the bottom, then you just know what I mean\nEverything on the other side ain't always what it seems\nBut I heard that there's some green, so I gotta go and see\n\n[Hook: Kid Ink & Rico Love]\nSo fuck sleep\nCause I got a lot of bills, and nobody gon' pay 'em, but me\nI keep my mind on my money, nigga I don't love these hoes\nFuck sleep!\nUhh, you could chill, when I stack these bills\nWhy you think these bitches love me?\nFuck sleep\nBet you ain't know, you ain't know\nWhen you dozed off, I was gettin' money\nSo fuck sleep, fuck sleep\n(Turn the lights on)\n\n[Verse 3: Rico Love]\nIn the matter of the week, I make two hunnits G's\nFake niggas takin' breaks, real niggas gotta eat\nI told my nigga, Jah, when you get back on the streets\nI'mma drop a bag on 'em, put a Maybach on his feet\nMake millions off of beats and the melodies are sweet\nI keep my shades on cause I ain't slumbered in weeks\nI'm dippin' down a freak, I'm bustin' off like: \"Blocka, blocka!\"\nAnd sleep, I don't need nada, champagne is my Viagra\n\n[Hook: Kid Ink & Rico Love]\nSo fuck sleep\nCause I got a lot of bills, and nobody gon' pay 'em, but me\nI keep my mind on my money, nigga I don't love these hoes\nFuck sleep!\nUhh, you could chill, when I stack these bills\nWhy you think these bitches love me?\nFuck sleep\nBet you ain't know, you ain't know\nWhen you dozed off, I was gettin' money\nSo fuck sleep, fuck sleep\n(Turn the lights on)"}]}