{"artist": "Fashawn", "songs": [{"year": "2017-08-11", "album": "Manna", "image": "https://images.genius.com/ef4cc71bffc87351d6ce0b4f02ba03af.449x449x1.jpg", "lyrics": "[Intro]\nLet’s do some history, who is Malcolm X?\nA fighter for freedom\nGeorge Washington Carver?\nA scientist\nShirley Chisholm?\nFirst black congress woman\nMary McLeod Bethune?\nAn educator\nMarian Anderson?\nAn opera singer\nDuke Ellington?\nA jazz composer\n\n[Verse 1]\nWhat about the life of Marcus Garvey, we all know Martin\nWouldn’t have your light, if it wasn’t for my darkness\nBlacker than the panther on the jacket of Huey P. Newton\nAnd Bobby Seale, a few of us rotten still\nWe built this country off blood and sweat\nTear drops and pick cotton in mud we step\nMomma Harriet Tubman was a woman so real\nOnly woman in history with a face on a bill\nBesides Hillary Clinton, who we speak of America\nOriginal man yet they treat us inferior\nI put that on the soul of Nat Turner\nThe memory of Sojourner\nAnd the others no longer with us\nI’m admittin’ I’m black and I’m proud\n\n[Chorus]\nSing it loud\nSing it loud\nI’m black and I’m proud\nSing it loud\nSing it loud\n\n[Verse 2]\nBrother Clarence 13X was a hero to me\nFelt like a Five Percenter was the thing to be\nIn the wild wild west I still pray to the east\nMJ on the speakers MJ’s on my feet\nBefore Mike and Mayweather came Muhammad Ali\nOnly difference between ‘em, he did it with dignity\nDoctor Carter G. Woodson, found black history\nDoctor Vivien Thomas, the first heart surgery\nKwame Ture used to be Stokely Carmichael\nBagged Mariam Makeba definitely was a leader\nIn his own right 'Keba was diva in her own light\nBefore ‘Yonce married Jay, Ashanti, Brandy\nKeyshia Cole, Lauryn Hill if you’re speaking soul\nI fell in love with TLC when I was three years old\nAngela Davis bailed out by a Fresnan\nIt was about community wasn’t about complexion\nElijah and Fard, they were writin’ for Allah\nPictures of Bob Marley and Selassie on my wall\n‘Til the day they free [?], Max B, and Bobby Shmurda\nWe all on trial eminently since a child\nI’m black and I’m proud\n\n[Chorus]\nSing it loud\nSing it loud\nI’m black and I’m proud\nSing it loud\nSing it loud", "title": "Proud"}]}