{"songs": [{"year": "2018-12-07", "image": "https://images.genius.com/80e366d2b08e909dd44f09fc7ce98806.1000x1000x1.jpg", "title": "Da Vinci Flow", "album": "Monument", "lyrics": "[Intro]\nWuah! Yeah!\nWuah! Fuck! Uuooh!\nHohohu, wow!\n\n[Part 1]\nUnd ich lande am Ende einer absonderlichen Tour\nInmitten von Gebäuden der Renaissance-Architektur\nEs herrscht sonntägliche Ruhe (psch)\nNur ein Typ am nächsten Haus auf dem Balkon hämmert 'ne Furche in 'ne bronzene Figur\nSein Blick ist sorglos verträumt, er sagt: „Bongiorno, mein Freund!“\nIch seh' die komischen Leggings, sag': „Schicke Sporthose, Mois!“\nEr wirkt sofort hocherfreut: „Hallo, ich bin Leonardo!\nVon mir ist auch die Verzierung an den Torbogen-Säul'n!“\nIch sach' ja, lässt sich schön anseh'n (jop), doch Bilder in die Wände klopfen\nMois, das konnten Menschen schon, als sie noch in Höhlen lebten (heh)\nWenn wir von Größe reden\nReicht's nicht, auf Marmorstein mit 'nem Hammer einzuhau'n, es geht um Malerei'n von Ölgemalden\nEr will sich nicht die Blöße geben, „Das ist meine Königsdisziplin!“\nUnd ich antworte ihm: „Nun, wer so von sich redet, Mois, der mög' es sich verdien'n!“ (ah)\nSag dein Abendkonzert ab\nOder was auch immer ihr nach Feierabend hier macht, heut findet ein Malwettbewerb statt (hey)\nWir sind kurze Zeit danach dabei, die Pinsel zu schwing'n\nAn der Leinwand Staffeleien feinster Malerei (yeah)\nEs war wohl reine Prahlerei, der's zwar schon dope, dieser Leo\nAber sein Talent bei Weitem nicht so groß wie sein Ego\nSo einer malt heute für paar Cents am Beach Bikini-Hoes\nIch gewinn' nach dem Urteil Lorenzo il Magnificos\nUnd hab' an dem Lauch meinen Fun\nDenn der Verlierer muss die hässlichste Braut zeichnen, die er auftreiben kann\nIch steh' auf, sage: „Tschau, wie seh'n uns eines Tages wieder!“\nDa malt er grade 'ne Biatch mit dem Namen Mona Lisa\n\n[Hook]\nIch mal' ein Bild mit meinem Schwanz (ey, Da Vinci)\nIch mal' ein Bild mit meinem Schwanz (ey, Da Vinci)\nIch mal' ein Bild mit meinem Schwanz, weil ich's kann wie ein Mann\nIch mal' ein Bild mit meinem Schwanz für Da Vinci\n\n[Post-Hook/Drop]\nHahahahaha\nHahahaha\nHahahahaha\nHier, nimm das Bild, du Vogel!\nHab' ich dir gemalt\nMein Lieber, nimm das, häng dir das schön auf in dei'm Wohnzimmer, du Spast, Alter\nAhahahaha"}], "artist": "Kollegah"}