{"songs": [{"title": "F.A.M.E.", "lyrics": "[Verse 1: Young Jeezy]\nFuck these haters, I’d kill them all if I could\nAin't scared of none of y’all, so you know my aim good\nBlowing bin Laden in my Porsche 911\nJust left Ground Zero, on my way to kush heaven\nCan’t slow down, too much evil in my rearview\nSometimes you wanna scream to God, but he can’t hear you\nAnd even if you did, this’ll probably be his answer:\n\"Fuck you ‘plaining about? It ain’t like you got cancer\"\nDo it for my niggas on the block that got it worse\nFirst the love, then the hate, that just a trap nigga’s curse\nI bet you feel like the whole world hating on you\nBut what’s the hold up? The whole world waiting on you\n\n[Hook: Young Jeezy]\n(The fame…)\nI wake up and feel empty\nShit make you want to squeeze your Glock until it’s empty\nI’m already standing on the edge, so don’t tempt me\nFake motherfuckers envy\n\n[Verse 2: Young Jeezy]\nYou mean to tell me from running my big mouth\nThat I could chill here in this big penthouse?\nAll elevatored up, black hardwood floors\nJust to sit around and feel like it ain’t yours\nYour conscience got you feeling like you done something wrong\nBut the flatscreen saying motherfucker, we on\nPardon me, nigga, do you see this view?\nSee Ruth’s Chris from here, what the fuck’s wrong with you?\nLooking at my Rollie, yeah, it’s almost 7\nBill Gates state of mind with an automatic weapon\nYou might remember from putting on for the city\nOr back when it was on 2, going for the 50\nOpened up a few squares, opened up a few tours\nJust to show niggas keys open up doors\n“Oh, we don’t fuck with Young no more” Why not?\nThe only thing I can figure, because he on top\n\n[Hook: Young Jeezy]\n(The fame…)\nI wake up and feel empty\nShit make you want to squeeze your Glock until it’s empty\nI’m already standing on the edge, so don’t tempt me\nFake motherfuckers envy\n\n[Verse 3: T.I.]\nLately, I been often out of sight, seldom out of mind\nAy, getcha bidne’ right, and stay the hell up out of mine\nI’m out my mind, tryin’ to fix it ‘fore I’m out of time\nDon’t worry ’bout me, God got me, bruh, I’m doin’ fine\nAnother year in prison, promise this is it for me\nTryna make it through the storm, should be makin’ history\nNo feelin’ sorry for me, keep ya pity and ya sympathy\nGood or bad, take it like a man, whatever meant for me\nHow I did it make ‘em hate my spirit, they wish they could kill it\nAnd they’ll take it however they can get it\nWanna see me fulla misery, walkin’ wit’ my head down\n“Let’s decapitate him, then we’ll see if he can wear his crown”\n\n[Hook: Young Jeezy]\n(The fame…)\nI wake up and feel empty\nShit make you want to squeeze your Glock until it’s empty\nI’m already standing on the edge, so don’t tempt me\nFake motherfuckers envy", "album": "TM:103 Hustlerz Ambition", "year": "2011-10-11", "image": "https://images.genius.com/7658c58dc563f705492709e9bee539ed.1000x1000x1.jpg"}], "artist": "Jeezy"}