{"songs": [{"year": null, "title": "Playin’ By The Rules", "image": "https://images.genius.com/949de24bdd28ecf0ca0139f0dd7ec90d.1000x1000x1.jpg", "lyrics": "Get Low Playa, San Francisco, California, home is Fillmoe\nCrooked cats, our neighborhood jacks, bare facts\nWe back, got scratch, no scratch, broke flat\nAbidin' by the rules, survivin' not to lose the game played\nHustlers stayin' paid, hit the cuts doin' raids\nSnitches is viscous, talkin' bout the guidelines\nSlidin' down the side sidelines being blocked by the rollers\nHold up, hold on, it's crucial in the drug zone with different mugs on\nGangstas, hustlers, playas\nMust us deal with bustas causin' ruckus for the come up?\nViolatin', I'm just statin', by the regulations you really should be playin'\nInstead of fakin', man, that's real hatin'\nThen we gettin' only the perpatratin'\n\n[Chorus:]\nI refuse to lose, I paid dues in the game\nAnd won't nuthin' change\n\nTakin' tricks on worldwide trips ain't my M.O\nFame came back from demos\nWhen I first enkindled with baby boo's with new shoes\nNew doo's and spandex dresses\nAll in the Hunter's Point section of the city\nPretty momma lookin' proper\nBut she walkin', tennis shoes talkin'\nOften cats stay scratched cuz they have no other leisure\nTime but to trust in a skeezer\nNot every lady, but I know a few diggers\nWho dealt with niggas cuz of they figures, and stripped 'em clean\nWith the 17 heat to the cheek, don' t speak\nCaught with a leak, drippin', lay it down\nFolks is broke and playin' round\nJokin', get fooled not knowin' the rules\nEverything ain't cool cuz you got a piece\nPut away with ya own tool, now you deceased\nLearn the rules\n\n[Chorus]\nHaters stop hatin', playas keep playin'\nThe hustle goes on, paper flows long\nMy grip's so strong I cannot let go of ghetto activities, robberies and\nMobbin' deep\nBig Caddie's 93, now what you tellin' me?\nEnvy has you plannin' on spillin' me\nOnce a close comrade, blew bomb sacs together\nNow it's mortal combat, you down for whatever?\nSwitchin' outta jealousy, smilin' but backstabbin'\nMack assassinatin' over the skills I be havin'\nConversatin' with these hoodrats, should stack your paper\nSaltshaker, woof, the broad taker, wannabe gangsta\nGossipin', followin' crowds, breakin' rules, way foul\nIt ain't my style to be dealin' with chumps\nOnly deal with the real scrill, put the real raps over real funk\n\n[Chorus]", "album": null}], "artist": "San Quinn"}