{"songs": [{"title": "Friend Zone", "album": "Artist", "year": "2016-02-14", "image": "https://images.genius.com/2761436d8e81c60c2e2350e0893a2455.600x600x1.jpg", "lyrics": "[Intro]\nAnother one, it's another one\nAnd another one\nHuh?\n\n[Chorus]\nEvery time I make another one, it's another one\nDon't be all up on my french toast when that butter come\nShe tried to put me in the friend zone, but she wanted some\nFuck it, I'll be in that friend zone cause I fuck with her\nAfter fuckin' her\nShe tried to put me in the friend zone\nFuck it, I'll be in that friend zone\nScorin' like the end zone\n\n[Verse 1]\nTwo doors, black on black whip\nTold that bitch that I'm from New York, she like my accent\nEvery time I get a new jawn, she the baddest\nAll these zippers on my Balmain, I feel like Jackson\nEvery time she give me good head, I give her backshots\nMan that pussy so good, I don't wanna back out\nSo I gotta strap up, just to blow her back out\nWhen she know I'm 'bout to nut, she don't tell me back out\nShe put her ass out\nThat's what happened before I passed out\nShe really got me in my bag now\nShe got me in my bag now\nHuh?\n\n[Chorus]\nEvery time I make another one, it's another one\nDon't be all up on my french toast when that butter come\nShe tried to put me in the friend zone, but she wanted some\nFuck it, I'll be in that friend zone cause I fuck with her\nAfter fuckin' her\nShe tried to put me in the friend zone\nFuck it, I'll be in that friend zone\nScorin' like the end zone\nHuh?\n\n[Verse 2]\nI laughed with her, smoked gas with her\nWhen I showed her I can rap, she said, \"You a bad nigga\"\nI said, \"What about your man?\" She said, \"Fuck that nigga\"\nYou must have been doin' bad with her\nShe said she only let me hit to get you mad\nOh, it's so sad, nigga\nTakin' niggas bitches back to back, yeah I'm that nigga\nA-Boogie on her titty, took my autograph with her\nWhoever she goin' home to, I feel bad for that nigga\nHe gon' be a mad nigga\nHe won't even wanna talk about it\nWhen we started fuckin' she promised we never talk about it\nBitches be for everybody, nigga why you trippin' 'bout it\nFuck a nigga bitch, now I can't even leave the crib without it\nHe a bitch about it\nYeah he a bitch about it it\nFucked a nigga bitch, now I can't even leave the crib without it\nYeah he a bitch about it\n\n[Outro]\nEvery time I make another one, it's another one\nDon't be all up on my french toast when that butter come\nShe tried to put me in the friend zone, but she wanted some\nFuck it, I'll be in that friend zone cause I fuck with her\nAfter fuckin' her\nShe tried to put me in the friend zone\nAh! Another one\nRa-ra-ra-ra-ra-ra\nNa-na-na-na-na-na\nNa-na-na-na-na-na\nAnother one, it's another one\nNa-na-na-na-na-na"}], "artist": "A Boogie Wit da Hoodie"}