{"artist": "Petey Pablo", "songs": [{"album": null, "title": "Get Me Out Of Jail", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "[Officer:]\nYou have the right to remain silent\nAnything you say can and will be used against you\nIn this court of music\nIf you give up that right\nYou have a right to an attorney\nIf you cannot afford one\nOne will be appointed to you by the state\n\nCould you get me out of jail?\n(You can't be serious right? You playin' right?)\nCould you get me out of jail?\n(Man I ain't even done nothin')\nCould you get me out of jail?\n(Aye look, aye somebody get my cell phone. Aye get my cell phone.)\nCould you get me out of jail?\n(I can't use my phone? Aw dats some bullshit)\nCould you get me out of jail?\n\nI think I had a little too much to drink cause\nI was in the club wit my homeboys\nStandin there talking to my homegurl\nNext thing I know I'm in some handcuffs\nThen I got blood on my t-shirt (t-shirt)\nI don't even know what the hell I done\nI don't even remember even bein that drunk\nAll I remember is standin in the parkin lot\nAnd everbody tellin me to hush\nI see an ambulance pull up\nAnd then I see a fire truck\nAnd then I see another ambulance pull up\nAnd I'm like what the fuck\nWhy's everybody lookin at me\nAnd why they pointin at me\nAnd what the hell did he give the policeman\nThat don't belong to me (that don't belong to me)\n\nCould you get me out of jail?\n(Aye Shawty my momma if she ain't home, call my sister)\nCould you get me out of jail?\n(Tell her to call Rudy, he da bail bondsmen)\nCould you get me out of jail?\n(Man look tell them to put the house up or something)\nCould you get me out of jail?\n(I don't even know what the hell im bein charged wit. Aye what im bein charged wit?)\nCould you get me out of jail?\n\nYep Yep Yep Yep\nHotel hoppin wit a hot thang poppin her thang on top of da bed (bed bed)\nShe had hair hung down from her head to her neck to back\nTo the crack of her skyeah yeah\nEverythang was fine\nWell it seemed fine the whole time\nMe and her was in it together\nWe did a lil bit of this\nLil bit of that\nLil bit of mhm\nLil bit of yeah (yeah)\nReady to go\nTell her it was time to go\n[hold on] She was actin like she ain't want to leave and shit\nI got a girlfriend\nAnd I'm like a daddy to her kid\nAnd I gotta go home to them (trippin)\nShe left and I left\nBut as soon as I left\nI get pulled over by a goddamn cop\nSaid I done rape somebody\n(Rape Somebody?!)\nYeah get out of the car\n\nCould you get me out of jail?\n(Shawty im a rapper man. I am not a basketball player)\nCould you get me out of jail?\n(Man this some bullshit, man this some Kobe Bryant shit.)\nCould you get me out of jail?\n(Man she came here willingly.)\nCould you get me out of jail?\n(Man I even got pictures on my cellphone)\nCould you get me out of jail?\n\nOkay\nSittin in this mothafuckin okay corral\nWith pimps and oldheads\nPlayin a lil checkers and chess and\nTryna get my mind of the bullshit\nWaitin on this mean ass magistrate\nTo get my paperwork together\nShoulda been outta here so\nWhere the hell's my folks at?\nOne o' clock\nTwo o' clock\nThree o' clock\nFour\nShift done change\nWhere the hell yall goin?\nThey finna take me to change my clothes and\nPut me in dat loud ass jumpsuit orange\nHell nall\nLemme make a phone call\nPlease yall\nDon't do me like this now yall\nOh lord\nWhat the hell is wrong yall?\nMy sister got a block on her telephone\n\nCould you get me out of jail? [x5]\n\n[FADE OUT]", "year": null}]}