{"songs": [{"year": "2014-10-04", "album": null, "image": "https://images.genius.com/34c799ed10f7fbc464887fbbaf7cc9df.500x500x1.jpg", "title": "Ellie", "lyrics": "[Verse 1]\nAnd I just lost my mind\nI can't believe it\nAll I ever think about is what I know I'll never be\nI'm having nightmares when I close my eyes of me dead in the street\nPlease let my sacrificial blood drip on this motherfuckin beat damn\nAll I ever wanted was a second, a minute to kill it\nThey feeling the realest and the niggas that ever do it\nApproval, I'm about to lose it\nConfusion as I'm pursuing\nA dream that is unattainable\nReally wasn't explainable\nThey tell me never take it in vain\nNot to explain the game\nOr what it means to go and follow a dream\nI've seen many give up when the road got tough\nFigured out nobody really gives a fuck\nNigga, what do you expect? respect?\nYou got to understand I'll be coming at your motherfucking neck\nAnd you better come correct\nBut that is if you want to make it to the top\nRealize that the pain don't stop\nGot to formulate a plot and a plan I'm hoping you understand\nYour destiny's in the palm of your hand\nTake control the role that you know you wanna play\nYour focus and dedication will never leave you astray\nTo display the realest of any passion\nYou was never relaxing\nAsking what it takes to finally get a break\nThe mistake that most people will make\nIs believing shit is real when it was actually fake\nCan I vent upon the page?\nAnd try to give you the pain\nPaint a picture of the problems that reside in the brain\nWith the man that was living with insanity\nIs anyone understanding me?\nVanity is a curse\nMy happiness in a hearse\nI disperse the lyrical content, you converse\nImmersed inside a verse to me depicting my hurt\nBut first ima be honest abolishing any ignorance\nI'm polishing the flow and demolishing any evidence\nThe truth has been distorted\nThey know it that I'll be peddling and passing my competition\nHabitual repetition and with the way I kill it\nThey want me to get evicted\nI bet they start a petition\nBut I built the definition of factual tunnel vision\nI mention on getting a shot\nBut never the penicillin I'm willing to bust my ass\nIf opportunities are given you gotta be fucking kidding\nI'm dying to make a difference, they lying to make a living\nI can read between the lines in the motherfuckin sentence\nSaid you was never concerned or be preaching within my words\nSacrifice or repentance but not internally burn\n\n[Hook]\nTry to make a hit off this anguish that I claim\nI put my life inside these lyrics hoping that you can see my pain\nWith all this agony I feel, I think that I'm going insane\nTo live forever through the music that's all that I want to attain\nFUCK !\nI guess it all depends on a mindstate that a young motherfucker nigga's really in DAMN! (3x)\nI sit with my thoughts\nThe page and the pen\nI write about life and how it all ends\n\n[Verse 2]\nI gotta take my time, so that I can murder your mind\nTo find inner peace that a nigga never felt\nBut nobody ever helps\nThey can never comprehend\nThe illest of illustrations that I'm giving with a pen\nThe depiction of my vision was given with a description\nBut never a contradiction\nAdmitting to my addiction was only giving me friction\nTo go and get a prescription\nI know it's not the answer, the last man standing\nThe man in the ransom, and mutilate the game\nInsane like Charles Manson, going off of on a tangent\nThrowing a temper tantrum\nDeath will come in a tandem\nYou probably never seen it\nIf I gave you the truth I know you wouldn't believe it\nMy thesis is that I could be one of the greatest  that ever did it for ripping the mic\nIt all changed\nThey treat it like it's a canvas\nI was lost in a trance\nThe flow was never pedantic\nI was tired of your antics\nYa'll been taking advantage\nBut I'm looking for answers\nGotta make it an anthem\nOriginality in the fallacy of the fornicated\nI was formulated, abated, never debated\nI've innovated evasivley\nFacing my fucking destiny\nHow the hell willI I make it?\nI'm baking without a recipe\nRest in peace to the beat that remained of what I've wrung\nLeave 'em believe 'em\nMy sounds egregious, enough to cause the bereavement I've seen\nThat most motherfuckers never want to see you make it\nI try to deal with the hatred\nAnd find a way to replace it\nThat boy could have been famous\nAnd now he's strung out like an addict all day\nThe pain is a constant reminder\nI've gotta use blinders and try to put the bullshit behind us\nYour highness is they fittin' to call me\nIt's KAAN, that's knowledge above all\nI said I leave 'em appaled\nMy god, they all gawk when staring at a reflection\nReceptive and kept and I spin it like a weapon\nStep in with a different type of mindstate\nAn automatic spitter but a nigga never breaks\nI know you wouldn't relate to the fate of the man with the hope to devote all the time to the craft\nThe sickest of any rapper\nRap for my power\nNever want to devour\nBow down you coward\nLeairly I was complicated, concentrated, contemplated\nCouldn't even wait for the moment to say I made it\nBut the time moves slow\nAnd my life's so basic\nI said I can't take it\nAnd all I feel is hatred\nI roll another blunt to keep me mentally sedated and faded\nI said the day may change but it's always the same shit\nI'm still suicidal and the Bible don't help\nSo I guess I gotta do it by myself\n\n[Hook]\nTry to make a hit off this anguish that I claim\nI put my life inside these lyrics hoping that you can see my pain\nWith all this agony I feel, I think that I'm going insane\nTo live forever through the music that's all that I want to attain\nFUCK !\nI guess it all depends on a mindstate that a young motherfucker nigga's really in DAMN! (3x)\nI sit with my thoughts\nThe page and the pen\nI write about life and how it all ends\n\n{Verse 3}\nI know I'm going to hell for sins I posses in my soul that your eyes can't see\nI recede to believe\nThere's a possibility that the grief of the green has been coming in between\nWill the means intervene if I turn into a fiend for the cream?\nLet it consume your dreams\nDemeaning as it seems\nI'm cleaning out my closet\nConsequence of the conscience\nThe drugs made a nigga brain dead like a zombie\nLost in a depression\nNever learning my lesson\nAcceptance was the main goal of a young adolescent\nWith a dollar and a dream\nPlus a penny for your thoughts\nBut nobody ever thinks\nStick around with the ship the moment they see it sink\nThat's a fucking metaphor\nI adore any lack of attention\nDispensing dissension without the attention\nDefending my right to ignite {?}\nSaid I was a mothefucking goner\nCouldn't have been wronger\nMy will got strong but the stress last longer\nThe pain is a part of the process I must digest to progress\nIn the midst of the mess that I made\nBut I'm praying that my lord will save and protect\nBut I get a good feeling that a motherfucker next\nI ain't talking 'bout fame nigga\nSpeak about death\nI'll be ready when it comes\nTake the necessary step\nInhale exhale\nTake a real deep breath even though I want to die\nThank God I'm alive\nNever want to be a nigga that can only say he tried\nBut somebody that had made it from the plan they devised\nAnd attempts to divide the supply with the people that would ride\nGiving everything I got\nDoing more to survive only thing that's on a young motherfucking nigga mind\nDamn\n\n[Hook]\nTry to make a hit off this anguish that I claim\nI put my life inside these lyrics hoping that you can see my pain\nWith all this agony I feel, I think that I'm going insane\nTo live forever through the music that's all that I want to attain\nFUCK !\nI guess it all depends on a mindstate that a young motherfucker nigga's really in DAMN! (3x)\nI sit with my thoughts\nThe page and the pen\nI write about life and how it all ends"}], "artist": "K.A.A.N."}