{"artist": "Ace Hood", "songs": [{"title": "Momma Ain’t Raise No Fool", "album": "Starvation 5", "year": "2016-07-11", "lyrics": "[Hook:]\nMomma never raise no fool\nThat's why I keep my bible by my tool\nThat's why I say my prayers before I move\nJust don't ever get the shit confused\nCause I got way too much of shit to lose\nI don't give a fuck what you assume\nCause I got way too much of shit to prove\nWho are you to ever judge me nigga?\n\n[Verse 1:]\nI got people praying on my downfall\nI got goonies with me they are hound dogs\nPull up then hop out and spray them rounds off\nShots for everybody nigga Mazel Tov\nI'm not with the games this ain't Nintendo\nI'm tryna' stack that dough long as a limo\nPull up in that Bentley Continental\nSmelling like a whole pound of that indo\nGot money I'm addicted I'm a nympho\nNumber Uno just don't ever give out info\nThreaten mine I'll have you hanging out your window\nHauling sequence like they tryna' keep the tempo\nSnatch a bag and spilt the cake up if you worthy\n[?] lord I'm nowhere near the perfect\nTold my niggas we gon' get it and we got it\nShh…there they go to plot tin'\nMomma never raise no\n\n[Hook:]\nMomma never raise no fool\nThat's why I keep my bible by my tool\nThat's why I say my prayers before I move\nJust don't ever get the shit confused\nCause I got way too much of shit to lose\nI don't give a fuck what you assume\nCause I got way too much of shit to prove\nWho are you to ever judge me nigga?\n\n[Verse 2:]\nI got  money buried that you don't know about\nThat's a half of ticket in the parking lot\nI walk in the building like I fucking own it\nYou look at my section it's a bunch of hoes\nYou looking at my diamonds you need shades on\nYou would probably think I turned the lights on\nOk I step off in this bitch I'm holla'n, \"Sak Pase!\"\nIn the section all my Zoes are screaming, \"N'ap boulé\"\nWe ain't drinking no champagne we on that Hennessy\nTell the DJ run this back and keep it on replay\nWe got it jumping got it jumping bitch we trampolining\nWe made a movie the promoter said he never seen it\nTold him, \"You welcome\" flossed the bezel I am too conceited\nThey say the same nigga that doubted  now they beg for features\nJesus\n\n[Hook:]\nMomma never raise no fool\nThat's why I keep my bible by my tool\nThat's why I say my prayers before I move\nJust don't ever get the shit confused\nCause I got way too much of shit to lose\nI don't give a fuck what you assume\nCause I got way too much of shit to prove\nWho are you to ever judge me nigga?", "image": "https://images.genius.com/002c1ec02431344405111a1007c5307c.800x800x1.jpg"}]}