{"artist": "The Game", "songs": [{"title": "California Dream", "album": "The R.E.D. Album", "year": "2011-08-19", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg", "lyrics": "[Verse 1]\nI'm at the house 'bout to roll this kush up\nI can get a call at any minute, so I'm just doing push-ups\nWaiting on what seems to be forever\nI burned a hole in my Polo sweater cause I was nervous\nBut that's how crazy birth is, loading up this Beretta\nCause this time I'm having a baby girl\nSo it's whatever, whenever.. whatever\nYou my willow and it's my will to make this last forever\nFirst thing I'mma tell her, daddy's your umbrella\nGet with a glass slipper Cali, you my Cinderella\nGotta be a dream, hold up, that's your middle name\nBoth your brothers big now, so baby you my little Game\nWho gon be the Godfather? Swizz? Lil Wayne?\nAR smoke too much but got Cali tatted on his veins\nAnd I just got a text from your mama\nSaying the water burst, I guess it's time for my karma\n\n[Verse 2]\nWalk through the door, she on the ground crying\nShe don't wanna get up, you had a baby right here\nI ain't cleaning that shit up!\nI finally got her out the house, now we on the elevator\nShe screaming, I left the car seat\nBut I'mma tell her later\nAww forget the car seat, man I'm hella-faded\nShe like \"I know you ain't high\" shit, I celebrated\nNow we in the car, she won't put on her seatbelt\nScreaming at the top of her lungs, \"God, I need help\"!\nWeaving through traffic, minutes between contractions\nClose your eyes right now, and you can see it happening\nImagine, she pulling on me \"stop I'm about to crash, shit!\"\nButterflies in my stomach, heart beating fast as shit\nEvery time I have a kid, it's like the first time\nKids the best, but they be coming at the worst times\nNow we here, Tiff get in the wheelchair\nThem butterflies still here. Am I happy? Hell yeah!\n\n[Verse 3]\nI parked the car, now I'm running through the halls lost\nTrying to figure out which one of these rooms is ours\nThink, think damn, one of the nurses stuck they head out\nThey gave her an epideral so I pulled the couch bed out\nTook a nap, woke up, they almost got the head out\nShe grabbing on the rails, looking like she 'bout to pass out\nTold her to breathe, grab my phone and hit record\n\"Breathe! 1, 2, 3, 4 - one more - 2, 3, 4\"\nPush! C'mon Tig, push! God damn it, just push!\"\nNurse Linda coaching her, doctor arm a pulling on shoulders\nGiving me the notion to cut the umbilical cord\nShe out, 8 pounds 4 ounces, sayin' stop the beat\nHold up, I'm about to make a announcement\nSee, every time a child is born somebody leave the world\nSo I thank the woman that gave her life for my baby girl"}]}