{"artist": "Ice Cube", "songs": [{"title": "Heaven", "lyrics": "Artist: Ice Cube\nAlbum:  Lethal Injection\nSong:   Heaven\n\nVerse One:\n\nListen to the preacherman\nBut are you talkin' to me\nI can't hear you with a mouth full of pig's feet\nIf I should need the swine flesh\nYour body is a mess, but you're blessed\nWith a father, son, spirit and the holy ghost\nBut my whole neigborhood is comatose\nLookin' for survival\nThe devil made you a slave and he gave you a bible\n400 years gettin' our ass kicked\nBy so-called christians and catholics\nBut I watch 'em burn in a fire\nSee I'm a g, that's why I ain't in your choir\nCause I see, cause I know\nThe church ain't nothin' but a fashion show\nGet the devil to a 187\nAnd they won't call me a nigga when I get to heaven\n\nVerse Two:\n\nYou're waitin' for the devil to come from the ground\nClown, take a look around\nJust look at the cross that the priest is holdin'\nA beast in sheep's clothing\nBut I'm rollin' with that knowledge of self\nCause heaven ain't just wealth\nSo mister preacher, if I couldn't pay my tithe\nDo I have to wait outside?\nWhite man, please take another look\nCause we couldn't be readin' out of the same book\nCause youse a crook and I'm a brother\nKing James had sex with his mother\nIs that your edition? Is that your religion?\nBlack man, you gotta make a desicion\nCause God is comin' on day number seven\nAnd he won't call me a nigga when I get to heaven\n\nVerse Three:\n\nThe same white man that threw me in the slammer\nHe bombed the church in Alabama\nSo if I cock the hammer, God won't mind\nIf I have to kill the human swine\nCause God is a killer from the start\nWhy you think Noah had to build his ark\nAnd God is a man from his feet to his hair\nThat's why you say 'amen' after each and every prayer\nI just stare at the church man\nSpendin' more money on the church band\nBut Elijah's got a plan\nGot the white man screamin': 'Damn that Farrakhan!'\nCause one day these babies are uprise\nMuch more than bowties and bean pies\nKickin' knowledge at 7-11\nAnd they won't call me a nigga when I get to heaven", "image": "https://images.genius.com/c457bbdb72f694aa2707c388b36e7230.960x764x1.jpg", "album": null, "year": null}]}