{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/1296191c98641182cc6ae0378210daf7.1000x1000x1.png", "title": "Daps and Pounds", "year": "2009-04-20", "album": "Dat Kid From Cleveland", "lyrics": "[Intro]\nYeah baby\nAs he transforms to a whole 'nother being\nSuper duper\nNice\n\n[Chorus]\nI am the one that you might see around town\nGiving up daps and pounds\nSo high up but I'm holdin' it down\nScreamin' what up? What it be?\n\n[Verse 1]\nStep up in the place just me and my buddy\nEverywhere I go they screamin Kid Cudi!\nLaunching away from the helipad\nRunning out of bud, re-up before I'm hella mad\nHella like my dad in the sense of my ignorance\nNow I give a shit bout less more than a little bit\nOne hell of a kid, and I kick it\nLord willing pure feelin' to the tenth power\nMash on the pedal, float above gravel\nWeave through the city streets\nSeize what the people seek\nPlease come follow a dude haters in the media call rude\nHow do you conclude to intro the interlude?\nThe game runs dry, bringin' the lube\nSkinny as a fuck, still eatin' the food\nHard to kill Cudder like Steven Segal yeah\nHaters applaud and they are appalled cause I see y'all\nCan't hide in your closet, stop it\nBe a boogie man, go do nothing beautiful\nSorry, I'm an honest man, fuck it\nTo my enemies: please squash it\nYou don't want Cudder to transform to a maniac\nKinda like Pat after plenty gin and tonic\nSay I'm not a lyricist you fuckers need to figure out the logic\nWhen I'm in rap mode it's nothing less than brolic\nDon't run on beats motherfucker, I frolic\nAbout...\nAround...\n\n[Chorus]\nI am the one that you might see around town\nGiving up daps and pounds\nSo high up but I'm holdin' it down\nScreamin' what up? What it be?\n\n[Verse 2]\nI'm lost in the kool-aid, I made my own flavor\nHawaiian super kush for everyone\nGivin' free blunts to the ones who wanna dig\nMore than a man, super duper they feelin the kid\nLet us get it in and get out\nExhale, inhale, eyes on the road seen foes\nThey linger ahead\nNot really there, really here\nNor here, nor there, not really scared\nBut oh well, I'll still be where what they might see as the wrong path\nEmbrace bad with the good, keep doing the math\nTrying to get it right so I can eliminate the pad when I scribble\nBeer pong, I dabble; Shrooms on occasion, depending on the persuasion and who I'm with\nAsk Ron Price, I was nice when I was younger\nYeah you was a Killer- \"When You Were Young\"\nThough I'm 25 like I'm 16, first time high\n\n(\"Yeah, I tried telling them, I'm something totally different, honest. Hahaha.\")\n\n[Chorus]\nI am the one that you might see around town\nGiving up daps and pounds\nSo high up but I'm holdin' it down\nScreamin' what up? What it be?\n\n[Chorus]\nI am the one that you might see around town\nGiving up daps and pounds\nSo high up but I'm holdin' it down\nScreamin' what up? What it be?"}]}