{"songs": [{"image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png", "title": "Hangover", "album": null, "year": null, "lyrics": "6 in the morning, shorty at my door\nBanging in the sheet, yea let's you want more\nAnd who am I to tell her no if she want it?\nShorty se the pole, I say go and she on it\nNo hesitation or procrastination\nShe come and lay in time like a reservation\nMy demonstration, power of persuasion\nShould be your education, know how to get relations\nSlip, slide, right up in em down to center\nDon't stop, (ey) this shorty you represent uh\nBoth sides, the backhand and the front in the\nNo lie, you gon swear I eat it up in the\nI play along, I play again\nI play it off, I play the hand\nHer legs long, shorty let me in\nCan't believe (au)\nI get it in here when I step out aha\nPut up the Benz and I pull the Bentley out (well alright)\nI'm in your friend's, you friend's, let's talk about c'mon\nIf you ain't with it then girl, you're missing out\nYou missing out aha, you missing out yea\nIf you ain't with it, the problem you missing out\nYou missing out yea, you missing out aha\nIf you ain't with it then girl, you're missing out\nHangover!\nYea nigga, it's the winner huh\nIt's the truth and I ain't talkin poor poodles (what you say?)\nYou niggas gas, talkin trash\nLet me here (say what?)\nLike Will Smith and Obama, I'm all ears\nIced in, that's black platinum yellow card\nI came for the Benz and the Bentley to my yellow brah\nSame Louie's made of see it like they never saw\nI got the work of jail breakers, shell pull\nI got that, what does that dang like the shell Bronx?\nYou might catch me, you might not\nLil mama hot, you should see her body parts\nHer pussy wet, I'm diving in like a life guard\nI'm a equal opportunity provider\nWith that lean, a 69'er\nSlow grinder, that's just a reminder\nRoaming over shorty like a sail a provider\nGet it in when I step out aha\nPut up the Benz and I pull the Bentley out\nI'm who your friends is talkin bout\nShit, if you ain't with it then girl you're missing out\nYou missing out aha, you missing out yea\nIf you ain't with it, the problem you missing out\nYou missing out yea, you missing out aha\nIf you ain't with it shorty, you're missing out\nHangover!"}], "artist": "Nelly"}