{"artist": "Canibus", "songs": [{"title": "Do It Live!", "album": "Melatonin Magik", "year": "2010-02-09", "image": "https://images.genius.com/eab20e1acfa343ff4b9ea6c53ff8ac79.500x500x1.jpg", "lyrics": "I can't do it, we'll do it live\nWe'll do it live!\nDo it live! I'll write it, and we'll do it live!\nFucking thing sucks!\n\n[Blaq Poet]\nIt a slaughter, nigga\nMickey and Malary style\nY'all niggas is dead, and people calling me foul\nCross you off the list, and chuck you over\nLets get this shit settled, right here and right now\nI got this hard shit in a smash\nI'm about the cash\nStop looking nigga, I'm the last\nMotherfucker, you gon' meet like this\nTurn your day pitch black, like I clicked the light switch\nThe beatle stickle played it Run up in the chamer\nIn the clip there remained the blastin off in anger\nThe black monster, strike like the black momba\nHave you motherfuckers running home to your momma\nStay in your fucking place\nYou know that I'm an ace\nIf not, get the taste out your fucking face\nEverything I say, I mean it\nI'm a black motherfucker, straight outta Queensbridge\n\n[Skarlet Rose]\nDrama in the city, streets is pretty\nWe asking God for mercy but he showing you no pity\nYou hope for a miracle\nWhen your fate was cynical\nThe only thing that mattered was if you had your pistol full\nSit back, uncontrolled rages\n[?] playing on different stages\nRocking live vibes be contagious\nWho we are, cats who die\nNever make it too far\nWe're quick to talk about things we should've done and never did it\nThings we started and never finished\n[?] children look at us with empty wishes\nThey growing up with no restrictions, I wonder why\nMiscommunication, across the great states\nBlood flows down heaven's gates\nAnd we await our torturous fates\n[?]\nBut only those with knowledge seem to see it biblically\nIt's a harsh reality\n[?] mentality\nUnholy matromonies\nYour true boys is true phonies\nShadows creepin while you're sleepin\nYoung widows weepin\nTrust in these cats when you meet them\nThis teach men before they descend\n\n(awaiting to be finished)\n\n[Canibus]\nThe appetite of megaladon pumping steroids in his arm\nHis upper torso is bigger than yours\nBrave men will die\nWomen will cry over the genocide\nBut don't cry, dry... your eye\nMy left brain twenty percent, my right brain is more than that\nMy pituitary gland is on crack\nThat's why they barely understand where I'm at\nAnd why I rap, they say it's wack\nIt's not wise to react, why's that\nCause consciously I'm black\nSubconsciously I'm darker than that\nThe most controversial artist in rap\nWhen I step with my lyrics, I force them to fall back\nI was wounded in combat, and still crawled back\nDo it right the first time, I don't ever have to do it again\nUnless I rehearse it again and again\nRotating floating spheres like clockwork rotating gears\nCounter-clockwise collating what you hear\nOver here, don't repeat what you heard\nJust remember what you learned\nRemember the last time you got burned\nQualitative analysis is not enough to quantify Canibus\nBut do it live if you think you can handle this"}]}