{"artist": "3rd Bass", "songs": [{"lyrics": "[\"It's all made up huh?  Cause here he is\"] - Archie Bunker\n\n\"You don't like anything about us\nY-you resent our attitudes, our politics\nEven the clothes we wear.\"\n\n[Verse One: Pete Nice]\n\nIn the heart of the city ya pops nutted\nTwelve months later your moms stuttered\nThe side of your grill, ill creational\nYou grew up, your rhymes were recreational\nA modern day production of the city street\nYou said I didn't have it that I couldn't compete\nBut the sleeper did sleep cause the sleeper shoulda woke up\nNow you're in my sight, the buddha sess you smoke up\nThat's the element you carry your rhymes on\nBut that style of rhyme won't let you live long\nCause a strong song the Minister sent\nCause I'm a product of the environment\n\n\"There it is, in black and white\"\n...\n\"There it is, in black and white\"\n\n[Verse Two: MC Serch]\n\nOn the streets of Far Rockaway, Queens\nEdgemere Wavecrest, by Beach 17\nRedfern Houses where five-oh was afraid to go\nIs where I first kicked my lingo\nCrowd was flipped as I kicked it and didn't rest\nAnd my reward was almost a cap in my chest\nNow in 90, I can still say that\nThe brothers in Rockaway, yo, they don't play that\nHammer, Watts, or in every neighborhood\nLook around and see all the young hoods\nKids will always be makin' bids so you can't prevent\nBeing a product of the environment\n\n\"There it is, in black and white\"\n...\n\"There it is, in black and white\"\n\n[Verse Three: MC Serch, Pete Nice]\n\nBack in the days when kids were mack daddies\nStriped Lee jeans, playboys and Caddies\nLong Beach, the M.L.K. center\nHe almost caught a bad one as he tried to enter\nI'd wait\nThere it is G\nBum rush the back door\nThen scatter onto the dance floor\nMe and my boys just skeezin all the cuties\nNever had static cause everybody knew me\nLocal DJ's tearin up the wax\nAnd out the corner some punk gets taxed\nAfter the party cracked open the forty\nBoosted from the store yo the man never caught me\nJetted to the arcade cranked the bass\nAnd then the 5-O chased us from the place\nHop on the railroad play the conductor\nEverywhere I went I always tucked a\nMarker in my jacket to bomb up where I went\nCause we were just products of the environment\n\n\"There it is, in black and white\"\n...\n\"There it is, in black and white\"\n\n[Verse Four: Pete Nice]\n\nYou hear it in the strength of my voice and in my rhythm\nIgg it - now you know how I was livin'\nIt happened to me like it happened to Serch\nPimp Minister Pete Nice'll kick the verse\nRichie Rich and my boy, Kiwai Hood-tight\nThe K to A Kingston, Bedford-Stuyvesant\nJetted to the Empire and hoods was flammin'\nOpening for Dana, skins in are skammin'\nMouth open wide, all those listening\nDumb open with a Cisco in my system\nUnprotected but respected for my own self\nCause of talent, no shade, or nothin' else\nA time of tension, racially fenced in\nI came off (and all the brothers blessed him)\nI left more than a mark, I left a dent\nCause I'm a product of the environment\n\n\"There it is, in black and white\"\n...\n\"There it is, in black and white\"\n\n[Shoutouts: Pete Nice, MC Serch]\n?? shout Sam Sever, D-DS\nYo true indeed a doo doo shout out to Marley Marl and the IC Posse\nDoug E. Doug\nYo K.M.D. Kausin Much Damage\nMy man Shameeq from the Fort\nYo Kurious Jorge and Bobbi-to!!!!!!!!\nThe Jungle Kid\nTrue indeed\nNice and Smooth\nYo I want to give a shout to Digital Underground\nReanimator Disagree, my brother V-Nice\nLarry MC Euthanasia, peace in pieces for ninety\nPuta!\nOut..", "image": "https://images.genius.com/75e0458f92eeaa069230dd12ed2a1b01.500x500x1.jpg", "album": "The Cactus Revisited", "title": "Product of the Environment (Remix)", "year": "1990-01-01"}]}