{"songs": [{"lyrics": "[Looped sample]\n\"When I'm in a re-no-vative state of mind I'm innovative\"\n\n[Verse 1: Aesop rock]\nIt’s like antisocial\nHazardous portion organically nourished\nCourage to flourish in music's orphans\nLunge nicotine dream missing link weariest\nCaution we proclaim till brain’s arch like Sagittarius Shield\nYield to the eyes as mescaline killin' fields\nRise groggy stone gaze marching moodily\n'til ... plural styles amalgamated beautifully\nRudely awoke,sing rubber-glue conglomerates\nSucking up love\nWhile brushing parasitic critics to my left side\nI test glide\nKamikaze crash distort that's on my preface (check)\nThe therapeutic unit recommended\nNow slow-mo Quasimotos teeter on ringleader status\nWhile I spit satellite photos while teetering on the stratus\nSleepwalking the atlas after none.\nTrudge and nudge my ninety-nine octane brain\nTo one-oh-one\nRun to organize my mood\nLike cauterize my wound and climb up\nLovely samaritans line up like bar codes\nFor a fraction of my factions\nThe hollow of his hand beholds contraptions via\nAmplified files collapsed your cacophonic' conquest. My specs up\nMorph hostile and docile insubordinance your phylum\nChordata asylum swarmes' your coordinates. Rush\nMust not sleep, must warn others\nI’ll tourniquet your turbulence\nThen trample on your stutters\nIf I could displace every vagrant in America\nWith traces of my character\nThe Earth would be a more pitiful habitat\nWith infinite acres of auto-cry intricate nature\nSwung open the nomenclature to obscure warlock trickery.Pure\nHazmat got tossed back by liquors supporting patience\nWorking knuckles for audio duplication\nThat’s like fiending for a purpose\n\n[Looped sample]\n\nAesop Rock, prototype Robocop\nJabberwocky rocking on the highest hilltop\nI possess two siamese styles that’s like connected at the mic hollering monstrous\nPoly-tech impede indidgy progress, deaf\nSwept off your meridian. It’s operation Start With a Slummy Raped Your Milk and Honey\nCan I like, conjure up like all potent components of like\nMiddle siblings scribbling on his lonesome like\nHit him with my ninety-nine metal plated mics upon the wall, take em' down, pass em'round, rock em' all. Bust it\nI’m forever building my City of Lost Children ripping rungs off your ladder at a\nSardonic smirk. Ebonics lurking where the crop circles got stamped out from the rain dance\nTsunami rain blast lift off like origami cranes and sloppy braincasted class-a-piece mastered to capture your flag then flutter\nWhile slaves defy water sucked through from paper bags\nThe magic-maker dragging devils to add triple sixes melt the triple glitches on your console\nI calibrate my mics prior to claimin' shit is rockable\nUnlock and pull a backdoor for the bounce\nWhile cannily panicking was the average. I broadcast modern boredom mesozoic poetry pupils\nCaught up in scruples from the inimical nature of my program\nElegantly overcast password curse an a tactless bastard\nCatatonic until personal practice mastered\n\n[Looped sample]", "title": "Antisocial", "album": "Music for Earthworms", "image": "https://images.genius.com/355a2e1156bc79b1e8d0997024f4cc06.300x302x1.jpg", "year": null}], "artist": "Aesop Rock"}