{"songs": [{"album": "Writer’s Block 3", "year": null, "title": "I’ma Real O.G.", "image": "https://images.genius.com/ab7fbc8260d362511ebef8206fd74571.300x300x1.jpg", "lyrics": "[Intro:]\nSAGA! DAMAGE! YES SIR\nJ.R Writer....to all of my g's coast to coast\nFLACO THE GREAT!\n\n[Hook:]\nI'm A REAL O.G (YOU AIN'T HEARD ABOUT ME?)\nI'm A REAL O.G (J.R WRITER NIGGAAAA)\nI'm A REAL O.G (YOU AIN'T HEARD ABOUT ME?)\n\n[Verse 1]\nI been the hardest with them bars of piff, you could tell JR is sick\nPardon prick, we started this...you can never harm a dip (never)\nYou niggas harm-a-less, you would never harm a tick\nI ain't too happy but ya girl give me the marvelous\nI'm a quarter brick, something you would jog to pitch\nThis is that lean boy, you still got ya starter kit\nI ain't bothered with...these niggas you see talking\nWhen we ride past, same niggas you see walking\nIt's just sickening, I be listening\nThey rap about they man fucking ride that they sitting in (get some wheels!)\nThey ain't whipping em, nor stick-shifting 'em\nAll his broke ass know how to do is GET IN EM\nYou's a slouch nigga glue up ya mouth (shut up!)\nI copped a Charger way before you ever knew it was out\nSTOP!...you was never hot, I'm a 100 times better ock\nYeah your up, so up...I bet you that you'll never drop\n\n[Hook]\n\n[Verse 2]\nNow...I got these bastards hating cause I'm in an Aston racing\nSwitch lanes, cross 'em over like I'm Gary Payton\nDon't know my way around? The wrenches ain't aggrevating\nI'll have a whole conversation with my navigation!\nYou move sloppy, hopping off a Ducatti?\nI'm bout to make my 2nd car a Bugatti\nIt's true mami, tear seats, blue body\n1.2 ocky, since Jim copped that new Maesi (Maesaerati)\nYou dude's throppy, I'm paid cause I'm nice\nYou will never ever see a day in this life\nI keep K's for the fight.....so when I say give me \"my space\" no I don't mean a page on a site\nThe K that I spray out you'll lay with the mice\nWe paid out, I can get you grey for a price\nLook take my advice......or lay in the river\nDon't you dare say my name if you ain't a good swimmer!\n\n[Hook]"}], "artist": "J.R. Writer"}