{"songs": [{"year": null, "image": "https://images.genius.com/3b58f3f060e08bef7dd7fc8256dfb9e0.500x500x1.jpg", "title": "Making Mail", "album": "A Bad Azz Mix Tape III", "lyrics": "(*talking*)\nJeah, uh Southside (what-what)\nWorldwide (yeah nigga), E.S.G. (Big Pokey)\n(Presidential) Presidential, yeah\nAnother Bad Mix Tape, something else for them boys to hate\nFeel me mayn, ha-ha\n\n[Hook - 2x]\nI'ma boss when I floss, can't you tell\nE.S.G. a G, that's known for making mail\nBig Poke' and Presidential, yeah you know they raising hell\nAnother Bad Mix Tape, bitch for us to sell\n\n[E.S.G.]\nPlus I heard them FED's, wanna put us in jail\nCause I keep a bunch of bricks, and a extra scale\nPimping nigga 50 niggas, times 52\nThat's how many bricks every week, we run through\nWho are you E.S.G., S.U.C. representer\n500,000 sold, independent y'all remember\nNow peep this I'ma boss when I floss, you know that mayn\nNo wrecking no, just dro sacks mayn\nNo suits and ties, just throwbacks mayn\nAsk your bitch, she know us mayn\nSpark up the dust, nigga po' up a cup\nNigga like me, really don't give a fuck\nCandy sprayed on the Escalade, everything 22's it up\nMy Glock on cock, for the boys on the block\nWanna take what I got, but I think not\nDon't make me spray your block, I'm keep shooting till the K get hot\nK-45, when I ride\nJust in case a hater, try to take a nigga life\nThat's right Southside, I'ma scream it till I die in pain\nMake the world feel my name, fuck the fame\nSee the streets won't change, nigga fucked up game\nAin't no good having a gun, with a fucked up aim\nThis a Mix Tape mayn, hit the sto' and cop shit\nE.S.G.-Big Pokey, Presidential got the block locked bitch\n\n[Hook - 2x]\n\n[Big Pokey]\nSay my client tail heavy, like F-A-T I love it mayn\nCopping houses, pushing deuce seaters in the turning lane\nCan't you tell everytime, I'm on the track I bring the pain\nE.S.G. leave a stain, on brains since Swang & Bang\n2004, Lil' Keke gon take em lane to lane\nM.O.B. Style in the do', Hurricane gon change the game\nX'ing niggas name out, putting niggas flames out\nS.U.C. that's all the time, Screw-Zoo got my name hot\nI can't stand in the same spot, when I know first down gon move the chain\nTwo yard deep in the red zone, start out wide cut against the grain\nH-A-Dub, Pee-Wee, Ron G that's Dead End\nBotany Boys B.G.'s, D.Z. in the FED Penn\nPush rewind I'll say it again, don't card that's bootlegging\nBootleggers get legs broke, y'all be not be hard headed\nNigga like me work hard at it, all about my do' stack mail\nBad Azz Mix Tape part 3, moving units like crack sales\n\n[Hook - 2x]\n\n[Mussilini]\nIt all started from a beep, a mind and a sweet\nEverybody wanted love, in the Southside streets\nScrew Tapes kept us going, and the hood kept us safe\nFrom them folks that's running round, badge and Glock on they waist\nMy niggas apes about they dividends, we love to stack we love to spend\nWe love the Lacs and we love the Benz, we love to jack we love to end\nBest believe it's going down, selling green by the pound\nClear the 'Vard if the laws around, don't want my thieves doing time\nDon't wanna see you in the Penn, you in the Penn or you in the Penn\nDon't get caught I'll do it again, that's the same thang you would of did\nMaximize without a doubt, seldom seen without a pout\nG's in clean without a drought, see the scene I'm turning out\nBurning out when coming through, do what you gonna do\nI got my gun at you, lift my guns in front of you\nPlus I flip a Hummer too, sounding like a summer dude\nCan you see me Big Poke', E.S.G. and Mussilini\n\n[Hook - 2x]"}], "artist": "Big Pokey"}