{"songs": [{"year": "2013-01-18", "title": "Exit Theme", "image": "https://images.genius.com/16e4369581459dc366b55de0957100fb.600x600x1.jpg", "lyrics": "[Intro (Sadistik & Astronautalis)]\nI﻿ am the only one they made\nCast from charming bones and clay\nOn that cold Winter’s day or so they say\nWe are the last known to exist\nHiding shine remote cliffs\nWe prefer it that way\nPlease leave us just like this\n\n[Verse One: Astronautalis]\nI used to hammer sheet metal till my palms bled\nCash my pay check at the bar then drink the whole thing\nCatch a pheasant with my bare hands, take her home with me\nWake up at 5am and make it back to work to start again\nYou're sweating whiskey in that first shift\nBy lunch break you're feeling worthless\nAnd soon you're cracking jokes with workers\nBy the time the final whistle blows, your body's feeling perfect\nSo let's celebrate the good times\nAnother round for the old guys\nAnd to that pretty thing with glazed eyes\nI ain't asking for a dance, I'm just hoping for a great night\n\n[Hook: Astronautalis (Sadistik)]\nCause when the stopwatch dies we all drop like flies, so what's the point in being free to die (Right?)\n(You see it's not my time, I thought I lost my mind but instead it found a place to hide)\nKeep your fucking keys, I don't need to drive (nah), I'll just run for the rest of the night\n(Empty handle with my tongue on the edge of a knife, make me young, make me numb, 'til my exit arrives)\n\n[Bridge: Lotte Kestner]\nMy heart it pounds, so I can't make out a sound\nI've come this far, and I couldn’t leave without you now\nIf my heart beats now, then I'll go turn around\nIf you know me, nobody does\n\n[Verse Two: Sadistik]\nDamaged goods tend to hide in pretty packages\nSaddened looks get disguised in witty adages\nIt's our dramatic twist, come watch the magic tricks\nAbracadabra, necromancer sawed in half again\nSo I mutter some witty quips\nIf love is to give a glimpse, what's under my skinny ribs?\nA couple of whiskey sips or something to get me fixed\nBefore I'm antisocial like it's Buffalo 66 in here --\nSo is it beautiful or frail?\nI feel like Ouroboros when I'm chewing on my tail\nThe crows can form a chorus when the funeral prevails\nIt shows a glowing orange when the moon is full and pale\nWide awake and rueful, looking for a light to break the stupor\nOf the types of grey that dilate my pupils\nI can taste the sucrose on the tip of my tongue-y tongue\nFrom tidal waves I'm running from but isn't it funny once it's done?\n\n[Hook]", "album": "Flowers For My Father"}], "artist": "Sadistik"}