{"songs": [{"year": "2009-01-30", "album": "C4", "image": "https://images.genius.com/8b626036c563b0aefa7a5b83f1fb9302.750x750x1.jpg", "title": "A Milli (Freestyle)", "lyrics": "[Produced by Mr. Bangladesh]\n\n[Intro]\n(Top Dawg, Money GANG)\nOwwww, Dave, I see you, now see me\n\n[Verse]\nLook, I say I'm a millionaire\nI'm a Top Dawg millia- no let me just come in unorthodox\nI order plenty ammunition for the enemies that I got\nI'm the King, I'm just looking for my Coretta Scott\nBet I pop, like a boy band, I'm annoying to rappers\nGuess I'm poison to rappers, front on me, get bent backwards\nStepping on em' like a Kappa\nCap and gown, graduated with my Masters\nSo where do I go now\nSwear there is none after\nI'm the bishop, I'm the pastor, I'm the god MC\nAnd you don't want to get caught in the rapture\nI would probably burn your whole colony\nChew you up then spit you out\nYour nothing but a Polla Seed\nFollow hood policies\nCompton, California where the motherfuckin' riders be\nYou never seen a killer til you seen one on side of me\nThat green on the side of me\nFuckin' all about my fuckin' money like Assadomy\nFuck them bitches properly\nI do it\nI do it, done it run it like I grown legs by the hundreds\nMy pocket full of hundreds, I'm always hungry\nBeen hungry, I think a nigga need three stomachs\nBummy, NEVER\nMiddle of a conversation, I cough up a feather\nAnd get ready for the detonation\nI bomber whoever\nWhatever you bout, I'm bout it twice like a woman who give twins life\nI steered right through your fan base every time\nTapping your demographic like I was Gregory Hines\nEvery line be tailor made, hella paid, count that money, several ways\nI'm a beast, fuck a mansion, I rather live in a cave\nSasquatch is back, but what y'all really didn’t know is I sasquatch can rap\nMotherfucker I'm iller\nOk, I squeeze the juice out a rapper and just squash this track\nThe people like \"What the fuck happened and where Wayne be at?\"\nThere's some boy named K Dot and he's a maniac!\nI think his vocals is strapped, with a toolie in fact\nHe spit like a Uzi, rat-tat-tat\nHe just shot me in my back, somebody pick up my back\nI think that boy from Iraq , I think y'all boys better know that\nHe got it on lock like a Low Jack\nHeading straight for the top like a ball cap\nY'all better fall back, y'all better crawl back where ya'll came from\nAin't one better than the one who can write like Langston Hughes from the brain off top\nLike a bottle dude, get a hollow, where you swallow food\nGet a model, bet she swallow, who? Me\nBet she goggle like a scuba diver eyes in the sea\nRecognize who I be, K. Dot motherfucker\nDot motherfucker, hot motherfucker, drop top when ya popped with the Glock\nOn your side motherfucker, side motherfucker, ride motherfucker, die motherfucker\nWhen I go pop pop\nOpen up close shop like a retail spot\nEverybody know I be where the money lie, eat where the money lie, shit where the money lie, sleep where the money lie\nBitch thats no lie, let the truth be told\nK Dizzle, the Big Sizzle, turn beats to stoves, burn up\nRappers: I'm iller\nDig it, like it, love it a lot"}], "artist": "Kendrick Lamar"}