{"songs": [{"year": "2014-11-14", "album": "King", "image": "https://images.genius.com/ec5428c73b3a017560d3e59fe3c42b82.600x600x1.jpg", "title": "Feelin Like", "lyrics": "[Intro]\nAy yo NEBS\nI'm glad we saved this one for last brother\nYo\nLook\n\n[Verse 1]\nSometimes I wanna get a shot gun, close range\nEnding it all fuck I hope there ain't no pain\nThen my families fucked and all messed up\nIs this depression or the lesson that the drugs fuck?\nI've been hitting shit since I hit 13\nWhatever we could get pop a roofie if its dirt cheap\nThen I made it in rap ain't that your dream bro?\nWhen you picture it its nothing what it seems though\nConstant threats so I'm buying guns\nWith the shit I spend on that I should supply my mum\nA new car or somethin' I threw stacks at Rates\nWe both the same so that went to waste\nI got a massive house and a luxury car\nMy girl screaming at me I don't know who you are\nNo excuse but the fame and the drug mix\nWith the cash turned me into to a fuck wit\nI'm sorry\n\n[Hook]\nI don't wanna live my life no more\nI ain't wanna be a victim of the shoot out wall\nI ain't wanna be known as a tripped out lost cunt\nGot my freedom but it's feeling like I'm locked up\nI don't wanna live my life no more\nI ain't wanna be a victim of the shoot out wall\nI ain't wanna be known as a tripped out lost cunt\nGot my freedom but it's feeling like I'm locked up\n\n[Verse 2]\nI got what I want, why the fuck I feel this?\nIt ain't Kers if I ain't spit the real shit\nI've seen the bitter shit that's why I give you bad stares\nI try and block but the memories are trapped there\nGot money coming trust me that ain't bring happiness\nTell that Pharrell that fuckin' song is a batch of shit\nGrowing up kids were searching through a clothing bin\nI see 'em lately and they say waddup they don't don't whinge\nI'm just gonna fuckin' spill my heart\nHate me or love me I've been real from the start\nWhat you know about a mate almost comatose?\nI need you here and I'm worried you will overdose\nCos you the back bone to this shit you're gonna need help\nWho am I to talk? I'm sleeping with a seat belt\nAs a pillow in the passenger seat\nFell asleep halfway through I was having a feed\nI need help\n\n[Hook]\nI don't wanna live my life no more\nI ain't wanna be a victim of the shoot out wall\nI ain't wanna be known as a tripped out lost cunt\nGot my freedom but it's feeling like I'm locked up\nI don't wanna live my life no more\nI ain't wanna be a victim of the shoot out wall\nI ain't wanna be known as a tripped out lost cunt\nGot my freedom but it's feeling like I'm locked up\n\n[Verse 3]\nI hadn't seen a mate for a couple of months\nI seen him and it hurt he was fucking it up\nAnd it broke my heart more cos his bro was on the pipe too\nThe same kid that looked up to us at high school\nI said I wanna chat and fix the prob\nOne ear out the other can I speak to God?\nIf you listenin' help in some way or form\nIt's like holding aerials on planes in storms\nSomeone's gettin' struck every bodies running mucks\nIce will make your best friend wanna fuck you up\nThe tabs I've popped probably killing my liver\nPain stops sprite so my body don't shiver\nI need guidance I ain't gonna hide shit\nI hope what I'm saying don't lead to violence\nI had enough of that coppers tryna lock me up\nFuck 'em Imma make my music and pop my drugs\n\n[Hook]\nI don't wanna live my life no more\nI ain't wanna be a victim of the shoot out wall\nI ain't wanna be known as a tripped out lost cunt\nGot my freedom but it's feeling like I'm locked up\nI don't wanna live my life no more\nI ain't wanna be a victim of the shoot out wall\nI ain't wanna be known as a tripped out lost cunt\nGot my freedom but it's feeling like I'm locked up\n\n[Outro]\nAnd whatever I said in this track\nIt isn't meant to bring you down\nYou need to find the positive in it\nWe as a society need help\nThis is just what I see\nImma march on\nStand tall\nKerser\nWe out"}], "artist": "Kerser"}