{"artist": "9th Prince", "songs": [{"album": "Granddaddy Flow", "lyrics": "[Intro: 9th Prince]\nYo, yeah, yeah\nI don't even talk to y'all niggas\nNot on the streets\nI wanna big up my cousin O.D.B. though\nWord up, Baby Jesus locked down, you know?\nThat's it, man\nThat's all I gotta say to y'all niggas\nYou know? Then watch me spit\nLyrical warfare, word up\n\n[9th Prince]\nAiyo I'm wise like a blind man playing piano\nJellying across the Verazanno busting at Sopranos\nWhite boys with attitudes like Rocky Marciano\nGot a fire arm like Janet Reno\nWe serve John Wayne in El Dorado\nGo to war like Al Pacino or Robert De Niro Casino\nThe ghetto is pitch dark\nFor the street's of messenger, the story like Joan of Arc\nFirst spark with Stapleton park\nGladiators and DD, before that was the Paris Crew Squad\nI just to stand up on the benches\nState of mind, third eye dimension lynching\nKillarm' comrades like henchmen\nStreet doctor leave you paralyzed in St. Vincent\nEnd the session with the weapon\nMadman reach for the sky and snatch the Moon out the Heaven\nAttack you with the Mac-11\nShots let off that'll rip through ya flesh\nPull bullets the shape of sevens, keep stepping\nLethal rejection, high scene rock mine, BONG!\nHeavyweight blows to ya midsection, Madman is coming\nYou best to head the opposite direction\n\n[Chorus x2: 9th Prince]\nAiyo Madman drag 'em through the dark streets of reality\nMatrix combat, projects go to war from Shaolin to Iraq\nWhen fake niggas bust their heat, real soldiers bust back (bust back)\n\n[9th Prince]\nAiyo I spit razors at haters\nI'm a walkingskyscraper like Wolf Blazer\nWe blase lasers at invaders, that's infantry behavior\n1-2-0 precinct slang faders\nWeak niggas get robbed in pissy elevators\nRappers bite like alligators\nWe bust CD's inside Navigators\nI ain't pretty, life is risky\nLike my act against Species\nMigrate, United States, the cities, Madman prophecies\nI had to duck four shots coming out of 260 lobby\nIslord picked me up in a stolen Mazurati\nWith two hotties with two sawed off shotti's\nBeretta know karate\nFuck around in half lead half metal\nOn to beat a body, soon to be a millionaire like Bill Cosby\nDom P. accept the collect calls from John Gotti\nWe ain't gangstas we shankstas that'll shank ya\nBitch ass niggas get hung with coat hangers\n\n[Chorus x2]\n\n[Outro: 9th Prince]\nWe keep busting, ain't no trusting, nobody\nOn these dark streets.. word up\nYo O.D.B., big cuz, Baby Jesus\nKillarm', we gon' come break ya ass out, nigga\nWord up, we keep prepping this shit\n9th Prince y'all, Madman y'all\nThrow ya grenades up\nWord", "year": null, "title": "100 Degrees", "image": "https://images.genius.com/aee759b8fa2fa70e9bb2b738d3297e33.462x462x1.jpg"}]}