{"songs": [{"image": "https://images.genius.com/a47da8bd79cb73aa52f09bd933f5f5f9.1000x1000x1.jpg", "title": "Smooth Talkin’", "album": "Cool Patrol", "year": "2018-08-17", "lyrics": "[Spoken Intro]\nYou know, Ninja Brian, it's not enough to just be the world's most amazing lover\nYou also have to be a smooth talker\nWell, of course, I know how to talk to women!\nGive me a delicious groove, this is what I tell them:\n\n[Verse 1]\nGirl, I'm gonna take my flang-diddly out and slam it in your flump\n(That's right)\nThen, without a sound, I'll run my tongue all up and down your whole sp'kunk\n(You like that?)\n\nThen, I'll flip you 'round and lay you down\nAnd rub my gank up on your shmears (all over your shmears)\nYour pliver will start to quiver when I grab your stanky nootputs by the fleers\n\n[Chorus]\nOh! Open your heart and give me a taste of your flarmp\nI'm gonna lightly stroke your flendal 'til you twarf\nThen I will gently flick your turfles, baby\n'Til you scream \"Oh my God I'm gonna quambely it so hard!\"\n\n[Interlude 1]\nDamn, that's some smooth talking\nPlenty more where that came from, UNH!\n\nNow it's-- oh, horns, sorry...\n\n[Horn Solo: Garrett Smith, Bob Reynolds & Rashawn Ross]\n\n[Interlude 2]\nHere we go baby\n\nNow it's-- oh wow, a guitar solo too, alright...\n\n[Guitar Solo]\n\n[Verse 2]\nNow it's time for me to take my tiddlybits\nAnd mash 'em 'til they gub (Oh yeah!)\nI've got two nasty doodads\nAnd they're beggin' for one moment with your shnub (Yeah, yeah!)\n\n[Chorus]\nOh! My sackity pack is the figgeta-figgeta-fack\nAnd it's on the attack, lookin' to mack back in your coo\nWe're gonna mate 'til we're drained like two hot shmazins\nAnd I please you with my shmoo (Woo-hoo!)\nDinner is served and looks my vagoink is the main dish\nSo sit down and gobble my spünt or leave if you wish\nTo not have a nice taste of my flappy squish\n\n[Spoken Outro]\nLet her go, Ninja Brian\nShe's probably just... going to think about it\nWell, if you need me, I'll be in my chambers... schnubbing my own gank!"}], "artist": "Ninja Sex Party"}