{"songs": [{"title": "Real Friends Don’t Exist", "album": null, "year": "2016-10-24", "image": "https://images.genius.com/3eb7d35f57d4cc980f2f40334cad4213.500x500x1.jpg", "lyrics": "[Intro]\nYeah, yeah, ayy\nAnd I'm back (Yeah)\nWait, I didn't even go anywhere (Whoa)\n[?]\nHey, ayy\n\n[Chorus 1]\nAnd I'm poppin' off the rip, real friends don't exist\nI know you see me shinin', I ain't really hard to miss\nNiggas takin' shots, we ain't even hear the diss\nHow he hatin' on me but he always on my dick?\nWinter '16, you better buckle up, yeah\nOut here gettin' money while you cuddled up, yeah\nClaim you put in work, you haven't done enough, yeah\nIf gang ain't fuckin' with you then I'm runnin' up, yeah\n\n[Verse 1]\nYeah, I make music, ain't no rap nigga\nI be with some young niggas who sell pack, nigga\nI'm smokin' gas, see this cash on my lap, nigga\nAnd if I'm broke I'm makin' plays, I can't relax, nigga\nNiggas out here cuffin' hoes I fucked last week\nI got thots on top of thots, call 'em Ashley\nAnd you know how I'm really rockin' so don't ask me\nI get it quick to stack it up, I dough spend fastly\n\n[Bridge]\nI think my old ways really turned me to a savage\n'Cause if i want it I'ma get it like I gotta have it\nAnd she doin' flips on it like she acrobatic\nI hit it once and cast a spell, she thought it was magic\n\n[Refrain]\nHey, turnt up on these niggas like I'm Mr. T, yeah\nI be so damn high I don't got memory, yeah\nI'ma really flex on all my enemies, yeah\nSwear they tryna do me like the Kennedys, yeah\n\n[Verse 2]\nWhat you think a young nigga rap for?\nWhen my bands is gettin' low I had to trap more\nAyy, I been goin' sell out the Phillmore\nGet the number one song on the Billboard\nIts gon' take time, I ain't really scared to lose\nNiggas always feelin' like they got a point to prove\nI barely see my family 'cause I'm always on the move\nBut when it comes to them...\n\n[Chorus 2]\nIf a nigga tryin' poppin' off the rip, real friends don't exist\nI know you see me shinin', I ain't really hard to miss\nNiggas takin' shots, we ain't even hear the diss\nHow he hatin' on me but he always on my dick?\nWinter '16, you better buckle up, yeah\nOut here gettin' money while you cuddled up, yeah\nClaim you put in work, you haven't done enough, yeah\nIf gang ain't fuckin' with you then I'm runnin' up\n\n[Verse 3]\nYeah, whoa, ride around outside\nIt's gon' take time for them boys to realize\nWe been makin' plays, cross 'em up like AI\nNever lookin' down, they might catch me by surprise\nShe just popped a Xanny like she ate some candy, ayy\nRide right in the Uber, pull up on your family ayy\nThis is for the people who don't understand me, ayy\nThey said I want the millions but I want the Grammys, nigga"}], "artist": "Lil Skies"}