{"artist": "King T", "songs": [{"image": "https://images.genius.com/dc61ccdd1dd20750a95785c799561625.820x820x1.jpg", "title": "The Coolest", "year": null, "album": "Act a Fool", "lyrics": "[King Tee]\nYes yes y'all, it's not a secret no more\nThe King b-boy Tee has been washed ashore\nAnd I'm back I'm here to say if I'm a King then I should rule\nI'm the best for the job, you know why?\n(WHY?!) Cause I'm cool..\n\n.. see I'm\nSmoother than silk, cooler than an icicle\nRough like a bully, I'm rollin like a bicycle\nFresh like a virgn calculates like a math wiz\nYou think you're bad? I'mma show you what bad is\nMicrophone magician, it's the end when I start\nA confidential differential, I'm the state of the art\nCrowned King b-boy, the elite rap reverand\nMaster of the Ceremony twenty-four/seven\nMC's don't fear me, I come in peace, ha\nDrapped in Fila, or either Elise\nCause I'm the cool wop dancer, girlies romancer\nSuckers stay away I'll mess you up like cancer\nMy style is original, not a subliminal\nYou say to yourself there's no one better, than him you know\nBustin all bustaz, killin all killers\nTacklin MC's like a Pittsburgh Steeler\nI'm bolder than bold, I wear a lot of white gold\nThe supreme King Tee, I've got things in control\nSkeezers wanna clock me while I'm on my way to school\nYou don't, have to ask why, you know the reason..\n.. he's COOL!\n\n{*DJ scratches*}\n\nI got a white gold crown, white gold ropes\nSleep on white sheets, ski on white slopes\nSupreme to be exact you know I'm cooler than most\nWhen God gave out coolness, I took a whole dose\nI won't bother or nag you, to rhyme I'll be glad to\nYou thought I couldn't get you but I already had you\nI know you heard my DJ, is he good or what?\nKeith Cooley is a killer, your DJ's a mutt\nI wouldn't try to take him on he'll cut you up like a biologist\nHe'll be the tutor, and I'm the talk-ologist\nYou think he's new, well for you I feel sorry\nCause see, he's been around since Uncle Jam's Army\nCool impresario, majority ruler\nI got a lot of money - go ask my jewler\nDef in the flesh is the cool King Tela\nI talk more noise than J&D's talk Fila\nI'm the most coolest and I sit on the throne\nGivin the latest fashions silver shines like chrome\nThe King your royal highness better known as a cool rider\nGot a forty of Olde E then I'll ask, let me try this\nCoolest of cool and my rhymes are essential\nTo see me, guardians have to be parental\nMe and Keith, are the teachers of the new cool school\nBut not only that, I gotta tell you somethin.. I'm cool!\n\nKeith Cooley!\n\n{*DJ scratches*}\n\nI can't rhyme about crack, I'm not the one to be tellin it\nThe ones sayin don't are the ones that's sellin it\nI can't cope in other words I can't feel it\nIf crack was a monster, then I'd kill it\nCause I'm rough and I'm tough, and I come from L.A\nYo my name is King Tee and I'm here to stay\nI got the courage of a bull, words of a wizard\nHotter than sex, cooler than a blizzard\nLeader of the land, commander and the chief\nBigger and bolder other words I got beef\nI got a posse at that, mostly, cold chillin\nYours make thousands, mines make millions\nNot at all a gangsta cause I never do crimin\nI make a lot of money, by just cool rhymin\nNot doin it cause I want to but I'm doin it cause I hasta\nCoolest of the cool and plus I rule the rap classes\nYeah my stuff is funky, and I'm the rap junkie\nSlammin sucka punks like a Hurricane Bundy\nAnd for the rap race place your bet on the King\nI run like Quicksilver, fly like I had wings\nTo you it seems like that I'm braggin a lot\nBut I'm saggin a lot, because money I got\nI'm the MC dismantler, lyrical manipulator\nEightball drinker, the new cool innovator\nI'm King Tee, Keith Cooley is the DJ\nNo fakin or frontin, turntables do what he say\nCuttin like a ginsu, makin bets against you\nThe girlies go wild, Keith prove that he can dance to\nFila we wear, won't promise or swear\nDon't get too much comp cause MC's I tear\nIn half, and laugh, cause it's just so hilarious\nTo walk in a jam, and see the most scariest\nPunks in my way, tryin to see how I play\nI know they eat more rhymes than horses eat hay\nBut I keep my cool cause see like, that's my image\nStroll like a gangsta think you lost when I finish\nGrab me a skeezer, head towards the booth\nCause I'm not only a King, I'm supreme.. and I'm cool!\n\n{*DJ scratches*}"}]}