{"songs": [{"album": "The Rebirth of Detroit", "year": "2012-06-12", "title": "Dillatroit", "image": "https://images.genius.com/ae7be829dd6f92a932ec9369d9249289.1000x1000x1.jpg", "lyrics": "[Verse 1: Supa Emcee]\nY'all wanna bite and sample him\nScreaming, \"I got tracks by Dilla\" (Nigga)\nNigga, Charles Hamilton\nLying for the camera, damage you, Jeru\nBeat a nigga red 'til he think he Blood or Piru\nOn the internet like you know Ma Dukes\nWell Ma Dukes'll probably puke at the site of you\nMotown rebirthed a monster, no baby food\nStill a nigga throw fits like babies do\nBoost my heart, this is for the Yancey team\nI wrote these words like James Yancey theme\n(Give 'em horror Sup!)\nRetribution, reverts behind a true score\n(Scream!) Nigga, this Dilla music\nSomehow the drum and hi-hat makes me abuse it\nFor Jay Dee I'm a soldier, every sound's a movement\nGeneral selector, army platoon shit\nWelcome to Detroit, welcome back to the unit\nJay Dee said get 'em, nigga you getting bullwhipped\nSet yourself to fall in love, nigga get poolsticked\nRest of your sins baptized in the pulpit\nDilla donuts get worldwide spins\nHundred percent Jay Dee, no Dilla pretend\nTry to duplicate the trend, hope that Jay Dee'll send\nAll you Dilla stealing niggas, here's Jay Dee's revenge\n\n[Hook]\nIf you could make music for the world, who would you be?\nHow would it sound? How would it feel?\nWould it make you think of Motown and the heart that pound\nThe beat in the street, Dillatroit this is 313\n(Repeat x2)\n\n[Verse 2: Nick Speed]\nRebirth motown, reassemble, recharge, recorded, relit, rekindled\nI'm known to see different, you glow and we glisten\nBreathe the scent and represent\nGet choked for remixing, ego, we divided\nI just washed the seam to the skull he provided\nIt's all in the news, you can go read about it\nThe more people hear Jay, the more he deposit\nHey Jay, they trying to eat off your name\nDoing new things and it ain't even the same\nThe king with a board, they trying to figure you out\nStart with a dream and then you invent a new route\nUh, it's powerful how it came together\nHit record in the zone and it stay forever\nTimeless, I see it day and night\nEverybody leave, then they coming back trying to make it right\nEcstasy and pain, ultra hard, dramatical\nWe bogart a attitude, old scars get tatted too\nCome from the Hart Plaza, murder car capital\nBroken dream boulevard, heard it all avenue\n\n[Hook]\n\n[Verse 3: Guilty Simpson]\nA new beginning, focused on the dime in the year\nIt's no ending, things never seemed so clear\nI take a second reflecting on the way stuff was\nWas it hate, or was they giving me tough love\nI don't know, still it made me who I am\nNow I'm back, ready to pursue my plan\nAnd now I'm back, ready to renew my stance\nAnd like that, a nigga feeling new again, uh\nYeah and I'm right back on it\nI'm living the dream with some nightmare moments, uh\nBut everybody has a story in the skyscraper of a building called glory\nWhat's yours?\nMy music allows me to touch yours\nGet called out for encores\nTell me, should I wan't more?\nOf course I should, that's what I'm so charged for\n\n[Hook]"}], "artist": "J Dilla"}