{"artist": "Petey Pablo", "songs": [{"album": "Missing Pages", "title": "T.I. Iz", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "[Intro]\n\n[Verse 1: Petey Pablo]\nVest on\n?? fresh, Holmes\nMatching from the hat to the sock, oh yes y'all\nLooking for the next Broad\nI can take home, give her what she want\nShow her what I'm made of\nCome on, you think I'm rapping for the sake of just rapping\nI'm trying to learn you something, Baby\nHate to throw you off\nWhat I'm doing ain't against the law\nIf your old enough to by a beer from the Bar\nIf your old enough stop, take this couple a dollars\nAnd buy a couple of bottles of Patron and a twelve pack of Corona, for me\nTell the waitress I'm gonna tip her when she get here\nIf she got a problem with it tell her look a here, for me\nEvery nigga in this corner got a pocket full of money\nAin't no bums in this corner, honey\nWhy you think all the eyes is on us\nLike all the eyes is on us\nI ain't never seen it this close\n\n[Hook: Petey Pablo]\nI ain't never been a Ho\nI ain't never been a Trick\nI ain't never been a Rat\nI ain't never been a Snitch\nWhy I tell it like it T.I. is\nIt T.I. is\nIt T.I. is\n\nI ain't never been a Ho\nI ain't never been a Bitch\nI ain't never been a Rat\nI ain't never been a Snitch\nWhy I tell it like it T.I. is\nIt T.I. is\nIt T.I. is\n\n[Verse 2: Petey Pablo]\nI had things in my mouth since 1986\nSo Bitch, don't be acting like \"let me see you grin\"\nI'm a long time Partner, not a Dick-Rider\nGet your people right before you talk that shit\nAnd I ain't dissing nobody\nCause I ain't gotta diss nobody\nNiggas know who the fuck, to fuck with\nYou ain't never heard me spit like I'm spitting\nBut I'm spitting like I'm spitting because I'm sick of this shit\nSee I'll be seventy-five till a nigga come out of his mind\nAnd bust a motherfucker head in this bitch\nLike I ????????????\nAnd Niggas been waiting on this\nNever thought that I would have to do it\nBut now I gotta do it\nCause I'm looking at these Niggas getting pissed\nStreets love Petey same way they love Jeezy\nAnd I ain't never had Jigga on shit\nI ain't dissing, listen\n\n[Hook]\n\n[Verse 3: Petey Pablo]\nPut your money on whoever you wanna put money on\nBut if I want it bad enough, bet you I bring it home\nI ain't the baddest Nigga in the business\nBut I bet you, dog\nYou won't fight your dog for a while when he bite me, dog\nI gotta hell of a lock jaw\nLock on any body part\nAnd I don't give a fuck, I'm gonna scratch every time he turn\nNow maybe you'll learn, ????\nI been holding back out the respect for the children\nTrying to be a role model, but it's just too hard\nThat's a parents job\nI'm sorry, may go home to your Mama, Shawty\nYou gonna listen to the explicit lyrics anyway ain't ya homey\nOh come on, and tell the truth Shawty\nI mean I know you is, cause I know I did when I was a kid\nI ain't give a shit about what Mama and them said\nThey said a hard head make a soft ass\nHad to learn mine so I guess they gotta learn theirs same way\n\n[Hook]", "year": null}]}