{"artist": "Famous Dex", "songs": [{"year": "2018-04-06", "album": "Dex Meets Dexter", "image": "https://images.genius.com/28f937ec280844563aa5e406146b4cab.1000x1000x1.jpg", "lyrics": "[Intro: Famous Dex & Young Nudy]\nYo Pi'erre, you wanna come out here?\nDexter\nAyy, what's up bro? (Hahaha)\nLike, like, I need you to roll some Woods up, you know what I'm sayin'?\nHaha, ya dig?\nDexter, what\nDex Meet Dexter, ya dig me?\nOoh, AP wrist (AP wrist like what)\nWhoa, Dexter, wait (Dexter, yeah, what)\n\n[Verse 1: Famous Dex]\nBaggin' huh (ooh), stackin' (stackin')\nFuck your lil' bitch automatic, huh (I did)\nI got my .30 no lackin' (you what?)\n.40 on me so I'm packin' (whoa)\nCatch me downtown with your bitch (your bitch), she doin' dicks (your bitch, what?)\nOff the coke and shit, man she love the shit, up her nose and shit (ooh, up her nose and shit, Dexter)\nWait, add it, add it, huh (what, ooh)\nSmokin' on Woods, I don't pass it (I don't)\nNiggas broke, they be braggin', huh\nEighty my wrist for the fashion, huh (Dexter)\nHop in my Lamb and I skrrt, huh (whoa)\nBad bitch off the Perc (a what?)\nI put that money her purse (ooh)\nRun up on me put the holes in your shirt, Dexter (yeah)\n\n[Interlude: Famous Dex]\nY'know what I'm sayin'? (Haha)\nLike, like, I just be gettin' to the money, you know what I'm sayin'? (I do)\nY'know what I'm sayin'? Like I got eighty, I really got eighty on my wrist, ya know what I'm sayin'? (80K)\nHa, what, Dex Meet Dexter (haha, haha)\nFuck your lil' bitch whatever\nLike I be talkin' my shit, y'know what I'm sayin'?\n'Chino say talk your shit, it's the album (like talk your shit, Dexter)\nJake roll up woods (haha, what's up Jake?)\nBad bitch lookin' good (ya dig?)\nUh Dexter\nLike wait (uh whoa)\nOoh (yeah, a what?)\n\n[Verse 2: Famous Dex]\nOff it, off it (ooh, I'm off it)\nPop a lil' pill, and I'm off it (you what?)\nGot a lil' bitch up in Boston (uh whoa)\nSwear to god she be ballin' (Dexter)\nLick on that molly, she geekin' (a what?)\nHop in that Maybach, we tweakin' (I do)\nHit a corner for no reason (ooh)\nIce on my wrist, you think I'm anemic (ooh)\nCuffin' that bitch, I'm like for no reason (I don't)\nYeezy my feet, just give me the season (a what?)\nDiamonds yellow like it's peein' (ooh)\nHop in the Ghost, I can't see it (I don't)\nOff it huh, off it (I'm off it)\nSwear to god, bitch you lost it (uh whoa)\nPop a pill, now I'm off it (ooh)\nRun up on him, put him right in a coffin (Dexter)\n\n[Outro: Famous Dex]\nHuh\nKnow what I'm sayin'? (Hahahaha)\nOoh, huh, what, huh\nRun up on him, he lost it\nRun up on him, put him right in a coffin (Dexter)\nNah, like it's the, it's just the Dex Meet Dexter shit\nY'know what I'm sayin'?\nI don't know what's goin' on\nBut look at my wrist, ya dig?\nDexter Meet Dexter\nWhat? What? What?\nOoh, ooh, Dexter, yeah", "title": "DMD"}]}