{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f5e81e5d5f74cbb217e8988eb2ac58e7.400x400x1.jpg", "title": "My Chrome", "year": null, "album": "The Killer", "lyrics": "[Intro - Killer Mike]\n(You don't have to go home)\nOne time, one time - one time, one time\n\n[Verse - Killer Mike]\nEasy, that cush shit got me sleepy\nRollin down 85, leaning but I ain't weaving\nMan you, should stay a day in the A\nA parade of them chevelots, the colors of flavor aid\nCan you, believe I got it made\nImpala in the garage, got Forces and all the J's\nI'm leaning back, ride shotgun in the Chevy with the homeboy burning sacs\nWe heading to the spot where we get down, nigga where the bitches at\nIf they talking right, acting right, walking right\nDown to take flight, they ain't gotta go home, they can stay the night\n\n[Hook]\nYou don't have to go home\nYou can stay right here, put one in the air\nWhile we're bending corners on my chrome\nSame shit another year, in the southern hemisphere\nWait a while, you don't have to go..\n\n[Verse - Killer Mike]\nNigga hold up, hold up\nMake sure they see you when you roll\nHop out that truck all ready fucked up\nToe up from the motherfucking blow up\nFrom the floor up, to the ceiling\nSmoke kiss in the walls in the top of the building\nLile momma's on e, sitting next to me\nShe's catching a feeling\nAnd I'm feeling, like I'm 'pose to\nI'm as fly as a Jordan poster\nI'm leaning and breathe smelling like hen and a mix of hydroponic\nBy the the time my click find me in VIP I'm lost in a cloud of chronic\nHad sex with the best, got head from the rest\nMotherfucker believe I done it\n\n[Hook]\n\n[Verse - Big Boi]\nHot Tub Tony, sucka free and still bubblin\nTruck still rattling and bumping now move something\n\n[Verse - Killer Mike]\nHold up Big Boi! I'm still weed crumpling\nThe sac keeps shaking and block keep jumping\nLay back, lay back, treat this eight six cut like a Maybach\nHey show these suckas that after 50 million sold\nDaddy Fat Sacs still where the hood at, hood at\n\n[Verse - Big Boi]\nHood rats and decoy b-boys understood that\nWhether its creme de la creme, where the good at\nI got it in that 1.5, I had to put the swisha down cause my lugs got tired\nNow lets ride, lets ride\n\n[Verse - Killer Mike]\nBack down 85, five\nWith the click in the truck, full of chicks in the back of the 6\nNobody going home tonight\n\n[Hook]\nYou don't have to go home\nStraighten up your hair, you don't need a mirror\nYou can fix your makeup in my chrome\nSame shit another year, in the southern hemisphere\nWait a while, before you don't have to go..\n\n[Bridge]\nAhh! It feels like ecstasy\nThe sound, whoa! feels like ecstasy\nOooh.. oohh! feels like ecstasy (feels like ecstasy!)\nThe groove, takes control of me\n\n[Hook]"}]}