{"songs": [{"title": "Personality", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Hook 1: Lil Dicky]\nWe ain’t ever been the motherfuckas\nThat could get a hundred-fifty bitches on deck\nWe the type of dudes that be putting in the effort\nJust to show them that we better, get the broads like that\nIt’s how we do it!\n\n[Ad-Lib: Lil Dicky]\nHey bitches\nUh, I know I can be a little bit much sometimes\nBut really I just do that shit for the fellas, you know\nI rap for the fellas but like, this is for y'all\n\n[Hook 2: Lil Dicky & T-Pain]\nI ain't even strong like that\nSo average, I ain't tall like that\nWe just tryna show a little respect, maybe you'll go for it\nI’m the one that you need and you just don't know it\nWe ain’t never been ballers\nBut we getting pussy with our personality\nWe getting pussy with our personality\nWe getting pussy with our personality\n\n[Verse 1]\nHonestly I’m like a seven with my hair long\nMaybe seven and a half facial hair strong\nBut I make these bitches laugh and I care for them\nI’m the type of motherfucker pulling out the chair for them\nI ain’t ever been the G at the bar\nThat get them bitches hella wet just by seeing his arms\nYou know the boy about the leg work\nI plant seeds, I’m a mexicano gardener\nAll I’m saying is I ain’t playing the game with these bitches, I ain’t mean to em\nI prefer to show them everything that I can mean to them\nLil Dicky thrive with a friend of a friend\nAnd I never hesitate to tell them that I love Rent\nI am not a stud, I’m a boyfriend (yo)\nI love love and I cuddle for enjoyment (I do)\nMy dick small but i’m telling you it’s nothing\nBy the time that we fucking they so emotionally interested\nThey really be cumming\nDrinking champagne, oh you trying to dance babe\nWe can hit the floor I’m bout to show you how the man shake\nWe can make a handshake\nKeep you safe and walk you to your damn place\nThen I got you bouncing on my rubber like a trampoline\nWhat you doing tomorrow? I’m with it\nI’mma take you to the zoo and be cordial and witty\nI’mma tell you hella stories and be mindful\nBet you get a little horny like the infant Rhinos\n\n[Hook 2: Lil Dicky & T-Pain]\nI ain't even strong like that\nSo average, I ain't tall like that\nWe just tryna show a little respect, maybe you'll go for it\nI’m the one that you need and you just don't know it\nWe ain’t never been ballers\nBut we getting pussy with our personality\nWe getting pussy with our personality\nWe getting pussy with our personality\nWe ain’t never been ballers\nBut we getting pussy with our personality\nWe getting pussy with our personality\nWe getting pussy with our personality\n\n[Hook 1: Lil Dicky]\nWe ain’t ever been the motherfuckas\nThat could get a hundred-fifty bitches on deck\nWe the type of dudes that be putting in the effort\nJust to show them that we better, get the broads like that\nIt’s how we do it!\n\n[Verse 2]\nWhen I get your GChat, that’s a wrap, ho\nSmoke weed, eat the pussy like a snack, ho\nDave lays you on top like a rap though\nBet you think I’m nice in person I ain’t talking rap shows\nI ain’t gonna pick you up at the club\nBut if I get about an hour with you, bet you in love\nI’ll ask questions\nOh you did your hair? Little Dicky pay attention\nOh you getting scared, what’s the root of all this tension?\nYou know I’d be a hell of a date and if you torn I will split the entrees that you crave\nAnd when you bored I can send you Snapchats for days\nAnd make them personally for you like they all will be based\nAround the inside jokes we develop in time\nAnd if you tired won’t initiate the sex it’s fine\nI can talk you on the phone when you driving alone\nAnd make you feel comfortable enough to take me to mom\nAnd that bitch gon love it, she gon' tell your ass\n'He legit yo hubby', she gone tell your ass need to quit your clubbin'\nAnd go get that young'un while I’m sitting with your dad being slick straight grubbin'\nI can take you out to brunch, call me hollandaise\nKnow exactly what you want every holiday\nI can text you like a motherfucker, wordy and impressive\n57 on the ketchup, hit you when you coming through\n\n[Hook 2: Lil Dicky & T-Pain]\nI ain't even strong like that\nSo average, I ain't tall like that\nWe just tryna show a little respect, maybe you'll go for it\nI’m the one that you need and you just don't know it\nWe ain’t never been ballers\nBut we getting pussy with our personality\nWe getting pussy with our personality\nWe getting pussy with our personality\nWe ain’t never been ballers\nBut we getting pussy with our personality\nWe getting pussy with our personality\nWe getting pussy with our personality\n\n[Hook 1: Lil Dicky]\nWe ain’t ever been the motherfuckas\nThat could get a hundred-fifty bitches on deck\nWe the type of dudes that be putting in the effort\nJust to show them that we better, get the broads like that\nIt’s how we do it!\n\n[Outro/Ad-Lib: Lil Dicky & T-Pain]\nWhoo! Lil Dicky\nYes sir!\nT-Pain. We gon' get them hoes some day man\nI hope so\nWe're going places\nLike together?\nNot on a date but we're going places\nOh, okay\nFor instance I saw a nice looking young lady that I was attracted to sexually in the grocery part of Target\nSure\nAnd I wanted to put my penis in her vagina\nOkay\nBut I didn't tell her, and that my friends is the definition of a motherfuckin' gentleman"}], "artist": "Lil Dicky"}