{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Intro: Young Thug & Rich Homie Quan]\nB-O-S, man\nT-O-N\nGoose with another one\nSippin' out the tea cups, udigg?\nI wanna know why she's so fresh\nYeahhh\nGoose got another one!\nHey!\n\n[Verse 1: Rich Homie Quan]\nGot this bitch who want a Yorkie so I flew her to New York\nI been ballin’ lately, another league, I know that won’t stop\nWhat did I do to you to make you feel like this?\nPercocet, might pop a pill right quick\nLike I can’t feel my soul, and I can’t feel my face, girl\nTell me why you told them broke bitches our business\nThey don’t care nothing bout your feelings\nThey don’t know shit that we go through\nThey don’t even care, cause they not there for you\nThey just want your money, baby, get that through your skull\nThey gon’ strip you for everything you got, you gon’ swear that ass was new\nI won’t give you no hassle, baby\nIf you’re feelin’ like it’s too much take that shit back like Devin Hester, baby\nGrey hair, ain’t gon’ stress you, baby\nHouse so big, no neighbors near me\nAnd I ain’t lying, believe me for that\nBaby girl just trust me\nLove me for everything I got\nEverything I got (hold on, D voice)\nAye!\n\n[Hook: Rich Homie Quan]\nEverything (hey) I got, everything (hey), everything (hey) I got\nEverything\nEverything (yeah) I got, every single (yeah), everything (yeah) I got\nEverything\nEverything (aye) I got\nEverything\nEverything I got, I got it on my own (everything)\nEverything\nEverything I got (woah), I would say everything I got (woah)\nEverything\nEverything I got (woah), I would say everything I got\nEverything\nI give my praise to God for everything I got\nEverything\nEverything\nEverything, everything, everything, everything\nEverything that I got\nEverything, everything, everything, everything\nEverything that I got\nEverything, everything, everything, everything\nEverything that I got (woah)\nEverything, everything, everything, everything\nEverything that I got (woah)\nEverything, everything, everything, everything\n(Woah)\n\n[Verse 2: Rich Homie Quan]\nMo money, mo problems\nMo’ problems mo’ money\nWhen I was broke ain’t have no problem\nCause these folk wasn't stuntin’\nI couldn’t get nothing from nobody\nCause no one would trust me\nI was live with the hard bad ache\nAin't nobody bluff me\nI have my money, I have my ho\nI myself, I won’t fuck around with these fuck niggas\nBut I know they have my back\nAnd I know that I made it, keep my trust in God\nI know I can’t fall cause I got\nMoney to the ceilin’, they don’t know about it\nThat pot drive with no sittin’s they don’t know about it\nShawty thick as fuck, them jeans she pokin' out em\nI just don’t want talk about it\nGo-go gadget, go about it\nI don’t want no clique, eh\nIf ya ain't gon’ stay-aye\nWith me for the rest of the night\nLost mind right then I had to get a shrink (pshh stop)\nThought I was crazy, I had you thinkin’, yeah\nThose diamonds I got em blinkin', ooh’\nNo soft boy, I feel like mean it\nAyy ayyy ayyayyyy\nYou betta than me, fill the life I fuckin’ play ayyy ayyyyy\nEvery bitch I fuck fall in love\nEvery nigga gon’ hate, I don’t give a fuck\n\n[Hook: Rich Homie Quan]\nEverything (hey) I got, everything (hey), everything (hey) I got\nEverything\nEverything (yeah) I got, every single (yeah), everything (yeah) I got\nEverything\nEverything (aye) I got\nEverything\nEverything I got, I got it on my own (everything)\nEverything\nI give my praise to God for everything I got (woah)\nEverything\n(Woah)\nEverything\nEverything that I got\nEverything\nEverything that I got (woah)\nEverything, everything, everything, everything\n(Woah)\nEverything that I got\nEverything, everything, everything, everything\n(Woah)\nEverything that I got\nEverything, everything, everything, everything\n(Woah)\nEverything I got", "title": "Everything I Got", "year": "2014-09-29", "image": "https://images.genius.com/07e1a913522c1d895f518d7ebf9ad7f0.640x640x1.jpg", "album": "Rich Gang: Tha Tour Pt. 1"}]}