{"songs": [{"title": "N.Y., N.Y.", "album": "Return of the Darkman", "year": null, "image": "https://images.genius.com/ffc48cdf9440941e0fd4bf0d068c90af.400x400x1.jpg", "lyrics": "[La the Darkman]\nMy street filled with guns, snakes, crack and buddha\nFake ass women, and tech, sharpshooters\nDrinkin' Tangeray drunk, they slam the lobby door\nUneducated thugs, with nothing to live for\nGrew up, holdin' steel to acquire a mil'\nCuz bullets prevent life like birth control pills\nWho keep it real? Cut you open like a Navy SEAL\nMy niggas had bricks and whips, since Bill Build\nAnd it's nothin', I really don't do no stuntin'\nIn my hood, muthafuckas get shot for frontin'\nAnd I'mma witness to that, seen them pistols react\nFire comin' from the barrel, as I'm snappin' back\nLeave your ass layin' flat, as a welcome mat\nThink it's a game, til you hear them shits go BRRAT\nBRRAT-BRRAT, and it dont' stop there\nNiggas rarely run, even when the cops appear\n\n[Chorus 2X: La the Darkman]\nNew York, we sling drugs out of bodegas\nNew York, hustlers, thieves, crooks and beggars\nNew York, fly planes through buildings, my pleasure\nNew York, come to your town, take your whole treasure\n\n[La the Darkman]\nFrom Brooklyn to L.A., out to Michigan\nHad so much coke, thought I was Dominican\nThen I got greedy, and started robbin' again\nYou heard the stories, about Al 'Po, Rich and them\nSame shit, different characters, for that asparagus\nI'mma real bulldog, like Jim Harrick was\nBreakin' all the laws, like he was taught\nIt ain't abouot breakin' rules, it's about gettin' caught\nYou heard of Vinny the Chin, remember John Gotti?\nOr Carlo Gambino, and all the niggas that they bodied\nFor that paper work, we lay you in the dirt\nFully dressed, chain, watch and nice shirt\nI gives a fuck about material shit\nCuz you can't take it with you, after your brain split\nExcept in your casket, you still lookin' good\nAt you funeral, dead, as will, you should\n\n[Chorus 2X]"}], "artist": "La The Darkman"}