{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "Get it, Get It", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "[opening skit for 12 seconds]\n\n[Pacewon]\nAiyyo 56 Ruckers, we bust kids, fuck it\nShow 'em what's up with a slug on the thug tip\nRugged lil' culprit, hit you upside your\nNugget for the ducats, blood come in buckets\nMight stain your Chuckers, reverse up a 1-way\nDumpin from a Cutlass, whattup bitch?  Fuck this\nWear that well, I hope the slug hit your mug\n'til the pulp is leakin out your skull, I'm occultist\nPump this in your whip, niggas love this\nJustice for all my black men that was this\nOr still is this, they my cousins, buggin\nSeperatin women from they husbands\nI govern the block while I'm bubblin\nHustlin hard on the job like I'm muggin\nBut I'm rappin, I'm like a oven\nTurned up to broil kid, don't get shoved in\n\n[Hook 2X: Pacewon]\nYou could get it get it, if you want it want it\nYou could get it get it, if you want it want it\nIf you 'bout it 'bout it, there's no doubt about it\nYou're the one they doubted, now you're the one that's whylin\n\n[Pacewon]\nAiyyo 9-M stay on the waist, son\n(Like y'all can't fuck with Pace-Won)\nBe careful, brothers don't step because most be scared to\nCause the next thing they see me\nIn all three rearview mirrors straight comin at 'em\nI'm a quarterback, watch me run a pattern\nL swing strike 45 one\nThat means I bring like 45 guns\n45 pumps, Gordy like what\nBefore we light up, shorty might run\nCause Pace make you short out 83 circuits\nI'm Michael Myers, she Jamie Lee Curtis\nHit 'em with a whip, then I blast through shades\nLike \"Indiana Jones and the Last Crusade\"\nBut this ain't the \"Lost Ark,\" I ain't Harrison Ford\nI'm the rude MC that be embarassin broads, like\n\n[Hook]\n\n[Pacewon]\nI'm a product of hip-hop!  And stereo stealers\nMy area's ill as serial killers\nLike Sam Berkowitz and old Charles Manson\nMickey move bars with broke broads dancin\nTippin that tight light-skinned sexy mama\nIn a past life she was Jeffrey Dahmer\nHangin with pimps and relentless suckers\nDown for life like the Menendez brothers\nRugged lil' princess a thug might find\nBuck up in the club like Shyne\nThat's what she does, I'm out her holdin down ya speakers\nEvery whip need us, so throw your dick beaters and\nSing along with the king of the Bricks\nThat don't care like sit on my dick!\n\n[Hook]", "year": null}]}