{"songs": [{"lyrics": "[Jay-Z]\nThey don't be knowin' the way I be flowing\nWhen I be going, I be running the track like Jesse Owens\nI disrupt the natural scheme, the way that you do things\nWit a swing and have 'em rockin like, Sting\nYou say never, you run, if ever you come\nIt's never you run so fast in your life to never have won\nCome on and ride the rhythm, I produce like jizm\nJust like the Gods I start with knowledge and follow with wisdom\nFor greater understanding, I'm landing, blows, and\nKnocking sense into those that oppose me, ha!\nEnticing when slicing through tracks\nYou're screaming, \"Jesus Christ is back and God knows he can rap!\"\nMe and Sauce put rhythm on the map, so give him his dap\nAnd me, I just take mine, gimme those, gimme this, gimme that, FUCK that!\nGimme love, nigga...\nSauce Money in the house like...\n\n[Sauce Money]\nI don't never plan to fall! Sauce is all-out or nothin, I brawl\nDrag niggas like RuPaul\nWith the funky drummer drumming, I'm never slumming\nI summon orgasms so I can show you how I'm coming\nI bang boots, dispute ranks, and execute ganks\nTo bank loot, while your mind shoot blanks\nDig it, fatal since I was prenatal\nAble to drop heavy since the cradle\nCooking biters who nibble on my hooks get 'em deep in the files\nA Boyz n Da Hood, watch the Fish-burne from furious styles\nNever was right but I made it through wrong\nSaid we waited too long went back in the lab and created new songs\nNew styles I stock 'em for new chicks to jock 'em\nYour group when I rock 'em once, spiders watch to clock 'em\nA cut and above the best street life struttin to show\nPut 'em to the test cause we ain't got nuthin' but love\n\n[Jay-Z] (Sauce Money)\nTo all my grimys in Crooklyn - (Nuthin' but love)\nAnd all my peoples Uptown - (Nuthin' but love)\nAnd all my niggas all around - (Nuthin' but love)\nTo all my peeps in hell - (Nuthin' but love)\nBitches who fuck and don't tell - (Nuthin' but love)\nFor all you niggas that's WACK! - (Nuthin' but love)\nFor keeping our shit FAT! - (Nuthin' but love)\nSauce Money, Jay-Z (Nuthin' but love)\nHere we go again\n\n[Sauce Money]\nWhat you about to feel, you can't doubt the real threat\nPeace to all my niggas without a deal yet\nAnd that's comin from the streets cause we ain't got nuthin but love\nPeace to the brothers who keep us in ghetto blood\n\n[Jay-Z]\nHere's a stamp and seal away, we build, fuck the tramp\nWho got my man knocked, for real, ain't nuthin' but love, champ\nThe Jigga, Sauce Money representin one time\nStrike three, we out, but never out of your mind", "title": "Nuthin’ But Love", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}