{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Chorus: Krizz Kaliko]\n(Holla-holla-loo-yuh)\nI am rap's big swinging ding-a-ling, make 'em sing\n(Holla-holla-loo-yuh)\nI am everything you ever were afraid of\n(Holla-holla-loo-yuh)\nI am rap's big swinging ding-a-ling, make 'em sing\n(Holla-holla-loo-yuh)\nYeah, you rappers bore me, I wanna kill you\nDo it for me and I'll holla-holla\n\n[Verse 1: Tech N9ne]\nI am the pinnacle of sin, it shows when he begin his flows\nTimid women show genitals, then it's \"go\" when it's presentable\nFinna show women some in this moment diminish whores\nSkin it, no gimmicks, replenish, no - grim No Limit shows\nCall it what you want it\nMiddle finger my opponent, really seem defiant, don't it\nOne moment, I will demolish niggas with the rawest scriptures\nY'all is just balls of shit in a stall, let's hit, this be the hardest pisser\nThen a tramp will tell me, my piss enhance her belly\nBut I chose to give her a dirty mouth like Lisa Lampanelli\nYes, she demanded jelly, but I re-ran the Kelly\nI'm springing the yelly and it's swell because I slammed the Belvy\nI'm a monster, on the mic or when I'm on her\nHave a motherfucker somber, 'cause of ill shit that I conjure\nJuggernaut, he never conquered, if she wants for me, I haunt her\nWondering where we've gone, sir R.A. and Tech, yeah we bonkers\n\n[Chorus: Krizz Kaliko]\n(Holla-holla-loo-yuh)\nI am rap's big swinging ding-a-ling, make 'em sing\n(Holla-holla-loo-yuh)\nI am everything you ever were afraid of\n(Holla-holla-loo-yuh)\nI am rap's big swinging ding-a-ling, make 'em sing\n(Holla-holla-loo-yuh)\nYeah, you rappers bore me, I wanna kill you\nDo it for me and I'll holla-holla\n\n[Verse 2: R.A. The Rugged Man]\nYo, it's a brutal system, assume position\nYou superstition? Or Jew or Christian?\nSchool religion is a cruel depiction\nThey can blind your hearing, they can mute your vision\nLive in the dirt, burn, slithering earth worm\nLeave you like MJ with a hit and a burnt perm\nSoon to be unity, murder me, what could you do to me?\nThis is foolery, I'm a hooligan, leaving you drooling\nWhen I'm beating you brutally, slappin' your bitch and takin' your jewelry\nYour mama crying when she reading your eulogy\nLet me slow down, put your dough down\nI've got enough flow for it to go 'round\nThis is profound, you a broke clown\nWith a coke frown and an old sound\nI'm like \"sell 'em the heroin and givin' 'em the needle\"\nI'm in your cerebral, this wigger is evil\nLimit the people, piss in a cathedral\nAborting your mission like a position that's fetal\nMy impolite stares give 'em nightmares\nBurn 'em like the bush, give 'em white hairs\nJiving and shucking your ass, sufferin' succotash\nI fuck with the gutter trash, don't fuck with the upper class\nSellers and buyers, political liars\nThe drug suppliers, the fake Messiahs\nIs it negative energy hiding their identity?\nEvery enemy wishing they were shooting me like a Kennedy\nI spit at Satan and I kick his face in\nMake him lick the pavement for misbehaving\nYou got a vendetta? Better be ready to forget it\nBullets is headed to your head and embedded, the slug met it\nI be tripping on my ego like I'm Ultra Magnetic\nI'm makin' dollars like I'm Parrish and Erick\nI'm back, check it bitch\n\n[Chorus: Krizz Kaliko]\n(Holla-holla-loo-yuh)\nI am rap's big swinging ding-a-ling, make 'em sing\n(Holla-holla-loo-yuh)\nI am everything you ever were afraid of\n(Holla-holla-loo-yuh)\nI am rap's big swinging ding-a-ling, make 'em sing\n(Holla-holla-loo-yuh)\nYeah, you rappers bore me, I wanna kill you\nDo it for me and I'll holla-holla", "title": "Holla-Loo-Yuh", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}