{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/2acfbd7a3be7103656da692dc5322501.800x800x1.jpg", "year": "2018-04-27", "album": "See No Evil", "lyrics": "[Intro: Big Freedia]\nI wanna know who mothafuckin' representin' in here tonight\nHold on, hold on\n\n[Pre-Chorus: Lauryn Hill & Drake]\nI keep lettin' you back in (you back in)\nHow can I, explain myself?\nMurda on the beat\n\n[Verse 1: YFN Lucci]\nEverybody get your motherfuckin' roll on\nI know shorty really hate it when I prolong\nI'ma take her ass to stay, she cut off both of 'em\nGo 'head and get loose, girl we both grown\nI'm in her inside, way passed the navel\nLook like a full court slam cross that table\nI'm a boss girl, what you got to pay for?\nPhone bill, car note, everything I paid for\nAyy with your phone out, dancing like you J. Lo\nGot your hand out but you don't want no paper\nYou just showing off, that new ring I bought\nGirl show it off, 'cause it's alright\n'Cause it's your life, ayy, huh\n\n[Interlude: YFN Lucci]\nUhh, yeah\nWant you to care for me, care for me girl, uh, uh\nHow I care for you\n\n[Verse 2: YFN Lucci]\nOkay it's your life\nYou know it's your life\nYou got a man but you know that nigga nothin' like me\nI got a plan and I need you just for one night\nI'm tryna slam dunk in that pussy, like Mike\nI'm tryna put that girl to bed like night-night\nI'm tryna put some diamonds on her, have her light bright\nI'm talking sunlight\nYeah, sun nice\nYeah, you ain't none like me\nYou ain't none like me\n\n[Interlude: YFN Lucci]\nUhh, you gotta be nice for what? (you gotta be)\nShe know you really pipin' up, ayy, uh, uh, yeah\n\n[Verse 3: YFN Lucci]\nOkay, I like her, cute, right, she a nice girl\nI'ma wife her, fly her, every damn where\nAin't gon' lie, glad I got her, shorty piped up\nAnd ain't gon' lie, every time we fuck\nI got to tell her, uh\n\n[Outro: Drake]\nGotta make that jump, gotta make that, gotta, gotta make that\nGotta make that jump, gotta make that, gotta, gotta make that\nGotta, gotta, gotta g-g-gotta, g-g-gotta, gotta\nGotta, g-g-gotta, gotta, gotta make that jump, jump (let's go)\nBend it over, lift it up, bend it over, lift it up\nMake that jump, jump\nBend it over, lift it up, bend it over, lift it up\nMake that jump, jump\nBend it over, over, over, over, over, lift it up\nMake that jump, jump\nBend it over, lift it up (make that jump, jump)\nBend it over, lift it up (make that jump, jump)", "title": "Nice For What"}]}