{"songs": [{"image": "https://images.genius.com/95fdca22fad76fdc39f51d7f6df63546.600x601x1.jpg", "year": "1995-06-06", "lyrics": "[Girl]\nHi daddy, it's Nicole\nWhen are you coming home?\nI miss you baby\nI hope you're havin some nice fun\n\n[Chorus]\nI been around the world (what?) and it's A Million Girls (true)\nI been around the world (what?) and it's A Million Girls (true)\nI been around the world (what?) and it's A Million Girls (true)\nI been around the world (what?) and it's A Million Girls\nA Million Girls\n\n[AMG]\nYo it's funny, hoes wanna give you they heart\nWhen your jam's at the top of the charts\nBut you can't play me like a game of spades\nCause the A.M. is afraid of babes\nI seen many come and I seen 'em go\nI came with a few and released my flow\nI'm back, but without the booties I'm chillin\nI used to get that feelin I'm stackin A Million\nNow baby, I'm used to the hoes and tramps\nLivin in the home of the one night stand\nJump in the ride, then I'm dickin you down\nYou couldn't tell me nothin, I was more than a hound\nRedbones and jiggable pies, big booties in the thighs\nLong haired freaks with pretty eyes\nI was on the road, ballin' outta control\nPockets on swoll, then I lost my soul\nNow give me that joint to hit\nEvery girl was a bitch and a bitch ain't shit\nThe world was a pussy and it's all for my dick\nI had it goin on, then I started to slip, why?\n\n[Chorus]\n\n[AMG]\nIt used to be a three-oh-fo' thing, a big ol' hoe thing\nState to state, fly hoes to mate\nUp under the covers, lover lovers with rubbers\nIf they knew my name, then they knew my fame\nAnd the game was tough, didn't know who to trust\nLove wasn't a must, just a cutie to bust\nAnd it got kinda lonely, cause they really didn't know me\nBut they knew I was the one and only, and\nWhat goes up, must come down\nAnd when it came down, nobody was around\nThe freaks and the fleas and the G's was gone\nNo crew, no boo, so I sing this song and uh\nI gotta get back on track\nCause a nigga didn't know how to act\nLivin in the fastlane makes you go a little\nInsane in the brain, but it's all the same\n\n[Chorus]\n\n[AMG]\nNowadays, I'm lookin for the one love shot\nNot with me cause of what I got, or what they think I got\nCause some ladies wanna choose and abuse\nBut I ain't gettin used, like them other fools\nBuyin cars and, treat 'em like movie stars\nBaby do you even know who you are?\nYou can't step to the A.M., and think you gon' play him\nI ain't sayin no names, but I probably should say 'em\nAnd a lot of y'all probably can't handle this\nCause you don't think y'all act scandalous\nAnd you never been checked like this\nSo when I'm gone, baby you can reminisce\nBut really though, you're just a silly hoe\nAnd you gots no shame, and you to blame\nBut you're young, and you're full of cum\nAnd they say, \"Go on girl\"\nBut bitch I been around the world\n\nI been around the world..\nI been around the world..\n\n[Chorus 1.5X w/o \"what\" and \"true\"]\n\nI been around the world..", "title": "Around the World", "album": "Ballin’ Outta Control"}], "artist": "AMG"}