{"artist": "Isaiah Rashad", "songs": [{"title": "Shot You Down (Remix)", "lyrics": "[Produced by Chris Calor and The Antydote]\n\n[Verse 1: Isaiah Rashad]\nI take a drag at the square, I feel anxious, spit dangerous\nAs the verbal appears, it's reflectin' my perspective\nBeer goggle and fear, role model so hollow\nShadow adolescence and a gaggle of them bitches\nRoad to the rich is still paved with the ditches\nGet caught up in the hype, your career is for a night\nI ain't these other niggas, 'cause these niggas is fake\nThey ain't poppin' shot, these niggas is Papa Doc\nFine as the shine, beam me up, and I'm ridin' Spock\nNo cryin' 'til I'm in a pine box\nI got the bitches hittin' Mikey like where Zay at?\nProlly fuckin' on her friend, prolly L.A. at\nProlly plottin' on a mil', stayin' well fed\nBitch, don't run your mouth, we don't play that\nMomma taught me better, can't count on niggas\nCan't count on weather – go figure, nigga\nThey ain't worried 'bout this cheddar\nThem niggas just sky divin' in my propellers, I don't feel 'em\nAin't tryna be no freshman, I'm chillin'\n'Cause they'll bring a knife to the fight, and I'll kill 'em\nMe and my niggas is hungry, we're willin'\nTo bring a little ho to the party and Meek Mill 'em\nYeah, I feel like talkin' my shit\nCome in the house, actin' friendly, you can suck my dick\n\n[Bridge: Isaiah Rashad]\nI'm prayin' for some good rappers and a Fleetwood\nWhy I gotta bring my A game? You just D goods\nWe don't wanna hear that weak shit, nigga, speak up\nRockin' old flows, cornrows, and a beeper\nYou niggas hoes, you niggas hoes, and I ain't even trippin'\n'Cause we'll be laughin' to the bank and ridin' by these niggas\nMikey, bring that mink with your low body Bentley\nPut the hood in the fuckin' trunk and bring the party with me\n\n[Chorus: Isaiah Rashad & Jay Rock]\nI came, I saw, I conquered, ayy – I shot you down\nNow your brain no have no conscious, ayy – what you do now?\nNow, I came, I saw, I conquered, ayy – I shot you down\nNow, I bang, I bang, I blocka, ayy – what you do now?\nOh, bitch-ass rappers, ayy – I shot you down\nNo sensitive niggas, ayy – I shot you down\nNo bitch-ass rappers, ayy – I shot you down\nNo Hypebeast pussies, ayy – what you do now?\nNow, I came, I saw, I conquered, ayy – I shot you down\nNow your brain no have no conscious, ayy – what you do now?\nCheck, check, one, two, what's up?\nNow, I came, I saw, I conquered, ayy – I shot you down\nIt's Rock, yo, yeah, what's up?\nNow, I bang, I bang, I blocka, ayy – what you do?\nYeah, look\nDon't make a sound\n\n[Verse 2: Jay Rock]\nEverything takes time\nIs you sellin' or you buyin', nigga? Get rich or die tryin'\nYay Yay on the stove, I had the choppers in the Cutlass\nJust a young nigga tryna get some hundreds\nI had a little bucket – yeah, I rode it like a Benz\nYeah, I spent my little ends on that Butlass\nTell me, who you trust – look, I got my faith in God\n'Cause these clown-ass niggas all busters\nThese niggas not Jesus, they ain't gon' die for you\nAnd only time will tell what's gon' lie for you\nIt's funny, right? What a couple lies will do\nBut seein' is believin' what defines the truth\nI keep shooters on the wing when I'm ridin' through\nAnd if niggas out of bounds they gon' probably shoot\n(Block, block) 'Cause killing is the hobby\nEastside niggas, yeah, we known for catchin' bodies\nI used to have a deuce five ridin' on the trolly\nOn my way to school like dare, nigga, try me\nLook, 'cause where I'm from, I'm a blood on an island\nSurrounded by blue water, sharks all around me\nPigs on my ass, hoes tryna drown me\nNiggas know I'm up, so these haters wanna down me\nNiggas know I'm king but they don't wanna crown me\nIt's okay, I ain't 'bout to whine about it\nLook, a real nigga for real nigga, now check it\nI'm still here, I'm still counting my blessin's\nWith no chains on, with no rings on\nWatchin' these fake rappers, gettin' my aim on\nPop a shot, kill 'em all (kill 'em all)\nAnd watch 'em fall like confetti, fuck 'em all (fuck 'em all)\nIt's just me and my niggas, we takin' over the game\nAnd since I conquered this craft, nothin' will be the same\n\n[Verse 3: ScHoolboy Q]\nNot a dollar on me, this home invasion a payday\nTwo-time felon, they jerkin' me on my pay rate\nSlavin' all these hours but couldn't shake that my rent late\nMakin' eight a hour, I'm leanin' towards my AK\nMoms thinks I'm vicious, don't want me 'round the kitchen\nMy livin' room, bathroom, my bedroom was evicted\nMissin' from your homeroom, my good grades was crippin'\nBefore I even learned division, nigga, I learnt the mission\nSee I'm from where fiends scratch that itch, won't hit the lotto\nAnd I'm from where fiends fix that fix and not a bottle\nAnd that little nigga that missed that bottle gon' catch a hollow\nOr maybe even throw him pyro, pyro\nSee this set don't make too many niggas rich that I know\nYou either gang bang, sell dope, or bet on the four\nSeen money on the ground, my eyes glued to the floor\nI double deuce by my toe, see Figg get it and go\nI feel stuck in my ways, a nigga just tryna get paid\nI'm tired of answerin' questions; \"Why Oxymoron delayed?\"\nSee I was thinkin' November, but January is sweet\nIt set my Setbacks free, my Habits won in my sleep\nSo January agree, get a taste of this gangsta\nSee, I'm just tryna eat, with the freak of the week\nI just wanna hit 'em and leave 'em, dawg, they yours for the keep\nBut don't be kissin' them broads, my sperm on their teeth\nLast night was nothin', this mornin' I'm a hero\nNo belief in me, dawg, they said I'd mount to zero\nCocaine, cocaine, rock-rock kilo\nFishscale, cut well, you won't find Nemo\nPull up to the block and they call me real nigga\nSee, I can be a real nigga, but my daughter see me bigger\nSee a body full of love and yours full of liquor\nBut you'll always be my nigga, said, you'll always be my nigga\n\n[Chorus: Isaiah Rashad]\nI came, I saw, I conquered, ayy – I shot you down\nNow your brain no have no conscious, ayy – what you do now?\nNow, I came, I saw, I conquered, ayy – I shot you down\nNow, I bang, I bang, I blocka, ayy – what you do now?\nOh, bitch-ass rappers, ayy – I shot you down\nNo sensitive niggas, ayy – I shot you down\nNo bitch-ass rappers, ayy – I shot you down\nNo Hypebeast pussies, ayy – what you do now?\nNow, I came, I saw, I conquered, ayy – I shot you down\nNow your brain no have no conscious, ayy – what you do now?\nNow, I came, I saw, I conquered, ayy – I shot you down\nNow, I bang, I bang, I blocka, ayy – what you do?\nDon't make a sound", "image": "https://images.genius.com/12d3b17fc27c85e42b834c9734d7a60d.800x800x1.png", "album": "Cilvia Demo", "year": "2014-01-28"}]}