{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/fc08a4018680b3979b913a15b46cd21b.1000x1000x1.jpg", "year": "2019-06-07", "title": "Had To", "lyrics": "[Verse]\nThey just know I ran it up, they don't know what I been through\nNight time, bro speedin', I was out the window\nThat's a scary sight\nYou gon' get buried probably\nDemons talking to me while I'm shooting, like, \"Hit everybody\"\nAin't shit to hide but I want the car tinted\nI want the crib behind tall trees and fences\nHave you ever had to kill one of your friends\n'Cause the shit that he was on was coming between your plans?\nCan't just cut him off 'cause he know too much about you\nSent a prayer up, don't worry about your kids and your momma, I got 'em\nThen you gotta walk past the casket\nRemembering how hard he hit the wall when you blast\nTo remembering how sad he sounded knowing he through\nSeeing shock and just disbelief in his eyes 'cause it was you\nI had to\nMy nigga, I had to, ayy\nHave you ever played roles with a bitch?\nAnd that shit went too far\nYou done met this bitch kids and you know that she in love\nYou tell her, she like \"She stuck\"\nBut you know that everything gon' change after you fuck?\nBut you couldn't reveal your true intentions\nShe ain't the typa bitch that just let a nigga hit her\nBut fuck that, I got to\nBaby girl, I got you\nLet me beat it while you smile and hold you when you cry, too\nAnything you need, let me know, and I'll spot you\nHoping she don't really ask you though, 'cause it's not true\nYou fell victim to my lust, my bad, boo\nBut you so cold and so thick, bitch, I had too\nOnly had like 250 in the bank but that ice and them jewelers steady callin' my name\nThey want 90 for the charm, 80 for the Cuban\nI'm just knowin' it gon' kill me but I gotta do it\nTryna make myself feel better like maybe it's gon' motivate me\nMaybe when they see me with it, they gon' know I made it\nI went and got it, that shit ain't no nothing for me, jack\nAnd it's a custom piece, so I can't get no money back\n\n[Outro]\nI just thought I had to\nFuck that shit I thought I had to do\nI just thought I had to\nFuck that shit I thought I had to do"}], "artist": "Tee Grizzley"}