{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Produced by Just Blaze]\n\n[Beanie Sigel]\nYou know my name, bitch\nUhh.. yeah.. hold up\nThe streets gave me heat, and the Eagle was the thing that they gave me\nIt's the rap guerilla that still clap...fucker\nYeah, guess who's back?\n\n[Verse 1]\nMack, bitch - I move blocks and pounds\nI move out with small blocks and towns\nMove out with small Glocks and pounds (uh-huh)\nAnd I take everything to the table, bag and rock it down\nFuck who watching now; the neighbors, they in pocket now\nFuck you haters -- cop some pocket now\nWhen it come to coke, you can't outwit me; mine cheap\n'Bout to take over the city of Philly like John Street\nNigga, ask all y'all fiends, they call me Chef Boy-ar-Beans\nBeanie Crocker, cook coke proper\nRight amount of flour sifting it up\nCoke spots running by the hour, shifting it up\nGraveyard shifts, move packs in bundles\nBraveheart kids, use gats don't rumble\nGorilla niggas going apes in this concrete jungle\nBanana clips'll make them monkeys humble\n\n[Hook]\nBEANIE! Sigel was the name that they gave me\nBEANIE! Yeah, but guess who back\n\n[Verse 2]\nIt's Mack, bitch - uh-huh, back in the mix of the scuffle\nI'm in the hood with them chips like Ruffles\nBox man, Frito Lay, for that free dough boxing\nYou will lay, nigga I'm not playing\nListen, whether I make cash or take cash\nI'm in the hood eating with my dog like when we break fast\nB's on the hood and the wheel and the brake pad\nShit, when I skate past, bitches shake ass\nI sit four-thirty deep in wheels\nYou 'bout four-thirty cheap in wheels - small Benz\nLook at your small rims, small wheel, small grill\nBig Beans, sitting in Bentley my heart peels\nZero to sixty so quickly -- how you want it? You can have it\nDrop top, stick shift, automatic\nBack wheels still smoking\n6-4 still rolling, 3 wheel motion, it's ferocious\n\n[Hook]\n\n[Verse 3]\nOn the low though (shh!), the whole city is mine\nI'm trying to flood the whole city with dimes\nI'm in the kitchen yeah, with that vision wear\nGet them digits clear you can come and get them pigeons here\nNiggas talk about the crack game slowed up, BULLSHIT\nYou switched your hustle when the rap game showed up (uh-huh)\nWhile you wasting your time spitting them rhymes\nI'm getting mine spitting them rhymes, plus still pitching them dimes\nAnd the spot still sick with da grime\nGlock 26 nigga but I'm sicker than nine\nI'm live with the pound, small silencer calming the sound\nStick with the seven, strictly Smith with the seven (shit)\nWhen I drop back and cock back\nAnd pop that, I'm popping for keeps -\nI'm not getting stopped in the streets\nImagine that a nigga trying to rock Mack\nOnly nigga did it was Jay, and he did it when I signed the contract\n\n[Hook]", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "Beanie (Mack Bitch)", "album": "The Reason"}]}