{"songs": [{"album": "Blacklight", "image": "https://images.genius.com/7024230a664e26c9a3b0c4fc89609ef5.1000x1000x1.jpg", "year": "2011-05-30", "title": "Reverse", "lyrics": "Livin' in (reverse) [x16]\n\n[Chorus: Andy Mineo]\nWhy is the monster taller than ever, while the weak fade away?\nWhen justice storms, and darkness flees, I'm reminded on that day\nThe last shall be... (first), the first shall be... (last) [x3]\nThe last shall be... (Livin' in, livin' in reverse)\nAnd everything's in reverse\n\n[Verse 1]\nLivin' with the end in mind, something like the president\nI was livin' for the moment, tryin' to own it, residence\nBelieve in Him, that's the last thing I done ever chose\nGimme that rag top, trey on them chosen vogue\n(I rode) That '67 Chevy my cousin drove on them golden spokes?\nLife is short, and man I hope I make it down the road\nBut where I'm from, hope was that girl who flirted, flaunted\nYou never got it, but she was the one you always wanted\nHow good a picture perfect image front and tell you lies\nMy version of perversion did it every day a lie\nAnd man that burden got me hurtin' lookin' for some answers\nEndless searchin' just leave you burnin': Jo Jo Dancer\nBut mine ended when I saw the Lord would choose to hang\nThat type of love got me coming back, call it boomerang\nYet you can end the searches living waters quench my thirst\nThis is the day I die now I'm livin' in reverse\n\n[Chorus: Andy Mineo]\nWhy is the monster taller than ever, while the weak fade away?\nWhen justice storms, and darkness flees, I'm reminded on that day\nThe last shall be... (first), the first shall be... (last) [x3]\nThe last shall be... (Livin' in, livin' in reverse)\nAnd everything's in reverse\n\n[Verse 2]\nMan all I ever wanted, was to be labeled the greatest\nCassius Clay on spittin' rhymes while rockin' the lastest\nBut that crept into my life in Christ, it was evident\nAs I debate how I was better than the rest of them\nWork-based righteousness; base my worth on some type of list and\nIf I keep it or not perfected every night since this\nNow, I'm looking for approval, and I'm selfish!\nSo all I want to do is try to out do you\nSilent when you ask me. Later I'm bragging like a fool\nFar from His image and couldn't see it. Where is the Zoom?\nIt's His grace in my moment of reproof. That helps me see the truth\nJust how I sound; no auto-tune\nAnd in this life the last will be first and the first is last\nAnd he's a servant to the end. We certain of that\nThat's what I heard; freedom from the curse\nLivin' to it hurts, but the latter doesn't matter when you in reverse\n\n[Chorus: Andy Mineo ]\nWhy is the monster taller than ever, while the weak fade away?\nWhen justice storms, and darkness flees, I'm reminded on that day\nThe last shall be... (first), the first shall be... (last) [x3]\nThe last shall be... (Livin' in, livin' in reverse)\nAnd everything's in reverse\n\n[Verse 3]\nMan, I'm longin' for that day when the trumpet sounds\nI imagine in an instant I'd be off the ground\nFace to face with my Maker, with the glorious Savior\nEmbraced by Forever, no pain, free from labor\nAnd from my sinful nature, And we see Hope revealed\nFree from every tribulation, see He broke the seal\nEvery saint around the throne in worship\nOf the Perfect cause He purged us and He purchased us cause Hell is real\nReceiving what we all deserve\nThat where we see the first shall be last and the last will be first\nEither way, He's such a generous God\nIt doesn't matter if you've been here forever or just started to jive\nHe rewards us for our work, so life's not in vain\nAnd every saint, hold on He's comin' again!\nRevelation's only scary if you're not in Christ\nSo I don't shine, I reveal. call it blacklight\n\n[Chorus]\nWhy is the monster taller than ever, while the weak fade away?\nWhen justice storms, and darkness flees, I'm reminded on that day\nThe last shall be... (first), the first shall be... (last) [x3]\nThe last shall be... (Livin' in, livin' in reverse)\nAnd everything's in reverse"}], "artist": "Tedashii"}