{"artist": "C-Bo", "songs": [{"title": "Money by the Ton", "album": "Til My Casket Drops", "year": null, "image": "https://images.genius.com/dc4336c862301b0ea11cc46a1958acbe.500x500x1.jpg", "lyrics": "If you've got a ton of big face hundred dollar bills\nHow much money would you have?\nAnd every hundred dollar bill weigh a gram\nAnd there's 28 grams in an ounce and there's 16 ounces in a pound\nHow many pounds is it in a ton?\nGot to be about your uhh, uhh, uhh.....\n\nVerse One: C-Bo\n\nI slide thru, the 5-double 0 drop S-C\n'97 Sport and shorts and matchin jew-els\nWorth about a quarter, mil-ticket is how we dress\nTrue ballers fakin meal tickets up in the West\nI know you wanna touch us cos at the clubs you ladies rush us\nCos we're all about our cash, luxury livin and hoes love it\nHavin money by the ton, Rolex and Bossalini\nA nuchi give Versace cologne, now wanna see me\nAt my best or worst? I gets paper when I burst\nRepeatedly, heated, dumpin low-low's, you know I'll burst\nTo get my cash on, I spin the A-1 dolla\nFor money by the ton, come get it with no soda\n\nChorus: Mississippi\n\nMoney by the ton, that's the way it comes\nWe all, get paid\nOoohhhh ooohhhh, we make\nMoney by the ton, that's the way it comes\nWe all, get paid\nOooohhhhh\n\nVerse Two: C-Bo\n\nI'm all about the paper, nothin can come between that\nBut Lexus, fully diamondback, ???? and bald caps\nHoller \"Thug\", that's what we be, who you see?\nSteepin out of ragboys, cornises and Bentleys\nSix million dollar homes, we stays to the flow\nNow how much cash can you stack in a twenty thousand pound boat?\nIt's money by the tons, fo' sho' homey and all hunds\nAnd if ya get past the gate, cameras and pitbulls, you can have some\nFlossin, no one flosses like bosses do\nBut caution, when they float cos the wrong step, bodyguards swoop\nTo protect those, diamond Rolexos\nSippin that XO on chromed-up leaky's and Lexo's\nI put it down, pound for pound, surrounded by the millions\nFancy cars, movie stars tryin to make a billion\nCome show them my cash bundle, you are a pocket\nAddicted to money, they can't stop it, it's daily comin by the ton\n\nChorus\n\nVerse Three: C-Bo\n\nNow how you picture mad loot, stretch Rolls and rag Coupes?\nBig faces laced, I want all my dollars brand new\nI stand true to the game, on loot to the money train\nRolex's and diamond rings, big bodies with the blowed brains\nI bring the pain to get the cash like Jesse James\nTil the wild wild West is drained by Major Pain\nWho got the loot? Big bodied Coupes and S-Classes\nAnd when we swoop, kickin the loot or catchin casket\nLoad up the rigs, with crazy big-faced hunds\nHeaded for the drug, still weighin it by the ton\nCos money makes the world go round, stackin off-shore accounts\nWaitin on the ?????\nSo be a baller, got to keep it on the slunder\nMilli'ns by the hundred, transactions thru account numbers\nMore money than you ever seen in big faced hunds\nComin in a hundred and twenty million every ton\n\nChorus (x2)"}]}