{"songs": [{"year": null, "title": "Watch Out", "image": "https://s3.amazonaws.com/rapgenius/Into-The-Wild-Artwork.jpg", "lyrics": "[Intro]\nWatch out my time is now (chopped and screwed)\n\n[Verse 1]\nTwo monsters walking in the Oscars\nSmelling like body odor, whiskey and lobster\nRosewood got 'em feeling like a monster\nBut strip down to nothing but a pair of my boxers\nAnd I walk this carpet like I own, like I own this shit\nAnd I know you fucking notice it\nNo way to control the kid\nSo, so quit while you already, you already down\nThrow my bottle and my gallons half way full on stage and fucking bounce\nCause I ain't doing this for you or you, or her, or him\nI'm just here to stack my wins\nAnd make enough dough\nSo when the time comes I could buy this town!\n\n[Hook]\nI'm on my way – can't stop me now!\nI'm taking over every spot in town\nI'm screaming “Watch out!” (Watch out!)\nWatch out (Watch out!) my time is now\n\n[Verse 2]\nYep, Hollywood, oh, I'm just so Hollywood\nCause I sold my records as an indie artist\nThan your signed ass ever could\nBut fuck the industry, I am this fucking industry\nAnd the new kids run the game now\nBetter change those locks gotta get new keys\nUpset that I'm winning in two places racing like Charlie Sheen\nSpazzing out on live TV\nWoke up in the H, took out the IV\nRan through the doors and screamed down free\nBut to my surprise I still could see that\nI still got... still got snakes trying to feed on me\n\n[Hook]\nI'm on my way – can't stop me now!\nI'm taking over every spot in town\nI'm screaming “Watch out!” (Watch out!)\nWatch out! (Watch out!)\nWatch out, my time is now!\n\n[Verse 3]\nJust had a thought of genius (yup!)\nWith a stroke of luck\nThink I'll never make it as an artist (well)\nThink I give a fuck?!\nI repeat, I rock Ducati\nYou know I'm gon' be looking up\nPut the city on my back 'til I can't walk no more\nYeah, that's what's up!\nIn front of all the doubters\nI'mma rub it right in their face\nBut the fanbase out this world\nWith no label in place\nAnd just in case you forget about me\nCheck out the Billboard charts every 4-5 weeks\nGuess whose name you fucking see?!", "album": "Into the Wild"}], "artist": "Sammy Adams"}