{"songs": [{"lyrics": "[El-P]\nI brought that genuine shit in '96\nBefore you knew the underground or independent existed\nI watched the whole scene straight jump on the dick\nAfter stepping to KCR lit and flexing my shit\nNo gun talk, no gimmicks, just rounds of raw-dogging\nDirty dusty intelligent wit and word murdering\nA hardcore poetic informed without burglary\nPotent and shook the shit out of rappers who just learned of me\nEverytime I prescribe a new pill, revolution\nQuickly defined the standard for indie rap distribution\nArrogant unafraid shit developed riding a train thinking of brain fucks\n\"Bad Touch Example\" that soon became bucks\nHad everybody sprung wondering where I came from\nScreaming out \"Independent as fuck\" with an insane tongue\nWith an indelible squad of design monsters\nInnovating the styles that made biters look like imposters\nSo we scripted an album and signed to Rawkus\nSelling a hundred thousand without a radio chart hit\nPreposterous sonics taking the world hostage\nClassic hip-hop bombage dirty with style progress\nNow I've come from the '80s juvenile Brooklyn\nWhere cats was like: \"Gimme that subway pass, kid. Good lookin.\"\nNow someone else is taking a ride with what's mine\nSo I had to develop styles with a death device cooked in\nSo when I battled in basements I had eight sentences\nWaiting way before the four you had laced in\nAnd I was taught to wait patient (Why?)\nOnly faggots make shit up just to get famous\nSo when I finally blew up I remained sick\nEarning respect in ghettos and 'burbs for word placement\nBack when the independent scene remained faceless\nWe were the only crew who promised your ass we'd take it\nMold it, shape it, living outside the matrix\nHold it, make it, more than miniature major labels\nHold it sacred, living it for the culture\nTold ya plainly, protected it from the vultures\nThat's why I always get respect from true soldiers\nWhile half of the critics claim it every year: \"Hip hop's over.\"\nFUCK YOU, hip hop just started\nIt's funny how the most nostalgic cats are the ones who were never part of it\nBut true veterans'll give dap to those who started it\nThen humbly move the fuck on and come with that new retarded shit\nNew slang, new thought, new sound\nWho's heart you thought you had?\nYou clown, you don't, you drown\nI won't dumb it down, I'm dumbing now for these rounds\nI'm a live mothefucker plus I'm gunning for clowns\nYou're a mime motherfucker, don't be coming for pounds\nSo you can break out of that invisible box, you're not down\nMy favorite ones are the ones who started that young rap about\nComic books, spaceships, and Obi-Quan one\nAnd even though they were soft they had fun\nBut they couldn't break out the frame of the town they came from\nSome of these faggots used to send me their demos\nI'm keeping their puppy styles in the Company Flow kennels\nBut since they had no identity from the start\nThey started to resent the scene when they couldn't become a part\nThey've been failing for years and call themselves Vets, that's bold\nMotherfucker, you're not a Vet you're just old\nI'll slap the shit out of you to continue my nerd rap\nMaking this money fist over fist, fuck what you heard\nJukie cats talk about boom bap and golden ages\nPatting themselves on the back for making that new outdated shit\nI've been putting out vinyl since '93 and never looked back once\nAnd ya'll trying to chase me\nYou don't innovate because you can't innovate\nIt's not a choice despite what you might tell your boys\nKeep your identity crisis under the table\nI always knew who I was and I'll always be more famous\n\n[Aesop Rock]\nCheck it\nFor the best in the vendor biz\n1-800-Lazerface\nLeave the last \"C.E.\" off for Craps and buy them Haterade\nDig it, daddy dug his own tunnel under the gutters where the numbers bleed\nHunters froze up and exposed Rapunzel weeds\nTugboat, tug up through that brutal dirt first\nThe fuedals fuming oodles, it was right under your poodle skirt\nWelcome to Bazooka Works, halogen halo eyesore\nThe revolution will not be apologized for\nWarbucks exlex megaphone on the fashion piggy pageant\nWhile my dick's raw-dogging a style magnet\nFraggle rock your four figure watch\nI clock ninety-nine cent wristbands\nAnd still know the time when you record flops\nNow this is on a sick with it factor\nExhibit A. E. S., Genesis of the klepto reactor\nWanna burgle the buzz over definitive cash\nAfter a life of labor camps starts paying innovaters back\nBaby, you ain't felt the collective? (Coooool)\nStop running bases with little bears under the wing of punchdrunk Buttermakers\nThat engine sputters while the hound dogs wire cutter mechnical rabbit\nBantam weight puppies ain't rabid enough to snatch him\nPockmark ninety Moses approach with a golden focal point\nCome soak in it, résumé sturdy composer soldier bliss\nWrong name by a molar can often expose your phobias\nWatch a cobra grow hands to hold his own tongue when he notices\nAll city legity critter, bark with me\nAll filthy documents, cats piss on their kittie litter moccasins\nWelcome to mi casa, Monsters Inc, dropping bangers out the rocket ships\nYour own private apocalypse\n\n[El-P]\nHonor it\n\n[Aesop Rock]\nFor fuck's sake\n\n[El-P]\nOriginal\n\n[Aesop Rock]\nWild fly\nYou wanna read the nile?\nI twitch easy reader\n\n[El-P]\nFather it\n\n[Aesop Rock]\nI will, dog\n\n[El-P]\nOriginal\n\n[Aesop Rock]\nWide open with banged out cutlery from a slang mouth teacher\nAnd money is an ugly god we all fall for\nI got land mammal, cannibal, natural evolving squackbox\nThat means when I wake up and decide to comprise the new shit\nIt's not some watered down version of what my favorite crews did\nPuff the magic komodo bitch\nRappers stuffed kimonos and shark fame at a perfect working unit\nLook, I'm done\nB-boy, feed that to the needy\nShut your liquor hole, fuck you in 3D\nEasy", "title": "We’re Famous", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}