{"songs": [{"lyrics": "One of four\nMy name is Ian Mathias Bavitz\nI was born in 1-9-7-6, at Syosset hospital, located in Long Island, NY\nI am 6 foot 4, I weigh 2-0-0 pounds\nI have brown hair and green eyes\nI enjoy writing songs, painting, movies and diner food\nI have two brothers, Chris and Graham\nAnd two parents, Paul and Jameija\nIn august of 2-0-0-1 I went crazy..\n\nThis was originally not for public consumption\nThis was made for four people... four people that literally saved my life\nThey know who they are..\nAnd, uh... I mean, I could live to be a thousand years old and never re-pay them\nI don't think this song would pay for them\nBut hopefully by putting it out, push the bank a little further..\n\nThis ain't a burner for the whips (no it isn't)\nThis ain't even Aesop Rock fly earthworm demeanor (no it isn't)\nMy name is Ian Mathias Bavitz and I was born in Long Island, New York\nSeventy Six, before Graham and after Chris... OK\nIn August of 2001 my seemingly splinter-proof brain bone scaffolding imploded\nI kept it on the hush, but nearly tumbling\nTo the cold hard concrete on near bodega trips\nFor cigarettes and soda, shook me to casper\nDizzy with a nausea chaser, motor sensory eraser\nGorophobe tunnel vision, guilt, self loathing arrangement\nRose rapidly outta bog I'd never fished in\nThat abates three separate foreign meds\nWhile I seems to hook lines and syncro simple fishing\nSimple primitive self taught, easing of soul, mind and body\nBut the symptoms rejected my cave-man modus operandi\nSo now it's one fish belly up, through medicated mileage\nShrinks that get 250 an hour for awkward silence\nAnd, I'd be lying if I said all of this\nMade even the slightest fragment of sense to me\nThat's frail... Simply put\nI don't know what happened, or what's still happening\nI literally feel like I'm teetering on the blunt edge of my sanity\nJAIME, I killed the robots and I'm sorry\nBroke down in front of you, embarrassed\nBut you lent a heart and hand that only you could\nYou're one of my best friends and yes I'd take that bullet for you\nThat's my word, which is about all I have left\nTONY, I know you know I'm crazy, cause you told me\nBut that didn't ever bother you, I hold you as my brother 'til death\nAnd I got your back if ever the drunk goblin step\nFor makin' a cat laugh when I was walking with the dead\nKATHRYN, mother figure, older sister, concerned beyond limits\nLetting me know I wasn't the only one with this\nContinuous offers for vacation, Chicago visits\nTalked me through repair of a head full of broken pistons\nRAIA, for the late night movie rentals and the company I needed\nAn' you knew it, but I just wouldn't admit it\nYou listened to me blab about my issues for hours\nOffer incredible advice, gave me a hug when I was finished\nAm I a jack of all trades? No... I like to write songs though\nAre they good? I dunno..\nBut I could tell you that I only write shit down when I believe it\nSo take this how you want, but know I mean it\nI want you all to know that I'm scared\nNow my fuckin' crooked soul never faced a monster like the last few months\nEver in my whole life... I wish I could explain this better (I can't)\nBut the pieces won't formulate it to anything even close to cohesive\nSo I guess this is my feeble way to thank you\nFour soldiers that extended something sacred off the purity of kindness\nI owe you all my life and please don't argue with that statement\nCause without y'all I may not have a life to offer, take it\n\nThank you\nI wish I could explain this better. (Thank you)\nI'm sorry for burdening your pleasures. (Thank you)\nI love you all with all that's left of me. (Thank you)\nFor helping try to kill what made a mess of me. (Thank you)\nSomehow, someway. (Thank you)\nI'mma get you back someday. (Thank you)\nJust gotta figure this all out... (Thank you) So..\n\nI guess it is kind of funny when you look at it from a step back\nHow one man can literally buckle under the same pressures\nOther men operate normally under\nI have scoped this out from all angles, multiple times\nI have been over everything in my head, 'till I can't think anymore\nBut I guess some times, when you can't breathe, there are people there\nTo breathe for you\nI am lucky enough to have those people around me\nThank you for helping me to not die\nThank you for helping me to not die\n\nPocket full of pennies, and a soul gone tilt\nCockpit full of memories and a drain full of guilt", "title": "One Of Four (Thank You)", "album": "Daylight", "image": "https://images.genius.com/7aee135d16898a4fac2a490d41fb0b19.600x600x1.jpg", "year": null}], "artist": "Aesop Rock"}