{"songs": [{"album": "Shut Up And Rap", "image": "https://images.genius.com/22af45710b74abb23f51b1a75a855114.1000x1000x1.jpg", "year": "2014-12-09", "title": "Oh Yes!", "lyrics": "[Verse 1: Termanology]\n\nI told her\nCome experience living life on another level\nChampagne leather on the seats, girl this ain't a rental\nMy eyes red like a rose petal, I'm so ghetto\nMix the Mad Dog straight with the amaretto\nOh, yes! I'll get you set up for your Rolex\nCriminal enterprise minds, we here to collect\nShe said, I'm the best she ever had, like Drizzy\nI told her, bitch, leave me alone, told you I'm busy\n\nNever stress, roll around strapped when I'm collecting debts\nNever meet, just call Hec, it's off with your neck\nBack to rack, you couldn't see me double cataracts\nTelescopes, stigmas, eyes twitching from sniffing Jack\nMoney gettin, like Sonny Liston I hit hard\nMoney, listen. Buddy system: get lost\nA crazy guy. With a lazy eye and a Mercedes high\nI stay creating Def Jams like it's 1985\n\n[Chorus: Ea$y Money]\n\nOh, yes!\nYou now rocking with the best\nTake a bullet, assess, and lift her dress, mami sayin'\nOh, yes!\nYou know them can't contest\nIt's the S, the T to the dot, the most fresh\nOh, yes!\nThem never settle for less\nFuck with the vets, is it true we leave them haters a mess?\nOh, yes!\nNow put your hands up high if you feel the vibe\nHa ha, you know the rest. \n\n[Verse 2: SuperSTah Snuk]\n\nGrab my keys from the rack, Hennessy on my lap\nFresh from my white T to the B on my hat\nI'm a motherfucking superstar baby, you ain't knew that?\nTrue fact, I'm really doing all the shit that you rap\nAnd my team better than better than average\nGot it all, yeah, I'm selling your medicine cabinets\nYou can't see me on no regular atlas\nI'm saying my shit's live, you spelling it backwards\n\nYeah, I'm a bad motherfucker\nTop of the road, Superfly, Superstah Snuck-ah\nAnd my shit's ludicrous, lover lover\nI got some butter for that buns, baby spread it all up-ah\nI keep it suckah-free, that's just me, look--\nThat's just how it is and just how it's gonna be\nLike, uh, you now rocking with the pro\nThe answer \"am I the nicest\" is the opposite of no\n\n[Chorus]\n\n[Verse 3: Ea$y Money]\n\nOh, yes? She chill with your boy, it's no stress?\nNever protest when I wanna give her throat sex\nI'm a motherfucker but she give me the booty\nCause I keep it G like a Disney movie\nWe go-getters, ho-getters, now they so jealous\nStay fly, without the wings and the propellers\nWe gettin it, now what they gon' tell us\nYou'd think it's money pizza in the oven, how the dough swell up\n\nMan, you know I stay fly and shit\nSo these chicks stick to me like a fly to shit\nScratch that, more like I stay flier than a G4\nWhat you think your girl fucking with a G for?\nI'm just a fly guy, I got her eyes wide\nCall me high tide, am I something to see?\nSure. Pretty face, slim waist, and her ass bad?\nI'ma put a pound on the pussy, no hashtag\n\n[Chorus]"}], "artist": "Termanology"}