{"songs": [{"album": "Something Else", "image": "https://images.genius.com/9d1e1c938850d53aa216f2bec0e2ef9c.1000x1000x1.jpg", "year": "2013-07-30", "title": "Feels Like Heaven", "lyrics": "[Intro: Tech N9ne]\nThinking back to all the bad I did (bad I did)\nHow I was young and evil as a kid (as a kid)\nOk, I'm better now, I ask the reverend (ask the reverend)\nCause of my hell\nWill I go because the life I'm livin' feel like heaven (feel like heaven)\n\n[Verse 1: Tech N9ne]\nGrown better man still I'm in my gang attire\nDoes not mean I'm going to be cast into a ring of fire\nDoes it? If so them words you speak I can't admire\nThe evil's in my past but today the saint is ours\nGet and give a lot of love, guess my Allah just follows us\nI was stuck, taught us, now we caught up in goddish hugs\nEverywhere we go, there he go, went from very low\nTo unnecessary owes when he carries flows over the stereo\nI'm, on my 7 all because of rhyme\nBut because I played the 6 once upon a time\nThe reverend says my worldly ways I need to deaden\nBut I can't tell because this life I'm living feel like heaven\n\n[Bridge 1: Krizz Kaliko]\nIs it heaven, or is my head up in the clouds\nIs there hell for me, cause I feel like we made it out\nI put my halo on but then, it done came off again\nYou don't need eyes to see, that this could be our only heaven\n\n[Chorus: Nikkiya]\nSo, if you see my feet up off the ground\nOh, don't you let me tear this heaven down\nOh, if you see my halo falling down\nOh, don't you let me tear this heaven down\n\n[Verse 2: Oobergeek]\nIt's funny, and when I think I'm up there...\nThey say I fais le cul to much\nBut they just déjà vu too much\nCaught up in the antics\nYeah I'm tied to you because I was thinking semantics\nSo is it dependent on what your heaven is?\nOr how big your 6 and 7 is?\nEverything preaches to you, you decipher who the reverend is\nThis verse is speaking to the ones seeking peace in any form\nFar from norm' imaginations, the brain rains when it storms\nYou say names then it forms, manifest things that were foreign\nTo you once upon a time no coincidence is gonna rhyme\nMake sense in a normal line\nOf words you learned them at the time and they remain timeless\nFeeding of the dreams that you promised\nBefore niggas knew you were prominent and dominant\nAnd all those powerful words that back then, to be honest\nWere just nouns and verbs; the looks on the astonished\nAre normal by now I seen them same faces when I was in Spiderman pajamas\n\n[Chorus: Nikkiya]\nSo, if you see my feet up off the ground\nOh, don't you let me tear this heaven down\nOh, if you see my halo falling down\nOh, don't you let me tear this heaven down\n\n[Bridge 2: Krizz Kaliko]\nHeaven or hell?\nI never thought that this could be so real\nI never thought that I would ever build\nMy own heaven\n\n[Chorus: Nikkiya]\nSo, if you see my feet up off the ground\nOh, don't you let me tear this heaven down\nOh, if you see my halo falling down\nOh, don't you let me tear this heaven down\n\n[Outro: Tech N9ne]\nI remember back in the day I had this song called \"My Own Hell.\"\nIt was depressing\nBut since then, I've created my own heaven, baby!\nAnd it's beautiful!\n\nIncredibly no one deaded me when it was lead at these red Dickies\nNobody beheaded me, let it be, said I'm breaded B\nReal light, within darkness I still fight it\nBut if heaven is love, then this sure in the hell feel like it!"}], "artist": "Tech N9ne"}