{"songs": [{"image": "https://images.genius.com/3f6e8b1f4b72f87f7dee3757bea8a04c.640x640x1.jpg", "year": "2017-10-06", "lyrics": "Songtekst van Sevn Alias – \"In Amsterdam\" ft. Maan\n\n[Intro: Esko]\nB-b-b-b-beats by Esko\n\n[Verse 1: Sevn Alias]\nIk wil weten wat m'n kans is\nM'n lobi voor jou die gaat dieper dan Atlantis\nPak m'n hand, ik kan je wijzen waar de Champs is\nBreng d'r voor de dag, laat haar zich voelen of ze Frans is, of ze Frans is\nJe lijkt op een clown, alleen door jou zal niet meer vallen voor een vrouw\nIn eerste instantie leek je lightskin, maar van dichtbij ben je goud\nKen jou niet lang genoeg om te zeggen dat ik al van je hou\nMaar ik hou van hoe je bent, al die vrouwen laten me koud\nIk kan voor je gaan als je me zegt dat je blijft\nIk heb geen haast, doe rustig aan, schatje, we hebben de tijd\nIk zou een domme jongen zijn, als ik door haar werd verleid\nIk breng die sweet things in pakket en ze gelooft me gelijk\nAlthans dat dacht ik\nWant dit nummer van je werkt niet\nEn nu wacht ik\nIk hoop nog steeds stiekem dat het een grap is\nEn dan draai ik weer je nummer, geen gehoor\nGeen stress, blijf nog even in afwachting\n\n[Chorus: Sevn Alias]\nZou je door de regen met me lopen?\nZou je met me strijden tot 't eind?\nZe vraagt me \"wanneer skip je al die ho'tjes?\"\nMaar zij kan mij niet zeggen of ze, blijft\nIk wil jou al lang\nKom eens dichterbij me, schat, doe niet zo bang\nGeef mij je hand, ik wil weten wat m'n kans is\nWant een vrouw als jou die loopt niet zomaar langs\nIn Amsterdam\n\n[Verse 2: Maan & Sevn Alias]\nJe wilt weten wat je kans is\nGeef mij je zekerheid voordat jij je kans mist, ay\nIk wil weten wat je plan is\nSchat, ik wil je laten zien\nDat die kleine jongen van toen nu een man is, ja\nJe praat, maar het verleden vertelt mij iets anders\nVerlaat me niet, je bent veranderd\nIs wat jij zegt, laat zien dat het waar is\n\n[Chorus: Maan]\nHeel even, zou je door de regen met me lopen?\nZou je met me strijden tot 't eind?\nIk vraag je \"zijn die meisjes al gevlogen?\"\nAnders kan ik je niet zeggen of ik blijf\nIk wil jou al lang\nM'n gevoel is in gevecht met m'n verstand\nJij, vraagt m'n hand, je wilt weten wat je kans is\nVanaf de laatste keer dat ik je tegenkwam\nIn Amsterdam\n\n[Outro: Maan]\nYeah\nYeah", "title": "In Amsterdam", "album": "Picasso"}], "artist": "Sevn Alias"}