{"songs": [{"year": "2016-03-22", "title": "Oh Ok", "image": "https://images.genius.com/490921574ed6a531ea68889d7620d824.500x500x1.jpg", "lyrics": "[Produced by Zaytoven]\n\n[Intro]\nYeah, yeah, yeah\n21 Savage, 21, 21\nHa yeah, yeah\nHa ha, ha,ha, ha ha, ha\nHaha, haha\nYeah, yeah, yeah, yeah\nHa ha ha, ya dig?\n\n[Verse 1]\nCarbon 15 on em\nAR 15 on em\nGot that Glock with the beam on it\nEvery nigga on my team want it\nOh, you a gangsta? You a savage now?\nYou ain't never sprayed a hundred rounds\nLast nigga tried to gun me down\nLeft his body in the lost and found\nZone 6 shit bitch\nWho the fuck told you shit was sweet?\nWho the fuck want smoke with me?\nNigga barking up the wrong tree\nEverybody want to hold nuts on Young Savage\nProbably cause your bitch wanna fuck Young Savage\nAll these pussy niggas acting like they really trapping\nYou got one more strike fuckboy and I'ma whack you\nBut a nigga watch blinging, take it\nBut a nigga chain blinging, take it\nSaid he got a bankroll, take it\nAnd yo' shooters ain't gon' do nothing\nFuck the glamour and the glitz\nBitch I keep extended clip\nI keep extended clip\nI love my extended clip\n15 got my first trap spot\nI beat that motherfucker out\n19 niggas tried to jump me in the club\nI aired that motherfucker out\nYou ain't 'bout that shit that you rapping 'bout\nNigga tell the truth, what you capping 'bout?\nNigga fuck the rap, we can clap it out\nI take the 30 out and gonna slap you out\nPay attention man these niggas really weird\nPussy ass nigga gotta period\nBitch ass nigga\nSnitch ass nigga\nI take pictures with my hand on my hip ass nigga\nWhen it gets real I'ma gon' and dip ass nigga\nEast Atlanta to Decatur to get your flip fast nigga\nGot your bitch swallowing cum like some slim fast nigga\n21 Gang and we don't throw no white flags nigga\n\n[Outro]\nBitch, bitch!\nA lotta um fake you know what I'm saying beef\nOr whatever the fuck y'all call it\nNigga, we don't beef nigga\nWe just eat nigga\nAnd keep it moving nigga\n21 Savage\nSlaughter King\nStill on that bullshit\nStill keep a full clip, ya dig?\nStill give ya pussy ass a face lift nigga\n21", "album": null}], "artist": "21 Savage"}