{"artist": "50 Cent", "songs": [{"album": "Les inédits Booba", "image": "https://images.genius.com/12e5cbc84e486dd7d13d7cac0d652a6a.400x400x1.jpg", "title": "Hands up high - Remix", "lyrics": "[Intro – 50 Cent]\nNew-York City. I am New-York City !\nI’m the American dream ! I’m 50 Cent ! Hahahaha\nYou don't believe me ? Trust me, it will be shots flying ! Men DOWN\n\n[Refrain - 50 Cent & Tony Yayo]\nMan I run this rap shit\n(Get ya hands up high, hands up high, hands up high)\nRest in peace to Biggie Smalls\n(Get ya hands up high, hands up high, hands up high)\nR.I.P. to 2Pac\n(Get ya hands up high, hands up high, hands up high)\nNigga roll that good shit\n(Get ya hands up high, hands up high, hands up high)\n(Here we go!)\n\n[50 Cent]\nYou wanna dance, let's dance nigga\nI'll take you to the prom\nI'm armed, tre pound in my palm\nI'm calm nigga, my mama made a baby boy\nThe hood made a man, my first 14 grams took that and made a grand\nI do this, you knew this, I told you pussy\nYou faked your death, hater fuckin comin from pussy\nI'll have like EE II EE II UH OH, after the fo-fo blow I get low\nThat's how I go like a pro, it's a rap, I'm a ghost\nAnd you smoke like a roach, you been clapped\nAnd the fact there's no comin' back from that\nI'm the last of my breed\nMo henny, no weed, just my vest and my semi\nIn the back of the Bentley, I'm a nas and a rase\nI'm there and I'm gone\nMy lawyers are strong, and my money is long\nSo when I'm right, I'm right, and when I'm wrong, I'm right\nI'lll hit yo ass up right, nigga its nighty night!\n\n[Refrain - 50 Cent & Tony Yayo]\n\n[Booba]\nJe prends le contrôle renoi, laisse le rap HS\nDiamant sur le HF, Pont de sèvre t'achève\nC'est trop cher pour toi ? J'achète\nDoigt sur la gâchette, pousse-toi ! hachek\nLève lève lève tes mains en l'air, ton gun, ton revolver\nLe jack est dans mon verre, la chatte à sa grand-mère\nC'est panam panam, G-unit, 92 izi clik de macaques\nMillion d'euros cash sous le clic-clac\nRien de banal, je ne suis pas très halal\nPasse le cash ou le banana ou la clik te passe le salam\nC'est boulbi au micro, c'est Brazza c'est Mala\nNe me cherche pas négro car je ne suis pas là\nT’es synonyme de défaite, je n'compte plus mes prouesses\nÉlevé parmi les wesh wesh, nos flingues viennent d'URSS\nTu veux savoir qui suis-je ? Où est-ce ?\nLes suceurs de queue plus ils m'aiment plus je les déteste\n\n[Refrain]\nParoles rédigées et expliquées par la communauté RapGenius France", "year": "2008-07-01"}]}