{"artist": "Isaiah Rashad", "songs": [{"title": "Wat’s Wrong", "lyrics": "[Intro]\nAh, ah, ah, ah\nAh, ah, ah, ah\n\n[Verse 1: Isaiah Rashad]\nI cut my hair and bump my head and fell on top\nAnd run on sins, and front on friends\nIf we don't win then pay your Tithes and mend your fence\nAnd we alright, the Kaio Ken and big old rims\nAnd LA hoes, if that ain't wrong, if I ain't gone\nI ain't home, I ain't them, I ain't them\nNo more ends and no more trends\nAnd photo tint and photo lens, notice this\nPour this shit, bonafide, woe is me\nBowl of grits, naked pimp, beamin' up, clean as fuck\nOther side chill for niggas, makin' life look clear for niggas\nHill for niggas, tip top cliff for niggas, this the vision side to side\nSo give the nigga, if we honest you gon' miss a nigga\nTwisted with 'em, this the isms\nSee your bitch might kiss a nigga, which nigga? Get specific\nBig ass pot, wrist is glistened, your list is shit\nAnd your, if it isn't, this cost some titties and scar your face\nThe wrong of wrongs has caught a case\nOther niggas they Mobb like Carter say from far away\nAll my niggas like \"Calm down\"\nLovin' life above a reason, just can't find it like a dozen people\nCatch that vibe at night, and Bobby Whitney\nGet too tired to write and died in prison\nFelt like Rob tonight, lost my god tonight?\n\n[Hook: Zacari]\nOh sometimes I get so ahead of myself\nFeel like I'm runnin' in circles\nOh and I'm just holdin' onto my breath\nI need smoke just to exhale\nOh and I get so ahead of myself\nBut I'll make it out somehow\nSo roll another, roll another one\nAnd put it all in the air now\n\n[Verse 2: Kendrick Lamar]\nHow many souls do you touch a day?\nHow many hoes do you fuck a day?\nHow many flows do your thought convey?\nHow many know you can't walk away?\nDepending on the way I feel, I might kill everybody around me\nMight heal everybody around me, how the wind blow\nOpen your window, let the debris in, never let me in\nI kick back with kick do'\nMaybe if I could live hundred years that be real?\nPay me if I'mma be rhymin' these homonyms\nCrazy, my other show went to my mom 'n' 'em\nMy daddy said a Mercedes had haunted him\nBut now he got one, I'm ridin' shotgun\nWith a three-piece chicken dinner and shot gun\nI bring your weekend to an ending and pop one\nI'm in the deep end, boss nigga you not one\nAnd I believe in Kool-Aid and God's son\nDo you believe that Black man is our sun?\nI made enough residuals to hide some\nI gave enough, my niggas know I divide some\nI told Zay, I'm the best rapper since twenty five\nBeen like that for a while now, I'm twenty-nine\nAny nigga that disagree is a fuckin' liar\nPardon me, see my alter ego was Gemini\nHim and I been around ever since Reagan was criticized\nMight stay in the Trump Tower for one week\nSpray paint all the walls and smoke weed\nFuck them and fuck y'all and fuck me\nI proceed my last check in proceeds\nTo all the kids, the hood, the bricks, the books\nTo fix the blocks we on to right my wrongs\nThe word, to give the life we live as I get...\n\n[Hook: Zacari]\n...so ahead of myself\nFeel like I'm runnin' in circles\nOh and I'm just holdin' onto my breath\nI need smoke just to exhale\nOh and I get so ahead of myself\nBut I'll make it out somehow\nSo roll another, roll another one\nAnd put it all in the air now\n\n[Verse 3: Isaiah Rashad]\nOh you got two Xannies, oh, just don't forget me\nLove me for the moment (all in the air now) hug me like your sibling\nWeed ain't that important, vice cops in the kitchen\nGrew with Apollonia (all in the air now) Rob was makin' chicken\nBeat me down, you beat me down, reorganize my face\nNow when I go home, I don't know what my fam gon' say\nZay, say it ain't love cause you bought flowers yesterday\nThoughts was always cheap, cheap, cheap\nBut now let's talk 'bout me, me, me\nLately I been comin', this ain't goin' how I wanted\nWhen I pull up at your window, bitch come out, you hear that beep, beep, beep\nFaithful as your EBT, closer than you momma kin\nAnger when you rang about my dog but I'm gon' call again\nFreak me out, keep me out, why they always leave me out\nNiggas that been hatin'  just can't wait to have my CD now\nDon't we look like CP and Nirvana on that keep me pound\nPlease be down, I been more than late...\n\n[Hook: Zacari]\nOh sometimes I get so ahead of myself\nFeel like I'm runnin' in circles\nOh and I'm just holdin' onto my breath\nI need smoke just to exhale\nOh and I get so ahead of myself\nBut I'll make it out somehow\nSo roll another, roll another one\nAnd put it all in the air now\nAll in the air now\n\n[Outro: Dave Free]\nOkay, I'mma tell you this story, man...A few years ago, I gave my pops, uh, Cilvia, Cilvia Demo and my pops said, uh...he listened to it for about a week, came back to me, said, uh...said, \"Dang, boy, why...Zay talkin' 'bout he gon' run up in somebody house? He...he...he talkin' 'bout you?\"", "image": "https://images.genius.com/8138144db88b5df67dcaf1f79d19f5a1.220x220x1.jpg", "album": "The Sun’s Tirade", "year": "2016-09-02"}]}