{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Intro: Big Daddy Kane]\n1 2, 1 2\nAw yes, this the way we gonna set it off for Hot Chillin'\nThe groove gon go a little something like this here\nCause I'm the one that entertain\nThat goes by the name of Big Daddy Kane\nAlso in the place to be, we got the girl known as Antoinette\nLet me tell you, you ain't seen nothing yet\nThe engineer all-star Marley Marl in the place to be\nAnd to my man known as King B\nAs it goes a little something like this\n\n[Verse 1: Big Daddy Kane]\nIt's me, you see\nThe B-I-G\nThe D-A-D-D-Y\nThe I, the K-A-N-E\nExciter, delighter, invite a biter to fight\nA due fool, so I can school and rule\nAnd ignite a\nParty to the climax\nThe mic I wax\nYou know who the true lord is, so why ask?\nRhymes I deliver\nAlways come with a\nUnique technique when I speak, and if a\nSucker would step to me\nHe would be left to be\nLost in jeopardy\nCause I will set ya free\nJust run up onstage and take a stand, broad\nSnatch the mic, I vic 'im like a landlord\nFor me to go out, I can't have it\nSo set the microphone up just for me to grab it\nThen just allow the Big Daddy to center hit\nCause when I run up onstage, yo, I'ma demo it\nThrash and bash and crash and slash and mash\nClock cash as I wax much ass\nThe lyrics I'm displaying, the suckers I'm obeying\nCause this is all live, Hobbes, know what I'm saying?\n\nAntoinette: Yeah, yeah, that was fresh, but you gotta bust this\nKane: What you got for me, baby?\nAntoinette: I got a lot\nKane: Set it off\n\n[Verse 2: Antoinette]\nSpit up, get up\nThe eighth, gonna light up\nNews reporters, get ready for the write up\nTelling me you're mad\nHow the set was a drag til I came\nI'm not trying to brag\nI just pour, tour, rhyme, and climb\nI go prime time\nBecause I go for mine\nI never fake, break, take, make\nShake and bake\nDrop my groove until your back ache\nSo be my victim\nScream, kick, and holler\nA fresher rhyme will follow\nCause I'm a scholar\nI do what I gotta do\nAnd when I'm through\nTake a trip to the Bahamas, come back and continue\nTo say only the hyped and extra-exotic\n\nKane: Marley, hit me now\nMarley Marl: Yo Kane, you want it, you got it\nKane: Yeah, that sound funky. Yo, I think this the dope promo for Hot Chillin', man\nAntoinette: Yo, yo, you know what you call this? You call this a \"Raw Attitude\"\nKane: Word. So what's up? We outta here or what?\nAntoinette: Yo, it's only right we outta here\nKane: So yo, I'm just gonna say peace to Marley Marl and the super rocking Mr. Magic. Ay yo King B, go downstairs and start that deuce up so we can make this here move. Peace!", "image": "https://s3.amazonaws.com/rapgenius/1321503841_BDK%20fade.jpg", "year": null, "title": "Raw Attitude", "album": null}]}