{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/9a6a33b32659c68f154efced8162fccd.500x500x1.jpg", "title": "Sex, Drugs, Rap & Roll", "year": "2003-03-11", "album": "Monster", "lyrics": "Bitch, you know what boys like\nMarquis Suites, 4 blunts of dro' and 2 hot dykes\nThey clit piercings 'll glisten like a fuckin' flashlight\nHungover off old liquor and a new spike\nI'm living so trife\nBut nevermind me hoe, cause this is my life\nIt represent 40 days and fuckin' hot nights\nOn a corner sellin' hope right through a crack pipe\nNow say my name right!  Now say my name right!\n[female voice] It's just Killer Mike!\nYou gotdamn right!\nI be the first to speak and shoot, the last to take flight\nPushin' 160 on I-20 with no headlights\nIt's pitch black night\n151 and Cali chronic got my eyes heavy as headlights\nAlpines screamin', competing with dual Flowmaster pipes\nHere's what they sound like!\n\nThis is sex, drugs, rap and roll\nCorrupt your soul\nPop your roll, dope some mo\nThrow your life away and smoke\nHit the floor and throw bow!\nGrab a hoe and lose control\nThis is our life, sex, drugs, rap and roll!\n\nI grew up in a hard hood\nOn some hectic shit, got demons to reckon with\nDrown myself in decadence, every trap i'm checkin' in\nI ain't Kobe, all my bitches look ethnic\nDark, thick, pierced tongues tits and clits\nSome thick other chick catch us in the GC\nGettin' lap dances from the same bitch, lame bitch\nHot twat in the Marriot\nFire brains and jism stains left as forget-me-nots\nMy soul rotten, this whore freaked, fucked and forgotten\nSnort until my nose snottin, drink until my liver spottin\nFace fuckin' and pill poppin', this is rap n' roll\nFuck your hip hop'n\nShe wanna ride it, until its limp and runny\nWith a jolt of jizm left in her jazzy tummy\nShe wanna hold my love for 9 months\nI can't front, i'm in lust with 9 cunts, with 9 cunts\nCuz, cause...\n\nThis is sex, drugs, rap and roll\nCorrupt your soul\nPop your roll, dope some mo\nThrow your life away and smoke\nHit the floor and throw bow!\nGrab a hoe and lose control\nThis is our life, sex, drugs, rap and roll!\n(2x)\n\nLame bitch, continue dick dodgin' and nut duckin'\nImma keep gat clutchin' and nut bustin'\nGettin brains watchin' 2 hoes face fuckin' to entertain\nIt's a shame hoes 'll break they toes to escape a nigga's game\nAnd lay with a cockless bitch with a fade and a nigga's name\nSexy sad and useless, chin and pussy leavin' bruises\nBull daggers I can't blame, I love to see perversion in the game\nI don't care what frame it come in\nShe need a tongue to keep her cummin', you better keep her comin\nEventually, there a need for a dick to come in\nAnd have her cummin' from the inside out\nTo pull her guts from the inside out\nHoe fuck yo girlfriend, swallow this shroom\nClose yo gotdamn mouth, boy, bitches better watch out\nWhen rappers come through in a whirlwind\nBitch niggas and dykes better cuff they girlfriends\n\n\nThis is sex, drugs, rap and roll\nCorrupt your soul\nPop your roll, dope some mo\nThrow your life away and smoke\nHit the floor and throw bow!\nGrab a hoe and lose control\nThis is our life, sex, drugs, rap and roll!\n(2x)"}]}