{"songs": [{"year": "2016-10-13", "image": "https://images.genius.com/dd357fe2272c9c5791a8380b92d99d83.500x500x1.jpg", "title": "Free Agent", "album": null, "lyrics": "[Intro]: Big KRIT & Breakfast Club\nDJ Envy: \"Def Jam didn't really support, uhhh...\"\nCharlamagne: \"I was shocked they put your album out. I'm not gonna lie to you.\"\nKRIT: \"For real you were shocked?\nCharlamagne:  I mean, I knew you had an underground following cuz of your mixtapes and stuff..\"\nDJ Envy: \"They wasn't ready\"\nCharlamagne: \"...but I was shocked that they actually put your album out.\"\nAngela Yee: \"How many more mixtapes did you end up putting out before they released your album?\"\nKRIT: \"I mean exactly\"\nAngela Yee: \"I know you did a lot of touring...\"\nKRIT: \"Yeah\"\nCharlamagne: \"I knew people in the Def Jam building who was like, 'man..' I say when the Big Krit album coming out? And they say 'NEVER.  Ain't gonna sell no records.'\"\n\n[Verse 1]\nI built it from the ground up\nAct like they found us\nFrom the sign of the label, tried to drown us\nI built a boat in a moat for my castle\nI graduated to a businessman, I got tassels\nAnother chapter, another story, another plot\nMother fuck the ball in their court, I took a shot\nThree presidents in 5 years, I never stopped\nWhile they worried about the single sales--\nThe albums flopped\nOh Lord, Lord, Lord there they go\nTrying to fuck me out another but I ain't a ho\nI produce and write my own shit, I know the score\nI'ma drop another mixtape, and go on tour\nWe ain't playing games man, I'm too grown\nFor you to try to take me out my motherfucking zone\nFor you to try and tell me I ain't motherfucking known\nI guess I gotta do it how I done it on my own, UH\n\n[Hook]\nI been a free agent nigga\nI been a free agent nigga\nEven when I was signed\nIt was multi til I die\nI've proven motherfuckers wrong\nEvery got damn time\nI been a free agent nigga\nI been a free agent nigga\nNaw they can't hold us\nPut the whole team on my shoulders\nNow there's money on the way\nBecause the contract's over\n\n[Verse 2]\nWhat good is a team if they don't ball out with you?\nDomino niggas they'll fall out with you\nAt the table with the majors they go all out with you\nTil you're underground with it, they won't crawl out with you\nSo they serve, serve you a plate\nFull of scraps and the bait\nYou ain't eating so you ate\nYou ain't moving so you shake\nWhat you can\n'cuz you gotta drop another album\nBut ain't make a mother fucking dollar, OH!\nMane it's hard to understand\nHow they rob a nigga then shake his other hand?\nHow I hit the road when I ain't never have a chance?\nHow I sell out shows and I ain't even make 'em dance?\nHow I ain't a gimmick but I got all these fans?\nHow I made in merch what you got in your advance?\nHow I work the tape like I was bagging up the grams?\nHow a country boy took that country shit and ran?\nUH\n\n[Hook]\nI been a free agent nigga\nI been a free agent nigga\nEven when I was signed\nIt was multi til I die\nI've proven motherfuckers wrong\nEvery god damn time\nI been a free agent nigga\nI been a free agent nigga\nNaw they can't hold us\nPut the whole team on my shoulders\nNow there's money on the way\nBecause the contract's over"}], "artist": "Big K.R.I.T."}