{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Production by Robert Brown & DJ Clash]\n\n[Intro: Mister Cee]\nI be the cruddy one that they call the DJ Mister Cee\nWith the whole Wolf Pack in the place to be\nBetter known as the Chocolate City\nSo Scoob Lover, huh, are ya with me?\n\n[Verse One: Scoob Lover]\nYo, I break punks up like a fight. Give me the mic, I'm hype\n(Damn kid, you're starvin' for life)\nCause people be tellin' me, brothers be gellin' me\nTryin' to get fame from my name but they chumps and they Butt-soft\nThey know I'm wilder than a dog with hot sauce\nA mic, a stage, a crowd, and I won't stop:\nI set it off and get live like an alarm clock\nPeople thought Scoob and Scrap was just a nickname;\nNow that we rap, we sell more records than cocaine\nAwww, shucks, now I'm back from the down-low\nHere comes Scoob with the curly afro\nNo chemical reaction, no need for askin', pure satisfaction\nMy last name's Jackson\nYou slip up, I get ill -- my boot to your grill\nMy nine kills, I'm Big Scoob from Brownsville\nThe world's greatest lover, the chaaaaa-clate brother...\n\n[Chorus]\nWho's the committee? (CHOCOLATE CITY!) 3x\nScrap Lover are ya with me?\n\n[Verse Two: Scrap Lover]\nYo, I drop science kinda like a pigeon;\nOver rough tracks I tax any midget with a small digit\nSmooth and mild but complicated\nI put the crowd to to smashed like a driver that's intoxicated\nRappers write rhymes, and talk about guns and jail\nBut wouldn't squeeze a lemon in a cocktail\nDon't say \"huh?\" or \"what?\", and don't ask who\nCuz if you hear me, I must be talkin' to you\nYou probably thought I couldn't steal it, cuz I was a dancer\nI didn't have a chance, but ya'll can kill it\nYou gotta be off your rocker\nI'm lettin' suckers know that Scrap got more soul than Foot Locker\nAnd if you heard I got skills, believe it's true;\nSuggest for Pete Rock, for reminiscin' over you\nIt's not a threat, it's a bet, cuz hey\nThe last sucker who tried woulda been 25 today\n\n[Chorus]\nWho's the committee? (CHOCOLATE CITY!) 3x\nBig Daddy are ya with me?\n\n[Verse Three: Big Daddy Kane]\nYo-yo-yo-yo, look out, get out the way!\nHere comes the K the A the N the E -- huh, ya better flee\nCuz I don't need no hoodie to be hard, shoot:\nI'll kill a nigga in a three-piece suit\nI don't be havin' it so the rear I'll attack\nA size-15 to the buttocks, a-matter-fact\nA hard-core blow to the face I'll provide\nTo give you a Crooked eye, just like St. Ides\nLeave you home and you must be screamin' and yellin';\nNot even Kool Moe Dee shades can hide your swellin'\nI bring it rough, tough;\nI said that I was Browner than Bobby, so you know that it's good enough\nI'm untouchable to rappers my size\nYou dreamed of beatin' me, you better wake up and apologize\nSome claim to be a Daddy or Poppa\nBut with me, you'd have no Ranks if your name was Shabba\n\n[Chorus]\nWho's the committee? (CHOCOLATE CITY!) 3x\nNow you know you'd too like to be with it...\n\n[Verse Four: Li'l Daddy Shane]\nShane, I cause pain, I make it rain\nI'm wearin' and tearin' down to the last grain\nHa, I'm not a chocolate brother, but I dont' mourn\nCuz I swear this vanilla kid got it goin' on\nSo don't even step to me if you're worth nothin'\nBecause I just might hurt somethin'\nMy competition thinks twice, cuz yo, for a young nigga, I'm kinda nice...\n\n[Laree Williams, singing]\nOoooooooooooohhhh! Chocolate City are ya with meeeee?!\nScoob and Scrap and Mister Cee! Kane and Shane and Laaaarrrrreeeeeee!\nKaaaaaane....would your black ass sing it for mee-heee?!\n[Kane] Ohhh, ho, shit yeahhhh! [laughter]", "image": "https://images.genius.com/b6cc17d62fd6810516cc285d9804a8ab.1000x1000x1.jpg", "year": "1993-05-25", "title": "Chocolate City", "album": "Looks Like a Job For..."}]}