{"artist": "G-Dep", "songs": [{"title": "Head Over Wheels", "album": "New York Reality Check 101", "year": null, "image": "https://images.genius.com/ff892632b5b25bc11d0f5f14e81c90ed.1000x1000x1.jpg", "lyrics": "[Verse 1]\nI guess I troop, honey, what the scoop? You're kinda cute\nFuck, your man is drivin' Coupes? I use my climbing boot\nBlasé-blasé-blah, I'm not a star, I don't have a car\nFuck all the chatter, you cannot have the bra\nPeep the framework, see if the game work\nHeard she gave my man herp', the same dirt\nOn the same skirt, as the week pass\nIt's like the freak fast, catchin' whiplash when the Jeeps pass\nThrow on the switch just to get rich\nCall you hon' before I bag it, after that, it's chickenhead bitch\nI only got the digits when I met you\nTootsie had a Benz, he boned your friends and got some head too\nRight? Hoes don't doze 'cause the mic goes\nPop, when I rock, ocks gon' be psycho\nBut that's another matter, this ain't a love of splatter\nSo I can ?? rock and duck ?? rumps that's fatter\nLike, I know it's looking right at the stoplight\nPulled the Jag up, you get bagged up like this was Shop-Rite\nI guess it's all that, layin' like doormats..peed\nWhen I make this hit you try to catch me\nI told her, ?nine-sixty years? all the papers near\nNow I need me a gasmask til all these vapors clear\nFor hours, with all her powers just to see how\nYour Range Rover feel, on the real, that's head over wheels\n\n[Chorus: G-Dep]\nSo what's the deal huh?  Let's keep it real huh?\nYou like these wheels huh?  Tell me how they feel huh?\nHead over wheels huh...\n... uhh, head over wheels huh, uhh\n\n[Verse 2]\nYo honey bust it let's discuss it for a little bit\nI know the middle stick, so go head with your little tits\nA nigga rollin' in the car from taggings, lookin' type ragged\nOn the night racket, concoctin' Reeboks and the flight jacket\nBut that's OK 'cause when you play there's a price to pay\nA small way, tend to hallways, twice a day\nDon't front though, I make the flow through the gut slow\nOr the butt, ohh, made her scream like I struck gold\nThat's cold, better yet it's freezin', honey steady teasin'\nTis the season for skeezin', no teasin' just some heavy breathin'\nHoe pros and when she blows, only heaven knows\nNo clothes, ohh! Got that fifty-four-eleven though\nThat trick, I guess I tricked for this pair of kicks\nJust to gas 'em, have her girlfriends askin' \"Can we share his dick?\"\nDivide it equally, and dick it frequently, they always beepin' me\nWe do this secretly, so yeah don't speak to me\nGet 'noid with Floyd, creep up the backstreet ain't that sweet\nYou don't see them hookers in this backseat\nTime and time to get the rubber grind, I guess love is blind\nOr he caught you in your eye with his brother's nine\nI'd rather use my know of flicks, and the known face\nWatch 'em plead just to get them keys on your court date\nHon Dawn got it goin' on, since you're gone pal\nYour man Shawn get the horn now, pow\n\nChorus 2X\n\n[Verse 3]\nI lift this honey in the air, like no gravity\n'Cause of her thoughts, now she's in the porch of insanity\nSo as you enter, since you commence to\nPlay the role, you gon' play the coal in the winter\nAnd if you get another fuck it, fuckin\nNo less than her circumference then I'm hosted in another bucket\nI be the one to pass by ya with the cash kinda, crass\nYou still behind that ass in the Pathfinder\nTryin' to front like she fond of niggas and ganja\nTil I pull ups on ya, why? To get menage-a-trois\nIn the car with Rhonda, hitting it 'til she smell herself\n'cause she sell herself like Hondas\nThese bitches is bugged, all thugged out\n'Cause I told her the ride was over GET THE FUCK OUT\nGet your Lugz out, get to walkin, that's how the wind blows\nPower windows so I can't hear the shit you talkin\nYou wanna drive stick, combine my prize with\nChinky eyes with lye lit, all that old fly shit\nBut wake up, without makeup, and get the clear view\nOnly place I'll be seein' you is in the rear view\n\nChorus 2X"}]}