{"songs": [{"album": "Bad Season", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg", "year": "2010-12-23", "title": "All Day All Night", "lyrics": "(Cookin' Soul)\n\n[Hook: Krizz Kaliko]\nThis ain't nothing like a nine to five\nA superstar now, it's your life\nMarried to it like it's my wife\nI gotta be Tech N9ne!\n\nAll day, all night (4X)\n\n[Verse 1: Tech N9ne]\nI wrote my life down from '85 to right now\nAnd my style had a heap of people just like \"Wow\"\nSchizophrenic, grim and venomous lyrics with a slight growl\nI was destined to be Tech, to rip and excite crowds\nSo my pals think after I rip the mic down\nIt's lights out and right to the pillow of my right eye brow\nBut when I chow I stay up and write sounds\nI like loud, I stay wake and create late like a night owl\nMeeting deadlines, serious as fed time\nThey said I'm extremely different and I head mine\nI wed﻿ rhymes, married to this game and my bread's fine\nThat's why I'm always rocking classic J's, the red kind\nWith that said I'm always up in y'all sights\nSome think it's all wrong, being spotted it's all right\nThinking that I'm the no type is all hype\nI ain't got a problem with being Tech all day and all night\nFor real\n\n[Hook: Krizz Kaliko]\nThis ain't nothing like a nine to five\nA superstar now, it's your life\nMarried to it like it's my wife\nI gotta be Tech N9ne!\n\nAll day, all night (4X)\n\n[Verse 2: Tech N9ne]\nI write my flows and record them, I do my shows and we floor them\nAnd so they go, let's reward them with merch and ticket sales\nThat's why my clothes I afford them, this love I know never short 'em\nSo why would I go and abort them and curse and give it hell?\nThey spot me at the movie, sippin', tryna press a newbie\nGetting through these a hectic next to me singing my message to me\nBut I never get vexed the scroogie when I'm at the Ruby Tuesday\nThat's a doozie, follow me for autographs when I'm set to dookie\nThat's TMI, whether on the street or fly\nWith the need desire to be seated high and this heat is why\nEven sometimes I be down and dark they all bright\nLifting me up, being Tech Ninna all day and all night\nYeah\n\n[Hook: Krizz Kaliko]\nThis ain't nothing like a nine to five\nA superstar now, it's your life\nMarried to it like it's my wife\nI gotta be Tech N9ne!\n\nAll day, all night (4X)\n\n[Verse 3: Tech N9ne]\nEy, they even find me up in Wal-Mart\nAnd give me coochie coupons, sexy mamas be all heart\nEven at the Mandalay Bay I'm off in the mall parked\nChicks looking for me, patrolling the area like Paul Blart\nAnd it be the same when I'm with the chiefs to gain\nPeople greet me, heat arraign, sleep, they need to meet the Strange\nCat cause he became the creature sent to eat the game\nSpeaking of eat the pizza came in the beast in frame of the pizza mayne\nAt the funeral, taking pictures, near urinals\nNot only when I'm on tour, you know where I'm stepping, they're sure to show\nAnd it's a blessing, even if I'm stressing I'm durable\nAnd you're to know, to do this like Tech you have to endure to grow\nYo\n\n[Hook: Krizz Kaliko]\nThis ain't nothing like a nine to five\nA superstar now, it's your life\nMarried to it like it's my wife\nI gotta be Tech N9ne!\n\nAll day, all night (4X)\n\n(Bad Season)"}], "artist": "Tech N9ne"}