{"artist": "Ice Cube", "songs": [{"title": "I’m Only Out for One Thang", "lyrics": "[Intro: Flavor Flav]\nHey yo Cube, man, hey yo Cube, check this out\nYo, motherfuckers be on the dick and shit, right?\nCheck this out, you know what I tell 'em, man?\n\n[Verse 1: Flavor Flav]\nWell two peas in a bucket\nMother motherfuck it\nYou either Flavor Flav it\nOr you Chuck Chuck Chuck it\nKiss my ass and suck the D.I.C.-\nK. stands for kill so don't fuck with me\nI fucked that lady in the bed\nI missed that pussy and the butt was spread\nI tried it again in a thumping wagon\nThe bottom fell out and her ass started dragging\nTried it again in a field of grass\nI missed that pussy and I bust my ass\nThen I fucked this lady in the tree\nThe baby came out and said \"Run-DMC\"\n\nYeah, and you don't stop\nFlavor Flav in the house, and you don't stop\nIce Cube's in the house, and you don't stop\nHey, my sugar (Hey, yo, rock that shit G!)\n\n[Verse 2: Ice Cube]\nI knew this girl who looked just like you\nLight brown and a fly hairdo\nI wanted to do her, screw her\nSo I stepped to her on key\nBitch had more ass than a donkey\nI said you're the type of girl that I can't pass over\nGive me one chance and I'll bend your ass over\nJust call me the plumber at the end of the night\nCause a nigga like me'll lay plenty of pipe\nShe didn't get offended it was splendid to me\nCause mister nice guy is what I pretended to be\nI guess I'll just wine her and dine her\nAnd by the end of the night I'll be behind her\nWaxing that ass like Raindance\nOn the bumper get the pussy then I dump her\nTook her to the Comfort Inn, tucked her in\nPulled out the third leg pumped it in\nShe said 'Will you call me?'\nYeah, I'll call you a bitch or a ho after I ball you\nNaw I'm just playin' but it's still the same\nCause a nigga like Ice Cube is only out for one thang\n\n[Outro: both]\nFF: Yeah, what you out for?\nIC: Yo, I'm only out for one thing\nFF: You out for what, man?\nIC: Yo, I'm out for the pussy, the money, and the mic, and I'm straight. What are we out for?\nFF: I pledge allegiance to the uh... to the fuckin', all of that shit. Know what I'm saying?\nIC: Five thousand!\nFF: Five thousand, G\nIC: We out\nFF: Yo, we out of here, five thousand\nYo, this is for my boy Ice Cube, you know what I'm saying\nYo, check this out", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16"}]}