{"songs": [{"year": "2012-02-27", "album": "YouTube Promotion Tracks", "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Kerser Is Sick", "lyrics": "[Intro]\nLet me explain something\nKerser\nKerser\nKerser is sick!\n\n[Verse 1:]\nWhat it is, it's the man of the moment\nAnd any other moment that they claiming I own it\nKerser flavour, yeah I sprinkle on top\nThey hanging like a junkie needs a hit, I'll sprinkle a lot\nSo good with rap, no looking back\nShit there beef gets wrapped like cooked kebabs\nI'ma light this spliff, you can ride this dick\nI get the flu, people hang around to try and get sick\nIt ain't likely kid, I was born with this\nThis is bad for your brain, there's your warning bitch\nAs I pour a mix and chop fourteen sticks\nThat's a half oz here like my family mix, ya dig?\nIf not, fuck off, you must stop\nI'll take you to the top, fucking oath so you can jump off\nNo more games, shit you know me by now\nAnd if ya haven't heard ya best to know I'm owning the town, bitch\n\n[Hook:]\nPut 'em up, raise 'em up, we gon' get high\nYes I demand that I'm the best I\nWill never stop 'till they murder me, shit\nYou should have fucking knew it bitch, Kerser is sick\nPut 'em up, raise 'em up, we gon' get high\nYes I demand that I'm the best I\nWill never stop 'till they murder me, shit\nYou should have fucking knew it bitch, Kerser is sick\n\n[Verse 2]\nI walked in, kicked the door like \"hold up, nah wait wait\"\nI used that last time, let me set it straight mate\nThe sickest is back, ridiculous rap\nHold the fingers like that and hurt your missus's flaps\nThey asking 'bout me, where's he going, is he singed, no\nYou giving me a contract and you think I'm gonna sign, no\nI did it myself, I wanna keep it that way\nPile up the ashcay and waste it on a mad day\nThe way I'm living man they pay me to bounce\nWhile my fans sing my shit, they gotta say it out loud\nYou can find me at the club, rubber band around the notes\nWho said I never made shit? I gotta jam it down their throats\nCertainly the sickest, got me hurting all you bitches\nThen they turn on me for instance cause I'm burning all their lyrics\nHit me back, come and see me on my death bed\nWith a zombie bitch getting head, dead set\n\n[Hook:]\nPut 'em up, raise 'em up, we gon' get high\nYes I demand that I'm the best I\nWill never stop 'till they murder me, shit\nYou should have fucking knew it bitch, Kerser is sick\nPut 'em up, raise 'em up, we gon' get high\nYes I demand that I'm the best I\nWill never stop 'till they murder me, shit\nYou should have fucking knew it bitch, Kerser is sick\n\n[Verse 3:]\nCome and cruise with me and you will see lad\nI'm the man and that's why I don't listen to their feedback\nHear that, feedback, lyrics here, read that\nYou's all make me sick, gonna make me bring my feed back\nCome close, you can witness a man, talk tough\nNow you're here, you got shit in your pants\nI'm the freshest motherfucker that you've seen for days\nNow I'm paid, eshay, now the green is blazed\nDark red eyes, yeah that's normal for me\nAnd the rest of the boys, ain't it awful to see?\nDo you think we give a fuck, you know the answer to that\nI'm so sick motherfucker yeah the cancer is rap\nI live fast probably die young, celebrate my life cunts\nMake sure when they bury me they puttin' in some nice buds\nRise up and fight for a better way\nAlways off my guts and I can not remember yesterday\n\n[Hook:]\nPut 'em up, raise 'em up, we gon' get high\nYes I demand that I'm the best I\nWill never stop 'till they murder me, shit\nYou should have fucking knew it bitch, Kerser is sick\n\n[Outro:]\nNow, Kerser, we gon' get high, fucking killed it again Nebs\nYou already know what it is, Kerser is sick\nSickest, Sickest (Kerser ain't no joke)\nAin't gon' tell these motherfuckers again, man\nKerser is sick!\nAin't gon' tell these motherfuckers again, man\nKerser is sick!\nBlast your face and kick your teeth in\nRemember that?\nI told you man! I told you!\nK-K-K-K-Kerser is sick!\nNo but you wouldn't listen\nWhy? You stupid fuck, look at you now"}], "artist": "Kerser"}