{"artist": "Ice-T", "songs": [{"title": "I Ain’t New Ta This", "lyrics": "Come on\nCome on\n\n[ VERSE 1 ]\nDo this, ugh, come on, come on\nTime to get wreck and kick the so on and so on\nThe I-c-e-T\nO.G. M.C\nL.A.P.D\nH-a-t-e-\nS (Ho!)\nWatch the mic blow\nI flip scripts, and the Dump drops the Ammo\nTime to get wreck with the new style\nIt's '93 and MC's are gettin buck wild\nBut I - ain't a - nigga\nThat's gonna get left with a big zero as a figure\nI'm gonna end up with a big sum\nCause if you don't like one jam, I always got another one\nDifferent, specifically I don't copy\nTear up the track if the flow sounds sloppy\nI don't play one game\nI bust about a dozen cuts on my lp's, none the same\n\n[ Hook ]\nI ain't new to this\nI ain't new to this\nNever been\nNew to this\nNigga\nNew to this\nI ain't new to this\nFool\nNew to this\nFuck around and catch a left and a right fist\n\n[ VERSE 2 ]\nBoom bam, I drop fat slang\nWhen I used to hustle, used to be down with the crack game\nWhen I was young, I used to roll with a street gang\nIf you wanna squabble, muthafucka, it ain't no thang\nI ain't new to this, I ain't new to this\nBlow your dome, I hit quick as a pugilist\nUgh, ah, what's up? Now your eyes swoll'\nThought I went soft, cause my records went gold\n(Sucker) Buster, you'se a - muthafuckin punk fool\nCaught you in your eye while you reached for your tool\nNow it's mine, and you're blind\nPop-pop-pop-pop-pop goes the nine\nYeah. what you're dissin bout, friend?\nSayin I went out, but you ain't never been in\nI got r-e-s-p-e-c-t in the industry\nThat's somethin that you'll never see\n\n[ Hook ]\n\n(They can get a smack for that) Flavor Flav\n(Yeah-yeah)\n\n[ VERSE 3 ]\nOn and on to the funk track\nBack glass shakin like shit, that's where the trunk's at\nThat's cause my shit's - made for\nNiggas that are hardcore\nBrothers is quick to hook a left to your right jaw\nGirls, come on, girls, come on, girls, come on\nGet your clothes off and the fun on\nGirls, come on, girls, come on, girls, come on\nGet your clothes off and the fun on\nIt's time to check cash\nJump in my 4, hit the switch and lay the ass\nWhile the Klan try to kill me\nBut I wrote 'riot' on my muthafuckin will, gee\nSo when I'm gone, it's on\nCaps goin' off on the streets like popcorn\nTalkin' bout sirens till the early morn'\nWord is bond\nBut now I just cool\nBumpin' my Gang Starr tape by my pool\nI ain't new to this\n\n[ Hook ]\n\n[ VERSE 4 ]\nCheck, check, I got problems with the press\nCaught the punk in traffic, stabbed the sucker in his neck\n(Ugh) Punk reporter tried to diss me\n(Ugh) Now the muthafucka's history\n(Ha) I got to make a break hardcore fat tape\nWord, I don't fantasize, I don't exaggerate\nJust kick correct with the 1-2 mic check\nStill quick to swing, take a sucker to the deck\nI'm not the nigga you should step to like a sucker\nWalk up talkin shit, you best to be a good ducker\nYour posse best to run from my gun\nKeep my nine off safety, and E holds the other one\n(Yeah, sucker)\n\n[ Hook ]\n\n(They can get a smack for that)\n\nAnd you don't stop\n\nFuck, fuck around and get your punk ass dropped\n\nYeah\n\nIce-T\n'93 for the underground\nI ain't new ta this", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}