{"songs": [{"lyrics": "[Uncredited spoken word poet forms the song's intro]\nWith a grin that matched his own she said\n\"You're not a thief, are you?\"\nHe shrugged. \"Do I look like a thief?\"\n\"You look like the most attractive man here.\"\nShe paused long enough to catch his eye;\nOf course looks can be deceiving\nShe didn't say it, but she could picture him pocketing\nA necklace carelessly left in a jewelry box during a big party\nOr a Seiko watch from under a poolside towel\nShe didn't imagine him planning a heist\nBut just taking what came his way\nReturning her smile, he said..\n\n[Aceyalone]\nBout that money, yeahhh.. that's what I'm talkin bout\nBout that money, gettin that money\n\n[Hook]\nBlink Blink - every time you open up your eyes\nBlink Blink - every time you open up your mind\nBlink Blink - yeahhh, yeahhh\nWhat the fuck are people talkin bout?\n\nBlink - every time you open up your eyes\nBlink Blink - every time you open your mind\nBlink Blink - yeahhh, yeahhh\nWhat the fuck these people talkin bout?\n\n[Aceyalone]\nI say it once, I'll say it again\nCold cash money make the whole world spin\nYou can laugh, and you can grin\nBut you ain't sayin shit if you ain't got ends\nSo hold your breath, and wait for God\nAnd when you get here, tell him that you need a job\nBecause shit is hard, in the battlefield\nAnd the next bid'ness deal can get you killed\n\n[Hook]\n\n[Aceyalone]\nThe phone's in my name and it can't be cut off\nThe water and the power and it can't be shut off\nFood, shelter, cheese, I gotta break off, please\nI gotta shake off, that's why I gotta take off\nI'm young and full of vigor, West coast nigga\nTryin to make my pockets bigger from the shit that I deliver\nStay afloat, sell your boat\nSell what you wrote, fuck it, sell dope\n\nYeahhh, yeahhh, what the fuck are people talkin bout?\n... yeahhh, what the fuck do people think about?\n\n[Hook] - 3/8X\n\n[Aceyalone]\nYou should put on a mask, and go in home savings\nWitcho' nuts and yo' heart and yo' forty-five waving\nWestsiders got West cravings\nGod damn motherfuckin money is amazing\n\nYeahhh.. you know money money in everything\n... you know money make the world go round\n... you know money runnin everythang\n... you know money make the world go round\n... you know money runnin everythang\n... you know money make the world go, round\n\nBlink.. {*echoes*}", "title": "Blink Blink", "album": "Hip Hop and the World We Live In", "image": "https://images.genius.com/dde48df06ccd165a12ed0bc40d9c736e.500x500x1.jpg", "year": null}], "artist": "Aceyalone"}