{"artist": "Inspectah Deck", "songs": [{"title": "Shaolin Rebel", "lyrics": "[Intro: sample]\nThis mission is vital—you must succeed. But I'll warn you, you’ll meet with some formidable opposition. The Guardians use finger power and they're experts. But still, the whole future of Shaolin temple depends on your success\nI swear I'll do my best, no matter what the cost\n\n[Verse 1: Inspectah Deck]\nThe whole world watch when Deck go live\nBlack and yellow Wu fitted with them Retro 5s\nPlus the glow all natural, I sweat, no shine\nMan they love me so much the check is X-O signed\nYou can find me in the pits where it ain’t all good\nYou can find me out of town where the scene all woods\nYou can find me near the safe if indeed y'all could\nBut to find me anywhere y'all got to leave y'all hood\nI'm fresh off the jet where the time go back\nThey despise that, watch a hater eyes roll back\nI just laugh, count the money, burn a hydro-sack\nBut if you want it that bad, you know where I post at\nI seen niggas pay the price for they name in lights\nAnd like you can pull it off if you play it right\n(Psych!) You ain't built for it, you ain't seen the blood spilt for it\nYou either kill it or get killed for it\n\n[Interlude: sample]\nYour Highness\nMy Lord, what do you think?\nIt looks quite bad\nAnd that means?\nWell My Lord, I think there's trouble ahead\nYou must go to Shaolin now. Listen, I warn you; don’t fail\nSir\nShaolin will be under my control\n\n[Verse 2: Inspectah Deck]\nYou play a dangerous game knowing you lame\nNow you wanna come fuck with the grain\nYou insane?\nOr maybe that’s your man gas\nYou know your man asks, “How you gang gang with yoga pants and handbags?”\nI don't get it, maybe I ain’t supposed to\nComparin' ‘em to me is like Stop and Shop to Whole Foods\nI'm Scarface at the interview—so rude\nI'm oldschool but still cooking the soul food\nWe gotta lot of devils rocking angel wings\nIt’s 2019 I seen Stranger Things\nEverywhere I appear I'm clear to make a scene\nI'm Blade Runner, gliding on a lazer beam\nWater with the alkaline\nAin't no doubt in mind\nI work ‘em out like a mountain climb\nWith or without your love I'll be fine\nI'll be riding that thin line, I'm runnin' outta time\n\n[Outro: sample]\nCome now, it's time\nHahahahahahahahahahahahaha", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}