{"songs": [{"title": "Boss Up Freestyle", "lyrics": "[Intro: Young Maylay & Deadly Threat]\nUh-huh (Sup?)\nWest sir (Young Mizzle, Deadly Threat)\n\n[Verse 1: Young Maylay & Deadly Threat]\nFirst thang first, I'ma set it off, bang the verse\nAnd yank niggas by they shirts, we from the gangsta turf\nWest indeed, coming to contest the lead\nWith Tech's and vests, so hell yes, the rest should leave\nY'all think this industry weenies claimin' the set?\nI'm from the streets, y'all ain't even seen gangsta yet\nTired of niggas dissin' under they breath, wanna act funny?\nWhen you come back to Cali, we gon' tax that money\nNiggas over here that you payin' for favors?\nGet it clear, beef with Maylay and nay can save ya\nMy behavior? Nothin' like pick up a pen\nThis the Pac-10 and we back trippin' again\nWatch ya speech, niggas fresh up out the streets\nPoppin' heats, while you niggas on ya couch asleep\n[?] with that microphone\nNiggas talkin' all that big shit, [?] pistol\n(Boss ya game up nigga!) And get ya wig blew\n\n[Verse 2: Deadly Threat]\nHow many rappers can fuck with the masters?\nHow it burn, turn MCs into dust and ashes\nY'all don't want it with us, we spit fire\nWash you niggas and put you in the drier\nHold up my nigga, bitch, I'm on the phone!\nWe don't love 'em hoes, we love the lo-lo's\n[?], khakis and chucks, and do-do\nAnd if you wasn't with the business, then whatcha go for?\nAre you ready? Team lead, nigga, roll the dice\n(2005!) 9/11 poltergeist\nI'm from Cali (Yeah!) to Iraq and back\nNutty, sick in the head, nigga clap in raps\nCD's went platinum, we pimp slapped 'em\nI'm tryna get off the block like the undercover cop\nThat robbed the rock from 'em\nWe bump at the jam like a batterin' ram\nBuster ass niggas gotta scatter, scram\n\n[Verse 3: King T]\nListen, young chump, hands up, get movin'\nNot ya hot boy, better still, hot hoodlum\nSet 'em up, blast right through 'em, fuck\nCut a nigga like buck, I ain't gots to shoot 'em (Haha!)\nSlow burner, young king, act turner\nIn so many words, I committed a murder\nIn so many metaphors, trampled and slaughtered\nBoss Up the gang, pump to swing the border (Haha!)\nThey roll down my block, lookin' at him\n88 inches, black rims, black magnum\nBlack 6-4, black fire, black Phantom\nA pimp got a few white hoes, black madam\nStop ya cryin' nigga, sign the line\nBoss Up been my label since '95\nWhen Dr. Dre scooped me, then the math got signed\nIncorporate a nigga, that's the grind", "album": "San Andreas: The Original Mixtape", "year": "2005-07-05", "image": "https://images.genius.com/44cb8027b1b36e7a944f9b7cfc1d7a45.600x600x1.jpg"}], "artist": "Young Maylay"}