{"songs": [{"image": "https://images.genius.com/e5e9f6d31906c159bed2a5108d8d26af.500x500x1.jpg", "album": "Generation Gaming II", "title": "Fly", "lyrics": "[Verse 1: Dan Bull]\nSmith, Stiffy, Skitch, McTwist into\nA Kickflip, Liptrick, quick switcheroo\nYou kids get pissed if we missed a few\nBut we got a fricking big list of tricks to do\nI'm like giving a nuke to Mr. Magoo\nHit the big red button, head butting\nIf you dispute\nThe only way i'll open my eyes to different views\nIs when I'm owning the skies, 360 Degrees\nSkatopia bred\nStraight over your head\nI can't skate, so I play it from my sofa instead\nWhile you're wearing your Ray-Bans and getting a spray tan\nThe British are ripping up the American Wasteland\nDave and Dan are bringing the skill, singing at will\nI'd give my kingdom for a H.O.R.S.E., call me King of the Hill\nRap's Richard the Third\nGap tricking with words\nHa!\nBringing a Flamingo that isn't a bird\nSmack\nHitting the curb like my back wheel\nBut this isn't the certain Thug Life 2Pac feels\nYou won't be having your cap peeled\nBut I might crack a Melon, acapella\nAnd prepare your last meal\nA bit of Stalefish, you're not getting bailed prick\nSo get on your bike lest you get your little Tail Whipped\nYou failed to nail the trick\nYou've been derailed and made to pale into insignificance\nYou silly little-\n\n[Hook]\nI'm a Tony Hawk addict and I\nJump on my board grab it and fly\nFly (4x)\n(2x)\n\n[Verse 2 : Dave Brown]\nFirst of all, I'd like to assure I'm all above board\nBut as gravity attests, I tend to break laws\nThat's legality suppressed when I Spacewalk\nSo I'm always entertained, I'll never skate bored\nHalf work, half play\nThat 50/50 grind\nBut there's two games at stake\nAnd that's the rap and the skate kind\nWhen I hear a hater say that it's only a game\n\"Revert to Manually skating\"\nWhat am I, a Caveman?\nNo way, fam!\nSo don't give me that Lip, Trick\nWhen I flip out, jump up and grab you you'll zip quick\nI'll hit with a Triple Kick, Flip you over, so\nThere's a high chance of a Spine Transfer while I bang this sick mix\nI got them RSI rhymes\nAnd if you disagree I'll be like \"No, Comply\"\nWhile grinding pipes for sure brought nostalgia\nIf one more man misunderstands when I say Tony Hawk's Underground, I'll\nSmack that Hipster and break his Indy Nosebone\nHit him so hard, I'll press his X chromosome\nThen get air so high I'll bring back a boatload of ozone\nAnd tell him what I told Newton: \"just give up and go home!\"\n\n[Hook]\nI'm a Tony Hawk addict and I\nJump on my board grab it and fly\nFly (4x)\n(2x)", "year": "2012-10-30"}], "artist": "Dan Bull"}