{"songs": [{"lyrics": "[Intro: Dr. Dre]\nNiggas Wit' Attitudes\nNiggas Wit' Attitudes\nNiggas Wit' Attitudes\n\n[Refrain: Ice Cube]\nI'm comin' straight outta Compton\n\n[Refrain: Ice Cube]\nWhen somethin' happens in South Central, Los Angles\nNothin' happens. It's just another nigga dead (dead)\n\n[Verse 1: Ice Cube]\nStraight outta Compton, crazy motherfucker named Ice Cube\nFrom the gang called Niggas Wit' Attitudes\nWhen I'm called off, I got a sawed off\nSqueeze the trigger, and bodies are hauled off\nYou too, boy, if you fuck with me\nThe police are gonna have to come and get me\nOff your ass, that's how I'm goin' out\nFor the punk motherfuckers that's showin' out\nNiggas start to mumble, they wanna rumble\nMix them and cook them in a pot like gumbo\nGoin' off on a motherfucker like that\nWith a gat, that's pointed at your ass\nSo give it up smooth\nAin't no tellin' when I'm down for a jack move\nHere's a murder rap to keep you dancin'\nWith a crime record like Charles Manson\nAK-47 is the tool\nDon't make me act the motherfuckin' fool\nMe you can go toe to toe, no maybe\nI'm knockin' niggas out the box, daily\nYo', weekly, monthly and yearly\nUntil them dumb motherfuckers see clearly\nThat I'm down with the capital C-P-T\nBoy, you can't fuck with me\nSo when I'm in your neighbourhood, you better duck\n'Cause Ice Cube is crazy as fuck\nAs I leave, believe I'm stompin'\nBut when I come back, boy, I'm comin' straight outta Compton\n\n[Interlude: MC Ren]\nY'all, a-oh, a-oh\n\n[Interlude: DJ Yella]\nCity of Compton!\nCity of Compton!\n\n[Eazy-E & MC Ren]\nYo, Ren\nWhat's up?\nTell them where you from!\n\n[Verse 2: MC Ren]\nStraight outta Compton, another crazy ass nigga\nMore punks I smoke, yo, my rep gets bigger\nI'm a bad motherfucker and you know this\nBut the pussy ass niggas won't show this\nBut I don't give a fuck, I'ma make my snaps\nIf not from the records, from jackin' the crops\nJust like burglary, the definition is jackin'\nAnd when I'm illegally armed, it's called packin'\nShoot a motherfucker in a minute\nI find a good piece of pussy, I go up in it\nSo if you're at a show in the front row\nI'ma call you a bitch or dirty-ass ho'\nYou'll probably get mad like them bitches are 'posed to\nBut that shows me, slut, you're composed to\nA crazy motherfucker from the street\nAttitude legit, 'cause I'm tearin' up shit\nMC Ren controls the automatic\nFor any dumb motherfucker, that starts static\nNot the right hand 'cause I'm the hand itself\nEvery time, I pull a AK off the shelf\nThe security is maximum and that's a law\nR-E-N spells Ren but I'm raw\nSee, 'cause I'm the motherfuckin' Villain\nThe definition is clear, you're the witness of a killin'\nThat's takin' place without a clue\nAnd once you're on the scope, your ass is through\nLook, you might take it as a trip\nBut a nigga like Ren is on a gangster tip\nStraight outta Compton!\n\n[Interlude: DJ Yella]\nCity of Compton!\nCity of Compton!\n\n[Pre-Verse: Dr. Dre]\nEazy is his name and the boy is coming\n\n[Verse 3: Eazy-E]\nStraight outta Compton, is a brother that'll smother your mother\nAnd make your sister think I love her\nDangerous motherfucker raising hell\nAnd if I ever get caught, I make bail\nSee, I don't give a fuck, that's the problem\nI see a motherfuckin' cop, I don't dodge him\nBut I'm smart, lay low, creep a while\nAnd when I see a punk pass, I smile\nTo me it's kind of funny, the attitudes showin' a nigga drivin'\nBut don't know where the fuck he goin', just rollin'\nLookin' for the one they call Eazy\nBut here's a flash, they never seize me\nRuthless! Never seen like a shadow in the dark\nExcept when I unload, you see, it's about to over the hesitation\nAnd hear's the scream of the one, who got the last penetration\nGive a little gust of wind and I'm jettin'\nBut leave a memory no one'll be forgettin'\nSo what about the bitch who got shot? Fuck her!\nYou think I give a damn about a bitch? I ain't a sucker!\nThis is the autobiography of the E, and if you ever fuck with me\nYou'll get taken, by a stupid dope brotha' who will smother\nWord to the motherfucker, straight outta Compton\n\n[Outro: DJ Yella]\nCity of Compton!\nCity of Compton!", "album": "Straight Outta Compton", "year": "1989-03-27", "title": "Straight Outta Compton (Extended Mix)", "image": "https://images.genius.com/e1cd88600644ee4fe92637066ecd76fc.600x600x1.jpg"}], "artist": "N.W.A"}