{"artist": "Pill", "songs": [{"album": "Over The Counter Drugs", "title": "I’m Hard", "image": "https://s3.amazonaws.com/rapgenius/Pill-31.jpg", "lyrics": "[Verse 1: Pill]\nYeah, I put the H up in hard\nWhile I'm signing in I [?] start\nPrepare for the test, bubble MC's\nHave a crack when the speed elevating, salivation\nAt the skill I won’t peal so it reeps\nCome and get a slice, think twice 'fore you reach\nMuch less backing up\nHarder than the bathroom tub\nHarder [?]\nHarder than some shit when you’re constipated\nHarder than my dick fucking yo old lady\nHarder than some seats on a bubbling bus\nHarder than a street in the end of the test\nHot damn, high jam, 5 grams of harder\nYou whipping out the L's in the water\nWho next? who flex? Break that dudes neck\nPeel harder than that 2 ticks\n18, make fiend, get deep with the throat\nHard like cheek on the flow\nMy nigga you might want to rock on a level\nThat probably get enticed on a level like me [?]\nHard not like white T\nSchool days getting on the first\nEye blib, concrete\nNow speak shit that’s granted\nHarder than the capital states goddammit\nLike wow, rifle, 3 stomps\nSpeedball that describe me\nLets just live right, need an IP\nIV poison, when I get to nudge in\nFollowed up with the 9 guards\nWho's Chuck Norris?\nHard like a motherfucking hardball\nI get nervous, when I see a SWAT car\nHard! Let 'em go on the boulevard\nWalk like already in a bouch of [?]\n\n[Hook: Pill]-[X8]\nI hope you sent your prayers to god\nCause motherfucker I’m hard\n\n[Verse 2: Yelawolf]\nYeah, Harder than a baseball  to the jaw\nHarder than a fall from a 20 foot fall\nKick a concrete football\nIn a pair of sandals from a 100 yards\nTop hitting on mine and ya'll, thinking of mine and ya'll\nPartying hard and ya'll, drinking a vodka ya'll\nGive me the bottle motherfucker\nA pirahna is underwater that’s right\nIt’s coming to kill me, in the river, stir liver\nCrazy white boy, Pill’s the killer\nPut me in a room with 32 dudes\nWith the word [?] and I'll still be iller\nCan as Miller, can’t even load it\nDid you notice plan this shift\nIs it just me who will never get sleep\nCause I’m all around the world like Captain Silver\nYeah [?]\nI got a sack of real world\nHow about a syllable [?]\nThat run’s on me, the next one comes with a fee\nI’m kinda like a step daddy, if you come home late\nThe next one comes with a beating\nI’ll pick ‘em up in a pickup truck\nI'mma a pick a fight I don’t give a fuck\nI don’t give a half\nCause if I sit up in a quick ball\nYou could be the victim of a little bit of tie\nCulturally influencing the Sean Carter way\nCrossed over in the motherfucking game\nCause I whipped up in a harder way\n\n[Hook]", "year": null}]}