{"songs": [{"title": "Best Friend", "lyrics": "AKIR - “Best Friend”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Intro: AKIR]\nYeah.  Yeah.  Yeah, yeah, uh.  Uh, uh, uh, uh, uh, uh.  Yeah.  Uh, uh.  My best friend is music, man.  Can’t never go wrong with music, B.  Uh.  As long as you reflect your surroundings and what it means to you (Uh huh), people’ll love you.  See?\n\n[Verse 1: AKIR]\nYo, survival is a gamble, so I’ll bet my life on\nA scramble, refuse to take the role of a sambo watching\nNiggas get trampled, cops playing they’re Rambo\nHandle my position like a nigga out of prison, see\nThe world into shambles like a gun spitting in a crowd\nSubtle, I’ll move humble, though my effect is loud\nTrouble?  I’ll use muscle.  My teacher’s well-endowed\nSwitching style, math for the street, science to teach a child\nAnd my alliance is among the most defying.  I ain’t\nLying, I ain’t eyeing.  My people headed to Zion in a\nBenz tinted—can’t see through the percentage on a\nRoad to riches.  Won’t stop until we finish\nExhibit the skills and do it and spit it like boundless fluid\nDrink it up—it’s therapeutic, it burns, but you’ll get used to it\nI’ll hold my head so I don’t lose it.  And pain is\nFar, pursuing, but, close to me, my best friend is always music\n\n[Hook: AKIR] (x4)\nAyyo, my best friend is music, the sheets are the street\nThe pen is my game and the beat is my heat (This is real life music)\n\n[Verse 2: AKIR]\nUh, scripts I’ll flip expose the shift that con-\n-tradicts our chosen gifts.  Emcees, hold your shit\nThere’s little seeds that live and breathe, grow up and\nBelieve in what you preach on your latest CD.  If it ain’t\nReal, then it ain’t right.  There’s no appeal and\nYou ain’t tight.  The smoothest takeover that you ever\nSeen in your life.  It’s over, soldier.  You sold\nYour soul to a cobra playing Poker with Jehovah\nTo get closer to an extra breath hit, was it worth the effort?\nIn current depth, which means you turn to step and fetch it.  Chained\nTo a platinum plaque, but your LP’s wack.  You can’t\nGo forward, nigga, without giving back, and so\nMy best friend is music and these sheets are the street\nThe pen is my game and the beat is my heat\nSo this is real life music, pump like the heartbeat\nLike my niggas’ footsteps on the concrete\n\n[Hook: AKIR] (x4)\nAyyo, my best friend is music, the sheets are the street\nThe pen is my game and the beat is my heat (This is real life music)\n\n[Outro: AKIR]\nYo, this is real life.  Nah’mean?  We gon’ take it back to the essence of what it means to really be an emcee and reflect the things around you.  There’s trials and tribulations out there that could be focused on.  And these everyday struggles that this common man that buys your cassette, CD, record has to listen to to help him through his journeys in life.  Figure out what your plan is, man, and focus, get back to where you come from.  One", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}