{"artist": "Bas", "songs": [{"lyrics": "[Intro: Bas]\nMy nigga just made bail\nMy nigga just made bail\n\n[Verse 1: Bas]\nMy nigga just made bail\nI just came up, On some grey 12's\nGreat health, cheers to that\nDo this shit for Queens got my ears to that\nThey hate us but, not more they hate theyselves\nI guess that they gotta motivate theyselves\nWe can never correlate, you will never see my plane\nRight in front of you but your vision is so plain\nI see it more vivid, seen it all, did it\nRound these fake fucks still keep it authentic, granted\nGive or take fucks, how your measures rate us\nDamnit, you'll never understand it\nAnd even though I'm so lit\nI've seen the cards handed and I replayed mine\nHell yeah I'm on tilt\nBut I'm never off handed, gotta keep good time\n\n[Pre-Hook: J. Cole]\nFree your mind and everything'll follow, won't you\nFree your mind and everything'll follow, won't you\n\n[Hook: Bas]\nMy nigga just made bail (won't you)\nMy nigga just made bail (won't you)\nMy nigga just made bail (won't you)\nMy nigga just made bail\n\n[Verse 2: Bas]\nListen when you get a blessin you don't ask why\nYou just pass forward, and fast forward\nAll my niggas from the hood got a passport\nAnd them girls already know we ain't ask for it\nSaid she from the hood but her ass foreign\nDrive a Malibu but her gas foreign\nHer aspirations I can't relate with\nBut I'm like a ghost cause my ass tourin'\nBurn holes in all my clothes\nBut I got merch and this cash for it\nGlass floors and no ceilings\nHow I wish we could both feel it\nFor all the ones gone cause I miss your breathing\nAny y'all saw came any y'all part\nGotta race cars\nPenny my thoughts, nah this shit premium\nBas\n\n[Pre-Hook: J. Cole]\nFree your mind and everything'll follow, won't you\nFree your mind and everything'll follow, won't you\n\n[Hook: Bas]\nMy nigga just made bail\nMy nigga just made bail\nMy nigga just made bail\nMy nigga just made bail\n\n[Bridge: J. Cole]\nAnd everything'll follow, got to\nFree your mind and everything'll follow, gotta\nFree your mind and everything'll follow, gotta\nFree your mind and everything'll ... Cole\n\n[Verse 3: J. Cole]\nMy nigga just made bail\nTell the good Lord, we gon raise hell\nWe gon pop off, like a fake nail\nTake the top off and get ill get ill get\nMy nigga just made bail\nTell the fuckin mayor he got hate mail\nLess shakedowns and more Shakespeare\nPlease, all these niggas don't care\nPrepare for the new shit, that Cole is the truth shit\nNigga this is Lu shit, nigga this is Bas shit\nMeaning this some true shit, telling you shit\nBout the crew, how we do shit, who sick?\nAnd, tell my niggas in the two-six in the coupe\nI'mma kick back smoke a pool stick\nThis for my new chick tryin get fit say she too thick\nAin't no such thing as too thick, what you wanna be a toothpick?\nWhat you wanna get your cooch licked?\nWell I'm tryna get my flute played\nIf we the new slaves\nI am Frederick Douglass of rhetoric ahead the the others\nYou motherfuckas better get free\nThis for that insecure girl, your name I won't mention\nOn Instagram straight flickin'\nBitch you a nipple slip away from strippin'\nMight as well, get your clientele up, you a pioneer\nThem girls fuck for free, I'm never buying there\nSave that shit for the D.R\nI rock crowns and these niggas rock tiaras or tiaras\n'Cause I'm Pete Carroll, left college and I fucked the pros up\nGuess it ain't luck when the luck just shows up\nLike every verse on the spot, shit is never rehearsed\nYou heard it first, Bas\n\n[Interlude: Ibrahim]\nMy I swear to God, Cole world\nWe doin' it out here, in the UK fool!\nY'all ain't ready, I got Bas the Genius over there\nI got DJ Dummy downstairs\nI swear to God we doing this shit\nWe gon' take on the world\n\n[Outro: J. Cole]\nFree your mind and everything'll follow, won't you, won't you", "image": "https://images.genius.com/8c8242497a7ae3f9893198c96eeca87b.1000x1000x1.jpg", "year": "2014-04-29", "title": "My Nigga Just Made Bail", "album": "Last Winter"}]}