{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "How It All Started", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "MALE MEDIC: You’re gonna be okay. You’re gonna be okay. Uh, yeah, tell ‘em to order a chest x-ray\n\nTARIQ (NARRATION): I keep asking myself, “Why did it have to end like this?”\n\nTARIQ & TRU (NARRATION): But as with every ending, there is always a beginning. And this is how it started\n\n[*flatline*]\n\nFEMALE MEDIC: I think we’re losing him. We’re losing him!\n\n[*alarm clock rings and radio starts*]\n\nTARIQ: [*yawn*] Damn… I only need five more minutes sleep\n\n[*bedroom door opens*]\n\nMOM: Boy, you better get yo ass up and go to work! I told you ‘bout hanging out late with that “studio” shit when you know you got to go to work in the morning. You better start focusing on getting yo shit straight\n\nTARIQ: Yeah, ma\n\nMOM: Tryna get yourself a promotion and stop that bullshittin’ with yo broke ass. It’s not all about pimps and chickenheads\n\nTARIQ: Yo, shut up\n\nMOM: Better go out there and start politickin’!\n\nTARIQ: Aight, aight, ma! Yo, chill! You know you talkin’ a whole lot ‘bout what you don’t even understand!\n\nMOM: If you were smart, you’d be more like Tru! Now that’s a nice young man!\n\nTARIQ: Oh, my God…\n\nMOM: Got a job and working his way up and all. What the dealio?\n\nTARIQ: What, I ain’t working?\n\nMOM: You better get that ass up now!\n\nTARIQ: Pssh…\n\nMOM: Tariq, I ain’t playing with you! At all!\n\nTARIQ: [*sigh*]\n\nMOM: Don’t forget to pick up your sister from LaMeesha’s house tonight. She’s getting her weave tightened, and I don’t want her walking back here at night by herself. You hear me, boy?\n\nTARIQ: She’ll be good!\n\nMOM: Tariq? Tariq!\n\nTARIQ: Tsk, whatever\n\nMOM: Boy, get yo ass up!\n\nTARIQ: AHHHHH!", "year": null}]}