{"songs": [{"year": "2012-10-22", "lyrics": "Intro from \"The Other Guys\" voiced by Will Ferrell\n\nYou don't get it, there is a darkness inside of me. It wants to get out, wants to walk around. It wants some walking around money, and it wants to buy some shoes, and wants to, it wants to walk up to people and say \"hey! Gator don't play no shit! You hea- you feel me? Gator never been about that! Never, never been about playin' no shit!\"\n\nFirst Verse\n\nI was gone for a minute, laws of a menace\nShake, pause, crept up out the door before she change draws\n\nShe was a bust down why decide to trust now?\nPlus I got some business and a hair appointment uptown\n\nBounce, shots fired, just another pierced tires\nMake her stop, Bitch, I, 100s' style twitch eyes\n100s drunk, grab thighs, skeeta mack, wear ties\nRealize the nigga takin' pussies on a test drive\n\nLet's ride, she look better from the left side\nPhone up in my right pocket post up on my left side\n\nWhy rich hoes always got a big nose?\n'N why weak bitches always gotta share clothes?\n'N why ho bitches always gotta share dick-\n'n think that we don't know we both hit it\n'N that shit, that's when bro nigga turn to the ho nigga, no nigga\nJust because you got the stage don't mean you got the flow, nigga\n\nBody(?) ain't shit, might is what we strive fo'\nTaught since we was like fo'(4 years old), money what we die fo'\nTop is what we strive fo', even if we die po'\nGrind until my eyes close, fuck I got a life fo'(ol?)\n\n---\n\nLet her know, let her know, (?) the mack don't love a ho\nLet her see, let her see if she don't see the light then let her be\nLet her choose, let her choose, if she ain't with the program let her loose\nSet her free, set her free, that's the next nigga' job, now let her be\n\n---\n\nSecond Verse\n\nNever cap and save, you work your pack and save\nAnd when you pack and save you blow it on that weight\n\nPut it on that grave that you ain't never late-\nWith that bitch that was astray and never catch you pay\n\nIt gets sick out here, your main bitch out here\n'N always broke, cause these niggas sellin' dick out here\n\nWhat can I do, but light two? sittin' by ya-by you\nThinkin' 'bout more money and the next beat to write to\n\nNever bet\nA hand that you might lose\nNice dudes finish last, yeah nigga, finish that\n\nA real skinny mothafucka got game\nWork up on yo (Jimmy?) mothafucka, yeah, really, mothafucka\n\nOld silly mothafucka, 'n they chillin', mothafucka\nI'll be rockin' leatha 'til I hit a milli', mothafucka\n\nSo I might bend the corner at the red light, hair ties all up on the dashboard\n\nGive me what I ask for, shit, it's almost past 4 (AM), I got a lot to laugh for, bag whores, smash whores, and exit out the backdoor\n\nPussy on tap, hot?, cold, 25 (?)\n\nLight skinned bitch, put yo pussy on my damn face\nDon't touch my sideburns, though\n\n---\n\nLet her know, let her know, (?) the mack don't love a ho\nLet her see, let her see if she don't see the light then let her be\nLet her choose, let her choose, if she ain't with the program let her loose\nSet her free, set her free, that's the next nigga' (job), now let her be\n\n---", "album": "Ice Cold Perm", "title": "’92 Gator", "image": "https://images.genius.com/98d3e3369facf82ee69688c5e541f1f3.1000x1000x1.jpg"}], "artist": "100s"}