{"songs": [{"title": "Afro Puffs (G-funk remix)", "album": null, "year": null, "image": "https://images.genius.com/48e9a0e02d85ec6db66796c8a1a592e1.499x499x1.png", "lyrics": "I rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nI rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nI rock on with my bad self 'cause it's a must\nIt's The Lady Of Rage still kickin' up dust\nSo mm, let me loosen up my bra strap\nAnd mm, let me boost ya with my raw rap\n\n'Cause I'ma break it down to the nitty-gritty one time\nWhen it comes to the lyrics I gets busy with mine\nBusy as a beaver, ya best believe a\nThis grand diva's runnin' shit with the speed of a cheetah\n\nMeet a lyrical murderer I'm servin' 'em like two scoops of chocolate\nCheck it how I rock it\nI'm the one that's throwin' bolos, ya better roll a Rollo\nTo find out I'm the number one solo, uh\n\nThe capital R A now take it to the G-E\nI bring the things to light but you still can't see me\nI flow like a monthly you can't cramp my style\nFor those that try to punk me here's a Pamprin child\nNo need to say mo', check the flow\nRage in effect once mo', so now ya know\n\nI rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nNow I'm hittin' MC's like hit MC's like\n(Hoo yu ken)\nAin't no doubt about it I'm the undisputed\nSo what you uh, wanna do is back on up\nI'll tap that butt, wax the cuts, pass the bucks\n\nSo put your money on the bread winner\nI kick lyrics so dope that the brothers call 'em head spinners\nI got the tongue that is outdone anyone from the rising\nTo the setting of the sun or the moon\n\nI consume the room with doom\nWhen I hear the kick of a 808 bass poom\nBoom, bam, God, daym\nI'm hittin' so hard you could say it's a grand, slam, dunk, punks\nGet broken off for chunk when they feel the funk\n\nOf the rhythm fresh that I give 'em\nLet it hit 'em, split 'em, did it now I'm rid of 'em, yeah\nI put that on my unborn kids\nRage in effect so you know how it is\n\nI rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nI rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nNow ever since my debut, I've continued to lay you\nFlat on your back from the raps that I spat, spit\nOh shit, I'm the shit\nYou can't get wit the Rage then tough tit tie\n\nI pity the fool, that gets with the lyrical murderer 'cause my shit is rude\n(Ooh)\nYou wanna get with the wickedness?\nWith that big botty that's kickin' it, rippin' it apart like Jason\nYou'll be, chasin' a dream like Freddy\nAre you ready for the cream de la creme?\n\nI'm steam pressurin' those who ain't measurin' up\nI keep competitors stuck in the muck with they butt up\nWhat chu wanna nut up like cashew\nDon't you know that I will mash you? For real\nThat's the deal, I'm straight out of Farm ville, VA\n(So what you gotta say?)\n\nI rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nI rock rough and stuff with my Afro Puffs\n(Rage)\nRock on, wit' cha bad self\n\nUh, I am the roughest, roughest, roughest\n(Say what? Say what?)\nI am the toughest, toughest, toughest\n(Rage)\n\nUh, I am the roughest, roughest, roughest\n(Say what? Say what?)\nI am the toughest, toughest, toughest\n(Rage)\n\nUh, I am the roughest, roughest, roughest\n(Say what? Say what?)\nI am the toughest, toughest, toughest\n(Rage)\n\nUh, I am the roughest, roughest, roughest\n(Say what? Say what?)\nI am the toughest, toughest, toughest\n(Rage)\n\nGet with the uh, roughest, roughest\nGet with the uh, toughest, toughest\n(Rage)\nGet with the uh, roughest, roughest\n(Yeah)\n\nGet with the uh, toughest, toughest\n(Rage)\nGet with the uh, wickedness, roughest\nI am the uh, wickedness\n(Rage)\n\nYeah, one-nine-nine-fo'\nThe indo blow and the grass grow\nSnoop Doggy Dogg still don't love a hoe\nBut you gotta give credit when credit is due\n\nWomen back down and bow down to my motherfuckin' homegirl\nThe Lady Of Rage, she rocks rough and stuff with the Afro Puffs\nHandcuffed and she busts and trick biatch\nShe's guaranteed to tear shit up you know what I'm sayin'"}], "artist": "The Lady of Rage"}