{"songs": [{"title": "Big Shit", "lyrics": "[Intro]\n(Yeah)\nYeah, huh\nHey, man, what in the fuck these niggas talkin' ’bout, D. Rich? (Ayy)\nThey cool? (Ha-haa)\nHaha, watch this shit right here, nigga (Yeah, nigga)\nIt's on\n\n[Chorus]\nI said I talk big shit because I am big shit\nTold her ride it like a Dodge, I'ma ram that bitch\nGon’ dip, set on her, Killa Cam that shit (Yeah)\nCount a hundred thousand dollars, rubber band that shit (Ayy)\nI said I talk big shit because I am big shit\nTold her ride it like a Dodge, I'ma ram that bitch\nGon' dip, set on her, Killa Cam that shit (You already know what it is, nigga)\nCount a hundred thousand dollars, rubber band that shit (Yeah, hah)\n\n[Verse 1]\nI be droppin' classics (Classics) and you niggas know that (Know that)\nTM101 (One), what was trap before that? (Huh?)\nHit 'em with that snow flow (Snow), it sound like a throwback\nHeard it at the Chevron, the streets say the snow back\nFeds takin' Kodaks, the burners on LoJack (LoJack)\nOne call say less (Hello?), they come to your door, man (Damn)\nAll about the Benjies (Benjies), I got them before rap (Yeah)\nYou niggas need to thank me (Why?), bitch, I left the door cracked\n\n[Chorus]\nI said I talk big shit because I am big shit (Woo)\nTold her ride it like a Dodge, I'ma ram that bitch\nGon' dip, set on her, Killa Cam that shit (Talk that shit, nigga)\nCount a hundred thousand dollars, rubber band that shit (Let’s go)\nI said I talk big shit because I am big shit (Yeah)\nTold her ride it like a Dodge, I’ma ram that bitch (Yeah)\nGon' dip, set on her, Killa Cam that shit (Uh-huh)\nCount a hundred thousand dollars, rubber band that shit (Yeah, hah)\n\n[Verse 2]\nStill talkin’ for the niggas, understand that shit (Yeah, hah)\nI'm smokin' like a hookah, gotta fan that shit (Moti-104, nigga, hah)\nAin't no way you gettin’ snow, you had to plan that shit (Plan that, yeah)\nHad to hustle so strong, they tried to ban that shit, hah (You niggas know what that shit is, huh?)\nThrew that Jiffy in that bitch and Peter Pan that shit (Yeah)\nSplit a whole one down the middle, Jackie Chan that bitch (Huh? What's up?)\nWest side Macon, Georgia, yeah, I ran that bitch\nNiggas see me still standin', they can't stand that shit, hah (Yeah)\n\n[Chorus]\nI said I talk big shit because I am big shit (Ayy)\nTold her ride it like a Dodge, I'ma ram that bitch (That bitch, yeah)\nGon' dip, set on her, Killa Cam that shit (Only what they wanted, nigga)\nCount a hundred thousand dollars, rubber band that shit (Moti-104, nigga, yeah, let's go)\nI said I talk big shit because I am big shit (Woo)\nTold her ride it like a Dodge, I'ma ram that bitch (What's up?)\nGon' dip, set on her, Killa Cam that shit (Woo)\nCount a hundred thousand dollars, rubber band that shit (Yeah)\n\n[Outro]\nWoo, yeah\nI be droppin' classics and you niggas know that, huh\nWho the fuck sayin' what? Ha\nNiggas ain't fuckin' with this\nWhere he at, where he go?\nI ain't never seen 'em, ain't never heard of 'em, I ain't never heard about the nigga\nYeah", "album": "TM104: The Legend of the Snowman", "year": "2019-08-23", "image": "https://images.genius.com/bc6135011548a24a95a5c16c968a3106.1000x1000x1.jpg"}], "artist": "Jeezy"}