{"songs": [{"year": null, "image": "https://images.genius.com/cc562c0aa5b047df2132b1557d8efb9a.464x464x1.jpg", "title": "One Shot", "album": null, "lyrics": "Living in some times that's the craziest\nThey say these legislators are the laziest\nDedicated religious figures have gone atheist\nEach and everything must change there's no escaping this\n\nI'm on the block post apocalyptic smoke covers\nCoincidentally presented by the Koch brothers\nThe magnitude of this is bigger than the both of us\nThe attitude is trying to manage not to choke from it\n\nGo and get the bolt cutters. Open the flood gate\nAny relationship I've ever been in was love/hate\nThe city I was living in really never was safe\nFor some a temporary resolution was duct tape\n\nNow I'mma probably be on the black list\nBut I don't give a fuck so I'mma shrug like Atlas\nAnd if my skepticism was a brand new practice\nWould y'all be disappointed like you just got catfished?\n\nIt's cold-blooded. I'm whole-heartedly cold-hearted and swole from it\nThe same unseen hands still in control of it\nI should be minding own like it's a gold nugget\nBut I'm on that same bullshit just on a lower budget\n\nWaiting on chains that bend low\nTo let day after tomorrow I sit by the window\nAnd the police state like your man Michael Winslow\nMy kinfolk told me there's a brand new Jim Crow\n\nI've been going to bed at ten up at five\nHustle to the bus and ride\nTo the job\n\nIt's feeling hot as the Fourth of July\nMy lady just getting home. We living separate lives\nShe couldn't be one of those Stepford wives if she tried\n\nThey shot my cousin. He died. It wasn't justified\nI guess I see him if I make it to the other side\nThe corner deli owner tell me hurry up and buy\nIf everybody is somebody tell me who am I?\n\nThe same figure who came from Anguilla\nAin't nothing different\nI think I'm addicted to pain killers\nI'm unpermitted to enter the village\nOf Shangri La\nI'm depicted as being the killa this dangerous, huh?\n\nHalf dozen in one hand, Six in the other\nYo, this is more than a suntan\n; it's living color\n\nBlack as oblivion\nBlack as obsidian\nBlack as the sky at midnight alto-meridian\nI am black as the porch who\nWith Diddy, 2Pac, and Biggie in\nBlack as the influence on the culture we're living in\n\nI survived the childless circuit\nVaudevillian in\nManaged inspire the Beatles and Bob Dylan and them\nBut did I miss the mark because I'm just as dark\nAs John Hendrick Clark's inner thoughts\nAt the time of the Harlem Renaissance\n\nAfter which\nRights activists\nDeviated the flight path\nThe black ratchedness\nPutting us back smack dab\nWhere night catches us\nWe just go along for the ride\nPassengers\n\nGluttons for punishment. Masochists\nStill doing whatever master asks of us\nWill this generation go down as the last of us?\nWill being young men while black was hazardous?\n\nInto the proverbial masked avenger all these pretenders\nSuffer from symptoms of affluenza\nI'm just thinking out loud about\nExtinction and genders and plans\nMy grandmother definitely remembers\n\nListen her suits were tailor made\nSundays Mahila played\nSimple familiar ways like the way she\nKnelt and prayed\nWell and Lord and master forgive us our trust\nPastors had us well afraid\n\nI never listened. But I still obeyed\nI got to see how the gangsters played at such an early age\nWhen my father was there to set them to us early grave\nTheir mom started chasing that base like Willie Mays\nMy childhood was all of 40 nights and 40 days\nTrouble was my ball and chain\nShorties would call me names\n\nHumble beginnings black daughters what that all became\nMy journey from a dirty hallway to the hall of fame\nMusic my therapeutic way to deal with all this pain\n\nI was headed for the drain\nSoaking before the rain water came\nAnd chaos that's when the order came\nI started what I'm supposed to in life\nTrying to move out of the dark and closer to the light\n\nThey say when you get a chance to do it over\n. Do it right\nBecause tomorrow was a promise every time we say \"Good night\"\n\nListen\nDope Shot\nMug Shot\nGun Shot\nJump Shot\n\nTake your pick. But you only got only one shot\nAdvice from a school teacher to a young tot\nApplying a sticker to a Spiderman lunch box\n\nWhen even role models tell us we're born to be felons\nAnd we ain't getting into Harvard or Carnegie Mellon\nAnd of these other people's blessings we've grown to be jealous\nIt's not fair that's all they can tell us\n\nThat's why I hustle hella hard\nI don't celebrate a holiday\nThat could be the day a brother could have struck the lottery\nI refuse to ever to lose or throw my shot away\n\nOr chalk it up to just another one that got away\nSo I'm unapologetic\nI'm on my calisthenics\nIf I had giving it all I got I can not regret it\n\n\nMy final destination's different from where I was headed\nBecause I'm going to shoot for the stars to get it\n\nOne shot"}], "artist": "Black Thought"}