{"artist": "King Los", "songs": [{"image": "https://images.genius.com/17fe43f9da145e3408e4f87c517d1110.600x600x1.jpg", "title": "I Shot Ya (Remix)", "year": "2017-12-17", "album": "G.O.A.T.", "lyrics": "[Verse]\nYo, I just want my persona honored for all I am\nAll of this artist just ought to quit they inadequate highly inaccurate non factors rapping, its all a scam\nYou dishonest pretentious niggas was all a plan\nYou gender bending and gender fitting Juwanna Manns\nWe knew you was gone be sweet from your sonogram\nI'm omnipotent, sparing with me, as far as bars its like seeing the Omni closing in on conquered land\nWait till these vocals land\nI mean Ronald was a pedophile and Mcdonalds sold more dope than uncle Sam (Well what you sayin?)\nYou ain't peeping the plot?\nYou be chasing them toys?\nWon't the beef get you boxed?\nWon't the cheese and the bread get you killed from the gate?\nSo the niggas that you fried get you milked and then shaked\nIndoctrinated as youth through symbolism\nMysticism, Criticism, Religious system\nWhat is the vision? If the vision is visible\nMama prayed all her life and died miserable\nYou hypocritical critics with crypted coated language\nI note the English my entomology so distinguished\nBar none, the most evolved tongue, jar, gum, teeth, keep far away from jargon\nYou can feel the surge when the surgeon and sergeant circumstance chances is ya lost one nigga\nUh, fill in the blanks\nIn order to run the country you need killers with rank\nSo even if Donald ducked out on the bill its still in its Will that Hillary Banks\nThey're playing a game democratic, republicans same thing that's how you maintain a government name blame or chiddy bang bang some other shit\nAnd yall watched the whole soap opera, yall be loving it\nHow long before niggas start knowing the deal\nI mean, shit, I used to think Hulk Hogan was real\nI thought Santa was real, I know that shit is old\nBut I studied the north pole now my presence is cold\nI encompass the truth, not teaching nonsense to you\nNow these weapons of mass destruction getting launched in the booth\nNow that's a thorough conversation\nYou still tryna fuck another nigga's girl and they done mastered world domination, G.O.A.T"}]}