{"songs": [{"year": "2009-12-31", "album": "Kendrick Lamar EP", "image": "https://images.genius.com/de49545ec6453e829bb3ff6d34d088db.1000x1000x1.jpg", "title": "Determined", "lyrics": "[Verse 1: Kendrick Lamar]\nGo getter, with no cheddar\nJust a white tee and a swap meet sweater\nMy life is likely to see great endeavors\nBut I can't win if I can't get it together\nWhat I gotta do in order to see success?\nHaving the world's best to call me the best?\nPull up at the Grammy awards as the best dressed\nWith an address linked to a beautiful actress?\nA dollar and a dream, I feel J. Cole\nWord to the hole in my pocket and the hoes\nThat don't wanna fuck with a broke nigga with ambition\nBut the last time I checked, y'all was broke bitches\nMake a name for myself then bubble like the ass of Buffy\nWhen she wearing a tight belt\nThe homies on the block can say whatever they say\nI don't wanna be a killer, I wanna be a Gates\n\n[Chorus 1: Ash Riser]\nIn time, it'll come\nJust stay focused and humble, my son\nShow and prove, prove you're the one\nIt's not about who is dopest\nWho wants it the most\nSo just go out and get it\nGo out and get it\nGo out and get it\nGo out and get it\n\n[Verse 2: Kendrick Lamar]\nWhat I gotta do in order to see success?\nHaving the world's best to call me the best\nPull up at the Grammy awards as best dressed\nWith an address next to a beautiful actress\nDo I gotta run in your spot and start blastin'\nBetter yet, rob the nearest Nix Check Cashing\nEar hustle on a nigga that's constantly braggin'\nCatch him at the light, snatch him out his Jeep wagon\nOr maybe I gotta hook up with Jose\nCop 5 bricks of the yay, head to the Bay\nArea or carry the birds to VA\nLet the Clipse distribute the work all day\nThen come back home\nEvery three weeks flip three to six zones\nHomies on the block can say whatever they want\nI don't wanna be a dealer, I wanna be a trump\nDonald that is\n\n[Chorus 2: Ash Riser & Kendrick Lamar]\nIn time, it'll come\nJust stay focused and humble, my son\nShow and prove, prove you're the one\nIt's not about who is dopest\nWho wants it the most\nSo just go out and get it\n(And when I do I do it again\nThen I go back\nWhen I do I do it again\nThen I go back\nThug it out)\nGo out and get it\n(But for now I'mma go head and doug it out\nI gotta rhyme, rhyme)\nGo out and get it\nGo out and get it\n\n[Verse 3: Kendrick Lamar]\nSo welcome to the story of my life\nSee I'm tryna get to get right off the shit that I write\nMake a fortune, buy some Porsches for my momma and my wife\nPops engine in this old school run tiiight!\nBut as you listening to K-D-O-T\nMan, me and my girl split the bucket of KFC\nShe listening to Drake and all I can say is \"Damn\nThese niggas that much better than me, baby?\"\nI don't think this is meant to be\nCause I'm always losing self esteem\nShe paused the iPhone then said, \"Huh?\"\nI repeated what I said then she replied, \"Shut up.\"\nYou know you the best boy, you gotta keep doing it\nBut don't forget when you do, just keep you in it\nAnd never listen to what the industry say\nDon't be a typical artist, be more like Jay\nRussell, Barry Gordy, Quincy Jones, Bob Johnson, Sean Combs, L.A. Reid\nYoung black entrepreneurs did what it took to succeed, yeah\nSo I gotta see success, I gotta make it off them Rosecrans steps\nRising to the top like a soda shook up\nBout to pop, and I'll pop on whoever's in my way\n\n[Hook: 1]\n\nGo out and get it\nGo out and get it"}], "artist": "Kendrick Lamar"}