{"songs": [{"year": "2005-06-01", "album": "Training Day", "image": "https://images.genius.com/0d736130ef89ba0b866b3b01fad325c1.500x500x1.jpg", "title": "Grammy Family (Freestyle)", "lyrics": "I don't need the hype\nThey call me- fuck it- I don't need no introduction\nNo ad-libbing my name 100 times for nothing\nYou already know it's K. Dot, city of Compton\nAnalogy is like Biggie and Bed Stuy, Oakland and 2Pac\nI'm more focused, I'm nothing like you new guys\nStruggling over a few lines thinking you hot\nCause your homey said you you was a few times\nWhich is too many times, they lying to you, they telling a lie\nThe only time I lie in a booth is when I sleep in it\nRecord 24 hrs, you niggas better get your bars up\nI bench press this rap stuff, got it locked like handcuffs\nI threw away the key\nMy cool is on, she love my A/C\nMy juice is on, and I wish one of y'all try to rob me\nI shoot, and how have you laying between the sheets with the Isleys\nI push the coupe like a high speed\nThe helicopters come and realize that nothing's behind me is behind me\nYour honor, I fuck over this beat with no condom\nThis ain't rap it's really a porno re-winded back\nFinally the finest of 'em all is back\nTo define the laws of crack\nY'all don't obey, y'all ain't nice, y'all just OK\nYou're nothing more than a little John phrase\nI'm Mike Jordan in his prime\nModern-day Issac Hayes, theme song to Shaft\nEquivalent to the theme song to your career, study my craft\nYou ignorant: I do it without a pen and pad\nJust inspiration: something you never had\nIf my pockets is something you trying to grab\nI pull out the rocket and peel you back like scab\nYou old news, you old dudes get out of my way\nLet the young boy come through; don't mention my age\nI'm on a mission for pay\nAnd you astronaut niggas just crowding my space\nYou not in my atmosphere, you can act like you here\nBut actually you ain't accurate fucker with this music biz\nThe industry like, \"Fuck it, let the music be his\"\nNo theme park, I'm not trying to amuse you kids\nSmall shark, jaws is here, jump in the water\nDo he really fuck with President Carter?\nMy reply is that I can't stay away from the bosses\nHad the bidding war popping like an auction\nNine or 10 labels like what he hitting for? 7 zeros or more?\nRemember having Aftermath sitting on my porch\nBut money was barricading my door, I couldn't open it\nMoney on my passenger side, now who you rolling with?\nBlack diamonds, not no rose-gold shit\nTeamed up with Watt's finest\nJay Rock won't you avalanche these niggas so I can rock-climb 'em?\n(Jay Rock: Give me a minute my nigga let me go find 'em)\nBring 'em back to me, the 5'6\" rap bully is back for the first time, killing you niggas\nI hope you got nine lives, it's not Nas or Jigga\nBut where Jigga left off that is where I pick up\nI got them holding their breath without having no hiccups\nScreaming, \"Fuck the world\" with a capital F\nReal niggas: we the last ones left, MY NIGGA\nI raise the bar for rapping the West\nSo have your shit up to par if you rep for the West\nCause you see homeboy, we ain't getting respect\nSo we got to get it back, take it back, to the Jheri curls\nAnd the Raider caps, my khakis on\nAddress the issue in my last three songs\nMan, Game know about you West Coast clones\nAnd nigga we hate twins\nPut some change on it, see if it makes sense, ya know\nI got to be the new breed top 5 minus 4\nThat's number one, cause second is the first loser\nDon't beef with me homey, if you want your future\nRap ain't promised, you might think it's slamming right\nBut look at Onyx, they ain't too tight\nInterscope consults it: look at Suge Knight\nI'm trying to get money like the Oasis\nIf you ain't on the same shit like my gold D's, keep rolling\nI keep rolling, never stop\nTop Dawg Entertainment: Presents K-Dot"}], "artist": "Kendrick Lamar"}