{"songs": [{"album": "Codeine Cowboy", "image": "https://images.genius.com/82908e72685ad4d4fa667a2842fbd939.500x500x1.jpg", "title": "Cowboy", "year": "2011-02-22", "lyrics": "[Intro: Bon Jovi]\nIt's all the same, only the names will change \nEveryday it seems we're wasting away \nAnother place where the faces are so cold \nI'd drive all night just to get back home \n\nI'm a cowboy (x 4)\n\n[Verse 1: 2 Chainz]\nYE!\n\nPour a two into a one, now I'm done bitch\nNiggas running they mouths, but they don't really run shit\nI'm a cowboy, chicka pow pow boy\nShoot you from the floor to your fuckin-YE-YE!\nPour a two into a one, now I'm done bitch\nNiggas running they mouths, but they don't really run shit\nYE!\nPour a two into a one, now I'm done bitch\nNiggas running they mouths, but they don't really run shit\nI'm a cowboy, chicka pow pow boy\nShoot you from the floor to your fuckin eyebrow boy\n2 Chainz name ringing like an Android\nI think about money every time I brainstorm\nAnd I'm in rare form if I've got Airs on\nNiggas know I'm buying Guccis like they fucking Air Jordans\nOutlaw lifestyle, I made a mill trapping\nI'm trynna take the 'T' off and make a mill rapping\nCodeine, fetti, shorty all white porcelain\nReverse cowgirl, shawty ride a nigga like a horse\n\n[Verse 2: 2 Chainz]\n\n2 CHAINZ!\nIt ain't no secret, I'mma get it\nI'm over niggas heads like an ATL fitted\nI'm over bitches house like I'm only gonna visit\nWhen they try to make me stay I tell them \"That's some strong liquor\"\nYou know what time it is\nI'm on the strong and the sizzurp\nAnd since a young nigga, I've been on with the wiz-ord\nA nigga play me wrong I put his dome in the diz-irt\nI'm going on tour, I'm going be gone till November\nRuthless, ice cubes all on my sizz-erp\nPinky ring huge, such a mofuckin insult\nAnd if you riding dubs, then my rims are much older\nTwo white cups, and one cup holder\nTold ya, grab me a soda\nShake it like a shake-weight\nHit you with two 4x4s, that's an 8x8\nAnd it's not that I don't like ya, but I hate hate\nI know they gonna hate on this, and I can't wait\n\n[Outro: DJ Teknikz]"}], "artist": "2 Chainz"}