{"artist": "Ice-T", "songs": [{"title": "I’m Your Pusher", "lyrics": "[Intro]\nYo what's up man, I need to get high man\nI need to get hold of some big time dope man\nYou know where I can get a ki?\n\nI know where you can get an LP\n\nLP, man? Have you went crazy man?\nI'm talking about some dope man\nI need to get high right now man\nWhy don't you hook me up with a 5-O?\n\nI can hook you up with a 12 inch\n\n12 inch? Man have you went crazy?\nYou don't even know what time it is\nOut here on the streets and don't know what time it is\nMan youse a fool\n\nYo homeboy you a fool\nYou don't know what time it is\nOut here, messing up your mind\nYou know what I'm sayin'?\nThis is Ice-T talkin' to you boy\nI'mma tell you what time it is\n\n[Verse 1]\nYo, it's time for me to pump the volume\nNo problem, the record's revolvin'\nEvil's the mixer, I'm the rap trixister\nPaparazzi on the bum rush for pictures\nIce, coolin', yo colder than ever\nPunk-Executioner E, pull the lever\nRotate the wax then cut an' axe the tracks\nPush up the levels till the red lights max\nDon't try to size up, you better wise up\nTo the rap criminals, we're succeeded\nDope beats and lyrics, no beepers needed\nFor this drug deal, I'm the big wheel\nThe dope I'm sellin', you don't smoke, you feel\nOut on the dance floor, on my world tour\nI'm sellin' dope in each and every record store\nI'm the kingpin when the wax spins\nCrack or smack will take you to a sure end\nYou don't need it, just throw that stuff away\nYou wanna get high? Let the record play\n\n[Bridge]\nAww man, I like this dope here man\nIt's feelin' alright boy\nWhat you say your name was man?\n\n[Hook]\nI'm your momma\nI'm your daddy\nI'm that nigga in the alley\nI'm your brother when you need\nA true player to emcee\nYou know me, a true friend\nYour main boy, thick and thin\nMC Ice-T\nI'm your pusher\n\n[Verse 2]\nI know you're lovin' this drug as it's comin' out your speaker\nBass thru the bottons, highs thru the tweeters\nBut this base you don't need a pipe\nJust a tempo to keep your hype\nGroovin' like I see you doin'\nSome stupid crack would just ruin\nYour natural high, why? .. That ain't fly\nAnd anyone who says it is, lies\nMove like I knew you would, like I knew could\nAnd if you ain't cracked out, then I know you should\nBe able to give me a clap, to match exact with the track\nAnd since I know that you ain't, I expect that\nOh now this jam is lit, it's like the ultimate\nPeople high off dope but still physically fit\nI'll make a million bucks, pack my dough in trucks\nFrom sellin' dope beats, dope rhymes, dope cuts\nI'll be the biggest dope dealer in history\nBecause all the fly will be high off that Ice-T\n\n[Bridge]\nAww man, you ain't ever lie man\nThis dope's alright man\nI gotta get back with you man\nLet me get your number man\n\n[Hook]\n\n[Verse 3]\nI'll bring it to boil, Evil E rock it up\nYou want it? ... I don't think you got enough\nLast suckers crossed, Syndicate shot 'em up\nCops found 'em in the lake bottom up\nI don't play when it comes to my dope\nI check my lyrics close, like with a microscope\nI don't clean'em up with no Ivory soap\nI leave 'em hard and pure, hope that you can cope\nBecause you might O.D. if you overdrive\nThis record, tape or CD, because the sound I've\nCreated on this wax is like a chemical\nAnd the knowledge I give, makes me invincible\n\n[Bridge]\nAww Mr. Dopeman\nI'm lovin' you man\nYou got it goin' on man\nWhat else you got?\n\nI got some of that Kool Moe Dee\nAww yeah man, I want some of that\n\nGot some Doug E. Fresh\nAww yeah gimme an ounce of that\nI want that all night long\n\nI got some Eric B. & Rakim\nAww that is some real dope right there\n\nI got some LL Cool J\nNah, nah man, I don't want none of that\nYou can keep that man\n\nI got some Boogie Down Productions, KRS-One\nAww now you're talkin' man, come on\n\nPublic Enemy\nYeah don't stop, don't stop\n\nBiz Markie\nMakin' music with yo mouth Biz\nI love it\n\n[Hook]\n\n[Verse 4]\nThe cops don't know what to do, because my dope breaks through\nNo matter what they do, my stuff gets to you\nKickin' on the Boulevard, my tempo's hyped and hard\nI don't ask, the ICE just bogards\nSire Records puts me out, with Warner Bros. clout\nMy dope hits the streets with no doubt\nEvil E adds the cut, then removes it\nIZ checks for purity, then approves it\nAnd then you get it, try it and like it\nAnd if it ain't potent, we remix and spike it\nTo bring you the pure dope, not a noose in a rope\nBecause if you're doin' crack, you're on death row\nYou're just a toy punk, to mess with that junk\nYou want some real dope, come look in my trunk\nThe dope I'm sellin' is life, 100% legit\nSo get real fool, and try some real hit\n\n[Bridge]\nWord up my brother\nYou got me high as a kite\nI feel good tonight\nIce-T, you alright\n\n[Hook]\n\nI'm your pusher", "image": "https://images.genius.com/90b363e617bc82f06e45c5cc1d830e6a.1000x1000x1.jpg", "album": "Power", "year": "1988-09-13"}]}