{"artist": "Preme", "songs": [{"album": "Dear America", "title": "Different Now (Thinking Out Loud)", "image": "https://images.genius.com/228f06b6beee88a4c4c3a7b063ae1044.500x500x1.jpg", "lyrics": "[Hook: JoJo]\nI'm different now\nI'm just thinking out loud\nTrying to be cool but--now\n\n[Verse 1: P. Reign]\nFrom a hood where you run up or pick your gun up\nAnd the only thing for certain is there is a god among us\nI run with gunners, not with runners\nBut starting July 4th, I promise we'll run the summer, prepare for the come up\nWe made a vow that we would die for our brothers\nAround the same time our high school crushes began to love us\nSo much hate for the cops won't even make love under covers\nHundred grand to our lawyers just to influence the judges\nMama said, \"Believe, baby boy believe\"\n\"Never follow man, follow dreams, you were born to lead,\" geez\nI do this for my city that watered my seed\nCause most niggas gotta drown to learn how to breathe\nBreathe -- last Gs in a broken city\nGon' and pick your top five, they ain't fucking with me\nUnless it's Drizzy, I bet I kill 'em\nIt's hard to be a hero when you relate to the villain\nIt's hard to comprehend if you ain't felt the feeling\nAnd difficult to hide the money when it's to the ceiling\nYeah, we hit the block until the weight is missing\nUh, it ain't the life if you ain't made a killing\n\n[Hook]\n\n[Verse 2: P. Reign]\nProbably with some goons that love to make the news\nRocky put me on Givenchy for my latest shoes\nNever switching crews, I became the latest news\nNever sleeping on me, pray a nigga never hit the snooze -- ooh!\nShout out to the niggas being men, getting bread\nShout out to the women never giving head to get ahead\nI never been like these bitches blowing to blow up\nThis life forced me to grow up, pray for one woman to show up\nMiss America, miss you America\nBut I'm king of my country, fighting for you to want me\nChasing my dreams, but the nightmares see you haunt me\nBaby I beg your pardon, I pray that one day you call me\nI see you, but if I love you, gotta leave you\nCause I know the day is coming, you want me more than I need you\nMy drug convictions and gun charges got you convinced I'm in of a problem(?), but God got 'em\nHold up -- hold up, all you niggas hold up\nI'm sick, forcing niggas to throw up\nKnow one day she'll open up and let me fuck\n'Til then it's sorry P, throw it up\n\n[Hook]\n\n[Outro: (Unknown)]\nI got partners doing triple life, P. Reign\nThis ain't about no rap\nIt's about your people\nMorals, honor, integrity\nYou won't make guys like this no more\nYou the last of a dying breed", "year": null}]}