{"songs": [{"image": "https://images.genius.com/4e9cc276ae2e28f757531f1ec0e3dfff.500x500x1.jpg", "title": "Stuntin’ Y’all", "album": "We Got It 4 Cheap, Vol. 1", "year": null, "lyrics": "[Hook: Pusha T]\nI'm achieving, happy to be breathing\nThey stuntin y'all!\nDiamonds with brothers giving off 2K colors\nDisgusting y'all!\nOn my road and going my way nigga\nI'll cut ya off!\nSo, let me live or that .45 living\nI'm touching y'all!\n\n[Verse 1: Pusha T]\nWhat's the talk of the sophomore jinx?\nGot jewellery like I robbed the Sphinx\nGot money like I robbed the Brinks truck\nFuck y'all niggas that pray for my ship to sink\nI'm a problem, coupes I copped them left to right\nThe garage looks like the Bat Cave at night\nHe who tips scales, off that fish scale\nHands gracefully brush them keys like it's brail\nSafeties on guns don't sit well\nSend new shells to old foes, suckas!\nBail like oh no! flows is so cold\nHoes stick to me like gum to shoe soles huh!\nHe's vain, 88 you're thinking, 2004 - resurrection of caine!\nHere I am, such a young baller\nFlow shows promise, like LeBron James\nI bring life to the game\n\n[Hook]\n\n[Verse 2: Malice]\nNiggas is losing it, out they mothafuckin mind\nHow another nigga talk about mine, I must be doin it\nThey must see, a significant rise in my stock\nMulti-colored jewels, wit hues of blue in it\nOr take you the real estate, where the realest gate\nOutline the perimeter, I'll show you where we're doin it\nHear the new, the Clipse is huge\nAnd these crews continue to hate, like Ebenezer Scrooge\nBut it's cool, I too once, averaged the same\nTil I got slick, took risks, carried the 'caine\nThen I cooked shit, pushed it, married the game\nNow these days, I just 52-karat the chain\nI pump base to the projects\nI was Tyrannosaurus Rex to the pyrex\nThese dudes can't wait to see the doom of me\nBut big deals, so what, what's new, humor me, bitch!\n\n[Hook]\n\n[Verse 3: Pusha T]\nDo-ray-me, fa-so-la-ti\nOh my God, the - wrist stay Rocky like Balboa\nThe bar's been lowered, here to raise the quota!\nKeep guns in pairs, I am the ghetto's Noah!\nNigga need horseshoe for luck\nTryna test a flow like such, jewels like Tut\nChildren hush, while King Pusha speakin\nOr paramedic you'll be seeing fa real\n\n[Verse 4: Malice]\nIt's every bit what it seems! these is dreams I'm living out\nThe ride I'm getting out's a fraction of the house\nYour living can't obstruct my vision\nFranck Mueller jewels, I'm convinced this is living!\nIt's a given cats gon flap that tongue\nTill I appear then cat got tongue, better relax\n'Fore I clap that gun, perhaps even collapse that lung\nTrust in me that that gat's no fun, one!\n\n[Hook]"}], "artist": "Clipse"}