{"songs": [{"year": null, "image": "https://images.genius.com/6478121f52fa3b0248edb20e7d06e076.300x300x1.jpg", "title": "Twistin Yay", "album": "Damn Fool", "lyrics": "[Intro: Krizz Kaliko]\nOK\nTwistin' yay, you know?\nMixin' it up, splittin' it up, deliverin' it like take-out food, and not giving a fuck\nFrom the north side to the south side\nTwistin' yay is the way of life\nHustlin'\nBound together by niggas that's known to break 'em off something, give it to me\n\n[Verse 1: Rappin Twan]\nYeah, I'm on the grind, getting cheese like the rats do\nYou niggas eating peanuts like cashews\nI do it tripple XL like Big Scoob\nThat's the homie though, you niggas phoney, bro\nI'm like a boss in the town like Barack is\nAll they really wanna know is who shot the kid?\nBut um... that's a different story, different day\nI'm on the block, and I'm twistin' the yay\nAnd um... the bitches say \"There they go again\"\nMy raps like [?]\nThey call it Strange Music 'cause we some major factors\nYou niggas on some bullshit, I call you all actors\n[?] and cut the grass low\nShit, all I really know is gettin' cash everyday, bro\nAnd I don't know [?] my nigga\nI fuck with the killers on the grind, gettin' scrilla [?]\nSing it\n\n[Chorus: Krizz Kaliko & Tech N9ne]\nWanna know where I'm gone all day?\nWhen I'm gone away I been twistin' yay\nI'm a Kansas City gritty committee\nTo my paper chace, I do this all day\nYeyey-yeyey\nTwistin' yeyey-yeyey\nTwistin' yey\nTwistin' yeyey-yeyey\nTwistin' yeyey-yeyey\nTwistin' yey\n\n[Verse 2: Big Scoob]\nI be out there on some grown man, chasing that paper\nFrom the dime to the bay, we be twistin' that yay\nGot me chefin' up that good dope, (good dope)\nHitter quitter, tryna spit it for the hood folk\nFrom the middle where it's gritty and it's so loc\nKilla City, that's my city and it's no joke\nFrom the gutter where we suffering, it's no hope\nBe so quick [?] problem with that gun smoke\nTake my wisdom, and I push it with a pen and pad\nSpit that yola soda, best you ever had\nStrange Music, how I move it, and I push it swell\nPut that butter on these suckers, and they can't tell\nLittle business, I ain't got to move with the night\nI use words, bring my gutter life to the light\nIf I'm missing and my face ain't on the scene\nI let the homie Kali tell it when he starts to sing\nNigga sing\n\n[Chorus: Krizz Kaliko & Tech N9ne]\nWanna know where I'm gone all day?\nWhen I'm gone away I been twistin' yay\nI'm a Kansas City gritty committee\nTo my paper chace, I do this all day\nYeyey-yeyey\nTwistin' yeyey-yeyey\nTwistin' yey\nTwistin' yeyey-yeyey\nTwistin' yeyey-yeyey\nTwistin' yey\n\n[Verse 3: Skatterman]\nSame clothes for three days in the dope spot\nDifferent game, same grind to put you on top\nHustle and dedication, determanation and grit\nWhen I was young, I used to serve on the strip\nI guess I came a long way from pushing packs of the pure stuff\nTo 65 singles, blowing purple on the tour bus\nSkatter and Big Scoob with Krizz Kali and Kutt\nTech probably somewhere with a slut\nYou see way before music and the Snake and the Bat\nI used to throw Blood signs with Jason and Raf\nTwistin' yay all day, tryna chase me a stack\n300 white bitches chasing me back\nFeeling guilty, 'cause a kid said he missing me\nThis night in Georgia, next night Tennessee\nI change lanes from the kitchen, let them cakes cook\nAnd serve the flows to my fiends on Facebook\n\n[Chorus: Krizz Kaliko & Tech N9ne]\nWanna know where I'm gone all day?\nWhen I'm gone away I been twistin' yay\nI'm a Kansas City gritty committee\nTo my paper chace, I do this all day\nYeyey-yeyey\nTwistin' yeyey-yeyey\nTwistin' yey\nTwistin' yeyey-yeyey\nTwistin' yeyey-yeyey\nTwistin' yey"}], "artist": "Big Scoob"}