{"artist": "R. Kelly", "songs": [{"album": "Chocolate Factory", "year": "2003-02-18", "lyrics": "[Chorus]\nI been around the world\nAnd gets nothin but love\nFor who I am\nI thank my fans so much\nEven though some may hate\nStill I appreciate\nAll my friends and family\nThat kept it real with me\n\n[R. Kelly]\nI been around the world and back like whut up\nEast side to west side tourin like whut up\nAnd even though the price for the house was so much\nI still roll with them from the hood like whut up\nCuz when it comes to bein the realest I'm sho nuff\nIm a straight up industry villain fo sho nuff\nAnd I can't satisfy some of ya'll no matter what\nAnd some a yall cats are soldier love\nSaid we livin in a cold cold world\nAin't nuttin but fake faces fake people fake friends\nSaid we livin in a cold cold world\nWhere there ain't nuttin but envy wannabees playa-hatas\nYea I know I need a hug but ya'll need a hug too\nCuz God gunna judge me the same day he judge you\nAnd even though we have our struggles that's alright\nYou know we ghetto folks is gon' find a way to shine\n\n[Chorus]\n\n[Ja Rule]\nSometimes... this world can be so cold\nWhen you looking through the windows of the soul\nI been looking to see the truth as it unfolds\nCuz I been around this globe and back enough to know the fact\nWho loves me and who loves me not\nWe be shit's so hot you could put it in red tops\nAnd pump it through every hood, ghetto, and block\nUntil they heart stops that's why they fear for me\nAnd I thank you for every blessing that you givin me lord\nAnd I'm grateful for all my talent and my vocal accords\nAnd all these hatas I keep shakin em off\nRubbin they face in fame I'm sorry I changed the game\nBut its mine and I can't complain\nRule and R Kelly, \"Been around the world\"\nPuttin it on women \"Bumpin n' Grindin\" these bitches\nBut we always on time when a woman fed up\nAnd that's luv, that's why they all fuck wit us\nCuz we...\n\n[Chorus]\n\n[R. Kelly]\nSaid my lyrics is my testimony, that's how I live\nI had to get rid of a lotta fake homies, I won't forgive\nYou see me on T.V. sometimes not how it is\nYall gotta start learnin how to separate me from showbiz\nWhen I'm rollin through your city, show me love\nAnd ladies when you see your boy, gimme hug\nAnd though I'm not conceited (right)\nIts jus my space sometimes I need it (right)\nSaid I got so many friends in them area codes\nThat I hand out them tickets when it comes to my shows\nJa's lets break bread together, pray together\nThat we grow strong together\nIts clear forever, help each other through the stormy weather\nLets hurt together, lets cry together\nAnd even if we grow together\nThen together we can make it better\n\n[Chorus x2]", "title": "Been Around the World", "image": "https://images.genius.com/c23c7ad166aff9317b7dbbc35ffe83db.1000x1000x1.jpg"}]}