{"songs": [{"title": "Singing This Song", "image": "https://images.genius.com/34496ea878c12c3ca7f7791350eef29a.899x899x1.jpg", "lyrics": "[Hook]\nSinging this song let the whole world know\nSinging this song let the whole world know\nLet the choir sing\nSinging this song let the whole world know\nLet the choir sing\nSinging this song let the whole world know\nSinging this song let the whole world know\nLet the choir sing\nSinging this song let the whole world know\n\n[Verse 1]\nBlood on our hands, it’s wetter than it ever was\nWe say its getting better, yet it seldom does\nEverybody wanna fuss but what gets discussed\nWhen its all said and done what will be said of us?\nThis is who we are not who we have to be\nIn the lasting aftermath of a tragedy\nDon’t wanna talk no more, I heard it all before\nI just know that I don’t want this on my heart no more\nSpeeding on a crash course with our final hour\nOnly thing that can bring us back is our finest hour\nExcellence flow from every precious soul is the\nOnly way that i know to harness that kind of power\nWe can shine brighter, sing bigger, love louder\nWe can dream farther, hope harder, work smarter\nThis is that moment, sand flowing through the hourglass\nIs our only opponent that we have, we own it!\n\n[Hook]\n\n[Verse 2]\nAll around the world different song same message\nDignity in that spotlight and life’s precious\nWhen we raise voices, we’re joining a chorus\nYou’re not a solo, the harmony is enormous\nEcho John Lennon we echo Nina Simone\nWe echo my brother Chuck D, that legacy lives on\nAnd when the struggle stress you\nLet it bless you keep you strong\nAnd may your voice live on forever in that song\n\n[Hook]\n\nWallace D. Mohammed\nDr. Betty and Malcom Shabazz\nCoretta and Martin King\nLet the choir sing\nGil Scott Heron\nBob Dylan\nEyedea\nLet the choir sing\nAngela Davis\nCornel West\nTim Wise\nLet the choir sing\nLeonard Peltier\nAsata Shakur\nMumia Abu Jamal\n\nLet the choir sing\nSinging this song let the whole world know\nSinging this song let the whole world know\nSinging this song let the whole world know\nSinging this song let the whole world know\n\n[Speech]\nAnd so if we want to get anywhere we have to be self loving enough, to be honest with ourselves, to do some soul searching!\nI’m not talking about soul searching to see what’s inside our soul, we got to find out what the hell happened to our soul. We’ve got to find that shit. I want my humanity back. I want to be a human being again. I don’t want this shit on my conscience no more! I want to live in a fair world. We’ve got to decide to rejoin the human family again. We’re not talking about just this case, we not talking about just this issue, we’re talking about whether or not we’re going to be human beings again\nPeace!\n\nSinging this song let the whole world know\nSinging this song let the whole world know", "year": "2012-09-18", "album": "Mourning in America and Dreaming in Color"}], "artist": "Brother Ali"}