{"songs": [{"album": "The Leak", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg", "year": "2006-03-28", "title": "Drug Related", "lyrics": "[Verse 1: T.I.]\nKuntry had fronted me 20 ki's told me to keep 20 G's\nThen forgot to tell me that it's 25 to eternity\nNow picture me, in a GS3 with all my folk\nVersace Coat, and a Monte 'Lo from slangin' coke\nThis ain't no joke situation nigga, I'm ill with it\nMy occupation? clockin' 6 figures, so deal with it\nMy Marc Buchanan Pelle Pelle over Teflon, protect my belly\nFrom 9 millimeter cannon, while talkin' on celly telly's\nNiggas frontin' like they makin' pay, this real pimpin'\nKi's comin straight from the CIA and Bill Clinton\nYou petty thugs ain't got a clue do you?\nHey who the man who supply the man who supplying you...\nWith a couple grand?\nTo risk your freedom for some luxuries? this ain't the best\nNigga materialistics can't substitute for your happiness\nLife's about how you feel about you and what you do\nWhen you wake up in the morning\nIn the mirror, you seeing who?\nI think you niggas done bit off more than you can chew\nCause you don't even know why you do\nHalf that hot ass shit you do\nWhy I'm trappin'? cause it's the only job with fair taxes\nAnd it keep a nigga tight to death in Polos and Air Max's\nI'm blastin' these niggas daily, whenever they try to play me\nBaby you wanna lay me, but baby you gotta pay me\nNigga you owe me cheese?, that's grounds for beef\nI'm rollin' with the P$C with a pound to chief\nHey if this rap shit don't work?, I'm stuck slangin' drugs\nUntil I.. make enough money to go and buy me a club\nI got.. 36 ounces that I got to move\nAnd 20 ki's coming to me on the 4th of June\nSoon as the school year ends, I pick up my ki's\nSo crank the V12, put down the females, replace 'em with cheese\n200 G's for the package, but they 10.5 a piece, now\nOn the streets they goin' for 21.5 at least\nHey\n21.5 x 20? look, that's 430\nBut listen closer cause the dope game get more dirty\nIf I cut 'em into ounces, 28 grams for $800 a piece\nHey, 36 of them in a ki, more cheese for me !\nNow there's 28 G's and 800 cash\nJust for one ki, and I got 19 more stashed\n28 g's at 800, times 19 mo' ?\nCome up to 5-4-7 comma 2-0-0\nThat's 547 G's and two hunna\n47 G's used to ball, 200 to get blunted\nThe other 500 G's? invest it in ki's\nSo I can triple my cheese and have a million with ease\nThat's how it is\nThis game ain't no life time deal\nYou better get as much cheese as you can and get the fuck outta here\n\nThat's how it is\nThis game ain't no life time deal\nYou better get as much cheese as you can and get the fuck outta here\nYeaaa\n\nThis for all y'all goddamn so called uh ex-convicts, so called former dope dealers man. When y'all done had a summer like that, you knahmsayin'? Nigga I done gave you the rundown homeboy. Nigga you can check my mothafuckin' background nigga, check my credentials nigga you knahmsayin'?. It's official nigga, I done done this shit. Summer '96, nigga remember me? Haaaa. 16 years old, balling on y'all bitch ass niggas. Pimp Squad Click remember the...you remember who the first nigga was with a Millenia nigga, y'all remember the first nigga through the Westside nigga with a Millenia nigga , y'all remember that shit nigga..that shit ain't fake nigga, I did that shit for real. My reputation proceeds me homeboy. Nigga y'all niggas talkin' all that dopeboy shit, y'all niggas kickin' all that convict shit, man I laugh at y'all man. I'm sittin' back man, that's why you see me in my button down shirt. That's why you see me in my button down shirts in my Rolls Royce man, cuz I done done that shit man. I'm happy to be alive man, I'm happy to be out, I'm happy to be done never snitched on nobody, never done caught no case, never been down the road like that you knahmsayin'?. I done done my lil' time, came on home man. Nigga I'm a real motherfuckin' G nigga, this is what motherfuckin' dreams is made of nigga. You listen closely, I'm drug related"}], "artist": "T.I."}