{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/c9baa1386283e37588df0198d65847fd.640x640x1.jpg", "title": "Africa Dada Allah Domini Jah Chango", "year": null, "album": "Aztec Yoga 2", "lyrics": "It go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nElegguá, Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\n\nEle- Ele- Elegguá, that's that root Chakra\nYemayá, second Chakra\nOshún, that’s [?] place\nThat Shangó, that heart Chakra\nThat old Chakra, that voice Chakra\nThat Oyá, that brown, that mind, that Ogún\nThat crown, that Oyá, that sit down\nFind a soul water, yo, sip that\nOkay, start your meditation\nNah, just playin', it sound like that, right?\n\nShout out to cold days, sip on a Koolaid\nPsychedelic music is a true thing\nSkip through this track\nMan, skip to the next one it's a weird little chant, yo\nPeace to the motherfuckin’ sly highway, yo\nAy, yo, the old white racist, sexist, men are still alive until they change they minds or until they die we gonna motherfuckin' ride, right? Ha\nI'm rappin' in the street, and I'm rapping to you and me, too\nCool, Allah Domini Hebrew, Allah, Algebraic with the languages\n\nYo, seal these tunes in a jar like a butterfly\nRemember Gobi and holy man, Stoli in ice\nYo, rollin' the dice for a new pair, said it maybe twice\nBoth times I most definitely meant it (Shangó)\nI section the sentences -ces off into little partitions\nMy darts is artistic, I'm sparkin' the flint\nUh, wait, I’m harsh in the faintest of mellows\nClean water for Slin- Flint, Michigan and all the other forty-five thousand\nOr was it forty-five hundred?\nIt was a lot, a lot of little metropolitan areas that are affected and by the blight of dirty water (like, whatever, though) in the so-called developed nation\nIt’s go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\n\nBuild your own well, man\nYo, build your own desalination plant somehow. Look it up. Anything\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\n\nWhat is a practical, even? What is the practical, even?\nWhat is the actual (the actual)? What are the seasons?\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\n\nAy, put it to your mind piece, your mental dome piece, cranial\nListen to the lackadaisical zigzag clouds across the sky, man\nWhat's that? It go...\n\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nElegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nElegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nElegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\nIt go Elegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún\n\nElegguá, Yemayá, Oshún, Shangó, Obatalá, Oyá, Ogún"}]}