{"songs": [{"image": "https://images.genius.com/246e4408dbf779ecc2275ceef46c850e.453x450x1.jpg", "year": null, "title": "That’s How My Trigga Went", "album": "Psycho Active", "lyrics": "[Verse 1: Brotha Lynch Hung]\nA nine in my mothafucking guts, so cold\n(...My nine is easy to load...)\nSo I keep the mothafucka on safe\nCause a nine in your dick ain't safe\nRolling up in a devil red Caprice\nTriple-6 the Bounty got the clip to my piece\nRoasted dog meat tonight we gonna feast\nLoad'em up, Nigga Deep in a creep, boom, boom\nLet'em see what's up, the Brotha Lynch\nStraight using my life broke\nAll I see is devils and gun smoke\nBut they want me to be heaven sent\nBoom and that's how my trigga went\nGotta fix that crack\nMama gotta grave, nigga shit like that\nWitta nigga aging, having fits like that\nGuns on safe but it clicks right back\nNow I take it to the head\n(...Going off on a mothafucka like that...)\nNow I'm dead...\n\n[Verse 2: Brotha Lynch Hung]\nThe nigga with the mothafucking sickness\nCut ya pussy with a razor blade, bitch\nCome sit on my face, bleed all over my face\nGet up, now let me nut in ya face\nNothing but a atheist talking that crazy shit\nSomething like the triple-six sickness\nBitch, ya betta be used to being a bitch\nYa betta be used to me when I picture six six six\nI lay in my bed like a grave\nPraying I'm not that way, I'm like this:\nPut ya wound on my lips\nThe Brotha Lynch biting to the skin rips\nX-Raided flicks, nothing but the Brotha Lynch sickness, bitch\nFuck him if a nigga wanna talk some shit\nPunk mothafucka *gunshot*\nI'm the mothafucking Brotha Lynch...\n(...Going off...)\nLoadin'em up!\n(...on a mothafucka...)\nBlowin'em up!\n(...like that...)\nNigga, I'm sick of this shit\nBitch, open ya legs for this\nNow guess where my trigga went...\n\n[Interlude: Sicx]\nTriple-6 mothafucking Bounty finna to eat this mothafucking mom's\nPussy...\nSo there is it, nigga... And I'ma kick this shit for ya...\n\n[Verse 3: Sicx & (Brotha Lynch Hung)]\nGive it up for the Endangered\nAnd that's how my nigga went\nRough, so fucking rough, my nigga's trigga went rip gut\nSo fucking what?\nMy nigga Lynch ain't the nigga you thought he was, bitch\nCatch a bullet of Lynch Hung\nOr the swing of a left hook swung\nBy the fool who speaks in a Devil tongue\nThat's how that nigga went\nPlus that how my trigga went\nWouldn't ya figure by now?\nYou mothafuckas consider him insane\nThe Baby Killa's already dead\nBoom, boom, feel the weight of the lead in a baby's head\nSchizo, my nigga went buckwild\nHah haaaa...\n(...God bless ya child...)"}], "artist": "X-Raided"}