{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "D.P.M.O.", "image": "https://images.rapgenius.com/77fac9cb635136345d2df6c14f88ad3b.1000x1000x1.jpg", "lyrics": "[Verse 1]\nPneumonoultramicroscopicsilicovolcanoconios\nI don't know what that is, but I know that it flows sick\nOh shit, there I go being a dick again\nLook at me I can say the longest word in the dictiona\nRy ry ry...\nI don't know much but I know the future's bright, the future's green\nThe future's me, the future's I\nMaybe you'd understand me a little better if you were high\nToo like my DJ I-I-I-IQ\nMake no mistake, I'm just as high-igh-igh too\nIf you say the wrong thing about me\nYour career is something that you can say goodbye, bye, bye to\nHow's your album doing? Mine flew\nThis time around I'm doing what I did on the last one times two\nAnd some, damn son!\nHave you seen the state of your eyeballs?\n\n[Hook]\nDon't piss me, don't piss me, don't piss me off\nDon't piss me, don't piss me, don't piss me off\n'Til we stop there will be no falling, no we're giving everything we've got\n'Til the wheels fall off we'll be rolling, yeah we go anywhere we want\n\nLa-la-la-la-la-la-la, la-la-la-la-la-la-la, la-la-la-la-la-la-la-la\n\n[Verse 2]\nMeet at track meet, I eat tracks; that's me\nJack D, Hackney's in my blood, and weed\nAccede to the throne, taxi and I'm home\nBad B, black sheep, bag of beans and an O\nYo, I'm getting high tonight\nWith women who make do; getting bi tonight\nI like the life, I ain't into courting\nI'm only into spooning if it leads to forking\nI'm back buzzing, I'd shag Eva Mendes\nEven if she was my damn cousin, please don't think I am bluffin'\nEven though I'm swimming and women throw the pussy at me\nI ain't tryna catch nothing\nI ain't lightening up, I'm still as mean\nStill as drunk, still as high, still as lean\nStill as Green, stood still\nOn a pair of stilts in a distillery, sket\nThe last time I got head, it involved a guillotine\n\n[Hook]\n\n[Bridge]\nI don't know what it is man, but\nSomething about this beat just kinda makes me feel invincible\nYeah, like I could do anything I wanted without any question\nI might even cover my naked body in sticky tape and run through All Saints and come out doing my JLS impression\nDon't piss me off, (don't piss me off)\n\n[Hook]", "year": null}]}