{"artist": "Drake", "songs": [{"year": "2015-02-13", "album": "If You’re Reading This It’s Too Late", "image": "https://images.genius.com/bcf01db777c6e5c46eddb1031a2008d1.1000x1000x1.jpg", "title": "Company", "lyrics": "[Verse 1: Drake]\nI got some shit for you to come and get\nI'm at the St. Regis up on Briar Oaks\nHit me when you done your shift\nWooh, I see you doin' well, baby\nOh, you pullin' shit together, I can tell, baby\nIs you single or what? I need a girl from the country\nI need a girl from Kentucky, I need a shawty from Houston\nI need a girl who gon' love me\nI need a girl who gon' trust me, someone to fuck me\nSomeone to make me feel lucky\nSomeone that's so proud to be with me\nShe walk right up to her ex, look him dead in the face\nAnd say, \"You ain't got the juice like that\nYou ain't got the juice like that\"\nThat's cold, ice cold, girl you ain't have to do him like that\nWhy you had to do him like that?\nGotta come through quick, quick\nOh you at the club cashin' out with Eric\nThen hit me when you done your shift\nI know a girl I should propose to\nBut we just on some different shit\nShe on some up at 9AM already cookin' in the kitchen shit\nAnd lately we've been fightin'\nOn some \"why-you-love-these-strippers?\" shit\nYeah, she workin' with the spatula, I know she love flippin' shit, oh!\nOh, me, I don't deserve it (at least you fuckin' know it)\nShe's just a little too perfect, she's just a little too worth it\nI don't deserve her at all, no not at all\nI only text her, man, I never call\nI'm still a canine at heart, I'm a dog\nYeah, that's why you gotta come through quick, quick\nI'm posted at the Derek up on Westheimer\nHit me when you're done your shift\n\n[Hook: Drake]\nI need some company, I need some company\nI need you to take my mind off being in my prime\nSome company\n\n[Bridge: Travis Scott]\nI'm a dog, I'm in heat baby, heat baby\nI'm a dog, I'm in heat baby\nI'm a dog, I'm a dog, I'm in heat baby\nI'm in heat baby...\nMo City trip! Mo City trip right now! Yeah\nI'm on a Mo City trip, I'm on a Mo City trip right now\nAyy, ayy, a Mo City trip right now\nMo City trip, I'm on a Mo City trip right now\n\n[Verse 2: Travis Scott]\nIt's a couple faces in here that a nigga piped down\nSo let's go find a place that we can sip right now\nTour 'round the city, it's the shit right now\nIt's kinda lit right now that you're here right now\nPop a couple percs let's get it in right now\nSaturday nights, off in my bed right now\nCall up your girl and put them heels on\nIt's gettin' rowdy, rowdy right now, yeah\nI'm on a Mo City trip, I'm a dog\nI'm a dog, I'm in heat baby, heat baby\nI'm a dog, I go ham, I'm a hog\nBitch so bad, coulda thought I owed her somethin'\nBy the way I broke her off\nWhen she get too on, we take if off\nDrank so long, for a year I didn't cough\nFantasizin' and fistin' and switchin' up positions\nDo you mind if we just menage just a little?\n\n[Outro: Travis Scott]\nMo City trip right now, Mo City trip right now\nMo City trip right now"}]}