{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Verse 1: Peedi Peedi]\nUh Uh huh Uh Huh Uh\nI'll box your fuckin' head off\nWho gon' knock the kid off?\nNone of y'all which one of y'all, come try me\nI'll body little homeboy silence that sound boy\nCome challenge me please I promise you a homi'\nAnd I'm dipping in a bonnie' and I'm fresh out the county\nAnd I just taught my mami how to shoot a lil' tool\nSo I hate for you to run up get one up in your stomach\nThat's one less bullet from my hundred shot uz'\nPut your finger in your gun shot wound\nRun to spittle and tell 'em P Crack not cool\nHe on that shit that 'ill make a dead man move\nStop train, airplanes fall dawg you gon' lose\nI'm on my twist you on my list\nI bring the wop out of the spot it's on like shit\nThat nigga crack back and I'mma pop off my blick\nThat nigga Mack back you need to hop off our dicks (BRAATT)\n\n[Verse 2: Beanie Sigel]\nFresh out the federal cases I got several\nAbout four or five just had to settle two\nThey said I try to show a nigga what the metal do\nBut didn't succeed the nigga still breath\nTold em', please, I would of hit him in his p's\nWith the Mac with the beam that got back in the breeze\nOnly clap from the neck up I'd let the heck-lar plug 'em\nI don't think they made Kevlar scullys fuck it\nI should of let the AR touch him cuffed him\nTo the bumper drug him two city blocks\nThe juice in me and the henny shot\nFour percs' and a hit of wop\nYou shoot first if you get the drop\nYour deuce work if you hit the spot\nLose the nurse some one get the doc'\nRemove his shirt his pressure drop\nCheck his vital sign his hemorrhaging finish him\nFLATLINE\n\n[Hook: Beanie Sigel & Peedi Crack]\nLoad it up roll up BLAT boy flat boy (flatline)\nSlow up all that rap 'ill get that boy clapped boy (flatline)\nOh no here we go another (flatline)\nP crack B mack is back boy (flatline)\nGet him up outta here rrring yea (rring yea)\nDon't get plugged to that machine yea (machine yea)\nHold up he losing air (flatline)\nAm I clear? (am I clear?) (Flatline) yea (flatline)\n\n(Beanie Sigel)\nB seig'll squeeze the eag' on you\nP crack let the Mack rrring on you\nParamedics breath over you\nMachines gotta breath for you\nYour faggot ass squad wouldn't bleed for you\nGet flatlined I'm the wrong one\nShort temper with a long gun\nMy blick longer that a W.I.C. line\nNiggas snitch when the law come\nYou better run when the boy come\n\n(Peedi Crack)\nRRRRIING!!\nP crack'll test his aim on you\nB mack just bang on you\nFlesh just hang on you\nAnd I don't know what u been told\nBut when my Mac unload\nI'm guaranteed to turn a nigga cold\nGot ten shots for the present and the top\nRisin' off Porsche eleven about seven stops\nGet back on this gat I throw it for my pop\nI'm not lying don't get your ass flatline\n\n(Hook)\n\n(FLATLINE SOUND UNTIL THE END)", "image": "https://images.genius.com/48c4319dfc3c978405c6c446d03d8171.500x500x1.jpg", "year": "2005-03-29", "title": "Flatline", "album": "The B. Coming"}]}