{"artist": "Problem", "songs": [{"album": "Welcome to Mollywood 2", "title": "Brand New Bitch", "image": "https://images.genius.com/b1ed996e39c23e18263557323484529a.500x500x1.jpg", "lyrics": "[Verse 1 : Suga Free ]\nGo with that girl will make your nut up, uh\nSugar free up in the club like what up, uh!\nHair whip, fresh fit, feeling fondle\nFree with that name, strike game\nIt just don’t sound cool\nNo she don’t want you now\nBut she gonna want you later man\nBitch I’ma be Katt William’s cool by then\nGoing hard in the player paint\nWash condition, blow dry, press flat iron\nHands clip, nails dipped, you’re something I wanna sell bitch\nYeah sure you ain’t a groupie, plenty lie on it\nRather get tossed around then miss you 25 hunned\nSugar Free, a way better sucka ducka\nCheck an out of pocket bitch, mayweather motherfucker\nBitch I don’t know what the fuck you think this is\nYou looking at it as if you say the bitch is\nNow temptation, sayin, whoa shut up\nYeah we gonna scratch you till we get you bitch\nAnd ain’t gonna lie now\nNow what that horn do?\n\n\n[Hook] x 2\nI went to the mall got a fix\nAll these hating ass niggas on my dick\nI slide through the trap like this\nAnd I left out the party with a brand new bitch\n\n\n[Verse 2 : Cousin Fik]\nI came out the party hella over\nThe opposite of sober\nNew bitch, fresh out the box\nStill going up, like a good stock\nDope dick thrown back, for the gwap\nYou know you wanna give me neck, you a bop\nShow me you got intellect, give me top\nCause if not, ho I’m shutting down shop\nBitch!\nSick with it, bitch straight about the fucking V\nFuck with them then you know you gotta fuck with me\nCousin Fik, I ain’t never been a sucker G\nAin’t another nigga ever did time cause of me\nPuffing on trees, sipping bubbly\nPut her hb if the double tree\nSay she wanna poster up all because of me\nAnd in the next morning I’m right back in the streets and I\n\n[Hook] x 2\n\n\n[Verse 3 : Problem]\nTell her bout the thang with the bop\nHad a bitch busting big like a chopper\nPrrrr, killing that pussy, call the coppers\nNigga mad cause I had his baby come like a doctor\nMoving like a mobster, eating on pasta\nRun up on me wrong, you gon dread it like a rasta\nBy my clock I bite cheese like rat\nMolly got my hoes here twisted like that\nDiamond Lane gang nigga come get with it\nKeep a thick nurse cause I’m so sick with it\nShout out to the water, shout out to the bay\nFuck away with us betta put a k in\nC.O.M.P.T.O.N. and that is what I’m repping\nTryina find a brainiac so I can get a lesson\nBusting nut then get higher\nAfter that it’s a rap, no flat iron\n\n[Hook] x 2", "year": "2012-08-30"}]}