{"songs": [{"year": "2015-12-26", "album": "Keisha vs. Kash Doll", "image": "https://images.genius.com/971d444e51120df288bcdf10eccf67d3.500x500x1.jpg", "title": "Cheap Shit", "lyrics": "[Intro:]\n\nHello?..\nHello? (Kash KenDoll)..\nWassup Ken?\nYeah, I found some boots. (Ken)\nCool, how much are they?\nThey $450 (Ken)\nWhat?\nYeah. (Ken)\nYeah what?\nThey $450 (Ken)\nDONT BRING ME THAT SHIT\n\n[Chorus:]\n\nI hate cheap shit, I hate cheap shit, I'm not a cheap bitch\nReceipts what's this? Don't bring me that shit\nI hate cheap shit. I hate cheap shit. Kash Dolllllll\nI'm not a normal bitch\n\n[Verse 1:]\n\nI hate cheap shit, let em off the leash quick, Saks 5th, balling Balmain's on my sheets bitch\nI ride in foreign whips, never do I lease shit\nNo motels, I'm a presidential suites bitch\nIt's no weak shit, I ain't tryna beef bitch\nMiami forge eating, tryna make the Forbes list\nAnd when I'm out the country, I don't need a tourist\nCondo in L.A got fishes in the floor and shit\nDon't want it on my wrist less it cost a grip\nGas in my whip 93 no cheap shit, Giuseppe's on my feet\nNo fleece shit.. VVS diamonds on me\nNO WEAK SHIT BITCH\n\n[Chorus 2:]\n\nI hate cheap shit, NO, NO, NO, NO, NO\nI hate cheap shit, Please get it away. I'm not a cheap bitch\nGet it away from me\nReceipts what's this? Ewwww. Don't bring me that shit\nNo, No. I hate cheap shit. I hate cheap shit. I hate itttttt\nI'm not a normal bitch\n\n[Bridge:]\n\nI know what I want, what I really really want. (4x)\n\n[Verse 2:]\n\nIt ain't cheap shit!\nYou a weak bitch, you wore that last week bitch!\nYachts make you sea sick, you comfy on the beach bitch\nTop shelf sip, you just guzzled down cheap shit. UGH!\nIt's Don P, when I pee bitch\nI hate coupons, I hate futons\nAnd niggas wit' that little bread I hate croutons\nYou all up in my mustard, pass the Grey Poupon\nThen I pull off in a Massy (\"Maserati\")\nCause I hate Yukons\nYOU... BITCH!\n\n[Chorus 3:]\nI hate cheap shit,(I don't wannaaaa) I hate cheap shit, (Nooooo)I'm not a cheap bitch\n(Please don't bring it close to me)\nReceipts what's this? (It's gonna make me itch!)\nDon't bring me that shit. (I'M ALLERGIC TO IT!!!)\nI hate cheap shit. (You're gonna make me sick)\nI hate cheap shit\nI'M NOT A NORMAL BITCH!"}], "artist": "Kash Doll"}