{"songs": [{"album": "Pretty Girls Like Trap Music", "image": "https://images.genius.com/09cea4ddc89b5b634ecb6601b645e7a2.966x966x1.jpg", "title": "Burglar Bars", "year": "2017-06-16", "lyrics": "[Intro: Louis Farrakhan & Monica]\nAs I met 2 Chainz a few minutes ago, as I gazed into his face, I felt that I was in the presence of royalty. There's a certain power presence that he gives off\nI tried to be, everything you want and need\n\n[Verse 1: 2 Chainz]\n'Cause you got a deep title don't mean that you deep\nSubstance shallow on shit creek, I heard Cole speak\nAbout the bricks, Kendrick got Compton lit\nAnd I've been lit ever since I sold nicks\nNever fabricated about my fabric, the scale, that's my apparatus\nI give a fuck about the sorriest rappers\nThis actually happened, path in the back pathogenic\nMoved that blow out like we were afrocentric\nI had a front row entry, I had the codeine kidney\nI made up the Bentiaga truck, you owe me a Bentley\nThis the rap Ken Griffey, got at least 10 with me\nGot at least 10 on me, I'm anti-phony\nMy girl anti-bony and she get that money\nI bought all this shit, don't go acting anti on me\nIt's Mr. Epps in the bank, I give a F what you think\nI bought a Tesla today, there's nothing left in your tank\nI did everything except a fucking song with Jay\nBut I murdered every song I fucking did with Ye\nSee my verses are better and my subject is realer\nSee my mom was an addict and my dad was the dealer\nAnd their son is that nigga, I'm no Black activist\nI'm a Black millionaire, give you my Black ass to kiss\nWe used the tree for a fence, I used to land in the trench\nUsed to dust myself off, then I eat me some shrimp\nCoulda did anything, I coulda been me a pimp\nI coulda went to the league, I took it straight to the rim\nI took it straight to the block, I got Xans in my sock\nI got plans for the pot, I got bands, you do not, huh\n\n[Interlude: 2 Chainz]\nYeah, you a miracle. Right now, if you hear this, you're a miracle, I want you to know that. If you're able to hear this right now, you are a miracle. Straight up, no kapp\n\n[Verse 2: 2 Chainz]\nI'm more Gucci than Vans, give you a Gucci advance\nThis the chance of your life, you ain't prepared for your life\nSee the man without a mic is just a mic gimmick\nAnyone, Jordan, Jackson, Tyson, Bivens\nPhone number unlisted\nGave her the digits to a number that is long distance\nShe on the wrong mission and got my palm itching\nI had it on me, you can see it in my prom pictures, ugh\n\n[Interlude: 2 Chainz]\nI'm telling you, niggas like me fall out the sky. You don't just bump into me. I'm a real blessing, bro, nah, for real, bro\n\n[Chorus: 2 Chainz]\nYou know the times is rough, you know the times is hard\nI never trust my neighbors, so we got burglar bars\nYou know the times is rough you know the times is hard\nI never trust my neighbors so we got burglar bars, Lord, yeah, okay\nYou know the times is rough you know the times is hard\nI never trust my neighbors so we got burglar bars\nYou know the times is rough you know the times is hard\nI never trust my neighbors so we got burglar bars, Lord, Lord\n\n[Bridge: Monica]\nLord knows\nWoke up today, gave thanks\nGrateful to see another day, then the storm came\nAs the night falls, I shed my blood, sweat and tears\nLet the rain fall, let it fall, let it fall\nOne day\nYour love will take me right over the stars, Lord knows\n\n[Outro: 2 Chainz]\nThat soulful trap music, man. Yeah, I'm talkin' 'bout Section 8, I'm talkin' 'bout the 'partments. You stay in the middle, someone stay on top of you, someone stay below you. What you know about grabbing a broom and shit and hitting upstairs like, \"Y'all stop fucking stomping! Y'all stop walking so mothafuckin' hard!\" Then the people downstairs, they doing the same shit to us. Tru, trill shit"}], "artist": "2 Chainz"}