{"artist": "Fabolous", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/8e2843dcf4a386d5de04cd6e203899e1.391x391x1.jpg", "lyrics": "It's time to get money\nI got a million reasons why I'm better than them (a million)\nYeah (I'm about to give you one right now)\nIt's Loso in case you ain't know so baby; let get right into it\n\nWhat's really the dilly with these silly muhfuckas\nBuncha fake ass Milli Vanilli muhfuckas\nYet still these muhfuckas say they feel these muhfuckas\nBut I only smoke Dutches I don't feel these muhfuckas\nThey gon pull and shoot what?\nNo really muhfucka\nYou gon run, prolly pull ya achilly muhfucka\nNigga please, you wouldn't pop a wheelie muhfucka\nYou wouldn't raise the heat if you was chilly muhfucka\nI will kill these muhfuckas\nTill' these muhfuckas know that I Am Legend\nCall me Big Willy muhfucka\nI'm wit Freck Billi and some West Philly muhfuckas\nAnd you can be a vic if you get silly muhfucka\nSo if you feelin froggy leap that lily muhfucka\nAnd I'll serve yo fruity ass like Wet Willies muhfucka\nI'm like Obama to these silly muhfuckas\nAnd you niggas is Clinton, Hill Billy muhfuckas\nNiggas said you niggas is Clinton. Hill Billy muhfuckers\nHillary, Bill Clin--Fuck it. They don't get it\n\nI am a million-aire in some Louis V millionaires\nWhite bucket like Gilligan wear\nLa familia in here, don't care who over there\nRed rover red rover send them bitches over here\nYou can also send the waiter, yeah I think his name Ramon\nTell his slow ass to c'mon wit that Grey Goose and Patron\nTryna get em in the zone da da da zone\nSo I can pick and roll like Stockton and Malone\nYa smell me, nah baby not my cologne\nLet me be clear as some Bacardi Limon\nLooky here Simone, you can call the phone\nBut if you ain't tryna bone you'll be talkin to the tone\nI'm so cocky that all I wanna do is bone\nI'm so Rocky my last name should be Stallone\nI ain't Jimmy baby, I ain't here to Jones\nFuck whatcha talkin bout....its Los", "title": "A Milli"}]}