{"artist": "Angie Martinez", "songs": [{"title": "We Can Get it On", "image": "https://images.genius.com/fa4abffe2c6164a010ae6b833f491d67.1000x981x1.jpg", "album": "Animal House", "lyrics": "[Intro: Angie Martinez] {*N.O.R.E. in background*}\nYea, ok...\nUh, uh, uh, uh, uh, uh...\nYea, uh, yo, uh\n\n[Angie Martinez]\nThey call me Diva La Angie\nRippin' the arenas in Miami\nSlippers in the sand beach, c'mon dance with me\nOr the chulos in white tees (yea)\nYou ain't peeped the Billboard on Jimmy's\nThen I guess you cannot see\nYou wanna party wit me, da-to\nOnly big dogs invited, no gatos\nQuite though, what's with all the questions, whoa\nWhy you asking? I'm all in wit my friends embarrassing\nBe easy, you wanna get up close and personal?\nCop the CD, if not leave me\nI'm bout to bag somethin', why you blocking?\nCause your man in Timbs is home watchin'?\nI'm a pro, mangu on the stove\nChancletas and a robe, my crew at the show\nBig Pun in my heart, esperate how it go? it go\n{*Men chanting*}\n\n[Hook: N.O.R.E.] (2x)\nIt go esperate, hold on, legs so strong\nWe can do it, we can do it, we can get it on\nYou know what's \"papichu\", and playing \"capicu\"\nAnd tell them chicks that they can all come around too\n\n[Angie Martinez]\nOh Jay +Mi Amor+\nI would love to date you, soon as I come off tour\nI like papis from Cuba, Colombia, Bermuda, Peru or Ecuador\nWe got PR, DR, Mexico, Panama\nGuatama' pa's wit flags in their cars\nThis is for the Jose's, Juan's, Claudio's\nBroadway, LES, en el bario\nBronx, Fernando's, only trabajando\nOn the calle, watchin' for bandos\nThese - Orlando, Victor's, Tony's\nWho pick up and hold me, put away your Rolly\nI like 'em low key, oh you blow trees?\nI got half an o-z you shoulda' told me\nI get the groceries and 'Pac's CD\nNow everybody sing my part with me, c'mon\n\n[Hook]\n\n[Angie Martinez]\nHard level to the quarters at the fight screaming \"Ti-to!\"\nOr at the table all night, Mojito\nWhachu know about the Chimmy-Cherry?\nAnd don't forget, I need a cab para tu me le tumbe le\nCome down - BK, uptown - NY to LA\nEverything's still \"Suavemente\"\nPara mi jente, after the show\nEverybody get your freak on (sawago-sawago)\nAll my eses, Etey\nThis is the casa con anamo anamo\nYou know what's that? Angie the Old G\nI can be a girl, and be your \"Cold D\"\nAnd we can go eat, see, I'm a keeper\nAll I ask is for me to see you in wife beaters\nAnd in them nice sneakers\nHe like me? I don't doubt him\nWord? You got feelings for me? then cop two albums!\n\n[Hook]\n\n[Men Chanting]\nEsperate, hold on, legs so strong\nWe can do it, we can do it, we can get it on!\nWe can do it, we can do it, we can get it on!\nOohhhh!", "year": null}]}