{"songs": [{"album": null, "year": "2018-04-20", "title": "1985 (Türkçe Çeviri)", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "1985, ben doğdum\n33 yıl, vay be, hayatta olduğum için minnetarım\n25'imizi geçmememiz gerekiyordu\nŞakalar sana amcık, hala hayattayım\nYeni çıkan zencilerin hepsi genç\nHerkes onların yaptığı müziğin aptalca olduğunu söylüyor\n18 yaşımı hatırlıyorum da\nPara, parti, amcık, ben de aynı şeylerin peşindeydim\nÇocuklara büyümeleri için şans tanımalısın\nBugünlerde herkes bir şeyler biliyormuş gibi konuşuyor\nZenciler ayık gibi davranıyorlar ancak onlar parasızlar\nÇabanızı takdir ediyorum ancak bu günlere sizler öncülük ediyorsunuz\nAdamım, daha araba sürecek yaşta bile değiller\nOnlara ne yapacaklarını söylemek mi? Ben kimim?\nOnlardan birinin beni disslediğini duydum, şaşırdım\nYaklaş küçük adam, seninle konuşmama izin ver\nBakalım senin için büyük resmi çizebilecek miyim\nTebrikler, annenin evinden ayrılabildin\nUmarım annene bir ev alabilecek kadar kazanırsın\nBakıyorum saatin parıltılı ve araban pahalı\nBir tavsiyem var, tur yapmayı asla bırakma\nÇünkü bu günlerde biz rapçiler böyle kazanıyoruz\nGarip lil rap isimlerinle dalga geçiyorum\nMüziğini duyuyorum ve rap'in değiştiğini biliyorum\nBazıları bunun kötü bir şey olduğunu söyleyebilir\nÇünkü artık her şey reklama dayalı ve pop\nTrap drumlar havalı olan şeyler artık\nGörüyorsun, yeni nesil için bir görevdeyim\nNeyse boşver, bu sadece bir geçiş\nSöylemem gerekli ki parçalarından etkilenmedim, hey\nAncak siyahi birinin para kazanması hoşuma gidiyor\nAyrıca bu işten zevk alıyorsun ve buna saygı duyuyorum\nAncak yarattığın etki üzerinde hiç düşündün mü?\nBu beyaz çocuklar senin hiç bir şeyi umursamamanı seviyorlar\nÇünkü tenin siyah olduğunda senden bunu bekliyorlar\nSenin dab atmanı bekliyorlar, senin hap atmanı bekliyorlar\nSuratından topuklarına kadar dövme içinde olmanı bekliyorlar\nVe derinlerde bir yerlerde, siktir, gerçekçi olmam lazım\nOnlar siyahi olmak istiyorlar ve parçalarının öyle hissettirdiğini düşünüyorlar\nYani sen bir şey yaptığında onların da yaptığını görebilirsin\nSonraki şehire geç, zamanı geldiğinde paranı topla\nParanı alıp, sürtükler içinde yüzüyorsun, seni suçlamıyorum\nAncak benim ve senin gibi gözükmeye çalışan insanları düşünmüyorsun\nDoğru, yapman gereken daha önemli şeyler var\nKazandığın paralarla bir varoşu satın alabilirsin\nBiliyorum bu gelir hiç bitmeyecekmiş gibi hissediyorsun\nAncak sana bunun doğru olmadığını söylemeliyim\nBir gün seni dinleyen çocuklar büyüyecek\nVe senin patlamana sebep olan şey için çok yaşlı olacaklar\nArtık onlar gelmediği için şovların zayıf gözükecek\nVe bu ne yazık ki paranın azalması demek\nŞimdi tekrar göz önüne gelmek için umuyor ve kıvranıyorsun\nAncak trendleri takip ettiğin için patladığını unutuyorsun\nŞimdi sen eskidin ve pişmanlıklar içinden geçiyorsun\nÇünkü o evi satın almadın, yerine Benz aldın\nOnlarca mücevher ve ayakkabı aldın\nOnlarca sahte arkadaş edindin, seni yargılamıyorum\nSadece rap yaptığın konu hakkında rap yapmaya  devam edersen neler olacağını söylüyorum\nDibe gitmek için iyi bir rota\nSana iyi şanslar diliyorum\nİyiliğin için göründüğün kadar aptal olmadığını umuyorum\nAncak insanların söyledikleri gerçekse\nGerçekten benim adımla dalga geçiyorsan\nO zaman gerçekten boku yediğini bilirim, güven bana\nSonsuza kadar çevrende olurum çünkü yeteneklerim yeri boylamak isteyen tüm zenciler için kusursuz\nİşler boka sardığında dediklerimi hatırla\nBeş yıl içinde Love&Hiphop'a çıkacaksın zenci"}], "artist": "J. Cole"}