{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Beanie Sigel]\nUhh, I did it again niggas (ha ha!)\nYou know you done fucked up right? (Right.. right..)\nI know what y'all out there askin y'allself (uhhh)\nWill his gun EVER jam up?\nNo...\n\n... a lot of speculations\nOn the hammers I done raised, niggas I done blazed\nMan I stay strapped, will that nigga really clap?\nNiggas I got popped or shot up direct\nIs it true he kept a mac and don't fuck with them tecs?\nWhat's the position you hold, when that stock gon' fold\nOn that K rappers sprayed when my gun unload\nBullets tired of shit, but they'll leave you cold\nBefore +Boyz+ turn +II Men+ they at the \"End of they Road\"\nYeah the bully back, to put you on your ass\nQuicker than that fully mac slide a bullet in the shaft\nI give 'em room to breathe, but never room to leave\nEvery nigga I done clapped, never came back\nLocked, nice Glock, nigga you should see the mac\nThat hold 40 fevers when the stock pulled back\nYou be sweatin like 40 fevers when I pull that\nLet's end the speculations on will I clap\nWhen you muh'fuckers gon' realize that?\nI blaze you without a razor get your wig pushed back\n\n[Chorus]\nIt's the same ole thang, in the game and it ain't no change\nCats come don't say no names, we don't play no games\nAnd we quick to let the thang go bang\nIf a nigga wanna test my aim, it's the same ole thang\nSame ole thang, it's the same ole thang\nSame ole thang\n\n[Beanie Sigel]\nMan, ain't shit different, it's the old Ford Sig' remix\nBraids gone, my wave's on, got 'em seasick, I'm up in\nYour ribs touchin like you ain't eat shit\nWhoever said that the kid wouldn't be shit? Stacks increasin\nThat's a moot point so keep leapin\nSpaces to the left, feds keep creepin\nPlottin on my arrest, they want a nigga stretched in the precinct\nPress'll paint a picture like, don't release him\nCheck his background, his prior stretch since a delinquent\nPlus check the people he in sync with\nThem +Old Kids on the Blocks+, who else who on the +Backstreets+?\nThe +Boys+ tryin to +Color Him Badd+\nHe's a three-time felon in fact, he on probation right now\nAnkle bracelet can't confine him to the house\nBad weight, no consighment, can't confine him 'til it drought\nMy fed case lawyer knocked the bottom of it out, BLAOW\n\n[Chorus]", "image": "https://images.genius.com/90755a9980651bac4783ed0e25927570.600x600x1.jpg", "year": null, "title": "Same Ole Thang", "album": "Still Public Enemy #1"}]}