{"songs": [{"title": "Otherside", "lyrics": "{Jaja Soze}\nYo! this is the other side of the story you never hear about\nKillers looking out the jail windows and start cryin' out\nLike \"Mom I miss you!\"\nPlease forgive me\nDon't mean to diss you\nSittin' here\nWipin' the tears\nWith a tissue\nMom I miss you\nBut what about the rapper that blings\nMostly sings\nBut didn't tell the fans his mom bought those things\nWith her last wages\nFrom her cleaning job\nSweeping stages\nFor the mere fact\nShe'd rather you be happy\nThan locked in cages\n\n{Akala}\nThere's no honesty\nHonestly it bothers me\nDone with the fake shit\nFlick your heels Dorothy\nRun off back to OZ with fake tales of Montana grams\nLike 99% of the block strugglin' for a grand\nGrandmother diabetic\nInsulin gets injected\nAnd little kids neglected\nCause parents livin' reckless\nI've done wrong can't judge the suppliers\nBut there's far too many fiends in my life to ever glorify it\n\n{Hook, Akala and Jaja}\nThe otherside that you never see on television\nThe otherside when a killers shed a tear in prison\nThe otherside ain't written in gold\nIt's really cold\nThe otherside of the truth but its never been told\nThe otherside ain't no fake rap videos\nJust jail cells, funerals and the mental homes\nThis rap shit used to be the news from the hood\nNow everyone's jumpin' round like it's all good\n\n{Akala}\nWhat you know about moms addicted to the pipe\nHood plus the wicked type\nDads in and out of jail\nAnd he's an Ike \"I Am-ite\"\nWhat you know about two parents with two jobs each\nWith a grown man for a son that raps talkin' grease\n{Jaja Soze}\nSee everybody's in a gang but not really prepared\nSee you're a plumber not a killer really you're scared\nAnd you would brag about the killin' not the nightmares\nYou going to flow where you sleep and got sweat in your tears\n{Akala}\nOne of my O. G.s told me once\nHe couldn't pull up to the lights\nWithout seeing the night\nThat he first took a life\nHe vomited\nFor months on end\nThen picked back up the sting\nAnd he'll be 65 before he ever see his ends again\n{Jaja Soze}\nI got some close friends and killers that work nursing clones\nSmoking something that poisoned them to the mental homes\nRepeat the cycle of destruction that was built for the zones\nSelf genocide sellin' each other coke bones\n\n{Hook}\n\n{Akala and Jaja}\nHey Jaja have you seen um, these grown men fibbin'\nToo scared of themselves admit about how they're really feelin'\nYeah I see them talkin' about killin'\nLyin' at home chillin'\nNo guns, no knife they just lyin' about drug dealin'\nWhat ever happened to really really fightin' the system\nIf we body dem we body for dissin' mothers and sisters\nMan, what happened to the progress\nAll I see is crossdress\nIf you lyin' to these kids then that just makes you hopeless\nThis music is our culture weapon if we use it right\nOr point it at our own heads, this is self-suicide\nDo these little kids in the sticks\nReally think these guys are real\nWould they be making rap songs if they really kill\nIf you're in real beef\nAnd your name's on the poster\nIt ain't that hard to just\nDrive by and toast ya'\nYo Jaja did your dad leave\nYa my dad left, bro\nYeah fam, mine as well\nAnd I still can't let go\nThe pain of how I grew up\nPeople call me a screw up\nDrunk half the nights off Henney until I threw up\nWalkin' around the block\nMe and my brother tore up\nMe and my mom at the post office\nFor 20 pounds we cued up\nMe and my big sis\nFightin' grown men crazy\nBig brother died as a baby\nSo who the fuck you think raised me\nSo what's the message in the song\nBe honest nothing more\nIf you really live the grind\nJust be honest and make sure\nIf you a straight A student\nDon't pretend you're a shooter\nI know grown men that can't read\nAnd end up bein' losers\nCause the other side is just like anywhere else\nWe just wanna live good and help ourselves\n\n{Hook}", "year": null, "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}