{"songs": [{"lyrics": "[Verse 1]\nWalking down the street with a gangsta limp\nHoes on the corner like a O.G. pimp\nFeelin real good cuz I'm drunk and high\nThrowin up the hood as the cars go by\nThe light turned green and I started to bail\nAcross the street, drunk as hell\nSeen a fine girl at the red light\nHer face her hair her car was tight\nThe light turned green and she had to go\nThe bitch pulled over at the liquor sto'\nShe got out the car and walked around\nAnd there I was, posted 'cuz\nShe looked at the Khakis hangin off my ass\nShe put her head down and tried to pass real fast\nBut on the way back out, before she left\nI asked her with Colt 45 on my breath\n\n[Hook]\nCan I get my freak on with you? (come here baby)\nSmoke some weed and drink some brew (I love ya body)\nCan I get my freak on with you? (yeah)\nSmoke some weed and drink some brew (oww)\n\n[Verse 2]\nWhen I heard Too Short \"The Freaky Tales\"\nI was still a virgin, I was mad as hell\nHad nothin to lose, everythang to prove\nTryin to fuck every duck that moved\nHangin at the swapmeet, drunk and high\nFlirtin with the hoodrats walkin by\nSometimes I got dissed, sometimes I got laid\nSometimes I got ganked, sometimes I got paid\nHigh school parties in East Palmdale\nDancin with a female lookin bomb as hell\nWith a booty up against me make me feel real good\nPlus her hands between my legs rubbin on my wood\nMy dick Johnny Cochran gets real hard\nAnd all of a sudden, I want the broad\nHigh on weed, drunk on beer\nThat's when I whispered in her ear\n\n[Hook]\n\n[Verse 3]\nRedheads, blond hoes, Puerto Ricans and chicanos\nOriental girls not mention black\nBack to back, stacked like a six-pack\nPanties droppin, bra unstrappin\nLike Mariah Carey I'mma +Make It Happen+\nWhoo whoo (whoo whoo), ride hoes like my Coupe\nI'm 30 years old in 2004\nI got a wife and I don't fuck around no more\nAy, remember Joby, well Joby's a giant\nAnd bitches wanna do me like I'm Kobe Bryant\nToo many skeezers, too many diseases\nNow I'm in the Bible tryna be like Jesus\nI used to be a gigalo back in the day\nI remember when I used to say\n\n[Hook: 2x]", "title": "Freak on with You", "album": "Afroholic: The Even Better Times", "image": "https://images.genius.com/c4fd850563348aed762e3d484ea76e19.500x500x1.jpg", "year": null}], "artist": "Afroman"}