{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Not a Freak", "album": "Weekend Warrior", "lyrics": "[Biz Markie]\nIn what?  In stereo\nHow long, until it's time to go?  Baby doll\nIt's the Biz Mar-kie, and the Def Squad!\nOh see, we gotta do this again like this, check it out\n\n[Verse One: Biz Markie]\nYou keep on knockin but you can't come in-ah\nMy way of rhymin, cause you're a beginner\nYou know with my flow, I bring the ill freak funker\nI'm so unforgettable like Archie Bunker\nI be catchin wreck like my name was Randy Moss\nAnd always be flossin, my funky diamonds costin\nMy, my my repertoire\nIs so bizarre you go hardy har har\nMy jingle bell-ah always Roc-A-Fella\nEven if I go acapella it will still be a best seller\nI got super sperm, eat wheat germ\nNever had a cameo, never had a perm\nI'm not Billy Dee, or R. Kelly\nOr, Markie Dee or B.I.G\nI'm a, LITTLE somethin like Heavy D\nBecause \"girls ah girls they love me\"\n\n[Chorus: Biz Markie]\nI'm not a freak!  But I can't help my-self\nI'm not a freak!  But I can't help my-self\nI'm not a freak!  But I can't help my-self\nI'm not a frrrrrreak!  But I can't help my-self\n\n[verse Two: Erick Sermon]\nYeah... yo\nI'm that eighty-eight, 'It's My Thing' rapper\nYou that one year scream BLING rapper\nDapper than Dapper Dan, my interior's Gucci\nOverdosin, call me John Belushi\nNever liked Lucy and I beat Little Ricky\nMade him +Cry a River+ like his name was Britney\nI rock gold chains, I never wore the platinum\nUnless records was jewelry and it come from rappin\n(WOW!!) Like the Diabolical Biz\nI'm followin his, style - how are you kids?\nThis here is real, Mobb Deep underground\nTake me to funkytown, and drive around\nI hop out the Hummer, the same color as the truck\nFake cats lookin Biz like \"Hey whassup?\"\nI'm a vet, and never wore a green suit\nThe only army is Def Squad, believe troop!\n\n[Chorus]\n\n[Verse Three: Biz Markie]\nAh let's do it, let's do it\nWork your mind, put your body in-to it\nI rock the microphone, most definitely\nI got mo' rhymes than Muhammad Ali\nI got mo' toys than Mr. Spock\nI put the party people in a state of shock\nListen listen listen to the Emmezah-A\nRrazah-K, always makin your day\nWithout further adieux for you and yours\nLuckier than a gambler throwin 3's and 4's\nJust like {?} pageantry\nThat I could turn the party out, make the ladies scream\nWith the with the whoa quick unpredictable\nLike Daffy Duck, I'm diss-pic-a-ble!\nThis is the end, and I'm lettin you know\n\"I love it party people, but I got to go\"\n\n[Chorus]"}], "artist": "Biz Markie"}