{"songs": [{"image": "https://images.genius.com/a47f031d905b5e2c7ccd7f22441ad2c7.1000x1000x1.png", "album": "Bad Intentions", "title": "Tarzan 2 (I’m Coming)", "lyrics": "[Verse 1]\nSo I hate when I talk to my boy from pen and he acts like cuz you forgotten me\nI ain’t got time to shit let alone come check you blud\nYou know I’m hot property\nI got property\nRight now I’m in Europe fucking up shit\nMore than the economy\nSo when you land you know I got you properly\n\n[Hook]\nI bring my people through with, everything I\nDo\nYou reckon me I pop wid’ you\nAhhhhhhhhhhhaaaaaaaaa\nYou a snitchin’ little bitch and you love\nSingin’ to the blues\nWell this song wasn’t made for you\nAhhhhhhhhhaaaaaaaaaaa\nI’m coming\nI’m coming\nFor you\nAaaahhaa\nI’m coming\nI’m coming\nFor you\n\n[Verse 2]\nYo, fuck so good make a bitch wanna fight me\nWanna rolex ring Wiley\nWhen I was a bum, no-one really liked me\nNow its time someone went a got a new job for Tinie\nI’m only playing\nI’m just saying I’ll shit so hard I’m constipated\nOverworked, underrated\nNow my tings poppin’ off, no gun relation\nGrind all day but I ain’t roller blading\nAll eyes on MOI, holla baby\nNo love for the X, on that note, T\nTell Kelly i’ve got that motivation\nI beg, someone find Max online and let her know I wanna smash her from the back\nIf not Sarah Jane can come give me brain and put them big red lips on my sack!\nI’ll be killin’ cause I’ll be getting bred\nHard doe, number 1′s all day on the chart show\nSo F*CK YOU and your 90 track mixtape\nThats a million bars of arsehole\nMy flows are wrecked and it opens legs\nIts fly than a motherfucking jumbo jet\nWhat a selfish bastard, no respect\nYou know Dapz, no regrets\nI still roll through my hood and I wear my chain\nF*ck a top boy Scorcher and Bashy can’t do the same\nReal recognised, reaaaalll\nHow many albums have you sold today?\nI ain’t saying that I'm Wayne or Kanye\nBut I’m living life on the runway\nIf your nang, I’ll be like ‘Welcome on board my brudda, say bye to gun play’\nKing of the jungle, hardest can be, I dare you to let your chick party with me\nIm Tarzan and im hung like a tree\nImagine if your new born pops out looking exactly like moi\nBanter, but on the real get her on pampers because I’ll be on the tour bus getting pampered\nI heard Simon Cowell thinks I’m a little wanker\nAn i’m getting on his tits like Cancer\nAnd I don’t wanna start mentioning names (Fuck it)\nWhere they all now? There bankrupt!\nJoe McElderry, oh what a stand up!\nAlexandra, pull your socks up!\nWhere you hits at? You ain’t no winner!\nI feel bad cause your voice is amazing but your careers getting raped by a Mason\nThat shit fucking upsets me, cause it don’t get me, try bring them near me\nComing round with your hands out, wanting a hand out, ahhhh thats too political\nI don’t care about a Bentley, Gucci or a Fendi, man's living in a spaceship!\nYou got clapped by a, BANG!\nYour girl got macked by a BANG!\nThat smooth criminal\nI’m a product of my environment I ain’t sayin’ me and you are any different\nI’m just planning an early retirement\nI don’t mean surrey when I say I’m going Kingston\nEvery mans welcome to fly long distance\nWe be on the beach with Weed Man Winston! WINSTON!\nPlus I’m the craziest ting out the United Kingdom\n\n[Hook]", "year": "2012-07-07"}], "artist": "Dappy"}