{"songs": [{"year": null, "image": "https://images.genius.com/8a1ec925ad38ad02b62e35534537e993.252x247x1.jpg", "title": "Purple Stuff", "album": "Purple World", "lyrics": "[Intro: Big Moe]\nThrow, yo' hands highhh - wave 'em side to side\nThrow, yo' hands highhh - wave 'em side to side\nThrow, yo' hands highhh - wave 'em side to side\nThrow, yo' hands highhh - wave 'em side to side\n\n[Big Moe]\nEverybody clap yo' hands, and sing along wit me\nIt's Big Moe, da barre baby, representin these Southside streets\nNow if you ain't heard of me then you don't know wassup\nYou can find me on them Screw CD's talkin about 'Purple Stuff'\n\n[Hook]\nPurple stuff! (Purrrr-pullll) Purple stuff, purple stuff\nPurple stuff! (Purrrr-pullll) Purple stuff, purple stuff\nPurple stuff! (Purrrr-pullll) Purple stuff, purple stuff\nPurple stuff! (Purrrr-pullll)\n\n[Big Moe]\nNow see it started back in seventy-fo', Teri gave life to Moe\nSee momma was a hustler, daddy was a buster, y'all know how that go\nI was raised Screwed Up Texas, didn't know my direction\nNow I'mma state representative, been chose by election\nSome said I wouldn't make it, but I'm still in the game\nThings done changed, diamond rangs;\nMan it's funny how things done changed\nI hooked up with that DJ Screw\nHe slowed it down, chop-chopped it too\nGot blades on the bus, candy paint on the truck\nIf you wanna know what's in my cup..\n\n[Hook] - 1/2\n\n[D-Gotti]\nNow.. now.. now..\nThat 'Purple Stuff', that Houston soda in my cup\nNow I'm behind the wheel, catch the wood, I'm done\nUnder the influence of bar (?)\nDrank stains on my FUBU and I still feel like a star\nNow I'mma go up behind the wheel cause I done woke up\nWrapped around a pole and took a sip from my cup\nNow I can't slip up, (?) clipper\nCatch a playa leanin impa-uh, one up in the trunk\nNow.. now hut, two, three to da fo'\nI done slammed up the fo' wit a Crush Pineapple\nGotti gon' last long but I ain't sippin wit dat bowl\nDrinkin at the bar baby I be way too throwed\nAnd I guess a playa had about enough..\n\n[Hook]\n\n[Repeat Intro, mingle with Hook and ad libs]\n\nI love that Purple Stuff, yeah.."}], "artist": "Big Moe"}