{"artist": "C-Rayz Walz", "songs": [{"title": "Great Voices", "album": "The Prelude", "year": "1999-12-31", "image": "https://images.genius.com/ec963359d22a35a29c442701ff7a7d34.500x500x1.jpg", "lyrics": "[Intro]\n[Sample from ?]\n“Now some people are saying that I’m crazy”\n[C-Rayz Walz]\nDJs and MCs.  Coming up next, the one and only incredible, yin and yang king.  Yo.  Grab the [rope?]\n\n[Hook 1: C-Rayz Walz]\nI’m in the house, y’all (Say what?)\nI’m in the house, y’all (Say what?)\nYin and yang, C-Rayz—we in the house, y’all\nI’m in the house, y’all (Say what?)\nI’m in the house, y’all (Say what?)\nThis what the Sun Cycle be about, y’all (Say what?)\n\n[Verse 1: C-Rayz Walz]\nBut I’m C-Rayz Walz from New York state (State)\nMy ancient style is what I proclamate (-mate)\nWhen I demonstrate (-strate), it can’t be fake (Fake)\n‘Cause I got sharp swords for the snakes\nI kill the mic (Mic) and live the jam (Jam)\nGive birth to word (Word) if you overstand (-stand)\nWaive hands, change plans when you see my fam (Fam)\nStronghold, guest clan—on the mic, I am\n\n[Verse 2: C-Rayz Walz]\nHeed the word, unsee the herb\nFind justice when the brother occured\nOut the darkness with cups of light\nHeaven and hell, day to the night\nTravel the beats beyond\nTime-warp souls to the Pantheon\nFight the demons, unchain the brain\nSee Jack run, complain to Jane\nRock fables, fables and joke\nNot knowing you work for ghosts\nThe gulliest at the williest\nIn actuality, you’re just the silliest\nIceman coming—froze the stage\nUnseen hand that turn the page\nWho’s the author?  The rest of the Earth\nKillah Priest says, “The last shall be first”\nSoul-dead brothers’ points of view:\n“Things Fall Apart”—check your roots\nFrom niggas to gods I am\nA [?]—the spirit of a man\nThe Last Poets have to build\nLike great Scott-Heron with Gils\nUhuru, People Army for days\nYour brother’s in the mist, bumrushing the stage\nTest the Rayz—C-Walz for days\nBehold the pale horse—grab the reigns\n[?] papers make me look like Christ\n[?] truth of life\n\n[Bridge 1: C-Rayz Walz]\nVainglorious with the mic in the headlock and your neck on pop\nThis is that raw, certified yin and yang, Sun Cycle hip hop\nBaller, player with the [?] missing, hitting the point like a obelisk in your third eye vision\nThis is protected by the Red, the Black, and the Green with the [?]\nSissy\n\n[Verse 3: C-Rayz Walz]\nI spin in space with mysterious swiftness\nMake you clap ‘til your hands and wrists spit\nJump around, huff the paint, jump around, [?] [cords?]\nJump aroun, [?] head, jump around, spring foot\nHot in the kitchen—things cook and play hooky\nYou in the pot with peppers and yams\nGetting gooey like chaos and jams\nPlaying banjos, pianos, and drums\nI’mma get on my roaches and all my sons\nYou crumb.  Bang the truck with the click-clack\nClicky, clickable clack, back smack\nCats is wack, writing they rap, [?] on they track\nThen they act as Casper\nCrash the new truck in the rainstorm\nChange form, change mine, change time, change crime\nChange line, change soul.  Getting hot and old\nRhyme doubling, bubbling when I write shit\nHopping hip, hip to hop\nBruise your clique, bathe to techno, bathe to funk\nMetro spectro gripping the mic\nRhyme-sniping the sound\nI’m C-Rayz Walz—big shot on the east coast\nI’m C-Rayz Walz—big shot on the east coast\nI’m C-Rayz Walz—big shot on the east coast\nI’m C-Rayz Walz—big shot on the east coast\n\n[Verse 4: C-Rayz Walz]\nLast week, I was on a four train, so these two kids [?]\nSound check and beats in my Walkman\nAlmost walked past and I stopped in my tracks\nThey looked like they could rap—they was twins, in fact\nI’m reality, so I recognize real\nThen I pulled out my pen to give my math to these cats\nMy BK fam is [?] and Sunz of Manly\nYes, I’m the God, y’all, and I’m seen and heard mostly\nTaking Devil’s head for a trophy\nNow I could yell, “Stronghold and O.B.S.”\nMy name’s C-Rayz—I was born to blaze\nI came to drop [Cs?] that was too heavy to hold\n[Or in school?], I learned [different?] from the spirit of soul\nIn my view, just remind your crew\nI’m in the house like Jerome\nI knew Prodigy since the age of fourteen\nI could call H-A-V-O-C and get a beat\nConnect with the Mobb or get your whole clique shot\nMoe Greene got the [?]\nI’m from the Bronx, y’all—it’s a wild west war\n\n[Verse 5: C-Rayz Walz]\nWhen I [grim?] grip the mic, everyone see the God\nGet busy on the path ‘cause the math be potent\nScoping, seeing everything so clear\nI return peace with “Degrees” right here\nIn my hood, it gets foul—the knives go “Blao!”\nFrom the BX down to the Mecca\nI stay tight and hold my head light—the protector\nYo, a sick village—zombies walk around\nWith they head in a knot [?] as the masters\nPutting gas in tanks or buying from pastors\nComing from the subway, spitting on steps\nWorking all day with no time to rest\nPlayers don’t like me.  Players won’t fight me\n‘Cause I’ll violate your whole damn crew like Chris Lighty\n\n[Bridge 2: C-Rayz Walz]\n‘Bout to take a Stronghold.  [?].  [?].  Hot shit.  Check it out\n\n[Verse 6: C-Rayz Walz]\nCome into the screen, but they say, “No cinema”\nAll you cats is full of shit—you’ll need a enema\nTryna keep low on the low like senators\n85 was [?], but they ain’t no friend of us\nAyyo, Stronghold clique is slick, will injure ya\nMake the spot hot like Glocks in winter fuzz\nMy queen spit math—devils wanna censor her\nThe good look good, but I ain’t even enter her\nOh shit!  C-Rayz Walz writing [?]\nYou ain’t gotta ask—you’ll be right in my wrath\nFighting the wack, combat [coupons for free snacks?]\nReact like hammers just tapped the kneecap\nOn some new shit like [Nas in projects?]\nSo much material—I don’t know what to drop next\nNasty like [hot bets?] and [then the?] sex\n[?] like royalty checks\n\n[Bridge 3: C-Rayz Walz]\n[?].  All People’s Army crew.  Uhuru\nMe say, “Stronghold, you ruling hip hop”\nMe dead prez say, “You ruling hip hop”\n[?] saying, “Ya running hip hop”\nWith yin and yang, I now—we run it nonstop\n\n[Verse 7: C-Rayz Walz]\nFrom the [dub?] to the [master mix?], question marks to asterisk\nEspañol to Arabic—all the cultures ask for it\nMathematics splashing kids—introducing nourishment\nMe and Plain Pat stack facts for you savages\nCapture this: propagating truth of your inhabitance\nSharper than the dagger, spit [?] at your arrogance\nReflect it when I send out [?] my route through synthesis\nEarth is where I represent from [?] to the [?]\nSay so never hesitant.  Where’s Stronghold?  (Yo!)\nKnow what?  ‘Bout to put it down until you throw up\nLight the fuse and blow up.  Wack MCs, don’t show up\n‘Cause even if you’d kick your illest rhymes, I’d still say, “So what?”\n\n[Bridge 4: Frogg (from Eminem's \"Just Don’t Give a Fuck\")]\nWoah, uh, get your hands in the air and get to clappin' 'em.  And like, back and forth, because, uh, this is what you thought it wasn't.  It be's the brothers representin' the Dirty Dozen.  I be the F-R-O-the-double-G.  And check out my man—he goes by the name of um, er\n\n[Verse 8: C-Rayz Walz]\nI’m in Haiti.  Buffed out like Lee Haney\nI been crazy—psychologists gotta pay me\nLabeled “loco,” smoking Chanel Coco\nFuck a written rhyme—I’ll freestyle acapoco\nYou must’ve drunk [?] and ate flames\nIn attempt to blaze yourself ‘cause in my range, you’ll get slain\nBeats bang—the mute button say, “Word up”\nI’ll kill you and get you framed for your own murder\nI do what I want—don’t give a fuck about no props, bitch\nTaking a piss after I stick my dick in your pocket\nI have manners—it’s just that I’m shameless\nAyyo, fuck a shoutout—you know what my name is\n\n[Hook 2: C-Rayz Walz] (x2)\nHi!  My name is.  What?  My name is.  Who?  My name is “chka-chka”: C-Ray-Z\nHi!  My name is.  Huh?  My name is.  What?  My name is “chka-chka”: C-Ray-Z\n\n[Bridge 5: C-Rayz Walz]\nExcuse me!  Can I be allowed to make you laugh?  For one second?\n\n[Verse 9: C-Rayz Walz]\nI light spliffs without using a lighter (No, don’t)\nSo you wanna fight a tiger?  And battle Stronghold to Hydra? (No, no, no!)\nI’m fucking wack, but don’t believe me—I’m a liar\n‘Bout to rock the cypher like pebbles in a tire (What?)\nMy brain’s numb from staying outside like [slain?] tongue (Word)\nI keep cutting your veins ‘til I find the main one (Ow!)\nAnd Plain Pat said, “C-Rayz, you got talent”\nI know—I’m getting revenge for my dead parent\nI want the finer things in life like your house and your wife (Gimme)\nPlus some straps.  Slice my sandwich with the OJ knife\nI had a vampire bitch I gashed to cum in sunlight\nThe only cat ill enough to bring pencils to a gunfight\nGetting leg, getting head while midgets in the Pentagon\nUnder the sprinkler system, juggling smoke bombs\nSpit love out, punish my gats ‘til I let a slug route\nBeware—you been illing with the best that bug out\n\n[Verse 10: C-Rayz Walz]\nThink I should rhyme about ice.  Can’t tell?\nI want the hot shit minus the smell\nThe reason I rap is ‘cause the anger’s inside of me\nI used to curse my moms out in her diary\nI’m belligerent—well here’s where the difference is:\nYou passive and only act tough through penmanship\nThis kid’s militant—the [?] comes with killer shit\nAnd I don’t start jobs I won’t finish, bitch\n“Fuck the cops”—you heard what stic.man said\nI threw a Molotov cocktail in the [precinct in flames?] (Word)\nShot in the head—yeah, some of my peeps got caught (Too much)\nToo much heat in the street?  So a Glock got bought\nAnd your gun shots ricochet when I spray\nI heard one hit some wack MC on stage\nRepping much more than the NYC\nShit, we in the Sun Cycle—the Rayz is C\nBesides, you cats act so funny\nAnd I don’t sweat no hottie (No hottie)\nYour gun? (No gun).  I might torture some\nAnd I’ll probably eat the pencil just to spite my tongue\n\n[Bridge 6: C-Rayz Walz]\nSun Cycle MC\n(All aboard!)\nI’ll bark at y’all now, eat y’all niggas later\nY’all ain’t really players—where the fuck’s y’all gators?\n\n[Verse 11: C-Rayz Walz]\nIf I see where my [?] with your eyes by the clip\nWith your eyebrows looking slick, so you know you getting bit\nGot a crumb.  I wanna taste the whole plate\nGot live in the state—this took time to create\nWhat you see is what you never gonna get—my skill\nSo if I never get a deal, I’mma still be real\nIf I ever grab the microphone and I sound wack\nJust believe I’m smoking dust, sniffing coke and crack\nBut I’mma hit you with your [birth?] so you don’t forget\nIf you ever play yourself, I’mma punch your shit\nThen they gave me paper and they gave me cash\nPlain Pat’s got my back when I needed to ask\nEverybody knows that I’m nice to a beat\nBut when I’m hungry, who the fuck wanna help me eat?"}]}