{"songs": [{"year": "1998-01-01", "image": "https://images.genius.com/cc562c0aa5b047df2132b1557d8efb9a.464x464x1.jpg", "title": "Relax", "album": null, "lyrics": "[Hook x2]\nSit back, y'all and just relax, y'all\nSit back, y'all and just relax, y'all\nSit back, y'all and just relax, y'all\nSit back, y'all and just relax\n\n[Verse 1: Black Thought]\nOoooh child, your nose just got blows down the rows\nAnd soul plants with baggy pants, growin' Afros to catch\nSaxophone like scats and tones to relax\nStacks of poems slip, drip from ya dome\nYa slide on ya ride from the Shack to the cardiac\nChords of jazz and sho 'nuff, the sound's bad\nSo, slap five, Mr. Nappy Cat got the groove to move ya back\nHerb like verb, the sack's fuller\nI trickles on the nickel and dime vibe beyond sidewalk\nAnd sound stage around, I put ya down with the sugar\nIt's sweet, so lick ya lips as ya taste ???\nThey got the hip, cats trippin'\nDaddy-O, when I was lad, I ??? at you\nExcuse me as I catch the boogie like the flu\nGod bless Jamaaladeen and the rest playin' the axes\nJust the fatness, dig? Now, sit back\n\n[Hook x2]\n\n[Verse 2: Black Thought]\nStrings and things that we brings is the swings and wings\nTo get you flyer, higher than those Kaya L's\nThe izm, ??? baptism, just sit back, listen, check it\nYou're coolin' with the cat that got the method\nOr should I say the man with the plan that can\nRock 'em all, 'nuff respect to Jamar, that's my man\nLord, I had a rough day, so crank that beat up to the max\nThen I can relax and kick my feet up\nMaybe it's cold, baby, if so, I'll turn the heat up\nAnd listen to this and pull the blanket and the sheet up\nWe're ridin' over grooves on the abstract train\nAnd glidin' over measures, givin' pleasure to the brain\nDrops of jazz fallin' from the sky like the rain\nSlow and then it's flowin' and it's goin' down a drain\nPerhaps, I catch ya taste for bass and perfect\nYou plays the sax while invitin' you all to sit back\n\n[Hook x2]\n\n[Verse 3: Black Thought]\nOoooh child, your nose just got blows down the rows\nAnd soul plants with baggy pants, growin' Afros to catch\nSaxophone like scats and tones to relax\nStacks of poems slip, drip from ya dome\nYa slide on ya ride from the Shack to the cardiac\nChords of jazz and sho 'nuff, the sound's bad\nSo, slap five, Mr. Nappy Cat got the groove to move ya back\nHerb like verb, the sack's fuller\nI trickles on the nickel and dime vibe beyond sidewalk\nAnd sound stage around, I put ya down with the sugar\nIt's sweet, so lick ya lips as ya taste ???\nThey got the hip, cats trippin'\nDaddy-O, when I was lad, I ??? at you\nExcuse me as I catch the boogie like the flu\nGod bless Jamaaladeen and the rest playin' the axes\nThat's the fatness, dig? Now, sit back\n\n[Hook x2]"}], "artist": "Black Thought"}