{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/ce70d8117c83ff4322bbd7d5d9b122da.468x468x1.jpg", "title": "Got It On Me", "year": null, "album": null, "lyrics": "[Intro: Kirko Bangz]\nSee me ridin', my nigga?\nMy shit shinin', my nigga?\nFuck nigga keep lookin'\n\n[Verse 1: Kirko Bangz]\nYou see how I'm ridin' right? See me ridin' round nigga\nThem diamonds shinin' right? See me shinin', my nigga\nFuck nigga keep lookin', lookin' for a nigga\nSee his bitch keep lookin', ain't my fault his bitch keep lookin', my nigga\nStanding in the club, on the couch, what up, my nigga?\nDare nigga try to kick me out, can't touch my nigga\nYou won't see no lame ass nigga with me\nWon't see it, cause every nigga with me gotta carry that heat\nBelieve it, I done came down in the foreign\nGot a bitch nigga mad cause I just made a milli off tourin'\nAnd I'm still in the hood flexin' like an OG\nIf a nigga get out of place come and holla at me, aww yeah\n\n[Hook: Kirko Bangz]\nI got it on me, I got it on me, got it on me, I got it on me\nI got it on me, I got it on me, got it on me, I got it on me\nI got it on me, I got it on me, got it on me\nI got it on me, I got it on me, got it on me, I got it on me\nI got bitches on the pole, my swisher full of dro\nGiuseppes on my toes, your bitch ready to go\nCause I got it on me, I got on me, got it on me\nI got it on me, I got it on me, on me\n\n[Verse 2: Takeoff]\nI got it on me, I keep it on me\nMy nina it leave you without aquifina\nPull up in the Beemer she get my demeanor\nLook like I just jumped out the cleaners\nI gotta keep the pocket rocket on me\nLike Martin, he gotta keep Gina\nKatrina somebody, come FEMA\nI'm beating that drum like Ike and Tina\nYoung nigga I play with them keys\nI'm Stevie Wonder, no Alicia\nThat iPhone I got for that billy phone\nChop phone, that Motorola and the beeper\n\n[Verse 3: Offset]\nI got it on me, got it under the seat\nAim at your head, ain't aiming at ya feet\nGoons on a real nigga, that's a sneak peak\nShe fuckin' with me on a loft on a beach\nI know that you mad, young nigga got cash\nShe suckin' me off while I'm rollin' the cash\nYou talkin' that shit so a young nigga laugh\nI skert in the 'Rari, 220 on the dash\nJ's they knock at the door like Jehovah\nPull out the chopper it bite like a cobra\nAce of Spades bottles like I'm playin' poker\nSmashin' your girlfriend in the back of the Cobra\n\n[Hook]\n\n[Verse 4: Quavo]\nTrap out the bando, it's Migo head honcho\nShe all on the pole when a nigga throw pesos\nShe want a bankroll on Quavo\nGotta twerk for Kirko, trap for the Migos\nThat's the plug pull up with a kilo, got a white boy like Steve-O\nTryna come rob, I got that thing bet I shoot you like a free throw\nBig house on the hill baby, every room got a pole in it\nSo when I take it to the crib baby, every room I'mma throw Benji's\nBig house on the hill baby, every room got a pole in it\nSo when I take it to the crib baby, every room I'mma throw Benji's\n\n[Hook]"}]}