{"artist": "C-Rayz Walz", "songs": [{"title": "Original Copies", "album": "The Prelude", "year": "1999-12-31", "image": "https://images.genius.com/ec963359d22a35a29c442701ff7a7d34.500x500x1.jpg", "lyrics": "[Verse 1]\nHere I come.  You know where I'm from\nDo the math, son.  I originate with the drums\nNative tongues lounging, my third eye's beyond browsing\nSwam nine thousand, woke up on the shores of project housing\nGenesis, wide wingspan like Pegasus\nMy mic gym effortless for turntable terrorists\n'88 hip hop, certified for net murder\nSnatch you out the chat room, smack your server\nBug Out poster child, approach the wild calmly\nLet 'em think I'm Ghandi.  Then transform to Genghis Khan, see?\nBaby, I bop, so you love me like Barney\nKiss my honeymoon, then spaz out like Mark Carney\nEnergy solar, battle moe, froze polar\nBalance the scale to be some shit—Green told y'all\nBig mics fo y'all.  My crew Stronghold, y'all\nOne, two, three, four, five—that's the roll call\nRoll call, roll call.....\n\n[Verse 2]\nI make 'em study thirty-five to fifty years\nStrained brains become bloody, eyes swiftly tear\nRisky peers become queer.  You can't diss me\nI know who I be like Bizzy\nChief rocking, keep watching.  Soon, you'll turn to stone\nI got Medusa's head in an Iceberg bag at home\nMama said, \"Life's like a bag of chocolates\" (Why?)\nIt'll make you sick if you don't watch it...\n\n[Verse 3]\nYou're style's toy.  My homeboy is God Rally\nSmack wack emcees like they stepped on my Ballies\nThe roof's on fire?  Let it burn—hot shit\nFrom the foundation, I learned y'all can't rock shit\nThat's why I get busy on topics.  You propless\nI get J-U-Ice when I drop it\nYou ain't def—step.  You pet breathe Karma\nYour upside down peace sign's the V-Bomber...\n\n[Verse 4]\nOn battle stage, I shapeshift my mouth to grenades\nMy hands razor blades, invisible ink\nYou another page I'm splashing\nExcept when I'm gone, you remember the pain of what happened\nSuper rapping, like collabos with Batman and Mack 10\nSkull cracking, back smacking, for track acting\nMade through traffic.  Grey matter in gridlock\nI'm a Nutty Professor.  You a nigga with shitlocks\nHip hop.  Ain't been to sleep in three days\nDreams of spray cans, B-girls and DJs\nGold chain, cocaine before a crack rock\nColeco before laptop, flicks in front the backdrop...\n\n[Verse 5]\nWe off the muscle—keep the meat rack, speak fact\nAnything less than truth—you keep that\nWeak cats, pull your seat back and kick your feet up\nListen to the beat, black—now watch me heat up (Watch this)\nMe and Plain Pat contact on the same track\nModern day slaves yelling, \"Give me my brain back!\"\nRaps contain facts like maps of pyramids\nBut I'll cut your ears off cause you ain't hearing it...\n\n[Verse 6]\nVivid how I paint this—Rayz and Green dealing\nHigh degrees of patience—stay chasing\nJustice the Janitor, life is high maintenance\nFoul flagrant, winner of the ancients.  Smell the fragrance?\nTitanium wristband, backstroke in quicksand\nIron fist, velvet glove slid on my brick hand\nMy Nike Swish land right over my Nick Vans\nExcel, laid back in Hell with a kickstand\nStudy they movement, like blind ninjas, infrasensor\nNiggas got on sandals in the middle of the winter\nStuck on six like chick bitch swallyour dick tip\nFlip sick scripts, can't even hold your shit liquid\nFresh enough to make a dope fiend close the vein\nTear my shirt off just to expose my chain\nYou know my name—knowledge, actions now\nI wanna cry, but I'm so happy I can't frown\nLike I wanna throw God on the ground\nPick him back up and start laughin'\nRun through Times Square flashin'\nBlasting just to see cypher's reaction\nThen disappear like flesh after years in the casket\n\n[Bridge]\nA-ha-ha... C-Rayz Walz!!!!  In the house.  Recognize my crew: Stronghold...\n\n[Verse 7]\nY'all niggas send me gloss in the Porsche and get robbed\nMy style fucks your head up like elevators blowjobs\nGo to jail, while I'm in the streets eatin'\nHotel suites beatin', rhyme releasin'\nYour style like Rome—I ancient, ruin it\nYou talk about gats on tracks—who doing that?\nSquirtin'.  Don't be the next missing person\nFirst in.  Howling like Thirstin while you rehearsing\nMaury Povich covering the fear rap aerobics\nYour sneakers wrinkle.  My eyes twinkle on some glow shit\nBlow with angels, conversate with culprits, blaze form\nAnalyze stars like Lloyd Strayhorn\nFloss and get your papers lost like beef with the prison boss\nOn a crash collision course in a drunk-driven Porsche\nPicture me in a box bleeding, corrupt reasons\nCrush emcees like \"fuck truck season\"\nWhat you believe in?  Thank God if you still breathin'\nCause I roll like tank season\nWhat y'all tryna, we already did it\nYour weekly sum equals new kicks and fitteds\nSpit blizzard for my brethren in prison\nThat chick you STDded?  Get your ass in the clinic\nI vision myself taking no shorts like blind midgets\nSpeak physics, conjugate a picnic\nThe gifted.  Politic on rhyme money shipment\nRoyalties, cop more war equipment\nRoll with the ghetto fitness, knuckle swiftness, relentless\nQuickness, blink and you missed it\nC-Rayz Walz in your district\nStronghold!  Fuck emcees with no mic control!"}]}