{"songs": [{"title": "Oh Yeah (Work)", "album": "Bred 2 Die Born 2 Live", "year": null, "image": "https://images.genius.com/0ec27b6023fdef052011e493255845b9.900x900x1.jpg", "lyrics": "[Lil' Scrappy]\nI hear everyone of you\nWe do it like the army do\nI can go vertical\nLet's go, hey, hold up (hold up)\nNo!!! Blow!!! Oh!!!\nC'mon, crank it, c'mon! Eh! Oh!\n\n[Hook]\nGot Cartier frames coverin' up my eyes\n26 inches inbetween my tires\nKnot in my pocket better believe three grand\nDiamonds on my neck and a pistol in my hand\nI'm a get money nigga I grind like hell\nWhen I show em the G's I'm a crank up the scale\nOh yeah (Oh yeah) I'mma crank up the scale\nOh yeah (Oh yeah) I'mma crank up the scale\n\n[Lil' Scrappy]\nI ain't never goin broke no mo'\nAs long as my folk keep runners of that blow\nThey sell it on out then thay bring they back mo'\nAnd ere'body askin what I got that work fo' (got what?!)\nGot diamonds in my shades the Cardier frames\nThey look up at my face and tell its woodgrain\nAnd the Ho's be amazed they be like OH!\nThey can see it from the bar see the way it glows\nYeah! them things twinkle in the light bright\nI don't know I just twinkle in the lime light\nGot a chevy same color as a can of sprite\nSippin on on that X O got me feelin right\nI been livin my whole life pimpin\nNever catch me slippin fuckin wit ya'll women\nScrapp be chillin I stay on my grind\nIt's a hard life we livin I stay wit my nine\n\n[Hook]\n\n[Sean Paul]\nAin't gotta hit these streets no mo'\nCrisp 15 ten 24 show\nNotice I ain't never Fo' times e'ery week\n20 time fo' every week get G's\nParty game shades with the gator cut wood\nPrada footwear damn yall nigga do it\nPimpin in Atlanta now they callin me in Europe\nEveryday I hustle diamonds up against the wood\nDope boy fresh dressed in red monkey clothes\nGotta stay fresh for you red moneky Ho's\n26 inches sittin tall like WHOA\nI'm a need a camera man I'm a god Damn show\nShower cap and all bitch you already know\nFuck around with dopers squeeze the money out a Ho\nI'm a get money nigga yeah I grind like hell\nRubberband around my money like a God damn playa\n\n[Hook]\n\n[E-40]\n(slugged out grill) they say hustle that dat boy\n(worth a few mill) he sittin at the bar\n(tearin up hundred dollar bills) thats his car parked by the front Do\n(on them big wheels) he ain't never been a punk\nBugga suga plusha FUCK a state trooper\nI'm livin for the moment I ain't livin for the future\nMy dudes will bring it to ya bring the noise like a Tuba\nCrack ya peanut shell run up on ya with the Ruger\nSmoke herb like a hippie drink like a pirate\nWrist real crisp haters dont like it\nJack of all trades, gotta get my chips\nManipulate ya broad put ya chick on Craigslist\nTraffic om in and out yall work when its a drought\nDont take the main street take the under route\nSucka use yo head you heard what I said\nI'm gettin carpal tunnel while I'm countin all this bread\n\n[Hook]"}], "artist": "Lil Scrappy"}