{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/1112cd3704f3fa8b22086a4eb491fc7c.500x500x1.jpg", "title": "M.O.N.E.Y.", "year": null, "album": "Procrastination Killz 2: Clutch City", "lyrics": "[Intro]\n\n[Bridge: Kirko Bangz]\n\nJust That Fly ... M.O.N.E.Y. like-- (ayyyyeeeaaaeeyyyyeeee)\n\nGrippin' that wood ... Show you its all good like-- (ayyyyeeeaaaeeyyyyeeee)\n\n[Verse 1: Kirko Bangz]\n\nIn the seven four five and the six four, im still motivated to get more\n\nKirk got alot of gas go petrol, while your girl go downtown thats metro\n\nBitch get low, she get high, get high in the whip gotta stay fly\n\nWith a bitch fuck a nigga cause a nigga ain't shit anyway but a bitch in a disguise\n\nUhh, and im back my nigga, Pk2 that crack my nigga,\n\nPut me on a track ill murder for a fact non-fictional killer, mixed with the iller\n\nSize of the world I reside in the world where the real aren't real and the guys are girls\n\nIm alive in the world when I die in the world just call me all of the rhymes in the world\n\nYeah, take that, bring that, (here) make that maybach (wheel) taste that gray black (vrooom) Im fly like that\n\nWhen you have money you can fly like that, first class nigga where the pilot at\n\nI be in the sky looking down on the world and I don't even much get high like that\n\nFly like that, put me in the back of a 'Lac with a bad Lil' bitch and a blunt\n\nHome run kirko, pitch that bitch my way, I bet ill never bunt, tiger woods, hole in one\n\nKick that shit, flows I punt, do my thang im Kirko Bangz, suicidal where's my gun?\n\n[Hook: Kirko Bangz]\n\nIts a bird its a plane no baby its me im just that fly\n\nAll day we chasing that paper getting that M.O.N.E.Y. like-- (ayyyyeeeaaaeeyyyyeeee)\n\nWith the seven four five and the six four nigga im gripping that wood\n\nChucking them deuces up out my window just to show you its all good like-- (ayyyyeeeaaaeeyyyyeeee)\n\n[Verse 2: Kirko Bangz]\n\nIts a bird its a plane no baby its me im just that fly\n\nAll day we chasing that paper getting that M.O.N.E.Y. like hey!\n\nIn the seven four five or the six four grip that wood like every day\n\nIma rep that shit, ima whoop that bitch like Im on MLK\n\nYou can't see me nigga, you know how many women want to do me nigga?\n\nYou know how many niggas that be shaking my hand, hating on me cause they really want to be me nigga?\n\nA PV nigga, 20 years old in the year, probably be on tv my nigga\n\nMTV on me my nigga, BET thats me my nigga\n\nYeah, Uhh, bet that shit, she don't like me I forget that chick\n\nShe can watch me ball like a referee, I ain't an athlete, I can't sweat that shit\n\nAnd actually I ain't an athlete, but I be running on the beat like a track meet\n\nDon't ask me, just pass me, im dope out the window ash me\n\nOn the real though, niggas tryna play hard but them niggas ain't shit but a motherfucking dildo\n\nIm the nigga Lil' Bangz bout to put in lil' change, on my momma lil pocket and her bill fold\n\nLet the bills go, I ain't tryna be a king, I ain't no Lebron James, im Melo\n\nLay back in the back of the whip while shawty get low on a nigga like L.O\n\n[Hook]\n\n[Bridge]\n\n[End]"}]}