{"artist": "E-40", "songs": [{"title": "Chitty Bang (Remix)", "image": "https://s3.amazonaws.com/rapgenius/429360_10150592533032050_1732757056_n.jpg", "album": null, "year": null, "lyrics": "[Hook: Ty Dolla $ign]\nYa baby momma love me, ya baby daddy hate me\nYa bitch wanna fuck me, I said ya bitch wanna fuck\nAnd we gon' get it like\nChitty, chitty, bang, bang (x4), whoa-oh!\n\n[Verse 1: E-40]\nI made a detour out of the game when I was hustlin' crack\nMade a couple of dollars, made a little bit of change, never looked back\nYou could find me at the shooter range, practicing bussin' gats\nOr in the vocal booth, in this new studio, bussin' raps\nWith some gold on my body, out my body, off Carlos Rossi\nI'm sloppy, I treat my luxury scraper like a Bugatti\nLa di da di, she like to party off molly, Bacardi\nLove to get naughty, a hottie, up in the lobby, she stopped me\nShe said \"40 Water, where you 'bout to be?\"\nI said \"Follow me, follow me, follow me, bitch, room 223\"\nYou got to pay me or pay me no attention, that's how it be\nWhen you born and raised in the V, Northern Cali, Silicon Valley\n\n[Hook]\n\n[Verse 2: Juicy J]\nPaid nigga, yeah, I make it happen, turnin' up, ratchet\nThick chick under my arm make your chick look average\nThick bitch, yeah, a big ol' ass, poke it like a cactus\nAnd she got a face that belongs up in a beauty pageant\nIt's ya boy, Juicy J, trippy, I got realer pimps\nBalling hard everyday, ratchet bitches can't resist\nI stay laughing to the bank but my dough ain't funny\nI run out of rap before I run out of money\nWhen I pop a pill, that's foreplay\nNow I'm all in her face like Olay\nI'm like \"okay\", I kill the pussy like OJ\nWhen I'm finished with ya woman, she gon' think we soulmates\n\n[Hook]\n\n[Verse 3: Ty Dolla $ign & (E-40)]\nYou wanna be around the winners? (A winner)\nSay you only had a few niggas? (A few of 'em)\nGirl, I'm just being honest (honest)\nI know what you want and he's not it (not it)\nI'm off the shits and I'm wit' it (wit' it, mane)\nThey can't stop us, we gon' get it (get it, mane)\nI'm just being honest (honest)\nI know what she want and he's not it\nThat's why--\n\n[Hook]"}]}