{"songs": [{"year": "2015-04-21", "album": "Tomorrow We Live", "image": "https://images.genius.com/de7b88d76ef2d5fedc0db2402012e465.1000x1000x1.jpg", "title": "Calling You", "lyrics": "[Verse 1: KB]\nIt must have been 3AM when the text came in\nThe sum of my fears\nMy stomach bendin', my thumb was tremblin'\nNo pun intended, but I wanted to die\nWhen I saw it was him\nThen it read, \"KB, this time it's real, homie I can't live\"\nIt was in all caps\nBut I knew he had no caps on his gun or his pills\nSo I ripped out the door\nAll the covers down on the floor\nNo shoes, I just walk on my tears\nCallin' him over and over and over again\nWhile I'm throwing the car in to gear\nHow could he be so selfish?\nWill this effort fail too?\nWhy won't he answer, answer, answer, he answered!\n\"Jason, hello?\"\n\n[Hook: Natalie Lauren]\nSuicide, suicide, suicide\nGot one in the chamber\nIt's waitin' to take you right out tonight\nDon't roll the dice, roll the dice, roll the dice\nIt's all on the table, it's all for the takin'\nBut what's the odds?\n\n[Verse 2: KB]\nI parked in the street\nAt the car with the keys\nShould I call the police?\nWhat if he turns it on me?\nThen I looked up, is that him over the sink?\nI can't think\nMy tongue is as heavy as my heart, I can't speak\nEvery time I blink I'm a step closer\nMy heart about to burst\nAs I close up on the front door and give the doorbell a ring\nIt was unlocked so I ran to the top staircase\nAs I stare at a case on the floor\n\"Jason, open up\"\nContinued to knock\n\"Jason, open up, you ain't gotta do this\"\nWhat about the kids?\nDon't go Judas, you got reason to live\nWe could get through this, don't give in\"\nThen I heard movement and a voice I'll never forget\nHe said, \"Stop it, stop it!\nI'm about to cock it!\nYou barely called back when I was in Iraq\nJust leave homeboy, I got this\nYou know the truth is I had to shoot kids\nI'm so guilty (Open the door!)\nAnd God might let it go (Open the door!)\nBut I'll never forgive me (Jason!)\nWhy not? (I care, I care about you)\nThe Army never trained me to care\nYou don't know the horror of living in a war zone\nThen coming back to civilian affairs\nI made my bed, the tables were set\nMy wife moved out, I don't see my kids\nEverything that gave me meaning is gone\nThe grief’s deep-seeded and bleeds to the bone\nI want out!\n\n[Hook]\nSuicide, suicide, suicide\nGot one in the chamber\nIt's waitin' to take you right out tonight\nDon't roll the dice, roll the dice, roll the dice\nIt's all on the table, it's all for the takin'\nBut what's the odds?\n\n[Verse 3]\nI ain't have a word, not a story not a verse\nBut the silence...I'm trying not to make this worse\nI pray and I googled a search\nNothing from school that will work\nBut I grew up in the church, so what do I do?\nJust fell to my knees and I started to blurt\nI don't understand this, I don't understand this\nBut you been looking to the weed and them dancers\nDon't be conned by the Ye\nNobody in the West got the answers\nLet's get established, your life isn't yours to demand it\nYou can't do what you please\nJason, I love you, but the next step is God homie\nYou ain't escaping a thing\nYou know Jesus he wanted to die in that garden\nAcquainted to man in his sorrows\nBut he kept up the fight\nCause he knew joy, it was coming tomorrow\nYou haven't squeezed that revolver\nCause you know that there's hope at the end of the tunnel\nEmbrace it, don't matter how faint it\nGod is not silent, please hear what he's... *gunshot*\n\n[Outro Dialogue]\n*Knocking*\n\"Jason!\"\n*Phone dialing*\n911 Operator: 911 whats your emergency?\nKB: Yes, uh I-I gotta friend, and uh, he's locked himself in the bathroom and I just heard a gun go off and I don't know\n*Sirens in background*\n911 Operator: Okay, calm down sir, are you able to get inside the room?\nKB: Yeah, he, he's got me locked out\n911 Operator: Okay, can you try to get inside the room?\nKB: Hold on, I'ma try to *door kicks open*\n911 Operator: Sir?\nKB: Jason! Okay, he's-he's not shot, he dropped the gun but he's passed out\n911 Operator: Sir, I'm gonna need you to calm down\nKB: No you calm down! Send help quick!\n\n[Words sung in background of the Outro]\nI see you\nI hear you\nHope is calling you\nI see you\nI hear you\nHope is calling you\nHope is calling you\nHope is calling you"}], "artist": "KB"}