{"artist": "Cam’ron", "songs": [{"title": "Bout It Bout It", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Verse 1 - Cam'ron]\nI represent where them killers at\n145th and Broadway. You get your head cracked\nGet your legs snapped, arm-twist, ribs cracked\nWig tapped, \"play fair!\" Day care, kids napped\nYou think you real? Well, my posse is crazier\nYour moms? Mobbing and raping her, Saudi Arabia\nI'm 89 tho, Audi and Avias\nBeef in N O, I had to call No Limit up\nBaby MAC, baby Gat, shit to wake the baby up\nGot my baby boo, cop the X5: that's a baby truck\nSantana rolling big, Jimmy in the Caddy\nDayton, Youngstown, Cleveland, Cincinnati\nIn the double-O I represent the C-O\nPlease ho, Harlem World, 40th: that's me, yo\nClips, 11 off. Bricks, get 7 off\nSnow so white only thing missing is 7 dwarfs\n\n[Hook- Master P]\nKilla Cam: you know he bout it, bout it\nJim Jones: you know he bout it, bout it\nFreeky Z: you know he bout it, bout it\nSantana: that boy bout it, bout it\nHarlem World: you know they bout it, bout it\nDiplomats: you know they rowdy, rowdy\n145th and Broadway, them boys real\nYou know them boys they don't play\n\n[Verse 2 - Cam'ron]\nAiiyo, I'm bouncing through an ounce or two\nMy crib look like the Fountainblue\nA fountain too - no water, only pumping Mountain Dew\nFront on y'all little cats I was bound to do\nI made it where chickenheads can't pronounce my shoes\nI got head, but need more mouth\n119th to the whorehouse soon as the tour's out\nPapi's rotten, my block top was spoppy poppin'\nI pop ack over some oxycontin\nCotton club and Roxy Robins\nRubies and rocks we poppin'\nBooties, Uzis and Glocks'll stop em\nBattery on his head: copper-top him\nWhen I'm in the building, dogg, you've got to watch him\nGot to spot him, tre-8 a floor revolve him\nThe D.A., sargeant and coroner's problem - now\nHighs get 8 done, Dipset don't play none\nJim Jones, Freeky, Killa and the great one - Santana\n\n[Hook]\n\n[Verse 3 - Jim Jones]\nYou know I claim (What you claim?) where them gangstas bang\n15th and Lennox, 9- tre, they do they own thing\nIn Uptown, up on 40 a phat Sean hit the block\nDogg, he move that water shit, he like the network\nOver wet work. you come up short on that paper, get a wet shirt\nThen if you walking through Foster and Taft\nFlossing that cash then gangstas put the torch to your ass\nAnd I can't forget AK and Wagner\nMy dogs straight crazy cause the AK'll blast ya\nOne calling daddy Sheik and Q\nLB's and Sally beat your crew, now come on\nAnd dope stacks, right in front the liquor store\nHennssey, lil me, me you know the flipped the raw\nMuch upset, oh yeah they bout it\n16 shots up out the Glock, I come up out it\n\n[Master P]\nI represent the South, now the world gonna feel us\nWorth $400 mil', still dumping gorillas\nI'm in the project posted up, like Toys 'R Us\nRetire my jersey -- 65 for every chicken I plucked\nPass the purple stuff, whoadie, it's time to get swerk\nUp on the block, 1,000 grams on Hogan and Kirk\nWe in them t-shirts and doo rags\nFemales all fall back when the No Limit boys in the house\nHaters get back. Hot One hold it down\nIn foreign ghettoes. Big Boys, Uptown, Russian _\nC-Murder locked up, but his name still ringin'\nBig Simp getting yoked, ridin', hustlin' and slangin'\nYou know we bout it..I mean we rowdy!\nNew Orleans to the ATL: you know they bout it bout it\nSaint Louis, they keep it swangin'\nL.A. to Las Vegas, them homies out there gangbangin'\nOklahoma to Tennessee, them boys ain't playin'\nCause you know they B-O-U-T\nTexas, Florida; Detroit, Georgia\nThem boys dunn graduated from an 8th\nUp on to water-water\nKansas bout it. Virginia rowdy!\nIllinois boys to Mississippi: bout it bout it\nNew York, Arizona, the Bay Area, the whole California!\nNorth Carolina, South Carolina: throw dem bows\nPennsylvania, Alabama: bout to let em know\nMissouri rowdy. Boston bout it!\nNew Orleans and Rockafella: it's bout it bout it"}]}