{"artist": "Benzino", "songs": [{"lyrics": "[Intro]\nUh\nHangmen 3\nUh\nUh\n\n[Verse 1]\nMan, these little boys ain't built for beef\nStick to rap before you get killed in the streets\nI'm calling you out, bitch, we can knuckle it up\nBet a hundred, fifty grands that I'm fucking you up\nOpen your mouth, Em, I'll let you taste the Glock\nPut it all up in your face like Papa Doc\nBenzino, nigga, know I got shells to spit\nFuck Obie Trice, your wife, and D12 dicks\nI run this, my fans let the Glock explode\nNever met a live nigga across 8 Mile Road\nYou're the sixth Backstreet Boy that learned to rap\nAnd his gun had no bullets, who he trying to clap?\nI really thought he was gay at the Grammy Awards\nElton John singing with his hand holding up yours\nTrying to tell the media that you did it all for profit\nWe hear it on the remix you cleaning out your closet\n\n[Hook 2x]\nYou better lose yourself went I find you\nRemind you what the nine do if I let it blow\nIt only takes one shot, do not let me cock this four\nYour life's opportunity come to a flatline\n\n[Verse 2]\nSecond verse, it gets worse, it gets much realer than this\nEminem still on Benzino's dick\nTalking 'bout I'm dead broke and you must be crazy\nEvery time you up in the Source, your label got to pay me\nMake me come to Detroit and put the gun to Hailie\nHave everybody like \"Benzino going crazy\"\nTop of the game, I'm the one running the race\nGot a Bentley for every little bump in your face\nWe can meet up in the streets, we can box it out\nOr you're bluffing in your records just popping your mouth\nYou used to do songs about smoking crack and dust\nBack when Insane Clown Posse smacked you up\nYou a drag queen? Why you keep your hair that color?\nKnow your mom wished she swallowed you and put on that rubber\nI'm here to bank, suck a dick, play your position\nFuck apologies, hollow tips is all that I'm giving\n\n[Hook]\nYou better lose yourself went I find you\nRemind you what the nine do if I let it blow\nIt only takes one shot, do not let me cock this four\nYour life's opportunity come to a flatline\n\n[Verse 3]\nLet's get in depth for a second 'bout the life you live\nEvery other record crying 'bout your wife and kids\nBetter lose yourself for a couple moments or more\nYou don't want drama or a bullet hole in your jaw\nLet's take it back for a minute to the Grammy Awards\nBackstage, Elton John had his hands in your drawers\nI don't care how many nails you put in my coffin\nAsk your baby moms why she take flights to Boston\nEverybody like \"why you fucking with Em?\"\nHe made three diss records, man I'm under his skin\nYou better stick to dissing cats like Fred Durst and Britney\nI'm a Made Man, it's kind of hard to hit me\nDon't think the guns won't blow cause you signed 50\nGot a whole bunch of New York niggas that's with me\nKeep telling me I ain't supposed to rap\nI thought this white boy was supposed to be the best at rap\n\n[Hook]\nYou better lose yourself went I find you\nRemind you what the nine do if I let it blow\nIt only takes one shot, do not let me cock this four\nYour life's opportunity come to a flatline\n\n[Benzino talking during hook]\nCome on man\nYou really don't want it man\nI don't know who's blowing your fucking head up\nBut you really don't want it\nYou think that motherfucker in the 8th grade always beat you senseless\nI'll fuck you up for real\nAnd anybody you want to motherfucking bring for the ride will get that too\nYou ain't shit in the streets man\nYou a fucking pussy\nI don't care how many times you frowned in the fucking picture\nI'll fuck you up for real\nYou bitch ass motherfucker\n\nFuck you talking about\nMean streets of Boston?\nMotherfuckers will kill you nigga\nYou're afraid to bleed nigga\nAlright?\nFucking Obie ass, fucker ass nigga\nBitch ass nigga\nBoston niggas will fucking rape you, you fucking ho", "image": "https://images.genius.com/d7c4193d7fa3e827037b69319934af40.300x300x1.jpg", "year": null, "title": "Better Lose Yourself (Eminem Diss)", "album": "Die Another Day: Flawless Victory"}]}