{"artist": "Paul Wall", "songs": [{"album": "Chick Magnet", "title": "Did I Change", "image": "https://images.genius.com/e98e06072810728fecab41c13e54a10b.500x500x1.jpg", "lyrics": "(Intro)\nThere's one thing I've learned in life man\nAs you get older, thangs change\nYou know what I'm sayin?\nPeople change, friends change\nThat's just how it go, mayn\n\n(Hook)\nI don't know if it's just me\nDid I change? Did they change?\nIt's messed up\nIt'll never be the same\nLet me tell ya mayn\nIt's nothin like losin ya bro\nToday, love you\nTomorrow you don't know 'em know more\n\n(Verse 1, Paul Wall)\nI got a lotta fish to fry\nBut one thing I learned is you can't teach a fish to fly\nKiss goodbye, cause on my team it's every man for theyself\nI'm just tryin'a do my best and play the cards that I'm dealt\nI reached out my hand for help, but I was reachin in vain\nSo I tightened up by belt and paid the price for this fame\nAll playas pay dues, you ain't gon' hear me complain\nI started out with lots of friends, but only a few remain\nThey say I changed, but really I just matured and got smarter\nSeems like the realer I get, the more these boys get frauder\nWhen I'm around my own partnas, I sense envy and anger\nReal recognize real, and all you boys is strangers\n\n(Hook x2)\n\n(Verse 2, Pretty Todd, Unique & Scooby)\nFrom now was brothers\nI remember the shit like yesterday\nIn front of the high's gettin high\nLookin for the next day\n\nYeah I remember that\nSame clothes, no bucks\nNo hoes, all we had was just us\n\nDamn... man, I used to like that shit\nAnd then we got a deal, and they ain't like that shit\nI told myself that I'ma fight that shit\nNo matter how long they hate, I won't quit\n\nDamn, but that's crazy though\nI don't know if it's me\nBut we was like brothers, just different mothers\nAnd they switched up\nShould I love 'em or hate 'em?\nI ain't changed, just changed situations\nAnd that's why I only got a few partnas\nCause niggas don't know how to act and I lose partnas\n\nAnd time change everythang\nAnd back then, it was us against them\nAnd the shit shoulda never changed\n\n(Hook x2)\n\n(Verse 3, Paul Wall)\nDead God, I need your Blessing, so I'm asking for help\nTo handle all these situations that come with this wealth\nMy girlfriend is cheatin on my with my ex-best friend\nSo now I'm takin applications for my next best friend\nI gotta keep my composure and hold it together\nI survived the stormy weather\nThings can only get better\nI shoulda brought a sweater, cause warm hearts turn cold\nBoys change shapes like Origami, but I refuse to fold\nTruth be told, that problems follow money and power\nBoys changin by the hour, friendships turn sour\nPhony smiles, fraud dap, and lotta fake love\nBut I'm sturdy in my position, Paul Wall won't budge\n\n(Hook x2)", "year": "2004-02-24"}]}