{"songs": [{"album": "Ready, Fire, Aim!", "image": "https://images.genius.com/dbe634b6ee370b06f4b7618ecc7e83e9.600x600x1.jpg", "year": "2010-09-28", "title": "Couldn’t Do You", "lyrics": "Yo, It's Millie man\nDon't hate on me hate on me 'cause I'm your girlfriends favorite. YF\n\nI don't have to listen to what you gotta say\nI do, I do, whatever I want to\nYou bite my style, so tell me how it really tastes\nI knew, I knew, you couldn't just do you\n\nI'm clearin' shit up on these verses, Haters gettin' nervous\nWhen they see my picture in their girlfriends purses\nI'm confident, Not a cocky dude\nThey talk shit, I'm still makin' moves\nI'm leadin' 'em, They in the group\nI'm beaten 'em, They bound to lose\n\nWatch me like a TV, Speechless when you see me\nYou bought swag, I cop for free\nI'm the real deal, You a wannabe\nMy life is like a movie, Girls all act like groupies\nI got my fav's, That's all I need\nFuck the world, The world can't fuck me\n\nI don't have to listen to what you gotta say\nI do, I do, whatever I want to\nYou bite my style, so tell me how it really tastes\nI knew, I knew, you couldn't just do you. (x2)\n\nI'm sharper then the knife I cut my steak with\nYou soft like fruit go eat a grape bitch\nYou ain't gotta say it 'cause I know that I'm great bitch\nI don't got a job, But you, You work the grave shift\nI get high and pay no mind to people talkin' outta line\nI ain't lyin', I feel fine\nYou hate on wine, I date dimes, I get mine\nIt's my time you're minutes late\nYou see me. Oh you copy, paste\nSwagga Jackin' Lames need to get the fuck out my face\n\nI don't have to listen to what you gotta say\nI do, I do, whatever I want to\nYou bite my style, so tell me how it really tastes\nI knew, I knew, you couldn't just do you. (x2)\n\nKyle Lucas:\nI'm doin' this rap shit, Till I bash it\nMy last shit, I surpassed it\nI killed it, It's in a casket\nThese adjectives are drastic\nSo put 'em in the ground, Like six feet down\nAnd if they unaware, They finna know now\nSee this hate is all poppin', The bitches make me feel popula\nIt gets my profit up, I don't give a fuck if I'm hip hop enough\nSo whatever they talkin' about it's blocked out\nEven with the top down, With your chicks top down\n\nI don't have to listen to what you gotta say\nI do, I do, whatever I want to\nYou bite my style, so tell me how it really tastes\nI knew, I knew, you couldn't just do you. (x2)"}], "artist": "T. Mills"}