{"artist": "E-40", "songs": [{"title": "Ballhog", "image": "https://images.genius.com/1a5c2ee4c0588153be781b564a34db6f.1000x1000x1.jpg", "album": "The Gift of Gab", "year": "2018-08-24", "lyrics": "[Verse 1: E-40]\n90 racks for the watch, 30 stacks for the chain\nA 50 bar for the medallion, diamonds drippy like the rain\nLower development housing is where I was taught to talk my talk\nIn the thick of the smudge, the slime, on the tar like crosswalk\nA young factor having scrilly, spending blue notes in a drought\nLiving for the moment, fuck further out\nTomahawk by my kidney, MCM belt\nFucker want beef, I'm make him a patty melt\nI'ma see you about something, send my crash dummy\nHe ain't from Japan, but he like to play kamikaze\nYour bitch got sloppy toppy, off of the ginger ale with Jack\nShe got that hot throat with a built-in thermostat\nI'm smoking agricultural and vegetation in the backseat zone and blazin'\nIn the clean 19 with the dealership plates, insurance and registration\nGarnished and decorated with all the toppings and all the fixings\nWe don't fuck with turf dirt, we only fuck with vixens\n\n[Chorus: Stresmatic]\nI don't jog, fuck the brown police dog\nFrom the Yay, apartment complexes and smog\nGet it, count money in the fog\nWhat? Ballhog\nI don't jog, fuck the brown police dog\nFrom the Yay, apartment complexes and smog\nGet it, count money in the fog\nWhat? Ballhog, ballhog\n\n[Verse 2: E-40]\nHallelujuah! The Lord blessed me with gouda\nYou can find me on vacation in Barbados or Aruba\nPuerto Villarta, Mexico, Bora Bora or Bermuda\nMe don't do no snorkel, me don't do no scuba\nUnder difficult circumstances, I'm having my finances\nUsed to be the lowest man on the totem pole, used to be the brokest kid on campus\nWay ahead of my time, the laughing stock in pre-school\nHoles in my pants when ripped jeans wasn't cool\nBeat the odds, count my blessings, it's a blessing\nPraise God for replying to my message\nSuckers don't understand me 'cause they ain't got no understanding\nI'm out here feasting, I ain't famine, eating jasmine rice and salmon\nYour little gutter chick ain't handling, got you sprung\nNeed to tell that hoe to douche and brush her tongue\nWandering eyes, wondering why I ain't calling\nCome and get your bitch, she out here thottin', reckless eyeballin'...BIATCH!\n\n[Chorus: Stresmatic]\nI don't jog, fuck the brown police dog\nFrom the Yay, apartment complexes and smog\nGet it, count money in the fog\nWhat? Ballhog\nI don't jog, fuck the brown police dog\nFrom the Yay, apartment complexes and smog\nGet it, count money in the fog\nWhat? Ballhog, ballhog\nBallhog, ballhog"}]}