{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "Shakin’", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "[Intro]\nYa still there pal?\nHello? Where are ya?\nI know you're still there 'cause I could smell ya\n\nPositive! oh yes, oh yes\nPositive! oh yes, oh yes\nPositive! oh yes, oh yes\nPositive! oh yes, oh yes\nPositive! oh yes, oh yes\n\nPositive! oh yes, the fly pimp\n\n[Verse 1]\nFuck 'em, buck 'em, duck 'em other rappers out on the street\nA brother's gettin' old and a nigga has gotta eat\nSo the rhymes I wrote is my anecdote\nIn comparison it's a like a beta to a motherfuckin' instro\nFollow the leader 'cause I'm no one to follow\nI got these suckers so scared you\nBitch-ass niggas can't even swallow\nAnd if you feel you wanna set it, then come and get it\nAnd bet your last baby girl I'm gonna wet it\nSo let me run it and stick it and gun it\nWatch your girl get taunted\nLay her back up with my feet up and gettin' blunted\nI'm takin' title and proddin' bitches and money for the makin'\nUhh! See, I got 'em shakin'\n\n[Hook]\nYa start shakin' (Come again)\nYa start shakin' (I got 'em shakin')\nYa start shakin' (Come again)\nYa start shakin'\n\n[Verse 2]\nI'm grippin' it up, I'm rippin' it up, I gotta make it happen\nI'm shakin' 'em up, I'm breakin' 'em up and rappers can't imagine\nI'm hittin' 'em hard, I'm leavin' 'em scarred and yes I'm gonna take it\nI'm soothin' and provin' and provin' and\nSoothin' and baby won't you shake it?\nI'm dippin' and dodgin' and dodgin' and dippin'\nGrippin 'em, grabbin' 'em, grabbin' 'em, grippin' 'em\nBlowin' 'em, showin' 'em and\nLettin' 'em know that Pos is always living\nI'm setting it off, I'm letting it off, of course\nCan't stop my styling\nI'm bloomin' and blammin', slammin' and jammin'\nWon't you come and try me?\nI rock this, I rock that, make it hit, make it phat\nMake it cool, make it smooth, all the gods show improve\nGet the dough, rip the show, hit the hoe, better no\nRappin' and mackin' and mackin' and rappin' Pos is the pro\nI got 'em shakin'\n\n[Hook]\nYa start shakin' (Come again)\nYa start shakin' (Say I got 'em shakin')\nYa start shakin' (Come again)\nYa start shakin'\n(Check it out...)\n\n[Verse 3]\nI'm the type of guy that you can call a planna\nThat's how I met this little hooker named Anna\nI got you sewn from New York out to Atlanta\nShe sucked my dick like she was the Ana-Banana\nFuck George Bush and the Star Spangled Banner\nI went to Jamaica just to get a little tanner\nGotta bitch next door and I really can't stand her\nKick a nigga in his nuts 'til he sings like a Soprana\nI got 'em shakin'\n\n[Hook]\nYa start shakin' (Come again)\nYa start shakin' (Uh, say I got 'em shakin')\nYa start shakin' (Come again)\nYa start shakin'\n\n[Verse 4]\nRappers are rickety, rockety\nGot no money but Monopoly\nScribble-scrabble 'round playground and gravel\nThat's what I'm droppin' see\nNever caught me trickin', just long dickin'\nI'm gettin' with the goin' 'cause I'm goin' with the gettin'\nI see your fly bitch, I call my fly bitch kitten\nLike G Rap said \"I-I-I ain't bullshittin'\"\nThat ass was soft like butter, I wanted to gut her\nAnd shut her down, from all that rhymin', hit her 'til she stutter\nI charm in it, come in it, rub in it, she's lovin' it\nThe pussy's so big I put my four fingers and my thumb in it\nThat's the process of love makin'\nAnd when I get busy with women, say...\nI got 'em shakin'\n\n[Hook]\nYa start shakin' (Come again)\nYa start shakin' (I got 'em shakin')\nYa start shakin' (Come again)\nYa start shakin'\n\n[Verse 5]\nThis is a poetical, theoretical\nSorta in order, but don't say it's alphabetical\nPersisted, then she need medical assistance\nSo all you FUCKIN' rappers out there keep your distance [Pause]\nI got a bat called a Louisville Slugger (What!)\nGirls talk nice and if you don't I'm gonna bugga (What!)\nAnd if I get played on any account\nThen the Positive K (Steps up to the mound!)\nAnd you'll get hit and your paths you'll pick\nAnd when your flame gets lit (Ahh shit)\nSo don't diss it, that's to be explict (Get a job!)\nI got a job, ya see I make more than solicit\nThat's what you call prostitution [Gun shots]\nDown now, niggas shootin'\n'Cause when I flip my whole squad starts breakin'\nThat's why - that's why I, I got 'em shakin'\n\n[Outro]\nThe Easy LG\nGot your punk DJs out there shakin'\nTo my man Kid Capri, yeah uh, he got 'em shakin'\nTo my man B.O., huh, he got ya bitches out there shakin'\nTo the mighty Zulu Nation, yeah, you know they got 'em shakin'\nAnd to my man Sugar Ray, yeah, uh, he got 'em shakin'\nTo my man - to my man - to my man Daddy Kane, yeah, he got 'em shakin'\nThe Positive K, he know he got ya shakin'\n[record reverses]\nAn offbeat cut, how you like that?\nUh uh, yeah, Harlem got 'em shakin'\nUh, uh, Brooklyn got 'em shakin'\nUh, uh, Queens got 'em shakin'\nHuh huh, shake it up ya'll, shake it up y'all\nUh, shake it up y'all, shake it up y'all\nUh, shake it up y'all, shake it up y'all\nUh, shake it up y'all, shake it up y'all", "year": null}]}