{"artist": "Anybody Killa", "songs": [{"title": "Tired of Asking", "image": "https://images.genius.com/043a960c080afdd5e266d49e02eee1a3.500x500x1.jpg", "album": "Medicine Bag", "lyrics": "[Verse 1]\nYou ever felt like you ain’t being heard?\nLike the whole world’s deaf and can’t understand a word?\nWhen you speak what you feel when you ask how to deal?\nBut nobody has the time to listen and be real\nNow you’re mad and upset cause of all of the neglect\nGot you sittin home all alone waiting to eject\nOn this life that you live cause you can’t take it serious\nEverybody’s bitchin and it’s makin you delirious\nNow you feel it’s time to take it out on somebody\nTheir pain ends up being your stress release party\nI’m tired of searching for help, don’t want these cards I was dealt\nSo if I want it I’ma get it myself\nAnd I ain’t leaving till I’m satisfied, break me off\nKeep it even, motherfucker, or you will get tossed\nAnd if anybody ever tries to take my half\nI’ll respond first and ask questions last\nI’m tired of asking\n\n[Chorus]\nTired of asking [x3]\nNow it’s time to take what’s mine\nSo gimmie gimmie gimmie what’s mine\nNow gimmie gimmie gimmie [x2]\n\n[Verse 2: Anybody Killa]\nI like to think I’m in control of this journey I’m on\nIf I ain’t getting what I need, then you’re doing me wrong\nKind of upsetting, it’ll make you want to take it\nVocalize what you thinking to the ones that always fake it\nSend em home to they momma with a gravestone\nAll curled up cause they had a weak backbone\nI think I’m losing it, y’all\nIt is me or does the whole world seem pissed off?\nIt’s time to change my views of reality\nLife is what you make it so I hope nobody’s mad at me\nPeople go crazy when there’s something that they need\nAnd the only thing you see is a world full of greed\nAnd I don’t think that we’re here to have to struggle\nWhere everyday is turned into a hustle\nS-S-S-Sure I said it before and I’ll say it again\nThat I’ma get mine until the very end\nSo watch me\n\n[Hook]\n\n[Verse 3]\nI’m tired of askin, time keeps passin\nSick of lookin like I’m constantly harassin\nSo gimmie gimmie or I’m grabbin, gotta get it for the havin\nAin’t slackin when I’m attackin, no more braggin\nTaking what ain’t yours and thinking you safe\nBut you ain’t safe that’s why you always hiding your face\nIf you ever started hating me I really don’t care\nI just got tired of asking for my fair share\nI’ma get mine so go get yours\nOnly thing stopping you is opening new doors\nDon’t hold yourself back stop askin and take it\nAin’t no charging it to the game if you tryin to make it\nKeep a bird’s eye view on the road you choose\nWhen you walking through this life without tryin to lose\nSo if I come huntin then I’m coming blastin\nThat’s why I’m known as a Killa cause I’m tired of asking\n(Tired of asking)\n\n[Hook x4]", "year": "2010-10-19"}]}