{"songs": [{"lyrics": "[Intro: Funkmaster Flex, Action Bronson and Big Body Bes]\nF: You know what it is, you see me! Funk Flex, you see what– we make it happen! Download that DJ Funk Flex app right now! You see me with the a.k.a Young Chocolate, ladies, you see me! My ma– my man Action Bronson is here, baby!\nA: Uh! Young renegade, yo, Body, what up, Body?\nB: I'm out here, man, take 'em back! '99, I got it shakin' in front of Skate Key, you wasn't wit' me!\nA: Uh! You know what I'm sayin'?\nB: [?], man. We out here, shout-outs to [?], Fordham Road, we out here wildin'!\nA: Yo, yo, I got this, baby. I got this\n\n[Verse 1: Action Bronson]\nYo, spent your advance on one trip to Six Flags\nWith a handicapped class with your candy rap ass\nBitch, you singin' like Frankie Lymon\nFuck around, you might break your hymen\nThen somebody's gonna have to clean the mess up\nLike you fuckin' spilled ketchup\nFuckin' flawless from the neck up\nIf you want it, better step up\nYou don't wanna feel that brat-tat-tat-tat\nCome through the fuckin' ball court with Salt-N-Pepa\nHold on, hold the fuck on, yo\n\n[Verse 2: Action Bronson]\nYo, yo, yo, listen, yo, yo\nIf I die, change my suit four times at the wake\nMake sure I get my dick sucked also\nUh, everybody wearin' white clothes\nCrush cocaine, put it up your right nose\nYou might see me lookin' homeless\nHoppin' out the rover, parrot on my shoulder\nJust say, \"What up,\" I might acknowledge you\nMy shit is crazy, though appear to be a common dude\nI only deal with people that invent shit\n'Cause after rap there ain't no pension\nAnd I'm just tryin' to be the next George Foreman\nInventin' new grills so Jadakiss could cook the base on it\nI might take a shit in some expensive jeans\nI got expensive habits\nMy kids are mixed like Lenny Kravitz\nIt's not me rappin', it's the parrot\nAnd if I punch you in the face\nYou'll never eat a motherfuckin' sandwich!\nBody!\n\n[Interlude: Action Bronson, Big Body Bes and Funkmaster Flex]\nB: Oh my God!\nA: Queens in the motherfuckin' building, man! Flex, you hear me, man?\nF: I hear you!\nA: Yo, shout-outs to my brother Alchemist, man! Yo, Body, tell 'em somethin', son! Uh!\nB: I cry– I can't eve– I feel like speaking Puerto Rican, right now\nA: Yo, I got this, son. I got this. I got this. Yo, yo\n\n[Verse 3: Action Bronson]\nThese dudes wanna claim king, you're dealing with immortals\nFuck being cordial, I'm laughin' while I'm dancin' in the ball room\nFormer king's head lay in the guillotine\nSnap my fingers, chop that motherfucker for the village to see\nAin't no man walking iller than me\nIf you see me, better kneel on the knee\nI'm like a one-in-a-million case\nBrilliant face, crooked J tryna put me in the cage\nTurn the page, bitch, I'm paid\nI been around the world more than Carmen Sandiego\nRaw meat thrown to lions under the table\nGrown men breakin' bread while your face bled\nFound him face down in the shed like a base head\nSwitch plates on the Civic, pivot\nExotic places that they rap about, I live it\nFat boy, I'm eatin' all the spinach\nHold up a second, baby, I ain't even finished, nah\nI dropped 50 grand on my man's bail\nTwo hours later, he was tan as a potato\nFrom a foreign land that once was occupied by NATO\nEvery line is nasal\nWe deal with more numbers than times tables\nBodies get found in the ground by neighbors\nI'm in the bathroom reading the paper, laid up\nSharp blade cut, need a top, girly-girlies like it\nThe ones that go two ways, it's just my blue phase\nShit, dawg, yo\nI'm in the bathroom reading the paper, laid up\nButt-naked in the Lamborghini\nThese motherfuckers can't see me\nThe Magic Johnson of the game, these lames don't want to play with me\nYou hear me?\nQueens in the motherfuckin' building!\n\n[Outro: Funkmaster Flex, Action Bronson and Big Body Bes]\nF: New York City, listen, man. I'ma– I'ma keep it– I'ma keep it official today. Yo, this boy Action Bronson is the nicest in the game right now, bruh\nA: Uh!\nF: We gon' keep it official. This is a mean freestyle\nB: You hear that?\nA: Uh!\nF: He's the nicest in the game, we gon' keep it official\nA: QU!\nF: Yo, listen, you're more than welcome to disagree, I don't think many people gon' disagree\nA: Shout-outs to Body\nF: Mean\nA: Shout-outs to Alchemist, Meyhem Lauren, Jay Steel, we the fuck out here", "title": "FunkMaster Flex Freestyle (1/14/15)", "album": null, "image": "https://images.genius.com/4c92d833aae01e64b71a556bb1cb9f0b.990x660x1.jpg", "year": "2015-01-14"}], "artist": "Action Bronson"}