{"songs": [{"image": "https://images.genius.com/369afe88f604eba1cc44f9cb55ac50c7.1000x1000x1.jpg", "title": "Gang Shit", "album": "AI YoungBoy 2", "year": "2019-10-11", "lyrics": "[Intro]\nAyy, free D-Dawg\nAyy, 4KTrey\nBitch ass nigga, ayy, ain't nobody, ain't nobody safe\nNorthside 38, we put guns to the face, who gon' die today?\n\n[Chorus]\nGang shit, blow your brain, bitch, who you playin' with?\nPistols get to sparkin', do no talkin', get your mans hit\nThem gunners go to tweakin', pop your top, that be that kill switch\nThat shit you talkin' phony, run up on me, you get killed, bitch\nUh, uh, bangin' 4KTrey, oh, she a slime bitch?\nPlus she got some tricks that's up her sleeve that blow your mind, shit\nWhen it come to me, she never scared, she bust that fire quick\nHold on, bitch, I really been that, I ain't tryin'\n\n[Verse 1]\nTaliban, I get a bitch to make 'em buy the iron\nHe got them, nothin' but convicted felons off of my end\nDive in, I promise after that you gon' get shot then\nGreen flags in matte black Range Rovers and green FN's\nI ain't them dudes, bitch, you gon' pop who? Oh, you should try then\nBitch, I be that nigga cock it back and go to firin'\nI'm bustin', no discussion, after that, you hear them sirens\nCame in buckin', that shit turnt us up, then people end up dying\nFeelin' good, I got drugs in my body\nLookin' for me, come and see me in the back 'cause I ain't hidin'\nCut up, don't try to stop me, bitch, I see you watchin'\nMake my shooter kill a nigga, then whack the bitch who drivin'\n\n[Chorus]\nGang shit, blow your brain, bitch, who you playin' with?\nPistols get to sparkin', do no talkin', get your mans hit\nThem gunners go to tweakin', pop your top, that be that kill switch\nThat shit you talkin' phony, run up on me, you get killed, bitch\nUh, uh, bangin' 4KTrey, oh, she a slime bitch?\nPlus she got some tricks that's up her sleeve that blow your mind, shit\nWhen it come to me, she never scared, she bust that fire quick\nHold on, bitch, I really been that, I ain't tryin'\n\n[Verse 2]\nShe gon' pop the cat for me and make it act bipolar\nShe was in the bed, let's get to clappin', leave her rollin' over\nBack to back, I stab it, I was leanin', started dreamin', dozin'\nYou know what I mean, off them beans tryna bend it over\nYou showin' off your gun, well nigga, pop it then\nI ain't sharin' none of my hundreds out my pocket, friend\nWhat you on, say you drove? Need to stop it then\nWith them tools, I make blues, blow this like a harmonica\nSay you gon' stamp me, put your mammy on that front row\nI go to blappin' where you standin' with that Draco\nThese niggas some hoes, your best interest is to lay low\nYou say it's up so I catch you, bitch, I'ma knock your fuckin' face low\nOn gang, nigga\n\n[Chorus]\nGang shit, blow your brain, bitch, who you playin' with?\nPistols get to sparkin', do no talkin', get your mans hit\nThem gunners go to tweakin', pop your top, that be that kill switch\nThat shit you talkin' phony, run up on me, you get killed, bitch\nUh, uh, bangin' 4KTrey, oh, she a slime bitch?\nPlus she got some tricks that's up her sleeve that blow your mind, shit\nWhen it come to me, she never scared, she bust that fire quick\nHold on, bitch, I really been that, I ain't tryin'"}], "artist": "YoungBoy Never Broke Again"}