{"songs": [{"title": "Getting Fierce", "album": "Pure Righteousness", "year": "1988-06-15", "image": "https://images.genius.com/732d84201eb8ac0c8f96f482c23f88e9.600x600x1.jpg", "lyrics": "[Verse 1: Lakim Shabazz]\nThis beat is chunky, lyrics are spunky and tough\nYou wanna battle? You ain't funky enough\nLak Shabazz'll throw a lyrical roundhouse to uplift\nThe spirits'll hear it 'cause Mark came up with\nThe slamming sound that is dope and high technical\nYou say to yourself this is the best that you've ever heard\nComing from a musical sampler\nThe beat is like a [?] baby, the Markey pampers it\n'Til it's perfected then he injects it into a tape cassette\nMistakes are corrected, he's orally respected\nYo Mark, it gets kinda hectic\nYou're the director, so direct this beat in the right direction\nWith my voice in the background kicking the lyrics I'm willing to bet\nIt's gonna go gold, behold the untold\nMy rhymes are hard, yours are soft like a casserole\nIt doesn't bother me to burst your bubble, you want trouble?\nNo problem, I'll give it to you right on the double\nSo quick and fast, you know I will last\nMy name is Lak Shabazz, give me a task, the test I'll pass\nPay close attention, so you don't miss the style of the rhyme\nIt has jazz, charisma\nThe hype is here so wipe your tears, my dear\nIt's '88, time to elevate and get fierce\nI'm getting fierce\n\n[Verse 2: Lakim Shabazz]\nAre you awaken? Well get up on your good foot, listen up\nLet the fabulous one put this raw deal together\nThat appeals to the adolescent crowd that will appreciate what I do\nIs kick lyrics, say them loud and clear for y'all to hear it\nI'm higher, under, I roll like thunder\nSometimes down deep in your mind, I know it makes you wonder\nAbout what's gonna happen next, you tryna diss\nThat's when I start snapping necks\nYou wanna rumble? Come on, I fight fair\nMy name is not Fred and this is not a nightmare\nI'm not deluded, polluted\nI'm one of the coolest, intelligent brothers far-fetched from\nA foolish man, but certain [?] mine, and do what I wanna do with it\nI think it's 'bout time to convince you to get into the flow\nAs he rolls and living large, I know you wanna battle me, bro\nThat's a no-no, 'cause many of days go by, my rhymes mature\nThey're pure and not your, I can't be conquered\nThe hype is here so wipe your tears, my dear\nIt's '88, time to elevate, and get fierce"}], "artist": "Lakim Shabazz"}