{"songs": [{"title": "Five Bucks", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "Verse 1 (Big Sean):\nI'm smoking loudly, I woke them all\nI pick up that tree, when it's not far\nI'm gone off that tree, when it's not tall\nI'm in love with tree, I'm a Avatar\nI pick up a O from my nigga Ralphie\nMy bro and me, but he is not Alfie\nGone off that goo punch, it makes me drowsy\nRoll up the windows, it makes it cloudy\nDaaaaamn, if you ain't know\nI make these girls nice, smokin' paper and bowls\nMy ladies like blunts, hit 'em twice if not once\nThen I blow 'em off and just pass 'em to my bro\nNow catch me gettin' brain if a nigga not learnin'\nI be spendin' money if a nigga not earnin'\nCatch me in the back seat if I'm not steerin'\nAnd I be rollin' up if a nigga not burnin' boiii\n\nChorus:\nI got five on it (got it good)\nGrab your fo', let's get keyed\nI got five on it\nMessin with that endo weed\nI got five on it (got it good)\nIt's got me stuck, cannot go back\nI got five on it\nPatna let's go half on a sack\n\nVerse 2 (Chip Tha Ripper):\nYou know a nigga like to stay at that cruisin' altitude up in the sky\nTried to fuck with paper planes but it's not the same high\nCleveland niggas ain't no bitches we prefer the cigarillo smoke\nIf you say it take away from taste then get some better smoke\n'Cus the shit I blow can be smelt on the next block\nAin't no middle mans everything you need is in-stock\nThis Glock is all the security I need\nI be solo dolo when you see me blowin' on some weed\nWhy speed? No need, I be just takin' it slow\nI be so clean, diesel overpowers my cologne\nNow all the bad bitches who blaze are shiftin' this way\nYa'll just some white belts with these leaves I am the sensei\nNow bow to the bag, never save the best for last\nWhen I come around niggas know to hurry up and pass\nFuck a dime sack let's cop a quarter pound\nNow what the fuck is you gon' put down?\nNigga I got five\n\nChorus:\n\nVerse 3 (Curren$y):\nHigh wired, 64 hydraulics\nNot stolen, lost my keys I was high patna\nFuck you want, this a RAW paper not a blunt\nYou must got me mixed up with Chip 'cus\nThis Spitta, Zig-Zag a whole zip up\nShit strong, should'a came with a big pick-up\nBitches callin' me wanna smoke beggin' for me to pick up\nShe blow me while I'm blowin' rings of that killa\nThat weed you smokin' brown\nFake weed too much make-up, clowns\nGet real smokin' green strawberry fields\nHigh standin' up feelin' like I'm layin' down\nCouple bougie Judys came 'round\nActin' all stuck up\nNow they just stuck from smokin' with us\nHow the hallways smellin', is my windows open enough?\nI hear walkie talkies is security comin' up? ...Fuck\n\nChorus:"}], "artist": "Big Sean"}