{"artist": "Andy Mineo", "songs": [{"title": "Shallow", "album": "Heroes for Sale", "year": "2013-04-16", "image": "https://images.genius.com/fdf80f726778a05ec46bdc108384b8f2.540x540x1.jpg", "lyrics": "[Intro: Andy Mineo]\nThere are so many things that I don't understand\nLike why am I so lost if I have a captain?\nI'm tossed back and forth by deceitful winds\nAnd if it all falls, look within\nI've been breaking hearts way too long\nI did this from the start, now I'm all alone\nSo focus on the heart if you want a home\nI can't settle for that cardboard box no more\n\n[Verse 1: Andy Mineo]\nEarly Christmas morning at the table with my momma\nSteam's coming off the coffee, we talking about the father\nThese are the conversations I cherish and I hold on to\nShe asked me, \"Is there a girl in your life that you're fond of?\"\nWell, not yet, feels like I'm looking for the Lochness\nI ain't even really got a prospect\nI don't think I found what I want yet\nBut let me be blunt, no pothead\nI'm going through a process to stop seeing women as objects\nCause the meaning of marriage is not sex\nIt's so much more, this ain't no beauty contest\nWhen you play that game then somebody's always got next\nIf charm is deceiving and beauty's vain, then I bet\nThe standards that we judge most people with are nonsense\nI put too much emphasis on my preferences\nDang, I'm feeling shallow just addressing this\nCause God loves me in spite of how much a mess I am is\nAnd I'm writing off shorties whose bodies is less impressive like, dang\n\n[Hook: Andy Mineo]\nI'm caught up in this game again\nShe's asking if we're more than friends\nWhy is this happening?\nI don't know if she the one\nBut I don't wanna lose her love\nI'm caught up in this game again\nShe's asking if we're more than friends\nWhy is this happening?\nI don't know if she the one\nBut I don't wanna lose her love\n\n[Verse 2: Swoope]\nCooling back in '01, high school mac was so fun\nMaking chicks my baby, then on to the next one, Jay-Z\n'01 turned to '04, late night games at your dorm\nLet's take a walk, your girls hating\nWe're just flirting, we ain't dating\n'04 turned to '06, and you're so sick\nAsking me, \"Is that your chick?\"\nAnd I'm like, \"Yes, finna put her in a white dress\"\nAnd you cry, I loved you, I ain't mean it, but I said it\nNow I'm married with a trail of broken hearts and I regret it, dang\nShould've treated you like you was God's daughter\nCause you was, but I got caught up, now I got karma\nComma, 2012 and now I got daughters\nAnd I'd kill the dude that ever do them like I did you\nLaundry list of names, that's too long to mention\nBut I'm the one need cleansing, I did my dirt\nAnd then some pain was never intention\nI pray for your forgiveness\nThank God He saved me from my sin but not the consequences, dang\n\n[Hook]\nI'm caught up in this game again\nShe's asking if we're more than friends\nWhy is this happening?\nI don't know if she the one\nBut I don't wanna lose her love\nI'm caught up in this game again\nShe's asking if we're more than friends\nWhy is this happening?\nI don't know if she the one\nBut I don't wanna lose her love\n\n[Bridge]\nThere are so many things that I don't understand\nLike why am I so lost if I have a captain\nI'm tossed back and forth by deceitful winds\nAnd if it all falls, look within\nI've been breaking hearts way too long\nI did this from the start, now I'm all alone\nSo focus on the heart if you want a home\nI can't settle for that cardboard box no more\n\n[Hook]\nI'm caught up in this game again\nShe's asking if we're more than friends\nWhy is this happening?\nI don't know if she the one\nBut I don't wanna lose her love\nI'm caught up in this game again\nShe's asking if we're more than friends\nWhy is this happening?\nI don't know if she the one\nBut I don't wanna lose her love\n\n[Outro]\nAnd all the boys said, and all the boys said, and all the boys again\nAll I really know is I don't know what I want\nCaught up in this game again\nAnd all the boys said, and all the boys said\nAll I really know is I don't know what I want"}]}