{"artist": "Cam’ron", "songs": [{"title": "Boy, Boy", "album": "Come Home with Me", "year": "2002-05-14", "image": "https://images.genius.com/fe4c078c29bc260286bd13aee2488829.1000x1000x1.jpg", "lyrics": "[Intro: Cam'ron & Guy]\nWhat up boy, boy?\nAin't nothing boy, boy, it's good in the hood\nWhat's popping boy, boy?\nA lot of these cats faking jacks boy, boy\nMy man Smit' over hear, he's got something on his mind\n'Sup Smitty?\nThis kid Smitty is acting a little silly right\nNow, boy, boy\nHe don't understand this is real in the hood boy, boy\nWhy you ain't smack boy, boy?\nWell he got something on his mind, you know what I'm saying?\nI'm trying to show a little love to him boy, boy, he need to understand\nI'm trying to let 'em live boy, boy, this is real ya' understand?\nYou need to stop playin' with me like that boy, boy\nYeah, I'ma holla at nigga, boy, boy\n\n[Verse 1: Cam'ron]\nKilla, yo, yo\nCops bagged me one night, looking for the blow\nWent from Bronxhouse to bookings, bookings to the show\nFrom the show to the crib, to the kitchen cooking Os\nKitchen to the car, to the street looking for hoes\nLooking for hoes, to straight up bagging one\nFrom my game in her brain, in the wagon, hun (in the wagon bitch)\nFrom the wagon, garage to the house\nDining room, kitchen, kitchen to the couch\nCouch to the bedroom, my dick's in her mouth\nBedroom to front door, this bitch getting out (see ya)\nFront door, to \"You know where the Jacuzzi is?\"\nDress cooley, but usually the Coogi kid, bouchie kid\nTell ya boo-bee, a doo-bee did\nShe a houchie groupie Cooley is\nWho am I? Come on, can't be for-reala\nWent from Cam to Killa, Killa to scrilla, gorilla\nFrom Killa to skyscrapers, from skyscrapers\nTo high papers, that's my nature\nDo five you now, y'all die later\nCome to your wake, look at you; \"Hi hater\"\nFrom the wake to lot, another boogie\nFrom the lot to the hill, to cop something ugly (ugly)\nFrom the hill to that state Dakota\nFrom Dakota to the corner, get that baking soda, Killa\n\n[Chorus: Cam'ron]\nYo, where you from dog? (HARLEM BOY, BOY)\nOh this nigga getting money? (HOLLA BOY, BOY)\nOh this cat over fronting? (FUCK BOY, BOY)\nHe keep that shit up, dog.. (FUCKING DROP BOY, BOY)\nOh you got that hydro? (YOU LYIN BOY, BOY)\nIf you need that dope, though? (WE GOT BOY, BOY)\nBut watch your back (FROM THE COPS BOY, BOY)\nCause they paper? (THEY WANNA STOP BOY, BOY)\n\n[Verse 2: Cam'ron]\nAy yo, I heard you out there shorty, slinging boy, boy\nOh MY god, oh boy, boy\nBe careful of the motherfucking boys, boy\nMe though? I run THEM boys, boy\nLloyd, Floyd, Roy, Soy, Black British\nBitches too, joy toy, what\nCat like you? Call you a Gladiator\nGive her oral, and you happy, Glad-he-ate-her (stupid)\nPut nine on the pussy, she a masturbator\nThen my dick in her mouth, that's what fascinate her\nI'm a legend now, passed a player, passed it player\nGot the rock? Pass it player\nI'm like Betty Crocker with cake, that's in layers\nI had city issues before, ask the mayor (ask him)\nHe said, \"Cam'ron, please stop this crack behavior\"\n(Shut the fuck up, man)\nHe ain't know '96, I had a knack for Gators\nI come through, laugh at haters, bitches too\nWanna act, sit back, relax a player\n'Cause all these hoes jelly you hard\nWhen your purelius are hard\nAnd the Chanel, skelles to Scarfs\nHave 'em sick to their stomachs, their belly's will barf\nAnd I take them to the telly where their belly will force\n\"Why fucking me like that? Calm down that's my uterus\nMy cervix, my ovaries\", relax, I'm doing this\nWelcome to exclusiveness\nYou about to take a week off, the ultimate freak off\nHit Jimmy, Juelz, Sean, and Zeke off\nWait a minute ma', wipe that cum on your cheek OFF\nI hate me a filthy hoe, but I like me a silly hoe\nThat way you really blow\nHaving to fuck cats, she don't really know\nThen take all her money; you don't feel me, though\nYou don't understand my pimp-ery\nYou love them you got sympathy, fuck that, I'm into me\n\n[Chorus: Cam'ron]\nYo, where you from dog? (HARLEM BOY, BOY)\nOh this nigga getting money? (HOLLA BOY, BOY)\nOh this cat over fronting? (FUCK BOY, BOY)\nHe keep that shit up, dog.. (FUCKING DROP BOY, BOY)\nOh you got that hydro? (YOU LYIN BOY, BOY)\nIf you need that dope, though? (WE GOT BOY, BOY)\nBut watch your back (FROM THE COPS BOY, BOY)\nCause they paper? (THEY WANNA STOP BOY, BOY)"}]}