{"artist": "Beanie Sigel", "songs": [{"lyrics": "Beanie, what's up, baby?\nWhat's happening?\n(Face)\nSigel, what ' bout to get off, baby?\nWe fittin' to get off\nAiyo, what we goin' to do on this shit man?\nLet's wreck this motherfucker, baby', what's happenin'?\n\nWhat you want to do nigga?\nI, I wanna, I wanna smash it\n(Smash)\nBack and forth, back and forth\nLet's do it, what you wanna hear?\nI wanna hear some of that ol' that, ol' dear diary\n(Dear diary)\nMr, Mr. Scarface, some of that old shit, you ready?\nYeah, I'm ready\n\nI locks and load, cock and spray\nHit you niggas from a block away\nSK to the Stock away\n'Cause I know how to hold that shit\nEmpty the can with one hand and reload that shit\n\nGive 'em the full clip, these niggas is bullshit\nBeen talkin' big six but scared as fuck when I pulled it\nNow eat this motherfuckin' bullet\nThese niggas got some pussy in 'em\nSee I got them pissin' in they denim\n\nMan you fuckin' with a stash raper, duct taper\nFuck you police and fuck neighbors\nMove to smooth, don't duck or try to shake us\n2 P 8 9 ruge, so don't tuck paper\n\nYou heard what the man said? Bitch now un ask it\nI got to have it\nWhen hitin' licks I'm a savage, you hoes is plastic\nI got a semi automatic pointed at your ass\nSlowin' me down gets you blasted\n\nFor your chunk, I'll trunk your folks\nIt ain't shit for mac to grip the gat and put the pump to work\nCall your bluff run in your spot with a detective suit\nGot you cuffed bout to show you what this tech will do\n\nYou must of thought that we was friendly\nWhen we told you we was rappers, we Jackers\nWe want the money, that's what we after\nWe want the package under the god damn mattress\nAnd if the brain splatters, don't matter, that's what we practice\n\nBlast the rocket, knock off your leg\nTear through your forearm\nSit you in a chair, make your niggas call you short arm\nPelets in your hand, you'll never put shorts on\nAin't shit fair when you got to get your war on\n\nSo why don't you come out and play?\nMake my mother fuckin' day\nY'all niggas cotton, potatoes like augrotten\nWe niggas plottin' to hit your stash and leave you rotten\n\nI done bust slugs from all types of shit\nI have your ass plugged up to all types of shit\nAnd I show you, dog, how your life can get\nAnd every thing all real fuck what you might can get\n\n'Cause nothin' needs to be said something needs to be done\nB give me a cigarette, I think I need one\n'Cause in 'bout 15 seconds I'm a set the motherfuckin' alarm off\nAnd shoot this motherfuckers arm off\n\nYou niggas better smartin' up\nAct like Mac won't come through and spark shit up\nWhere the fuck you get heart from?\nLittle bitch ass nigga started commin' out the fuckin' dark from\n\nI done told you, I'm the only nigga pushin' weight\nAnd for another nigga to try to take my place is in the wake\nIt's time I retaliate\nI'll make you mother fuckers pay\nNow point me to the motherfuckin', yay\n\nYou lookin' at a sick bastard\nThis stick up shit, I got it mastered\nGlove and ski mask it, any body move a lick gettin' blasted\nWhen I'm in the crib for your shit and a thick plastic\n\nI got this duck tape stuck in my pocket for one reason\nYou can stop screamin', stop squermin' or stop breathin'\n'Cause I didn't come here to stay or play your babysitter\nI came here to split your mother fuckin' wig, nigga\n\nIf your block gettin' money nigga, I want in\nRun it in before I run in\nYour spot 200 Glocks and 100 men\nDroppin' More shells than run and 'em\n\nActin' bad, smash a nigga stash and mash\nSnatch the bag, bust him in his ass and dash\nUn cock the mag\nKill him I don't need no mask\nWe Identify each other nigga Mac and Brad\n\nWho you know but Mac and Brad?\nCome through all black, no mask and crash your pad\n8 clips, 4 hammers, desert eagle the place\nNobody but Sigel and Face, you feel that?\n\nYeah nigga that's what I'm talkin' about I know you not tired\nI'm through, I'm tired and I'm out this motherfucker\n\nYo, I spit so real so my boys can eat\nYou got the nerve to have a deal and just noise on beats\nLittle suburb nigga never saw the streets\nSilver spoon ass nigga never drawed your heat\n\nI keep it the truth, what's all the fakin' for?\nGod damn, every week I got to break a jaw\nAnd you wonder why I smack up niggas?\nShit, it's either that or Mac's gonna clap up niggas\n\nWhat ya'll want me to do hun? Soften up?\nSo my raps can start to soften up?\nShit never that, dog, forever my baretta cat\nHittin' niggas in they fitted cap where the letters at\n\nI told ya'll that the truth in here\nRecognize hottest thing in a booth in here\nThe Gooch in here, aiyo, it's over in here\nGod damn, somebody bring me some juice in here\n\nI used to be a drug dealer\nHangin in the cut sellin' dime rocks\nGettin' cash to eat with\nPunchin' a time clock\n\nIn the ghetto makin' small change\nSlingin' till the sun up\nGot to pay my phone bill focusing on the come up\n\nGot 6 shots numbers strait\nCrank 'bout 38\nBig boys trippin' on me tryin' to nigga hate\n\nThis 17 year old Tony Montana type\nAin't never did the killin' but still I'm lovin' the drama right\nUnder covers pass by thinkin' I don't know the truth\nMakin' niggas these offers they know these niggas can't refuse", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "Mack and Brad", "album": null}]}