{"artist": "A$AP Ferg", "songs": [{"title": "Perfume", "image": "https://images.genius.com/a2522ed78ae6cc4ab55e3d7bef329d06.640x640x1.jpg", "album": "Ferg Forever", "lyrics": "[Verse 1]\nTrap Lord on my belly, free my nigga Relli\nElijah smoking that smelly, ménages in the telly\nBlonde bitch named Shelly, dick all in her belly\nI met that bitch at a fashion show, she was rocking Margiela\nI was with Kwasi Kessie rocking all that Versace\nMight be in there sailing, smoking all that Beijing\nTen stacks in my pocket,  for no reason I got it\nFuck around and hit Sin City, tell that bitch to pop it\nWhat's up with you and Purrp? I ain't into all of that gossip\nHe brought the funk into my crew,  you gotta ask Rocky about it\nAll I know is A$AP riding in them Maybachs\n40. cal, we spray that, when AK brratt you take nap\nOh, Lord, that Hood Pope - oh, Lord, that Trap Lord\nWhy they call you Trap Lord? Cause you a rap lord to my casket\nI ain't bowing to no time, Hood Pope on my gold shine\nMy dirty niggas wanna tote nine, but we talk rhyme\nI tell 'em hold up\n\n[Chorus]\nAll I know is that Trap Lord, that Hood Pope\nAll I know is that Trap Lord, but you're a rap Lord to my casket\nAll I know is that fast Porsche smoking that good smoke\nModel bitch who from Brazil, she want it on her culo\nRiding 'round the city feeling like P. Diddy\nGlock 9 in my silk shirt, nigga, no Pac, and no Biggie\nRiding 'round the city feeling like P. Diddy\nGlock 9 in my silk shirt, nigga, no Pac, and no Biggie\n\n[Verse 2]\nNo reply when you call Lord, mama cry 'til her throat sore\nLiechtenstein when I drunk four you was dying in this war hall\nBody left near the staircase courtesy of the whole mob\nDon't mean no fucking thing when I pull up in that Goyard\nShooked up from that toe star, ask questions like Nardwuar\nLike can you feel your fucking legs? I bet that nigga cannot walk\nPersian bitch stack coke hard, sniff white 'till her nose soft\nI fucked that bitch with no rubber, cause that bitch be so raw\nPuff-puff when the semi pump, nigga really gonna pop\nTrunks when you see me duck, niggas really want\nY'all punks can't see the God trap, Trini' Lord\nAnd I click like Donkey Kong when I hit this long\nBetter run when you see the mob, you be seeing God\nHear the drum when my niggas march, you gon' see Allah\nYou the son of a bitch nigga, you daddy a broad\nYou a bitch, little bitch nigga, probably wearing bras\n\n[Chorus]\nAll I know is that Trap Lord, that Hood Pope\nAll I know is that Trap Lord, but you're a rap Lord to my casket\nAll I know is that fast Porsche smoking that good smoke\nModel bitch who from Brazil, she want it on her culo\nRiding 'round the city feeling like P. Diddy\nGlock 9 in my silk shirt, nigga, no Pac, and no Biggie\nRiding 'round the city feeling like P. Diddy\nGlock 9 in my silk shirt, nigga, no Pac, and no Biggie", "year": "2014-11-28"}]}