{"artist": "Anybody Killa", "songs": [{"title": "Hollowpoint", "image": "https://images.genius.com/0ef45eaaeeb6c906ab411eeb71f61222.800x800x1.jpg", "album": "Hatchet Warrior", "lyrics": "[Intro - Syn]\nTwo seperate worlds, opposites\nYet alike in so many many ways\nBoth of these worlds are engaged in an eternal war with each other\nThe war of good versus evil, which is which, you decide\nOnly one thing will outlast both armies, only one thing will survive in the end\nAnd that special magical little item is that of which we call\nThe hollow tip bullet\n\n[Verse 1]\nSit back and let me take you into the mind of a killa\nDark Carnival psychopathic wig spiltta (Anybody)\nMove and change it's time to rearrange\nSo love a dinosaur that you can't tame\nI bring pain, what you think I'm playin a game?\nDetroit is my home, Eastside's what I claim\nFuck a balla, I represent the 313\nWith tech nines and green tree it's a luxury\nThat's how it is and I ain't changin for shit\nWalk the earth mean muggin, waitin for someone to trip\nI'm sick and tired of fuckin waitin for you wannabe thugs to quit\nThat's why I keep it underground and drop the killa shit\nFor juggalos that keep it real non-stop\nKeep away from juggahos unitl I load up my Glock\nCuz in Detroit we got mother fuckin problems\nAnd all the gun play that you hear is my homies tryin to solve them\n\n[Hook] -x2\nYou can't tell me anythang\nHollowpoints control the game\nI can tell ya once they're triggered\nThings will never be the same (Anybody Killa)\n\n[Verse 2]\nI got a brand new tech that I'm dyin to use\nPlay games with this killa and you destined to loose\nMental stress, keepin me alive\nSniffin lines of gunpowder to start off the night\nCurbside gangbanger with some mark ass bitches\nGun smoke from bullet holes leaves you dead in the ditches\nI'm just an average individual, street slangin convict\nPocket full of bullets ready to use 'em up quick\nYou ask my name (ABK), you know the game ain't changed\nLabeled as a killa bustin caps all the same\nAs any other mother fucker with a piece and little bit of attitude\nRunnin through the streets actin rude\nSo hate if you want to, but I'mma keep my focus\nAnd continue with the magic that I practice with the lotus\nPsychopathic and I'm down for life\nAnd anyone who disagree let these hollowpoints change your mind\n\n[Hook] -x2\nYou can't tell me anythang\nHollowpoints control the game\nI can tell ya once they're triggered\nThings will never be the same (Anybody Killa)\n\n[Verse 3]\nI feel the urge to murder, there's no need to cure me\nCivilized under the light, at night I'm filled with fury\nIs it true that the people who you hang with rub off?\nIs that why me and Violent J love cutting bitches heads off?\nImagine everytime you woke up, you was gettin choked up\nAnd had to grab a shank and slit a throat up\nThe type of shit that most people call unreal\nBut it's the thing that makes you feel the way to deal is just to kill\nCrazy ballistic cause my head is untrained\nWith the empty fuckin wallet so there's so much to gain\nIf I appeal to you do you think I keep it real with you?\nTurn your back and let my hollowpoints drill in you\nWhat type of person do you think that I am?\nBecause we had a conversation and afterwards we shook hands\nDon't get it in your head that I would never hurt you\nCuz the ones that gettin shot are the ones that deserve to\n\n[Hook] -x2\nYou can't tell me anythang\nHollowpoints control the game\nI can tell ya once they're triggered\nThings will never be the same (Anybody Killa)", "year": "2003-04-08"}]}