{"songs": [{"image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "Don’t You Agree", "album": "40 Days & 40 Nights", "lyrics": "[XV talking]:\nAyo Esso! We got next!\n\n[Verse One] [XV]:\nDon't you agree?\nThat's it's pretty effin' cool to even know about me\nI thought that it was cool to say \"pretty effin' cool\"\nWhat about you?\nDon't you agree?\nHahaha\nNah, don't you agree?\nHip hop ain't dead unfortunately\nI respect Kanye West and Souljahboy get's props\nBut even if it's hip hop some shit's not hot\nHaha\nDon't you agree?\nObama winning an election is a sight to be seen\nBut I just think that day is really far\nAnd America is gonna see how racist they are\nNah, don't you agree?\nMaybe not but it's cool your ears is open to me\nCause I'mma speak for as long as y'all is scoping for me\nAnd I think that's awhile\nNow\n\n[Hook]\nDon't you agree?\nThere's a new day coming\nBetter get up, get out and get something\nVizzy in the house\nEsso in the house\nBoy what you talking 'bout?\nThe dopest niggas out\nHomie, don't you agree?\n\n[Verse Two] [XV]:\nMan, you gotta agree\nAye, I knew who I would be now you gotta just see\nMost of the time, I try to stay modest but geesh\nI kinda got swag, don't you agree?\nHa\nI'm playing but you probably agree\nCause I came into the game like a stain on a tee\nStanding out, mixtapes handing out\nGot the blogs buzzing cousin, this was all planning out\nIt's panning out, don't you agree?\nAnd I'm from a city they don't even know about G\nEsso's flow is more than Super Soda to me\nSo they don't know what to expect when they heard about me\nThey boy from KS, making hoes say, \"Yes\"\nBut only when I flow in a treat\nThe next kept secret, told the blogs, \"Don't peep it\nLeak it like a project ceiling, nigga.\"\n\n[Hook]\nDon't you agree?\nThere's a new day coming\nBetter get up, get out and get something\nVizzy in the house\nEsso in the house\nBoy what you talking 'bout?\nThe dopest niggas out\nHomie, don't you agree?\n\n[Verse Three] [Esso]:\nAye, what it do XV\nMr. Bourgeois Z\nMoney back guarantee so bet the house on me\nName on the marque so let me brush the debris\nOver the shoulders of the tee custom cut for me\nAye man these niggas can't touch me, call 'em amputees\nGot this shit on super lock like a skeleton key\nFlow's so control B niggas control C\nIt's all good, hope they stack up for lawyer's fees\nCopywrite infringers, better yet pretenders\nThey all posers, sheeps in wolf's clothing\nSee, I do what I do cause that's me\nThey syndicate that like O.T.B\nI guess that would make me Will the Fresh Prince\nJust four letters difference, you catch drift?\nI'm way past where you hope you agree\nCause I'm pretty unique vocally and focused indeed\n\n[Hook]\nDon't you agree?\nThere's a new day coming\nBetter get up, get out and get something\nVizzy in the house\nEsso in the house\nBoy what you talking 'bout?\nThe dopest niggas out\nHomie, don't you agree?"}], "artist": "XV"}