{"songs": [{"image": "https://images.genius.com/18474c48d796d3105ce95648ad3902a6.1000x1000x1.jpg", "lyrics": "[Intro]\nHey\nAyo, Sap! What's good, bruh?\nThis man is kinda high over here *Laughs*\n\n[Verse 1]\nAyo, the flyest ma'fucker in the room, yeah, you know it's me\nBitches hatin' on him ‘cause he started out here locally\nHopefully I'll be at the top soon\nFor now I'm at my house on the couch watchin' cartoons\nYou know how much you love it when you get it in abundance\nGive a fuck about a budget when you always be the subject of discussion\nBut it's nothin' when you stop and just say fuck it\n‘Cause you walkin' out in public and you hear them talkin' rubbish\nI just wanna ride, ride through the city in a Cutlass\nFind a big butt bitch somewhere, get my nuts kissed\nThat's the way it goes when you party just like I do\nBitches on my dick that used to brush me off in high school\n\n[Refrain]\nTake over the world when I'm on my Donald Trump shit\nLook at all this money! Ain't that some shit?\nTake over the world when I'm on my Donald Trump shit\nLook at all this money! Ain't that some shit? (Hey)\n\n[Chorus]\nWe gon' take over the world while these haters gettin' mad\nThat's why all my bitches bad, they see this crazy life I have\nAnd they in awe, we gonna win, you can take the lose or draw\nWhat I'm in got these hoes who used to play me in they bras\nWe gon' take over the world while these haters gettin' mad\nTake over the world, watch these haters get mad\nThat's why all my bitches bad, they see this crazy life I have\nHop into the car and then we take 'em to the pad, it's a wrap\n\n[Verse 2]\nUh, uh, uh\nAnd ma'fuckers think they know me, but they never met the kid\nStyle come with excellence and money make benevolence\nIrrelevant for the fuckers who never been intelligent\nI kill my Henny, break the bottle for the hell of it\nTell a bitch that she better bring a friend\nAnd if she want an autograph she better bring a pen\nYeah, the party never end, this life is what I recommend\nAnd if you got a ho picked for me then she better be a 10\nI ain't picky, but these girls be actin' tricky\nWhen the situation's sticky and the liquor got 'em silly\n\n[Refrain]\nBut I take over the world when I'm on my Donald Trump shit\nLook at all this money! Ain't that some shit?\n\n[Chorus]\nWe gon' take over the world while these haters gettin' mad\nThat's why all my bitches bad, they see this crazy life I have\nAnd they in awe, we gonna win, you can take the lose or draw\nWhat I'm in got these hoes who used to play me in they bras\nWe gon' take over the world while these haters gettin' mad\nTake over the world, watch these haters get mad\nThat's why all my bitches bad, they see this crazy life I have\nHop into the car and then we take 'em to the pad, it's a wrap", "year": "2011-02-08", "album": "Best Day Ever", "title": "Donald Trump"}], "artist": "Mac Miller"}