{"artist": "A$ton Matthews", "songs": [{"title": "Days Like This", "image": "https://images.rapgenius.com/0f90a362c38fface8bb85fdf5e25ca63.600x600x1.jpg", "album": null, "lyrics": "[Verse 1: Izaq Roland]\nFirst of all, let me start by saying this\nI been dealing with a whole lot, that's for sure\nAll I know is go hard or go home\nI ain't going back, no no no no\nIf it gets hard then I just go harder, i was soft until I hit the water\nI can break down, baller, fuck that, uh uh\nStraight out the pond, call it pipe dream\nBut I am not Spike Lee, this ain't do the right thing\nFuck being local, im thinking global, what is your pride?\nYou ain't 'bout  nothing, you just be fronting\nHow you not tired from running your mouth?\nThey looking all in my direction, so I had to grip on my weapon\nThey feel my pain from watching\nHow long 'til you get to stepping it?\nThat happened where I'm from\nWhere would I been?\n[?]\nLook, I do this for my sisters and brothers\nYou ain't shit if you ain't have to struggle\nThey dont like me im like fuck em\n\n[Hook: Izaq Roland]\nWhen there ain't no food in the kitchen\nI done seen days like this\nDays like this, I done see days like this\nThe clientele ain't be hittin\nI done see days like this\nDays like this, I done see days like this\nThere ain't no room for the depending\nI done seen days like this\nDays like this, I done see days like this\nI done see days like this\nDays like this, I done see days like this\n\n[Verse 2: A$ton Matthews]\nI pour up again and again, treatin' the drought like a drizzle\nI split that band down the middle\nI be on percocets more than a little\nHold up let me get that motion\nI'm bussin' I'm bussin'\nHold up I'm bussin' I'm bussin'\nSlaughter your daughter its nothin'\nPassin her round to my niggas\nThey done been down for some years now\nSome of them doing years now\nThree different highs like I'm in the matrix\nShoot your grill off for them fuckin' franklins\nBoy I'm bout done with my fuckin' patience\nGot your main bitch sittin on my waitlist\nTake that lil bitch when I'm ready\nFuck her like we going steady\nShe gon' leave me when I'm ready\nI run that shit like its nothin'\nI remember when there was nothin'\nMamas, daddys, sisters, cousins\nAll in the same house but this ain't no safe house\nCouple primos up in the pinta and I'm on the same route\nThink about if it was you\nCame from over that border, no papers to prove\nYou tell me what you would do\nThere ain't no food on the table and nothing to lose\nSummertime head on the roof\nYou either bangin' or slangin' or in the dirt\nI did two out of three when flipped the work\nI'm talking Michael Jordan with the Larry Bird\nI connect dots for the triple-double\nTriple my cut so the zeros double\nDance with devil that cupid shuffle\nStevie World until I'm in a duffle\n\n[Hook: Izaq Roland]\nWhen there ain't no food in the kitchen\nI done seen days like this\nDays like this, I done see days like this\nThe clientele ain't be hittin\nI done see days like this\nDays like this, I done see days like this\nThere ain't no room for the depending\nI done seen days like this\nDays like this, I done see days like this\nI done see days like this\nDays like this, I done see days like this", "year": "2016-04-21"}]}