{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/5b472f0faec75a7ea8e5ca246c5f8acf.1000x1000x1.jpg", "title": "Ein Sof (Paradise)", "year": "2012-01-01", "album": " The Psychic World of Walter Reed", "lyrics": "[Intro: Killah Priest]\nThis cigar's good\nI’m gonna tell a story\nYeah, that's what we’ll do\n\n[Verse 1: Killah Priest]\nAt night the lepers break into the temple\nAnd drink the sacrificial vessel dry, a condor into the sky\nCigar smoke reverse in front of my eyes\nBack into my mouth, the fire goes out\nMy room turns black, the Moon gets fat\nBeneath it there are secrets, dealers with crack\nKillers with gats, hoodies and cap, I’m out of body\nI become the streets breathing through the sewer hole\nI am the belt that shooters hold\nI became the building that’s chilling, Murals, R.I.P\nAcross my brick stomach, someone’s coming\nBarely could hear what their lips are mumbling\nThey stash a bag between my bones\nSuddenly, I am the bag, holding three crystal stones\nThe crack inside me yelling they can’t breathe\nI tried to use my cemented abdomen to push them free\nThey told me if they find their supplier, he usually finds a buyer\nThen it’s off to the Lighter, the tube of Fire\nThey said then we become as One\nWe transform into something strong, a gas, toxic form\nFrom solid to killing brain cells\nIt’s insane in this hell, so please free us\nFall upon us, crush us to Dust\nJust then two fingers grabbed him, one wore a ring\nI became a sleeve, the wrist spoke to me\nHe said his hand's about to freeze\nHeard a conservation between a ring, told a story of a finger\nWho pushed the trigger for them little killers, we call them rocks\nHis hand got hot, I became as hard as liver\nYell, \"Stop!\", he's riddled from shots\nHis turned dark, I woke up and lit up a bark\n\n[Hook: Killah Priest]\nGlory, money, judgement, fame\nDemons, temple, alter, the flames\nParadise, Ein Sof Paradise\nThe Glory, the money, the judgement, the fame\nThe Demons, the temple, the alter, the flames\nParadise, Ein Sof Paradise\n\n[Verse 2: Killah Priest]\nWhen I sleep I dream of deers, a black forest. rivers of blood\nPentagrams on the mirrors of thugs\nScary mares of my enemies filling me with slugs\nHaunting my memories, it’s the misery I love\nI wake up with prayers under my breath\nMake sure the stairs is under my steps\nLately I’ve been writing pages under distress\nI want to see the new life that’s promised\nI want to see the men who lived honest\nI want to see the things of Nostradamus, Prophet Muhammad\nI look around; all I see is garbage\nKid searching through a dead man’s pockets\nThe projects, we try to survive\nWhy we only ask questions when we high?\nI want to see the Messiah's enthronement\nI want to see the peace and light on the night of atonement\nI want to see Heaven on Earth, the afterlife the rebirth\nThe Nazarite bring Peace to our turf\nI know the Devil want it all reversed\nIt’s all up in the Universe, but you have to some research\nIf you a leader of your crew, they wanna kill you\nYou see higher than your team, they wanna shill you\nIf you talk about the problems in your hood, they wanna replace you\nIf you try to do good, they gonna hate you\nWith this mindstate, what do you do?\nWhat path do you choose? Either way you have to pay dues\nThey say we all born to lose, we're set up to fail\nI’m on my roof top, \"Victory!\" I yell\nLike Obama did it with the girls and Michelle\nI look at this government and load up my shells\n\n[Hook: Killah Priest]\nGlory, money, judgement, fame\nDemons, temple, alter, the flames\nParadise, Ein Sof Paradise\nThe Glory, the money, the judgement, the fame\nThe Demons, the temple, the alter, the flames\nParadise, Ein Sof Paradise\n\n[Outro: Killah Priest]\nUh, Let us pray\nA story of a man, who told a story of another man\nWho told a story of another man\nEin Sof, Keter the Tiferet\nYou know, the tree of life inside the tree\nLook inside"}]}