{"artist": "Andy Mineo", "songs": [{"title": "No Tombstone", "album": null, "year": null, "image": "https://images.genius.com/7554caaed04426a275c43d0f5816b5a1.620x620x1.jpg", "lyrics": "[Hook: Andy Mineo]\nSo bury me with no tombstone\nCause I don't care if they know my name\nTo Christ be the glory, let my life story show his fame\nAnd if I don't represent, I know my whole life's been in vain\nSo Lord what I'm asking for is your strength to endure\n\n[Bridge: Andy Mineo]\nStrength to endure this present pain, yeah\nStrength to endure this present pain\nOh Lord how I need you more and more and more\nMore [x12] (I need you more)\n\n[Verse 1: Andy Mineo]\nUh\nLord your strength is what I'm needin'\nI want to see your face, I need grace in this season\nCause lately just praisin' ain't bein' so easy\nLike my hands weighed down with the cement\nI see them heathens puttin' weed in the spliff\nThey tell me \"Drop Jesus, all you need is some of this.\"\nWell, sometimes I want to give in, I admit\nJust creep with a chick, make money, put that beat in my whip\nBut then I think about the Lamb beaten and whipped\nAnd how them fleetin' pleasures can't compete with the gift\nOf sweet salvation, they put nails in his wrists\nSo between me and God all that beef would be switched\nLord, I need your strength in the midst of this storm\nI read this, \"in my weakness then I am made strong?\"\nYo, I want to know what it means like never before\nSo I seek your presence with my head to the floor\nI need more\nMore [x12] (I need you more)\n\n[Bridge: Sheena Lee]\nI need so much more\nI need so much more of you\n\n[Hook]\n\n[Verse 2: Andy Mineo]\nUh\nLord your strength is what I need right now\nCause every morning I wake up, I'm laying my life down\nFor the sake of the Gospel, compelled by your love\nSo, when my mouth don't speak, I hope my life does\nWhen my mic's unplugged and I ain't rockin' stages\nWhat will people read when they see my life's pages?\nChrist and his greatness and desire the same?\nOr a man who was once on fire, but never was again?\nI seen so many men of the faith, fall on their face\nAnd I know the wickedness of my own heart's so great\nSo I'm begging for your grace, for the day that I was saved\nI need strength to perservere until the end of this race\nI need\n\n[Bridge]\n\n[Outro: Andy Mineo & Sheena Lee]\nI said I need you more\nI said I need you more (yeah)\nI said I need you more\nYeah (I need you more)\nCome on (I need you more)\nCome on (more of you)\nCome on, yeah"}]}