{"songs": [{"year": null, "title": "Lames", "image": "https://images.genius.com/9c2849cfac5218c726612b73adab589c.300x300x1.jpg", "lyrics": "Yea\nShout out to Scram Jones!!!\nClinton Sparks in the building\nIT'S SMASH TIME!\n\n[Verse 1]\nIt's nothin for me to roll wit twelve fire arms\nThe kid got more beef than Hillshire Farms\nBut I ain't gon turn my shit into sausage\nI'm gonna turn my beef into some coffins\nFlow so sick I'm nauseous\nI ain't signed yet, cause labels makin me BS often\nI don't care, it's all they losses, the price only gon go up\nNigga im gonna blow up, American Music Awards, yea I'm gon show up\nWhen I win one of them, I'm gon throw up\nYup, right on whoever's in front of me\nCame from the P, ain't nobody in this bitch that can front on me\nAin't nobody sonnin me, I'm under my own wing\nA.B. nigga, yea I'm runnin' my own thing\nSmile everytime the phone ring, cause I know it's money on the other end\nNot my homie lover friend\nGotti bring the shovel in\nI'm buryin' these niggas careers\nTo me it appears they all queer\nThey what we call pimps, we need more squares\nWho wanna holla back? In fact I'm all ears\n\n[Hook]\nThese lames (these lames)\nThey fuckin' up the game\n(Niggas fuckin' up the game, said these lames fuckin' up the game)\nIt's a shame the way that things change\n{Repeat}\n\n[Verse 2]\nWhatever you wanna know about Saigon\nGo to what type of thug are you w.com\nBeen through the fire like Chaka Khan\nSeen all of the stop signs but to me them jokers was just octagons\nCouldn't tell me I was not the bomb\nAnd the nigga couldn't fight but I was quick to cock a nine\nNever quick to drop a dime\nEven though niggas dropped dimes on me bout fifty-eleven times\nPrimetime, this is a fine time to rhyme\nIm feelin like a million, word to my mom\nIm glad all of yall niggas chasin' a dame\nI'll DMX the game wit no sets to claim\nNo dog on my back wit jail bars on my arm\nWar scars on my heart from gettin' it on\nCoxsackie nigga, they back me nigga\nThey feelin my tracks in Clinton max\nI fuck around and go platinum off jail niggas alone\nWhat up Nap-Nap how y'all love that?\n\n[Hook]", "album": "Swizz Beatz Presentz: Abandoned Tracks Vol. 1"}], "artist": "Saigon"}