{"songs": [{"lyrics": "[Intro: Action Bronson]\nBody needs a bat and a black leather to record\nHere, take it, get ready\n\n[Verse 1: Action Bronson]\nAh, yeah, yeah, yeah, yeah, yeah, this is it, ah\nThe eighteen-wheeler papi, we'll drive it through your living room\nWhile you watchin' Maury, true story\nUh, jump in the pool with the tool on me, shredded 240\nWho gon' stop me? You and whose army?\nBronson come with the ninja grip\nWheelin' red ninjas down the strip\nPhillies to my lip\nHigh as Dark Knight, fuck it, let the card swipe\nI'll take that yellow Lamborghini on the far right\nAs if I fit it\n100k for me to spit it\nI'm bout' to take a shitted on your fitted with no good luck\nJust tragedy and hardship\nAnother loser on the corner doing card tricks (Ah)\nI'm on the plane to Russia with a hard dick and a tank top from Target\nWhy this blunt taste like Starburst?\nAnd why your girl cheating on you with a player from the San Diego Chargers?\nMotherfucker, somehow we got Jeeps in jail\nTell the judge, \"It's all good, go 'head and keep that bail\"\nIt's me, you can't touch me\nLike Hammer, shit gets crunchy\nI do it for the glamour\nI do it for my mama\nI do it for my people\nI do it for myself because there should've been a sequel\nBut there was complications during, birth given, damn, man\nAnother night the Moon's shinin', the Earth twistin'\nBoo, listen, Daddy swerved the coupe with conviction\nGuns under the pillow like my tooth missin'\nEverybody know it's me 'cause the roof missin'\nYou can see my smile from a mile\nYeah\n\n[Verse 2: Big Body Bes]\nOooh, I'm up at bat!\nAlbanian baseball, I'm swingin' a hammer!\nFuck that!\nWe've been in the game our whole fuckin' lives!\nOnly God can bench us!\nYou was in the dayroom doin' splits!\nI told you stop blockin' the TV!\nI'm tryna watch Maury!\nAnd hang your fuckin' phone up!\nWe've been ballin' our whole fuckin' lives!\nYou talkin' to the P-A-L champion!\nI does this! Uh!\nFuck her 'til she hates me!\nYou gotta stab me if you love me\nI'm down to die\nYou're scared to live", "title": "TANK", "album": "Blue Chips 7000", "image": "https://images.genius.com/8b36a83780b8c85770c8ae21c12d19ad.1000x1000x1.jpg", "year": "2017-08-25"}], "artist": "Action Bronson"}