{"songs": [{"image": "https://images.genius.com/f00171f25728c65e5bf56b854ed47601.1000x1000x1.jpg", "album": "The Leftovers Unmixedtape", "title": "Contra", "lyrics": "[Verse 1: Danny Brown]\nFrom the hood where them niggas pack fullys\nTurn an ounce of reg to a cutty\nCount money with a 10 deep flannel on\nSB's looking like they been painted on\nJeans fitting like they was made for me\nYour pants looking like, they was hand-me-downs from your Daddy\nGet at me, my fit worth a stacky\nI'm in a Caddy getting head in the back seat\nRubbing on her yakki\nThen it start raining, when I start cumming\nSo now I'm brainstorming, on how I'm gon' run it\nAnd y'all like fags – pussy? You don't want it\nGosh darn it, got heat like furnace\nAnd I raise it like thermostat\nRolling that Thundercat kush look like Panthro\nHeard you grab your ankles, take it in your manhole\nThat's so disgusting, I think I just threw up in my mouth\nCan somebody pass me a towel?\nA wetnap or something? Nigga is you fronting?\nI beat you in your face, now your head like a pumpkin\nJack-o-Lantern, I'm Danny Tanner\nWatching that white girl, you a dry jheri curl\nYou worthless piece of shit\nYour baby mama begged me to suck my dick\nAnd I ain't gon' let her, she look like Predator\nYou a gay boy like David Archuleta\nContra, where niggas pierce armor\nIt's two niggas, two guns, blowing out your conscience\nYou see them chrome 44's, in this bitch with thirty men\nY'all niggas know the code like..\n\n[Hook]\nUp-Up, Down-Down\nLeft-Right, Left-Right\nB-A, B-A, Select-Start\n\n[Verse 2: Elzhi]\nWhen I write y'all, I blackout like nightfall\nI'm never shitted on like that flight stall, that's quite small\nYou wouldn't like me when I get gutter, it's the legit cutter\nAnd you ain't sharp enough to split butter\nI stack riches, throwing niggas in black ditches\nYou wack which is why you mixed up like when the track switches\nHand on my nuts like my sac itches\nLooking like The Mack, hitting 'lac switches\nHiding guns in my Abercrombie\nWith a dime piece, getting more brain than a zombie\nTimes 3, Ladies Love Cool J\nI need a bitch with more class than a school day\nI heard a fool say I wasn't in his top 3\nStepped off with a broke arm and a popped knee\nSee me and Brown is no regular team\nWe make the whole planet flip like Omega Supreme\nYeah, make 'em hype, yo I murder with this tight flow\nYou a typo, plus you suck like lypo\nI keep bodies hid, fuck a John Gotti bid\nTalk money, then we can chop it up like the Karate Kid\nBut don't think I won't clap and merk 'em\nInfrared, beam 'em up, I will Captain Kirk 'em\nAnd turn 'em to a brainless dodo\nAnd break 'em both, legs one and two, like when Kane was solo\nI'm snatching up his chains and Polo, the flow's fitted\nTo pose with it in the strangest photo\nI'm bumping blue genie, if your stacks is too teeny\nFirst you see me, and then you don't like I'm Houdini, nigga", "year": "2010-01-01"}], "artist": "Danny Brown"}