{"songs": [{"lyrics": "Cameras or guns one of y'all is gonna' shoot me to death\nJust know that shit\n\nI take it easy...(x4)\n\n[Verse 1]\nUpside-down I pick wings from beetles\nPry 'em out and pin 'em to the pole over the see-saw\nSofa cobra shimmy out crater\nCradle my weight in double wishbone suspension\nVersus AM clock radio bangers\n\nDownside-up in crippled acres\nAnd still the fountainhead spittles sniglets\nQuicker than quidditch seekers snatch golden snitches\nYou could be a part of it\nJust park your bark at 20 paces\nHold this target and we'll call this bitch a partnership\n\nMan! the city bred the brittle cheapo\nLittle Lego people squeezing little Lego Polaroid in keyhole\nMedia breather needy burrow to hide all\nWhile you friends and neighbors press stethoscopes to the drywall\nCurl a worm tongue tight, bitten behind the vamp chopper foaming\nLamb choppy sock puppet fear and loathing\nNeed phoners a.s.a.p. to build careers out of misquoting\nSo I read Aesop interviews and get schooled on my own motives\n\nIt's a pocketful of nickels, like Cool Hand Luke decapitating\nParking meters when the pigs blew the whistles like windmills\nI went to jail overnight for putting a sticker on a phone booth\nNow in the time that you did the paperwork\nHow many'd the rapists merk?\n\nPanicky banister silver surf over the wobbles where the potholes\nBe the ulcer in the stomach of the God show\nYou blinded by the light you might just plummet through the cosmos\nMeet Apollo sandman function before the whore hit the high note\n\n[Hook]\nI take it easy, the ice is thinning in the valley of the jeep beats\nAnd when the freaks come out I hug a TV\nSomehow a channel zero bender's less creepy, it's bliss\nRepeat with a twist...\nEa-sy\nWhen every martian in the market holler feed me\nThe all-city opinion spigot leaky\nYou learn more when your mouth piece retreat, it's bliss\nNow listen to this...oh OK\nAll day every day, oh all right, all night every night\n\n[Verse 2]\nWhose capitán gon' spew stale venom? Not mine...\nI hug a hammock in the bedlam\nAnd when the potentially lucrative race horse gets deaded\nI'll wake up for a second to help the betters count their blessings\nBut I cannot Cratchet crutch the Ebenezer limbs much longer\nFlaccid flimsy songbirds, classic dizzy wrong turns\nFor the long term got a dragon all achy\nTorn between the lending of a helping five knuckles\nAnd a charter your own escape\nNow it's like, sufferin' succotash, bucko, ducks in the chuckle patch\n10-4 on that, stinger operation, wingman double back\nFuck it, Let him roam the home of the mange ridden emaciated\nSlave pain cave children game\nNot all players heal the same!\n\nLearn it or don't learn shit\nMy radio is on regardless\nI tune out pardons and tune in starlets\nCarbon and pre-David/Goliath live Paleolithic bias\nWho walks on all fours dragging the cadaver of King Midas\nNow it's Thor dwarf war hammers, Elvin bow and arrow aimers\nDocumentation of the rate at which narrow tapers\nHermit crab, honest cat, trying to raise the roof in my own TV room\nAnd still get the security deposit back\nCall Ripley, Skippy\nMotorhead dope fixture on some 'Go to bed, no dinner!\nHold your head, cold winter!'\nEase up out of the ghastly, desert dozer cliques stranded on cloud 8\nProud of their pogo sticks, I stay left\nAlong came a spider, sprung and alert, I stay def\nHe makes records with his tongue in the dirt\nSuffer the dirty earth crisis with a license to flirt\nBuffer the mighty tighty sequins with a price on the merch\nCovert Mr. Blizzard shoulder, he always acts all pissy\nPlus your friend said I was an asshole when he met me\nNo bad moods aloud when you're in the public eye\nKill it, you are the weakest link, goodbye\n\n[Hook]", "title": "Easy", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}