{"artist": "Inspectah Deck", "songs": [{"title": "Forget Me Not", "lyrics": "[Intro: Inspectah Deck, (Unknown singer)]\n(Baby...) Bitch! You know what I want!\n(Sweet love.) I wanna talk to Sampson\n(Girl... sweet love.. feel.)\nI want yo' sweet ?\n(Yeah, baby. Sweet love.)\nYeah, BBC status. (Girl.)\nMockin' birds like Zorro\n(Feel... baby.. sweet love.)\n(Girl... sweet thing... feel what I feel?)\n\n[Verse 1: Inspectah Deck]\nGhetto princess told me she settled out in Flushin' Meadow\nFly chick rockin' size six stilettos\nDrapped-out in tailor made leather and suede\nA serenade for the moment, then we part ways\nWas a church girl, quiet at home, huggin' the pilow and phone\nNow you're grown, rollin' bones, holdin' your own\nI admire, attire be bold just like her attitude\nJewels from head to toe, glowin' natural\nI'm after you, your style's what I'm attracted to\nReally seem to keep it movin' when you do pass thru\nKnowin' when we bump heads, we will soon bump hips\nTo be swimmin' in an ocean of love that sunk ships\nHomin' with the tight grip, come thunderous\nTo wake up reminicisin' and spark the blunt clip\nHave you lovin' it, wonderin' if I shall return\nForget me not, enternally the flame burns\n\n[Hook: Inspectah Deck, (unknown singer)]\nForget me not (Baby, sweet love.)\nForget me not (Girl, feel what I feel?)\n(Baby, sweet love. Girl, feel what I feel?)\n\n[Verse 2: Inspectah Deck]\nLast August, I met this hard chick, caught a carbon pick\n'bout to visit her, man, in month six\nJust comin' home from a two year trip\nNow we 'bout to do two cause her man turned snitch\nShe under pressure, want me to come rescue her\nBut Inspectah is no haven for the rester\nI feel you breakin' out but it's the path you chose\nFuckin' your foes will have sons breakin' your nose\nSeen her once or twice now as weeks went by\nSlidin by tryin' to hide the black eyes\nLookin' right though, I might go for her seduction\nDangerous curves, I must avoid bein' sucked in\nLustin', I caught her at the function\nSlid out the side, saw the ride and jumped in\nLater on, the fox unlatched the black box\nGot her rocks then collapsed from the backshots\n\n[Hook: Inspectah Deck, (unknown singer)]\nForget me not (Baby, sweet love.)\nForget me not (Girl, feel what I feel?)\n(Baby, sweet love. Girl, feel what I feel?)\n\n[Verse 3: Inspectah Deck]\n(Last night...) changed it all, I had a ball\nFirst of all, I got an obscene phonecall\nAll I heard was heavy breathin', laugh sounds and moans\nAn intimate kiss followed by the dial tone\nRepeatedly, this person kept callin' my home\nGivin' graphic details of her sexual jones\nNo clue of who, must've been a total stranger\nAnnoyin' me, yeah, but talkin' me out my anger\nState your name and stop playin' games\nIf you wanna spark flames, it can be arranged\nOn your side of town, right around now\nWhat you workin' with, let me know how it's goin' down\nThen the phone clicked, then once again, it rang\nWith directions to the lab, where she's doin' her thang\nTo my surprise, when I arrived, she had her legs cocked\nI got her red hot and blessed the wet spot\n\n[Hook: Inspectah Deck, (unknown singer)] (*til fade*)\nForget me not (Baby, sweet love.)\nForget me not (Girl, feel what I feel?)\n(Baby, sweet love. Girl, feel what I feel?)\n\n[Outro: Inspectah Deck *in the background of the Hook*]\nYeah, BBC status\nMockin' birds like Zorro\nGive me a phonecall tomorrow", "image": "https://images.genius.com/19b06abfed788ae492f578fa0afb063f.1000x1000x1.jpg", "album": "Uncontrolled Substance", "year": null}]}