{"songs": [{"image": "https://images.genius.com/febfd26801370f428abaf79a6ab19d98.894x894x1.png", "album": "Detroit State of Mind", "title": "Broadcaster", "lyrics": "I done moved a lotta stones but I ain't an Egyptian\nI made work disappear but I ain't a magician\nI seen fiends lose weight offa crack nutrition\nI get them checks on the first like a monthly subscription\nThey holla at me every day because they need their prescription\nI'm like a male cheerleader: white girls are flippin'\nMake Christians lose religions off the shit that I'm spittin'\nI got families diminishin' offa what I'm distributin'\n\nFinishin' the gimmicks with the shit I'm deliverin'\nYou're about to go fast like Thanksgivin' chit-er-lins\nDon't end up a memory, niggas just rememberin'\n\nDeath anniversary, pourin' out some beer again\nTrue Religion jeans with the laced up Timberlands\nBucket seats, bucket hat low like Gilligan\nHit your baby momma, left her panties on the ceilin' fan\n\nSent her to voicemail, but she gonna call again\n\nBrown done came up and he won't fall again\nSpittin for the hustlers cause the words are the empowerment\nSmarter than those white boys in Ivy league colleges\n\nBut I used to move work to white boys in colleges\n\nMost you rap niggas lyin' like a horoscope\nHomie you homo like the Rocky Picture Horror Show\nSeats in the Chevy same color as a kiwi skin\nVoice of the hood, you rap niggas is CNN\n28 grams on my Grandma's saucer\nHeater on the waist, box cutter in the parka\nFiends at the door, Cold D up in lockup\nSmokin' on ganja, sippin' java from Starbucks\nChillin' with chicken, roll gan out dey purses\nBrowntown served more niggas than churches\nDie for your rhymes, then you wouldn't be worth shit\n\nBut to me it's real because I live my verses\nNo water in the house, underarm must\nPuttin' water in the toilet just to make the fucker flush\nI live too real for a movie\nSmokin' gan same color as a coochie\n\nDetroit. Streets. City. Broadcaster. Nigga\n\nHa!", "year": null}], "artist": "Danny Brown"}