{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nReady, willin', and able\nHere comes the new modern day Dark Gable\nOn the mattress and on the box springs\nGirls, they wanna sport me like bamboo earrings\nThe go-getter, the skins-hitter\nAnd if your girl says she met me, I probably did her\nWord up, the sex super stud\nI jump your bones like ten Crips against one Blood\n(Nasty!) The N-A-S-T-Y\nReady for action if you wanna see why\nSo come on, and let's do this\nAs I tiptoe through your tulips\nLike Moses, I part them legs like the Red Sea\nAnd then I plant somethin' deadly\nPoundin' and poundin', is how I'm servin' this\nMakin' it look like your bed is goin' through turbulence\nLots of lust, between the two of us\nThe sign on my Jimmy says, \"Kidney's or bust,\" so\nI shove deeper than the voice of Barry\nTo make you hit high notes like Mariah Carey\nIt's like a Morris Day jerkout\nTo put you in more positions than a Jane Fonda workout\nI'm ready to tear down walls\nYou say let's chill, but to hell with that\nI'm not Aaron Hall, so...\n\n[Hook]\nGive it to me, give it to me\nGive it to me, give it to me\nGive it to me, give it to me\nGive it to me, give it to me\n(Give it in)\n\n[Verse 2]\nI paid the cost to be the boss\nLike with that HIV rumor they tried to toss\nBut I'm so good with the women that if I ever caught AIDS\nA woman doctor'd find a cure just so she could get laid\nSo never fear my dear, just come on over here\nI practice safe sex, with girls I lay next\nIn other words, the J-hat's on the head\nCause I'm too sexy for AIDS like Right Said Fred\nSo can I touch you there, huh? Huh?\nI like to take my, time, whenever, I'm\nMassagin' my fingers through a girl, ooh-wee\nI leave her wet, just like her beaver had a Jheri curl\nThen I begin to hit those skins\nSo baby doll, let let me in\nAnd if you're the slight bit tight from virginity..\n.. vaseline on me!\n\n[Hook]\nGive it to me, give it to me\nGive it to me, give it to me\nGive it to me, give it to me\nGive it to me, give it to me\n(Give it in)\n\n[sample of a sex scene from a movie]\n\n[Verse 3]\nJust another pervert that loves to flirt\nWith a skirt so at a concert, girls stay alert\nCause I be hoppin' on 'em just like a frog\nI run through, a Luke video, like it's a smorgasbord\nI start sweatin', my back gets to humpin'\nThen I thump and I thump and I thump and I thump\nI don't carry a gun but I'm packin' somethin' lethal\nOne of the last she-BOINKIN people\nSo come on Miss Thing don't front\nYou got me on a hunt, and you know what I want, that\nU-S-S-Y, wait, that's not the way, oh\nPass the Peas like they used to say!\nAnd when I give you this fat one\nYou gotta guard your grill, honey\nNonononononono, not that one..\nBecause I give girls the grand slam\nI'm like a radio station; continuous jams\n\n[Hook]\nGive it to me, give it to me\nGive it to me, give it to me\nGive it to me, give it to me\nGive it to me, give it to me", "image": "https://images.genius.com/b6cc17d62fd6810516cc285d9804a8ab.1000x1000x1.jpg", "year": "1993-05-25", "title": "Give it to Me", "album": "Looks Like a Job For..."}]}