{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Intro]\n\n[Verse 1]\n\n[Mr. Eon]\nI'm feeling lucky today, gonna picture my dome mention\nLight a whole bitch and get this dough then I'm going fishing\nCall my local waves, tape it and make paper and cheese\nTop of the third, down 15 G's\n\n[R.A. The Rugged Man]\nI be the big time neighborhood bookie, looky here already\nI don't trust you, let's make that one thing clear, okay?\nWall Street rich boy, get off my dick\nI'll place this one little bet for you, but then that's it\n\n[Mr. Eon]\nTimes are a lot, need I say anymore?\nTo the crew in last night, Doc was sniffing the scores\nDouble or nothing, we'll make this dough back\nWhile the radio listening it, we're knocking this coke back\n\n[R.A. The Rugged Man]\nI'll tell you this, you better not be trying to get over\nI don't really feel comfortable, I don't know ya\nMikey Frankie vouched for you, said you's good people\nBut if you don't pay your debts then I'mma come see you\n\n[Interlude]\nWhat you wanna do?\nI wanna get paid\nThe series has got to last 7 games\nWanna make a smart move?\nLeave it on the Mets\n\n[Verse 2]\n\n[Mr. Eon]\nGot people in the office taking the Mets\nPut their paper on L.A., now betting what they paid\nWifey at home is getting all nosey\nSuppose she know I'm flirty, she's deep in the Jonesy?\n\n[R.A. The Rugged Man]\nWait a sec now, hold up, not so fast\nFuck this double or nothing shit, I want my cash\nIf I don't get my cash then your ass is mine\nI'mma place this here bet for you this one last time\n\n[Mr. Eon]\nA strong man is about to bust out the [?]\nA couple'll get pumped, Jonesy ain't no punk\nWhat the fuck am I into? I'm a family man\nSnorting the mortgage, ain't this a nice portrait?\n\n[R.A. The Rugged Man]\nYou a ignorant, gambling fiend\nWhy you wanna lose all your green? Fuck the Dodgers\nThey got that crackhead strawberry playing on their team\nThe only way they're gon' win is if it's in your dream\n\n[Interlude]\nOh, you got the money?\nThis ain't no fucking joke anymore, seriously\nJust put a $120,000 on tomorrow's game\nIt is close already, that\n\n[Verse 3]\n\n[Mr. Eon]\n''That's it'' was written on the wall in graffiti\nMy insurance, a one way ticket to Tahiti\nThe media says series is tied up, I'm flied up\nAll I can see is Jonesy firing me up\n\n[R.A. The Rugged Man]\nListen, you faggot, and you listen good\nI wanna make sure that it's understood, we don't play this shit in the hood\nI'mma let of lead in your head soon\nBloodshed soon, blood-red soon, you gon' be dead soon\n\n[Mr. Eon]\nNah, I got this, nobody is coming back for free, yo\nIt's not gonna be down 12-hundred in C-notes\nDon't got that, I'm praying Dodger blew\nA bum out of luck, what's a man gonna do?\n\n[R.A. The Rugged Man]\nTwo in the morning, time to handle my biz\nIt's 2:15, I got my boys and we up in ya crib\nThey put a slug in your wife, I put a slug in your kid\nWas you really that stupid, thought I'd let you live?\n\n[Interlude]", "title": "Betcha Life", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}