{"artist": "Cage", "songs": [{"title": "I Hope You Die (I Really Mean It)", "album": "Purple Rain Mixtape Vol. 1", "year": null, "image": "https://images.genius.com/c61b13836692d4b169145fab7004533b.480x360x1.jpg", "lyrics": "(No autographs, no autographs all right, no autographs)\n\nBow down before your false Gods (fuck that)\nA lot of ya’ll harvest some real hatred for motherfucking celebrities out there, know what I’m sayin’? Ya’ll ain’t got the balls to say it I’m gonna say it for ya’ll, fuck that!\n\nThis is me uncensored, just let me vent this\nEverything I’m ‘bout to say to ya’ll\nI hope Ben Affleck goes Patrick Bateman\nAnd cuts J-Lo’s ass off (I really mean it)\nI hope Madonna’s killed by Palestinians\nOn webcam in front of millions (ha, ha, ha)\nI wish the real world was like Vice City\nSo we could start shootin’ cops\nI want to squeeze some tits\nI want a thousand Pits\nSo I could fight them at the same time, bitch!\nI hope Chris Palko fucks Gwyneth Paltrow\nThen tells her what a slut she is (ha, slut)\nI hope Kobe goes to jail for the rest of his life\nAnd Shaq fucks his wife (ha, ha)\nI hope Mike Tyson kills Lennox Lewis\nBut not in the ring, in his house\nWith a knife\n\nI know ya’ll tired of these mildly talented false Gods\nAnd if this shit comes back to me, I don’t give a fuck!\n\nI hope Christopher Reeves walks again…\nNah, matter of fact, I don’t\nI hope The Matrix 3 flops\nAnd Martha Stewart’s shanked in prison\nAnd bleeds out her box\nI hope John Travolta’s plane crashes into Oprah\nAnd Ricki Lake is killed by a cobra\nI hope every kid that downloads my music\nGets a virus and a subpoena (mom!)\nI want to see Tony Soprano get whacked\nThen James Gandolfini have a fucking heart attack\nI hope Gary Coleman makes a comeback\nAnd each one of my ex’s marries a scumbag\nI hope Bruce Willis butcher Ashton Kutcher\nAnd tell the world that his ex-wife’s a hooker\nI hope each one of my enemies catches Aids or cancer\nAnd Rosie O’Donnell’s mauled by a panther\nI hope her titty twitches\nI hope each one of ‘em Sex and the City bitches\nWind up with fifty stitches\nAfter their autopsy, I’ll be getting zooted\nI hope the whole cast of Friends is executed\n\nI want to see the red carpet red from BLOOD (word)\n(Oh, take me my picture!) Yeah I hope they take your picture\nOn the fucking coroner table, bitch!\nDon’t look at me with your mouth open, bitch\nUnless your stupid ass is choking to death\n\nI want to see the Hilton sisters abducted by drifters\nAnd wake up with oozing blisters\nJust keep it in perspective\nI hope Anna Nicole Smith’s tits rupture and get infected\nHelp me count the losses\n(I hope that) Schwarzenegger elected and assassinated first day in office\nLet’s hope Harrison Ford’s stamina folds\nAnd he collapse before they make Indiana Four\nFuck the bloopers\nGeorge Lucas murdered on the set like\nBrandon Lee but shot by Storm Troopers\nLet’s hope Michael Jackson spends his last million\nGoes bankrupt, and is killed by his children\nI hope the US takes over the globe\nSo I could tell non-conspiracy heads “I told you so”"}]}