{"songs": [{"title": "They Hating", "album": null, "year": "2013-12-06", "image": "https://images.genius.com/334d02ee258544e3ac2bc2392d939fb5.405x405x1.jpg", "lyrics": "[Hook]\nMan these niggas hatin'\nMan they hatin'\nMan they hatin'\nI swear these niggas hatin'\nSwear they hatin'\nSwear they hatin'\nSee me getting money, man I know them niggas hatin'\nLookin' at me frontin', man I know them niggas hatin'\nMan these niggas hatin'\nMan they hatin'\nMan they hatin'\nI swear these niggas hatin'\nSwear they hatin'\nSwear they hatin'\nSee me in the foreign [?] man these niggas hatin'\nKnow I got the best [?], so these niggas hatin'\n\n[Verse 1: Lil Scrappy]\nH-H-Hatin' on my IGP, hatin' cuz' a young nigga rich\nHatin' cuz I fucked this bitch, hatin' on the tip of my dick\nBeen hated on since kindergarten, [?] for this foolishness\nDon't get me started, I get retarded, I don't play around with that stupid shit\n[?] me a hookah, y'all really think ya supah\nGetting hated on in the parking lot and a real nigga might boot 'cha\nY'all all [?] like [?], I introduce ya to that [?]\nDon't look at me like Medusa, don't talk nigga just shoot [?]\n[?]\nYeah, that's real shit. Your mouth? I guess it'll peel quick!\n\n[Hook]\n\n[Verse 2: Lil Scrappy]\nHatin' cuz' I'm in my Benz, hatin' cuz' I'm getting them ends\nMad that a young nigga real, hatin' cuz' he just pretend\nAin't talking 'bout just anybody, but the temperature in-particular\nI don't just go up-and-down, I swoop the game [?]particular\nI'm like wow, hatin' on the internet... How? I ain't even made it yet!\nHatin' on that paper, but, now, I'm [?]\nHatin' from the inside, don't sneak this cuz' my eyes open\n[?]\nQuarterback, all in the zone now, your bitch she alone now\nBlackberry, still got that, that iPhone she copped that\nMacbook, we Skype chat, she show me pussy, I [?] back\n\n[Hook]\n\n[Verse 3: Young Buck]\nAll the shit I do, truthfully, man I'd hate me too\nMy jewelry gang brand new, a 100 bands just ran through\nCocaine in my house (Let's go!), they got my name in they mouth\nI got my clip hanging out, all my haters please bring 'em out\nMan, look at my bitch ain't she bad, look at your ho, I know you mad\nA big [?], I know you had, but look at these rack I got in this pad\nPut in on camera, let 'em go talk, show 'em that drop-top I just bought\nEven in bankruptcy, you couldn't fuck with me, I been [?] never got caught\n[?]\nRun your mouth, but I don't talk\n4 [?], I don't want\n[?] ain't got nothin' in the bank, I still got money in the bank\nI'm getting that check pointblank, man fuck what a hater think\n\n[Hook]"}], "artist": "Lil Scrappy"}