{"artist": "Peewee Longway", "songs": [{"album": "Long Money", "title": "36", "image": "https://images.genius.com/0dce6b1c38aad53374bd31b9e5884520.1000x1000x1.jpg", "lyrics": "[Verse]\nI'm in the pot with thirty-six Os\nThey cook on the stove (They cook on the stove)\nI got a grip, who want a boot?\nCome play with your nose (Come play with your nose)\nBaguette, it be gold, bust down AP\nCuban link, Mr. T, A*Team\nVVS make a bitch daydream\nTurn the trap house to the trapese\nTwo-two-three make you stampede\nGot rats in the pack and they uneven\nI'ma fuck bitches like on E\nI'm a dope boy like Young Jeezy\nGot bricks, they season, Kanyeezy\nOff-White drip like I'm Jesus\nFill up the cup like [?][0:33]\nRoll up the Runts, don't smoke Diesel\nWrist in the pot with the [?][0:36]\nMade a bitch [?][0:37]\nAK hit 'em, can't shit beat us\nDon't touch on [?][0:41] with them [?]\n[?] with a GT (Switch it up)\nI put the bags [?]\nBackin' up the mail truck, beep-beep (Stack it up)\nStack it up, the scale go, \"Deet-deet-deet-deet\"\n[?][0:49] and my shoes Chanel, CC (CCs)\nDraco came with titties and them bitch is double D-Ds\nVVs make your eyes blurry, it be hard to see these\nGot Cartier [?][0:58] like hardwood, can't see this shit with 3D (See these)\nStep on the brick with DG (Step on 'em)\n[?][1:02] came with three keys (Skrrt-skrrt)\nI double up pounds of [?]\nHit turbo when I'm in the GT\nStick came with turbulent two-two-three\nRun up the murder rate fuckin' with me\nMake 'em go vegan, we eat up the beef (Who want it?)\nGet off a bean then get off the leash\nLongway the dean, I'm comin' to teach\nI fuck a thot on the passenger seat\nI made a [?][1:16]\nFour pockets all filled up with guallo\nI bought that bitch a lil' body, let's fuck up the profit\nYou know it's gon' come in tomorrow\nI'm a the top of the mountain, just thumbin' and countin'\nYou know we gon' run through [?][1:24]\nHomie just got a lil' time, let's flood the yard\nYou know we gon' go through the guard\nLongway the valet the way that I park 'em\nCutters gon' cut through your head like a barber\nSharper, [?][1:31]\nI'm in the kitchen straight whippin' the raw\n[?][1:34] state of the art\n[?]\n[?]", "year": null}]}