{"songs": [{"year": "2014-10-28", "image": "https://images.genius.com/3b3104658adae3c195e20d5e868f7735.600x600x1.jpg", "title": "Gold Piece", "album": "If There’s A Hell Below", "lyrics": "[Produced By: Black Milk]\n\n[Hook: Black Milk]\nIn the belly of the beast\nI be in these streets\nJust a sinner with a Jesus piece\n\n[Verse 1: Black Milk]\nMore or lesser\nYoung reckless where adolescence lay out on stretchers\nThat was the message we were shown\nAt an early age yeah we was toned\nYou want in and I want in, you got three then we got fours\nYeah that homework never made it home\nBut street smarts was evident\nDown in them wet alleys instead of pep rallies and lettermans\nJackets that was packed with that black\nMetal strap up in that sack\nNever know who's friend or foe\nWho got your back? Black\nYeah they up out of that slump man where niggas get jumped for jumpmans\nYeah, broken home no father slums and the slaughters\nFrom here to holy water, on my forehead at the altar\nCause you know what they livin' like\nSo why even bother? Cause you know they ain't livin' right\nThey out here feeling hopeless they might never leave the bottom\nJust some little niggas out here facing grown man problems\nTwo big homie pull pull up, pull pull up up in that whip\nSay \"I'll throw y'all a few bucks just ride around with me real quick\"\nI know what that mean, pull up to the scene with a wild crew\nSurround dude screaming \"this is what it comes down to\", true\n\n[Hook]\n\n[Verse 2: Bun B]\nSo, this is what it comes down to?\nYou and a semi with gladiators around you?\nCan't identify the body how they found you\nIt's gonna take more than a stone pipe and the hounds too\nAnd a Dr. Watson\nWhen I hit your ass with hot ones courtesy of the shotgun\nReal nigga, you not one\nTrill niggas, you got none\nLeave your insides on the floor now you outdone\nSon, Imma tell you like your daddy would\nDon't play around with this boy gripping Caddy wood\nDon't try your luck if I roll through duck!\nCause it's shells on sale, more bang for the buck\nFuck!\nNo talk I want war with you\nNiggas say he want beef, let's have a barbeque\nAnd Imma give him a two piece and a biscuit\nThen we put the ox to his tail and cut his ass to the brisket, bitch\n\n[Hook]\n\n[Fade Out]"}], "artist": "Black Milk"}