{"artist": "Ace Hood", "songs": [{"title": "Go Mode", "album": "Starvation 5", "year": "2016-07-06", "lyrics": "[Intro]\nI told him right, right that shit, right\nI got it, bitch I got it\nSix I got it\n\n[Hook: Ace Hood]\nClub jumpin' once again, hydraulics\nI'm doin' numbers in the Benz, big body\nYou can catch me up in Liv poppin' bottles\nAin't trippin' over shit, I got it\nMy young niggas, they on go mode shit\nI know the shooters, they on go mode shit\nI told you niggas I'm in beast mode, shit\nNo bricks, we don't go slow\n\n[Verse 1: Ace Hood]\nAll gas on your dog ass, shit\nFuck who you know, you need a G pass\nMy little homies pull up quick fast\nExtendos with the ski mask\nNah, y'all don't really want that\nI can have them creep, they be in that all black\nWhere the weed at?\nI'm on the Beam back\nI got them diamonds on my collar playing freeze tag\nI'm in the club lit\nI'm from the 9 5th\nMy nigga Fat Boy don't trust you, I'ma squeeze clip\nCause that's my gang, gang\nWe gotta maintain\nJust know I'm king in my city like Lebron James\nThey call me Ace Hood\nYou know my face good\nI'm about to pop 100 bottles for the whole hood\nSo cut that hatin' bruh\nHood nation in this bitch, you can't fuck with us, gang\n\n[Hook: Ace Hood]\nClub jumpin' once again, hydraulics\nI'm doin' numbers in the Benz, big body\nYou can catch me up in Liv poppin' bottles\nAin't trippin' over shit, I got it\nMy young niggas, they on go mode shit\nI know the shooters, they on go mode shit\nI told you niggas I'm in beast mode, shit\nNo bricks, we don't go slow\n\n[Verse 2: Rick Ross]\nPhone call so I split another swisher\nLet down you niggas, when I'm always gon' deliver\nCounty jail kill you for a roll of tissue\nRolling Stone, time to grace another issue\n60 cars in my yard, I'm tryna touch 100\nHave a seizure, gettin' brain, shawty shakin' somethin'\nBreaking news, homicide, and that's just how it go\nMy nigga died in my arms, that's back in '94\nI'm tryna stay alive and ride like it's Makaveli\nLast boy crossed mine, them niggas wasn't ready\nI take this war shit deeply, this shit I enforce\nThey even fired 20 shots at my silver Rolls Royce\nNext mornin' shit, I went and put the rims on it\nDiss niggas and go get a few spins on it\nGood dope, you can always put a tan on it\nWayne came home and I put a Benz on it\n\n[Interlude: Rick Ross]\nYou wanna talk about doin' some real shit nigga. What y'all niggas out here doin' nigga. My nigga just came home from nigga doin' 17 nigga, came home to that two door brand new nigga. You can smell the motherfuckin' leather nigga\n\n[Hook: Ace Hood]\nClub jumpin' once again, hydraulics\nI'm doin' numbers in the Benz, big body\nYou can catch me up in Liv poppin' bottles\nAin't trippin' over shit, I got it\nMy young niggas, they on go mode shit\nI know the shooters, they on go mode shit\nI told you niggas I'm in beast mode, shit\nNo bricks, we don't go slow", "image": "https://images.genius.com/05c720ceb57343de52e1d6a34ad1186a.450x450x1.jpg"}]}