{"songs": [{"album": "Special Effects", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png", "year": "2015-05-04", "title": "Bass Ackwards", "lyrics": "[Intro: Tech N9ne]\nMange Strusic! Bang bou yitch!\nFollow me now see, check it out\nI say: this song is dedicated to the ball droppers\nBut I'mma switch the letters around and say drall boppers!\nWe coming to get ya so get the message to all coppers\nThat you need protection or you better have ch'all yoppers!\n\n[Hook: Tech N9ne]\nWhat a shame when a thang blast at ya\nCause you're lame, you a dame slash actor\nThese dudes are hoes, from screws to toes\nThey choose to go bass ackwards\n\n[Verse 1: Tech N9ne]\nTecca Nina bout to hit 'em wit the woop wop\nNow the barrel of my governor is hoo tot\nCause you the type that'll get your whole shew crot\nLoud mouth nigga tripping, thinking that he Putac\nGot a strong hand, I'm a mown gran\nLittle boy, now you fuckin' with the clong wran\nOh, you just showboating? It's over now, y'all can quit\n'Cause you can get it for something mere as shalkin' tit\nJust a cone phall, then it's on, y'all\nFuck around and get you dome sawed off a brone stawl\nI can't wait to hear you squeal and holler\nHow you set trippin' when you got a multi-dillion mollars, nigga?\nStupid, such a sucker\nNuck figgas always got to make a totha bruch her\nNever had no problem taking down another buster\n'Cause they be doing shit bass ackwards, fothermucka\n\n[Hook: Tech N9ne]\nWhat a shame when a thang blast at ya\nCause you're lame, you a dame slash actor\nThese dudes are hoes from screws to toes\nThey choose to go bass ackwards\nWhat a shame when a thang blast at ya\nCause you're lame, you a dame slash actor\nThese dudes are hoes from screws to toes\nThey choose to go bass ackwards\n\n[Verse 2: Yo Gotti]\nI'm Yo Gotti, the drug dealer\nI'm Yo Gotti, the thug nigga\nI'm Yo Gotti, my own hitter\nAnd if you wanna ODX, then say Yo Gotti the plug, nigga\nI've been getting money for a long time\nYou've been banging, throwing up the wrong sign\nPussy ass nigga, you a cross-gender\nFuckboy, you a ho, nigga\nAnd you remind me of my ho, nigga\nNothing I hate worser than a broke nigga\nGot a Tec-9, and an AK, and a FN\nGot a white Vette, and a white Ghost, and a white Benz\nI ain't running with niggas, 'less I'm getting money with niggas\nI don't act funny with niggas, keep it a hundred with niggas\nKept a thousand with niggas, I ran in houses with niggas\nI put in work with the squad, we even sold flour to niggas\nBut, fuck\n\n[Hook: Tech N9ne]\nWhat a shame when a thang blast at ya\nCause you're lame, you a dame slash actor\nThese dudes are hoes from screws to toes\nThey choose to go bass ackwards\nWhat a shame when a thang blast at ya\nCause you're lame, you a dame slash actor\nThese dudes are hoes from screws to toes\nThey choose to go bass ackwards\n\n[Verse 3: Big Scoob]\nBass ackwards, synonymous with rappers\nAll these niggas claiming, maintaining that they factors\nWhen'd you push a package? When'd you ever clap shit?\nAll these niggas talking ain't done nothing but this rap shit\nReason why I shook this place and had to find some space before\nI killed one of these rap niggas and ate they fucking face\nOutta place in this rap game, biggest mistake I ever made\nHit rewind and de-line, deleting everything I laid\nFar from a rap nigga, I don’t lie for fun\nFuck fame and fuck you, and fuck him, and her, too\nNina called the big dog, I had to breathe smoke\nBut Yo Gotti and Big Scoob and this ain’t 'bout dope?\nBass ackwards\n\n[Verse 4: Lil Wayne]\nThese niggas ass backwards\nShe let me hit that ass backwards\nPussy niggas act hard, get killed for bad acting\nTrigger man laughin'\nIt's funny how this shit go\nRedrum was the case that they gave me\nI sipped slow and stumbled down a slipped slope\nI could hide the chopper in the trench coat\nTunechi go berserk in this bitch\nSpelling \"stressed\" backwards, dessert with my shit\nI'm reversing this shit\nMy double R&R, I park on the curb in this bitch\nThe money, I'm submerged in this shit\nSo frankly, I'm stalking Ben Franklin\nI am Wayne Carter, oops, I meant Cayne Warter\nCocaine on back order\nFlip you ass backwards\nBitch, you are bass ackwards if you think that's awkward\nStrange Music"}], "artist": "Tech N9ne"}