{"songs": [{"lyrics": "[Verse 1- Aesop Rock]\nHey, yo, must not sleep\nI bash the bracket open and breach\nThe priority's bleached since that '76 umbilical severed\nMajorities cordially abhor the pinnacle vendors\nI got West Nile virus on my TV in the Bronx\nI got two hollow pockets and a sleepy hollow mosh pit\nTryin to blow the spot with wet matches and bottle rockets\nWhile cop walkie talkies squawk outside my apartment obnoxious\nTonight's special consists of stale fiber from shitty diner\nLook mom! I learned to tie my shoes! (Hey, can I borrow twenty bucks?)\nPeel back the prickly cocoon to Poloroid turbulent land unit birth\nStudent first pedagogue only from brazen action\nWind blown mariner east river shark parry lunge carry funk endzone caliber\nWatch war face painted jukies dance blissfully around a bonfire and sacrifice live sanity\nPay a nickel for nose-bleed seats in a peanut gallery\nGallop with a pegasus\nMalice with no benefits\nBalance with some sense of bliss and the foulest degenerates\nMy New Year's revolution's gon' be to stop burning bridges\nI'm just 'gon bend 'em toward the couple cats that's worth the visits\nAnd um, it's like that, and that's the way Aes thinks, and um\nPlans are like clipper ships, if they got holes they sink\nAnd if the skipper slips the crew shits bricks, wither, and hit the brink\nThat's why I take the poison's bitter sips and smile big when I drink\nYou never knew mayhem walked with Nikes, talked like a trucker, hawked the filibuster, Gerber baby lucid Colonel Mustards\nNo time to hold my breath (Nope!), I'm only here to rap, eat, sleep, grow old, and smoke\nStoges through the hole in my neck\nNew millenium, mad cows and Pentium, process the hostage, lock him in the petting bin\nShow him pictures of his wife and kids, then wash the brain\nProbably the same motherfuckers that buffed the trains\n\n[Hook 1] x2\nOkay, okay, okay, okay, okay, okay\nMust not sleep\nMust bash the bracket\nPay the rent, pay the debt\nMust slash the fabric\nCatch the jackrabbit\nPay the rent, pay the debt\nSleep...\n\n[Verse 2]\nRoll into the city with one half of the cannibals (whose that?)\nNew joint bumpin out the whip speakers\nMade the escape for a night of making tapes now it's back to the cockroaches and preachers\nSomewhere a prom queen's giving birth in a bathroom stall\nHauling a prime directive not to get blood on her mother's ballgown\nI'm son of a stubborn old one-track jackal\nBrisk, truckin' with prime directive just to get the goods and never fall down (Raw bomber!)\nAte the city, spit the bricks\nAte the boxcar, spit the burners\nAte the planet, spit the murder\nFunny farm brain patient writing rap for milk money, built ugly\nWith a couple side effects to make'em love me\nMy cipher demeanor left Jesus rubbin genie bottles\nTil the following morning Colombo found a crown of thorns in urine puddles\nYou're in trouble!\nI'm not trying to save the world, I'd rather watch it die slow\nSo I could spit my grand I-told-you-so\nAre we having fun yet?\nYup, step to the carnies\nTry to win a teddy bear to impress your favorite Barbie\nShe almost sucked you off at the company Christmas party\nBut she won't accept the bear 'til Aesop signs it with a sharpie\nMy ex-girl bounced without payin' the cable bill\nI checked myself in television rehab\nWithdrawal symptoms may include shivering, fevers, drooling and chronic masturbation\nNow I pray to the gods of pornography and Playstation (No!)\nNow I lay me down to sleep\nI pray the lord my soul to keep\nAnd if I should die before I wake\nGive my ASR to El and bury me with my mistakes\n\n[Hook 2] x2\nOkay, okay, okay, okay, okay, okay\nMust not sleep\nMust bash the bracket\nPay the rent, pay the debt\nMust slash the fabric\nCatch the jackrabbit\nPay the rent, pay the debt\nSleep...\n\n[Verse 3]\n...Bonus round\nThis is the hot tin roof stepper\nHold it down with centipede foundation\nMr. Greed who burns rugged obstruction in bunches\nLike little Jackie paper puffs the magic dragon in dutches\nWe don't need another hero homie, gallop off on your my little one trick pony holly hobby Polly Pocket pretty fuscia destiny\nIf the slipper fits fire up Cinderella propeller and curtsy for the munchkins right before\nAesop Rock smashed the pumpkin\nYeah, yeah, iron on gusto rustolium bloodstream what's better?\nWhen the wrist slit it leaks out only the bloodiest bubble letters\nComplete with outlines, fill-ins, dates, shading and shout out columns\nFor vagrant colonies to follow when redeeming bottles\nYou're a little tea pot trying to eavesdrop on the mammoth route\nPeaking out from the rosebush like (Uh-huh)\n\"Here is my handle (Ohh), here is my spout\" (Ahh)\nGodzilla jukie used to be in love, now out for gigapussy\nSorry to offend but sometimes life bends in the middle (Sorry!)\nSo now you have a fulcrum where there used to be a pillar (Right)\nAnd now I got a pulse that bumps less than a cocaine binger\nAnd now I got no nine to five and still labor days flicker\n(This kid is ill)and now I got a nine millimeter Q-tip with an itchy trigger finger\nSee, I really don't feel your persona distortion\nOrdered by martyrs who martyr self for martyr's sake\nWow fame. If notoriety grew adjacent to jealous dick-riding sentiments\nI'd give you a pound like, \"Greetings Mr. President\"", "title": "Bracket Basher", "album": "Daylight", "image": "https://images.genius.com/7aee135d16898a4fac2a490d41fb0b19.600x600x1.jpg", "year": null}], "artist": "Aesop Rock"}