{"artist": "Canibus", "songs": [{"title": "Get Off Ya Knees", "album": "My Name is Nobody", "year": null, "image": "https://images.genius.com/cd5a9585486bdc30b41a1ea1d3055714.500x500x1.jpg", "lyrics": "(Hook)\n\n[Verse 1: Canibus]\nGet Off Ya Knees!\nChange your style cause its time\nNigga's want me to rhyme pre-99\nNo-one can flow with Bis, Most people know this\nBut others just won't admit, They can't get over it\nRhymes I been known to spit, Mic's I been known to grip\nMakes me the Ultimate, God father over this\nI'm just a ghost of rip\nA soldier in this show business don't exist if he has no defence\nMy opponents are so intent, not to show respect\nThey fret cause I'm a global threat\nI'm so hard to catch, a cold with Caleb\nI relocate so quick they can't close the net\nI expose the press, dispose of the prints\nOn the loose again nobody knows what's next\nMy virus infects\nEvery machine with clandestine speech\nNigga Get Off Ya Knees!\n\n(Hook)\n\n[Verse 2: Canibus]\nYeah!\nHip-Hop's habitat, Rip the Jacker's back\nThis is battle rap, def while I master tracks\nI mix ant with thrax in your digestive track\nI suggest its wack then I side-step to the back\nI kidnap your X, For 10 million franks\nMake you shit your pants, you smell like septic tanks\nJust respect it man throw a fist in the air\nThe distance is Near, Armageddon is here\nI permeate UN-worldly planes\nAs they crash in the worlds that trades only my words remain\nAltruist Egoist - people are ignorant\nWhat is the meaning of meaningless meaningfulness?\nFormulas of primordial audio\n40 ohms of euphorial anointed flows\nIt was written so it shall be told\nGet off Ya knees, give me the microphone\nFucker\n\n(Hook)\n\n[Verse 3: Canibus]\nMy man-hood is massive, when it's not flaccid\nBis is real cool when he's not Rip the Jacker\nI am modernist, I am complex\nVicarious logic of bodily hardship\nBeat your ass till your teeth mash\nSand blast your face blow a breeze past, make you bleed fast\nE-K-G's beep fast, Doctors speak fast\nFor skin graft the patch over deep gash\nGive me details, how does meat smell?\nAfter a train derails into a field of gazelles!\nStep in the club; turn the crystal in your cups to red blood\nFuck Ya Heads up!\nSuspend me from the game don't mention my name\nImpossible Can-I-Bus drugs in your brain\nDon't be a schmuck\nYou act like a movie I've proved I'm the illest you cannot dispute me\nGet Off Ya Knees"}]}