{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg", "title": "Kid Cudi DJ Enuff Freestyle", "year": null, "album": null, "lyrics": "I'm just 2 steppin' where i'm at, cleveland city representer\nI ain't gotta play though, sippin on a yack that'll have a nigga lay low\nWhile i'm in my cutlass coupe, i'm [?][?] , they don't wanna see the cup i'm holding in my arm\nCuz i'm sippin yack, that'll have a nigga lay low\nI Swerve, wish a nigga would try to [?] i don't even trip of the word, i'm trying to do my own thing Spit it so sick it's so absurd motherfucker what's the word, G.O.O.D. Music up in this bitch. Talking that shit with kid cudi might of just been a myth\nUntil you see me in the flesh then you know who best i don't give a fuck about the shooter nigga wear a vest, aim higher kid cudi might just be your sire, spit hot fire rollin' in the bentley coupe and i got see through tires, i'm lying but that's how i feel when i'm so zooted smokin' on the kush i wish a nigga  would push man i'm what you might wish or wish you could be\nKid Cudi's back and i'm the product of the envy and i, i call it \"hey homie that is enough.\" DJ Enuff, niggas call me bluff cause they think that i'm not tough. I might be slim slim sliver but i'll get your girl and i will work, work her middle till she sings all my riddles my raps, she say she love my song \"Day 'N' Nite\" we pillow talk through the night, get your mind right when she go home to you, you kiss her on the mouth. You must not really know where her mouth was really bout at night last night. boy boy i'm in australia , i'm a day ahead of ya, i'm up in the future, real Mcfly. I need not to tell a lie, Kid Cudi back man, a reeler why? I am not just a one hand cuffed motherfuckers know that real shit no need to bluff just a cause it's stamped it's approved that don't mean i'm not hot motherfucker you need to move out of my fucking way i hit you with a [?][?] with \"pff ok\" have you lay down \"nigga what you say?\" cleveland city take ya'll niggas know i'm realer any given day. i be up in the[?][?] and the girls in the club they be wantin' new cock so i break em' off heavy in my old black chevy wish a nigga would [?][?]\nI'm just rappin' and i've just been dappin' ya'll niggas know i'm on my blackberry and i go \"let em' go\" and you can hit me on the BBM you can bring your girlfriend we gone get it poppin' and no stoppin' till the night will end now i'm rollin, poppin' pills, now i'm smokin heavy kush, yeah i'm high i'm high i fly and i tap dance on the cloud real talk bout' real niggas that's what i'm bout' cleveland city G.O.O.D. Music\n\nThey don't really have it because they cannot catch up, i'm a let these niggas know who is next up\nI should of been on that front cover of XXL, kickin' motherfuckers in they jaw bone to know a vail\nIf i go to jail Enuff is paying the bail or Kan Yeezy,  walking out in that yeezy, [?][?]\nTop that shit i get the groupies cause of yeezy, yeah they all please me. I don't give a fuck till they heard \"Day 'N' Nite\"\nThey be like \"You got that song 'Dadada' in the Nite!?\" I say yes, that's me let's bone, let's hit the street, we can hit the cut i don't give a fuck you a dirty slut smack you on your butt and you can leave, i don't give two fucks baby please dry heave at ease. Fall back when you salute a nigga in all black move quicker while i sip yack smoke the best kush and lay back in the slump a cutlass supreme i got from the dump i ride a smug niggas try to judge a nigga i hop out that bitch cleaner than a motherfucker what you know about that man, i ain't playing games no more, i am PAC MAN AWA AWA AWA eat you niggas up i don't give a fuck about you niggas i'm up in the cut nigga"}]}