{"artist": "Pusha T", "songs": [{"album": "Fear of God II: Let Us Pray [EP]", "title": "What Dreams Are Made Of", "image": "https://images.genius.com/155375197720801e2327d2fc95837d08.1000x1000x1.jpg", "lyrics": "[Intro: Ric Flair]\n“It's so hard for me to sit back here in this studio, looking at a guy out here, hollering my name! When last year I spent more money, on spilled liquor, in bars from one side of this world to the other, than you made! You’re talking to the Rolex wearing, diamond ring wearing, kiss stealing, whoa! wheelin' dealin', limousine riding, jet flying son of a gun and I'm having a hard time holding these alligators down!”\n\n[Verse 1]\nTo all hustlas with the same interest\nBow your heads as the Lord's mentioned\nPrayer service held in the kitchen\nI wish they never found Jimmy Henchmen\nI’m what dreams are made of\nCocaine Ronald gave us\nThen Nancy tried to save us\nBy that time we had Motorola pagers\nNow we push button start motors\nYacht owners, you small ballin', that’s Pop Warner\nMenage a trois in the bath house\nBlew money on ‘em, bitches never bad mouth\nYou glass slipper bad whores, I just cash out\nYou open doors, I open jaws and pass out\nLuxury is just my lifestyle\nI’m Scott free with a million dollar bright smile\n\n[Chorus]\nYou niggas gettin' money, I never hear about it\nThe bricks fell, I skip jail, live to tell about it\nI'm what dreams are made of\nI'm what dreams are made of\nSell that pussy to me, I’d rather buy it baby\nLook at ya purse you need the help, you can’t deny it baby\nI'm what dreams are made of\nI'm what dreams are made of\n\n[Verse 2]\nYeah, Louboutins under sweats\nA hundred just landed from responding to a text\nNiggas talk money but I’m still unimpressed\nWhen these thousand dollar sneakers got me feeling underdressed\nHip Hop bores me, hustlers applaud me\nToo much school boy, not enough rude boy\nNothing match the feeling of pulling up in that new toy\nAnd it ain't even half of my safe, tuck like the Jew boy\nBentley with the rag-top yarmulke\nIt says kilometers all on my speedometer\nCocaine under my tongue like thermometer\nI got the fever, I never took a breather\nNeed a way out like Nas needed an Ether\nLike Mike Vick chased by PETA\nMore pony hairs, more zebras\nMore pythons, more lizards\n\n[Chorus]\nYou niggas gettin' money, I never hear about it\nThe bricks fell, I skip jail, live to tell about it\nI’m what dreams are made of\nI’m what dreams are made of\nSell that pussy to me, I’d rather buy it baby\nLook at ya purse you need the help, you can’t deny it baby\nI’m what dreams are made of\nI’m what dreams are made of", "year": "2011-11-08"}]}