{"artist": "Ice-T", "songs": [{"title": "Please Believe Me", "lyrics": "[Intro: Ice-T conversating with his daughter]\n[Ice-T] Baby, I wanna let you know I really like how this is going down\n[Daugh] Yeah, I like how it's going down too, daddy!\n[Ice-T] Though we can make big moves, baby I know, real big moves..\n[Daugh] Ummm.. just tell me what I gotta do and I'm down for whatever!\n\n[Chorus: Corte X2]\nGirl, if you do what I tell you to\nYou can have this whole world if you wanted to\nBuddy, it ain't going to be easy\nJust listen to a player, and please believe me!\n\n[Verse One: Ice-T]\nLet's start this off with facts\nYou got on some nice shoes but you walk in it\nYou got on nice coat but you're outside it\nNow, if you're ready to accept that state you was made in upgrade\nHiding up your game in form\nI can let you come over here with me and get real real warm\nThey say: if you knew better, you'll choose better\nAnd you think wrong, you think wrong\nYou can't swing a slow batter the fast pitch\nThe problem with most of you women, y'all so used to loosing\nYou can't even figure out what you want\nNow first, we gotta let you know everything\nIf you did - you'll be living on the side of the mountains\nSomewhere in Seattle like Bill Gates\nAnd I don't know everything that's true\nBut I definitely do know more than you\nOne thing is you got style, cause you quote my eye\nTwo is you got class, that's what makes you fly\nThree is you're intelligent cause you're listening to me talk\nAnd four is you're very very sexy, you can see that in the way you walk\nBut all that ain't work nothing if you don't get it together and move something\nNow, this game is played in ones and twos, that means soloists and crews\nAnd that's exactly what I'm trying to do, is team up with you\nBut you have to learn how to take some instructions, boo\nPlease believe this, and listen to me\n\n[Chorus: Corte X2]\n\n[Verse Two: Smoothe Da Hustler]\nAlright, baby look..\nI can see you harmonious cause your rent is more than my mortgage\nSo it's obvious you ain't got enough left to pay attention\nBut I.. I'ma renew your lease for a small fee\nThen we gonna psychologically house-shop\nSo you can have some space for that brain of yours\nConsider me Real Estate\nNow, I can't front, you're fly\nAnd you're hanging around me for some reason so I must be the shelter\nThey say: conversation is like a combination\nSo I'ma open that safe, take a turn at it\nYou want-a dime, yeah, you want-a dime\nBut your nigga paint you a picture\nHow much cents do that make?\nAlright then.. now, what you should do\nIs grow some hands on that forehead of yours\nSo you can hold that thought\nI see you used to get in your way that's why you go on the wrong direction\nYou need a RUN D.M.C. and 'Walk This Way'\nDon't you need two pilots to fly the plane?\nBut only one get to hold the steering wheel, baby\nSo sit back, relax your ass, cause you're flying first class\nAnd this going to be a smooth ride, baby, and please believe me\n\n[Chorus: Corte X2]\n\n[Verse Three: Ice-T]\nNow, I'ma give you the real deal\nI'm going to need at least two more inches on them heels\nAnd that gut made up cool to you, but I'ma ask you for a stirrup or two\nAnd as for your hair.. I ain't even going to go there\nJust keep it clean and tight, and would be alright\nOverall.. I think you're fine\nAnd I'm sure I can buck out the dime\nAnd this is going to take a little time\nFirst, you got to forget everything you know\nCause right now..\nYou're on a real course to becoming a real motherfucking whore\nNow, that's cool too..\nBut at least let me show you how to be a motherfucking pro\nCause it ain't going to be all fun\nIf you're fucking with me, you better duck or run\nThis is final level of the game baby\nAnd it ain't going to be all biscuits and gravy\nYou got to have a nerve, for the motherfucking curve\nCause we can do it either way, baby\nThe street way, or the corporate sweet way\nBut no matter how me and you do it, girl\nIt would definitely.. be the elite way\n\n[Interlude: Ice-T and his daughter conversation continues]\n[Daugh] Awww! you know, I'm down, baby\n[Ice-T] That's what I'm talking about\n[Daugh] Ha ha ha ha!\n[Ice-T] Yeah, I know you like it when I see you smilling..\n[Daugh] Ha ha ha ha ha!\n[Ice-T] Yeah girl, I see you're feeling this right..\n\n[Chorus: Corte X2]", "image": "https://images.genius.com/44e03781386ef22a962df8d6b6e26c72.640x640x1.jpg", "album": "Gangsta Rap", "year": null}]}