{"artist": "Angel Haze", "songs": [{"title": "Black Synagogue", "image": "https://images.genius.com/4890084144da97ab8408130d90ede415.560x558x1.png", "album": "Dirty Gold", "lyrics": "[Poetry Intro: Angel Haze]\n\"And the light, the light can make everything feel beautiful. It can make it feel safe, so safe that, like, in the night, we spend all of our time running away from our truths. And then we meet someone who tells us, 'God will always love you, no matter what you do. The only thing that will never stop loving you is God.' And because of all of our darkness—which at night I still run from, which at night we all still run from, we get stuck chasing light. That's a Black Synagogue.\"\n\n[Gospel Intro: Angel Haze]\n\"And God said that the meek shall inhabit the Earth! But there shall be masses, I said masses!, of bloodshed first! And that will open the floodgates of Heaven, and pour down upon us His blessings from the floor, to the ceiling, but only if you praise Him, I said praise Him, shall you receive His healing!\"\n\n[Hook x2: Angel Haze & Wynter Gordon]\nSave me from the pain\nI'm falling down\nDon't you hear me calling?\nI need you now\nFill me 'til I'm whole with your holy light\nGive me sanction\nCan you bring me back to life?\n\n[Verse 1: Angel Haze]\nI been running from the pain in my brain\nGot stains on my scene while I search for the real me\nSearch for the real me, lost in the night\nOnly talk to angels when I'm lost in a height\nI don't really wanna get lost in my mind\nSo I pray until I feel I'm getting lost in the vibe\nThen I took the bottle up and I drink it to my what?\nYep, drink it to my fucking soul's lost in my eyes\nBut I don't really wanna drown no, 'cuz I'm not that trusting\nBut I'ma keep coming 'round though, till I'm sure that I found something\nAnd when I tell you what it is, you better talk to God, remember\nNo feelings, no thoughts allowed\nAnd if pain's a trapdoor then I need God\nAnd so send someone to come walk me out\nBut don't think, don't talk about it\nWait, don't sing, don't tell nobody\nWait, don't drink, don't fail your body\nWait, don't scream, no, fucking shout it\nSee, these voices in my head are the fucking loudest\nSo belligerent, so fucking rowdy\nAnd my tunnel vision's so fucking clouded\nAnd I don't really have a motherfucking outlet\nSo, I talk to God, but I don't really know if He can hear me\nBut you know Him well, and I think that you could bring Him near me\nSo I keep praying, every word that I keep saying\nEvery part of me that I needed shield from\nEvery part of me that needs saving\n\n[Hook]\n\n[Verse 2: Angel Haze]\nNone of this's real, when it calls you\nThought I found you, now I'm lost too\nI've been listening to service sermons\nA lotta redefining, a lot of words reworded\nA lotta thoughts detected and thoughts suggested\nA lotta stuff that resonates with certain persons\nI've been searching for the truth but it's embedded in lies\nRead every single verse until I'm red in my eyes\nAnd God'll only hear you when you offering ties\nAnd protection is the truth\nBut when the Devil's a lie\nBut what am I to do when the Devil is I?\nAnd everything I touch seems to shrivel and die?\nMy mama always said I was a rebel inside\nBut now I'm looking for some peace and a benevolent I\nAnd how it feels to need that, some humbling pie\nAnd how long it will take when it comes from the sky\nMeans I'll probably be waiting until I crumble and die\nAnd just wrestling with Satan while I'm struggling by\nSo, I think, I talk about it\nWait, I drink, I tell somebody\nWait, I sink, I fail my body\nWait, I scream, I'm fucking shouting\nCause these voices in my head are the fucking loudest\nSo belligerent, so fucking rowdy\nAnd my tunnel vision's so fucking clouded\nAnd I don't really have a motherfucking outlet\nSo, I talk to God, but I don't really know if He can hear me\nAnd you know him well, and I think that you could bring him near me\nSo I keep praying, everything that I keep saying\nEvery part of me that I needed shield from\nEvery part of me that needs saving\n\n[Hook]\n\n[Verse 3: Angel Haze]\nDid he die on the cross for this?\nDo you have any fucking proof?\nEverything here is man-made\nAnd I'm just searching for some fucking truth\nCause everything they ever told me not to do\nHas always made me question what freedom is\nWhy listen to the words when they not from you?\nAnd why feel judged when I freely live?\nNow I know what the fucking root of evil is\nAnd why peace is dead, but evil lives\nEverybody thinking they can talk to you\nAnd what they believe in they hearts are true\nNow they feel that they had the right to persecute\nJudge, doom to hell and come first to you\nNow I don't really know who wrote the Bible\nBut nothing under the sun goes unrecycled\nTake every shot you have with a fucking rifle\nCause you rarely ever get a chance for revival\nSo, just think, just talk about it\nWait, just think, just tell somebody\nWait, don't blink, don't fail your body\nWait, just scream, just fucking shout it\nSo the voices in your head fall abruptly silent\nAnd the blood in your veins flows rough and violent\nAnd you see everything with your lifted eyelids\nAnd every burden you carry is eventually lighted\nAnd you talk to God, even when you ain't sure he hears you\nAnd you give it to Him, tell Him, He can keep the pain and fears too\nAnd you keep praying, only now you don't repeat sayings\nCuz you know when you let it go, then you receive savin\n\n[Outro: Angel Haze]\n\n\"How many people here look for Jesus to solve their problems? Lots of people. And how many of those people are fixed? None of them know fucking about shit, they're all fucking fucked up. Anything to help you escape. It takes it, it takes something to just say, 'Fuck it! This is reality, I'm gonna deal with it!' But do we ever really deal with it? Deal with it, stop running, stop trying to find these substitutes? Stop trying to find Jesus in strangers, and Jesus in church, and God, and find God in yourself. Powerful thing, yeah?\"", "year": "2013-12-30"}]}