{"songs": [{"image": "https://images.genius.com/1de55354dcd70daca5af471447217049.996x1000x1.jpg", "lyrics": "[Intro: Doris Day]\nThanks Ugly God, thanks Ugly God\nStars shining right above you\nNight breezes seem to whisper, \"I love you\"\nBirds sing in the sycamore trees\nDream a little dream of me\nThanks Ugly God, thanks Ugly God\n\n[Verse 1]\nI used to go to school, but, bitch, I'm better off at rappin'\nYeah, I'm fresh to death, wipe me down just like a napkin\nWhen I fuck yo' bitch, I moonwalk like Michael Jackson\nI used to beg for hoes, now I'm the Booty Gang Captain\nFreaky, yeah, I got your bitch, she tryna freak me\nEasy, I'm posted on your wall just like graffiti\nYou talk shit on Instagram, but starstruck when you see me\nBelieve me, I'm still that same nigga steal your TV\nMove, bitch! When I'm done, put on your shoes, bitch\nYou see me on this Call of Duty, please get out my room, bitch\nI'm in my coupe, two-door, sorry, ain't no room\nCall the Uber, I'ma tip your driver just to zoom\nYour bitch fucking with me, yeah, she stuck on me, no glue stick\nHatin' niggas on my dick, I brush it off, no broomstick\nNiggas switch, I don't fuck with niggas I was cool with\nBut I'm tryna fuck on every bitch I went to school with\n\n[Interlude: Doris Day]\nSay, \"Nighty night,\" and kiss me\nJust hold me tight, and tell me you miss me\nWhile I'm alone and blue as can be\nDream a little dream of me\n\n[Verse 2]\nThanks Ugly God, thanks Ugly God\nTryna tell you, these niggas be fake, Ugly God\nYou gotta watch out just to be safe, Ugly God\nThey talk behind your back\nBut then they smile up in your face, Ugly\nGod\nThanks, Ugly God!\nDamn, when you gon' pull out that Wraith, Ugly God?\nDamn, I remember they used to hate, Ugly God\nDamn, I remember they used to snake, Ugly God\n\n[Outro: Doris Day]\nThanks Ugly God, thanks Ugly God\nSweet dreams 'til sunbeams find you\nSweet dreams that leave our worries behind you\nBut in your dreams, whatever they be\nDream a little dream of me", "title": "Dream", "year": "2019-03-06", "album": null}], "artist": "Ugly God"}