{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/24c5c29fe788fe669929c7cd90a09600.412x412x1.jpg", "title": "Get It For Her", "lyrics": "I'm like everybody else, I want to drill right fast\nWhen I keep it all real it don't feel quite bad\nReal talk baby, what the deal right fast?\nKnow you hurt but you really got to feel right fast\nI'm that nigga everybody want to kill right fast\nBut they better hurry up because the kill right fast\nYou should really plan on fucking and the dick not bad\nAnd I'm really bout to up and touch your mirror right fast\n\nI ain't playing with you, wait a minute ma\nI kind of like the way you doin, what you doin' ma?\nI'm saying wait a minute, ay what you doin' ma?\nI kinda like the way you doin, what you doin' ma?\n\nAnd I see you doin you but in my mind I don't know\nCall you over here, take your time real slow\nWhen you put that ass on me gotta grind real slow\nLot of cass like it fast it's like mine real slow\n\nI'm saying wait a minute, what you doin' ma?\nI kinda like the way you doin, what you doin' ma? [x2]\n\nA couple stacks on me I get it for her\nIt ain't trickin' I ain't trippin' I get it for her\nI get it for her [x2]\nIt ain't trickin' I ain't trippin' I get it for her\n\nSwagger through the roof, chase my paper\nMan I'm higher than the skyscraper\nGivin' me the eye then I might take her\nWho you kiddin? I'ma sit her on the skyscraper\nHit it in the air from the back in the chair\nHope I got a spare because I don't do rare\nI'm saying wait a minute\nThen the chair gets pulled while her asked gets slapped and her hair gets pulled\nAnd the room gets hotter than a thermal shirt\nShe naked, she shaking\nGod damn you good\n\nI'm only day dreaming\nWhat you doin' ma?\nI kinda like the way you doin, what you doin' ma?\n\nOn the way to the crib\nWhere you stay? Where you live?\nOld man, you ain't gotta make a face at the kid\nGettin dressed on the bed, we could get it on the floor\nPut your legs by your head, get-get it on the floor\n\nI'm saying wait a minute, what you doin' ma?\nI kinda like the way you doin, what you doin' ma? [x2]\nA couple stacks on me I get it for her\nIt ain't trickin' I ain't trippin' I get it for her\nI get it for her [x2]\nIt ain't trickin' I ain't trippin' I get it for her"}], "artist": "Kevin Gates"}