{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Cépticos", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Intro: ProfJam]\nQuerido ceptico\nEu dedico esta mensagem para ti e para os teus...\n\n[Verso 1: ProfJam]\nComo é tu queres que eu pare se eu nunca tive travões?\nZeus no quarto, ocupado a lançar trovões\nRaios e coriscos, ou seja, palavrões\nO raio grava o disco, ouve os electrões\nE de onde eu vim só tu vias onde eu não iria\nSumo e gin na batida a mente expanderia\nSolto a weed, solto o beat, faz a tua nigga\nÉ que eu aqui sou fudido, não na rua nigga\nNão sou outlaw, nem sou criminal!\nSou um puto só que nunca intimidou\nPor isso dá o toque - eu tou na city bro\nA ouvir Carl Cox com um bruto txiri bro\nSafoda o resto, ser modesto é fodido qd tu tens esta qualidade mano\nSafoda o stress, se eu pudesse resistia a tudo, nao tens q dar pa badman\nSo what's next? sucesso... seja na net ou no beco...\nDesde puto a dar pa preto... e sou pálido pa crl!\nMas o teu hálito a caralho já m'incomoda\nArranjaste trabalho, agora és cocksucker\nE eu não quero a tua bitch, ainda é muito nova\nDeixa crescer lhe umas tits, depois o prof prova\n\n[Refrão]\nPões o prof à prova? eu cavo logo a cova\nAté na copa canto pq eu parto a loiça toda\nPa quê competir se eu ja tenho a copa?\nNa k.o. virei pro, só falta vir a nota...\n\nNota, ta-ta-no, ta-no, ta-ta-ta-no, nota\n\nPoes o prof à prova? eu cavo logo a cova\nAté na copa canto pq eu parto a loiça toda\nPa qê competir se eu ja tenho a copa?\nNa k.o. virei pro, só falta vir a nota...\n\n[Verso 2: Magboy]\nQuando eu vi que os motherfuckers vinham contra mim\nEu só disse \"podem tentar\"\nLancei \"abordagem\" parece que não 'tavam a ouvir\nEntão vim com \"gunshot\" pronto para matar\nTbv na minha back motherfucker\nMesmo magro dizem que sou phat motherfucker\nBrinco com o alfabeto tugas espantam-se por eu ser preto\nE o que rappo deixaria orgulhoso o 'Pac motherfucker\nPorque eu sou Rsk nigga...\nQueres me calar então me mata nigga\nEsses sucker dizem bullshit\nMotherfucker im on some hood shit\nNão acreditavam em mim quando eu comecei\nMas o importante sim é que eu acreditei\nQuem começou junto a mim nunca abandonei\nE as dicas de muitos g's ouvi e caguei\nA vossa falta de crença nao me abalou\nNinguém me calou ninguém me parou\nNinguém me pisou\nAgora nigga olha o nível que um gajo chegou\nOlha quem odiou, olha pa onde eu estou\nOlha pra onde eu vou\nMy nigga meu futuro é tao brilhante\nTeu favorito nao passa de um traficante\nQuero ter nao! vou ter pra 20 diamantes\nPra saber isso nao precisei cartomante\nNao venhas armado tipo tas no shottas nigga\nSenao vais obrigar-me a entrar no modo big pun nigga\nEsqueceste que eu sou Rsk?\nSe o tchuko é bala olha pra mim eu sou uma shotgun nigga (i dont give a shit)\n\n[Outro]\nE tu pensavas que isto não ia mudar uma vez que rsk entrasse\nEntrasse entrasse\nE tu pensavas que isto não ia mudar uma vez que bIIIk entrasse\nEntrasse entrasse\n\nNota, ta-ta-no, no, nota, ta, ta, ta-ta, ta-ta, ta-nota", "year": "2014-06-06"}]}