{"songs": [{"lyrics": "[Verse 1]\nAyo, react, biatch nigga\nThink they mess with the rich nigga\nJigga, they can't touch ya\nSay y'all, we livin' (?)\nYou faggot niggas don't play ours, my team'll slay yours\nNay-say yours, can't mess around we lay yours\nWith our hands in the air, I swear to God\nSince money's respected you know I had to get it\nCollect it like antiques, and let it stack\nDrrrrrrrrrrrr, like that\nI mastered this fast shit, now I move on\n'Cause too many bastards tried to get they groove on\nAnd now you see me jiggy, you puzzled\nHe ain't sellin' no records, is he? That nigga gotta hustle\nHuh, you bet your guns, by any means, I get my ones\nYou intervene, by any means, I get ya done\nYour whole team gotta show Jay love\nSimply because, my thing is tighter than O.J. gloves, hah\n\n[Verse 2]\nI get deep and down like ditches\nBut when I rap I come off like that without the glitches\nNever crossed the black cat with the riches\nI'm leavin' Stevie sayin' no Wonder you're superstitious\nBeef, I'm with it, simple, y'all can all get it\n... Y'all don't all get it\nDon't nobody of mind for this matter\nGather the data until ya mind don't matter!\nI bubble like lather, hustle like the lead-off batter\n'Cause all that matters is this money, 'til it ain't funny\nYou feel me? When the beat screams kill me\nDon't jerk me boy, I rip it silly!\nI'll let you rise of course, but if you don't fall off on your own\nMC's I cut off at the knees like shorts\nIt gets worst, if you don't care for my sick thoughts like a nurse\nWith no known remedy\nI'm leavin' boys and men on bended knee 'til the end of the road\nI, lock, load, fuck this record shit\nWith one sale, my bracelet certified gold with rocks\n\n[Verse 3]\nCheck it out, uh, check it out, uh\nIt'll take the Feds to break us\nI hope I speak for everybody when I say ain't no dough in this world can escape us\nI hold it down like a rapist for these papers\nI'll leave ya chest open like vapors for these papers\nThe nature of mine run deep\nOne time video tapin' my crime, monitorin' my sleep\nWith each and every word I teach, through every word and speech\nMy players anthem is get in and get out like a phantom\nJiggy Jigga lookin' gully in the joint\nIf y'all niggas ain't talkin' 'bout large money, what's the point?", "title": "’95 Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": "1995-01-01", "album": null}], "artist": "JAY-Z"}