{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "21 Questions/21 Answers", "lyrics": "[Intro: 50 Cent]\nNew York City!\nYou are now ridin'\nWith 50 Cent!\nYou gotta love it!\n\n[Verse 1: 50 Cent]\nI just wanna chill and twist the la\nCatch stunts in my 745\nYou drive me crazy, shorty I\nNeed to see you and feel you next to me\nI provide everything you need and I\nLike your smile, I don't want to see you cry\nGot some questions that I got to ask, and I\nHope you can come up with the answers, babe\n\n[Verse 2: Lil' Mo]\nCuz I just wanna chill and take a ride\nShotgun in your 7-45\nOh baby you know I got your back, and I need to feel you next to me\nWe got a baby and you know that I\nWould have another, man I want your child\nSometimes I really wanna cry, cause the love is so good\n\n[Hook 1: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down, and out?\nWould you still have love for me?\n\n[Hook 2: Lil' Mo]\nBoy, if you really love me now\nCan we walk down the aisle?\nCause you know I'm gonna hold you down\nCause when you was down and out\nI was still around\nYou gettin' money now, but I still got love for you\n\n[Verse 3: 50 Cent]\nIf I fell off tomorrow, would you still love me?\nIf I didn't smell so good, would you still hug me?\nIf I got locked up and sentenced to a quarter century\nCould I count on you to be there and support me mentally?\nIf I went back to a hoopty from a Benz\nWould you poof! and disappear like some of my friends?\nIf I was hit and I was hurt would you be by my side?\nIf it was time to put in work would you be down to ride?\nI get out and peel a nigga cap, chill and drive\nI'm askin' questions to find out how you feel inside\nIf I ain't rap cause I flipped burgers at Burger King\nWould you be ashamed to tell your friends you're feelin' me?\nIn the bed if I used my tongue, would you like that?\nIf I wrote you a love letter, would you write back?\nNow we can have a lil' drink, you know, a nightcap\nAnd we could do what you like, I know you like that\n\n[Verse 4: Lil' Mo]\nIf you fell off tomorrow, you could stay at my crib\nIf you didn't smell so good, I would still have your kid\nIf you got locked up, I'd put money on your books\nI'd marry you through conjugal visits, and it'd be off the hook\nYou could still keep the hoopty, if you couldn't cop a Benz\nBoy I'd never dip out, like some of your friends\nIf the boys try to get you, I'd be by your side\nLike Cleo from Set it Off, and you know I'll ride\nIf you gotta peel a cap baby, do it papi\nAnd if a chick wanna a piece of me, I know you got me\nYou have to work at Mickey D's or Burger King, I'd be there for you cause I kknow we gotta eat\nI ain't got too many friends, you know that babe\nIf you use your tongue, baby I'll behave\nYou know I don't drink, cause I wanna have ur baby\nCause I'm your girl, and them other chicks is maybe\n\n[Hook 1: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down, and out?\nWould you still have love for me?\n\n[Verse 5: 50 Cent]\nNow would you leave me if your father, found out I was thuggin'?\nDo you believe me when I tell you, you the one I'm lovin'?\nAre you mad cause I'm askin' you 21 questions?\nAre you my soulmate, are you the one for me? Cause if so girl you a blessing\nDo you trust me enough to tell me your dreams?\nI'm starin' at ya trying to figure how you got in them jeans\nIf I was down would you say things to make me smile?\nI treat you how you want to be treated, just teach me how\nIf I was with some other chick and someone happened to see\nAnd when you asked me about it I said \"it wasn't me\"\nWould you believe me or up and leave me?\nHow deep is our bond if that's all it takes for you to be gone?\nWe only humans, girl, we make mistakes\nTo make it up, I'll do whatever it takes\nI love you like a fat kid love cake\nYou know my style I say anything to make you smile\n\n[Hook 1: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down, and out?\nWould you still have love for me?\n\n[Hook 2: Lil' Mo]\nBoy, if you really love me now\nCan we walk down the aisle?\nCause you know I'm gonna hold you down\nCause when you was down and out\nI was still around\nYou gettin' money now, but I still got love for you\n\n[Bridge: Nate Dogg]\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions, and they all about us\n\n[Outro: Lil' Mo]\nIf you only knew how I feel\nBoy you would know that my love is for real\n21 answers to the questions you got\nI'll always love you if you got money or not", "year": null}]}