{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "Wake the Town", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "[40 second instrumental to open]\n\n[Pacewon]\nYo, until Miss Cleo predicts who pull the most chicks\nLet me tell you in advance that's me\nSippin on Henny, never have to spend a pretty penny\n20/20 vision can't see\nYo, I keep game tight go out and mack hard\nI'm just another pimp slash rapper at large\nWhippin through them uptown streets like Black Rob\nPuffin on wet mixed in with backyard\nI got it locked no doubt, I thank God\nKeep a jimmy hat right by my bank card\nI'm the P-A-C-E-O-N-E\nWanna be a deceased geek, no friends speak?\nWanna be a police chief?  Go get heat\nSee if they got a badge that they'll thrown in free\nNow you can fight crime in the alleys of the badland\nWear a cape, be a hero like Batman\n\n[Hook: Jamaican patois sample 4X]\n\"Wake the town of jazzy people\" - best guess\n\n[Pacewon]\nRaw to the core, seen y'all dime a dozen act on tour\nI didn't applaud\nYou rap like a broad bein fucked in the back of a Ford\nMaybe you should unfasten your bra\nYou gotta have breath control, and be flexible\nIf you wanna be the next to blow\nYou gotta spit flame, shit game, steal cars and flip 'caine\nMake haste, stay safe until you hit fame\nMake noise, break boys, then buy a big chain\nTo cover up the fact them rhymes you kick lame\nDumb in the flesh and, uninterestin\nI'm Tonto, holdin up a gun in a Western\n\"We the sound of jazzy people\" - like the silver bullet\nYou can't get a deal cause you might deliver bullshit\nMight make a tape that's dull with no glamour\nBesides these labels would rather sign Hammer\n\n[Hook] - 2X\n\n[Pacewon]\nYo, until Miss Cleo predicts who pull the most chicks\nLet me tell you in advance that's me\nSippin on Henny, never have to spend a pretty penny\n20/20 vision can't see\nYo, come in with a clique, go out in a bang\nFed up with a chick, get down with a gang\nSick of talkin proper, bite my slang\nSuck my left nut while my right ball hang\nDon't like cars?  Cop you a van\nDon't like jobs?  Start up a scam\nDon't like bein by yourself?  Roll with a clan\nBe a soldier, fuck your mother holdin your hand\nYo, you want lettuce, got a fetish, go and get it\nInstead of spendin money blowin credit\nFor all our sakes, get a 9 to 5 and stop rappin\nSomethin, fuck it, make your kids start actin\n\n[Hook] - 4X", "year": null}]}