{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Drinks", "album": "The Chalice", "lyrics": "Billy woods ft. Karniege and Vast Aire - “Drinks”\n[Emcee(s): Karniege, Vast Aire, and billy woods]\n[Producer(s): DJ Marmaduke]\n\n[Verse 1: Karniege]\nHickory Dickory Dock, what I spit out be hot\nGet buried with rocks trying to mess with my moms\nOr my sister and the missus, they be handling sharp\nObjects.  I’ll be honest: it’d be better to run like\nP. Diddy through streets gritty or suburbian\nMove in a hurry, and, toys, we be herbing them\nMany people scurrying, little characters scrambling\nGhost if it’s mannequin, get backed up in ambulance\nSon needs funds ‘cause tour dates they’re cancelling\nQuit lip-babbling and not business-handling\nMighty Joseph got heat, others got weak.  Bruh, other than that\nWe got hands and feet techniques that\nDraw fans to us, trying to touch our wears, pushing\nTheir girls to talk to us like, “Go, go, go over there.”  (“OK!”)\n“Hug his body and get the autograph.”  By\nThe time he tried to holler, me and shorty just flashed\n\n[Hook: Karniege]\nIt’s like\nStay in the mix like a Kool-Aid drink\nSpilling out hot any time the ink\nTouch the pad then float off paper\nCut through speakers with so much flavor\n\n[Verse 2: Vast Aire]\nYo, I had\nTo tighten up my game ‘cause CEOs is lame\n(Yeah, yeah) Couldn’t be straight-up?  That’s a shame\nHah.  Mighty Joseph (Mighty Joseph), here’s a close-up\n(Here’s a close-up) with a telegram from the Son of Sam\nI came up without the upper hand.  There\nWas no window to throw piss from the pan, so\nWe smoke endo, counting cake in our hands\nYou fucking up the dice game, taking a chance\nI’ll show you my dice game swinging my lance\nYou’re still standing there, pissing your pants\nI’m that same OG with the dip in my stance\nAiki’, jiu-jitsu, you don’t want to dance (You don’t want)\n(To dance) with the Devil (Hah!).  I’m like Seagal\n(Oh!) But I’m harder to kill—it’s just part of the\nSkill (Haha), and you ain’t even half as ill\nI’m a livewire, metamorph into fire\n\n[Hook: Karniege]\nIt’s like\nStay in the mix like a Kool-Aid drink\nSpilling out hot any time the ink\nTouch the pad then float off paper\nCut through speakers with so much flavor\n\n[Verse 3: billy woods]\nFlex with lines and blow out your loafers\n‘Cause I got to get mine like Angolan poachers.  Wild pigs\nStay reaching for holsters, but ours\nWas closer, so now I got a hot pocket from the toaster\nPlus headlining on all wanted posters\nWho needs promoters?  I might end up behind bars\nHopefully the type with coasters.  I know I’m not\nSupposed ta like a Wahhabi reading the\nTorah.  Nine spliffs like Hanukah gifts—pass the\nMenorah.  Nigga, look at your lawyer\nThat cheap suit means you’re going in, duke.  Might as well\nCome to court in Timberland boots, smelling like Tropical\nFantasy and Absolut, argue ‘til the point’s moot\nCargo sagging, flagging—that’s [?]\nTagging (literally).  Treat the hood like Level 4 of Double\nDragon, cock her legs back in a wood-paneled station\nWagon, leave it to beaver\nI do dirt like a preacher—pleased to meet ya\nThat’s Vast with the meat cleaver just to garnish\nA raw Karniege, got emcees drinking foreign ish\nAnd all they can say is, “Gosh darn it\nLook what these broke-ass negroes started”"}], "artist": "​billy woods"}