{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Bridge]\nLove me, love me, long time\nLove me, love me (love me)\nLove me, love me, long time\nLove me, love me, long (bang bang)\n\n[Verse 1: Mr. Eon]\nI spit dumber slang and Clubber Lang\nHer toosh ain't the same just like a rubber band\nPrepare to bareback, Eon champ, rare facts\nTo fucking unknowns, he still be getting a share of that\nI'm too high, making these whores melt\nBring the pent undergarments, you would shit yourself\nMy last five rhymes, catch 'em by lines\nSo in the New York Times, in the city writing rhymes\nHigh and Mighty elusive\nAuthenticate jerseys, my DJ wear Nike exclusives\nHer pint sauce gained her a peep with the light sauce\nWalking on stilts, must look like a high rise\nScore the subversive with perfect cursive\nMan ain't shit versus his penmanship\nCreating death traps using 40 wet naps\nHave him coming 40 days soon, he better get back\n\n[Hook 1]\nYou a homecoming queen turned heroine fiend\nMake 'em go (ahh) so you know when I cream\nYou just out the cradle discovering anal\nMake 'em go (ohh) to all my [?] fables\nYou a porn star diva in g-string cheetah\nMake 'em go (ahh) when I'm eating shaved beavers\nThigh high guarders, asking for it harder\nMake 'em go (ooh) call me your fucking father\n\n[Verse 2: R.A. the Rugged Man]\nAyyo, I'm ugly as shit, the Elephant Man\nJohn Merrick, the modern day Rocky Deniss\nWe cracking sack like we black rappers, I'm hillbilly\nHorse back-riding, I drive tractors, I'm ass backwards\nIn the farmland with the one-arm man\nI don't get no pussy, I fuck my hand\nCaution, this ain't recommended for the weak hearted\nSpecial ED student, I'm half retarded\nWhen I was banned from the Jive office\nI brought a chick with a two foot vibrator up to Rawkus\nRugged Man, the autobiography\nThe pornography, dirty version of Dostoyevsky\nMy little brothers and sisters, they both wheel-chaired up\nThey can't talk, can't see and they can't stand up\nThey might prank-call your house, make noise and hang up\nGet excited, fall out they beds and get banged up\n\n[Hook 2]\nYou a homecoming queen turned heroine fiend\nMake 'em go (ahh) so you know when I cream\nThigh high guarders, asking for it harder\nMake 'em go (ooh) call me your fucking father\n\n[Bridge]\n\n[Verse 3: Mr. Eon]\nI'm masturbating in my cellar\nFantasizing about a threesome with Sarah Michelle Gellar and Helen Keller\nDidn't like Helen, but how was I going to tell her?\nStuck my balls in her nose and knew she could smell 'em\nI'm still shaving box in her old age, full blown AIDS\nMore mistakes than what's a good vomit [?]\nAnd now I'm hitting skanks dressing scandaly clad\nAsking me to be their fucking fantasy dad\n\n[Verse 4: R.A. the Rugged Man]\nBorn to be bad, white rhymer, night rider\nI'm the male version of Elvira\nAt the diner, finger popping waitresses\nFake lyricist-es, stick my dick in their mouths\nWe take pisses, my dick is eight inches\nAt least that's what I say to bitches\nEven if I added two extra fake inches\nBitch love me, 2001, still dirty crusty\n\n[Hook 1]", "title": "Homecoming Queen", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}