{"artist": "Anybody Killa", "songs": [{"title": "Let Me Be", "image": "https://images.genius.com/d9a72ad4976c9dcf6c4a2ab0b329053f.750x703x1.jpg", "album": "A World Upside Down: The Mixxtape", "lyrics": "[Hook:]\nWhy don't you just let me be?\nThis is my life, let me lead\nIf you don't like what you see\nThen you's a hater, you's a hater\n\n[Verse 1:]\nWhy don't you leave me be?\nWhen I'm walking all alone in the streets\nMinding my business, doing what I do\nWithout always being stopped by some pigs like you\nAsking me questions, looking at me rude\nTelling me the music sucks that I listen to\nActing like they've got a right to hate\nWithout a killer like me dumping one in their face\nWhy don't you leave me be?\nAll I want to do is live free and be me\nSmoke a fat blunt where I stand and not see\nA bunch of fingers pointing because they smell good weed\nOr be in a crowd without being a gang\nGood times are forbidden if you look kind of strange\nThat's why I walk around looking to scare\nBecause I know you don't like it and I really don't care\n\n[Hook:]\nWhy don't you just let me be?\nThis is my life, let me lead\nIf you don't like what you see\nThen you's a hater, you's a hater\n\n[Verse 2:]\nWhy don't you leave me be?\nOr is it just because you like what you see?\nI get a little hate to a degree\nBut fifty percent of those haters wish they was me\nWhy don't you leave me be?\nAnd don't come around if you ain't family\nJust walk away and let bygones be\nBecause if I can't see you then you can't see me\nWhy don't you leave me be?\nWorry about your life and stop living through me\nWalk in the shadow of your goddamn self\nAnd try to recognize the one who needs help\nWhy don't you leave me be?\nActing like a pain because you're a disease\nNo one ever likes the energy you bring\nSo kill that hate inside and hope for better things\n\n[Hook:]\nWhy don't you just let me be?\nThis is my life, let me lead\nIf you don't like what you see\nThen you's a hater, you's a hater\n\n[Outro: DJ Clay]\nOh shit! Brand new Myzery\nHaha! Yo! It's A World Upside Down", "year": "2013-06-04"}]}