{"songs": [{"image": "https://images.genius.com/ddeb1a53a0fc7efb22da29a93c9384a7.600x600x1.jpg", "title": "Black Folks", "album": "In My Ghetto", "year": "2017-11-21", "lyrics": "What, what...yeah\n\n[Verse 1: Nas]\nI ain't seen as much death, nor seen as much crime\nSince the blackout in Queensbridge in '79\nEverybody's a killer now; pimps, playas, and dons\nShorties on the block push drops and carry on\nNiggas look through our window wherever we drove\nThrough the tint, to see if the Benz is matching the clothes\nWe the Queens kings, I used to view the cats that are old\nSeeing things that made me real from my skin to my soul\nGirls who turned hoes, friends who turned foes\nBad luck niggas who bring death wherever they go\nNever sleep, it feels better to know\nIt's all real though\n\n[Interlude]\nEverything is real\nWhere we Headed now?\nUp to more money, would be more fun\nLeave with mo' bitches, carry more guns\nWhere we headed now? Where we going, yo?\nIt's getting real, son; we gon' let it flow\nWhere we Mo' bitches, it be more dough\nIt be more fun, holding more...\n\n[Verse 2: Nas]\nHow the hell are we supposed to excel from the street\nWhere the Jake's crew face young kids who wanna eat?\nQuantum Leap to this Black world, hustlers and ghettos\nSelf-made millionaires who tussle with the devil\nBust a lil metal lead, wrestle you, to the pebbles\nOn the hard ground, that's if your guard down\nIt's a struggle, brothers jump bail\nTo come chill with they niggas on the block, with them rocks for sale\nOn the horn with the god Shapelle, my Queens comrade\nYo, run and come in with the dime bag\n\n[Verse 3: Shapelle]\nAyo, I need dat, I got to smoke dat\nSend me some Chunky Black, so I could smoke away the pain\nTry to find my brain, but the thought still remain\nYo, it's on again once the death stunts these chains\n'Cause I been through it; the drug game, I thought I knew it\nI got knocked, took it to trial, but I blew it\n25, but only lived 20 years of my life\nTook 5 from me; got me wrapped up like a mummy\nNow I'm in the system a.k.a. the devil's home\nWhere they tell you where to eat, sleep, shit, and use the phone\nNow I'm living with, drug dealers, and chain stealers\nBitch niggas who got knocked and turned squealers\nImagine, sharing a cell with a rehabilitated addict\nWho love fucking with faggots, but I civilized the savage\nI sat him down and made him study mathematics\nNow I'm sitting in the cell thinking...\nAbout this reefer I'ma get this weekend\nOn the V.I., I rather be... uh, damn, damn"}], "artist": "Nas"}