{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "Doctor Doctor", "album": "Hannicap Circus", "lyrics": "[Bizarre]\n(*Coughing*)\nMaybe it's the weed..\nIt's more than the fucking weed\n\n[Hook: Dion]\nDoctor doctor, come put the breaks on me\nYou better send me home\nCause I ain't leaving till something leave with me\nRight now that's all I'm on\n\n[Bizarre]\nI've had a headache for the last three days\nAnd the last couple days I been missing some pay\nDo I have AIDS? I'm sniffing and coughing\nAnd really this doesn't happen to often\nMaybe I'm tripping, maybe I got the flu\nMaybe I'm stressed out, something I'm going through\nIt's been a week and me and wife ain't have sex\nI'm usually a wild guy, I'll break her fucking neck\nI'm sick and I'm starting to wimper\nIt's ninety degrees, it's like December\nMy temperature is hundred and six\nI can't shit and I feel like shit\n\n[Hook 2x: Dion]\nDoctor doctor, come put the breaks on me\nYou better send me home\nCause I ain't leaving till something leave with me\nRight now that's all I'm on\n\n[Bizarre]\nMore trouble, here comes day two (Two)\nI took a shit in my white underroos\nMy eyes look like I been smoking crack (Uh-huh)\nExlax got me throwing up Big Macs\nNyquil, Advil, Tylenol, synus\nCarrying my blanket around like I'm Linus\nMaybe it's the pork I ate in New York\nOr maybe my baby mama wanting child support (You bitch!)\nOr maybe it's the fish that made me sick\nOr maybe it's the prostitute I let suck my dick\nOr maybe it's just the bottle of vodka\nI don't care, I just need to see the doctor\n\n[Hook 2x: Dion]\nDoctor doctor, come put the breaks on me\nYou better send me home\nCause I ain't leaving till somethin' leave with me\nRight now that's all I'm on\n\n[Obie Trice]\nI'mma kill this bitch, the tip on my dick\nAin't got an itch but I couldn't resist the switch\nShe's the type of bitch made to flinch\nWalk passed niggas, all in the ass\nOr it's because I had a tall glass\nI dropped my drawers without my dick wrapped\nPurhaps, I could catch the crabs\nBut, at that moment that's irrelevant\nI knew what I know now, I practice celibace\nAnd be hesitant from tappin' Evelyn\nHeaven sent a message when I came back negative\n\"Never fuck a bitch in the ass off a laxative\"\n\n[Hook 2x: Dion]\nDoctor doctor, come put the breaks on me\nYou better send me home\nCause I ain't leavin' till somethin' leave with me\nRight now that's all I'm on\n\n[Bizarre]\nYeah, just visiting Cincinnati\nMe and my (?)\nI'm with my boy, Hi-Tek, down the street\nYeah, can you take, do you take debit cards? (No, we don't sir)\nFood stamps? (No, please, sir, get off the line)\n? go get Hi-Tek out the car, man\nTell that nigga I need some, money for the prescription\n..Kweli! Ha-ha!"}], "artist": "Bizarre"}