{"songs": [{"image": "https://images.genius.com/6f329ec4a2750d93b8aa60439c9ba414.500x500x1.jpg", "album": "LA Leakers Freestyles", "title": "Dave Freestyle | LA Leakers Freestyle #007", "lyrics": "[Verse 1]\nWith my Spanish girl, Valeria, super freaky but she acting diva\nAnd all she wants to do is tease a boy that’s why she give me neck kisses when I'm playing FIFA\nMy Latina, Angelina, Colombiana come from Medellín\nAnd all she cares about is weed and sex\nHalf the time we ain't even speaking\nBut if I ain't feeling it then I'm swerving\nMy new girl got my old girl hurting\nThe last ex that I had was a lighty but the next X that I get is a German\nThat’s a X5 or a six door I'll get it cocaine white like a gringo\nI got a link at Stoney for clothes so this hoody that I own cost ocho cinco\nWith my Spanish girl playing FIFA\nMas tequila? Sí señorita\nWhatsApp only I'm overseas, I'm in Beverley Hills I might phone Genita\nMy Spanish girl’s playing FIFA\nMas tequila? Sí señorita\nWhatsApp only I'm overseas, I'm in Beverley Hills I might phone Genita\nI came here to change the game\nBut as time went by the game made me change\nAnd I can't explain but everybody has a part to play\nAnd I was meant to have the flipping heart to say\nTo anyone and everyone that there’s a different path to take\nThat you can make a living\nThat you can go legit to show them you can make a killing\nYou don't have to make it killing\nSo now when people say I'm different, I just beg to differ\nEvery song I sing it’s like I'm getting bigger\nAnd every time I'm rapping with a message they don't ever listen\nIt’s like, I was meant to do this for the love of this\nLike I was meant to stop that kid from tryna kill that other kid, I\nI was meant to bring all of my brothers in\nUntil I realized that this attention doesn't cover things\nLike, I can buy most the clothes for free but there ain't no flipping way that I could buy my brothers freedom\nSo hocus pocus, you don’t focus then you're close to death\nOur worlds are too different, things that I could do different\nIt’s like it’s so intense, there’s intent where there’s no intent\nThese words are here to build strong children they're tryna fix broken men\nAnd they hate me, so when these sirens come I hold my waist they hope to take me\nResolve beyond a code, no selling souls you couldn't break me\nThis hate talk for jakes from a baby\nThese blue lights are crazy\nAnd lifestyles hectic, I'm fit for flashing lights I'm epileptic\nBefore I catch attention fam I'm dashing to this entrance they could never understand\nWhy we were pedaling them grams and putting 20's in my hand\nAnd if they ain't getting tax know they're getting it gone\nMy hood's still antiheros like General Zod\nYou see a stabbing turn your head and move on\nDon't even reach for your phone\nCos if you're breaching this code you walk these streets on your own\nAnd every couple of years we lose about a hundred peers\nNo one came to play Tekken kid\nMy waist is where my weapon is\nRides like Chessington but nothing ain't fun or fair\nMost man are running scared, bigger fish they're punching air, white collar punish rare\nBlue lights more pressure, how many man are scared?\nSo many stabbings you would've thought that man are shanking air\nIt’s difficult for guys to care when man are tryna put you Underwood like Frank and Claire\nDare you couldn't save me though, we break the law and make it known\nMy people lost their minds, we over whether—\n\n[Instrumental ends]\nAy, you say next one. Next one, next one, next one, aww. I'm running out of instrumental time. I need to, I gotta get a faster one. Yeah, a faster one\n\n[Verse 2]\nYou see when I get nervous yeah\nI get this little twitch where my hand is\nAnd then my twitching it turns into deep breaths\nAnd all my deep breaths they turn into panting\nSee it’s one thing when you have no money but when I owe money it’s a madness\nSee I was 17 when I got bumped by a girl and the same day I was at her yard on a mad ting\nLong shank in my hand if her dad was on antics, I'm taking him the fuck out\nAnd from now I'm Walter White, middle men are getting cut out\nAnd all these little girls are getting cut out, on twitter telling me that men are trash\nOn the same day that you were getting dug out, my patience run out\nYou need to get the fuck out, we ain't playing run outs\nMy YG’s pressing on this hammer 'til it runs out\nWho the hell told you that I got run out?\nHands in my pockets like Wenger in the dugout, I ain't going nowhere\nNah G, I remember when them girls used to par me and now they wanna party\nWhips like the kid wearing dark green Adidas, why, I put three lines in a car key\nSee when I feel nervous yeah, my heart beat starts racing\nI feel sick to my stomach I get butterflies and that’s when I see feds or paigons\nSee the girl’s dad that never came out nah, and I was getting clocked by the neighbours, looking all shady\nStanding with a cutter while the local civilians put us on surveillance\nI was standing there so damn broke that I nearly had a tear in my eye\nI’m thinking bout this money that I owed to my main like I ain't coming home for today\nI swear to god, my heart's racing\nI've got another home to survey cos my young boy knows where they staying\nI'm scared but I can't let them know I'm afraid so I run up in the next fucking home or estate like what?\nWho's bad and what’s what?\nI'm looking for a grand and a half\nAnd if you haven’t got it, I'm taking electronics\nAnd all these clothes you have right down to your socks\nWe’re taking your Xbox, your TV set\nYour PlayStation I’ll trade into CEX\nVVS, diamonds I swear to God\nAnything that we can sell, we'll collect\nAnd we'll do it nice and clean\nAnd you could be Jamaican or polish I'm coming for your rice and peas\nI’ll hold your Z but I wanna see 9 bars like I had a dozen and I lost three sheep\nI wasn't getting money\nYou would’ve thought I gotta live for my friend, I was beefing over petty money\nI wasn't getting money, still\nI’ll test the Weston’s kit though\nEffervescence in Vimto\nCatch you in the night like crypto\nBig chrome, turn your Wednesday apocalypto\nFreeze your guys up like Calypso\nWindows, ain’t really a problem 'cause we tint those\nMuscle in the back this guy’s looking like the big show\nHustling for stacks I’m talking hustling for rack—", "year": "2017-04-05"}], "artist": "Dave"}