{"artist": "G-Dep", "songs": [{"title": "Keep It Gangsta (feat. Shyne)", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "[G. Dep]\nI got enough flows to spit, they cold as shit\nGive you what you supposed to get, to close ya lip\nI got enough O's to get, and hoes to hit\nTry to stick ya nose in shit, get froze and stiff\nTalk about load ya clip, and O's you flip\nWhen you ain't holdin shit but droze and dick\nRoll the spliff, take the toke\nYou either gittin cake or broke\nYou can stay awake or (??)\nTake a note, take a vote\nBuy a landslide or tell ya man slide or I shake ya boat\nTake ya toast, this rap shit I make the oath\nTo get cake, or estates by the lake or boat\nBad hoes, (??)\nSee the snake, (??) leave faith then they hate to go\nYo, Its to late to blow\nYa run around pay for hoes, that's why ya paper low\n\n[Shyne - Hook]\nWe them niggas with big guns and big dicks\nFload ya block, and keep it gangsta\nWe them niggas with big guns and big dicks\nCoat Them rocks, and keep it gangsta\nWe them niggas with big guns and big dicks\nDrop the top, and keep it gangsta\nWe them niggas with big guns and big dicks\nWylin, stylin, and keep it gangsta\n\n[Shyne]\nShyne Po, I keep it (??) like I'm supposed too\nIn a hard top something fronten\nI must of (??) died, came back as a rapper\nScareface, smith and eights, in my life after\nBone crushers on my hip, cause shit get thick\nIn the myths, of killas tryin to get rich\nI'm two shells from hell, you can tell I'm made for this life\nDistrict (??)\nI don't give a fuck, cuase I'm'a do me\nTill them hollow points, rip through me\nI was born to die, live for what\nPlush slut, bucks, guns and ?duffs?\nSpent late nights in the kitchen, wishen\nWatchin the pot boil, mixin, sniffin\nKeepin America high, and why wouldn't I\nGangstas don't talk, we beat the case and walk\n\n[Shyne - Hook]\nWe them niggas with big guns and big dicks\nFlood ya block, and keep it gangsta\nWe them niggas with big guns and big dicks\nCoat Them rocks, and keep it gangsta\nWe them niggas with big guns and big dicks\nDrop the top, and keep it gangsta\nWe them niggas with big guns and big dicks\nWylin, stylin, and keep it gangsta\n\n[G. Dep]\nYo, I got wild fed to earn, lead to burn\nStop sign on ya slot time, dead ya turn\nLotta cats gotta wait til they dead to learn\nPastor Rev. Sermen, Ya learnin\nIma wild card to play, guard ya pay\nGoodbye's hard to say, cause ya moms to pray\nYa lookin odd and gay, I'm modern day\nIma rep till I'm hard and gray, pardon me (may)\nIma make it hard today, bombs away\nLunach grenades, at your (??) and blaze\nCalm ya rage, I ain't even on ya page\nYa see-through like lingerie, guns in a large array\nHit tha door, kick the raw, spit that law, spits some more\nEverybody hit tha floor, I'm quick to draw\nFlows like hittin bitches raw, to sick to cure\n\n[Shyne - Hook]\nWe them niggas with big guns and big dicks\nFload ya block, and keep it gangsta\nWe them niggas with big guns and big dicks\nCoat Them rocks, and keep it gangsta\nWe them niggas with big guns and big dicks\nDrop the top, and keep it gangsta\nWe them niggas with big guns and big dicks\nWylin, stylin, and keep it gangsta"}]}