{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "[Verse 1]\nEverybody love it cause we do it with ease\nHop up online get your music for free\nThe blog is hot it's no longer on the down low\nA song side if it get a lot of downloads\nEverybody love it cause right before a hit drop\nAlready grabbed it off hot new hip hop\nBlog is like the shit talk coming at your neck\nCause fake shit coming well it doesn't get respect\nBlog's hit the net like a mufucking typhoon\nNobody dropping dollars on iTunes\nWebsites good to look at like a hot mom\nRap mullet allhiphop.com\nA lot of hate on hip hop game\nDudes like damn white boy is lame\nBut it's great cause i love hate\nSo listen fuck face\nI'm giving news, hip-hop updates\nYou want music? And all that fly?\nYou better do it like motor and blog or die\nIf you searching you'll come across sermon\nCuttin' up more than your everyday person\nAnd some blogs makin' no noise\nWhile others be putting up them two dope boys\nWe all rap and getting long cash\nPutting hip hop on smash\nExclusives, pictures, everyone can see me\nFrom DC to BC, bio page read me\nSee the kid rock punchlines fist pop\nAnd my first stops hip hop\nYeah, i keep the scene fresh hip hop dx\nSometimes i wonder what this music gon' be next\nV-necks to baggy clothes\nBlowing like alamo\nCheck the blogs you can see the youngin has the flow\nBalls like cockfights, jaws like dog bites\nDaily check up or nah, right?\nAnd i see dope, got me three phones\nI leak tracks like leak jones\nSo check how im ripping you\nYou other cats is pitiful\nFrom east coast to the midwest digital\nBars like cells and im armed well, yeah\nWith new music in my cartel\nI like the cigarette, check your mr x, yeah\nSee this life is just living deaf\nI got splash and lowkey heard that new\nOh new mac miller yeah i heard that too\nSo if i forgot to say your blog and you're showing love\nIm so high you can blame it on the bud\n\nBut i love all yall man\nGood luck everybody\nKeep putting up that free music\nAnd post my shit, damn!", "year": null, "album": null, "title": "Blog Is Hot"}], "artist": "Mac Miller"}