{"songs": [{"album": "Blacklight", "image": "https://images.genius.com/7024230a664e26c9a3b0c4fc89609ef5.1000x1000x1.jpg", "year": "2011-05-15", "title": "Need It Daily", "lyrics": "Dont get confused baby\nDont get confused (x4)\n\n[Verse 1: Tedashii]\nThe gospel got me so good, I call it super straight\nWas lame till He came, I know that you relate\nWas dead to Him but lead to Him, He rejuvenates\nStill can't believe He caught me up, yea elevated\nThat's how I know He got me, His love is never endin'\nAnd thats just like the Gospel\nIt's for sure is never pending\nNot just from my beginning\nKeeps me until im finished\nTakes me way beyond the grave. I'm saved, eternal livin'\nThis goes beyond conversion, this gift just keeps on giving\nIad it makes no sense to start and stop. Now pop that clutch and shift it'\nI'm hoping you don't miss it, this here is target practice\nI'm asking, \"What good are Beats By Dre if you can't grasp this?\"\n(Hah, uh-uh) That ain't even right man\nPlay it to the left of lust, mental pics, tight frame\nYou crop it like a close-up, then chop it like the chorus\nI'm tryna take you deep, call it Blacklight, mayne\n\n[Hook]\nAye this that good news music\nWe call it Gospel (x3)\nDon't get confused baby\nIt's what He used to save me\nIt's what He used to keep me\n(I, I, I) I need it daily\n(You, You, You) You need it daily\n(We, we, we) We need it daily\n(They, they, they) They need it daily\n(I) Yeah I need it daily\n(They, they they) Yeah I need it daily\n(You, you, you) You need it daily\n(We, we, we) We need it daily\nThey need it daily\n\n[Verse 2: Derek Minor]\nBoy let's get it clear, from the Lord's wrath I'm saved\nYeah I'm Gucci Mane, no Waka Flocka Flame\nSo secure in the Lord, no frontin' for people\nCause you can die stuntin' (Die stuntin')\nEvil Kenevil\nIn this New Jack City hold the world loosely\nHis Word keep callin' me, I'm itchin for it, call me Pookie\nSatan try to trap us like \"Go pursue sin\"\nI'm like \"Silly rabbit, Trixs are for kids.\"\nI know only in Christ we gon' be free\nThrough His blood we've been redeemed\nThem chains no longer holdin' me (Soooo)\nClique for the squad, for the love of God, boy we rollin' 40 Deep (and) When I want to run the love of the son through the Helper, get a hold of me (see)\nChrist died for us, we'll say He's a church fan\nI'm talkin' Gospel, minus the church fan\nI'd be a fool minus the Lord's hand\nSo I'm wrapped around His finger like a wedding band\n\n[Hook]\n\n[Speaking]\nGospel\nGrace through faith\nYo PRo\nThey need it daily\nIt's the gospel\nThis why we good (Oh)\n\n[Bridge]\nI'm good, I'm good\nLet's get that understood\nThe Gospel got me right for life, that's right that's what it do\nI'm good, I'm good\nLet's get that understood\nThe Gospel got me right for life, that's right that's what it do\nI'm good, I'm gucci. Aye, yeah that's what it do (x4)"}], "artist": "Tedashii"}