{"songs": [{"year": "2010-05-04", "image": "https://images.genius.com/eb6854c991aabb131bc059f24ab97e61.500x500x1.jpg", "title": "Children of the World", "album": "K.R.I.T. Wuz Here", "lyrics": "[Intro]\nJust in case you was wondering\nI did make the beat\n\n[Verse 1]\nYeah, cause we just (children of the world)\nAnd they wonder why we bang\nCause police do the same, that's the only rival gang\nI'm just sitting here, praying to my father\nTired of today, forever scared of tomorrow\nWhere's a scale I could borrow?\nCause living ain't cheap\nI dropped out of school, pops, cause college ain't free\nPlus college ain't me\nSitting in the class\nQuestions rushing in my brain but I'm too proud to ask\nTake it all in stride, teacher talking physics\nAnd I just want to be fly\nWhat good is a degree when there's no jobs to apply?\nAnd fast food won't do cause you overqualified\nI'm feeling like hustling\nTired of the foodstamps and budgeting\nRunning in so much work, we school-bus it in\nGod and our wrist the only things we be trusting in\nAll else fails, I'm in a casket like fuck it then\nEither get rich or die poor\nNigga fell short and got jammed, but he tried though\nI'm pretty sure my first words were \"survival\"\nLooking for the answers to my problems in the Bible\nCause we just (children of the world)\nTry and decode all the secrets\nMy conversations with God always seem leave him speechless\nAnd even when I was at my worst like \"we got to make this work\"\nMy girl found time to leave me\nToo broke to give a fuck, though\nMy past relationships got me like \"What up, ho?\"\nI'm just bitter, I ain't asking what you fuck for\nThats disrespectful, I admit\nI was just saying, if you wonder why I call you \"bitch\"\nCause we just (children of the world)\nGuess I look up to the pimps\nI ain't saying it wasn't wrong, but they had the freshest fits\nThe cars and the broads and the kicks\nIs something to strive for when you ain't never had shit\nI'm feeling like what the fuck\nThey want my soul like my ancestors' ain't enough\nIf I can't trust my own government, who can I trust?\nIf I abuse myself daily, who can I love?\nShorty might have AIDS like who can I fuck?\nSure enough that'll be the day that the rubber bust or I have a kid\nDeprived of all the things that my father did\nCause the momma was a groupie and I was on some rapper shit\nThey gave me Hell like I asked for it\nSigning everything under the sun but they ain't after K.R.I.T\nI guess I didn't swag enough\nStupid fruity pebble chain, Louis bag enough\nPopping tags, model bitches, couldn't brag enough\nBubba Kushy stupid loud pack, jet lag enough\nSteady acting like I ain't had enough\nTen chains on your neck like you ain't flash enough\nI wreck so many times, I guess I ain't crash enough\nOn the track like a pusher of crack, bag it up\nI tell these niggas to back it up\nMy bitch like scarves, gave the Louis rag to her\n'Sace shades on my eyes like I ain't seeing the hate\nToo fresh to death, I couldn't attend the wake\nThat's too lyrical, he been round busting\nMississippi where? He don't sound Southern\nHe be down cousin it's since '05, I swear\nThe game's a pound of Reggie\nSo anything I sell's a breath of fresh air\nYeah, fuck with me"}], "artist": "Big K.R.I.T."}