{"songs": [{"title": "Kontrol", "lyrics": "[Hook: AKA]\nI got that goose in the booth, no dash\nQuarter tank, 2am, puff puff pass\nBig body Benz no gas, swag\nSo when the party ends I'mma call a few cabs\nAaaahhh\n\n[Verse 1: AKA]\nSipping that goose, smoking that ooooo lalala\nGirls just wanna have fun, party like one, nanana\nSpend my funds, ShowTibz Love, Tibs, Boyzn Bucks\nPlease don't kill my vibe, no Bambinos in my ride\nHot sixteen no pedophile\nGuess I'm just, acting my age\nNiggas practising hate\nWent from 5 clippa to 25 steena a day\nSip champagne, when you order you should \"Parlez Vous Francaise\"\nThen we can take this back to my place, so what you say?\n\n[Hook: AKA]\nI got that goose in the booth no dash\nQuarter tank, 2am puff puff pass\nBig body Benz no gas, swag\nSo when the party ends I'mma call a few cabs\nAaaah\nI got a fist full of Madibas in my hand\nCatch me on a highway rolling with my gang\nKhuli Chana pop your collar, phuz'utshwala man\nThank God it's a Friday, here we go again\n\n[Verse 2: Da L.E.S.]\nAnd I be like uh oh, I'm so gone\nI'm so faded, I'm so blown\nLike how the hell did I get here, and how the hell am I getting home?\nI don't care bring more kush\nI don't care bring more domes\nKeep popping that pussy for me, it's bottom line, stone cold\nI go hard in the bank, fuck what you heard this my city\nMy eyes low, blowing dank cause only the realest ride with me\nMandela money that empowers me and a bunch of bad bitches that go wild for me\nCause I'm killing all of these bars bitch, now somebody order another round for me\n\n[Hook]\n\n[Verse 3: AKA]\nI got Givenchy on my back, your mami on my lap\nMy bottom row? That's solid gold. Diwali on my neck\nEgoli hoes chase phony bros, for Patek Philippe and Rolex\nBut that's how it goes, another episode, when I'm riding round in this Benz\nMy haters is quiet. My ganja's so loud\nThey call me Hip Hop Messiah flyer than your pantsula, woah\nI'm drinking and driving thinking 'bout money and power\nSmoking that sticky, eyes as chinky as Shinji Kagawa\n\n[Hook]", "year": "2013-04-13", "album": "Levels", "image": "https://images.genius.com/963ed72af6b68081dc449da63b1d2c81.1000x1000x1.jpg"}], "artist": "AKA"}