{"artist": "Astronautalis", "songs": [{"title": "Skeleton (Everybody’s Favorite)", "image": "https://images.genius.com/81fdfca910c475d1405c73c585bd6612.1000x1000x1.jpg", "album": "The Mighty Ocean & Nine Dark Theaters", "lyrics": "\"You're very beautiful\", he whispered at the girl on the beach\n\"It's amazing how the days just slip away through the unfurling of the weeks\"\nShe didn't speak, or even smile or reply\nHe repeated it again but the waves just swallowed all the words alive\nSandpipers chasing the torn paper edges of the waves\nAnother gust of wind paints her hair across her puzzled face\nOne of these days...he's going to escape and change the world\nCome back to his hometown with a trophy and a girl\nA girl like this with soft hands and a wise kiss\nShe'll teach him how to dance and dance her fingertips across her lips\nBut this...this is just another awkward pause\nA pretty pair of eyes uncomfortable in front of all his flaws\nHe feels himself going bald in little bits and patches\nUsed to spell out love in them but now the letters come out all backwards\nHis pants never fit him right no more, forgotten how to cook\nHe used to take the room and run but now he's happy with a second look\n\n\"Pardon me miss, could you blow me a kiss?\nLast night a couple of lovers tossed each other off that bridge\nI think I better just call it all quits\nI used to run this town but it just ain't the same place that it ever was.\"\n\nHe cut his finger just yesterday tracing a slender line in red\nAnd watched it drain into the sink, the only thing that's left\nA fingertip tipped down and drew another half a pint into\nA perfect portrait of himself subtle beauty in still life\nEveryone asked \"Oh no! What happened to your hand?\"\n\"Just another accident cutting vegetables I guess.\"\nEverything's a trap these days we're all working to prevent\nNo one ever thinks of escape, just take the hit and bang out the dents\nYou don't know why he's standing here or how he got this far\nUp the beach and out of reach of running rusted car\nThe waves are louder than a train crashing down upon his chest\nHe can't be dragged down like the rest and wait patient just for his death\nTaking off his hat he steps and brushes her hair away\nKisses her cheek gently and asks her for her name\nShe bows her head and smiles a bit and takes a shaky hand\nHe has no idea just what she said with the waves crashing in his head\n\n\"Pardon me miss, could you blow me a kiss?\nLast night a couple of lovers tossed each other off this bridge\nI think I better just call it all quits\nI used to run this town but it just ain't the same place that it ever was.\"\n\n\"Pardon me miss, could you blow me a kiss?\nLast night a couple of lovers tossed each other off this bridge\nI think I better just call it all quits\nI used to run this town but it just ain't the same place that it ever was.\"", "year": "2006-05-23"}]}