{"songs": [{"album": null, "year": "2010-08-06", "title": "Bun B for President", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1: J. Cole]\nBelow that Mason Dixon my residence\nDirty South Confederate\nAy we should hold election's I say Bun B for President\nHe represent them Real Niggas\nTX to ATL to NC yea them Ville Niggas\nThem Trill niggas chill nigga this that rider shit\nMy bottom bitch say \"I'm not a bitch boy I got a bitch\"\nI keep her ass in Prada shit\nThese rappers counterfeit\nI potty train niggas yea this that \"teach you how to\" shit\nI'm 'bout to shit my minds the Glock my mouth's the clip\nMy words is bullets I'm 'bout to spit\nI'll leave you leakin you lay in pieces\nAs if the streets a couch and shit\nYou see me on my bouncin shit\nWatch how I put you out this shit\nMan I'm makin so much money gotta pay somebody to count this shit\nProbably gonna make my accountant sick\nBoy I'm higher than a mountain's get\nThese new niggas ain't talkin bout nothin\nCause it's obvious they ain't been around this shit\nSo they bound to split\nWhen they go down, profound with these pronouns\nLadies lovin J. Cole now\nSo you better not bring yo ho round\n\n[Hook]\n\nYou know the residence\nDirty South Confederate\nAy we should hold election's I say Bun B for President\nHe represent them Real Niggas\nTX to ATL to NC yea them Ville Niggas\nThem Trill niggas\nHey\n\n[Verse 2: Dom Kennedy]\nYou know I represent, West Side Checkin in\nIf we gone hold elections I say Bun B for President\nHe represent them Ville niggas\nThat get yo money up without no record nigga\nThat's real nigga, Hey\nMake this left, we gone take it out West\nI hope niggas don't really mind\nI was just payin my respects\n\"The Game Belongs To Me\" is what I be bangin out my deck\nAnd I can understand why niggas sayin Dom is next\nLet's talk about now though\nI'm still the new nigga these new niggas look out for\n\"Well Damn Joe\" that's what Chicago niggas greet me with\nThese niggas really not eatin\nWatch who you see me with\nWait till a nigga blow up, watch who you peep me with\nI only want her for tonight man you can keep this bitch\nPeep this shit I got my 20's\nGot my 50's I got my hundreds I got my 1's\nA new night, a new city\nI did my show I gotta run\nTo the kids of America and all these fucking slums\nIf you want to be King then I suggest you vote for Bun\nA real nigga know, when a real nigga's done\nIf you want to be a King then I suggest you vote for Bun\nLike that"}], "artist": "J. Cole"}