{"songs": [{"year": "2015-12-24", "image": "https://images.genius.com/ace66fdbc86a2df1547c1f05ebaab042.1000x1000x1.jpg", "title": "Bosshafte Weihnachten 2015", "album": "Freetracks & Exclusives", "lyrics": "[Intro]\nAh!\n\n[Part 1]\nFreier treibt es zur Weihnacht in die Wohnbezirke, weil\nDer Schein der Lichterketten dem aus Rotlichtvierteln gleicht\nEy, der Ghettoveteran\nWill ich wissen, wie das Klima in der Hood wird, frag’ ich meinen Ghettowetterhahn, yeah\nBosshafte Weihnachten, es schneit auf die ganze Stadt\nGees legen deine Mom im Schein der Weihnachtsbaumlampen flach\nUnd was wir im Detail mit der Schlampe machen\nIst wie Eiszapfen: es hängt von der Neigung der Kanten ab, yeah\nUnd sollte sie, während sie Dicks saugt, nerven\nSorgen Pimpslaps für Ruhe und Gesichtshautschmerzen\nIch schenk’ ihr’n Neuwagen zum Trost, lass’ sie ’n Blick drauf werfen\nJa, die Bitch steht auf den Aston, wie Christbaumkerzen, hey\nAlles wieder gut, wir geh’n bei sternklarem Abend\nSpazieren, sie hält ein brandneuer Nerzmantel warm\nEs ist der gönnerhafte Boss mit seinem herzhaften Charme\nEr macht ihr zum vierten Advent die vierte Herdplatte an\nSchenkt ihr Spülmaschinentabs, sie freut sich übertrieben krass\nUnd springt vor Freude im Dreieck, wie bei ’nem Pyramidenschatz\nBietet mir oralen Sex, ich sag’ ihr: „Mach erst Abendessen (Los!)\nDenn es ist höchste Eisenbahn wie der Polarexpress!“\n\n[Hook]\nBosshafte Weihnachten, bosshafte Weihnachten\nPlätzchen in die Fresse, Mois, bosshafte Weihnachten\nBosshafte Weihnachten, kostbare Weinflaschen\nZum Glück weiß Santa nichts von den Mossadgeheimakten\nDenn wenn ich kein’n neuen Maybach krieg’\nMach’ ich ihm Feuer unterm Hintern wie mein Kamin\nIch wünsch’ dir bosshafte Weihnachten, bosshafte Weihnachten\nDie Plätzchen in die Fresse, Mois, bosshafte Weihnachten\n\n[Part 2]\nEy, der Boss! Down-to-earth wie ein Sternschnuppenschauer\nWenn er Stollen verputzt wie ein Bergtunnelbauer\nDu bist sehr zu bedauern in deiner Kleinbaracke (ohh!)\nDie mehr Baumängel hat als meine Weihnachtstanne\nIch feier’ mit deiner Mom, erst wird Lebkuchen genascht (lecker!)\nDann ein Winterspaziergang, als uns ein Schneesturm überrascht (hui!)\nIch sag’: „Besser, wir ziehen Leine, wie beim Fallschirmspringen\nRein in die Teestube, es ist nicht so kalt hier drinnen!“\nDa wird der Mac besorgt, wie in ’nem Applestore\nDoch egal jetzt, weiter im Text, bevor\nIch den roten Faden verlier’ wie Santas Hosennaht beim passieren\nMeines großen Gartens, wenn ihn mein Dobermann attackiert\nUnd das Trauma prägt sich bei dem Hurensohn sofort ein\nWie Ritzspuren von Schlittschuhen im zugefror’nen Dorfteich\nSeitdem rutscht der Kerl trotz kugelrundem Body\nVorsichtshalber lieber immer todesmutig durch den Schornstein\n\n[Hook]\nBosshafte Weihnachten, bosshafte Weihnachten\nPlätzchen in die Fresse, Mois, bosshafte Weihnachten\nBosshafte Weihnachten, kostbare Weinflaschen\nZum Glück weiß Santa nichts von den Mossadgeheimakten\nDenn wenn ich kein’n neuen Maybach krieg’\nMach’ ich ihm Feuer unterm Hintern wie mein Kamin\nIch wünsch’ dir bosshafte Weihnachten, bosshafte Weihnachten\nDie Plätzchen in die Fresse, Mois, bosshafte Weihnachten\n\n[Outro]\n„Das ist Weihnachten 2015 mit Kollegah dem Boss. Und wenn ihr auch alle schön bosshaft gewesen seid, dann gibt’s auch eventuell ’n paar Geschenke. Eventuell ... ah!“\nDer Jonathan kriegt ’n Dobermann\nMandy und Lars wollen nur MDMA\nAndré und Rolf kriegen Schlang'nledergolfsets\nDie Melanie ’ne Tellermine\nDer Gustav ... äh ... ’ne Schusswaffe\nUnd was ist mit Patze? Der kriegt ’n paar in die Fratze, yeah!"}], "artist": "Kollegah"}