{"artist": "Apache", "songs": [{"title": "Make Money", "image": "https://images.genius.com/7b040bdcfb9c6c3e03af2d9b25c4c25d.500x500x1.jpg", "album": "Apache Ain’t Shit", "lyrics": "[Pretty Tone Capone]\nAhh in the motherfuckin house!\nThis is the Pretty Tone Capone\nAnd I'm here with my motherfuckin man, motherfuckin Apache\nAnd don't give a fuck!\nHere to let you motherfuckers know how to make money\nSo whassup with that?  Loot for your pocket troop!\nY'knowhatI'msayin?  Wouldn't you rather be a rich bitch\nThan a fuckin broke hoe?  So bitches listen up\nAnd take heed to the motherfuckin word\n\n[Apache]\nYo I sleep all day, stay up all night scramblin\nMy palms got an itch, fuck a bitch, time for gamblin\nCee-lo, 4-5-6 with the quickness\nFlip trips, flip your script, and dump on my shitlist\nI doubt if you got the clout to outlast\nTime to get money, don't make me crack a can of whip-ass\nI'm kind of shady - rugged relentless and rude\nI'm cessted, drunk, plus I'm in a real fucked up mood\nSince the dough is low and the arsenal's thick\nI got a few tricks, I'm quick to pick a vic'\nPick 'em up, time to stick 'em up it ain't funny\nListen honey I want MO' MONEY MO' MONEY\nMake a move, try to swing, I knew you wasn't\nWanna live God forgives Apache doesn't\nSo to borrow 'til tomorrow just find a car shop\nPop the lock then drop it off at the chop spot\nLike Robin Hood, no fuckin good, that's what you wanted\nInstead of robbin the rich, I rob my bitch then go get blunted\nMy pockets are gettin thicker quicker I want more\nHere's the scoop troop, more loot than a money store\nIf you're broke, shut the fuck up (HO!!!!)\nI thought so - and I don't need a break hoe\nSpeakin of hoes and dough, they know how to spend it\nLadies listen up, let me talk to you for a minute, c'mon\n\n[Lady]\nYo wait, hold the fuck up\nYo Apache, how the fuck you gonna tell the niggas how to get dough\nAnd not tell the BITCHES how to get some money?\nThe fuck is wrong with you, you crazy or somethin?\n\n[Apache]\nHere's a few ways to get paid, proceed with caution\nTell your man you need money for an abortion\nCheck his pockets while sleep, creep, don't get caught\nDon't want him to take back all the shit he already bought\nKeep a stash, strictly cash, and think hard\nSee somethin you like?  Fuck it, put it on his credit card\nTell me who do you prefer, a man or a mack?\nOn the flip-flop, don't stop to shop at Jack's\nWith sex appeal, be real I don't understand\nFake hair and nails, and you're lookin for a real man\nSome dance for dollars, holla cause I know you know\nCause some plain old hoes just FUCK for dough\nUse your imagination, why think small\nInstead of takin half, fuck it, why not take it all?\nDon't be a dumb broad, a fraud, a phony\nYou just end broke, no blunt to smoke, and lonely\nUse your pussy as a tool, that's how you want it G\nDon't waste it, put it on sale, but never free\nFuck your way to the top, don't be a slob\nIf none of that shit works, then fuck it, buy the job\nIt takes more to be a rich bitch with big tits\nIf your man is broke, don't listen to his bullshit\nSpeakin of men, we know how to make the money\nBut it's up to you to take it honey\n\n[Pretty Tone Capone]\nWord to mother my motherfuckin man just told you what you had to do\nSo if you wanna just lay back and be blazed\nYou'll damn sure play the fool\nYou think we won't fuck the shit out of you bitches?\nYou better get real, word to mother\nWhat the fuck's up, what the fuck is goin on with that shit?\nA crook is 'sposed to have his hand in your motherfuckin pocketbook\nPlay yourself out\n\n(Make money money, make money money money)\n(Take money, take money)\n(Make money money, make money money money)", "year": "1993-02-09"}]}