{"songs": [{"year": "2012-07-24", "image": "https://images.genius.com/b28f41628e146430259753a9d1acaf9a.500x500x1.jpg", "title": "Hardbody", "album": "I.M. 4-Eva", "lyrics": "[Intro: Big Shug]\nOne two one two.. Yeah! Yeah! Just test, runnin see what's good\nYeah man hardbody man\nNiggas be thinkin man that you hardbody cause you be\nGettin steroids and liftin' weights off your chest and such\nHardbody is emotions man where we come from man\nThat's how we left it, uh huh!!\n\n[Verse One: Big Shug]\nI was beat at a young age\nSo everyday I walk around in a black rage\nBurned in my arm are street stripes\nI only bleed rhymes that reflect that street life\nThe grim reaper I give and take life\nFor me to lie on the microphone it wouldn't be right\nI get it poppin when the weapons are louder\nMy hands the permanent smell of smoke and gun powder\nFrom New England but fuck that clam chowder\nYou could make it rain, but I'm a make it shower\nServe nothin' but fishscale and rock powder\nHardbody by the minute hardbody by the hour\nBattle rhymes or spoken word\nThe outcome nigga, you two times herb\nBelly of the beast, or the placenta\nI'm the reason why mad niggas, walk around with dentures\nHardbody with a blue steel feel\nBlack gat called Dave spray Copper around the field\nHardbody turn you to cold body\nThen I go to the bar and sip coke with lime Bacardi\nWhile my niggas in the back, cuttin' your body\n\n[Interlude: DJ Premier Scratching] (Fat Joe)\nH-H-Hard-Hard-Hard-Hard-\"LL Cool J\"\nHardbody-body-\"Big Shug\" (Coca! Chrills Mania B.X. T.S.)\n(Follow the dons and models it's on!)\nH-Hard-H-Hard-H-H-H-Hard-Hard-\"LL Cool J\"\nHardbody-body-\"Big Shug\" (PREME! SHUG!)\n\n[Verse Two: Fat Joe]\nHardbody, Godbody the realest ever\nJust ask Preme if I bring the Terror\nSqueeze the mental until it's no forever\nUsed to like the Glocks but the chrome is better\nHa Ha! I'm just an old school cat\nWith an old school gat, that'll fold you back\nThem niggas get it poppin should've told you that\nDon't make me push your spine where your vocals at\nHa! (H-H-Hard-\"LL Cool J\" Hardbody-\"Big Shug) I mean you fuckin with Coca\nArms in the sky when the don got the toaster\nI blacks out like a G is supposed to\nStretch niggas out like Rosa Acosta (H-H-Hardbody-\"Big Shug\")\nYou ain't even close homey\nNigga bettin' millions on the horses and ponies\nEverybody real but the odds is they phony\n'Bout to rape the game like Mike did to Sony\n\n[Interlude: DJ Premier Scratchin]\nH-H-Hard-body-H-H-Hardbody-\"Big Shug\"\n\n[Verse Three: Lil' Fame]\nMy local game's official, bring that shit\nI got a dead arm like the Ying Yang Twin\nBut today's motto pour the liquor from the bottle\nIt's an everyday thang here today gone tomorrow\nWhen Fame walks in you feel the presence of a don\nWhen I shoot the gift it's the presence from the chron\nYes I stress that\nThe last place you stand is the place you'll be left at\nExpect that!!!\n\n[Verse Four: Billy Danze]\nYou new wave niggas! Are the spittin image of a pawn\nI'm a knight, hardbody like them niggas in the yard\nYou light! You niggas ain't about to cause harm\nTo a Bin Laden type rapper nigga with his clapper with him\nHighly respected good nigga in the town\nWhen you G'D UP!!! (BUCK BUCK BUCK BUCK BUCK BUCK!!!) Shut 'em down!!!\n(EASE UP!!!) We don't give a fuck shut 'em down!!!\nBig Shug's with me Danze niggas can't forget me hardbody!!!\n\n[Outro: DJ Premier]\nH-Hard-Hard-Hard-\"LL Cool J\"\nHardbody-\"Big Shug\"\nHard-H-Hard-Hard-Hard-\"LL Cool J\"\nHardbody-\"Big Shug\"\nHard-Hard-H-H-H-H-H-H-H-H-H-H-H-H-Hard-Hard-\"LL Cool J\"\nHardbody-\"Big Shug\""}], "artist": "Big Shug"}