{"artist": "Ace Hood", "songs": [{"title": "4 Da Hoes", "album": "Starvation 4  ", "year": "2015-11-03", "lyrics": "(Ace Hood  Talking)\nHehehe, see I like all different types of  flavors, you know, Puerto Rican, oh them Spanish bitches be good too\nWhat we doing tonight!?\n\n[Hook:]\nI got a few rolled up and my cup half full\nI am way too lit and I’m with my woes\nI got on designer, got on all this ice\nGot that foreign out front and it’s parked outside\nWe don’t want no problems, though we bout that life\nBring them bad ones through; I’m in town for a night, YEAH!\nShining my nigga, just know that I’m here for the hoes!\nI pull up the foreign:  I did it to get me some hoes!\nI’m faded, unfadedable, nigga don’t ruin my zone!\nYou smell the money that’s on me, that’s just my cologne!\nI know she with it, cause shorty in love with the dough!\n\n[Verse 1:]\nI walked in no talking, just rocks in my watches (whoo!)\nAll hoes I’m fucking, I can’t even acknowledge (yee!)\nGet money, mo money money your college fund in my pocket! (whoo!)\nJealous, they jealous these munchies yee' ain’t got them! (oof!)\nPop a pill and get charged up, how you feel? I give no fucks!\nYou, you, and your homegirl can meet me in the back of my tour bus!\nYoung nigga go way up, fuck her good with her legs up!\nCame in with yo girlfriend, but I leave with her cause she chose up! (OOH!)\nSaid she never fucked with a rich nigga (Sorry)\nI mean a real nigga, and I know just exactly what to do with her! (YEAH!!)\n\n[Hook:]\nI got a few rolled up and my cup half full\nI am way too lit and I’m with my woes\nI got on designer, got on all this ice\nGot that foreign out front and it’s parked outside\nWe don’t want no problems, though we bout that life\nBring them bad ones through; I’m in town for a night, YEAH!\nShining my nigga, just know that I’m here for the hoes!\nI pull up the foreign:  I did it to get me some hoes!\nI’m faded, unfadedable, nigga don’t ruin my zone!\nYou smell the money that’s on me, that’s just my cologne!\nI know she with it, cause shorty in love with the dough!\n\n[Verse 2:]\nFine, and she classy with a little bit of that ratchet!\nNot compared to these lame niggas that ain’t even in my bracket!\nMoney don’t make you real no, niggas be stunting in the rental\nNiggas get stuck in the friendzone, me and yo bitch in the Benzo!\nAnd we fly, hop on the flight to Dubai, fuck if you like it or not\nPuffin’ the lye, I am considered the guy maybe you must’ve forgot\nI want the world, I need the prettiest girl, I want the one with the curves\nGive her the word, you know the one you deserve\nWhile them other niggas get curved! (oooh!)\nSaid she, never got fucked by a trill nigga\nSexy black, eight pack throw the hip in her!\nAnd I know what’s gon’ happen when I’m done with ‘er! (laughs)\n\n[Hook:]\nI got a few rolled up and my cup half full\nI am way too lit and I’m with my woes\nI got on designer, got on all this ice\nGot that foreign out front and it’s parked outside\nWe don’t want no problems, though we bout that life\nBring them bad ones through; I’m in town for a night, YEAH!\nShining my nigga, just know that I’m here for the hoes!\nI pull up the foreign:  I did it to get me some hoes!\nI’m faded, unfadedable, nigga don’t ruin my zone!\nYou smell the money that’s on me, that’s just my cologne!\nI know she with it, cause shorty in love with the dough!", "image": "https://images.rapgenius.com/6e4c1fad4faaddddc13de80474a8678c.640x637x1.jpg"}]}