{"songs": [{"year": null, "title": "Let A Nigga Know", "image": "https://images.genius.com/6525d1888947cc49b5c9274e9ee2e289.400x400x1.jpg", "lyrics": "[Verse 1]\nLet a nigga know\nYou wanna go to war, bop\nYou wanna hear the 44 pop (Let A Nigga Know)\nYou wanna see the gun that will make more than just your jaw drop\n(Let A Nigga Know)\nYou wanna mess with the best\nBut do you want to save your mama some stress?\nNigga, if you really want to test\n(Let A Nigga Know)\nI'll come and chop you in half\nMy click is cuckoo for cocoa\nThey'll pop you and laugh (Let A Nigga Know)\nWanna do gun play?\nMonday through Sunday\nAll 52 weeks of the year\nAm I speaking clear? (Let A Nigga Know)\nYou feel my flow (Let A Nigga Know)\nEven though I'm so political\nAin't another MC as gangsta as me, shit I should be signed to Death Row\nUh, oh, there go Saiyo\nAK nine six at yo 5-0\nMind blow to your spinal\nYou only a thug on vinyl\nYou soft, I know\nAnd yo so is your rhyme flow\nI'm the only rapper to\nEver shoot up the club\nMe and my man Shyne Po\nI pop up in a hot car\nYou hop up in the cop car\nThen start telling the cops\nWho's selling the rocks\nAnd who the niggas on the block are\n\n[Hook x2]\nI puts it down\nI know they like the way my shit sounds\nBanging from the hood out to the hick towns\nEverything that I spit is hit bound, they on my shit now\n\n[Verse 2]\nGotta get that money like Krayzie, Layzie and Bizzy Bone\nTrying to take mine from me\nWhat kind of crazy shit is you on?\nLet a kid act funny, I'll lace him like when my kicks is on\nWe in the zone, nigga clips is thrown\nWe don't go to war with no sticks and stones, home\nWanna play Gin Rummy\nThen shuffle the cards and deal 'em out\nBut if you get picked up then\nThen we trust that you not going to squeal us out\nI'm in the cut with a chick\nWith a bigger butt than Trina\nAnd a better face than Jigga's slut\nNigga, I'm Saigon, you understand that?\nI bang them firearms, you wanna wear that?\nCause if you was, now you not\nYou done fucked with the wrong one, now you shot\nI'll even give it to a cop, motherfucker\nYou the chump, I'm not, motherfucker\n\n[Hook]\n\n[Outro]\nI put's it down, man, man, what, let a nigga know\nWho the best, let a nigga know\nMy name Saigon, man, see me in the streets\nDon't look at me funny, just, let a nigga know\nYou don't want drama do you? (Let A Nigga Know)", "album": "Warning Shots"}], "artist": "Saigon"}