{"artist": "Fat Joe", "songs": [{"year": "2010-07-27", "album": "The Darkside Vol. 1", "image": "https://images.genius.com/a346ed5d5bb8736594a9565557319edf.1000x1000x1.jpg", "lyrics": "[Intro]\nBitch ass niggas\nWelcome-welcome to the dark-dark(*scratches*)-darkside\n\n[Verse]\nPeep the piff, smoke blowin' through the sunroof\nSuede top, mink floors, outside sunny dew\nRims like 26, wrist watch extra chip\nAnd fuck ya baby momma, she can suck a nigga dick\nThis ain't the past, the present, I'm the future\nThey size me like I'm super but maneuver like a cougar\nJoe bazooka, I-E-D with the flow\nAnd I can show you how to get knee deep with the coke\nThis that genocide talk, they killin' babies again\nAnd there's lines around the block like it's the 80's again\nYeah, The Darkside and you don't wanna go to this place\nWhere I got special powers, I could punch a hole through ya face\nMore coca to taste, more bitches to beat up\nGot lips like Meagan Good, and a ass like Vita\nMost niggas'll go down if she tell 'em to eat her\nBut she don't love no more, she seen my episode of Cheaters\nI'm too high, whole 'nother zone, I'm far-fetched\nThey put me on the back of that yellow bus like Artest\nBut R. less, that's that sexy music\nYeah we playin' the background when I shoot it down like cupid\nTell shorty, \"Get the balls,\" the other two on the dick\nThe triple play is the deal, damn my life is the shit\nAnd this ain't about money, it's 'bout who's real and who's fake\nWho's really a gangsta? Who's fuckin' with Jake?\nI throw bodies in the lakes and the others I burn 'em\nStuff a apple in his mouth, and over fire I turn 'em\nIt's the reaper man, that'll still rob the reefer man\nAnd rap music ain't the only thing we deeper than\nMy nigga OG Muggs know we certified\nAnd we gon' throw the biggest party when Curtis die\n\n[Break]\nBit-bitch ass niggas\nWelcome to the dark-dark-(*Scratches*)-darkside\nWelcome to the dark-dark-dark-(*Scratches*)-darkside\nBitch ass niggas\nWelcome to the darkside\n\n[Outro]\nWe don't give a fuck\nNo politics, everything thrown out the window\nAny rapper see me, don't even dap me nigga\n'Cause I don't give a fuck about y'all niggas\nRedemption of darkside, nigga\nSuck a dick, nigga\nCoca", "title": "Intro (The Darkside)"}]}