{"songs": [{"year": "2014-11-04", "album": null, "image": "https://images.genius.com/58b06debd9900b8780a151e3675ff78c.1000x563x1.jpg", "title": "God Is Gangsta", "lyrics": "[Part I: u]\n\n[Intro]\nAh! Ah!\n\n[Hook]\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\n\n[Verse 1]\nI place blame on you still, place shame on you still\nFeel like you ain't shit, feel like you don't feel\nConfidence in yourself, breakin' on marble floors\nWatchin' anonymous strangers, tellin' me that I'm yours\nBut you ain't shit, I'm convinced your tolerance nothin' special\nWhat can I blame you for? Nigga, I can name several\nSituations, I'll start with your little sister bakin'\nA baby inside, just a teenager, where your patience?\nWhere was your antennas?\nWhere was the influence you speak of?\nYou preached in front of 100,000 but never reached her\nI fuckin' tell you, you fuckin' failure—you ain't no leader!\nI never liked you, forever despise you—I don't need you!\nThe world don't need you, don't let them deceive you\nNumbers lie too, fuck your pride too, that's for dedication\nThought money would change you\nMade you more complacent\nI fuckin' hate you, I hope you embrace it\nI swear—\n\n[Hook]\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\n\n[Bridge]\nLovin' you, lovin' you, not lovin' you, 100° proof\nI can feel your vibe and recognize that you're ashamed of me\nYes, I hate you, too\n\n[Skit: Jessica Vielmas]\nHouse keeping\n(Knocking)\nHouse keeping\n¡Abre la puerta! ¡Abre la puerta tengo que limpiar el cuarto!\n¡Es que no hay mucho tiempo tengo que limpiar el cuarto!\n¡Disculpe!\n\n[Verse 2]\nYou the reason why mama and them leavin'\nNo, you ain't shit, you say you love them\nI know you don't mean it\nI know you're irresponsible, selfish, in denial, you can't help it\nYour trials and tribulations a burden, everyone felt it\nEveryone heard it, multiple shots, corners cryin' out\nYou was deserted, where was your antennas again?\nWhere was your presence?\nWhere was your support that you pretend?\nYou ain’t no brother, you ain’t no disciple\nYou ain’t no friend\nA friend never leave Compton for profit\nOr leave his best friend, little brother\nYou promised you’d watch him before they shot him\nWhere was your antennas?\nOn the road, bottles and bitches\nYou FaceTimed him one time, that's unforgiven\nYou even FaceTimed instead of a hospital visit\nGuess you thought he would recover well\nThird surgery, they couldn't stop the bleeding for real\nThen he died, God himself will say, \"You fuckin' failed\"\nYou ain't try\n\n[Part II: For Sale?]\n\n[Intro: Bilal]\nOh, oh, oh, ohhhh, ohh, ohh\nOh, oh, oh, ohhhh, ohh, ohh\n(Breathing)\nWhat's wrong, nigga?\nI thought you was keeping it gangsta\nI thought this what you wanted\nThey say if you scared, go to church\nBut remember, he knows the Bible too\n\n[Hook]\nNow, baby, when I get you, get you, get you, get you\nI'ma go hit the throttle with you\nSmoking, lokin', poking that doja 'til I'm idle with you\n'Cause I (want you)\nNow, baby, when I'm riding here, I'm riding dirty\nRegistration is out of service\nSmoking, lokin', drinking that potion, you can see me swerving\n'Cause I (want you)\n(I want you more than you know)\n\n[Verse 1: Kendrick Lamar]\nI remember you took me to the mall last week, baby\nYou looked me in my eyes about four, five times\n'Til I was hypnotized, then you clarified\nThat I (want you)\nYou said Sherane ain't got nothing on Lucy\nI said, \"You crazy?\"\nRoses are red, violets are blue\nBut me and you both pushing up daisies if I (want you)\n\n[Bridge]\nNow, baby, when I get you, get you, get you, get you\nI'ma go hit the throttle with you\nSmoking, lokin', poking that doja 'til I'm idle with you\n\n[Verse 2: Kendrick Lamar]\nYou said to me\nYou said your name was Lucy\nI said, \"Where's Ricardo?\"\nYou said, \"Oh, no, not the show\"\nThen you spit a little rap to me like this\nWhen I turned twenty-six, I was like, \"Oh, shit\"\nYou said to me\nI remember what you said too, you said\n\"My name is Lucy, Kendrick\nYou introduced me, Kendrick\nUsually I don’t do this\nBut I see you and me, Kendrick\nLucy give you no worries\nLucy got million stories\nAbout these rappers that I came after when they was boring\nLucy gon' fill your pockets\nLucy gon' move your mama out of Compton\nInside the gi-gantic mansion like I promised\nLucy just want your trust and loyalty\nAvoiding me?\nIt's not so easy, I'm at these functions accordingly\nKendrick, Lucy don't slack a minute\nLucy work harder\nLucy gon' call you even when Lucy know you love your Father\nI'm Lucy\nI loosely heard prayers on your first album, truly\nLucy don't mind, 'cause at the end of the day you'll pursue me\nLucy go get it, Lucy not timid, Lucy up front\nLucy got paperwork on top of paperwork\nI want you to know that Lucy got you\nAll your life I watched you\nAnd now you all grown up to sign this contract if that’s possible\"\n\n[Hook]\nNow, baby, when I get you, get you, get you, get you\nI'ma go hit the throttle with you\nSmoking, lokin', poking that doja 'til I'm idle with you\n'Cause I (want you)\nNow, baby, when I'm riding here, I'm riding dirty\nRegistration is out of service\nSmoking, lokin', drinking that potion, you can see me swerving\n'Cause I (want you)"}], "artist": "Kendrick Lamar"}