{"songs": [{"album": "G.O.Y.A.", "image": "https://images.genius.com/fb7ecaddc1d29cc6370534f44a6e9ae8.1000x1000x1.jpg", "year": "2013-01-01", "title": "Cocaine Eyes", "lyrics": "[Intro: Wais P talking]\nJeah. Fuck is wrong with these hoes man? Goya boys bitch! Can't pull nothing past a pimp man. Trying to shoot them needles in-between hands and your motherfucking toes bitch. Hands all swollen, feet swollen bitch. Your feet done grow two sizes since I known ya. It been two weeks. Haha\n\n\"And now you hookers and hoes know how I feel\" - Snoop Dogg 'Nuthin But A G Thang'\n\n[Hook: Wais P] {x2}\nShe got heroine hands\nCocaine eyes\nDust in her pussy\nSyringe in her thighs\nMolly on her mouth\nIt's no lie\nI'ma substance abuser, she ruin your life\n\n[Verse One: Wais P]\nShe breath methadone when she sleeping\nPercocet preaching\nSo much white on her lip, look like she bleaching\nType of bitch, she a star in the evening\nMixing bars with the methozine\nBut she's still a 10\nI won't lie, I put the pussy on front street\nHad a fight with four dealers, I was one deep\nShe brought me $27,000 and that was one week\nSee I got my own addictions and that's dumb cheese\nShe said she knew a nigga she used to be fucking\nGot about, 60 in the safe\nAnd we can touch him\nHe hustle out of Boston but, really he from Brooklyn\nShe get him to her house, we rob his dorm while she blow him\nNow I'm thinking, \"Here's a foul creature\"\nI'm a pimp, I don't do stick ups\nI push the puss on model pin ups\nSkeet on a bitch neck and tell her \"Keep your chin up\nIt's gon' be alright.\"\nYou keep scheming, I'mma keep chilling in Coupes\nRocking karats/carrots like I'm swimming in soup\nI don't rap, I'm just giving you truth\nLiving the proof\nSuffering from alcohol abuse\nThis is how these hoes move\n\n[Hook]\n\n[Verse Two: Termanology]\nAyo she walk through the valley in the shadow of death\nNicotine on her breath, dry semen on her chest\nShe a bad bitch\nMake your bitch look average\nDon't cook or clean but damn she mean\nOn the mattress she do things that make you wanna backflip\nHave you spending all your cash on fake lashes\nProphylactics, pussy pads and wine glasses\nDouble stack ecstasy packs and high fashion\nThe Tantric sex will have you trying to hand her checks\nFunny how we used to call you a pimp\nNow you turnt out\nBurned out is how you turned out\nEvery time you went in your pockets she had her purse out\nDirect deposit, hustling them hand outs\nRemind me of them dirty bums with the cans out\nHa\nYou used to love her but she ran out\nAnd soon as she figured out your cash ran out\n\n[Hook]\n\n[Scratching Snoop Dogg on 'Nuthin But A G Thang']\n\"And that's realer than real\"\n\"And now you hookers and hoes know how I feel\""}], "artist": "Termanology"}