{"songs": [{"title": "Bounce", "album": "U Gotta Feel Me", "year": null, "image": "https://images.genius.com/1fc0055c4256c840855a7bbf297945cd.640x640x1.jpg", "lyrics": "[Lil' Flip]\nYea, this track right here making them bounce - y'know\nJump in the chevy and bounce\nYea, uh, play ya skillz on the track\n\n[Chorus 2X: Lil' Flip]\nNow bounce for yo click nigga! (bounce)\nBounce for yo hood and throw it up\nThrow it up, throw it up!!(where you from)\n\nNow bounce for yo town nigga! (bounce)\nIt's goin down, throw it up\nThrow it up, throw it up!!(where you from)\n\n[Lil' Flip]\nNow where you from?\nHomey Im from the southside (southside)\nAnd when I pull up it the maybach and leave your mouthwide (mouthwide)\nYou better get your mind correct like the color changing clique\nBefore I correct your mind and fuck around and bang your chick (nigga)\nOne time for all my ladies, 2 times for all my thugs\nIf you wearin a fake jacob you know you a scrub\nYou gotta step it up, I got a special cup\nI get my shine on\nBut no these ain't no rimestones\nI got my clothing line\nI got my liquor coming\nAnd if you on a verse each part 1500\nNigga you do the math\nI never use a cab\nI'm from the dirrty, I rock custom jerseys\n\n[Chorus]\n\n[Lil' Flip]\nI pack a k nigga (k nigga)\nI blow that haze nigga (haze nigga)\nI'll be at frisco fuckin with them bay niggas\nThem niggas bump screw, and they will jump you\nThey pick me up from the airport with them pumps foo\nAnd we ready nigga so bring it on ho\nI be at Harlem nights but don't step on my big toe\nOne time for all my gangstas, 2 times for all my wankstas\nI made a lot of yall careers and and yall ain't tell me thank ya\nBut Im a grown man, I hold my own man\nNot from ATL but I'm killin Mikes like Killer Mike\nHalf the time I don't write\nI just grab an ounce\nTell play to fresh record\nAnd watch these niggas bounce\n\n[Chorus]\n\n[Lil' Flip]\nI'm on luda shit, screwed up, track 8\nPlus I did rock n' roll with Fam Lay\nIn VA, Norfolk to be exact\nI did a track with Swiss Beats, yea I got that crack\nMy niggas got my back\nYo niggas quick to run\nAnd leave you there lookin dumb (now that's gangsta)\nOne time for all my pimps, 2 times for all my hoes\nI went from gold, white to plat\nBack to rosegold\n\n[Chorus]"}], "artist": "Lil Flip"}