{"songs": [{"year": "2016-01-13", "title": "Videodrome", "image": "https://images.genius.com/31f2b72c5881d6472c42ba99a09502bf.700x700x1.jpg", "lyrics": "[Intro]\nWhat about it Nicki, is it socially positive?\nWell I think we live in overstimulated times\nWe crave stimulation for its own sake\nWe gorge ourselves on it\nWe always want more whether it's tactile, emotional, or sexual\nAnd I think that's bad\n\n[Verse 1]\nNights are longer, days are shorter\nTime gets longer, patience shorter\nI just wander pacing forward\nLike a monster, stay De Goya\nDead from the start, mark of the beast\nHeart that I eat, armed to the teeth\nAn intellect, sharp, bleak\nIndifferent, war, peace\nFood for thought they force-feed\nThat bla bla bla of a blasé god\nI got a suicide that’s forming\nA warning for a deadly price\nI know I’m not the steady type, I’m lost in heady highs\nI’m an artist, man, I’m drawn to sketchy types\nCrabs in a bucket that I’ll probably kick if I don’t watch ‘em\nHashtag my blood but there’s no audience for psychodrama\nLook what the tiger brought in, death, death by dishonor\nUltraviolet on it, show me where they hide the bodies\nInside the audio I probably own a few examples\nTooth enamel planted in the hand that fed a losing battle\nSoon Seattle’s gloomy atmosphere\nCan steer me to the shadows\nBooze tobacco, moody adults\nAll the blessings they throw at you\n\n[Hook]\nLong live the new flesh\nMolly hits, group-sex\nLong live the new flesh\nKlonopin, booze, X\nLong live the new flesh\nAudience-approved death\nLong live the new flesh\n\n[Verse 2]\nA blind stupor prying at the sutures\nI set fire to their dry sense of humor\nThey’re alive but they’ll die in the future\nPeople I remove from my side like a tumor\nThey didn’t notice me when I acted balanced\nThey didn’t notice when my dying was an art\nThey didn’t notice me when I planted flowers\nBut I bet they’d notice with a knife inside their hearts\nIf I stab deep, add ‘em to the tally\nToe-tag ‘em, bag ‘em & can ‘em up for the trash-heap\nAnd that’s some fitting title usage if you ask me\nI hope they get diseases from the music that’s so catchy\nThere must be something in the water, right?\nRoot of all evil, power of the dollar, right?\nTwo can keep a secret if one of ‘em is slaughtered, right?\nFuck, marry, kill & they still don’t get the order right\nRight? You see I write with my right hand\nRight now, write down, rights of a righthand man\nWho was left on a left-hand path\nSo I’m Plath with the deadpan that\nMeans I’m Colossus in my head\nDoing aerials I’m Ariel & falling to my death\nStomping over cities that their god must have neglected\nInstead left an admonishment of long live the flesh\nDeath to the Videodrome & that’s an order not request\nSo conform or get the wreck, uh\nA Klonipin & a cardiac arrest\nLeft an overworked artifact, a heart attack is next, uh\nSo I don’t lollygag my steps\nThere’s no tardy pass in hell, there’s no sorry that can fix\nFrom over-sleeper to insomniac & stressed\nI’m a somnambulist walking right into the hands of them", "album": "Salo Sessions"}], "artist": "Sadistik"}