{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "How the Fuck Would You Know", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "[Intro]\n(\"Why you need to cross over? Why are niggas always crossing over something, huh?\nWhat's the matter, huh? They can accept our music as long as they can't see our faces?\")\n(\"Man, first we build up a strong crossover audience, then we can come out strong\nCrossover ain't nothin' but a double cross\nMan, once you lose the audience, we never gonna get them back\")\n(\"Well, it's like that\") *scratched*\n\n[Verse 1]\nMy pockets is not expended 'cause I got it\nYo, you wanna flam, goddamn, don't start it\nMake a mistake and try to hit the master\nBut I duck fast plus I swing faster\nWaste no time and I don't hesitate\nGet in that ass like Preparation H\nSee, I rocks the rhymes, I rocks the cuts\nAn Almond Joy, not a Mounds 'cause I got big nuts\nJump outta line, ya get a knuckle shampoo\nGoes the nine yards plus an extra too\nSee, brothas do crimes and they go to jail\nSaying rhymes so cheap their name should be wholesale\nBut I gets the dough when I do the show\nChinese girls, they call me Dick Swing Low\nThat's how it is, baby, that's how it go\nAnd if I didn't tell you, how the fuck would you know?\n\n(\"When it comes to this\" \"bitches know my status\") *scratched*\n\n[Verse 2]\nI've been around the world, met all types of floozies\nJoan, Joannes, and Suzannes and Suzies\nI put 'em to a test and see if they can pass\nA foot to they ass to see if they can last 'cause\nI'm the gentleman, very instrumental and\nExecute a style that can even move a mannequin\nThe successor, casual dresser\nGrab your girlfriend and I just bench press her\nExcite her with a thought that's so damn perverted\nShit's so nasty it's hard for me to word it\n'Cause I reach and grabbing it, stab, stab, stabbing it\nPositive K and you know I'm not crabbing it\nThe rhymes are gravel and long like a javelin\nWhen I fuck the hoe, I leave the damn bitch babblin'\nTalking about, \"Where am I? Who, who did it?\"\nShe turned and see me smiling saying I'm the one who hit it\n'Cause I'm the gigolo, humping for the dough\nAnd if I didn't tell you, how the fuck would you know?\n\n(\"Ain't no doubt, you get knocked in your mouth\") *scratched*\n\n[Verse 3]\nNow now, it's only right that I say something clever\nSo you could hold your head and say, \"Damn, I never\nHeard somebody say that the way he said it\nHow did he do it? Yo, where did he get it?\"\nIt's an ancient secret, listen and peak it\nPay close attention on the way that I freak it\n'Cause it's special, kinda abnormal\nNeed to dress up because this is informal\nSo, charge, but be at your leisure\nGrab your MasterCard, no, better yet, your Visa\nWhen it comes to hangin' I can swing like a monkey\nKnow how to dress plus my hairstyle's funky\nAcrobatic, charismatic\nAsiatic, no, not a crack addict\nSee, when I vote, I vote Democratic\nAnd I can rock a rhyme with just static\nA like that y'all, and you don't stop\nNever find the Positive at the crack spot\nYeah, that's how it is and that's how it go\nAnd if I didn't tell you, how the fuck would you know?\n\n(\"And if I didn't tell you, how the fuck would you know?\") *scratched*\n\n[Verse 4]\nSee, I'm the type of guy who's smart and good-looking\nNever caught me hanging out at central booking\nSome seem to think I'm lowdown and I'm shady\nSaid I make my living off a certain type of lady\nJust because they call me the woman recruiter\nI look upon myself as the hot cum shooter\nSpeaking of cuter, I say that I'm live\nYa see, I made Billy Dee sell Colt 45\nThat's why I get girls and short them like laces\n'Cause I can bone 'em all standing back 50 paces\nRide 'em up and down just like a see-saw\nMake her shout, hurt the shit as if she played on Hee-Haw\nBut it's no trick, it's just a whole lotta dick\nAnd when it comes to choosin', y'all know who they pick\nThe man pulling girls better than a tow truck\nGuys don't like it, I don't give a flying fuck\n'Cause when I get a hoe, ayo, I got a hoe\nAnd if I didn't tell you, how the fuck would you know?\n\n(\"Ladies shout my name for the next decade\") *scratched*\n\n[Outro]\nLaz-E-Laze don't give a fuck\nMy man Kid Capri don't give a fuck\nUh, he don't give a fuck\nThe Easy L.G. don't give a fuck\nThe mighty Zulu Nation don't give a fuck\nUh, they don't give a fuck\nBig Daddy Kane don't give a fuck\nAnd if I didn't tell you, how the fuck would you know?\n\n(\"And if I didn't tell you, how the fuck would you know?\") *scratched*", "year": "1992-11-03"}]}