{"artist": "Boosie Badazz", "songs": [{"album": "Bad Azz", "title": "Exciting", "year": "2006-10-24", "lyrics": "[Talking]\nThis Boosie Bad Azz, and lemme tell you somethin\nWhen I was 16 or 17, my momma looked at me and she said\n\"Boosie, son... get on yo mothafuckin shit, nigga!\"\n[Hook]\nBig money! I like it\nI used to have hoes who triflin'\nNow I got pros who dykin'\nAnd it's excitin, it's excitin'\n\n[Verse 1- Lil' Boosie]\nI had to get my shit together mayne, I didn't like it\nI had too many hoes who triflin\nDirty shell toes and Nike's\nI didn't like it. It wasn't excitin\nUntil I got money, I got icy\nHoes got right, they got feisty\nTurk put me in the studio, I kept writin\nDroppin that gangsta shit, and it's excitin\nPurple after purple nigga, we kept lightin\nConcert after concert mayne, we kept flightin\nWe struck the world real quick like lightning\nYou pussy ass rap niggas, stop bitin\nI used to fuck with little girls with little minds who wasn't grown yet\nSo before you wear a thong, get yo pussy in check\nYo hygiene a mothafucka, you 'sposed to stay smellin right\nEspecially if you got a nigga with money, that's what he like\n\n[Hook 2x]\n\n[Verse 2- Lil' Boosie]\nAnd all of my shows be excitin\nHoes grabbin on my dick, wanna bite it\nDidn't yo momma teach you better? You triflin\nJust Chill, after the show you can lick me like icing\nMoney make yo life better so fuck what they say\nGirls be more G'd up everytime they look in ya face\nShe used to kiss me on my neck (uh huh)\nNow she suck me til that pussy get wet (uh huh)\nI remember way back when I used to fuck rats\nWhen they wore them daisy dukes, had that pussy sittin fat\nNow a nigga gettin stacks, I do whatever I like\nI'll hit em Asian, Black or White, I have my pleasure with dykes\nI'm first class on every flight, I'm a big dog, nigga\nAt the Super Bowl, I'm front row. Where's y'all niggas?\nI used to fuck with hoes who like to cut ya tires up\nNow I'm breaded and they can't even get a nut\n\n[Hook 2x]\n\n[Verse 3- Webbie]\nI been livin like a tymer, and I like it\nHittin niggas baby mommas and they wifey\nWith the rims all shiny, dressed nicely\n'Bauds wit the white tee, fresh white tee\nNice white two-seat or I might be\nNew SUV, doin 90\nLookin for the right weed for the right fee\nHit it once or twice, B... my eyes tightening\nNow I'm goin faster, I swerved slightly\nTo the left lane then I came back right\n.357 clutched tightly cuz it might be\nMy night, you know we got niggas dyin nightly\nTonight I'm with a nice freak, she had white sheets\nClean up, lick a nigga nuts cuz she like me\nFind another me up in the streets is unlikely\nDon't hit me on the phone later on cuz I might be gone\n\nChorus 2x", "image": "https://images.genius.com/1edf8d86f3bd1ff77034e3f9f9daab5b.640x640x1.jpg"}]}