{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/4fcb08628a976b0e7a93328c8217f3bc.495x495x1.png", "title": "​i can’t beat sonic adventure (freestyle)", "year": "2015-05-26", "album": null, "lyrics": "I never met a pill I didn't know how to take\nI never met an emotion I didn't know how to fake\nI never met an issue that I couldn't debate\nI never met another rapper that I wanted to date\nI never got a tattoo that I didn't regret\nNever been told a name that I didn't forget\nI never been in a fitted that I could fit on my head\nI never made a video you didn't embed\n\nI need a new pair of shoes and my hair done\nWhere's Sonny Moore?\nDamn, am I gonna meet a millionaire's son?\nI'm bored of being the rare one\nI'm the chair woman, never take a dare\nI don't really care for 'em\n\nNever met a bouncer that I couldn't convince\nNever been at a social event and ever fit in\nI never had an ex I didn't kill on the Sims\nI never lived in a city I didn't leave on whim\nI never showed up to a party in appropriate clothes\nNot allowed to use an oven or stove\nI never made it in the city, couldn't handle the snow\nNever goin' to back to Brooklyn now 'cause everything closed\n\nI write a lot of songs, all hits\nY'all sit down and take it in like cows at a salt lick\nMall shit, you know I'm a loud chick called Kit\nWant a lesson? I could show you walrus's ball tricks\n\nPretend you never saw this\nI'll be at the prom in Givenchy, all lit\nI'll be at the pageant bringin' all this, all glitz\nI'll be winnin' sashes and I'm magic with the paw-prints\n\nLove carbs but I know to restrict 'em\nAnd I don't own no bras 'cause I don't ever fit 'em\nAvoid the college and fraternity, 'cause all of 'em dicks\nI forward all to my attorney, so it's always legit\n\nI never bother with censors\nI can't beat Sonic Adventure\nBut I'll beat all of you featherweights\nSay you're brolic, whatever\nAm I exotic? I bet\nAnd I been iconic forever\nI dig up all of the treasure\nAnd I'm biotic, I'm Shepard\nTell me I'm not on your level\nYou need to halt and get clever\nI know your mom think you special\nI'll pull off all of your petals\nI can't be bothered with censors\nI can't beat Sonic Adventure\n\nI never bother with censors\nI can't beat Sonic Adventure\nI never bother with censors\nI can't beat Sonic Adventure\nI never bother with censors\nI can't beat Sonic Adventure\nI'll fuck your girl and your neighbor\nNeighbor, with a B\nGod"}]}