{"artist": "Cam’ron", "songs": [{"title": "Devils Clutches", "album": "1st of the Month Volume 3", "year": null, "image": "https://images.genius.com/390c9aac32c9aabf5a4d8c5fd97a66cd.1000x1000x1.jpg", "lyrics": "[Intro:]\nShe’s the devil on the dick [x5]\n(Now turn it up!)\n\n[Verse 1:]\nShe got on her knees, started givin head shots\nShe had my dick jumpin, so she put it in a head lock\nI call her Wilma, (why?) cause she made the bed rock\nShe sucked it and jerked it perfect, I bust in her dreadlocks\nWe went to Walgreens, I almost flat out\nShe said \"you really that nigga, look, look, yo movie in the red box\"\nShe got the thing, we watched the shit\nNow she masturbatin, she looked at me and she said flee\nOne word to the shot, fasten these sheets!\n(Now turn it up!)\nShe got what you need, high speed, nigga passin me?\nI say, yeah, but be yourself, here’s an application\nWe got in the car on the floor, I put dat mouth an shit\nTook off d seatbelt, ova my pants\nPulled it out, it’s d devil on d dick, woooo!\n\n[Chorus:]\nI'm the devil on the dick [x4]\nI’m-I’m-I’m-I’m the devil on the dick\nDevil, the devil, I’m the devil on the dick\nDev-dev-devil, I’m the devil on the dick\nDe-de-de-de-devil, I’m the devil on the dick\n\n[Verse 2:]\nStart callin names again, it's all a game to him they all ashamed of him\nWe all fake raps on a call d game again\nSend me fuckin home, d ball an chain again\nThere she lay, then she say, “damn, Cam you’re not at all the same man since”\nShe titanium, gave me cranium, nimble on the dick, female demon\nGrabbed d head made it hard to breathe, she choked, then spit, then goggle me\nThat act for hair money, said here, honey\nHere's yo shampoo, wash yo weave\nBy the way, that's sold by JuJu\nLove how we mix d old wit d new new\nMy partner Chico, I play Rico, but I'm on like Lulu\n(Now turn it up!)\nI'm the connect, Felipe-flee, but I ain’t gettin murder, though\nSmokin dat herb, we’re right on d curb\nDem birds all flip flip flip like a burger yow\n(Like who?) like Mickie D’s\nLet’s set it off, cause you’ll get a Big Mac click clack\nAn yo girl will get dat special sauce\n(Now turn it up!)\n\n[Chorus]\n\n[Verse 3:]\nI’m d devil on d dick\nBadass bitch I’m d thigh on d wrist\nTold y’all bitches, devils to a dick\nAss so fat look heavy on a dick\nThrow it back like whiplash\nDis pussy offers as a gift wrap\nRidin roun in dat new coupe, top down I’m JuJu!\n(Now turn it up!)\nTell d guy pussy cape on\nEat dis pussy my cake on\nDis pussy wet like a rainstorm\n(dis pussy wet like a rainstorm)\nClimb dicks like poles nigga\nHit it like I owe nigga\nMake me curl my toes in, this yours nigga this yours nigga\nRide dat dick like a faux rilla\nNeed a roughneck not a whole nigga\nHis dick’s small, is yours bigga?\nNigga on here fo’ like four minutes\nI’m like “nigga please, don’t need a four getter”\nI need a nigga dat can go all night\nGood head, long pipe\n(I’m the devil on the dick)\nYou damn right!\n(Now turn it up!)\n\n[Chorus][x2]"}]}