{"songs": [{"lyrics": "[Produced by Just Blaze]\n\n[Intro]\nIt's Dynasty, niggas… as promised\nThe world's most infamous, Roc-A-Fella Records\nThis is Roc La Familia\nIt's Young Hova, Beanie Sigel, Memphis Bleek, Amil-lion\nIt's the Dynasty, niggas… 2000 to infinity\nThis is ghetto to ghetto, gutter to gutter\nStreet corner to street corner, project to project\nWorldwide… walk with us niggas!\nHoffa… Dash… it's the Dynasty, niggas!\nCheck it out!\nUhh, walk with me… talk to me… yo…\n\n[Verse]\nThe theme song to The Sopranos\nPlays in the key of life on my mental piano\nGot a strange way of seein' life like\nI'm Stevie Wonder with beads under the doo-rag\nIntuition is there, even when my vision's impaired, yeah\nKnowin' I can go just switchin' a spare\nOn the highway of life, nigga it's sharp in my sight\nOh! Keen senses ever since I was a teen on the benches\nEvery time somebody like Ennis was mentioned\nI would turn green, me bein' in the trenches\nHim livin' adventurous, not worryin' about expenditures\nI'm bravin' temperatures below zero, no hero\nNo father figure, you gotta pardon a nigga\nBut I'm starvin', my niggas, and the weight loss in my figure\nIs startin' to darken my heart, 'bout to get to my liver\nWatch it my niggas, I'm tryin' to be calm but I'm gon' get richer\nThrough any means, with that thing that Malcolm palmed in the picture\nNever read the Qur'an or Islamic scriptures\nOnly Psalms I read was on the arms of my niggas\nTattooed, so I carry on like I'm non-religious\nClap whoever stand between Shawn and figures\nNiggas, say it's the dawn, but I'm superstitious\nShit is as dark as it's been, nothin' has gone as you predicted\nI move with biscuits, stop the heart of niggas actin' too suspicious\nThis is, food for thought—you do the dishes!", "title": "Intro (Dynasty)", "image": "https://images.genius.com/c91a9bc0eb9aaf290224ebeaabd243a0.640x640x1.jpg", "year": "2000-10-31", "album": "The Dynasty: Roc La Familia"}], "artist": "JAY-Z"}