{"songs": [{"title": "God, WYA?", "image": "https://images.genius.com/c5061886a178315bbc6fa9e9f4f1b023.500x500x1.jpg", "lyrics": "[VERSE: DeShay at 5 years old]\n\nI'm screaming \"God, WYA?\"\nI look up in the sky, I know you staring back\nNot sure the reason why you have me here, in fact\nRare and black, derelict, guess being blessed is where I lack\nIf all I got is my nuts, I'm lucky to have a pair intact\nI'm having troubles at home, I'm starting trouble at school\nThat type of shit'll make it hard to fall in love, but its cool\nBehind these glasses and these watery eyes, I hope I see the sign\nAin't one for wasting time, I rather let the blind lead the blind\nWhile most of these niggas follow in line\nI got my own mind, so I'm following mine\nSo fuck swallowing pride, I won't swallow shit\nI rather kiss my brain with a hollow tip\nThis wisdom couldn't fall from Aristole's lips\nI never learned the politics, never the model kid\nConstantly out of it, daydreaming of being in a room with Pharrell gotta me constantly sick\nQuestioning God, now I gotta repent\nIt took a lot just to acknowledge the shit\nI'm popping, now she wanna polish the grip\nBukake in a new Bugatti and dip\nFinally got the key and now you fucking with a locksmith\nWas a good boy, now he gone bad\nMade it out alive and I ain't going back\nGetting bored of boarding planes, storing bags\nFall asleep, I'm balling in a foreign Jag'\nI hit the stage, I'm feeling highly elated\nFoust my brother, feeling highly sedated\nPeople prolly wondering how we related, nigga we made it!\nWe pulling bunnies like it's magic\nWe counting money and we laughing\nBut don't get it twisted, far from rich, but bougie bitches blowing kisses when we passing\nPut that on the green like we golfing, she blew the top like a dolphin\nBury me with a bitch in my coffin\nThey won't ever see me often\nI don't listen, why you talking?\nI don't listen, why you talk?\nThese spineless niggas tryna walk?\nThey love when I fuck up a check\nSpend it, then stashing the rest\nFinna invest like a chest, yes\nNothing more, nothing less\nNaruto said it the best, \"Question your belief, it'll be over\"\nNever trip to finish last, cash in every single chip that on my shoulder\nThe city got me growing colder, I'm more than happy to admit\nWake up every morning, know I gotta get it\nI'll be damned I'm dying with a Honda Civic\nFound a fountain full of youthful water flowing from a spigot, got me vamping like a misfit\nThoughts to end it with my wrists slit\nGet pushed out my mind, I don't wanna stop\nThink it's over, when I know it's not\nFans that's feigning for some more to drop\nAlways stop me for the photo op\nHaters prolly say it's Photoshop\n4AM I hit the store and cawp\nA couple Redbulls for the nights I wake up in a cold sweat\nDream of life, living no stress\nI'll just work it out like a Bowflex\nWhen my time comes and it's all said and done, wondering what I'm gonna find next\nKnow that even if I never get the cred, I'mma die knowing I'm the best\n\nWell, either way...\nAnd that's all that I got", "year": "2016-11-16", "album": "goldUn Child: 2"}], "artist": "Ace Hashimoto"}