{"artist": "Apathy", "songs": [{"title": "Crew", "image": "https://images.genius.com/02aebcb0fb715a5326e27a29acced0ca.172x172x1.jpg", "album": "CC: Weekend At The Cape", "lyrics": "[Hook 1: Sample from Buckshot on Black Moon’s “I Got Cha Opin (Remix)”] (x2)\nMe and my crew walk the streets at night\nLike looking for the right one, baby\n\n[Verse 1: Apathy]\nYou better watch your mouth\nGet carried away and you'll get carried out\nIt's the king of Connecticut, looking very Sperry-ed out\nYou just gotta buy the album to find out my whereabouts\nAnd you could tie me to a sail but still never air me out\nSummertime, I let the Beemer out, make 'em scream and shout\nYou the type of ratchet bitches they be making memes about\nThrow some holy water on 'em, gotta get them demons out\nPat these bitches on the back, they’ll spit a little semen out\nBang bang, shots fired, but you scared to say my name\nSuckers trying to block my lane like drink service on a plane\nGroupies trying to give me brain like The Beatles “Penny Lane”\nEvery lame trying to play me they songs, it's all the same\nAnd it's funny how these trashy bitches call each other basic\nLike Medusa with a mirror ‘cause they're terrified to face it\nBitch, go get a face lift.  Better yet, go get a spaceship\nI'll shoot you to the moon with one boom when the bass hit\nBukkake till your face drips, so go ahead and taste it\nThat's a million children I just wasted, so don't waste it\nThese white girls is wasted, flaky, Space Cases\nThey dropping N-bombs like they racist\nAll day, while...\n\n[Hook 1: Sample from Buckshot on Black Moon’s “I Got Cha Opin (Remix)”] (x2)\nMe and my crew walk the streets at night\nLike looking for the right one, baby\n\n[Hook 2: Sample from Stephanie Mills’s “You and I”]\nYou and I could be together for all...\n\n[Hook 1: Sample from Buckshot on Black Moon’s “I Got Cha Opin (Remix)”] (x2)\nMe and my crew walk the streets at night\nLike looking for the right one, baby\n\n[Verse 2: Suave-Ski]\nRolling downtown, trying to find another bird\nWatch the whip swerve, observe the suave flow of words\nPull up to the curb, curvy made her curtsy in a summer dress\nUnimpressed, I just want to see shorty come undressed\nCumming on her breasts ‘cause I heard that cum on the flesh\nIs way better than lotion.  I'm so cunning and fresh\nAnd now that Suave's on the job, tricks slob on my knob\nY'all are frogs on a log trying to swallow pollywogs\nI'm a problem for blogs, bust globs on a blonde\nMake her ass jiggle like fat blobs get a job\nTake some groupies to the movies then to Ruby Tuesdays\nAnd make them do me two ways.  I'm too blazed\nI get away like a ghost—that's how it's supposed to go\nI see it, I want it, I beat it, I'm running\nMan I never ever host these hoes\nI dick 'em, I diss 'em, dismiss 'em, don't miss 'em\nPlay your position.  I'm fixing the system.  Bitches don't listen\nTuck in your lip and quit tripping\nJust strip and get tipped and listen to me ripping this shit\nThe illest to spit.  I'll evict a video vixen out the crib like the rent’s late\nThe anti-Drake, the asshole all your friends hate ‘cause...\n\n[Hook 1: Sample from Buckshot on Black Moon’s “I Got Cha Opin (Remix)”] (x2)\nMe and my crew walk the streets at night\nLike looking for the right one, baby\n\n[Hook 2: Sample from Stephanie Mills’s “You and I”]\nYou and I could be together for all...\n\n[Hook 1: Sample from Buckshot on Black Moon’s “I Got Cha Opin (Remix)”] (x4)\nMe and my crew walk the streets at night\nLike looking for the right one, baby\n\n[Hook 2: Sample from Stephanie Mills’s “You and I”]\nYou and I could be together for all...", "year": "2015-06-30"}]}