{"artist": "Fashawn", "songs": [{"year": null, "album": "Boy Meets World", "image": "https://images.genius.com/4eb0769f2fa647dc2e26d40d1390094b.1000x1000x1.jpg", "lyrics": "[Intro: Fashawn]\nAnd I ask myself \"why?\"\nI can't understand why?\nSometimes a nigga wake up nah mean?\nWonder why he do the shit he do\nNah mean, it's life\nWe make the most out of it though\n\n[Verse 1]\nAIDS took so many brothers, yet we still going raw under covers\nIt's 2009, gotta think smarter, stop being baby daddies and be fathers\nI can't understand (why)\nSome dudes vacate to the Hamptons, knowing they seeds need Pampers\nWanna be a part of they life, instead they tricking different women\nNo room for a wife or a family (I can't understand why)\nGod got a million names and if we made in his image does he see it the same\nAnd if we flesh of his flesh can he feel my pain\nTeardrops symbolizing the rain\nI just can't understand (Why)\nI get high to forget about the present\nWhy I'm not riding in the S6\nBut life is all about decisions\nMake the most outta mine while I'm living\nI ask myself (why)\n\n[Hook]\nI do what I do, live how I live\nIt is what it is. but...\nI told my momma I'd change but it's clear I'll always be the same\nI ask myself (Why) [x2]\n\n[Verse 2]\nI swear life is a maze, I'm just tryin' to get it right before I fade\nBut I keep hitting walls, everyday is like a battle\nLearn somethin' different every time a nigga travel\nStill (Why) They hatin' when I get home\nSayin' my name just so they can get known not in the same lane\nIt's ironic how I became a product of fame\n20 years old out on my own\n(I can't understand Why?)\nI made those decisions I made, friendships decayed\nBitches I laid and never called back\nPeople I robbed, spots where I hung, rocks that I slung, niggas I socked and made fall back\n(I can't understand Why)\nDo good brothers turn bad\nWhippin 7 and a half outta 6 that's how we learn\nMath\nKinda sick how we earn cash\nNot in a right mind so I petal along the wrong path (Can't understand Why)\n\n[Hook]\n\n[Verse 3:]\nEverybody caught up in politics\nDemocrats, Republicans. When will the drama end?\nMathematic how the government dividin' us\nYet my mind shine bright as the Metropolis (Why)\nI feel the need to shine a light on the populace\nSo I write like a columnist, dictate like a communist\nThrough it all I continue to stand tall as the monuments\n(I can't understand Why)\nHeaven to Hell so I'm ponderin'\nWhich afterlife I'm a wind up in\nTook too many losses so I gotta win\nFatherless, soakin' up knowledge from my momma's friends (Why)\nThey all sold drugs and love to puff weed\nAnd angel dust couldn't teach me how to succeed\nSo I bailed out, in the lab, beats sittin' in the jailhouse. (Can't understand...)\nStill I ask myself (Why)\n\n[Hook]", "title": "Why"}]}