{"songs": [{"lyrics": "{*sound of a camera taking a picture*}\n\n[Intro: Serena Altschul (Jay-Z)]\n(Millennium flow)\nSerena Altschul's here live outside the criminal courthouse\n(This is {bullshit} y'all)\nIn New York City for the first day in the trial of\n(I'm gone) {*car speeds off*}\nThe State vs. Shawn Carter, a.k.a. Jay-Z\n(Uhh, uh-huh-uh, uhh, uh-huh-uh, uhh)\nWhatever the verdict in this trial may be\nThe effects will undoubtedly be felt worldwide\n\n[Verse 1: Jay-Z]\nAyo, stand forward, 'fore you take notice\nOr witness to me killin' the track\nTestify 'til me spillin' the smack\nNow they got me for traffickin', racketeerin', audio crack\nThey call me dope man, dope man\nI try to tell 'em I'm where hope, floats man\nGhetto spokes-man\nA broke man, approachin' the bench with intent\nTo bury me under the cell, fingered me as the toast man\nEvidence stemmin' from ninety-six\nThey say the world ain't recovered from his fix\nWhile they was usin' cut, I was on some other shit\nGave it to you raw and they just discovered it\nNowaday, the jury got they brow raised\nListenin' to testimony about my foul ways\nExhibit A: Reasonable Doubt\nThey say this was the first thing that turned the peoples out\n\n[Interlude: Serena Altschul]\nYou can feel the tension building here\nAs an unprecedented number of people have turned out\nFor what may be the trial of the century\n\n[Chorus: Jay-Z]\nThey call me dope man, dope man\nI try to tell 'em I'm where hope, floats man\nGhetto spokes-man\n\n[Verse 2: Jay-Z]\nHow come, you label your brand of dope\nVol. 1 and spread it through the slums?\nFed it to the young with total disregard\nYour honor, the State seeks the maximum charge\nAnd how could you, turn right around\nAnd release a lethal dosage called Vol. 2\nAnd is true you operate the criminal enterprise\nKnown as Roc-A-Fella in charge of his meteoric rise?\nAnd do you deny you're responsible for the demise\nOf record execs, and do you object?\nYour distribution's Polygram, and through your connects\nDef Jam, you pushed over five million SoundScan\nAnd not to mention, your co-horts and henchmen\nDame, Biggs, Lyor, Kev' and Russell Simmons\nAnd we ain't gon' talk about Murder Inc\nThat just establishes a darker deeper criminal link\n\n[Interlude: Serena Altschul]\nThe State is seeking the maximum penalty\nAnd with the overwhelmin' amount of evidence\nThe D.A.'s presented, things aren't lookin' good\n\n[Chorus: Jay-Z]\nThey call me dope man, dope man\nI try to tell 'em I'm where hope, floats man\nGhetto spokes-man\n\n[Interlude: Serena Altschul]\nDespite the grim outlook at this point\nThe rapper has been known to emerge triumphant\nIn the face of adversity\n\n[Chorus: Jay-Z]\nThey call me dope man, dope man\nI try to tell em I'm where hope, floats man\nGhetto spokes-man\n\n[Break: Serena Altschul]\nJay-Z is taking the stand\n\n[Verse 3: Jay-Z]\nRight hand on the Bible, left hand in the air\nBefore I spoke one word, made sure my throat was clear\nA-hem, I'm a prisoner of circumstance\nFrail nigga, I couldn't much work with my hands\nBut my mind was strong, I grew where you hold your blacks up\nTrap us, expect us not to pick gats up\nWhere you drop your cracks off by the Mack trucks\nDestroy our dreams of lawyers and actors\nKeep us spiralin', goin' backwards\nAt age nine, saw my first hate crime\nBlindfolded, expected to walk a straight line\nMind molded, taught to love you and hate mine\nClimbed over it, at a early age, Jay shined\nFuck the system at Lady Justice I blaze nine\nYour Honor, I no longer kill my people, I raise mine\nThe soul of Mumia in this modern day time\n\n[Interlude: Serena Altschul]\nWhile the jury is inside deliberatin'\nOutside the crowd is frozen with anticipation\n\n[Chorus: Jay-Z]\nThey call me dope man, dope man\nI try to tell 'em I'm where hope, floats man\nGhetto spokes-man\n\n[Outro: Serena Altschul]\nWell the verdict has just been announced: NOT GUILTY!\nIt is complete pandemonium out here!\nPeople are cheerin' and huggin' - there he is\nJay-Z is exitin' the courtroom right now\nThere is a swarm of cameras surroundin' him {*pop bulbs flashing*}\nAnd people are just rushin' up to him\nLet's try and make our way over there, Jay-Z! Jay-Z!\n{*sounds of cameras keep flashin'*}", "title": "Dope Man", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}