{"artist": "Fat Joe", "songs": [{"year": "2009-10-06", "album": "Jealous Ones Still Envy (J.O.S.E. 2)", "image": "https://images.genius.com/4b84a410c9b855ea9a89253794bfc54b.500x500x1.jpg", "lyrics": "[Intro: Swizz Beatz]\n(You... should beware)\nBeitch! Joey time! I mean\n(You... should beware)\nAy!\n\n[Hook: Swizz Beatz]\nMy all black shiny with my all black Glock\nMy all black hooptie, muh'fucker I won't stop\nNow any nigga in the way consider roadkill\nAny nigga in the way consider roadkill\nMy all black shiny with my all black Glock\nMy all black hooptie, muh'fucker I won't stop\nNow any nigga in the way consider roadkill\nAny nigga in the way consider roadkill\nLine 'em up! .. Point 'em out .. {*2X*}\nNow line 'em up! .. Point 'em out ..\nLine 'em up! .. Point 'em out, ayy!\n(You.. should beware) {*4X*}\n\n[Fat Joe]\nAiyyo Cash this is hard right here nigga\nHey yo the 9 got the muffler, shorty got the pump\nJose I'm a hustler, watch a nigga dump\nBronx on my back, nigga I'm an icon\nKing of the streets, who you think keep them lights on?\nGet some much China niggas thinkin I be Asian\nHave a nigga tied up like the preacher in his basement\nYou PC niggas can't come to the yard\nJoker face niggas; leave 'em permanently scarred\nGot the top off gon' be a hot summer\nAnd the goons with me case you niggas on the come up\nThis is not the best of T.S., it's just a preview\nHard to keep it humble when everybody's beneath you\nYou are now rockin with one live nigga\nAIDS with the flow yes I'm ten times sicker\nLine 'em up .. or point 'em out ..\nCall Opie Megatron, time to air 'em out muh'fucker~!\n\n[Hook]\n\n[Rob Cash]\nHa, hahaha\nWhat they gon' do now Coke? Beware nigga\nAny nigga in my way consider roadkill (kill)\nShotty shells as long as the feet of O'Neal's\nHey Krillz give me the word his cap's gettin peeled\nI hope baby boy got some stacks in his will\nYou know Cash was lettin it clap before the rap deal\nI lay somethin flat for a sack and a good meal\nAll I need is some weed, 'gnac and a good pill\nI be layin in ya lobby, pop ya with blue steel\nOn the low like a Navy Seal, playboy I'm crazy real\nYou gon' need Paul Wall when I flame ya grill\nWhere I'm from in the slums, we keep it trill\nPlus make it rain on your brain like a fire drill\nThey can't stop me, cock me back then refill\nFor some cheese beat his knees like Grant Hill's\nThat's what happen when you slackin and don't pay bills\nWe get it crackin in Manhattan, don't test my skills\n\n[Hook]\n\n(You... should beware)", "title": "Blackout"}]}