{"songs": [{"year": null, "image": "https://images.genius.com/792e21c5d339d16d34ae4e802dd31c69.500x500x1.jpg", "title": "Get It Poppin’", "album": "Illustrious", "lyrics": "Nighttime shift, you know it gets no realer than this\nWhat? We be comin', we comin', 41st side nigga, gangstaz\nCome on, we be in your face, bitch\n\nYou know when Q U come through, we get 'em for they chain\nThey ain't sayin', quick to blow your motha'fuckin' brains\nNigga light the Benz on autor, word to the daughter\nFeel me black, ya' niggas wanna beef, ya' niggas betta squeeze\n\nHope he left his memories and fact, assumin' that I love\nThat the streets and my gats, who hold me down?\nWho got my back? No one, who holdin' me down?\nWho got my back? Shit my big guns makin' you cowards run\n\nI hit the bitch all in the lungs, son, wack 'em\nWhen I flashed on 'em, I had his man turn an ass on 'em\n'Cuz the dezzy was pointed on his headdy\nThis niggas ain't ready, dunn I dead crew\nAnd ain't got shit poppin' on Channel One news\n\nWho the fuck is these dudes? Niggas wanna fuck\nWho the fuck wanna screw? I'm reach for my shit ready to blast one\nDoin' jukes wit' the one they say the mask on\nYo hold me down your heart is low budget son\nYou had one in the head but you didn't pull it son\n\nNo time for fake-ness\nBe the first and last mistake you eva fuckin' make, bitch\nCome out and stop hidin', deal wit' the pressure\nBefore I send hunger and gun to come get ya\nWit 4-4's and betta, dumb-dumb's, I bet ya\nYou won't even feel wit' when they kill ya\nSo watch your back, bitch\n\n'Cuz we ghetto gangsta shit, 41st side nigga\nCome on, 'cuz we comin', we comin', we comin'\n41st side what we here now\nLet's show 'em how we get down\n\nAll I see is crime outside and truthfully, I can't take it\nAll these pains inside, don't think I'mma make it\nShit, the game is real so you must stay strong\nAll I see is cats locked up and dead and gone\n\nI know cats that hate to take flicks\nBlood thick in the hip by lingua chicks\nEager to strip, cornball slip, they knees stash closer to my dick\nSavage dude eatin' food, disturbin' the eagle trips\n\nSon kissed to my lips bein' bees played the concrete\nSnow in the summer to increase your heart-beat\nDuke, make it happen so retrovior right?\nBut when I black out and cut y'all in half and sayin' it ain't right?\n\nSix building of the hook, Henny and Remy's\nStand dawg lays in samy at your enemy\nNow they pass memories, I pal chicken till the death\nLegal raw or legal I'm covered so fuck the ATF\n\nNow fact the lord, my thoughts are raw\nI'm capable to leave the sickness seemed to chair-fold\nNow the fair war or severe any man hoar head\nShots chest, shots squeeze till this red hot\n\nBubble like where hustle and numb rocks\nSoften your hard rocks wit' one shot\nAnd put your mind on your opposer\nBlood ooze on his rose-rary as I back away cautiously\n\nAll I see is crime outside and truthfully, I can't take it\nAll these pains inside, don't think I'mma make it\nShit, the game is real so you must stay strong\nAll I see is cats locked up and dead and gone\n\nAll I see is crime outside and truthfully, I can't take it\nAll these pains inside, don't think I'mma make it\nShit, the game is real so you must stay strong\nAll I see is cats locked up and dead and gone\n\nAll I see is crime outside and truthfully, I can't take it\nAll these pains inside, don't think I'mma make it\nShit, the game is real so you must stay strong\nAll I see is cats locked up and dead and gone"}], "artist": "Big Noyd"}