{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Intro: Marley Marl] (*Marley Marl Scratching)\nAnd you know sometimes man.......\nYou never know what you missed, if you can't touch it again...salute!\n(*Biz Markie: Mr. Magic!)\n(**Notorious B.I.G.: E-E-Every saturday Rap-Rap Attack M-Mr. Magic!)\n(*Biz Markie: Mr. Magic!)\n(**Notorious B.I.G.: E-E-Every saturday Rap-Rap Attack M-Mr. Magic!)\n\n[Chorus]: (Sample Courtesy of Patrice Rushen \"Remind Me\")\nListen close realize why Hip Hop is where it is\nThe reason that your favorite DJ is spinnin It's (Magic)\nGive it up for (Magic) Make way for (Magic) Let's Go (So Magic, ummm hmmm)\nYeah! Been rippin down airwaves for y'all from the get go\nThe originator of the Hip Hop mix show It's (Magic)\nGive it up for (Magic) Make way for (Magic) Let's Go (So Magic, ummm hmmm)\n\n[Verse One: Big Daddy Kane]\nI remember those days from the past when the tone rocked\nFrom blastin the boom box till your ass in the room locked\nListenin to the voice of Sir Juice past curfew\nA friday and saturday night virtue\nYou're not a DJ so don't compare handles\nThe radio's first one to ever Clear Channels\nAnd that should live forever kid that's where It's at\nSince your name is Magic, it's just a disappearing act, you'll be back\n\n[Verse Two: MC Shan]\nMr. Magic, I'm a miss you, I love me Super Rockin'\nWithout you, hip-hop just wouldn't be poppin\nYou made me who I am in so many of ways\nAnd thanks for puttin rappers on the radio waves\nBid my final farewell 'till I see you again\nNow I spill a sip of wine for my partner-in-crime\nBetter meet me at the gates, 'till then, I'll be missin you\nRest in peace forever, from a fan, a Super listener\n\n[Chorus]: (Sample Courtesy of Patrice Rushen \"Remind Me\")\nListen close realize why Hip Hop is where it is\nThe reason that your favorite DJ is spinnin It's (Magic)\nGive it up for (Magic) Make way for (Magic) Let's Go (So Magic, ummm hmmm)\nYeah! Been rippin down airwaves for y'all from the get go\nThe originator of the Hip Hop mix show It's (Magic)\nGive it up for (Magic) Make way for (Magic) Let's Go (So Magic, ummm hmmm)\n\n[Verse Three: Craig G]\nAiyyo! \"Be yourself  'fore ya find yourself  by yourself\"\nOne man said it there was no one else\nAll I ever wanted to hear was \"World Premiere!\"\nI knew at the top of Hip Hop I was there\nI just wanna salute, the leader of The Juice Crew\nBefore the game was based on YouTube\nObstacles we moved through, Craig G verse strong\nYou know when I'm speakin, \"The Rap Attack\" I rhymed every weekend\n\n[Verse Four: Roxanne Shante]\n...And you would grab the mic and say\n\"There's a lot of Roxannes' but only one Shante, now get 'em\"\nYou were smashin right on the air\nTell 'em to change the game, takin names because it's outta here\nAnd all I say is that's my crew - WHADDUP!\nSir Juice forever, that be you - WHADDUP! (Oooo-OOOOOOOHH!!)\nAnd nothing we did was ever shockin\n'Cause I'm Shante and you're Super Rockin' forever\n\n[Chorus: Biz Markie] (*TJ Swan)\nWe are reeeeeeeeeeaaaalllllly gonna miss him!!!!\nWho we talkin 'bout (Magic) Who! (Magic) Who! (Magic) Who! (So Magic)\nWe are reeeeeeeeeeaaaalllllly gonna miss him!!!!\n(*His name is Biz Markie and my name is TJ Swann!)\nWho we talkin 'bout (Magic) Who! (Magic) Who! (Magic) Who! (So Magic)\n(*Tribute to Mr. Magic were rockin on and on!!)\n\n[Verse Five: Marley Marl]\nNo one ever knows, when one soul goes\nAnd when that soul grows, he leaves his foes\nBack-to-back, Friday and Saturday\nLookin back, I couldn't have it, no other way\nCrossfader, goin back and forth like click click click\nWhile you proceed to smackin off that lipstick\nFlex finally admit it, we used to put it on him\nI'm back up in the saddle, it's about to pick on, B\n\n[Verse Six: Biz Markie]\nThe first DJ that believed in us\n(The first DJ played us on the radio!)\nHe had the golden voice, he was the people's choice\nHe had the crowd in the palm of his haaaand!\nWord is bond, he was a phenomenon\nHip-hop lost a wonderful man!\nJust like karate move, we gonna forty deuce\nWe're gonna miss Lucky a/k/a Sir Juice!!\n\n[Chorus]: (Sample Courtesy of Patrice Rushen \"Remind Me\")\nListen close realize why Hip Hop is where it is\nThe reason that your favorite DJ is spinnin It's (Magic)\nGive it up for (Magic) Make way for (Magic) Let's Go (So Magic, ummm hmmm)\nYeah! Been rippin down airwaves for y'all from the get go\nThe originator of the Hip Hop mix show It's (Magic)\nGive it up for (Magic) Make way for (Magic) Let's Go (So Magic, ummm hmmm)\n\n[Outro: TJ Swan]\nSuper Rockin Mr. Magic! Super Rockin Mr. Maaaaaagggiiiiiccccccccc!!!!\nMy name is TJ Swaaaaaaaaaaannnnnnnn!!!! My name is TJ!\nSuper Rockin Mr. Magic! Super Rockin Mr. Maaaaaagggiiiiiccccccccc!!!!\nMy name is TJ Sir Juice!!!! My name is TJ!", "image": "https://s3.amazonaws.com/rapgenius/1321503841_BDK%20fade.jpg", "year": null, "title": "Mr. Magic Tribute 12\"", "album": null}]}