{"songs": [{"title": "Lemme Freak for Real Tho (Outro)", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "Lemme freak! (I don't give a damn what you playin' right now, this is me comin' at you as a man right now, lemme freak)\n\nI'm talkin' to ya (lemme freak Goddamn it lemme freak, just lemme freak)\nGirl I smell that pussy across the room\nThere's no disrespect, they could make that shit perfume\nOh good God, I'm nasty\nDon't look around girl, I'm lookin' at you\nWhat's good? I'm Dave\nWhat's your name? Where you from? Who you with?\nWhat's your policy on birth control? When were you last tested? Girl I gotta know\nIf you gon' let me hit it raw, you gotta go\nThat would be crazy irresponsible\n\nYou know I only get with a bitch I mentally respect\nWe ain't even gotta fuck unless you and me connect\nMinimally I'd like to ejaculate somehow though\nGirl, I don't think I'm being unreasonable unless you that naive, that you thought this was a friend thing\nI hope you not a freak, subtle moaning's cool\nYour body's soaking wet\nMy bad, I know I sweat (profusely)\nAlso, I won't fuck from the side girl, I'd lose like half my dick\nAre you good about the pill?\n'Cause even if it's foreplay, I should know that shit's for real, girl I got hella pre-cum\nAlso, I'm wondering bout the way that you cum\nLike is it external stimulation or penetration-based? Fuck it\nYou know I enjoy that way\nBut you know damn well, I just want my bae\nThey gon' say I fell, I got blown away\nI'm a hopeless romantic, girl I'm being dramatic but it's just the truth\n\nWait hold up, I should slow down\nDon't even know you enough to go down\nBut if you want it we should go now\nAnd we gon' find out if it's great or it's strange\n\nOh girl, I could give you 4 to 8 minutes\nWon't force the issue\nBitch it's too crowded\nSo girl if you 'bout it, just give me that signal\nBut make it a loud one, I'm awful at this, hoe on the low, you finecut the shit\nGirl what you tryin' to do?\nI got candles, Nonpareils, and three condoms in my room\nThe Nonpareils might be old as shit\nLike they've been in there for a while\nBut fact of the matter is I don't want this to be no blip\nI prefer to fall in love I swear I'm on some crazy shit. (crazy shit)\nLike honestly, I need someone to save the kid. (save the kid)\nIt could be you but first\n\nYou gotta let me freak, just lemme freak, just lemme freak, god damn\nGirl, what's wrong with you?\nI need to freak\nI need to freak\nI need to freak\nLike please let me freak\nLike please let me freak\nPlease let me freak right now\nPlease lemme freak, lemme freak right now\n\nGirl we could get married\nLike we could be fuckin'\nA daughter named Bailey\nLet Bailey Burd Snuggle\nWe gon' eat so many goddamn meals\nWhat's your name?\nGirl, you better keep them dirty paws off my chicken lo mein\n\nWe'll talk the boundaries out together is all I'm sayin'\nAnd for the record girl I'll eat that pussy later\nLike when I know you a little bit better\nBut for now it's just too intimate\nLike it's too much\nYou don't even have to give me head either\nLike I'm totally onboard with a hand job\nEspecially if there's like lube or some shit around\nIn a weird way, I actually prefer it to head\nThere's no guilt\nNo guilt at all\nIn fact, it feels just as good to me too if not better\nI think it's a dick sensitivity issue\nAt the same time, there's no way you should complain about such a thing"}], "artist": "Lil Dicky"}