{"songs": [{"image": "https://images.genius.com/fa0abaabccafd35faf60d304bc3956ef.630x567x1.png", "title": "Can’t Be Saved", "album": "4Respect 4Freedom 4Loyalty 4WhatImportant", "year": "2018-08-28", "lyrics": "[Intro]\nPlayboy on this bitch but he ain't playin' though\nGo, now I can't be saved\nNo matter what I do they say that I'm wrong\nEverybody postin' shit that could put me in a cage\nThat shit so hurtful they gon' drag me 'til they see me go\n\n[Verse]\nWhen they bring up my name they gon' speak on the problems\nHow the fuck I'm gon' know that she lovin' somebody?\nHow the fuck you gon' say I'm beatin' on somebody?\n'Fore I tend to that shit I'd step on somebody\nI got money to make, I just gotta deposit\nI'ma hop on a beat like a vet, I'ma ride it\nEverything that you say it you know that I got it\nI come from the streets, I'm not worried 'bout nobody\nIt's enough that I'm here by myself and you know how to touch me\nTrust gon', thought you loved me\nYou postin' that shit so you really sayin' fuck me\nKeep tellin' me shit like they tryna corrupt me\nI ain't do not a thing, that's a regular problem\nEveryday gettin' cussed out by my mama\nHerpes in my blood and that shit got me cryin'\nI really got feelings, you see without science\nSomebody ain't real, I'ma cut my alliance\nI been through this shit now they tryna rewind it\nI bury my dirt now they tryna go find it\nConfirm everything, they'll never confide it\nWhile they focus on this and children out here dyin'\nBut they say I promote it, they say I slang iron\nThey done said plenty shit, that was time after time\nBut I know what I know, motherfuck all the lies\nI see I cannot change my time, what's left?\nAnd I know they do not care, they gon' ride the wave (oh yeah)\nAnd you see I do not care, gave her everything\nFuck everybody changed and fuck all these niggas ain't true to the game\nMotherfuck what they on, shoot 'em all in their body\nI'm only 18 and they talk like I'm 80\nNever knew it'd be this, startin' to hate that I made it\nI don't fuck with that ho, I don't care 'bout that baby\nIf you cheated you cheated, go fuck him again\nOn my soul if I could I'd kill him again\nNigga do what you want 'cause you never could win\nAll this money in my arm and I focused on friends\nAnd they not a friend, if they let you do that and embarrass yourself\nI won't say that I did it and perish myself\nIf I go back to jail that's 10 on my belt\nYou can't say that I don't 'cause you how that I felt\nWhen it come down to you I don't care 'bout myself\nWhen you given attention, you're killin' yourself\nStop respondin', play the hand that you're dealt\n'Cause you know I feel like fuck 'em and I'm thuggin' for real\n'Cause I know, if I fuck up my judge gon' touch me for real\nSo after tonight I ain't postin' nothin' else\nCherish my life with a plaque on the shelf\nThe love that I got, I'ma wait 'til it melt\nRather knock someone down before they'd help, bitch\n\n[Outro]\nMan fuck the media, how the fuck y'all keep slanderin' my name, I'm 18\nBitch I don't think I did nothin' that wrong\nAnd shit if I did whoever ain't feelin' this shit, what it is nigga, what you want?\nBitch you know what I'm on nigga, pussy ass boy\nBitch you better go get some money ya heard me?\n'Cause aye, the day shit something ever do happen to me I know what the fuck I did\nI don't owe nobody shit, ya hear me?\nBut I don't understand how y'all could just steady run y'all mouth about one person\nNo matter how bad I try to do right they gon' blame me anyway\nAnd guess what?\nBitch y'all can't play me how y'all played him, 'cause guess what?\nFor one you ain't gon' make me stress, for one, bitch, I'ma forever get shit off my chest\nI ain't worried but nothin', that shit don't hurt me, ya heard me?\nBitch I got my own problems and I'm happy with who I am\nI wouldn't have said what I said if I wasn't happy with who I am\nYa heard me? I accept myself before anybody do\nNigga fuck you, I don't know you anyway, you ain't grow up with me bitch\nI ain't perfect, you ain't perfect\nBitch I'm acceptable to myself tho'\nYa hear me? and I know somebody'll love me before your dawg ass do, yeah\nFuck the media and fuck the shaderoom too, bitch, broke ass muthafucka, ho"}], "artist": "YoungBoy Never Broke Again"}