{"artist": "Killer Mike", "songs": [{"image": "https://images.rapgenius.com/9abbe77bf37f8bfb46446fd95d398960.534x401x1.jpg", "title": "Rap’s poetic (In)justice", "year": "2014-11-28", "album": null, "lyrics": "In December, the U.S. Supreme Court will hear arguments in Elonis v. U.S., the latest — and highest level — in a disturbingly long line of cases in which rap lyrics have been used as evidence in criminal trials.\n\nElonis dates to 2010, when 27-year-old Anthony Elonis began posting violent messages to Facebook, often in rap lyric form, that were directed at his estranged wife and a female law enforcement officer. Although he included caveats like \"Art is about pushing limits,\" he nevertheless was charged with multiple counts of communicating threats.\n\nAt trial, Elonis insisted that he merely was writing fictitious lyrics that were consistent with the conventions of rap music, at one point singling out rapper Eminem — himself well-known for hurling lyrical threats at his ex-wife—as one of his influences. The jury didn't buy it. Elonis was found guilty and sentenced to 44 months in prison.\n\nThe Supreme Court took his case to settle a fairly narrow legal question involving \"true threats\" jurisprudence. But in choosing Elonis, the justices have stumbled into a national debate about the expanding prosecution of rap music, which raises major concerns about the role of art and free speech in the justice system, as well as the commonly-held view that hip-hop culture is a threat to society.\n\nWithin the legal system, this view is becoming increasingly apparent. As recent research has revealed, rap lyrics have been introduced as evidence of a defendant's criminal behavior in hundreds of cases nationwide, frequently leading to convictions that are based on prosecutors' blatant mischaracterizations of the genre. Ignoring many of the elements that signal rap as form of artistic expression, such as rappers' use of stage names or their frequent use of metaphor and hyperbole, prosecutors will present rap as literal autobiography. In effect, they ask jurors to suspend the distinction between author and narrator, reality and fiction, to secure guilty verdicts.\n\nEarlier this year, for instance, the New Jersey Supreme Court overturned the conviction of Vonte Skinner, who in 2008 was found guilty of attempted murder based largely on prosecutors' use of his violent rap lyrics as evidence. In their opinion, the justices wrote that Skinner's \"highly prejudicial\" lyrics should have been excluded because they \"risked poisoning the jury.\"\n\nIn most other cases, however — including one heard by the Nevada Supreme Court in 2013 — the outcome is very different. Lyrics generally are permitted as evidence, regardless of their prejudicial impact.\n\nNo other fictional form — musical, literary or cinematic — is used this way in the courts, a concerning double standard that research suggests is rooted, at least in part, in stereotypes about the people of color primarily associated with rap music, as well as the misconception that hip-hop and the artists behind it are dangerous.\n\nIn fact, the history of hip-hop tells a very different story. In its formative years, for example, it was explicitly conceived by many as an alternative to the violent gang culture that consumed cities like New York. Since then, it has offered countless young men and women opportunities to escape the poverty and violence in America's urban centers. As rapper Ice T once put it, \"If I hadn't had a chance to rap, I'd either be dead or in jail.\"\n\nIt is true that hip-hop has been scarred by violence. Tupac Shakur and the Notorious B.I.G., for example, two of rap's most important and influential artists, were killed in the prime of their careers. But for each instance of violence, there are countless examples of lives saved or made stronger. Trust us on this: The kids spending hours per day writing rap songs aren't a threat to society; they are often trying to escape the threats from society.\n\nThat story of hip-hop has been frustratingly difficult to tell, especially when the murder of Jordan Davis can be framed in the media as the \"loud rap music\" case or Michael Brown's association with rap music becomes part of a tragic story line that has far more to do with inequality, police brutality and racial discrimination.\n\nThese problems are the \"true threats\" facing America today, not hip-hop. Let's hope the justices on the Supreme Court understand that, too."}]}