{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "Lord’s Party", "year": null, "album": "The Tape", "lyrics": "[Biz Markie]\nBut bust this though everybody\nYo, we havin a party, a LORD's party\nA party for the Lords, the Lords with the party thing\nAll of a sudden, people got shot\nThe rope runner was standin, right by, the other side of\nThey ate barbecued peanut butter and jelly sandwiches\n(GET OFF THE STAGE BIZ!)\nWhy don't you just chill bah bah, road hog, kang-ka-dang\n\n[Kid Capri]\nParty time people, ain't nuttin movin but your feet\nGotta get up on out your seat\nCome on down with the Lords, get ready to get busy\nKnahmsayin?  Ain't no party like this party nowhere near this party\nSo this must be the party\nSo get up on the floor, and get it goin on, right about now\n\n[Verse One]\nIt's a party, I'm invitin everybody\nCuties, hookers and hotties\nTo come to the bash for free\nYour hosts: Capri, Mark, D\nEverybody up no time to waste\nYou came here cause you know this is the place\nTo rock, act like a fool\nIt's the Lords and we goin right back to the booth!\n\nNow you know the flavor New York\nAin't no sense in bein shy, tryin to play fly\nBe yourself never mind the next guy\nThis is a party we gonna get busy whether you like it or not\nThrow on the funk wanna make sure, that you havin a good time\nNow stop actin like a baby, and get on the floor\n\n[Verse Two]\nOh man I really like the way this is goin down\nLords, came to your town\nMade you a fiend like a crackhead (a crackhead?)\nThat's right, you heard what I said\nParty time in the Boogie Down, ready for some action\nShow me just a little satisfaction\nDance, and shake\nIt's time to start a Boogie Down earthquake\nKick a party groove is like a habit\nSee a fat booty then you grab it\nMaybe wanna slide to the side (slide to the side)\nKeep the drummer kickin let the beat ride\nIt's funny how we make a body move\nStay in step, just keep it to the right groove\nParty, don't be a coward\nShow me whatcha gonna do about it!\n\nUhh!  ..  Uhh!  ..  Uhh!\nNow y'all do me a favor, let me see you do\nDo the bend, and stretch\nDo the bend, and the stretch\nLet me see you do the bend, and stretch\nC'mon and do the bend, and stretch\nLet me see you do the bend, and stretch\nC'mon and do the bend, and stretch\nDo the bend, and stretch\nLords of Funk in full effect, word!\n\n[Verse Three]\nParty time in the Boogie Down Bronx..\n.. time to give the people what they want\nTo make me wanna know you wanna get down I gotta see you dance\nGotta take a chance\nCapri, known for abilities, tactics\nAnd all of my fast rap agility\nMade to perform and I strike like lightning, scary?\nYes it's quite frightening, huh!\n\nUhh!  ..  Uhh!  ..  Hoe, uhh!  ..  Woo!\n\n[Verse Four]\nI got a message, to Money Mark\nRemember when we rocked in the park?\nRemember that girl Joanna (Joanna?)\nBody was pumpin like a scanner\nRemember when we rocked that body\nIt always happens when you're comin to a Lord's party\nShe tried you, she tried me\nThen left the party with who?  Silver D\nHere's another girl Michelle\nLooks good and she dance really well\nEighteen years old, neck full of gold\nThe girl even dances the old, school\nTalk about she make a cold heart beat\nStill remember, seein her feet\nDance to the rhythm of the drum\nDum diddy diddy dum dum!\n\nNow what I want everybody to do\nIs put their right hand in the air like this\nShake 'em side to side\nEverybody c'mon, put your hands in the air lemme see lemme see ya\nGo left (left) to the right (right)\nTo the left (left) to the right (right)\nTo the left (left) to the right (right)\nTo the left (left) now let's do this c'mon\nEverybody do the bend, and stretch\nC'mon and do the bend, and the stretch\nLet me see you do the bend, and stretch\nC'mon and do the bend, and stretch\nWe go, side to side, keep it goin c'mon\nGo side to side, keep it goin\nFollow up and do the bend, and stretch\nDo the bend, and stretch, HUH!\n\nAhh yes so now you know what we mean and you see for yourself\nWe ain't got no time for SISSIES\nWe came here to party, word to Big Bird!\nLord's of Funk bout ready to take two steps to the rear\nAnd get on out of here like last year\nBut before we go, everybody hands up, c'mon\n\nShake it to the left.. to the right, c'mon\nShake it to the left.. to the right\nShake it to the left.. to the right\nShake it to the left.. to the right, but stretch\nDo the bend, and stretch\nC'mon and do the bend, and stretch\nLet me see you do the bend, and stretch\nEverybody do the bend, and stretch, c'mon!\nWe go, side to side, keep it goin c'mon\nGo side to side, keep it goin\nFollow up and do the bend, and stretch\nLords of Funk outta here, I gotta go SEE YA!"}]}