{"artist": "Fashawn", "songs": [{"year": "2014-12-01", "album": "Fash-ionably Late", "image": "https://images.genius.com/eac42f05dd35017f5b015faee937c6b6.500x500x1.jpg", "lyrics": "[Intro: Fashawn]\nUh, the maturation of Shawn, ah...\n\n[Verse 1: Fashawn]\nSpeed the shit to get you open wide\nRoll a couple more kush, blow your high\nWho's that nigga? Don't be surprised\nIt be that Young F from the far left side\nAnd we ball like Kenny Latimore\nIf time is money, then there's nothing that I can't afford\nReminiscing when I had a whore\nPut through more bullshit than a matador\nSo it was either money or monogamy\nRunning with a monopoly, death over dishonesty\nAnd yes, I confess I smoke a lot of weed\nHeck, I'm vexed, when will the drama cease?\nHuh, maybe in my absence\nAll I seem to hear is \"I'm crazier than your average\"\nI don't vacate, I hibernate\nAwake, just to defecate on your siphon space\n\n[Verse 2: Fashawn]\nYo, far from a 5 percenter\nTote 5s to survive the winter\nA nightmare to you rhyme beginners\nYou light years behind, admit it\nNigga speed up, cause we over the limit\nThe weed crushed, and so is the linen\nA K.O. and I'm finished, grab a hold of the 'Chemist\nI'm controlling the rhyme, he's controlling the rhythm\nI just focus my energy and channel it\nHit them like fingertips on a mandolin\nMy manuscripts is scripture for niggas who's scrambling\nRunning red lights like ambulances\nAnalysis of a G, who found his way out the street\nWhat you make in a month, he's counting in a week\nNever saw defeat like I was born obese\nUsually, victory doesn't sound this sweet, uh\n\n[Verse 3: Fashawn]\nThey might never understand the flow\nHowever, I don't plan on peddling grams and O's forever\nNo, expand while they expire\nFourth quarter, still in the game while the rest tired (Hey what's wrong with y'all?)\nTell me where your stamina at, Pa?\nBall so hard, slap my hand on the background\nAnd this is how real rap feel\nWatch these new-era cats get their caps peeled\nI'm a Maybach, you're a seat class\nYou're catching heat rash, trying to be Fash\nMaking ministers mad, commit a sin and I laugh\nI'm on a sinister path, uh\nReally? it's as simple as math\nAddition, subtraction; dealing with an assassin, nigga\nAshes to ashes, your ass is finished\nYou'd never clash with a master, a massive riddance\nMatter of fact, all you bastards should ask permission\n'Fore I react, in that classic Shields Ave tradition\nStaff gets toe-tagged once we pass the entrance\nI'm bad like Mike's dad, Joe Jackson niggas\nDisrespect 'Pac, get that ass a whipping\nSmack-dab in the middle of the lab inventing\nForget swag, I ain't got half the ism\nI'm all natural, and that's the difference\nMotherfucker, it's F\n\n[Outro: Fashawn]\nUh, rest in peace, Heavy D\nYoung niggas smoking dope\nThis J is for you\nHeyo O, I told these niggas man\nRelax your body, let your conscience be free\nRocking with the sounds of the A.L.C\n\n[Interlude: Sample]\n\"For a prayer, we must make:\nFather, God, I am just learning how to pray\nBare with me\nFirst I thank you for the life of our pivotal savior...\"", "title": "Professor F"}]}