{"artist": "V-Nasty", "songs": [{"title": "Three’s UP", "year": "2012-03-04", "lyrics": "[Chorus: D.B. Tha General]\n3s up, we sliding Veezas\nWe got our cheese up, mobbin with my feet up\nBroke bitch, an old bitch, get your cheese up\n\n[Verse 1: D.B. Tha General]\nMoney long, you know how that bitch go\nAny nigga not bout doe, send that bitch right up the snow\nHe want 4, hell no\nMan, you know that ain't goin go\nSee, 3 5, where we're at, bitch niggas die\nRun and hide, I'm a motherfuckin goon\nI'm a beast, in the dark full moon\nIn that whole cartoon, bitch talkin bout gettin chips, but ain't have no money\nYou ain't suckin dick, I'm on her quick\nShow her that I'm with the shit\nWith the clique, so I gotta get sick\nYou trippin, gotta calm your ass down\nGot the mac, and a couple racks, see, I'm from the town\n\n[Chorus: D.B. Tha General]\n3s up, we sliding Veezas\nWe got our cheese up, mobbin with my feet up\nBroke bitch, an old bitch, get your cheese up\n\n[Verse 2: V-Nasty]\nKeep a zip, smokin on that good shit\nYou suckers hating on me, Imma show your ass hood shit\nPlayin with my money, I wish you would, bitch\nI been gettin racks, out in Holliwood, bitch\nI get sick quick, fuckin with the squad\nOnly on this day, you fuckin with the mob\nKeep my 3 up, boy, that's who raised me\nEastside of California, that's who made me\nI fuck with my hood, 35th, stand up\nAsk about the last, hood rat now\nIt's a robbery, bitch, put your hands up\nYou hoes down there, while I got my bands up\n\n[Chorus: D.B. Tha General]\n3s up, we sliding Veezas\nWe got our cheese up, mobbin with my feet up\nBroke bitch, an old bitch, get your cheese up\n\n[Verse 3: Quise Tha Criminal]\nBitch, we T'd up, throwin them 3s up\nMe and Evie blowin purple, he be havin a seizure\nRun up on us if you want to, I bet we won't freez up\nI'm the shoulder heater, rappin on, ain't no playin with them actors\nI'm all about that action, choppers and them gloccs\nFuck dien in the hood, I kill you in the block\nHood niggas pistol whippin, start pimpin\nThes hoes like Cur DeRico\nFrom uptown to shutdown, movin pounds\nDoin shows, different citys\nReal niggas, fuck m, on my dick, your bitch suck for me\nLike a nigga that been to jail, I gettin a rest\nWe poppin bottles, me, and my brother Jeff\n\n[Chorus: D.B. Tha General]\n3s up, we sliding Veezas\nWe got our cheese up, mobbin with my feet up\nBroke bitch, an old bitch, get your cheese up", "album": "Doin Numbers", "image": "https://images.genius.com/8028fa16ee73fe0c1fddcba9f9c9fab0.500x500x1.png"}]}