{"songs": [{"lyrics": "[Aesop Rock]\nSmack dab in the middle of the cuddles and kills\nGuerilla jimmy city limits with a bucket of pills\nHollring 'no I don't immediately ameliorate 'em\nI meet 'em, greet 'em, read 'em, and rate 'em, see if I hate 'em\n\n[El-P]\nHere come the hard rock bump through the speaker top\nThe tweeter meter blew code def hones in\nI pack a lunchbox, walk to the stoning\nJump into the chemicals sold in my zoning\nI'm irrational, paranoid, tragic\nAnd the button on my chest says 'panic'\nPunch it, hold up, don't touch me\nI'm a savage from a rabid ass country\n\n[Camu Tao]\nWho want to get it?\nYou all acquitted\nYou need to quit it\nGetting evicted, you little idiot, pitching tickets\nIt's sorta tricky the way you wanna go get your digits\nBody you up at the party, somebody get his mistress\n\n[Aesop Rock]\nYou take a pitch black lung and a purple heart\nThen you kick back once the inertia start\nAnd when the shipwreck sunk through the perfect dark\nThe serpent's arch alerts every circled shark\nSee, bloody salt water sounds the h'ors d'oeuvres alarm\nAnd when the first arm's found we observe the art\nLike a belly-acher won't kick face to the curb\nRather kick when the face already raped by the worms\n\n[El-P]\nTasmanian pain coast, ridin'\nVery little to say to these politician behind it, but this:\nYou better loosen the noose or lose livin'\nThese little kids walking the ave. quick to produce a biscuit\n\n[Camu Tao]\nNow you should medicate any area that the pain hits\nAnd when you in the streets you should peep the sets of strangers\nThe actors that are in fact a cast of chaos\nThey be looking for any situation they can play on\nRespectively injecting these thoughts, detain us\nNegative speaking, they be creeping, they entertainers\nWhen you out of data they run through a route that'll save ya\nIn retrospect, infect and pressing your papers\n\n[El-P]\nI design kill pain cave penmanship\nFederal analog hog unedited\nWith a CUNY degree in young numbness\nAngels on the rooftop, gun in they trumpets\n\n[Aesop Rock]\nI was buried to the neck in them all-star bloopers\nPeriscope down, hop Boss Hog cruiser\nPorcelain or pewter authority will be over ruled the second jukie uber alles news hit the sewers\n\n[Camu Tao]\nRickety rackety\nThis city fit my style exactly\nWith a backspin\nAnd the fat laces\nGazelle glasses, chase rap daily\nRickety rackety\nRickety rackety\n\n[El-P]\nRickety Rackety\nThis city fit my style exactly\nNear the train tracks\nIn the garbage bags\nWhere the cement cracks, we a part of that\nRickety rackety\nRickety rackety\n\n[Camu Tao]\nWhen you take 2 to the vein, introduce 2 to the brain\nYou don't get used to the pain. A maniac bruising the cage\nWhen cats rush you in the public you be like 'do it again\nHe's a motherfucking bloodsucker, he can do what he can\n\n[El-P]\nOn the side of the block, do the bus stop\nYou paying a fare?\nThat's a trust fund\nLittle ugly ass duck, life's a fun fuck\nToo battered to rush, I walk punch drunk\nAnd the whole world is yours now\nBefore the steppers are goosed kick your door down\nI'm in the getaway whip with Aes Rizzle\nHe got the same shit stitched in his missiles\n\n[Aesop Rock]\nOkay, lefty field..stealth\nDressed to kill..self\nMegawatt with a horizontal neck spin\nSwims bloody to vertical bobble-head yes-men\n\n[Camu Tao]\nWhen the evil falls in it draws to the pours\nIt gnaws to the core\nIt's precedent in that you represented\nA percentage that wasn't vintage\nAnd the crawlers hate us\nYou automated, we all the flavor\nNiggas you oughtta hate us\n\n[El-P]\nAnyone from Antagony Squad, Family District\nTestify that the look in my eyes is genuine issue\nI'm a freak of the flesh. Penetrate. Lust\nBathe in the vaginal juices\nLike God is up in they undies\n\n[Aesop Rock]\nDon't picket the misfit law, Nancy\nThe core's no picnic. Misled whores advancing\nNo business. Insist lured with candy\nTo cure citizen x with that all-fours dancing\nCorporals landing\nAshore, all soar boned nitwit, rickety rackety porn fancy\nWeave through the hell and high water hot zone\nDiseases in the minute the idiot got home\n\n[Camu Tao]\n\nNow I'm a teacher, 1st grade, and I want to participate\nI want to grade the papers but I don't want to give them A's\nO.k. F, D, F-, test time, set timers\nCall every parent and give 'em a piece of my mind, shit\nCause I don't want to give a good future\nI'll shoot ya. (Shoot ya?)\nWith an Uzi filled with rulers\nFuck minors, flush minds. Even leaving 'em bruised up\nStack kids, pack cute lunches in the cooler\n\n[Aesop Rock]\n\nRickety Rackety\nThis city fit my style exactly\nNear the fire ladder\nWhere the wires gather\nDrink water, eat fish, smile after\nRickety rackety\nRickety rackety\n\n[Camu Tao]\nRickety Rackety\nThis pussy fit my dick exactly\nWith a threesome\nGiving treatment\nSex on drugs, girl you can't keep up\nRickety rackety\nRickety rackety", "title": "Rickety Rackety", "album": "Fast Cars, Danger, Fire, and Knives", "image": "https://images.genius.com/2434fa81c5b8e4d6767c0b655d69bd1b.498x500x1.jpg", "year": null}], "artist": "Aesop Rock"}