{"songs": [{"album": "Cole World: The Sideline Story", "year": "2011-09-27", "title": "Daddy’s Little Girl", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg", "lyrics": "[Verse 1: J. Cole]\nHey, her mind is on a different level\nPlus the teachers couldn't reach her, always been a rebel\nHit the club, watch out boy, you dancin' with the devil\nShe fuck, she suck, she swallow, man, it's like a triple double\nCan see it in your eyes, you look for trouble\nJust because they fuck ya girl don't mean them niggas love ya\nShe said, \"Don't preach to me nigga, hold up\nIs that a bottle on your table, well if so then pour it up\"\n\"Bet you I can drink it straight without even throwin' up\"\nShe said, \"Daddy, what you think?\", \"Little girl, you're growin' up\nGrowin up\"\n\n[Chorus]\nHey, take a couple of shots and it's on\n\"Bet you I can drink it straight without even throwin' up\"\nShe said \"Daddy what you think?\" \"little girl, you're growin' up, growin' up\"\nHey, listen baby girl they playin' your song\n\nMama couldn't never reach her\nBrother tried his best to teach her\nShe thinks she's ready for the world\nJust look at daddy's little girl\nMama couldn't never reach her\nBrother tried his best to teach her\nShe thinks she's ready for the world\nJust look at daddy's little girl\nDaddy's little girl, daddy's little girl\n\nShe's daddy's little girl, daddy's little girl, daddy's little girl\n\n[Verse 2: J. Cole]\nCan I get a witness, this is Sade mixed with Shawty Lo\nEy, Jezebel, why you be up in every party for?\nYou lost to lookin' for a savior, I ain't Mario\nI got no cape, but I can't wait to give you cardio\nWork you out, you call me daddy, ain't my daughter though\nMake me wonder where your father go?\nShe said, \"Don't analyze me, nigga, hold up\nIs that green on your table? Well if so, then roll it up\nI can take it to the face without even throwin' up\"\nShe said \"Daddy, what you think?\" \"Little girl you growin' up, growin' up\"\n\n[Chorus]\nHey, and blow a couple sacks and she gone\nSaid, \"I can take it to the face without even throwin' up\"\nShe said, \"Daddy what you think?\" \"Little girl you growin' up\"\nHey, listen, baby girl, they playin' your song\n\nMama couldn't never reach her\nBrother tried his best to teach her\nShe thinks she's ready for the world\nJust look at daddy's little girl\nMama couldn't never reach her\nBrother tried his best to teach her\nShe thinks she's ready for the world\nJust look at daddy's little girl\n\nMama couldn't never reach her\nBrother tried his best to teach her\nShe thinks she's ready for the world\nJust look at daddy's little girl\nDaddy's little girl, daddy's little girl\n\nShe's daddy's little girl, daddy's little girl, daddy's little girl"}], "artist": "J. Cole"}