{"songs": [{"image": "https://images.genius.com/73b36e02ac974c8ab4a3cd49a9cf1794.1000x1000x1.jpg", "title": "Ghetto Prisoners", "album": "I Am...", "year": "1999-04-06", "lyrics": "[Intro]\nUhh\nRegulate, nigga\nBravehearts, nigga\nLive for this\nSome of y'all don't live at all\nGet yours, nigga\nGet yours, baby\nUhh, yo\nYo\n\n[Verse 1]\nAs the night close down on the Earth like gray dark rings\nLight of cities in the nights, destination for Kings\nWith big dreams, like Castro, overthrew Bautista\nFrom Cuba, and pointed nukes toward the U.S\nAbout to shoot us for revolution; that's how you gotta move\nA lot of rules, some locked in solitude\nCurse the day of they birth confused, who's to be praised?\nThe mighty dollar -- or almighty Allah\nI'm like the farmer, plantin' words, people are seeds\nMy truth is the soil; help you grow like trees\nMay the children come in all colors, change like leaves\nBut hold before you one of those prophetic MCs\nWith blunted flows, seven hundred souls in me\nEach channelin', from past to present times, heaven shines\nLight on those, innocent to how the world grows\nSome men become murderers, and some girls become hoes\nAnd you accounted for, everything that you heard\nDo not speak to fools; they scorn the wisdom of your words\nMy heart is wise, bloodshot eyes, the saga never dies\nGhetto prisoners rise rise rise\n\n[Chorus]\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners..\n\n[Verse 2]\nYo we gotta be God's children, habitats in tall buildings\nRats crawl in filthy hallways, incinerators\nSinners who faithless, still there's hope, pray it's answered\nDreams turned real - what's a wicked nation?\nOne with blind men - not takin' charge of the situation\nEmpty arguments and real conversations needed\nThe world'll need it, to hear it\nEvil tries to weaken my spirit - it's chronic herb\nThis hurt come from the honest word\nI now try hardest to serve my maker, what I learned\nFind it's way on the paper, so I could dictate it\nArticulate it, luckily - I was put on one of the ships that made it\nThrough strong currents and winds that left the others stranded\nTo sink in the Atlantic\nSatan jigs the planet, not to get too religious, but\nWho decides when and if your life is finished?\nIf Christ is in this, for the sake of your name, oh Lord\nMay we break away from the chains abroad\n\n[Chorus]\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners.. get up, wake up, rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners..\n\n[Verse 3]\nYou wanna buy time? I'm the seller of minutes\nI give you every second low-priced, if I sold lies; the truth is\nTime waits for none of you, in fact\nHe can't wait for the date to snatch the ground right from under you\nSmall visions of better life if cheddar was right\nLurk in the mind, of young ones ahead of they time\nTrapped in the slums, beggin' for nuttin' but takin'\nHeaded for nuttin' but the state pen, where they cousins be waitin'\nJudges is not relatin' to pleas, guns bustin' where the kids play\nRichochet off lamp poles and leave damp holes\nIn bystanders, get cancelled, D.O.A\nAround the way where we from\nHope the future reduce the rate of those buried young\nLife is every man's kingdom, a dyin' man's past\nAnd a newborn's, first time to be here at last\nAnd shouldn't have to grow up fast, and suffer our pain\nHustlin' harder than the generations here before he came\nGoin' through the same bullshit as our fathers\nReadin' history, but who's the authors?\nFor some the game is easy, for most of us the game is much harder\nBut never lose faith; through the years just get smarter\nGhetto prisoners.. ghetto prisoners..\n\n[Chorus]\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners.. get up, wake up, rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners rise rise rise\nGhetto prisoners.."}], "artist": "Nas"}