{"songs": [{"album": "T.I. vs T.I.P.", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg", "year": "2007-07-03", "title": "Da Dopeman", "lyrics": "[Intro]\nLook at this little nigga, man\nAy T.I. is that really you man?\nYeah shawty, what's happenin'?\nAy man can you give me a ride home, man?\nMan, it's 2:30 in the muthafuckin' mornin', what the fuck you doin' out here?\nOut here trappin' tryna get rid of this bomb and purp, man\nMan you can come with me on one condition\nWhat's that bruh?\nLet me convince you to put that bomb down\nI knew it T.I\nWhat?\nYou wasn't really on that dope boy shit\nI tell you what shawty, get in man\n\nI'll show you how to tote that tool\nMake that double\nBetter be cool, you don't want no trouble\nKeep it leanin' to the left\nMy gat stay cocked\nI'm always super clean when you see me on the block\nKeep my money in a knot with a rubberband on it\nBlow to marijuana, know I got it if you want it\nSee me standin' on the corner, slangin' that crack\nYou know how it is to be the man in trap\n\n[Hook]\nI'm the dopeman nigga the dopeman nigga the dope the dope dope the dopeman nigga\nI'm the dopeman nigga the dopeman nigga the dope the dopeman the dopeman nigga\nI'm the dopeman nigga the dopeman nigga the dope the dope dope the dopeman nigga\nI'm the dopeman nigga the dopeman nigga (From a ki' to a G, it's all about money)\n\n[Verse 1]\nLook, bet all you see is tats, money, grills, and chains\nBut if you scratch the surface you can feel the pain\nNames change but the situation still the same\nThe bills need payin' nigga simple and plain\nTake a young'n who's aspirin' to get him some change\nWon't nobody hire him so he get in the game\nWent and bought a 50 slab, divide it up into ten\nSold 'em all, double down, did it again\nBy then you got enough to buy a quarter ounce\nYou sellin' dimes to forty fiends buy it and bounce\nThrow some money to your momma keep some food in the house\nCop the outfit and the Jordans on the day they came out\nBetta get ya self a pistol know the jackers is out\nFlip another seven grams, oh you hustlin' now\nTime to get yourself a half, make sure it's some glass\nA hundred bags sell it fast stack a G now you officially\n\n[Hook]\n\n(I betcha think you pretty good at it now, huh?)\n\n[Verse 2]\nNow once you flipped a couple o's know the game get gravy\nTake twelve fifty go git ya two and a baby\nYeah sixty three grams if you whip that right\nYou should get back five or six that night Stack that money and repeat that twice\nBuy you somethin' to ride in, ya gotta be tight\nNext time you buy somethin' take twenty-five hundred\nGet four and a half it come back in nine don't it\nNow stay low key when the money keep comin'\nKeep some niggas on ya team to show these suckas they don't want it\nBy then your connect will clearly see you on ya grind\nShit you come to get a nine and he front you what you buyin'\nAs long as you bring back your money on time\nAnd if you snort blow, do it on your own time\nAt this rate you'll be at a brick in no time\nThey say the want some weight, tell them niggas stand in line\n\n[Hook]\n\n(Stay with me now shawty, here comes the fun part)\n\n[Verse 3]\nNow the robbers plottin' on ya and your name stay buzzin'\nYou caught a sale case down in Macon with your cousin\nYour connect ain't worried, you and him cool\nHe know you'll never tell what you and him do\nA mob of a hundred just a few of them true\nYou heard a worker snictchin' on you and it's true\nEverybody know you sell that shit\nThe feds come and get ya, shit we heard you\nTote that tool, make that double\nBetter be cool, you don't want no trouble\nKeep it leanin' to the left, my gat stay cocked\nI'm always super clean when you see me on the block\nKeep my money in a knot with a rubberband on it\nBlow that marijuana know I got it if you want it\nSee me standin' on the corner slangin' that crack\nYou know how it is to be the man in trap\nI'll show you how to be a\n\n[Hook] (between \"da dopeman, nigga\"s:)\n\nThe feds is the:\n\nGeorge Bush just a:\n\nSay goodbye to the:\n\nHey shorty, real talk: I'mma tell it like it is, ya dig? Them other cats give you half of it cause they don' known no better I'mma give you the whole story though. This shit a dead end street, partner. Take it from a nigga who been there. It ain't but a few of us who make it up out this shit, man, and live to tell about it, you know what I'm sayin', from the free world. But shit. The choice is yours, though, homie. Just don't say I ain' tell you. Once they get yo ass behind them walls talkin bout how many folk they got tellin on ya, your ass'll believe somethin' then. If you out ta make a million dollars in the game I betcha you get a hundred years..."}], "artist": "T.I."}