{"artist": "50 Cent", "songs": [{"album": "Buck the World", "image": "https://images.genius.com/c575145ecec0cf746c69f02ad15139be.1000x1000x1.jpg", "title": "Funeral Music (Cam’ron Diss)", "lyrics": "[Sample: Intro]\nThe Business is entertainment\nAnd what entertain the customers is the sight of blood\n\n[Intro: 50 Cent]\nCam I mean, I was bein nice to him, Ok I'll get him\n\n[50 Cent: Verse 1]\nYou niggas should worship the ground I walk on\nI make mills off the tracks I talk on (It's king-pin)\n50 don't call me nigga I don't wanna talk it out\nThe 40 cal'll hit yo' leg go on and walk it out\nI see it clear you tryin to sabotage Jimmy\nSee what happens when you talk after sippin the Henny?\nI'll send Haitian niggas at you yeah sak pase?\nZoe pound niggas they don't play\nBuck stabbin niggas on camera and it's ok\nCause my money make my lawyers make the shit go away\nAttempted murder, get a year on probation\nCam are you clear what you facin'?\nYou must ain't hear me, I done told you I'm a boss\nI'm eatin good but I ain't chubby like Ricky Ross\nWord on the street is, 50's not Jay\nAnd Cam better stay out of his way\n\n[Hook]\nEverything's cooler than a fan till you rolled on\nHave you in the I.C.U. tryin to hold on\nNiggas in the waitin room been waitin so long\nTill they hear the flatline the doc say he's gone, he's gone (Ha ha, that's fucked up!!!)\nWhen they say he's gone (Ah ha, ah ha, ah ha, he dead)\n\n[50 Cent: Verse 2]\nWell he knew that could happen fuckin with the kid\nThis is graveyard music right here ya dig?\nThis is not competition this is murder\nCareer endin, mind bendin, Southside ya finished\nNow look niggas laughin at Cam down on Lenox\nThey heard what he did but they don't know why he did it\nI have eighty of them boys with black flags, come through with black mags\nAnd have you niggas zipped up in black bags\nFor a second he was hot now he cold\nI apply pressure on niggas until they fold\nBut never mind me, man that's just how it be\nThe game got me trained they call me the hustle man\nAnd like fame, my style will live forever\nThey thought I crossover, cause they don't know no better\nI think they think I'm laxed now cause I got the cheddar\nTill I return back bustin trust me it's nothin (OHHH!!!!)\n\n[Hook]\n\n[Outro]\nDipSet! Cam stay up! I'm not gonna destroy DipSet...\nJust gotta make changes, from now on, Jimmy's the boss, of DipSet!!!\nAnd Juelz is the Capo (He's gone) Cam's demoted to soldier...\nWe like Jimmy better anyway!! Ballin'! Come on man\nWhat's the last Cam joint you liked? Computers computin\nBoogity boobity, Hahahahahaha!!!! (He's gone)\nCameron, you better learn how to talk to me!!! OHHHH!!!!", "year": null}]}