{"artist": "Angie Martinez", "songs": [{"title": "Coast 2 Coast (feat. Wyclef Jean)", "image": "https://images.genius.com/439f66679a994188cae23c6858565d8a.438x438x1.jpg", "album": null, "lyrics": "(Wyclef Jean)\nWyclef, chillin with Angie\nLive at Jimmy's, worldwide baby\nAzuuuu-car!\n\n(Chorus: Wyclef)\nSuavemente, be-sa-me\nAngie Martinez, can I get a date on Friday?\nSuavemente, just when I thought she'd say yes..\nYo, yo, that's when a kid pulled the tec and the whole crowd parted\nWhy you fuckin up the party before it gets started?\n\n(Angie Martinez)\nYo, yo, yo, yo it's Angie\nThe way I flip it make you switch your shit to plan B\nAnd I'll be dipped out in the club lookin fancy\nAnd we ain't chillin too tough if you ain't family\nYou mad at me man please I'm chillin low-key\nThat's why I got my little hat on\nIn the V.I.P. where everybody high fash-ion\nGettin they mack on, thirsty fo' satisfaction\nAnd it's, bound to happen like latins goin platinum\nNow we, in it lookin for the big peso\nAnd my, song inspired by Elvis Crespo\nAnd we, gettin it started so baby let's go\nNasty boys in the party singin, \"Dame Webo\"\nBetter, make it easy cause we livin suave\nBe bout the +Smooth Operators+ like Sade\n\"Coast 2 Coast, New York to Chicago\nEast L.A.\"\n\n(Chorus)\n(Angie Martinez)\nFunny how times flies when you gettin drunk (uh-huh)\nIt's three A.M. and we still ain't had enough (uh-huh)\nBout the time when everybody know whassup\nSee them niggas pushin up, now you know they wanna (WHAT?)\nSee the big pop-pas chasin mu-cha-chas\nWhylin out, right right, be like ooh-la-la\nBut they gets na-da, make me laugh ha-ha\nLike HA-HA-HA, HA-HA!\nThey be, silly boys in brand new clothes (uh-ha)\nActin up with nothin, puttin on shows (uh-ha)\nAt the bar, frontin, strikin up a pose\nIn cubic zircon's like nobody knows, but\nIt's okay papi, I won't tell (uh-huh)\nIf they don't know you might as well\nDo your thang duh-dah-dah-duh-dah\nPero suave yo!\n\n(Chorus - 2X)\n(Wyclef)\nSuavemente (uh-ha!).. (uh-huh)\nSuavemente (uh-ha!).. (uh-huh)\nSuavemente", "year": null}]}