{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "Let The Record", "album": "Hannicap Circus", "lyrics": "[Intro: Bizarre]\n(Yeah) Woof!\n(Yeah) Woof!\n\n[Hook: Bizarre]\nI'm ripped, I'm on a acid trip\nMy DJ's in a coma for lettin' the record skip\n(Lettin' the record skip\nLettin' the record skip\nLettin' the record skip)\n\n[Verse 1: Bizarre]\nWow.. shit.. son of a bitch\nSay shit three times in a row like I don't give a shit (bitch, bitch!)\nGod dammit.. son of an ass\nLadies and gentlemen, Bizarre's a dumb-ass (hehehe)\nSayin' cusswords like Too $hort\nEatin' pork of all sorts in the middle of New York\nBeatin' my meat, watchin' Sesame Street\nFuck the sheet, I'll bust on my little niece\nShe's so sweet, a six-year-old freak\nWant me to bust right between her ass cheeks\nYou ever met a guy with Cancer who refused Chemo?\nCallin' the doctor a hobo and doin a two-week promo\nThat's me, a fuckin' G\nI'll probably be dead by the end of this CD\nAnd VD, I probably caught it\nCrack in your neighborhood? I probably brought it..\n\n[Hook: Bizzare]\nI'm ripped, I'm on a acid trip\nMy DJ's in a coma for lettin' the record skip\n(Lettin' the record skip\nLettin' the record skip\nLettin' the record skip)\nI'm ripped, I'm on a acid trip\nMy DJ's in a coma for lettin' the record skip\n(Lettin' the record skip\nLettin' the record skip\nLettin' the record skip)\n\n[Verse 2: Young Miles]\nWhen this Hennessy get into me\nMan, I talk shit until I lose my mind like Kennedy\nThe bottom line: I ain't feelin' yo ass\nSo when the pump's in your car, it ain't to fill it with gas\nNigga, it's Young Miles, I'm the boss of the crime\nYou don't know another nigga that's as hard as I\nI clap a nigga in his ride, then I toss the nine\nI'm at your wake with a bomb, now your coffin flyin' {explosion}\nTryna say I ain't the best of this reppin'\nMan, you got it fucked up like sex in heaven\nAnd I can gun you down, I don't fuck around\nI'll have you sleepin' up underground (that's right)\nSo when your boy lend a man a pipe\nBitch niggas better run like they scared for they life\nAnd when I pop the thing\nEven the niggas in the crowd catch shots like a hockey game\n\n[Hook: Bizzare]\nI'm ripped, I'm on a acid trip\nMy DJ's in a coma for lettin' the record skip\n(Lettin' the record skip\nLettin' the record skip\nLettin' the record skip)\n\n[Verse 3: Bizarre]\nI'm a grown ass man that's an obsessed Usher fan\nI wanna rub his back and put on his headband\nMe and Fleece, still workin at Wendy's\nSniffin dope, with my girlfriend Kimmy\nFuck a cup, I'll piss in your butt\nTell my grandfather to shut the fuck up, while I piss in his butt\nCan't be around kids, my brain will splatter\nI ain't readin books, I'm pullin' on Pampers\nCause I don't give a shit, fuckin' a bitch, 86\n\"He just told you he don't give a shit\"\nGrandmother 86, my grandfather would nut in his butt\nI'ma goddamn nut!"}], "artist": "Bizarre"}