{"artist": "G Herbo", "songs": [{"title": "Bi Polar", "album": "Humble Beast", "year": "2017-09-22", "image": "https://images.genius.com/8a402b14fb90700c3fd8c750afa7b8eb.800x800x1.jpg", "lyrics": "[Intro]\nUh-huh, yeah\nG Herbo, \"Humble Beast\", man\n150 dream team, 150 Roc Block, bitch\n79th, Essex\nNiggas talking all this gangsta shit\nIt's real gangsta shit over there\n\n[Verse]\nWhen I was up on 78th, you was scared straight\nBefore Roc died and Gilly caught that fed case\nRemember Roc died, every morning shots fired\nYou was never in them trenches, pussy, you was dead weight\nNever end up reminiscing, watch your homie hemorrhage\nEven though you want to kill 'em, never play them bitches\nAlways came up with the blueprint, never had to listen\nI had a bunch of detentions, too many pink slips turned to suspensions\nNow I just walked in the car lot\nHolding my pink slips, rocking Givenchy\nIf I had my life on the line\nI'd take the shot but I'm not a Nowitzki\nChi real hot like a shot of the whiskey\nIf I'm not ducking, how could you miss me?\nGlued to the blicky, keep my shit with me\nI get the back end, still I get back, in the back of the truck\nIf the club try to frisk me\nI get so high just like I'm a hippy\nBack in the '60s, Percs got me trippy\nI did two thirties, I'm off a sixty\nI'm in a Range Rover Sport on the road\nTryna lose control, no I'm not Missy\nI'm quit the drank, and I do not miss it\nWon't even pour it up when I'm not busy\nI'm on a mission, I'm always busy, counting up benji's\nTryin' get some more some more bread\nLook at my cars right now, I got for-show bread\nLil nigga, Lindsay, he got the Lohan\nI put the work in like I got four hands\nAnd I got love for a few\nRespect for a couple niggas\nBut ain't no fear in my heart for no man\nWoo! Woo! Keep my sword on me like Conan\nBefore the rap, I swear I was poor man\nNow my cribs and shit gotta door man\nNiggas stay hating like \"Herbo a ho man\"\n\"How yo gon' show man? Whatchu gon' blow, then?\"\n\"I heard he toting his pipe everyday and he shot some before\"\n\"What, you knew him before then?\"\nI heard he the realest, and he be with killers\nThey sound like gorillas, and ride 4 wheelers\nThey waving the 30s  and yellin' \"No Limit!\"\nIf you ain't with it then bitch mind your business\nGot bulletproof vests, just like armadillos\nI'm on the corner, with nothin' but dealers\nClinching a .40 when I'm on the block\nWater whippin' my wrist when I'm under the ceiling\nGuess I'm a hypocrite, 'fore I got shot\nWe was sending 'em out, give a fuck 'bout they feelings\nAnd when I got shot, I was back on the block\nWith my crutch and my Glock, give a fuck 'bout the healing\nFrom the start of the day to the finish we was drillin'\nGuess we was mentally illing\nCouldn't even stop, we allergic to chillin'\nHad to wake up and think like a villain (han)\nNow my whole thought process different\nWake up and think bout a million\nSometimes I don't talk I just listen\nCan't never be nothin' I ain't missin'\nSome shit you just learn on your own\nI taught myself how to not go to prison\nThey want us to be all alone\nThey tryin' divide us off in divisions\nTryin' divide us by our decisions\nTake advantage of our kindness so that's why I'm vicious\nI seen ballers rise and fall that's why I'm ambitious\nLocked in shackles or they gone, most of all my niggas\nPour out all my liquor\n\n[Outro]"}]}