{"songs": [{"lyrics": "[Verse One]\nYou replicas overlooking the guidelines of acoustics\nMiserable attempts result in miserable conclusions\nParagon Pendragon tactician on free-form\nThat uncomfortable, silenced pride of combat cliques\nThat unexpected zephyr, the cyclone shifts\nWorked up, you're shooken. Jutted to the side\nI stagger this vagabond wandering minstrel forms your phobia\nWorst fear. The terror-stricken muted\nThe roots of all evil I've rooted pinnacle\nPoised with pride pouncing to break your stride, forsaken\nAgony rides inside the heartache wretched condition\nMy intuition felt you slip up\nYou tripped alone what are you aiming for?\nOr the useless tries to classify your genus, distorted fetus\nEvolve, type unsolved, you lack the malediction\nMalleable martyrs get molded, then folded under pressure\nDowsed with scenes of slaughter suspension\nBridge over troubled water drown, sound study intensive\nMy square drops to erase your lines like Tetris\nRelentless agent hush horrendous circles on my pavement\nTwo sticks to burn basics that lie adjacent to my placement\nOn the game board, lunge forward and wind up impaled by the same sword\nChoose your weapon, stains splattered upon your flag\nTattered rag shielding the exterior inferior\nStall face to face with a forms that force your downfall\nAdmittedly suspicious of your cadence, your network's on hiatus\nPermanent, provoked and choked upon the potency\nThe peril be the penetrating agent pierce the insights\nWhy the cold sweats at midnight? Why the dim light?\nWhy are we staring at a truth from the inside?\nWhy the pen slide with vigor on a put down?\nLike why'd I put my foot down stomp your city\nA-E-S-O-P scoping through the myrth, opening minds behind the smirks\n\n[Hook]\nOnly in my sweetest dreams do my streams lack troubled waters\nBabbling brooks with babbling crooks\nOnly in my sweetest dreams do my streams lack troubled waters\nShallow pools full of shallow fools\n\n[Verse Two]\nI've seen misery, I've seen disgust dust ridden ruins\nIronclad oracle test recon unit disperse silently\nOver confidence leads to irony\nPlot twist foolhardy Icarus shifted in facets of my form\nForbidden aspects of the swarm a thorn upon your side\nA storm upon the rise, Adam, ire crush come brush upon the red zone\nCrook you're shook you started poorly\nYour powers parted pace uncharted territory\nDisoriented malicious bar you'll burn your bridges\nThis craft requires first drafts\nGraphs, gritted blueprints of nemesis perimeter\nHunting by night compute, twenty one mic salute\nOne life polluted, concerned muffle moans\nFrom the nine rings of Donnie's hell burn you in your slumber\nSleepwalk then pulled under now\nWhipping through the willows is the warden of this garden\nSlipping through the silhouetted skylines Aesop sidewinds jaded\nDon't wind up war painted into the jungle the solution's not intrusion\nThe starving institution broke your mainframe\nI pose the question, are these waiting games worth it or worthless?\nWhile I comb the crowd for clues your naivety hands be my purpose\nOur planet is the pivotal point\nIn which this network slowly turns to filter kicks\nWe out-box the berserk bewildered by the wilderness\nMy clench is frantic clutch manners falling through underbrush\nTouch fools that duel with a dominant\nThe evil-minded tried to triple six me but he missed me\nIntervene; emcees appear as red blips on my color radar screen\n\n[Hook]\nOnly in my sweetest dreams do my streams lack troubled waters\nBabbling brooks for babbling crooks\nOnly in my sweetest dreams do my streams lack troubled waters\nShallow pools full of shallow fools", "title": "Troubled Waters", "album": "Music for Earthworms", "image": "https://images.genius.com/355a2e1156bc79b1e8d0997024f4cc06.300x302x1.jpg", "year": null}], "artist": "Aesop Rock"}