{"artist": "C-Rayz Walz", "songs": [{"title": "Officially Lost", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/566d299c2471c83ab1595731e9242047.1000x1000x1.jpg", "lyrics": "C-Rayz Walz ft. Trinity - “Officially Lost”\n[Emcee(s): Vordul Mega, 4th Pyramid, and C-Rayz Walz]\n[Producer(s): 4th Pyramid]\n\n[Verse 1: Vordul Mega]\nIn cities with lights and cameras and action\nWe was throwing them Dukes into Hazzards\nKeep my head around ninjas and samu-\n-rais, where demons and angels dwell, and the\nScent of death inhaled.  Paranoias\nOf chaos and the madness of mysti-\n-cisms and mayhem.  Studying the\nPowers of subconscious, ground in the great\nEastern ends with my peoples that spray hems\nTrying to get through on snorkels to lace Timbs\nWhen the Hulk is loose, find a force\nRunning in a bubblegoose, trying to trouble you\nWith statements of racist.  You’re trying to stay in\nTouch without families and close ones\nThat is real suffering in the hells of\nState prisons.  I stay up, see you in the physical\n\n[Verse 2: 4th Pyramid]\nMy turn.  I grab the bars and do fifty\nRap with stars like, “Who is he?”\nCan’t “Spitamat” if your flow too flimsy\nTrinity get dap for rap in new cities\nI’ll do mine with one hand and new kicks be\nIn the sand with a style that flew with me\nCalisthenics, I’m vegetarian, ‘cause the\nCows demand that I’m about my bidness\nGet on the ground, give me twenty\nPush up these standards, don’t deal with envy\nSit up straight.  You don’t need them Bentleys\nBut I should take one alongside with some Henny\nDrink and drive, I don’t do that, leave\nThat for the dicks that die.  It’s just I’m\nThe type to get up and go, yo\nI’ll spit scripts with my pen and just flow\n\n[Verse 3: C-Rayz Walz]\nZen by\nLinum, Shaolin succumb to Buddha.  No\nChips.  Just fucked-up computers.  “Spita-\n-mat,” hollow the tip—blao!  Pitter pat\nThe beat—(No!)—or at least follow the kid\nYou know what it is, what it was, who took it\nKid, and where they put it is so translucent\nSigns of time, they’re pissing me off.  Find\nYours ‘cause mine’s...\n\n[Verse 4: Vordul Mega, 4th Pyramid, and C-Rayz Walz]\n[Vordul Mega]\nOfficially lost and The Man is trying to hold\nOnto everything that I’m glad for like, yo\nEverything I know that’s true.  We always\nGoing through madness.  We do what we got to\n[4th Pyramid]\nC'est la vie.  A toxic Salem’s\nTrees hating green, the place that you paid the\nBeat\n[C-Rayz Walz]\nAliens landing, graze the streets\n[4th Pyramid]\nOnly one thing happened when they played that beat..."}]}