{"songs": [{"image": "https://images.genius.com/b0dcab7759816b8e3cf45e78f11f883a.800x800x1.jpg", "lyrics": "[Verse 1:]\nHey\nCellphone Off\nFriendships Off\nStaring at the ceiling fan, so ensconced\nAs a blue television screen illuminates my loft\nAt my new home.. I never felt so lost\nI'm Listenin' to the ocean on CD\nShe used to take a shower, with a glass of Riesling\nNow all the little things, and even smaller little things about her\nAre coming back, just to sting. I started this album in a delusional state\nDays before I packed my things up and moved from her place\nTold her she can plead with me until she's blue in the face\nBut I'm never coming back.. We're through\nAt first I felt discerned, self efficacious and absurd\nNear abusive tryna taunt her with my graces and my words\nThat my heart, hit the ground ,Like a glass pipe\nAnd I'm tryna scrape out, one last bowl, of residue..\n..Cause I know how you think, You still got my toothbrush\nSitting by your sink,every five minutes flip the shades open\nMaybe even peek, hoping that I, have come home to sleep..\n..Cause I know how you think,I know how you think..\nI know how you think..\nCheck, Hey, See I know what you're thinking\nYou're hoping I'm coming home to soak in potions with you\nLike in our living room, the ocean is blue\nAnd this ain't carpet, no, it's warm sand\nThis is paradise, where we never scream and never make a door slam\nAnd I've been raptured,I've been rinsed\nNo longer a Cockle,You're a captor, I'm a prince\nWith a glimpse every caviar's mine, I sip a fine, aged apricot wine\nAnd tippy toe over your maginal line, And I imagine, I imagine\nI imagine all I need's a glass of water and an aspirin\nAnd I could rub the knots up out your shoulders, till your body unfastens\nAnd strip you naked till your nucleus is glowing with passion, And I imagine\nThat everything is wonderful, I will just succumb to you,no pressure\nThis is comfortable, of course I wanna marry you I'll never even blink\nIt's everything its everything you think..\nCause I know how you think, You still got my toothbrush, sitting by your sink\nEvery 20 minutes look out the window shades, maybe even peek\nHoping that I, have come home to sleep\nCause I know how you think,you still got the last time I shaved stubble\nSitting in your sink, You're HOPING That I'm gonna come home, and just\nLay under the sheets, hold you and sleep, hold you for WEEKS\nCause I know how you think,You still got my toothbrush, sitting by your sink\nEvery 5 minutes, open up the door, look outside, take a peek,is he there?\nAm I there? will I sleep? Will I what? Will we speak? or will I lay down, massage your feet\nOr will I lay down, and all the heat will..\nPut me to the ground.. A bottle of your thoughts...\nI love you..", "year": null, "album": "North Korean BBQ", "title": "Inohowutheenk"}], "artist": "Mac Lethal"}