{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "[Intro: Cam'Ron]\nAnother 7 AM session with Mac, high as a motherfucker man\nEdward EG just walked in, waddup baller!\nMac Miller in the building! Lemme tell you this story\nThough real quick, about this ho\nExcuse me ma, about this \"chick\"\nThis how it went down tho:\n\n[Verse 1: Cam'Ron]\nBaby says she sick of me, sick of me, you kidding me?\nFuck the fuckery, you comfort me, you diggin me?\nNot Scooby Doo, boo-boo, no mystery\nNot school, but I tell you the history\nWanted me to wife her, I just want to pipe her\nOnly gave her cab fare, I would've white-Nik'd her\nBaby won't quit tho, she a fighter\nI'm like \"God damn, it was just a one-nighter\"\nDon't know what I said to her\nBut now, the girl I'm deadin her\nCaught the vapors, Schwarzenegger never seen this Predator\nVenus a competitor, my cream and my cheddar-ar\nSee more tennis than Venus Serena and Federer\nSergio Tacchini, Lamborghini, yea etc\nYour life feels like a movie, I'll truly be your editor\nCam did it, your man live it, I ran with it\n2 thousand dollar sweater (?)\n\n[Hook: Mac Miller]\nI tell 'em oh yeah, motherfucker, oh yeah\nI'm getting money with my homies, yeah you know I'm gonna share\nMight get hard, I don't care, I ain't goin nowhere, I ain't scared\nI got my peoples and they iller than yours is\nSo can you dig that? Can you dig that?\n\n[Verse 2: Mac Miller]\nI must admit it, I'm just iller than most\nThis business, I get up in it, like I'm pimpin' these hoes\nAll these people that you love, go head and give em a toast\nBecause if they ain't here tomorrow you gon miss em the most\nNow I'm livin' pretty good, yeah some would say phenomenal\nAll about my net like it's a goalie in a soccer goal\nAccomplished the impossible, my dreams they seemed illogical\nThey ain't about that essay paper, I'mma tell em adios\nBoss of all bosses motherfucker, shouts to Vado too\nShmutty hoes been told me that they love me, that ain't nothin' new\nYeah that's nice you know my Twitter, no I ain't gone follow you\nYou prostitute, dirty bitch, I'll throw you down the laundry shoot\nLike bada bing, bada boom, diamond rings, designer shoes\nFiner things I like to do, London, France, and China too\nGot a crib that got a view, above my yard that got a pool\nO'reilly tryna find me shit, too bad, I tell em:\n\n[Hook]\n\nCam told me to tell you that you a bitch, and you ugly\nThat's what Cam told me to tell you..", "year": null, "album": null, "title": "Dig That"}], "artist": "Mac Miller"}