{"artist": "360", "songs": [{"album": "Stand the Fuck Up", "year": "2011-08-07", "title": "Me and You", "image": "https://images.genius.com/7f4fab59ada976865312c9a52f6510d0.471x472x1.png", "lyrics": "[Chorus: Alana Stephens]\nAre you ready? Do you know?\nI feel it too\nAre you ready? I got to show\nI feel this for you\nI feel this for you\nI feel this for you\nI feel this for you (Ah!)\n\n[Verse 1: 360]\nYeah\nHi, I'm from the Generation Y\nSee they really wanna label us and separate us, why?\nLook me in my eyes, we in a better place in time\nAnd fuck what they be thinkin', I'ma never change my mind\nYeah, hear me out, I think livin' in this country's great\nBut there's a few things this government should fuckin' change\nTo our soldiers, man, lest we forget 'em\nHow the fuck are we still warin' when it's twenty-eleven?\nWrong, we move forward, but we take steps backwards\nLike those of us who don't believe in same sex marriage\nYeah, this is the modern day segregation\nSee, I defend and praise 'em, I could give a fuck if you resent and hate them\nSo if you with me on this track then throw your ones up\nAnd if you racist in this age then grow the fuck up\nI'm being real 'cause that's how we do it son\nWe representin' one race motherfucker, the human one\n\n[Bridge: Alana Stephens]\nOh yeah\nMe and you\n\n[Pre-Verse: Tys]\nWhen you hear this\nIt's gonna make [?] stop\nAll I really wanna see is\nA little piece of me inside your mind (Me and you)\nWhen you hear this\nIt's gonna make [?] stop\nAll I really wanna see is\nA little piece of me inside your mind  (Me and you)\nWhen you hear this\nIt's gonna make [?] stop\nAll I really wanna see is\nA little piece of me inside ya, uh (Come on!)\n\n[Verse 2: Tys]\nI play this game, I can see you're tryna break me down\nAnd kill me to fill me with all your hatred and your pain\nYou ain't gonna take me out, can't throw me or slow me down\nNah, you must me crazy to be thinking I'd let you manipulate me\nSo come on, I won't give up\nYou've tried for so long, but they go on 'cause you're not strong enough (Yeah)\nNow that's life, pick any one reason if that gives you reason to fight\nAnd stay alive and maybe in time you will find what you seek in this life\n\n[Chorus: Alana Stephens]\nAre you ready? Do you know?\nI feel it too\nAre you ready? I got to show\nI feel this for you\nI feel this for you\nI feel this for you\nI feel this for you"}]}