{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/d51a09ab284e0481b02b4d6ecfda5c73.1000x1000x1.jpg", "title": "Are You Real?", "year": "2005-02-01", "album": "Behind The Musik (A Boy Named Jonah)", "lyrics": "Yeah, uh, uh\nSo much stress keeps running through my mind now\nFell into a mess that I that wish that I could climb out\nI guess I hide it so nobody'll find out\nThe way everyone thinks that everything is fine now\n\nAt home things are messed up with mom and dad\nAnd at school all my friends stab me in the back\nNo one is real anymore, I hate the way they act\nThere's so many things that I wish I had\n\nSo God if You're there, do you understand?\nDon't You care about anything that's happenin'?\nIt's not fair to put me through all this junk again\nYou see that I'm scared, so help me if You can\n\nSo please speak loud and clear cause I'm listenin'\nI need to know that You're real cause I'm strugglin'\nYou need to show that You're here cause I'm stumblin'\nShow me that You care, this is why I'm saying this\n\nAre you real?\nI want to know\n(I want to know)\nAre you real?\nThen let it go\n(You got to let it go)\n\nAre you real?\nI want to know\n(I want to know)\nAre you real?\nThen let it show\n(You got to let it show)\n\nIt was right then when everything began to change\nI started looking at these things in a different way\nI saw life through God's eyes and it wasn't the same\nAnd it was right at the time I called on Your name\n\nThen I saw all these lies that was thrown away\nI recognized that I need You and on that day\nI cried out and seek You, that was when You came\nNow that I see You, I've been through a major change\n\nAnd I believe that You're real cause it's so plain\nI finally feel I can make it through anything\nIt don't matter what they speak or if they hate\nThey can't keep me down no more cause I seen Your face\n\nAnd for now on never will I be the same\nCause I'm staying strong and I won't bend this way\nNow that I know that You're real, it's gonna be okay\nYeah, You're speaking in my ear and this is what You say\n\nAre you real?\nI want to know\n(I want to know)\nAre you real?\nThen let it go\n(You got to let it go)\n\nAre you real?\nI want to know\n(I want to know)\nAre you real?\nThen let it show\n(You got to let it show)\n\nSee there's a war that's going on outside\nAnd You can try to ignore and just run and hide\nBut everyday more and more people die\nSee the battles for souls, we're on the front lines\n\nSo many souls, just too scared to fight\nThey're too worried about what people thinking of their life\nHow can You fight if You don't lay down Your pride?\nAnd how will anyone see if You won't shine Your light?\n\nSo many of Your friends walking around blind\nYou got the source that can open up their eyes\nIt's y'all's choice what you do with your lives\nBut I'm gonna go to war cause I made up my mind\n\nJesus gave us life when He went and died\nSo the least that I could do is give Him all of mine\nSo how many of y'all are ready to fight by my side?\nCause this is what He's saying right now here tonight\nCome on\n\nAre you real?\nI want to know\n(I want to know)\nAre you real?\nThen let it go\n(You got to let it go)\n\nAre you real?\nI want to know\n(I want to know)\nAre you real?\nThen let it show\n(You got to let it show)"}]}