{"artist": "Plies", "songs": [{"album": "Ain’t No Mixtape Bih 3", "title": "Heroin Flow", "image": "https://images.genius.com/b8f751697fc208e92974c1963beae5bd.1000x1000x1.jpg", "lyrics": "[Verse 1]\nIt's that heroin flow, might get an item for this\nStill keep a scope on a stick, just to make sure I don't miss\nI'm on the low of the scales, I like the fork on me feel\nKnee bitch in all I don't kneel\nThat said achieving will kill 'em\nAin't been asleep in a week\nMoney be having me deep\nI ain't even reach my peak\nWhite when you call for free\nI keep a stick in my pants, already smoke too much\nI don't really hang around niggas, ya'll like to bitch too much\nUsing more dope on the regular, although why don't we tell 'em?\nI already fought with one of 'em\nY'all better check my credentials\nBitch I'm from Pakistan, meaning I ain't wrapped too tight\nI used to sleep through the day, I used to hustle at night\nI walk with pride, it's real, I got my .9 on me\nI am the G.O.A.T for real, you can't deny my homie\nI'd rather grind and ball, don't need relying at all\nIf I gotta question you, then you ain't my dog at all\nI wake up flex, God done already blessed me\nI won't let a male or a female stress me\nI don't need no more kills, I'm not trying to erase ya'\nI ain't trying to marry, I'm just trying to hit ya'\nDrawn piece of 'erb me, no you can't search me\nYou ain't never worked me, I can't let you murk me\nDiamonds on the top dance, strippers on my lap dance\nJust like I signed myself, gave myself my own advance\nRealer than yo' favorite rapper\nI got mo' money than yo' favorite Trump\nLate nigga that's how I move, she let me fault one over\nGetting money by true profession. no bitch I ain't never stressing\nStarted feeling like Machiavelli, damn that ain't gonna be necessary\n\n[Chorus]\nIt's that heroin flow\nMight get an item for this\nMight get an item for this\nMight get an item for this\nIt's that heroin flow\nMight get an item for this\nMight get an item for this\nMight get an item for this\n\n[Verse 2]\nStill walk 'round with dotty, then brought my bitch come thottie\nWhen I was legit though, while fucking and bitchin' they got it\nStill got Trump in my blood, my folk went and bought me a bud\nStill bad bitches I hate, dumb bitches get on my nerves\nListen to wave and boos, get on that dope and I swerve\nI ain't never been cured, you know how my dough body's served?\nGot bodies under my belt, notes across my face\nMan school that nigga, remember no face, no case\n\n[Chorus]\nIt's that heroin flow\nMight get an item for this\nMight get an item for this\nMight get an item for this\nIt's that heroin flow\nMight get an item for this\nMight get an item for this\nMight get an item for this", "year": null}]}