{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Higher Than a Kite", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Intro: Lil Wayne]\nHello world!\nYoung moolah baby!\n\n[Verse 1: Nicki Minaj (Lil Wayne)]\nMurda dem, murda dem! (Yeah!)\nJust one word, body a third of them (Nicki)\nI kick kick game, can't injure Nicki (Minaj)\nThat's why they nick-nicknamed me, Ninja Nicki (Lewinsky!)\nI'm such a yes, and you're a no no\nLive with a Dragon, and wear a kimono\nI'm from the Philippines, badder than Billy Jean\nGuess that is why I get more head, than an a guillotine\nBut then I'm dumb struck 'cause you bums suck\nWhere the um---where the fuck is my nunchuck?\nI'm in Tokyo, with the Cokio\nSomebody sleepin' in my bed like Nokio\nI'm gettin' ill, I been poppin' a pill again\nI'm on an Island, and I'm lookin' for Gilligan\nWhere my Timberland? I got 'em tremblin'\nCan't find my keys, but I know, I hear them jingling\nYou're such a Marilyn – Monroe and Manson\nI'm got some heroin, wanna go dancing?\nYou at the door? Ok, I'm about to come down\nI'm getting numb now, don't let me come down\n\n[Chorus: Nicki Minaj (Lil Wayne)]\nSniffing on some good blow (Nicki Minaj!)\nIt's like I'm sippin' on the tempo\nAnd I can't come down now (It's the president y'all and that's the mistress)\nCause I'm higher than higher than higher than a kite\n\n[Verse 2: Lil Wayne]\nYoung Moola, baby! (Yeaaah!)\nI do what I does\nI come through this bitch, wrist bluer, than 'cuz'\nI'm so five star, Soo Woo to the bloods\nAnd before I had a mirror, I knew who I was\nI know where I'm goin', I knew where I was\nYeah, d-d-d-dirty, dirty south, see my shoe full of mud\nBaby who can you trust? Who can you love?\nWhen love kills, like somebody gave Cupid a gun?\nIt go (BAW!) Like you shooting for fun\nAnd sometimes the solution is execution for some\nBesides, you don't want that intrusion at one –\nA.M. and the conclusion, is you losing a son\nNo inducing my funds, I smoke the fruitiest blunts\nI mean the stupidest buds, I get stupid as duh\nI swear my doobie is uh – fat, and just like it, you can get lit\nShit don't stank, when you shittin' in the bank\nWhen her man run an errand, I'ma hit her like Hank\nLook him in the eye and a nigga might blink\nAim at his brain and a nigga might think\nWeezy\n\n[Chorus: Nicki Minaj (Lil Wayne)]\nSniffing on some good blow (Young Money)\nIt's like I'm sippin' on the tempo (Dirty Money)\nAnd I can't come down now (Cash Money)\nCause I'm higher than higher than higher than a kite (Young Moola, baby)\n\n[Outro: Lil Wayne]\nYo, It's the President man and the Mistress, Ms. Nicki Minaj aka. Nicki Lewinsky, yea and I am the president, shut yo mouth!"}], "artist": "Nicki Minaj"}