{"artist": "Andy Mineo", "songs": [{"title": "Now I Know", "album": "Uncomfortable", "year": "2015-09-18", "image": "https://images.genius.com/9a23efdbe421de59647ed95b73952a34.1000x1000x1.jpg", "lyrics": "[Verse 1]\nThe older I get, the more I realize\nAlmost everything I believed in my life was a lie\nIt started as a child, first was Santa Claus\nThen I believed that a broad would never come between my dawgs, wrong\nMy sister Mary filled me in when I was seven\nTold me Hulk Hogan only existed on television (what?)\nThe Stone Cold Stunner and the Leg Drop, all scripted?\nN.W.O. and X-Pac? Dang\nI used to walk up to them automatic doors\nMy momma told me that my finger was the power source\nSo I pointed with my pointer, then, pow! It was open, then come to find out she was jokin'\nHad to let it soak in, my mind as a boy didn't wanna believe that McGwire or Barry were on the 'roids\nBut, uh, when I was young, I thought the world was alright\nIt's funny, I even thought that Jesus was white, but yo\n\n[Hook: DAB, Mr. Talkbox & Andy Mineo]\nAll that glitters ain't made of gold\nIt's the thing you've heard a million times before\nI know, I know\nIt took a little time, now I realize\nNow I know better, it's better late than never\nNow I know\n\n[Verse 2]\nOver the years, you get more accustomed to pain\nUsed to believe my dad when he'd say he'd come to my games\nEven believed my mother was a saint and could do no wrong\nAnd then she sat me down and told me how I was born (shoot)\nMind blown, but now it all makes sense\nWhy she didn't spazz on me when she caught me havin' sex\nI was perplexed but now I get it\nI used to think America was finished with racism, how could I miss it?\nI'm mad so many people don't get it\nHoldin' this list of black names, but now I'm blacklisted?\nGot older, it's like it got no different\nI found out that these independent artists isn't independent\nCause major labels fund them quietly to keep perception\nThat's deception in the game\nUsed to believe I wanted fame, plus my name written in them lights\nNow I know it's so much greater cause it's written in the hand of Christ\nThen, I, I used to say the radio would play what the people wanted\nNow I know they playin' what's payin'\nFeelin' jaded, but somehow I still believe in God\nI even thought a college education got me a job, man\n\n[Hook: DAB]\nAll that glitters ain't made of gold\n(All that glitters ain't made of gold, man)\nIt's the thing you've heard a million times before\n(I know, I know, I know you heard it all before)\nIt took a little time, now I realize\n(It took a little while, now I know)\nNow I know better, it's better late than never\n(it's better late than never)\nNow I know\n\n[Outro: Mr. Talkbox]\nNow I know better\nYes, I know better\nNow I know better\nYes, I know better\nNow I know better (took me a while)\nYes, I know better (just to realize)\nNow I know better (now I know better)\nYes, I know better\nNow I know\nToo many times\nI know, I know, I know better\nAlright, alright....."}]}