{"artist": "Problem", "songs": [{"album": "354: Lift Off", "title": "Dollaz and Sense / 0 to 100", "image": "https://images.genius.com/07f0b039d7cab7eb982ac57884a9a623.500x500x1.jpg", "lyrics": "[Part I: Dollaz and Sense]\n\n[Verse 1: Problem]\nNigga, I'm from Compton, what up Quik? You my nigga, bro\nDoin' 80 up Figuero', condition is critical\nI can't get caught slippin'\nBy my foes or the po's, boy I've been sippin'\nShoutout to my nigga Villain nana crippin' even on cell day\nBig Nick, Ludolph, Bird Nose, and LJ\nDice games on a 102nd and Main\nI lose I hit [?], come back, then try to crack 'em again\nWay before I hit the traffickin' game\nNowadays I'm just traffickin' game, you better get some\nGet out the way 'fore I hit somethin', erhhh, pop\nI love drivin' bitch niggas crazy\nEat a bowl of shit 'fore a bitch nigga play me\nBallin', bitch try to play me\nKobe, KDs are laced up, in the club Aced up\nTatted from the waist up, fuck like a straight slut\nNah-ah-ah-ah-ah, that's for real\nAnd ho I don't need a pill\nIndependent gettin' skrilla, I don't need a deal\nBank'll kill at will, two sec, need Benadryl\nAnd a nigga been this ill for a long time\nYou pussies want a problem, get in that long line\nYeah, that long line, yeah, yeah, a long line\nRun it wrong, you'll be done in six seconds, no Vine\nTell your ho to come over, she'll be there in no time\nLike she watchless, it's Showtime, ho watch this\nIf I call you for me to come over I'm coming to stick\nChopsticks, pull it out she lock lips\nYeah, let me hit it bare then I might get her some head\nLick her for some paper, I'mma do it like a dare\nDiamond Lane the Gang, and I bang it like a snare\nOn God, bow down to no man\nI'm a bar, no Rosanne, El Segando to Rosecrans\nReppin', Westside steppin'\nEastside mind state with three K's, Andre\nI'm an outcast, honey mmm in the house stash\nWe'll just take you out for the right cash\nAnd I ain't talkin' 'bout no date\nBirthday love cakes as much as Boog loves Satan\nYou got served, in every way possible\nShit get hostile, I get colder than a hospital\nSo don't be bangin' under false pretense\n‘Cause if it don't make dollars, it don't make sense, boy!\n\n[Hook: DJ Quik, (Problem) & (Childish Gambino)]\nIf it don't make dollars, it don't make sense (Yeah)\nSo don't kill game, let the pimpin' commence (What?)\nIf it don't make dollars, it don't make sense\nSo don't kill game, let the pimpin' commence (‘Cause I ain't playin' with your punk ass, boy)\nIf it don't make dollars, it don't make sense (Diamond Lane, Money Gang, everything we run it)\nSo don't kill game, let the pimpin' commence\nIf it don't make dollars, it don't make sense (What up, Problem?)\nBecause you gotta give it up to the crown prince (What?)\n\n[Verse 2: Childish Gambino]\nNow look who came up in this bitch\nMister look like shit, but I know he rich\nGet at me, I thought you mothafuckas be happy\nBut they not ‘cause they took a back seat like a taxi\nI'm a latch key kid, home alone so often\nBut I had to come back to my Cali like Culkin\nI was born out here, then I moved out there\nNigga check my core, man, this shit ain't fair\nI got a track with Alley Boy, Fredo, and Problem\nSo you know I'm in the hood just like I'm a cobra\nPython, check the app, I'm hangin' with coders\nMan that 'Bino goin' off, I thought that I told you\nBefore the [?] closed and the Crenshaw Mall\nI used to date this fly girl with a place in the Dons\nWe used to cruise Leimert Park in a Beamer\nLove a Cali girl so much, have you seen her?\nShout out to Latinas, look at all these hynas\n'Bino is the highest, niggas know I'm childish\nI be on that Y shit, and she down to roll\nAte her pussy like a sachi teriyaki bowl\nAyo, Problem? (What up?) This a diss track right? (Go ahead)\nFuck you, fuck you - you're cool - you can't rap\nYou need help, you all industry hype\nMost of these niggas aight, none of 'em holdin' a light to me\nWearin' some wifer tees, like it was '93\nAfter the riots, niggas is violent\nSprayed the llama, took the L shit, wasn't silent, though\nMiddle finger crossed up, niggas now you know, for real\n\n[Hook: DJ Quik & (Problem)]\nIf it don't make dollars, it don't make sense (Gambino)\nSo don't kill game, let the pimpin' commence (Yeah)\nIf it don't make dollars, it don't make sense ([?] night with real men, for real)\nSo don't kill game, let the pimpin' commence\nIf it don't make dollars, it don't make sense (‘Cause if it don't make dollars it don't make sense)\nSo don't kill game, let the pimpin' commence\nIf it don't make dollars, it don't make sense (Compton, California, that's where I'm from)\nBecause you gotta give it up to the crown prince (Diamond!)\n\n[Interlude: Bad Lucc]\nAyo, Justin Credible, what the deal?\nYou know it wouldn't have been the same without Bad Lucc up in this thing [?] like that\nYou know what I'm talking 'bout?\nDiamond Lane up in this thing\nIf Diamond Lane's in this thing, you know LA's up in this thing\nAnd if LA's up in this thing then you know the LA Leakers up in this thing\nWe about to turn up real quick, ayo, Prob!\nShow 'em what that jump off mix do, the Diamond Lane way\nYou dig me? Yeah\n\n[Part II: 0 to 100]\n\n[Verse: Problem]\nCome through high, stepping like a kappa nigga\nRun the race, [?] Obama 'bout to lap a nigga\nI don't talk, kill beef before it happen, nigga\nThink we second place by the way we coming after niggas\nUp, down, closed fists like we 'bout to dap a nigga\nBro, don't shake my hand, don't try to dap a nigga\nMe and Luccy lavish, nigga\nIt's funny how the vets wait till you get the mail before they stop a nigga\nHuh, kind of crazy, right? (Yeah)\nBlowing cool J's, yeah, I'm with the ladies like (Yeah)\nA nigga matching head to toe, I'm the 80's type\nI hid my safe, it seen more scratches than when ladies fight\nBetty Wright, just (Nigga just), oh my God, I'm fucking focused\nRid the ground of Batman and start dealing with these jokers\nGot bitches (Got bitches), got a thousand on the sofas\nBut they better watch they steps, spent 2,000 on these loafers\nI ain't playin' (I ain't playin'), I done been took the jersey off\nMe and [?] ducking TMZ, scurry off\nD Kev, Retro 11's\nCashed out on \"Like What,\" got it patented, no leather\nOutside my boy, Lucc, ain't another nigga better\nAnd I'm gunnin' at a blue, sharper 9, sharper [?]\nDiamond Lane, came from nothing, Hell yeah, I'm livin' proof\nHundred twenty-five inches worth of TV in my room\nPicture clear (Picture clear), birdy told me let y'all have it\nNow I'm busting, pretty lady, get that towel from out the cabinet\nWipe me down (Wipe me down), wipe me down, wipe me down\nGod done gave me the will, who the fuck can stop me now?\nRun 'em over (Run 'em over), grab a spatula, leave him flat\nI don't give a fuck, niggas shouldn't have stepped on the track\nAnyway, delay, one lane, no delayin'\nCourt side with a basketball nigga's boot thing\nTrue story (That's real, nigga)\n\n[Outro: Problem & Justin Credible]\nYeah\nDiamond Lane, Problem, Bad Lucc, cash in\nWe comin'\nOK, you see what it is, man\nLA Leakers, Justin Credible, Fuzz Fantab, DJ Sourmilk, man\nAlong with the homie, Problem\nWhoa, it's about to be a 3, 5, 4, lift off\nLet's turn it up, man\nLA, let's show 'em how we do, baby, LA Leakers", "year": "2014-08-28"}]}