{"songs": [{"year": null, "image": "https://images.genius.com/502994a09a730898aee4703439b6d8c7.750x750x1.jpg", "title": "Hey You", "album": null, "lyrics": "[Verse 1: Big K.R.I.T.]\nAye, let me holla for a second\nShoot some game in your direction\n'bout this pimp shit, you was tailor-made\nFor this outfit\n\nMind molded, brave ho, blindfolded\nHands tied, never fall, landsliding\nI'm your man now, your one and only\nYour best friend, your homie\nConfidant when you lonely\nTell me all your dreams\nAnd I'll proceed to sew the seams of this love affair\nA blanket with my arms to keep you warm\nStay up under here\nPicture us rollin', car not stolen\nGator shoes on my feet, chinchilla on my shoulders\nCoasting down 85 as you drive\nI puff this loud, put it in the air, sky-high\nA certified gold mine between your thighs\nI polish it and set it out to let it shine\nWe going places like we never been\nOur side of town is smaller than the smallest town we in\nThese lenses see your flaws\nDown for your cause\nWhen you let down your guard and I broke down your walls\nMy number one starter\nProud of you, no doubt in you, nothing like your father\nI drafted you then coached you in when no one else would bother\n\n[Hook]\nHey you (Hey you)\nBaby, baby (Get down with this team shawty)\nI wanna talk to you (Let me talk to you)\nBaby, baby (Put you in this game, be my starter)\nHey you\nBaby, baby (Let me be your Bulls)\nI wanna talk to you (Get you a couple rings, babygirl)\nBaby, baby (We goin places '09, ya feel me?)\n\n[Verse 2]\nA'ight, ok, a'ight, pretty brown eyes\nYou can't deny I got you twisted like a dread\nOn Erykah Badu's head that went missing\nYou gifted and I know it\nDown to help you show it\nPimpin' is as fluid as water, let me pour it\nOn your mind\nDrip into your veins, feel it tingle in your spine\nPump into your heart\nLose control, let it ride\nGive it all you got\nAny doubts, let 'em die\nIt's just you and I, sho' you right\nEverything is everything, chillin' in the breeze\nWhy give it up for love when you can charge a trick a fee?\nDon't know how you should budget?\nBaby, bring that shit to me\nI'll knock it up and stretch it as far as the eye could see\nSo forward flow\nColder than cold could wish to be\n?... smell of P-I-M-P\nSippin' saki with Chinese broads that dig my spit\nHolla \"Wo Ai Ni K.R.I.T\" when they jump on my tip\nChyeaaa"}], "artist": "Big K.R.I.T."}