{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Sung]\nDo you know, what you're goin through?\nDo you like this style of rap that I'm showin you?\nThe way I flow for you.. do you know?\n\n[Intro: rapped]\nYeah baby c'mon\nAh baby baby c'mon, check the rhyme to the song\nUhh, aw yeah baby c'mon\nAh baby baby c'mon, and check the rhyme to the song\n\nOne double nine to the four, gotta keep 'em on the floor\nAnd put some real lyrics back in the hardcore\nWhat I'm used to hearin', I can't believe it's gone\nBut now just like a grill inside Burger King, the beef is on\nWhen I come, rappers begin to speak in degrees\nI even make Sisters With Voices weak in the knees\nSo run for your lives, Kane with the pen\nIs like Freddy with the glove full of knives\nWho wanna test these skills, come see how it feels\nI pull you one verse, if that don't kill I got refills\nYou can't do me none, kid you gets nothin'\nIf my rhymes was in Braille, you still couldn't touch em\nMan, I'm a bad cat, my style of rap is mad fat\nAnd you know, sometimes it's so sad that\nRappers today be comin' as the gangster rhyme type\nAnd be so soft, they wouldn't even kill time right\nHere's the news, you lettin' the word hardcore be misused\nYou ain't never paid dues\nBe for real, you ain't tough yet\nThe razor bumps on your throat is the only thing makin' you a ruffneck\nYour whole image is a dammmmn sham\nI'm glad in this business I didn't forget who I am\nI always remain the Kane inside a battle\nNever to walk in anyone's shadow\nI do my own thing, I do a thing of my own\nAnd with my competition I let it be known\nThat battles I don't lose none, boy you get bruised son\nSix million ways to die -- choose one!\nMy rap style is like a poisonous vemon\nWe might as well be havin' sex, the way that I put it in 'em\nAnd do I crush MCs? are you kiddin me?\nIf rappers were grapes, I'd have a whole wine distillery\nSo, I bring it to your face, with the bass, then I blow\nA rapper off the map, with the rap, when I flow\nThen hit you with the skill that is ill, and I know\nThat all of this is good to go, 'cause yo\nThat's the way the flavor always come\nThe rhymes they flow accordin' to the drum\nThe Brooklyn style cause that is where I'm from\nYou want the funk so let me give you some\nI flip on the flow on the track, just like that\nAmazin' the people the style of the rappin', is quite fat\nI'm lickin' the lyrics and shootin' the gat, on the mic, black\nAnd this is for all of the rappers that like, and they bite that\nThe Smooth Operator is mellow with the saxophone\nSettin' the tone that make the girls relax and moan\n'Cause all the ladies I'm givin' 'em lots of love\nHittin' more skins than a boxing glove, good God\nThe girls treat me like the drummer and give me some\nFrom tall to short to thick, even the slimmy ones\nWatch out Goldie! Gimme a forty ounce of Olde E\nAnd none of you players can control me\nYou get the chance to see a true mack man\nWith skills to pay the bills, to make more stacks than\nTaller than anybody else's stacks it seem\nCause the Kane get more paper than a fax machine\nThe unforgettable, rhymes are too poetical\nKeep rappers in order more than letters put alphabetical\nAnd I hope the record consumers don't believe the magazine rumors\n'Cause Kane is makin' a comeback, like Pumas\nI get rough G, and set it on your whole damn company\nAnd Bogart, like my name was Humphrey\nWhen I get through, there'll be no more of them\nAs many rappers I burnt, I should open a crematorium\nI make mad MC's give me my P's\nIf you try to disrespect, kid you can get these\nN.U.T.s, like the U.N.V.s\nI leave you down on your knees, down on your knee-hees!\nRazor sharp, many ways of art\nSource rings the chart, people praise the God\nFor kickin' the flows so fantastic and this one here\nWe're callin' it Lyrical Gymnastics\n\nUhh, so baby baby c'mon\nAw yeah baby c'mon, and check the rhymes to the song\nUhh, ah baby baby c'mon\nSuki suki c'mon, and I'm gone!", "image": "https://images.genius.com/c57181cdaaeb4f7bcf3a5a0f89a83315.1000x1000x1.jpg", "year": "1994-09-13", "title": "Lyrical Gymnastics", "album": "Daddy’s Home"}]}