{"songs": [{"year": "2016-01-28", "album": null, "image": "https://images.genius.com/38ae86b1aa8a821cc37f011e368f8410.500x500x1.jpg", "title": "Focus", "lyrics": "[Hook]\nYou can tell 'em Imma get it my way\nYou can tell 'em Imma get it my way, my way, okay (x4)\nFocused, and I'm working on the craft\nDoin' everything a young nigga got to , got to, got to (x3)\nFocused, and I'm working on the craft\nDoin' everything a young nigga got to\n\n[Verse 1]\nLook, my style too ill, no exaggeration\nCan't get like this with procrastination\nI'm a slave for the craft, no master, baby\nAll I can think about is making records lately\nI've been workin' like I'm livin' on a mission\nI'm efficient', but the vision wasn't given\nTo the niggas that was sitting on the sideline watchin'\nThey can see you strugglin'\nTrippin' and fallin', but no one helps you out\nLook, I know the feeling of being alone\nI've come to terms with decisions I've made\nBut I pray everyday and I hope that I'm safe\nIf I send you this song, will you send me some positive energy?\nPlease, I am begging you for it\nI'm forcing myself to feel something euphoric\nOf course it's important, to point out the beauty in life\nThat I see like a minuscule witness\nThe muse for the music that people have muted\nConfuse it for ignorance, that is not me, tho'\nI creep low and see more, but my lack of C notes is see through\nBe set in the tone of my messages\nNegative outlook is getting repetitive\nI am regressing, progression's my nemesis\nMy pessimism is potently powerful\nWordsmith, I might play around with their volatile\nLawd!\n\n[Hook]\nYou can tell 'em Imma get it my way\nYou can tell 'em Imma get it my way, my way, okay (x4)\nFocused, and I'm working on the craft\nDoin' everything a young nigga got to , got to, got to (x3)\nFocused, and I'm working on the craft\nDoin' everything a young nigga got to\n\n[Verse 2]\nNever let you muthafuckas defeat the kid\nSpitting egregiousness\nDo you agree with it?\nNever see them again, I'm a seed in the ground\nI ascend to the light with the lines that I write\nAnd my rhymes got girth, like Im foresting the earth\nAll I ever do is work, I'm asserting my worth\nThis is something I was taught since my birth\nAnd you will attain nothing by sitting around\nAnd to receive a blessing, you must do for self\nAs an means to an end, so that one day you'll help\nSomeone that you see struggling, just like yourself\nAnd I can't justify why I do what I do\nWhen I act how I act and thats far from the truth\nIf I told you my story, then you would past judgement\nDisgusted by what you hear in that discussion\nI swear that I've witnessed some sickening, cynical rituals\nPitiful pray that the pinnacle presents some pieces\nI preset my presence, a pretense apart\nWith no beef and im starving\nIve barely started of carving my name in this game\nI'll explain, but I gotta move fast\nGet a point of view quicker, I'm a catastrophic nigga\nDefinitive when I kill it\nAin't no muthafucka that was giving you\nSomething thats realer, but never caught in a feeling, goddamn!\n\n[Hook]\n\n[Outro]\nLawd!"}], "artist": "K.A.A.N."}