{"songs": [{"image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg", "title": "Best I Ever Had (Remix)", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Intro: Drake & *DJ drops*]\nYeah\nYo, it's the Aphilliates, nigga, pay attention!\nNicki Minaj, Young Money\nYeah\nDrizzy's home, baby\nHoliday Season!\n\n[Hook: Drake, Nicki Minaj, & DJs]\nBaby you my everything, you all I ever wanted\nWe can do it real big, bigger then you ever done it\nYou be up on everything, other hoes ain't never on it\nI want this forever, I swear, I could spend whatever on it\n'Cause she hold me down every time I hit her up\nWhen I get right, I promise that we gon' live it up\nShe make me beg for it, 'til she give it up\nAnd I say the same thing every single time\nI say you the fucking best (Ayy), you the fucking best (Ayy)\nYou the fucking best (Ayy), you the fucking best (Ayy)\nYou the best I ever had (Best I ever), best I ever had (Best I ever)\nBest I ever had (Best I ever), best I ever had (Best I ever)\nI say you the fucking...\n(Aphilliates, nigga! Pay attention!)\n\n[Verse 1: Drake]\nKnow you got a roommate, call me when its no one there\nPut the key under the mat, and you know I'll be over there (Yup!)\nI'll be over there, shawty I'll be over there\nI'll be hitting all the spots that u ain't even know was there\nHa! And you ain't even have to ask twice\nYou can have my heart or we can share it like the last slice\nAlways felt like you was so accustom to the fast life\nHave a nigga thinking that he met you in a past life\nSweatpants, hair tied, chilling with no make-up on\nThat's when you're the prettiest\nI hope that you don't take it wrong\nYou don't even trip when friends say\n\"You ain't bringin' Drake along?\"\nYou know that I'm working, I'll be there soon as I make it home\nAnd she a patient in my waiting room\nNever pay attention to them rumors and what they assume\nAnd until them girls prove it\nI'm the one to never get confused with, 'cause...\n\n[Hook: Drake & Nicki Minaj]\nBaby you my everything, you all I ever wanted\nWe can do it real big, bigger then you ever done it\nYou be up on everything, other hoes ain't never on it\nI want this forever, I swear, I could spend whatever on it\n'Cause she hold me down every time I hit her up\nWhen I get right, I promise that we gon' live it up\nShe make me beg for it, 'til she give it up\nAnd I say the same thing every single time\nI say you the fucking best (Ayy), you the fucking best (Ayy)\nYou the fucking best (Ayy), you the fucking best (Ayy)\nYou the best I ever had (Best I ever), best I ever had (Best I ever)\nBest I ever had (Best I ever), best I ever had (Best I ever)\nI say you the fucking...\n\n[Verse 2: Nicki Minaj]\nAyo, you the only one that see the real Nicki\nI can show you \"Chill Nicki\" 'cause of how you deal wit me\nWhen they knock my blocks down\nYou come and you build with me\nEven though you real busy, you still fuckin' real Drizzy\n(Trap-a-Holics!)\nIt`s so amazing\nI figured out this world is ours with the taking\nI figured out that when I go out and all those people scream\nThat's some of them are living vicariously through me\nThat's why I put that \"S\" on my chest and I'm gone\nBut on another note, let's have sex in my dorm\nAnd I'ma make you beg, 'cause you look pretty when you beggin'\nSo meet me on the campus, I`ll be there around eleven\nSo let me put my books down (Down)\nExcuse me if I look down (Down)\nGuess I'm a little nervous, but I'm at your service\nLook at what you took down (Down)\n\n[Hook: Drake & Nicki Minaj]\nBaby you my everything, you all I ever wanted\nWe can do it real big, bigger then you ever done it\nYou be up on everything, other niggas never on it\nI want this forever, I swear I can spend whatever on it\nThat's why I hold you down, every time you hit me up\nWhen I get right, I promise that we gon' live it up\nI make you beg for it, until I give it up\nYou say the same thing, every single time\nI say you the fucking best (Ayy), you the fucking best (Ayy)\nYou the fucking best (Ayy), you the fucking best (Ayy)\nYou the best I ever had (Best I ever), best I ever had (Best I ever)\nBest I ever had (Best I ever), best I ever had (Best I ever)\nI say you the fucking...\n\n[Verse 3: Drake]\n\"Sex, Love, Pain,\" baby, I be on that Tank shit\nBuzz so big, I could probably sell a blank disc\nWhen my album drop, bitches'll buy it for the picture\nAnd niggas will buy it too and claim they got it for they sister\nMagazine paper girl, but money ain't the issue\nThey bring dinner to my room and ask me to initial\nShe call me the referee, 'cause I be so official\nMy shirt ain't got no stripes but I can make your pussy whistle\nLike the Andy Griffith theme song\nAnd who told you to put them jeans on?\nDouble-cup love, you the one I lean on\nFeeling for a fix? Then you should really get your fiend on\nYeah, just know my condo is the crack spot\nEvery single show, she out there repping like a mascot\nGet it from the back, and make your fucking bra strap pop\nAll up in yo slot until the nigga hit the jackpots\nI'm saying!\n\n[Hook: Drake]\n'Cause she hold me down every time I hit her up\nWhen I get right, I promise that we gon live it up\nShe make me beg for it, 'til she give it up\nAnd I say the same thing every single time\nI say you the fucking best (Ayy), you the fucking best (Ayy)\nYou the fucking best (Ayy), you the fucking best (Ayy)\nYou the best I ever had (Best I ever), best I ever had (Best I ever)\nBest I ever had (Best I ever), best I ever had (Best I ever)\n\n[Outro: Drake & Nicki Minaj]\nUgh!\nAww, yeah! (Aww, yeah)\nSee, this the type of joint you gotta dedicate to somebody\n(This is...)\nJust make sure they that special somebody (NSA)\nYoung Money! (...Baby!)\nYeah\nYeah"}], "artist": "Nicki Minaj"}