{"songs": [{"year": "2015-12-26", "album": "Keisha vs. Kash Doll", "image": "https://images.genius.com/971d444e51120df288bcdf10eccf67d3.500x500x1.jpg", "title": "So Crazy", "lyrics": "Girl you fucked on that nigga for nothing?\nYou ain't even get a bag for all that hoeing and smutting?\nYou ain't even get Jag for all that dick you was sucking?\nDid you really think that he'd take you from nothing to something?\nI know you ain't think he a treat you like me babe?\nKash out on you and have you up in that Pj\nI know you couldn't have though that shit was that easy...\nI know you didn't think he'd wife you being that sleazy huh?\nOh I get it you saw me with that roof gone?\nRiding through the hood good scream \"what up doe!?\"\nBlowing through these stacks fast spinning all this kash\nThat nigga left you with a wash cloth and a wet ass\n\nY'all so crazy, gotta stay down to you come up I work for this shit duuh (ya'll so crazy)\nThese chicks is mad aggy, you want the boss print just ask me... (ya'll so crazy)\n\nYou live yo life like what would Kash Doll do\nGo and get this money show you hoes how to ball boo, taking a meeting talk about shit don't involve you, while you sitting and waiting for a nigga to call you\nI really tryna figure out like who the hell raised ya'll? Basic ass bitches yeah ya'll mamas failed ya'll\nTryna keep up, you robbing peter to pay Paul, and now you rap to bitch now don't quit ya day job\nCause what you shouldve done is asked a bitch how you get it instead of being jealous you could've been helping me spend it\nOnly a lame bitch fuck for what the next bitch got, you wanna be me so bad huh?\nBuh I think no-o-o-o-o-o-o-o-o-t\n\nY'all so crazy, gotta stay down to you come up I work for this shit duuh (ya'll so crazy)\nThese chicks is mad aggy, you want the boss print just ask me... (ya'll so crazy)\n\nY'all so crazy, gotta stay down to you come up I work for this shit duuh (ya'll so crazy)\nThese chicks is mad at me, you want the boss print just ask me... (ya'll so crazy)\n\nAin' had to fuck em and suck em to get nothing if a nigga ever said he was leaving me bitch he bluffing, you gotta be smart then the next man if you wanna holder take yo ass out the Bunny Ranch\nYa'll hoes kill me, always wanting the next chick issues bitch you want her life but don't even know what she been through\nI mean for all you know my nigga could be a head ache, side eye for all of you bitches I mean I just can't\nAnd that's why ima stunt even harder just watch me ball boo, ima be at yo spot everytime that you fall boo\nIn it sitting pretty with new money to show you, popping bottles just so that I can spill it on you\nSee usually I don't pay you hoes, no attention but now I really think you feel like ya'll my competition\nOr maybe you my bae, my doll and I'm yo chero but either way you out of here bitch you know mental?\n\nY'all so crazy, gotta stay down to you come up I work for this shit duuh (ya'll so crazy)\nThese chicks is mad aggy, you want the boss print just ask me... (ya'll so crazy)\n\nY'all so crazy, gotta stay down to you come up I work for this shit duuh (ya'll so crazy)\nThese chicks is mad aggy, you want the boss print just ask me... (ya'll so crazy)"}], "artist": "Kash Doll"}