{"artist": "Ice Cube", "songs": [{"title": "Don’t Bring Me No Bag", "lyrics": "[Intro]\nHey man, get the door\nThese mother fuckers think it's CVS around this bitch\nTell him we ain't 'bout that shit\n\n[Interlude: Menace II Society (1993): Chauncy & Nick]\nYo, who is it?\nUhh, Nick\nYo, nigga, what up?\nOh, nothin'\nWhy you come to this motherfucker so early all the time, man?\nYou-you said 1 o'clock\nI don't give a fuck what I said, nigga\nI don't get out the bed before two-thirty\nDon't come through this motherfucker so early next time, nigga\nUnderstood\nLet's see what'chu got\n\n[Chorus]\nAin't 'bout to count no money, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\nAin't 'bout to count no money, nah, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\n\n[Bridge]\nAin't no disrespect (disrespect), well maybe it is\nAin't no trappin' here (Trappin' here), well look here now, bitch\nAin't no Oxycontin (No oxycontin), no coke or no thizz\nHave you forgotten (You forgotten) who the fuck that I is?\n\n[Verse 1]\nTrap or die, that's a lie, niggas fry or testify\nSuperfly, get super high, jigga boo shit, supersize\nNiggas do shit and justify\nYou can do shit and get euthanized\nI could do shit, that's no surprise\nServe your ass, two piece and fries\n\n[Chorus]\nAin't 'bout to count no money, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\nAin't 'bout to count no money, nah, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\n\n[Verse 2]\nYou niggas high as fuck (High as fuck), got slow reaction\nI done sobered up (Sobered up) and I'm down for action\nAnd I fuck you up (Fuck you up), if you come 'round askin'\nDon't try to play me (Try to play me) like I'm Anglo-Saxon\nYou a mouse in a trap house, I'm a dog in a cat house\nI'm comin' like Harriet Tubman, you comin' like Harry the drug man\nSome niggas don't give a fuck, man, 'bout they own people sufferin'\nTalkin' 'bout that they strugglin', made somethin' from nothin'\n\n[Chorus]\nAin't 'bout to count no money, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\nAin't 'bout to count no money, nah, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\n\n[Verse 3]\nI'ma kill me a dope dealer\nI'ma douse me a trap house\nWho let the dogs out?\nI'ma make niggas crawl out\nI'ma make niggas call out to Jesus and they momma (Jesus and they momma)\nRight before they vomit (Before they vomit) blood out they stomach (Blood out they stomach)\nThis for my auntie, she smoked your shit daily\nAnd this'll make you crumble, yeah, just like it did my uncle\nAnd this'll make you meet your maker, understand that he's the baker\nGot your ass on the slab now you the dope for the undertaker\n\n[Chorus]\nAin't 'bout to count no money, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\nAin't 'bout to count no money, nah, ain't sellin' no dope\nDon't bring me no bag, I want a envelope\n\n[Outro]\nDon't bring me no bag\nDon't bring me no bag\nYou-you a mouse in a trap house, I'ma dog in a cat house\nYou-you a mouse in a trap house, I'ma dog in a cat house\nYou-you a mouse in a trap house, I'ma dog in a cat house\nYou a mouse in a trap house, I'ma dog in a cat house", "image": "https://images.genius.com/90eb800a406018bdc1a360ae9db5d64d.1000x1000x1.jpg", "album": "Everythang’s Corrupt", "year": "2018-12-07"}]}