{"songs": [{"year": "1988-03-01", "image": "https://images.genius.com/77d88d155deb94b3da1eee1f8e5c78c1.395x400x1.jpg", "title": "Cool V’s Tribute to Scratching", "album": "Goin’ Off", "lyrics": "{*Cool V cuts and scratches his own name*}\n\n[Biz Markie]\nI'ma make this brief, like about 30 seconds\nMy DJ, gets all of his respect in\nSuper crazy blendin, so he can sound groovy\nAnd it can only be the vibe of Cutmaster Cool V\nWhen he cuts the funky record, it sounds so like def\nAnd it can be SMOOTH, from right to left\nBut now I'ma shut up and step off from the action\nIt's Cool V give you hits, he do the funky scratchin\nCool V go ahead!\n\n{*Cool V scratches his own name again and \"I do damage!\"*}\n\n[Biz Markie]\nYo, I'd like to tell you about my DJ\nHe cuts the records and he's my protege\nSo check him out without a doubt and you will agree\nHe goes by the name of Cutmaster Cool V\nCut the funky records, for me and the crew and\nYou will agree that he will be pursuin\nA career, and like I have no fear\nFor when he cut the funky records he won't be dissapear\nNow you think of rockin and MC's know\nHe's highly recognized as the DJ of disco\nHe can like mix, and he can like cut an'\nEverytime I rock people say - V what in the heck\nAnd they be checkin and, yo wait a second\nAs he be rockin it, always collectin\nThe money or dead presidents, whatever you call it\nSO COME ON COOL V - GO FOR IT!\n\n{*Cool V scratches his own name again and \"I do damage!\"*}\n\n[Biz Markie]\nHere's a biography about my DJ\nHis name is Cool V\nAnd when he cut the funky records, he get respected\nAnd he's an Aires\nSo check him out without a doubt as I be gettin down\nI rock the funky rhythm of a rhymin sound\nI think I like the way that he cuts for me\nThat's why he's my DJ - {*Cool V!*}\nGirls!  Wherever you call 'em\nHe rocks from here all the way to the Bell forum\nI'm like tellin you straight on up\nEverywhere that I go, the boy {*tear shit up*}\n\n{*Cool V scratches \"tear shit up\" and his name*}\n\n{*various Cool V cribs until the song fades out*}"}], "artist": "Biz Markie"}