{"songs": [{"year": "2010-04-27", "lyrics": "[Intro: B.o.B & (Ricco Barrino)]\nWhat's up, what's, down\nLadies and gentleman we are entering into the fifth dimension\nAnd did I mention, we gone? Ha ha ha. We gone. We gone\n(B.o.B, give it to 'em, shortie)\n\n[Verse 1: B.o.B]\nGirl, I'm eons and eons beyond these peons\nAnother human like me there will never be one\nThe planet that I'm from, I can't even speak on\nThe stars is what I sleep on\nThe moon I put my feet on\nThe way my aura glow, you'd swear I'm made of neon\nCooler than the freon, that's in your Dodge Neon\nThey say the future is now, to me it hasn't begun\nStay tuned to me and their will never be a re-run\nSo come and leap on my body and as we come\nYou'll probably feel moist like the trees on the tropics\nWe gone, we out it, no we don't need rockets\nWe hop up on the mother ship an we gone, we slidin'\nWe slippin' through dimensions, we hyper space glidin'\nBlastin' through the atmosphere\nFrightenin' in the lightenin'\nI know I'm out my mind girl, but you know you like it\nSo hope up on my cosmic highway so can ride it\n\n[Hook: Ricco Barrino]\nShorty are you going, my way?\nCome and ride on my, my cosmic highway\nOoh, let's go\nOoh, let's go\nLook, shorty I can't stay on the Earth no more\nAnother galaxy we must go\n\n[Verse 2: B.o.B]\nWell, fresh up out the sky I'm like a meteorite\nSo when the studio, no, I don't need to go write\nMan I just came up in the game 'cause y'all just needed more life\nSo, so by the time I'm done their ain't gonna be no more mics\nAnd people ask me, \"B.o.B what kind of language is that?\"\n'Cause I may blast into the future, I may never come back\nAnd I'm a leave with a 30,000 light year leap\nHeaded to a distant planet called B.o.B\nAnd then I'm gone\nMan they not ignoring me\nTaking off from half court Air Jordan\nAll systems go in 10 seconds I'm orbiting\nHanging in the Cosmos like a space ornament\nHeat 'em up like a solar panel, yes I bring the pain\nSimilar to asteroid that's headed to your brain\nMy lane is something that they really cannot explain\nThey try to hold me down but man it's me they can't contain\n\n[Hook: Ricco Barrino]\nShorty are you going, my way?\nCome and ride on my, my cosmic highway\nOoh, let's go\nOoh, let's go\nLook, shorty I can't stay on the Earth no more\nAnother galaxy we must go\n\n[Bridge: Ricco Barrino]\nCome and go with me, I'll take you to my galaxy\nI'm talkin' 'bout Venus, Jupiter, Mars, Mars, Mars\nAnd I'm sayin' girl, let's ride all night\nAnd I need you for this ship girl to take flight\nLet's go, let's go\nCome on baby let me take it off\nAnother second we gone blast it off\n\n[Hook: Ricco Barrino]\nShorty are you going, my way?\nCome and ride on my, my cosmic highway\nOoh, let's go\nOoh, let's go\nLook, shorty I can't stay on the Earth no more\nAnother galaxy we must go", "title": "5th Dimension", "album": "B.o.B Presents: The Adventures of Bobby Ray", "image": "https://images.genius.com/ff4d9bb096ad39d2f1abc7313779642c.1000x1000x1.jpg"}], "artist": "B.o.B"}