{"artist": "Booba", "songs": [{"album": null, "title": "Bellucci (English)", "year": null, "lyrics": "[Refrain: Booba]\nAlways fresh, I remain on the surface\nAs the ice cubes in my Chivas\nIt is not henna on my face\nRelinks ashore\nI have the AR, I ski mask\nO-R chains on primates\nI'm Stan Smith at Adidas\nJ'monte 300 # Leonidas\nYour life hangs by a phone call\nTa Hlel hangs by a dick stroke\nSergeant Kopp'zer in the cockpit\nToo bling'zer to the portico\n\n[Verse 1: Booba]\nI'm on the net'zer in the street\nMarried to hate as Bellucci\nNigga, you are fake as your Gucci\nI know what to put, I am too well off\nI beg you, my walk on Zanotti\nThis is the weight of arms, not words, which weighs me\nIt's not rocket handjob but deafening you\nWhat a crappy brand door Matuidi\nWith us, saying nothing, everything has been said\nAlways live the Mothership\nI had Alzheimer's when they questioned me\nWhen j'pense to you, I think missionary, not legionnaire\nI'm posting in the room your mother\nIn the commissioner's office\nI'm cocaine, you're sleeping pill\nMy God, how many fake niggas proliferate\nI have the best flow of the universe\nMy Glock my first wife, so I left to Lucie\nJ'gagne the lottery, 20 smoke join\nJ'voyage badly as a lo-ki-ing in the will\nWhen they ask me, the harki talks to Three Monkeys\nJ'te draws a large ball as a gnocchi in the larynx\n\n[Verse 2: Future]\nIt's murder for hire\nI put coke in the tires\nI got dope on the flight\nThere’s birds on the Phantom\nBurning money like Cam'ron\nComing straight out the gutter\nDrinking that dirty Sprite syrup\nI fuck all your kids and your mother\nMe and young Booba, we bosses\nDown in Miami we flossin'\nI just be tripping with flavor\nThey call like, “Where is the sauce?”\nI got a kilo and bought me a kilo\nTony Montana and I got the yayo\nThese bitches be loving a nigga for hitting a hater\nShit, these bitch ass niggas won’t let me have my moment\nKnock and dodges to my enemy\nBagging up, selling these coca leaves\nThen I go take me a shopping spree\nI want a brand new AR with a 100-round drum on it\nThat money really make her cum, bitch\nThen go put your tongue on it\nThat bitch really yours, nigga?\nYou better put alarm on it\nI ain’t go to Harvard, nigga\nThat’s word to my momma, nigga\nI put that presidential Rollie on that bitch\nAnd then she mine, my nigga\nI grind and I shine, my nigga\nI ain't wasting no time, my nigga\nI’m smashing your freak on the passenger seat\nShoot at you niggas, saying, “Fuck all the beef!”\nI got ammo for days\nRun around in the Caymans\nMac-11 in the Bentley\nAnd I ride for my real niggas\nOnly God can judge me\nWhen you live like a field nigga\nWhen you don’t feel niggas\nSometimes you gotta kill niggas\n\n[Outro: Future]\nWord up to my motherfucking riders, ya heard me?\nEverybody getting sprayed up right now\nI can’t keep out these hoes XXX\nThey might turn on me, mo'fucker\nI’m ‘bout to got a blue story nigga\nShit ‘bout to get real uncomfortable for you niggas, ya heard?\nBooba ! Belucci! Freebandz! Freebandz! Freebandz!\nWooh", "image": "https://images.genius.com/f824cfdae091fb9a88cc4546002502ae.630x630x1.jpg"}]}