{"songs": [{"image": "https://images.genius.com/e4f501fdfa584d29ce2e2706f76e3bf6.500x500x1.jpg", "title": "We Ain’t Friends", "album": "For All Seasons", "year": "2000-09-19", "lyrics": "[Hook]\nWe ain't friends.. no more..\n(I guess it gotta be like this)\nHow'd it end?.. cold war..\n(You made it like this)\nWe ain't close.. like we use to be..\n(I thought we gon' be here forever)\n(You and me, on my side, my dawg, my nephew)\nWe ain't friends..\n\n[Hook]\nYo, how long did you think you could get away with it?\nDid you think that the bullshit would stay hidden?\nY'all niggas fucked up, makin' me choose\nYo I use to have love for ya, now I refuse\nTo have anythin' other than hate\nMy brothers fate's in it\nI wonder how the evil got up in us\nYou throw dirt on my name\nAnd when you bleed then you game\nWhen you need, then you came\nNot now we ain't friends\n\n[Verse 1]\nAyo, ayo, ayo, do the math yo, add and subtract\nEvery year I lose a close friend\nToo many haven't came back\nI seen niggas on the night of their death\nI sat in on niggas baggin' up\nGoin' home inspired the chef\nI tried to make a 'lil money dunn, n buy it myself\nNot knowin' that this drug shit required some help\nI had no where to turn yo, what could I do?\nWhen you gave me your back like \"NIGGA FUCK YOU\"\nNow I see what I couldn't before\nYour nose divin' like that Egypt air\nI put y'all writin' in the Morgue\nIt ain't a line that y'all couldn't absorb\nI makes it clear for y'all\nAnd quickly gets up in your area\nHandle y'all business, let it be known that I know\nFuck tryin' to spread a rumor, the lead's goin' through ya\nYou never grow too old to get your revenge\nWhen it's on than it's on, don't talk, we ain't friends\n\n[Hook]\nAyo, how long did you think you could get away with it?\nDid you think that the bullshit would stay hidden?\nY'all niggas fucked up, by makin' me choose\nYo I use to have love for ya, now I refuse\nTo have anythin' other than hate\nMy brothers fate's in it\nI wonder how the evil got up in us\nYou throw dirt on my name\nAnd when you bleed then you game\nWhen you need, then you came\nNot now we ain't friends\n\n[Verse 2]\nI know niggas that's neutral n niggas that move\nQuick to shoot to do your snitchin'\nStop your twitchin'\nCan't sell no rocks without my permission\nKnuckle heads mean alot of friction\nThe bullshit be none existences\nSo.. if you livin' a lie\nThat means you're welcomed dawg for a limited time\nI don't care who you know\nInterfere with my doe, than I come where you stay\nWe was cool yesterday, but.. now I'm livin' for tomorrow\nA brand new me, I'll move on, never hesitate when you wrong\nCatch me in the crib with one shoe on\nGettin' the mail, nuttin' but bills and coupons\nOver power y'all, I'm too strong, appealin' to kids\nThey gon' crazy in the crib when the juice gon'\nAre you stubborn as me?, is it love?, is it beef?\nDo we all make amends?, if not, we ain't friends\n\n[Hook]\nNow how long did you think you could get away with it?\nDid you think that the bullshit would stay hidden?\nY'all niggas fucked up, by makin' me choose\nYo I use to have love for ya, now I refuse\nTo have anythin' other than hate\nMy brothers fate's in it\nI wonder how the evil got up in us\nYou throw dirt on my name\nAnd when you bleed then you game\nWhen you need, then you came\nNot now we ain't friends\n\n[Hook]\nWe ain't friends.. no more..\nHow'd it end?.. cold war..\nWe ain't close.. like we use to be..\nWe ain't friends.."}], "artist": "Nature"}