{"artist": "360", "songs": [{"album": "Please Be Seated 2 ", "year": "2010-01-01", "title": "Facebook Fiend", "image": "https://images.genius.com/ce0cf5e48473d30e15d0675c37cfb37b.519x391x1.png", "lyrics": "[Intro - spoken]\nHello?\n(Hello, Six, what ya doin'?)\nOh, just Facebook man\n(Yeah, right, what ya doin' tonight?)\nJust Facebook man\n(Um, so, should come out Saturday, it's gonna be sick)\nNah, I got plans ay\n(Yeah, ah, what are you doing?)\nJust probably Facebook man\nHahahahaha\n\n[Verse 1]\nYo, I'm a motherfucking Facebook fiend\nFuck Myspace, it's FB\nSo if you want someone to talk to, befriend me\nYo, I got four-thousand friends but I'm out for more\nAnd I won't stop until I get another thousand more\nI deleted one girl, she had a duck face\nAnd this awkward lean that made me wanna smash and chuck plates\nI had to block this angry nutcase (Why?)\nThat's because your status updates are wack as fuck, mate\nWhy you do that tag?\nIf you tag me in a pic that ain't mine then I'll remove that tag, gone\nIf you know people to add, go and SMS them\n'Cause I find this is the best way to get attention\nI don't care about the clubs and events your sending\nI just care about the friends that you're recommending\nYo, I wanna sit there all day friend requestin'\nAnd if they ask why, I'll blame it on my friend suggestions\n\n[Break 1 - spoken]\n\"Dear Veronica\nThank you for accepting my add\nNo, I don't know you, but you look pretty cute, aye?\nIf you're from Melbourne, I was just wondering if you would like to get together and have a lime milkshake with me one time\nCheers babe\"\n\n[Verse 2]\nYo, I know there's others out there who wanna co-sign this\nNow we lucky that we got it on our mobiles, sick\nYou can see me in some pictures but I don't smile, bitch\nAnd I always give the fingers in my profile pics, yeah\nAnd that's a fact unless I'm taking an ab shot\nAnd I'm a screamer, I'm always writing in caps lock\nAnd I'm a nerd in real life but I'm thuggin' on my laptop\nSo if you wanna fight, I got my gat cocked\nI've got pictures of the bling that I wanna score\nAnd I've got pictures of the rims on my Commodore\nAnd fuck with me and you will see your funeral, blat\nCheck my arms out, Times Roman Numeral tatts\nWhen it comes to hair, I only rock tips\nI got 'em done in year 8 and they've been blonde since\nI know you wanna be motivational, yo, but\nFuck you and your inspirational quotes, bitch\n\n[Break 2 - spoken]\n\"Hey babe, I'm selfish, impatient, a little insecure\nI make mistakes, I'm out of control and at times hard to handle\nBut if you can't handle me at my worst, then you sure as hell don't deserve me at my best.\"\nGet fucked, I do not agree (Hahahaha)\n\n[Verse 3]\nYo, to all my friends out there, yo, I'd like you to know this\nWhether online or offline, I don't like to be poked, kids\nBut now I'm searching just to find me a hoe\nBut you ain't Kylie Minogue, so why you strikin' a pose?\nShit, she's hot, I wanna date that chick\nBut she got emo statuses, I fucking hate that shit (Ah, fuck!)\nAnd let's be honest that's a dumb look, thank you\nAnd all your pics are taken from an upwards angle\nListen, if we can tell you got a huge head now\nAny time you meet a guy then it's a huge let down\nYou're hiding and you'll find that you're lying\nWhile denying it as well, I can tell, so you're lying to yourself\nYo, I know you like to upload pics\nBut we wanna see you smiling from the front though, bitch\nIf there's one thing I learnt off Myspace\nIt's to never have a blind date with a girl who always likes to hide her face\n\n[Outro]\n\"Excuse me, are you Matt?\"\n\"Um, nup, nah, not me babe\""}]}