{"songs": [{"title": "I Got The Baag", "album": null, "year": "2014-08-10", "image": "https://images.genius.com/00d5d64f835f730f567c0cf73cd074f0.500x500x1.jpg", "lyrics": "[Verse 1: Lil Yachty]\nToday's a good day, today is a day I'ma go and get richer\nCodeine demon leavin' yo' bitch with semen, she takin' my picture\nWhen I come around, these niggas get punked, I'm Ashton Kutcher\nSmokin' Swishas, drinkin' lean from the pitcher, my life couldn't get better\nI got the bag, I put the hoes in the back of the Jag'\nI got the lean in the cup, I got the clips in the mag, I got the mag in the MAC\nI bought my mama the Rover, chinchilla sittin' in the shoulder, yeah, you know that it's over\nWrap it up and ship it over\nTurn up bitch, whoo!\n\n[Hook: Lil Yachty]\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the, I got the bag\n\n[Verse 2: Lil Yachty]\nMy bitch, she bad, she poppin' some tags, her ass hella fat, and she couting stacks\nYacht Club my gang, Skeem Team my gang, these hoes got my name, bitch it's Roger Dane\nHow the hell you goin' to fuck with me asking for this but you ain't got that? (Ain't got that!)\nChop my whole brick from a half to a quarter, that bitch move like four flats\nWhite bitch, she cook the smack, give me a million dollars, she goin' to come back\nShe goin' to bring it back, she goin' to bring it back, she goin' to bring it back\nI'm all about my dollars, you attention seeker, you want Twitter followers (Lame nigga)\nWe Goyard, bag, gettin' 'em, bag\nStill keep my stash, still throwin' cash, double a bag\nI remember when he sold the gas like a math\nI'm not no Migo but I beat the pussy like punching bag\nPut cash in the bag, zips in the bag, lean in the bag\nI keep the case in case a nigga want his skull cracked\nMy nigga Ashton told me to tell ya'll niggas he want his swag back\nThey be workin' out the paper bag or the book bag\nWhatever you do, wherever you go, just remember I got the bag\n\n[Hook: Lil Yachty]\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the bag, I got the bag, I got the bag\nI got the bag, I got the, I got the bag\n\n[Outro: Lil Yachty]\nWho got the bag? You got the bag!\nBag? Whoo! Who got the bag?\nWhat? Yeah! Swag! Who got the bag?\nWhat? Yeah! Yuh! What?"}], "artist": "Lil Yachty"}