{"artist": "Vanilla Ice", "songs": [{"title": "The Horny Song", "year": "1998-10-20", "lyrics": "[Verse 1]\nNow that ya feelin it I see you're getting weak\nYou're gettin real close\nYou're reachin that peak\nUh\nYou're like high altitude in a lear jet\nWork them hips like a pistons in a corvette\nSlow down or I'll have to pull ya over\nSearch ya, handcuff ya, and do a move on ya\nYou get a gwb stands for girl with a body pump it like a hottie\nSeems like you got switches and you're hittin em\nTwo wheel motion keep bumpin em\nNow throw it east to west and put a hump in it\nBack stroke, and boogie with a bump in it\nTell me how ya do it like that, how ya got stacked\nHow you scrambled like a quarter back\nI want you weak in the knees and shaking in your pants\nAnd all I wanna do is make you dance\nCome on!\n\n[Chorus]\nHere I come, here I come here I come, here I come here I come, here I come\nHere I come, here I come here I come, here I come here I come, here I come\nHere I come, here I come here I come, here I come\n\n[Verse 2]\nSee the sweat that you're lettin off\nNow, keep it comin girl\nYa know I love it when you take it off\nYou got me sittin in the hot seat\nDrippin from the body heat\nFrom my head to my feet\nWe can do it by candle light all night\nKeep it goin till the sunlight, that's right\nWhatcha tryin to do, make the ice melt?\nDon't you know my cream is good for your health?\nYou know you wanna shake what your mamma gave ya\nYou're getting real hot, now I'm gonna spray ya\nRub it in like lotion\nJuices flowin everywhere\nLike water in the ocean\nYou got that hourglass figure\nUh, All the right moves\nAnd ya know I wanna dig ya\nGot 31 flavors, know what I mean?\nAnd I wanna take a dip in your ice cream\n\n[Chorus]\nHere I come, here I come here I come, here I come here I come, here I come\nHere I come, here I come here I come, here I come here I come, here I come\nHere I come, here I come here I come, here I come\n\n[Verse 3]\nKnow I'll be the one to kick this shit off\nAnd crank it up like a 250\nEngine in a motorcross\nAnd make ya feel it girl\nTill ya get sick with it\nAnd all that junk in your trunk\nDon't be stingy with it\nAnd I'm gonna make it all good like the weekend\nYou got enough for yourself and for all my friends\nAnd it's enough of me to go round like the globe\nSet it up like a tent, watch it unfold\nI see your eyes glistening for the benji's\nBut you ain't gotta fake it\nI just want you to shake it\nBreak me off a piece of that action like jackson\nI ain't trying to hit it\nAnd I ain't trying to wax it\nPicture you and me on the beach and you be\nClimbing up this tall coconut tree\nAll I wanna do is hump with it and make you scream\nAnd eat you up\nAs I floss with your g-string\n\n[Chorus]\nHere I come, here I come here I come, here I come here I come, here I come\nHere I come, here I come here I come, here I come here I come, here I come\nHere I come, here I come here I come, here I come", "album": "Hard to Swallow", "image": "https://images.genius.com/e0d05f3e83ddfbe093566581f485f027.1000x1000x1.jpg"}]}