{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "War Party", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Verse 1: Mike Teeluxe]\nI'm that dope up in your brain with syringes\nComin through, kickin doors off the fuckin hinges\nI'm in this, like forty fiends on seven day binges\nComin with my felony offenders, drinkin Guinness\nThe slender of a never ending back-bender\nMy agenda be the legal tender, blue fox in the winter\nSay it with me, yes, mad style in the streets\nBitches that be blowin up my hip with mad beeps\nMurder me? You musta never fuckin heard of me\nI get thank you letters from emergency for fillin vacancies\nAnd don't even mention surgery, because they awarded me\nFor being the man to do the most abuse to industry\nInjure me, see the evil spirits enter me\nLarry Singletary, now your majesty, an entity (uuhhhh!)\nIf I cut you do you not bleed?\nIf I bust up in her guts, do she not bear seed that resemble me?\n\n[Verse 2: Superstar]\nI hear the sound of dope fiends' screams\nIt's gotta mean somebody's scheme, on the stash again\nI'm spittin hollow points like phlegm\nI'd probably bring a friend but these days\nI'm driftin off into galaxies\nFeel the sea breeze throughout vicinities, eeaaaww!!\nWhile prophecies that kick the sky splits\nOh my God, droppin clips is this the end?\nForever I'll be never injured, because the devil had me shook\nI'm shakin, this evil spirits takin flesh is baking in\n\n[Verse 3: Mike Teeluxe]\nHere's a, special delivery, of the pain and misery\nCan you maintain it? The degrees of temperature can be caused\nI'm the guy that pulls the wool over ya eyes, and move\nAt war speeds, do 45's in the skies, and be\nWhatever y'all call that, that bridges the gap\nAnd in suspended animation and reality rap\nPicture like Kodak, and wax flows clean as Kojak\nAnd you know that, all front row wigs get blown back\nDeacon, comin up the rear with the wicked\nTwo felony convicted, Colin Ferguson\nMurderin, open up your guts kid, what?\nI'm diesel like three fifty, woke up with mad cuts\nAnd don't give a fuck, I snatch the soul out your back\nSo how you figure you could hold your fuckin own?\nYou're a clone, alone in the world, know I tend to be\nOnce a friend of me, now we're known as bitter enemies\n\n[Verse 4: Prince Paul]\nCheck it, check it, we charge up like a nine volt, drama beef\nYou better hold, I pack a 45 Colt with a mad kick\nCause when I lit, the hoes got snitch\nYou better duck quick before you get your shirls knicked split\nI blaze knock this one, it's on it's on, for reals\nSteel pull out, call my bluff, a nigga fate is sealed\nIn a second or a minute I reckon I be in it\nFull-on flanks for high banks, tanks and never, shit all vintage\n\n[Verse 5: Superstar]\nEnough of this S and M\nThem leather wearin bitches whippin men\nFrom a corner of a dead end, I can't forget my dead friends\nAnd that's what makes my brains erratic\nPlus I got a bad habit, of mixin alcohol with automatics\nWho got static? I came to set it off and get this party started\nThose who provoke, is gettin choked, I ain't no fuckin joke\nMy friends won't go anywhere with me, anyone in the vicinitiy\nCharged with conspiracy is getting death by electricity\n\n[Verse 6: Prince Paul]\nNiggas get confused, not knowin what I'mma do\nI sit and wait for niggas to make an ill-advised move\nI save the way that could be from here to there\nBustin shots, some secluded spots you don't know where\nSo where art thou, where art thou?\nTalkin about your dead family members, pal, don't fuck around\nOr for cryin out loud, tellin' you now from Jump Street\nWhoever steps up I'm leavin them bleedin' profusely\n\n[Outro]\nYeah, just keep this shit running, knahmsayin’? Niggas come through frontin'. Frontin'-ass nigga, knahmsayin’? Motherfucking ave' to Long Island and shit, knahmsayin’? Hold ya shit down! Peace to Big Jeru, knahmsayin’? Fuck all them fake-ass niggas, knahmsayin’? Them alienated niggas, knahmsayin’? Hold it down", "year": "1999-02-23"}]}