{"artist": "Wale", "songs": [{"title": "Flat Out", "year": null, "lyrics": "[Intro]\nWe find Clark Kent\nMild mannered reporter for the Daily Planet\nWalking the streets\nFrom when out of nowhere his super hearing picks up...\n\n[Hook x4: Wale]\nWhat's your set 'bout?\nMe and my niggas, we flat out\n\n[Verse 1: Wale]\nTold you niggas, \"Do not fuck with us\"\nHope you niggas do not fuck with us\nYou caught feelings cause I caught her attention\nShe caught a flight after I caught a nut, whoa!\nShoutout to my brothers, doe\nQuote me too\nYou goin' make some haters when you love a ho\nHigher echelon, God bless my soul\nProfit of my infectious flow\nPardon if my vocab ain't good\nBut the school I was in ain't have no books\nThese rap niggas never had me shook\nI am from a town that is ran by crooks\nGet the work from out of town for the money and the power\nNiggas steppin' on the powder like it's athlete foot\nKnow y'all got come get at me first\nLittle nigga better act your worth\nUnderstand niggas got to be heard\nWhy the fuck niggas got to be herbs\n\n[Hook]\n\n[Verse 2: Trinidad James]\nI usually don't do freestyles\nCause my style ain't free, nigga\nFresh from head to toe\nI said fly from the feet up\nI said, you're looking for a real nigga\nBitch, look up and you'll see us\nYou lookin' for your bitch, nigga\nDon't look up, she with Jesus\nI said hallelujah, bitch pop the pussy\nSo she raise her hands and pop the pussy\nI'm with Wale, that's MMG\nAnd that Molly make her go woo\nAnd that money make me show out\nMy grind wasn't planned out\nI'm a real nigga, don't do handouts\nMy mama crib my stashhouse\nIn the Yeezy box, nigga oh Lawd\nNigga Ziploc and my Concords\nTell the Feds I don't give a fuck\nI'm the man now, I'm the man now\nAnd that's D.C. to the A town\nI said D.C. to the A town\nAnd when I flaunt, nigga, that's hands down\nBut in D.C., they say flat out\n\n[Hook]", "album": "Folarin", "image": "https://images.genius.com/be1876382cbca7680e2dc1fd245b7917.600x600x1.jpg"}]}