{"artist": "C-Rayz Walz", "songs": [{"title": "Knowledge", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/d357c7e828546de7ecb57ec880f699c7.600x600x1.jpg", "lyrics": "C-Rayz Walz - “Knowledge”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): Aesop Rock]\n\n[Hook: C-Rayz Walz]\nI don’t\nKnow how I’m supposed to live in the streets.  I don’t\nKnow.  I’m just a local kid from the East.  I don’t\nKnow, but I don’t want to do my thing if I’ll\nBe stuck in the bing.  I don’t know.  I don’t\nKnow how I’m supposed to live in the streets.  I don’t\nKnow.  I’m just a vocal kid from the East.  I don’t\nKnow, but I don’t want to do my thing if I’ll\nBe stuck in the bing.  I don’t know.  I don’t\n\n[Verse 1: C-Rayz Walz]\nIt all started with that metro card—damn!\nWhy my moms ain’t let me use that metro card?  Unlimited\nScars.  What I spit on bars bone-chill.  She said\n“No” to me—what?!?  I just paid the phone bills.  My stone-\n-willed ego screamed, “You broke?  Do a robbery”\nMy guardian said, “You’ll let locked up probably”\nWith anger in my heart, I retorted, “Don’t bother me,” and\nContinued to “Deal in the Now” constantly\nI hopped the train.  Flame on my brain, I see my target\nAvirex leather, platinum chains, fat pockets\nI punched him in his face.  Blood dripped on my cloth, kid\nThinking to myself, I’m like, “Damn, I’m beyond this”\nBut, regardless, I gotta finish what I started\nI drugged him with punches like a knuckle narcotic\nI heard the gun click right before I seen the sparks spit\nThe bullet ricocheted.  I’m like, “Damn, this is a knock home” (Oh shit)\n\n[Hook: C-Rayz Walz]\nI didn’t\nKnow how I’m supposed to live in the streets.  I didn’t\nKnow.  That day, I could have killed police.  I didn’t\nKnow.  Now how I’m supposed to do my thing?  If I’m\nStuck in the bing?  I didn’t know.  I didn’t\nKnow how I’m supposed to live in the streets.  I didn’t\nKnow.  That day, I could have killed police.  I didn’t\nKnow.  Now how I’m supposed to do my thing?  If I’m\nStuck in the bing?  I didn’t know.  I didn’t\n\n[Verse 2: C-Rayz Walz]\nWith a swift arm twist, I let a shot up in his heart kit\nBy mistake, I reacted to a flashback of bondage\nI heard the radio, started my sprint like a runaway\nSlave in a maze.  Because of this, I might be\nUsing the walls to count days/daze—confusion\nLeft me choosing the wrong ways.  I feel\nLike Kunta.  Pounce on my tail, there’s drama, god\nCops chasing me and jails is packed like Amistad.  I don’t\nWanna manifest Allah through bars (Nah) or dress in\nGreen that ain’t fatigue, and I’m used to “Camouflage”\nClaustrophobic, I’ll go crazy in my cell.  Fuck\nRhyming.  I’ll roll acapell in that hell.  Instead\nOf stoges, I’ll ignite my soul and write\nLike Mumia: “Live from Death Row.”  I’ll feel\nLightning blows from nightsticks, a crowd of chokeholds\nBlack boots massage my limbs—ten in a row.  I could\nSee it now: murder-page face, I’ll be famous.  In the\nPrecinct, they beat me like Larry Davis.  The cop\nDied.  I see my moms cry in my mind.  Threw my\nWatch against the wall ‘cause now Amadou/I’ma do time.  I know\nJustice.  The judge ain’t got to speak fate.  Damn\nI should have stayed home and wrote rhymes to that beat tape\nI could have been paid with fame from lyrical flame.  Now I’m\nSlave, using the walls to count days\n\n[Hook: C-Rayz Walz]\nNow I\nKnow everything is real in the streets.  Now I\nKnow.  That day, I killed police.  Now I\nKnow I’m never gonna do my thing, forever\nStuck in the bing.  Now I know.  Now I\nKnow everything is real in the streets.  Now I\nKnow ‘cause, that day, I killed police.  Now I\nKnow I’m never gonna do my thing, forever\nStuck in the bing.  I didn’t know.  Now I\nKnow\n\n[Outro (Overlapped with Verse Adlibs): C-Rayz Walz]\nKnowledge.  Believe (Believe we’re the illest).  Aesop Rock on the track.  Bazooka (Bazooka Tooth your cat).  Minneasota.  Sun Cycle solar"}]}