{"artist": "A$ton Matthews", "songs": [{"title": "BRAZY", "image": "https://images.genius.com/eb16d08d89d3ab44b3c072a3cac4e8d1.1000x591x1.png", "album": "Chapovelli", "lyrics": "[Intro]\nYo Pierre, you wanna come out here?\nAye, You Shmell?!\n\n[Verse 1]\nWe been holding hammers\nSince that Country Grammer\nBandana tied up like Juelz Santana\nTriple couple of that dirty fanta\nThat muddy heavy\nYou gon' need the backup, that F&N gon' eat ya back up\nMy nerves so bad so bitch that heat'll act up\nYa squad full of them clique jumpers and dick suckers\nMy neck, arm, and my wrist flooded, my cliques covered\nThe bricks runnin up the numbers all across the board\nAnd you don't get the picture till the clips is drawn\nCrossroads? We whoop walkin' across those\nSince a snot nose, from concrete my stock rose\nWhole lotta shootas when we squad up\nTalkin' burberry shoes, Big Tymers\nOr I got the hoody with the purple ape\nCup got the purple 8, hit it then I do the race\n\n[Hook]\nBRAZY!\nRunnin through the numbers watch it make 'em go, BRAZY!\nDiamonds always shinin' perfect time to go, BRAZY!\nPull up and we hop out and we make 'em go, BRAZY!\nMake 'em go, BRAZY!\nMake it look, BRAZY!\nRunnin through the numbers watch it make 'em go, BRAZY!\nDiamonds always shinin' perfect time to go, BRAZY!\nPull up and we hop out and we make it look, BRAZY!\nMake 'em go, BRAZY!\nMake it look, BRAZY!\n\n[Verse 2]\nLooney Gangsta Mack 11 what they call me\nCause I be out my mind when I be with the homies\n218 to 223 we let it loose\nNever copped a plea or made a truce, salute B.G. Deuce\nT-Stone and Wicked too\nRockin' till they free the truth\nTalkin' Half Breed, Killa Slim, and that boy Looney Ru\nDo it for the L's, YG's and the OG's\nThats leakin' like a nosebleed, from Ginóbili\nWith no knees, yoppa walkin' like dope feinds\nYou sold dreams, we sold lean\nSo both rings gonna go bling\nYellow diamonds like Yao Ming\nHeard they talkin' pressure I don't feel it\n.44 Drillin, boy we sealin' all them fillings\nPorsha 9-11 with the trunk up in the front\nHop out with the chopper same size as Lil Pump\n\n[Hook]", "year": "2017-10-30"}]}