{"songs": [{"title": "You Have No Idea", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Hook]\nAnd I know and I know and I know and I know\nAnd I know (I know what you like)\nAnd I know and I know and I know\nAnd I know I know what you love\nEverything you like, everything you love (Baby you like)\nEverything you like, everything you love (Baby you love)\nAnd I know and I know and I know and I know\nEverything you like, everything you love (Baby you like)\nEverything you like, everything you love (Baby you love)\nBaby you love Hov\n\n[Verse 1]\nShe wants that old thing back\nShe want those Heroin tracks\nShe likes me\nShe fiends for me nightly\nShe leans for me\nMorning, she rush for my touch\nThis is about lust\nCold sweats occur when I'm not with her\nMy presence is a must- must- must-\nBonita Applebum, I gotta put you on\nIf I didn't when we cutting, the feeling would be too strong\nIn any form, I'm giving you sweet dreams\nThat Sugar Hill, she call me her sweet thing\nThat Black Rain that take away your pain\nJust for one night, baby, take me in vein\nNow that feelin' got you trippin'\nYou don't want to feel no different\nSaid lust has got you itchin'\nNose wide open and it's drippin'\nI know what you like, I am your prescription\nI'm your physician, I'm your addiction\n\n[Hook]\n\n[Verse 2]\nI am so dope\nLike Louboutins with the red bottoms\nYou gotta have 'em, you glad you got 'em\nLike every color Giuseppe's, your guilty pleasure is me\nIt's so much fun, you shun therapy\nAlthough it never be, the feeling is fleeting\nShopping's like coppin', you constantly need it\nI'm never around, you constantly seek it\nYou'll never be down, I know where your peak is\n9 1/2 weeks is better than 12-steps\nI keep tryin' to remind you to keep tellin' yourself\nNow your conscience is interfering, like \"Better yourself!\"\nLike you better get help\nBut when that medicine's felt?\nWe're back together\nDon't ever leave me\nDon't ever let 'em tell you that you'll never need me\nMy China White, 'til we D.O.A\nIts Montega forever, baby, lets get away\n\n[Hook]\n\n[Verse 3]\nHow could you leave me\nI thought that you needed me\nWhen the world got too much and you pleaded with me\nWho helped you immediately\nHow speedy of me\nHow could you deny me so vehemently\nNow your body is shaking, trying to free it of me\nAnd your soul is in control, trying to lead it from me\nAnd your heart no longer pledge allegiance to me\nDamn, I'm missing the days when you needed the D!\n\n[Hook]", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}