{"artist": "Drake", "songs": [{"year": "2016-06-04", "album": "Care Package", "image": "https://images.genius.com/7b9bd58e8d0052cb7fd66ec91bfd1db5.1000x1000x1.png", "title": "4PM in Calabasas", "lyrics": "[Verse]\nYeah\nAll you self-promoters are janky\nWe established like the Yankees\nThis whole fuckin' game thankless\nWe movin' militant but somehow you the one tankin'\nNo limit to where I can take it\nAnd you know me as a Cris' bottle sender, check picker-upper\nI thought we looked out for one another\nSaw us all as brothers in the struggle, too blessed to be humble\nI guess it's different in the city I come from\nAll the sudden I got people showing how much they truly resent me\nThey whole demeanor just spells envy, they tryna tempt me\nThe higher I get, the less they accept me\nEven had the OG's tryna press me, ha-ha-ha, ha\nNo way out 'cause I'm already in it\nI'm not attending when I do a show and get a ticket\nGood business can clean millions, I got the vision\nI been had it since \"No Scrubs\" and \"No Pigeons\"\nEven back when I wasn't as poppin'\nWhen they told me take an R&B nigga on the road\nAnd I told 'em no and drew for Kendrick and Rocky\nI tried to make the right choices with the world watching\n\"Mike never tried to rap like Pac, Pac never tried to sing like Mike\"\nThose my dad's words to me when I asked him how to make it in life\nAnd I always said my mother gave the greatest advice, yeah\nLook at me now, they look at me like the golden child\nCan't nobody hold me down\nEspecially not right now\nCertain shit is just too wild to reconcile\nTake that, take that\nNo love in they heart so they fake that\nDiCaprio level the way they play that\nDamn, nigga, what is that?\nY'all don't hear no songs\nThey hit my phone like, \"You did that\"\nThey even hit my line like, \"Where you been at?\"\nIt's always on some shit like\n\"When can I get a favor?\" or, \"Where my bitch at?\"\nLike I'm about to tell you where she been at\nCosta Careyes, I got her kidnapped\nShe ain't sorry and I ain't sorry, it's too late for sorry\nGreen, white, and red on my body 'cause I'm dipped in Ferrari\nAll she wanna do is get high and listen to PARTY\nShe complain, I tell the driver to drop her at Barneys\nMy summer diet is just Rosé and calamari\nLook, now you got me started\nI'm the black sheep, rest in peace to Chris Farley\nI got a lot to lose 'cause in every situation I'm the bigger artist\nAlways gotta play it smarter\nY'all shook up, I'm here on the cookup\nCameras pointing every time I look up\nThat's why I gotta duck behind Chubb's shoulder just to hit the kush up\nSponsorship dollars is sky high\nHe be like, \"Drake, will you please stop smoking la-la?\"\nChubbs, why try? I'm a thug, I'ma die high\nGot the rose pink tinted lenses, it's a Wednesday\nArchitects takin' dimensions, they redoin' the entrance\nYeah, redoin' the entrance\nKinda like when you niggas drop on some again and again shit\nAnd you still never quite get it\nMeantime, Drizzy over there, tryna make you, make you dance to this\nYeah, I make you dance to this\nI roll big body, wide body, Calabasas road winder\nSun shinin', waxed tires\nSee Kris Jenner, I beep twice and I wave\nThe rest of you boys, I blow Keeks right in your face\nPistol by my bed, I'm sleep, but I'm awake\nFor that one night when niggas try reach inside my safe\nDon't push me 'cause I'm way too uneasy nowadays\nThese guys move so greezy nowadays\nI tell you my life and y'all don't believe me when I say it\nSave my stories for down the line\nI'm too ahead of the curve every time\nJust total the hits and see what you find, you SWV\n'Cause you weak and I'm always, always on your mind\n\n[Outro]\nYeah, and we can't stop\nMake you dance to this, uh\nI'ma make you One Dance to this\nA-ha-ha-ha, ha\nBod breed, bod bwoi\nUh-huh, yeah\nThat's right, yeah"}]}