{"songs": [{"image": "https://images.genius.com/6bb3e1691f3789354cba18fb4b109a8d.640x640x1.jpg", "year": null, "lyrics": "[Hook: Jean Deaux]\nTired of fuckin' around\nThey know its nothing to me\nNiggas is going insane\nCause they know they ain't fuckin' wit me\n\n[Verse 1: Alex Wiley]\nBig gats in the back of the ride\nBig stacks finna rap cause I'm high\nNiggas know that they fooped in the back of they mind\nCause its time right now I'mma capitalize\nThese old niggas mad huh?\nYou still ain't know you jagged huh?\nMad cause I'm swagged up\nUsed to talk down til they got passed up\nMuhfucka who hot as me?\nProdical prodigy, bitch ain't no stoppin' me\nPut words together like fuckin' apostrophes\nMusical odyssey, what is inside of me\nGotta get em out, gotta get em out\nHe don't like it? Nigga fuck dude, sit em down\nAlways talkin bout something he don't know shit about\nFinna kill the game, niggas runnin round\nInnit now\nRidin shotty, ridin shotty\nIt's a private party\nYo bitch is with me, finna ride the pony\nGot the biggest tits, vibrate the phone\nI hit the swisher I hit the bong\nTalkin money, well get along\nGet along\nClassic records I'm sittin on\nI blow they minds then send em home\n\n[Hook]\n\n[Verse 2: Monster Mike]\nI can't stunt I'mma sad dude\nIf someone took your favorite shit from you, you'd be sad too\nIts crazy I been fuckin' with this shit for the past 5\nBut I ain't tryna die and shit, I'm not about that life\nAt least I got rap right? Ain't never been just Mike\nCause when I rhyme the words on these lil beats it be just right\nI'm finna save the world but if I can't then the hoods fine\nAnd niggas hate on me cause they don't know what they look like\nIf you don't really care you gotta fuck wit me\nCause we got that in common, that won't change til I'm in coffin\nEven then it probably wouldn't, other stuff does\nIon know, if you like I rap good\nThen you will probably catch this reference\nI been flexin' on my good and shit\nMonster Mike the optimist, dipped got on that Harden shit\nStill ain't saved a bitch, since I found out how that shit always ends\nPlus ya mans needs all his ends so if you see me with a broad\nI promise I'm not with the broad, I swear she could do all my friends\nSome of 'em did some of 'em, a few of 'em did all of them\nIf you took offense well my bad bitch, I just be talking shit\nThat's when they get to stuntin', but its nothing\nWell its something, cause its funny, I be chuckling\nLooking at them like the Rock and shit\nBut fuck them baby, they ain't got it like this\nLet me see your phone, I'm tryna lock me in\nYou supa raw, I'm eating and\nI'm probably dude you leaving with\nI'm kinda cool, but I'm real real hot\nFuck wit me now, cause on the real I'll be gone\nStill stealing bics, then slam the bitch\nThen pass the bitch, cause my name is Ahmad\nYou know my hands be active and I'm beatin that shit in every since\nI tweaked on my lil fingers cause they asking and I feel that shit\nI think there's different kinds of pain\nJust like there's different kinds of stains\nJust like there's different kinds of gangs\nBut my shit I put on my face\nI'm bout that life, niggas hate\nBut them niggas crazy, they don't rap like Mike\nI wonder how cold I'm finna end up since I write all the time\nI wonder if my crib's on Clark & Lake, since I got all the lines\nI wonder if I'll ever have a kid, yo bitch ate all of mine!\n\n[Hook 2: Monster Mike & Alex Wiley]\nThat's what I like to get into\nHittin' stains, finna make us hit you\nWe don't give a fuck bout shit dude\nCame outta that E-Class\nMy shit ain't no rental\nThat's that whip that I get into\nCan't drive, I hope I don't hit you\nStill don't give no fuck bout shit dude\nCame outta that G5\nMy shit ain't no rental", "title": "Nothing to Me", "album": "Club Wiley"}], "artist": "Alex Wiley"}