{"artist": "PnB Rock", "songs": [{"album": "RNB (Real Nigga Bangaz)", "title": "I Got Me", "image": "https://images.genius.com/bf4848b445a61d23d1d79e4df8832afb.500x500x1.jpg", "lyrics": "[Chorus: PnB Rock]\nGot to get my head right, got to get my bread right\nJust to get my family out these streets\nAin't worryin' 'bout no hoes, I ain't fuckin' with my bros\n'Cause right now I'm like the only one for me, for me, for me\nEverybody all for they self\nBut fuck it, I don't need no help\nI got me\n\n[Verse 1: PnB Chizz]\nI got me, can't no bitch say that\nI ain't on nobody roster, they can't bench me scraps\n'Cause I'm a free agent, no there ain't no salary cap\nI trap the graveyard shift, I stay where vamps lay at\nAll these lost souls fishin' to listen to that new soul tape\nIf you apply pressure I promise you that I won't break\nI seen it at sixteen, told 'em that they was gon' hate\nI was preachin' the future yet wondering what it's gon' take\nBut I get it, I get it, I finally see it y'all\nThey don't have dreams so how they supposed to believe in ours\nI kept on changing my name 'cause I knew my soul was lost\nBut look I found it, ayy let me introduce you to John\nWe gon' make it out Rock, godspeed\nIt's gon' take a lil patience but it's godspeed\nThat's the only person I can say that I need\nAin't nobody else who got me like I got me\n\n[Chorus: PnB Rock]\nGot to get my head right, got to get my bread right\nJust to get my family out these streets\nAin't worryin' 'bout no hoes, I ain't fuckin' with my bros\n'Cause right now I'm like the only one for me, for me, for me\nEverybody all for they self\nBut fuck it, I don't need no help\nI got me\n\n[Verse 2: PnB Rock]\nIt took a while for me just to get it\nLike what my songs ain't good enough? what they ain't fuckin' wit' it?\nI'm just asking for support, what that's too much for niggas?\nThat loyalty word ain't no joke, that shit'll have you trippin'\nLike can you be loyal to niggas that done changed on you?\nAnd do for niggas that won't even do the same for you?\nYou outside while they chilling in the house\nWatching TV on the couch, like fuck it, lettin' it rain on you\nDon't understand niggas, I don't understand\nSpend money on a bitch but you won't spend it on your man, I know\nYeah I get it my nigga, you got a job\nI just find it crazy, smokers pay for my studio time\nYet you always in my sessions screaming, \"Rock, turn up\"\nYou just waiting for a check as soon as Rock blow up\nI wrote this song so you could never say I never told you\nWe're finished turning up, I'm turning over\n\n[Chorus: PnB Rock]\nGot to get my head right, got to get my bread right\nJust to get my family out these streets\nAin't worryin' 'bout no hoes, I ain't fuckin' with my bros\n'Cause right now I'm like the only one for me, for me, for me\nEverybody all for they self\nBut fuck it, I don't need no help\nI got me", "year": "2014-06-25"}]}