{"songs": [{"title": "Come and Catch Me Nigga", "lyrics": "[Intro]\nWussup with it, nigga? (It's how I do things)\nG-Unit South! (You know you fucked up, right?)\nAye yo, fuck tha police!!\nAnd fuck you snitchy azz niggas!!\nYou know whudd it is!! (Matta a fact)\nAye yo nigga! (You know whudd?!)\nSuck my dick!!\n\n[Hook]\nYeah I sell dope, come and catch me nigga (What!!)\nI do it fo' my folks, come and catch me nigga (Yuh!!)\nDamn right I took Glocks, come and catch me nigga (What!!)\nI still won't stop if you catch me, nigga (Let's Goooo!!)\nYeah I sell dope, come and catch me nigga (What!!)\nI do it fo' my folks, come and catch me nigga\nDamn right I took Glocks, come and catch me nigga (What!!)\nI still won't stop if you catch me, nigga (C'monnn!)\n\n[Verse 1: All Star]\nI neva been fronted, if I got it - then I bought it\nNigga, certified hustle-a, neva been caughted (Yuh!)\nTraffican' and trappin' got me stackin' up these bucks\nNigga, I was grindin' hard when Warren Sapp was with +The Bucks+ (Oooooowwhh)\nNigga, we can git it crackin', really I don't give a fuck\nCall Scrap' and cherk Buck Like, \"Let's go hit 'em up!\"\nFrom tha -A- to Cashville, G-Unit, G's up\nAnd we talk to much heat to eva-eva freeze up (Holla!)\nKeep a hammer on my waist, a banana on tha cake\nI'm just happy to see 21 candals on tha cake\nAnd if I'm eva down bad, it's a bandana on my face\nI'll stomp bitch, I don't give a damn 'bout a case (Fuck!)\n\n[Hook]\n\n[Verse 2: Lil Scrappy]\nYo.. (Aye..)\nSee, I don't give a fuck if he know, you know\nI'll smoke-a blunt in front of tha police like it's legal (C'mon!!)\nStand on tha squad car screaming \"Fuck tha people!\"\nMan dem niggas hear me, then can git it like we do (Yeeaaah!!)\nPerp for tha low, peel fo' you roll\nGotta go and hustle, cause my pokets on low\nGot a couplah niggas dat's gon' flip em O's\nIt was born in my blood, I'm gon pimp em ho's (Fo' Sho'!!)\nWhen you see me in tha street, yeah I did it fo' tha struggle ho'\nNow on my time, I'm gon' do it fo' my daughter tho\nEven if I have to rob and lay a nigga on tha flo' (Aye, Aye)\nYou don't want no problems - just gimme what I came fo' (G-Uniit!!)\n\n[Hook]\n\n[Verse 3: Young Buck]\nPosted up, on dis corna like whateva\nMy chin-chilla covas, on my G-Unit sweata (Yeah!!)\nOn Tuesdays and Thursdays they say tha vikes rollin'\nWe see 'em ride by, but we act like we don't know 'em\nThey know they we ain't gone, see dis is our hood (What!!)\nWe wear these bandanas, not cause they look good (Fo' Real!)\nLet's do dis fo' big took it, them niggas in the pen\nTha ones dat won't neva see these fuckin' streets again (Yeaaah!!)\nSo fuck tha D.E.A. and fuck tha F.B.I\nWe traffican' dis shit, up until tha day we die (Bu-bu-bu-buck!)\nSome say I'm out my mind, I say I'm about my grind (What!!)\nDat's why when I tell 'em I bought a phantom\nThey know dat I ain't lyin' (Aye!!)\n\n[Hook]\n\n[Outro]\nNiggas know whudd it is!\nStraight up, on some real shiit, haha\nI got public service work to do, haha\nYeahh!!!\nAye yo 50!!\nAye yo nigga!\nYou told me what dem {?} gon' do\nNow I see watchu mean\nFuck tha police!!\nHaha..\nYeah nigga, G-Unit South!!\nYeo!!", "album": "Case Dismissed – The Introduction of G-Unit South", "year": null, "image": "https://images.genius.com/f00eb6127863d56bf973226fdb122cbc.360x360x1.jpg"}], "artist": "Young Buck"}