{"songs": [{"title": "Can I Party?", "lyrics": "Heh whassup?\nHere we go, here we go, here we go\nOne two for the money\nOr the show then three for the S-E\nHah hah, whassup?\nIt's Ahmad, my man Mau' made the track\n\n[Ahmad]\nWell it's the niggerole, pump one more time\nThe jeeps I rock will never stop playin for keeps\nAnd got more soul than a ghost I have mostly EVERYBODY UP\nThe masses movin asses so let the beat hit\nAnd it ain't gon' quit 'til you stop and say (no)\nCause I get more (ho!) than +Hip-Hop Hooray+\nI rock steady, steady rocks don't wanna box with God\nBecause I'm cool, givin props to the old school\nAnd the West coast, who just toasted the return\nOf the funk with the fat beats for your trunk (so)\nI walk and I stalk and I caulk(?) and I blast\nThen I dip to the party, find me a honey and tag that ass\nI saw a Puerto Rican freak who was all that\nTight pants for dancin, told her we gotta lambada\nNo restin yet black, cause here I am\nAskin the question - can I party if I need to jam?\n\n[Hook - repeat 2X]\nSo can I party if I want to? (Yeah you can party)\nNow can I party if I need to? (Yeah you can party)\nCan I party if it's essential and necessary\nI'm addicted, I gotta have it, then I gotta have it (Say what?)\n\n[Ahmad]\nIt's the return of the incredible man\nWho stands firm and rips up fakes without a cape\nI'm great, I paid dues, kid how dare you respect me not\nI had to get a tetanus shot cause fools bit but\nNow I'm back on deck, ready to wreck\nAnd swing at every pitch til I'm rich (whoo!)\nAnd that's not long because I got a new song to sing\nThrone the king cause all the fools just stepped loose (ooh)\nBack to the party at hand, I want you movin and groovin\nWorkin that ass, havin a blast\nI'm fast on the feel so pass the pill\nTo the kid that rocks, everybody jockin stop then\nThrow your hands up and wave 'em from left to right\nIf you like the niggarole say (HO!)\nBut you know, no restin yet, cause here I am\nAskin the question - can I party if I need to jam?\n\n[Hook]\n\n[Ahmad]\nKick it what did I say? (Get up!) Think you better (get up!)\nPart efficient in circumfrence and if you don't jump\nTouch the ceiling with the center of your palm, use your right arm\nEverybody standin, should love my sound cause it's too down\nOr three, might be four, fifty-six, maybe one more\nTo blow, might I flow, can I go, I'm that one so\nBumrush the doors, keep the doors locked\nAll I need's a small flock of fans, hands move to the bam-boom\nOf the bass drum, when you hear the thump of the bass\nJump while you're actin dumb, yell where you come from\n(West coast) with the new soul scenario\n(Just fo') us to control your stereo\nAhmad I flip and rip kids and crews to shreds\nMau' will lay a beat down like the Feds\nI guess all should say yes y'all cause here I am\nAskin the question - can I party if I need to jam?\n\n[Hook]\n\n[Ahmad]\nWhassup? That's Ahmad and the Joneses\nWe on this mic, for the ninety-three, to the ninety-four\nAnd more", "year": null, "album": "Ahmad", "image": "https://images.genius.com/3d85c954b2ab0c9abe8f9fc12381fbd7.600x600x1.jpg"}], "artist": "Ahmad"}