{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/e666c521a29bb479f86359b7a43a462f.500x500x1.png", "title": "Outlaw", "lyrics": "[Intro]\nOutlaw: we lawless\nWe ballin' out, nigga, regardless\nEverything VVS, we flawless\nWhen I stunt, I stunt on niggas the hardest\n\n[Verse 1]\nIf niggas so hot, why they ain't got what I got?\nMy Maybach, my watch, my Hublot\nMy fat knots, my swag is top-notch\nMy crack spots bring cash in non-stop\nMy nigga Rock just came home from Comstock\nI got shooters, they ain't got what I got\nGot shit locked, I stunt non-stop\nI get it and I blow it how I want, why not?\nMy bitch cold, I mean hot, sure shot\nCome through in the drop, hold the Glock, why not?\n9 millimeter, 9 shots, big rock\n9 carat stones, I'm in my own zone\n\n[Hook]\nOutlaw, yeah yeah, we lawless\nWe balling out, yeah, regardless\nVVS yeah yeah, we flawless\nYou do what you gotta do, we do what we wanna do\n\n[Verse 2]\nYou wan' get shot? Go ‘head, run up in my spot\nMy lawyers will have me out by 1 o'clock\nGo 'head, get dropped trying to take what I got\nMy diamonds twinkle over my Azad\nMy gun pop, tell me why would you try that?\nPorsche Turbo, Cayenne I'll buy that\nG5 jet, pilot, I'll fly that\nBurn good shit, get as high as I get\nMy mind's sick, I'm criminal-minded\nShorty's ass fat: I want to bump and grind that\nGroupie love bitch, your left breast? I'll sign that\nI'm CEO ho, you ain't know?\n\n[Hook]\n\n[Verse 3]\nNew York party of the year: my spot\nThese bitches look so good: oh my God\nLooking at the man in the mirror, I'm so hot\nShorty want to cut, cool, make sure the door's locked\nOff with the Gucci, down go my Louis\nOut come my oo-wee, do me, baby do me!\nLike a pornstar took ya to my spot\nMy bed rock back and forth when I'm on top\nMy backshots they are sorta like crack rocks\nI give it all I got, non-stop 'til sweat drop\nI damage I wreck shop, I come through correct, I\nI give her what she need 'til it's hard to breathe\n\n[Hook]", "year": "2011-07-19"}]}