{"artist": "E-40", "songs": [{"title": "Captain Save a Hoe (Remix)", "image": "https://images.genius.com/321a53b5f52d1286845da5f7b8831a9b.700x700x1.jpg", "album": "The Mail Man", "year": "1993-09-23", "lyrics": "[Hook]\nAh is a, Ah is a\nShould I save her (I wanna be saved)\nAh is a, Ah is a\nShould I save her (I wanna be saved)\nAh is a, Ah is a\nShould I save her (I wanna be saved)\n\n[B-Legit]\nIt's 1994 and fools need to miss me be savin' these foes\nYou know how these tricks be, be buyin' em' clothes\nWanna taxi those on vogues with the beat\nAnd have em' sittin' next to em' in the front seat\nBut not B see I'm a hog up out the V\nAnd my motto is bust a batch and hit the throttle\nTo the smoke talkin' on my Okie doe\nWorld wide I got a clydes up in Tokoyo\n\n[E-40]\nLook up in the sky it's a bird it's a plane\nWhat's that fool name? (Captain save a ho main)\nMore faster than a speeding bullet\nTo put on his cape and scared\nI put the fake the fake the funk the funk\nTo me that's not the way to do it\nCaptain mutha-f em' Save a soul came to me\nFlexin' just like a little ol' batch\nAll up in front of my company\nHad to check him fast with an ear check dump and pumpin'\nTalkin' to him while I'm beatin' him down\nPumpin' fear talkin' bout partner you gone retrospect something here\n\n[Hook]\n\n[D-Shot]\nMr. Super-Snitch, Mr. Super-Trick\nYeah, you wanna kill me cause I tossed ya chick\nYou should had your cape on tight that night\nCause a brother like the Shot sho plugs em' right\nAnd now yo batch is straight callin me lovin me\nOn the under for the porno star that I be\nAnd don't you come in my face with that trick shhh\nYa betta try some more shhh\n\n[E-40]\nI got the gift to grab any batch\nThat I want but I don't\nCause batches now a days will get you caught up in some funk\nOh no, I'm not tryin' to save you girls 'n\nHow come when I was broke you wasn't brown nosin'?\nThe other day you see me smobbin' down magazine\nWith some ol' sucker in your car lookin' at me mean\nI stopped in the middle of the street\nReached under seat to grab my heat\nMan that's the same ol' buster\nThat I got into it with at the club last week\n\n[B-Legit]\nMan them suckers can't fade\nThey batch made\nAnd so they start\nBut suckers with no heart\nDon't want no part to this\nFool rollin' with the Funk Mobb\nAnd when it's funk\nThe pump will spit them double laws\nSo what you doin' when we roll through you hideout\nI let my mack get off and then I rides out\nWith your ass there smokin' like a dope fiend\nYou savin em' man and that's batch thang\n\n[Hook]\n\n[Suga-T]\nI'm lovin' tricks when I'm pimpin'\nAnd even snitches just for my riches\nCaptain Save Me, it's all good if ya slippin'\nIt's all good as long as ya payin' yeah\nIt ain't my fault if you get sprung off my land\nI'm takin' GA checks, go to the bank Hank\nIf ya comin' faulty, you get ganked main\nLong as a trick comes fallin' down\nThat gets me all upset to put on my suit and clown\n\n[E-40]\nBut make that man take care your kids\nMake that fella call your kids his\nMake that mark get out there and work\nMake him fool buy you a Brinun Burk\nIt's all part of that sucker take care of me\nCrevice whipped fool come save me\nBatches out there be on the look out\nFor Captain save em' though\nCause he's savin though\n\n[Hook]\n\n[Captain Save a Ho]\nHa ha\nYeah baby, what's up you wanna get your hair done\nCome on let's go down to Lee and Kim Nail's\nWe can get your nails done, get your hair done\nWhat about your kids? How many kids you got? Two?\nAh, yeah that's cool we can go feed and cloth them kids\nWe can go down and get the hook up at Durant Square\nYeah baby I do anything for ya\nWant you phone cranked on, I can get it cranked on to my name\nMatter of fact I get you a cellular phone and a pager\nWe can get that package deal down there at Cellular One\nBaby I'm here for you I got you"}]}