{"songs": [{"lyrics": "* a different version than all previous releases\n\n[Intro: DJ Yella]\nEvery motherfucker always asks: how did N.W.A. get started!!\nWe don't know how it got started\nFuck that question, you know what I'm saying?\nIt's the same bullshit over and over\nHow did we get started?\nHow did we first meet?\n\n[MC Ren]\nPrisoner like a hostage\nYo, you should've covered your motherfucking head like an ostrich\nDeep in the dirt cause you was a sucker\nAnd your ass up high so I can kick the motherfucker\nDon't try to hang, you best avoid it\nCause my foot will be so far up your ass, you'll get hemrroids\nBefore you try to fuck with Ren\nI'll put two in your ass and you'll be shitting the size 10\n\n[Dr. Dre]\nFirst come, first serve, whoever's got the nerve\nStep up and get what you deserve\nFrom the world of the motherfucking Hip-Hop maniac\nBrainiac, so what you ought to do is step the fuck back\nBut how the fuck you think your rap would last?\nWith your ass saying shit that is said in the past\nYo, be original, your shit is sloppy\nGet off the dick, you motherfucking carbon copy\n\n[MC Ren]\nFalling deep in the drums for many of styles\nIs one of the reasons a nigga ran the hundred miles\nCheating and not beating, the crowd are kept seating\nBut weak motherfuckers biting off and they kept eating\nStyles that kept them full of bull\nCause the vocals were local in nightclubs and not getting paid in full\nAnd got the nerve to cuss\nOnly reason niggas pick up your record is cause they thought it was us\n\n[Dr. Dre]\nYo, giving what I gotta give, doing what I gotta do\nYou don't care for me, so who gives a fuck about you?\nYou can't harm me, alarm me\nCause we're the generals in this fucking Hip-Hop army\nThe niggas with attitudes, if you didn't know\nWe blow, flow and then move slow from the get Go\nYo, tie us to take it\nYo, fuck this shit, Yella, kick the break in\n\n[Chorus: Eazy-E]\nIt's the real thing\nYou are now   ----] Dr. Dre\nReal, real niggas, niggas\n\n[MC Ren]\nYou can run but you can't hide, you know I'm a find you\nCause a nigga like Ren, is only two steps behind you\nDon't look back, because you're shaking and all scared\nA nigga in black, can be your scariest nightmare\nSo sleep with the lights on, forget that the Mic's on\nDon't step on my motherfucking stage without Nike's on\nDon't say it's psycho, and then you just might go\nMentally fucked up, when I let the right blow\n\n[Dr. Dre]\nAll these niggas with the gibber gabber\nBut couldn't kill a fly with a motherfucking sledge hammer\nGangsters in black are out there\nBut only because, yo, it's the shit that we wear\nOn my motherfucking dick\nBut I'ma love it when you drop like a motherfucking brick\nSo, yo, step off, go to bed, cause if you're mislead\nYou'll get a motherfucking bullet in your forehead\n\n[Eazy-E]\nBlack, the good, the bad, the ugly, you see\nA little street wise nigga, you know me\nRolling with some real niggas playing for keeps\nBut you motherfuckers know who run the streets\nWith that hardcore Hip-Hop rap shit\n[MC Ren] Now how much harder can another nigga get?\nTrying to be like us, sound like us, dress like us\n[MC Ren] Ashes to ashes and dust to dust\nSo nigga, nigga, nigga, nigga, nigga, nigga, please\nSince you're on the dick, why don't you drop to your knees?\nCause I'm the motherfucker that's out to kill\nEazy-E, a nigga that's real\n\n(Timed bomb count down*)\n\n[Break: DJ Yella]\nReal niggas, straight off the streets of Compton\nQuick to get in your shit without a second thought\nAnd if your ass get smoked, it's my bullet you caught\nSo if you're talking shit about the niggas in black (*Explosion*)\nBow down to the King's and Raider hats\n\n[MC Ren]\nThey played out, that's what niggas were chanting\nOne nigga left and they said: we ain't happening\nPeople had thought, we was finished and then done wit\nBut if you think about it, yo, we really ain't done shit\nYet, so cover your ears and wipe your tears\nAnd quit sniffing all over my dick for new ideas\nAnd when the new record comes, I'll come like a fucking bump\nAsking for fucking money, don't buy you a fucking crumb\nYou're on the dicks of four niggas not one\nAnd when it comes to dicks, you don't even have one\nSo brace yourself to make sure you don't get fucked up\nBecause if I let you slide, it's just cause you lucked up\nDon't come in my face again, because I'm a floor you\nAnd if you're a bitch, I'ma fucking ignore you\nBecause my attitude is a little bigger\nCause MC Ren is one of the Real Niggas\n\n[Dr. Dre]\nLost in a motherfucking world of madness\nSadness, but Dre is just a nigga that gladdest\nSucking motherfuckers like you, making whack jams\nBecause it only shows you how dope I am\nNever try to ignore us\nWhen I'm expressing, standstill like you're full of Rigor Mortis\nCause I'm a real nigga, but I guess you figure\nYou can break me, take me, but watch me pull the trigger\nDre is just a nigga with heart, a nigga that's smart\nA nigga that's paid; to say what others are scared to play\nWe started out with too much cargo\nSo I'm glad we got rid of Benedict Arnold\nYo, N.W.A., criticized for what we say\nBut I'ma do the shit anyway\nCause I'm the motherfucking doctor, never faking\nYo, Yella, kick the motherfucking break in\n\n[Chorus: Eazy-E]\nIt's the real thing\nYou are now   ----] Dr. Dre\nReal, real niggas, niggas\nYeah, motherfucker, it's the real thing\nYou are now   ----] Dr. Dre\nReal, real niggas, niggas\n\n[Hook: MC Ren w/ echoes]\nN.W.A. - Straight Outta motherfucking Compton\nTaking over shit in all of the 1990s\nYo, Dr. Dre, DJ Yella, Eazy-E and I am MC Ren\nYo, N.W.A. taking over this motherfucker y'all", "album": "N.W.A. Greatest Hits", "year": null, "title": "Real Niggaz (New Version)", "image": "https://images.genius.com/9d0ba3a690d9816750a7d66f86166147.500x500x1.jpg"}], "artist": "N.W.A"}