{"songs": [{"title": "Hands High", "album": null, "year": null, "image": "https://images.genius.com/4f46b6795366f3b178634d24ee378b0f.400x400x1.jpg", "lyrics": "Here we go with another one\nIt'll keep you hot when the Summer comes\nBut then it's over when the Summer's gone\nBut we gotta represent Him, dog, then the Son will come\nNo, we ain't slaves no more\nWe don't follow our sinful ways no more, we don't see a purple haze no more, them ways no more, them days no more\nFolks lookin' at me like I'm crazy\nYep, that's my name, that's the way God made me\nGet the Word out and don't be a spiritual baby\nThen open the Book and you'll be growin' a daily\n(Beyond Belief!)\n\nYeah, get 'cha hands up high\nGet 'em in the air, try ta touch that sky\nYall know we gon' rep the Most High\nYeah, we gon' rep the Most High\nGet 'cho hands down low\nGet 'em down there try ta touch that floor\nYall know that's the way to --\nYeah ya know that's the way to --\n\nYeah, I hope this works\nThere's more to life in Christ than just shirts\nGod made Adam and breathed him from the dirt\nThen he sinned and had fall under the curse\nBut you think you got it to get it you gotta live it dog, you gotta read it, believe it, and go and get it dog\n\nBut I've never seen a lazy boy grow\nThough I know a couple of 'em\nWho be sayin' that they love Him\nBut they never really get out there and go, so\nBack to the fact that we ask to relax\nAnd say, \"Hey, I'm saved, no need for me to act!\"\nInstead of growin' in Christ and learnin' to reinact, the lifestyle He lived, now homie, you seein' that?\n\nYeah, get 'cha hands up high\nGet 'em in the air, try ta touch that sky\nYall know we gon' rep the Most High\nYeah, we gon' rep the Most High\nGet 'cho hands down low\nGet 'em down there try ta touch that floor\nYall know that's the way to --\nYeah ya know that's the way to --\n\nHey Ed, it's yo birthday, move to the left\nIt's yo birthday move to the right\nIt's yo birthday but you gotta throw some more so get thirsty!\nIt's yo birthday but you gotta throw some more so get thirsty!\n\nYeah, get 'cha hands up high\nGet 'em in the air, try ta touch that sky\nYall know we gon' rep the Most High\nYeah, we gon' rep the Most High\nGet 'cho hands down low\nGet 'em down there try ta touch that floor\nYall know that's the way to --\nYeah ya know that's the way to --"}], "artist": "Lecrae"}