{"songs": [{"title": "Always On Time", "album": null, "year": "2016-02-14", "image": "https://images.genius.com/c5bbc3916042c0e6cf318283e03b017a.500x500x1.jpg", "lyrics": "[Intro: A Boogie]\nOnly time I'm feeling fine is when I'm with my\nOnly time I'm feeling fine is when I'm with my bitch\n\n[Chorus: A Boogie]\nWe ride together, we ride together, be honest\nThe only time I'm feeling fine is when I'm with my bitch\nAnd she always on time forever\nThat's why she my ride or die\nShe hate it when I call her my bitch but she mine forever\nAnd whenever the time is, I make time whenever regardless\nShe always on time, my nigga, regardless\nShe always on time, that's why I\n\n[Verse 1: A Boogie]\nWrote you cause I just wanted to see you\nPull up on me, girl, I wanna eat you\nNah, nah I'm playin', don't really need you\nOnce you turn into someone they wanna be you\nI grew up bumpin' Cassidy and Beanie Siegel\nWatchin' crack heads squeeze up on that needle\nI said I'm sorry for makin' you feel I need you\nLove hoes, windows, bitch you see through\nSmokin' endo outdoors with my people\nI don't eat cheese, my nigga, no that's illegal\nI don't like dogs who fuck with you when they need you\nY'all are not low, my nigga, already peeped you\nI do not know you, don't say wassup to me\nWhen I needed it, you didn't show no love to me\nDon't want no company\nFuck you, fuck you, aha!\n\n[Chorus: A Boogie]\nWe ride together, we ride together, be honest\nThe only time I'm feeling fine is when I'm with my bitch\nAnd she always on time forever\nThat's why she my ride or die\nShe hate it when I call her my bitch but she mine forever\nAnd whenever the time is, I make time whenever regardless\nShe always on time, my nigga, regardless\nShe always on time, that's why I\n\n[Verse 2: Snoopy Dinero]\nLove her to death, give her nothin' to stress\nFocused on when I'm strokin', she feel it all in her chest, ah!\nPussy so wet, kissin' up on her neck\nWanna scream my name, she keep it under her breath, ah!\nAh! I'm still the same, my nigga\nMy niggas, we still ridin' with the thang, my nigga\nMy niggas, we get that money, never change, my nigga\nMy niggas will never switch up for no fame, my nigga like...\nStackin' to the ceilin'\nAnd when you all alone and you all up in your feelings\nYou can listen to this, thug nigga who just missin' a bitch\nI take your hoe by the flick of the wrist\nAnd she like to call me by my government\nCause it make her feel special\nHit that thing raw just to make her feel special\nSeveral phone calls just to make her feel special\nDo that think I like cause you know I still let you, ah!\n\n[Chorus]\nWe ride together, we ride together, be honest\nThe only time I'm feeling fine is when I'm with my bitch\nAnd she always on time forever\nThat's why she my ride or die\nShe hate it when I call her my bitch but she mine forever\nAnd whenever the time is, I make time whenever regardless\nShe always on time, my nigga, regardless\nShe always on time, that's why I\n\n[Verse 3: A-Boogie]\nAh! Girl pull up on me\nYou know I wanna know if you could pull up on me\nCan I put it in your spine while you kissin' on me?\nMatter of fact, never mind, that's a different story\nI be playin', girl you know how I play with you\nCan I, pull up to your crib? Girl I just wanna lay with you\nI show you how I live, I don't wanna be fake with you\nCause I know how it feels for someone to be fake with you\nAnd I'm feelin' you, and I know it's killin' you\nYou don't wanna say it, but you feelin' me too\nDon't worry 'bout them niggas and don't worry 'bout them bitches\nBaby we don't gotta tell nobody shit that we do, that we do\nAnd that's just how it's 'posed to be\nYou got your girls with you, I got my woes with me\nAnd I could tell you want me by how you approachin' me\nI will show nobody nothin' that you show with me cause\n\n[Outro: A Boogie]\nWe ride together, we ride together, be honest\nThe only time I'm feelin' fine is when I'm with my bitch\nAnd she always on time forever\nThat's why she my ride or die\nShe hate it when I call her my bitch, but she mine forever\nAnd whenever the time is, I make time whenever\nRegardless, regardless, that's why I...ne Forever\nAnd Whenever The Time Is I Make Time Whenever\nRegardless, Regardless, That's Why I !"}], "artist": "A Boogie Wit da Hoodie"}