{"songs": [{"lyrics": "[Intro]\nIn a rage, got some bands\nI'm that bitch! with my mans\nGang gang\nGang gang\n\n[Chorus]\nAnd I rage!\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out swag glaze\nBitches on my dick like a slave\nYeah I been the shit grade A\nI can't lose cause I rage\n\n[Verse 1]\nYour nigga blew my pussy call him mace\nWent and got some money never changed\nSince I got some fame they amazed\nWhatever happened to these bitches?\nThey turned snake\nThink I put you on bitch you fake\nYour giving dome asking niggas for a steak\nWe get our own all these niggas want a plate\nMy niggas killers give a fuck they beat the case\nReal bitch got to time out\nIf I see it I'ma want it I'ma ball out\nEight niggas want my time like call out\nHair so good make a bitch want to fall out\nI ain't ever gonna stress bout no hoe\nLike broke hoe, Asian want all them crows\nYoung nigga how you figure when I figured I be tripping keep them birds in the kitchen washing dishes\n\n[Chorus]\nAnd I rage!\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out and I rage\n(And I rage!)\nBitch I hop out swag glaze\nBitches on my dick like a slave\nYeah I been the shit grade A\nI can't lose cause I rage\n\n[Verse 2]\nIf you want a verse I'ma need them bands\nYeah you want a top put it in my pants\nYeah these bitches they my sons they my kids\nI got ninety babies these bitches ain't shit\nAye I called my brother I told him that we on\nYeah I called my cousin put him on a song\nAye at seventeen I put some bitches on\nAnd they changed on me now I'm rich alone\nAye if you talking shit I'ma fucking rage\nAK forty seven it's gon' spray\nShoot a nigga block with my K\nI called my lawyer on my nigga beat my case", "album": "Project Princess Vol. 1", "year": "2016-09-25", "title": "Rage", "image": "https://images.genius.com/89cf00a43983749125eda2c372d01f56.500x500x1.jpg"}], "artist": "Asian Da Brat"}