{"artist": "Big Boi", "songs": [{"lyrics": "Now get the fuck up off me nigga..\n\n[Big Boi]\nAs I, struggle to keep my balance and composure\nI'm 'posed ta, propose a toast to players on every coast-a\nThe lyrical roller coaster, mind-bender\n'Stead of watchin these sucker MC's\nI'm seein just how they lyin to the general population\nDon't be patient, get up and stand up for your life\nDon't you agree or understand we lost some rights at 1-1-9?\nCome dumb, come young, come blind unwind confined\nTo the situation, we facin, cause in time, tick tick boom\n\n[Hook: Myrna \"Peaches\" Crenshaw]\nTick, boom.. tick, tick-boom\nTick, boom.. tick, tick-boom\nTick, boom.. tick, tick-boom\nTick, boom.. tick, tick-boom\n\n{*explosion* forward and reversed}\n{*scratched: \"You're gonna die here\"* - 2X}\n\n[Big Boi]\nWhen will we all, awake up out this dream\nCome here and smell the Folgers, the soldiers are human beings\nMan actin as if he was the supreme bein\nClockin the souls of men out like he was G-O-D and\nW-A-Rrah, there'll be no tomorrow but sorrow\nAnd horror will follow the hollow hearts battle for dollars\nPoliticians, modern day magicians\nPhysicians of death, more health care for poor health\nWho makin us ill, they makin us kill\nThat's makin me spill my guts (chill Big, lay in the cut)\nFor what? I refuse to sit in the backseat and get handled\nLike I do nuttin all day but sit around watch the Cartoon Channel\nI rap about, the Presidential election and the scandal\nThat followed, and we all watched the nation, as it swallowed\nAnd chalked it up, basically America you got FUCKED\nThe media shucked and jived now we stuck - damn!\n\n{*singing - can't be heard clearly*}\n{*scratched: \"You're gonna die here\"* - 2X}\n\n[Big Boi]\nOperation Anaconda - ask yourself\nWas it full of bleeps and blunders, did they ever find Osama?\nAnd why in the fuck did Daniel Pearl have to pay the price\nFor his life and his wife plead twice?\nSee Al-Amin got life and Fred got dead, Hampton\nTo dampen the dream of all the Panthers\nThey got they answer for ransom\nAs we read together, as we dream together\nCount your blessings whenever you feel that things won't be no better\nBut it got to, you gave me this microphone so I must rock you\nYour brainwaves, airwaves, energized and SHOCKED you\nY'all got me, well I got y'all, long as I know y'all listenin\nI'mma always bring food for thought to the table in the kitchen\nNow eat nigga!", "image": "https://images.genius.com/547d6239cd014bda1acb0078d0ddaafc.999x999x1.jpg", "year": "2003-09-23", "title": "War", "album": "Speakerboxxx"}]}