{"artist": "Problem", "songs": [{"album": "O.T. (Outta Town)", "title": "No Way", "image": "https://images.genius.com/bfccd56b50a159db23155c1829c2b5ab.500x500x1.jpg", "lyrics": "[Chorus:]\n(Just be yourself)\nTrying to make a million on rap and no cake\nBoy came up and nigga checking no fake\nIf you open that package every  second all day\nWhole world no play, No sleep, no way\nNo way, no way, no way, no way [x4]\n\n[Verse 1:]\nStart getting money, are you crazy\nCornerstar, so you say\nA sad note to my side line, know your place\nQuit the shoot, cause I got all, count your ways\nBrought your best new boosts, no way\nFell in love with smute, no way\nGot your pick and loose, four ways ok\nDon’t play, go soft, no way\nFour days I have been on no sleep, ok\nDon’t try and keep it on me\nTaking  break, I got cheese on the whey\nThrow me the key to the safe\nCause am\n\n[Chorus:]\nTrying to make a million on rap and no cake\nBoy came up and nigga checking no fake\nIf you open that package every  second all day\nWhole world no play, No sleep, no way\nNo way, no way, no way, no way [x4]\n\n[Verse 2:]\nWhat! No way\nQuick the dip in for my chips\nNo free, no lace\nStay bent like your bitch if she live with me\nSquad with the bullshit, like they were born in May\nWhat? You full of toys with a cracker boys in it from the side eye\nBaller too hard to hit eight from the sideline\nEvery time I look at my clock it saying grind time\nMolly got my mind fired, bill it like a nine five\nRally this mother fuck, What?\nRally this mother fuck, yeah\nMy niggas make it rain, we’ll drown the mother fuck man\nRinging like a dial tone, swagger on the dial zone\nPussy hurricane and blowing home\n\n[Chorus]\n\n[Verse 3:]\nIf am hurting nigga i'm feeling no effect baby (ok)\nEven all of the money in the world don't make sense baby (no)\nHe left your girl with me, so now your bitch taken\nI got you in all these picture, making all these faces, smiling crazy\nBrought your best new boosts, no way\nFell in love with smute, no way\nI’m riding it cool, for days, those  days\nDrop tops, so they say I’m straight (I'm straight)\nRap...rapping paid off fool\nAin't paying off no day\nAm praying and praying it’s coming from my soul\nSo I state this hill as my goal\n\n[Chorus]", "year": null}]}