{"songs": [{"image": "https://images.genius.com/a47da8bd79cb73aa52f09bd933f5f5f9.1000x1000x1.jpg", "title": "First Date", "album": "Cool Patrol", "year": "2018-08-10", "lyrics": "[Verse 1]\nHey pretty lady, you're looking real fine\nThis is our first date: I'm not like other guys\nI can tell that you have played it safe your whole life\nSo let's get naughty and break a couple rules tonight!\n\nSneak in a movie, no one will ever know\nThen run on private property and hold each other close\nBeneath the moonlight, I've got a fun idea:\nLean in and kiss your cheek and gently whisper in your ear—\n\n[Chorus]\nLet's steal a car tonight\nCommit a felony with me and drive until the sunrise\nLet's steal a motherfucking car tonight\nWe're young and alive\nSo let's commit some crimes\n(Hey, I like you!)\n\n[Verse 2]\nI got you flowers. Let's get some coffee\nLook deep in my eyes and tell me 'bout your family\nWe can hold hands, then you can watch me\nShoot cocaine into my eyes and rock a burglary\n\n[Chorus]\nLet's steal some art tonight\nWhat's a few Picassos when you're on a sexy date heist?\nLet's steal some precious fucking art tonight\nWe're young and alive\nWe're crossing state lines\n\n[Spoken Bridge]\nOr, you know, we could go a little more traditional: go for a walk, watch a movie. Actually, there's a really nice flower exhibit at the botanical gardens! Ninja Brian was just telling me about that last week. He loved it. Wait, you know what? Fuck it!\n\n[Chorus]\nLet's kill some guy tonight\nWe're holding hands and laughing while we shank him in the starlight\nLet's take a motherfucking life tonight\nWe're young and alive—which I can't say for that guy\nYeah!\nLet's kill five guys tonight!\nThen share a cherry cola while we blast a savage drive-by\nLet's kill ten guys tonight!\n(You know what? First date: let's pump the brakes on the murders.)\nLet's kill five guys tonight!\nI'll take you back to your place and we'll craft the perfect alibi\nMan, we had fun tonight!\nWe're young and alive, and you can call me anytime! (Time...)\n\n[Spoken Outro]\nGood first date! Wanna do it again next wee—no? Oh, alright"}], "artist": "Ninja Sex Party"}