{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro: Wrekonize]\nHuh, uh-uh-uh, uh-uh-uh, how come\nUh-uh-uh-uh-uh-uh, how come\nUh-uh, uh-uh-uh, how come\nUh, uh\n\n[Verse 1: Wrekonize]\nHow come they tax me just for making some bread?\nI used to love being alive, so how come I can't wait 'til I'm dead?\nHow come the music's all I got in this life?\nPassed down through my father even though the music biz did him trife\nHow come I always feel a hand in my pocket?\nAnd when I check mics they always bounce into vanishing profit\nHow come radio don't give us no play?\nWhen our music sounds better only we don't have the money to pay\nHow come the world still listens to Simon?\nHow come the ones who opens doors for me\nKnow the least of what's behind 'em?\nHow come my girl stands close to my side?\nStill when I swore that it was sure I'd be alone when I die\nWhy does high school seem miles away?\nAnd the ones who rush to borrow college money don't seem higher today\nHow come I haven't let the politics damn me?\nAnd how come the worst Hip Hop songs get charted for a Grammy?\n\n[Hook: Wrekonize & Vinia Mojica] (2X)\nHow come?\n(Gotta live on, gotta fight on, got to tell me, how come)\nHow come?\nI'm forced to live a middle class dream, when the upper class is where we belong\n\n[Verse 2: Wrekonize]\nHow come they treat the working man like a savage?\nHow come I hate my ex girl, but truth be told I think, I'd still be down to smash it\nHow come these cats be hating on my skill?\nHow come these local rappers hate on each other before they get a deal?\nHow come some friends are like nephews and nieces\nHow come when tryin' to satisfy all parties my heart be left in pieces?\nThe heat, the clips, how come some rappers fake the street shit?\nTalking smack, but when the battle starts they actin' Heathcliff\nHow come I started back in London as a quiet child\nAnd ended up a fastfood junkie rocking a hyper style\nHow come musicians sign their first deal with kneepads\nAnd when we open up for major acts we get the feedback\nHow come these days it be easier to hate, than to feel\nMuch easier to fake, than be real\nI'd rather blast facts than to catch mass appeal\nBut how come all that matters now is just the fact you caught a deal\n\n[Hook] (2X)\n\n[Outro: Vinia Mojica]\nHow come, how come, how come, how come", "title": "How Come", "year": null, "album": "The Waiting Room Mixtape", "image": "https://images.genius.com/ec9a9beb80d263eaf6bed4633a777e61.700x700x1.jpg"}]}