{"songs": [{"title": "I Know You", "album": null, "year": "2018-05-31", "image": "https://images.genius.com/be0311f5a4d454b917771fab4ed4c9ff.1000x1000x1.jpg", "lyrics": "[Intro: Yung Pinch]\nBeach boy in this ho, oh, woah\nYeah\nLook, I know you\nYou just wanna fuck me for the fame\nWanna fuck me 'cause them diamonds on my chain\nGirl, don't you? Don't you? Yeah, oh\n\n[Chorus: Yung Pinch]\nLook, I know you, you just wanna fuck me for my fame\nGirl, don't you? You just wanna fuck me for the fame\nYeah, don't you? You just wanna fuck me for the fame\nShe wanna fuck me 'cause them diamonds on my chain\nGirl, I know you, you be out here playin' all them games\nGirl, don't you? Out here fuckin' with all of them lames\nDon't you? Don't you? I know you\n\n[Verse 1: Lil Skies]\nAyy, ayy, ayy, ayy\nBig body, she gon' swerve it, now we way above the surface\nShorty lookin' picture perfect, say she ready, never nervous\nI wanna know like its urgent, give her good pipe when in person\nYou want the cars and the purses, baby girl, tell me is it worth it\nI'm in a spaceship, get ready for takeoff\nCan't fuck with lil' shorty, I know that she basic\nShe makin' my dick soft, these niggas hatin'\nSaid I wouldn't make it, I shine with a new floss\nI got his girl in a room gettin' naked, she fuck with a real boss\nWhen my gang walk in it's lit (It's lit), legit (Legit)\nGive her the D then she dismissed (Dismissed), no kiss (No kiss)\nYou test me then you getting hit (Hit), lil' bitch (Lil' bitch)\nI take my shot and I don't miss (Don't miss), my diamonds piss (Piss)\nAnd girl that's funny 'cause I know you\nYou just come around and make a name\nGirl, I know you, gon' tell me that you different and you changed\nBut I know you are everything you say you ain't\nYou tried to take me down, I left you in the rain\n(Ayy, girl I, ayy, girl I)\n\n[Chorus: Yung Pinch]\nLook, I know you, you just wanna fuck me for my fame\nGirl, don't you? You just wanna fuck me for the fame\nYeah, don't you? You just wanna fuck me for the fame\nShe wanna fuck me 'cause the diamonds on my chain\nGirl, I know you, you be out here playin' all them games\nGirl, don't you? Out here fuckin' with all of them lames\nDon't you? Don't you? I know you\n\n[Verse 2: Yung Pinch]\nLook, she want the money and the fame, told her you gotta go\nI ain't gon' give your ass a thing, she want a pot of gold\nBack when I was young I had a lot of hoes\nI'm talkin' back before I got this dough, now I see how they rockin'\nI know how you roll now, ain't no need for talkin'\nThat shit gettin' old now, left me with no option\nBut to keep knockin' these goals down, left me with no option\nBut to keep knockin' these hoes down (Hold up, wait)\nGucci down to the socks (Ho, yeah), that's a beach boy, baby\nPull up to the party, shawty all up on me, now she wanna date me\nSaid she wanna have my baby\nI ain't know that was your lady, oh no\nI've been workin' off the clock for this shit, did a lot for this shit\nPlease don't expect me just to give it up\nShorty wanna rock with the kid\nI gave her cock then I dipped, told lil' mama go ahead and live it up\n\n[Chorus: Yung Pinch]\nLook, I know you, you just wanna fuck me for my fame\nGirl, don't you? You just wanna fuck me for the fame\nYeah, don't you? You just wanna fuck me for the fame\nShe wanna fuck me 'cause the diamonds on my chain\nGirl, I know you, you be out here playin' all them games\nGirl, don't you? Out here fuckin' with all of them lames\nDon't you? Don't you? I know you"}], "artist": "Lil Skies"}