{"artist": "King Los", "songs": [{"image": "https://images.genius.com/4d9c32a9b90541ce4c0c3d143d56f7c9.1000x1000x1.jpg", "title": "January 24th 2017", "year": "2017-12-25", "album": "Moor Bars", "lyrics": "[Intro]\nYeah\nHello, yeah\nYeah, I know\nHah, yeah\nYeah, I know\nYeah, don’t get it fucked up\nI know. Yeah, do-don’t get it fucked..\n‘Cause I know, ay, ay don’t get me fucked up\n'Cause I.. hold up\nKing shit, look\n\n[Verse 1]\nI got a closet full of cool shit\nTwo strippers named strawberry\nOne got a cool whip, I'm buggin' on my new shit\nFully connected to the Heaven inside\nMy god, it's been a hell of a ride\nI told the Devil \"Goodbye\", bumpin' Erykah Ba-du\nDo you know you fuckin' with a hell of a guy?\nYoung, intelligent, wise, humble, eloquent, fly\nThey say when \"We gonna be Los\", I say \"when elephants fly\"\nI'll fuck around and save the world in one benevolent try\nI got the swag of a nigga back in '79\nI hit the button for them Benjamins, put that in rewind\nThis shit about to be a movie, I'll get better with time\nMan I get letters from God, like \"never let up your guard\"\nLong as they fighting you, head up, boy keep your head up in mar\nI'm getting fed up with talk, watch how I set up this bar\nLike it ain't nothing personal, I'm just better than y'all\nFrom lack of culture you won't know this shit embedded in y'all\nSee having knowledge itself is the greatest blessing of all\nUnless you evolve, you'd never confess you was lost\nAll these Jesuit Methodists, spreading prejudice laws\nHow could the spirit of the oppressors be better than ours?\nYou talking 'bout false prophets but serve irrelevant Gods\nI know this level is hard, we're only here for the test\nYou gotta meditate to elevate the spirit from flesh\nAnd I ain't nearly impressed\nWhen I was quoting your shit\nI couldn't feel jack son, you need coachin' and shit\nWord to the culture I'm lit, lit like a wick of dynamite\nWicked your honor might\nTry to give me a thousand year-sentence when I'm behind the mics spitting\nWe can take off, Face/Off like Travolta and Nick\nYou feel the voltage in this, you see the focus my nig\nWho said they dope as the kid? Man quit the joking and shit\nYou got one foot in, one foot out, you Hokey Pokeying bitch\nYour flow pussy, ovaries, Fallopian, clit\nI'll whip your ass on a track, say \"It's over\" and dip"}]}