{"songs": [{"year": "2011-01-01", "album": null, "image": "https://images.genius.com/ed0b1bc0d001d682fec2d6de80b365a7.1000x750x1.jpg", "title": "Fuck A Hook", "lyrics": "[Verse 1]\nHallelujah, K. Dot'll do ya\nQuicker than a porno star, jump on my dick y'all\nAnd get fucked by the millisecond\nDuck when I pull the weapon from out of my mouth (Buh!)\nShots at you like a sawed-off\nAiming for your grill like I'm Paul Wall\nThen peal 'til I not y'all\nMy cerebral cortex is like a war vet\nSharing war stories with the deceased, I'm brain dead\nStraight bananas, I never gave a fuck\n'Bout anything but my momma, my daddy, siblings, and grandma\nAnd if you neither one of them, then I gotta answer\nEvery question with a bullet hole in my hammer\nLike VH1, that's far beyond your comprehension\nLike a deaf person showing up to court for a hearing\nWho they fearing? K. Dot\nTickle the nipples of women\nMake your bitch grab her crotch when she hear my shit, bitch!\n\n[Verse 2]\nK. Dot got the unorthodox flow\nOn fire, make a rapper burn his soul\nMurder for hire, acquire choirs for funerals\nNumero uno, city in my rearview\nCompton on my back like the titties of my masseuse\nPity, here you fool who?\nGo against me, I rebuke thee\nAnd wake thee up, six in the morning\nWith the pump, punks jump up to get beat down\nJump shot, coroners catch them on the rebound\nPans, pots, plates, bowls\nI'm in your kitchen eating your stove\nI'm hungry and hibernated\nI'm cold as Miles Davis\nI load up then I aim it\nNo judgment for the plaintiff\nIt only gets more heinous, nigga I'm brainless\nLike a blind bitch who don't suck dick\nDinosaur manure, big shit\nSmell me or die quick, fucka!\n(Fuck a hook)\n(jab, jab, jab, left right)\n(Fuck a hook)\n(Damnit, genius)\n\n[Verse 3]\nI can stand in a pool of gasoline lighting a blunt and never catch on fire\n(How come?) Silly motherfucker, I'm fire\nSmack the devil over the cheek, gave him a third degree burn\nIced it down when he was asleep, and said you'll be okay\nA lot of rappers are desperate to be a star by the day\nThey hydroplaning, hoping that they get their big break\nI'm just saying, I feel I'm the one\nLike a magician with a stick inside his hand, or the name of a mexican\nI gets ignorant with ya\nSnap me a picture, bitch, I'm famous\nI came in this world nuts in my palm and drinking Paul Masson\nIn a stolen Cavalier like I took LeBron\nLocked him in a basement and amputated his shooting arm\n(Psss) Now that's a stretch Ab-Soul\nLike a fifty mile strip when I'm pimping these hoes\nCall me Dolomite, nope I take that back\nFound out he gay as a happy day or the way that you rap\n(ee)\n\n(K. Dot got the unorthodox flow\nOn fire, make a rapper burn his soul\nMurder for hire, acquire choirs for funerals)\n(Look, ee)\n(Damnit)"}], "artist": "Kendrick Lamar"}