{"artist": "Angie Martinez", "songs": [{"title": "If I Could Go", "image": "https://images.genius.com/fa4abffe2c6164a010ae6b833f491d67.1000x981x1.jpg", "album": "Animal House", "lyrics": "[Lil' Mo] Yeaaaaaaaaaaayyyyy!!!\n[Angie M] Oh yeah yeah\n[Lil' Mo] Yeaaaaaaaaaaayyyy!!!\n[Angie M] Uh, woo! come on, uh\n[Lil' Mo] If I can go, with you\n[Angie M] Yo, yo, uh\n\n[Verse 1: Angie Martinez]\nIf I can choose a place to go it gotta be far away\nFrom here we could crossover like Hardaway\nSomewhere outside the states, where tomorrow's like today\nAnd I'm out in a space where nobody else can stay\nAnd, if I can go, with you\nThen I'll go get the ticket right now if that's cool\nHave you ever been close to feelin like leavin the coast too\nFeelin like leavin with somebody who\nHold you the right way while watchin the night fade\nMake you feel like you right back in the ninth grade\nWhen you know what he likes and what he might say\nAnd you try to be calm and answer in nice ways\nAnd, if I can go, with you\nWay out the states no 2-ways and no page\nNo cells and no trace, and you just a phone call away\nSo all I got to say is\n\n[Hook: Lil' Mo]\nIf I can go, contigo, I'll pack my things, soon as you say\nBaby vamos, we'll fly away, like there is no, no tomorrow\nIf can go, contigo, I'll tell my friends, nothing at all\nI'll get my things, soon as you say, baby vamos, we'll fly away\n\n[Verse 2: Sacario]\nAnd, if I can go, with you\nOh boy we 'bout to make a lot of people annoyed\nIn Croix, you better know I know how to sneak with them toys\nEmployed, with the block since around 94 boy\nAnd, if I can flow, with you\nHoldin dat dough after the studio I roll with you\nI send Dutch and three other goons to go get you\nSacario the name awaits the whole issue\nGrown men keep on cryin get mo' tissue\nThe way me and this girl be rhymin it's so official\nThem I'm takin a trip too with no pistols\nCause everything peace only sand no streets\nLittle Miami Heat, that's the plan we'll see\nTwo cups, one in Senado one in Sand Beach\nAnd, I'll think I'll go, with you\nSo tell the station you need a week - back to you\n\n[Hook: Lil' Mo]\nIf I can go, contigo, I'll pack my things, soon as you say\nBaby vamos, we'll fly away, like there is no, no tomorrow\nIf I can go, contigo, I'll tell my friends, nothing at all\nI'll get my things, soon as you say, baby vamos, we'll fly away\n\n[Bridge: Lil' Mo]\nYou can fly away, no one has to know\nBabe take me with you, cause if I can go\nSoon as you say the word, we'll be on our way\nTo a foreign place, you got to tell me\n\n[Angie Martinez]\nYo, uh, so now that we got a plan are you comin? We could plan a week\nThe only question now is LaGuardia or Kennedy?\n\n[Sacario]\nAnd a seat, know why? the window cause I like to see\nAnd seein as to how I'm so fly me and the clouds can speak\n\n[Angie+S] And, since we 'bout to go, in a few\n[Sacario] Go 'head\n\n[Angie Martinez]\nOh, I just wanted to tell Trace thank you\nThat week off I'm grateful what was you tryin to say boo?\n\n[Sacario] Nothin just grab my chain off the table and 2 way too\n\n[Angie Martinez]\nOk, that little place it's a great move\nBut ain't no problems, unless the water don't stay blue\n\n[Sacario] And the shop's there?\n\n[Angie Martinez]\nIf they don't got em, they don't make em (Sacario: True!)\nNo concrete just sand, throw away your shoes\nNow, that we are on, our way\nAnd our bags is packed and the car service is not late\nEverything's ok, so I guess I catch you on the next track\nNow I don't gotta ask\n\n[Hook: Lil' Mo]\nIf I can go, contigo, I'll pack my things, soon as you say\nBaby vamos, we'll fly away, like there is no, no tomorrow\nIf I can go, contigo, I'll tell my friends, nothing at all\nI'll get my things, soon as you say, baby vamos, we'll fly away\n\n[Outro: Lil' Mo]\nIf I can go, contigo, I'll pack my things, soon as you say\nBaby vamos, we'll fly away, like there is no, no tomorrow\nAnd if I can go, contigo, I'll tell my friends, nothing at all\nNothing at all, I'll tell my friends, nothing at all", "year": null}]}