{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Put The Next Man On", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[DIALOGUE]\nTARIQ: What? Shit, I could definitely sell for y'all brothas. We could all get this money. Get paid, I'm just— I'm just tryin to get down wit y'all brothas. Y'all brothas got— I'm sayin, y'all— y'all got all that shit together. I'm just tryin to— Yo, be like y'all brothas. Big Will, yaknawsayin? But yo I gots mines, you know niggas call me around the way? Check it, ayo\n\n[Verse 1: Breeze/Tariq]\nThe Green Bandit, son, the fiends hand it over like juggling\nAnd the only slight trouble is keeping up, sleeping, what?\nI flips more weight than Oprah, strips off fate\nThen hope my skills superb, crills to herb to dope\nI lace brothas, butter wounds, I bless the spender\nBut test, I bend or waste mothafuckers\nRules are broke, get smoked free of charge\nWe not drugs but hot slugs, see I'm Large like Mister\nI gots no shame, irrational nigga, the cash clime\nShit ain't no game, it's more like a national past time\nYour sales pitcher, down the pipe, come get a hit\nI never fail to get your clown types\nI never quit pursuing these crabs, recruiting rehabs in churches\nMy search is ongoing but yo fuck it, I want this dough in\nCan I please this crime crew? Shit, Genovese times two\nBe in drug store to thug lore\n\n[Chorus: Superstar]\nIf you got some flow, and I got some flow\nYou gettin dough, baby doll and I'm gettin dough\nWe can chill on the hill, word bond\nAnd put the next man on like we supposed to put him on\n\n[Verse 2: Sha/Tru]\nAyo, that's my son, I state that on my word\nPlace that nigga on 103rd, then make cream off of bird\nYo I'ma watch 'em, he come up short and I'm gon' smoke em\nEither way, you could say I'm that bronc' that broke em\nHe wanna learn, I say give him a chance\nHe fuck up and the devil'll be having a last dance\nI think he'll do it right, he knows the consequences\nTo fuck up after that? That shit's too expensive\nEvery time 'caine was took out, he was the lookout\nWanna know how much I made?\nJust ask one of them niggas to pull the book out\nI state this on my word bond, just put him on\nIn time he'll come up shinin like a mothafuckin Don\n\n[Verse 3: Breeze/Tariq]\nI gets money like Lil Kim, could take a facial\nTo make 'em pay a skill, forget it, dunny\nMy shit'll win you jackpots\nCommission be officially a crack spot wit a purpose\nI get my service then niggas serve us\nA neighborhood infested, that's the good investment\nI peeps your operation, let a nigga give me most high\nI never been arrested, but expect the unexpected\nWith full premeditation, when I run in with po-nine\nI freaks the amnesia, or maybe like I be strung out\nCatchin a damn seizure, fuck it, I bites my tongue out\nNothin to lose, cousin, your crews are top-notch\nLet's get biz, run through niggas blocks like hopscotch\n\n[Chorus]\n\n[DIALOGUE]\nTARIQ: I'm sayin, complete and total detriment to society. Yo, a match made in hell, word is bond. A wonderful day for the organization. It's just gon' be perfect for everybody involved. You get money, I get money, everybody get money, everybody shine, as the neighborhood declines\n\n[Outro: Sample]\n(How could anything go wrong?)\n(How could anything go wrong?)", "year": "1999-02-23"}]}