{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Hook]\nI ain't stun what you saying\nAll I know is gettin money\nYall niggas be playing, and yall niggas don't want it\nBetter watch what you saying\nCause my niggas they on it\nAnd my niggas don't play fair\nThey'll give it to you if you want it\nMy niggas they don't play fair\nBut they'll give it to you if you want it ya\nBetter watch what you saying\nBetter watch what you saying\nBetter watch what you saying\nBetter watch what you saying\n\n[Verse: 1]\nBetter watch what you saying\nCause ion play like that (Ion play like that)\nHundred thousands in my pants nigga\nStraight like that (Okay)\nI could loose a twenty in a day\nBet i'll make it right back (Ima make it back)\nIon write shit down, I punch it in\nSo pay it right back (That right too)\nRICH HOMIE BABY !\nI make her say it like that (Aye say that shit)\nI gotta right to hold that K\nYou know it spray like that\nAnd I take that back that F N a go getta\nGotta shooter on the building bullets gon hit cha\nAnd they gone split cha\nBreak you up and separate cha (okay)\nKeep em' out ya business, haters they investigate ya(okay)\nAnd I ain't tryna place ya ... At the top!\nI'm with the same niggas I came with from the block(nigga)\n\n[Hook]\n\n[Verse: 2]\nI need a golden glove, cause I just caught the plate(okay)\nI'll put your eyes where your mouth at, now watch what you say (hahaha)\nI got them Dope Boys Nikes on like Dr. J(I do)\nBroke Hoes three words (what?)\nOUT MY FACE (yeah)\nAnd I flipped like three birds, Yesterday (yeah)\nI don't know what he heard, but it's not accura (nah nigga)\nI mean accurate. Oops my mistake (yeah)\nI just got a new watch, But I still find myself being late (that right too)\nYou niggas sweet and I smell the flowers (I do)\nYou keep brown in yo weed, call it Eddie Bauer (mid haha)\nYou mess with kids like a pedophile (ew)\nGot sum for you to suck on, No pacificer\n\n[Hook]", "title": "Better Watch What You Saying", "year": "2013-02-03", "image": "https://images.genius.com/7ecf478686c7d2526f20be6849cf156d.500x500x1.jpg", "album": "Still Goin In: Reloaded"}]}