{"songs": [{"year": null, "image": "https://images.genius.com/9c7203e565e56a244f10c1741d29f204.640x640x1.jpg", "title": "Hard Times", "album": "A Song for You", "lyrics": "Yeah. One time. Man, I need to let you know, man, how much I love you, man\nI... I'm... I'm kinda fucked up right now, man\nAnd I just want you to know, you know what I'm saying, that you my everything\nAnd, I'll do anything for you, man. I'll die for you, kid\n\n[Chorus - Chris {Bizzy}]\nI've been living on the outside (In the rain, soaked in my game)\nI've been watching from the inside {You and I, boi. Ha ha.}\n(I've been knocking, ya'll keep watching me)\n{Shit nigga, thats my bloodline, nigga, ha ha}\nIt's our time, talking about the hard times, times... oh, oh, oh\n{Grandpa. Ha ha. Macedonia. Acting like I don't know you nigga. Watch this.}\n\nI've been known to rock shit, daddy let's get it poppin'\nPop-lockin' in the projects, duckin' shots\nGangsta gangsta\nThey tried to kill me, my ego never been ragin' since they raped me, baby\nCan you feel me? Fuck it, I can feel it; Love it or leave it\nHeavenly Father give me your power, Bryon's stuck in this war\nSee the chloroform, neck tie, lions, and that's right\nWhat did I do to deserve what a day? No question in my mind\n\n[Chorus - Chris {Bizzy}]\nI've been living on the outside (In the rain, soaked in my game)\nI've been watching from the inside {You and I. Ha ha.}\n(I've been knocking, ya'll keep watching me)\n{What's up ya'll? You ready to rock?}\nIt's our time, talking about the hard times, times...\nOh, oh, oh {....}\n\n[Bizzy Bone]\nAnd as I ride for the prayers, rhyme sayers, time conveyers\nI'm nothing but slime, Boo Boo, up in my prime\nDrop a dime, make it work, babe, I'm nothing but dirt\nTake the back seat, I'm lookin' for Jesus Christ for sure\n\n[Chris Notez]\nAnd you say that it changed, and you can't feel the rain; It's a shame, shame\nI see the pain in your eyes, I can see it in the tears when you cry\nYou my blood, you got love, let the motha'fucker try\nYeah, it's been to hard livin', and I know that you scared\nTake a look around, but feel don't nobody care\nLook to the sky, but I feel that nobody answer your prayers\nYes, money with these houses and your friends disappear\nAnd I know that you hear through the sounds in the air\nWhen you pass by, I know that you feelin' those stairs\nLet 'em try, you don't need 'em, you got family right here\nWhen life gets ugly, you need beautiful, just look in the mirror\n\n[Chorus - Chris {Bizzy}]\nI've been living on the outside (In the rain, soaked in my game)\nI've been watching from the inside\n(I've been knocking, ya'll keep watching me)\nIt's our time, talking about the hard times, times...\nOh, oh, oh {....}\n\nThey say I'm beautiful, and who the fuck I'm speakin' with?\nKiss me on the cheek like they' Judas? But Jesus, please keep it\nBeat her all up against for, baby it's fine\nShot at mine with the world on its back, he still rides\nRealize synchronation, and dedication of life\nWhat life, nigga? I blacked out from drinkin' liquor\nWhere the circle at? Give me another, circle completed\nWhere the fee at? Give me another fee, don't delete it. c'mon\n\n[Chorus - Chris {Bizzy}]\nI've been living on the outside {I miss you, man.} (In the rain, soaked in my game)\nI've been watching from the inside {You were my best friend.}\n(I've been knocking, ya'll keep watching me)\nIt's our time, talking about the hard times, times...\nOh, oh, oh {....}\n\nFrom sea to shining sea, to the depths of the destiny\nKeepin' on keepin' my boots on, you need me, it's on\nYou know, I'm there most certainly\nOpen the curtain, better believe that I'm hurtin'..."}], "artist": "Bizzy Bone"}