{"songs": [{"image": "https://images.genius.com/fe7d5810fa51b8e81d7eeb21c834aab1.499x500x1.jpg", "title": "Cockroaches", "album": "I Need Drugs", "year": null, "lyrics": "[Verse 1]\nCockroaches\nBillions breedin', roamin' around since Genesis\nComin' out through the crevices\nInfested, walls filled with termites\nBugs'll intrude, lookin' for food\nComin' out when there's no light!\nThey're small, but they make humans nervous\nYou'll do a spastic jerk, if you spot one crawlin' on your epidermis\nIf you squeamish, you're save provided\nWhen you sleep you keep your mouth closed\n'Cause yo, they might crawl up inside it\nUninvited, from out the Earth's core\nBugs are the only species that'll probably survive a nuclear war\nAnd as you snore, they like to run to your door then explore\nYou won't notice when they're on your upside down floor\nSchemin', he sees food and calls his boys in\nBut some ain't smart enough to evade the exterminator's poison\nSo the pest takes it back to his nest\nContactin' with another insect and begins to infect the rest\nA lot die, but it's only a small fraction - we can't catch 'em\n'Cause there's always new eggs hatchin'\n\n[Hook One:]\nCOCKROACHES!\n*Cut and scratched by the DJ*\nCock-a-roaches (3X)\n\n[Verse 2]\nCockroaches, many perceive as evil\nBut if you're from The Projects, them niggas are like your peoples!\nThey sleep with you, eat with you, listen and beef with you\nThousand loungin' in your couch, some only they'll reproduce\nThey conceive they're crew, roaches got there own army:\nGenerals, colonels, lieutenant, invadin' tenants\nYour crib becomes a big roach motel, for all sorts of bugs\nPoor homes for that can't afford copycat a free cockroach drugs\nFrom out the cupboards, crawlin' is a crisis\nI got baby roaches inside my food cartons, camouflaged as spices\nOnce by accident, I ate 'em with my rice, kid\n'Cause, when you're hungry, you don't think twice, kid\nYo, there ain't a person on Earth that never ate an insect\n'Cause every food warehouse in the U.S. they infest\nI used to give roaches funeral pyres\nWrap 'em up in toilet paper, still alive and light em on fire!\nSo watch out, they'll come to get you, we're malicious\nNo war poo parties, up in your sink, swimmin' up in your dishes\n\n[Hook Two]\n*Cut and scratched by the DJ*\nCock-a-roaches (2X)\n\n*Whispered in the background*\nCockroaches...\nCockroaches...\nCockroaches...\nCockroaches..."}], "artist": "Necro"}