{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/47286291f795dcabf6ef911ae5d1e441.440x440x1.png", "year": "2019-07-26", "album": "The Lost Boy", "lyrics": "[Intro]\nIt's perfect, okay\n\n[Chorus]\nMac and cheese up in the oven‚ grandma finished cookin'\nThanksgiving 'round the corner‚ need banana pudding\nBrought you home to mama even though you said I shouldn't\nMight not make it to Christmas\nBut I'm hoping and I'm pushing for a better day\nA good day in the making‚ but you never stay\nI could say that you fakin' on the real, huh, nigga\nWhy you fakin' on the real? (Uh‚ yeah, yeah)\n\n[Verse 1]\nYou see I brought you home to mama\nIntroduced you to my cousins\nMet my aunties and my uncles\nKnow they crazy, they be buggin'‚ but\nPromise that I got you, didn't bring you here for nothin'\nKnow we fightin', plus the arguments just lead into the fucking\nThough some things never rearrange, I know we needin' change\nAltogether through a deeper lane, come through, release the pain\nI can be your ibuprofen, keep it real what I be hoping\nKnow you see all of it's destined, yeah, our shit was highly chosen\nBy the universe, the stars align, your love is far divine\nPlus I'm really glad you keep it G, that shit is hard to find\nNot to mention my intentions was always evolving time\nGirl, I hope I'm in your future 'cause I know you fall in mine, uh\n\n[Chorus]\nMac and cheese up in the oven, grandma finished cookin'\nThanksgiving 'round the corner, need banana pudding\nBrought you home to mama even though you said I shouldn't\nMight not make it to Christmas\nBut I'm hoping and I'm pushing for a better day\nA good day in the making, but you never stay\nI could say that you fakin' on the real, huh, nigga\nWhy you fakin' on the real? (Yeah, yeah)\n\n[Verse 2]\nYou see I've always been an overthinker\nI've always been the type to analyze\nTo no surprise that you hold the team up\nThe way this ship was built, there's no way that the loads could sink us\nA humble shawty, model type, walking Vogue demeanor\nBut anyway, through many days\nWe on the block where Jenny stays\nHoney baked ham with Henny glaze\nAbraham inheritance, shawty, we plenty paid\nBonnie Clyde high speed chase, a renegade, but\n\n[Chorus]\nMac and cheese up in the oven, grandma finished cookin'\nThanksgiving 'round the corner, need banana pudding\nBrought you home to mama even though you said I shouldn't\nMight not make it to Christmas\nBut I'm hoping and I'm pushing for a better day\nA good day in the making, but you never stay\nI could say that you fakin' on the real, huh, nigga\nWhy you fakin' on the real? (Yeah)", "title": "Thanksgiving"}]}