{"artist": "Peewee Longway", "songs": [{"album": "Streets on Lock 3", "title": "Foreal", "image": "https://images.genius.com/346f0067206ddb0b24ba56f9c6cba396.500x500x1.jpg", "lyrics": "{Intro}\n\nForeal...\nForeal...\nForeal.Foreal\nForeal.Foreal\nForeal.Foreal...\nForeal....So Sincere..\n\nForeal...\nForeal...\nForeal...\nForeal.Foreal\nForeal.Foreal\nForeal.Foreal\nBaby...Yea\nLongWay Nigga\n\n\n[Hook]\nShe for me, I'm for her, My type of bitch\nRock out with me, in the trap serving splits\nStill with the same nigga, came out the brick\nNo new friends, shoot for my homeboys\n\nEverything I do sincere\nSkies the limit, I'll take a jet, Lear\nSipping on lean in a root beer\nSo Sincere, So Sincere\n\nForeal...Foreal.Foreal\nForeal...(Foreal)\nForeal...Foreal.Foreal\nSo Sincere, So Sincere\nGet it by my pop (Get it by my pop)\nSo Sincere (So Sincere)\nShow mama dollars (Show mama dollars)\nSo Sincere, So Sincere\n\n\n[Verse 1 - PeeWee LongWay]\n\nHit a nigga ass up with the choppa\nYellow Tape, I'm at the doctor by my potna\nGiuseppe he stepping at the murder scene\nFresh as a bitch cleaner than Listerine\n\nBite down on molly not a bean\nVVS shout out like Horror scene\nJugging them bricks, I'm Charlie Sheen\nHow could I not go hard for my team?\n\nM.P.A. Bandcamp, all [?] me?\nGet it for the low, Bags of the OG\nSet it off, could [?] for the whole [?]\nBands in my pocket call them bitches Monique\n\nI'm so sincere that bitch gotta be free\nElegant sediment, body unique\nBitch wanna run around the lobby with me\n[?][?][?][?][?]\n\nAll of my niggas in the lobby\nBoot it up, [?][?][?][?][?]\n[?][?][?][?][?][?]\nMe and my nigga, my nigga call shots\nWe just wanna add it up, M&M\nMy type of a bitch that a rock out the spot\n[?][?][?] spell M&M?\nShe know I'm chief of the [?]\nLongway\n\n\n[Hook]\n\n\n[Verse 2 - Quavo]\nForeal...\nWho got the PT, ready to pay two thousand foreal\nMy niggas come kill, they'll lay your ass down foreal\nShe popping a molly, that bitch wanna roll foreal\nYou think that I'm playing, young nigga foreal\n\nWhat nigga you know trapped out the 'bando pay the whole damn neighborhood bills\nWhat nigga you know, no training, they got a mill in the floor foreal\nSincere, but my niggas bout killing, all of my niggas want Bentley's\nSo guess what we did? We beat up the block now we trapping out Bentley's\n\nM.P.A. Band camp, they keep it real to me\nMigos Gang, M.P.A., so you know they'll kill for me\nSo you probably can't get nowhere near me\nDo you feel me?\nDouble down [?] in here seriously\n\n\n[Hook]", "year": "2014-04-20"}]}