{"artist": "Paul Wall", "songs": [{"album": "Get Money, Stay True", "title": "I’m Real, What Are You?", "image": "https://images.rapgenius.com/543671ac02810bd4cb034863e36dc96d.220x220x1.jpg", "lyrics": "[Intro: KLC (Juelz Santana)]\n(Big City Terrorizer, Santana, ay!)\nHello World, wassup everybody?\nI'm speaking to all the people out there\nThere comes a time to where you have to know who you are\n(Dipset, Skoal game)\nAnd what you are to overcome things\nOh and by the way, My name is KLC\nThe drum man, you heard me?\nBut this not about me, This is about the People's Champ\nFrom Houston Texas, my partner, Paul Wall\nTell em who you are!\n\n[Chorus x2: Paul Wall]\nI'm a real mothafucka what are you? (what are you?)\nI'm a real mothafucka what are you? (what are you?)\nI'm gettin money, stayin' true, chasin' paper, what it do?\nI'm a real mothafucka what are you? (what are you)\n\n[Verse 1: Paul Wall]\nI'm grindin' like a rotor and I'm postin' like a sticky note\nStackin' up that paper, pockets fatter than a dukie rope\nBoyz lookin' sick but that doctor got that antidote\nHatin cuz they broke, suckas fake as a 30 spoke\nI'm watchin the stock quotes, I'm real as a pac [?]\nBut these clowns be actin funny like a knock knock joke\nThey cramp on my style cuz I got money and power\nMy paper long as the nile, so how them haters like me now?\nThem bustas on the prow, so I'm ten tokes down\nI'm puttin' all ya'll to sleep, so put on your night gown\nSome tatoos and a ice grill don't make you real\nThese cats be actin frauder than a 4 dollar bill\n\n[Chorus]\n\n[Verse 2: Juelz Santana]\nI'm a gun holdin', blunt smokin', paper chasin', lady banger\nFly boy, somethin' like a aviator,HA\nYeah, I'm you girls super hero, her caped crusader\nSo go head and hate me cuz I hate a hater\nIt take money to make money, I said\nYou gotta have dough to make bread where I'm from\nI ain't chew, get it? I stay true with it\nBarbed wire flow, don't get tangled in it\nReal nigga yes, all about the hustle\nTill I get that call from God sayin', \"I want you\"\nI been through it, I past struggle\nThat's why every day I'm in the street trying to complete a math puzzle\nWhite coupe, pedal mashed down\nSeats soft like I sat on hash brownies\nI get money, don't ask me, ask 'round\nBig money like I work downtown\n\n[Chorus]\n\n[Verse 3: Paul Wall]\nI'm one hundred but them other boys frontin'\nThey just sideline commentating, we call it dumb fuckin'\nThey sweet as apple pie, as they spreadin them lies\nThey smile up in your face but so quick to jump [?]\nYou swear they so cool but they turn like doorknobs\nThey say they hardcore but they friendlier than Spongebob\nI'm tryin' to stay afloat, stayin' up on my note\nSo that highness is what I tote, affordin' the overcoat\nI roll with a platoon that'll put you in your tomb\nAnd then mark up your body like Mr. Cartoon\nIts real in these streets when you chasin' that guap\nCuz that hatin' around the clock\nWill it ever stop? Probably not\n\n[Chorus]", "year": "2007-04-03"}]}