{"songs": [{"year": "2000-03-07", "image": "https://images.genius.com/809737792a8459e937896e9550e530ba.600x600x1.jpg", "title": "Espacio", "album": "Life Story", "lyrics": "Dangerous niggas\nUhh Black Rob shit\nY'all don't know?\nUhh Uhh\nDanegerous niggas\nLil Kim and Black Rob yelowman\nP Diddy , the moment you all been waitin for\nMurder yeah , ha ha yeah\n\n[Black Rob]\nWhat y'all riffin about, hang em like they did in the South\nDead wit ya dick in ya mouth\nNow what this shit is about, niggas sleepin\nLike I won't slip in ya house, and put my dick in your spouse\nTill you get home, I'm lamped like a part of ya couch\nThen sit on me, that's what I'mma spit filthy\nPretty swiftly, til them coppers come and get me\nTried to tell his coward ass it's real\nActin like I can't get through that Slomen Shield\nI'm a veteran, I'll take leathers and furs in front of him\nSafe cracker, moved from New York to Jers\nStill sending ?kites with birds?\nNothin's heard, feds wanna tap my word\nTake vehicles off curbs, tools off herbs, jewels off of all you nerds\nYou swerve, I splurge with all yall riches\nComin to joke and blind all yall bitches\nGive respect where respect is due\nKeep frontin, and I'mma put the tech to you\nCoward\n\nCHORUS: Lil Kim and Black Rob\nDame espacio\nMan back up off me\nDame espacio\nCan I get a minute to breathe?\nDame espacio\nThat means give me space\nDame espacio\nDamn back up off me\n\n[Black Rob]\nLike I'm just talking like I never did these things\nSnatch chains and rings, teddy bears from siblings\nI did things some of yall cowards might not imagine\nLike run in the stores, gun drawn, spasm\nPress the button bitch I'm not havin\nOr it'll your super employee leave in a bag and\nBlack wagon, bait boy I'm not braggin\nIt's a promise, I'll take em to school like Nastradamus\nIt's my thing do what I do best\nWant the treasure chest, and that dough in your girl breasts\nHow dare you try to stash yours in your drawls\nWhat's mines is mines, what's yours ain't yours\nGet his whip, watch how quickly I paint yours\nWatch poppi and them, hit it up with the paintballs\nCoward niggas, got the gall, thinkin I won't lamp in the hall\nLike New Year's and drop the ball, bitches!\n\nCHORUS\n\n[Lil' Kim]\nWhere I come from, we all got guns\nBe a hundred of yall and we still won't run\nCall the cops, they still won't come\nWe bang on niggas like we playin the drums\nThese cats think they know me Black\nWell I hit em over the head and say \"Homey don't play that\"\nListen to they rhymes and say didn't I say that?\nDamn, I'm the shit, it's like I'mma nigga they be bitin my dick\nGet on some old school shit, bitch run your kicks\nGo on y'all can have my flow\nI extort y'all hoes for all yall dough\nAnd by now I think all yall know\nWho's the winner, still champ by T.K.O. WHAT\n\nCHORUS"}], "artist": "Black Rob"}