{"artist": "AZ", "songs": [{"title": "Hustler", "image": "https://images.genius.com/7f3c7c305786e91b75f83cf5aca60a06.300x300x1.jpg", "album": "Aziatic", "lyrics": "I'm a hustler, not by choice (1x)\n\n[AZ]\nI didn't fall from heaven, I rose from hell\nBigboy, get bagged, he gon' hold my bail\nIt's like Attica '67 when they, closed the jail\nBe careful, but promote yo'selves that's what they told me\nInvolved but unconcerned fuck beef when it dissolve it does not return\nI don't leave, stagnate nor move off-beat\nSo discrete very rarely do I move on feet\nI rough-ride twin rugers on the sides of my seats\nDrive-by's, bodies left on both sides of the streets\nI blacks out never blind by the size of the image\nNo disguise, homocide don't rely forensic\nHomes's finished, scrambling caught in the scrimmage\n12 shells ricocheting and it pours from the hemorrhage\nGet the casket embalm and forget the bastard for moving backwards\nNew York's number one draft pick\n\nI'm a hustler, not by choice (4x)\n\n[Trav]\nAll this nigga know is, get money burn a lot of smokes\nLazy niggas was sleeping, I was wide awoke\nNot a joke, creep on snitches, niggas gotta choke\nWhen it's time to sleep with the fishes I supply the boat\nAnd I swear it hurts, I supply the coke\n'Cuz don't nothing scare me worse than dying broke\nIron poking on my ribs while I'm laying in a Taurus\nI live this shit y'all just performers, it's a dirty game\nI seen thugs turn informers, crooked cops run in the crib, no warrants\nMoney talk though, never stuck in a grudge\nGot a female lawyer and she fucking the judge\nI was once told, that you reap what you sow\nAnd a, the scent of weed always seep in your clothes\nAnd a, it's Quiet Money so we speaking in codes\nLike, why should I trust ya?, nigga, I'm a hustler\n\nI'm a hustler, not by choice (4x)\n\n[Animal]\nUnh, Yo, Jesus Christ yo, he just nice\nLike a ginszu blade nigga, he just slice\nAnd get y'all out the game, dog, it's not long\nAnybody can spit, faggot, but can you make a hot song?\nYou're not wrong, like Biggie said you're dead wrong\nNeed to get your flow tight, gotta get your head strong\nWatch us, the way we floss up in coat lockers\nWalk right past security, flippin' poppers\nLike what? who the fuck gon' stop us?\nY'all wait until the summer, when this fucking album drop us\nI know y'all hate it, because y'all flows outdated\nYou finished as an artist and I finally made it\nBut I paid my dues, in this game patiently waited\nNiggas ain't gimme shit, I had to take it\nIt's A dot, all year 'round I stay hot\nNigga I play not, ride thru you're block in that grey drop\nThey call me headhunter, the head is all I aim for\nThe top spot nigga, what you think I came for?\nThese words touch you, cut you open like a chainsaw\nAnd now you're your man is like, what y'all said his name for?\nFucking hustler, motherfucking Animal\n\nI'm a hustler, not by choice (5x)\nI'm a hustler\nI'm a hustler", "year": "2002-06-11"}]}