{"artist": "50 Cent", "songs": [{"album": "The Kanan Tape", "image": "https://images.genius.com/7fcd2b52ce6617033572ef90e82560d9.800x800x1.jpg", "title": "Nigga Nigga", "lyrics": "[Verse 1: 50 Cent]\nSo what you sayin', boy? You a shooter, boy?\nNigga, we don't care who you shot\nNigga, quit talking money 'round rich niggas\nNigga, we don't care what you got\nBitch, I got six niggas that hit niggas, boy, I don't give a fuck\nEspecially when I'm lit, nigga, real shit, nigga\nSend a bitch to line you up\nBoy, I don't chit-chat when I click clack\nI might ask a nigga, \"What's up?\"\nPull off in an Aston, pull up in a hooptie\nThen you fuck-niggas getting fucked\nTalking 'bout rapid-fire, automatic, brrrrrt, bang\nNigga, hit everybody, I said everybody\nLaying right there where they stand, nigga\nNigga, nigga, nigga, nigga, nigga, nigga, you ain't sprayin' nothing, you ain't laying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\n'Til you do something, niggas out here putting that work in\nAnd I'm cool, nigga, like that cup I put my purp in\nYou ain't 'bout the strap, you ain't 'bout that knife, you ain't 'bout that life\nYou ain't 'bout that, that gangsta shit, you ain't 'bout that\nWhen it's on we'll have you broad day or night, you ain't 'bout that, right?\nYou ain't 'bout that life, that gangsta shit, we 'bout that\n\n[Hook: Boosie Badazz]\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\n\n[Verse 2: Boosie Badazz]\nThey're not GGA, you play, I'm gon' see what's happening with ya\nI don't talk it out, don't rap about it, I'm not these rap niggas\nGot a maniac mind-state, will increase the crime rate\nMe and every nigga on my team got a bathroom, bitch, try me\nYou ain't sayin' nothin', that's Twitter talk, I'm from where real niggas walk\nCrackers tried to lynch me, but couldn't get me cause I'm real smart\nHeart of a lion, what that mean? I got a big heart\nCertified in style, been like that since a lil' boy\nNigga, who you talking to? You know what I'll do to you\nTransvestite your bitch-ass, make you work out in a hula hoop\nStreet king, Boosie, boo, did things that turn you Christian\nLet it burn, fuck the consequences, what you saying? I'll burn you\nBitches to the ground with no mercy, I promise you\nFrom Baton Rouge to Cashville, niggas gon' ride for Boos'\nSo what you saying? Yeah, don't tell me, you don't wan' see my mind twisted\nOh, you pussy talking like these bitches, when I see you that's your issue, nigga\n\n[Hook: Boosie Badazz]\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\n\n[Verse 3: Young Buck]\nFresh out these handcuffs, dopeboy fucking these bands up\nThick bitch, watch when she stand up, she just bounce, nigga, nigga, nigga\nI'm brick money, my nigga nigga, you an ounce, you ain't shit, money\nI'm rent money, I get money, a bitch better get what she can get from me\nGot tats all on my body, my paperwork coming back clean\nMe and Boosie just tryna help B.G. get through his fourteen\nI don't want liquor, I just want lean, I caught two bodies on four beams\nI gotta slow down (fuck that shit, we home now), well nigga, nigga, nigga\nIt's going down, point 'em out and I'mma point blank it, point blank\nI will have you emptying everything you have in your bank\nBitch, I ain't get no visits, I just done my time, ho\nBought your bitch so many bottles turned into a wino\nStomp a nigga, nigga, nigga, nigga ass out in these Giuseppe's\nAll my bitches on par, all my niggas got felonies\nDon't do that, you ain't 'bout that, you don't sell that, you don't count that\nYou might grew up being around that, you weren't there where we was gettin' down at\nLil' nigga (lil' nigga, lil' nigga, lil' nigga)\n\n[Hook: Boosie Badazz]\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga you ain't saying nothing\nNigga, you ain't saying nothing, nigga, you ain't saying nothing", "year": "2015-12-09"}]}