{"artist": "C-Murder", "songs": [{"title": "Riders", "album": "Life Or Death", "year": "1998-03-17", "image": "https://images.genius.com/dd9b12b56387cac0b0c8ab7e7315ade3.200x200x1.jpg", "lyrics": "[C-Murder]\nNiggas (what?)\nWould you ride for the cause? (hell yeah!)\nWould you die for the cause? (fuckin right!)\nHow many niggas down to ride for me? (we riders!)\n\nMy name manifest pain to my enemies\nHoller C-Murder and bring bitches to thier knees\nViolent killers ready for blood marches\nConvicted murderers with open drug charges\nStrapped with semi autos and po-po's\nAnd nickle plated slug nose and we left the Calli cause\nWe made niggas, raised in ghetto's and slums\nTotin chips and A-K's, 100 round drums (ha)\nShoot first, and leave them standing in thier shoes\nWe TRU niggas, bounded by blood and tatooes\nInfiltrating my click, fool it ain't gonna happen\nUs niggas been gettin paid before we started rapping\nSituation getting sticky, call my dawgz on the phone\nHere comes the brigade, aiming straight for your dome\nAin't No Limit to the motherfucking thang, we a click\nWe rowdy, many niggas in the TRU click\n\n[Hook]\nWe riders\nNo Limit niggas\nWe riders\nWe TRU niggas\nWe riders\nWe real niggas\nWe riders\nWe thug niggas (2X)\n\nHow many niggas wanna ride and get paid\nI plan to sell a hundred million records in four days\nGangstas make the world go round\nBut TRU niggas make gangsta shit go down\nWe come in your set flip your dope and get rich\nTake over your block and your spot with number one hits\nMoney and power, ha, give me the world\nCause after dollars no cents, only time will tell\nHa, I'm goin through somethangs, fool, so stop hatin\nYou live for weed and money, I live for greens and bacon\nAnd I ain't takin no shorts with my ghetto d\nI stick to plan B and keep my eyes on my enemies\nAnd if you want some nigga come and get some\nWe ride bourbans and llacs when its time to attack\nSo throw em up if you a real soldier\nI'll make you say uhhhhh, I thought I told ya\n\nChorus 2X"}]}