{"artist": "6LACK", "songs": [{"album": "East Atlanta Love Letter", "title": "Pretty Little Fears", "lyrics": "[Verse 1: 6LACK]\nDo better, who better?\nYou better? Been around, like hella, propellers\nWanna know who you with, don't tell 'em\nCome on fellas, that ain't none of your biz'\nGot on your body suit, you know I'm on your ass today\nWould you let me hit it thrice if I asked today?\nShe know my stick nothing but magic babe\nI be swinging it back and forth, 'til you in your casket, bae, mm\n\n[Pre-Chorus: 6LACK]\nGirl, you want my best side, mm\nBet she from the westside, mm, mm\n\n[Chorus: 6LACK]\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you want\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears\n\n[Verse 2: 6LACK]\nOkay, say it loud, say it proud, you want it more\nWe open door, hit the couch, then the floor\nI cut it up, like a scissor, love galore\nShe never bored, there's so much shit we can do\nYou free to say whatever, baby, if you askin' me\nNo limit when I'm in it, got a Master P\nI'm hoping I don't have a fast release\nGot me focused like I'm out here tryna get my Masters see, mm\nThrowin' up the peace sign, mm\nGirl, I'm from the Eastside, mmm, mmm\n\n[Pre-Chorus: 6LACK]\nGirl, you on my best side, mm\nSay she from the west side, mm, mm\n\n[Chorus: 6LACK]\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you want\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you want\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears\n\n[Verse 3: J. Cole]\nI'm lovin' your light, vulnerable\nLettin' your guard down, it's honorable\n'Specially when the past ain't been that\nFriendly to you but there’s magic in that\nYou the flower that I gotta protect\nTo keep alive in the winter time, ayy, don't you die yet\nYou been way more than a friend of mine, we more like fam\nI raise you, you raise me, let's turn this whole life 'round\nYou can confide in me\nI could take the weight up off your shoulder blades\nAnd try to store the pain inside of me\nLike why the world do you like that?\nLike they don't know you God-sent, but me, I view you like that\nI'm sneakin' glances thankin’ God that he drew you like that\nBeautiful black child, come and shed your black cloud\nFor your vibe and your smile, I don't mind a lil' rain\nI'm your dog, ears perk up at the sound of your name\nCount on your main, wildfire, can't handle your flame\nDownload your shame, wild high, come drown in your fragrance\nYou that red pill that a nigga found in the Matrix\nBefore I had you this shit was fantasy\nYou plant a seed to grow some roots, a branch and leaves\nBecomes a tree of life until our nights are filled\nWith peace from stress and strife\nAnd that's the blessing that I get from wifing you\n'Cause you entrusted me with the key to your heart\nBeating you smart\n'Cause even though I need a new start\nDue to my past transgressions, you believed in me\nI guess the light I see in you is what you see in me, Lord\n\n[Pre-Chorus: J. Cole]\nSay she from the west side, mmmm\nAnd she seen my best side, mmmm, mmm\n\n[Chorus: 6LACK]\nNow I just wanna know\nDon't you sugarcoat\nI'll say it all if you want\nNow could you tell me like it is?\nPretty little fears\nMusic to my ears", "year": "2018-09-14", "image": "https://images.genius.com/68d505210dfe645f563d657a5dd75757.1000x1000x1.jpg"}]}