{"songs": [{"image": "https://images.genius.com/a7e990f0bc468cba699c9556d1af08e8.999x999x1.jpg", "lyrics": "[Intro]\nHello?\nNigga, pick up your phone!\nWhy you ain't been answerin' your phone?\nOld bitch ass nigga\nYou is not motherfuckin' Rakim with yo little ass\nAnswer the phone, nigga\nDamn, damn, there she go again\nI ain't [?] ass anyway, just a bitch ass nigga\nYou got the game fucked up\nPick up your phone\n\n[Chorus: U-God & Method Man]\nI'll be here no matter what you do, no matter what you say\nI'm havin' problems with a jealous ex\nI know she listenin' but F it that\nI'll be here no matter what you do, no matter what you say\nI know she listenin' but F it that\n\n[Verse 1: U-God]\nI'm havin' problems with a jealous ex\nHack my phone, blowin' up my texts\nIt's like she watchin' when I'm havin' sex\nI know you listenin' but fucker that\nShe always sweatin' who I'm fuckin' next\nBut she sweatin' out her hair with her friends at the disco tech\nI slide through the 'jects and she gets upset\nWe ain't fucked in years, why you on my neck?\nDidn't rock up north with the kid\nWhen he did a bid for bricks and things\nWhat I should've did was never threw the dick on her\nNever should've spent on her, steak dinners\nAlways in the crib with them fake niggas\nI'm eight figures, get richer\nThots assure yourself why you hate a winner\nOn my DM but you just a BM\nWhat you wanna be him? Never that\n\n[Chorus: U-God & Method Man]\nI'll be here no matter what you do, no matter what you say\nI'm havin' problems with a jealous ex\nHack my phone leavin' text message after text\nIt's like she watchin' while I'm havin' sex\nI know she listenin' but F it that\nI'll be here no matter what you do, no matter what you say\nI know she listenin' but F it that\n\n[Verse 2: U-God]\nThese girls of the world ain't nothin' but trouble\nThe quest for paper keep me locked in the bubble\nIt's that Richie Rich, scoop it up with a shovel\nTook a look at my financial, it's time to double\nWould you love it if I crumbled, hah?\nBet you love it if I stumbled, hah?\nSwear, I hate this bitch, I know she follows me\nI know this little hood booger wanna swallow me\nAnd I almost caught a felony, she trouble\nWhen she keyed a whip, had a fit, through a brick through the crib\nDisrupt my shit 'cause she saw a chick\nIt ain't shit boom bip, think nothin' of it\n\n[Chorus: U-God & Method Man]\nI'll be here no matter what you do, no matter what you say\nI'm havin' problems with a jealous ex\nHack my phone leaving text message after text\nIt's like she watchin' while I'm havin' sex\nI know she listenin' but F it that\nI'll be here no matter what you do, no matter what you say\nI know she listenin' but F it that\n\n[Verse 3: Method Man]\nShe hit 'em, nut, then it's seven next\nSee, I'm just tryin' keep it real, but on the real, I wish we never met\nGettin' them feelings then she get upset\nIt's been a minute since we had any dealings, what, you ain't get it yet?\nTrick, you never should've cheated on the kid but you did\nGave up the rib, you pig\nWhat you shoulda did was\nNever shoulda crept on me\nNever shoulda lept on me, chow, beat it\n'Bout to get some chicken and some side pieces\nMighta even skeeted on that Tempur-Pedic\nMaybe I'm shady and slim, holy Slim Jesus\nYou know I mean it, why you holdin' grievance if all you want is penis?\nNeva that\n\n[Chorus: U-God & Method Man]\nI'll be here no matter what you do, no matter what you say\nI'm havin' problems with a jealous ex\nHack my phone leaving text message after text\nIt's like she watchin' while I'm havin' sex\nI know she listenin' but F it that\nI'll be here no matter what you do, no matter what you say", "title": "XXX", "year": "2018-03-30", "album": "Venom"}], "artist": "U-God"}