{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Verse 1 : Rich Homie Quan]\nHeard I got a house in and a couple acres, burning down the house just got off probation\nKush blunt blowin, keep em in rotation, hunnid thousand one make a bitch go crazy\nBetter watch your tongue you know a nigga can't save you\nJust got bond, u ain't know a nigga made it, same night to same flake the night I got paid\nDid a lil show 50,000 down on the stage, heard a fuck nigga wanna feature gotta wait\nYou say I wasn't eating , but u still ain't gotta plate\n$10,00 mink got a nigga like aye, titanium  sink. got fish In a tank\nRollin up weed ,fillin  up my bank, told the bitch to leave cover up my name\nI know she don't see it, it don't draw alot of pain, better pray your shooter got aim\nCause this gun I'm bustin' got a body on it, and I ain't gotta  bust I got a lot of homies\nAnd I been geekin' all day that nigga scottie on it, I probably   somewhere wit a bitch\nWit a lot of money, amd I got a rifle on me , got it on ???\nLike I got a diaper  on me ,I know I'm a minor , she said she wanna see the house\nSo I give it a tour, don't give it a most , I give it amour\n\n[Verse 2 : Offset]\nMe and young rich homie got money in the shoe box, choppa  red Dots on your your body\nLike chicken pox screaming for my enemies feeling like 2Pac\nOffset a classic like I was wit rebok, Young rich homie the hashtag, we pullin  the drop like hash back\nYou niggas, is ducks like Aflac twenty 14 sellin 80 crack.  Giuseppe stepper, black and white diamonds\nSalt n peppa, Me and Quan goin  in wit no effort,  Louie  shoes come and play checkers\nStep on you niggas like welcome matts, Smokin Keisha Cole heart attack\nWe makin hits Derrick Jeter back. You payin  these bitches  to lick the cat\nThe difference between me you and quan, We got 50 acres worth of lawn\nBut we all grew up in the fuckin slums. Fuck nigga pussy boy  bumm. Why is the Kush smellin  like underarm\nWhy is yo bitch keep lickin  my charms. Why the fuck you ain't got no damn arm.  Dope 50 hunnid\nI trap all the country, got a Banana  clip for all of the month.Zebra Louboutins\nCall it jumonji, money long, longer then bungee '\nHehehe you funny", "title": "Flow", "year": null, "image": "https://images.genius.com/334dc3565e640f1df6f809a163903cad.1000x1000x1.jpg", "album": null}]}