{"songs": [{"title": "Da Real HoodBabies (Remix)", "album": null, "year": "2019-05-28", "image": "https://images.genius.com/bd4ff046b675b007635083cc6f286371.1000x1000x1.jpg", "lyrics": "[Intro: Lil Gotit]\nUh\nB-B-Bankroll Got It\n\n[Chorus: Lil Gotit]\nH-O-O-D (Hood), B-A-B-I-E-S (Baby)\nI'm the real Hood Baby (The real one)\nBitch, it's tatted on my neck (Tatted)\nI laced it up (Uh), in my Nike shoes and ran up a check (Go get it)\nGot monkey bullets in this TEC (Brr), and it's takin' off your neck (Gah)\nShots in the middle, might hit a flip (Boom)\nTalkin' real crazy, he caught a dip\nNatural big booty bitch, you thought it wasn't real (Damn)\nPussy tasted like candy and I caught it at Phipps (Let's go)\nBoy, make a movie, don't gimme no lip (Movie)\nSuperstar status, got hoes in the VIP (Superstar status)\nKeep shit trill, boy, you ain't real\nEverything goin' up like a motherfuckin' hill (Talk to 'em)\n\n[Verse 1: Lil Gotit]\nHit it from the front, then I grab her by the neck (Uh)\nNutted on her face, yeah, Gotit left a mess (Uh)\nThen she let the shit drip down to her chest (Uh, uh)\nBitch, I want M's, I ain't talkin' 'bout necks (Let's go)\nDo one, kingpin, it's on to the next (To what)\nThey askin' who steppin' shit, come get stretched (Me)\nToo high, half a Percocet, gon' balance it (Uh)\nGot a bag, move out the hood to Buckhead (What)\nIt's a show, Rio hit my phone like he book me (Rio)\nWhat the hell? Fat geeked up, smokin' cookies\nGivin' hell, these niggas ain't nothin' but some rookies (Huh)\nThey say I ain't a killer, lil' nigga, just push me (Woah)\nAMG Benz geeked up, it's pushin' (Skrt)\nStickin' to the T, I ain't talkin' 'bout Pusha\nCut the cap talk, all the could've, would've, should've\nSmokin' Backwoods, we don't roll no Swishers\n\n[Chorus: Lil Gotit]\nH-O-O-D (Hood), B-A-B-I-E-S (Baby)\nI'm the real Hood Baby (The real one)\nBitch, it's tatted on my neck (Tatted)\nI laced it up (Uh), in my Nike shoes and ran up a check (Go get it)\nGot monkey bullets in this TEC (Brr), and it's takin' off your neck (Gah)\nShots in the middle, might hit a flip (Boom)\nTalkin' real crazy, he caught a dip\nNatural big booty bitch, you thought it wasn't real (Damn)\nPussy tasted like candy and I caught it at Phipps (Let's go)\nBoy, make a movie, don't gimme no lip (Movie)\nSuperstar status, got hoes in the VIP (Superstar status)\nKeep shit trill, boy, you ain't real\nEverything goin' up like a motherfuckin' hill (Talk to 'em)\n\n[Verse 2: Lil Baby & Lil Gotit]\nI went to Baby, the bitch won't forget it\nOne of the members, I'm part of the set\nMy lil' boy 3, I just gave him a 'Vette\nThe backend too big so they sent me a check\nDon't want your number, I only want sex\nIf she don't give me head, I'ma cut off her neck\nYou get an F and an N if you test it\nThey hate to say it, I'm one of the best\nIf she tried to curve me, I fuck on her bestie\nI told Lil Gotit he gotta be next\nYou don't get points if you fuck on my ex\nYou don't do work, you for real? I'm like, \"Next\"\nI'm runnin' laps around niggas, no sweat\nInvested half a ticket on my necklace\nI'm with the slime, this shit can get treacherous\nI don't want no green, I only want red\nI only want beans? Bitch, I ain't green (Yeah)\n\"Do you want a Perc?\" Hell yeah, that's me (Oh yeah)\nBitch, I'm the baby, Hood Baby, yeah, the king (Huh)\nRockstar Gotit, got cuts on my jeans (Huh)\nThat bitch so lit, she pop her a bean\nHow many haters this shit gon' bring?\nShit, how many more niggas' act gon' change? (Talk to 'em)\nBitch, I'm poppin' everywhere, 'jects and cage (Bitch)\n\n[Chorus: Lil Gotit]\nH-O-O-D (Hood), B-A-B-I-E-S (Baby)\nI'm the real Hood Baby (The real one)\nBitch, it's tatted on my neck (Tatted)\nI laced it up (Uh), in my Nike shoes and ran up a check (Go get it)\nGot monkey bullets in this TEC (Brr), and it's takin' off your neck (Gah)\nShots in the middle, might hit a flip (Boom)\nTalkin' real crazy, he caught a dip\nNatural big booty bitch, you thought it wasn't real (Damn)\nPussy tasted like candy and I caught it at Phipps (Let's go)\nBoy, make a movie, don't gimme no lip (Movie)\nSuperstar status, got hoes in the VIP (Superstar status)\nKeep shit trill, boy, you ain't real\nEverything goin' up like a motherfuckin' hill (Talk to 'em)"}], "artist": "Lil Gotit"}