{"artist": "King T", "songs": [{"image": "https://images.genius.com/641a3479424d2748b1235e965b5adbcc.320x320x1.jpg", "title": "Let’s Make a ‘V’", "year": null, "album": "Thy Kingdom Come", "lyrics": "* DJ Quik is credited but only produces the track, does not rap\n\n[King Tee] (Frost)\nHa, you know what?\nQuik, Quik, niggas ain't gon' understand this\nHow did we put this together man? Niggas ain't going...\nKid Frost, what's happening? (What's up loc?)\nGo fuck with these hoes man (Come on Tee, let's do something)\nSome jumping (Hahaha yeah)\n\nI'm looking for a ten, and honey I spends, no hassle\nTryna buy the world while you lay around my castle\nGet you laced with Tennis bracelets as well\nWearing diamonds, carry-on Chanel\nSipping Cristal with Michele while you rolling in my six\nFolks cannot joke that daddy's rich\nNo need to bitch, you want your own whip? Don't argue\nNow you roll a three-twenty E with the guarders\nHit the club scene in a limousine stretch\nWith big fame shining on your Lex\nNo more county cheques, with the King with that bomb sex\nAnd sweetheart you never know what's next\nCheck, the homies in the hood say my cape's on flight\nBut we be smoking eighths all night, and that's alright\nShake a lil ass, I'll bite\nSpend a little cash I might, just make sure...\n\n[Hook: El DeBarge] {X2}\nLet's make a V tonight and do it to the morning light\nCause I wanna take my time to do this thing to you\n\n[DJ Quik]\nYou hear your lady whisper bout me and you wanna scrap about it\nSee I wear Versace too but I never rap about it\nWear my Rolex tucked with me near my cufflink Bernini\nA woman show me promos of her pose in some bikini\nKid Frost'll tell you girl, you know who we are\nSipping on some white straw, dipping in a white car\nTryna make a V, and if you don't get it that means to hit it\nSplit it, and don't be playing with it\nWe ain't nothing but playboys, it's a lifelong gift\nAnd I'mma be a player till I can't get a stiff\nAnd now we're talking autographs, tears and laughs\nChampagne with King Tee, going platinum on Aftermath\nI'm parking the Benz baby, let's get a silver spur\nAnd go out on a double date, you, me and her and her\nGot you all covered cause I got a three-pack\nBreak a mountain, pulling backs the shaft\nNow let's do that...\n\n[Hook: El DeBarge] {X2}"}]}