{"songs": [{"year": "2015-01-05", "album": null, "image": "https://images.genius.com/df200f0df791bb81fccdd2ca5bd75578.1000x563x1.jpg", "title": "Coco (Remix)", "lyrics": "[Intro]\nI mean, I want talk some shit, I mean\nI mean, what the fuck a nigga thought?\nBaking soda, I got baking soda\nPull up in a Rarri\nWait, hol’ up, I’m trippin’\nLet’s start this bitch over\n\n[Verse 1]\nPull up in a foreign\nHol’ up, that my stripper\nYou know we be thuggin’\nMy bitch’ name Ferrari\nGo get yo cousin, cuz Gunna gon’ fuck ‘er\nClutchin’ the 4-4, in luv with the coco\nDo yoga like cocos, she knows we be ballin’\nBread winner, rich rap, got the game in the clinch\nTreat that we twitch, just came with the stitch\nNip Hussle got a nigga on a marathon\nHol’ up, think I left the pistol in the carry-on\nBig booty, big booty, bitch, real big booty\nWe don’t talk to the cops, with this steal we shootin’\nPants sagging with the belt sike, nigga wearin' joggers\nRed on yo head have it matchin your bottoms\nCame ‘im outta prison, nigga, I ain’t have a dolla\nLay up on the snowflake, run up on the whole thang\nTrap house, beach straight, drop out the cocaine\nDrama street nigga, I’m a blood that rollin’ cocaine\nGet it back to Jordan's, goin’ harder with dope game\nLet em get a peak, take off with the propane\nI don’t get tired, give a fuck what a ho think\nDrop dick, drive, need money for the whole team\n\n[Hook]\n73 Chevelle, put that bitch together\nI’m married to the money, shit, we live together\nBaking soda, I got baking soda\nBaking soda, I got baking soda\nLingo, she like the way that I be talkin’\nShe want a Bread Winner street nigga who retawdid\nSix cell phones, I'm like who the fuck is calling?\nShe want a Bread Winner, street nigga who retawdid\nStreet nigga who retawdid, street nigga who retawdid\nBaking soda, I got baking soda\nBaking soda, I got baking soda\n\n[Verse 2]\nPurse with the Yola, she straight outta Tampa\nI love her, her skin look like soda, meant to say cola\nTurn up with my youngin, he think I don’t luv him, I know it\nLike to get loaded, fuck it, drop off a brick to Lil Mocha\nLet ‘em get weed, shit, I ain’t gon lie prolly rollin’ and smokin’\nOpposite soda, 40 ounces I’m droppin a 4 in a (cola)\nMy lil partners, they likin’ em Xans\nBreak cal off a coffin syringe? ? ?\nMight lose ya, keep up if ya can\nBam bam thank you ma'am imma scram\nThey be lying they sellin' no sand drops\nDrop soft, it get hard you can't break it by hand\nCome here boo, make it bounce like spalding\nMake it bounce, make it bounce like spalding\nMake it bounce like spalding\nShe got a Bread Winner, and she say that he retawdid\n\n[Chorus]\n'73 Chevelle, put that bitch together\nI’m married to the money, shit, we live together\nBaking soda, I got baking soda\nBaking soda, I got baking soda\nLingo, she like the way that I be talkin’\nShe want a Bread Winner street nigga who retawdid\nSix cell phones, I'm like who the fuck is calling?\nShe want a Bread Winner, street nigga who retawdid\nStreet nigga who retawdid, street nigga who retawdid\nBaking soda, I got baking soda\nBaking soda, I got baking soda"}], "artist": "Kevin Gates"}