{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": null, "lyrics": "[Verse 1]\nOh wow, it's me, how you like me now?\nYeah I'm still on the scene, and you don't know how\nBlah, blah, blah, blabber, bragger, bold ceremony master, chains snatcher, thug rapper\nFrank Sinatra Ratpacker, not the Rawkus backpacker\nI'm back at you like \"don't they know I'm the wrong dude to fuck with?\"\nI'm the dude all the rappers had bad luck with\nIn fact fuck bad luck, they all hate my guts\nCause they sell more records, but I fuck more sluts\nNow let's get off that topic, let's see who the most obnoxious is\nWho rocks shit, who got it locked, shits stopping\nI'm rap's all time infamous underdog\nAre you still pissed that I fucked your board?\nAre you still pissed that we fucked that whore?\nWould you call the cops if I bust your jaw?\nSuburban, I get diggey-dumb\nThe history of rap, white boy, name one better that's not warned\nI get dumb\n\n[Hook]\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\n\n[Verse 2]\nOh yes yes, it's true, I'm back with more shit\nEverytime I record shit\nIt's some get butt-naked fucking-your-whore-shit\nThought I lost it, cause I signed to a label and got kicked off it?\nVH1 will never do my behind the scenes\nCause it's way too explicit for your TV screens\nI'm like \"Can we please talk about me a little more?\"\nAnd why I don't sell out and I stay hardcore\nAnd why I never did a video for TVs\nAnd never bought a beat for more than 3 G's\nAnd never put an album out, not one year\nI don't give a fuck about my career\nYeah, people talk about me like they know my ass\nBut where the fuck was you when I had no cash?\nOh wait, I forgot, I still don't got none\nHope my album gon' blow up, if I ever drop one\nI'm allergic to worship, perfect\nYou can hurt quicker than Trevor Burbick hurted\nIce Cube, Daddy Kane, Hollywood burning\nBitch scream when the dick's inserted, remember where you heard it\nI get dumb\n\n[Hook]\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\n\n[Verse 3]\nYes yes y'all, y'all know the Rugged Man is the best ya'll\nTop 5 lyricist, no less ya'll\nFunky fresh ya'll, I be the D-I-double B-S y'all\nWondering where handicapped Rugged Man be at?\nThey like \"Ain't he fell off?\"\n\"Oh no, he can't be back\"\nSo you're like \"Yeah right he did that? No, he didn't, did he?\"\n\"You heard that Mr. Cee best of Biggie?\"\n\"Yeah, that kid he's a real sicky\"\nB-U-B, R-U-G, we like Doug Fresh, Slick Ricky\nBon-stickity-bon-hon, gon' cock-riggedy-run\nAsk Das, I get diggedy dumb\n\n[Hook]\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb\nDumb, du-du-dumb, du-dumb, dumb", "title": "Dumb", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}