{"songs": [{"title": "Operation Push", "image": "https://images.genius.com/bc93d9a1f10bf994d92790c0d8a53c75.1000x1000x1.jpg", "lyrics": "[Intro]\nTo my big brother Slug. Rock the house\nAnd my main man Ant yo. Rock the house\nTo my best friend Murs man. Rock the house\nTo my man Blueprint brother. Rock the house\nTo my guy Mr. Dibbs dude. Rock the house\nTo my girl Psalm One baby. Rock the house\nAnd my man Vast Aire yo. Rock the house\nAnd my man Immortal Technique. Rock the house\nCheck it out\n\n[Verse One]\nThe first time\nWe dropped a little somethin'\nThey start buzzin' like King Solomon was comin'\nAlbum of the year was the topic of discussion\nOnce you got that little rush it's impossible to touch it\nThen the ground froze and I'm growlin' in the stomach\nUnderground shows I'm devouring the public\nIt's all I know, but I'm a scholar of the subject\nWhere ever I go it's like they follow me or some shit\nI ain't a part of no damn record business\nI ain't got a single fan, I got brothers and sisters\nEvery time they raise their hands they bare witness\nThey listenin' and they know that a man who cares did this\nEver since I'm a pip squeak and can't even pee straight\nHad some shit to speak on a beat break\nGuaranteed to dig a little deeper with each take\nBleedin' on the beat till the meat on my knees shake\nThey call me a beast, I just think I'm the least fake\nI know I'll be alone on my judgment day\nI believe it to the bone what the fuck I say\nMy shit's etched in stone and it's done my way\n\nOne.Be.Lo. Rock the house\nAnd the Brand Nubian crew. Rock the house\nTo the lord Rakim brother. Rock the house\nMr. Lif, Kid Capri. Rock the house\nTo my brother C-Rayz Walz. Rock the house\nAnd my man I-Self Devine rockin' the house\nTo my brother Toki Wright man. Rock the house\nAnd the Los Nativos rockin' the house\n\n[Verse Two]\nIn 2003 I was the number one challenger\nThen years started fallin' off the calendar\n'04 champion, knee deep, kept my balance up\n'05 and 6 I still didn't have an album, fuck\nJay-Z retired and came back\nI'm still out here kickin' the same tracks\nHow in the world am I supposed to explain that?\nExcept that I hastefully chase what I aim at\nAnd the same passion that I put in when I'm kickin' my shit\nI rebuild my entire life brick by brick\nAnd I couldn't tell the story till I knew what the endin' was\nGod give us messages, you better listen when he does\nY'all supportin' me, always there for me\nStill got a babysitter, Pager Money came and saw me\nI give you my life\nJust give me an hour of yours\nCheck the album\nCheck us out on the tour\nI never go to song without an album no more\nIf you ain't got the money steal it from the popular store\nIf you take away one thing just know above all\nI ain't rich, but I'm livin' and I owe it to y'all\n\nSo Minneapolis. Rock the house\nAnd yes St. Paul. Rock the house\nAnd Chicago, Illinois man. Rock the house", "year": null, "album": "Off the Record"}], "artist": "Brother Ali"}