{"songs": [{"image": "https://images.genius.com/f3dc932dcf3a3d218d8e387297bf5afe.1000x1000x1.jpg", "title": "Leave Me Alone", "album": "The Search", "year": "2019-07-26", "lyrics": "[Intro]\n(Yeah)\nHey!\nLeave me alone\n\n[Verse 1]\nPanic-stricken, handle business, not a joke, yeah\nManners missin', travel different, no control, yeah\nTime to listen, time to zip it, keep it closed\nMy description, highly gifted, take some notes, yeah\nLack of interest, why'd you visit? Hit the road, yeah\nI'm kinda twisted, so keep your distance, be a ghost\nYeah, see I'm inventive, but quite the menace, you ain't know?\nWell then I'm offended, let's jog your memories, here we go, yeah\nI went from nobody to kinda famous\nHide my plaques inside the closet, I just can't explain it\nMy wife, she tells me that she's proud and thinks that I should hang 'em\nBut I just leave 'em on the ground right next to my self-hatred\nYeah, yeah, mental health, where's my mental health?\nDiagnosed with OCD, what does that mean? Well, gather 'round\nThat means I obsessively obsess on things I think about\nThat means I might take a normal thought and think it's so profound (Leave me alone)\nRuminating, fill balloons up full of doubts\nDo the same things, if I don't, I'm overwhelmed (Leave me alone)\nThoughts are pacing, they go 'round and 'round and 'round\nIt's so draining, let's move onto something else, fine (Oh) (Leave me alone)\nRunnin' the game, but they don't even know it\nLike I'm undercover and don't wanna blow it\nI come out of nowhere, they don't even notice\nThe flow is so cold, you would think it was snowin' (Oh) (Leave me alone)\nI'm under the weather, but wind isn't blowin'\nI got an umbrella for difficult moments\nYou got to admit it, I'm very devoted\nI'm out in the rain, but it don't always open, so I… (I, I)\n\n[Pre-Chorus]\nHold up my balloons and cover up my face\nI can feel them weighin' on me every day\nI should let 'em go and watch 'em float away\nBut I'm scared if I do, then I'll be more afraid (More afraid)\nTell them how I feel, but they don't wanna change (Don't wanna change)\nTell them how I feel, but they remain the same (Same)\nLoosen up my grip, they say that's not okay\nQuiet, quiet, quiet, quiet, quiet, ayy, leave me alone! (Oh!)\n\n[Chorus]\nAyy, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone!\nWoo, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone! (Leave me alone)\n\n[Verse 2]\nI hate when they debate if we're underrated\nWe're so overlooked that they're lookin' over our numbers, Nathan (Leave me alone)\nWe don't do enough interviews or go out in public lately\nWe don't post enough on our socials\nTo keep the buzz from fading (Leave me alone)\nLet it fade, yeah, let it fade\nOnce it's decimated, then you drop a song outta nowhere\nAnd all the fans embrace it (Leave me alone)\nThen the buzz will surface again, it's part of my operation\nI don't need advice from my doubts right now\nEnd of conversation (Leave me alone)\nShut your mouth, yeah, shut your mouth\nBetter tone it down, close it now\nIf you make a sound, I'ma change the dial (Leave me alone)\nFunny how they be acting loud, comin' unannounced\nIt's floating 'round\nMan, the kid is wild, pretty vile, true (Leave me alone)\nI'm kinda funny but don't really show it\nI keep it together but have a disorder\nI go to my room and I sit in my corner\nAnd talk to myself in a language that's foreign (Leave me alone)\nI think of a rhyme and I have to record it\nBut know if I don't, I'll wake up in the mornin'\nAnd question my life again, always avoiding\nI hate to be different, but hate to be normal, so I... (Leave me alone)\n\n[Pre-Chorus]\nHold up my balloons and cover up my face\nI can feel them weighin' on me every day\nI should let 'em go and watch 'em float away\nBut I'm scared if I do, then I'll be more afraid\nTell them how I feel, but they don't wanna change (Wanna change)\nTell them how I feel but they remain the same (They remain the same)\nLoosen up my grip, they say that's not okay\nQuiet, quiet, quiet, quiet, quiet, ayy\nLeave me alone!\n\n[Chorus]\nAyy, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone!\nWoo, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone!\n\n[Verse 3]\nRemember back in \"NO NAME,\" I said fame called? (Yeah, yeah)\nTold you I hung up, it kinda felt wrong (Leave me alone) (Wrong, wrong)\nFinally called him back, we didn't talk long (No)\nHe asked me how I'd been, I sent him this song (Leave me alone, quiet, quiet, quiet)\nYeah, think he took offense, he kinda seemed off (Off)\nI texted him that night to ask what he thought (Leave me alone, quiet, quiet, quiet)\nIt took a couple days to get a response\nBut once I finally did, he said this song sucks (Leave me alone, quiet, quiet, quiet)\nFeel the symptoms, couldn't miss 'em, wrestle with 'em\nThen I pin and flip 'em, brought some back up\nNo, well, you should get some (Leave me alone, quiet, quiet, quiet)\nWho you dissin'? Mood is switchin', don't come in the kitchen\nYou should listen, cookin' record for my hands are blisterin'\nSo persistent, don't forget this, hold the tension, soul is bendin'\nNo pretendin', open-ended, low percentage, so demented (Leave me alone)\nWhole consensus, flow tremendous, no apprentice, dope incentive\nShow intensive, so possessive, tone aggressive, watch your step when I... (Leave me alone)\n\n[Pre-Chorus]\nHold up my balloons and cover up my face (Up my face)\nI can feel them weighin' on me every day (Yeah, every day)\nI should let 'em go and watch them float away (Yeah, float away)\nBut I'm scared if I do then I'll be more afraid\nLeave me alone (Yeah), leave me alone, yeah (Yeah, yeah, yeah)\nLeave me alone, leave me alone (Yeah, yeah, yeah)\nLeave me alone, leave me alone (Yeah, leave me alone)\nYeah, leave me alone, leave me alone, ayy, leave me alone!\n\n[Chorus]\nAyy, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone!\nWoo, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone!\nAyy, yeah\nQuiet, quiet, quiet, quiet, ayy (Yeah), leave me alone!\nWoo, yeah\nQuiet, quiet, quiet, quiet, ayy\nLeave me alone"}], "artist": "NF"}