{"artist": "Warren G", "songs": [{"year": "1997-09-03", "lyrics": "(Album Version Dirty)\n\n* Intro Ooh, yeah, yeah\nWhat's love got to do\nWarren G, rap for me, yeah-eah, yeah, mm mm\n\n* Verse 1\nWhen G-dog, the hog, come up in the place\nIt's dollar signs in your eyes and a smile in your face\nYou wanna live fat, off of my sack\nYou got more drag than a low lo-do, cut the act\nCause back before '92 and '93\nYou didn't give a damn about Warren G\nBut now that I'm slingin' platinum LP's\nAll of a sudden, you on my N.U.T's\nAin't nothin' you can do to make it stop\nCause money makes the world go 'round and the panties drop\nI ain't in love though, I don't need the pressure\nI just wanna dig it like I'm diggin' for treasure\nSome of y'all had a good thing that you couldn't keep\nThought you was TLC, you had to creep\nYou say you had love, I said you bullshiting\nIt's all about the dough, so what's love got to do with it?\n\n* Chorus What's love got to do, got to do with it (that's right)?\nWhat's love if you don't respect the game (uh-huh)?\nWhat's love got to do, got to do with it?\nIf you lack in this game, it's a shame, you won't make it\n\n* Verse 2\nNow, I'm the type of brother that's down for mines\nBefore I made beats, I was down the grind\nBack then, every single homey had my back\nNow they're peepin' my stack and they're talkin' bout jack\nBut I'm the same brother day in and day out\nAnd I'm-a stay that way until the day I lay out\nIn a casket, it's drastic, cause homies is plastic\nBreak 'em off some bread, they want the whole damn basket\nIf you's a true homey, you would wish me well\nNot plot to make a brother bail, jealous as hell\nWe used to get the same riches\nNow your trigger-finger got the itches, schemin' on my riches\nWhich is, not a suprise, my eyes peep game\n211's, 187's it's all the same\nIt's all a shame, homies'd jack you for your grip\nAin't no love involved, because it's all about the chips\n\n* Repeat chorus\n\n* Verse 3\nNow for these labels tellin' fables\nMakin' the fucked-up deals under the tables\nYou think that you smart, but, fool, I'm the smartest\nYou can't make no money if you can't keep an artist\nSign the dotted line, put 'em on the shelf\nBreak 'em off some crumbs, keep the rest for yourself\nI know how it goes, treat an artist like a ho\nFly cars, gold, clothes, but no dough\nSince it's all business, I'm-a handle mine\nKeep track of my stack down to the very last dime\nCause in this rap game, it's all about the buck\nYou bend over for the label and you will get fucked\nLike how we run up in them trick, and then you're through\nThe record label do the same shit to you\n90% business, 10% show\nAin't no love in this game, cause it's all about the dough\n\n* Repeat chorus", "image": "https://images.genius.com/673c8284612298f991436f6d6152c12a.600x600x1.jpg", "album": "Take a Look Over Your Shoulder (Reality)", "title": "What’s Love Got to Do With It"}]}