{"artist": "Fashawn", "songs": [{"year": null, "album": "Boy Meets World", "image": "https://images.genius.com/4eb0769f2fa647dc2e26d40d1390094b.1000x1000x1.jpg", "lyrics": "[Intro]\nFor all my shorties out there, if you've ever been discouraged. Somebody told you you can't do nothing. It's all up to you, you can be whatever you want; a doctor, a lawyer, a physician, a nurse... The world is yours\n\n[Verse 1: Fashawn]\nHold on to your dreams 'til they come true\nDon't let them tell you what you can or can't do\nI know it's hard trying to make it on your own two\nSurviving, at the same time going to school\nAnd trying to pay tuition by washing dishes\nIt's all part of being self-sufficient\nLook for a shooting star and you keep on wishing\nWho's to say 5 years from\nNow where you'll end up?\nCEO of your own business\nOr, a movie star an award winner\nGotta, go for it can't be timid\nNah, live out the phrase the sky's the limit\nUnderstand everything began with a vision\nSome hard work and a thing called\nIntuition\nThat's, when you feel you're at you're lowest and you're about to collapse\nAnd let you know you're on the right track sing along\n\n[Hook: Aloe Blacc]\nHey young world (Hey young world)\nThe world is yours, the world is yours\nHey young world (Hey young world)\nYou can aim for the stars you can climb you can crawl\nHey young world (Hey young world)\nThe sky's the limit, the sky's the limit\nHey young world (Hey young world)\nThe world is yours, the world is yours\n\n[Verse 2: Aloe Blacc]\nI know it might sound a little bit like preaching\nBut ain't a star in the sky that ain't worth reaching\nAlready done caught a few and threw some back\nI shook them up in my fist and threw them out like craps\nI done seen some fools shoot them up like crack\nAnd then I watched as they're star faded out like (snap)\nCan you find it inside of you, the gift that God provided you\nAnd read the little note he left that says the things you gotta do\nTo make your life a healthy example of his perfection?\nEase with the breeze don't fight life's direction\nIt's gonna be some ups and downs it's no question\nThat the hard times you make it through teach the best lessons\nHe who never tries never fails\nBut if you don't ever try you're a failure, I don't know what to tell you\nFrom God's Sons to Rulers all the new schooler\nB-boys and girls remember it's your world\n\n[Hook]\n\n[Outro: Devoya Mayo & Aloe Blacc]\nYour eyes have slightly opened\nThe sun is widely open\nThe new day is finally here\nNo thoughts of failure your future is clear\nThe young world is now before you\nBecause the old world oh it couldn't hold you\nYou can tell others to sit back and watch it all unfold\nSee young world you must be patient and ready\nAnd it's essential to keep on believing in you\nAnd now your eyes are widely open\nYour dreams are close at hand\nYou may have felt lost once but now you're found see\nThe old, the young, and the new, were always within you\n\nHey young world\nHey young world\nHey young world\nHey young world\nThe world is yours, the world is yours", "title": "Hey Young World"}]}