{"songs": [{"year": null, "album": "Kaleidoscope", "image": "https://images.genius.com/a71480df39b91d0354d2e77e99c39df6.640x640x1.jpg", "title": "Roller Rink", "lyrics": "[N.E.R.D.]\nAy yo while I dream about Fortune 500 man\nHundred grand bracelets\nThe diamonds in my ear only cost as much as a facelift\nWhen the listeners picture this\nThey gon' say shit\nMe and you fucking in the window of my spaceship\nHigh like fuck\nTo all the bitches that I might fuck\nGet to see they would only fuck my life up\nThe flyest couple killin' em suttle\nDelivering our first born on a NASA space shuttle\nCome on\n\n[Kelis]\nHave you ever thought there might be something out there?\nFar out, way out\nWould you think those movies are insinuating?\nLook out, look out\nDo you think you'd even know one if you saw one?\nWatch out, watch out\nIf you think the government just don't nothing\nWatch out, watch out\n\n1 - The roller rink, the roller rink\nJust skate away no need to think\nNo cars and minks, no Gucci links\nNo need for shrinks, just roll the rink\nThe roller rink, the roller rink\nJust skate away you don't need to think\nNo cars and minks, no Gucci links\nNo need for a shrink\n\nIf you see what's coming our way then get ready\nWatch out, watch out\nAin't gonna be no one in bed to put your hands up\nNo doubt, look out\nBetter hide your babies and all of your family\nBeware, look out\nIf you think the government just don't nothing\nBetter watch out, watch out\n\nRepeat 1 (2x)\n\n[N.E.R.D.]\nAy yo, ay yo the whole world gets high\nWhen they hear this Neptune talk\nN.E.R.D. we levitate when we moon walk\nAin't shit stoppin', my laser clip popping\nPullin' up in my NSX with my bitch bopping\nStar Trak we walk around with rockets in our pockets\nMake my fucking dick hard the way my Glock spit\nRemind me of last night got my neck and cock licked\nDaydream, rude awakening she smoking chocolate\nJesus, Simon\nLove roaming like Caesar's time and\nYo Kelis you a breathin' diamond\nIf I'm the sun and your a diamond\nBaby we be shining\nAnd all my hoes gone\nYou blowed them away and the ozone\nSo hot and so rich feeling this ghost tone\nSol nigga and sol bitch\nAccept our foes is gone\nThe world smells is fishy\nBut I smell nothing when your lips kissed me\nGarnier now, fuck is he?\nDon't dare but love me\nKarats stuffed\nStraight up beware of us\nBody in the truck odor it's just scared of us\nThe devil's mad and ain't trying to see the Armageddon\nSo I name our first daughter Nazareth\nMy first son Heaven\nYeah the world is real crazy, huh\nAnd ya don't stop, uh\nStar Trak, Kelis, that's how we do it\nCome on peace, come on\n\nRepeat 1 till end"}], "artist": "Kelis"}