{"songs": [{"image": "https://images.genius.com/87ee57604e02647a0536025394b9daf2.300x169x1.jpg", "year": "2009-11-29", "title": "50 First Dates", "album": null, "lyrics": "[Verse One]:\nI've traded it all for this music shit\nGot an old mic instead of a newer whip\nHonestly, thinking \"Why'd I start doing this?\nWas it to make a couple girls say the dude exists?\"\nMission accomplished\nCause \"Who is this?\" quickly turned into \"I know who you is.\"\n\"I know who you is.\" turned into \"What room you in?\"\nAnd \"What room you in?\" turned into set ups\nThat's how niggas get wet up when you found out that you knew her man\nTo another city, another state\nIt's another pretty, another face\nStart to make you feel like nothing's really great\nAnd that girl that you left back home couldn't wait\nSo I just find myself one day sitting every place I go to\nGo through my whole life over rice and tofu\nSo when we fuck you can't say \"I hardly know you.\"\nEx-girls listening like, \"That shit is so true.\"\nI'm bored/board with the games but I really have no Clue\n\n[Hook]:\nSo if you see me out and about with a girl with a smile you should probably say \"hi\"\nCause by the time you turnaround, I'm up in another town, another girl on my side\nIt ain't like I'm trying to play you\nIf I-I say I'd still date you\nBut I can't move\nAnd I can't choose\nThat's what I can't do\nI wish I could change too, see you are my\n50 first date boo\nYou are my...\n\n[Verse Two]:\nI'd be lying to say I'm not stressed\nBeen on the bottom more than anything\nNow I got this pretty thing topless\nMy guess is, talking to my exes\nI never wrote letters so how can I address this?\nBank account fine, but couldn't pay it no mind\nShe said, \"Love is a battlefield be careful with mines.\"\nYeah, ain't that accessible kind\nBut I would never hurt your heart I'm in my medical prime\nI ain't really picky\nBut one of my problems being deleting numbers of girls or saying the wrong thing\nLike, \"I love Family Guy. And hate South Park.\"\nThat's the kind of shit that makes a nigga not call\nWow\nWe gonna fuck now, let's not stall\nThen what happens after this, I guess we'll find out tomorr\nSeen 50 girls face\nThrough 51 states\nSo this is how I ended up on 50 first dates\nLike I'm walking out the door when I get to her place\nI'm gone\n\n[Hook]:\nSo if you see me out and about with a girl with a smile you should probably say \"hi\"\nCause by the time you turnaround, I'm up in another town, another girl on my side\nIt ain't like I'm trying to play you\nIf I-I say I'd still date you\nBut I can't move\nAnd I can't choose\nThat's what I can't do\nI wish I could change too, see you are my\n50 first date boo\nYou are my..."}], "artist": "XV"}