{"songs": [{"image": "https://images.genius.com/9703948ee40b2385b6c79a5f9eeffec3.700x700x1.jpg", "year": null, "lyrics": "[Intro: DJ Evil Dee]\nUhh, word up, you know what I'm sayin?\nEvil Dee in your area\nThis how it goes down\nRight about now you know what I'm sayin', we chillin' in Bushwick\nWe about to take it down to Boston, you know what I'm sayin'?\nHey yo, check this out, you know what I'm sayin'?\nMy man's about to say somethin'\nAiyyo Ak, check it out\n\n[Akrobatik]\nYeah, (Heat it up y'all)\n(Heat it up y'all)\n(Heat it up y'all)\n(Heat it up y'all)\nCheck, (Heat it up y'all, heat it up y'all)\nCheck one, two\n(Heat it up y'all)\nYo\n(Heat it up y'all, heat it up y'all)\nBust it (Heat it up y'all)\nYo\n\n[Verse 1: Akrobatik]\nThey say it's no such thing as a sure thing\nThat death is the only guarantee that life brings\nWho ever made that up never heard this fact (No)\nAkrobatik brings it every time and that's that\nI've seen so many niggas steady fuck up they chances\nNo timin' to they music only focused on they stances\nBut what's on my canvas, enhances, dances, and advances\nRude boys (Rude boy), can't wait to chant this\nEven in my absence my rap game will render women pantless\nSo many different styles you can't list\nYou tried to crossover, now you shook in your boots\nI made an album with no singin' and I still clocked loot (Still clocked loot)\nTrue to myself boy Ak is no scrub (No scrub)\nAnybody dispute that get no love (No love)\nWhile your singin' 'bout your weenie gettin' hard at the club\nNiggas respect the architect because I wreck every dub\nAll you crackhead rappers better tighten your game up\nThey're gonna forget about you when they writin' my name up\nSleep if you want but remember this fact (What?)\nYou could always bet on Ak (Ak)\n\n[Chorus: Akrobatik]\nIf you need an MC to blow it up and make the crowd react\nYo, always bet on Ak\nIf you got a hot beat and need a brother with some skills on the track\nYeah, always bet on Ak\n\n[Break: Cuts by DJ Evil Dee]\n\"Wanna gamble?\"\n\"Then you can gamble or bet\"\n\"Wanna gamble?\"\n\"Come to Ak's casino, you play Russian Roulette\"\nYo\n\n[Verse 2: Akrobatik]\nYeah, now everybody know I'm on that grown man shit\nThat make moves, reach goals, follow your plans shit\nI'm beefin' with that ignorance that's leavin' us stranded\nAnd shit sound hot when my speed knots is landed (No doubt)\nWho ever thought this young brother from Dorchester\nWould come to be 'The Next Big Thing' like Brock Lesnar?\nI've been compared to a F5 tornado\nDon't get it twisted though, on the mic I'm twice as fatal\nI'm snatchin' rappers up and teachin' 'em humility (Uh)\nOne verse from Ak will crush they credibility\nEvery time they speak they expose their edibility\nAnd get ate up quick inside the rap facility\nAkrobatik signifies agility (Word)\nThat's why I get my legal hustle-on on many levels, you feelin' me?\nYo, you catchin' a Beatminer beatdown from Walt (Walt)\nSo what happens now from this point forward ain't my fault (Fault)\nEvil Dee slice y'all since 1993 (Three)\nHow many DJ's must get dissed for y'all to see? (See)\nYo, sleep if you want but just remember this fact (Uh)\nYou could always bet on Ak (Ak ...)\n\n[Chorus: Akrobatik]\nIf you need an MC to blow it up and make the crowd react\nYeah, always bet on Ak\nIf you got a hot beat and need a brother with some skills on the track\nYo, always bet on Ak", "title": "Always Bet On Ak", "album": "Balance"}], "artist": "Akrobatik"}