{"songs": [{"year": "2017-11-10", "album": "Engraved In The Game", "image": "https://images.genius.com/d2a4d928684e2efa403cd26a8dc80fa5.1000x1000x1.jpg", "title": "Look Here", "lyrics": "[Intro]\nCh-yeah\nIt's the one and only Kerser\nI'm just gonna address some things\nAnd it's like:\n\n[Verse 1]\nI've been on top of the game since I came in this shit\nAmazingly gifted with the pain that I spit\nAnd plus I'm in the winner lane, I ain't have to indicate\nI've got my hands on the wheel and I'm steerin' straight\nI'm a ABK, a twenty-two, a five and, no\nI do it nice, I learn about it, I'll get found by scuba divers\nI'm the truest rhymer slash rapper, ew, and I'm a\nFuckin' headache to a hater, King Kerser crucifier\nThe flow ain't sloppy, I do this shit effortless\nYou're the new king, you're takin' over, let me guess\nI hear that shit every time, it ain't happenin'\nYour gigs ain't even shows, they're more like fucking gatherings\nI sell out massive venues on the regular\nRapping is my bitch and she knows me as a predator\nI took over, pay homage and don't bite my shit\nAnd when you see me, just say hi, no need to ride the dick\n\n[Hook]\nIt's the Kers, spit my shit from the heart, yeah\nThey try and do the same but they ain't got a heart, yeah\nKerser G-strings up your girl's arse, yeah\nIt sold out, the other girls are like \"it don't fit\"\nCan't believe I threw that shit in the hook here\nIf you're lookin' for a superstar, just look here\nEvery time I drop an album, it's a good year\nIt's ABK and we the label that you should fear\n\n[Verse 2]\nI made fucking history, the style they roart\nHalf these street rappers only child support\nIf it wasn't for Kers man, there wouldn't be a scene for yah\nI made 'em open up their eyes, I bleed from the\nFact that the bottom can just rise to the top\nSo give me props [?] unless we're lightin' the lot\nAnd how I brang the mainstream underground, man it's crazy\n'Cause they try do the same but that's the reason why they hate me\nOkay, stop now, I'm thinkin' that's a lame sign\nIt's obvious they love me but they jealous at the same time\nI laugh and I keep gettin' paychecks\nYou stole my shit, you should give me up some payments\nBut they broke, they won't say it in their rap though\nI'm the only one that makes its rapping 'bout a cash flow\nIt sounds silly, talkin' 'bout how you're stackin' cash\nBut you know you're not, you want the scene? You can have it back\n\n[Hook]\nIt's the Kers, spit my shit from the heart, yeah\nThey try and do the same but they ain't got a heart, yeah\nKerser G-strings up your girl's arse, yeah\nIt sold out, the other girls are like \"it don't fit\"\nCan't believe I threw that shit in the hook here\nIf you're lookin' for a superstar, just look here\nEvery time I drop an album, it's a good year\nIt's ABK and we the label that you should fear\n\n[Verse 3]\n\"Okay Kers, what you think about the scene now?\nWhat's it like when you're livin' out your dream? How\nDid it it happen? What's the trick? What you gotta do?\nWhat's your missus' name, I heard you had a baby too\nWhat about your house? I heard you're near the water now\nIs it better than the life you had in Campbelltown?\"\nWhat the fuck? You stupid fuck, don't you ask me shit\nUnless you ask what I like better, arse or tits\n\n[Outro]\nIt's the Kers, spit the shit from the heart, yeah\nKerser G-strings up your girl's arse, yeah\nEvery time I drop an album, it's a good year\nIt's ABK and we the label that you should fear"}], "artist": "Kerser"}