{"songs": [{"image": "https://images.genius.com/604afb6f3e972ce78c052c3aff2e2ff6.400x400x1.jpg", "year": "2011-04-15", "title": "All For Me", "album": "Zero Heroes", "lyrics": "[Produced by Audio BLK & Omen]\n\n[Intro: XV]\nVizzy\nEmo, haha\nYou be the judge, haha\nUh\n\n[Verse 1: XV]\nCan someone tell me who this is all for?\nAnd why I’m on the mirror’s edge, running on walls for?\n20 biddies, one of Vizzy, this shit is uncalled for\nBut that girl with the ponytail should run with the dark horse\nAnd I deserve it, all my life I worked hard for\nThem other cats ain’t going in, that shit is soft porn\nI overcame obstacles like parkour and if I get off course\nIt’s only ‘cause my banking is off shore\nNow I ask for dutches, they give me double like jumping rope\nNever been a virgin ‘cause I was always fucking dope\nDoing something different, I’m getting top in convertibles\nAnd I don’t spend a thing so why do I feel vertigo?\nI be in the cut, tell them girls let’s get surgical\nFahrenheit 451, that paper we just burning through\nCreate money from me to cremate money, I earn it too\nDo this look like work to you? Nah…\n\n[Hook: XV and Erin Christine]\nLooking at the lights like is all of this for me?\nEveryone at night is here, all of this for me\nHands in the air, yeah all of this for me\nBottles over here, all of this for me\nAll of this for me, all of this for me\nLife fast, lights flash, all of this for me\nAll of this for me, all of this for me\nModels bringing bottles, yeah all of this for me\n\n[Verse 2: CyHi The Prynce]\nYou for real? All of this for me?\nPussy, alcohol, and weed, all of this for free?\nWe ball hogging like we balling for the Heat\nI did it first for passion, man this shit at least cost a G\nWarner Brother T.I.G, turn this bitch to Dawson’s Creek\nPapa John’s with the bread ‘cause we in here tossing cheese\nUsed to be broke as hell so I had to drop the streets\nTill I got saved by them bells like I walk the hall with Screech\nCome and get your bitch ‘cause your dog is off the leash\n‘Cause we know how to party man, they call us Boston Tea\nPlus I’m in an outfit that’s as sharp like Jaws’ teeth\nSnuck my rosay out the club, what you think these bottles cheap?\nWith a model that call me baby more times than Monique\nNiggas say I’m outta shape ‘cause my pockets is obese\nI don’t care that’s your girl, all these broads in here are freaks\nDon’t make me pull my arms out like I’m flexing my obliques\n\n[Hook]\n\n[Verse 3: Vado]\nHermes belt with a H buckle, beige bubble\nStopping at her waist as she waits for you, stray bubble\nBut her quiet storm like a tre muffle, age double\nNo forgetting money and straight hustle\nFake muscles get you a off day, denim shirt be from All Saints\nSleeves rolled, I’m in beast mode, don’t get your boys spanked\n30 and your broads think they got money from all banks\nCheck clear okay, we leave and tell ‘em all thanks\nBaking a tall cake, I'mma need a wall safe\nMansion got four gates, three pools and a small lake\nQuick to get it on time, I never call late\nShorty crashed the car, she called me before Allstate\nR-U-G-B-Y, Seagull when you see me fly\nHelicopter’s Petey Pab, Aston Martin DB9\nWe balling, can’t you see?\nDifferent cars at one time, I’m like is all of this for me?\n\n[Hook]\n\n[Outro: Erin Christine]\nNow wait a minute, raise your glass\nLet’s toast to the, toast to the past\nLights flash, let’s be honest, you did all of this for me\nYeah, this shit was all I knew, you and me only\nYou did this all for me, baby don’t you see? All of this for me"}], "artist": "XV"}