{"artist": "C-Rayz Walz", "songs": [{"title": "Dead Buffalos", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nNo mic check?  Oh damn.  Nice\n\n[Verse 1: C-Rayz Walz]\nI see dead buffalos on the plains of the horizon\nElectromagnetic energy fields like M. Bison\nThrough the air flying like black crows in a circle\nBefore the people of the land start dying\nNature's siren.  Even the rivers won't act right\nThe full moon was a flashlight in my past life\nWhen traveling the winding path at night\nUnraveling the blinding blasting site\nChickens come home to roost and find dead buzzards\nLaying next to the head of cousins, sisters and brothers\nFathers and mothers, daughters and sons\nOnly the vultures profit.  I could still see the blood run\nThe slaughter of loved ones hated for being different\nElders were slain, strangled with their talismans\nKilled the body—the spirits started drifting\nDestroyed physically but the souls were ever living\n\n[Hook: C-Rayz Walz] (x2)\n(Thank you!)  For taking my land and food\n(Thank you!)  For raping my women, putting me in a noose\n(Thank you!)  For killing my seed\nGiving me disease, then blaming me (Thank you!)\n\n[Verse 2: C-Rayz Walz]\nI took my Shahada (One) engaged in the drama\nGod against the devils, Shaolin versus Lama\nWe fought felons, clashed with Magellan\nBaby heads were crushed and bust like small melons\nWishing these demons would be baptized or banished\nIn my dream, I woke up in Jamaica speaking Spanish\nThe night the earth cry when the good ship arrive\nBlood on the shores transformed to Crimson Tide\nI built with Crazy Horse, made a black sun spat\nThe smoke shack was beat on by drum bat stack\nThe beetles were baffled by the state of bondage\nShowing love like Pocahontas saving John Smith\nConvinced by the truth of the past, since the body splash\nUsed the Atlantic as a skeleton raft\nUnafraid, I went to a cave to meditate\nAnd talk to my celestial mind and elevate\n\n[Hook: C-Rayz Walz] (x2)\n(Thank you!)  For taking my land and food\n(Thank you!)  For raping my women, putting me in a noose\n(Thank you!)  For killing my seed\nGiving me disease, then blaming me (Thank you!)\n\n[Verse 3: C-Rayz Walz]\nThe land was raped, scorn, torn and withered\nLater on, you will praise portraits of these killers (Cheese!)\nEven made holidays for this unholy act (Happy Thanksgiving)\nI'm the voice of the dead!  You can't hold me back (No!)\nDead buffalos similar to us now\nIn the name of gain, on these plains, we get bust down\nWhat up?  How?  You think there be reparations? (What?)\nWe been touched down, so make preparations (Now)\nUnderwater, holding breath, I dodge piranha fish\nWith fright.  Wishing to die was tomorrow's wish\nI heard the mountain weep, skulls smash against cliff with sticks\nWe clash with the madmen from the good ship\nWe did nothing but show love to a stranger\nWe were repaid with murder, rape, and anger\nThe buffalos died, the lions would hide.  The bears’ cries\nSavagely speaking the pain of the tribe\nThis reality was actually the worst dream\nThe death of nature.  I heard the earth scream\nDead buffalos, empty rivers, and streams\nDead buffalos—too many killers and thieves\n\n[Hook: C-Rayz Walz] (x2)\n(Thank you!)  For taking my land and food\n(Thank you!)  For raping my women, putting me in a noose\n(Thank you!)  For killing my seed\nGiving me disease, then blaming me (Thank you!)"}]}