{"artist": "Boosie Badazz", "songs": [{"album": "Youngest of Da Camp", "title": "Boosie II (Don’t Forget It)", "year": null, "lyrics": "[Lil Boosie]\nAh, Ah Lil Boosie (Lil Boosie) Yeah\nWhats up! Umm! Whats up! Umm!\n\nDon't forget it, it's wicked\nDon't forget it, it's wicked\n\nLook, see I walk across that dirty track\nAt two o'clock a.m. flat\nWake up burn a murder sack\nAnything that move, then murder that\nTired of go'n through pressure thug\nCause I'm less a thug\nKeep it on your lap cause these days they'll test ya thug\nLook, if it ain't that fuckin doja or that weed man\nThis solja boy don't need\nCause that caine gone shake yo breed\nThink I'm lyin keep try'n\nBoy that's how it go down\nTakin over the world, that's why call me no brown\nSouth side for down, you know that's in my blood\nKeep bitchin cause I'm itchin from the fleas and the flood\nHollern \"Slow Yo Roll\"\nShit, I want the whole\nI wanna a fannie swole, so I can act a show\nNigga better ask your hoe, feelin like a mad man\nTry'n slang that weed on G street, that's a fast plan\nThinkin bout what dad sayin\n\"Keep it real and keep ya steel\nTake yo time and teach a lil, until you reach a mill\"\nGot me thinkin dumb ways, got two pumps and two K's\nTwo licks and two days, two fifths and new J's\nI'm thugged out\n\n[Hook] 3 xs\nDon't forget it, it's wicked\nRoll wit Loc so I sic it\nFollow me I got the ticket\nAnd some funk to get busy\n\n[Lil Boosie]\nLook, real niggas be bout that torture\nI'll scorch ya if you play me\nNiggas be try'n to hate me\nThat's why it's off of safety\nWhoever, whenever makes no differences who you be\nBoy you bleed just like me, but don't come cross CBT\nBottom boy, automatic anything that causes that static\nGet you stink by us, little nigga, thuggin 'n smokin angel dust\nA donkey boy, leave you funky boy\nSmoke everything from a lawyer to a junkie boy\nNiggas hollern bout they bout it, niggas light as a feather\nCan't get mad at you girl cause you ain't on my level\nDon't run behind me, when ya find me\nYou gone regret you missed\nCause my nerves done got pissed\nAnd all you gone get is this (CHOP CHOP!)\nIt don't stop wit solja Reebok tennis\nThug shit up in ninas, label Boosie a menace\nGod please forgive my sins, niggas try'n take my ends\nI'm just sit back 'n watchin, fuck the talkin I'm choppin\nWhere yo nigga, yo round, your fuckin whodi, yo convict\nThis south side red rum shit, so don't you be dumb bitch, wha\nPlayed everything man from proleans to dope fien's\nGettin track in my Balance, stashin dope in the alleys\n\n[Hook] 3 xs\nDon't forget it, it's wicked\nRoll wit Loc so I sic it\nFollow me I got the ticket\nAnd some funk to get busy", "image": "https://images.genius.com/661e9e198cc0139546c89d48031be567.1000x1000x1.jpg"}]}