{"songs": [{"year": null, "album": "The Most Beautifullest Thing in This World", "image": "https://images.genius.com/447c633e96f2be906b387d1114ff07c4.953x953x1.jpg", "title": "Straight Loonie", "lyrics": "[Verse 1: Erick Sermon (doing an Onyx voice)]\nTestin one two three!  Whoa I flow rhymes wicked\nAnd bust some to keep me uplifted\nIt flows to my braincells like from smoke\nI'm no joke, I make an old man croak because I'm loc'\nI'm wild, psychosomatic\nI got gats stored in my attic, for any crazy bastard\nIt's all in the mind when the E drops a rhyme\nMy freakin frame is like a pair of Calvin Klein's\nI drop flows through Customs\nAnd get sniffed out like I stole somethin when I'm bustin\nI'm Don of mic with this shit\nI rock on to the breaker one-nine ya dig??\nErick Sermon got funk for day\nFor those who wanna backstab me in the back, like the O'Jays!\nCan't get these nuts on the real\nIt's gonna be a cold day in Hell before the E drops the steel! (ARRRRRRRRGH!)\nI still rock with My Adidas\nWith Run-D.M.C. and Jay, my niggas packin heaters\nSo get off, get off, and if you want the real scoop\nOn the E Double, check the sounds!\nI rise my eyes burnt like cherry\nGet wise to my style more fly than Halle Berry\nI don't know so I'm sayin bye-bye\nUntil next try\n\nDef Squad, is in the house, yo\nGreen Beret, is in the house, yo\nL.O.D., is in the house, yo\nKeith Murray, is in the house, yo\n\n[Verse 2: Keith Murray]\nAnd Jesus is a fuckin puppeteer\nThe devil cut my sights off, and I'm runnin wild in this atmosphere\nFor mad niggas it's curtains\nI'm losin my mind in this biological universe\nIn my dreams I'll be gettin away drivin a hearse\nSo when I get to Hell, I'm stabbin up the Devil first\nAnd leavin the skull decapitate his ass catchin wreck\nRip off his head and shit down his fuckin neck\nFrom the little voice in my concious\nI might just leave a crazy-ass unconcious\nAnd Y, is a crooked letter like my alibi\nA psychic couldn't tell the science of my mind\nIt's me against the world so y'all can all eat shit and die\n'Cause I'ma gets mines, bitch!\n\nWest coast, is in the house, yo\nEast coast, is in the house, yo\nN.Y.C., is in the house, yo\nLil' Jamal, is in the house, yo\n\n[Verse 3: Jamal]\nBiddi-bla-ba-ba-ba, how ya like the Squad now?\nI'ma come down to represent the juveniles\nI kick styles that niggas can't fuck with\n'Cause when I come down I cold wreck the whole shit\nNow who the fuck wanna see Jamal I fades em all\nAnd any nigga that step up, he's sure to fall\nNow I come down to be the illest, the realest\nAny nigga that step up, I'm ready to peal his\nCap, sit back relax and dwell on the shit\n'Cause I be the illest little kid I'm ready to rip\nOn any motherfucker that wanna step nigga\nI'll let you know where the weapon is kept, how the fuck you figure\nThat you can fuck with me, I be the illest B.G\nBusting from Philly, chillin up in Cali\nSally from the Valley fucked me and she burned me\nSo you know I got the illest and I earned my props B\nFo sho' I'm ready to rip any MC who step\nAnd let them know where the weapon is kept\nYou punk bitch and I hit a switch\nAny motherfucker step I dump him in the ditch\nTrick!"}], "artist": "Keith Murray"}