{"songs": [{"image": "https://images.genius.com/8b9be6435171c7696fa873b98776ae76.886x886x1.jpg", "title": "Got Ur Self a...", "album": "Stillmatic", "year": "2001-12-04", "lyrics": "[Produced by Megahertz]\n\n[Intro: Alabama 3 sample (Nas)]\nWoke up this mornin' (yeah)\nYou got yourself a gun (yeah, yeah, yeah)\nGot yourself a gun\n\n[Chorus]\nYo, I'm livin' in this time behind enemy lines\nSo, I got mine, I hope you (got yourself a gun)\nYou from the hood, I hope you (got yourself a gun)\nYou want beef, I hope you (got yourself a gun)\nAnd when I see you I'ma take what I want\nSo you tried to front, hope you (got yourself a gun)\nYou ain't real, hope you (got yourself a gun)\n\n[Verse 1]\nMy first album had no famous guest appearances\nThe outcome: I'm crowned the best lyricist\nMany years on this professional level\nWhy would you question who's better? The world is still mine\nTattoo's real, with \"God's Son\" across the belly, the boss of rap\nYou saw me in Belly with thoughts like that\nTo take it back to Africa, I did it with Biggie\nMe and 2Pac were soldiers of the same struggle\nYou lames a huddle, your team's shook\nY'all feel the wrath of a killer, ‘cause this is my football field\nThrowin' passes from a barrel, shoulder pads, apparel\nBut the QB don't stand for no quarterback\nEvery word is like a sawed-off blast 'cause y'all all soft\nAnd I'm the black hearse that came to haul y'all ass in\nIt's for the hood by the corner store\nMany try, many die, come at Nas if you want a war, get it bloody!\n\n[Chorus]\nYo, I'm livin' in this time behind enemy lines\nSo, I got mine, I hope you (got yourself a gun)\nYou from the hood, I hope you (got yourself a gun)\nYou want beef, I hope you (got yourself a gun)\nAnd when I see you I'ma take what I want\nSo you tried to front, hope you (got yourself a gun)\nYou ain't real, hope you (got yourself a gun)\n\n[Verse 2]\nYo, I'm the N, the A to the S-I-R\nAnd if I wasn't, I must've been Escobar\nYou know the kid got his chipped tooth fixed\nHair parted with a, barber's preciseness\nBravehearted for life, it's\nThe return of the Golden Child, son of a blues player\nSo who are you, player? Y'all awaited the true savior\nPuffin' that tropical, cups of that vodka, too\nPapi chu', tore up, wake up in a hospital\nThrow up? Never! 'Member I do this through righteous steps\nYou Judas thought I was gone, so in light of my death\nY'all been all happy-go-lucky, bunch of sambos\nCall me \"God's Son\" with my pants low\nI don't die slow, put them rags up like Petey Pablo\nThis is NASDAQ though, in my Nascar, with this Nas flow\nWhat could beat that? Not a soul reppin'\nHit the record store, never let me go, get my whole collection, yo\n\n[Chorus]\nYo, I'm livin' in this time behind enemy lines\nSo, I got mine, I hope you (got yourself a gun)\nYou from the hood, I hope you (got yourself a gun)\nYou want beef, I hope you (got yourself a gun)\nAnd when I see you I'ma take what I want\nSo you tried to front, hope you (got yourself a gun)\nYou ain't real, hope you (got yourself a gun)\n\n[Verse 3]\nIt's, the, return of the prince, the boss\nThis is real hardcore, Kid Rock and Limp Bizkit soft\nSip Cris', get chips, wrist glist' – I floss\nStick-shift look sick up in that Boxster Porsche\nWith the top cut off, rich kids go and cop The Source\nThey don't know about the blocks I'm on\nAnd everybody wanna know where the kid go\nWhere he rest at, where he shop at and dress at\nKnow he got dough, where does he live? Is he still in the Bridge?\nDoes he really know how ill that he is?\nGot all of y'all watchin' my moves, my watch and my jewels\nHop in my coupe, dodge interviews like that\nIt's not only my jewels, ice anything, plenty chains\nLook at my tennis shoes, I iced that\nWho am I? The back twister, lingerie ripper\nAutomatic leg-spreader, quicker brain-getter\nKeepin' it gangsta with ya (uhh)\n\n[Chorus]\nYo, I'm livin' in this time behind enemy lines\nSo, I got mine, I hope you (got yourself a gun)\nYou from the hood, I hope you (got yourself a gun)\nYou want beef, I hope you (got yourself a gun)\nAnd when I see you I'ma take what I want\nSo you tried to front, hope you (got yourself a gun)\nYou ain't real, hope you (got yourself a gun)"}], "artist": "Nas"}