{"songs": [{"year": null, "title": "Buckets of Silence", "image": "https://images.genius.com/ac9e0f11c62005e2d424955c950a2944.300x300x1.jpg", "lyrics": "Had I known then what I know now\nHad I thought now what I knew then..\nI might still be human\nWith all the little stupid fix-ins\nAs I fix sins and vixens vick souls\nStitch clothes for the characters they play then switch roles\nNail me to the cross dress\nThe holy cloth costs less\nI'd toss less\nIf I still had your soft breasts to rest my head on\nSince you've been gone\nI recalled my issues with problems and hate\nBut I can't exactly remember the model or make\nNow glass bottles break in my death grip\nI'm about to take the next quick exit and end this head trip\nMy bed is stripped of its blankets, comforters, pillows and sheets\nBut I might have to peel off all my skin to remove your scent in order to sleep\n\nI had my highs and lows\nWhen on top, I let you peek out over my nose\nSitting on my shoulders and I suppose if I had a backbone\nYou might still be here\nMy skin is filthy..\nFrom my lows when you weren't there. But to keep from feeling guilty\nI collected the dirt...Kept it piling up\nNow Mr Feel Nothing saves his tears inside of a cup\nAnd he drinks. And he forgets that he's an asshole\nJealous of his ghosts and doubts that he even has a soul\n\nMy secret pleasures have my inner demons gossiping\nI'm a ghost writer for the horrorcore lyrics my personal mosters sing\n\nI'm sitting in a strangers tub..\nWith all my clothes on...shivering...considering the dangers of love\n\nThey get half of what I have to give...IF THAT\nIt's all about the packaging. They're distracted by the gift rap\n\nPredictable. Easy to manipulate\nThey're foreshadow puppets and I'm waiting for their strings to break\n\nThe pillars that once held up my halfway house have been taken out\nI'm in my last days now. There's a change coming soon\nI just want to crawl back into my mother's womb\nI need a comfort zone\nBut obviously I need to find another home\nTo call my own...and always return to\nAnd I want it to be you\n\nI sit and stare, zone out, think a lot and never sleep\nCreating memories to remember and then I forget to eat\n\nWent to the street you used to live on, staring at the bedroom window of your old home\nWith puppy eyes...waiting for God to throw me a bone\n\nI'd settle for one more goodbye kiss while I settle for less\nI'm unsettled at best. Sulking while abandoning settlements\nInsulting my companions intelligence...conversing with baby talk\nPlaying with mind games. Rehearsing with playful thought\n\nIts the way we fought that made my blood bubble then turn cold\nWhen you made me walk through rain and mud puddles down a dirt road\nIt left me so messy\nForget me..\n\nNot\n\nI've got more mud to sling...\n\nShot", "album": "Personal Journals"}], "artist": "Sage Francis"}