{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "It’s All Over", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "[Verse One]\nNow this one is for you liars and you jokers\nYou blabbermouths and you damn crack smokers\nSomeone's talking about my wrong subjects\nAnd it's time for Positive K to flex\nMy muscle, and then for me to stick out my chest\n[You gonna mop shop, pop?] Oh yes\nBut I'm mad, somebody said that I couldn't rap\n[Hold up} Heh, who told 'em that?\nBecause I'm qualified\nPlus you know I'm phallic\nAnd all my fans casted their ballots\nThey voted me the number one solo sensation\nA rapper and a fighter with a [Good combination]I got the baddest left jab that you ever saw\nYou want to riff? Then let me tap you on your jaw\nSo I suggest that if you've got a beef with me\nTo keep that thought in total secrecy\n'Cause I don't care about you jockey busters anyhow\nI just came here to say\nIt's all over now\n\n[Hook]\n\n{Over}\nIt's all over now\n{Over now}\n\n[Verse Two]\nSee, when I was young I used to watch Wonderama\nLooked up to my dad, real close to my mama\nSince then I was taught there's no future in frontin'\nBeing timid and shy would never ever get me nothin'\nI transformed into a real go-getter\nPrepared for the worst, but always hoped for the better\nI'm not a success but I'll say I'm a successor\nA real cool guy and a casual dresser\nI'm dipped\nOccasionally, I gots to flip up on a sister or mister\nWho feels that they're equipped to deal\nWith me on my rapping field\nSee, I'm the best, so the rest must kneel\nTo Positive: the gentle-man, the rapper\nIntelligent, clean-cut, and so effin' dapper\nI gets the benefits, in other words the fringes\nI rocks the house and the doors off their hinges\nYou get astounded, even dumbfounded\nSmacked so fucking hard you'd think your ass was surrounded\nI'll upset ya, wet ya, engage ya\nDo it just like Ali did it to Frasier\nSo if you feel it's real, play me on the wrong note\nAnd fuck around, huh, and get your jaw broke\nIt's over now\n\n[Hook]\n\n{Over}\nIt's all over now\n{Over now}\n\n[Verse Three]\nI gets the red out, rappers is dead out\nI'll put your head out and you better gets the hell out\n'Cause I run 'em I ran 'em\nI really couldn't stand 'em\nI did 'em, I done 'em\nAnd now all I can do for you is son 'em\n'Cause I'm the badder dada\nI kicks the data\nYou get mixed in the badder battlin'\nIt doesn't matter\nSo now, what's the scenario?\nWhere they go? Here we go\nGive me your name and your number\nWhiles me do you very slow\nWho's my victim?\nWatch me vic 'em and dick 'em\nAnd I'll BRRDDDT stick 'em\nLet my hooker trick 'em\n'Cause yo I got the jism\nI race in the race in the prism\nFly to your bladder\nJust like a platter when I didn't miss 'em\nKeep it together, I'm sharper than cheddar\nBetter than a machete, ready\nTruncate it to the letter\nI'm the enforcer, can't refuse my offer\nOr you'll be over the bridge\nShit, who's the bosser\nCleaning your shit up because you was a quitter\nUnlike the Pos K\nThey say I'm a home run hitter\nStripped, whipped, flipped of your title\nGood golly Miss Molly, Little Richie needs your idol\nBut no, I'll be your tutor tutor\n'Cause you're kind of new to\nMe the pursuder of the man Buddha\nYou don't know my style and you're sorry\nKinda fiery, yours is tirey\nNow go write that in your diary\n'Cause I'mma can 'em, I ban 'em\nI fix your papers on my annum\nWhen I come natives start bangin' like a bantam\nI gots the fluid, get to it, pursue it\nYou see I hit Nia Peeples but don't you tell Howard Hewitt\nBecause it's over now\n\n[Hook x4]\n\n{Over}\nIt's all over now\n{Over now}", "year": "1992-01-01"}]}