{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": null, "lyrics": "Make Luv Outro\n\nAyo, grab my [?], turn to the motherfucker next to you\nAnd punch that motherfucker right in the face\n(Fight, fight, fight\nFight, fight, fight\nFight, fight, fight\nFight x2)\nC'mon, yeah\nEverybody\nStart that motherfucking riot\nYeah, get that shit\n(Make love, make love)\nC'mon bitch\nHey girls, get in on that shit too\nUse them sexy ass nails\nScratch that slut's face the fuck up\n[?] girl, you gon' get a\nWelcome to the world of R.A. the motherfucking Rugged Man\nYou are being blessed by the motherfucking greatest lyricist to ever grace the motherfucking Earth\nC'mon my lesbian sisters\n(Lick pussy, lick pussy x5)\nC'mon, sing\nYeah, this ain't no Jesus Christ rap\nThis ain't no Kanye West\nThis R.A. the Rugged Man\nC'mon\n(Fight, fight, fight\nLick pussy, lick pussy x3\nFight)\nHow that sounded?\n\nI Shoulda Never (Hidden Track)\n\nAyo, Riddick Bowe lost, he's done now\nI'm hiding from the world, there's no place to run now\nI've got a gun now, I've got no brains now\nPeople going to die, I'm not playing games now\nAnd every bitch wanna piss on you when you down\nAnd every nigga wanna shit on you when you down\nAnd everybody jealous when you're doing decent\nThey'd rather see me sleeping on the streets and not eating\nI swear to God, before my record's done\nI'm either gonna shoot somebody, or stab the shit out of someone\nThe fact is, in the end, they're all gon' leave my ass\nMy records ain't gon' sell and I'mma die with no cash\nAnd ain't no bitches want me cause my dick gotta rash\nAnd ain't no bitch wants an infected dick in their ass\nAnd I don't care about these foul bitches in my past\nI'm not quite sure how much longer I'mma last\nEverybody I ever met in my life was fake\nAnd I never met anyone I didn't learn to hate\nI'm not bragging, but I treat every good bitch like shit\nAnd fuck every dirty bitch with no condom on my dick\nBut she in this love game, it's so easy, hit or miss\nI should've never shit on that bitch, Sarah [bleeped out] x3", "title": "Make Luv Outro/I Shoulda Never (Hidden Track)", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}