{"artist": "Professor Green", "songs": [{"album": "M.O.T.H.", "title": "Bad Decisions", "image": "https://images.genius.com/72eee6a08042c30e82cf359ef3e9c628.1000x1000x1.jpg", "lyrics": "[Intro]\n*coughing*\nA wise man once said, to wake up, you've got to go to sleep!\n\n[Chorus]\nThere's no more rules to break\nYou've made all of your mistakes yeah\nYou had a choice to make and you made another bad decision\nThere's no more rules to break\nYou've made all of your mistakes yeah\nNo need to calculate, the sum of all your bad decisions\n\n[Verse 1]\nVoices in my head, choices in my bed\nI should be rolling out but I'm rolling up instead\nPlans out the window somebody's at the door\nPatterns on the ceiling bodies on the floor\nSocks in the sock drawer drawing my sock\nI'm going all out, are we all in or what?\nSame old story every bloody weekend\nSunday I'm on a weight, Monday I'm in the deep end\nRight who wants what? I want one, you want one and you want  one\nOne plus one plus one is three, we might as well get a Henry\nQuick maths!\n\n[Chorus]\nThere's no more rules to break\nYou've made all of your mistakes yeah\nYou had a choice to make and you made another bad decision\nThere's no more rules to break\nYou've made all of your mistakes yeah\nNo need to calculate, the sum of all your bad decisions\n\n[Verse 2]\nCome on mate, it's only 8 start early finish early\nStart early finish late I'm already in a state\nIn a rave over East, the night ain't going west yet\nNext thing you know we're in a cab to the West End\nFeeling super drinking my juice\nDoing bumps getting pranged in the back of the Uber\nNearly hit the box still gotta get our tickets though\nOh wait up, hold up a minute my phone's ringing bro\n\nAlright Steve\nHello mate what's happening\nHaving a cheeky one are you?\nYeah is Henry about?\nHe is mate but I'm not around later, sure you don't wanna take a half?\nAwww... fuck it\n\n[Chorus]\nThere's no more rules to break\nYou've made all of your mistakes yeah\nYou had a choice to make and you made another bad decision\nThere's no more rules to break\nYou've made all of your mistakes yeah\nNo need to calculate, the sum of all your bad decisions\n\n[Verse 3]\nYou know the clues skip the queue\nStep in the club, get a table and order a couple bottles of booze\nBottles of patron patron however you pronounce it\nAdd one or two shots but who's counting\nHopped outside to meet thingy for the thing\nKnocked[?] on the door ain't no trouble getting in\nHopped outta the van was on my way back to the gang\nWith half an ounce in my hand when I bumped into a fan\n\"Oi you're Professor Green ain't ya?\nYou are ain't you, you're him!\"\nWhat do you want? A picutre?\n\"Nah I don't want a picture mate, you're nicked!\"\nShoved the fed now I'm legging it through SoHo\nTryna hold my jeans up I shouldn't wear 'em so low\nStraight across [?] nearly hit a rickshaw\nIf I get caught I know all too well what I'm in for\nLeft down Broadwick I'm running out of breath\nI already know how I'm getting out of this mess\nI ain't going in for nothing even though the cops got me\nThe packets in the rickshaw I ain't got nothing on me officer", "year": "2019-09-06"}]}