{"songs": [{"image": "https://images.genius.com/53fe362cf4b7448c075c21bb871af192.1000x563x1.jpg", "lyrics": "[Part 1: YCOnTheBeat & G8Freq]\n\n[Intro: Kenny Allstar & Producer Tag]\nKenny Allstar\nG8\n\n[Verse 1: Unknown T]\nOpps can't fuck with da thug\nWe made the Tridents come\nMore time it's a Niner ting\nI been that silent one\nOpps can't fuck with da thug\nWe made the Tridents come\nMore time it's a Niner ting\nI been that silent one\nMore time I've been complacent\nBut when bro got dropped\nFuck all the guap\nI stepped out with no hesitation\nMan lurk from the public station\nSlow down 'cause there ain't no mistaking\nAnd I've been tryna rake this cake in\nYou can never hold it down like man, 'cah my life's been aching\nPolice on my nuts it's fucked\nEarnt that luck, cases bruck\nOpps can't fuck with da thug\nWe made the Tridents come\nAnd dis one look like an undie\nNuh, we dont supply that drug\nIn fact, do I look like a mug?\nWord, man, rock on my stainless tucked\nWe don't do this monkey bar ting\nFence and get chinged\nBag that work with the latex on, the rack will come in\nAgain and again, the racks will come in\nOT blingin', the phone keeps ringing\nCircle your block, pop doors get chinging\nFuck dem opps, for the boy dem singing\nThat prick had a vicious dipping\nHow many nights had to bake in the Bando to get that guap?\nI flew OT tryna lick that stain, so we hit that spot\nBag dat up, and serve 'dem dots\nOpps can't mock 'bout guap\nMan push work a lot\nMy old school gyal love the way man rock\nMan flex on a bae like, \"What?\"\nAnd true say man crept to the top\nHustle for days, I learnt both ways\nPlug for the shape and the crops\nIt look like I come out the gym and I shot (Whoof)\nLook like I come out the gym and I shot\nListen\nThere's too much chat on the street, I've been itching to write man off\nBro got juice on my favourite shirt, so I burnt that top\nWork that chef like it's Novikov\nI've been on bail for the longest, more time Boydem gob\nMan just sit in the dock, get released and I don't look bov'\nThe cops like; \"How did he do that job?\"\n\n[Interlude: Kenny Allstar & Unknown T]\nUnknown T\nLets do this Mad About Bars: Season three\nBut Unknown, seems like you got the streets talking about you and you ain't even put out a record yet\nSo it's only right\nWe go with the Mad About Bars first\n'Cause, you know, my platform (Unknown T)\nIt's just a bit different\n(Homerton B)\nTake him in\n(Gyally on me)\nJheeze!\n(The voice of the streets)\n(Bali' on me)\nLook; listen, shh\n\n[Part 2: YCOnTheBeat]\n\n[Verse 1: Unkown T]\n\nHad a dot-dot up in the cab, got Polkas in bags\nWe soak him and dash\nBro-bro got the clique on waps\nBeg man don't run, when they see that wap\nGot the clique on mash\nBeg man don't run, when they see that wap\nBro-bro got the clique on waps\nBeg man don't run, when they see that mash\nI had devilish thoughts when I witnessed the body get chopped\nBanged the one pop\nIn fact, there's still spots in this spin ting\nCome like them old school clocks\nListen\nOne lickle ching and they chat like kids\nHe got splashed, and he got cheffed\nWe didn't say shit\nGang just pop up and tape off strips\nReal nigga shit\nPamper ting, buss off and take mans shit\nBumper ting, bruk' off and tek' some dick\nShe wants some more love\nJust take a man in\nWant some more love?\nJust take a man in\nGyal must be licked if she thinks imma come to her crib\nTo get caught up and then get nicked\nDon't forget, man got beef on your strip\nDon't forget, man got beef on your strip\nI done so much work on the low\nI'm only young, mixing a pyrex bowl\nBussed the wap case and the Tridents know\nJustice ain't right, but the jury don't\nC.P.S. they know the justice ain't right, but the jury don't\nC.P.S. they know the justice ain't right, but the jury don't\nWhat you know about moving bookey?\nConfusing the angle, 'cause I'm unpredictable\nSee this life that I live ain't fictional\nIn the system, we're labelled as. \"Criminal\"\nAll about money; don't care about beef\nBut few of these yutes have doubts\nDon't care 'bout your name on street\nIf you're on me, I'm cheffing you inside out\nAnd if I catch an M, I will fly out\nPoke-poke chef, soak til' that yute dries out\nIf a boys got grub, then I will try out, sike\nYour boy got yakked then bounced, twice\nIf I backed my shank on your friend\nAsk yourself, \"Should I be chillin' with dem?\"\nBromley-by-hoe, give ten-out-of-ten\nAnd she sniff coke, let me give it to dem\nHow could the feds try lock man for eighty hours and dat?\nRhaatid, it's mad\nWhose that youte tryna move bare bad?\nAnd my music's up, 'cause my views went mad\nBits get bagged, haffi' scale and lag\nAnd free all da guys, locked up in the can\nBits get bagged, haffi' scale and lag\nAnd free all da guys, locked up in the can\nMy babes-my babes, said I need rubber bands\nGot too much notes in cash\nBut don't forget, man still gets paid in bands\nCan't wait til' the payment lands\nThe way, the way that the phone just rang\nGot seven missed calls at 3am, and it's only a Benz, like damn\nLike, how can a man stress man?\nWhose got heart lemme turn that off\nBlood on creps, man burn that off\nYou ain't done shit on the pitch like Berbatov\nBurn man off\nI got bagged and I learned a lot\nChase racks, don't waste more time on a paigon block\nI switched plans, now I'm making prof\n\n[Interlude: Kenny Allstar, Producer Tag & Unknown T]\nMental\nThat's what it's all about\nThat's what Mad About Bars is all about\nShowcasing the best\nUnknown T\nT-T.P\nRemember, don't ever forget this name\nThis guy is gonna be a fucking problem on these roads\nRemember, I told you that\nHomerton stand up\nLet's go back in\nFor the third, and final time, damn!\n\n[Part 3: YCOnTheBeat & ChubzTP]\n\n[Verse 1: Unknown T]\nThese-, these niggas are bitches\nBro got the 4-4 strong, Rambo long\nWe're getting this done, fuck civilians\nWell I've been on your block with some niggas\nIf I pop off the door, no-one vigilant\nRun out-\nFuck; these niggas are innocent\nSurrounded by burners and shotties\nNext time drop of the dots to a Botty\nLurk on your block wid' the mop\nGet anything opp, get popped (Bang it)\nLurk on your block wid' the mop\nGet anything opp, get popped (Bang it)\nLurk on your block wid' the mop\nGet anything opp, get popped (Bang it)\nLurk on your block wid the mop\nGet anything opp get- (Buss it now)\nLurk on your block wid' the mop\nGet anything opp, get popped (Bang it)\nLurk on your block wid' the mop\nGet anything opp, get popped (Bang it)\nLurk on your block wid' the mop\nGet anything opp, get popped (Bang it)\nHmm\nWhats this dusty thing that your trappin'?\nAin't no way this worthy of rapping\nYeah, he got talk, but he ain't on backin'\nRambo blade, reverse it, then whack him\nYou can fly to my strip like Aladdin\nBut one wrong deed?\nKerlassin'\nWhose on volts?\nAttack him\nStamp and did mans back in\nToo many opps keep talking smack\nMy 9 clique made the grown men dash\nHe tried spin, when he backed that mash\nLike, how comes your wasting cash?\nMy guys, my guys are the last ones left\nBut still tryna get man whacked\nCreep, creep on the low and attack\nWe got slugs, nah my team never lack\nLay low 'cause we're lurking lots\nNumerous blades, out to switch man off\nCan't even say too much on a track\n'Cause the blocks too hot, it's time to get guap\nHeard that half of the streets on us\nBut didn't know gang got the beaters tucked\n'Cah anytime we see men, more time the heat get buss\nStill got to focus on clientele\nPush that buj, with the light as well\nMove brave, but I'm booters from jakes\nRacial abuse's what the Tridents yell\nToo many rats, 'cause the opps just chat\nHow can a-\nHow can a man say I ain't gripsed a wap?\nBlud, go check my CV, akh'\nBelieve that rap, 'cause I'm speaking facts\nBelieve that rap, 'cause I'm speaking facts\nHe got splashed, but your team don't back\nHe got yacked, and he got wrapped\nThe only way you cut's high knees in fact\nLay low while we're making cash\nDon't forget, gang still trap and mash\nAnyone on road could purchase that wap\nBut focus, and raise that stack\nBeefing my clique?\nThat's a Shaolin battle\nD.S, Adz, my broadie shackled\nMy brodies shackled his heart\nHis heartrate's beating\nLook how your brody's rattled\nRun or get tackled\nI think some keeps singing them carols\nNow the whole of the streets move baffled\nRah, I'm dazzled\nGang brush off all the opps like Basil (Boom, boom)", "title": "Mad About Bars", "year": "2018-05-27", "album": null}], "artist": "Unknown T"}