{"artist": "E-40", "songs": [{"title": "Can’t Fuck With Me", "image": "https://images.genius.com/a82de911f07b5ddaf9bd5b4e2064c8f0.300x300x1.jpg", "album": "Sharp On All 4 Corners: Corner 1", "year": "2014-12-09", "lyrics": "[Chorus]\nY'all can't fuck wit me (repeated)\n\nY'all can't fuck with me, chain around my neck same colour as pee\nIn the bay they call it wet like the ocean and the sea\nI'm throwing up my set and I'm yelling out the V\nVallejo California y'all players tops like armour all\nPaper long like a conference call\nDucking and dodging Johnny law\nWanna ball like Chris [?] but I'm not in the NBA\nMy DBA is selling alcohol, music and real estate\nWe done came a long way, Charlie Hustle in my DNA\nSame product different hustle, different plinay\nODB DB and E-40\nNovember 15th, we share the same birthday\nScorpio mines is Prodigy like the homie Lil Booise\nReal ones love us fake ones hate us, wanna smoke me like a loosie\nWanna pluck me like a guitar\nIt's not a movie this ain't pixar\nI got an uzi for any sucker wanna shoot me\n\n[Chorus]\n\nMy criminal lawyer is Dan Russo\nMy entertainment lawyer is Bob Lieberman\nThe bail bonds that I choose is Ann Hill\nJust in case this hustler go to jail\nI'm a side bail when it comes to these coins, come to these coins\nMack game, my dollar coin like dollar coins\nCrack game, seen it and lived it, been in it and done it\nRap game really and truly is all i wanted\nMy car might get to poppin a wheely\nZero to sixty, the manifold open\nShe start my nigga bitch hella pretty hold it!\nPanty's be sticky, soaking!\n\n[Chorus]\n\nThey can't fuck wit me man!\nThey can't fuck wit me!\nThis beat will make you raise your eyebrows\nFuck your radio and PPM we got pandora now\nSpotify and sirius satellite\nFor the PBs that act like ass wipes\nHave my money taller than giraffe necks\nPapered up like a cheque\nOne of my favourite pistols is a SPringfield\nBetter duck before you get wet\nI got diamonds and a trapezium in my delotids\nWhen theres a problem i let my binoys drop my tinnoys\nFucking around let me rubble with a soup box bubble\nExtra extra, bring back double\nMy life is important and it ain't ever been boring\nWe don't believe in no yawning we up all night till the morning\nShe attracted she like me, she say im saucy and icy\nShe know im active and mighty she want me to smash it and pie sheet\n\n[Chorus]"}]}