{"songs": [{"lyrics": "[Aceyalone-Hook]\nParty people! Your dreams have now been fulfilled\nGet out your seats and let's get ill\nWe're not just raw, it's Project Blow!\n\n[Aceyalone]\nWell it's time for Underground flavor\nHip-Hop make you change your behavior\nNow for your rock and roll heads or you ravers\nYou don't know now but you going find out!\nWe be rocking this ? and kicks\nFreestyle Fellowship in the mix\nAfterlife Massmen in the mix\nYou don't know now but you going find out!\nI don't think that I'm gonna sleep tonight\nMy name is Aceyalone keep it tight\nThem other fools just can't freak the mic man\nYou don't know now but you going find out!\nWho got, who got, who got, who got\nUnderground around the world smoking hot?\nWho got the mic to serve you bumbaklots?\nYou don't know now but you going find out!\n\n[Aceyalone-Hook]\nParty people! Your dreams have now been furfilled\nGet out your seats and let's get ill\nWe're not just raw, it's Project Blow!\n\n[Riddlore]\nOne for the money, two for all the rest mine crew from the West\nThrough with all the mess yes you're rocking with best beyond a doubt\n[Aceyalone:You don't know now but you going find out!]\nWe get you up for the ressurection\nThat afterlife Project Blow connection\nI'm rhyming to get rid of your imperfections\n[Aceyalone:You don't know now but you going find out!]\nThe who, what, where, when and why\nLegendary style that we spit on the mic\nWhether, memorize or the improvise\n[Aceyalone:You don't know now but you going find out!]\nBlow the ? doors see you ? doors been opening the doors so we pack the floors\nYou were looking for a battle but you fell into a WAR!\n[Aceyalone:You don't know now but you going find out!]\n\n[Aceyalone-Hook]\nParty people! Your dreams have now been furfilled\nGet out your seats and let's get ill\nWe're not just raw, it's Project Blow!\n\n[Aceyalone]\nOne for the money, two for the show\nThree four five six and seven for the flow\nEight nine ten eleven, add a couple mo\nI got one double O one ways I could go, so\nHave a seat, relax your feet\nRoll out the stair walkmen rock this beat\nIf you ain't got this then you incomplete\nGo feel this heat on your neighborhood street\nTry to make end's meet, greet and get aquainted\nThis is alot different from the picture that they painted\nI try to explain it, the best way that I can\nToday's all I got, yesterday is ?\nI'm a grown ass man who gots to survive\nHold out your hand and all they do is slap you a five\nWe shuttin down the microphone as soon we arrive\nUse my powers to the guns and knives\n\n[Aceyalone-Hook]\nParty people! Your dreams have now been furfilled\nGet out your seats and let's get ill\nWe're not just raw, it's Project Blow!\n\n[Riddlore]\nHang you around and the ground cause to bound to the sound\nOf the tomb of the boom we consumed by the pound\nOf the bass-drum bass some, take some take some\n?We would be rhymin for time combining?\nThe mind of a villian we chilling and reclining\nWith the mic in my hand swinging to a beat\nBobbin my head with dropping what said\nHot like a potato, or in Aesop's Fable\nLable this the real typical receipt of ?\nFrom a sucker loose slips, who sliped?\nOr give up the mic a beat that is tight\nOr rather ignite as I put you in gear to take flight\nLike a terydocatle, a sparrow or an astronaut\nA eagle or seagle or a rock from a slingshot\nThe error of bullet from a the barrel of a four-four\nImage mixed with the whistles of ? like it was World War III\nThe mic and me are deadly combo rumble rumble crumble\nSo you could stumble down like the Wall's Of Jericho\nWhen the solo's blown into the microphone\n\n[Aceyalone-Hook]\nParty people! Your dreams have now been furfilled\nGet out your seats and let's get ill\nWe're not just raw, it's Project Blow!\n\n[Aceyalone]\n..You don't know now but you going find out!", "title": "Find Out", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}