{"songs": [{"title": "Addicted", "lyrics": "[Hook: Jeezy]\nMan, these hoes, oh\nWhen it come to gettin' paper, I'm gifted\nThink I might relapse, I'm addicted\nMan, these hoes, oh\nI ain't bout to lie just to kick it\nThink I need rehab, I'm addicted\nMan, these hoes, oh\n\n[Verse 1: Jeezy]\nNigga happy, roll that weed up\nI just want her, I don't need her\nOn the menu, I won't eat her\nDon't eat pussy? Bitch, me neither\nShe addicted like Pookie on New Jack\nSame old pipe, just new crack\nEvery time I hit, she come right back\nEvery time I hit, she come right back\nThen I'm back to my business\nRight back to my senses\nEvery time I'm done wit' it\nPussy callin' my name, nig'\nGod as my witness, these hoes!\n\n[Hook]\n\n[Verse 2: YG]\nI don't like holes, all my homies locked up sittin' in 'em\nI don't like hoes, the whole community put they dick in 'em\nThey be expecting things, tryna use that pussy power\nBut that power don't work when you find out it's sour\nI don't kiss 'em, that's a no-no, nigga (How was that pussy?)\nKinda loose, it was so-so, nigga\nShe fuck wit' him, she fuck wit' me then fuck wit' him\nI'm like \"Aye, girl, go 'head and seesaw that pussy, then\"\nAye, she a busy body\nShe just tryna see how much she could get up out him, so\nI don't trust 'em, I really don't trust 'em\nBut I gotta get my nut off though so I just fuck 'em\n\n[Hook]\n\n[Verse 3: T.I.]\nHey, I can't lie, I think I might\nNeed rehab, she has me so high\nIf you lookin' for the flyest, there could be no guy\nOther than I, T.I.P., hard to deny\nMe, why, she gotta be the sweetest of drugs\nMake a nigga think no one could please me but her\nI asked her where to put it, she said \"Skeet it on here\"\nSo I don't need no molly, I'm on E and on her\nI prefer the prettiest bodies, go to luxurious lobbies\nHit the elevator button, on the elevator, suckin'\nSloppy blowjob 'fore a nigga touch the doorknob, I'm so hard\nI can't make my dick fit, I swear I'm addicted to her\n\n[Hook]", "album": "Seen It All: The Autobiography", "year": "2014-09-02", "image": "https://images.genius.com/fb1104e7cfc07487792c932abf32acbe.1000x1000x1.jpg"}], "artist": "Jeezy"}