{"songs": [{"lyrics": "[Sample: KRS-One]\n\"Chill with that ill behavior!\"\n\"Chill with that ill, ill behavior!\"\n\n[Verse 1]\nPull the pin out, sheep creep in wolf garb\nFronted by the Hail Mary parry lunge mix\nKill the populace for stability, jeopardy's a stickler\nIt's bob and weave amalgam played the falcon to your fixture\nI branch out, arms flailing backwards\nWhaling upon a tidy sound circuit, slightly foul Gershwin\nWith a bed of nails and drum lust, plus disgusting service\nWorking in shifts opposite the asbestos brain furnace\nI be the now observatory: eye, ear, antenna feeler\nSpitting like a dragon with a similar demeanor\nStood innocent bystand, witness the die-hard fans turn Rip Van\nIn the poppy fields of N.Y.'s orchestrated brick gauntlet\nNow I'm thinking, \"Who am I?\" Jabberwocky Superfly, bent left\nPushing war without the ten step cushion, and what? (What?)\nI plan to hold this B-positive sacred in these golden veins\nUntil the day I die from grimace overload\nIt's shock (It's shock)\nTreatment offered by the weekend\nDystopia getaway, let's display the sequence, it goes:\nOne for the heartless thievery turning my guardian angel harpless\nAnd the rest to sweep the mess under the carpet (Under the carpet)\nI drag a yellow taxi meter\nBehind every measure and charge cats for labeling me shepherd\n\"That'll be 6.50 plus tip, darling\nI take cash, credit, check, money-order, gold and cigarette cartons\"\nGot caught up in the universe trying to zoom in on stardom\nForgot the passion plus the hatred, both were based in Carbon\nNext time you wanna be a hero, try saving something other than hip-hop\nAnd maybe hip-hop'll save you from the pit-stop\nKill 'em all, yield\n(Naw, man, it wasn't me it was Holden Caulfield, brother\nI just read and pulled the trigger)\nOh God, well leave me to tiptoe past the pearly gates\nCapture the halo, jet back to base, step\nFast to chase the bad taste of jet lag and waste slackers\nThere ain't nothing broken, where you at?\nThe pistons pump perfect, where you at?\nThe bass tone is Merlin, where you at?\nThe services of urgent working surgeons\nPurging formulas looking for an improper cause is whack\n\n[Hook] (x2)\nWhat are you saving, honestly? (Honestly, honestly)\nWhat are you saving, honestly? (Honestly, no honestly)\nWhat are you saving, honestly? (Damn)\nPromise me you gon' shut the fuck up and recognize\nWhat you holdin ain't really broken\n\n[Interlude]\nI don't flick needles like my sick friend\nI don't march like Beetle Bailey through a quick trend\nI don't frequent church's steeples on my weekend\nAnd I don't comment if you formulate a weak Zen\nAll I ever really wanted was a getaway\nI'mma take a chance by letting a rook slide forward out of my hands\nI cannot agree to follow a leader along a borderline\nOf war without a reason for the \"ready, aim, score.\"\nBring out your dead, we can put 'em in a pile\nAnd burn 'em with the novels for the kiddies to admire\nKill the ones that speak from a different life brew?\nI'd rather kill the noisemaker that separated the two\n\n[Verse 2]\nOkay, welcome to the Kamikaze bottle rocket cockpit\nLive by the icy cold hand of bad intention youth blender\nOh, yeah, I'll let God warm the bench for now\nBut I'll ascend to spin y'all dizzy\n(And for the record I'm bringing my TV with me)\nIt goes: let the commoners speak publicly\nThen disperse eye jammies for cats that swear by third pupil\nBut can't see past the loophole\nMotherfucker, my word is born like Siamese triplets\nWith doctor, lawyer, rocket scientist promise\n(Let 'em grow leisurely)\nHey Mom, I'mma fix whatever I broke along this path\nOnce my spiel's perfected, I'mma save you a seat in the front row\nOf Aesop Rock's twelve steps to shut the fuck up seminar\nAnd when all these bickering crowds turn silent you gon' be proud\nI tack hacks to the (backboard)\nHonesty's a (patchcord)\nFury's far from (obsolete)\nSerenity's a (crack whore)\nRaw caricature of mayhem standard, branded by the labor\nWith a thousand reasons to end this for every one of you saviors\nSaw the brightest burst ironically wandering the vacant stage\nGave it a pound for burning where bunk ratio's engaged\nKeep me posted as to when you grasp something mature to\nSit and sulk about mister, and I'll consider picking up your record\n\n[Hook] (x2)\n\n[Outro]\nThe Orphanage, they ain't got nothin' to save\nThe Overground, man they ain't got nothin' to save\nDef Jux, they ain't got nothin' to save\nThe Atoms Family, they ain't got nothin' to save\nWeightless, they ain't got nothin' to save\nStronghold, man, they ain't got nothin' to save\nRhymesayers, baby, they ain't got nothin' to save\nAesop Rock, I ain't got nothin' to save\nIt's like that...", "title": "Save Yourself", "album": "Labor Days", "image": "https://images.genius.com/6a16cbbd76c264fec96a9675981e9556.1000x1000x1.jpg", "year": "2001-09-18"}], "artist": "Aesop Rock"}