{"songs": [{"title": "I Ain’t Fucking Wit U!", "lyrics": "[Hook: Dion]\nI tried to take you serious but you think I'm a fooooool\nOooh, I ain't fuckin wit youuuuuu\nCause if I ever caught you up, ain't no tellin what I'd do\nOooh, I ain't fuckin wit youuuuuu\n\n[Snoop - over Hook]\nYou think I'm a fool (I don't know you niggas)\nUh-uh, fuckin fuckin wit you (I ain't fuckin wit you niggas)\nAin't no tellin what I do to you (I ain't fuckin wit you niggas)\nUh-uh, I ain't fuckin wit you, I ain't fuckin wit you Cuz\n\n[Young Buck]\nFuck y'all\nHe used to be a hustler, he ain't real no mo'\nCause it's some shit in the hood we wanna kill you fo'\nLoose lips sink ships, tattle-tellin gets you killed fast\nI hope you get knocked off wit your snitchin ass\nMade a deal cause the jail had you scared\nCan't do your time so you sold to the Feds\nNigga kill yourself, you a dead man walkin\nL.T. got life, and homie still ain't talkin\nSo all of them niggas puttin wires on\nDon't say nuttin when your family get fired on\nThey say your man took the stand and he didn't think twice\nThey took his life, and they didn't think twice\nIt's an eye for an eye, you rat you die\nAin't nobody 'posed to know when the pack arrive\nSee the judge is the pimp cause he made you snitch\nLight you up and he didn't pay you shit, who the bitch?\nHa ha\n\n[Hook]\n\n[Snoop - over Hook]\nYou think I'm a fool, huh?\nNaw Cuz, I ain't fuckin wit you, fuckin wit you\nNah nah, nah nah, nah, nah.. you know what?\nAin't no tellin what I do to you, I do to you, I do to you\nDo to you, nigga, ay check this out Buck\n\n[Snoop Dogg]\nTrip, me and Cuz used to dress alike, wear the same clothes\nFuck the same hoes, my nigga for life, so the gang goes\nNigga used to bang with me, smoke dope with me\nSold coke with me, went low with me, we gon' fold fifty\nOh so shifty, bitchy bitchy switch the game up\nPut me in the frame up, nigga came up\nSellin 'caine for us, tryin to make a name for us\nSticky, it's tricky and quite dangerous, cuff and chain him up\nMake him talk I bet he squeal, real shit I'm dishin out\nWhy you niggas be bitchin now? I ain't make it up\nI ain't break it up, Cuz you keep me on some bullshit\nI ain't with that bullshit, my nigga I'm on this real shit\nStack a bill shit, crack a meal ticket\nEvery time I spills nig', yeah I'm on this real shit\nNow, don't you, come to the house Cuz, on the dub\nCuz I put my gun in your mouth, now nigga bounce (bounce bounce)\n\n[Hook]\n\n[Snoop - over Hook]\nYou think I'm a fool, a fool\nUh-uh, I ain't fuckin wit you, fuckin fuckin wit you\nAin't no tellin what I do to you, ain't tellin what I do to you\nUh-uh, I ain't fuckin wit you, ain't fuckin wit you Cuz\n\n[Trick Daddy]\nHmm, the life I'm livin, and how I do my thug thizzle\nSeparates me from all of them fuck niggas\nSee I don't deal with niggas who ain't real\nHe in character, playin some life that ain't his\nHe testify, wasn't wise and make deals\nSo stop talkin on the phone boy, the streets got ears\nHere's some niggas doin 20 to 30 years\nThat'll lie on yo' ass, and knock five off his\nAffiliation with niggas that's living ruggedly\nWill get a nigga like me, charged with conspiracy\nBefore you know it you been followed by the knuckleheads\nAnd yo' job is to make his ass do his\nBein in the wrong place, can really hurt your case\nAnd ain't no sense to talkin in codes, they already know\nThem niggas who you used to hustle with before\nKinda wanna play the role so they already told, you know\n\n[Hook]\n\n[Snoop - over Hook]\nYou think I'm a fool, a fool\nUh-uh, I ain't fuckin wit you, fuckin fuckin wit you\nAin't no tellin what I do to you, ain't tellin what I do to you\nUh-uh, I ain't fuckin wit you, ain't fuckin wit you Cuz\n\n[Dion]\nI ain't fuckin wit you...", "album": "Buck the World", "year": "2007-03-27", "image": "https://images.genius.com/c575145ecec0cf746c69f02ad15139be.1000x1000x1.jpg"}], "artist": "Young Buck"}