{"songs": [{"title": "Mr. No Print", "image": "https://s3.amazonaws.com/rapgenius/Lynch-Blood-All-Over-Me.jpg", "lyrics": "[Intro: Sicx]\nYeah.. luchini, Swartzanigga, haha\nThat's why you gonna die\nC.O.S., Northgate, my nigga Fig, Tall Cann G, Capone\nI'm that nigga Sicx\n\n[Verse 1: Sicx]\nAin't nathin funny about this money I'm tryin to make, straight broke\nSo everything I take serious cause 4-25 ain't no fuckin joke\nAn everyday struggle, puttin down this hustle's harder that it looks\nBut the mo' dirt, that I do the mo' these niggas hooked on bein a crook\nSkrillas my major concern I'm burnin just to get a sniff\nOf that scratch, but the catcher can't see me so I'll be ski'n\nWith my mask on; ski money gets my blast on, in a major way\nSo my paper stays stacked, way back behind some boxes\nIn that (?) wait that nigga in Killa Cali stay real\nAutomatically kill, without no feelings still gets dirty\nThen I'm that-a-way, clockin mo' luchi than John Belushi\nMade from +Blues Brothers+ so choose your mother's funeral dress\nThen feel my Smif & Wes, shiftin through you vest, rippin up your chest\nPickin up the rest cause when I does my dirt won't leave a mess\nAll by my lonesome most of them (??)\nBlocks stay hot like rock spots, with one-time posin on each block\nI want G-knots, so I eavesdrops, on C-spots\nThen I'm out with 5-0 never knowin about my caper\nAt home countin up that paper\nCan't wait to, go robbin through your hood\nMr. Invisible's only concern is, to get his\nWhen I get caught with them residuals nigga\n\n[Chorus: Sicx]\nSo call me Mr. No Prints, I never leaves a clue\nIn and out the cut 'fore you know who gettin who\n+Mysteries Unsolved+, that's why you never seen\nThe one that they call Sicx, on yo' late night TV screen\nCall me Mr. No Prints, I never leaves a trace\nIn and out the cut with a ski-mask on my face\n25 to life, that's not on my agenda\nThat's why I'm in and out before you have time to remember\n\n[Verse 2: C.O.S.]\nI let your blood spill, then chase the murder with some 8-ball\nAnd never leave a trace, I'm in and up outta the cut soon as you fall\nLeave blood all over the walls, cause my massive blows to the dome\nFrom the .44 chrome that was shown\nBut it ain't no case cause the bodies all gone\nIn the trunk of the Chev', about to get thrown up off the lid\nCause whoever in the crib won't live\nWhen I kick through yo' door with some O.J. gloves hold onto my .44\nSo call me Mr. No Prints -- cause I never leave no evidence\nI kill off all the witnesess, then I vacate the premises\nShit, that's just another residence victim of them killas\nGettin hit up by that (?) Swartzanigga shit\nDon't make me spill yo' blood\nAnd I'm hittin the bud as soon as I see them brains go split-splat\nSee niggas and bitches get left for dead and alla they kids get kidnapped\nPut a fresh (?) on our (?) cause we planned and plotted\nPremeditated then waited for the right time then we got 'em\nShot through the do', with the flag, hockey ski-mask on my face\nCuz see, I just don't give a fuck\nAs long as they can't see us make our escape\nAnd that's just in case, by some slim chance we leave someone alive\nThat's why we in and up outta the cut so fast they can't identify at all\nGettin high -- count up our dollars and our sins\nThinkin about how easy it is to murder like this\nAnd leave no prints, nigga\n\n[Chorus: C.O.S.]\nSo call me Mr. No Prints, I never leaves a clue\nIn and out the cut 'fore you know who gettin who\n+Mysteries Unsolved+, that's why you never seen\nThe one that they call C.O.S., on your TV screen\nCall me Mr. No Prints, I never leaves a trace\nIn and out the cut with a ski-mask on my face\n25 to life, that's not on my agenda\nThat's why I'm in and out before you have time to remember\n\n[Verse 3: Tall Cann G]\nCall me Mr. 211 a.k.a. jack-yo-ass, 187 blast\nHit a nigga like stick'n'move, then dash on that ass\nGettin away, wit a ski-mask on my face\nIf there ain't no description then there ain't no fuckin case\nFin' ta hit your block tight, with my Glock hidden up under my seat\nLet it pop 'til you drop, 'til you dead up in the street\nGuts and meats all over the concrete, ain't no time to sleep\nUpon this nigga with this trigger love to swig that malt liquor\nCause I'm sick with that Olde English shit, heads gon' split\nBlack chrome spit, 'til you layin up in a ditch\nSo fuck your whole click, fill 'em up with them 16 slugs\nKill 'em up with that Siccness love - do or die\nWho the fuck am I? - Tall Cann\n21st meet your worst nightmare, leave 'em right there\nBloody up in the mud, cause this nigga ain't got no love\nWear my gloves, cause I'm bouts to gets my hands dirty\nGuts all over the place, face ready for plastic surgery\nNever showin no mercy, in a hurry to do my dirt, then I'm out\nPut my strap deep in yo' mouth, try to take yo' tonsils out\nSo watch for the ricochet, for my niggas they dumpin\nWith no clue where they comin from punk\nThen I'm out your block with an empty Glock\nY'all niggas knowin nothin\n\n[Chorus: Tall Cann G]\nSo call me Mr. No Prints, I never leaves a clue\nIn and out the cut 'fore you know who gettin who\n+Mysteries Unsolved+, that's why you never seen\nThe nigga Tall Cann on that late night TV screen\nCall me Mr. No Prints, I never leaves a trace\nIn and out the cut with a ski-mask on my face\n25 to life, that's not on my agenda\nThat's why I'm in and out before you have time to remembe", "year": null, "album": null}], "artist": "Brotha Lynch Hung"}