{"songs": [{"image": "https://images.genius.com/99e8ce9788174966c89e50d3f0df05ed.1000x1000x1.jpg", "year": null, "lyrics": "[Hook 1: Akon]\nMoney to blow so I'm ridin 'round with that Nina (ride 'round with that Nina)\nWith a Hollywood ho with lips like Angelina (lips like Angelina)\nMy diamonds talk for me they say how can I meet ya? (how can I meet ya?)\nG flyer then sky how high, oh I can see her (oh I can see her)\nGot an island on my wrist, girl, I'm cashin' out (I'm cashin' out)\nGot an island on my neck, girl, I'm cashin' out (I'm cashin' out)\nMy diamonds talk for me they say how can I meet ya?\nG flyer then sky how high, oh I can see her\n\n[Akon:]\nI got t-pain around my wrist, Gaga around my neck\nGot o' money so long, I ain't movin' cash in them checks\nI keep wide 3's on my feet, still ridin' 'round with that heat\nForeign cars in my garage, all these bad bitches I beat\nOops! Is that your girl? She said her name was Nina\nOops! Ridin' 'round, gettin' head from a girl named Nina\nOops! I'm sorry, but I'm on my Ike and Tina (Ike and Tina)\nI'm African so you know I got hyenas\nI cashed out on my whips, I cashed out from my check\nThough I ? TV again, got that stations all in my bed\nGot a indoor court, outdoor court\nIndoor pool, outdoor pool\nI ain't lyin', nigga tell it's true\nAsk Ray he done be there too\n\n[Hook 1: Akon]\nMoney to blow so I'm ridin 'round with that Nina (ride 'round with that Nina)\nWith a Hollywood ho with lips like Angelina (lips like Angelina)\nMy diamonds talk for me they say how can I meet ya? (how can I meet ya?)\nG flyer then sky how high, oh I can see her (oh I can see her)\nGot an island on my wrist, girl, I'm cashin' out (I'm cashin' out)\nGot an island on my neck, girl, I'm cashin' out (I'm cashin' out)\nMy diamonds talk for me they say how can I meet ya?\nG flyer then sky how high, oh I can see her\n\n[Verse 2 Cash Out]\nOk, I drop the top, hop in\nHoes they coming by flocks in\nBirds they coming by flocks in\nPass them birds like Stockton\nPlay with my money I'm popping\nNo acting, but it's a movie\nGot Spinz on the beat so we ain't losing\nDon't act like your ho ain't choosin\nI done blowed up, yeah I'm the bomb\nRiding round blowing on stank bombs\nPussy so good you should thank moms\nTop floor suite chilling at the Palms\nWe want the whole loaf leave y'all the crumbs\nTil then I'm running my check up\nAnd it's fuck a Bugatti I'm calling my jet up\n\n[Hook]\nCool\n36 O's ho riding round with that nina\nRiding with a ho named Keisha, smoking on Keisha\nMy diamonds talk for me they say hi can I meet you\nShe fly high, high in the sky, ho I can't see you\nGot a condo on my wrist girl, I'm cashing out\nGot a condo around my neck girl, I'm cashing out\n36 O's so I'm riding round with that nina\nMy diamonds talk for me they say hi can I meet you\n\n[Verse 3 Cash Out]\nIt's big pimping over here... Church\nTime to cop the Maybach already had the vert\nI got big money visions, Sammy Sosa pigeons\nWhat that mean? That mean they jumping out the kitchen\nAnd I'm on the money mission, nobody can stop me\nJust grab your camcorder, press record and gon' and watch me\nAnd you can skate on my ice just like you playing hockey\nAnd in the booth I beat the beat up, call me Rocky\nYeah I'm cocky\n\n[Hook]\n36 O's ho riding round with that nina\nRiding with a ho named Keisha, smoking on Keisha\nMy diamonds talk for me they say hi can I meet you\nShe fly high, high in the sky, ho I can't see you\nGot a condo on my wrist girl, I'm cashing out\nGot a condo around my neck girl, I'm cashing out\n36 O's so I'm riding round with that nina\nMy diamonds talk for me they say hi can I meet you", "title": "Cashin Out", "album": "KonKrete Jungle"}], "artist": "Akon"}