{"artist": "Boogie", "songs": [{"album": null, "title": "Catching Feelings", "year": null, "lyrics": "[Hook: Tink & Boogie]\nYou say, you say, you say, you say anything\nHope you ain't got no plans with no wedding ring\nShits been seeming weird\nI mean what's the problem here?\n\nYou turned your back, did the same on you\nBeen acting up, set the stage for you\n\nTell me you would never break my heart\nIt's crazy how we quickly fell apart\nCatching them feelings, catching them feelings\n\n[Verse 1: Boogie]\nDon't tell me you love me, no\nDon't cover my eyes when it's raining and tell me its sunny, no\nDamn, you the first to my aid and the first one to touch me\nWhat's cool at that bottom? That kush done got rough and it stopped looking up\nYou thought you was above me\nI'm feeling like...\n(You should, you should)\nQuit playing and come throw that pussy on me\n(You should, you should)\nTell your friends to stop lurking and lookin\nSee you my nevada when I'm tryna' save up\nI got nirvana, you gone fuck my faith up\nI ain't trying to see your sauna, I've been trying to chill out\nEvery time I wake up I'm reminded of the drama\nYou know I ain't trying to Tink about it\nHoo! I make your heart heavy\nWonder if that made you fall faster\nBut I ain't tryin' to Tink about it\nBut now you out here fucking with some lame niggas\nKnowing you don't want to be about it\nIts 'bout time that a nigga told you \"choose up\"\nSee I ain't trying to fuck your views up and I ain't gotta tell you too much\nCause you say\n\n[Hook: Tink & Boogie]\nYou say, you say, you say, you say anything\nHope you ain't got no plans with no wedding ring\nShits been seeming weird\nI mean what's the problem here\n\nYou turned your back, did the same on you\nBeen acting up, set the stage for you\n\nTell me you would never break my heart\nIt's crazy how we quickly fell apart\nCatching them feelings, catching them feelings", "image": "https://images.genius.com/df2a27b9bc740c4a60548a743cf0589a.640x640x1.jpg"}]}