{"songs": [{"year": "2016-12-09", "image": "https://images.genius.com/bd7ff5bab4657a4d996bbe3d5d90570e.800x800x1.jpg", "title": "Bankjob", "album": "Hoodtape Volume 2", "lyrics": "[Intro]\n?Seyed?: Bruder?\n?Kollege von Seyed?: Hm?\nS: Bei mir ist's gerade wieder voll dreckig\nIch brauch Cash, ich brauch Flous\nKvS: Ah, ja Bruder\nLass' 'nen Kiosk beklauen oder 'nen Solarium\nOder die Spielo, Alter\nS: Bruder, da springt nicht viel raus\nWir brauchen mehr!\nLass' was Größeres starten!\nKvS: Was denn? Was denn?\nS: Lass uns 'ne Bank ausrauben\nKollegah: Jungs ganz kurz, ich hab' hier noch den Wuschelkopf ne\nS: Scheiß' auf den Wuschelkopf! Oder oder warte - wir kriegen locker 3, 4 Millionen in sein Kopf rein. Pack den mit ein!\n\n[Part 1]\nDer Van fährt die Kiezstraße 'rauf\nDie Schiebetür schwingt auf\nWir spring auf, die Uzi im Arm und Skimaske auf\nUnd wir fahren durch die Straßen\nHör'n den Polizeifunk\nChecken Tarnung und Waffen\nGehen den Plan durch und warten vor der Bank im Finanzdistrikt\nStürmen durch die Tür\nDer Wachmann kriegt den Gungriff in sein Punkgesicht\nIch schieß' ne Salve an die Decke\nAlle auf den Boden, keine Faxen\nDu da hinten am Schalter in der Ecke\nIch will deine Hände seh'n\nNur eine falsche Bewegung und dein jämmerliches Dasein wird ein schnelles Ende nehm'\nUnd jetzt das Cash in den Koffer ohne Farbpatron'n\nSonst frisst du Hundesohn noch bevor ich fahr', Patron'n\nIch hol' mir den Schlüssel für'n Tresorschließfachraum\nAlles rein in die Taschen und dann sofort wieder raus\nUnd in Vollspeed nach draußen in den Van und auf den Freeway\nBevor die schwarzen Bullies des SWAT-Teams anrauschen\nDie Sirenen werden leiser, wir hab'n die Cops abgehängt\nDer Van fährt runter von der Straße auf 'nen Schrottplatz und bremst\nIch nehm den Koffer, verbrenn meine Kleidung und Sturmmaske\nHöre nebenbei im Polizeifunk die Durchsage:\n\"Keine Spur von der Bande\"\nDer Van wird in der Presse vernichtet, wie bei 'ner Rufmordkampange\nWir teilen den erbeuteten Besitz und das Cash\nUnd fahr'n dann in verschiedenen Wagen in alle Richtungen weg\n\n[Hook]\nWaffe unter'm Tanktop, Wagen voller Sprengstoff\nIch hab dich im Fadenkreuz wie'n Hemdknopf\nRück die Scheine raus an den Gangboss\nDas hier ist ein Bankjob, Bankjob\nWallstreet Banktower, Endstopp\nIch hab dich im Fadenkreuz wie'n Hemdknopf\nRück die Scheine raus an den Gangboss\nDas hier ist ein Bankjob, Bankjob\n\n[Outro]\nS: Alter wieviel Cash haben wir denn jetzt?\nWas ist das? Wieviel ist das?\nKvS: Hm 5 Millionen\nS: Boah, krass, Alter! Was machen wir damit? Lass uns direkt - let's go - ne Villa kaufen. Irgendwas... Verrücktes!\nKvS: Nene, nenene. Ich weiß was Besseres!\nS: Was, was?\nKvS: Casino"}], "artist": "Kollegah"}