{"artist": "E-40", "songs": [{"title": "’Cause I Can", "image": "https://images.genius.com/841113c618ea11b5cbd44a43565e925e.788x768x1.jpg", "album": "Charlie Hustle: The Blueprint of a Self-Made Millionaire", "year": "1999-11-09", "lyrics": "[Jayo Felony]\nForty-WADAHHHHHHHHH!\nEhhh.. (ehh..) YEA!\n\nWe do this for life ya dumb fucks, y'all niggas is dumptrucks\nThe type to bitch up, and getcha eyebrows plucked\nMark my words loco gon' have it like Motown's heyday\nSo dope they name us all twice like we, Pelle Pelle\nYou better be prepared to call me Billy Loco Gorde\nPop my collar with none other than Earl-40\nSquab on a square like it's high noon, cousin wit tycoons\nIf you fuck with Sick Wid It y'all niggas gon' die soon\nI can't make a fiend do nuthin against they will\nI just leave they eyes so yellow you see em and yield\nWHOA -- spill the guts of the ones that's not real\nSo when you see me nigga scream out one shot kill\nGotta, spot on my shoe from all the blood we spill\nI get it even if I don't want it nigga like free refill\nY'all don't wanna give us our props, y'all niggas gon' get dropped\nNigga fuck hip-hop, nigga this CRIP-hop {*gunshot*} WHAT?\n\nChorus: E-40 + Jayo Felony (repeat 2X)\n\nPimp'n why you splurgin? (Cause I can)\nWhy you go up in my beer? (Nigga cause I can)\nWhy you smokin all that broccoli? (Cause I can)\nWhy everybody think you rich? (Nigga cause I am!)\n\n[E-40]\nMotherfucker ?? grew up on the undertuckamajig\nMy destination control the block\nFast ass wad full of ones in my pocket\nWith a hundred dollar bill wrapped on top\nThirty-two shot extended clip to keep it trill when I pop\nDurin the summer it's Zenith's but in the winter I ride stock\nBetter believe us don't try to play us for false\nCause it's not a game no way no how\nBilly Loco, Charlie Hustle and Major Payne nigga now\nHow you think I was gonna deallllllllll with it?\nFuck around and wind up gettin killllllllled with it\nBeotch! You booty rappers get penalized, and expedited\nCause dey don't think about they shit, before they write it\nWe don't sell narcotics with the po-po problems, playboy take a look\nWe off into real estate, CD's, millions of wealth\nUsed to be crooks still hang around crooks, dealers and ex-cons\nNiggas with Luke's and ?? ?? shirt on\nPlayers with cake, pushin they weight, try to find the last trap\n'fore they bloody wrecked illegal corporate scratch\nWhat they buck?\n\nChorus\n\n[C-Bo]\nAre y'all fools ready for dis? It's a loco for sure I'll blast\nWith Billy Loco and 40-Water we take your life then we haul ass\nTall cash stacked in the basement\nCan't leave the house with less than a zip an a extra clip\nNiggas wanna know why I get down like this ain't that a bitch?\nYou see my, life on TV cause it's the daddy with the ?? and a P\nNiggas just can't seem to get away from PD while they surrounded me\nAnd houndin me cause I ball hard, on parole and a double-R\nFifty to a hundred G's and je-wels on wrists\nNigga we ghetto stars\nShit my niggas spent G's to push, drop Bentleys\nRemi Mark sippin, Cristal, X-O Hennesey\nAnd better believe when we enemies we spray wit these\nEvery night at twelve have your whole motherfuckin city prayin on knees\nAnd still 40-Water pass the strap and I blast, still hit the gas\nHad to tear his whole motherfuckin head off tryin to ?? the stash\nEvery man they all man, quick to pull a lick out the Brougham\nOnly reason I rode down on that bitch ass nigga, is because I can!\n\nChorus"}]}