{"artist": "PARTYNEXTDOOR", "songs": [{"album": null, "title": "Fuck Wit Me / PG", "image": "https://images.genius.com/9aa5e31e6102a26b81e1dafaa1780170.495x495x1.jpg", "lyrics": "[Part 1: Fuck Wit Me]\n\n[Verse 1]\nIt's been months, it's been too long, long\nBaby, you know\nFuck what you're doing now, quit doing that right now, baby I\nGot better things for you to do, got better things for you to see\nGot a better place for you to live, and a better place for you and me, oh baby I'm honest\nPlease get a [?] when I'm on it\nRunning through the city and you know that I'm on it\nEvery city [?] remedy\n\n[Chorus]\nBaby, would you fuck with me? Fuck with me, fuck with me\nBaby, would you fuck with me? Fuck with me, fuck with me\nFuck with me\n\n[Verse 2]\nReady or not baby, here I come\nSorry I didn't get that your drunk\nIt's 3 a.m. and I know\nYou're on your way home from somewhere that's poppin'\nI know you've been dropping\nIt's harder than I [?] to that same song, it go\n\"Ah naw, naw, bands will make her dance, bands will make her dance\"\nI was so unfair, baby aaah\nTell me if I lie, I know that [?] don't lie\nYou can go and make her right, two don't make no right\nFuck that baby girl, three wrongs don't make no right\nFour wrongs don't make no song\nFive wrongs gonna make it long\nSix gonna make too long\nSeven gonna make it right, ohhh\n\n[Bridge]\nFuck with me, fuck with me\nDo you fuck with me? Ohhh\nBaby, do you fuck with me?\nOhhh, ohhh, baby, baby, baby, do you fuck with me?\nHuhhh, huuuh, yea, yea\nYea, ye\n\n[Conversation: Girl &  PARTYNEXTDOOR]\nI care about Jahron\nNo one cares for PARTYNEXTDOOR\nTurn you phone off and turn into Jahron\nAnd love me, please\nWhat?\nI don't wanna hurt you, can you please...\nYou don't wanna hurt me?\nYes!\n\n[Part 2: PG]\n\n[Verse 3]\nNow I'm on flexin', dealing with possesion\nYoung nigga, young nigga fall in love real quick\nLost that love real quick, mama made me deal with it\nModels over 21, plenty bitches, plenty summers\nTold you I got plenty summers, mama still tripping out\nBuy my mom a bigger house, couldn't be a nigga house, damn\nLooking for a real bitch, looking for a real one\nProbably gon' steal one, oh\nRiding with the go getters, riding with intentions\nWe don't want intentions, since there is more money\nThen you know there is more protection\nGot a little bad bitch on my arm\nCause it's never bad for my reflection\nYou know I need that good weed, good sex, good neck, et cetera\nHoes leave, hoes call and hoes trifling, God bless it\nBad bitches sitting and they mix sound good\nMake it sound good\nSnakes was in the garden and it's not our good\nCause the time's good\nI ain't gotta preach to ya', nothing like a leech nigga\nI ain't got a leash to ya'\nOMO I'm proud of it, sitting on the cloud of it\nProbably need to sell it like Clicquot\nMy ego is bigger than your ego, get rich off this, dirty Contradicting nigga couldn't piss this shit\nMy bitch 5'5\" waist 33\nOnly white rice, raw fish, seaweed\nSushi in the Ritz but she Swiss though\nCause you know they like their chocolate with a kiss though\nCan't believe she out here calling Wi-fi, \"Wee-fee\"\nBut her mama got an ass, she a peace treaty\nOnly now how to move fast, she 3G\nAnd you'll never get a fast one, I'm too deep\nParty no PG nigga\n\n[Outro]\nHuh huh, yea, yea, yea, yea\nParty no PG, nigga\nParty no PG, nigga\nParty no PG", "year": null}]}