{"songs": [{"year": "2003-01-01", "title": "Letter to Omnipotent", "image": "https://images.genius.com/e419c674f3606427aa03bb9748a8b873.360x360x1.jpg", "lyrics": "[Intro: Saigon and (DJ Whoo Kid)]\n(Ha ha ha).  Word.  (Saigon).  Yo dawg.  What up?  Holler back, man.  (Abandoned Nation).  This here.  This here ain’t for errybody, man.  This is for the real ones.  (Whoo Kid)\n\n[Verse 1: Saigon]\nThis here is for all the missed peers I left in the pen\nEven the ones I’ll never see ever again\nWhen I get on, I take care of your brethren and them\nThey talk about you all the time—you a legend to them\nIf I could, I would just make the time fast-forward\nNew York is a lot different than when you last saw it\nYeah, dawg, it’s mad more chicks.  But the pussy ain’t free no more—them whores want cash for it\nPolice’ll still harass-a-holics.  Most niggas under thirteen still be on some basketball shit\nBut the ones older than that, they rolling in packs\nAnd at least three of these niggas is holding a gat\nAnyway, God, I kind of miss walking the yard\nTalking with y’all ‘cause now I’m in New York and it’s hard\nI done caught a new charge.  I lost the god J-E-R-R-Y.  Why he had to die?\nI thought “When I get home, I see love get shown”\nAll I seen was drug strips sown and slugs get thrown\nShould I play the good guy or should I\nThrow in the hood, I (Should I?) make some niggas in the hood die?\n\n[Bridge: Saigon]\nShould I?  Huh?  (Tell me, man.  Omnipotent, man).  Huh?  (Let me know.  Somebody write me, man).  You tell me, man.  (I don’t know what the fuck to do).  For real.  (I’m losing it out here, man.  But you know what, man?  (What you used to do?))\n\n[Verse 2: Saigon]\nI used to stand on the block, selling cooked-up rock\nMoney busting out my sock ‘cause I really would clock\nI [taught to?] robbing the spot—shit’ll really get got\nWhenever the gun’s hot, niggas really get shot\nDon’t give a fuck if you a willy or not\nIf you got what I need, I’mma receive or the milly’ll pop\nSo what the verdoct?  The bird drop.  Throw the rock like Elvis Grbac\nWord, I’m verbally hot like the Third Rock\nAnd I’m repping the pen in every song I ever sung in\nIt’s all I know—shit, I was brung in as a youngin\nBear witness to coming\nReal rap right on time while all y’all crime-rhyme niggas is slumming\nY’all muhfuckas see a nigga—I’m still bumming\nBut I got game, so I can still cum in your woman\nYou could still catch one in the stomach\nAnd I still let the MAC strike.  You act like you want it or something\n\n[Outro: Saigon]\nHuh?  (Ha ha).  Punk.  (That’s right).  Motherfucker.  (Fuck all y’all.  I’m here)", "album": "The Best of Saigon A.K.A. The Yardfather Vol. 1"}], "artist": "Saigon"}