{"songs": [{"image": "https://images.genius.com/ff86c67b2b24d56ab53e7113fd4cd475.500x500x1.jpg", "lyrics": "[Verse 1]\nI'm out of this world, not your run of the mill'n\nMy name is Furl I'm the owner of the building\nI'm a stoner and I'm chillin' with two bitches like Jack\nI pimps and I mack drive a Benz and a 'lac\nMan I've been in the back wit the groupies and the stars\nI've been out front with the thugs and the guards\nI've been in the yard with the Mexican mafia\nAnd I only run with niggas that'll kill and die for ya\nI'm popular, I'm a rap star\nBut I live like a rock star running from the cop cars\nI drop bars wit slaps that knock hard and I charge for this dick extra large\nI'm sicker than SARS higher than Mars and I treat my bitch like an ATM card\n\n[Hook:]\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\n\n[Verse 2]\nShe's in the buildin and she's feelin herself\nShe's lookin bad man I'm willing to help\nStop it baby you're killin' yourself\nCome on I got your back you could chill in my Delt'\nI'm feelin myself too\nMan just imagine some of the things we can do\nYou under me\nMe under you\nThen we can catch the Liquor store before 2\nWe can hit my nigga and go get some shrooms\nAnd if you still want to kick it we can go get a room\nIt won't cost you much, I'm a good buy\nDick-on-discount? Bitch good bye!\nWhat do I look like Mr. Frank Fuck for Free\nNo dough ho? You can't fuck with me\nGet the fuck out\nBitch you still in my Delt'\nYou full of shit and I'm feelin' myself\n\n[Hook]\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\n\n[Verse 3]\nI'm a West Coast Bad Boy\nI represent it\n\"Dre, that's a bad toy, is it rented?\"\nHardy har har very funny\nYou don't hear my tummy\nI gets my money\nMy stomach ain't growlin\nI'm stylin' and wildin', drinkin' vodka straight fuck a Long Island\nI want my own island bet you I'm a get it\nI switch hit and play with both mitts\nPack a four-fifth I'm after your bitch\nHe ain't doing it right she's after your scritch\nAnd I'm after hers with these macking words, nerd\nI thought squares, stayed sharp\nYou're nothing but a mark in a bucket Skylark\nI'm playing my part\nI'm Mr. Furley\nQuit interrupting I'm talkin' to your girly\n\n[Hook]\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself\nI'm in the buildin and I'm feelin myself\nMan I'm feelin myself", "year": "2004-07-20", "album": "Ronald Dregan: Dreganomics", "title": "Feelin Myself"}], "artist": "Mac Dre"}