{"artist": "Cam’ron", "songs": [{"title": "Fleegod", "album": "The Program", "year": "2017-11-10", "image": "https://images.genius.com/2d988f3cf7ed4e06f71fc90a8d5abc57.1000x1000x1.jpg", "lyrics": "[Verse]\nYou don't know just what your soul does\nWhen there's no love and you sold drugs\nOn the first of the month like Bone Thugs\nAnd the damn funds just won't budge\nAnd you live right where the crime was and the nines bust\nYou tryna shine 'cause the grinds on your mind\nSold nickel and dime without doing time. Don't mind us!\nStill get computer's 'putin\nNuisance, don't care 'bout your two cents\nYou vexed, you'll never get the blueprint\nSwitch siders, hopping a new fence\nRelax before I relapse, these facts\nSqueeze that three caps where you eat at\nWhat you call feedback, bro, I don't need that\nBelieve that, go home with your kneecaps\nBlowing on Cheech & Chong, them sweet ass chron'\nTo each his own, make media leaches leave alone\nFuck sticks and stones, get beat to bones\nYou reach for phones, I reach for chrome\nThen lie when gunshots reach your dome\nThink these is poems? You've seen all the money and cars\nYou'd think that Meech was home\nMonogamy, nah, possibly do pornography\nListen to my philosophy, Cam's autobiography\nOutside on Lennox Ave with the coke and the crack\nAnd the pen and the pad with the MAC in the back of the 'lac\nWhile I'm racking on racks, you looking at endless swag\nFrom Cassius Clay to bouncin' yay\nIn the fastest way, put the gas away\n'Cause all you gon' hear is, \"What's his name died...\"\n\"What's his name died?\" he done passed away!\nPull out the arms, body armor on\nDead to a farm by a bag of hay, you a castaway\nSunday through saturday, St. Patrick's Day\nMother's Day, any other day, Labor Day, Father day\nYour death date on your death certificate\nIs our day, that's what I would say\nI beg your pardon, Vanessa Carlton\nYeah, we a thousand miles away\nAt the ballet, wearing Balleys\nThat's out of date, that's our debate\nWhat you wanna eat baby, trout? Steak?\nSteak, potatoes? How about baked?\nInner city, out of state\nI want dessert, that pound of cake\nYou sounded safe, from down the base\nWe'll surround your place with a pound of tape\nPut around your waist, then bound your face\nLegs and arms, you down to race?\n(Laughter)"}]}