{"artist": "Andy Mineo", "songs": [{"title": "...There", "album": "II: The Sword - EP", "year": "2018-09-21", "image": "https://images.genius.com/a3a83a83dd6d9d73956b9520636049fd.691x691x1.png", "lyrics": "[Verse 1]\nNobody ever make it out alive (Whoo)\nThis ain't first class I got upgraded\nPenny pinchin' rapper even though I made it\nMama got her clothes from garage sales\nTook the low so I could have the top shelf, yeah\nHumble thyself or God will\nYoungin' with a little drive like a Hot Wheel, yeah\nNow it's pop culture when you're poppin' pills, right?\nRather have us medicated than healed, right?\nLook, blog said I'm in album mode\nBoy, I'm always in album mode\nMy slice need the a la modé\nNew York, like Al Capone\nWhole squad in the Patagon'\nMy girl b-b-bad, bad to the bone\nI keep losin' my wedding ring\nI gotta go get that tatted on\nI'm–out in Europe, it feel just like the borough\nShoutin' \"YERR\" Spent a Euro, got dessert, that's that churro\nNeed the word, that's eternal\nI write the rap, no journal\nMy pen got me some wins, I feel like Joe Paterno, aye\nI don't got no time for beefin' with nobody else\nI've been dealin' with my demons, I been beefin' with myself\nI need Heaven down on Earth 'cause it's feelin' like it's Hell\nThat's all that I can do, uh\n\n[Pre-Chorus]\nAh\n1 a.m., I ain't sleepin'\n2 a.m., I ain't sleepin' (Not at all)\n3 a.m., I ain't sleepin' (Wide awake)\nMaybe I should get some sleep in\n\n[Chorus]\nI got angels flyin' all around\nI pray they take me off the ground\nI know I got one lookin' down on me\nOn me, on me\n\n[Interlude]\nEvery sword got two edges\nHow will I be remembered?\n\n[Chorus]\nI got angels flyin' all around\nI pray they take me off the ground\nI know I got one lookin' down on me (On me, on me)\nI got angels flyin' all around\nI pray they take me off the ground\nI know I got one lookin' down on me, on me, on me\n\n[Verse 2]\nStanding alone in the parking lot of The Truman Show\nPrivy to things I never knew before\nLaying flowers at the casket of a twenty-two-year-old me\nIt sound unusual, but listen death is beautiful, see\nNothing grows until it finally dies\nAnd you don't ever find the truth until you find the lies (Well)\nNow that I've–started pulling the strings, some things are unraveling\nAnd I don't like what I'm seeing but yet I proceed (Deconstruction)\nThis the moment I hold it all in question\nIt's terrifying 'cause there ain't nothing to rest in\nThe sense of a lost direction, it's messy but still I press\nAnd I'm desperate to find the answer, I can't go on with the guessing\nDid 81 percent of the people I call my brethren\nPut an elephant in the room and say it was Heaven-sent?\nI don't know what Bible you reading, what God you believe in\nBut that don't sound like reason, it sound like you sleeping\nSo I'm leaving, this my Last Supper who treatin'?\nTake a stand for the knee and your Nikes still creasin'\nI let it all fall apart then I took the pieces\nReconstructing everything I once believed in, yeah\n\n[Outro]\nWe're sorry, you have reached a number that has been disconnected or is no longer in service"}]}