{"songs": [{"year": "2012-11-01", "title": "Drunk in San Francisco", "image": "https://images.genius.com/c093374bafeb91fa9e0cbe11200275cf.500x500x1.jpg", "lyrics": "[Hook]\nI'm always drunk in San Francisco [X6]\n\n[Verse 1: San Quinn]\nIt's a staring artist, in need of racks\nYou heard him too? I'll drink to that\nSittin' at the beach, drinking like a fish\nFit the privilege, arguing with my bitch\nShe said I need to quit, or find another groupie\nThen she took the car, made me ride the munie\nBottle gone, at the bus had to hobble on\nLike a real wine-o, gettin' my wobble on\nEnd of the market, busy drunk talking to the homies\nListen tellin' Lauren diggin' in the garbage\nFuck, like I'm not a star\nLookin' for another card, free ride on the cable car\nFrom brown to white, China Town on the hype\nPatron shot after shot, no water and Sprite\nLookin' for a fight, runnin' up on tourists\nNot too aware, but I'm for sure, ripped\nSee me on one, let me be me\nYou better calling SFPD\n\n[Hook]\n\n[Verse 2: Tuf Luv]\nWhat time is it? what day it is?\nHow the hell I end up it the baby crib?\nI don't drink much, but when a nigga do\nI get drunker than a pirate in a sailor suit\nI'm on a bar with a bottle in my back pocket\nMe and Paul Masson, just left crackin'\nWe about to go kick it with Brandy\nHer and her little sister Landy\nAt 11:45, at my pier at 39\nHad the bar at a dime, with a beer and a lime\nSomebody try to draw the line I try to stop the cakes\nSoon as the bottle hit my lips I'm like Frank Buttes\nDrunk at the curb, askin' for my money back\nSlurring words, yelling \"what the look you fuckin' at\"\nNow everybody lookin', like ain't that a bitch\nI'm at the 'Niner game, in that Raider fit\nAt the Giant's game, in that A's hat\nWhen people flip me off, I just wave back\n\n[Hook]\n\n[Verse 3: B-Legit]\nYeah, I know the club owner, I like to rub on her\nI'm in the crib with 3 shots and a cold Corona\nI run laps like the 500 Daytona\nTell I find fine women, wanna know my persona\nThen I'm on her like a light switch\nThe right bitch, that'll try to fuck a dyke bitch\nI take her out to Candlestick\nGet another 50cs she can handle with\nThat nigga B-Le, he be on that black\nCognac, Hennessy, yeah he fuck with that\nI seen him at the Glass Cat\nGettin' splat at the back, it was hella racks\nAnd, boy if you only knew\nWhat I do, when I ride through them avenues\nI'm talkin' 21, 22\nMy heels on, she about 6 in the few\nI let them know what the thing do\nWe brought our shoes on so it cool, baby, act a fool\n\n[Hook]", "album": "A Hustler’s Hope"}], "artist": "San Quinn"}