{"songs": [{"year": "2000-04-04", "image": "https://images.genius.com/b70930fc56c82c3038f706c659b43fc6.500x500x1.jpg", "title": "Laughing at You", "album": "Yeeeah Baby", "lyrics": "[Intro: Tony Sunshine]\nHa Ha Ha\nDo you see me now\nYou remember me? The guy from the back of the class that used to wear the glasses?\nThe one you used to laugh at?\nLook at me now, brother\nDo you like fruit?\nWell, I'm chewin your girls nipples\nHow do you like them apples, asshole?\n\n[Hook: Tony Sunshine & Big Pun]\nI'm laughing at you\nI'm laughing at you now\nYou told me I was ugly\nI was scared to crack a smile\n[Ha Ha Ha Ha Ha]\nI'm Laughing at you now\n[Ha Ha Ha Ha Ha]\nI'm laughing at you\n\n[Verse 1: Big Pun]\n600 Benz, 20 inch rims, house on the hill, hittin' mad skin\nHa Ha Ha Ha Ha Ha Ha Ha Ha\nIt was all a scheme I used to load the teck with the magazine\nSo I was mean but I still had a scheme\n17 years young everything seemed fun\nStill considered a veteran cause I feared none\nPun's from the street where there ain't no rules\nBut carried heat cause he ain't no fool\nAin't no room for dollars in negative digits\nSo debted followers and got rid of the quitters\nThat never forget us cause we've been down since the\nGenesis 200 horse power to 400 Pegasus\nThe messages don't sleep till its over\nNext thing you know shorty seven feet\nTippin' over I'm still in the water drownin'\nKnights and murder till the immortal terror squad\nThrew me a life preserver now im ice forever\nStomach bustin' out the white carrera\nLife is better now niggas wanna rhyme together\n¡Ay qué será! What can I do but take you to strive\n¡Ay qué hago! I hope the streets don't take me alive\nYou wasted your life and refused the struggle while\nI aim for the sky pay dues and bubbles I WIN!\n\n[Hook]\n\n[Verse 2: Big Pun]\nNow it's not funny cause I'm hot and got a pot of money\nA lot of hunnies around (Don't stop do the brown for me)\nMy every wish is her command call her bitch she understands\nI reminisce how she used to dis me and my man\nCheck part of the plan she told my son I wasn't the man\nI ain't gonna to stop till I got a heart in my hand\nI can silence the lamb but couldn't silence her cause\nShe was as wild as a man with a bottle of liquor\nI'm not going to hit her I'm gonna debt her tonight\nDouble platinum now shes one in the tribe well in the ride now\nWell in a fly gettin' high now no more whiteout send the cubans\nTo provide now it's my world I demand my respect\nGive me your girl or get slapped in your neck\nAin't nothin' change im still humble and modest\nAnd im always proud to admit I came straight from the projects\nHardy har har har\n\n[Tony Sunshine]\nDon't you forget about me now\nDon't(4x)\nDon't you forget about me now\nDont(4x) naw\nNah Nah Nah Nah....\nNah Nah Nah Nah....\nNah Nah Nah Nah.....Nah Nah Nah Nah\n(*repeat 2x*)\n\n[Tony Sunshine]\nDon't you forget about me now\nI said don't..don't...don't...don't\n\nChorus"}], "artist": "Big Pun"}