{"songs": [{"title": "OG Bobby Johnson (Freestyle)", "lyrics": "[Intro]\nM.A, nigga!\nYes, Brooklyn!\nRed Life, whattup?\nPack, nigga! Hanh!\n\n[Verse]\nY'all packin' and cockin' and poppin' your pistol\nI hear you, I get you (yeah I hear you)\nBut I'm loadin' them rockets\nI'm shootin' them missiles and aimin' at tissues\nInfra-red beam with a scope on top\nSo you know I won't miss you (nah I won't)\nYou a lame nigga, so your niggas won't miss you\nShit, they can go with you\nMy bullets rainin', shit don't even drizzle\nMy shit is official 'cause my shit'll lift you\nMy niggas don't tell, we don't talk to officials (nah)\nOr the police or the people who whistle (no rat, nigga!)\nNo snitchin', no rattin', no tellin'\nNo, no, no, no—none of that shit (none of that shit)\nBut we do hold shotties that put holes in bodies\nMake niggas do back flips\nIt's Red Life, nigga, we 'bout that action\nPumpin' that ratchet\nBullets go Boop! Boop! Boop!\nRight through your packin', now you collapsin'\nBang bang, nigga!\nYo, Danger, tell 'em it's pain gang, nigga\nI been doin' this shit, my name rain, nigga\nMy brother was a Blood, I don't gang bang, nigga\nMy dyke-ass bitches made a lot of dykes mad\nI don't care 'cause I love the hate\nWasn't even gon' drop him\nI was gon' wait 'til April, but shit, I ain't wanna wait (man, fuck 'em!)\nSome niggas was hatin'\nSome niggas respected, the bitches they loved it\nSome dykes couldn't take it\nIt hurt 'em so bad they was sick to they stomach\nMy young niggas thuggin'\nThey rob you in public and tell you to run it (gimme that!)\nPut that thing to your stomach\nAnd tell you be quite and better say nothin' (hold that!)\nNo respect for these niggas\nPull out the choppa, we wettin' these niggas\nYou, you, you, and the rest of these niggas\nBetter pray to God 'cause it's death for these niggas\nI'm a threat to these niggas\n'Cause when my shit drop it's effectin' these niggas\nEvery time I'm in the booth I'm upsettin' these niggas\nBut tell 'em pull through, I got a TEC for these niggas (brrrat!)\nEver since my brother died\nYeah my mind ain't really been right\nThat's why I got this 9\nIf you get out of line you'll be callin' for Christ (Amen!)\n'Cause if I don't kill you\nI'll make sure that you'll never walk in your life (again, nigga)\nWe fuck niggas up\nBut my niggas is shooters, my niggas don't fight\nI'll take your bitch and I'll fuck her that night\nYour bitch ain't faithful, I'm fuckin' your wife\nI'm fuckin' her right, your bitch is a freak\nYou should see what she do\nWhen we turn off them lights (she a thot, nigga!)\nYou bitches is trife but\nNigga, you wifed her, I really didn't like her (I ain't like her!)\nI just wanted to pipe her\nAnd put my strap in it eight inches inside her\nAnd for these pussy-ass niggas\nI got another strap that would put eight inside ya\nAh, that nina my bitch\nShe do not miss and I love how she grip\nWhen she get cocked she be poppin' at lips\nI love how her handle get hot in my fist\nOhhh, that nina, that nina\nThat little bitch, man, would fuck the whole scene up\nNut on the track, I was fuckin' this beat up\nFucked it so good I done bust through the speakers\nTell these niggas to keep up\nThese dykes wanna be her\nWhen niggas hear my shit, they be like:\n\"She the shit, yeah the rap game need her!\"", "album": "M.A The Mixtape", "year": null, "image": "https://images.rapgenius.com/071f7b83da2abceaee10be14972fceb3.800x800x1.jpg"}], "artist": "Young M.A"}