{"songs": [{"title": "Triple S", "lyrics": "[Intro: Sequenta]\nYo, those sneakers are fucking garbage\nThey look like some orthopedic, old man, fuckin' shoes\nSome old man barbecuin' in the backyard\nWalk across the street type shoes\nNiggas just buyin' them 'cause\nThey wanna act like they got the money\nMost people don't even have the money for that shit\nThem shits is ugly as hell\n'Cause it's not a fashion statement\n\n[Verse 1]\nDoin' one-twenty in the ends (One-twenty)\nI lost the top of the Benz (Where?)\nI was on the jugg from Oxford Gardens\nPeddlin' suttons for a bens (It's Tom)\nThem man better say thank you (Say it)\nThem man better make amends (Right now)\n'Cause independent top twenty\nGod forbid when I get a top ten (God forbid)\nBack when I was way down (Way down)\nNo, I couldn't see man then (Nah)\nSo, you could not see me now (Now)\nNever try and call man again (Nah)\nStop that, we are not friends (We're not)\nPlease go and write your sends (Go write your)\nChanel know that I love their fabrics (Double C's)\nThis a new season, men's (Season)\nMy niggas young brown kings (Rise up)\nNone of us know about treason (Nah)\nBros on volts with the furdee\nWallah give ahki a reason (One)\nBeef gets peppered and seasoned (Right now)\nComin' like I serve up yard food (Huh?)\nWashed old niggas on my dick (Wow)\nDem men are still up on Yahoo (Eugh)\n\n[Chorus]\nI just arrived (I'm here)\nNo way I'm goin' out sad (No way)\nThat boy is my son (My yute)\nThat means I am his dad (I'm pops)\nCopy my style? You're nuts (You're crazy)\nGod knows I got it in the bag (The bag)\nDem man are stayin' inside (Where?)\nComin' like man are on tag (Uh)\nI just arrived (I'm here)\nNo way I'm goin' out sad (No way)\nThat boy is my son (My yute)\nThat means I am his dad (His pops)\nCopy my style? You're nuts (You're crazy)\nGod knows I got it in the bag (Secured)\nDem man are stayin' inside (In where?)\nComin' like man are on tag\n\n[Verse 2]\nWhite Air Ones and a tracksuit (Yeah)\nFirecracker Chicken, not a Katsu (Okay)\nBless a nigga, someone say achoo (Achoo)\nGot a brudda's chick up in my cribbo in a catsuit (Then what)\nTalk about my brothers, I'ma catch you (I'm comin')\nPut up any money and I'll match you (We're drummin')\nWe could really show 'em what that pack do (What?)\nI was up North like I'm Atsu\nWe was in the trap with the white lads (Then what?)\nOr we was in the pub with the black yutes (Alright)\nI just wanna know why England's so shit\nI might start as a striker and slap two (Boom boom)\nAin't got time for the warring, boring\nGot mine, sunny or pouring\nMorning, evening, scheming, and touring\nFlooring, little nigga with me's on scoring, bore him (Ouch)\nCan't know him, I don't vouch, ayy\nJD bag or that pouch, ayy\nMight put a skeng in mum's couch, ayy\nBig chain heavy, might slouch, ayy (Ouch)\nTall but tekky like Crouch, ayy (Okay)\nNo you can't link, man, I am not about (No way)\nIt's Nando's? yeah, that's the shout\nSuper Smash Bros, bust, I'm out (Ah)\n\n[Chorus]\nI just arrived (I'm here)\nNo way I'm goin' out sad (No way)\nThat boy is my son (My yute)\nThat means I am his dad (I'm pops)\nCopy my style? You're nuts (You're crazy)\nGod knows I got it in the bag (The bag)\nDem man are stayin' inside (Where?)\nComin' like man are on tag (Uh)\nI just arrived (I'm here)\nNo way I'm goin' out sad (No way)\nThat boy is my son (My yute)\nThat means I am his dad (His pops)\nCopy my style? You're nuts (You're crazy)\nGod knows I got it in the bag (Secured)\nDem man are stayin' inside (In where?)\nComin' like man are on tag\n\n[Outro]\nMalik Ninety Five", "year": "2019-02-08", "album": "AJ Tracey", "image": "https://images.genius.com/589b9cacc4ac662673a7a7bab3cd179e.1000x1000x1.jpg"}], "artist": "AJ Tracey"}