{"songs": [{"album": "Everready [The Religion]", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg", "year": "2006-11-07", "title": "Come Gangsta", "lyrics": "[Intro: Different people talking]\nThe spiked, red hair and the... and the paint on his face\nWoah, hold on man, Tech is losin' it man\nHe's not as grounded as he used to be\nTech was a devil worshiper\nThey seen a black dude with red hair and a long beard\nI mean look, he look scary to me too\nAnd that nigga Tech, man, he sellin' out, man\nThat... that's... he's doin' that for the white folks\nThats white shit he doin', man\n\n[Verse 1: Tech N9ne]\nI've been writing for nineteen years for sure\nHate rules in these times\nNiggas don't wanna see me shine\nStop me, and then try to tell me (come gangsta)\nAnd then compare me to Nelly (where's yo bank, bruh?)\nSo this song's gonna tell these\nSo called gangsta niggas who the fuck\nHas always been the bigger G\nHey, I've been bustin', and fizznuckin' bitches\nIt is nothin', for years puffin'\nI've been clutchin' riches from his muffin'\nHere's \"Fuck you niggas\", this is tough and I\nDon't know what the fuck you thinkin'\nTellin' me this shit is hella fake\nSay, since way back in the days rappin', the blaze happened\nI raised raves, crazed days, was blade packin', and stage saggin'\nThey's wack and N9na stayed layed back and I\nLaugh at negros constantly\nThey never know the money N9na makes\nHey, this is amazin' how niggas formulate they hatin'\nYou fuckin' fornicate, you're mistaken\nWe could never correlate 'cause you fakin', huh?\nWho's bringin' in through bacon, huh?\nWho's keepin' it shakin', huh?\nGot any questions Sinister Tech and Tecca N9na\nNiggas know the rest\nGay is all you punks and Mitch Bades\nThis in your trunk, won't get played on the radio\nToo gangsta for an old lady, bro\nGangsta niggas don't hate me, no\nWanksta niggas won't face me, though\nTalkin' shit in books 'bout people tellin' me I really need a vest\nOkay!\n\n[Interlude: Tech N9ne]\nI rep the town harder than any of you niggas\nWherever I stand, my appeal's the same, punk\nAnd you got the nerve to tell me\n\n[Hook: Tech N9ne]\nCome gangsta\nThrow your rags in the air\nAnd know that nobody there\nWill compare to your gangsta\nSag your pants to the floor\nEvery woman's a bitch or a whore\nWhen you're gangsta\nPack ya guns in the club\nIf they shrug give them thugs mean mugs\nYeah come gangsta\nIs what they sayin' to me\n\n[Verse 2: Tech N9ne]\nI should've been done come with a gun\nFor the ones who bump they gums, you the one\nSaid a nigga wasn't gonna make another record\nSaid I was wack and washed up, done\nSaid a nigga might scare little ones\nHe's a fuckin' nightmare, here he comes\nWith red hair and my face painted\nThey said (Gangsta)\nMessy Marv and Corleone is so (Gangsta)\nBut I really ain't (Gangsta)\nI need to come a little (Gangsta)\nScritch the Scratch, my nigga Fat Tone is so (Gangsta)\nYou need a bit of that (Gangsta)\nYou need to hang with a (Gangsta)\nMr. Stinky Vigilante's so (Gangsta)\nBrotha Lynch is (Gangsta)\nThe Bigga Figga is (Gangsta)\n57 RDVs are so (Gangsta)\nThat nigga Fiddy is (Gangsta)\nThey say!\nWhen you in them streets, creep creep\n'Cause some gangstas wanna head blast\n'Cause I run with the red rags\nAin't tryna make the feds flash\nTry to swipe my bread stash\nThat's that bullshit I'm gon' skip and\nTry to go and get the money grip\nOkay, you niggas kill me\nYou're Nosferatu vampire, bit my shit\n'Cause you niggas feel me\nSurprised I got you right here with my shit\nSo you gotta be thankful to who?\nBy the way homie what's gangsta to you?\nMoney, dope and alcohol and\nPlenty bitches all up on your dick\nI got that\n\n[Interlude: Tech N9ne]\nHow can C-Bo be wrong?\nHow can Yukmouth be wrong?\nHow can Lynch be wrong?\nHow can 2Pac be wrong, bitch?!\n\n[Hook: Tech N9ne]\nCome gangsta\nThrow your rags in the air\nAnd know that nobody there\nWill compare to your gangsta\nSag your pants to the floor\nEvery woman's a bitch or a whore\nWhen you're gangsta\nPack ya guns in the club\nIf they shrug give them thugs mean mugs\nYeah come gangsta\nIs what they sayin' to me\n\n[Verse 3: Tech N9ne]\nI've been nice to you rapper cats for a long time\nI left Kansas City so them other cats can go and shine\nBut it seems these punks are confused because I'm my own kind\nBut I'm back on deck 'cause Kansas City is whose throne? Mine!\nThis ain't no punk shit\nNigga this is strength at its finest\nI made this shit so you all you simps can rewind it\nMeaning you pussies who say this Tech shit ain't hard for real\nAnd try to disregard the real\nYou motherfuckers is hard to feel\nI get your death threats 'cause I'm the king bitch\nMoney, groupies, drugs and alcohol and bling shit\nBut I stay ahead of the game\nAnd you punks is so late\n'Cause my one gangsta track will demolish your whole tape\nI've been with every rapper who's legendary\nUnderground to mainstream know that Tech is very hard\n'Cause I bring the heater\nLove me 'cause I'm your leader\nBitches, they suck my Peter\nWhile I'm drinkin' Margaritas\nNiggas get layed down\nSeven displayed sounds\nN9ne, the crazed clown\nLines like sprayed rounds\nThis is for all you haters who don't pump my shit\nIf you say this ain't gangsta you can suck my dick!\n\n[Interlude: Tech N9ne]\nI might look like a clown, huh\nBut you niggas sound like a muthafuckin' circus\nFuck you muthafuckas\n\n[Outro: Yukmouth]\nThis nigga is the tightest nigga movin' man\nI mean... Tech N9ne will demolish all you niggas\nFrom the stage show to rockin' the mic, you name it\nThat's why I roll with him\nHe my favorite rapper, real talk\nTech N9ne"}], "artist": "Tech N9ne"}