{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "Don’t tell em", "lyrics": "(Intro)\nHustle Gang, nigga, hood richin’\nHustle Gang ova errthang\n\n(Verse: T.I.)\nGot a man, he gon’ do it befo you do it\nYa amateur, just a man and ya wanna get to it\nIt’s jibberless and I just wanna get to it, man\nI tried, told her bring a friend or I ain’t wanna do it\nHop a thot, spread out, aye there partner, show me where the head at\nAnd a home girl a squirter, switch the bed ap\nAnd I made her dammit, dat the one ya care bout?!\nHuh, anyway, meet the grand off with gummy pants\nI got ya bitch all on me, I don’t even wanna ask\nProlly ask her where the cow, where she goin’?\nI tell ’em fuck her, he ain’t hard and he knows it\nAye, man I swear this a heart when she blow it\nShe a whore, she be goin’, out the door when she throw it\nLike the cars she be goin’ off, and like she wanna see\nHow far she can go down\nAnd it ain’t far till she yellin’ out ‘oh Lord, will ya take it out?’\nThey the ones that wanna see me take it out\nBunch of bad bitches all around my whereabouts\nThen who ya man is I don’t care about\nIf she got an ass on her, I’mma wear it out\nThis one thang she will neva do\nAnything but what I tell her to\nAye, and here’s one thing that I tell her\nPlease, when you and him speak, don’t speak on me\n\n(Hook)\nRhythm is a dancer, I need a companion\nGirl I guess that must be you\n(I know ya want it, I can see ya want it too)\nBody like the summer, fuckin’ like no otha\n(Aye, aye, I will)\nDon’t ya tell em what we do (haha, haha, don’t tell that)\nDon’t tell ’em, don’t tell ’em, ye ain’t even\nDon’t tell ’em, ye ain’t even gotta tell ’em\nDon’t tell ’em, don’t tell ’em, ye n’ me\nDon’t tell ’em, don’t tell ’em, ye n’ me\nDon’t tell ’em, don’t tell ’em!\n\n(Verse 2: Jeremih)\nKnow ya say ya down wid it\nWon’t tell ’em how you hit the ground wid it\nGirl ya know I’m from Chicago\nI act a fool, Bobby Brown wid it (in it)\nNobody take me out though\nYa got gifts bring em down the South Pole\nMarathon doll gon putting miles\nDon’t you worry about it might gon work it out\nOnly is you got me feeling like this oh why, why, why, why!\nLuvin while grabbing the rhythm of yo hips\nThat’s right, right, right, right, right!\n\n(Hook)\nRhythm is a dancer, I need a companion\nGirl I guess that must be you\n(Girl, know ya checkin’ fo me, ya see I’m checkin’ fo you)\nBody like the summer, fuckin’ like no otha\n(Aye, aye, are we on?)\nDon’t ya tell em what we do (haha, haha, ya bet)\nDon’t tell ’em, don’t tell ’em, ye ain’t even\nDon’t tell ’em, ye ain’t even gotta tell ’em\nDon’t tell ’em, don’t tell ’em, ye n’ me\nDon’t tell ’em, don’t tell ’em, ye n’ me\nDon’t tell ’em, don’t tell ’em!\n\n(Verse 3: Jeremih)\nDeli fool, fool wid it\nBut ya know I know what to do wid it\nI get it that girl I’m talkin laps\nYa said you got to pull wid it\nAnd she say she with yo best friends\nThen let me beat it down and\nYa know ya feeling it now, so press play\nJust keep that ass windin’\nOnly wit you got it feel like this\nOh why, why, why, why, why!\nLovin’ and grabbin’ the rhythm of yo hips!\n\n(Hook)\nRhythm is a dancer, I need a companion\nGirl I guess that must be you\n(Girl, know ya checkin’ fo me, ya see I’m checkin’ fo you)\nBody like the summer, fuckin’ like no otha\n(Aye, aye, are we on?)\nDon’t ya tell em what we do (haha, haha, ya bet)\nDon’t tell ’em, don’t tell ’em, ye ain’t even\nDon’t tell ’em, ye ain’t even gotta tell ’em\nDon’t tell ’em, don’t tell ’em, ye n’ me\nDon’t tell ’em, don’t tell ’em, ye n’ me\nDon’t tell ’em, don’t tell ’em!"}], "artist": "T.I."}