{"songs": [{"lyrics": "[Verse 1]\nSharks in the dunk tank, vipers in the garden\nLocusts stole the groceries out the local Farmer's Market\nAll God's critters hold positions\nSome are violent, some are victims\nEach alive is an equal and vital piston I support\nSo when the piranhas honor New York\nMy daddy long legs dangled and mangled for sport\nAnd while I bring in every dink in the kingdom with open wings\nIt all boils down to them shit-soaked pigs\nThe pigs (what), the pigs (what), the dregs of what y'all aim for\nThe gluttonous muddy stomachs under the pudgy cakehole\nTwo-track braniac using the food and payroll\nTo chew up and consume every cookie, crumb, and peso\nAnd place a cloven hoof on the lucrative when convenient\nAs the bourbon-odor smokers' coughs smolder off the Cohiba\nIf Noah had the benefit of hindsight on his ship\nHe could've snatched two unicorns and left behind the motherfucking...\n\n[Hook 1]\nPigs!\nGod damn... pigs!\nPotbelly... pigs!\nPunch-drunk... pigs!\nTake money, money... pigs!\nLoudmouth... pigs!\nWide load... pigs!\nLet's make a deal...\n\n[Verse 2]\nWhen all the wolves in woolly wigs\nHave huffed, and puffed, and blew the bricks\nThe skulls of Brooklyn's cruelest pigs\nWill rain on Fulton's newest kicks\nAs mulish swine of all surrounding counties sniff the gruesomeness\nWe pass around the pineapples and pull the pins in unison\nI will gladly feed you to the breed who wants you sacrificed\nNo pagan or sacrilege, just bacon for scavengers\nI will gladly seat you with the chickens, not the passengers\nHopefully the crack in his armor spreads to his avarice\nNever that, Wilburs multiply quicker than triples\nAnd hunt their truffles in fistfuls, but it was all bells and whistles\nBougie this and Bougie that...\nWar pig or pussy cat...\nGlitzy to the pork ribs, had to gold-leaf the booby traps\nPowder-pink, double-breasted, mess of mud and money\nWaddle off the fire to make his stubborn tummy wroggle\nAnd while I don't really know the working details of your tribes\nI know that that's one ugly fucking tie\nAsshole...\n\n[Hook]\n\n[Verse 3]\nApple in his mouth, Maraschino eyes\nParty like the butcher boy's cleaver is alive\nI mosey into sixteen hours of smoke in the misty winter\nTo see the county fair's blue ribbon winner as dinner\nThen dance until the sun has kissed your blisters in the morning\nAs the misery was dormant and digging in crispy portions\nCorporates want to lure him in and whore him. Or does he whore the corparates to expand the more important forums for him\nPush the mortar pestle past the ordinary orchard\nWhen the frilly border's faded is the product mine or yours, pig?\nMine, plus I toss a token where I go:\nDirectly to the worms who shovel shit and yellow snow\nThis little piggy went to the market with a target\nAnd will subsequently know the armor-piercing forks of farmers\nFinal words for the finer birds taking notes:\nI dig a chick in pig tails, \"That's all Folks!\"\n\n[Hook]", "title": "Pigs", "album": "None Shall Pass", "image": "https://images.genius.com/3d6c4d11084714cc67f880d71310d197.288x288x1.jpg", "year": "2007-08-28"}], "artist": "Aesop Rock"}