{"artist": "Fashawn", "songs": [{"year": "2014-12-01", "album": "Fash-ionably Late", "image": "https://images.genius.com/eac42f05dd35017f5b015faee937c6b6.500x500x1.jpg", "lyrics": "[Intro: Fashawn and sample]\n\"...But then I thank you for the love you give me, God! And I know, I don't deserve it. It hurts me to say that...\"\nYeah, 'Shawn, huh nigga\nThe most shady: Alchy baby. In full effect. It's the start of the end\nAmen...\nUh... uh, how should I start this?\n\n[Verse 1: Fashawn]\nWent to sleep drunk, woke up sober, hungover\nThe skunk roller; who need a lung donor? Young loaner\nGun toter, with a tongue coated in Aspirin\nBlown off a wax-strip; zoning, I'm boning an actress\nDiagnosis my DNA, and get flowed and extracted\nExposing your hat tricks, posers need practice\nI got more props and respect than you\nFor what I cultivate, gotta cut a check into\nDollar signs and decimals, the grind's impeccable\nI brainstorm while your mind is weatherproof\nBuilt with time for the crime on schedule\nEyes dilated off a high that's medical\nI rise to the occasion, arrive with something Asain\nWith thighs like Mary J. Blidge, Sanaa Lathan\nFuck the smiley faces, homie I'm out of patience\nYou just sour cause your final hour's a jinx, nigga\n\n[Hook (x2): Fashawn]\nWe knew it was over, before it even started\nMay we bow our heads, for the daily departed\nI welcome you to the end now, Amen\nI welcome you to the end now, Amen\n\n[Verse 2: Fashawn]\nI put a cease to the speculation, I'm dedicated\nYou'll see the bombs getting detonated, miseducated\nYou a featherweight, forever hating, I'm Freddy meets Jason\nMy coalition congregating, kind of like the Masons\nAnd the temple, medicated my mental\nDisrespectful, I defecate on your demo\nCelebrity, I'm as celebrated as Leno\nConversate in a limo, ain't even know you was lame\nYou was late on the memo, should be raking in insults\nPussy nigga, you probably stay on your menstrual\nI'm just raping the tempo, cautious as if I was\nDrag-racing a rental, I recommend you\nHit the exit when I step in the venue\nOr get decked and get dentalled; dammit, I'm detrimental\nAnd these Emcees most definitely know my MO\nMurdering everything in my path, my name's Fash, motherfucker\n\n[Hook (x2)]", "title": "Amen"}]}