{"songs": [{"title": "Ghetto Mindstate (Can’t Get Away)", "album": "I Need Mine $$", "year": null, "image": "https://images.genius.com/610cf090ccd8bf90e21501def2411601.353x355x1.jpg", "lyrics": "(Lil' Flip:)\nWhooooooo!\n\n(Lyfe Jennings:)\nUh (x8) (talk to em Lyfe) uh (x4) (talk to em Lyfe) uh (x4)\n\n(Chorus x2: Lyfe Jennings)\nI just can't go..... I just can't stay... I just can't, you just won't\nI just can't get away.......\n\n(Lil' Flip:)\nGhetto mindstate!\nAt 15 I was making moves\nDrinking beer shooting dice at school\nWhen most niggas had a 9 to 5 shit\nOn the block we making 9 to 5 grand...\nEach day yeah we got cheap yay (holla)\nMy niggas on lock they called me on 3 way\nThe hood hot like a crock pot\nDope fiends cutting yards for a 20 piece of crack rock\nAround my way ain't nobody watching matlock\nWe trynna hot wire cars and break pad locks\nTurn soft to hard drop it in glad locks\nAnd drive flashy cars and get mad props\nAnd still I won't change\nLast week they caught my patna with a block of caine\nAnd can't no amount of money stop the pain\nThey gave him 35 years his momma went insaine\n\n(Chorus x2)\n(Lil' Flip:)\nGhetto mindstate!\nComing up with no father figure\nI guess that made me a harder nigga (why?)\n'cause I dont like to ask for shit\nWhen I came in the game with a half a brick (yes!)\nBut I ain't telling lil' kids to go that route\nBut is on TV everyday like they dont know that route\n\nAnd Lil girls being fast\nBeing grown trynna Flirt\nLeaving home wearing pants\nThen change in to a skirt\nHuh!\nI live in the ghetto I stay in the ghetto (yeah!)\nRun up grown Im spraying that metal\n'cause ain't shit sweet around my way\nAll I know is one thing how to get paid (yeah!)\nWith Lyfe on the hook I know we got another hit\nThis motivational music\nI know you feeling this (ey!)\nAnd i was raised in a church\nBut were Im from you gotta do that work\n\n(Chorus x2)\n(Lil' Flip:)\nWhy everybody trynna bring me down\nBecause of me they respect H-town\nLook I was here when yall wouldn't around\nThe first week you did a alright\nBut then that shit went down\nWhy everybody trynna bring me down\nBecause of me they respect H-town\nLook I was here when yall wouldn't around\nThe first week you did a alright\nBut then that shit went down!!\n\n(Lyfe Jennings:)\nThey tell you you were born to die\nYo momma she was born to cry\nYo woman she was born to lie\nHold you down so you can't rely\nI tell you that its all a lie\nYoung nigga You just gotta try\nKeep your eyes up on the sky\nDon't let your dreams pass you by\n'cause somebody said"}], "artist": "Lil Flip"}