{"songs": [{"image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "year": null, "lyrics": "[Verse 1]\nAyo\nI know we starving in the hood\nWe party in the hood\nSip kool-aid and Bacardi in the hood\nOnly one problem in the hood\nBus trips out west, damn the kid's hardly in the hood\nWe move ready in the hood\nWe heavy in the hood\nIllegal two-ways and celly's in the hood\nCome thru the block bumping Nelly in the hood\nLike Unduly Unduly Mami E.I\nWhat's popping tonight\nMami looking proper and tight\nParking lot pimping, black sock on the flight\nY'all know how we do chicks in the hood\nHouse party style yelling SWITCH in the hood\nIt ain't hard to get rich in the hood\nNo credit don't sweat it, we got Sprint in the hood\nAnd these chicks is insane, they put they lips on the grain\nNo blinkers when I'm dipping thru lanes\nVegas is back, watch them start forgetting your name\nDon't care about broad I pimp em the same\nThey keep begging me to stay 'till the morn\nBut it came to me like my favorite B. I. G.  song\n*plays short clip of B. I. G.  song*\nAnd if y'all know it then y'all all sing along\nGet the bitch, get the pussy, get the math I'm gone\n\n[Hook]\nThis is for my gangsta's and gangsta chicks\nAnd all my gangsta cliques\nIt don't matter what set you claim, just respect the game\nAnd party to this gangsta shit\n\n[Verse 2]\nWhen it comes to relationships, Vegas is very horrible\nLet me explain a few things the young broad'll do\nPromise you the universe, only give you a star or two\nOnce he got your mind, he don't give a shit about your heart or you\nMost chicks thinks all it takes is a lie to hear\nAnd the hottest gear, to earn their dollars here\nLet me stop you there\nThey get comfortable, I take them on my favorite date shop and stare\nCause while I shop they watch and stare\nAnd please don't comment on the watch my dear\nI got a lot of gear\nParda down to Roc-A-Wear\nPlus I dress better than most of these niggas' closet there\nI could pull up to a packed strip, in a crashed whip\nAnd still bag the baddest bad bitch\nTake her to Flagship and give her X and grape goose\nHood rats say Vegas and the models say Bruce\n\n[Hook]\n\n[Verse 3]\nI had one gangsta chick, the rest was nutty\nMa if your head proper, I'll take you to Red Lobster\nAnd let you get 45 shrimp instead of 30\nHer head was nervy, I jetted on birdie\nThey wanna go on dates with me\nKey to my empire so of course they skate with me\nThey wanna pay they respect to the late great with me\nKendal Jackson, in front of lakes with me\nThey wanna eat cheesecakes and Welches grapes with me\nThey wanna go half on a... and stay with me\nI done shouting at hoes, cause I could talk on\nEast coast shake it up, West Coast get your walk on\n\n[Hook]", "title": "Gangsta Boogie", "album": null}], "artist": "Ali Vegas"}