{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "Ain’t No Crime", "image": "https://images.genius.com/57ec239bcf6ef22edf75300dd9ab45aa.600x597x1.jpg", "lyrics": "[Radio excerpt]\nDJ: The topic: Is the police department really doing justice to the people here in New York City\nCaller: Hello\nDJ: Hello?\nCaller: Hello. Hello!\nDJ: Hello!\nCaller: Yeah. Corruption, corruption, all the way. The cops are just full of it. A guy told me…\nDJ: Ay pal\nCaller: A guy told me…\nDJ: Ay, hello, hello!\nCaller: Hello?\nDJ: Did you call here before?\nCaller: Did I call before? No, it’s my first time calling, guy\nDJ: You called here before, didn’t you?\nCaller: (sputtering)\nDJ: You were from White Plains, you called\nCaller: (sputtering) …checking my phone calls or something…\nDJ: No, you, you, you called from White Plains, didn’t you? Are you calling from White Plains now?\nCaller: White Plains Road!\nDJ: In White Plains, right?\nCaller: On the Bronx, White Plains Road!\nDJ: What’s your point, pal?\nCaller: What I’m trying to tell you, you take it in the ass!\nDJ: (chuckles)\n\n[“Heaven and Hell is on Earth” sample]\nChildren growing\nWomen producing\nMen go working some go stealing\nEveryone’s got to make a living\n\n[Ad-libs: Positive K]\nSwing it over here yo\nSwing it over here yo\nSwing it over here yo\nSwing it over here yo\nSwing it over here yo\nSwing it over here yo (Uh)\nYeah swing it over here yo\nSwing it over here yo\n\n[Verse 1: Positive K]\nDon’t tell me what I’m not\nJust because I drops it like it’s hot\nI get what I get, and I got what I got\nFor thinking fast, right here on the spot (Uh)\nI’m spontaneous wit a ho in my radius (yeah)\nYou got a girl, buy my tape and play her this\nWatch which way she’ll sway\nAnd I bet she’s gonna say OWWW, Pos K\nSo don’t pause, panic, or get picky\nI’ll make ya girlfriend’s panties sticky\nAnd she’ll wanna get with the dapper\nA rapper, I got no choice but to tap her\nSo let her know who the [?] the big barracuda\nThat’s like a Lexus to a scooter (Uh)\nSo ease off, come down [?]\nI remain like a freckle, transform like Jekyll\nI’m being bad yo, making mad dough, pulling off slow (Uh)\nIn a Volvo\nPos K’s imperial\nBrothers wanna be smooth but can’t find my material (shhhh)\nUnderstand I’m good with mine\nAnd when you realize that, everything’ll be fine\n\n[Hook: Positive K]\nAin’t no crime, on the way I’m gettin mine\nIt ain’t no crime, it ain’t no crime\nIt ain’t no crime, on the way I’m gettin mine\nIt ain’t no crime, it ain’t no crime\n\n[Verse 2: Positive K]\nOn the nightshift, a lot of ladies was offended\nBut being offended wasn’t what I intended\nPos K raps on, what’s real, rappin on what’s real (yeah, yeah)\nGives me that street feel\nA in a borough in a city near the city\nI can’t have the Doo-Wop, without the ditty (what)\nI got the skills to pay those\nAnd if ya got beef, I suggest, you better raise those (Uh)\nBut tell me can you take it\nYa have better luck a bungie jumping butt naked (shhhh)\nI’m gettin loot in 52 cities and hanging hard\nSee here, like your grandmom’s titties\nTell it like it is and like it isn’t\nNo girl is gonna lock me up as if I was in prison (Uh)\n‘Cause I’m a batchelor, my doctor says I’m fertile\nRunning through girls like Carl Lewis does the hurdles (mm)\nLadies know my forté, plus I [?] foreplay\nWhen I go too far they say, that’s okay\n‘Cause I’m the Positive, but, girls, they call me Pozzy\nWe can go together just like Harriett and Ozzie\nEff matrimony! That’s B, baloney\nPicture me settling down with a wife!\nNah that don’t even sound right (nah)\nBut my motto is, a pimp or die\nCome on now\n\n[Hook]\n\n[Verse 3: Positive K]\nHoneys in my face just like a booger (like a booger)\nI say slow down, low down, and don’t you play yourself, sugar (Uh)\nI don’t like girls who act like such\nTalking about take me out to dinner (but what)\nNah we’re goin’ Dutch\nUh, then I think and realize that it sums up (Uh-huh)\n‘Cause when I bust off, I clog honeys gums up (Uh-huh)\nThat’s why she calls me Sir Spermalot\nCause when I make love, I make her squeal, and she squirms a lot\nSo don’t ask, is he nasty or has he\nUh baby, don’t put none a that past me\nCause I’m the man with the power\nIf being fly was a minute, well I’m a motherfucking hour (shit)\nNow don’t do like I say so (Uh-huh)\nAnd you’ll get eaten like a dish called Rapper Alfredo\nIn the quickness you’re getting sparked\nYou do so much as [?] blink\nAnd you can die in the dark\nI hear dem talking, but I don’t know what dem tinkin’\nI hear dem talking, but I don’t know what dem tin kin’\nThis ain’t a song about me being fly\nIt’s a song about me, myself, and I\nYou know this I\nPersist, and refuse to get jammed\nPeople try to [?] flam, but every song that I make slam\nLike Abe Lincoln, they wanna see me dead, stinkin'\nI’m not sinkin', so [?] how ya thinkin'\nI’m rising, rising at a rapid rate\nAnd at my weight, I’m gonna wax the whole damn state\nAnd every step I take\nIt’s a step in the struggle\nAnd everything I got, ay yo I got it on the juggle\nNobody gave me nothing see I fought my way\nThat’s why I’m proud to say that I’m the Positive K (that’s right)\nFrom Robin Givens down to Michael Bivins\nWhat I’m saying is, everybody gotta make a living\nCome on\n\n[Hook]\n\nSwing it over here yo\nSwing it over here yo\nSwing it over here yo\nIt ain’t no crime…", "year": "1992-11-03"}]}