{"songs": [{"title": "This Thing", "album": "Return of the Darkman", "year": null, "image": "https://images.genius.com/ffc48cdf9440941e0fd4bf0d068c90af.400x400x1.jpg", "lyrics": "[Intro: Method Man]\nDo you see these bags under my fuckin' eyes!?\nGeez! That's all I ever wanted was, uh huh, uh huh, yeah yeah, thing thing\nThat's all I ever really wanted was, thing thing\n\n[Method Man]\nThere I go, rushin' the dough, puffin' the 'dro\nI get low, with nothin' to show, like cuttin' the blow\nY'all niggas know, the Clan in effect, the man on your left\nIs M-E-F, I'm cashin' a check to snappin' a neck\nMy M.O., is stabbin' the third, Staten, you heard!\nWith P.O., pluckin' your nerves, who fuckin' you bird?\nWhen you ain't, stickin' the stink, I'm thinkin' I'll thank my critics\nBooger they drinks and sugar they tanks, who is it?\nBack in this bent, with rappin' and shit, it's Bobby\nAttached to his hip, like ratchet to clip, it's Johnny\nFrom tappin' my herb, to tappin' your chin, for dough\nDon't shorten my word, or shorten them ends, for sure (yo, yo)\n\n[RZA]\nI blitz the mic once I hear hype, the left tackler\nTackle a track like a hundred Lewis linebackers\nNinja rapper, lyric Eagle Claw Grappler\nBlow the fuse off a thousand watt black after\nAmplifier, cramp the liar, stamp the champ\nRevamp the camp, blow your lamp fire\nFifty shots in the sky, for the Dig-I\nT-A-L, you swine inside the pigsty\nSpend the will of Dhama, face your Karma\nIn pursuit like the F1 bomber, huntin' down Osama\nFrom my hood I know A Few Good Men of Honor\nHearts cold, stack gold like Old Man Palmer\nPort land, I Trailblaze to Portland\nOregon, to watch Rasheed Wallace score again\nTo get cocky off a glass of hassake\nAnd rice and seaweed, bein' soaked in wasabi\nNostril flared up, eyes tearin', and I'm nearin'\nThe point of no return, bitch, I'll have your blood smearin'\n\n[La the Darkman]\nYo, jumpin' out the Benz wagon, red Polo sweat saggin'\nWhite tee, bandana, tan suade, Timbs draggin'\nFingers numb, from the thousand grams I finished baggin'\nCoke on my hands, still smokin' dutches like a dragon\nIt's a M-E-T, H-O-D and, the L-A D-A-R-K Man\nI'm the Duke, please bless me like Mike Krzyzewski\nTwo weak ass rappers beefin', don't impress me\nMy style's poise, W.E.B. Dubois\nSpit stellar minature, that the world enjoys\nTo my Clan, I'm commited, Red Sea, ok, kid it\nWhen I lead this toilet of a Earth, know I shitted"}], "artist": "La The Darkman"}