{"songs": [{"lyrics": "[Intro: The D.O.C. & Fresh K]\nHere's a mix to make you move, smooth enough to soothe\nSlow and lower you can go inside a bassed up groove (So funk it!)\nIt's gotta be, ain't no need to discuss it\n(Yo Doc!) I finna kick this shit, alright! (Alright, then bust it!)\n\n[Verse 1: The D.O.C.]\nRhymes created by the Doc, most definitely down!\nI could be bitten by this brother with some bad ass brown\nIt ain't no joke, he needs some scope\nCause his breath is (cold!) dope\nAs he talks I can smell it, and I'm seeing the smoke\nThat's the bad breath bandit, you know what's in store\nStay away cause they breath will knock you (to the floor!)\nThat boy is (rough!) de soda (tough!) I don't understand\nTests his breath inside his palm, and burned his hand!\nHe's a tucks destroyer, a Listerine killer\nA cavity employer, a yuck-mouth filler\n(Say man, you bullshit!) no, that's a fact Fresh K\nI wish Velamints could take his breath away\nBut he's.. always in effect, smelling like dead vermin\nHonking the bitches with his firewalls burning\nWinch his witch as a curl, just as funky as well\nI mean he has a little woman that can match his smell (Yes!)\nHe has a girlfriend, this is not pretend\nShe uses deodorant that's made for men\n(Scratch and sniff wallpaper all over the house)\nAww shit! (Yeah boy, that's what I'm talking about)\nThey need ten bars of soap, three boxes of Tide\nTo make them presentable to go outside\nNow my story is true, and my opinion candid\nBut that is my tale of the bad breath bandit\n\n[Interlude]\n[The D.O.C] But you know, that ain't even half of the shit\n[Fresh K:-] Man, what's up?\n[The D.O.C] This bitch who stay around the way, you know her K!\n[Fresh K:-] Yeah?\n[The D.O.C] Y'all want to talk about her?\n[Fresh K:-] Bust it!\n[Dr. Rock:] Oh kick her ass, man\n\n[Verse 2: The D.O.C.]\nLet's talk about girl who's a bonafide witch!\nName is Tammy, better known as bitch!\nThe boys in the hood all treat her like liquor\nQuick is the way they pass her around and then stick her\nI'm not saying she minds, she's a first class skeezer\nAlways on the jock, but only if he's uhh..\nMan with the money and the looks to show\n(So you saying she's a witch?) yeah Tammy's a material whore\nYou're getting laid, if you can rock a cross-fader\nYou got the bank, to make the bitch who'll get paid\nTagging Tammy's a process like when you use a computer\nUse her and do her like they did in the old days (Shoot her!)\nA whore and she knows it, yeah the knowledge is there\nSo they say that she's slutty and she tell them she don't care\nBut y'all I'm keeping my clear, even though she is pretty\n(Cause we only use Tammy for a guest to the city) right on!\n\n[Interlude]\n[The D.O.C] But bust this, Tammy ain't the only fucked-up freak in the city\n[Dr. Rock] Well who else, man?\n[The D.O.C] Aww, come on Rock, you know her now, You know her\n[Dr. Rock] Seabiscuit breath, right?\n[The D.O.C] Yeah, that's her\n[Dr. Rock] Yo! Go on! Bust it homes!\n\n[Verse 3: The D.O.C.]\nYou stand around the bitch and your nose turns white\nYou ever thought about what Big Bird's shit smells like?\nWell, you take that aroma, multiply it times two\nAnd you think about Sue (Sour-smelling Sue!)\nShe's a girl that has the power to kill a fresh flower\nRock smelled the whore and said (Damn that bitch is sour!)\nNow, I don't judge, I mean that's not what I'm thinking\nPeople do what they want, and I guess she like stinking\nBut whatever the deal, I think someone should call Guiness\nCause this is kicking a scent that fucks up K's tennis shoes\nAnd a dress, dress it fresh to impress\nShe really ought to be embarrassed because that girl is a mess\nIf you ever see her, you'll duck and cover\nShe looks like your sister but smells like your brother\nAnd since they tell me Trey, honestly phrase:\nI let her know that she reminded me of the Gunsmoke days\nBut it ain't no (thing) if she stink she'll (sing)\nBut to me it's like she needs a little (Irish Spring)\nYou ought to know what I'm saying, I hope I made myself clear\nAbout the three ass whores, but Troll I'm out of here\n\n[Outro: The D.O.C.]\nYo yo yo, these three people make me so sick that I gotta story 1988 on it\nTammy your momma ain't got no legs be talking about\nI ain't gonna stand for this.. Ha ha ha ha!\n\n[Dr. Rock]\nBoy you sick man! You sick man! Yeah yeah\n\n[Fresh K]\nYo man! I got a story from 1988, check it out\nSue, you got so much butter on your teeth\nThat when you brush your teeth you have to use a butter knife!\nHa ha ha ha!\n\n[Dr. Rock]\nGet ready for the king, here I come, now check this out\nSour smelling Sue got so much dirt in her ear\nThat she can grow potatoes, Ha ha ha ha!", "album": "N.W.A. and the Posse", "year": "1987-11-06", "title": "3 The Hard Way", "image": "https://images.genius.com/1c81d51b13dc4236b4af0e1838b85b8c.600x600x1.jpg"}], "artist": "N.W.A"}