{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/8aaa0a119c995f68c57360a1c18d583a.600x600x1.jpg", "title": "Need Someone", "year": null, "album": "7th Avenue ", "lyrics": "Hey yo, oh, oh, ah, ah, ah, ah\n(background singing) 'cuz I'm alone I need a friend\nI need someone who understands the way I feel\nSo I can feel the way you feel\n(spoken)I'll tell you what, do this\nMake sure the hook is on there\nAnd just record whatever I do, Alright?\n(DJ through speaker) Alright KJ\n(KJ spoken) Yo, its the KJ 5 to frickity 2\nS.O.I. you know what I'm saying?\nSilas repeat this\n(rapped) sick and tired of being sick and tired\nSick of sticking out my neck to get me burned like a bic lighter\nSick of all the Jim Carey type liars\nSo I'm sticking to get a grip like some hand pliers\nMy manifesto, hit you the best flow\nHide behind the mics like you was stinkin death row\nI'm already seeing through you like some windows\nStay on you like halo, shine like day glow\nTrying to be the proffesional using amateur\nYou couldn't get the picture even with a camera\nMy stamina, this program is strictly slamming ya\nYou ducking like some draft-dodgers heading to Canada\nI gotta hand it to you, you know how to break me down\nJudas' kisses never seem to ever make a sound\nBut thanking God that was not from the lost and found\nBut keep in mind that what goes around comes around\n\nChorus:\nI'm alone I need a friend\nI need someone who understands the way I feel\nSo I can feel the way you feel (repeat)\n\n(spoken) Yo, whats up man? How you doing?\nYo, remember me? We go way back\nWh-wh-wh-what do you mean you don't remember me?\n...what?\n(rapped) Hello, how you doing? What? You dont remember me?\nLove turns to hate, friends turn to enemies\nHomies turn to phonies, haters turn to cronies\nAs the world turns I'm still standing lonely\nBut there is one love thats never turning cold\nAlways got my back when I got played like a casanova\nAlways had a dry shoulder for me to cry on\nAnd always made a way through the dark with a light on\n\nChorus 4x\n\nHey yo, dark now tell me whats up\nWhy you always seem to got beef like ground chuck\nWe used to cool, but I guess I'm out of luck\nWould you mind taking the knife out of my back it go stuck\nIts the Christ Jesus putting back all the pieces\nHis love runs the deepest, now close to ever peaces\nToss sin as far as wests to the easts\nNever truly alone with the love that he releases\n\nChorus 4x"}]}