{"artist": "Beanie Sigel", "songs": [{"lyrics": "Ayo! Light that shit the fuck up man!\n\n[Daz]\nY'all niggas get ready to get high!\n\nWhat we doin in here y'all, huh?\nEverybody partyin, smokin, bullshittin\nDrinkin, c'mon\n\nHOOK:\nThis for my niggas on the east coast rollin\nTinted up Suburban, in the streets swervin\nAll my niggas in the street wit caine\nMuh'fucka which street you claim? Put your Glock up\nThis is for my niggas on the west coast bouncin\nSix-four rollin, three wheel motion\nAll my dogs on the block just loc'n\nNigga put your rag up, playa put your flag up\n\n[Verse 1]\nB Mack in the mix again, I'm startin shit again\nI'm in the club with the fifth again\nWest coast niggas sippin gin\nEast coast niggas Belvedere, cranberry nigga mix it in\nI'm in the back where it's dark as hell\nShit you know me, VIP, nigga spark the L\nAnd I come to roll a ounce or more, bounce wit whores\nShit all my niggas strapped what all the bouncers for\nWhether deuce or Sig on Crenshaw Ave\nI'ma, get them bitches, get that cash\nI'ma, hit them switches, lift them spokes\nI'ma, push that chicken, get that coke\nI'ma, rock them dickies, Air Force Ones\nTil the, feds come get me air out guns\nFrom the, P H I LL Y, to the, L B C to C P T, uh\n\nHOOK\n\n[Verse 2]\nI'm on the block til the pack get sold\nDon't pack just roll\nHit L.A. like Shaq and Kob'\nNigga please, got trees Aculpulco gold\nGot connects with the heat got the gats on hold\nAll my niggas vatos locos holmes ese's\nSA's with SK's a fuck if the cops come holmes\nThat's right fuck coppers holmes\nWe bust choppers holmes\nWe on the block sent them choppers on\nTwenty niggas wit they khaki's creased\nThat'll clap police, that sling crack on the back of streets\nOr twenty niggas on the back of blocks\nThat sling caps and rocks, who won't hesitate to clap the cops\nWhether I, push the truck to pick up clucks\nTo get they feathers knocked off, then they get dropped off\nFrom pickin up bitches, hittin switches\nSt Ides to Ingbing I'ma do my thing, yo\n\nHOOK\n\n[Verse 3]\nAll my playas who rock tan trees and chuck tails\nSay fuck they PD's and duck jail\nRock wife beaters with the plaided shirts\nOnly top button buttoned, ready to buck somethin\nYou fuckin wit a gangsta rookie\nDon't gangsta lookie\nShoot up your feet make you gangsta boogie\nShoot up your jeep if you gangsta look me\nWhat you think this sweet? What you eat, nigga gangsta cookies?\nCall state to the Staples Center\nThe four quake'll put staples in ya\nNigga zip up your stomach\nRip up your younguns, make you pay to get 'em\nThat's how we play to get 'em, never pay for pigeons\nWhether I, push the truck to pick up clucks\nTo get they feathers knocked off, then they get dropped off\nFrom pickin up bitches, hittin switches\nSt Ives and Ingbing I'ma do my thing, yo\n\nHOOK 2X\n\n[Daz]\nYeah, [I make 'em walk]  Beanie Sigel and that nigga Daz Dillinger [and Kurupt]\nDogg Pound Roc La Familia [Dogg Pound]\nFor life, do it like that, put your hands up!\n[Kurupt]\nMake them switches bounce nigga\nCalifornia put your hands up nigga\nJump over the moon, I wanna hear the gate start to twitchin nigga\nDon't play no games fool\nAnd walk on 'em, yeah, and walk on 'em\nUh, and make 'em walk, yeah, my nigga Beans...\nBouncin, bouncin...", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "For My Niggaz", "album": "The Reason"}]}