{"songs": [{"album": null, "image": "https://images.genius.com/4044a4e2bb3bded0a2513112554143c0.747x747x1.jpg", "year": null, "title": "Name Droppin’", "lyrics": "I woke up in the morning, hungry threw some grits on the skillet, ate john reuben's sandwich with rod's parsley and cream spinach, got audio adrenaline up in my veins eating billy graham crackers while rebecca's reading st. james, I can only imagine all his love and mercy on me, when he died on the cross, rose and threw my sins in the sea, open my bible, turn to genesis started reading told yolanda how adams sin got him kicked out of eden, then went to jeremy's camp on the 3rd day of the week and met this superchick that I had been dying to meet, she wore a whitecross and spoke with a dc talk accent lived in building 429 right next to jaci velasquez, was from the oc with supertone body, she said she stayed in shape cause it was her temple and god's property, my phone rang, and I had been waiting on caedmons call I asked hezekiah to walker to the hillsong mall\nWhether you like hip-hop, punk rock or classic. it really don't matter\nTurn this up in ya car stereo and blast it. turn it up, now turn it up\nWe don't quit, we don't stop, can't stop singing till we reach top so throw ya hands in the air let your head start bopping, I'm about to do some name droppin\nI flew kirk to franklin for a big tent revival, then gave creflo a doller so he'd let me borrow his bible, grey volz shared on the 2nd chapter of acts, then I looked up and seen this kid toby the mac, he was a, street kid with no code of ethics so I took him to fred's hammond eggs spot for breakfast, he ordered t-bone and steak and yo my stomach was growling I was starving but went ahead and got the shirley ceasar salad, that's when ray boltz straight through the door, trying to sell me some jars of clay he got from el salvador, I couldn't afford it if you know what I mean, so I picked up the phone called the rev. al for some green, he gave amy's grant money, she had for a home and told me pray 4 him cause they owed some money to 12 stones, I called steven curtis and I asked him to prey, like I do every sunday with rachael lampa and relient k\nSmitty asked me to take 6 of his friends to steve's taylor, to get a earthsuit, plus one for bill gaither, jumped in my carman heading toward east west and switchfoots on the gas so my tires would kutless, that's when I seen geoff moore in the distance but these kids in the way kept blocking my vision, jumped on the grammatrain, then right out of the grey I saw bryan duncan his donuts at the petra caf', I couldn't believe it starting feeling delirious, but had to spread the good newsboys to those curious, there were 10 of them some, really arrogant told twila paris and nicole just (ig)nordamen, they can't touch this gospel sound, so bow down to the king and start casting crowns, he's the, king of kings and lord of lords play this on your I p.o.d. to learn more, about all of his pain when he took your place on the cross that's the very first point of grace, and I really can't wait until I see his face with keith green and rich mullins at the pearly gates"}], "artist": "T-Bone"}