{"artist": "Witchdoctor", "songs": [{"year": null, "lyrics": "Uh, the Witchdoctor on some smooth shit\nYeah, Witchdoctor, straight up on some smooth shit\nHa, yeah, straight up on some smooth shit, check it out\n\n[Witchdoctor]\nYou got my life on the edge\nI wanna see my whole crew alive, not dead\nPaper money in hundred and Gs\nA lifestyle of luxury\nFuck a pimp, it's about a player\nWhen you handling your business on this SWATs Himalayas\nBankhead, daylife, weekdays, dice shooters\nAnd these young female barracudas\nFlipping money is a job itself\nWhen you gotta get funds in something by somebody else\nNow you gotta make deals back first\nWhen you copped you some worth off this planet earth\nThat's why I'm huffing, busting, cause ain't no loving\nIn these streets, don't give a nigga too much of nothing\nI serve to survive, Team got it on his arm\nI watch these dealers move on\nAin't that the bomb that goes boom\nThe shit that these Js get high with in a room\nI consume the whole planet with one swallow\nI swear, I'm trying to stretch twenty dollars out here\nI got snapping, a whole bunch of niggas trapping\nLet God be the judge, react quick\nHere comes a slug from a nigga out Atlanta\nYou shot an innocent bystander\nHow frail we are in the face of nature\nHurricane Erin coming, feeling safer?\nStraight up on some smooth shit\n\n[Hook]\nAhhh. Let the sun shine in\n\n[T-Mo]\nNot often, but when I do\nYou might see another side come through\nFor those that try to fit legit ways of living\nInto a lifestyle that's quick but steady\nUp off the streets and ready to compete with house niggas\nThe bigger they work against the turf, man\nGotta do my dirt even though it hurts\nIt's being done, grants are being flipped\nHomeboys are getting dropped\nServing to survive this thing, I'm in to win\nPulling up folks that's been down since day one\nSon, you better back up off of these, nigga, please\nWhile see, I'm killing mentalities of crackers\nThinking all niggas stupid\nJust don't conform to their ways of getting paid\nMinimum wage, bitch made ho type\nThinking it's all about they hype, I still rock the mic\nStraight up on some smooth shit\nStraight up on some motherfucking smooth shit\n\n[Hook]\n\n[Khujo]\nBiscuit head beanie, eenie meenie miney mo\nIt's fifteen of you off in here\nPledged myself, I'm coming back you ain't\nStrap up because in most incidents\nThe passengers don't survive\nLike really, drive safely cause ain't no love\nOnly lust laying around these capillaries\nLooking perhaps in a vein collapsed\nPop caught one in the lungs, lifelines\nIs barely hanging from the previous banging\nSnooze I lose like Bubba\nThem proper South rules, cutting off heads\nAnd making them look for they socks and shoes\nJJ wet 'em up, I'm still dripping chrome\nCan't see the forest for the trees\nThe master's plan taking it's toll\nThe valley is flooding, demons are looking for shelter\nPressure will bust a pipe, mummify me\nDon't hand me no devils' death, promise\nWhat more can I do that ain't already been done?\nKhujo snapping on some smooth shit\n\n[Hook]", "image": "https://images.genius.com/c08d4f57cd92d737f075fc8e78fe5b39.500x500x1.jpg", "album": "...A S.W.A.T. Healin’ Ritual", "title": "Smooth Shit"}]}