{"songs": [{"image": "https://images.genius.com/fc896410ef0d7b577f2f08841a0837a9.1000x1000x1.jpg", "album": null, "title": "Spotlight", "lyrics": "All my friends and family know I mean nothing but well\nThey always stuck by me even though I put them all through hell\nSee hurting you hurts me so much more\nI'm burning, can't you tell?\nYou need to learn to love yourself before loving anyone else\nAnd that's why more time I'm stuck in this darkness just to hide from the limelight\nWish there was still a place that I can call my home\nStaring at my reflection through the cracks in the mirror\nI'm no longer the man that you used to know\n\nMy blood is dripping\nAnd my words written in stone\nYou can try crush me but you'll never crush my soul\nGet me outta this darkness, give me back the spotlight\nCause why lie?\nThis is all I know\n\nOh-Oh\nOh-Oh\nThis shit's all I know\nOh-Oh\nOh-Oh\nThis shit's all I know\n\nWe all make mistakes, forgive me\nThis life this life tore me in two\nCause when I lost myself and had no hope left, your love pulled me through\nNow that's a perfect combination of miscommunication\nThey tried to misjudge me up to now just cause I kept missing probation\nAnd here's me trying to give you more when you've already had all of me before\nSince when has it been all for one?\nI swear it's meant to be one for all\nCause no one should love any one more than they love themselves\nAnd that's why more time I'm stuck in this darkness, trying to hide from the limelight\nWish there was still a place that I can call my home\nStaring at my reflection through the cracks in the mirror\nI'm no longer the man that you used to know\n\nMy blood is dripping\nAnd my words written in stone\nThey can try crush me but they'll never crush my soul\nGet me outta this darkness, give me back the spotlight\nCause why lie? this is all I know\n\nWhen you make hella money it's easy to change\nI wish I never let that shit get to my brain\nI was this close to losing it all cause I was a fool\nBlinded by the fame, distracted by the lights\nAlways in the wrong, thinking that I'm right\nLost in my thoughts, feeling useless\nTrying to justify my actions with excuses\nThat's the story of my life\nThat's for those who really care if I'm doing well\nI have found happiness within myself\nOi, it's like all of this shit needed to happen just so I could finally come out my shell\n\nJust get me outta this darkness, let me enjoy the limelight\nWish there was still a place that I can call my home\nStaring at my reflection through the cracks in the mirror\nI'm no longer the man that you used to know\n\nMy blood is dripping\nAnd my words written in stone\nThey can try crush me but they'll never crush my soul\nGet me outta this darkness, give me back the spotlight\nCause why lie?\nThis is all I know\n\nOh-Oh\nOh-Oh\nThis shit's all I know\nOoooh-Ooooh\nOoooh-Ooooh\nThis shit's all I know\nOoooh", "year": "2017-10-13"}], "artist": "Dappy"}