{"songs": [{"year": "2005-06-01", "album": "Training Day", "image": "https://images.genius.com/0d736130ef89ba0b866b3b01fad325c1.500x500x1.jpg", "title": "Hard Body", "lyrics": "[Intro]\nThat’s where you headed boy, to pine oil heaven. I'mma get that gun, and then I'mma get that money. I don’t believe you got it in you, Jake. I'mma go get it right now (gunshot) Oh shit, awwwww you motherfucker! The next one will kill you. Ohh, son of a bitch. You shot me in the ass\n\n[Verse 1]\nI never been a bitch in my life, I never ran from a fight\nI was told when niggas bark you should bite\nAnd these puppies ain’t eatin' enough pedigree to scare something\nThey play with the word gangster til some lead dumpin\nUntil the ambulance coming pressin' on they chest\nCalf and stomach, you grabbin' the hand of a woman\nI never took the stand, snitched on my man and came back home Like it was nothin', actin' like I ain’t do somethin' wrong\nFuck it, and if I did i would look 'em in the face\nTell hop out that bucket and spray\nTell 'em to make sure they hit my head and my waist\nTell them to circle round the block twice in case\nShit, cement pump in my veins, hard body to the death\nScream fuck the world with a capital F\nEverybody extinct, it’s just me and my niggas left\nAnd this is how we think\n\n[Hook]\nNo tongue tissue niggas around me\nJust a hundred cement niggas around me\nWe hard bodied, y'all bodies ain’t like ours\nAnd if y'all bodies was then y'all be built for war\nTell em'\nNo teddy bear niggas around me\nJust a hundred cement niggas around me\nWe hard bodied, y'all bodies ain’t like ours\nAnd if y'all bodies was then y'all be built for war\n\n[Verse 2]\nAnd when I say hard body, homie, not in a physical\nYou either born with it or real niggas around real kids\nAnd it’s passed on like a ritual, not sworn in it\nYou ain’t livin' it because you put it in sentences\nAnd you ain’t givin' it if it’s ten percent, it gotta be a hundred\nWalkin' down the block, K in my hands, fuck it, who want it?\nI got a hundred shots for any one of you blood clots\nMotherfucker, we will fuck ya\nSpray your coupe and leave smoke in it like Chris Tucker\nI’m no gimmick, we smell out the timid\nWe lift something out the trunk that got a kickstand with it\nYou either fall now or stand with it\nYou either crawl now or get laid down\nThink about it, I’m only giving you one minute\nFifty-eight, fifty-nine, bloaw, you’re too late\nMotherfucker, meet your fate\n\n[Hook]\n\n[Verse 3]\nLook between my eyes\nYou can see the fire burning like my Lamborghini tires\nAnd my burner from the four fifth which is the four five\nWhich is that ninety-five Jordan shit\nJordans on your feet, we gon' take them shits\nPut them on our feet and reshape them shits\nNow don’t they look sweet?\nWear em for a minute, sell them the next week\nThat’s good profit, y'all ain’t thinkin' logic\nYou talkin' ass backwards like criss cross pockets\nMel Gibson, you just actin'\nLethal weapon, I take you niggas to target practice\nTeach you niggas a lesson or two\nWon’t you listen when a grown man is lecturin' you?\nCause any weapon will do in the process of fuckin' up you, nigga\nYou rappers ain’t built like us\nY'all just lift a lot of weights and look tough\nWe see through that, we shoot through anything that’s buff\nAnd we ain’t thinkin' about handcuffs\nThe police runnin' from us, we so hard bodied, trust\n\n[Hook]\n\n[Outro]\nTongue tissue ass niggas man, ay wait, we say, either go hard or go home, tha- tha- tha- that’s what we go by, either stand for something or fall for anything nigga, bite that, o- open your mouth, bite that go ahead, you’re suicidal\nYeah, , oh fuck, I’m winning anyway, I’m winning, I’m winning any mother fuckin' way, I can’t lose"}], "artist": "Kendrick Lamar"}