{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "3 Stacks", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "Yeah yeah yeah\nOld school Pt.2 feel it\nThe realest, who be the realest?\nThat's how we do it, man!\nWe run through it, nigga\n\n[Prodigy]\nI'm the number one insane rapper mix CD stabba'\nYour album was doo-doo, I threw it out the passenger\nThe number one crapta, the 8, the 12, the 16, 22's and 23's\nSometimes I could blow a little steam\nI got alot on my chest but I keep it quiet, so I don't blow the steam\nGet 'em everytime, my millitary bars, will leave a permanent mark on ya brain\nThe comeback kid, to see you get your ass whooped!\nMad witnesses, these niggas mad shook!\nI don't have a clue, why he chose to speak on my name, when you know I'm gon' shoot\nYou know I'm gon' crack yo' face, when you see me in the place I'm a dangerous person\nBehind the rope, poppin' off with the girl\nYou got the ratchet in the car\nI got the ratchet on my person!\n\n[Hook]\n3 Stacks, 3 Stacks, 3 Stacks\nAnd a pocket full of hats!\n(X2)\n\nIt don't stop, it don't stop, it don't stop\nWhen it's on it go pop!\n(x2)\n\n[Big Twin]\nYo, it been a long time since I sold a dime on a dime\nThis shit too hot whoa!\nIts poppin' uptown when I used to see Flaco\nNow back to the block hollerin' 'I got those'\nI got those in every state, like the same amount of snitches that you got in your face\nI'mma make my cracks bigger and take over the whole hood\nShit changed, dunn the ladies say that I'm no good\nI smoke wood, to get high till we pass out\nCash over bitches, that's how we ride out\nI''a G, rep QBC, with a fully on my back, kid. Who want beef?\nLoose teeth over bullshit, you want that?\nI'mma crazy motherfucker' beat you down with a bat\nIt's 'Big Twin' if you don't know, you betta' recognize!\nI'm not the one to fuck with, I'm down to catch a homicide, YEAH!\n\n[Hook]\n3 Stacks, 3 Stacks, 3 Stacks\nAnd a pocket full of hats!\n(X2)\n\nIt don't stop, it don't stop, it don't stop\nWhen it's on it go pop!\n(x2)\n\n[Prodigy]\nFerrari Testarossa, I start the motor\nGo from New York to South Dakota\nWhen I was a kid I drank beer, not Soda!\nNever hit the girls if they panties had the odor\nYou put my songs for sale and I'm a good earner\nAnd I shot ya man, so I could test my burner\nMy 223's spit, flyin' down the VanWyck\nWhen I'm in Queens, I make sure I see my man Twin\nWhen I'm in Brooklyn, I holla at G\nLove to see the girls ass-naked in the Tee\nTake her to the crib, turn on the flat-screen\nMy couch is Gucci, sit ya ass next to me\n\n[Hook]\n3 Stacks, 3 Stacks, 3 Stacks\nAnd a pocket full of hats!\n(X2)\n\nIt don't stop, it don't stop, it don't stop\nWhen it's on it go pop!\n(x2)", "year": "2008-04-22"}]}