{"songs": [{"album": "50 Bodies Pt. 3", "image": "https://images.genius.com/dfa39f34aa029ce17cf8e1a557d5d373.500x500x1.jpg", "year": null, "title": "Tight Pants Are For Girls", "lyrics": "Termanology\nTight pants are for girls\nWhat up, Prem?\nShowoff...\n1982\nYeah\n\nIs it me or is the world buggin' out?\nThese rap dudes are so gay, they're comin' out\nAnd everything that they say is dumbin' out\nThey all smokin' crack with Amy Winehouse\nWe need to save hip-hop cause time's runnin' out\nAnd all the good emcees is never comin' out\nSo strap on ya Timberland boots and thug it out\nAnd all you bati boys shut your blood clot mouth\nAll these new rappers suck and I'll say it\nI'll diss em at they shows and let Vlad play it\nFurthermore they all dress kinda gayish\nCall 'em T-Pain, I'm more like Miles Davis\nAnd I like T-Pain, that ain't what I'm sayin'\nI'm just sayin' I miss when rappers weren't playin'\nRakim never joked, but even he'd laugh\nIf he'd seen how tight them pants is on your ass\nYou have no business touchin' the mic\nAnd with pants that tight you should just wear tights\nSince when is it cool to dress like a dude\nThat fucks another dude\nY'all To Wong Foo\nI pray for a monsoon\nTo come this way\nAnd wash away every rapper just like you\nFirst there was the dumbed down lyrics and chants\nNow it's autotune and thugs with tight pants\nThis ain't the '70s and rap ain't disco\nThat ain't rap shit, yo that's more like Sisqo\nWe need more Bishop Lamonts and Wales\nWe need more Saigons and more Freeways\nAnd I could go on with emcees all day\nBut you'll never hear about 'em cause the radio's gay\nExcept for Sirius\nAnd I can seriously say\nSince Pac and Big died, shit just ain't the same\nIf I was you, I wouldn't release them records\nYour pants so tight you got a yeast infection\nRappers all singin', but they ain't singers\nCheatin' on the game, hip-hop swingers\nI could kick one rhyme and glow like sunshine\nThe shit get me hype like a Lloyd Banks punchline\nI'm ghetto like the lunch line on park street\nIn Lawtown y'all candy rappers too sweet\nYou are not deep\nYou made your bed, now sleep\nAnd I hope you burn in hell, wrapped up in the sheets\nOn the east\nI get mad love in the streets\nI'm a beast\nI leave any rapper deceased\nLike 50 did to Ja\nI'm crispy and I'm fly\nAnd the funny shit is, yo I still ain't signed\nJust imagine when I get my first million dollars\nI'mma diss every label nigga that ain't holla\nThese dudes that they signin' now, they ain't the problem\nThey probably would been better off in a condom\nI seen this rap dude you know walkin' around\nI thought he was a chick 'til he turned around\nThen I seen his face\nHis look was outta place\nSo pussy that he coulda got mushed by mace\nWe need more cats that rap like Joell\nCause these new cats won't act for Sean Bell\nAll they wanna rap about is gay shit\nWhatever happened to BET, the basement\nYou see the type of shit we bein' replaced with?\nFace it, every rapper you love now ain't shit"}], "artist": "Termanology"}