{"songs": [{"title": "Doo Wop (That Thing) (Gordon’s dub)", "album": null, "year": null, "image": "https://images.genius.com/4fff53f85a4f6704ecb471ac0c617cfe.446x446x1.jpg", "lyrics": "Yo, remember back on the bully when cats used to harmonize like\n\"Wooo... wooo... wooo...\"\nYo, yo, my men and my women, don't forget about the Deen\nThe Sirat al-Mustaqim, yo\nIt's about a thing\nYo, yo, yo, if you feel real good, lift your hands up in the air\nAnd lick two shots in the atmosphere\nYeah, yeah\nPut them up, put them up\nPut them up, put them up\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\n\nIt's been three weeks since you were looking for your friend\nThe one you let hit it and never called you again\n'Member when he told you he was 'bout the Benjamins?\nYou act like you and him then give him a little trim\n\nTo begin, how you think you really goin' to pretend\nLike you wasn't down when you called him again?\nPlus when you give it up so easy you ain't even foolin' him\nIf you did it then, then you'd probably ... again\n\nTalking out your neck, saying you're a Christian\nA Muslim sleeping with the Jinn\nNow that was the sin that did Jezebel in\nWho're you going to tell when the repercussions spin?\n\nShowing off your ass 'cause you're thinking it's a trend\nGirlfriend, let me break it down for you again\nYou know I only say it 'cause I'm truly genuine\nDon't be a hard rock, when you really are a gem\n\nBaby girl, respect is just a minimum\nNiggas fucked up and you still defending him\nNow, Lauryn is only human\nDon't think I haven't been through the same predicament\n\nLet it sit inside your head like a million women in Philly, Penn\nIt's silly when girls sell their souls because of sin\nLook at what you be in, hair weaves like Europeans\nFake nails done by Koreans, come again\n\nYo! A-when when come again (yeah yeah)\nWhen when come again (yeah yeah)\nMy friend come again (yeah yeah)\n\nGuys you know you'd better, watch out\nSome girls, some girls are only, about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\n\nThe second verse is dedicated to the men\nMore concerned with his rims and his Tims than his women\nHim and his men, come in the club like hooligans\nDon't care who they offend, popping yin (Like you got Yen)\n\nLet's stop pretend, the ones that pack pistols by the waist men\nCristal by the case men, still living in his mother's basement\nThe pretty face men claiming that they be the big men\nNeed to take care of their three and four kids\n\nBut they face a court case when the child support's late\nMoney taking and heart breaking, now you wonder why women hate men\nThe sneaky silent men, the punk domestic violence men\nQuick to shoot the semen, stop acting like boys and be men\n\nHow you gonna win, when you ain't right within?\nHow you gonna win, when you ain't right within?\nHow you gonna win, when you ain't right within?\nUnh unh come again\nYo yo come again\nBrethren come again\nSistren come again\n\nWatch out, watch out\nLook out, look out\nWatch out, watch out\nLook out, look out\nWatch out, watch out\nLook out, look out\nWatch out, watch out\nLook out, look out\n\nGirls you know you'd better, watch out\nSome guys, some guys are only about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\n\nGuys you know you'd better, watch out\nSome girls, some girls are only about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\n\nGirls you know you'd better, watch out\nSome guys, some guys are only about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\n\nHey, we have some very intelligent women in here, man\nDo you think you too young to really love somebody\nNo, no, no, no, no\nI say it for me and I am adult and I say wait you too young to be in love\nThis is silly, you infatuated with them\nYou got nice jeans\nYou wear fancy Adidas\nI mean it might be something I don't know\nIt is a difference from loving somebody and being in love with somebody\nWell you tell me, what's the difference\nWhat's the difference?\nYou can love anybody but when you in love with somebody\nYou looking at it like this\nYou taking that person for what he or she is\nNot matter what he or she look like\nAnd no matter what he or she do\nIf you can fall in love you can fall out of love\nYou might stop being in love with that person, but you can't stop loving that person\nSometimes they never been loved before, they never been in love before\nThey don't know the feeling to be loved\nShe poetic\nShe killed you\nWe get in that conversation with that right?"}], "artist": "Lauryn Hill"}