{"artist": "Boosie Badazz", "songs": [{"album": "Happy Thanksgiving & Merry Christmas", "title": "Bad Bitch Story", "year": null, "lyrics": "[Verse 1]\nHere's a story 'bout a bad bitch, dark and lovely, real thick\nShorty stands up out, 5 - 6\nYeah, I met her at the corner store, gave her my name,  she was feelin' my game and she gave me her info\nFrom that moment, yeah, we hit it off, never knowin' that this chick would cost me bruh\nFor being a creeper, dickin' down his diva\nMan, I was thinkin' freak her, but I should've been thinkin' leave her\n'cause if my homie only knew the deal, I know for sho' that he would wanna kill me, bruh\nFor being a creeper, dickin' down his diva\nMan, I was thinkin' freak her, but I should've been thinkin' leave her\n\n[Hook]\nHow could this be wrong, when it feel so right?, (right)\nAnd if I'm wrong it won't be the first time in my life\nI asked myself, I said, how could this be wrong, when it feel so right?\nAnd if I'm wrong it won't be the first time in my life\n\n[Verse 2]\nI think I'm 'posed to say I let her go but the pussy soakin' wet and I keep goin' back for mo'\nMy nigga he trippin', he weak, I need to tell my son, dawg\nThat this bitch like the next bitch, for the big dogs  she a jump-off\nHe might not know what I'm sayin', he might feel some way 'bout his man\nHe might turn on me and hate me\nIs these just excuses I'm makin'?\nI'm fuckin' his bitch, droppin' her off to go fuck with my dawg\nPick him back up and go drop my boy off\nTake that lil pussy right back to the house\nWe go from the bed, the shower the wall\nShe suckin' my dick while he ringin' her phone\nThis can't go on, this shit is wrong\nWe be in the same room, sittin' on the  same couch\nWe probably could make it if nobody talked\n\n[Hook]\nI asked myself, I said, how could this be wrong, when it feel so right?\nAnd if I'm wrong it won't be the first time in my life\nI asked myself, I said, how could this be wrong, when it feel so right?\n(I know a lot of people done been thru this)\nAnd if I'm wrong it won't be the first time in my life\n\n[Verse 3]\nHere's a story 'bout a bad bitch, dark and lovely, real thick\nShorty stands up out\nHere's a story 'bout a bad bitch, dark and lovely, real thick\nShorty stands up out\nWhy do we do the things we do, girl, do these things we choose?\nWhy do we do the dude?, girl\nWhy do we do the things we do, girl, do the things we choose?", "image": "https://images.genius.com/3be3493d36e985ac554e1f2d42e33dee.1000x1000x1.jpg"}]}