{"songs": [{"year": "2001-10-16", "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "Str8 Outta Detroit", "album": "1 Less G n da Hood", "lyrics": "[Intro: Jamie Madrox]\nBitch, you can straight up eat a mothafuckin' dick! I'm lookin' at the\nMothafuckin' frontline. I see Violent J....Anybody Killa...and that\nMothafuckin' dead homie, BLAZE!! See, we represent a mothafuckin' hatchet on\nThe daily. WORLD WIDE BABY!! But for this moment in time, we wanna give up\nProps to D-Town (DETROIT!!!)\n\n[Verse 1: Blaze]\nStraight outta Detroit, crazy mothafucka named Blaze\nBack from the dead, tell my story on the front page\nWhen I'm jackin', I got a Mack-10\nSqueeze the trigger off for criminals and axes\nWhich wanna y'alls wanna fuck with me?\nThe police are gonna have to come and get me\nWe stompin' yo ass, bitch I ain't goin' out\nAll you suckas, ain't nobody showin' out\nNiggas wanna set trip, try and talk shit\nCold cock yo' ass and leave you with yo' wigsplit\nGoin' off on any bitch like that, with a gat\nThat's pointed at yo' dome! So give it up sucka\nI'm down with Anybody, \"Drive-By, muthafucka!!\"\nHe's a murderer, best keep yo' distance\nDown with the Family, like Charles Manson\nCrook throwaway is a mothafuckin' tool\nDon't make me act a mothafuckin' fool\nMe and you can go, toe to toe, maybe\nOn the corner, strapped, slangin' rocks daily\nAnd turned weekly, monthly, and yearly\nAll the thugs in the hood represent me\nCuz I'm down with a capital D-E-T\nBitch, you can't fuck with me!\nWhen I'm in yo' neighborhood, you better duck\nYa Dead Homie, still crazy as fuck\nMashin' on you bitches, I think you get the point\nEastside, mothafucka, comin' straight outta Detroit\n\n(Yo, Anybody, tell em' where you from!)\n\n[Verse 2: Anybody Killa]\nStraight outta Detroit, the name is Anybody Killa\nEvery bitch I choke, yo, my rep gets bigga\nI'm a thug muthafucka, and you know this\nBut you playa hatin' bitches better never ever show this\nI don't give a fuck, I make my cheese\nMiddle finger in the air screamin' \"Fuck the police!\"\nStraight servin', we call a cop car, jack it\nRun your donuts, your guns, and your badges\nShoot a muthafucka in a minute\nFor some hood rat pussy and go up in it\nSo if you at a show, in the front row\nI'ma call you a bitch if yo' ass ain't a juggalo\nBitches gettin' mad, bitches ain't shit\nBitches and hoes can eat a muthafuckin' dick\nI'm a crazy muthafucka from the streets\nWith them thug ass lyrics and them thug ass beats\nAnybody controls the automatic\nSo any punk muthafucka that start static\nWith my dead homie, or by myself\nEverytime, I pull the AK off the shelf\nSecurity is maximum and that's a law\nK-I-double-L-A, I'm raw\nBitch, I'm a muthafuckin' villain\nStand in my way and you're witnessin' the killin'\nCreepin' up without a clue\nAnd once you in the scope, yo' ass is through\nSo bitch, you better get a grip\nCuz Anybody Killa's on a gangsta tip\nStraight outta Detroit!\n\n(J is his name and the boy's comin')\n\n[Verse 3: Violent J]\nStraight outta Detroit!\nIs it nut that I'm cut, like whut?\nAnd make your sister eat butt\nDangerous a thug claimin' Southwest\nI'll leave an axe hangin' outta yo' chest\nSee I don't give a fuck, that's the problem\nI see a muthafuckin' cop, I'ma stop him\nPlay it smart and ask for directions\nAnd then shank him in the fuckin' midsection\nTo me, it's kinda funny, this Prozac\nI don't know where the fuck I'm goin' or where the fuck I'm at\nI'm just rollin', lookin' for some ecstasy\nSo I can get high and fuck this bitch next to me\nRuthless... is the label that's floppin'\nBut the hatchetman be choppin'\nCuz it really don't matter bout me\nIt's all Anybody Killa and Blaze Ya Dead Homie\nFeel a little gust of wind and you're dead\nCuz an axe just severed yo' head\nAnd what about the bitch that got shot?\nShe gave me herpes so I shot her in the back\nThis be an autobiography\nOf Blaze, he's dead and gone, but ain't lonely\nDark Lotus will slaughter your mother\nAnd slap your brother\nStraight outta Detroit!\n\n[Outro]\n\"Oh my God!\"\n\"Oh my...Oh my God!\"\n\"Oh my...Oh my God!\"\n\"Oh my God!\""}], "artist": "Blaze Ya Dead Homie"}