{"songs": [{"title": "Control", "album": null, "year": "2013-08-12", "image": "https://images.rapgenius.com/fed29debbafe5b0650a0cd5e46216552.500x500x1.jpg", "lyrics": "[Produced by No I.D.]\n\n[Intro: Big Sean]\nMhm, I look up\nYeah, and I take my time, nigga\nI'ma take my time, woah\nMhm, power moves only, nigga\n\n[Verse 1: Big Sean]\nBoy, I'm 'bout my business on business, I drink liquor on liquor\nI had women on women: yeah, that's bunk-bed bitches\nI've done lived more than an 80-year-old man still kickin'\n‘Cause they live for some moments, and I live for a livin'\nBut this for the girls who barely let me get to first base\nOn some ground ball shit\n‘Cause now I run my city on some town hall shit\nThey prayin' on my motherfuckin' downfall, bitch\nLike a drought, but you gon' get this rain like it's May weather\nG.O.O.D. Music, 'Ye weather\nChampagne just tastes better\nThey told me I never, boy, never say never\nSwear flow special like an infant's first steps\nI got paid to reversed debts\nThen I finally found a girl that reverse stress\nSo now I'm talkin' to the reaper to reverse death\nYep, so I can kick it with my granddad, take him for a ride\nShow him I made somethin' out myself and not just tried\nShow him the house I bought the fam, let him tour inside\nNo matter how far ahead I get, I always feel behind in my mind\nBut fuck tryin' and not doin'\n‘Cause not doin' is somethin' a nigga not doin'\nI said fuck tryin' and not doin'\n‘Cause not doin' is somethin' a nigga not doin'\nI grew up to Em, B.I.G., and Pac, bitch, and got ruined\nSo until I got the same crib B.I.G. had in that \"Juicy\" vid\nBitch, I can't motherfuckin' stop movin'\nGo against me, you won't stop losin'\nFrom the city where every month is May-Day at home, spray your dome\nNiggas get sprayed up like A.K. was cologne for a paycheck or loan\nYeah, I know that shit ain't fair\nThey say Detroit ain't got a chance, we ain't even got a mayor\nYou write your name with a Sharpie, I write mine in stone\nI knew the world was for the taking and wouldn't take long\nWe on, tryna be better than everybody that's better than everybody\nRep Detroit, everybody, Detroit vers' everybody\nI'm so fuckin' first class I could spit up on every pilot\nThe city's my Metropolis, feel it, it's metabolic\nAnd I'm over niggas sayin' they're the hottest niggas\nThen run to the hottest niggas just to stay hot\nI'm one of the hottest because I flame drop\nDrop fire, and not because I'm namedroppin', Hall of Fame droppin'\nAnd I ain't takin' shit from nobody unless they're OGs\n‘Cause that ain't the way of a OG\nSo I G-O collect mo' Gs, every dollar\nNever changed though, I'm just the new version of old me\nForever hot-headed but never got cold feet\nGot up in the game, won't look back at my old seats\nClique so deep we take up the whole street\nI need a bitch so bad that she take up my whole week\nSean Don\n\n[Bridge: Kendrick Lamar]\nMiscellaneous minds are never explainin' their minds\nDevilish grin for my alias aliens to respond\nPeddlin' sin, thinkin' maybe when you get old you realize\nI'm not gonna fold or demise\nI don't smoke crack, motherfucker, I sell it!\nBitch, everything I rap is a quarter piece to your melon\nSo if you have a relapse, just relax and pop in my disc\nDon't you pop me no fuckin' pill\nI'ma pop you, then give you this\n\n[Verse 2: Kendrick Lamar]\nTell Flex to drop a bomb on this shit\nSo many bombs, ring the alarm, like Vietnam on this shit\nSo many bombs, make Farrakhan think that Saddam in this bitch\nOne at a time, I line them up\nAnd bomb on they mom while she watchin' the kids\nI'm in a destruction mode if the gold exists\nI'm important like the Pope, I'm a Muslim on pork\nI'm Makaveli's offspring, I'm the King of New York\nKing of the Coast; one hand, I juggle 'em both\nThe juggernaut's all in your jugular, you take me for jokes\nLive in the basement, church pews, and funeral faces\nCartier bracelets for my women friends, I'm in Vegas\nWho the fuck y'all thought it's supposed to be?\nIf Phil Jackson came back, still no coachin' me\nI'm uncoachable, I'm unsociable, fuck y'all clubs!\nFuck y'all pictures! Your Instagram can gobble these nuts!\nGobble dick up 'til you hiccup, my big homie Kurupt\nThis the same flow that put the rap game on a crutch\n(West, West, West, West, West, West)\nI've seen niggas transform like villain Decepticons\nMollies probably turn these niggas to fuckin' Lindsay Lohan\nA bunch of rich-ass white girls lookin' for parties\nPlayin' with Barbies\nWreck the Porsche before you give them the car key\nJudgement to the monarchy, blessings to Paul McCartney\nYou called me a black Beatle, I'm either that or a Marley\nI don't smoke crack, motherfucker, I sell it!\nI'm dressed in all black, this is not for the fan of Elvis\nI'm aimin' straight for your pelvis\nYou can't stomach me? You plan on stumpin' me?\nBitch, I’ve been jumped before you put a gun on me\nBitch, I put one on yours, I'm Sean Connery\nJames Bonding with none of you niggas\nClimbin' 100 mil in front of me\nAnd I'm gonna get it even if you're in the way\nAnd if you're in it, better run for Pete's sake\nI heard the barbershops be in great debates all the time\n'Bout who's the best MC: Kendrick, Jigga, and Nas\nEminem, André 3000; the rest of y'all\nNew niggas just new niggas, don't get involved\nAnd I ain't rockin' no more designer shit\nWhite T’s and Nike Cortez, this red Corvette's anonymous\nI'm usually homeboys with the same niggas I'm rhymin' with\nBut this is hip-hop, and them niggas should know what time it is\nAnd that goes for Jermaine Cole, Big K.R.I.T., Wale\nPusha T, Meek Millz, A$AP Rocky, Drake\nBig Sean, Jay Electron', Tyler, Mac Miller\nI got love for you all, but I'm tryna murder you niggas\nTryna make sure your core fans never heard of you niggas\nThey don't wanna hear not one more noun or verb from you niggas\nWhat is competition? I'm tryna raise the bar high\nWho tryna jump and get it? You're better off tryna skydive\nOut the exit window of five G5's with five grand\nWith your granddad as the pilot, he drunk as fuck, tryna land\nWith the hand full of arthritis and poppin' prosthetic leg\nBumpin' Pac in the cockpit so the shit that pops in his head\nIs an option of violence, someone heard the stewardess said\nThat your parachute is a latex condom hooked to a dread\nWest Coast\n\n[Verse 3: Jay Electronica]\nYou could check my name on the books\nI Earth Wind & Fire’d the verse, then reigned on the hook\nThe legend of Dorothy Flowers proclaimed from the roof\nThe tale of a magnificent king who came from the nooks\nOf the wild magnolia, mother of many soldiers\nWe live by every single word she ever told us\nWatch over your shoulders\nAnd keep a tin of beans for when the weather turn the coldest\nThe Lord is our shepherd, so our cup runneth over\nPut your trust in the Lord, but tether your Chevy Nova\nI’m spittin' this shit for closure\nAnd God is my witness, so you could get it from Hova\nTo all you magicians that’s fidgetin' with the cobra\nI’m solid as a rock, ‘cause I came from a rock\nThat’s why I came with the rock\nThen signed my name on the Roc\nDraw a line around some Earth, then put my name on the plot\n‘Cause I endured a lot of pain for everythang that I got\nThe eyelashes like umbrellas when it rain from the heart\nAnd the tissue is like an angel kissin' you in the dark\nYou go from blind sight to hindsight\nPassion of the Christ, right, to baskin' in the limelight\nIt take time to get your mind right\nJay Electricity, PBS Mysteries\nIn a lofty place tanglin' with Satan over history\nYou can’t say shit to me, الحمد لله‎\nIt’s strictly by faith that we made it this far"}], "artist": "Big Sean"}