{"artist": "Cam’ron", "songs": [{"title": "Calm Down", "album": "Public Enemy #1", "year": null, "image": "https://images.genius.com/93b307f21c101613e827cd273b1a7a51.640x640x1.jpg", "lyrics": "Yo 1 question, where U know Me from?\nOn 40 Duce, got cought with that loaded gun\nSereal scratched Cop Killa U know tha gun, only fear I had wouldn't know My Son. Would of told My Son, who tha hell could doubt Me, rather see Me in a cell then they tell U bout Me\n\nIn DC yo, they cought Me sippin (drunk), at tha light 1 howard night they cought Me slippin, couple shots, took off skippin, co-operate nah My name ain't Rico (U got Me fucked up!)\nLook Chico, Killa tryin to duck tha repo, racketeering, steering + tub prodigo\n\nWhat up Amigo, yeah key pasa, New Yetty is My City Mi Casa\nSqeeze? calm down, no need, nada\nThey're desert apple pie, peach cobbler\nGet tha cool whip, I keep tha tool gripped, got guns that's longer than a pool stick, the front gate, tha backyard & pool sick but when tha Jewels drip I'm a fool Dip\n\nStrip club in tha crib not just a pole, lights flash mirrors up, disco ball (tha whole shabang) & I just go ball\nAct skitzo ya'll, dude 7ft ask how I get so tall\n\n(Hook:)\nSomebody better pray 4 em B4 I get feed up & I lay 4\n\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down!, Wooh-sah\n\nUh!\nSomebody better warn tha kid B4 I call 4 a breach & I storm tha Crib!\n\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down!, Wooh-sah\n\nUh!\n\n(Verse 2:)\nCrack, I wrap it in plastic, pass it\nCDs I wrap it in plastic Classic (classic)\n\nAtheus, Muslim, Catholic, Baptist respect all (respect all) math on mathematics (Wow)\n\nMastered My craft cashed in from the tatics\nMoving forward they say My ass is backwards (how is that?)\nSit back, relax laugh at the bastards (lol)\nShow em how We ball with out having a basket\nBut your family, they gonna be acting dramatic\n\"Look a You BooHoo! \" as they passin Your casket\n\nRumor had it, you got attacked by a savage (animal sounds), true story, his melon got cracked 4 tha cabbage\n\nLike UPS yeah I'm back to My tatics (back 2 it)\nGet it anywhere, I'll even plaster a package\nThe Feds check every FedEx (that's true)\nFuck tha stash box put in your head rest & I'll come to your door, where your head rest, I Don't understand no give Me a yes, Yes!\nHuh!\nI don't even know what maybe mean, Young Girls Lip Gloss Old Chicks Maybelline\n\nMid 20's Mami, pull out your Mac stick, Me I'm still on the corner with chapped lips (chapped lips) I ain't even got a 80cent Chapstick but I\nGot a 2 piece & you'll get jacked Quick!\n\n(Hook:)\nSomebody better pray 4 em B4 I get feed up & I lay 4\n\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down!, Wooh-sah\n\nUh!\nSomebody better warn tha kid B4 I call 4 a breach & I storm tha Crib!\n\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down, Wooh-sah\nCalm down!, Wooh-sah"}]}