{"songs": [{"image": "https://images.genius.com/0c742b5e7fa411f5942bf45a75993255.500x500x1.jpg", "year": "2014-01-15", "lyrics": "[Verse: Alex Wiley]\nI just be peepin shit sometimes I think I should say something\nShit's getting awkward, I pull out the aux cord and play something\nI gotta stay smooth I spin move out of fucked up situations\nSpend my day in front of screens like my whole generation\nI got that shit for the low, keeping shit equitable\nI hope that's understood\nTripping like I licked her toes, your bitch say you be licking toes\nBro that is not cool\nFinna meet up with the God, he know if I slide\nThen dollars I'm dropping a few\nAnd my main bitch along for the ride\nI'm in the office on business, she hopped in the pool\nFeel like I'm living a good life\nCouple weeks straight full of good nights\nI, made a decision to be kind\nNow I'm fucking your bitch from behind\nI'm, not really thirsty to be signed\nI'm with the Village, I'll be fine\nI, hit the peace sign then I recline\nI'm so fucking high nigga we glide, by\n\n[Bridge/ Hook: Alex Wiley]\n\nWhy, all this time\nI thought wrong?\nFallin down made me strong\n\nGot jumped in the 8th grade and it just made me realer\nDon't get why old fuck niggas try to throw shade\nBut it just made me realer\nI've spent weekends sleepless and it just made me realer\nYour bitch cheated, treated, bet the salt can't be realer\n\n[Interlude]\n*crying*\nI can't believe this bitch! We were supposed to get money and ride 'raris together! I bought meals for that bitch! I'd take a bullet for that bitch!\n\n[Refrain: Kembe X]\n\nI no know normal x8\n\n(*tapping microphone*\nYo, is this thing on?\nNo I'm just kidding, I'm in the studio.. I know it's on\nSo one time for the fun time, waited way too long in the lunch line\nIt's the Village Triple 7s for you dumb motherfuckers that can't sit down and shut the fuck up listen just one time please!)\n\n[Verse: Kembe X]\n\nI woke up at the foot of the bed\nTexted my bitch and said, \"It's ugly looking ahead\"\nShe want a love and I want some loves\nIt's obvious we have no page in common baby\nStoners maybe\nBut I can't resist the waves they've come in lately\nI believe, I walk with a beast\nA shield of heaven protects me\nNever-the-less, the devil attacks me\nI run where the flow and the track meet\nBasically, the race that we've creatively cremated\nLeads to hatred, 3rd degrees with salt on the wounds\nHe's faceless!\nContradictions stain my record and I admit it\nConsequences came, I stumbled but I can fix it\nI struggle with my addictions;\nPussy and hoes' attention\nQuick witted bold decisions, Loosie done grown relentless\nI won't lie, no, I've been\nFeeling like God's gone hidin\nWinters froze my whole body dawg\nCenter your mind, soul, vibe, bro\n\n[Refrain: Kembe X]\n\nI no know normal x8", "title": "Made Me Know Normal", "album": "Village Party"}], "artist": "Alex Wiley"}