{"songs": [{"year": null, "album": "He’s Keith Murray", "image": "https://images.genius.com/7e796a2b47ce739fd258b02f553d744e.800x800x1.jpg", "title": "Candi Bar", "lyrics": "[Chorus sampled from Rascalz 'Movie Star']\n\n[Intro]\nShe looks like a (4x)\n\n[Chorus - repeat 4x]\nShe looks like a movie star\nLike a chocolate candy bar\n\n[Verse]\n(She looks like a)\nHeya love love, you little fly lady bug\nCome and swing this episode wit more from up above\nWith them Earl Jeans on fitting tight like a glove\nYou little Cinammon Toast Crunch, come show me some love!\nSlim goodie got tittle litties\nYeah but she's a picture post card pretty fat kitty little bitty, WHOO!!\nYou're provoking me, giving me the notions\nTo make me wanna lick your funky emotions\nShe can make a crippled man walk and a blind man see\nHow can I put this? hmm\nShe can make the Grinch love Christmas\nHow can I manifest her uniqueness in vernacular?\n(Like a chocolate candi bar) yeah that describes her\n\n[Chorus]\n\n[Verse]\n(She looks like a)\nI seen her at the park on the black top watching the kids play\nHey style complimented the sunny day\nThere's a mild nature about her\nGentle but firm for all the bullshit life brought her way\nYou reflected beauty of a starless night by far\nLike Billy Joel said \"I take you just the way you are!\"\nI had a crush on you since the days of love tap\nKarate shoes you had jelly cornrows with the peas in the back\nI knew you'd grow to be a fine specimen someday\nYou the very inspiration for the song I sing\nThe way you sprint the runway and scale the catwalk\nYour life is a movie and the camera's never off\nIt's like love at first taste, coming deep from within\nFrom your DNA structure to your whole body over\nYour beauty is respected in the eye of the beholder\nI love that little chocolate bar tatted on your shoulder\n\n[Chorus]\n\n[Verse]\n(She looks like a)\nOh yeah the time is now and the place is here\nSo come a little closer let me kick it in your ear\nAnd share this wit you girl you super official\nI just wanna bite you girl you look good like a Snickers\nOoh la la, ah wee wee, walking by looking all like I exctasy\nGot doe ma didn't know, good gracious alive!\nAw shuck now, there she go\nHey yo come and rest your feet my little chocolate soufflet\nI know you're tired you been running through my mind all day\nAnd Oh My Goodness! can I get a witness?\nThis roundy brownie is something to see\nI never had a craving like this before, I'm addicted\nLord have mercy! please give me strength!\nDark, rich and thick like a fresh baked cake\nJust thinking of your shape girl I catch a toothache\n\n[Chorus]\n\n[Outro]\n(She looks like a)\nWe just buggin out a little bit, showing versatility"}], "artist": "Keith Murray"}