{"songs": [{"title": "Praktice", "lyrics": "[Intro]\nLike we ain't never ever go hard for this\nThey don't let us in, we bogartin' this shit\nYeah\nThey talkin' 'bout practice, bloody\nLike we don't practice, bloody\n\n[Verse 1]\nWho said I don't go hard? Bitch, I go so hard\nI don't care who got it, we still in charge\nFuck these hoes, fuck these broads, I don't got no time (no)\nDo you see my pockets (yeah), I'm doin' just fine\nDon't call my line, don't call my line (don't call it) if you ain't talkin' checks (what?)\nOh you tryna flex? (What?), we are not impressed\nBankrolls in my sweats, hitters to my left (woo, woo)\nPull up to the club (skrrt), fuck it up, then we left (skrrt)\nHennessy on my breath, OG in my chest\nOh you makin' threats? Okay, say less (say less)\nDon't act like you know me (huh?), I don't know you guys (no)\nSo if I say, \"Who you?,\" (who them?) do not act surprised\nMan, I don't pay y'all no mind, no, I just pay my bills (yeah)\nNo Netflix and chill, bitch, I get checks and chill\nPut that pussy on my grills, bitch, tell me how it feels (woo)\nThey say that I'm rude, no I'm just that real (woo)\n\n[Chorus]\nY'all talkin' 'bout practice\nY'all talkin' 'bout practice\nBitch, we active, we active\nI just dump a bitch and dump my ashes, my ashes\n\n[Verse 2]\nOh you tried to doubt me? They tried to doubt me\nOh you a hater? Keep that shit from 'round me\nPull up in that Audi, skrrt skrrt, then I'm outtie (skrrt skrrt)\nPut my chain on her, she like, \"Oh, you tryna drown me?\" (Ooh)\nBack when I was broke, you was tryna clown me\n'Member when you said you was better off without me?\nNow I'm shittin' on you (shittin'), ooh, I did it on you\nNow you got the blues, like I'm Crippin' on you (woo)\nBut I'm on my Blood shit, suu whoop, suu whoop (suu whoop)\nI be fuckin' doll bitches, voodoo, voodoo (voodoo)\nIf you gettin' money then, you cool, you cool (you cool)\nBut I don't know you guys, who you? Who you? (Who dem?)\nI do what I do, bitch, mind your business\nI'm talkin' my shit, because I'm twisted\nI'ma be a billionaire, speak that to existence (ayy)\nI believe that shit, if I say it then I meant it\nYou can't tell me nothin', everything in function\nI don't hear no facts, nope, I just hear assumptions\nYou said you was poppin' (word), I heard you was bluffin'\nOh you frontin', frontin', you really 'bout nothin'\nChicken with the stuffin', we gettin' that bank, bank\nWe gettin' that KK, fuck what you think, think\nWe smokin' that stank, stank, loud pack, yeah that dank, dank\nI ball every pay day, everyday is pay day\n\n[Chorus]\nY'all talkin' 'bout practice\nY'all talkin' 'bout practice\nBitch, we active, we active\nI just dump a bitch and dump my ashes, my ashes\n\n[Outro]\nAyy, ayy, ayy, ayy\nAyy, ayy, ayy, ayy\nBloody, bloody, bloody, bloody\nBloody, bloody\nLike we ain't never ever go hard for this shit\nThey don't let us in, we bogartin' this shit\nLike we ain't never ever go hard\nThey don't let us in, we bogartin'\nBloody, bloody, ayy\nBloody, bloody, ayy\nWe go hard for this\nIf they don't let us in, we bogartin' this", "album": "NBA 2K19 Soundtrack", "year": "2018-03-23", "image": "https://images.genius.com/4168a0b53528a5f6425305af66a86112.500x500x1.jpg"}], "artist": "Young M.A"}