{"songs": [{"album": "All 6's and 7's", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg", "year": "2011-06-07", "title": "Cult Leader", "lyrics": "[Intro: Tech N9ne]\nIn this house there is no room for envy!\nThis is why we wear uniform!\nRacists, not welcome!\nRapists, not welcome!\nHatred, dreaded in this house!\nReady to fight hatred with love?\nJoin us!\n\n[Hook: Liz Suwandi]\nIf you come with me then I can show you\nWhere we'll take you, where you dare not go to\nFollow me and let my mind control you\nWe'll rebuild this world that will destroy you\n\n[Verse 1: Tech N9ne]\nHow many wanna go? How many wanna know?\nHow to fight demons when the planet is gonna blow\nA lot of ammunition gotta be packing a lot of dough\nBeing together and it is wonderful\nA gun was loaded, one exploded\nSpeaking evil with the tongue he just folded\nFrom the Tech soldier, some get blessed over\nBums they come from straight under get swole\nI told ya, that I would die for my loved ones\nKill for my blood ones, beside a cousin\nTogether when the evil does come\nI question are you willing to plug one\nProtection is one thing you need\nTo battle any animal coming with greed\nIf evil try to penetrate us and feed\nSimple mathematics, demon you bleed\n\nI know this comes off violent but this fight's for love\nIt should not be this way but evil drew first blood\n\nPut the roman numeral nine on your inside\nRight wrist, so I can read it properly like this\nThat's how we know we together within the crisis\nAnd you don't need a lot of your money to buy this\nStay with me in the darkness when the light hits\nI will promise your family low prices\nA better war for boys and girls\nMight get a little dark and dirty before we get to the brightness\n\n[Hook: Liz Suwandi]\nIf you come with me then I can show you\nWhere we'll take you, where you dare not go to\nFollow me and let my mind control you\nWe'll rebuild this world that will destroy you\n\n[Verse 2: Tech N9ne]\nThe red is for the blood we all shed fighting\nThe black is for the nights we fight with no lighting\nThe white is for the clouds from which we came flying\nLanding in this jam with man and then began dying\nWe slegna see dread through these retinas\nWe beg to be swept up by the blessed head inspector\nBut all these hecklers don't respect the way we lecture ya\nGet next to ya, that's when the Tech get flexed in a watup who's next with us\n\nIf I happen to die at the end of my run\nPlease give all of my note books and guns to my son\n\nWhen the smoke clears I hope there's some folks near\nTo vote me as the pope here, not quote fear is not a condition and no tears\nThe new color is black clothes black boots and strings\nI'm gonna show these nonbelievers what mass lab producing means\n\n[Hook: Liz Suwandi]\nIf you come with me then I can show you\nWhere we'll take you, where you dare not go to\nFollow me and let my mind control you\nWe'll rebuild this world that will destroy you\n\n[Outro: Tech N9ne]\nThat's right!\nThere are people right outside these doors\nThat actually would attempt to be our oppositions\nSimply, because of the love we have for each other!\nThe love! Ain't that something?\nWe still have our daily jobs, we still pay our taxes, right?\nSome of y'all ain't paid your taxes but we workin' on it right?\nSo what do you think the problem is?\nThat we all dress alike? That's petty that couldn't be it\nThat we helped those in any kind of trouble\nThat's supposed to be a good Samaritan, right?\nThen evil is why we have friction!\nAnd what do we do to evil?\nO.W.H.H! (O.W.H.H!)\nOff with his head!\n(Off with his head!)\nOff with his head!\n(Off with his head!)\nOff with his head!\nThat's what I think"}], "artist": "Tech N9ne"}