{"artist": "C-Rayz Walz", "songs": [{"title": "Elephant Guns", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Verse 1: C-Rayz Walz]\nThe diabolic techniques of immortal struggle\nTo make you question why these dogs ain’t rocking muzzles\nFind you like trouble.  And when shove comes to push\nYou just a punk who wanna bust your gun like “Woah.  Look”\nYou illiterate bastard.  Consider this classic\nYou fabricate madness but can’t look past traffic\nTricksy Sméagols scheme for the precious resource\nWith that, the talent people secrete coughs\nLoud flickies that squeeze soft\nOr go around, come around ‘til you founding me corpse.  Peep the deep thoughts\nMarch on end—no dawn for men\nArmies swarm and form crop cirles.  Then again\nThey plotting stocks and bonds when the drop the bombs\nI’m like “Yo, stop the song” ‘cause my block is Nam.  And if I\nPopped your thong, it’s a fact you pussycats\nGet clapped by the crowd at the hands with Iraq\nNow I rock between a dark place and bionic traits\nSpit shit ‘til my lips drip toxic waste\nReptilians with AKs in front of bagel buffet\n“Don’t worry.  They’re only here to make sure the streets is safe”\n\n[Hook: C-Rayz Walz] (x2)\nYour heart pump Kool-Aid.  My thoughts cut toupées\nYou don’t really want nothing over there\nThey got elephant guns.  Too bad\nElephant guns full-blast\n\n[Verse 2: C-Rayz Walz]\nI’ll take the Brooklyn Bridge now.  “Cash or credit?”\nLaser math or debit?  They edit, sketch\nAnd only show you the game from the players’ lane perspective\n“The Specialist.”  Stay setting the segment\nEncyclopedia-bright, my media write\nLike the verse, down to Earth like a meteorite\nBurst the curse and don’t believe what the media hypes\n‘Cause they the first to fade to black at the speed of your life\nAnd the cold ice current left the stereos froze\nIn this land of milk and honey with no cereal bowl\nThe theory is old.  I see the light of old scheme acting\nCrying wolf pack screaming, “Fire-breathing dragon!”\nAnd the kids on the school bus is Waco fiends\nFrom coffeehead killers out to take your cream\nGet a clip.  But what you spit don’t even matter—you trash\nNow that it’s really time to ball, we gonna shatter the glass\n\n[Hook: C-Rayz Walz] (x2)\nYour heart pump Kool-Aid.  My thoughts cut toupées\nYou don’t really want nothing over there\nThey got elephant guns.  Too bad\nElephant guns full-blast\n\n[Verse 3: C-Rayz Walz]\nI went to the dojo to slice for slow flow\nBring it to the heart of your hood like the Champion logo\nScience this wild—the molecules merging.  The message is certain\nPress 1 if you satisfied, 2 if it’s urgent\nIt’s really your soul on the line—they still got it tabbed, so\nMaybe you should go online, search—then you get it back, yo\nI can feel it in my veins like a heroine rush\n‘Bout to self-combust for the Exxon bus\nBut don’t trust ‘cause the next one us\nWar on the poor (Yes, y’all) for more surplus\nYou stuck?  Don’t remain in the clutch—they shift panels\nThis time, it’s commandos versus camels\nNow light candles for the loved ones gone\nGetting biochemically engineered on—they pawns\nSad song.  This is fornication\nUnder consent of the king.  E.D. vertically\nFire out the sky for the fuel in the ground\nAnd what goes up must come down and crash and sound\nAt Red Dawn, hear hunters platoon for funds\nFor fun, they killing ants with elephant guns\n\n[Hook: C-Rayz Walz] (x2)\nYour heart pump Kool-Aid.  My thoughts cut toupées\nYou don’t really want nothing over there\nThey got elephant guns.  Too bad\nElephant guns full-blast\n\n[Outro: C-Rayz Walz]\nBelief.  Subtle.  So galactic.  (Elephant guns).  Sun Cycle, C-Rayz.  Sorrow we snap.  Solidarity.  Ravipops.  (Full-blast).  Pop.  (Nothing over there).  (Too bad).  (Full-blast).  (Elephant guns).  Snatch your stripe.  See if you were fidgeting.  I just paid, walked out without the fourth ticket.  Shit.  I just bought a missile.  See if you’re official.  A thought missile.  [?].  Check this out.  Just bought a missile.  Essence"}]}