{"songs": [{"image": "https://images.genius.com/dc8859718c8b912f6ac8d798eb3580c0.600x594x1.jpg", "lyrics": "Versatile the style that I'm usin\nI comin sick with these my cutty I'm confusin\nSpittin all this shit that my patnas say is loco\nBut when I do a ruthless switch them fools just don't know\nI might get on my knees and break these fools on the docs\nOr should I get my gat and go pull a heist\nBut everything is fair when a young nigga shoots it\nAnd after all is done all the bullshit is proven\nThat all niggas die no matter how much shit they might talk\nI'll leave a nigga dead wit his head on the sidewalk\nCause when you in this game the shit is settled 2 rounds\nSo somehow rob a bank to get that dollars on\nAnd some still ask me why I keep my gang mentality\nHow could I not with 23 in back a me?\nAt first we was a posse now we is a faculty\nI'm stickin to my cutties cause I love em like a family\nSo when I'm in this shit you don't understand me pal\nSo shut it down when Mac Mall is comin versatile\n\nVersatile\n\nVersatile many ways I do ya\nI'm never ever frontin so I guess I gotta future\nIn this rap game a nigga gotta set his goals\nAnd to dump me for these hoes and the ghet' for my foes\nCause niggas ain't real and only time will tell\nSo I sticks to my bitch and be about my mail\nI havin no time to rap about blue cheese\nJust a wackish nigga in yo hood gettin G's\nAnd shit gets sick when ya hit the dope cut\nFiends get beat down and most niggas come up\nWhen I was young I was told to be about yo money man\nBut now I'm comin up, these niggas be actin funny man\nI guess its just the jealousy they feel for me I suppose\nMan its the shit that make these niggas act like straight hoes\nAnd you can shut it down, sit back, and think awhile\nAnd stop playa hatin because I'm comin versatile\n\nVersatile\n\nIn 93 Mac Mall ain't trippin off these fellas\nStickin to my raps keepin these mothafuckas jealous\nAnd fools wanna know what I'mma say in the next song\nBitches on my dick cause now I gotta microphone in my hand\nSo now its time for Mall to get his flow on\nKick back, relax, and let this shit go on\nVerse after verse I'm makin the suckas weary\nAnd still sessin the most but playa you don't hear me\nShuttin fools down breakin em off somethin vicious\nKhayree and D-R-E producin all my pimp shit\nThe brothas gettin at me cause a nigga don't sell rock\nI'm rappin and stackin and stickin dick the fat cop\nThe nigga that ya love comin at ya with the dope rap\nThe shit a love ta zap might even busta cap\nOn a fool if he don't wanna stand on what I'm speakin\nOn the mic every hour, everyday, every weekend\nHaha! Its like that doe\nVersatile!\n\nYou know what I'm sayin? Whats up doobie\nVersatile\nHe be fuckin them hoochie know what I'm sayin?\nVersatile\nPDG whassup playa? versatile\nYou know you in there haha versatile\nStricky T yeah whassup? Versatile\nAnd T Love whassup? Versatile\nAll my sess cutties and we at this doe\nHa keepin it goin on in 9-3 versatile\nVersatile Versatile Versatile\nHa yeah straight game...\n\nThinkin about the time I sold the rap game\nAnd he was on the blocks slangin them rocks tryin ta maintain\nMy composure cause life is hella hard for a soldier\nBe slippin up on the pocket and theya foldya\nSomethin like a blanket cause see I'm tryin ta make it\nAnd on the gangsta scene its about the green and niggas hate it\nCause all I wanted to be was a hustla\nI'm tryin ta get rich so fuck a bitch I never trust her", "year": "1993-07-12", "album": "Illegal Business?", "title": "Versatile"}], "artist": "Mac Mall"}