{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Dolla and a Dream II", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, aye wassup man? Aye, uh, aye look man, can I- can I get on- can I just get on this bus? All I got is a dollar fifty, I'm just sayin'. I just tryna get- I'm tryna get on the bus, man. I ain't got no mon- all I got is a dollar fifty, I don't go two dollars. Man, fuck you and yo' bus, nigga!\n(Yeah)\nHey, hey (Yeah, got a dollar and a dream)\nYeah, yeah\nI got a dollar and a dream (Yeah), yeah\nI got a dollar and a dream, real niggas on my team (Hey, hey, hey, hey, hey, hey)\nEverything ain't what it seems\nI got a dollar and a dream, hey (Hey, I'm dreamin')\n\n[Verse 1]\nAyy, ayy, I got a dollar and a dream, real niggas on my team\nEverything ain't what it seems (Uh)\nNiggas hating but I love them even though they trying to scheme\nBut I'm past that (Past that), a nigga's stock is rising like the Nasdaq (Uh-huh)\nThey say I’m the future but yet I’m giving niggas flashbacks\nOf better days when you ain't have to settle for whatever played\nI represent the struggle, nigga, I say what they never say\nWhenever they spit that bullshit they spittin'\nThis that pulpit, I’m hittin' niggas with the gospel (And the lord said)\nHostile with them hoes, I got a dollar in my pocket plus a dream\nYeah you laughing my nigga but everything ain't what it seems\nWhat it means to know your mama or your father on that pipe\nOn that hard white, I’ll tell you what them scars like\nI’m speaking through these bars like a nigga in the jail\nTired of siftin' through my mail, I feel like Cartwright, bills (Bills and bills and bills)\nFor real, a nigga ill\nJust let me do the talkin', man, I know how niggas feel\n\n[Chorus]\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems\n(God damn, nigga. These motherfuckin' bill collectors, man)\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems\n(Can't even God damn turn on my phone without these nigga ringin' me up)\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems\n(They tryna call me from different numbers and shit. Tryna- tryna fool me, nigga. I'm Lil Cole, nigga!)\nYeah, got a dollar and a dream, real niggas on my team\nEverything ain't what it seems, yeah\n\n[Verse 2]\nI got a dolla and a dream, real niggas on my team\nEverything ain't what it seem\nEvery lady ain't no ho and every bitch ain't no queen\nEvery nigga ain't no dog and every nigga ain't no king (Uh-huh)\nShit be happening for a reason, everything is everything\nEvery nigga can't dunk, some white man can jump (Haha)\nThey shootin' niggas 'fore they even tell 'em put their hands up\nCrooked cops got a nigga scared to drive\nProbably thinkin' that I’m slangin', man, I see it in their eyes\nBut inside of my pocket is a dollar, plus a dream\nYeah, you swear your girl is faithful; everything ain't what it seems\nSee, I seen how she glance and looked away like she want it\nI ain't sayin' I'ma fuck her, but I could if I wanted\nKnow it hurts that she flirt with a nigga, this is worse\nI bet if I was to hit, man I wouldn’t be the first (Nah)\nThis is church, this is gospel (And the lord said)\nSpit it like I get it from the Bible for your survival\n\n[Hook]\nI got a dollar and a dream, real niggas on my team\nEverything ain't what it seems (Yeah, ayy, yeah-yeah-yeah)\nAyy, I got a dollar and a dream, real niggas on my team\nEverything ain't what it seems (Uh-uh, uh, uh)\nAyy, I got a dollar and a dream, real niggas on my team (Wait 'til I get my money ri- hehehehe)\nEverything ain't what it seem\nYeah, I got a dollar and a dream, yeah, I got a dollar and a dream\n(Wait 'til I get my money right, I'm dreamin')\n\n[Verse 3]\nCheck it\nAye Sallie, I know I ain't been answerin' your calls (Aww, not this bitch, yeah)\nBut shit, let me explain- (I can explain, I can explain)\nIt's because times been hard\nBeen runnin' 'round tryna find a job (I can't get no job)\nI hear my phone ringing in the morning, 9 o’clock\nAnd it's you (God damn), can't even front, I press ignore (Yeah)\nI still got your letters layin' in my dresser drawer (Haha)\nYou tellin' me about all the things you did for me (I know, I know, I know, I know)\nWhen I was broke, you sent me dough and that was big for me (I know, I know, big for me)\nSee you was there every year when I needed you\nAnd you were so quick to give I had to be with you\nRemember when I used to call you on your phone line\nI knew it was official when my mama cosigned (Haha, yeah)\nBut in no time, a nigga graduated\nI hit the real world, baby girl, I'm sad to say it\nBut I was usin' you, you gave a nigga major stacks (Major stacks)\nAnd I know in my heart one day that I'm gon' pay you back\nI got a dollar and a dream\n\n[Outro]\nI'll pay you back. Look, can we- can we set up some type of payment plan or somethin'? Like, you know what I'm sayin'? Like, you know? I just graduated six months ago so you know, times is kinda- times is kinda hard, baby. I- I just- can I just pay you like a lil' bit right now and then I pay you- I pay you the rest next- next month when I get paid. Can I just do somethin' like that? I gotta- I'm not even gon' lie to you, I don't, I don't really have it right now. I gotta pay how much? Five thousand dol- Aw, nigga is you crazy? Bitch you lucky I even answered the phone, I shouldn't have even picked up this motherfucker, I s- Look, what's ya- what's ya name? Can I- can I speak to a manager? You are the manager? Look, look can I speak to yo' manager? Who's- who owns this motherfucker? Let me talk to the owner! God damn it, I ain't- y'all niggas crazy... hahaha"}], "artist": "J. Cole"}