{"artist": "C-Rayz Walz", "songs": [{"title": "Articles of War - God’s Geography", "album": "Off the Radar: Exclusive Lacerations", "year": "2003-09-25", "image": "https://images.genius.com/45bc71d58be69256a0b5f9c5f3abc51d.1000x1000x1.jpg", "lyrics": "[Intro: [?] and C-Rayz Walz]\n[?]\nWe hard right here.  We, we straight street.  Let’s go.  Yeah.  Once again.  [?] Boogie.  This right here is C-Rayz Walz.  [?] Triad.  Let’s go\n[C-Rayz Walz]\nRunaway, runaway, runaway slave theory.  (Stronghold!  Stronghold!).  Yeah.  C-Rayz if you hear me.  Sun Cycle.  You’re too close if you near me.  “T.O.P.”  I’m your brother—don’t fear me.  People Army spaced out with particles galore.  Studio 116, “Articles of War.”  Triad, Triad’s in locks.  “Articles of War.”  Read the pages, yo\n\n[Verse 1: C-Rayz Walz]\nYo, perfect timing.  (What?).  Is it worth it rhyming?\nWell, I’m working, grinding as a person trying\nI sip my drink.  Multitalented, I think\nHow my peoples on the brink living extinct\nYou know who grab the microphone and flow no pranks\nStrong enough to go butt-naked with rocks against tanks\nYou don’t understand my block harassed by cops\nWho wanna feel my balls like they searching for rocks?\n(Yeah) Yeah, I know.  Yeah, they searching for knots\nI’m thirsting to pop—another missing person, bursting the shot\nFrom the Glock.  Attack in slow motion\nCommotion stops.  Stronghold coaching your plot\nMake a toilet post up when we approach ya\n(C-Rayz) I’m not interested in your toaster roaster\nBut this 9 will Park your mind like you testing Rosa\nGet up!  Get out your seat!  It’s over\nWe not friends ‘cause you rap.  Don’t give me your DAT\nCut the wax?  Nah, I got samurai swords for that\nChop your head off with a tap from my finger\nY’all cats raps ‘cause y’all can’t be singers (Slap)\nThis is off my rack now like my hat to the back\nTrack-my-hairline rhyme—the mind goes back\nYeah, I’m looking just like my pops\nAnd I swing like him—this time, it’s minus the rocks\nI smuggle the microphone inside clubs to rock\nI guess both of us really have a talent to rock\nMost brothers try to escape the block by\nGoing to rock or pushing rock\nSee, we all pushing the rocks, kicking the dirt\nYou got a better chance pushing the rock, putting in work\nYou might score if you get a chance to take a shot\nBut don’t stop.  Hot hip hop’s flagrant\nBut they make you rock for a CIA agent\nThe way I rock make your eyes puffy when I see ya\nAnd they can’t hold me down like Mumia\nOn the move like John with a magic wand\nYou don’t want to go against them ancients, human pawn\nRunning calm ‘til he jumps over your picket fence\nLike a native sorceress, mystic, intense\nIn both songs, y’all were speeding, your eyes bleeding\nWatching me playing with crystal in Eden\nTen naked queens giving me [?] with great [feet and?]\nI ain’t even steaming seeing they bodies like that (Know what?)\nI seen it before (Seen it).  I know how to rap and act (What?)\nSo don’t be confused by my diamond shining, cuz\nNo shit represent the power of love\nAnd the pearls is Tahitian.  Keep breathing\nI’m Mars.  You bitch niggas is from Venus, penis\nI’m ill like rocking Mecca in Mecca\nDrinking tangerine nectar in the Cabo sector\nSpitting skill with sound but found found weapons\nRepping with an ill roundhouse like Tekken\nSo do the knowledge.  It’s not a game in a booth\nThe Sun Cycle.  I explain truth to the youth\nWrote the verse in a hearse across from a church\nHad to drop the pen.  Hold my head.  Thoughts burst lead\nFirst thorough borough bread—the golden egg worth it\nThe purpose: rehearse death ‘til I live perfect\nGoose gander.  “God Geography” grips the globe\nLeviathan lust got you stuck with swole lymph node\nLost souls soak up scrolls through Morse code\nAnd sip a six pack from Satan’s torso\n\n[Outro: [?] and C-Rayz Walz]\nHuh.  “God Geography.”  “God Geography.”  “God Geography.”  The body and the mind at the same in time (Time).  Studio 116.  Triad, “Articles of War.”  (Runaway slave).  Articles implore, universal doors open and we out, and we out.  Yo, [?], we on out.  Yo, [?].  Yeah.  [?].  You know my people.  NIW.  Huh?  Huh?  Huh?  Stronghold, People Army.  Get free, get free.  “Articles of War”\n[?]\nUh.  Studio 116.  Uh"}]}