{"songs": [{"year": "2010-04-27", "lyrics": "[Chorus: Hayley Williams]\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now\n\n[Post-Chrous: B.o.B]\nDreaming… of falling\nDreaming… of falling\n\n[Verse 1: B.o.B]\nYeah, let's pretend like it's '98\nLike I'm eatin' lunch off of Styrofoam trays\nTryin' to be the next rapper comin' out the A (A-Town)\nHopin' for a record deal to ignore my pain\nYeah, now let's pretend like I'm on the stage\nAnd when my beat drops everybody goes insane\nOkay, and everybody know my name (Bob)\nAnd everywhere I go people wanna hear me sang\nOh yeah, and I just dropped my new album\nOn the first week I did 500 thousand\nGold in the spring, and diamond in the fall\nAnd then a world tour just to top it all off\nAnd let's pretend like they call me the greatest\nSellin' out arenas with big-ass stages\nAnd everybody loved me and no one ever hated\nLet's try to use imagination\n\n[Chorus: Hayley Williams]\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now\n\n[Verse 2: B.o.B]\nOkay, let's pretend like this never happened (never)\nLike I never had dreams of bein' a rapper (rapper)\nLike I didn't write raps up in all of my classes (classes)\nLike I never used to run away into the blackness (yeah)\nNow, let's pretend like it was all good (good)\nLike I didn't live starin' in the notebook (notebook)\nLike I did the things that I probably knew I should (should)\nBut I ain't have neighbors, that's why they call it hood (hood)\nYeah, now let's pretend like I ain't got a name (no)\nBefore they ever called me B.o.B or a.k.a. Bobby Ray\nI'm talkin' back before the mixtapes (Cloud 9)\nBefore the videos and the deals and the fame (yeah)\nBefore they ever once compared me to André (3 stacks)\nBefore I ever got on MySpace (yeah)\nBefore they ever noticed my face (yeah)\nSo let's just pretend and make wishes outta airplanes\n\n[Chorus: Hayley Williams]\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now\n\n[Bridge: B.o.B. & Eminem]\nAnd it seems like yesterday it was just a dream\nBut those days are gone\nThey're just memories\nAnd it seems like yesterday it was just a dream\nBut those days are gone\nAll right…\n\n[Verse 3: Eminem]\nLet's pretend Marshall Mathers never picked up a pen\nLet's pretend things woulda been no different\nPretend he procrastinated, had no motivation\nPretend he just made excuses that were so paper thin\nThey could blow away with the wind\n\"Marshall, you're never gonna make it\nMakes no sense to play the game\nThere ain't no way that you'll win.\"\nPretend he just stayed outside all day and played with his friends\nPretend he even had a friend to say was his friend\nAnd it wasn't time to move and schools weren't changin' again\nHe wasn't socially awkward and just strange as a kid\nHe had a father and his mother wasn't crazy as shit\nAnd he never dreamed he could rip stadiums and just lazy as shit\n\"Fuck a talent show in the gymnasium, bitch!\"\n\"You won't amount to shit—quit daydreamin', kid!\"\n\"You need to get your cranium checked.\"\n\"You're thinking like an alien, it just ain't realistic.\"\nNow pretend they ain't just make him angry with this shit\nAnd there was no one he could even aim when he's pissed at\nAnd his alarm went off to wake him, but he didn't make it\nTo the Rap Olympics, slept through his plane and he missed it\nHe's gon' have a hard time explaining to Hailie and Lainey\nThese food stamps and this WIC shit\n‘Cause he never risked shit, he hoped and he wished it\nBut it didn't fall in his lap, so he ain't even here, he pretends that—\n\n[Chorus: Hayley Williams]\nAirplanes in the night sky are like shooting stars\nI could really use a wish right now\nWish right now, wish right now\nCan we pretend that airplanes\nIn the night sky are like shooting stars?\nI could really use a wish right now\nWish right now, wish right now", "title": "Airplanes, Pt. II", "album": "B.o.B Presents: The Adventures of Bobby Ray", "image": "https://images.genius.com/ff4d9bb096ad39d2f1abc7313779642c.1000x1000x1.jpg"}], "artist": "B.o.B"}