{"songs": [{"year": "2012-10-22", "album": null, "image": "https://images.rapgenius.com/by8dnoiat5fe4tp8eugoagwpv.300x300x1.jpg", "title": "County Building Blues", "lyrics": "[Produced by DJ Khalil]\n\n[Intro]\nGreeting boys and girls (Greetings boys and girls)\nMy name is Petey P (My name is Petey P)\nKendrick's childhood imaginary friend (That’s right, that's right, that's right)\nI am your neighbor (I am your neighbor)\nAnd I’d like to welcome you to good kid, m.A.A.d city (good kid, m.A.A.d city)\nSo grab your cartoons and cereal (And sing)\nYour pop guns and fireworks (And sing)\nAnd sing along (Along)\n\n[Chorus]\nWhen we grow up we gon go and get us a million\nSpend it all in front of the county building\nBlow it like Coltrane, blow it like Coltrane, yeah\nSing along kids, sing along\nWhen we grow up we gon go and get us a million\nSpend it all in front of the county building\nBlow it like Coltrane, blow it like Coltrane, yeah\n\n[Verse 1]\nKendrick, you remember that one time when we was...\nI’ve been waiting on this day since Dr. Dre and Pac\nWas on Rosecrans in that burger stand at '95\nPeople staring at 'em in amazement\nReservations at the Days Inn\nWe was living out a hotel at the time\nBreakfast, lunch and dinner, chicken from Kentucky Fried\nMama babysitting Section 8 vouchers the move\nWhen nothing else to lose but a burger flipping job\nClose my eyes inside the swap meet and imagine it's a mansion\nGold ballroom, AK-47 dancin'\nHowling at the moon, what’s a pack of hungry babies?\nHope you feed us soon, bite your back, you die of rabies\nEveryday we pray to eat at the table at Sizzlers\nBut never make the visit, if better days was on its way\nThen they make the decision, to make the wrong turn\nSo for now we heat this skillet so this canned food can burn\nOh yeah, I remember that, it- it was the ravioli with the hot sauce in it, right?\n\n[Chorus]\nWhen we grow up we gon go and get us a million\nAm I right?\nSpend it all in front of the county building\nOh!\nBlow it like Coltrane, blow it like Coltrane, yeah\nDon't forget to sing along by the way, sing along\nWhen we grow up we gon go and get us a million\nSpend it all in front of the county building\nBlow it like Coltrane, blow it like Coltrane, yeah\n\n[Bridge]\nAnd all the ghetto children in the world say, “that’s my car” (Aye, oh)\nAll the ghetto boys say, “that’s my car” (Aye, oh)\nAll the ghetto girls say, “that’s my car” (Aye, oh)\nWhen we grow up, when we grow up (Aye, oh)\nGhetto children in the world say, “that’s my car” (Aye, oh)\nAll the ghetto boys say, “that’s my car” (Aye, oh)\nAll the ghetto girls say, “that’s my car” (Aye, oh)\nWhen we grow up, when we grow up (Aye, oh)\n\n[Verse 2]\nNigga you remember the smoke and the burning buildings and shit?\nCouple stolen T.V.'s and a seat belt for my safety (Uh-huh)\nPlayed the passenger I think it’s five years after eighty (Yeah, yeah that)\nSeven, do the math, ‘92, don’t you be lazy (I won't)\nLooking out the window, notice all the essentials\nOf a block party that stop for a second, then it rekindle\nLike a flame from a trick candle, everybody got dental\nInsurance ‘cause we ‘bout to floss, you get that couch I sent you?\nI heard that from a block away, probably had credentials\nOf a scholar but, shit, not today, them Dayton Spokes was his to take\nRefrigerators, barbecue pits, and Jordan kicks\nThey did invasions while helicopters recorded it\nHello Mi-Mister Miyagi, I want them Kenwood woofers\nSay that you got me, if not, I’ll dig in your drawer for it\nThe swap meet was the bulls' eye like Tauruses\nMurder was the melody you should know what the chorus is\n\"Papa, you really telling me we can just get some more of it\nIf we run out?\" He said, \"Lil' nigga, today the poor is rich\nDon’t tell your mom that you seen a Molotov bomb\nIf she ask just know you have to lie and son don’t forget\nBitches ain’t shit, hoes ain’t neither\nNiggas gon' snitch, watch the company you keeping\nAnd one day you’ll put money in the ghetto when you got it\nRather than having to hustle off these Rodney King riots\"\nThat- that’s right the mothafuckin’ Rodney King...\nYou was with your daddy on Bullis Road\n\n[Chorus]\nWhen we grow up we gon go and get us a million\nThat's crazy\nSpend it all in front of the county building\nBlow it like Coltrane, blow it like Coltrane\nDon't forget, still sing along kids, still sing along\nWhen we grow up we gon go and get us a million\nPlease sing\nSpend it all in front of the county building\nBlow it like Coltrane, blow it like Coltrane"}], "artist": "Kendrick Lamar"}