{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "My First Day", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "TARIQ (NARRATION): Finally. I was in. Tru hit me off with the product, and even hooked me up with a fly spot uptown to hustle the goods. Man, my first day, I G’d off. Yo, with the money I was making, I figured I could get my own equipment. Fuck paying someone else. Point-blank, the money was incredible. By the second day, I started getting regular customers\n\n[*street noises*]\n\nMALE CRACKHEAD: Yo-yo-yo, baby. I’m back, a nigga back. And you know what I did just for you? I brought you some more customers\n\nMALE CRACKHEAD #2: Aye, what’s up, baby? We tryna get it and make it happen. I heard you the new man on the block!\n\nTARIQ: Pssh! And?\n\nMALE CRACKHEAD: Well, if you asking me, I— I think that entitles me to a discount. Mmm… Discount…\n\nTARIQ: Like what, yo?\n\nMALE CRACKHEAD: Like, free, nigga!\n\nTARIQ: Yo, you bugging! I don’t get down like that. Cash money, son!\n\nMALE CRACKHEAD: Cash? Come on, cut a brother some slack. Bitch! See, I bring you mad customers. I look out, I look out— I do whatever you need. W-w-w-wait, I got it, I got it. How ‘bout I hook you up with a brand new Rolex? Look at that, look at that, look at that. Yeah, look nice, right?\n\nTARIQ: Ayo, for real, yo. That shit faker than a motherfucker. You need to back up with that shit, for real. You need to go ‘head with that shit\n\nMALE CRACKHEAD: Okay, okay, okay, okay, okay. You— Y-You know, you got one of them, uh, Timexes, okay. You cool with that. How ‘bout I give you my girl right here?\n\n[*Female Crackhead coughing*]\n\nFEMALE CRACKHEAD: Please…\n\nMALE CRACKHEAD: She don’t care! She don’t give a fuck. She— She’ll clean your house, she’ll iron your clothes, she’ll tune up your car, she’ll wash your baseball caps. She don’t give a fuck!\n\nTARIQ: Yo, what the fuck I’ma do with this crackhead bitch, man?\n\nMALE CRACKHEAD: Hey-hey-hey now, man, now— Ain’t gon’ have none of that shit, man. Don’t be dissing my girl, now, shit. I beat your ass so bad, you be the only nigga in heaven with a wheelchair\n\nTARIQ: Whatever, yo. Strictly cash\n\nMALE CRACKHEAD (*whispering*): Okay, okay, okay. Hey, man. Look, look. Don’t tell nobody this. I’ma offer you this. Only you. I did this once before. Check this out. I’ll suck your dick for a hit. Yeah! Yeah, yeah. Yeah, I know you can’t tell: I sucks a mean dick, see? I hung out with them crack bitches for so long. I watched them suck dick, and I studied their technique\n\nTARIQ: The fuck? Is you crazy, yo? Back up with that shit, man. What you talking about?\n\nMALE CRACKHEAD: Aight, how ‘bout I toss your salad?\n\nTARIQ: Toss my salad? What? Yo, what did I say, B?\n\nMALE CRACKHEAD: How ‘bout I butter your corn? If you don’t like that, I’ll put cheese in your macaroni! Yo, yo, man, it’s hard being hooked, man! It is hard being hooked!", "year": null}]}