{"songs": [{"image": "https://images.genius.com/9703948ee40b2385b6c79a5f9eeffec3.700x700x1.jpg", "year": null, "lyrics": "[Intro]\nOne, two\nCan you hear me?\nYo, Fakts One's again, yeah\n\n[Verse 1]\nYo, my name is Akrobatik and I don't smoke crack\nI won't buy the rhyme if I think the beats whack\nI don't shoot smack or pop pills to get loose\nAnd I don't drink liquor it causes spousal abuse\nPlus I don't smoke cigarettes\nSo you won't see me on the patch or chewing on no nicorette\nI don't pack heat, but if I did you couldn't hold it\nAnd I won't smoke a spliff unless I see you roll it\nI don't talk shit, shit-talkers are mostly feeble\nDon't look down on my people, we all equal\nI don't watch videos, they all the same\nDon't preoccupy myself with glamour, fortune and fame\nThe mic a fight but don't sleep the head skills is tight\nSo don't be the one to break my peaceful streak, aight?\nI don't do none of that shit\nBut if I do it's just because I'm hypocrite just like you\n\n[Hook]\nHypocrite, low down dirty belligerent\nWords and actions always different, ignorant\nEverything you say is insignificant\nSoul is old, rhymes dirty, born illegitimate\nCan't believe a word you say\nWhat you claim you do tomorrow\nYou ain't doing today\nI bet we'd all be your slaves if you had it your way\nBut you wouldn't follow none of the rules that you lay\nYou damn hypocrite!\n\n[Verse 2]\nI won't do a show without half up front\nFourth and one best believe I won't punt\nIf you see me with a honey, best believe she's at least half black\nCause I won't hit the booty unless it's tight fat\nI won't hop a flight without the blade stashed\nSlice your neck if you make the cockpit-dash\nI don't sweat cash, cause it comes and goes\nAnd I try not to call women bitches and hoes\nBut if a ho spread a rumor I ain't smacking the bitch\nI walk past her faster than a Pedro pitch\nCause I don't sweat the words of those that don't matter\nI rise above petty talk and ignorant chatter\nI don't waste my time writing ignorant rhymes\nBut I know that making niggas laugh ain't no crime\nI don't do none of that shit but if I do\nIt's just because I'm a hypocrite just like you\n\n[Hook]\nHypocrite, low down dirty belligerent\nWords and actions always different, ignorant\nEverything you say is insignificant\nSoul is old, rhymes dirty, born illegitimate\nCan't believe a word you say\nWhat you claim you do tomorrow\nYou ain't doing today\nI bet we'd all be your slaves if you had it your way\nBut you wouldn't follow none of the rules that you lay\nYou damn hypocrite! (Fakts One's again)\nYou damn hypocrite!", "title": "Hypocrite", "album": "Balance"}], "artist": "Akrobatik"}