{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/ddb74dfab0d2ccdc33403725587ccf5f.1000x1000x1.jpg", "title": "Oooh", "year": "2012-04-24", "album": "51", "lyrics": "[Verse 1: unidentified]\nYou gotta mastermind these things, man?\nYou feel me?\nPerfection is perfect, man (I hear that)\nPerfect's perfection, man (church)\nAin't that right, ain't that right\nThat's righteous\nYoung ones, trying to stack the young [?]\n\nLemonade gum drops\nMy sneakers hi-tops\nMy eye cyclops\nFrom the cold side of the town\nIcy-Hot patch\nTracks burn from the strike of a match\nCatch your ears, yeah these sounds make a track\nMan this sound way back, like pops with a 8-track\nOr pops with a tape deck\nLemme overdub that\nMain's green over there, that shit blood from the tec\nBlood red is that? I'm touring the map\nASAP, I see my east coast niggas, they rocking\nHold my meds, we're working Miami with Metro Zoo\nSeasick, and my flow got the flu\nBut I'm moving the clothes, handle business on floors too\nOooh, damn baby, you saying you a model?\nWell lemme be your agent, but first I wanna taste it\nI ticky-ticky in it, no copy-paste it\nI'm sippy-sippy pimping, I won't waste it\nTreat hoes like drink, I won't chase it\n\n[Verse 2: unidentified]\nDoing what I want 'til I motherfucking die\n250 for that ounce, I'm so motherfucking high\nFresher than I ever been, represent the Heights\nYou see the tags on, pussy nigga read the price\nMoney woke me up, don't wanna leave town\nGuess a young nigga's stuck on chasing what I love\nHip-hop, started out in the park, but we did it kinda different\nMama house was a start\nKicking raps in the lab\nStraight believing we stars\nLive a wild-ass life, then we spit it in bars\nSwitch clothes through the day, niggas look at me odd\nI'm just standing B, ain't trying to start no problems\nMy own clothes line come and fucking with [?]\nI'm my own club, you ain't got it, I got it\nCopping wishes, spending money you miss\nI don't really give a shit and I ain't been broke since\nFat stacks for the 5, half a 8 for the 10\nWork the rap game forever cause my kid's gotta live\nHave your heart beating, trying to jump out of your skin\nSee what we see [?] this as real as it gets\n\n[Verse 3: Kool A.D.]\nKool A.D., peep the newcomer\nCouple blocks from the sundial\nCandlestick Park\nSouth 1 mile\nAlameda Walnut\nSaint Anthony, tree canopy\nKool A.D., look, it's me actually\nCuban, 19th and Union, movin'\n17 and Martin King, sparkin' things\nLet's do this\nMy bad I slept through the session yesterday\nBut yo, you gotta admit though\nThat's hella Bay\nMoved to New York, cause sometimes you gotta get away\nYesterday, love was such an easy game to play\nJordan shrug, fadeaway\nShout to Dopehead, I'm so dead\nNah, I'm so live\n1, 2, 3, 4, 5\nQuick, we 'bout to go live\nThe magnificent, so significant\nDum Shiny just a little bit\nIsn't it strange how the game change the face of the innocent\nPlus the face of the guilty too\nDude, I'm in a Porsche shouting out \"Not guilty\", dude\nWhat's real to me might not be real to you\nBut yo, you should feel me, dude\nYou should feel me too, boo\nOn the real, me do things that you didn't even think you would see me do\nKool A.D. on your CD or MP3\nTrue, so Sansa Clip? stacked up in magazines\nBanana clip, said it before, you didn't hear\nSo I did that again\nSmoke weed, no aspirin\nIt's me, Kool A.D., I'm back again"}]}