{"songs": [{"title": "Superstar", "album": "The Miseducation of Lauryn Hill", "year": "1998-08-25", "image": "https://images.genius.com/183da2198bbbc2e491fa0ed92a83a8bd.600x600x1.jpg", "lyrics": "[Intro]\nYo hip-hop, started out in the heart\nUh-huh, yo\nNow everybody tryin to chart\nSay what? Hip-Hop, started out in the heart\nYo, now everybody tryin to chart\nC'mon now baby c'mon now baby c'mon now baby c'mon, uhh\nC'mon now baby c'mon now baby c'mon now baby c'mon\n\n[Chorus]\nC'mon baby light my fire\nEverything you drop is so tired\nMusic is supposed to inspire\nHow come we ain't gettin no higher?\n\n[Verse 1]\nNow tell me your philosophy\nOn exactly what an artist should be\nShould they be someone with prosperity\nAnd no concept of reality?\nNow, who you know without any flaws?\nThat lives above the spiritual laws?\nAnd does anything they feel just because\nThere's always someone there who'll applaud?\n\n[Chorus]\nC'mon baby light my fire\nEverything you drop is so tired\nMusic is supposed to inspire\nHow come we ain't gettin no higher?\n\n[Verse 2]\nI know you think that you've got it all\nAnd by making other people feel small\nMakes you think you're unable to fall\nBut when you do, who you gonna call?\nSee what you give is just what you get\nI know it hasn't hit you yet!\nNow I don't mean to get you upset\nBut every cause has an effect! Uh-huh!\n\n[Chorus]\nC'mon baby light my fire\nEverything you drop is so tired\nMusic is supposed to inspire\nHow come we ain't gettin no higher?\n\n[Verse 3]\nI cross sands in distant lands, made plans with the sheiks\nWhy you beef with freaks as my album sales peak? Uhh\nAll I wanted was to sell like five hundred\nAnd be a ghetto superstar since my first album, Blunted\nI used to work at Foot Locker, they fired me: I fronted\nOr I quitted, now I spit it -- however do you want it!\nNow you get it, writing rhymes, in the Range, with the frames\nLightly tinted, then send it to your block to have my full name\nCemented (Lauryn Hill!) And if your lines sound like mine\nI'm taking a percentage (ka-ching!)\nUnprecedented, and still respected\nWhen it's finished, I'm serious, I'm takin over areas in Aquarius\nRunnin red lights with my ten thousand chariots\nJust as Christ was a Superstar, you're stupid, star!\nThey hail you then nail you, no matter who you are\nThey'll make you now then take you down, and make you face it\nIf you slit the bag open, put your pinky in it and taste it\n\n[Chorus]\nC'mon baby light my fire\nEverything you drop is so tired\nMusic is supposed to inspire\nHow come we ain't gettin no higher?\n\nC'mon baby light my fire\nEverything you drop is so tired\nMusic is supposed to inspire\nHow come we ain't gettin no higher?\n\nC'mon baby light my fire\nEverything you drop is so tired\nMusic is supposed to inspire\nHow come we ain't gettin no higher?"}], "artist": "Lauryn Hill"}