{"artist": "Fabolous", "songs": [{"year": null, "album": "There Is No Competition 2 (The Funeral Service)", "image": "https://images.genius.com/3e48ad4f20cefa049457664b2bdd197d.320x320x1.jpg", "lyrics": "[Intro: Cam'Ron]\nYo Fab what up nigga\nFuneral Service, Killa Season, Slime Flu\nLot of shit going on\nLet's get ready to go in though\n\n[Verse 1: Cam'Ron]\nHuh, I said, ice in the ceramic band?\nDamn it Cam, Cam is stuntin'\nWeed in a picnic basket, bastard hit the panic button\nOver a piece of paper, street sweepers, meat cleavers\nDeep freezer, meet your maker, place your order, we the waiters\nCoke, keep it catered, feet are 'gator, keep the flavors\nMain course, meat potatoes, keep your favours, see ya later\nThe crew Damier, black and grey, we the Raiders\nDiamonds in my ear, please baby these are lasers, haters\nFront on me? Huh, I doubt it punk\nPop the trunk, my goons, high noon, out to lunch\nThe D&G bag? That's where the weed stash\nKeep cash, breeze past, fuck y'all, eat glass\nMy tank on full, ease gas\nStay on point with the white, (like who?) Steve Nash\nGun go in the waist, dun' dough, I get cake\nMe and funeral Fab, front row at your wake\n\n[Hook: Vado]\nHit 'em up, shotty blast, zipped up, body bag\nFifth tucked, then what? Bullets hit your body fast\nWe beatin' murderers with the same lawyer Gotti had\nTie him to a pick-up truck and watch his body drag\n\n[Verse 2: Fabolous]\nFuneral, Killa, this just got very scary\nAll the competitions in the cemetery buried\nJesus piece, rosary, black white canary jerry\nPardon me, it's the God in me, marry Mary\nBut all them long stares ain't necessary, hear me?\nCannon with me, not the one Mariah Carey carry\nI'm talking sawed offs and four fizzies\nFuck knocking on the door, to blow the doors off, its more easy\nI'm at the top floor of the Waldorf, for four seazzys\nKnick game, never caught off the floor seazzys\nTonight they lost, fought Lakers, ask Walt Frazier\nWe had a little bet, wouldn't say a vault breaker\nBut watch your mouth, I'm not the best insult taker\nI make them call the yellow tapers and the chalk tracers\nThey got names for niggas like y'all, its called \"fakers\"\nThey should put anthrax in your salt shakers\n\n[Hook: Vado]\n\n[Verse 3: Vado]\nIn due time let your semi spray, they kidnap my slime\nOn a rainy day, I got them back with two 9's and 20k\nTimberland boxes of plenty yay, more squares than Damier\nOur records carry Fs like a Fendi case. Huuhh!\nFour, five meetings make a long day\nRap LeBron James 23 a whole ball game\nThat's what we call cane, black rocks, all dames\nNo slaves, suit and jewels, pin stripe, ball chain. Haa!\nSkinny nigga on his ?? shit\nBenz doors go up like the arms on the Karate Kid\nA cocky kid, no rappers but my pockets big\n\"Can I Live\" bumpin' pumpin' out my mamas crib\nBurners, mayhem murders\nGangland, double black suit, white tie off Space Jams\nI'm causing funeral 'rangements, wake plans\nI'm Paid In Full, y'all ain't rich like Ace, man\n\n[Hook: Vado]", "title": "Body Bag (Remix)"}]}