{"songs": [{"album": "Long Term", "lyrics": "[Intro]\nEverybody get the fuck down now\nSoul in the building\nYeah, we taking everything\nEverything you got\n\n[Verse 1]\nHit the deck I need everything you possess\nI suggest you cooperate for this tech\nSend you to the doctor to operate\nYou complicate my scheme to get rich\nI'll put this heat to your T, let it steam a little bit\nLook, when the chips get low, my fifth just blow\nAnything that I could pawn, come about that, dog\nIt's money to be made and if you got it I'm taking it\nJust run it like a Jamaican and shut the fuck up, nigga\n\n[Hook]\nAnd that might leave more than a rash\nI'm coming for your ass\nPlease hand me the cash\nCause when I'm down on my last\nI gotta re-up fast\nPoint me to your stash\nDon't make me say it again\nBefore I lay you with Reagan, Benjamin Franklin, and them\nFrankly I'm a menace\nIn fact I'm ready to blast\nSo whatever you got, run it\nLike a 100 yard dash\n\n[Verse 2]\nComing for you\nDon't let me catch you slipping in that pretty whip you dip in\nYou would get pulled out\nLike my dick in these women when I'm finna bust, don't test my clout\nYour execution is a must, no doubt\nFor the longest niggas been taking my kindness for weakness\nBut this trigger is killing me and I'm just dying to squeeze it\nFire for hire, don't let your murder transpire\nThinking you will live forever like a fucking vampire\nI arose from the dark to claim everything you own\nAnd there's nothing between us but opportunity and this chrome\nIt don't take a genius to know I mean this, so ante up\nBefore I load the cannon up and blow your ass to Canada\nNigga\n\n[Hook]\n\n[Verse 3]\nI'm wild with it, pistol whip whoever's in the house with it\nCall the cops, tell 'em like a date, I'm going out with it\nGive me the goods, give me the hand me downs\nTell your wife to pull her panties down\nI need those too, what you gon' do?\nDon't jeopardize your life, for the nigga hard body made of cement\nPlus I'm loaded like this clip, off of the Seagrams\nLay you on the floor like granite\nGranted your granny watching, I'm grinning like I ain't just hit 'em\nBetter believe it, my head's sort of off, shit\nI would have robbed Jesus for the cross if I caught him slipping\nGod forgive him for this long arm like Pippen\nThe cars honk but times is hard hard and I gotta eat\nGive me the watch, the Sean-John, even your sneaks\nGive me your socks, your drawers, your fitted, your Boost minutes\nGive me your stocks, your bonds, your blunts, your bongs\nYour food in the fridge, your iPod, your celly\nYou say I'm wrong but I'm deadly\nThat's dead wrong so I'm heavy\nLike Chris Wallace, regardless\nYou're getting stuck up, pussy\nLike a tampon with a handgun, push me\nBut I ain't on the swings, I got this infrared beam and it wouldn't miss a thing\nBow!\n\n[Outro]\nChyea! Rose\nI got you nigga\nI want everything\nI want the jewels, the watches, the bling bling, all that shit\nAll y'all little niggas getting your chains robbed\nI'm on you\nI'm just playing y'all, I wouldn't hurt a fly\nCame out dope though\nCarson arsonist\nYeah, it's funny that you say Carson-Carson arsonist\nThat's where you're from right? Carson?\nYes, yes sir\nWhere is that exactly? If I looked on a map, where would I be lookin'?\nCarson is right in between Compton and Long Beach\nShout out to Carson, Del Amo, that's where I'm from though, DA", "title": "100 Yard Dash", "image": "https://images.genius.com/998194aac1a05158c79d419c442b68ce.400x400x1.jpg", "year": "2009-01-08"}], "artist": "Ab-Soul"}