{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/9a6a33b32659c68f154efced8162fccd.500x500x1.jpg", "title": "A.D.I.D.A.S.", "year": "2003-03-11", "album": "Monster", "lyrics": "[Hook: Sleepy Brown]\nAll day I dream about\nAll day I dream about sex\nThe way you move your sexy groove\nI've got my mind all over you\nAll day I dream about\nAll day I dream about sex\nYou say you were so sick of it\nI'm tired of jacking off cause you ain't there\n\n[Verse 1: Big Boi]\n'65 Chevrolet Impala peachy cream\nCruising down the street like two fingers\nCause the ivory is clean\nTalking bout meeting at the MC room\nOn the inside of the ship\nNot a honey dip to hunt on\nCause she mobile than a grip\nOr the Blue Man Group\nCaught out on the Vegas Strip\nTell em a good game, juju pimping\nGive em to my nigga Dime Legit\nBoss lips, legs, arms, necks\nHip dips, hair net, mo' stretch\nIt's a camel toe and thats fo' sho\nMy brain is on one track\nLike Mary Mary toss for crackle like a rock star does for smack\nNone of that but the female genatalia's where it's at\nI'm a man and I demand a WO-man for that act\nPersonal preference cause I use the law of nature as a reference\nNo I don't ever recall seein' a man turn up pregnant\nBut that's just me\nFrom them female fantasies frolic freely\nIn my cock pit, every 30 some seconds I can't stop it\n\n[Hook]\n\n[Verse 2: Killer Mike]\nKiller Kill from Adamsville and in a Bonneville I chill\nHeffers call me Black-N-Decker, I don't screw them hoes I drill\nI've been cuttin' Cuban coochies since before the record deal\nCatch me daydreamin' 'bout them, thick, medium, or slim\nDoctors call the thing vagina, in the hood we call it trim\nWhite boys call it snatch, Puerto Ricans call it chocha\nNathaniel likes his white, I like mine dark as cola\nIt's the first thing on my mind in the morn' when I roll over\nAll men young or old in the end it's what we after\nEven my grandpappy's happy, he got prescribed Viagra\n\nGrandaddy, grandaddy what's happenin'\nWhat's up, what's up this me\nHey let me get about three of them blue diamonds\nI promise I got you tomorrow\n\n[Hook]\n\n[Verse 3: Killer Mike]\nWhen I drill, I don't spill, even if she's on the pill\nKeep my weapon covered, concealed, and in a shield\nCause I don't need that A.I.D.S\nA D. and an A. missin' out my Adidas\nPLUS, We don't need no DNA mixin' between us\nWe just need to keep this thing friendly and hush hush\nOn the down low, like R. Kelly and youngsters\nBut over eighteen only cause baby I'm no perv\nFrom the tour bus to the lobby, elevator to the room\nWe can jump each others bones but there's no jumping brooms\n\n[Verse 4: Big Boi]\nBuffoon you are too consumed in the womb\nIt is too early for you to jump the broom, boom\n\n[Hook]"}]}