{"songs": [{"year": "2014-10-28", "image": "https://images.genius.com/3b3104658adae3c195e20d5e868f7735.600x600x1.jpg", "title": "Detroit’s New Dance Show", "album": "If There’s A Hell Below", "lyrics": "[Hook]\nGirl you claiming the what?\nLet me know what's up\nWon't you bang in the cut\nThen you say what up\nGirl you claiming the what?\nLet me know what's up\nWon't you bang in the cut\nThen you say what up (x9)\n\n[Verse 1: Black Milk]\nYeah, double or nothing came from nothing\nStill rep the hood that I come from\n\"Where you come from?\"\nCity where the guns run deep the police won't come\nAnd the streets no fun\nAt night where the street lights won't come\nOn where you might get torn on some\nBlock, you could probably lose your life on one\nDo or die from junior high to Cooley High, niggas banged out in it\nAll the same where they all bang\nAnd all slang in the same house with it\nThese niggas live it, roll big trucks\nJust to guarantee these hoes gon' fuck\nPull up already know what's what\nSit her in the back just to let her roll up\nIt's a living hell nigga dark and hot\nCats walk the block don't talk a lot\nMight talk a lot and the sparks'll pop\nOutside the spot of the parking lot\n\n[Hook]\nGirl you claiming the what?\nLet me know what's up\nWon't you bang in the cut\nThen you say what up\nGirl you claiming the what?\nLet me know what's up\nWon't you bang in the cut\nThen you say what up (x9)\n\n[Verse 2: Black Milk]\nStory about the kid that's tryna live, that's tryna get the dough up\nHold the piece, sold the blunt outside the liquor store front\nRoped up if it goes down little homie don't choke up\nPull out let 'em all go, let the fo' bust innocent bystanders so what?\nNah nah, that's how they thinking around here\nNiggas ain't thinking around here\nYou get dropped at the drop of a dime or a blink 'round here\nIn the club don't spill your drink 'round here\nOn a niggas sneaks, niggas don't think 'round here\nPop it up, pop the trunk, pop the..\nOut here no fear no way\nBack to the moral of the story, okay\nBack in the place where you might fall apart\nIt's the beauty and the ugly of it all (x5)\n\n[Hook]\nGirl you claiming the what?\nLet me know what's up\nWon't you bang in the cut\nThen you say what up\nGirl you claiming the what?\nLet me know what's up\nWon't you bang in the cut\nThen you say what up (x9)"}], "artist": "Black Milk"}