{"artist": "Asher Roth", "songs": [{"title": "Blow Yr Head", "image": "https://images.rapgenius.com/d06d51a111785840ab4bb8bbe0752ead.500x500x1.jpg", "album": "Rawther", "lyrics": "[Intro]\nMan, I don't know\nI'm just trying to have fun with it everywhere I go\nTruth be told I just got caught up in a bunch of nonsense\nTrying to take the fun out of my back pockets and stuff\nYou'll never take my freedom, you know?\n\n[Verse]\nYo, Ash stop fucking around, yo where's the album?\nYour second try never came out my man, how come?\nYou were like the coolest guy, now we want Malcolm\nWho out here too loud, you need to turn it down some\nChill, not now son\nYour doubt can't jeopardize my outcome\nI style like I'm stretching out in Shaolin\nMan of many sounds, I come around\nThey ask \"Who?\" like Pete Townshend\nI'm O-Town meets Andre 3000, either way keep bouncing\nIt's wild, I don't even leave the house\nAnd I don't feel the need to reason with you children\nNeeds to be arousing like a jousting match fouled him\nI ain't counting that, astounding how I'm rounding out my alphabet\nWe ain't even rowdy yet\nSalvy ain't make himself a Salvy yet\nBout it since we started smoking salvia\nCruising in a golf cart on the gulf coast with a GoPro\nAnd my bro knows, why old folks go 'There goes that Bozo'\nMy flow like J. Flacco getting tackled by fat dude\nWho grabbed [?] on a back road in bath robe with a bad cold\nHomie, I'm that cold\nAsh, I just walk around with an afro\nAnd a gavel and I laugh more than a jackal\nCrack up, pistachio\nGraduate, forget to flip that tassel\nMy bad yo, that's too much of a hassle\nCasserole with Castro\nStash gets blown like it's a gastro, you gassed though\nMore like watching grass grow\nI can be an asshole\nI rather just hang out in my castle, blast Outkast\nYo Elroy, where's Astro?\nBet if the Jetsons had a best friend from Def Jam\nAnd Geffen and wed them, I would be the best man\nGet it? I'm a breast man\nStick my face right between that chest and\nMotorboat those cocos you know it though\nDon't no one wan' go toe-to-toe…. rototiller… photos off your motorola phone are terrible\nTerrible, Terridome, territory, Tara Reid\nDude from 90210, tornado made of hammer domes\nSharin' poems here, smell my pheromones\nYeah yo, my hair's long\nI don't even care homes\nTakes these earphones, put them on your eardrums\nHere's some of this red rum, you ready boy, here it comes\nYou ready boy, here it comes\n\n[Verse 2]\nOn a full ride to Florida State, too high played it safe\nCould've been Flo Rida, my bad, my mistake\nShould've started Footloose, the new Kevin Bac'\nThe way I play chicken in busses with no brakes\nAnd Busta was on break, taking a pay cut\nI play cuts from my stuff, make everybody go nuts\nNow everybody say \"Whaaaat?\"\n\n[Outro]\nWhat was that? That was fun\nLet's do that again", "year": "2015-02-18"}]}