{"artist": "C-Rayz Walz", "songs": [{"title": "Revelations 15:2 Fuhks", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Intro: [?] and Moses (MaddCold)]\n[?]\nIt’s like family, you know?\n[Moses (MaddCold)]\nWord.  Every time I turn on the television, I see nothing but bullshit.  Rappers are talking about rims and Timbs and how many women they got and everything and they’ve really disturbed the calligraphy of what hip hop really is.  No longer, I don’t see anyone really forcing their true... their true feelings on television anymore.  I just see people flossing ice and everything.  If they’re wearing ice around they neck, they can be feeding little children.  And really and truly, I don’t want to see anymore bullshit.  So I believe that it’s time for a hip hop revolution\n\n[Verse 1: Moses (MaddCold)]\nI refuse the scriptures of pimping as there iller issues.  As I get drunk off my [heckle?] elixir\nPersonality involves a sky tower.  Knock it off at the sky—thinking is a higher power\nWork to think logically, feeling the thought of [Laurie?] or methodically\nCops are trained to annihilate the spick monopolies.  Destroy all the mockeries, establish your own policy\nSearch for all [?], go back to virtuality ‘cause I don’t want to become another atrocity\nAbsorb the animosity, then I convert them into prophecy.  Just read the philosophies of Socrates\n[?] MCs, you must promise me though you strive to be lyrical\nI rip my soul out, shape it into a mic to make miracles.  Turn those who claim to be evil into those who are spiritual\nMy mind is leaking negativity ‘cause the situation is critical\nOn top of that, I can’t spit over the mic ‘cause my soul visual.  Why do people hate everything that’s original?\nWhy does everyone hate me?  ‘Cause I’m an individual\nPoetry is a mental battle, so I [dis-a-mant?] your physical.  I’m gonna symbolically murder all you criminals\nThat try turn hip hop into thug love and rapping bullshit.  The real MCs can feel the pitiful\nSo fuck all the political standard ‘cause I done got graffiti [?] and my artistic vandals\nSo with Biggie’s spirit, here’s my [?].  Send his spirit down to knight me\nI swear that I won’t take this responsibility lightly\nThe Notorious one smiles at me and I get down on one knee and say, “Thank you [?]\nHip hop is dying and very soon it’s gonna become another musical tragedy.  It’s sad to see”\nThese phony artists struggling so to live lavishly.  It makes my mind scream in agony, but I’m glad to be\nA prophet tryna stop it.  I spit these rhythmic rockets to confuse kids who were tryna pull the plug out of the socket\nAin’t scared of all those rappers who plotting this to knock you to monotonous\nSo tell me who the fuck is the revelation\nTwo steps is life’s early stipulation, so I give you this poetic ejaculation—my mental sperm, impregnating\nOver here, a sinking thirst for new, big product.  I knew Big L.  I’m sorry my people [?] lives are gonna burn in hell\nHold on.  Maybe I can [mask?] the day slowly.  Power to a broken native who goes by the name MaddCold\nAnd now the streets can be related.  It’s time to release my thought, spitting rage\nThat’s been caged in a cage that’s being held hostage by a 12-gauge\nAnd when it’s war, I’mma have to be the cause of the next ice age\nSo I put a verbal patch on the ozone layer so we don’t warn ‘em\nI take the verbal commonwealth and lyrically bust on ‘em\nI caught the Dead Sea that contain blood of a dead native [?]\nThoroughly, it’s Diego as you like him.  I see as you silly [?]\nThe time can’t be now.  It’s too early for the [?]\nBut the Sun is losing energy and our Sun and the planets supposed to align\nThe shells are coming at us, so I spit icicles like it’s the man of tigers\nA fourth messiah is on his way but, first, will have to get by us\n\n[Outro: [?] and Moses (MaddCold)]\n[?]\nAight.  Cool, I think we’re good, man\n[Moses (MaddCold)]\n[?]\n[?]\nIt’s like family, you know?\n[Moses (MaddCold)]\nWord"}]}