{"artist": "Big Boi", "songs": [{"lyrics": "[Intro: Big Boi]\nNiggas don't fuck with a nigga like me\n'Cause a nigga like me don't fuck around\nNiggas don't fuck with a nigga like me\nCause a nigga like me don't fuck around, around\n\n[Chorus: Sleepy Brown + Joi]\nI know you see that\nNo one's competin'\nOoh and that turns me on\nOoh, that turns me on\n\n[Verse 1: Big Boi]\nWhat turns me on about ya? I doubt ya have a clue\nSassy attitude and red bottom shoes got 'em mad at you\nI do think you're fierce and that you killin' them, of course\nWith the features of an angel and the bottom of a horse\nThoroughbred, thorough head makes you moist\nLike the dark fudge brownie with the nut of your choice\nSoakin' wet are the feathers in the goose down\nWho's loose now? You done let the juice ooze down\nDo smile, when you do it's on some \"O-o-h Child\"\nKiss you in the mouth, Juicy Fruit make you cool down\nThe naked truth, now ain't it true now?\nDevine nectar, respect her, it ain't shit for me to prove, gal\nYou need some time, press the snooze down\nI don't mind 'cause I'm hard as all the iron in the tool house\nOr tool shed, go and play it how you play it\nWhen alarm sound off, round two is up ahead, yeah\n\n[Chorus: Sleepy Brown + Joi]\nI know you see that (It ain't goin' down without ya)\nNo one's competin' (For what, girl? I already got ya)\nOoh and that turns me on\nOoh, that turns me on\n\n[Verse 2: Big Boi]\nWho gives a damn about the past?\nI live for today, plan for the future, pack a lunch and haul ass\nAnyway, it ain't no time for no picnics\nThis that business, the slickness that get yo' chick hit quick\nI make her drip all her liquids\nThen get butt booty naked when I spit on some pimp shit\nMake her leg shake so she never loses interest\nCallin' out my name when I'm askin', \"Whose is this?\"\nNah, it's not a game, ass fallin' out the frame\nWith my Polaroid camera, I have to take two flicks\nShe can't avoid all this stamina, we do this\nWith no steroids or other artificial juices\nTherefore, she knows the undisputed truth\nWhen I slip into the boudoir or slide into this booth\nI'm kickin' it with you, ma, like martial artists do\nWe can break boards and you can kick rocks or I'm through\n\n[Chorus: Sleepy Brown + Joi]\nI know you see that (It ain't goin' down without ya)\nNo one's competin' (For what, girl? I already got ya)\nOoh and that turns me on\nOoh, that turns me on\n\n[Bridge: Joi + Sleepy Brown]\nSit yourself down on my big ol' bed\nTurn ya body 'round here, let me give you some\nDon't you wanna make a freaky memory with me?\nSo later on you can think about it then you'll be like, \"Damn!\"\nIt turns me on\n\n[Chorus: Sleepy Brown + Joi]\nI know you see that (It ain't goin' down without ya)\nNo one's competin' (For what, girl? I already got ya)\nOoh and that turns me on\nOoh, that turns me on\n\n[Outro: Big Boi]\nFrom the back {*playing backwards*}\nNow from the front\nUp in ya gut\nMore than enough\n{*scatting*} Yeah...", "image": "https://images.genius.com/d490a9246c93be0a14dc0d13699d97a2.908x908x1.jpg", "year": "2010-07-06", "title": "Turns Me On", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}