{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Intro]\nEvery time we wrote a song, it was a hit. You know? It was unbelievable\n\n[Verse 1]\nAKHCHIGA, ARA, I'mma get my APEHS\nI be counting money, tell them niggas try and stop me\nI got the whole hood saying: YB ABRES\nSlide threw the block, top down, nigga VONCES\nYB the rocker, cigarettes and vodka\nShitting on these niggas oops DE DU KAK ES ARA!\nMoney we gets a lotta, money you gets nada\nYES KYF EM, Louis, Gucci, and Prada\nARI ESDEKH AKHCHI, baby girl I need that\nBenz in the fast line, driving with the seat back\nFuck them boys, we strapped, don't make me repeat that\nI'm already drunk now, baby where my weed at?\nPlatinum Motorsport licenses plate on my g wag\nI'm a boss nigga, your mad you couldn't be that\nCalifornia Convict, all my niggas got work\nRappin' ass nigga, we'll catch you at your concert\nOff this Armenian potion, slow motion\nCartier frames on my eyes, I'm focused\nINCH ES ANOOM, I'm clocking dollars\nStranded on this place called real nigga island\n\n[Hook]\nIn my Mercedes Benz like, VONCES APE\nCounting my Benjamins like, VONCES APE\nYou know I get it in like, VONCES APE (x3)\nSpilling vodka in the club (AYOO)\nPull my Adidas sweats up (AYOO)\nCall my Armenian plug, VONCES APE (x3)\n\n[Verse 2]\nComplete the transaction, they ain't even see me brah\nBlowing OG higher than Armenia\nPanamera Porsche with a bad bitch in it\nKim Kardashian look alike, bad send it\nBrown Louise bag with a half in it\nBlack Range Rover with a stash in it\nAbout getting this money, I am passionate\nCatch me at the Famous Smoke Shop cash spendin\nStuff the zig-zag to the tip top\nHad to ride to Glendale for a pit stop\nPolice outside and I ain't trying to get popped\nBoy I stay on my feet like a flip flop\nPolanti jewels on my wristwatch\nI'm counting money bitch, TOON AL LARVADS\nKEF EM ANOOM, in my bedroom\nMove over bitch, I need legroom\nSteps the new dot game, that's what I said to them\nIf he talks dumb, leave him with a head wound\nThe girls go crazy when dude in town\nI'm high as fuck, passed out in a hookah lounge\nI see a bad bitch every time I look around\nThey bumping my shit, heads moving to this song\nHeads moving to the song, (haha) ROCKER! HA?\n\n[Hook]\nIn my Mercedes Benz like, VONCES APE\nCounting my Benjamins like, VONCES APE\nYou know I get it in like, VONCES APE (x3)\nSpilling vodka in the club (AYOO)\nPull my Adidas sweats up (AYOO)\nCall my Armenian plug, VONCES APE (x3)", "title": "Vonces Ape"}]}