{"songs": [{"title": "Bougie", "album": "Love Songs 4 the Streets 2", "year": "2019-07-19", "image": "https://images.genius.com/d754448098f0a66a23cdb14a64b8791f.500x500x1.jpg", "lyrics": "[Intro]\nJahlil Beats\n\n[Verse 1: Meek Mill]\nUh\nWhen I made it rich, I went and bought a Bentley, bitch (Bitch)\nWalk into Saks Fifth like, \"give me that and give me this\" (Gimme that)\nThat's your Wednesday crush, you know Lil' Fish done hit that shit, uh (Shit)\nYou ain't gotta tell me, I know niggas envious, uh (Hey)\nCount the cash while my lil' bitch bounce her ass (Bounce that ass)\nRichard Mille cost 150, that's your stash (That's your stash)\nPoppin' shit on Instagram, that's your past (That's your what)\nWhen we catch you out in traffic, just don't crash (Brr, brr, brr)\nI got a bag, I'm doin' the most, you niggas lamb, I am the GOAT\nThey wanted gas, I'm givin' 'em smoke, jump off the jet, get on the boat\nI'm in a yacht, I'm with a thot, she givin' me throat, aw, shit\nCut off the top, Rolls Royce drop, I get ghost, skrt\nPull up in a \"what the fuck was that?\", ho (That, ho)\nWe still throwin' supermodels off the back, bro (Back, bro)\nAlley-oop my bitch to Harden, I give her back, bro (Back, bro)\nAnd you better not send my bitch back with her back broke (Back broke, gang)\n\n[Pre-Chorus: Lil Durk]\nFirst thing on my mind when I wake up is a check\nIn the trenches with my slimes, they be trippin' off the X\nWhen I'm gone off these drugs, I don't think about my ex\nAnd I ain't know that ho for long, she asked for Audemars Piguet\n\n[Chorus: Lil Durk]\nOh, you want some diamonds, you don't want no bag, you're think you're bougie, huh?\nAnd you don't want no Fashion Nova, you want some Gucci, huh?\nAnd when we out, I can't be seen 'cause I don't know who you fucked\nAnd why she think she playin' me? this shit be groupie love\nOh, I think I'm bougie\nMike Amiri jeans cost me two Gs\nI can't take her to the crib, go get some room keys\nOh, I think I'm bougie\n\n[Verse 2: Lil Durk]\nCame a long way from the trenches, ridin' CTA\nFrom the chopper to the jet, it look like GTA\nAnd they say I won't be shit, ain't make my GPA\nAnd I heard his ass a rat, I'm sippin' T-E-A (Oh)\nI thought you was my B-O-Y, but your ass D-E-A\nI used to walk with a .22 inside my Kenzo\nPaperwork came back too dirty, gotta keep your head low\nIf he too loud and he too wild, then he get paid for (Oh)\nI know some niggas that take your head off for that bankroll\nLawyer money up to my dogs, then it's case closed\nBoy, you just start sippin', we sold him Karo\nI popped some X, I was geekin', I DMd J. Lo (Oh)\nJimmy Kimmel in Chicago, pull up, late shows\nThey put Lil' Vernie in that chair, you know he ate those\nNiggas jumpin' dick to dick, man, I hate those\nI remember I put a dime inside a Faygo\n\n[Pre-Chorus: Lil Durk]\nFirst thing on my mind when I wake up is a check\nIn the trenches with my slimes, they be trippin' off the X\nWhen I'm gone off these drugs, I don't think about my ex\nAnd I ain't know that ho for long, she asked for Audemars Piguet\n\n[Chorus: Lil Durk]\nOh, you want some diamonds, you don't want no bag, you're think you're bougie, huh?\nAnd you don't want no Fashion Nova, you want some Gucci, huh?\nAnd when we out, I can't be seen 'cause I don't know who you fucked\nAnd why she think she playin' me? This shit be groupie love\nOh, I think I'm bougie\nMike Amiri jeans cost me two Gs\nI can't take her to the crib, go get some room keys\nOh, I think I'm bougie"}], "artist": "Lil Durk"}