{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Intro: R.A. The Rugged Man]\nCrustified Dibbs, R.A. the Rugged Man\nNIGHT OF THE BLOODY APES!\nYo, all this horror bullshit is for FUCKIN' FAGGOTS!\nI started it, now I'm gonna end it!\n\n[Interlude 1: R.A. The Rugged Man]\nRarraghrr!\n(What the fuck is wrong with you, basketcase motherfucker?!!)\nAre you talking to me?! (Get off me!)\nI'll kill you with my goddamn drill, uhhh!\n\n[Verse 1: R.A. The Rugged Man]\nLet me tell you about my toolbox, that's right\nI be toolbox murderer (Toolbox murderer!)\nRugged, Rugged Man, Rugged Man, I be the man\nTo hold the microphone decapitated skulls in my another hand\nMaybe the rough guy, tough guy\nYo, we're rough guy, pucker and kiss ya ass goodbye\n'Cuz I'm gonna make 'em (?) Soldiers, let me at 'em\nMove out the way, mad dog, (?) so I don't get 'em\nI got my blowtorch flame to ya frame 'til it sizzle\nI got my ice pick and my chisel\nI'll make ya blood drizzle, think I'm sick?\nYo, I'm sick, but to match me\nRugged, you have know where my (?) be\nYou can run, you can run from blocks, and blocks, and blocks\nMotherfuckers feel it from the toolbox\n\n[Hook: R.A. The Rugged Man]\nRrrargh-rrr, yeah, ((?) to the toolbox)\nRrrargh-rrr, yeah, (I'm murdering)\nRrrargh-rrr, yeah, (TOOLBOX MURDERER!)\nRrrargh-rrr, yeah, (I'm murdering)\n\n[Verse 2: R.A. The Rugged Man]\nMy toolbox, my toolbox, I'm murder, I'm murdering\nI murder them, ya never heard of them 'cos I'm serving them\nYa say I'm crazy, I'm Rugged, my drill\nIt goes rrrargh-rrr, kill the body 'till the blood spills\nI'm not the sexual healing type, I got mad bitches always kneeling\nBust my load up on the ceiling, the rap pro, I'm phat bro\nI might rock the disco, I stick up (rasping noise) is how my lips go\nFuck the (?) everybody\nI don't wanna see anybody's face 'cuz I might hurt somebody\nWith my chainsaw, chainsaw, I got mad love for the chainsaw\nAnd if I don't preach, pleased to beat ya, I got my barb wires\nAnd my pliers to dig ya six feet deeper, stop eatin' all them shit burgers\nDon't get involved with the (?) to my toolbox, I'm murdering!\n\n[Hook]\n\n[Interlude 2: R.A. The Rugged Man]\nArrgh! Take it off, haha!\nI'll saw ya goddamn leg off, haha, hahaha, hahahaha!\n(Oh, stop the pain! Oh my god, stop!)\nAnd I hit you with my chisel, hahahaha, hahahahahahaha!\n\n[Verse 3: R.A. The Rugged Man]\nHard knocks, you wanna be the hard rocks?\nTake a look inside of my toolbox\nFrom the murdering objects, I got my hockey mask and my hood\nI'm up to no good so, don't let me take it to my toolbox\nI got my pencils, objecti-far-in, I got the Crustified\nCrusty bad ass, where's it at in my draw and I'ma make ya (?)\nTurn ya back, I think it's a screwdriver through the head of you\nAnd if I flip, yo, ya better skip town\nYou better not stay around 'cuz I'm Crust Bound\nEven I could well be survive (?)\n'Cuz I kill cadavers for money hungry fibres\nSo when ya towels hear the howls I gave\nI held you like ya fuckin' screaming vowels\nDon't fuck around, don't never fuck around\n'Cos you might end up a body from the toolbox murders\n\n[Hook]\n\n[Outro: R.A. The Rugged Man]\nIt's all over", "title": "Toolbox Murderer", "image": "https://images.genius.com/0459459cdc2f6a1ba50292d192b060db.500x500x1.jpg"}]}