{"songs": [{"lyrics": "[Intro]\nFuck it, I want no bullshit pullin', man. No bullshit over here, kid. Straight from queens, man. Flushing to be exact. Shit\n\n[Verse 1]\nFuck the light at the end of the tunnel\nCause I'm living for today, trying not to drown in a bottle\nDeath all around me, drugs seem to numb me\nMental's getting sicker, the Devil's getting comfy\nAcupuncture with the smoke like I'm Mason Storm\nLegs crossed like a Buddhist, smoking Buddha\nAngry tuna, chilling, getting brain from Uma\nUsed to lose, now everybody kangaroos\nHop off the schnitzel, see me on Kissena\nSmoke the marijueena, always been the same guy\nWhether balling on a yacht, or hauling from the cops\nI'm flooring on the Fox, 'til I'm swelled up in a box\nAll you gotta do is see me when you see me\nI'm burning bitches from the TV like a CD\nI'm trynna live the life in 3D\nSo you could nibble on my pee-pee\nWe out in Fiji\n\n[Hook]\nFrom having money on my mind to having money in my pocket\nBone marrow roasted\nSpread it on the rosemary bread, lightly toasted\nDrizzle with the vinaigrette\nStuffed Dutches and it's pulling like a cigarette\n\n[Verse 2]\nUntil I'm tan skinned, bitches saying that I'm handsome\n'Bout to be up on the screen like Ted Danson\nSuede loincloth, never fall off\nMr. Wonderful, Paul Orndorff\nLeather jacket, knee length\nPeace to people getting money in the 80's with the freebase\nFirst time, you get a free taste\nThat's the start of a career chase, I'm eating cheese plate\nSkirt steak shaved straight up off the diaphragm\nMuay Thai title fights out in Thailand\nI spit the fly shit, accompanied by fly bank\nUse the flows that have me diving up in thighs tan\nPurple rain, no Prince, summer solstice\nDope body, but her pussy's like an old fish\nThe antipasti is a cold dish\nYo, I'm focused, catch me out in London speaking Polish\n\n[Hook]", "title": "Tan Leather", "album": "Blue Chips", "image": "https://images.genius.com/7a3649262f7c86b3e60cd3e672699bb1.400x400x1.jpg", "year": "2012-03-12"}], "artist": "Action Bronson"}