{"artist": "Famous Dex", "songs": [{"year": "2018-01-01", "album": null, "image": "https://images.genius.com/a257a03f4e2e50206124ebd7182c626f.591x591x1.png", "lyrics": "[Intro]\nDexter\nRead about it (y'know what I'm sayin'?)\nTake a book out, take the dictionary out (ya dig?)\nDexter\nY'know what I'm sayin'?\nY'know what I'm sayin'? Leavin' a puddle everywhere, ya dig?\nYeah, leave that puddle, bitch, ha\nHad to leave a puddle, ooh, what?\nDexter, yeah, ooh, yeah\nI don't love the bitch (leave a puddle, what? Y'know what I'm sayin'?)\nHuh, ooh, what\nYeah, what\n\n[Chorus]\nI know she love me, but I don't love the bitch (but I don't love the bitch)\nGot diamonds on my chain (what), but I flood the wrist (had to flood the wrist)\nI'm in love with the money (what), I don't love the bitch (I don't love the bitch)\nThat lil' bitch said she hungry, grew up hungry bitch (I grew up hungry, bitch)\nThen I hopped in my Porsche, yeah I love the whip (skrrt, skrrt skrrt)\nAnd she love the whip (ooh, what?)\nShe can't ride in it (she can't ride in it, Dexter)\n\n[Verse]\nOoh, just bought a Bentley truck, she can't ride in it (ooh, what? Skrrt skrrt)\nBut she love the whip (she what?)\nSuck me in my whip, huh (yeah, Dexter)\nDiamonds on my wrist, you know I had to flood the shit (ooh, had to flood the shit)\nNever lackin' bitch, .30 extra clip, huh (what)\nWait, huh, what, took her on a date, sike (took her on a date, sike, what, yeah, huh)\nOoh, diamonds dancin' like Mike, huh (yeah)\nWearin' Off-White, huh\nFly as a kite, huh (fly as a kite)\nSo long cold ice, huh\nNo more drinkin' Sprite (no more drinkin' Sprite, bitch)\nYeah, fuck that bitch, I get her gone (then I get her gone)\nOoh, huh, yeah, she chokin' dancin' to my song (to my songs, yeah)\nHad to get her gone, huh (had to get her gone, yeah)\nPlease don't call my phone, huh (please don't call my phone)\nI don't wanna bone, huh (I don't wanna bone)\nBitch, I'm home alone, yeah (yeah, Dexter, what)\n\n[Chorus]\nI know she love me, but I don't love the bitch (I don't love the bitch)\nGot diamonds on my chain, but I flood the wrist (had to flood it)\nI'm in love with the money, I don't love the bitch, huh (y'know what I'm sayin'?)\nThat lil' bitch said she hungry, grew up hungry bitch (yeah, Dexter)\nThen I hopped in my Porsche, yeah I love the whip (skrrt, skrrt skrrt)\nAnd she love the whip (she what?)\nShe can't ride in it (she can't ride in it, huh, bitch)", "title": "I Don’t Love the Bitch"}]}