{"songs": [{"lyrics": "Afro (Afro) Afroman (Afroman)\nAfro (Afro) Afroman (Afroman)\nAfro (Afro) Afroman (Afroman)\nCan I sell my dope? (Yes ya can)\nLet me floss my flow, floss my ho\nRun my own campaign like I'm Ross Perot\nAs the turntables spin easily\nI reminisce on Easy-E\n\nWhen I first started bangin\nJheri curl started hangin\n9mm rangin\nIf you wasn't playin Cube, or Sir Too Short\nThe homeboys might grab you by your motherfuckin throat\nAnd choke yo ass, choke yo ass\nDrag you round the corner and try to smoke yo ass\nBut anyway\nI'd like to thank all my cluckheads that contributed\nMy rap tape just got distributed\n\nCan a get a quarter? (Quarter)\nFrom all the Mexicans down on the border (Border)\nI oughta get me a pound (Pound)\nEven if its on the wrong side of town\nIs you down?\nGet a gallon a water (Water)\nSo I can smoke a loopstick with ya daughter (I oughta)\nGet me a 40 (40)\nGet drunk befo I get to the party (Oh lawdy lawdy)\n\nI can't wait till I get my welfare check\nSo I put me a fat sack of yay on deck\nMake a run for the border in my blue Caprice\nAnd order me a quarter piece\nMafucka!\nEast side ruler known well cause I thump\nLet my system bump\nWhile I wait for the chump\nThey put the dope on the scale\nThis bomb ass yayo\nI know it's gonna sell\nBack in Palmdale\n\nI ain't afraid, it's time to get paid\nPass me the baggies and a razor blade\nLadie, dadie, I chop the rocks just like karate\nPunk ya better ask somebody\nStop bitching cause I'm able\nPut the dope on the kitchen table\nAnd watch me hook it up like cable\nWham! Bam! Baseheads like Goooooood damn!\nBuy yo dope from me!\n\nIf you a loner or a stoner\nMy rocks way bigger than them low budget niggas round the corner\nAnd they won't give you no love\nIf you don't buy a dime, dub, or above\nSo come to me when you need a fat nickle\nAnd you can hit the pipe in my stolen vehicle\nThey don't want yo pennies? That's alright, I want em\nI even take the pennies with the green spots on em\n\n\nFor the East Palmdaler being a dope seller is hard\nI accept your credit and your Versateller card\nAFDC, your food stamps too\nI'm a baller but bitch I gotta eat like you\nYou think I'm smokin, but I ain't jokin\nYou can get a fat rock for a gang of bus tokens\nHow you doin baby? I need a soulmate\nYour cuz told me you had Section 8\n\nI know you ain't got no money in your pouch\nTake a piece of this yay, and let me sleep on the couch\nBitch I'm for real, I'll go half on a bill\nYour garage just right for my Coupe de Ville\nTell your badass kids, them hoodrat bitches\nDon't be jumpin in my car and fuckin with my switches\nHip, hop, chop the rock\nLet the beat stop, it's time to re-cop\n\nWe can go to Compton, we can go to Watts\nWe can go to Long Beach I know a gang of dope spots\nI'm neutral, from the old school\nI be buying dope from a different gang of fools\nBuy my drip from my Crip, pound of bud from my Blood\nThen I buy some yay, from my ese\nOn my way back to Palmdale\nGot stopped by the sheriff but I'm calm as hell\n\nThey pulled out heat\nPut me face down in the street\nHandcuffed me, threw me in the back seat\nThey searched my car with a microscope\nStupid ass white boys couldn't find the dope\nThey took the handcuffs off but you know they still hate me\nRacial remarks just to intimidate me\nWrite a ticket since I can't go to jail\nWhatever they didn't find the yayo, uh!\nI don't Blood, I just Crip\nI don't tag I put the rocks in a Ziploc bag\nI'm lookin too shady, me and JD\nHit you with the .380\nSo gimme gimme what you got\nHangin at the dope spot\nTry to jack and get got\nFuck around and get shot (In the parking lot)\nBe cool, fool, don't be uptight\nMoney first, dope second, everything's alright\n\nI don't have the mentality of some fool in a gang\nIt's the principality of the whole thing\nIf you wanna get high, get high\nBut don't fuck around and die\nMafucka!\nI just wanna sell a rock, I don't wanna pull the Glock\nAnd lose the clientele on my block\nMad cause I shoulda been more selective\nHiding in the bushes from the homicide detective\nTrigger finger itchin on me\nAll my homeboys snitchin on me\nEverybody that's a friend of me lookin like the enemy\nNow I need to change my identity\nAfro mothafuckin m-a-n bucaaaaw!\nYeah! If you just bought this tape cuz you made the right choice mafuuucka", "title": "Basehead Boogie", "album": "Sell Your Dope", "image": "https://images.genius.com/0bbd138da6ed935df988e78c78275c51.364x368x1.jpg", "year": "2000-09-12"}], "artist": "Afroman"}