{"artist": "Wale", "songs": [{"title": "Cassius (Excellency)", "year": "2018-05-08", "lyrics": "[Intro: Muhammad Ali]\n(Incredible) Fast!\n(Incredible)\nAnd you, George Foreman\nAll of you chumps are gonna bow when I whoop him\nAll of ya!\nI know you got him, I know you got him picked\nBut the man's in trouble\nI'ma show YOU how GREAT I AM!\n\n[Verse 1]\nHold up! Black excellence, I be rappin' it differently, uh\nTell Howard Cosell I’m Howard Hughes with this rapping thing? (uh)\nUnderrated from Chocolate City with all the flavor\nMy bitches ball like I'm Q. McCall, they Sanaa Lathan\nBlack excellence, we depart from the negative, boy\nBlack denim that keep a knot like a pessimist, boy\nBlack niggas hate black niggas, that's evident so\nKeep black windows with masked niggas that never miss, boy\nCharles Manson to celebrate it, somebody save us\nDr. Sebi was really curing what people gave us\nI'm a beacon of what you become if you got passion\nI feel like Ali, but feel like I be with all the cash is\nNever could reach the masses\nLabel said I'm too deep and I told them people that's frownin'\nBlacks executed for movin' around\nAnd maybe I think too deep, but I think it be for this brown skin\nPro-black isn't anti-white\nBut how we act like we don't see no tiki torches at night, ya dig?\nPro-black isn't anti-white\nBut if a Nazi try me, catch these Ali hands on sight, ya dig? Dig\n\n[Interlude: Jimmy Jacobs]\nHe's young, he's handsome. He's a poet, a prophet\nAnd many people believe he'll be the next heavyweight champion of the world\n\n[Verse 2]\nUh, yeah, boy\nYeah, black excellence, a young perfectionist\nWhite America's fear is intelligent men with melanin\nUh, rap effortless, son of African immigrants\nEvery baguete is packed like I'm 'bout to \"psh, psh\" with anyone\nYou a field nigga, posing as real nigga\nAn Uncle Tom that can sorta rhyme so they deal with ya\nWith me, I see through it\nThe honorable Wale Folarin, Cassius, Muhammad, Sonny Liston you lil' niggas\nSay my name (Olu) now say my name (Olu)\nTell the ref to lift up my fist, Mr. Heyman, pay me my loot\nBlack excellence, uh, black Lexus that I\nNever drive it, ride me if you get the drift\nI'm the underdog, they don't talk about what I've done\nThe odds seven-to-one, the seventh bell, you'll be done\nI talk how I talk, I'm walking that walk\nCould never fight for a country that want me to fall, nah\nExiled for a short minute when Zyla was born\nI beef with her mama literally was throwin' me off\nBut I'm back, that's my word, if he back\nThen I be in the speedback, and go \"brrrrt\", yeah, a gat with the words\nBlack excellence, chocolate city, bitch\nI'm on the phone with Coon and Tak talkin' a milly, bitch\nJust a correctional, cut the message off really quick\nNo pressure, impressive, despite they effort, hit 'em again\nYou have a collect call from (Wale!)\nDouble M and DCR and I'ma rep my dog, yeah\nNah, y'all never catch my vibes\nI mean I write it, I really write it, I'm still southpaw\nAwkward, lefty, introvert, it's hard to get near me\nThat's why I'm in interviews high because I be highly defensive\nFor real, I'm black and I'm proud, no walkin' me down\nWe shockin' the world again, let me get to that album\nBruh\n\n[Outro: Muhammad Ali & Wale]\nI shook up the world!\nAnd I'm the greatest thing that ever lived!\nBlack excellence\nI'm king of the world! I upset Sonny Liston\nBlack excellence\nI must be the greatest\nBlack excellence\nI shook up the world!\nYou must listen to me, I am incredible!\nAlright, ladies and gentlemen\nLadies and gentleman, I must tell you this...\nSay my name, Olu (Olu, Olu)", "album": "Self Promotion - EP", "image": "https://images.genius.com/55e33e28cddf467b1bc875153cde6fdb.630x630x1.jpg"}]}