{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Fight", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Hook]\nFIGHT!\nHuh? Nigga who you talkin to? (YOU!)\nMe? Well bitch what you wanna do? (What you wanna do?)\nWhat's up then? What ever nigga, fuck these mics\n(Everybody come outside, King Gordys gonna fight!)\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\n\n[Verse 1]\nNot you just brought this ass whoopin on yourself, y'all\nRockin the shit outta his left jaw\nThis is my best brawl\nTrynna tear his head off\nWe in the slums beefin\nWalk in around in a circle than come to swingin\nNow his gums is bleedin\nNiggas breathin heavy\nAimin for his fuckin eyes trynna leave it swellin\nTwo niggas mean and sweaty\nAnd we gettin it on\nCombination of fists is thrown\nSwitchin blows\nTo hit up down at his toes\nMy shit is black and his blue. Puttin in ransom in moves\nHad him in a head lock, shit, even tackled him too\nI'm intending on winning, cause bitch I'm badder than you\nKickin flows while I'm fightin, bitch I'm still battlin you\nAnd I'll hit you with punch lines\nWell I'll punch his lights out\nAnd I suggest you not start\nTo try shit with this large\nNigga who got them braids stickin up. E, we will stick you up\nStated out as a battle, but ended with you gettin punched\n\n[Hook]\nHuh? Nigga who you talkin to? (YOU!)\nMe? Well bitch what you wanna do? (What you wanna do?)\nWhat's up then? What ever nigga, fuck these mics\n(Everybody come outside, King Gordys gonna fight!)\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\n\n[Verse 2]\n(Hey King Gordy, niggas off they better end fuckin with yo brother\nThey told him fuck you and your mother, I think they finna jump him.)\nWhat? Now we ten deep in the Monte Carlo\nFlyin up Van Dyke. Drivin faster than the car can go\nNow usually I don't do this\nI'm 23 - finna go fuck up some high school kids\nNow we in front of the gate. Oh what a wonderful day\nHopin right out just as my brother gets punched in the face\nOh, but the odds ain't even. Oh they fourteen deepn\nBut when my squad get to swingin the entourage started creeping\nLeaving they homies and they best friends to get they ass beat\nLaid off, out in the street\nAnd now it's down to one. Stomp the shit outta him\nDo not stop kickin him. Keep hittin him until the cops come\nI don't give a fuck. A victim to the streets or the microphone\nStudents, bitches, MCs, you'll all get fired on!\n\n[Hook]\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\nHit 'em\nKick 'em\nPunch 'em\nStomp 'em\n\n[Interlude]\nBitch... What's up then bitch? Bitch ass nigga. What? Bitch ass nigga\nBitch. Bitch. (Ohh) Bitch. Bitch. (Ohh... I'm gonna get my gun!)\n\n[Verse 3]\nOh since we wooped your ass you wanna get mad and grab the mag and blast?\nStop that, you ain't ready for combat\nThese hollows hotter than lava, she borrowin your binoculars\nKnockin you out your socks and your ass into a coffin, son\nYou don't want no hood beef, we ain't wit it\nShouldn'ta gave hard looks at me a mean grins\nBut you had to take it to that other\nNow your face is fucked up\nBustin 'Ks at your mother, put a gauge to your brother\nI ain't sympathetic; nigga fuck your homies, I ain't sweatin it\nI got turrets that will get them wet in less than 7 seconds\nYou don't need it from us\nYou should just be glad beef ain't from us\nBut you bringin beef, so what up? You and your peeps'll get fucked up\nYou'll get your crazy ass nuckled, go catch your brother\nGot bullets for each one of ya\nYour mother just had ya cousin\nThe only family man, blastin all of ya kin\nSmacked up all of ya friends, hell naw there ain't no end\nTHIS IS BEEF NIGGA!"}]}