{"artist": "Willie D", "songs": [{"year": "1992-09-15", "lyrics": "[Intro: Excerpt sampled from 'My Alibi']\nDie motherfuckers, die motherfuckers, die!\nDie motherfuckers, die motherfuckers, die!\nDie motherfuckers, die motherfuckers, die!\nDie motherfuckers, die motherfuckers, die! ---- Willie D\n\n[Verse One: Willie D]\nCause I'm sick of the weak-ass shit you've been saying\nI'm sick of the weak-ass shit you've been playing\nMake me wanna shoot my radio out\nBut I won't do such, because it costs too much\nBut I will do, is give you something brand new\nFor the DJ's, emcees and fans too\nSome say I'm not mobbing\nBut look around, count how many heads are bobbing\n\n[Chorus]\nDie motherfuckers, die motherfuckers, die! ---- Willie D\nAll I have in this world ---------- Al Pacino as Tony Montana\nDie motherfuckers, die motherfuckers, die! ---- Willie D\nAll I have in this world ---------- Al Pacino as Tony Montana\nDie motherfuckers, die motherfuckers, die! ---- Willie D\nAll I have in this world ---------- Al Pacino as Tony Montana\nDie motherfuckers, die motherfuckers, die! ---- Willie D\nAll I have in this world ---------- Al Pacino as Tony Montana\n\n[Verse Two: Willie D]\nI've heard your new song on the radio\nHated that shit, cause it sounded like a demo\nNow if you're so pro-black, punk bitch\nStop getting them white boys to mix your shit\nYou get a nigga like Crazy C\nAnd your shit won't sound so sloppy\nI know you hate what I said\nBut if you run up, I'll put a gun upside your fucking head\nCause homeboy, I don't love you\nYou get your mama, or somebody else to feel sorry for you\nPut your rhymes in a casket, dig a bed\nBury your heads, cause that shit's dead\nI needed something that was holding\nSo I've called New Orleans, and caught up with Rollin\nHe said he had a boy who can play the piano\nHis name was Gold Finger, so this ain't a sample\nBig Loc made the bass-line groove\nHe got paid, to sign with Stick-N-Move\nSo you better find some new ideas\nAnd stay the fuck away from here\n\n[Chorus]\n\n[Verse Three: Willie D]\nNow, tell your so-called super dope producers\nYou need to stop fucking with losers\nAnd get yourself some juice\nCall yourself a producer but ain't never produced\n(All I have in this world)\nSaw you stepping like a penguin; this ain't Ringling\nSo you and your crew, can suck a mean one\nOld School beats get ruined\nCause motherfuckers like you be putting weak-ass rhymes to 'em\nI can't help cause your bass don't boom\nYour drums don't kick, and your horns are out of tune\nMake a nigga just lose respect\nPush 'stop', 'eject', and snatch your shit out the tape deck\nCause your lyrics are way out\nYou should've stayed out, four tracks done played out\nYour production is booty, bro, save enough money\nSo you can work out of the studio, then practice on your vocals\nAnd stop acting like you're universal, when you're local\nSo take your whack-ass style, your whack-ass songs\nYour whack-ass girl, and take your whack-ass home\n\n[Chorus]\n[Interlude: Willie D]\nYeah, this goes out to all you wanna-be, ain't-never-gonna-be-shit\nRappers on a local scene acting like you're all that\nJealous-ass, ain't paid no motherfucking dues\nAin't sold no motherfucking records (All I have in this world)\nBut run around with T-Shirts with your name on 'em\nYeah, you whores don't try to be friend with a nigga\nCause that big shit will get your wig split\n\n[Excerpt sampled from the 1983 'Scarface' movie]\nAll I have in this world ---------- Al Pacino as Tony Montana\nAll I have in this world ---------- Al Pacino as Tony Montana\n\n[Chorus]\n[Excerpt sampled from 'My Alibi']\nDie motherfuckers, die motherfuckers, die!\nDie motherfuckers, die motherfuckers, die!\nDie motherfuckers, die motherfuckers, die! ---- Willie D\n\n[Outro: Overvoice]\nHeeeeyyyy! (four knocks on wall) Turn that shit down!", "image": "https://images.genius.com/99c31136e48907dfc450b10677d10058.400x397x1.jpg", "album": "I’m Goin’ Out Lika Soldier", "title": "Die"}]}