{"songs": [{"lyrics": "[Intro]\nI done been to jail for a lot of stupid shit\nAnd when you go to jail for a lot of stupid shit, you try not to go back\nAnd I...you know...I take precaution, you know\nHowever, sometimes you can take too much precaution\nTo the point where it gets - ridiculous. Haha, aww man\n\n[Verse 1]\nEach day at my dope spot\nI watch him as he passes by (Hey black, hey black who dat man, who dat?)\nI say to myself he looks like the FBI (Yeah)\nA white man like him (White man like him?)\nWhat is he doing over here? (You know what I'm sayin? I don't know)\nI wonder what does he want\nThen he asks me\n\"You got a light? You wanna help me smoke this blunt?\" (aww yeah)\n\n[Hook]\nIt was just my paranoia (hey hey hey)\nRunning away with me yeah\nIt was just my paranoia\nRunning away (aww yeah)\n\n[Verse 2]\nDown on my luck couldn't find no job\nI'd rather sell dope than rob, why squab?\nI know I can't do it forever\nSo uh, I'ma do it quick and clever (quick and clever)\nHowever, drinkin malt liquor, smokin endo (endo)\nTwo cops ran by my window (aww shit)\nIt's a raid (a raid?) - or that's what I assumed (yeah)\nI flushed two ounces in the bathroom\nI ran out the back before they could find me\nCome to find out, they raided the house behind me (You're trippin')\nYeah man, they ran through my backyard, hopped over the fence, anyway\n\n[Hook]\nIt was just my paranoia (hey hey hey)\nRunning away with me yeah\nIt was just my paranoia\nRunning away (aww yeah)\nFor real boy\n\n[Afroman talking]\nI'm tellin you man your paranoia can get to you man\nI remember man I used to trip on everything you know what I'm sayin\nI'd be chillin with them\nAnd we'd be goin off man\nHey, you know what I hate though (What's that man?)\n\n[Verse 3]\nI hate them late model cars doggonnit\nLook like bikes with all those antennaes on it\nParanoid I used to sell yell man\nTrippin on the telephone and the mailman\nTreat customers like compulsive liars (compulsive liars)\nRaise their shirt and check for wires (check for wires)\nI got a little money but I need a little more\nDamn somebody's knockin at my front door\nSome guy in a shirt and tie (shirt and tie)\nIs it Homicide or FBI? (FBI)\nDoes he have a warrant for Joseph Foreman? (Joseph Foreman)\nOh you're a Mormon\n\n[Hook]\nJust my paranoia (Come on in man)\nRunning away with me yeah\nIt was just my paranoia\nRunning away (aww yeah)\n\n[Afroman talking]\nHey man, you know where my paranoia really get me at man? (What's that?)\nWhen I'm walkin through the mall or shoppin man (Hell yeah)\nEverybody be lookin like undercovers, cause they be starin (Man you know)\nAnd I don't be knowin, you know what I'm sayin?\n\n[Verse 4]\nI hate sellin dope\nI think about stoppin\nUndercover cops follow me while I'm shoppin (damn)\nTrackin me with a hidden camera (hidden camera)\nPlottin to throw me back in the slammer\nThey think I don't see em, but yes I do (yes I do)\nThey some haters (haters), actin like they pickin tomatoes (pickin tomatoes)\nI'm ready for quick decisions (quick decisions)\nKeep 'em in my peri-fee-al vision (in my peri-fee-al vision)\nI see 'em in the airport, plain and clear\nStreet clothes with that little wire in their ear\nThey rush me, shake my hand\n\"I'm your biggest fan, sign this for me Afroman\"\n\n[Hook]\nJust my paranoia (hey hey hey)\nRunning away with me\nIt was just my paranoia\nRunning away\nIt was just my paranoia\nRunning away with me yeah\nIt was just my paranoia\nRunning away\n\n[Verse 5]\nYou know\nI wrote a hit song \"Because I Got High\" (high)\nSigned with Universal\nNow my bank account's dry\nUniversal records, yeah mon\nTook my money like Enron\nBroke and alone\nThings got hard\nHowever, it brought me close to God\nI changed my life and became a Christian, singer, rapper, and musician\nI've been high, I've been low, I've been rich, I've been po', I've been right, I've been wrong\nSince I been with God my paranoia's gone\n\n[Hook - Repeat until fade]\nNo more paranoia (hey hey hey)\nRunning away with me yeah\nI have no more paranoia\nRunning away (aww yeah)", "title": "Just My Paranoia", "album": "Afroholic: The Even Better Times", "image": "https://images.genius.com/c4fd850563348aed762e3d484ea76e19.500x500x1.jpg", "year": null}], "artist": "Afroman"}