{"songs": [{"year": null, "album": "It’s a Beautiful Thing", "image": "https://images.genius.com/a38241df710942558e84bde3f2e0774b.804x800x1.jpg", "title": "When I Rap", "lyrics": "Verse 1\n\nWhen I rap competition perform disappearing acts\nI jam suckers like Smuckers\nMy squad is funky like a six pack of motherfuckers\nWith conversation my creations will collide nations into confrontation\nCompetition couldn't stand a chance\nI'll wear you out like if I had one pair of pants\nMurray emphasizes cataract poetry meaning you blind bats can't see me\nThroughout my career I rip year to year successfully\nDragging debris in my vicinity\nMy symbol is the sickle like the Grim Reaper\nMy style is the greatest invention since the speaker\nA psychopath with a knife in my voice\nThe lyrical homicidal madman is top choice\nThe scene I scope it first because I'm homophobic\nAnd then I rope-a-dope it\nAnd dominate the cypher bloody red\nComing out my head leaving rappers brain dead\nI come through like POW! and BAM!\nReppin' like the lyrical version of Shazaam (Damn!....)\nWhen I rap\n\nChorus(2x)\n\n[L.L. Cool J sample] Watch your mouth better yet hold your tongue\n[DMX sample] Believe what I say!\n[Keith Murray] When I rap\n\nVerse 2\n\nWhen I rap, one hand can't clap\nSo lets squash the beef, cook it, and we all can get fat\nTry to swallow a line and you'll find\nI'm one hard act to follow wallow in my vibe\nSwallow and your throat will explode\nSending you through schizophrenic episodes\nMy style is so well off on it's own\nI leave it unattended and go see my dog about a bone\nWhen I'm the microphone ( When I rap )\nAnd biting niggas will leave it alone\nI go together with the rhythm like a sentence and some verbs\nAnd herbs so check out every word\nI kicked a verse for Father Time\nHe put the world on pause cause I fucked his head up with a rhyme\nDiamond studded rough and rugged fuck it\nThere's nothing left for you to do now but kick the bucket\nDummy who's ever flipping\nIt better be a round-off back hand-spring arabian summy\nWith more concentration then an acrobat\nWhen I rap\n\nChorus\n\nVerse 3\n\nWhen I kick the gift of gab and I'm grim and I'll be god damned\nIf any mortal or immortal man can withstand\nAnd not slam my jams cause I take them on a trip\nAnd flip the script with legit manuscripts\nFogging up the mic with real legit compounds\nMass mic Murray man flurries in the bound\nOh what the fuck you fall and can't get up when I erupt\nSo pass the buck cause you've been struck\nWith the will I learn will I burn\nOff carbon dioxide cause I'm on the flip side\nWord conducter emcee destructer\nMillions be saying \"That Murray's a motherfucker!\"\nI dip and dive punch you in your eye\nIn a battle if you try to lie in your rhymes when we socialize\nI'm beating Mother Nature down to her knees\nWhile making more papers than trees\nYou can't be serious that's impossible\nI leave niggas laid up in the hospital\nBandaged from head to toe and hat\nMy shit is intact when I rap\n\nChorus(4x)"}], "artist": "Keith Murray"}