{"songs": [{"album": null, "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg", "title": "Charades", "year": null, "lyrics": "I tried to give her everything she couldn’t handle\nI like her good…\nMaybe it’s me!\nI’m so cold, I think I can melt candles\nAnd while you’re sitting on the beach\nTrying to get a tan, I just pulled a tendon\nBoy, you’re so sexy, you think you got a mate\nYou smile when you like it away from me\nYou’re talking not two sides of your face\nBut I’m supposed to go, well I’m not OK!\n\nChorus:\nI’m so guarded, I’ve been hurt, see\nI’m so cold now, someone burned me\nYeah, I like you, I get you like me\nBut I can see\nYour charades\nI can see, I can see, I can see\nYour charades\nI can see, I can see, I can see\nOh, you got me guarded like an army grenade\nDon’t hurt me, I don’t have what it takes\nIf you wonder why I’m going your shade\nYour charades!\nI like.. like rubbers\nI like different kind of shapes, different swaggers\nOh, oh, but I can see beyond the face of a kiss\nOh, if something’s deeper I’m so …\n\nChorus:\nI’m so guarded, I’ve been hurt, see\nI’m so cold now, someone burned me\nYeah, I like you, I get you like me\nBut I can see\nYour charades\nI can see, I can see, I can see\nYour charades\nI can see, I can see, I can see\nOh, you got me guarded like an army grenade\nDon’t hurt me, I don’t have what it takes\nIf you wonder why I’m going your shade\nYour charades!\nCrossing the line is something that I wouldn’t do\nMe and your brother, we’ve been cool since back in middle school\nAnd now I’m thinking beautiful, two crosses on the spiritual\nI am counting dead presidents off in the living room\nFeeling you my Zeus, yeah they call me Deuce\nThey sure are for seducing, introduce you to my coop\nCoop, this is baby! Baby, this is Coop\nThose deals acting shady, I put them in the caboose\nThe end to the end, I’m talking me and you\nWho? Ain’t no I, I hit it for like an hour\nHit it like.. she won’t need a towel\nAnd she like I!\n\nChorus:\nBut I can see\nYour charades\nI can see, I can see, I can see\nYour charades\nI can see, I can see, I can see\nOh, you got me guarded like an army grenade\nDon’t hurt me, I don’t have what it takes\nIf you wonder why I’m going your shade\nYour charades!\nI can see your charades\nYeah, uh!"}], "artist": "2 Chainz"}