{"artist": "50 Cent", "songs": [{"album": "Animal Ambition: An Untamed Desire To Win", "image": "https://images.genius.com/6fd1cc830afad9164d3e46afab92be46.625x625x1.jpg", "title": "Hustler", "lyrics": "[Produced by Jake One]\n\n[Intro]\nDon't make this complicated (don't make it)\nMy old school candy painted (for real)\nI hustle hard\nWhen I come through they like \"Oh my God!\"\n(THAT NIGGA CLEAN!)\n\n[Chorus]\nFrom the beginning It Was Written I suppose\nI break a whole on the 36 oz - and move it\nI'm a hustler, baby (can you dig it?)\nI'm a hustler, baby (say what?)\nMy mind on the money, I ain't tripping on the hoes\nI blow a whole lot of paper on clothes, but dig it\nI'm a hustler, baby (can you dig it?)\nI'm a hustler, baby\n\n[Verse 1]\nYeah, I come through, I had the hoes like ''who he?''\nSeats in the old school Louie\nShoes and the belt buckle Louie\nWe don't need more details now, do we?\nLet 'em sag, my swag is True Religion\nYou gon' need Cartier frames to see my vision\nIt smells like cream mixed with weed, this is classy and hood\nDrama llama time, nigga, what's good?\nDomino's, muh'fucker, it's time to collect\nStack paper like I'm trying to fix the national debt (wooo!)\nI'm just doing what I wanna do, I trip through your set\nThis is 50 on that Muammar Gaddafi shit\n\n[Chorus]\nFrom the beginning It Was Written I suppose\nI break a whole on the 36 oz - and move it\nI'm a hustler, baby (can you dig it?)\nI'm a hustler, baby (say what?)\nMy mind on the money, I ain't tripping on the hoes\nI blow a whole lot of paper on clothes, but dig it\nI'm a hustler, baby (can you dig it?)\nI'm a hustler, baby\n\n[Verse 2]\nGet on my level, bitch, I'm careful who I kick it with\nWe talk market and distribution and politics (woo!)\nGot a chip on my shoulder, chip off the whole block\nI sell the chip of a whole rock, 10 dollars a pop\nI'm a magnet, the bitch can't help but watch me\nSocks, drawers, undershirt, Versace, Versace, Versace\nDesigner threads in every form of fashion (uh huh)\nI express myself so the question I'm askin' (aaoow!)\nIs this flip or the next flip tailor 50 shit?\nWe ain't promised tomorrow, nigga, go on and get the shit (yeah)\nThat skull and bones, that Alexander McQueen thing\nIn case you ain't notice it's a Queens thing (wooooo!)\n\n[Chorus]\nFrom the beginning It Was Written I suppose\nI break a whole on the 36 oz - and move it\nI'm a hustler, baby (can you dig it?)\nI'm a hustler, baby (say what?)\nMy mind on the money, I ain't tripping on the hoes\nI blow a whole lot of paper on clothes, but dig it\nI'm a hustler, baby (can you dig it?)\nI'm a hustler, baby\n\n[Outro]\nOHHH! It's cold out here\nIt's my kind of weather, I'm cold blooded\nIt's 50\nWhen I come through you see me\nIn the Suburbans that's bulletproof\nBomb proof, leather six, whatever\nWhen I go hard I go hard\nWhen I don't want you to see me I switch it up\nI'm in that black on black Porsche Panamera\nIn the back like ''ooh wee''\nWe rolling\nI hustle, man, it's what I do, man\nWait, niggas gon' try and tell me how to do this?", "year": "2014-04-15"}]}