{"artist": "6LACK", "songs": [{"album": "East Atlanta Love Letter", "title": "Switch", "lyrics": "[Verse 1: 6LACK & Ty Dolla $ign]\nI'm thinking 'bout a Yamaha (ayy)\nI'm thinking 'bout a Yamaha\nTo get away from all the cameras\nI'm over it, don't wanna fantasize\nFate is 'round the corner, right (Fate is 'round the corner right)\nIt hit me right between the eyes (Hit me right between the eyes)\nIt's funny when they switch and pick a side\nAin't nobody gotta go through what I'm going through, no\nBut it seems like they all know what I'm supposed to do so\nLet's switch bodies for a day\nYou could me be and I could be you\nJuggle the pile of shit that's bound to come through\nYou can have it since it's automatic\n\n[Chorus: 6LACK & Ty Dolla $ign]\nNow switch (switch)\nTell me how it feels (feels)\nTo be somebody else (else)\nNow switch (switch)\nIt wasn't what you thought it was (was)\nAnother story to tell\n\n[Post-Chorus: 6LACK]\nWell, well\nWell, well, well, well\nWell, well, well, well\nWell, well\nWell, well, well\nWell, well, well, well\nWell, well\n\n[Verse 2: 6LACK]\n“So tell me lies, tell me lies, tell me lies\nYou and I ride or die, you and I\nEntertain these other bitches and I will not\nEntertain these other niggas, you know that\nIf I give you my heart, would you hold that?\nWould you put it up safe or would you fold that?\nIf I find out you cheating me, just know that\nI'ma kill you and that ho, ain't no going back”\nThat's what she told me, and how could I blame her?\nA small town girl, now she all famous (switch)\nMaybe it's my fault now, ain't like I've been livin' in the dark nah\nI told you everything from the start\nAnd you the one that had a change of heart\nGirl, you can have it after all the damage\n\n[Chorus: 6LACK & Ty Dolla $ign]\nNow switch (switch)\nTell me how it feels (feels)\nTo be somebody else (else)\nNow switch (switch)\nIt wasn't what you thought it was (was)\nAnother story to tell\n\n[Post-Chorus: 6LACK]\nWell, well\nWell, well, well, well\nWell, well, well, well\nWell, well\nWell, well, well\nWell, well, well, well\nWell, well\n\n[Outro: 6LACK]\nI'm thinking I should speed it up\nTo get away from all the media\nI'm human, don't you think I had enough?\nMy woman claiming that I switched on her\nOnly 'cause I hit a switch on her\nShe wasn't really good at keeping up", "year": "2018-06-22", "image": "https://images.genius.com/d42cef7226d06edb012fc820009b16aa.1000x1000x1.jpg"}]}