{"artist": "Immortal Technique", "songs": [{"title": "The Getaway", "lyrics": "[Intro: Immortal Technique + Friend]\n— Yo, yo, son, give me that newspaper!\n— Yeah, aight, here you go!\n— Man, I hate this one, yo. You know, the post is always on some bias racist bullshit, man. Word, I mean, on The Daily News…\n— (Laughs) Word, I feel you…\n— They ridiculous, man. Times are better, but they still on some bullshit!\n— (Laughs) I know that, man. (Hiss)\n— Another nigga killed by these fucking cops, yo!\n— What? Word? Psh…\n— See, that's why I gotta get the fuck outta here, man. I need some peace. I need something like that or I'ma just start blastin' these fucking pigs, man!\n— I feel you, son. (laughs)\n— For real, yo!\n— Yo, son, fuck it then. Let's do somethin', man, let's see some mamis out there!\n— You know what? Matter of fact, pack the bags…\n— Aight then!\n— Start the fucking whip up! I'm outta here, yo, for real!\n\n[Verse: Immortal Technique]\nYo, I hate my job, so I always look to a better day\nFar from New York City on a tropical getaway\nBut not in Miami\n‘Cause these white Cuban anti-Castro's can't stand me\nAnd that's the reason I'll never win a fixed up Latin Grammy\nAfter this racist Latinos'll goddamn me\nBut my black people love me\nAnd when I go to South America, people be tryna hug me\n‘Cause I talk about reality that effects them\nAnd even though I blew up I could never neglect them\nWhat kind of a revolutionary action would that be?\nI be categorizing practically every other MC\nBut never that, ‘cause I'm clever with facts, sever your raps\nFake players and thugs will forever be whack\nI'm still rollin' with my squadron heavily strapped\nAnd even if I get killed I'll inevitably be back\nEncyclopedia Hispanica over digital dat\nDon't ever compare me with small-minded criminal cats\nI kill kids on tracks, like Dale Earnhardt\nSpit in your face and leave your cheekbone with a burn mark\nI was born a genius, but I learned to be street smart\nMy vacation just started, I'm out to the Caribbean\nSwimmin' in Dominican women the color of cinnamon\nYou mothafuckers wish you had the lifestyle I'm livin' in\n\n[Hook: Immortal Technique]\nEast Coast to West Coast and everything in between\nThis is dedicated to everybody chasing their dreams\nThis ghetto fabulous life really ain't what it seems\nBut I'ma make it, ‘cause I got survival stuck in my genes\n\n[Outro: Immortal Technique]\nWord up (Word!) Immoral Technique\nRepresenting Harlem\nAll the way out to my fam, in Englewood\nI'm out, mothafucker! (Laughs the ghetto way, nigga!)", "image": "https://images.genius.com/9c9631e16897ed9bc090afd0a05da5ae.1000x974x1.jpg", "album": "Revolutionary Vol. 1", "year": "2001-09-18"}]}