{"artist": "C-Rayz Walz", "songs": [{"title": "Stupid Def", "album": "The Prelude", "year": "1999-12-31", "image": "https://images.genius.com/ec963359d22a35a29c442701ff7a7d34.500x500x1.jpg", "lyrics": "[Intro: Poison Pen and (C-Rayz Walz)]\nFresh, y’all (Fresh, y’all)\nAll y’all (Yes, y’all)\nTo the top (Yes, y’all)\n‘Til we out of breath, y’all\nRight, y’all (Left, y’all)\nFunky funk (Fresh, y’all)\nEast, y’all (West, y’all)\n[?] to the death, y’all\n\n[Verse 1: Percee P]\nWe’re now in your auditory canal.  I’m a stereo sound\nTry to get with the P and this’ll be burial ground\nI entice and charge the largest price\nTo rock pockets of [?] [the fact that I’m that nice?]\nLiable to take your title with my vital rap recital\nAnd this epitome—consider me the idol\nFrom the Bronx—the shit.  my response is quick\nIf you diss me or piss me off, I’mma stomp your dick\nStrictly poetical, dope knows a rope from a [?]\nQuoted and [?].  Folks catching the vapors is the result\nLeaking words from ink pens, leave you thinking\nGotta rewind every line from a rhyme, find a distinct [?]\nPerc’ is cold-chilling—my shows is so thrilling\nMy flow is the fourth villain—I’m [?] killing\nFor every hottie jocking me in every party\nI’ll pull some bags.  Never [?], but [sticking?] everybody\nLyrical chef—adversaries are left\nDying, crying by horrifying—the case is the faces of death\nThe P is uno.  You know?  Number O-N-E\n‘Cause I know and he know and she know and we know the [?] emcees\nThat can touch the P or fuck with me, but luckily [?]\n\n[Verse 2: Poison Pen]\nYo, it’s like, “Yes, yes, y’all,” to the beat.  [All?]\nKeep on in the dance in my b-boy stance\nPoison Pen.  I’ll smack you to friend\nNow you look like Siamese twins—looking at [?] like, “Where they find these kids?”\nMy voice make anything I chant to an anthem\nPut on your rap [caps?], leave the floor, start discussing weather\nStrictly rewind material—repeat mine\nLet’s take it outside—I’ll beat you ass with a street sign\nSee my [?] from your plaque and make [?], kid (Fuck you doing here?)\n[?] something\nReversed into creation, fornication—yo, you feeling [?]\nCelebrating living, but when the corks fly, you could lose an eye\nPoison Pen and they rock Bed-Stuy\n\n[Verse 3: C-Rayz Walz and (Poison Pen)]\nOf course I’m fresh (Of course I’m fly)\nLike planes on the ground (Take off to the sky)\nSome people know (Others ask, “Why?”)\nAll the shorties follow us like the ice cream guy\nLike the ice cream guy (like the ice cream guy?)\nLike the ice cream guy (like the ice cream guy?)\nLike the ice, like the ice, like the ice cream guy\nThis is hip for real [?]\n‘Cause I’m strong like the Donkey Kong  gorilla\nMake a mill at the most.  Iller styles that top  [Dilla?]\nWho shot squealers.  You [cross?] [?] like Glock dealers\nMad colorful, but I’m true precision\nMy right hook’ll make you see the world in Kool-G-vision\nWile loud like the locks on Goonie missions\nThis flick shit got you slipping like, “Yo, my booty dripping”\nFact or fiction: you still play the back like Pippen\nYou should [acrobatics?] tight on mics—you ain’t flipping\nStart dipping.  Jet, get your mittens, little kitten\nRun—the MCs I battle be missing\nI say, “Damn!”  Still repping the peeps\nI straight BLAM!  My best weapon’s the beat\nYo, you stepping to C?  I’m collecting your fee\nLet’s swing an episode of speech backseat of my Jeep\nIn the street, Casio, or MPC\nMy technique through audio or MP3\nMy [?] clip yelling, “Empty me!” (“Empty me!”)\nPutting heads to bed.  Putting heads to rest now\nI write down screenplays for my [?]\n\n[Verse 4: L.I.F.E. Long]\nI rhyme in black fitted-out sets while\nShadowboxing with the silhouette of death gasping for breath\nTryna find the light [?] of darkness\nMy world parallel to hell where fools dwell with the same stories to tell\nEverybody wants they record to sell\nBut I’d rather excel than spit nothing over recycled [?]\nToo many get caught up in the same money scheme, which makes you wonder, “How many damn ways [?]”\nTalking queen but holding [?]—that’s why I’m issuing out waitlists for the rent\nCracking your chin, leaving you with a permanent cleft\n\n[Verse 5: Orko the Sycotik Alien]\nMy broken English of a beat-breaks underground overlord\nUnemotional, unattached with an unorthodox angle\nWalk with an angel of death.  My breath control like Storm, the mutant X-Man\nI don’t assimilate, so don’t associate my name with weakness in the chain—that don’t fit\nFunny how MCs that wanna freestyle all night long\nDon’t got enough composure and focus to write a dope song\nI’d rather sock your mouth than say a dope line\nNo metaphors or similes—victory is mine"}]}