{"artist": "Knoc-turn’al", "songs": [{"image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg", "title": "Muzik", "year": "2002-01-01", "album": "L.A. Confidential Presents... Knoc-turn’al", "lyrics": "[Samuel Christian]\nYou ready?\n\n[Knoc-Turn'al]\nYes, ha ha ha\nYeah, yeah\nLet's go, L.A.C\n\n[Knoc-Turn'al]\nMy music, my life, my heart, my soul\nMy music, my everything, I give my all\nMy wife, my daughter, my love, my dream\nMy mother, my father, my brother, my team\nMy camp, my squad, my house, my car\nMy boat, my shoes, my pants, my shirt\nMy coke, my sugar, my cream, my butter\nMy toast, my all, my queen, my folks\n\n[Hook: Samuel Christian]\nMy baby! Walk like six strings\nTalk like she's my everything\nMy baby! Loves me, hates me\nLeaves me, runs right back\nThat sexy lady! All I know\nShe shares all my confusion, so\nMy baby! Will not want for an-y-thing\nI swear this though\n\n[Knoc-Turn'al talking]\nNow I lay me down to sleep\nI pray the Lord, my soul to keep\nIf Muzik should die before I wake\nI pray the Lord, my soul to take\n\n[Knoc-Turn'al]\nShe's thick, she's bad, so clean, she's fine\nShe loves, she hates, she laughs, she cries\nShe hurts, she lies, she's Bonnie, I'm Clyde\nShe's ghetto, she's real, she sings, she rhymes\nShe comes, she goes, she lives, she dies\nShe sexy and bomb, she blows my mind\nShe stays in line, she's smart, she's funny\nShe's crafty and cunning, in the game she's running\nHer lips, her back, her waist, her thighs\nHer face, her skin, her hair, her eyes\nHer voice, her shape, her hips, her mind\nHer love, her smile, her touch, her time\n\n[Hook]\n\n[Knoc-Turn'al]\nI'm tipsy, I'm through, I'm drunk, I'm blunted\nMy way, my day, my life - I love it\nI move, I groove, I shake, I love it\nMy friends, my kins, I like, I love it\nI show, I prove, I live, I learn\nI show, I teach, I run these streets\nMy kin, my heart, my heat, my rhythm\nMy rap, my beat, my life, my head and my feet\nMy heart, my soul, my candy, my cake\nMy platinum, my gold, my land, my gate\nMy Benz, my lake\nMy keys, my money, my love, my hate\nMy clothes, my phone, my house, my home\nMy money, my comb, my sugar, my spice\nMy base, my chrome\nMy rhythm, my music, my home\nMy world, my girl, my life, my home, my...\n\n[Hook] - repeat until fade"}]}