{"songs": [{"lyrics": "[Intro: Jay-Z]\nRoc-A-Fella.. y'all know what this is\nWe givin' y'all five seconds to put your drink down\nAnd report to the dance floor immediately\nAll the busters we givin' y'all five seconds to get close to a exit\nIt's about to get real ugly in here\nFive seconds is up - let's go!\n(Throw the hands up) uh, uh, uh\n(Throw the hands up) niggas\n(Throw the hands up) bitches\n(Throw the hands up) busters\n(Throw the hands up) hustlers\n(Throw the hands up) hoes!\n(Throw the hands up) boasters\n(Throw the hands up) MAC\n\n[Verse 1: Beanie Sigel]\nYou know how Mac come through on the club tip\nE'rybody real deep on that thug shit\nCop Cris' spray the club on that thug shit\nCop frisks suits snub in the club quick\nTold y'all real high, when I come you can try\nIf you want, you can die, if you want to\nWe hittin' whores on the floor, whole crew be wild\nBitch back that ass up like Juvenile (huh)\nWhen my peeps come to spend, a dime apiece\nYou know Mac come through with a line of freaks\nEvery bitch on the hip be a 9 at least\nWe gettin' head on the floor, while you grindin' freaks\nWhole squad get it down like this\nWhole squad buyin' rounds of Cris'\nWhole squad got they crowns on wrist\nWhole squad got a pound to twist\nWhole squad got a pound to spit, in case a clown wanna flip\nMac never slip in the club\nTold y'all niggas four-fifth in the club\nIf a nigga wanna draw then the blood it can drip in the club\nYou know how niggas get in the club\nShit you know how I be, all high in V.I.P\nRollin' up to B.I.G. (baby-baby)\nNiggas be all liquored up, talkin' shit\n'Til they man gotta come and pick 'em up\nGot bitches in the back bouncin' to \"Jigga What\"\nYou got your hands up and I ain't even stick y'all up\n\n[Break: Jay-Z]\nE'rybody get it up (Throw the hands up)\nE'rybody get it up (Throw the hands up)\n\n[Chorus: Jay-Z (Amil)]\n12 AM on the way to the club (uh)\n1 AM DJ made it erupt (uh-huh)\n2 AM now I'm gettin' with her (what up?)\n3 AM now I'm splittin' with her (splittin' with who?)\n4 AM at the waffle house (waffle house)\n5 AM now we at my house (uh)\n6 AM I be diggin' her out (who?)\n6:15 I be kickin' her out (what?)\n7 AM I'ma call my friends (uh-huh)\n12AM we gon' do it again\nWe gon', we gon', we gon' do it again\n(We gon' do it again)\n\n[Verse 2: Jay-Z]\nBy the way, yo..\nHow the fuck you gon' talk about MC's on our heel?\nWhen we just cop them things homie, the chromey wheels\nBoth arms are chunky, the sleeves on chill\nAny given times a hundred G's in your grill\nDon't talk to me 'bout MC's got skills\n\"He's alright, but he's not real\"\nJay-Z's that deal, with Sigs in the field\nLove affair for war, hug, squeeze that steel\nFuck, you got a flow, that's cool with me\nYou got a little dough, that's cool with me\nYou got a little cars, little jewelries\nBut none of y'all muh'fuckers could fool with me\nYou know the wrist frostbit minus two degrees\n'Bout as blue as the sea, the way I maneuver the V\nHat cocked can't see his eyes, who could it be?\nWith that new blue Yankee on, who but me?\nNiggas shipped two million, then I blew to three\nThen I skated to four, 'fore I went on tour\nI came back and it's plain, y'all niggas ain't rappin' the same\nFuck the flow, y'all jackin' our slang\nI seen the same shit happen to Kane\nThree cuts in your eyebrows tryin' to wild out\nThe game is ours, we'll never foul out\nY'all just better hope we gracefully bow out\nThrow yo' hands up - niggas, bitches, busters\nHustlers, fuck that! (Throw the hands up), c'mon\n\n[Chorus: Amil (Jay-Z)]\n12 AM on the way to the club (uh huh)\n1 AM bout to shake the butt (uh)\n2 AM now I'm checkin' the mix (ah yeah)\n3 AM now he buyin' me drinks (what you drinkin' on?)\n4 AM exit the club (let's go)\n5 AM think he gettin' some butt (that's right)\n6 AM nigga still ain't bust (what?)\n6:15 nigga will get up (uh)\n7 AM gotta tell my friends (uh-huh)\n12 AM I'ma do it again, uh, uh\nI'ma do it again\n12 AM I'ma do it again\n(Uh-huh, uh, uh.. let's go)\n\n[Chorus: Jay-Z]\n12 AM on the way to the club\n1 AM DJ made it a rub\n2 AM now I'm gettin' with her\n3 AM now I'm splittin' with her\n4 AM at the waffle house\n5 AM now we at my house\n6 AM I be diggin' her out\n6:15 I be kickin' her out\n7 AM I'ma call my friends\n12 AM we gon' do it again\nWe gon', we gon', we gon' do it again\nLet's go", "title": "Do It Again (Put Ya Hands Up)", "image": "https://images.genius.com/6735787de782ffa00266cca96985242d.240x210x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}