{"songs": [{"title": "Parents Still Don’t Understand (Interlude)", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "DAVE: Oh, man\nJEAN: Got so much to do. Huh, honey?\nDAVE: Yes, definitely. I just I feel like I...\nSTEWART: Well, look, again, if you need mom to come out there for a week...\nDAVE: I don't think it's a case of needing, like, mothering\nSTEWART: No, no, not mothering. Organizing. Or doing, doing tasks\nJEAN: Tasks, right\nDAVE: It's not that, I mean...\nSTEWART: Getting your plane tickets...\nDAVE: That's like, that's not...\nSTEWART: Making sure that your clothes are, are, things that, no, just organization. Not mothering\nDAVE: I don't, I don't have to worry about that. Like, people handle that stuff\nSTEWART: Okay\n\nSTEWART: So how are you gonna get strippers in Boston and New York and Philadelphia...\nJEAN: The question is whether the clubs will allow it\nDAVE: Uh, I probably only would get strippers for Philadelphia\nJEAN: Well, you're breaking up again\nDAVE: I said, I probably would only get strippers for Philadelphia\nSTEWART: But, but, a practical question in organization is, do they allow it?\nDAVE: Yeah...\nSTEWART: Someone could research that for you. That's another detail\nDAVE: Yeah, why don't you take care of that detail for me? Figure out what venues allow strippers. Is that something you guys could handle or no?\nJEAN: No. 'Cause I don't know what venues... You would have to ask William Morris or whoever's, you know, booking this stuff to find out for you. We can't find that out\nDAVE: Well, if like I give you, if I give you the venue name and number, you guys could call\nJEAN: (Talking to Stewart) You could do that\nSTEWART: I, yeah, I'll call...\nDAVE: I'm kidding, I'm not gonna have you guys call a concert venue and have you guys ask if you could, if your son could have strippers at his show, that's ridiculous. I don't need you guys to do that\nJEAN: Right\nDAVE: Of course. I can't believe you guys fell for that\nSTEWART: Well, what do you want us to do?\nDAVE: Nothing! Nothing, I'm joking around. I can't believe you're even entertaining this as like a thing that you would do"}], "artist": "Lil Dicky"}