{"artist": "The Game", "songs": [{"title": "Bitch, Don’t Kill My Vibe (Remix)", "album": null, "year": "2013-05-07", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg", "lyrics": "[Verse 1: Game]\nBitch don't kill my vibe, nigga don't blow my high\nWake up in a Bugatti but I'm in a Maserati when I'm on the 405\nI'm king of the motherfuckin' Westside\nTwo dubs up when the TEKs fly (Bla! Bla! Bla! Bla! Bla! Bla! Bla! Bla!)\nTurn a 600 to an S5\nCompton made me direct this ending\nLike my little nigga Kendrick, and props to Jay-Z\nGot a Rocky pendant and a drop Mercedes\nI'll be gone 'til November but I'm not from Haiti\nI'm a C-O-M-P-T-O-N, N-I, double G-A\nLike a young D-Wade, brought my city a championship by myself\nAnd niggas think I'm doin' this shit for my health\nI am, don't make me go HAM, 4-5\nGo blam, I was just protecting my wealth\nMatte black Bentley, all-black pennies\nBlack Tom Ford shades, I'm 'bout to go stealth\nAll black everything\nTrap Wesley Snipes inside Tiffany's wedding ring\nNigga, never get out\nI'm constipated, just tryna get my shit out\nFalse alarm, I can't do number two\nPee on you peons for eons and eons\nUsed to intercept niggas, rock like Deion\nSellin' white packs out my grandmama's Neon\nAsk my nigga Breon\nI played Pac's brother in this classic movie\nNo relationship to Leon\nWhen I spit for Dre I had a nigga forehead like a nigga was a klingon\nNo album out, I'm on 106 like a nigga put Free on\nAny beat that I breathe on or be on, I be gone\nI brawl like I'm out in Maryland, Georgetown, Michigan\nFlorida, watch a nigga get his UNC on\nBaby Jordans for my baby daughter\nNo Harold Miner, can I get my USC on?\nEight cars in my driveway, sideways\nHorsepower make the Lamborghini fly away\nI am the shit when I step out the Six\nAnd I step at your bitch in my brand new kicks\nEh-eh you bitch, don't act brand new\nCause you suck on my dick when you walk in my crib\nAirplane mode, won't be no duck lips next to Van Gogh\nDance with the devil, I learned to tango\nS on the metal, I wrapped the Range Rove\nRide to my limits inside the Infinite\nGod is my witness, I've got the roof in it\nDesigned to go win it\nMismatched rims on the motherfuckin' Phantom\nNigga, nigga on God, I'mma spend it\nCompton, Westside, and I'm riding with Kendrick\n\n[Outro: Kendrick]\nI am a sinner who's probably gonna sin again\nLord forgive me, Lord forgive me\nThings I don't understand\nSometimes I need to be alone\nBitch don't kill my vibe, bitch don't kill my vibe\nI can feel your energy from two planets away\nI got my drink, I got my music\nI would share it but today I'm yelling\nBitch don't kill my vibe, bitch don't kill my vibe\nBitch don't kill my vibe, bitch don't kill my vibe\nYou ain't heard a chorus like this in a long time\nDon't you see that long line"}]}