{"songs": [{"image": "https://images.genius.com/d878e54b6766255010da413481db1471.1000x990x1.jpg", "title": "Freedom", "album": "Til the Casket Drops", "year": "2010-01-19", "lyrics": "[Verse 1: Pusha T]\nWith every line written, and all I have given\nMusic’s been nothing more than a self-made prison\nI’ve taken inmate losses at the hands of this one\nMy pen’s been the poison to family and friendships\nNow it’s time to mend shit, time to bring closure to\nThe clear conscience of Pusha is long overdue\nThinking to myself what can I be owing you?\nThey only tell you you great when they're reminiscing over you\nBefore I Trouble T-Roy, it’s just a d-boy\nLet me play the role of a Common on his b-boy\nSpeaking my truth in rhyme, no matter how bland it is\nA heavy heart lightened, that’s just what my ransom is\nAll apologies, I bear the cross, I wear the blame\nWe in the same group but I don’t share my brother’s pain\nNot to confuse, our sentiments are all the same\nI just don’t feel nothing, I’m numbed by the will to gain\nSame thing brought tears to innocents\nI turned away and didn’t even flinch, yuugh!\nThe music drove me crazy looked up and lost the first bitch\nI ever wanted to have my babies\nNowadays she can’t even face me, I’m sorry for the heartbreak\nI promised you forever my lady, Jodeci baby\nPompous motherfucker, just look what them jewels made me\nI’m only finding comfort in knowing you can’t replace me\nWhat a thing to say, but what am I to do\nI’m role-playing a conscious nigga and true is true\nCocaine aside, all of the bloggers behooved\nMy critics finally have a verse of mine to jerk off to\nI own you all\n\n[Verse 2: Malice]\nThis is where the buck stop, here's where I draw the line\nI touch the hem, God's work is so divine\nI've seen the error of my ways over time\nNever to return, Malicious has been refined\nLike wine, with time I get better\nNapa Valley vintage, my flow is fermented\nNow drink of me, as if I bought the bar\nRun to these words, as if there's no tomorrow\nNever mind my car, careful what you wish for\nBehind every curtain the devil and his pitchfork\nJealousy, I ask thee: What is this for?\nHow was I to know I was happy being piss-poor?\nNo, whore, that's not love, we was fucking\nI was in search of a chickenhead, you was clucking\nAnd I was lusting, we were both out of order\nI should've known better as I'm reminded of my daughter\nAm I my brother's keeper or for himself every man?\nI have been your reaper, there's blood on my hands\nAccept me as your keeper, there's been a change of plans\nCareful what you speak of, I've come to understand, preach\n\n[Outro: Pusha T]\nWhat else you want from us, huh?!\nWhat more can you ask?\nWe've given you everything\nWe lost life, we lost love\nWe lost family behind this shit\nThis shit you call music, we call this shit life\nWe gave you proof, they ain't give you shit!\nWe gave you truth\nDo I entertain you motherfucka?!\nWell dance then bitch!\n\nTil' the casket drop\nTil' the casket drop\nTil' the casket drop\nTil' the casket drop\nTil' the casket drop\nTil' the casket drop\nTil' the casket drop\nTil' the lord say stop"}], "artist": "Clipse"}