{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Verse 1: Godfather]\nIt was all a dream, I used to watch Big on the screen\nAnd write rhymes puffing the green, now why me?\nNow it's like steam, who got it? That's who gon' get it\nEither with the clips or the snitches\nSpade razor style, shit was so suspicious\nThat's why I get with the kid, sorta vicious\nJust on some rap shit, I'm on stitches\nAnd that means I'm not in the mood to score bitches\nAnd cut 'em from the pack when they fucking up the stack\nIn fact, right now I'm like ''fuck 'em'' on the track\nIt wasn't all that, the whole nine\nThat's how I hold mine to add the fuck on to this gold mine\nRappers get a cold nine or ten 'til they never rhyme again\nAnd it's a matter of time 'til I send this death threat lyrically\nBut remember, you really didn't hear it from me\nMans to be, no one\nI'm the last nigga alive to show them\nPrecisely how a flow done\nAll done, from way back, I can say that\nI been here laying this shit since the payback\n\n[Hook: Godfather]\nWhen they call me it's just for demolition strictly\nI'm the guy to get, the guy who spit sickly\nForget me, what about y'all? Rented stars\nSpitting wack bars like you hard, linen God\nI'm not much mentioning y'all when I'm in charge\nPlus I can charge when I want like the gods\nCock niggas who rhyme, watch niggas who shine\nJust put the hot in your chest like a few lines\n\n[Verse 2: R.A. The Rugged Man]\nAyo, shit is realistic, anarchy, punk rock style\nCall me ''shit vicious'', ignorant shit, I dig that shit\nGoing stupid, special ED student\nTo this industry I'm a nuisance\nThe dirtiest, we go through with Long Island thug kids\nDon't know how to act\nWhite boys that think they're black\nWe sneaking up behind you, watch out\nYou can hear the music in the background\nWhen we 'bout to pop out we in the vehicle\nHop out with the crowbar, oh pa\nOld school, snatch you out your car\nWe drive up the block to the spot where the hoes are\nPick up my little brother, Johnny Omar\nWe care about shit still, Rugged Man, still hated\nMr. Kubrick, say my name, bitch\nY'all know what my name is, The R. Rugged A\nThe Godfather Don in he motherfucker\n\n[Hook]\n\n[Verse 3: Prince Po]\nI got a pitbull attitude, a pitbull bite\nShit, full of fire like that ass right\nShine without a flashlight, getting my cash right\nDon, remember last night?\nNiggas tried to rob us, dropped the glass pipe\nBlow, Prince keeps his gats tight, niggas is strife\nShit on their own, they won't contribute to their own fast life\nFor real, nigga, shit been hectic\nI only make moves that proves to be effective\nStash tight for close ones who decide to fake jacks\nTrust the loyalty, older than 8 tracks\nA soldier that'll break backs\nNot entirely surely, easier than most speed\nPull on some more weed\nHigh enough to see you shook from all the snitching\nA small time crook who met with cops in the kitchen\nAs the plot starts to thicken we treat lower\nEven my girl bust a nine, I had to show her\n\n[Hook]", "title": "The Hardway", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}