{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/8aaa0a119c995f68c57360a1c18d583a.600x600x1.jpg", "title": "Integrity (feat. Bonafide of GRITS)", "year": null, "album": "7th Avenue ", "lyrics": "[Intro]\nYo, yo what's up yo?\nYo, what's up man?\nYo, y'all are GRITS right?-yeah man\nYo, I-I want to get into this gospel rap thing man\nAw, sh man it's a task\nYo I was just wonderin' if I could give you this rhyme I wrote\nGo ahead man, I ain't hatin'. Go ahead yo\n\n[Verse 1: KJ-52]\nIt's all about me, me, and did I mention me\nI'm the dopest rapper in the gospel rap industry\nI kill more white rappers than snipers\nI'm the one they call to get the crowd hyper\nYo, all y'all cats need to retire\nWith your played out raps, I'm the roughest and toughest\nI love the spotlight yo you better make sure this mike sounds right\nOr I'll charge you double on this honorarium\nDon't ask me to speak words of encouragement cause yo I got the dopest skills\nDon't ask me to do what God wills\nIt's all about keepin' it real and makin' sure I get me a fat type of record deal\nGive the crowd something they can feel\nToss God a bone every once in a while, have a Coke and a smile\nYo, I been doin' this a long while, man, like two months even\nSo what if I look like a heathen, I can still kill the ruckus demon\nI got all the girls fiendin' , I put emcee back into emceeing\nYo God and hip-hop versus the god of hip-hop I believe in\nI'm acheivin' what I want. These skills is what I flaunt\nYo you caint get me so tell me what you got\nMan, I live and die for the god of hip-hop, I mean God and hip-hop\nSo y'all fools need to stop\n\n[Hook: Bonafide]\nThis is a message to you rap infants\nShowin' faces in the places where we blessin' at\nTryin' to battle, got respect for your skills but skill alone dont get you props\nIt takes integrity, when rappin' for Christ on microphones\n\n[Verse 2: Bonafide]\nWho's this Babylon emcee with the audacity, approaching me\nAs if I got a stamp of approval for his fallacy\nI hear you talkin' 'bout yourself\nAnd claim you keep it real but I ain't feelin' it\nI'm feelin' to your flesh but only kill the little light so dimly shinin'\nI question why you rhymin'\nIs ministry in mind and does God direct your timin'?\nOr do you even put it in to put it out? What you about?\nDo you use Him as a jewel well then your crown\nAnd you clout your time will tell\nIn life He must prevail, a living example is needed to rap it well\nYou see the ministry begins theminute you step up in from the stage\nIs your character the essence of the life you hear in the pages of His very Word\nCause if not face His rage\nYou ain't understandin' He demands a higher standard\nStayin' true to hip-hop caint be found in His Commandments\nTake notice because the atmosphere is about to get tense\nWanna find relatin' truth to some gone take it offense\nYoung cats, heed the message of this elder emcee\nWho got responsibility to let you know what kind of bilities to key\nBut it seems that some of y'all ain't caught the vision as we\n\n[Hook]"}]}