{"artist": "Yung Joc", "songs": [{"album": "New Joc City", "image": "https://images.genius.com/c8d5a7e86b7ff9f7536f527abd4fc252.500x499x1.jpg", "year": null, "lyrics": "[Yung Joc]\n(Ohhh!) Uh-huh (Shit! What up Chino Dolla?)\nNew Joc City (Here it is)\nBut right now, you 'bout to witness a nigga gone off that Patron\n(Heh-heh, aight) I'm talkin 'bout seven shots up\nY'knahmtalkinbout? (Seven shots? Woooo-ooh, shit!)\n(Boyz N Da Hood) The next round on you nigga, ha ha\nNow what I want y'all to do (What'chu want me to do nigga?)\nTake that shit to the motherfuckin head, to the flo' nigga\nLet's go\n\n[Hook]\nI just bought a zone, J's on my feet\nI'm on that Patron, so get like me\nI just bought a zone, J's on my feet\nI'm on that Patron, so get like me\nEr-ery'body love me, I'm so fly\nNiggas throw the deuces ery'time I ride by\nEr-ery'body love me, I'm so fly\nNiggas throw the deuces ery'time I ride by\n\n[Verse One]\nC'mon tell me what it do, I do it for the A\nWhen the top drop, rock the platinum Cartier\nGot that Microsoft so they call me Bill Gates\nIce links 'round my neck lookin like I build gates\nI'm Mr. Amoco, yeah I got the pumps\nPockets on swoll lookin like they got the mumps\nI'm 'bout my change, gotta get the riches\nFrom the look of thangs y'all gettin JC Penney's\nPass that Patron, the lime's right thurr\nRock with it, lean with it, in my Nike Urr\nWink my eye at your bitch, now she wishin she could touch\nSee the J's on my feet, and she love the diamond cuts\nFresh to death, everyday like I jumped up out a caskets\nAsk Chino Dolla 'bout that dope boy magic\nConnected like apartments, keep one in the cartridge\nChevy seats ostrich, name in the carpet\n\n[Hook]\n\n[Verse Two]\nI mix Patron and Everglow, I call it anti-freeze\nTake one sip her drawers fall to her knees\nMister V.I.P., get it like me\nIce piece on my wifebeat I call it Ice-T\nKush by the seven, I call it Mike Vick\nShe call me officer I hit her with my nightstick\nMy swag so mean need anger management\nYou call it what you want I'm on some ol' eleven shit\nThese niggas wanna hate, God dammit we can handle it\nMad cause I got juice, call me Tropicana bitch\nJoc feel good. Joc buy the bar\nCatch me in the hood pimp, rollin on a 'gar\nI plead to the judge I'm guilty of the charge\nI'mma ballaholic, can't help it I'mma star\nYou see the yellow ice, you holla oh my God\nTryin to guess the price, ehh about thirty large\n\n[Hook]\n\n[Verse Three]\nEry'body wanna know, how I do my thang\nYeah I get money and I let my nuts hang\nPull up to curb, cut it to the left\nMy rims sittin tall 'til I dim the knee steps\nI just see what I want, then I go get it\nThe apple jelly Chevy with the peanut butter in it\nSo don't get mad, pimp keep it cool\nI hang with them goons and the boys keep them tools\nI hustle all day, that's just how I live\nStack them big faces, give the strippers dollar bills\nCheck the dictionary for a P.I.M.P\nAnd when you look it up, potnah tell me who ya see\nYoung J-O-C, yeah that's me\nTwenty-eight G's, on my feet twenty-three's\n\n[Hook]\n\n[Outro]\nI'm on that Patron, so gone that Patron\nSo gone that Patron, so get like me\nSo gone that Patron, so gone that Patron\nSo gone that Patron, so get like me\nGet like me, get like me\nSo gone that Patron, so get like me", "title": "Patron"}]}