{"artist": "Apathy", "songs": [{"title": "Godz in Da Front", "image": "https://images.genius.com/aaaae50163287364429e596cd5315e89.500x500x1.jpg", "album": "Hell’s Lost & Found: It’s The Bootleg, Muthafu@kas! Volume 2", "lyrics": "\"Hood on the right, wild for the night\" - GZA 'Clan In Da Front'\n\n[Apathy]\nChampion hoods that I rock, new Nikes out the box\nWill attract your little chick then lock it down\nAll the Demigodz shit sound\nHardcore\nReloadin' my .44 like \"click\"\nBox cutter slicin' open your six pack\nDemigodz attack, motherfucker better start fallin' back\nAight\nCause I'm the king of Nike flights\nI got more boxes stacked then a warehouse\nTwo pairs, one on ice\nI won't even wear out\nGo head and talk greezy and you'll find yourself Aired out\nI box with the force that can knock grizzly bears out\nPrepare for warfare, fuck fightin' fair ones\nFeels like I shot you in the face with a flare gun\nThe heat when I speak and the temperature of my tongue\nWill make you swear to god that I'm the emperor of the sun\nA next level hustler that shouldn't be slept upon\nFuck crack!\nI sell Energon to Deceptions\nSwamp H, have Megatron on methadone\nApathy is a god in the rap upper echelon\nAssassination theme music, raps to die to\nCock back and blast before I pass to Ryu\n\n[Ryu]\nI be that insane cracker from the D.G.Z.s\nI need liquor and two packs of G.P.C.s\nNow that's sicker\nRats if you don't like it then fuck you\nMy clans deep, steppin' out my jeep in my truck jewels\n(Beep beep)\nThe killin' is a part of my job\nAyo RZA, good lookin' on that sixteen god\nYou gotta figure I'm the cream of the crop\nThe demon in Pac\nI leave 'em butt naked, make 'em eat the beam of the Glock\nYou wanna see the M.P. pop?\nGive me a reason, guarantee that after beefin' with me they turn vegan\nWhat the fuck you gonna do? Come and see Ryu\nI'm like a sniper\nSittin' on Machine Shop's roof\nS.O.B. style\nDemigodz hold me down\nSo keep my fuckin' name out your mouth\n\n[Motive]\nI leave the mics in body bags\nWith the same effect tsunami's have\nAnd uplift the rep that Gotti had\nAnd I'm the reason why your seeds is probably mad\nCause they caught me squeezin' my thing up in they mommy's ass\nIt's Motive bitch\nAnd yes I'm the bad man\nI spit so sick, they say I need a cat scan\nA Demigod assassin by cash fam\nKilo mode but still grind up bad grams\nThe Doe Raker that's well known so tell home\nI'm more to sea with my chrome more than cell phones\nAnd I ain't here to teach no kids, I'm just rhymin'\nI have you son wildin' like them kids in Blood Diamond\nFuckin' with Mo clutchin' the heat, flippin' cane\nI keep the streets full of snow like a blizzard came\n\n[Esoteric]\nSlammin' a hype as verse till your bones snap\nI ransack dead in the track and domes crack\nRap assassin, blastin', y'all should fasten seat belts\nYou crab ass rappers I'm rebuilt\nI'm hot\nTop notch, man fuck the pot shots\nWe got a leg up on the competition like hopscotch\nI'm nice\nI'm sayin' it twice\nI repeat like a pen\nI breed another eight MCs approachin' me\nI disrespect, slash your neck, cash your check\nIt's how I bought my fat ass Lex\nSo clear the way\nIt's Shay, dawg open the gate\nPeace, I'm out\nJettin' like I'm dealin' out of state\n\n[Emilio Lopez]\nYou're gettin' stripped for your spot of your game\nYou can't stop me, you can only try to contain\nI'm outta your range\nThat white widow got me thinkin' I'm on top a blade\nNo deal so I still keep stockin' the cane\nI only recognize your girl from the top of her brain\nShe loves the taste so much she even swallows the stains\nDon't be surprised if you fuck her and she callin' my name\nMy flow is insane, I'm headed to the hall of the fame\nI'm chargin' the game for all the long studio nights\nTime is money I need back a billion tonight\nStay up in booths threatening rappers and killin' the mics\nI love goin' overseas but I ain't feelin' the flights\nSo I'm tryin' to get a private jet\nDemigodz, we the livest set since hi-fi cassettes\nAin't a damn thing change boy\n+Protect Ya Neck+\nI'll have machete swingin' at where you head connect\nMotherfucker\n\nD.E.M.I.G.O.D.Z\n\"Keep my fuckin' name out your mouth\"\n\n[Celph Titled]\nAre you a warrior? Killer?\nSlicin' shit like a kamikaze ninja\nGo where I've been and you'll find bodies injured\nCall the ambulance, the A.T.F., the Ghost Busters\nThis is fast food, your last meal is a slow supper\nI'm Dan Aykroyd, Sigmund Freud\nBill Murray, that spit dirty at your derby make you act 'noid\nYou only half boy, half child\nBoom, bang BLOAW!\nDemigodz be like, \"All in together now\"\nI get funky fresh\nWatch me boil and flambe\nTurn your favorite rapper to ham glaze\n(Hey!)\nUncle Ben fucked Betty Crocker but it get's worse\nI fucked Mrs. Butterworth on a covered perch and kicked a gutter verse\nFor every hardcore connaisseur\nStudio got mushroom stacks we got bombs galore\nCelph Titled the grand daddy grenade man\nSellin' all my bottled up anger at lemonade stands\n\n[Tak]\nMy clan is thick like plaster\nBust ya\nBlast ya\nKill 'em in their tracks like a buff black gorilla\nStyles pumped off of skrilla\nFeel us\nYou'll lose your ? cause they gave us a banger from Dilla\nI came down with fat gats, then unload and lick a shot\nI blow the backs of city cops like bloaw\nNow it's all over\nPunks seein' pink hearts, eatin' schrooms through a straw with King Cobra\n\n\"Hood on the right, wild for the night\" - GZA 'Clan In Da Front'", "year": null}]}