{"songs": [{"year": null, "image": "https://images.genius.com/4faa518970e19e22ecdc868732305777.640x640x1.jpg", "title": "I Don’t Care", "album": "Sleepers", "lyrics": "[Verse 1: Rapper Big Pooh]\nCompared to whom, Pooh is the best this year\nI been rockin muh'fuckers since freshman year\nYou can sit if you want, you can stand and cheer\nYou can bootleg the album, nigga I don't care!\nRight now what we have is a world premier\nNew and exclusive shit, so sincere\nBe prepared, I'm nice wit this mic device\nOther niggas do joints and it don't suffice\nMy advice: quit while I'm way ahead\nMeetin up with me twice is a day you dread\nI'm sick, no antedote to prescript\nYou in the mix with a nigga who flip, go all out\nAnd ain't no chance in the world that I'mma stall out\nAnd 'til my God say enough and put the call out\nTo come now, take your sun away\nGet your umbrellas out, rainy day\n\n[Hook x2]\nYou say Pooh the weak link nigga - I don't care!\nYou can grit, you can stare nigga - I don't care!\nYou can pop a lot of shit, nigga - I don't care!\nYou could ask me to quit, nigga - I, don't, care!\n\n[Verse 2]\nIt's the most magnifa-gift of a spitter\nLyrical weight lifter, in short I'm the best\nI studied this rap shit, no need to mic test\nLet me put some issues to rest\nGot my label in the state of the rest\nCause I know sum'hin that they don't\nThat this nigga right HERE, the key to success\nGettin track by Khyrsis, I can put a dollar amount\nOn many things, but my nigga here is priceless\nYes, I did write this, this is so righteous\nThis is not hype diss, this is breathe and breath\nIn the body of the lifeless - damn, it's so necessary!\nA cold nigga, born in the month of February\nAnd Rapper Pooh is gettin so scary\nI done stepped the game up, your position here is so hairy\nI'mma be the one to +Straighten it Out+\nC.L. and Pete know what I'm talkin about, and it's like that\n\n[Hook x2]\n\n[DJ Flash cuts and scratches]\n\"I DON'T CARE!\""}], "artist": "Rapper Big Pooh"}