{"artist": "ILL BILL", "songs": [{"title": "Doomsday Was Written in an Alien Bible", "lyrics": "[Verse 1]\nI've seen the seven-headed dragon talking to the eagle\nThe two-headed snake illustrates a caution to the people\nElectronic fog, alien bibles, crop circles at the sand in Cairo\nLike Kiss in '76 demanding pyro\nHuman history, 50% catastrophe\nIt's actually the arms race between the facts of anarchy\nThe secret to success is believing that you succeeding\nIs more than an achievement;\nIt's as important as you breathing\nSometimes it's one and the same, who's running the game?\nAll we ever say is \"they\", they know it's fun to complain\nThis shit should cause people to riot and flip\nThe way I think; I've been classified as violent and sick\nI'm like a time bomb, the CIA designed me to tick;\nDesigned me to head over to papi to buy me a brick\nThese mother ships hit our radars in the skies as a blip\nThe entire sky is eclipsed just like the size of my dick\n\n[Hook]\nAre these the doomsday chronicles the Bible quotes?\nOr is this similar to shock that suicide provokes?\nWe're all slaves at the auction where our lives are sold\nTime to free our minds from the shackles and the lies of old\nAre these the doomsday chronicles the Bible quotes?\nOr is this similar to shock that suicide provokes?\nWe're all slaves at the auction where our lives are sold\nTime to free our minds from the shackles and the lies of old\n\n[Verse 2]\nI leave the face of your society with buck fifty scars\nSour Diesel spliffs from weed jars and flip police cars\nPut holes the size of grapefruits through riot gear\nBloody footprints from Jordan 4's on your floor, we pioneers\nTake fools to higher tiers, elevate to a higher learning\nTo a talking bush on the mountain with fires burning\nCommandments are carved in stone\nWhere lightning bolts the thrown in anger, meant to spark the dome\nNow frightening results unfold\nDragons, eagles, snakes, and aliens captured;\nWe keep 'em caged in various constellations and areas\nCoded through letters, numbers, and symbols that transmit\nPulses and whistles and activate hundreds of missiles\nHundreds of killers with multiple pistols\nWhile these name brands reverse engineer spacecrafts and make trillions\nThey made the cure for AIDS and ceased production\nWhile the poor die and fester in diseased corruption\n\n[Hook]\nAre these the doomsday chronicles the Bible quotes?\nOr is this similar to shock that suicide provokes?\nWe're all slaves at the auction where our lives are sold\nTime to free our minds from the shackles and the lies of old\nAre these the doomsday chronicles the Bible quotes?\nOr is this similar to shock that suicide provokes?\nWe're all slaves at the auction where our lives are sold\nTime to free our minds from the shackles and the lies of old", "image": "https://images.genius.com/457870257e417a35d5715090c07a987d.1000x1000x1.jpg", "album": "The Hour of Reprisal", "year": "2008-09-16"}]}