{"songs": [{"album": "T.I. vs T.I.P.", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg", "year": "2007-05-29", "title": "Big Shit Poppin’ (Do It)", "lyrics": "[Hook]\nHey, hey, what you waitin' for?\nDo it, do it, do it—what you waitin' for?\nDo it, ‘cause I'ma do it, ‘cause I'ma do it\nWhat you waitin' for?\nDo it, you know we do it, you know we do it\nLet me hear you say big shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBall on these niggas, bein' broke is not an option\n\n[Hook]\nNow do it, you better do it, you better do it\nHey, what you waitin' for?\nDo it, ‘cause I'ma do it, ‘cause I'ma do it\nHey, what you waitin' for?\nDo it, you know we do it, you know we do it\nHey what you waitin' for?\nDo it, you better do it, you better do it\nLet me hear you say big shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBall on these niggas, bein' broke is not an option\n\n[Verse 1]\nDo it to the maximum, take it while you askin' them\nDon't listen to them suckers when they say you too irrational\nSee, I said I was King, and them lames started laughin', them\nSame suckers now want the King on a track with 'em\nI composed several classicals, you know, like \"Top Back\"\n\"Dope Boyz\", \"Bring 'Em Out\"\nAnd \"What You Know About That\"\nNow they ask how I top \"What You Know About That\"\nDominated '06, now I'm goin' right back\nSee me reign hell, I just showed you like that\nEven Denzel say, \"Damn, I ain't know it like that!\"\nNigga, yeah, still Bankhead, you can tell\nAin't nothin' changed but the name on the mail\nI still kick in doors with them thangs in the air\nUp in Benihana's, see me slang in the chair\nI will slang 'caine, no such thing as a jail\nSay you need a hundred squares? It just came off the scale\n\n[Hook]\nNow do it, you better do it, you better do it\nHey, what you waitin' for?\nDo it, ‘cause I'ma do it, ‘cause I'ma do it\nHey, what you waitin' for?\nDo it, you know we do it, you know we do it\nHey what you waitin' for?\nDo it, you better do it, you better do it\nLet me hear you say big shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBall on these niggas, bein' broke is not an option\n\n[Verse 2]\nDo it like a ball player where you see me ball at\nStacks tall as ball players from the stage to the air\nWhether in Miami, Cincinnati, or the Riverdale\nArizona, California, make it rain anywhere\nPullin' out that pistol, nigga, who you think you finna scare?\nThese 20 rounds of missiles have ya pissin' in your underwear\nI tote a pair of .40 cal's, so you better tone it down\nOr I suggest you just prepare yourself for when it goin' down\nA-Town, West Side, club crucial, catch me\nRight up at the top where Big Kuntry, Dro, and Mack be\nJackers lie, say they caught me slippin', how could that be?\nI'm somethin' like a stalker, I be e'rywhere the strap be\nThe trap be, jumpin' with them hundred dollar slabs\nIf I want it, nigga, I could get a hundred on the tab\nSell 'em all, double down, nigga, do the math\nThink I won't pull up in somethin' with 200 on the dash?\n\n[Hook]\nNow do it, you better do it, you better do it\nHey, what you waitin' for?\nDo it, ‘cause I'ma do it, ‘cause I'ma do it\nHey, what you waitin' for?\nDo it, you know we do it, you know we do it\nHey what you waitin' for?\nDo it, you better do it, you better do it\nLet me hear you say big shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBall on these niggas, bein' broke is not an option\n\n[Verse 3]\nNow, I do it like I wanna do it, and do that shit in front of you\nReal nigga vision pimpin', I ain't seein' none of you\nI do it for my nigga Phil daughter and his mama too\nI do it for my oldest sons and their grandmama too\nDo it for my daughters and my youngest son's mama who\nGo buy what she want because she know it ain't a problem to\nYou do somethin' to them and to you I'll bring the drama to\nYou do it for a day or so, we do it for a month or two\nI do it for my partners, go make sure them niggas stuntin' too\nWe do it with them choppers\nAin't no problem, where you runnin' to?\nWe do it for the block, that's why ain't nobody stoppin' me\nI do it for my pop and my cousins too, they watchin' me\nI did it nonstop, now see how these niggas copy me\nI made it from the bottom to the top where I oughta be\nWho do it did good and do it did fresh\nNo matter what I do, you know I do it to death\n\n[Hook]\nNow do it, you better do it, you better do it\nHey, what you waitin' for?\nDo it, ‘cause I'ma do it, ‘cause I'ma do it\nHey, what you waitin' for?\nDo it, you know we do it, you know we do it\nHey what you waitin' for?\nDo it, you better do it, you better do it\nLet me hear you say big shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBig shit poppin' and lil' shit stoppin'\nBall on these niggas\nBein' broke is not an option, now do it!"}], "artist": "T.I."}