{"artist": "Immortal Technique", "songs": [{"title": "The Rebel", "lyrics": "Yea, yea, immortal technique (you know)...Harlem to South Africa\n(this is how it goes) for the head warmers, y'know wut I mean..this is\nFor my peoples..insomniac I can't sleep (it's real son) Mic Check. ayo\nAyo (yea)\n\nI'm a rebel that'll fire missiles at red dawn\nBut before I issue the order to send bombs\nI want presidential money like execs at Enron\nAnd gold digging porn chicks for me to spend on\nBut I'mma only pay for 1 night stay at the Ritz\nI won't even get you a towel when I spray on your tits\nI'm not a misogynist\nI just like it when girls are massaging this\nSo pop shit\nAnd Immaa smoke you and your bitch moms\nI'm ambidextrous the microphone can switch palms\nImmortal Technique psychotic nigga to spit calm\nMisinterpreted by the media like Islam\nI love the underground but not enough chicks in a thong\nWhat the fuck how could beautiful women be wrong?\nTech load clips like they were hits from the bong\nThat was supposed to be the end of the song\nBut its not the freestyle got me stuck in the zone\nI can't stop brainwashed commercial hip-hop the government plot\nBut I'mma shoot down the propaganda stuck in your brain\nLike the military did to the fourth terrorist plane\nThat was ill but shut the fuck up and let me explain\nWhat good is fame and flossing\nWhen you stuck in a coffin?\nAnd who the fuck you gonna run to when I make you an orphan?\nI'm metamorphosing into something you thought that I could never be\nGhetto engineered sickness without a remedy\nMy heart pumps nitro-glycerin and Hennessey twisted chemistry\nCry blood and I bleed venom\nNever subliminal clear with the message I'm sending\nBending the space-time continuum\nJust to get to you\nAnd blast you so hard it'll kill the person next to you\nSo in retrospect remember and dont fuckin forget\nYall are walking dead people y'all just dont know it yet!\n\nYea...yea nigga..its on...you know what time it is..\nIm out...Harlem nigga.....this is for all the devils..\nI'm coming in here to take your head off", "image": "https://s3.amazonaws.com/rapgenius/1-immortal_technique-20101005.Jpg", "album": null, "year": null}]}