{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Verse 1]\nI got a little story 'bout a single white female\nHer name is Tammy, but you'll need some fine details\nShe gets up on the internet and argues with strangers\n'Cause inside she’s full of insecurity and anger\nShe tries to be edgy, that's her rap ploy\nBut back in the day, she was a frat boy\nShe says everybody hates her, but no one even cares\nSo now I'm gonna grab the bitch and throw her by the hair\nAyo, single white female, it's time to make the jay burn\nWhere's your fuckin' balls, bitch? You actin' like you Greyworm\nHow you gonna let a lil' tweet hurt your feelings?\nDid I bruise your ego lil' girl, what are you revealin'?\nYour whole fuckin' gimmick is claimin' everybody's too p.c. and sensitive, so why you on some victim shit?\nIf somebody don't like you, that shit straight troubles you\nWhy the fuck you actin' like an S.J.W.?\nYou rappin' like you wanna \"Make America Great Again\"\nBut you're not even American, Tammy, you’re Canadian\nYou live in the safest fucking country in the world\nAnd you act like you're oppressed, man, you're such a little girl\nSpeakin' of little girls, you wanna diss my daughter?\nDamn, that’s a cheap shot, that's so damn disgustin', man\nWell I can throw cheap shots too\nLet's talk about the fact your girlfriend used to suck off R.A. the Ruggedman\nYou wanna say I'm rappin' filler?\nYour girl is a King of the Dot groupie that be lettin' rappers fill her\nWe got mutual friends, they gave me dirt, these are facts\nYour girlfriend ghostwrites half your raps\nOn YouTube, the biggest video of mine has more views than all your fuckin' videos combined\nSpeakin' of YouTube, you claim that I'm irrelevant\nI got 2 million more fuckin' subscribers than you do\nYou wear women's clothes and Nicki Minaj braids\n'Cause you gotta hide the fact that you secretly got AIDS\nYou think that I'm not paid? Silly bitch, I'm a millionaire\nYou want proof? Meet me at the bank and I'ma kill you there\nWhite on white violence, damn it's snowin'\nYou're the fuckin' rap equivalent of Candace Owens\nI heard you block people on Twitter because they told you Mac Lethal is bigger, sweet Jesus you're bitter\nWhat's the matter, LeLe Pons?\nDid my Lethal injection get stuck in your vajayjay wrong?\nAw, what's the matter Methlemore?\nYou need another stupid white boy gimmick to move some units out the record store?\nYou're not a lyricist, you're not controversial\nNo one is offended by you, and that really hurts you, bro\nYou lie about your height, you're not 6'5, you little man\nYou look like Kid Rock had a meth baby with Lil Xan\nYou look like Lil Pump had a crack baby with Bhad Babie\nWhat's the matter Elsa, why you actin' sad lately?\nI'm a martial artist, you fake wrestle, bitch\nYou aren’t The Man, but you do look like Becky Lynch\n\n[Interlude]\n*Bells dinging*\nLadies and gentlemen, coming to the ring right now, this man is a Canadian who would give anything to be American\nStanding 5'8-I mean, uh 6'5-, weighing 72 pounds, \"Tammy Macdogfart\"! (Boooo!)\nOh shit, let's watch this wrestling video\nOh my God, what ki-what kind of fuckin' move is that?\nWhat is that?\nAHAHAHAHAHA!\n\n[Verse 2]\nIn your diss song you tried to say that I was gay? Right\nYou're the motherfucker that be dressin' up in grey tights\nSo you and other half-naked men can fuckin' play fight\nYou just need an excuse to lay there and take pipe\nIn America, hog is another word for dick\nWhich is the reason that you have it tatted underneath your lip\n'Cause you love dick bro, you give enough head\nYou wear nail-polish, motherfucker, 'nough said\nYou ain't skilled, be quiet\nYou look like Billie Eilish did too many pills and got filled with violence and killed her stylist\nI heard your diss, bitch, I ain't bust a sweat\nYou diss ICP, homie, your girl's a Juggalette\nYou say I'm in my 30s like the shit is a bad thing\nI'm healthy and I'm rich and I'm living my rap dreams\nMy kids go to a nice private school\nI got a sick fuckin' house, I own my own pool\nHow the fuck you gonna try to say I'm having an identity crisis?\nYou're a 30-year-old man dressin' like this\nI wear normal clothes\nI don't need controversy and shock value, I grab the mic and pour my soul\n\n[Outro]\nLet this shit be a lesson in how you thirst fame\nFrom here on out your name is infinitely cursed, mane\n'Cause if you say your last name, you have to say my first name\nBitch, my fuckin' rap name is in your fuckin' birth name, Mac!", "year": "2019-06-05", "album": "YouTube", "title": "Single White Female"}], "artist": "Mac Lethal"}