{"songs": [{"year": "1993-07-27", "album": "Swing Batta Swing", "image": "https://images.genius.com/9ab89d4c8ea2af15bbef796250f7d3af.300x300x1.jpg", "title": "Come Baby Come", "lyrics": "Da ding de ding de ding de de de ding ding\nDa ding de ding de ding de de de ding\nDa ding de ding de ding de de de ding ding\nDe ding de de de ding de ding de de de ding ding\n\n(Respect)\n\n(Yeah, yeah)\nMove it up (yeah, yeah)\nMove it up (yeah, yeah)\nCome on\n\n(Bounce, come on bounce, bounce, come on bounce)\n(Bounce, come on bounce)\nSeven's always in control, you know what I'm sayin'\n(Bounce, come on bounce)\n\nI slam the door (Boom!)\nWhen I come into the bedroom (Wham! Bam!)\n'Cause I'm the King of the castle (na na na)\nTurn me on turn me loose (come on, come on)\nTry to hit it, it's a hassle\nCome get some of this, don't forget the innuendo\nPlay me like Nintendo, never ever let go\nKeep it so loud, you'll be hittin' the crescendo\n(Do Re Mi Fa Sol La Ti Do)\n\n(CHORUS:)\nCome baby come baby baby come come\n(Come baby come baby baby come come)\nWhen you gotta give me lovin' then you gotta give me some\n(You gotta give me lovin' and you gotta give me some)\nCome baby come baby baby come come\n(Come baby come baby baby come come)\nWhen you gotta give me lovin' then you gotta give me some\n(You gotta give me lovin' and you gotta give me some)\nCome down\n\nWell, I can hear the (ring ring ring)\nThe telephone goes ring (hello, hello)\nBut we're still gettin' busy\n(Pom pom pom, hoo!) Now you're gettin' busy\nI can slow it down so you can pump it (pump it)\nBetter move it fast so you can pump it (pump it)\nTwo balls and a bat (hoo), a pitcher with a hat (ha)\nSlidin' into home base, tryin' to hit a home run\nSwing batta batta batta batta batta swing!\n\n(CHORUS)\n\nBreak it down, break it down, come on\n\n(Bounce) Move it all around, (come on bounce) move it all around, bounce\n(Bounce) Pump it up and down, (come on bounce) pump it up and down, bounce\n(Bounce) Move it all around, (come on bounce) move it all around, bounce\n(Bounce) Pump it up and down, (come on bounce) bounce, bounce\n\nTell me do you like it? (Yeah, yeah)\nDo you want a little more? (Yeah, yeah)\nNow tell me do you love it? (Yeah, yeah)\nCome on! (Do do you love me?)\nI can feel it (hoo baby baby), come on (ha baby baby)\nLet it go (hoo baby baby), come on (ha baby baby)\nGive it to me (hoo baby baby), come on (ha baby baby)\nGive it to me (hoo! Straight up, now tell me)\n\n(Bounce) da ding de ding (come on bounce) de ding de de de ding ding\n(Bounce) da ding de ding (come on bounce) de ding de de de ding\n(Bounce) da ding de ding (come on bounce) de ding de de de ding ding\n(Bounce) de ding de de de ding de ding de de de ding ding\n\nCome baby come baby baby come come\n(Come baby come baby baby come come)\n(Yeah) da ding de ding de ding de de de (hoo!) ding ding\n(You gotta give me lovin' and you gotta give me some)\nCome baby come baby baby come come\n(Come baby come baby baby come come)\n(Yeah, hoo!)\n(You gotta give me lovin' and you gotta give me some)\nCome baby come baby baby come come\n(Come) step everybody, (baby come baby) step everybody (baby come come)\n(Yeah) da ding de ding de ding de de de (hoo!) ding ding\n(You gotta give me lovin' and you gotta give me some)\nCome baby come baby baby come come\n(Come baby come) all together now, come on (baby baby come come)\n(Yeah, hoo!)\n(You gotta give me lovin' and you gotta give me some)\nCome down"}], "artist": "K7"}