{"songs": [{"lyrics": "[Produced by DJ Premier]\n\n[Intro: Pain In Da Ass]\nSomebody's pulling me closer to the ground\nI ain't panicked, I been here before\nSeems like only yesterday when I got up on that stage\nIn front of that crowd\nAnd showed them who was who, and what was what\nMan look at these suckers\nI ain't no rapper, I'm a hustler\nIt just so happens that I know how to rap\nOKAY, I'M RELOADED!\n\n[Hook: Aaliyah]\nA million\n\n[Interlude: Jay-Z]\nUh-huh, I've did it again niggas\nFucked up, right? Ha, I know\nI know what y'all niggas asking yourself\nIs he gon' ever fall off?\nNo...\n\n[Verse 1: Jay-Z]\n... A lot of speculation on the monies I've made, honies I've slayed\nHow is he for real? Is that nigga really paid?\nHustlers I've met or, dealt with direct\nIs it true he stayed in beef and slept with a TEC?\nWhat's the position you hold?\nCan you really match a triple platinum artist buck by buck\nBut only a single goin' gold?\nIf Roc-A-Fella should fold, and you're left out in the cold\nIs it back to charging motherfuckers 11 for an O?\nFor the millionth time, asking me questions\nLike Wendy Williams, harrassing me\nThen get upset when I catch feelings\nCan I get a minute to breathe? And in that minute you leave\nWhile I'm looking at my Rol' ice spinning on my sleeve\nUgh, nice watch, do you really have a spot?\nLike you said in Friend or Foe and if so, what block?\nWhat you doin in L.A., with Filipinos and Eses?\nLatinos and Chevys, down by Pico with Frederico\nI'll answer all your questions but then y'all got to go\nNow the question I ask you is, \"How bad you wanna know?\"\nBLAOW!\n\n[Hook: Aaliyah]\nA million\n\n[Interlude: Jay-Z]\nRoc-A-Fella y'all, uhh, uh\nKnow my style\n\n[Verse 2: Jay-Z]\nMotherfuckers can't rhyme no more, 'bout crime no more\n'Til I'm no more, 'cause I'm so raw\nMy flow expose holes that they find in yours\nWasn't for me, niggas still be dying for whores\nBut I hate when a nigga sit back, admiring yours\nYoung blood, you better get that, we frying because\nNiggas don't want to be confined to riding the iron horse\nAnd don't listen to the rappers yo, they dying to floss\nI used to be O.T., applyin' the force\nShoot up the whole block, then the iron I toss\nCome back with the clique playing Diana Ross\nI'm the boss and this is how it's gon' be\nBurnt the turnpike, wild miles on the V\nI got mouths to feed 'til they put flowers on me\nAnd kiss my cold cheek, chicks crying like I was Cochise\nTombstone read, \"He was holdin' no leaks\"\nStarted from the crack game and then so sweet\nFreaked it to the rap game, Jigga the O.G\nOn MTV, telling 'em how I sold D\nAnd used to bag work up out of apartment 4-B\nMe and my homie, started out co-d's\nPicked the mailbox lock 'cause I ain't have no key\nHad the cable with the anchor when Jaz made 'Sophie'\nThen I went low key, but now I'm back, it's on\nMotherfuckers!\n\n[Outro: Jay-Z]\nJigga, uh-huh, yeah\nRoc-A-Fella y'all, uuuh\nUhh, feel this", "title": "Intro / A Million and One Questions / Rhyme No More", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg", "year": "1997-11-04", "album": "In My Lifetime, Vol. 1"}], "artist": "JAY-Z"}