{"artist": "Inspectah Deck", "songs": [{"title": "Chamber No. 9", "lyrics": "[Intro]\n\"With you dead, no one will know!\"\n\"But I will!\"\n\"He cheated me. I would've have destroyed Shaolin. So we have to die.\"\n\"Though you're still loyal to Shaolin, what you did with your plots is against all Shaolin ethics. I have to take you in for punishment!\"\n\"Haha haha hahaha, try it!\"\n\n[Verse 1]\nThey are sicker than the white kid with the AR\nRuder than the Cuban dude with the face scar\nThey say they lit man, we're dripping in napalm\nThe grip, aim strong, you facepalm\nThe hair and bone hold eigth charms\nThe butter soft came with suede arms\nSuper fly, no cape on\nEverywhere I go they let sun in, like the drapes drawn\nEverything, Gucci Gucci, ask Kreayshawn\nCame alone 'cause my game on\nAnd I was singing the same song till the pain gone\nSole survivor like Akon\nWelcome to my world, just sign your hancock in the namelog\nWave of the arm, hit him with the a-bomb, but stay calm\nI ain't even come to make harm\nI lace them with the heart\nMake 'em nauseous in the morn'\nWhatchin' him flip, same way I made eight off the four, with the raw\n\n[Chorus]\n(The 9th chamber, you get trapped inside my hallway)\n(Chamber #9)\n(The 9th chamber, you get trapped inside my hallway)\n(My team with, My team with)\n(The 9th chamber, you get trapped inside my hallway)\n(And that's one in the ch-ch-chamber, 36 styles of danger)\n(The 9th chamber, you get trapped inside my hallway)\n(Raw Imma give it to ya, with no trivia)\n\n[Verse 2]\nRebel, I've been vilified, none other ill as I\nI throw these squares in boxes, like Sicilian pies\nLike I told y'all a million times\nI done sold y'all a million rhymes\nFrom a time where you'd creep to pull a 9\nOver who got the biggest dimes\nThat's why I Spit the vivid lines\nYou can tell that I'm living minds\nY'all haters better get in line\nI'm like a European watch on a different time\nTimes is different, what people do to get the shine\nI ain't afraid to be myself, never switch a side\nSittin' in position to climb, consistent with the grind\nVisions of living fine, while niggas getting hit with ridiculous prison time\nI follow the path, I ain't windup here, It took meticulous design\nTo blood, sweat and tears, God, give we a sign\nNow the plug stay hittin my lives for the brawl\n\n[Chorus]\n(The 9th chamber, you get trapped inside my hallway)\n(Chamber #9)\n(The 9th chamber, you get trapped inside my hallway)\n(My team with, My team with)\n(The 9th chamber, you get trapped inside my hallway)\n(And that's one in the ch-ch-chamber, wu tang banger)\n(The 9th chamber, you get trapped inside my hallway)\n(Raw Imma give it to ya, with no trivia)", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}