{"artist": "Immortal Technique", "songs": [{"title": "Civil War", "lyrics": "[Intro]\nLike anybody, I would like to live — a long life; longevity has its place. But I’m not concerned about that now. I just want to do God’s will. And He’s allowed me to go up to the mountain. And I’ve looked over. And I’ve seen the Promised Land. I may not get there with you. But I want you to know tonight, that we, as a people, will get to the Promised Land. So I’m happy, tonight. I’m not worried about anything. I’m not fearing any man. Mine eyes have seen the glory of the coming of the Lord\n\n[Verse 1: Immortal Technique]\nThe ghetto is like a prison with invisible bars\nNo matter where you at, it always follows you where you are\nAnd it's hard out there for a pimp to get out of\nBut it's harder for the hooker that he beat the shit out of\nI got niggas underground in the Confederate states\nIronically running from slavery that prison creates\nSo I never hate on the South: I respect their vision\nI just hate on niggas that promote Samboism\nAnd white execs that love to see us in that position\nThey reflect the stereotypes of America's vision\nThey want us dancing, cooning and hollering\nOnly respect us for playing sports and modeling\nMore than racism: it's stay in your place-ism\nMore people are trapped in practical blackface-ism\nSo fuck a Civil War between the North and the South\nIt's between field niggas and slaves that are stuck in the house\n\n[Chorus: Chuck D]\nCivil war for the soul of a nation\nThis is a struggle to save civilization\nDemonstrations overthrowing the occupation\nThe annihilation of mental colonization\nCivil war for the soul of a nation\nWe fight for the future of our civilization\nDestroy the corrupt government organizations\nTrying to survive cultural assassination\n\n[Verse 2: Killer Mike]\nCrip niggas, Blood niggas, eses, Asians\nWhy the fuck we warring with each other's population?\nThe devil wanna dead all our population\nPeople and Folk Nation, why the separation?\nWhy we got Jamaicans hating on Hatians\nWhen the British and French raped both nations?\nMexicans and Blacks kill each other, straight hating\nWhile the government profits from prison population\nIf you on the bottom, be you Anglo or Asian\nYou gotta recognize the realness of what I'm saying\nYou gotta recognize another G ain't the enemy\nWhen the police ride, and kill us frequently\nWe gotta make the youth see where the truth be\nIf you a G, then grow and develop GD\n50 years of gangs and our people still poor\nIf we really run the streets, we should really end war\n\n[Chorus: Chuck D]\nCivil war for the soul of a nation\nThis is a struggle to save civilization\nDemonstrations overthrowing the occupation\nThe annihilation of mental colonization\nCivil war for the soul of a nation\nWe fight for the future of our civilization\nDestroy the corrupt government organizations\nTrying to survive cultural assassination\n\n[Verse 3: Brother Ali]\nOur hearts were torn apart just like y'all was\nWatching towers full of souls fall to sawdust\nEverytime we called your office you ignored us\nNow you holding hearings on us all inside of Congress\nMicroscopes on us, ask if we're jihadists\nMy answer was in line with all of the Founding Fathers\nI think Patrick said it best: Give me liberty or death\nI shall never accept anything less\nYou claim innocence, you play victimless\nBut you gave the kiss of death in the name of self-defense\nSlavery and theft have brought our nations to the end\nOf pacifying your citizenry with excess\nWe believe in freedom, justice, security\nBut they're only pure when they're applied universally\nSo certainly if I rage against the machine\nMy aim was only to clean the germs out of the circuitry\nUrgently putting fear inside your heart\nMake you burn Qu'rans and tell me not to build a mosque\nMe, my wife and babies we ain't never made jihad\nWe just want to touch our heads to the floor and talk to god\nAsk him to remove every blemish from our heart\nThe greatest threat of harm doesn't come from any bomb\nThe moment you refuse the human rights for just a few\nWhat happens when that few includes you? Civil war", "image": "https://images.genius.com/d17ee30cab427a6ea7fa3bfa64561580.400x400x1.jpg", "album": "The Martyr", "year": "2011-10-27"}]}