{"songs": [{"year": null, "album": "The Most Beautifullest Thing in This World", "image": "https://images.genius.com/447c633e96f2be906b387d1114ff07c4.953x953x1.jpg", "title": "Take It to the Streetz", "lyrics": "You better recognize what\nSnatchh your fuckin' head from your neck\nWord up it's the cold blooded sin\nStrickly murder\nLegion of Doom 94\nWord 'em up this is how we do that shit\nTechs to your record son. Shit\nFuck that shit\nWord 'em up that how we're always been\n\nYo check it, I feel the vibe like Shanet\nCollaborate on niggas brains and bend you ass like a Sinse'\nMy death sentense is danger\nI black out like Joe Ripken niggas hittin' the floor like the chamber\nThe sick authorist transmits for no repent\nAnd activate the plan the Pentagon inelligents\nSo listen close like musical chairs\nThe L.O.D. is deep then the niggas Under The Stairs\nI crack million dollar script like an archetict\nAnd execute like the chair when I inflict death\nI got the creepiest slang in this galaxy\nAnd wreck the industry so mysteriously\nComing with the funk from beneath I creep straight for juggelars\nAnd twist rap caps for all you motherfuckers\nWalk the bloody streets with 19 shots in the lueger\nNiggas be scared to face 50 Grand like Medusa\nThe shit I produce is like gin and juice when it blend\nScenes from Toni Braxton you'll Never Breath Again\nI rhyme without ability to reason, niggas is guilty of treason\nWho's to blame but the Legion to the Doom\n\nWith punk niggas we got beef so\n(L.O.D. about to take it to the streets)\nOn the mic we definatly got beats so\n(L.O.D. about to take it to the streets)\n\nRoy Jay go the wickedest mystic magestic flow\nFrom a homicidal clique, Yo E make that psycopathic mix\nI hits for the hecks or the shit that causes conflict in the script\nBeeotch my style set on fire to touch Venus\nMy soul seeks the universe while I'm sleepin'\nI'm creepin' makin' myself develop with the chronic\nElectronic Million Dollar Man the mic bionic\nSo you can feel it in your nerves when I blast off into the suburbs\nConduct like ? with electrofying words\nI freak to them suicidal tracks break backs\nNiggas scarred fakin' fuckin' heart atttacks\nOooh when I'm comin' through the crowd\nNiggas want static yo I got the gun pazoow, wizoow, word up\n\nI got the slaughter for your brains drive you insain\nFuck that shit\n\nThe moderation incobation of my creation\nIs instantaniously with my vocabulation accumulation\nTrust me as I bust thee, lyrical homicidal shit from Keith Murray\nIf I had twenty four hours to live and one wish\nI wouldn't wish for no damn lifesavers\nI'd start going wild like Larry Davis\nThe funk speach vigalante from the L.O.D\nGets funky freakly and freaky fluently\nAnd deep as Greek mythology on level Z\nTheres six million ways to die\nAnd eight million stories in the naked city and all them shits are lies\nSo I keep my wittiest ironist hidious\nPsychosis bloodiest flow decitious\nComin' from out this orbit deep space 9's wiggle my shit\nMeltin' crew down like synthetic acid\nCome half steppin' fession' through a section\nAnd get the midsection of your brain drain\nWith mad man expression, no quesion and no second guessin'\n\nYo forty dreams and blunts for witches\nYeah that's what we got for them niggas\nYo lets get on it get off it\nL.O.D. we won't forfit\nA-yo check it out\nL.O.D. is the niggas man\nA-yo put your money where your mouth is at nigga yeah\nI have you rockin' dazie dukes and Reebok pumps nigga yeah, yeah\nL.O.D. style for 94 yeah and it's on"}], "artist": "Keith Murray"}