{"songs": [{"image": "https://images.genius.com/0ff2d9b293e1c9fe502c99722eaeaa4b.497x500x1.jpg", "lyrics": "[Verse 1: Sauce]\nGet stupid, go dumb, yeah, that's our clique\nI gives a fuck if u a dime, I still call you a bitch\nYou'll probably see us in the club 30 deep equipped with clips\nAnd hella whips outside talkin' shit\nWe don't pay to get in nothin', rush the door so quick\n21 with no sense, security guard so tense\n'Cause we hyphy, ain't no tellin' what we might do\nThe light bright red but we still slidin' through\nHypnotiq got me cool, pills, popped about two\nWe done smoked about a quarter now already, what it do\nI don't know about you but I'm feelin' myself\nWhoa, let me calm down, i'm killin' myself\nNo, I get stupid so I gotta keep on\nI could last about a week long 'til my battery gone\nSix hours then I'm charged and I'm back in the zone\nBack in the zone, get stupid, show 'em how we actin' at home\n\n[Hook]\nGet stupid, go dumb (Repeat 8X)\nWe some stunnas, y'all some runnas\nNow get stupid, go dumb\nGet stupid, go dumb (Repeat 3X)\n\n[Verse 2: Yukmouth]\nNigga, I'm swingin' my Chev', you shakin' your dreads, get stupid\nI'm makin' my bread, I'm shakin' the feds, get dumb\nYou makin' a spread and takin' ya meds, you stupid\nI'm bussin' they head and bussin' my lead, I'm dumb\nFuck a club, nigga, I'm a thug nigga with drug dealers\nMug niggas, middle finger up screamin' 'Fuck niggas'\nWhat, nigga? You from what? I gives a fuck, nigga\nRun up on Yuk and get bucked, I'll have you touched, nigga\nYou ever see a thousand killas bum rush niggas?\nAnd see 20 bitch niggas get stomped nigga?\nGet jumped, clips dumped, leave ya slumped, nigga\nBody in a dump, nigga; you don't want no funk, nigga\nI get stupid like I'm mentally disturbed, smokin' herb\nSwingin' a Suburb, stash full of birds\nI rock minks, furs, and shit you never heard\nAnd 20 Bay niggas on stage going berserk\n\n[Hook]\nGet stupid, go dumb (Repeat 8X)\nWe some stunnas, y'all some runnas\nNow get stupid, go dumb\nGet stupid, go dumb (Repeat 3X)\n\n[Verse 3: Mac Dre]\nWhen I step up in the club, I get hyphy, be like what\nI cut it up, fuck it up, stuff it up, roll it up, puff it up\nBoy, I'm tryna bust a nut, holla at baby, what's wit' it\nShe fucks wit' it, I'll thrust and then get sucked and bucks wit' it\nI'm nuts wit' it, stupid, D-U-M-B\nAnd MD keep a bitch broke like Huey MC\nI'm a P-I-M-P, straight up out the V\nThe Bay, Morris Dre, ain't nobody bad like me\nNobody sav like me, I keep the Cutthoatish\nYou ain't notice, punk bitch, I'm the coldest\nHere, roll this, it's drugs for the rich\nNo chips? I ain't got no love for the bitch\nI'm a thug for the chips, bitch get my Frito Lays\nSwoop, cutty bro show 'em your estupido ways\nI see them Gucci, them J's, Stuey is how we come\nBust a lung, nigga, get stupid, get dumb\n\n[Hook]\nGet stupid, go dumb (Repeat 8X)\nWe some stunnas, y'all some runnas\nNow get stupid, go dumb\nGet stupid, go dumb (Repeat 3X)", "year": "2007-10-30", "album": "Pill Clinton", "title": "Go Dumb"}], "artist": "Mac Dre"}