{"songs": [{"year": null, "title": "Shok TV", "image": "https://images.genius.com/cff949e333e91bd4776ee32fef57ea4a.360x360x1.jpg", "lyrics": "[Intro: Saigon]\nYeah.  I teach ‘em too.  You gon’ teach them niggas?   Yeah.  Listen\n\n[Verse 1: Saigon]\nI said, “Listen.”  I'm a nigga on a mission\nDo what I gotta to get my people in position\nHelp 'em envision a better living condition\nStop putting so much trust in your religion\nThey couldn't conquer without division\nBoy, you still black—I don't care if you Catholic or Christian\nPolice'll still fuck you up, young buck\nBust you in your head, leave your body by the dump truck\nRevolution got me pumped up\nBut it's still a fact black people think so fucked up\nHow they got money to go war with whoever wrecked a building?\nAnd nothing for Africa's HIV-infected children?\nThat mean the money for a life they can save\nThey rather use it to send a life to a grave\nAnd that's not righteous ways\nThat ain't even the half.  My real-a-real, I could write for days\nBut I don't know how they might behave\nYou seen what they did to the Pacs, Martins, and Marvin Gayes\nCould you picture the Black Panther party today?\nUsin' hip hop to say the same thing Marcus Garvey would say?\nImagine Malcolm X over a beat\nTryin' to rally up the troops and take control of the street\nStill in the window, holdin' the heat\nBut now we got soldiers on the corner like police patrollin' the beat\nFuck G.E.D.'s - Niggas need DP CDs\nWe don't need PCP.  We don't need flat screen TV's and DVD's\nWe need more knowledge of who we be, G\n\n[Hook: Saigon]\nDo we really know where the guns come from?\nDo we really know where the drugs come from?\nHow come it only affects us and not them?\nHow come Jesus Christ has still not come?\nWhy am I wrong if I kill a nigga that punch me?\nBut it's right for you to blow up a whole country?\n\n[Outro: Saigon]\nShit.  “Shok TV.”  Understand it.  We here now.  Brrat!  Saigon.  Abandoned Nation.  Freedom fighters.  Fade out.  Come on.  People’s Army.  Yeah nigga!  RBG.  New York, come on.  Fucking coward-ass rap niggas.  Understand this, bitch.  I’m the 2000 version of [?].  I need you to understand this shit is real.  DJ Shok.  I’m a fucking freedom fighter, you faggots.  Y’all know that shit.  Come on, come on, come on.  You stupid.  Yo", "album": "Warning Shots"}], "artist": "Saigon"}