{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Dreamin’ Remix", "lyrics": "[Intro: 50 Cent]\nNiggas crazy (keep on dreamin')\nThink they gon' catch me slippin' (keep on dreamin')\nI'm on point, nigga (I said keep on dreamin')\n24/7, ya heard?\n\n[Hook: 50 Cent]\nEvery day I dream I see you dreamin'\nI cock my strap, I see you schemin'\nI want you to try me, nigga, I'm fiendin'\nTo pop my shit then forever you sleepin'\nWhen robberies done improperly\nIt turns into murder one, one, one\nMove properly or get dropped, see\nCome at me wrong and you're done, done, done\n\n[Verse 1: 50 Cent]\nNo two-face or mean mug, no mask, no gloves\nGet you in my peripheral, I'm tearin' you up\nI'm watchin', you probably think my eyes wide shut\nI'm waitin' for you to cross the line and get fucked\nI lean in a Lotus, take off like a rocket\nGot your bitch outta pocket, my hustle, you can't knock it\nGot paper like Citibank, nigga, you need a loan\nGot a brain, use ya brain, or get ya brains blown\nWatch my watch tick tock and get popped\nSee my chain gleam scheme\nAnd get met with the beam, nah mean?\nI'm not a freshman, I'm a senior, yeah, head of my class\nI'll put a hollow tip head in yo' ass\nYou tryna jam me thinkin' I'm candy\nAin't nothin' sweet, I run the streets with all sorts of heat\nYou tryna eat, try elsewhere, my presence is felt here\nYou won't need wealth here, your ass'll get melt here\nNigga, yeah\n\n[Hook: 50 Cent]\nEvery day I dream I see you dreamin'\nI cock my strap, I see you schemin'\nI want you to try me, nigga, I'm fiendin'\nTo pop my shit then forever you sleepin'\nWhen robberies done improperly\nIt turns into murder one, one, one\nMove properly or get dropped, see\nCome at me wrong and you're done, done, done\n\n[Verse 2: Sean Price]\nYa niggas ain't maintaining, ya niggas is man-tanning\nBlack face, smack taste, I'll chew on your man standing\nFuck who you next to, nigga, I'll wet you\nSplash vest, crash test, guess what this gat do\nI'm getting upset, duke, guess I'm the Madd Rapper\nFirst born on the horn saying, \"yo, dad, slap 'em\"\nFuck all these fuck-niggas, this is big Ruck, nigga\nI'm a boss, you a ten off every buck, nigga\nRuck is a tough rapper, I got a Dutchmaster\nThree dice in my hand sippin' a nut-cracker\nI got the bank stop, you think broke, bitch, I think not\nTwenty-five thousand dollar carpet like Frank got\nBlot that shit, I'll pop that shit\nThat got niggas talkin' about callin' the cops and shit\nYou pussy, I'm the opposite, hardcore\nKevlar vest on my flesh in a large form, P\n\n[Hook: 50 Cent]\nEvery day I dream I see you dreamin'\nI cock my strap, I see you schemin'\nI want you to try me, nigga, I'm fiendin'\nTo pop my shit then forever you sleepin'\nWhen robberies done improperly\nIt turns into murder one, one, one\nMove properly or get dropped, see\nCome at me wrong and you're done, done, done\n\n[Verse 3: 50 Cent]\nTest me, you wan' die? Murder a lung now\nFresh of the projects, put ten on my neck\nIt's off limits, touch it, touch the sky\nTouch it, I'll send you to ya dead homies to say hi\nI break niggas into fractions, I'm down for that action\nTalk that chopper talk 'til I come with the Colt\nThen it's bye-bye, close your eyes, learn to fly\nWhy go through it, why try and test I?\nWhen you know I ain't rap right, I'm strapped right\n2-4-7, 3-6-5, I'm outside, steady mobbin'\nI'm all in, I'm not the one you robbin'\nHave me creepin', crawlin', shell cases fallin'\nBullet hit your leg, break your limb\nBullets hit your chest, make you slim\nBullets flyin', run away from them\nBullets miss you, hit your closest friend\nYou pussy, mane, you should've gave your toast to him\n\n[Hook: 50 Cent]\nEvery day I dream I see you dreamin'\nI cock my strap, I see you schemin'\nI want you to try me, nigga, I'm fiendin'\nTo pop my shit then forever you sleepin'\nWhen robberies done improperly\nIt turns into murder one, one, one\nMove properly or get dropped, see\nCome at me wrong and you're done, done, done\n\n[Outro: Sean Price]\nAyo, Fif, I know what these niggas is, man. These niggas ain't tough, my G. Niggas talk 'bout they been in the streets. Yeah, you was in the streets, motherfuckers. You 'se a fuckin' human holst, nigga. You held the whole crew guns, nigga. Fuck outta here, man. You that nigga when I brought that vest I took you on the roof. Put it on your back, see if that shit work, motherfucker. You in the street, nigga. What the fuck was you doin' though? P!", "year": null}]}