{"songs": [{"year": "2009-11-10", "album": "2011's Freshman Class: The Mixtape", "image": "https://images.genius.com/6fdd82bef1bb980ec41bfc4de3a134c9.500x500x1.jpg", "title": "Don’t Understand", "lyrics": "[Verse 1]\nHis eyes bloodshot red\nI watched him as he took a fifth of Henny to the head in memory of his brother\nReminiscin' on them playing Sega with each other\nHe was hurtin', I could see it, plenty tears, no Kleenex\nI stood by his side because that was my homie\nGave him a hug, some of his brother's blood got on me\nClinchin' his fist on some angry shit\nStood up, sat back down on the curb and asked me who they be hangin' with\nI wasn't sure, so I gave him no answer\nBut I was sure that he had him a blammer and wanted war\nRevenge, what do you say to a good friend\nThat just lost it and grabbin' choppers out of the closet?\nI tried my best to make him re-neg\nBut he was like, \"My nig, this feelin' is more than personal\"\nI stood down\nHe hopped in a four-door Honda Accord\nBefore he bent the block, he said, \"K-Dot...\n\"...You wouldn't understand\"\n\n[Chorus]\n(These streets can turn a kid to killer in minutes\nNot by choice, but forced to be a menace\nCan someone just pray for me, oh woe)\nOr, at least, try to understand\n(The city pressure\nThe AK-47, twin MAC-11s\nThe Desert Eagle shotty and the Smith & Wessons\nPray for me, oh woe)\n\n[Verse 2]\nCorners become monuments for the dead\nCandles on the pavement, postcard read\nRest in peace, the yellow tape blockin' off the streets\nA baby mama yellin' at the police\nBut you don't understand\nYou figure that we're just a bunch of niggas but the picture here's a story untold\nSee, this wasn't in our plans\nBabies from the late '80s wasn't born crazy, we was raised that way\nPut that Malcom X book down, then raise that K\nComplete chaos when we off X pills and St. Ides\nLook the devil in the face, from a sane eye\nCast the spell on you like Akeelah and the Bee\nEvery killer in the street is a teen with a corrupted mind\nSubstance, time, is no longer an issue\nWe don't have it, so pass the tissue\nThen close the casket, kiss the momma when you can\nAnd tell her you understand, but you don't understand\n\n[Chorus]\n(These streets can turn a kid to killer in minutes\nNot by choice, but forced to be a menace\nCan someone just pray for me, oh woe)\nAnd, hopefully, you'll understand\n(The city pressure\nThe AK-47, twin MAC-11s\nThe Desert Eagle shotty and the Smith & Wessons\nPray for me, oh woe)\n\n[Verse 3]\nHe came back fifteen minutes later\nHe said, \"Dot, I went on one, do me this favor\nDump these guns in a safe place, let nobody see you\nThis as critical as it gets, my nigga, I need you\"\nI said, \"Alright, so what happened?\"\n\"Seen a few niggas slippin' and I just started clappin'\nI didn't care who I was hittin'\"\nThat's wild shit, but anyway, I got you\nI love you nigga make sure you hit me up by tomorrow\nI woke up the next mornin' with a cold\nAllergies got me sneezin' and wipin' my nose when it was leaking\nChecked the medicine cabinet, lookin' for some DayQuil\nBut all I seen was some Aspirin, s'just my luck\nI got up, went to Rite-Aid\nHopin' that the pharmacy department had the right aid\nI bought it and left\nWalked to the parking lot, that's when I seen the faces of death\nSaid they was lookin' for my man, with a chopper in they hand\nPrayin' it would jam, but you don't understand\n\n[Chorus]\n(These streets can turn a kid to killer in minutes\nNot by choice, but forced to be a menace\nCan someone just pray for me, oh woe)\nI'm tellin' you, do you understand?\n(The city pressure\nThe AK-47, twin MAC-11s)\nHuh? Do you understand?\n(The Desert Eagle shotty and the Smith & Wessons\nPray for me, oh woe)\n\n[Outro]\nIt's like\nIt's a revolving door\nThat I've been a part of\nMy whole life\nFucked up, right?"}], "artist": "Kendrick Lamar"}