{"artist": "Ice Cube", "songs": [{"title": "How to Survive in South Central", "lyrics": "[Intro]\nAnd now, the wonderous world of..\nHey, come to Los Angeles!\nWhere you and your family can have peace and tranquility\nEnjoy the refinement..\nHey Bone, hey nigga where you at though?\nHello, my name is Elaine\nAnd I'll be your tour guide through South Central Los Angeles\n\n[Verse 1: Ice Cube]\nHow to survive in South Central (what you do?)\nA place where bustin a cap is fundamental\nNo, you can't find the shit in a handbook\nTake a close look, at a rap crook\nRule number one: get yourself a gun\nA nine in your ass'll be fine\nKeep it in your glove compartment\nCause jackers (yo) they love to start shit\nNow if you're white you can trust the police\nBut if you're black they ain't nothin but beasts\nWatch out for the kill\nDon't make a false move and keep your hands on the steering wheel\nAnd don't get smart\nAnswer all questions, and that's your first lesson\nOn stayin alive\nIn South Central, yeah, that's how you survive\n\n[Break]\nHi, this is Elaine again\nAre you enjoying your stay in South Central Los Angeles?\nOr has somebody taken your things?\nHave you witnessed a driveby?\nOkay, make sure you have your camcorder ready\nTo witness the extracurricular activities on blacks by the police\nSo you and your family can enjoy this tape, over and over again\nThis is Los Angeles, this is Los Angeles\n\n[Verse 2: Ice Cube]\nRule number two: don't trust nobody\nEspecially a bitch, with a hooker's body\nCause it ain't nuttin but a trap\nAnd females'll get you jacked and kidnapped\nYou'll wind up dead\nJust to be safe don't wear no blue or red\nCause most niggas get got\nIn either L.A., Compton or Watts\nPissed off black human beings\nSo I think you better skip the sight-seeing\nAnd if you're nuttin but a mark\nMake sure that you're in before dark\nBut if you need some affection, mate\nMake sure the bitch ain't a Section 8\nCause if so that's a monkey-wrench ho\nAnd you won't survive in South Central\n\n[Break]\nNow you realize it's not all that it's cracked up to be\nYou realize that it's fucked up!\nIt ain't nothin like the shit you saw on TV\nPalm trees and blonde bitches?\nI'd advise to you to pack your shit and get the fuck on, punk motherfucker!\nAnd you'll get your ass straight smoked\nYo I wanna say whassup to DJ Chilly Chill, Sir Jinx\nAiy'yo Cube these motherfuckers don't know what time it is\nSo show these motherfuckers what's happenin'\nTell these motherfuckers, don't fuck around in South Central\nGod dammit!\n\n[Verse 3: Ice Cube]\nRule number three: don't get caught up\nCause niggas are doing anything that's thought up\nAnd they got a price\nOn everything from dope, to stolen merchandise\nWeed to sherm\nCause South Central L.A., is one big germ\nWaitin for a brother like you to catch a disease\nAnd start slangin ki's\nTo an undercover or the wrong brother\nAnd they'll smother, a out of town motherfucker\nSo don't take your life for granted\nCause it's the craziest place on the planet\nIn L.A., heroes don't fly through the sky of stars\nThey live behind bars\nSo everybody's doin' a little dirt\nAnd it's the youngsters puttin' in the most work\nSo be alert and stay calm\nAs you enter, the concrete Vietnam\nYou say, the strong survive\nShit, the strong even die, in South Central\n\n[Outro]\nYeah you bitches, you think I forgot about your ass you tramp-ass hoes?\nYou better watch out\nAnd for you so called baller-ass niggas, you know what time it is\nSouth Central ain't no joke\nGot to keep your gat at all times motherfuckers\nBetter keep one in the chamber and nine in the clip god dammit\nYou'll sho' get got, just like that\nThis ain't no joke motherfuckers\nNow I wanna send a shout-out to E-Dog, the engineer\nPuttin' his two cents in\n\nThis is Los Angeles", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg", "album": "Death Certificate", "year": "1991-07-09"}]}