{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nCome, get some, you little bum\nI take the cake but you can't get a crumb\nFrom the poetic, authentic, superior\nUltimate, and all that good shit\nI'm the original, Asiatic, acrobatic\nThere you have it, now get dramatic\nCreatin' drama when I'm on the scene\nAnd I pack 'em in mean, like Bruce Springsteen\nI profile a style that's mild and meanwhile\nPut on trial, a rap pile to exile\nMake you tumble and stumble, in a rumble just crumble\nAnd I'm still calm and humble\nYou need another helpin' hand to swing on\nI stand alone, but still you gotta bring on\nYour Batman and Robin, Cagney and Lacey\nStarsky and Hutch, but they still can't face me\nAnd if may make this one thing here clear\nThat's for you not to come near, period\nSo I ain't buggin' or delirious\nMy swift tongue's like a sword, that's how severe it is\nAnd I can slice and dice a Fisher-Price MC\nThat thought he was nice into Minute Rice\nSingle-handed, I ain't with that band stuff\nCause Cee'll scratch a record like flakes of dandruff\nAnd the mic I ravage, not like a savage\nBut in my own way of doin' damage\nAs I design the genuine line\nNow who flattop rules in eighty-nine?\n\n[Hook]\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\n\n[Verse 2]\nTake two other men with soul that you probably know\nDeadly as Scarface, but bright as the Cosby show\nDon't attack rappers, but make everyone hush\nThey step to me, but can't stop the bum rush\nI make material, rich and imperial\nThe unique technique I speak is all original\nYou like to sag and drag and gag\nSame old same old, but papa's got a brand new bag\nSo put the mic down boy, you can't work it\nDue to wack lyrics, it's bout to short circuit\nSo toss the sauce across to the boss, no remorse\nYou lost, with force, of course, a holocaust\nFirst I caught ya, then put ya through torture\nYou moved wrong my son, so I taught ya\nJust like a guardian, that put your body in\nThe mood to groove with the smooth way that I'm partyin'\nCompetition may find it spectacular\nScheme and fiend to take a bite like Dracula\nAnd waste the taste, cause ain't no sugar here\nSo come near if you dare, you Booger Bear\nYou start hallucinatin' like magic\nThe wrath gets tragic, but Kane won't have it\nCause you tried to juice me when you're bluffin'\nSlowed the pace, so I had to start rushin'\nSo pick a B.C. date, cause you're history\nHere comes Kane, Scoob, Scrap, Jay, and Mister Cee\nAnd this is one thing to us we ain't new to\nThe crew'll cast a spell on the crowd just like voodoo\nI'm the man you can't hold back\nAnd all competition appears to be weak\nI meant to say wack, a vision of blur\nJust them thinkin' I'm competitin', I say, \"Huh!\"\n\n[Hook]\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\nWarm it up, Kane, Warm it up, Kane\n\n[Outro]\nGenuine for eighty-nine, you know what I'm sayin?\nAs I give a shout out to my man Tony A\nTony P, Sally Sal and the whole Libra Digital posse\nCan't forget my man Yawnski\nAnd Smooth the Barber, you know what I'm sayin?\nAlso, I gotta say whassup to Born True, B-Boy\nAnd my man big Jay-Z\nThe whole rest of the crew, Scoob Lover my brother\nScrap Lover, and DJ Mister Cee\nCan't forget Supreme, Abu, MelQuan and Shabazz\nWally D, and the rest of the brothers\nAnd of course my little brother the Little Daddy Shane\nMandatory end of the story, you know what I'm sayin?\nPeace!", "image": "https://images.genius.com/06e69f1194027f164447cea292b22dcf.442x450x1.jpg", "year": "1989-09-19", "title": "Warm it Up, Kane", "album": "It’s a Big Daddy Thing"}]}