{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "Super Nigga", "year": "1995-03-28", "album": "IV Life", "lyrics": "[Hook 2X]\n(Super nigga)\n(Soop...Super nigga!)\n(Look...up in the sky!)\n\n[Verse 1: DJ Pooh]\nIt's the P-double-O-H in the sky\nI don't need a cape cause I'm already fly\nLike a skydiver, a nigga got drag\nLike a race car driver, plus I'va\nSpit saliva, liver, than McGyver\n(\"BAM!\") Bump mo' bitches than a drunk driver\nFaster than a crackhead, mo' powerful\nThan a loco when I gotcha in a chokehold\nI'm here to rid the city of them wack-ass groups\nThem wack-ass lyrics with them wack-ass loops\nThey fakin like gangsters, turn into a Crip-tonight\nThey don't faze me, cause we can still fight\nBut look, it's all about comin (up) up (up)\nUp and away without bummin\nBut a nigga don't need no Wonder Woman, hmm, I wonder\nWho she been shuckin and jivin and fuckin\nOr some bitch named Lois cause the hoe is the lowest\nAnd she's whiter than Snow is (\"Too much of that Snow White!\")\nI think I'll fly back to the hood\nKick it with the homies where you know it's all good\nI'll be the first superhero with a strap\nI know I'm all that.. (\"It's a crow, it's a bat, no it's..\")\n\n[Hook]\n\n[Verse 2: Rashad]\nThe Super Nigga Boogieman is out to make a killin\nSo fuck wastin time leapin over tall buildings\n'Cause I can get loose like fluid\nLike diarrhea - I can, run right through it\nI see through walls, especially at the malls\nLadies dressing rooms is where my duty calls\nA lot of super niggas be trickin they powers\nGivin hoes money, and flyin 'em flowers\n(But can you think of one thing you ever gave a hoe?)\nNo cause we Super Niggas, not Captain Save-A-Hoe\nSo back on up look, I'll catch yo' ass so quick\nAnd letcho' ass know we the wrong super niggas to be fuckin wit\nI flash like lightning, powerful as bombs\nI flied back twenty years ago and fucked your moms\nAnd now it's '94, ain't shit changed\nBut now you call me daddy, when you call my name\nCause youse a silly mortal, you ain't down for combat\nI'mma Super Nigga, and you an Uncle Tom cat\nWhen I'm rollin through the hood they wonder is he\nThe nephew, of Aunt Kizzy\nOr Dizzy Gillespie, and the rest be like\n\"That's the guy that's super, the fat track looper\"\nSo wack MC's come step to these nuts\nAnd get your crews cut below half, nigga do the math\nI'm the M-A-N, mayne\nI got a fly bitch with an invisible plane\nMe and her be doin some X-rated shit\nWhen I get the skins, in the cockpit\nShe be callin everything from mommy to Jesus\nJust ask the homies, 'cause them niggas can see us\nCause them super niggas too, from the crew\nSo please stay tuned, for more adventures of.. a Super Nigga\n\n[Hook 4X]\n\n[Verse 3: King Tee]\nMr. Insane King Tee motherfuckers from the boondox\nI bust the drunken style on my corner with the boombox\nI'm badder than the baddest inmate at Biscailuz\nRetarded, but let me show you what this can do\nCreate fright, niggas scared to touch the mic\nI shock 'em, amazed cause the wino rocked 'em\nThe best yet to like really catch wreck on the scene\nO.G. from the Alkaholik team\nI just scream (AHHH!) let my backbone slip\nGotta get it on then take another sip\nMake it hit, a feeling MC's won't forget\nBust crazy rounds then load another clip (well bust it)\nLike R. Kelly, \"My mind's telling me no!\"\nBut fuck that, I kick the ill flow\nAnd deep down, I know niggas is jeal'\nCause I'm pullin all the hoes and dickin 'em swell\nBut hey, cut the crap, 'cause like herpes I'm back\nTo give you what you want, I don't front or skip rap\nWith the bo, ba-ba-bye, the wicked with Tha Likwit\nI'm wild like a winner with the lot-to ticket\nBut kick it, you could grab a comb and try to pick it\nThe nappy head sound comin from the underground\nOh shit it's the great, the man with the strap\nI know I'm all that.. (\"It's a crow, it's a bat, no it's..\")\nSuper nigga..."}]}