{"songs": [{"album": "Killer", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg", "year": "2008-07-01", "title": "Crybaby", "lyrics": "[Intro]\nYo Tech what you feeling on the state of hip hop?\nAnd is hop hop still alive or dead?\nI mean I love the state of hip hop right now you know [?]\nI love it and I think hip hop is very alive you know I'm sizzlin'\nWhatever you got brothers and sisters you know I'm sayin\nComin' up out of poverty, you know what I'm sizzlin'\nDoing something positive like music, you know I'm sizzlin'\nAnd making money I mean you know what I'm sayin'\nI mean where is the motherfuckin' death in that?\n\n[Verse 1]\nI was born in 71' in Kansas City, MO\nMy mama was a heavenly one, so the fam was pretty slow\nWhen it came to rap and R&B and plenty more\nCheck it, if it wasn't no gospel, apostle\nOr written in the Bible, then it go\nSo when they tell the baby don't do something\nIt end up doing it anyway\nLike, don't listen to rap, it's the evil music of today\nBut, I really fell in love with the sound\nThat was coming out from the East Coast\nSo we got it and twisted it up a bit\nNow the industry's having a heatstroke\nSome say that rap is dead\nBut when I get the white, black and red\nAnd jump on the tour bus, do 58 shows\nThen I'm back with a big black sack of bread\nCan't believe that that was said, 'cause I'm here with a stack of fed\nAnd I got it from rap/hip-hop or whatever and I did not have to beg\nSo, here I stand, the mic in hand with my rap attire\nAnd I like my fans spending grands 'cause we got the fire\nI merchandise like 5 G's every half an hour\nAnd you cry like a baby so your mic must been your pacifier\n\n[Hook]\nWhen I read the magazine, them rapper's sounding like\nWAH-WAH-WAH, crybaby\nWhen I see them on the TV, them rapper's sounding like\nWAH-WAH-WAH, what you crying 'bout?\nWhen I read the magazine, them rapper's sounding like\nWAH-WAH-WAH, crybaby\nWhen I see them on the TV, them rapper's sounding like\nWAH-WAH-WAH, what you crying 'bout?\n\nIf it's negative, I don't wanna hear it\nEliminating player haters with their evil spirits\n\n[Verse 2]\nI hear 'em talkin', they mad at Smurf and Soulja Boy\nThey hating big in the magazine and don't even know the boys\nI know the ploy, washed up rappers wanna attack people\nRun up to the car, pull out the Mac Lethal\nMan that's a problem with the black people now\nWhat ya need to know is that, in the world there's a lot of dough to stack\nAnd the ones that wanna hold us back ain't been outside their cul-de-sac\nEvery nigga I know is strapped, rip shows that'll blow ya back\nBut notice that, I can put it right downwards where the shoulders at\nHating on the south? Why? Trippin' off them chips they got\nYou don't like that it's screwed and chopped\nBut you wanna get off in they pot\nWanna be MC, you talk a lot, up in the spot and you hot\n'Cause their 84's be poking out, what the hell is you cryin' 'bout?\nEverybody wanna be killer but not for realer\n'Bout the method of making money you gotta get the milla\nBy doin' it like I do it, do the work and believe in it\nWhen you do it to the fullest ain't no problem achieving it\nWhen I was broke, homie I went for mills\nGot on the mic with the intent to kill\nStronger than ever, and you a gimp for real\nI drink Caribou Lou, and you drink Enfamil CHUMP\n\n[Hook]\nWhen I read the magazine, them rapper's sounding like\nWAH-WAH-WAH, crybaby\nWhen I see them on the TV, them rapper's sounding like\nWAH-WAH-WAH, what you crying 'bout?\nWhen I read the magazine, them rapper's sounding like\nWAH-WAH-WAH, crybaby\nWhen I see them on the TV, them rapper's sounding like\nWAH-WAH-WAH, what you crying 'bout?\n\n[Verse 3]\nYou should be clapping when folk make it up out the ghetto\nOr trailer park, it don't matter even if he black or if he guerro\nBut you don't know how to be manly\nInstead of a Timberland, you probably in a stiletto\nBetter yet in a baby shoe, jealous or maybe you\nSick of me 'cause I'm making dinero\nAnd you don't wanna get clapped at\nYou want a standing ovation? I thought not!\nYou say you better than rappers on radio, man that's false chop\nTry to run up on me, 'cause a Benzo will never be in your car slot\nTry to step up on the scene, my infrared beam's right at your soft spot\nIf you was on TV and balling you wouldn't groan and trip\nHe'd keep hatred, envy, and bloodshed on his lip\nTech got long cream with chrome things on his whip\nHe wanna stone Nin' with a chrome thing on his hip\nBut just know your hip will not stop the hop\n'Cause when you look at the big picture, my block pops a lot daily\nSo keep on thinking my Guac stops the shots\nAnd I can quickly bury you in your Osh Kosh B'Gosh, baby\n\n[Hook]\nWhen I read the magazine, them rapper's sounding like\nWAH-WAH-WAH, crybaby\nWhen I see them on the TV, them rapper's sounding like\nWAH-WAH-WAH, what you crying 'bout?\nWhen I read the magazine, them rapper's sounding like\nWAH-WAH-WAH, crybaby\nWhen I see them on the TV, them rapper's sounding like\nWAH-WAH-WAH, what you crying 'bout?\n\n[Outro]\nI am one of them Mcs that\nHater I can congratulate\nHaters need to go get theirs, 'cause I'm getting mine youknowI'msaying"}], "artist": "Tech N9ne"}