{"songs": [{"title": "Veterans Day", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nUh, brandUn DeShay\nYeah\n\n[Verse 1: brandUn DeShay]\nThis is better than I imagined\nMy future looking so good, it could be a fashion\nMy future looking so good, it could win a pageant\nSomeone give it a sash and send it down the runway, everybody is clapping\nApplause, applause, leave them with no words\nThey speechless, got a leg up like them showgirls\nThey swear they gon' make it, they talking, they so sure\nBut they ain't got the drive like me, they chauffeured\nNo duh, 'cause I'm the one and the only\nYou don't like me? Pretend I'm hot food and blow me\nLeave me alone like an island, [?]\nYou do it for the homies? I do it for the honeys\nYou do it for the money? I do it for the mamís\nI'm selfish, what you want from me?\nI just made 20, so I'm still a rugrat like Tommy\nBut it's better this way\nStill a rookie, but we celebrating...\n\n[Chorus: Charles Hamilton & brandUn DeShay]\nVeterans Day\nAnd everybody know who I am, even though I'm pretty sure you don't\nVeterans Day\nGive me love I deserve, pretty sure I'm pretty sure you don't\nVeterans Day\nIt's 11/11 again, it's 11/11 again\nIt's 11/11 again\nThe day after my birthday is\n\n[Verse 2: Charles Hamilton]\nMaybe I'll be the greatest alive the day that I die\nHatred is fine, I cannot wait for the time\nI drop album after album\nAnd you sit in the studio, realizing you're wasting your time\nThe game isn't mine; the motherfucking console is\nCharles Sega, Carl Sagan, on some Cosmos shit\nGet hated by those who do not know shit\nThey pot roasting my lyrical osmosis\nI gotta fight to be one of the individuals\nI got a right to be someone none of you niggas know\nI sit at home, I'm trying to keep my sanity\nWanna nut in my girl so I can feed my family\nWanna smoke a pound of haze, blow an ounce of yay\nOverdose, but I know I told you folks I found a way\nOut the caves that my mind designed\nSo you don't mind, I don't, it's my time to shine\n\n[Chorus: Charles Hamilton & brandUn DeShay]\nVeterans Day\nAnd everybody know who I am, even though I'm pretty sure you don't\nVeterans Day\nGive me love I deserve, pretty sure I'm pretty sure you don't\nVeterans Day\nIt's 11/11 again, it's 11/11 again\nIt's 11/11 again\nThe day after my birthday is\n\n[Verse 3: brandUn DeShay]\nThey say 'cause I appeal like a orange, all the girls got a crush on me\nNever been bullied, but everybody pushing me to greatness\nSo all of that hating don't mean much to me\n'Cause ain't nobody touching me, molesters get custody\nAnd they try to question me, thinking I'm the shit\nI ain't shit, I'm trying to change the world before I split\nSee? Now, that's the problem: cats got these one-track minds\nAnd I got a whole album for mine\nI heard they out the box, these boys is out of they mind\nNo cuts, no buts, no coconuts, they out of the line\nThey best to head to self-checkout\nTrying to stand up to these vampires, they biting\nWelp, you shouldn't have stuck your neck out\nReally thought he need to smoke, the way this nigga stepped out\nTreat him like details, always getting left out\nNah, I ain't never lift, but I got a rep now\nFrom Chi-Town, so I gotta rep now, best out\n\n[Chorus: Charles Hamilton & brandUn DeShay]\nVeterans Day\nAnd everybody know who I am, even though I'm pretty sure you don't\nVeterans Day\nGive me love I deserve, pretty sure I'm pretty sure you don't\nVeterans Day\nIt's 11/11 again, it's 11/11 again\nIt's 11/11 again\nThe day after my birthday is\n\n[Outro: brandUn DeShay]\nVeterans Day\nVeterans Day\nVeterans, Veterans Day", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}