{"artist": "Petey Pablo", "songs": [{"album": null, "title": "Raise Up (USA Flag Remix)", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "In the time of need\nWhen the world has gone through so many changes\nSo many ups and downs, so many obstacles\nSo much confusion\nI take it upon myself as one bein of the new leaders of hip-hop\nTo make a change, and bring it to the forefront\n\n[Chorus: repeat 2X]\nU.S.A.!! Come on and raise up\nTake the flag, put it in the air, spin it like a helicopter\nU.S.A.!! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who, us, us, us, yes sir!\n\n[Verse 1]\nSay it loud, United States of America\nTime to put it down and do it like this\nNow fight for somethin that's worth it (uh)\nI'm a country boy, never really cared before what was goin on\nNow that it came a little closer to home\nI got a couple more buttons make somethin go uh-uh\nEverybody get strapped\nIf you gon' get it let's get it if you ain't then get back\nBig fella, who dat\nAll the people around the world that's why we get through that\nFort Jackson, Fort Bragg, Camp Jude and David (damn!)\nPensacola, Parris Island, troops over here, Seals over there\nFort Dix, Fort Lee, Pearl Harbor (let me think)\nThe Army(ARMY), the Navy(NAVY), Air Force, Marines(RINES)\nGreen Beret, Navy Seals, New York Police\nEven got me dressed in Army fatigues, how ya love that\n\n[Chorus]\n\n[Verse 2]\nYou remember them days y'all\nWhen the teacher told us\nAbout World War I and World War II, now the time has come\nFor us to REP OUR COUNTRY!\nWave the flag strong\nAnd could somebody tell Mr. bin Laden\nHe got a lot of people lookin for him\nMy house, my home, my hood\nMy brother, my sister, my cuz\nLand of the free, home of the brave, it's the land I love\nI had to bring it up, ask Peter Bare if I could change it up\nNow I really got the whole world raisin up, come on!\nAnd sing with us\nRaise up(Raise up!) Raise up(Raise up!) Raise up(Raise up!)\nFor that star-spangled banner\n\n[Chorus]\n\nThank you Petey Pablo\nCause if we don't stand for somethin\nWe're bound to fall for anything at all\nSteph Lova reporting live from the front lines\nSending lots of love and prayers out\nTo everybody from every corner of the Earth\nWho lost a loved one, a homie, a friend\nI'm talkin about a mother, father, sister, brother, even a cousin\nOn September 11th, we miss you, and we love you\nAnd we will never, ever forget\nNow..\n\n[Chorus]", "year": null}]}