{"songs": [{"title": "A-Plus (Remix)", "lyrics": "[Intro: Young Dolph]\nA-Plus\nThug nigga get your cake up\nWe're smokin' on that A-Plus\nUuuuh, uuuuh ...\nThick bitch with me got that A-Plus\nYeah, it's Dolph\n\n[Verse 1: Young Dolph]\nI'm flyin' through the city in a 2 seater\nRunnin' red lights pourin' up syrup\nThick bitch with me poppin' pain killers\nI'm smokin' loud A.K.A. that brain killer\nBought a house in the hood to sell kush there\nFive Franklyns for my Prada footwear\nMy family infested with dope fiends\nGuess it run in my jeans cause I'm sprung on Codeine\nThe bad bitches show me love, the broke niggas hatin'\nSnitches tellin' on me got the Feds investigatin'\nThe illest nigga in my city nigga, straight up\nThese lil' niggas midgrade, Dolph A-Plus\n\n[Hook]\nFirst thing first when I wake up (What you do ?)\nI brush my teeth and roll a blunt of A-Plus\nPlus you sold Kush he make you wanna lay us\nI told lil' mama, bitch you got that A-Plus (A-Plus)\nA-Plus (A-Plus), A-Plus\nShe off the chain with it, I gave her a A-Plus (A-Plus)\nA-Plus (A-Plus), A-Plus\nI pull up with the calculator, I'm servin' A-Plus\n\n[Verse 2: Gucci Mane]\nSince a pup, I been running with them thug niggas\nFrom the 6, it's a land full of drug dealers\nYou say you scared of what? You better be scared of us, nigga\nFuck a entourage -- bricks all on my bus, nigga\nI bought a mansion in the hills to hide dope there\nI love sun valley, but there really ain't no hope there\nI bought a condo and I do not have no clothes there\nWe don't fuck hoes there, don't do nothing but cook O's there\nSeventeen years old, and I got ho fair\nPolice catch me, they gonna strap me to that old chair\nI'm paying twelve, 'bout to sweep it under the rug, nigga\nLooking at the mirror, looking at the plug, nigga\n\n[Hook]\n\n[Verse 3: Young Dolph]\nI called my plug and spent a hundred on some A-Plus\nMy bitch one hundred, that mean she A-Plus\nGave her a stack just for her weave and her make-up\nShe quick to tell a fuck nigga, get your cake up\nWho the fuck you think she got it from? She Dolph girl\nI'm counting money while she loading up the Mossberg\nSeventy racks on my old-school, got a Challenger on my left wrist\nEverything I got came from me pumping A-Plus in South Memphis\nY'all know how I get down\nIn the trap going pound for pound\nI got a little toy that hold a hundred rounds\nDolce belt, Gucci shirt, and a stupid-ass pair of D squares\nI'm mismatching, but what the hell?\nI'm in Ruth's Chris with your man there\n\n[Hook]", "album": "Blue Magic", "year": "2012-11-14", "image": "https://images.genius.com/49b18391f82fda676c035c0106af9fb2.500x500x1.jpg"}], "artist": "Young Dolph"}