{"songs": [{"year": null, "title": "Can-U-Feel-Me?", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir\nAlbum: Boxcar Sessions\nSong: Can-U-Feel-Me?\n\nI'm cruisin, I'm losin money on gas\nI pass a car with a star in it, I stare\nFor a minute, but that's the limit\nOtherwise gas won't be the only thing\nI'm losin' money too...ooh wee! It's\nTuesday, two days after the weekend\nImagine if the weekend was a day for\nWeak minded men - anyway\nI re-take my train of thought, I bought\nA fat sack and I'm happy cause I got nappy\nSoldiers in my crew, ya through, if\nYou don't learn so I learnt, that I'm burnt\nI ran into my homie, yeah wassup?\nAt least I thought he was, but then I caught\nThe buzz that he was talkin behind my back\nFrom his girl, ain't that Earl? For\nThose who can't feel me, Earl means wack\nIn fact, I had that problem a few times\nBut I'll just splurge it in a new rhyme, then forget it\nMaybe I'll split it in half, or laugh like this...\nHa ha ha... can u feel me?\n\nI faked the funk, and conversated without a doubt\nHe was a chump, but with clout, I ended my route\nAt the liquor store and I tried to\nBuy a Guiness Stout, but I remembered it was nasty\nBut fools drink it cause it's a hip-hop classy\nYou can miss me with that trendy drink\nCause they, all make your breath stink, plus\nDeath is linked to all alcohol that Arabians won't let you buy\nThey keep tellin me my identification is a lie\nWhy would I, put my face on plastic and in the space\nWhere it says birthdate put \"see owner\"\nFool, I'm a teenage organ donor\nSo I pick up my I.D. I ain't trippin - why?\nCause I'm high, already, on life\nOnce again - I'm riding\nI'm about to hit the eastside of Oakland\nI got my seat belt on so when the heat's felt\nFrom 5.0, I'll turn up the song and start\nSinging, \"I wish police was a lease\nThat was up\" Can u feel me?\n\nWell it's gettin dark, but it's daylight savings time\nClocks go back, but I stay focused and\nAhead cause I wanna be fat, can u feel me?\nIf you rap I like to fully flex, I like to box\nI like breakin bullies necks\nI like collecting checks and collecting respect\nBut I'm not there yet and until then I'll just sell dank - sacks\n20's, 10's, I'm drivin the weights to be\nPrepared in case I meet my fate and I'm always\nThinking, \"Where will I go when I die?\nWill I be underground like I am now\nOr in the sky?\" My man plan B is smilin\nCause he can feel me, wassup Jess", "album": "Boxcar Sessions"}], "artist": "Saafir"}