{"artist": "Fat Joe", "songs": [{"year": "2001-12-04", "album": "Jealous Ones Still Envy (J.O.S.E.)", "image": "https://images.genius.com/4a7618aab6a23480b8790a58ffad66c8.1000x1000x1.jpg", "lyrics": "[Talking]\nAiyyo Crack, these niggas is playin mad childish games\nNiggas act like it's a rap..\nYeah it's a rap, for y'all motherf-rr-uckers\nNiggas replacin the 'G' in gangsta, with PR's and W's\nPranksta wanksta-ass niggas\nYou know roses on caskets of those that oppose the squadus\nFuck tri-borough, we reppin five borough\nGet at these niggas straight music!\n\n[Fat Joe]\nYo, Friday night, woke up in a cold sweat\nI can't believe niggas schemin on Jo-seph\nNah man, this ain't the way it's goin down\nNiggas talk too much shit, and I jump like the sound\nThey fear my presence like the rest of them\nJose's the bettin informer, flesh-n-blood like the president\nNow maybe I'm a target on the pedastal\nGot a little fame now, niggas wanna harm me for my revenues\nStart ya little beef, that's the shit I love to eat\nI been a soldier, you a son, be a humble seed\nMy own niggas let them hoes make 'em envy\nPosin like they friendly when I'm knowin they resent me\nThat's the shit that get me aggrevated\nIt be the same niggas in ya face talkin bout \"I'm glad ya made it\"\nFake niggas.. Jers' State niggas..\nFunny how cake can make ya learn to hate niggas\nYou've now tuned in to the sounds of Jose\nWhere we push sex, money, drugs, and violence all day\nMostly heard in penals and project hallways\nAnd by niggas blowin trees out the back of O.J.'s\n\n[Hook]\n(J) These jealous niggas is worse than bitches!\n(O) The ones that get knocked is bound to turn snitches!\n(S) Still talkin shit, still ain't shit!\n(E) You envious niggas can suck my dick!\n\n[Talking]\n(J) Hahaha, ohhh, now y'all feelin the kid\n(O) Yeah nigga, South Boogie ain't goin nowhere\n(S) Don Squad-agena, Terror Squad that is\n(E) Blaze niggas over beats, in the streets\nJoe Crack gon' hold that down\nYou seen the kid up in the clubs; BET, MTV\nOn yo' block, on my block, however you wanna fuckin slice it\nBastards, POOF!!\n\nUh.. uh.. uh.. uh..\nUh.. uh.. uh.. uh..", "title": "J.O.S.E."}]}