{"songs": [{"lyrics": "[Action Bronson]\n\n[Verse 1]\nI might be chubby but I'm gorgeous in the face\nThings are going well hope I don't catch that fucking case\nI could get on some other shit and send you to that place\n50 for the shooter, 100 for my steak\nYour life ain't worth a steak. I keep the rifle in the cape\nTo be on top with the title be my fate\nDon't make no mistakes\nMami, you see me - everything's a movie\nI jump in the jacuzzi with that green Coogi\nThe plane lift up, just like that batty boy chain lift up\nCrimes committed with no hiccups. (AHHH)\nThat thing-thing shred your stomach like sit-ups\nYou'll never sit up or shit from your butt\nThey say I'm crazy and deranged but, fuck, I can handle that\nI crack the whip right from the camel's back\nMy head is wrapped like Yasser Arafat\nAnd I don't sleep no more, it's only fucking power naps\n\n[Verse 2: Acapella]\nIt's so easy to just be looked over\nI never look sober\nLook through the eyes of a soldier\nI look fly in the rover\nLions and cobras\nKeep the iron in the toga\nSend a message - leave you lyin' over\nBitches crushin' on the kid so now they flyin' over-\nHalf of the world to get wrapped in pearls-\nJust like the Queen of England\nI stay wavy\nMercedes color - Wayne Brady\nIt's me baby\nPlease baby\nAin't nobody takin' my spot, that's on my mother's kid\nCross my heart and hope to die, that's on some other shit\nThis motherfuckin' kid be coveted\nDifferent types of silks is what I'm covered with\nBaby I'm lovin' it\nYour boy is hotter than an oven mitt\nIf I was broke then you'd be running your shit\nPoke your kidney with the knife I cut the onion with\nAnd poach your kidneys with some onions and shit\nIt's me\n\n(Ayo I never been the plaintiff. Ever. What what what. Hahaha. I dont fuck with this I'm done.)\n\n[Verse 3: Acapella]\nMy lawyer tackled the case like he played for the Ravens\nSo I stuff him with cheese like a Danish\nDamn, I crave paper\nCatch me later at the Laker game, I bet a grip on the Knicks\nCarmello sweatin' on my kicks, cause I'm courtside-\nThis time the good way\nI'm a free man, that's what I should say\nNobody holdin' me back except myself, that's what I feel like\nPeelin' the 5, now I'm feelin' the vibe\nHand on the wheel, drugs in my eyes, money in my mind\nI think about it all the time\nCause there was a time I never had shit\nNow I got shit, it's like magic\nAll these cars in front of the crib look like a Porsche pageant", "title": "Hot 97 Freestyle (8/7/2014)", "album": null, "image": "https://images.genius.com/4c92d833aae01e64b71a556bb1cb9f0b.990x660x1.jpg", "year": "2014-08-07"}], "artist": "Action Bronson"}