{"artist": "Fashawn", "songs": [{"year": "2015-02-24", "album": "The Ecology", "image": "https://images.genius.com/5ad462cd1ac1f9a505d5e0408eceecef.600x600x1.jpg", "lyrics": "[Intro]\n(Yeah, uh, hit me!)\nWhat Up, Ex?\nAyo I just wanna talk about something real quick\nThis one right here, it's kinda like- it's kinda like a love song, you know what I'm sayin?\nIt sorta hurts though\nBear with me... check it out\n\n[Verse 1]\nRaised three snotty-nosed kids on your own\nWe never had a house, we always had a home\nAt least when you were there, half the time you was gone\nI tried to cook my own supper, burnt my hand on the stove\nI had clothes, what I needed, but never what I wanted\nFirst day of school I stunted, cause you went out and hunted\nGot me the latest toy, and no matter how old I get\nI'm still your baby boy, somehow you stayed employed\nAnd never worked a 9-to-5, and never wondered why\nBlack queen, crack fiend, all the while you was high\nHardly ever wiped my tears, never let you see me cry\nNot one man in the house, so that spot I occupied\nHow could I not acknowledge your work?\nA Mason jar used to steal the dollars out of her purse\nIt breaks my heart to see you struggle with your addiction\nAnd still I care for you\nDespite all of the drama, I'll always be there for you\n\n[Hook] x2\nYou are\nEverything and anything to me\nLittle lady, can't you see?\nYou are\nYou're my momma, and I'm your son\nThank God, cause he only gave us one\n\n[Verse 2]\nYou remember that night, I took your glass pipe\nThrew it against the street light, you probably might\nI thought saved your life, Tasha called CPS, big sis was fed up\nWith her mama, tried to visit, but they usually didn't let her\nLife could have been worse and life could have been better\nLoved her unconditionally, since the day that we met her\nAt the parent and teacher meetings, you might have never seen her\nStill, she gave me life, guess that's why they call her Vida\nI been to two of your weddings, none of them guys still around\nHow can I mirror that, how could I let you down\nEven though you left me home alone for nights at a time\nI'm shedding tears as I'm reciting each line\nApparently, it's never too young to become a parent for some\nHad me at 15 going on 21\nHad an older sister even had an older brother\nMet a lot of men and women but there's no one like my mother\n\n[Hook]", "title": "Mother"}]}