{"songs": [{"year": null, "image": "https://images.genius.com/13aca1a0803c515646f80b95792b028e.611x475x1.jpg", "title": "Conscious Effort Freestyle", "album": "Week of K.R.I.T. ", "lyrics": "[Verse: Big KRIT]\nEarly like the mornin', yawnin', wipe the crust from my third eye\nTo peep the true intentions of buzzards\nFlock and chirp like they're lovers, but pull their talons in public\nScratch you out like the lotto, these niggas hoes for the ducket's, I swear\nCause money make niggas change like dollar bills\nSeen it once or twice, nigga blocked your life, that shit for real\nBrutus came through thrice and he murked out Caesar after all them years\nNow what makes you think your shit don't stink and you won't get killed\nCause always someone riding, rolling their eyes\nAt the fact I'm a king and I'm so modest about my rivalries from\nOther kingdoms, it's such an oddity that being humble could be a sign of weakness\nWhen they know that I know that I body them so\nWhy waste the cavalry? No need for casualties\nWhen niggas know that their time is up, like what the fuck they rhymin' for?\nWhat these labels signing for? It's hard to find it comical\nCause this ain't Saturday Night Live, no adlib, no high five, just chess moves\nI wreck that shit, never peck that shit, bitch, how dare you?\nI'm my only competition, there's no one else to compare to\nUnless it's Zeus or Thor\nOr a mystical creature that only eat beats and emcees so feed me more\nI wonder if all this hard work really gonna pay up\nWhile laying up in the villa with broads that's dying for me to slay on\nNot even tripping on blog sites 'cuz they draw light to them haters\nCould let a nigga tell it, them niggas is jealous comment on my flavors\nFavors, shit I don't do them hoes lately\nBig frontyard, big backyard, have 'em send smoke signals to my neighbors\nGot a driveway around my way, you a quarterback throwing papers\nI ain't worried 'bout no jack boy, these white folks pullin' capers\nWhere I stay and I bet they think I'm a dopeboy\nCause I walk that way, and I talk that way to them folk boy\nSit my rims on the curb, Captain Phillips couldn't sail where I float, boy\nWas a hustler at birth, I could sell Mr. Clean some soap boy\nBeen a while since I feel like talking that shit\nOver-confident, common sense, commonly that we get\nHonesty is a commodity, similes ain't my shit\nI could say it's popping for sure, you probably think I'm frying fish\nMaybe I was, ho\nCause dropping a boombox in your bathtub was the only way you could buzz mo'\nAnd yeah, that's cutthroat\nBut it's slice her neck or cut a check\nIt ain't my shit if It ain't wrecked\nIt must be y'alls if it was stepped on\nYo bitch a freak, fucked her to sleep\nAnd that was the last time I was slept on\nShit, I woke up and fucked her again so she ain't sleep long, nigga"}], "artist": "Big K.R.I.T."}