{"songs": [{"title": "Zeltron 6 Billion", "year": "2017-06-13", "album": "13", "image": "https://images.genius.com/e6f2b682ea65efb7cf891c34be2322a4.1000x1000x1.jpg", "lyrics": "[Intro]\nUltimate, ultimate, ultimate, ultimate, yeah\n\n[Verse 1: Denzel Curry]\nWelcome to the cellar, propelled into a realm\nSo then you meet me at the helm\nLike Del—so, you could know that I'm funky as ever\nLike Zero, the pain is down to hill, my brain is made of steel\nI crash into your soldiers like bricks thrown by Shaquille O'Neal\nThe coldest flow in the snow globe, my nigga, I'm lost in frost\nI never went to college, don't even listen to Asher Roth\nSometimes I'm a butterfly, most times I feel like a moth\nKill my insecurities because they tried to make me soft\nKill off, you and your posse, if you cross me\nHave you so shook you wouldn't even want to cross streets\nPardon me—niggas be Madison Square-guardin' me\nYou could be a statue and you still won't be as hard as me\nFuck the industry, I only worry about my artistry\nHard to see, R.I.P. my older brother, Lotto Tree\nDawg, I'm murdering everything inside my allegory\nCome back from the dead, I'll smack you to purgatory\n\n[Chorus: Denzel Curry]\nBecause you cannot fuck with Zeltron 6 Bill-ion!\nYou lookin' at my zoom, my shit is Sicil-ian!\nY'all lookin' at my bitch, my bitch is Brazil-ian!\nI'm finna run through to the city and kill shit!\nBecause you cannot fuck with Zeltron 6 Bill-ion!\nYou lookin' at my zoom, my shit is Sicil-ian!\nY'all lookin' at my bitch, my bitch is Brazil-ian!\nI'm finna run through to the city and kill shit!\n\n[Verse 2: Lil Ugly Mane]\nWho else but Ugly Mane and Zel could rock it so funky as hell?\nWe got it locked like a prison, got 'em twistin' on them D's watching\nSpeaking facts like 360 degrees drop it\nWisdom, you think you mobbin' but you isn't\nMiami back to Richmond back to Cali\nThey gon' find your body in the alley\nUgly still the ugliest, Ugly still destructive\nI'ma lay you down underneath the ground if you fuck with this\nHead up in the clouds when the dutch is lit, puffin' it\nI be acting foul for the fuck of it\nLately it's a lot of days I feel hopeless (fuck it)\nIt's a lot of days I'm feeling like I'm drowning in the ocean\nPut your hands on me and your hands gettin' broken\nWhen I hit the scene, it's like a goddamn explosion\nFind me out surrounded by some shooters, they be young and old\nPiffing looking crispy I got origami money folds\nUgly Mane, bars played, that blood in my veins be running cold\nRunning the game I be unopposed, short fuse, don't cut it close\nUgly Mane, bars played, that shit I spit be so morose\nYou better watch your mouth playa, I hit you with that lethal dose\n\n[Chorus: Denzel Curry]\nBecause you cannot fuck with Zeltron 6 Bill-ion!\nYou lookin' at my zoom, my shit is Sicil-ian!\nY'all lookin' at my bitch, my bitch is Brazil-ian!\nI'm finna run through to the city and kill shit!\nBecause you cannot fuck with Zeltron 6 Bill-ion!\nYou lookin' at my zoom, my shit is Sicil-ian!\nY'all lookin' at my bitch, my bitch is Brazil-ian!\nI'm finna run through to the city and kill shit!"}], "artist": "Denzel Curry"}