{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": "2014-10-24", "title": "About the Money (Remix)", "lyrics": "[Intro: Jeezy]\nI step up in this bitch like Moses\nDamn right, motherfucker, Red Sea got departed (oooh!)\nThis is that \"All About The Money\" remix?\nWell, I'ma kill a motherfucker before it even get started\nWe got London on da... (Yeeaaah!)\nThe chrome to the bricks, nigga rag to the riches\nDamn right, nigga did it with the soda\nNigga still livin' like a G, keep some niggas 'round me\nThat'll kill your ass like some Ebola\nI count six shots!\n\n[Verse 1: Jeezy]\nYoung! Serve 'em out the Range Rover (Range Ro')\nI swear my Rollie stay shining like a rainbow (skee!)\nI took that money machine, filled it with hella green (green)\nYou be shining like I sprayed you with some oil sheen\nDC Young Fly, now what the fuck you mean? (fuck you mean?)\nYoung said he Seen It All, now what the fuck ya'll seen? (ay!)\nLeft the club in a Wraith, came in a helicopter\nDavid Beckham, way I kick it like I'm playing hella soccer\nI turn the valet to a helipad (helipad)\nNigga straight walk up in the bitch like I'm Nino\nFrom the coat on my back, to the shoes on my feet (what, what)\nEverything on me Valentino ('tino! ooh!)\nI'm talkin' Boyz N Da Hood, went solo, nigga (solo, nigga)\nTestarossa back then, ex-Polo nigga\nNiggas still on my dick, what you a homo, nigga?\nWhen you sayin' my name, it's free promo, nigga!\nWhat! Look!\n\n[Chorus: T.I. & Jeezy]\nIf it ain't about the money\nDon't be blowin' me up, nigga I ain't gettin' up\nIf it ain't about the... Look!\nIf it ain't about the money\nAin't no use in you ringin' my line, stop wastin' my time\nLook, you bitch ass niggas\nIf it ain't about that check, nigga\nIf it ain't about the money\nNah I can't even hear what you say, I ain't finna do shit\nAin't finna do shit!\nIf it ain't about the money (Hustle Gang, nigga!)\nBitch, you can miss me with it, bitch nigga miss me with it\nBitch, you can miss me with it! Look, turn! Hey!\nTurn up!\n\n[Verse 2: T.I. & Young Thug]\nWhat you think I'm standin' in the trap for? (why?)\nWith the fully automatic at the back door\n'Cause when it's on, know it's on, call me King Corleone (ooh!)\nI'mma keep it 1000 like a crack ounce\nGive a damn if I'm flat broke (nah!)\nI'm filthy rich, I'm still the same, that's a fact though\nOh yeah, we all about the money, nigga\nAll you got is money when my name hold weight like a fat ho\nI can never join in the game 'less I'm capo\nMilkin' these niggas even though I'm fuckin' lactose\nTake off on the cops, Mama said, \"Don't look back, bro\"\nI'm in New York and I'm ballin' just like a Net, though\nI'm drinkin' bubblegum pink like Pepto\nBismol, bet she wanna come through\nAnd get low, I'ma be with Haitians\nAll my Zos, Tip tell these niggas, bro\nBankroll Mob, yeah, we on, we retarded\nI'ma give you 15 from the carbine (turn it!)\nHit you in the leg, in your head, then your face\nWhen you dead, bet ya I'ma take your place on the Forbes list\nSo better miss with that bullshit, partner\nI'll be hopping out your bushes with a full clip, got 'em (got 'em!)\nI'll take a big stick to a fuck nigga neck (nigga neck!)\nSwinging at it, kind of like a piñata\n\n[Verse 3: Lil Wayne]\nI'm a beast with the choppa, I'm the same without it\nGraduated from the lean, that's my alma mater\nUm! Shoot 'em in his head, he say, \"Look at my roof!\"\nNo sticks, no seeds, only kush in my kush\nMake a nigga commit suicide and call it a selfie\nI get M's like mmm-mmmm-mmm\nI'm an asshole, I'm full of myself\nYou get an asshole full of my foot\nThey find your ass in the woods when they look\nAnd these hoes ain't as good as they look\nI need to take my own advice though\nCause if the pussy good then I'm good\nWhere your ghetto pass, nigga? I been big since a little-ass nigga\nYou little-ass nigga, you don't get a pass, nigga\nStarted as a middle-class nigga\nWhen I blew up, I ain't even hear the blast, nigga (woo!)\nI was chillin', smokin' on the loud\nFocused on the future, but I need my money now\nDon't give me the runaround\nUpstairs in my mansion, knock-knock, \"Who's there?\"\nI ain't even comin' down if it ain't about the money\n\n[Chorus: T.I. & Lil Wayne]\nIf it ain't about the money (Yeah!)\nDon't be blowin' me up, nigga I ain't gettin' up (Tune!)\nIf it ain't about the money\nAin't no use in you ringin' my line, stop wastin' my time\nIf it ain't about the money (about the money)\nNah I can't even hear what you say, I ain't finna do shit\nAin't finna do shit, my nigga!\nIf it ain't about the money\nBitch, you can miss me with it, bitch nigga miss me with it\nTurn up! (Remix, baby!)\n\n[Verse 4: Young Thug]\nI get money on a very rainy day (and!)\nI would love to spray your face with Olay, aye\nNo computer cause she never wanted space, aye\nI swear lil' mama is the weirdest in the place, ayy\nI'm a big G, dinosaur B\nYou know, YSL takin' over streets\nI'm a K-Ci, where is Jodeci?\nI'ma treat em' bad like he supposed to be\nI'm a blood, nigga, don't try to approach me\nGirl, let's hit like Kobe and Ginobili\nIf them not Gucci earmuffs, you can't ignore me\nHer booty piped up like a circus, baby, show me\nI might just take off on that broad 'cause she don't know me\nDej Loaf, change that beef to macaroni\nNo scale, but my bitches say I'm bony\nLil mama still blushing at the old me (woo!)\n\n[Verse 5: T.I.]\nNigga, Thug in the Impala, whole Hustle Gang follow\nComing from a hundred thousand to another million dollars\nYou finna fuck around and get yo ass whooped, dawg (bow!)\nWe send ya bullets bout the size of a football\nI got a youngin' with a shottie, charge a hundred for a body\nI’ll pay that to watch a monkey fuck a football, ayo!\nUnits of the yayo, since I was a day old\nUncle taught me say, \"Hasta luego\" if it ain’t about the money!\n\n[Outro: Sample]\nFatality"}], "artist": "T.I."}