{"songs": [{"title": "Oh Jerusalem", "album": "MTV Unplugged 2.0", "year": null, "image": "https://images.genius.com/223n7ezbshqosz0dhiz8hrmkd.500x500x1.jpg", "lyrics": "[Intro]\nOh Jerusalem\nOh Jerusalem\nOh Jerusalem\nOh Jerusalem\n\n[Verse 1]\nRealizing that there's no place else to go\nAnd there's nobody I know who can help me\nTextbook solutions are so improbable\nCause everybody else is just as empty\n\nNaked as the day that I was born, I tried to hide\nBehind education and philosophy\nHopeless explanation to describe a situation\nI can't see because the world's on top of me\n\n[Verse 2]\nOh wretched man that I am, who will deliver me\nFrom the body of this death?\nFreeing me from dust, and the superficial trust\nOf an enemy that seeks to take my breath\n\nFailing to connect cause I'm morally defect\nBy reason of the God inside my head\nCausing me to see only what pertains to me\nBelieving I'm alive when I'm still dead\n\n[Verse 3]\nLimited to earth, unable to find out my worth\nCause I can't see past my own vanity\nIf I'm not included, then I just have to remove it\nFrom my mind because it has to be insanity\n\nOh wretched man that I am, who will deliver me\nFrom the body of this death?\n\n[Verse 4]\nCan I even factor, that I've only been an actor\nIn this staged interpretation of this day\nFocused on the shadow, with my back turned to the light\nToo intelligent to see it's me in the way\n\nWhat a paradox, having God trapped in a box\nAll this time professing to be spiritual\nNaturally pretending, that I'm actually defending\nGod through my facade, don't need material\n\n[Hook]\nOh Jerusalem, wash thy heart from wickedness\nThat thou mayest be saved from thy deception\nHow long shall thy faith lodge lies within thee?\nOh Jerusalem, keeping thee from perfection\n\n[Verse 5]\nSubmit to truth, leave the deception of thy youth\nSo we could walk in the council of authority\nForget the proof, our generation so aloof\nOnly follow in the steps of the majority\n\nTrust in the Lord with all thy heart\nAnd lay not to thine, oh an understanding in all thy ways\nAcknowledge Him, and He shall direct our paths\nBe not wise in thine own eyes and you can follow him\n\nWe judge and condemn, just as ignorant as them\nWho religion tells us that we should ignore\nPerpetrating we're in covenant with Him\nExposed by the very things that we adore\n\n[Verse 6]\nWe grin and shake hands, then lay ambush for the man\nWho has a different point of view then us\nInfuriated cause he doesn't understand\nBringing up those things we don't want to discuss\n\nWhy still do evil, we don't know how to do good\nWalking on in darkness running from the light\nLed to believe, because we live in neighborhoods\nTelling us what's going on will be alright\n\nOh so repressed, so convinced that I was blessed\nWhen I played with my game of Monopoly\nOh to suggest, that my life is still a mess\nWho reveal the pride I'm hiding is what's stopping me\n\n[Hook]\nOh Jerusalem, wash thy heart from wickedness\nThat thou mayest be saved from thy deception\nHow long shall thy faith lodge lies within thee?\nOh Jerusalem, keeping thee from perfection\n\n[Verse 7]\nAbide in me and I in you, as the branch cannot bear\nFruit of itself except in the vine\nI am the vine, ye are the branches, he that lives in me\nAnd I in him, the same bring forth much fruit\n\nWithout me, you can do nothing\nOh Jerusalem, you're traditions have deceived you\nI've chosen you, you haven't chosen me\nDo whatsoever, you asking my name he may give to you\n\nBut in vain they call my name\nTeaching doctrines just the same\nJustified among themselves\nBut God know with the heart, what man esteemed as smart\nIs an abomination to Emmanuel\n\n[Verse 8]\nJust repent, turn from selfish motivation\nSo iniquity will not cause your demise\nMake you a new heart and a new spirit\nFor why would he die? Oh Jerusalem, please tell me why\n\nI have no pleasure in the death of him to die\nSays the Lord God where forth turn yourselves and live\nIt's not the talkers, but the walkers and His Word\nAre the only ones the Father will forgive\n\n[Hook]\nOh Jerusalem, wash thy heart from wickedness\nThat thou mayest be saved from thy deception\nHow long shall thy faith lodge lies within thee?\nOh Jerusalem, keeping thee from perfection\n\n[Outro]\nOh Jerusalem"}], "artist": "Lauryn Hill"}