{"songs": [{"year": "2009-01-01", "title": "My Crew", "image": "https://images.rapgenius.com/e457f23fe0eb2717332ec38cf9063d6d.1000x1000x1.jpg", "lyrics": "[Produced by Statik Selektah]\n\n[Intro]\nAyo Statik we gon' switch it up on 'em man\nWe're talking about my crew on this one man\n\n\n[1st Verse]\nSee my crew be doing it like this\nEvery nigga in the crew stay with a tight fist\nReady to bust you up side yo motherfucking head\nIf you ever act like you wanna fight bitch\nCrew be doing it like this\nOoh let me see that thing you got on your right wrist\nYeah this is nice kid where'd you buy this, click\nSlip that shit off in the process\nSee my crew be doing it like this\nUp north in the yard swinging a icepick\nDown south on the tour bangin a white chick\nI ain't even dropped and they on my dick cause i'm that shit\nAnd be doing it like this\nCrack in the back of my balls in the crack of my walls\nCan't let police go in my drawers\nI got two felonies a nigga can't afford anymore\nNaw\n\n[Chorus: Sample]\n\"Am I getting through to you\"\n\n[Saigon during Chorus]\nAm I getting through to you\nYou know how the crew do nigga\nYEAH! Statik Selektah man\nSaigon, come on (Am I)\nAm I get through to you\nIs this computable?\nCheck it\nYou wanna know about my crew?\n\n[2nd Verse]\nSee my crew be doing it like this\nRighteous megaman that's my sidekick for life bitch\nAnd we tighter than vicegrips\nSo if you got beef with him then I flip\nAnd be doing it like this\nUp north in my cell stepping in my shit\nDown south on the L selling that white shit\nSee my nigga TT and get that right call it a night shit\nAnd start moving it like this\nStart selling all my shit to the white kids\nGive the crack to Mikey bet he likes it\nEvery since then son keep his pipe lit, shit\nAnd be doing it like this and like that\nWe'll ruin this hype shit with tight rap\nAnd start doing what we need to be doing\nTo get this rap shit back on the right track\nBlah\n\n[Chorus: Sample]\n\n[Statik scratches] 2x\n\"I'm surrounded by criminals\"\n\"Got with a sick type clique and went all out\"", "album": "All in a Day’s Work"}], "artist": "Saigon"}