{"artist": "Cam’ron", "songs": [{"title": "Halftime Show", "album": "Purple Haze (Advance)", "year": null, "image": "https://images.genius.com/0a514e5cc3e0e770f31ddb0582329f24.499x499x1.jpg", "lyrics": "[Intro]\nKilla, Dipset\nCheck my stats man (seventy-eight and O {78-0})\nI got to be the best livin' man (you already know)\nHolla at me\n\n[Verse 1]\nLike Alex Trebek, you're in \"Jeopardy\"\nYesiree, got the recipe\nGive ya a tech, but nope, not a referee\nLike Wyclef, I'm a refugee, rollie-wear\nCocky, don't play hockey, but have your mommy goalie gear\nSee the ice, grab the stick, hit the break pads\nGet her knee pads, penalty, face mask\nI face grab the don enter the don's in her\nThe don of don play the dug-out like Don Zimmer\nI hang wit' Steinbrenner just to get my cash turn\nI call my car Jamal, it get \"Mashburn\"\nCrashburn, rest in peace, Dale Earnhardt\nMy cousin died the same way, hit that turn hard\nSo I stack from the gamblin'\nDrop cash in the phantom\nPlay \"DIPSET, DIPSET\" yeah, the National Anthem\nDrive the seven series, to the World Series\nI'm so serious I want the whole world hear me\n\n[Hook] 2x\nMan I got to be the best livin'\nThat's a given, check my stats\nThis the halftime show, what could mess wit that\nKilla Cam' Killa Cam'\nWhat's ya name huh? Killa Cam' Killa Cam'\n\n[Verse 2]\nMan you know how I line my backs (how?)\nWith a dime of crack (oh)\nThey slang to the rack, through the legs, behind the back\nWanna play for my team? Come sign the track\nTreat you like a sprinter, I find the track\nIf you hype I got hyper men, Spiderman\nIn Minnesota my Vikings sell Vicodins\nI got clients connects, my alliance respect\nI'm like New York football, Giants on Jets\nEven Buffalo Bills, my deals up in those mills\nBut I still cop keys, fuck with those crills\nYeah, up in those hills, where they have chosen to feel\nThe face dive in the snow, nose in they grill\nI be with Don King, if you a fighter, good\nFuck Tiger Woods, it's tigers in the hood (Harlem)\nSo come test the birdie, if ya stretched the dirty\nGive ya your Quarterback like Testaverde\n\n[Hook] 2x\nMan I got to be the best livin'\nThat's a given, check my stats\nThis the halftime show, what could mess wit that\nKilla Cam' Killa Cam'\nWhat's ya name huh? Killa Cam' Killa Cam'"}]}