{"artist": "Vanilla Ice", "songs": [{"title": "Play That Funky Music", "year": null, "lyrics": "[Intro]\nYo, Vanilla. Kick it one time, boy!\n\nPlay that funky music\nPlay that funky music, white boy\nPlay that funky music\nPlay that funky music, white boy\n\nI'm back and I'm ringin' the bell\nA rockin' on the mike while the fly girls yell\nIn ecstasy in the back of me\nWell that's my DJ D-Shay cuttin' all them Z's\nHittin' hard and the girlies goin' crazy\nVanilla's on the mike, man I'm not lazy\n\nI'm lettin' my drug kick in\nIt controls my mouth and I begin\nTo just let it flow, let my concepts go\nMy posse's to the side yellin', Go Vanilla Go!\n\nSmooth cause that's the way I will be\nAnd if you don't give a damn, then\nWhy you starin' at me\nSo get off cause I control the stage\nThere's no dissin' allowed\nI'm in my own phase\nThe girlies say they love me and that is ok\nAnd I can dance better than any Kid 'N Play\n\nPlay that funky music Come on Come on\nPlay that funky music, white boy I can't hear you, say it\nPlay that funky music say it, say it, say\nPlay that funky music, white boy it, come on\nYea, a little bit louder\nNow come on, come on\n\nStage 2—Yea the one ya' wanna listen to\nIt's off my head so let the beat play through\nSo I can funk it up and make it sound good\n1-2-3 Yo—Knock on some wood\nFor good luck, I like my rhymes atrocious\nSupercalafragilisticexpialidocious\nI'm an effect and that you can bet\nI can take a fly girl and make her wet\n\nI'm like Samson—Samson to Delilah\nThere's no denyin', You can try to hang\nBut you'll keep tryin' to get my style\nOver and over, practice makes perfect\nBut not if you're a loafer\n\nYou'll get nowhere, no place, no time, no girls\nSoon—Oh my God, homebody, you probably eat\nSpaghetti with a spoon! Come on and say it!\n\nPlay that funky music\nPlay that funky music, white boy\nPlay that funky music Come on Come on\nPlay that funky music white boy Let's do it\n\nVIP. Vanilla Ice yep, yep, I'm comin' hard like a rhino\nIntoxicating so you stagger like a wino\nSo punks stop trying and girl stop cryin'\nVanilla Ice is sellin' and you people are buyin'\nCause why the freaks are jockin' like Crazy Glue\nMovin' and groovin' trying to sing along\nAll through the ghetto groovin' this here song\nNow you're amazed by the VIP posse\n\nSteppin' so hard like a German Nazi\nStartled by the bases hittin' ground\nThere's no trippin' on mine, I'm just gettin' down\nSparkamatic, I'm hangin' tight like a fanatic\nYou trapped me once and I thought that\nYou might have it\nSo step down and lend me your ear\n'89 is my time! Yo, '90 is my year\nPlay that funky music\nPlay that funky music, white boy\nPlay that funky music Come on, Come on, I\nPlay that funky music white boy can't hear you\n\nYou're weakenin' fast, YO! and I can tell it\nYour body's gettin' hot, so, so I can smell it\nSo don't be mad and don't be sad\nCause the lyrics belong to ICE, You can call me Dad\nYou're pitchin' a fit, so step back and endure\nLet the witch doctor, Ice, do the dance to cure\nSo come up close and don't be square\nYou wanna battle me—Anytime, anywhere\n\nYou thought that I was weak, Boy, you're dead wrong\nSo come on, everybody and sing this song\n\nSay—Play that funky music Say, go white boy, go white boy go\nPlay that funky music Go white boy, go white boy, go\nLay down and boogie and play that funky music till you die\nPlay that funky music Come on, Come on, let me hear\nPlay that funky music white boy you say it, say it\nPlay that funky music A little louder now\nPlay that funky music, white boy Come on, Come on, Come on\nPlay that funky music", "album": "Hooked", "image": "https://images.genius.com/91a2079c70aab91fbde5b4f39e87b30d.500x505x1.jpg"}]}