{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legendary Classics Volume 1", "year": null, "lyrics": "[Verse 1]\nNo mistakes what you listening to\nYou listening to one of the all time greats\nThese are the breaks like Kurtis\nNever heard this the way we disturbingly word shit\nMy dick spit flames, bitch, try not to get burned, bitch\nI'm the master, the kingpin, do my thing, ring king\nPut your gloves on, it's round 1, ding ding\nSome of our G.O.A.T.'s passed on\nSome of our illest lyricists sold out, they suck now, they're gone\nRugged Man, mamas keep your daughters away from his broke ass\nNo cash, looking for a place to crash\nHe just a dick-swinging dirt-bag, no class\nOnly fuck little, skinny, white bitches with no ass\nThe underground kill shit, my clique Paz, Killah Priest\nMasta Killa, Kool G Rap, sick, lyrical beasts\nTimbo King, Hell Razah, Tragedy Khadafi\nAnd of course R.A. The Rugged Man, you can't forget about me\n\n[Hook]\nBig guns, hold up's, it's L.I.'s finest\nTen hut, uppercut, bow down to your highness\nThe legendary rhymer, howdy ha\nYeah, he walk through fire, la di da\n\n[Verse 2]\n''Oh, who's that guy? He's so fly''\nThat's what all my fat girls tell me, miss you, baby, love you, bye bye\nPretty bitches mostly hate me wishing I die\nOh wait, that was the past, bitches love me now\nI don't know why they thinking they getting with a rap star\nHandsome heartthrob, in reality they sucking the dick of a fat slob\nI'm a star in the hood these days like Black Rob\nMy childhood fucked me up for real, I'm really that scarred\nLet's get ready to rumble like Michael Buffer\nYou sold out, I saw what you did last summer\nI'm a foul motherfucker like old school Slick Rick\nWith your wrinkled pussy I can't be your lover\nThis boom bip boom bap true funk\nI'm from New York City, I do not get crunk\nI'm so damn talented, I'm so damn gifted\nI'm the Grand Puba, the Grandmaster, the Grand Wizard\n\n[Hook]", "title": "L.I.’s Finest", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}