{"artist": "Zack de la Rocha", "songs": [{"album": "Lyricist Lounge Volume One ", "title": "C.I.A. (Criminals In Action)", "lyrics": "[Intro: KRS-One]\nYea yea yea yea yea!\nKRS-1 coming through\nBig Zack, Last Emperor\nWOOP WOOP!\nHa ha\nThat's the sound of EMS\nHa ha\nLast Emperor, KRS\nHa ha\nBig Zack you know the rest\nNow we gonna come down like this now, hold tight all crew\nLISTEN!!\n\n[Verse 1: Zack de la Rocha]\nThis voice shatters the calm of the day, like an alarm\nTo wake up bright anew, and take up arms\nCause more is necessary than vocabulary war\nCause the toxic rock imports, gettin' on your door\nC.I.A. I see ya later, cause your time is coming soon\nI flip the shit like Pacino and it's your Dog Day Afternoon\nAttica Attica, drug agents you bring your static-a\nMy alphabet will slash that neck and flip you, automatica'\nDramatic like Ali Shaheed Muhammed brought the vibe\nI bring the sun at Red Dawn upon the thoughts of Frantz Fanon\nSo stand at attention, devil dirge\nYou'll never survive choosin' sides against the wretched of the Earth\nThe infiltrator, tribe intoxicator, people incarcerator\nLiberation movement annihilator\nWe got you clocked pushing rocks and it fail\nWe got brothers trooping subways like the Ho Chi Minh trail\nWe got the truth daddy, Last Emperor, KRS and\nHistory manifested, tomorrow next lesson\n\n[Hook: all together, with samples]\nYOU CLAIM I'M SELLING CRACK, BUT YOU BE DOIN' THAT\n[KRS-1] You, claim, you claim, you, you claim, claim\nYou claim I'm selling crack but you be doin' that\n[Zach] You know the cops they got a network for the toxic rock\nYOU CLAIM I'M SELLING CRACK, BUT YOU BE DOIN' THAT\n[Big L] So get that flashlight out of my face\n[KRS-1] You, you, you claim I'm selling crack but you be doin' that\nThe Last Emperor, KRS-One, and Big Zack\n\n[Verse 2: The Last Emperor]\nAs free market capitalism and technology expands\nThe third world's fertile soil becomes a desert wasteland\nSo it takes bands to, demand the, government provide answers\nWhen Lady Liberty has me Bewitched like Samantha\nAnd poverty is one of the most malignant forms of cancer\nTo all my Black Magic romancers and acid rain dancers\nDevelop close ties like Jerry Seinfeld and George Costanza\nWe fear no man and throw jams\nThat attack counterintelligence programs\nExciting like the epic adventures of Conan (hah!)\nI colonize minds like Zaire by the Belgians\nNow what the hell is the problem with this system and what it sells us\nI bring ancient relics like Wyclef did to Zealots\nI saw an Iron Curtain called hip-hop and got it open like Boris Yeltsin\nWhirlwind, tornadoes, in the rain forest if you say so (whosssshhh)\nKRS and The Last Emperor like the Green Hornet and Kato\nZach de la Rocha brings the enraged flow, but all three drop science\nAnd become the most powerful alliance since NATO\n\n[Hook: all together, with samples]\nYOU CLAIM I'M SELLING CRACK, BUT YOU BE DOIN' THAT\n[KRS-1] You claim I'm selling crack but you be doin' that\nYOU CLAIM I'M SELLING CRACK, BUT YOU BE DOIN' THAT\n[Zach] You know the cops they got a network for the toxic rock\n[KRS-1] You claim I'm selling crack but you be doin' that\n[Big L] So get that flashlight out of my face\nYOU CLAIM I'M SELLING CRACK, BUT YOU BE DOIN' THAT\nThe Last Emperor, KRS-One, and Big Zack\n\n[Verse 3: KRS-One]\nNeed I say the C.I.A. be Criminals In Action\nCocaine crack unpackin', high surveillance trackin'\nProminant blacks and whites givin' orders for mass slaughters\nI want all my daughters to be like Maxine Waters\nWhen they flooded the streets with crack cocaine\nI was like Noah, now they lower cause the whole cold war is over\nCommunism fell to the dollars you were grabbin' it\nAll the assault and batterin' in the name of intelligence gatherin'?\nNow it's karma you battlin', a losin' fight\nI chose the mic to recite ignite light in the night, aight?\nWe should beat em, President Clinton should delete em\nIt's not hard, the C.I.A. simply has no more job\nOh my Goddess, mother, you can fix this\nWe rock over mixes not six six sixes\nYo this is, the message, to all that can hear it\nIf you got secret information now's the time to share it\nCall your Congresswoman, your senator, your mayor\nIt's time for all the scholars to unite with all the players\nRearrangin', see times are definitely changin' G\nThey used to tap the phone, now they tapping while you paging me\nIt's crazy B, yet it's plain to see, who the enemy\nWho's left the NRA, The ATF, the AMA\nOkay, okay, it's all irrelevant, cause in the new millennium\nThere'll be no Central Intelligence\n\n[Outro]\nUh, yea, uh, yea\nThrow your hands up\nYou know whassup kid, throw your hands up\nHa hah yeah, hah hah, yeah", "year": "1998-05-05", "image": "https://images.genius.com/018f03c5ed88c65f79863459b3d85e70.1000x994x1.jpg"}]}