{"artist": "Warren G", "songs": [{"year": null, "lyrics": "(Whats up Warren G?)\nWhats happenin? I'm just chillin, you know\nCheckin my game you dig, you know\nTrippin off these fools around the situation, you know its like that\n\n[Mr. Malik]\nI went from hustlin and slangin to bustin and bangin\nI got to keep it real, so fuck not cursin when I'm sangin\nNow let me tell y'all about this shit, went down the other nite\nMe and the doggs see some niggas, just caught up in tha hype\nTryin to ride and get by like tha FBI\nCause we know bout them hk's, they right outside\nBut we never knew y'all had a clue bout what we go through\nSo tell how the fuck could you speak on my crew\n\n[Badass]\nI went from dirt to large work like boatloads of keys\nIt's hard work and it hurts to live life on ya knees\nSo God please have a lil mercy on my soul\nWhat my eyes see my mind think my hand should hold\nThe outcome of these actions warm hearts turn cold\nLil snake tryin to blast me wit the gun he stole\nWe hang out, banged out, same route as the day before\nBlessed wit perception, but don't know how my days a go\nCould see my nigga hittin wit some pay, a few days ago\n\n[Daz]\nNow we back in the mix with some more clips and paper though\nI can't do nothing but enjoy myself\nGotta do it myself, got a gang of wealth\nIts bloodclottin muthafuckaz seem like they want it all\nBut they can't, trying to fake on me and my doggs\nIf I fall I fail, gotta retrace my trail\nCross C's to clock G's I bell with bell\nI keep the throw downs for mine\nWarren G, Dogg Pound clockin the doves and come\nServe your whole fuckin hood with some bud and rhymes\n\n[Kurupt]\nPlus you niggas dont mash like mine, throw em 17 times\nMoney like a muthafucka, homey give me mines\nPaid, I come stomping like a parade, the escapades\nPsychoatic analysis, as I consume, always cartin the mushrooms\nWith clear sight, the daylight's like the night\nA closet full of Franklins, a G's paradise\nA nice 40 ounce a O.E. on ice\nPrecise poetic performing nice on mics\n\n[Warren G]\nWell I flew from the East to the West\nWord on the street, niggas wanna test\nBut these MC's, is scared to buck\nPlus they talk too much and smoke too many blunts\nYou fuckin rookies\nSweet as Mr. Smith's cookies\nYa hate me one minute and tha next ya wanna buck me\nHe sent a ho, in the back seat of my fo'\nWhile ya Goin Back To Cali, watch how you flow\nNow ya know, about this Warren G Era\nG-Funk terror, look into tha mirror\nAnd what you see is the don of the company, that nigga\n(Warren G, Warren, Warren, Warren's to tha G)\nYou still see, what I see\nAll of the homies in the LB\nSittin back, and we makin the cash\nWarren G, Kurupt, Hershey, Daz and Badass\n\n(Chorus) x2\nAnd we never knew you had clue of what we go through\nSo how in tha fuck could y'all speak of our crew\nYa thought this, ya thought that, we thought y'all should laid back\nYeah it's like that,for me it's like that\n\nSittin back,and we makin the cash\nIt's Warren G, Kurupt, Hershey, Daz and Badass\nSittin back,and we makin the cash\nIt's Warren G, Kurupt, Hershey, Daz and Badass\n\nThats right\nYa know what I'm sayin Warren G\nWith my homeboys from the pound Daz Dillinger, Kurupt the Kingpin\nAnd the homey Malik, ya know what I'm sayin and Mr. Badass\nAnd thats how we doin it fool, yeah\nWe ain't bangin on wacks nigga, we doin it like we should be fool\nYeah", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "What We Go Through (Promo Version)"}]}