{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Hot Tub Rhyme Machine", "year": null, "album": null, "lyrics": "So like I had to put myself in this zone\nWhere I was standing like a guy and I was like imagining that I had a penis\nAnd I was like, you know,  in a hot top surrounded by, like, bitches and\n\nKool A.D. best rapper in the world\n[?] crypto-chronic, La da day, heh\nGamed out, all of ya'll lamed out, famed out\nIn a Range getting brained out\nFifty thousand dollars all up on my chain\nMan, my chain tough, heh\nNew shit ya'll messin' with the same stuff\nYea, the same stuff\nI'm on the new shit\nYea, baby!\n\nEy, dawgone hella' rich\nSittin' in a hot tub with your bitch\nAnd I ain't never snitch\nFez-ass man, yea I ain't never pitch\n\nHeh, I'm so foogazy\nWear a white bitch with me call that hoe Kim Basinger\nLook at all my raps, 222,000 tracks\nGet a calculator, do the math\nThat's 222,000 racks, heh\nTwo houses, two house cats, two dogs, I like to earn like a true god\nJeans, True Religion\nHip hop just a euphemism for a new religion\nI'm still good, I truly kick it\nI livin' I'm really wizardly\nLimerick, idiot speak, kicker\nYou a dick licker\nI'm in a Range and I'm speaking a Spanglish\nEatin' hoho's with the dames that you hang with\nI think things in my brain, then say shit\nThen I get wasted and spend all my paychecks\nGaze into the effortless wastelands created on bass-lines and brakes of irrelevant nature\nGone off a' half-a quail egg and a venison chaser\nRock like a elegant blazer\nLaced up, heh, aces in my radio spaces all caked up\nThe game laker\nAim at your brain and go bang, mang, the slang Ceasar\nMy ballad's a salad\nHealthy with the leafy green vitamins\nYour wifey slidin' on the pole like a fireman, pause\nYo, I'm higher than Nas was when he was like \"bro I'm a gun, dude\"\nMulatto Franz Kafka, come through\nEverything I do becomes true\nKing me, I sun you, Sun Tzu\nAll up in the booth Buddy Bolden\nSelf-evident truths, you know I hold 'em\nTexas, shout to Fat Tony\nHey what up Brody, ey what up Woty\nGot a A-rab lawyer named Jody\nHighroller\nToo rich for your blood try foldin', sick\nTwo chicks, one cup, kid I'm nasty\nDog to a pup, you a Lassie\nYou a duck, you a quack, B\nYea, I don't give a fuck if you ask me\nI'm buck with the blast V\nShout out to Spassy [?] I'm max, I'm scholastic's death I'm half deck short of a full one\nMaybe I might even might fuck around and, like, sorta, um, pull guns\nOut at your mom's crib, wave 'em around till your mom's like \"son, I think you're friends with the wrong kids\"\nMom check the [?]\nPlus atomically my anomics\nI mean my economics\nYo my Freakanomics is Marxist, philosophically\nYo I kill em with the sophisistry\nWhat?\nYo, still I keep my politics on top of me like poppy seeds\nA topical bagel\nI'm in the regal\nYo, I'm feelin like a young Danny Brown, sippin on Fago\nFlippin through Hegel\nCome through, Kool with the Kangol\nSee me out in Spain in a K-hole\nClutch yaper man, yo I strangle the Peso\nI'm on the plane with your main ho\nQuick chain\nApache spit flames at your stagecoach\nPussy wet\nYo I'm Rick James in a raincoat\nZip, bang\nThe thing got her dancin' like she reppin' the Crip game\nToes curled up like footwork\nSippin' my dick like a soda in the kitchen\nSaid my pipe be that crack like a cook work\nStep on her neck till my foot hurt\nYou mad, you look hurt\n\nYo you talkin about your pimpin' right here man, pimpin' is hard, you know what I'm talkin' bout? Yea, man, yea you niggas got the ABCs but you niggas need to really get the XYZs, you know what I'm talking about? Yea man, you gonna get mother fucking shit separated, so you niggas can separate the live from the jive, you know what I mean? That's what you niggas need, an automatic shit separator Cut that bullshit out you know what I'm saying\nBeen born into this shit\nThe trigger don't\nTalkin bout they prostitutes\nYou got hobos\nCome to set the record straight\nEducations\nGreatest test\nAmerican pimp nigga\nGot a t-shirt\nYa'll tryin to wear this pimpin like a t-shirt\nBullshit we gon' piull you up in the air\nCotton\nGet some real\nYou can't be trickin\nCheck the hoe\nIf you gone\nYou know what I'm talking about\nW-w-w-w-w-w\n\nMaybe you can call your dad\nHere's a quarter man, trust that I'm good for it, hah\nOld school like a payphone\nFool I drop jewels like Beethoven\nThe best ever, heh\nKool AD is a very good man and he's very good at rappin'\nHeh, when the Remy's in my system\nAin't no tellin' will I fuck 'em will I diss 'em?\nThat's what they be yellin', I'm a pimp by blood, not relation Ya'll be chasin' I'll replace then, huh?\nStop it like [?] [?] [?], Jason\nAll O.J. Simpson\nSaw yay this one time I figured I'd rap about it\nPimpin' is a fact I'm a mack about it\nDance about architecture\nSharkin' at the art with the sharpest lectures\nWrote some, uh, fire bars on my phone and then it died and I lost 'em\nBut yo trust me they were totally awesome\nYea, I'm feeling like Malcolm, Einstein, Nelson Mandela with the mandala raps dawg halla back\nUsed to sell multiple pounds of marijuana, black, weekly, heh\nNow I just read Black Weekly and smoke Black and Milds while listenin' to Sweetly by Black Sabbath followed by Black Magic Woman by Santana followed by You Ought to Know by Santana followed by Welcome to At-lanta\nThen I sip a Fanta, take a nap, I go bananas in the trap\nEy yo, hey you, club look like Cuban Bruce Springsteen\nHe only Tex-Mex and Wingding\nHe got a couple cousins in Sing-Sing\nBut one is a guard in the east wing\nHe got a couple Beemers and a Lexus or two that he leasing\nA big-booty wife with some bee-stings that think she's Brazilian\nPlus he got a fly side-chick named Lillian\nYea, I'm blowin' vermilion haze as I gaze at the ceiling man\nOh, what a beautiful feeling man\nLean got my head spinnin' just like a feeling, fam\nI mean like a ceiling fan, whoo, ha\nMade a couple G's last week that was strictly off dealin' Xan\nI'm sippin' a Reisling up in the Sebring pop in a Steely Dan\nCD and proceed to get B.Z\nWhile I'm too turn I smoke till you burn, get it I smoke weed until you're high?\nWhat up dudes I sell crack. rock cocaine dawg, I sell that\nI sell dope, I slang weed, I shoot guns, I move pot, I kill fools, I sniff coke, I whip dope, I got a cold whip and my whip dope, I got a cold chain and I'm so ill, I got a cold mil, I'm so trill,  black cat bone, I'm so high, smoke hella weed I'm so wet, you bone dry, yea I drive hella 'rarris and Benz, though\nSee me in the Beemer and I'm high offa benzos, eatin' hella pizzas at Enzo’s, run up in your house spray your kin folk\nBitch I got a ten hoes, bitch I ten twick, I mean ten bricks, heh, and I split ten twigs, that's some new shit, you ain't even on that\nYo I'm on raps, heh, yo, don't watch me, watch yourself bitch\nI bring the peace like I'm Ghandi, I'm selfless\nRoll up all me weed I'm up like twelve spliffs\nYo, yo, posse with twelve, twelve shellfish\nBell Biv Devoe on the system\nAll of yo bitches I kiss them\nEy, yo, plus fuck the system, they got hella African men locked in prison\nJudges like pancakes up in the hood man\nSee how I flip them\nCentral bookin', yea we caught in the pigpen\nRidin dirty like Pigpen, I'm Charlie Brown\nParty up dude, party down\nYa'll gas like balloons with the party clowns\nFeelin' so groovy, it's a movie, it's gnarly, wow\nI'm handin' out fliers for my show at The Starry Plough\nFreestylin' in front of La Pena, shout' out to the homie Keith's mom she from like Kenya\nYo this song is hella pretty like Enya\nFuck a line I hit you with the iron and end ya\nLike the mind's ascend ya\nThen I might go on Facebook and friend ya\nYo, why did Bush knock down those towers like Jenga?\nKool AD the black Power Ranger\nPussy A-rab have the dead [?] like the stranger\nKool AD Jesus I was born in a manger\nTommy in my mother fuckin' boy it's my middle name, like \"Danger\"\nScorpio rising man, big shouts out to [?]"}]}