{"artist": "Iggy Azalea", "songs": [{"title": "Kream", "lyrics": "[Intro]\nFirst you get the money\nThen you get the power\nRespect\nHoes come last\nOh my God, Ronny!\n\n[Chorus: Tyga & Iggy Azalea]\nAyy, get it, get it, get it, get it, get it, get it, get it, get it\nAyy, get it, get it, get it, get it, get it, get it, get it, get it\nAyy, get it, get it, get it, get it, get it, get it, get it\nGet it, get it, get it\n(Kash rules everything around me)\n\n[Verse 1: Iggy Azalea & Tyga]\nUh, open up the safe, bitches got a lot to say (raw)\nPussy in your face, that'll put you in your place (boom)\nSeven letters on the plate, fuck you when I brake (bitch)\nI got cars, I got bags, I got real estate (cash rules)\nForeplay, I ain't come to play (huh)\nI got big fish money, he gon' bite the bait (yeah)\nCan you drop it down, make that ass talk to me?\nKeep that energy, gone off the Hennessy\nAss, I need my bag quickly\nSeparate six degrees, bitches think they knowin' me\nSex Pistols, Sid Vicious, wet you when it's horny\nHit me on my cash app, check it in the morning\nCash, in this bitch shinin'\nDressed in designer, she could get grimey\nAnd it's perfect timing, gin with the tonic\nBella Hadid, homie could get it\n\n[Pre-Chorus: Iggy Azalea]\nAss\nCash, cash\nAss, bags\nBag\nCash rules everything around me\n\n[Chorus: Tyga & Iggy Azalea]\nAyy, get it, get it, get it, get it, get it, get it, get it, get it (ass, cash, cash)\nAyy, get it, get it, get it, get it, get it, get it, get it, get it (ass, bags)\nAyy, get it, get it, get it, get it, get it, get it, get it (bag)\nGet it, get it, get it, get it\nCash rules everything around me\n\n[Verse 2: Tyga]\n(Uh-uh) Ass rules everything around me\nDeep in that pussy, yeah I'm drowning\nA shark in the water, how you found me?\nBest get from 'round me (I'ma dog)\nI go hunting like a bounty (woof)\n(Cash rules) Ya, make my own rules\nTattoos on that ass, she do night school\nWelcome to the players club, Ice Cube\nDiamonds might make the news (uh)\nBitch that's photoshop like rappers with that autotune (cash, uh)\nUh, your cheques is not approved\nRM 52, anoscope, water proof\nNiggas talk a lot of boof, 'til they outside the booth\nMy niggas like golden state, inbound, pull up and shoot (swish)\n\n[Pre-Chorus: Iggy Azalea]\nCash\nCash, ass\nAss, bags\nBag\nCash rules everything around me\n\n[Chorus: Tyga & Iggy Azalea]\nGet it, get it, get it, get it, get it, get it, get it, get it (ass, cash, cash)\nGet it, get it, get it, get it, get it, get it, get it, get it (ass, bags)\nGet it, get it, get it, get it, get it, get it, get it (bag)\nGet it, get it, get it, get it\nCash rules everything around me\n\n[Outro: Iggy Azalea]\nAss rules everything around me\nDeep in that pussy, got him drowning (drownin', drownin')\nCash rules everything around me\nA shark in the water, how you found me? (found me, found me, found me, found me, found me)\nCash rules (K.R.E.A.M get the money)\nCash rules (Dollar dollar bill y'all)", "image": "https://images.genius.com/9082ff8afdd47d2aeff6d402fe80eeaa.600x600x1.png", "album": "Survive the Summer - EP", "year": "2018-07-06"}]}