{"songs": [{"year": null, "image": "https://images.genius.com/98a8e8c823c639c5c17de8fd58e19585.1000x1000x1.jpg", "title": "G", "album": "Glitches in the Break", "lyrics": "[Guilty Simpson]\nI remember when it all started\nA young cat, tryna get her trust back\nCause me and my momma, we hit a rough patch\nSearching my room like \"Where the drugs at?\"\nShe didn't find em'\nBut found a heater in my coat lining\nThis is way before rhyming\nWhen I had a dead fear for all the old timers\nEarning stripes on the streets without a co-signer\nShe askin' \"Why?\"\nI couldn't say\nIt seems I was breaking her heart every other day\nI needed another way\nWitnessing my peers bubble yé making double pay\nTucking the clock cleaner for block schemers\nBecause if you're rocking high sneakers, they might rob ya\nEvery day inner city problems\nI used to wish my parents chose a condom\nLife was a gift I never asked for\nMe and reality had a crash course\nWe used to jump and slap the backboard\nBefore the studio life and rap tours\nI counted scars way before I counted bars\nGrew up quick, dealing with a screwed up chick\nWho, what, when, why, where and how?\nHittin' licks like crime pays for now\nSkinny bird chest youngin and living foul\nWinging it on talent, still fly\nSore attitude I jumped and got high\nEnjoying the view knowing something is important to do\nBut all I was was a fan then\nI didn't have that understanding\nI wasn't a man then; not even close\nThen I recited a rhyme I wrote\nGrim life found hope\nStupid me noticed opportunity to keep me far from broke\nSo I tried rhyming in my homeboys ride\nPontiac 6000 rolling up freestyling\nYears later, admiring the dough we piling\nWhat a come up\nGetting my ones up\nI used to hit the studio with a gun tucked\nYou never know when life imitates art\nI'm better than a role-player when the game starts\nI'm a team captain\nMaking dreams happen\nJotting words at lunch, go home and read napkins\nNow what I wrote feeds me\nStory of G"}], "artist": "Black Milk"}