{"artist": "Ice Cube", "songs": [{"title": "Ghetto Bird", "lyrics": "[Verse 1]\nWhy, oh why must you swoop through the hood\nLike everybody from the hood is up to no good\nYou think all the girls around here are trickin\nUp there lookin like Superchicken\nAt night I see your light through my bedroom window\nBut I ain't got shit but the pad and pencil\nI can't wait till I hear you say\n\"I'm going down, mayday, mayday.\" I'm gonna clown\nCause everytime that the pigs have got me\nY'all rub it in with the flying Nazi\nMilitary force, but we don't want ya\nStandin' on my roof with the rocket launcher\n\"So fly like an eagle.\"\nBut don't follow us wherever we go\nThe shit that I'm saying, make sure it's heard\nMotherfuck you and your punk-ass ghetto bird\n\n[Hook]\n\"Run, run, run, from the ghetto bird\" [2x]\n\n[Verse 2]\nNow, my homey's here to lick on a trick for a Rolex\nAnd let me try the fo' next\nNow the fo' I was driving was hotter than july\nLooked up and didn't see a ribbon in the sky\nSaw a chopper with numbers on the bottom\n\"Calling all cars, I think we've got em.\"\nI hit the gas and I mashed past Inglewood\nI think I drove through every single hood\nSouth Central, Compton and Watts\nLong Beach, bust a U, here come the cops\nWish I had a genie with about three wishes\nMetal flake green on D's I look suspicious\nYou know that I'm running\nShit, I hear it humming\nFuck, I see it coming\nIs it a bird? Yup\nIs it a plane? No\nI hit me a right on El Segundo\nWanted to holla, had to ditch the Impala\nLet's see if they would folla\nMe, hit a fence, hit a fence, and another\nMet me a baby pitbull and his mother\nRan up in some peoples house and looked out of the window\nI wish it was my kinfolk\nHad to pull a strap on a fool named Louis the Third\nCuz I'm getting chased by the ghetto bird\n\n\"Just put his hat, ehrrr, he combed his hair and then put his hat back\nOn. Errr, he's acting nonchalant up there in that cockpit, going 115\nMiles an hour, with the police chasing him. Ehm, they're not gonna be\nReal happy when they catch up with him, no matter what, the eh\nEhrr, they hate, they hate a bigmouth even worse.\"\n\n[Verse 3]\nOfficer Bird's on his way, and I don't wanna see him\nCould you please give me the keys to the B.M.?\nSee, I didn't want to gank you\nBut don't make me bank you, thank you\nTried to get yo the hood, and you might guess\nThat a fool like me done shot Cyrus\nIncognito, Ghetto Eagle\nSaying, \"Fuck, where did he go?\"\nI bust me a left on Ruthelen. Park\nThe 735 and I'm bailin\nWent to my homegirl's house and got a hug man\nShe helped me run like Harriet Tubman\nLooked out the window by the black bed\nI saw the pigs and the four on a flatbed\nThen the light from the bird hit me in the face\nI close the blinds cause I didn't wanna catch a case\nAll that night, I heard the bird circle\nWhile I was eating fish and watching Urkel\nShe said I could sleep on the couch\nBy two A.M. I was digging her out\nFuck the ghetto bird\n\n\"Which way is he going now?\"\n\"Ok, now..now he's..he's actually southbound..on a service street\nAnd, uh...Gee whiz, uh, I'm gonna get my maps out here and figure\nOut which service srteet he suddelny turned off on. Uh, the sherriffs\nAre..are...well I know that...Sherriffs ground units got thrown off\"\n\nMotherfuck you and your punk-ass ghetto bird", "image": "https://images.genius.com/7130347bb47a4a618915a6de2818699a.1000x1000x1.jpg", "album": "Lethal Injection", "year": "1993-12-07"}]}