{"songs": [{"lyrics": "Old school, new school need to know this I burn like\nLeft Eye Lisa Lopez, burn slow like blunts of hydro\nJigga Man, BK shit, y'all know\nJigga Man, ya heard, the fugitive allow me to spit on this Clue shit\nAllow me to thank the people for all of their support and your prayers\nAnd all the people that prejudge me, fuck you, suck my dick\nD.A. act like a nigga starvin' for Jay if they lock me in a cage\nFuck it, party away I'm still hot, I'm still S dot y'all\nStill got Millions buried in the sock drawer\nStill holdin' my own on the corner nigga\nWhat can't kill me can only make me stronger nigga\nAnd when I get back home get your ass up out the throne\nIt's just goin' back to the way shit was\nI'ma stay hot no matter what my shit does\nI could drop a straight dud, I'ma stay up niggas tryin' to break my will\nYou know that ain't my steel I'm Destiny's Child, my fate's been sealed\nYou're dealin' with a higher power I'm like Dwight Eisenhower\nMy life can move a thousand miles and hour reflect me folks\nAs my world turns like the wheels on a bicycle spoke\nIt's much deeper than a soap, it's a constant drama series\nAll they see is money, they want me to blind the jury\nAll this bullshit can make the mind weary but my theory\nIs the sun shines clearly\n(The sun will shine clearly)\nNow everybody wanna rhyme like Hov' 'cause I rhyme\nLike I be rhymin' in the Rov' climbin' in them hoes\nMy minds like the diamonds, I'll blind you at them shows\nI don't shine, I glow, I remind you of that dough don't I?\nMurder niggas won't I?\nMy persona, hustler turned rapper, smell the crack aroma\nSend shots like toma in any language\nLeave niggas in a coma when I'm bangin' that Fifth\nGet chicks lit off Coronas and bamboo spliffs\nAnd get the camcorder to cam cord their hand movements\nAnd for what? Y'all actin' like y'all better than Hov'\nY'all niggas should open up for the Letterman show\nNiggas is funny, all I do is get money\nAnd y'all niggas sound funny to me everybody's rappin'\nLike they better than Hov' but thats shits real funny to me\nI'm at the forefront of this rap shit, truth is truth\nLook around at all the platinum, proof is proof\nListen to how niggas is rappin', thats do to who?\nBut I'ma let niggas live 'cause it's beautiful\nLive niggas\nJigga Man ya heard? Clue Duro", "title": "Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}