{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/330345c8e2f17c8bf3fe4a8ab26ca88a.640x640x1.jpg", "title": "East Side Rendezvous", "year": "1995-10-24", "album": "Smile Now, Die Later", "lyrics": "[Verse 1: Frost]\nI just woke up, thank God it's Friday\nFire up the lac and hit the highway\nPulled in the car wash, so we can hit them whitewall tires\nSedan DeVille sitting on L.A. Wires\nAnd it's got to be 80 degrees\nI got a check in my pocket for fifteen G's\nHit the first interstate, now I'm straight\nStop at the record store to pick me up an old school tape\nBack in my ride, see the spin of the tires\nKid Frost rolling, bumping Earth, Wind, & Fire\nIt feels good holding fifteen grand\nSo I parked the Sedan and I strolled into Greenspans\nGive me a pair of your 50-30s\nCascades, Cortez and a jet-black hoodie\nHeaded back home and got G'd-up, fool\nIt's an eastside rendezvous, yeah yeah\n\n[Hook: Diane Gordon]\nCome on and roll with me on that late night rendezvous\nCome on and roll with me like them OG's do\n\nCome on and roll with me on that late night rendezvous\nCome on and roll with me like them gangstas do\n\n[Verse 2: O.G. Enius]\nNow, who be that brand new daddy of the year\nI swear; baby, we gonna take you there\nIt's me, that eastside G y'all never heard of\nWith A.L.T. and them folks getting much love\nThrough the neighborhoods, through the city\nWoofers in the back bumping 'do-wah-ditty', yeah\nDrop a line to them hookers for their info\nPack them smokes, LA capping with their khacks low\nCause we some true players, bandits\nGot them hynas at the hotel and they can't stand it\nI got that sexual healing on them\n36-double-deuce-36 and I'm feeling on them\nOoh-eee, I see, she got it going on like a true Miss G\nBut I'm a stay true P-I-M-P from the eastside\n\n[Hook]\nCome on and roll with me on that late night rendezvous\nCome on and roll with me like them OG's do\n\nCome on and roll with me on that late night rendezvous\nCome on and roll with me like them gangstas do\n\n[Verse 3: A.L.T.]\nNow it's Friday night and everything's alright\nSo just sit back, relax and enjoy the flight\nIt's A.L.T. hitting corners in the 63\nAnd I'm straight rendezvous-in' through the SGV\nAs the 18's blast, pop the tape in the dash\nBumping old school fools like Teddy Pendergrass\nI can feel the heat coming out from underneath my seat\nI never heard the word 'defeat'\nIt's the middle of July, so it's hot\nI think of Kid Frost, he's recording at the G Spot, fool\nFrost said, \"I hope the one time don't stop ya\"\nI don't give a damn, I'm sipping Malibu and Vodka\nI'm on that San Bernardino\nIn the fast lane cause baby got some hynas out in Chino\nAnd you know that I'm a G'd up fool\nIt's an eastside rendezvous and I'm there\n\n[Hook]\nCome on and roll with me on that late night rendezvous\nCome on and roll with me like them OG's do\n\nCome on and roll with me on that late night rendezvous\nCome on and roll with me like them gangstas do\n\n[(chanting ahh)]"}]}