{"artist": "Drake", "songs": [{"year": "2007-09-01", "album": "Comeback Season", "image": "https://images.genius.com/866a4a7df935705e834f236499d617c6.1000x1000x1.jpg", "title": "Don’t You Have a Man", "lyrics": "[Hook: Dwele]\nDon't you have a man? (Don't you got a man?)\nWhy are you trying to be my girl?\nI can't believe it\nDon't you have a man? (Don't you GOT a man?)\nIt's alllll-right with me, my girl\nWe can do anything\n\n[Drake]\nWhy you over there lookin at me\nWhile your man standing right beside ya?\nThe temporary happiness he might provide ya\nBut you know and I know, that nobody gon do ya like me\nTryna save you like a goalie in line of sight\nI know that I feel her, but slowly I'm kinda like\n\"I don't really wanna hit this girl\"\nAnd so she want this chap's stick like Napoleon Dynamite\nWell, I'mma give it to you, honeybunches\nYou feel it all under ya ribs like some tummy crunches\nAll my other girls all up on that subtle shit\nThey don't wanna cut it, they want a rapper to cuddle with\nConsequences keep weighin me down\nSo whenever she thinks I'm serious, I'm playin around\nIt gets deeper and cold-ER, the funny thing is\nI'm writin this in my head and she asleep on my shoulder like...\n\n[Hook: Dwele]\nDon't you have a man? (Don't you got a man?)\nWhy are you trying to be my girl?\nI can't believe it\nDon't you have a man? (Don't you GOT a man?)\nIt's alllll-right with me, my girl\nWe can do anything\n\n[Big Pooh]\nLook...we had a lil' thing, a wintertime fling\nYou some getback for your man mistreat thing\nBut that was then, you know some hush-hush\nI ain't never really see a future in us\nPlus your man still there, let's be fair\nYou'll do the same things to me\nMy feelings never did go past, some late night smash\nI'on't wanna take the place of he!\nLate night's 85 South on my way to the crib\nAnd somebody got a song for me\nI already know what you about, cause I been the other man\nAnd you NOT gonna trap me witcha silly lil plan\nIt's my bad, shoulda chose a wo-man\nBut I'm in the mix with this lil' girl playin\nI'm sayin, you need to do what you do\nI'm NOT tryna take it any further with you, C'MON\n\n[Hook: Dwele]\nDon't you have a man? (Don't you got a man?)\nWhy are you trying to be my girl?\nI can't believe it\nDon't you have a man? (Don't you GOT a man?)\nIt's alllll-right with me, my girl\nWe can do anything\n\n[Phonte]\nUh...uh...I met her at the bar sippin on Patron\nAnd now it's been three years off and on\nCause the same page, we are rarely off and on\nCause when I'm in, she out, and when she in, I'm gone (c'mon)\nWe lost contact like Bausch & Lomb\nBut regained it while she was buildin her house a home\nWit this new cat, sayin that he doin her right\nIt just proves that, she don't know what to do wit her life\nCause if so, she wouldn't have to change her strategy\nAnd wouldn't need me to recharge her batteries\nOne minute she mad at me, next minute it's all good\nAnd I'm in her body like Gray's Anatomy\nI don't understand why God sent me to you\nAnd I cain't try to justify that foul shit we do (uh)\nAll I know is that each time I'm stickin you\nI think to myself, \"Damn, if only her nigga knew\", but...\n\n[Hook: Dwele]\nDon't you have a man? (Don't you got a man?)\nWhy are you trying to be my girl?\nI can't believe it\nDon't you have a man? (Don't you GOT a man?)\nIt's alllll-right with me, my girl\nWe can do anything"}]}