{"songs": [{"year": "2016-04-22", "lyrics": "[B.o.B]\nBorn into competition\nWith a feeling that something's missing\nBred in a corn addiction\nWith a synthetic composition\nOn the brink of a civil war\nOr the forming of one religion?\nI wonder what came first\nDinosaurs or Darwinism?\nPledging allegiance to a flag\nSince elementary\nWriting curses in cursive and casting spells\nStung by the spelling bee\nAnd they says congratulations\nYou graduated\nFrom slavery\nTo paid slavery\nYou actually made it!\nHere! Take this gown and cap and wave it\nLike a celebration of going to school just to get a job to pay for it\nLike a nation that traded it's minerals in exchange for paper payment\nHere, these are your gods, you have to praise 'em\nI wonder who we'd worship if we weren't captured and traded\nConsider this my affidavit\nYo, It's the ruling class\nHere to rule yo ass\nPrescription drug thug cocaine mule yo ass\nAgricultural skills sure would suit yo ass\nBut they say, living off the land is a useless path\nHere, work for dead Presidents, HA! fooled yo ass\nAny revolutionaries, they remove yo ass\nFast, click clack, quick blast, in a flash\nWhiplash from the kickback of the impact\nPush yo shit back\nAs long as my head is intact\nI'll be as political as I want\nBecause I get taxed\nNah, this ain't no fuckin diss track, to distract\nOr useless chit chat, or syntax, or\nWho's ass is this fat and who has a six pack\nWho's batting this average, or\nCompare his passes to his passes\nThere's a thousand sports channels\nYou can get this package, or this package\nWho's this savage?\nHey, let's compare your emotional baggage to my emotional baggage\nAnd see who calls each other bitch fastest\nHaters go out they way to fuck up my day\nBut I ain't even worried about your bitch asses\nAnd it's quite the optic, hard to take your eyes off it\nThey make the sky toxic\nPrescribe the antibiotic\nMake a high profit, divide the margin\nYou could die off it\nIf you do, they hide the autopsy\nWhat the fuck are you supposed to do?\nMorgellons in your kosher food\nWhat the fuck is even kosher food?\nThird generation crops won't produce\nBe careful who you keep close to you\nI'm from Atlanta, but shots out to my Oakland crew\nThey say, \"Bobby Ray, the older you is overdue\"\nI say hey, sorry I got a little caught up exposing truths\nI used to think, what would Hova do?\nNow I think, what the fuck would Macho Man and Hulk Hogan do?\nNow, if Steve Austin was America, and the Rock was Afghanistan\nThen Russia and China would be Triple HHH\nAnd the Illuminati would be Vince Macmahon\nNow when the haters are The Undertaker\nThe crowd doesn't stand a chance\nWhen the international bankers are walking through the stands\nSlide yo ass some Xan\nYou think you a fan but you really just a lamb\nNiggas start trends every day but don't never get no pair of Vans\nWhat the fuck is an advance?\nNiggas live on colored people time\nWhat the fuck is in advance?\nTsh, I don't fucking understand\nI just want my fucking bandz\nI'm a walking talking human conundrum\nLike a Muslim going HAM\nLooking for the promised land\nFalse stories of Christopher Columbus\nHolding Pocahontas' hand\nBlack History is the shortest month\nI just hope you understand, when the\nNative Indians don't get shit but\nThanksgiving and some yams, like\nHere, here's a few casinos, huhh, sorry we took all your land, huhh\nWell, let's just move on, because, America's great!\nMan I fucking love it\nDemocratic or Republic\nLightning rod, change the subject\nAll of these religions, I'm glad I found one\nAll of these beliefs and mine's the right one\nTrying to process all this info you hide from\nTill you wake the fuck up out on the advice son\nCulture and religion condition your mind hon'\nWhatever's prohibited, imma defy them\nThe smell of freedom is making my eyes run\nTo authority, i'm the antithesis\nI'm not a pacifist, or a philantropisist\nI don't got all the answersises\nI just got a louder mic, and better stanzasas, bitch\nOh i'm sorry, did I offend you?\nWhat the fuck you think goes on in schools you send your kids to?\nWhat the fuck you think they serve for lunch, what's on the menu?\nThat's why only ratchet shit is what these kids is into\nA language comprehendable\nFriends do what they friends do\nPeople act so fucking hard but really they just gentle\nPsychological children\nGrownups with issues\nGrownups with children\nWho grow up with issues\nCancer tissues\nAbandonment,  misuse\nSubliminal marketing screaming, \"Here, let me fix you\nI have the cure\nI have the remedy\nI am the savior\nI am not the enemy\nBut give me your money, give me your money, give me your money!\"\nEverybody's in debt\nBut this is a free country!\nThey dock your pay, what a mockery\nWhy you on the clock\nHickory, dickory, dockery\nThey want cable, they want coffee, they want comedy\nAnything to take they mind off being property\nTrying to say it properly\nWorking on my tact\nBut I am the anomaly\nThey know i'm the shit like a elio-colonoscopy\nThey know i'm the shit by just looking at my discography\nThey know i've been sent to awake this idiocracy\nMass media, hipocrisy\nTurn you into a worker bee\nHarvest the honey tree\nI'm just being honest, b\nMother Earth quakes underneath\nFather Sky, up above the sea\nGod the father, the sky\nSon of God, the Sun\nAmun Ra, the Eye\nNo more Amen\nNo more folding hands goodbye\nAdios, au revoir, bandz", "title": "{{{EARTHQUAKE}}}", "album": "E.A.R.T.H (Educational Avatar Reality Training Habitat)", "image": "https://images.genius.com/288c59f28a4e9c1559eae1f7558abb79.600x600x1.jpg"}], "artist": "B.o.B"}