{"artist": "YG", "songs": [{"image": "https://images.genius.com/4f22072ae134f53926f9d67d51dfb5ce.500x500x1.jpg", "year": "2013-01-21", "album": "Just Re’d Up 2 ", "lyrics": "[Hook: YG]\nI like big money, I rock big ice\nBig booty bitches, that’s what I like\nCiroc on the ice, bring it with the lights\n‘Cause that’s what I like, I like, I like\nYeah, that’s what I like, I like, I like\nThat’s what I like, I like, I like\nThat’s what I like, I like, I like\n‘Cause that’s what I like\n\n[Verse 1: YG]\nThat’s what I like, yeah, that’s what I like\nIf she look like Beyonce, that’s what I pipe\nBut never no wife, I do these hoes trife\nThis my bread, you will never get a slice\nBig dick bandit, fuck you wanna hand me?\nIt’s a no-go if that pussy smell like salmon\nI said I wanna fuck, she said “K”\nIn one day, I blew 100K\nWe in Miami, staying at the Perry\nYou always getting milked like you stayed at the dairy\nI be having problems, personal problems\nI overdosed on Gucci and Dolce Gabbana\nGot the clip in the K that’s a big ass comma\nYou ain’t getting money? I don’t have that problem\nThat pussy wet like pasta, I don’t eat lobster\nI gave her that dick and told her “Hasta mañana”\n\n[Hook]\n\n[Verse 2: Juicy J]\nFlex it like an athlete, ain’t no neighbors by my home\nGet faded like I’m fishing so you bitches know I’m gone\nYou know I’m getting blown – your girl give me dome\nFucked her to The Weeknd ‘cause she heard me on The Zone\nGucci I got on – Louis I got on\nIf it ain’t about no money, then please leave me alone\nHundreds I’m throwing, stupid bitch I’m grown\nHow you gong get these bands if your clothes still on?\nLean and Patrón, good weed and gin\nPass out, wake up and do it again\nBitch I go in, don’t act like you don’t know\nYou say no to turn-up, Juicy J don’t\nFinessing them racks, moving them packs…\nSpending them bands, making ‘em back…\nHaters gon’ hate, that’s a guarantee\nBe about your money, broke niggas ain’t hearing me\n\n[Hook]", "title": "I Like"}]}