{"songs": [{"album": "You Can’t See Me", "image": "https://images.genius.com/557d437bf932b93b08ec3950a791448a.600x600x1.jpg", "year": "2005-05-10", "title": "Bad, Bad Man", "lyrics": "[Intro: John Cena]\nAww, you done did it now\nChaos you shoulda put this one in the vault man!\nThey not ready - they don't know what's comin man!\nOh we gonna drop this on 'em right here\nY'all ain't ready for this, Y'ALL AIN'T READY FOR NONE OF THIS!\n\n[Verse 1: John Cena]\nYour boy's a bad man, and we invadin the streets\nMake unclever rappers scurred, they be droppin the heat\nShocked the world, now I'm standin alone\nI flip fools like them clamshell cellular phones\nYou can't help but nod your head to the track\nFuck the watered down rap, we be takin it back\nGive it to me straight - ain't no chasin it\nCheck yourself in the mirror - ain't no facin it\nCause you, playin the role and you plannin to fold\nThis the masterplan, we got the planet on hold\nWe all over the streets like your favorite sneaker\nBreakin up your sound like a drive-through speaker\nEverything that I be spittin is strong\nAfter I rock, fast forward through the rest of the song\nWe the monkeywrench, that's gonna ruin your plan\nAnd don't fuck with John Cena - I'm a BAD, BAD MAN\n\n[Hook 2X: Bumpy Knuckles]\nWith the mic in my hands I'm a bad man\nEven in a fight with the hands I'm a bad man\nLivin in the streets all my life I'm a bad man\nI'm a bad man, I'm a bad man\n\n[Verse 2: Tha Trademarc]\nWe devils - rockin ambient levels\nWe set loose among hot tunes to instrumentals\nAnd cats got one-liners, I drop several\nAnd I think it's funny you choose, losin progress\nOr runnin in place; we makin moves, and y'all settle\nI rip rappers and take responsibility\nFor makin future hall-of-famers look third rate\nY'all are lost for words like conversation on your worst first date\nAnd ride beats, creep through side streets\nLooseleaf notepads that's where rhymes leak\nPunchlines - man, don't even beg\nI got knee-slappin tracks, y'all brusin your leg\nYou a rhyme writer - funny man, that's a joke\nYou ain't worthy of bein my secretary man that's a quote\nI flood tracks like cracks in boats\nAnd pussy rappers choked up with they own lines in they throat\n\n[Hook 2X: Bumpy Knuckles]\nWith the mic in my hands I'm a bad man\nEven in a fight with the hands I'm a bad man\nLivin in the streets all my life I'm a bad man\nI'm a bad man, I'm a bad man\n\n[Verse 3: Bumpy Knuckles/Freddie Foxxx]\nTURN UP THE MICROPHONE and feed me I'm a beast\nMC's and they beats is what I eat, 16 I'll leave you in the street\nMy rhymes are sicker than gangrene in both feet\nIt's spreadin up the leg, and headed for the head\nYour rhymes are whack your style is proof that the brain corrosion\nIs fuckin with your chosen flows, I'm nice with mics\nMy hands'll break your nose like Mikey Tyson\nFightin in his prime, one rhyme\nAnd I shake up the room one time, BOOM! To the jaw\nYour face is a coat type raw\nAnd the blood and snot they mix, jelly on the floor\nMy love is coppin bricks, belly on the floor\nI'll rob you, you soft and you really ain't a problem\nI'll solve you, 357 long nose revolve you\nAcid in your face, bad look, dissolve you\nI'm a bad, bad man\n\n[Interlude: Bumpy Knuckles/Freddie Foxxx]\nYeah, check it out\nIt's Bumpy Knuckles baby\nAnd I want you to say hello to the BAD, BAD, MAN - C'MON!\n\n[Hook 2X: Bumpy Knuckles]\nWith the mic in my hands I'm a bad man\nEven in a fight with the hands I'm a bad man\nLivin in the streets all my life I'm a bad man\nI'm a bad man, I'm a bad man"}], "artist": "John Cena & Tha Trademarc"}