{"songs": [{"image": "https://images.genius.com/80b3bffcce799c7f5c2fceeacf7c8a41.1000x1000x1.jpg", "title": "4 In The Mornin", "album": "Crenshaw", "year": "2013-10-08", "lyrics": "[Intro]\nIt's that 4 in the morning shit\n\n[Verse 1]\nI'm off this Red Bull\nI got a head full\nA nigga stressed out, let's get this bed full\nSexual healing; so appealing\nYou a bad bitch, I'm a real nigga\nTell me that you love me\nI tell you the same\nThat's a fucking shame\nWe both runnin' game\nI just want your pleasure\nYou just want my pain\nI just want you all for me and you just want the same\nLet's take a flight; let's live this life\nLet's get a hotel, let's both spend a night\nI'm a busy nigga, you a busy girl\nIt's a fast life we liven' in this busy world\nWe in my fast car, you ain't no fast broad\nYou got yo' heart broke, he did yo' ass wrong\nPlus yo' dad gone, let me be yo' daddy\nI wanna see you happy we both come from broken families\nYou can tell the truth, I'mma tell it too\nWe gon' smoke this weed 'til they kick us out the room\nLike fuck it, that's life\nFuckin' tonight; we fuckin' right?\nYou fuckin' right\nI ain't goon' lie to you; I know I'm fly to you\nNah, fuck that girl I'm the sky to you\nOcean in the clouds; birds and the bees\nYour friends proud when they know that you fuckin' with me\nI got you poppin', I'll take you shoppin'\nAround the world; started on Slauson\nThat's real shit; real shit\nI know all my real bitches feel this\n4 in the morning, tell me that you want it\nBend you over, I got you moaning\nYou love this shit, you want this shit\nYou got this shit, no politics\n\n[Outro]\nSmoke something with you?\nIt's like we pouring' some more drink\nGet yours, I got mine\nThis that real shit\nSittin' on the top floor of the fly ass hotel drunk as fuck with a bad bitch\nMake you appreciate life\nNigga work hard you know\n7 days a week we do this shit\nYou should do it with me\nWhen I'm gone, shit play this\nI ain't trippin' on shit, ain't no rules in this\nFuck 'em all though\nHussle"}], "artist": "Nipsey Hussle"}