{"artist": "Bahamadia", "songs": [{"lyrics": "It's Da Jawn!\n\n[Verse 1: Black Thought]\nYo, it go on and on, on and on and on\nThe beat don't stop 'til the break of ya spine\nWhen I'm takin' ya mind to the next level\nLyrically, my specimen is hard for you to see or examine\nNow, dig it, I contaminate the 2-inch tape\nSensimilla in my PA state stimulates the M-I-C ministry\nEnemies who enter my chemistry can't cope\nI'm dope like crack, what I wrote broke ya back\nSo bust this cerebral attack, Bahamadia, where ya at?\nWhen we're comin' live from the area 2-1-5\nThe land of the master plan where the brothers scam and connive\nWell, it's the contraband clan, I'm hailin' from the brotherly land\nI stand sharp, it started or began at the park\nExpanded years and grew into careers\nCompetition, whut?! Fuck 'em, I cut 'em like shears\nIt's the un-rehabilitatable and frustratable\nI gotta get mine and that's non-negotiatable\nSo, put me on like Donna Karan and c'mon, uh!\nIt's Da Jawn!\n\n[Verse 2: Bahamadia]\nWhen I present my raps on the tracks, kids be like, \"Who dat?\"\nSugar be gettin' horror with the foreign for-a-mat\nThe competition better be easin' back\nLike recedin' hairlines on they pops when I drops\nDialect perfected with 2 lines connected\nApply it to my records like a CPR-uh method\nFunk provides my rhymes with a meal suppressant\nInjected like morphine in each lines, darin' they genes to come off\nLike silk screen or tank-tops, I rank top-notch\nAnd make black vinyl turn butterscotch in coloration\nFor my creation's captivatin' on sea-level\nMy Roots stays realer than E levels, it's Da Jawn\n\nIt's Da Jawn!\n\n[Verse 3: Malik B]\nYour style is like that of the La Costra Nostra\nIn between my pelvic and my belt, I ties my holster\nMost of y'all niggas with your legislation\nRevoke ya recitation and continue with my recitation\nFuck other opinions in my dominion\nThe throne won as a king from Illadelph, I'm not Virginian\nIcons I will just strangle just like a python\nYou lust this shit, I leave ya desolate like Saigon\nM-to-the-Ill, I show the skill\nIf your girl cooch stinks, she needs to Douche a Massengill\nA rebel with the treble like my man Bobby Seale\nAnd like the youngsters in Gang Starr, I got the Mass Appeal\nI spill words, when ill blurs still slurge\nWhat's up to P.R. Star, Snooka in the merge\nCome up to the surface, then once you get submerged\nTo go below because my flow got the urge\nNow, we can talk with tones and spark with the guns\nHowever you want it, Allah protects me when confronted\nIn duck season, with all these quacks that get hunted\nIf your ass was a field goal, well, then I'd punt it\nI drop topics all on your optics\nMuhammad Sallallahu Alaihi Wasallam was seal of the prophets\nHere's a Bobbitt but not Lorena, you feel the pain, still\nFrom 68th Ave. to West Oak Lane feels\n[?], that's my man\nStyles, I got 7, [?]\nMy lyric quota will cause disorder across the water\nIn all the borders, even up in Minnesota\nSince The Roots put me on, I Remain Calm\nBut stand strong, from 2-1-5\nIt's Da Jawn!\n\nIt's Da Jawn! x4", "image": "https://images.genius.com/c3f333fe50df0474b5bc5c334f14f219.1000x1000x1.jpg", "year": "1996-03-19", "title": "Da Jawn", "album": "Kollage"}]}