{"songs": [{"lyrics": "[Intro]\nHold up (Ayy)\nHold up (Ayy)\nHold up (Ayy)\n(Bankroll Got It)\n\n[Chorus]\nNut up on his face, tell him, \"Mask off\"\nAny bitch got a problem, we can match off\nShorty said she was real, take that Mac off\nSame city, same hood, bitch, you mad fraud\nFuck him in the telly watchin' Belly, ayy\nAsian pissed on a bitch like R. Kelly, ayy\nIt's so hot I took the party, playin' Nelly, ayy\nHe put ice around my neck to make him jealous, ayy\n\n[Verse 1]\nRunnin' through the game with no cheat codes\nBad bitch in designer, she a freak ho\nMoney over niggas, bitch, that's been the memo\nLeft a nigga down bad, how you take those?\nYou ain't slidin', you ain't ridin', bitch\nYou ain't poppin', why you speakin' on a fly bitch?\nGettin' money in my sleep, flyin' private\nSnipers on the roof, killers move in silence\nAyy, pop out, nigga, we can rock out\nYou ain't seen no M's, they used to laugh and now I'm up now\nFendi cost some thousands, 40 racks to break a bag down\nBitch ain't seen no money, when she leave she get a pat down (Bitch ho)\n\n[Chorus]\nNut up on his face, tell him, \"Mask off\"\nAny bitch got a problem, we can match off\nShorty said she was real, take that Mac off\nSame city, same hood, bitch, you mad fraud\nFuck him in the telly watchin' Belly, ayy\nAsian pissed on a bitch like R. Kelly, ayy\nIt's so hot I took the party, playin' Nelly, ayy\nHe put ice around my neck to make him jealous, ayy\n\n[Verse 2]\nFirst young bitch with a bust down\nI'm the first young bitch that was totin' rounds\nAnd the first young bitch with her own sound\nSo these bitches don't deserve to get a princess crown\nAyy, let 'em tell it, they up next, ayy\nLet me show you how you do it, but the best, ayy\nBitch you older, and you losin', she a bird brain\nAin't beefing on the net 'less a check came\nGrabbin' on my neck, then stroke\nTreat me like a doll, but he fuck me like a hoe\nReal street bitch, he a green, he a go\nAin't stressin' over niggas, I'm addicted to the dough (bands)\n\n[Chorus]\nNut up on his face, tell him, \"Mask off\"\nAny bitch got a problem, we can match off\nShorty said she was real, take that Mac off\nSame city, same hood, bitch, you mad fraud\nFuck him in the telly watchin' Belly, ayy\nAsian pissed on a bitch like R. Kelly, ayy\nIt's so hot I took the party, playin' Nelly, ayy\nHe put ice around my neck to make him jealous, ayy", "album": "So Icy Princess", "year": "2018-10-17", "title": "Rock Out", "image": "https://images.genius.com/041218418233476d7ebce34aad3d3544.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}