{"artist": "Inspectah Deck", "songs": [{"title": "The Movement", "lyrics": "[Inspectah Deck]\nYe-yeah\nSmooth like a green Caddy, ya fiend badly\nHeads spin like Giovanni's on the Navi\nHammers spit, quick as the darts, niggas part\nLike the Red Sea, test me, I'm sick with the art\nBeen held back, it's either rap or sell smack\nBlack Knight like Martin Lawrence run tell that\nIt's the I-N-S-P-E-C-T-A-H\nLivin' life on the line, I hope I see daybreak\nThis is ground level, rounds echo out the Special\nBe easy, U.D.'s out to get you\nThrow it in the smash (so fast)\nKnown to spaz (go ass)\nWe like strippers makin' niggas (throw cash)\nSmoke the blue green (call it topaz)\nFake thugs (hold ass)\nYou be the next rapper (fallin on ass)\nWanna measure my size? I rise above the norm\nThe urban icon ridin' on the eye of the storm, fool\n\n[Hook: Inspectah Deck]\nAll my people from the front to back\nIf you want it like that just.. MOVE!\nGet ill, no time to chill\nYo, you feel what I feel then.. MOVE!\nGirlfriend, you love how it sounds\nPut ya drink down and.. MOVE!\nCOME ON! COME ON! COME ON! COME ON!\n\n[Inspectah Deck]\nWhat ya do now, put ya loot down\nYou can bet it on the new sound\nHeavy like a Hummer on deuce pounds\nTrue hounds, on the loose in ya town\nBound to the move the crowd, it's The Movement (you down?)\nScream at the top of ya lungs\nPop one for Aaliyah, Left Eye, BIG, 'Pac and Pun\nRide with me shotgun, rock with son\nHeads bop to the drums, still shocked and stunned\nCome alive y'all, gangsta like white walls\nOn the blue Snoop Deville, watch ya eyeballs\nBlade stay choppin' the track, game top of the pack\nI spit flames y'all acknowledge the fact\nFind out Big Rug get it poppin' like that\nThrow it down like Stackhouse, cockin' it back\nSo ladies? Is you wit me now? Don't fake down\nEverybody brace yaselves, it's a shakedown\n\n[Hook]\n\n[Inspectah Deck]\nI do this for dough, but it's really for love\nFeel me, it's love for hot girls, willies and thugs\nMy groups cross seas, call us junglin' thugs\nAnd it's sure to move ya feet like a gun in the club\nI blaze like a ounce and a half, stay countin' the cash\nFor all lames that doubtin' my craft\nHe's no pretender, he won't surrender\n(He's a rebel) Don't y'all remember?\nA major player in the game\nPlay the frontline, ain't afraid to make a change\nI stay way beyond range\nSo far from the norm my code name's Doc Strange\nNow get down with the get down\nSendin' missles to all my dogs in the big house\nMake 'em wig out, Spiderman still on the web\nLog on like ya clickin' the mouse, yeah!\n\n[Hook]", "image": "https://images.genius.com/c3d252f814a4716a7a99fe1984ad2678.948x936x1.jpg", "album": "The Movement", "year": null}]}