{"artist": "Phora", "songs": [{"album": "Still a Kid", "title": "Breathing Room", "image": "https://images.genius.com/98a5adc4fa74d377810f8c390ea44183.1000x1000x1.jpg", "lyrics": "[Verse]\nWe in this, mind your fuckin business, nigga\nLook, check it, look\nNowadays everybody wants somethin from me, always askin me for a favor or some fuckin money. And they actin like I'm swimmin in cash, but I'm just tryin to make this little bit last. I'm with this new girl and I kind of think we did it too fast. We should have waited, but that shit's in the past. And I can't change it, I'm hopin that she's different. I hate dealing with the same shit. She says I make her happy, that doesn't make sense, because I haven't been happy since o-nine, even with four hundred fans around me at show time. I keep tellin myself that I'm happy with what I'm doin but the truth is I feel like something's missing, I'm about to lose it. Bout to lose my focus, bout to lose my mind, got me feelin hopeless all the fuckin time\nAnd these niggas around me don't make it better, tryin to start a fight over a female or some cheddar. Ego too big walkin round like I'm on somethin, but I never waste my time cause I know it's nothin. And I know where I'm headed, yes I know the situations they gon get left in and I ain't havin it. Everyone's actin like I'm their boy but I think back to when I didn't have no money, didn't have no girls, didn't have no fame, didn't have the world, look, in the palm of my hands. Now they see I'm makin moves and they wanna be friends, y'all disgust me. My mind is filled with doubt when the woman tells me she loves me, cause does she love me for me, or cause I'm the dude that all her friends are comin to see?\nNiggas only nice to me when they want somethin for free, but I just try to keep my distance and do nothin but me. And I got a lot of, heh, yeah I got a lot of pressure on my shoulders. I think of all the people I'll be next to when it's over. Nothin lasts forever, and either will I. I just hope that you remember me when I die. Real shit, don't get mad if I don't answer your calls, cause I'm too busy tryin to catch what I lost\nOld friends say I'm fake and I changed how I used to be, but I'm just growing up and learning newer things. And if you can't understand it then cut me loose, but I guarantee you everything I tell you is the truth. Niggas all up in my face tellin me I need to speak to you, back the fuck up, I need some breathing room", "year": "2012-11-18"}]}