{"artist": "C-Rayz Walz", "songs": [{"title": "Cannibal Box - Wild Kingdom", "album": "Off the Radar: Exclusive Lacerations", "year": "2003-09-25", "image": "https://images.genius.com/45bc71d58be69256a0b5f9c5f3abc51d.1000x1000x1.jpg", "lyrics": "[Hook 1: C-Rayz Walz]\nHey, kids.  Wanna hear something bugged?\nWhen the knife’s in your back, the slugs under the rug\nIn this wild kingdom, watch the animals rock\nA mechanical plot in a cannibal box\n\n[Verse 1: C-Rayz Walz]\nMy troops think fast like mongoose math in class\nWith king cobras, other large snakes in the grass\nWith the speed of a lightning flash\nArmy ants move past to splash your grasshopper stash\nGet mad, think long range like giraffe brain playing in grain\nTerrain lion mane wisdom drips his pain (Pain)\nFireflies spit, some suicide-sick monkeys flip\nBut hold strong like gorilla grips of clips\nShells in the cylinder, kid.  The beast will release sooner or later\nIn this room of perpetrators like [Sooner to?] Gators\nPredators should watch out for player haters\nWho have imaginary lines like equators\nElectric eel peels with slicker moves\nAnd bounce quick like kangaroos after they kick it with you\nThirteen arrows snatched from the eagle’s grasp\nUsed by the Sagittarius to strike the fatal blast\n\n[Hook 1: C-Rayz Walz]\nHey, kids.  Wanna hear something bugged?\nWhen the knife’s in your back, the slugs under the rug\nIn this wild kingdom, watch the animals rock\nA mechanical plot in a cannibal box\n\n[Verse 2: C-Rayz Walz]\nA swollen force from a Trojan Horse\nA past Odyssey, modestly, was a stolen course\nNone of your men are raw like lab rats chased by the Minotaur\n(You’ll die!) in a minute or more\nYour flight’s fable—like Pegasus, you don’t soar\nFrogs bounce off logs, move door to door\nLizards with Glocks slide off to plot\nYou could see the phoenix rise when the block is hot\nWatch your step—you in danger shoes\nIn the belly of the beast, it’s sad but the anger soothes\nCrackheads are vultures who kill what’s dead\nMost thieves stuck up—they stuck down instead\nBlood runs red like baboons striped to face you\nFalcons fled, search for eggs from aerial angles\n“I hate you” is law when the meat’s raw\nBut this is what you waited all year for like bear snores\n\n[Hook 1: C-Rayz Walz]\nHey, kids.  Wanna hear something bugged?\nWhen the knife’s in your back, the slugs under the rug\nIn this wild kingdom, watch the animals rock\nA mechanical plot in a cannibal box\n\n[Hook 2: Samples with Scratches]\n“Animals.  Animals.  Ani-animals” - [?]\n“Animals.  Animals with speakers on” - [?]\n“Animal rap.  Animal rap” - [?]\n“The animals are cannibals to do you in” - [?]\n\n[Verse 3: C-Rayz Walz]\nThe cats and dogs should form a large group\n‘Cause they both got beef with Old MacDonald\nMr. Eagle stay bald.  Razor-sharp claws in his contract\nHis chick irie, made you itch off contact\nA bug’s life: dragonflies is thug type\nMosquitos sniff through long needles—illegal drug pipes\nKiller bees spark lighters, flyers get liver\nAspire to be wiser and, in Nas, see the spider\nGoats gruff, wolfpacks rock sheep skin, stay creeping\nThe Earth was square—tortoise raced hares off the deep end\nThe old owl peeped the cypher all weekend\nIn our crew but he knows “Whooo” and creeping\nKing of the jungle when I come through, screaming, “One, two”\nLike Noah, other animals flow up the mumble\nThe jackal’s laugh made the pigs show up\nThe math made Jack’s beanstalk grow up\n\n[Hook 1: C-Rayz Walz]\nHey, kids.  Wanna hear something bugged?\nWhen the knife’s in your back, the slugs under the rug\nIn this wild kingdom, watch the animals rock\nA mechanical plot in a cannibal box\n\n[Verse 4: C-Rayz Walz]\nLike gnats, your riffraff is irrelevant\nMy big splash is the bath with six elephants\nI trained with Amanda in search of the golden panda\nElements stood tall like bamboo trees\nOn lakes, I meditate and breathe through a reed\nIntakes oxygen through a mountainous vapor sneeze\nTag my name in Japanese on Chinese newspaper\nTale of a humpback whale who does flavors\nWe take out music with samurai swords\nDragons transform to Honda Accords\nFive-finger energy clench like this\nC-Rayz Walz, my animalistic kit\nDialogue dispense through divine evidence\nBut... ROAR!  What type of style is this?\nLion fist, poisonous scorpion piss\nDropped the elephant shit right in front your donkey bitch\nNow trip on this like snail dick and flip sick\nBig scripts thick like llama spit\nHyenas laugh at your ass and blast silver\nAnd if you ever come back, we’ll kill ya!\n\n[Hook 1: C-Rayz Walz]\nHey, kids.  Wanna hear something bugged?\nWhen the knife’s in your back, the slugs under the rug\nIn this wild kingdom, watch the animals rock\nA mechanical plot in a cannibal box\n\n[Hook 2: Samples with Scratches]\n“Animals.  Animals.  Ani-animals” - [?]\n“Animals.  Animals with speakers on” - [?]\n“Animal rap.  Animal rap” - [?]\n“The animals are cannibals to do you in” - [?]\n\n[Outro: C-Rayz Walz]\nHey kids"}]}