{"songs": [{"lyrics": "GUN FOR THE WHOLE FAMILY\n• a.r. •\nBefore shooting troops was cooler than hula hoops\nHigh noon was your basic whoʼs who of brutal truth\nHot summer gun or box-cutter slow dance\nTurn a youngʼn to a dozen paper dolls holding hands\nAnd tricky was a wooden horse pushed up on your porch\nSo chicanery was yours to engage or ignore\nI was on the ladder with a lotta dot pawns\nSo we carried lawn chairs and buckets of popcorn\nPass the popcorn\nBrawl fair, cop car\nVoyeur hawk him out his hinges, storm door splinters\nClamoring about, hammers out about to ring\nInfiltrate each others tribes and murder each others queens\nPacked to the very last rafter\nClung to the rafts and the Cameras to capture the damage\nNeck swivel with a chop-chop volley\nWhere the ants leave nothing but the bones and the car keys\nPardon if his Ttwo feet fester\nIt was rude of me people\nMeet left and lefter\nPlanted like a model of civility and honor for the sector\nBut never got his extra extra!\nPeace for the better but it wasnʼt entertaining\nSo they waited for the tazing from the safety of his haven\nLike bees to the honey when they lumped you up\nCuz bumper cars are only funny when they bump. know that\n\nHot summer gun or box-cutter slow dance\nPopcorn, pocorn\nHot summer gun or box-cutter slow dance\nCapture the damage, capture the damage\nCapture the damage, capture the damage\nPopcorn, pocorn\n\n• el-p •\nTune to hellemundo for action packed blasphemy\nBig city translate your face ʻtil it atrophy...\nI let the shadenfreude boy out, actually\nDeployed devoid, with grin to watch laughingly\n(yeah bitch)\nPass the pʼs itʼs a laugh in, I can smell the tragedy\nWhen hatchinʼ\nHappily dispassionately patched in, alive with the menace of demise\nLike \"yes!\" the pain dazzles...\nMan\nPass the popcorn, pass the popcorn\nItʼs reality at its fastest\nAnd yet it still unravels at a pace like molasses\nLike it's the last of the seconds\nBefore the worst of disasters stretch past us\nWouldnʼt you agree that it is fabulous?\nIn the corridors of entropous wars contort drastically\nTil it fits, I adjust to climates or the wilderness\nWalk along my spine take the pilgrimage\nUp into the section thatʼs reserved for the smirk of the coldest witnesses\nWork you motherfuckers\nHooray!\nThereʼs all day to die\nInnovate the mayhem with grace, the good form-fall\nFuck if Iʼm ʻa warn yʼall, now I got the front row to the greatest entertainment that an angel never saw\nSixty thousand watts of that raw\n\"pull the claw out of the trunk\" fun\nEach one teach one how to club one\nLook at how they bathe up in that dove blood\nItʼs gonna be a night of thrills and chills where the sacred is made of\nMud mud\n\nEach one teach one how to club one, club one\nPopcorn, popcorn\nEach one teach one how to club one\nWouldn't you agree that it is fabulous?\nPopcorn, popcorn\n...\nCapture the damage\n\n• a.r. •\nYo, it was a lazy day, it was amazing grace\nIt was a half-a-Dozen claymores daisy-chained\nIt wasnʼt daisies and crazy Eights\nIt was an ace of spades over a waiting game of slaves And saints\nAnd every trainee face-painted, while his great escape\nGrazed and ate\nHeʼll never make it\nWhen he aims he shakes\nAnd I was overly engrossed from a very locked door\nWith a couple milk duds\nAnd buckets of popcorn\nPass the popcorn\nClap clap, encore\nMonkey in the middle study how\nThe bunker took the missiles\nAge of Machines with nary a green screen\nSo the hecatomb is every bit as cutty as it seems\nI could tell the pet from the vet\nMoney where his canineʼs spread and never welched on a bet\nThat said, know the over-under on your local hunter\nAnd youʼll profit off his widow-makerʼs numbers every summer\nBump in the night, funny, will he catch and release ʻem?\nHas he mercy, will he hack em to pieces?\nIs he Dirty, will he hassle policeman\nAnd security breach\nUntil impurities\nLeak\nOver the circuitry?\nAnd nada milk and honey there, is only skulls and bunnies\nThat hop around drunk in the Land of 100 Mondays\nGod damn, pop the Redenbacher proper\nAnd for christʼs sake get this man a doctor", "title": "For The Whole Family", "album": null, "image": "https://images.genius.com/64fbb9620a6b5e79e87c654b74da5441.640x640x1.jpg", "year": null}], "artist": "Aesop Rock"}