{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/c56b2def03e1af3a453a4f80ba6e1cf2.500x500x1.jpg", "year": "2019-02-06", "album": null, "lyrics": "[Intro]\nYelawolf\nCatfish Billy Goat\nReally though... (Haha)\nYeah!\n\n[Verse]\nI must... I must be a fucking goat\nThe way this chain is hanging off my throat\nWarming up my vo-cals\nNeed somewhere to hang my coat y'all\nRay-Bans on my face, bitch I ain't looking at you, ho\nBut my guess is she would exit this shit with me, no, I know, yes I know\nBut fuck that shit! So pardon my French and English too\nBut fuck that also, cos I wanna hollow out my cuss words out on you\nGucci Gang, Gucci Gang, Gucci Gang, Pootie Tang\nTaking you over to the  studio and do my thang\nI am dope, jump on this track like Kangaroo Jack\nAboriginal boomerang, I am dope\nLeft, right, left, right, soldier step right up\nI'm airtight, fuck your stair flight\nI'm prepared like, I'm not scared like fuck your hairline up!\nBarber school, see I got haters by the carpool\nThey say I changed, that's because I got a jar full\nYou primates, monkey ass, white boys lyin' fake\nOh you a hip hop head? Bitch, your first record was Kanye\nYou just on a blind date\nYou get dumped with the rest of 'em\nWhen this current trend is over with--\nI'll still be on my way\nYeah, that laughable trend's like detachable friends\nThem fuckers show up to party\nBut when that party does end, they Gone with the Wind\nSo I hope that song that you spin makes you enough bread to retire\nBetter watch what you spent\nAnyway, that shit is dead like any day\nAll I'm saying is regenerate and penny save\nIf you swag surfing then certainly you'll ride any wave\nAnd you're already dead, homie, so pick any grave\nI pledge allegiance to the Slumerican flag\nTen stars for every letter\nLighting bolts to lead the path\nFor the slums I represent\nFrom the laundromats of cash, from growing dope illegally\nBreak the law and get the bag\nYeah, and take the saw and cut the slabs\nYou build your house with straw and mud\nThat when it rains your roof will sag\nDag, take the crawl before you run, that pace right there will win the race\nSo run the laps and not the drag\nBut what do I know, Fido?\nIf you're a dog, I'm a dog\nWe're just two frogs on a log singing in the moonlight till the DJ hits pause\nOr my body pit falls\nFrom the whisky sip, then I'm empty and tall\nTill the ink pen don't draw\nPut until then, friend, I'm gonna need another pen, dawg\nCos I’m a highly orchestrated life aboard the Earth\nI’m guided by the light, the light is inside the word\nThe brightest candle with the thickest wick\nMelanin is irrelevant‬\nI hear the kick, hat, snare, that there hits my soul, bro\nThat's why I go hard on beats and also get down with dough bros\nWhat the fuck, I'm too hard for lumberyards\nI'm too sick for cancer sticks\nBuilt that bridge to come across\nA ghett-o philanthropist\nHustle hand over fist\nA pro-phylactic, no chauvinist\nOh Jay no, fuck I'm smooth as shit (polished!)\nAnd don't shoulder nits\nNever made it to college...\nBut I made it to Shady!\nGave myself no other options\n\"Yela, you're dreaming, ya crazy!\"\nI saw the gap in the options\nThe South is an orphan and lazy\nNobody wanted to father it\nSo I made it my baby!\nYour rockabye the Rock and try and mash it all up\nAnd who the fuck am I!?\nDidn't reinvent the wheel\nI just threw spokes up under that Monster truck and rideeeeee\nSorry about the oil stains that I left on the road\nIf you slip and fall on the shit I talk, then I guess you're the run of the joke... (run of the joke)\n\n[Outro]\nDon't get lost in the timing\nIf the water's still then let it be... still\nIn this world when the lightning\nWhat you build ain't always exciting\nIt maybe years until they see and feel\nIn this world when the lightning\nYou've got to earn your invite...\nTrunk Muzik III", "title": "Billy Goat (Freestyle)"}]}