{"artist": "50 Cent", "songs": [{"album": "God’s Plan", "image": "https://images.genius.com/7488990258b7e75bb8e35de7a131ec87.697x694x1.jpg", "title": "Banks Workout Pt. 2", "lyrics": "[50 Cent]\n50 Cent; Lloyd Banks!\n\n[Intro: 50 Cent]\nNobody get hurt if nobody don't move\nJust give it up smooth (G-UNIT~!)\nMotherfucker you move I'll flash my tool\nAnd blast my tool (G-UNIT~!)\nNigga you don't know me, and I don't know you\nYou think you know my crew (G-UNIT~!)\n\n[Lloyd Banks]\nI been a problem since the old days, pimps and gold caps\nNow I'm in O.J. Simpson throwbacks\nY'all was wonderin where my ass been\nProbably vacationin on South Beach gettin head like an aspirin\nIf you gassed, I can let the tec pound your ego\nOr lock you in a closet with the West Nile mosquito\nThe press crowd in people, especially celebrities\nI'm heavily shittin on any Tom Dick or Gregory\nNigga you better be strappin; they want you dead if you rappin\nI'm tryin to cave your head and your back in\nI'm gettin bread and relaxin, and attractin a fan base\nOf females with e-mails and letters to fax in\nIn Vegas with a toaster and a blunt\nAnd the hotel I'm checked in, got a rollercoaster in the front\nI'mma post 'em when I stunt, the Sammy Sosa of the month\nBetter yet the whole season, nigga I'm still breathin\nEven though my dollars are green\nI rap for the kids that's too poor to waste eggs on Halloween\nI'm gettin swallowed clean, my habits are good\nCollectin all the karats I could\nSlidin from a stash spot to conceal the torture\nAnd a good silencer to make it sound like the Wheel of Fortune\nAll this careless talkin, cause I'm travelin and flossin\nHavin a good time, and you havin a abortion\nYou sucker for love, gettin married and divorced then\nCan't even afford the batteries for your Walkman\nI'm out the hood, burnin Cali weed on Slausson\nWhere set trippin turn to tragedies and coffins\nLook, I mean what I'm sayin, you schemin I'm sprayin\nYour team end up layin, on the sofa screamin and prayin\nSayin, G-Unit niggas be rollin crazy, holdin 80's\nOlder ladies starin cause they starin in that gold Mercedes\nSince 50 hooked up with Shady, now they tryin to book up and pay me\nIf you think I'm shook up you crazy, baby\nThe boy strapped two ninas\nSmokin out a bag big enough to fit on vacuum cleaners\nI wore a glove when I blazed you fatty, I ain't your baby daddy\nShe flippin, now he tryin to grab me out the navy Caddy\nI ain't your ave-y, papa was a rolling stone\nStockin up to own a home, pocket full of loaded chrome\nDrop and get a hold of dome, I know your motive homes\nYou mad, cause I'm fuckin half your Motorola phone\nI'm swift with the women I'm good with my words\nA lot of, niggas is hatin on what I deserve I'm hotter\nFront if you want, end up on the curb in your Prada\nAnd your mans runnin, ambulance comin\nAnother day another dollar, on the low from the Impala\nI can have a six still in my shower, motherfucker~!\n\n[Outro]\nNobody get hurt if nobody don't move\nJust give it up smooth (G-UNIT~!)\nMotherfucker you move I'll flash my tool\nAnd blast my tool (G-UNIT~!)\nNigga you don't know me, and I don't know you\nYou think you know my crew (G-UNIT~!)\nI send a nigga that you thought you knew\nTo come through and put a hole in you (G-UNIT~!)\n\n[50 Cent]\nLloyd Banks, ha ha!\n50 Cent! I ain't even gotta work hard\nLook at these niggas, ha ha ha\nThe fuck you gon' do now nigga!\nYou done had the same niggas in the background for a long time\nThink they gangster, but goin back and forth to jail\nWell jumpin the turnstile don't count nigga\nHA HA HA HA~!", "year": null}]}