{"artist": "Watsky", "songs": [{"year": "2016-08-19", "lyrics": "[Verse 1]\nI remember vividly\nMy tears dropping on the grey carpet on the top step\nPops giving me his best guess\nMe confessing the burning question stressing and concerning me and\nTurning me to a wet mess\nIt’s probably nothing\nI get it, I’m aware\nI know it’s probably stupid to be scared\nBut these days are flying past us and nobody seems to care\nIt’s like we’re sprinting towards a brick wall we’re pretending isn’t there\nWhat happens when we hit it?\nDo we split into a million bits\nOr do we come back as a bullfrog and talk in ribbits?\nWhat is it? What is it?\nYou got the answer so give it, so give it, so give it\nDon’t lie, what happens when we die?\nDad says, Georgie I’m just guessing from what I’ve been told\nProbably thinking, “How’d I raise this emo fucking nine-year- old?”\nSince I’m sorta really not religious it’s a crapshoot\nI roll a pair of dice\nAlthough the thought of paradise is very nice\nIn my heart I know I don’t believe in magic\nSo I’m thinking maybe death is like eternal TV static\nOr returning to the state before your birth\nAbsorbed into the earth\nThe fewer hours left the more they’re worth\nI admit that it’s difficult to think about\nI think everybody got a little bit of doubt\nYou don’t get to hide from it even if you shout\nNot a soul on the planet gets to wiggle out\nAnd he said that I know that’s it’s tough to take in son but it’s so early\nI can see you’re in a hurry but don’t worry cause\n\n[Chorus]\nThat isn’t for a long, long time\nThat isn’t for a long, long time\nThat isn’t for a long, long time\nThat isn’t for a long, long, long, long time\n\n[Verse 2]\nLife moves fast\nMade the mistake of blinking, twenty years passed\nNow I’m sitting in my living room in Brooklyn with my father\nWe don’t bother doing Christmas in the Bay any longer\nIt’s first time that we’ve had this conversation\nHe says “It’s tough to take in\nI know we’re not quite ancient\nBut we’ve reached age where we should probably talk arrangements\nWe could take it several routes\nWe could sell the house\nWe can’t work forever, eventually money will run out\nThat’s a spot taking a loan would help us cover\nWhich would make it tougher to leave something for you and your brother”\nStop—can’t you see?\nEvery meal that you paid for me\nAll this power to chase a dream\nAll this privilege not to crave riches\nBut it’s plain to me the key fact is it’s easy to act like cash means jack shit if\nYou never lacked it\nAnd the greatest honor I could have is to make a buck and pass back a\nFraction of all the happiness you gave to me\nAnd I will never make you live where you don’t aim to be\nAge is just data\nWe paint our story A to Z then dip out\nR.I.P. rip out, we tear out the pages\nTear up the stage and we take a seat\nMaking a vacancy\nFamous or not, we fade from the plot\nEvery day when a new night falls\nI ride around the sun on this big blue ball\nI get a bit further from the kid called Paul\nAnd I get a bit closer to the big brick wall\nBut since inching up to that fence\nI can run my fingers against all the bricks and mortar and sense\nThat it’s not so cold and so dense\nAnd although I’m mournful I’ve known that I’m not immortal\nI’m not banging into stone but I’m more heading through this portal\nWe’re born to return to home we’re all born to be mincemeat\nEverything dies except for Papaya King hotdogs on 86th St\nDad hands me a napkin tells me it’s been the same since the fifties\nHe didn’t always love the city but dammit he’ll miss me\nHow can you miss something after you leave, I agree that it’s sad, but please\nDon’t dwell on it Dad, because—\n\n[Chorus]\nThat isn’t for a long, long time\nThat isn’t for a long, long time\nThat isn’t for a long, long time\nThat isn’t for a long, long, long, long time", "image": "https://images.genius.com/caf3c17709b04ff24300da4d62da46fa.630x630x1.jpg", "album": "x INFINITY", "title": "Lovely Thing Suite: Conversations"}]}