{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/26d65093c145e92972f6e95f41326a21.300x300x1.jpg", "title": "Comin’ Home Atlanta", "year": "2006-11-21", "album": "I Pledge Allegiance to the Grind", "lyrics": "[Intro]\n\"Straight from ATL\"\nMan I'mma talk to you like a player right now cause I truly believe you are. Man, I've been around the world three times man and you know I'm not lying cause you know I've been with Outkast. I've been to London, I've been to France man, I've been to Japan, Australia, New Zealand. Tons of places man, seen beautiful things, seen beautiful woman of all nationalities and colors man. Been around the United States more times than I care to count. As I jump on this Gulf Stream 4, which they make is Georgia man, I gotta tell you my only thought is...\n\n[Hook]\nI'm coming home Atlanta\n\n[Verse One]\nI'm 33,000 feet descending from the atmosphere\nLanding on that brand new landing strip at Jackson Hartsfield\nLookin' for an O of 'dro, I hit my man on Copy Road\nBought the O now I'm rollin' slow down on National\nThat's where you see them Phantoms and them Benz's and them player's ride\nNote to Riverdale playboy, that's the southside\nNow I'm headed to the eastside, eastside\nWhere them young ass niggas at roll G right\nThe cab and the wood lock onto ya\nFrom Glenwood to Stone Mountain brah\nFrom the bricks of the dust to the pounds of the weed\nI swear to God brah they got what you need\nGot what you want, day or night\nHop on 20, light a blunt than ride\nThat's right\nSomethin' pretty sittin' next to me on the passenger side\nThick ass thighs, Chinese eyes\nYeah she got weed but that's aiight\nThat's okay, pushin' that koolaid Chevrolet through the streets to the tray\nWhere Mark grandmomma live, all in Thomasville\nPittsburgh, ?? south and Mccannivlle\nWhat you know about the heart of the city for a boy that ?? at home?\nRest in peace Capitol Home, the projects behind the Gold Dome\nSame crackers that was makin' laws\nWas hittin' projects buyin' raw\nAnd this ain't what I heard folk, this here what I seen and saw\nWhat's up to my boys in the north\nBroadswell, North Craw\nCobb County, Marietta, heard you get that late cheddar\nChop with us on the westside\nWe pie flippin' and bird shippin'\nGot it for cheap and we ain't trippin'\nI know you heard we kidnap children\nAnd kick down do's on momma's home\nBut man that's only when the drought is on\nRight quick before the end of song\nLet me see them A's, Killer's home!\n\n[Hook]\n\n[Outro: Killer Mike talking]\nYou know why I love this city? Cause we ain't no quitters. They done came through, they done burnt the town down. The town been burnt down and rebuilt again. Aw man we done fought all kinds of bullshit down here man. Especially us black folk man, it took a lot man. But since we got goin' man we've been goin'. Black man to black man, congratulations man. Just lettin' you know man. Just like that Phoenix that rise out the ashes man, that's the spirit of the A man. They held us down 15 years, we didn't stop, we runnin' this music thing man. What up to Cash man. What up to Luda man. What up to Jeezy, what up to Tip. What's up to all the homies that's really doin' it man. What up to the new homies that doin' it though. Grind Time Rap Gang, bang bang. Just to let you know man. I came from a city that overcame. I came from a city that won. So I'm a winner sucker. No matter what you may think of me, \"He ain't a star. He ain't part of it.\" So?! It don't matter. Cause I'm from a city of winners. A-Town. Grind Time Rap Gang. Bang, bang, bang"}]}