{"songs": [{"album": "Term Brady", "image": "https://images.genius.com/fda14a6f6ef0763ba83d0e2ce43c5e91.1000x1000x1.jpg", "year": "2015-10-09", "title": "Grade A", "lyrics": "[Intro]\n\n9th wonder on the beat\n'ology\nWho you know nicer than term?\n\n[Verse 1]\n\nDon't call me Term bitch\nCall me the Tokyo traveler\nRing rattler\nMicrophone fiend, spleen splatterer\nQueen Challenger, automatic with three silencers\nThese talents and this weed is high caliber\nThen i shoot 'em down, down\nBang bang\nSaid i put 'em in the ground, ground\nFar as we concerned, we gon' put 'em with the worms or\nMake your baby mama sniff the ashes out your urn\nLet the whole team smash, pass and take turns\nLet the whole thing blast, no flashing that's for her, I'm\nSick with the word play, nice with the blah blah\nSince i used to move bricks of baby powder\nBack on the scene like i'm reading a script\nDriving through my block slow like my seed in a whip\nWhat's the meaning of this rap shit? The meaning is this:\nMoney, hoes, cash, clothes, good weed and a fifth, you know?\n\n[Hook]\n\nWho you know nicer than term- Termanology?\nWho you know nicer than term- Termanology?\n\n[Verse 2]\n\nYo, what's today's mathematics?\nShow them the automatic\nGet your heart splattered on park av\nIn front of the cameras\nLeave 'em coughing up blood\nAnd his pockets like rabbit ears\nGive me a stick that i can live on for a half a year\nGive me a chick that loves to fuck, suck and swallow\nA fifth filled up with hallows and hennessey by the bottle\nGot the whole world sitting right dead on my shoulders\nI'm opening up doors like a gentleman s'pose to\nThe whole team shining and we rep for the culture\nDifferent city, different club, looking fresh on a poster\nReally I get love where you never should go to\nWithout that moose killer on deck in a holster\nGot the champagne spilling all over these hoes\nMoving white in that wet, call it rain in the snow\nTry not to get me upset, I'll aim at your skull\nAnd put your brains on the floor where your laces should go\nBang\n\n[Hook]\n\n[Verse 3]\n\nI'm the reason hip-hop sound hot this year\nSound anything like Term? Then sign right here\nOnly difference is, y'all can't duplicate what's original\nWhen y'all lack the chemicals in the brain, that's physical\nYou can't change it, it's genetically habitual\nIt's a ritual for me to expose the bitch in you\nEvery syllable's pivotal, audio or visual\nKen is in the coup cause the cardio is killing him\nIt's easier than stage ID lifted than weeded up\nThe media think they know you cause of your wikipedia\nTypical, don't make me hook off of you for principle\nFingerprints is stuck together for more than medicinal\nMan, i keep it G till the day that i die\nI'm 730 like the last day in July\nListen, you want beef i'll put the K in your eye\nTerm and 9th, we're the reason rap's staying alive\nYou know?"}], "artist": "Termanology"}