{"songs": [{"year": "2019-03-08", "album": "Lifestyle", "image": "https://images.genius.com/8e1ccf4bffb1e69e1caeac42ff135a8b.1000x1000x1.png", "title": "In Your Heart", "lyrics": "[Intro]\nI can feel you in my heart\nYou in my heart\nOhh\nYou can feel it in your heart, oh\nI can feel you in my heart\nYou in my heart\nOhh\nYou can feel it in your heart, oh\n\n[Verse 1]\nI got the new car reekin' like weed smoke\nPad of prescriptions that are written out for lean, bro\nTotal package, got it all, we the cup winners\nFuck with us, haven’t been the same since the drugs hit us\nI used to graff', I wasn't tidy at all\nSo instead I get a can and fuckin’ write over yours, yeah\nAnother day, rollin' up right before a flight\nFans takin' pics, I see 'em, I look sorta high\nI thought I might hit 'em with that old Kers shit\nThat C-Town mixtape, diverse shit\nSmashed as, got jelly in my lean cup\nTalkin' to your bitch like \"Huh? What you mean, us?\"\nKing Kers, smooth cunt with a rough side\nCunts try go against us and you must die\nStill sell big like \"See, they know me\"\nIn Australia I'm G.O.A.T\n\n[Chorus]\nI can feel you in my heart\nYou in my heart\nOhh\nYou can feel it in your heart, oh\nI can feel you in my heart\nYou in my heart\nOhh\nYou can feel it in your heart, oh\n\n[Verse 2]\nI had the elevator reekin' like pot smoke\nWhat, bro? I ain’t gettin’ off 'till the top, yo\nSmooth rapper, I am really the hot-spot\nCould have your dream girl, let me hit her with the box shots\nScot’s not here to drop shots at you soft cocks\nI'm here to chop crops, what you mean about the top spot?\nThere's no debate with this shit anymore\nTry blockin' out the Kers but I’ll kick in the door\nLet me get to the facts, look, the bitches love me\nThey get angry at the thought that my missus fucks me\nKers One put the 'S' with the line through it\nDollar sign, on the climb, that's how I do it\nIf we talkin' the present\nI run with the crew but never walk with a peasant\nYou feel it in your heart, though\nYou ain't in love, you just love that I'm a star, yo\n\n[Chorus]\nI can feel you in my heart\nYou in my heart\nOhh\nYou can feel it in your heart, oh\nI can feel you in my heart\nYou in my heart\nOhh\nI can feel you in my heart\nYou in my heart\nOhh\nYou can feel it in your heart, oh\nI can feel you in my heart\nYou in my heart\nOhh"}], "artist": "Kerser"}