{"songs": [{"lyrics": "[Produced by Timbaland]\n\n[Intro: Jay-Z]\nUh, uh uh uh\nIt's big pimpin' baby (that's right)\nIt's big pimpin', spendin' G's\nFeel me uh-huh uhh, uh-huh\nGe-ge-geyeah, geyeah\nGe-ge-geyeah, geyeah\n\n[Verse 1: Jay Z]\nYou know I thug 'em, fuck 'em, love 'em, leave 'em\n‘Cause I don't fuckin' need 'em\nTake 'em out the hood, keep 'em lookin' good\nBut I don't fuckin' feed 'em\nFirst time they fuss I'm breezin'\nTalkin' about, \"What's the reasons?\"\nI'm a pimp in every sense of the word\nBitch, better trust and believe 'em\nIn the cut where I keep 'em\n'Til I need a nut, 'til I need to beat the guts\nThen it's \"beep beep\" and I'm pickin' them up\nLet 'em play with the dick in the truck\nMany chicks wanna put Jigga's fists in cuffs\nDivorce him and split his bucks\nJust because you got good head\nI'ma break bread, so you can be livin' it up?\nShit, I part with nothin', y'all be frontin'\nMe give my heart to a woman?\nNot for nothin', never happen; I'll be forever mackin'\nHeart cold as assassins, I got no passion\nI got no patience and I hate waitin'\nHo, get your ass in and let's ride!\n\n[Chorus: Jay Z]\nWe doin' big pimpin', we spendin' cheese\nCheck 'em out now, big pimpin' on B.L.A.D.'s\nWe doin' big pimpin' up in N.Y.C\nIt's just that Jigga Man, Pimp C, and B-U-N B\n\n[Verse 2: Bun B]\nNigga, it's the big Southern rap impresario\nComin' straight up out the black barrio\nMakes a mill' up off a sorry ho\nThen sit back and peep my sce-nahr-i-o\nOops, my bad, that's \"my scenario\"\nNo, I can't fuck a scary ho\nNow every time, every place, everywhere we go\nHoes start pointin', they say: \"There he go!\"\nNow these motherfuckers know we carry mo'\nHeat than a little bit\nWe don't pull it out over little shit\nAnd if you catch a lick when I spit\nThen it won't be a little hit\nGo read a book, you illiterate son of a bitch!\nAnd step up your vocab!\nDon't be surprised if your ho stab out with me\nAnd you see us comin' down on yo' SLAB\nLivin' ghetto-fabulous, so mad, you just can't take it\nBut nigga if you hatin' I\nThen you wait while I get your bitch butt-naked\nJust break it; you gotta pay like you weigh\nWet with two pairs of clothes on\nNow get yo' ass to the back as I'm flyin' to the track\nTimbaland, let me spit my prose on\nPump it up in the pro-zone\nThat's the track that we breakin' these hoes on\nAin't the track that we flows on\nBut when shit get hot then the Glock start poppin' like ozone\nWe keep hoes crunk like Trigger-man\nFor real, it don't get no bigger, man\nDon't trip, let's flip, gettin' throwed on the flip\nGettin' blowed with the motherfuckin' Jigga Man, fool!\n\n[Chorus 2: Bun B]\nWe be big pimpin', spendin' cheese\nWe be big pimpin' on B.L.A.D.'s\nWe be big pimpin' down in P.A.T\nIt's just that Jigga Man, Pimp C, and B-U-N B\n\n[Verse 3: Pimp C]\nSmokin' out, pourin' up\nKeepin' lean up in my cup\nAll my car got leather and wood\nIn my hood we call it \"buck\"\nEverybody wanna ball\nHolla at broads at the mall\nIf he up, watch him fall\nNigga, I can't fuck with y'all\nIf I wasn't rappin', baby\nI would still be ridin' Mercedes\nComin' down and sippin' daily\nNo record 'til whitey pay me\nUhhh, now what y'all know about them Texas boys?\nComin' down in candied toys\nSmokin' weed and talkin' noise\n\n[Chorus 2: Bun B]\nWe be big pimpin', spendin' cheese\nWe be big pimpin' on B.L.A.D.'s\nWe be big pimpin' down in P.A.T\nIt's just that Jigga Man, Pimp C, and B-U-N B\n\n[Verse 4: Jay-Z]\nOn the canopy, my stamina be\nEnough for Pamela Anderson Lee\nMTV jam of the week\nMade my money quick, then back to the streets\nBut still sittin' on blades, sippin' that Ray\nStandin' on the corner of my block, hustlin'\nStill gettin' that 'caine\nHalf what I paid slippin' right through customs\nIt'll sell by night, its egg shell white\nI got so many grams, if the man find out\nIt will land me in jail for life\nBut I'm still big pimpin', spendin' cheese\nWith Bun B, Pimp C, and Timothy\nWe got bitches in the back of the truck\nLaughin' it up, Jigga Man: that's what's up!\n\n[Chorus 2: Bun B]\nWe be big pimpin', spendin' cheese\nWe be big pimpin' on B.L.A.D.'s\nWe be big pimpin' down in P.A.T\nIt's just that Jigga Man, Pimp C, and B-U-N B", "title": "Big Pimpin’", "image": "https://images.genius.com/f30f5b0d781bf50bad373c95604c3bda.970x970x1.png", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}