{"songs": [{"image": "https://images.genius.com/289c999e3490137ad6f8aa95666fb496.600x600x1.jpg", "title": "Hot Damn", "album": "The Neptunes Present... Clones", "year": "2003-08-19", "lyrics": "[Intro: Pharrell]\nNow they saying we too harsh!\nNew verses, please! C'mon!\n\n[Hook: Pharrell (Malice)]\nHot damn! It's a new day!\nHot damn! But them boys want the (money man)\nHooooouuuuuu, hooooouuuuuu\nHooooouuuuuu (What you say, what you say)\nHot damn!\n\n[Verse 1: Malice]\nMy, how the boy's grown\nFrom roaming low-income homes to homes of his own\nNo catching up, he's in a whole another zone\nStill true to his roots, stay close to the chrome\nHaters stay clear of 'em, y'all stand cheer for him\nGot up out the game and overcame, let's hear it for him\nKeep a new toy, so I wonder how could\nI not enjoy life, I'm reliving my childhood\nBig chain monster, whip game bonkers\nMonster truck, remind him of Tonka\nDiamond F color, plush gold, still gutter\nMy deal is in the mils, motherfucker, and I ain't stutter\nBittersweet, my life's a musical\nFrom holding nose to rose gold, the Lord's beautiful\nBefore him I'm too shamed to show my face\nBut shit's so mean can't help but to fall from grace, motherfucker\n\n[Hook]\n\n[Verse 2: Ab Liva]\nHot damn, when the white hit the pan, it\nTwists and it tumbles, it flips and it fumbles\nI mix it like gumbo, I pitch it so subtle, I\nKeep hustlers puzzled, Feds, I got 'em wondering\n(Wondering) What happened to that boy?\nSix maneuver, how'd I slip into that toy?\nIs it the pimp, the crook, the hustler thing\nThe man, the music they're making a king\nI'm simply building my mink, a million men marching like Khan\nThe King Kong of verse, making the world sing\nMy heart's on the sleeve for dark faces just like mine\nPeeking through bars, hoping the sun shines on 'em\nBut you still got to watch the phonies\nWatch your homies, we (*gunshots*) got you homie\n\n[Hook]\n\n[Verse 3: Pusha T (Pharrell)]\nYuugh, handled the rock like none other\nWrist over the stove, head under the cupboard\nIn the kitchen 'til the fume make me feel smothered\nThe way it melt, fiends can't believe it's not butter\nThe way it melt, he won't cop from none other\nThen he who holds Os like Krispy Kreme's oven\nOr Easy Bake, pink Dibis make\nThe Presidential look like strawberry shortcake, P\n(Imagine that Rolls Royce crashed and me unscratched\nIn that Billionaire Boy's Club fashion\nUh, you niggas is clones I hand out styles\nLike ice cream cones, the fuck outta here) That's for real\nMy gats is real, SL 5 is lookin like the Batmobile\nChrome lips with the matching wheels, uh\nBoth chains probably match your deal\nY'all dudes is an act for real, Pusha\n\n[Hook]\n\n[Verse 4: Roscoe P. Coldchain]\nNeither the sun or death can be looked at, that's what a OG told me\nThat was the exact moment I decided to take a pack\nAnd if you owe me and if I decided to take it back\nIt wasn't nicely, expect Roscoe to put you back, in place\nI'm on you call a destructive warpath\nIt'll be shell showers in today's forecast, you a gangsta? I can't tell\nYour diamonds don't glimmer when the light hit it\nThose jewels aren't genuine, because if they was\nI'm nice with it, I woulda' been took that\nThat skinny stack in your pocket, I woulda been shook that\nIn this world you gotta watch it, I'm hear to warn you\nCats turned informant, over snow wrapped in wax\nMy son's home cryin', don't give me no slack\nJust put the motherfucking money in the bag\nThese words are being said as I hide behind glove and mask\nColdchain's not your typical crook, I'm being watched\nLook at the camera lens and push\n\n[Hook]"}], "artist": "Clipse"}