{"artist": "Ace Hood", "songs": [{"title": "Devil Get Off Me", "album": "Trust the Process II: Undefeated", "year": "2018-05-11", "lyrics": "[Intro: Ace Hood]\nNation\nDevil get off me. Devil get off me. Devil get off me Devil get off me. Devil get off me\n\n[Hook: Ace Hood]\nIt took a minute the vision we finally got it together (aye)\nI gotta be smarter I gotta go harder I gotta be better (aye)\nI'm gettin' jealous, when I look in the mirror\nI've been workin' on clearing, all the negative spirits\nDevil get off me, devil get off me\nWe on them jet-skis, we was on South Beach\nDevil get off me, devil get off me\nI put them vvs in the cross I'm covered in blessings, ya\n\n[Verse 1: Ace Hood]\nY'all go teaching again, niggas too eager to win\nNiggas a sell they soul you give it right back they'll sell it again\nNiggas don't plan for the end, everything gone in the wind\nDoin' all this for the kids, doin' all this for the win\nGotta put food in the fridge, I can't lose in the end\nI ain't gon thru it again, smoking on dope in the Benz\nBoy back focused again. Boy back focused again\nI wanna get loose in the rarai back to back to the party\nSo that I'm kinda gnarly dread locks rasta like I'm Marley\nCall that bless on blessings, young nigga still manifested\nYoung nigga still progressing\nReal nigga bossed up heavy, ayee\n\n[Hook: Ace Hood]\nIt took a minute the vision we finally got it together (aye)\nI gotta be smarter I gotta go harder I gotta be better (aye)\nI'm gettin' jealous, when I look in the mirror\nI've been workin' on clearing, all the negative spirits\nDevil get off me, devil get off me\nWe on them jet-skis, we was on South Beach\nDevil get off me, devil get off me\nI put them vvs in the cross I'm covered in blessings, ya\n\n[Verse 2: Slim Diesel ]\nI've been sick-n-tired each and every night keepin' open mind\nI've been livin life, somebody pray for me, somebody pray for me\nI was on the grind workin' doing over time tryna make a dime\nI ain't scared to line ain't nobody wait for me ain't nobody wait for me\nMost of y'all niggas be see thru ya same ones who died need you ya\nIma get it all when the rent due ya Ima go hard ain't taking no L\nBack against the wall Ima do it myself\nPray to the lord when no one left... no one left... hmmmm no one left... no one left, look around the room ain't no one left aye\n\n[Hook: Ace Hood]\nIt took a minute the vision we finally got it together (aye)\nI gotta be smarter I gotta go harder I gotta be better (aye)\nI'm gettin' jealous, when I look in the mirror\nI've been workin' on clearing, all the negative spirits\nDevil get off me, devil get off me\nWe on them jet-skis, we was on South Beach\nDevil get off me, devil get off me\nI put them vvs in the cross I'm covered in blessings, ya", "image": "https://images.genius.com/b3d629c95fe2a0b0f4f3d20998c37c61.1000x1000x1.jpg"}]}