{"artist": "Wiley", "songs": [{"year": "2017-01-17", "lyrics": "Birds n Bars\n\n[Intro]\nYo, Eskiboy\nBBK, dun know\nListen\n\n[Verse 1]\nYo, biggin' up Teeza, man done a remix\nThen I came through with the bars on point 'cause I'm a realist\nCan't go against my scene even if you're the realest\nI based my career on provin' myself to non-believers\nMy name's gonna ring bells to newspaper readers\nWiley, Wiley, yeah, that's one of the achievers\nMost of my gyal dem are cool but some of them are divas\nYou win some, lose some, then you've gotta go take a breather\nMan get weak off a gyal like Julius Caesar\nI nearly killed myself on the highway, just before you reach peeler\nBlud, I was lean already but now I wanna go home and get leaner\nI should've went sleep, or I should've toured but I never done either\nCan't keep your mouth shut, that girl [?]\nI'm old school, yes, Avia and FILA\nSmokin' a J, listenin' to Mila\nI clean my own house, I don't want a cleaner\nI run the dance like [?]\nReel up, hail up my dons\nAlways bringin' stars to the spotlight\nI know what I'm like and I know what I'm not like\nWe move forward, do it like clockwise\nI used to be one of my stand up on the block guys\nNow I'm a OG, kush\nDo it on my own, I won't need a push\nBiggin' up Dynamite and I'm biggin' up Stush\nI'm like Nike, I do it, I come through with a swoosh\nBelieve and achieve\nAwards on the mantlepiece, I'm like jheeze\nStormzy's a don who's here to break barriers\nChip can't run out of bars, so it's peak\nThat's grime, that's grime, the ultimate vibe\nConstant winnin', I won't take a dive\nI will keep going 'til the wheels fall off 'cause\nEven when I'm dead, my vibe will be alive\nMan came from the back roads\nOn point, man are fully in stack mode\nStraight London, buy a couple flats mode\nLate nights, might work on my rap flow\nYou're plain and I'm the loaded nachos\nI played the game for long on my cash flows\nUsed to waste money in my twenties\nNow I've gotta keep an eye on where my cash goes\nI can do it, I don't need to try\nI can do it, I done it already, bro\nBack in the days, I didn't have any dough\nI was not Wiley, I didn't have any flow, now\nI can do it, I don't need to try\nI can do it, I done it already, bro\nBack in the days, I didn't have any dough\nI was not Wiley, I didn't have any flow, now\nNow, now all of my dons get dough\nFrom lyrics, riddims and flows\nLet me go and do this show\nI'm a impatient person, everybody knows\nWickedest MC alive\nI provided all the pies, why would I lie?\nSorry if you've been deprived of\nOne of my wickedest vibes, I was goin' through life\nLookin' for an easy route\nThen I didn't wanna live that life\nMy sound's alive, my sound's the in ting\nAll our names are on the flyers bein' printed, yeah\n\nBring Them All\n\n[Verse 1]\nAll I need is studio time and a ounce\nAnd some fast food, fizzy drink and an Uber account\nPretty swiftly's how the projects run\nI come through, show 'em how it's done\nWords float along inside your brain\nYou can pick which ones that you wanna say\nI see some now but I'ma leave them there\nThem words are not for me, so they get aired\n\n[Hook]\nSee energies floatin' by?\nYou ain't gotta pick them all\nSome energies, people are gonna go and pick\nWon't fit them all\nSome energies, dem evil in disguise\nTricked them all\nIf I wanna bring 25 MCs out\nI'll bring them all\n\n[Verse 2]\nI'm nang and I know it\nPass me the mic, I'll show it\nIf an MC breaks down like a car breaks down\nThen I'll come along and I'll tow it\nMan fix things, small and big things\nMan are eagle, man have big wings\nTake a look at all the cars on the roadside\nYou're small rims, man are big rims\nI was thinkin', don't tease that thought\nTrust me, you don't really need that thought\nGoodness, greatness, grief, that thought\nHold on, weight, let me see that thought\nSayin' I be the champ\nHeavyweight, I'm in the ranks\nAnywhere you go, just know\nYou help people like a big bro\n\n[Hook]\nSee energies floatin' by?\nYou ain't gotta pick them all\nSome energies, people are gonna go and pick\nWon't fit them all\nSome energies, dem evil in disguise\nTricked them all\nIf I wanna bring 25 MCs out\nI'll bring them all\n\n[Verse 3]\nThink before you speak\nPractice humble before you peak\nIf you move correctly\nI know we can be cool before we meet\nDon't be scared, go and take a shot\nPiece of land for sale, I'll take the plot\nIf I do a song, that's crazy and credit's to be given\nI walk up and take the lot, I said\nI ain't scared to get my hands dirty\nA likkle hard work won't hurt me\nI wanna make my live rep clean up\nBuild up, start lookin' at arenas\nBecuh my time ain't done\nWanna talk grime? Then I'm still the one\nAll of the doubt, that's gone\nWhy? Because I'm the lyrical don\n\n[Hook] (x3)\nSee energies floatin' by?\nYou ain't gotta pick them all\nSome energies, people are gonna go and pick\nWon't fit them all\nSome energies, dem evil in disguise\nTricked them all\nIf I wanna bring 25 MCs out\nI'll bring them all", "image": "https://images.genius.com/756c169618448b515f483cb4840d5268.1000x1000x1.jpg", "album": "Godfather", "title": "Birds n Bars"}]}