{"songs": [{"title": "For The Low Part 2", "album": "Free Crack II", "year": "2014-08-25", "image": "https://images.rapgenius.com/fcf016f8a252c42c3531606962c37fe7.500x500x1.jpg", "lyrics": "[Intro: Lil Bibby]\nI still got what the fuck you need nigga\nWhat you sayin?\nHit my phone\nHannn\n\n[Hook: Lil Bibby]\nI still got what you need nigga\nCoke, pills or leaves nigga\nI still got what you need nigga\nCoke, pills or leaves nigga\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, fuck is you saying, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\n\n[Verse 1: Lil Bibby]\nI get to the cash\nThese niggas is crafts, they making me laugh\nI walk in the mall, grab what I want, put that on my tab\nFuck is you saying, fuck is you doing, why is you playing\nYou don’t do what? wait on this porch, call you a cab\nMy niggas be whipping and flipping the dope\nJust hit my line I could get you some smoke\nThey know Lil Bibby got shit for the low\nI’m out of town, you just hit up my bro\n(Hey hold up, how many you want?\nI’m finna meet you right there man by that cut on 78th and Kingston)\nYoung nigga still serving them J’s\nPeyton Manning, I be making them plays\nL’s to the grave, remember them days, I’m stuck in my ways\nAnd we got them choppers\nTrust me when I say you don’t want them problems\nWe blow at them oppers, my young niggas shotters\nYou die or you gonna need doctors\n\n[Hook: Lil Bibby]\nI still got what you need nigga\nCoke, pills or leaves nigga\nI still got what you need nigga\nCoke, pills or leaves nigga\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, fuck is you saying, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\n\n[Verse 2: Wiz Khalifa]\nStill keep it real, still counting hundred dollar bills\nStill on that weed, never pills\nStill probably fucked your bitch, let her chill\nStill rolling kush after every meal\nStill pushing foreign wheels, still tell you how I feel\nBe a real ass nigga, smoking up when I want\nThe next one I roll gon be bigger\nI’m drunk as fuck off that liquor\nDon’t make no mistakes\nSold out my tour now all I want to do is smoke and skate\nWait, the hating only motivate\nI got more cash, I hope she got more ass to shake\nI’m smoking great, I roll one, don’t procrastinate\nI pass the nick, get money at a faster pace\nMy weed is killer, assassination, shit, goddamn!\n\n[Hook: Lil Bibby]\nI still got what you need nigga\nCoke, pills or leaves nigga\nI still got what you need nigga\nCoke, pills or leaves nigga\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, fuck is you saying, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\n\n[Verse 3: Juicy J]\nStill got them goons, still got them shooters, fuck is you thanking?\nYea I got plaques on the wall, but still got niggas that’ll come and stank you\nMy dogs do karate, walker, Texas ranger\nIf I Instagram your bitch, Imma make her famous\nI've been going hard since 2 years old\nJuicy J, I be runnin' through these hoes\nAll these niggas got somethin' to say\nTill I pull up to the club in the UFO\nDancing in these streets on these brand new Forgiatos\nCome and try me, think you slick?\nFully auto full of hollows\nFuck is you hating for, I came from the bottom now I’m making dough\nMove out my way and let me make some more\nI chase the cash, you chasing hoes\nStupid nigga wasting all your time tryna spoil that dirty bitch\nAnd she gon hit up the club tonight and suck a rich nigga dick\n(Get some money!)\n\n[Hook: Lil Bibby]\nI still got what you need nigga\nCoke, pills or leaves nigga\nI still got what you need nigga\nCoke, pills or leaves nigga\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man\nBitch I’m the man, fuck is you saying, bitch I’m the man\nBitch I’m the man, bitch I’m the man, bitch I’m the man"}], "artist": "Lil Bibby"}