{"artist": "Immortal Technique", "songs": [{"title": "Rebel Arms", "lyrics": "* hidden track; follows right after \"Crimes of the Heart\" at 04:30\n\n[Intro: DJ Green Lantern]\nWhat you thought it was over?!\nShit ain't over 'til we say it's over motherfucker\nAiyyo Tech, what you think about the rap game right about now?\n\n\"It's all bullshit, you know that, I know that!\nHey, come along with me man, we'll have a budget, huh?\nWe'll have some clout..\"\n\"I didn't get into this for that!\"\n\"Well that's all there is!\"\n\"Well if that's all there is I've been wastin my motherfuckin time wit'chu\nI can get more clout and more money on the STREET\nThan I can get followin your ass...\"\n(Rebel arms!) Yeah... yeah, uhh, yeah\n\n[Verse 1: Immortal Technique]\nThe game is polluted with rappers that are really snitches\nAnd most DJ's are nothin but, industry bitches\nAnd we don't got, no mansion or riches\nBut we got guns and knives and your children's pictures\nAnd everybody loses in war, but you lose more\nWhat you think we brought back the Panthers, and the Zulu for?\nImmortal witchdoctor made himself a voodoo doll\nFor every motherfucker that fronted that I can recall\nFuck the industry, don't call me, you can't get with me\nI'll leave niggas hangin like Mississippi\nRBG to the last drop of blood in my body\nOr the Feds drag me away, like a tsunami\nBut I'll be back like a fresh bodybag from Iraq\nLike a Baltimore slum during the resurgence of crack\nBrown and black like the A.K. I keep in the strap\nWhile we waitin on the next stock market collapse!\n\n[Verse 2: Da Circle]\nIt's territorial, oratory editorial\nFuck around I'll be the cause of your life's memorial\nI write rap's territorial, East Coast border zoo\nNever crossin waters 'til I will coastally slaughter you\nI'm better than all of you, vendetta's be mauling you\nYou're talkin cheddar, I'm a shreddar, I'll sever it off of you\nI'll never remorse for you, no letters endorsin you\nPole position in the coffin is what it's, costin you\nThe cockiest bosses who control the fortunes too\nThe mortgage is of a cultural losses, through and through\n(But it's the rebel arms!) Godspeed with devil's charms\nThe bitch-made gets switchblades in every arm\nAnd this way we ix-nay on any harm\nCause snakes play and fakes lay like hidden bombs\nWe march in unison, the soul is true within\nEternal missions with church, a lifetime to do it in\n\nStronghold said it, whoop yo' bitch-ass with batons\nThe rebel arms swarm and form like Voltron\nSlash your own beast, you heard +Mark of the East+\nRunnin through cop lands screamin \"Fuck the police!\"\nHormones in the water (water) they actin out of order\nLike a pack of rabid wolves, they lambs for the slaughter\nCrush your mandible, rip the drums like Animal\nEat MC's they my own kind, I'm a cannibal\nMy regimen salute me, haters wanna shoot me\nKool-Aid in their veins, they're lawyers tryin to sue me\n\"You sell crack and rap, did a skid bid\nMultiple baby mamas, take care of yo' kids\"\n\nGuillotine rap, shackles on your neck\nChemical warfare where punchlines connect\nDa Circle play the snipers, with Immortal Tech'\nThey called the block governor to drag him of the set!\n\n[J. Arch]\nRebel arms out for supremacy and move non-gimmicky\nRelated to royalty on each trip you mention me\nTwist bars illest-ly, rebel against the infantry\nGet more than yo' feet wet when I make you a memory\nCats not ready because they commercially industry\nI make house calls to those afraid to visit me\nDisrespect, I'll smash off the petty\nFrom undisclosed locates, move fast for their cheddy\nArch don't breakdance, yet I +Rock Steady+\nI jump on your scope to prove your aim not deadly\nMy shot to the top is like Mikki and Mal' smelly\nFlow milky like the tits of a chick, that's top heavy\nThe +Technique's Immortal+ so Rebel Arm's the regiment\nArch status nicer than, other rappers ever been\nMy cantine's full from when the doc don't got medicine\nFive-star general, frontline veteran\n\n[Outro: DJ Green Lantern]\nInvasion baby!\nShit ain't a fuckin game that we playin\nImmortal Technique...\nOh yeah, don't forget\n\"Revolutionary Vol. 3\" comin soon\nYou're not worthy, you sons-of-bitches!", "image": "https://images.genius.com/cbb36cff0867b087bc47fcf98b7cd803.300x300x1.jpg", "album": "The 3rd World", "year": "2008-06-24"}]}