{"artist": "Yung Bans", "songs": [{"album": "Yung Bans, Vol. 5", "image": "https://images.genius.com/00d2e68d4011bae701f660f1be6d7afd.999x999x1.png", "year": "2018-06-27", "lyrics": "[Intro: Yung Bans]\nHmm-mmh-mmh, mmh-mmh, yeah\n\n[Chorus: Yung Bans]\nHuh, dress it up, huh, dress it down, yeah\nTook flight, came up off the ground, huh\nI'm off this Earth, baby, it ain't round\nRound, round, rou-rou-round\n\n[Verse 1: Yung Bans]\nAyy, say that's dog food, ayy, ain't it brown?\nOff the Perc', huh, ain't it round?\nFuck his ho, make that bitch go down\nSmokin' gas, bitch, my dope is loud\nAyy, hatin' ass nigga, I know he can't stand me, yeah\nI'm just countin' up, this shit just dandy, yeah\nShawty suckin' my dick like, \"Where your man?\" Yeah\nI'm like, \"Fuck that nigga, I don't give no damn,\" yeah\nAin't a young nigga gave me a helpin' hand, yeah, hey\nOn two feet, I had to stand, yeah\nOn four feet, I'm on my hands and legs, yeah\nBitch, I'm a dog, I'm a fuckin' legend, huh, ayy\nDog, huh, ayy, yeah, dog\nChopper jumpin' like a frog, ayy, yeah, ayy, yeah, huh\nBaby, I'm a dog, uh, yeah, ayy\nCaught up in the smoke, I'm in the smog, huh, yeah\n\n[Chorus: Yung Bans]\nHuh, dress it up, huh, dress it down, yeah\nTook flight, came up off the ground, huh\nI'm off this Earth, baby, it ain't round\nRound, round, rou-rou-round\n\n[Verse 2: Juice WRLD]\nYour bitch on a four, that bitch down to fuck, ayy\nI'ma knock her down, same way I hit her up, ayy\nNow he on the ground, ambulance pick him up, uh\nAmbulance get him up, yeah, I ain't give no fucks\nShe say she in love, I don't give no fucks\nMet her in the club, she was DTF, down to fuck\n.40 on me, had to light 'em up, line 'em up\nPop a molly, Oxy' just to wash me up, uh\nGang gang, baby, they be too family\nBanana clip on me 'cause niggas be really actin' like they chimpanzees\nThese niggas say they wasn't ready, bitch, I been ready\nHe say it's a scary movie, bitch, I been Freddy, ayy\n\n[Chorus: Yung Bans & Juice WRLD]\nHuh, dress it up, huh, dress it down, yeah (Yeah, yeah, yeah)\nTook flight, came up off the ground, huh (Yeah, yeah, yeah)\nI'm off this Earth, baby, it ain't round (No)\nRound, round, rou-rou-rou-round", "title": "Round"}]}