{"artist": "Knoc-turn’al", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/knocturnal.jpg", "title": "LA Nite-N-Day", "year": null, "album": "L.A. Confidential Presents... Knoc-turn’al", "lyrics": "[Intro: Knoc-Turn' al]\nAhhh!\nIt's a good day in LA, yes it is (yes it is)\nMotherfuckers can just wake up and relax\nAnd smoke a fat blunt or some shit\nBuy a fifth a Henn and get drunk (yes)\nHey, bring that over, call them up\nOrder me some motherfucking (Knoc-Turn' al) Hennesy\n\n[Verse 1: Knoc]\nWu-Tang got mansions in the hills\nHoe squat thick, hoe squat paying bills\nRed & Meth on hot wheels bumping down Sunset\nLa Maridia, sky balling, what is this?\nMy eyes, they caught up in the sea, look at Jay-Z\nAt the Source's Swap Meet getting Memphis Bleek some fitted khakis\nYeah, well real niggas get passes sometimes\nOut of bounds in the land of the sunshine\nEven Biggie said he was coming back (coming back)\nAnd if he did, we would accept him because a nigga is black\nYou bleed just like us\nPicture me being scared of a nigga that breathe the same air as me\nYou bleed just like us\nWas a song I did, bumped on blocks and beaches with beat in my trunk\n\n[Chorus: S-Dog, Knoc]\n[S-Dog] Night and day\n[Knoc] Where 80 percent of the population gang bangs\nMost of y'all hate but I know y'all got to love\n[S-Dog] LA!\n[Knoc] Yeah\n[S-Dog] Night and day\nWelcome players we'll gangster step\n[Knoc] Some of y'all hate but I know y'all got to love\n[S-Dog] LA!\nNight and day\n[Knoc] Sraight up (what?)\n[S-Dog] Welcome players we'll gangster step\n\n[Verse 2: Knoc]\nYou can catch LL on Venice Beach on Sundays catching sun rays\nI is playing this little game\nLike watching ass sway back and forth (what up, girl?)\nMacking the most, stripes on my coat, a bragging boast (West Coast!)\nJennifer Lopez and Puffy at Miyagi's eating sushi\nNow, tell me what else does your eyes see\nA lot of other Coast niggas pass through frequently and it's cool\nBecause y'all pay dues and I pay them too\n\n[Chorus: S-Dog, Knoc]\n[Knoc] Some of y'all hate but I know y'all got to love\n[S-Dog] LA!\n[Knoc] Yeah\n[S-Dog] Night and day\n[Knoc] Turn it up\n[S-Dog] Welcome players we'll gangster step\n[Knoc] Some of y'all hate but I know y'all got to love\n[S-Dog] LA!\n[Knoc] We in the land of the sunshine where bitches have good times\nPalm trees and sea breezes\nAnd I'm out to find a fly fine girl so I can try out my new mack lines\n\n[Verse 3: Knoc]\nYou seen The Lox? (yes), Ludacris? (no)\nToo $hort? (yes), that's my dog (so)\nI did a rap with him to increase my (dough)\nWas he dope? (yes)\nIs he fake? (no)\nWeak game? (banging), hop ('64's)\nFour or five deep with three or four (hoes)\n\n[Chorus: S-Dog, Knoc]\n[S-Dog] Night and day\n[Knoc] Where 80 percent of the population gang bangs\nSome of y'all hate but I know y'all got to love\n[S-Dog] LA!\nNight and day\n[Knoc] Straight up\n[S-Dog] Welcome players we'll gangster step\n[Knoc] Most of y'all hate but I know y'all got to love\n[S-Dog] LA!\n[Knoc] In the land of the sunshine where bitches have good times\nPalm trees and sea breezes\nAnd I'm out to find a fly fine girl so I can try out my new mack lines\n\n[Outro: Knoc]\nYeah, fly is the weather - I feel the breeze\nL.A.C. night and day\nInner city living with inner city game\nCasuas fat laces on some new Chuck's (yes)\nI got my running shoes on\nGangstered out from head to toe (head to toe)\nFucking hoes and patroling the hood\nHeat on my lap looking for a light\nBecause, uh, I just rolled up a chronic sack\nThat's some, that's some good shit"}]}