{"songs": [{"year": "2005-01-01", "title": "Letter to Omnipotent, Pt. 2", "image": "https://images.genius.com/9817f1884f3ccbc4ed6fd77a8d9049eb.300x300x1.jpg", "lyrics": "[Intro]\nS to the A.  Coalition.  Hundred proof.  A lot of shit on my mind, man.  Yeah.  This shit ain’t getting no better, fam.  Damn…\n\n[Verse 1]\nYo, I don’t think that y’all ready\nFor me and the kid from the Five Deadly\nThink back hard and ask God, “Why Jerry?\nWhy couldn’t it been one of them that I buried?”\nI do the next ten, stretchin’ the law library\nYo, I’mma chill ‘cause I’m startin’ to feel my eye blurry\nAnd I remember you told me never to cry, Jerry\nAnyway, you down here.  Your nation rock [durry?]\nListen, they brother Mike just robbed Marbury\nI hundred-fifty G piece, they pawned it already\nCop bricks and flood it from the Bronx to [?]\nLife change—niggas dying over dice games\nIce change—you would think that Christ came\nAnd took all of his people and left\nThe rest of us sinners to suffer, get drugged addicted and wallow in death\nSome police shot Diallo to death\nSometimes, I sit and wonder how many of my tomorrows is left\n\n[Interlude]\nDamn, man… It’s fucked up out here, man.  Just, man… I don’t even know what to say no more, man.  Trying to make this shit right, man.  Yo, Omnipotent…\n\n[Verse 2]\nI still think about y’all niggas each day of the week\nEvery day, it seem to get harder to stay in the street\nI’m so used to just spraying the heat\nBut now, when the kid front, I got ta hold my head, control my temper\nI know what I’m supposed to remember\nAnd I heard Big’ll be home some time close to December\nI can’t wait for y’all to see how much noise that I’m making\nWithout a major label—even signed niggas is hating\nBut they can’t make the rhymes that I’m making\nI remember what you said, Omnipotent.  Nigga, “Timing is errything.”\nNiggas gon’ recognize who the best in the---Eh!\nI almost forgot (yo, I’ll tell you).  I got arrested again\nAyo, the D’s was duck huntin’, locked me for robbery\nWhen I ain’t stuck nothin’.  Came with cop and arraignment\nTold ‘em, “Suck somethin’.”  They hit me with a smack or two\nGave me a black and blue.  Frontin’ when your hands in back of you\nYou know how crackers do.  But, oh well\nStripped me and threw me inside a cold cell\nI’m in the corner, shivering, thinking how I can post bail\nYou know the game—when you get locked, nobody on your block true\nMa’s pockets is burning and I don’t fuck with pop dukes\nNow I’mma cop loot.  I’mma have to go to shock group\nIf not, I’ll be wiling up in Attica, yelling, “Hot soup!”\nThey gon’ force me to lose it\nThis shit I’ve been falsely accused with\nDo with the crime—I divorced it for music\nI rap, nig…", "album": "Abandoned Tracks Vol. 2"}], "artist": "Saigon"}