{"songs": [{"image": "https://images.genius.com/51ffe6afd99678e61b52396c4cf6818b.500x500x1.jpg", "year": null, "title": "Misanthropy", "album": "The Unforgiven Vol. 1", "lyrics": "First Verse:\n\nI'm givin' it to you old school style, no album cover gimmicks\nNo intros, no shout outs, nothin' but straight lyrics\nIf you in your car buckle up\nBut if you don't like what I'm sayin' when you see me knuckle up\nNo studio gangsta stories or tall tales full of fiction\nI'm spittin' the life of a nigga that's full of indecision\nDon't know which way to go\nAt the crossroads\nIt's time to elevate the game\nCuz they spit the same ol' same\nCuz a nigga done grew up\nThrough some shit that'll make the average nigga fold up\nThought I had it sowed up\nBut hold up, you know what?\nI realized the World wouldn't give a fuck whether I'm here or not\nAnd that's contrary to all that other madness that you hear a lot\nAin't no bigger figures, just us niggas\nSometimes they give us action\nThis shit is crashin' back to Earth like Michael Jackson\nIt don't matter how much scrilla\nYou got, you still a nigga\nThey either assassinate your character, frame ya, or they kill you\nI don't blame you, if you don't feel the, game I wrote\nWe've been brainwashed, unconscious prisoners ever since we left the boat\nSubliminal messages from bands to reject this shit\nBut they can't hide the truth no matter what they try to do\nMy judgment day is everyday\nFuck what they say\nAnd make 'em pay\nGrab your H.K., and dragon slay\nAnd make a day\nWould you rather ride or stay a puppet?\nIn the ghetto makin' crumbs, why they makin' scrilla by the bucket\nBut fuck it\nTo each his own\nBut to me it's on\nFuck the chest, forget the vest, I'm aimin' for enemy domes\nCuz only the strong, survive, one life to live\nLet off some rounds\nWhat's that sound?  It's goin' down\n\nChorus:\n\nFuck all y'all\nFuckin' with my mind\nUntil you all fall\nMisanthropy\nFuckin' with my mind\nYou can't understand yours\nNow can you understand my\nMisanthropy?\n(2x)\n\nSecond Verse:\n\nI did four hundred years in Hell\nNow they tryin' to give me twenty-five to life in the cell\nGot'cha boy on the run and if they catch me it's over\nRollin' in a Nova\nThree-fifty packin' a forty-caliber Mag importer\nDeclarin' war, on the system\nAskin' for help, but the muthafuckas didn't listen\nThey tried to get killed, but now they label me a killer\nYou lived by the scroll, but you gone die by the scrilla\nNeither of you can see the pain in my eyes, fuck a disguise\nI wear it on my shoulder like a bass\nCausin' casualties like M*A*S*H\nBeen a soldier in the truest sense\nBorn and raised in a war zone, it's always on\nAnd you can die in an instant\nAs infants grow up to be convicts\nKnew how to shoot a gun since the age of six\nLittle lunatic\nPapa didn't wanna raise a punk\nBeat'cha til' you hate it, his ass grew up and beat'cha while you ride punk\nI'm unapproachable, can't nobody tell me shit\nI got my mind made up, fuck a psychiatrist\nI don't need nobody tryin' to tell me what I'm thinkin'\nThe ghetto is stuck on quicksand and it's sinkin', it's goin' down\n\n[Voice Taped From A Speech]\nWe are peaceful people\nWe are loving people\nWe love everybody who loves us\nWe're non-violent with people who are non-violent with us\nWe are NOT non-violent with ANYONE, who is violent with us\n\n\nChorus\n\nThird Verse:\n\n]From day one the odds was against me\nNate one have love for a nigga, so the Devil tried to tempt me\nTo loc up, revolt, rebel\nSaid \"You might as well\nYou already, livin' in Hell\"\nI got, somethin' in my soul tellin' me \"Nigga this shit ain't right\"\nThe Lord never answered, but I prayed with all my might\nSo fuck waitin' patient, it's a virtue I don't have\nI got money on my mind and I want my shit in cash\nFuck a forty acre and a mule\nI want everything that you owe me, it's time to pay your dues\nI was used, and abused, for centuries\nBut when they mention warfare, they never mentioned me\nBut can you picture me?\nOn top of the World?  Runnin' shit with a major attitude\nMadder than that prophet bitch\nWith a clip full of shit\nTearin' your ass to pieces, when the trigger releases\nYou're deceased and you got them P.D's, D.A's, judges and polices\nPeep the thesis\nWe gets, hot like volcanic lava\nI'm down to slide a niggas drama\nSpeedin' shit up like some java\nFuck a comma\nIt don't pause, I'm steady unloadin'\nUnstoppable nigga the Glock goes plop-plop on that ass\nAnd suckers steady foldin'\nI'm hatin' men like the lesbians\nAlways down for drama doin' shit just thesbian\nOnly love my Mama, traumatize your ass with the quick\nBetter come prepared if you try to ride or try to diss my clique\nIt's goin' down nigga\n\nChorus (2x)"}], "artist": "X-Raided"}