{"songs": [{"title": "Gook", "year": "2016-03-09", "album": "Imperial", "image": "https://images.genius.com/c8533a29979af0e2ddda2a88a0639cb0.1000x1000x1.jpg", "lyrics": "[Intro]\nRonny J, listen up\n\n[Verse 1]\nI'm a gook!\nIf I told you that I wasn't then\nA nigga wouldn't be telling you the truth\nBack in high school, I admit I was a gook\nBut the way I rap had niggas fooled\nYeah, I'm a gook, niggas started skipping school, me and Monty and Raul\nHopping the fence by Carol City park\nFuck the next class bitch I'm already smart\nYet I'm a gook, see me growing out my hair cause I look like the nigga from Roots\nYeah I'm a gook, Denzel Curry been a gook\nNigga that ain't nothing new\nYeah I'm a gook, probably thinking that I'm fool if I told you that I'm rapping too\nYeah I'm a gook, looking like that nigga Buu\nCut me off, I'm at the booth\nBitch, uh!\n\n[Chorus]\nJabbie told me we gon blow like land mines\nI don't fuck with purp, that's the only reason Yams died\nNigga, I'm a gook, hella awky that's the truth\nBut I bet you I can even keep it 10 times better than you\nI'm a gook!\nJabbie told me we gon blow up like a land mine\nI don't fuck with purp, that's the only reason Yams died\nNigga, I'm a gook, hella awky that's the truth\nBut I bet you I can even keep it 10 times better than you\nI'm a gook!\n\n[Verse 2]\nLoose, with a screw, loose from the Tre Deuce, smoking boof\nBitch, I always knew, that I was a gook\nBut how this gook, ended up surpassing you?\nWhy you looking confused?\nMade a hard album so what can you do?\nI'm the Gook Runner, the Imperial\nShout out to Mook, that be my flesh\nNiggas can't fathom that I am the best\nI gave you threatz, ultimate next\nShoutout the Klan because that’s on the set\nFucking with me I will put you to rest\nLie and you’ll remember to speak with your chest\nGooking forever I'm still at your neck\nBitch I'm gooking forever so give me respect, bitch!\n\n[Chorus]\nJabbie told me we gon blow up like land mines\nI don't fuck with purp, that's the only reason Yams died\nNigga, I'm a gook, hella awky that's the truth\nBut I bet you I can even keep it 10 times better than you\nI'm a gook!\nJabbie told me we gon blow up like a land mine\nI don't fuck with purp, that's the only reason Yams died\nNigga, I'm a gook, hella awky that's the truth\nBut I bet you I can even keep it 10 times better than you\nI'm a gook!\n\n[Outro]\nFrom the days, I've seen thus far\nPeople tell me that I gook on the daily\nOne day, I'm gon' be a star\nI don't give a fuck if you're gonna hate me\nNew chains and brand new cars\nPeople tell me that it's all gonna change me\nBut for now, my mind's on Mars\n'Cause you know a nigga gook on the daily"}], "artist": "Denzel Curry"}