{"songs": [{"title": "Kill4u", "album": "Life of a Dark Rose  ", "year": "2017-12-12", "image": "https://images.genius.com/d3e98968f6e47fdf4e54a33d2b9367f8.1000x1000x1.jpg", "lyrics": "[Intro]\nAyy, she said she wanna roll, high\nAyy, roll one and touch the sky\nWhat a lie\nAyy, ayy, ayy\n\n[Chorus]\nI live a dark life, I don't let people in\nThey say I smoke too much, but this my medicine\nDon't get the wrong impression, I'm 'bout my presidents\nRockstar my life, look at the evidence\nAnd would you shoot for me? 'Cause I would kill for you\nI like the way you dance, you got no point to prove\nI shine just like a jewel, my baby that's my boo\nWe both is off the goop and swerving in my Coupe\n\n[Verse 1]\nDepression settin' in, so grab my medicine\nThe cops lookin' for it, I hide the evidence\nBitch, I'm intelligent, they say I'm heaven sent\nLife feel like Hell on earth, I fly high like a blimp\nGirl, why you fuck with him? You know that nigga simp\nHe said he got a bag, that boy is not a pimp\nAll of my niggas up, I did this for my team\nBitch, I'm a young boss, didn't have anything\nI'm tryna own a house, you tryna own a chain\nOmertà still the code, I won't tell on my gang\nI used to dream about it, made it reality\nAnd you are not my friend, 'cause back then you was doubtin' me\n\n[Chorus]\nI live a dark life, I don't let people in\nThey say I smoke too much, but this my medicine\nDon't get the wrong impression, I'm 'bout my presidents\nRockstar my life, look at the evidence\nAnd would you shoot for me? 'Cause I would kill for you\nI like the way you dance, you got no point to prove\nI shine just like a jewel, my baby that's my boo\nWe both is off the goop and swerving in my Coupe\n\n[Verse 2]\nLil' baby fuck me good, I took her to my hood\nI wish that nigga would, would throw him in the woods\nMy life a scary movie, I never catch a break\nHow you gon' help me out, then throw it in my face?\nThis world's a different place, my mind is like a race\nI'm always on the go, I gotta let you know\nThat I'm a lonely nigga, no, I don't need a ho\nI only need my dough, I'm talkin' bankroll\nAll of these bitches fuckin', all of these niggas lame\nI can't fall victim to it, I'm in a different lane\nYou wanna see me fail, don't wanna see me change\nIt's funny how it works, now you are stuck in pain\n\n[Chorus]\nI live a dark life, I don't let people in\nThey say I smoke too much, but this my medicine\nDon't get the wrong impression, I'm 'bout my presidents\nRockstar my life, look at the evidence\nAnd would you shoot for me? 'Cause I would kill for you\nI like the way you dance, you got no point to prove\nI shine just like a jewel, my baby that's my boo\nWe both is off the goop and swerving in my Coupe\n\n[Outro]\nSwervin', swervin', swervin', swervin'\nSwervin', swervin', swervin', swervin'\nSwervin', swervin', swervin', swervin'"}], "artist": "Lil Skies"}