{"artist": "Fam-Lay", "songs": [{"year": "2004-07-13", "album": "Traintago", "image": "https://images.genius.com/0269a8c3017d586a9a2d19285d0ca5ed.600x601x1.jpg", "lyrics": "[Intro - Fam-Lay] (2x)\nFam-Lay, c'mon\nA nigga like me, I'm fresh n drivin ma\nA nigga like me, I'm fresh n drivin ma\nWhy be frustrated, stressed, and jiving for?\nA nigga like me, I'm fresh n drivin ma\n\n[Hook - Pharrell Williams] (Fam-Lay)\nFresh! OWW! and driving!\nWhoa whoa! (happy as a bitch, nevermind how y'all feel)\nGive you fresh!! and driving! Whoa whoa!\n(Blowing sweet Indonesia out my nostrils)\n\n[Verse - Fam-Lay]\nNow my plane just landed, I'm down in Miami\nListen up close cause ya gotta understand me\nI'm seeing womens' faces sweeter than candy\nMe and Pharrell talking bout a clean sweep at the Grammy's (uh huh)\nThat was cool, but this year much sweeter\nThen I bumped into the world's baddest bitch named Trina (whoa!)\nLet me know cuz you ever seen her\nFatter ass on a woman, cause I gotta meet her (word?!)\nThen I saw my home girl Misdemeanor\nFlying by in a drop top Ferrari Modena\nRight now I'm in a rented Beemer\nWhen I get my Modena I'm a keep mines cleaner\nI'm Mamosa toasting, playing wit these women's emotions\nCoast to coasting, paying for these women to bullshish\nSmoking hocus pocus, toast in holsters\nTry to play us close, and I'm spraying the toast cause I'm so\n\n[Hook]\n\n[Verse - Fam-Lay]\nI stay fresh while the rest stay frustrated\nI'm the best I guess that's why the rest hate it\nLooking at those breasts thinking x-rated\nLast call in the spot, and I just made it, cool\nEverythings by according to plan\nA lil less than a god but I'm more than a man (uh huh)\nCan you help me? sure that you can\nCause I came down here for a lil more than a tan\nDoing - a buck 50, like six quarters\nCause Fam-Lay is fresh as dish water\nYou can't shift them gears in disorder\nEasy on the tiptronic baby! I just bought her\nHop out the S Type, dressed like a criminal\nPinkie to the thumb numb, neckalace invisible\nY'all niggas pitiful, leave y'all critical\nRims so sick that my car need a physical\n\n[Hook]\n\n[Bridge - Fam-Lay] (2x)\nMa, you going my way? what up! what up!\nFellas, you getting right today, what up! what up!\nTrying to get in some today, just cut up\nHaters get in my way and get gun butt up\n\n[Verse - Fam-Lay]\nAin't no nigga live as me!\nSunshining bright wit a dime in the driver seat\nI'm what them assholes try to be\nYeah! Me and babygirl took a stroll on the beach for some privacy\nLong as you kiss and don't tell\nI paid for ya hair, ya feet and yo nails\nJust cause I'm fresh and don't care\nRight after that we hitting the hotel, I'm\n\n[Hook - to fade]", "title": "Fresh N Drivin"}]}