{"artist": "6ix9ine", "songs": [{"year": "2017-02-25", "title": "GO CRAZY", "album": null, "lyrics": "[Intro: Martin Luther King Jr.]\nI have a dream\n\n[Chorus: 6ix9ine]\nThrow the wrong fingers up, pistols getting finger fucked\nNigga try to act tough, hit him with the Mac Truck\nBody bag, zip him up, 40 clip, rip him up\nOther side, they ain't tough, our side fuck it up\n\n[Verse 1: 6ix9ine]\nNiggas my gang, when the thing go bang\nRoll the window down, let me do my thang\nI go insane, hit him in his brain, that boy a stain\nY'ada niggas bluff, y'all niggas ain't tough\nI know some Bloods, they wet you up\nThat's just because, boy, fuck you thought?\nNigga, my hands don't talk, nigga, my bite don't bark\nFuck you thought? Nigga, you ain't no star\nYou slide up, get lock jawed\nI came to the block, I paid for the Glock\nGunshot, gunshot, one time, one time\nI paid for the rocks, I stuffed the socks\nOne sale, one sale, top notch, top notch\nI run up on nigga, go ape a nigga\nNo face, no trace, no case on nigga\nBlack switchblade to the face of a nigga\nNever ever will I catch a fade from a nigga\nBoy, fuck you thought? My squad go crazy\nTry and put us in cages, can't contain us\nMy block go crazy, my squad go crazy (Squad)\n\n[Chorus: 6ix9ine]\nThrow the wrong fingers up, pistols getting finger fucked\nNigga try to act tough, hit him with the Mac Truck\nBody bag, zip him up, 40 clip, rip him up\nOther side, they ain't tough, our side fuck it up\n\n[Verse 2: Hudson Flo]\nBut I got that juice (Huh?), and I got that sauce (Huh?)\nMy squad go crazy, ain't scared to shoot (Boom!)\nWhat the fuck you thought? (What?)\nIf you on that stoop, you droppin' Ks (Ah)\nAnd you take a loss, let me call my troops\nOh, you think you warrin'? (What?)\nWe'll take you off, yeah, them things get tossed (Rrah)\nCatch me I'm whipping, I'm spinning the block\nCatch him in the shoulder, I'm spinning an opp (Let's get it)\nNowadays we sinning a lot\nProlly why my gang winning the pot (Uh-huh)\nGotta take risks, you know they say crime pays\nI'm trying to paid like nine ways and I'll find ways\nWhen it's time it's time, can't time fade (Nope)\nBut I gotta keep moving (What?)\nThese boys steady looking close while I'm looking for 'em\nPull up on the block (Woo!)\nHop out at the bodega, they lookin' hard\nI'm looking fly like I took their card (Uh-huh)\nHopped out, then they took it all, but none of my shit\nOnly thing he took was a clip that he took at heart (Damn)\n\n[Chorus: 6ix9ine]\nThrow the wrong fingers up, pistols getting finger fucked\nNigga try to act tough, hit him with the Mac Truck\nBody bag, zip him up, 40 clip, rip him up\nOther side, they ain't tough, our side fuck it up", "image": "https://images.genius.com/addc4d7f51000fe0e5288a77168b84d5.1000x989x1.png"}]}