{"songs": [{"year": "2006-01-01", "title": "Throw Tha Ball", "image": "https://images.genius.com/4efe3d7de04a343b34f1b0ddcfbc7bf4.1000x1000x1.jpg", "lyrics": "[Intro: Sadat X talking over (background vocals)]\nIt's a beautiful day outside\nOh it's lovely, the birds is out\nIt's real peaceful right now\nYo what's up my man, my man what's up? yo\n\n[Verse 1: Sadat X]\nOk, just when you thought nothing could get better\nA big girl backed in to me, and I let her\nI was very impressed, very shapely\nShe said do I remember her?\nI thinks vaguely!\n\"Remember Kareem?\" (remember?)\n\"Who I coached on my team?\" (Oh yeah)\nShe said \"Yeah, well that's my little nephew, and he's come home balanced every time that he left you\"\nI said \"Well you know I try to teach when I can\"\n\"Me and him is cool, I'm fact, that's my little man\"\nShe said \"See God, I'm not trying to be a fan\"\n\"I understand Ma\" She say\n\"I live alone, it's just me and my grandma\"\n\"I know you just got here, do your thing\"\n\"When you can, just give me a ring\"\n(whenever you can)\nI got my swag, and my similar swing\nI do (whenever you can)\nTo be alive is a beautiful thing\nIn these days (whenever you can)\nTo be alive, and feeling like a king\n\n[HOOK: Sadat X talking over (background vocals)]\n(On discovering you, makes a dream come true)\n(On discovering you, makes a dream come true)\n(Lot of love, love love love love)\nYeah, Yeah little man\nYo throw the ball little man\nThrow the ball, I'm not gonna take it\nMake a dream\nThrow the ball man, stop playing\nThrow the ball yo\nLet me show y'all sum'thin\nAnd the things you could be\nAnd have a good time\nNo doubt\nWe at the function\nYeah man, that's right, that's right\n\n[Verse 2: Sadat X]\nAnd e'rybody here must be smashing\nGlasses lit, I wanna hear them crashing\nWho's running with me with these shots of Patron?\nGlasses of [?] Tiger bone\n\"How you doing Daddy?\"\n\"Darling, I'm fine\" \"Can I make you a plate?\"\n\"Yeah Ma, but no swine\"\nI thought about dropping a line, but too regular\nToo damn common, and I'm not the obvious\nSome you must admire from afar\nTake it as such, tempted to touch\nHere's the reasoning, the food is perfect\nIt's just the right seasoning\nDudes was chilling, boy, rude as usual\nDJ pon the stage, I hope I'm not confusing you?\nKids running round, not concerned with it though\nTwo drunk dudes is trading insults (what?)\nMy man broke his leg, and he here with a crutch and he still want roll a dutch!\n\n[HOOK: Sadat X talking over (background vocals)]\n(On discovering you, makes a dream come true)\n(On discovering you, makes a dream come true)\n(Lot of love, love love love love)\nRoll up my dude\nRoll up, it's nighttime now I can smoke in peace\nI don't gotta hide it on the side\nPut the babies to bed\nThrow some yard on\nThrow some yard, so I can wine up\nSo I can rub up on\nYeah! I like that Ma, whoo!\nMake a dream come true tonight for me\nMake a dream come true\nMake a dream come true\nHere we go, here it is\n\n[Verse 3: Sadat X]\nOk, nighttime approaches, put the kids to bed\nEverybody's liquored up, and well fed\n(you feel good?)\nConnections is plugged, who's drugged is drugged\nIt's when your dick game's apparent to the average [?]\nI'm not the average guy, turn on the grown man music\nWhen touching close bodies is required text\nRequired reading, make sure you ain't speeding\nSeem like the overall day, is trying to go your way\nVictory so close you can taste it\nYou catch a slide like Ma$e\nAnd talk to yourself \"I'm glad I came\"\nAnd your man next to you probably feeling the same\nPicture perfect, it belong in a frame\nSave the day, roll sum'n exotic with a fragrant spray\nAnd it's good to feel, and live that way\nAnd it's good to feel, and live that way\n\n[Outro: Sadat X talking over (background vocals)]\n(On discovering you, makes a dream come true)\n(On discovering you,  makes a dream come true)\n(Lot of love, love love love love)\nNo violence today\nIt was no violence, nobody got hurt\nCame and got a plate\nI'mma leave with a plate too\nI'll definitely take a plate home, it's nothing to me\nA big plate too, I'll pile my shit up crazy\nAnd walk proud, walk out proud\nAnd may take a beer, and put in my pocket\nThat's right", "album": "Black October"}], "artist": "Sadat X"}