{"songs": [{"title": "1Hunna", "lyrics": "Scream, I want it!\nYeah, yeah, yeah\nGucci, Gucci got me stunning\nYeah, yeah, yeah, yeah!\n\nEveryday I'm in it, niggas know that I'm 1hunna\n80 MG shit, bitches know that I'll be coming\nNiggas want the shit and they know that I will get it\nNiggas know there's driving million bitch, we know we're in it\nNiggas know I ball hard, fuck the niggas, don't need none\nHell no, all you, get 30 popping and you will see some!\nReal niggas, understand, hell yeah gotta understand\nI'm a grown man, a 10 G .and I'm 20 Benz\nI'm on that,... niggas, hell yeah...\nI call them up, one time\n30 million, that's more than none\nThey're real niggas, they know that\nAbout to call Angel, he gonna blow that!\n\nWe got money, we got money, we got lots of promises\nWe got bitches, we got bitches, we take all your bonuses\nI get all this money, all this money make me stunning\nFlexing in, finessing in, these niggas bet their money!\nGrind in the squad shit, bitch, I want 100\nGetting money really good, she bitching me on stunning\nEvery day's a movie, niggas know I gotta get it!\n... niggas know I'm here to get it!\n\nWhen I wear Versaci, man I'm good to...\nGetting all this money made my ghetto get it\nAnd I'm got the breaks, breaks on breaks on breaks\nYou can get the shit if you just wanna practice it\nSo nigga, what's the order? Get that baking soda\nGet my niggas with me, yeah, they're in the kitchen\nCooking out them chickens, yeah, that money piling\nYeah, my niggas riling, got those with the...\nSo follow a nigga, plea no challenge\nWe make a flash like...\nMove away to their heart, and let your ass don't get caught!\nFuck em around with that\nFuck around, get your ass scared\nYou don't wanna end up in that yard\nYou don't wanna end up in that yard!\n\nWe got money, we got money, we got lots of promises\nWe got bitches, we got bitches, we take all your bonuses\nI get all this money, all this money make me stunning\nFlexing in, finessing in, these niggas bet their money!\nGrind in the squad shit, bitch, I want 100\nGetting money really good, she bitching me on stunning\nEvery day's a movie, niggas know I gotta get it!\n... niggas know I'm here to get it!\n\nIf you're holding, then we take them down\nFuck an ounce, we take em pounds\nNigga, this is not a game, homie, I don't play around!\nMoney, money, grind hard\nOnce I get it, then I flip it\nRolling, smoking, all with my niggas\nMotherfucker these bitches, uh!\nI'm so 100, Ben Franklin\nAnd they ain't gotta give me shit, I'mma take it!\nFuck niggas so broke, faggot niggas want more\nYoung niggas smoking soso, smoking grandaddy, no old folks!\nUh, the squad here, yeah rapping hard\nDidn't get it, sell some weed, hit the. bring the car!\nMy nigga's hustlers, you niggas ain't the same as us\nThese pussy niggas saying cause, cause\n\nWe got money, we got money, we got lots of promises\nWe got bitches, we got bitches, we take all your bonuses\nI get all this money, all this money make me stunning\nFlexing in, finessing in, these niggas bet their money!\nGrind in the squad shit, bitch, I want 100\nGetting money really good, she bitching me on stunning\nEvery day's a movie, niggas know I gotta get it!\n... niggas know I'm here to get it!", "album": "Precious", "year": null, "image": "https://images.genius.com/ad5fda577e43622efe1fc5a293f68e9e.540x540x1.jpg"}], "artist": "Young Chop"}