{"songs": [{"title": "My Mind Ain’t Right", "image": "https://images.genius.com/e8332ec55c5b62595f4d276fc1d954f3.500x500x1.jpg", "lyrics": "Whats up man?\n\n(Lynch) Whats that?\n\nIts that prozac\n\n(Lynch) How many - how many milligrams is that?\n\nShit, five hundred. Better watch out for these boys\n\n(Lynch) Let me get some of that. I NEED it\n\nHahaha... Shit. What the fucks wrong with you boy. Whats up..\n\n[Hook]\nSee - my mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nCause they won't find your body - shine your lobby\nWith flashlights - run in your spot time the robbery\n\n[Verse 1]\nLast night ran in your spot - blinded the other three\nTalkin to my A-K forty seven like cover me\nI'm goin' in - here I go again\nBack to fuckin' with that O-8 English mixed with gin\nBack to tuckin' shit thats cold make things rip your chin\nCrack your dome I'm takin' gold thangs - shake mixed with cocaine\nNo brain - nigga it ain't no thang to\nRun up on you with the rain leavin blood stains - who\nWanna fuck with me - the psycho of the city\nI spit poison like poison boy back in the eighties\nAnd it ain't pretty - the Sacramento Frank Nitty\nThe black version - all you heard is the Mac burstin'\n\n[Hook]\nMy mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nMy mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nCause they won't find your body - shine your lobby\nWith flashlights - run in your spot time the robbery\n\nSix minutes to get in and out - play time\nRun up in your house with the toys - don't say nuthin'\n\n[Verse 2]\nSee somethin' ain't right - I'mma need some prozac nigga\nMentally off balance and it shows in my tracks nigga\nSmokin' on a pack of cigarettes and malt liquor\nPut your brains on a plate for dinner - like Dr. Lector\nRed spot your sweats up - only one slice and your necks cut\nSquirtin' out that red stuff - all over your dinette stuff\nDrippin' into your living room - Im dippin' through your stash\nWheres my cash - don't make me take it out your ass\nDon't make me take it out on your family - fuck your thug homies\nWho mug on me - I plug homies with slugs homie\nThought you really knew me but you - don't even know me\nAll you know is I drink O-E - thats from the songs nigga\nYou fuckin' with the wrong nigga bout to get touched up\nLike car paint - O-E and weed - is how my breath stank\nSpittin' at your war tank - for the more bank\nThats the only reason what you niggas think - I got problems\n\n[Hook]\nMy mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nMy mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nCause they won't find your body - shine your lobby\nWith flashlights - run in your spot time the robbery\n\nSix minutes to get in and out - play time\nRun up in your house with the toys - don't say nuthin'\n\n(shhhhh)\n\n[Verse 3]\nPost your comments here - on my motherfuckin' nutsack\nSo fuck that nigga - I put his guts in a black sack\nAnd in the back of the black S-U - ever since I was a test tube baby\nI been sicker than Reservoir Dogs with the rabies\nJust - smother it in gravy it'll work for me - but you forgot\nNiggas better pay me I don't work for free\nMix the O-8 and the gin and I'm like Hercules\nBout to - hurt your knees with these two two-threes\nMake you hop like - Ju Ju Bees right off the motherfuckin' canvas\nIts like liver and chitlins you niggas can't stand this\nI deliver the rip spit shit - that get ridda bitch quick shit\nHit niggas with tips and split shit in half like citrus\nAnd I dips dips - to the honeycomb - money gone\nNow these niggas mad cause I own shit and release my own shit\nAnd got chrome grips and hollow tips - pointed at your face\nOpen your mouth - straight - ointment to the face\n\n[Hook]\nCause my mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nMy mind ain't right - I got personal issues\nBout to drop your family off a box of some tissues\nCause they won't find your body - shine your lobby\nWith flashlights - run in your spot time the robbery\n\nSix minutes to get in and out - play time\nRun up in your house with the toys - don't say nuthin'\n\nShhhhh", "year": null, "album": "Lynch By Inch: Suicide Note"}], "artist": "Brotha Lynch Hung"}