{"artist": "CalBoy", "songs": [{"title": "Moonlight", "album": null, "year": "2019-01-23", "image": "https://images.genius.com/64b54c0120200471c24a9e73a3e28456.1000x1000x1.jpg", "lyrics": "[Intro]\nAh, bitch, we criminal smooth\nY-Y-Y-Yung Lan on the track\nAnd I hang with the mob, ahaha\nYou know I'm with the mob\nBitch, we criminal smooth\nHundred bands for a kilo, nigga\nAyy, ayy\n\n[Chorus]\nAnd it ain't nothin' new, on the grind for the loot\nAnd I hang with the mob, bitch, we criminal smooth\nBitch, I gave you my heart, can you tell me the truth?\nBoy, you better think smart 'cause you know what we do\nYeah, they know how we move, right? Girl, they sneak, better move right\nWe still baggin' them tools, right? My niggas be wolves in the moonlight\nDrop dead, we gon' hit 'em, don't start, we gon' hit 'em\nTrap hard in the kitchen, broken heart with no feelings\n\n[Verse]\nAnd I know all these niggas lames and these bitches fu, they be changin'\nI know niggas think it's sweet, nigga, we can link, get it bangin'\nIf I blow, let these bullets burn, chopper sing like it's Usher Raymond\nAnd I roll with some real killers and some real drillers, know they dangerous, tweakin', we make it, we famous\nAll this money got 'em upset, ayy, hundred niggas want me dead, ayy\nExtended my mag, ayy, run up on me, you get whacked\nYeah, I roll with the warriors, we run through the city\nYeah, we finna slide and we finna slide, ain't leavin' no witness\nYeah, ayy, bro in the kitchen, he whippin' the Whitney\nI got some money, you don't know the feelin'\nAyy, thirty on me, make a fuck nigga get back\nYeah, get back, yeah, hop in the foreign and zig-zag\n\n[Chorus]\nAnd it ain't nothin' new, on the grind for the loot\nAnd I hang with the mob, bitch, we criminal smooth\nBitch, I gave you my heart, can you tell me the truth?\nBoy, you better think smart 'cause you know what we do\nYeah, they know how we move, right? Girl, they sneak, better move right\nWe still baggin' them tools, right? My niggas be wolves in the moonlight\nDrop dead, we gon' hit 'em, don't start, we gon' hit 'em\nTrap hard in the kitchen, broken heart with no feelings"}]}