{"artist": "Will Smith", "songs": [{"year": "2002-06-11", "lyrics": "Intro:\n(Come Come on)\n(Come on Come Come on M-I-B)\n(The Black Suits Comin)\n(The Black Suits Comin)\n\nI'm Comin... I'm Comin... I'm Comin... I'm Comin\nI am the man in black I'm back\nBreaking the back of the random attackers\nSo can the flak\nYo Im dangerous\nI've been trained to bust\nWhen a stranger fuss try to endanger us\nPraise me y'all\nDont nothing faze me y'all\nWhen they see me their gaze be all crazy y'all\nThey say I'm a myth\nTrust me if somebody riff\nOut of the depth of your imagination appears Will Smith\nBlack suit, the black shades, the black shoes\nBlack tie with the black attitude\nNew style black Ray-Bans\nI'm stunning man\nNew hotness pitch black six hundred man\nDon't you understand?\nWhat you thought I wouldn't come again?\nLeave you hanging without bringing you the fun again?\nTangling with the alien scum again\nMonumental it's the black suits running in\n\nChorus 1:\n(Nod Ya Head! The Black Suits Comin')\nLet me see you (Nod Ya Head! The Black Suits Comin')\nLike this, let me see you (Nod Ya Head! The Black Suits Comin')\nLike this, let me see you bop your head, nod your head, come on!\n(Nod Ya Head! The Black Suits Comin')\nLet me see you (Nod Ya Head! The Black Suits Comin')\nLike this, let me see you (Nod Ya Head!The Black Suits Comin')\nLike this (Nod Ya Head!)\n\nCheck it\nYo it's this chick right\nSerleena, making me sick right\nEarth is worthless to her she be tripping like\nThreatening me and my mens\nTrying to get the light\nThinking she's superwoman\nBut black kryptonite finishing whatever you start son\nThe best looking crime fighter since myself in part one\nBetter act right and play nice and sing along\nCause K is back and he hype\nWhat? Bring it on!\nWanna brawl with me? Trying to brawl with me?\nUnh Unh What What\nYo... what what... then... lemme... see you just...\nCome on... just come on and\n\nChorus 2:\n(Nod Ya Head! The Black Suits Comin')\nLike this, let me see you (Nod Ya Head! The Black Suits Comin')\nLet me see you (Nod Ya Head! The Black Suits Comin')\nLike this, let me see you(Nod Ya Head! M-I-B)\nLet me see you (Nod Ya Head! The Black Suits Comin')\nLet me see you (Nod Ya Head!)\nCome on! Come on! Let me see you (Nod Ya Head! The Black Suits Comin')\nLike this, let me see you (Nod Ya Head!)\n\nCheck it, Check it\nYo, case closed\nErase my foes\nChased away by the black suits, shades, and clothes\nWe above the law\nFeds can't touch me y'all\nHighly ranked black blank I.D. card\nSo disregard what you think you saw\nPut that phone down now\nWho you think you calling huh?\nOne little flash then good night there\nJust open your eyes honey look right there\nThank you mission completed\nI mean it we won't be defeated\nYou seen it we did it even with weapons depleted\nGalaxy defenders don't act like you don't remember\nTaking contenders and proving they only pretenders\nLadies and gentlemen, boys and girls\nThe Men In Black is back to protect the world\nWhen the enemy is near the elite is here\nSo have no fear just let me see you\n\nChorus 3:\n(Nod Ya Head! the Black Suits Comin')\nCome on! (Nod Ya Head! the Black Suits Comin')\nLike this, let me see you (Nod Ya Head! the Black Suits Comin')\nLike this, let me see you (Nod Ya Head! M-I-B)\n(Nod Ya Head! M-I-B) Woo!\n(Nod Ya Head! The Black Suits Comin') Unh!\n(Nod Ya Head! M-I-B)\nYo, yo (Nod Ya Head!)\n\nYo, Yo\nIf you want to rock just say (Ooo-oh!)\nTell me if you want to rock just say (Ooo-oh!)\nIf you want to rock just say (Ooo-oh!)\nCome on if you want to rock jusy say (Ooo-oh!)\nYo if you want to rock just say (Ooo-oh!)\nTell me if you want to rock just say (Ooo-oh!)\nIf you want to nod just say (Ooo-oh!)\nTell me if you want to rock just say (Ooo-oh!)\nHa!", "image": "https://images.genius.com/dd71777a362269bbbb4132743198f71f.458x478x1.jpg", "album": "Born to Reign", "title": "Black Suits Comin’ (Nod Ya Head)"}]}