{"artist": "360", "songs": [{"album": "Please Be Seated 3", "year": "2016-02-20", "title": "Hectickest", "image": "https://images.genius.com/88c1e39a08ef59af4f7539446b1fc7a4.500x500x1.jpg", "lyrics": "[Intro]\nAyy bro\nHave you ever met that fucking Tommy Sixx cunt man?\nThat cunt's a fucking nutcase, ayy, I've seen-\nI've seen the cunt full fly kick this fucking nanny right in her tits, mate\nMate, he's fucking mental repping FTP and shit\nWhen it comes to fucking hectic cunts, he is the hectickest\n(Yo put your motherfucking bitch up homie, you don't know who you're talking to)\n\n[Hook]\nYippy yippy yai, yippy yo, yippy yay\nFTP in the motherfucking place\nAnd you know we got a death wish\nYo you better leave that cunt alone I heard that dude's hectic\n\n[Verse 1]\nLet me tell you all a story 'bout a basic cunt\nNever wanted to be shit but a crazy fuck\nYou might have seen him at the station once\nYou never met him but I guarantee you hate the cunt\nDon't deserve him when he's taking drugs\nHe does the same shit Satan does, angel dust\nAnd the street cred he got he just made it up\nMiddle fingers in the sky and they motherfucking staying up\nYo he got himself a bitch but he ain't in love\nNever smokes all he raps about is blazing up\nNo car but he needs one\nThe type to see a speed bump then speed up\nHow many bodies? You'd love to know though\nNo Instagram but he loves a photo\nFTP on his fucking logo\nWhenever there's a camera, fuck the po-po\nSo hectic\n\n[Hook]\nYippy yippy yai, yippy yo, yippy yay\nFTP in the motherfucking place\nAnd you know we got a death wish\nYo you better leave that cunt alone I heard that dude's hectic\n\n[Verse 2]\nNo guns but he comes with a blade\nI guarantee he spells \"cunt\" with a K\nHis crew verse you, you'll get punched in the face\nBut if you see him one on one, he'll be running away (leg it!)\nIf he's got a backpack, then he's come for a paint\nPolo on and it's tucked in the front in the waist (throwies bruh!)\nYou should see his fucking rat's tail\nI mean literally on his head he stapled a fucking rat's tail\nI ain't saying he's on methadone\nBut I reckon it's either meth or don't so just let him go\nCheck the format, where's the porn at?\nSpend a whole year stealing all his ex's broadband (check me out!)\nDownloaded so much porn, got his broad bent\nNow he hear the chick's the lead singer of a broad band, (oh god cunt)\nHis crew look ready for war, but to us they look ready for sports\nSo fucking hekkas\n\n[Hook]\nYippy yippy yai, yippy yo, yippy yay\nFTP in the motherfucking place\nAnd you know we got a death wish\nYo you better leave that cunt alone I heard that dude's hectic\n\n[Verse 3]\nListen\nI'm kind of thinking that you should let him be\nYou fucked up though when you befriended him\n'Cause he'll be the best man and he'll lose the wedding ring\nAnd you'll find him trying to hock it in the queue for Centrelink\n(You want a ring mate?) Grabs pics with his crew and everything\nFace covered, homie, you ain't proving anything (throwies bruh!)\nHe ain't new to medicine but he brews amphetamines\nNo suit though but he's got the pseudoephedrine (any fucking pseudo)\nAnd promethazine while he's chewing mescaline\nToo incredible on a level that you will never be\nPick a fight like you offended him\nThe adrenaline in his head's a boost of energy\nSo fried that he'll lose his memory\nSo cooked he gotta Google everything like \"who just messaged me?\"\n\"Oi, cunt! Was that you who texted me?\"\nTwo phones he got a new one every week\nYo he's fed up with his bitches, he's never got a missus\nEverybody gets attached, human centipede\nIf you see him do crime, though, you should never speak\nHe's on the run without doing anything\nHe's the hectickest\n\n[Hook]\nYippy yippy yai, yippy yo, yippy yay\nFTP in the motherfucking place\nAnd you know we got a death wish\nYo you better leave that cunt alone I heard that dude's hectic\n\n[Outro]\nAw, man, things have just been fucked, ayy, like; My fucking, my missus cheated on me with my best mate. She did that on my fucking birthday. My fucking-\nThe rims  on my VL got fully jacked last week and it's been fucked, the tires have been fucked, I can't even drive the cunt around, can't do anything like that, the fucking-\nThey've frozen my Centrelink payments. They're not going to give me a payment until I fucking- until I give them- give them a medi- medical certificate, or something like that\nIt's just fucked man, it's just like, it's just sometimes I just, I don't want to go on anymore, you know what I mean? Like I just can't fucking do it any more. But-\nYou reckon you could spot me a tenner?Cheers cunt"}]}