{"songs": [{"image": "https://images.genius.com/0c18a75acfcf19165852eabf1a1fe910.1000x1000x1.jpg", "title": "Alone (feat. Sean Simmonds)", "album": "I’m Free - EP", "year": "2012-05-01", "lyrics": "[Intro: NF]\nYo, to be honest, I feel completely alone\nLike nobody knows me, nobody understands me\nYou know what I'm sayin'?\nYo, it's kinda like this, check it out\n\n[Verse 1: NF]\nI'm a little bit numb, little bit frozen\nA walking emotion, but nobody knows it\nNobody knows me\nI'm lost and I'm caught in a cold dream\nBut they don't see that I'm walkin' around so boldly\n'Cause nobody out there knows these\nThoughts in my mind, am I wastin' my time?\nI know, I won't survive; hold me\n'Cause I'm bleedin' to death\nI got these holes in my chest\nI feel like no one respects the fact that I'm up to my neck\nI've done my best, but still, yet it seems like I'm out in the cold\nLook at me froze; here on my own\nPlease, don't let me die here alone\n\n[Chorus: Sean Simmonds]\nI cannot face this alone\nI can't get by on my own\n\n[Verse 2: NF]\nLost in the moment, life in a coma\nLyin' around, see my life getting colder\nI'm alone, but I go nowhere\nLiving in a prison in my mind; so scared\nI don't wanna be this way, nah\nI don't wanna feel this way, nah\nI don't wanna die this way, why am I this way?\nWish I had wings so I'd fly away\nNothin' around me, up where the clouds be\nI'm the real definition of drowning\nMy pain and my head keeps pounding\nHow's he even living in the state he's at?\nLeft the pain, swear I'd never go back\nBut it's right here and it's quite clear that it's not leaving\nDoes anybody hear me?\n\n[Chorus: Sean Simmonds]\nI cannot face this alone (I need You, I need You)\nI can't get by on my own (I need You, I need You)\nI cannot face this alone (I need You, I need You)\nI can't get by on my own (I need You, I need You)\n\n[Verse 3: NF]\nI was a little bit numb, little bit frozen\nKinda hard to see when your eyes ain't open\nHow you gonna breathe when your sin keeps chokin'\nYou to the point that you feel hopeless?\nHopin' things will turn around\nKinda hard to fly when you layin' on the ground\nJesus is the only reason any of us breathin'\nYeah, so don't get down\nYou ain't gotta live your life in the cold\nThinkin' nobody out there knows\nWhat you been through, where you been to\nYeah, you ain't gotta live alone\nHe's Messiah, He's Creator\nThere ain't no one out there greater\nForget about them haters, accept Christ and make a change-up\nYeah, 'cause you ain't gotta die this way\nLet Him wipe them tears right from your face\nLife's a dream\nSo you better get back on track; in other the words, I'm saying:\nGive Him your pain, give Him your hurt\nFaith is way more than just going to church\nMaking your money and going to work\nYou don't give it to God? You'll watch everything burn, yeah\nAnd this ain't no game\nLiving without Him is just so insane\nPeople, they livin' for money and fame\nThings never change 'cause we living the same\nI don't wanna be alone; hate the cold\nI'm so broken, I'm so froze\nBut no longer\n'Cause I got my Jesus, and he makes me stronger\n\n[Outro: Sean Simmonds]\nYeah, woo!\nI can not face this alone (I need You, Lord, I need You, Lord)\nI can't get by on my own (Like the fly what meets the rain, I need You)\nI can not face this alone (Alone, I need You)\nI can't get by on my own (Lord, I'm here, Lord, I'm here)\nBeggin' You, beggin' You, please\nI'm down on my knees\nI need You, I need You\nAyy, oh, I need You, I need You\nLord, I can't make it without You, make it without You, no\nNo, Lord, I can't make it without You, make it without You alone"}], "artist": "NF"}