{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "The Life", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "(Prodigy talking)\nYeah\nHey, hey, hey, hey\nIt's like this nigga, yeah\n\n[Prodigy]\nAiight before I get started spark up the Laureltons\nLight up the night up, now let's get it going\nTo the mothafucking top, I don't mothafucking stop\nTill we find life out there and setup shop\nParty rocking, bottles popping at Henny and Mo'\nIt's like 500 bitches now we're having a bowl\nGot a gun, screwdriver, a knife, and a shank\nPlus I break face bones with my platinum rings\nIt's a ghetto love story I'm in love with the life\nOf the rich and Infamous, Ferrari's and Ice\nLamborghini bikes, they ain't make those yet\nI'm still waiting for that 700 Benz\nI do it for my niggas in the dead and in the pens\nJust when you think this shit's over\nThat's when this shit begins\nThis the Bronx, this Harlem, Brooklyn and Queens\nThat 'New York State of Mind' where you're popping 'em thangs\n\n(Chorus) Prodigy X2\nThe violence don't stop\nThe beef don't cease\nThe money keep coming\nThe paper increases\nThe gun fire don't end\nThe people stay dying\nSo I'mma keep living the life\nYou damn right\n\n[Prodigy]\nMurda, murda, the murder\nKilla, killa, the killer\nFrom Queens goddammit\nI'mma menace to the planet\nPut your body on that asphalt, fucking asshole\nCome to the hood and you ain't got no passport?\nHe couldn't get his gun out the stash fast enough\nSo that nigga got his ass blasted up\nKeep the Hennessy coming, and we keep lighting up\nNigga I stay sedated, that's right we're not cut\nFrom the same cloth, you're chin-chilla soft\nI'm brilla-pack cost, I'll take your skin off\nYou *edit* --- rub me the wrong way\nYou're a suit and tie nigga, P hoody all day\nTattoos and jewels - Mister Cartoon\nAnd Gabriel in the district, get all my loot\nI'm addicted to looking fresh\nI'm super fly, got a bad habits for hammers\nI'm in love with .9s\n\n(Chorus) Prodigy X2", "year": "2008-04-22"}]}