{"artist": "Apathy", "songs": [{"title": "Baptism By Fire", "image": "https://images.genius.com/e141ff9150df93387385a0a66f7cbd92.678x658x1.jpg", "album": "Baptism By Fire", "lyrics": "[Intro]\nYo, I'm layin' something down right now\nYou want me to hit you back soon as I get done? Alright one\n\n\"Get on up\"\n\"Get into it\"\n[X8]\n\n[Verse One: Apathy]\nMany moons ago before the boozie and hoes\nBefore you silly Earthlings confused my flows\nBefore crows took souls where the demons go\nAnd God made life where the semen grows\nI was raised in the east little felon in the streets\nOn a celly with a priest in the belly of the beast\nIn the telly with a freak, R. Kelly on her face\nBefore Biggie Smalls smeared jelly on his steaks\nWhispered in your girl's ear till she came in her panties\nCause Ap raises hell like Damien's nanny\nI ain't human anymore, a homosapien family\nI'm a bionic rabid gorilla, grabbin' the skrilla\nRapid refiller, rapper killer, still the illest as Illmatic\nMagic or voodoo spell caster bring you to hell faster\nRock Star status five star hotel trasher\nDevil in a blizzard that makes snow melt faster\n\n[Verse Two: Esoteric]\nBack in the saddle, the pterodactyl is cracking the gavel\nFlow stupid, still trooper in battle\nI'm pullin' dimes with the fine waistlines\nMy lean is similar to Michael Jordan dunkin' baselines\nYou get the fibula?\nE.S. and Ap throwin' bombs like Esiason\nWe turn heads like a violin\nYou cats die of sin we die of nothing we're immortal\nWe're crypt keepers, Fate changers, Script readers\nThrow up your dick beaters if you wanna clash with us\nWe hazardous\nWe a dyin' breed, this here's the last of us\nYou say you stack cake but you look real fake\nLike 50 dollar papes in a strippers tit shape\nOr a handshake from jake\nDemigodz +Stay Real+ like Erick Sermon cassette tapes\nMy Wally moccasins will stomp you out like Billy Costigan\nAnd have you gaspin' for oxygen\n\n[Verse Three: Emilio Lopez]\nHate it or love it, I shine on the sheets\nTake a quick trip, look inside the mind of a beast\nNice ever since I laid down the rhyme to the beat\nAnd I'm never fallin' off like crime on the street\n\"I think it's time to retreat\", said the fake motherfucker\nAnd if they don't soon, I'm gonna make motherfuckers\nI'm real cool\nBut honestly I hate motherfuckers\nSo I plan to leave 'em deep beneath the lake by the summer\nMILF, either that or put the snake on your mother\nThen duct tape her and bounce with a cake in a Hummer\nI'm baked up, sittin' back, baggin' up Henny\nSippin', politician, stackin' money like the fuckin' lotto hittin'\nCare less for media and fuck all the politicians\nI'm on a mission, the clock is tickin' for competition\nGPS satellites focused on opposition\nDemigodz\nStart a revolution with composition", "year": "2009-01-15"}]}