{"songs": [{"year": null, "image": "https://images.genius.com/f567edfefa972b04faf2516e9b374839.769x768x1.jpg", "title": "Maan!!", "album": "City of Syrup", "lyrics": "[Verse 1: Big Moe]\nI done hit the pint to the head like Maan!!\nComin' down gotta potent ass purple Sprite Maan!!\nI hit tha boulevard red wit me tight like Maan!!\nI hit tha boulevard man an I outta sight Maan!!\nI dun took my gallon 2 tha whole head like Maan!!\nSippin' potent ass drank I ain't sca'ed like Maan!!\nThem hatin' ass niggas they be dead like Maan!!\nMoe comin' down drank I dun spread like Maan!!\nComin' down real 4 my Texas fo' squash plexin'\nBought my car Lexus Maan!! I 'bout to wreck it\nIt's dat Moe-torola Southside money folda\nMan I told ya befo' my AK(Maan!!) I'm down to holda\nIn a drain man million dolla stain hit tha boulevard\nMoe-yo gon spread rain(Maan!!)\nI can spread drank man I'm speakin bout tha barre\nI'm rollin' foreign car drank in my jelly jar\nWhat'z up Noke D. what'z up Dolla Bill(Maan!!)\nI'm higher than a hill I'm bout to throw my grill\nWhat'z up to tha Darren what'z up to my niggas\nI'm down to pull tha trigga barre done made me thicker\nFuck Hilfiger FUBU shirt(Maan!!)\nIt'z tha Moe on tha mic I'm hittin' where it hurt\nU can't fuck wit a G Big Pokey he's my kinfolk til I D.I.E\nS.U.C Wreckshop Family(Maan!!)\nI hit tha boulevard top down feel me uhh Maan!!\n\n[Hook: E.S.G]\nAll my G'z in H-Town like Maan!!\nDallas ballaz puttin down like Maan!!\nWhere my Shreveport bangaz say Maan!!\nAll my Austin, Texas swangaz say Maan!!\nWhere ya'll at in Lil' Rock say Maan!!\nA.T.L. ya don't stop like Maan!!\nNew Orleans bling bling like Maan!!\nWatch Wreckshop do our thing like Maan!!\n\n[Verse 2: E.S.G.]\nI hit tha showroom flo' I live tha thug life\nI want tha coupe two dooor twenties and kits my screens lit\nWatchin' beach party flick 2 boppers takin turn on my Maan!!\n10 thousand on my wrist I'm da boss\nTold me take my chain off let my body defrost\nFeel like I'm frozen(Maan!!) Da chosen(Maan!!)\n14 on my neck 5 thousand on my hand like Maan!!\nMan I chop block like fanz man\nSee my propellas when I land\nHoppin' outta candy helicopter E.S.G. wreckshoppa\nFat lady gon' sing tha opera\nIt's over (Maan!!) I thought I told ya\nMe & Moe-torola SOUTHSIDE SOULJA\nAnd dat Poe-torola screwed-up clicksta\nCall me E.S.G. tha freestyle fuckin' fricta Maan!!\n\n[Verse 3: Big Pokey]\nI'mma jump up in this thang u see I'mma sayin'\nI ain't gon' stop cuz this Sensei 4 sho\nHittin' tha do' and bound to wreck it showin' nutin' but naked\nBut boyz respect cuz I'm tha Maan!!\nPushin' a Benz or Lex-land painted tan\n18'z kickin' in tha ass like Jackie Chan or that Tae-bo\nSee that Hydro that's all I blow and ask that Big Moe\nPush a 4-do' rep tha logo u know it'z me\nBite tha mic arr bitch I'mma G see\nWon't stop I set up shop then I wreck it\nShow ass naked mob-style protected\nSensei don't play won't play\nNever did pop the lid on the pint\nTurn it upside down and I'mma sip it\nGimme a kilo and I'mma whip it ship it\nDistribute it just like tapes\nWhen I touch tha track tha track bein' rape Maan!!\nA gorilla untamed nigga know my name\nSensei or Maan!!\n\n[Hook: E.S.G]\nAll my G'z dat'z stackin' endz say Maan!!\nAll my ballaz in tha pen' say Maan!!\nWhere ya'll at in S.A. say Maan!!\nCalifornia all day say Maan!!\nCrooklyn Queens let me hear u say Maan!!\nJersey fellas let me hear u say Maan!!\nFlorida killaz let me hear u say Maan!!\nTampa dealaz Miami say Maan!!\nShreveport Monroe say Maan!!\nAlexandria P.A. say Maan!!\nWhat ya'll think it'z us skillz say Maan!!\nWreckshop in tha do' say Maan!!"}], "artist": "Big Moe"}