{"songs": [{"image": "https://images.genius.com/d0c3bfc953bbd7536f45aaec207b791d.1000x1000x1.png", "title": "Paranoid", "album": null, "year": null, "lyrics": "[Pre-Chorus]\nCan't even go out to eat no more, gotta order in\nThese niggas plottin' on me, do you know what it feels like?\nDo you know what it feels like when niggas watch your every move?\nCan't even try on shoes, is what it feels like\n\n[Chorus]\nShe say I'm paranoid (Paranoid, paranoid)\nShe say I'm paranoid (Paranoid, paranoid)\n\n[Verse 1]\nHow am I supposed to ball out?\nCan't even go out to the mall now\nWithout these niggas followin' me, without the paparazzi\nThese bitches, they wanna call me and set me up\nBut I ain't stupid though, I call my hitta and he let it blow\nI ain't tryna do that, tryna rap\nMake my own beats and write my own rhymes and make this shit look easy\nThese niggas they mad, wanna take my shine, but they really just wanna be me\nSmokin' this dope 'til I fall asleep, my own people moving sleazy\nI guess thats the price of the fame, niggas throwin' salt on my name\n\n[Pre-Chorus]\nCan't even go out to eat no more, gotta order in\nThese niggas plottin' on me, do you know what it feels like?\nDo you know what it feels like when niggas watch your every move?\nCan't even try on shoes, is what it feels like\n\n[Chorus]\nShe say I'm paranoid (Paranoid, paranoid)\nShe say I'm paranoid (Paranoid, paranoid)\n\n[Verse 2]\nI remember tryna send 'em beats\nThey didn't wanna fuck with me, almost gave this shit up\nDid it on my own and I fill their hearts with jealousy\nDon't message me tryna get no beats 'less you got some stacks\nIt's the 6 side, where you show love and they don't love you back\nI don't diss, side niggas plot on you and try to take your racks\nLookin' over my shoulder, gotta watch my back\nAnd I'm only gettin' older, gotta get a sick Benz\nLivin' in the 6 and, only got about like 6 friends\n\n[Pre-Chorus]\nCan't even go out to eat no more, gotta order in\nThese niggas plottin' on me, do you know what it feels like?\nDo you know what it feels like when niggas watch your every move?\nCan't even try on shoes, is what it feels like\n\n[Chorus]\nShe say I'm paranoid (Paranoid, paranoid)\nShe say I'm paranoid (Paranoid, paranoid)"}], "artist": "NAV"}