{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/bd7b60d4c3bac04c86bf875607522d71.500x500x1.jpg", "year": "2015-12-16", "album": "Wish Me Well ", "lyrics": "[Hook]\nWhen I come get my shit, it better add up\nFirst I was hustlin' backwards, it didn't add up\nAye, being broke wasn't fun, thought it was bad luck\nI heard it didn't make sense if it didn't add up\nI might pull up on her soundin' like a panther (yeah)\nI swear all my life I ain't have nun\nI spent all my nights tryna make it add up\nI know this ain't  right, shit gotta add up\n\n[Verse 1: Lucci]\nOkay, this rollie on my wrist say it's my time now\nLouis V frames to block the pain in my eyes now\nOf course I'm high right now\nStill a blow a 10 you better pipe down\nThey keep asking me Lucc how you feel?\nCan't believe it's real, finally got a deal\nWhat's the deal? Gotta keep it real\nTryna make a mil, a couple mil\nHad to tell em chill\nI swear all this damn pain got me poppin pills\nThese niggas act like they'll do it but then they won't\nIt's in the hood, but at the trunk\nYou know I'm good with the pump\nI promise to god I'll hit his ass and I ain't talkin tunk\nA young nigga I had to grind to do what I want\nYeah yeah\n\n[Hook]\nWhen I come get my shit, it better add up\nFirst I was hustlin' backwards it didn't add up\nAye, being broke wasn't fun, thought it was bad luck\nI heard it didn't make sense if it didn't add up\nI might pull up on her soundin' like a panther\nI swear all my life I ain't have nun\nI spent all my nights tryna make it add up\nI know this ain't  right, shit gotta add up\n\n[Verse 2: Lucci]\nUh, what is this nigga?\nYou know that hublot on ya wrist, it don't exist nigga\nI thought I told him I pop shit nigga\nIn that panamera porsche with ya bitch nigga\nDid I mention I'm makin six figures?\nThey say change come when money come\nWonder if they still gon love me if all my money gone\nThey say they with me but don't know a song\nAin't it funny how them suckas gone\nYeah yeah\n\n[Hook]\nWhen I come get my shit, it better add up\nFirst I was hustlin' backwards it didn't add up\nAye, Being broke wasn't fun, thought it was bad luck\nI heard it didn't make sense if it didn't add up\nI might pull up on her soundin' like a panther\nI swear all my life I ain't  have nun\nI spent all my nights tryna make it add up\nI know this ain't  right, shit gotta add up", "title": "Add Up"}]}