{"songs": [{"year": null, "image": "https://images.genius.com/8f42b22ec5549467826fbd0c750ab571.450x450x1.jpg", "title": "Do Ya", "album": "Who’s Hard: Gang Starr Presents Big Shug", "lyrics": "[DJ Premier]\nYeah, yo\nLadies and gentlemen I present to you straight out the Gangstarr Foundation:\nBIG SHUG! Go ahead speak on...\n\n[Big Shug]\nCatch me sipping on that moonshine tonic\nFreshly dipped in these hip hop garments\nYou try to bomb it, I take it and disarm it\nHit you in the gut now you vomit, Sean John all on it\nBut I rock them wheels\nReal niggas pop up and stay right there\nFake niggas stand down and stay right there\nThis is street music so it stays right here\nBig shug, I spit fire for the hood\nFor realness feel this, higher for the hood\nBlazing blocks, ripping internet some web pages\nI rip stages, with ?v-block? and singapore\nYou want the raw? It's pure and uncut\nMe and my cats we're pure and uncut\nYou niggas is butt, so I say screw ya\nI bring them four fives and two twos to do ya\n\n[Chorus]\nI bring the fire to your grill, I barbecue ya\nI got the flames on blaze, just to do ya\nI'MA DO YA!\n\n(*\"Ease up, don't freeze up\"*)\n(*\"Then let it be known, I don't play\" Latee - No tricks*)\n\nI bring the fire to your grill, I barbecue ya\nI got the flames on blaze, I'ma do ya\nI'MA DO YA!\n\n(*\"Ease up, don't freeze up\"*)\n(*\"Then let it be known, I don't play\" Latee - No tricks*)\n\n[Big Shug]\nYou wouldn't know the truth if it bit you in the throat\nIf it was written all over linen in your coat\nIf it jumped up and slapped you to the floor\nIf it banged in your head like ?two-one-four?\nYou breath the fakeness, click click take this\nYou fake rich, so you dont own shit\nAnd soon all your kids will just know\nThat dad's homo and you scream: Oh no!\nI see through you, I ?peep? your concept\nYou need to understand like Funkmaster Flex\nI drop bombs on nothing but real shit\nMy hip hop is nothing but real shit\nLike hot bricks, it sticks to your ribs\nFront on me and I'll do ya, kid!\nI straight do ya!\n\n(*\"Ease up, don't freeze up\"*)\n(*\"Then let it be known, I don't play\" Latee - No tricks*)\n\n[Chorus]\n\n[Big Shug]\nIt's a thin line between snitch and jake\nBetween real and fake, between piehead and cake\nYou snitch the jake and get killed\nReal niggas pop, fake niggas get drilled\nI make cake for moving, them pies and pills\nFuck the gangsta overkill, I spit for real\nDeal is in place, rhymes is in place\nJaw is out of place when you spit with this taste\nOr even approach with that disrespect\nI put two to your neck and beat your ass for wreck\nI straight do ya!\n\n(*\"Ease up, don't freeze up\"*)\n\n[Chorus]\n\n{*DJ Premier scratches to the end*}"}], "artist": "Big Shug"}