{"artist": "Gangsta Boo", "songs": [{"title": "City Streets", "album": "Enquiring Minds II: The Soap Opera", "year": null, "image": "https://images.genius.com/30e7334a2ad6fbeb54795962628374c7.313x313x1.jpg", "lyrics": "Whisper:\n(I can't be f**kin wit dem\nThese niggas shady baby\nThey want to eat up off me\nBut they dont want to pay me\nThey want to take my life\nI ask tha lord to save me\nIts super-serious now THAT YALL come its tha crazy lady.)\n\nNormal voice: (Chorus)\nI can't be f**kin wit dem\nThese niggas shady baby\nThey want to eat up off me\nBut they dont want to pay me\nThey want to take my life\nI ask tha lord to save me\nIt super-serious now THAT YALL come its tha crazy lady\nI can't be f**kin wit dem\nThese niggas shady baby\nThey want to eat up off me\nBut they dont want to pay me\nThey wat to take my life\nI ask tha lord to save me\nThis shit is serious now THAT YALL come its tha crazy lady\n\nVerse 1:\nIm just a cool chick around tha way hood chick\nAin't takin no shit from a nigga or a bitch\nI ride late night high lookin in tha sky\nIm askin god why we live life until we die\nThese entertainment niggas foney they don't be your friends\nThey lookin at me smilying damit with an evil grin\nI just be lookin at tha scene\nAnd now and everybody rapin now this shit is killin me\nYou do not have no tallent!\nIm bout to take it to another damn level\nAnd go back down and down what you niggas think im tryna tell ya\nIm gonna stand up on my own\nIm gonna re-play my TUNE im goona give it\nIf u take it listen to my song\n\nThis time around\nI got far niggas wit me cus tha closes one's around are tha closes one that CROSS ME (yea)\nIts all good cus bull-shit destroyes self\nIm gonna be tha last one standin till i reach my death!\n\n(chorus)1X\n\nVerse 2:\nThey wonder why im crazed\nThey must be in a daze\nGit out tha purple-haze they pay me then begin to blaze\nYou ain't gon see me scared\nYea i ain't ever scared\nLook how you made me feelin crazy all up in tha head\nSay what you wanna say\nPlay how you wanna play\nIts gon git ugly nigga trust me i will stop your days!\nYou ain't no made niggah\nYou be's a fake nigga\nI no tha truth do you want me to explore it nigga!\nI no some wilde shit\nShit that's on tha hush (hush)\nAnd if i told\nYou will proly try to f**k me up\nSo ima play it cool\nBaby call me cool Boo\nI no your GONA GIVE was comming to you real soon\nHer man real got me bumpin in tha studio\nBoo need's you\nI glad that you found my soul\nIf you be wise, true\nIf you be platnum or gold\nJust git your money and reamber keep your buisness close\n\n(chorus)1X\nYea f**k you. pay me"}]}