{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Sample]\n\nDarling\nYa know, you give a man a reason for living\nNot to mention, you take my paycheck\nNow baby, but I give it to you because I love you\nYa know cuz the things that I feel so proud about\nThe things that you do\nYa know, like runnin' my car into telephone poles\nBut I still love you baby, I didn't get mad did I?\nY-Y-y'member, 'member when\nW-W-When I tried to take my clothes to the cleaners\nAnd on the way out\nMy very best pinstripe caught a nail\nI didn't get mad\nI was proud because you thought, enough of your man\nTo be in such a hurry\nIt made me feel grand, yes it did\nUuh I need you, I just need you\n\n[Verse 1]\nUh\nYou know I was your bread, your butter\nAnd I ain't talkin bout that bread I fucked up on you\nCause in my head man I swore I lucked up\nWasn't countin all the butter I spreaded on you\nSo true now, why would I play you bitch I made you\nI'm not talkin bout the things that I gave you\nClothes wit the labels, I brought you round Hov and the label\nSpring water while holdin you're age koo\nNaw I ain't tryin to degrade you\nBut you was a lost little girl n you're world boo I saved you\nYa pop owe me a favor, I basically raised you\nFrom squada to Bentley-whippin\nAin't have to watch Cribs to see how I was livin\nMe, so blinded ain't see the Robin Givens in you\nHuh, shoulda seen the Ginger in you\nTried to off Beans like Rothstein? Go figure\nYouu take my dough, spend wit the next nigga you crazy bitch?\n\n(Chorus #1)\nAnd dis was the one I trusted\nWho would ever think she would spread like mustard\nBitch I was your bread and butter\nYou shoulda tucked dat bread and butter\nYa know what?... Dis shit funny to me\nIt ain't nuttin but money to me\nYou lookin hungry to me\nBut I was your bread and butter\nBitch shoulda tucked dat bread and butter\nMm Mm Mm Mm Mm Mm Mm Mm\n\n[Verse 2]\nYou got the whole town laughin at me, silly he\nSilly to see got me feelin silly like Denise like\nOh what could it be in you, I see\nN dis young P-Y-T\nShe got me L-O-V, E-T-K-O'd\nUh, like Teddy P. whatever she say goes\nBut I'm, ready to +Turn Off The Lights+\nClose the door, on my pretty young mi amor\nNow peep game wit 'em, need, I, more\nGimme dat, E thy or\nNo Beanie Mac don't play dat crap wit these whores\nShe want me missin her (in my room) like the O'Jays homes\nBut I'm on to my zone like O.J. Jones\nBeano brown, cancel dis bitch, I'll buy another one\nIt's my world you lil squirrel tryna get a nut bitch\nDo you- what bitch? Lil smut bitch\nGot you're name ringin, spreadin like mustard\nAnd I'm supposed to trust it after he touched it?\n\n(Chorus #2)\nI told dat ass +slow down+ like Puba\nNow your days are gray like the 4 pound Ruga\nBread and Butter, see I was you're bread and butter\nHeyyy, baby ya hips is getting big\nNow you getting thin you don't care about your whip\nCuz I was you're bread and butter\nShoulda tucked that bread and butter\nMm Mm Mm Mm Mm Mm Mm Mm\n\n(Bridge being sung)\nSo proud, of you.. a'ye-ah\nI gotta say it loud, yes I do, a'yeah (yeah yeah)\nWhen you do (do) What you do (do)\nHow do you know, What you know\nAw, shame on you\nI need you (oh oh)\nMm Mm Mm Mm Mm Mm Mm Mm\n\n[Verse 3 - Grand Puba]\nYeah\nNow you know I was your bread and butter\nYou had a shot to be my baby mother\nAin't no sorry I ain't Rueben Studdard\nI can't apologize, it's multi-platinum time\nTakin all my shit and sendin you back to you're moms cryin\nSo don't cry baby dry, ya eyes\nYou tried to get all greasy like you super-size fries\nSo, pack ya shit\nLeave the whip\nIt's been nice but listen ma I gotta defrost ya ice\nDats rite\n\n(Chorus #2)\n\n(Bread and Butter 4x)\n\n*Mm Mm said repeatedly til fade to end*", "image": "https://images.genius.com/48c4319dfc3c978405c6c446d03d8171.500x500x1.jpg", "year": "2005-03-29", "title": "Bread and Butter", "album": "The B. Coming"}]}