{"artist": "Watsky", "songs": [{"year": null, "lyrics": "Sup, bitch!\nNa, I'm just messin' with ya\nWhat I meant to say was, \"Never give up!\nAlways be yourself.\"\nIt's gonna suck hearing that over and over as you get older\nBut as stereotypes start with a grain of truth\nCliches begin with a boulder\nAnd no matter what you're an animal, a born natural\nSo you don't need some motivational speaker asshole\nFeeding you reheated inspirational corn casserole\nYou magical bastard!\nGet it through your brain, inject it in your vein\nGet infected with the strain\nThe strange idea you're a reflection of the greats who came before\nMore than science\nOur body's our history's oldest appliance\nWe're piggyback riding the shoulders of giants\nWhich is how we survive when the ceilings keep getting higher\nAnd the light bulbs keep burning out\nWe learn by word of mouth\nAnd when your time has passed, don't drag each other down\nCause being a crab in a bucket is mad lonely\nBe the crab escaping from crab prison\nWho creates a crab rope out the window made only of crab homies\nCause we're in this together\nFuture you is just past you with new molecules\nWe shoot the old ones out follicles\nAnd hair is dead cells, so our faults get shed well\nMeaning our parts that are hard to adore\nGet mopped up on the barber shop floor\nIn other words\nAlthough you often don't remember people's names\nOr are at the center of attention at all the wrong times\nAnd spend, roughly, six hours a night on your side\nWatching Boy Meets World reruns\nYou are capable of outgrowing that bullshit\nI'm aware there is doubt\nI don't believe in hell, but I believe in my parents' couch\nYou're gonna get depressed sometimes\nYou're gonna have weeks where you don't feel like eating\nWhere gravity is working overtime like it's afraid of getting laid off\nAnd you can barely lift your fork to your mouth\nAnd you are going to have a choice\nDo you wanna see this world as ugly, or beautiful?\nWanna know what I think?\nWell go fuck yourself! This is my poem\nAnd I think the universe is great\nIt's like God just chucked a bunch of candy into space\nAnd Earth is a jawbreaker\nSo it doesn't matter if you've got the biggest mouth\nYou can't just chew the world up and spit it out\nYou've gotta savor it\nFrom the grandest to the blandest nook and cranny\nEvery crooked alley, every mountain, brook, and valley\nFrom Candyland to Cali\nThat's been stamped by Rand McNally\nOrdinary is outstanding!\nSo don't be impressed by mere miracles\nAnd FYI, looking like a crusty hippy doesn't make you spiritual\nYou're gonna have to climb through a thorny mess of\nContradictions, underground rivers, and sometimes\nWhat you love the most will cause your biggest problem\nBecause you know what's awesome?\nWorld peace\nAnd you know what else is awesome?\nCatapults\nAnd that's just the goddamn truth\nThis world is so confusing\nBut you're gonna be fine\nYou're gonna be fine", "image": "https://images.genius.com/15e329cac8808712e9bcdedd4c1b05fd.1000x1000x1.jpg", "album": null, "title": "Letter to My 16-Year-Old Self"}]}