{"songs": [{"album": "A Year and a Day", "image": "https://images.genius.com/07b58bbb55162f134918e0fb84589756.500x500x1.jpg", "year": null, "title": "Done It Now", "lyrics": "Oh y'all niggas done fucked up now!\nI ain't playin' wit' ya, patna\nAll bets is off, the truce is over, fuck the world!\nI'm ready to die right here, nigga\n(This shit fucked up, nigga)\nThis shit ain't even funny no more, patna!\n\n(Verse 1: T.I.)\nYou can see me cautious 'fore you see this Carbon 15, watch it I'll squeeze, just throw it up and keep coughin'\nI'mma bring it out I promise they don't see it often\n100 round bullets you can take the beam off it\nThe powder give you power while you gettin' geeked off it\n'Til you 6 feet deep dead sleepin' in a coffin\nI ain't playin' with these niggas fuck 'em, let 'em keep talkin\nBet they patnas need suits after they bodies need chalkin'\nNow you the raw\nSeparate the realest from the soft and you the flawed\nI probably wouldn't a believed it 'til I saw it\nThem niggas think they flossin' tell 'em step into my office\nI'm feelin' standoffish homes, you better back off it\nBust that boulder on your shoulder, I'mma blow the back off it\nDrop you off the bridge in Florida feed you to the dolphins\nCop 100 bricks in Georgia drive 'em to the office\nAnd if I bag 'em up in ounces better get a mil' off it\nTrippin' off some bullshit you better chill off it\nTryin to beef and start some bullshit to get a deal off it\nNiggas gon' be killed off and they mamas out here lost it\nAnd now they mothafuckin' life it's gonna cost 'em, nigga\n\nChorus: (2X)\nYou done done it now\nRun up on him spray 100 rounds\nGun 'em down\nWhy these pussy niggas runnin round?\nHunt 'em down\nI want them niggas dead\nI want they head I want it now\nI'mma put you in the ground, nigga\n\n(Verse 2: T.I.)\nYou bearin' witness to the latest and the greatest\nYou should listen to the latest cause them sucka niggas hatin'\nHands down best, shit, the realest ever made it\nLand in a jet, Tre'mel, we done named it\nRide in Ferraris, drops, Bentleys and Mercedes\nThey envy the nigga's swagger\nWould die for the nigga, playa\nYeah they gettin' mad but I don't wanna do favours\nNigga I'm too major\nTalk to you later\nAlready hated you and gettin' more paper\nNow how you think they take it he the best on paper\nGracin' the front pages?\nPay attention to the latest\nYou ain't heard the word? Better listen to the ladies\nKing of the whole thing, no ifs, no maybes\nBut the game so crazy\nNiggas is so shady\nTryin' to play fair niggas think its so crazy\nThat's when the arm raise and the guns gon' blazin'\nCajun, sizzlin' hot it gone crazy\nPlayin' hard ball you diggin' yo own grave and\nIf the police get you 'fore me it's O.K\nWe gon' have a nigga fuckin' you in the prison wit' AIDS\n\nChorus: (2X)\nYou done done it now\nRun up on him spray 100 rounds\nGun 'em down\nWhy these pussy niggas runnin round?\nHunt 'em down\nI want them niggas dead\nI want they head I want it now\nI'mma put you in the ground, nigga\n\n(Verse 3: Lil' Wayne')\nI'm a bullet past cuckoo\nAnd I be wit' a bunch of dogs, no goof troop\nAnd I'm the shit I stay away from the poop scoop\nFuck wit' me I turn you to angels like Snoop Snoop\nYou catch shots like the hoop do\nThe bullets spin you around and hula hoop you\nAnd I don't give a damn who you\nSee all you hear is \"Brrrap! Brrrap!\" and \"Su-whoop!\"\nDo you\nKnow what I do t'you\nOr what I'd do to the child you grew\nI'm wild, so zoo, like I'm Japanese\nIf niggas wanna jump they fuckin' with the trampoline\nAnd when the block hot I come through like mezzanine\nThe fireman, hoe, I smell like gasoline\nI got somethin' on the flo' that would blow you to smithereens\nHead, arms, feet, brains, heart, liver, spleen\nBitch I'm clean\nIn the city where niggas be droppin' like Fonzie\nWake your ass up, bitch, nigga you not dreamin'\nPussy-ass boy die screamin'\n\nChorus: (2X)\nYou done done it now\nRun up on him spray 100 rounds\nGun 'em down\nWhy these pussy niggas runnin round?\nHunt 'em down\nI want them niggas dead\nI want they head I want it now\nI'mma put you in the ground, nigga"}], "artist": "T.I."}