{"songs": [{"image": "https://images.genius.com/768c1b4bad8e74a3dd3399be6bf3fa6b.450x450x1.jpg", "lyrics": "[Intro]:\nWhat up, what up\n\n[Hook]:\nBurn it down\nDown, burn it all down\nI don't give a fuck, bitch\nI got the volume up when I burn it all down\nBurn it all down\nI don't give a fuck, bitch\nI got the volume up when I burn it all down\nBurn it all down\nI don't give a fuck, bitch\nI got the volume up when I burn it down\n\n(Seven on the beat)\n\n[Verse 1]:\nFour arms, grip this bottle of Sapporo\nFour arms, rip your body like I'm Goro\nI'm a poisonous Black Widow spider\nWith eight legs\nPlus I got nine heads like Hydra\nIn fact\nI'm into swallowing blood\nI got your wifey just falling love\nThe name is Mac\nNo, bitch, I'm not some doctor\nI'm performing operations with my shotgun chopper like kapow!\nGettin' so hostile\nLet's begin\nYou open your twat mouth to talk loud\nI reach in\nYou're thinking I took you to a chop house\nWhen these men sock down your weak grin\nAnd knock out your teeth, friend\nBut the end ain't coming 'til the fat lady bitches really loud\nAnd she's quiet cause my dick is in her mouth\nIt's like a buck knife to the throat\nBut one cut might push your dumbstruck life to the quotes\nOn the tombstone, inscribed:\n“Mac's tone and vibe inflicted homicide.”\nDimwit dipshits, don't you know it's only pride?\nPush your ego aside, damn, little homie, hide\nIt's like your drunk wife doing dope\nOr some punk guy using soap to cut white screwing hopes\nYou'd better save her, hoping maybe you and her elope\nShe tied you down, but when she saw me, she just threw the rope\n\n[Hook]\n\n[Verse 2]:\nI'm sicker than the AIDS that exist\nTurn your stethoscope\nGot that Ezio blade on my fist\nThese idiots still sign with L.A. Reid?\nGoddamn, doesn't anyone in L.A. read?\nMomma told me don't stop fighting 'til they bleed\nI'm like ??? with that L.A. Greed\nThe zany shit, I'm kicking that forever\nRappers are in danger, I got game and fifty\nGetting back together\nI'm a damn assassin\nAnimus builder\nGot a bottle of Sapporo and a can of dot pills\nI'm a fucking wooly mammoth with my hands made of silver\nFront kick to your face like I'm Anderson Silva, blaow\nDrop the mic, grab a steel knife and threw it\nI don't battle in my music, bitch\nIn real life, I do it\nI've literally ended some careers, you can YouTube it\nIf you keep opening your mouth then I'mma Shoe Goo it\n\n[Hook]", "year": null, "album": "Irish Goodbye", "title": "Sapporo"}], "artist": "Mac Lethal"}