{"songs": [{"year": "2017-08-16", "title": "There You Go", "image": "https://images.genius.com/8d2127789af7e42b31ecbcab8950c164.1000x1000x1.jpg", "lyrics": "[Verse 1: Saba]\nI'm butter like Leopold\nLook, I tell 'em to keep it low\nI put all my people on\nFuck, whoever be opposed\nI'm in a deeper zone than on my last one\nRun all of it backwards, you punt\nI chose to go for it was in the corridor\nNow I'm on choruses (uh), I can never fold\nI'm 'bout my coin like the laundry tho'\nI get my paper then adios\nYoungin' with bars like a audy home\nSaba but well known like sabido\nSober but got off a addy doe\nI tell the truth on like every song\nI drop a classic that's Abbey Road\nYou can add 'em up\nTwo under my belt like I'm fat as fuck\nYou begging for help like you had enough\nWe really not into that acting tough\nI'm really myself in this, I'm like a out west philanthropist\nI write my songs with no cannabis\nI'm in the Bay bitch I'm tapping in\nI coulda made what you made if I signed\nI'm a independent young black men\nI'm at yo head, that's a CAT scan\nNot here to kick it no Jack Chan\nRandom shoutout to my black fans\nListening to it and yelling out pivot\nI'm partially studious, partially ignorant\nI'm not here for the 15 minutes\nAll my team is winning, Imma need a minute\n\n[Hook: Saba]\nYeah this nigga musta lost his fucking head, nigga\nWhere it go? Where it go? Where it go? Where it go? (Oh)\nSince high school I lost all my fucking friends, nigga\nWhere they go? Where they go?\nWhere they go? Where they go? (Oh)\nThey point to the lame in the yearbook and be like\nThere you go, there you go, there you go, there you go!\nI guess it's funny cuz I'm pretty much the man now nigga every\nWhere I go, where I go, where I go (Oh, oh)\n\n[Verse 2: Saba]\nNot to be cocky but it's a reason they copy me\nCopy machine epson, they salty they seasoning\nHow many times must I do something completely\nOut of the seemingly simple, you seen it boy, y'all done seen me\nFunny thought y'all was competing\nI Petey Pablo my block though, I raise it up like it raised me\nI'm talking cluckers and killers we come from customers daily\nI Barnes and Noble these pages, my boy from Noble he famous\nHalf of my boys is on papers, the other half on them stages\nYeah I'm sick as the stage IV, take back the mixing you paid for\nYou should return all your beats to who made 'em\nBecause that was not what they made for\nI take my words and I wage war, I'm the best out I can assure\nI can guarantee it, I just let it be it\nI just say less while they say more\nI stand my ground like on a fort, winning because I am a sore-\nLoser, I maneuver like commuters\nThe water prolly bluer in the sewer\nThey want you to drink it like a brewer\nYou just blew ya chance like you were Bueller\nAnd ya interest, perfect attendance\nWas on the bus but now I'm on the tour\n\n[Hook: Saba]\nYeah this nigga musta lost his fucking head, nigga\nWhere it go? Where it go? Where it go? Where it go? (Oh)\nSince high school I lost all my fucking friends, nigga\nWhere they go? Where they go?\nWhere they go? Where they go? (Oh)\nThey point to the lame in the year book and be like\nThere you go, there you go, there you go, there you go!\nI guess it's funny cuz I'm pretty much the man now nigga every\nWhere I go, where I go, where I go (Oh, oh)\n\n[Outro: Saba]\nYeah there you go, there you go, there you go, there you go\nYeah there you go, there you go, there you go, there you go\nRemember that shit? Aye, what up Walt?\nThere you go, there you go, there you go, there you go\nAyy, ayy, yeah\nPivot\nPivotGang", "album": null}], "artist": "Saba"}