{"songs": [{"year": "2001-10-11", "title": "Makeshift Patriot", "image": "https://images.genius.com/af357ab92dde48966f2efd2335518e9f.268x268x1.jpg", "lyrics": "[Intro]\nI’ve heard enough of you young fellas, who think you know it all\nYou know nothing, you have not seen a shot fired\nAnd you’re waving the damn flag\nFrank, what’s up man?\nWatchin' some bullshit, on the news\nFuckin' bullshit. Reporters, tryin' to win a fuckin' Emmy\n\n[Hook]\nMakeshift patriot\nThe flag shop is out of stock\nI hang myself at half-mast\nMakeshift patriot\nThe flag shop is out of stock\nI hang myself via live telecast\n\nComing live from my own funeral\nThe beautiful weather offered a nice shine\nWhich is suitable for a full view of a forever-altered skyline\nIt's times like these I freestyle biased opinions every other sentence\nMy journalistic ethics slip when I pass them off as objective:\n\"Don't gimme that ethical shit.\"\nI've got exclusive, explicit images to present to impressionable American kids\nAnd it's time to show this world how big our edifice is\n\nThat's exactly what they attacked when a typically dark-skinned Disney villain\nUsed civilians against civilians and charged the Trojan horses into our buildings\nUsing commercial aviation as instruments of destruction\nPregnant women couldn't protect their children\nWheelchairs were stairway obstructions\nNow I have to backpedal from the shower of glass and metal\nWondering how after it settles we'll find who provided power to radical rebels\nThe Melting Pot seems to be calling the kettle black when it boils over\nBut only on our own soil so the little boy holds a toy soldier\nAnd waits for the suit and tie to come home. We won't wait till he's older\nBefore we destroy hopes for a colder war to end\n\"Now get a close up of his head\"\n\n[Hook]\nMakeshift patriot\nThe flag shop is out of stock\nI hang myself at half-mast\nMakeshift patriot\nThe flag shop is out of stock\nI hang myself while the stock markets crash\n\nThe city is covered in inches of muck\nI see some other pictures of victims are up\nGrieving mothers are thinking their children are stuck\nLeaping lovers are making decisions to jump!\nWhile holding hands, to escape the brutal heat\nSometimes in groups of the three\nThe fallout goes far beyond the toxic cloud where people look like debris\nBut all they saw after all was said, beyond the talking heads\nWas bloody dust with legs looking like the walking dead calling for meds\nHospitals are overwhelmed. Volunteers need to go the hell home\nMoments of silence for fire fighters were interupted by cell phones\nWho's going to make that call to increase an unknown death toll?\nIt's the one we rally behind\nHe's got a megaphone, and he's promising to make heads roll\nSo we cheer him on, but asbestos is affecting our breath control\nThe less we know, the more they fabricate. The easier it is to sell souls\n\nTalking Interlude:\n\n\"There is a new price on freedom, so buy into it while supplies last\nChanges need to be made: No more curbside baggage\n7PM curfew\nRacial profiling will continue with less bitching\nWe’ve unified over who to kill, so until I find more relevant scripture to quote, remember; our God is bigger, stronger, smarter and much wealthier\nSo wave those flags with pride, especially the white part\"\n\nWe sell addictive 24-hour candlelight vigil in TVs\nFreedom will be defended at the cost of civil liberties\nViewers are glued to television screens\nStuck, cause lots of things seem too sick\nI use opportunities to pluck heart strings for theme music\n\nI'll show you which culture to pump your fist at, and what foot is right to kiss\nWe don't know who the culprit is yet, but he looks like this\nWe know who the heros are. Not the xenophobes who act hard\n\"We taught that dog to squat\nHow dare he do that shit in our own back yard!\"\n\nThey happened to scar our financial state and char our landscape\nCan you count how many times so far I ran back this same damn tape?\nWhile a cameraman creates news and shoves it down our throats on the West Bank\nWith a ten-second clip put on constant loop to provoke US angst\n\nSo get your tanks and load your guns and hold your sons in a family huddle\nBecause even if we win this tug of war and even the score, humanity struggles\nThere's a desperate need of blood for what's been uncovered under the rubble\nSome of them dug for answers in the mess, but the rest were looking for trouble\n\n[Hook]\nMakeshift patriot\nThe flag shop is out of stock\nI hang myself at half-mast\nMakeshift patriot\nThe flag shop is out of stock\nI hang myself, don't waive your rights with your flags", "album": "The Known Unsoldier...Sick Of Waging War"}], "artist": "Sage Francis"}