{"songs": [{"year": null, "image": "https://images.genius.com/1a165debcabc064cd4d2ed1475b171bc.600x600x1.jpg", "title": "Gangsta Music", "album": "Crossroads 2010", "lyrics": "[Bizzy] Yeah, yeah\n\n[Chorus: Bizzy Bone]\nY'all cain't stop it\nY'all cain't stop, gangsta music-sic-sic-sic-sic-sic\nY'all cain't stop it\nY'all cain't stop, gangsta music-sic-sic-sic-sic\nBUCK BUCK!\n\n[Bizzy Bone]\nI guess my mother had a bad Bone\nSee back in the days she left all her little kids but nowadays she be like mad home\nThey told me to make a statement, I'ma make this blatant\nPeople act like they Jesus, and others play the game for Satan\nThis is the end of time\nAnd I'm the only lil' nigga in this motherfucker, Noah style, catch my line\n\"106\" don't like my music\nBut I got fans overseas tellin me \"B.B. come through and let the states lose ya\"\nYeah, yeah, BUCK BUCK!\n\n[Chorus]\n\n[Bizzy Bone]\nIbuprofen 800, I get along with Russell Simmons\nAnd Lyor Cohen; drip, my different fam flowin\nMichael can change his nose, Michael can change his clothes\nThe only thing I take off Michael was those pantyhose\nEveryone think I'm crazy, everyone think I'm drunk\nI told the world I was molested and they called me punk\nNo compassion or passion, my khaki suit be mashin\nBut let a nigga come with some tight jeans and they call it fashion?\nRappers don't battle me, I call them all out\nAin't nobody said a word, Bizzy Bone no doubt\nThe voice is just stupendous, his fanbase is tremendous\nSo I decided to give you all of me on Heaven's canvas\nPainstakin in childbirth\nI tried my voice on Auto-Tune they said it just ain't work, my voice just too twerk\nI'm from the middle of the universe, I should be Captain Kirk\nMotherfucker I earned it, and plus I put in my work\nYeah, yeah, BUCK BUCK!\n\n[Chorus]\n\n[Bizzy Bone]\nCan't stop my gangsta music, I keeps this gangsta anthem\nLook at the blimp, like a pimp, ohhh Tony Montana\nI'm #1 amongst my greatest with my country grammar\nTwenty records, still goin, I persevered through cancer\nI'm hearin \"106\" don't like my music\nBut I got fans overseas tellin me \"B.B., let them states lose ya\"\nI do my shows, y'all some lyin hoes\nI'm never sued because the promoters ain't do what they were supposed to do, ohh!\nWendy Williams, you need to kill the noise\nYou made your name up off of gossip and laughed, cause I was touched as a boy?\nGet on my nerves like you the next Oprah\nI put it on Tyra Banks, you look straight up like a drag queen mixed up with a gopher\nI'll never forget what you said about 'Pac, I'll never forget what you said about Big\nI'll never forget and I never forgot, I never forgot\nBut you commentate like you got the scoop, bitch you like 70 years old!\nListen here grandma, you was Geritol when Melle Mel was cold\nBitch! BUCK BUCK!\n\n[Chorus]"}], "artist": "Bizzy Bone"}