{"artist": "Fabolous", "songs": [{"year": null, "album": "Street Dreams", "image": "https://images.genius.com/4b857fc26420a638d0085145c7bcd7f3.1000x1000x1.jpg", "lyrics": "(Fabolous)\n(hahahaha)\nYeah, I'm a Ghetto Superstar nigga\nMost niggas trying to get one chick, right?\nI'm trying to get two\nYou know, two is always better than one, right?\nYeah..\n\n(Verse)\nI'm trying to kill two birds with one stone\nIt's 151's prone, that have you and hun's stoned\nTrying the unknown\nDoing things I know y'all parents wouldn't con-done\nIt's you, her and me; eyes too blurred to see\nSpeech too slurred to G\nBut you know \"Young'n\" would love ta\nSee ya upon each other, feeling on me while tongue'n each other\nWow! it's a wonderful thing\nTo have a pretty female under each wing\nThe cake can prob'ly Pollie, both of these Bobby Darlies\nThat take off their Rockavalis?\nMy job is narly from getting slobbed on Harley's\nGetting smoke from the supplier, robbin' Marley\nI hope this ain't tooking wrong\nBut ma now I wanna see how both of y'all look in thongs\n\n(Chorus)\nI got a bad bitch on my left side (oww)\nBad bitch on my right side (okay)\nI suggest it be best if we get by\nSaid a bad bitch on my left side (oww)\nBad bitch on my right side (okay)\nI suggest it be best if we get by\n\n(Verse)\nI'm willing to geese 'em if they feeling a threesome\nI'm pulling up in the GT before the dealers release them\nI ain't with the blazay blah\nCause I hold the record for the most Menage ' Trois and lama taje (?)\nI got a bad chick on my left lap\nBad chick on my right lap\nDo as I suggest, I confess\nAt my request they gon' get right\nSo when you see lipstick on both cheeks\nThat mean I slip dick in both freaks\nThey started calling me Two Time Johnny\nAfter repeatedly leaving the club wit two damn mami's\nThis brother done had 'em\nFrom close friends, the girls all know each other from Adam\nI'm always this humble boo, HELL YES!\nIt's cool for your girlfriend to come through too\n\n(Chorus)\n\n(Verse)\nAt the most it'll take an hour together\nTo get these girls from dancing wit each other\nIn to taking showers together\nThey know, it's a studio in Fab crib\nOne of y'all can rock the mic while the other one ad libs\nBoo, my government is personal\nBut I got enough sets of twins to make Doublemint commercials\nAfter trying X, I can only imagine what y'all be trying next\nThe stacks that I be splurging have girls in the back of the Excursion\nForgetting bout the fact that they was virgins\nI don't care who you bringing wit you\nJust let her know that I'm poking her while I'm fingering you\nI love that thing that you do\nAnd I know about the tongue and nipple\nBut I ain't know you had a ring in it too\nI can tell when they came, cause they start spelling my name\nLike F-A, B-O, L-O, U-S (oww)\n\n(Chorus)", "title": "Bad Bitch"}]}