{"songs": [{"lyrics": "[Produced by Dr. Dre & DJ Yella]\n\n[Intro: The D.O.C., Dr. Dre, and Ice Cube]\nRight about now, N.W.A. court is in full effect\nJudge Dre presiding\nIn the case of N.W.A. versus the Police Department\nProsecuting attorneys are; MC Ren, Ice Cube\nAnd Eazy-motherfucking-E\nOrder, order, order!\nIce Cube, take the motherfucking stand\nDo you swear to tell the truth, the whole truth\nAnd nothing but the truth so help your black ass?\nYou goddamn right!\nWell, won't you tell everybody what the fuck you gotta say?\n\n[Verse 1: Ice Cube]\nFuck the police! Comin' straight from the underground\nA young nigga got it bad ‘cause I'm brown\nAnd not the other color, so police think\nThey have the authority to kill a minority\nFuck that shit ‘cause I ain't the one\nFor a punk motherfucker with a badge and a gun\nTo be beating on and thrown in jail\nWe can go toe-to-toe in the middle of a cell\nFuckin' with me ‘cause I'm a teenager\nWith a little bit of gold and a pager\nSearchin' my car, lookin' for the product\nThinkin' every nigga is sellin' narcotics\nYou'd rather see me in the pen\nThan me and Lorenzo rollin' in a Benz-o\nBeat a police out of shape\nAnd when I'm finished, bring the yellow tape\nTo tape off the scene of the slaughter\nStill getting swole off bread and water\nI don't know if they fags or what\nSearch a nigga down, and grabbing his nuts\nAnd on the other hand, without a gun, they can't get none\nBut don't let it be a black and a white one\n‘Cause they'll slam ya down to the street top\nBlack police showing out for the white cop\nIce Cube will swarm\nOn any motherfucker in a blue uniform\nJust ‘cause I'm from the CPT\nPunk police are afraid of me\nHuh, a young nigga on the warpath\nAnd when I'm finished, it's gonna be a bloodbath\nOf cops, dying in L.A\nYo, Dre, I got something to say\n\n[Chorus]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 1: Cop, MC Ren, & Dr. Dre]\nPull your goddamn ass over right now!\nAww shit, now, what the fuck you pullin' me over for?\n‘Cause I feel like it!\nJust sit your ass on the curb and shut the fuck up!\nMan, fuck this shit!\nA'ight, smartass, I'm taking your black ass to jail!\nMC Ren, will you please give your testimony\nTo the jury about this fucked up incident?\n\n[Verse 2: MC Ren]\nFuck the police! And Ren said it with authority\nBecause the niggas on the street is a majority\nA gang is with whoever I'm steppin'\nAnd the motherfuckin' weapon is kept in\nA stash spot, for the so-called law\nWishing Ren was a nigga that they never saw\nLights start flashing behind me\nBut they're scared of a nigga, so they mace me to blind me\nBut that shit don't work, I just laugh\nBecause it gives them a hint not to step in my path\nFor police, I'm saying, \"Fuck you, punk!\"\nReading my rights and shit, it's all junk\nPulling out a silly club, so you stand\nWith a fake-ass badge and a gun in your hand\nBut take off the gun so you can see what's up\nAnd we'll go at it, punk, and I'ma fuck you up!\nMake you think I'ma kick your ass\nBut drop your gat, and Ren's gonna blast\nI'm sneaky as fuck when it comes to crime\nBut I'ma smoke them now and not next time\nSmoke any motherfucker that sweats me\nOr any asshole that threatens me\nI'm a sniper with a hell of a scope\nTaking out a cop or two, they can't cope with me\nThe motherfuckin' villain that's mad\nWith potential to get bad as fuck\nSo I'ma turn it around\nPut in my clip, yo, and this is the sound\n(Gunshot sounds)\nYeah, somethin' like that\nBut it all depends on the size of the gat\nTaking out a police would make my day\nBut a nigga like Ren don't give a fuck to say…\n\n[Chorus]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 2: Cop, Eazy-E, and Dr. Dre]\n(Knocking sounds)\nYeah, man, what you need?\nPolice, open out!\nAww, shit\nWe have a warrant for Eazy-E's arrest\nGet down and put your hands right where I can see 'em!\n(Move, motherfucker, move now!)\nWhat the fuck did I do, man? What did I do?\nJust shut the fuck up\nAnd get your motherfucking ass on the floor!\n(You heard the man, shut the fuck up!)\nBut I didn't do shit\nMan, just shut the fuck up!\nEazy-E, won't you step up to the stand\nAnd tell the jury how you feel about this bullshit?\n\n[Verse 3: Eazy-E & MC Ren]\nI'm tired of the motherfuckin' jackin'\nSweating my gang, while I'm chillin' in the shack, and\nShining the light in my face, and for what?\nMaybe it's because I kick so much butt\nI kick ass, or maybe ‘cause I blast\nOn a stupid ass nigga when I'm playing with the trigger\nOf an Uzi or an AK\n‘Cause the police always got somethin' stupid to say\nThey put out my picture with silence\n‘Cause my identity by itself causes violence\nThe E with the criminal behavior\nYeah, I'm a gangsta, but still I got flavor\nWithout a gun and a badge, what do you got?\nA sucker in a uniform waiting to get shot\nBy me, or another nigga\nAnd with a gat, it don't matter if he's smaller or bigger\n(Size don't mean shit, he's from the old school, fool!)\nAnd as you all know, E's here to rule\nWhenever I'm rollin', keep lookin' in the mirror\nAnd ears on cue, yo, so I can hear a\nDumb motherfucker with a gun\nAnd if I'm rollin' off the 8, he'll be the one\nThat I take out, and then get away\nWhile I'm driving off laughing, this is what I'll say\n\n[Chorus]\nFuck tha police!\nFuck tha police!\nFuck tha police!\nFuck tha police!\n\n[Skit 3: Dr. Dre, Cop]\nThe verdict:\nThe jury has found you guilty of being a redneck\nWhite bread, chickenshit motherfucker\nWait, that's a lie! That's a goddamn lie!\nGet him out of here!\nI want justice!\nGet him the fuck out my face!\nI want justice!\nOut, right now!\nFuck you, you black motherfuckers!\n\n[Chorus]\nFuck tha police!\nFuck tha police!\nFuck tha police!", "album": "Straight Outta Compton", "year": "1988-08-09", "title": "Fuck tha Police", "image": "https://images.genius.com/c8c5dd2610d23f4693d5e7a16e79c9b9.600x623x1.jpg"}], "artist": "N.W.A"}