{"songs": [{"album": "Trouble Man: Heavy Is the Head", "image": "https://images.genius.com/6c270013a37f81fa5c7f0606f8824d12.300x300x1.png", "year": "2012-12-18", "title": "G Season", "lyrics": "[Produced by Cardiak and Chinky P]\n\n[Intro: Meek Mill]\nOkay, aye man, I'm sucka-free, sucka duckin'\nTell all them suckas get the fuck outta my way MAN\nYou understand?\nG Season\n\n[Verse 1: T.I.]\nTold you motherfuckas once, prison ain't change me\nAll it did was make a nigga crazy deranged see\nPsycho, nuts so, what I give a fuck for?\nAll I know now is to get out and go for the gusto\nSo, fuck niggas fuck hoes, he said, she said, nigga and what so?\nFuck what they say 'bout my cases, fuck what they say 'bout my lady\nFuck what they say we were doing on the day of visitation\nAll I care 'bout is my out day and this next year of probation\nHow much dough I'm set to make, where I'm go'n go on vacation\nWait, damn. Okay that's way to far ahead of me\nSo I'm just tryna take it day to day if they would let a G, breath\nCop cars by the threes, Bitches call me Papa John cuz I keep that extra cheese\nOverseas in the sun, livin' for the fun in Milan with some bad bitches\nProbably one of yourn, when will it dawn on 'em I'm a Don\nRidin' foreign, curtains drawn, gettin' blown by a blonde, I'm the bomb\nTerrorist, hella rich, wreckin' shit\nNigga ask about me homie I suggest you tell'em this\n\n[Hook: Meek Mill]\nI'm sucka duckin', I'm sucka free\nYou ain't a G, Don't fuck with me\nYou sucka niggas out of style G season\nYou sucka niggas out of style G season\n\n[Verse 2: Meek Mill]\nMeek Mill\nGold plates on my Aston Martin bitch I'm ballin'\nKIllin' all my haters tell yo mama pick a coffin\nHundred rounds shawty, I just gotta pick the target\nPut my name on that flyer and watch the party get retarded\nAnd I go crazy in that bitch, look like Baby in that bitch\nGot yo lady on my dick, cuz I got like 80 on my wrist\nKOD, I make it rain, I know they hate me in that pitch\nSo I be there just throw in mula like they paid me for that shit, hold up!\nStarted in the back now I'm that nigga in the front\nShawty want the real so I'mma give her what she want\nOG nigga you can put it in the blunt\nFuckin' all the baddest biches, I'mma hit 'em from the front\nJust to see the faces on her, when this nigga laid on them\nErry time she ride that dick, I tell her go Jamaican on it\nLord have mercy, these bitches thirsty\nI'm in a Merci she kissin' on my Hershey\nWe in this bitch!\nI'm sucka duckin', I'm sucka free\nThat's yo main bitch? She fuckin' me\nI don't fuck with niggas, I'm a fuckin' G\nIt's Meek Milly, T.I., fuck the P\n\n[Hook: Meek Mill]\nI'm sucka duckin', I'm sucka free\nYou ain't a G, Don't fuck with me\nYou sucka niggas out of style G season\nYou sucka niggas out of style G season\n\n[Verse 3: T.I.]\nMy best flow to cold to just bring it out\nBut go and talkin crazy tho' you get yourself singled out\nHalf a million bust a pack the whole Arena out\nBein' a sucka I don't know the first thing about\nYou get the seen about, I'm comin' at yo face\nLike a volcano head, lava runnin' out yo face\nHey, If yo ass out of place\nYou'll find the weapons they took away I'll replace\nWhat can I say? Another year, another case\nAnother sentence completed, I'm confident and conceited\nI'm sucker free, sucker ducking, so tell them suckers to beat it\nDon't fuck with me busta, trust me your future will be deleted\nSuch a G, ain't no touching me, luckely I defeated the odd\nBut out my to Allah and glory to God, and I ain't even Islamic\nSo sick, whenever I vomit just throw me a mill' or 2\nAnd that ought to settle my stomach\n'Bout some money he done it, call me Mr. He Run It\nThese niggas ain't really bout it, they just be speaking ebonics\nI'm nothing short of iconic, promise you, you don't want it\nStrong as gin and tonic, my left you won't see it coming\nMy right you'll be running from it, I catch you with it, you done\nI'm a keep it a 100, you better get you a gun\nWord bond, real talk, do my dirt up by my only\nCuz them suckas will talk\n\n[Hook: Meek Mill]\nI'm sucka duckin', I'm sucka free\nYou ain't a G, Don't fuck with me\nYou sucka niggas out of style G season\nYou sucka niggas out of style G season"}], "artist": "T.I."}