{"songs": [{"title": "Parental Advisory (Interlude)", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Dave] (Lil Dicky)\nActually, you know what...\n\n[Jean] (LD's Mom)\nI don't, I-I will say one thing. I'd rather you sleep in a hotel downtown than sleep at your friend's house\nYou need a good night's sleep\n\n[Dave]\nHa, why?\"\n\n[Jean]\nWell, because you're gonna get up and perform, honey\n\n[Dave]\nYeah, I mean...\n\n[Jean]\nYou need, you just, I guess I just think you're underestimating...\n\nStewart: LD's Dad\nAnd not only are you gonna perform, you're gonna perform 3 shows in 4 nights\n\n[Dave]\nYeah\n\n[Jean]\nYou know, you don't wanna get sick. You don't wanna have a cold, you don't, you know\nI'm trying not to be a Jewish mother, here, but I think you're really underestimating this\n\n[Dave]\nNo, you guys are handling it, I'd say you're playing your role great as the, the Jewish parents of a rapper\nI'm curious to hear the conversations that happen between other rappers and their parents, I think these are interesting\n\n[Jean]\nWhat do you mean by that, David?\n\n[Dave]\nWhat do you mean what do I mean by that?\n\n[Jean]\nWhen you say we're handling our role, you think we're being, uh, we're being sarcastic?\n\n[Dave]\nNo, I-I enjoy it, I think it's funny. I'm just saying, like, I can't imagine, like\nPuff Daddy or something talking to his mom and she's telling him, like\n'You better get a good night's sleep, you can't catch a cold.'\n\n[Jean]\nI-I, you know what, actually, you're gonna laugh at me. I disagree with you, I think anybody's mother would do that\n\n[Dave]\nOk\n\n[Jean]\nAnd when Puff Daddy was 25 years old and the night before he was performing\nI'm sure somebody was telling him the same thing. That's what mothers do\nBlack, white, Indian, it doesn't matter who we are\n\n[Dave]\nI respect that\n\n[Stewart]\nBut Jewish mothers a little more\n\n[Jean]\nYeah, Jewish mothers maybe a tad more"}], "artist": "Lil Dicky"}