{"artist": "Anderson .Paak", "songs": [{"title": "Anderson .Paak Freestyle | LA Leakers Freestyle #063", "album": "LA Leakers Freestyles", "year": "2018-11-07", "image": "https://images.genius.com/38ba530ed894dc2886fd2795290c2c35.1000x563x1.jpg", "lyrics": "[Verse: Anderson .Paak, Justin Credible & DJ SourMilk]\nYou never know 'til you finally go there\nMomma told me dream big like my fo'head\nMy wig pushed back, ten racks to get repaired\nWell I guess I'm fuckin' bitches in knitted caps again\nSkipped the baggage claim, went straight to Rodeo\nFashion Week in Paris, never left the hotel\nBraggin' on my swag, I rather let these hoes tell\nAnd they wonder when I'll stop it, your guess is good as mine, man\nDrip on faucet like I came from the Oscars\nTell Chris Stampd I need more winter time options\nI came in and got love from the authors\nYou came in and got hit with foreign objects\nBrick and wool on my noggin but I remember the time when\nBack when ain't nobody love us, back when everybody fronted\nWe was prayin' for some bad weather, keep our pockets flooded\nThis is way before the hurricane but we could see it comin'\nHow much for a brick if I flip? Lately I been wonderin'\nGo to hell or get a job? Fuck you niggas buggin'\nI was meant to beat the odds, somethin' out of nothin'\nYou afraid to take a loss, I lost my older brother\nSister, father, auntie, cousin, I got nothin' left but y'all\nHockin' rubies from the jaw it's just another jewel bitch\nNow I got the sauce, okay now I got the juice, hey, hey\nI repped the 'Nard, even when you never knew it\nMy first release party, twelve niggas came through it\nFirst I got a lawyer, moved momma to Georgia\nCopped my sis a Honda, talk about spoiled\nIf I can't get radio I'm snatchin' up the products\nApple, Google, Amazon, Spoti-\nShouts out to Justin, shouts out to Sour\nIf I go commercial they gon' run me every hour (Every hour)\nOkay, you gon' run me every hour? (Every hour)\nOkay, you gon' run me every hour? (Facts)\nFirst I had my heart broke, then I had my heart meant\nThen I had a heart to heart with my conscious\nRest in peace to Mac, wish you was alive still\nAnd if we get to meet I'ma roll you up some ganja\nI'ma roll you up some ganja\nI 'preciate it man, look\nThat XXL freestyle was kinda ass\nSo I couldn't hit the Leakers without spittin' straight gas\nAnd I'm on a warpath and I brought my team back\nShout out to Aftermath, 12 Tone and Free Nash"}]}