{"songs": [{"title": "Out of Here", "image": "https://images.genius.com/0d6839530413c8ca4d5d4da399f117ee.640x640x1.jpg", "lyrics": "[Verse 1]\nOkay so it might appear\nTo an outsider that you found your way up out of here\nThey're saying you died of suicide\nThat's the last thing I want to hear\nThey tell me that it's hardly fair to blame myself\nWhat a hell of a cross to bare\nYou didn't say it in your letter\nBut the fact that I failed you is loud and clear\nFound out the amount of fear\nYou would drown when you found yourself naked staring down a mirror\nAnd partners are supposed to lay the cards bare\nI left you playing solitaire, and I promise you that I'm sincere\nIf you're looking for some judgment, you won't find it here\nLet's be honest here\nI can't say I've never known that kind of despair\nWhen the clouds appear, how's life fair\nI just want to draw you near\nNot to make it about me, but how could you check out\nBefore you really allowed me a chance to sit down and hear?\nI think I would've listened\nOr were you saying it all along and I just missed it?\nYou sang your swan song, we all dismissed it\nBecause you filled the room with laughter\nI watched when you thought no one was looking at you\nIn hind sight, I wonder where your smile went\nWhen the party ended and you swallowed it\nI saw you swallow it\n\n[Hook]\nOkay so it might appear\nThat you took yourself up out of here\nHow many cries soak through your disguise\nBefore you drown in your silent tears?\nOkay so it might appear\nThat you took yourself up out of here\nHow many times can you fight for your life\nBefore you throw that white flag up and volunteer?\n\nOkay so it might appear\nThat you took yourself up out of here\nHow many cries soak through your disguise\nBefore you drown in your silent tears?\nOkay so it might appear\nThat you took yourself up out of here\nHow many times can you fight for your life\nBefore you throw that white flag up and volunteer?\n\n[Verse 2]\nI've had car accidents\nWhere everything is slow motion no matter how fast it's happening\nEvery second that pass stretches so that you can watch it unraveling\nBut can't always react to it\nYour whole life might flash before your eyes\nThe minute when you transition to the other side\nBut what can actually happen in that time?\nIn-between the leaping and the moment you collide\nIn-between the trigger and the blast\nIn-between you let go of the wheel and you crash\nIn-between the moment when you swallow the last pill in the bottle\nTurn out the lights, roll the dice on tomorrow\nIs there a moment to reflect, can there be regret?\nIs there a wait not yet, let me reset?\nOr is it just too painful to accept?\nThat maybe death just seemed best\n\n[Hook]\nOkay so it might appear\nThat you took yourself up out of here\nIf you not winning, you can go down swinging\nEven if it doesn't feel like they're fighting fair\nOkay so it might appear\nThat you took yourself up out of here\nI'm trying not to resent you\nBut you left me defenseless in the life we share\n\n[Outro]\nEvery man before me in my fam died by his own hands\nHow am I supposed to understand my own role in the plan\nWhen nobody who grows old stands a chance?\nWhat about this mysterious dance\nMade you cut the cord to the curtain in advance?\nBut these are questions I can only ask\nThe person looking back in the looking glass", "year": "2017-05-05", "album": "All the Beauty in This Whole Life"}], "artist": "Brother Ali"}