{"songs": [{"lyrics": "[Verse 1]\nLet me get back on my hustle\nFuck a friend, it's off the muscle\nYou smoking dick, you think I trust you?\nBurn a nigga like I'm Usher (Boom)\nI don't go back and forth all on the internet\nHave no interest for discussion (No)\nPull her hair and choke her while we fucking\nI prolly give her a concussion\nI need a plate and I ain't tryna wait, I'm so fucking hungry I could starve\nMy nigga snuck in with the rod\nI'm bout whatever, that's on God\nI go to jail, I pay the bond\nPlease don't waste my fucking time\nHate on me I hit your hoe (Hoe)\nPlay with me I get that iron\nCan we fucking keep a secret?\nThat's a forty, bitch I keep it (Boom)\nMy bitch a fucking Puerto Rican\nI fuck her every other weekend\nThey swagger jacking, I can peep it\nThese nigga jacking my steelo\nBitch, it's a brick, it's a kilo (Brick)\nI beat a nigga up like Deebo\nHis bitch got at me on the d-low (Shh)\nI'm wit' my niggas shooting cee-lo\nWouldn't run up on me, that's a no go (Brr)\nI keep it on me like it's legal, bitch\n\n[Verse 2]\nThey shoulda told you I'm coming\nNigga play with me, I mop it (It's up)\nPull up on me, think I'm bluffing?\nBuss it on ya have ya running (Brr)\nYa bitch can get it if she want it (Oh yeah)\nI'm killing ya bitch from the back, I smack her ass and keep her coming (hey)\nAll my nigga, they a hunnid\nPolice behind me, I'm running (I'm gone)\nMy hoe make your hoe look ugly\nI don't do dimes, I do 20's (For real)\n20 thousand on a Monday (20)\n30 thousand on a Tuesday\nCaught ya bitch out on a Wednesday\nShe like my style, I had a choosing (Uhh)\nSleep on me and then you losing\nGot a beam on the chopper (Boom)\nMake you lean when I pop it\nGot some lean from the doctor\nWherever you see me, I'm ready\nMy name a weight, this shit heavy\nGot ya bitch face in my lap, parked at the 7/11\nYeah we at pump number nine\nThis ain't no pump, this a iron\nThey ain't let me in with the forty, snuck in the back with the 9\nThese nigga be acting and lying\nPosting up statuses crying\nThere really really ain't no real niggas\nAnd I'm 'bout to light the bih' line\nDaBaby", "album": "Back On My Baby Jesus Shit", "year": "2017-08-08", "title": "Pull Up Music", "image": "https://images.genius.com/6cfb06d37949c261469c889e6ba13f07.600x600x1.jpg"}], "artist": "DaBaby"}