{"songs": [{"image": "https://images.genius.com/d139ded1190d7e3c5cdc6dda61c6767f.600x600x1.jpg", "title": "Dilemma (Jermaine Dupri Remix)", "album": "Da Derrty Versions - The Reinvention", "year": "2003-11-25", "lyrics": "[Kelly Rowland] + (J.D.)\nI.. love you (oh) and I.. need you (sing to me Kelly)\nNelly I.. love you (this is) I do (So, So, Def) neeeeed you (c'mon)\n\n[Chorus: Kelly Rowland] + (J.D.)\nNo matter what I do (uh-huh) all I think about is you (uh-huh)\nEven when I'm with my boo (uh-huh) boy y'know I'm crazy over you (c'mon)\nNo matter what I do (uh-huh) all I think about is you\nEven when I'm with my boo, y'know I'm crazy over you (rock on)\n\n[Nelly]\nCheck it, check it, check it, uhh\nI met this chick and she just moved right up the block from me\nAnd uhh, she got the hots for me the finest thing my hood done seen\nBut oh no, oh no, she got a man\nAnd a son, doh'ohhh, but that's okay\nCause I, wait for my cue and just listen, play my position\nLike a shortstop, pick up e'rything mami hittin\nAnd in no time.. (no time) I\nI better make this one here mi-i-ne.. and that's for sure\nCause I, I never been the type to, break up a happy home\nBut uh, there's somethin bout baby girl I just can't leave alone\nSo tell me ma what's it gonna be?  She said\n{You don't know what you mean to me}  C'mon!\n\n[Chorus] - w/ Nelly + J.D. ad libs\n\n[Nelly]\nUhh, uhh, uhh, uhh\nI see a lot and you look and I never say a word\nI know how niggas start actin trippin out herre about they girls\nAnd there's no way-ayy-hey, Nelly gon' fight over\n(I ain't fightin over NO dame) no day-hey-ame.. as you can see\nBut I, I like your steez, your style, your whole demeanor\nThe way you come through and holla and swoop me in his 2-seater\nNow that's gangstah-ah-ahhh\nAnd I got special ways to thank yah-ah-ahhh.. don't you forget it\nBut uh, it ain't that easy for you to pack up and leave him\nBut uh, you and dirty got ties for different reasons\nI respect that and right before I turn to leave, she said.. she said\n{You don't know what you mean to me} she said.. she said, c'mon!\n\n[Chorus] - w/ Nelly + J.D. ad libs\n\n[Nelly] Sing it for me K\n\n[Kelly Rowland]\nI.. love you {word?} and I.. need you\nNelly I.. love you, I do.. {c'mon girl}\nAnd it's more than you'll.. ever know\nBoy.. it's fo'sho'\nYou can always count on my love {uhh}\nForeveeeeer more, yeahh-yeahh\n\n[Nelly]\nEast Coast, I know you shakin right, uh-huh\nDown South, I know you bouncin right, eh-eh\nWest Coast, I know you walkin right, cause\nMidwest, I see you swingin right\n{You don't know what you mean to me}\n\n[Chorus] w/ Nelly + J.D. ad libs\n\n[Ali]\nRemix, Kelly, Nelly, J.D., Ali\nNow when I met her, she had on her Burberry sweater\nPreppy college girl, graduated, drove a Jetta\nSaid she wanna go out but her man wouldn't let her\nI said - damn ma, you could be doin so much better\nAnd I - roll up a L on my way to go get her\nCause I - get what I want cause Nicky Sets' a go-getter\nAnd I - took her to the Card's and Cubs double-header {Cause}\nThen she left her man, I'd approach him with a formal letter like\n\n[Chorus] w/ Nelly + J.D. ad libs\n\n[Nelly]\nYeah, yeah\nEast Coast, I know you shakin right, what\nDown South, I know you bouncin right, Dirty Dirty like\nWest Coast, I know you walkin right, put your dubs up\nMidwest, I see you swingin right, whoo!\n{You don't know what you mean to me}\nEast Coast, you still shakin right, geah\nDown South, I see you bouncin right, Dirty Dirty\nWest Coast, I know you walkin right\nMidwest, you still swingin right\n{You don't know what you mean to meeeee}"}], "artist": "Nelly"}