{"songs": [{"image": "https://images.genius.com/f8db162f9c90abc1f4759748693fc8a5.784x768x1.jpg", "lyrics": "[Verse 1]\nKnick knack patty wack, give your ho some donkey\nListen to the bassline, don't it sound funky?\nWho could it be in the place to stay?\nThat's right, ho, Mac muthafuckin’ Dre\nOne more time back in your ear\nThose dope ass raps you love to hear\nCold as ice, nothin’ nice\nIf I thrust ya once, ho, I’ma thrust ya twice\nThat's right, and you know the deal\nYou don't want the baby, ho, take the pill\n‘Cause I'ma bust fadles back to back\nAnd when I get tired, I'ma take a nap\nAnd when I wake up, I'ma bath some more\nIt's the same routine until It's time to go\nYou, get what’s in my drawers, and girl I get those sugar walls\nOh, you didn't know about me?\nThe A the N the D the R the E\nWell, peep game, it goes like this\nI hold my mic tight like my dick when I piss\nAnd when it comes to cock, girl, I won't clean it\nAlways got my damn hat to the muthafuckin’ jimmy\nCold, bold, 19 years old\nWith a brain full of game to be told\nI'm from the V-town, 3 C down\nAnd a sucka don't wanna see me clown\nWho (who) could it be?\nThat’s right, Mac Dre, baby\nFunky fresh, in the flesh\nIt's me, Khayree and my joint of sess\nDoin’ it, like a porno star\nHittin’ in your box, or in your car\nCool, like the sweat from a snowman\nKick back, relax and listen, here we go, man\nTo the land of the dope rhyme\nAnd as the song flows on, I really hope I’m\nNot too dirty or rap too strong\nBut my mouthpiece is really goin’ on\nFrom Vallejo, California all the way to China\nHoes of the world, know I’ma\nStone cold mack with a gift to spit\nNothin’ but that dope shit\nSo damn fly, don't ask me why\nI smoke Indo and I smoke Thai\nMac Dre, I thought you knew\nDown and dirty doin’ things that only playas can do\nThe coldest MC on this here Earth\nHad to be fresh from the Crestside turf (Crestside)\nNot a Southside sucka who thinks he can rhyme\nBut a Crestside playa that's strapped with a 9\nAnd it don't stop\n\n[Verse 2]\nI say microphone check 1, 2, 1, 2\nIt's young Mac Dre, right back at you\nWit’ another dose of that dope\nYou see, I’m way more potent than coke\nThe young fly brotha’s on the mic, y’all\nI’m finna rock this muthafucka all night, y’all\nAnd just spittin’ and dope shittin’\nAnd to a nice, smooth beat that’s hittin’\nCold as ice, clean as soap\nI keep a fresh bag of zags in my Derby coat\n24 hours around the clock\n7 days a week, I’m on a prowl for cock\nDay in, day out, I spit and shout\nA true blue mack, know what I’m talkin’ about?\nIt’s just game (game), straight game (game)\nKick back, let it soak in your brain (mane)\nListen to me spit that pimpin’ tip\nI put the money to the wallet and the pussy to the dick\nStack a bank, slap a pack\nPut my muthafuckin’ tape in ya goddamn deck\nMan, take a bitch, break a bitch\nAnd when you're all done, cuddy, man, shake the bitch\nStraight high-sidin’ when you come through squat\nLeave a muthafuckin’ cloud in the parking lot\nLoad the brains, do some thangs\nPut the mounts on your fingers, man, fuck the chains\nPlay that ho like a game of checkers\nTreat her like dirt, take her money and wreck her\n‘Cause a ho, ain’t no good (no good)\nWhip her punk ass? Man, I sho’ would\nIt’s ’90, you gotta be def\nTake all the money until there ain’t none left\nYou see, some young brothas give her tongue\nLick between her legs and try to get her sprung\nThat ain’t the tip, ah, nah\nYou stupid muthafuckas, what’s wrong wit’ y’all?\nIt don’t take all that to get that ho\nIf you can’t her, nigga, say, ‘Trick that ho’\n‘Cause when you come up, she’ll be jockin’\nOn your front door, man, she’ll be knockin’\nWhen you let her in, it’s straight to the covers\nThat’s the way it goes, believe me, brotha\nI’ve been through it all, it don’t mean nothin’\nPussy ain’t shit, make the ho pay somethin’\nIt’s Mac Dre, hear what I say\nI spit the gift to gab, nigga, every day\nPimpin’, straight pimpin’\nI don’t wanna see you simpin’\nListen to my tape, play it all the time\nAnd when it’s over, man, press rewind\n‘Cause it’s dope shit, you gotta hear it\nAnd like coke, nigga, you gon’ clear it\nAnd to the top I’m goin’\nBitch, I’m flowin’\n\nAnd it…and it…and it don’t stop\nIt’s Mac Dre, y’all\nListen to the things I say, y’all", "year": null, "album": "Young Black Brotha (LP)", "title": "Gift 2 Gab"}], "artist": "Mac Dre"}