{"songs": [{"year": "1988-03-01", "image": "https://images.genius.com/77d88d155deb94b3da1eee1f8e5c78c1.395x400x1.jpg", "title": "The Biz Dance (Part One)", "album": "Goin’ Off", "lyrics": "[Verse One]\nI'm the Biz Markie, I'm known for beatboxin and rap\nAnd now it's time, to put Long Island on the map\nAnd lettin you know, that it'll put you in a trance\nIt's somethin funny made by me and it's called the Biz Dance\nI think the way I do it is so unique\nBy the way I move my hands hips legs and feet\nBut if you think that you can master it you got a fat chance\nCause it's very difficult to do, what is it called?\n\n[Hook]\nThe Biz Mark, Biz Mark.. the Biz Mark, Biz Mark\nThe Biz Mark, Biz Mark.. the Biz Mark, Biz Mark, Biz Mark\n\n[Verse Two]\nThe Biz Mark Dance, is second to none\nI'll explain at the moment how it should be done\nKick your legs 'til your pants almost rip\nShake from side to side, witcha arms and hips\nWhile you're doin it, if you mess up your hair\nThen you know party people that you're halfway there\nThey've heard of Biz Markie all the way in France\nAnd the kids in AntARCTICA is doin my dance!\n\n[Hook] - 2X w/ ad libs\n\n[Interlude]\nNow everybody out there that wanna learn the Biz Dance\nCome up to the front, all the ladies to one side\nAnd all the homeboys to one side\nAnd I'mma show you how you should do it\nYou should throw one leg to one side\nAnd then throw the other leg up to the other side\nThen throw your leg up above your head\nAnd then, this the way you do it\nOne.. two..\nOne, two, three, here!\n\n\"Go Biz Mark! Go Biz Mark! Go Biz Mark! Go Biz Mark!\"\n\"Go Biz Mark! Go Biz Mark! Go Biz Mark! Go Biz Mark!\"\n\"Go Biz Mark! Go Biz Mark! Go Biz Mark! Go Biz Mark!\"\n\"Go Biz Mark! Go Biz Mark!\"\n\n[Verse One]\n\n[Hook] - 3X w/ ad libs\n\n[Outro]\nNow I know Fort Greene can do the Biz Dance\nAnd Queensbridge can do the Biz Dance\nAnd Atlantic turtles can do the Biz Dance\nWhite {?} Lawanda can do the Biz Dance\n40 and Baisley can do the Biz Dance\nAnd Astoria Projects can do the Biz Dance\nEverybody on Farmers Boulevard can do the Biz Dance\nAnd I know Bayshore, C.I., Amityville, Wyandanch\nBrentwood, Corey, everywhere in Long Island can do the Biz Dance\nHempstead, Shreveport, everywhere can do the Biz Dance\nManhattan, Lincoln Projects in Colonial can do the Biz Dance\nEven the Bronx Co-Op City Bronx River can do the Biz Dance\nBut, they can't do it like me, HAHAHAHAHAHA!!!!"}], "artist": "Biz Markie"}