{"artist": "Angel Haze", "songs": [{"title": "On Fire", "image": "https://images.genius.com/a5a273b369e9716812075c0771b06c4b.600x600x1.jpg", "album": "Back to the Woods", "lyrics": "[Chorus]\nOoh yeah, somebody take it away from me\nOoh yeah, baby don't take it away from me\nOoh yeah, sunlight is crawling it's way through me\nOoh yeah, darkness is here, it'll stay for me\n\n[Verse 1]\nThere's a lot of shit I've been waiting to hear from you\nLike would you tell me what the fuck I'm here to do\nHad enough of this shit, there's a lot on my mind\nI just carry the weight as it piles on my spine\nI'm too far from my faith to rely on a God\nI'm too far from my brain, I'm too out of my mind\nI don' seen a nigga get his shit knocked back, for real\nI don' seen a nigga with his fist cocked back\nHit his bitch out back, 'till her shit got cracked\nAnd there's blood on the floor\nI know niggas ignore that the blood in a queen\nRuns the same in a whore\nFacts are the facts, we just choose to ignore\nI'm not givin' myself, what the fuck is this for, man?\n\n[Chorus]\nOoh yeah, somebody take it away from me\nOoh yeah, baby don't take it away from me\nOoh yeah, sunlight is crawling it's way through me\nOoh yeah, darkness is here, it'll stay for me\n\n[Verse 2]\nMan, I swear to God, I almost lost my mind, for real\nI left with all the pieces I could find and feel\nIt's dark now outside, but it's dark in my mind\nI lost all that I love at the same fuckin' time\nAnd the pressure to be, with the pressure to climb\nLeft me broken in places too desolate to find\nNigga, my brain is a cage\nIt's a place where the beasts that I'm battlin' lay\nMan, it's a wrap. I relax in my rage\nLike a bat, like a rat, in a trap or a cave\nYo, my thoughts all go black, they get trapped on a page\nThen reality comes like a slap to the face\n'Cause I'm dyin' to be, man, I'm dyin' to stay\nWhere I'm finally free, where I'm flying away\nThey don't want war, no\nWon't let me soar, yo\nTold 'em before, though\nTold 'em before, though!\n\n[Outro]\nHow you throw dirt on a seed and not expect it to grow, yo?\n(Oh my God!)\nMan, we come from the dirt, ain't no shinin', just in photos\nI don't wanna live a life on fire, and nothing to show for it\nIf sufferin' makes a God, then let me know more of it", "year": "2015-09-14"}]}