{"songs": [{"year": "2013-10-29", "album": "SlumLords ", "image": "https://images.genius.com/dddb42ed4bcb6b1359309bf75d9cc09e.300x300x1.jpg", "title": "Cut Her Off (Remix)", "lyrics": "[Produced by Will-A-Fool]\n\n[Intro: K Camp & (Too $hort)]\nIt ain't nothin' to cut that bitch off\n(Bitch you know me, it's daddy)\nIt ain't nothin' to cut that bitch off\n(I brought you in this world, and bitch I'll take you out, it's nothin')\nSo what you sayin', ho? You know I'm the man, ho\nNothin', but a bird, I'ma leave you where you stand, ho\nHeard you got a man ho, hope he understand though\nYou ain't nothin' but a creeper baby, I'm just sayin', though\nSayin' though, aye, it ain't nothin' to cut that bitch off\n(I cut a bitch off) It ain't nothin' to cut that bitch off\n\n[Verse 1: Lil Boosie]\nI had a super bad chick, she kept runnin' her mouth\nKept talkin' all bitch, so I cut that bitch off\nFire, ho, these hoes know I'm the man when I walk through\nAlex just paid me 80 grand for a walkthrough\n30 chains on, Boosie keep these hoes lookin'\nI could have the whole strip club, so I don't need your pussy\nMy exes talkin' 'bout when I was young and moved that dope\nThey ain't got me no more, you a woulda coulda shoulda ass ho\nI'm so hot, so hot, you know, since I've been home they call me hot sauce\nStraight goon, it ain't nothin' to get you knocked off\nForeign with the top off, runnin' since I got out\nI can't get that fire head, I'ma cut your ass off\nPeriod, you say I ain't the man then you're delirious\n\"Boosie, you just gon' cut me off?\" I told you I was serious\nTold you take the shot, girl, so you can't have no period\nBut you ain't listen, it's consequences - bye, ho!\n\n[Chorus: K Camp]\nIt ain't nothin' to cut that bitch off\nIt ain't nothin' to cut that bitch off\nSo what you sayin', ho? You know I'm the man, ho\nSo what you sayin', ho? You know I'm the man, ho\n\n[Verse 2: YG]\nBitch I'm from West Side, Tree Top Bompton\nYou ain't shit, actin' like you faithful but you're everybody's bitch\nEverybody done hit, everybody did somethin'\nYour ass butt naked, that's why I cut you off\nI know the situation, I don't need no explanations\nLyin' to me like I was slow, bitch this ain't The Matrix\nI got the naked pictures, yeah the ones you sent to everybody\nYou was hoin' so much, a nigga couldn't care about you\n\n[Verse 3: K Camp]\nYou thought I was playin' when I cut that bitch off\nI'm just tryna get inside that hole like you're golf\nOh that girl too nasty, she gon' suck it 'til it's soft\nRunnin' 'round with balls, woulda thought this was lacrosse\nYou can't tell me ain't the hottest in your city, that I know\nI see these niggas hatin' but they love it on the low\nEvery city that I hit, them bitches, they're in the front row\nI asked myself \"Why he mad\", but I found out that's his ho, that I know\n\n[Chorus: K Camp & Too $hort]\nIt ain't nothin' to cut that bitch off (Real playas represent, yeah mane, you know)\nIt ain't nothin' to cut that bitch off (It's like that sometimes)\nSo what you sayin', ho? You know I'm the man, ho (Look, it's over, yeah it's nothin' to me)\nSo what you sayin', ho? You know I'm the man, ho (I fucked with you, and you fucked it all, so it's over, bitch)\n\n[Verse 4: Juicy J]\n(It's ya boy Juicy J, let's get it!)\nIf she ain't making money, homie, it don't make sense\nJuicy J, quick to cut her off, treat her like Sprint\nTake her out, of the game\nBring her friend, off the bitch\nI'm a player and the coach\nI be balling out the gym\nI'm so high above the rim\nThey all that, catch me on film\nSay she just wanna kick it\nTil I kicked her out my Benz\nHoe, I'm in the... Hall of Fame, 20 years and running\nAnd my dough ain't... running out, marathon money\nI bet she would run a marathon for me\nDo whatever for the Benz, lick me like a sundae\nShe in church on Sunday; in the club Sunday night\nWatch me cut this chick off; I won't even need a knife\n\n[Chorus: K Camp & Too $hort]\nIt ain't nothin' to cut that bitch off (Real playas represent, yeah mane, you know)\nIt ain't nothin' to cut that bitch off (It's like that sometimes)\nSo what you sayin', ho? You know I'm the man, ho (Look, it's over, yeah it's nothin' to me)\nSo what you sayin', ho? You know I'm the man, ho (I fucked with you, and you fucked it all, so it's over, bitch)"}], "artist": "K CAMP"}