{"songs": [{"year": "2013-03-05", "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "Lemon Grass", "album": "Nehruvia", "lyrics": "[Produced by MF DOOM]\n\n[Intro: Juice Sample]\nHey man if Bishop calls or if he comes tell him I ain't here\nWhy, you don't like Bishop no more?\nWhy you asking so many questions man?\nCause I like Bishop!\nWhy?\nCause he's cool!\nHe's cool huh? Well you just tell Mr. Cool Man if he calls or comes by that I ain't here\n\n[Verse 1]\nSee now a lot of people ain't impressed I know\nCause I'm 15 rapping and the kid ain't got no flow\nYou bozo's drowning in the words I'm spitting\nSo get the row boat, cause the stream don't worry bout ?\nCause they loco and my mojo is so pro\nYet I'm loco and still strive for more glow\nBut your ho know that I'm up next, she undressed\nShowing her breasts, getting ready for sex\nIt's like that when you closer to the cash\nThe broads that used to laugh are ready to give you ass\nIt's nothing new, it's something you get accustomed to\nWhen people start feeling your crew\nOr feeling the moves that you making\nSo please don't be mistaken the game is what I'm taking\nI'm patient cause other dudes really ancient\nAnd really ain't shit, they basic\nMinds vacant, my rhymes sacred and I aim straight for greatness\n\n[Hook]\nI'm all about my cash and my cream and the dream\nCause it's all a nigga need on the thing\nYou lose in the booth, I'm the truth\nYeah, I'm young, you my motherfucking seed\nI fiend fitteds, stay green in kicks\nAin't worried bout none of these greasy chicks\nCause all they want is the cash when you get close\nAnd all they see is the cash when you get close\n\n[Verse 2]\nI spit facts\nYou spit shit no one reacts to\nJust had to let you know your rhymes wack dude\nI'm passed you, matter fact I'm on a scaffold\nIt's mad true don't act like I ain't catch you\nThere's mad clues cause you claiming you had rare jewels\nAnd tattoos, when I seen you, you ain't have two\nYou have to cut the bullshit now\nYour profile is wild\nMy pro styles is wild\nPeople know it, they just don't show it\nThey try to hold it most bitches\nMy hold is boasting\nAnd leave their devotion and commotions\nI'm still hoping that Hova hear me flowing\nAnd know that I'm cold from the go\nAnd that I'm chasing the gold\nAnd the gold with the golden globes are so so\nWhen a nigga scope, tryna get in the scope\nAnd get scoped by interscope\n\n[Hook]"}], "artist": "Bishop Nehru"}