{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Who But Me", "album": "Vengeance is Mine", "lyrics": "[X-Raided talking]\nNigga who was the first one screamin' the block\nOn these records nigga?\nWho was the first nigga that brought the town\nReally nationwide nigga?\nWho but me nigga?\n\n[Verse 1]\nDraggin' it tellin' it nigga ways, and peepin' the game\nPackin' it sellin' it nigga pay, keepin' the change Raided\nDeep in the game crack, sellin' it nigga track\nHit the bell and it hold back on the scene\nWid felons greens inhalin' the smoke\nSub-machines full ah violence on foes\nIn the club shoot beams and walk\nLookin' for fiends sellin' souls to the cops red\nDied in his shirt hurt, silence is proved dead\nI'm a soul to the block nigga that think violence is cute\nChase niggas in hot pursuit, nine's is mute\nSilencers screwed on the nose of the barrels\nThat cry murders youth\nThrow holes in devils like po' do\nCause riots and urge my loc if to ghost you\nMadman motherfucka we lootin' this mansion\nCause you lyin', rhymin' wid passion but no truth\nBad hands is dealt, like gamblers in Vegas\nMilk wives and niggas amplifiers invade the\nScrambler motherfuck it he called yo convo\nRed or blue if you cut the wrong one the bomb blow\nWe roll super thick like fire ants\nTroop wid heat like we bought gun stores wid my advance\nWho but me?\n\n[Chorus 2X: X-Raided] and (Dott Dogg)\nWho be flashin' (nigga!)\nWho be mashin' (nigga!)\nWho be smashin' (nigga!)\nWho but me? (Madman!)\nIf you cashin' (nigga!)\nIf you blastin' (nigga!)\nIf you thrashin', troop wid me (Madman!)\n\n[Verse 2]\nI'm can cannin' it nigga\nBeen bringin' it nigga\nFuck a lil Glocks and bails been bringin' it nigga\nScope loc Dogg crippin' it, slip the clip in it\nCatch 'em slippin' on dubs jack, then I'm strippin' it\nHennessey sippin' it, dope sack flippin' it\nCall the case I still got, court Dott skippin' it\nI ain't new to this nigga, been true to this nigga\nOff branch talkin' bout what they gon' do to this nigga\nBut I ain't feelin' them niggas\nSo I'm killin' them niggas\nDon't you try to tell him now these\nPair ah villains fillin' up niggas\nY'all know how I do, and know what I does\nSet trip ain't no love, let 'em know what's up cuz\nMadman till my casket drop it don't stop\nFuck the haters and the cops\nTell them niggas give you props\nAnd I only got my love for my thugs and bitches\nAnd all I got for enemies is some slugs and stitches\n\n[Chorus]\n\n[Verse 3]\nYou'll get lost in the mix nigga, swallowed in the game\nYou get the flossin' it slippin' it up wildin' wid the pain\nLike Baby Layne, catch you in the mall and stomp ya brain\nCause I want yo chain I'm sick and don't want to change\nMy niggas is followin' the same groove we\nStick to the scripts stick to the Crips\nAll them other fools get dicks to the lips\nSo I share no blunt, my bitch bought Nikes and boxers\nDon't wear no pumps, buy me a Glock and report it stolen\nHoldin' my chips to the roll of the die\nWid the loot like Scrooge Mcduck tuck yo jewels\nOr my crew push up the conversatin' choose to buck\nMomma waitin' for me to rise\nMotivation to my girl be demise\nYou hear me nigga be advised I do whatever it takes\nGet together wid snakes, go to hell and sit forever and bake\nLook in my eyes you can see it if you willin' to try\nTrue indeed no disguise for what I'm feelin' inside\nWho but me?\n\n[Chorus]"}], "artist": "X-Raided"}