{"songs": [{"image": "https://images.genius.com/cd51cff3cc6f39e9b12b0dc232dcd334.500x500x1.jpg", "lyrics": "[Intro: Funeral scene ending in gunfire from the movie Colors]\n[Mac Dre talking:]\nUgh, violence, violence, violence\nNow silence the violence\nHe is here, thug nigga of the year\nFinna put it in your ear\nLoud and clear, hear?\nClear\n\n[Verse 1: Mac Dre]\nWhen I got to the spot it wasn’t even crowded\nMade a few phone calls, now we all 'bout it 'bout it\nWit' it wit' it, hella fitted, punk rock, better quit it\nGot one pill left and she askin' me split it\nI ain’t wit it. Where I’m goin’? Bitch, why?\nHave you ever had XO in your eye?\nBitch, why? Die, choke on sulfa\nMy niggas in the back tryna smoke on sulfa\nFa sho’ gon’ stuff a dub in the ‘wood\nNow it’s me, M.D., PSD, and Shug\nI’m feelin’ good, ugh, got a hoe on jock\nI think she on puss' too, maybe not\nBaby cot, 19, wit her own spot\nA day wit' Dre, I’ll have her on robot\nIt don’t stop, I’m a mack and I’m proud\nI go wild, get hyphy, get loud\n\n[Verse 2: Bad Business]\nBackwoods, phillies, vegas and swishers\nPlus a pint of heem, I’m goin’ bad on your sister\nSuck dick, lick balls, never fuck wit big draws\nKeep my bread in my paws, all my hoes on call\nCutthroatish, sport Enyce and mo ish\nAll purp for my focus\nBad Business be the coldest\nEntertainin’ offa thizz, runnin’ trains wit my niggs\nLike Rydah from the Figs and my cuddie J. Diggs\nSplit wigs when the lips bump, burn when the tips dump\nLeave ‘em wit they lips slumped, caught up in some bitch pumps\nNiggas be hoes too, please let me scold you\nBe careful when they roll through and half of ‘em total\nWe mob\nConversate a bitch and make her bob\nAccept bread off top, touch the man and re-cop, it don’t stop\nMe and my Thizz niggas, we rowdy\nBad Business is bout it\n\n[Verse 3: Mac Dre]\nIt was me, J.D. and Black Jesus\nGoin’ to the store to bring back a juice\nSo we can get to pillin’ and feelin’ it, man\nGiggin’ hella hard and start killin’ it, man\nWe ill in a van, Chevy, 20\nFat backwood, never skinny\nIcon Nikes on my feet\nAnd I come hyphy on my beats\nShe wear cleats ‘cause she’s in the game\nAn all-star legend in the Jaw of Fame\nIf it’s all the same I think I’ll pass\nShe got lotsa ass but, no cash\nAnd I need cash like a car needs gas\nIf you don’t got it, get far, quick fast\nI’m a star with class, big famous\nThizzlamic, speak another language", "year": "2004-10-19", "album": "The Game is Thick Part 2", "title": "Get Loud"}], "artist": "Mac Dre"}