{"songs": [{"image": "https://images.genius.com/37ea9ff66ec03f66721aeba12118643d.300x300x1.jpg", "album": "The Hybrid: Cutting Room Floor  ", "title": "Metal Gear Solid", "lyrics": "[Verse 1]\nThis rap's like Metal Gear Solid, chrome stay polished\nWhite spots like on Rasheed Wallace\nAny nigga think they frolic, this is not a promise\nBust a nigga in the head like Vonage\nI smoke chronic, like a stressed rasta\nYou are not gangsta, you are an impostor\nKick it like Henry, this is not soccer\nSpit it so vivid, Brown songs like opera\nFat lady singing, serenading you\nMask like the phantom, mothafucka, I will stab you\nEver seen a nigga with nothing to lose?\nDesert Eagle cocked and it's aimed at you\nTemper running short, cause his daughter missing meals\nRunning low on options gotta get it with the steel\nNiggas got pills, but we ain't Morpheus\nPosted in the hood, 40 on the porch with us\nNigga what's good? What you don't know?\nGet your free tickets to tonight's murder show\nSo if you want to come through holla at me\nGet your VIP RSVP, nigga, Metal Gear Solid\n\n[Verse 2]\nThis raps like Metal Gear Solid, nigga, I'm Snake\nI detect bitch nigga in your blood trait\nNigga you are dog-bait, show you how a slug taste\nLittle cockroaches get hit with the bug spray\nSorta like Subway, nigga losing weight\nFront his ass to work, now you asking where we stay\nGive his ass the pump like 10 on 8\nNow we leave with pieces like birthday cake\nYou are not straight, nigga, you are gay\nMy hair long like Rappin' 4-Tay\nYour bitch wanna braid it, say she got skills\nBut she's just fishing, want me to fill her gills\nNigga I'mma chill, I ain't really stunting you\nMeat on her grill, just like a barbecue\nBetter call a audible, switch up your plays\nThat shit you running get you Blitz 2K\nI throw bullets right in the flesh\nIf you intercept, you got shot\nHit you with some shit that you ain't coming back from\nBrown tight like six niggas in a Maxima\n40 count I see 'em holding drunk calcium\nCause your bones ain't breaking we cracking 'em\nWhite sheets wrapping 'em\nIt's over it's a wrap for 'em, a rap for 'em", "year": null}], "artist": "Danny Brown"}