{"songs": [{"year": "2015-11-13", "album": "Next Step", "image": "https://images.genius.com/623f415517090669819e4d39e8a4e309.600x600x1.jpg", "title": "How Does This Work?", "lyrics": "[Verse 1]\nThey whack, they just copying Kers\nWith a sloppier verse, I hit the top with earth\nThen I drop you it hurts, fuck you playing for cunt?\nI'll leave you all tied up, laid out in my trunk\nStraight out you a punk pussy bitch with a whack flow\nCouldn't offer ten fuckin' mills for collab no!\nWouldn't do it 'cause your raps make my ears bleed\nYou should call your album Nobody Should Hear Me\nWarn the public what you're giving to them\nI;d rather listen to me take a fuckin' shit in a can\nYou're fuckin' kidding me man, just give up with the rap\nAll my fans call me king and I live up to that\nI get a fuckin' A+ if the rap was a test\nDissing the Kers, well that's an appen offence\nThen you found somewhere tied up to a tree\nAs I hit my fuckin' horn drive off lighten weed\nI'm like\n\n[Hook]\nThey should just quit (they should just quit)\nIt makes me sick (it makes me sick)\nThey on the dick (they on the dick)\nThen try to diss (then try to diss)\nHow does this work? (how does this work?)\nI must be first (I must be first)\nIf you hate Kers (if you hate Kers)\nYou're a fucking nerd (you're a nerd)\n\n[Verse 2]\nDon't really care about no ARIA\nWhen I get up for my speech I'ma laugh at ya\nI swear to god I'ma yell out ABK for life\nAnd if one person boos, man they're losing they life\nI gotta move it all right, I'm fucking chasing a dream\nCame a long way, used to chase for a beam\nDon't you say that I'm mean though, I couldn't give a rat's are\nCunts talk shit, yeah, only when they smash glass\nFucker fiends, they get jealous of Kers\nLook how far a cunt come, I come up from the dirt\nYou run up, you get hurt, you, him, him and her\nI ain't prejudice bitch\nCop a beatin' from Kers! Damn\nFirst slams like a beat in your sub does\nCharging people money if they wanna touch us\nI don't know, did my ego grow man\nBill my doctor for a time at the program\n\n[Hook]\nThey should just quit (they should just quit)\nIt makes me sick (it makes me sick)\nThey on the dick (they on the dick)\nThen try to diss (then try to diss)\nHow does this work? (how does this work?)\nI must be first (I must be first)\nIf you hate Kers (if you hate Kers)\nYou're a fucking nerd (you're a nerd)\n\n[Verse 3]\nOff my guts on a regular basis\nPopping pills cause I look like a face lift has just occured\nNow they think I'm using Botox I said \"it's just the Kers\"\nShe offered me a blow job, what the fuck with the sluts today?\nI'm here, there, atm but she passed away\nHalf way through like \"what the fuck should I do?\"\nLeft her laying there dead as I done up my shoes\nI'm a nice guy right, I don't need your approval\nSent the nudes around on the same day as the funeral\nI'm beautiful, fuck what a cunt think\nI take drugs cause it helps me to unthink\nAbout the fucking future with strays he's strapped\nHe'll shoot ya\nABK 225 that's the crew brah\nGot the whole rap game held in a manoeuvre\n\n[Hook]\nThey should just quit (they should just quit)\nIt makes me sick (it makes me sick)\nThey on the dick (they on the dick)\nThen try to diss (then try to diss)\nHow does this work? (how does this work?)\nI must be first (I must be first)\nIf you hate Kers (if you hate Kers)\nYou're a fucking nerd (you're a nerd)"}], "artist": "Kerser"}