{"artist": "ILL BILL", "songs": [{"title": "Embrace Your Satan", "lyrics": "[Intro]\nWhat? Costumed assassins, in the heart of New York, and no one even notices? Has the city gone mad?\n\n[Verse 1: ILL Bill]\nSorcerer beard, doom metal soundtracks\nThe officer bewared shoot up with they moms at\nEmbrace your Satan\nTake it back to when John Hinckley sprayed up Reagan\n\n[Verse 2: Goretex]\nHey yo my bathtub ghetto work out decompose mucus\nSit bank Hank with ten to twelve in the casket like Frank Lucas\nShank Judas cause yo the Torah be the holy sect\nAll you bags of suppliers jupe a pussy like Richard Speck\n\n[Hook: ILL Bill]\nBlood splattered sunglasses, guns blasted, dust, ashes\nFunerals and young caskets, baby gangsters, dumb bastards\nLive fast run past us\nSmile now cry after assassin’s shoot up what you love with a smile laughing\n\n[Verse 3: Goretex]\nMedina frozen nose like dope from P. King\nGet your neck sawed off with a broken blade like Jay Sebring\nPost-mortem I hit ‘em with ice trays ‘til the body’s frozen\nA thousand sleeves of that raw, I got my lobby open\n\n[Verse 4: ILL Bill]\nThat crazy heady rap angel dust and the hourglass\nThe blowjobs from seventy-two virgins like Taliban\nAction packed acid rap's backs like a savage\nWhen the ratchet clap barrels blast to pierce you like a arrow shaft\n\n[Verse 5: Goretex]\nThe mac is greater\nLaugh when you go down like a sack of potatoes\nShook a steel cage ’82 when he pulled the tazer\nSmile now die later, 700 horse power\n'81 Trans-Am, they makin’ punches for the horse powder\n\n[Hook: ILL Bill]\n\n[Outro]\nNo, no, no, not yet, not yet, don't pass out on me yet!\nYou rotten wanker ! Do we understand each other?\nIf you care what happens to the girl you better answer me, all right? Now listen to me carefully... I..-I've changed my mind, I'm going to let her die! I just wanted you to know that", "image": "https://images.genius.com/228d2ebd2bcc82b1b531ca58db70a36c.600x600x1.jpg", "album": "SEPTAGRAM", "year": "2016-06-10"}]}