{"songs": [{"title": "It’s a Fact", "album": "Undaground Legend", "year": null, "image": "https://images.genius.com/4366a7f059e7e7dfdc95237780f7c435.500x500x1.jpg", "lyrics": "[Lil' Flip]\nUh, take a look in my eyes, tell me what you see\nA nigga who was young, grew up to be a G\nI started off playin basketball for my coach\nHe started hatin so I took a differint approach\nI'ma rap, fuck sweatin, and I'ma do somthin\n(like what) that a nigga won't be regrettin\nCould I ride? (no)\nCould I steal? (no)\nCould I jack? (no)\nShould I kill? (no)\nNah, I gotta get my shit together\nCause a nigga need a house and big furniture with the leather\nI pick up the pen, I pick up the pace\nAnd I used to be broke I couldn't even pick up my face\nAnd now, listen to the shit a nigga be doin\nWhile you nigga's thinkin that a nigga's career be ruined\nFrom smokin, and drinkin\nDrinkin, and smokin\nAnd I'ma try and go platinum while you thinkin and hopin\nWishin and lookin, trying to do what I do\nAnd if ya fuck with me, ill shoot or ill sue\nAnd how you wanna' handle business, I can get it like that\nAnd sellin work on the block, I used to get it like that\nBut I had to back back, and open up my eyes\nWhen you runnin in these streets, you might get a surprise\nYour friend could be a foe, your girl could be a ho\nAnd everybody you think got your back, you don't know\nDoop been here before a nigga got rich\nSo Doop right here when I ridin in my 6\nMy nigga Cease make beats for me everyday\nAnd guess what he don't never ask to get payed\nMy nigga Red keep it real, Hump got my back\nWhen I didn't have a car, Hump bought a Lac\nNow Hump bought a Jag, and I'm in it\nRunnin through these hoes but my name ain't Emitt\nUh\n\n[Chorus: Lil' Flip]\nIt's a fact - everybody smiling ain't your friend\nEverybody with a grin contemplating on you man\nIt's a fact - you reap what you sow, better watch what you do\nCause you'll do it to somebody that'll do it to  you\nIt's a fact - your best friend will turn his back on ya\nPull a gat on ya, even rat on ya\nIt's a fact - that most niggas act like hoes\nIt's a fact - that most niggas act like hoes\n\n[Lil' Flip]\nNow who can you trust, who can you depend on?\nWhen you all broke need money to lend on\nWhen you tryin'a ball and your money been gone\nWhen you tryn'a put the down payment on 10 homes\nWill your nigga ride for you? Will your nigga bust?\nWill a nigga come and get your ass out them cuffs?\nWill your nigga take you to the mall and buy some clothes?\nWill your nigga ever put you first before them hoes?\nWill your nigga buy you drank and smoke up the weed?\nRide for your ass when niggas shootin down your street\nCome to your funeral and tell a fuckin story\nThink about them nuts that we took with no glory\nThat category, the list\nThe rappin the hoes, the hoes and the shows\nIt comes and it goes\nDe Da De Da De Da\n\n[Flip talking]\nStraight up nigga, that's how I feel\nKnow what I'm sayin'?\nEverybody needs to be ballin nigga\nIf you got chain nigga, your nigga need to have a chain\nIf you gotta' cut nigga, your nigga need a cut\nIf you gotta' hundred in your pocket nigga\nYour nigga need at least have fifty, know what I'm sayin?\nNiggas that get in the rap\nForget about them niggas who helped 'em nigga\nKeep it real nigga\nSo that's why I don't wanna fuck with you new niggas man\nI ain't shootin marbles with you niggas\nBut y'all cool\n\n[Lil' Flip]\nIf it ain't Suckafree don't fuck wit me\nCause I know you got your eyes on my luxury\nIf you ain't Suckafree don't fuck with me\nCause I know you got your eyes on my luxury\n\n[Chorus]"}], "artist": "Lil Flip"}