{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/ff349502ffcbfd8f7bdac9fe013f2b15.600x601x1.jpg", "title": "$krillionaire", "year": "2013-01-30", "album": "D.A.I.S.Y. rage", "lyrics": "[Intro]\nI want it bad\nI want it bad\nI want it bad\nI want it\n\n[Verse 1]\nI know you have a mix you wanna spin, and\nI know you wanna prove your dominance\nAnd you want all my Klonopin\nSo, I'll trade you for your confidence\nSo I can uncurl from the little ball I'm in\nI got a problem with incontinence at night\nSo why should I make promises that\nI'll remain anonymous?\nI don't wanna be a party to your pompousness\nI wanna plot a diss, I get a lot of shit that I can grin and bear\nI was undercover for a minute there\nWhy you wanna fuckin' undercut me like I'm Skrillex hair?\nIt's not a date, so you say we split the bill and share\nI hate everyone that wants to be a millionaire\nSo frickin' bad, so frickin' bad\nI wanna be a millionaire, so frickin'...\n\n[Verse 2]\nI'm not that dumb, I just have dumb luck\nAnd I'm just unkempt with my shirt untucked\nAnd maybe you're a pro, and maybe you're the master\nAnd everything I do, you do it cooler and faster\nAnd everything I do, you do it better\nAnd crumble up my effort like it's feta\nAnd talk about the devil 'cause you're so black metal\nYou talk about the devil 'cause you're so black metal\nAnd when I wet the bed, I'll clean it up\nI mean it, I can swear it on my freckles\nI been quiet as a kettle on a cold stove\nAnd I been black n'mild like an old clove\nAnd I been acting childish I know, bro\nI cry all of the time and I'm Eliza in the wild\nAnd I babble to the tigers in the forest\nBlack eyeliner, so I see with eyes of Horus\nIn Florida, I spit on all the visor wearing tourists\nI'm bitter 'cause I do cool shit and you ignore it\nI spit on all the visor wearing tourists\nI'm bitter 'cause I do cool shit and you ignore it\n\n[Hook]\nAnd why am I your dirty little secret?\nI'm all American, but I'm not a reject\nWhy am I your dirty little secret?\nIs it because of all the undies that I peed in?\nAnd I'm your dirty little secret\nI'm all American, but I'm not a reject\nWhy am I your dirty little secret?\nIs it because of all the undies that I peed in?\n\n[Verse 3]\nAnd no, I get it, you don't have to be a braggart\nYour songs are better, and control of your bladder\nAnd you tell me, \"persevere!\", I'll push you under ladders\nAnd I'll see you in seven years, that's bad, huh?\nI'll see you in seven years, sucka please\nYou're makin' fun of all my lyrics and my rubber sheets\nI hope your toast lands where it's buttery\nI hope you stub all of the ruddy toes on your muddy feet\nI hope you do a lot of coke, end up with bloody teeth\nAnd I hope that you admit that you're in love with me\nAnd I hope you do it publicly\n\n[Bridge]\nBut you wanna be a millionaire\nAnd you fuckin' undercut me like I'm Skrillex hair\nWhy do you fuckin' undercut me like I'm Skrillex hair?\nYou keep me undercover and it isn't fair\nWhy you wanna fuckin' undercut me like I'm Skrillex hair?\n\n[Hook]\nI'm all American, but I'm not a reject\nWhy am I your dirty little secret?\nIs it because of all the undies that I peed in?\nAnd I'm your dirty little secret\nI'm all American, but I'm not a reject\nWhy am I your dirty little secret?\nIs it because of all the undies that I peed in?"}]}