{"artist": "Asher Roth", "songs": [{"title": "Hard Times", "image": "https://images.genius.com/833daa9d69c5b162717e60e8e72edc75.600x600x1.jpg", "album": "Pabst & Jazz", "lyrics": "[Hook: Liam and Macie]\nMy mother told me never to tell, a dirty old lie\nMy mother told me never to sell, and just to get by\n\n[Verse 1: Asher Roth]\nIt's been a long damn summer\nAnd I've been working by the furnace, fire burning\nAn inferno with a purpose, feeling like I don't deserve this\nLike I've been cursed, I don't need your sympathy\nAlthough I know you know it hurts - it ain't perfect\nLife's not no nursery rhyme\nIt's as much of a blur as it is our whole lifetime\nAnd that's fine, I'mma ride with it, take my time with it\nNever underestimate the power of the blindness\nYes, your highness. Follow your instincts\nFingerprints ain't always gonna match the logistics\nLittle bit different, it isn't your typical\nWon't always do to others what you wish was reciprocal\nMy brothers and sisters all the way out there in Liverpool\nI feel you a hundred numbers ?\nDon't ever fall in love, cum in somebody's number two\nYou may call it dumb but true\nYou know that we're coming for you: mama said\n\n[Hook: Liam and Macie]\nMy mother told me never to tell, a dirty old lie\nMy mother told me never to sell, and just to get by\n\n[Verse 2: Vic Mensa]\nLord knows I take my secrets to the grave\nTil I'm in a crown, I'm on my own two\nComing straight from a chunk of cave money\nKing Kong crew. (It's going down)\nSwimmin in the river with a stone shoe\nBut I be in that bitch still kicking, I'll teach you kung-fu\nShow and prove, the whole team be on the same page\nNiggas telling me I'm their idol and we the same age\nWhile back, it wasn't nothing in my mind but stayin blazed\nNow picking bitches, calling options like I'm sayin plays\nTake a picture mayne, I'm on some magazine spread shit\nHold the mic tight, I got that rigor mortis dead grip\nGot some good brain on the road, I'd say head trip\nFuck her face and bust on her mouth: call her lead lip\nI'm the baker, I make the bread flip\nNiggas be wildin' but you could talk like it's crackin'\nTo get your eggs split\nShells drop and it's an everyday thing\nIt's a shame, but it's all a part of the game\n\n[Hook: Liam and Macie]\nMy mother told me never to tell, a dirty old lie\nMy mother told me never to sell, and just to get by\n\n[Verse 3: Casie Veggies]\nYoung boss, new dreams\nFresh shoes, new jeans\nTell me what do you see?\nWhy you tryna do me?\nSo I had to find out, now you can't find me\nRemember three years ago? Like \"why you can't sign me?\"\nThoughts in my mind, I can do all that times three\nI grew up not a young'un like \"nevermind me\"\"\nBorn '93, took time to find where my mind be\nNow I tell time with gold time piece\nMy mama told me grind..\n\n[Hook: Liam and Macie]\nMy mother told me never to tell, a dirty old lie\nMy mother told me never to sell, and just to get by", "year": "2011-12-20"}]}