{"artist": "C-Rayz Walz", "songs": [{"title": "Hot Second (Street)", "album": "Pots and Pans", "year": "2001-01-01", "image": "https://images.genius.com/1e7439fd7bc1391b27cdf520e31c1edb.521x521x1.jpg", "lyrics": "C-Rayz Walz - “Hot Second”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): K. Lew]\n[Scratches: DJ A. Vee]\n\n[Intro: C-Rayz Walz]\nBro, that’s why I said, “Bring it back.”  Uh huh.  Taking off.  K. Lew, C-Rayz\n\n[Bridge 1: C-Rayz Walz with Scratches by DJ A. Vee] (x4)\n(One.  Two)\n\n[Hook: C-Rayz Walz with Scratches by DJ A. Vee] (x4)\n(One) Check it.  (Two) A hot second\n\n[Verse 1: C-Rayz Walz]\nMinutes of\nMagnificence, significant instances\nIn an instance, spit sick sentences\nSimpleton.  Similar to sentencing\nYou smell Hell scented in a sensei pen\n[?], senseless men are swiftly sent\nI begin to singe and end ignorance\nTouch your soul—every flow’s intimate\nStarting at a point, extending infinite\nRayz is a mad term.  Bad germs implement\nRaining on street dreams like names stenciled in\nConceal when your vocal wind shows impotence\nRoundhouse-kick flows like graceful elephants\nUse elements as earthly evidence\nDrink the half-empty glass and spite the pessimist\nIt’s imminent.  I’m rare like black peppermint\nNow cast your vote—C-Rayz for president\n\n[Hook: C-Rayz Walz with Scratches by DJ A. Vee] (x4)\n(One) Check it.  (Two) A hot second\n\n[Verse 2: C-Rayz Walz]\nI’ll roll\nWith big wheels like bus tires.  Hot boy\nIn reverse.  I’ll spit bling-bling.  You touch fire\nCold as ice, old as life, new as birth to eat dirt\n‘Cause you bit the tip on my underground hit\nFirst, get a grip, buy a Stronghold T-shirt\nKeep it moving, make your feet work, heel/heal, stupid\nMy ingrown sidelines your bunion.  Stare at\nThe Sun Cycle, the effect of a onion comes\nSo you could cry and crash my career after driving it\nBad feel mad real, angry, authentic steel\nDemented styles bent the trial, wild life\nSentences give birth to fouls.  Crossbreeds\nHit numbers quick like speed dial, jackhammer\nStamina could damage a challenger now.  I’ll move\nWith the permit to hermit.  I’ma get\nThe green or I’ma kidnap Kermit\n\n[Hook: C-Rayz Walz with Scratches by DJ A. Vee] (x4)\n(One) Check it.  (Two) A hot second\n\n[Verse 3: C-Rayz Walz]\nSubliminal interludes injure crews at intervals\nWith interviews, I enter you with mental tools\nSense is used and senseless dues I’m paying\nI want reviews, receipts, and rotations\nRepeated ovations.  Roofs on fire, ice in the basement\nDead ass alive—anus, I’m famous\nDebaters debate this lion mane maintainer\nPain Lane razors make lasers sharp, shave behavior\nAnger aimers.  You hang what?!?  Flavor haters\nDisclaim cuts, then got the guts to ask\nMe when while my blackheads spit sick\nAnd bump in your face like acne skin.  Never\nStanding around unless I’m surfing on a donut\nClever like sheisty squirrels, labels go nut\nFor that gold cut.  So what?!?  They said I look like coal\nWith an old soul destined to go gold like King Tut\n\n[Hook: C-Rayz Walz with Scratches by DJ A. Vee] (x4)\n(One) Check it.  (Two) A hot second\n\n[Verse 4: C-Rayz Walz]\nI get at ‘em, split atoms/Adams, make Eve jealous\nOff the top like broken propellers\nRain hard with Rockefeller like stone stars\nGot the giggles.  Last clash, put my robe on\nScalpel in hand, write sharp lines [?]\nGone, going, going, gone.  Extreme\nNext theme of search: I sip thirst, spit verse\nSplit Earth, get worse, then better\nI’ll rip it, tell the critics my rhyme did it\nLike the K-Solo ritual of the mind, split it\nLike nine undivine, blind riches.  Got the slime\nIn the lime twitching.  I define what\nYou fear like the Blair Witch’s stiches.  I appear\nRichless ‘til your eyesight is dismissed\nThis is train rap, third rail, last car.  I’m holding\nBars.  Who want to spar with Walz?"}]}