{"artist": "Peedi Crakk", "songs": [{"album": null, "title": "See Clearly (feat. Beanie Sigel & Young Gunz)", "image": "https://s3.amazonaws.com/rapgenius/Peedi_Crakk_7.JPG.jpg", "lyrics": "(feat. Beanie Sigel, Young Gunz)\n\n[Hook]\n[Peedi Crakk:] I can see clearly now the rain is gone\n[Beanie Sigel:] All the rain is gone so it's on homie\n[Peedi Crakk:] I can see all the obstacles in my way\nCause it's your boy, PC\nIndeed yes B. Sig\nC and Neef, Young Free\nOschin, Sparky\n\n[Verse 1: Peedi Crakk]\nPhilly, Philly what that rap be bout\nA lot of bitches, squad of niggas coppin coups and houses\nSell dope on streets, you hope you'll never be\nAnd I poke more freaks then you'll probably ever see\nI'm chillin, fuck y'all mad for?\nProbably cause a Hollywood Crip got glass doors\nAnd I'm in denim looking like the boy just stepped out of prison\nAnd split in the Excur\nBut of course the pleasure is yours\nYou should do whatever in a Berreta with a berreta\nFLOSS them princess cuts, who said what\nMy mind on my money, money wassup\nGlock full of those dummies\nI'm not one of your homies I'll hit you the fuck up\nYep, State Prop boys back in town\nThe Back Block Boys, ROC back you down\nLet's go\n\n[Hook]\n\n[Verse 2: Beanie Sigel]\nChoke off tec smoke, nigga get your neck broke\nThrow you in the death yoke, make you do the breast stroke\nThrow a blood river, fucking with these thug niggas\nOfficial street niggas, certified slug givers\nLike I'm fresh out the service, aiming on order\nA half a dollar off your shoulder, make you change into a quater\nBring Crakk 'cross the border, Freeway transporter\nOschino & Sparks, the hitman clap for us\nChris & Neef, the young gunners yes\nThey'll bring it to anyone of your young'ns\nNow what you muthafuckas holla'n bout\nIt ain't shit to park the Benz and squad us out\nGet 'em up and bring my riderz out\nStrap 'em up and send 'em to where you hidin out\nMake 'em snatch what you proud about\nState Prop boys back in town\nBack block boys pop boys back you down\nAnd let's go\n\n[Hook]\n\n[Verse 3: Young Chris (Neef Buck)]\nI can see clearly now, yeah you know I left the wheel on\nI'ma be here when the smoke clears\nI can't be alone (Buck, he got his back)\n(Fuck without our gat) Scrap? (Naw we don't leave it home)\nUndefeated homie (Plus we on a winning streak)\n(Hardest kids in these streets, bring ya shit when you sleep)\nGet hit if you peek, the shit isn't sweet\n(C I got mines) Plus I mine bomb if he creep\n(Hallow points'll flip his Jeep) If he point Chris & Neef\n(Hit him up neck to feet) Lift him up, rest in peace\nState Prop boys back in town\n(It's Young Gunner) Young Neef plus Crakk here now\n(It's our summer) Fool pass that crown\n(Y'all done had y'all run) Hope you lil niggas had your fun\n(We are spit the realist cats, nigga act bend 'em back)\nWho the fuck ain't feeling that, show me I'll spin his cap\n\n[Hook]", "year": null}]}