{"songs": [{"title": "MOB Freestyle", "album": "Free Crack 4", "year": "2017-02-24", "image": "https://images.genius.com/977ce8f2a06fdc6d78002a3fa6ed087e.400x400x1.jpg", "lyrics": "[Intro]\nYeah I'm M.O.B, look\n\n[Verse 1]\nSay they let me in the club, through the back, with the strap\nAll these strippers on my dick because a youngin' got them racks\nHell yeah, I move the pack\nHell yeah, I keep a gat\nHell nah, I won't snitch\nAnd I prolly fucked your bitch\nAnd they know I keep it cool\nBut they know that I switch\nAnd they know I'm M.O.B\nPut my money over chicks\nNiggas got they hands out, so I told 'em \"suck a dick\"\nI can never get extorted, bitch I'm dying for this shit\nIn the field, put my life all in them lines for them shit\nNiggas claimin' that they real, but be lying in this shit\nI be getting to the guap, got no time for a bitch\nIs you fuckin' me or not?\nMy favourite line for a bitch\nMy young nigga savage, my gun automatic\nIf you want the static, it's free, you can have it\nPlease do not get me confused with this rappin'\nDissin' the king and you know what’ll happen\nI came home from trappin', all of my hittas they slow\nAll of my hittas on gold, keep them a rachet\nAnd I ain't talkin about hoes\nPull up and pop at the shows\nLet me find out where you hiding now, then we slide now\nUsed to tote them .38s, its 50 shots .45s now\nUsed to shoot them hoops, we shootin' pistols, niggas die now\nSnub nose, 5 shots it's drums in them 9’s now\n\n[Verse 2]\nSay they wonder how I'm bleeding, disrespect I leave 'em\nPartner hating on me, I say \"Fuck 'em, I don't need 'em\"\nShe wanna fuck on a demon, she wanna swallow my semen\nShe wanna chill with the gang now, she might just let the whole team in\nLeave the bitch feenin', she might just never see me again\nAnd I just gave my lil' brother a bar, he the lord that he free again\nFree the gorillas but keep all the rats\nI love all my killers , I give em the gas\nShe acting boujee, get hit from the back\nNow back to the money, bitch get out the trap\n\n[Bridge]\nM.O.B, yeah I'm M.O.B\nM.O.B., bitch I'm M.O.B\nYeah I'm M.O.B. ayy\nM.O.B., yeah I'm M.O.B. ayy\nLook, I say, yeah I'm M.O.B\nM.O.B., bitch I'm M.O.B\nYeah I'm M.O.B., M.O.B\nYeah I'm M.O.B. ayy\nLook, I say , yeah I'm M.O.B.,\nAyy look\n\n[Verse 3]\nBitch I'm Fendi rocker, Chiraq pistol popper\nBitch I'm with the drama, 100 clip off in that chopper\nWatching for the anacondas\nNo revolver, we not ducking problems\nBitch I'm with the shit, see my opps then we gon' hit\nNever went out like a bitch\nYolo, hop out the whip when I'm dolo\nNo of these niggas want no smoke\nMy hittas loco\nWe get that pipe out of bolo\nPlaying and get hit with the four four\nThat's how we coming, catch me with all of my youngins\nEvery car got like a hunnid, lil' niggas gunnin'\nYou wanna get into sum, like Andre, my little niggas drummin'\n\n[Outro]\nAyy, ayy, ayy, ayy, look\nAnd they know I'm M.O.B\nAyy, ayy I said they know I'm M.O.B. ayy"}], "artist": "Lil Bibby"}