{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/ed85a63966c033c4dbbd47db8df264e3.1000x1000x1.jpg", "year": "2018-09-07", "album": "YBN: The Mixtape", "lyrics": "[Intro]\nEee-oooh!\nOoh-ooh-ooh!\nUh uh\nDaytrip took it to 10, hey!\n\n[Chorus]\nUh, I was cruising in a 6-4 with all of my hoes\nTwo niggas with a pistol that's ready to go\nNew bitch named Crystal, steady to blow\nMy team way too official, with Chevys and Rolls\n\n[Verse]\nSeen the red and blue lights, and I got pulled over\nRedneck-ass cop asked me was I sober\nI said, \"Hell nah nigga, stupid question to ask\nI got a half pound of weed in the messenger bag\"\nBut I couldn’t tell ‘em that, I was wantin' to laugh\nThat's the number one rule, don’t be flauntin' your pack\nAnd stop asking all these questions, now I'm tauntin' yo ass\nAnd, if you want to search my car, you need a warrant for that\nAs soon as I said that stupid shit, my gun had slipped into his grip\nMy nigga, I plead the fifth, not needing this, man, I gotta dip\nHe said \"what in tarnation,\" hit the gas, I'm car racing\nPlus I'm high in the sky, gas got me stargazin'\nSo here's a little advice, mix sugar n’ spice, and you can get nice\nFree my nigga T-Mac, that shit is so whack, they tryna indict\nI just paid off all my debt, I'm gettin' them checks, it's changin' my life\nI need a little respect, just copped a Patek, just look at my ice\nSo he ran up, \"put yo hands up\", you in handcuffs\nYou done lost your motherfuckin' head like you got dandruff\nWoman lie, a nigga lie, fuck the cell, that shit is dry\n\"Why you pull me over doing 60 in a 55?\"\nAll y'all was suspects, you knew that holmes\nFive niggas in the car, and y'all got durags on\nPlus y'all bumpin' all the really loud new rap songs\nThat's three fuckin' strikes, I wanna go back home\nHow the fuck my strap slip, I be grounded and tight\nHe said, \"boys it look like y'all at the County tonight\nAnd the canines comin', you can stop with the jokes\nAnd while y'all in there tonight, don't be droppin' the soap\"\n\n[Bridge]\nI know that you hate me, I know that you jealous\nI know that you crazy, hiding behind an umbrella\nMan I know I'm a target, shit I know I’m a threat\nAnd I know y'all tryna stop me, 'cause you know I'm up next, nigga\n\n[Chorus]\nI was cruising in a 6-4 with all of my hoes\nTwo niggas with a pistol that’s ready to go\nNew bitch named Crystal, steady to blow\nMy team way too official, with Chevys and Rolls\n\n[Outro]\nDaytrip took it to ten, hey!", "title": "Target"}]}