{"artist": "A$AP Rocky", "songs": [{"title": "Black Tux, White Collar", "image": "https://images.genius.com/0635bd3f246cb6af9c8aa48a06263c39.1000x1000x1.jpg", "album": "TESTING", "lyrics": "[Intro: A$AP Rocky & Playboi Carti]\nKnow what I'm sayin'\nGot jealous of a nigga or something tryna...\nCheck it, whole lot of jewelry, my time nigga\nTryna surpass me, real shit\nDon't do all that talking nigga\nClams Casino, nigga, A$AP\nA$AP nigga, fuck you talkin' 'bout?\nMeet me at the finish line you dig\nPew\n\n[Verse 1: A$AP Rocky & Playboi Carti]\nI say motherfuck you niggas for the hate that you investin' (Yeah)\nFuck police 'cause he probably wanna arrest me (Check it out)\nFuck the prison system, this injustice wasn't justified (Slatt)\nAll black tuxes, get the white collars jealous like\nAll my role models either dead or in the pen'\nI had no choice to be the nigga that I am\nStuck with bros, stuck the code (Yeah)\n'Cede emblem on the fender (Yeah)\nCouple fans in the hood I got no choice but to vent\nGoing in front to back, at events, fuckin' packed\nWith the hits back to back, Where the gas, roll the Back\nGold on gold, platinum plaques (Uh)\nOn the road after that (Yeah)\nShe on a pole on a roll, make it clap, bring it back (Hold up)\nReal bitches where you at? Real niggas where you at?\nMakin' niggas send a couple, real niggas where you at though?\nHow could I not be negative when I don't trust my relatives?\nNiggas want settlements and bitches want like seven kids\n\n[Chorus: A$AP Rocky & Playboi Carti]\nFuck fake people, I'ma go ahead and address it (Fuck 'em)\nFuck you too just because you never said it (Yeah)\nGod hate evil, you just blowin' all your blessings\nBlack tux, white collar formal on the wedding (Yeah)\n\n[Verse 2: A$AP Rocky & Playboi Carti]\nTime to divorce (Time to divorce)\nLine up the courts (Line up the courts)\nTuxedo, don't try to support them\nDon try to support them\nWhen it start to go off\nCome fuck with your boy (Yeah)\n\n[Bridge: A$AP Rocky]\nI'ma shine through it all\nShine and all\nTakeoff, lightyear\nShootin' star\nShine and all, shine and\nAll\n\n[Verse 3: A$AP Rocky & Playboi Carti]\nTo the cathedral, tux like I'm married (Tux on like I'm married)\nDon't got a ring on but it feel like I'm married (Ring on my finger)\nTo the cathedral, tux like I'm married (Like I'm married)\nKnow when that ring involved, know that it married (Yeah)\nFuck views and opinions\nI'm willin' to die, seemin' to shake off the image\nBut when I'm inside, pretendin' to smile\nI feel the same high from the vengeance\nI mean, I know we're both grown, like who are we kiddin'?\nGoodbye to the correct way\nThe picket fences, kids in the kitchen\n'Cause in this world, I feel lost\nI'm feelin' trapped in my thoughts (Yeah)\nI don't know who to trust, just got my word and my balls (Yeah, yeah)\nThis is hell in a hole\nI know this the life that we chose\nBut lovin' the life that we livin'\nWe'll make it in the beginnin'\nSave me the tux\nSave me the tux for the endin'\nEndin'", "year": "2018-05-25"}]}