{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/ce70d8117c83ff4322bbd7d5d9b122da.468x468x1.jpg", "title": "Say", "year": "2013-01-23", "album": null, "lyrics": "\"Say Hello\"\n\n[Verse:]\nUh, I'm feeling so throwed. I den had this drink since I was 15\n& now I'm finally getting on. Told you bout this shit when I was 18\n& fuck it, I'm the new nigga. Don't give a fuck bout how these niggas rate\nMe\nYa girlfriend wanna cruise with us. But I'ma need a badder bitch to date me\nUh, I got this money in my pocket. I won't throw it 'less she dropping\nKnow what? Fuck it, bitch go shopping\nSee I always keep it cocky, cause these niggas wanna doubt me\nTalking numbers like a auction. Fuck yo Porsche and yo bugatti that you\nAlways talk about, but Ion never see you driving cause you know that\nNigga's hungry and you looking at a lion. I'm the fucking last king eating\nDinner with the mayans. Yeah you riding for yo city, but I'm driving. BITCH!\n\n[Chorus:]\nAll I care about is money, give a fuck about the hoes. Broke or rich, I'm on my Shit\nGotta let these motherfuckas know\nPut my H up in the sky and for Screw I drop a 4. My city calling for me but I'm gone\nSay hello say hello, gotta do what I do let me go. [x4]\nSay none of yall niggas can do it like me. Puffing that purp, fucking up\nPink, and ion give a fuck about tint and shit. Only 1 deep, gotta pimp my\nShit\nSay hello say hello gotta do what I do let me go. [x2]\n\n[Verse:]\nI take a look around the club, I den fucked everybody\nMan I'ma need some newer bitches with some newer bodies\nThe type-a bitch that don't know shit and she don't know nobody\nSo I can mold like a vent, yep polarize it\nI know some niggas I was with that went and told somebody\nAbout some shit he said he never would've told nobody. Damn\nNow I prolly got you shook. See we kick it all the time and I ain't never\nBrought it up. Hmm. Shit, gotta keep the shit G. Cause the niggas playing\nCool be the niggas with the heat. Yeah them niggas still in school prolly\nKnock you off ya feet. Talk is cheap. Paying dues, no receipt. I got bad\nBitches waiting, boys intimidated. & I still can't believe I got signed to a\nLabel. I guess I gotta do it while it's all in my favor, and next year I'll\nBe on vacation. BANGZ!\n\n[Chorus:]\nAll I care about is money, give a fuck about the hoes. Broke or rich, I'm on my Shit\nGotta let these motherfuckas know\nPut the H up in the sky and for Screw I drop a 4. My city calling for me but I'm gone\nSay hello say hello, gotta do what I do let me go. [x4]\nSay none of yall niggas can do it like me. Puffing that purp, fucking up\nPink, and ion give a fuck about tint and shit. Only 1 deep, gotta pimp my\nShit\nSay hello say hello gotta do what I do let me go. [x2]\n\n\n\n\nThanks to Macie for adding these lyrics\nBy Akram Adde near west balm beach FL"}]}