{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/26d65093c145e92972f6e95f41326a21.300x300x1.jpg", "title": "The Juggarnaut", "year": "2006-11-21", "album": "I Pledge Allegiance to the Grind", "lyrics": "[Intro: Killer Mike talking]\nI don't care how many fucking records you sell nigga, you know I'm better than you\n\n[Sample from the motion picture X-Men 3]\n\"Don't you know who I am? I the Juggernaut bitch!\"\n\n[Verse One]\nBig ass rims\nFresh ass Timbs\nCame back on your monkey ass like biiim\nHit 'em like biiim, biim, biiim\nLookin' for a sucker, fucker, I am not him\nLookin' for a sucker squad we are not them\nGrind Time Rap Game, bang bang bang\nLeader of the gang, grip grain, switch lanes\nBlow chains out the top of the blow out brain\nTampa Bay orange Tropicana with some phantom flames\nBlowin' purple stank, my Cadillac is so loud it bangs\nHell yeah I know you heard when you standin' on the curb\nKing Kong beatin' monkey's like wadda dadda dang\n\n[Hook]\nKiller got the hood on smash\nSchools on smash\nNo matter how you hate you can't whoop my ass\nThe cars will go fast\nVroom Vroom mash\nBig 24's runnin' over your ass\n\"I'm the Juggernaut bitch!\"\nAny motherfucker that really want it can get it\nI'm the nigga not to be fucked with, fucked with\nI'm a motherfuckin' menace\nI'm a villain with a mission\nI'm the piece of shit you're stuck with\n\"I'm the Juggernaut bitch!\"\n\n[Verse Two]\nThe era of the bullshit is over\nLyrically, I will dismember and disfigure he\nWho figure he ever near to me or even dear to me\nLyrically, I will abolish he\nStunningly, similar to crucifixion, what I do to suckers on the daily\nWith the deaf, dumb I kick shit\nEven drop science in my fiction\nJust in case Agent Smith listenin'\nWho say the south ain't rappin', sucka nigga is you listenin'?\nI am out of patience anyway\nI am Doc Holliday\nI'm your Huckleberry, fuckin' fairy, you can die today\nShow up at the O.K. with an AK like okay\nKill your ass and beat the case like Snoop Dogg and OJ\n\n[Hook]\n\n[Verse Three]\nEvery line of every rhyme is a symbol to the struggle\nExpress through the grind\nThat we testify to by buying outlandish shine\nReason being that my wrist akin to a pamper full of piss\nDiaper off and I'm shittin' on tracks like this\nSucka nigga play Ray you can't see Mike bitch\nAny rapper get's spazzed on like I'm a kid with Tourettes\nSyndrome from a bad home\nMy lyrics mean like a girl from the hood, PMSing with a pad on\nHell yeah I'm that bad holmes\nYou disagree? Even humbly, promise you get mashed on\nPummeled and beat to snot, compliments of the Juggernaut\n\n[Hook]"}]}