{"artist": "WC", "songs": [{"year": "1998-04-28", "lyrics": "[Intro: DJ Crazy Toones]\nPlay that beat nigga, play the beat nigga\nPlay that beat nigga\nThis year, is shady as weird, for the niggas here\nThrough that nearest ear, for the near year\n\n[W.C. & DJ Crazy Toones]\nWhat's cracking nigga?\nGet up the deal nigga\nWhat's cracking nigga?\nI just peed on that year, nigga\nWhat's cracking nigga?\nI just peed on that year, nigga\nAnother album\nWe'll see you, nigga\nAnother album, nigga\nWe'll see you, nigga\nThe last one, nigga ever\nAyy, The Shadiest One\nThe last one, nigga\nThe Shadiest One\nThis is the last one, nigga\nThe shadiest year\nWe don't steal, nigga\nThe shadiest year, nigga\nWhat's cracking\nI wanna say what's happening to all my niggas out there who was down from day one\nAll the haters out there (fuck y'all)\nAll the haters out there (what's up?)\nI wanna thank all the haters out there (what's up nigga?)\nFor nothing nigga, for nothing nigga, nothing nigga\nNothing, y'all do shit\nNot a motherfucking thing for me, but it's aight though nigga\nI wanna say what's cracking to the whole Westside Connect Gang (what's up nigga?)\nConnect Gang OGs (WSCG) Oh yeah, checking the cheese\nThey don't steal, that's right nigga\nAll my good red bitches out there, 5-10, 5-10 2-20 was close on their thighs\nRolling on buckets like fuck it, you know\nThat's right, they buy records too\nThat's right, all the pretty bitches out there\nToo pretty in motherfucking suck dick, eat a dick bitch\nFor all the sucking nuts, all in them guts, it's going down\nDub-C nigga, UHH, Dub-C nigga, Dub-C nigga, Yeah\nAll you niggas out there that's like fuck that nigga right now\nThat's right, fuck you too nigga, yeah\nAll my worldwide niggas, all my real niggas worldwide, worldwide niggas\nI don't give a fuck what you from, nigga\nI don't give a fuck where you from, nigga\nAll my real niggas worldwide\nAll I ever wanted to do is make music for my street niggas\nFor my street niggas, fuck the bitch niggas\nStrictly my worldwide niggas\nThis is for y'all, Dub-C, yours truly nigga\nThe Shadiest One\n\n[Outro: DJ Crazy Toones]\nThis beat bumping, that shit is bumping, loc\nChickie chickie ladies and gentlemen, let it ride", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "The Outcome"}]}