{"artist": "C-Rayz Walz", "songs": [{"title": "R’Thentic (Clean)", "album": "R’Thentic / Street Reppin’", "year": "2005-04-19", "image": "https://images.genius.com/90eab1252b8d87c7c21aa2ae83f29a50.500x500x1.jpg", "lyrics": "C-Rayz Walz - \"R'Thentic”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): R'Thentic]\n\n[Intro: C-Rayz Walz]\nCheap sex, drugs, and rock 'n’ roll\nCheap sex, drugs, and rock 'n’ roll\n\n[Verse 1: C-Rayz Walz]\nHigh definition of speed warp vision.  My de-\n-grees open doors with keys and get locked up\nWide-angle spectrum of dangerous scenes, bank\nShots—watch robbers and cops scheme\nStand by the freezer, you're gone.  Yung Havoks in\nStorm graduate to a grave—they’re even clapping your\nDorm.  Look at your hand plan, holding your cell while you\nIn a holding cell for direct sales, hand to hand\n\n[Bridge 1: C-Rayz Walz]\nThe boys in blue are back (Where you at?)\nThe boys in blue are back (Now react)\nThe boys in blue, the boys in blue\nThe boys in blue are back.  And that's not\nR’Thentic.  I know why I gotta stop for search\nThat ain't work.  It’s my “Blackout” verse, and I'm\nTargeted (Ayyo, what’d you say)\n(Buddy?) Never mind, man, forget/'fore I get it\n\n[Verse 2: C-Rayz Walz]\nFrom\nKings to pawns, plantation to White House\nLawn, drug charges come with the firearm.  Be\nWarned, y'all, to the fullest.  The translation\nOf what I'm saying without assing Willis.  What ha-\n-ppened to scrapping?  Life became business\nSnitches get stitches in front Jehovah Witness\nFlux parallax, paradigm shift, pro-\n-cessed piff, patience, project bliss\nThat's not R'Thentic like paying for water\nWhy impart limits?  I embark endless order\nEbony skills, son of electricity spill\nThe heavenly melody movement, the legacy's real\nRappers killing rappers, it's a wrap for fans.  Ball\nPlayers jumping cats in the stands\n\n[Bridge 2: C-Rayz Walz]\nAnd that ain't\nR'Thentic speech like arsenic leech.  To\nTeach my son strictly art in his own inner\nChi.  Pause the speech of sharp lyrics 'til my art\nFinishes the art in us and the R’Thentic\n\n[Verse 3: C-Rayz Walz]\nYo, this is for\nR’Thentic!  I’ll talk like arsenic\nFifty-eight shots go off with a arc in it\nFrom the pistol, making a mark in it.  That's\nA starter jacket.  Here where the start finish.  When they\nStart that racket, that's when the arts blemish, and it's\nNot spinach and it's not women.  They got\nGreen upstate (Upstate).  The D's on\nThe corner, but wait.  Ain't no green on the plate (Why?)\nMoms don't cook no more.  She just dropped the baby\nOff at the door, then took off on a White Horse\nGalaxy twist, unicorn bliss\nGetting appointments, missing appointments\nHitting a joint quick, sss-spit conversa-\n-tions bluntly.  Conversion bubbling money and hungry\nBlock parties, fish, gin, and slick sinners.  Star-\n-ving kids dig up your nose and pick winners\nSo R'Thentic, gross flows like arsenic\nPPK platinum summers—stay on your pivot\nAnd if you ain't “Spitamat,” get a gat\nBefore the bitter facts react, you go pitter pat\n\n[Bridge 3: C-Rayz Walz]\nMove up in life and the music, man, and you\nForget how to move with fams.  That ain't R'-\n-Thentic speech like dark limits breeching the dark-\n-ness, jeep beats, and smart critics.  That ain't R’-\n-Thentic speech like arsenic leech.  In the dark\nThin the speech ‘til the art like, energize, and mimic me\n\n[Verse 4: C-Rayz Walz]\nNowhere to hide.  If you old, you go\nKarma knows what's God-given is death.  That's so\nR’Thentic.  That ain't R'Thentic streets.  Live\nR'Thentic heat, keep each beat peace.  Lounge\nFor a minute and breathe.  Miniature minds meet\nThe image trying to find me.  Move back\nThat ain't R'Thentically street (R’Thentic!  R’Thentic!)"}]}