{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/13e8c687e539572b0d79f0fc8cf1018e.1000x1000x1.jpg", "title": "Take ’Em to War", "year": "1995-09-26", "album": "4, 5, 6", "lyrics": "[Hook]\nShit ain't never gonna change (Fuck it!!!)\nTime to load the clips (Then we take 'em to war!!!)\nNiggas wanna flip (Then we take 'em to war!!!)\nBreak a nigga proper (Then we break him some more!!!)\n\n[MF Grimm]\nI represent the murderers and felony offenders\nWho even bought time out to get these legal tenders\n(Surrender) Nah, I'm goin out with a bang nigga\nFuck Pataki I gotta do my thang nigga\nForty-four mag, bustin into action\nBrains left in particles, fragments and fractions\nGrimm, the money stacker, heat packer\nI'm lurkin, I'm waitin, attackin' like a linebacker\nFuck what you heard, crime pays\nAnd always, unorthodox, I hold my pistol sideways\nWe kill crews, hearts go numb\nAnd if retaliation comes then yo fuck it, it just comes\n(Yo who you?) I'm Dr. Death motherfucker ever heard of me?\nClose your eyes, cross your fingers, time for surgery\nI'm already dead, so nah, you can't murder me\nCause quantities of entities enter me evilly\n\n[Hook]\n\n[B1]\nSince I murder for hire, rapid fire's what I require\nMakin niggas perspire, so send a message through the wire\nCause violence is contagious, it got me bustin gauges\nThe '95 Larry Davis and I'm wettin niggas for wages\nQueens is the home of 1, the known felon\nAnd ain't no tellin, when I'mma crack your fuckin melon\nFor the right amount of chips, I spit clips and hit whips\nLeavin niggas bloody, the leather seats is where the shit drips\nWith the pound-seven, I be creepin, rockin niggas while they sleepin\nShots repeatin, leavin faggot niggas leakin\nWhen I cock back the iron, niggas is dyin, marchin to Zion\nCause the pound-cake, roars like a lion\nWord son, niggas be collapsin, cause my weapons is\nReady for action, makin your heart catch contractions\nIn the underworld, shootin gallery niggas lose calories\nCause my salary's based on fatalities\n\n[Hook]\n\n[Kool G. Rap]\nHere I come to get some motherfuckin wreck but first I gotta\nUmm vest check, gun check, clip one check, clip two check, I'm set\nSo let a motherfucker move a muscle\nWhen I tussle they'll be piecin niggas back like fuckin puzzles\nCause Kool G. Rap is known for bringin mad noise, I'm bad boy\nWhen I was younger always carried guns, I never had toys\nGrimm, gimme the infrared and semi and I'm puttin red dots\nOn niggas foreheads and makin motherfuckers Indian\nYou got beef? Go get yourself a wreath, because it's murder\nCause I put holes in my beef like fuckin White Castle burgers\nSo now I gots to run up on a clown with the fo'-pound\nCock back, rock black, gun a nigga down\nI see em, he's comin out the fuckin colosseum\nAnd hopped into a BM, shit!\nPut in my clip and then I dipped into the ride that my man had\nParked on the sidewalk, then we start to glide\nI'm rainin on him (faster nigga) oh yeah we're gainin on him\n(Oh shit he's with somebody else) fuck it, put his brain on him\nBoom boom, no survivors, lifted the nigga out his seat\nWhen they find him, he'll be a backseat driver\nBut I ain't finished with the trigger yet, I'm lightin up a cigarette\nBang Bang!!! I left the other nigga wet\nIt's G. Rap baby, you know me, you try to hurt this\nI split your fuckin top and leave a fingerprint on purpose!\n\n[Production by T-Ray]"}]}