{"artist": "Z-Ro", "songs": [{"album": "Sadism", "title": "Always", "lyrics": "[Spoken Word Intro: Z-Ro]\nThat boy Al-D just came and told me\n\"Ayy, you S.U.C. now,\" what is that?\nI didn't know what the fuck that shit was, know what I'm sayin'?\nThat boy like \"You Screw Up Click now, shit how you feelin'?\"\nKnow what I'm sayin'?\nThat boy took me over to Screw, asked Screw \"Ayy what's up?\"\n\n[Pre-Recorded Audio: DJ Screw]\nYa know what I'm sayin'? I told him I liked the way he flow and shit. We was kickin' it a lot. He said he had love for music and had love for music. We rushed him down, we just hooked up and just done the shit, ya know what I'm sayin'\n\n[Chorus]\nI don't mind real niggas, I would come back for you\nAnd I don't mind real bitches, I would come back for you\nI always come back for you\nI always come back for you\n\n[Verse 1]\nUh, no matter wherever I go I always be right here\nHouston, TX where DJ Screw be bangin' in my ear (Know what I'm sayin')\nStyrofoam inside of styrofoam, it's not beer\nThey leanin' so hard they try to say what up but it's not clear\nSome of my niggas say \"haw,\" some of my niggas say \"tahn 'bout\"\nIf they say my niggas ain't shit, they don't know what they tahn 'bout\nNever will I say I got some shit I really don't got\nI watch what I say 'cause I know y'all recordin' me when you pull your phone out (I heard what you said Ro)\nPimp-C told ya this ain't the South, homie this the Souf (Yeah)\nSouth Side is Screwed Up Click and North Side is the Swisha House (Yes)\nBad bitch with me but I would never kiss her in the mouth (Yeah)\nNot just in public either, that shit go for in the house\nI'm ridin' Cadillac today, I let the top down\nHit the Galleria with a bag, bitches shop Uptown\nI'm not shopping for me, I already got everything\nThis shit for my people, we gon' ball, we havin' everything\n\n[Chorus]\nI don't mind real niggas, I would come back for you\nAnd I don't mind real bitches, I would come back for you\nI always come back for you\nI always come back for you\n\n[Verse 2]\nHey man, I stopped drankin' with haters in 2009\nWas a sucka for that codeine at least 1000 times\nI don't drink that shit no mo, they don't come around me now (Me now)\nFor 20 years I was so lost, I'm finally glad I found me now (Ha-ha)\nI used to rap with some niggas but now I don't though (Yeah)\nWherever they be chillin', that's where I don't go (Yeah)\nHomies say they real, but when I look at them it don't show\nThey say what they gon' do when they see me, but when I see they ass they don't though (Here I go)\nKing Johnny my partner first, TV Johnny my partner now\nIt they came together, they shouldn't be seent, go call the doctor now (Now)\nMe and Slim Thug and Tilman Fertitta helicoptor helicoptor house (We in the air)\n'Til we squash that plex and we got that check, didn't come here to fight, I come to collect\nNiggas be trippin' with me and these bitches be trippin' with me, better respect\n'Cause if I show 'em any type of attention I hope they abreast 'cause it's gon' be they bet\nI see you in my rearview homie, I wish you would\nYou gon' make me kill you homie (Slim Thug)\n\n[Chorus]\nI told y'all fuck niggas I would come back for you\nAnd I told y'all fuck bitches I would come back for you\nI always come back for you\nI always come back for you", "year": "2018-11-16", "image": "https://images.genius.com/2cce230c16c8a42c1f80ef21c26b55ab.1000x1000x1.png"}]}