{"songs": [{"lyrics": "[Produced by J-Roc, The Dream & Timbaland]\n\n[Chorus: Justin Timberlake]\nHave you ever been to heaven?\nHave you ever seen the gates?\nHave you bowed unto your highness?\nAnd do you know how heaven taste? Knock me down\n\n[Verse 1: Jay-Z]\nArm, leg, leg, arm, head – this is God body\nKnowledge, wisdom, freedom, understanding, we just want our equality\nFood, clothing, shelter, help a nigga find some peace\nHappiness for a gangsta, ain't no love in these streets\nConspiracy theorist screaming Illuminati\nThey can't believe this much skill is in the human body\nHe's 6'2\", how the fuck he fit in a new Bugatti?\nAw, fuck it, you got me\nQuestion religion, question it all\nQuestion existence until them questions are solved\nMeanwhile this heretic, I be out in Marrakesh\nMorocco smoking hashish with my fellowship\nY'all dwell on devil shit, I'm in a Diablo\nYellow shit, color of Jell-O shit\nHello bitch, it's me again\nFresh in my Easter clothes feeling like Jesus and\n\n[Chorus: Justin Timberlake]\nHave you ever been to heaven?\nHave you ever seen the gates?\nHave you bowed unto your highness?\nAnd do you know how heaven taste? Knock me down\n\n[Bridge: Jay-Z]\nThat's me in the corner, that's me in the spotlight\nLosing my religion, losing my religion\n\n[Verse 2: Jay-Z]\nGetting ghost in the Ghost, can you see me? Can you see me?\nHave mercy on a Judas, angel wings on a 'ghini\nI'm secular, tell the hecklers seckle down\nY'all religion creates division like my Maybach partition\nAnd God is my chauffeur, boy they love Hova\nFrom the south side of Chi to Brooklyn where I growed up\nI confess, God in the flesh\nLive among the serpents, turn arenas into churches\nI'm like Michael, recycle, these are not 16's\nThese are verses from the Bible\nTell that preacher he's a preacher, I'm a motherfuckin' prophet\nSmoke a tree of knowledge, drink from a gold chalice\nYou gotta love it, I arrive at the pearly gates\nI had luggage, meaning I had baggage\nNiggas asking me questions, I don't answer to these busters\nOnly God could judge us, motherfuckers, uh\n\n[Chorus: Justin Timberlake]\nHave you ever been to heaven?\nHave you ever seen the gates?\nHave you bowed unto your highness?\nAnd do you know how heaven taste? Knock me down\n\n[Outro: Justin Timberlake]\nHeaven or Hell, the cards we been dealt\nAre the cards that we play, play, play\nDie for what you believe, only one god recedes\nWhen the shots spray, spray, spray", "title": "Heaven", "image": "https://s3.amazonaws.com/rapgenius/MCHG_cover.jpg", "year": "2013-07-04", "album": "Magna Carta... Holy Grail"}], "artist": "JAY-Z"}