{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Party to the Break-A-Day", "album": "Weekend Warrior", "lyrics": "[Biz Markie]\nAhhhhhhhhhhhhhhh!\nOne-two, doin the do\nThis goes out to my man Truck, my man Jerome\nBilal and the whole Long Island crew\nAnd it goes like this\n\nHey how ya doin it's me\nThe incredible unforgettable B\nIzzah give me Rrah K-I, with the E\nI got mo' rhymes than Muhammad Ali\nHey!  The way I get down you will say\n\"Damn that nigga Biz always makes my day\"\nMy style is untangeable when you hear\nCause the brother on the mic is most debonnaire\nOn the, DJ tip I'm like savoir-faire\nCause you can probably find me anywhere\nI'm the best from West, I'm the beast from the East\nI'm the OLLLLLD SCHOOL, like a permanent crease\nLike, Scooby Doo or a Chucky doll\nYou better grab a seat because you're gonna be here for a while\nSo for all you new schoolers, relax and chill\nAs the Diabolical tell you the deal\n\n[Chorus 2X - scratched]\n\"They know I par-tay to the break of day\"\n\"They know I par-tay to the break of day\"\n\"They know I par-tay to the break of day\"\n\"They know I par-tay to the break of day\"\n\n[Biz Markie]\n\"I got so much on my mind\" like my name was Chuck D\nThat when it comes to DJ'n, I'm a Public Enemy\nI rocked all colors, races and ages\nWhen you see the crowd go crazy you will say I'm outrageous\nI rocked Sinbad, Cancun, Essence and the Grammy's\nMagic Johnson parties at Superbowl in Miami\nFirst Friday, Philly, Dallas and St. Lou'\nMy {?}, Alex and Kenny Johnson know what I can do\nChicago with {?}, Detroit with D. Archer\nNew York with Gator, Lenny Smith and Lenny the Barber\nI do all the hot joints like Eddie Murphy and will flip it\nStill get down and dirty in Newark and Elizabeth\nKeenan and {?} brothers, Pat in Orlando\nKeyshaun Walker and Di-ane, {?} yo\nI rock weddings from Toni Braxton, to Boyz II Men Shawn\nAnd this is what they say, word is bond\n\n[Chorus]\n\n[Biz Markie]\nLet me tell you how I started in ninety-two\nWhen I was DJ'n from Jersey to Howard U\nI did homecomings from U-V-A to James Madison\nAnd did The Tunnel, Reflect, or Kordell and Patterson\nNow I graduated with DJ love\nFrom rockin from Virginia and seein the Q Club\nPeople looked at me and said \"Why you DJ'n?\"\n\"I loved +Oh Baby You..+ and you're a rock singer\"\nSo the transition from rappin to DJ wasn't smooth\nBut I still pursued cause I had somethin to prove\nJuly 4th and Labor Day in Virginia was hot\nCause Biggie Smalls and Teddy Riley was in the spot\nFrom {?} to Jones Street to Philly Greek Picnic\nFlorida and Bayou Classic and Atlanta Freaknik\nAll the girls, in G-strings and thongs\nIf you would, please just sing along\n\n[Chorus]"}], "artist": "Biz Markie"}