{"artist": "E-40", "songs": [{"title": "Anybody Can Get It", "image": "https://images.genius.com/9d41d32f84928b29b6b562293ae40bf7.779x768x1.jpg", "album": "Breakin News", "year": "2003-07-01", "lyrics": "[E-40]\nWhen a motherfucker walk up in the club, I mean I mean\nAnd a nigga be 70 deep\nBut if a nigga let his motherfuckin scrotum hang over his shoulder\nAnd come up and do a WALK-BY on your bitch-ass\nIt's nay-thun\nDon't give a fuck about how much money you got nigga\nIt's about how you outsmart the next nigga\n\n[Hook: Lil Jon]\nBitch, nigga, what the fuck's up!\n(Anybody can get it!)\nHo, niggas, go pull your skirts up\nDon't think that you won't get touched, BITCH!\nI'm in your grill now, nigga what you gon' do?\nI'm in your grill now, bitch what you gon' do?\nI'm in your grill now, nigga what you gon' do?\nDon't think that you won't get touched, BITCH!\n\n[Bone Crusher]\nHoes, hoes, money, roll\nMr. Whup-Ass done stepped in the do'\n(BONE CRUSHER!) Bring the pain, to your skull\nY'all niggas don't want a fight, all y'all want is a hug\nYour bark is worse than your bite, with your mean mug\nLet's take it to the grass and we'll see what's up\nY'all knows about me, Mr. Streetsweep\nTwinkie soft niggas get dealt with swift-ily\nI'm amazin; I always bring the heat\nPull the cake up through the ground if he fuckin with me\nMe and E-Fonzarelli, new Starsky & Hutch\nMotherfucker don't act like you can't get touched\nGrindin niggas bows up and we turn 'em to dust\nAs the crowd go ah-OOOOH-AHH cause you know you fucked up\nThey don't wanna see me, nicknamed the realest\nDon't believe me, ask them Adamsvillers\nThis A-T-L nigga!\n\n[Hook]\n\n[E-40]\nI sit at the bar and tear up hundred dollar bills\nMy car, my Hummer got 26 inch rims\nI'm a star on my side of the earth, I bleed the block\nPromethazine, codeine, water and hubba rock\nMillion dollar dreams and fiends and things of that nature\nTriple beams and things and T-Mobile paint ya\nTold myself - I need to stop pushin hop\nI need to stop pushin hop so I can buy a WingStop\nMy young hyenas be bustin guns, mashin and pistol packin\nSmokin so much 'dro that our lungs feel like they collapsin\nTrick I see you and yo' partners laughin\nJaw-jackin and scammin and plottin\nOld soft-ass, medicated, cotton-ass nigga\nYou're out of line I told you once befo' it's dubya dot\nBust a Head dot com, on mine, hit the flo'!\nAnd don't come back no mo' no mo' no mo' no mo'\nMotherfucker it's E-4-oh from the Valle-jo\nStill rappin like I'm po' - BEOTCH!\n\n[Hook]\n\n[David Banner]\nI'mma kill a motherfucker's ass if I have to\nBut is it worth it is the question that I ask you\nTo blast your punk-ass\nAnd is you bleedin, only to give Satan a damn good\nReason to play with me, look bitch I'm sayin\nYou don't listen 'less that tec-9 sprayin yo' ass\nGlass breakin in your home boy, thinkin you fast\nI never mash out, 'til the iron smack up yo' body\nThen you pass out, I pray to God for peace\nI done best to get my black ass out of these streets\nBut y'all don't listen 'less I'm cussin and bustin the shit\nYou keep beggin, and I'mma give it to ya you bitch!\nIn your face, your back, your chest, neck and lungs\nYou want war, you will get it for Mr. Crawfordson\nThey call me really really doe, ain't no ho in my blood\nA couple slugs bitch you thugs'll give me a hug\nReal gangster niggas raise up\nY'all sticky ooh-wee niggas blaze up\nOr get yo' ass sprayed up, bitch nigga!\n\n[E-40]\nAnd there you have it! (And there you have it)\nAnybody can get it (anybody)\nDon't act like you can't get touched, peeyimp!\nYeah, my dude Bone Crusher (that's right)\nLil Jon and the Eastside Boyz (yeahhH!) David Banner\nAnd E-40 Belafonte pimpskillet\nTrust that, BOTCH! BEOTCH!!"}]}