{"artist": "WC", "songs": [{"year": "2002-10-22", "lyrics": "[WC]\nNigga that shit coming together like sweaty ass cheeks, nigga!\n\n[Intro- Ice Cube]\n\n*Keep it gangsta y'all repeated *\nMy niggas thug out\nYou getting drugged out\nThese bitches getting loc'ed out\nWhen we smoke out, cos we chromed out\nAbout to bomb out\n\n[Verse 1 - WC]\nHere ye, here ye, calling all the hawgs\nFresh outta the whole tank, bouncin up the walls\nDub-cee! The bandana president, with the gauge on the ghetto\nRollin through y'all residents\nRunnin the scene this is the king of the cars\nThugged out baby in my new busta's\nGangstas, all of them gangstas, none of them let me see up\nRidaz throw ya heaterz up\nLadies, OG'z, sorry that I've been gone\nBut now I'm back to get my walk on!\nSwang with the game as I reach out and touch ya\nTurn the cup up and get ignorant on this motherfucker\n\"Mayday, mayday!\" back in charge\n*shrilling noise* calling out cars, calling out cars\nDip, skip through the lane with the bang, bang, bang, jangle\nHoppin' out the SS workin' all them angles\nDub-shiest deep the scrilla, and ive got my homeboy\n\n[Verse 2 - MC Ren]\nHell yeah, the motherfucking villain\n1 to the 2 to the 3 to the +Hello+\nLook at these g'z working these fake ass sopranos\n\nHere come the Villain with another heater\nWith motherfucking Dub nigga in the two-seater\nOn my nuts while I west west y'all\nGrab that microphone and I test test y'all\nVillian baritone be like all over y'all\nWho wanna ball with that Black nigga Ren?\nLike the Don Mega I'm supreme hustling\nDub-cee! Give a fuck if these bitches don't love me\nYeah!\n\n[Hook - Ice Cube]\nI wanna bang, I wanna ride\nI wanna slang, from the side, do it now\nIt's do or die\nWe can ball till the wheels fall off\nAnd let these motherfuckers know they gotta peel us off\n\n[Verse 3 - WC]\nHey, hey, hey, hey, hey\nUpon em again and I'm er running em again, look at it\nWith da-da-da-day, with da-da-da-day\nDub rock it; let your flag hang from your back pocket\nDraw on em, on em, on em can't none of em\nEat with me, eat my style but y'all can't get rid of me\nI heard y'all C-Walking now, yeah who taught you?\nWhat you could say who?\nNigga why-I-I-I-I-I oughta smack all the spit out of you!\nBeat the shit out of you! Get at em dumping, stomping\nDippin in the 600, saggin in my overalls blunted\nFinger and thumb it, quick run\nThis gangsta shit Dub-Cee runnin\nHere son, steady pumping I come through punking\nY'all think y'all rollies, shooting them highstyles like Kobe\nSo shut up and kneel to these Westside parolees\nAnd pass the blunt, cos none of ya'll can hold it\n\n[Hook X2]\nWe got the niggas (we got the bitches)\nWe got the killaz (we got the riches)\nWe got the dealers (we hit the switches)\nWe got every fucking thing you want\nAnd we can get it punk ass nigga, if we don't\n\n[Verse 4 - MC Ren]\nWho that nigga that you fucking with?\nWhen you want to hear some motherfucking nigga shit\nCall the villain and I'll bring hot lyric\nWaltonville to hit your bitch nigga ren with it\nY'all need to quit it\nThis shit legendary, fuck around with it and yo mama get buried\nYour first born and that bitch you just married!\nWho give a fuck pop that baby she just carried\nHubbin' all black like my fucking skin tone\nHow the fuck you gon talk about the villain, you a clone\nBitin every time you bust, who gave all y'all balls to cuss?\nWeak motherfuckers better say us!\nSo +If it Ain't Ruff+, it ain't my shit\nMight a bit mad at the bitch that ate my dick\nHate my clique, bitch-man cos I won't hit\nA nigga that I ain't fucking wit!\n\n[Hook X2]\n\n[All]\nPlease Beelive it, please beelive it, please believe it\n\nAwww man gimme one mo' sip of that cognac!", "image": "https://images.genius.com/9dca4fc634fb841debe25e0b0a92d67b.503x500x1.jpg", "album": "Ghetto Heisman", "title": "Wanna Ride"}]}