{"songs": [{"title": "Forgive Them Father", "album": "The Miseducation of Lauryn Hill", "year": "1998-08-25", "image": "https://images.genius.com/183da2198bbbc2e491fa0ed92a83a8bd.600x600x1.jpg", "lyrics": "[Intro: Shelly Thunder]\nForgive us our trespasses as we forgive those that trespass against us\nAlthough them again we will never, never, never trust\nHoo-hoo-hoo-hoo-hoo!\nThem nuh know what them do\nDig out your eye, while I'm sticking like glue\nFling, skin, grin, while them plotting for you, true!\n\n[Chorus: Lauryn Hill & Shelly Thunder]\nForgive them father for they know not what they do\n(Me a tell you, dem nuh know)\nForgive them father for they know not what they do\n(Fi be real, them nuh have a clue!)\n\n[Verse 1: Lauryn Hill]\nBeware the false motives of others\nBe careful of those who pretend to be brothers\nAnd you never suppose it's those who are closest to you\nTo you\nThey say all the right things, to gain their position\nThen use your kindness as their ammunition\nTo shoot you down in the name of amibition, they do\nOhhh\n\n[Chorus: Lauryn Hill]\nForgive them father, for\nThey know not what they do\nForgive them father, for\nThey know not what they do\n\n[Verse 2: Lauryn Hill]\nWhy every Indian wanna be the chief?\nFeed a man 'til he full and he still want beef\nGive me grief, try to tief off my piece\nWhy for you to increase, I must decrease?\nIf I treat you kindly, does it mean that I'm weak?\nYou hear me speak and think I won't take it to the streets\nI know enough cats that don't turn the other cheek\nBut I try to keep it civilized, like Menelik\nAnd other African czars, observing stars with war scars\nGet yours in this capitalistic system\nSo many caught or got bought you can't list them\nHow you gon' idolize the missing?\nTo survive is to stay alive in the face of opposition\nEven when they coming, gunning I stand position\nL's known the mission since conception\nLet's free the people from deception\nIf you looking for the answers then you gotta ask the questions\nAnd when I let go, my voice echoes through the ghetto\nSick of men trying to pull strings like Geppetto\nWhy black people always be the ones to settle?\nMarch through these streets like Soweto, uhh\n\nLike Cain and Abel, Caesar and Brutus\nJesus and Judus, backstabbers do this\n\n[Chorus: Lauryn Hill]\nForgive them father, for\nThey know not what they do\nForgive them father, for\nThey know not what they do\n\n[Verse 3: Lauryn Hill]\nIt took me a little while to discover\nWolves in sheep coats who pretend to be lovers\nMen who lack conscience will even lie to themselves, to themselves\nA friend once said, and I found to be true\nThat everyday people, they lie to God too\nSo what makes you think, that they won't lie to you?\n\n[Chorus: Lauryn Hill & Shelly Thunder]\nForgive them father for they know not what they do\n(Forgive them, forgive them)\nForgive them father for they know not what they do\n(Forgive them, forgive them)\n\n[Verse 4: Shelly Thunder & Lauryn Hill]\nGwan like dem love you, while dem rip you to shreds\nTrample pon yuh heart, and leff you fi dead\nDem a yuh friend, who you depend pon, from way back when\n( [?] to grace)\nBut if you, gi' dem yuh back, then you must meet yuh end\nDem nuh know what dem do do\n(Who's gonna be the one?)\nDem nuh know what dem do do\n(Gotta be the one to say)\nDem nuh know, dem nuh know, dem nuh know, dem nuh know\nDem nuh know what dem do do\n(Oh, yeah, oh)\n\n[Outro: Lauryn Hill]\n(Forgive them father, forgive them father...)"}], "artist": "Lauryn Hill"}