{"artist": "Ice Cube", "songs": [{"title": "24 Wit’ An L", "lyrics": "24 with an L\n24 years old\nAnd I got life in this motherfucker...\n\n24 with an L as I bail through the concrete, shit is kinda deep\nDeep, deeper than Atlantis, you got to know who the man is\nL.A. better known as Pelican's Bay\nThe ghetto bird's got the word from the stool pigeon\nA bird in the hand can't beat a chicken\nThere ain't no warden (shit)\nJust broken glass fucking up my Jordans\nTwice upon the time in the projects\nI done got jacked for my Rolex\nBut I keep going, let it pass\nCause the swap meet got a sale on ski masks\nAnd my little homie Kevin\nBeen carjacking since '87 (really doe)\nL.A. is like a jail cell\nAnd I got 24 with an L\n\n\"Get in that cell, nigga\" (Repeat 8x)\n\nNow, I made a little money, good\nBut I still want to live in the hood\nBut buying new fly shit\nIs just like inviting ants to a picnic\nThere's just too many sets\nAnd now I'm getting those kidnap threats\nBut who wanna get wet?\nCause I'll soak ya, you think I'm fat like Oprah\nAll I got is a little piece of nothing\nAnd now you want to jack all the sudden\nRather have me face down on the floor\nInstead of that devil you work for\nMotherfucking coward\nAnd clowning my man cause he wants to go to Howard\nNow I got a strap when I bail\nThrough the hood, 24 with an L\n\n\"Get in that cell, nigga\" (Repeat 8x)\n\n24 years, but see I got life\nSorry Mike, it does matter if you're black or white\nCause I'm up against the black and white\nThey spread my legs and grab my nuts tight\nNiggas keep hitting me up\nAnd bitches try to get a drop of nut\nAsking me to dick this\nSo they can blow up, throw up from the morning sickness\nKeep my shoulder on the wall like the county\nCause you buster-ass niggas can't clown me\nSouth of Pico, that's where we go\nDeep in a Regal, Desert Eagle\nSitting on my lap like a bitch with a gat\nWestside's on the map\nSo if you want to scrap or even drop shells\n24 with an L\n\n\"Get in that cell, nigga\" (Repeat 12x)", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg", "album": "Bootlegs & B-Sides", "year": "1992-11-17"}]}