{"artist": "E-40", "songs": [{"title": "Ahhhh Shit!", "image": "https://images.genius.com/7a7973c42becb90d5da09052eab77880.500x500x1.jpg", "album": "Revenue Retrievin’: Night Shift", "year": "2010-03-30", "lyrics": "[Hook:]\nHe talking shit shit shit, shit shit shit\nHe be say some shit shit shit, shit shit shit\nSHHHIIIIIIIIIIIIIIIT\nAhhhh Shit!\nHe talking shit shit shit, shit shit shit\nHe be say some shit shit shit, shit shit shit\nSHHHIIIIIIIIIIIIIIIT\nAhhhh Shit!\n\n[Verse 1: E-40]\nUhh!\nZany bizarre ballistic\nComing off of some of that ignorant shit resickalish verbish gases flows\nBMZ glasses on my nose\nUndeniable throbbish molish flight music not that garbage\nBumpin' the pistol out, do a X street nigga before I hollish\nGot a whole lotta spit to talk about and a whole lotta speech to speak\nThe neighborhood fuck with 40 he be preaching mane he teeth\nSome of these fools be boosie (boosie) rap about what they make\nBut at the end of the day, between me and you, they ain't got nothin to say (that's right)\nMoney don't make me I make money go hard for mine I'm smashed (smashed)\nInstead of recall on my product customer satisfaction\nAm I too early or are they too late?\nAm I too blob or are they to slay?\nWhy do we go, when he goin slow?\nHow come we can, why can I know?\nCan't be slippin like a transmission (mission) when ya counter-clockwise twisted (twisted)\nMixing and whippin' goop (goop) be prepared to shoot (shoot)\nSTEP IT UP! Don't get left behind (left behind)\nDo some CATCHING UP! Put some ketchup on your fries (on your fries)\nBEATCH!\n\n[Hook:]\n\n[Verse 2: E-40]\nUhh!\nNot all of the rappers but most of them sound alike (alike?)\nI been rappin since most of em knew how to ride a bike (a bike)\nOn the dope track copping and flippin, pushing white (that yola)\nTriple beam scales, scanners on that height (and that roper)\nDroomers, walking 'round with they spook on (spook on?)\nGrimming, standing in front of my momma's home (magazine street)\nHubba rocks dowsers' cotton candy zones (ice cream)\nZippers quarters half pound hole works (for the dope fiends)\nVerify fixture gritter weight mover (weight moo-ba?)\nBurgundy mercury sixty-seven a cougar (a cougar)\nWith the liquor dragging and gold tips, gold grill, gold weed\nGold rings, gold chain, gold every fuckin thang\nBetter learn how to swim or you gon fuckin sink (you goin sank)\nIf you don't work then you don't fuckin ate (you don't ate)\nCrying complaining and whining ain't you (crying complaining and whining ain't you)\nHow the fuck I'm a help you if you can't help you?\nBEEATCH! (BEEATCH)\n\n[Hook:]"}]}