{"artist": "R.A. The Rugged Man", "songs": [{"album": null, "year": "2012-12-04", "lyrics": "[Verse 1: R.A. The Rugged Man]\nListening to Christopher Wallace, wait, hold up, it's the holidays\nPut on Run-DMC, Christmas in Hollis\nAnd if you're rocking a yamaka happy Hanukkah\nThere's icicles hanging from the roof and gutters, and snow on the thermometer\nJack Frost, he a cold man\nSnow White ho looking for blow from Frosty the Snowman\nChris Greenwood was a bitch, I kicked him in his big jaws\nI visit Miss Claus, got her clothes ripped off\nBut that old bitch got my dick soft, now the elves are pissed off\nSanta's big ass look like a white Rick Ross\nSugar pancakes, syrup and marshmallows in the hams\nI got a pair of Puma sneakers, look like MC Shan\nIn school we'd make fun of kids that were Jehovah's Witness\nCause they couldn't celebrate Halloween, birthdays and christmas\nNow I'm kissing the clit, it bleeded, what the hell, gross\nCome out the pussy looking like Rudolph with the red nose\nTrain sets, toy trucks from Tonka, Italianos mangia\nMy black people light a candle for Kwanzaa\nI don't care if I get coal for stocking stuffers\nI'mma find Santa's little helpers and midget talk the motherfuckers\n\n[Hook: R.A. The Rugged Man]\nGo Jesus, it's your birthday!\nGo Jesus, it's your birthday!\nGo Jesus, it's your birthday!\nGo Jesus, go Jesus!\n\n[Verse 2: R.A. The Rugged Man]\nSleigh bells jing-jingaling, front door ring-dingaling\nKids singing in the bling-bling sickening\nD-flicks, silent night, deadly night, church picketing\nHannukah menorah candle light flickering\nFamilies bickering, let me spin the hot bar\nRockstar, where my Muslims? Allah Akbar!\nWant a walkman, a VCR, wait, time out\nI want a red ryder BB Gun to shoot my eye out\nThe big Christmas picture is ridiculous\nSanta Claus is based on a Catholic bishop named Saint Nicholas\nYears before he was at the North Pole chilling\nHe was rumoured to resurrect the bodies of mutilated children\nBut it's Christmas and my little niece got Bieber fever\nI'm in L.A, I'll pick her up the CD at Amoeba\nI hate to bring in the new year with a dark side\nBut who gon' drop the ball in Times Square now that Dick Clark died\n\n[Hook]\n\n[Verse 3: Mac Lethal]\nC'mon, Get Poor or Die Tryin'\nConsumerism is a new religion for the people in stores that lie crying\nPraying, just wishing for a great sale\nTraded in my '64 to listen to the sleigh bells\nFuck it, it's a holidays bitch\nI ain't buying any presents, I'mma walk away rich\nI mean I'm Satan Claus, I'm a selfish fuck\nI ain't giving any gifts to these helpless schmucks\nShould I smack Grandma or let her talk instead\nBitch looks like she belongs on The Walking Dead\nI can't stuff her when words are in her mouth\nI listen to that talking head, when I be burning down the house\nI flame \"fuck\" to the mammoth elephant\nThe hammer fell, and then I cooked a little honey ham and gelatine\nI blast, I burn in your heart, three dudes ringing your bell\nHoping they're tools like Nebraska Furniture Mart\nOooooooh shit!\nA lotta hippie bitches take molly, looking stupid with the glow sticks\nYou people never seen a boy like this\nI punch your baby momma in the fucking muay Thai clinch\nYou need to stop looking at the toys I get\nI'm the grinch penny-pinching every coin I flip\nI'm a hip-hop head, I ain't a hipster person\nThat watches The Office the British version\n(Go Jesus!) I'll take you on a big excursion\nHopefully I'll get the words in\nThe last year Santa ate the cookies and he dropped down the whiskey\nSo I'mma clap his ass when he come down the chimney\n(Go Jesus!) Huh, It's the exorcist\nAre you a naughty ass bitch? Let me check my list\nI drink Jesus blood, and tell him to bless my piss\nMac Lethal, Rugged Man, here's your X-mas gift!", "title": "Crustified Christmas", "image": "https://images.genius.com/8fff7f98b3275b4fa6a6a43f01159e31.899x899x1.jpg"}]}