{"songs": [{"album": "Planet", "image": "https://images.genius.com/9512e7de485fe45a8b0365fd80465887.1000x1000x1.png", "year": "2018-02-02", "title": "Bad JuJu", "lyrics": "[Intro]\nI hit back\nI hit back, I hit back, I hit back, I hit back\nI hit back, I hit back, I hit back, I hit back\n\n[Verse 1: Tech N9ne]\nWe lashin' out at you, you think you 'bout it, we 'bout it too\nOnly difference is my clout is too massive\nWe active when actors give malice to anybody we close to\nI'll approach you with the woop-wop that'll soak you (so true)\nAlready be so much we go through, now we gotta rid you in the MO zoo\nThis is tribal, stick his rival in the mouth with a right blow then he get this pyro\nYoung punk better lie low somewhere prolly up in Cairo\nWith a Bible when a psycho wanna give a hater lypo\nWhen the knife go with the quickness, you so full of bitchness\nYou trip flippin' on chicks but a b-boy make him wanna shit bricks\nThis is vicious, everything out yo lips is fictitious, hehe\nMisses made me mad as Mozzy, huh\nMan the motive must been made of molly, huh\nMilli maximize a mess with a mind of Malcolm X\nAnd a martyr man whose mom is Maude, huh\nBetter be cool, I'ma lead you to the B fools\nThat'll greet you with a (blacca, blacca, blacca) leave you\nIn the coffin often talkin' fecal\nI'm a grown mane, takin' this with no shame\nReally wanna have no brains, step foot into my domain, no games\nAll of my children are grown and I'm feelin'\nThey love me but don't really like me, I'm illin'\nI'm no longer locked in a marriage, I'm careless\nSo anyone of my loved ones you funk, I'll inherit\nThis is my fury, fuck being  Nzuri\nI tried that, now I keep a gun in my lap\nTalkin' so cheap and when it don't end with the grievin'\nI'm ready for the battle, bring it on this evenin'\n\n[Chorus: Tech N9ne]\nComin' at me wrong is bad JuJu\nYou better not make me Soo-Woo you\nSo you best better go run, tell your crew\nDo somethin' new-new\nAnd it better be habari gani ndugu!\nDon't make me fight y'all, the fully gon' bite y'all\nEars ringin' like sixty gun night ball\nYeah, spray ya like Lysol, you don't wanna let night fall, light y'all!\n\n[Verse 2: King Iso]\nThis be the entry of this B\nBut not no Pyramus chicks peep us\nEye be hella open top a pyramid, it's Giza\nDip please 'cause I'm Khufu, did you get me? Tellin' you move\nBetter quit beefin', or this heat, hit 'em then I dip, au jus you\nOn a hater's Kufi, I go cuckoo or booboo like I shit fevers\nI don't wanna check a temp neither, to emcees I'm the Grim Reaper\nSo anybody comin' at me trippin' like you ran around the world with ten visas\nBet I'll really get to pullin' everybody's card like I had a chip reader\nThis is Iso, big dick psycho, smash his chick and then skate like a kick flip, grind mode\nThey ain't wanna see me rockin' with Tech N9ne though, yeah I know\nCould imagine what you all'll think if Tech signed Iso (would you cry bro?)\nGettin' big like Bruce Bruce, mimi ni ajabu foo'\nHit a hater hella hard, he'll have more clips hit 'em than Hulu, who knew?\nMe and Tech'll get to cheffin' up shit like couscous?\nIf you think you fuckin' with us, ball up your opinion and shove it in your poop shoot, 'cause\n\n[Chorus: Tech N9ne]\nComin' at me wrong is bad JuJu (nigga)\nYou better not make me Soo-Woo you\nSo you best better go run, tell your crew\nDo somethin' new-new\nAnd it better be habari gani ndugu!\nDon't make me fight y'all, the fully gon' bite y'all\nEars ringin' like sixty gun night ball\nYeah, spray ya like Lysol, you don't wanna let night fall, light y'all!\n\n[Outro: Tech N9ne & King Iso]\nThis could be federal, take me for feedin' you several (Don't do it Tech)\nI'm on a pedestal, should I come down or just let it go? (Just let it go)\nThis could be federal, take me for feedin' you several (Don't do it Tech)\nI'm on a pedestal, should I come down or just let it go?\nDon't make me fight y'all, sixty gun night ball\nYeah, spray ya like Lysol, night fall, light y'all!"}], "artist": "Tech N9ne"}