{"artist": "Prince Paul", "songs": [{"album": "Psychoanalysis (What Is It?)", "title": "Drinks (Escapism)", "image": "https://images.genius.com/2e62c87c2fc12d70ea466dbe46b314e0.599x599x1.jpg", "lyrics": "Now just sit back, and listen\n\nYo man, let me get a shot of vodka, straight up, no chaser\n[?]\nYo, I had a rough day man\nYo, LeRoy man, let me get another drink man\nI have to tell you man\nYo, you ever have a day, man, when absolutely nothing goes right?\n[?] the wife is giving me problems\nYou know what I'm sayin', the old lady, I came home late last night\nI was workin' late last night, you know, she think I'm out seein' other broads, man\n[?]\nGive me another drink man\nAlright\nYeah man\nYo and then, to top it all off, I come to the office, the boss is on my ass\n[?]\nYou know, he's up my ass\nI mean, you know, I go out for lunch\nAnd he's callin' me, pagin' me, wanting to know where I am man\n[?]\nWhat the fuck is with him man\nHey, give me another drink man\nMan, you ever meet somebody, that\nThey just can't shut the fuck up man\nThey just keep talkin' to you and just keep talkin' to you, even when you...it's clear you're not listening to them no more, they still want to talk to you\n[?]\nGive me another drink man\nAww man, that [?] yeah, yeah man\nMan\n[?]\n\nGive me another one\nSo anyway, um\nWhat were we talkin' about there?  Ahhhh\nYo Paul\nAnd my kids\nPrince Paul man (Jesus Christ, these kids)\nIs that you Terry? Good, don't, don't even think about it\nDon't even think about it\nLook, I love 'im, but he's just a pain in my ass\nLet me get another drink, he's a pain in my ass\nAnd then everyone's bothering me telling me that I drink too much\n[?]\nAnd that's just the thing that fuckin' pisses me\nWhen the glass is empty, put a little more in it there\nYou know what I'm sayin'\n[?]\nAnd ah\nOh, the bottle's, the bottle's empty?  You gotta go downstairs to get another bottle?\nAlright\n[?]\n\nHi baby\n[?]\nHey not bad for a 2000 year old man\n[?]\n\nDo try to escape, escape from yourself\nYou try everything, movies, television Zen Buddhism, travel\nBut wherever you go, you go to, and spoil everything\n\nI don't know man, just give me another drink\nYo, Paul, I don't know what the fuck, you know Prince Paul man?\nIsn't he just the weirdest?", "year": "1996-06-25"}]}