{"artist": "6LACK", "songs": [{"album": null, "title": "PRBLMS (Remix)", "lyrics": "[Isley Brothers Intro]\nHey girl ain't no mystery\nAt least as far as I can see\nI want to keep you here\nLaying next to me\n\n[Verse 1: 6LACK]\nAnd she said\n\"You a god-damn lie\"\nI ain't mean to say that shit girl I was god-damn high\nSo we left the crib now we in the god-damn ride\nShe lookin' god-damn fine\nI wanted a bitch who was down to Earth\nBut she want the god-damn sky, uh\nList of my problems\nGot this one on my line that won't stop fucking callin'\nIt's crazy I made her that way\nEvery time I see her out, I see the hate in her face\nLike why you do that?\nTell her you love her when next week you just want your space\nWhy you do, why you do that?\nTell her you want her but next week you do your own thing\nWhy you do, why you do that?\nI can't explain it but just know it working for me\nShe text me \"I hate you, I hate you, I hate you, I hate you\"\nBut how the fuck can you hate me?\nWhen I ain't did shit, but be the real thang\nShe know I'm the real, that'll never change\nI never been the one to try to explain\nWhile you catch them feels I'mma sip on this drank, it's easing my brain\n\n[Hook: 6LACK and Childish Major]\nI got real shit to stress about, girl, I ain't worried 'bout shit ('Bout shit)\nRemember that I tried to build ya, now I ain't worried 'bout shit\nI got real shit to stress about, girl, I ain't worried 'bout shit ('Bout shit)\nRemember that I tried to build ya, now I ain't worried 'bout shit\nSo I found me a new thang, I'm not as lost as you think\nGot plenty queens in my hometown, all they need is drank and that dank\nSo I found me a new thang, I'm not as lost as you think\nGot plenty queens in my hometown, all they need is drank and that dank\n\n[Verse 2: Childish Major & 6LACK]\nNow I'm like\nIt's a god-damn shame\nWe done crashed, we done burned\nBut baby you the god-damn flame (you the god-damn flame)\nTrust me it's love, but I ain't no god-damn saint\nYou blame me for every damn thing\nI wanted to help you and see you shine\nBut you wanna god-damn rain\nUh, list of my problems\nGot this one in my bed and she just wants to sleep\nFucking up all of the sheets\nShe only wake up to eat\nDo this shit every week\nLike, why you do that?\nCrying you want to be great, but sleepin' until the next day\nWhy you do that?\nDon't got that much in the bank, we go out she order the steak\nWhy you do, why you do that?\nShe can't explain it but just know it working for her\nShe claiming she down on her luck, but really she don't give a fuck\nAnd I cannot make this shit up\nAnd I ain't did shit but be the real thang\nShe know I'm the real, that'll never change\nI won't be the one to try to explain\nWhile you catch them feels I'mma sip on this drank, it's easing the pain\n\n\n[Verse 4: Jace]\nTo all the ladies in the place who like wine and bake\nAllow me to state that I am Jace\nA nigga real\nYou can recognize it or despise it, but..\nAll the real bitches gonna like it.. 'Cause\nI'm a hometown hustler, love the way I'm fuckin' her\nServe her like a customer, I'm 21 bustin', no\nAin't too many flexin' like this, get your muscle up\nPull up at The Twelve, hop out it's a bunch of us\nJust in case little mama really think I'm stuntin' her\nGirls on your line all the time when you coming up\nAnd I could've chose your friend, but I chose you\nIt's a blunt, lit shit, what you gon' do?\nTell your girl to roll through, ask if they can roll too\nFinally got Backwoods I can't roll those true\nSo meet me halfway and just grab that ashtray\nAnd do what my ass say\n\n[Outro Hook]\nSo I found me a new thang, I'm not as lost as you think\nGot plenty queens in my hometown, all they need is drank and that dank\nSo I found me a new thang, I'm not as lost as you think\nGot plenty queens in my hometown, all they need is drank and that dank", "year": "2017-04-28", "image": "https://images.genius.com/acc2c1b911ae28cef4b3407fc5d78a43.480x360x1.jpg"}]}