{"songs": [{"year": "2017-06-08", "lyrics": "[Intro]\nAin't nothing but a twenty somethin' dollar ride for my baby, my baby\nAin't nothing but a twenty somethin' dollar ride for my boo\nSaid it ain't nothing but a twenty somethin' dollar ride for my baby, my lady\nAnd in about twenty-somethin' minutes, she'll be coming through\n\n[Hook]\nBaby let me get you that Uber\nJust so you can come over and chill\nI will\nAnd baby when I get you that Uber\nIma watch it as it drive and maneuver, for real\nI will\n\n[Verse 1]\nWhen I hit your line, you seemed surprised\nCause usually when you call I don't reply (I decline)\nBut I got time today, okay, you crossed my mind\nCause you seem real and plus you chill, that's hard to find\nYou can find out all the ways I want to do you\nSoon as you send the addy, I'ma call this Uber (to you, to you)\nBlack truck, nothing less, just select\nYou're the one I select 'cause you're so real you ride the X\n\n[Hook]\nBaby let me get you that Uber\nJust so you can come over and chill\nI will\nAnd baby when I get you that Uber\nIma watch it as it drive and maneuver, for real\nI will\n\n[Verse 2]\nMe and you, long overdue\nHow many months? It's been a few\nBut will we fuck? That's up to you\nWhen you come through, just make a move\nJust say the word, when you tryna skrrt\nOr I'll call it early if you just tryna flirt\nDon't waste my time, cause I rarely have it\nI'll call you that Uber, have you in rush hour traffic\nDamn!\n\n[Hook]\nBaby let me get you that Uber\nJust so you can come over and chill\nI will\nAnd baby when I get you that Uber\nIma watch it as it drive and maneuver, for real\nI will\n\n[Outro]\nAin't nothing but a twenty somethin' dollar ride for my baby, my baby\nAin't nothing but a twenty somethin' dollar ride for my boo\nAin't nothing but a twenty somethin' dollar ride for my baby, my lady\nAnd in about twenty-somethin' minutes, she'll be coming through", "title": "The Uber Song", "album": null, "image": "https://images.genius.com/63a8d1877ad69163c4c084cbc5afd4b7.355x355x1.jpg"}], "artist": "DRAM"}