{"artist": "E-40", "songs": [{"title": "All Tha Time", "image": "https://images.genius.com/a5f1f8095418f1fd91f86ca97ac169c0.1000x1000x1.jpg", "album": "The Element of Surprise", "year": "1998-08-11", "lyrics": "[Intro: E-40]\nUhhhh.. UHHHH.. UHHHH...Ah...Ah...\n\n[Chorus: E-40 & B-Legit]\nYou got Moesha, E?\nAll Tha Time, B\nYou got your Indonesia, B?\nAll Tha Time, E\nYou got your street sweeper broom?\nAll Tha Time, B\nYou got your chronic, Neptune?\nAll Tha Time!\n\n[Verse 1]\n[E-40]\nMight not know how to read and write, but I do know Arm & Hammer\nIf the screen from a tweaker's pipe turns black, that means it's bammer\nIf it's too many seeds in your weed, then chop 'em down\nIf your blood gets bogus, then run his ass out of town\nI'm on the Carquinez Bridge, Terminal 3, quarter after seven\nPockets full of hundreds, can't seem to find no ones, engine revvin'\nSmebbin', talkin' hella shit to the cashier\nPi-pi's get right behind me askin' me how much have I had to drink\nAnd I said, \"A beer\"\nBlitzed, out of my wits, drivin' drunk\nLet's see I done hit one, two, three, ain't no tellin' how many skunk\nIn and out of the holding cell, blood alcohol like a warrior\nAnd I refuse to answer any questions without the advisory of my lawyer\n\n[B-Legit]\nI been in it, all around it, co-founded\nDid it when I done it, I musta been blunted\nNinety-six hundred for the two P's\nI let the homie K-One run through these\nBase is on the roam, I left the hubs alone\nI wonder if they're chippin' the Nextel phones\nA bad motherfucker for the butter and grits\nAnd you niggas need to know this shit\n\n[Chorus: E-40 & B-Legit]\nYou got Moesha, E?\nAll Tha Time, B\nYou got your Indonesia, B?\nAll Tha Time, E\nYou got your street sweeper broom?\nAll Tha Time, B\nYou got your chronic, Neptune?\nAll Tha Time!\n\n[Verse 2]\n[E-40]\nI got the turf on lock, 26 block\nThorough beeper by my side, gotta be in the house by 8 o'clock\nOrganized crime, bitch; all the time, bitch\nGet off his dick and get on mine, bitch\n\n[B-Legit]\nI be smokin' like a broke-down Coupe DeVille\nPoppin' them generic brand Golden Seals\nParole can't hold me, and neither could y'all\nBitch, me and my Click is off the wall\n\n[E-40]\nI fucks with everybody that's somebody, major factors\nAnd nigga if you can't understand that shit\nThen nigga you must got your mask on backwards\n\n[B-Legit]\nTiptoeing through the hood, nigga, is no good, nigga\nGotta have a pass or we get that ass\n\n[Chorus: E-40 & B-Legit]\nYou got Moesha, E?\nAll Tha Time, B\nYou got your Indonesia, B?\nAll Tha Time, E\nYou got your street sweeper broom?\nAll Tha Time, B\nYou got your chronic, Neptune?\nAll Tha Time!\n\n[Verse 3]\n[B-Legit]\nNow the parties don't start until we walk in\nDrunk off that gin, down to check yo' chin\nI'm a mannish motherfucker with the chips and bread\nAnd enough, to have your head kinda tough\nBluffin' don't exist, we pull the hoe cards\nTail between the legs when you walk in the yard\nSo if you hard, and wanna stay that way\nYou better watch where the fuck you play\n\n[E-40]\nCheck it out\nIt's bring your own bottle\n'Cause I be likin' to get to perkin' somethin' awful\nAnd come through that motherfucker slurrin'\nTalkin' crazy to bitches, weeble-wobblin'\nBurpin', gurpin', stomach growlin' off the hinges\nLurkin', twurkin', my stay highs with red lenses\nI'm tryin' to get that fast quarter, fuck a slow nickel\nRun a smooth ass operation without gettin' caught in the pickle\nTake my cool ass on a vacation that maybe someday stop\nBuy me an empty commercial lot\nAnd turn it into a car wax wash and detail shop\n\n[Chorus: E-40 & B-Legit]\nYou got Moesha, E?\nAll Tha Time, B\nYou got your Indonesia, B?\nAll Tha Time, E\nYou got your street sweeper broom?\nAll Tha Time, B\nYou got your chronic, Neptune?\nAll Tha Time!\n\n[Outro: E-40]\nUhhhh.. UHHHH.. UHHHH...AHH"}]}