{"artist": "Pusha T", "songs": [{"album": "My Name Is My Name", "title": "Numbers on the Boards", "image": "https://images.rapgenius.com/0fa0a74a57a77af8427707b8fc9068a0.660x660x1.jpg", "lyrics": "[Produced by DJ Don Cannon and Kanye West]\n\n[Intro]\n(Yeah!) How you feelin'?\n(Fine!) Feel alright?\n\n[Verse 1]\nI'm so bossy, bitch, get off me\nIt's a different jingle when you hear these car keys\nYour SL's missin' a S, nigga\nYour plane's missin' a chef\nThe common theme, see they both got wings\nIf you fly, do it to death\nIt's only one God, and it's only one crown\nSo it's only one king that can stand on this mound\nKing Push, kingpin, overlord\nCoast Guard come a hundred goin' overboard\nI got money with the best of 'em\nGo blow for blow with any Mexican\nDon't let your side bitches settle in\nMight have to headbutt your Evelyn\nBallers, I put numbers on the boards\nHard to get a handle on this double-edged sword\nWhether rappin' or I'm rappin' to a whore\nMight reach back and relapse to wrappin' up this raw\nGivenchy fittin' like it's gym clothes\nWe really gymstars, I'm like D. Rose\nNo D-League, I'm like this close\n'88 Jordan, leapin' from the free throw\n\n[Hook]\nBallers, I put numbers on the boards\nBallers, I put numbers on the boards\n\n[Verse 2]\nMotherfuckers can't rhyme no more, 'bout crime no more\nMix drug and show money, Biggs Burke on tour\n25 bricks, move work like chore\nHit Delaware twice, needed 25 more\nI see flaw, cracks in your diamond\nCB4 when you rhyme, Simple Simon\nCome and meet the pieman, a must that I flaunt it\nThe legend grows legs when it comes back to haunt us\nBallers, I put numbers on the boards\nCan't a bitch livin' say I bought her Michael Kors\nEvery car driven was decided by the horse\nKeep the sticker in the window 'case you wonder what it cost\nHow could you relate when you ain't never been great?\nAnd rely on rap money to keep food up on your plates, nigga?\nI might sell a brick on my birthday\n36 years of doin' dirt like it's Earth Day, God\n\n[Hook]\nBallers, I put numbers on the boards", "year": "2013-05-10"}]}