{"songs": [{"title": "The Break Up/Break Down", "image": "https://images.rapgenius.com/ac8f8f02a86cd318e2fe85d85f3cde96.500x500x1.jpg", "lyrics": "[Hook]\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\n\n[Verse 1]\nTo let you know, you had a good guy\nThe most favorite hello, the most hardest good-bye\nThe most honest would lie, say that \"everything is cool\"\nWhen everybody sees the problem, everyone except for you\nOr maybe is it you did? Hopin' things'll blow away\nPretend it doesn't exist, then everything'll go away\nWatchin' a relationship float away\nI thought it was a keeper, but it was just a throw away\nI thought that I should keep her, the signs tell me to \"Stop it!\"\nShe was my hottest topic, but she just made me an option\nI guess I should of listened when they was telling me, \"Watch it!\"\nKnew love was never easy, when Stevie said its a rocket\nI get my pen and I jot it, all the wrongs about you\nSaw us slipping like house shoes, knew what we could amount to\nBut didn't, shit\nDid this, to let you know you had a good guy\nKnew it was finished, to let you know, it was good try\n\n[Hook]\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\n\n[Verse 2]\nWish that you knew that you was the world to me\nWoe is me, gave up the games, you had control of me\nAt first you were holding me\nI blink, then there's a hole in me!\nThe better halfs the whole of me, now tell me what is holding me?\nIts gone, and its my fault supposedly\nI ain't perfect but you ain't who you supposed to be\nGuess I made the fatal mistake of lettin' you close to me\nAnother past mistake I'm endurin' thats from the older me\nI'm hurtin 'noticably, be lyin' if I weren't surprised\nThought you knew not to talk wit your mouth full, of lies\nYou said the last thing that you wanted to do was hurt me\nWell damn, at least it wasn't the first thing\nBe still my beatin' heart, not time to open just yet\nLessons once learned, so hard to forget\nWas numb to it all before, but so far this regret\nHas been prevelant, you dont gotta say it, it's evident\n\n[Hook]\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\n\n[Verse 3]\nGoodbye to all those late nights, goodbye to all the sexing\nGoodbye to all your fake shite, goodbye to your impressions\nSay goodbye to your dishonesty, goodbye to yo' deception\nGoodbye to answerin' questions, goodbye to all your guesses\nSay goodbye to that person you never thought would doubt you\nGoodbye songs for you, hello songs about you\nSay goodbye to everything you represent is what I oughta do\nGoodbye to that face of yours, goodbye to the thought of you!\nGoodbye to everything we had and everything it seemed\nGoodbye to the word \"love\" and everything it means\nGoodbye to your truths even though you seemed to stretch them\nGoodbye to those lips of yours and every word that left them\n\n[Hook]\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you, I just thought you were cute\nThat's why I kissed you\nMy eyes don't shed tears, but boy they pour\nI don't love you", "year": "2015-11-11", "album": null}], "artist": "Ace Hashimoto"}