{"songs": [{"image": "https://images.genius.com/b87c43ff4d68530f7a5a207cbbe183cb.900x900x1.jpg", "album": "Now That’s What I Call Music! 101 [UK]", "title": "Funky Friday", "lyrics": "[Intro]\n1-6\nGame\n\n[Chorus: Dave]\nAt this age, how are them man still hating?\nMy young boy in a different country\nBut he ain't ever been on vacation\nOne hand on the girl I'm dating\nOne hand on the cash I'm making\nWe come through like Funky Friday\nAnd have all of your mandem skating\n\n[Verse 1: Dave]\nI came in, 550 on trainers\nIsland girl amazing, could be Bajan, Trini or Haitian\nShe, got a bag with flowers\nIf the trainers match I'll take it\nMe and bro just shut down Gucci\nHad the whole of the shop floor waitin'\nWho's that girl in the line\nWith the big behind that's looking all tempting?\nIf, her friend is a dead ting\nTake one for the team with a bredrin\nTwo, peng tings at the entrance\nWant attention but a man can't let them\nShe, must think I'm a reverend\nYou ain't comin' here getting redemption, no way\n\n[Chorus: Dave]\nAt this age, how are them man still hating?\nMy young boy in a different country\nBut he ain't ever been on vacation\nOne hand on the girl I'm dating\nOne hand on the cash I'm making\nWe come through like Funky Friday\nAnd have all of your mandem skating\n\n[Verse 2: Fredo]\nI see dem man skatin' now, I'm talking about running their legs\nMy youngens in country plugging the Z\nHe can't even buck me till nothing is left\nI flooded my right, I flooded my left\nI'm ducking your wife, I'm ducking the feds\nThe bell on the trap, it's buzzin' again\nBut still I ain't trying to get busted by feds\nLook, man, I ain't caught the bus in a sec'\nIt's me and my rambo cuttin' through West\nThe way that I went and just flooded my neck\nI'm shocked that I ain't gotta struggle for breath\nWith me and the missus be going on dates\nShe's holding the dipper, I'm holding her waist\nJust see some pigs moving low in the mains\nSo I phone up my nigga and told him the plate\n\n[Verse 3: Dave]\nTell a peng girl you can HMU\nI don't wanna cuddle and H-U-G\nAnd I'm still shopping in HMV\nFor all of my niggas in HMP\nHeard you got a girl going DMU\nIf I DM'd you would she DM me?\nYoung black brudda I'm a stylish g\nMan I put the IC in IC3\n\n[Verse 4: Fredo]\nThey tell me I'm gifted in rap\nNothing was nice, used to live in the trap\nNow if I go ask that chick for her snap\nI can bet money she's giving me that\nI'm always in Harrods, I'm filling the bag\nThem niggas ain't winners, them niggas are mad\nGyal at my vids and them bitches are bad\nThey get picked in the foreigns and ditched in the cab\nGame\n\n[Chorus: Dave]\nAt this age, how are them man still hating?\nMy young boy in a different country\nBut he ain't ever been on vacation\nOne hand on the girl I'm dating\nOne hand on the cash I'm making\nWe come through like Funky Friday\nAnd have all of your mandem skating", "year": "2018-10-04"}], "artist": "Dave"}