{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "Remedy", "image": "https://images.genius.com/6887c10ee5be10013019f010d9a9e2c1.1000x1000x1.jpg", "lyrics": "[Hook: Ruth-Anne]\nI sell it by the bottle\nOh I'll make it last all night\nDon't worry 'bout tomorrow\nOh, oh-oh, oh, I got the remedy\nOh, we let it go\nSo won't you come sit next to me\nI got the remedy oh, you never know\nOh I could give you what you need\nI got the remedy\n\n[Verse 1: Professor Green]\nMy life's enough for anyone to get gassed\nI could hit a bungalow\n8 in a bin bag and still get a quick lash table looking like November the 5th\nI won't remember anything memories are myths I'm a piss artist\nIt's an art to me last seen partying with Charlie Sheen\nTrue its half ten. and I'm looking in the mirror at me so how come I can see two and a half men?\n\n[Hook: Ruth-Anne & Professor Green]\nI sell it by the bottle (I ship it by the crate)\nOh I'll make it last all night (Well, I'm wide awake)\nDon't worry 'bout tomorrow (I got the energy)\nOh, oh-oh, oh (I got the remedy)\nOh, we let it go\nSo won't you come sit next to me\nI got the remedy, oh, you never know\nOh I could give you what you need\nI got the remedy\n\n[Verse 2: Professor Green]\nShe got me in her eyes no c.s. I'm in a vibe on a hype I could go all night no re-est flow b-est no t-est\nGot chicks brain training no d.s. Jolly cuase I bring my buds between my thigh and my ball's a bag a my monk man am I drunk?\nAnd high won't somebody body send Kate Nash my love?In a state of confusion soberness is a problem I solve by way of solution\nI'm gonna start a revolution with my recipe put it in a bottle\nCall it the remedy anybody every say they'll better me in rap?\nYou know I got the remedy for that are you mad?\nYou need medicine, therapy in fact and you know I got the remedy for that are you mad blood?\n\n[Hook: Ruth-Anne]\nI sell it by the bottle\nOh I'll make it last all night\nDon't worry 'bout tomorrow\nI got the remedy\nOh, we let it go\nSo won't you come sit next to me I got the remedy oh, you never know\nOh I could give you what you need\nI got the remedy\nI sell it by the bottle\nOh I'll make it last all night\nDon't worry 'bout tomorrow\nI got the remedy\nOh, we let it go\nSo won't you come sit next to me I got the remedy oh, you never know\nOh I could give you what you need\nI got the remedy", "year": null}]}