{"artist": "Asher Roth", "songs": [{"title": "Death of Autotune (DOA) Freestyle", "image": "https://images.genius.com/d2428ce0d129ae1116dae83c31fd96ce.800x450x1.jpg", "album": null, "lyrics": "[Intro: Asher Roth]\nThe only rapper to...be an elementary school teacher\n\n[Verse 1: Asher Roth]\nAsh is back, suck my cul-de-sac\nThat goes for all those who pose like Spence Pratt\nWhacks that can’t rap but they think they're the shit\nWhen I’m hangin' out in Vegas, makin' out with ya sis\nAhh, fuck reality shows, it's sad to see the tragedy reality shows\nReality that rap ain't goin' platinum no mo'\nSo I have to find an avenue with rapping befo'\nI got a warm fuzzy feelin when I'm flappin' the flow\nStarted with some cold chillin' and a tap of a toe\nNow they tappin' my phone because Im rackin' up dough\nAnd now that Asher is a factor they be at my back-do' (oh)\nDialogue with Viacom, playing X-Box with Megan Fox\nCall of duty I fire bomb entire squads, R’s and Uzi’s\nRiots on insider wars, beyond movies, (?)\nI’d rather lose than fire shots, I power this youth\nWho’d rather shoot than try and talk and get to the truth\nYou know I'm rooting my troops to keep trouping\nWe start a revolution simply through good music\nGet used to it dufus and do new shit\nYou Reese Witherspoons is clueless\nOh shit\nI’m silver stoned excuse me\nKeep getting loose and syracuse is so soothing\nBut don’t confuse me, my jersey still say A. Roth\nOr AKA \"Never Take A Day Off\"\nSince Bernie Madoff, the banks would pay off\nOur friends and our fans are the ones that's laid off\nIt's work, and no play, salad, and no steak\n75 days straight with no (break!)\nAhh, pysche\nI be chillin' be watchin' Ellen feedin' little kids lemons watch their face start swelling, up\nSuck it up, pucker up, buttercup, when enough is enough, nip tuck it in the butt\nCause our asses are assets\nAsh is invested in masses of massive, ashes to ashes\nAsh is the master of ceremony no lonely island phony flowin' though I’m on a boat (mothafucka!)\nIn north cadillac, on the fourth hour shaft\nMy boy drinks Cris champagne off'a ass\nI just laugh cause that’s actually true\nYou don’t believe that? Check it out on Youtube\nPoint a cam in the hand see the man Brain Bang\nCheck the rex in the decks while he chase after sex\nThis ones for Funk Flex, and the \"Greenhouse Effect: Volume 2\" is the truth\nGot my penis erect\n\n[Outro: Female and Asher Roth]\nFemale: \"Uhh, Mr. Roth, you have a massive erection.\"\nAsher: Don't act like you're not impressed", "year": null}]}