{"songs": [{"album": null, "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png", "year": null, "title": "I Try (Radio Edit)", "lyrics": "(featuring Mary J. Blige)\n[Talib Kweli]\nYeah, yeah\nNew Talib Kweli\nYeah, you know what it is\nCome on, come on, yeah\nHey yo *repeats*\n\n[Hook: Mary J. Blige]\nI try, I try (that's all we can do)\nI try, you know I try\nI try, I try (yeah)\nI try, you know I try\n\n[Verse 1: Talib Kweli]\nK. West!\nKweli is ??? on the plane, Arabic first name\nDisturbed by the fame just like Kurt Cobain\nBreath of life, kiss of death, my lips pursed the same\nYou flirt 'til she came\nNothin' hurt like the pain and torture\nDaughters of the dust lookin' for a vein\nSomething to take in vain like the Lord's name\nPut your hands together, got 'em all sayin'\n\n[Hook: Mary J. Blige]\nI try, I try\nI try, you know I try\nI try, I try\nI try, you know I try\n\n[Verse 2: Talib Kweli]\nYo, it's all ghetto in gear higher, the floor settle\nMore metal for beef that we don't let the law settle\nI try to navigate the treacherous waters of\nAmerica's ghettos that set up the slaughteres\nBut there's more of us\nAlthough we speak in different languages\nWe all pretty familiar with what anger is\nYoung and dangerous, ???\nGet up on some gangsta shit\nGuns to bang ya wit'\nAnd we put it on records to entertain ya wit'\nI'm grown with pains way deeper than my receivers\nOur uniforms is white sneakers and white T-shirts\nOn top of wife beaters\nWe like to light reefers\nThe 'hood need us for rappers, just ain't the right leaders\nI put a lot into it\nThis is my product and I gotta move it\nStop the industry but you can't stop the music\n[Interlude: Mary J. Blige]\nAn upside down kingdom where life is just not fair (upside down kingdom)\nSome many sufferin' cuz deep inside they're scared (so scared)\nFear pumped into their veins to keep them from their destiny\nWhere would they be if you and I don't care?\n\n[Hook: Mary J. Blige]\nI try, I try, you know I try\nI try, I try, I try, you know I try\n\n[Verse 3: Talib Kweli]\nYo, the things I'm seein' on the news is insane\nA stock broker shoot his kid and throw himself in front of a train\nA mother leave her baby home for two weeks all by himself\nThree years old, eatin' ketchup and mustard, cryin for help\nTryin' to bring your struggle to life\nThe label want a song about a bubbly life\nI have trouble tryin' to write some shit\nTo BANG in the club through the night\nWhen people suffer tonight\nLord knows I try\n\n[Hook: Mary J. Blige]\nI try, I try, I try, you know I try\nI try, I try, I try, you know I try\n[Interlude: Talib Kweli]\nLife is a beautiful struggle\nPeople search through the rubble for a suitable hustle\nSome people usin' the noodle, some people usin' the muscle\nSome people put it all together, make it fit like a puzzle\nCome on, say it now\nLife is a beautiful struggle\nPeople search through the rubble for a suitable hustle\nSome people usin' the noodle, some people usin' the muscle\nSome people put it all together, yeah\n[Outro: Mary J. Blige]\nI try, I try, you know I try\nI try, oh Lord I try\nEveryday I\n{*Mary J. Bliges harmonizes with the beat*\nUpside down kingdom\nOh, they're so scared\nEveryday on the news we can't look around with\nSomething somewhere\nI try, I try, you know I try\nI try, I try, I try, you know I try\nLord knows, Lord knows we try\nYeah"}], "artist": "Talib Kweli"}