{"artist": "Vast Aire", "songs": [{"title": "Cholesterol", "year": null, "lyrics": "Yeah, what, Vast Aire,; Shell Shock..\nIt's that gravy, you know what I'm saying?\nThis goes out to my beloved Family of Atoms\n(That's my word, I love them)\nThis goes out the Indelible MC's - you know they STAY unmovable\nThis goes out to Bay of Pigs Hail rock\nPower Kingdom, last but not least\nGolden Money Clan, You know T-1, a.k.a. Shell Shock, c'mon\nAnd I'm Vast Aire - 'nuff said\n\nNow, let us build upon this issue\nIf the Highway to Heaven is narrow, then sinners acts as fat tissue\nAnd as one can see, I have no space!\nBut I remain on the positive scale-weight of the galaxy\nWhat, you wanna fix fallacy?\nYou can run around the world twice chasin' chastity\nWhat in the Hell possessed you? Don't you know I  m Cannibal?\nThat means when I'm rhyming that I get down to the bone gristle\nI start lickin' my fingertips in the cipher\nSee, naturally, I'm higher than\nThat's right, above any (any) homegrown\nTHC Herbal[???]provider\nBut that's beside the point\nTell me who's gonna hold the weight?\nI can't wait any longer\nI'm ready to hold plates with Jehovah\nUsing Neptune's fork, telling Zeus to move over\nI'm here before dinner\nClearing the Periodic Table of Elements off\nThen I'm supplying a tablecloth\nYo, you can catch me, analog mic hog\nI can't feel rhythms without cholesterol\nAfter all, you must learn to\nExamine the appetite\nWithin the nuclei\nWithin the presence of the omnivore's eye\nThat is I\nAnd when sunlight shines off my throat\nWe call it the solarflex larynx lorax smoke\nFor the trees\n\nThis is real life, and I'm Vast Aire\nI usually speak for calories[???]\n\nSkinny MC's trying to start somethin'\nBulimic MC's trying to throw something up\nI can fondle around the outskirts of diets\nA donut at midnight ain't nuttin'\nI'm a glutton!\nNow let's build upon this issue\nIf the Highway to Heaven is narrow, then sinners acts as fat tissue\nAnd as one can see, I have no space!\nBut I remain on the positive scale-weight of the galaxy\nWhat' you wanna fix fallacy?\nYou can run around the world twice chasin' chastity\n\nAnd all that - you nah'mean?\nIt's T-1 and Vast Aire\nThe bassline is like biscuits and gravy, nah'mean?\nYo I'm Vast Aire, I'm not a hard MC\nI'm not a hard MC - I'm Vast Aire\nI'm not a hard MC - I'm difficult\n\nI'll stand up brewin' hot pots of piety hip-hop\nThe gluttony inside of me won't stop\nYo, it won't stop\nIf you can't have your cake and eat it, you never had it\nAnyway, plus it ain't even your birthday gimme that!\nNow you cramped up  my flow has that ability\nYou should have waited 30 minutes to press play\nOh, you'e a fad MC? Well if you don't say\nYou grab at the mic, and all I see is a ribcage\nVast is the vitamin MC you never believed in\nSo I vanished you, due to malnutrition\nMCs are too bloated\nThought they were fat but they only retained water\nYou know them  the sluggish type, they get led to the slaughter\nIs you fugeze?\nThe Ethiopians praise me\nThe Black god chubby thoughts and a chubby belly\nYou feelin me? (YEAH!) You feelin me? (YEAH!)\nDo you wanna hear a little more? (HELL YEAH!)\nThe beautiful balance of life\nYou don't want me to sit on the other end of the see-saw\n'Cause you're afraid you might see more\nYou might see more\n\nT-1, he up on it, you know what I'm sayin'?\nYo, I'm Vast Aire I been on it\nVordul, he up in here... uh, what?\n\n[ad libs and samples until end]", "album": "Insideout Vol. 1 - A Fool Blown Compilation", "image": "https://images.genius.com/24845ebb3037bea700f254377153c256.600x600x1.jpg"}]}