{"artist": "50 Cent", "songs": [{"album": "Guess Who’s Back", "image": "https://images.genius.com/2eca458210218b7a1ae330e42b3fb03b.500x500x1.jpg", "title": "Killa Tape Intro", "lyrics": "[Intro: 50 Cent]\nNew York City, you are now rocking with 50 Cent\nAre you ready? -- I said are you ready?\nSee, you with me, nigga? Drop that\nPaper for a hooptie, but I wanted a drop\nG-Unit -- something new\n\n[Intro]\nI'm not that nigga in your video\nI'm not a trick, I don't love the hoes\nAnd niggas know I be on the low\nWhen I gets my dough and I twist my dro\nI'm not that nigga that you think you know\nI walk around with a big fo-fo\nYou front on me I'm gon' get at you, dawg\nI be right at your crib waiting at your door\n(What up 50!)\n\n[Verse 1]\nComing up I ain't have much, I wanted a lot\nI had paper for a hooptie, but I wanted a drop\nSo you know I had to make something out of nothing\nLike turn an empty spot into a crack spot pumping\nHustled hard, at nineteen I bought a Benz, I did\nThe older niggas really wasn't feeling the kid\nTrying to find where I live so they could run in my crib\nBut you can't hustle a hustler, I peeped it and slid\nBack then niggas used to call me Boo\nIn six months I sold a million gold tops on Guy Brewer\nCountry came around, he's into clapping and\nCountry left, same shit started happening\nLike, \"He shot Rob for some ends, Rob shot Joe over some skins\nCory shot you and we was friends, money turned boys into men\"\nThe cycle never changes, shit just starts again\n\n[Interlude]\nNaw, nigga, ain't nothing changed, nigga\nYeah, I've been gone for a minute, but I'm back\n\n[Verse 2]\n(Damn 50, good to see you back in the hood)\nYou see my cherry red SL, nigga -- I'm doing good\nSometimes I can't find the words to say how I feel\nSo I take a quote from Menace -- \"look at the wheels\"\nI'm addicted to stunting now that I'm holding something\nI got a trunk full of guns from VA today\n(Oh, nigga, let me hold something?)\nNigga you high or something?\nI don't play games, I'm bout my money, nigga -- buy something\nI got a few 5ths, I got a few 9's\nHere nigga take one, catch a jux and bring me mine\n\n[Outro]\nYeah, don't ever say I don't do nothing for you, nigga\nYou know, don't say I didn't look out for you, knowhatImean?\nBut make sure, nigga, that you go catch some jux\nWhen you come back you gonna have my paper for that thang thang, knowhatI'msayin?\nI don't want it back nigga, don't try to use it then give it back to me\nCause I could see y'all niggas now running around saying\n\"50 getting all this rap money and he won't help us\"\nSit tight, nigga, I'm coming, you know? New shit\nAll the shit I put out on the mixtapes is for the mixtapes\nI got a million\nOh my God -- my shit is so hot right now; I'm in the zone", "year": "2002-04-26"}]}