{"artist": "Cam’ron", "songs": [{"title": "Chitty Chitty Bang Bang", "album": "Public Enemy #1", "year": null, "image": "https://www.google.com/url?sa=i&rct=j&q=&esrc=s&source=images&cd=&cad=rja&uact=8&ved=0ahUKEwi2u4WP5NLXAhVhc98KHU4mDUUQjRwIBw&url=https://themovementmoveson.wordpress.com/tag/camron/&psig=AOvVaw0PqY462e9oHKbAM4wTBtdO&ust=1511460724194353", "lyrics": "G.O.D!\nYo, see all of us got goals (like what?)\nMines are different duckin pot holes\nNot to mention Glock holes (true)\nYou can not dose, not when yah rock froze (uh-oh)\nHere come officer rizzo, snot nose (fagget)\nPulled me out the car man you bluffin me\nThen started cuffin me, what up with all the fuckary\nUndercovers pulled up.? fuck the d's (fuck them)\nMy attorney comin, I'm gettin chucky cheese (bitch)\nTuckin trees, took me to the 32nd (ball headed nigga)\nSargent happy, coke, crack, murder weapon (what I do this time?)\nNo, but Giles know how we do things\nChain off, belt please, don't forget your shoe strings (shoe strings)\nCalm down killa, we don't need your mood swings\nAnd the bull pen it look like a tru bing\nI told him stop it, cell you can quit or lock it\nWhat's the bail dog? this shit in my pocket? got it\nThey'll agree cause money the best texture\nOne through one some one else you best pester\nSave your best lecture\nMy lawyer is comin down dog, on a chopper from Westchester (what for?)\nNew jack city, I ain't the gutter man, (nope)\nBe at your mom's crib, we call it the mother land, (mother land)\nHundred on this wrist, hundred the other hand\nOn the other hand the rims look like they in rubber bands and\n\nFor my dudes that's strugglin, in the hopes of bubblin\nBut they still ain't duoblin, the maze we livin in\nWe find it puzzlin, some do murders other kids is smugglin\nLike chitty chitty bang bang, bang bang\nChitty chitty bang bang, chitty chitty bang bang\nBang bang, chitty chitty bang bang\n\nDon't get funny with me, just get honeys with me (hoes)\nAnd really fuck honeys, just get money here me like (Killa)\nI can feel the adrenalin, adjectives agitate, synonym cinnamon (Scrilla)\nBaby girls why you tremblin?\nYes we gangsta, but we also gentleman\nGrabbed her waist, then I kissed her dimple then\nTold her that her net cause she more tennis then wimbledon\nBaby you riddlein, cause you dealin with middlemen\nHad the rainbow 6, used to call it my skittle benz (like that)\nYou should check me out (out)\nSee my name ain't Malcom can't x me out (at all)\nI mean my last couple deals done sent me out (what for)\nDo you know what dipset about, let's be out (let's go)\nUndercovers pulled up, yes sweet route (route)\nGourgous car, sexy house, boat on dock\nFloat on ock somewhere, by the lochness\nGirls say I'm the definition of a hot mess (hot mess)\nTell em bring yah man girl he not fresh (fresh)\nCall me the release when you got stress (got stress)\nI don't care about your fat ass hot chest (not at all)\nI got bitches everywhere hoe I'm not pressd\nAnd I'm not impressed, red dot, and I got him\nShot him, and popped him, dropped him\nI'm from the bottom yes!\n\nFor my dudes that's strugglin, in the hopes of bubblin\nBut they still ain't duoblin, the maze we livin in\nWe find it puzzlin, some do murders other kids is smugglin\nLike chitty chitty bang bang, bang bang\nChitty chitty bang bang, chitty chitty bang bang\nBang bang, chitty chitty bang bang"}]}