{"songs": [{"image": "https://images.genius.com/3cea3f78903751bf659783f67012fc7b.1000x1000x1.jpg", "year": null, "lyrics": "[AMG]\nYeah.. whassup y'all?\nIt's a 304 thing baby\nSnatchin the hoes and the loot..\n\nSmack it up, flip it, fly honey dip it\nI never bone alone, I got a nine in chrome\nI used to be out of luck, now when I get a boner\nIt often means vagina miner get to the moaner\nI mean really cause it's silly ? bumps that I broken\nI guess you're gettin dumber ? in the summer\nI didn't know a rap song could make your jock that long\nWhere's your mattress, is it strapped off?\nI got a girl, now my dick it need a little rest\nCan't be a freak, AIDS killin niggas every week\nSo when I see the booty on a cutie\nGot to turn the other cheek\nWord to the diggidy diggidy D\nSo now I got damn groupie on my snoopy\nA year ago, now you're up in the butt\nThough I didn't know, that I would know, so many is good hoes\nBy the look that you chose, you're undercover pros\nPraise the Lord, bless your soul\nIn your Gap and your tight clothes and your fake gold\nI forgot the hair, gettin paid for your derriere\nShakin it and bakin it, while a nigga steady takin it\nFor a ride in a Benz or a Beamer\n304 have you seen her? Have you seen her?\nAM, pump with the trunk of funk\nWon't luck fuck for a trunk of stuff\nWouldn't give me the play when I was Jay, now I'm G\nShe got the okay, she seen my CD (bitch)\nAnd oh how she jocks\nCallin in my shit on the Video Jukebox\nBaby, I won't say maybe, I just say noooooooo\nDon't be a 304\n\nDon't be a 304 (4X)\nDon't be a 304\nDon't be a 304 (3X)\nC'mon baby\nWhat you want my loot and my ducts, and the dingaling?\nDon't be a ho\n\n[AMG]\nNow for the deuce, fans wanna know who is who\nTres with the bass, mo' go 304 is a groupie\nStompin, AMG ain't from Compton\nBetter yet Bed-Stuy, N.Y\nSome of ladies wanna know why I say bitch\nTo get rich or to make a point about a trick\nA bitch is a woman who sucks and fucks\nA dumb nigga for his duc's and bucks\nA ho is a girl that'll do the same\nWith no shame, and less game\nAnd baby, I don't want neither\nBitches or hoes, I keep my shit in my Girbauds\nOr wrap it up tight in a jimmy hat\nFor a red bombudd and a hootie mack\nL.A., home of the one night stand\nLike playin craps with your dick in your hand, you understand?\nSo this is for the college and the high school crew\nCause y'all be out fuckin like a zoo\nYou better quit, before your dick goes\nFuckin with the trick hoes, don't be a 304\n\nDon't be a 304 (4X)\nHell yeah, ya know ya know ya know\nDon't be a 304\nDon't be a 304 (3X)\nYeah my man, aww yeah\nUhh, uhh, uhh\nDon't be a ho\n\n[AMG]\nAwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww shit\nFor the ninety-two, peace, to Penthouse\n304\nMy nigga Mo' Dough\n2nd II None, DJ Quik\nMy man J.C.D\nAnd Bo$$ is definitely in the motherfuckin house\nI'm gone.. peace!\nYeah.. y'all stay tuned\nAMG for the ninety-three\nYou know what I mean?\nAww yeah\nYo, yo Tres, cut me out man, I'm gone", "title": "Don’t Be a 304", "album": "Trespass: Music From the Motion Picture"}], "artist": "AMG"}