{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "Destiny", "album": "Perception", "year": "2017-10-06", "lyrics": "[Intro]\nI talk to God like, \"What's next for me?\"\nI'm just fulfillin' my destiny (destiny)\nFulfillin' my destiny, yeah\nI talk to God like, \"What's next for me?\"\nI'm just fulfillin' my destiny (destiny)\nI'm just fulfillin' my destiny, yeah!\n\n[Verse 1]\nI told y'all I'm a psycho\nAin't no tellin' what I might do, yeah\nDoubt put his hands around my throat, so I cut him off\nThat's what you get for steppin' on my toes\nAt the top of the key, that's an iso\nMy career about to take off, flight mode\nYou don't like where we're headed, what you sittin' on my flight for, huh?\nYeah, they said, \"Wait until your time comes\"\nNope! Time's up\nYou put in the album, got you thinkin' it's your birthday, woo!\nYeah, I'm full of surprises\nA lot of pressure on the records, so you know I'm makin' diamonds\nTell me, how would you define this?\nYou witnessin' the finest\nYeah, you never know what you can do until you try it, ah!\nI been workin' late nights like I'm Letterman\nHe ain't workin' anymore? Well forget it then\nSomebody get the sedatives\nToo late, yeah the lightbulb's off in my head again\nWhere is Edison for my adrenaline?\nRushin' through my veins like it's never did\nWhat good is the body, man, if you ain't got the head with it?\nSince a kid up I've been a pessimist\nI like to focus on the negatives, oh Lord!\n\n[Pre-Chorus 1]\nI talk to God like, \"What's next for me?\"\nI'm just fulfillin' my destiny (all day!)\nYeah, my pops told me he was proud, I don't think he knew what that meant to me\nYeah, you try to take advantage of me before you die, you'll be dead to me (all day!)\nBefore you die, you'll be dead to me\nLaugh when they question me, y'all ain't no threat to me, yeah\n\n[Chorus]\nI'm just fulfillin' my destiny\nI'm just fulfillin' my destiny (all day!)\nTo the death of me, I'm just fulfillin' my destiny\nI'm just fulfillin' my destiny\nI'm just fulfillin' my destiny (all day!)\nTo the death of me, I'm just fulfillin' my destiny\n\n[Verse 2]\nYeah, you know I keep it real honest\nReal topics, ain't no way I will stop it\nChills watching everything that's going on around me, they wonder if I still got it\nI'm still rhymin', just another day in paradise, Phil Collins\n'Til you put your hands on me, yeah, now we got a real problem\nPay homage, make comments\nWe in the same genre, but I can guarantee we don't put out the same product\nGet away from me, there ain't nothing you can say to me\nTried to roll my name through the dirt, that's fine, I was made from it\nYou ain't made it 'til they printin' shirts with your face on it\nOutside tryna sell 'em at your shows, those are fake, dummy\nThis is something can't nobody ever take from me\nNo mistakin' me, take a blade to me, take a vein from me\nLet me know what you get when you pull the DNA from me, woo!\nNo matches, I've been the baddest, no way to match it\nYou never seen the passion that's even half this\nI'm wreakin' havoc\nI think the fact that you think I'm average is kinda madness\nSo quit your naggin', you couldn't fathom what I've imagined\nForget the mansion, I'm in the attic\nIt's pretty graphic, but had to happen\nYou won't see it, get your glasses, forget the status\n\n[Pre-Chorus 2]\nYeah, I feel like we might be on the come-up (all day!)\nKnew I was a problem how I showed up (ayy!)\nDid not have to sell out, but the show does (all day!)\nThey ask me why I do it, so I told 'em (yeah!)\n\n[Chorus]\nI'm just fulfillin' my destiny\nI'm just fulfillin' my destiny (all day!)\nTo the death of me, I'm just fulfillin' my destiny\nI'm just fulfillin' my destiny\nI'm just fulfillin' my destiny (all day!)\nTo the death of me, I'm just fulfillin' my destiny\n\n[Chorus]\nI'm just fulfillin' my destiny\nI'm just fulfillin' my destiny (all day!)\nTo the death of me, I'm just fulfillin' my destiny\nI'm just fulfillin' my destiny\nI'm just fulfillin' my destiny (all day!)\nTo the death of me, I'm just fulfillin' my destiny"}], "artist": "NF"}