{"songs": [{"year": "2015-03-02", "album": null, "image": "https://images.rapgenius.com/5e64677831b6775d34bf583697962241.500x500x1.jpg", "title": "All Day", "lyrics": "[Intro: Kanye West & Theophilus London]\nAll day, nigga\nDance, ayy, ayy ayy ayy\n\n[Chorus 1: Kanye West]\nAll day, nigga\nHow long you niggas ball? All day, nigga\nHow much time you spent at the mall? All day, nigga\nHow many runners do you got on call? All day, nigga\nSwish, swish, how long they keep you in court? All day, nigga\nTake you to get this fly? All day, nigga\nTell your P.O. how-how long you been high? All day, nigga\nYou already know I’m straight from the Chi, all day, nigga\nSouth, south, south side! All day, nigga\n\n[Verse 1: Kanye West]\nThis Ye, nigga\nShoppin' for the winter and it’s just May, nigga\nBall so hard, man, this shit cray, nigga\nAnd you ain't gettin' money 'less you got eight figures\nFor that Jesus piece, man, I've been saved, nigga\nJust talked to Farrakhan, that's sensei, nigga\nTold him I've been on ten since the 10th grade, nigga\nGot a middle finger longer than Dikembe, my nigga, uh\nI don't let 'em play with me\nI don't let 'em talk to me no kind of way\nUh, they better watch what they say to me\nNiggas still gettin' popped on the day to day\nYeah, I still got the hundred with the small face, nigga\nMight spend 50 racks on my off day, nigga\nYou a fake Denzel like the Allstate nigga\nIf you run into me, better have Allstate with yah\nYou a Rico Suave nigga\nRide 'round listen to Sade, nigga\nIf you ain't with us, you in our way, nigga\nYou an actor, you should be on Broadway, nigga\n'Cause you do shit the broad way, nigga\nYour bitch got a ass, but my broad way thicker\nLate for the class, in the hallway, nigga\nYeah, the dropout at it as always nigga, as always\nAll day, nigga\n\n[Refrain: Allan Kingdom]\nI took a young sweet breath, and I reached into my Earth\nGave him what I had left\nAt that moment I dispersed\nAt that moment I dispersed\n\n[Chorus 2: Kanye West]\nAll day, nigga\nHow-h-how long you ball? All day, nigga\nHow much time you spent at the mall? All day, nigga\nHow long it take you to get this fly? All day, nigga\nTell your P.O. how-how long you been high? All day, nigga\nPour some Hen out for my niggas that died, all day, nigga\nAnd I keep a bad bitch on the passenger side, all day, nigga\nYou already know I’m straight from the Chi, all day, nigga\nSouth, south, south side! All day, nigga\n\n[Verse 2: Kanye West]\nI could do this all day, boy, I'm finna turn this bitch out\nThey need that Ye in the streets, boy, there's been a mothafuckin' drought\nDon't really matter what I make, boy, you know I still go wild\nLike a light-skinned slave, boy, we in the mothafuckin' house!\nRight now, you lookin' real sus right now\nI swear I've been on this flight like a month right now\nStupid niggas gettin' money, Forrest Gump right now\nShout-out to Jackie Chan, I need to stunt right now\nThey've been lookin' at the Gram, I've been lookin' at the Grammys\nLike, huh, that's us right now\n24/7, 365 days, everybody gettin' paid\nNiggas lookin' at me like I'm worth both MJs\nPeople saying, \"Ye, Ye, take it easy\"\n20 Gs for the Yeezys off of eBay\nNiggas do the most and they ain't done shit\nOnly way I can sum it up, sumbitch\n\n[Bridge: Theophilus London (Kanye West)]\n(Hands up, hands up, hands up)\nHands up, hands up, hands up\nSo won't you dance? ayy, ayy ayy ayy\n(All day, nigga)\n\n[Refrain: Allan Kingdom]\nI took a young sweet breath, and I reached into my Earth\nGave him what I had left\nAt that moment I dispersed\nAt that moment I dispersed\n\n[Break: Kanye West]\nGet low, alright\nGet low, alright\nWhat up? Alright, alright\nStay low, alright\nStay low, alright\nStay low, alright\nSouth, south, south side! All day, nigga\n\n[Guitar Interlude: Paul McCartney]\nWhistling\n\n[Outro: Paul McCartney]\nWell, well, well, let me run (let me run)\nLet me run to see who came undone\nYou've been right in my face\nLet me run 'til you're off my case\nWhooooa, whooooa\nWhooooa, whooooa\nWhooooa, whooooa\nWhooooa, whooooa\n\n[Produced by Velous, Kanye West, Diddy and Charlie Heat; Co-produced by Mike Dean, French Montana and Noah Goldstein; Additional production by Plain Pat, Travi$ Scott, Allen Ritter & Mario Winans]"}], "artist": "Kanye West"}