{"songs": [{"lyrics": "[Intro: The D.O.C.]\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. is the place!\n\n[Eazy-E]\nI'm not a renegade but you wish I would\nJust because I like to hang with the boys in the hood\n\n[Ron-De-Vu]\nLive in L.A. always chill on the west coast\nA Tilly Mogul got it close just I mean to boast\n\n[Eazy-E]\nI said what's up, we'll be who riding on you\nNickname Eazy-E, and I'm down with the crew\nYou come talking that trash, we'll pull your card\nIt's not the Bronx, it's L.A. but just as hard\nDon't get me wrong I like to brag on the city I own\nThe Subway R-T-D, don't ride it alone\nYou might have silly thoughts, that were insane\nBut the city I'm from, let me explain\n\n[Hook: Ron-De-Vu]\nIn L.A. there's things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet, or get took off\n\n[Hook: All]\nY'all know the time, it's time to get ill\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nThe city of angels.. Hollywood.. We love it!\n\n[Eazy-E]\nI turned you on to the best females in the world\nI wish they all could be California girls\nLike the east where your girls wear too many coats\nBring your clothesie, runny noiseie, with a sore throat\nThat the girls in the south, I cannot bust\nBecause the girls are fly, and down with us\nIn the valley not the alley, misdemeanor not ball-ey\nEazy-E, that's me, always chill in Cali'\n(Hollywood's a bit of beef), where the scene is raw\nOhh yeah, the strip is a trip on (South Crenshaw)\nDon't get me wrong I like to brag on the city I own\n(Boy you walk do what?) don't walk alone\n\n[Hook: Ron-De-Vu]\nBecause in L.A. there's things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet, or get took off\n\n[The D.O.C.]\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. L.A. L.A. L.A. L.A. L.A. L.A. L.A\nL.A. is the place!\n\n[DJ Yella Scratches quotes from below]\nBuild with the brothers who build the old school --->\nGet a.. get a.. get a little some of that.. BEAT BOX --->\nGet get get a little some of that beat box --->\n\n[Ron-De-Vu]\nWest coast style, from L.A\nYes I gets mine, it's got to be that way\nIt's sunny California that's where I be\nIf you forgot homeboy I chill with E\nIn the west I stand that's where you fall\nFila wearing a punk goes snatching it all\nRhyme by rhyme record by E\nIn the city of angels, with a devil like me\nShe's contaminated where the boys are hard\nAnd people like me don't perpetrate the fraud\nYou want to mess around, you better get wise\nWe'll find your butt, and cut you down to size\n\n[Hook: Ron-De-Vu]\nBecause in L.A. there's things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet, or get took off\n\n[Hook: All]\nY'all know the time, it's time to get L\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nWe moved back to L.A. ~ Cal-I-forn-ia\nCity of angels.. Hollywood.. we love it\n\n[Hook: Ron-De-Vu]\nBecause in L.A. there's things you do not do\nFirst of all, homeboy, don't mess with the crew\nYou might have silly thoughts that we're too soft\nBut don't play it sweet, or get took off", "album": "N.W.A. and the Posse", "year": "1987-11-06", "title": "L.A. Is the Place", "image": "https://images.genius.com/1c81d51b13dc4236b4af0e1838b85b8c.600x600x1.jpg"}], "artist": "N.W.A"}