{"songs": [{"year": null, "album": "Troubadour", "image": "https://images.genius.com/2d335571e608b43f30bd8a89e1fa6d38.1000x1000x1.jpg", "title": "Does it really matter?", "lyrics": "[Intro]\nYea, uhhh.. Its K'naan.. Yea, uuhh. About to take over with this, here we go I check it...\n\n[Verse 1---K'naan]\nThey don`t expect me on this beat, the thunder on the street\nBut I never turn the cheek, surrender or retreat\nYou can bet that I am strong, trying to right what is wrong\nThey say it won't be long, keep on singing your song\nBut ayo you need a single, single to make a mingle\nSomething that's kinda simple, I'd hate to call it jingle\nA single is a missile, takes you right to the middle of 106 and park and maybe Jimmy Kimmel\nYou'll need somebody famous co-signing for your anus\nWho you got on the album I don't see where the name is\nBut I do it my own way I do it my own way I do, if you do what you do your own way you could be famous too\n\n(CHORUS)\n\nIf the beat is hot does it matter where or who its from?\nIf the flow is hot does it really matter where I'm from?\nIf the song is hot does it matter cause the DJ dumb?\nIf the girl is hot does it really matter where she's from?\nIf the beat is hot does it matter where or who its from?\nIf the flow is hot does it really matter where I'm from?\nIf the club is hot does it really matter how we bump?\nIf the girl is hot does it really matter where she's from?\n\n[Verse2---K'naan]\nI coulda been from the west side or the Chi-Town like twista\nWith a flow so sick it blow you to bits it will show you the glits and gold in the wrist and the boat in the fish and I blow them a kiss, -?lets blow give them em a sweet talking in a piss while taking a piss?- are you talking to the fish or the girls in the boat exposing their tits\n\nI coulda been from N.Y. like Rakim with the my pen\nI can get paid in full  with praise and tools erased and rules my case of jewels I'm cold like a glacial cool with blades and fools I'm raging bulls\n\nI coulda been from L.A like Dre and Snoop\nRolling in my six-four with fresh case jewels\nAnd I'm riding on 'em niggas unless they cool\nAnd I got border troubles like 'em essays fool\n\nI coulda been- I coulda been from the dirty like A town or M.I.A\nI could ride an invisible motor cycle and go HEY (echo hey hey)\nStorm like the hurricane and I don't mean ay-bay-bay\nI'm from Africa where they say K'naan- boom-aye-ay\n\n(repeat chorus)\n\nIf you wanna make it hot then you better do a drop (echoes drop drop drop drop drop drop...)\nIf you wanna get a hit you better auto-tune this shit (shit, ooh yea...)\nAnd he is tougher than you suckers none of you could ever bark at him\nLook at him make you tough guys look like you are from suckatem\nI do it my own my own my I do it my own way I do...If you do what you do your own way you could be famous too\n\nRepeat chorus (x2)"}], "artist": "K’naan"}