{"artist": "Fat Joe", "songs": [{"year": null, "album": "Jealous Ones Still Envy (J.O.S.E. 2)", "image": "https://images.genius.com/4b84a410c9b855ea9a89253794bfc54b.500x500x1.jpg", "lyrics": "[Intro: Fat Joe]\nAiyyo Schife (heh)\nWe don't give a fuck about that recession\n\n[Hook: Benisour]\nBitch I'm on the grind (grind) movin them cupcakes (cupcakes)\nThen bust open that duct tape (pow)\nI'mma show ya how to do a thing with a (thing with a)\nShow ya how to run a team with a\nBitch I'm on the grind (grind) movin them cupcakes (cupcakes)\nThen bust open that duct tape (pow)\nNigga let me show you how to work that (work that)\nDrop it in the water, watch it double back\n\n[Fat Joe]\nI got that white bitch (white bitch) call her Rachel Ray\nShe's the best in the kitchen, have you niggas scrapin plates\nGot that hard shit, the soft shit, anyway you want it\nGot that mac if they talk shit, don't nobody want it\nWith the G to the O to the D of the ghetto\nYeah we stays on that rock shit, packin heavy metal\nGot that BASS~! (Bass!) I ain't talkin 'bout no treble\nI am a menace to society, a motherfuckin rebel\nYeah she's askin for the scissors but I hit her from the back\nYeah she calls me hugs and kisses but you could just call me Crack\nGot them goonies with me niggas and them flags is off black\nCouple cuffies in the duffies and we headed for the track (bitch!)\n\n[Hook]\n\n[Benisour]\nSportin new rocks in the kitchen workin two pots\nTell 'em supper's ready; time to feed the block\nGot them cupcakes movin like clockwork\nWet sittin on sixty-seven, one vert'\nGrippin grain; ridin with them cupcakes\nY'all green-ass niggas don't touch weight (naw)\n750 a cup, that's what it's goin for (goin for)\nWhite girl on deck, do you know her brah? (Ha!)\nAnd I can introduce you to her brother too (brother too)\nAnd he'll have you ridin in that purple Coupe (yeah)\nPut a five on him man and see what he do (what he do)\nUnless you be another greedy muh'fucker you\n\n[Hook]\n\n[Fat Joe]\nCupcakes! (Cupcakes!) Yeah who want them cupcakes?\nGot 'em for the low, watch me bust open that duct tape\nWant a Little Debbyie, we call that bitch jailbait\nAnd need a whole ki', well that's a-called bail cake\nA thousand of the butter watch it spread through the hood\nIf you get it how I get it you be shittin if you could\nWhat you niggas constipated? Yeah we drug related\nThrowin money out the sunroof, screamin out \"We made it!\"\nWith my Palm Beach niggas, Schife on the track\nIt's a slow flow killer like a knife in your back\nYeah I'm nice with the raps, nicer in the kitchen\nTell the judge suck my dick, I'mma serve him in the prison\n(Bitch!)\n\n[Hook]\n\n[Outro: Fat Joe]\nYeah! Benisour we don't see no recession nigga\nEvery time you see me; clean nigga\nMy sneakers is clean - they sick!\nMy luggage clean; my top is off the bitch is clean!\nThem diamond is clean\nLot of y'all fuck niggas be havin them dull ass diamonds\nHahaha, AOW!\nBenisour! Crack! Terror! Yeah\nT.A. I see you nigga, Macho I see you nigga\nDrop I see you nigga, Uncle Stan, it's on now nigga\nWe gon' hit that fuckin Forbes nigga\nWe gon' get it bitch\nOh yeah, Schife on the track, AOW!", "title": "Cupcake"}]}