{"artist": "R. Kelly", "songs": [{"album": "TP.3: Reloaded", "year": "2005-07-05", "lyrics": "[R. Kelly talking]\nThere's alot of guys out there blamin' other cats\nFor takin they woman\nImma put it to you like this\nI tell ni99az hey\nDont bring your woman to the club\nDont bring your main squeeze to the club\nYou what I'm sayin'?\nUnless your game is tight\n'cause if yo game ain't tight\nAnd a ni99a walk in and his game is tight\nSh****t...you f*ck around lose yo woman\nYou know what I'm sayin'?\nIf yo game ain't tight\nQuit bringin yo woman to these muthaf*ckin clubs dog\nAnd blamin other ni99az for takin yo woman\nAin't nobody take yo woman no way\nIf yo woman chose sumbody else then sh**t yo game ain't tight (uh huh...thas right)\nSo quit runnin around here b*tchin\nAnd tightin up ya game\n[Baby]\nYeah Okay (okay) Kells Stunna Ghetto thriller\nI smell ya boy (sniffing sound)\nCome on Kells Boy!\n\n[Chorus:]\nPull up in the whip and the girls go (crazy)\nBeen to the club and the girls go (crazy)\nA sip of hypnotic and the girls go (crazy)\nPut the cut on and the girls go (crazy)\nPull down the pants down and the girls go (crazy)\nRoll it around and the girls go (crazy)\nA stroke of the -- and the girls go (crazy)\nAll I wanna do is make the girls go (crazy)\n\n[Verse 1 (R Kelly)]\nI ain't tryna brag but man I'm the coldest\nChics around me catch chills 'cause I'm frozen\nR&B queen top gun and Im loaded\nEverything you here in your jeep I wrote it\nIf it ain't good life man I dont live it\nIf the raps hot then baby musta did it\nAin't no time fo playin games yo\nGotta get this money and cop the Range Rov\nGet the new coupe put em on them 24's\nAnd get a Hummer V Impala with the plenty H*es\nNow holla when you see me on ya block\nSurround the lex when u see me on the block\nLadies dance like a party on yo block\nAnd we got the whole industry on lock\nMan I tell you this chic is sumthin\nMovin azz like she a snake or sumthin\nMan ya'll ain't even gotta pay me\n'cause for free Imma drive her crazy\n\n[Chorus]\n\n[Verse 2 (Baby)]\nI ain't got nuthin but money out the azz hole\nBig money big stuntin how the game go\nNew benz new hummer with the tag low\nShake your body get them dollars off the dance flo\nIm in the club and Im puffin on (Haze)\nMe and Kelly wit a whole lotta (ladies)\nI got cash thats a whole lotta (gravy?)\nOn ya azz if you ever try to (play me)\nNi99a'z think they ballin' spend a hundred on a jeep (yeah)\nMillionaire ni99a spent a hundred on they teeth (yeah)\nTurn back around and spend a hudred on a freak\nJewel game up spend a hundred on a piece\nIts a fantasy (ni99a) what they callin yachts\nBig cribs Miama my yard is blocked\nMean cash on the floor its all from rocks\nYa'll dont understand D boys are hot\n\n[Chorus]\n\n[Verse 3 (R Kelly)]\nYo Baby\nYou dont the blue Kool-Aid got a ni99a tipsy\nTwins feelin on me man like they tryna frisk me\nWhat am I to do?\nLay em' both down and make em' go oooh\nBass pumpin\nSpree wells\nWhos that rollin up?\nIt's Kells\nAnd girl if you feel like me\nYou wanna have sex on the 1st day like me?\nYou can climb in the whip\nSpend lots of chips\nHit the beach wanna skinny dip like me\n[Baby]\nHey Kel they lovin you and me\nHypnotic and E got her grittin up teeth (ah)\nFuck that let a freak be a freak\nPop one Pop two drinkin Hennesy\nMama need some mens (got her work cut out for you)\nMomma need a benz (got a roof cut out for you)\nKinda short up on yo rent (got a whole new house for you)\nAnd dont worry what I spend (Let the freak come out of you)\n\n[Chorus]\n[R Kelly]\nGet bent till the early morn (we gon)\nGet high till the early morn (we gon)\n26 till the early morn (wit a)\nGet a hotel till the early morn (we gon)\nHit chics till the early morn (we got)\nHangovers in the early morn (we gon)\nRide out in the early morn\n'cause the party dont stop till the early morn\n[R. Kelly Talking]\nKells Birdman TP3 ya'll Reloaded", "title": "Girls Go Crazy", "image": "https://images.genius.com/658880b491113b62158546967c1ea041.220x220x1.jpg"}]}