{"songs": [{"title": "D.T.B. (Interlude)", "album": "Artist", "year": "2016-02-14", "image": "https://images.genius.com/2761436d8e81c60c2e2350e0893a2455.600x600x1.jpg", "lyrics": "[Part I]\n\n[Intro]\nPlugStudios\nWhat the fuck, I'm 'posed to fall in love with you?\nBitch, I should've never even...\n\n[Verse 1]\nWhat the fuck, I'm 'posed to fall in love with you?\nBitch, I should've never even fucked with you\nTrust issues, that shit made me feel uncomfortable\nI should've never made you feel like I was stuck with you\nYou ever had somebody say that they was down for you?\nThey made it feel so real like they really down for you\nThey clown on you every time they turn around on you\nThey not loyal, they happy, they lookin' down on you\nYou really jacking, you don't fuck with me\nNow I feel like you never kept it a buck with me\nYou saying I ain't the daddy, that would be luckily\nI'm hoping that ain't my baby, that shit gon' fuck with me\nYou had me looking like a clown, bitch\nThat other nigga gon' fuck up running his mouth, bitch\nHow I fuck him up and drown him in a fountain\nLeave that little nigga somewhere in the mountains\n\n[Chorus]\nBut now I'm like, \"What the fuck, nigga?\"\nI love money, I don't love bitches\nFuck bitches, D.T.B., no, I don't trust bitches\nFuck bitches, D.T.B., no, I don't trust bitches\nNo kissing and even hugging\n'Cause I don't wanna fall in love with it\nFuck bitches, D.T.B., no, I don't trust bitches\nFuck bitches, D.T.B., no, I don't trust bitches\n\n[Verse 2]\nWhat the fuck, I'm 'posed to fall in love with you?\nBitch, I just wanted to fuck with you\nThought you was cool to kick it, probably get lunch with you\nI never meant for shit to get so fucking comfortable\nYour niggas told you they was down for you\nBut when you fucked up, nigga, they not around for you\nThey say they with it to ride a hundred thou' for you\nThey clown on you as soon as they turn around on you\nI salute ya, you took my bitch and you scooped her\nI'm a loser, I feel like a fucking loser\nFuck the rumors 'cause I passed her back to ya\nRan through her, then I passed her back to ya\nHah!\nBut now I'm feeling like I'm, ahh!\nFuck bitches, D.T.B., no, I don't trust bitches\nFuck bitches, D.T.B., no, I don't trust bitches\nLove bitches, nah\nNow I'm like, \"What the fuck, nigga?\"\nI don't wanna fall in love with it\nI love money, I don't love bitches\nFuck bitches, fuck bitches, fuck bitches\nFuck bitches, fuck bitches, fuck bitches\nFuck bitches, my nigga, we don't fuck with ya\nMy nigga, we don't fuck with ya\nFuck bitches, fuck bitches, fuck bitches\nFuck bitches, fuck bitches, fuck bitches\nMy nigga, we don't fuck with ya\nMy nigga, we don't fuck with ya… why you fuck?\nFuck bitches, D.T.B., no, I don't trust bitches\nFuck bitches, D.T.B., no, I don't trust bitches\n\n[Part II]\n\n[Verse]\nI love money, I don't love bitches\nFuck bitches, fuck bitches, fuck bitches, fuck bitches\nMy nigga, we don't fuck… wit' ya\nSo why you fuck wit' us?\nI believed in you, should've told me you had a seed in you\nThis whole time you was frontin' and I ain't see it in you\nNow I'm thinkin' what was you doin' when I ain't sleep with you\nNow your toothbrush is my new Jordan cleaner\nI know what a ten is, you not Serena\nYou was supposed to be my dream girl\nTwo-seater, for me and you in a Bimmer\nBut now you showed me not to love bitches\nNow you showed me not to trust bitches\nFuck bitches, just hit it, never run wit' it\nHit the blunt\nForget about her when the blunt hit ya\nWho did it? Bitch, you did it\nReally thought that I was losin' it, now I'm losin'\nEver since I been in school, they been pick and choosin'\nI don't know how I go through wit' it, I go through wit' it\nThis is stupid\nBut who the fuck am I to judge bitches?\nI guess I never knew how to love bitches\nFuck bitches, fuck bitches, fuck bitches\nMy nigga we don't fuck… wit' ya\nSo why you fuck wit' us?\nFuck bitches, fuck bitches"}], "artist": "A Boogie Wit da Hoodie"}