{"songs": [{"year": "2019-06-07", "title": "Greatness", "image": "https://images.genius.com/2989d81f5ba13d08135f6ac8bc9f7747.640x640x1.jpg", "lyrics": "[Intro: Fortune Dane]\nDhope Music!\nFortuaaaane!!!\nHARMONISING\n\n[Verse 1: Sarkodie]\nI'm pushing myself to the pinnacle\nAdie a mo ye me enye physical\nMato meni ashwe Ghana rappers\nI’m sorry but kakrabi pe na eye lyrical\nRap no ada mo nko ka ne she\nFa mic ne bre me na vanishe\n2017 Kojo Cue Akan and maybe Cabum the Chedeshi\nThis is the return of Idi Amin\nYebe checke obia onni permit\nOpana be disse me what do you mean?\nWone panyin kasa to sebe\nKase nana fakye me\nWo wie pe na to weni hwe me\nMa toto me punch ne anua na maka ne she\nWana na rappe te se me?\n\n[Verse 2: Sarkodie]\nRap no maame de wo me ebo me se toma\nObia ntumi breake me record\nOnua gye wo de wadro ne woma\nObi se Sark ho ye mobo\nYenim senia wo ye wo nooma\nMese me twa meni kakra se meko akoda yese boys bi awoso madoma\nEnye mo afe ne me me mede rap to chacha\nWope mogya dodo a yede nsuo befra\nWo woye bola so gyata\nOwusu Bempah bekasa se sofo Badu Kwadwo ahu ne to pepa\nSaana menso makyere mo a ma baso wo go meho a wo be dane kwata\n\nHARMONISING\nAhhhh Yeahh Ahhhhh tie!\n\n[Verse 3: Sarkodie]\nEbo 6 O'clock a obi nyane me\nMe nrappe koraa na meho nsane me\n2Pac ne Biggie ne Terry Bonchaka\nObi beba wiase a mo mmane me\nObi fre me nyame no\nNa mote ghetto we Suya\nYekeka me ho sem a enfa meho\nMe ntu pipe mu enko ko sa ebura\nMabre wo me wiase menya ne fo\nYe difference ne se me daye so\nMenisoadehu ne se me dwom be du amanone\nWo wope hit wo Mpraeso\nRap no kura me se Volleyball\nMa kye sene obia nso but they want me more\nThe money the fame and the Rollie the bitches the house on the beach me I want it more\nCash nye problem as far as I'm\nRapping I promise ma team will be cashing out\nMa recorde dwom a ma horde me nreleasi nti ye na fans no have doubt\n\n[Verse 4: Sarkodie]\nI’m a perfectionist\nI wanna show you where heaven is\nI came in the game and I hussled my way\nBut some people they thought it was devilish\nMe then ma fans we be Ride or Die\nNea besi bia we are side to side\nSe megyae rappe akotyoke anaa se me ntoa so sometimes I can't decide\nBut I know say me nfie no aka 45\nMen I think about this all the time\nBut I no say I was ready to do this\nMe feeli koraa se menya duru me prime motherfuckers!!", "album": "Alpha SZN - EP"}], "artist": "Sarkodie"}