{"songs": [{"album": "Broken English", "image": "https://images.genius.com/8c886ea996a29ae9fa576a8640f73831.1000x1000x1.jpg", "year": "2018-02-02", "title": "Beastmode", "lyrics": "I'm About To Go Beast Mode\n\nFrom the streets of Cali down to Argentina\nI keep Rappa’s on they toes like they Ballerinas\nNon-Believers is even 'bout to call me a genius\nI do miracles on the mic, Like my name was Jesus\nMultiplyin' rhymes, like the loaves and the fishes\nWhen I’m spittin' this vicious I'm worse than depicted don't listen\nAnd, 'bout to get beaten by one of the best in the business\nI'm ridiculousness when it comes to this matha'matical composition\nStreet composer I'm the rap latin Mozart\nBeethoven mix wit’ Mel Gibson cuz’ imma' Brave-heart\n* HUAH *\nYou don’t believe me? stick around with my dogs bark\nWe'll take you out two by two like Noah's Ark\n\nYou don't want to get up on the track like that\nWhen I’m spittin' on the mic I do it just like that\nTo a beat that'll speak in the way that you need\nTo the beats in the tree in the minimal a heat\nWhen I'm flippin' an' singin' an' spittin' the venom\nAnd givin' the sound that ain't nobody bringin'\nI'm rippin' the mic when I'm up in the zone\n\nI'm About To Go Beast Mode...\nBeast...\nMode...\nBeast...\nI'm About To Go Beast Mode\n\nMy arms is L.A. my legs is Diego\nGot Uglin and 'Frisco spinnin' on top of my turn table\nSacramento is my stunta's Compton is my tan\nGot California here in the west coast in the palm of my hand\nThey say I'm, so L.A. talkin' with my Cali's\nSlang stuntin' on the Freeway doin' ninety in the left lane\nThe top down music blastin' in the Cali breeze\nWest contemplates tho' cuz I gotta lotta cheeze\nI'm so Woow, and so Proud\nThey way that I rep my soul you can say that I'm So Cal\nCuz' So Cal where my heart at now\nWhile you rappa's are so last year I'm so Right Now\n\nYou don't want to get up on the track like that\nWhen I'm spittin' on the mic I do it just like that\nTo a beat that'll speak to the sound that you need\nTo the beats in the tree in the minimal a heat\nWhen I'm flippin' an' singin' an' spittin' the venom\nAnd givin' the sound that ain't nobody bringin'\nWhen I'm on the microphone up in the zone\n\nI'm About To Go Beast Mode...\nBeast...\nMode...\nBeast..\nI'm About To Go Beast Mode...\nBeast...\nMode...\nBeast..\nI'm About To Go Beast Mode\n\nI had to back with a new swag, thought you knew that\nThey try to hold me back PSH! you can't do that!\nThe king of rap is back to take over the game\nInsane, how even Justin Bieber's mentionin' my name\nI never thought that I could get this far\nRubbin shoulders with celebs, but introduce them to the real star\nI'm livin' large like Kareem Abdul-Jabbar\nPlus I got my dream girl ridin' in my dream car\nSpit serious verses I'm versatile\nMe verses another rapper, first verse is fast\nSo first! Find a way to reverse your first style\nI'm the first to first flip lyrics that ain't found\nDon't want my converse then converse at concerts with converts turn 'em to converts\n* Spanish/Espanol Part *\n\nI'm About To Go Beast Mode...\nBeast...\nMode...\nBeast..\nI'm About To Go Beast Mode...\nBeast...\nMode...\nBeast...\nI'm About To Go Beast Mode... * HUAH *"}], "artist": "T-Bone"}