{"songs": [{"title": "Ashley", "album": "Hall of Fame (Deluxe)", "year": "2013-08-27", "image": "https://images.genius.com/27fece6af1c9ca0717550d393fff7409.1000x1000x1.jpg", "lyrics": "[Hook : Miguel]\nAnd I, I wouldn't trade it for the world, world, world\nAnd I, just so fucking lucky you're my girl, girl, girl\nAnd I, I wouldn't trade it for anything\nNo, no, no not anything and you\n\n[Verse 1 : Big Sean]\nYeah, I got a brand new Benz\nCrazy right, brand new Benz\nGot less miles on it than I do friends\nRemember when we laid at you and Paige’s crib\nWas there so long I coulda paid rent\nRemember when we couldn’t get shit?\nBest thing bout being broke is you don’t spend shit\nRemember that Christmas? We had a wish list\nWe couldn’t afford nothin' but we still get shit\nIronically those were the times I felt the richest\nAll those times that we spent by the pool girl\nWas too broke to even take you to the zoo girl\nMaybe its because I had you girl\nWas thinking about when we went to London and Paris\nAnd gave each other times that we cherished\nRemember when you saw the Eiffel Tower\nAnd you got so drunk threw up? Yup you were so embarrassed\nSee those are times I can’t let go, I can’t let go\nMan I hate to see you single in the club looking for kisses and hugs\nSo you Sipping on XO til I snatch you up like “let’s go”\n\n[Hook: Miguel & Big Sean]\nAnd I, I wouldn't trade it for the world, world, world\nAnd I, just so fucking lucky you're my girl, girl, girl\nAnd I, I wouldn't trade it for anything\nNo, no, no not anything and you\nCan't nobody do it like you do it, like you do it, like you do it, like you\n\n[Verse 2: Big Sean]\nMy bad for those long long nights, long nights when I left you in the sheets\nSorry for when you had to cry yourself to sleep\nTried to count on me and I made you count sheep\nSorry when you put your faith in me I was unfaithful, disgraceful, distasteful\nYeah I know you’re not supposed to hate cake and eat too\nCrazy how these hoes always kept my plate full\nWhat about the emails you hacked in?\nI know we hate to live in the past-tense\nIt’s been weird since I went out west and did an album with No I.D\nAnd ain’t came back since\nNow we the best in the city, I rep for the city\nThat’s about the time that you left for the city\nYou and all your girls moved to NY\nI shoulda’ known now how you watch Sex And The City\nI know we ain’t close but, I gotta focus on blowing up\nI know I promised that I’d be there, and really did I ever show up?\nI know I wasn’t honest to ya girl\nAlmost broke every promise to ya girl\nBrought problems to your world\nAnd you said “how could you just lie to me? I thought you’d die for me?”\nI was scared you’d find somebody who would treat you like you supposed to\nYou the type niggas get close to, get close to, and then propose to\nAnd when Thanksgiving come around\nI ain't tryna bring hoes through to momma\nSo it’s back to the drama\n“No I don’t know that number”\n“Why the hell you text it?”\nHeartbreak hotel man, with no exit just checked in\nYoung and living reckless\n\n[Hook: Miguel & Big Sean]\nAnd I, I wouldn't trade it for the world, world, world\nAnd I, just so fucking lucky you're my girl, girl, girl\nAnd I, I wouldn't trade it for anything\nNo, no, no not anything and you\nCan't nobody do it like you do it, like you do it, like you do it, like you\n\n[Outro: Miguel]\nI can't imagine myself without you\nI need a whole lot of help without you\nMe and my granny both agreed\nDamn you're such a G I’ll hold you down forever, B\n\n[Hook: Miguel & Big Sean]\nAnd I, I wouldn't trade it for the world, world, world\nAnd I, just so fucking lucky you're my girl, girl, girl\nAnd I, I wouldn't trade it for anything\nNo, no, no not anything and you\nCan't nobody do it like you do it, like you do it, like you do it, like you"}], "artist": "Big Sean"}