{"artist": "Fashawn", "songs": [{"year": null, "album": "Higher Learning 2", "image": "https://images.genius.com/e483145f15089213e79bccc6be96eef8.500x500x1.jpg", "lyrics": "[Hook: Fashawn]\nSome of my niggas bang, some of my niggas slang\n(?) more of the same, just gotta maintain\nHomie do what you gotta do\nHomie do what you gotta do\nStay on my grind, watch you waiting in line\nGot a 24/7 (?) do a 9 to 5\nI just do what I gotta do\nI said I do what I gotta do\n\n[Verse 1: Fashawn]\nThey got caught up in a life where it's hard to tell wrong from right\nAll along, they was lost, lust in cars and ice\nYoung niggas, in the gutter, the lawless type\nDrug charges, put 'em behind bars\nAnd kites to all my dogs, cause ain't no love lost in fights\nAmong each other like brothers, get it on, we tight\nDo whatever for a dollar, whether we slang dolo\nOr hustling any product, nothing we can't cope with\nI’m through with maintaining, trying to live it to the limit\nPasta and shrimp and like a mobster in Venice\nNo offense to my brothers with 9-to-5’s\nSome want it all, some just want to survive\nBut me? I’d rather roll up in a Bimmer\nMy momma's like I don’t need it\nIn my heart I agree, but could you picture me leaning? \nIt’s sort of bittersweet, stuck American dreaming \nI’m just trying to get a piece nigga\n\n[Hook]\n\n[Verse 2: Fashawn]\nSome of my homies slang, some of them fiends\nI look at what I became, kinda in between\nStuck, caught up in the game, living the street dream\nI'm just trying to balance it out like a triple beam\nKeep so much on my mind I might go and do a crime\nMotherfuckers telling me don't rely on your rhymes\nWhen the industry declining, niggas ain't getting signed\nI'm either one step ahead or one behind\nA couple thousand dollars is just not enough\nI come from the bottom so I gotta stunt\nPhone buzzing, oh damn, what everybody want?\nMy bad, niggas ain't seen me in about a month\nI've been hustling, trying to get it on a roll\nYou'd literally be amazed how quick I go through a zone\nBut \"more money, more problems to fix\" --\nWe all know the motto, still we trying to get rich\n\n[Hook]", "title": "Do What I Gotta Do"}]}