{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "Nightshift", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "\"You talkin just like a pimp!\"\n\n\"You see pimpin's big business\nAnd it's been goin on since the beginning of time\nAnd it's gonna continue STRAIGHT AHEAD\nTil somebody up there turns out the lights on this small planet.\"\n\n[Positive K]\nAllow me to propose a toast..\n\nAllow me to propose a toast\nFrom the Pos and not the Dean Martin celeb roast\nIn this event I've come to swing\nBust a move, present a crown for the king\nThe true black mack with a knack to attract a stack\nGirls attack, I spin dem out like crack\nI say, \"Cupid, draw back your bow, let your arrow flow\nAnd yo.. hit the ho!\"\nSo let me work my maneuver\nThere's none smoother, so you know that I'ma soothe her\nAnd uhh, when I start to shoot the gift\nThe next day, I got you workin' on the nightshift\n\nI got you workin' on the nightshift\nI got you workin' on the nightshift\n\n[Big Daddy Kane]\nThat's right, Pos baby\nYou gotta school these young macks comin' up today, y'know\nI mean to be 'frank', they just hot dogs\nThe girls are relish, and they need to ketch-up on they pimpin'\n\n[Positive K]\nPositive! Oh yes, the fly pimp\nI do my thing but I would never attempt\nTo brag or boast, to try to say that I'm the baddest\nWhen it comes to this, [bitches] know my status\nRidin' with Kane in a Mercedes\nFlashin' high-beams, amongst all the young ladies\nThey step up askin' me to get in\nBut you know my motto: no skins, no Benz (heh)\nI give the kiss of death, just like Blackula\nBefore you know it, I'm like a mack to her\nOne whiff of the gap shot swift\nAnd quit your day job, 'cause now you're on the nightshift\n\nI got you workin' on the nightshift\nI got you workin' on the nightshift\n\n[Big Daddy Kane]\nCheck it out, I go by the name of...\nWell for the time being let's just call me 50 Grand\nBecause umm... hehehe\nThere's 50 states and I G'd in each one of them\nHeh, kick it baby\n\n[Positive K]\nI'm what you'd call a smooth microphone controller\nMy lifestyle's like suave bola\nKeep my hair in a cameo, gettin' gas from Amoco\nThe only thing I'm sniffin' is your girlfriend pantyhose\n*inhales* *exhales* Another hit baby!\nAnd if you find that kinky\nPut some barbecue sauce on the tip of my pinky\nWatch me get freaky like a nymphomaniac\nAnd exotic, an erotic tour with the mack\nNo I'm no one to be played with\n(Kane: Auditions at 12 baby) for the nightshift\n\nI got you workin' on the nightshift\nI got you workin' on the nightshift\n\nI got you workin' on the nightshift\n\n[Big Daddy Kane]\nMan, you got to work your women by the scale\nI mean if she's skinny, make her bring you home a good penny\nAnd if she fat, make her pay like she weigh\nHmm, come again now\n\n[Positive K]\nI'm a quote an old song, that's if I might\nWhat they used to say? \"The Freaks Come Out at Night.\"\nYeah, believe it's true, in fact it's a reality\nSome do it for the love and some do it for the salary\nWomen are true and women are deceiving\nWomen are also ladies of the evening\nShakin' them hips softly while she's steppin'\nHer lovin' ain't a tool, her lovin' is a weapon\nTime keeps tickin' and the world keeps turnin'\nThought I knew it all, but I'm still learnin'\nSo fellas watch your ladies cause it's women I'm pursuin'\nTakin' em away, no matter what you're doin'\nI don't play games, 'cause games are for fools\nAnd when your girl picks me - you know the rules\nAnd when she disappears, don't even wonder if\n'Cause I'm tellin you now - I got her on the nightshift\n\nI got her workin' on the nightshift\nI got em workin' on the nightshift\n\nUhh...\nI got 'em workin on the nightshift\nAh, here we go\nUhh, yeah baby, c'mon\nUhh, yeah, c'mon\nUhh, a yeah baby c'mon\nCheck it out\nC'mon", "year": "1992-11-03"}]}