{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "*Baba Israel beatboxes throughout the song*\n\n[Intro - Akrobatik - talking] - w/ ad libs\nYeah, yeah, yeah, yeah\nLet me turn my headphones up, be right back\nYo, The Perceptionists\nYo, yeah, The Perceptionists\nWord, that shit is crankin now\nThat shit is crankin now\nThat shit is crankin now\nCome on!\n\n[Hook - Akrobatik]\nJust nod your head to the beat\nCome on and just nod your head to the beat (what?)\nYou got to just nod your head to the beat (come on)\nEverybody nod your head to the beat (what? what? what? ...)\nOr maybe throw your hands in the air to the beat (one time)\nCome on and throw your hands in the air to the beat\nEverybody throw your hands in the air to the beat (put 'em up!)\nCome on, throw your hands in the air to the beat (yo, let's go!)\n\n[Verse 1 - Akrobatik]\nSoon as the record start spinnin, I'm winnin and beginning to please crowds\nWith flows that leave clouds\nLookin up (lookin up), rap's number one spot is tooken up (tooken up)\nBy this underground kid that got the industry shooken up (no doubt)\nCats bookin up Ak for the free for all (all)\nReefer leakin through the walls (walls), let me leave a free for y'all\nLeave it all behind, your trials and tribulations (tribulations)\nAk attack, niggas need defibrillation (defibrillation)\nUsed to seein hip-hop in disintegration\nKeep this in rotation, I'm gettin impatient\nCause (uh huh), the hot shit's right under your nose (nose)\nLike Don Corleone spittin thunderous blows (blows, yeah)\nAnd I'll be 44 with the wonderous flows (flows)\nI'm wildin out in case the day they call my number is close (close)\nLow post brother like Hakeem Olajuwon (what?)\nRap without Ak is like Ramadan\nA temporary fast but you know I'm comin back to feed your lyrical need\nYou'll ear it'll bleed\nWhen I, fuck your head up at the sound setup (HA!)\nIf you get beat down, get up (yeah)\nCall it a comeback, Akrobatik murder the drum tracks\nGrimy like the city that I'm from black\nYo, Ak be nimble, Ak be quick\nAnd I'm back to kick that old classic shit\nAin't no asterisk, I done mastered this\nIt's disastrous if y'all have to flow after this\n(after this, after this, after this, after this ...)\n\nCome on man\n\n[Hook - Akrobatik] - w/ ad libs\nNow just nod your head to the beat\nCome on and just nod your head to the beat\nEverybody nod your head to the beat\nYou got to just nod your head to the beat\nOr maybe throw your hands in the air to the beat (come on)\nCome on and throw your hands in the air to the beat (come on)\nYeah, throw your hands in the air to the beat (throw 'em up!)\nEverybody throw your hands in the air to the beat (one time!)\n\n[Break #1 - Akrobatik - talking] - w/ ad libs\nThat shit is crankin now\nThat shit is, uh, that shit is crankin now\nYeah, that shit is crankin now\nThat shit is, that shit is crankin now\n\n[Break #2 - Akrobatik - talking] - w/ cuts by DJ Therapy\nMy man Therapy's on the wheels\nYeah, my man Therapy's on the wheels\nYo, my man Therapy's on the wheels\nWith the beatbox by my man Baba Israel\nCome on!\n\n[Hook - Akrobatik]\nCome on and just nod your head to the beat\nYou got to just nod your head to the beat\nCome on and just nod your head to the beat\nSomebody just nod your head to the beat (come on!)\nOr maybe throw your hands in the air to the beat\nCome on and throw your hands in the air to the beat\nEverybody throw your hands in the air to the beat\nCome on and throw your hands in the air to the beat (one time!)\n\n[Outro - Baba Israel beatboxing]\n\n[Akrobatik - talking behind the Outro]\nWhoop!\nWhoop!\nLet's go!", "title": "Ak B. Nimble", "album": "Absolute Value"}], "artist": "Akrobatik"}