{"artist": "3rd Bass", "songs": [{"lyrics": "[Serch] Aiyyo Pete, it's Chubbs\n[Chubb] Sup G?\n[Serch] Yo Pete\n[Nice] Yo Serch\n[Serch] You know people tryin to gel us right?\nTry to gel\n[Chubb] Yeah dat\n[Serch] So you know we gotta we gotta rip this\n[Chubb] Serch let's go kick that shit G\nDrop it right here\n[Serch] Right here, like an asshole\n[Chubb] One two\n[Serch] One two, ya don't stop\n\n[MC Serch]\nGrooves get kicked as Serch tries to flip like coins\nPain, like the foot to groins\n3 Strikes but I didn't gel the head yet\nWhy you still vexed over things I haven't even said yet\nYo Pete, put you part-time like temps\nScale like a fence, put you in the past tense\nYou tried speedin but you ain't fast enough to chase me\nSo what I did this, ?? bring the kit to Ben Casey\nAnd don't waste time\nDopest tracks, so why you gonna waste rhymes?\nI absorb like a sponge in the bozack\nI'm trifle, get the rifle, or I step back and crack slugs\nAnd my crew give pounds and hugs\nTugs on my shirt, let me know that I'm still pro-fessional\nAnd at the end of the session, you'll know\nThat the 3rd'll disturb the verb with the noun\nShift the sound, so GET UP AND GET DOWN, Serch'll never stand still\nTry to flam I'll be like Claude Van Damme and just kick em in the grill\n\n{\"Kick em in the grill..\"} {\"3rd Bass\"}\n{\"Kick em in the grill..\"} {\"I'm Chubb Rock\"}\n{\"Kick em in the grill..\"} {\"Serch!\"}\n{\"Kick em in the grill.. grill.. grill Pete!\"}\n\n[Pete Nice]\n?? like a camel to ??\nMissin the points of ?? spliffs\nIf you wanna gamble, let it flow\nI ain't Al Jolson and Sambo\nLow like a buddhist sniffin ? tree\nBut that booty fat bass it ain't movin me\nTo be or not to be on, your FM\nStep to the AM, the gimmicks, I'll play em\nI say em while I'm takin 40 swigs\nA Chinaman eats with two twigs\nCalled your numbed, 9-7-0 PISS\nGoodfella, you can tell you're on my hitlist\nFor this I stick like a splinter\nPlay ya like a sphincter cause my title's Minister\nSerch said kick em, I gas em and trick em\nRhymes like ??, now Chubb, stick em\n\n[Chubb Rock]\nJump jump with the man with the plan, Chubb Rock\nYou know, a judo, a chop chop chop\nFrom stereo monarch rationalize the grammar\nIt's like that and ah.. and ih.. ih.. if I stammer\nOr sa-st-stutter, english found in the gutter\nOr the sewer, while I talk like Pete Puma\nHow many lumps do you want inside your coffee?\nIsn't about time, isn't about time, you stepped off me?\nYo Chubb - are you the best, are you the one\nThat ?? large chest, well, nevertheless my\nFinger won't do the walkin through cleavage\nI got a girl of my own, she's at home\nChubb is not conceited, I'm convinced of the fact\nVanilla sold seven million copies of some shit that was wack\nHe can wrap, his lips around a big black cock\nHe needs no more press, let me stop\nCherry crusaders, clean clairvoyany concepts\nClaiming critical conversations that came in..to view\nOf 3rd Bass mixed with Chubb Rock until\nWe kick the motherfucker in his, umm\nG-R-I-L-L-L, word up that's the grill\n\n[MC Serch]\nChill!\nHold up, Chubbs, you got lifted\n{Word up} What's the science?", "image": "https://images.genius.com/ba67f25eba0c6951171aa44e82a3051a.600x600x1.jpg", "album": "Derelicts of Dialect", "title": "Kick Em in the Grill", "year": "1991-06-18"}]}