{"songs": [{"title": "Bang With Us?", "lyrics": "[Intro]\nWe've been on this ting for so long now\n\n[Verse 1]\n10 years at the top of my craft\nMaybe not at the top of the charts\nBut who could tell me what independent touring the globe\nAnd flows as cold as winter was in hand me down clothes\nLive shows of the chain Toussaint\nSeems I was born to be what you ain't\nA man that uses his art to fight\nBut still prospers in these hard times\nSo what's to hate when you're known around the globe, it's great\nAnd their known around the globe, it's fake\nWith respect so high that\nLet's you in a jail full of lifers\nA man sit in silence, try that\nYou can't buy that, nah bruv, I'm that\nNot because I'm a killer but because I'm a mayan black\nCause contrary to the rumours\nOur community is not a bunch of delinquents, we are students\nBut don't respect the system made by the killers\nThat want to paint us as the villains\nBack to the spittin'\nListen, who's really my competition?\nReally? Is there somethin' that I'm missin'?\nThese kids are kittens fighting with a pitbull\nCareful my brother you'll get your shit pulled\n\n[Hook]\nWho can bang with us? None (What!)\nWho will stand with us? Come (What!)\nWho's still doubting us? Dumb (What!)\nWe've been on this ting for so long now\nYou can't bang with us, none\nYou won't stand with us, son\nYou still doubting us, dumb\nWe've been on this ting for so long now\n\n[Verse 2]\nI got man puzzled like \"I don't get it\nHow is he still so road with so much message\"\nDon't diss the sisters, celebrate killing other blacks\nBut still so fuckin' hard when he raps\nI give you a tip, swag through the roof\nIt's no excuse to be boring cause you tell the truth\nWhen it's said and done, I'm still the same as when I started\nAin't having a bar for none of these artists\nThat not giving a fuck gives me strength\nNow I don't use it on us, use it on them\nBut defend what I have to\nSit down Matthew\nJust one if my disciples, take notes\nThis is not music, this here is a sport\nWho's ready for the ring ring fire?\nYou man are wetter than man's hair in Shoreditch\nI think it's time to retire, heir\n\n[Hook]\n\n[Verse 3]\nIt's the father, you can call me uncle Akala\nWhat's the palava with Ghana\nFans here to Ghana, globe, every corner\nPunish every punk that is posing the hardest\nTold you we tarnish those that are garbage\nGet left for dead for opposing the carnage\nSo who's next, who's the best of me clones?\nTake out a town like Obama with the drones\nKnown for the poems that scorch gin, poor ting\nProperly focus, 12 year old girls gassed at your king\nBut we are grown men so only grown women\nAnd real hip hop heads, we care for their opinion\nBeware in my dominion\nI swear that your Brazilian\nThe way you got brutalised within your own kingdom\nBy this German efficiency, without the bigotry\nHarder than life as a black man in Italy\n\n[Hook]", "year": "2015-03-30", "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}