{"songs": [{"title": "Outta State", "lyrics": "[Extra P] Yeah.. yeah.. everything's real!\n\nChorus: Akinyele\n\nI got all my life to live\nAnd I got so much love to give\nBut I gotta survive, and make papes outta state\nI'm ready to make papes outta state, man\nI got all my life to live\nAnd I got so much love to give\nBut I gotta survive, and make papes outta state\nI'm ready to make papes outta state\n\n[Akinyele]\nAk to the Nel to the LE, I'm tryin hard as hell\nTo pick my future before my future picks me\nTwenty-one years of AGE, not with minimum WAGE\nDon't ever seem like I'mma get paid rhymin on the STAGE\nCollege, I always dreamt of tryin it; the only problem here\nI don't seem to meet financial aid requirements\nLocked writin rhymes in the crib -- when would I get out?\nSeems like I'm pushin yo a hip-hop bid\nAt home the vibes don't feel right\nMy parents keep lookin at me as if I'm some type of parasite\nMy moms separated from her spouse\nThe oldest of two kids, it's my job to play man of the house\nThat means gettin off my ASS, makin immediate CASH\nThat broke shit, save it for an orthopedic CAST\nI get road maps, learned the interstate\nShit I'm headed out state to make papes; man\n\nChorus\n\n[Akinyele]\nI'm ready to get up on a scam trip\nThe I-95 outta state to make the damn loot flip!\nFirst I need a crackhead with a credit card\nSo he can head uptown and purchase me a rented car\nJust make sure that it's black\nAnd take off the rearview mirror cause it ain't no lookin back\nI'm goin one deep, in the driver's seat\nThrowin out the vegetarian book cause I'm ready for beef\nI got a three-hundred and fifty-seven, faren-degrees-heit\nOf HEAT, better known as a burner on the STREET\nCool, I got the keys to the CAR\nAccelerate on the gas, and have the rubber burn up\nOn the TAR, I'm out to get money real FAR\nI hear my moms voice, {singing} \"I'm wishin on a star!!\"\nBut I got to go far ma! {sing} \"But I could wonder where you are!\"\nOn the streets just DELIVERIN, packages\nSo I can just relax and get some type of LIVIN\nThink that it is when it ISN'T\nEasy to see a family, suffer from povery, as bein GIVEN\nMan, like heck, and when I get back\nI'mma rip up them welfare checks\nI got a new nine to five mom, so don't wait up late\nMy job's located outta state\n\nChorus\n\n[Akinyele]\nI reached my destiny and my goal\nI done flashed right past the dumb-ass highway patrol\nIf everything goes well I'm in it to win it\nI'm tryin to find a hotel so I can rest up for a minute\nA round of crackheads gonna show me -- neighborhood clowns\nFear me up and down cause they really don't know me\nBut all my hits, I see them scopin out the clip\nThey wanna get open, I can let shit rip!\nWhatever is broke got to be fixed, twenty dimes and nicks\nStep into my house made of bricks\nMy man gave me work, home on credit\nYou think that I'm comin back? Tch, black he can forget it\nCause I got moves to MAKE, no time to be FAKE\nBad enough gotta watch out for a SNAKE called JAKE\nMoney nonstop, kept in the hush\nAt twelve o'clock, I'mma catch, huh, the midnight rush\nAnd watch the dough flow like water\nI'm not Taco Bell but hell I'mma make a run for the border\nI feel odd, like a extraterrestrial left alone\nA calling card number, so I could phone home\nTo let my people know my mission went great\nOn my great escape to outta state\n\nRest in peace to my little brother Donnie Boy\nRest in peace to my man Rakim\nRest in peace to my man, named Understanding\nRest in peace, umm, to Atiba\nRest in peace to my man Walter from Xenia Street\nRest in peace, to all my other peeps\nAlso rest in peace, to my man T-Bone\nYou know I ain't forget you\nYeah yeah, and I'm.. and I'm.. and I'm..\nAnd I'm.. and I'm OUT!! *echoes*", "year": null, "album": "Vagina Diner", "image": "https://images.genius.com/d076685831d7e5e870a3f608d4ea7916.800x800x1.jpg"}], "artist": "Akinyele"}