{"artist": "Boondox", "songs": [{"album": "South of Hell", "title": "Some Kind of Devil", "year": "2010-05-11", "lyrics": "(guess my name)\n(guess my name)\nTo say I’m fuckin wicked is a big understatement, I’m the sickest wicked ticket runnin underneath the pavement for your worst nightmare, I’m that dead ringer bitch. sit back and watch this fire rain from my fingertips\nI’m something in the dark that goes bump in the night, that made the shit run down ya leg from straight up horror and freight, and you can take the villanis killas from your history pages, I bet I bitch slap em all and have em locked up in cages, reptilious skin, spit venom enemies I see em then send on eternal tours with no perdium. I make demands not statements and I end em like periods. I bleed em all like kotex and I ain’t even furious, curious, to see yo face when you in pain, its distorted like my life since I fell from higher plains. descended with fire rain, you can call me the main, I’m kinda like a Rolling stone I hope ya guess my fuckin name\n(guess my name)\nI’m the angel that’s fallen, the evil that’s callin’ but can you..\n(guess my name)\nI’m the hate in ya heart that tears you apart but can you..\n(guess my name)\nI’m the reason for sin, the killer of men but can you..\n(guess my name)\nCan you..\n(can ya guess my name?)\nGet fired up ill blow, just like handgrenades, pinless, no bullshit, or nonsense just beating bitches senseless. yo defenses, are futile, similar to resistance, proceed the offensive, to end yo existance. throw a curse. a hex a vex you stuck with it, you don’t wanna go there, I’m not to be fucked with, and if you speakin about me you don’t wanna be critical, ill make it unforgettable, call me unfuckwithable. see my vipergated tongue and the hiss you hear and the chilling down ya back when I kiss ya ear. it ain’t clear my real appearance, but some will guess but don’t none of that shit matter when ya bones leave ya flesh\nI could come into ya hood and find the meanest fiendest thugs then tear em right in half with one hand and a shrug, there’s no tellin yo demise when I look into yo eyes you might be turned into stone or raped by maggots and flies\n(guess my name)\nI’m the angel that’s fallen, the evil that’s callin’ but can you..\n(guess my name)\nI’m the hate in ya heart that tears you apart but can you..\n(guess my name)\nI’m the reason for sin, the killer of men but can you..\n(guess my name)\nCan you..\n(can ya guess ya guess my name?)\nI’m bringin 7 signs, 7 seals 7 X pills creator of the twelve plagues and this is how the next feels I’m the only one I hope ya heard me bitch. don’t believe it then divide 6 by 36. you don’t need DaVinci’s code, you can do it my way, take that 6 from 36 and you can call it my day\nTake away 20 more and you figure out the month. that’s the real fuckin deal the next day is a front\nI’m all that’s fuckin wicked sick from serpents to spiders. big wig corporations smut writers and fighters from your lies and excuses to ya lustin for honey the voice that kills your fuckin concious have ya killin for money\nI could come into ya house go for ya gun ya fumble, like foreman and ali bring the rumble to the jungle now ya family’s in trouble, better hurry on the double, turnin up the fuckin heat until ya fuckin skin bubble\n(guess my name)\nI’m the angel that’s fallen, the evil that’s callin’ but can you..\n(guess my name)\nI’m the hate in ya heart that tears you apart but can you..\n(guess my name)\nI’m the reason for sin, the killer of men but can you..\n(guess my name)\nCan you..\n(can ya guess my name?)", "image": "https://images.genius.com/065e7cb2b70fad281b6176257886e84e.500x500x1.jpg"}]}