{"artist": "C-Rayz Walz", "songs": [{"title": "Old Joke", "album": "Singular Plurals Vol. 2", "year": "2003-01-01", "image": "https://images.genius.com/8e86440fce3f7155dd3d512d5c35e8c8.600x600x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nHahaha.  (What’d you say?).  I’m the old joke\n\n[Hook: C-Rayz Walz] (x2)\nI’m the old joke.  Became rich because I was so broke\nWatched the young seeds turn into old folk\nI died almost, but we all came so close\nNow laugh at the old joke\n\n[Verse 1: C-Rayz Walz]\nI used to rock windbreakers—now it’s fat leathers\nI got money now (So?)—I’m still a ass-bettor\nEverything I wanted, I stole like a lowlife\nRocked crowds of ten-thousand with no mic\nI don’t live in the project.  No writ, no lights\nSo don’t step on that cigarette, aight?\nThe old joke.  Warm toast—the gat’s in the couch\nCrib so small, you walk in and fall back out\nLike wack MCs, always wanna be nice\nDumb like going to the sixth floor pressing three twice\nKnock your patch off—my rap like Lee’s and get your teeth cracked\nBelieve me, Mikey wouldn’t even eat that\nAin’t your momma gritty?  Who pops corns with 9 millies?\nMighty fine, [?] snuff, break his time\nI’ll choke you and ask, “Did I do that?” like Urkel\nWith three legs, walking in a circle\n\n[Hook: C-Rayz Walz] (x2)\nI’m the old joke.  Became rich because I was so broke\nWatched the young seeds turn into old folk\nI died almost, but we all came so close\nNow laugh at the old joke\n\n[Verse 2: C-Rayz Walz]\nTwelve eggs at a tennis match playing the dozens\nYou ain’t hard-boiled—your weak shell could be crushed in\n(And we dissed you).  “Everybody’s tough now.”  Look into this dumb fact\nA fun snack will lead to a gun clap\nWhile I get love like Barney, my haze is purple\nYour moms is my dog—I Walker like Herschel\nYou see, son, when the quarter back was a refund\nEveryone bit moves from Rerun\nHot peas in butter.  Police seize motherfuckers in covers\nBut I’m hip to the game like the ruckus, suckers\nMy pops is a old man with a wooden leg and a kickstand\n(Laugh) Laugh—that’s that shit, fams\nRappers had the gall, but that’s not all\nI’ll make a shoot a dead rocket, play casketball\n(Yo, speak English!).  My words is a math test\nAnd your chick sticks ice in the drawers to keep the crabs fresh\n\n[Hook: C-Rayz Walz] (x2)\nI’m the old joke.  Became rich because I was so broke\nWatched the young seeds turn into old folk\nI died almost, but we all came so close\nNow laugh at the old joke\n\n[Bridge: C-Rayz Walz with DJ JS-1 Scratches]\nI’m the old joke\n\n[Verse 3: C-Rayz Walz]\nTimeless definers wisest, livest\nMine of highness to realize an idea of brightness\nAnd react with the impact of life’s excitement\nTo make you laugh while I’m seriously frightened\nTaking time to show respect to punchlines\nThe lunchroom tables, the blocks at summertime\nBrothers cried.  Some got punched in the eye\nSome was like “Fuck that.  You got it,” and paid it no mind\nBack in days, kids that can’t snap\nThey probably the same motherfuckers on stage now that can’t rap\nAnd I can’t like it’s OK ‘cause it’s not\nTrue school like “Me and you, three o’clock.”  Watch!\nAll you could front, smoke, or pop 9 shots\nUsed to hump joke and climb rocks\nSo I stopped to gaze at a page of forgotten days\nLast one to cop my album is a fried, rotten egg\n\n[Hook: C-Rayz Walz] (x2)\nI’m the old joke.  Became rich because I was so broke\nWatched the young seeds turn into old folk\nI died almost, but we all came so close\nNow laugh at the old joke\n\n[Bridge: C-Rayz Walz with DJ JS-1 Scratches]\nI’m the old joke\n\n[Outro: C-Rayz Walz]\nProbably got a sling durag.  Hahaha.  Corduroy bra.  Laugh at that"}]}