{"songs": [{"image": "https://images.genius.com/4e938672ba331b168f4f463f35fdd247.637x637x1.jpg", "year": "2000-12-12", "title": "Kenny Parker Show 2001", "album": "Restless", "lyrics": "[Intro: KRS-One]\nYou are now tuned in to the ultimate sounds.. of Dr. Dre\nYou know what time it is!\nXzibit steps up to the mic\nLayin down the hard-core, real raw, underground\nMy name is KRS-One, and it's REAL!!\n\n[Xzibit]\nWell it's me, down with D-R-E\nX to the Z rocks any party\nRocks the beats, and the breaks\nRocks the cocks off the whores in the place\nCause suckers shake, while I'm creatin\nThey get together and they start to hatin\nHow can we take him out one time\nCause he brought back the West with the freshest rhymes\nI might go first, and he'll go second\nI'll wreck 'em, deck 'em, set it, just checkin your mic\nDroppin hot shit I like\nSo throw up your hands bitch, run your ice\nCause I'll go third, and he'll go fourth\nBy the fifth eat shit, you'll step off\nSix is your beatdown, your title is seven\nTakin out your four man crew makes eleven\nBy the twelveth I go for self\nRockin L.A. like no one else..\nYou can check any rapper from the underground scene\nBut few have dropped hot shit and seen green\nSome have dope twelve inches, count 'em\nBut not many niggas have slammin albums\nX to the Z rocks consistantly\nI'm \"Criminal Minded\" so don't fuck with me\nWhy? Well that's my secret baby\nI don't take shit, so fuck you, pay me\nSo you can call me, a public servant\nNot a king but a teacher I believe I've earned it\nSo I just walk, or ride my bike\nAnd bust on the +Up In Smoke+ stage tonight\nGive me a chance and I'll rock the house\nBut let a motherfucker try to take me out\nCause male or female, I will strangle\nIf it's a label, they have to untangle\nAdidas, chains, jerseys, braids\nBandanas hangin off the end of my gauge\nStep right up if that's what you like\nBut watch your bitch, I catch hoes like a dyke\nIn the night at a height right for flight\nWay out of sight, you bite, I recite\nMy chain shine bright, plus my kicks stay white\nAs your faggot CEO say, \"Well alright!\"\n.. I am your mentor\nHistory is mine, it's time you surrender motherfuckers\nAnd just back up quickly\nYour style is sickly but you persist to get me\nOr outwit me with the style that I created\nYears ago when I was sellin powder to the hoes\nOh, all of a sudden you don't know\nOr can't remember can't recall can't bring to mind\nThat rhyme that place do not chase\nI run a marathon a race of rhymes in your FACE\nIn case you hate I won't write no tough rap\nFuck with me get your whole FAMILY kidnapped\n\n[KRS-One]\nYo Xzibit! Show these motherfuckers man!\nI don't think they understand this shit!\nBreak this shit over they backs!\n\n[Xzibit]\nI don't dress up to rap or keep a hairdo\nI only grab a nine to bust holes in your crew\nI deny your existence as artists\nYou puttin out a record expectin to chart but it's weak\nBut when you speak through the microphone\nYou fail to realize, nope, you're not alone on the earth\nThe light comes forth cause Mr. X\nIntelligence, smoke and guns manifest in the flesh\nI snatch the mic and get hype\nBehave, before you make the news front page\nHeaded for the grave and the wake\nSo save your microscopic miniature small talk and WALK\nAnd put a little pep in your step\nX to the Z will destroy any motherfuckin rep-utation\nIn the nation, in creation\nAll you assholes in ANY occupation\nLike rappers with nothin to say\nI CRUSH 'EM like chronic and then smoke 'em with Dre\nCause no matter how fatter the wallet, I'd rather\nGather together and splatter\nWhatever egotistic bullshit, the game is over\nWhen you push the record but don't push the culture\n\n[KRS-One]\nBreakin, emceein, graffiti art, deejayin, beatboxin\nYo Xzibit, keep rockin!\n\n[Xzibit]\nJust throw your hands in the sky\nStill believe real niggas never die\nAnd if you in this life just gettin by\nSomebody say, \"I'm high!\"\n(I'm high!) \"I'm high!\"\n(I'm high!) Yeah, and you don't stop\nYeah..\n\n[KRS-One]\nWoop woop, woop, woop woop!\nYou know what time it is\nPull over, all wack emcees, AHH-AHHH!\nYo.. YO! You are tuned in.. to the ultimate..\nUnderground.. rawness! Straight off the street\nXzibit, turn it up.."}], "artist": "Xzibit"}