{"songs": [{"image": "https://images.genius.com/d3ecb0c5f9193ca6db76b03bd53f3b01.749x749x1.jpg", "lyrics": "[Chorus: Unknown T]\nMy shawty beg me to leave dat trap, please baby, don't act like that\nThe Trident clocked on the sweetest wap, it’s calm 'cause I made it back, right back\nAlways calm 'cause I made it back, right back\nMy shawty beg me to leave dat trap\nMy shawty beg me to leave dat trap, please baby, don’t act like that\nThe Trident clocked on the sweetest wap, it's calm 'cause I made it back, right back\nAlways calm 'cause I made it back, right back\nMy shawty beg me to leave dat trap\n\n[Verse 1: Unknown T]\nMy shawty beg me to leave dat trap, she don't like it when I fling them packs\nBut I'm stuck in the dirt with white tryna feed them cats\nMore time, I get all my quid in cash\nAnd I'm really tryna hit the blam, who? What? Where? I'm a fearless man\nBut this stain goes wrong then we’re all going straight to the can\nMy baby girl told me I’m knees deep in, hoping the pigs don't skrrt in the ding\nLord forgive me in this life of sin, I’mma take that L to the chin\nMore time the undies search like bing, so I gotta wrap these wraps of cling\nI'm two steps ahead of the law, I'm a young black king\nNow, rise up my young black kings\nWe all been a young nigga making cash but tell me, how come the cops took Rash?\nAnd the officer didn't get bagged, it’s fucked up, need justice for that\nRest up bros, I miss them too, the streets been peak, lost half of my crew\nMy babe goes nuts when I hustle the food, baby, I gotta do what I do\nBut the cops tried to nick me today, fuck, I should've just listened to bae\nHate when the cops try to confiscate cake but I go make it back, no delay\nI go make it back on the lay, I jugg in the day and duck from the jakes\nI'm flippin' this cake while rocking in Bape, my babe, my babe said it's time to break\n\n[Chorus: Unknown T]\nMy shawty beg me to leave dat trap, please baby, don't act like that\nThe Trident clocked on the sweetest wap, it's calm 'cause I made it back, right back\nAlways calm 'cause I made it back, right back\nMy shawty beg me to leave dat trap\nMy shawty beg me to leave dat trap, please baby, don't act like that\nThe Trident clocked on the sweetest wap, it's calm 'cause I made it back, right back\nAlways calm 'cause I made it back, right back\nMy shawty beg me to leave dat trap\n\n[Verse 2: AJ Tracey]\nShit, shit, shit, look\nFirst off, free SQ, free Jonny\nMy tunes get played in the dance nowadays but I don't have to dance with the Bobby\nMore time got pucks like hockey\nDon't trust me, I'm dodgy\nMe and T in a dumb whip like Noddy\nThem man are rats and roaches like Oggy\nMy plug was a chick, I saved her as poppy\nYou smell me, ask about me, I'm soppy\nBare taze on me frozy, I'm Rocky\nOld school chill with Alby, free Alby\nOld school chill with pocket and stocky\nBig mash, ring you rapture like Koffee\nShiba, gyal wan' pet me, get doggy\nRich now, man's got porters and lobbies\nEat black cod and golf is my hobby\nBaby, don't act like that, why you gotta hate on the trap like that?\nThem boy soft but they rap like that, sombrero ting, why they cap like that?\nUnknown flang on the riddim and I told him \"bro, how do you slap like dat?\"\nIf you ain't gang, can't dap my man, thirty mill by thirty yeah that's my plan\n\n[Chorus: Unknown T]\nMy shawty beg me to leave dat trap, please baby, don't act like that\nThe Trident clocked on the sweetest wap, it's calm 'cause I made it back, right back\nAlways calm 'cause I made it back, right back\nMy shawty beg me to leave dat trap\nMy shawty beg me to leave dat trap, please baby, don't act like that\nThe Trident clocked on the sweetest wap, it's calm 'cause I made it back, right back\nAlways calm 'cause I made it back, right back\nMy shawty beg me to leave dat trap", "title": "Leave Dat Trap", "year": "2019-06-27", "album": null}], "artist": "Unknown T"}