{"songs": [{"image": "https://images.genius.com/6cb019a835c8469b126800d92a0248dd.300x300x1.jpg", "album": null, "title": "Dear Hillary (Love Letter to Hillary Clinton)", "lyrics": "[Intro]\nThis is a love letter to Hillary Clinton\n\n[Verse 1]\nOh Hillary\nI do not know why you are pilloried\nYou're the biggest woman in America but Lady Liberty\nJust 'cause you're slithery it doesn't make you a snake\nEveryone has made a mistake\nModern communications are full of complications\nIt's getting more confusing to refute these allegations\nBe it botched operations or personal relations\nYou prefer to avert investigation\nOn who's to blame within Clinton's administration\nOr why you rehired Debbie Schultz after her resignation\nSo before the conversation gets any more derailed\nHit me up, I sent my details to your email\nYou could be the Meg Ryan to my Tom Hanks\nA corporate Bonnie and Clyde but we won't rob banks\nWe'll head to Wall Street and we'll help the banks rob\nBe it for a backhander or a handjob\n\n[Chorus]\nVote for Hillary\nVote, vote for Hillary\nPushing the boundaries of plausible deniabillity\nVote for Hillary\nVote, vote for Hillary\nI can't wait the anticipation is killing me\nVote for Hillary\nVote, vote for Hillary\nLike her leadership would be any better than Bill would be\nVote for Hillary\nVote, vote for Hillary\nI can't wait the anticipation is killing me\n\n[Verse 2]\nThe world is getting worse lately\nBaby girl, save me\nIn return I'll pay the parking ticket for your Mercedes\nYou make me stir crazy, the former First Lady\nShowing that women are able to do more than birth babies\nAre you an angel from above? Are you our salvation?\nOr are you that woman from 101 Dalmatians?\nRestoring glory to your once proud nation\nI just pray you run it better than you ran the Clinton foundation\nThe GOP try to paint you as a harpy\nHardly, you're part Dana Carvey and part Barbie\nIf you be my Lizzie Bennet, I'll be Darcy\nWe could honeymoon over in Benghazi\nGo on safari, avoid any inquiry\nAbout your dodgy business dealings with shady Svengalis\nWe'll go whitewater rafting right after we've rammed out pockets\nThanks to the new staff at the White House travel office\n\n[Chorus]\nVote for Hillary\nVote, vote for Hillary\nPushing the boundaries of plausible deniabillity\nVote for Hillary\nVote, vote for Hillary\nI can't wait the anticipation is killing me\nVote for Hillary\nVote, vote for Hillary\nLike her leadership would be any better than Bill would be\nVote for Hillary\nVote, vote for Hillary\nI can't wait the anticipation is killing me\n\n[Verse 3]\nYou weren't always a Democrat\nBack in '64 you campaigned Republican - Remember that?\nOr are you having another convenient memory lapse?\nWhy am I even asking? You won't remember any of that\nBut you left a paper trail - better clean the ink spots up\nAnd get rid of the suicide letter of Vince Foster\nHe knew a lot, you took a shot at him and then he died\nBut I'm not implying that you've got anything to hide\nI couldn't sleep at night, I was having bad dreams\n'Til Hillary came and sprinkled me with dank memes\nShe's down with the kids, she's lit, not a has been\nIt's Hillary and Billy C - the classic tag team\nThank God you're back, Hillary, I thought you might retire\nYou've already suffered humiliation and sniper fire\nIt brings a tear to my eye, grab a tissue\nWhile the DJ flips the record like you did on the gay marriage issue\n\n[Chorus]\nVote for Hillary\nVote, vote for Hillary\nPushing the boundaries of plausible deniabillity\nVote for Hillary\nVote, vote for Hillary\nI can't wait the anticipation is killing me\nVote for Hillary\nVote, vote for Hillary\nLike her leadership would be any better than Bill would be\nVote for Hillary\nVote, vote for Hillary\nI can't wait the anticipation is killing me\n\n[Outro]\nYours sincerely, Dan Bull", "year": "2016-10-28"}], "artist": "Dan Bull"}