{"songs": [{"year": "1989-10-10", "image": "https://images.genius.com/7c84ab3a345d944b61d4c41970988d2c.1000x1000x1.jpg", "title": "Me Versus Me", "album": "The Biz Never Sleeps", "lyrics": "{*scats*} Biz {*scats*} Mark\n{*beatboxes*}\n\n[Verse One]\nI'm the original B-I-Z\nThe Emeza-Emeza-Emeza-Emeza-A-Rrah-K-I-E\nEverywhere I go, I always G\nI'm thinkin somethin that you never could see\nDoin the beatbox and the R-A-P\nThat's why I'm the Inhuman Orchestra, Biz Markie\nI'm here just doin my J-O-B\nSo I can reach the T-O-P\nAs soon as I get to the T-O-P\nThen I will be D-O-N with the E\nI rock New Jersey and N.Y.C\nWhether it's at a club or a block party\nTo my man Capri, Starchild and Brucie Bee\n{?}, Baby J, and DJ Marty\nThe title of the song in the place to be\nIs not this or that, it's \"Me Versus Me\"\n\n[Chorus: repeat 4X]\n{*Biz Markie beatboxes*}\nMe versus me\n\n[Verse Two]\nI think it's time to act up and throw a fit\nCause I'm rockin to a beat that just won't quit\nThis is the real thing, not counterfeit\nCause everything you hear, I'm doin it\nThe name of a baseball glove is a mitt\nAnd what I need on my BMW is a kit\nA preacher preaches from a pulpit\nAnd my man Benny Hill, got a lot of wit\nThe rhymes that I say are the ultimate\nAnd the way out anywhere is called an exit\nA real short play is called a skit\nAnd New Balance sneakers are legit\nThe past tense for bite, is called a bit\nEverywhere that I go, all attention I get\nI used to live by the North conduit\nThe Biz Markie will always make a hit!\n\n[Chorus]\n\n[Verse Three]\nThis is one thing, that I like to say\nThis is a different kind of rhythm and rap display\nI'm not Frankie Crocker or Lamarr Renee\nCause both of them are radio DJ's\nOtis Redding be sittin by the dock of the bay\nI'm bound to wreck your body to the break of day\nAnd if you wanna see me at a show, you gotta pay\nCause if you don't you will have, a little delay\nZip-de-doo-dah, zip-de-day\nI'm the S-K the B-I-Z the Emezah-A-R-K\nAnd even if I'm buggin on out, around the way\nYou'll never see me drinkin Tanqueray\nSwan, G. Rap, Kane, Shan and Shante\nAlways been down with the capital J\nI got a homeboy by the name of Dr. Bombay\nMy favorite color - is GREY!  Uhh\n\n[Outro]\nI can't forget I like reggae\nI'm Biz Markie, and my DJ\nC-double-O-L V to the break of day\nHold up, bricka-bricka-bay\nRockin to the rhythm, to the break of day\nThe original B-I-Z, the Emeza-Emeza-A\nBest to sing, and appointed rap king, to the break of day\nEverywhere I go I like break your way\nAnd it don't matter to me, as long I give you a display\nZip-a-dee-do-dah rock the microphone and you say\nThe king of romance will like break your day\nI'm Biz Mark, I'd like to say okay\nAnd my favorite drink is called OJ\nHippin to hop then to break your way\nListen to me as I rock and I, say okay\nTo my man Rud and Superlover Cee ay\nI rock to the rhythm and oh say okay\nCan't forget my man, G-A, U-L\nHold up - it don't matter to me I rock swell\nHold up - you know it's, me, the\nOriginal B-I-Z, the Emeza-A-Rrah-K-I-E\nThe original with the material and the ladies always know\nI'm bound to wreck in like a Lincoln, always steal a show\nTo kick it with swing, to rock the thing, ha-heh-ha-ha-ha-hee\nKnown to me as the original B\nIt don't matter long as I say stuff you see\nKickin records of a rap technique and..\n.. down to wreck your body, your moms be freakin\nTo my man Godfather Deeeeeeeeeeeeeeeeeeee-AHHH!"}], "artist": "Biz Markie"}