{"artist": "Papoose", "songs": [{"album": null, "title": "Born to Win", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "Yeah (Yeah)\nPapoose (Papoose)\nI wanna give a big shoutout to Da Riffs! (Shoutout to Da Riffs!)\nKeep producing that fire!\nLet's go!\n\n[Hook]\nCause when it all begins\nMy eyes on the prize so it's on again\nI refuse to loose I ain't gon' pretend\nI thought I told you I was born to win\nEverybody loves a winner!\n\nVictory I choose\nAin't no turning back cause I paid my dues\nI tighten up my laces when I tie my shoes\nBorn to win, I refuse to lose\nEverybody loves a winner!\n\n[Verse 1]\nMy adrenaline rushing through my veins\nNext stop is victory, it's rushing like a train\nI'm determined to win, cause there's nothing like the pain of defeat\nI refuse to remain incomplete\nGotta lot of stamina cause I train for some weeks\nGot my strength from the vitamins and the grains that I eat\nAll obstacles overcame, I'm unique\nI started from the bottom, see I came from beneath\nThe sky's the limit so I'mma raise to my peak\nWinning is everything, let me explain what I think\nPractice makes perfect, so when working I dont relax\nI practice a lot, therefore I'm perfect and that's a fact\nBeen through some hard times while the burner was on my back\nIt was rough, but I was determined so I adapt\nGettin what I'm deserving, holla back\nGame over you lost like a person with outta map\n\n[Hook]\n\n[Verse 2]\nMy competition said I wasn't ready to face him\nMy teammates said 'I think we need to replace him'\nAll the haters used to say 'Boo we hate him'\nI wanna thank y'all for the inspiration\nWaited a long time for my time I'm anxious\nSomething like a doctor, cause I got patience\nMay the best man win, the worst man lose\nLast man no choice, the first man choose\nI was born as a leader, that's what I gotta be\nI don't follow rules, I let the rules follow me\nI'mma focus man on the lose, animal out the cage\nAn ambitious and vicious champion with a rage\nWhat's the difference between a champion and a challenger?\nA champion already conquered his caliber\nYou trying to become, a champion became\nI got more wins then a hurricane\n\n[Hook]\n\n[Verse 3]\nThat's why I eat finer foods\nComplete wiser moves, I'mma retire you\nNo remorse for these tired dudes\nLet's celebrate the victory, I won like three minus two\nIts only what you make it thats what we gotta remember\nBut deep down inside everybodies a winner\nYou gotta work hard January 'til December\nFinish what you start and you can be a contender\nWatch the man in the mirror, look into your inner\nSelf, maintian health and never be a quitter\nGotta shine like the sun, flow like the river\nYou see a chance to win then take it like a picture\nI ain't tryna preach to you don't feel bitter\nI'm just tryna tell you what it take to be a winner\nHe's a champion cause it's impossible to stop him\nVictory is a option\n\n[Hook]", "year": null}]}