{"artist": "WC", "songs": [{"year": null, "lyrics": "[W.C.]\nUh, dat's riir, niir!\nBack once again, it's Dub C: the shadiest\nIntroducing ya'll to the newest members of my clique:\nYoung Shane, wit Young Hogs, Dre'sta the Gangsta\nAnd we are: Bandana Swangin' Productions\t(Yo, Toones!)\n\nCan you feel this realness? Nothin' can save ya\nFrom the school full of big tails, Dickies and Ben Davis\nThe one and only witta chrome pistole\nFor those who don't know me: Bandana Swangin' Parole\nDub witta capital 3rd letter\nDown for whatever, whenever takin' the berettas to bangin' for cheddar\nForever bailin' in my overalls and work- (?)\nBreakin' jaws\nDre'sta the Gangsta, Dub C and the Young Hogs\n\n[Young Shane]\nIt's the young Desperado! My model is to bang foe the hood\nBring the pain foe the hood, cuz it's all tooted good\nOn the reala, a young killa, a young thrilla, mashin'\nThe enemy goes down for (?) scrilla\nTo whom it may concern: fool, I need a \"Burn\" like Militia\nAll ridas creepin' about to getcha\nIt's the same, loc, don't get it twisted when I bail through\nOne Bandana Swangin' wit bottles on both sides\n\nChorus:\nSurvival of the fittest and we wit this\nWho wanna witness? All my rides wit hustle handle their business (?)\nSurvival of the fittest and we wit this\nWho wanna witness? All my ladies wit hustle handle their business (?)\nSurvival of the fittest and we wit this\nWho wanna witness? Real rides, be wise and handle your business\nSurvival of the fittest and we wit this\nWho wanna witness? Bandana Swangin' [be bangin' and bringin' their business]\n\n[Dre'sta]\nMic check, 1, 2, what you bustas wan' do or gon' do?\nNow that real rides are upon you. I warned you and alarmed you!\nThe bandanas will be swangin' when we swarm through, was born to!\n[Cap to make the minds of all remainin'  (?)]\nMake these girls and the thugs in the club dance\nDre'sta the Gangsta makin' you bang your head and bounce\nShout from the West to East, Midwest and Dirty South!\nDub C, my niir, yeah\nYoung Hogs born to thug wit me and Muggs\nAnd Green Bug California Love, homie (?) chases only\nWomen upon me, never phony, get it lonely, you can ride upon me\nLyrically fictive (?) be the loc'est\nWhack rappers claiming' dat they're the dopest\nWhen hopeless brothers be the brokest\nSaddest song dat you ever heard\nShinin some light on all you bustas like the Ghetto bird!\nAnd that's (?)\n\nChorus:\n\n[W.C.]\nUgh! Ah, Good Evening! Do not attempt to adjust your radio!\nAin't nuttin' wrong, we have taken control to bring you the special show:\nBandana Swangin'! Who me? Huh, I'm known as Dub C alias the shadiest one\nEy, Dre'sta, what you got?\n\n[Dre'sta]\nI got a slug foe every mug dat wanna look at me evil\nAnd got a clutch foe all fake thugs and scandalous people\nIf you test Dre it's suicide. Lyrical drive by\nMakin' sure you suckas die. Only ya bye-bye (?)\nAnd the moves (?) of the 5-0 got rappers study\nAnd us gangstas like revival since my arrival\nAnd roll wit hogs dat get it's on, raw and ball till we fall\nAnd revolve all broads to (??)\n\n[W.C.]\nFrom the land of the scandalous, sho dogs and locs\nI represent the chronic (?) and smashes of gun smoke\nFor this box Regal to Martinis (?) sippers on a do low\n3 time felons, double eye for [strinkin' pulo (?)], you know\nThe shadiest, shadiest wanted 'em all but call\nDub C the Ghetto manifesto, still standin' tall\nBandana Swangin' till the wheels fall off\nAnd all my momma bear the realest niirs to ever lay ya'll\n\nChorus: [2x]", "image": "https://images.genius.com/cf87abd2f39a5810ebc8f3707912ea12.500x500x1.jpg", "album": "Thicker Than Water (Soundtrack)", "title": "Survival of the Fittest"}]}