{"artist": "Fabolous", "songs": [{"year": "2015-04-04", "album": "Friday Night Freestyles", "image": "https://images.genius.com/b4c54bc230379b9bc79ffb5dba1569a6.960x960x1.jpg", "lyrics": "[Intro: DJ Clue]\nYeah, live from the 718, the World Famous DJ Clue\nDesert Storm, that boy Fabolous\nFriday Night Freestyles\nYou know how we get down\nStupid\n\n[Verse 1: Fabolous]\nYo, two things fam I ain't nuthin' ta fuck wit'\nMy crew ain't playing and we ain't for the fuck shit\nI'm ridin' wit whoever that I hop out the truck wit'\nSlidin' with the sticks on some slap-in-the-puck shit\nNo hockey, just riders, no jockey\nChinese food, less beef, more broccoli\nMy fortune cookie said stay humble, flow cocky\nCall the jeweler A$AP, time to go Rocky\nMy chain glisten, bright enough to change vision\nShortie see I'm everything that these lames isn't\nTold you I could take your bitch, you ain't listen\nI heard the friend zone feel like you in Bane prison\nFly little joint, her weave just hang different\nBought her that Malaysia, she went plane missin'\nI put her in that fast lane no more lane switchin'\nTold her keep curvin' them niggas don't change pitches\nBenchriders, comin' in the game dissin'\nFame fishin', tryna-get-a-name mission\nMy team gon rush you niggas, we came blitzin'\nMy boy got that AK wit' him he came swizzin'\nI bang vixens, main chicks and game kicks in\nHit it and fall back on em, game sixin'\nKeep them broke bitches away, we ain't fixin'\nYou chasin' baby? I'm straight, ain't mixin'!\nDusse straight up, cause dues say paid up\nIt's go time Rugs, fuck who say wait up\nYou in ATL, then my crew may skate up\nLike T.I. flick, handle B.I. quick\nAll my niggas bring em home, R.B.I. chicks\nAll you niggas talk to the FBI Quick, rats\nSprinter full of Splinters\nI was gettin paper like a printer through the winter\nWeather break I might get the Bent or the Aventa-\nDor, more, adventures of a center\nBig nigga ballin', big figures callin'\nShe hooked on me, she a big-dick-a-holic\nTryna stay above water that's just some duck shit\nTryna stash a hundred mil, keep it a buck shit\nWe stay winnin' baby this ain't no luck shit\nRest of these niggas ain't nothin' to fuck wit\n\n[Outro: DJ Clue]\nDJ Clue, Desert Storm\nFabolous, that Street Fam\nOh yeah!", "title": "Ain’t Nuthin Ta Fuck Wit Freestyle"}]}