{"songs": [{"lyrics": "1 of 4...\n\nMy name is Ian Mathias Bavitz\nI was born in one-nine-seven-six, at Syosset hospital\nLocated in Long Island, NY\nI am six foot, four. I weigh two-zero-zero pounds\nI have brown hair, and green eyes\nI enjoy writing songs, painting, movies, and diner food\nI have two brothers, Chris and Graham\nAnd two parents, Paul and Damita\nIn August of two-zero-zero-one, I went crazy...\n\nThis was originally not for public consumption\nThis was made for four people...\nFour people that literally saved my life\nThey know who they are...\nAnd uh, I mean I could live to be a thousand years old and never repay them\nI don't think this song would pay for them\nBut hopefully by putting it out\nIt'll push the thank you a little further...\n\nThis ain't a burner for the whips. (No, it isn't)\nThis ain't even Aesop Rock fly earthworm demeanor. (No, it isn't)\nMy name is Ian Mathias Bavitz, and I was born in Long Island, New York, seventy-six\nBefore Graham and after Chris... OK\n\nIn August of two thousand one, my seemingly splinter-proof brain bone-scaffolding imploded\nI kept it on the hush, but nearly tumbling\nTo the cold hard concrete on mere bodega trips\nFor cigarettes and soda, shook me to Casper\nDizzy with an argent chaser, motor sensory eraser\nAgoraphobe tunnel-vision, guilt, self-loathing arrangement\nRose rapidly out a bog I'd never fished in\nThat abates three separate foreign meds\nWhile I was used to hook-line-and-sinker-simple fission\nSimple, primitive, self-taught easing of soul, mind and body\nBut the symptoms rejected my caveman Modus Operandi\nSo now it's one fish, belly up, through medicated mileage\nAnd shrinks that get $250 an hour for awkward silence\nAnd, I'd be lying if I said all of this\nMade even the slightest fragment of sense to me\nThat's real... Simply put\nI don't know what happened, or what's still happening\nI literally feel like I'm teetering on the blunt edge of my sanity\n\nJAMIE, I killed the robots and I'm sorry\nBroke down in front of you. Embarrassed\nBut you lent a heart and hand that only you could\nYou're one of my best friends and, yes, I'd take that bullet for you\nThat's my word, which is about all I have left\n\nTONY, I know you know I'm crazy, 'cause you told me\nBut that didn't ever bother you\nI hold you as my brother 'til death\nAnd I got your back if ever the drunk goblins step\nFor makin' a cat laugh, when I was walking with the dead\n\nKATHERINE, mother figure, older sister. Concerned beyond limits\nLetting me know I wasn't the only one with this\nContinuous offers for vacation, Chicago visits\nTalked me through repair of a head full of broken pistons\n\nRIYAH, for the late night movie rentals and the company I needed\nAn' you knew it, but I just wouldn't admit it\nYou'd listen to me blab about my issues for hours\nOffer incredible advice, gave me a hug when I was finished\n\nAm I a jack of all trades? Nope... I like to write songs, though\nAre they good? I dunno...\nBut I could tell you that I only write shit down when I believe it\nSo take this how you want, but know I mean it\nI want you all to know that I'm scared out my fuckin' crooked soul\nNever faced a monster like the last few months ever in my whole life...\nI wish I could explain this better, (I can't)\nBut the pieces won't formulate it to anything even close to cohesive\nSo I guess this is my feeble way to thank you;\nFour soldiers that extended something sacred off the purity of kindness\nI owe you all my life and please don't argue with that statement\n'Cause without y'all I may not have a life to offer, take it\n\nThank you\n\nI wish I could explain this better\n\nThank you\n\nI'm sorry for burdening your pleasures\n\nThank you\n\nI love you all with all that's left of me. (Thank you)\nFor helping try to kill what made a mess of me. (Thank you)\nSomehow, someway, (Thank you)\nI'mma get you back someday. (Thank you)\nJust gotta figure this all out... So...\n\nI guess it is kind of funny when you look at it from a step back\nHow one man can literally buckle under the same pressures\nOther men operate normally under\nI have scoped this out from all angles, multiple times\nI have been over everything in my head, 'til I can't think anymore\nBut I guess sometimes, when you can't breathe, there are people there\nTo breathe for you\nI am lucky enough to have those people around me\nThank you for helping me to not die\n\nThank you for helping me to not die\n\nPocket full of pennies, and a soul gone tilt\nCockpit full of memories and a drain full of guilt", "title": "One Of Four", "album": null, "image": "https://images.genius.com/64fbb9620a6b5e79e87c654b74da5441.640x640x1.jpg", "year": null}], "artist": "Aesop Rock"}