{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Awaiting the Spelndor (In Watermelon Sugar)", "year": null, "album": null, "lyrics": "Ay, yo, I'm walkin down the street on a sunny day\nUh, stoned and I'm waiting to splendor\n\nPass the shake, ice bender\nHey what up dude?\nThe cave shadows up in the mind flicker\nRegister the beautiful humanity of everything, right?\n\nAnyway cold sugar water in the memory\nWatermelon sugar in the sunlight\nA passing cloud, off of that loud\n\nThe sky is a very beautiful blue\nYou're a beautiful woman and I stare into your eyes sometimes\nThe eyes remind and I define myself as\nDivine universal as well as you, too\nThe spirit of us is everything anyway\nThe shape will do what it may\n\nYo, what is the shape of the clouds today?\nNo importa\nDemolishing a corn husk tortas, cold beer\nHold fear close to the heart, now release it like a scary bird\nSee it dissolve into very words describing it\nThe very woods previously conjured in a half-forgotten dream\nYes, those same ones, don't you remember oh, na?\nKool A.D, the best fuckin' rapper in the world, I'm so raw\nSprite like light off a Vikin', a k- k- king cobra\nNah, no, man, I dunno, nah, I don't really play that, though\nAy the dodeca, cylindrical\nCylindrical, yeah, okay, Testarossa\nRoja sola una autra oja en la hora [?]\n[?] compra mundo en la Coca-Cola [?]\nPeace, Allah, Ohio low roller-coaster\nNothing but [?] playas in [?] Westa Coasta\nSammy Sosa skin cream, Michael Jackson disease\nNah I really mean, nah, nah, nah, nah, never mean that, though\nR- remember the time we see the ice cream Egyptological [?]\nMy a- a- a- abstract connections are sneezed at my some\nBut to others it's they bread and butters\nI feel like Justin Bieber with a army of cutters\nI feel like Drake in that I occasionally hate myself, ha\nI feel like 2Pac, and I'm overrated and underrated at the same time\nI feel like Kendrick Lamar but I'm, uh, better than 2Pac But I'm also not better than 2Pac, and I'm not really\nI feel like Lil' B but I made a lot of rap songs like him so that's why I feel like that\nKool A.D., man, I don't really even fuckin' stop rapping, yo\nShout out to Too Short, hey what's happenin'?\nI feel like, uh, a white British guy that rap. What's his name? On the DJ Muggs beats? Street. Streets, plural\nI feel like rural sometimes\nEy, remember that joke on that one show, the rural [?]\nSometimes I- I go out and fix the water pump sometimes\nKnow what I mean? Like rural\nMan I used to sit up in the trap eating Monster Munch\nNow I'm sitting in the restaurant, lobster lunch\nYea, I used to walk through the ghetto eating Reese's Pieces\nAnd now I walk through the mellow fields feeling the peace\nI feel like David Byrne, Thom Yorke, David Foster Wallace\nAll those other fools I previously ever- ever fuckin' mention\nI felt like fuckin' Kevin Sorbo with a, nah, nah, fuck that dude, man\nFuck Kevin Sorbo, I heard he's racist\nI heard him described as a svelte dyke\nI feel like that's phoba- phobic, though\nSo uh, I feel like Brian Wilson trippin' out boomers in the K- K- Kokomo\nWhat? Exactly. See me\nRest in piece to Charles Manson and Imagine Reel [?] I'm a black Beatle\nI believe I can fly like Evel Knievel, total relevance\nAll reference [?], I feel like Lil' Yachty, Lil Uzi Vert, I'm on a boat\nI feel like T-Pain, praise Lucifer\nI feel like, uh, peace Allah, Jah Rasta Chango, praise Jesus too\nFuck it, I feel like Kodak Black whippin' a bucket\nAnd Pussy Riot\nI feel like Odd Future\nI feel like pussy whip, Riot Boys\nI feel like, I feel you man, look\nI'm listening to the White Riots\nIsn't that a song or a band, or s- s-\nSo White Riot is a song by The Clash\nYea, I feel like Ian McKay in Fugazi\nBruh, I feel like 21, 22, 23 Savage Garden [?]\nMichael Jordan, 23, with a basketball\nI feel like Steph Curry 30, heh. Three? No, 30, yea, I dunno\nWho's 23? Uh, fuck it, mayne\nRockin' bronze though\nI'm at the Pinkberry with your mom's hoe\nYo, M&M's on a iced tea Froyo\nIn my white tee with a Laffy Taffy and a Yo-yo\nFuck the po-po, shout out to Kassa O, though\nThat's your bro, though, huh\nSmokey type of tears of a clown, shout out to Bobo\nUh, me, I go Gorilla, throw signs like Koko\nYa'll rap like so-so\nMe, I Enter the Dragon with the spurs and the bolo\nKimbo Slice with the nice with it\nRice rockin' racin' in the East Oakland drop tank Honda like\nYea, your mama like\nI'm off of 5 hits of acid, I'm actin'\nI will dissolve into one of my own paintings\nFuck anybody hating\nLove is the best, yes, yes, ya'll"}]}