{"artist": "9th Prince", "songs": [{"album": "Revenge of the 9th Prince", "lyrics": "[kung fu sample]\nAre you ready?\n\tYes\nHold it, hehehehe\nNow, we're here at the orders of the 9th Prince\n\n[9th Prince]\nYo, I'm a legend with a lethal weapon, keep firing\nTil you hit the arms, slit your midsection\nI keep heavy artillary, I'm back on my military\nShit scare you worse than Hail Mary\nAttack like a killer whale, living underwater\nThe order is slaughter, all around the border\nLive on YouTube, camera recorder, yeah, rappers getting tortured\nKillarm', Arm & Hammers, broke Killa Sin out the slammer\nBroke like the speed of sound traveling, where's your manners?\nI know that that's vocalubary, my mind is a library\nMy heart is a mansion, you just a Little House on the Prairie\nBP on the production, no repurcussions\nHip hop is facing self destruction\nSave the music, don't abuse it or misuse it\nMy Killarm' niggas, we all ruthless\n\n[Chorus: 9th Prince]\nJust in case you didn't know my story\nThree and a half years, all pain, no glory\nJust in case you didn't know my story\nI'm bulletproofed down body, in the terrority\n\n[9th Prince]\nI'm a master like sensei, lady sings the blues like Sade\nMay day, may day, powerful swordplay\nCut records like Kay Slay, I'm like Riker's Island contraband\nMy flows hotter than Arabian sand, chains swinging like Tarzan\nRevenge of the 9th Prince, the man with the iron hand\nNever take the stand, my pen and pad is contraband\nShoot my way out, in the slaughter house\nFrom New York to Down South, yo, I'm out for new account\nI push through, like a V12, Lexus 600 double L\nAfrican jewels, keep it on the down low like R. Kel\nNeighborhood Robin Hood, it's just me and lady heroine\nGranddaddy Flow released from the pen\nThat's how the saga begins\nHe's back on the streets, healthy as vitamins\n\n[kung fu sample]\n9th Prince, you wanna kill us all?\n\n[Chorus]", "year": null, "title": "Just in Case", "image": "https://images.genius.com/af61f0ef977c2f691226fe0ab315bfd9.500x500x1.jpg"}]}