{"artist": "Andy Mineo", "songs": [{"title": "Shame", "album": "II: The Sword - EP", "year": "2018-09-21", "image": "https://images.genius.com/3d62c253098bd50249182914b928e556.720x720x1.jpg", "lyrics": "[Chorus: Josh Garrels]\nYou fly in circles around my head\nWhile I sit on the edge of my bed\nI cry, oh, what have I done again?\nIt's hard not to hate who I am\nIt's hard not to hate who I am\n\n[Verse 1: Andy Mineo]\nI chase the moment that when I had it I felt alive\nBut now that the thrill is gone, I feel dead inside\nI feel like everyone know the secrets I wanna hide\nAnd everytime they ask me how I'm doing, I just say \"I'm fine\"\nToo embarrassed to share it or maybe too much pride\nI create my own prison, holding the keys inside\nPunishing myself for all of these crimes\nAnd I'm trying to convince God that I'm not a waste of His time\nWhat's wrong with me? Am I defective?\nI keep on making a mess\nWhy can't I ever get it together?\nSoon people gon' find out I'm not what they expected\nThey see who I really am then I end up rejected\nI try to stand tall, but these knees are collapsing\n'Stead of asking for help these apps'll distract me\nSo lonely, but so many people are friending me\nWhile I post, I hope one day to be happy as I pretend to be\n\n[Chorus: Josh Garrels]\nYou fly in circles around my head\nWhile I sit on the edge of my bed\nI cry, oh, what have I done again?\nIt's hard not to hate who I am\nIt's hard not to hate who I am\n\n[Verse 2: Andy Mineo]\nUh, I was thirteen the first time my momma caught me watching porn\nShe started screaming, she couldn't believe her last born\nWas dabbling in something so destructive\nI wish I could have said it was my last time, but nah, it wasn't\nAnd the more I thought about it, the more I got bothered\nThese women I'm objectifying are somebody's daughters\nI never really thought I had a problem till it followed me to college\nAnd I felt debilitated by its bondage, uh\nBecame a Christian, heard about God's power\nCouldn't see it in my life, but I could tell you all about it\nOverloaded with knowledge, making so little progress\nBecame a public figure, but my struggles were in private\nOnly started tasting freedom when I'm being honest\nAnd I learn that when I'm weak is when I'm seeing God the strongest\nI know some people gon' be quick to throw stones\nBut I'll take all of those hits so you know that you not alone\nAnd after 28 years of life, I decided\nEverybody's crooked, some just do a better job at hiding it\nOh, how good does freedom taste?\nI hope they give me the forgiveness they gon' need one day\nI pray\n\n[Bridge: Josh Garrels]\nJesus, He washes away all of my sin\nWashes away all my sin\nJesus washes away all of my sin\nJesus, He washes away all of my sin\nWashes away all my sin\nJesus washes away all of my sin\nJesus, He washes away all of my sin\nWashes away all my sin\nJesus washes away all of my sin\nJesus, He washes away all of my sin\nWashes away all my sin\nJesus washes away all of my sin\nJesus, He washes away all of my sin\nWashes away all my sin\nJesus washes away all of my sin\nJesus, He washes away all of my sin\nWashes away all my sin\nJesus washes away all of my sin\n\n[Refrain: Choir & Andy Mineo]\nOh, oh, oh\nOh, oh, oh\nOh, oh, oh\nOh, oh, oh\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nHe washes away all of my sin (Oh)\nOh, oh, oh"}]}