{"songs": [{"year": "2017-02-05", "album": "K.A.A.N. X Eremsy EP", "image": "https://images.genius.com/0c0cd6b7cb85baa12225e4e14eb083cc.500x500x1.jpg", "title": "Blasphemy", "lyrics": "[Intro]\nEhh\nLawd\nKnowledge, nigga\nWoo\nHuh, God\nFuck!\nEhh\nLawd\nHuh\n\n[Chorus]\nAll these motherfuckers try to give me their opinion like I ever asked for it, like I ever asked for it\nTell 'em if I wanted your opinion, motherfucker, then I’ll probably ask for it, then I'll probably ask for it\nI'm the type of nigga that’s been living in seclusion, trying to deal with all the pain, trying to deal with all the pain\nHow the hell can I survive through the stress, I just want to find a way to maintain, find a way to maintain\nBut what is happiness?\nI loom in my sanity, it's lucid, and I feel like a loser\nI think I'm finna fade to an early grave\nI need to pray and talk to god, make sure my soul is saved\nI know I'm going straight to hell for all these blasphemies\nI hope one day that I'm forgiven so that I can finally rest\nI know I'm going straight to hell for all these blasphemies\nI hope one day that I'm forgiven so that I can finally rest\n\n[Verse 1]\nI can attest, I take your stories of a darker time\nA timid kid with no self-respect and a lack of pride\nI used to pray, before I slept, that I would cease to rise\nNobody understood my plight 'cause I was fucking silent\nAssuming that I would never make it to 25\nI saw my life as incidental and accidental\nI mentally manifested my message of many depressive tendencies, temper tantrums and nightmares\nI’m here, but only in a physical sense\nI’m soon to ascend as a sign of my [?]\nI lace the page with my theories\nLivin' the lines that I wrote\nI offer you honesty, truth ’cause that's all I have at the moment\nMastered the craft and the masses gazed in amazement and awe\nBut that's the allure, are you sure that I'm everything that you call me?\nConstantly honored by insecurities, certainly self-conscious\nOf course I was cursed to curtains and close ’em\nMy time has been running out of my mind into mediocrity\nModestly made a promise, a problem I couldn't keep and I'm speakin' for me\nThe music is the means to an end so if I offend or fender-bend then I repair it my friend\nThe paradigm that I'm in is pitiful, passing my pain\nCan I explain for a second these words that you can dissect?\nBut I won't accept what they set as a standard, sterilize your mind with the pen\nThe prison I'm in is unexplainable\nNot relatable, 'till you took a chance and flew\nI'm finally free but giving you me\nEven though my life is meek, it's still beautiful and unique\nI wanted to find peace\nWith a belief, said I would never retreat\nPut in the realest of worth, inside of a song\nSending you nothing but love\nShit that I'm giving is positive, demonstrative and delicate\nTalent I was given is a blessing from a higher power\nI am just a vessel to preach\nI beseech you with the gospel, sweep you off of your feet\nI just hope you pay attention to my meaningful speech\nGod dammit\nLawd!\n\n[Chorus]\nAll these motherfuckers try to give me their opinion like I ever asked for it, like I ever asked for it\nTell 'em if I wanted your opinion, motherfucker, then I'll probably ask for it, then I'll probably ask for it\nI'm the type of nigga that's been living in seclusion, trying to deal with all the pain, trying to deal with all the pain\nHow the hell can I survive through the stress, I just want to find a way to maintain, find a way to maintain\nBut what is happiness?\nI loom in my sanity, it's lucid, and I feel like a loser\nI think I'm finna fade to an early grave\nI need to pray and talk to god, make sure my soul is saved\nI know I'm going straight to hell for all these blasphemies\nI hope one day that I'm forgiven so that I can finally rest\nI know I'm going straight to hell for all these blasphemies\nI hope one day that I'm forgiven so that I can finally rest\nLawd\nEhh\n\n[Outro]\nNigga\nWoo\nI need a blunt\nSome weed in the Backwoods\nYeah we smoking fucking Backwoods tonight"}], "artist": "K.A.A.N."}