{"artist": "360", "songs": [{"album": "What You Hear Is What You Buy", "year": "2008-03-25", "title": "Amy, Amy, Amy", "image": "https://images.genius.com/e3fbdd8afe27f8dc4506cc60fdbc784b.600x600x1.jpg", "lyrics": "[Intro]\nAmy!\nAmy! Amy, you listening? Fuckin' hell!\nYou need to settle the fuck down\nYou're starting to lose your shit!\nIt's okay to party and have a bit of fun and shit\nBut you're fuckin' just, you're going overboard\nYou're embarrassing me\nYou're embarrassing your fucking family and friends\nJust chill the fuck out for a bit (God)\n\n[Verse 1]\nOkay, goddamn, Amy, Amy, Amy\nI've been kind of embarrassed, yo, but who the fuck can blame me?\nOne day you love me, the next day you hate me\nI'm sick of making all these damn excuses for you lately\nI've been meaning to talk but I've had to pick the best times\nIt's not just the drugs though, you're rackin' up the headlines\nYou have a bump and start rackin' up the next line\nAnd if we have to leave the house, you'll rack 'em up the next time\n(Oh, we'll do that next time, yeah?) You're stupid if you think your folks won't know\nCome on, let's leave the house, Am', the coke won't go\n(Come on, really?) But, really yo, I'm sorry for that low, low blow\nI took your arse to rehab, you're like \"No! No! No!\"\nYeah, you need to make a suitable choice\nGet off the crackie and try and save that beautiful voice\nJust stop and think for a minute, yo, you're Amy Winehouse, baby\nJust don't overdo it, I'd hate it for you to die now\n\n[Chorus: Amy Winehouse (Sampled)]\nAmy, Amy, Amy (Fuck yeah)\n(Party time now, bitch) Although I've been here before\nAmy, Amy, Amy (Yeah)\nHe's just too hard to ignore (Ayy, chuck us that bottle)\n(I know that) Masculine you spin a spell (Yeah, yeah)\nI think you'd wear me well (Oh, fuck)\nAmy, Amy, Amy (Can't even feel my face, dude)\nWhere's my moral parallel?\n\n[Verse 2]\nFuck yeah, Amy, Amy, Amy\nThe trashiness aside, in the bed, you go crazy\nHonestly, I can't get enough of it lately\nI'm all for a girl who loves to fuck me like they hate me\nYeah Amy, I fuckin' love you, baby\nWe've had a non-stop party since the remix with Jay-Z\nYeah, I mighta said it, having drugs is trouble, son\nBut, while you're up babe, can you rack me up another one?\nI ain't done shit, yo, I'm lappin' up the summer fun\nBeing a fuckin' trashbag, it has me stuck like bubblegum\nYeah, now she's got me equally as trashbag\nWalking London streets with half a bottle of Jack Dan's\nHaving people sayin' maybe I should lie down\nFuck out of my face, I'm all over the high now (You don't fuckin' know me)\nI just hope we don't overdo it and die now\nBut I could give a fuck, as long as I'm in the wine house\n\n[Chorus: Amy Winehouse (Sampled)]\nAmy, Amy, Amy (Yeah, yeah)\n(Fuck yeah, I fuckin' love this shit) Although I've been here before\n(I love this life) Amy, Amy, Amy (No reality whatsoever)\nAyy, you're too hard to ignore (Yeah)\nMasculine you spin a spell (Ayy, yeah, fuck yeah)\nI think you'd wear me well (Ayy, Amy, have another line)\nAmy, Amy, Amy (Oi, Amy)\nWhere's my moral parallel? (Another line)\n\n{Outro]\nAmy! Amy! Amy! Fuck!\nAmy! Amy! Fuck!\nUh! Fuck!\nYeah, quickly, I need an ambulance! My girlfriend just overdosed\nAmy! She's on um, heroin and coke\nSend someone over, quickly!\nQuick! Amy!\n(Amy, Amy, Amy)\nFuck!\n(Although I've been here before)\nFucking knew this would happen!\n(Amy, Amy, Amy)\nFuck!\n(He's just too hard to ignore)\n(Masculine, he spins a spell)\nWake up!\nAmy, please! Just wake up!\n(I think he'd wear me well)\nTried to tell you, tried to tell you to stop this shit!\n(Amy, Amy, Amy)\nFucking knew this would happen!\n(So where's my moral parallel?)\nFuck!\n(Amy, Amy, Amy)\n(Although I've been here before, yeah)\n(Amy, Amy, Amy)\n(He's just too hard to ignore)\n(Masculine, he spins a spell)\nAmy! Amy! Can you hear me?\n(I think he'd wear me well, yeah)\nWake up!\n(Oh, please)\nPlease wake up!\n(Where's my moral parallel?)\nFuck!"}]}