{"artist": "Cam’ron", "songs": [{"title": "Dip-Set Forever", "album": "Purple Haze", "year": "2004-12-07", "image": "https://images.genius.com/b6f4f4bab1804fbaae0c7dd7e0b294d6.1000x1000x1.jpg", "lyrics": "[Intro]\nLet's do it!\nSantana, Jim Jones, Killa, Freekey\nHow long we gon' have this shit on lock, man?\nYes sir, you gave me the right track Kanye\n\n[Verse 1]\nListen, I been coppin' them P's and\nMaybe that's part of the reason\nI feel like a boxer: bobbin' and weavin'\nBut I'm gettin' head, she's bobbin' her weave and (yes sir)\nI'm grabbin' her neck to stop her from breathin'\nI'ma wild out until I part with my breathin'\nUntil I'm sparked up and leakin', part of the cement\nI need somethin' pure, like from the Garden of Eden (why?)\nWouldn't mind makin' her part of my achievements (what happened)\n'Cause when music discourage my pride (who was there?)\nZeke the only one with courage to ride\nThe ride's so dirty inside, seems like we were playin' in mud\nHazin' it up, grams, gauge and a snub\nWho ill? A check for two mil'\nAnd a cheap case, defaced, blue steel, true skills\nI got stories that my soul can sing\nFlip water like Poland Spring and I'ma hold them things\n\n[Break]\n{Forever} that's right y'all\nDiplomats y'all, we here\n{Forever, yea-yeah} that's forever man\n\n[Verse 2]\nLook, talk to 'em\nLook, my fella said you been coppin' a lot\nLatest caper? Propellers on top of the drop\nBut fuck it, who ever thought I would rock at the Roc? (Killa!)\nTop a top on top of the top\nBut yo - nothing definite, I chop up the rocks\nAnd I stop up the drop, Blocka Blocka the block\nHello mate, yellow tape, helicopter your spot\nWhat you wanted is not what you got\nAnd I pop up them cops\n'Cause dog, it ain't about Cam (it ain't about me)\nI got a son homeboy, it's about Cam (for that?)\nIt's about being 'bout It\nIf you're not, you're ass backwards\nMy mathematics cause cash matters (that's important)\nLittle niggas need to sit up and breathe\nIf the town too hot, get up and leave\nNiggas always got a trick up their sleeve (always)\nNigga like me - I always got a brick up my sleeve\nAnd that's for-e-ver\n\n[Break]\n{Forever} Jim Jones, Freekey, Santana\n{Forever, yea-yeah} we here, we here\nI got it Guru (let's wrap it up man)\n\n[Verse 3]\nShit, I was two blocks from coppin' dust\nI used to hop the bus\nNow look dogg, ain't nobody hot as us\nGirls, they gotta rush, shit, they gotta blush\nWanna go in the mall just to shop with us\nTo how they piss and, bitch, how they ran a mile\nFuck Killa Cam, they in love with Cameron Giles\nDamn, I gotta smile, hundred grand, I demand it\nGoddamn it, the boy the boy done done it, child\nAnd that's forever, man\n\n[Outro]\nYou hear it, uh huh\nWe here, I love y'all man\nIt's nothing boy\nDash, Hoffa, Young Guru\nWhat's really good?\nHolla at your boy\nI might have this shit on lock man\nKanye, Harlem, Chicago, Columbus - holla\nChicago, you have your own Kanye West on the track\nHarlem, you know who the fuck I am - Killa!\nWe just want you's to know Diplomats is here\nWe ain't going nowhere\nHolla at ya boy-boy, let's ride out man"}]}