{"songs": [{"year": "2014-11-14", "lyrics": "[Hook: B.o.B]\nEast Side Ho\nWest Side bitch\nI'm a Candler Road Nigga\nDoin' Candler Road shit\nWith a blue Bankroll\nTrophies on my neck\nAll I do is win nigga all I do is flex [2x]\n\n[Verse 1: B.o.B.]\nWhen I wake up I get fresh\nRollin' up the best\nCause I came up from the bottom\nLike a mogul I finesse\nNigga bangin on my chest\nBang-bangin on my chest\nMade it happen from the ground up\nFrom a boy to an Exec'\nTold the teacher I can't do it\nWith no suit and tie and desk [?]\nWhyt these haters always hatin'?\nI don't know I can only guess\nGot a watch out for these snakes\nThat's always searchin' through your set\nTryna' infiltrate your circle\nTryna' steal all your connects\nMan these young hoes out here wilin'\nStraight up hoein' like a vet\nShe be goin' like a Boeing 747 Jet\nYou should see a boy in action\nI could swisher architect\nI'm already fuckin' stoned\nHow much higher I'm gone get?\nI said\n\n[Hook: B.o.B]\n\n[Verse 2: Bankroll Fresh]\nWest Side B.I., Cameras in the V.I.,\nWho they came to see? Us, on 3 throwed 3I\nBad hoes on the east side, kiss that thang I P.I\nDonuts when I leave out, old school with the TISA\nDon't trip over no hoes, so lil bitch don't put your feet out\nYou can drank my Sedi, fuckin' then I peace out\nPossess where the C. At, M.O.B. what we be 'bout\nWater on my neck and wrist I damn near brought the sea out\nEar ring costs a Fiat, I brought the movie Visa\nShe drop it to the floor, she work the pole I throw a G out\nI'm with that Magic city, bloody Pino's we hit 3 spots\nAnd pulled up on my playa partner, boy we on the East side\n\n[Hook][2x]\n\n[Verse 3: Bankroll Fresh]\nWest side bitch, difference on 3\nMan we in the streets from the West to the East\nPeople countin' rolls, this McAfee\nFuckin with my denim make your hand touch your feet\nDifference on 4, differences roll\nDifferent bank yeah, you know how it go\nDifferent out the temple, different out the ville\nHustle nigga for all of my niggas that ain't here\n\n[Hook]", "title": "Candler Road", "album": null, "image": "https://images.genius.com/f6fff291d53c119ac42160a83589ce96.500x500x1.jpg"}], "artist": "B.o.B"}