{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro]\n(You're now rockin' with the best)\nYep, when I was a kid, my mom said I was like\n80 percent deaf, which really explains a lot\n(Bow down)\nYep, ha, hey this goes louder right? Now louder, louder\n(Turn my music high!)\nHa, Strange Music, ha\n(Turn my music)\n\n[Verse 1]\nHigher than a helium balloon filling up full of holy smokes\nWho be fucking with the Morse code mayhem?\nBet I batter anybody challenging the post\nI'm assigned to the snake and bat\nSo you can throw away your basic facts\nAbout them suckers and them ancient raps\nWith a baseball bat I (Turn my music)\nHigh high lemme be your savior\nPlay the tunes loud, wouldn't wanna be my neighbor\nGimme the time to rhyme and I violate her\nBlowing her mind I'm like a live vibrator\nBack many many years ago\nRock-a-fella fronted me out of a single due\nJust blaze made this track so I figure I would rap\nOn his shit it's the least he can do\nIf you looking for nemesis I'm the better\nThe genesis I been thinking of sending this\nBut I need you to bleed on your knees and I leave\nA disease no dreams or schemes you can reminisce\nIn the city where the pity's indivisible\nAnd the looking I been bookings all cynical\nI been rocking so long in the interval\nI'm here praying for a bit of the residual\nShouts to the stone, hit me with a himmi I'll be hyme 'til I’m gone\nStrange on the linen Morse code on the bone\nSee a bunch of drones and I'm getting me a clone\nHow the fuck you think you gettin' by high\nAs kite when I'm out here raining bricks\nYeah you wanna be famous\nYou ain't even recognized by the strangers bitch!\n\n[Hook] (2X)\nTurn my music high, high, high\nHigh High, high, high, high\n\n[Verse 2]:\n(Bitches)\nThey keep on running with the other\nMother fuckers over this dope fella\n7 years and we got mad cheers\nAnd we still ain't never been invited to Coachella\nBut that's fine still on the grind\nRecord tour time, Show 89\nWoosta (Worcester) been live Denver's alive\nLittle rocks fly damn I'm high\nWe in Tucson tattooed beauty with the boots on\nBap-boom ringing what are you on?\nI bet ya get ya flows from the groupon\nI used to battle for the dough\nBut they made the rules change\nFrom the free to no beat with the pen\nWell if I'm gonna write shit then I'm gonna write this\nI don't really need to diss you to win\nGive it away, give it away, give it away now\nFree styles like I never had to pay rounds\nSpeak miles and I running round the playground\nWe foul and you loving every minute of it\nGot 'em all going snake and bat shit\nMy fundamentals l-m-n-o take the hat trick\nYou in a rental going mental bacon back bits\nI'm here in the kennel on some face the fact shit\n\n[Hook] (2X)", "title": "Higher Freestyle", "year": "2013-01-31", "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}