{"artist": "Watsky", "songs": [{"year": null, "lyrics": "[Verse]\nI love all cats\nEven copy cats\nDr. Seuss cats\nIn their floppy hats\nI love bobcats\nI love tomcats\nAnd your mom cats\nEven wombats\nLove a fruit bat\nHate a combat\nLove a comerade\nHate a Comcast bill\nI don’t want to battle but if you really wanna fight then you can fire at will\nLet’s just play pirates 'till\nLegit we’re scallywags\nHit me in the leg and put a peg in it instead\nAnd then I bet that it’ll benefit my Cali swag\nHey where’s my rally rag?\nMaybe my fanny pack\nWinning winning winning\nEvery inning, every round\nAnd when I’m down I’m gonna hit like Manny Pacquiao\nI’m running laps now\nDo jumping jacks\nCelebrate our friendship in a slumber party\nKilling in a pillow-fight and with my Rumble Pak\nI don’t hit punching bags\nI pick the pumpkin patch\nWho’s the little pisher so ambitious that he’s bigger than his britches\nAnd has got two thumbs attached?\nO hai!\nThis guy right here!\nCredit to Reddit you bet I’ll never forget I’m forever indebted\nAnd Ellen for getting the cougars to check it\nIt’s too good to take and so I’m gonna go dry my tears\nGonna meet up at a 7-Eleven to pick up a dank donut pack\nI look at myself in the glass and go ‘Oh what?!’\nTaking a bit of a nap, then I’m waking up for snack time\nMaking our way to the back of line, ’cause we don’t cut\nNever get up at the crack of dawn if I can help it\nWanna be able to tag along when sun is setting\nGotta be open to having a long and healthy session\nTaking the love I got and then I try to spread it\nWhy would I want a pet if I can’t even pet it?\nI don’t know! I don’t want any lame pet\nMe and my pet are winning\nIt’s game, set, match\nI worship Biggie, Pharoahe, Eminem, and Busta Bust and Mr. Fade to Black\nBut could I be the Best Ever rap threat?\nOf course I’m not, silly rabbit!\nThere’s billions of people\nAnd we haven’t heard any animals rap yet\n\nGood girl", "image": "https://images.genius.com/15e329cac8808712e9bcdedd4c1b05fd.1000x1000x1.jpg", "album": null, "title": "Goat Fast Rapper"}]}