{"songs": [{"year": "2011-05-03", "image": "https://images.rapgenius.com/6478121f52fa3b0248edb20e7d06e076.300x300x1.jpg", "title": "All I Kno Is Hood", "album": "Damn Fool", "lyrics": "[Verse 1: Big Scoob]\nTramp, yap, yooby or yicky it's all ratchet\nWhore, slut, bitch or a floozy the same reaction\nBlood, cuz, nothin' but thugs, we all active\nMean mugs up in the club, them niggas active!\nHard heads, goonies so loony, ready for action\nFive blocks, six and a seven, nigga what's hapn'en!\nHood shit, hoodies and dickies - that’s how I dress\nReal spit, homie, you know me, I am a mess!\nWhite V diamonds be shinning throughout my teeth\nNo sleep, hustlin' and grindin' and tryna eat\nBrain wired, all I desire is grimy shit\nFlame fire out of the muzzle when choppers spit\nDice games stay in my lane a gutter bitch\nThick hips loving my fame, but she ain’t shit\nHood rich, chef in the kitchen, I got that twist\nSo slick, planning and plotting my next lick\n\n[Hook: Krizz Kaliko & Big Scoob]\nAll I kno is hood, all I kno is hood\nAll I kno is hood, all I kno is hood\nAll I kno is hood\n\nAll I kno is hood, all I kno is hood\nAll I kno is hood, all I kno is hood\nAll I kno is hood\n\n[Verse 2: Big Scoob]\nYada, yams, yayos no difference, it’s all yickins\nDrop it, lock it, rock it, I’m twisting it in the kitchen\nPistol popper, knocker, a chopper it’s all heat\nGlock 'im, pop 'im, drop 'im or stop 'im if I don't eat\nBody with me sticky or difference, it all moves\nHustle, juggle, cope with the bubble, I can’t lose!\nChips, cheese, paper and yaper, it's all bread\nGridders, grinders, hustlers in bushes, we all fed!\nSnitches, bitches, witness, informant, it’s all the same\nShaking, backing, kidnapping, taking piss on his grave\nGang bang, reppin' the name I’m from the soil\nRap game, nothing but flames, I got that oil!\nGudda budda, seepin' and leakin' like I’mma boil\nOld school, acting a fool, that delta royal!\nSlang speech, talk of the streets, I’m tryna teach\nPreach, heat over these beats, expand my reach\n\n[Hook: Krizz Kaliko & Big Scoob]\nAll I kno is hood, all I kno is hood\nAll I kno is hood, all I kno is hood\nAll I kno is hood\n\nAll I kno is hood, all I kno is hood\nAll I kno is hood, all I kno is hood\nAll I kno is hood\n\n[Verse 3: Big Scoob]\nPistols, packs, pieces, my pirates, my bushel fire\nPussy, power, privilege, I live this, this all I got!\nFiends, phonies, fakers and flunkies they want it from me\nMuscle, hustle, tussle and struggle, I need my money!\nSnitches, bitches, leeches and rickets, now I’m the target\nBad intentions, vengeance, I’m with this, let’s get it started!\nRain, pain, walk with the flame, I gets retarded\nStreet beast, bring me the beef and watch me char it\nNo sleep up for a week, I’m chasing paper!\nSlow creeps back with the heat, I’m in my scraper!\nSo deep, most of my peeps - they didn’t make it!\nLocked back or resting in peace, this shit is sacred!\nMusic moving up in this movement, but I’m still losing\nTryna do it, prove it, pursue it and get down through it\nSlept on, comin' to get it, I knew I could\nSo strong, taking the throne back to the hood!\n\n[Hook: Krizz Kaliko & Big Scoob]\nAll I kno is hood, all I kno is hood\nAll I kno is hood, all I kno is hood\nAll I kno is hood\n\nAll I kno is hood, all I kno is hood\nAll I kno is hood, all I kno is hood\nAll I kno is hood"}], "artist": "Big Scoob"}