{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/7a51c0ae033b11af2b858645e8922783.709x709x1.jpg", "year": "2008-11-17", "album": "Stereo: A Hip Hop Tribute To Classic Rock", "lyrics": "I guess my daddy used to be barber\nHe took lines to the head and cut so many daughters\nAnd left a trail of little midgets running loose\nIn the Dixie land of 'Bama where the baby had no roots\nA single wide in the woods and a Harley\nNo bill money, no food, no Atari\nWhat a fucking life, good job dad, sorry\n\nBaby's in the cradle, plastic spoon\nLittle boy's blue, black clouds on the moon\n\nMy mother must have been a cute girl\nA rebel at school, living in her own world\nShe left behind a legacy that only speaks bad with\nRocks in purses, whooping girls' asses\nLeft home young, left wrong impressions\nMade bill money in bars and weed runs\nTook ahold of drugs, what a life, good job mom\n\nBaby's in the cradle, plastic spoon\nLittle boy's blue, black clouds on the moon\n\nYep, together they were like the perfect pair\nDaddy had the matchstick, mama had the flair\nFlames got lit, shit got burnt\nThe roof caved in, the table got turned\nI was wounded by the scene, but pass that salt\nMake it hurt worse, give me more alcohol\nLook at me now, good job y'all\n\nNow I'm, all grown up\nGot a new gun, got a new truck, you just\n(Waiting for the sun)\nSo come home\n(Waiting for the sun)\nI am home\n(Waiting for the sun)\nWhen ya coming home?\nWell I don't know when\nI don't know when\n\nWell guess who's back in jail\nYour mama wanna know if you got money for the bail\nYour daddy's in the county for not paying on support\nThey tagged him with a fine for not showing up to court\nFuck it, here's 500 dollars for him\nI did it for my little sister, I ain't sorry for him\nTell that motherfucker I want it back in the morning\n\nDaddy's in the county with the plastic spoon\nBail money up, what's he gonna do\n\nHe'll probably run into another trailer\nKnock another lady up and leave her laying there\nHe might go to crack another beer\nHe might go to do some blow and shorten out the dealer\nI'll probably save him from another bullet\nFrom another crystal meth pusher with a mullet\nOr I might load the gun myself and tell him just to pull it!\n\nPull it!\n\nFlowers in fields\nOf red and blue\nDreams of a hill\nWhite clouds too\nAm I still here?\nTell me the truth\nIf this dream is real\nI'll rest in peace off the roof (jump!)\nPeace off the roof (jump!)\nPeace... (jump!)", "title": "In The Cradle"}]}