{"songs": [{"title": "Cookin", "album": "Bad Dreams EP", "year": null, "image": "https://images.rapgenius.com/efddf7c6251161523359d83a197a186f.600x600x1.jpg", "lyrics": "(Intro)\nDamn\nAye\nShit!\n\n(Chorus)\nDamn\nChopper by the bushes (Aye aye)\nGod! I guess he wasn't lookin'(aye aye)\nIm cookin' (GODDAMN!)\nIm cookin' (damn)\nChopper by the bushes (Damn Damn)\nI guess he wasn't lookin' (Damn)\nIm cookin' (aye aye aye)\nIM COOKIN'!\n\n(Verse 1: Larry June)\nI ain't got no mothafuckin' patience (Aye, Sock it to me)\nI just went to Saks and went crazy (Yea Baby!)\nBitch\nI done step my fuckin' game (shit!)\nBitch!\nI got my mothafuckin' weight up (aye aye)\nAnd you told your bottom bitch that I'm a lame (goddamn)\nBut that ho came and chose anyway (sock it to me)\nI'm the realest nigga in the rap game (aye)\nMade a half a million flip-\nAye hold on hold on\nHit me on my trap phone (aye aye)\nI'm paranoid i think they tapped my living room (SHIT!)\nSo much money money bruh we need a bigger room (YEEHEE!)\nMake sure them packs fuckin' k-9 proof (AYE!)\nDon't trust them niggas bruh cause they'll tell on you (YEEHEE)\nToday I kept it simple and killed em with McQueen (SHIT!)\nIn 010 man I killed em with Supreme (GODDAMN!)\nI'm getting head while I count a hundred G'z (SOCK IT TO ME!)\nShe going crazy while i'm screaming\nAYE\nYEA BABY!\nSOCK IT TO ME!\n\n(Chorus)\n\n(Larry June)\nAye hold on bitch hand me that bottle of water real quick\n\n\n(Verse 2: Larry June)\nI check my phone then I roll another blunt (aye aye aye)\nI'm to the neck cause these rap niggas sus (YeeHee!)\nOn my mama nigga I don't give a fuck (I don't give a fuck!)\n20 pounds in a Greyhound bus (GODDAMN!)\nI got Bitches\nI got Drugs\nI got Guns (YeeHee!)\nListen nigga this is pimping one-on-one (Damn)\nDon't let her choose if the bitch ain't got nothing (Sock It To Me!)\nYou love the bitch lil nigga quit frontin' (Yea Baby!)\nToday I kept it simple and killed em with the Trapstar (GODDAMN!)\nStreet nigga all I fuck with is fast cars (YeeHee!)\nIf shit get ugly then I'm back to gettin' packs off (aye aye aye)\nYou know we on em if he pull up with that mask off (bop bop bop)\nI'm in the Pointe I met the nigga at the B&J's (Aye!)\nI'm on a yacht\nWith a bop\nSipping lemonade (GodDamn!)\nI got my money up I'm lookin' at some real estate (Damn)\nIn 010 man I used to hit the interstate (ayyeeeeeee)\nAye Aye Nigga YEEHEE!\nSock It To Me!\n\n(Chorus)"}], "artist": "Larry June"}