{"artist": "Problem", "songs": [{"album": "Selfish", "title": "354", "image": "https://images.genius.com/8165c0445cec284a3a939bed51fc0555.1000x1000x1.jpg", "lyrics": "[Intro: Problem]\nYou found it hahaha\nYou found it hahaha\nYou found it hahaha\nHey you gonna put some of that Cazadores in a cup for me?\n(Diamond Lane)\nWhat?!\nYea\n\n[Hook]\nWhat you reppin', bro? (aye)\nWhat you reppin', hoe?\nWhat you reppin', bro? (aye)\nIt's what I reppin', hoe\nThree-five-four\nIt's what I reppin', hoe (what)\nThe realest that you niggas ever seen before\n\n[Verse 1]\nStunting on these niggas is a hobby (yea)\nPaid like I'm in Illuminati (yea)\nGettin' money my niggas who your p[?]\n[?] stackin' like the county, check\nRun up on me nigga I'm for surely with the funky\nDust you off and pick my daughter up like it is nothing\nI put this on my ballers and EBT niggas\nGet a nigga punch'd like my TDE nigga\nChachi, Diamond Lane, three-five-four, tho\nWest side Compton, east side warzone\nYou know the city split where that 110 sit\nMy niggas on ten, we done drunk ten fifths\nChachi, what you on? They just got to know\nStill deliver Ps, call me Dominos\nNo soccer, but I done hit a lot of goals\nYour favorite bitch, bro, I done hit alot of those\n\n[Hook]\nWhat you reppin', bro? (aye)\nWhat you reppin', hoe?\nWhat you reppin', bro? (aye)\nIt's what I reppin', hoe\nThree-five-four\nIt's what I reppin', hoe (what)\nThe realest that you niggas ever seen before\n\n[Verse 2]\nWe 'em niggas, we 'em niggas, as far as Compton go\nWhat I hear otherwise, its hella comical\nWhere these bitch niggas keep me laughin'\nJohn Wall, Steph Curry with the passin' tho\nDiamond Lane gang, if you askin' tho\nBut first, why you askin', bro?\n\n[Hook]\nWhat you reppin', bro? (aye)\nWhat you reppin', hoe?\nWhat you reppin', bro? (aye)\nIt's what I reppin', hoe\nThree-five-four\nIt's what I reppin', hoe (what)\nThe realest that you niggas ever seen before\n\n[Instrumental/ Beat Switch]\n\nChachi\nWhat?!\n\n[Hook]\nWhat you reppin', bro? (aye)\nWhat you reppin', hoe? (aye)\nWhat you reppin', bro? (aye)\nIt's what I reppin', hoe\nThree-five-four\nIt's what I reppin', hoe\nThe realest that you niggas ever seen before\n\n[Verse 2]\nYea, yea, yea\nHeard the streets been sayin' something, what the fuck they talkin'?\nThere'll be no verbal responses, we'll just get to chalkin'\nHit the vape then yellow tape and so proceed with caution\nHit your gym with lil' shooters, but ain't talkin' Boston\nBut I got a bird with me, bro, we fly as hell\nKeep them gunners but I'm down to let them fly as well\nDidn't like the number, so I changed my clientele\nLoyal with the ball but never let my clients tell\nI got some niggas I ball with that's gon' die in jail\nBefore they go against the code they rather die in jail\n(Three-five-four) Let your diamonds yell\nBall or fall, Heaven bound or we gon' fry in Hell\nGather for this diamond lane shit\nNiggas thought they would never play this Diamond Lane shit\n(woahoh)\nYea, life is like a box of chocolates\nNo, life is like a box of options\nWould be further, but I got a conscious\nYou know that fuck shit I ain't gettin' with\nCompton Peter Pan on his nigga shit\nBro, I see you shinin', Snapchatin' from your nigga shit\nYou ain't got no hoes 'cause you too busy riding niggas dick\nI won't say no names 'cause that ain't cool and I don't benefit\nI don't benefit, quite frankly, I don't give a shit\nLife's just a bitch, so who cares if you nothin' hoe\nIf you ain't down to die for what you reppin', what you thuggin' for?\n\n[Hook]\nWhat you reppin', bro?\nWhat you reppin', hoe?\nWhat you reppin', bro?\nIt's what I reppin' (oh)\nThree-five-four\nIt's what I reppin', hoe (what)\nThe realest that you niggas ever seen before", "year": "2017-11-03"}]}