{"songs": [{"year": "2016-04-13", "image": "https://images.genius.com/4107e2e55f228b9893b8b22ac0e4527a.1000x1000x1.jpg", "title": "It’s Whateva", "album": "MAGIC: 19", "lyrics": "[Intro]\nChulo Chulo Bishy, Ughhhh Ugh Check me out\n\n[Verse 1]\nThese rappers phony nah not my homie\nI be chillin lowkey\nFly by my lonely\nIn my own zone no\nNo one coached me\nI'm a young  Kobe I be going OD\nFlow is so heat but I'm so sleek\nCold homie ya whole team weak\nDon't like stores it beyond e\nMe I got a full tank and gon' speed\nTill the cash and they last in the race\nI be going like flash can't pass my place\nIn the past they would hate, now they gravitate\nSo I grab a taste and  show that they waste\nWhy wait? When I could annihilate\nI bring fire and at a higher rate\nNine years ago I was trying to skate\nAnd get sponsored, now sponsors gettin cray\nJust to hear what I be havin to say\nThey be like, \"Yo bishy bish, you slay.\"\nI be like \" I know it, I'm a poet, What you been listenin to anyway?\"\nHaters can decay\nAin't a space to stay\nI do what I do and do it my way\nI remember when the skies were gray\nNow I'm killin these guys like child's play\n\n[Hook]\nThey can keep hatin, It's whateva\nI've been gettin greater, gettin better\nWho you? Why you hatin? It's whateva\nThese dudes steady hatin, it's whateva\nIt's whateva, it's whateva, it's whateva, it's whateva\nWho you? Why you hatin? It's whateva It's whateva It's whateva\n\n[Verse 2]\nBish kicks it well they wish to prevail\nA quick pick for real I stick and they fell\nYour chick wish to chill\nShe thick in the bell\nWe click on the real cause\nI don't kiss and tell\nMe? I'm a cell and that's just a fact\nThe tracks I drop crack will break momma's backs\nNah I don't slack need backpacks of Wax\nSaid they do is backpack but my swags intact\nWhile they tacky don't ask me nothing\nI'm a fly NY guy who known for stuntin\nIt was ninth grade but I had senior's crush\nAnd By the tenth grade I was already buzzin\nNow the game I'm running and the fame is coming\nBut I care for change like a pac or somethin\nToo apocalyptic\nGot it lookin cryptic\nI'm a green lotus\nYou a dented civic\nI don't talk I live it seeing visions vivid\nKnow that Imma get it\nNo more acting timid\nThey know I'm sick just they gonna admit it\nWhat you tryna do I already did it\nYoung nigga sex symbol I could get wit it\nI'm simply wit it and you won't forget it\nI'm here for no minutes I'm here to the finish\nAin't here for no minutes I'm here to the finish\n\n[Hook]"}], "artist": "Bishop Nehru"}