{"songs": [{"year": "2008-01-29", "title": "Gunz Yo", "image": "https://images.genius.com/53b6cf23d3b9c3491d5918ea4087005b.640x640x1.jpg", "lyrics": "I'm on fire, I'm on fire\nMe too, Me too\n\nGunz yo\nI keep one in my pillowcase\nIt keeps me safe when I sleep\nStill I keep awake\nWhat if my dream girl pays a midnight visit?\nI see the world through the scope but I gain no insight with it\nWhen I get introspective I put the safety on\nMake these songs with the biscuit sittin' in my shaky palms\nI'm a man now (a real man)\nNot the one who went to two colleges groveling over meal plans (nah)\nI'm staring at the ceiling fan all wide-eyed\nAmazed by the ways the blades break the silence\nI used to be afraid of firin'\nThe sound was startlin'\nBut now I'm startin' to hate the quiet moments\nMight remind you of a mic by the way I hold it\nTo the grill\nA homophobic rapper\nUnaware of the graphic nature of phallic symbols\nTragically ironic (suckin' off each others gats and pistols)\nI got more back issues than Guns & Ammo\nCuz my uzi weighs a ton\nAnd I never let go of the handle\nHangin' on to mommy's pantleg\nDouble-fisted\nKnee-deep in shells, kickin ballistics\nThis dick! is a detachable penis\nAn extension of my manhood, position like a fetus\nAn intravenous hookup feeds bullets to my magazine\nNever mind the bullets\nMy pistol is a sex machine\nGunz yo (sex ma- sex machine)\n(One, two, there you go-a)\n(Insert nuclear symbols here)\n\nBust it\nI got another gun\nI keep it in my briefcase\nIt keeps me safe at my workplace\nCubicle gangster who's in need of his personal space\nAngster of love who's unable to look girls in their face\nCause I know that only stupid people increase the birthrate\nI'm just about dumb enough to hold up a sperm bank\nMake my demands and then facilitate fur trades\nEmpty the bird cage and release the mermaids\nI got a water gun (what)\nI keep it in my mouth\nIt keeps me safe from the things I like to speak about\nBut words are leakin' out\nAnd all these smiles that I crack\nAre like a dam on the verge of collapse\nThere ain't no turnin' back\nIn fact\nI can't hold down my fluids\nCan't retract statements\nWithout water displacement\nFlooded the basement\nThen sought refuge\nRemoved my waterproof vest then I kicked off my wet shoes\nMade it to dry land, pistol in hand\nFistfuls of ammo riding on a camel in the desert sand\nLucid dreams are a lot like computer screens\nPeople have pretentious conversations but I shoot the breeze\nBlow a hole straight through their long-winded theories\nHold my own and make songs for them sing with me\nIt's the same type of heat that Millie used\nTo break the ice with Santa Claus\nWhen she made him sing the christmas blues\nCapitalists strung her up for killin' him\nEvery manufactured holiday they sacrifice another victim\nBefore wartime depression sets in\nI get to steppin'\nAnd shoeshine my weapon\nI'm Hemmorhoid! I'm the leader!\nYou're dead like De La\nI hold my crotch like a nine milimeter\n\nGunz yo (nine milimeter)\n(I'm on fire, I'm on fire)\n(Me too, me too)\n(Sex ma- sex machine sex machine)\n(One, two, there you go-a)", "album": "A Healthy Distrust"}], "artist": "Sage Francis"}