{"songs": [{"title": "Ratchets", "album": "Queen D", "year": "2013-02-20", "image": "https://images.genius.com/ae537525e40c1c90d5d1a093667645a5.1000x1000x1.jpg", "lyrics": "[Hook]\nI got bitches, you got bitches\nTell them bitches come over\nIf they ratchet, let’s get ratchet\nPick ‘em up in that rover\nI got ratchets in my living room ’til 6 in the morning\nAnd when I finish up this weed, man I’m sending them home\n\nI got bitches, you got bitches\nTell them bitches come over\nIf they ratchet, let’s get ratchet\nPick ‘em up in that rover\nI got ratchets in my living room ’til 6 in the morning\nAnd when I finish up this weed, man I’m sending them home\n\n[Verse 1: Lil Debbie]\nI got ratchets and some bitches\nCoke lines, no soft drinks\nBen Franks, that green dank\nWet pussy, pink paint\nBitches in my crib, I got these ratchets in my mouse trap\nI pulled up in that rover, that dark tint, all black\nYep, I got them saying \"Debbie, you the fucking baddest\"\nCuz I be smoking on that kush'n like a fucking mattress\nWe could link up codeine cups, bitch drink up\nWe turned like tea cups, cold sprite, syrup\nBoss bitch and my whip clean, eyelashes on point, ho!\nThe Jordan chains go Michael, free throws my eyes closed\nLittle Debbie, swagging out, I'm laced out, what you talking 'bout?\nGold chain it might save your life\nI'm leaned out when I'm walking out\nLeaned out when I'm walking out (x2)\nGold chain it might save your life\nI'm leaned out when I'm walking out\nLeaned out when I'm walking out (x2)\nGold chain it might save your life\nI'm leaned out when I'm walking out\n\n[Hook]\n\n[Verse 2: Lil Debbie]\nI got some sprite, I got some codeine\nYou fucked up off no drinks?\nWhite reefer, fly sneakers, tint glasses out giant big\nHate me 'cuz i love that\nGet high with these ratchet bitches\nI got that range rover\nDark tint, I might add some switches\nThat means I'm balling and these ratchets fronting like they know me\nOnly if I had a dick yo they could fucking blow me\nAnd everything I want I cop it like the fucking police\nI'm faded like I'm Kobe, weed, I smoke it by the OZ's\nThey in my function and they smoking all of my weed\nAnd I ain't tripping off these hoes, I pop another molly\nDon't you wish you had this green up all in my safari\nThey talking lip, I turn these ratchets into Calamari\n\n[Hook]"}], "artist": "Lil Debbie"}