{"artist": "50 Cent", "songs": [{"album": "24 Shots", "image": "https://images.genius.com/d013d7c8e2efa19c735a5ac9bbf7cd59.400x400x1.jpg", "title": "Look What You Made Me Do", "lyrics": "[Verse 1]\nNow if I pull out the gat and just push your wig back\nI bet niggas will stand around sayin' \"Damn who did that?\"\nI'm the type nigga to dare you to touch the jack\nI'm the type to borrow your gat then won't give the shit back\nIm F to the I - F -T - Y - C - E - N - T\nCaress the ass gently in back of Bentleys\nYou thought she was pimpin, son I was in the Hamptons\nIn a heart shaped hot tub with the bitch flappin\nI'm planning to take over New York then start expanding\nWas Bob Marley singing about teks when he sung \"I'm Jammin'?\nNigga fuck with my cash and I'll blast yo' ass\nSnatch the Glock out the stash in the dash in mash\nFlee in a flash, lay low let time go past\nIf you survive the shots I'ma find yo' ass\nPut the gat to your head and remind your ass\nI ain't playin' with you, I want my money motherfucker\n\n[Verse 2]\nYo, some nigga just shot the block up dog, word?\nHe had the same shit you got on dog, word?\nI know you done did it so get the fuck up outta hear, ya heard?\nI run with niggas that'll spray and strip and stay there shit\nYou won't let us pump on your block, fuck it, we makin it hot\nI'm that nigga that call the shots, with the iced out watch\nFrom the cordless cell phone in baby blue drop\nI got a lot of hungry niggas with me straight from the street\nThese industry niggas are startin' to look like something to eat\nThey got watches on they wrist that cost like 60 thousand\nMy niggas living on section eight in public housing\nThey'll murder you and keep the shit low cause niggas heard of you\nThem b-more niggas is rowdy rowdy\nThem Detroit niggas is bout it bout\nIf they say they gonna kill ya nigga don't you doubt it\nGot your gun well don't leave home without it\n\n\n[Verse 3]\nYo, your man could have ran when I robbed him but he froze\nSon I ain't even rock him to sleep, the nigga dozed\nThe bitch could have helped you get rich, but she chose\nNow you heart broke, that's what you get for lovin' them hoes\nAn ill flow with no beat, is incomplete, it's like a stickup kid\nRunnin round without no heat, it's like a fifth with no kick\nA fiend with no hit, a willie with no wit\nA bad bitch that won't blow dick\nIt's like a rollie with no ice, a gamblin' spot with no dice\nLike fuckin' supermodel bitches and not bustin' off twice\nI murder any mic device, for the right price, I'm nice\nI only say things once, never twice, don't fuck with me", "year": null}]}