{"songs": [{"year": "2017-11-10", "image": "https://images.genius.com/181a4a0e2becea0941f29f4571fcb1c2.1000x563x1.jpg", "title": "Big K.R.I.T. Freestyle | LA Leakers Freestyle #030", "album": "LA Leakers Freestyles", "lyrics": "[Intro]\nYeah\nYeah\nYoung Krizzle\nThird coast\nYeah\nYeah\nYeah\n\n[Verse 1]\nI woke up like \"fuck these niggas man I gotta get mine\"\nYou a hater by all means, there go a line\nAin't no need for new friends or these bickering hoes\n'Cus wasn't none of y'all around when I was over the stove\nYou thinkin' bout dope, I'm thinking too cold\nFingertip froze, I been through the most\nLook how it shows, look at these shows\nI got to the highs for seeing the lows\nYou sayin' I changed but really it's growth\nFuck what you know if you ain't a game changer\nOl' commentatin' ass niggas all talk but ain't playin' never\nBalled out the bleachers, you get shook if you reachin'\nBought a crib and whip off a beat and a feature\nWhen you finally get this money you see just how they treat ya\nWhen you get it out the mud you come up with some leeches\nNever mind that, soon as I left Def Jam I got my shine back\nI know they were lookin' at Sha like \"why you sign that?\"\nAll the while I was killin' like \"go out rhyme that\"\nThey claim they gave me a chance but I can't find that\nFuck it, lesson learned I earned the knowledge\nThe game's an open road and I needed the mileage\nI'm fit for this here ain't no need for a stylist\nI know that I'm better but really you bias\n'cus you from the same city\nAs your favorite rapper favorite rapper, I can dig it\nAnd you ain't tryin' to go to Meridian, Mississippi\nAnd kick it, it's cool I spit that country shit worldwide\nLet my accent be the reason for the wetness 'tween your girl's thighs\nForeign cars, Forgiato tires, top circumcised\nFunny how niggas counted me out but I still multiplied\nMy worth, maximized that purse\nGoyard or Hermes, whichever she want first\nThe only way I fall off, if there's no gravity on Earth\nAnd even then I'm still amongst the stars\nBetter that than a game that trades genius for sub-par\nLifestyle for bars, if you didn't have that vouch would you have made it this far?\nImagine my shock when niggas come at my spot\nThat control shit was cool, but nigga look what I got\nMt. Olympus overlooked, barely spinning, game is rigged\nIt ain't no winnin' without no budget or no label, shout out to Sway\n'Cus at least he'll bring up the fact that I still paved the way\nWhen a lot of them wish radio was \"fuck I had something to say\"\nNot popular though, not popular music\nI pray and give thanks, they don't like how I'm moving\nBut every time I drop a tape they like \"peep what he doing\"\nThen we package it all like I'm the first one to do it\nDamn shame, damn shame, damn shame\nHol' up, yeah\nHol' up, hol' up\nSo imagine what could happen if I up and left\nThat's a lot of champagne bottles to leave up on the shelf\nThat's a lot of music droppin', shit that you ain't felt\nOr playin' a championship game without a fucking ref\nThat ain't official, oh your album flopped? Well here's a tissue\nThere ain't enough streams that I could wish you to get that budget back\nOh, 'cus once you in the red you can't fade to black\n'Cus you ain't Jay and ain't no blueprint to pay it back\nI know your struggle and you can times that ten nigga because I'm southern\nOh you tired of being rich? I'm sorry for your troubles\nBut I ain't gon' tell these crate diggin' niggas there's no gold in the rubble\nBut there's a price to pay for being humble\nShaking hands with niggas that ain't yo friends\nA lot of chameleons in disguise do whatever just to blend\nIt's amazing what a loser will go and do just to win\nAnd all the tattoos can't hide the scales on they skin\nI seen it, a game where people promise but don't mean it\nAnd the dumbest motherfucker will make the world think they genius\nSelling niggas water claiming it's the blood of Jesus\nAlthough I was too young I probably was safer as a fetus\nThat's the will of my moms and pops\nInstead she pushed me out like \"son, go and earn your spot\"\nAlthough there's plenty of nooses upon the treetops\nI hope you find the strength and will to slip the knots, hol' up\nI beat the block in that old school like I never drove through\nI heard these niggas falling off, that shit old news\nBack to my southern shit, I candy paint the slab\nGot some player got some game, you need? you can have\nGot the state on my grind, supernova the shine\nFlip the screen out, lean out the window, recline\nShow the grill, that's metaphor for fuck how they feel\nThe hate could never stop the champagne icin' on chill\nIf the champagne should spill on the candy\nIt symbolize the days I went being broke to door slammin'\nI got mine now, made the beats and wrote all of the lines down\nMy sound is mine and mine alone, how could I leave it behind now?\nHol' up, ay\nHol' up shawty\n\n[Verse 2]\nUh\nHop out the bed and I want me a chip\nMy flow a chopper, a beam and a clip\nStuffed in the trunk of a car with some thump\nWhy you jump out the window when there go a cliff?\nI'm the ghost of the crack that was stuffed in the hubbas\nBorn to be king, you was meant for a rubber\nI doubled a double cup I'm seeing double\nAnd hut then nigga get the fuck out my huddle\nBreak, I seen it I seen it I see it clear\nBeing humble ain't shit when you being feared\nI'm an old soul we ain't even peers\nNiggas talking tough like I ain't even here\nBut that's how it go when you do the most\nThis ain't bout clubs or sellin' dope\nI'm talking bout murderin' niggas on wax\nAnd bringing 'em back like I seen a ghost\nFo' do', old dough, here I go Mystikal with the paint\nBeen bout it, been bout it, 9-5 minded we'll hop out the tank\nCount it up, count it up, throw it in the safe I'm livin' in a bank\nI come from the country, I know how to work the land\nAnd come back with a mink\nFrostbit cold wrist, this ain't nothin' new this some old shit\nBarely used to wear it rather buy a mansion\nTossed it to my brother, you can hold this\nDry cleaner my demeanor when it come to benjis, can you fold this?\nIn the yo whippin' hella dope, that must be where the stove is\nKrizzle\nThird coast motherfucker\nWhat's happenin'"}], "artist": "Big K.R.I.T."}