{"artist": "Kid Rock", "songs": [{"image": "https://images.genius.com/0bfcfa8a7cf091f1f4f77892a8a13253.500x500x1.jpg", "title": "Balls in Your Mouth", "year": "1993-06-01", "album": "The Polyfuze Method", "lyrics": "[Verse 1]\nCruising through town in my jacked up truck\nEyes open because I'm scoping for a big butt slut\nOne that I can take straight back to my house\nAnd have suck my dick and put my balls in her mouth\nNow get, get with it looked across the street\nI seen a slimmy in a skirt, bopping to the beat\nSo I capped up my forty threw it under my seat\nRolled up on the freak and I started to speak\nBut before I could talk she cold grabbed my dick\nLicked her lips and started talking that porno shit\nShe said \"look here I know you're Kid Rock\"\nThen whispered in my ear \"I want to swallow your cock\"\nWell blow me up then blow me down\nBecause I think I just found the biggest freak in town\nAnd now I can't wait to get her back to my house\nSet her on her knees and put my balls in her mouth\n\n[Chorus]\nBalls in your mouth\nBalls in your mouth\n\"You want my balls in your mouth!\"\nBalls in your mouth\nBalls in your mouth\n\"You want my balls in your mouth!\"\n\n[Verse 2]\nBack to my crib with no delay\nBig grin on my grill and not much to say\nExcept hey yo bitch how's about\nI drop my drawers and put my balls in your mouth?\nThen it was like straight out of a porn\nShe dropped to her knees and started blowing my horn\nAnd after that without no doubt\nShe opened up wide and put my balls in her mouth\nNext the cutie started rubbing my back\nShe put her finger right between my booty crack\nSo I grabbed her wrist quick and said hold up slut\n\"Ain't Nobody sticking nothing in my butt\"\nNow right then I knew I had a ho and a half\nAnd all that I could do is sit back and laugh\nStare at the ceiling thinking about\nThis chick I just met's got my balls in her mouth\n\n[Chorus]\nBalls in your mouth\nBalls in your mouth\n\"You want my balls in your mouth!\"\nBalls in your mouth\nBalls in your mouth\n\"You want my balls in your mouth!\"\n\"Balls in your mouth\"\n\"Balls in your mouth\n\"You want my balls in your mouth!\"\n\"my balls in your mouth\"\n\"my balls in your mouth\"\n\"You want my balls in your mouth!\"\n\n[Verse 3]\nAfter I busted my nuts I drove her to the cut\nShe said \"I hope you don't think that I'm a big slut\nAnd please don't tell anyone what we've been through\"\n(Of course I won't!)\nNext day I told the whole fucking crew\nSpread the news through the whole damn town\nAnd to that chick it must have got back around\nSo I told the ho sorry and tried to make amends\nBut she tried to fuck me in front of my friends\nRunning off at the lip talking all that shit\nThat I'm a bitch I'm a prick and that I got a small dick\nI just waited until she walked away to shout\n\"Fuck You Bitch You Had My Balls In Your Mouth!\"\n\n[Chorus]\nBalls in your mouth\nBalls in your mouth\n\"You want my balls in your mouth!\"\nBalls in your mouth\nBalls in your mouth\n\"You want my balls in your mouth!\" (c'mon)\n\"You want my balls you, you want my balls in your mouth!\"\n\"my balls in your mouth\"\n\"my balls in your mouth\"\n\"You want my balls in your mouth!\""}]}