{"songs": [{"title": "One More Breath", "lyrics": "[Intro]\n\n[Verse 1]\nWhat is this thing I see\nThis silly little thing called me\nThis skin, this hair, this flesh\nThis brain, this pain, this mess\nWhat's life?\nA game that we just  play with two plain dice?\nWhen the shell dies, does the soul fly?\nHellfire, does the flame fry?\nIs this the audition, brief intermission for something much grander\nGet a bigger piece of pie, great show in the sky\nOr is that just propaganda?\nThat they telling me, selling me sold with evidence\nBut intelligence, slowers development\nWe that think that we know we are not reverent\nBut we don't even yet know if we're relevant\n\n[Hook]\nOne more pause, one more breath\nOne more pause, one more breath\nIs this all that there is\nIf it is, I wish I could give\nOne more pause, one more breath\nWe could never know, if we're ever next\nEverytime I think I know, I stop and ask myself\n\n[Verse 2]\nWhat is this thing I see\nThis silly little thing called we\nThis brain, this pain, this flesh\nThese trains, these planes, what's next?\nYes, we're gonna beget technology\nBut the majority, escaping poverty\nNo, I don't think that we can\nCause we still think that we got the plan and\nBy judging a man by just what's in his hands\nOr his land, or his tan and just cause we can\nPause, take a breath\nRealise that none of us know what is next\nSee your code of address or the code of your dress\nWe all still use that same hole for our breath\nPlaying the game but there's never a Ref\nAnd you can't take it with you if ever you left\n\n[Hook]\n\n[Verse 3]\nWhat is this thing I see\nWho could ever know, what we're gonna be\nAre we elevating our meditation\nNot detonating through self-preservation\nGeneration television's raising\nYet we're complaining about how they're behaving\nWashing our hands or just bathing with satan\nYet with all that said, that's just what you make it\nPause, take what is naturally given\nBecause actually there is no tax on our living\nIt's a fact though it's naturally hidden\nLike I'm just an actual assassin on riddem\nThe adrenaline, we're rememberin'\nOur December is cold as it's ever been\nFighting our best, but the victory we revel in\nFighting our brethren, how could we ever win?\n\n[Hook]", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}