{"artist": "A$AP Rocky", "songs": [{"title": "Better Things", "image": "https://images.genius.com/3054c642a320e82b70b35c53ad1cc8d5.1000x1000x1.jpg", "album": "AT.LONG.LAST.A$AP", "lyrics": "[Intro]\nDon't give a fuck about your man\nI'm just seeing what it's hitting for (bitch I'm sayin')\nHow you fronting on the kid though?\nYou should fuck with me girl, you know what you need, girl\nSee I got used to livin' life up on my own, yeah\nIn search of love and for a wife to call my own, yeah\nIt's all I think about at nights when I'm alone, yeah\nSwear that I can't get no rest in California\n\n[Verse 1]\nSwear that life is, just a whole bunch of vices\nNiggas biting off of my shit, my dick\nStay up in your chick ride stick without a license\nTell her hold on like some vice grips\nMight just call her, let her ride with a baller\nLook up on her face was priceless\nWonder what my type is, well, tonight Mrs. Lightskin\nWith a light mix or a light switch, white chick\nDarkskin complexion and she righteous\nI take a dyke chick if she like dick\nI kissed the dyke chick and I liked it\nFucking each and every Katy Perry for the night bitch, light this\n\n[Chorus]\nLight it, light it, puff it, puff it, pass it, pass it\n(Moving on to better things, I'm sure)\nBless, sit back and relax one time, clear your mind\n(Can't feed this addiction anymore)\n'Bout to send me back to my old ways, know what I'm saying?\n(Moving on to better things, I'm sure)\nYeah, I'm just, she making mistakes\n(Can't feed this addiction anymore)\n\n[Bridge]\nI've been puffing, rolling up\nCop a lot and pourin' up\nPlus my niggas know the plug\nA generation's thrown on drugs\n\n[Verse 2]\nI swear that bitch Rita Ora got a big mouth\nNext time I see her might curse the bitch out\nKicked the bitch out once cause she bitched out, spit my kids out\nJizzed up all in her mouth and made the bitch bounce\nRide with a nigga mane, and you know\nI stay fly like the jigga mane, and it figures\nCause here is something you can't understand\nHow I could just kill a man, anyways\nNowadays everybody's stressed, yes\nAnimosity is better off your chest, yes\nGuess everybody want to stay blessed, stay fresh\nTake a nigga threats, but I'm up next, take debts\n\n[Chorus]\nLight it, light it, puff it, puff it, pass it, pass it\n(Moving on to better things)\nInhale, exhale, relieve your mind of stress, bless\nSmoke some one time for your boy A$AP\n(Can't feed this addiction anymore)\n\n[Bridge]\nI've been puffing, rolling up\nCop a lot and pourin' up\nPlus my niggas know the plug\nA generation's thrown on drugs", "year": "2015-05-26"}]}