{"artist": "V-Nasty", "songs": [{"title": "Bitch Anthem", "year": null, "lyrics": "[Intro]\n\nBitch. Bitch. Bitch. Bitch\nYou a Bitch. You a Bitch. Bitch, you a bitch. Bitch, you a bitch\nTake me out, bitch. Yeah, you a bitch. Yeah, you a bitch. Yeah, you a bitch\nBitch. Bitch. Yeah, you a bitch. Yeah, you a bitch. Yeah, you a bitch\n\n[Verse 1]\nYou could make me rich. You could be my bitch\nYour mami is a bitch. Your doorman is a bitch\nMan, I'm so through. I'm through with the shit\nMan, you old bitch. Can you come be my bitch?\nCan you get me dome?\nCan you get me wrist?\nCan you see me on TV, bitch, flying shit?\nG5 high, and I don't give a fuck\nMan you could be my bitch. Yeah, bust a nut, bitch\n\n[Bridge]\nBitch, you a bitch. Bitch, you a bitch. Bitch, you a bitch. Bitch, you a bitch\nYour daddy is a bitch. Your brother is a bitch. Under all them bitch. I'm under all them bitch\n\n[Verse 2]\nCan you see me? Can you see me, bitch? I'm higher than the sky\nI don't give a fuck, bitch, you can look up in my eyes\nYou a bitch. You a bitch. You might hear a surprise\nI don't really give a fuck, bitch\nHigher than the sea. Lower than the sea. Bitch you never see me\nI don't give a fuck, bitch, you could never be me\n\n[Bridge]\nBitch, you a bitch, you a dirty ass bitch\nI don't really give a fuck, I'm from the '30 you bitch. I'm from the '30 you bitch\nBitch, you a nerdy bitch. You a nerdy ass bitch, bitch. Bitch, you a bitch\n\n[Verse 3]\nKreayshawn ain't no bitch, you're a bitch. Jordan ain't a bitch, you're a bitch\nYou're mama bitch. We tie up bitches. No we not bitch\nWe sittin' on sixes. I'm gettin' digits\nMy bitch's midgets. My bitch's midgets. They gettin' my pockets bigger\nI don't give a fuck, bitch I'm a winner. All you is, is a bitch\nYou a bitch. You a bitch. You a bitch. You a bitch\nYou and your clique is a bitch. You and your partners, y'all all bitches. Y'all bitches, bitch\nBitch, send me dough. Western Union, that shit ho\nBitch, you a bitch. You bitch. Bitch. You a bitch\nBitch, you're a bitch. Bitch, you're a bitch\nI love to see me on TV, bitch I'm rich\nBitch. Bitch\n\n[Verse 4]\nBitch, you a bitch. Bitch, you a bitch\nYou can't hang me, bitch, you is a bitch\nUnless you give me dough, unless you give me dollars\nI don't a fuck. Damn bitch, you can't holler\nI don't really care, cause I gotta lot of choppers. Pull it all on a bitch, bitch I'll drop 'ya\nI don't give a fuck, bitch. Yeah, I'll really slap a ho\nI don't give a fuck, doing shit you never seen before\n\n[Outro]\nBitch, you a bitch. Bitch, you a bitch\nI smell pork, and put it all on a bitch\nLike an ash tray, you know where I stay. On '30 there, baby with the AK\nNigga talkin' shit, and you know where I be at\nNigga, I don't give a fuck, man I'll make your mind flap\nBitch, you a bitch. And your mami is a ho, too. Seen her on E before\nNigga, do what I do", "album": "Don’t Bite Just Taste", "image": "https://images.genius.com/f2282cb3557e7fec7a54f27c91920803.500x500x1.jpg"}]}