{"songs": [{"year": "1991-08-27", "image": "https://images.genius.com/40f66b653cd7b106d8dea9f33eac5a75.598x598x1.jpg", "title": "Busy Doing Nuthin’", "album": "I Need a Haircut", "lyrics": "[BizMarkie]\nI was sittin home, all alone\nWhen I heard the ring, on my telephone\nI picked it up, to see who could it be\nThis girl I just met, her name was Tammy\nSee I was surprised, cause she called me first\nShe was one of the baddest in the universe\nI was just buggin cause she gave me a ring\nIt was a Monday, and it started off with a bang\nShe start the conversation over how was your weekend\nI did this that and the other with my friend Monique\nAnd Shaneeda, (She need a new hairdo?) We both laughed\nHow you long you gonna be home?  I gotta take a bath\nSo I gave her two hours then I called her back\nYou know I was ready, when I rolled a headcrack\nCause when I asked, can I?  She cut me off so tough and\nI gotta call you back - aww baby, you busy doin NUTTIN\n\nChorus: BizMarkie's crew and the Diabolical\n\n\tB.D.N., B.D.N., B (repeat 2X)\n\tYou're busy doin NUTTIN\n\tB.D.N., B.D.N., B (repeat 2X)\n\tYou're busy doin NUTTIN\n\tB.D.N., B.D.N., B (repeat 2X)\n\tYou're busy doin NUTTIN\n\tB.D.N., B.D.N., B\n\tB.D.N., B.D.N., BEEEEEEE!!\n\n[BizMarkie]\nLet me tell you a story bout a girl named Gilda\nShe was from out of state, I was wonderin will the\nSame thing happen to me like the deja vu\nLet me keep quiet, and go into a tale\nSee I was chillin at the Chapter 3\nWord is bond she looked divine, she looked as fly as can be\nI thought she was different cause she was by herself\nShe looked real wholesome, and in good physical health\nI walked by, she said hi\nAin't you the B-I-Z-the-emmaza-emmaza-A-R-K-I\nI said yes can I have the number to your home\nAre you allowed to call Jersey on your phone?\nShe chuckled we exchanged, I went home joked about it\nHow she was gonna be mine, with no doubt about it\nBut everytime I call I say whassup muffin?\nI'm doin somethin now - aww baby, you busy doin NUTTIN\n\nChorus\n\n[BizMarkie]\nAhhhh, don't give me that!\nThe last episode was at a club in the Bronx\nI was rockin with Capri who got a good response\nIt was Backspin June, and Limo Driver Mike\nYou chill in the car, cause clubs he didn't like\nSo me and V went in just to look around\nSeein girls that had bass with sense around\nThen we all got on stage and rocked the house\nThere were no fights in, not even out\nSlide, then we got in the car\nSaw two trillzadills shinin like a star\nOne was with Mike, the other was with June\nYo it's not gonna be theirs for soon\nSo V got with Mike and hooked me with her sister\nIf I knew she was like that, I woulda had dissed her\nCause everytime me and V called them both up and\nThey both were busy?!  Nah - they're busy doin NUTTIN\n\nChorus 3X\n\n[BizMarkie - speaking over last 2X]\nAhhhh, don't even give me that!\nThat's junk\nThis goes out to all you bitches doin nuttin\nKa-ka-cause that's all you be doin\nAm-am-I right B, am I right Doc\nAm I right Shell, am I right V\nAm I right am I right Sahai, am I right ?\nThey don't be busy doin NUTTIN\nThey go nowhere fast and then go backwards\nWith Bart Simpson in the background\nAll of a sudden roll like they got shot by the Apollo though\nWord up, I didn't even.. okay\nBblabaldblablballl, ah!!"}], "artist": "Biz Markie"}