{"artist": "Cam’ron", "songs": [{"title": "Do Ya Thing (Remix)", "album": "Killa Season", "year": "2006-05-16", "image": "https://images.genius.com/82f464ee78c43b9e36f93d5d33f24db9.1000x1000x1.jpg", "lyrics": "[Cam'Ron: Intro]\nThis is a remix (remix, remix)\nDIPSET! KILLA CAM! DUKE DA GOD! (remix, remix)\n\n[Cam'Ron: Verse 1]\nI make cheddar that's cheddar, you gotta say bravo\nMa mess with me, I'm better than lotto\nGot more than a million, fuck a dollar and a dream\nYou don't even need a dollar, holla at the team\nChicken, cornbread, collared on your greens\nMansions, cars, Prada on your jeans\nHell in Harlem, I'm poppin' up in Queens\nBrooklyn, the Bronx, hoppin' on the scene\nAnd you're not from the regime, and I'm popular with fiends\nNo gossip they cop it, crotched up in a lean\nCars I cop it, crotched up and I lean\nSeventy five, dropped it on a Beam\nAnd you love the way I'm bouncin' it, weed I roll a pound of it\nYa'll niggas are counterfeit, money I stay countin' it\nThrow a punch and I counter quick, down to flip\nBeef I love the sound of it, your crib'll be surround in it\n\n[HOOK]\nDO YA THING, DO YA THING, DO IT (4x) [this is the remix]\nMore killing killing, more killing killing, for Killa Killa (4x)\n\n[Cam'Ron: Verse 2]\nYes honey got money, yea my money is right\nBut my wrist so bright, look like 'Sunny Delight'\nTwenty K times twenty, times twenty the price\nYou don't do math, eight million in ice\nAnd yea, I got more to tell must be bored as hell\nElectronic jewelry, I need a 'Duracell'\nBattery triple A, where the icicles lay\nAnd beat you with a wiffle bat, all over a nickel play\nGirlfriend, my girlfriend got the nickel plate\nRight in the bra, it tickle her little nipples hey!(Hey!)\nJuelz got the whistle AY! (AY!)\nMe, I got the whistle that whistle right through the pistol K!\nAnd this is the chronicles of Killa (That's Killa)\nAnd don't smoke cuz the chronic it'll kill ya\nI'm a monster and gorilla, that'll conquer for the scrilla\nYou will get an invoice you vomit in the villa\n\n[HOOK]\nDO YA THING, DO YA THING, DO IT (8x) [this is the remix]\n[DIPSET!, KILLA!]\nMore killing killing, more killing killing, for Killa Killa (4x)"}]}