{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Minister Farrakhan]\nSo out of the MERCY of Allah\nAnd the LAW, written in our nature\nWe call an INDIVIDUAL, into existence\nAnd when that individual, I make, NO apologies\nFor what I'm about to say\n\n[Verse: Big Daddy Kane]\nRough, rugged and real, you're on standstill\nTo obey okay so let the man build\nWords of rapture that you have to capture\nAnd I just slapped ya\nWith the hand full of literature\nThat's dope def fresh hype choice smooth and raw\nRappers I replace, rub out, and erase\nCompetition you must be on freebase\nSmokin' or chokin', bound to be broken\nMan, get your damn hands off the mic that I'm chokin!\nCause I got a stranglehold\nYou’re still cold on parole for the role you stole\nRhymes that you yell out, but you did sell out\nCrossed-over, lost over here, now get the hell out\nI'm not a pop star, rock'n'roller\nI'm a rebel, BLESSED, able to hold a\nMic like a hammer, and drop grammar\nTreat a rapper like a wrestler, and body slam him\nThose who dispute get treated just like a prostitute\nThey get the boot and played like a flute\nSo just PLAY mute, don't even whisper\nOpen your mouth to speak and I'm diss ya\nRagtag and dog, put you in the morgue\nBecause you're petty confetti and not ready to rock steady\nIn other words, you're half-steppin'\nTiptoein, get goin, because my weapon\nIs not a nine, an uzi or a shotgun\nBut when it come to hype rhymes I got one\nJust like the album is still the same\n\"Long Live the Kane,\" ain't a damn thing changed\nI still get ill and kill at will and build the skill\nTo fill your grill so don't tell me you're real\nWe sample beats, you sue and try to fight us\n*tchk* Maaaan, you still be home with arthritis!\nIf we didn't revive em, bring back alive\nOld beats that we appreciated, you wouldn't survive\nYou'd be another memory to us\nAshes to ashes and dust to dust\nSo understand, the way that I live\nThat's positive - and the message I got to give\nIt's a benefit for you and me\nI'm talkin bout P.E.A.C.E\nThe chosen one that has turned a new leaf\nI got gold teeth, and they don't chew beef\nNo pork on my fork, strictly fish on my dish\nThe Kane fallin victim? *tchk* Sucker, you wish\nI flow like water, slaughter\nPut you out of order.. floored ya!\nRappers are raggin and taggin and snaggin and braggin\nTo be on the bandwagon, but I'm the Last Dragon\nWith the knack to attract the pack\nSo just GET BACK, I'm young, gifted and black\n\nAnd just go with the flow you know\nIn the place to be with my man Marley Marl\nSendin' this out to Divine Force\nCan't forget my main man Heavy D\nAnd to my good brothers EPMD\nAnd to my man Ice-T over on the West Coast\nCan't forget Kool Moe Dee, Busy Bee, MC Lyte, the Audio Two\nI say, peace!", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": "1989-09-19", "title": "Young, Gifted and Black", "album": "It’s a Big Daddy Thing"}]}