{"artist": "Porta", "songs": [{"album": "Equilibrio", "title": "Lo Que Se Avecina 1.5", "image": "https://images.genius.com/aa27426d55342fc5e77da95dffc19068.799x799x1.jpg", "lyrics": "[Intro]\nPermitid que sea sincero de buen comienzo, no seré de vuestro agrado. Los caballeros sentirán envidia y las damas repulsión. No os agradaré ahora y os agradaré mucho menos a medida que avancemos\n\nSeñoras, caballeros, sentid como lo siento yo. Queda dicho, éste es mi prólogo. No hay rimas ni declaraciones de modestia, no contaríais con eso, espero. Y no tengo ningún deseo de agradaros\n\n[Equilibrio]\n\n[Verso]\nVuelvo con los clásicos, algunos ya son mitos\nSoy el chico que llevó su música hasta el infinito\nResucito al rap, lo necesito, mi virtud, mi vicio\nVa por ti, solo por estar aquí desde el principio\n\nSinceridad y metas detrás de cada canción\nCalidad y cantidad de la mejor generación\nHip-Hop me dio confianza y mucha\nSeñor juez ¿acaso usted cree que me rendiré sin lucha?\n\nQuiero que esta vez sea perfecto, por fin\nVengo pa' cerrar bocas de los que no creyeron en mí\nEstilo y flow sobre beats de raza, mi boli bic de caza\nTú reza pues voy por ti\n\nRap comando sobre samples, bajos, bombos, cajas\nEn lo que trabajo te llevo diez de ventaja\nY soy fijo, nunca pillo, baja, me exijo\nTe relajas, más que mover masas las dirijo\n\nLímpiate las babas, tú ya no me desafías\nSujétate las bragas, no es solo rap para crías\nSoy el responsable de que escuches rap cada día\nY hago colaboraciones por las que pagarías\n\nEl respeto ya no está sujeto a esta cultura\nSolo pido libertad de expresión, sin censuras\nHago pura arquitectura, le pongo textura al rap\nMe pasan factura, son 10 años de aventura ya\n\nDespués de esta tormenta yo no esperaría la calma\nVengo directo desde Barna (¡Escucha!)\nEl Karma las devuelve con monedas de tu hucha\nLa ciudad maravilla hoy luce bajo está capucha", "year": null}]}