{"songs": [{"lyrics": "Yeah\nWatch\n(It's) The world's greatest thing ever thung\n(It's) The saccharine that the sit on your tongue\nFill up his clip-on tie repellant\nSqueegee to semi-developed\nWhile you were sleepin' he's building Rome in his cellar\nI'm too alive right now\nThe view to which you subscribe\nFind the key to parry blockage of the cubicle (?)\nI had a plate of half cooked matters looking at me stupid\nFed 'em to the hogs that waddle between the bookends\nLook, clear!\nAll I gotta do is:\nSimply make the greatest masterpiece ever conceived by human students\nOnce I am convinced that the kismet inside the labor\nIs already incredible I might as well ink the paper\nHell yes!\nEasy-peasy, right?\nSure. Hey, whatever makes the hazel glaze well\nI sink teeth deep in to the chart with a fang but for a hark\n'cuz even silly pink bunnies look scary in the dark!\nBang on pots and pans, ring alarm swiftly\nCue to bugle turbulent, who salute the worker ant?\nDuke up to the firmament, overthrow the vapors\nWith a fail-safe method composed by your nosy neighbors\nLike this:\n\nSmack dab in the middle of his palms\nHad a new day victory, ready to evolve\nWho will celebrate and sleep on the couch\nTo later wake up in the second best seat in the house\n\n(It's) The world's greatest thing ever thung\nExcept the last digit, pink in your lung\nWhat a genius plan, of on a marvel of engineering to rival the great pyramids and cheese in a can\nHe's in a band called \"Birds\" and it work ?\nWith a root down deeper than the pockets on his doctors\nSo selfishly melt through the piss of Hades\nAs to never note the critics, shake the hands or kiss the babies\nSo the ratings through the chapel roof\nAnd snaggle-tooth is focused outside of the jurisdiction of failure among the motives\nJust when the victory is comfortably assumed\nYou will be woken by the creaky hinge of door number two\nDoor number two, it's sorta like a silhouetted whore in plain view\nWhen your homework is due\nRhinestone cowboy, nursing his little phenom\nAs an even newer idea poke its head out for recon\nOh what a weird distraction, all of a sudden you're lugging separate chapters\nOriginal mission is bliss and all\nBut this admittedly is somewhat attractive, even if a little backwards\n\nSmack dab in the middle of his palms\nHad a new day victory, ready to evolve\nWho will celebrate and sleep on the couch\nTo later wake up in the second best seat in the house\n\n(It's) The world's greatest thing ever thung\nOn second thought, check back when I'm done\nJust for fun, I know I saw them troubleshooting, and you were so focused\nCloaked over the mulish buoyancy in the the dosage\nSo roguish, gloating over the merit and majesty in the moment you chose to own wholeness\nSo bogus the coach is doubting his outing\nNow the same cellar is littered with Rome's homeless\nBang\nStyle of that new sensation seems jealous when it notices the stake's location\nBrains for a second starts hollerin' ultimatums like, \"Your last chicken trippin' on some...\"\nSave it, pick a favorite\nNew car smell, walk like a star, ? my currents at the bar\nContradicts every jewel I drop, my apologies but what did y'all expect, school sucks\nPut a bow on this one, rinse and repeat it\nSo tomorrow I'll actually be my zenith achievement\nTo my heart-of-gold medics with aesthetics on a string\nYou will forever be employed by the next best thing\n\nSmack dab in the middle of his palms\nHad a new day victory, ready to evolve\nWho will celebrate and sleep on the couch\nTo later wake up in the second best seat in the house", "title": "The Next Best Thing", "album": "Coffee / Citronella / The Next Best Thing", "image": "https://images.genius.com/c53149ae0a34aa23f2a538686a0b5af4.447x447x1.jpg", "year": "2007-08-07"}], "artist": "Aesop Rock"}