{"songs": [{"lyrics": "Right there...cool\n\n[Verse 1]\nCome here\nLet me holler at you face to face\nSee Ace been place to place\nI seen a million of 'em\nThey look at me for a split second\nThen they grin, never to be seen again\nBut it's locked in, so I can read every line\nIts written all over your upside down mind\nWith a upside down smile\nWhoops upside your head, well hey now\nI never forget a face, especially yours\nBecause the mirror is the only dimension without flaws\nI look out to look in\nAnd then begin to look out for the faces of men\nCause I done been face to face with a serpent\nDemon and a saint, think it is when it ain't\nWhite like snow or black like coal\nYellow like the moon and red(read) like a book\nTo live or die is the plot but the face is the hook\nSo meet the face from left field\n3 eyes, two ears, one nose and a grill, but still remains faceless..\nOh yea\n\n[Hook]\nLet me holler at you face to face\nSee Ace been place to place\nI seen plenty of 'em\nBut don't let the face fool ya\nThere's so many of 'em, but still remain faceless\n(2x)\n\n[Verse 2]\nSo can I take a poloroid? -say cheese-\nOf the face that got you employed -please-\nSame face your momma enjoyed as a boy\nWill be the same face that'll get you destroyed\nNow you got to face the facts, face the music\nYou cannot about face it and turn back when you abuse it\nSo wisdoms use it wise, bat thoses eyes, show them teeth\nLick them lips even powder them cheeks\nSo while your passin', I'm askin' myself\nI wonder if she knows what I'm looking at\nWell look at that, a face that got me lookin' back\nI can see the history in your bone structure\nI can see the misery in your frown\nSo smile now and cry later\nOr just walk around with the face of a clown and still remain faceless\nI said smile now and cry later\nOr just walk around with the face of a clown and still remain faceless\n\n[Hook]\n\n[Verse 3]\nDo you know how far a face can take you?\nIt can make you or break you, or inflate you\nThey're either going to love you or they hate you\nOr never notice you if you're a face they don't relate to\nYou fear my face, don't wanna get near my face\nYou get judged by your mug, they didn't hear your case\nNow face the wall (face the wall!)\nYour face is against the law\nYou look at me I look at y'all\nI recollect everything I saw in the face of the foul\nBut I'm just another face in the crowd (just another face in the crowd)\nTo take it at face value is not allowed\nTell it to my face, and tell it to me now\nTryin' to mad dog, but you got the face of a puppy dog\nLike a puppet, just like a baby doll\nAin't that right baby face? Cutie pie?\nGood lookin'? Twinkle in your daddy's eye?\nAnd then Scarface replied I was born with a face I can't hide\n(A face I can't hide) a face full of pride\nA face that's been denied on sight\nI recognize the face but the name slips by\nBut still you're not faceless\nYo", "title": "The Faces", "album": "A Book Of Human Language", "image": "https://images.genius.com/8c348dfe824da4f3b04231c7e4d629ae.700x700x1.jpg", "year": "1998-04-14"}], "artist": "Aceyalone"}