{"songs": [{"image": "https://images.genius.com/a9abb4468d35dbcbb121cd5e44c6c989.1000x1000x1.jpg", "title": "Bonjour", "album": "NASIR", "year": "2018-06-15", "lyrics": "[Verse 1: Nas & The World Famous Tony Williams]\n(Bonjour) I should be more mature, sure, I'm spoiled\nHit up the south of France after tour, bonjour (bonjour)\nHow many girls pre-bate right before they date\nSo she can have restraint? She still get slayed (bonjour)\nThat's ill behavior, want the whip matted\nWant her ass the fattest, beat it: Thriller jacket\nA street metaphor: if your dog piss on the floor\nPut his nose in it, check these niggas from the door\n\n[Chorus: The World Famous Tony Williams]\nOooh oooh la la, oui-oui amour\nPlenty of kisses, plein de bisous\nGood day and best wishes\nComment allez-vous?\nBonjour\n\n[Verse 2: Nas & The World Famous Tony Williams]\nEat at selective kitchens, speak on our next intentions\nOver-creamy Polenta, it come chef recommended (bonjour)\nCome through the side entrance; I arrived, bitches\nCrackheads still owe me from '89 fixes (bonjour)\nHavin' drinks in Vegas, my business\nShe didn't see me comin', now she's an eyewitness\nLaissez le bon temps rouler\nSay ahh so the kids could play\n\n[Chorus: The World Famous Tony Williams]\nOooh oooh la la, oui-oui amour\nPlenty of kisses, plein de bisous\nGood day and best wishes\nComment allez-vous?\nBonjour\n\n[Verse 3: Nas & The World Famous Tony Williams]\nVacation, twisted, whatever happened, missed it\nVacations I didn't like, put myself through a guilt trip (bonjour)\nAll these beautiful places, but the cities be poor\nYou wealthy when your kid's upbringin' better than yours\nAll this money we gettin' could be gone in a minute\nIf we don't invest it—we long-term affected\nWatch who you gettin' pregnant, that's long-term stressin'\nI got a mil for every bump on your face, that's what I call a blessin'\nFlexin'\n\n[Verse 4: The World Famous Tony Williams]\nMy head looks straight up\nAnd I'm wonderin', \"What did I do?\" (bonjour)\nShe looked at me like, \"Damn, did I surprise you?\"\nSure enough, as the sky's blue, she turned back around\nAnd walked back down the avenue (bonjour)\nShe's waitin' for the right cue (bonjour)\nI'm waitin' for the right clue (bonjour)\n\n[Outro: The World Famous Tony Williams]\n(Oooh oooh la la, oui-oui amour)\nShe be leavin', still I smell of eau de parfum\nShe can't run 'cause I got Cinderella's right shoe\nIn that white gown that I be seein' right through\nCrowd obscurin' my view\nThere's nothin' left to argue (bonjour)\nAt least there's not from my view (bonjour)"}], "artist": "Nas"}