{"songs": [{"title": "Akala F64 S2 EP2", "lyrics": "Sorry kids let me apologize before I go further\nUnfortunately I don’t rap about how many man I have murdered\nAnd you may find it boring appalling and I ain’t scoring braps\nFrom your little rat packs for just stating facts\nSee I lack not the ability to murder man lyrically\nI just thought that killing should not be glorified, silly me\nApparently murdering man has become an aspiration\nBut what would happen if you reversed the situation?\nEvery black rapper claiming he clap a black in the face, talked about killing white people as much, would he still get embraced?\nOr would you find the applauding would quickly turn to appalling and you got no career here by the next morning\nI ain’t saying you should do that, it is true that would be just as dumb\nI am just pointing out how absurd it has become\nIf a Chinese rapper were to say die ‘Chink’ die\nEverybody would be like ‘What is wrong with this guy?’\n\nBut some of us have become so accustomed to just behave disgusting\nWe think it’s just our behaviour and it ain’t worth discussion\nOr worse yet that it is cultural expression\nBut who owns Baretta and who owns Smith and Wesson?\nWho owns the car you’re driving that you think’s defining who you are\nRunning from yourself you’ll find there is no hiding\nSo you can boast about your Prada and your Christian Dior\nStill security will follow you when you’re in the store\nAnd you can boast about your platinum chains and your diamond rings\nWhile kids in Sierra Leone keep on losing limbs\nAct like you got no brain and you ain’t got no shame and say so what I am getting dough\nBut you’re pawns in a game\nThey are laughing at the little coons\nWho really think they are goons\nReal goons don’t wear platinum chains they wear ties and suits\nThey don’t live in estates and sell flake\nThey invade with guns and tanks and take your whole state mate\nSo pardon me if I don’t find it funny\nYou boast about it but do you even know what is money?\n\nSee it’s hard to act dumb when you have read a couple hundred books\nBut still in anybody’s hood so tell me who is shook?\nWhen you have been to Brazil and stood in favela streets next to kids holding hand grenades and M16s when you come back to London it ain’t serious\nThe ghetto is in our heads\nWe are delirious\nIf you lived in a real slum without food or running water\nWhere police drive by and kill sons and daughters\nYou would give your right arm just to go to school\nInstead what do we do?\nThe killer the trigger the play the fool\n\nI ain’t saying school is the answer, educate yourself\nSee it’s not the money you make, you are the wealth\n\nI ain’t saying we ain’t got a struggle right here in Britain\nBut you’re taught to act inferior and play position perfectly\nIt’s disturbing me, the verbal murder be absurd to me\nIt occurred to me if you have not heard of me\nIt’s probably because I do not rap about Gucci and booty\nQuite enough for the urban scene to fully salute me\nBut I don’t really care, I’m too busy writing my master thesis\nIt’s hard to play the stereotype when you study Egypt\nPlus urban scene we’re racist to ourselves\nElevating words of hate we’re merely hating ourselves\nAnd if you are musically broad or dare to speak intelligent\nPeople look at you like who the hell you think you are better than\nI’m better than no-one on this earth and I know I’m not\nBut I refuse to play small just to fit in your box\n\nAnd I don’t hate none of these other rappers\nIn fact it’s quite the other\nLook at me as your bigger wiser older brother\nAnd as a brother should I tell you you’re in trouble\nIf they clap when you’re talking of killing do they really love you?\nIf record label bosses kids were dying, would they sell us violence\nAs quickly as they are ready to desensitise us?\nThey tell you to shit on your floor while holding all the scoops\nThen throw you a bone like a dog jumping through a hoop\nDon’t take it as a compliment because it is not that\nIf I tell you that you’re African you tell me it’s not that\nBut humanity is African even if not black\nThe truth can be painful\nSshhh better stop that\nIt’s so inconvenient\nFor those at the top that you talk too much truth and you might just get popped at\n\nAnd if women are such hoes that we do not want to kiss them\nWhat does it say about us that we want to put our dick in?\nI’m done with the lies third eye open wide I see the tougher that you act the weaker you really feel inside\nSo all the killer the trigger and when we call ourselves niggas\nAnd want platinum chains bigger than jigga’s\nIt’s just to run from the fact that we feel insecure\nGet as many things as you want but you cannot restore\nThe core of who you are truly that will surpass beauty\nThat comes from knowledge of yourself and a sense of duty\nSo all my brothers pretending that we are thugs\nKnow if we are honest we just want to be loved\n\nBut we feel that we are not worthy and that we are not smart\nSo we act aggressive to protect our fragile little hearts\nBut we’ve got to deal with this pain or it will consume\nThat’s enough honesty now lets resume…\n\nTurn this off go back to rappers that tell you kill\nBut inside of yourself you know that this is real\nAkala on sbtv DOUBLETHINK May 3rd check the CD\nIf you want a little knowledge bigger than college\nI PROMISE YOU the metaphorics that will offer you solace like…\n\nThe Great Pyramid alone 2.3 million stones\nIf you took them apart and placed them in a row\nThey would stretch 2/3 way around the earth\nThat is more stone that there is in every single British church (put together)\nEach one cut to a degree of accuracy of 1/1000 of an inch\nWell what does that mean?\nIn 1978 the Japanese ran an experiment to rebuild them with modern technology and failed terribly\n\nBut anyway that’s enough for today", "year": "2010-04-12", "album": null, "image": "https://images.genius.com/3222ca5815132f2ac56b73bacb186bf1.1000x672x1.jpg"}], "artist": "Akala"}