{"songs": [{"album": "The MCEO Mixtape", "image": "https://images.genius.com/f91b6ab51626523a3ccbe0616602c33b.500x500x1.jpg", "year": "2008-03-10", "title": "Independent (Amadeus Remix)", "lyrics": "[Hook]\nI-N-D-E-P-E-N-D-E-N-T do you know what that means?\nI-N-D-E-P-E-N-D-E-N-T it's Talib Kweli Greene\nI write my own rhymes, I write my own checks\nAnd if you're looking for that good I got it on deck\nI'm my own man, I'm my own boss\nI'm my own man, I'm my own boss\n(This is the Amadeus Remix)\n\n[Talib Kweli]\nCame with the, rawness on Rawkus\nLP had official recordings\nCorey Smyth had a Blacksmith office\nI was, writing books of poetry like Bert Padell\nI saw the wisdom when the curtain fell\nWanna sell like Jay Z, E-40 and Master P?\nI respect labels like Stones Throw, ABB\nWho stay independent as fuck\nLike Def Jux\nNature Sounds, BBE, Babygrande nigga [?]\nDuck Down my nigga what?\nDrew How what's up\nI'm from Brooklyn all day put your lighters up\nI saw J Grand at Asylum\nWe take it back to makin' records days, 'cause he's  a vet like I am\nI am legend like Mister Cee\nWhat you callin' for is victory\nBlacksmith makin' history\nAnd the music influenced by Hieroglyphics\nMy niggas from the bay stay so sick with it\n\n[Hook]\n\n[Talib Kweli]\n(Ay) Keep it live for ya'll niggas\nKweli in the -house like Suave or Swisha-\nFlow so vivid\nAin't no gimmicks\nGo everywhere cause I know No Limit\nSo So Def, my life is like a movie\nThis the storyboard\nDown in H-Town with Cory Mo\nNo I'm not from Houston but I Rap-A-Lot\nBun B holdin' me down I'm goin' back a lot\nWord, major label product steady sinkin' like a bag of rocks\nStinkin' like a bag of socks on laundry day\nKweli stay away from the corporate rap\nThat's a corporate trap\nReal niggas don't fall for that\nWord, we in the building now there's nothing they can tell us\nBad Boys, the Ruff Ryders  and the Roc-A-Fellas\nThe Slip-N-Slides, the Cash Money and G-Units\nKeep movin' the music we love to see you do it\n\n[Hook]"}], "artist": "Talib Kweli"}