{"songs": [{"year": "2016-07-18", "title": "Racks In My Pocket", "image": "https://images.genius.com/a8b9e332201b3c23d6ef2438b24631c9.800x800x1.jpg", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah\n21 Savage bitch\nRicky Racks\n\n[Hook]\nI got racks in my pocket\nI got racks in my\nRacks in my pocket\nI got racks in my pocket\nRacks in my pocket\nI got racks in my pocket\nRacks in my pocket\nI got racks in my pocket\nGot it\nI keep a Glock in my pocket nigga\n21, I keep a Glock in my pocket nigga\n21, I keep them racks in my pocket\nI keep that Glock in my pocket\nI keep the racks in my pocket, 21\n\n[Verse]\nYeah I'm in the kitchen nigga scrapin' bowls, savage\nI'm in the hotel fuckin' hoes, savage\nI count up blue hundreds nigga, yeah-yeah\nI hang around with real gunners nigga\n21, savage nigga'll hot bun a nigga, ya digg?\nThumbin' through them racks, thumbin' nigga, ya digg?\nBombin' shit like Osama nigga\n21, ran off on a nigga momma nigga\n21, I fuck niggas sisters\nThen they get dismisssed\nI can't cuff a bitch\nAll I do is fuck these hoes\nKick them to the curb\nPull up on a country nigga\nPull a pistol, take his fuckin bird, ya digg?\nBitch, I don't let a nigga dig it\nI know that these bitches dig it\nI got two bitches kissin'\nI'm in the kitchen\nYeah, scrapin' bowls, nigga washin' dishes\n21, I'm a boss nigga you a pigeon\n21, I'm boss and nigga you a peasant\nGlock .40 on me with the hollow tips\nSend a fuck nigga straight to Heaven\nHah, freestyle, all I do is freestyle\n21, Nick Cannon cause a young nigga wild\n21, nah nigga this ain't no motherfuckin' Plies\n21, run up on me, get shot in the eye\n21, Rollie on me cost like 30 thousand, ya digg?\nGot your bitch snortin' coke on a mountain, ya digg?\nI be higher than Stone Mountain, ya digg?\nBitch I'm high like Stone Mountain, ya digg?\nDiamonds in my watch like Stone Mountain, yeah\nThem rocks big, bitch my Glock big\nThe cop big, the car big, I'm a star bitch\nHotNewHipHop, bitch I got a hot new Glock\nGot a hot new pot, cookin' crack, cookin' crack\nFree Slime Nudy cause he comin' back\nFree Young Tel cause he comin' back\nRun off with your money, ain't comin' back\nBoy you know that shit gone\nBoy you know you addin' wrong\nBoy you know my money long\nAnd my bitch hair long\nAnd my swisha blunt strong\nAnd my car go fast\nAnd I smoke a lot of gas\nI don't sell a lot of swag\nBut I got a lot of swag\nAnd I spend a lot of cash\nYeah, hit the gas, hit the gas, smash off\nHuh, hit her from the back and took her ass off\nBitch you know I like to cash out\nNigga know I like to cash out\nBitch I get it in the cash app\nI'm in New York with the Slaughter Gang\nBitch you know we like to slaughter things\nWe don't want to fuck on your main\nWe just wanna fuck your side bitch\nYou know I got a side bitch\nAnd I keep me about five bitch\nAnd I hmmvam like a vibe bitch\nSmokin' weed, I know a nigga feel the vibe bitch\nYeah, 21", "album": "On The Come Up Vol. 1"}], "artist": "21 Savage"}