{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind", "title": "Best Friend", "image": "https://images.genius.com/a7c7371c883ae1d1241073cd59f52564.1000x1000x1.jpg", "lyrics": "[Intro: Pharrell]\nYeah, yep\nSpit my gum out right now, yeah\nWhat up, world?\nGot my inspiration in the studio with me tonight, feelin' good\nGot a lot to smile about\nTalk to y'all niggas\nYessir, hey\n\n[Verse 1: Pharrell]\nMy best friend say I'm bottled up, I need a fuckin' therapist\nBut I can't think of nobody I wanna share this with\nWhy should I open up on somebody else's carelessness?\nPop, there goes the top, nigga, so here it is\nMama workin' all day, Daddy out in the streets\nImagine ten years old, full of doubt and defeat\nGrowing up around criminals, with clout and deceit\nMy grandma Loucelle used to tell me, \"You about what you weep\"\nShe used to help me with my homework, addiction, subtraction\nAdded faith to my life and doubt got subtracted\nWanna skip your mind from crying? Better learn something, son\nYou be beatin' on my couches, why don't you try hit the drums?\nLook, ooh, you see me, Ma, they wish they could be me, Ma\nAs I got better, her body was eaten by leukaemia\nSeventh grade, it was cursed and sad\nBut the gift within it was when I first met Chad\nBut even Chad could tell you that my Christmas was jinxed\n'Cause Grandma Loucelle died on 12th 19th\nI can't help but wonder what kind of black cloud I was under\n'Cause fifteen years later, the other died that summer\nBummer\n\n[Chorus: Pharrell]\nMy best friend told me (What?)\nYou be actin' tough, that's fine (Uh-huh)\nBut the weight of the world can really crush one's mind\nSo let it out, P (What?) Let it out, P (What?)\nLet it out, P (What?) Let it out, P (What?)\nSee, you won't even know you hurt sometimes\nUntil you in conversations, it comes out in a line\nSo let it out, P (What?) Let it out, P (What?)\nLet it out, P (What?) My nigga, let it out\n\n[Verse 2: Pharrell]\nAyo, 1021 Atlantis Drive, nigga was action packed\nThat's Atlantis Apartments, we live in half the back\nThat's where the 12-year-olds there, they be flashing crack\nAnd when they shoot you, nigga, they ain't tryna pass it back\nAyo, Didi, Fleet and Marvian, can you imagine that?\nThe place we love the most, the hood was built to smash us flat\nBut I escaped 'cause I chased, what made me passionate\nNow I got my skate team and spit these acid raps\nSo many niggas will rise, so many them niggas try\nSo many them niggas ended up duck-taped and tied\nSo many them same niggas, man, they moms eyes cry\nSo, they just got older, still on the corner with they pride\nWell, let me tell you niggas something, I'm so glad you alive\nLong as you got a breath, a pulse, nigga strive\nDivine intervention this is, I heard a voice, nigga, listen to this\n\n[Chorus: Pharrell]\nMy best friend told me (What?)\nYou be actin' tough, that's fine (Uh-huh)\nBut the weight of the world can really crush one's mind\nSo let it out, P (What?) Let it out, P (What?)\nLet it out, P (What?) Let it out, P (What?)\nSee, you won't even know you hurt sometimes (Uh-huh)\nUntil you in conversations, it comes out in a line\nSo let it out, P (What?) Let it out, P (What?)\nLet it out, P (What?) My nigga, let it out (Okay)\n\n[Verse 3: Pharrell]\nJesus will arrange it, but Jesus won't change it\nHold yourself responsible, on yourself, you blame it\nYou mad, nigga don't articulate in Sans Script\nI.E. we best friends, speak best friend language\nI'm a happy nigga, you can't approach me in anguish\nWhoever said anything worth working for would be painless?\nCan't be mad at the world 'cause you and your girl ain't famous\n'Cause you both on Bape, BBC and chain-less\nAlso you're Range-less, therefore switch lane-less\nNow you brainless, dangerous, 'cause you pull out the stainless\nAll of a sudden you smart, now you do something heinous\nFirst time you get caught, now your ass is famous\nNo longer chain-less, and the bus switching lanes is a bad look\nYour girl with ya man sellin' lane-less, stop\nNigga, rewind and reverse slides three times\nReassess your thinking and trust me, it'll be fine\nFirst, picture your goal, and repeat, \"It'll be mine\"\nOr fuck it, nigga, just keep imagine killin' me, fine\nNow you scrunching your face, tryna ace attainment\nWhen you should be tryna find a place to base your shame, nigga\nSuccess is tangible, don't wait for fame\nI thought you would receive it better if I ain't say your name\nYou unsure of yourself, sit still and think\nReview those actions if it fit, put your name in the blank\n\n[Chorus: Pharrell]\nMy best friend told me (What?)\nYou be actin' tough, that's fine (Uh-huh)\nBut the weight of the world can really crush one's mind\nSo let it out, P (What?) Let it out, P (What?)\nLet it out, P (What?) Let it out, P (What?)\nSee, you won't even know you hurt sometimes (Uh-huh)\nUntil you in conversations, it comes out in a line\nSo let it out, P (What?) Let it out, P (What?)\nLet it out, P (What?) My nigga, let it out (Okay)\n\n[Outro: Natasha Ramos]\nStar Trak is who we are\nStar Trak is who we are, ooh\nStar Trak is who we are\nStar Trak is who we are", "year": "2006-07-25"}]}