{"artist": "C-Murder", "songs": [{"title": "Want Beef", "album": "Trapped in Crime", "year": "2000-09-05", "image": "https://images.genius.com/415d3692989ebe9e5966bfe9f80905c3.500x500x1.jpg", "lyrics": "[Intro:]\nIt's C-Murder, ya heard me? (Master P in here)\n(Represent that low Mid-East, wodie!) (thugs)\nFrom the unwild to the dead (wassup God?) (Where you at Fat Joe?!)\nYou want beef boy? (Joe crack) (Oh yeah) (flex)\nHuh? Joe, haha hoodie-hoo!\n\n[Fat Joe]\nYo what the fuck is goin' on black?\nYou ain't never seen no combat\nThese streets here like ?? and we on that\nYeah we on that\nWhen you see those cats comin' with 100 motherfuckers that'll kill you\nBetter run, and it's the God, Joe Creasy\nLiftin's so easy\nFifth got a clip that'll grip your dome, cheezy, for sheezy\nY'all don't wanna see that wodie, I'm from the streets\nWhere the theme is to keep that mother\nYou motherfuckers actin' like you really wanna hold beef\nLike these bullets I keep can go through your gold teeth\nLike we ain't those niggas you really wanna be\nSignin' off, truly yours, C-Murder and Joe C\n\n[Chorus: C-Murder]\nYou want beef wardie? (Niggas don't want no beef)\nYou talkin' to me wardie? (Shoot 'em right through they gold teeth)\nYou wanna see wardie? (Niggas don't wanna see us)\nI'm from the streets wardie\nX2\n\n[C-Murder]\nSee, I was born into the streets\nI'm ahead of the game, it's like a bad habit\nSeems like I'm never gon' change\nSee I'm a hustler, that means\nI'm never gon' get it\nI even ride, I mean like I get it\nSee I'm a thug nigga dog, I'm fresh off the block\nHold up player, you caught me, with a mouth full of rock\nAin't shit changed my nigga\nYeah, I'm on MTV, but I'm from the Projects\nWhere ???\nYou and me, ain't no sunshine when I'm there, I'm there\nI'm from the streets, my niggas in the hood, they be dyin'\nWhere the key is, won't slow down, lay down\nI'll have you restin' in pieces\nNow listen up player, if you really want beef\n\n[Chorus]\n\nNo Limit\nYo that's why..."}]}