{"songs": [{"title": "100 Proof Absolut Rocka", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nI've only been around for, like\nTwo and a half years, really, doing this music thing, but\nI've been around long enough to be able to tell the ones\nWho are actually serious about this\nThan the ones who just think they serious about this\nBut I'm letting y'all know, though\nI gave my life to this, brandUn DeShay\n\n[Verse 1: brandUn DeShay]\nYeah\nI feel like these rappers really dinner than me\nKilling tracks, it's the sinner in me\nI feel like it's another nigga living in me\nHow the hell I'm supposed to sleep when I'm living the dream?\nMake tracks like that, rap infinitely\nFunny thing: I'm not a rapper, coincidentally\nAw, let them hear that, of course they gonna hate\nNiggas wouldn't crack a smile with a porcelain face\nFinally blacking out like the pores on my face\nIt's important to wait, F that, I'm impa...tient\nI've got to bring light to the truth\nLike back to the booth, like back to the fu...ture\nChurch, apocalypse, hand full of pocket lint\nI ain't got scratch, so I got to itch\nY'all dudes blowing money like you guys rich\nNo, y'all blowing money like y'all got a dick\n\n[Chorus (4x): brandUn DeShay]\nYou think you're gonna get it, but I know I got it\nI don't even got to be modest, honest\n\n[Verse 2: Ev4n Holt]\nBefore I even started rapping, I was destined to be [?]\n[?] just a bad emcee\nBetter than most of these niggas, don't compare them to me\nUnless they sold a million records or a legend-to-be\nBut that ain't happening 'cause niggas barely make it to three\nI talk a hundred and you niggas pushing units for free\nI'm selling mines out the backpack\nWhere admirations in making millions and talking on the all-red Blackjack\nBut past that, I'm trying to be in the office\nCalling my own shots, not a regular artist\nUp in the big screen, looking like Denzel\nYou know who I am, bitch, I'm Mr. All Hail\nThis nigga made it from nothing, a dollar and a dream\nAnd turning after the sun is harder than it seem\nMy heart is still in the gutter, I do it for my fam\nSo I whip and flip shit like a thousand eight grams\n\n[Chorus (8x): brandUn DeShay]\n\n[Sample (7x)]\nThey claim you never know what you got 'til it's gone\nI know I got it, I don't know what y'all on", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}