{"songs": [{"title": "Sometimes", "lyrics": "[Verse 1: Akala]\n\nWhen I feel like \"fuck it I've had enough\"\nMight as well bury my head in the sand and run from the world\nNo music or politics, I'm done with all of it, I just can't take no more\nIt's easy to let the world get you down\nLook around\nIt seems that every towns got the mindness of profound\nThe haves, the have not's\nLives we admire\nRags to rags lot that never climb higher\nWe're on a ladder of life, the ladder of success\nThe ladder of fucking over other people the best\nIt's a game of chess, where the pawns get sacrificed\nThey got limited movement and their on the frontline\nYeah, the game's rigged from the start\nThis we know in our heart\nYet we pick up the dice and play a part\nBut would it be better to act like a spoilt little brat?\nKick over the whole game with no shame\n\"I ain't playin' if I can't win\"\nPrayin' if I can't sin\nWhat is a wife saying to a daft king?\nNot much, power's fucked\nI know it runs the world, sometimes it's too much\n\n[Chorus]\n\nLike \"fuck it I've had enough\"\nMight as well bury my head in the sand and run from the world\nNo music or politics, I'm done with all of it, I just can't take no more\nWhen I feel like \"fuck it I've had enough\" x3\nIn the end I'm like \"Shutup you coward, just suck it all up\"\n\n[Verse 2]\n\nCan't sleep, my mind's runnin'\nOn a path of it's own and I ain't sure that I'm even comin'\nAll night I been tryna get a wink\nThe sun comes up now and I ain't had a blink\nI think too bloody much\nAll the voices go around in my mind and I can't shut 'em up\nThey say \"ignorance is bliss\"\nI ain't sayin' it is\nOn those nights when I can't shut off, I get pissed\nFor me, this is most nights of the week\nIf we look at the world then how could we sleep?\nSee in my deeper moments\nI can only keep theOnus on what is wrong with the world and we can't even solve it\nLike we ain't involved with anything promoted than to focus on our own little selves\nThe rest can go to hell\nHow do I know it so well? It's me\nSpecially at those times I wanna flee from reality\n\n[Chorus]\n\n[Verse 3]\n\nThe road to depression I'm guessin' is oiled by a choked expression\nAnd of course naked oppression\nThe lessons we're supposed to learn, is not possible\nCause you are not a fool and the teacher's horrible\nSo what choice left is there for sensitive souls?\nFight the power or let it swallow us whole?\nIt is easily done, look what we've become\nIf we could, I'm sure we'd find a way to put out the sun\nSometimes when I feel like collapsin'\nOr giving in to the times that I'm trapped in\nI contemplate all the others overcoming their fears\nFighting battles far harder so that I could be here\nThen I feel like the silly little boy that I am\nCount my blessings in the moment and get back to the plan\nInspiration is the strangest thing\nHow it travels one spirit to another, transforms how we think\nI know spirit is a dirty word, in this world obsessed with what we have and what do we earn\nBut its the only way to explain the voices inside of you\nOnly satisfied when you are inspired to\nIts the reason when we feel we've had enough, always in the end we manage to get back up\n\n[Chorus]\n\n[Outro]\n\nLife is hard, life is beautiful\nLife is strange, and life is unusual\nIf life's a stage, then who wrote the musical? (Who wrote the musical?) x2", "year": "2015-03-30", "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}