{"artist": "Killer Mike", "songs": [{"image": "https://images.rapgenius.com/7bb171b69cd2a1afcd0b740b0ec85655.608x608x1.jpg", "title": "Big Beast", "year": "2012-02-13", "album": "R.A.P. Music", "lyrics": "[Verse 1: Killer Mike]\nHardcore G shit, homie, I don't play around\nAin't shit sweet bout the peach -- this Atlanta, clown\nHome of the dealers and the strippers and the clubs, though\nCatch you coming out that Magic City with a snub, ho\nLurking in the club on tourist motherfuckers\nWelcome to Atlanta, up your jewelry, motherfucker!\nThese monkey niggas looking for some Luda and Jermaine\nAnd all that nigga found was a Ruger and some pain\nPow, motherfucker, pow! Come up off the chain (ay, ay)\nPow, motherfucker, pow! One off in the brain (ay, ay)\nWe some money-hungry wolves, and we down to eat the rich\nYour bodyguard ain't shit, we strip him like a stripper bitch\nThese real-ass killers move in silence with violence\nThe minute it set off, we the motherfucking wildest\nHow you from Atlanta they ain't never speak upon\nWhere everybody got a sack of dope and a gun\n\n[Chorus: Trouble]\nAnd you know just how it go\nWe ain't playing round with that bullshit\nNigga, we ain't let that shit go\nWhen you come here, you better come correct\nThis real G shit, you gotta show respect\n\n[Verse 2: Bun B]\nOnce upon a time in the projects\nAn O.G. saw a young Bun B as a prospect\nThought that I would understand the streets from a very young age\nSo he opened up the G code to the front page\nHe sat me on the porch, said, \"This where little dogs sit\"\nPointed at the yard (yard), said, \"That's where big dogs shit\" (shit)\nHe said, \"Don't leave til your ass get growed\nAnd don't come back til your ass get throwed\nWhatever you want is whatever you can have\nBring the pain and leave em wet, like they soaking in some salve\nWhen you step out on the ave (ave)\nMake sure they wanna see ya (wanna see ya)\nCause being trill is an onomatopoeia\nBe about it like a G, a hater wanna catch you slipping\nTry to be a Jordan (Jordan), but settle for a Pippen\"\nPlayer, I ain't even tripping, but I don't really care\nCause my pistol's in your face, so put your hands in the air\n\n[Chorus: Trouble]\nAnd you know just how it go\nWe ain't playing round with that bullshit\nNigga, we ain't let that shit go\nWhen you come here, you better come correct\nThis real G shit, you gotta show respect\n\n[Verse 3: T.I.]\n'96 I'm riding with a pistol grip, banana clip\nFrom Simpson Road to Adamsville, I'm repping this Atlanta shit\nNigga trying to handle up, let's see can they handle this\nA hundred round at em, that ain't no Louisiana shit\nDrinking on that Hennessey, blowing on that cannabis\nAmerikkka's nightmare, trap nigga fantasy\nA record full of felonies, searching for a better me\nBut choppers go off in my hood like Iraq, Cuba, Tel Aviv\nShoot a nigga, let him bleed; fuck him, shorty\nSucka nigga, I'll never be, don't give a fuck about it\nQuick to run up on that Audi, make em get the fuck up out it\nNigga better be about it, he deserve it he allow it\nWhat's a coward to a kamikaze? He ain't robbed a man\nAin't predator or prey; the law of nature where I stay\nI catch you slipping with that K, ain't no illusion, no confusion\nBetter come up off that cake and all that jewelry or you snoozing\n\n[Chorus: Trouble]\nAnd you know just how it go\nWe ain't playing round with that bullshit\nNigga, we ain't let that shit go\nWhen you come here, you better come correct\nThis real G shit, you gotta show respect\n\n[Verse 4: Killer Mike]\nWha-da-dang, wha-da-da-da-da-dang\nListen to my Kimber .45 go bang\nBang bang, Grindtime, rap gang\nWe the readers of the books and the leaders of the crooks\nPredators, we eyeballing all of y'all lames\nLet me fall off, I'm taking all of y'all chains\nAll of y'all watches and all of y'all cars\nWell, who he talking to? All of y'all stars\nAll of y'all rappers and producers and such\nNo homo promo, homie, you might get your ass touched\nLike Def Jam circa '83, you get rushed\nIf you rolling with some winners, then you rolling with us\nI know some dumb country niggas, but them niggas ain't me\nKnow they dress and look the part, but them niggas ain't G\nI don't make dance music, this is R.A.P.!\nOpposite of the sucker shit they play on T.V.!\n\n[Chorus: Trouble]\nAnd you know just how it go\nWe ain't playing round with that bullshit\nNigga, we ain't let that shit go\nWhen you come here, you better come correct\nThis real G shit, you gotta show respect"}]}