{"songs": [{"year": null, "image": "https://images.genius.com/eb0fd4086bbb0dca7d293ebb698f2977.620x620x1.jpg", "title": "Bushmaster", "album": "Blaq Poet Society", "lyrics": "[Intro]\n\nThe fuck you say now, huh? Hey, huh? Bam bam bam motherfucker I am strapped. You don't fucking talk now, huh?\n\n[Verse 1: Vinnie Paz]\n\nI got the AR-15, let me hit his head\nHeard us running up inside the crib and then he shit his bed\nI ain’t trying to hear nothing cousin give me bread\nThe only thing inside the duffel bag shrunken heads\nThat’s how motherfucking grimy we are\nYou don’t wanna see how motherfucking violent we are\nYeah, or where the motherfucking silencers are\nWhat the Asiatic motherfucking sciences are\nI know you saying that this motherfucker curse a lot\nI’m just trying to balance out the fact you rock a purse a lot\nI heard you suck dick and walk around in skirts a lot\nListen to Kanye West, recite his verse a lot\nPazienza I don’t rock with that soft shit\nWe juice crew Hilltop hardcore shit\nWe got the ? digger uncut raw shit\nTo put his motherfucking body in the morgue shit\n\n[Verse 2: Blaq Poet]\n\nMurder the murder the more crime, that’s what I’m about\nFind these motherfuckers, air em out, I don’t care about\nYour innocence, don’t be in my vicinity\nBullets got no name, I aim at my enemies\nEmpty the clip, pistol-whipping your friends\nReload my shit just to kill em again\nMy house of pain, ain’t no way outta here\nFuck outta here, catching mad bodies here\nI got that new shit you bang\nScrewball wilding out with the Pistol Gang\nYeah, ain’t no way of stopping this\nDon’t be scared, just prepare for the Apocalypse\nFuck what you gotta say\nI’m a predator, y’all motherfuckers is the prey\nI can do the shit in my sleep\nI was taught to terrorize rappers and torture the beats\n\n[Interlude]\n\nThey got Uzis, they got shotguns, they got explosives, they got access to any kind of weapon they want within 24 hours\n\n[Verse 3: Lateb]\n\nThis is Smash Mouth, might as well I took the MAC out\nCut your pretty grill now you got something to rap out\nMercenary merciless no stopping if you tap out\nTake everything like po’s raiding the stash house\nI’mma break your nose with the poetry of rose\nPush your blind faith like the fucking rosary you hold\nOpenly I’m bold cause I’ve broken all the laws\n? my soul\nEvil’s all I know, ? fiending for control\nSo each second of each day the demon in him grows\n? feed him all day ? never fold\nInterrupt him while he’s eating now you bleeding in the fold\nGotta know what trouble is the opposite of rubber grip\nTied to a chair, ? bucket lips\nYou should stop complaining, the muttering and mumbling\nCause ? cause eternal suffering"}], "artist": "Blaq Poet"}