{"artist": "360", "songs": [{"album": "Rarities", "year": null, "title": "Pez ‘N’ Six", "image": "https://images.genius.com/e43ac3b183667bcbd9c5f60579b33f10.220x219x1.jpg", "lyrics": "[Intro: PEZ]\nUh, yo\nSome people seem to think that we're arrogant\nWell, you're right\n\n[Verse 1: PEZ]\nShit, I rock ridiculous bling\nI made this shit at home on my own with some glitter and string\nPlus I rock Cheezels on all my fingers as rings\nStole a granny's wheelchair and got it fitted with rims\nThen I got a sound system, hooked it to the seat\nNow my walker has to push me to the beat (Do it)\nPlus we're so famous I got my own stalker\nI hate to speak, I've even got my own talker\nStunt doubles, I got three on pay\nFuck performing, this isn't even me on stage (nah)\nI don't record either, shook by the choice\nSixty does the vocals and just puts on a voice (What? It's true)\nSo who's heard of that Xzibit guy?\nI took a trolley to his house and told him, \"Pimp my ride\"\nIf he didn't then my fists would fly\nMess his face up so bad even his fish would cry\nTo pick up girls, I just say that we're rappers\nAsk 'em out to dinner then I take 'em to Maccas (Too cheap)\nIf the bitch complains then I'll flip raw dude\nBut it doesn't bother me 'cause then I get more food (Yes)\nAnd fuck hip-hop, I only started rhyme\nSo I can go on Oz Idol and fuck Marcia Hines (That's it, bend over)\nAnd half my lines, cats question aloud\n'Cause I choose my worst rhymes and leave the best ones out (That's how we do)\n\n[Interlude: 360 & PEZ]\nAh, PEZ, man\nAh, that-that's the chorus, dude\nAre you gonna do a chorus, man? Ah, nah, man\nFuck a hook, all right\n\n[Verse 2: 360]\nUh, it's Sixty Cent, the vocal bastard\nRockin' fake bling from your local market\nSmokin' grass until we're chokin' hard\nAnd I'll smile with gold teeth in my open casket\nAlways on the list for V.I.P.\nAnd these stupid motherfuckers wanna see I.D.?\nBitch, everyone in here wants to be like me\nPlus we don't pay to travel, 'cause we fly free\nI never catch the train, babies reek\nIf I did I'd have my own allocated seats\nIn pinstriped suits, we dine in class\nOur drinks make my [?] taste like wine from casks\nAnd my butcher's got the nicest arse\nI've got diamonds in my rings made from fibreglass\nI need a shit, but I got tired arms\nSo I'll pay a motherfucker to wipe my arse\nYo, I'm tight with money, I may be Jewish\nI don't like to talk, so I can save my fluids\nFuck Bec Cartwright in front of Lleyton Hewitt\nAnd tell him Mark Philippoussis made me do it\nI don't watch O.C. on a Tuesday night\nI got the whole cast at my house to do the play live\nSend the bitches to my mattress, hop on\nMake 'em tell me that I'm rappin' hot songs\nAnd fuck the faggots from Saturn dot com\nI only fuck bitches with platinum condoms (ha ha)\nSo fuck off if I'm not arrogant\nI'm so arrogant that I don't even have to rhyme"}]}