{"songs": [{"year": "2010-03-10", "image": "https://images.genius.com/1b1da653144da5c5a984e726b5af373b.450x450x1.jpg", "title": "You Gotta Believe It", "album": "Friday Night at St. Andrews", "lyrics": "[Intro:]\nI'd like to thank everybody for coming out\nIt's the last song on the album\nFriday night at St. Andrews\nHahaha\nImma leave y'all with some positives\nThey say I'm always negative\nHaha\nPay your dues man\nHard-work pays off and reach for the stars\nYou can make it\n\n[Verse 1: Bizarre]\nIf you believe then you can achieve\nJust ask and you shall receive\nAnd I shall proceed to rock the mic\nHip Hop shop every Saturday night\nYou wanna be a rapper, dreams of being an engineer\nGrab some equipment, buy you some gear\nGo to guitar center on your next pay day\nYou can't afford it,put it on layaway\nThat's what I say, it's called paying dues\nFuck a new watch, fuck buying some new shoes (Fuck that)\nHere's what you do, invest in your self\nStand up, have some respect for your self\nYou wanna be like Dr. Dre or Hi-Tek\nA couple of years, you ain't quite there yet\nJust believe, my nigga just believe\nJust ask and you shall receive\nD-Twizzy\n\n[Hook: Monica Blaire]\nAsk and you shall receive\nYes\nYou gotta believe it\nYou gotta pound that pavement\nWork those stations in rotation\nAsk and you shall receive\nYes\nBut you gotta believe it\nIt's all about you\nWhat you gon' do\nWhat you gon' do\n\n[Verse 2: Bizarre]\nYou wanna be famous, get a lot of cheddar\nThere's a million rappers\nWhat makes you better\nFreestyle? Is that all you gon' gimme?\nWhat about writing a verse? Working on your delivery\nHow many battles you been in? How many shows you rocked?\nAnd I don't give a fuck'bout how many Glocks you bought\nThis is Hip-Hop, we're all tryna sell\nAnd all real gangstas are dead or in jail\nYou got a dream, your dream is rapping\nNow what you gon do to make this happen?\nGo to New York and look for the AML\nGo to Shade45 tell em you know Bizarre\nBe like Bone Thugs and bust up to Cleveland\nHomeless in L.A barely out there eating\nThis ain't all in vain man,I feel your pain\nBefore the sunshine, there's always rain\n\n\n[Hook]\n\n[Verse 3: Bizarre]\nYou wanna emcee but you got no bucks\nYou got no money and you're damn near a vault (damn)\nHomeless in L.A, nowhere to stay\nGreyhound ticket, leaves on Monday\nBut don't leave yet, reach for the clouds\nYou might see Jimmy Iovine, you might run into Kevin Laws\nBe proud, hold your head high (stand up)\nAt the end of the day, you can say you tried\nGet in a rap battle, drop a nigga head\nHit him with punchlines, make sure he dead\nGo to shady records, stand on the curb\nWait all day for Paul Rosenberg\nAnd if he say no, come back tomorrow (Fuck It)\nBust a freestyle, let him feel sorrow\nIf you belive then you can anchieve\nJust ask and you shall receive\nD-Twizzy\n\n[Hook]\n\n[Outro: Monica Blaire]\n\n(Ad Libs)\nDon't give up, it's all about you\nWhat you gonna do"}], "artist": "Bizarre"}