{"songs": [{"lyrics": "[Verse 1]\nHere we go\nFive, 10, 15, 20\n25, 30, 35, 40\n45, 50, 55, 60, 65, 70, 75 ways\nToday's in a maze and start the craze\nWhen they opened my cocoon, it was time to bloom\nThinkin' like 10 people, trapped in one room\nSittin' in my sandbox, sand all over me\nOverly anxious to get the mic in hand\nNow who wanna blow it up, I do\nNow who can rip it up, I can\nI glide like the ride of a man on a snowboard\nWhen they pick up the microphone I ask him what he flow for\nVarious degrees of technique that's inside of me\nNever try to be something you not, and don't lie to me\nEbony and Ivory, keys on my piano playin'\nTryin' to test some music, but the rhythm push my hand away\nEasy as the alphabet, hard as solid rock\nPure as the driven snow, pissin' on your block\nMark my territory then I'm right back in it when\nLaughin' with the teras of a clown when I grin (Ha, ha, ha, ha)\nI'm manic-depresive ever since I was an adolescent\nBut I never panic in a sesion when I'm bussin'\nCussin' like a sailor with a bottle full of Jägermeister\nReady for whatever this world has to offer me\nPlus it won't get off of me and never ever test me\nI'm one with the universe the energy has blessed me\nBet you wonder why you got flaws in your character\n'Cause you're caught in the ass-crack of America\nI just want to help you all but all I do is stare at ya\nYou can have a shot of this or maybe hit this marija\nWanna if you wanna but, if not, stay drug-free\nBut plug me in the mix boy, right up next to plug three\nTalkin' out the side of your neck it ain't a remedy\nI just want the whole wide world to remember me\nI don't want to have to think you're working for the enemy\nSabotage, you can't conquer this energy\nYou can be the center of attention if you want to\nMy party is in the other room and we're just having fun too\nSo I'd like to signify the monkey that's in back of you\nAll I want to do is get rid of all the wack in you\nDo not get offended because, no I'm not attacking you\nI don't have to do nothin', the rappers start smackin' you\nMaybe I should just give you a taste of reality\nWelcome to my art show, it's not about a salary\nTake two of these a day and burn a couple calories\nMe and the mic are like Mickey and Mallory\nRockin' like a B-boy, part of my anatomy\nHands on your groin', you can join this academy\n\n[Chorus]\nAccepted! Eclectic!\nAccepted! Eclectic!\nRespect it!\nAccepted! Eclectic!\nAccepted! Eclectic!\nRespect it!\n\n[Verse 2]\nHere we go\nFive, 10, 15, 20\n25, 30, 35, 40\n45, 50, 55, 60, 65, 70, 75 ways\nToday's in a maze and start the craze\nAccepted Eclectic, the phrase that pays\nOld Eddy Hayes, it's time to blaze\nOne of L.A.'s that's born and raised\nNow that we've got ourselves a little more acquainted\nAin't it about time I get this picture painted\nI am what you call a psycho-analytical\nCritical thinker of the formulas we all need\nI think I'm running out of brain space in my hard drive\nPlus I need a memory card for my control pack\nThrow that hand up so I can see your fingertips\nI'm about to rip it up better than before\nYeah I had a crazy people party and invited you\nI didn't know my underground hip hop excited you\nNow that I know this fact I'm gonna throw it right at you\nI just wanna give you everything that you're entitled to\nDown in the Leimert park, hangin' with the hooligans\nEvery now and then I've got to take 'em back to school again\nMaybe you should call me your hip hop counselor\nI'll be on the rhythm when the beats start bouncin' up\nI'll give you a minute just to get yourself together and\nWe can have a sing-along, all and together and\nHere's to the Netherlands, sistern and brethren\nB-Boy benevolence, birds of a feather and\nIt don't matter what you say, we all are connected\nSome are on a rap path, some are misdirected\nWhen I say, \"Who wrecked it?\", just like they expected\nAceyaloney-boy, accepted eclectic\n\n[Chorus]\nAccepted! Eclectic!\nAccepted! Eclectic!\nRespect it!\nAccepted! Eclectic!\nAccepted! Eclectic!\nRespect it!\n\n[Outro]\n?", "title": "Accepted Eclectic", "album": "Accepted Eclectic", "image": "https://images.genius.com/4f38e699f6f80a3255420adf5e98a0a8.600x600x1.jpg", "year": "2001-03-06"}], "artist": "Aceyalone"}