{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "Pay Attention", "year": null, "album": "The Tape", "lyrics": "[Kid Capri]\nOh that'll work.. word.. ssssssmooth!\nOooh, this one goes to all the coolouts\nAll the old schoolers, all the new schoolers\nMy name is the Kid Capri, with the Lords of Funk\nAnd we gon' smooth it out like this, bust it\nMake it real mellow, bet it be smoother than a cello\nAnd while we're at it, rest in peace to (?)\nNow make it real cute, make it sound like a flute\nIt's gonna drop, just like a parachute\nI can't wait to see my name on a marquee\nThey're gonna put it right there where it should be\nI'm gonna blow up, and man I can taste it\nAnd anyone that don't like it - face it!\nThe Kid Capri is goin to war, and that's the truth\nI gotta prove to these suckers that I'm bulletproof\nI'm playin low key, for a little bit\nIn the studio, tryin to make a hit\nI work for hours and hours and days and days\nThinkin about all the cash this pays\nBut nevertheless I gotta, be the best\nI gotta, dress to impress, and have a girl with the Guess jeans\nOn her behind, the girl is so fine\nI love the way she light the candle when we, wine and dine\nI electrify minds, exterminate suckers\nPlay a little music at the games, the Ruckers\nBe on the court, playin what they're taught\nOnce it's finished I'll be chillin in a fly resort\nNow many, have tried to diss my face\nCause the girls, stare, when I come in the place\nI'm not braggin, but I gotta say that I'm great\nThe more you see me is the more that you a-ppreciate\nMy talent, superb expertise for rap\nAnd everything that goes with, including your clap\nCause I'm strong, my strategy is highly talked about\nAnd I'm takin NO shorts, I'm goin ALL OUT!\nI despise those guys that come in my face\nAnd say I'll battle you, any time, any place\nI just - shake my head and say, \"Mmm yeah right\"\nBut it's a whole different story once we're on the mic\nI'm not sayin I'm the best, but I never fall\nAnd I serve crab rappers like it's nothin at all\nYou know the dope sayin easier said than done\nWell I did it, it was easy, and I had fun\nDoin what I like, takin brothers off the mic\nCold slammin over parties with the rhymes that you like\nNeed I say to the crowd as the system kicks loud\nJust as long as I can keep your body movin I'm proud\nThe sound we supply make you people keep in step\nI wanna make sure, the syllables connect\nAnd you think about a battle, well how could you win?\nYou never wanna come across, the Lords again\nAnd Money Mark is a in, the house\nWithout a doubt, Money Mark is in the house\nAnd my man Silver D, he got it goin on\nHe won't steer you wrong, cause the brother got it goin on\nAnd the Kid Capri is definitely in effect\nThe man Kid Capri is definitely in effect\nYou ever try to diss I just might get WRECK\nThe man Kid Capri is definitely in effect a word up\nAnd Biz Mark, he got it goin on\nAnd my man Kool V, he got it goin on\nAnd the DJ Doc, he got it goin on\nAnd my man Troy Outlaw we got it goin on\nMy man the Don, he got it goin on\nTo my man Kid D, he got it goin on\nAnd the Troopa Luv crew, we got it goin on\nAnd it's the Lords of Funk, we never ever ever steer you wrong\nAh yes yes y'all, it gets fresh y'all\nAh yes yes y'all, it gets fresh y'all\nIt gets fresh get fly, we get on down\nLords of Funk baby doll we're the talk of the town\n\nAnd that's for those that like to cool out\nIn the old school, the new school\nWhatever school, with all the schools\nYknahmsayin?  We do all that, we can do all that\nBut there's one thing I must say before I go\nRest in peace to my man Jigga G\nRest in peace to my man Jigga G\nComin from the immortal words of DJ Kid Capri\nRest in peace to my man Jigga G\nAnd rest in peace to my man Poppa Duke\nRest in peace to my man Poppa Duke\nSounds so sweet like somebody playin a flute\nRest in peace to my man Poppa Duke, word up\nAnd I'm outta here.. c'mon!"}]}