{"songs": [{"image": "https://images.genius.com/f76859a7771f0b768b1acb4fb32fbc26.500x500x1.jpg", "album": null, "title": "I Rest My Case", "lyrics": "[Intro]\nWe got Shannon Sharpe and Skip Bayless and all these sports people talkin' bout championships, and basketball this\nThis is rap\nY'all out y'all's jurisdiction and you can't save 'em\nD.O.L.L.A!\n\n[Verse]\nHe easy working, he know it but fans ride you\nI know you know when niggas really love you, they'll lie too\nAnd it hit different when pressure really apply fool\nGoofy cutting checks and his BM sponsor is side dues\nI could walk away and not lose a second of sleep\nRun up on a wolf 'cause I got the texture of sheep\nClassy with my bullshit, I professor a lesson in beef\nPaying cats to write, is decease a pay for relief?\nYou's a clout chaser, even after all the success\nFake love on the camera, he capping all at the desk\nGhost writers on deck, checker boards, no chess\nHailing from the land of the muscle cars, no flex\nYou not a rapper, you comedy, commentary, and actor\nFeed 'em with a slingshot, you better call the pastor\nDavid and Goliath, your stature's a non-factor\nFriends really love you, they scatter and contact you like\n\"Shaq just let it be 'cause no weapons gon' ever prosper\nRemember you're a cop with endorsements and you're a doctor\"\nI'ma get the tommy and do the diesel like proctor\nAnd your weight rising, you might get sneaked at the opera\nYou awkward, I know you got habits to cover bases\nHead up in the clouds but his rumble is in the basement\nTell the world prepare for a harder fall on the pavement\nThen I put you under, today I'm working the grave shift\nRaised real solid, I'm DOLLA but not for dollar sign\nOnly Dame you beat was 2000 and that was Stoudemire\nMusic to my ears when a phony or any coward try\nCut out all the lights on this oldie, I'm like the power guy\nI think your pen kinda sketchy, you should've left me\nSensitive, I almost confused you with Lisa Leslie\nHow you swing on Chuck and then try and go be his bestie?\nLove them mosh pits full of men, you be looking zesty\nWhat you thought, 'cause you popular, shit was sweet?\nWe spot insecurities far away in the East\nI don't wanna hear it, don't bargain with me for peace\n'Cause we gon' shoot it out 'til you bow and just never speak\nI mean it, I'm not the one, I don't care about what you did\nWhat you done lately? Don't tell me 'bout what was then\nWhen you was in your prime getting faded off fifths of Hen'\nI was rocking Js in my pop's Mercedes Benz\nUh, so basically all that money not gon' impress me\nI been on the thinnest of ice and turned into Gretzky\nEven if you cut me a check, you could never check me\nThis a epic moment in sports, I need a ESPY\nI know you only competing for some attention\nYou was hot then, but today, you honorable mention\nAll your closest folks need to come with an intervention\nThe General commercial's a little over-extended\nCut it short man, this really ain't worth your legacy\nRather get embarrassed instead of live with the jealousy\nThe game moved on, you was gone, she's no Penelope\nYou play with GP and B. Shaw, you know the pedigree\nA wise men said \"A clown gon' always perform\"\nRather stay in character 'stead of weather the storm\nYou can call me Damian 'cause my supremacy's born\nTold me sex myself, stay away from the porn\nI done talked music with Jada, Juvie and Weezy\nPusha T, Common and Jesus with me like Yeezy\nBudden podcast and do special olympics with Stevie\nNo wonder you feel a way, and I fuck with G-Eazy\nJamie Foxx, 2 Chainz, I really rock with the dopest\nI was in the stu' all night with Marsha Ambrosius\nYou gon' say you always had it rocking like a boulder\nThe real original was yelling \"No Limit Soldier!\"", "year": "2019-10-04"}], "artist": "Dame D.O.L.L.A."}