{"songs": [{"album": "Celcius", "image": "https://images.genius.com/44b96a02c4ad68840aa7a37b7345ba30.1000x1000x1.jpg", "year": null, "title": "Be Warned", "lyrics": "[Intro]\nThe omega (the end)\nCheck it out, check it out\n\n[Verse 1]\nAnybody wanna go to war with a nigga like Tech Neezle?\nWe killing them evil people\nAnybody thinking evil is feasible need to go\nEverybody that's banned for, I'm a killer with a chainsaw\nI'ma damage and mangle, the devilish death by an angel\nChange y'all, fuck a nigga, buck a nigga\nWhen he wanna get a piece of a native Amerikilla\nFo' realer gorilla like me, a mothafucka might see or might not see\nThat I'm 'bout me broccoli, you can lock me\nIn a cell wit a Nazi whiter than oxy and he wouldn't wanna box me\nWhen I'm finished, the mind is diminished\nThey coming out blacker than a shocked Lee (number nine)\nWhat? Complete the heat, release the beast for me, defeat\nIrregular, secular, right next to ya\nWatching the beat have sex wit ya, Midwesterner\nShakin' hella hands and kissin' babies\nSpittin' that shit that’ll make ‘em all go crazy, in a war zone\n\n[Interlude]\nIf you repeat the words, \"Be Warned\" three times\nAll your fear and stress will no longer exist\nDenraW eB, denraW eB, denraW eB\n\n[Hook]\nWeak mothafuckas, this is lyrical WARFARE!\n“Everybody wit the Tech N9ne betta bust back like a muthfucka\" (OH YEAH!)\nAnybody wanna diss Tecca N9na you know that you mothafuckaz goin' (NO WHERE!)\nEleven eight seventy (O-N-E BOMB!)\nThese punk mothafuckaz betta (BE WARNED!)\n\n[Verse 2]\nI write the scripture to flip ya, no course to got you\nWhen I ripped'cha, lyrics bit'cha like Nosferatu\nWhen I lit'cha, when I spit'cha, right before I shot you\nWa alaikum assalam wa rahmatullahi wa barakatuh\nFeelin' my heart hates my brain (brain brain)\nCause my brain makes me do things that causes my heart pain (Who's to blame?)\nNever will the N9na name any names (names names)\nBut uh, motherfuckers wantin' N9na to sell his soul for the price of fame\nFuck that with a big dick!\nNever will I get wit a motherfucker tryin' to get the millimeter twisted!\nBow to me! Six six triple eight forty six ninety nine three! will beware\nOn top of the world, it's mine! Look ma I made it!\nSatan delayed it, but a higher power okay'ed it!\nSo I sprayed it! Nigga nigga\n\n[Hook]\nWARFARE!\n“Everybody wit the Tech N9ne betta bust back like a muthfucka (OH YEAH!)\nAnybody wanna diss Tecca N9na you know you mothafuckaz goin' (NO WHERE!)\nEleven eight seventy (O-N-E born!)\nThese punk mothafuckaz betta (BE WARNED!)"}], "artist": "Tech N9ne"}