{"songs": [{"title": "Come and Get Me", "album": "All Things Work Together", "year": "2017-09-22", "image": "https://images.genius.com/747844e49a25266360c34f8cab2cc4de.1000x1000x1.jpg", "lyrics": "[Intro]\nAye Biz, let it drop right here\n\n[Chorus]\nYou better tell me if you with me\nI know the Devil tryna stop me\nGot these people out here wishin' they could pop me\nIf they want me, come and get me!\nMan, I ain't scared of none of y'all\nThe only thing I fear are the IRS and God\nIf you wanna go against me\nNah, they prolly better think twice\nGot angels over my head, war on my mind\nIf ya' want me, come and get me!\nWell, y'all might as well go ahead\nI'm prolly more of a threat to y'all when I'm dead, though\n\n[Verse 1]\nTwenty-four years old, my momma brought me to the globe\nTried to tell me it was cold and taught me how to keep the coat\nNow, now, now she told me to go to school and get my education\nBut remember there's a bias to them books that they be makin'\nGave me, Soul on Ice and taught me\n'Bout the Middle Passage, told me\nGod ain't white and that there's\nMore to life than rap and I\nExpressed my opinions, my faith, and my views\nIf they wanna keep me quiet, tell 'em, \"Do it!\"\n\n[Chorus]\nYou better tell me if you with me\nI know the Devil tryna stop me\nGot these people out here wishin' they could pop me\nIf they want me, come and get me!\nMan, I ain't scared of none of y'all\nThe only thing I fear are the IRS and God\nIf you wanna go against me\nNah, they prolly better think twice\nGot angels over my head, war on my mind\nIf they want me, come and get me!\nWell, y'all might as well go ahead\nI'm prolly more of a threat to y'all when I'm dead, though\n\n[Verse 2]\nHuh, once upon a time, God opened up my mind\nAnd He showed me I don't have to be a product people buy\nWith this God-given wisdom, I can climb out the holes\nStay up out the system 'cause the system never let you go\nSpeak the Truth without no fear\nIt's gon' ruin in my career\nI've been a mascot for too long\nI ain't come here for no cheers\nFirst of all, let me be clear one time\nLet me be real one time\nIf you want a religious puppet you gon' have to hang this guy\nI've been around the world and seen pretty girls get caged up like sex slaves\nCrooked cops done pulled me over, treated me like I ain't made\nIn the image of God and that's so odd\nI'm at Sunday service with a snapback\nAnd if ya' hatin' on me go and hate\nBut if you gon' ride\n\n[Chorus]\nYou better tell me if you with me\nI know the Devil tryna stop me\nGot these people out here wishin' they could pop me\nIf they want me, come and get me!\nMan, I ain't scared of none of y'all\nThe only thing I fear are the IRS and God\nIf you wanna go against me\nNah, they prolly better think twice\nGot angels over my head, war on my mind\nIf they want me, come and get me!\nWell, y'all might as well go ahead\nI'm prolly more of a threat to y'all while I'm dead, though\n\n[Verse 3]\nAhem, well, um, the sky ain't the limit\nTo me it's a limitation in a planetary on my navigation\nYou can follow me to every destination, come on\nLet me make it plain, look, I'm just tryna fly withcha\nLet me tell it, man look, I ain't never lied to you\nI'ma keep it real, I'ma ride withcha, get the Key & Peele\nIf you gettin' money like you kin to Will, go and fill up banks, go and make a mill'\nIf you hatin' on me, then you speak in tongues, get a translator (oh yeah)\nIf you flakin' on me go and let it snow, I got plans later\nLook, I've been tryna tell 'em since '04-'05 (that's Real Talk)\nStill, you know these people doubt me every time\nHad an alter ego, but my ego altered at the altar call\nLooked up at the ceiling and I heard the angels talkin', y'all\nWhat'd they say? They said\nI was made in His image, in His likeness\nBite this if you don't like this, herbs and spices is righteous\nNothin' in the world quite like this, hold on to it with a tight fist\nPrototype this, no matter what yo' type is\n\n[Chorus]\nYou better tell me if you with me\nI know the Devil tryna stop me\nGot these people out here wishin' they could pop me\nIf they want me, come and get me!\nMan, I ain't scared of none of y'all\nThe only thing I fear are the IRS and God\nIf you wanna go against me\nNah, they prolly better think twice\nGot angels over my head, war on my mind\nIf they want me, come and get me!\nWell, y'all might as well go ahead\nI'm prolly more of a threat to y'all while I'm dead, though, ha"}], "artist": "Lecrae"}