{"artist": "Azealia Banks", "songs": [{"title": "Icy Colors Change", "image": "https://images.genius.com/bd767bc7100632769057b10e3ee923c7.620x620x1.jpg", "album": "Icy Colors Change - EP", "lyrics": "[Intro]\nI see colors changing away\nEvery holiday is amazing with you\nHappy holidays to you, baby\n\n[Verse 1]\nHow do you feel about the pale moon and stars above?\nAll alone I anticipate the first fresh blade of green\nThe young hydrangea blue, in bloom\nPink rhododendron too will all be gone by June\nBut now that we have grown so near beneath the August sun\nLover of mine, let's catch some shade beneath the fading trees\nOf all the seasons jewels, it took\nOne autumn afternoon to fall in love with you\n\n[Verse 2]\nThe Benz is butter beige\nI whip that Benz like \"what a slay\"\nGot that good good\nMake you wanna stay, home for the holiday\nThis that flow you been missing\nDashing young Vixen\nFly like Blitzen, back on my business\nIce on my neck, frosty and vicious\nWhat's on your wishlist?\nGot what you want, my love is like Christmas\nCandles, kisses, diamonds, frigid, fashion district\nSip this witches brew, first class ticket to you\nFantasies come true when I kick it with you\nIn the winter wonderland when you hold my hand\nCame back on the block where the guns go blam\nWe pick out the tree like Amsterdam, damn\n\n[Chorus]\nWhen the leaves fall, I learn why\nIcy colors change\nTo me you are the same old sweet\nI need your love\nI see you through my rosy colored shades\nSit on Santa's sleigh for me\nBet I'll keep you 'cause you're my cozy candy cane\nWe [?] all the same\nI need your love\nWhen the leaves fall, I learn why\nIcy colors change\nTo me you are the same old sweet\nIf I be yours and you're mine\nEvery other day will be a holiday for me and you\nWhen the leaves fall, I learn why\nIcy colors change\nTo me you are the same old sweet\n\n[Verse 3]\nSee lights in the night, you could feel it in the air\nParty over here, we getting naughty over here\nSanta Claus know I floss and shine, Rudolph\nTalk - New York, style - catwalk\nSee me in the streets like \"how much that cost?\"\nCan't keep up with the queen, baby, that's your loss\nYou know I get dough\nKiss from the lips under mistletoe\nNow you in my spell, ringing up my cell, hitting jingle bells\nIt's the hot coco, not for show\nLock n' load, rock n' roll, I gots to go\nPack your shit, start the whip\nRide with me, fly with me\nKeep it real but you could lie with me\nAnd you ain't gotta say goodbye to me\n\n[Chorus]\nWhen the leaves fall, I learn why\nIcy colors change\nTo me you are the same old sweet\nI need your love\nI see you through my rosy colored shades\nSit on Santa's sleigh for me\nBet I'll keep you cause you're my cozy candy cane\nWe [?] all the same\nI need your love\nWhen the leaves fall, I learn why\nIcy colors change\nTo me you are the same old sweet\n\n[Outro]\nA doe, a doe, a deer anew, a fawn\nA doe, the day, the dew, the dawn\nWhat sort of déjà vu's upon us?\nWood blocks of A-B-C strewn through the hall\nAnd gold champagne for two adorers\nA song to celebrate our love\nRed garland drapes the tree like you\nWhen your arms are 'round my waist, I feel the world\nOur love will grow and take us farther\nNow I've a reverie of you and you're a\nYou're a ray, a view of sun\nA star ablaze the moonlit water", "year": "2017-12-24"}]}