{"artist": "Professor Green", "songs": [{"album": null, "title": "How Many Moons (Remix)", "image": "https://images.genius.com/540e63e699c0bb11ce5fb13442dd178a.1000x1000x1.jpg", "lyrics": "[Hook]\nHow many moons\nHow many mornings\nHow many moons\nHow many mornings\n\n[Link: Professor Green]\nHave I got left til' I've no breath left to breathe\nHow longs left for me\nFor whatever the time, for the rest of mine\nI'm gonna spend time\nPutting an end to my\nEnemies who wanna put an end to my shine\nWhy bother try offending me?\nIts off with the heads of these swines\nWhen I sign out you're gonna remember me\n\n[Verse 1: Professor Green]\nRemember me?\nDon't nobody wanna send for me\nThe only time they mention me or speak of me disrespectfully is when they sleep\nI've been between a lot of legs, like a body of a centipede\nPlease enemies be more courteous, save me the sweat and forget to breath\nLife could be easier, I could ease it up\nInstead I look like someone tryna squeeze a dump\nAnd I haven't eaten in months, any of these MCs on the edge?\nI'll be the reason they jump off\nRemember the Jump Off?\nWhen I come forth\nYou don't wanna be the MC I run toward\nI like my liquor like I - straight, I ain't no Dumbledore\nUntoward to sluts, like I love and adore you\nBut it's custom, I come before you\nAnd it's cool if I can't it up, cause I've got a cucumber for you\nFuck the world I'm a stick in the mud\nAnd stingy, wanna' drink? You can piss in a cup\nI leave women as livid as stunned\nSo run your lips, I've been itching to give a chick a bit of a cunt punt\n\n[Hook]\nHow many moons (how many moons)\nHow many mornings\nHave I got left til' I've no breath left to breathe\nHow many moons (how many moons)\nHow many mornings\nHave I got left\n\n[Verse 2: Dream Mclean]\nI'm a genie in a bottle of Lambrini\nBaby, rub it and you'll see me, easy\nHave a walk in the cemetery\nYou might see me stalking my enemy\nYeah, or you might see me on ITV1 talking to Jeremy\nCause I got issues, I drink lots\nAnd I got big shoes, big socks\nAnd I tell the girls I'm soon to be famous\nI'm just abusing my status\nLike \"baby let me sign your boobies, I've made it\"\nAnd I ain't being rude when I say this\nBut through my telescope, I see the full moon on Uranus\nThey call me Dream Mclean, but you won't be calling me that later\nWhen I meet the moon my name changes, call me Kat Slater\nSo get back and be careful, it's a fact, I'm a werewolf\nI'm a lion, with a mouth full a fire and you're a cat with a hairball\nSo tell me, how many moons round Saturn bruv?\nWhy you tryna' count moons? I'll be Count Dracula\nWhacking ya, slapping ya with a spatula\nRinse, Dream and Green, all out massacre\n\n[Hook]\nHow many moons (how many moons)\nHow many mornings\nHave I got left til' I've no breath left to breathe\nHow many moons (how many moons)\nHow many mornings\nHave I got left\n\n[Verse 3: Rinse]\nWhen the full moon's out, the loons are out\nWhen the bassline hits, the goons come out\nYou might get hit up, don't rule it out\nYou hear (ooh) when the wolves are out\nCause I don't lay weed, I just date rape\nAnd get chicks higher than Rick James's on a space space\nThey call me Cap Kirk, because I slap skirts\nI'll mack an alien as long as the flaps work\nI'll make a fat girl moan when I splash her boat\nI'll beat it with the Billy in my jeans so bad she's hitting Jackson notes\nSo it's socks up, with my zipper down\nI'm on some arsed Kelly shit but I don't piss around\nYou think I'm kidding now? No, I ain't Gary Glitter\nI'm just that low-down dirty spitter stalking you on Twitter\nA full moon and I'm a sinner, wooing you out to dinner\nA lunatic, luring chicks to the loo with a pineapple pitter\nA wolf in yeaps clothing, I take these sheep home and\nRide em in the hood but when I run their reds that's when they're deep throating\nI've got police patrolling, aware that the beast is roaming\nSo how many more moons before a single silver bullet holds him?\n\n[Hook]\nHow many moons (how many moons)\nHow many mornings\nHave I got left til' I've no breath left to breathe\nHow many moons (how many moons)\nHow many mornings\nHave I got left\n\n[Link]\nHave I got left til' I've no breath left to breathe\nHow longs left for me\nFor whatever the time, for the rest of mine\nI'm gonna spend time\nPutting an end to my\nEnemies who wanna put an end to my shine\nWhy bother try offending me?\nIts off with the heads of these swines\nWhen I sign out you're gonna remember me\n\n[Verse 4: Professor Green]\nSanity I squandered it\nI think I've gone too far in darkness I'm wondering\nGhetts is pissed he ain't on the list\nWell I'm pissed off I'm not at the top of it\nDeep in thought conspiring, get the firemen called\nMy thoughts are firing, for I'm not twiddling thumbs\nI’m playing the world’s smallest violin\nInconsiderate, like I give a fuck how they feel\nKidnapping rappers and having them as microwave meals\nI know my meal's ready when the microwave stops\nI'm a lot more Jack Nicholson than I am Michael J. Fox\nThe creep that crept up on Daisy Lowe\nIn a baby grow\nSat on her knee and told her to touch me inappropriately until my daisy grows\nI'm not a man or of mankind\nA mechanical, mad mind\nI make Hannibal look more like an Annabelle\nI'm an animal at night\n\n[Hook x2]\nHow many moons (how many moons)\nHow many mornings\nHave I got left til' I've no breath left to breathe\nHow many moons (how many moons)\nHow many mornings\nHave I got left", "year": null}]}