{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Melody Adonis", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Intro]\nYou know what\nWe been through so much together\nWhen I first got down\nIn like seventy-nine\nPre-Tribe\nDuring Tribe, post-Tribe\nIt's all gravy, can't let you go\n\n[Verse One]\nUsed to think this game was a fairytale, until I met you\nNever into bullshit, you were happy being you\nMy face would just glow anytime you walked past\nMakin' a brotha jitter every time our eyes clashed\nYou were cooler than cool, smarter than most\nWhich made the Five-Footer get closer than close\nAnd to our ten year bond, I have to give a toast\nCause the way that I feel, yo it ain't no joke\nYou got a brotha feelin' high like Busta-Bus when he smokes\nAnd I ain't no weedhead so I might just choke\nBut if you make a power move and decide to be around\nThen word to Flipmode, I'll smoke a whole damn pound\nFrom Trini to Atlanta, (Yes) I'll romance you\nTake you to ecstasy anytime I get the chance to\nAnd I can rock you all night if you want me to\nSo what you wanna do? (Come on!)\n\n[Phife w/ scratched hook by Butta L]\nNo Doubt\n\"Rock the mic\" - Phife Dawg \"Microphone\" - Rakim\nPhife Dawg, Pete Rock\n\"Rock the mic\" \"Microphone\"\nThis is how it go down when a Trini and a Jamaican get together\n\"Rock the mic\" \"Microphone\"\n\"Rock the mic\" \"Rock the mic\"\n\n[Verse Two]\nI got a Love Jones for your body and your skin tone\nUnplug the phone, we needs to be all alone\nTourin' straight for eight months, which means you can't front\nAnd you know, and I know, I gots what you want\nNever cuff you at the top, I tried to stop\nYou see I get after lock, when the crowd starts to rock\nThis one dyme up front started doin' the walk\nThe way she licked her lips it made a brotha real hot\nShe had the grill of Nia Long, smile of Stacy Dash\nFront of Lisa Carson with the Mary Blige Ooh!\nMy friends be laughin' hard cause I lable you as fam\nBut they don't understand you have made me who I am\nAnd at the end of the day, yo we'll have the last laugh\nMy boo's about to have twins, so we gots to get the cash\nBut as long as I live, that's my word, I'mma be there\nFor you, you, besides I love you, Mwoi!\n\n[Phife w/ scratched hook by Butta L]\nCome on\n\"The mic\" - Phife Dawg \"Microphone\" - Rakim\nUh, bob your head to this\n\"The mic\" \"Microphone\"\nGet on the dance floor\n\"The mic\" \"Microphone\"\nAnd go for yours\n\"Microphone\" \"The mic\"\n\n[Verse Three]\nSee when the label started frontin' you were always there\nWhen the management was frontin' you were always there\nThere were times when I felt the group had want to replace me\nWhether I'm right or wrong you were there to embrace me\nWhen you have too many sheets in one tent, how can you represent?\nShit be bugged, but you were there to show me love\nThat's when I kindly picked you up and moved to ATL\nMy attitude was like, whatever, might as well go for South\nGuess they felt I wasn't worth it, didn't feel like Phifey had it\nBut now who's movin' units, motherfuckin' silly rabbits?\nPeace to the few who had my back\nFor the fakers in my clique, fuck you, that's that\nLife has really been worth living since I found you, true\nAnd there's nothing in this world that Malik won't do\nYou're my latest and my greatest inspiration, true\nI put this on my granny bible, I would die for you, uh\n\n[Scratched hook by Butta L]\n\"Rock the mic\" - Phife Dawg \"Microphone\" - Rakim\n\"Rock the mic\" \"Microphone\"\n\"Rock the mic\" \"Microphone\"\n\"Rock the mic\"\n\"Rockin' the mic\" - KRS-One \"WHAT!\" - Leaders Of The New School\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"WHAT!\"\n\"Rockin' the mic\" \"Rockin' the mic\"\n\"Rockin' the mic\" \"WHAT!\"\n\n[Phife]\nPete stop it, we there! Ha!", "year": "2000-09-26"}]}