{"artist": "Pharoahe Monch", "songs": [{"album": null, "title": "Right Here (Remix)", "image": "https://images.genius.com/4c25d91d2559c6f7b2476ec5c1c16437.384x384x1.jpg", "lyrics": "[Pharoahe Monch]\nAiyyo Uptown (WHAT?) the Bridonx (WHAT?)\nLong Isle (WHAT?) Stridong (WHAT?)\nYo Brooklyyyyyyyyyyyyyn (BO! BO! BO! BO! BO! BO! BO!)\nYo (WHAT?!)\n\nWhere the fuck is Queens? (RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nYo where the fuck is Queens? (WE RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nYo where the.. yo yo\nYo where the fuck is Queens? (RIGHT HERE!)\nYo (WE RIGHT HERE!)\n\nWe can face the fuck off like hockey or Face Off like Travolta\nFace off like car radios with the mind of Minolta\nFace off like Treach if you're fuckin with Vin Rock\nYou still pop shit? I face off like fembots\nAnd I'm the six million motherfuckin dollar man\nWith a six million muh'fuckin dollar plan\nFor thug niggas and pimp players and drug niggas\nYour technique, I sweep under the rug niggas\nOut of Queens, shit I serve with the fiends and bug niggas\nI'm above niggas, but all in all, I love niggas\nLike my man Benny Rat (uh) showed me the rap game\nTold me never to act sane on a record or rap plain\nNow the name reign supreme, seen major creme\nRhymes, sicker than lyme disease and gangrene\nI'm the most obligated, nigga creatin havoc\nCheck the meaning for Monch, the meaning becomes tragic\nRAW - if you want it\nRAW - yea we got it indeed\nYo actually I'm just tryin to eat\nFOR SURE - if you need it on tour\nYea we ready to bleed\nI'm sayin God I'm just tryin to eat\n\n[Xzibit]\nAiyyo Compton (WHAT?) ??CRson?? (WHAT?)\nWhattup bwoy? (WHAT?) It's keep bouncin (WHAT?)\nI say Long Beeeeeeeeeeeeeach (BO! BO! BO! BO! BO! BO! BO!)\n(WHAT?!)\n\nWhere L.A. at? (RIGHT HERE!)\nNow where L.A. at? (RIGHT HERE!)\nNow where L.A. at? (RIGHT HERE!)\nWhere L.A. at? (RIGHT HERE!)\nNow where L.A. at? (RIGHT HERE!)\nYo, yo, now where L.A. at? (RIGHT HERE!)\nC'mon! (c'mon) (RIGHT HERE!)\n\nI am the master of the ceremony\nSo my territory be off limits to gimmicks and niggas with trash lyrics\nAnd tracks that lack spirit so pop ya collar\nFuck ya dollar I'm extra tough and hard to swallow\nHard act to follow, never a role model or what-not\nSet-up shots, slipknot my way to the top of the pile\nThen changin the direction of it\nFrom the niggas that hate it to niggas that love it, what'chu want from it?\nA [?reputation?] of the luxurious life\nBaby find you a hooker you can transform into a houswife?\nYou loose stripes and you a sight through your windpipe\nWith action, cameras and lights and your shit ain't tight\nYou're short on sight, thug rugged, the love of it\nPush it or slam it or shove it in a vein with dope\nRemain with smoke, remote with Tash and Rass Kass\nDon't prevoke me to revoke your visitor's pass\n\n[Pharoahe Monch]\nAiyyo Uptown (WHAT?) the Bridonx (WHAT?)\nLong Isle (WHAT?) Stridong (WHAT?)\nBrooklyyyyyyyyyyyyyn (BO! BO! BO! BO! BO! BO! BO!)\nYo (WHAT?!)\n\nWhere the fuck is Queens? (RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nYo where the fuck is Queens? (WE RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nYo where the.. yo yo\nYo where the fuck is Queens? (RIGHT HERE!)\nYo (WE RIGHT HERE!)\n\nBasically y'all could get eight twice like Lynn Swann plus get ate like\nPussy\nGet ate like Mickey D's after the hydro when you push me\nGet ate like cannibalism and sliced surgical\nIn any extremity y'all get infinity vertical\nEvery line to word of mine will be verbally placed to murder you\nThe master, flippin convertible flows irreversible\nUnobtainable to the brain it's unexplainable what the verse'll do\nPharoahe's the sperm your mind's the eggs I'm burstin through\nY'all heard of me, I pack macs and crack vertebraes\nLeave niggas with third degree burns and back surgery\nMics guns knives, pick declare which object, flip\nHave niggas runnin like the Blair Witch Project\nRAW - if you want it\nRAW - yea we got it indeed\nYo actually I'm just tryin to eat\nFOR SURE - if you need it on tour\nYea we ready to bleed\nI'm sayin God I'm just tryin to eat\n\nAiyyo Uptown (WHAT?) the Bridonx (WHAT?)\nLong Isle (WHAT?) Stridong (WHAT?)\nBrooklyyyyyyyyyyyyyn (BO! BO! BO! BO! BO! BO! BO!)\nYo (WHAT?!)\n\nWhere the fuck is Queens? (RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nYo where the fuck is Queens? (WE RIGHT HERE!)\nWhere the fuck is Queens? (RIGHT HERE!)\nYo where the.. yo yo\nYo where the fuck is Queens? (RIGHT HERE!)\nYo (WE RIGHT HERE!)", "year": null}]}