{"songs": [{"year": "2017-10-20", "album": "Today We Rebel", "image": "https://images.genius.com/8aace4b16f6804ead4c1f5628361895c.1000x1000x1.jpg", "title": "Art of Drifting", "lyrics": "[Verse 1]\nYou don't love the church no more\nYou don't love the church no more\nYou don't wanna serve no more\nYou just love the perks homeboy (yeah)\nAnd countin' money from your merch homeboy\nTicket ticket ticket tickets (how we do it)\nTicket ticket ticket tickets\nAnd we ain't got time no more\nGod is not God no more\nHe is just a job homeboy, oh boy\nWhere did we get off and where did it all go wrong?\n(all go wrong)\nWe stop talkin' Jesus as soon as the mic is off\nI had a dream last night, this is what I saw (yeah)\nYou can build a Christian empire without God\nLivin' for the bus, yeah, yeah (yeah)\nBreakin' out the cups, yeah, yeah\nHennessy by the tub, yeah, yeah\nLoosen up, yeah, we ain't in the field no more\nJust the dugout now\nHow you living?\nDid you turn God to your little business?\nWho cares? I'm winnin'\nAnd now I gotta go on\n\n[Vamp]\nHow y'all feelin' tonight?\nMake some noise for Jesus, yeah\n\n[Verse 2]\nYou are getting worse homeboy\nYou are getting worse homeboy\nPlay the church, take the birds home\nNever hear you talk about the word no more\nExcept when you tryna defend your dirt homeboy\nMy God\nYou done let your eyes go\nStarted fornicatin' with your iPhone\nShe keep her body too tone, then vitilago\nSend emoji eyes those\nSaid that you would never bite though\n(Too smart for that)\n'Til she showed up at the show in the front row, row\nProbably would've panicked\nBut you gone off that zoloft\nWearing the same outfit that you left that comment on\nSayin' one thing to the crowd\nBut in your mind takin' her clothes off\nWent down in the DM (told her)\nPushed the flight back\nKnock on room 103 and\nCame around, 1:03 a.m\nWait, uh-oh, hold up, she in, wait\nWait, where your wedding ring at?\nWait, can you keep a secret?\nCan't believe it, my God\nYeah, how are we here?\nCrucified Christ again that's that double treein' at the Double Tree\nHow many ended like me here?\nOh, not one did\nYou were dead before you checked in\nYou've been driftin'\nNobody wakes up addicted\nEvery great fall's from 100 bad decisions\nWhole legacy passed, you just no-looked it\nLost in the sauce, didn't know you're slow cookin'\nRemember when you didn't wanna be alone?\nAll you talk is numbers\nTook the filters off your phone\nWhen you stopped callin' on your pastor when you got home\nSpendin' more time with Instagram than the Son of God, oh God\nMiles from the shore now\nWifey left with both of the boys now\nDaddy, daddy, daddy why you let it go down?\nWas mommy not enough for you to hold out?\nTell me where we gonna go now\nI don't wanna be here\nI was just a man last weekend\nCan I be a king after Bathsheba?\nBut David never danced again\nHe limped all the way to [the end]\nIt's over, it's over, it's over, it's over, it's over"}], "artist": "KB"}