{"artist": "Andy Mineo", "songs": [{"title": "Listen", "album": "Formerly Known", "year": "2011-09-29", "image": "https://images.genius.com/b69d4d087350fcc7c60238bac49a2151.1000x1000x1.jpg", "lyrics": "[Verse 1]\nBeautiful condescention, my Savior from the heavens\nLaid his head among men, redeem humanity was the intention\nSome think he only gave a moral lesson\nWell if you believe that\nYou missing the point like run-on sentences, ah\nAfter I die be rerssurected\nMy family will be chilling in the sky like the Jetsons\nSo I bow my head for the meal, thank God for His provision\nReminded this ain't the only bread that I need for living, boy\nThat sin you living isn't freedom, that's prison\nTrapped by your own conviction reminded the closck's ticking, uh\nThrough many years of rebelling, heart's growing cold as a blizzard\nOnly the Gospel can melt 'em\nSo many rappers be using His name in vain\nTalkin' how you keep it real\nYou kidding, what you mean?\nYou talking how you flipping money, plus you getting green\nWhen you laid up in that pine box, time stops it seems\nYou wanna live fast, die young\nYou dummy live wise, die ready whenever the moment comes\nThe power of life or death reside in the tongue\nSo we usin' every breathe to lift up the name of the Son, ah\n\n[Chorus]\nI came to lift 'em all high\nAnd can't nobody tell me different\nAnd if faith coming through hearing\nWell, I hope all of y'all listen up\n\nI came to lift 'em all high\nAnd can't nobody tell me different\nAnd if faith coming through hearing\nWell, I hope all of y'all listen up\n\n[Verse 2]\nI'm going back in, this is round number two\nFound in the truth\nDrinking living water like the fountain of youth, woo!\nForever young I live eternal\nPeople are gon' burn you\nWhen they do, tell me who you turn to\nLiving horizontal, look vertical\nMen hold on, eyes forward, stand tall, no urinal\nMan is a servant who, die to himself\nPut his pride in a funeral\nBury me with no tombstone\nI speak the truth, but y'all don't wanna listen\nThere's souls to be won so I say let's go get 'em\nThey talking 'bout cards when I say I go fishing\nI still hate religion, why you think I'm a Christian?\nThey wanna know the difference\nThe piece between God's been broke from our sinning\nReligion is man using his good deeds, trying to close the distance\nBut we can never reach Him\nOnly Jesus came to get us, man\n\n[Chorus]\nI came to lift 'em all high\nAnd can't nobody tell me different\nAnd if faith coming through hearing\nWell, I hope all of y'all listen up\n\n[Outro]\nAyo, yeah\nSkrip"}]}