{"songs": [{"lyrics": "[Intro: Jay-Z]\nHa ha, ha ha, Roc-A-Fella y'all\nFuturistic shit, bee-atch\nUh, what the fuck? How we do, how we do\nUh huh, uh huh\n\n[Verse 1: Jay-Z]\nIt's the eventual triple platinum nigga with the solid gold fade\nAll that nickle and dime shit, don't hold no weight\nFortune 5, top 5 in the Forbes (you'll see)\nAs you thumb through The Source, I read the Robb Report\nClass C, cold me down with the plastic\nThat's all I ask of you, like Raphael Saadiq\nAt the Hotel Nikko, Robert Duvall suite\nMy people's eyes through the peep hole\nI'm loving you down freak, as I\nShoot through the city like a rumor\nNot soon enough, to stop 'em from spreading\nThe newspaper heading read \"Jay-Z breathes, 80 degrees\nOnly thing to cool him off is a Malibu Bay Breeze\"\nCan't stop for the Feds, say cheese\nYou know they wanna take a nigga picture\nPray for the day to get ya, but I'ma parlay, stay richer for now\nJigga hasn't done dirt in a while\nYou know my stomach's getting weak from living on the streets\nFor real, I'm trying to oversee it from suites, ordering eats\nAt the top where the real criminal minds meet\nThat's where the cream is (right?!)\nThat's where your dream is (well ain't it?)\n\n[Chorus: Jay-Z, LL Cool J & Mary J. Blige]\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night\n(All night long)\nBeeotch, Roc-A-Fella y'all, ha ha\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night\n(All night long)\nRoc-A-Fella...\n\n[Verse 2: Jay-Z & Irv Gotti]\nYeah, ayo my youth had a nigga too aggressive, ha\nI used to speed excessive, both eyes closed\nNo thought infested\nHitting pot holes, cop-o's'll snatch your away\nWhat you deem most precious\nHad to rethink things, is pinky rings worth\nLife on the run and time served in Sing Sing?\nI don't know to tell the truth, if I'm pressed for dough\nGotta consult Irv Gotti y'all, heads got to roll\nI was raised to live, Lord I pray you forgive\nIf not, I just handle it like Jason Kidd\nWhat you're facing is official (it's official)\nIn most cases when I'm blazing won't miss you (won't miss you)\nCase and point made bullshit a issue, I see it to the end\nMy writing so personal, my heart bleeding through the pen\nMake no mistake about me\nIt's only one nigga living, I got half a cake about me\nI got love, I can kill a friend over fam not drugs\nAnd very, few people understand that love\nTo make a nigga die bleeding is nothing (nothing)\nYou make a motherfucker die breathing\nThen you saying something, beeotch\n\n[Chorus: Jay-Z, LL Cool J & Mary J. Blige]\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night, Roc-A-Fella y'all, ha ha\n(All night long)\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night, Roc-A-Fella\n(All night long)\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night\n(All night long)\n\n[Verse 3: Jay-Z]\nRoc-A-Fella...\nMore flavor than y'all can image having\nGraphic like Sega Saturn, traffic like the Bodega\nIt just so happens, you caught me at the the tail end of my dirt\nBrain ain't right from inhaling the work all my life\nFuck it, greasy I, had the whole D.C. high\nPissy off Cristal, 3G high\nSeasoned Bacardi, VVS's\nBlesses my body, we be fresh at the party\nPlay yourself go 'head if you don't know the ledge\nIt's like spitting to God\nGet it in your face fucking with niggas over your head\nTake your time with me, shifty\nUsed to make coke stretch like a sample in a 950\nShit with that, while I'm on a Kawasaki bike\nAt the light, doing a pike, with a bitch on the back\nAnd take flight, my life like it was directed by Hype\nIn 35 slow-mo, with the Roc-A-Fella logo\nAccapoco to Aruba, Bay Breezes and caviar beluga\nVery little loot eludes us\nIn the grayish blueish L-e-x coupe\nIt's the root of evil in these people, what the fuck?\n\n[Chorus: Jay-Z, LL Cool J & Mary J. Blige]\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night\nRoc-A-Fella, uh huh, uh huh, beeotch\n(All night long)\nYou're only a customer (uh)\nWalkin' in the presence of hustlers\nWe spend money all night\n(All night long)\n\n[Outro: Jay-Z]\nRoc-A-Fella, uh huh, uh huh\nFuturistic shit", "title": "Only a Customer", "image": "https://images.genius.com/eded58866a571e2423e592111a40b7c9.688x700x1.jpg", "year": "1998-05-12", "album": "Streets is Watching Soundtrack"}], "artist": "JAY-Z"}