{"artist": "King Los", "songs": [{"image": "https://images.genius.com/916a912809348b0dcc67ff098d44c1fa.500x500x1.jpg", "title": "Bumpin’ My Music", "year": null, "album": "Welcome To Swaggsville", "lyrics": "Okay we know your a hater, you dont still have to grill\nCuz I peel back my top & my grill match my wheels\n& my wheels match my watch, this how real swagger feel\nYou ain't ill, stackin bills, talking about you movin' bricks\n& you still cappin' pills, motherfucker get a grip\nCause we will grab the wheel, we some riders motherfucker\n& Welcome To Swaggaville, Ain't a hotter motherfucker\nCall my nigga Dre & tell him come and holla motherfucker\nYeah I got it motherfucker, check my technique out\nYou can get hit with this Tech, it ain't that technical\n& you wonder why these mothafuckas sweat me now?\nGod told me I was fly & never let me down\nIn that candy apple Chevy, Laker court yellow Guts\nI'm special. I should ride a short yellow bus\nYou know the way I play\nI chop the top off that motherfucker, faster than Carmelo & A.I braids\nI'mma stay fly, paid cause I'm super extra groovy\n& I keep a model bitch that scoop & chill in that jacuzzi\nWhile I'm Bumpin' My Music. I meant that literal\nBumpin' My Music, These niggas pitiful\nIm critical, I better not hear a cricket or a cricket move\nI spit this sickest shit, way too ridiculous to ridicule\nGet a few sips of brew, slip into a chick or two\n& jump off of my dick and maybe you can get some figures too\nOn on yeah, I'm clinically insane\nI take this music & use it as my remedy for pain\nIf they want a lyrical war well then no enemies remain\nIt'll be result of a Volkswagen when it meet a train\nIf you tender leave the game, we goin Hard in The Paint\nStop making being a little bitch your job if it ain't\nCause when my squad in the tank\nYou gon be playing dead like Mr. Potato Head with all these arms in your face\nEwwww, ain't nobody better than me & thats realll\n& that ain't even me being cocky either nigga, thats skilll\nI met your bitch at Vicky's Secret\n& she said if I can keep a secret maybe we can chillll\nI said, oh baby thats the deal just make ur Vicky's match your heels & Welcome To Swaggaville\nHaha..You already know what it is...We goin in mayne.."}]}