{"artist": "Plies", "songs": [{"album": "On Trial 2", "title": "Big Faces", "image": "https://images.genius.com/459236c40073c607bb17232be15e0db1.640x640x1.jpg", "lyrics": "[Intro: Plies]\nYou know I just got pulled over right?\nPolice asked me to step out the car, so I stepped out on his fuck ass\nHe asked me, \"Sir is there anything in your pocket that I need to know about?\"\nI told him \"Yup, Big Faces\"\n\n[Verse 1: Plies]\nJust dropped $7500 on my inside\nAnother 4 grand nigga for the suicides\nAin't buyin' the bitches if they ain't low profile\nTold my lawyer go and motion for a speedy trial\nRight now I'm [?] nigga bitch out\nI ain't never bought a watch nigga for 50 thousand\nLast one I bought was 100 thousand\nHow many hoes i dun' fucked?, i dun' lost count\n\n[Hook: Plies]\nBig Faces, Big Faces, thats all I spend Big Faces\nBig Faces, Big Faces, want me to count it up for ya'? Big Faces\nBig Faces, Big Faces, nigga my whole team got em' Big Faces\nBig Faces, Big Faces, thats all I spend Big Faces\n\n[Verse 2: Plies]\nAt any given time 100 grand on me\nAt the same time got the Smith & Wesson on me\nFor the big rims to fit I cut the frame on it\nSaid it's mine so I told her tat my name on it\nNeed a ghost? rent mine for your video\nAll my diamonds they glass see straight through\nHundred bottles I ain't got that many friends fool\nMy lil' broad I just went and bought a shih tzu\nOnly time she don't see me is when the rent due\nI'm in the projects posted up eating soul food\nJust dropped hot sauce on my retroes\nWhere the weedman who got it in a chokehold?\nI'm in the room counting money so the door closed\nAin't nothing changed I still smoke [?]\nCrushed ice help keep the kool-aid cold\n[?]\n\n[Hook]\n\n[Verse 3: Xtra]\nGot the blunt fired up cuzz the jigga got me chewin'\nGot it on tuck you could tell how my shirt movin'\nNiggas in they feelings you can tell when they losin'\nEastSide where I'm at and hell naw' I ain't movin'\nCount it by the 100 trying to fuck her while she running\nFucking it for free every monday through sunday\nKepp countin' bitch thats more than a few hundreds\nKeep countin', keep countin', bitch keep countin'\nNiggas follow my lead and get re-routed\nEvery nigga that be with me he be bout it\nGet ya eyes stuck cold trying to see bout it\nPinky wrist on ice big boy pockets\nGot a nigga who just itching to get a body\nAnd he told me just point em' out anybody\nYou pussies don't want problems you just wanna hate me\nBig blunt, Big cup counting big faces\n\n[Hook]\n\nBig Faces [15x]", "year": "2012-11-08"}]}