{"artist": "Inspectah Deck", "songs": [{"title": "Rec Room (Patriot Act remix)", "lyrics": "(Inspectah Deck)\nOh, Killah Hill, Killah Killa Hill\nKillah Hill, Killah Killah Hill\nKillah Hill, Killah Killah Hill\n10304 style, kid, yea\nFor all my D.M.D. Rec posse niggas\nYou out there? Is you out there?\n\nI throw your brain in the cobra clutch, behold the hold rush\nA dazzlin display if you could get close enough\nCold Crush like the 4 stinger anaconda\nFierce darts that'll pierce through solid armor\nLounge in the barracks with Blue and Cappadonna\nSpiderman identity Peter Parker\nCrowd pleaser register off the meter\nVocal street sweeper bucks shots through the speaker\nPleasure seekers, 50 thou' in the stands\nTrue fans get it hot like Jamaica sands\nConquer land, wide like a eagle wingspan\nClansman stabbin the track with both hands\nNot a lost soul who falls for fool's gold\nI shine like a diamond in the true state of coal\nToo hot to handle, too cold to hold\nRap with a road block, I might lose control\nHold the globe in my iron palm\nOne hand holds the firearm on a mission that's life long\nStrike calm through the fire like Chaka Khan\nWorld wide on the web without the dot com\n\n(Chorus)\nKilla Bees live in the place be\nBurn third degree on the M-I-C\nSo deadly cause a catastrophe\nAnd this is the way we crash the party\nSay\nRec, Rec, Rec, Rec, Rec, Rec, Rec, Rec\nRec, Rec, Rec, Rec, Rec, Rec, Rec, Rec\n\n(Inspectah Deck)\nYo, Killa Bees swarmin\nProtect Ya Neck! What's the warnin?\nSo, proceed with caution, I walk with my swordsmen\nWe all in together, Wu-Tang forever gon' win\nFrom Puerto Rico 'cross the caves of Berlin\nEchoin through cell blocks and federal pens\nIt be the Wu-Tang, you came in when\nThey left the game mentally and physically bent\nWhat I invent, sharp as bardwire fence\nI represent, sure to make a grand entrance\nWith the deadly lecture, contents under pressure\nInspectah, put your rep in the stretcher\nFeather weight contenders surrender\nT.K.O., first round knockout, vex the big spenders\nJourney on the mic like Marco Polo\nInternal bleedin occurs to your photo\nThoughts brought forth as wild as up north\nIt's bloodsport, get rushed for tough talk\nBut I hold my ground like it's high noon\nWhile police tapes surround the mic room\nI jump on a live tune, provide the boom\nThose who consume become faint from the fumes\n\n(Chorus)", "image": "https://images.genius.com/ec81fe76ab1184b20e5472621f8a9698.497x394x1.jpg", "album": null, "year": null}]}