{"songs": [{"year": "2009-02-24", "album": "Troubadour", "image": "https://images.genius.com/2d335571e608b43f30bd8a89e1fa6d38.1000x1000x1.jpg", "title": "Dreamer", "lyrics": "[Intro:]\nUh, yeah\nBelieve it or not\nWhat kept me alive\nIs my Dreams\n\n[Hook: x2]\nI'm a dreamer, but I ain't the only one\nGot problems but we love to have fun\nThis is our world, from here to your hood\nWe alive man, it's okay to feel good!\n\n\n[Verse 1: K'naan]\nI got a friend named Flow\nWho got a friend named Blow\nWith a finger named Clap\nThat'll leave you on the side like a Kangol hat\nHe ain't have no choice he was born this way\nThese streets pull your number like a phone display\nAnd you gotta be defensive with your life\nYou gotta be like Bush and take pre-emptive strikes\nAnd \"The boys from the hood are always hard\"\nLet alone in Mogadishu it's a mastered art\nIf you bring the world hoods to a seminar\nWe from the only place worse than Kandahar\nMan that's kinda hard\nBut we still like to party and Hardy-hard\nSomething good happens we say \"Mashallah\"\nSomething bad happens, \"Que sera, sera\"\nI close my eyes and all I can see, is you dancing with me\n\n[Hook x2]\n\n[Verse 2: K'naan]\nIt's okay to feel good\nIt's the truth!\nAyyo, and check it out\n\nWhat would it take for a boy about my age\nTo hear cheers in his head upon that stage?\nAnd the cheers they would drown out the tears from my brown eyes\nC'mon backstage\nYou see the screams ain't the screams from gunshot screams\nIn my dreams these screams are from hot teens\nAnd I'm barely thirteen and pack a dirty\nOl' Russian firearm that shoots thirty\nJust then I hear the bus engine\nI'm transcendin'\nI'm crowd surfin'\nI can't see the time burnin'\nI'm not hurtin'\nWith my mahogany pen\n\"I'm on a world Tour, with Muhammed and them!\"\nAnd we be overseas, and not in these streets\nWhere my peeps stay alive, like the Beegees\nAnd the likes of Jay-Z would say my steez\nSay he handily brought, hip hop peace\n\n[Hook x2]\n\nSometimes we just like to have fun, man we like to forget\nAll the fighting, all the guns and the tires burnin\n\n[Verse 3: K'naan]\nBack on the verse\nImagine crack wasn't birthed\nImagine that Earth wasn't hurt\nImagine no Homeland alerts\nImagine no record locator\nSo I wouldn't have to get a criminal waiver\nImagine the piece wasn't in my briefs\nInstead peace could stretch across the seas\nSo finally we could we could just rest in the East\nNo Refugees\nAnd you, well you could dress in a book\nAnd I could read your body with less than a look\nI got a dream girl in my mind, that's the hook\nAn intellectual, sexual and still can cook\n\nAnd I feel good right now...I feel good right here\nYou feel good right now? You feel good??\n\n[Hook 2x]\n\n[K'Naan speaking to end]\nWe not down and out...just because the times are hard\nUh-uh...uh-uh...yeah...shout out to the strugglers\nIn my country...the hardest place on Earth right now\nBut still...I still know how to get down\nI still know how to vibe out\nStill know how to talk to a pretty girl\nTake it easy now...YEAH"}], "artist": "K’naan"}