{"artist": "Cage", "songs": [{"title": "The Weather Report", "album": "Suicidal Failure 12\" Vinyl", "year": "2000-08-12", "image": "https://images.genius.com/bf0199fece3e3d07e3769b40779d8d02.300x300x1.jpg", "lyrics": "\"The most dominant\" [Copywrite]\n\"Copywrite\" [Copywrite]\n\"78 degrees\" [Copywrite]\n\"Alex with a little message\" [Cage]\n\"The most dominant\"\n\"Copywrite MC\" [Copywrite]\n\"Alex with the fuckin loaded thirty-oh-two\" [Cage]\n\n[Verrse 1: Cage]\nNod your head till I bend you with a ?pitch or pucket?\nLike your orratories a corporate gorey suffice\nYou ain't nice, you like fake dice\nCaught by work release\nIce grillin villians, billing to make a killing\nPeeling metal fillings like a jux from God\nSpilling your stomach lining for just a fistful of ?kine?\nAnd I climbed in your head, kicked around your mind\nAnd said \"By far, these are the weakest designed lens, infrared!\"\nLazers who take them all for you\nLike new Danzig, big titty mami porn yo, that's loyal\nBook with the brown pages pickin em up\nTill my fans prepare your girls for the trachea fuck\n\n[Verse 2: Copywrite]\nYo, whether wearin raincoats or plain clothes\nYou can brainstorm all day and Weathermen remain bone\nDry, I'll quiz you to see where your mind's at\nWhatever the IQ, I'll multiply myself twelve times that\nYou're assumin I'm human, that's your first mistake\nWhen verbs could make the earth's crust burst and perforate\nSo just imagine if all seven bust\nIt'll cause Satan's soul to shake the golden gates of Heaven rust\nAnd that talk wasn't brought to start a trend\nI was seeing if my thoughts could split the sea apart again\nFrom now, to the here-after\nMy lungs lung punch to crush queer rappers that fear laughter\n\n[Hook]\n\"The most dominant\"\n\"Copywrite\" \"78 Degrees\"\n\"Alex with a fuckin loaded thirty-oh-two\"\n\n[Verse 3: Copywrite]\nOnce the phlegm is launched\nYour fam's attention's lost\nAnd they focus on every song I'm ever mentioned on\nThere ain't a man on this fuckin planet Earth I fear\nBrainstorming till my ears, nose, and mouth squirt ideas\nThe best man, prove it in front of you, your fans booing\nThis is the fifth time we battle, what are you, DEAF AND STUPID?\nIt's confusing to those spittin bad quotes\nI was givin life in a test tube by scientists in labcoats\nGot speed in sesssion, you call that a verse?\nI thought that was your Gilbert Godfried impression\nForfeit or I'll be faced to escort shit\nTo mush your face in a pile of horse shit\nI torture kids, the contortionist, bless the less fortunate\nHouse so many crabs, they mistake my rest for an orphanage\nTo pull a burner on us two is useless\nI'll hold your arms while Cage stabs you with a mouthful of toothpicks\n\n[Hook]\n\"The most dominant\" [Copywrite]\n\"Copywrite\" [Copywrite]\n\"78 degrees\" [Copywrite]\n\"Alex with a little message\" [Cage]\n\"The most dominant\"\n\"Copywrite MC\" [Copywrite]\n\"Alex with the fuckin loaded thirty-oh-two\" [Cage]\n\n[Verse 4: Cage]\nYou think shit's sweet with your tastebuds ripped out?\nThrown in a jar or jelly (Yo Cage that's tripped out)\nPeddle through medical bars, they couldn't chart me\nTill I file my fingertips down to red Sharpies\nMan give me the cars keys, play the three like Dan Majerle\nWatch me crash the shit then go sniff coke with Chris Farley\nWhen I return, put fire to frozen land\nAin't got no holes in my hands, I put holes in my fans\nSo I can see what they feelin while Copy de-limb em\nCollect em in glass case like bugs with pins in em\nThink that's vain, I paint self portraits in my own blood\nI went platinum but they don't give out plaques for thugs\nTry these ucks sprinkled with elephant tooths\nRelevant proof, you ain't kickin shit in elegant boots\nTell the truth when I show pity\nRunnin through Central Park with a watergun and my friends wettin titties\n(Copywrite 78, Alex the Worm King, Eastern Conference)\n\n[Hook]\n\"The most dominant\" [Copywrite]\n\"Copywrite\" [Copywrite]\n\"78 degrees\" [Copywrite]\n\"Alex with a little message\" [Cage]\n\"The most dominant\"\n\"Copywrite MC\" [Copywrite]\n\"Alex with the fuckin loaded thirty-oh-two\" [Cage]"}]}