{"artist": "A$AP Rocky", "songs": [{"title": "A$AP Worldwide Cypher", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg", "album": null, "lyrics": "[Intro: ASAP Rocky]\nYo, ASAP here\nWe 'bout to kill a fucking game\nYou know who the fuck we are\nYou know my motherfucking name\nI fucked your dame\nAnd she bought me a chain\nAnd a range\nAnd a pinky ring, bling, bling\nAnd all my niggas here, they about to kill this shit\nWhat you say Nast?\n\n[Verse 1: ASAP Nast]\nHold up dog, Nast in this bitch again\nSipping Hen, staring at that white girl from Michigan\nShe was with a friend, fat ass fly ho\nI went in for the kill, ASAP, pronto\nSo wait boo, 'fore we hit your condo\nGot another friend with me named Whitney from Chicago\nWhitney love ta model? I'm thinkin' ménage\nThe truck parked out from, the Chevy get Ta-hoes\nHaters all in my face, can't see, blindfold\n? on my feet, blew right by folks\nStuntin' on sucker niggas is what I was designed for\nDead fresh, fresh to death, I should have designed clothes\nBut I'm blessing these tracks, sick flow, swine flu\nY'all ain't fucking with Nast, I been nice, y'all knew\nHaha, nigga that shit times two\nI'm who your bitches wanna kick it with, kung-fu\nBut what, dog? What is you saying?\nNast in this bitch, ho, why is you playing?\nLike I won't slay this stage on some gang shit?\nTurn into a mayhem, beat hard, flow hurtin\nCali swag bitch, snapback, no jerkin'\nFuck work, fuck money in hands, hoes know this\nFast forward, past focus, I'm that on it\nOne of the best to do, I think not, you bet on it\nGiant ass you be lumberjack Paul Bunyon\nHoes love it, lover never put none above it\nWanna hug me tighter than jeans ass sportin'\nCarry corpses to cemeteries, that's very often\nSport fortune, Matchboxes, that awesome\n\n[Verse 2: SPACEGHOSTPURRP]\nSo what I say, motherfucker\nAlready know I never been a sucker\nSee I lust ya, I want ya\nBaby come home, babygirl, what's your name, Wanda?\nDo you wanna get up on me?\nDo you wanna bend over?\nDo you feel horny?\nDo you wanna feel the stroke?\nIt's kind of like Facebook when you feel a poke\nASAP, no joke\nRaider Klan, all back and we aiming at your throat\n\n[Verse 3: ASAP Rocky]\nI wanna rock but the bitches want me, though\nD&G briefs fit a nigga like a Speedo\nSkinny nudie jeans, though\nBoots be 40 below\nHe flow, 100 degrees, the jewels zero\nRockstar rap, he reps Guitar Hero\nLeopard Louboutins like Speedo on Steve-O\nCharge me on the game, couldn't pause me on Tivo\nBeyonce, the Kanye, I got a big ego\nOn to that next shit, you looking at the bestest\nMarried to the game, treat you niggas like my stepkids\nPull up in a Porsche, niggas get nausea\nDidn't write the rules but my status like the author\nJust crashed the range, so I pulled the Bent out\nProbably getting brains, chilling in the penthouse\nSwagging on you maggot and I'm about to lay the pimp down\nChristian Louboutin red bottoms come in mens now\nOn to the next ones, skinny jeans fit in\nPull up to the shows and these hoes know to get in\nSaid they like my fitted clothes down to my split ends\nLittle do she know, I got a big ego\nAutomatic weapon need an order of protection\nKillin Feelin all these records so my charges is molesting\nAssault with deadly weapons, got these rappers feeling threatened\nA hip-hop veteran, I'm a hip-hop felon\n\n[Verse 4: ASAP Twelvy]\nIt's a war going on outside and we started it\nBelieve that or die, nigga, on some martyr shit\nAll my niggas on the scene like some Sparta shit\nAnd we came to double up on that Harlem shit\nWe all eating, this is how it's supposed to go\nStop speaking, this is how you supposed to flow\nThe ins and out, never a winner's route\nI never lose again, it's like every day I lose a friend\nTo some dumb shit, whore and dumb bitch\nSo a hating nigga, whore cuff wrists\nI know a lot of niggas sitting in a cell now\nFor the shit I've done, I'm probably even hell-bound\nBut it's cool with me, jacking niggas' jewelry\nI don't give a fuck about your foolery\nNigga keep a tool with me just to blast at you bitches\nMarvelous at the top and our rags to the riches\nASAP, nigga\n\n[Verse 5: ASAP Ferg]\nOn my Pokemon shit, you already know...\nI said, I said, I said\nI swear to God I want it all\nHe gon' give it to me back\nAnd get on top above it all\nPurple label sweats, I swear to god I'm rich\nAnd once I get these many bitches, swear to God I'm in\nI be on my fucking shit, toast to the Gods, tell me what God sipping now\nHenny, and I'm out here and my dad was in bed\nSo I down a whole bottle on that bitch with the mink\nI go haaaaaaaard\nI'm sorry, Mama Ferg, for all of these curse words\nBut I'm so fucking serious\nShit I'm street, like a curb\nAnd I'm tweaked, like a nerve\nAnd I'm smart, like a nerd\nGuess that's why my last name Ferg\nOkay I'm glidin' like a fucking bird\nYeah my name is Ferg but I'm a fucking turd, ya heard?\nNow I'm on some rider shit\nYou done got yourself in beef\nNow you on some Gaga shit\nRed line on some Prada shit\nNow you want to know the deadline on some Project shit\nBlack bitch an actor, put em in some Tyler shit\nPu-ray you buried then hair dyed like that Robyn bitch\nThis ain't no bullshit, I ain't letting no fools in\nSee my bitch ride that big thing, you on that little shit\nTrying to make noise, you squeaking like a little pit\nPut her into that dog, my attitude's a little Vick\n\n[Verse 6: ASAP Rocky]\nNext time my niggas fall back\nASAP Raider Clan and we all blacked out\nTell that bitch get it mapped out\nAnd I fucked a bitch, now she flat out\nChest out, on the fucking floor, never hit it raw\nGot a condom and I got a towel by the door\nJust in case the smoke go into the hallways\nCause I be smoking weed and fucking all day\nThis is off the top of the dome, let me introduce my niggas before a nigga go home\nWe got Ty Beats, the illest producer in the streets\nYou know he come through with that motherfucking heat\nGot Twelvy, motherfucking Twelvy, got a bad bitch, Jewish named Shelby\nGot my nigga Nast in the back\nGot a snapback to the back, he don't even know how to act\nGot my nigga named Purrp, Spaceghostpurrp, do your bitch real dirt\nThat's dirty, little flirty, fucked a bitch named Purdy, did her dirty\nGot my nigga named Ferg, what's the word\nAnd you know he fucking know these verbs, give them to the curb\nGot nerve in the bitch, got served, better get mine nigga, bitches got nerve\nWait your turn\n[Peace out, or kiss my ass!\n\n[ASAP Ferg]\nYeah, kiss my ass too!]\n\n[ASAP Nast]\nSuck a nigga dick or somethin'!", "year": "2012-01-15"}]}