{"artist": "E-40", "songs": [{"title": "1 Question", "image": "https://images.genius.com/69888735950c51a30bd2a1f03289f53d.1000x1000x1.jpg", "album": "Practice Makes Paper", "year": "2019-07-26", "lyrics": "[Intro: Jeremih]\nHitmaka\nFaded, got me callin' you all through the night, oh no\nOoh, so baby, let's get fucked up, cut your phone off\nI swear I'll do you right\nPut it on me, baby, oh\n\n[Chorus: Jeremih]\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\n\n[Verse 1: E-40]\nUh, where you been all my life?\nI've been watchin' and lookin' at all your mentions\nI've been searchin' for you like a search engine\nIt really don't make no sense how bad you are\nWhen God created you, He made a star\nLet's put it together like the weather, make it last forever\nHave you sweatin' under the sheets, you know I get you wetter\nWe could hit the matinee then go to lunch at Nobu\nBut you on your vegetarian so I order tofu\nIt's mackin' on mine so you know that I had to pop my P's\nI'm from the game, I'm wavy like the Seven Seas\nI could do it nice and slow or I could pick up speed\nWhen I leave, your pillow gon' smell like some Creed\nYou a Chanel wearin', Birkin bag carryin', drop McLaren steerin'\nWifey material, the type of woman I wanna be marryin'\nGot an amazing Louboutin and purse collection\nI gotta pull you aside and ask you one question, uh\n\n[Chorus: Jeremih]\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\n\n[Verse 2: Rick Ross]\nIt's the biggest (Maybach Music)\nI'm on the books and turnin' pages with a centerfold\nTouchin' paper, dirty money in the envelope\nCuban links but always ended up in Mexico\nA fetish for Ferraris, selfies at the Texaco\nSee me winnin' now it got me trendin' on the block\nSee who winnin' so they know she not another thot\nHer ponytail blow in the wind when we in a drop\nWe independent so it's like we sold another block\nBoss\n\n[Interlude: Rick Ross]\n40 Water, you the pinnacle, man (Huh)\nDown South, smokin' good (M-M)\nHuh (Maybach Music)\n\n[Chorus: Jeremih]\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\n\n[Verse 3: Chris Brown]\nKnow that people be listenin' so I won't be loud\nWon't make a scene, I'll take you through the cloud\nYou want fun, girl, you know I got it\nJust stay up, hah, 'cause we gon' do this all night\nWhen we make love (Yeah yeah, babe, ooh)\n\n[Pre-Chorus: Chris Brown & Jeremih]\nFaded (Faded), got me (Got me)\nCallin' (Callin') you all through the night, oh no (Oh no)\nOoh, so baby, let's get fucked up, cut your phone off (Off)\nSwear I'll do you right\nPut it on me, baby, oh\n\n[Chorus: Jeremih]\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now\nOh-oh-oh-oh, oh-oh-oh\nOne question, girl, are you mine now?\nMine now, mine now"}]}