{"songs": [{"image": "https://images.genius.com/d878e54b6766255010da413481db1471.1000x990x1.jpg", "title": "Showing Out", "album": "Til the Casket Drops", "year": "2009-12-08", "lyrics": "[Verse 1: Pusha T]\nYuugh, ho I'm major, that shit nothing\nYoung nigga, old money, Benjamin Button\nSeeing through your poker face, that nigga bluffing\nLadies going gaga for a nigga trying to fuck em'\nNickel plate tuck it, hesitate nothing\nAnd I got the AR, why I like to bust it?\nWhy I need counseling? Why I won't discuss it?\nWhy I spend Donkey Kong knots in the mall like fuck it?\nPull up at the stop light, looking at this cop like\nYeah I drive big shit, naw my license ain't right\nStill let the top drop back when it's sunny\nCause life ain't nothing but bitches and money\n\n[Hook: Pharrell]\nI don't know what is, it's something inside\nI need that attention I just can't hide\nKeep hearing these voices inside my mind\nSaying fuck the rest, it's time to shine\nI know that's how, the good ones died\nBut I need that risk, I need that drive\nI'm stealing your bitch, I'm stealing your grind\nBitches sing this, and that's why I'm\nShowin' out lil' mama, showin' out lil' daddy\nShowin' out lil' mama, showin' out lil' daddy\nShowin' out lil' mama, showin' out lil' daddy\nShowin' out lil' mama, showin' out lil' daddy\n\n[Verse 2: Yo Gotti]\nOld school Chevy wide body like a phantom\n5 stars love but them haters can't stand em\nUK money 150 thousand pounds\nAll-white Lamb sitting low to the ground\nI just joined the game, the millionaire boys club\nGave me box of baking soda and skate board\nI'm in the kitchen putting the work on steroids\nPeeking out the blinds for the feds, I'm paranoid\nNaw I ain't platinum, but how I'm a millionaire?\nI know this a four door, so how it ain't no ceiling there?\nShowing off little mama, going hard little daddy\nYo Gotti homeboy, and I'm a walking dope package\n\n[Hook]\n\n[Verse 3: Malice]\nI'm from the era of letter to the better\nThey tell me rap change, well I'mma have to let her\nCommon loved her, I wish I never met her\nThey slutted her out, there's nothing left to treasure\nSeems all I hear em say, \"nigga where them dollars at?\"\nHere they go right here, tell them niggas holla back\nHit it then I quit it, then I step like a welcome mat\nThat 2010 got me feeling like I'm all of that\nRe-Up Gang trinity, Liva, me and Pusha T\nGot my money right, them haters tight like virginity\nThey don't understand how I feed off that energy\nMy table is prepared in the presence of my enemies\n\n[Hook]"}], "artist": "Clipse"}