{"artist": "Webbie", "songs": [{"year": "2014-11-24", "lyrics": "(Intro)\nIt ain't nothin' like a big fine bitch, straight up\nTrill Fam\n\n(Pre-Hook)\nTonight I'm lookin' for a ratchet\nGive me a gutter or a freak ho\nAnd she ain't gotta be a bad bitch\nBut she just gotta suck dick though\n\n(Hook)\nWhere she at?\nGirl i'm lookin' for a fuck friend\nTonight i'm lookin' for a fuck friend\nGirl i'm just lookin' for a fuck friend\nI'm just lookin' for a fuck friend\nWhere she at?\nGirl i'm lookin' for a fuck friend\nTonight i'm lookin' for a fuck friend\nGirl i'm lookin' for a fuck friend\nI'm just lookin' for a fuck friend\nWhere she at?\n\n(verse 1: Webbie)\nShe ain't gotta have a house and a benz truck\nShe just gotta lick nuts, and love or get my dick sucked\nAnd she ain't even gotta have a big butt\nBut i got a big dick, so I wish ya good luck\nShe don't need no fake hair, (?)\nI'ma keep it GC, i'm just trynna skeet skeet\nYe its baby get ya ready, young sweet sweet\nBust it open for me gon let me go deep sea\nWe don't ever make love I just fuck her hard\nI let her keep her old man in that other bar\nAnd i swear to god, you can ask her she a tell ya\nI'm the best at throwing dick, it ain't nobody better for her\n\n(Pre-Hook)\n\n(Hook)\nWhere she at?\nGirl i'm lookin' for a fuck friend\nTonight i'm lookin' for a fuck friend\nGirl i'm just lookin' for a fuck friend\nI'm just lookin' for a fuck friend\nWhere she at?\nGirl i'm lookin' for a fuck friend\n\n(Verse 2: Webbie)\nAss butt naked just say i'm zoned\nEr'ybody missin' calls, those camera phones\nBut they ain't trippin', they just drippin'\nThey'll be tippin, they'll be rippin'\nThey'll be switchin', when we finished\nWe get right back to the bidness\nAnd we winnin' check the scores\nStop that hatin' get ya ho\nDon't forget to hit the store\nCheck ya head that's a no\nSTD's i'm just trynna stay safe\nTell them cartoon niggas\nStay up in a safe place\nFell ya self, fell the bass\nKill yourself, sell ya grace\nShe give me what i want\nI give her more than she can take\nAnd they ain't gotta say no more\nCuz you can ask and she a tell ya\nWhen it come to throwing dick\nIt ain't nobody better mama\n\n(Pre-Hook)\n\n(Hook)\n\n(Verse 3: Foxx)\nI'm lookin' for a friend, with benefits\nBitch I ain't no gentleman\nSlim waist, cute face ass like cinnamon\nShe got a old man, but that pussy ain't his\nI'ma babysit that pussy, while he babysit them kids\nGot inches in ya ribs, baby take it (?)\nI ain't trippin' on ya stretch marks, cut the lights off\nGirl I'm lookin' for a ratchet, girl I been had you\nGon let me fuck you in the burger king bathroom\nAll that dick up in ya drawers, prolly reachin' for the breasts\nI'ma hit it from the back, Webbie you get in the front\nI ain't lookin' for no wife, just a fuck friend\nSay your bored, I got a idea, lets fuck then\n\n(Pre-Hook)\n\n(Hook)", "image": "https://images.genius.com/3248784c405eec23516cc5e01e37b413.1000x1000x1.jpg", "album": "Money Good", "title": "Fuck Friends"}]}