{"songs": [{"year": "2016-12-09", "image": "https://images.genius.com/595a5c53c72195068baa3a2331acf4ef.1000x1000x1.jpg", "title": "American Express", "album": "Imperator", "lyrics": "Yeah!\n\n[Part 1: Kollegah]\nBoss und Banger - wir sind back am Block und es fließt Blut in Deutschland\nStopfen wieder Groupiemäuler, boxen dich wie Yuri Boyka\nStürmen deine Wohnung, pimpern schnell deine Frau\nUnd ihr Hintern brennt dann wie Sau wie bei Kinderschändern im Bau\nIch bin kein Ninjakämpfer, doch schau, wie ich per Eisenklingen Katana spitze\nMeisterlich schwingend deinen geistig leicht behinderten Vater schlitze\nSchwuchtel! Du und deine weinerliche Versagerclique\nSeid die reinste Gayschar wie weiß geschminkte Japanerbitches\nMassagesitze im Audi TT\nYeah, der Boss erhält die Scheine wie'n UV-Licht-Gerät\nIch hab' unglaublich viel Geld - ey, du Clown bist nur fake\nBei Beef mit mir lässt du Federn wie'n Hydrauliksystem\nDu kriegst 'ne Faust in dein Face - guck, wie wir TEC-9s schwing'n\nUnd dir dicksuckenden Mistratte Respekt beibring'n\nEs sind die Westsidekings, du bist das Kind einer Bitch\nIch zeig’'dir, mit wem du's zu tun hast, wie ein Pimp seiner Bitch\n\n[Hook: Kollegah & Farid Bang]\nMeine Tracks war'n nie nur reine Fiktion\nSondern eine Vision, jetzt zähl' ich meine Million'n\nAlso Nutte, mach den Jet klar!\nZeig Respekt, ich bin Rapstar!\nMutterficker, meine Tracks war'n nie nur reine Fiktion\nSondern eine Vision, jetzt zähl' ich meine Million'n\nAlso Nutte, mach den Jet klar!\nIch kauf' dein Leben per American-Express-Card!\n\n[Part 2: Farid Bang]\nIch bin 'ne Leitfigur, deutsche Rapper biten nur\nKein Taxi, doch die meisten Blicke geh'n auf meine Uhr\nBin drauf und zerlege dich, brauch’ deine Knete nicht\nBei Drugdeals wie Babys: weder laufe noch rede ich\nWeil ich Bitches zur Abtreibung dränge\nVersucht mich die Justiz in den Knast einzusperren\nDie Punchlinelegenden vögeln Nutten auf Jacky-Coke\nUnd ficken die Kanaken, die im Hintergrund böse gucken in Rapvideos\n(Hurensöhne) Und ficken wir deine Mama in die Scheide\nWird es auf Video festgehalten wie al-Qaida-Geiseln\nFick Rap! Ich verbreite weiter Koks\nÄsthetik heißt für mich: breiter sein als groß\nIch lass' mir von der Szene nichts vorwerfen\nZeit ist Geld, deshalb geb' ich keine Benefizkonzerte\nKomme rein, die Sonne scheint, ich klär' das sofort\nKollegah, Farid Bang - Loyalität ist mehr als ein Wort!\n\n[Hook: Kollegah & Farid Bang]\nMeine Tracks war'n nie nur reine Fiktion\nSondern eine Vision, jetzt zähl’ ich meine Million’n\nAlso Nutte, mach den Jet klar!\nZeig Respekt, ich bin Rapstar!\nMutterficker, meine Tracks war'n nie nur reine Fiktion\nSondern eine Vision, jetzt zähl' ich meine Million'n\nAlso Nutte, mach den Jet klar!\nIch kauf' dein Leben per American-Express-Card!"}], "artist": "Kollegah"}