{"songs": [{"lyrics": "[Intro]\nCan you hear me now? Good! (Blueprint 2 baby!)\nThe best of times, it was the worst of times (aoww)\nIt's \"The Gift & the Curse\"\n\n[Chorus]\nR.O.C. yeah, number one clique here\nIf you represent us, throw them diamonds up YEAH\nNow let's be clear, I ain't goin' nowhere\nNow that you know, holla at your boy\nHOV'.. (Hov', Hov', Hov')\n(Hov', Hov', Hov', Hov')\n\n[Overlapping first Chorus]\nYeah, Roc-A-Fella Records\nYou know what diamond is\nWe ain't goin' nowhere, put your diamonds up\n\n[Verse 1]\nStandin' in my b-boy stance\nFree, Beans, Memphis where you at nigga?\n(Right here) snatch Cam and it's a wrap\nThis here rap belong to us, nobody strong as us, it's a fact\nHold up I'm just warmin' up, gimme a second to get it back\nYoung Chris, Neef what? Oschino and Sparks\nNext summer's yo' summer, tear this motherfucker up\nYoung is eternal, my youngins'll burn you\n\"The Blueprint\" birthed, nigga I earthed you, you can't be serious\nYoung 'cause I'm thirty-two, dressed like I'm twenty-two\nFlow like a 18, do what I wanna do\nGoin on my 8th ring, got Phil Jackson's Zen\nFlow is black magic, I'm at it again\nRose Gold with black karats, Horse & Carriage to spend\nLike Mason Betha, chasin' this cheddar to the end\nOf the road because the end I'm told is nearer than we know\nWhat can I say but live for today, HOV'!\n\n[Chorus]\nR.O.C. yeah, number one clique here\nIf you represent us, throw them diamonds up YEAH\nNow let's be clear, I ain't goin' nowhere\nNow that you know, holla at your boy\nHOV'.. (Hov', Hov', Hov')\n(Hov', Hov', Hov', Hov')\n\n[Verse 2]\nYeah, The Blueprint 2 homie, follow the moves\nYou put on two tube socks, you couldn't walk in my shoes\nI was dealt a bad hand, fuck what else could I do\nBut keep somethin' up my sleeve that'll help me through\nBut can you believe, everywhere I'm at, models come through\nCat-fightin', cat-walkin', it happens often\nIt's true how society don't want me to move\nInto the penthouse building with spectacular views\nThey're like uhh, \"He's a menace he could never be a tenant\"\nI'm like ooh, what's a young nigga to do?\nI bring the brothers to the building give a feeling that I don't\nGive a fuck we just chillin' watchin' chandelier ceilings high as fuck\nOld lady, don't blow my high\n'specially if you don't know my life, don't make me bring\nSharpton in it 'cause I'm dark-skinned-ed or\nDude with the 'fro and the Rainbow Coalition, I'ma\nVictim of a single parent household, born in a mouse hole\nMousetrap, niggas wanna know\nHow so, how Jay get up out that, here, yeah\nI snatched purses, I per-se-vered, yeah\nI had work, fiends purchased, it was clear\nI was out there sellin' hope for despair, but stop there\nI swear, I only make good from my mouth to God's ears\nHad to get out the hood\nAnd I can't justify genocide\nBut I was born in the city where the skinny niggas die\nBorn in the city where the skinny niggas ride\nAnd as a skinny nigga I had beef with high size\n\n[Chorus]\nR.O.C. yeah, number one clique here\nIf you represent us, throw them diamonds up YEAH\nNow let's be clear, I ain't goin nowhere\nNow that you know, holla at your boy\nHOV'.. (Hov', Hov', Hov')\n(Hov', Hov', Hov', Hov')", "title": "Diamond Is Forever", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}