{"songs": [{"year": "2016-10-27", "title": "California", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Hook: Saba & Ravyn Lenae]\nSee the horizon from the road, and hope that we drove...the right direction\n'Cause I don't wanna slow...down for no gas\nAnd plus I'm runnin' low on cash\nBut I know that my bucket gon' make it to California, California\nHmmm mm mm Cali, Cali\n\n[Verse 1: Saba]\nWhat does love look like in the 22nd century? Merely a memory\nI intervene cause I tend to be a lil' more optimistic than the wildest child or the most imaginative\nI sip the tea after my opinion\nThey Pistol Pete, dishin' out assistance\nGovernment aid, what does it take\nTo break the mold, ay I hate the po'\nLike the base is low, but I'm out the park\nLike the acre gone\nSaba with the sabre sword\nFocusin' on what we can't afford\nIn the scheme of things, guess it just ain't important\nWho wasn't broke for a moment or three\nStart staining like, \"oh it was free\"\nThen stop for a moment of peace\nAnd plus they would call the police if you kept showin' ya face\nI said I stopped dreamin', instead I decided to chase\nAnd I ain't look back, that's how you turn to stone\nMy first friend up in high school was a Stone\nHe said come and join, I ain't come along\nNot cause I'm high and mighty, just cause I knew right from wrong\nSomewhere I belong, looked but I didn't find\nBut instead of getting discouraged I got my city behind\nNow I'm feelin' worldwide, next stop NY\nNext month LA, then back West Side\nYou change when a friend dies, new man since I lost Kobe\nHe got out of prison then called my phone like, \"where ComfortZone?\"\nAnd since then I lost touch, but this year I'm gettin' it back\nI finally feel like myself, what I've been on, don't even ask\nThey ask me \"why the Bucket List?\"\nYou know the bucket list, I finally climbed the rock, made it to the top of the precipice\nI came from the pessimism of inner city as it is\nAccident prone youth, adult say don't take a chance\nBut we never listen, we went and did it, they vision impaired\nSo what do you fear, and why are you scared?\nWhy are you scared?\nWhy are you scared?\n\n[Hook: Saba & Ravyn Lenae]\nSee the horizon from the road, and hope that we drove...the right direction\n'Cause I don't wanna slow...down for no gas\nAnd plus I'm runnin' low on cash\nBut I know that my bucket gon' make it to California, California\nSee the horizon from the road, and hope that we drove...the right direction\n'Cause I don't wanna slow...down for no gas\nAnd plus I'm runnin' low on cash\nBut I know that my bucket gon' make it to California, California\nHmmm mm mm Cali, Cali\nSee the horizon from the road, and hope that we drove...the right direction\n'Cause I don't wanna slow...down for no gas\nAnd plus I'm runnin' low on cash\nBut I know that my bucket gon' make it to California, California\n\n[Skit: Lupe Fiasco]\nYo yo yo what up? This is Lupe Fiasco\nAnd my bucket list...has many things in it\nOne of 'em is uh, wantin' to win the Nobel Prize, for somethin'. Uhhhh, I also want...yeah that's it, I just wanna win the Nobel Prize\nYeah!\n\n[*Instrumental Switch*]\n\n[Bridge: Saba]\nHouse, in a gated neighborhood, not the hood, in the hills\nPlus an ocean view, your wife and you is good\nAnd your bills, ain't never stress you and you get karate lesson\nHere's, to, no more tears\n\n[Hook: Saba]\nLook at what you done started?\nLook at what you done started?\nLookin' at how you've gone, gone\nDo you want a shooting star?\nLook at what you done started?\nLook at what you done started?\nLookin' at how you've gone, gone\nYou can leave it runnin'...\n\n[Skit]\nYo yo yo, shoutout to my boy Saba, man. It's ya boy Donterio Hundon, man. Ya know I fuck with ya bro, but I gotta bake anotha one, on baby. Boy, yo ass look like a deep-fried West African squirrel with kinky twists, yo lil' ugly ass boy. Yo ass look like a sophisticated hamster with micro braids, yo lil' ugly ass boy. Yo ass look like a- yo ass look like a cool chimpanzee with a mop in it's head, yo lil' ugly ass boy, and we heard what happened to you mhm. You thought we wasn't gonna find out, we found out, boy. Yo ass was performing Sugar Pie Honey Bun every Tuesday on karaoke night at TGI Fridays. You got kicked off stage 'cause they ain't pay you enough Corona top and they didn't give you no free Heineken, yo lil' ugly ass boy. Yo ass look like the unpaid Future with no future, yo lil' ugly ass boy. On my mom, you ass smell like a bag of whoop-dat-ass and train smoke, yo lil' ugly ass boy, on baby. You look like the type of nigga that be gettin'- orderin' nachos with no cheese on them bitch. You look like the nigga to get on the CTA bus and put 200 pennies in that bitch, yo lil' ugly ass boy on baby, you bogus", "album": "Bucket List Project"}], "artist": "Saba"}