{"artist": "Pharrell Williams", "songs": [{"album": null, "title": "Places And Spaces I’ve Been Excerpt", "image": "https://images.genius.com/aa964e94a21e7b893801ed3a2bd389b8.1000x1000x1.jpg", "lyrics": "Preface\n\nIn this conversation, Kanye West and Pharrell Williams candidly explore the rewards and perils of a lifelong, perfectionist ethic. Best likened to a child's insatiable curiosity, they impute their compulsive, insistent tinkering to much lived experience, and even to obscure neurological phenomena. Their exchange lends precious – and comic – insight into a frightening capacity for invention, and a knowing approach to craft that is at once sure and relentlessly self-critical. They spoke in the wake of a minor controversy that followed the online launch of the single “Theraflu”, which Kanye released through his G.O.O.D Music label (in collaboration with DJ Khaled, DJ Pharris and the producer Hit Boy). Predictably, the pharmaceutical combine Novartis objected to the title. The track also featured the lyric “someone tell PETA my mink is dragging on the floor,” which drew immediate fire from the animal-rights group\n\nKanye West: Yo yo, what’s good?!\n\nPharrell Williams: What up, killer?!\n\nKW: Shit, chillin’, vibin’ about changing the name of that song and trying to figure out what the name of the song should be. You know, the “Theraflu” song?\n\nPW: Yeah\n\nKW: Yeah, we’re about to give it a new name\n\nPW: It’s getting that big – they’re going that crazy about it?\n\nKW: Oh, yeah they have an issue. Just the title and here’s still a window of opportunity for us to change it. “Oh, well, I don’t want to call it ‘Theraflu’. I’m calling the song this…” And then people are like, “oh, he changed the song to this”, and then that’s what it is, because when I did the song, I actually did not know that it would get to the point that grandmothers are talking about it, you know? Like why did I give them that level of promotion?\n\nPW: Yeah, trust me, they’re thankful. No matter what, they’re thankful. This segues perfectly into what I wanted to talk to you about. Which is what is it like to be – and I know how I feel about it – but you’re definitely one of my peers, and one that I look at and say “He gets it, but I’d love to hear his take on why we aspire to be.” It’s almost a disease to be a perfectionist. Nothing is ever quite good enough. What is it like to look at things and say to yourself, “I know that they don’t get it but maybe one day they will.”\n\nKW: It is so funny this is such an example of being a perfectionist, right? This song is out and I’m going to change the name, like I want to perfect this moment some more. Well, I think it’s just if you’re a perfectionist, that’s just what you do. You know, there are slackers there are people who are satisfied by delivering everything they have – with their knowledge, their financial situation, their level of exposure – to deliver the best product possible. I respect, look up to, and look to Walt Disney and Steve Jobs who dedicated their time, soul and energy to delivering the best product that they knew they could. There’s a lot of psychology that goes into it. What can you give to human existence? How can you push the culture forward? And when you’re a perfectionist, at a certain point you feel a responsibility in what you put out, and what could trickle down from it. If you put out things that are so over-the-top and magnificent, what trickles down from it could at least be good because there are more followers than there are leaders\n\nPW: Yeah I agree…You know what the funny thing is that we’ve never done it on a Kanye West album, it might be time for that\n\nKW: Yeah!\n\nPW: It might be time for that\n\nKW: Yeah, we started on that shit for [Watch] The Throne\n\nPW: Oh yeah! That was a very serious moment…\n\nKW: Yes!\n\nPW: I’ll never forget going to you and Jay’s show, and just seeing those laser lights. You addressed all the sensations, with the exception of smell and taste, I guess. Anything that you could control, the auditory and the visual, you curated – you made sure that it was a curated moment. And I’ll never forget when the first bars of “Gotta Have It” started playing, that minor chord. It just hits you anyway but it was just y’all talking on top of the track as it starts to come on, and the crowd start going nuts! And it’s really because at the end of the day, as great as the track is as it is and as great as all of the stuff you guys did on top of it, it was how the moment was so set up. It was like an incredible layup, an alley-oop. Do people even say that word anymore, alley-oop?\n\nKW: Yeah, it’s only ‘cause it happens\n\nPW: [laughs] yeah, you know I don’t know anything about basketball, but it was an amazing set-up. That was crazy, just to see the reaction to what a visual and music could do together, and those people going absolutely crazy I was like “oh, ok, well done man, well done.”\n\nKW: Yeah I definitely wanted to dial into that sound and mixing those textures together. I just want to dial into that more, I just want to set the note, like playing a few textures that I got for this new shit for the G.O.O.D. Music joint we opened up the album with this joint that me and Skrillex did together\n\nPW: Mmmmm. I like that!\n\nKW: Just like that!\n\nPW: Wow, I can’t wait to hear what that sounds like. I know we are all shaped and moulded by all that we’ve gone through, and by having spirituality – in whatever way you define it – it allows us to be bigger than our bodies, to be bigger than our essence. [But] there is something to be said for experience, being told “no” the entire time, when you wanted to get into an industry that you love. So let me ask you, how much has this experience contributed to who you became as a person?\n\nKW: Yeah, you know, I had to realize at what point to put off the real South Side Chicago mentality, that is what built me to deal with the amount of “no’s” and deal with the amount of pressure and aggression, like I talked about on this Chicago song, “mink is draggin’ on the floor.” That’s one of my ideas for it [renaming ‘Theraflu’]. “Swag King Cole, mink is dragin’ on the floor, fo’ I embarrass you, but I don’t like to embarrass you…’I Don’t Like To Embarrass You” as the title\n\nPW: Anticipating PETA\n\nKW: Yeah, so…when I say “I’m from where shorty’s fucked up, double-cupped up. Might even kill some-body and YouTube it, so whoever thinks their words affect me is too stupid, and if you think you can do it better than me, then you do it.”\n\nPW: Yeah, “you do it!”\n\nPW: [laughs]\n\nKW: “I’m from Chicago.” And that was just one of the best things to prepare me for anything. If you can make it out of Chicago, you can make it anywhere. That’s what I’m talking about on this new song, that’s what I’m talking about when I’m dealing with any business or creative processes. That’s the stuff I’m talking about when I was dealing with people, from not wanting me to rap, to [not] doing the tour with Jay, and being able to do the light show for it It was like sit-ins, when we were going out to Paris. You know when we were wearing the outfits and people on the blogs were calling us names and all that, right? But then, once they got that Givenchy cover, and everybody’s wearing Givenchy they’re all like “oh this is cool.”\n\nPW: Right\n\nKW: But it wasn’t cool with South Park was using the photo and dissing us and everything. And so many people dress like that now\n\nPW: [Laughs in agreement] Yeah, that’s what we do\n\nKW: That was before everybody said swag, or when we were out in Japan. How could you communicate through people? We’re not even understanding the language but we knew the visual language, we knew the spirit, we knew the ideas, we knew the reference points\n\nPW: Yeah, that’s the thing, man. That’s what separates us from a lot of folk, and not because we’re better but because we’ve dedicated to listen to that inner voice, and a lot of people don’t. A lot of people go “man!” they do something and they go “shit you know what, and I’m totally not da-da-da-da [fill in the blanks].” People fail a lot of times doing that. Whereas we just trained ourselves to say “you know what, let me entertain this idea” and exhaust all the possibilities to make sure that it doesn’t make sense because something good may come out of that and for every time that someone has ever told you no, you’ve always had that willingness to explore it. Um, and I’ve watched that by the way, it’s been cool to see. How are you enjoying that…\n\nKW: - Enjoying what?\n\nPW: I’m thinking of a way to put it…How are you enjoying this whole fame thing?\n\nKW: [gasp] You know its just a process of separating things, it’s understanding how to exploit it to display things, it’s understanding how to exploit it to display amazing art. You know the whole trick is that I am a visual artist. To this day I can’t play piano. I’ve taken it up a couple of times and I forget how to play the piano. And when I first wanted to rap, before I rapped, the first thing I did was actually draw my tape covers because that’s back when people had tapes. I drew the cover before I even thought about doing music. Let’s put this information in Vegas to music. So ina  way I’ll get the music but it was always about the fountain. It was always about the light show. It was always about the fashion show, it was always about that. Whether it is the font that we pick for a single cover, or a video – I’m going to Qatar later tonight to shoot the film for “Cruel Summer,” which is basically my second pop fairytale, like how “Runaway” was – it creates that kind of opportunity. When you see me design, and I’m not saying it’s the best design or whatever, but you know, [in “Runaway”] I had my idea of how I wanted Selita [Ebanks] to look, and I wanted it to be Selita. I wanted to juxtapose minimalist, Vanessa Beecroft like high art against unrealistic Victoria Secret-level beauty.  They don’t crash, those words are not in the same place. You’ve been to art parties before? It’s different from a Victoria Secret’s party. You know what I’m talking about!\n\nPW: Right!\n\nKW: That’s right. Due to exposure, I’m able to have these things be seen by so many people. If Matthew Barney were more famous, then more people would see what Matthew Barney did. So it’s that. When it comes down to it, what I enjoy about it is the opportunity to express art in high volume, literally\n\nPW: Did you know that you’re a synesthete? That you have synesthesia?\n\nKW: That’s what it’s called, that’s what the film is about! You’re talking about seeing sounds right?\n\nPW: There are many different forms of synesthesia. There are grapheme synethetes, people who see colors in numbers, letters in colours. But I believe most musicians and most artists are synesthetes\n\nKW: You know that’s what this film in Qatar is about!\n\nPW: Oh wow!\n\nKW: It’s called Cruel Summer: The Legend of the Lamborghini Dons  and it’s basically the G.O.O.D Music Lamborghini Dons. [Kid] Cudi, he’s the main character and I’m just this boy, and in the beginning we’re car thieves. There’s this part where one character teaches another to see colours through sound\n\nPW: Oh wow!\n\nKW: Yeah, the shit is dope. Matter of fact, if we could do work with you on the soundtrack. I mean I’ve got eight tracks for it, I just want to give it twelve. Basically it’s the G.O.O.D Music soundtrack that “Mercy” is the first single for. You’re like next level with this type of shit like [sings] “Take me far away, as long as it’s fun, fun, fun, I wanna go.” I’m talking to actually a film scorer at this point so –\n\nPW: No! But dude….Nah man! It’s funny that you picked that out [“Fun, Fun Fun”]. That’s funny, wow!\n\nKW: I play that song real normal in the car\n\nPW: No way?!\n\nKW: Yeah!\n\nPW: That’s crazy, that’s crazy. ‘Aight well say no more. I’mma holla at you soon. And you have a good time out there in Qatar. My man!\n\nKW: Alright, thanks! Love", "year": null}]}