{"artist": "Pusha T", "songs": [{"album": "My Name Is My Name", "title": "S.N.I.T.C.H.", "image": "https://images.genius.com/324abe3d1e81bc03ab9ad30ec3137e50.500x500x1.jpg", "lyrics": "[Chorus: Pharrell Williams]\nSorry, nigga, I'm tryna come home\nSorry, nigga, I'm tryna come home\nWell, the walls are talkin' to me and I know you think I'm wrong\nBut, sorry, nigga, I'm tryna come home, hey!\n\n[Verse 1: Pusha T]\nNow when the phone start to clickin', your words start to echo\nSay you got to hang up but that man won't let go\nOh, my nigga, say it ain't so\nNow we speakin' on some niggas that he say he ain't know\nWe used to steal dirt bikes, dodge raindrops\nSo close niggas thought we had the same pops\nGraduated, gettin' money on the same blocks\nBut things changed and we ain't end up in the same box\nHearin' whispers, \"it ain't adding up\"\nGivin' you the jailhouse talk but you ain't mad enough\nI never thought I'd be the last man standin' up\nI never thought I'd had have to question, 'Were you man enough?'\nLong letters how the streets got the best of you\nTellin' all your cellies how come I ain't sitting next to you\nYeah, see I can read between the lines\nSo it's awkward when you call and I gotta press 5\n\n[Chorus: Pharrell Williams]\nSorry, nigga, I'm tryna come home\nSorry, nigga, I'm tryna come home\nI think the Feds are lookin' through me, can't you hear it in my tone?\nSo, then sorry, nigga, I'm tryna come home, hey!\n\n[Verse 2: Pusha T]\nGot me tiptoeing through the conversation on our calls\nTryna act normal but the writin's on the walls\nIt's like I hear you smilin' when you heard they hit the wall\nBut I just let it ride so I don't be the next to fall\n\"They sayin' Terrion been getting money while I'm gone\nAnd won't he tryna to holla at my bitch when I was home\"\n\"Nah, he selling cars, it'd be him and Lil Rome\"\nI'm just tryna offset what he was sayin' on my phone\nNowadays niggas don't need shovels to bury you\nPointin' fingers like pallbearers how they carry you\nSo much for death before dishonor\nMight as well have a robe and gavel like Your Honor\nI just sit and wonder, play it by the numbers\nWhen you ride like lightnin' then you crash like thunder\nSeen your baby mama, she ain't even know if she should speak\nWhat the fuck is there to say knowing her king's now weak sayin'\n\n[Chorus: Pharrell Williams]\nSorry, nigga, I'm tryna come home\nSorry, nigga, I'm tryna come home\nWell, the walls are talkin' to me and I know you think I'm wrong\nBut, sorry, nigga, I'm tryna come home, hey!\n\n[Verse 3: Pusha T]\nLet's talk real niggas, let's speak real, nigga\nHow many niggas you knew snitchin' you ain't killed, nigga?\nCovered his own tracks, he didn't care that\nWe had a legacy he killed, I got to wear that\nEvery move we ever made is gettin' stared at\nI bet the man inside his mirror doesn't stare back\nBreak your heart when the man you call your brother\nBe the same one that set in motion all them undercovers\nCalled my mom mother, was at my graduation\nWhen I signed my record deal you was my motivation\nUh, from great friends now it's no affiliation\nDivided by the time he was facin', once he told me that\n\n[Chorus: Pharrell Williams]\nSorry, nigga, I'm tryna come home\nSorry, nigga, I'm tryna come home\nI think the Feds are looking through me, can't you hear it in my tone?\nSo, then sorry, nigga, I'm tryna come home, hey!", "year": "2013-10-07"}]}