{"songs": [{"year": "2014-01-27", "image": "https://images.genius.com/7709e3a794225475c19cbd280b83e12a.571x571x1.jpg", "title": "Abschluss-Statement zum Beef mit Fler und Silla", "album": null, "lyrics": "ABSCHLUSS-STATEMENT ZUM BEEF\n\nDies ist ein abschließendes Statement zur momentanen Beef-Lage und relativ umfangreich (wie mein Oberarm), daher bitte nur diejenigen lesen, die sich dafür interessieren.\n\nZu allererst möchte ich betonen, dass wir uns durch die 2 Blogs gegen SILLA und FLER keineswegs als die \"krassen, harten Gees\" darstellen wollen. Die Intention ist eine ganz andere; um es zu verständlich zu machen, muss ich kurz in der Geschichte zurückgehen:\n\n2009 war der Höhepunkt des Beefs zwischen FLER und mir. Dieser Beef wurde von meiner Seite aus auf rein raptechnischer Ebene ausgetragen. Dieses Battle verlor FLER klar und deutlich und bauschte unseren Beef daher so auf, dass er einen \"Städte-Krieg\" draus machte und uns so darstellte, als griffen wir nicht ihn, sondern ganz Berlin an. Daraufhin wurde ein Konzert von uns in Berlin gestürmt, von mehreren maskierten, bewaffneten Leuten, wobei 2 Unbeteiligte Rapper, die gerade performten, körperlich zu Schaden kamen.\nBis heute müssen unsere zahlreichen Fans in Berlin leider auf Live-Konzerte von uns in der Hauptstadt verzichten, da a) kein Veranstalter das Risiko tragen möchte und b) wir mit derart viel Leuten nach Berlin fahren müssten, um unsere Sicherheit zu gewährleisten, dass es sich finanziell nicht lohnen würde, im Gegenteil.\nDies alles nur, weil FLER ganz Berlin \"aufhetzte\" gegen die bösen \"Berlin-Feinde\" aus NRW, anstatt selber den Beef alleine auszutragen.\n\nSowohl SILLA als auch FLER brüsteten sich wiederholt mit dieser Aktion, obwohl sie selber nicht dabei waren. SILLA war der erste, der nach dem Vorfall damals bei FARID BANG anrief und höhnisch meinte \"Na wie war euer Konzert in Berlin?\". Auch FLER stellte sich bis zuletzt in Interviews als eine Art \"Mafia-Pate\" dar, der uns \"Berlin-Verbot\" erteilt hätte.\n\nSolch feige, gewalttätige Aktionen haben im Rap nichts verloren. Obwohl wir in NRW weitaus genügend Leute und Mittel gehabt hätten, jederzeit wenn ein MASKULIN-Member hier in der Gegend auftrat, einen \"Überfall\" auf sein Konzert zu starten, haben wir dies nie getan. Wir haben IMMER unsere Linie gewahrt und auf Tracks geantwortet.\n\nGanz im Gegensatz jedoch zur MASKULIN Crew.\nDie Öffentlichkeit vergisst leider schnell, jedoch ist es noch kaum ein Jahr her, dass sowohl SILLA als auch FLER noch ernste Gewaltdrohungen in unsere Richtung äußerten, während ich für meinen Teil das Kapitel FLER eigentlich schon mit FANPOST abgeschlossen hatte.\nSo drohte der sich jetzt als braves Unschuldslamm, welches keinen Beef auf \"Streetlevel\" haben möchte, darstellende SILLA von sehr realen \"Angriffen mit Flaschen\" auf die \"Banger\" und FLER drohte explizit in Interviews und per Twitter damit, uns Leute auf unsere Touren zu schicken.\nDies alles natürlich nur mit dem Wissen, dass er Unterstützung von einem bezahlten Rücken hatte.\n\nFLER selbst hat nie für sich gerade gestanden, sondern immer Leute vorgeschickt und sich mit fremden Aktionen gebrüstet. Er hat durch das Involvieren von \"Schutzgeld-Leuten\", das Aufbauschen von Rapper-Beef zu \"Städte-Beef\" und durch das immer wiederkehrende Drohen mit konkreter Gewalt und Übergriffen auf Konzerte der deutschen Hiphop-Kultur massiv geschadet.\n\nNatürlich stehen FARID BANG und ich mittlerweile meilenweit über den MASKULIN-Membern und haben es eigentlich nicht mehr nötig, diese überhaupt als existent wahrzunehmen.\nDie Aktionen aus der letzten Zeit, auch wenn sie auf den ersten Blick \"kindisch und asozial\" escheinen, waren jedoch nötig um ein Zeichen zu setzen.\n\nDie Aktionen (Farid's asoziale Beleidigungen per Twitter in Richtung MASKULIN, die Aktion beim Silla-Auftritt und der aktuelle Berlin-Karotten-Blog) haben eines ganz deutlich aufgezeigt:\nDiese Leute, allen voran FLER, haben plötzlich, jetzt wo sie keinen Schutz mehr haben, keine große Klappe mehr. Am liebsten würden sie einfach in Ruhe gelassen werden.\nJedoch gaben wir allen die Chance, für ihre Fehler gerade zu stehen.\n\nIch habe mich im vergangenen Jahr bei SILLA entschuldigt, dass ich seine Mutter beleidigte. Dieser Schritt hat dem MASKULIN Camp die Möglichkeit gegeben, die Sache zu beenden und für ihre Fehler gerade zu stehen. Stattdessen kamen jedoch weitere Drohungen und Beleidigungen in unsere Richtung.\nAuch vor dem aktuellen Berlin-Blog gaben wir privat FLER die Möglichkeit, sich für seine Grenzüberschreitungen zu entschuldigen und damit die ganze Sache abzuhaken. Diese Möglichkeit nahm er jedoch nicht wahr und muss nun mit den Konsequenzen leben.\n\nMit den jüngsten Aktionen ist für uns die gesamte Angelegenheit abgeschlossen. Es werden in Zukunft keine Aktionen oder Worte mehr in Richtung der MASKULIN Crew kommen. Wir haben aufgezeigt, dass gewisse Leute nur so lange eine große Klappe haben und mit Gewalt drohen, wie sie einen bestimmten Schutz genießen, aber wenn es drauf ankommt, nicht selber für sich gerade stehen.\nDas Zeichen, was wir für die Zukunft setzen möchten ist, dass Beef zu HipHop dazugehört, aber auf Battle-Ebene ausgetragen werden sollte. Wenn es tatsächlich einmal auf ein Street-Level kommt, sollen die Leute, die derartige Ansagen und Drohungen aussprechen, auch bitte allein dafür gerade stehen.\nKein Rapper sollte jedoch um seine körperliche Unversehrtheit fürchten müssen, wenn er in bestimmten Städten auftritt, wo er per se in der Unterzahl ist.\nWir haben damit nicht angefangen und wir werden es auch in Zukunft so praktizieren, dass wir unseren Beef alleine austragen. Das Drohen mit Gewalt durch Großgruppierungen ist feige und bringt einen zerstörerischen Aspekt in unsere HipHop-Kultur.\n\nWas mich persönlich freut ist, dass die ganze Action der letzten Tage auch einen positiven Nebenaspekt hatte, nämlich die Beendigung des Beefs zwischen AZAD und mir.\nDies sage ich weder aus Angst, noch aus Kalkül, sondern rein aus Respekt vor der gesamtkünstlerischen Leistung von AZAD. Auch wenn die neue Generation ihn nicht mehr zu 100% auf dem Schirm hat, hat er einen wichtigen Stellenwert in der deutschen Rapgeschichte und das Game bereichert.\n\nMit diesem Statement hier ist das ganze Beef-Thema für mich abgeschlossen. Ab jetzt wird es wieder rein um die Musik gehen. Am Freitag erscheint mein erstes Video aus dem kommenden Album \"KING\" und die offizielle Promophase wird eingeläutet.\n\nFreut euch auf die Zukunft, Freunde. Sie wird bosshaft.\n\nGruß,\nKollegah"}], "artist": "Kollegah"}