{"songs": [{"image": "https://images.genius.com/093524f55308e0c3a99f8d6f7746a3bf.1000x1000x1.jpg", "title": "Motivated", "album": "Mansion", "year": "2015-03-31", "lyrics": "[Intro]\nI've been-I've been doin' this a long time. I mean, over half my life. So, it's-it's awesome for me to be able to put out music that people will actually hear, especially when you put this much time into somethin' that you love, somethin' that you have a passion for. That's-that's motivation\n\n[Chorus]\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated, I\n\n[Verse 1]\nWhen I first started, never knew if they will listen (Ah)\nBut when I write, I produce passion, that's Mel Gibson (Hey)\nIf music is a disease, I promise I'm infected (Ah)\nI dream on different levels of dreams—Inception (No)\nAnd these beats are my playground, let the words play (Ah)\nYou ain't catch it? That's wordplay, now you're stuck on the word \"play\"\nI'm all business, no suit on, but that's okay (Ah)\nI will K.O. you (Here yet?), if you come in my work space (Here yet?)\nAnd don't you ever try to tell me I lack passion (Ah)\nI'm a stand up guy, I promise you ain't laughin'\nThese rappers are slowin' the game down—bad traffic (Ah)\nAnd how you gon' put me in a category of wack rapper?\nYeah, listen, I'm Hulk, I transform and I smash rappers\nYou sippin' on syrup, that doesn't mean you're a sick rapper\nSee, what it means is you gon' prolly get sick after\nYou don't like that I'm blunt or is it the fact that I smoke past ya?\n\n[Pre-Chorus]\nTake your best shot (Shot, shot)\nTake your best shot (Shot, shot)\nTake your best shot (Shot, shot)\nI ain't goin' nowhere (Nowhere), nowhere (Nowhere)\n\n[Chorus]\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated, I\n\n[Verse 2]\nI put work in this music, you think I'm makin' this up? (Nope)\nIf the songs ain't sharp, trust me they ain't makin' the cut (Get it)\nYou don't like it? I'm no teacher, but you'll learn to adjust\nI'm my own worst critic, so, critics, step your hate game up\nI'm a different breed of artist, I know how to survive (Ah)\nYou come into my lane, you better know how to drive\nAnd I suggest you buckle up if you gon' come on this ride\nNo Johnny Cash, but some of y'all are walkin' the line\nBut you wrong though (Wrong though), y'all look curious (Ah)\nHeath Ledger type of questions like, \"Why so serious?\"\nAnd you want watered down lyrics? Well, I don't carry 'em (Ah)\nI dig holes for these tracks, and then I slaughter and bury 'em\nThe motivation I got is on a whole different level\nI treat these lines like court case, I don't wanna settle\nAnd my lyrics are bullets, and they're aimin' at you\nAnd I ain't talkin' Switchfoot when I dare you to move\n\n[Pre-Chorus]\nTake your best shot (Shot, shot)\nTake your best shot (Shot, shot)\nTake your best shot (Shot, shot)\nI ain't going nowhere (Nowhere), nowhere (Nowhere)\n\n[Chorus]\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated, I\n\n[Verse 3]\nYo, when it comes to punches, you know I'ma land mine (Land mine) (Ah)\nNo, I said I'm a land mine\nDon't step on me or you'll get blown sky high\nAnd I don't mean secrets when I say to keep it in mind\nThat I'm ill with the words—too sick\nThey say I rap hungry (Ah), well, that's 'cause I'm starvin'—Diesel\nThat's why they callin' me Riddick-ulous (Ah)\n'Cause the look in my eyes is different, woo (Ha ha ha)\n\n[Bridge]\nY'all ain't ready (You'll have to rewind that)\nY'all ain't ready (Rewind that back)\nY'all ain't ready (Ready), woo\nLet's go! (Ah)\n\n[Pre-Chorus]\nTake your best shot (Shot, shot)\nTake your best shot (Shot, shot)\nTake your best shot (Shot, shot)\nI ain't going nowhere (Nowhere), nowhere (Nowhere)\n\n[Chorus]\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated\nI, I'm motivated, motivated\nMotivated, motivated\nMotivated, motivated\nMotivated, I"}], "artist": "NF"}