{"artist": "E-40", "songs": [{"title": "Back Against the Wall", "image": "https://images.genius.com/a5f1f8095418f1fd91f86ca97ac169c0.1000x1000x1.jpg", "album": "The Element of Surprise", "year": "1998-08-11", "lyrics": "[Intro: E-40]\nTryin to make it..\nIt's been a long road\nSic-Wid-It Records\n\n[Master P (E-40)]\nUNNNNNNNNNGGGGGHHHHH! (C'mon, ooh)\nY'all feel that? (I feel it playboy, I smell you)\nIt's real out here 40 (It's real Pee!)\n\n[E-40]\nI'm out here in the slums where thugs be usin, ghetto tactics\nLike, choppin up candy cane\nSittin on top of a dried up JCPenney pee stained mattress\nWhatever it takes to survive, see that's what I supply\nLike slippin and slidin in the grocery store\nAnd settling out of court\nSoft white coke a black turn into hard solidses\nThirty-eight snub nosed pistol grip lay ninjas on they wallets\nThe saga continues, the struggle's just beginnin\nAnd it's hard to look up to snotty folks, cause THEY be sinnin\n'Pac gone, Biggie gone, Seagram gone -- and we also lost Eazy-E\nOne of the first gangster rappers of all time\nTo the most vicious and deadliest disease in history since cancer\nTo Acquired Immune Deficiency Syndrome, tombstone\nFrom the graveyard shift, RBL's Mister C\nOne love, to Rappin Ron and Plann B\nVictims of the trigger (unnngggggggghhhhhh)\nPo' out a little liquor\n\n[Hook: repeat 2X]\nIt's not the same, this world is crazy\nWe out here goin through it all\nEverything must change, it's gettin shady\nGot our backs against the wall\n\n[Master P]\nUNGGGGGGGGGHHHHHHH, I shed tears for pain 40, some for anger\nSeen bloodshed by crooked cops, and gangbangers\nFeel my pain (unnnggghhh) only time'll change it\nAnd fast money, cars, and bitches got me trapped in this game\nAnd my lil' homies ballin, picture me fallin\nAnd momma in the funeral screamin and crawlin\nIs there a heaven or hell?\nTo ghetto kids in the anky only time will tell\nAnd jealousy, and envy, come with money\nWhile crooked, politicians, run the country\nAnd it's a, damn shame to see my, weeples vanish\nNow they teach us ebonics, what about english and spanish\nI couldn't, live my life behind bars and gates\nWhile the government play a game called process to eliminate\n\n[Hook]\n\n[E-40]\nCase #246, shootin in an inhabited dwellin\nThey was steady complainin about the dope sellin\nBut they ain't never been evicted, or convicted\nThey ain't never been subpeonaed to court, or arrested\nShackled like an animal for pushin rocks\nDang near choked to death by motorcycle cops\nPepper sprayed and laughed at like that shit was funny\nPregnant breezy threw down on her tummy\nDo you ever think I'll ever be able to get\nA chance to repent and ask the lord for forgiveness\nBefore he close the casket, will my son end up growin up\nWithout a father will he end up bein a bastard?\nA bastard -- that's a good question (unggggggggghhhh!)\nI don't know, I don't know\n\n[Hook]"}]}