{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/aa9d2e0aa6ec58beeaa67f005fd4a4de.400x400x1.jpg", "title": "☠ DEAD ❤ ISLAND ☠", "year": "2013-01-03", "album": "D.A.I.S.Y. rage", "lyrics": "[Verse 1]\nI don't have an opening, I guess I'll go ahead\nI'm Bo Peep, no sheep, just white dresses\nRed tresses and white laundry\nI sing a song to my zombie army, I sing\n\"Who do you voodoo bitch? you can't harm me\nWho do you voodoo bitch? you can't harm me\"\nYou can't charm me, I'm a patrician\nI'm singin' pounds in the trashcan, Kitty do the dishes\nSingin' pounds in the trashcan, Kitty do the dishes\nAnd I love NY 'cause there's so many bridges to jump off\nThe backyard's where you get dumped off\nLil' Kim wanna let the hive pump off\nI just wanna drag you through the marigolds\nAnd I just wanna preach you every parable\nWiz is black and yellow and I'm white and fuckin' terrible\nI'm out in rocking chairs in front of Cracker Barrel\nWith a red nose like a character of carols at Christmas\nI hear \"miss Kitty, come here and sniff this\"\nI just wanna be like doom with it\nI wanna kill a beat and resuscitate it in two minutes\nNo committee of clones to ride cock\nAnd say, \"LEAVE KITTY ALONE\"\nThey're Chris Crock to me\nYou don't know why all the boys flock to me?\nBitch, draw your eyebrows on then talk to me\nDraw your eyebrows on then talk to me\nYou don't know why all the boys flock to me?\nYou don't know why all the boys flock to me?\nYou don't know why I get blogged?\n\n[Hook]\nYou're unable to discern if I'm the wunderkind or underdog\nSo fuck it all, I'm the wonderwall\nI'm the one to call, I'm a slab of muscle under fat\nAnd I'm in battle like a thundercat\n\n[Verse 2]\nI'm a thunder kitty, what a shitty little pun\nBut that's why I need a gun, a gat, or something like that\nI get bottles thrown at shows a lot\nAnd, I think my body needs an otter box\nI'm hot a lot, I gotta get some otter pops\nI'm Optimus, I boss around the Autobots\nAnd I bounce in my own crowd\nI need to get the fuck out of my hometown\nAnd I bounce in my own crowd, bounce in my own crowd\nBounce bitch, bounce bounce\nBounce in my own crowd, bounce in my own crowd\nBounce bitch, bounce bounce\n\n[Hook]\nUnable to discern if I'm the wunderkind or underdog\nSo fuck it all, I'm the wonderwall\nI'm the one to call, I'm a slab of muscle under fat\nAnd I'm in battle like a thundercat\nUnable to discern if I'm the wunderkind or underdog\nSo fuck it all, I'm the wonderwall"}]}