{"artist": "Papa Reu", "songs": [{"album": "Xcuse Me!", "title": "Bluka Bluka", "image": "https://s3.amazonaws.com/rapgenius/papa-reu.jpg", "lyrics": "{Papa Reu}\nI'm gonna make I'm gonna make you wet\nFrom toe to neck from toe to neck\nBut you better not contest\nTry and come a test\nBullet holes go into yo vest\nStraight through yo vest\nJust like the rest you play me oh me oh me\nCan't run through our whole whole army\nThe our ar ar artillery from world one, two, maybe three\nI think I'm gonna crazy from that weed\nNot them regular ones but all you need\nI use them on my enemies and all the ones who are\nHatin' me look boy\nPop, look before you pull the trigger\nTell me boy, which gun bigger\nBluka Bluka now you don committed murder\nYour family gonna suffer\nI got my nine millimeter\nThe closes friend to me one day a hater\nTried to come and run up on me\nI counted fast and I started to spray\nI thought I got him but the motherfucker\nGot away\n\nChorus:\n\nI got my nine Bluka Bluka! Bluka Bluka!\nI got my a-k Bluka Bluka! Bluka Bluka!\nI got my tec Bluka Bluka! Bluka Bluka!\nThat'll make you wet Bluka Bluka! Bluka Bluka!\n\n{TC}\nI'm an Uptown stunner\nBitch nigga runner fifty geez on yo head\nBullet proof yo Hummer AK user\nFinger on the trigger\nYour brought that issue on yo\nFuckin' self nigga I spin the bin\nWith fifty shots\nAK, Tec-9, and Automatic Glocks\nWootay! me and Reu don't play\nGet out off line and hit you with the AK\nChoppin' down is an occupation\nWe got a different gun for every situation\nYo block we be scopin'\nFifty shots to yo dome, we leave ya open\nSo don't come test we cuz it's gonna be\nBluka Bluka! to yo whole family\nBluka Bluka! our artillery\nBluka Bluka! if ya try to test we\n\nChorus\n\n{Papa Reu}\nWe ain't no army and them our the work\nYou taught I put the gun in Alumna\nWe ain't no army and them our the work\nYou taught listen to the big slug above\nWe gold armor from head to shoulder\nListen to me now before you get fucked over\nReu don't come around no play\nEach and everyday we have to pop the AK\nNo listen don't listen I introduce to my gat\nGet nine mill Lou from the chrome I bet\nTec bust a shot if they try to disrespect\nStrictly leave yo ass soakin' wet\nWe gold and armor from head to shoulder\nListen to me know before you get fucked over\nWe gold and armor from head to shoulder\nListen to me know before you get fucked over\nTo shoulder messed over\nTo shoulder messed over\nTo shoulder messed over\nTo shoulder messed over\n\nSouthside got the Bluka Bluka! Bluka Bluka!\nNorthside got the Bluka Bluka! Bluka Bluka!\nEastside got the Bluka Bluka! Bluka Bluka!\nWestside got the Bluka Bluka! Bluka Bluka!\n5th Ward got the Bluka Bluka! Bluka Bluka!\n3rd Ward got the Bluka Bluka! Bluka Bluka!\n9th Ward got the Bluka Bluka! Bluka Bluka!\n7th Ward got the Bluka Bluka! Bluka Bluka!\nUptown got the Bluka Bluka! Bluka Bluka!\nDowntown got the Bluka Bluka! Bluka Bluka!\nMy niggas in the Islands got the Bluka Bluka! Bluka Bluka!\nThe Bluka Bluka the Bluka Bluka!", "year": null}]}