{"artist": "Boondox", "songs": [{"album": "South of Hell", "title": "Nothing to Lose", "year": "2010-05-11", "lyrics": "[Verse 1]\nSittin' in my cell, this brick and bar hell\nDreamin' of the days of murder and locked in cartel\nDrive bys, date rapes and weight like bar bells\nI slit my girls throat dumped in McCart's well\nOh well, it's what i thought at the time\nCause in my own mind, it didn't like a crime\nIt seemed to be fine, all it was, was good times\nShoot a bitch, snort a line at the drop of a dime\nMatter of fact the local mob was my first job\nIt's kinda easy when you killin' to rob\nAt least I wasn't sittin' home being a slob\nI got up off my ass started climbin' to the top\nThey callin' me a demon and I'm asking how can I be\nI know I got a heart, just lack of humanity\nBut now my sanity is something I ain't seen in a while\nSittin' on death row, this is my green mile\n\n[Hook]\nLocked up ain't where I wanna be\nConfined in my mind is like a prison to me\nSince birth had nothin' to choose\nI'm on the run with a gun with nothin' to lose\n[2x]\n\n[Verse 2]\nChildhood is the blame, poverty stricken\nAcid defacs in the mix and watch the plot thicken\nI was sick of being poor, sick of just living\nSick of depression and that trailor park prison\nThat mama had me struckin' and where was my dad\nI think that he forgot about the son that he had\nSo the chances of survival were none to slim\nAnd mama keeps saying I remind her of him\nSo if I'm just like my dad then I'm going to be broke\nPulled a kick door, stabed my neighbour in the throat\nI set off on my journey to see what I could find\nI watched scarface and knew the world was mine\nAs far back as I recall I was fearless\nBut now my death is near and it's clear that I fear this\nI know that satan is waitin'\nAnd I ain't found heaven\nSo I put my salvation in this chrome Mac 11\n\n[Hook]\n[2x]\n\n[Verse 3]\nIt's about that time, I hear 'em comin down the line\nMy cell door slides and I'm hopin' that it will bind\nI gotta make my move, it's the needle of death\nAbout to shoot me in my veins till I take my last breath\nCold sweat breads bubble up, I can't stop shakin'\nI gotta do something, keep thinkin', thinkin', thinkin'\nI'm gonna die either way, nothing to lose\nI look him dead in the eye then I make my move\nI kicked the guard in the sternum, not a second to wait\nThe strenght from my adrenaline caved his chest plate\nI hit the next guard in the face with my shackles\nPaint the walls dark red with blood and bone spackle\nKnocked the next off the C block balcony\nI snatched a tazer gun, home free I'm about to be\nMade a run for the door, I didin't look back\nI got shot in the back of my head and...\n\n(What the fuck!? Did you get him?\nBack up! Check his pulse!\nIs he dead?\nBrandy, get over here, we need some help!\nWhat happened?\nJust move!\nC'mon, alright, backup!\nShit! Son of a bitch!\nHe just... He just jumped up!)\n\n[Hook]\n[2x]", "image": "https://images.genius.com/065e7cb2b70fad281b6176257886e84e.500x500x1.jpg"}]}