{"songs": [{"image": "https://images.genius.com/cc60009fe3a8e9f4e0bf0ecb050bb51a.1000x1000x1.jpg", "title": "Everybody Shut Up (I Have an Erection)", "album": "Strawberries and Cream", "year": "2013-04-15", "lyrics": "Oh my god, Stacy!\nDid I tell you about my date with Steve last week?\nYou went out with Steve? He's so cute!\nI know! He took me out to this little restaurant-\n\nEverybody shut up!\nI have an erection\nIt only happens 87 times a day\nJust stop what you're doing\nAnd witness penis perfection\nThis is more important than what you have to say\nYour story can wait, cause I am very erect\nNow let's all take a minute to watch my dick and reflect\nYour spirit's in peace, no need to call the police\nPlease hold your applause\n\nIn conclusion, your honor, in light of this new evidence\nI would propose that the murderer was not my client, but...\nMrs. Donnovan!\n\nEverybody shut up\nI have an erection\nIf Justice is blind, she's gonna miss this display\nIt's hard as steel but still evaded metal detection\nThis is more important than what you have to say\nJudge, don't give me that robe, cause then nobody could see\nThis pillar of awesome that's sticking straight out of me\nWho could argue a case with so much dick in your face?\nPlease hold your applause\n\nDo you ever take a moment\nAnd look up at the stars?\nAnd think about your life\nAnd just how stupid you are\nIf it makes you feel better\nI'm a fucking rock star\nWith an amazing penis\n\nBut enough about you\nLet's focus more on my crotch\nIt's as tangy as whiskey\nAnd hits you harder than scotch\nYou might not get what I'm sayin'\nSo just sit back and watch\nLook! (Gasp!) It's still my penis!\n\nLadies and gentlemen, as president of the United States\nI must sometimes make grave decisions\nI come to you today to tell you that the United States has decided to declare war on-\n\nShut up!\nMr. President, I have an erection\nHere's a tricky dick that cannot be impeached\nCheck out my nutsack, it could swing an election\nThis is more important than your boring-ass speech\nFor one nation, indivisible under God\nWe all stand together and peep my glorious rod\nHey those guys look fun, oh wait, are they holding guns?\nPlease hold your-"}], "artist": "Ninja Sex Party"}