{"artist": "Will Smith", "songs": [{"year": "2005-03-29", "lyrics": "[Intro: Snoop Dogg]\nSnoop Dogg, Big Will\nAy lil' homey you need to pump ya brakes\nReal talk, we came to have a good time\nWe ain't got all that time for all that\nMan homey look pump ya brakes\nNow slide right, and just pump ya brakes\nWe'll holla at you in a minute\nF'real, ha ha pump ya brakes\n\n[Verse One: Will Smith]\nAll this excess stress I can't take it\nSlow that thing down, pump ya brakes kid\nWhy you gotta be all up in the face kid?\nThe ABS'll get you numbers and a name, kid\nI mean really, houndin' on girl\nWas that really necessary, see your itinerary\nIs all off, you need to be hauled off\nShe start flippin, she ain't trippin, it's your loss\nThis a simple case of a anti-brake pumper\nYou don't have to talk to women bumper to bumper\nThat mighta got you a couple numbers when you were younger\nBut dude switch your whole approach, that ain't proper\nBe a gentleman and try to be gentle man\nThe essence of stimulation mental man\nBut if you actin like you just got out a kennel man\nPut your foot on the pedal and, pump\n\n[Hook: Snoop Dogg]\nIf your girl in your face then she out of place\nWhat you need to tell her is pump ya brakes\nNow if you out but your girls they pressin' you hard\nWhat you need to tell 'em is pump ya brakes\nNow if you underage and you actin all grown\nWhat you need to do is pump ya brakes\nIf you offended by this record and you know it's you\nWhat you need to do is pump ya brakes\n\n[Verse Two: Will Smith]\nOutside the restaurant, girl sees boy\nGirl likes boy, girl meets boy (boy)\nBoy doesn't know that girl thinks he's fly (fly)\nBoy's a nice guy so boy says hi (hi)\nBoy's girlfriend returns from goin to park\nShe sees them together this ignites a spark (what?)\nBoy's girlfriend has a real loud bark\nNow this is where the pumping of the brakes should start\nGirlfriend thinks that somethin's goin' on\nGirl tells girlfriend nothin's goin' on\nBoy in the middle of the commotion beginnin'\nGirlfriend mad cause boy keeps grinnin'\nNow why is he grinnin'? But that's beside the point\nGirlfriend she chill 'fore they rolled up in the joint\nJumpin to conclusions get you nowhere honey\nPump ya brakes or be a crash test dummy\n\n[Hook]\n\n[Verse Three: Snoop Dogg]\nRule #1, is just like 2\nThe who-dos and what-nots and what you should dizzoo\nNo loud talkin', no back talkin'\nIf you do either believe it you back walkin'\nI hate to sound rude but then again I have to\nMy rap bang and my mack game it'll smack you\nClick-clack you, spit at you\nI don't do it cause I want to, I do it cause I get to\nI gotta question to ask you\nWould you fall, stand tall, ball, or let him smash you?\nIf I was you, and you was I\nWould you keep it G, or would you stay fly?\nIf you was rich, in a ditch, livin low, would you push the button\nKeep it cuttin, or would you just let it go?\nCalm down lil' homie\nAnd know what you dealin wit before you run up on me\n\n[Hook]", "image": "https://images.genius.com/6316c5796ba4fc715646a6a339a0c84d.220x220x1.jpg", "album": "Lost and Found", "title": "Pump Ya Brakes"}]}