{"songs": [{"lyrics": "[Man talking]\nOk, we got the Birdman in the building (the birdman)\nWe got Killa in the building (yeah)\nWe got Young Weezy in the building (Weezy)\n\n[Verse 1: Lil' Wayne]\nNigga it's, B-M, J-R, Weezy baby\nTryna see him, naw, he need to even eighty (shut yo chips up)\nAnd, I ain't speakin G's, I'm talkin M\nAnd I'm walkin like a pimp in (piiiiiimp) them all street tims\nMan shorty got more green than a Boston Gems\nGreen (?) , they don't cost in rims\nWayne appear, nigga put a walls in ya ear\nLet ya know a fuckin boss up in here\nHow much it cost for this here?\nHow much it cost for this year?\nCuz Me and Stunna bout to buy it\nPut yo spoons down, Cash Money off the diet\nI pass in a ride on triot, that's traze\nBut those who was in the days when the teachers was on that pay\nI'm raise in the cajun cage, with a bit of amazing grace\nAnd prone to move coke at a amazing pace\nMan my daddy super Dave, let's race it\nReal not have me, B I'ma win it, I'm a champ\n\n[Chorus: TQ]\nIn the ghetto life, I'm a ghetto boooooy (ghetto booooooy)\nLivin in the ghetto me, in the ghe-tto streeeeeets\n(Somebody tell me what's crackin before)\nI'm a ghetto life, any second dogg I can blow uuuuuup\nFor ghetto me, and you best to be watchin me\nGhetto, ghetto, Ghetto Life\n\n[Verse 2: Baby]\nAye, aye, holla at me T-Keez, T-Keezy, Birdman, Birdman\nSee I ride in them shake (34's) when I'm pimpin these hoes (beyotch!)\nIt's just that, (TQ:Sunshine City!) when I'm smokin that dro\nWhen it comes to this ice, real livin his life\nGet moeny, pimpin hoes, with these ghetto type\nNigga check the background, I got O.G. stripe\nJust a hoodrich nigga flippin birds on a bike\nNot survive in this world with guns, pahs, and knifes\nPour out, a lil' liquor, mami lost her life\nAll my niggas in the penitentiary holdin that life\nSee I'm stunnin for my niggas with this chromed out pipes\nThis swish interry foreign german lifes (beyotch)\nAnd I keep this big toolie just protect my ice (holla at me nigga)\nI act, a damn fool, when I'm full of that white (absolute beyotch)\nBut it's the Birdman daddy with these ghe-tto stripes\nGhe-tto hood (Uptown), Ghe-tto pipe (9 Millimeter)\nGhe-tto walk (yeah), With my ghe-tto life (Beyotch)\n\n[Chorus: TQ]\nIn the ghetto life, I'm a ghetto boooooy (ghetto booooooy)\nLivin in the ghetto me, in the ghe-tto streeeeeets\nI'm a ghetto life, any second dogg I can blow uuuuuup\nFor ghetto me, and you best to be watchin meeeee\nGhetto, ghetto, I'm a Ghetto Life\n\n[Verse 3: Cam'Ron]\nUh-huh, Diplomats, man listen\nAyyo the duck just born, I need seven more leaders\nC-Five, Fo'-Fum, and a Seven-Fo' fever (what else)\nAct up though I let the Fo' fever leave ya (leave ya)\nDice game, head crack, Six-Fo' fever (fever)\nWhen I'm in L.A., I got Six-Fo' fever (fever)\nFever for the flava of a six-foot diva (let 'em know)\nI told the po to feave her, I'm a bouty crook\nOut to juuust, not a chef (?) know how to cook\nWith the piece stocks, cook up the rocks\nSeventh Delenix is hot, I done cook up the block\nSend Glocks to ya block, out done cook up yo sspotss\nThat's how coke for that cook up his watch (what else though?)\nI'm one of those, that will look up to Pac (why?)\nCuz when I get pulled over, cook up the cops (damn, follow what)\nAll they say is, look at his drop (what else?)\nHand on my liscence, look at his watch (fuck em)\nBut, thug shit dogg, we down with Baby (baby)\nWe come through clownin baby (baby)\nAnd if we, surrounded babies, ducktape the kids to the wall\nThen shoot circle all around the baby, Killa!\n\n[Chorus: TQ]\nIn the ghetto life, I'm a ghetto boooooy (ghetto booooooy)\nLivin in the ghetto me, in the ghe-tto streeeeeets\nI'm a ghetto life, any second dogg I can blow uuuuuup\nFor ghetto me, and you best to be watchin meeeee\nGhetto, ghetto, In a Ghetto Life\n\n[Cam'Ron talking]\nIt's nothin man, Killa!\nDiplomats, Cash Money\nBaby, holla!\nJim Jones, Santana, what's good, Roc-a-Fella\n(brrrrrrrrr-brrrrrrrr!)\n\n[Man talking]\nBirdman\nFly, to hood near you\nThen they got 'em cheap (whoo!)\n(Yeah, ya know, ya know)\nGet that call out one more time\n(brrrrrrrr-brrrrrrrrr!) 3x\n*beat fades*", "title": "Ghetto Life", "album": "4R0:20", "image": "https://images.genius.com/781de2d8147d22cdb2a6386959f3d93d.300x300x1.jpg", "year": null}], "artist": "Afroman"}