{"songs": [{"image": "https://images.genius.com/a7e990f0bc468cba699c9556d1af08e8.999x999x1.jpg", "lyrics": "[Verse 1]\nI'm so spectacular\nA Valentine's massacre recorded on the 14th\nNo blood do the vascular\nCold-blooded coke on with my heart on my sleeve\nFuck rhymin' for friends, I do this shit for the cheese\nPlay my record, how much does it take?\nSpin my shit on them plates\nWhat's the wait, ain't I great?\nI love them 808s and techno breaks\nBut I prefer those them dusty crates\nU.G. comes pure, it's time to elevate\n\n[Chorus]\nYo, I see you watchin' me, nigga\nIt's like the whole world is watchin' me, nigga\nI see you watchin' me, nigga\nThe whole world watchin' me, nigga\n\n[Verse 2]\nThrough the lens of a microscope, the world stays watchin'\nMagnified ten times to see if I'm live\nNiggas lookin' through the peephole get shot in the eye\nWiseguys, see what happens when you tell them lies?\nCameras on the corners, feel the heat up on my shoulders\nA potential [?] tell them police those days is over\nThe income's reported, the fans have supported\nThe guns are now legal and my papers are in order\nI bust for my daughter, fuck with her, it's a slaughter\nY'all keep pushin' my limits and my temper is shorter\nSituations get dealt with and the whole world's watchin'\nI can move like a criminal but you won't get that option\nFrom pennies make porcelain only triples my fortune\nWatch your hands in the pot 'cause the product is scorchin'\nShe smellin' good at the auction and the whole world's watchin'\nEvil eye stay blind with their soul's awry\nBut tonight you get a pardon 'cause I'm sittin' at the Garden front row with the elite\nI had to pass it to my squadron\nI don't do this often 'cause in public I'm cautious\nYou can't fuck with my money, the world is my office\n\n[Chorus]\nYo, yo, stop watchin' me, nigga\nYou, you, and you, the whole world watchin' me, nigga\nYo, and the whole worlds watchin' me, nigga\nI see you, you, and you watchin' me, nigga", "title": "Whole World Watchin’", "year": "2018-03-30", "album": "Venom"}], "artist": "U-God"}