{"songs": [{"year": "2016-02-15", "album": "To Pimp a Butterfly", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg", "title": "Grammy 2016 performance", "lyrics": "[Part I: The Blacker The Berry]\n\n[Verse]\nI'm the biggest hypocrite of 2015\nI'm the biggest hypocrite of 2015\nWhen I finish this if you listenin' sure you will agree\nBeen feeling this way since I was 16, came to my senses\nYou never liked us anyway, [bump] your friendship, I meant it\nI'm African-American, I'm African\nI'm black as the moon, heritage of a small village\nPardon my residence\nCame from the bottom of mankind\nMy hair is nappy, you know that it's big, my nose is round and wide\nYou hate me don't you?\nYou hate my people, your plan is to terminate my culture\nYou know you're evil I want you to recognize that I'm a proud monkey\nYou vandalize my perception but can't take style from me\nAnd this is more than confession\nI mean I might press the button just so you know my discretion\nI'm guardin' my feelings, I know that you feel it\nYou sabotage my community, makin' a killin'\nYou made me a killer, emancipation of a real higga\n\n[Interlude]\nAs we proceed\nTo give you what you need\nTrap our bodies but can't lock our minds\nEverybody just stop\n(The bigger I shoot)\n\n[Hook: Assassin]\nI said they treat me like a slave, cah' me black\nWoi, we feel a whole heap of pain, cah' we black\nAnd man a say they put me in a chain, cah' we black\nImagine now, big gold chain full of rocks\nHow you no see the whip, left scars pon' me back\nBut now we have a big whip, parked pon' the block\nAll them say we doomed from the start, cah' we black\nRemember this, every race start from the block, just remember that\n\n[Interlude]\nAs we proceed\nTo give you what you need\nLock our body, can't trap our mind\n\n[Part II: Alright]\n\n[Hook]\nWe gon' be alright\nWe gon' be alright\nWe gon' be alright\nWe gon' be alright\nWe gon' be a-\n\n[Verse 1]\nUh, and when I wake up\nI recognize you're lookin' at me for the pay cut\nBut homicide be lookin' at you from the face down\nWhat Mac-11 even boom with the bass down\nSchemin', and let me tell you 'bout my life\nPainkillers only put me in the twilight\nWhere pretty women and women, and it's the highlight\nNow tell my momma I love her but this what I like, Lord knows\n20 of 'em in my Chevy, tell 'em all to come and get me\nEverything I know, karma comin' heavy\nNo preliminary hearings on my record\nTell em' other gangsters silence for the record\nTell the world I know it's too late\nBoys and girls, I think I gone cray\nDrown inside my vices all day\nWon't you please believe when I say\n\n[Pre-Hook]\nWouldn't you know\nWe been hurt, down before\nWhen our pride was low\nLookin' at the world, \"Where do we go?\"\nI'm at the preacher's door\nThey wanna kill us dead, at the preacher's door\nWe said give 'em some more\nThis one time, do it fo' sho\nBut we gon' be alright\n\n[Hook]\nWe gon' be alright\nWe gon' be alright (hello)\nWe gon' be alright\nDo you hear me, do you feel me? We gon' be alright (P!)\nWe gon' be alright (hello)\nWe gon' be alright\nWe gon' be alright\nDo you hear me, do you feel me? We gon' be alright\n\n[Verse 2]\nWhat you want, you a house, you a car?\nAcres and a mule, a piano, a guitar?\nAnything, see my name is Lucy, I'm your dog\nYou can live at the mall\nI can see the evil, I can smell it, I know it's illegal\nI don't think about it, I deposit every other zero\nDiggin' in my pocket, candy paint it on the Regal\nDiggin' in my pocket, ain't a profit big enough to feed you\nEveryday my logic get another dollar just to keep you\nIn the presence of your chico... ah!\nI don't talk about it, be about it, everyday I sequel\nI don't talk about it, 'bout it, everyday I see\nI don't talk about it, 'bout it, everyday I see\nI don't talk about it, 'bout it, everyday I see\nPet dog, pet dog, pet dog, my dog, that's all\nPick back and chat, I trap the back for y'all\nI rap, I'm black on track so rest assured\nMy rights, my wrongs; I write 'til I'm right with...\nGod\n\n[Part III: Untitled 5]\n\n[Verse]\nIt's been a week already\nFeeling weak already\nGot me at peak, possibility of what could be\nSituation is heavy, I've got to prove\nOn February twenty sixth I lost my life too\nIt's like I'm here in a dark dream\nNightmare, hear screams recorded\nSay that it sounds distorted but they know who it was\nThat was me yelling for help when he drowned in his blood\nWhy didn't he defend himself? Why couldn't he throw a punch?\nAnd for our community do you know what this does?\nAdd to a trail of hatred\nTwenty twelve was taped for the world to see\nSet us back another four-hundred years\nThis is modern day slavery\nThe reason why I'm by your house\nYou threw your briefcase all on the couch\nI plan on creeping through your damn door and blowing out\nEvery piece of your brain\n'Til your son jumps into your arms\nCut off the engine then sped off in a Wraith\nI'm on the dash with my bible in the trunk\nHad the vodka on the top\nHow come I can long time\nHow come I could make it popular?\nPuff on what I want\nHow come I could make it popular?\nPuff on what I want\nSee I'm living with anxiety\nGiving up sobriety\nCussing with his sister\nAnd playing with society\nJustice ain't free\nTherefore justice ain't me\nTry and justify staying, obituary\nWhy you wanna see a good man with a broken heart?\nOnce upon a time, I go to church and talk to God\nNow I'm thinking to myself\nHollow tips is all I got\nNow I'm drinking by myself\nAt the end of Section Park\nCaught you when you walk besides your house\nYou threw your briefcase all on the couch\nI plan on creeping through your damn door and blowing out\nEvery piece of your brain\n'Til your son jumps into your arms\nThe engine then sped off in a wraith\nI said Hiiipower, one time you see it\nHiiipower, two times, you see it\nHiiipower, two times, you see it\nConversation for the entire nation this is bigger than us"}], "artist": "Kendrick Lamar"}