{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "(talking)\nHaha, Y'all thought this was Dragnet, didn't you?\nWrong answer again\nThis song is for all the mothafuckin' chicken-head bitches\nAnd we kept the mothafuckin' names the same\n'Cause we think being a bald-head bitch is a goddamn shame\n\n[Verse 1]\nWhat the fuck is goin' on in this goddamn world?\nWhat are you, bitch? A boy or a girl?\nI can't tell 'cause your shit on the sides are gone\nYou remind me of that monkey-lookin' bitch Grace Jones\nFucked up is how you look to Willie D\nI just gotta have a bitch that has more hair than me\nSome try to cover up by weavin' it through\nYou ain't foolin' nobody\nWe know you're bald-headed, too\n\nChorus:\nBald-head hoes\nWhatcha see D, w-w-w-whatcha see D\nI see some bald-head hoes\nBald-head hoes\nWhatcha see D, w-w-w-whatcha see D\nI see some bald-head hoes\n\n[Verse 2]\nThere should be a crime against bald-head hoes\nWhy they want to be bald?\nNobody knows!\nBeing bald makes a gal look like a beast\nStupid-ass hoes, ain't ya heard of grease?\nHell naw\nCause if you did, you'd have some up there\nLike your pussy, you gotta give it proper care\nEvery time I look around, I see a damn disgrace\nMotherfucking wig pieces all over the place!\nIt's from them (bald-head hoes)\nThey just so damn mean\nThe meanest-ass hoes I ever seen\nAin't got no hair, so they act crude\nAnd wanna go and pick a fight with the girls who do\nAm I right? (You right.)\nHell yeah I'm right!\nI've seen this shit, night after night\nInstead of wearin' other people's hair, you dumbass bitch\nYou need to buy some dog mane, and grow your own damn shit!\n\nChorus\n\n[Verse 3]\nNow I just can't go with a bald-head hoe\nYou ain't gotta ask why for me to tell you so\nIf I can't run through her hair with my hand\nSomehow it seems like I be fuckin' a man!\nSo stay away you bald hickies\nI know you out there\nTalkin to you hoes who ain't got no hair\nYour sister bald, Zanny\nYour mamma bald, Eddie\nI bet you even got a bald-headed-ass granny\n\nChorus\n\n(talking)\nNow this is how you spot a bald-head hoe\n\n[Verse 4]\nHair spots on a hot sunny day\nToo many gaps in the scalp is a dead giveaway\nI saw no-hair Clair\nYesterday on the cut\nToday I saw the girl, her hair was down to her butt\nI hope that she know, that I know it ain't real\nBut I won't squeal not even on Andrea\nKim, Shawn or Merylinn\nNor Tamika and Rika—the famous bald-head twins\nSomething must be done\nAbout these citizens\nYou ask what will I do to support my fellow man?\nI'm proposin' a bill\nTo Capitol Hill\nTo kill all bald-headed women at will\n\nChorus X2", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "Bald Headed Hoes"}]}