{"artist": "360", "songs": [{"album": "Vintage Modern", "year": "2017-07-18", "title": "Dem Gainz", "image": "https://images.genius.com/34faec5db53e64ae085b8595c65d3c38.960x960x1.jpg", "lyrics": "[Verse 1: 360]\nAyy\nI was smashing Skittles any minute I can (I was)\nUntil I started looking like the Michelin Man (I did)\nSo now every day I hit the gym in the tan\nSo I can be heavily armed without a pistol in hand (Let's go)\nAny form of exercise, there isn't a plan (Nup)\nIf Jesus walked on water then I'm swimmin' on land\n(Check this cunt out) It doesn't matter when I listen to trance\nI can't help but break into this ridiculous dance\nIt's like a faster running man, but I'm kicking and flicking my hands (Woo)\nUnderstand I'm the shit and I think I'm the man (I do)\nYeah, bulking on these motherfuckers\nIncredible Hulkin' on these motherfuckers\nI'm the dude in the gym, training his upper body\nWith pants on 'cause downstairs there's nothing on me\nCheck my damn pins, not a damn thing\nYo, my hamstring actually looks like an actual fucking hamstring\nThe damn gym's the only thing that I'm advanced in\nBustin' out reps in the tempo that I dance in\nIncredible back, impeccable traps\nAnd when I'm topless I'm never relaxed, I'm flexing my abs ([?])\nIn cardio I'm the best on the map\nI even forget where I'm at to give my memory laps (Think about that)\nI'm so obsessed with fitness that I'm the definition\nWhen I rap, I even get the record skippin'\nI got a thick neck, but shit legs, ayy?\nDo some fuckin' squats then, Nah, I got a big headache\nAh, typical 6 fuck, skip leg day\nCunt, we'll do it tomorrow, man, I'd rather hit chest, ayy (You fuckin' pussy)\nI do ten sets on the bench-press\nThen do ten reps on the peck deck, I've got the best chest\nAnd if you want the same then listen to your sensei\n(Do it) Yeah, fuckin' 6 is really making sense, ayy?\nYou want the best shape? Go and get your chest great\nFuck your legs, mate, only worry about your pecks, ayy\nYou gotta work out the best way, where every day is chest day\nYeah, it's Forthwrite, Dem Gainz\n\n[Chorus 1: 360]\nIf you wondering where 6 been lately\nYou can catch me at the gym, baby\nIt shows I got my pecks so strong\nEverybody sayin' that my chest so bomb (This cunt's massive)\nI know you prob'ly thinking this shit's crazy\nUpper body is the shit, baby\nYou know I got my headphones on (Check it out)\nWon't believe that it's a techno song\nJust leave me alone (Yeah)\n\n[Verse 2: PEZ]\nThe moment that I walk in the gym\nYou're like, \"What the fuck's my girl doing talkin' to him?\" (Sup babe)\nA workout's better the shorter it is\nSo I'm calling it quits before it begins\nWalk straight up and disconnect the exercise bike\nSee people looking mesmerised when I ride by (Bye)\nFrom the time I was born, I was never quite right\nYou wanna hide your flaws, I'm tryna emphasise mine\nSo while they try and get all energised, I\nDon't give a fuck about my tris and my pecks and my bis (Nah)\nI'm tryna blend in with the rest of my kind\nAnd look like every white guy I've ever met in my life (Okay)\nLookin' skinny on these motherfuckers\nSee my arms? Muscles are mini on these motherfuckers\nAll these lames say it's gain season (It is)\nNah, I'm tryna find ways to train so my frame weakens\nThat's a main reason I spend the whole time\nI'm here walkin' 'round, daydreaming in a daze schemin'\n'Cause time is money and shit's expensive\nSo I ain't leavin' till I break-even, yeah\nIt's hard to summarise it, but well\nIn a nutshell, I won't touch a dumbbell\nI'd rather walk up on these dickheads who are big and buff\nWhile they're standing in the mirror and then interrupt ([?])\nI hear 'em call me skinny like I give a fuck\nI'm 'bout to get a nip and tuck just so I get skinnier\nI idolise those skinny runts bumming ciggies in the city, bruh\nAnd I'm not giving up till I look similar\nAnd this is sincere, I been at this gym for six years\nPeople wonder why I'm even in here\nIt's 'cause I hate workin' upper body, man, I can't take it\nBut if there's legs bein' worked out then I'm partaking\nSee me half-baked in my apartment\nStark naked, doing calf raises till my heart's racin'\nAnd I'll start pacin' till my feet'll hurt\nAnd do a shitload of cleans, I don't need the jerk\nI'll even spend a whole night in a squat rack\nHow many reps is that, PEZ? I don't know, I lost track (Fuck it)\nI want my top half lookin' like I'm on crack\nBut I want my glutes and my calves and my quads jacked\nAnd if you want that too here's a template (Yep)\nTo get your flex game better than your best mate (How?)\nYou gotta workout the PEZ way and only train on leg day\nForthwrite, Dem Gainz\n\n[Chorus 2: PEZ]\nIf you wondering where PEZ been lately\nYou can catch me at the gym, baby\nYou know that when I flex those quads\nThey're sayin', \"How'd you get your legs so strong?\" (Check out his fuckin' pins)\nI know you prob'ly thinking this shit's crazy\nLower body is the shit, baby\nYou know I got my headphones on (Yeah)\nBest believe that it's a techno song\nJust leave me alone"}]}