{"artist": "Wale", "songs": [{"title": "Black Bonnie", "year": "2018-03-13", "lyrics": "[Intro: Wale]\nYeah\nThe older you get, man, the more you appreciate, you know\nThe real babes\nThey don't get offended when you say shit really\nAyo, we good? Let me know when that drop\nYeah, louder (Hol' up)\n\n[Verse 1: Wale]\nTalk to me different, let's come up together\nFuck yo' ex nigga if you fuck me better\nLet's go to Neiman's, let's go to Lenox\nSpend a whole check and run a play to get the next one\nLet's create the vibe, let's not take our time\nLet's spray paint the Trump Towers, letters U and I\nIt's you and I 'til it's suicide\nOr 'til the cra— pull us over and no one around, bang\nWe woke, shawty, protest and party\nI know you love nostalgia, I got you Barney's\nGet it? My bitch witty, her bitches with it\nA snake is on the slippers if the snake ever get near me\nPlease tell me I got you, that's all for intuition\nShe tell me \"I got you\", I trust her intuition\nAnd I promise to God I follow her intuition, so\nI tell her I got her with Prada and tuition, hold up\n\n[Chorus: Jacquees & Wale]\nCan you be someone, I can hide my fears with\nAnd if they got us on the run, we could still chase our dreams\nBlack Bonnie, yeah, yeah\nDo I see my black Bonnie? Yeah\nMy black, Bonnie, Bonnie, yeah (Bonnie, talk to 'em)\n\n[Verse 2: Wale]\nI'll talk to you different, but never extra\nShe like the fact I get aggressive but I'm not possessive\nBad, but she modest, nasty and honest\nBlack Bonnie Parker, black Bonnie Rotten\nCash at the stash spot, she never snatch a quarter\n'Cause loyalty is e'rything and e'rything before it\nThe world never love me 'cause girls only lust\nBut you a woman, I got no will to show me to trust\nBang, I'm woke, shawty, I'm growin' and maturin'\nOf course we not bank robbers, they hate us 'cause we colored\nReally should leave the city, really would if you with it\nReally could never get lost, I follow what you feelin', yeah\nShe tell me, \"I got you, I got this intuition\"\nAnd I tell her my body count ain't nobody business\nAnd I promise to God I follow her intuition, and\nGraduated from Prada, now Bonnie got the wisdom (Black queen shit)\n\n[Chorus: Jacquees]\nCan you be someone, I can hide my fears with\nAnd if they got us on the run, we could still chase our dreams\nI just need someone (I just need), I can hide my fears, baby\nAnd if they got us on the run, we could still chase our dreams\nBlack Bonnie, yeah, yeah, I see\nDo I see my black Bonnie? Yeah, I see\nDo I see my black Bonnie? Yeah, I see you\n\n[Outro: Wale & Jacquees]\nLook, shawty\nI know we not felons but I definitely see you as my best friend, confidant and co-defender (Do I see my black Bonnie?)\nBefore that, you deserve every word of this (I see)\nReal life sentence\nForever my ride or die\nNever high, love Clyde\n'Til next time", "album": "Wow... That’s Crazy", "image": "https://images.genius.com/bd1dbfedbdb01582a9faa8b4c3cd9330.355x355x1.jpg"}]}