{"artist": "AZ", "songs": [{"title": "I Don’t Give a Fuck Now", "image": "https://images.genius.com/579dc32ea6426424aac167e07908b6e9.240x238x1.jpg", "album": "S.O.S.A. (Save Our Streets AZ)", "lyrics": "[Hook: Nas samples (AZ)]\n\"I was destined to come\" (Yeah)\n\"What you expect?\" (Quiet money for life) \"I don't give a fuck now\"\n(The so-ciety game returns) \"As a clever nigga, nuttin to play with\"\n\"Thank God he blew breath in my lungs\"\n(Urban wars) \"I was destined to come\" (Dream Team baby)\n\"What you expect?\" (Fall back y'all) \"I don't give a fuck now\"\n\"As a clever nigga, (I Don't Give a Fuck) nuttin to play with\"\n\"Thank god he blew breath in my lungs\"\n\n[AZ:]\nI'm known global, blooded out pimp by coastal\nRap mobile, low key, anti-social\nSmoke gray Timbs, criss fade, wave to sin\nWhite Denali, teared it up, flagrant rims\nI'm no thief, I live by the code of the streets\nI hold heat, but no need to go in the deep\nDon for real with the same gotti traumata pill\nVon o niel, embraced by the arms of the ill\nArt of war, a hundred men, cars galore\nWanted men, who couldn't see in robbin the law\nLive or not, I'm one half divide the block\nAnd I can show you how to take cash and bribe the cops\nAnd from the bars to the backyards, alleys and aves\nSubtracted, divide, add up, tally the math\nStand direct, for dolo demand respect\nHand solo, sit back and watch the plans connect\nYa heard\n\n[Hook: x2] (without ad-libs)\n\n[AZ:]\nI rock coogies but need fatigues, holdin the cock oozie\nThe block school me, cuties drop your doobies\nIt's on now, some claim I'm wrong but how\nBeen indited so watch, rhyme, pull on my trial\nBlow with me, I'm like the life of that old 50\nI dose quickly, moves is so shifty\nDays been broke, on corners with them trays of coke\nIt was the dirty hustle money that raise my folks\nTights from jail, few niggas might see bail\nIt's kinda foul when you watch niggas wifies tell\nFlip-on who?, I still wore wrist on blue\nYall know my style, M.I.A. but I miss yall too\nTryin to remain breathin, hot blocks never change seasons\nBodies get caught for the strangest reasons\nBreath the smoke, and time for me is need to coke\nWon't stop till I stack it all and flee the coast\n\n[Hook: x2]\n\n[AZ:]\nSo now I toast, to all my close niggas that's ghost\nYall know the sos only soft niggas worry the most\nCome and get me, shit, I'm nasty like Ken Griffy\nNiggas is sissies, I bought some men with me\nWait til the Heny' hit me, hope that sin lift me\nNever smile, style is wild, only grin strictly\nYour main supplier, for days in the same retier\nSat and watch niggas used to get it again and expire\nDeep in thought, spit it like a street report\nI rep alone still I stand without no feet support\nFuck the threats, I rip necks of suckin a tech\nEither that or ice picks stuck in ya neck\nI play different I put a work stay consistent\nI love paper, plus a nigga praise commitment\nDead the jokes I'm near when the bread get boast\nSo fuck me, ask your bitch who get head the most\n\n[Hook: (AZ)]\n\"I was destined to come\" (Ya heard?)\n\"What you expect?\" ('Chall niggas want?) \"I don't give a fuck now\"\n(It's on) \"As a clever nigga, nuttin to play with\"\n(It's time to yall get it) \"Thank god he blew breath in my lungs\"\n(The god has returned) \"I was destined to come\"\n(BK don) \"What you expect?\" \"I don't give a fuck now\" (So-ci, Visualiza)\n\"As a clever nigga, nuttin to play with\"\n(This is quiet money for life) \"Thank god he blew breath in my lungs\"", "year": null}]}