{"songs": [{"lyrics": "[Intro]\nYo Jamz turn me up I can't hear myself!\nTurn me up!\n\n[Hook]\nFucked around I pull a 4, I’m off a eighth\nI know bitches want to be me, a disgrace\nRan the game, was broke, I came up so they hate on me\nYeah, I’m a savage walk ‘round with a pretty face\nTook my brother had to get it on my own\nIn a city, played my shit they like my songs\nI’m a savage barbie, bad to the bone\nI’m a savage barbie, bad to the bone\nI’m a savage barbie, bad to the bone\n\n[Verse 1]\nHad a dream that I woke up in Japan\nSo my goal to fuck my nigga in Japan\nSwear that nigga he a groupie he a fan\nStood me up, I bounced back with like two hoes\nFuck that nigga get some money, you a slowpoke\nI got homies fighting cases, you want no smoke\nI shoot pistols what I spend is your tuition\nBitches fake, they switching sides, play your position\nDrive the mazzi in the winter, bitches bitter\nPut her on, she cross me once I grab my scissors\nThey ain’t say that I can’t fuck with you\nYou thought I was a dummy so you sat and got too comfortable\nTell me I’m the greatest, like you mean it, boy what’s up with you?\nDiamonds they wet like a pool, Christian Lou’s my shoes\nSmoking cool and soda saying, fuck the fame I’m still the same!\n\n[Hook]\nFucked around I pull a 4, I’m off a eighth\nI know bitches want to be me, a disgrace\nRan the game, was broke, I came up so they hate on me\nYeah, I’m a savage walk ‘round with a pretty face\nTook my brother had to get it on my own\nIn a city, played my shit they like my songs\nI’m a savage barbie, bad to the bone\nI’m a savage barbie, bad to the bone\nI’m a savage barbie, bad to the bone\n\n[Verse 2]\nRocking on that bitch, she be fucking all the opps\nFinessing, I hit a stain! I get paid to do a job\nLast year I was on my ass, left the hood the block is hot\nTaste me I’m like Fiji, taping upfront just to see me\nHigh class living take the PG, it’s some phonies wanna be me\nGive me brain, what you gon’ teach me?\nWatch your back, these niggas cheesy\nThey ain’t living how you living\nThey gon’ hate, I’m ‘bout my millions\nCome through AK on my side, like it’s Kung Fu\nAnd these niggas bust a move, it’s a must I pop you\nI just spent it on my swag, smoking on gelato\nPut a hundred on her ass, she think she a model\n\n[Bridge]\nWhite bitch do coke\nBoujee yeah, I’m the goat\nCuff no nigga, made him famous\nTalked about him in a song\nPut my feelings in my pocket, walk around with thirty on me\nRep the village, yeah, the realest, I got all these bands up on me\n\n[Hook]\nFucked around I pull a 4, I’m off a eighth\nI know bitches want to be me, a disgrace\nRan the game, was broke, I came up so they hate on me\nYeah, I’m a savage walk ‘round with a pretty face\nTook my brother had to get it on my own\nIn a city, played my shit they like my songs\nI’m a savage barbie, bad to the bone\nI’m a savage barbie, bad to the bone\nI’m a savage barbie, bad to the bone", "album": "Doll Szn", "year": "2018-01-08", "title": "Savage Barbie", "image": "https://images.genius.com/1bc7e0f8bd9f5e45d790f541cd279592.1000x993x1.jpg"}], "artist": "Asian Da Brat"}