{"artist": "Boosie Badazz", "songs": [{"album": "In My Feelings. (Goin’ Thru It)", "title": "Forgive Me Being Lost", "year": "2016-01-01", "lyrics": "[Intro]\nShit, I don’t trust nobody\nShit, So many motherfuckers with motives\nShit, you don’t know who to trust\nSo fuck it, everybody suspect\n(God, forgive me for being lost)\nI don’t trust no motherfucker but Boosie Badazz\n\n[Hook]\nIf rules get broke and niggas get crossed, forgive me for being lost\nIf pussy niggas get knocked off, forgive me for being lost\nDaddy thugging, cousin hustling, out the bottle drinking, fuck it\nGod, forgive me for being lost\n\n[Verse 1]\nMomma struggling, Granny watch us, gangster potnas, oh my\nCan’t afford it so we stole it, we were roaches, no lie\nSaw my first body dead in the street at 8, oh my\nLil Glen just blew his brains out with his own four five\n“Put it in the pot, make it lock ‘til it drop” is what my uncle told\nWent to cocaine school and got an A-, honor roll\nLove what my Mama showed to me and my brother (Love you Ma)\nTough love what my daddy showed made me and him tougher\nJust waking up every morning made me out a hustler\n‘Cause Granny house was the block where everybody sold butter\n(Woke up to) People dying, bullets flying, mommas crying, oh my\n80’s baby when it was coke crazy, no lie\n\n[Hook]\nForgive me for being Lost\nIf pussy niggas get knocked off, forgive me for being lost\nDaddy thugging, cousin hustling, out the bottle drinking, fuck it\nGod, forgive me for being lost\n\n[Verse 2]\nThey tried to give me life, said I’m bad for the community (no)\nHow I’m supposed to feel about some people trying to ruin me? (cold)\nWhy should I stop for the cops if they shooting me?\nWhile I get rich, my IRS friends using me (they’re using me)\nCold winters, why us? I need answers\nIf I sin, God forgive me, but my baby need pampers\nMy family need prayers, dear God, we’re on the blessed docket\nAuntie got cancer, my little cousin, he on Crime Stoppers\nI don’t know what you know, but all I know is what I learned\nPussy will kill you and 70 percent of these niggas turn\nSo my mind lost, I grew up fatal\nBig Rope, Growl Nitti, this is Cain and Abel\n\n[Hook]", "image": "https://images.genius.com/2164ea93fca3ae0361641a11ceda5ba2.412x412x1.jpg"}]}