{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro: Wrekonize]\nAlright, alright\nYeah\nThis a special one\nIt's the Winter Games Tour Edition\nWe live in ATL\nIn the house that WLPWR built\nShoutout to the norm\nI got all my family and friends in here right now\nWe’re having a good time right now\nWe drinking Crown\n\n[Verse 1: Wrekonize]\nWalking 'round these gritty grounds\nIn the streets we been getting down\nTouring from city to city we getting busy now\nWintery games playing it's rigid wow\nEnemies plain clothed to lift my sound\nEverybody down like we hit the ground\nYou see I been up on my nouns like i’m Mr. Brown\nWhat you in it for my rhythm's triple crown\nSo you gon' probably trip and drown when you flip the mound\nI been on it rocking since I was the clown\nSleeping in class feeling up all the girls that let me round\nEven when I was a youngin, I was bound\nTo find my calling even now, they in lost and found\nI got a sinner for Satan but he simmering in cinnamon and sick with no patience\nDoors kicking in, I'm sticking 'em like Ritalin patients\nWhat you really want from me, I can't give no more payments bitch\nBut I'm here to rock it like a Rolling Stone\nSpit daggers like Mick Jagger till I can't even hold my own\nI’m on my Badu shit, oh yes, I’m On and On\nOther rhymers mesmerized by their mobile phones\nI gotta billion other lines, not one poem is cloned\nI got a feeling you'll be fine if you know the code\nAnybody on they grind wanna go for broke\nYou know how to find me just be careful you don’t overdose\n\n[Verse 2: Bernz]\nI think I finally did it this time, right to the cliff line\nI might've finally jumped just to drown in the riptide\nI might've finally took a shot and then misfired\nWhat else would you expect from a serial sick mind\nI'm on the outside looking your way\nHoping that it ain’t the last time I get a taste\nEven though it might be last time that we embrace\nI just hope I ain't the last guy that you replace\nFrom the beginning I was broken\nBound to only be administered through in doses\nBut you never heeded the warnings, it was hopeless\nNow I feel like we floating somewhere in the ocean\nGoing through motions, broken\nWe never meant to hurt you but ain't no one to blame\nExcept my own narcissistic ways\nSo when I'm writing my apologies and trying to explain\nI'm only wishing for another first date\nBaby I can't wait\n\n[Outro: Bernz]\nMan, I can't believe it, I made it to a WrekWednesday\nCan you believe it?\nI just wanna say, let's keep the faith man\nLet's keep this shit going man and just know\nYou ain't gotta say it back, ay, ay, ay\nYou ain't gotta say it back, no\nYou ain't gotta say it back\nYou ain't gotta say it back, no\nYou ain't gotta say it back, ay, ay, ay, ay\nCome on, come on\nOne time, one time, ¡Mayday! in this motherfucker\nStrange Music in this motherfucker\nWLPWR in this motherfucker\nMy whole crew, Winter Games in this motherfucker\nMan, let's go!", "title": "Mornin Dew (Freestyle)", "year": "2019-02-27", "album": "#WrekWednesdays", "image": "https://images.genius.com/718cd7f8ba85c08dc889fc214dff62f6.500x500x1.jpg"}]}