{"songs": [{"year": "2012-10-01", "lyrics": "[Intro: 100s & Chippy Nonstop]\nShout out to Juvenille\nLet me get the keys to the Rover truck\nYuh, a hundred degrees\n'Cause I'm about that life\n\n[Verse 1: J Folks]\nBitch, I bet I wear that ass out\nPin you to a firm bed, hit it till you tap out\nBaddie, she turn heads, got 'em pullin' stacks out\nI ain't gotta earn head, I just pull the shaft out\nHit her with the python, now I got her wrapped up\nTreat it as an icon, so you know I strapped up\nHad her with her face down, poppin' with a clappa\nShot her with the dope dick, then, made her pack up\n10 from the waist down, and she make it back up\nAll these hoes want some, I'ma need backup\nBitches gettin' laid down, but they gettin' back up\nTryna get some mo', we tear they ass for showin' cracker\nBitch, you know we do this shit, slaggy to the dick\nWe don't always gotta fuck, we also should give you the lick\nI'ma do ya friend though, she gon' do the cowgirl\nKnow I'm gon' reverse that, yeah, that be my style, girl\n\n[Chorus: 100s & Chippy Nonstop]\nTold yo bitch, \"Bend over, let me look at that\"\nLike a thief who got caught, I made her put that back\nIs you 'bout that life, ho?\nBoy, I'm about that life (Bitchhh)\nTold the bitch, \"Make it wobble, I'ma break yo back\nAnd I'ma wake it up in shakes, so you can take yo nap\"\nYou ain't 'bout that life, ho\nBoy, I'm about that life (Bitchhh)\n\n[Verse 2: Chippy Nonstop]\nLet me show you a little trick\nHow I lick that stick\nFind a real bitch to hit that shit\nNo beatin' 'round the bush, take a hit of the kush\nI'ma get it off top, and make that baby push\nBeat it in the backseat, beat it in the trunk\nThis pussy a real treat, I'ma make you cum\n'Cause I'm about that life\n'Cause I'm about that life\n\n[Verse 3: 100s]\nGet 'em on my lap fast, 100s smoke, and drive past\nParty with your pussy out, and drop it with yo fine ass\nBuy me dinner, ho, 6'4 jiggalo\nNever with a limp dick, plug her with a stiff dick\nTell me how you want it, do you want it fast?\nDo you want a dick up in yo ass?\nBitch, put it on the glass\nDo you want it slow? Do you got a friend?\nCan she come with?\nHit her with the deep thrust, chop it till yo ass bust\n\n[Chorus: 100s & Chippy Nonstop]\nTold yo bitch, \"Bend over, let me look at that\"\nLike a thief who got caught, I made her put that back\nIs you 'bout that life, ho?\nBoy, I'm about that life (Bitchhh)\nTold the bitch, \"Make it wobble, I'ma break yo back\nAnd I'ma wake it up in shakes, so you can take yo nap\"\nYou ain't 'bout that life, ho\nBoy, I'm about that life (Bitchhh)\n\n[Outro: 100s & Chippy Nonstop]\nIt's that skinny nigga rockin' leather (Rockin' leather)\nGroupies all around me, tryna holler all the time\nNever fuck with skinny hoes, because our ribs'll run together\n'Cause I'm about that life\n'Cause I'm about that life", "album": "Ice Cold Perm", "title": "Bout That Life", "image": "https://images.genius.com/98d3e3369facf82ee69688c5e541f1f3.1000x1000x1.jpg"}], "artist": "100s"}