{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Stress", "year": "2003-06-24", "album": "The Entity", "lyrics": "[King Gordy]\nPeople wonder why\nI'm violent. Look at my life\nSee the things I go through\nI hope you know you\nAre a victim if you listen to this\nYou're ready to start a riot cuz you're feelin' this shit\nYour boss is getting on your goddamn nerves, ay?\nTalkin bout he ain't see you at work lately, stop hating and pay me\nSoon as I get it I shall get in my car\nPlay this song, my main attention is in the bar\n(YOU'RE A ROCKSTAR!)\nLet me get a try at the cops\nGive me that old number seven, Jackie Dan on the rocks\nGive me two, give me three, give me fo' here we go\nReady to blow, take what you like and sip it, yo\nFeeling invincible. Hittin them switches slow\nDrivin off in the night, pretty predictable\nAnd you think you got a worthless life?\nBaby trust me, it can't be no worse than mine. No stress!\n\n[Chorus: Sal]\nYou hate your job, you're so depressed\n(STRESS!)\nYou just wanna get paid\nStayed on the block, now you're homeless\n(STRESS!)\nBeggin for some change and I said\nI so hate this, but I embrace it\nI can fly... STRESS!\n\n[King Gordy]\nSo what your wife left ya? I know you missin' her\nA couple shots of Jackie Dan, man you won't remember her\nWe'll have a fun time-a Drinkin' Budweiser\nAnd some hard lima. Don't bring your wife-a\nWe came to have a party, listen to heavy metal\nJust hope it doesn't start then, hit 'em with heavy metal\nI have no fears. I was born in here\nI stayed in here. I invaded every whore in here\nMe and Paradime passed sipping times\nAnd woke up ordering Jack Daniels and Lemon Lime\nPeople meet's us in arenas\n(HARDCORE!)\nCost it, slam this until there's blood on the floor\nWhen you're black, pierce your ears. Tattoo your face\nYou got a lot of youth to waste, baby chose your fate\nQuite complainin' about how bad you feel\nIf you that sad for real, go get mad and kill\n(No stress!)\n\n[Chorus: Sal]\nYou hate your job, you're so depressed\n(STRESS!)\nYou just wanna get paid\nStayed on the block, now you're homeless\n(STRESS!)\nBeggin for some change and I said\nI so hate this, but I embrace it\nI can fly... STRESS!\n\n[King Gordy]\nGet right in the middle, they won't be checkin' for demos\nNo respect I will give you. I'm cut throat\nAll the sessions continue just let me help you get rid of this, just\nBe sexy, give me what you lust fo\nThe place is shakin'. Barricades is brakin'\nCrazy change like Vegas Insane occasions\nBlast from the scully uh\nBanned from America. Trashin terror\nNigga, what the fuck?\n\n[Sal]\nI got choices. My voice has been silenced\nI fell in love with the hate and the violence\nAnd like a time bomb, I tic and I toc\nAnd I'm not gonna stop, like a bomb about to drop\nThis shit is something we can all relate to\nIf you ain't feelin' it now it's gonna get to you\nNow I'm upset about the bills that I can't pay\nBarely enough to get me by, feel like a slave\n\n[Chorus: Sal]\nYou hate your job, you're so depressed\n(STRESS!)\nYou just wanna get paid\nStayed on the block, now you're homeless\n(STRESS!)\nBeggin for some change and I said\nI so hate this, but I embrace it\nI can fly... STRESS!\nSTRESS!\nSTRESS!\nSTRESS!"}]}