{"songs": [{"year": null, "title": "Black Sweatshirt", "image": "https://images.genius.com/ac9e0f11c62005e2d424955c950a2944.300x300x1.jpg", "lyrics": "Tonight I'm in the mood for some unscheduled affection\nSpontaneous combustion...I'm playing with my fire inside\nBurning my inner child blackened his skin to the tint of his sweatshirt\n\"Hey...when you play with the big boys, you get hurt!\"\nI used to suck my thumb while rubbing silk blankets across my cheek\nUntil my mom denied me access. I bawled for weeks\nWe don't speak to this day. I came to terms with my fear and loathing\nNow I wear this clothing...like it's an extra layer of old skin\nAfraid to shed...tears...in the fabric...from years that I've had it\nFound abandoned on the stairs to the attic\nCollecting runaway skin cells...absorbing memories\nIt's been to hell and back, dragged through the dirt and even worn by enemies\nBorn in the 70's of the 20th century\nMaking that distinction is for future reference...In case y'all remember me\nAnd my genesis. What's most important is to remember this\nWomen and men are pissed. When they kiss they exchange spit that is venomous\nMost of it is affection-less and the affects of this has us quick to clench a fist\nDon't get fancy with your paintbrush when you reminisce\n\nI'm sentimental and I miss what used to be close to me\nOr maybe I've just got OCD and I can't break my old routines\nHopefully I reconcile with my inseparable...what lies inside from head to toes\nInstead of symbolizing clothes...identifying with outside symbols...\n\nCut out the middle man...\n\nBut my woobie is in demand...\n\nI'm feeling like a kid again\n\n\"It protected me from the wind, sea and sand\nSanity was saved from the crazy cemetery walks\nAnd every awkward moment spent talking with the Boogie Man\nMan...managed unconditional comfort. As I've come to understand...\nThe monsters are under my bed again...\nThe monsters are under my bed again.\"\n\nDedicated to the memory of my Black Sweatshirt", "album": "Personal Journals"}], "artist": "Sage Francis"}