{"artist": "WC", "songs": [{"year": null, "lyrics": "[W.C.]\nDown on my motherfuckin luck\nHangin at the park, shootin dice, and I just got.. bucked\nAnd now I'm mad cause I'm broke as hell\nCause a nigga's unemployed plus I just got out of jail\nSo now I gotta come up on a lick\nBut the lick that I hit can't be no bullllllshit\nSo now I gotta call up my nigga\nMy nigga Ty, yeah, my homey from Wakeside\nYo nigga whassup? I need a lick\nHe told me to trip, he knew this fool up on 75th\nWho had a safe and a whole lot of yea\nTwo six-fours and a ragtop sittin on them thangs\nHe said this motherfucker was worth ten mill'\nI said, \"Cool then it's a done deal\"\nWent to the pad and grabbed the black ski-mask\nPut it on tight so nobody could see my ass\nSo now I got the mac with the teller\nJust in case these motherfuckers wanna play Goodfellas\nCalled up the crew; aiy Coolio\nThis motherfucker said he knew this nigga with some loot\n[C:] So what's it gonna be, jack kidnap or rape?\nNawww motherfucker just murder and a take\n[C:] Cool, then set it up\nAight nigga here I come\nHung up the phone went to my room and I grabbed another gun\nSlapped on my khakis, I'm gone\nWent outside and jumped in the bucket, motherfucker it's on yeah\nThree-wheel motion, throwin up the M\nNigga Dana Dane's what I call my rims\nScooped up Cool', now we in pursuit\nTwo niggas with a plan to get some loot\nHit the one-ten on my way to my homeboy's house\nLookin for a quick way out, nigga\n\n{*scratching*}\n\nSo now we at my nigga Ty house\nCookin up a plan on the best way to take this nigga out\nJust got out of Quentin for a caper\nAnd I don't wanna go back so motherfucker put it on paper\n[C:] And no sooner than we got the info\nI shot the nigga in the head with the fo'-fo'\nI grabbed my mac when the motherfucker hit the flo'\nGod damn Coolio, what you shoot him fo'?\n[C:] Look, I know you and you know me\nBut I don't know him and that's the way it's gonna be\nWho's that nigga?\nThat was my homeboy nigga!\n[C:] Yo fuck that nigga! WE CAN GET BIGGER!\nSo now we on our way to get paid\nRollin in a fucked up van with taped up license plates\nTook the back way through the alley\nAnd now we're sweatin cause we just took a hit from the wet daddy\n[C:] Got out the van, hit the back gate\nEverything's goin according to plan\nI had the front and Dub had the back\nI had the fo'-fo' and he had the mac\nNow we runnin through the house like motherfuckin SWAT\nAnd if anything move it's gonna get popped\nAwwwww, there go the nigga that we lookin for\nFool, GET YO' MOTHERFUCKIN ASS ON THE FLO'\n[C:] Now he's bound and gagged with duct tape\nDub, I got the motherfuckin safe\nBAY-BAYYYY!\n[C:] Jumped in the van and now we rollin\nAnd I'm trippin off this fat-ass grip that I'm holdin\nAnd the nigga, huh, don't worry about him\nTook the combination and the yea and I shot him\nWe got the loot and now we in route\nTo get a motherfuckin drink and knock some boots\nBig money big trout ain't no doubt\nI'm lookin for a quick way out, motherfucker!\n\n{*tires peel, instrumental interlude*}\n\n[W.C.]\nSo now we on our way to the spot\nA bucket full of ducats to drop before the streets get hot\nBut little did we know that the nigga we smoked\nHad some homies in the cut, sittin in the six-fo'\nSo now we gettin chased by some niggas in the cut\nBut I bet this mac'll make they ass stay back\nHit up the gat, damn my shit is jammed\nGood thing a nigga had a backup plan\nBut it's too late to grab the extra gat\nBurnin rubber in the bucket and we cracked\n[C:] So we jumped out the van and no matter what the cost\nWe had our mind set on sendin niggas to Harris and Ross\nBut this time a nigga wasn't color blind\nFucked around and got smoked at the end of the crime", "image": "https://images.genius.com/3cea3f78903751bf659783f67012fc7b.1000x1000x1.jpg", "album": "Trespass: Music From the Motion Picture", "title": "Quick Way Out"}]}