{"songs": [{"year": "2016-10-27", "title": "The Billy Williams Story", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Intro]\n(Ayee, aye, aye, aye,)\nComin' down off it\n(Aye, aye, aye, aye)\n\n[Hook]\nComin' down off a high (Aye), feel you with my third eye (Ayee)\nI swear I don't even know y'all\nI'm with Billy like I'm Road Dogg\nComin' down off a high (Aye), feel you with my third eye\nI swear I don't even know y'all\nI'm with Billy like I'm Road Dogg\nComin' down off it\n(Aye, ayee, ayee, aye, aye, ayee, aye, aye)\nComin' down off it\n(Ayee, aye, ayee, aye, aye, aye, aye)\n\n[Verse 1]\nLegend hoe, I got the hammer, corner store'll prolly ban me\nWicker Park or picket fence, nigga attitude like Ray-Ray\n(Comin' down off it)\nIn some Timbs, feelin' like a nigga rich\nWalked into the corner store today, lookin' like a mag-net, aye\n(Comin' down off it)\nThe Kodak is more like balone to me\nWalk in the store and I feel like the owner, B\nKnown to split bands up like KC and Jodeci\nWanted poster, you should take a photo of me\n(Comin' down off it)\nMy nigga I'm the life of the party, I never spend a night with a thottie\nAnd when it's time, my own niggas callin', callin', callin', callin'\n(Comin' down off it)\n\n[Pre-Hook]\nLegend in the making (like I'm Billy Williams)\nWant it, I'ma take it (like I'm Billy Williams)\nFeel it in my spirit (that the end is nearing)\nI can never fold\nLegend in the making (like I'm Billy Williams)\nWant it, I'ma take it (like I'm Billy Williams)\nFeel it in my spirit (that the end is nearing)\nI can never fold\n\n[Hook]\nComin' down off a high (high), feel you with my third eye (eye)\nI swear I don't even know y'all\nI'm with Billy like I'm Road Dogg\nComin' down off a high, feel you with my third eye\nI swear I don't even know y'all\nI'm with Billy like I'm Road Dogg\nComin' down off it\n(Aye, aye, ayee, aye, aye, ayee, aye, aye)\nComin' down off it\n(Ayee, aye, ayee, aye, aye, aye, aye)\n\n[Verse 2]\nDrive through like it's GTA, thinkin' how I'm getting paid today\nI'll walk in and take it, before I put this shit on layaway\n(Comin' down off it)\nIn some Roshes, whole hood'll prolly know me\nNever fucking with the police, I don't give a fuck I'll take a nigga groceries\n(Comin' down off it)\nComin' down on it, with a pound on me\nOh, people probably looking down on me\nCoz it's loud on me, all my niggas know that they can count on me\n(Comin' down off it)\nMy nigga I'ma take what I wanna\nYou looking like a stain, that's a cum up\nAnd I'll go get it by any means, rain, winter, summer\n\n[Pre-Hook]\nLegend in the making (like I'm Billy Williams)\nWant it, I'ma take it (like I'm Billy Williams)\nFeel it in my spirit (that the end is nearing)\nI can never fold\nLegend in the making (like I'm Billy Williams)\nWant it, I'ma take it (like I'm Billy Williams)\nFeel it in my spirit (that the end is nearing)\nI can never fold\n\n[Hook]\nComin' down off a high (high), feel you with my third eye (ehh)\nI swear I don't even know y'all\nI'm with Billy like I'm Road Dogg\nComin' down off a high (high), feel you with my third eye (eye)\nI swear I don't even know y'all\nI'm with Billy like I'm Road Dogg\nComin' down off it\n(Aye, aye, ayee, aye, ayee, ayee, aye, aye)\nComin' down off it\n(Aye, aye, aye, aye, aye)\n\n[Skit: Joshua(@_jdnice)]\nAll I ever wanted to do in my life was, make music. So...I guess, on my bucket list, what I really wanna do is-s, drop...a project. Like, nobody has to even listen to it. I just, wanna know that, I did it. Be able to say, I went out there and, did that and I chased my dreams. And that's really it", "album": "Bucket List Project"}], "artist": "Saba"}