{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Hook: R.A. The Rugged Man]\nEvery record label sucks dick [x4]\nEvery record label (every record label)\nThey suck dick! (suck dick!)\n\n[Verse 1: R.A. The Rugged Man]\nFuck the new clothes, sport shitty jeans, fuck the limousines\nWhen the ho schemes you end up with no beans\nThere's only 50,000 heads that are true to this\nThe rest are clueless to what real hip hop music is\nPlus the labels think that artists are pathetic, I don't sweat it\nIf they take the credit I will send them to the medic\nThe industry will gas ya head up, you ain't shit to them, don't get fed up\n'Cuz when you're down and out they won't help you get up\nThey sit around creating gimmicks, sky's the limit, but to him it's\nNothing, A&R men act like schizophrenics\nFuck the negative reviews, I sing the blues\n'Cuz if I blow up I still lose\n\n[Hook]\n\n[Verse 2: R.A. The Rugged Man]\nNow how can the musicians be the scholars\nWhen they're making less than four percent of six dollars?\nMost of the kids that kick a rap just don't deserve opinions, acting like critics\nLooking like Richard Simmons, now they're sporting Timberlands\nAnd I ain't trying to be accepted, but it's hectic\nWhen you try to sell you records and ya record label don't respect it\nNow all these promotional stunts gets me emotional\nNot hospitable, I'll never recoup so it's not profitable\nAnd I can end up as white trash living in a trailer park\nEatin' tuna fish with my Cheez Whiz\n\"So how you'd get ya job in the black music department?\"\nSince I was growing up that's where my heart went\nI won't be going out like Kurt Cobain, or Tattoo\n\"Da plane, da plane!\" jibba jibba jib, Jane!\nSo if my sales don't exceed the expectations\nMy relation-ships will be Uzi clips and decapitations\n'Cuz the fact is, technically, I need a vasectomy\nNo pregnancy, kids got the tendency to be sweating me\nSo do ya own! Them scumbags is making moneybags\nIn the meantime, ya Karl Kanis turn to rags\n'Cuz labels don't know shitty rappers from any rappers\nSo listen rappers, they only know how to pinch a penny, rappers\nI end up bankrupt and penniless, while you remain the rich man\nMy fist is up your ass to rip ya lips off\nThis ain't the rock and roll era, so how could you know what's worse or better?\nChilling in ya polyester sweater\nA big advancement doesn't make the move the wisest\n'Cuz Def Jam offered me more loot than Jive did\n\n[Hook]\n\n[Verse 3: R.A. The Rugged Man]\nAnd the executives at labels, they about equal to McDonald's workers\nThey all down to jerk us, trying to keep us poor on purpose\nThey expect that respect that they don't give, so don't think that it's negative\nIf you don't want to let a record executive live\nNow pretty bitches wind up giving up they butts\nBut I'm used to busting nuts in stank perverted sluts\nJust the thought of getting signed, you masturbated\nCan't you see the industry is gold-plated?\n\"He sounds like Ice Cube, let's sign him!\nHe sounds like Onyx, let's sign him!\nHe sounds like that shit that's hittin', let's sign him!\"\nGod forbid I get HIV\nI'd be bitin' people and spittin' blood at the entire music industry\n\n[Hook]", "title": "Every Record Label Sucks Dick", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}