{"songs": [{"title": "Foofy Freestyle (50 Cent Diss)", "lyrics": "[Intro]\nI can't believe this shit\nHow dare you niggas?\nHa, okay\nTraps N Trunks, we got this mixtape shit on lock!\nYeah\n\n[Verse]\nI am pleadin' the fifth, saran-wrapped, you're receivin' my gift\nSo many niggas I'm passin' and they needin' a lift\nThis is fatal attraction baby, know who you with\nI can't depend on the if, I got my hands on it now\nBodies under my belt, I gotta stand on it now\nThis not our first fallin' out, know how to handle it now\nBanks gone, ain't nobody there to settle it now\nThem other niggas need verses from whoever around\nC'mon Foofy, this Instagram shit done got goofy\nLet's focus on that two million dollars, that nigga robbed you\nLet's talk about them bitches you burnt, them hoes charged you\nYou know what I learned was how not to be a father\nApologizin' to my sons and my daughters\nLord forgive me for the pain that I caused us\nLord was with it when he came and he called us\nAnd I'm in this grocery store grippin' on this revolver\nYeah, you know I make 'em have to solve 'em\nUgh, I make you niggas have to call them\nCatch a body, beat a body, keep your mouth closed\nMake it to the outro, then we applaud ya\nJohn Wick with the stick, I'm with the bullshit\nI guess I know too many devils on the pulpit\nGuess it's the level where some niggas I was cool with\nTurned into some niggas I don't even fool with\nThe underdogs and have nots, I'm in tune with\nThe big dogs and got-it-alls, I move with\nSet rules with and load up mules with\nSame niggas that I win with I lose with\nSame nigga at the Beverly Center\nWhen me and Floss had to pull up, remember?\nMy niggas pressed ya\nFloyd had your ass paranoid, I had to bless ya\nNigga you been askin' for it, it's my pleasure\nTo introduce the world to this gangster shit\nI wrote Too Rich for you and this the thanks I get?\nYou taught that young boy to snitch, nigga you think you slick\nGas him up on the 'gram just to make you lit\nGet you out of this jam, you gon' need more than a skit\nMore than a fuckin' post, nigga you know I won't quit\nYou know I'm a fuckin' ghost (Ghost, ghost, ghost)\nPow\n\n[Outro]\nNever ran from nothin' in my muh'fuckin' life homie\nHa, fear no man but God\nAnd that's only 'cause I ain't met him yet\nNiggas gotta deal with me, Buckshot!\nYou know I'm available for whatever type energy you on homie\nHaha, real life, real street niggas\nWe do still exist out here", "album": null, "year": "2019-06-21", "image": "https://images.genius.com/787eb0fed4a05aa802dee3238c64431a.792x792x1.jpg"}], "artist": "Young Buck"}