{"artist": "Pitbull", "songs": [{"album": "Unleashed Volume 1", "title": "Freestyle 1", "image": "https://images.genius.com/da63aa235f89e971e6da98dd74bf9b74.875x800x1.jpg", "lyrics": "Pitbull was the name that i gave myself\nAnd it fits me proper cuz i bite and lock ya\nI'm tryin' a get with both Tony's touch meanin'\n\"Tony toca\" and Tony Montana\nIt's bigger than than blocks and towns, Glocks or pounds\nCause these, boys down here got choppers that will (brrrp) chop you down\nAnd if you want that red light, special light, TLC'll show you the spot, and they got you now\nFrom Miami to Bushwick, this is for everybody that push shit, push mix, push bricks\nPush the wrong buttons and get your shit pushed back right quick!\nI'm a nightmare on any beat, call me Pit slash Kreuger, and my dawg J-dawg won't hesitate to spit that Luger\nOye boricua! Que bola? Soy (Son?) de cubano/mexicano so you know i represent Cuba\nBut don't get me wrong, i've got love for puertoriqueños, especially for puertoriqueñas\nQue le gustan usar la lengua, y en la cama son enfermas\nCome on meng, you don't wan't beef with this (timy? or tiny) boy, meaning Tommygun\nTiming is everything so imma give y'all time to run, but let's keep it real your time is done\nPitbull, my time will come\nThanks to Teach and his big mouth, i'm coming up like the morning sun\nPero (Tom, or Ton?) no te preocupes, Teach may have a big mouth but he won't drop down, fuck a hot rhyme, just listen to the gun rap\n\"Csh\" \"csh\", click-clack, nigga, take that, Pitbull's back\nFor the first time, i'm at the point where Santiero couldn't curse mine (no, no, no), or curse me\nI'm starving, and i'm thirsty, and i'm not gonna stop till y'all yell mercy\nI want all y'all to eat, but first me\nI want all y'all to eat, but first me\n\nOutro:\nHahaha, oye Ton\nI appreciate the love meng, muchas gracias\nAnd Teach, Big Mouth Promotions, bet that up baby\nHah, keep looking out for Pitbull slash Q-bon\nFrom the bottom to the top\nTen cuidado", "year": null}]}