{"artist": "Immortal Technique", "songs": [{"title": "Obnoxious", "lyrics": "[Verse 1]\nI'm obnoxious, motherfucker, can't you tell?\nRun through Little Havana, yellin', \"¡Viva Fidel!\"\nJerkin' off with the sheets when I stay at hotels\nDrinkin' Bacardi at AA meetings, smokin' a L\nI'm broke as hell, my attitude is no good\nLike workin' for white people after watchin' Rosewood\nSo I'm a mercenary, I don't care how I get richer\nLike American companies that did business with Hitler\nGet the picture, nigga? I'm the best of both worlds\nWithout the hidden camera, and the 12-year-old girl\nLet's face it, you're basic, you aren't half the man that I am\nI'll throw your gang sign up, and then I'll spit on my hand\nGive me a hundred grand!\nGive me your watch! Give me your chain!\nThat's your girl? Bitch, get over here! Give me some brain!\nI'll bust off on her face, and right after the segment\nShe'll probably rub it in her pussy, tryna get herself pregnant\nI said it, I meant it, that's the way I deal with enemies\nLike pro-lifers that support the death penalty\nAnd don't talk about war when niggas know that you puss\nA fuckin' hypocrite draft-dodger like George Bush\nDon't push me, nigga, 'cause I'm close to the edge\nAnd I'll jump off with a rope that's wrapped around ya head\nSend a dead fetus to my ex on Valentine's Day\nThe safety's off, nigga, so get the fuck out my way!\n\n[Hook]\nObnoxious, nigga, murderous lyrics\nI know that you hear it\nNow that I'm gettin' closer and closer, I know that you feel it\nYou're eatin' off rap, and I hope you choke on your gimmick\nNiggas said Hip-Hop was dead, but I'm invokin' the spirit\nWe takin' it back in the day to the Golden Age\nWhen wack motherfuckers used to get thrown off stage\nImmortal Technique, I made this to bump in your ride\nOr burn it off the Internet and bump it outside\nNigga, we keepin' it live, we keepin' it live\nWe keepin' it live, we keepin' it live\nBurn it off the fuckin' Internet and bump it outside\n\n[Verse 2]\nLook, motherfucker, my words damage and slaughter\nA ragin' alcoholic like the President's daughters\nDisgustin' flow, like third-world-country tap water\nBut before I hit the border, someone give me a quarter\n'Cause I'ma prank call COP-SHOT just for kicks\nPayback for every time that they called me a spic\nAnd Puerto-Rican chicks tell me that I fuck like I'm loco\nAnd Dominican women call me the \"Rompe Toto\"\nThey call me \"ocioso,\" I'd rather get fired than quit\nI get unemployment, you work, and we makin' the same shit\nHow dare you niggas criticize the way that I spit?\nYou coffee-shop revolutionary son of a bitch!\nBut you know what the fuck I think is just pathetic and gay?\nWhen niggas speculate what the fuck 'Pac would say\nYou don't know shit about a dead man's perspective\nAnd talkin' shit'll get your neck bone disconnected\nDisrespected, niggas don't show no love\nWhy you tryna be hardcore, you fuckin' homo thug?\nAnd don't be sensitive and angry at the shit that I wrote\n'Cause if you can take a fuckin' dick, you can take a joke\nI'll choke your friends in front of you to prove that you've fallen off\nAnd you won't do shit about it\nLike the Church during the Holocaust\nKalashnikov machine gun flow that I fire\nObnoxious until they shoot me on the day I retire\n\n[Hook]\nObnoxious, nigga, murderous lyrics\nI know that you hear it\nNow that I'm gettin' closer and closer, I know that you feel it\nYou're eatin' off rap, and I hope you choke on your gimmick\nNiggas said Hip-Hop was dead, but I'm invokin' the spirit\nWe takin' it back in the day to the Golden Age\nWhen wack motherfuckers used to get thrown off stage\nImmortal Technique, I made this to bump in your ride\nOr burn it off the Internet and bump it outside\nNigga, we keepin' it live, we keepin' it live\nWe keepin' it live, we keepin' it live\nBurn it off the fuckin' Internet and bump it outside\n\n[Verse 3]\nDamn, homie!\nIn high school I beat the shit out of you and your man, homie\nYour girl wanna blow me, and don't even know me\nShe lonely, and she think you a phony\nI take a piss on a development deal from Sony\nOr Def Jam, 'cause you're like all of the rest, man\nThis ain't a verse, this is shit-talk at the end of the song\nAnd you can suck a dick if you think I ended it wrong\nFuck you and I'm gone, ha ha ha ha!\n\n[Outro]\nPeace to the Stronghold, EOW\nWord-A-Mouf, Forbidden Chapters\nIAK niggas, Wax Poe, killin' you slow\nThe Plague, I'll murder a show\nYou don't even know", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}