{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Fuck Whatever Y’all Be Talkin’ Bout", "year": null, "album": "Spanish Kastle Magick Too", "lyrics": "Ey, yo, fuck whatever y'all be talkin' bout\nFuck whatever y'all be talkin' bout\nFuck whatever y'all be talkin' bout\nFuck whatever y'all be talkin' bout\nFuck whatever y'all be talkin' bout\nYa'll already know and if you don't I'ma tell you again\nAnd again and again, to the motherfuckin' end\n\nFuck politics, the system ain't broken, it's fixed\nIt's a joke and it sick when [?] man\nThey take a man from the ku klux klan\nPut a gat in his hand\nAnd act surprised when he attackin' a black man?\nThese crackers is whack, man\nThey policy is strictly exterminate\nThey killin' the seeds before the germinate\nThey servin' hate, just like a cake on a plate\nOn a dessert tray\nYo, they kill on a Wednesday\nArraign on a Thursday\nWalk on a Friday\nAnd ya'll mad cause we blockin' the highway?\n\nWhat about that sick fuck that strayed up a church, man?\nCops took that bitch ass pecker wood to Burger King?\nSure, ya'll protecting and serving great\nYa'll still wanna talk about the black on black fuckin' murder rate?\nDawg, it's fuckin' absurd, man\nIt's sick how they be twistin' statistics into abstractions\nGas-lighting actin like this shit ain't happening\nTellin' us \"it's all in your head\"\nYo, same time they fuckin' pumpin' us all up with lead\nMan it's centuries of fuckin' genicide\nDomestic and global as well\nBlowin' entire fuckin' cities in fuckin total Hell\nAnd ya'll mad when a black fuckin' quarterback won't fuckin' stand for the anthem?\nMeanwhile, immigrants they snatchin' mothers and fathers, grandmothers and grandfathers away from they sons and they daughters and and they granddaughters and fuckin' grandsons?\nHoldin' hundreds of thousands of people convicted of no crime for fuckin' ransom\nGovernment subsidized forced labor camps be held captive\nAnd ya'll still got the gall to be axin why me mad, son?\nMan, they coppin' tank, guns, bombs, nuclear weapons with our taxes?\nMeanwhile there's overcrowded classrooms\nKids be doing math with no calculators\nThousands of city across the nation without clean water\nYa'll talkin' about American dreams?\nNah\nFools still be dyin' of curable diseases cause they can't afford health insurance\nJust so pharmaceutical companies can have they wealth insurance\nIt's selfish, stupid, an abomination\nTrump-thumpers, Obama-hatin'\nMeanwhile they man tryin' to take they mamma's pain medication that Obama gave 'er\nAnd no I'm not sayin' Obama's a saint\nHe got plenty of blood on his hands, too\nFuck it's a damn zoo\nMan, I ain't woke, I ain't a leader, or a role model\nI'm just sayin' that shit that you already know probably\nDon't follow nobody\nFollow your own damn self"}]}