{"artist": "G Herbo", "songs": [{"title": "Crown", "album": "Humble Beast", "year": "2017-09-22", "image": "https://images.genius.com/8a402b14fb90700c3fd8c750afa7b8eb.800x800x1.jpg", "lyrics": "[Intro: G Herbo]\nYou know since day one, we probably never ever had shit\nBut I know everybody feel like a king or queen in they own way\nYou know, look\n\n[Verse 1: G Herbo]\nWake up, wipe the coal out my eyes\nLook in the mirror, see my hunger, view my soul in my eyes\nBrush my teeth, snatch my sister sheets, I know she sleepin' deep\nAnd feeling geeked, tryin' get to school, first day of the week\nSuper Donuts warmed up for breakfast, wasn't much to eat\nRemember moms' hand-washing clothes, sweaters in the sink\nNow the chain and my watch is gold dweller with the link\nI'm making cheddar, what you think? Gettin' better by the blink\nThat's every second for the dickheads that don't know how to think\nI'm getting better, never second, I can't let up shit dead\nThey couldn't hear me, I was snoozin' when I used to sip red\nI was flexin' everyday, ran through my little bread\nYou know young nigga never had it, do what I want now I got it\nBut that don't define you as man, what you gon' do without it?\nKnow you ain't got a dime, now what you gon' do about it?\nWhole family from the slums, how you finna move 'em out it\nWe need our crowns\n\n[Interlude: Bump J]\nG Herbo, tell them shine them bitches up for us\nChief\n\n[Verse 2: Bump J]\nAll black strap, White Sox cap the crown\nMy dawg slapped the ground when them laws clapped 'em down\nThe dicks slid through in that all black a-Crown\nAnd I might fan that bitch if it crawl back around\nThat toy on me but I ain't finna play\nI've been this way, hoppin' on and off of them interstates\nRemember days baggin' up on my mama's dinner plates\nI'm sorry but I'm starvin' and my mama's rent is late\nAnd I gotta' chase this bread, fuck what a hater said\nMad 'cause we poppin', look how they watch us like they the feds\nThey comin', they comin', just know I sleep with that K in bed\nThe clip hangin' outta' that bitch, as long as a baby's leg\nWrong one, grind and your time gon' come\nThey say when you chase the money, the money gone run\nBut you so impatient, feel like you need a home run\nThey died, they locked up, it's normal, I've gone numb\nAnd that's why I'm not sober, hello pop culture\nWe should start pulling these cops over, ya reign on the top's over\nPussy we need our crowns\nMy king blood is heating up, nigga, we need our crowns\n\n[Interlude: G Herbo]\nG Herbo\nAye Chief, let me get some more\nHold on, what I tell 'em\n\n[Verse 3: G Herbo]\nLook, we need our crowns, I was cursed at birth\nI made the best out the worst, grandma waitin' for them checks on the 1st\nPicture days hustlin', tryin' get fresh was the worst\n'Member fresh up out of school, gettin' arrested and dispersed\n'Nother day I'm not in school, just to post up with my tool again\nAnd I'm tryna blend, but they still think I'm a hooligan\nNow I'm getting dividends, all about them Benjamin's\nFeds in the islands, Gilligans, Philippines​\nFree my niggas in the pen, I just spoke to Gill again\nTold him I'ma heat up and I sent him somethin' to chill again\nI'm just tryna be up in a hammock with my feet up\nUntil then, I'm still hungry, gotta eat up\nAnd I'm gettin' greedy, ain't no mouth above mine, I can't praise a nigga\nThen they start feeling like they made a nigga\nI don't wan't no favors nigga, yeah, I'll blaze a nigga\nAnd I got some aim lil nigga, bet I ain't gon' graze a nigga\nProbably ain't gon' need it but my Glock still got a laser nigga\nAny day we both ain't gotta gun, I still'll daze a nigga, fade a nigga\nAte up on that shit when I was younger, guess I'm aging nigga\n21 I feel like I'm a OG, shit amazing nigga\n\n[Outro: G Herbo]\nG Herbo, you know man, gang shit man\nMan Eastside shit real, real Eastside shit, 079, you know\nAnd this shit crazy man cause\nI remember, I remember I was young as hell man\nWalking home from school and shit, me and my lil sister\nI'm seeing Bump 'nem hop out, they in the Chargers and shit\nWhite Chargers and they hop out, walk out\nAP Dudley and shit, I'm starstruck, and these street niggas\nI'm starstruck on some street shit like \"This Bump? This Bump?\"\nYou know? Shit, you know what I'm saying?\nFuck it though, I'm just talking, you know?\nJust venting and shit, just on some real shit\nThis shit crazy you know, gang shit though man\nG Herbo, \"Humble Beast\", you know what's going on man\nShout out Chief Bump, you know Chief home\nFree all my niggas, free all them niggas in the cell\nAll them niggas gone, dead and gone, you know\nEastside shit all over the city, you know what I'm saying\nSpread my pain, all the way to your pain, you know\nWe need our crowns man, spread the crowns out\nSpread the love out man, to the youth, you know\nBless the youth, you know, bless poverty, bless our people\nYou know what I'm saying, we need our crowns\nLet's get it"}]}