{"songs": [{"image": "https://images.genius.com/eeff40d6f74d5af6d3bdeaa9b265100e.500x500x1.jpg", "album": "Generation Gaming VIII", "title": "Dying Light", "lyrics": "[Intro]\nIt's dark, and Hell is hot\nDan Bull...\nIniquity...\nLet's go...\n(Yea, yea, yea!)\n\n[Verse 1: Dan Bull]\nI'm Kyle Crane, taking down anybody with a vile brain\nBest stay still or they just may feel\nAn iddy biddy little bit of mild pain\nSunrise, it's burgling time, I don't wanna die so I work in the light\nTo swerve all the psychotic murderers lurking at night\nFar cry from a Turkish Delight\nCos when the night falls, you require giant balls\nJust to survive, I hope you like to climb walls\nBe mindful and just know that you might fall any moment\nThere's no slowing their roll when they're going with no control\nAnd you know it, I swear by the penis on me\nI wouldn't wanna be the zombie\nThere's a meanness, I feel it strongly\nI can be as mean as the Viet Cong be\nI treat these eejits wrongly\nTheir bodies are an ambling canvas\nFor an artist of the art of survival\nAnd the university of life's my campus\nGo ham on the thankless bandits, madness!\nIn your pants there's a dampness\nI'll grab an axe and I'll have you handless\nOr maybe take a hammer to your hippocampus\nPro scavenger son, you're an amateur one\nWhen I handle a gun, the damage is done\nAnd although this is serious business\nI admit that I'm having some fun\n\n[Hook: Dan Bull]\nThe Light's dying and dim, the night's trying to get in\nAm I hiding, lying crying quiet, whining with the whitest skin?\nNO! the Light's dying and dim, the night's trying to get in\nI'm climbing, fighting, grinding, swiping, slicing, striving to win!\n\n[Verse 2: Iniquity Rhymes]\nWhose light is dead? Shit, it's not mine\nI been shinin' through the Slums now and I'm quite fed\nStill hungry for more so the Zombies see gore\nThe king warlord, your corpse'll recite death\nPipes, pistols, propane tanks, the pain is pure\nMan, I'm going postal\nBites? Bitch you won't gain haste\nI'm the bane of your existence, boastful\nI'm feared by infected, so hereby respected\nBy nearby survivors with hope\nI'm more fierce by the second, adhere to my weapon\nNo mere title reckons my wrath, I'm the G.O.A.T\nI'll sleep when I'm done, til then believe the world's my arsenal\nWhile I'm out here slaying volatiles, they bleed\nTell me will ya balls see growth?\nNo bolter escapes my range, the massacre is bound to happen\nHomie, this soldier awakes with rage\nThese bastards are astounded, fasten\nYa seatbelt - they're like, \"He's hell,\"\n\"Better stay back or our blueprints will rot\"\nWhether the crowbar or cricket bat, given that I'm a beast\nI send biters to their box\nHere goes - I'm here to prove myself\nDan Bull and Iniquity Rhymes\nThese bars'll give you that 8 mile syndrome\nIt hits home, Lose Yourself in fractions of time\nFight for your life, is it rude if I mention\nI frighteningly like all the feuds with Rais' Henchmen\nI might even bite, you will lose and die drenched in\nThe blood of my foes, ensue all of my vengeance\nDying Light\n\n[Hook: Dan Bull]\nThe Light's dying and dim, the night's trying to get in\nAm I hiding, lying crying quiet, whining with the whitest skin?\nNO! the Light's dying and dim, the night's trying to get in\nI'm climbing, fighting, grinding, swiping, slicing, striving to win!\n\n[Outro]\nThis is some shit to see\nDan Bull and Iniquity\nThis is some shit to see\nDan Bull and Iniquity\nThis is some shit to see\nDan Bull and Iniquity\nGoodnight, and goodluck!", "year": "2015-02-19"}], "artist": "Dan Bull"}