{"songs": [{"album": "The Longest Yard (Music From and Inspired by the Motion Picture)", "image": "https://images.genius.com/65c28c46b1de126581120a8f4784c7e0.300x297x1.jpg", "year": null, "title": "Bounce Like This", "lyrics": "[Verse 1]\nChinchilla to the floor, Cigarillo full of dro\nWhite Benz double doors, I could change colors though\nBlue Ferrari, red Bent, black truck on 24's\nSeveral Cheverolet's on 20 inches maybe more\nUsed to wish for better days, now I'm wishin' never more\nI could go buy anything, stick my dick in every hoe\nGrand Hustle on everything, P$C in every store\nSellin everything from rubberbands to leather coats\nSwear to God I never change, jealous niggas never know\nT.I.P. ain't never been a lame, jigalow since '84\nBlessed with astonishing ability to pull a hoe\nFuck her so, good make her think this dick was full of Moe\nPussy so, good but I love it when she suck it slow (OH)\nHer motto you don't swallow what you suckin' for (OH)\nMy motto you ain't ballin' what you hustle for\nThe VVS's let off such a glow to let these bustas know\n\n[Chorus]\nHey! Hey!  Hey shawty bounce like this just bounce let me see you bounce like this\nHey! Hey!  Hey shawty bounce like this just bounce tell that bitch to bounce like this\nHey! Hey!  Hey shawty bounce like this just bounce all my nigga bounce like this\nHey! Hey!  Hey shawty bounce like this just, bend it over and make it bounce like this\n\n[Verse 2]\nI give you 30 seconds show me what you got could you\nBend it over for me drop it like its hot could you\nWiggle your titties a little lift your top get you to\nBust it open show your panties and your ass for me\nActually I was thinking you, Kim, and Daphine\nIn the back with me, lickin' on the bottom half of me\nAnswer me first know that sayin no is blaspheme\nMe I'm pussy pumper number one you can ask for me\nI knew how you danced for me that you had plans for me\nSave the conversation get your partner out them pants for me\nDamn honey, you'd be a fool if you ran from me\nYou ain't fuckin wit another dummy I'm the man honey\nIm tryin' to give it to you 'till it make you stand funny (OH)\nThrow that pussy right and maybe you can get a grand from me (OH) (HA!!)\nPicture pimpin givin' you some damn money\nNot a one thin dime but your ass is fine\n\n[Chorus]\n\n[hook]\nNow shawty bounce with me bounce with me, let me see you see you bounce with me bounce with me\nNow shawty bounce with me bounce with me, let me see you let me bounce with me bounce with me\n\n[Verse 3]\nHey shawty stall if you want to I ball when I want to\nCould fall through and shut down the mall if I want to\nI could make your girlfriend choose but I want you\nWhy you bother me with what you will and you won't do\nListen shawty I'm a grown man and you grown too\nYou can leave with me I ain't gotta telephone you\nAll I'm thinking 'bout is me layin on you\nOr vice versa with a lot of ass to hold on to\nI got somethin' for that ass to bounce onto\nYou missin the chance of a lifetime why don't you\nHop off in the droptop, ride through the city lights\nTake you where I kick it let you see what pimpin living like\nPop one of these then we'll see what you feeling like\nTakin off your clothes wanna know what its drilling like\nPresidential suite at the very end of the night\nTreat you like a freak and give you what was missing in your life\n\n[Chorus]\n\n[hook]"}], "artist": "T.I."}