{"songs": [{"image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg", "title": "Fuck It Then", "album": "Nellyville", "year": "2005-06-25", "lyrics": "[Cedric walks up the stairs, goes into the house & shuts the door]\n\n[La La:] Where have you been?\n[Cedric:] Damn, dam girl. Why didn't you tell me the elevator was broke?\n[La La:] What took you so long?\n[Cedric:] Had to climb 3, 4 flights of steps. What's up?\n[La La:] All I asked you to do was to get the Nellyville CD\n[Cedric:] Yeah, yeah, I got it, I got it, I got it\n[La La:] How hard was that?\n[Cedric:] Why you actin' mad? I'm the one runnin' around lookin' for the album...\n[La La:] Because I've been in this apartment for a long time waitin' on your\nAss. I don't watch Jenny Jones, Montel, Judge Judy...\n[Cedric:] What you mean it took so long? I've only been gone for...shit what? 1, 2, 3 hours, I wasn't even gone for that long\n[La La:] What you had to go to St. Louis to get the muthafuckin' CD?\n[Cedric:] Okay, okay look baby, I got it, just calm down\n[La La:] What was so hard about that?\n[Cedric:] Drink some champaign\n[La La:] I don't want no damn champaign. Where's is the Nellyville?\n[Cedric:] Sayin' bubble bath, Gettin' it on, I hit that ass...(sniffles)\n[La La:] Whatever. Where's the CD?\n[Cedric:] Everybody Just chill out, You' know what I mean? yeah I got the Nelly for you'Yeah, I got it\nI'm gonna put this on... yeah, I hope you don't mind the clean version\n[La La:] The clean version?!\n[Cedric:] What?\n[La La:] What?!\n[Cedric:] Man, this is all they had\n[La La:] What you think this is rated PG?\n[Cedric:] Look baby, look I can cuss, I can cuss for everybody\nDon't you worry about the cussin'\n[La La:] You think we at the Prom... What the fuck is wrong with you?\n[Cedric:] There's gonna be plenty of bad words sayin' up in...\n[La La:] Whatever. You know what? Where's my shit at? Get me out of this small ass, hot ass apartment anyways!\n[Cedric:] Where your goin\"? Oh, so your just gonna leave me like that!\n[La La:] Where's is my shit? Give me my coat, I'm ready to go\nMan: Oh. So your just gonna Nsync a bro, Your just...\n[La La:] BYE!\n[Cedric:] Well go ahead & just go. & the truth remains. Your\nHey, that's arite-Cause I hope you fall down them stairs, you & your gucci shoes!"}], "artist": "Nelly"}