{"artist": "Apathy", "songs": [{"title": "Fuck You", "image": "https://images.genius.com/e141ff9150df93387385a0a66f7cbd92.678x658x1.jpg", "album": "Baptism By Fire", "lyrics": "[Verse One]\nHere's a big fuck you\nDedicated from me to you\nThink I got dropped bitch? Stop, it's not true\nBut if these motherfuckers won't make some moves\nI'm on to bigger and better things like fuuuuuuck you\nBoss is stressin', caught me restin'\nScreamed on me, thought I got taught a lesson\nIn that case there's only one thing to do\nMiddle finger in the air like fuuuuuuuuuck you\nAll these rappers and stupid bitches\nTryin' to get involved in the music business\nYeah, I got some advice to give to you\nFuck you, fuck you, fuck you, fuck you and fuck you\nYou and your mother\nLittle sister and brother\nAll of y'all can get it, family members get discovered\nDismembered, this is not a diss record but I do\nSay F-U-C-K Y-O-U\nFuck you\n\n[Hook] [x4]\nFuck you, fuck you, fuuuuuck you (FUCK YOU!)\n\n[Verse Two]\nI ain't a gangsta rapper (nah)\nI ain't a trapper neither\nBut I'm known to carry paper like a Trapper Keeper\nYou're wearin' rare Nikes tonight and Ap sees ya\nI bruise your face, loosen your laces, jack your sneakers\nAnd before the night is through\nI'm spillin' drinks on your crew and your wifey too\nStarin' right at you like, \"What you gonna do?\"\nNot nothin', stop frontin' bitch, fuuuuuuck you\nMessy hair\nEverywhere\nSo trendy they're softer than a teddy bears\nAnd I ain't down to squash shit or talk shit through\nSo fuck you, fuck you, fuck you, fuck you and fuck you\nYeah, I can't bite my tongue\nWhen young kids learn hip hop from VH1\nThat's some real bullshit and y'all know that's true\nSo F-U-C-K Y-O-U\nFuck you\n\n[Hook] [x4]\nFuck you, fuck you, fuuuuuck you (FUCK YOU!)\n\n[Verse Three]\nMotherfuckers stay spreadin' rumors\nI ain't even gonna stress them losers\nLet 'em know that\nLet 'em know that\nNothing says, \"Fuck you\" like \"Fuck you dude\"\nLittle bitch keep flappin' her lips\nUnderstand you get slapped for that shit\nLet 'em know that\nLet 'em know that\nNothing says, \"Fuck you\" like \"Fuck you dude\"\nFuck you!\nCops who clock me\nKids who copy\nCrew who jock me\nDudes who cock block to stop me\nFuck you\nSchemin' hoes\nEvil foes\nPeople know, the Fuck You Theme it goes\nFuck you!\nGonna flip when they hear me cursin'\nLike, \"Try to find a clever way to make a clean version\"\nThey over analyze everything I do\nTryin' to tell me how to rap man, fuuuuuuck you\nSayin' that they won't play it on the air\nI think it's obvious that I don't care\nWell let me take a sec to think that through\nTime's up, suck my dick bitch and fuck you!\n\n[Hook] [x4]\nFuck you, fuck you, fuuuuuck you (FUCK YOU!)", "year": "2007-01-15"}]}