{"artist": "Warren G", "songs": [{"year": null, "lyrics": "The blues has always been totally american\nAs american as apple pie\nAs american as the blues\nAs american as apple pie\nThe question is why?\nWhy should he blues be so at home here?\nWell, america provided the atmosphere\n\nYou don't see what i see, every day as warren g\nI take a look over my shoulder, as i get older\nGettin tired of mothafuckas sayin' \"warren i told ya\"\n(you don't hear what i hear)\nBut it's so hard to live through these years\nWith these funny-bunny niggas, ain't shit changin\nGot my mama wonderin if i'm gang-bangin\nBut i don't pay attention to these father figures\nI just handle mine, and i'm rollin with my niggas\nOff to the vip, you see, snoop dogg and warren g\nUnbelievable how time just flies\nRight before your eyes, but you don't recognize\nNow who's the real victim, can you answer that?\nThe nigga that's jackin, or the fool gettin' jacked (yeah)\n\n()\nYou don't see what i see, every day as warren g\nYou don't hear what i hear\nBut it's so hard to live through these years\nYou don't see what i see, every day as warren g\nYou don't hear what i hear\nBut it's so hard to live through these years\n\nAnother sunny day, another bright blue sky -\nAnother day, another muthafucka die\nThese are the things i went through when i was growin up\nThere's only one hood, and niggas shit be throwin' up\nAnd i knew it, there really ain't nothin' to it\nThinkin' every fool's gotta go through it\nNow let's go back - (how far?) back in time\nDraggin to these hookas tryin to mack for mine\n\nI remember when we all used to stop at the spot\nBack then my nigga-name was snoop rock (huh)\nIt was all so clear\nEighty-seven, eighty-eight, then eighty-nine's the year\nYou say \"everywhere we roll, you can say we roll thick\"\nWay back then two-one-three was the click\nSomethin' to stay paid i was just a young hog\nWarren g, snoop rock and nate dogg\n\n()\nYou don't see what i see, every day as warren g\nYou don't hear what i hear\nBut it's so hard to live through these years\nYou don't see what i see, every day as warren g\nYou don't hear what i hear\nBut it's so hard to live through these years\n\nYou make me wanna holler, get out the game\nToo many muthafuckas know my name\nWhile snoop dogg's servin' time up in wayside\nI puts it down on the street, don't try to take mine\nI had to reassure the homie that he wasn't alone\nWe'd talk, and him n nate'd conversate on the phone\nHe kept sayin, \"nigga, it won't be long\nBefore a little skinny nigga like me'll be home\"\nI said, \"snoop, things done change, it's not the same\nWe need to get about the game\nCuz we can get paid in a different way\nWit you kickin' dope rhymes and i dj\"\nWell as time goes past, slowly we try to make it\nBut things are gettin hectic, i just can't take it\nShould i a: go back to slangin' dope?\nOr should i b: maintain and try to cope?\nOr should i c: just get crazy and wild?\nBut no i chose d: create the g-child\nIt's been on ever since with me and mista grimm\nThis shit is gettin so hectic that i can't even trust him\nNow\nWhat would you do for a warren g cut?\nWould you act the fool and nut the fuck up?\nBack the fuck up, act the fuck up?\nNiggas talk shit they get smacked the fuck up, straight up\n\n(then fade)\nYou don't see what i see, every day as warren g\nYou don't hear what i hear\nBut it's so hard to live through these years\nYou don't see what i see, every day as warren g\nYou don't hear what i hear\nBut it's so hard to live through these years", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "Do you see - old school remix / mix"}]}