{"songs": [{"image": "https://images.genius.com/f58c527b5ff42cca8fe8452cfe959a1d.600x600x1.jpg", "title": "Wanted You", "album": "RECKLESS", "year": "2017-11-03", "lyrics": "[Intro: Lil Uzi Vert & Girl]\nWhere you at?\nAt my house\nLet me see that ass\nWhat you say?\nI said \"let me see that ass\"\nThat ass?\nOh, you on some naked shit\nHahaha\nI'm on my way\nStop lyin'\nI'm on my way, bye\n\n[Verse 1: NAV]\nI'm ashamed of all the things that I was doing for you\nShould've known that all these girls the same and they ain't loyal\nShe a freak, took her to Nobu, on a beach (Yeah)\nJust to eat, Louboutins all on her feet (Yeah)\nWhere you get the money for them shoes, girl?\nYou hit me on my DM like a fangirl (Whoa, whoa)\nDid you want me or did you want these bands, girl? (Whoa, whoa)\nNow I know you just another Instagram girl (Whoa, whoa)\nShe almost made me think that all she want is me (Yeah)\nI hit the club and she the first one that I see\nSaid that she there cause she know promoters in the club (Yeah)\nCome to find out that my homeboy hit her up (Whoa, whoa, whoa)\n\n[Pre-Chorus: NAV]\nAll this ice, I need a freezer, mhm\nWhip it up, egg beater, mhm\nWhipping up two-seaters\nSaid she love me, don't believe her, mhm\nCan't be mediocre, mhm\nTwenty on her choker, mhm\nFuck her, I don't know her, yeah\nGive me face, like poker\n\n[Chorus: NAV]\nWhoa, can't believe I wanted you\nWhoa, I can't believe I wanted you, yeah\nGirl, I can't believe I wanted you\nGirl, I can't believe I wanted you\n\n[Verse 2: Lil Uzi Vert]\nNo, no, no, no, I don't need you (I don't need you)\nNo, no, no, no, I don't need you (I don't need you)\nMan, I swear these girls are see-through (Translucent)\nStevie Wonder, I can't see you (Can't do this)\nShe so hurt, I'm so irked, she get on my nerve (What?)\nMy head hurt, matter fact, kick her to the curb (Bye-bye)\nFound out that she with him, like this verse, get murked (Huh?)\nMy chopper, ego dispersed, yeah, probably die before it hurt, ayy\nCartier lens, I'm on lurk, uh, twenty-thousand for a fur, ooh (Yeah)\nWhat would she do for a purse? (Huh?) She said she'll give me a Perc' (Thirty)\nMy new bitch better, so I cannot sweat her, don't talk to that girl, that's a curve (Now what)\nSpeakin' of sweater, my neck is so frozen it looking just like an iceberg\n\n[Pre-Chorus: NAV]\nAll this ice I need a freezer, mhm\nWhip it up, egg beater, mhm\nWhipping up two-seaters\nSaid she love me, don't believe her, mhm\nCan't be mediocre, mhm\nTwenty on her choker, mhm\nFuck her, I don't know her, yeah\nGive me face, like poker\n\n[Chorus: NAV]\nWhoa, can't believe I wanted you\nWhoa, I can't believe I wanted you, yeah\nGirl, I can't believe I wanted you\nGirl, I can't believe I wanted you\n\n[Verse 3: Lil Uzi Vert, NAV & Both]\nUzi they used to make fun of you (dress it up)\nYeah, all my hundreds blue\nWhoa, little bitch, I'm done with you (I'm done with you)\nHit it from the back while Uzi stand in front of you (Yeah)\n23, but I had her when I was 22 (What?)\nI can't wife that girl, she fucked like twenty dudes (Brown boy)\nYou can't get a kiss, can't get caught tonguing you (Lil Uzi)\nI got lots of girls, no, there ain't just one of you  (That true)\nOff-White on my Prestos, all these girls I'm running through (I'm running through it)\nI can't text her back, these Franklins what I'm thumbing through (Blue hunnos)\nFuck a finger in that bitch, I use a thumb or two (Yeah)\nMade her number one and you ain't even number two\n\n[Pre-Chorus: NAV & Lil Uzi Vert]\nAll this ice I need a freezer, mhm\nWhip it up, egg beater, mhm\nWhipping up two-seaters (Skrrt, skrrt)\nSaid she love me, don't believe her, mhm\nCan't be mediocre, mhm\nTwenty on her choker, mhm\nFuck her, I don't know her, yeah\nGive me face, like poker\n\n[Chorus: NAV]\nWhoa, can't believe I wanted you\nWhoa, I can't believe I wanted you, yeah\nGirl, I can't believe I wanted you\nGirl, I can't believe I wanted you"}], "artist": "NAV"}