{"songs": [{"title": "Freestyle on Sway In The Morning", "album": null, "year": "2019-06-26", "image": "https://images.genius.com/a3d25d0210e13494897cca2f0441ba4c.1000x1000x1.jpg", "lyrics": "Lil 'ol Dick and I'm back in this bitch\nI know y'all know when I rap\nWhat it is? All facts\nDon't fib, got a gang full of hits\nIn touch with the kids like a pedo\nUhhh, I'ma jam like Shaq\nI'mma bang when I wish\nUp in this bish like a fe-tus\nAin't no timelines when you timeless\nHold up, MJ, '96\nMeaning I'm back on my bullshit\nYou know I come hard like a full dick\nSuburban and white...WHIP\nStay with the bread like some Cool Whip, though\nLook how it spread! Cool Whip flow\nI can make 'em ride with an IG live\nAnd my girl got bombs in her Hibaji hive\nIn between her legs it's looking right\nHypotenuse\nUh, bang it all down\nHold up, Sway, lemme break it all down\nBeen out here, citizenship\nLook at how I got everybody tuned in right now\nThey'll probably watch this for an hour\nTracey, I brought you flowers\nAccident\nGas out the ass like flatulence\nI was slept on like mattresses\nI got my head right, Aspirine\nI'm cashin' in, I'm cashin' in\nI'm not aboutta hold a paper and display it like a thumbtack\nNo touchback, they about to run this back\nAnd if you ever met me or root for me\nSharp shit, coming from my dome\nI'm a unicorn!\nPardon my breath\nOnly perky set I fuck with is breast\nElevator, kissing hoes at the Ritz\nFreaky Friday, I get in 'em like Chris\nWait, Sway, pass me the 'roc (Ciroc)\nGet it, pose, jab, pump fake\nHump!\nJumping in 'em, 2 shots at the line\nI got 'em...like a mime\nOdell Beckham, might cut on a dime\nGlow in the dark, see me anytime\nUsed to put the Xbox controller on my dick and let it vibrate\nHow I jerked off as a child\nCame a long way\nNow I'm like:\nAyy, girl! You, me, fuck?\nAnd the shit work\nHey! Her brother looking at me like\nHey...fuck her bro!\nSway, her brother looking at me like\nHey...FUCK HER BRO!\nI'm like Kareem Abdul\nKareem Abdul Jabbar\nThese hooks got me scoring, see me coming from afar\nRapping in France\nI never need an advance\nI'm switching it up like I'm trans\nAlthough I'm the Trojan man, I'm eating the pussy like cervical cancer\nI know where I'm going, but shit if my GPS dies\nI sleep in my Sedan\nI can't do the Shmurda dance\nI get caught up...looking awkward, ya know?\nSometimes I'll catch it for a minute\nOJ wit' it, y'all wonder how I did it\nMy ma' hit me once, she lucky I didn't sue\nBut I'll stomp y'all out like Ndamukong Suh\nAll the shoe brands wanted me to sign\nI remember they thought I was Lonely Island\nThere will not be another like me\nI can go viral if I put out a snippet\nI'm sick like a cold and you really can get it\nI'll always be playing just like I'm embedded\nI gotta leg up like ottomans, though\nMy television show is coming, but that it irrelevant\nRight now I'm rapping like presents get\nHow did I get here?\nI got BIG, rapping like Diddy\nI'm prevalent\nHold up, lemme find the melody\nAll my fans are getting mad at me\nThey just wanna hear me spazzing out\nBut I just had to put a couple smashes out\nHow is this shit a pop star?\nRap name is a dick joke\nHow did he make it that far?\nGood pussy at the crib like a house cat\nThey waiting on my buzz like they out back\nIn and out with the bag like I make tea\nWhen I do shopping sprees\nI browse long like A.D.'s\nGirls get wet like Navy\nPull up like I'm Stephen, she'll cream\nPlayers in the NBA text me\nIf I want a diet coke, someone brings me diet coke\nAll my live show nuts like I expose testicles\nHold up, wait\nLemme ad-lib my shit\n(Oh, yeah, yeah)\nLook at my penmanship\n(I write this)\nI'm a Carl's Jr. model\n(For real)\nJust on the side like soccer moms\nI coulda sold you stocking bombs\nHappened so fast like Ramadan\nThe Autobahn\nDesean been runnin' down the bomb from Carson's arm\nI'm off the farm\nI'm on the court\nThe Jumbotron is on the boy\nThey playing my song\nLeBron is nodding!\nAm I James Worthy?\nLook at my bars I made off like Bernie (ooh!)\nOh, we having fun\nGirls see me and start blushing just because I'm around\nI used to always get a boner at my physical, Sway\nIf this is culture appropriation, what can I say?\nWell would you have me? Dude, you know I gotta rap\nPut the times, now we're scary\nHold up, wait\nTake a step back\nDave, think about this shit\nThe internet is a permanent place\nThis gon' live forever\nUhhh, breathe!\nAnalyse!\nThink about everything\nI'm such an idiot\nI used to cover R. Kelly songs at my shows without even knowing it was problematic\nI feel the pressure under more scrutiny\nAnd what I do? Act more jewishly\nCome on, Sway, write my eulogy\nAm I, living like I needa get a job?\nOr, looking like I need a body guard?\nI, play tennis with Leonardo\nHa, y'all train on track like cargo\nI go dumb-dumb, dumb it up\nDon't fuck on planes, but I'm coming up\nAdd up my views to sum it up\nI was just on Sports Center, dun-na-na\nI think this is good, I've done enough\nMy haters look mad like:\n\"Son of a--\"\nNow lemme go and finish up my album\nJussie Smollett, you know I'mma fuck it up!"}], "artist": "Lil Dicky"}