{"artist": "Doughboyz Cashout", "songs": [{"title": "Therapy", "album": "No Deal on Chill", "year": "2011-11-12", "image": "https://images.genius.com/dccaf9c93fa60d8950c509dfe96a162a.500x500x1.jpg", "lyrics": "[Dr. Maria Gonzales:]\nGood evening Mr. 4-1 Payroll\n\n[Payroll:]\nWhat up doe?\n\n[Dr. Maria Gonzales:]\nI'm Dr. Maria Gonzales, I'm your psychiatrist for today\nI understand you have some issues with women\n\n[Payroll:]\nI ain't got no issues wit these bitches\n\n[Dr. Maria Gonzales:]\nWould you care to talk about why you verbally disrespect women the way you do?\n\n[Payroll:]\nFuck bitches, get money\nThey catch feelings, They get ugly\nI don't trust a bitch far as I could throw her\nThat's why after I hit I play a role like I don't know her\nThis bitch just a snake so I nick named her cobra (Yep)\nShe wonder why I always hit her with the cold shoulder\n(why you do me like that) Cause bitch you beneath me like a coaster\nI den been in more bitches walls then boy band posters\nSo ain't shit new to me, you a little cool to me\nBut askin' me to be your man you soundin' like a fool to me (BITCH)\nMy last girl wasn't shit, I'll do for a bum before I give that ho a cent\n(forreal) See I always been the nigga that these hoes cheated with\nYou prolly wit her everyday but I was just her weekend dick\nMaybe I'll find a real bitch, in this cold world\nBut until then I'mma just call up my home girls\n\n[Dr. Maria Gonzales:]\nHBK, also known as Kid, also known as Heart-Break Kid\n\n[HBK:]\nYeah thats me, please believe\n\n[Dr. Maria Gonzales:]\nYou seem like quite the ladies man\n\n[HBK:]\nYea lil' bit, hoes love me\n\n[Dr. Maria Gonzales:]\nDid you get your heart broken before? Is that why you dog hoes, not just one, but all hoes?\n\n[HBK:]\nLook lemme tell you..\nI ain't a player I just crush alot\nI like to fuck alot, I don't like\nTo keep hoes they fuss alot\nI don't trust alot, not even once\nShe fucked me because I rap\nNow I heard she wanna fuck wit Roc\n(That's my nigga)\nOnly a few times I cuffed the twat\nBut I learn from my lessons, these\nGirls ain't no blessings, only thing\nThey good for is stressin. Play the\nBroke roll just to test em', you fall\nThey ain't gone catch you\nClimb to the top, they what you step in'\nMy heart was made for love, now I use\nIt as a weapon. Got played twice then I\nFinally got the message. Get money\nFuck relationships that shit depressin'\n(fuck hoes) Now you wonder why I dog hoes\nThese bitches reckless (reckless)\nWanna trap me up, tell me not to use protection\nAllergic to the condoms, wanna be my baby mama\nWanna do too much, raise hell and cause drama (drama)\n\n[Dr. Maria Gonzales\nFirst name Brightmo, last name Roc..\n\n[Roc:]\nWhat up?\n\n[Dr. Maria Gonzales:]\nHow are you today?\n\n[Roc:]\nI'm chillen, thuggin, same ole' shit, you know\n\n[Dr. Maria Gonzales:]\nYou seem like a nice young man..\n\n[Roc:]\nI am, I'm a gangster and a gentleman\n\n[Dr. Maria Gonzales:]\nIn one of your songs you said \"Broz over hoes I don't have no heart, Tinman\".. Care to explain?\n\n[Roc:]\nI haven't always been this way\nSee I used to have a heart..\nGave it to a girl and she tore it apart\nAfter that, I pretty much ain't been the same\nI turned into a savage lemme further explain\nThey say love will get you killed so my heart gotta shield\nTryna hit that shit, I ain't got time to chill\nLets be real, why be in relationships when everybody cheatin\n(Real talk)\nBreak up to make up, its gone keep repeatin'\nSingle life less stressful I don't fuss no mo\nI play roles and thats all I don't trust no ho\n(fuck hoes)\nYou think you winnin' but you really losin'\n(you losin' bro)\nWhen you ain't around, ma nigga, yo bitch choosin\n(believe that)\nWhy you playin' girl, you got miles Darius\nRoc in a relationship , joke Hilarious\nDon't hog em ,just dog em\nPass and laugh\nEvery night I'm wasted girl showin my ass\n\n[Dr. Maria Gonzales:]\nI've done my evaluation and I find that you guys are perfectly fine..\nThese hoes ain't shit\nFuck em'! Have a good evening!"}]}