{"artist": "Watsky", "songs": [{"year": "2014-08-14", "lyrics": "[Verse 1]\nIt's the American dream\nBut if you pull on the thread, it's gonna tear at the seam\nSee what I mean? We don't tend to scream\nBaby, we just stare at the screen\nLike it's a preacherman up at the pulpit\nSome with the scars end up holding the bullwhip\nAnother angry kid unloading a full clip\nAnd I could tie a pretty bow on this bullshit\nBut let's not lie for another second\nWe see the trouble, we're rubberneckin\nNo doublecheckin, if it's an issue we have to grapple\nThe words are caught in my Adam's apple\nI make my body a happy chapel\nCause every person's a tabernacle\nBut there's no feeling you gotta hide\nSo let's all pray to the God inside, say it now\n\n[Chorus]\nNever needed a hand til you needed a hand\nYou never know how to walk until you understand\nCoulda been anything that you needed to be\nHow many more do you want? How many more do you need?\nStill I wish I could break free\nIt’s that same old simple song I still believe\nHow many more do we need?\nBefore it’s hand over hand\nLove over everything\n\n[Verse 2 (Anderson .Paak)]\nThat’s me with the long arm\nScreaming at the top dog, spilling my blood on the cement\nWe willing to roll now, sick of getting mowed down\nFuck if I dope now, it’d kill me\nCause I’d rather be known for the dealing\nThan known to be hooked on the feeling\nHow many more gotta go now? How many more gotta go down?\nI’ll stand in the rain witcha, just to get a little bit of glimpse of the plain picture\nPeople need a pinch just to get em to wake up\nYou’ll be in a ditch before I get you to wake up, say it bruh\nWhoever said it wasn’t fair, they was telling the truth\nI’d be a liar if I said there was nothing to prove\n\n[Chorus]\nNever needed a hand til you needed a hand\nYou never know how to walk until you understand\nCoulda been anything that you needed to be\nHow many more do you want? How many more do you need?\nStill I wish I could break free\nIt’s that same old simple song I still believe\nHow many more do we need?\nBefore it’s hand over hand\nLove over everything\n\n[Verse 3]\nThey say we gotta know our role\nKiss the bottom of the totem pole\nSet goals, and then go for gold\nBut we hibernate and hide inside our gopher holes\nI wanna smoke a bowl, a hand on my dick\nWhile the other one is busy clicking the remote control\nI'm no Dalai Lama of the sofa but I hear I gotta go to\nWhere the sinners face the roasting coals\nYou say that your heart ain't got no holes, well bitch please\nLet's all admit that we got souls like Swiss cheese\nBut wishing isn't gonna fill this abyss\nAnd no hand over hand over fisted riches is fixin what's missin\nIf I wanna kill this monotony\nI know the answer is a light that I got in me\nI got no university degree in philosophy\nBut I know that every baby's born with the lock and key\n\n[Chorus]\nNever needed a hand til you needed a hand\nYou never know how to walk until you understand\nCoulda been anything that you needed to be\nHow many more do you want? How many more do you need?\nStill I wish I could break free\nIt’s that same old simple song I still believe\nHow many more do we need?\nBefore it’s hand over hand\nLove over everything", "image": "https://images.genius.com/0199ac49c667975a2b0c5188cae549aa.1000x1000x1.jpg", "album": "All You Can Do", "title": "Hand Over Hand"}]}