{"songs": [{"lyrics": "[Intro]\nUh, yeah yeah, yeah yeah\nUh, uh, yeah yeah, it's me\nBam\n\n[Verse 1]\nAnywhere I go, I stick out like my cousin Vinny (Oh)\nI ride through the city, all kinds of fire vitties (Uh)\nWindow, hair’s down, baby I'm so jiggy (Jiggy)\nAll white at the pool party, vibe on Diddy (Yeah, that's my vibe)\nYeah, baby, catch me live on viddy (Uh)\nI ain’t rolling with nobody if they won't die with me (Nah, motherfucker)\nWhat if murder was the case (Uh), and Papi need a pancreas (Uh)?\nShoot him in his ass, make his stanky leg the stankiest (That shit stinky)\nThe last time they put a wristband on your boy's wrist\nAppeared a 4 point 6 olive green (Woo) with the toy kit (Woo)\nStupid dumb turbo (Uh), howling like a hungry wolf (Ow)\nThe stars align with Virgo, Latin ladies laying, only furs on (True)\nUh, I guess my motherfucking sweater-ter-ter-ter-ter-ter-ter on\nYeah, you know it's me\n\n[Verse 2]\nIt's best you drink your little drink (What?), and do your little dance moves (Do 'em)\nBefore I fucking uppercut you past the planet moon\nSalmon 740, zoom zoom, in the boom boom\nNo racks in effects (No, no, no), I get to the checks (Yup, yup, yup)\nFinesse at it's best (Yup), White Bronco, others known him as LeBronson (It's me)\nMy next album’s only for dolphins (Ow, ow, ow, ow, ow, ow, ow)\nMotherfuckers don’t deserve me, no, I ain't pearly (Nope)\nBitch, ’cause even when I'm dirty, still shine like jewelry\nMotherfucking, uh, yeah\n\n[Bridge]\nI be going through some shit, that's why I smoke a lot (You know it's me)\nI be going through some shit, that’s why I smoke a lot (Uh)\nI be going through some shit, that's why I smoke a lot (A lot)\nI be going through some shit, that's why I smoke a lot (You hear me?)\n\n[Outro]\nYou don't wanna smoke weed, but turning down friends can be tricky\nHey, Bronson, want some?\nNo way, that stuff's illegal\nHey, Bronson, want some?\nUh, I'm allergic\nHey, Bronson, want some?\nUh, no, I gotta stay low\nBronson, want some?\nEh, fuck it, why the hell not?", "title": "Mt. Etna", "album": "White Bronco", "image": "https://images.genius.com/af7ca91e5021a5401fbcc503b74fbc53.1000x1000x1.jpg", "year": "2018-11-01"}], "artist": "Action Bronson"}