{"artist": "King Los", "songs": [{"image": "https://images.genius.com/d6f8a124f84912c3d9dd356c68b040d5.500x500x1.jpg", "title": "Doing You Well", "year": null, "album": "Becoming King", "lyrics": "[Verse 1 - Los]\nDamn baby if you met me half way\nOf course I meet you\nTwo-door coupe, court side seats\n[Hard tie fuck it give you multi love you til you left side shiver screamin’ thats my liver]\nI deliver, I just live a different life I just give her twenty four karat fuck but\nWhy live life bitter?\nWhen you ballin’ and you get it\nYou can get it, I can give it\nLike the good wheels sittin’ on some good wheels hood still rollin\nNice watch and cop nice clothes\nUp in Bergdorf with your best top flight pose\nAnd bag make bad bitches flock like hoes, and\nYour ass make mad niggas not like Los\nYou can pose in the picture froze hit you with the rose\nAnd you roll on the side of roads and you switching clothes\nLike my flows and these bitches pose just to get ya gold\nIf its cold we can cover up\nDamn shorty,fuck is up?\n\n[Hook - Devin Cruise & Los]\nYou know that pussy is mine\nYou can act like it ain't\nShorty get your ass over here\nI’mma write my name on that cake\nI wanna know (why you wanna go do that love?)\nI wanna know (why you wanna go do that, do that)\nWhy you wanna go do that love? huh?\nWhy you wanna go do that?\n\n[Verse 2 - Los]\nI hear your friends talkin’ shorty I’m just coasting throught that\nCouple racks on your bag I’m supposed to do that\nHad a dream of posting you where the ocean view at\nLike an ocean spray commerical where you ‘posed to move at?\nQueen, like the rock band, like the band rock\nWhy its going down like the Ti-tan-nic\nWhy panic I got you dont never worry baby\nYou got a man but we fuckin just like we married baby\nAll you do is call me when he fuck up\nBut I ain't trippin’ we takin’ trips and we drinkin’\nI just ask that you say the shit that you thinkin’\nIf you need to get away we can make a date and we linkin'\nTake you out that Lincoln, cop bigger closets to put some minx in\nHave you ridin’ money hunny feel like you pulling the Brinks in\nBaby we be flexin’, VVS inside of them links and\nIf you ready for your queen then I fly you out to the king shorty\n\n[Hook - Devin Cruise & Los]\n\n[Verse 3 - Los]\nHold up, King\nIf that nigga stepped up to you wrong\nAnd get out of character like his Twitter message too long\nLike you ain't the best you stressin’ and autopress on the phone\nWhen the sun rise I wish you all the best in the moonlight like\nLike, heres your piece of the sun\nThis is my piece of advise\nJust tell em peace and you done\nIt’s like releasing a ton\nThat pain ain't good for your mind\nJust tell that pussy he’s done, just say that pussy is mine\n\n[Hook - Devin Cruise & Los]"}]}