{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": null, "lyrics": "[Intro]\n(Four, three, two, one)\n\n[Verse 1]\nAyyo, back around, there's a new crew in town\nThe Mandingos, we get down, the Bad Brains\nRugged Man, yeah, we the type that steal your chain\nUnderground shit in case you don't know our names\nYeah I got hip hop flowing through my veins\nStop that crazy thing jup-juppa-jup-juppa-Jane\nJamming, the Germanan, Deutschlanden\nStanding, who the fuck let the Rugged Man in\nI'm like you don't know how we rock the show\nAnd y'all can't see how we bout to blow\nIt's like budum budum, b-guitar off-beat retard he chubb, with the heat up\nWe are white-wigga-white-wh-white\nYou're a gangster right, why you're scared to fight?\nI'm like Rugged Man eat y'all, defeat y'all\nEducate you, teach y'all, to the beat y'all\n\n[Hook]\nHow low can you go\nLower baby lower baby lower lower\nHow low can you go\nLower baby lower baby lower lower\nSwitch it up\nHigh higher baby higher baby higher higher\nAll right put your hands in the sky\nHigher baby higher baby higher higher\n\n[Verse 2]\nRock rock on, rhythm, blues and soul\nGet off the dancefloor, baby lose control\nI'm like what you suckers can say to me?\nThrow your hands in the air if you fuck for free\nAnd girls put your hands up if you take money\nAnd guys yell \"hoes you ain't getting shit from me\"\nBombama, cock the hammer, shamalama, body slammer, that's the way I am a\nNow party people in the place to be\nYou see the Rugged Man rock on the m-i-c\nCapital W-h-i-t-e\nAin't not one rapper out there can fuck with me\nWho we? We the D-I-double B\nDo your homework, let 'em learn your history\nHypnotic, hot shit robotic, pop rock, dirty dance erotic\nGet, get retarded\n\n[Hook]\nHow low can you go\nLower baby lower baby lower lower\nHow low can you go\nLower baby lower baby lower lower\nSwitch it up\nHigh higher baby higher baby higher higher\nAll right put your hands in the sky\nHigher baby higher baby higher higher\n\n[Verse 3]\nIf you ain't got a nickel to your name\nAnd you still bringing none home with you then scream\nYou got a big fat nice juicy fat behind\nYou over 200 pounds, I'mma make you mine\nSee you in the club yeah we gonna bump and grind\nAnd let's party like it's 1999\nIt's 2000 Queens, NYC\nSuffolk County, me, Washington D.C\nAll my dirty white people, raise the roof\nAll my dirty black people, raise the roof\nIt's like we're a band hand in hand, this ain't just your ordinary jam, It's the Mandingo fam\nAnd if you got big titties and a big fat ass\nAll my women in the house go get that cash\nYou see ain't nobody messing with the Rugged Man\nI'm back by unpopular demand\n\n[Hook]\nHow low can you go\nLower baby lower baby lower lower\nHow low can you go\nLower baby lower baby lower lower\nSwitch it up\nHigh higher baby higher baby higher higher\nAll right put your hands in the sky\nHigher baby higher baby higher higher", "title": "How Low", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}