{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/5dafbaa360c868e1021c9f7c66cbdf4a.1000x1000x1.jpg", "title": "Identity Theft", "year": "2018-12-14", "album": "Dying to Live", "lyrics": "[Intro]\nRippa on the beat, bitch\nFresh out of jail, but don't think I'm scared to go back, motherfucker\nI still'll hit a nigga with that glizzy\nIf rap don't pop, I'm back to stealin' identity, I'm back to credit card theft\nBack to credit card fraud\nFresh out of jail and Atlantic Records dropped that bag on me\nYeah, them crackers just dropped that bag on me again\nLet me hear it\n\n[Chorus]\nFresh out of jail, made another milli'\nAnd bitch, don't think I changed, 'cause I didn't\nI'll still'll hit a nigga with that glizzy\nIf rap don't pop, I'm back to stealin' identity\nCredit card fraud, I'm in an Infiniti\nI just took my brother's charge like I am not rich\nI took my brother's charge like I ain't got shit\nI guess he ain't step up for me 'cause he ain't got it in him\n\n[Verse]\nI'm walkin' 'round with fifty thousand in my denim\nAnd I don't trust nobody, I'm drinkin' snake venom\nAnd I don't like you nigga, man, I'm just sayin'\nI don't really like you bitches, I be just playin'\nBefore I jumped up off the porch, I was ready then\nLet's see if I can shoot the pistol with my left hand\nType of nigga hit the party with my FN\nType of nigga fuck a shawty and her best friend\nI be gettin' to the loot, I be gettin' it in\nFree my niggas eatin' soup 'cause they in the can\nRoad runnin', gettin' money, I be pullin' scams\nRedrum, head huntin', nigga, what you sayin'?\nIf you fuck with me, then why you got me doin' time?\nIf you fuck with me, then why you got me slangin' iron?\nAll these bitches on my dick, but they can't even ride\nGot my mama out the bricks, she ain't gotta cry\nAyy, don't be fuckin' with my clique if you ain't tryna die\nI'm a Zoe, don't call me Slime, then you is not my kind\nI be steppin' on these niggas, I don't rest up\nI put my foot down on that bitch, she be like, \"Yes sir\"\nFree my nigga JGreen, took one for the team\nHit the bank, I want no dubs, don't even\nKodak Black, I don't fuck with cuz, cuz green\nHit the slab, go and run it up, you know what I mean\n\n[Bridge]\nYou know what I mean? You know what I'm sayin'?\nFree my niggas eatin' soup 'cause they in the can\nYou know what I mean? You know what I'm sayin'?\nFree my niggas eatin' soup 'cause they in the can\n\n[Chorus]\nFresh out of jail, made another milli'\nAnd bitch, don't think I changed, 'cause I didn't\nI'll still'll hit a nigga with that glizzy\nIf rap don't pop, I'm back to stealin' identity\nCredit card fraud, I'm in an Infiniti\nYeah, I just called Chief, he said that's not it\nYou keep tweetin' 'bout a nigga, get your block hit\nI guess he ain't fuckin' with me 'cause I ain't fuckin' with him"}]}