{"songs": [{"album": "Urban Legend", "image": "https://images.genius.com/89f8bb562c24333925bf326dd11066d7.600x600x1.png", "year": "2004-10-19", "title": "Bring Em Out", "lyrics": "[Intro: Jay Z snippet]\n(Bring 'em out, Its hard to yell when the barrels in ya mouth) Swizzie!\n(Bring 'em out, bring 'em out) Aye!\n(Bring 'em out, bring 'em out) T.I\n(Bring 'em out, bring 'em out) Aye!\n\n[Verse 1]\nTIP comin live from the VIP, heard the night life lost life without me\nBoth the Feds and the State wanna see bout me\nThe whole city got bizzerk he got treat\nAnotha nigga got a hit but shawty he not me\nWho set the city on fire as soon as he got freed\nDa king back now broads don't even know how to act now\nHit the club, strippers gettin' naked 'fore I sat down\nStill ballin money stack taller than Shaq now\nStill push a button to let the roof on the 'Lac down\nI'm on the road doin shows puttin my mack down\nMississippi to Philly Albuquerque to Chatt Town\n\n[Chorus]\nI got the crowd yellin (Bring 'em out, bring 'em out)\nAye, all my hotgirls yellin (Bring 'em out, bring 'em out)\nAye, all the Dope Boyz yellin (Bring 'em out, bring 'em out)\nAye, from the back they yellin (Bring 'em out, bring 'em out)\n\n[Verse 2]\nOnce again what other rap nigga hooder than this\nI got rich and I'm still on some hoolagin shit\nYou be rappin bout blow I was movin the shit\nYou talkin bout shootin out and I was doin the shit\nIf I hit you in the face you gon be suin and shit\nAnd if I catch anotha case I know I'm truly to be missed\nSo I'mma keep it cool head stay out of the news\nHeadlines and shows other rappers its bedtime (bedtime)\nIt's clear to see that I'm ahead of my time\nI copped a chromed out hard top Carrerra to shine\nI got some time, it ain't shit cause I get better wit time\nWho got a flow and a live show better than mine\n\n[Chorus]\nI got the crowd yellin (Bring 'em out, bring 'em out)\nAye, all my hotgirls yellin (Bring 'em out, bring 'em out)\nAye, all the Dope Boyz yellin (Bring 'em out, bring 'em out)\nAye, from the back they yellin (Bring 'em out, bring 'em out)\n\n[Verse 3]\nMic check 1-2 1-2, you wanna beef wit the king what is you gon do\nWill you show up on the scene wit 2 guns drew\nOr you and ya friend and play a little two on two\nIf you knew half of what I knew then you'll be hittin the deck\nGot a tool and a vest I can get some respect\nI'mma make it hard for a sucka nigga to flex\nSho 'em this ain't the squad for a nigga to test\nPimp my nutz too large and we way too fresh\nWork well wit Nines, AK's, and Tecs\nAnd quick to check a lame like a game of chess\nYou want beef you can bring ya best and we'll be standin..\n\n[Chorus]\nI got the crowd yellin (Bring 'em out, bring 'em out)\nAye, all my hotgirls yellin (Bring 'em out, bring 'em out)\nAye, all the Dope Boyz yellin (Bring 'em out, bring 'em out)\nAye, from the back they yellin (Bring 'em out, bring 'em out)\nI got the crowd yellin (Bring 'em out, bring 'em out)\nAye, all my hotgirls yellin (Bring 'em out, bring 'em out)\nAye, all the Dope Boyz yellin (Bring 'em out, bring 'em out)\nAye, from the back they yellin (Bring 'em out, bring 'em out)\n\n\n[Break: Swizz Beatz]\nHands... In Da... Air... Now!\nHands... In Da... Air... Now!\nHands hands in the in the air air now!\nHands... In Da... Air... Now!\n\n{*Bring 'em out, bring 'em out + ad libs to the end of the track*}"}], "artist": "T.I."}