{"songs": [{"lyrics": "[Produced by The Hitmen & Knobody]\n\n[Intro: Pain In Da Ass]\nAh shit, okay, okay, alright\nBig man! You wanna make some big bucks, huh?\nLet's see how tough you are\nYou know something about cocaine? Digame!\nYou kidding me or what man?\nThere's a bunch of Colombians coming in Friday - new guys\nThey said they got two keys for us, for openers\nPure cocaine, you tell 'em, capiche?\nI want you to go over there\nAnd if it is what they say it is, you buy it, you bring it back\nYou can do that you make five grand\nMeet them at the Bodegas, noon Friday\nYou get the buy money then\nOh and chico, if anything happens to the buy money\nEh, pobrecito\nJAY-Z's gonna stick your heads up your asses faster than a rabbit gets fucked\n\n[Break: Jay-Z]\nBounce.. bounce, bounce, Jay-Z huh?\nYeah, yeah, yeah, Roc-A-Fella y'all, ha ha\nBounce, bounce, bounce, Roc-A-Fella y'all\nCheck, check\n\n[Verse 1: Jay-Z]\nYo, I'm making short term goals when the weather folds\nJust put away the leathers and put ice on the gold\nChilly with enough bail money to free a big Willie\nHigh stakes, I got more at stake than Philly\nShopping sprees, cop in three\nDeuce fever IS's fully loaded, ah, yes\nBouncing in the Lex Luger, tires smoke like Buddha\n50 Gs to the crap shooter, niggas can't fade me\nChrome socks beaming\nThrough my peripheral I see you scheming\nStop dreaming, I leave your body steaming\nNiggas is fiending, what's the meaning\nI'm leaning on any nigga intervening\nWith the sound of my money machining (brrrr)\nMy cup runneth over with hundreds\nI'm one of the best niggas that done it, six digits and running\nY'all niggas don't want it\nI got the Godfather flow, the Don Juan DeMarco\nSwear to God, don't get it fucked up\n\n[Chorus 1: Mary J. Blige (Jay-Z)]\nI'm taking out this time (yeah, yeah, what)\nTo give you a piece of my mind\n('Cause you can't knock the hustle)\nWho do you think you are?\nBaby one day you'll be a star\n\n[Verse 2: Jay-Z]\nLast seen out of state where I drop my sling\nI'm deep in the South kicking up top game\nBouncing on the highway switching fo' lanes\nScreaming through the sunroof, money ain't a thang\nYour worst fear confirmed\nMe and my fam roll tight like The Firm\nGetting down for life, that's right, you better learn\nWhy play with fire, you burn\nWe get together like a choir, to acquire what we desire\nWe do dirt like worms, produce G's like sperm\n'Til legs spread like germs\nI got extensive hoes with expensive clothes\nAnd I sip fine wines and spit vintage flows\nWhat y'all don't know?\nYeah, yeah, yeah, yeah, cause you can't knock the hustle\n\n[Chorus 2: Mary J. Blige (Jay-Z)]\nBut until then lately, I'm the one who's crazy?\n'Cause that's the way you're making me feel\n('Cause you can't knock the hustle)\nThe way you make me feel\nI'm just trying to get mine, I don't have the time\nTo knock the hustle for real\n\n[Verse 3: Jay-Z]\nYo, y'all niggas lunching, punching the clock\nMy function is to make much and lay back munching\nSipping Remy on the rocks, my crew something to watch\nNothing to stop, un-stoppable\nScheme on the ice, I gotta hot your crew\nI gotta, let you niggas know the time like Movado\nMy motto, stack rocks like Colorado\nWaddle off the champagne, Cristals by the bottle\nIt's a damn shame what you're not though: (who?) me\nSlick like a gato, fucking Jay-Z\nMy pops knew exactly what he did when he made me\nTried to get a nut and he got a nut and what\nStraight bananas; can a nigga see me\nGot the US Open, advantage Jigga\nServe like Sampras, play fake rappers like a campus\nLe Tigre, son you're too eager\nYou ain't having it? Good, me either\nLet's get together and make this whole world believe us, huh\nAt my arraignment screaming\nAll us blacks got is sports and entertainment, until we even\nThieving, as long as I'm breathing\nCan't knock the way a nigga eating, fuck you even!\n\n[Chorus 1 + 2: Mary J. Blige]\nI'm taking out this time\nTo give you a piece of my mind\nWho do you think you are?\nBaby one day you'll be a star\nBut until then lately, I'm the one who's crazy?\n'Cause that's the way you're making me feel\nI'm just trying to get mine, I don't have the time\nTo knock the hustle for real\n\n[Mary J. Blige ad libs to fade]", "title": "Can’t Knock the Hustle", "image": "https://images.genius.com/c2dd076c930415460ce3ec837632640d.606x605x1.jpg", "year": "1996-08-27", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}