{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/d9e12ac076751af2018144a8f963b6c6.640x640x1.jpg", "title": "My Life (Remix)", "year": null, "album": "Soundbombing III ", "lyrics": "[N.O.R.E. - speaking]\nN-O-R-E, Nore, Niggas On the Run Eatin *coughing*\nSo let's big up Kool G. Rap because that's the motherfucking man\nYou un' the dig, Kool G. Rap, man, you know what I'm sayin?\nGodfather of gangsta, ghetto, project, complex, co-op, hip-hop\nG. Rap influenced me in, not in any way but in every way almost, you know the dig?\nN.O.R.E. - Nore, G. RAP!\nIf y'all don't know about G. Rap, y'all don't know about rap!\n\n[G-Wise * vocoder]\nG. Rap - see you again, baby (my life nigga)\n\n[Hook: G-Wise * vocoder]\nAll of my life, I live\nI'll be thuggin with youuuuuuu\nRock it out baby, knock it out baby\nWon't stop 'til I die for this\nI'll be keepin it trueeeeeee\nYeah yeah yeah yeah\n\n[N.O.R.E.]\nYo, yo\nIt's mafia ties, rules, let 'em fuck each other's wives\nNiggas is real stupid and they think like chicks\nThey was dealing with ounce money 'til I bought the bricks\nI done walked through the valley of the shadow of death (yeahhhh)\nAnd smoked cigarettes, constant, step for step (oh yeah)\nIsland-style, four-bill and mop your neck\nI got the bandana, see, it's already a \"B\"\nI'm like Santana from American ME\nThey call me D.A.N. - Dead All Nore (D.A.N. - Dead All Noreeeee)\nAnd I got guns, y'all ain't got nothin for me\nFuck the popo, cuz niggas don't leave no prints (prints)\nNiggas gave me a brick and ain't seen me since (yeahhhh)\nNow I'm out the game like Kane and them\nAnd now niggas want me, I ain't blamin them\nI got guns that stretch south, macs and tecs out\nI big'd up, copped the five, fuck a six, what!? (ohhhh oh oh)\n\n[Hook]\n\n[Capone]\nI speak on phones in Kohl's, my shit stay tapped\nLike Gregory Hines, wild since seventy-nine\nI'm federal time, still an enemy of the state\nThey had to beat the murder case back in eighty-eight (tell 'em bout it)\nJudge Hoffman gave fifteen to Q-God's\nStarted riots in the jungle like the Rodney King charges\nIn L.A., what up essa? (whaddup) I spray tre' pounds (yeahhhh)\nTo nueva, I'm loco nigga (loco)\nI'm the one that made attempts on the popo bigger\nI put crazy work in, (that's right) fuck who criticize my verses\nI only rap, cuz the streets is sour\nThe money is good and I couldn't find sheets for powder\nI could get on some bullshit, (on some bullshit) y'all niggas understand me?\nI keep heat like Miami, fry for family (what? fry for family)\nRubbing tat for infanity, I curse the game\nMenace to Society like O-Dog and Kane (yeah, yeah, yeah, yeah)\n\n[Hook]\n\n[Kool G. Rap]\nAll of my life, uh-huh uh-huh\nNigga into warm mansion rooms, wall to wall with handsome goons\nHalf-naked bitches dancin to tunes (uh-huh)\nMarble floor to the terrace nigga, glance at the moon\nPlay the jacuzzi 'til your hands get blue\nRugs tight, bright as the white sands of Cancun (yeahhhh)\nSkylights up in the ceilings for the plants to bloom\nNigga we crop grams in dunes, Cuban cigar brand of grandest fumes\nPrison niggas that ran balloons\nShut down shop from Jan. to June, and still cop land in the boons\nFuck women in tanning rooms\nEvery last fingernail on their hand groomed, self built do\nDown to the mink pelts, gator belts and silk suit\nIf I can't stack a nigga cap get peeled loose\nWord to them cats that died on the street, it's spilled juice\nSo where that Don be? In the calm breeze in the palm trees\nBomb G under the armpiece (yeahhhh)\nLivin in harmony, coke farm pharmacy\nBulletproof armory, school of the hard knock honory\nWashin the jackpot like laundry\nFuckin Don of the year nominee, honestly (All of my...)\n\n[G-Wise * vocoder - two voices at once]\nLife, we spend, someone - know someone\nWe spend, (yeah) we spend...\nAnd what about - where you come from (where you come from, where you)\nWhat about - You will get up on-on... My life, my life, my life\n\n[Hook]\n\n[Kool G. Rap]\nWhat.. uh...uh-huh\nYeah, thug shit, Queens clicks"}]}