{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/b55066a4d9c23965c80b13a93ffa9cd0.640x640x1.jpg", "title": "Parental Discretion", "album": "Capital Punishment", "lyrics": "[Verse 1: Big Pun]\nAyo I'm hard to talk to, if you live I probably fought you\nStalked you where you walked to at night\nCaught you then tried to extort you\nNew York niggas is trigger happy, got Pataki scared\nThis town ain't big enough for both of us and I ain't goin' nowhere\nThere it is, plain and simple like Jigga my game is mental\nWhile slow niggas better know I blow their brains out they temples\nI'm into black magical torture romantic dramatical author\nCompatible with the average New Yorker\nA fast talker, like Tony when he gassed Sosa\nThe masked enforcer, out for the cash and the cho-cha\nSmash the coca, bottle it up, watch the fiends gobble it up\nIf I roll up, you do what? Swallow the stuff\nI don't give a fuck anymore, I'm only twenty-four years old\nAnd I've already broken every law\nI'm horror core, this is for the heads\nRunnin' up in your crib, now if you still hiding under the bed\n\n[Chorus: Busta Rhymes]\nParental discretion advised, cover your eyes\nLittle kids -- get out of here! This shit's is homicide!\nDrugs and money, this ain't no Bugs Bunny!\nLittle girls too; this ain't for you, it's for the thugs honey\n\n[Verse 2: Big Pun]\nHey yo my shit's the truth, 150 proof no question\nParental discretion advised, keep out the eyes of the youth\nIt's too explicit, bullshit! I challenge the statistics\nViolence existed before our music was even suggested\nArrested on sight, it's like there's no rights\nThat's why I rhyme so aggressive and bring every message to life\nI fight the power, spite the power the 90 percent\nKeep 10 and feed Twin half for personal reasons\nThe seasons change, things re-arrange, but I stay the same\nI play the game for the wealth, until I've made myself a name\nSo blame it all on the gangster rapper, thanks to Joey Crack\nFor the chance to do it my way like Frank Sinatra\nI ain't an actor so it's all facts, strictly raw rap\nTotally intended for yours dressed in all black\nWith the ski mask or the pantyhose makin' cameos\nIn liquor store cameras with the twin Calicos\n\n[Chorus: Busta Rhymes]\nParental discretion advised, cover your eyes\nLittle kids -- get out of here! This shit's is homicide!\nDrugs and money, this ain't no Bugs Bunny!\nLittle girls too; this ain't for you, it's for the thugs honey\nParental discretion advised, cover your eyes\nLittle kids -- get out of here! This shit's is homicide!\nDrugs and money, this ain't no Bugs Bunny!\nLittle girls too; this ain't for you, it's for the thugs honey\n\n[Verse 3: Big Pun]\nSo forget the boom, one look, you shook -- you know I'm stickin' you\nLiftin' you off the ground, look down -- that's where I'm puttin' you\nLook in my eyes and remember me, how does it feel mentally\nHavin' the enemy be the last thing you ever see?\nThe recipe is death and I'm the chef, fricasseein' your flesh\nBe my guest, but I ain't cleanin' the mess\nMe and TS we testin niggas faith, just to see they face\nExpression when destined to states, that death be in the case\nI'm in the state of grace, in the hated race, by the pagan face\nCouldn't fight us, made a virus, gave us AIDS\nI paint the wake 'cause they ain't get me yet, wet me\nOr reflect me yet, I know they comin' they just tryin' to let me sweat\nI recollect when I was just a boy, eatin' Chips Ahoy!\nWasn't allowed to raise my voice, now I'm makin' noise\nNo more toys, strictly MACs and missiles, shorties with forties\nPackin' pistols, catchin' bodies makes you official\nSo they say, I pray there's a better way\nMy kids don't do as I do, they do as I say, 'cause daddy don't play\n\n[Chorus: Busta Rhymes]\nParental discretion advised, cover your eyes\nLittle kids -- get out of here! This shit's is homicide!\nDrugs and money, this ain't no Bugs Bunny!\nLittle girls too; this ain't for you, it's for the thugs honey\nParental discretion advised, cover your eyes\nLittle kids -- get out of here! This shit's is homicide!\nDrugs and money, this ain't no Bugs Bunny!\nLittle girls too; this ain't for you, it's for the thugs honey\n\n[Outro: Busta Rhymes]\nWord is bond\nOne thing about MCs is that we don't conceal the truth\nWe present real pictures about the positive and the negative\nSo don't blame the hip-hop when your seed is learnin' the real life from us\nDo your duty at home and raise your child in the house\nParents\nYou don't do your job we gonna put your children to bed at nine o'clock\nPast your bedtime\nYou get your ass in bed you ain't 'posed to be hearin' this shit\nWord up, punishment motherfuckers!\nBy the Punisher and Busta Rhymes, hah\nTerror Squad! Flipmode Squad niggas!"}], "artist": "Big Pun"}