{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "Still Be Homies", "year": "2014-06-25", "lyrics": "[Intro: Boogie]\nYeah-yeah, uh\nForever fucking with my homies\nI swear I’m, forever fucking with my homies\nShit, my niggas here right now, matter-fact\nThirst, thirst, Thirst 48, uh\n\n[Verse One: Boogie]\nOkay, back when I was off, had my back to all my flaws\nRather backed into a corner just from backing up my dogs, uh\nShit, them still my niggas, I never show no doubt\nNever picking on my clique ‘cause niggas understand this route\nThrowing out this message, I’m hoping that y’all catch it\nFuck with niggas when they loyal, even times when they get desperate\nMy niggas extra, but some got cut off in a nigga path, them niggas trash\nIf they ain’t growing with you, cut they midget ass, that’s real shit\nWe like 50 niggas deep (?), uh\nI’m just praying one of you fuck niggas don’t trip\n‘Cause we accustomed to the thugging, we ain’t budging\nNiggas dumping at the function for the fact that they ain’t want it\nWe like “fuck it though” ’cause what the fuck is going on out here?\nWhat the fuck these niggas doing out here?\nThis shit crazy how your main homie probably wanna switch up\nYou think your enemy gon’ pop and now he tryna clique up\nThat shit weak\n\n[Chorus: Boogie]\nNever acting phony\nEven when I’m outchere on my motherfucking lonely\nForever fucking with my homies\nThey asking why I’m loyal\nProbably ‘cause you never seen my motherfucking soil\nForever fucking with my homies\nScreaming ’til my breath sold\nLil nigga, them still blessed though (?)\nForever fucking with my homies\nHuh, yeah, uh, I swear I’m\nForever fucking with my homies\n\n[Interlude: 2Pac]\n(When I’m saying “thug,” I mean, not “criminal,” not someone that’s gonna beat you over the head. I mean the underdog. The person that had nothing and succeeds—he’s a thug, ‘cause he overcame all obstacles. It doesn’t have anything to do with the dictionary’s version of “thug.” To me, “thug” is my pride. Not being someone that goes against the law, not being someone that takes, but being someone that has nothing and that—even though I have nothing and there’s no home for me to go to, my head is up high. My chest is out, I walk tall, I talk loud—I’m being strong.)\n\nBeat Switch\n\n[Interlude: Boogie]\nI’ma still be thugging, I’ma still be thugging\nI’ma still be, yeah\nR.I.P. Gotti, R.I.P. Manny, R.I.P. Sav (?)\nR.I.P. Not(?)\nStill be thugging, I’ma still be thugging\nUh, shit, hoo!\n\n[Verse Two: Boogie]\nFuck is this shit? This what my thugging’ll get\nI seen a nigga get punched for his kicks\nHe got punched in his lip, tryna fuck with his bitch\nI was looking like, “Man!” Block full of stress\nBlake at the spot on the left\nI passed him the blunt, then he dipped it in lean\nWhen I walked in the house he got shot in the neck\nI was looking like, “Damn!” Now I’m worried for the homie\nYeah I’m worried for the homie, shit!\nYou know the cops finna really take they sweet-ass time\nThey don’t worry for the homie\nI be feeling like “Damn!” Hoo, and the day I got popped\nCouldn’t even call my pops, I was right back on the block\nStanding outside the door, like, “Who tryna get knocked?”\nKnock! Knock! Hoo!\n\n[Hook]\nI’ma make a hundred mil one day\nBet I still be thugging\nHoo! They could throw a hundred years my way\nBet I still be thugging\nDamn! Ain’t no fake shit around my way\nI’ma still be thugging\nMan, I’ma still be thugging, I’ma still be thugging\nI’ma still be thugging, I’ma still be thugging\n\n[Outro]\nThug Life, uh\nI’ma still be thugging, I’ma still be thugging\nThug Life, uh\nI’ma still be thugging, I’ma still be thugging\nYeah, hoo\nI’ma still be, yeah, I’ma still be thugging\nI’ma still be thugging, I’ma still be thugging", "image": "https://images.genius.com/967988d72ade953e4d1121eb78757aa7.1000x1000x1.jpg"}]}