{"songs": [{"image": "https://images.genius.com/e17405e2733b5041674652adbaadf26d.595x595x1.png", "title": "E.I.", "album": "Country Grammar", "year": "2000-06-27", "lyrics": "[Intro]\nUh.. uh uh uh uh\nUh.. wait a minute now\nUh-ohhhhhhhhhhhhhh!\nUh, uh..\nCan you hear me out there?\nLunatics.. is y'all ready?\nLet me hear ya\nUh-ohhhhhhhhhhhhhh!\n\n[Verse 1]\nI'm a sucker for corn rows and manicured toes (hey)\nFendi capri pants and Parasuco's (alright)\nThe rise of Diddy and City, with one or two throws\nI'm draftin' 'em outta high school straight into the pros\nWho knows? I know and I love it when you make your knees\nTouch your elbows and break it down low to the\nFlo' and there you go now throw it on me slow and\nEverytime I bust a rhyme, baby, \"Gimme Some Mo'\"\nYou say you like that, when I hit it from behind and I'll be\nRight back, yeah that's my very next line, I use it\nTime after time, when I'm speakin' my mind\nIt's no matter if I'm shootin' game to a pigeon or dime\nI ask her, \"Who that is, talkin' that shit about the 'tics?\"\nSomebody probably jealous 'cause they bitch got hit\nBut ain't nobody else droppin' shit like this\nShould we apologize? Nah fuck 'em, just leave 'em pissed, hey\n\n[Chorus]\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh what's poppin' tonight?\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh, if the head right, Nelly there ery'night\n\n[Verse 2]\nWe can gamble to the\nBreak of dawn, nigga, money long, nigga\nPass up the skirt to talk to the thong, nigga\nSome say I'm wrong, but fuck it I'm grown, nigga\nIf you ain't 'bout money then best be gone, nigga\nI'm flashy (uh), double takes when you walk past me\nNasty, don't be scared boo, go 'head and ask me\nI drive fastly, call me Jeff Gord-on in the\nBlack SS with the naviga-tion, see the\nJoint blaz-on, somethin' smells amaz-on, I got a\nChick rollin' up, half black and Asi-an. Another\nOne page-in, tellin' me to come home, her husband\nOn vacation and left her home alone. I used the\nV-12, powers; weight loss, powers\nFrom Phat Farm to Iceberg Slim in one shower, get a\nRoom in Trump Towers just to hit for 3 hours, kicked the\nBitch up out the room 'cause she used the word ours, hey\n\n[Chorus]\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh what's poppin' tonight?\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh, if the head right, Nelly there ery'night\n\n[Verse 3]\nAyo, I smash-mouth a whole ounce, of that sticky, wash my\nHands under a gold spout, when feelin' icky. Let\nGo off in a ho's mouth, I ain't picky. Start\nFrontin' when the shows out, whatchu mean?! Twenty\nInches when they roll ouuuuuuut, come and get me. Big\nFaces when they fold ouuuuuuut, is you wit me? Don't make me\nPull that fo'-fo' ouuuuuuut, I keep it\nCloser when the dough ouuuuuuut, then I\nSlide up in the Escalade, me and E gettin'\nSolid like the Ice Capades and me and Heezy\nFrosty, Roger the Rabbit and Bugsy, you\nUnderstand me, wrapped wrists like mummies. If\nYou compare me to your local grocery then\nYou'll see I got more karats than Aldi\nMore bread than aisle G, then bag and scan me\nSure like Al B., meet the 'tics in Maui, hey\n\n[Chorus]\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh what's poppin' tonight?\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh, if the head right, Nelly there ery'night\n\n[Bridge]\nSt. Louis y'all, uh, uh\nUh-ohhhhhhhhhhhhhh\nUh, can you feel that?\nLunatics y'all, uh, uh\nUh-ohhhhhhhhhhhhhh\nUh, uh, Uncle Phil up above y'all, uh, uh\nUh-ohhhhhhhhhhhhhh\nYell it universal y'all, uh, uh\nUh-ohhhhhhhhhhhhhh\nUh, uh, chillin' chillin' chillin' with the crew y'all\n\n[Chorus]\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh what's poppin' tonight?\nAndele andele, mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh, if the head right, Nelly there ery'night"}], "artist": "Nelly"}