{"songs": [{"year": "2011-09-20", "image": "https://images.genius.com/011792ab806035facb1c85a728f20736.500x500x1.jpg", "title": "Sloppy", "album": "No Filter  ", "lyrics": "[Verse 1: Kutt Calhoun]\nPull up to the club like I own it\nBeat like Brr, niggas know I'm on one\nHop out with a stagger on, wait in line, I'm in now\nSoon as I step in the door, I'm eying all you niggas down\nTurnt up, and I ain't got no pationts\nTell the bartender I'm tryna get whiteboy waisted\nMixin dark in here, like it's the thing to do\nDancing with my hands, so watch if my fingers get to banging too\nI smell trouble, the niggas over there trippin\nScooby see the bitch niggas, he like \"Yeah\"\nBut I ain't fessin, I'm still lookin at this bitch's ass\nI see that pussy scooting closer, and he moving fast\nSoon as he got within 2 feat, the bottle smacking back\nThen he got caught with a 2 piece, I had to stab\nThen turn the lights on, then all the niggas was sayin was \"what happen?\nI was turnt like man, man, man\n\n[Chorus: Big Scoob]\nI'm sloppy, nigga, fall down drunk\nI'm just itchin for some fun\nI'm sloppy, nigga, fall down drunk\nWhy you pussys keep playing with me, bruh?\n\n[Verse 2: BG Bullet Wound]\nYou see me walkin in, but ain't no walkin out\nI'm off that Wisky lil nigga, so what you talkin bout?\nYou think you poppin, cause BG Bullit sloppy?\nYeah I got 50 on my fingers, company don't even drop me\nI'm off the Wisky homie, pass me that Jin, nigga\nI think I pissed off them bouncers, but they let me in, nigga\nStay on my white gear, hello, this Big Mac\nCan't hear what they tryna tell us, lil homie, step back\nI got eyes on ya, all my guys on ya\nWhile I'm in the club, and I'm actin nutty, put the 5 on ya\nBe a surprise homie, I'm really with the shit\nAnd it really tastes wikid, gotta be sloppy to do the shit\nFuckin with Big Scoob, the homie Big Scoob\nWhile I'm off that crown, and I'm waiting to get food\nI keep them closed in, swinging on all men\nYou don't believe me, just ask the big homie Big Ben\n\n[Chorus: Big Scoob]\nI'm sloppy, nigga, fall down drunk\nI'm just itchin for some fun\nI'm sloppy, nigga, fall down drunk\nWhy you pussys keep playing with me, bruh?\n\n[Verse 3: Big Scoob]\nBall cap, white T, with my Js on\nThey know I'm here, I spend till my money's gone\nMy pockets healthy, I'm wealthy, so I'm bout to ball\nBefore the rap game, boy, I been a star\nAt the bars, only job is pourin Wisky\nThey got me tipsy, now I'm trippin with these niggas with me\nThey tell me \"chill\", before they tryna kick me out the bar\nI been put out of better places by far\nDrunk and stupid, bout to lose it, so sloppy with it\nDon't matter if you estamate the skemes, you can still get it\nSo pussy, treat me like I own the club\nOr let's be real with it, Scoob gon fuck you up\nMy glass is empty, eh, bitch, bring some more bacardi round\nI ain't finished, just beginning, where's the next round?\nI know you hate me, but you love the way my money fold\nI'm sloppy drunk, want funk, so it's time to go\n\n[Chorus: Big Scoob]\nI'm sloppy, nigga, fall down drunk\nI'm just itchin for some fun\nI'm sloppy, nigga, fall down drunk\nWhy you pussys keep playing with me, bruh?"}], "artist": "Big Scoob"}