{"artist": "Iamsu!", "songs": [{"title": "All On The Line", "lyrics": "[Hook: IamSu!]\nCame up from the bottom\nAll I had was grind\nFor the love of the homies\nPut it all on the line\nPut it all on the line\nPut it all on the line\nPut it all on the line\nPut it all on the line\nFor the love, nigga!\n\n[Verse 1: IamSu!)\nHold up, got this Bay shit sewed up\nKush rolled up\nYoung nigga, money grown up\nStartin' to think I'm one of the realest niggas breathin'\nOpen the door and then I let the whole team in\nI can turn your boy into the man\nI can turn a grown ass nigga 'to a fan\nLivin' in the present I won't take this shit for granted\nWhy it seem like everything works out to my advantage?\nLike I said it, then I did it, like I planned it\nI go stupid, hear a beat and I do damage\nLike Total Impact, send shots and they get sent back\nIt's HBK for life, the whole crew we intact\nUp all night, no rest, you know we workin'\nThey can't call my next move, gotta update they service\nNo Metro, on a jet though, finna rock out, Depeche Mode\nAnd I'm constantly chasin' the money you probably find me wherever the check go\nBiatch!\n\n[Hook]\nCame up from the bottom\nAll I had was grind\nFor the love of the homies\nPut it all on the line\nPut it all on the line\nPut it all on the line\nPut it all on the line\nPut it all on the line\nFor the love, nigga!\n\n[Verse 2: Skipper]\nCome from rich city by the way\nGot that wet too, got the bitches goin' cray\nOne thing about me, I'mma always get that cake\nAnd I never gave a fuck what a nigga gotta say, okay\nBitch just flew back from L.A\nShorty seen the wave, got her wetter than a lake\nI done earned my spot, so you know I'm here to stay\nAnd I guess without a limit I go by highway\nBetter pop that safe when I rock that club\nComin' from the city where they cook a [?]\nI be gettin' to the commas, you got baby mamma drama\nHop up out the whip, that shit be clouded like a sauna\nStill do it for the love, never givin' up\nEven when I'm gone, go beyond and above\nStarted from the bottom but I never been a scrub\nGot the power in my hands like a motherfuckin' plug\nReal nigga shit\nSkipper\n\n[Hook]\nCame up from the bottom\nAll I had was grind\nFor the love of the homies\nPut it all on the line\nPut it all on the line\nPut it all on the line\nPut it all on the line\nPut it all on the line\nFor the love, nigga!", "image": "https://images.genius.com/b0e285238d5afe9880acca4a19c44cca.500x500x1.png", "album": null, "year": "2014-10-29"}]}