{"songs": [{"year": "2014-07-15", "title": "Westside Bound", "image": "https://images.genius.com/a4d52942eb4b120225094d0e316c3b15.800x800x1.jpg", "lyrics": "[Produced by Saba]\n\n[Hook: Saba]\nWestside raised me I should get that shit tatted\nWestside rasied me I should get that shit tatted\nGrabbing that knife you can be living and never get right\nIf you looking down how you put up a fight?\nPick your head up never let up never said once it was gon' be easy\nWestside raised me I should get that shit tatted\n\n[Verse 1: Saba]\nWestside raised me I should get that shit tatted\nPresident off a write ins they not even on the ballot\nSpreading love like rotation I just pass it like in Cali\nI been running rap so long damn my foot got a callus (Saba)\nCity cold think you need a coat but you really need a vest\nSpeak on if you blessed I'm coming for your heart like skeeting on your chest\nSpeak and need a technician upper deck\nTell em live and let listen never deaf\nIt's too many signs immma get it, on the road to success\nFind a living limit pushing lemon pepper chicken\nLinen thrift shop, keep it simple\nNot expensive synonym of being broke is\nI'm just getting by, but barely living\nAnd these niggas wanna bite and burn Billy\nAnd these labels call you how come [?]\nBut these niggas shady niggas shifty\nYou'll be gone in a year like you signed to Diddy\nIt is not a biggy it is natural\nNiggas with me off a pack of loud\nSplit a bliggy down the middy\nGot me high off contact feeling dizzy\nDizzy Gillespie, Galactic the pepsi you cap in the pep\nKeep [?] her has on the rapper ain't rapping\nI happen to hate em' I wrap em' in plastic\nAnd pack em' a [?] to Alaska frostbitten\nGood riddance, Good riddance, I drop good writ-tens\nThis economy could kill em'\nPivot probably a killa\nHard work to the drug dealers\nParade daily that's Bud Billiken\nDrop a tape and they lovin' it\nIt's in my genes my blood denim\n\n[Hook: Saba]\nWestside raised me I should get that shit tatted\nWestside rasied me I should get that shit tatted\nGrabbing that knife you can be living and never get right\nIf you looking down how you put up a fight?\nPick your head up never let up never said once it was gon' be easy\nWestside raised me I should get that shit tatted\n\n[Verse 2: Benjamin Earl Turner]\nAnimal beats so I Dr. Doolittle them\nMy pseudonym is GYM\nI stay working it out\nKilling the fear and the doubt\nPeople keep dying we keep buying the liquor just to pour it out\nThe earth is a drunk just spinning around\nI'm bout to make skeletons come out the ground\nGrabbing that life you can be living and never get right\nIf you looking down how you put up a fight?\nPick your head up never let up never said once it was gon' be easy\nCause a nigga with attitude a lil less scary than a man on a mission\nWith a real humble heart and a humble smile\nAnd I'm painting this clear like a radiant child\nSame old same old, but who could blame tho they know we don't know so educate\nJust think about thinking pre-meditate then we don't have to let things escalate\nJust move on up, elevate\nI heard blacks got magic all in they blood\nThat's why they quick to shed it\nTrying to fertilize they dust\nAnd grow an empire off us\nI'm bout to inspire an entire generation to combust\nWe are engine number 9 or number 6 what's the difference?\nCoCo Loco motor movement too much into mangy music\nWith guitar and sunsets playing light tricks all up on our head rest\nHeaded out west for a remix revolution\nI'm so poor that I swear peace and compassion at war\nWho don't need sheep, no Basedgod but ain't it I\nBuzz got the worlds eye Lil B\n\n[Hook: Saba]\nWestside raised me I should get that shit tatted\nWestside raised me I should get that shit tatted\n(Get that shit tatted)\nGrabbing that life you can be living and never get right\nIf you looking down how you put up a fight?\nPick your head up never let up never said once it was gon' be easy", "album": "COMFORTZone"}], "artist": "Saba"}