{"songs": [{"title": "Sacrifices", "album": null, "year": null, "image": "https://images.genius.com/eaab8a504477a90120f3290d121961fc.500x500x1.jpg", "lyrics": "[Intro]\nI put my life on the line for these streets\nWhen you have ain't nobody to call, I was in reach\nToo many sacrifices involved, I still creep\nYeah, hey\n\n[Chorus: Lil Zay Osama]\nI put my life on the line for these streets\nWhen you have ain't nobody to call, I was in reach\nToo many sacrifices involved, I still creep\nWhen you have nothing at all, I let you eat\nHow you gon' say that you ain't never need us?\nHow you gon' change up on us with no reasons?\nMy brothers ain't the same, man I need 'em\nThis Bloodas shit forever, I can't leave them\n\n[Verse 1: Lil Zay Osama]\nWe lost some brothers to the streets, 'member nights I couldn't sleep\n'Member nights I let you in, and I ain't ask my OG\nNigga, I fed you, them niggas scared you\nYou came running to my crib for a pole, and I ain't trip, I sparred you\nI wasn't out here just for me, I ride foreigns to get flee\nSnatch and running out of stores, using steamers from the T\nMe and Skud from the mud, he don't keep secrets from me\nAll them goals, I sacrificed my life for us to get some heat\nI put my life on the line too many times\nI went to jail, my [?], he dropped a dime\nYou take down me, I took you back too many times\nWhen you ain't got no one to call, don't hit my line\n\n[Chorus: Lil Zay Osama]\nI put my life on the line for these streets\nWhen you have ain't nobody to call, I was in reach\nToo many sacrifices involved, I still creep\nWhen you have nothing at all, I let you eat\nHow you gon' say that you ain't never need us?\nHow you gon' change up on us with no reasons?\nMy brothers ain't the same, man I need 'em\nThis Bloodas shit forever, I can't leave them\n\n[Verse 2: Lil Reese]\nI don't fuck around in these streets\nI don't fuck around in these streets\nI don't fuck around in these streets, cause you know me\nI don't fuck around in these streets, you know me\nRunning 'round in these streets (You know me)\nYou know me, I be running around in these streets\nStill riding around, totin' heat\nI don't fuck around in these streets\nCame from the Jungle, so I be low-key\nNiggas too police, watch how I be (Watch how I be)\nWhen you don't see me (When you don't see me)\nI'm still doin' me (I'm still doin' me) That's how I be\nTell my brothers watch over me, you know how I be\nI don't fuck with a nigga if they don't fuck with me\nSnake shit, boy, yeah I could see\nHow you change up me and blame me?\nYou changed up on me, and blamed me\nNever been a goofy, nah that ain't me\nToo many sacrifices in these streets\nNiggas out here lost, thinking shit sweet\nThese the streets, ain't shit sweet\nOne call away when you need me\nActing like you ain't never had to call up me\n\n[Chorus: Lil Zay Osama]\nI put my life on the line for these streets\nWhen you have ain't nobody to call, I was in reach\nToo many sacrifices involved, I still creep\nWhen you have nothing at all, I let you eat\nHow you gon' say that you ain't never need us?\nHow you gon' change up on us with no reasons?\nMy brothers ain't the same, man I need 'em\nThis Bloodas shit forever, I can't leave them"}], "artist": "Lil Reese"}