{"artist": "King Los", "songs": [{"image": "https://images.genius.com/063677e3f883a417c8b506294dd5c56c.500x500x1.jpg", "title": "B.o.B. Freestyle", "year": null, "album": "Zero Gravity", "lyrics": "Okay, I could one hand a full man mission\nNo half-stepping, just full transition\nBoy got drive like Ford transmissions\nJust one man and a little ambition\nNo days off while the game all sleep\nI just play ball, bitch, I'm on a A-Rod streak\nAt it way hard come snow, rain, or sleet\nGrab a day job, they ain't got a thing on me\nSee those that talk shit\nLike I ain't stay down to stand up\nOn my Rosa Park shit\nSwag superman, the flow’s Clark Kent\nHow bums sleeping on me like Los a park bench?\nBut believe I plan to teach\nThey ain't even made the heights I plan to reach\nI'm on a run, so hot I need antifreeze\nBut in the mean time, I'm working on my Grammy speech\nLife hard, go harder\nGet knocked down, get up, go farther\nWon't sell my soul for no offer\nWon't sell out for shit so don't bother\nNo father, rest in peace\nShow love to some niggas, to the rest it's “Peace!”\nCatch a flight then I'm getting back at ya\nYou never leave the home, you’re just a back catcher\nMy raps capture the post of the nation\nSpirit of the hustlers, hope of the Hatian\nGoals that we chasin’, no limitation\nProvoke innovation of whole generations\nYep, I'm on that jet fuel, nephew\nCatch you, pass you, lapped you, left you\nStep one, nigga, watch who you step to\nStep two, nigga, know what you step for\nStep three make a nigga take a step back\nCause step four make a nigga have to step off\nNow step five is easy like step one\nYou step to me wrong I make you my stepson\nThat's the father in me\nI'm sonning these rappers, father MC\nAyo, who farther than me?\nSlash cooler, slash iller, slash smarter than me?\nYeah, so tell them hating niggas step off\nOr watch that .40 throw bullets, Brett Favre\nWith my right arm you get left off\nPlus I write hooks that hit like a left cross\nYup, and my new car special\nThe grill mean like a Q Dog at a step show\nIt's too easy, I'm tellin’ you baby boy\nI'm that motherfucker like Melvin from baby boy\nGet it?\nIf not get a broke nigga slip knot\nAnd kill yourself, that'll help save hip hop\nStop walking round this bitch like a big shot\nYou the same type of motherfucker got BIG shot\nSo I'm screaming “Zero!” ‘til this bitch stop\nHit hard like a B-Hop rib shot\nYup, I love Moms, and I miss Pops\nRiding ‘til the wheels fall off, no pit stop"}]}