{"songs": [{"title": "Let It All Happen", "lyrics": "[Verse 1: Akala]\nExistence is resistance in a world that\nThinks the human instinct should be held back\nAnd all of our wisdom we we should sell that\nDestroy the difference that we all have\n\nAnd make use clones for the throne\nServing their agendas\nEven when we think we oppose\nWe're really their defenders\n\nLook at what is given to those\nWho chose for their repentance?\nTo fold to the goddess of gold and be cold henchmen\nFor stars spangled with banners\n\nThat dangles cars as carrots\nStrangle Mars with cannons\nMangle arms with malice\nAnd channel arms so callous\nAnd banish bards that challenge\n\nAnd challenge half the planet\nThe great USA\nWith a British dog on a leash\nWe are the bringers of peace into the Middle of East\n\nYou are invited to Feast\nOn the tasty flesh of a beast\nIt might be someone's seed\nBut why worry there is no need\n\nWe intravenously feed\nOn dead carcasses\nYeah they're starving cos\nThey wanted to own their own wealth\nAnd they are not part of us\n\nMost of the time I think of myself\nAnd I can palm it off\nSometimes I think of the world\nIt gets me started off\n\n[Hook]\nSo so what do we do now\nMake ways that praise more than a few how?\nTheir fake ways we kill it with a tool blaw\nOr go back to the way we've always done it\n\nWhatever we do there's always gonna be division\nWhatever we do there will always be a thieves' religion\nWhatever we do they're just gonna build another prison\nSo let's just do nothing and let it all happen\n\nWhatever we do the universe just keeps on giving\nWhatever we do the Earth will always keep on spinning\nWhatever we knew we still won't understand beginnings\nSo let's just do nothing and let it all happen\n\nExistence is resistance in a world that\nThinks the human instinct should be held back\nAnd all of our wisdom we should sell that\nDestroy the difference that we all have\n\n[Verse 2: Akala]\nEvery freedom we believe we're receiving this evening\nBut believing is deceiving\nWhen there's no meaning\nIn not a syllable\n\nHowever how lyrical\nSpouted from the mouths of a clout\nDevout criminals\nHegemony is as old as humanity right?\n\nSo we're told\nSo let us scramble for the globe until everything folds\nAs long as pockets always have enough dollars to fold\nAs long as rockets always have enough venom to scold\n\nA daddy's daughter\nA mother's son\nOr anyone\nThat has not come to succumb to a murderer's tongue\n\nSo we're told\nWorship a gun\nFrom the palace of permanent slums\nPurchase a ton\nFrom whoever will sell you the Sun\n\nAnd sell it back to whoever can give you the funds\nThe race is run\nBut I don't know if we lost or we won\nIt's all perception, death and resurrection\nA lack of answers won't stop as asking the question\n\n[Hook]\n\n[Verse 3: Akala]\nResisting the system?\nPlease tell me what's the mission\nCos we would probably be oppressors\nIf given position\n\nYeah I try to spread a message, but really ambition\nIs what is driven through my lyrics\nI'm really a gimmick\nNot that I don't put my heart and my soul in the words\n\nIt's just I ask\nIf the bars are changing the Earth\nHow arrogant to believe we can change it\nThrough art\n\nOnly slightly less arrogant than those\nWho believe that we can't\nSo pull a bit harder\nWe may just crumble the house of cards\n\nNever to slumber it's strength in numbers\nWhenever we charge\nThere is a charge, lays these bars lace the guitars\nAim for the stars\nGame for the part, straight as dart, pain from the heart\nGreat for the art\n\nStart fighting\nOr never should ever you pen to the page\nStart writing\nOr never should ever you empty the gauge\n\nMurder a phase, verbally slayed\nThe coroner could not determine his age\nHard as a foreigner earning a wage\nFrom the conservative nerd of a sage\n\nNot heard? I'm a permanent page\nWritten in the ink of the blood of a slave\nNo cotton so burn on a wage\nBuried at the bottom of the ocean of rage\n\n[Outro]\nExistence is resistance.. x15\nSo so what do we do now?", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}