{"artist": "PnB Rock", "songs": [{"album": null, "title": "On My Own", "image": "https://images.genius.com/d19431d27fee165ba71d702e3bb437c3.900x900x1.jpg", "lyrics": "[Intro]\nYeah, ohyo\nYeahhhhh-yeah-yeah-yeah\nYeah\n\n[Chorus]\nI did it all on my own\nBut people keep callin' my phone\nI'm just like, \"Leave me alone\"\nWhere was you when I was broke?\nWhere was you when I was down?\nWhere was you when I was low?\nI bet'chu don't even know\nI bet'chu don't even know\nThat I did it all on my own\nAnd people keep callin' my phone\nI'm just like, \"Leave me alone\"\nWhere was you when I was broke?\nWhere was you when I was down?\nWhere was you when I was low?\nI bet'chu don't even know\nI bet'chu don't even know\n\n[Verse 1]\nWhere was you when I ain't have shit?\nWhere was you before this rap shit?\nWhere was you when I was out there in the trenches, I was on some trap shit?\nWhere was you when I was locked up in a cell where I ain't have no commissary?\nWhere was you when my baby momma, she was havin' problems findin' diaper money?\nWhere was you before the glow?\nWhere was you before the dough?\nWhere was you before the shows?\nWhere was you before the hoes?\nEver since a nigga came up, everybody call me bro\nThat's why I won't never change up and I still don't trust a soul\n\n[Bridge]\nI used to be broke as a bitch but now I pull up in a Benz\nNow I could fuck any bitch 'cause all these hoes know that I'm rich\nDo what I want 'cause I can\nI know all my haters they say\nI know all my haters they pissed\nThey could just all eat a dick\n\n[Chorus]\n'Cause I did it all on my own\nBut people keep callin' my phone\nI'm just like, \"Leave me alone\"\nWhere was you when I was broke?\nWhere was you when I was down?\nWhere was you when I was low?\nI bet'chu don't even know\nI bet'chu don't even know\nThat I did it all on my own\nAnd people keep callin' my phone\nI'm just like, \"Leave me alone\"\nWhere was you when I was broke?\nWhere was you when I was down?\nWhere was you when I was low?\nI bet'chu don't even know\nI bet'chu don't even know\n\n[Verse 2]\nNowadays I hit the store I don't cop one or two, I cop three of them\nMan, it's crazy how last year I was robbin' niggas wit' a BB gun\nIt was me Steph, Leash, and them, now I'm sayin' R-I-P to them\n'Cause Steph dead and nowadays, man, I don't even speak to Leash and them\nBut they still be callin' my phone\nI'm just like, \"Leave me alone\"\n'Cause times change, people change, people grow\nAnd muh'fuckas know that this shit just ain't happen overnight\nSo please do not act like you know my life\nI was servin' white, I was rollin' dice, I was all day on the coldest nights\n\n[Bridge]\nI used to be broke as a bitch but now I pull up in a Benz\nAnd now I'm at all the events, $2000 my rent\nWith me on the track I need ten\nDon't fuck wit' me and my friends\n'Cause we gon' be spendin' your [?]\nAnd I ain't gon' tell you again\n\n[Chorus]\n'Cause I did it all on my own (My own)\nBut people keep callin' my phone (Callin' my phone)\nI'm just like, \"Leave me alone\" (Leave me alone)\nWhere was you when I was broke? (When I was broke)\nWhere was you when I was down? (When I was down)\nWhere was you when I was low? (When I was low)\nI bet'chu don't even know (Don't even know)\nI bet'chu don't even know (Don't even know)\nThat I did it all on my own (All on my own)\nAnd people keep callin' my phone (Callin' my phone)\nI'm just like, \"Leave me alone\" (Leave me alone)\nWhere was you when I was broke? (When I was broke)\nWhere was you when I was down? (When I was down)\nWhere was you when I was low?  (When I was low)\nI bet'chu don't even know (Don't even know)\nI bet'chu don't even know (Don't even know)\n\n[Outro]\nDamn, don't ask me shit about nothin', nigga\n'Cause you already know you ain't helped me with nothin', nigga\nEat a dick\nHaha\nOhyo", "year": null}]}