{"artist": "Andy Mineo", "songs": [{"title": "Superhuman", "album": "Heroes for Sale", "year": "2013-04-16", "image": "https://images.genius.com/fdf80f726778a05ec46bdc108384b8f2.540x540x1.jpg", "lyrics": "[Intro]\nCome you sinners poor and needy\nWeak and wounded, sick and sore\nJesus ready stands to save you\nGrace requires nothing more\nI will arise and go to Jesus\nHe will embrace me in His arms\nIn the arms of my dear Savior\nThere are ten thousands charms\n\n[Verse 1]\nWhy is it every time I step up on a train\nI see a pretty dame and I wonder what her name is?\nBefore I even get there the question on my brain is\nDo you love the Lord, do you live to make Him famous?\nThen the car stop, she step off, it's time to refocus\nI'm questionin' my heart, examinin' my motives\nWhy I'm captivated by the brown skin mocha divas?\nAnd I hope in my mind she's a believer\nOk, she got all that beauty, yeah, it's obvious\nI can't let it take precedence over godliness\nNow I'm gettin' restless, how I'm recognizin'\nWhen I'm choosing to take pleasure in all these false treasures\nThey fool's gold\nInstead of looking for them sundresses\nI should be looking for the Son I confess it\nEven though my pride's telling me don't ever let the fans know\nI am not a superhuman, no, I'm a man\nSo the grace that I talk about on all my records\nI need it for myself, cause really I'm just a mess\nFindin' rest from the pressures of perfection\nAs I stand up on this platform they expectin'\nMe to be a man without flaws, that's false\nI am just another rapper that's called to point y'all to the cross\nThat's exactly where I'm headed\nI'm just another beggar pointin' y'all to where the bread is, man\n\n[Chorus]\nI'm not a superhuman, I am just a man\nNo, I'm not a superhuman, I am just a man\nI'm not a superhuman, I am just a man but they never understand\nI'm nothing more than a man lost dead in my sin\nSo here I am alive in Your hands\nYour hands, Your hands\n\n[Verse 2]\nWe dress up in nice heels, we try to make people buy'em\nThat's why when someone ask how we doin' we tell 'em fine\nKnowin' we hurt inside, but tell me who's really lyin'?\nThey ain't really want to know how you doin', that cost time\nThat's way too expensive\nAnd if I ever get a date with a dime I'm sendin' my representative\nThe version of Andy that's cropped and edited\nI'm killin' this first impression, and I'm hidin' the evidence\nPhotoshoppin' the blemishes\nThese lies of perfection are the cry of the desperate\nMen that want that want acceptance\nHoldin' they breath, dyin' a thousand deaths\nForgettin' there's beauty inside the mess\nWhat else could you expect, we obsessed over twitter numbers!\nCheckin' ours, then comparin' them to others\nLike, the number of likes upon a status is somehow supposed to raise our status\nBoy, this is madness\nWe want the trophy wife who's the baddest and not some average\nSo we can feel like the man, Randy Savage\nTake me off the shelf, I don't want to be for retail\nI would rather be real, let you see the details\nWhen we fail it feels like we fall so far cause they put us so high\nI am not a star\nI'm just a product of grace that's still in the process\nAnd I don't gotta be great, because my God is\nAnd I don't gotta be great, because my God is\nI'm just a product of grace and guess what?\nI'm still in the process, that's unfinished business\n\n[Bridge]\nWould you love me if I told you I couldn't fly?\nI got no cape on and no mask on there's no disguise\nOh, I'm no hero\nThere's only one\nOh, I'm no hero\nThere's only one\nAnd He's not for sale\n\n[Hook]"}]}