{"artist": "Immortal Technique", "songs": [{"title": "The Point of No Return", "lyrics": "[Intro]\nYeah, it's that real this time around\nImmortal Technique, Revolutionary Vol. 2\nIt's on now, motherfucker, lock and load!\n\n[Verse 1]\nThis is the point of no return, I could never go back\nLife without parole, up state, shackled and trapped\nLivin' in the hole, lookin' at the world through a crack\nBut fuck that, I'd rather shoot it out and get clapped\nI've gone too far, there ain't no comin' back for me\nAuschwitz gas chamber full of Zyklon-B\nJust like the Spanish exterminatin' Tainos\nRapin' the black and Indian women, creatin' Latinos\nMotherfuckers made me out of self-righteous hatred\nAnd now you got yourself a virus, stuck in the Matrix\nA suicide bomber strapped and ready to blow\nLethal injection, strapped down, ready to go\nDon't you understand they'll never let me live out in peace?\nConcrete jungle, guerrilla war out in the streets\nNat Turner with the sickle pitch fork and machete\nThe end of the world, motherfucker, you not ready\nThis is the point of no return and nobody can stop it\nMalcolm Little when he knelt before Elijah Muhammad\nThe comet that killed the dinosaurs, changin' the Earth\nThey love to criticize, they always say I change for the worse\nLike prescription pills when you misusin' them, nigga\nThe Templar Knights when they took Jerusalem, nigga\nAnd figured out what was buried under Solomon's temple\nAl-Aqsa, the name is not coincidental\nI know too much, the government is tryin' to murder me\nNo comin' back, like cuttin' your wrists open vertically\nHow could the serpent be purposely put in charge of the country?\nGenetic engineered sickness spread amongst me\nMy people are so hungry that they attack without reason\nLike a fuckin' dog rippin' off the hand that feeds him\nImmortal Technique is treason to the Patriot Act\nSo come and get me, motherfucker, 'cause I'm not comin' back\n\n[Hook]\nThis is the point from which I could never return\nAnd if I back down now, then forever I burn\nThis is the point from which I could never retreat\n'Cause If I turn back now there can never be peace\nThis is the point from which I will die and succeed\nLivin' the struggle, I know I'm alive when I bleed\nFrom now on, it can never be the same as before\n'Cause the place that I'm from doesn't exist anymore\n\n[Verse 2]\nThis is the point of no return, nigga, you better believe this\nMary Magdalene givin' birth to the children of Jesus\nThe evolution of the world, bloody and dramatic\nHuman beings killin' monkeys to conquer the planet\nThe kingdoms of Africa and Mesopotamia\nMachine-gunnin' your body with depleted uranium\nThis is the age of microchips and titanium\nThe dark side of the Moon and contact with aliens\nI started out like Australians: criminal-minded\nBroke into Hell, tore it down, and built a city behind it\nSouthpaw, murderous methodology, nigga\nRemember that I'm just a man, don't follow me, nigga\n'Cause once you past the point, you can never go home\nYou've got to face the possibility of dyin' alone\nSo tell me, motherfucker, how could you die for the throne\nWhen you don't even got the fuckin' heart to die for your own?\nIt rains acid, one day the Earth will cry from a stone\nAnd you'll be lookin' at the world, livin' inside of a dome\nComputerized humanity livin' inside of a clone\nThis is the place where the unknown is livin' and real\nWormwood to Planet X and the Seventh Seal\nUniversal truth is not measured in mass appeal\nThis is the last time that I kneel and pray to the sky\n'Cause almost everything that I was ever told was a lie\n\n[Hook]\nThis is the point from which I could never return\nAnd if I back down now, then forever I burn\nThis is the point from which I could never retreat\n'Cause If I turn back now there can never be peace\nThis is the point from which I will die and succeed\nLivin' the struggle, I know I'm alive when I bleed\nFrom now on, it can never be the same as before\n'Cause the place that I'm from doesn't exist anymore", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}