{"artist": "Apathy", "songs": [{"title": "DSL’s", "image": "https://images.genius.com/90a78c5e81aab6cc017154aa5929c6ac.1000x985x1.jpg", "album": "It’s the Bootleg Muthafuckas! Vol. 1", "lyrics": "[Verse 1: Apathy]\nIf you wanna show your frame\nThere's really no need to be ashamed\nWear some tight clothes, let your body bang\nThe physical is brazen, hips hypnotize\nThe chick's lips and thighs are thick, hits my eyes\nAnd she's so fine in that tight Genelle\nAnd she's so hot with them DSL's\nIt all started when I walked in the club exchanged glances\nGirl shaking their hourglass like bellydancers\nMovements of cobras arising from baskets, passionate\nAss and I'm pondering smashing it\nI let her be, better to let her see\nMe, blowing more cheddar than one of the Genovese\nShe was Lebanese, ordered a plenty of Hennessy\nStart to whisper in her ear, poisoning her mentally\nShe said, \"You Americans' ignorance is embarrassing\nYou probably think because I speak Arabic, I'm a terrorist\"\nI'm like, \"Woah Ma, slow down your speculation\nLet's step outside for some proper ventilation\"\nI'm always on point, this ain't Amateur Night\nI hear your accent, where you from? Canada, right?\nShe was getting on my nerves, but she's fly as hell\nAnd I fell in love with them DSL's\nSo I told her, let's dip in the whip and don't trip\nYou got DSL's (What?): Dick Sucking Lips\n\n[Hook: Apathy]\nShe got DSL's (DSL's?)\nDSL's (DSL's?)\nDSL's, yo her lips are thick\n(What's DSL stand for?)\nDick Sucking Lips!\nGot them DSL's (DSL's?)\nDSL's (DSL's?)\nDSL's (Keep talking that shit)\nMommy, you should be proud of them dick sucking lips\n\n[Interlude: Sample]\n\"No disrespect, she had, uh, nice pipe-fitter lips.\"\n\"I know how it is\"\n\"You mean you would take the lips, over the tits?\"\n\"Trust me, my boy. There’s two things I’m good at\nThat’s pulling dents, and spottin’ good blow jobs\nAnd that sweetie had world-class blow-job lips.\"\n\n[Verse 2: Apathy]\nGotta let her know\nThat her lips are thick like Lil' Mo\nLittle nympho, excuse me, let me kick my intro\nI'm large, running a city like a crime boss\nA pompous snob, that's been known to blow dimes off\nDon't even front cause you're the fliest girl in your hometown\nYou're in my world now and I'mma look you up and down\nAnalyzing if you're worthy to serve me\nIt's complicated, but they love to feel dirty\nAnd dominated, you can ask Majik Most the science of that\nWhy these good girls like to get they ass smacked\nI fucked up and fucked with this bitch with thin lips\nSo I had to give her the pink slip\nI'm slick on some multiple bitch pimp shit\nWith ten different shades of lipstick on my dicktip\nIf chickens ain't giving head, then they're worthless\nKeep hoes on their knees longer than prayer service\nAnd I don't even wanna fuck\nI'll make her blow so long she might inflate four flats on a monster truck\nSo if they won't swallow my kids\nI'll give them facials, but not with cucumbers over they eyelids\n\n[Hook]", "year": null}]}