{"artist": "C-Murder", "songs": [{"title": "Mihita", "album": "Screamin’ 4 Vengeance", "year": null, "image": "https://images.genius.com/c277a6eed99069d87d13e5b1876a9d0f.400x400x1.jpg", "lyrics": "Kiss me a lot and [?] the truth\nThere's no way I'll survive without you\nAlways by me, we were meant to be\nWithout you I wouldn't survive these streets\n\n[Chorus:]\nMihita, We gon always be togetha\nMihita, Yeah by my side ride with me shorty says she gon die with me\nMihita, you never let me down no neva\nMihita, she always got my back incase them homies try to jack protect my stacks\nMihita, as lovely as you wana to be\nMihita, yea no one can compare ride with me anywhere\n\nI'm always on your mind and you're always on mine. We keep them haters in line and duck tha one time. You're hotter than fish grease I nick named ya heat. Sometimes my beast appears to be in the streets. See [?] is where I met you. I was rocking a Gucci sweater with little chedar. I chose ypu and not tha burretta [?] and I never wrote you a love letter but it was love at first sight. I tapped it on the first night, you ain't played yourself. I never played ya or disrespected. I kept you on the dresses I kept you so clean shinning like brand new triple beam. Got [?] hate Let them others hate, yeah they hating from a distance cause they know about your irrisistance. Submission with hopeless resistance I rubbed my fingers in your extensions. Me and you [?] got me praying til my [?]\nMy heater by my side ride with me shorty says she gonna die with me\n\n[Chorus:]\nMihita, We gon always be togetha\nMihita, Yeah by my side ride with me shorty says she gon die with me\nMihita, you never let me down no neva\nMihita, she always got my back incase them homies try to jack protect my stacks\nMihita, as lovely as you wana to be\n(A true love story)\nMihita, yea no one can compare ride with me anywhere\n\nNow I never seen you smile, but I know your trigga happy. I know that love me by the way that you touch me. You say come hug me you feel so good in my hands. I'm the only man that's popped it, I like the way you drop it. Life is hot and why not because of you I got the whole block, you were like nah let's take over the whole spot. Every thug needs a lady a baby creating [?] special a 38 full metal. I remember we played hookie you gave me some nookie I girl fingered you and you released you crookies. You so fine in my jean you ain't got to have [?] you carry up once but that was on me. You did me [?] I did you dirty. I was up too early on my grind and you respect that best you sees shorty better count back\n\n[Chorus:]\nMihita, We gon always be togetha\nMihita, Yeah by my side ride with me shorty says she gon die with me\nMihita, you never let me down no neva\nMihita, she always got my back incase them homies try to jack protect my stacks\nMihita, as lovely as you wana to be\nMihita, no one can compare ride with me anywhere\n\n[Mia-X:]\nCocks, stay ready for the fights like cats and dogs. Dream we can cut just like pornal stars. Mother dog ya right ill go ta' war. Call me blasting on sight baby here I are. I'm always on your side and when you ride yeah I'm right in the car, what they don't know who we are? This is gangsta gangsta. Cross my dude you're playing. Squeeze me baby, mama gon spank ya. They don't wanna see us baby don't you ever play wit his franklins lick your body to somewhere lead ya somewhere stanking still every thought you thinking. Only death can depart us believe you don't wanna start us\nRide or die you and me, by my side internally love to hold you squeeze you tight. One and only love of my life [x2]"}]}