{"songs": [{"title": "Beasty", "album": "Hoodie SZN", "year": "2018-12-21", "image": "https://images.genius.com/557f4ca436aaabc4210bd3850f96b954.1000x1000x1.jpg", "lyrics": "[Intro]\nWhoa Kenny!\n\n[Verse 1]\nHold up, you know it's the logo, say HB\nThe Glock got no safety, don't push me, I’ll do it\nPlease do not push me, you think that I'm pussy?\nGot too much to lose, nigga, don't make me lose it\nI can't be trusting no bitch, is you stupid?\nI came with a shooter, he came with a Ruger\nI just seen one of my bros on the news\nI can't call him no more, he respect why I do it\nI'm in the big body Benz with my friends\nAnd it look like we just hit a lick off the jeweler\nLook like a dope boy, I hop out a Rolls Royce\nThey taking my flows like I said they can use it\nDirty Diana, I'm pushing a Phantom\nI know that they wanna see me in a Buick\nThree different bourbons, we twenty-one deep\nYou see gang in the shows like they don't know my music\nFuck all the bitches that fronted on me when I didn't have money\nYou feeling so stupid\nI'm from the trenches where niggas get hit up for nothing\nYou better go get on your bully\nNiggas be acting so tough\nYou can front if you want\nGot some shit that could knock down a bully\nNiggas be talking to police\nYou don't even know me\nYou only hear what's in the music\n\n[Chorus]\nTalking to the feds is a no-no\nI can get bread with my eyes closed\nInsecure, so she got lipo\nVVS's on me, that's a light show\nIt could get litty like a light show\nNigga I'm litty like a light show\nIf it's 'bout money, I'ma go-go\nFucked a couple bros, she a ho-ho\n\n[Verse 2]\nToo addicted, hard to stop it\nFell in love with Saint Laurent shit\nLouis luggages and Monclers\nFlyest niggas out the Bronx yeah\nAnd we come straight out of Highbridge\nI swear you don't wanna die, yeah\nDon't get caught up in my projects\nI don't need no yes men 'round me\nTalking about lets get fleet-fleet\nCome around tryna get tree-tree\nPopping on pills with the bean-bean\nRolling through the hills off the lean-lean\nDon't hate me, just love me\nMelody, nigga, she need me\nBlowing me kisses through the TV\nLook at me now I'm beasty\nI'm beasty, I'm beasty, too OD, I'm beasty\nNigga I cut her off easy\nWord to my mother, I'm beasty, I'm beasty, I'm beasty\nSaint Laurent sweater cost three Gs\nFucking on the bro, just to meet me\nOkay you a eater like E-E\n\n[Chorus]\nTalking to the feds is a no-no\nI can get bread with my eyes closed\nInsecure, so she got lipo\nVVS's on me, that's a light show\nIt could get litty like a light show\nNigga I'm litty like a light show\nIf it's 'bout money, I'ma go-go\nFucked a couple bro, she a hoe-hoe"}], "artist": "A Boogie Wit da Hoodie"}