{"artist": "Ice-T", "songs": [{"title": "99 Problems", "lyrics": "Yeah, last year a lot of motherfuckers asked me\nWhy I didn't do no old sex nasty shit\nBut this year I went down to Miami and got my nigga from 2 Live\nBrother Marquis in the house! (Yeah I'm the motherfuckin nigga)\nYeah, we gonna answer the question about girl problems\nAll these niggas is havin girl problem, Marq\n(Huh, tell them man, tell them how it is)\nLemme tell you what time is it..\n\nI got a ho from the East, got a ho from the West\nGot a ho that likes to jack it off and rub it in her chest\nI got a ho from the North, a ho from the South\nA ho that likes to suck it long and hold it in her mouth\nI got a bitch with hair, a bitch with none\nA bitch with a knife, a bitch with a gun\nA bitch with a ass big as a TV set\nAnd there's a bitch over there; hey, the one I'm gonna get\nBut yo but maybe not, she might not like me though\nNo sweat to a vet; I'll slam her sister, though\nWord, Ice in the whole damn herd\nI fuck 'em all and leave 'em on the curve\nI got a bitch with a mink, who rocks a fat gold link\nWho likes to fuck me with her ass up on the kitchen sink\nGot a bitch with tits, a bitch with ass\nA bitch with none, but hey, I'd give her a pass\nAnd I love 'em all, I love 'em crazily\nAnd they love me back - that's why they stay with me\nSo if you having girl problems, I feel bad for you son\nGot 99 problems and a bitch ain't one - hit it\n\n[Hook]\n\nNah, a bitch ain't one\n\n[Verse 2: Ice-T]\nI got a bitch that's old, a bitch that's new\nA bitch who love velvet in the colors blue\nI got a bitch who's fat, a bitch who's built\nA bitch who all her titties give out powdered milk\nI got a bitch who's funny, a bitch who ain't\nA bitch who can sing, a bitch who cain't\nA bitch who loves fucking on a airplane..\nI even got a bitch off Soul Train\nI got a bitch who rolls a rag-top Benz\nLong ends\nI got a bitch who's broke as a bum\nBut she's the most fun\nI got a bitch who play piano, a bitch who don't\nA bitch who dances naked, a bitch who won't\nA bitch who's short, a bitch who's tall\nA bitch who burns my pager with priority calls\nAnd I love 'em all, I love 'em crazily\nAnd they love me back - that's why they stay with me\nSo if you're having girl problems, I feel bad for you son\nGot 99 problems and a bitch ain't one - hit me\n\n[Hook]\n\nYo Marquis - you from Miami man why don't you show these motherfuckers all the over the world\nThe 2 Live style of how the bitches treat a mothafuckin' fly nigga like you\n\n[Verse 3: Brother Marquis]\nI got 99 problems and a bitch ain't one of them\nI don't trip on hoes, cause I don't need none of them\nPussy's the temptation, dick's the persuasion\nAll hoes suck cock nigga how you play 'em?\nThat's why I don't sleep on 'em, I just freak on 'em\nStick dick in they mouth; take it out and I skeet on 'em\nThe nigga the one-nighter, the bitch exciter\nI only love my hoes when I'm going up inside her\nProblem number one is getting money\nI'd rather taste the green than sip the honey\nSo don't expect nothing cause I ain't offering\nI go hard on my bitches, cause I'm never never softening\nPutting the demand on 'em, fuck 'em and scram on 'em\nThe \"wham, bam, thank you ma'am\" game is ran on 'em\nSo fuck how you feel, your fucking cheap thrill\nI hope you took the pill cause I won't pay the bill\nGetting pussy's just another expense\nIf pussy pays the bills then dick pays the rent\nI only need a ho for one thing and that's to cum\nI've got 99 problems and a bitch ain't one\n\n[Hook]\n\n[Ice-T]\nHa! Yo Marquis my motherfucker you got problems man?\n(A bitch ain't one) Aww shit!\nNow let me tell you how to do this shit\n\n[M] I got a bitch that loves to G\n[I] She'll fuck you right after she fucks me\n[M] I got a bitch who loves both\n[I] I got a bitch who loves handcuffs and ropes\n[I] I got a bitch that's fast, a bitch that's slow\n[M] A bitch that's a virgin and a bitch that's a ho\n[I] A bitch that lies\n[M] A bitch that's true\n[I] A bitch who's a man because they're \"Bitches 2\"\n[I] I got a bitch that's cool\n[M] A bitch that's hot\n[I] A bitch who loves rap, a bitch who loves rock\n[I] A bitch who's lost and one who knows where it's at\n[I] She gets up under me and purrs like a cat\n[M] I got a bitch that runs, I got a bitch that walks\n[M] I got a bitch that yells, I got a bitch who talks\n[I] I got a bitch that's dirty, got a bitch that's neat\n[I] I got a super fine bitch that I knocked in the swap meet\n\n[Ice-T]\nAnd I love 'em all, I love 'em crazily\nAnd they love me back - that's why they stay with me\nSo if you having girl problems, I feel bad for you son\nI got 99 problems and a bitch ain't one - hit me..\nNo, a bitch ain't one\n\n[Hook]\n\nHuh, you know a bitch ain't one\n\n[Ice-T & Brother Marquis]\nYouknahmsayin? I got problems with my mothafuckin' rent Marquis\nBut a bitch ain't one\nMan you got yourself nothing man\nFuck them raggedy stank-ass hoes nigga\nA bitch ain't one\nI got a problems staying out here on these streets\nWith the police trying to take a nigga out, y'know?\nBut a bitch ain't one\nGot problems with motherfuckers.. buying my records\nBut a bitch ain't one\nFuck 'em all, nigga fuck them motherfuckers\nYouknahmsayin? A bitch ain't one\nGot problems man\nAll them motherfuckers can kiss my mothafuckin' ass.. for real\nReally, niggas worrying about bitches\nThey better, they better find something else to worry about", "image": "https://images.genius.com/171e1ec16bd8d97e16d9314157cacd63.220x220x1.jpg", "album": "Home Invasion", "year": "1993-01-01"}]}