{"artist": "Wax", "songs": [{"year": "2016-08-05", "lyrics": "[Verse 1 - Wax]\nSitting on a park bench on the D Low\nFeeling like Clark Kent's alter-ego\nThrowing out bread smidgens\nTo the eager-to-be-fed pigeons\nI could loaf around, laugh all day\nBut unless I got another loaf around, they fly away\nI wish that I could fly too\nI'd fly to a lake and sit in somebody's canoe\nI wouldn't care if it were strapped with no oars\nCause I'd be in no rush to make it back to the shore\nI'm not an athletic specimen\nBut I can float with the best of them\nPeople tend to act real pushy\nBut you can't put a strain on my brain, it's too mushy\nI just recline in the sun\nStumble through life until my time is done\nCause I-\n\n[Hook]\nDon’t need no palace paved with gold\nDon’t need more cash than banks can hold\n\n[Verse 2 - Fiyablasta]\nWatching cars zoom as I walk to my tunes\nIn a world of my own that you'll learn about soon\nThe crowd I impress are ducks, squirrels, and 'squitos\nThe fame and the fortune? Nah, I don't need those\nGive me an iPod and my bars will make you say, \"My God!\"\nAt least I thought until some dogs bark\nStartled, but I laugh it off. Look back at the passing cars\nThen to make it better I trip on the slanted sidewalk\nWow, SMH!\nThen the shame fades away jamming to the bass\nAt the stoplight, dancing like I'm trying to get the spotlight\nPeople know if I don't have headphones, something's not right\nWalk light comes on, I check both ways\nDrivers see me lip syncing to every single song that plays\nI don't care if they claim that that boy cray\nCause I know those who wave would agree when I say\nI-\n\n[Hook]\n\n[Verse 3 - Wax]\nYou can catch me on a playground swing\nBack and forth smilin' doing my thing\nPassers-by often color me dumb\nBut I don't care man, I'm comfortably numb\nThey looking at me real strangely\nBut their perceptions don't change me\nI bet if I jumped at the right trajectory\nI'd fly right over them and land in a special seat\nOn the crest of the moon with a fishing pole\nCast in the earth in some distant hole\nPull up a catfish I wouldn't gut it\nI would play with it, and love it\nI'm sorry for the hole that spanned your lip\nA small price for good old companionship\nLoneliness is a mountain, a massive climb\nI'm on the other side, happy, just passing time\n\n[Hook]", "image": "https://images.genius.com/f3b1128cd10401c7ba2b36c8cfb02999.700x700x1.jpg", "album": "The People’s Mixtape Vol. 2: The Wish List", "title": "Don’t Need (Remix)"}]}