{"songs": [{"title": "Candy On Chrome", "album": null, "year": null, "image": "https://images.genius.com/37d697fdf2a877e070869cbcf7cc9322.151x151x1.png", "lyrics": "[Verse 1: Big T]\nI been really trryyiinn' baaabbyy\nTryin' to come down da slab for sooo looonngg yeah\nAnd if you feel like T feel baby\nWant cha come on OOH!\nCome on WOO!\n\n[Chorus: Big T]\nCandy on chrome OOOW!\nCandy, candy on chrome\nSlabbed out baby\nCandy on chrrroooommmeee\nSwingas!\nCandy on chrroommee\nWOOHOOHOO!\n\n[Verse 2: Big T]\nWe're all in-house playas wit' soooo much to gain\nAnd it ain't no thang: woooo)\nBut since we got to be here, let's swang\nCuz' I love it, thereeeee's nothin' wrooong\nWith T comin' thrroouugghh, baby not at aaaalllll\nHeeey, droppin' my slab with me and you can never go wrong\nCuz' my slab is true, ooh baby\nI SAY WOO HOO HOO!\nDon't you know how sweet and wonderful chasin' can beeeeee\nWOO HOOOOOOOOO!\nRiiide watchin' streets baby and poppin' trunk wit' meeee\nI SAY WOO WOO, I SAY WOOO!\nI ain't gonna wooorryy cuz' I'm lookin' gooooddd\nLike a playa shhoouulldd gurl\nI said come on come on come on come on come on baby\nLet's floss through the hoooooddd\nOOOOHHH!\n\n[Chorus: Big T]\nI'm ridin' candy on chrome\nHHHOOOOOOOE!\nCandy on chrome\nYou know what I'm talkin' aboooout true drop baby\nHEEY HEEEEY!\nAnd let the slabs come OUT!\nIf yoouuu believe in slabs let's get it ooonnn\nWHOOOAA!\nRidin' on chrome baby, this man is hard yeah\nI'm ridin' on candy chrome: EEEEEEEE!)\nJust candy chrome, HOOW HHOOOWWW!\n\n[Verse 3: Lil' Flip]\nHey, Southside G's ride nuthin' but reeeed\nYou can ask Bevis I get nuthin' but heeaadd\nI drink so much I sleep wit' my cup in da beeedd\nAll I gotta do is pop trunk to turn the heeaad\nI'm on 84's and I'm actin' baaadd\nMy paint job look like a maxi ppaaaddd\nThey call me Lil' Flip mayne I thought you knneeww\nI'm the first one to freestyle 10 minutes on scrreewww\nMe and Big T in da Escalaaddeee\nLike Lil' Troy it's a better wwaaayy\nI ride on chrome each and every daaayy\nEvery song I get I'm gettin radio plaayeedd\nI'm only 18, but my candy DRIP\nIf you got cavaties don't like ya LIPS\nAnd the freestyle king is my NICK NAME\nI let my bumper kit HANG, while I grip GRAIN\n\n[Verse 4: Big T]\nI said come on come on come on come on come on DARLIN'\nLet's floss through the hooooooodddd\nOOOHH OOHHH!\n\n[Chorus: Big T]\nCANDY ON CHROME\nI'm ridin' on candy to chrome baby\nYes I do baby I got to ride on chrome\nCANDY ON CHROME\nYou don't have to worry cuz' I'm on da phooooone\nCANDY ON CHHRRROOOMMMEEE\nCuz' if the 3's move ya' the phones will groove ya'\nCANDY ON CHRROOMMEE\nWoo and let da top on doowwnnn HO HOOOOEEE!\nGet it on, on chrome baby\nI said baby can you feel me\nCuz' dem choppas be lookin' like\nHO HOOOEEE!\nOh baby baby can you feeeelll meee\nOhh yeah cuz dem choppas be lookin' like\nHO HOOOOEEEE!"}], "artist": "Lil Flip"}