{"songs": [{"title": "Welcome to Volume Two, Foo", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "Ever since man looked up at the sky and saw the moon\nHe became curious\nWhat was it like up there?\nDid people live on the moon?\nThere were some men who actually tried to reach the moon\nAny many strange stories have been told about those fantastic adventures\nNow, if man could build a rocket ship fast enough and strong enough to make the trip\nHe could travel through space to every place\nMan wondered about this for years and years\nWe've told you something about the first space engineers\nBut in order to make the long journey\nFirst of all...\n\n(Where does the sun go at night?)\nIt doesn't go any place, it's just out of sight\nBut if you're in the dark about day and night\nThis little song will show you the light\n\nUh-oh!\nMy mother's gonna find me\nAs sure as a moose likes moose juice\n\nAll aboard crew ship Jupiter\nMan versus strength to the moon\n\nA sky full of stars is a beautiful sight\nGleaming and twinkling in the night\nBut why are stars different colors?\n\nYou see, Mary Frances, A.B. Cito\nHe digs what they call sharing\nAnd so do we\nAnd we share our food and our juice and our work\n(Right on)\nYeah, and listen here\n\nDo you know the greatest travelers in the world?\nSeeds\nThat's right, the seeds of plants\n(How do the seeds of plants travel?)\n\nThey know their days of the week\nNow I know somebody who knows all the months of the year\nAnd his name is Mobity Mosely\n\nSpace station reporting to planet Earth\nWe are off to attempt our first landing on the planet Mars\nSpace station crew, attention, please\nAttention, space station crew\n\nWe have been training this flight for two years\nRight now, we are orbiting the earth\nAt an altitude of 400 miles\nThe first expedition to Mars is about to take place\n\nYou know who just left here?\nOld King Midas\nYeah, he was in trouble because...\nWell, I'll tell you\n\nNow, here's a song that makes you feel good when you sing it\nYou'll feel even better when you suggest it\nIt's called \"What Foods Should We Eat Everyday?\"\n\nNow, you see, Mary Frances\nBaby Ray loves the skin he's in\nBecause there's are different kinds of skin\nAnd different kinds of people\n(You know, Roosevelt?\nI remember you telling me\nThat no living things or any kind of thing are the same)\nThat's right\nNow, what I told you about\nIs not hurting yourself\nBut what I'm going to tell you about right now\nIs not hurting other people\n\nHere we are, on the moon\nWe carry our oxygen tanks in our bags\nAnd we are wearing special protective suits\nSo we may walk about the surface of the moon\nAnd make our observations\nLet's go exploring\nWe need 30 men in our space station crew\nBecause we've got a lot of work for them to do\nEach man will be a scientist\nYes, we'll need them all on our list\nWith food and water and oxygen we've stored\nTo take care of everyone aboard\nBut our space station won't be like the cities we know\nLike New York or Chicago or San Francisco\nWith streets and restaurants and parks and wall games\nYou see, there will be a lot of work to do\nAnd we have to think careful to take along when it's absolutely necessary for our work\n\nYou see, I know\nThat there are lots of things that I will try to do\nBut there is one thing that Roosevelt taught me never to do\nAnd Roosevelt better tell you all about it\n\nThe story of the planets, it began with the Sun\nA very hot mass of liquid gas, too hot for anyone\nNow, here is a name on the colorful map of the moon\n\nMy very good friend...\n\n[brandUn DeShay]\nBrandUn DeShay\nLet's go", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}