{"songs": [{"year": null, "title": "The Game Changer", "image": "https://images.genius.com/97e5f72432c5b33084c28f136249f9b1.442x442x1.png", "lyrics": "[Intro: Marsha Ambrosius]\nI will change the game, one day\nChange the game, one day\n\n[Verse 1: Saigon]\nI got signed to Atlantic Records, 2004\nThey predicted I do a million right outta the door\nThey said all I had to do was just follow the for-\n-mula you does, and you gon' be popular boy\nSee, what they fail to realize is I rhyme for the cause\nAnd got the same mind frame as Assata Shakur\nTold me they needed a single, who should they call?\nI said, \"y'all should put me in the stu' with Trey Songz\"\nNow all along they thinkin' we do a song how we bang the girls\nI said, \"nah lil' nigga, we 'bout to change the world\"\nAnd when I turned it in, expecting a grin\nThey gave a nigga this look like, never again\nAnd I looked back at them like never again\nI love all of you motherfuckers but, just as some friends\nI can't do music if it ain't got a message within\nI guess y'all can leave that up to the rest of them men\nI'm changing the game\n\n[Hook: Marsha Ambrosius]\nI day dream about money and fame\nI will change the game\nOne day (it's just a silly game)\nWhen everybody knows my name\nI will change the game\nOne day (change the game, change the game)\n\n[Verse 2: Saigon]\nOkay so now I got the Bentley dropped\nBut on the left side of my chest is an empty spot\nI can't lie, these little groupies they tempt me a lot\nBut for me to fall victim, I simply could not\nNah nah, I don't brag about the bottles I pop\nA lot of y'all are runnin' around here with the models I mop\n5 years ago when Entourage was shot to the top\nSuprised she still skinny, shorty swallows a lot\nHa ha! and ever so often\nSomebody comes around and delivers great songs without flossin'\nWithout talkin', bout shit that isn't important\nLike makin' a fortune off of somebody snortin'\nOr bein' the forces that causes someone to coffin [?]\nThis is all we doin' with hip-hop, we lost it\nAnd we should be ashamed of ourselves\nThe only people we can blame is ourselves, (who else?)\n\n[Hook]\n\n[Bridge: Marsha Ambrosius]\nI dare to dream, to be all I can be\nFor I am I\nMy imagination, I can do it all\nI can do it all, do just what I want\n\n[Verse 3: Saigon]\nI got released from Atlantic Records, 2010\nI swear to God, I felt like I's gettin' outta the pen\nIt started off real good, but how will it end\nWill I make it to the top of the tower again?\nWill I be on Hot 9 or Power again?\nOr will the people just assume that I'm sour within\nI told my story to 40,000 people\nNow it's time for me to get equal, the sequel\n\n[Hook]", "album": "The Greatest Story Never Told 2: Bread And Circuses"}], "artist": "Saigon"}