{"songs": [{"image": "https://images.genius.com/a8de6b36ccc06b0e9096884115bfea8c.1000x1000x1.jpg", "lyrics": "[Intro]\nHa ha!\nMhm\nDon't mind if I do\n\n[Verse 1]\nHey, it seems like every day I got a filled up phone\nLadies tryna text me, saying that they home for the summer\nAnd they heard that I'm living on my own\nSo they wanna come to the crib, maybe cook me some supper\nBut I'm busy, so I'm ignoring her\nYeah I just touched down in California\nNow I'm headed to the beach gon' swim in the water\nLike I'm tryna sneak in across the border\nI do all different types of crazy shit\nI'm the younging hoes tryna make a baby with\nCause it'll make 'em rich\nKnow I'm headed to the money, so these funny little girls wanna take a trip\nBut no, only the M.O.S.T. Dope with me\nOther fools homo, Roy and Siegfried\nNo disrespect though\nI got addictive cigarette flow for the green pesto, presto\n\n[Chorus: Adam Young]\nI'd like to make myself believe\nThat planet earth turns slowly\nIt's hard to say that I'd rather stay awake when I'm asleep\nCause everything is never as it seems\n\n[Verse 2]\nMe, I'm highly underestimated\nSo educated in getting paid quick\nIf you ever hated, anticipate that I'm famous\nGot a bunch of bitches to sip on the champagne with\nCelebrate that we seeing another day, life good\nNever wanna end this\nMe and Mary Jane got a really nice friendship\nYeah they give me money but I gotta go and spend it\nMan, I been a bad little jew\nBut I gotta pay the bills now so I gotta chill out\nI ain't walking 'round like I'm splurging with a mill now\nFeel like the kid working at the mill now\nUsed to just chill and smoke joints up at Bill's house\nNow I gotta schedule, things I gotta do\nDoing interviews, see it up on YouTube\nI say it feels just like a dream\n'bout to wake up from a nap\nHow fucked up was that?\nLike\n\n[Chorus: Adam Young]\nI'd like to make myself believe\nThat planet earth turns slowly\nIt's hard to say that I'd rather stay awake when I'm asleep\nCause everything is never as it seems\n\n[Outro]\nThis shit just feels good I'm not gonna lie\nJust some motherfucking kids\nWe just some motherfucking kids", "year": "2010-08-13", "album": "K.I.D.S", "title": "Don’t Mind If I Do"}], "artist": "Mac Miller"}