{"songs": [{"year": "2019-10-04", "image": "https://images.genius.com/5c327b90df5e37ff77d7d45715863993.800x800x1.jpg", "title": "Birdsong", "album": "Terror Management", "lyrics": "[Verse 1: billy woods]\nCame in Birdsong's dice game early, thinkin'\nAnd grabbed the motherfuckin' hand like Kunstler v Dershowitz\nInjected from the vehicle\nSpit a sixteen or two in mid-air, Satanic Verses\nLittle rattle in your head like small caliber lead\nWhat you get, rushin' to the grave say \"cut\"\n\"Cut into the leg\", say what?\nThen [gunshot] him in the face\nSaid it's a flood on the way, dried blood on the bullpen cage\nDaddy loved his slave, curlin' lip, heavy eyes just the same\nFirst time he saw the word nigga in a book, how it danced on the page\nBack in the days, when the family didn't say, how you knew it was AIDS\nCame to the back gate late, I'ma need that barricade\nContra spray gun held by the waist\nI didn't come by just to say hey (don't flatter yourself)\nBusta Rhymes on the A-train, countin' down the last days\nOh, and do you have any spare change?\nDo you have any spare change?\nDo you have any spare change?\nDo you have any spare change?\nDo you have any spare change?\n\nHe told 'em they could be God\nHe told 'em they could be God\nHe told 'em they could be God\nHe told 'em they could be God\nHe told 'em they could be God\n\nJust that age for heartbreak\nJust that age for heartbreak\nJust that age for heartbreak\nJust that age for heartbreak\n\nYeah but, but it, but the relationship\nIf you don't have a dream, fake it\nBut the relationship you can't fake it really\nYou got to fake it. Because we don't have dreams these days. How the hell can you have a dream, for what? So, so everybody's jiving. Well lets jive on that level\nIf I love you, I can't lie to you\nCourse you can lie to me; and you will. If you love me and you goin' off with Maddie someplace, you're lying to me. 'Cause what the hell do I care about the truth. I care if you're there, like Billie Holiday say \"hush now, don't explain.\"\nAlright, I accept that. Alright, I accept that\nOf course, of course you'll lie to me, 'cause I don't even wanna, of what, what does the truth matter? And why you gon' be truthful with me when you lie to everybody else. You lied when you smiled at that cracker down the job, right? Lie to me, smile. Treat me the same way you would treat him\nI can't treat you the way I treat him\nYou must, you must, because I've caught the, I've caught the frowns and the anger. He's happy with you. Of course he doesn't know you're unhappy. You grin at him all day long. You come home and I catch hell, because I love you. I get least of you. I get, I get the very minimum. And I'm sayin', you know, fake it with me\n\nJust that age for heartbreak\nJust that age for heartbreak\nJust that age for heartbreak\nJust that age for heartbreak"}], "artist": "​billy woods"}