{"songs": [{"album": "The Never Story", "year": "2017-03-10", "title": "Hereditary", "image": "https://images.genius.com/796771530cc626d2f5c7ae281bd32b3d.1000x1000x1.jpg", "lyrics": "[Intro]\nHey, we really need to talk\n\n[Chorus]\nYeah, yeah, uh\nWant me to tell you the truth?\nWhat you expect me to say?\n'Cause if we keeping it true\nIt's probably never gon' change\nBut I guess it's hereditary, baby, why you playing with my heart?\nIt's hereditary, girl, you was just playing from the start, yeah\nShit, but if you let me explain, shit\n\n[Verse 1]\nI shouldn't let you explain, you should just let me explain\nI see the games you be playing, it's really ice in your veins\nIt's kinda fucking insane, argue and power exchange?\nI guess I'm out of my lane, I know I'm losing my brain\nBut I know it's hereditary, baby, 'cause your mama was a G\nAnd your daddy wasn't there so you be tryna play with me, yeah\nShit, but, but that ain't the wave, yeah\nBut if I'm keeping it true, I know why I be this way now\nWe don't speak, we sit, eat food faced down\nWe don't sleep no more, we need space now\nShe gon' leave and go and her find her a bae now\nOuch, ouch, that's pain, yo, oh, so painful\nTrying to change, just let me die in the rainfall\nI can't save her if she don't want to be saved, how\nPlease, God, do something for me, God\nShe cut me deep just to see if I'ma bleed out\nI know this ain't​ what I need, but who's to say what I need\nWhat you say to your demons?\nWhat you say when your heart is walking away with your feelings?\nAhhh, but didn't you know I tried, tried, tried, tried\nTried to be the guy in your life?\nBut you tied my soul, spirit, and mind\nBeen doing this all your life\n\n[Bridge]\nThe fuck you want me to say?\nAnd if I'm keeping it true\nIt's probably never gon' change, no\nBut I guess it's hereditary baby, why you playing with my heart?\nIt's hereditary, girl, you could've said this from the start, yeah\nBut, but ain't that a waste?\nA big fucking waste of time\nA big fucking waste of time, yeah\n\n[Verse 2]\nUh, okay, I remember all the better days\nUsed to spend a hella lot of time\nGuessing something had got in the way\nGuessing I was probably out of line\nThen you said, \"Don't speak to me\"\nI'd be like, \"Okay, it's fine\"\nThat's just gon' prolong the fight\nKnow that we said that if one of us upset\nThen we just not gon' sleep tonight, aw, damn\nMan, this shit has turned all bad\nCall Mama, call Dad, call Izzy, call Precious, call Pat\nShit, it's like she spit in my face\nAnd now the world's fallin' down on me\nAnd I can't handle the weight\nBut I'm finna get medicated, maybe it'll take the pain away\nA relationship will make you have a fucking revelation\nBut, but that ain't a waste, no\nIt's never been a waste of time, a waste of time, waste of time\n\n[Chorus]\nUh, want me to tell you the truth?\nWhat you expect me to say?\n'Cause if we keeping it true\nIt's probably never gon' change\nBut I guess it's hereditary, baby, why you playing with my heart?\nIt's hereditary, girl, you was just playing from the start, yeah\nShit, but if you let me explain, shit\n\n[Outro]\nHey, we really need to talk\nBut, of course, you never answer your phone\nI just don't think this relationship is working out\nYou never make time for me\nYou never show me off\nYou just never make me feel special\nI mean, I want to work things out, but I would need you to change first\nAnd we both know, that will never happen"}], "artist": "JID"}