{"artist": "Ace Hood", "songs": [{"title": "Rider", "album": "Trials & Tribulations", "year": "2013-01-30", "lyrics": "[Intro: Ace Hood & Chris Brown]\nYeah\nIf I call my baby\nAce Hood\nShe pick up the phone every time\nThat's right\nAt the the drop of a dime, yeah\nThat rider\nGirl (Woo!)\n\n[Chorus: Chris Brown]\nYour girl don't need any kind of lover, be the right kind of lover\nBe the kind of girl make me want to turn you to a mother (Oh-oh, oh-oh)\nAnd I promise, promise, baby, there'll be always and forever\nYeah, we'll always be together\nIf you show me your ambitions of a rider (Yeah)\nYour ambitions of a rider (Yeah)\nIf you show me your ambitions of a rider (Ooh)\nYour ambitions of a rider\nIf you show me your ambitions of a rider\n\n[Verse 1: Ace Hood, Chris Brown & Both]\nUh, would you ride for me? Would you die for me?\nHad no money, would you still love me? (Yeah)\nIf I got jammed up and did a little time\nWould you still be the woman who gon' hold it down? (Yeah)\nThrough the hard times and them cloudy days\nWould you stand strong? Would you run away?\nAll the bullshit and all the heartache\nShe still ridin' with a nigga since the first day\nHer ambitions of a rider\nShe would be around if I never had a dollar\nShe would be my nurse if I ever need a doctor\nBonnie and Clyde, she never side with the coppers\nNever break code, forever be loyal\nNever break ties 'til we buried in the soil\nIf it ever go down, she tryna go too\nDown for whatever bullshit I'm goin' through\nAnd I gotta hold on, know that she my backbone\nNothin' like that feelin' when I'm in her so long\nPassion and that lovin' that between us so strong\nGrippin' on that ass, she just tell me, \"Hold on\"\nAnd she can be the wife, maybe one day\nHave a few kids, go and travel out the state\nShe gon' ride or die for a nigga 'til the grave (Yeah)\nAnd I hope it never change\n\n[Chorus: Chris Brown]\nYour girl don't need any kind of lover, be the right kind of lover\nBe the kind of girl make me want to turn you to a mother (Oh-oh, oh-oh)\nAnd I promise, promise, baby, there'll be always and forever\nYeah, we'll always be together (Yeah)\nIf you show me your ambitions of a rider (Yeah)\nYour ambitions of a rider (Yeah, rider)\nIf you show me your ambitions of a rider (Ooh)\nYour ambitions of a rider\nIf you show me your ambitions of a rider\n\n[Verse 2: Ace Hood, Chris Brown & Both]\nUh, need a down bitch for a real nigga\nNever lied to her, keep it real with her\nGot her own money 'cause she a go getter (Yeah)\nAnd she allergic to them broke and them ho niggas (Yeah)\nRule number one is that it ain't none\nProbably make shawty my wife when the day come\nNothin' like a pretty lady who can roll up\nThem other hoes, yeah, they mad, so what?\nMe and you for life, team us\nBig face Rollies, you can get the same one\nI'm in that Mulsanne, you in that coupe, what?\nAin't that many people 'round that I do trust\nYou the last of a dyin' breed\nRide for me, baby, everythin' is guaranteed\nAnythin' you ever wanted, or ever need\nTurn life out of any dream\nI mean that, keep it 100\nWhen I need that, she gon' come runnin'\nWhen I fiend for it, give that ass to me\nNever tell her no, she get the last from me\nIf I get jail, gotta go to court, she be right there, need I say more (Say more)\n(Love) Love\n\n[Chorus: Chris Brown]\nYour girl don't need any kind of lover, be the right kind of lover (Yeah)\nBe the kind of girl make me want to turn you to a mother (Oh-oh, oh-oh, oh)\nAnd I promise, promise, baby, there'll be always and forever (Ever)\nYeah, we'll always be together (Yeah)\nIf you show me your ambitions of a rider (Yeah)\nYour ambitions of a rider (Yeah, rider, yeah)\nIf you show me your ambitions of a rider (Ooh)\nYour ambitions of a rider (Ooh, ooh, ooh)\nIf you show me your ambitions of a rider\n\n[Outro: Chris Brown]\nShow me, show me\nBaby, show me your ambitions of a rider\nOh, yeah, please show me\nIf you show me your ambitions of a rider\nYour ambitions of a rider\nIf you show me your ambitions of a rider\nYour ambitions of a rider\nIf you show me your ambitions of a rider", "image": "https://images.genius.com/fd10f6966d666486d2f60d595f5bfd2b.300x300x1.jpg"}]}