{"songs": [{"year": "2016-08-29", "lyrics": "[Intro]\nToo real\nYeah, Yeah\n\n\n[Verse 1]\nRush hour, fresh out the dealership\nMe and my homies eat gefilte fish\nI ain't even worried about a silly bitch\nTell the feds chill with the censorship\nMembers only, I'm the only member with a membership\nTrying real hard not to conversate with pessimists\nWho always want to see you fall down like The London Bridge\nSame song sung by a bunch of kids, can I live?\nTabloids watching which crib\nCompetition and the bitches got my name on they lips\nTakin' shots like 1 8 7 is they favorite offense\nReal dawg, should've came with a fence\nSmokin' tree, baby I could pitch you a tent\nA lot of windows don't be selfish baby call you a friend\nI should make 'em box for Benihana, wake up in the mornin' feed em left over Benihana\nEatin' sushi off her body no karate I'm the inter-sake\n3 ninjas, Tum Tum, Colt, & Rocky\nBloodsport Van Damme\nPolo can't manage\nEven with my eyes shut, I would never take damage.(Too Real)\nYou should build a room for the panic\nSwitch my whole style up\nCapoeira fight dancing\nNot to say I'm Bobby gettin' fancy\nI should probably change my name to Jamie\nSoo Young lead me in a winehouse\nJuntao kidnap her, throw her in the 'cedes\nNow the asian enjoyin them some dim sum\nYou don't know about it need to get one\nHow the car new but the rims young?\nYou got the foreign whip? so what I'm on my 10th one\n\n\n[Verse2]\nYeah, niggas we deep in this bitch, right?\nStacking on them niggas like 'Jitsu\nI'm a Great White you're fish food\nWe should talk face to face like men do\nBut you too used to makin' moves how a bitch move\nProbably wear the same pad that your bitch use\nI'm just tryna show you what you been through\nSpinnin' in the same circle like a rim do\nOG in the game, strokes beard like Rick Rub'\nTokyo, they whippin' in the caddy, we can drift too\nWhen I drift through, bad bitch mixed with hindu\nShe got every shoe except issues\nBag full of money, MAC makeup and a Shih Tzu\nOr sake shots for my little Geisha\nShe'd rather die than give up our location\nShe gone turn to Chun-Li in any altercation\nI ain't gon lie that kinda turn me on, fuck her in the 'cedes\nJitsu, Jitsu, Jitsu, Jitsu\n\n\n[Outro]\nThis is only the beginning, the road gets tougher, now that you're a ninja, and if I told you that, I guess it would ruin the moment\nSo I'll tell you later", "title": "Air Bender", "album": "A.I.R. (Art Imitates Reality)", "image": "https://images.genius.com/5c49104d5de1bbfefcb27959d392d8c4.1000x1000x1.jpg"}], "artist": "B.o.B"}