{"songs": [{"title": "Today I’m Perfect", "album": "Route to U.K.", "year": "2015-10-07", "image": "https://images.rapgenius.com/f1b54fd53e7c7a999d6ca4918e75588e.640x639x1.png", "lyrics": "[Intro: Larry June]\nNigga I might go to L.A. tomorrow\nNah fuck that I'ma hit Seattle\nNah fuck it I'ma hit Diego\nFuck it I'ma hit the A town\nNigga get your motherfucking money up\nNigga I might hit New York in the morning nigga\nNigga have your bitch, nigga giving me sun-dried tomatoes for breakfast, nigga\nGot the bitch taking walks and shit now\nThe bitch say she in tune with life\nTold the bitch run to Whole Foods nigga\nGet me some distilled water, and a protein shake\nDamn, in that trap bitch\n\n[Verse 1: Larry June]\nDon't hit a nigga phone, tripping off the bitch\nI'm really having money, I'm fucking hood rich\nThe punk bitch chose, she on a nigga line\nShe gave me twenty thousand and some all black nines\nI'm mobbing through the point, two-tone semi\nTry to rob me, I'm busting 'til this bitch empty\nBoth cell phones cracking, man I could have  bought a Bentley\nKnow some niggas in New Jersey, real project niggas\nI don't do no motherfucking cocaine\nI'm too busy sending hoes, gettin paid\nMan my Vegas bitch, she love playing the blade\nLast night she brought a nigga 6k\nHit a nigga line, prices going up, shop now, hurry up and buy\nI see it in your eyes, you a fuck nigga\nYou ain't really 'bout it, nigga you a liar\nDropped outta high school, got the work for the low\nSold the shit for the higher\n22 inch three piece, nigga 300 just for the fucking tire\nGod damn young nigga fucking balling\nGod damn\n\n[Hook]\nI'm perfect\nDamn right bitch I'm Mr. Perfect\n(Bitch I'm doing terrific)\nHoe,  I'm perfect\n(Good Job Soldado)\nEverything I do is fucking worth it (Shit!)\n(Bitch) (God Damn!)\nPerfect\n(Ouch, damn, darn)\nI'm perfect\nBitch, damn\nI'm perfect\nEverything I do is fucking perfect\n\n[Verse 2: Larry June]\nDrive the whip like a race car\nBend the corner knock your fucking face off\nHit my jeweler said he got the Rollie with the red face\nNow I'm shitting on em\nRental car taxin', So I said fuck it\nWent and took my fucking plates off\nOn the interstate, 5 pounds of marijuana, Even getting shake off\nI'm feeling like a chemist, on your head like a dentist\nWe don't never leave a witness, bitch nigga\nForgiato spinning, I might fuck the bitch and take her out to dinner\nPut her on the blade, now she moving fast\nI done made the bitch a sprinter\nWhy the fuck you playing with me?\nMy money up, I don't be around\nPut a ten on your head\nDamn, you niggas getting too old\nI just knocked two hoes\nI just poured two fours\nNow I'm feeling like Kobe\nI need a Whole Foods endorsement\nEating kale with a white bitch, she was tired of the square shit\nShe love how a nigga ice hit\nOn the phone with my black bitch\nMy Asian bitch worth 100 bricks\nI'm the father to this rap shit, my DJs rock Raf Simons\nGod damn\nYes Lord\n\n[Hook]\nI'm perfect\nDamn right bitch I'm Mr. Perfect\n(Bitch I'm doing terrific)\nHoe,  I'm perfect\n(Good Job Soldado)\nEverything I do is fucking worth it (Shit!)\n(Bitch) (God Damn!)\nPerfect\n(Ouch, damn, darn)\nI'm perfect\nBitch, damn (God damn)\nI'm perfect (Shit!)\nEverything I do is fucking perfect"}], "artist": "Larry June"}