{"songs": [{"image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg", "lyrics": "[Verse 1]\nYea, and I can't feel my legs, I'm a paraplegic\nLord, I want a fair one with my demons\nKaren Meyers became married to Jesus\nBorn dead, they had to dig up my fetus\nAnd now the devil want to tear me to pieces\nI'm a diagnosed insomniac\nAn astronaut who blasted off into the stars galactic\nOn top of Saturn, fox-trotting with Velociraptors\nThe dino-aliens invaded Earth, so they could feed on hypochondriacs\nPreparing for the rapture, closet hillbilly threw the spinners on the tractor\nI listen to Uncle Kracker\nBut, that's white America for you, we all that matters\nI'm walking backwards, shadowboxing with karate masters\nIt's more to rap, we sell the royal crack at Castle Rock\nA bad apple like an unemployed Macintosh\nWe lost Jobs\nNow they brainwashed with dot com\nIt's only so long before we surrender the free world to Hong Kong\n\n[Chorus]\nAnd sinners stay still, but the merry go round, and round\nIt all just keeps spinning\nGotta keep swimming\nEat drink and let the merry go round\nEat drink and let the merry go round\n\n[Verse 2]\nI got a double sided silver dollar\nLarry Fish here from midget league, beginner slaughter\nI'm not drowning, I'm waiting in the water\nKilling off these monsters ever since I was a Sabra\nI got horses on my PJ's\nShout to spitta jet life, I fit the Porsches on the PJ's\nOn stage, sending dark forces to my DJ\nThe birdies on tour like PGA\nDavis love the third, Pittsburgh warrior\nBullets in my cornea\nIn exelsis Deo, ayo, this is Gloria\nAve, Ave Maria, I'm getting bread, yeast rise on Easter\nMoney is God\nBlack beaches with jungle fever I love to be on\nYou on the B-Team I fuck with Solange\nAll my life they said I doesn't belong\nSo I'm chilling, growing drugs on my lawn\n\n[Chorus]\nAnd centers stay still, but the merry go round, and round\nIt all just keeps spinning\nGotta keep swimming\nEat drink and let the merry go round\nEat drink and let the merry go round\n\n[Outro]\nYeah, what what\nHave you found a way out?\nHave you found a way out?\nVacation in Slovakia, celebrating Mardi Gras\nEating baklava and lobster claw at the Ramada\nWith Mafia immigrants\nFinna take 'em on a pilgrimage\nHave you found a way out?", "year": "2014-05-11", "album": "Faces", "title": "Ave Maria"}], "artist": "Mac Miller"}