{"artist": "Vast Aire", "songs": [{"title": "Lunch Room Rap (It’s Nothing)", "year": "2008-06-24", "lyrics": "(Intro)\nThis flow is ill, this flow is ill right here\nAdams Fam\n\n[Vast Aire]\nYou better watch my blade, speak the truth\nI bring the pain like Method\nBetter yet a wisdom tooth\nYou been miseducated, your style's outdated\nYou need to regroup, I'mma rap cyclone\nI'm tired of clones\nYou better get ten feet away, one size own\nFlip 'em the bird, flesh from the chrome\nYou got three feet of space and I'll crack ya dome\nSix minutes, Vast Aire is on\nAnd the party don't stop till we see daylight\nThat's about six a.m\nWhen you falling out the bar with ya next of kin\nWhere should we begin\nI got the yac, he brought the gin\nNow I'm seeing intruders like the Gods of crimson\nStyle's so sick, you need tea with lemon\n\n(Hook) 2x\nThis is that Lunch Room Rap that the b-boy's holla\nIt ain't about money cuz we all make dollars\nAin't about money cuz we all make dollars\nAin't about money; ain't about money\n\n[Vast Aire]\nYes sir! I leave men with no air\nI dare you to step up unprepared\nMy lecture's sharp like nades of spare\nShrink a few heads make 'em disappear\nSons of Joel, you better kneel before Zod\nBefore I show you the wrath of God\nI brush my teeth with a lightning rod\nI can pop-n-lock in my Izod\nMy favorite rapper was Todd Smith\nTill his head got gassed and he lost his shit\nIf you step up to me you better step legite\nI'll hold you to the light like you conterfeit\nHuh-eh, cuz I'm R A W\nThe 'R' stands for 'Run' thru you (Sha-boo-ku)\nThe 'A' is 'Allah's' virtue\nThe 'W' is a 'Wide' circle\nDon't make me hurt you\n\n(Hook) 2x\n\n[Vast Aire]\nThis is that Lunch Room Rap, don't get smacked\nThere's ten more of us in here how you like that?\nYou can leave with ya face sour\nI'll snap my fingers so you'll know I-got-the-power!\nWho's that? Ya crew's wack\nI guess Cinderella wants her slipper back\nThis is what happens when bears attack\nPlus I got more ho's then a ThunderCat (HOOOOOOOO!)\nCaddyshack, you want me to go for this and go for that\nBut I know how you moving and how you act\nI'mma volcano about to react\n\n(Hook) 2x", "album": "Dueces Wild", "image": "https://images.genius.com/eb42f00f56a165e0e57e8f51a829caad.536x536x1.jpg"}]}