{"songs": [{"title": "Wasted", "image": "https://images.genius.com/51f4f0ca8890a70af7bbc0100544b2aa.680x680x1.jpg", "year": "2019-03-15", "album": "Still Summer in the Projects", "lyrics": "[Intro: 03 Greedo]\nEvery day we wanna meet hoes at the strip club\nBitches ain't showin' no pussy and shit\nYou know what I'm saying\nHow much this shit cost?\nHow much it cost for me to see you half naked?\nNah, bitch, you just gon' show your nipples or something?\nMustard on the beat, ho\n\n[Chorus: 03 Greedo]\nHow much it cost for me to see you half naked?\nI only came outside the house with half a bag, ayy\nHow much it cost to get some brain while I lane switch?\nFuck you when you got the change, money ain't shit\nAyy, ayy, bitch wasted\nFuck it, I'm wasted\nAyy, ayy, bitch wasted\nFuck it, I'm wasted, ayy\n\n[Verse 1: 03 Greedo]\nHow much it cost for me to see you half naked?\nHow much it cost to bust it down like an AP?\nShe told me good pussy really worth the payment\nI paid the cost, we go half on a baby\nShe tryna have a soul child, she half crazy\nBitch, there ain't no money, we can get it out the pavement\nI ain't tryna trick ya, tryna put you on the slave ship\nGet it out the zombie, so she workin' on the grave shift\nTurn a trick, get that change on a late night\nSuck this dick in a Range on a late night\nFocus on the campaign on a late night\nStay awake off cocaine on a late night\n\n[Chorus: 03 Greedo & YG]\nHow much it cost for me to see you half naked? (Naked)\nI only came outside the house with half a bag, ayy (Bag, ayy)\nHow much it cost to get some brain while I lane switch? (Lane switch)\nFuck you when you got the change, money ain't shit (Ain't switch)\nAyy, ayy, bitch wasted (Wasted)\nFuck it, I'm wasted (Wasted)\nAyy, ayy, bitch wasted (How much it cost for you to... 4 hunnid)\nFuck it, I'm wasted\n\n[Verse 2: YG]\nUh, how much it cost for you to fuck, bitch?\nHow much it cost for you to suck dick?\nAyy, that pussy smell like you been at the club, bitch\nHouse in the hills, I got a tub, bitch\nWasted, notice I just fucked a fake bitch\nWhat's fake about her? Her ass and tits\nI ain't no leech, I ain't no bum, I ain't no fuckin' dummy\nI'm tryna put this dick in your tummy\nI don't believe her when she say she love me\nLove is dead, lil' bitch, I ain't no fuckin' mummy\nWasted, gang shit, go at her chunky\nWasted, gang shit, the whole hood love me\nYG got beat, the whole hood funky\nYG the reason the whole hood totin'\nBla-da-da, laughin' to the bank, hahaha\nThese ain't off-brand, lil' mama, these Pra-da-das\nI just wanna fuck, I don't ask for much\nYeah, I eat the pussy, I don't eat the butt\nAfter I fuck, don't hold a grudge\nI'ma hit it from the back, fuck up your lace fronts\n\n[Chorus: 03 Greedo]\nHow much it cost for me to see you half naked?\nI only came outside the house with half a bag, ayy\nHow much it cost to get some brain while I lane switch?\nFuck you when you got the change, money ain't shit\nAyy, ayy, bitch wasted\nFuck it, I'm wasted\nAyy, ayy, bitch wasted\nFuck it, I'm wasted, ayy"}], "artist": "03 Greedo"}