{"artist": "Big Daddy Kane", "songs": [{"lyrics": "On and on and on and on\nMe say the beat don't stop until the break of dawn\nNor does the growth of our young world\nYes the children, be buildin, each boy and girl\nCause you are the cream of the planet earth\nThe new birth, now take that for what it's worth\nAnd give the child room, to blossom and bloom\nLivin large, it's your destiny to consume\nTo take flight and ignite to a brand new height\nCause that's your goal in life - am I right? (Yeah!)\nTo start reachin, come on each and every\nSingle one of y'all comprehend what I'm teachin\nI said listen up, listen up, listen up youngster\nLearn from a lesson that the Big Daddy brung ya\nIt's nothin but knowledge, I shall bring to you\nAnd I'm not Mr. Rogers or Captain Kangaroo, but I know\n\n\"children, children\" - \"are the future\" (variations 4X)\n\n\"children, children\" Where we goin now?\nTake my hand my child, and let me show you how\nCause I'm here to help..\n.. those who need Knowledge of Self\nYoung brothers and sisters, considered the cream\nThat must rise to the top and fulfill the dream\nAnd there are desires that we all want to achieve\nBut remember, respect is most greatest to receive\nAnd we don't have to gain it by bein TOUGH\nOr sellin our own kind that cooked white stuff\nSo bring your negative mind from out of the shade\nFind your true self and let's all get paid, because\n\n\"children, children\" - \"are the future\" (variations 4X)\n\nPeople, people, why we live illegal?\nYour life just ends short and you know that there's no sequel\n(sequel) They'll say that it was fun while it lasted\nYou run wild, stickin up and gettin blasted\nPregnant girls livin solo, on the welfare\nCause your so-called man said go to hell dere\nAnd young brothers that could be tryin to rap\nInstead, are out boostin clothes at the Gap\nNow what kind of life is that for a child?\nRunnin wild livin foul, hey, change your lifestyle\nGet some knowledge, and open your eyes\nJust take a little bit of time\nHow fully you'll come to realize, that\n\n\"children, children\" - \"are the future\" (variations 4X)\n\n[Kane * singing *]\nI believe the children are the future\nTeach them well and let them lead the way\nShow them all of the beauty they posess inside\nGive them, a sense of pride\nTo make it easier, let the children laughter\nRemind us how we used to be", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": "1989-09-19", "title": "Children R the Future", "album": "It’s a Big Daddy Thing"}]}