{"songs": [{"lyrics": "[Intro: Kanye West & (D'Banj)]\nGOOD Music, Yeezy\n(I'm D'Banj)\n\n[Verse 1: Kanye West]\nIf you ask me\nAnybody who ain’t tell you you was beautiful today need their ass beat\nAs we proceed, Island breeze, light the weed\nI couldn’t find the words on how I feel\nBut what I lacked in skill I made up for in real\nTime, the most precious thing a man could give\nBecause what she givn' back is why that man can live\nWe need to take a break, minus the screech, oh\nFind a resort, what? Private beach, Oooh\nPina colada sippin', by the sunset\nMy mission is to find every position, we ain't done yet\n\n[Hook : D'banj]\nTake my heart, take my love\nTake my body, come build my home\nStay with me di Iyawo mi\nCause you love me\n\nI will be your Scape goat honey\nCause you came through for me\nYou gave me break through baby (x2)\n\n[Verse 2: D'banj]\nBaby Boo I can see your eyes\nSay you don jam many fools for your life\nThem go come as lovers as them disguise\nBut as time goes by, na your body be the price\nYour back side sef...wey you carry na die\nThat's why sometimes I no dey surprise\nThem go say them love you but that na lie\nChop and clean mouth, tell you bye bye\nMe sef i no tell you say na me holy pass\nSome people dey talk say i dey use jazz\nThem say I bush, Some say I razz\nThem say I be nobody, I no get class, Well\nI've been bad and I know it and I'm sorry - wanna show it\nBut no one would give me a chance to prove myself\nDespite what you've heard of me\nYou still went ahead to be with me\nYou have chosen to be there for me\nTo you, I make this vow\nI say...\n\n[Hook]\n\n[Verse 3: Kanye West]\nYou getting louder than a two year old drumset\nThat's a mean gift, you work a mean stick\nYou’re like a phoenix, you could be my phoenix\nJust rub your hands all over my v-neck\nSwag, swag on Mach 5\nPac, 'cause don't it feel like Pac alive?\nFeel my apocalypse, feel like I could just\nTouch heaven with a Goddess in my fingertips\nAnd I’m just trying to kiss every single lips\nHey Yeezy, what’s your next single is?\nThat D'banj causing hysteria\nSoon as we hop of the plane in Nigeria\n\n[Hook]\n\n[Outro]\nOmo toh good oh (toh good oh)\nOh nice oh (toh good oh)\nOmo toh clean oh (toh clean oh)\nOmo to set oh (toh set oh)\nToh sweet oh (toh sweet oh)", "album": "D’Kings Men", "year": "2013-04-23", "title": "Scape Goat (The Fix)", "image": "https://images.genius.com/6ef5171cb8c3115364be5d49a2c6ca9e.500x500x1.jpg"}], "artist": "D’Banj"}