{"songs": [{"title": "Big 5", "lyrics": "[Intro]\nAhh like a breath of fresh air\nIts AKA up in here, Clu!\nIV league baby\nYou know who it is\nI didn't have to tell you\nMara hey, just making sure\nComing around with us\n\n\n[Verse 1: AKA]\nOh Yeah!!\nI'm from the jungle baby\nIt's the 011 in my blood that makes me\nI grab my nuts with a swagger of a young Jay Z\n\"I live by two phrases, Fuck you. Pay Me\"\nMy pops saying \"fuck, you lazy\"\nSo I gotta get up off this couch and get up out the house\nAnd do a couple thousands and make a couple rounds and\nTill the whole IV league is lounging, township\nWith lean but I spit that model C shit\n[?] don't you see them?\nMy boy said we can get a KG from the weed man\nWe can sell it to students stressing before the prelims\nHold up!\nI can't be no drug dealer\nI'm a dreamer but fuck working for peanuts\nAnd my team got my back like cili-postherpetic\nMoney on my mind and I mean it\n\n[Chorus: AKA & Clu]\nAy we chasing the big 5\nJust to be living the good life\nPaper getting stacked up\nYoung black and handsome\nDreams in my head so my jeans looking heffed up\nAy we chasing the big 5\nJust to be living the good life\nTryna plan a great escape\nTired of living day to day\nBounce on my walk tell you all about the paper chase\n\n[Verse 2: Clu]\nI can't start to express my love for it\nExpress how much I adore it\nBut mama raised me with no cash didn't know we were poor\nTill the store manager said we couldn't afford it\nSo let's just walk it out cause that's what I do\nLets seat 44 now that's how I commute\nYou ever seat next to bumba etexing?\nWhile the windows shut closed plus ngpandle guya shisa?\nI never did try rock them Cubans sa khone\nAlways stood back and left inkunzi za khona\nI put down laybye on some sneakers for (..)\nHe in a Benz i'm still repping Corollas\nFor that big 5 i'm gone be a game ranger\nMake my way to the top and not owe you a damn favor\nThe soundtrack to my swagger's back\nCause we tired of s'hleli nqenge\nInfact its always on my mind\n\n[Chorus: AKA & Clu]\nAy we chasing the big 5\nJust to be living the good life\nPaper getting stacked up\nYoung black and handsome\nDreams in my head so my jeans looking heffed up\nAy we chasing the big 5\nJust to be living the good life\nTryna plan a great escape\nTired of living day to day\nBounce on my walk tell you all about the paper chase\n\n\n[Verse 3: AKA & Clu]\nBecause my last name Forbes\nI'm bout my business kid\nTake a stand tall and make it on the riches list\nTryna stack simba chips so my kicks stay crisp\nBall so hard forgot aout when Christmas was\nSo roll in your Corolla or drive slow in you Polo\nI love God, but God Damn I love the dough though\nI grab a piece of Jesus but I grab my Jesus piece quick\nSwing my chain from side to side and make these bitches Sea sick\nAin't no limit to what money can do for ya\nPaying rent, Kids getting privately schooled for ya\nRoyalty cheques\nIncome a month with two lawyers\nMake sure your enemy uz' umoya\nBut, But who knows\nWhat happens to those\nWho die with lots of money while making it, lose souls\nGiorgio Armani, Versace and Fools gold\nGot me chasing wealth that will last till tombstones\n\n\n[Bridge: Clu]\nThis music takes me back to the ghetto\nSo I hold it down for homies stuck in the meadow\nFrom Cape to Soweto\nIf hustling ain't easy then let go\nTryna gas you up like you were working at Sasol\nPouring the petrol\nDriving Iveco\nTryna Pull you over like they working for Metro\nYou making ends meet uhlalu phanda macents, joe\n\n[Outro]\nLet me tell you wah i learn [?]\nYou might have a lotta dreams but [?]\nThem are rock ya boat see if you can stay afloat\nIts a world of greed in the city of gold", "year": null, "album": "Altar Ego", "image": "https://images.genius.com/04dba2cb161f7bd426cc0ca9e52a2d54.1000x1000x1.jpg"}], "artist": "AKA"}