{"artist": "Phife Dawg", "songs": [{"album": "The Hip-Hop Experiment", "title": "Love According to Dexter", "image": "https://images.rapgenius.com/931dc90251e7dc528d0bfdaa59163208.300x299x1.jpg", "lyrics": "[Skit: Dexter/Dee Dee]\nOooo, what does this button-?\nStop, stop, stop!\n\n[Pre-Hook: Slick & Rose/Phife Dawg]\nCome on (c-c'mon)\nCome on (c-c'mon)\nCome on (c-c'mon)\nCome on (c-c'mon)\nCome on (c-c'mon)\nCome, wow, oh wow, oh wow (come, c'mon, c'mon, yeah!)\n\n[Intro: Phife Dawg/Slick & Rose ad-libs]\nYes, yes, ya'll (Yes, yes, ya'll)\nWe don't stop, ya'll (We don't stop, ya'll)\nCheck, checkity-check, check, check\nDexter's lab, ya'll (Dexter's lab, ya'll, check it)\nYou're now rockin' with the best (best, best)\nFrom the east, south, north to the west (west)\nRhythm Kids, Smokin' Needles about to bring it to your chest (oh, yes!)\n\n[Verse 1: Phife Dawg/Slick & Rose ad-libs]\nSome may see me as a loner, one who keeps to himself\nA three-foot genius who might talk to himself\nMost people think I'm crazy, if I were you I would too (c'mon, c'mon, c'mon, c'mon...)\nBut when science is your life, tell me, what else can you do?\nMost kids have plenty friends (I think you call that a crew?)\nFor me it's all about a lab (and my 400 IQ)\nStaying focused is the key, I love when no one's around\nDee Dee, I love you sis, but I have no time to clown (no, no)\nGotta get my mind right, straight up my future is now\nConcoction's anonymous, peep the way it goes down (yeah!)\nEight years and counting, yet I found my profession\nHandle business with a question 'cause I'm all about progressin' (uh-huh)\nThat's the way it is when you enter a lab session\nEveryday when I'm creating, it's quite invigorating\nKnowledge is the key, well, at least it's my perception\n(The lab, the lab!) Oops, pardon me, obsession (ha!)\n\n[Pre-Hook: Slick & Rose/Phife Dawg]\nCome on (yeah!)\nCome on (yeah!)\nCome on (yeah!)\nCome on (yeah!)\nCome on (yeah!)\nCome, wow, oh wow, oh wow (yeah!) (here we go!)\n\n[Hook: Phife Dawg/Slick and Rose/Together]\nThe name's Dex, ya'll, and it's the same old story\nWhere you been, kid? Lounging in the laboratory [?]\nMaking moves 'cause I refuse to lose\nThis is how I maintain, can't let the time reign\nBut who are they, Dex? Rhythm Kids, they keep it gully\nNeed names, ma? Ras, Roots, and Phife Diggy\nPut your hand in the air if you wanna get busy\nFrom the east to the west, L.A. down to Philly\nIt's like that, ya'll, and ya don't stop (B-Town turn it up!)\nIt's like that, ya'll, and ya don't stop (Mo-Town turn it up!)\nIt's like that, ya'll, and ya don't stop (Mack-Town turn it up!)\nIt's like that, ya'll,  chigga-chigga, ya don't stop (H-Town turn it up!)\n\n[Verse 2: Phife Dawg/Slick & Rose ad-libs/Together]\nNow if it wasn't for the chemistry (chemistry?)\nNo doubt about it, my life would be a misery\nPicture me without technology (yeah!)\nBetter yet, ask Lil' Bow Wow how he feel without Jermaine Dupri ([?])\nI'm too busy making history (that's right!)\nThat's the way it has to be and shorties will be chasing me\nI love this game, it never ceases to amaze\nFor this deep knowledge I crave, I don't mind being its slave (c'mon)\nI live for this, die for this, I will cry for this (cry for this)\nSo much to learn, I almost think that I've invented this (invented this)\nMy life relies on this and there's just no denying it\nMom thinks that I'm crazed with it, but hey, there be no fighting it\nIt's like an MC with flows when they be tight with it (Tight with it!)\nThere's no defying it, it's just something I can't resist\nLove! Capital L, two U's, and one V\nIf it wasn't for the lab, I don't know where I would be\nI love it when my brain's communicating with me\nScience, I love science; that sound, it all seems natural for me (yeah!)\nNo one's allowed through them doors, it gets devious (Devious!)\nMy friends thought it was a faze being mischievous (Mischievous!)\nBut this lab is like my babe, forever you I lust\nYou know my style, it's personal and you cannot be touched\nI'm not your average figurehead who simply yaps too much\nScientific name, drop it who gets left in the dust\nI'm the one and only Dex, I tend to keep my game tight\nRepping your favorite network every night\n\n[Pre-Hook: Slick & Rose/Phife Dawg]\nCome on (yeah!)\nCome on (yeah!)\nCome on (yeah!)\nCome on (yeah!)\nCome on (yeah!)\nCome, wow, oh wow, oh wow (yeah!) (here we go!)\n\n[Hook: Phife Dawg/Slick and Rose/Together]\nThe name's Dex, ya'll, and it's the same old story\nWhere you been, kid? Lounging in the laboratory [?]\nMaking moves 'cause I refuse to lose\nThis is how I maintain, can't let the time reign\nBut who are they, Dex? Rhythm Kids, they keep it gully\nNeed names, ma? Ras, Roots and Phife Diggy\nPut your hand in the air if you wanna get busy\nFrom the east to the west, L.A. down to Philly\nIt's like that, ya'll, and ya don't stop (A-Town turn it up!)\nIt's like that, ya'll, and ya don't stop ([?] turn it up!)\nIt's like that, ya'll, and ya don't stop (Oak-Town turn it up!)\nIt's like that, ya'll,  chigga-chigga, ya don't stop ([?])\n\n[Outro: Dexter/Phife Dawg and Slick & Rose ad-libs]\nYes, that should do it!\n(Dexter, you're my hero, you're my hero) (Say it again, say it again, say it again)\nAnd once again, thanks to my magnificent and astounding genius\n(Dexter, you're my hero, you're my hero) (Big Dexter, ya don't stop)\nScience can hold its head up, head up, head up, head up...\n(Help me out, help me out...) (Dexter, you're my hero, you're my hero)\n(Big Dexter, ya don't stop)\n(Say it again, say it again, say it again)\n(Dexter, you're my hero, you're my hero)\n(Ras, Roots and ya don't stop)\n(Everybody, ya don't stop)\n(Rhythm [?])\n(Yes...another [?] Smokin' Needles...] (song fades)", "year": "2002-08-20"}]}