{"artist": "9th Prince", "songs": [{"album": "Revenge of the 9th Prince", "lyrics": "['Next Friday' sample]\nSay another muthafuckin' word, and this shit is over\nAnd I ain't playing, nigga\n\tNow, you ain't got no gun\n\tBut where the weed at?\n\n[Intro: 9th Prince]\nThis is what it is right? Word, yeah\nThis is what it's about, this is how it's going down?\n\n[9th Prince]\nAiyo, I'm raw like Kane, blood stain the game\nRevenge of the 9th Prince, selling like cocaine\nNobody knows my pain, strain on the brain\nLast nigga fronted, they found him slain\nIn the gutter, niggas is slipping like butter\nThat's when I heard a utter, shut-shut the muthafucka\nI can't help it, the flow is so dangerous\nYa'll the most lameless, living shameless\nCheck out my guest watch, the diamonds on the bezel make the best watch\nPray that you will know the time just like a clock\nI want Jay-Z and Lil' Wayne's spot\nI was always taught, hip hop was an art, so play it smart\n\n[Chorus 2X: Shyheim]\nSour diesel niggas get high everyday\nNiggas in the projects, every day, every way\nSaid, sour diesel niggas get high everyday\nProject niggas, every day, every way\n\n[Shyheim]\nYou want a chick like mines, a whip like mines\nA four-fifth with a kit, that look like mines\nThat look like mines, he want a piece of the pie\nYou want to go to Cinderella's and throw ones in the sky\nBut you can't be I, big S-H-Y\nGot crazy niggas on payroll, like S.S.I\nThink he really want drama, for the rest of your life\nIt ain't easy, being greasy, my neezy, believe me\nI got felonies, nigga, got Big L in me nigga\nSo the cells in me, nigga, people taking my picture\nThe young God fisher, Bottom Up Militia\nGetting richer and richer, and I'm a Staten Island nigga\nShould just be you, cuz you can't be\nBottom Up C.E.O., L.E.O. VP\nBottom Up C.E.O., L.E.O. VP\nI'm Bottom Up C.E.O., L.E.O. VP\n\n[Chorus 2X]\n\n[William Cooper]\nYa'll must be blowing that sour, or sniffing that powder\nYou see the Black Market logo, my flow is the foulest\nSpit in the face of cowards, drink Henny from a chalice\nMy strength that just, shake the walls of the palace\nAnd I'm cut from the heavenly cloth, rose bearers\nDrop petals at my feet when I walk\nYou know I carry that cross, kiss the ring and the boss\nFor snitch that wanna talk, yeah that things go off\nYou start to feel no remorse for the lies that's lost\nNow you sing a sawed-off, that'll rip your limbs off\nThe homicide on the scene, yeah you line it in chalk\nBuried in Ku Klux, while they still holding the pitchfork\nAiyo, live with the Prince of New York, the Pale Horse\nAnd now he lit with his torch, burn diesel and never cough\nNow I'm sitting in court, for aggrivated assault\nBitches asses, left the hospital on life support, come on\n\n[Chorus 2X]", "year": null, "title": "Sour Diesel", "image": "https://images.genius.com/af61f0ef977c2f691226fe0ab315bfd9.500x500x1.jpg"}]}