{"songs": [{"year": "2015-12-07", "image": "https://images.genius.com/c03c0a3f9195d374975890a9196565bb.1000x1000x1.jpg", "title": "Angeberprollrap Infinity (Outro)", "album": "Zuhältertape Volume 4", "lyrics": "[Part 1]\nAh! Das ist kein Angeberprollrap!\nIch informiere lediglich den Hörer über meine Sammlung an voll fetten\nGuns auf dem Wandregalholzbrett\nGoldene Colts, Magnums und meine Schlangenledergolfsets\nUnd du fragst dich: \"Was sind Schlangenledergolfsets?\"\nGolfsets aus Schlangenleder, du schwanzleckender Volldepp\nDa hättest du drauf kommen können, Nutte\nOder brauchst du jemanden, der dir das Ganze hier dolmetscht?\n\n[Bridge 1]\n\"He? Brauchst du da jemanden, hm?\nSach mal! - Dann würde ich dir mal raten, ins Telefonbuch zu schauen\nSchau mal da rein! - Und einen anzurufen, du kleiner Hurensohn\nOkay, pass auf! Ah!\"\n\n[Part 2]\nIch flieg' los mit exotischen, attraktiven\nDiven in modischen Pradastiefeln zu tropischen Paradiesen\nUnd als ich unter Kokospalmen da liege\nSind paar Models fleißig Pics vom Bigboss für ihre Fotoalben am schießen\nIch fahr' hinter 'ner Hochseeyacht Wasserski mit krassem Speed\nLass' mich schleifen wie 'n Rohdiamant, mach' Deals\nIm Hinterland, wo ich dann irgendso 'nen\nIn der kolumbianischen Drogenmafia aktiven Kokslieferant abziehe\nUnd dass ich beim am Ozean Langspazieren die Rolex im Sand verliere\nKann passieren, wie 'n Profikoch Mandarinen\nDoch egal, ich hab' Kohle! Du Punker siehst\nAuf mein' Poloteelogos Krokodile, so wie auf Fotos vom Land am Nil\nMeine Homes sind verdammt massive, bedrohliche Kampfmaschinen\nEin Punch - du fliegst nach oben, im hohen Bogen wie Satelliten\nDamals dealte ich Drogen an Parasiten\nHeut hol' ich die Chartplatzierungen, Bitch, es geht nach oben wie Stalagmiten\nDoch ich bleib' am Boden wie bei Pilotenstreiks Passagiere\nMassakriere Deutschraphomos mit Flows wie 'ne Submachine\nWeck' erotische Fantasien, Sexsymbol, treib' bei Tantraspielen\nHoes beim Knallen nach dem Auftritt zu Explosionen wie 'ne Panzermine\nDeine hohle Mom will blowen, aber Homie, bei aller Liebe:\nDiese Hoe ist unter aller Kanone wie Magazine\nUnd kann mir gestohlen bleiben!\nSo wie dir dein rosaner Opel, der steckt wohl längst bei den Polen wie Batterien\nIch schick' deine Cokebitch los, bin im Rotlicht am Abkassieren\nSluts marschieren -\nK zum O, Bitch! Das Chrom blitzt am Anthraziten\nHummerjeep, Kid! Ich bin im Schein der Mondsichel nachtaktiv\nFüll' mit Strophen das Blatt Papier, die Nationen danach zitieren\nWie mythologische Sagen von Zyklopen und Fabeltieren\nPsychologen wollen alarmieren\nDass die Lyrik voll roher Gewalt labile Kids zu Killern großzieht wie Ballerspiele\nChronisch wie Allergien, doch ich enter' auf Coke die Gesangskabine\nSieh mal, du fährst die Drogen- und Hustlerschiene\nSchwimmst bloß mit 'nem Strom wie Elektroboote, du Bastard, flieh, denn\nPumpguns zielen auf verlogene Hoes, wenn ich komische Punks skalpiere\nZiehen sie Perücken vor wie bei Schachpartien\nKein Monopoly, doch ich spiel' mit Kohle und mach' paar Riesen wie Schokoladenfabriken\nDeutsche Rapper sind Homos und Transvestiten\nKid, ich bring' sie zu Boden wie Schlammlawinen\nZuhälterrap - ich hab' mir die Krone im Land verdient\nDenn ich bin besser! Kingrapper, Pimpslapper\nBitchrappern ins Gesicht stechender Mac mit Springmesser\nKling' fresher als ein rauschender Gebirgsfluss\nTorten fliegen auf mich als wär' ich ein Clown aus einem Zirkus\nLauf, es gibt 'nen Hirnschuss mitten durch die Schädeldecke\nBlutspritzer regnen deiner Bitch auf ihre Tränensäcke\nAn Laternen in der Hood hängen Cops an 'nem Strick\nSie wurden vom Boss aufgeknüpft, wie der Rock deiner Sis\nUm ihr den Cock reinzudrücken, sie ist 'ne richtige Schlampe\nUnd kann sich nicht mal im Bus festhalten, ohne Striptease zu tanzen\nEy, empfängt sie mich nicht im engen Seidenpyjama\nDann kommt sie im Mini, wie ein Kleinwagenfahrer\nUnd sie scheißt auf Gelaber\nNimmt gleich meinen Schwanz, er ist steinhart und startklar\nDa kommst du kleiner Versager am Abend heim auf dem Fahrrad\nGehst hoch, kommst rein, siehst uns beide und jammerst:\n\"Was treibst du da, Mama?\"\nKriegst ewig keine Antwort und\nHörst mich dann nur sagen: \"Deine Mum is' gut erzogen, Kid, sie redet nicht mit Schwanz im Mund\nAußerdem bist du wohl ganz schön dumm -\nStellst hier dumme Fragen, Mois, als könntest du nicht sehen, dass ich die Schlampe bums'!?\"\nBlitzmerker!\nEy, eines Tages lassen meine Memoiren Leser strahlen wie Lichtschwerter\nUnd Geschichtslehrer droppen dann Vorträge über meine Errungenschaften als Bitchslapper, ah\nKid, und du kriegst keine Bitches ins Bett\nEy, du hast eher sechs Richtige als richtigen Sex\nMit deiner meterbreiten Grinsefresse\nEy, dieser käseweißen Pimmelfresse\nTze, ey, dieser eselsgleichen Inzestfresse\nWiderlich, Bitch!\nAlso glaub nicht, dass du Hund hier 'n Aufreisser wirst wie'n Chinaimbiss\nOkay, der braucht 'n bisschen\nDein Dad ruft wegen Stoff an, ich sag': \"Heute geschlossen!\"\n\n[Bridge 2]\n\"Du kleiner Kiezstricher\nUnd jetzt hol' mir mal bitte deine Freundin her\nIch hab' hier 'ne neue Kamera -\nDie würd' ich ganz gern mal austesten!\nOkay, da isse ja, brav!\nOkay, pass auf, ey!\"\n\n[Part 3]\nEy diese Punkrockerbitch sagt, wie lammfromm sie ist\nDoch zeigt der Kamera dann ihr bestes Cumshotgesicht\nSie kriegt 'nen Kampfsportlertritt, bis der Kiefer wegknickt\nUnd zur Verfeinerung der Deepthroattechnik ganz locker sitzt\nWie ich im Bürostuhl drin\nOder der der Schlampe leicht vom Finger rutschende Verlobungsring\nDen du der Hure bezahlt hast\nGuck, wie ich die Frau, mit der du 'ne Zukunft geplant hast, auf YouPorn zum Star mach'\nUnd zwar so: Guck, ich chill' backstage mit der Braut\nUnd, naja, nehm' dann ein Sextape mit ihr auf\nMit dem Powerschwanz in Action\nUnd wenn's im Kasten ist, wird's auf jeder Seite geteilt wie 'ne\nZauberassistentin\n\n[Outro]\n\"Yeah, aha, auf jeder Seite, überall!\nAuf YouPorn, Facebook, es muss überall drauf!\nSogar Instagram, so zumindest so'n 15-Sekunden-Videoschnipsel\nImmerhin, he! Damit's auch der letzte Vollidiot mitbekommt! SchülerVZ, sogar für die ganz hängengebliebensten Hurensöhne auf MySpace! - Richtige Hurensöhne!\nDamit's wirklich der letzte Hurensohn mitbekommt!\nDanke fürs Zuhören! Zuhältertape 4, I'm out, ihr wisst Bescheid!\nEs ist wie Spiegel:\nMan sieht sich, meine Freunde!\"\n\n\"Yo, Boss?\"\n\"Wo ist mein Geld?\"\n\"Pffh, was soll ich sagen? Ich hab' deine Kohle nicht mehr!\nDumm gelaufen, aber, ey: Eigentlich 'ne ganz lustige Story, also -\"\n\"Ja, zum Schießen, Nutte!\""}], "artist": "Kollegah"}