{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/692606fdd3b8633e17a5f02a90ec07ac.500x500x1.jpg", "title": "American Dream", "year": "2011-05-17", "album": "PL3DGE", "lyrics": "[PRELUDE]\n(Radio Announcer) \"The American dream had a price tag ... and only one man in a million was hungry enough to pay\"\nHey man, you can save that morality for your minister\nAnd you can save that speech for the sisters of the church\nThis is America, jack\nThis is all about corporate takeovers and money makeovers\nWealth matters and poverty doesn't\nWe all say we love Martin Luther King, but we all wanna live like Don King, don't we?\nGod bless America! God bless America!\nHome of the Rockefellers, home of the Carnegies\nHome of the end justifies the means, legitimized through larceny\n\"Fuck the king! Fuck your taxes!\" is what they told their masters\nBefore they became our masters\nSo rebelling against power is natural\nAnd being an outlaw is actually ...\n\n[HOOK]\nMy American dreams, my American schemes\nFueled by American greed\nMy American dreams, my American schemes\nFueled by American dreams\nIt's American me, it's American me\nBy any means necessary\nAmerican me, my American dreams\nFueled by American schemes\nIt's American me\n\n[VERSE 1]\nIn America the crooks get the castles\nNever see a Rothschild or Rockefeller shackled\nWhile Rockefeller Drug Laws keep us in a shackle\nEventually this weed'll be as legal as tobacco\nBy then every CEO I hope will be a black, though\nMessage to the felon, keep sellin', my brethren\nThe end of an era soon coming I tell 'em\nBumpy Johnson showed us the way, don't fail him\nBig Meech united all the streets, they jailed him\nPablo fought the government so they killed him\nProbably took his bricks and brought 'em to us to deal 'em\nMy critics say I celebrate the dope dealer ... probably\nCause I'm pro whatever prevents me from feeling poverty\nFor the same reason Prescott Bush worked with Nazis\nThe same reason Kennedy's dad ran the rum\nBy any means necessary I will overcome\n\n[HOOK]\n\nYou become a sociopath flipping birds\nThe same mindstate it takes to build a Bilderberg\nOr an Enron or any other big con\nThat could fleece a million people out of billions\nI'm trying to get a cheaper price, you know, a bigger bag\nMexican work ... how American is that?\nAs American as steering in a German car\nFucking a Russian chick snorting coke from Colombia"}]}