{"artist": "C-Bo", "songs": [{"title": "187 Dance", "album": "Tales From the Crypt", "year": null, "image": "https://images.genius.com/63b1ea5449fd1a873e1830ba19742fb3.600x590x1.jpg", "lyrics": "[Hook]\n\"187 don't stop\" - [Dr. Dre]\n\"Cuz it's 187\" - [Snoop Dogg]\n\n\"187 don't stop\" - [Dr. Dre]\n\"Cuz it's 187\" - [Snoop Dogg]\n\n[Verse 1: C-Bo]\nTop down, side ways through the town\nSuckas want funk so I hit they block for a second round\nLets who ride and buck these suckas down quick\nPop in the clips and skips down these fool's strip\nStraight to they sto', breakin they ass off something proper\nThe gun G-O-D's pulled up, sitting on choppers\nCuz you know I can't be slippin in the '94\nSo put up a Glock, cuz we be buckin with them 4.4's\n45. Auto Mag. .30 round clip. Fully Mag\nP-30, mini-14. Desert Eagle, 50 caliber gats\nI guess I'm tired of getting crept on, stepped on\nWe load the high explosives talons when the ?sweats on?\nSo put up your duke as I get deeper you shoot for the one in the deuce\nDrop the top of the block, poppin the glide, I pursue\nIt's just another g fillin yo bad ass up to the rim\nPop the clip with a mack-10\nHop out the drop and crack that grin\nCuz like A, I'm in it to win it and plus I play 4G\nSo make way, ?? Mack at ya front teeth\nCuz when you playing with mines, you playin with yo life\nSo don't be starting\nYou wake with fullies strapped at your bed side\nChiddy-chiddy bang bang, nothing but that Garden gang\nWho ride, and ? old records. Get your face re-arranged\nCuz on my block, 24-7 fools be poppin they Glocks\nIn the strip, poppin they clip\nPuttin in work, letting it rip\nAs they keep fallin\nThe day we spend it cuz g's be keep ballin\nNo time for stallin\nA .30 round clip and the shots I'm callin\nCuz in this game, when you livin it strange aim for the brain\nIt's all for one and one for all cuz in the game only one gangst'\nProceed with caution\nUz like ho suckas, I be tossin\nDead bodies are bridges\nOne to the head, then broke out in ditches\nBefore you step to the psycopath lunatic\nH ave yo gat in yo hand and ready for the 187 dance!\n\n[Hook]\n\"187 don't stop\" - [Dr. Dre]\n\"Cuz it's 187\" - [Snoop Dogg]\nC-Bo: So listen up for the cock\n*gun cocked*\n\n\"187 don't stop\" - [Dr. Dre]\n\"Cuz it's 187\" - [Snoop Dogg]\n*gun cocked*\nC-Bo: So listen up for the cock\n\n[Verse 2: C-Bo]\nI woke in the morning with a .9 to my head\nThinking that I'm dead\nSurprised to see the task and the damn feds\nI knew it was over\nBo Loc done got struck in the game\nPo-po's got me face down on the bed by a big bag of 'caine\nAnd I'm thinkin in my head 'I just left Y.A.'\nNow I'm on my way to the penitentiary for a yola case\nDamn I'm struck like the ? that's all I can say\nCuz I be countin down from 20 years, every 365 days\nIn the game when you stuck, you stuck up the river with bad luck\nWhere suckas be getting that ass tucked\nIt's off the ? and off the buck\nAnd I believe in eight millions of ways to die\nCuz if you Black and believe in gettin licked\nThen you believe in getting fried\nSnatched from floor by officer Town's and one of his punk boys?\nGot crack in my pockets, 1700, the canines got me 'noid\nBut I play dumb. Bo Loc got that G composure\nLast night's \"hit it for 10, hold it for 20\" game still got me doja\nAnd I'm thinkin 'this just a dank game nightmare'\nShotguns and Glocks and I can see the siren lights glare\nThen out the do' on my - face\nHands cuffed tightly behind my back and they still doin me like a slave\nCan't fight back cuz I'm shackled\nFrom my wrist to my ankles and now these pigs wanna wrestle\nThey drug me down to the county\nTook three Gs out my pocket and beat me down to the ground\nG, the stuff got hectic\nGetting triple-teamed by three punk white detectives\nIm coughing up blood, holdin on my ribs\nFor every hit I'm thinkin bout killin all they kids\nOne kicked and missed, slipped in my blood\nI made a G-move\nSo ??? Went for his holster, itchin to get my blast on\nI'd rather be dead than tanked up, gettin stomped on\n187 dance on these punk suckas\nTry to take ya boy out the game like a busta\nNow they know what it's like gettin with a psycho\nWith the Garden Blocks it's all about survival (echoed)\n\n[Outro]\n\"187 don't stop\" - [Dr. Dre], \"Cuz it's 187\" - [Snoop Dogg]\n{*gun cocked*} [C-Bo] So be prepared with a cop\n\"187 don't stop\" - [Dr. Dre], \"Cuz it's 187\" - [Snoop Dogg]\n{*gun cocked*} [C-Bo] Watch ya back when it cock\n\"187 don't stop\" - [Dr. Dre], \"Cuz it's 187\" - [Snoop Dogg]\n{*gun cocked*} [C-Bo] So let me catch ya on my block\n\"187 don't stop\" - [Dr. Dre], \"Cuz it's 187\" - [Snoop Dogg]\n{*gun cocked*} [C-Bo] Be prepared with a cop\n\n{*repeat Outro to fade*}"}]}