{"artist": "Pouya", "songs": [{"album": "South Side Slugs", "title": "Father Of Contention", "image": "https://images.genius.com/7fb8bfc4978c7618e15a2f630f97b65c.500x500x1.jpg", "lyrics": "[Verse 1]\n[?] where you at? I need your help\nI can't deal, with some of these suckers by myself\nLet me know, is you with me or not?\n\"Pop pop\" goes the Glock, come and get it while it's hot\nShe down for the cuff, she do what I say\nMove when I say to, poppin' that pussy, doin' tricks\nThat really would amaze you (Yup)\n'Cause I'da came up without a record here to claim to, you bitch\nPull up to the scene with my middle finger bashing\nYes, I know that that's your pumpkin, do you know that I been smashing\nWith a band of homies, did so much, digging the cuts to get the front\nOr maybe buy my kidney, homie, miss me with that fuck shit\nPull up to the function, hit the stage and get it jumpin'\nRun upon me, get to gushin', I ain't never been a hoe\nRunnin' around with plus fours, so\nMake a move, I'm the one you gotta cater to, bitch\n\n[Hook]\n\"Pop pop\" goes the Glock, come and get it while it's hot\n\"Pop pop\" goes the Glock, come and get it while it's hot\n\nPop pop (yup)\nPop pop (yup)\nPop pop (come and get it while it's hot)\nPop pop (come and get it while it's hot)\nPop pop (yup)\nPop pop (yup)\nPop pop (come and get it while it's hot)\nPop pop (come and get it while it's hot)\n\n[Verse 2]\nIn front of my face, you a friend to me\nBehind my back, you really envy me\nSo to me you just an enemy\nPop that clip, but you [?]\nSo many places that I'd rather be\nBut I'm in the studio, just tryna make my paper stack\nB.E.T. that your bitch, gon' thow it back\nIf I ask her to, I don't got a answer to\nWhy she feel in love with me, guess she love my attitude\nI just do what I do 'cause I love it, I can't fuck with none of you rappers\nI'm 'bout to fire off on 'em like I'm NASA\nTrust me, lil' homie, I will turn into a bastard\nLay your old, dirty ass on the floor like a mattress\nWho the fuck you think you fuckin' with?\nStill sleepin' on me, I'm so sick and tired of it\nI'm feelin like the underground underdog\nI been on the runway for a minute, now I'm taking off\nNut sack for the bitches who been [?]\nAnd the haters that don't wanna see my money talk\nYou ain't talkin' about no check, then I won't answer your call\nUnless you callin' with a bitch that wanna pop that pussy slow\nJust for me, and the homies\nOr maybe everyone who know me\nBitch, show me what you workin' with\nAll them tricks that you been learning, bitch", "year": "2015-03-25"}]}