{"artist": "Porta", "songs": [{"album": "Reset", "title": "Carta de libertad", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "Desestimados señores de Universal\nVuestras cláusulas no clausuran ni censuran mi rap\nYo se que recordáis mi toma, mi contacto\nHice bien, no me fié de vosotros\nAsí que os rechacé en el acto\n\nAunque Soma me convenció\nAsí consiguió que os escuchara\nY realmente que más daba si mi música no cambiaba\nY claro, sacaríais provecho y yo también\nY en concreto se que siempre visteis en mí una especia de Eminem\n\nEn mi contrato lo artístico era intocable\nNo quería ganar ni perder, sólo hacer todo bien sin arruinarme\nAsí de simple, cada sample que pedía conseguido\nComo de Porta por todas partes sólo para cansarte el oído\n\nUn disco de oro en LP Lebuque muy pocos lo consiguen\nAunque no estaba contento con los medios que me exhiben\nDije \"Basta, lo de menos es la pasta\"\nFrene en la autopista, no podéis manipularme como a otros artistas\nY ya esta\n\nAunque sea joven no os equivoquéis\nYo no soy del típico men al que le robéis\nQueríais mis maquetas a cambio de 40.000 euros\nPero están en Internet, claro y esas no las vendo\n\nAl principio en cada reunión el director está presente\nDiciendo \"Eres el mejor\" por hacerme sentir diferente o especial\nCon cada artista sois igual, lo se\nQue nos coméis la oreja a todos sólo por vuestro propio interés\n\nAunque del primer LP no hay quejas apenas\nSi siempre hiciereis vuestro trabajo\nEse fajo que esperéis llega\nReconozco pasotismo con promos pa' quinceañeras, por mi parte\nY desde entonces nunca nada fue como era\n\n(Coro)\nDedicatoria especial para esa multinacional\nQue sé que aprovecha los sueños\nY el talento musical con un fin comercial y punto\nArriba esa moral. Quiero que gritemos todos juntos:\n¡PUTO UNIVERSAL! (x2)\n\nEn el segundo empieza la presión\nQuisisteis cambiar mi música y que hiciera alguna colaboración\nDe peso y de otro estilo musical y eso\nY todo solo dependerá de mi elección ¿Verdad Universal?\n\nLe faltaba un toque instrumental según vuestro criterio\nEsto es rap, no pop, me niego a sonar comercial, me pongo serio\nMe da igual que me dejéis sin medios\nVuestra baza es amenazar y no me dais ningún miedo\n\nDijisteis que es otro disco más de rap del montón\n\"Veremos que podemos hacer en cuánto a la promoción\"\nPor eso mi segundo LP pasó desapercibido\nY yo seguí sin vuestro apoyo y más de quince mil vendidos\n\nNo había ficha fijante ni polémica en trastorno bipolar\nYo bipolar, mi rap mi fama al otro lao' del mar\nTuve la oportunidad de cruzarlo fue por vosotros\nTras llenar el Luna Park se os volvió a iluminar el rostro\n\nY todo sin un disco editado en latinoamérica\nTodo sostenible con una cifra numérica\nNo somos personas, solo somos porcentaje\nIr a colaje, que sólo mimáis mas al que más funciona\n\nFaltan respeto por un género que no entendéis\nInformaros un poco más de ese producto que vendéis\nSolo os aconsejo, se de lejos que os arruinaréis\nEspero ese momento con ansias, es lo que os merecéis\n\nLlevo ya tiempo pidiendo mi carta de libertad\nPero parece que el negocio de los discos va mal\nY allí entraba muy fuerte en la red, y un buen marketing viral\nPara estafar a vuestros clientes en formato digital\n\n(Coro)\nDedicatoria especial para esa multinacional\nQue sé que aprovecha los sueños\nY el talento musical con un fin comercial y punto\nArriba esa moral. Quiero que gritemos todos juntos:\n¡PUTO UNIVERSAL! (x2)\n\nY el tercero ya lo veis, no digáis que no avisé\nEs mi Reset con un buen par de os plantos de LP\nY sin depender de vender desde la mierda de compañía\nQue me prometía el mundo, pero nunca lo cumplía\n\nPor eso lo he sacao' tan tarde, así que disculpadme\nY no es por excusarme, pero su trato era inaceptable\nLo he vivido desde dentro y se como funciona, artista\nYo hago rap de sentimiento, no pa' que se baile en pistas\n\nHay mil maqueteros con mas videoclips que yo\nComo expresarlo, es sencillamente ridículo\nSe lo que ha pasado, desde el principio he luchado\nPorque yo no soy el típico que pasa por el aro\n\nNo voy por lo legal\nAunque os podría demandar por incumplir contrato\nYa me sale innato, Puto universal\nOs lo digo cordialmente, no lo olvidéis nunca\nCon cariño, Porta, atentamente\n\n(Coro)\nDedicatoria especial para esa multinacional\nQue sé que aprovecha los sueños\nY el talento musical con un fin comercial y punto\nArriba esa moral. Quiero que gritemos todos juntos:\n¡PUTO UNIVERSAL! (x2)", "year": "2012-05-07"}]}