{"songs": [{"year": null, "image": "https://images.genius.com/cc562c0aa5b047df2132b1557d8efb9a.464x464x1.jpg", "title": "Hip Hop Nation Sirius XM Freestyle", "album": null, "lyrics": "[Verse 1: Black Thought]\nUh, 215, yeah aight listen:\nUp steps the one and only in the flesh\nSenegalese, Sierra Leonian fresh to death\nBig homie and them reps the best\nKnew you knew me from somewhere\nI get wrecked with Questlover\nThe brother get it on, bring a song\nMore brutal than Genghis Khan\nWhose name ring alarms to fakes\nYou couldn't place but know I'm the truth\nThat's before you recognize it's the one from The Roots\nArmed to the tooth, trying got take an eye for another eye\nI'm from \"we hear gunfire for a lullaby\"\nYo forget it, who the hell am I?\nYo I'm the reason these MC's lives became nullified\nThe stuff of legend, so tell me what's tougher brethren\nWell I'm the blast form the past that started the present\nVision of the future: me and the super producer\nAnd I'm ten times as smart as I'm used to being\nI'm still seeing the voice through the speakers\nPorsche two seaters, Jimmy Choo sneakers\nReal rap remedy man, a true genius\nI brought Yosemite Sam two heaters\nAsking these bastards if it's any last word\nBesides \"what\", \"when\", \"why\" and all them adverbs\nYou bout to be the next fugitive captured\nJust keep thinking you can lie and live after\nSlow your roll playboy, rabbit ears\nCause damn right it's on sight like Vladimir\nAnd by the moment of time, you will be out of here\nScrap, get slapped for acting so cavalier\nI'm from Philly and them cabbers don't travel there\nBrothers let the heat rattle there\nThey don't battle there\nItching to leave you in the pool like Mike Phelps\nLearning to fight might help, but that's light help\nCause the bullets make flak melt\nThen just imagine what it'd do to you, even if you a black belt\nAyo my brother still concealing with a gat held\nOn a block where there used to be a lot of crack dealt\nLo and behold, this is information overload\nI put the crowd in a trance like Paul Oakenfold\nI used to be the lowest on the totem pole\nUntil I reconstructed my goals, left a broken mold\nSetting sights on the open road\nI hit them anywhere and everywhere the realness is bought and sold\nAyo they got me on the honor role\nThat mean, whenever speaking my name\nBegin that with \"The Honorable\"\nT-A-R one I like a monocle\nI bring the riot to a laugh, cause you comical\nLook, get in that ass like your father do\nHit that catatonic chronic out in Bonnaroo\nI'm psychological, jump like Geronimo\nProbably get yourself knocked down like a domino\nWhoa, if I don't work, then I won't eat\nNo, I don't Facebook, but I might Tweet\nThe industry is out of control like OC\nSo take this L on the chin like it's a goatee\nI'm kinda like a cellar door, lowkey\nI used to mix bottles of champagne with OE\nI'm Aristotle, I can't fail, I'm OG\nI came through to get free like no fee\nAyo they got me on the pedestal, trophy\nGot them singing \"Damn 'Riq cheating like adultery!\"\nSycamore, sitting on paper like upholstery\nNoam Chomsky, I'm on an organized rhyme spree\nMessing with this is borderline robbery\nAnd that's what it is, i'm jimbrowski\nCertain circles call me the Big Lebowski\nIt would behoove you to find out about me\n\n[Outro]\n\nAgh, ahhhh [claps] Whoa hohoho\nYou whack rappers better step your game up!\nWow, give it up for Black Thought, one of the greatest of all time!\nMan, man, man, man! Man dude...\nI don't know if any dude got anymore lyrics than this dude right here\nThe Roots are here, we celebrating the release of their new album \"...and then you shoot your cousin\""}], "artist": "Black Thought"}