{"songs": [{"image": "https://images.genius.com/8f5b760f528f0361bf1c6b0d156d6e18.720x720x1.jpg", "title": "Don’t Body Ya Self (MC Burial)", "album": null, "year": null, "lyrics": "[Intro]\nHope y'all make it through the storm\nYou know what though, I love the rain man\nA lot of you cats are runnin' your mouths (hahaha)\nYour runnin' your mouths crazy\nThink y'all got to ease up though, you know\nEase up 'fore somethin' happen man\nWe don't want that, at least you don't\nBe easy man, tell you how it feels to be on top of the world\nBut y'all niggas better take it slow\nDon't body ya self\nDon't body ya self\nYeah, don't body ya self nigga\n\n[Verse 1]\nYeah, yeah\nEverybody get low niggas\nDedicated to the fuck Nas coalition\nTouch my dough, I'm lettin' .40 cals blow, nigga\nNot cows with four legs\nBut cals with more lead\nThat add up more dead\nIt's on nigga, I'ma bury 'em\nNiggas don't want beef they vegetarian\nScared of pussy you climbed out a caesarean (woo!)\nI push ya grown ass back in your mother's womb\nYou need 9 more months\nYour crews 9 more punks\nYou rhyme on stuff and claim I ain't sign y'all up\nIf I sign y'all I'm on dust\nYeah we from the same hood but nigga WHAT?!\nWhen y'all was tryna rap y'all was makin' me proud\nMan now you fucked up down on your luck, runnin' your mouth man\nWhy don't be a real man, say you need a little help\nAnd I might help your ass off the shelf\nBut no, you're bein' disrespectful\nThinkin' son so cool that he won't check you\nStand down, the king is home\nQueens' own, NASDAQ, Dow Jones\n\n[Break]\nDon't body ya self\nCrazy\nTake it slow man\nSlow down (yeah)\nTake it slow motherfucker\nDon't body ya self\nLet's listen\nLet's just listen\nDon't body ya self\nListen\nSlow down though man\nSlow down\nY'all gotta take it slow\n\n[Verse 2]\nI am De Niro after Am.Ex. commercials and The Fockers\nWith Martin Scorsese after Gangs of New York could rock this\nBack together with the master plan\nThe rebirth of Langston Hughes, I'm that man\nI'm in the streets like old graffiti\nI'm hearin' wankstas talkin' greasy\nWhether broke or rich my friend\nNasir bring that career to an end\nAnd I'm bored with you MCs B\nY'all beneath me\nAnd my raps bring horror like a board of Ouija\nOf course I'm the king, get my shine on\nAnd I blind y'all 'cause they call me The Lord of the Rings\nPinky heavy man, big stones in the wedding ban'\nSmell of brimstone back from Hell again\nNext verse gets worse from God's son to Devil sent\n\n[Break]\nY'all need to take it slow\nDon't body ya self\nMotherfucker act like ya know ('05)\nMotherfucker better take it slow\nDon't body ya self\n\n[Verse 3]\nThey say Jada defeated him\nJoe too street for him\nWhat's next? I guess it's for Nas to Ether him\nY'all awaiting an MC burial\nThis is ethereal, FM stereo to XM radio\nWhat does it mean, ethereal? Hmm.. either heavenly or spiritual\nExtreme, delicately light in a way that seems too perfect for this world\nMan that is righteous, faithful and keeps law\nWill surely live declares the sovereign Lord\nAnd you are none of the above\nSo you a sucka for death, if I'm a sucka for love\nAnd y'all wanna know why I don't gotta answer niggas\n'Cause I truly understand these niggas\nScared of me so they talk about family members\nLike I can't point out your grandma to niggas\nDamn you was my man like crew, dog\nDon't make me change your body frame to blue fog\nThe Q is the borough of true Dons\nAny disrespect nigga we choose arms\nWill it be Gilmore or Crowe's?\nNigga act like ya know\n\n[Outro]\nYeah\nY'all better take it slow\nMotherfucker act like ya know\nMess around and body ya self man\nDon't body ya self"}], "artist": "Nas"}