{"songs": [{"lyrics": "[Intro: Jay-Z & (Funkmaster Flex)]\nI been crushing the building since Izod socks\nI'm so independent, sh..I might buy Koch\nI might not stop\nPlaces to cop, seventy-six floors, you can call me the Doc|\nSay when, say when\n(When!)\n\n[Verse 1: Jay-Z]\nInspired by Basquiat, my chariot's on fire\nEverybody took shots, hit my body up, I'm tired\nBuild me up, break me down to build me up again\nThey like: \"Hov, we need you back so we can kill your ass again\"\nHov got flow though he's no Big and Pac, but he's close\nHow I'm 'posed to win, they got me fightin' ghosts\nSame sword they knight you they gon' good night you with\nSh.., Thats' only half if they like you\nThat ain't even the half what they might do\nDon't believe me, ask Michael\nSee Martin, see Malcolm\nYou see Biggie, see Pac, see success and its outcome\nSee Jesus, see Judas; see Caesar, see Brutus\nSee success is like suicide\nSuicide, it's a suicide\nIf you succeed, prepare to be crucified\nMedia meddles, niggas sue you, you settle\nEvery step you take, they remind you you ghetto\nSo it's tough bein' Bobby Brown\nTo be Bobby then, you gotta be Bobby now\nNow the question is, is to have had and lost\nBetter than not having at [all]\n\n[Verse 2: Jay-Z]\nEverybody wanna be the King then shots ring\nYou layin' on your balcony with holes in your dream\nOr you Malcolm X'd out, get distracted by screams\nEverybody get your hand off my jeans\nEverybody look at you strange, say you changed\nUhh! Like you work that hard to stay the same\nUhh! Game stays the same, the name changes\nSo its best for those to not overdose on being famous\nMost kings get driven so insane\nThat they try to hit the same vein that Kurt Cobain did\nNo dangers, so shameless\nInvited to the inner sanctum of your chambers\nLow chain 'em as the enemies approach\nSo raise your draw bridge and drown them in the moat\nAnd the Spirit I'm evoking\nHold on\n\n[Verse 3: Jay-Z]\nEverybody screaming they want the old Hov\nBut the new improved Hov hit like Albert Pujols\nEverybody wanna hear me talk that money like Phil Rizzuto\nBut my mind is on Pluto\nBills that I do fold, I now invest on\nTrying to find some loopholes in the IRS\nAs where I used to have a few hoes I am just\nConcentrating on making a new Hov through sex\nI've awakened just in time to school those putos\nTrying to follow in my shoes with jewels froze\nBetter adhere to this text 'fore you go\nBroke, spending more than you've accrued on silly baguettes\nI know silly begets silly you'll learn on your own\nAt least my conscience is clear, I'm no longer steering you wrong\nAin't nothing wrong with baguettes after you get a home\nTake care of your home, you can go back and—ugh!\n\n[Verse 4: Jay-Z]\nI'm getting courted by the bosses\nThe Edgars And Doug Morris-es-es\nJimmy I's and Lyors-es -- it's\nGotta be more than the choruses\nThey respecting my mind now\nJust a matter of time now\nOperation: Takeover Corporate\nMakeover offices-es-es then takeover all of it\nPlease may these words be recorded\nTo serve as testimony that I saw it all before it\nCame to fruition, sort of a premonition\nUncontrollable hustler's ambition\nAlias Superstition, like Stevie\nThe writing's on the wall like my lady, right baby?\nSaw it all before, some of y'all thought I was crazy, maybe\nLike a fox, I'm cagey, ah-ah\nThe more successful, the more stressful\nThe more and more I transform to Gordon Gekko\nIn the race to a billion got my face to the ceiling\nGot my knees on the floor please Lord forgive him\nHas he lost his religion, is the greed gon' get him?\nHe's having heaven on earth, will his wings still fit him?\nI got the Forbes on my living room floor\nAnd I'm still talking to the poor, nigga I want more\nTIME's most influential, was impressive\n'Specially since I wasn't in the artist section\nHad me with the builders and the titans\nHad me right with Rupert Murdoch\nBillionaire boys and some dudes you never heard of\nWord up on Madison Ave is I'm a cash cow\nWord down on Wall Street, homie, you get the cash out\nIPO Hov, no need for reverse merger\nThe boy money talk no need to converse further\nThe baby blue Maybach like I own Gerber\nBoardroom I'm lifting ya skirt up", "title": "“Grammy Family” Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": "2006-10-30", "album": null}], "artist": "JAY-Z"}