{"songs": [{"image": "https://images.genius.com/294a7b3b0009e710be0cc01db8c6fa70.874x874x1.jpg", "title": "Don’t Forget Us", "album": null, "year": "2013-10-07", "lyrics": "[Hook: Dom Kennedy]\nI’m just sitting 'round here smoking weed with my niggas\nI just hope when we gone that they don’t forget us (x2)\n\n[Verse 1: Nipsey Hussle]\nLook\nWe just sitting here tryna win\nPull up to the spot, it’s a flock of Benz\nSo much smoke need oxygen,\nRe-up money, that’s not to spend\nAll gold bottles at Toxic and\nStanding on the couch, me and my accomplices\nPop a bottle, spot the bitch; get the bitch, got the bitch\nStreets wanna know 'when you droppin' Nip?'\nPolice wanna know how you got your Six?\nNiggas on the side hate to watch the shit\nSee you on top, so they throw rocks and shit\nNever really was with the talking shit\nMe, I just went and got a pot to piss\nUpgrade diamonds on my watch and shit\nPictures on the wall at the offices\nAC colder than my Compton bitch\nTalking that “You don’t even need a condom” shit\nLook, I’m really on some baller shit\nOn some rich nigga, I ain't gotta call you shit\nOn some, fuck with me if you loyal shit\nEverybody in my circle get spoiled shit\nReally started in the soil shit\nCrowns on the wrist, that’s royal shit\n\n[Hook] x2\n\n[Verse 2: Nipsey Hussle]\nLook\nWe just sitting here tryna win\nDrop 20 bands, you can fly us in\nTurned down deals, they gon' try again\nWe need a partnership, it ain't no signing him\nYou don’t see the type of cars we in?\nYou don’t see the shows and the lines for them?\nYou don’t know the spots we residing in\nNigga we straight with dough ain't no enticing him\nLook at my life my friend, I got the right to win\nI put the grinding in\nEven on them nights when the lights was dim\nWhen my hope was low, I found light within\nI know it’s ups and downs\nSo every loss I took, I knew to strike again\nAnd I be saying a lot, that’s a priceless gem\nAnd if we living in hell, is it alright to sin?\nI had a goal to chase, a life to live\nI tried to wash my hands, pulled me right back in\n\n[Hook] x2"}], "artist": "Nipsey Hussle"}