{"artist": "Drake", "songs": [{"year": "2009-09-01", "album": null, "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg", "title": "Between Us", "lyrics": "[Verse 1: Drake]\n\nOkay I just got back from another label meeting and\nI ain't what they looking for I ain't what they looking for\nI ain't really Atlanta I ain't really Brooklyn or\nI dont fit the appeal for them shows that they could book him for\nStraight nigga tryna get in through a crooked door\nBarely fittin in cuz a gimmicks what they took him for\nBut getting doubted caused me to reroute it\nTo another destination where the people they abouuut ittt!\nYou ever felt high above it all?\nRun your fingers through the clouds like the sky about to fall?\nTreat me like I'm rich when I'm about ball\nAnd think once about the clothing that I buy up out the Mall\nI'm famous so I get approached fast, Louie and Coach bags\nAll up in coach class, gem like Topaz, cool like slow Jazz\nDope like coke lines and crack like broke glass\nI promise this is me, me\n\n[Hook: Drake & Slakah The Beatchild]\n\nI'm not supposed to do this\nI'm supposed to be this nigga thats rapping bout gettin money\nAnd you herd all of my songs so you know this shit wrong\nPlease do me a favor and keep it between me and you\n\n[Bridge: Slakah The Beatchild]\n\nYou, you, you, you, you\nYou, you, you, you, you\n\n[Verse 2: Drake]\n\nYea\nOk, I'm floating in my zone without a scheduled descend\nThe rising and the fall was never my intent\nI want this shit forever printed in cement\nAnd if I ever sin I promise to repent\nI'm only tryin to win I ain't tryna present\nYou gotta listen close like it's coming through the vent\nThese rappers can't see me I live behind the tint\nAnd just to get a visual them niggas gotta squint\nThere I ammmm\nLittle me in row 23F real reconize real is there none of yall left?\nEverybody in the game can't none of yall ref?\nAnd filter out the bullshit the fuck is yall def?\nYou'r now tuned in to the new comer of this summer\nThe Chris Paul of this fall exist yall - Yea\nAnd is the realist nigga still I?!\nA bitch could love you to death and you still die\nAhhh!\n\n[Hook: Drake & Slakah The Beatchild]\n\nI'm not supposed to do this\nI'm supposed to be this nigga thats rapping bout gettin money\nAnd you herd all of my songs so you know this shit is wrong\nPlease do me a favor and keep it between me and you\n\n[Bridge: Slakah The Beatchild]\n\nYou, you, you, you\nYou, you, you, you\nYou, you, you, you\nYou, you, you, you\nJust keep it between me and you\nYou, you, you, you\nYou, you, you, you\n\n[Outro: Drake]\n\n(Crowd Clapping and Applause)\nYea\nWhats goin on yall?\nI wanna thank yall for coming out tonight\nI go by the name of Drake\nI got my man Slakah The Beatchild here\nMy man Hazel\nYou already know we about to rock tonight\nSo if you with me clap ya hands\nI'm about to tell you a secret, as long as you can keep it\nBetween me and you"}]}