{"artist": "Angel Haze", "songs": [{"title": "Black Skinhead", "image": "https://images.genius.com/aa5b5816720a0a0dfca1fbb1ffbd1b8a.475x475x1.jpg", "album": "#30GOLD", "lyrics": "(Verse)\nBack in the booth and I'm bout to attack\nNothing but Jesus was holding me back\nAll of you bitches been lyin on tracks\nAnd I'm modest but right now its time after that\nWho are these bitches? They wastin my time\nDoing nothing constructive, they wasting the grind\nI'm exposing you frauds because i feel its time\nThen I'm peelin' your skin back and chewing the rhind\nEveryone know ain't no stoppin my shine\nPunchlines that feel like a blow to the spine\nCame from the dirt, from the bottom i climbed\nAnd i climbed up that bitch till im outta my mind\nCall myself Angel 'cus that be the goal\nStay draped in black cause it matches my soul\nSwear i be rhamses way I'm wrapped in gold\nVersace, Versace, you already know\nI haven't opened my mouth in some months\nI just sat back and kept watchin you front\nI just sat back and kept letting you stuck\nBut that silence was silently callin your bluff\n\n(Hook)\nWhy you still going? You still boring\nZz Zz Zz I'm still snoring\nThis morning I woke up with a foreign\nThing that can only be seen when I'm touring\nBaby I swear I'm the best bitch who doin it\nFuck all the critics, they blind and too stupid\nAll of this vision of mine is so lucid\nAll of this passion I got is so ruthless\nThat all of you bitches are now rendered useless\nYeah you're now rendered useless\n\n(Verse)\nCry for competition\nOr just different people who make better music\nAnd that's just in general\nSaid that's just in general\nI'mma fuckin straight shooter\nThis shit ain't no beef and I don't do subliminals\n(GOD)\n\n(Hook)\nWhy you still going? You still boring\nZz Zz Zz I'm still snoring\nThis morning I woke up with a foreign\nThing that can only be seen when I'm touring\nBaby I swear I'm the best but you doin it\nFuck all the critics, they blind and too stupid\nAll of this vision of mine is so lucid\nAll of this passion I got is so ruthless\nThat all of you bitches are now rendered useless\nYeah you're now rendered useless\nDirty Gold  bitch", "year": null}]}