{"songs": [{"year": null, "image": "https://images.genius.com/d530c52ed07699f53b2c873775b96848.500x500x1.jpg", "title": "Beauty (You Just A Rose)", "album": "Speaking in Tongues", "lyrics": "[Intro]\n{*paper crinkling*} What is this?\nThis was written for you?\nYou want me to say this?\nYes, I want you to say this\nStay out of the wonderland baby\n\n[Bizzy Bone]\nRebuke murder for me; lust, wrath and sloth\nGreed, gluttony, envy and the pride of the thought\nI'ma tell you smite that servant, kamikaze no curtains\nSlice through the smoke of the mirrors, imperfect\nImpervious to danger, fear God, the beginning of wisdom\nEnter to the kingdom, would you listen?\nI miss you most definitely, spit knowledge, smell my breath\nRighteous watchin the way, memory step, whoa!\nPay attention to the street signs\nI ain't leave yet; never will, love all\nHeavenly Father in the name of our Lord and Savior, Jesus Christ y'all\nStick with the fight y'all\nSpiritual physical shit, c'mon fade that\nFeel me though\n\n[Chorus]\nNo they don't hear me though, shake y'all\nHow could I fake y'all? Never break y'all\nMisfit maneuverin, tryin to take y'all\nPlead, excuse me?\nThey don't hear me though, shake y'all\nHow could I break y'all?\nHow could I take y'all, misuse, fake y'all?\nSplit serious please, they don't even know me!\nFlash in the flask\nThey don't even know me\nIt coulda been flash in the flask\nThey don't even know me young homie\n\n[Bizzy Bone]\nIt coulda been the flash in the flask in the dash and the cash\nAnd the mask of different madman, flip blast\nIn the glass of vision, precision to, get past on the map\nVery bad vocal from every paragraph\nBlast about bad ass, booty and task\nRat-a-tat-tat-tat, mash on wicked minded and smash\nWhat's nasty? Who the fuck ya talkin ta?\nTake off my shirt, quickly tell 'em harkin up\nSave last days c'mon, show 'em what we workin with\nWe praise God, Jesus Christ, most certainly\nBaby, baby, world so crazy\nKinda hazy on them sucka, very wary time when I say\n\n[Chorus]\nMan, they don't hear me though shake y'all, break y'all\nHow could I fake y'all, take y'all\nManeuver, try to take y'all\nMan please! They don't know me!\nThey don't hear me though, shake y'all\nHow could I fake y'all, break y'all, take y'all\nPlease! They don't know me!\n... For the, rest of my life\nThey don't know me\nFor the rest of my life, my soul\nThey don't know me\n\n[Bizzy Bone]\nFor the, rest of my life the soul and spirit are priceless\nI'd rather be iceless than to get played twice\nGive 'em tussin homeboys in red, throwin up thrices\nPeek deep inside the 4-4, and you can see rice\nLike it or not, find it or not, I'm feelin Tyson\nFuck that sick round, missionary shit now\nLicensed to pulverize, premise is capital\nAnd the capo go fast in the battle\nAs they rattle an awful judgment, who the fuck you judgin?\nLittle grudges is so sledged in the murder while we walk in the dirt\nTryin to cure my little spirit, turn me over my lil' soldier\nAnd they lookin at me tryin to keep me hurt\nFeelin the pain huh, gain huh, plain huh\nThrow up the one, stay the same huh\nRain come harder, call us homies huh\nFootprints, mop, dust, turn the pallet\nPower come quick fast, watch yo' ass\nHand on the hourglass, power be the God\nGuess that, press that, full court with a fine ass wall\nThe sin it be the biggest, let's get spiritual\nWe're off into the light, when it's our gaaaaame\nWe flip pages, how we rock the ages, the kid is so amazin\nBut they don't feel me though\nThey don't hear me though, shake y'all\n\n[Chorus/Outro]\nThey don't hear me though, shake y'all\nHow could I break y'all, take y'all, fake y'all\nManeuver man... I say they don't know me\nThey don't hear me though, shake y'all\nFake y'all, break y'all\nHow could I maneuver and then take y'all\nThey don't know me, they don't know me\nThey don't know me, they don't know me\nEvidently they don't know me\nHow could I fake y'all, shake y'all, break y'all?\nThey don't know me... heheh"}], "artist": "Bizzy Bone"}