{"songs": [{"title": "Sun Tzu", "lyrics": "[Intro]\nAny which way some of you want to come through\nI’m ready for you like Sun Tzu\nReady for you like Sun Tzu\nReady for you like Sun Tzu\nAny which way some of you want to come through\nI’m ready for you like Sun Tzu\nReady for you like Sun Tzu\nReady for you like Sun Tzu\n\n[Verse 1]\nThe art of fighting without fighting\nOr fighting when you need to\nIt's appealing, we're peaceful but demons if we need to\nEqual whatever you bring we'll meet you\nThis sport is a war with a discourse\nWhich thoroughbred horse make it through this course?\nWhich emcee shall I chew up for this course?\nSame energy known for the sick tours\nNo hype man, breath control\nRecord a track I do the same thing live\nCan't do that? Ah bless your soul\nYou ain’t ready for the Shaolin vibes\nWake up when it’s still dark in the sky\nWith the heart for the grind and an art full of rhymes\nAnd the sharpest of lines and a spark of the mind\nSo bright that I’m leaving them partially blind\n\n[Refrain]\nAny which way some of you want to come through\nI’m ready for you like Sun Tzu\nReady for you like Sun Tzu\nReady for you like Sun Tzu\nAny which way some of you want to come through\nI’m ready for you like Sun Tzu\nReady for you like Sun Tzu\nReady for you like Sun Tzu\n\n[Hook: Asheber]\nDon’t be foolish\nWhat you want to test I for?\nI’m a man on a mission\nDon’t let I catch you slipping\nIt’s no competition\nI’ve been studying the art of war\n\n[Verse 2]\nIt’s the hardest of times we’re living in, isn’t it?\nSo why ain’t you disciplined just a little bit?\nLittle git, wanna throw a little hissy fit?\nHere’s a question, tell me can you riddle it?\nDoes it take effort to make yourself really shit?\nOr is that your best that you’re giving it?\nNah, it can’t be\nWell, rhyming just ain’t for everyone\nNow every little son of a gun seems to think\nFrom the moment they come out their mum they are the one\nWithout ever having what it takes to become\nTen lifetimes ain’t enough\nI was a griot, I was a Sufi\nI was a Mayan priest but not in the movies\nI was a druid pouring out fluid\nBlessing the ancestors cos we come through them\nHundred more times I was born before\nBefore The Windrush came and Britain forever changed\nEnergy and memory it remains\nIn my veins and it don’t take much to reclaim\nAll I gotta do is say my own name\nAnd the power of Greyskull reigns\nYes, ruthless student, nuisance mutant\nTrains with the Shaolin monks, I’m reclusive\nName is a thousand thumps with a pool stick\nThat reigns on a silly little punk for the bullshit\nGame for a round, punch and we all kick\nElbows, knees, let’s go for the full kit\nTell your G’s I’ll believe that they’re all sick\nWhen I see degrees they achieve, we’re talking\nA school called wisdom, you could go there anywhere\nYet you are never there\n\n[Refrain]\n\n[Hook]\n\n[Verse 3]\nIt’s the art of a warrior, heart of a foreigner\nThat’s living in an all-white town from a toddler\nGraft that your body does half wanna honour us\nBut you've gotta tell them that you’re past wanting followers\nA class for the coroners, who the ras wanna collar us?\nKill rate way past choleras\nLook at all the revellers, look at what a rebel does\nSekkle, metal can’t settle us\nDope, but the CIA can’t peddle us\nNope, we go for the throat what you telling us\nChoke, on the little hope that you’re selling us\nJoke, I take Britain like Severus\nCult, it’s the occult and its elements\nThey wanna reign high but we come to be levelers\nWe know the design and we’re done with the evidence\nGo with the times get bun for the hell of it\n\n[Refrain]\n\n[Hook]", "year": "2015-03-30", "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}