{"songs": [{"album": "Any Given Sunday #1", "year": "2011-07-31", "title": "How High", "image": "https://images.genius.com/d75165afed097efe5c123d56cef54f0a.1000x1000x1.jpg", "lyrics": "[Intro]\nWhat's love\nGot to do, got to do with it? (Yeah)\nI get a lil taste then I’m through with it\nThen I send her right back to you with it (Ha ha), hey, how high?\n(Hey) What's love (How high?)\nGot to do, got to do with it? (How high?)\nI get a lil taste then I’m through with it (How high?)\nYeah, I send her right back to you with it\n\n[Verse 1: J. Cole]\nVisionary, play your position, no missionary\nBut yet I pack Gospel in the quotes I spoke\nYou listening to the most high like the Pope on dope\nNow picture that, my poetry’s deep, now fish for that\nOnly real niggas catch something, phoney niggas fail\nShit you gotta feel like it’s only read in braille\nBoth did the crime but his homie didn’t tell\nSo he fucking bitches while he sitting lonely in a cell\n\"Thinking well, what the hell I been on\nThey gave a nigga five then they threw another ten on\nBy the time I’m back in the streets like a bachelor\nI gotta play the clubs with the old ass women\"\nLife is a movie, pick your own role\nClimb your own ladder or you dig your own hole\nYou sit around crying, that's like sitting round dying\nYou wanna touch the sky? Bitch, you figure out flying\n\n[Chorus]\nNigga, how high? So high that I could touch the sky\nHow sick? So sick that I could fuck yo’ bitch\nNigga please, my squad stack plenty of G’s\nAnd if your girl like to smoke we got plenty of trees\nHow high? So high that I could touch the sky\nHow sick? So sick that I could fuck yo’ bitch\nNigga please, my squad stack plenty of G’s\nAnd if your girl like to smoke we got plenty of trees\n\n[Verse 2]\nHey, as the troubles of the world unfurl\nMy niggas hit the trees like squirrels\nTryna get a nut with your girl, think I need to quit tryin'\n‘Fore some nigga out there try to hit mine\nKarma for the Kama Sutra\nA lot calmer when the ganja’s through ya\nYou need ya armour cause them niggas out here tryna shoot ya\nKinda crucial, police piranha, gon snatch you out that Honda\nFor stashing that marijuana\nYes, ya honour, I feel ashamed\nI broke the law but look I’ll never smoke or steal again\nIn your courtroom wylin’, I don’t mean to keep smiling\nBut right now I’m high enough to probably steal a plane\nMan, just look at me, what if I couldn’t read?\nWould you throw the book at me\nWhat if I’m feeling sad, am I supposed to look happy\nIt’s been a long time coming\nTell my nigga roll me up something\n\n[Chorus]\nNigga how high? so high that I could touch the sky\nHow sick? so sick that I could fuck yo’ bitch\nNigga please, my squad stack plenty of G’s\nAnd if your girl like to smoke we got plenty of trees\n\n[J. Cole ]\nNo I dont smoke, maybe once in a blue\nWhen the tension gets thick then there’s nothing to do\nThrough the windows of my soul, open the blind\nMy eyes get shut but I open my mind\n\nHow high? la la la la\nHow high? hey hey hey\nHow high? yeah yeah yeah yeah\nHow high? la la la la\n\nIs that a shot that you threw little man?\nI understand, you frustrated career ain't going how you planned\nMake it worse, your friends, now when they talk rap\nAll you hear is “J Cole this” and “J Cole that”\nIt must be hard for your pride just to take all that\nI know your weak heart gotta break off that\nBoy, look, Cole World this is your worst fear\nI’m burning you niggas and I’m only in first gear\nI’m serving you niggas this is only the first beer\n12 months from now, you’ll be having the worst year\nNo tears for the haters, I’m still counting money\nCole ain't dropping, thats real fucking funny\nGrade A dummy, sleeping on a nigga raps\nSomething like a mummy\nBut I’mma wake yo’ ass up\nSomething like your mommy on school day\nI smoke two l’s with ya girl this is Cool J\n\nHow high?\nHow high?\nHow high? yeah\nHow high? yeah\n\nWhats love got to do, got to do with it\nI get a little taste then I’m through with it\nYeah I send it right back to you with it"}], "artist": "J. Cole"}