{"songs": [{"image": "https://images.genius.com/fb3501b814f803a5e2e7425bfbfeb8de.480x360x1.jpg", "album": null, "title": "Dear Lily Allen", "lyrics": "[Intro]\nDear Lily Allen\n\n[Verse 1]\nRemember when you pretended, Lily\nThat you were truly independent, Lily?\nFaking like you made it all alone\nBut you were legally with Regal, part of Parlophone\nOh yes\nSo when you lectured me\nI thought I'd fileshare my thoughts on your MP3, Lily\n\nNow first I must sing your praises\nI love your singing but I'll just say this:\nI saw on your MySpace pages\nSaying filesharing's a new ice age, but the\nIndustry's a recent innovation\nMusic's been alive, thriving since cavemen\nFolk songs so long have had a place in\nCommunities that you should be amazed at it\nThen one day came intellectual property\nMeaning if I think a thought, you can't copy me\nAnd if honesty's the best policy\nI'd say songs are better off without this monopoly\nIt'd blatantly be a major fail\nIf they'd patented the major scale\nAnd downloads don't equate to sales\nSo taking them away won't make me pay up\nJust procludes me from sending your tunes\nTo my friends, so we all lose in the end\nYou lose potential fans and we lose\nRespect for the fact that you're desperate for cash\nBut what do you expect from the lass\nWho's collecting a fat bank cheque from the man\nWhile her fans are collecting the glasses\nFor minimum wage they'll spend on her tracks?\n\n[Hook]\nDear Lily, why are you being this silly?\nYours sincerely, Dan Bull\nDear Lily, why are you being this silly?\nYours sincerely, Dan Bull\n\n[Verse 2]\nNow please don't be offended, Lily;\nI think your new CD's splendid, Lily\nEverybody's At It and it's Not Fair\nI Could Say, The Fear was Him but He Wasn't There so\nLet's go Back to the Start, before 22 -\nAll music's in the public domain, so Fuck You\nIt's never the amateurs that's reckon it's damaging us\nIt's the major labels saying it's fatal;\nLike when Napster had to pack up, wrecked by Metallica\nThe table's turned now - the labels churn out\nA new Jezebelinternetelevangelist - and she's fit\nWith a manuscript that was actually written by Mr. Michael Masnick\nCan you get the irony? And by the by, Lily\nI like this beat - I hope you don't mind me thieving\nCause even doing a cover song's decried as stealing\nBut it's alright, still, for you to plagiarise, and preach it -\nDon't you believe it's maybe time to rethink, Lily?\n\nPut music back in the hands of the people;\nMake the majors and amateurs equal\nIf anything, labels strangle the freedom\nYou claim they're saving by banning this evil\nThat's the actual reason, you see;\nAnd please don't compare sharing to stealing -\nI've not took anything off you\nI'm just spreading love for what you do\nDownloaded your songs for free\nThen I bought my mom your CD\nShe likes it too, she keeps telling me\nAll because I pirated an MP3\nNow I've got Matt Bellamy belling me\nTelling me I'm not a fan, I'm the enemy\nThat's amusing, I've paid enough to see Muse in\nMy time I could buy them a museum\nDid you see them on that programme miming?\nYeah, the pirates are killing live gigs\nMaybe we should have a ban CDs appeal -\nThen people would pay to see bands for real\n\n[Hook]\nDear Lily, why are you being this silly?\nYours sincerely, Dan Bull\nDear Lily, why are you being this silly?\nYours sincerely, Dan Bull\nDear Lily, why are you being this silly?\nYours sincerely, Dan Bull\nDear Lily, why are you being this silly?\nYours sincerely, Dan Bull\n\n[Outro]\nAnd I don't mean any offence or anything, Lily\nI just don't think the issue's as clear cut as you're making out\nAnd I know you're going to carry on making music really\nBut when you're between the devil and the deep blue sea\nYou need to stop worrying about pirates, and adjust your sails", "year": "2009-09-25"}], "artist": "Dan Bull"}