{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Intro]\nWe all about them Bills\nWe all about them Bills\n\n[Hook: Cik.Money]\nI'm about my Bills like Stevie Johnson\nAll my women throw it back like I caught an option\nMoney on my mind, money on my conscious\nI'm all about my Bills, I'm on my Stevie Johnson\n\n[Verse 1: Ya Boy]\nBills in my duffle yo, you don't want trouble bro\nHeat in my pocket, heart cold like Buffalo\nI would just hustle one thing, but I need options\nThat work about to touch down, call it Steve Johnson\nCatch me flying through the field like \"Who want beef?\"\nIt's 25 but I could get it for the 1-3\nCertified Fly Guy, you on my time\nI'm really real and you as real as a Sci-fi\nI'm trying to bring it home baby, it's our time\nThey cheering for me like I'm cross the one yard line\nAnd I'm all about my bills like Stevie Johnson\n(Black Card Boys, yes, BCB we poppin')\nGet that dough straight across like I'm running streaks\nMy bills come in hundreds, my women come in threes\nThis hater ran up on Ya Boy like he was furious\nI lifted up my shirt like, \"Why so serious?\"\n\n[Hook]\n\n[Verse 2: Cik.Money]\nShawty got her tights on, her figure awesome\nIm fly to fashion critics like, \"What that cost him?\"\nI'm on my Stevie Johnson, bills like I'm Stevie Johnson\nMeaning I stay with that green like I'm Aaron Rodgers\nMy fitted - Oakland A's, quarter Dodgers\nYour career hanging by a rope, you second string\nI'm in the game, how the hell could you be next to me?\nThey on my swagger safe the series is a pilot\nI'm 'bout my money, no paper trail, don't wire it\nEverything in the streets must be done Wallace\nOver a burn, out in person or a pay phone\nI rep the West like the big homie Dr. Dre doin'\nI'm trying to bring may back like may gone\nMy haters want to see my fall, but I ain't stopin'\nNever came across T.I.P., big things poppin'\nNot just me, my whole team on they Stevie Johnson\n\n[Hook]\n\n[Verse 3: Ya Boy]\nMy main bad, but she twerk clean\nI'm 'bout to score like SJ13\nI don't go to sleep, I go to the bank honey\nSo I don't count sheep, I count money\nDiamond in my face, I like to shine a lot\nCash by the briefcase cuz I rhyme a lot\nI spent $100,000 on this tiny clock\nIce all in the face, who cares about what time I got?\nI go hard for them bills, call me Stevie Johnson\nCheck my garage I got wheels like Stevie Johnson\nBruh, pass it off to me, I'm en route\nYour girl slippin digits to me cuz she think I'm cute\nI hit it five times, and she gets the boot\nI'm on my Stevie Johnson, I got shit to do\nI'm working with a dirty dozen like Charles Bronson\nAnything for them Bills, Stevie Johnson\n\n[Hook]", "title": "Stevie Johnson"}]}