{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Most Wanted (Who They Wanna Kill)", "album": "Vengeance is Mine", "lyrics": "[First Verse]\nOnce again it's that nigga from the deuce four\nFuck the sicc, it's time to get with this hardcore\nIt's Sac-Town's most Wanted, X-muthafuckin'-Raided\nNine one six most playa hated\nRemember Me?  The nigga that brought you Psycho Active\nPut Black Market on the map with that psycho rap shit\nThat was then, and this is now\nDon't take it personal nigga I'm bout my business now\nI thought y'all muthafuckas knew I can't be stopped\nUp in the peneteniary but tapes still drop\nWho woulda thought I'd be back?  Takin' this shit up to another level\nAnd rehabilitated X-Raided the muthafuckin' rebel\nTime to, settle the score like the Fugees\nBitch ass niggas in Sac-Town wanna do me\nBack down true V guns, it's my duty to provide thugs\nShit that makes niggas load up their rugers and ride Cuz\nGet in your hooptie if you from the four\nAnd show these niggas how we represent Garden Blocc, when it's time to roll\nWe put it down, killin' bitches in the drama too\nSpontaneous, never know what the fuck I'm gonna do\nSimulataneously just hittin' spots\nWith miscellaneous weapons they often tend to be double digit Glocks\nYou muthafuckas shoulda known\nYou underestimated X-Raided so now it's on nigga\n\nChorus:\n\nTell me who them muthafuckas wanna kill the most?\nX-Raided loc but they never come close!\nWhy do muthafuckas wanna slow me?\nCuz I put in major work on their homies\n(2x)\n\n[Second Verse]\nI know you niggas thought the Loc was through\nX-Raided can't be underestimated I thought you knew\nNow I'm back up in your ass with some new shit\nI shipped them fake ass niggas and got a new clique\nSac-Town ain't no love lost\nBut hey y'all, now the X is back to fade y'all\nI'm on the cover of Murder Dog with a mean mugg\nAnd I'm at the top of the twenty sack in forty eighty baby\nThat Northern Cali love\nAnd muthafuck what you thought it was\nExtremely wicked niggas call me Nefarious\nWith a reputation for lyrical decapitation\nReputed to be the hardest in town and it's so disputed\nWith a flow like fluid\nI can do it any way I wanna do it\nHit you with a twist or slow it down and hit some G shit\nX-Raided can't be faded, stay in your place\nRecognize game when it's in your face\n\nChorus"}], "artist": "X-Raided"}