{"artist": "Ice Cube", "songs": [{"title": "Alive On Arrival", "lyrics": "[Verse 1]\nDown at the best spot\nIts me and J-Dee and they sellin' more birds than a pet shop\nThe spot's hot, and everybody nervous\nThat's when the blue car surfaced\nOh why did fools have to let loose?\nHeard six pops from a deuce-deuce\nBig Tom had to push us\nThirteen niggas runnin' straight to the bushes\nFor they gats so they can draw down\nBut why a motherfucker like me have to fall down?\nNot knowin' why I dropped out\nFuck it, still can't afford to get popped out\nSo now I gotta jet\nOnly ran one block, but my shirt is soakin' wet\nTryna see if we got 'em\nLooked down and my sweatshirt's red at the bottom\nDidn't panic but I still looked cracked out\nYelled to the homies then I blacked out\n\n[Interlude 1: Homies]\nGet up, man! Get up, man! (C'mon keep that nigga awake, man!)\nC'mon, man! Get up man, c'mon man!\n\n[Verse 2]\nWoke up in the back of a trey\nOn my way to MLK\nThat's the county hospital, jack, ha\nWhere niggas die over a little scratch\nSittin' in the trauma center\nIn my back is where the bullet entered\n\"Yo, nurse, I'm gettin' kinda warm!\"\nBitch still made me fill out the fuckin' form\nCoughin' up blood on my hands and knees\nThen I heard, \"Freeze, nigga! Don't move!\"\nYo, I didn't do a thing\nDon't wanna go out like my man Rodney King\nStill got gaffled\nInternal bleeding as the bullet starts to travel\nNow I'm handcuffed\nBeing asked information on my gang affiliation\n\"I don't bang, I rock the good rhymes\nAnd I'm a victim of neighborhood crime.\"\n\n[Interlude 2: Police Officers]\nAre you the only one who got shot? What kinda gun was he carrying? Do you know who it was? (No, man, don't know who it was, man) Are you in a gang? (Man, what does it matter, man? I'm shot)\n\n[Verse 3]\nI need to see a MD\nAnd y'all motherfuckers giving me the third degree?\nLook at the waiting room\nIt's filled to the rim like the county jail day room\nNobody gettin' help\nSince we poor, the hospital it moves slow\nNow I'm laid out\nPeople steppin' over me to get closer to the TV\nJust like a piece of dog shit\nNow will I die on this nappy ass carpet?\nOne hour done passed\nDone watched two episodes of M*A*S*H\nAnd when I'm almost through\nThey call my name and put me in ICU\nHalfway dead\nNo respect, and handcuffed to the bed\nNow the drama starts\nCause the bullet must be just a hair from my heart\nThen I begin the ass kissin'\nJust to get looked at, by a overworked physician\nHad the chills, but my temperature's a hundred and three\nOnly got a band-aid and a IV\nThat's when I start cussin'\nPolice steady askin' me who did the bustin'\n\n[Interlude 3: Police Officers]\nWhat did you get shot with? (Twenty-two!)\nWho shot you? (I dunno who shot me)\nWas it gang-bangers? (Had to be)\n\n[Verse 4]\nWhy, oh why, can't I get help?\nCause I'm black, I gots to go for self\nToo many black bodies the hospital housin'\nSo at 10 p.m, I was Audi 5000", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg", "album": "Death Certificate", "year": "1991-10-29"}]}