{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "Goin Off", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Verse]\nFuck it, aye\nDo or Die, new arrival\nHolla at my niggas\nYou survive you's alive, yo\nNow either you follow me and ride, or you's a rival\nThe difference between you and I is you a model, you posing\nBut who am I though?\nThe mulatto out for that lotto\nMoney coming soon, the newest model\nYour crew is hollow\nThe type of niggas gobble dick, chew and swallow\nYour girl told me shoot in her face, she suicidal\nOh shucks, you niggas is closed, you fold up\nI'm from the Ville, niggas get killed over four bucks\nThank God we made it, my niggas, we grown up\nNow we crazy over that bread, call us the \"dough-nuts\" uh\nMore sluts once the money blows up\nBut them hoes stop if the dough drops\nI won't stop though, a chip off the ole' block\nI'm from a city where niggas hold blocks\nLeave you looking like old socks, damn\nCops patrol blocks, spotting on us\nThe boys is rotten, I know they want us\nProbably arrest a nigga, get a bonus\nYou kill a nigga, get promoted\nShit is crazy, girls getting babies before they get diplomas\nSo much I just go nuts\nNiggas telling me slow up\nNever that\nI'm tryna get where that cheddar at\nY'all don't hear me\nAlways somebody that don't want you getting cheese, yo\nThis whole bullshit is like Tom and Jerry\nI'm kinda very raw, niggas can't deny facts\nIf you black they sending you to jail or Iraq\nHonor is something you can't sell or buy back\nNiggas don't like bragging, they 9-11 fly cats\nHijack niggas, \"Get up out your whip nigga, strip!\nI want it all- ice on your wrists and the kicks, \"\nThis shit happens, I ain't just rapping, believe it yo\nThey got streets in the city police won't even go\nPeep it though, uh\nIt ain't no secret, niggas beefing cause my ego so big\nIt got me speaking like I'm diesel, like I'm devil, oh\nNiggas know my style though, I ain't tweaking, I am lethal though\nHave your daddy looking for you\nThis ain't Finding Nemo though\nLet me slow it down, dumb it down, y'all warned\nThe son came up out that womb, yo, a star is born\nIf real recognize real, y'all are foreign\nMy team run a play on your bitch and we all scoring, yea!"}], "artist": "J. Cole"}