{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "50 For President", "lyrics": "[Intro]\nLadies and gentleman, I know you were very surprised when you heard for the first time 50 Cent is running for the president. I like to thank you for all for tuning into these debates. Some really important issues to adress and I'd love to answer your questions and hear your suggestions. (Listen to this shit) after I propose. I'm not just another politician politicing, it's your boy. 50 - here we go\n\n[Verse 1]\nYeah, I done smoked a couple pounds, but I ain't never inhale\nBeen in custody before, but never in jail\nBaby, I love you like America, don't talk to me fly\nBut I promise you if you do, bitch, I'll black ya eye\nSee, the hood fucked up, I got a plan for the crisis\nBring the dope in on boats and lower cocaine prices\nThat's stage one of my plan to pass by depression\nWhen everybody high who gives a fuck 'bout recession?\nImagine gas price is twenty dollars a gallon\nD's catch a nigga and have walk to the island\nMy main aim's to take away pain\nIt's okay, get fucked up, man\nGot that purple, roll that shit\nGot that pill pop, now take that trip\nGot the Hennessy, man, take that sip\nThe pain'll go away if you get higher than a motherfucker\nAnd I know you think you know my style\nSursprise, nigga, I done changed it now\n5 years, I'm the nigga you been hating on\nDecember 9th I'mma give you what you waiting for\nBefore I Self Destruct, motherfucker\n\n[Outro]\nIt's 50\nI'm in Detroit right now\nI got Eminem in the other room, Dre in here\nWe putting it togheter\nI'm gon' hit, I'm finna hit the restart button\nIt's gon' feel like I just started it all over again\nLike this '03 and this is Get Rich\nMy album come with a full length movie\nFeautered film, I'm like Prince right now, man\nIt's like Purple Rain, baby, stupid\nReproduced and directed by 50 Cent starring Curtis ''50 cent'' Jackson\nClifton Powell, Treach, Gabriel Casseus, Sasha Delvalle, Elijah Williams, Carlos Franco, Gabriel Ellis\nShout out to all my niggas in Paris and New Jersey\nAight, I gotta go work back on my album\nIt's classic, December 9th, 50\nThat's right, Thisis50.com, On demand Entertainmant\nPeace - oh yeah, on't forget to vote for me", "year": null}]}