{"songs": [{"title": "Odd Octubree", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Intro: Tyler, The Creator]\nYeah\nHow you doing today?\nYeah\nYeah\nAce the Creator, man\nLook\nCasey Veggies\nOdd Future, look\nLook\n\n[Verse 1: Tyler, The Creator]\nHello, the hype is so mellow\nBitch I'm dope but my pipe is so yellow\nThe blue polka dots, pink stripes and it's pink on the title\nNigga fuck your role model bitch, I'm my own idol and\nIf you can't face it my nigga, you can ass it\nMy accessorize accessories bring out my assets\nNigga they sound on acid, tablets\nStussy’s G-Shock with my custom pair of 3D glasses\nI suffer from ADHD\nI should win a fucking award for being me\nBeat banging the tom-toms\nMy producer selection is fresh nigga, fuck Vons\nAce the underdog, thrown them on the back bender\nCause I change my outfit more than transsexuals change gender\nEating Belgian waffles with Italian biscotts\nI sold my soul to the devil for thirty percent off\nAnd to you emo kids who walk around pissed off\nStep one: pull your panties down and start to piss off\nStep two: run to your radio, turn this shit off\nNigga didn't bother, so my father didn't help\nSo when my mom would beat my ass, she would always hit me\nWith Gucci belts, Gucci imprint from leather welts\n\nAce, the Creator, man\nCasey Veggies, yo\nOdd Future, nigga\nGet used to it\nHey, I’m gonna slow it down real quick for you\n\n[Verse 2: Tyler, The Creator]\nI'm so dapper man, funky fresh Dapper Dan\nI'm your favorite rapper, fan, it's an honor to shake my hand\nOn award tour, on excursions, I'm a virgin of swap meets\nI'm so pure, so sick it's no cure\nI'm dope, where the fiends at? Aight, where the jeans at?\nThe hat, the crew, the t-shirt is Supreme\n\n[Verse 3: brandUn DeShay]\nYeah\nWe gotta speed it up, we trying to get to the mall\nTrevor B in on the boards, brandUn DeShay\nRight here for y’all\nIt’s what I do, don’t get it misconstrued\nOne half of Arcade\nStep your game up, wait up\nIt’s the mixtape extraordinaire\nHip hop went M.I.A., I only sort of cared\nBut thanks to me and the cool kids and Casey V\nAnd plus A-C-E\nThe Creator\nY’all niggas is playing yourself, masturbators\nIf you could, you’d hate on yourself, master haters\nHello ladies, the [?] with no towel\nY'all always come with chicken like Kung Pao\nI'm always off the top like Kung Lao\nI had to let it bang like gun pow-der\nI can assist it\nY'all really gonna miss them when I'm gone\nIf I ever exit\nI feel like I come with Benedict\nLike ex and not Arnold and traitors, y'all haters\nYou're so flagrant with your foul behavior\nDr. DeShay, you can dial a pager\n[?] so sick I need cough syrup\nIf y'all ain't catch it, just rewind like a rip\nI am the purest since blue magic\nI am legend and I do classics\nAnd I do problems, mathematician cause I do solve them\nOkay, you’re a goon, but what’s a goon to a goblin?\nOkay, what’s a goblin to a monster? Okay, what’s a monster to a beast?\nA monsterbeast\nAnd that’s me because I make monster beats\nI do a show and have they block looking like Contra streets\n\n[Verse 4: Casey Veggies]\nOh, turn the volume up\nYou still talking that Mass & volume stuff\nIt ain't a test to me\nY'all niggas ain't even heard the best of me\nGot you going like ecstasy\nUh, yeah\nIt's Case-eezy and it ain't easy being me-eezy\nI mess with the Yeezy and the Jeezy\nAnd oh yeah, the Weezy\nLeft me right where, where you leave me\nI got it all, it's no need to tease me\nI'm coming in the game, you niggas ain't even see me\nTold you my lines and you didn't even believe me\nAnd I'm a book come and read me\nI'm blood, come bleed me\nSlip straight to 90's, get off of my sleezy\nYeah, because the haters always acting up\nAnd I'm attacking ya, never back it up\n\n[Verse 5: Casey Veggies]\nFirst song get oh boy'd\nNow all the girls like \"Oh boy, oh boy\"\nAnd I don't wanna hear that weak shit no more\nAnd I'm coming to a store near you\nNigga why would I fear you?\nYou can't tell me nothing, I didn't hear you\nI'm riding from night til the next day\nMaybe balling spent 50 on the coat sway, no way\n(Yo, because)\n\n[Verse 6: Casey Veggies]\nIt's only one way up so I ain't going down\nThey around know I'm around when I come around\nYung Joc because it's going down\nFrom [?] and first to Supreme\nAll these niggas know the kid stay clean\nCustom, why you think my momma named me Casey?\nSo I can change into it\nRap with me, I was [?] into it\nI'ma get signed cause Ye can do it\nThe moment I put the pen to the paper\nI'ma keep moving, going through and through it\n[?] 3,000 [?]\nNow Casey playing chess with Monopoly\nAin't no nigga stopping he\n[?] kid, nigga what you supposed to be\nBubbly flows and that I'm toastin' he\n[?] in the ground, yeah I'm growin' [?]\nOn my mind yeah, I flow when I sleep\nAnd I keep going until I hear that beat beep\n[?] just creep creep\nWhenever I take nothing, fake niggas always tryna take something\nYeah, I'ma lay low, my time will come\nKeep writing til my hands is numb\nVegas trips [?] fun\nWhy compete when it's already won\nCall me daddy nigga, you are my son\nShoot for the stars, she is my gun\nShe's so bomb, I call her a bad one\nSee Casey Gucci killer figure\n[?] SBs and Nike Maxes…\n\n[Verse 7: MF DOOM]\nThere's only one beer left\nRappers screaming all in our ears like we're deaf\nTempt me, do a number on the label\nEat up all they MC's and drink 'em under the table\nLike, \"It's on me. Put it on my tab kid.\"\nHowever you get there, foot it, cab it, iron horse it\nYou're leaving on your face, forfeit\nI crush the mic, hold it like the heat, he might toss it\nTold him tell her they stole it - he told her he lost it\nShe told him, \"Get off it,\" and a bunch of other more shit\nGetting money, DT's be getting no new leads\nIt's like he eating watermelon, stay spitting new seeds\nIt's the weed, give me some of what he's drooping off\nSoon as he wake up, choking like it was whooping cough\nThey group been soft\nFirst hour at the open bar and they're trooping off\nHe went to go laugh and get some head by the side road\nShe asked him autograph her derriere, read\n“To Wide Load, this yard bird taste like fried toad turd\nLove, Villain.” Take pride in code words\nCrooked eye mold nerd geek, with a cold heart\nProbably still be speaking in rhymes as an old fart\nStudy how to eat to die, by the pizza guy\nNo he's not too fly to skeet in a skeezer's eye\nAnd squeeze her thigh, maybe give her curves a feel\nThe same way she feel it when he flow with nerves of steel\nThey call the super when they need their back... uhh... plumbing fixed\n\"How there only one left? The pack comes in six!\nWhatever happened to two and three?\"\nA herb tried to slide with four and five and got caught\nLike, \"What you doing G?\nDon't make me have to get cutting like truancy\nMatter fact, not for nothing, right now, you and me!\"\nLooser than a pair of Adidas\nI hope you brought your spare tweeters\nMC's sound like cheerleaders\nRapping and dancing like Red Head Kingpin\nDOOM came do his thing again, no matter who be blingin'\nHe do it for the smelly hubbies\nSeeds know what time it is like it's time for Tellie Tubbies\nFew can do it, even fewer can sell it\nTake it from the dude who wears mask like a 'tarded helmet\nHe plots shows like robberies\nIn and out, one, two, three, no bodies, please\nRun the cash and you won't get a wet sweatshirt\nThe mic is the shotty: nobody move, nobody get hurt\nBring heat, like your boy done gone to war\nHe came in the door, and \"Everybody on the floor!\"\nA whole string of jobs, like we on tour\nEvery night on the score, coming to your corner store\n\n[Outro]\nThere, it is done. Now that the representative from South Africa has been mind programmed, all of the world's leaders on earth are under my control. And when they meet tomorrow in special session, I, DOOM, shall be voted master of the world. My plan is foolproof, but just in case…", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}