{"artist": "Wax", "songs": [{"year": "2016-09-02", "lyrics": "[Chorus]\nBe careful who you pick\nYou don't wanna get too close too quick\nWhether you're a dude or you're a chick, yeah yeah yeah\nLove will make you do dumb shit\nYou'll become a hypocrite\nIt'll make you go against logic\nWhatever you should do you do the opposite, yeah yeah yeah\nLove will make you do dumb shit\n\n[Verse 1: Awkwafina]\nTo be honest I'm on shit\nHiding in this closet\nLove I am losing, a bitch really lost it\nHow did I get here?\nSoon I'll be a convict\nI'm on IG and I'm stalking his mom's pics\nI'm in a tree with police grade binoculars\nProgram his virtual dick on my oculus\nStarted last April\nEverything was gravy\nGot a turkey baster\nTryna have his babies\nBut come Thanksgiving, his fam thinks I'm crazy\nThey weren't sure about me like I was Steve Avery\nMight be a murderer, might be a saint\nBut when it come to love I go hard in the paint\n\n[Chorus]\nBe careful who you pick\nYou don't wanna get too close too quick\nWhether you're a dude or you're a chick, yeah yeah yeah\nLove will make you do dumb shit\nYou'll become a hypocrite\nIt'll make you go against logic\nWhatever you should do you do the opposite, yeah yeah yeah\nLove will make you do dumb shit\n\n[Verse 2: Wax]\nI spent all my rent money on some flowers and some jewelry\nMaxed out my credit cards on movies and sushi\nI thought that I was being great\nSomething she'd appreciate\nAnd after that much needed date she was like \"I need some space\"\nI was numb and it shocked\nTried to text her to get her back but my number was blocked\nNow I'm pacing in my kitchen\nHer face is what I'm missing\nWhy oh why am I infatuated with this bitch\nI'm frickin' clickin' through her Facebook, stalking like an idiot\nShe already got a new boyfriend she kicks it with\nClick every picture\nThat they ever tooken\nJealous 'cause he's richer than me and better looking\nNow all of her posts be some cute love quotes\nHe got a boat I be like \"fuck boats\"\nI hope the boat sinks and I hope you both drown\nLove will turn a smart man into a clown\n\n[Chorus]\nBe careful who you pick\nYou don't wanna get too close too quick\nWhether you're a dude or you're a chick, yeah yeah yeah\nLove will make you do dumb shit\nYou'll become a hypocrite\nIt'll make you go against logic\nWhatever you should do you do the opposite, yeah yeah yeah\nLove will make you do dumb shit\n\n[Spoken outro: Wax]\nThe moral of the story is, bitches ain't shit. Dudes ain't shit either. It don't matter how old you are, it don't matter how experienced you are - you fall in love you probably gon' act jealous and crazy. So my advice - 3 months tops man, you can't let a relationship go longer than like 3 months man. As if. 4 months is too much. 5 months is way too much. Cut that shit off\n\n[Audio Snippet]\nYou make me feel so young", "image": "https://images.genius.com/7c1dd79f5e740daf40ac14e92f0f0bef.999x999x1.jpg", "album": "The Cookout Chronicles", "title": "Love Will Make You Do Dumb Shit"}]}