{"songs": [{"title": "Coupe", "album": null, "year": "2016-09-07", "image": "https://images.genius.com/18313ad31c2e0baf2fed596b5236135f.640x640x1.jpg", "lyrics": "[Intro: Lil Pump & FendiFurCoat]\nGrraah!\nI done just hopped out my coupe\nGrraah, grraah, grraah\nI done just hopped out my coupe\nGrraah, grraah, grraah, skrrt (skrrt)\nI done just hopped out my coupe (skrrt)\nI done just hopped out my coupe\nI done just hopped out my coupe\nI done just hopped out my coupe\nCall them\nAyy, ayy, ayy (brr)\nBrr, gang\nEsskeetit!\nFilthy Rich Beats\n\n[Chorus: Lil Pump]\nAyy, I done just hopped out my coupe\nAyy, I done just hopped out my coupe\nAyy, I done just hopped out my coupe\nAyy, I done just hopped out my coupe\nAyy, I done just hopped out my coupe\nAyy, I done just end up on news\nAyy, I done just end up on news\nAyy, I done just end up on news\nAyy, I done just hopped out my coupe\nAyy, I done just hit me a lick\nAyy, I done just flip me a brick\nAyy, I done just got me a Glock\nAyy, I just done bought me some hit\n\n[Verse 1: Lil Pump & FendiFurCoat]\nGot a .40 where the holler tips (pew)\nGot a .30 where my letter is (brr)\nI don't give a fuck, I'm with this shit (boom)\nI pull up on your block and hit with stick (boom, boom, boom)\nLil Pump, yeah he sellin' rock (Filthy Rich Beats)\nPosted on the block, with my fuckin' ma\nHit you with the Glock, yeah I'm bustin' shots\nYeah I'm servin' white, yeah I'm servin' frost (grraah)\nPosted on the block; run up on me wrong, and you gettin' dropped\nGot a .40 with me (wow) and I got the Glock\nRun up on me wrong, boy you gettin' Paul (braow)\nEsskeetit!\n\n[Verse 2: FendiFurCoat]\nBitch, I been flexin' since the seventh fuckin' grade\nLet a nigga run up on me, get his momma at a grape\nFlexing so hard got me, got Supreme up on my chest\nBitch, flexing so hard, making all these thots wet\nNiggas ask me why I rap, bitch cause I can\nTalkin' all this shit for what, nigga? You was just a fan\nTook your thot, finesse for top, pussy weak\nGot that bitch on my dick for a goddamn week, yeah, yeah, yeah (brrah, brrah, brrah!)\nBust on in her mouth, kicked that fuckin' thot out (bye!)\nCopped the pints, get them for the high, yeah\nAll this dope got in my eyes\nLike a Chinaman's wife when he says he's outta rice\nIn the kitchen whippin' up a pint...\n\nHit my trap, ain't endorse\nDrugged a bitch, for her corpse\nSippin' lean, smokin' thrice...\n\n[Outro: FendiFurCoat]\nYeah, esskeetit man"}], "artist": "Lil Pump"}