{"artist": "Doughboyz Cashout", "songs": [{"title": "Change Your Life", "album": "We Run The City Vol. 2: Floodzone ", "year": null, "image": "https://images.genius.com/59f198bec988a12b66d3578574d37830.600x600x1.jpg", "lyrics": "[Roc]\nLet me have you, let me put you on fours girl\nI know you got a man but I can play roles girl\nYo man on the other hand gone Honda Accord you\nPlus I'mma buy shit he can't even afford to\nReal street nigga, I can change yo life\nHave you callin off work just to watch me shoot dice\nI have you in the hood with my niggas at the trap bar\n'Fore you know it, you would fall in love with a trap star\nHoes ain't shit, so I ain't really with the cuffin\nWe can hit the 8 of mile, just to show you I ain't bluffin\nTryin to love you long term,\nI ain't trying to embarrass you\nHave you doing freaky shit thats all out ya character\nIn love with a goon, every night we gettin rooms\nYour man callin wounded, tell him you'll see him soon\nI see you with a lame cat, I'm trying to change that\nRearrange that, put you in the range all black\nCome on\n\n[Hook]\nGirl I can change yo life\nFlood you with all this ice\nIt's only right\nAnd, I can be your everything\nTake you on shoppin spree\nTake you places you ain't never seen, girl\n\n[Payroll]\nShe prolly fuck around with squares\nI'm iced up, looking like I fuck around with squares\nChange up your circle it'll be a good look\nI approach you smelling like cologne with a pinch of kush\nI ain't nothin you used to\nI ain't gotta boost, Louis same color as pudding\nSo baby you see the proof\nSince I got the low tops, I'mma get you the boots\nAnd since I got the big body, I'mma get you the coupe\nHit Somerset, everyday shop damn near all night\nBe on the skywalk so much we can't walk right\nHit you from the back till you can't walk right\nLeave them lames alone and come join me in the boss life\nYou got a real nigga, so now all yo friends mad\nWhen they ask you what I do, just tell em that get cash\nThey say it ain't trickin if you got it,\nEspecially when ya stack ain't fittin in ya pocket\n\n[Hook]\n\n[HBK]\nI got money out the ass, girl I’m changin yo life,\nSo since I'm changin yo life, I’m changin yo ice\nAnd money ain’t shit, don’t give a fuck about no price.\nTake you through the hood girl so we can hang with foe life.\nBlow dro all night, I like you alright?\nWe ball hard, they ball lite\nThese hoes they are trife.\nBut see you something different\nJust me and my misses, front row tickets to the Pistons\nAnd these niggas they be trippin\nCause they want you girl they wishin\nBut they money short like midgets.\nIf you ain’t bout making digits\nGet the fuck on bout yo business\nWindows tinted if I’m in it\nAnd the top drop so hop in it\nAnd we bout to go shoppin\nRoley bezel with rocks in it!\n\n[Hook]"}]}