{"artist": "Benzino", "songs": [{"lyrics": "[Superb]  Aiyyo, this a perv, yo\n[Cormega] Yo, son there's bitches in there?\n[Raekwon] Yeah, yeah, the coaches, aiight then\n\n[Hook: Superb]\nJump up in the party like [what!]\nWhere my niggas at? [what!]\nWhere my bitches at? [what!]\nBartender where the liquor at?\n\n[Raekwon]\nAiyyo, seven thick ribs nigga, check out my man\nHe got braids and with bread break ape on your grave\nWe from the gutta niggas, chest sputta what up\nFuckin with us or get you cut up, matta fact get'cha mutha\nCause I ain't fo real fo real, don't play games and I'm ill\nI'm just a business man who love getting niggas killed\nSmell my satiate smell keys, that shit's like deodorant, daddy\nI like maglees for other reasons\nRun with niggas that love paper\nWe let the youngest niggas get rich and mow them like makeup\nYou can lex 'Zino and Benzino together\nThat's priceless to put our pay together, niggas by Lexus\nStraight out the ghetto niggas is pussy\nTo even fuck with us that'll be the day a white nigga mush me\nStraight up, two-thousand is mine\nHeavy lines, heavy guns, big-ass Chevy's, we make niggas shine\n\n[Hook: Superb]\nJump up in the party like [what!]\nWhere my niggas at? [what!]\nWhere my bitches at? [what!]\nBartender where the liquor at?\nJump up in the party like [what!]\nWhere my niggas at? [what!]\n\n[Benzino]\nBlack shells, scuba style, sonar, I go deep\nRip lungs outta jaws, flawless, I don't sleep\nThe fast and furious, Yokohama twin jets\nBlack and white bagettes, I'm duckin feds\nHydro-plane, hydro-foil blow hydro\nSmooth gotho, Ray, its aiight I got those\nI got this, son I spotless\nFrozen watches, belts wit the notches\nBitches topless, three-way manages, Motorola holder\nBreak bread with Motola, take advice colder [aiight!]\nKedar knock-areano, Motown soldier\nI thought I told ya lil' double Ray'll ghost ya\nDouble row, parvin, three-sixty rubber band\nIce me Apalla then three shave frozen hand\nDark shadow, my shit gleam in the shade\nWatch `Zino flow, fuck the Macy's parade\n\n[Hook 2x: Superb]\nJump up in the party like [what!]\nWhere my niggas at? [what!]\nWhere my bitches at? [what!]\nBartender where the liquor at?\n\n[Cormega]\nYo, broke far from it, coke, sold a lot of it\nFlow off the meter, let me know if y'all want it\nSon, the life of problems and guns, so silence her, son\nBugs Bunny Icebergs and Air Force One's\nI paint a picture listen up you become part of the song\nWhen I slow my first young a new saga begun\nUnaware, I would become a nemesis for livin in this\nDrug dealin life, smoked niggas and bitches with plugs\nNever been a snitch, I'm not built like that\nI'm real, that's why we not feelin you like that\nI'm the ghetto manifested in words\nWhen I die, niggas'll point a valuable lesson I learn\nWhether OG or adolescent in the presence ashurn\nOT or O-key handlin birds\nLike Dominique I feel I deserve respect I earn\nMega is a word we all protect with words, holla\n\n[Hook 2x: Superb]\nJump up in the party like [what!]\nWhere my niggas at? [what!]\nWhere my bitches at? [what!]\nBartender where the liquor at?", "image": "https://images.genius.com/ab64bde2620df28863f2c6355a1da426.600x600x1.jpg", "year": null, "title": "The Jump Up", "album": "The Benzino Project"}]}