{"artist": "KILLY", "songs": [{"image": "https://images.genius.com/0a7e609d0bd2cc3f7e6bd9620616271d.1000x1000x1.jpg", "title": "Above", "year": "2019-06-14", "album": "Light Path 8", "lyrics": "[Chorus]\nStars on the roof ain't nothin' (Yeah, yeah, yeah, yeah)\nDon't fly too close to the sun (Yeah, yeah, yeah)\nDiamonds on the face crushed up (What? Yeah, yeah, yeah)\nBut water ain't thicker than blood (What?)\nBut water ain't thicker than blood (Yeah, yeah)\nOn top of the world ain't enough (Yeah, yeah, yeah)\nI'm not from here, I'm from above (Yeah, yeah, yeah)\nWas down bad, I was in a rut (Bad, bad, bad, bad, yeah)\nNow I'm up in a rush (Up)\nI'm in love with the rush (Rush)\n\n[Verse]\nI'm not from here, I'm from above (Yeah, woah)\nGot the world in my hand, ain't enough (Ain't enough)\nNeed the loaf, need the crumbs and crust (Yeah, yeah, crust)\nGlowed up, now they hate my guts (Why? Hate my guts)\nI can't finesse with the scrubs (Scrubs, scrubs, scrubs, scrubs, scrubs)\nThat's a little thot I can't love (Love, love, love, love, love, no)\nFell in love with the guap (Hah, hah, hah, hah, hah)\nIf you want a bird, I got a flock (Hah, hah, hah, hah, hah)\nWe can take our time, there is no hurry (Hey)\nCome 'round here, we livin' with no worries (Yeah)\nWord on road, I heard they wanna gurk me (Me)\nStill speedin' 407, got no worries (Yeah, yeah)\nI just make the wave, they wanna surf me (Surf me)\nI just turned that girl into a Kirby (Kirby)\nShe a freak, throw a circus behind the curtain\nI'm a thief in the night, I stay lurkin' (Yeah, yeah)\n\n[Chorus]\nStars on the roof ain't nothin' (Yeah, yeah, yeah, yeah)\nDon't fly too close to the sun (Yeah, yeah, yeah)\nDiamonds on the face crushed up (What? Yeah, yeah, yeah)\nBut water ain't thicker than blood (What?)\nBut water ain't thicker than blood (Yeah, yeah)\nOn top of the world ain't enough (Yeah, yeah, yeah)\nI'm not from here, I'm from above (Yeah, yeah, yeah)\nWas down bad, I was in a rut (Bad, bad, bad, bad, yeah)\nNow I'm up in a rush (Up)\nI'm in love with the rush (Rush)"}]}