{"artist": "Fat Joe", "songs": [{"year": "1993-07-27", "album": "Represent", "image": "https://images.genius.com/74218f34fc7a7f477441922b9caced21.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah.. now in ninety-three\nEverybody knows the flav\nFat Joe Da Gangsta, yeah\nYou know my style\n\n[Verse 1:Fat Joe]\nFat Joe, a.k.a. Da Fat Gangsta\nI'm no joke, and I'm far from a prankster\nI got skills, aiyyo word life\nSuckers is scared, because they know I live trife\nAs I troop down the streets of a ghetto\nSkins are jockin, and always screamin hello\nBut I keep drivin in my jet black Beamer\nI'm not a daydreamer, but I'm known as a scheamer\nI'm dead-ass, when it comes to this\nAnd if you fuck around, your moms'll reminisce\nThinkin of the good times she spent with her son\nSomebody shoulda told you that I wasn't the one\nYes I'm known to get nuff respect\nAnd if you face Fat Joe, well then you face your death\nNow in ninety-three, it's time to take a stand\nAnd you know how I'm livin, I'm a bad, bad, man\n\n[Hook]\nNiggas know the flav\n\"I'm a bad, bad, man!\" (cut and scratched 2X)\n\n\n[Verse 2:Fat Joe]\nCheck it\nAll the old folks, hate my guts\nCause I be hittin all they daughters and they big fat butts\nCause I'm the papi chulo when it comes to rap\nAnd if you fuck with me, then you leave handicapped\nI don't give a fuck, don't care who you are\nI gotta say peace to my peeps GangStarr\nSome real motherfuckers from around the hood\nWhen I chills with them, we be up to no good\nHittin skins, makin ends\nLoungin with my friends in my fat BM\nWhether Uptown in the Boogie Down\nOr checkin out stunts in the Polo Ground\nSee just like Mel, I'm internationally known\nAnd I'm mob related, like Al Capone, check it\nToo hot to handle, blow you like a candle\nYou never catch Joe in the middle of a scandal\nNow in ninety-three it's time to take the stand\nAnd you know how I'm livin, I'm a bad, bad, man!\n\n[Hook]\nEverybody knows the flav\n\"I'm a bad, bad, man!\" (cut and scratched 2X)\n\n[Vere 3:Fat Joe]\nOne day I was chillin, caught a buckshot\nThe nigga was butt, so then he gets no props\nWord spread fast around town\nI was layin six feet deep underground, check it\nNiggas wished the worst, but spoke too fast\nCause here I am and I'm ready to blast *gunshot*\nThe cops must have missed, takin me for a bitch\nBecause they tried to gas me, and make me turn snitch\nBut I'm not the one for peace\nSo I turned around and said, \"Fuck the police!\"\nI'm the type to handle this on my own\nPack two joints and pass one to Tone\nThere's no shame in my game, I do what I gotta do\nSee I'm rollin with a crazy live crew\nNow in ninety-three it's time to take a stand\nAnd you know how I'm livin I'mma bad, bad, man!\n\n[Hook]\nYeah! Niggas know the flav\n\"I'm a bad, bad, man!\" (cut and scratched)\nNuff respect to my man Jazzy J\nDiamond D, Showbiz and A.G., and I'm out\nWord\n\n\"I'm a bad, bad, man!\" (cut and scratched to end)", "title": "Bad Bad Man"}]}