{"artist": "Phife Dawg", "songs": [{"album": null, "title": "Dear Dilla", "image": "https://images.genius.com/237ce8c17040f74a4bb4d45b7fda3360.715x715x1.jpg", "lyrics": "[Interlude: Phife]\nDilla dawg, I had a dream about you fam\nIts 2005, we in the same hospital room\nYou on one side, I'm on the other\nI'm stressed out, but what gave motivation was you pullin' out that MP\nAnd bangin' out some bangers as usual\nNothin' ever phased you fam, and for that, I miss you\n\n[Intro]\nD-Town throw it up\nNYC throw it up\nThe whole world throw it up\nBK\n\n[Verse 1]\nHold tight, this ain't the last time I see you\nDue time, that's my word, I'mma see you\nFrontin' ass rappers now here stealin' intros\nPosin' like they hard when we know they all see through\nI'mma tell you, Dilla, why they lackin' skills now\nNo stage presence, cadence, style\nThey livin' off of hooks, skinny jean crooks\nPre-K lyrics, why would I need a book?\nI reminisce, reminisce, when Mobb dropped shook\nShan was down by law, such a good look\nNas' God's Son, his return was Stillmatic\nDistortion to Static, you and Slum Fantastic\nThought I'd chop you out, son, see how you're doin'\nCome back to earth, homie, hip hop is in ruins\nI'm a third of the Tribe but I'mma speak for the click\nWhat up though, we miss you, kid\nMotor City say\n\n[Hook: Q-Tip]\nJay Dee, flip another beat for me, Jay\nJay Dee, flip another beat for me, Jay\nJay Dee, flip another beat for me, Jay\nJay Dee, flip another beat for me, Jay\n\n[Verse 2: Phife]\nYo, yo, beatwise, you still that cat which most shit be measured\nI'm that MC known to share his displeasure\nWith the route the game was taking, how mundane things have gotten\nYou know music on a whole, never mind just hip-hoppin'\nI'm in the club, 3 hours and change\nDJ spinnin Top 40, we be hearin' all day\nSome MCs are catalog, and yeah, they stay paid\nBut why pay over one buck, when they lip syncin' on stage?\nKing of pop, Barry White, rollin' over in they grave\nJones Girls, Emotions singin' back in our day\nDilla dude still crackin', they wish to be like you\nProducer extraordinaires, knowing their beats be recycled\nBut on your worst day they couldn't mess with you\nCats makin' Ts in remembrance of you\nLeast they could do is give your fam a dime or two\nThis man gave his heart, this what the fuck y'all do?\nBut yo, don't stress my you, word bond we got you\nTell Baatin I said what's up, word, he right next to you?\nSo NYC to the D with heavy hearts we miss you\nWord, God wish you were here, so until we meet again just...\n\nHook\n\n[Outro: Phife]\nMa dukes\nV. Rich on the keys\nMy main man DJ Rasta Root on the beat, on the cuts\nSmokin Needles, [?] kids, salute\nATCQ forever", "year": "2014-01-21"}]}