{"songs": [{"image": "https://images.genius.com/9a9370d5f49de76e08b03393ad969f38.1000x1000x1.png", "title": "High School", "album": "Pink Friday: Roman Reloaded - The Re-Up", "year": "2013-04-16", "lyrics": "[Verse 1: Nicki Minaj]\nHe said he came from Jamaica, he owned a couple acres\nA couple fake visas 'cause he never got his papers\nGave up on love, fucking with them heart breakers\nBut he was gettin' money with the movers and the shakers\nHe was mixed with a couple things, ball like a couple rings\nBricks in the condo and grams to Sing Sing\nLeft arm, baby mother tatted\nFive year bid up north when they ratted\nAnyway, I felt him, helped him, put him on lock, seat belt him\nTook him out to Belgium, welcome\nBitches this pretty, that's seldom\nThis box better than the box he was held in\nI'm Momma Dee in that order, I call him Daddy like daughters\nHe like it when I get drunk, but I like it when he be sober\nThat's top of the toppa, I never fuck with beginners\nI let him play with my pussy then lick it off of his fingers\nI'm in the zone\n\n[Chorus: Nicki Minaj]\nThey holler at me, but it's you\nYou, this ain't high school\nMe and my crew, we can slide through\nGive it to you whenever you want\nPut it wherever you want\nBaby, it's yours\nAnywhere, everywhere\nBaby, it's your world, ain't it?\nBaby, it's your world, ain't it?\n\n[Verse 2: Lil Wayne]\nAlright, uh\nShe got a nigga at home, and one on the side\nBest friend is a dyke, they fucked around a few times\nHer and her momma alike, so all they do is fight\nI tell her make me some money, she tell me \"make me a wife\"\nI tell her, \"Bitch, you crazy, fuck wrong with you?\"\nAnd excuse my French, but I'm a long kisser\nAnd then she try to tell me I'm the only one that's hittin'\nAnd I say, \"What about them niggas?\" She say, \"What about them niggas?\"\nYou right, what you doing tonight?\nPut on something tight, don't judge me, I get life\nShe love me like a brother, but fuck me like a husband\nPussy like a oven, too hot to put my tongue in\nAll I had to do is rub it, the genie out the bottle\nPussy so wet, I'ma need goggles\nShe tell me that's it's mine, I tell her stop lying\nMine and who else? She say worry 'bout yourself\nLil Tune\n\n[Chorus: Nicki Minaj]\nThey holler at me, but it's you\nYou, this ain't high school\nMe and my crew, we can slide through\nGive it to you whenever you want\nPut it wherever you want\nBaby, it's yours\nAnywhere, everywhere\nBaby, it's your world, ain't it?\nBaby, it's your world, ain't it?\n\n[Outro: Nicki Minaj]\nI know you want it, boy\nI see you tryin'\nJust keep on pushin'\nI'ma let you slide in\nJust close your eyes and\nThis horizon\nIt's ready, come get you some\nYeah, yeah, yeah, yeah"}], "artist": "Nicki Minaj"}