{"songs": [{"title": "Stand Up", "lyrics": "[Intro: Akala]\nUK... Stand up\nAkala\nIt's Not A Rumour, blud\n\n[Verse 1: Akala]\nAll my people, wherever in britain\nBro I know the flows cold\nLet me know that you feel it\nAnd I know the roads slow but your ready to kill me\nCause I feel that same pain, hear the lyrics I'm spittin?\nCritics ask why I don't smile, they gotta be kiddin\nLittle kids'll blow your head off, just to say that they did it\nI'm in the streets one deep, these villains think that I'm slippin\nNah bruv, I don't care bout none of you spitters\nIf your real then your feelin' it\nNah, I don't give a shit\nRespect the message nigga, illa state records\nBritish flag, yard colours cause tell me where my\nHead is First time you saw me, iwas screamin' fuck the\nPolice' Next I came I change the whole game in the streets\nThese wollys still tryna' catch up with war, I\nBang harder, Father, 'roll wid us' huh, iain't even started...\n\n[Hook 1:]\nMoss side... stand up... Longside... stand up...\nHansworth... stand up... Aston... stand up\nNewtown... stand up... London... stand up\nAnywhere, everywhere all my people stand up\nSt.pauls... stand up... Chapeltown... stand up...\nLuton... stand up... London... stand up...\nAnywhere, everywhere all my people stand up! '\n\n[Verse 2: Akala]\nAll my tugs stand up, fist in the sky\nGirls too... hands high, now your chillin' with I\nMr.brazilian, so of course the womaen is feelin'him\nLyrics is brilliant, no question, illa state england\nI ain't watchin' the states neither, their whole\nShit's tired, All the great rappers is either dead or retired\nAll these soppy cunts, talkin' bout bitches n'\nBlunts, How much your chain cost, and you bustin' ya gun\nAnd you can't spit, your sticks, ya get hang a box in\nThe chops, Silly boys can't bang with me, fools can't hangwith me\nI dont really care unless it's paper or my family\nHome's this is the roads and there's only one\nStrategy, Though I hate my reality, it's just way it has to be\n\n[Hook 2:]\nCoventry... stand up bradford... stand up...\nWolftown... stand up... glasgow... stand up\nCardiff... stand up... London... stand up\nAnywhere everywhere, all my people stand up!\nDerby... stand up... Leicester... stand up...\nNewcastle stand up... Sheffield... stand up...\nBelfast... stand up... London... stand up\nAnywhere, everywhere, all my people stand up!\n\n[Verse 3: Akala]\nI talk alot, but idon't conversate with punks\nTry so hard to teach but ya man dem are dunce\nDon't learn when the shit happen\nBurn when the clap em\nThis is not a perm, but you worms get a relaxin'\nMy reaction, only in a street fashion\nI am not bulletproof- could get my melon\nSplattered, So I stay ready, spread positive energy\nBut I know full well couple prars wanna bury me\nNo reason, just cause, that's the negativity\nHow could you be a nigga-not feelin' my delivery?\nLyrically, my ability, rippin' up killa's viciously\nSpitter's that wanna mimic me\nStickin' them where the spirits be, huh\nPretty boy akala, move like a ape\nSkinny, but ipush plates, like I'm fresh off a 8\nAh mate, so you relly shoulk sty in ya lane\nOnly spitter on my level got the same last name", "year": null, "album": "It’s Not A Rumor", "image": "https://images.genius.com/715fae4666a7a92dab37c4e67a75dbb4.500x500x1.jpg"}], "artist": "Akala"}