{"artist": "Cashisclay", "songs": [{"title": "Dreiteiler", "album": "JMC 2016 - Qualifikationen", "year": "2016-03-11", "image": "https://images.genius.com/d23d0c41b69be397003848bd190c1f11.1000x1000x1.jpg", "lyrics": "[Part 1]\nIch lass mich einfach nicht stressen von eurer Eifersucht und dieses Jahr stellen mich weder ihr noch ich unter Leistungsdruck\nIch mein, ich mache Mukke und das Level ist recht hoch und keiner dieser JBB-Heads hat dieselbe Intention\nDann hat Gio mich halt 2x gefickt - na und?\nMeine Fans geben mich nicht auf wegen 'ner schlechten Produktion\nIhr seid was besseres gewohnt? Dann wartet dieses Jahr mal ab, es geht back to the roots, ich hab den Kindergarten satt\nVon allen Seiten hört man: \"Cash, du bist der Beste, den es gibt!\"\nDoch diese Leute sind dann weg, wenn sich was besseres ergibt\nKeine Favoritenrolle mehr, so what? Ich hab 'nen guten Flow und zieh das Ding dieses Jahr durch mit Jungs wie Lucky Studio\nMit Jungs, die bei mir waren, als ich noch nichts außer Talent hatte, damals waren 1.000 Klicks unsere Messlatte\nIch hätte nie gedacht, dass ich es soweit mal schaff'\nInteviews mit Staiger, Joel du hast mir das beigebracht\nHättst' du mir in der Zeit wo es nicht lief erzählt, ich spiele mal ein eigenes Konzert zu einem eigenen Release\nSteh mal mit Savas auf einer Bühne vor 2.000 Menschen\nWerd' bei \"Rap am Mittwoch\" bei der ersten Teilnahme Champion\nDass Leute meinen Namen kennen, mich in der Stadt nach Fotos fragen, Jungs wie Es mir Promo gaben, sagen \"Cash, dein Flow ist Wahnsinn!\"\nHätte ich dich ausgelacht\nDoch tief im Inneren hab' ich immer diesen Traum gehabt und bis jetzt etwas draus gemacht\n\n[Hook]\nUnd deswegen ist egal, was hier und heute irgendjemand von mir sagt\nIch mach immer noch das Gleiche\nHäng mit meinen Jungs statt mit Fans jeden Abend rum auf Untergrund-Jams\nUnd deswegen interessiert mich nicht, für was für ein Turnier das ist\nIch mach immer noch das Gleiche\nIch muss keinem beweisen, was ich draufhabe\nMukke aus dem Herz, stell niemals Technik über Aussage\n\n[Part 2]\nAußer wenn ich Bock hab, zu battlen Junge\nMeine Songs sind wie Dope, denn der Stoff macht am Block dann\nDirekt die Runde\nKomm halt mal die Fresse, denn ich klatsch mit dem Sound jeden Bastard zu Staub, meine Stadt frisst dich auf\nKomme wenn Nacht wird erst raus und mach mein Ding mit meinen Jungs\nNenn mich Punch Arogunz, denn ich bin blind durch meine Kunst\nUnd wenn ich dich nicht fick, dann fickt dich dein Karma, du Hundesohn\nMan deine Stimme ist nichts wert, wie bei Wahlmanipulation\nSpar dir deine Kommentare, ich bin immer noch die unerreichte Nummer 1\nIch schieß dir den Schädel weg, was für Mutterlines?\nMein Flow ist Kunst, du weißt, ich bums das Mic und jede Nutte schreit\nIch töte diese Kiddies, so wie Stiche in den Unterleib\nIch spitte hundert Zeilen und selbst dein bester Kumpel schweigt dann, weil es keine Konkurrenz gibt, wenn ich Punches um mich rum verteil'\nIch fick in jeder Disziplin, ich bringe alle um, die mir in die Quere kommen wie Heisenberg nach der Chemotherapie\nMein Label ist nicht real, doch was mein Labelboss verdient durch das Yayo das er dealt und durch den Rap, den er releast\nMachen wir Umsatz, den du Ficker in deinem Leben niemals siehst\nWenn du ankommst, merkst du letztendlich, der Weg ist nicht das Ziel\nIch hab Hunger, ich hab Blut geleckt, bring perversen Sound\nIch bin 21 Jahre alt und sehr schlecht gelaunt\nAlso wer kickt mich raus? Du Spaßt, versuch es  und du scheiterst dran\nIch zeig dieses Jahr, dass ich mich statt abzukacken steigern kann\n\n[Part 3]\nCash ist der King, wieder mal dabei Nummer 3 und jetzt spring\nTrotz meinem Deal bin ich immer noch hier zwar kein sickes Turnier, doch ich step in die Cypher und zeig es\nIch bin einer von der alten Garde, keine Maskerade, aber das ist meine Kampfansage, wenn ich Attentate auf die Lappen plane schlag ich sie rot, gelb, grün - Ampelfarbe!\nRapper drehen Disstracks in der Kathedrale aber wieso haben wir gebattlet brauchen Fotzen einen Friedhof\nWeil das, was ihr denkt mehr als die Wahrheit übertrifft\nIch bin keiner, der durch zwei Turniere Starallüren kriegt, doch bin flowlich auf 'nem Level, dass die Bengel auf der Strecke liegen lässt\nVerdammt, sie können mir nicht folgen, wenn ich rappe, weil ich Action mach!\nJetzt werden Fotzen vergewaltigt wie am Kölner Hauptbahnhof in der Silvesternacht\nUnd dieses Jahr geht es nicht darum, wer ein Battle gewinnt\nIch nehm die scheiße hier nicht ernst, so wie Ente als King\nFür mich ist jeder Gegner ein Spast, der den Bach runter geht so wie Mediakraft\nVegiss' die alte Leier, drück mal reset\nSie haben zum battlen keine Eier so wie P-Zak\nIch ficke den Penner durch die Gegend, bis er Blut scheißt\nTrotzdem nicht mal ansatzweise so, wie er's verdient hätte\nFronte meinen Bizeps, doch ich step alleine nach Berlin und ficke jeden, der sich traut, in seinem eigenen Kiez weg\nSchieß jetzt scharf (klick-klack-boom!)\nBester fucking Flow des Turniers, ich bin wieder da und ficke Rapper in den Mund so wie Kay im Glory Hole\nEure fucking Fans haten Cashis sowieso\nFronte mich auf deiner Platte, das bedeutet, du kleine Fotze bist nach dem Album so wie David Bowie tot (Let's go!)\nIch habe dieses Jahr nichts zu verlieren, bin entweder weg oder fick das Turnier\nEntweder tot oder endlich in Topform, wenn ich die gehyptesten Rapper blamier'\nIch nehm nichts vorweg, kein Egokomplex\nIch mach keine Ansagen, doch es wird dieses Jahr schwer mich zu schlagen, man geht euch begraben\nDenn Cashis zum motherfucking clay ist back!"}]}