{"artist": "King Los", "songs": [{"image": "https://images.genius.com/a9bc5b4fe746b1be8d76a46edd25590e.500x500x1.jpg", "title": "Control (Remix)", "year": "2012-11-01", "album": "Zero Gravity 2", "lyrics": "[Produced by No I.D]\n\n[Intro]\nUh, King, Zero!\nI got it\n\n[Verse 1]\nYou are now havin' your sandwich made\nWith extra mayonnaise, 808's, and a hand grenade\nCause any man could get played in my all in phase\nI mean my flow pass words like the log in page, ugh\nSee how my last words do?\nI put my log in your girl cause we past words too\nYour BM sent me a DM and you be chasin' that hooker\nYou steady stalkin' her Twitter, she gave me face when I booked her\nShe treat me like the Facebook logo, now that's a true slut\nIn other words, she f'in blew me cause I f'in blew up\nAcknowledge my knowledge is polished, cowards get power dropped\nMan my flow could make a suicide pilot apologize\nI'm piling guys in a pile, a pile of guys on they pals\nI silently swear I'll kill'em, I'm finalizing my vows\nI'm shitting on them, I’m vitalizing my bowels\nLike I took a vitamin, something vital lies in my bowels\nIm the truth times two, I ain't inviting lies you should bow\n(Paow, paow, paow) I'm taking shots in the dark\nWhile taking shots of the dog I'm taking shots at your thoughts\nYou can take these shots from a vet while I'm taking shots at your dogs\nThey gon' have to have me shackled and tackled at tabernacles\nWhile havin' my adam's apple detached in a baptist chapel\nAttacked by the fastest travelin' javelin'\nWhile attached to a dragon dragging a cage; these niggas gon' trap me\nAnd while I'm laughing, I'm lappin' 'em, they collapse as I'm passin' 'em\nMan I'm coming with the K, like they lackin' Potassium\nI'm Jordan from the free throw while every frame is in slow mo\nAnd every fan in the stands got they head in they hands like \"oh no\"\nSomebody get the promo, so somebody flick the photo\nAnd somebody stitch the logo, I'm bodying this shit bro bro\nGet it? You don't get it? My nigga, you gotta get it\nI'm bodying this shit, his logo had his whole body in it\nOh my Ice tea, coco, ice cube, vanilla ice\nTom Cruise and Vanilla Sky, tell these guys that I'm hella nice, right\nWhen I spit, it tear wind, the air bend\nI'm wicked son, these niggas buns like hair pins\nAmateurs, I scientifically handle bars\nAnd you just Jodie, putting bikes together in your man's garage\nDamn it dog, I fold this guy\nI ain't talking 'bout no rapper, I said \"fold the sky\" nigga\nIn half and disperse the worse grin\nAs I write a verse in reverse that reverses the earth spin\nYou worse than a scared nigga who popped the thing off then flee\nI got a flow that can lock in and knock the wings off a flea\nYeah I'm a King, I'm elite I could never dream of defeat\nI could Dr. King you a speech while I'm Rodney Kinging ya beat\nYou playing the victim nigga, I'm saying the vicious scriptures\nYou niggas is in denial like you bathe in Egyptian rivers\nI wrote this in Hieroglyphics, I'm focused and I am gifted\nI hope that I just provoked you to notice that I am different\nI feel so blessed I should mention, I pushed the depths of extension\nMuch higher my type of talent requires special attention\nKendrick I think you genius, J. Cole got these niggas worried\nBig K.R.I.T. is a southern killer, Wale is a visionary\nPusha been pushing so long he truly defines a hustler\nMeek did his time like a G, came back home and shined on them suckas\nA$AP mastered the facets of fashion\nSnatching the essence of brandin' his whole fam and a no man demanding a presence\nThis nigga Drake nice on the mic and act\nSo many hits he fucked around and brought light skin back\nAnd Big Sean you did it, you really did it, no bullshitting\nYou putting the D on I could see the future, no Warwick\nGet it? Dion Warwick, I went to war with critics like Jay Elec'\nI let him see my exhibit, get it? Exhibit C\nI exquisitely make a segue down to Tyler, my future's odd, I salute you dog\nMac Miller, young white boy track killer, gotta feel that\nI think real rap back, nigga\nKing..."}]}