{"songs": [{"year": null, "image": "https://images.genius.com/3abf8cda7c83c020b1b5de03f19eb19c.400x402x1.jpg", "title": "On My G", "album": "Separate But Equal", "lyrics": "[Intro: Rapper Big Pooh]\nYeah, yeah, Rapper\nUh, HOJ my nigga, yeah\nYes, and we do it like this\nTopshop\n\n[Hook: Rapper Big Pooh]\nUh, I'm on my G, on my G\nUh, what? I'm on my G, on my G\nNigga, yes, I'm on my G, on my G\nUh, yeah, I'm on my G, on my G\nUh, yeah, I'm on my G, on my G\nYes, yes, I'm on my G, on my G\nNigga, yeah, I'm on my G, on my G\nYeah, I'm on my G, on my G\n\n[Verse 1: Rapper Big Pooh]\nThree weeks out and it's two back in\nSporadic at that, niggas stay hustlin\nSix weeks out, HOJ's on the rizzoll\nThree weeks out, only thirty-one sizzold\nUh, I never break down and fizzle\nGod made Pooh out of a whole 'nother mizzold\nIt's old, stop askin me about BET\nMTV showin niggas love, homie that's that\nUh, I ain't gon' say it again\nEvery time we step out, I expect to win\nRapper Pooh on his G till the motherfuckin end\nPick up the phone, tell a muh'fuckin friend, nigga!\n\n[Hook: Rapper Big Pooh]\nUh, I'm on my G, on my G\nYeah, I'm on my G, on my G\nYo, I'm on my G, on my G\nYo, I'm on my G, on my G\n\n[Verse 2: Rapper Big Pooh]\nBlah, blah, blah, niggas talk like they want it\nBlah, blah, blah, niggas talk like they done it\nRun it, I know it's more money to get\nI'm at the bottom of the pole and I'm content with this shit, nigga!\nUh, I'm still honing my craft\nA lot of muh'fuckers hate, thank you for the laughs\nLukewarm, somebody's big ass\nDrunk off emotion, man up 'fore you crash\nLife's about what happens in your dash\nLive for tomorrow, no regrets for your past\nI'm on the floor, too close to bitch ass\nI ain't tryna talk bidness, fall back bitch ass\nYeah, I ain't gon' say it again\nEvery time we step out, I expect to win\nRapper Pooh on his G till the motherfuckin end\nSo pick up the phone, tell a muh'fuckin friend, nigga!\n\n[Hook: Rapper Big Pooh]\nUh, I'm on my G, on my G\nYeah, I'm on my G, on my G\nNigga, what? I'm on my G, on my G\nUh, yes, I'm on my G, on my G\n\n[Outro: Rapper Big Pooh]\nYeah, I'm my muh'fuckin G yo\nYeah, Big Dho starring the motherfuckin commissioner\nTopshop where we at nigga\nI got my nigga Doovie in this motherfucker\nC Sams, O-Dash, my nigga Young, nigga BJ, Uncle Joc\nYeah, I'm on my motherfuckin G nigga\nI don't care how many muh'fuckin records we sold nigga\nI don't care if we only sold five thousand records nigga\nI'ma keep comin in this muh'fuckin booth nigga\nI'ma keep spittin this shit nigga\nAnd I'ma make you LOVE me!\nYou gon' love me baby... Hahaha"}], "artist": "Rapper Big Pooh"}