{"songs": [{"year": "2017-10-27", "image": "https://images.genius.com/53ad7d35a112fd48e23a0737f5b0de05.1000x1000x1.jpg", "title": "Everlasting", "album": "4eva Is a Mighty Long Time", "lyrics": "[Intro]\nEverlasting\nIf this chemistry we got is everlastin'\n\n[Chorus]\nExcuse me shawty\nI saw you passin'\nHow 'bout we get stuck together like we off in traffic?\nEven if you ratchet or you plastic or classy\nI'm askin' if the chemistry we got is everlastin'\nIf the chemistry we got is everlastin'\nIf this chemistry we got is everlastin'\nIf this chemistry we got is, I'm just askin'\n\n[Verse 1]\nI know this sound like one of those love songs\nPerhaps it's on time since all the love's gone\nAnd we trap it out, trap it out, but you don't like hip hop\n'Cause you don't know what they rap about, nowadays I don't know either\nBut I ain't like most people\nI'ma hit you with that \"How you doin'? What you vibin' to and can I vibe with you?\nAnd if the world was filled with flowers surrounded by waterfalls\nAnd mountains despite the fact I just mentioned, can I lie with you?\"\nShit, we outside the club though\nAnd I'm knowin' what I'm sayin' make you wonder what I'm at the club for\nTo tell the truth I barely go out\nI know your homegirl, she kick it with my partner, I tagged along with 'em\nAnd they knew a friend that had a friend that I should meet\nShe don't like clubs, but she fall through sometimes just to see\nSo I'm guessin' that you her, it's just you and me\nLet's skip out on this waterhole and find a place to be\nIn peace\n\n[Chorus]\nExcuse me shawty\nI saw you passin'\nHow 'bout we get stuck together like we off in traffic?\nEven if you ratchet or you plastic or classy\nI'm asking if the chemistry we got is everlastin'\nIf the chemistry we got is everlastin'\nIf this chemistry we got is everlastin'\nIf this chemistry we got is, I'm just askin'\n\n[Verse 2]\nAyy, excuse me shawty, if you don't mind me\nPointing out the fact you're just my type\nI mean my type like when God broke the mold and designed you\nFrom head to toe He know I'd fall in love with ya at first sight\nI know that ain't no gangsta gangsta shit but I figured you hear\n\"I'm a hood nigga, fuck with me, damn you bad shawty\" all the time\nDon't get me wrong, that was me as a teenager\nBut I'm grown now and I think you deserve a better line\nBut not \"line\" like spit game, more like spiritual flames\nTo ignite the natural high that we all got\nI know your homegirl told you don't fuck with us country boys\n'Cause we players, but we all not\nNow I admit I ain't perfect but who is nowadays?\nA man can break your heart all sorts of kinda ways\nBut if you take my number down and hit me when you home\nI can promise you I ain't shit like Tyrone\nExcuse me shawty\n\n[Chorus]\nExcuse me shawty\nI saw you passin'\nHow 'bout we get stuck together like we off in traffic?\nEven if you ratchet or you plastic or classy\nI'm asking if the chemistry we got is everlastin'\nIf the chemistry we got is everlastin'\nIf this chemistry we got is everlastin\nIf this chemistry we got is, I'm just askin'\n\n[Bridge]\nExcuse me shawty\nExcuse me shawty\nExcuse me shawty\n\n[Chorus]\nExcuse me shawty\nI saw you passin'\nHow 'bout we get stuck together like we off in traffic?\nEven if you ratchet or you plastic or classy\nI'm askin' if the chemistry we got is everlastin'\nIf the chemistry we got is everlastin'\nIf this chemistry we got is everlastin'\nIf this chemistry we got is, I'm just askin'\n\n[Outro]\nExcuse me shawty (ahahahah!)"}], "artist": "Big K.R.I.T."}