{"songs": [{"album": "Hood Hop", "year": "2004-04-06", "title": "Hood Hop", "image": "https://images.genius.com/dc1e313d046fcee39f7241ff6abdcee0.600x600x1.jpg", "lyrics": "[Intro]\nAy world, this Streets 101\nI'm fin' to give you a half a pound of J-Kwon\nAnd a quarter bird of TrackBoy music\n\n[Hook]\nNow all my life (derty) I've been livin' (derty)\nAnd I'mma keep it (derty) until I'm gone (derty)\nSo where ya at? (derty) so where ya at? (derty)\nWhere they at derty? where they at derty?\n\n[Verse 1]\nThis the new improved Hood Hop\nI make erry mu'fucker in this bitch do the whop\nDerty run his mouth 'til the album drop (why's that?)\nTrackBoy beat like a freak, work a king on the block\nI'm seventeen, name ain't same on the block\nAnd beat and knock the nigga out his frame on the block\nAnd he'll come through and let rang on the block\nAnd all they got to say is it's a shame on the block\nI'm hot HOMEBOY! don't ever get it twisted\nNumber's unlisted, stayed in 3rd district\nFor real, I'm ready to get naughty\nBest of both worlds so, hey shawty!\nShow me the party, and I'll show you the coke\nI can show you my dick, you can show me your throat\nIf a nigga trip-trip then we'll show him the fo'\nIf his niggas run up to you, we'll show him so mo'\n\n[Hook] - x2\nNow all my life (derty) I've been livin' (derty)\nAnd I'mma keep it (derty) until I'm gone (derty)\nSo where ya at? (derty) so where ya at? (derty)\nWhere they at derty? where they at derty?\n\n[Verse 2]\nNow I wish a nigga would run up like that\nWhen I put that on the hood, I'mma strike back\nAnd niggas talk shit, but I don't like that\nSayin' I don't like G, but I ain't write that\nAnd baby mamas mad they ain't 'bout shit\nBasically what I'm sayin dude, fuck a bitch\nAnd if I had two, I'd touch a bitch\nIn the same breath turn around and touch ya clique\nAnd nigga if I said then I fuckin' meant it\nAnd nigga if it's rented I ain't fuckin' in it\nTrackBoyz give me money so I fuckin' spend it\nY'all roll Sprewells but not the authentics\nAnd fuck ya-fuck ya fo' and ya roof clown\nI got shit that'll turn ya fuckin' Coupe 'round (*gun cocking*)\nYou ain't heard? I'm the truth now\nMatter fact, hook gon' break it down\nBreak it down\n\n[Hook] - x2\nNow all my life (derty) I've been livin' (derty)\nAnd I'mma keep it (derty) until I'm gone (derty)\nSo where ya at? (derty) so where ya at? (derty)\nWhere they at derty? where they at derty?\n\n[Verse 3]\nDogg it's a mystery..\nHow we drop one single, left the game now the whole world miss me\nFreak this bitch like homegirl Missy\nLike I'm sellin' liqour, got the whole world \"Tipsy\"\nSick and tired of old g's tryin' to gip me\nSo I put a lump in his shit, like a hickey\nAll I say to them is, \"Dude come get me\"\nWatch 'em catch a crude desire, like a gypsy\nFunny how I can't loc in public\nSmoke in public, girl even joke in public\nGot dough, so that's why I'm so republic\nCops hit the do', I start actin' so republic\nI had a set, they actin' like I had a brick or more\nSo you got snitched on by the carni-whore\nShow-Off or show ass what these guns are for\nOr let the priest show her mom what these nuns are for\n\n[Hook] - x2\nNow all my life (derty) I've been livin' (derty)\nAnd I'mma keep it (derty) until I'm gone (derty)\nSo where ya at? (derty) so where ya at? (derty)\nWhere they at derty? where they at derty?"}], "artist": "J-Kwon"}