{"songs": [{"title": "On Your Marks", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nHa, yeah\nBrandUn DeShay\nVolume: Two! For the Show\nListen\n\n[Verse 1: brandUn DeShay]\nThe dough I don’t got don’t mean squat like the Heisman\nNo violence to violins\nHowdy-do? How are you? How high are you? I’m high as the stratosphere\nObviously the baddest here, this beat is a battlefield\nAnd I’ve been praying for containment, how insane my brain gets\nIt’s more than entertainment like Cedric\nBeen doing everything a little bigger like Texas\nAnd now I watch the pieces fall in place like Tetris\nAnd now I watched you niggas fall from grace like [?]\nAnd watched the stock plummet and watched you rise from it\nThe phoenix from the ashes, the teacher for the classes\nThe preacher for the masses, so lead them for the classless\nAli before the Cassius Clay, the champ without the belt\nI made it to the ring with no help\nExcuse me, you don’t got to choose me to win the title fight\nBut I’m gonna wear that championship belt so tight, damn right\n\n[Chorus (2x): brandUn DeShay]\nI’m finna go like the starting line\nLet me show you looking at a star like a starting sign\nLow-go, hold on, hold on\nGot a hold on them, they can’t hold on\n\n[Verse 2: brandUn DeShay]\nI’m next door like Mr. Feeny\nHoping that my skills open doors like Lamborghinis\nHoping to put my foot in the door, these niggas see me\nProps to my moms and my pops and cousin Benny\n‘Cause ever since a nigga was young and still teeny\nLike everything they wished I’d become like I’m Jeannie\nY’all, you should’ve seen me at the Grammy’s\nOnly one album and the outcome? They was running out of awards that they can hand me\nIf that was called a dream, I live my life in jammies\n‘Cause right now, no Super Bowl rings, my downs hand-me\nSo many thoughts run through my mind, I pulled a handy\nAnd just as you guessed, I’m fresh, I pulled a Mannie\nDamn, he done grown up so much\nUsed to didn’t cuss so much, but so what\nThese other rappers never switched gears, they so huff\nI’m introducing who, where, when, and why ‘cause y’all know what\n\n[Chorus (2x)]", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}