{"songs": [{"title": "Hunter Killa", "image": "https://images.genius.com/8f7829876d0c155eef8d08c3e58b6fa8.500x500x1.jpg", "lyrics": "[Lynch]\nIt's the Hunta Killer, off of the 9 skrilla\nWit’ my napsack full’a pill’a\nNigga worse than the movie Thrilla and real’a\n‘Cause this is real life (That's right)\nI saw that nigga get his head tore off (By who?)\nBy the same nigga that took his wife\nYou know I come nutty stingin’ like syphilis\nYou can get your liver split\nBy your own bitch fuckin’ with this\nStay drunk when I dip and clips ain't shit\nI got vast amount\nYour ass could count ‘em\nWhen I'm shootin’ ‘em down your bitch's mouth\n(‘Cause this the) Hunter Killer deal a lot and fuck in them shit shoes\n(With the what?) With the nine and watchin’ a bloody nut come out every time\nAnd you know it's mine\nWhen I come through loomin’ with the MK-1\nAnd when they done, they lookin’ like sushi (Raw!)\nWith the Uzi, I get the shit done\nYou know it's like Velcro or Poly-Grip\nI stick to the shit that’ll make you nut up with your dome split\nI want you to trip\nAnd I'll be sittin’ right there wit’ the casket (You know!)\nYou was in the wrong place at the right time then you got blasted\n(You hoe!) Hunta Killer and black Mac-10 in the trunk with the slump\nI hug it like mama\nWhen I use it, it gotta be because I be off that juicy shit\nNot used to it, I'm addicted to the siccness\nMight flip this nigga shit frequently\nThem young G's, they wanna speak to me\n(But what?) But they don't need to be\nI'll have they hat quick, with no practice\nPut you in the trunk with the slump, stickin’ ‘em like a cactus\nAnd I'm concentratin’ on stackin’ grip\nI gotsta hit you with the slug, no love\nBitch ass nigga, you know, it's Hunter Killa (That's real’a)\n\n\n[Chorus]\nPut you in duct tape and leave you sinkin’ in the river\n(Hunter Killa! Killa! Killa! Killa!)\nPut you in duct tape and leave you sinkin’ in the river\n(Hunter Killa! Killa! Killa! Killa!)\nPut you in duct tape and leave you sinkin’ in the river\n(Hunter Killa! Killa! Killa! Killa!)\nPut you in duct tape! Put you in duct tape!", "year": "2014-10-07", "album": "The Suicide Tour (10 Years Later)"}], "artist": "Brotha Lynch Hung"}