{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Welcome to the Terrordome", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "[Intro: Talking]\n(*voice being scratched*)\nIn a time when we're spending billions of dollars\nIn a war to control oil in Iraq\nThree-thousand soldiers have come home in coffins\nHundreds of thousands of Iraq civilians have lost their lives\nOur brothers and sisters in New Orleans\nAre left homeless and hungry\nThey murdered Sean Bell\nThey murdered Amadou Diallo\nThey murdered Timothy Stansbury\nAnd it's time to say no more!\nNo more! No more! No more! No more!\n\n[Verse 1: Pharoahe Monch]\nI got so much trouble on my mind, refuse to lose\nHere's your ticket (uh), hear the drummer get wicked\nThe crew to you to push the back to black\nAttack so I sat and japped, then slapped the Mac\nNow I'm ready to mic it (huh)\nHear my favoritism roll, \"Oh\"\nNever be a brother like me go solo\nLazer, Anastasia, maze ya\nWays to blaze your brain and train ya\nThe way I'm livin, forgiven, what I'm givin up\nX on the flex (hear me now)\nI don't know about later\nAs for now, I know how to avoid the paranoid\nMan I've had it up to here\nGear I wear got 'em goin in fear\nRhetoric said, it read just a bit ago\nNot quittin', it signed the hard rhymer\nWork to keep from gettin jerked'\nChangin' some ways, to way back in the better days\nRaw, metaphysically bold, never follow the code\nStill dropped a load\nNever question what I am, God knows\n'Cause it's comin' from the heart\nWhat I got, better get some (um hum)\nHustler of culture\nSnakebitten, been spit in the face\nBut the rhymes keep fittin'\nRespects been givin', how's ya livin'?\nNow I can't protect a pad off the defect\nCheck the record of reckon\nAn international wreck played off as some intellect\nMade the call, took the fall, broke the laws\nNot my fault that they're fallin off\nKnown as fair square, throughout my years\nSo I growl at the livin' foul\nBlack to the bone, my home is your home\nSo welcome to the Terrordome\n\n[Chorus]\nCome on down (get down)\nYou can get it, get it, get it, get it\nCome on down\nYou can get it, get it, get it, get it\nGet down\nYou can get it, get it, get it, get it\n\n[Verse 2: Pharoahe Monch]\nThere's a hole in an apple, an apple has been rotten\nScheme like the Klan, I plan like Bin Laden\nSupreme, screen writer, slick, street editor\nDrop the LP, and he hit like Hezbollah\nSeven years later, it's the year of the Gods\nUnited States government is just a facade\nThe Catholic Church got ties with the Mob\nI see it all like \"The Wizard of Oz\"\nNow there's a Yellow Brick Road, the fame, riches and cars\nIf you only had a brain, you would know who you are\nPoison your ventilation, cut your education\nSecret information, world domination\nTake over reservations, trigger the energies\nIn the oceans for tsunamis to control the population\nEyes in the sky, hidden observation\nIf you're over 65, they'll take away your medication\nLike, give me that (give me that), fall in line (fall in line)\nGo to war (go to war), press rewind\n'Cause when I get mad, I put it down on the pad\nGive you somethin' that you never had\nControllin', fear of high rollin'\nGod bless your soul and keep livin'\nBlack to the bone, my home is your home\nWell, welcome to the Terrordome\n\n[Chorus]\nCome on down (get down)\nYou can get it, get it, get it, get it\nCome on down\nYou can get it, get it, get it, get it\nYou can get it, get it, get it, get it", "year": "2007-06-26"}]}