{"songs": [{"title": "John Snow", "album": "Big Buckz", "year": "2016-07-22", "image": "https://images.genius.com/3d2f4f5ddd6abaf892ba3456348db2e3.500x500x1.jpg", "lyrics": "[Intro]\n(The lord let you come back for a reason)\nThey think you are some kind of god. It's completely fucking mad, it seems to me. I can only imagine how it seems to you. The man who returned from the dead\n\n[Verse]\nI got 'em like damn, who is that boy from the 'Go\nHe steady switchin' his flow\nPull up the show, he rockin' all of this gold\nWhy is he soundin' so old?\nNobody knows, nobody knows\nTold 'em fuck all of these clothes, just give me the dough\nI just been stackin' this print like the Jon is comin'\nI'm in Chiraq coolin', countin' hundreds\nLike Rob who? Boy don't no dummy\nPlease don't run up on 'em, keep a gun up on 'em\nLike bah-bah-bah, 30 on me, I'll murder homie\nYou prolly shoulda been a good friend\nNow it's blood on my new Timbs\nI be with killers like fuck a security\nShots to the buster's security\nThuggin', I hang with my brother cause that nigga love me\nWe gettin' somethin', I know I ain't comin'\nI know he ain't runnin'\nHe just let off 100 if I say let off 100\nAnd I put loyalty way before royalty\nLove for my niggas is right under money\nI stay in the city and I ride dolo\nCruisin' the streets and it's just me and .44\nKeepin' it low-low\nMy nigga got caught with some dope and I think that he work for the po-po\nI'm still in the street\nDressed in all black with my niggas, I'm tryna get ready to beef\nRemember them nights I didn't even eat, trapped in the snow and I can't feel my feet\nThey calling me Bibby the King, please stop with the memes\nThese niggas think it's a joke, we totin' Glocks with the beams\nThese niggas act like they real, but they are not what they seem\nThese niggas dying their dreads, tell me what's wrong with they heads?\nMy flow Notorious, I hang with warriors\nYou don't want war with us, nah\nYou wanna go with us, go ahead and blow with us\nWe gon' come back doin' fine\nFine-fine-fine, and I put that on Allah\nYou little niggas shouldn't even try\nIt's guaranteed niggas'll die\nYeah I'm a crack baby, I'm bout to go crazy\nThe industry made me insane\nI hang with lucifer, we'll come shoot at ya\nBitch I will die for my gang\nCan you help me find me a brain\nI cannot remember my name\nI think I done lost it\nI don't what they call me but you can just call me the king"}], "artist": "Lil Bibby"}