{"artist": "Vanilla Ice", "songs": [{"title": "Ice Ice Baby (Rock Hero mix)", "year": "2008-11-04", "lyrics": "Yo, VIP, let's kick it\n\nIce Ice Baby\nIce Ice Baby\n\nAlright stop, collaborate and listen\nIce is back with my brand new invention\nSomething grabs a hold of me tightly\nFlow like a harpoon daily and nightly\n\nWill it ever stop? Yo, I don't know\nTurn off the lights and I'll glow\nTo the extreme I rock a mic like a vandal\nLight up a stage and wax a chump like a candle\n\nDance! Go rush the speaker that booms\nI'm killin' your brain like a poisonous mushroom\nDeadly when I play a dope melody\nAnything less than the best is a felony\n\nLove it or leave it, you better gain way\nYou better hit bullseye, the kid don't play\nIf there was a problem, yo, I'll solve it\nCheck out the hook while my DJ revolves it\n\nIce Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla)\n\nNow that the party is jumping\nWith the bass kicked in and the Vegas are pumpin'\nQuick to the point, to the point no faking\nI'm cooking MCs like a pound of bacon\n\nBurning 'em if they're not quick and nimble\nI go crazy when I hear a cymbal\nAnd a hi-hat with a souped up tempo\nI'm on a roll, it's time to go solo\n\nRollin' in my 5.0\nWith my ragtop down so my hair can blow\nThe girlies on standby waving just to say, \"hi,\"\nDid you stop? No, I just drove by\n\nKept on pursuing to the next stop\nI busted a left and I'm heading to the next block\nThat block was dead, yo\nSo, I continued to A1A Beachfront Avenue\n\nGirls were hot, wearing less than bikinis\nRockman lovers driving Lamborghinis\nJealous, 'cause I'm out getting mine\nShay with a gauge and Vanilla with a nine\n\nReady for the chumps on the wall\nThe chumps are acting ill because they full of eight ball\nGunshots ranged out like a bell\nI grabbed my nine, all I heard were shells\n\nFallin' on the concrete real fast\nJumped in my car, slammed on the gas\nBumper to bumper, the avenue's packed\nI'm tryin' to get away before the jackers jack\n\nPolice on the scene, you know what I mean?\nThey passed me up, confronted all the dope fiends\nIf there was a problem, yo, I'll solve it\nCheck out the hook while my DJ revolves it\n\nIce Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice Ice Baby\n\nTake heed, 'cause I'm a lyrical poet\nMiami's on the scene, just in case you didn't know it\nMy town that created all the bass sound\nEnough to shake and kick holes in the ground\n\n'Cause my style's like a chemical spill\nFeasible rhymes that you can vision and feel\nConducted and formed, this is a hell of a concept\nWe make it hype and you want to step with this\n\nShay plays on the fade, slice like a ninja\nCut like a razor blade\nSo fast, other DJs say, \"Damn\"\nIf my rhyme was a drug, I'd sell it by the gram\n\nKeep my composure when it's time to get loose\nMagnetized by the mic while I kick my juice\nIf there was a problem, yo, I'll solve it\nCheck out the hook while D-Shay revolves it\n\nIce Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice Ice Baby\n(Vanilla) Ice\n\nYo man, let's get out of here\nWord to your mother\n\nIce Ice Baby too cold\nIce Ice Baby too cold, too cold\nIce Ice Baby too cold, too cold\nIce Ice Baby too cold, too cold", "album": "Vanilla Ice Is Back! Hip Hop Classics", "image": "https://images.genius.com/52230e2ad7ccc013debc125e787a1a6e.525x525x1.jpg"}]}