{"songs": [{"image": "https://images.genius.com/15a79e9b319ecd94a9131a5bc8bbd010.1000x1000x1.jpg", "title": "Barbie Dreams", "album": "Queen (Bonus Version)", "year": "2018-08-10", "lyrics": "[Intro]\nUh, mmm, kyuh\nR.I.P. to B.I.G. \nClassic shit\n\n[Verse 1]\nI'm lookin' for a nigga to give some babies\nA handful of Weezy, sprinkle of Dave East\nMan, I ain't got no type like Jxmmi and Swae Lees\nBut if he can't fuck three times a night, peace!\nI tried to fuck 50 for a powerful hour\nBut all that nigga wanna do is talk Power for hours\nB-beat the pussy up, make sure it's a K-O\nStep your banks up like you're movin' that yayo\nSomebody go and make sure Karrueche okay, though\nI heard she think I'm tryna give the coochie to Quavo\nThey always wanna beat it up, goon up the pussy\nMan, maybe I should let him autotune up the pussy\nAll these Bow Wow Challenge niggas lyin' and shit\nMan, these Fetty Wap niggas stay eyein' my shit\nDrake worth a hundred mill, he always buyin' me shit\nBut I don't know if the pussy wet or if he cryin' and shit\nMeek still be in my DMs, I be havin' to duck him\n\"I used to pray for times like this\" face-ass when I fuck him\nMan, Uzi is my baby, he ain't takin' a L\nBut he took it literally when I said \"Go to hell\"\nUsed to fuck with Young Thug, I ain't addressin' this shit\nC-caught him in my dressing room, stealin' dresses and shit\nI used to give this nigga with a lisp tests and shit\nHow you want the pu-thy? Can't say your S's and shit, uh\n\n[Chorus]\nDreams of fuckin' one of these little rappers\nI'm just playin', but I'm sayin' (Barbie dreams)\nDreams of fuckin' one of these little rappers\nI'm just playin', but I'm sayin' (B-B-B-Barbie dreams)\nDreams of fuckin' one of these little rappers\nI'm just playin', but I'm sayin' (B-B-B-Barbie, B-B-B-Barbie dreams)\nDreams of fuckin' one of these little rappers (Barbie dreams)\nI'm just playin', but I'm sayin'\n\n[Verse 2]\nI remember when I used to have a crush on Special Ed\nShoutout Desiigner 'cause he made it out of special ed\nYou wanna fuck me, you gotta give some special head\n'Cause this pussy have these niggas on some special meds\nLike Mike Tyson, he was bitin' my shit\nTalkin' 'bout, \"Yo, why you got these niggas fightin' and shit?\"\nOn the, on the real, I should make these niggas scrap for the pussy\nYoung M.A and Lady Luck, get the strap for this pussy, uh\nAnd I woulda had Odell Beckham bangin' the cake\n'Til I saw him hoppin' out of cars dancin' to Drake\nI been a five-star bitch, man, word to Gotti\nI'ma do that nigga Future dirty, word to Scottie\nHad to cancel DJ Khaled, boy, we ain't speakin'\nAin't no fat nigga tellin' me what he ain't eatin'\nYG and The Game with the hammer yellin', \"Gang! Gang!\"\nThis ain’t what I meant when I said a gang bang\nTekashi want a ménage, I said \"tre-way\"\nCurved him and went the Kim and Kanye way\nEm, cop the Barbie Dreamhouse, then you can play the part\nI-I ain't tryna bust it open in a trailer park\n\n[Chorus]\nDreams of fuckin' one of these little rappers\nI'm just playin', but I'm sayin' (Barbie dreams)\nDreams of fuckin' one of these little rappers\nI'm just playin', but I'm sayin' (B-B-B-Barbie dreams)\nDreams of fuckin' one of these little rappers\nI'm just playin', but I'm sayin' (B-B-B-Barbie, B-B-B-Barbie dreams)\nDreams of fuckin' one of these little rappers (Barbie dreams)\nI'm just playin', but I'm sayin' (B-B-B-Barbie dreams)\n(Barbie Dreams)\nI'm just playin', but I'm sayin' (B-B-B-Barbie, B-B-B-Barbie dreams)\n\n[Verse 3]\nYou know I'm all 'bout them dollars\nI be supportin' them scholars\nI let him give me some brain, but he wanted me to ride it\nSo I said, \"Fuck it, I'm in\"\nHe wanna cut like a trim\nAnd if he act like he know, I let him fuck it again\nI got them bars, I'm indicted\nI'm poppin', I'm uninvited\nI said, \"Just lick on the clitoris, nigga, don't fuckin' bite it\"\nI ride his **** in a circle\nI turn Stefan into Urkel\nI go arounds and arounds and I'ma go down in slow motion\nThe-then I pick it up, look at it\nI said, \"Daddy, come get at it,\" uh\nYellow brick road, he said that I am a wiz at it\nYeah, they want it, want it\nYou know I flaunt it, flaunt it\nI'm a trendsetter, everything I do, they do\nYeah, I put 'em up on it, on it\n¡Dimelo, papi, papi!\nYo quiero sloppy, sloppy\nI'll give it to you if you beat it up like Pacqui, Pacqui\nI-I-I-I'ma kill 'em with the shoe\nNo ceiling is in the roof\nAnd I'm big, give me the loot\n12 cylinders in the coupe\nI get dome with the chrome, no tellin' when I'ma shoot\nI just bang, bang, bang, real killas is in my group\nGorillas is in my unit, vacationin' where it's humid\nAnd I shine, shine, shine, got diamonds all in my cubans\nI'm in LA Times more than when niggas lootin'\nAnd my flow spit crack, I think that nigga usin'\nHe done bodied everybody, in closing, these bitches losin'\nUsin', usin' up, a bitch movin'\nNo, I ain't stuttered and no, I ain't Ruben\nDamn, a bitch snoozin'\nShoutout to my Jews, l'chaim, Rick Rubin\nBig fat titties, yes, they be protrudin'\nI be like, fuck 'em, fuck 'em, bring the lube in\nI be like, fuck 'em, fuck 'em, bring the lube in"}], "artist": "Nicki Minaj"}