{"songs": [{"album": "E.B.A.H.", "image": "https://images.genius.com/ecaf59e8351d366bc86005cc66afe532.800x800x1.jpg", "year": "2012-09-04", "title": "E.B.A.H.", "lyrics": "[Intro: Tech N9ne]\nI'm hella mixed up, yes, I know\nA lot of good and bad stuff as I grow\nSo now that I gotta live life when I'm both all I can say\n\n[Hook: Tech N9ne]\nWhat's my name? EBAH!\n[Shout]\nEBAH! (Come on)\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart!\n\n[Verse 1: Tech N9ne]\nFucking right, I'm a maniac and I'm loving it\nCall me anything but my motherfucking government\nI can love a bit, no, a big my love'll get\nBut in my brain I stay insane and I'm always on some other shit!\nReally wanna fuck a bitch, E.B. can't get enough of this\nSee me take what I stuck her with then I gotta run and give it to another chick\nGutter trick, suck a dick! State the texture of a brick\nMaking them Magnum rubbers split, what a prick, the brother's sick!\nNow back to my love, like to go there\nEven when it's annoying like long nose hair\nI can so share my heart in the cold air\nAnd it's no fair, the size of it is so rare\nBloody murder, muddy word of wretched death rhymes\nTake me light and my darkness will take your breath time\nCall me Chakra-tease or you can call me Tech N9ne\nBut since I found my new sinister out of respect I'm\n\n[Hook: Tech N9ne]\nWhat's my name?\nWhat's my name?\nWhat's my name?\nEBAH!\nWhat's my name?\nWhat's my name?\nEBAH!\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart\n\n[Verse 2: Tech N9ne]\nLiberate me, Lord\nI'm an angel and on this wicked planet nobody understands my angle is love\nI was sent from above, but I've landed in blood\nPsycho bandit, I've become a frightful damage and scuffed\nMissile you Mitchells are misinformed and mixed in the middle of my menace\nMurderous, Michael Myers' my mimic\nMom, you made a monster, I'm making minions in minutes\nMoney motivated mishap asmodeus monikers mended\nFeel like I'm on Molly, heart as big as my body\nWhen a hottie gets naughty, it's racing like a Ferrari\nMy obese heart swelling when it beats hard, telling me\nTo freak, not willing, like a beast, I'm yelling\nBloody murder, muddy word of wretched death rhymes\nTake me light and my darkness will take your breath time\nCall me chakra-tease or you can call me Tech N9ne\nBut since I found my new sinister out of respect I'm\n\n[Hook: Tech N9ne]\nWhat's my name?\nWhat's my name?\nEBAH!\nWhat's my name\nWhat's my name?\nEBAH!\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart\n\n[Verse 3: Tech N9ne]\nMy heart, smell like, vanilla icing\nIf slicing my chest open, a light beam of nice things\nOf Christ brings bright wings, placement from thy king\nNight seems, right around the corner in my dreams\nHorse﻿ shit, piss and human puke is this smell\nTo whom ever wondered my level, this is hell\nInside my crown I kill a gangster with fecies pig tail\nAnd I'll live 137 years like Ishmael\nYeah.. Nigga, it ain't misspelled\nE.B.A.H, there go creepy A. Yates\nUsing women as a bait, and they face, fishscale!\nJust another nut, all the others suck\nSweet as a buttercup and fake as a rubber duck\nEvil brain, angel heart, yes, I utter much\nAnd I never cover up, why? (I'm a Klusterfuk)\n\n[Hook: Tech N9ne]\nWhat's my name? EBAH!\nWhat's my name? EBAH!\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart\nEvil brain, angel heart"}], "artist": "Tech N9ne"}