{"songs": [{"image": "https://images.genius.com/6f471260c250f7c51a326a58c2e2db7f.313x312x1.jpg", "lyrics": "[Verse 1]\nYo, yellow cheese, eggs, white pancake batter\nPut a little bit up on the skillet\nWhen it starts to bubble, flip it over with your spatula\nYeah, yeah, that shit look like my breakfast\nI gotta remember to flip the motherfucker over\nAfter cookin’ it for 30 seconds\nLadies love me; I got my OJ\nEverybody said to do another fast rap to this beat\nSo I said “Okay.”\nBut I’ma speed it up real, real, real fast\n‘Til the whole damn bottle is gone\nAnd I’m challenging Busta, Watsky and Twista\nAny of you rap kids, follow along! C'mon!\n\n[Hook]\nCook with me now, unh!\nCook with me now, unh! Unh!\nI’m making pancakes\nCook with me now, unh!\nCook with me now, unh! Unh!\n\n[Verse 2]\nFresher than a muh'fucka\nChris Brown broke up with Rihanna\nSo he’s lookin’ for another silly idiotic ho that he can beat up\nI wish that he was man enough to get inside the octagon\nI'd kick him in the noggin, like I’m Lyoto Machida\nFront kick to the face just by me throwin’ my feet up\nWinkin’ at Rihanna, \"Baby, please show us your D-cups!\"\nI’m givin’ it to the man, the cakes are stickin’ right to the pan\nYour fate is imminent, I’ma diminish it\nGot the weed to smoke to re-up\nIt’s done, that’s done, that cake is done!\n\n[Verse 3]\nLet’s go! Gotta butter up another one\nAnd put it on the skillet, couple minutes ‘til it’s done-done\nAin’t nobody fuckin’ with this kid\nSo tell Jerry Sandusky I’m gonna kill him with a stun gun\nCome-come get a-get a-get a-get a crumb\nHit a spitta with a fit of venom when I split a drum\nTake another visit in a minute\nWhere the menaces to the society is In-A-Gadda-Da-Vida\nYou're Danny Devito when I belittle, literally it’ll better you\nBattling anybody with a better view ahead of you\nLike bitter batter-batter I’ma hit you with an auto mo' battery\nBada-bing, bada-bada-boom, boom!\nI’m the king, better get a clue\nGet offended when I’m sentimental and I spit at you\nI’m thinkin’ about my rhythm, it's dope and much better\nThese rappers think they’re animals; nope, it's Chuck Testa\nGotta get up, the economy's a little brutal to me\nThe dichotomy ain't suitable\nI gotta go to Pluto for a little bit of comedy\nOr something beautiful\nThere's nothing beautiful about this world\nI'm gonna pucker up my lips to barf\nGonna choke a fuckin’ rapper in his hipster scarf\nI’m never gonna put another piece of music out deliberately\nIf it isn't genuine and grips the heart\nWinter’s hard, so have some pancakes!\n\n[Outro]\nMade by me, motherfucker!\nThe Chael Sonnen of rap music\nEnjoy your breakfast!\nMac Lethal, biatch!", "year": "2011-11-30", "album": "YouTube", "title": "Nerdy White Kid Kills Look At Me Now"}], "artist": "Mac Lethal"}