{"songs": [{"image": "https://images.genius.com/ec460ab317d45b37a52a3fbfe238e5d8.304x304x1.jpg", "lyrics": "[Intro: Desert Eagle]\n(Tell me... tell me...)\nWhat would you do? Hillside Scramblers\nLoose links, what would you?\nUh, check it, yo, yo, yo\n\n[Desert Eagle]\nI'm down for the get down, down wanna spit rounds\nHe started the beef, now, wanna split town\nWith the mark of the beast, thinkin' you the shit now\nFour pound whippin' the flesh, better sit it down\nGet it clown? You done started something\nI put it down, and you just started hustlin'\nGettin' thirty off of a bundle, you project nothing\nYou'll get linked in a rumble, you project frontin'\nCatch beef in the J's, it's project dumping\nTest your heat when it blaze, better target something\nEven my dick iced out, I be hard at fucking\nNiggas need to stop biting and try to market something\nNiggas need to start writing, your bark ain't nothing\nYour tracks ain't hot, and your back don't function\nGot the rap game locked, the crack game dumping\nGot the crime scene hot, the club scene thumping, what?\n\n[Chorus: Letha Face]\nTell me: what would you do?\nIf you was in my shoes and the nigga had the drop\nWould you shoot first? Or get shot?\nOr lift the earth from under his feet and make his boots rock\nTell me..\n\n[Letha Face]\nI can't stand it, people try to judge me\nEspecially the ones that said they love me, try to take me for granted\nI been stranded with a mental block, sippin' expensive shots is hot\nI could kiss the man who invented the Glock\nThe thermometer pops burger, I stay on cock\nSo whenever my dogs call me, I'll be there, the end of story\nSurrenders gory, close the book after the final chapter\nGradual bullets that travel faster than yacht masters\nHot ratchets that'll spin you, like a spinning top backwards\nCut your cabbage and turn it into coleslaw\nI'm so raw, that my mom should of middle named me Diesel\nThese lethal bars perfected, can't be injected by needles\nBreeding eagles out of Park Hill's hell hole\nWhere souls get sucked up, and shots turn your bones to Jell-o\nMellow tones with a stealth blow, under the bell's a four-four\nThe impact will crack an elephant's skull\n\n[Chorus 2X]\n\n[INF-Black]\nI'm like the hallways you walk through, smokin' a blunt with a brew\nThe staircase you piss on, gettin' head on the roof\nRide down my elevator, you get punched in the tooth\nMy alligators hang loose from the front to the phone booth\nI'm the concrete, the gates, the bars, gunnin' my goof\nI'm the drugs, the money, the booze, and every rules\nFuckin' Betty who? Niggas is petty, can get it to\nWatch your mouth nigga, watch me, watch you\nLike a movie, thought it was cool, how you wanted to do me\nSee me live with the snakes and get rid of them rats\nI'm the fire in the lake, I burn faster than a match\nBut longer in a forest, at the speed of a mach\nSpittin' out, bangin' off ground, I'm tearin' it down\nThere's never no fear in me, and they tellin' what's in me now\nI've done tasted the dust, washed my face with the mud\nOff with these clowns, my shoes is only made from my blood\n\n[Chorus]", "title": "Tell Me", "year": null, "album": null}], "artist": "U-God"}