{"songs": [{"lyrics": "[Sample]\nSeven years old and he's dying of old age!\nAnd I don't give a fuck about any of you limp bizkit funny boys!\n\n[Intro]\nI was on some all in together\nWhether whore, whether beggar\nWhether rat or weathered leper\nCome and cut this edge a second\nWe could build a better network\nWithout all the yes sir, yes sir\n\n[Verse]\nPost cannons up\nPull the pulse up outcha mans and what\nDick and Jane escape into the arcane where the phantoms fuck\nItchy skin he sits inside shifty village snitching\nGrin and gargle when they argue happy\nAre you happy? Sit and spin (sink or swim)\nHe kick his fins and wave his bony arms around\nFor guards who beg your pardon\nWhile the arson burns your harvest down\nWhat a darling town\nWhat a snarling partridge farm\nThe bars are like a car with clowns\nThe parks are like a garbage barge\nBut still it was our parthenon\nWe part to train tomorrows argonauts and archers\nWith lungs that match their markers\nLike army parkas marching\nThrough the marsh with buzzing sparklers\nTo carve apart the harpies\nAnd disarm the budding marksmen\nAre you charged up?\nThis be the trench foot kicking\nThrough the ten cook kitchen\nSpoiled beef and chicken\nWe gobbled up the chemical in heaps, in new relief\nWas thirty minutes past\nThe chalky tablets melting in our teeth\nA dagger in the back became a fad to swagger jack\nWith no medicinal maggots to lap the gashes aftermath\nThese are the crazers of the Benadryl nation\nThat'll steal the very bacon\nOff your plate, thats so raven\nBeen jittery killer-the artillery parties\nLit up like symphony of pretty Ataris\nFitting the knitting needle splintered through the kewpie\nDuke(?)\nI speak in a dead language New York is hollerin' through me\nNote the lazy foe be seven clicks outside the poppy fields\nTelescopes and coffee spills\nFolding chairs and orange peels\nPeanut shells and all is fair\nIn loving brawlers crawling through the august air\nThat's the muggy handicap we all must share\nAnd morning smells like blood worms\nIn the beaks of the very falcon\nBut how can arrested splendors\nOf wretched sleep walk the palate\nPalpating hearts like woe to you rascal eddy hazels\nWhich one of you bitches would flip the table?\n\n[Outro]\nIts gonna be a long night!\nA real long night", "title": "Sink or Swim", "album": null, "image": "https://images.genius.com/64fbb9620a6b5e79e87c654b74da5441.640x640x1.jpg", "year": null}], "artist": "Aesop Rock"}