{"artist": "Gangsta Boo", "songs": [{"title": "Like A Pimp 2015", "album": "Underground Cassette Tape Music", "year": "2014-10-14", "image": "https://images.rapgenius.com/609907bd9e00a0d872e1192d298e6763.500x500x1.jpg", "lyrics": "[Hook (x5)]\nGet down on your knees like a top notch ho\nGet down on your knees like a top notch ho (like a pimp)\n\n[Bridge: Gangsta Boo]\nWhat these niggas doing? They [?]\nWhat these niggas doing? They [?]\nWhat these niggas doing? char-chargin' these hoes\nWhat these niggas doing? char-chargin' these hoes\n\n[Verse 1: Gangsta Boo]\nNic nac patty wac give your girl a rack\nImma shake it til my pockets fat, watch me bring it back\nI ain't fucking with them other boys, they ain't makin' noise\nDon't be fuckin' with them other bitches [?]\nEyes low like I'm chinese, smokin' on some deez\nVersace shoes with the six inch, she ain't rockin' these\nOne please I can give your ass a bitch\nMakin' money easy pimpin' hoes, it's serious bitch, Memphis\n\n[Hook (x5)]\nGet down on your knees like a top notch ho\nGet down on your knees like a top notch ho (like a pimp)\n\n[Verse 2: BeatKing]\nGet buck motherfucker, get buck\nAll my hoes thick as fuck and they gon' charge you to fuck\nFlexin' in that fucking Benz with a stripper and her friends\nOne black, one yella but she look mexican\nClub God make her drop it to the floor touch your fuckin' toes\nMake your knees touch your elbows, her pussy exposed\nOne time she gave me head in the backroom\nShe work at the white clubs too cause she ain't got no tattoos\nI called the bitch a bitch and I got rich\nEverytime I say pop that pussy I hear the [?]\nThuggin' with Gangsta Boo it's that under-underground\nBack up on my bullshit, ridin' slab, comin' down, H-Town\n\n[Hook (x5)]\nGet down on your knees like a top notch ho\nGet down on your knees like a top notch ho (like a pimp)\n\n[Verse 3: Lil Flip]\nSee the black drop heading that mean Jefe on the way\nThis young mack got bread, my snowbunny on the stage\nRed bottoms, oxycottons, yellow tuss, purple stuff\nGangsta Boo, BeatKing and Lil Flip that's what's up\nMan if she old enough to bleed then she old enough to breath\nExcuse me, (my bad) that's the little pimp in me\nI got shooters in Memphis and their percentage is tremendous\nCause they don't miss, I still get paid off hits\nAnd she don't wanna be saved, that's why she go both way\nI pop my collar like the Fonz, I'm still living happy days\nThat's Mac-10, that black Benz, that F&N it go bang\nNow say 'smoke something bitch' that's for Pimp C mane\n\n[Hook (x5)]\nGet down on your knees like a top notch ho\nGet down on your knees like a top notch ho (like a pimp)"}]}