{"songs": [{"year": "2011-02-15", "title": "Preacher", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "I'm seeing you man you doing your thing\nI see the new shoes, suits and a ring\nSince when are you into bling?\nA reverend’s supposed to lead like Reverend Doctor Martin Luther King\nYou more like Pastor Offering\nI'mma come down to your church, man\nHow much does it cost again?\nGod know a nigga struggling bad\nHe know a nigga probably need whatever he has\nAnd you insist, I give you some 10 percent\nWhen I can barely even pay my own rent\nI got a old ’94 Pontiac\nYou ride around this bitch in a new 'lac\nYou should be hitting us with some bread\nBut instead you hitting us in the head\nFor 5s, 10s, 20s, 50s, 100s\nAre you telling this is cause God want it?\n\nYou ain’t practicing what you preach man\nNah you extorting us on the weekend\nRob stealing and running a game\nGetting filthy rich in god’s name\n(Preacher)\nYou ain’t practicing what you preach man\nNah you extorting us on the weekend\nRob, stealing and running a game\nWhat a shame, what a shame, what a shame\n\nI’m seeing you man you doing it big\nBoth of your kids be coming to church jig\nWife rocking a five-thousand dollar wig\nAnd she got a big rock on her hand\nDid y'all run a scam?\nCause we was fucking dependent on section 8\nBut always had something to put in the collection plate\nIt was always so strange it was odd\nTo see my mama scratching up change to give it to God\nI think we all knew nobody’s saying shit\nYou was using that to pay your car payments\nWe was motherfucking paying your mortgage\nAnd we was living in the projects\nYou know we couldn’t afford it\nBut that’s how you was on it\nYou would come to church and talk it\nBut I doubt you would walk it\nYou probably come to America and Arsenio Hall it\nMake me wanna just snatch you off of the pulpit\n\nYou ain’t practicing what you preach man\nNah you extorting us on the weekend\nRob stealing and running a game\nGetting filthy rich in god’s name\n(Preacher)\nYou ain’t practicing what you preach man\nNah you extorting us on the weekend\nRob, stealing and running a game\nWhat a shame, what a shame, what a shame\n\nThat politician ain’t really a politician\nHe a (preacher)\nWe voted him in to be a leader\nBut he a (preacher)\nPromises better living conditions\nSoon as he gets the position, switches his disposition\nIt’s the (preacher)\nIt’s not only the guys in the church\nBut it’s the (preacher) got a lot of swish words\nHow the hell could we survive on this Earth\nWhen ya’ll come flood the ghetto with guns, drugs and legalize bottles of erk and jerk\nMy cousin on Percocet\nHe gave out a murder threat\nThey caught him, shot up his legs and them fuckers ain’t working yet\nBloomberg banned cigarettes\nWhy he ain't banned letting police man beat on niggas yet\nYa’ll know that the shit I’m saying is true\nIgnore it if it ain’t pertaining to you\nBut if the (preacher) don’t walk it like he talk it\nThen dammit, doggone it, that nigga got some explaining to do\n\nYou ain’t practicing what you preach man\nNah you extorting us on the weekend\nRob stealing and running a game\nGetting filthy rich in god’s name\n(Preacher)\nYou ain’t practicing what you preach man\nNah you extorting us on the weekend\nRob, stealing and running a game\nWhat a shame, what a shame, what a shame\n\nKnow what I’m saying, no disrespect to nobody, ya’ll motherfuckers blaspheming ass nigga, using the lord’s name in vain nigga, don’t do that shit. That niggas pimping the system, stop pimping the poor people man, help us out nigga, we need god for real\n\nNow come on up here so jesus can put you on a payment plan...", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}