{"songs": [{"title": "At The House", "lyrics": "[Intro]\nAyyy\nIt’s Dolph!\nI do this shit for real, my nigga\n\n[Verse 1]\nThat 2 seater, fully loaded. This Swisher Sweet, fully loaded\nThis wrist piece, fully loaded\nSo this four five, fully loaded\nThem young niggas, I can’t control em. Pull up with a thirty thousand dollar motor\nEyes low, cuz I’m never sober, cuz I’m a mud drinker and a strong smoker\nGot a little bitch that get money out Pure Passion and out Stroker’s\nMy old head nigga said, “You get too much money, young nigga stay focused!”\nHad an out of state plug when I was nineteen nigga, so I ain’t ever been local\nJumped in this rap game, spent a little bit of change, brought the streets with me, now it’s time to take over!\nThat’s that Paper Route Empire shit. Got a white girl that like to twerk, and she on that Miley Cyrus shit\nDon’t need no pen, don’t need no paper. Just give me a track, and I’ll demolish it\nI’m on the other side of the country, with fifty p's in my closet, bitch!\n\n[Chorus]\nI have the bread in the house\nIn the bed, in the couch\nI came up with a multi-million dollar plan at the house\nI don't trust these hoes, so I don’t get head at the house\nI just woke up out a nightmare, fucking feds ran in the house\nPress up CDs at the house, weighing Ps at the house\nHell nah, I ain’t never had no keys at the house\nLotta pistols, a hundred thousand dollar wardrobe at the house\nFresh as fuck and strapped up, every time I leave the house\n\n[Verse 2]\nI got no cable at the house, just plenty paper at the house\nI ain’t talking hoes, when I say I got flavors at the house\nStack my paper to the ceiling, went and bought Mama a house\nSaid, “Mama, do me a favor, and keep yo ass up out the South.”\nNow Mama waving at her white neighbors, just chillin at the house\nBut Daddy just like me, that nigga still running in and out\nWhat you doing in the hood dad? “Young nigga watch your mouth”\nMy Mama just called me tipsy, say she brought me in and she’ll take me out\nDamn, what the fuck? Yeah I’m still dealin' with this\nDaddy just like me, south Memphis nigga, that’s real nigga shit\nHood nigga run through a couple hundred bands while I’m eating on a box of Popeyes\nI’m connected like Wi-Fi\nNigga that’s why I…\n\n[Chorus]\nI have the bread in the house\nIn the bed, in the couch\nI came up with a multi-million dollar plan at the house\nI don't trust these hoes, so I don’t get head at the house\nI just woke up out a nightmare, fucking feds ran in the house\nPress up CDs at the house, weighing Ps at the house\nHell nah, I ain’t never had no keys at the house\nLotta pistols, a hundred thousand dollar wardrobe at the house\nFresh as fuck and strapped up, every time I leave the house", "album": "South Memphis Kingpin", "year": "2013-10-15", "image": "https://images.genius.com/572acc6f37044a5b4f2155b232bbe246.500x500x1.jpg"}], "artist": "Young Dolph"}