{"songs": [{"year": "2017-04-14", "album": "DAMN.", "image": "https://images.genius.com/d25e7043f51c2de6acaf6c39caa60da2.1000x1000x1.jpg", "title": "FEEL.", "lyrics": "[Intro: Kendrick Lamar & Chelsea Blythe]\nAin't nobody prayin' for me\n(Ain't nobody prayin' for me)\n(Ain't nobody prayin' for me)\nAin't nobody prayin' for me\n(Nobody prayin' for me)\nAin't nobody prayin' for me\n(Ain't nobody prayin' for me)\n(Nobody prayin' for me)\n\n[Verse 1: Kendrick Lamar]\nI feel like a chip on my shoulders\nI feel like I'm losin' my focus\nI feel like I'm losin' my patience\nI feel like my thoughts in the basement\nFeel like, I feel like you're miseducated\nFeel like I don't wanna be bothered\nI feel like you may be the problem\nI feel like it ain't no tomorrow, fuck the world\nThe world is endin', I'm done pretendin'\nAnd fuck you if you get offended\nI feel like friends been overrated\nI feel like the family been fakin'\nI feel like the feelings are changin'\nFeel like my thought of compromise is jaded\nFeel like you wanna scrutinize how I made it\nFeel like I ain't feelin' you all\nFeel like removin' myself, no feelings involved\nI feel for you, I've been in the field for you\nIt's real for you, right? Shit, I feel like—\n\n[Chorus: Kendrick Lamar]\nAin't nobody prayin' for me\nAin't nobody prayin' for me\nAin't nobody prayin' for me\nAin't nobody prayin'\n\n[Verse 2: Kendrick Lamar]\nI feel niggas been out of pocket\nI feel niggas tappin' they pockets\nI feel like debatin' on who the greatest can stop it\nI am legend, I feel like all of y'all is peasants\nI feel like all of y'all is desperate\nI feel like all it take is a second to feel like\nMike Jordan whenever holdin' a real mic\nI ain't feelin' your presence\nFeel like I'ma learn you a lesson\nFeel like only me and the music though\nI feel like your feelin' ain't mutual\nI feel like the enemy you should know\nFeel like the feelin' of no hope\nThe feelin' of bad dope\nA quarter ounce manipulated from soap\nThe feelin', the feelin' of false freedom\nI'll force-feed 'em the poison that fill 'em up in the prison\nI feel like it's just me\nLook, I feel like I can't breathe\nLook, I feel like I can't sleep\nLook, I feel heartless, often off this\nFeelin' of fallin', of fallin' apart with\nDarkest hours, lost it\nFillin' the void of bein' employed with ballin'\nStreets is talkin', fill in the blanks with coffins\nFill up the banks with dollars\nFill up the graves with fathers\nFill up the babies with bullshit\nInternet blogs and pulpit, fill 'em with gossip\nI feel like this gotta be the feelin' where 'Pac was\nThe feelin' of an apocalypse happenin'\nBut nothin' is awkward, the feelin' won't prosper\nThe feelin' is toxic, I feel like I'm boxin' demons\nMonsters, false prophets schemin'\nSponsors, industry promises\nNiggas, bitches, honkies, crackers, Compton\nChurch, religion, token blacks in bondage\nLawsuit visits, subpoena served in concert\nFuck your feelings, I mean this for imposters\nI can feel it, the phoenix sure to watch us\nI can feel it, the dream is more than process\nI can put a regime that forms a Loch Ness\nI can feel it, the scream that haunts all logic\nI feel like sayin' somethin', I feel like takin' somethin'\nI feel like skatin' off, I feel like waitin' for 'em\nMaybe it's too late for 'em\nI feel like the whole world want me to pray for 'em\nBut who the fuck prayin' for me?\n\n[Outro: Kendrick Lamar]\nAin't nobody prayin' for me\nWho prayin' for me?\nAin't nobody prayin'"}], "artist": "Kendrick Lamar"}