{"artist": "A$ton Matthews", "songs": [{"title": "Ever Since", "image": "https://images.genius.com/f02fccf9054f398c7205a66abe36a085.500x500x1.jpg", "album": null, "lyrics": "[Pre-Chorus}\nEver since I could remember I been gettin' paid, I been up for days, lost up in my ways over petty (skrrrt)\nEver since I could remember I been gettin' paid, I been up for days, lost up in my ways over petty change\n\n[Verse]\nRaised from round the field, living, dying bout that dollar bill\nYoungin's busting scripts and poppin pills just to chase the thrill\nThese are just the times we living in, living just to die so we runnin up them dividends.. Binannands\nShoutout my PDLs what's the dinaneal\nRight hand up to God Im'a lie on any stinnanand\nThey know how we rockin' you know we ain't goin\nIf you ain't official boy it ain't no way that we ain't knowin'\nWho you think you foolin who you really pressin\nI got all the Crip's and Ese's turnt up in the section thats the 56 duece\nCatch me WooPin through the 310\nWestside Barson baby had to let em know\nHeard the end is comin, steppin to it\nBricky Valens baby please don't shoot me down\nSoulja rag hanging since a Juvenile\nMake 'em make a move or make 'em move around\nNiggas talking P's and they ain't move a ounce\nBoy I'll lose a bitch before I lose the count\n\n[Chorus]\nEver since I could remember I been gettin' paid, I been up for days, lost up in my ways over petty (skrrrt)\nEver since I could remember I been gettin' paid, I been up for days, lost up in my ways over petty change\nI been up for days, I been up for days\nWhen it's time to make a scene We gon' set the stage\nI been up for days, I been up for days\nWhen it's time to make a scene We gon' set the stage\n\n[Outro Skit]\nNo peace. Because, for the simply fact is, how am I gonna be cool with you if you smoked one of my homies I gave a fuck about or I loved. Then we gonna come back and be straight? My nigga that shit ain't cool homie. Stop playing homie. This gangbangin' shit is watered down. All this punkass shit niggas thats enemies clickin' up y'all niggas some bitches. We gangbangin'!", "year": "2017-05-26"}]}