{"artist": "AZ", "songs": [{"title": "Do Me This Way", "image": "https://images.genius.com/c0a4aa336ec766ea191955d38d45cd5d.911x904x1.jpg", "album": "Last of a Dying Breed 2", "lyrics": "[Talking]\nI mean, I mean we peoples man we started from the bottom. I thought it was gonna be fly up to the top you dig. I mean, ya know? we all got dreams and aspirations man I mean we peoples we done been through it all you gon, you gon do me like this? we damn near family wasup man talk to me\n\n[Verse:1]\nWe been down from the dirt genesis birth\nWoulda swore we woulda balled 'till they set us in the earth\nWe was been on our worst with the letters on our shirt\nJewels on our chest only moved with the best\nThe rest was upset but the rest was no threat\nFresh was the less sky box at the Jets\nFloor at the Nets we was more than some vets\nLegandary known balled more than the mess\nBut guess princess says on the neck for wreck\nVenley I styled off the deck, was speck\nJail calls accept all collects connects had all kinds of niggas in check\nCorrect\nI wouldn't of known this here was next got a gun to my head and you want a nigga dead\n\n[Talking]\nI mean, listen you could have it all baby I mean, I only get one life ain't no remix on it we family still. So many whirls we go through, my shorty\n\n[Verse:2]\nI showed you the life I gave you the mic\nYou ain't shy no more you say what you like\nYou play all polite but its all day and night\nBipolar zone but I gave you the throne\nNext to the king you untreacherous thing\nYou set the stage I selected the ring your first Jimmy Juice your red bottom shoes\nSpy bag collection I had direction\nI kept giving you kept accepting smiley face texting so wide a deception\nWhy munip me? do it so slickly you said you loved I but you fucking the next guy\nIf it was me you'da pulled the left eye but let's try\nThough I can't believe it\nI know the best I but we got a chance to weave it\nSee its never too late when together you stay\nI just would've never ever thought you stray\n\n[Talking]\nIt's okay I mean, just to fuck thats what you was just doing fucking right? I mean that's for the moment I'm a bigger nigga I done do my lil dirt but, got too much shit going on don't do the kid like this pack your shit we out of here", "year": "2009-06-30"}]}