{"songs": [{"album": "T.I. vs T.I.P.", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg", "year": "2007-07-03", "title": "Don’t You Wanna Be High", "lyrics": "[Hook: T.I.]\nAy, hey don't you wanna be hiiiiigh?\nHey listen baby come fly with me, take a ride get high with me\nAy, ay, I know you wanna be hiiiiigh\nYou never wanna say bye to me, if you ever come fly with me\nAy, hey don't you wanna be hiiiiigh?\nHey listen baby come fly with me, take a ride get high with me\nAy, ay, I know you wanna be hiiiiigh\nPromise you'll never say bye to me, and if you ever get high with me\nLet's go\n\n[T.I.]\nOkay the bucket's on tilt, truck is on stilts\nJust did another deal today, at least a couple mil'\nAnd I'm askin you to chill, wanna pass that down?\nI'm tryin to pick you up and never put ya ass back down\nGet rid of all your worries, why you draggin that around?\nHere, pop one of these, now pass that around\nFire it up, take a shot, now ya ass in the clouds\nCan I bend you over? Throw your ass back down\nNo need sayin no, we way past that now\nI ain't them other niggas, just control the flashback now\nMake three wishes, you can have that now\nAnd fuck the financin, payin cash right now\nAy, miracle man make dreams come true\nTake a ride, get high, 'bout the time you come to\nI bet your life done changed, you likin my last name\nDone had a couple babies with a Bentley and a Range\nCrib on the water, eatin meals on a plane\nAnd your life in the sky like you lived on a plane\nWith so much good shit to fill yo' brain\nIf the band seem strange I'm just sayin\n\n[Hook]\n\n[T.I.]\nYou see me, chillin out kickin back in the ride\nWith a, fly broad on the passenger side\nGot a, nice smile and immaculate eyes\nBefore she, get inside she don't have to decide\nCause she can have it how she want it, we can do it like that\nAnd then I went and threw it to her and she threw it right back\nShe said nobody never gave it to her like that\nHit it from the back, I figure you would like that\nHer head and tight pussy good like that\nAnd damn, she ain't even from the hood like that\nSo she probably never really kicked it with a cool nigga\nOther niggas had her didn't know what to do with her\nIntimidated by her face and her cute figure\nCause her waist real small but her ass way bigger\nHope she know that if I want her I ain't finna play wit her\nAll I gotta do is spend a day with her\n\n[Hook]\n\n[T.I.]\nHey, hey what it is pretty girl, would you like to\nCome and kick it with a nigga for a night or two?\nAnd you can take your clothes off if you like to\nAnd it don't matter 'bout the cost if I like you\nI just do it shorty, I ain't gotta try to\nBust a move, bet ya I can satisfy you\nAnd me chase right behind you, why boo?\nI'm like you, know you fly but I'm fly too\nYou know how I do it, always ride good\nMatch the paint with the wheel, put the trunk in the hood\nYou dealin with a real nigga, get it understood\nI'm still from the hood, even when in Hollywood\nWith my beat down low and my top let back\nYou lookin for a G, well you got just that\nHey I can be your king, you can be my princess\nBaby all you gotta do is say yes\n\n[Hook]"}], "artist": "T.I."}