{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/MV5BMTY0MDY3MjQxN15BMl5BanBnXkFtZTcwODQ2NzE1NA@@._V1._SY314_CR11,0,214,314_.jpg", "title": "Dime Piece", "album": null, "year": null, "lyrics": "[Hook]\nIt's driving me outta my mind\nThat's why it's so hard for me to find\n(Repeat)\n\n[Verse 1]\nDime piece definition of a chick\nNice, sweet educated independent fly thang\nWay she fillin' up them jeans gotta tear drop like Visine\nLike WHOOP shawty stuck it out had da touch it\nOOPS I could make it just jump in my COUPE\nWit a diamonds and jewels\nI see Jimmy Choo in your designer shoes\nMama listen u ain't never heard a flow like this one\nWho you know Gigolo and still Christian\nLittle shawty stop trippin' if Don once a bishop\nWhy Nick can't be pimpin'\nPLEASE I'm just tryna get you in VIN-KISS\nWait take a minute take a flick just FREEZE\nCause you know the Cannon be flashin' I'm gettin' more head then a aspirin\nI'm askin' are you a dime the dime\n\n[Hook]\nIt's driving me outta my mind (Hey ladies)\nThat's why it's so hard for me to find (Hey ladies)\n(Repeat)\nAre you a dime?\n\n[Verse 2: Izzy]\nYou looking for a dime\nIzz gotta a 9 da dick put em high\nCall a Nina Sky money over dare\nAnd I ain't got time but to get brain from a dime\nNow that's changin' your mind\nMy dick feels for you like Chaka Khan\nFlip head and tails when I tossin' your mind\nThey call me Izzy you know\nSingle the I then double the Z den say it wit a Y\nWhere all my ladies that single the night\nAt the strip club got me throwing singles the nght\nThe boy poison the beat be the IV on the mic\nWhat them dime say when Iz on the mic\n(Go Izzy, Go Izzy) Feeling me why can't even name all the 10's on the mic\nThat Ronda, Bonnie, Vicky, with choice\nIs she a born again wit some dick in her life\nIs you a dime the dime?\n\n[Hook]\n\n\n[Bridge]\nAll the ugly chicks be quiet (Hey, hey)\nIf you fly get a drink i'll buy it (Hey, hey)\nAt the end of the night I might hit (Hey, hey)\nCause I like it, I love it, can I ball on the beat make a club hit\n\n[Verse 3]\nIt's like taste, what lick who\nThat's what Nick do\nGot a lot of chicks dat love my sick moves\nDo what a pimp do move how a pimp do move\nGet a tattoo ma use my initials\nNow we got issues and rumors the clear up\nSex real loud next room they can here us\nI'm lookin for a dime dat can take the whole 9\nCheck the sex tapes if you think I'm lyin'\nAre you a dime the dime\n\n[Hook]\nIt's driving me outta my mind (Hey ladies)\nThat's why it's so hard for me to find (Hey ladies)\n(Repeat)\nAre you a dime?"}], "artist": "Nick Cannon"}