{"artist": "Anybody Killa", "songs": [{"title": "What U Want From Me", "image": "https://images.genius.com/8a7a13e5aff4ea229c97fc6e44c5aae7.1000x1000x1.jpg", "album": "Mudface", "lyrics": "[Verse 1: Anybody Killa]\nWhat do u want from me?\nBe the question, don't you think that I gave you enough?\nWhat about the time I took you out\nAnd just bought you all types of crazy stuff\nThis world ain't nothing different, I ask it everyday\nWhat the fuck do I gotta do, so everyone can see it my way?\nIf I could I would be a millionaire\nAnd help out the poor cause it's good to share\nAnd keep away from the ones that front\nAlways taking what you giving cause they steadily want\nSo what more could you want from me\nWould it make you happy to watch me bleed\nOr are you sticking around to just see\nIf a killa like me is able to achieve, what's up\n\n[Hook: Blaze Ya Dead Homie & Anybody Killa]\nDon't be standing around looking like a dog on a leash\nWhat do u want from me?\nDon't be acting like we friends, and you won't be deceased\nWhat do u want from me?\nDon't be acting like you know everything I'm about\nWhat do u want from me?\nWhat you want, is what you goin' get without a doubt\nWhat do u want from me?\n\n[Verse 2: Anybody Killa]\nWhat do you want from me?\nI'm just askin', cause you look like you need some help\nAnd the only thing left that I got to give\nAre these rhymes I use myself when I'm angry\nI just get so confused, think to myself what do I got to lose\nThere's nothing more for me here to prove\nSo from here on out I'mma act a fool\nWhat do you want from me? I might as well ask\nCause I'm kinda in a giving mood\nI got free advice for the ones that hate\nThis motherfucking nuts for you (bitch)\nI'mma walk with my head held high through these trails of tears\nCause I have nothing to fear, ya'll\nI'm Detroit's first native representing\n87 it was written memorized ready for spitting dawg\n\n[Hook]\n\n[Verse 3: Anybody Killa]\nI'm so proud to die and I'm proud to live\nAnd I’m going to scream it to the world til my lungs give in\nIf there anything I got that you think you deserve\nThen next time contest my nerves, or it's all bad\nCrazy, psycho, not right in the dome, leave me alone\nSo fed up and don't know what to do\nSo now it’s time to ask from you, help me\n\n[Bridge x2: Anybody Killa]\nI know you think I’m crazy\nI do it for you, I do it for you\nEven though it true I’m crazy\nYou crazy too, you crazy too\n\n[Hook x2]", "year": "2008-11-25"}]}