{"songs": [{"year": null, "lyrics": "[Intro]\nShouts out to all my hoods across the A gettin it in\nMy Eastside niggas, my Westside niggas\nBig shouts to the Northside (\"DJ Spinz, fuck nigga!\")\n\n[Chorus]\nI could go on and on for days and days and song for song yeah\n{\"Let me tell you all about it\"}\nI could go on and on for days and days and song for song yeah\n{\"Let me tell you all about it\"}\nIt's 'bout that Eastside tale, yeah I can tell you 'bout that Eastside tale\n{\"Let me tell you all about it\"}\nIt's 'bout that Eastside tale, let me tell you 'bout another Eastside tale\n{\"Let me tell you all about it\"}\n\n[Interlude]\n(\"M... L... K!!\")\nLet me say again! You'll never know that no matter what song\nWhat the concept is or whatever, I'm tryin to keep it 100\nSo I may not be givin you the story but the story got the truth in it\nYou feel me? (\"SCREAM!!\")\n\n[B.o.B]\nOh yeah, believe it, I can tell many secrets\nBut the mo' I talk about them that's just the mo' that you see 'em\nYup - I'm a believer, not sayin I'm religious\nBut I see somethin wrong with how we livin in my city\nWhy everybody from Decatur wanna be a sanger?\nOr be an entertainer, or to be rich and famous?\nYou see us on TV, you sit for hours and you stare\nNot sayin that we Gods, but that's what they try to make us\n\n[Chorus]\n\n[Interlude]\nAnd like I said - even though I'm tryin to get to paid\nI ain't fin' to do what they want me to do dawg\nRealer than that I'm from Decatur\nDecatur's a city that's gon' be on yo' mind soon as you think about it\n\n[B.o.B]\nHell yeah I'm from the Eastside\nAin't sayin it just to get the streets behind me\nAin't like slum, but I know where I'm from\nSo I spit it for the slums and the street society\nIt's yo' block that I'm beatin' down\nSo that real shit's what I'm speakin 'bout\nNow I can probably, tell you a lie\nTo tell the stories about people's problems\nBut everything that I got to say is\nContagious like toxic waste\nDon't play ball but I'm Atlanta's Bravest\nSo if I'm fake then it's not today\nNow I can sit up here and lie up in my rhyme\nAnd tell you everything is fine but y'all ain't blind - nah~!\n\n[Chorus]", "title": "Eastside Tales", "album": "The Future", "image": "https://images.genius.com/d8cefe97bbbe251a84c87f853a533f10.500x500x1.jpg"}], "artist": "B.o.B"}