{"songs": [{"image": "https://images.genius.com/daefeeabb76c6d2f790274b40e728df9.500x500x1.jpg", "album": null, "year": "2015-10-26", "lyrics": "*\n[Chorus]\nI fell asleep with the lights on last night\nI had a dream and i was swervin in a fast life\nAnd all i think about is Oblivion\nAnd all i really want is a million\n\n[Verse 1]\nI don't need to dress you up, im glad you made me lose direction\nI lost all reception wifi wifi need inspection\nThis [?], i might just get [?]\nIt's on the rush and i might just get [?]\nI might just go on the top just to fuck with this girl\nAll this time invested, girl i hope i rest up\nI might just get invested for a million, damn like all the fucking time\nI don't need a knife, nigga\nI just need [?]\nOh, she is so fine, i just told myself \"Why the fuck you got that high?\"\nCause i got all the things, nigga\nI don't need to die while i [?]\nI just waited on line and i just wasted my time\nCan you give me some? What do you see by [?]\nBut, but (Oh)\nWhy you only get with me when i get numb?\nAnd why you always back when you see you're dumb?\nAnd why you only coming when you lost my love?\nYou hit my line like we gotta talk about some, though\nYou know, oh well\nYou like these robes\nTop flow, you suck\nI'm on, you suck\nBut fuck it, 'member what we said\nAll this weight on a day, when you hit my line with that hate\nI made a mistake, i thougt that i needed a break\nDon't matter to me, i just wanna get paid\nThat fun [?]\n\n[Chorus]\nI fell asleep with the lights on last night\nI had a dream and i was swervin in a fast life\nAnd all i think about is Oblivion\nAnd all i really want is a million\n\n[Verse 2]\nI sent a message and i hope you comprehend it\nBut yes, i meant to buy that room in the city that you rent it\nGet your money back, please don't feel offended\nI know i slide [?]\nI kinda feel infested, i been wishing a rest\nSo maybe we could mess it\nI met you on Thanksgiving in your safe house\nThank god we living on the underground\nFairy hit 'em with [?]\nAnd i'm sitting on this [?], [?] where all my sins are gived\nCause i'm from a world where your mind counts, not your body counts\nSuch my soul, take a look around\nTell me where you found my eyes, they yelling love\nYou can rip my phone, i don't need to know\nTell me if you down, you can smoke a pound\nI am not a [?], we can do this [?]\nWe can do a [?], i don't need a [?]\nWe could go so high, i don't need to see\nCause i never think 'bout the person i used to be\nAnd we never leaving, we [?]\n\n[Chorus]\nI fell asleep with the lights on last night\nI had a dream and i was swervin in a fast life\nAnd all i think about is Oblivion\nAnd all i really want is a million\n\n[Outro]\nEverybody got a dream, everybody want to see", "title": "Swervin’"}], "artist": "070 Shake"}