{"artist": "Porta", "songs": [{"album": "No hay truco", "title": "El jugador también forma parte del juego", "image": "https://images.genius.com/8d2637d189e14c6096a3e8262f996719.605x605x1.jpg", "lyrics": "Letra de ''El jugador también forma parte del juego''\nQuiero jugar a un juego\nEscucha atentamente\nHay reglas\nQue empiece el juego\n\nHoy te has despertado sin saber bien donde estabas\nDesconcertado del todo\nBuscando algo que no encontrabas\nLa muerte está en todas partes\nNo se puede esquivar el destino\nVas escribiendo tu historia guiándote por un camino\nTu habitación cada vez se va haciendo más pequeña\nSientes esa soledad que te acompaña cada noche\n¡estrella!\nVes esa oscuridad que se apodera de tu luz\nPorque estás en ninguna parte y no te conoces ni tú\nEntre la nada y el todo tan solo fluye el tiempo tus gritos suenan huecos mientras oyes un eco muerto\nNo hay hombros en los que llorar\nSolo cuatro paredes que no dejan escapar como una araña su presa entre redes\nEl estrés se apodera de tu cuerpo\nAhora es cuando de verdad deberías empezar a tener miedo\nTus llantos\nSe calman en silencio\nLa esperanza se hace más pequeña y las piedras no quieren hacer fuego\nTe consumes\nLa fe no es suficiente en ti\nEstás moviéndote entre sombras que te guían hasta el fin\nSalir de aquí solo depende de ti\nAdemás lo sabes\nBuscar pistas\nLlaves la pieza del puzzle aquí es la clave\nTe estás volviendo loco\nPoco a poco\nReconócelo\nEres una marioneta\nUn juego de un ser sin escrúpulos\nTus actos cometidos te hacen empezar de cero\nJugaste\nY el jugador también forma parte del juego\nLloras, gritas, arañas la pared\nTe desesperas\nTienes hambre y sed\nTienes miedo\nEs algo que te supera\nSaber que no eres nadie y nadie te puede ayudar\nPara ser alguien debiste pensártelo antes de jugar\nApostaste todo a una carta\nNo valoraste nada\nTeniendo todo en tus manos\nTarde pa' rectificar\n¡cagada! Tu destino es estar solo en esta oscuridad infinita\nQuizá aprecies tu vida si sales vivo de esta partida\nEs difícil cuando hay pautas que seguir\nÓrdenes que cumplir\nSi quieres vivir tendrás que sufrir\nLa muerte está en todas partes\nEscapa de ella\nAquí es cuando sientes realmente que la vida es bella\nSoy alguien querido que no recuerdas\nQuieres que sea una pesadilla\nY que sean sábanas las cuerdas que te atrapan\nIntenta escapar pese a tu cansancio\nLos pasos que das son hacia atrás\nVas bajando peldaños\nEn vez de subirlos\nPara ti el tiempo se detiene\nPero las agujas siguen su curso igual que siempre\nEstás confuso\nSolo en un lugar que nadie conoce\nEstás temblando\nOyes voces y temes lo que desconoces\nSolo hay una salida y no a tu alcance\nBúscala\nEn esta oscuridad\nCuanta sangre derramarás\nEl tiempo se agota\nVivir o morir\nDecide rápido o muere despacio\nTienes que elegir\nPon de tu parte\nTe diriges camino a la perdición\nAhora sufres de verdad\nMientes para llamar la atención\nQuerías suicidarte y a la hora de morir ya no quieres\nCuando la muerte te roza es cuando aprecias lo que tienes\nDe verdad\nEsta mente enferma quiere jugar\nAunque solo con la finalidad de poder ayudar\nMe lo agradecerás algún día\nTe lo aseguro\nLas reglas son sencillas\nSolo tienes un minuto\nDisfruto viéndote en la oscuridad\nTe quedarás encerrado hasta que te mueras\n¿qué se siente en tu lugar?\nVeré como te pudres\nUn peón en mi tablero\nNo queda tiempo jaque mate\nFinal de este juego\nFin del juego", "year": "2007-01-29"}]}