{"artist": "WC", "songs": [{"year": null, "lyrics": "[WC] Ooh-OOOOOHHHHHH!\n[E-40] BEYOOOOOOOOOOOOOOOOOOTCH! Huh-ha, hah!\n[WC] Dub Cya, neeeah!\n[E-40] Uhhhh, hah!\n[WC] Fonzarelli, what's crackin loc?\n[E-40] Whassupish weebelations?\n[WC] $hort Dog, we all hogs\n[TS] Ain't nuttin nigga, it's that pimp shit bwoy\n[E-40] We doing our thingamajig up in this BEYOTCH!\n\nVerse One: WC\n\nThinkin of a master plan\nCause ain't naytin but crumbs inside my hand\nSo I, hit the stick, leaves my residence\nThinkin, \"How can I get paid for spinning this gangsta shit?\"\nA three-strike victim, with a million dollar dream\nOf swerving 740 Beem's and count G's from money machines\nMy click trump tight, nigga we roll like dice\nFor the ten china whites seekin hustler paradise\nWhere you from, what's your name, motherfucker what you sayin?\nDub C still claimin that Maad Circle gang and\nSmokin dank and drankin, jaw breakin runnin the pavement\nTop rankin CD slanger, ghetto Hall of Famer\nInternational resider world-wider packing heat\nMashin for the cheddar with No Limits like Master P\nFound my glitch in this rap game, now I'm steady bustin\nDub C, hoo-ridin for the chip but still hustlin\n\nChorus: *unknown singers*\n\nKeep hustlin' -- cause I'm all about mine, yeah yeah\nKeep on hustlin'... droppin keys funk stackin weed shiftin\nKeep hustlin' -- true players play it all night long\nKeep on hustlin'... on and on\n\nVerse Two: E-40\n\nCheck it out; Dub C ?the below? system\nGot ya ninjas dang near ready to put hands on ?PGA any man?\nBout to bomb on this bitch-ass for turnin off my lights and gas, low on cash\nBad enough I gotta go next door to take a bath, ain't got no water\nPlus I heard that the police department homicide division\nWanna holla at me about a manslaughter\nTriflin ass baby mama, she's a botch bitch think I'm rich\nDon't know the outcome, talkin bout \"He got bread, he on Dub album\"\nI play ya like dick and bend a dick's dream how can I focus (hocus pocus)\nWhen I'm famous as \"fuck Christmas Eve, eviction notice\"\nThese rap videos gotta soon to be up and coming rappers thinkin cute\nKnowin that we unrecouped\nE-Fonzarelli, P.K.A. Charlie Hustle\nKnockin though, knock a ho without a penny in my pocket\nI don't come from much, so in order to do what I gotta do to survive\nTapes and CD's be my nine to five\nCheck it out, mathematics, paper rappamatics established\nLong money, way before I signed for cabbage\n\nChorus\n\n[E-40] Get your marbles main, get your paper ... glorify your paper route\n\nVerse Three: Too $hort\n\nYeah\nI'm coming from a fashion show, with a flashy ho\nSmoking indo from the Valley-jo\nLike them 3rd Ward niggas from the Calliope\nIf you tryin to get high, what you passing fo'?\nTop notch on my right smelling smoke\nBut she don't know about the hustlin' that I did when I was broke\nMy best customers, real macks and G's\nDope-fiend beats on the backstreets\nMe and Freddie B selling game\nCustom made tapes with your name, you can't complain\nI always been about the business, I ain't changed\nAs long as I'm in it, I'm staying the same\nGhetto star, feeling the pavement\nI'm always down to earth, trying to get paid bitch\nAin't no secret, to what I'm doin'\nI got the game from Oakland so I came to this conclusion\n\nChorus\n\n$hort Dawg, you know we players main\nGet your money nigga\n\n[E-40] E-40 get yo' paper main, get yo' change\n[TS] You know $hort Dawg always get his scratch\n[E-40] Dub C!\n[TS] Neeeah! Neeeah!\n[WC] You know I'm takin mine nya!\n[E-40] Fssssssh, ahh, uhhhh, erytime up in they tall can face\nGlorifyin our paper route, nonstop -- you know?\nBEYOTCH!", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "Keep Hustlin’"}]}