{"songs": [{"title": "Emotional (Version 3)", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Intro]\nUh-uh\nWoah, woah, woah\n\n[Verse 1]\nWhy, why are you bringing this to work? (Work)\nDon't you know that business comes first? (All the time)\nDon't you know I been through the same shit and worse (Straight up)\nDead relationships, it's time to put it in the dirt (Dirt)\nWhy, why, why, why are you actin' like a bitch? (Bitch)\nI got time for everythin' but this shit (No time)\nSeems like everytime I'm real with you, I make it worse (Real, real)\nSeems like every day you mad at me, you mad it hurt (Hurt, hurt)\n\n[Chorus]\nWhy are you so emotional? Woah, woah, woah, woah (Woah)\nEmotional, woah, woah, woah, woah (I just gotta ask, like)\nWhy are you so emotional? Woah, woah, woah, woah (Woah)\nEmotional, woah, woah, woah, woah (Damn)\n\n[Verse 2]\nYou must be tryna get rid of me\nYou know that shit don't sit with me (No)\nYou are the epitome of the shit that get to me (Oh)\nLook, chill, chill, chill, I don't mean to be cold, shit (Cold)\nMichigan one-below shit (No)\nBut you need to know this (Know)\nEverytime you push me to the edge (Edge)\nI just wish that you would shut up, give me head (Head)\nI just wish that you would show a little respect ('Spect)\nBecause even we face-to-face, it's like we don't connect (Shit)\n\n[Chorus]\nWhy are you so emotional? Woah, woah, woah, woah (Woah)\nEmotional, woah, woah, woah, woah (I just gotta ask, like)\nWhy are you so emotional? Woah, woah, woah, woah\nEmotional, woah, woah, woah, woah (Look)\n\n[Refrain]\nI can't hear what you say when your mouth runs away\nYou need to straighten your mood\nLook, you get no respect if you show no respect\nWhy'm I still talkin' to you?\nEmotional, woah, woah, woah, woah\nOh-oh-oh-oh\n\n[Verse 3]\nWhy you gotta put me on the spot when you know I hate [?]?\nYou know I try take a seat when I can't understand it (Woah)\nAnd why you gotta raise hell instead of standards?\nWhen did the happy home abandon?\nLook, Goddamn it\nYou got an attitude problem, I got an altitude problem\nFuck the bullshit, if you need it I will get the mask\nAnd the Batman just like we in Gotham\nIf you need the option\nLook, I'm a little off the Hennessey\nJust so you know the authenticity\nWhy you gotta be the centerpiece?\nAnd kill of all the energy\nWhy can't we just build the synergy, huh?\n\n[Chorus]\nWhy (Damn) are you so emotional? Woah, woah, woah, woah\nEmotional, woah, woah, woah, woah (I just gotta ask, like)\nWhy are you so emotional? Woah, woah, woah, woah\nEmotional, woah, woah, woah, woah (Why are you so)\nWhy are you so emotional? Woah, woah, woah, woah\n(Why? You need to keep that bullshit to yourself, man)\nEmotional, woah, woah, woah, woah (I gotta ask, like)\n(You come around fuckin' the vibe up, we ain't got no time for that)\nWhy are you so emotional? Woah, woah, woah, woah\n(It's only time to boss up, straight up)\n\n[Outro]\nEmotional, woah, woah, woah, woah\nOh-oh-oh-oh\nEmotional, woah, woah, woah, woah (Quit bein' so)\nOh-oh-oh-oh"}], "artist": "Big Sean"}