{"artist": "Capital STEEZ", "songs": [{"title": "Negus", "album": null, "year": null, "image": "https://images.genius.com/126d3d8ed37f6738b16f5c405b0c0aab.431x431x1.png", "lyrics": "[Skit]\n\n[Verse 1]\nMe? I'm a fuckin' walkin' paradox\nLike Sasquatch swaggin' in a pair of Docs\nWhere I'm from, either you bangin' blue or you scared of cops\nFiends askin' where to cop, kids askin' where they pops\nJust crack kids and bastard babies\nIn high school I had all my teachers exasperated\nTil they seen the black lady in the black Mercedes\nThey was like, \"Damn, he actually has some family trainin'\"\nNow I'm the lyrical miracle with the serial killer flow\nLive in stereo, so listen close\nBack then I could barely even get a bone\nNow it's all yellow-bones hittin' up my telephone\n\n[Break]\nP-E, bitches\nP-E, bitches\n\n[Verse 2]\nAnd I'd like to say, \"Fuck you!\"\nTo my fat seventh-grade teacher with the bucktooth\nNever saw what I'd come to\nNow I'm livin' comfortable and beamin' over heads like a motherfuckin' sunroof\nGot Diamond chillin' in the back\nI sit and laugh, cause for a livin' I'm killin' tracks\nThey held me back said I'd never pass simple math\nNow I'm tellin' you what you told me, \"Just relax\"\nIs this the realest shit I never wrote?\nCause I was too embarrassed 'bout my stepdad sniffin' coke\nFunctional addict my ass, is that a fuckin' joke?\nDifferent strokes for different folks, that's why I'm spittin' dope\nMe and Powers takin' over like a symbiote\nMom blames it on the wild amount of piff I smoke\nBut it's better than takin' one of her necklaces and runnin' off to get a fix with it\nAnother day another demo\nAnd I already found my satisfaction in reefer so why the fuck would I need blow?\nJust copped some rollin' papers in assorted flavors\nAnd a 40 ounce to compensate for 40 acres\nI could play the ones and twos like I wanted to\nThe sky's the limit, that's what they told the fuckin' fool\nI disguise the limit, now I'm aimin' for the Sun and Moon\nP-E, premature ejaculation, comin' soon\nComin' soon"}]}