{"songs": [{"year": "2011-05-17", "album": "Who Is KB?", "image": "https://images.genius.com/cc0b72e73e609b19ba9fe03fa5eac73b.757x759x1.jpg", "title": "Brand New", "lyrics": "[Intro]\nHow does that sound?\nBrand new, (Who is KB?)\nBrand new, (Waiting for the new earth new)\nBehold I'll make all things (I'm a slave for the Lord Jesus Christ)\nBrand new, (I'm a nobody, here to tell everybody)\nBrand new, (about somebody, who could save anybody)\nBehold I'll make all things brand new (Let's go)\n\n[Verse]\nUh, suffer will reign\nHomie we live that, that's just not a cliché\nThe Christian life is not a piece of heaven on earth\nBut bless God, we get the peace of heaven on earth\nCause we know all things, even the hard things\nWork together to make us look more like our King\nYeah, He's with us in this storm\nSickness or health, dead or alive, I'm a child of God\nSome say God doesn't want you to suffer but where they saw that?\nWe don't pray for a lighter cross, but a stronger back\n(It's not about) the comfort, good life, and security\nYou will feel pain but He's breaking you for maturity\nYeah, believe He's for you\nIt's OK like abbreviatin' Oklahoma\nChild of God, believe He's for you\nIt's OK like abbreviatin' Oklahoma\nLord, come quickly put your return on fast forward\nWhen the sun does the sky like it does your dashboard\nSomething's better comin', this life is a passport\nOnly glory set before me, what I'm feelin' bad for?\nNo more Christians getting slandered on the media\nNo more baby girl, say bye to leukemia\nNo more persecution like gal in China\nWho's been tortured for many days and we still can't find her\nStraighten passion, depression, struggles with trust\nNo more goin' to Wal-Mart havin' to war against lust\nGlorified bodies are stronger, not mere men\nAnd ladies (hey), you get your clear skin\nNo veil, no blurs, you'll worship our God\nNo sin, no end, 'til the Lord comes\nWe wait, content, with Christ today\nWe cry hard to give Him more tears to wipe away\nIt's weight in music\n\n[Outro]\nBrand new, brand new\nBehold I'll make all things (Can't wait to see You)\nBrand new, (Lord)\nBrand new, (This rapper has one audience)\nBehold I'll make all things brand new (In the midst of many, we glorify...Jesus.)\nI am what I am, by the grace of God"}], "artist": "KB"}