{"artist": "Wale", "songs": [{"title": "Black Grammys", "year": "2014-01-26", "lyrics": "[Produced by Tone P]\n\n[Intro: Rick Ross]\nIf Michael Jackson was alive right now\nHe would want us to smoke one for him\nDouble M, \"Self Made 3\", let's go\n\n[Hook: Wale]\nFolarin in this muh'fucker\nI'm just talking to you muh'fuckers\nIf it don't make your niggas proud\nThen this should never be allowed\n\n[Verse 1: Wale]\nLook, misunderstood, just over heads\nJust in your ears, although you deaf\nKilling my fitteds with no intent, I groom better\nLike I'm under a goal post, I am too officials\nExtra point nigga, I forever kick it\nAs far as lyrics, I'm quite content with celibate living\nWittingly unfuckwittable with these syllables\nAnd fuck your syllabi, little nigga been to school\nThe realest dude in the room in my groove\nAnd all my women come frequently as the summer's moon\nKeep talking 'bout ambition shit\nBrown women, brown liquor, I'm innocent\nAnd all these bitches don't know which body part they gon' pick\nInvite them to my mind, but they end up on my dick, haha\nReminiscing upon my man Slick\nWe from the jungle, the grimiest animal a pig\nAs-salamu alaykum though\nTry to hit the Jummah, Muhammed said you faking though\nSomebody said, \"You winning, why BOA pray so much?\"\nI say, \"You tripping, such winnin make niggas prey on us\"\nDreams fulfilling they ain't capable of\nAs I renovate a model but do raise up your cup\nHah, tell them niggas we never giving up\nAnd never lose us on this never-ending revenue hunt\n\n[Hook: Wale]\nFolarin in this muh'fucker\nStill talking to you muh'fuckers\nIf it don't make your niggas proud\nThen this should never be allowed\nChurch\n\n[Verse 2: Meek Mill]\nUh, I did it for my family\nI'ma take my mama to the Grammy's\nAnd shoutout everybody that ever said that I can't be\nAnd show her everything that she taught me done came in handy\nYeah, everything fine and dandy\nHurricane flow, dropped my album, it was Sandy\nOn another level so they couldn't understand me\nI guess I gotta take what I want it like Meyer Lansky\nShore is 'bout to get back, put your feet up and sit back\nBarely went gold but I got money just like I went plat'\nYou get that? Look like I went diamond just where my wrist at\nI eat a nigga first four bars without a Kit Kat, pause\nLet me get that, aw, how you get that far?\nCause when I ran out of gas, I had to push that car\nAnd when I ran out of cash, I had to push that hard\nLike Chris Paul when he push that ball, you dig?\nI ain't even used to live that far, you dig?\nI learned to hustle when I took that loss, I did\n18 when I took that charge\nTime to retire old niggas like they did Brett Favre, you dig?\nNew flows and new hoes\nNow I'm switching Ferraris just like I do clothes\nI run a business my nigga, I don't just do shows\nI don't just rhyme nigga, all I know is grind nigga\nI'm gone\n\n[Verse 3: Rockie Fresh]\nI'm looking at the plan like this shit might work\nBut if it don't work then this shit might hurt\nWe made first and goal now we gotta convert\nGotta get a couple mil' then go for dessert\nI'm tryna break the bank, I ain't breaking the news\nThat negative attention be the reason we lose\nInstead of paying bills, niggas wanna buy shoes\nIf it's money over bitches, is it that hard to choose?\nNah, give these fuck niggas some fame\n9 times out of 10 they wouldn't even sustain\nYou can tear they ass apart and let the pussy remain\nUntil the industry fuck 'em and then they no one again\nI always been me, I was never ashamed\nI understand that no man's path is the same\nAnd when you not lying you’re even harder to tame\nIf you ever tell the truth then you free in the game\nYeah, nigga don’t be a statistic\nHave yo main bitch sending me pictures\nFeeling futuristic, might buy me a Fisker\nOr a time machine to make the process quicker\nI ain't with the waiting but I stay patient\nI take work trips, I don't take vacations\nI'm headed to the top where I stay stationed\nYeah, nigga I stay stationed\nAnd I ain't with the drama, don't look back for that\nThe flow got more crack than the trap you at\nI'm done with bitter bitches, it's a wrap for that\nIf you're a angry bird, it's an app for that\nI waited for a minute for this plan to hatch\nAnd now I'm back with a brand new batch, yeah\nAnd it feel good when it go like that\nI spend quick and make the dough right back, uh\n\n[Verse 4: J. Cole]\nThis verse never before rehearsed, it was wrote on site\nTo slit a nigga throat on sight\nTook a whole lot of punches like the Cotto fight\nCole World, zip your coat up tight\nI put your soul on nice, illiterate, the boy don't write\nNever met a beat that the flow don't like\nIt's cold, Young C.O., L.E., call me Neo\nAnd if I ain't the one, I'm the prototype\nWoo, insane how I rhyme\nAll I do is brainstorm then I rain down lines\nShame y'all lying, me I'm the truth\nDog-eat-dog world nigga, we on the loose\nNiggas don't wanna hang, I'm the tree, I'm the noose\nYou lil pups couldn't pee on my roots\nTouch the people, I could be a masseuse\nThoughts black, I should be in The Roots\nWhile y'all foulin', me I just shoot\nFallon, Jimmy, nigga\nAsked for it nice now it's gimme nigga\nOnce poor now it's plenty, nigga\nStill want more, no Demi, nigga\nServe niggas quick like Denny's\nGot pennies for my thoughts, now look what I done bought\nDid the most with what I was taught\nA Carolina nigga bound to be the greatest, this a hell of a start\n\n[Interlude: J. Cole]\nCole, World, nigga\nDouble M-G, Dreamville shit\n\n[Hook: Wale]\nFolarin in this muh'fucker\nStill talking to you muh'fuckers\nIf it don't make your niggas proud\nThen this should never be allowed\nChurch", "album": "Self Made Volume 3", "image": "https://images.genius.com/a0e5d4137e24ca9bb8d23cbf6a051f80.500x500x1.jpg"}]}