{"artist": "Iggy Azalea", "songs": [{"title": "Iggy Azalea -  From a House Cleaner to a Famous Rapper", "lyrics": "Iggy Azalea is one of the most popular rappers at the moment. Maybe you've heard of her, maybe she's even your favourite, but do you know what she's been through? Do you know how she came to be, how many floors she had to scrub to become what she is at the moment?\n\nAll the famous singers look so perfect and fabulous but can you really see what's hidden behind their shiny smile? It's the pain, it's the difficulties they've been through. There's only a few of us who enjoy the perfect childhood or job. You may think stars are born stars, but if so, you're totally and utterly wrong. They've fought really hard their entire life to get where they are. So if you dream about being in their shoes you have to be ready and willing to do whatever it takes. Nothing is impossible, you just have to believe in yourself.\n\nA case in point is the overnight sensation – the rapper Iggy Azalea. Her birth name is Amethyst Amelia Kelly. Her nickname – Iggy Azalea, has quite an interesting story. “Iggy” is the name of her dog and “Azalea” is the name of the street she grew up on. Iggy's originally from Australia and her family has been in the country for over 100 years which means she has some Aboriginal blood. This fact explains her eye condition that only Aboriginal people have.\n\nIggy's life is not as easy as it looks. She comes from a rather poor family which used to struggled to make ends meet. Iggy's father, Brendan Kelly, was a painter. He build their own home by hand using mud bricks. Her mother, Tanya, worked as a  house-cleaner.\n\nAzalea first started rapping at the age of 14. At the beginning she formed a group with two girls from her neighbourhood who were not serious about the undertaking. That's why Azalea took the decision to disband the group. Then she dropped out of high school to pursue her dream and moved to America. She needed money so cleaning hotel rooms and holiday houses with her mother was her only way to save some extra cash. Azalea hated every school subject except for art classes. Another hard-to-believe fact about Iggy is that she had no friends there because all the kids were hateful of her home-made outfits.\n\nHer dreams were beyond anyone's imagination. She  left Australia at the age of 16 to pursue her dreams of becoming a famous rapper. In 2006 she told her parents she was going on a holiday but instead, she moved to the United States. Soon after she told them she wasn't planning on returning back home because of her desire to be close to the origin of hip hop music. Azalea's mum was crying when Iggy told her she wasn't coming back home. Tanya entirely supported her daughter because she knew it would really make Iggy happy.\n\nWhen Iggy first moved to Miami she knew only one person there. His name was Derek. It was the first time they met in person when he picked her up from the airport with his friends. That's when Azalea's career started.\n\nBut in spite of her instance success she never forgot where she came from. On the contrary, through her art, and more specifically, through her hit single “Work” she speaks of the struggles she had to face in life.\n\nThe story of Iggy Azalea is one of true perseverance, passion and hard work. It is a real example of how dreams come true. It is people like her that should be the role models of the younger generations because they are the ones who teach, and more importantly, who show us that everything is possible.", "image": "https://images.genius.com/76f39b66b2b431165a5f0061f648d4b2.1000x1000x1.jpg", "album": null, "year": null}]}