{"artist": "Pusha T", "songs": [{"album": "Fear of God", "title": "Raid", "image": "https://images.genius.com/262a2d9a193fe0dd97acc8982aa8c6e9.500x500x1.jpg", "lyrics": "[Verse 1: Pusha T]\nI’m only in the company of kings\nI made a power move and it’s everything it seems\nBefore 'Ye signed me, I was getting out my dreams\nStanding on the shoulders of twenty-thousand fiends\nEvery time a nigga wanna try and turn a profit\nFolks rush in, three letters try and stop it\nF-B-I-R-S, D-E-A\nOne letter short but still motherfuck the DA\nWe play by the rules as they try to crack the code\nCombination locks to the kilo’s that I hold\nLeopard print Louboutins prowling the concrete\nRollerballs come alive just like Jumanji\nYou know where to find me\nGreenhouse a circle of top whores\nMandarin, Gansevoort, any them top floors\n35 large, took it right out the top drawer\nStill got a throwaway phone in my sock drawer\n\n[Hook: Pharrell]\nIt’s like Raid! Spraying on you roaches\nThe AK is an animal, it is ferocious\nA nigga wanna sing, hope he is the dopest\nWatch that nigga disappear; hocus pocus\nRing, ring, a nigga won't sing\nRing, ring, I keep that bitch clean\nRing, ring a nigga won't sing\n'Less he is an insomniac, he'll die in a dream\n\n[Verse 2: 50 Cent]\nYou can tell I went to school on a small yellow bus\nNever bothered me, strong arm robbery\nI went from powdered jelly donuts to taking them Os\nFrom my high school sweetheart to fucking with hoes\nLook, I’m all grown up and I done blown up\nNigga, ain't much changed; in fact, things are the same\nI’m the definition of shooter, gun of choice, the Ruger\nYou’ll take my word for it or make me do it to ya\nI’m a magnet to murder, when I’m in the mood\nGet convicted through the forensics when you walk in my shoes\nI’m bad news, you niggas know the verdict, I’m filthy\nDrop Phantom is milky, white on white\n24 inch blades, I'm skatin'\nRed eyes, smoking that bomb shit, I'm Satan\nNigga, surprise, 50 back on fire\n50 back running round this bitch strapped, hitman for hire\n\n[Hook: Pharrell]\nIt’s like Raid! Spraying on you roaches\nThe AK is an animal, it is ferocious\nA nigga wanna sing, hope he is the dopest\nWatch that nigga disappear; hocus pocus\nRing, ring, a nigga won't sing\nRing, ring, I keep that bitch clean\nRing, ring a nigga won't sing\n'less he is an insomniac he'll die in a dream, ugh!\n\n[Verse 3: Pusha T]\nI sit with the liars, duck tape and tiers\nBeen lost their soul, they just waiting on the fire\nInnocent faces with a shitload of priors\nSomething out of nothing, a team full of MacGyvers\nDeep-sea dive for the fishscale\nTryna find a better price? Man, that ship sailed\nTake a breath and head back if that shit failed\nDrop weight like an anchor; then, you set sail\nHell freeze over like the watch I put the sleeve over\nEngine devil-scream when I turn the key over\nPirellis on the street rolling like a steamroller\nBitches double-team when I have my sleepovers\nYuugh! Re-Up Gang with the G-Unit\nThis is tailor-made, drug dealer theme music\nTest it on your tongue or either watch a fiend do it\nI got you hooked and I laugh as you lean to it\n\n[Hook: Pharrell]\nIt’s like Raid! Spraying on you roaches\nThe AK is an animal, it is ferocious\nA nigga wanna sing, hope he is the dopest\nWatch that nigga disappear; hocus pocus\nRing, ring, a nigga won't sing\nRing, ring, I keep that bitch clean\nRing, ring a nigga won't sing\n'Less he is an insomniac he'll die in a dream", "year": "2011-03-21"}]}