{"artist": "Wax", "songs": [{"year": "2019-08-23", "lyrics": "[Verse 1]\nI been drinking all day and was looking for love\nI got a call from a girl in the apartment above\nShe told me to come up and I was happy as hell\nI couldn't walk so well so I stumbled and fell\nA ten story fall down a fire escape\nI didn't wanna die yet but it was too late\nHalfway down I saw a flashing light\nA dude with a beard came into my sight\nHe said, \"My name is God and I been watching you sin\nI'm up here in heaven, do you wanna get in?\nApologize before you land\nIf you don't then you'll be damned\"\n\n[Chorus 1]\nI'll send you to hell\nIn a handbasket\nWhere you'll burn just like your body will\nYou're too fat for the damn casket\n\n[Interlude]\nSo I apologized\nAnd when I hit the ground I felt no pain whatsoever, I just ended up in this clear glass elevator and shot straight upward\nPast the clouds, past more clouds\nIt took a long time but eventually I saw the pearly gates of heaven\nAnd when I got to the pearly gates I noticed that they were very fancy\nThere's red velvet ropes everywhere\nIt was very, how do you say, prestigious\nAnd sure enough I was on the VIP list\nSo I decided to walk on in\n\n[Verse 2]\nOn the first day in heaven it was kinda cool\nI learned to play harp and sat by the pool\nSecond day I felt safe and sound\nJust eating grapes and floating around\nAnd there were clouds everywhere and they were kinda soft\nBut the novelty of sitting on 'em soon wore off\nI had a couch on Earth and it was soft to touch\nSat on that motherfucker way too much\nSo by the third day in heaven I was ready to drink\nMy tolerance level was starting to shrink\nSo for the next four days I searched near and far\nNot one liquor store, not a single bar\nSo when the first week in heaven was over\nI hadn't had sex and I was totally sober\nAnd that's when it occurred to me\nI can't do this for eternity\nSo why I went to God's office and I knocked on his door\nI told him \"I don't wanna be up here in heaven anymore\"\nI told him \"I appreciate you having me as a guest\nBut I just got one little request\"\nI said\n\n[Chorus 2]\nSend me to hell\nIn a handbasket\n'Cause if this right here is heaven\nHell sounds fantastic\n\n[Interlude]\nSo God went in the back and did some paperwork\nAnd sure enough my request was approved\nMy request to go straight to hell\nSo after that I got in the uh, the same clear glass elevator and went down\nStarted going down past the clouds, past the clouds, past more clouds, past the ground, going down, down, down, down, down\nIt seemed like it took forever, man\nIt was way down there, but eventually, I got to the gates of hell\nThe gates of hell, they weren't all Hollywood like the pearly gates\nIt was just like a red door on a brick wall, it looked like somewhere I would hang out on Earth\nLike a dive bar or somewhere, you know?\nSo I went in\n\n[Verse 3]\nOn the first day in hell I didn't like it a lot\nIt was really, really, really, really, really, really, really, really, really, really, really, really, really, really fucking hot, hey\nOn the second day I was less concerned\nAnd by the third day I was used to the burn\nAnd on the fourth day I started walking around\nRealized it was a hell of a town\nI saw liquor stores, strip clubs, bars, saloons\nAnd all my favorite musicians playing tunes\nI saw Eazy-E, Odie B, Mozart smoking PCP\nI got a shot of whiskey and they said it was free\nA little cocktail waitress came up to me, she said\n\"Do you want some morphine?\nI'm headed to an orgy\nI want you to escort me\"\nI said \"Sure please\"\nIt's New Orleans on crack\nHeaven, I ain't never coming back\nI'm a sinner with the liver of a Jack Kerouac\nSaw the devil drive by in a black Cadillac\nBiggie sitting next to him in the red and black lumberjack hat, goddamn\nFeeling so grand, got another shot of whiskey\nAnd I lifted up my hand, I said \"Hey, it's the new guy\"\nI wanna pose a toast\nTo the devil, not the Father, Son or Holy Ghost\nI'm about to spend infinity years comatose\nPush it to the limit, it's impossible to overdose\nI don't see the need to be forgiven\nI'm at peace being a heathen in hedonism\nI don't need the key to living, I'm already dead\nSo I drank and said, \"I love it here in hell\"\n\n[Outro]\nAnd what the fuck is a handbasket?\nIs it like a picnic basket?\nIt's a weird vehicle to use to go to hell in, wouldn't you say?\nDo we all have our own handbasket or is there like a ski lift going back and forth, from hell to Earth in handbaskets taking people down? I have no fucking idea\nIt's a really strange concept\nAnd I just can't grasp it", "image": "https://images.genius.com/4bc8913b2dd7d9cd803c4dd33ffb5834.999x999x1.jpg", "album": "Acoustic Monday Album", "title": "Handbasket (Acoustic Mondays)"}]}