{"artist": "King Los", "songs": [{"image": "https://images.genius.com/972fc6073ad82206821cfe0b1481f17e.320x320x1.jpg", "title": "2 Vs 1", "year": "2011-01-01", "album": "The Crown Ain’t Safe ", "lyrics": "[Hook: Los]\n2 verse 1, 2 verse 1\nShe give me that overtime then that new work come\nWhat you want the red bottoms and that new purse hun?\nWe can do that, but first I need that 2 verse 1\nDrop it low\nDrop it, drop it, drop it low\n(Dip it)\nBreak it, break it down\n[?] ..my flow\nWhat you want them Gucci boots and that new purse hun?\nWe can do that, but first I need that 2 verse 1\n\n[Verse 1: Los]\nYo, I'm icy, with a nice V out in SoHo\nYour wifey said she like me in a photo\nYour wifey and I might creep on the low, though\nCuz ain't nothing wrong with some Ice T and CoCo\nI'm Ocho, I don't need no strikes for the hoe though\n2 verse 1 for the night and I'm dolo\nLaid up with her all night? That's a no no\nSeen her back yard took [?] to the go-go\nWhite tee, Polo\nQuite G, low pro\nWe can just do it no Nike logo\nSpike Lee and at the game 'Mello dropped 40\nMoney real loud I don't yell a lot shorty\nLouboutin slippers Cinderella copped for me\nIf you got a hot friend you should tell her Hi for me\nShe say she got a man? Goddamn, how corny\nIf you treat the wood right a good.. [?]\n\n[Hook]\n\n[Verse 2: Los]\nUh, I got a Porsche Panamera\nAnd a drop top Super Sport\nBalling out like I wore my high tops to the court\nSuch a cool style, I could crush a crew down\nAnd got [?] like BOW! Motherfucker POOM, POW!\nHunt for the pussy, I'ma gut the womb down\nHe don't fuck you like me you should cut the fool now\nI'm stuntin' too loud, I don't hear those weirdos\nMy niggas move birds like scarecrows, here goes\nThe S-W-A-GG-AB-OY, know why? I'm Gucci crazy\nI've been running through the paper like its loose leaf lately\nHad a bitter past all I need is two sweet ladies\nBigger house, bigger living room\nAnd I ain't talkin bout the living room\nPlay soccer, nigga, all I do is kick it to em\nIf they want game, damn right I'ma give it to em\n\n[Hook]"}]}