{"songs": [{"year": "2015-03-24", "image": "https://images.genius.com/bc3682694015b348b51fa65b502ea038.715x716x1.jpg", "title": "Eyes Wide Open", "album": "Words Paint Pictures", "lyrics": "[Verse 1: Rapper Big Pooh]\nPushers and politicians often move with the same rhythm\nYou speak of government, my thoughts are cynical\nSo, while we're focused on the pinnacle\nThey getting paid off everything they label criminal\nThey not overturning then sentences, pouring in remembrance\nDream of Americana, no 'semblance to what they know\nLiquor in the cup watching curbs grow\nMy man gave me 2, he's trying to stack 4\nSee plenty dough, like a pizza shop\nGot preachers buying jets, stealing from their flock\nPop, pop, lost innocence\nPouring in remembrance\nPraying for us sinners, no difference between the two\nFountain of youth for the chosen few\nWant to control the population, poisoning the food\nWe got money for wars, can't feed the poor\n2pac was on to something, maybe more but we'll never know\n\n[Hook]\nEyes wide open, Lord, and I can't see\nThis is for the people, right?\nEyes wide open, Lord, and I can't see\nWonder how they sleep at night\nEyes wide open, Lord, and I can't see\nBut it's for the people, right?\nEyes wide open, Lord, and I can't see\n\n[Verse 2: Ras Kass]\nI'm spitting Alex Jones with immortal technique\nInfowars [?] from the sheikhs\nLove's going to get you, manipulate the feature though\nBarack should have brought your ass home a week ago\nLove decided by the color of skin\nLove subverted by the need to fit in\nSociety, why are we watching CNN\nThe White House put me back to sleep again\nHatred killed another unarmed black\nHard to land on my feet like a one-armed cat\nWe dying, Mr. President, you're lying, Mr. President\nIf Heaven got a hot spot, you're frying, Mr. President\nDemocrat, Republican, push the same agenda\nGlobal euthanasia by United Nation members\nInsomniac, don't be mad at me\nI see the knife, put your hands where my eyes can see\nWide open\n\n[Hook]"}], "artist": "Rapper Big Pooh"}