{"artist": "Cappadonna", "songs": [{"title": "Life of a Lesbo", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Cappadonna]\nUh-huh, yeah bitch!\nSame struggles, uh, everyday\nHold this, come here girl\nHmm... give me a kiss, muaww! Heh..\n\n[Verse 1: Cappadonna]\nI know these two fly chicks, that used to be legit\nThey said they don't like niggas no more, and plus they hate dick\nWith all due respect they wanna love and trick\nAnd I don't know if it's a good thing, or maybe they sick\nAnd I just can't understand, whatever happened to the plan\nYou used to walk like a woman and dress to the T\nNow you try'nna be the man that your father used to be\nActin' like you got a cock and you love pussy\nYou and my baby mother did it, go 'head push me\nAnd believe me, it's true, I know your whole style boo\nYou eat rats, bitch, you got worms deep inside you..\n\n[Chorus: Cappadonna]\nLife of a lesbo (uh, uh, uh)\nLife of a lesbo (come here, I don't know you was like that)\nLife of a lesbo\n\n[Verse 2: Cappadonna]\nEven though you independant, and you makin' the big dough\nHate your own father and you used to be ho\nBitch, it's alright to cry, chick, here have a shoulder\n'Member you was 13? Now you much older\nUsed to be a hot chick, now you much colder\nYou love other bitches, girl, you don't want a soldier\nTo all the fly honies that's livin' it well\nUsed to be a lesbo, but think you want dick now\nYa'll best to stop frontin', cuz you really want both\nMe and my ex-wife came down Tiffany throat\nI fucked both of those bitches, then I went broke\n\n[Chorus: Cappadonna]\nLife of a lesbo (uh, uh, uh)\nLife of a lesbo (come here, I don't know you was like that)\nLife of a lesbo\n\n[Outro (during Chorus): Cappadonna (sample)]\nThat's what's up... yeah\nYo.. you know me, 1, 2, 3 chicks, it don't matter\nI did it all... I love 'em\nLife of a lesbo, let's go\nUh-huh, this one right here go out to all\nMy homegirls up north, Bedford Hills\nAlbion, knawhatimsayin? Rosinger, haha, hold ya head up\nThat's my word, yeah, this one go out to Candy Apple\nMy home girl Sugar Walls, Eye Candy\nCinnamon, Passion Fruit, Melony, Water Melon\nYeah, life of a lesbo... uh... uh..\n(We got eyes, but we can't see\nWe have ears, but we can't hear\nWe've got a tongue, but we can't speak\nWe are living men, but we are dead mentally)"}]}