{"songs": [{"lyrics": "[Intro]\n(Ay man)\nI  bet something shake (It's DaBaby, bitch)\nI  bet something shake\nLook\nI bet something shake (I don't know 'bout these other niggas man)\nI  bet something shake (But for me, Baby Jesus, DaBaby? Me and my niggas?\nI  bet something shake (We gon' make something shake, nigga)\nI bet something shake (Quit looking for handouts nigga)\nLook  (Let's go! Aw shit)\nI bet something shake (I thought it was gon' drop it, but we gon' leave it anyway)\nI bet something shake\nI bet something shake (DaBaby, yeah!)\n\n[Refrain]\nI  bet I make something shake\nI try not to get in the way\nI'ma buy me a nigga today\nProlly rob me a nigga today\nI'm tryna go on vacation\nAnd I'm tryna go with your bae\nI told her I'm patiently waitin'\nShe say she don't know what to say\n\n[Interlude]\n(I told her I was tryna take her on vacation)\nI bet something shake\nI bet something shake\n(She said, uh, I don't know, you better watch him)\nYeah\n\n[Refrain]\nI bet I make something shake\nI try not to get in the way\nI'ma buy me a nigga today\nProlly rob me a nigga today\nI'm tryna go on vacation\nAnd I'm tryna go with your bae\nI told her I'm patiently waitin'\nShe say she don't know what to say\n\n[Verse 1]\nThese niggas know they wanna be me, be patient, I'm just gettin' started\nWas guaranteed to make the TV, you play me, it's gon' get retarded\nI got in the club with my pistol, I cut up and shut down the party\nAin't worried about none of these niggas 'cause I'ma do my thing regardless\nThey say I put on for my city, they say that I put on for Charlotte\nI'm busting jiggs at my shows, just pulled up and I seen 'em chargin'\nI'm not a local celebrity, all of this shit, it took off unexpectedly\nI tell the truth, I don't speak hypothetically\nDo what I did and I do it successfully\nPull up in a whip with a bitch from the other side\nShe told me to pull out my dick 'cause she want a ride (Pull it out, let me see it, damn\nOkay, at the next red light, I got ya\nShe do her thang with that head, she a monster\nShe gon' cut up 'cause she fuck with the baby\nAfter she tell you what up with dababy", "album": "So Disrespectful", "year": "2016-03-18", "title": "Make Sum Shake", "image": "https://images.genius.com/5ccfd7986bb8d319dc1bd2ec10e1ebd8.1000x1000x1.jpg"}], "artist": "DaBaby"}