{"artist": "A$ton Matthews", "songs": [{"title": "Exitus", "image": "https://images.genius.com/103d9253d69ccc9cdf420e8f83e30587.500x500x1.jpg", "album": " A$ton 3:16", "lyrics": "[Verse 1: Aston Matthews]\nLord make a way I ain't perfect (Lord)\nProvide the light while I'm searching\nLord take away my mom's burdens, before I think about murking\nAnd is the work that I'm putting in worth it?\nLord knows that I'm putting that work in\n40cal lurking in the same burban I'm swerving to work in, what is my purpose?\nDo I have one?\nCause I feel no feelings til I'm filling in this magnum\nAnd I fuck her til her back numb\nMan I said i'd stop cheating on the last one\nAm I a man of my word? Cause that's all I got and my balls, and I let those fall into her\nMy girl heart is gon' hurt and my heart is with her\nShe could do better but she don't, cause she don't wanna run her risk of ending up alone\nWhy do I take advantage of all of that?\nCause she home and not calling back\nMaybe my Paranoia started all of that\nOr is somebody else the reason for all of that? all of that\nWhy everybody reaching for a handout, Like hard work doesn't stand out\nMan I came up on my own two, I made me the man that I am now\nWhy my nigga Looney seeing time like that?\nWhy my nigga Ralph gotta die like that?\nLeft behind two kids, cause of a night like that? Why a life like that?\n\n[Verse 2: Aston Matthews]\nWhy they all talk like they really want a problem? They don't want War cause we all get involved in\nRed, Blue, Brown Bet they all get involved in, If its my name that they calling\nWhy they all talk like they really want a problem?\nRed, Blue, Brown Bet they all get involved in\nIf its my name that they calling, I hope they ready cause we all in\nIm free falling in this 24\nThinking I done seen the world before I'm 24 (Brick)\nI bend blocks just to get the dough\nI got shot and I let him go (Flair)\nGot me staring in this white light\nGot knocked and got back in the same night\nGotta get back in the same night\nThis life I'm living no it ain't right\n\n[Bridge]\nIm just tryna make a way for me,(Lord) I'm just tryna make it through the day homie\nIf I'm slipping and they waiting on me,Thats why I change clips like a change [?]\nGranny always said her prayers for me, so I know she really cares for me\nIf I don't make it through the night (whats the word)\nJust light it up and put one in the air for me\nJust put one in the air for me(Brick)\nJust light it up and put one in the air for me(Flair)\nJust put one in the air for me(Brick)\nJust light it up and put one in the air for me(flair)\nJust put one in the air for me(Brick)\nOne time for my dead homies (Flair)\nIf I don't make it through the night\nJust light it up and put one in the air for me", "year": "2014-03-16"}]}