{"songs": [{"lyrics": "[Jay-Z]\nYou plan to bang, I plan to bang too\nYou playin' the games, I'm seein' the thing through\nYou sayin' my name to entertain ya crew\nI ain't playin' no games, when shots exchange you're through\nFresh off probation I got a charge to throw away\nMy lawyer say for eighty large it'll go away\nAnd that ain't no money to Jay\nSo you could get it broad day on Broadway while TRL's tapin'\nYou playin the game you know you ain't gon' win\nQuit playin them childish games with grown men\nI don't give a fuck about cars or chrome rims\nI got apartments you could put your home in\nCan I live?\n\n[Jay talking to Funkmaster Flex]:\nCan I keep goin'? I wrote... Can I keep goin'?\nDo not put my verse on y'all records dawg!\n{Laughing}\n\nThe boy trap money like bear hunters\nDear Summer, I know y'all gonna miss me\nFor we been together like Nike Air's and crisp T's\nS. Dot's and Polo fleece's\nPurple label shit with the logo secret\nGimme a couple of years, shhh, I might just sneak in\nA couple of words and like Peaches & Herb\nWe'll be reunited and it feel so hood\nGot the whole world sayin' \"How he still so good?\"\nWell I do this in my slumbers, Summer\nI ain't none of these half-assed new comers, you know how I do Summer\nI drop heat when you bring the sun up\nThe combo make niggas act up I pick the gun up\nNiggas back up they know I ain't no fronter\nI don't talk shit I just flip and \"Un\" ya\nSorry Lance I'm just tryna advance my quotes\nI ain't makin' you the butt of my jokes\nLet's not stray from what I came to say\nTo my beloved, I think we need some time away\nThey say if you love it\nYou should let it out the cage, if not fuck it\nIf it comes back you should know it's there to stay\nIt's tuggin, at my heart but this time apart is needed\nFrom the public, should've gave me the Pulitz'\nBut instead gave me they ass to kiss\nBut you know me, thugging till the casket dips\nBut still shine light down on all my peers\nI know they weird, some queer, I still want them to share\nIn all the success I receive, I know you can't believe\nI still love 'em but they don't love me\nThey like the drunk uncle in ya\n{Laughing}\nThough they lame it's still the same still you love 'em the same\nLike when cats make subliminal records\nKnow they can't directly direct it at me I don't respect it\nAnd you don't really want it with Hov for the record\nI put a couple of careers on hold - you could be next kid\nYou keep entering the danger zone\nYou gonna make that boy Hov put your name on a song\nIf you that hungry for fame cocksucker, c'mon!\nSay when, take ten paces and spin\nBut on another note I'm bout to take another va-cay on another boat\nGoddamn a motherfucker rode his way out the hood\nAnd I pray that I stay out for good\nBut any day you know a nigga could try to play like he Suge\nThen I gotta pull it like Dutch Schultz\nYou pass the Dutchy I'll blast you trust me\nNiggas can't fuck with me\nI'm in a good mood y'all lucky\nI'm in a good groove\nAnd I ain't tryin to mess my thing up\nBut I will lay down a couple green bucks, get you cleaned up\nNon-Pulp Fiction, Colt 4-fifth and\nYoung niggas that blasphemy, blast for me, no religion\n\n[Jay talking:]\nYo, I'mma stop Flex, I don't want nobody to catch feelings\nI had to take off the blazer, loosen up the tie\nStep inside the booth, Superman is alive\n{Laughing}", "title": "Can I Live Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": "2005-02-07", "album": null}], "artist": "JAY-Z"}