{"songs": [{"lyrics": "WHOO!\n\n[Hook]\nMemph' Bleek always smokin that la-la-la (HOO)\nBeanie Sigel always smokin that la-la-la (HOO)\nKanye track smoke like la-la-la (HOO)\nIt's the R.O.C. mami, sing our lullaby\nC'mon!\n\n[Hook]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n\n[Jay-Z]\nI know my English ain't as modest as you like\nBut come, get some, you little bums\nI take the cake from under the baker's thumbs\nI bake the cake, get two of them for one\nThen I move the weight like I'm Oprah's son\nUh, I'll show you how to do this son\nYoung don't mess with chicks in Burberry paddings\nFake Manolo boots straight from Steve Madden (u-uh)\nHe padded hisself the rap J.F.K., you wanna pass for my Jaqueline Onassis\nThen, hop ya ass out that S-class\nLay back in that Maybach, roll the best grass, I ask\nHave you in your long-legged life\nEver seen a watch surrounded by this much pink ice?\nLook but don't touch, motherfucker think twice\nCause the gat that I clutch got a little red light\nNeed a light?\n\n[Hook]\nTo smoke that la-la-la\nBeanie Sigel always smoking that la-la-la\nMemph' Bleek always smoking that la-la-la\nIt's the R.O.C. mami, sing our lullaby\nC'mon!\n\n[Hook]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n\n[Jay-Z]\nWe got brothers full of Arm'i, mami's in Manolo\nBags by Chanel, all Louis Vuitton logos\nAll attracted to Hov' because they know dough\nWhen they see him, whips be European\nIf you're a ten, chances you're with him\nIf you're a five, you know you ridin' with them\nSick with the pen nigga, no physician in the world could fix him\nNo prescription, you could prescribe to subside, his affliction\nHe's not a sane man, he's more like reign man - twitchin'\nYou can't rain dance on his picnic\nNo Haitian voodoo, no headless chickens can dead his sickness\nNo Ouija board, you can't see me dog, nigga you CB-4\nThis ain't Chris Rock bitch, it's the R.O.C. bitch\nAnd I'm the franchise like a Houston Rocket, Yao Ming!\n\n[Hook]\nStill smokin that la-la-la\nMemph' Bleek still smokin that la-la-la\nBeanie Sigel, Desert Eagle, the four-ty five\nIt's the R.O.C. baby, sing our lullaby\nC'mon!\n\n[Hook]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nHold up, skip all the singin' let's get right tonight mami\n\n[Verse Three: Kanye West]\nShe playin she hate when I'm name droppin\nSo when I talk rap, she gon' change topics\nBut I got a plan B that's planned out, for when things don't pan out\nHov' tellin ya mind brother, I'mma play shy brother\nSo you take the Destiny Child girl in the Coupe?\nThen I'mma try bag the ones that got kicked out the group\nI figured that'll be simple, I'll just help 'em with their demo\nHelp 'em to the limo, play the upboard instrumentals\nAnd she - grabbed my tattoo, peeped my credentials\nAnd she - grabbed my pants, felt the potential\nAnd I - rubbed 'bout every essential\nThat have fun breakin her fundamentals\nExcuse me miss, the artist of the new millenium\nHas finally stopped drivin that blue Millenium\nAnd got a good of trenny and filled it with plenty of Henney\nAnd Rémy and weed, 'til she higher than helium\n\n[Hook]\nIf she pass me, smoke that la-la-la\nMemphis Bleek always smokin that la-la-la\nBeanie Sigel, Desert Eagle, the four-ty five\nIt's the R.O.C. bitch, sing our lullaby\nC'mon!\n\n[Hook]\nExcuse me miss, I'm the shit\nYou should come, hang with me, basically\nWHOA, skip all the singin' let's get right tonight, mami", "title": "Excuse Me Miss Again (Remix)", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg", "year": null, "album": "I’m Good"}], "artist": "JAY-Z"}