{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/077f633f603d1257f475e91f551b152e.1000x1000x1.jpg", "year": "2019-01-18", "album": "We All Shine", "lyrics": "[Intro]\nCor-Cor-CorMill\nYou know what I'm sayin', we go by YNW\nAnd I don't think the world really ready for this right now\nBut we really from another fuckin' Earth, another planet\nWe like to say Venus, you know\n'Cause these freaky lil' bitches like\nSwallowin' our penis and then, other nasty things\n\n[Chorus]\nI'm like hold up, wait a minute (Minute)\nUh, they let me in it (In it)\nUh, they let me in it (In it)\nThey be like, \"Oh, that's Melly, yeah, the menace\" (Okay)\nI be like, \"No, lil' bitch\" (No, lil' bitch)\nSuck on it slow, lil' bitch (Suck on it slow)\nFuck on the floor, lil' bitch (Fuck on the floor)\nI ain't lettin' go, lil' bitch (I ain't lettin' go)\nI'm like hold up\nDo you want that? 'Cause we on that\nAnd we strapped up with them 40 Glocks\nWith the laser beam and we on that\n\n[Verse 1]\nAyy, on that\nOh yeah, it's hot in here (Hot in here)\nYeah, it's hot in here (Hot in here)\nIt's gettin' hot in here (Hot in here)\nOoh, pole, huh\nHit that lil' bitch with the broom, huh (Broom)\nWhy in the fuck is Melly walkin' around with all of these goons? Uh (Goons)\nWhy in the fuck is them birds, them chickens, and all of that in the room? Uh (Room)\nWhy in the fuck did you just hop in the car, and just went drove? Vroom, vroom\nIn an underwater motherfuckin' wave with you, wave\nAll these bitches gettin' bad, they ain't gon' behave with you (Yeah), huh\nAll of my bitches be bad, they not gon' behave with me (They bad), huh\nAll of my niggas gon' ride, my niggas gon' shoot with me, ayy, ayy\nThese bitches be suckin' on dick just for a two-fifty\nTwo-hundred fifty dollars if she wanna suck it, buy that bitch some new Givenchys (Dirty bitch)\nNew titties, new ass, big boobs\nFucked the ho in my Christian Loubs\nMelly screamin' out \"Woo, Woo\"\nBlood Gang but my niggas bangin' blue (SuWoo)\nGoddamn, how you did that?\nHow'd you flip that? How'd you break 'em down like a Kit-Kat?\nThen rob his ass, then he'll steal your friend\nIf he try somethin', he'll get kidnapped\nOr bitch slapped, or somethin' else\nI don't know the rest\nThese hoes fuck, they suckin' dick\nI'm all inside your mama chest\n\n[Chorus]\nI'm like hold up, wait a minute (Minute)\nUh, they let me in it (In it)\nUh, they let me in it (In it)\nThey be like, \"Oh, that's Melly, yeah, the menace\" (Okay)\nI be like, \"No, lil' bitch\" (No, lil' bitch)\nSuck on it slow, lil' bitch (Suck on it slow)\nFuck on the floor, lil' bitch (Fuck on the floor)\nI ain't lettin' go, lil' bitch (I ain't lettin' go)\nI'm like hold up\nDo you want that? 'Cause we on that\nAnd we strapped up with them 40 Glocks\nWith the laser beam and we on that (On that)\n\n[Verse 2]\nOh, oh, oh, ah, ah, ah, ah, ah, from this, ayy\nI had to boost up my bonfidence, uh\nI had to boost up my confidence, uh\nShe wanna fuck 'cause I'm arrogant, uh\nMelly got bricks, he so celibate, uh\nDon't wanna fuck with these lil' biddy bitches\nThese bitches be envyin' jealousy, uh\nI got me some bricks and I'm sellin' 'em, uh\nI got me that white, I was sellin' it, uh\nThese niggas be trippin' and cappin'\nThey talkin' like how they was trappin' and heroin, uh\nI promise that I never trapped\nI promise that I tried to trap, the shit didn't work\nI upped the tool and go berserk\nMelly Baby put the school on red alert\nDon't you play with me, bitch\nPussy boy, you a jerk\nPussy bitch, you a squirt\nMake your ho pussy squirt\nPull up in a fuckin' vert\nGo and get a check or somethin'\nIf you don't, better go flex on somethin'\nHell nah, we don't care about the Facebook, Snapchat, none of that\nHope my ex on somethin'\nHold up, wait, my ex or somethin'?\nYou wanna fuck on my ex or somethin'?\nGo'n 'head and fuck on my ex or somethin'\nTell the ho to give me some neck or somethin'\nGoddamn, homie, done flex on 'em (Okay, ayy)\nI'm flexin' on 'em (Okay, ayy)\nHundred round drum in that chop\nOh, oh, I'm checkin' on you (I'm checkin' on you)\nOh, wait, ooh, ooh, ooh, ooh, I'm checkin' on you (I'm bheckin' on you)\nAh, ah, ah, ah, I put... (What's brackin', Blood? Slime)\n\n[Chorus]\nI'm like hold up, wait a minute (Minute)\nUh, they let me in it (In it)\nUh, they let me in it (In it)\nThey be like, \"Oh, that's Melly, yeah, the menace\" (Okay)\nI be like, \"No, lil' bitch\" (No, lil' bitch)\nSuck on it slow, lil' bitch (Suck on it slow)\nFuck on the floor, lil' bitch (Fuck on the floor)\nI ain't lettin' go, lil' bitch (I ain't lettin' go)\nI'm like hold up\nDo you want that? 'Cause we on that\nAnd we strapped up with them 40 Glocks\nWith the laser beam and we on that\n\n[Outro]\nYeah, we really on that\nWe really on that, no cap\nYes, sir", "title": "Hold Up (Wait 1 Min)"}]}