{"artist": "6ix9ine", "songs": [{"year": "2018-02-23", "title": "93", "album": "DAY69", "lyrics": "[Intro]\nScum Gang!\n\n[Chorus]\nBang! Run up, kick the door\nBang! Fuckin' up that pole\nBang! Nigga want that smoke\nBang! Niggas do that talk\nBang! Fuck all that talking, let's go\nBang! Niggas don't want war\nBang! Fuck all that talking, let's go\nBang! Niggas don't want war\n\n[Verse 1]\nTEKA$HI69 don't fold, boy\nTEKA$HI69 on \"go,\" boy\nTEKA$HI69 tote poles, boy\nTekashi gon' let that go, boy\nWith that black .44, boy\nShoot you through your cross, boy\nLeave you in a hole, boy\nYou gon' get exposed, boy\nPull up with the Glocks out, red dots out\nPull the mops out and the chops out, niggas air it out\nGo all out, when we back out, that's a blackout\nShooters all go, they don't clock out\nThat's–That's a man down, when we rain down\nWe don't play around, you get laid down\nYou gon' stay down, throw shade now\nGet flamed now, you erased now\nLeave you face down on the playground\nPull up on a nigga, two-deep\nNiggas talkin' shit so I wanna' go see 'em\nIn a nigga city, ride around with the heat\nPop out, Glocks out, niggas ain't tryna speak\nFire on me, boy must be brazy nigga, uh\nRainbow lasers nigga, uh\nCut your face with a razor nigga, uh\nAmbulance can't save you, nigga\n\n[Chorus]\nBang! Run up, kick the door\nBang! Fuckin' up that pole\nBang! Nigga want that smoke\nBang! Niggas do that talk\nBang! Fuck all that talking, let's go\nBang! Niggas don't want war\nBang! Fuck all that talking, let's go\nBang! Niggas don't want war\n\n[Verse 2]\nBoy, you know you ain't thuggin', nigga\nYou ain't really on nothin', nigga, you don't want no trouble, nigga\nYou a fumble, nigga, you don't want it with my huddle, nigga\nUnder pressure, you'll crumble, nigga\nQuit frontin', nigga, boy, you need to be humble, nigga\nTen toes, I don't stumble, nigga, double-double, nigga\nTen shots, ten clips, one clip, I don't got no jumper, nigga\nMan, I swear this shit no fair\nYou don't wanna end up in them crosshairs\nLeave a nigga froze up in his Moncler\nACOG on his mug, make 'em more clear\nAnd I swear that the niggas deserve it, uh\nNiggas they snakes, they serpents, uh\nThey pussy and that is my verdict, uh\nRetaliate then we burnin' 'em\nI bust and I know that I'm hurtin' 'em\nShe suckin' him off the Percy, uh\nShe love me, she say I'm so perfect, uh\nThat's your bitch? She suckin' my posse up\nWe squaded, we lookin' like a mafia\nI'm booted, I pop me a molly, uh\nI'm geekin', I'm rowdy, I'm fired up\nI wish a little nigga would try and run up\nBang!", "image": "https://images.genius.com/e83f7a16e7b52dd05ecfe3566ceb40af.840x840x1.jpg"}]}