{"songs": [{"year": "1996-01-01", "title": "Hang ’Em High (Original 12\" Version) [A Cappella]", "image": "https://images.genius.com/95a9aaa45a6d2a1eb51de12561c4a049.600x600x1.jpg", "lyrics": "Sadat X - “Hang 'Em High (Original 12\" Version)”\n[Emcee(s): Sadat X]\n[Producer(s): Ali Malek]\n[Additional Programming: Diamond D]\n[Sample: Ennio Morricone - \"The Good, the Bad, and the Ugly (Main Title)\"]\n\n[Intro: Sadat X]\nWild Cowboys.  Legend of the Cowboy\n\n[Verse 1: Sadat X]\nA lot of niggas stepped up to the bad man\nChest puffed out with your head wide open\nHoping to spot a chip in this frame\nI’ll live then die by the burning flame of\nThe O.K. Corral, Cowboy style from\nThe corners on down to Colorado's.  Big niggas\nFrom uptown riding into Tahoe.  Uh\nSaloon setting, kids is walking ‘round, drinking\nWhiskey and Scotch strictly out of shot glasses\nLooking screw-faced at the next nigga who passes\nThere's women in garter belts and cigarettes\nAnd, on the side, there's the price game, niggas-playing-the-price game\nIndian Red was banging niggas in the head\nWith his man Apache Joe, they’ll take your money off the floor\nThey’re side-betting for a better, they’re making cheddar\nThat tribal shit is working—sound the wampum drums\n‘Cause my Indian mans’ll break the great dick—uh!\nWalk in the New York territory\nOn the back of a tree, there's a picture of me.  It says\nI'm lawless, flawless, a hustler, plus a gun-rustler\nWanted in Carolina for selling some of New York's finer\nMarshal Cooper say he want me, Marshal Cooper got to get me\nMarshal Cooper say he need me, Marshal Cooper better wet me\nI gathered all of y'all, all of my trusted men\nAll of my baddest niggas, niggas that's quickest with the triggers\nThere's disturbing news on the wire\nThat my dome piece is done sent to piece out for hire\nI ain't going down over no money exchange\nDo they forsake I, who reigns as King of the Range?\n\n[Hook: Sadat X] (x2)\nStroll through the hood with the Cowboy status\nIt’s the up-top famous, downtown baddest\n\n[Verse 2: Sadat X]\nMeanwhile, saloon setting is back to full swing\nBars getting money, people doing their thing\nThere's strictly Boss Players with this kid named Minnesota (My man)\nAs women start to fill up, turn the notch on the grill up\nAnd add more stakes to the house banks for gamblers\nHalf-pipes to scramblers are free for Wild Cowboys\nYou’ll never bring decoys if you want to make real noise\nThe bigger the stick, the bigger the fire.  I’ll never hit\nA man in the back—a coward acts like that\nLay out my black hat ‘cause I feel like the bad man\nWho on the rise.  The D's to Manhattan\nLet's walk the thirty paces on the Now Rule races\nOh, it's the Marshal Cooper, and I love how he doing this\nWomen saying, “Don't get hurt,” and I ain't planning on it\nTen steps taken as I hit the blam factor\nIs dick a actor or is Death the benefactor?\nLeave him twitching in the dirt like Cousin Harold from the Menace\nI'm in this to win this on the great, wide trail\nI'm ten times as bad as John Wayne could ever be\nPlus I'm down with the Indian, and he’d have to begin his shit again\nI'm responsible for that body in the alley\nI'll Louisiana Purchase that ass with Remy's purchase\nAnd hard shots of Tequila.  Where the dancing girls?\nLet's get right as the story unfurls\nPiano man keep playing, keep them keys banging\nFuneral man, dig three graves—there's gon’ be a hanging\nNow this right here ain't for the youth to see:\nA grown man assed-out, swinging from a tree\n\n[Hook: Sadat X] (x2)\nStroll through the hood with the Cowboy status\nIt’s the up-top famous, downtown baddest\n\n[Verse 3: Sadat X]\nJoe Tex was the biggest hombre from the projects\nHad all the work locked down, so he thought (Yeah, yeah, yeah)\nBut he drank and got loose-lipped, let a lot of news slip\nStripped of his game and got his self murdered\nThoughts of him are passing like the buffalo\nGot his self rocked in the ninety-six, brand-new Acura\nNiggas said it was lightning—BLAO!—blew out the back mirror\n(Hah, you know’m saying?  Dig it, check it out)\nThey say that Cowboys never die.  They just ride off into the sun\nA little tale from Sadat X of how the world was won\nCheck it out, remember this\nGun-slingers, dead-ringers with presidents\nIs found tied, with no explanation\nOf how they died.  Yo, the great Sadat X\nThe High Plains Drifter.  No question\n\n[Outro: Sadat X]\nWe gon’ do it like how it got to be done.  Wild Cowboy status stretches from here to everywhere, you know’m saying?  We got, we got the BX, we got uptown blocks, all uptown blocks (No question) all Bronx areas, know’m saying?  Aligned with Money Boss, you know’m saying?  Diamond, the whole crew D.I.T.C., so it’s like that.  We’re straight now.  It’s a whole new label—now I can be free, I can flex now", "album": "Hang ’Em High / Stages and Lights (Promo Version)"}], "artist": "Sadat X"}