{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/32566b274cb74d5e9bf6c13c96685a89.1000x1000x1.jpg", "year": "2017-04-04", "album": "Long Live Nut", "lyrics": "[Intro]\nKnow what I'm sayin'\n2 Chainz and that boy Wayne in here\nYou know, dream big go hard nigga you know\nFuck I came to do\n\n[Verse 1]\nYeah, look, I did Collegrove\nIf I drop an album, already sold, yeah\nLook, I swear I'll never sell my soul\nI make them feel it in a nigga's soul\nLook, okay you nigga still tryna go gold\nSwear I ain't ever goin' gold\nOnly thing gold is my wrist and my neck and my load\nAnd the safe but, you'll never crack the code\nAt the clear port, waitin' on the jet to unload\nWaitin' on the next nigga to fold\nFrom the project to the pro\nOnly thing bitch about the nigga, is my motherfuckin' hoe\nI just bought my BM a new mink coat\nGave her the petite that I needed a link for\nWhole lot of paper like we workin' at Kinko\nAnd we used to be broke, yeah\n\n[Pre-Chorus]\nStruggling\nI ain't even have nothing\nTurned nothing into something\nBack in the day we were thugging\nI remember we ain't have nothing\nI remember we were hustling\nI remember we were struggling\nWe was always up to something, yeah\n\n[Chorus]\nDamn, I've been broke before\nI said damn, I've been broke before, yeah\nI don't know if you've ever been broke before\nHave you ever been broke before? Yeah\nDamn, we were broke before\nCan't believe we were broke before, yeah, yeah, yeah, yeah, uh-huh\n\n[Verse 2]\nUh, big bottle full of champagne\n100 bottles we don't even drink, yeah\nLook how far a young nigga came\nLook how far a young nigga came, yeah\nBit down know you smell the campaign\nBit called lil' boy but I got some damn weight\nPull up in the down tank, make me go rampage\nJimmy Choo, we don't shop at Champs, man\nCartier all, I'm official\nAll of my dawgs, they official\nAll of my dawg got, all of my dawg we will kill here\nWhy play play with us when we all like Hitler?\nUh, two time for them real ones\nAnd to them fake nigga, fuck 'em all, we don't feel 'em\nAnd to whoever wanna get involved, we don't fear nothin', yeah\nOne call everybody gone kill somethin'\nI remember days in the trey as a little one\nRunnin' round with TJ, tryna pierce somethin'\nNow we run into the jet, yeah, the lil' one\n100K on my neck, yeah, the real one\nThat Audemar Piguet, I'm Bobby Boucher\nI'm with my goon today, so what will you say?\n200 grand walkin' through TSA\nYou wouldn't believe where a nigga used to stay\n\n[Pre-Chorus]\nStruggling\nI ain't even have nothing\nTurned nothing into something\nBack in the day we were thugging\nI remember we ain't have nothing\nI remember we were hustling\nI remember we were struggling\nWe was always up to something, yeah\n\n[Chorus]\nDamn, I've been broke before\nI said damn, I've been broke before, yeah\nI don't know if you've ever been broke before\nHave you ever been broke before? Yeah\nDamn, we were broke before\nCan't believe we were broke before, yeah, yeah, yeah, yeah, uh-huh", "title": "Been Broke Before"}]}