{"artist": "Ice-T", "songs": [{"title": "Our Most Requested Record [Long Version]", "lyrics": "[Opening Skit: Evil E as Mickael]\n(*Phone beeped)\nCome On!! pick up the phone, it's getting out my bubble\nI got to hear this new song.. he he he!!\n\n(*Phone beeped)\n\n[Ice-T as a Radio Request Line employee]\nYo, what's up? Request Line\n\n[Evil E as Mickael]\nYes, this is Mickael, I'd like to hear that new song about.. AWWHHH.. Ice-T\nI don't know the name of it but AWWHHH.. it's bad!\n\n[Ice-T as a Radio Request Line employee]\nDon't worry about that homeboy, we're about to rock it\nThat's our most requested record\n\n[Song's Intro]\n[Ice-T] Yo E, what's up man? they got our record on the radio boyyyy!!\n[Evil:] Yo man, they're rocking our stuff, Ice man\n[Ice-T] I'm telling you man, this is the Most Requested Record, everybody wants to hear this record\n[Evil:] It's for everybody, you gotta throw this stuff by respect.. what you think?\n[Ice-T] I know, you know what time it is, it's flying high\n[Evil:] Let me do..\n[Ice-T] I'ma tell them what's up!\n[Evil:] Yo Ice man, tell them boys what time it is ~\n\n[Ice-T]\nYo, one two, my name is Ice-T, I'm hear to let you know Rhyme Syndicate is in effect\nAnd where ever we go, me and my posse gets stupid respect (YEAH!!)\nBut good jerking this on juice, YEAHH!! just because where we're staying\nBut I'm here to let you know L.A. don't take no mess, understand what I'm saying?\nYo, this is the Most Requested Record, New York loves to hear this record boyy!!\n\n[Evil:] Yo man, Chicago loves this jamie, man\n[Ice-T] Detroit can't live without this record, man\n[Evil:] Yo, Memphis likes this jamie man\n[Ice-T] Miami wants to hear this record, and how they gonna say we ain't got beats?\nWe got Afrika Islam man, kick the swings up the hits\n[Evil:] Kick it A!!\n[Ice-T] There it go boy, you know that swing is so fly!\n[Evil:] Awww Yeah, you know the flavor my man\n[Ice-T] And I wanna let you know the publicity charm\nWell, this is coming from Los Angles, you know what I'm saying?\n[Evil:] Yeah, L.A.'s in effect, you know what I'm saying?\n[Ice-T] L.A. got it going on, but what does it matter where it's from?\nYou just listened to the beat of the drum, you know, and we're swinging out here in California, Yeah!!\n[Evil:] Awww YEAH!!!\n[Ice-T] But they say that STILL ain't fly enough E\n[Evil:] Yo, what's up with them chumps Ice man, they don't understand the beats man\n[Ice-T] I think they wanna hear some 8OA, some boom boom!!\n[Evil:] Boom boom!! Aww man, let's hit them the boom boom man?\n[Ice-T] Low temple, you know...\n[Evil:] Old 8OA man, they don't know about that man\n[Ice-T] Temps and flavor\n[Evil:] Yo, let's give it some flavor, we're gonna take the bass, man\n[Ice-T] I don't know man, I hope they're ready, let's change the temple!!\n\n[BOTH:] AAAWWWW!! YEAHH BOYY!! it's a big world\n[Evil:] Awww! what you know about that?\n[Ice-T] We did it fly now!!\nRun the Power Moves on them ----------- Bushwick Bill\n[Ice-T] Awww Yeah, Evil-E and Ice-T in here\nTrying to do one tip for all the ladies out there, what we're trying to do, E?\nRun the Power Moves on them ----------- Bushwick Bill\n[Ice-T] Yeah, you're knowing, all the posse deafly loves it, right?\n[Evil:] Yo, yo, yo, yo.. yeah!!\nRun the Power Moves on them ----------- Bushwick Bill\n[Ice-T] L.A. loves it, you know, we're kicking it man\n[Evil:] We're chilling, cold stupid in the place boyyy!!\n[Ice-T] Yeah, what?.. what?..\n\n[L.A.P.D]\nAttention the inside!! This is L.A.P.D\nTurn the music down; or we're coming inside\nThis is L.A.P.D!!\n\n[Ice-T] Awww man, I told you.. I told you not to play the record so loud\n[Evil:] Yo Ice, I won't man\n[Ice-T] All these.. aww man.. y'all.. hit the back door fellows..\n[Evil:] Awww man, but I got a warrant man\n[Ice-T] Wait a minute.. hold it.. hold it.. looks like they're leaving man\n[Evil:] Leaving?!!! WORD!!\n[Ice-T] Forget the police man, turn the music back on man!!\n\n[Ice-T] Yo, they knew better than coming here\n[Evil:] Yeah, Word word man, they knew better than that, cause my boys are in here\n[Ice-T] We're just having fun, but they BETTER not coming through the door\n[Evil:] BETTER not man, BETTER not\n[Ice-T] You know what? all the people out there wanna know exactly who we are\nWe've been talking, but they still wanna know who we are!\n[Evil:] Who you are Ice man?\n[Ice-T] Yo E, throw the jamie on, show them who we are, kick it!\n[Evil:] Bet man, bet it..\n\n[Break: Evil E Scratching and cutting quotes below]\nI.. I.. I.. I.. I.. Ice-T UHH! ----- Ice-T\nI.. I.. I.. I.. I.. Ice-T --------- Ice-T\nE.. E.. E.. Evil.. Evil E UHH! ----- Evil E\nI.. I.. I.. I.. I.. Ice-T UHH! ----- Ice-T\nI.. I.. I.. I.. I.. Ice-T --------- Ice-T\nE.. E.. E.. Evil.. Evil E ------ Evil E\nFLY!! ---------- Ice-T\nI.. I.. I.. I.. I.. Ice-T UHH! ----- Ice-T\nI.. I.. I.. I.. I.. Ice-T --------- Ice-T\nE.. E.. E.. Evil.. Evil E UHH! ----- Evil E\n\n[Evil:]\nYo Ice man, yo man, they don't understand about that fly Rap man\nWhy don't you throw them a fly jamie man\n\n[Verse One: Ice-T]\nWord! thinking of a demo, late nights alone in my lemo\nNot a Pictum my man, I'm talking black sadan\nStretched like a fine truck, E counts the grants\nMy plan; write a rhyme like nobody can\nTotally unpredictable, understand? (WORD!!)\nTalent is mine, but the judgement is yours\nYou vibe my records, my crew tours (YEAH!!)\nYou make request in my sale sore\nYou clear the shelves of the record store (UHH!!)\nSoft core I'm not, but knowledge I got\nI keep my posse in effect when I rock the spot\nGrand hot, or maybe you forgot\nYou should've cracked the jams early before the cops block the lights\nMack magnifier, Hitman for hire\nDrop when I fire, watch the guard wire\nIce ain't no lier, I'm never retire\nCause my back went ?? with young troops I inspire\nCold as nitrogen and fold as hydrogen\nThought you had a chance to wax, you better try again\nHip-Hop commando, Bum Rush Rambo (UHH!!)\nIntelligence is my weapon, dum dump my ammo\nIt's okay plea it, call it as you see it\nI'm from L.A. ~ this joint is like Viet-nam gangs illing\nWilding and killing, bars on your door please protect your children\nI ain't no bad guy though suckers may try, they say I'm violent WHY?!!\nBecause I'm fly, got girls to date, therefore\nDon't wanna hear no more, chauffeurs shut the damned door (WORD!!)\nCause I'm a player, I ain't no Beat-boy\nI love the ladies and money is my real joy\n\n[Break:]\n[Evil:] Word Them Up! Yeah, I know that was down, yeah, you know the poetry was deaf\n[Ice-T] Yeah E\n[Evil:] You know, just kick a little poetry for my posse Rhyme Syndicate in here\n[Ice-T] Hell yeah!! yeah baby, Beatmaster V rocking the drums\n[Evil:] Yeah, and my man Afrika Islam is on the drum\n[Ice-T] Charlie Jam boy, you know that, BG is in effect\n[Evil:] YEAH, XT, Gustie G\n[Ice-T] King Quality man, E-Mack Boy, E-Dubb\n[Evil:] Yeah, you know what I'm saying? E-A-SKi in the house\n[Ice-T] Yeah, Nat the Cat, D-Rock-ing a funky beat\n[Evil:] Yeah, and my man Mike, Mike Love, my man Hen-Gee are stood out there baby pal\n\n[Ice-T] DAT the Most Requested Record, if you don't play this record; you'll be sorry\nMy whole crew is gonna come down and have to..\nRun a bum rush on you, you know, the same stuff took a round, you know what I'm saying?\nSome ?? and all that fly stuff, you know, this is what you want, the beat\nThis is what you want to Rap, this is what you want\nIce-T and DJ Evil E, 1988, taking no ?? yeah boy\n\n[Evil:] Taking out all simps and suckers, y'all know the flavor, No Time\n[Ice-T] The Most Requested Record, everybody loves this record, Red Alert\n[Evil:] Yeaaahhh, this for my man Chuck, you know what time it is Chuck\n[Ice-T] Houston wanna to hear this record\n[Evil:] L.A. knows what time it is.. ha ha!\n\n[Closing Skit:]\n(*Phone beeped)\n\n[Nancy]\nThey will never pick up the phone, you're stupid!!\n\n[Rodney]\nThere I go again Nancy, can't you see I'm trying to get through?\nJust calm down like a Sugar Brown\n\n(*Phone beeped)\n\n[Ice-T as a Radio Request Line employee]\nYo, what's up? Request Line\n\n[Rodney]\nYes, this is your homeboy Rodney from DC, wearing red, white and blue\nI've been trying to get through, me and Nancy just wowed about that little song from Ice-T\nWe don't know the name of it but if you play it, we'll be more than happy\n\n[Ice-T as a Radio Request Line employee]\nDon't worry about it homeboy, we've just rocked it but we'll rock it again\nCause that's our most requested record!", "image": "https://images.genius.com/4087bd0151e7fc336a1bdb7aca3ef257.1000x1000x1.jpg", "album": "Rhyme Pays", "year": "1987-11-04"}]}