{"artist": "Pimp C", "songs": [{"album": "Side Hustles", "title": "All About It", "image": "https://images.genius.com/68c979ce5e6a9a4aeafee9e0e999e561.772x768x1.jpg", "lyrics": "[Verse 1 - Too $hort]\n\nNow who's sleeping on the midwest, better get your head checked\nNiggas gonnna feel this, even all the rednecks\nBounce to the beat when they hear this shit\nI've been underground damn near 20 years in the mix\nI moved down south cuz old man was wild\nMy lil homie rapping on, came to show you how\nTo take my skills and keep paying the bills\nFuck what you're saying cuz I'm staying real\nThe young homies keep me on my toes, still got the old flow\nBook me in your town and there'll never be a no-show\nKick it down south where they keeping it crunk\nCuz the niggas down south got they own funk!\nYou heard about the West Coast, heard about the East Coast\nHeard about Miami-base, but what about [?]\nOr Kalamazoo, they got MC's too!\nIf you come around my crew, you gonna have to say a few\nOr you can just get your bitch-ass out\nYou come to me you can play, sing, rap, no doubt\nYou got to go, what the fuck is this?\nHip-Hop Culture or the music business?\n\n[Chorus - Pimp C]\n\nBitch, I'm so all about it\nI just can't live without it\nBitch, I'm so all about it\nI just can't live without it\nNigga I'm so all about it\nI just can't live without it\nBitch, I'm so all about it\nI just can't live without it\nNigga I'm so...\n\n[Verse 2 - Pimp C + Too $hort]\n\n(Pimp C):\nBitch it's all about the indo weed and stacking money\nIn this land of milk and honey, ain't a damn thing funny\nLet's put this shit together, Too $hort and Pimp-C\nPut niggas on the map from Oakland to P.A.T\n(Too $hort):\nChicago and Detroit, Houston, Dallas\nSupport Short records and you can have this\nFunk 'till eternity, folks gotta learn to be together\nCuz we all on the same journey\nSo as I roll, I'ma look out for you\nIf I see you do it wrong I take my time and show you\nHow to get it right, make money every night\nGotta use your brain if you wanna win the fight\nEast coast, West coast, who got the best flow?\nMaybe at your next show, niggas oughta test your\nCrowd skills, and check your record sales\nThen we'll find out how you fake as hell\nI said it ain't where you from it's how you do it where you're at\nReal players from your town all knew that you was whack\nFake nigga in Cali', fake nigga in New York\nSmall time, you never be bigger than $hort\nNow why you trying to front so hard?\nYou from a gangster town but you is a punk ass mark\nRespect don't come cuz of where you from\nKeep it real in your heart from square one\nAnd all you highly influenced followers, on the wrong path\nSpitting game to make the motherfucking song last\nIt's a shame you can't make no cash\nEverytime we roll out we gotta wait on your ass\nYou're just slow, can't be down with nation wide\nCuz we seriously, trying to get the paper right\nTalking bout contracts, cash flow, credit cards, mean cars\nSignin lot of that for the next 16 bars\nMake a hit, get paid, get laid, what you want\nTellin motherfuckers where you getting all that money from\n$hort records now you trying to flip 18's\nGot what it takes make a hit, make G's!\n\n[Chorus]\n\n[Verse 3 - Pimp-C]\nSweet Jones, the pimp of the year\nRiding drop elderado with two carrots in my ear\nMy baby momma brother put me down with the D\nI bought my babe a 'lac and changed my name to Pimp-C\nI put the pimping down to the hoes\nNow $hort got me rocking on the microphone\nAnd all the trill niggas riding trues and vogues\nAnd all the bitch niggas trying to buy these hoes\nGot a bitch try to chip me on my cellular phone\nSmelling like 64-dollar cologne\nNigga got mad cuz his bitch chose me\nBut you just showed you ain't no real P.I.M.P\nLike Kool Mack A Ace and Sir Captain\nYou ain't no goldy motherfucker you was acting\nAnd all that punk shit we could do without it\nI'm still down with Master P so bitch I'm 'bout it!\n\n[Chorus]\n\n[Verse 4 - Pimp-C+Too $hort]\n\n(Pimp C):\nI dip from city to city, squeezing ass and titties\nThe head was good, but the pussy was shitty\nShe just wanna kick it with a rap star\nThe bitch got freaky, tried to fuck my car!\nATL, the city of bless\nWhere hoes like to take big dick in they belly\nGot two freaks from Decateur wanna lick our sacks\nI tried hit you $hort, man where the fuck was you at?\n\n(Too $hort):\nOut in Nashville, Tenessee\nBitches in with me for sure\nSipping on the Remy X ho!\nWith the hoes, last night I did that\nEvery blue moon I got to pull out my big hat\nDo some more shit other niggas can't do\nLike hooking up this funky ass nation wide crew\nWe come from everywhere, working under one roof\nCome through, front, somebody might stump you\nWith a rhyme or a boot\nWhat you finna do?\nGetting blood all over my nigga's tennish shoe\nYou better take my advice and get lost fast\nBefore them boys from Texas, get off in your ass\nAnd it won't be pretty, if my uncle Frank Middy\nCome lookin for you, shooting at you, it gets shitty!\nBut in your mind you rank higher than me\nPut your money in the bank then come wire it to me\nCuz I'll flip it, while you trying to buy a new car\nFind me in the studio signing new stars\nTake a hundred thousand dollars make a quick million\nStart from the floor and go straight to the ceiling\nYou hiding from reality, nigga you is a bitch\nNiggas like me get used to getting rich\nSigning autographs, taking pictures of my fans\nHit the town and take your bitch to my place\nShe get a bigger and better deal, fucking with me\nI heard $hort dog ran up in your freak!\nShe dissapeared, heard she went to Cali!\nJumped on the plane, and flew the bitch to Maui\nOr maybe Atlanta, I got your bitch posted\nPopping champagne bottles 'bout to get roasted\nChilling at the house, me and four hoes\nJumped in the jacuzzi ain't wearing no clothes\n\n[Chorus]\n\n(Pimp-C spitting game during the last chorus)\nSay $hort can I fuck?\nSmoke something bitch\nBitch!\nHol' up", "year": "2002-09-24"}]}