{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/7e8707e6b431e1efcbbd7d7e6cd95c9c.474x450x1.jpg", "title": "Turn it Out", "year": "2008-02-05", "album": "Half a Klip", "lyrics": "[Hook]\nRidin to the club, candy coated on the dubs\nWhat? What? We gon' burn out, burn out\nWhat? What? We gon' turn it out, turn it out\nNobody do it like G do it when he do it\nRidin to the club, candy coated on the dubs\nWhat? What? We gon' burn out, burn out\nWhat? What? We gon' turn it out, turn it out\nNobody do it, if beef do it, we see through it\n\n[Verse 1]\nYou see me coming with the roof up leaning\nWork on the block, I got the whole strip steaming\nGrab a stack from the stash for the evening\nRound it up with the click, now we breezing\nChrome glowing, the low pros all seasoned\nCuties stay blowing the do' for no reason\nWhat we spend on {?} alone can buy a Hummer truck\nNext week we up, chronic, hit the numbers up\nGet trucked up, the weapon in the stomach tucked\nClick on point, my gun is never blunted up\nRealise man, the 5 Fam running stuff\nAnd my guys playing many men that want it rough\nBut we really came to flash on cats\nAnd peep out a of couple ass on backs, smash on that\nShook nice cigars, jump the ash on cats\nThirty deep, V.I.P., in the back all that\nThrow my drink in a chick's face that act all wack\nLadies move, fix your attitude, get back on track\nAny problem with me leaving niggas back up back?\nAnd we lay last like Crack-A-Jack, put cash on that\n\n[Hook]\n\n[Verse 2]\nStraight gully, I give you that impression at the door\nSlut's chain, just came from dressing at the store\nAnd grown man cologne, shit exit out the pores\nBest up the front, Smith & Wesson in the draws\nGive coupons, freaks come a dime a dozen\nThen key shine, you could turn a dime to a dozen\nBack in this bitch right when you thought I wasn't\nIt's 5 Family Click, we all about thugging\nYou ain't bout money, you all about nothing\nThe timely fetish, the lines of credit\nGet this money and tell a dime to spread it\nPlaying with mines will fill this place with potent nines and medics\nThat's right, that little light up on the nine is reddish\nThe shorty in that Louis Vuitton line is precious\nWhole place filled with behind suppressors\nMight get the wrinkles out the way, I iron their dresses\n\n[Hook]"}]}