{"songs": [{"image": "https://images.genius.com/cf339d127a68116f79516928b71d2fa3.500x500x1.jpg", "album": "Royalty-Free Christmas Songs", "title": "Damn It Feels Good To Be A Santa", "lyrics": "[Verse]\nYo it's Santa, put all your hands up\nDamn, bruh\nThis rap track is a banger, standard\nI'm grabbing all the ham in the hamper\nSipping cognac brandy right out the decanter\nRiding my reindeer about at a canter\nGrabbing Dancer and Prancer's antlers\nYank them about for the banter, wow man, I'm random\nHanding bags full of bamboo to pandas\nAnd I'm giving Bob Ross fans a new canvas\nIs that a happy little cloud or a Santa?\nDang, it's the man with the fan club\nFrom Hampshire to Japan, Uganda, Rwanda, Sri Lanka\nMerry Christmas, happy Hannukah, Kwanzaa\nAs-salaam-alaikum, namaste, gouranga\nThank ya, or in Frankfurt: \"Danke\"\nBecause having good manners? That's gangsta\n\nGot a lap dance from an Elf up in Lapland\nTold me she's a bad lass, and I'd have to spank her\nWhat's good for the goose isn't bad for the gander\nHo ho ho is the fat man's mantra\nOop, that's another scandal\nI'll hand to my manager to handle and come up with an angle\nLike I'm a really nice version of Abu Hamza\nSnow hiding my dandruff\nDon't come down a chimney, that'll land you in handcuffs\nSorry Dorothy, we're not in Kansas\nCancer's starting a stanza that's starker than Sansa\nOr the seedier parts of Atlanta\nSex and the City cast: Parker, Samantha\nDon't let them tell you that you can't, 'cause you can\nAnd if the other kids in class say Santa's a sham\nTell them: That's fake news! Sad! Propaganda!\n\nPeople are mistaken in believing that Australia's\nCapital city's Sydney, it's actually Canberra\nJacksfilms, Dan Bull, assholes, cameras\nDon't read the comments 'cause they're bad for your grammar\nReading all your letters and their spelling got me anxious\n#YIAY, let Jack find the answers\nI invented product placement, ooh, Fanta\nThat'll go well with a Chandler lasagne\nNow I'm amped up, and that's just a sampler\nOf sounds that I'm sticking in your hippocampus\nIt is a Christmas bonanza, extravaganza\nAnd damn, it feels good to be a Santa (yeah)\nDamn, it feels good to be a Santa", "year": "2017-12-11"}], "artist": "Dan Bull"}