{"artist": "Pusha T", "songs": [{"album": "Fear of God II: Let Us Pray [EP]", "title": "Amen", "image": "https://images.genius.com/155375197720801e2327d2fc95837d08.1000x1000x1.jpg", "lyrics": "[Intro]\nIn the midst of negativity\nA positive sight can be blurred\nAnd the visions that we thought were good\nSeems to let evil occur\nWhile still possessing our human form\nWe live life searching for greatness since the day we was born\nAnd as we bow our heads at night, rich, wealthy\nOr poor with dislike, we pray, asking for\nForgiveness for our sinful ways\nWith mind, body, spirit and faith, we pray\nAmen\n\n[Interlude: Shawty Redd]\nYeah (amen) you like that right? (amen)\nI wrote it myself by the way (amen)\nYo, Young, Jeezy, Jizzle, Snowman (amen, amen)\nWe gotta give the streets what they want, man (amen)\nFuck the goddamn shit (amen)\nYou gotta get it in, bruh, let's get it (amen)\n\n[Verse 1: Kanye West]\nYou like that, don’t ya? I wrote it myself, by the way\nAnd I don’t mean to be selfish, but I picture myself gettin' paid\nAnd you might catch pneumonia, 'cause I'm colder than a elf on a sleigh\nUh, me and Pusha back on it, now everybody help us pray\nLord forgive my sins and all my friends\nDollars make sense, I’m tryin' to get paid\n\n[Verse 2: Pusha T]\nTryna get saved? (Too late!) time to get paid\nGot a gun and a stockin' mask, niggas thought I was tryna get waves\nI’ma let all y'all niggas pray for it, my young niggas knockin' off a K for it\nSold my soul on the back end, only fuckin' way I’ma pay for it\nFront that shit you put a flame on, my niggas locked in a cage for\nThey keep tellin' me to go hard, number one spot you was made for\nYuugh! I made more, front of the grill, got a racehorse\nCalifornia Crayola red, \"Glow In The Dark\" like a Ye tour\nFuck niggas steppin' in my lane for, not knowin' that it’s a landmine?\nSoon as a nigga feel a cool breeze, throw the top up like a gang sign\nRed or blue, Crip or Blood, solitaires, diamond studs\nLike chandeliers, I’ma flood, black Jesus piece like it’s dipped in mud\nFashion gods, notice mine, rollerball spikes, I’m Pokémon\nParis shit, Louboutin, under bright lights, where do you belong?\n\n[Chorus: Shawty Redd]\nPlease Lord, yeah, it’s gettin' realer everyday\nNiggas killin’, niggas starvin', ayy, 'cause they can’t find no yay\nSee the first they roll around and their bills they cannot pay\nSo some be trappin', some be dyin', bow our heads and let us pray\nAmen\n\n[Verse 3: Kanye West]\nAmen, how many people do you know hatin’\nOn your downfall, sittin' there, waitin’?\nWhen you shine, I don't know what they gon' say then\nEverything I do now stadiums\nSo tell me what they really gon’ say to him\nAnd I’m headed straight to the ATM\nFinna go HAM, nigga finna go in\nNigga you'll get it when pigs fly\nWhen Yeezy fake, Devil’s pie\nPiece of cake, Kit-Kat\nI need a break, God’s child\nJesus Christ, club like a broken neck\nI need the ice, I need the lights, uhh\nIn Egypt they fightin’ for freedom\nCop pull you over, no reason, beat 'em\n\n[Chorus: Shawty Redd]\nPlease Lord, yeah, it’s gettin' realer everyday\nNiggas killin’, niggas starvin', ayy, 'cause they can’t find no yay\nSee the first they roll around and their bills they cannot pay\nSo some be trappin', some be dyin', bow our heads and let us pray\nAmen\n\n[Verse 4: Young Jeezy]\nI got them units packed in that black van like the A-Team\nEven seen 'em come 2-tone like a Saleen (Saleen?)\nSaleen, yeah that’s a Mustang\nBreak ‘em down in the night, that's what I call hustlin'\nThey say they want that dumb shit, well, this is ignorant\nCondo on the timepiece, yeah, now that's ignorant\nThey like, \"Young, you a fool\", yeah I coulda bought some real estate\nInstead I bought a half a block and tried to sew up half the streets\nI’m on 75-75, when they was going for the 25\nGuess who’s pickin’ up a trey? Just an ordinary day\nWith extraordinary pay, extraordinary risk\nCan’t even explain, got an extraordinary wrist\nI talk it 'cause I lived it' man, this shit ain't really nothin' to me\nTell ya like Sosa told Tony, “Don't you fuck with me”\n\n[Chorus: Shawty Redd]\nPlease Lord, yeah, it’s gettin' realer everyday\nNiggas killin’, niggas starvin', ayy, 'cause they can’t find no yay\nSee the first they roll around and their bills they cannot pay\nSo some be trappin', some be dyin', bow our heads and let us pray\nAmen\n\n[Outro: Shawty Redd]\nAmen, amen, amen, amen\nAmen, amen, amen, amen\nAmen, amen, amen, amen", "year": "2011-11-08"}]}