{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Intro]\nAmerican lowlife (lowlife)\nYo, c'mon\n(You dirty, crusty, ass, lowlife)\n\n[Verse 1]\nYo, yo\nYou got a problem? Tell me, let's handle this\nWe can do this in the parking lot, bang fists, some Rugged Man shit\nI'm suicidal, ain't the issue\nI feel like playing games, Russian roulette, with a fully loaded pistol\nHold down, can you feel it? I break that shit\nBrought that fat chick with you, I take that bitch\nI love this, now who wanna try to take me\nI take it to the ground, grapple like Royce Gracie\nShit ain't all sweet, talk is cheap\nI'm the white dude, you see me in the club, dancing all off beat\nInspiration, no one, don't poke fun\nNo gun with you, how you gon' cause commotion?\nI hate the whole world, wait the whole world hate me\nMy whole family, looking at me strange lately\nBorn to be wild, born evil, dangerous\nBorn lethal, I was born to skeeve people\n\n[Hook]\nAmerican lowlife, dirt bag, my team\nSmelly armpits, bad breath, low hygiene\nWhat do I mean? Smell me, rub my belly\nCall my celly up and tell me (Yo, yo, you dirty)\nI'm unhealthy\nAmerican lowlife\n(You dirty, crusty, ass, lowlife)\nLowlife, lowlife, American lowlife\n(You dirty, crusty, ass, lowlife)\n\n[Verse 2]\nWhen I see you, walk away, best duck down\nSmack you in your face in front of your bitch, what now?\nNo education, white trash moron\nDoing 360s in the parking lot at Waldbaum's\nIn the hooptie, playing mailbox baseball\nOn the playground, shooting little kids with paintballs\nCrucify you, real life Stigmata\nYou trying to win fights, running backwards like Oscar\nDirty white boy, dirty dirty, filthy filthy\nHalf hillbilly, half the world wanna kill me\nCome and get some, underground rap legend\nCall bitches birds, call birds Tippi Hedren\nCops and robbers, hop fences, run through your backyard\nI'm the type that try to act large\nIn the Chinese whorehouse, get my back massage\nI get your bitch pregnant, you take the bitch to Lamaze\n\n[Hook]\n\n[Verse 3]\nHold up, you see me wild out, that's what I do\nGet arrested, starting riots, me and my crew\nI won't sign autographs, I'm unfriendly\nOut in Long Isl', Rakim, E-P, M-D\nB-E, we be, R-U-G\nG-E-D, S-T-R, E-E-T\nOne man gang, whole world vs. me\nBlood thirsty, I'll be dead before I'm 30\nBorn to be a failure, paraphernalia, in my glove box\nUnderage chick that love to suck cocks\nIn the backseat, driving with no license\nCops following, running down fire hydrants\n\n[Hook]\n\n[Outro]\n(Dirty, crusty, ass\nYou dirty, crusty, ass, lowlife)", "title": "American Lowlife", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}