{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "You Got Shot", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Hook: ODB sample]\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\n\n[Verse 1: Sha/Tru]\nIf you knock on my door, you better been there before\nCuz for trespassin, you know I got the cure\nI sleep wit hot lead, and it'll be dawn 'fore dead\nI'll let my girl go 'fore my gun leaves my bed\nEvery man want heaven, but no man want dead\nAs the Pope once said, 'fore the dread lost his head\nSo I keep my door locked, my gun cold-cocked\nFirst nigga that knock, I'm lightin up the whole block\nTest me not if you don't want to get hot\n'Cause I have missing posters filled with all you hard rocks\nAnd I suggest, if you don't want to get blessed\nJust remember to wear your bulletproof vest\n\n[Hook: ODB sample]\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock (BLAOW!)\n\n[Verse 2: Tariq/Breeze]\nIt's showdown, brother, high noon, my soul questing\nLike old Westerns, the low down gonna die soon\nThe Tru-Fake, you gonna fall to rock-bottom\nWhen my Glock spot em, then, for you, snake, you gonna crawl\nCrumbling, messing with me definitely humbling\nMumbling mercy, thirsty, I need to hear it\nI need your spirit decimated, desecrated my core\nI'm to the extreme, before you do your next scheme\nDeserve to leave you suffering, you gots to get the payback\nFrom her to me, your brother and your brother kid from way back\nAin't no shame in your drama, you will be feeling the heat\nFrom you stealing my beat down to you gaming my mama\nAiming a bomb to finish with you, diminish/split you\nYou done pushed me, shit, I didn't even get to kill that pussy\nBut now I'm 'bout to kill it, fill it, spill it on this pavement\nYour scream'll satisfy my Wes Craven\n\n[Hook: ODB sample]\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\n\n[Interlude: Breeze/Tariq]\nYo, word is bond son. I'm sayin, niggas, when I see that nigga, yo, that's my word. Shit is gonna be so real for that nigga. Yo, I'm saying! Yo...\n\n[Verse 3: Sha/Tru (Breeze/Tariq)]\nMy cream I protect, your dreams I respect\nMy plan, that hard rock shit be snappin at your neck (ah!)\nI thirst for beef, hot lead spells relief\nSo play your position, brave nigga, I'm the chief\nAnd all that hard rock shit gon get you closer to redrum\nAnd reachin for your pistol, I can say that's quite dumb\nSo leave it alone, you've been dethroned\nThat's only if your black ass wanna make it home\n\n[Verse 4: Tariq/Breeze]\nYou're getting carried away with pallbearers, twist you\nWhile I'm wetting, that be the way it's all clear with Mr. L\nGone, black, I'm telling him you was plotting for cheddar\nTo hell wit him, you forgotten, against my contract\nWe could do this like Judas, blast you with your style\nMastered it so foul, leave you clueless, like, \"Who this?\"\nKarma caught you, kid, I'm fucking sicker than true lies\nI'ma scorch a nigga, coming thicker with new rides\nIt's hard to live, knowing that you doin the same\nKnowin about you and your game, let God forgive\nI won't, see, I don't give a fuck son, I give a buck in gross earning\nYou eating the heat, and my toast burning\n\n[Hook: ODB sample]\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another motherfuckin hard rock\nYou got shot 'cause you knocked-knocked-knocked\nWho's there? Another mother- [*gunshots*]", "year": "1999-02-23"}]}