{"songs": [{"lyrics": "[Hook:]: [Pharell]\nSpin around ma\nDrop, drop, like it's hot\nDrop, drop, like it's hot\nSpendin money mang\nDrop, drop, like it's hot\nDrop, drop, like it's hot\nSpin around mommy\nDrop, drop, like it's hot\nDrop, drop, like it's hot\nI got the rollie on my arm\nAnd I'm pourin saun dan\nAnd I roll the best weed\nCause I got it goin on\n\n[Verse: 1 - Pharrell]\nNo steroids can make you hit what I'm pitching\nChef boy-ar-P is back in the kitchen\nYou niggas is scratchin, my niggas is itchen\nDon't keep \"Pacin\" but these dudes blow they \"Pistons\"\nYes, nigga, P stands for polish\nNone of y'all is fuckin with he, and this is obvious\nI'm Ron Artest, layin down to your garbage\nWhile my niggas in the street pushin shit like Ben Wallace\nAnd any ya'll could get it, even fans in the stands\nThese guns is a sun, you'll catch a tan with ya man\nI'm no cheeto, trust this is real/rio\nEverything is grand? Nothing is poquito\nSecuritys behind me, with the torpedo\nCause the wrist stay frigid\nHow you say it? Frio\nOr where I'm from, in Virgina, we say ch-ill\nAnd the ends also quarter million for each whe-el\n\n[Hook:]\n\n[Verse 2 - Jay-Z]\nI got haters on my jiz-ock, plus the fricking ciz-ops\nAll of whom want to hit me with shiz-ots til I dri-zop\nThank God for hip hop, or I be in the bizz-ox, uh\nJail or casket, either way you rizz-ock\nBut now I'm so fresh you could smell me through a ziplock\nMr S. D-izz-ot, it's not gon' stizz-op\nToo much pizzazz for these piss-ass niggas to get past\nToo cool for ciz-ops to cuff his iz-ass\nSnitch-ass they made, they can't get the boy\nThese niggas giving out cases like a liquor store\nRunning to the DA, tryna get me for it\nAll the money it made, I'm like \"Forget the law\"\nI'm not 'fr-iz-aid, it J-iz-ay homie you got pl-iz-ayed\nTake it like a man, the flow ran you off the stiz-age (go sit down)\nWastin' ya time tryin' to sue S. Dot, tell ya lawyer\n\"Take that civil case and drop it like it's hot!\"\n\n[Hook:]\n\n[Verse 3 - Snoop Dogg]\n((World Wide))\nInternational, nah I'm universal\nBut you a gangsta, how you get to do commertials?\nWith them big wheels, yeah cuz you do it big\nI stay real, stay sharp, and tell it like it is\nI never fake the funk, niggas know I ain't no punk\nThey want beef? Yeah cuz, pop the trunk\nWe go all the way, we do it lifesize\nNow my life right, cause my wife on my right side\nYeah, and she protecting my interest\nNow I'm on the move they got me hoppin' these fences\nAy little homie your defence is defencless\nA pimp apprentice\nNow come here princess (Come here, come here)\nI know ya tired of the chit-chatter\nIt really don't matta it's like a seesaw platter\nI check money, check niggas, check bitches\nNow drop it like you ass on swit-ches [Ziip]\n\n[Hook:]", "title": "Drop It Like It’s Hot (Remix)", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}