{"songs": [{"year": null, "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "The Music (Intro)", "album": "Nehruvia", "lyrics": "[Intro: MF DOOM]\nTo me, from the musical aspect, hip-hop is going in the direction where it’s like almost damn near 100 percent on everything besides the music. Like what you look like, the sound of your name to, what you’re wearing, whatever intoxicants you choose to put in your body, to, you know, everything expect for what the music sounds like. The mask is really a testament to yo, it’s not about none of that. It’s straight about the wreck. You could be any color, or whatever, the mask represents just everybody. Yo, Nothing matters, the brand of clothing, none of that matters. It just matters how you spit and the beats, if the beats is raw, then that’s what it’s about\n\n[Verse 1: Bishop Nehru]\nI say the world ain't safe for me to live in\nIm only sixteen so this shit just the beginning\nI should be in the world trying to find a fine tuition\nInstead of running around Following intuition\nWhile others mention\nNehru name cause the kid grew fame\nPlanting the seed and grew a tree so when he blew through lanes\nLames would look saying he took and threw it off the top floor\nNow whores want more of my balls and bronsons\nWhile thongs are flying at a nigga from a distance\nThis hipster kid is thinking about how to diss this\nMaster a sentence is my commission\nGets larger and the starters are ready to throw big fits\nIt's misfit, we get shit around Christmas\nHis wishlist is much more than what saint nick dished\nBut get this\nHe always showed his mom a smile\nCause she was up for awhile wrapping presents for her child\nMeanwhile in his head hes thinking about the bread\nAnd trying to get ahead\nWhile others searching for heads\nNever selling them meds\nIm making tracks instead\nMost shooting the leads\nNot knowing they could of lead\nThey're community\nTo unity\nThey'd rather cut like truancy\nHe using me to get yourself know\nBut this ain't new to me\nIn my eulogy they'll be songs about how they used to be\nBefore I killed them Musically\nMy talents leaving gruesome scenes\n\n[Outro]\nIn my eulogy they'll be songs about how they used to be\nBefore I killed them Musically\nLeaving gruesome seams"}], "artist": "Bishop Nehru"}