{"songs": [{"year": "2014-09-19", "album": "Losing My Religion", "image": "https://images.genius.com/bbb992f620111ab4134942afd9055acb.500x500x1.jpg", "title": "Gospel of Mark", "lyrics": "[Verse]\nI know a pastor with a Bible & a crucifix\nReligion's a disguise\nI can see it in his eyes\nNiggas preaching you the gospel\nBut the devil is a liar\nHe can lead you to the well\nBut I bet that bitch dry\n10 percent of every dollar\nTo your local tabernacle\nCollection plate spinning 'round\nTwo times in the service\nCan I get me a receipt?\nMy Salvation’s tax deductible\nI'm still givin' money\nI been broke for 'bout a month or two now\nHallelujah Sunday and sinning on Monday\nThe red-eye to hell, a nigga only going one way\nObsessing over fashion and your false sense of worship\nDon't even believe in God, you're just praying for a purpose\nAnd refuse to ask questions 'cause your soul has been invested\nAnd they're still segregating\nPreaching Nate from Old Testaments\nFrom what I understand that's the White man's rhetoric\nWe're tied to the South, Klu Klux & Confederates\nComplexion of the Savior that I praise is tan licorice\nEnslaved West Africans then turned them all illiterate\nAnd call them all niggers and make them think they're the lesser\nYou abducted us from a land where we was kings & professors\nWelfare's a manifestation of slave labor\nAnd dependency upon the government from taking handouts\n????\nPut them in Section 8 so there isn't no way to stand out\nUnless they on the corner selling poison to their people\nThen you throw them in a jail\nThe population same color\nNiggas see a cell mate with skin tones of his own\nIndustrialize the prison\nTurn it into private industries\nYears for petty charges\nMy people living in misery\nA nigga twenty five with a record full of felonies\nWas raised in the system so that's all he really know\nInstitutionalized minds, we still living in slavery\nAnd fighting over shit that we can never even own\nAn educational system of a third-world quality\nThen wonder why my people got the highest rate of poverty\nThe land of the free? I think that's literal hypocrisy\nAnd fuck the constitution, that's just an idiosyncrasy\nThe words \"pursuit of happiness\" scribbled by slaveowners\nMalt liquor for your liver, no longer an organ donor\nFastest way to kill a people is diminishing their minds\nGive them drugs of different kinds, good grapes from a vine\nThey choose to procrastinate and waste all of your fucking time\nFuck getting educated, niggas getting medicated\nPopping pills like they vitamins\nOxycontins & Vicodin\nBut don't forget the weed and make sure that the odor's pungent\nWe living in a society that praises over-indulgence\nMy generation's either locked up or on the substance\nThese niggas lack focus, always into dumb shit\nI practice what I preach and watch the people that I run with\nThe truth is in my rhymes, that's divine & sublime\nComing directly at your face like that officer's mace\nSo get the fuck off of the couch and stop waiting on a meal ticket\nRap game full of ignorance\nAm I the only one to find that shit sickening?"}], "artist": "K.A.A.N."}