{"songs": [{"year": null, "image": "https://images.genius.com/a51dcea6b49ee87e76d235126166aaf9.600x595x1.jpg", "title": "Believe Dat", "album": "5 ★ Stunna", "lyrics": "[Lil Wayne]\nStunna it's yo' turn baby!\nHa, and me, the heartthrob\nYeah, I be with them different hoes\nNo I mean them different hoes\nI mean the... believe dat\nUh huh, yeah, believe dat\nI flip, tell 'em girl\nShorty, believe dat\n\n[Birdman]\nGot a bitch in the back, got a ho in the front\nGot work in the back, got more in the front\nIt be the Birdman baby, everything kosher\nBirdman baby; feathers all over\nTony Montano, white leather soft sofas\nGot too many cars, so now I buy chauffers\nAll about my penny like a motherfuckin loafer\nI was in the crack game befo' bakin soda\nBitch I'm a O.G., bitch I'm O.G\nI'm gettin high off my money 'til I OD\nSee you don't know me, them bitches know me\nMy old hoes tellin me go back to gold teeth\nKing size bed, nigga gold sheets\nGold bottle for breakfast nigga let's eat\nI got five, and they all sexy\nThey all drive new cars and they love me\n\n[Hook: Lil Wayne]\nYeah, cause I be with them different hoes\nNo I mean them different hoes\nI mean the... believe dat\nUh huh... believe dat\nTell 'em girl... believe dat\nWhat's your name? .. Believe dat\nWhere you from? .. Believe dat\nI know what'cha sayin .. believe dat\nPsych I'm just playin, but believe dat\n\n[Birdman]\nLook fresh with the heavy metal you know I need that\nGucci stay fly on the stage, believe dat\nWe one of a kind, we do it 'til you see me black\nIce with the chrome and the silver how you love dat\nToo fresh, too cool, too shiny, too fool\nToo sunny, spend money, that's just what we do\nBelieve I'mma shine, believe I'mma grind\nBelieve me your girl at my house all the time\nBelieve I'm about to hustle, believe me I've got the muscle\nBelieve I'm the stunna man, you know I know the struggle\nCome from the pot and pan, come from another land\nCome with a better game, Baby I'm the Birdman\n\n[Hook: Lil Wayne]\nYeah, cause I be with them different hoes\nNo I mean them different hoes\nI mean them Weezy, believe dat\nSo you just gon' cut me off? Believe dat\nWhat? .. You believe dat?\nI know what'cha sayin .. believe dat\nI feel you ... believe dat\nHey why you cryin? Believe dat\nYo you ain't lyin, believe dat\n\n[Birdman]\nYeah, yeah\nI'm on the yacht and boats, pills and hydro\nBroads and money homey that's what a nigga know\nShe know I shine cuz, you know I grind cuz\nShe know I'm high with the metal all the time cuz\nAnd she believe me, and she all in me\nWe poppin bottles to a view of the ocean B\nI'm all in see, I'm all good daddy\nI'm the Birdman, you know I'm in the new Caddy\nBelieve me, she get money just like me\nI stay strapped with the flame in my new fleet\nA hundred million dollar suede seats with the leather seats\nWith the gator on the front with the platinum teeths\n\n[Hook: Lil Wayne]\nYeah bitch!\nCause I be with them different hoes\nNo I mean them different hoes\nI mean them Weezy, believe dat\nSo you just gon' cut me off? Believe dat\nGirl what? .. Believe dat?\nI understand .. believe dat\nI really don't ... believe dat\nMy girl say, and I say believe dat\nMy girl say, and I say believe dat\n\n[Birdman]\nYa heard me? Yeah, believe dat one hundred\nLet me tell you shorty\nI want my shorty, give me that\nI like them tall thin and short\nGirl what? Believe dat, believe dat~! Believe dat\nFor real though, one hundred\nNigga believe dat"}], "artist": "Birdman"}