{"artist": "Apathy", "songs": [{"title": "Grow Up", "image": "https://images.genius.com/aaaae50163287364429e596cd5315e89.500x500x1.jpg", "album": "Hell’s Lost & Found: It’s The Bootleg, Muthafu@kas! Volume 2", "lyrics": "[Verse One]\nI was a stupid little motherfucker (a damn fool)\nThat asshole who brought a handgun into school\nNot on some Columbine shit\nBut thanks to gangsta rap\nAp's dumbass was loading blanks in gats\nI got Spice-1 and Ice-T to thank for that\nToo $hort got a lot of bitches spanked and slapped\nI was a juvenile, stupid wild, crazy cat\nTryin' to fuck with older bitches when they babysat\nHit a chicken in the ass with a rubber band\nFought her brother Dan\nCause I tripped him while he tried to do the Running Man\nUnderstand, I was intelligent but belligerent\nWouldn't listen, and living life a little bit to ignorant\nEager to eat other rappers and be the baddest\nA bitter little bastard who shitted on anybody under average\nMessin' with friends girls instead of my own bitches\nVicious, gettin' too big for my own britches\n\n[Hook] {x2}\nI don't wanna grow up, I'm an immature kid\nYou should hear the fucked up shit that I did\nAnd I'm still doin' it, doin' it, doin' it\nAnd I'm still doin' it, doin' it, doin' it\n\n[Verse Two]\nWhether skippin' school, rippin' tools, pissin' in pools\nSpittin' shit, dissin' your crew, I'll rip you in two\nI was really fucked up, wish I didn't but I did\nSick as it is, twisted, trippin' little crippled kids\nRelax, he was holdin' my shirt and held on\nBut even if he fell he's got a BIG FUCKIN' HELMET ON\n(That's dead wrong)\nKnew my teacher had a red thong\nAnd after school her and another teacher got it on\nThat's actually true, plus half of the faculty knew\nKnew the time, knew the place, what should Apathy do?\nI arrived at the class at half past six\nAnd hid underneath the desk while he smashed that bitch\n\n[Hook]\n\n[Outro: 'Chinstrap' talking]\nHey Apathy. Remember me? You owe me a new helmet. Bitch This is Chinstrap. Coming back for you Ap. All that trippin' me and shoving me in the locker. Fuck that! Chinstrap is coming back...strapped...with a gat!\n\n[Hook]\n\nHe has to ride on a small bus cause his brain is so small\n\n[Apathy]\nWho's your favorite rapper?\n\n[All the kids]\nApathy!!!!", "year": null}]}