{"artist": "Yukmouth", "songs": [{"album": "Free at Last", "image": "https://images.genius.com/250bd1f5936b0e1b7bfe5f2e2e91acbf.600x600x1.jpg", "year": "2010-06-01", "lyrics": "[Intro: Jay Rock]\nI remember just sittin' in that strap house (strap house)\nYeah, I remember just sittin' in that strap house, should I say the crack house\nSteady movin' packs out\nI remember just sittin' in that strap house (strap house)\nYeah, I remember just sittin' in that strap house, should I say the crack house\n\n[Hook: London]\nIf your life (if your life)\nIs like mine (is like mine)\nYou will grind (you will grind)\nYou will shine (you will shine)\nI get mine (I get mine)\nDay and night (day and night)\nDo it feel (do it feel), oversized (oversized)\nLivin' the life, uh, uh\nThe life, uh, uh [X3]\nLivin' the life, uh, uh\nThe life, uh, uh [X3]\n\n[Verse 1: Ya Boy]\nYeah, we used to be like, damn we need more sluts\nNow we feelin' ourselves like, they can't afford us\nI never toured much, now I got a tour bus\nWife beater rock star rockin' with ya boy Yuk\nUck! Look like the bay in the building\nBanana clips whole bunch of Ks in the building\nNigga don't worry about gettin' grazed in the building\nBodies drop, souls gettin' raised in the building\nOoops, did I go off subject?\nI ain't mean to, sometime my brain just does that\nHonestly I feel it's the result of gettin' money\nEver since I got my money, feel like everybody want me\nBut how could I ever forget that everybody loves me\nGot the whole west coast ready to ride for me\nSo nigga, you get mad and Imma get paid\nYou see, I make bitches, and you just bitch made\n\n[Hook]\n\n[Verse 2: Yukmouth]\nOkay! It's Yuk!\nI get paper, while you player haters stay broke\nWhite S-550 you could go to space, walk\nAll black Barre Ta, leave you wetter than a rain coat\nComin' for that cheddar like that wells-fargo stage coach\nBank role, bank role, killers on that pay role\nLost in that hate smoke, boss in the Range Rove\nBox full of legos, pot full of prego\nYayo like rave 4, ballin' out like mayo\nEvery single weekend, catch me on the road\nNew city, new shows, new money, new hoes\nNew row, bottles poppin' outside new rows\nRide, drive, head, Phantom suicide two doors\nCondo and no ho the team get more dough\nAnd on the D-low I don't give a fuck about no ho\nPacks of that dough dough\nBricks for the low low\nTrunks full of ice cubes, playin' with a yo yo\n\n[Hook]\n\n[Verse 3: Jay Rock]\nYeah! I remember just sittin' in that strap house\nShould I say the crack house\nSteady movin' packs out\nAt the table with the Ks and the macs out\nWork on the table, got that fire, you can ask 'round\nYeah, but now a nigga rappin' now\nHit the road for 40 days then I'm back in town\nDo it big like Godzilla, if God willing\nI get billions, come back and buy buildings\nYeah, on the grind for me and my children\nWe gotta eat cause being broke's a cold feeling\nTwo stories, money stacked to both ceilings\nSkydiving, rock climbing, and boat trailing\nTryin' to take from me, I gotta smoke melons\nBust the head of witness, boy, there's no tellin'\nYeah, the way that I'm shinin' got my foes jealous\nYeah, my money retarded, nigga, I'm so special\n\n[Outro: London]\nLivin' the life, uh, uh\nThe life, uh, uh [X3]\nLivin' the life, uh, uh\nThe life, uh, uh [X3]", "title": "The Life"}]}