{"artist": "Young Thug", "songs": [{"year": "2019-01-27", "lyrics": "[Intro]\n(Jeffery! Yeah, yeah)\nBreak down a brick at a time (Woo)\nI know I don't wanna fuck no one bitch at a time (Oh no no)\nI know oh oh oh oh\nPicked one bitch out the lineup\nI just wanna oh oh oh oh\nBreak down a brick at a time (Hey)\nBreak down a brick at a time, aye\n\n[Verse 1]\nI was just with y'all losers\nRemember? Twin Erykah Badu (Woo)\nFuck a ho in [?]\nYellow diamonds, find these, Pikachu (Woo, woo, woo, woo)\nBallin' in [?] (Yeah yeah yeah)\nScoring like I'm Kyrie (Scorin' nigga)\nRunnin' 'round 4 deep (Skrrt-skrrt)\nJump out, yeet yeet (Brr-brr)\nI spend a lot of money (Spend it on you)\nDon't play with my money (I'm watching all you) (oh yeah)\nGot your bitch in the bed, yeah (Like ooh)\nThese monkey niggas muggin' (Ooh)\nSo what you wanna do? (What you wanna do nigga)\nLet's get it, I'm with it\nShe with it, he with it, let's get it, let's get it (Yeah)\nPull up to the booth and she say she comin' through to catch her some kiddies (Yeah)\nAww yeah, let's get it (Yeah)\nLet's play truth or dare, which one bitch? (Yeah)\nHey, guns and roses (Guns and roses)\nHundred shots, all my niggas loaded (Brr-brr)\nDraw down and I'm focused (Down and I'm focused)\nLeave his body in a Focus (Leave his body in a car)\nGotta make sure the nigga Kobe (Gotta make sure he Kobe)\nGet 'em hit in LA like I'm Kobe (LA like I'm Kobe)\nMake her suck my dick and get to strokin' (Suck it bitch)\nPut your hands up if you feel like-\n\n[Chorus]\nCash talk, I'm on the way\nYour bitch say she bored and that's all that I'mma say\nThe big machine gun if you try to take the safe\nAnd I was just ballin' with you the other day\nMy dogs say you slime and you seen 'em first day\nI should've sat down [?]\nAnd now I'm dead wrong, you see it in my face\nAnd now he ain't wrong if you shoot him with a K, aye\nI'ma draw down with that stick, better run\nHannah Montana, my wrist do the work (Oh yeah, yeah)\nI take my chance on a mission of course (Oh yeah, hey)\nI speak the realest, she know I'm the boss (Jeffery!)\n\n[Verse 2]\nRoom full of bad bitches (Slatt, slatt)\nPockets on fat bitches\nPlease back up off these bitches\nI'm ready to stab bitches (Ready to stab)\nYou outta style bitches (What you gon' say nigga?)\nNow you on child bitches (Bitch)\nYou need to stop bitches (Bitch)\nFuck 'round get blocked, bitches (Block that ho)\nRide 'round with block bitches, haha (Fool)\nHair like Yung Joc bitches (God Damn, son)\nSuck on that cock, bitches (Suck on that cock, bitches)\nSmell like a mop, bitches (Smell like a mop, bitches)\nJewelry so bright, bitches (Hoo, hoo, hoo, hoo)\nAttracting these light bitches (Damn, damn)\nI'm swimming in mud, nigga (I'm swimmin')\nYou know I'm a blood, nigga (Blatt)\nMagic, I flood niggas, on her birthday [?] nigga (Slatt)\nI'm ready to roll, she don't got on drawers (She don't?)\nWhere's the beat? I'm lost (Swag)\nAll inside the sauce\n\n[Chorus]\nCash talk, I'm on the way\nYour bitch say she bored and that's all that I'mma say\nThe big machine gun if you try to take the safe\nAnd I was just ballin' with you the other day\nMy dogs say you slime and you seen 'em first day\nI should've sat down [?]\nAnd now I'm dead wrong, you see it in my face\nAnd now he ain't wrong if you shoot him with a K, aye\nI'ma draw down with that stick, better run\nHannah Montana, my wrist do the work (Oh yeah, yeah)\nI take my chance on a mission of course (Oh yeah, hey)\nI speak the realest, she know I'm the boss (Jeffery!)\n\n[Outro]\nAyy", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Brick at a Time"}]}