{"songs": [{"image": "https://images.genius.com/d139ded1190d7e3c5cdc6dda61c6767f.600x600x1.jpg", "title": "E.I. (David Banner Remix)", "album": "Da Derrty Versions - The Reinvention", "year": "2003-11-25", "lyrics": "[Intro]\nHey! Hey! Hey! Hey! Hey!\nShake dat ass (pop it, pop it)\nShake dat ass (pop it, pop it)\nUh-oh!\nShake dat ass (pop it, pop it)\nShake dat ass (pop it, pop it)\nShake dat ass (pop it, pop it)\nShake dat ass (pop it, pop it)\n\n[Hook]\nSaid it must be ya ass cause it ain't ya face\nI need a tipdrill, I need a tipdrill\nI said it must be ya ass cause it ain't ya face\nI need a tipdrill, I need a tipdrill\nSaid if ya see a tipdrill point her out, where she at\nPoint her out, where she at?\nPoint her out, there she goes!\nSaid if ya see a tipdrill point her out, where she at\nPoint her out, where she at?\nPoint her out, there she goes!\n\n[Verse 1]\nI'ma sucka for corn rows and manicured toes (hey!)\nAnd Applebottom capri's and Parasuco's (alright!)\nHigh saddity or city, with one or two clothes\nI'm draftin 'em out of highschool straight into the pros\nWho knows, I knows (eh!)\nI love it when you be makin' your knees touch your elbows\nTakin' it down low\nTo the flo', and there you go\nNow throw it on me slow\nAnd err'ytime I +Busta Rhyme+, baby \"Gimme Some Mo\"\nYou say you likin' that\nWhen I be hittin' it from behind and I be rightin' back\nYe that's my very next line\nI use it time after time when I be speakin' my mind\nI spit the same game to a pigeon or fine dime\n(eh!) Talkin that shit about the 'Tics\nSomebody pro'lly jealous cause they bitch got hit\nBut ain't nobody else talking shit like this\nShould we apologize? (Hell nah! Hell nah!)\n\n[Hook]\nWe be like andale, andale, mami E.I. E.I. (oh oooooh!)\nWhat's poppin' tonight?\nAndale, andale, mami E.I. E.I. (oh ooooooh!)\nWell if the head right, I be there err'ynight\nAndale, andale, mami E.I. E.I. (oh oooooh!)\nWhat's poppin' tonight?\nAndale, Andale, mami E.I. E.I. (oh ooooooh!)\nWell if the head right, I be there err'ynight\n\n[Verse 2]\n'Til the break of dawn (dawn)\nYou see our money long (long)\nMatter fact I'm takin' the skirt right along with the thong (thong)\nSome say I'm wrong, but fuck it I'm grown (grown)\nI'm about 20-somethin' with 2 of my own'\nNigga I flash it (oh!)\nDouble takes when you past me, nasty\nDon't be scared boo, come on just ask me\nI drive fastly I'm like Jeff Gordon\nI switch the raid on the S and kept that Navigation\nSystem cranked, blaze'on\nIt's smellin' amaze'on\nGot three chicks rollin' out black, white and Asian\nAnother one pigeon tellin me to come home\nHe jus left the house and he ain't comin back home\nI use the V-12 powers, I be there in an hour\nMatter fact, you keep the door open I'll catch you in the shower\nBring it back over girl, I hear you gettin' louder\nAnd the same shit gon' happen  if you use the word ours yeah!\n\n[Hook]\n\n[Intro]\n\n[Verse 3]\nWe runnin' through a whole pound - of that sticky\nHydro got my whole mouth - feelin' icky\nI pour Crissy down a ho's mouth - just cause she picked me\nBack stage when my show's out - tell em what you mean\nI mean four inches when we roll out - come and get me\nRock the platinum and brought the gold out - who all wit' me?\nI already got my fo' out - cocked\nPlus I got many niggas wanna show out!\nIn the Escalade\n(you know) Powder baby blue leather seats Gucci\nAnd Jack Frosty\nRoger the Rabbit and Bugsy\nGo back like there no socks in rugby\nIf you compare me to any other MC on originality\nFor s'all in the jewelry\nI gotta be top three\nI gotta be cocky\nIf you ready to leave Holly, see you in Maui\n\n[Hook]\n\nEh! eh! eh! (oh oooh!) eh! eh! eh! eh!\nUh! uh! uh! uh! Well if the head right, I be there err'ynight!\nEh! ye!\nUh! uh! uh! uh!\n\n[Hook]"}], "artist": "Nelly"}