{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/b55066a4d9c23965c80b13a93ffa9cd0.640x640x1.jpg", "title": "Beware", "album": "Capital Punishment", "lyrics": "[Chorus: Prodigy sample]\nI gave you fair warning, beware\nI gave you fair warning, beware\n\n[Verse 1: Big Pun]\nYo! What you thought, Pun's shit was weak? Now you can't sleep\nGotta keep your eyes open wide and hide your face from the streets\nI'm like the beast with a warrant, far from a law man\nGave you fair warnin', now you on the stairs, fallin'\nI'm callin' out any rapper that I doubt, smack him in the mouth\nThrow him in the yoke—boom—then I knock him out\nNo doubt, Freddie Foxxx files\nTwenty-shot auto Glock, blaow! Benny Blanc Puerto Rock style\nWith a twist of black and I'm proud, twist your cap and I'm out\nSleep with the fish-dips for yappin' too loud\nWhat's happenin' now? Niggas is hard as hell but they Gargamels\nPickin' on the smallest victim gives 'em heart to kill\nMy squad is real and holds it down, the hardest regardless\nBesides of the largest\nWe polish the floor with the rawest hardcore artists\nFlawless victory, ya niggas can't do shit to me\nPhysically, lyrically, hypothetically, realistically\nI'm the epitome of catchin' wreck\nCatch you when you cash your cheque\nSmash you when you pass, then jack you for your fuckin' 'Lex\nNothin' less than the best if the Squad did it\nHard-headed niggas better beware and fear like God said it\n\n[Chorus: Prodigy sample]\nI gave you fair warning, beware\nI gave you fair warning, beware\nI gave you fair warning, beware\nI gave you fair warning, beware\n\n[Verse 2: Big Pun]\nAyo, I warned you, now all niggas could do is mourn you\nI'm born to kill and still thrilled to put it on you\nThere's no regrets, remorse only results in loneliness\nOnly the strong survive and strive through life as warriors\nAll of us die, some of us kill, even massacre\nWho wanna try? Punisher will if you ask for it\nI'm hazardous for your health and Hell's your next stop\nFor real, my shit's cocked, the world has just stopped\nI'm not the one you should be underestimatin'\nCome test your fate and I guarantee I'll be under investigation\nYou can't handle the whole, I'll slam you on your skull\nOr we can go blow for blow like Evander and Bowe\nYou never know; however, though, I still hold the title\nWhen all my rivals have chance to dance with Mr. Homicidal\nHand on the Bible, I swear to defend my crown\nI've been around since forever and never let it touch the ground\nDon't fuck around and catch a rude awakenin'\nMy crew's basically waitin' patiently\nFor you to move your patrons in\nThen we'll surround you, form Desert Storm and pound you\nLook around you, Terror Squad's everywhere, like Soundview\nThe Boogie Down do it like nobody, who are we?\nThe foundation, you're facin' a whole army\n\n[Chorus: Prodigy sample]\nI gave you fair warning, beware\nI gave you fair warning, beware\n\n[Outro: Fat Joe]\nYeah, yeah, yeah! What's up now, partner?\nKnow I'm sayin'? Think this just some rap shit?\nWe do this shit for real\nTerror Squad, nigga\nFuckin' shoot the place up\nMotherfuckers know the time\nThis motherfuckin' rap game\nJoe Crack, Big Dog Punisher, Full-A-Clips crew\nWhat the fuck? WHAT!\nBeware, beware, beware, beware, beware"}], "artist": "Big Pun"}