{"songs": [{"year": null, "image": "https://images.genius.com/8979e195a075754dfc6965f7356b0293.700x700x1.jpg", "title": "Geez Like Deez", "album": "Rapper’s Delight", "lyrics": "[Quan] (Rapper Big Pooh)\nYou ain't never seen fly geez like deez\nHahaha (Illmind on production of course)\nHey baby, you ain't never seen fly geez like deez\nFlesh so clean, what a lean so mean\n(Rapper, Quan) What up? (VA what up?)\n\n[Rapper Big Pooh]\nYo, now as the sun rotates and my name gets bigger\nHow many hoes wanna fuck this nigga?\nNamed Rapper Pooh, shorty what it do?\nThinking to myself if my girl only knew\nMix a lot of brown with a little bit of blue\nPull up in the front, two feet up out the queue\nQuan behind the wheel, young'n this is how we do\nWe get a game back when we grew\nTryna get a nut from a screw, tryna make five outa two\nLook, I'm kinda forward thinking\nNigga sleep only when he blinking\nLive by the code of the streets so my ship's never sinking\nSay I'm the shit, that don't mean that I'm stinking\nPoobie handle bars like a link in smooth\nPeople nowadays try and act too cool\nMe and my niggas break food, believe that\n\n[Hook: Quan] {X2}\nHey baby, you ain't never seen fly geez like deez\nBall with the best, so fresh, so clean\nNiggas on the scene, what a lean so mean\nBelieve me\n\n[Quan]\nStreetlight starts the night and it sparks the night\nFedoras and silk suits is how we balling tonight\nThere's ill dogs in DeVilles, swill on them twinkies\nRagtops on them drops, diamond rings on them pinkies\nSeat laid to the back, smoked out in the 'Llac\nFedora built tilt deuce with a feather in that\nNavy blue Cadillac with that platinum glitter\nSo she's shining like a diamond whenever the sun hit her\nBy the way on the highway we floating our ass\nWax on the clear coat, make her look like glass\nOnce again cutting clocks and it a game for players\nSilk sash around the collar pimping, matching my gators\nAll my dogs iced out, shining bright as the sun\nPancaking pulling whips up one by one\nStraight V.I.P. status wherever we chill\nBuying rounds for the room, I'm a boss for real\n\n[Hook] {X2}"}], "artist": "Rapper Big Pooh"}