{"artist": "Vast Aire", "songs": [{"title": "Pegasus", "year": null, "lyrics": "Camouflage!\nThe shadow!\nWe in the darkness!\nThe dragon snatches the pearl!\n\nHey man, you want a sip?\nI got the cup of knowledge\nRinse but don't... spit\nEbonics, burnin, that's the shit\nAnd that girl by the bar with the waistline\nShakin her hips (okay!!)\nThis is the last crusade, I might\nFix your edge up when I juggle my blade (whoa!)\nMy hydro's hidden believes\nMy swordstyle's hidden believes\nThere's no honor with thieves\nThat's why you keep that Great Adventure bat up the sleeve\nYou know the one that fits the forearm\nWhen the 5-0 hit the block, you walk calm\nLike \"I ain't do it!\"\n\"But you've been cutting school all day!\"\nYou're damn right I'm truant\nAll emcees repeat after me\nOr you can catch a gasface fuckin with V\nA-S-T A to the I to the R and the E\nSo syllable free\nTherefore you ain't the King like Coretta\nMan, I defeated you with eight letters\nSo imagine if I formed a sentence\nYou wouldn't even be here\nYou'd be past tense\nAnd that's how it goes\n\"Oh she took all your money?\"\nOh that's how she hoes\nIt started with Eve in the garden\nThe devil gave her the fruit, cause Adam was starving (haha!)\n\nEven if the steel is stainless\nIt'll leave shoes shoes bloody if your man is brainless\nDon't move, think twice\nCount to ten, be nice\n\nEven if the steel is stainless\nIt'll leave your shoes shoes bloody if your man is brainless\nDon't move, think twice\nCount to ten, be nice\n\nSymbolizin that the war is won\nThe Indian chief'll greet the sun\nThen bear witness to the dark\nThen the tribe'll do the dance of the hawk\nWhen will you learn?\nMan I smoke so much you can have my turn\nAnd I rap so much you won't get no burn\n\"He ice-grillin you son!\" I am not concerned\nPhoenix wing torch sky that's the purpose (that's the purpose!)\nYou got a fake smell and you're worthless\nWhen I cut you in the street you'll be nervous\nHoldin your cell phone askin for service\n\nEven if the steel is stainless\nIt'll leave shoes bloody if your man is brainless\nDon't move, think twice\nCount to ten, be nice\n\nEven if the steel is stainless\nIt'll leave your shoes shoes bloody if your man is brainless\nDon't move, think twice\nCount to ten, be nice\n\nSuperhero mutherfuckers is it Lois?\nIt's funny how they brought Trinity back like Lois\nI guess Clark and Neo wasn't havin that\nI know you want world peace\nWell peace is where the titties at\nUh huh, I know you might like it\nBut the majority rules, and I think they like it\nYeeeah, plus I'm good with the girls\nI tell em when they like me and they call me psychic\nYeeeah, no love for dumb chicks\nHow you gonna be my sidekick, dizzy and shit?\nCan't be my Suzuki, save it for show\nYou're the neighborhood garden tool\nAnd everybody knows (\"I ain't no ho!\")\nThat Aire got flows, niggas'll\nBite styles til they got no soul\nNiggas'll think they smoking til they like the dro\nHow we gonna break bread if you don't show me the dough?", "album": "Look Mom... No Hands", "image": "https://images.genius.com/ec5e65a416584a208b3230e59ddbdd2f.600x600x1.jpg"}]}