{"songs": [{"year": "2011-03-28", "image": "https://images.genius.com/ae59ac20cf16e3a440904aa06dd710ac.1000x1000x1.jpg", "title": "Get Right", "album": "Return of 4Eva", "lyrics": "[Hook]\nOk, this is just an anthem for tha playas\nTop notch boppers, and the pimp's with tha gators, rollerskaters smoked out elevators\nDrinks sippin', paint flippin' congregators\nLets get right, Lets get right, Lets get right, Lets get right\nAll night, all night, all night\nParty like it’s 1999\n\n[Verse 1]\n1,2,1,2,1,2 I got plenty\nBreaking hoes four in the mornin' ain't many\nPlaya, playa play on, roller skate on\nI get my chase on, for someone to take home\nNow who you watinin' on? uh\nFreaking with me she got Beat\nTill she shook and went to sleep\nYou think she don’t cheat\nShe suckin', she fuckin' 'cause she love the way I spit it\nI know she only want me for my dick but I can dig it\nI dig her, there's nothing iller\nKinda killer, like jack the ripper\nThat's way before I drink the liquor\nMy moves are major can’t do no favors\nFor chickens with cruel intentions of layin' eggs to get to my paper\nPlenty pimpin nah I ain’t trickin\nAin't never slippin’, hella liffted when we piffin\nStuck to the cellin', you smell the vapors when we roll by\nSo crack a seal pour up and get right...\n\n[Hook]\n\n[Verse 2]\nBack up, back up, cause it’s on\nBreak of dawn, poppin' tops, takin' shots, vibin' to the early morn’\nI ain’t trippin if I make it home, tryin’ to bone\nTaking pictures of bad bitches and save em in my phone\nBBM in me on the late night, take flight, on my base pipes\nSearchin' for jaws like great whites\nAin't that some shit? yeah, thats some shit\nYou claimed that was your girl but why she all up on my tip?\nDon’t need to buck cause you get fucked up in this party\nChickitty check your self before I finish what you started\nGet retarded hella stupid in the mix line up\nKnock em down dominoes in this bitch\nDrink ain’t free, drink on me\nStore run gotta take my whip cause your tanks on E?\nIts all good\nI got a little doe to blow, buy a case of Ole E' and some blunts to roll\n\n[Hook]\n\n[Bridge]\nFeelin good, drink got me feelin' fine\nDoing what a playa does, smokin' just to ease my mind\nForeva gettin on, ridin' chrome, poppin ass pros won't leave it alone\nI said these poppin ass pros won't leave it alone\nAll day, all night I can’t be faded\nToo cold on hoes they ain’t for savin\nGet right, get throwed, feel like we’ve made it\nHow could you hate? congratulate\n\n[Hook]"}], "artist": "Big K.R.I.T."}