{"songs": [{"title": "Abstain", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Intro]\nAbstain\nYou got to abstain\nYungboyz\n\n\"Civility is not a sign of weakness.\"\n\n[Hook]\nI'm just trying to let y'all see the way\nAbstain and y'all will see some better days\nDon't mess with drugs or try to creep\nUnless y'all want to end up six feet deep\n\n[Verse 1: Big Sean]\nBig Sean 'bout to claim the game\nWhen it comes to sex and drugs I stay abstain\nI saw all my momma did for an easier world\nI'mma mess it all up for a sleazier girl\nDon't listen to these fast girls bringing drama\nCause they don't even want to be a baby momma\nListen, let me tell y'all 'bout Percy\nHustling on the corner selling coke and Hershey\nGeared up too, straight down to his shoes\nHe had an E-class Benz on top of 22's\nIn his own head he thought he was lethal\nUntil he bumped heads with the wrong people\nNow Percy was pissed, a push and a shuffle\nA couple cats try to knock P for his hustle\nTo make a long story short, the gang got to his head\nHe heard a boom, he was dead\nShot, found under a bridge\nWorst thing is he had a baby girl and a kid\nMan, now how that sound to you?\nHad a wife and a kid then his life was through\nCaught up trying to make some money\nFor real, sex and drugs ain't even funny\n\n[Hook] x 2\n\n[Verse 2 - Part 1: Yungboyz (?)]\nI'm a dozen years old, keep my ... froze\nAbstain the game, I fall to thugs ...\nAvoid the drugs, stop girls from pregnancy, stop boys from sex\nAll I know's the whole world's correct\nAll the pollution, stop the confusion\nPeople killing each other for no reason, everyday of the season\nWho's looking at the face of the Earth? - Uh\nWho's looking at you smoking a blunt? - Uh\nWho's looking at you doing bad things? - Uh\nWho's looking at you flashing a ...\n\n[Verse 2 - Part 2: Yungboyz (?)]\nI run this beat like my name was J Hova\nDon't do drugs it will blow your mind over\nDon't follow people when the streets dealing weed, it rude\nBecause your peeps looking straight at you\n\n[Hook] x 3\n\n[Outro]\nR-J-98, it's great\n\"Civility is not a sign of weakness.\"\n\"Whatever hater.\""}], "artist": "Big Sean"}