{"artist": "Yung Ro", "songs": [{"album": "Welcome to Nobody Land", "image": "https://images.genius.com/a3621ce8171d94bca6d1e12de28ce669.389x389x1.jpg", "year": null, "lyrics": "Nobody!\nAnd a 1 and a 2 and a 3 nobody!\nAnd a 1 and a 2 and a 3 nobody!\nMy nigga sip, my nigga e, my nigga b, nobody!\nMy nigga j, my nigga shay, my nigga p, nobody\nCome and fuck wit nigga, come and fuck wit it (nobody!)\nWho gon fuck wit it nigga, who gon fuck wit it (nobody)\nMy nigga sip, my nigga e, my nigga b, nobody!\nMy nigga j, my nigga shay, my nigga p, nobody\nCome and fuck wit nigga, come and fuck wit it (nobody!)\nWho gon fuck wit it nigga, who gon fuck wit it (nobody)\n\nAnd ive bin, dyin' to meet someone who grime like me\nAin't possible, nobody! got a mind like me\nWho can go over ya head, make ya rewind that beat\nPlay catch up, and don't catch up, to rhyme thats we\nWit no ice, no gold, I still shine when I speak\nSmokin' till I'm jus, (whew) blowin' pinds of weed\nIn a old school hoop, screens behind the seat\nBoogie, stunned marko, x and I can't find the sweat\nI'm tired of niggas eatin' for free, when I grind to eat\nI got a lost bullet, who wanna play finders keeps\nBois gettin' cocky now, it's bout time to speak\nReal niggas show me love, and haters grind they teeth\nYou got plex, bitch throw me, shoot a nine at me\nAnd I'm like a butcher, cause I handle all kinds of beef\nPeople askin' mac, how he go about findin' me\nCause I already got three verses done, I had to find a beat\nKissed my main chick, and had the girl cryin' for weeks\nBut ain't nuthin changed, you got nobody, start dryin' ya cheeks\nThe game, has bin tooken, look it how they lookin'\nThe way I drop this light weight, before they even fly the hook in\nGyeah, ay\nI'm from the place where they box, and don't break no fights\nIn nobody land, we get trained to break yo mics\nShake up dice, speak once don't say thangs twice\nGive my niggas love, new comers don't shake hands light\nOver dance them dumb niggas, they gon pay us twice\nSome cookin'in my kitchen, and we don't bake up rice\nA born hustler, bin one ain't gave up right\nI'm so fast I had to slow down, and wake up life\nHaha, lemme slow it down, do a show and clown\nWhile on the streets, theres rowin' sounds\nSee how fast it go around\nGyeah, where my nobody team\nPaid in full, color changin' click, nah I mean\nUh huh, I'mma young fly cocky\nMutha fucka,and ain't nobody gon stop me\nGirls love me, they say Yung Ro crazy\nPlus she love the way I hop out, and say what's up baby\nThey say Yung Ro so coo, what a foo\nHe is, ro no mami I'm so meish\nYe, I'm me, Yung Ro, fuck wit it, nobody!\n\nAnd a 1 and a 2 and a 3 nobody!\nAnd a 1 and a 2 and a 3 nobody!\nAnd a 1 and a 2 and a 3 nobody!\nYe, ye, nobody!\n\nAnd a 1 and a 2 and a 3 nobody!\nAnd a 1 and a 2 and a 3 nobody!\nMy nigga sip, my nigga e, my nigga b, nobody!\nMy nigga j, my nigga shay, my nigga p, nobody\nCome and fuck wit nigga, come and fuck wit it (nobody!)\nWho gon fuck wit it nigga, who gon fuck wit it (nobody)\nMy nigga sip, my nigga e, my nigga b, nobody!\nMy nigga j, my nigga shay, my nigga p, nobody\nCome and fuck wit nigga, come and fuck wit it (nobody!)\nWho gon fuck wit it nigga, who gon fuck wit it (nobody)", "title": "1, 2, 3 Noobooody"}]}