{"songs": [{"title": "FDB (Fuck Dat Bitch) G-Mix", "lyrics": "West Side, Bankhead, is where I'm from\nEverything y'all did has been done\nMy True game and my shoe game\nYou can't touch that shit\nA bitch that holler 'bout \"fuck me?\"\nNah, fuck that bitch\nFuck that bitch, fuck that bitch\nA bitch that holler 'bout \"fuck me?\"\nNah, fuck that bitch\nFuck that bitch, fuck that bitch\nA bitch that holler 'bout \"fuck me?\"\nNah, fuck that bitch\n\n[Lil K]\nIma real ass nigga came from the south\nFuckin with bitches who from the bronx\nPussy so good ,nigga name me one\nTrunk full drugs nigga hit one\nUp in my condo I smoke up\nCali bud,red head name one\nJackpot hittin them bank rolls\nYeh nigga know we full paper\nMoney to the ceiling tall as jordan\nNever loosing money like kobe\nNigga im on it like rollie\nPockets full of green I spend it\nMy girl so curious I bend her\nUsing no rubber on her tho\nFuckin my ho like fuck dat bitch\nIm still in the cold\nGet a plane and smoke\nStamp my name on her like an envolope\nNigga yeh we shootin your cantalope\n50k on me like bang'em all\nShout out to young dro\nAnd the west side niggas\nEverywhere we go we bankheads niggas\nAll the Westside niggas say fuck dat bitch\nYa'll already know im on my shit bout to hit that shit like FUCK DAT BITCH\n\nWest Side, Bankhead, is where I'm from\nEverything y'all did has been done\nMy True game and my shoe game\nYou can't touch that shit\nA bitch that holler 'bout \"fuck me?\"\nNah, fuck that bitch\nFuck that bitch, fuck that bitch\nA bitch that holler 'bout \"fuck me?\"\nNah, fuck that bitch\nFuck that bitch, fuck that bitch\nA bitch that holler 'bout \"fuck me?\"\nNah, fuck that bitch\n\n[Verse 2: Young Dro]\nI’mma go three… stupid on the remix\nI’mma show you how to raise up out the fire like a phoenix\nI’m a Bankhead nigga, so I’m straighter than a penis\nIf you try to West Side, I’mma let off like semen\nIce got me anemic, walkin’ up in Nieman’s\nAnd every time I get a new broad, I get subpoenaed\nMy baby mama mad my girl look like a genie\nI’ve got racks like Venus, 20 stacks in…\nBread like panini, eat steaks and zucchini\nWith your broad in Tahiti, spaghetti string bikini\nI don’t spit on tracks, I throw up on ‘em like bulimic\nPardon, my “High Tymes” album a problem\n\n[Hook: Young Dro]\n\n[Verse 3: T.I.]\n…and the yacht match the Rollie, ice like a hockey player\nKick it like a soccer player, niggas hatin’ like a goalie\nLong neck, group sex all your bitch got for me\nWe’ve been walkin’ under stars since midnight, homie\nHad a shorty, pussy, hit it like a fistfight, homie\nMy dick only know what she kiss like, homie\nSee the molly got her goin’, you be callin’, she ignorin’\nI went balls-deep in her, nigga, you ain’t even know it\nBlowin’ Headband, strongest in the land\nSay you hit it, so you ain’t the only nigga can\nShe wanna be a freak, you wanna be a man\nGet head in a Coupe, sex in a Sprinter van\nRunnin’ full-court game, no one-on-one\nTake that doll, hit her one-on-one\nAin’t nothin’ else to do, she wanna cum for fun\nI’m by myself, hop, run, no one\nNigga she want me like Givenchy\nIn a presendential suite, nigga, me on three\nWhy they call me “Pussy Pumper”, nigga, she gon’ see\nLike she gon’ see, like she gon’ see…\nOkay, Hustle Gang, nigga, only thing I wear\nOh yeah, and…\nAnd… you know me, ho\nKnow where I’m from, know where I rep\n\n[Hook: Young Dro]\n\n[Verse 4: Trinidad James]\nSouthside Clay. Co., that’s where I’m from\nI’m on these red bottoms, Rick Owens…\nI’ve been rockin’ them Jordans\nI said now AG, compound – give me money, I’ll throw it\nMy hair’s luxurious – your shit ain’t growin’ (lame)\nI’ve got a smile on my face like Dro’s old cover\nFuck you bitch on the couch, no cover\nNigga fuck your couch, I’m Rick James, brother\nShe a super freak, she don’t like no rubbers\nFuck you, nigga, then fuck your cousin\nFor some shoes and a couple hundreds\nI thought you knew, let me teach you somethin’\nShe’ll suck me and kiss you like it ain’t nothin’\n…that bitch cold – nigga, now you know\nYou hold onto pussy (lame) I’ve pussy on hold (pimp)\nI get a whole lot of pussy, nigga, after my show\nRed, black and white girls… yeah, them Trinidad’s hoes\n\n[Hook: Young Dro]", "album": null, "year": null, "image": "https://images.genius.com/134a4872ea91075f919728667ab13bf3.877x877x1.jpg"}], "artist": "Young Dro"}