{"artist": "Fat Joe", "songs": [{"year": "1995-10-03", "album": "Jealous One’s Envy", "image": "https://images.genius.com/d39ec88ceb1de2aaf358c7c2fdc2898c.640x616x1.jpg", "lyrics": "[Fat Joe]\nWhattup JuJu?\nUhh, whattup Beatnuts?\nAll them Dominicans in Corona\nBobbito Stretch, my nigga Funk Flex\nThis is the dedication\nYeah, Punisher Big Dog in the house\nFull-A-Clips Crew\nRated R, my nigga Domingo\nEast New York representin, check it\n\nBefore I start, you know I got ta\nPay homage and respect to Afrika Bambaata\nZulu Nation, for twenty years of work\nFat Joe wouldn't be on if it wasn't for Red Alert\nChris Lighty, I hope the reign never ends\nViolator Records, now featuring The Twinz\nDiamond D, for believing in me\nShowbiz & A.G., the whole D.I.T.C\nMy nigga G. Rap, forever got your back\nWhether it's with the macs or on a Primo track\nAiyyo Guru, you know I love you to death\nPeace to Redman, Apache, Vinnie and Treach\nNevertheless, on the other side of town\nThere's my brother Lord Finesse gettin down for his crown\nDJ Sirs, killin shit, word to God\nPeace to Funkmaster Flex and the whole Flip Squad\nNice and Smooth, hey yo you know the situation\nIn case you haven't heard this jam is called the dedication\n\nYo it's the dedication\nTo all my niggas one love\nFrom the heart dedication\nThe dedication\nTo all my niggas one love..\n\nHey yo fuck all the rest, I'm givin love to Wu-Tang\nMy nigga Chef and Big Meth, keep doin your thang\nTony Starks, Ason, and the rest of the crew\nAll my niggas from Shaolin, you know how we do\nJames Todd Smith, for inspirin me\nAnd all the funny-ass promoters who be hirin me\nKnowledge Reigns Supreme, yo you know you're the best\nMake sure you get that message that I left with West\nAnyhows, on the other side of things\nBig Nas, L.E.S., and Mobb Deep from Queens\nPuff Daddy, get the millions kid\nNuff props and respect to Notorious B.I.G\nDJ Clue, you know I can't forget you\nDoo Wop, S&S, oh yeah and Ron G too\nCraig G, forever tryin to live like me\nAnd of course the one and only DJ Kid Capri\n\nYo it's the dedication\nTo all my niggas one love\nFrom the heart dedication\nThe dedication\nTo all my niggas one love\nFrom the heart dedication\nThe dedication\nTo all my niggas one love\nFrom the heart dedication\nThe dedication\nTo all my niggas one love..\n\nYeah, this joint right here, is dedicated\nTo all the real niggas in hip-hop, uhh\nWhat up Puba?\nWhattup my nigga Kool Micski?\nI ain't forget ya, L.A. love\nSadat X, Das EFX\nEverybody else, representin the real in hip-hop\nWord to mother\nLittle Heck, the whole TS crew\nBig Power, Gizmo\nAnd we out..", "title": "Dedication"}]}