{"artist": "Andy Mineo", "songs": [{"title": "106 & Park - BET “The Backroom” Freestyle", "album": "BET BackRoom Freestyles Collection", "year": null, "image": "https://images.genius.com/0fd2397265910e9f72dcf0c68b690ea7.304x172x1.png", "lyrics": "Welcome to my classroom\nI'm the orator for the moment let's use this backroom\nNow feel free to take notes on this lecture\nSave your questions for the end, may I begin\nWell, first the dilemma\nEverybody wanna shine like a diamond\nNobody wants to go through that pressure\nIt takes, time, refinement and push the miles for excellence\nIf a rapper tries to sum me I guess you can call me Oedipus\nKill 'em\nI am hip hop's four elements\nWith a touch of heaven sent, let me address them elephants\nIs he Latino?\nHe seems to be lacking melanin\nWhen I black out on that microphone all that chatter's irrelevant\nStadium packed out\nWe rap about everything we wanna\nYada Yada [?]\nOn a scale of 1-10, one-sixteen til He come again\nOn a mission with this pen I ain't missing\nListen, I feel like\nKing David who just slayed the Goliath\nHolding his head high while these haters remain quiet\nShhh, I ain't lying but you ain't gotta believe me\nIt's something you've never seen like what's under Sway's beanie\nCall me the game genie\nSort of feel like I'm cheating\nThere's more to like than chiefing and going out every weekend\nI'm treating this beat like a piece of meat that needs to be eaten\nMen move out of conviction, not out of convenience\n\nI ain't trying to preach to the choir\nI’m trying to reach in the fire\nWe got war overseas but got no peace in the Shire\nAnd they wonder why these kids gotta rob, huh?\nCause you can get a gun faster than you can get a job\nPressure applied\nI ain't puffing a lie\nI'm already with the Most High, write my bars as I fly, meaning\nTravel so much got status on every airline\nTil I'm far back, LeBron's hairline\n\nCarolina blue tips chillin' on them 14s\nHad them back when I was little sort of like that rapper from New Orleans\nOnly sure thing in life is your death\nI pray these rappers know that dude who's hanging on their neck\nYeah, I know Him well, so I ain't even stressed\nIf Kim Jong was taking photos it wasn't posing a threat, nah\nI'm engaged now so I tell them ladies later\nQuit hitting on me like Solange in the elevator\n\nYou know what I tell a hater?\nNothing, it doesn't bother me\nHonestly I'm an Anomaly breaking them off properly\nWhy these second string rappers trying to start with me\nI'm an organ donor but nobody want no parts of me\nAll about that blood like I hit an artery\nThis that Jesus talk, you don't wanna see me start?\nWell you better send somebody to martyr me\nIt's Uptown!"}]}