{"songs": [{"year": "2013-05-05", "album": "The ASF EP", "image": "https://images.genius.com/e2e2561bfaad3df26471bf8e493538b6.500x500x1.jpg", "title": "Angels", "lyrics": "[Produced by ROME]\n\n[Verse 1: Kevin Abstract]\nSo many possible things I can say and get away with\nThe same shit's recorded, exported, by all you lame kids\nASF up, oh, ASF up, oh\nI can say that over and over and it would bump bro\nNever be bunk tho\nDropped out but don't plan on ever going broke so\nHere's to the music and the kids that will use it\nRecordin', reportin' live from the city of Houston\nWhere the OG's screw it\nDodi Mob is a movement\nGot a fuckin' army unit\nGot some goons who got some oozies who ain't afraid to use them\nSo, if you mess around, fuck around, get knocked down\nGet locked out, like lock out\nYou hot now?\nSit down\nAin't bout that\nAin't really ever ever tryna hear that\nKinda weird at rap\nCall it weirdo rap, abstract, abnormal, and all that, but\nMade a classic, too\nI'm passing through, with an ease\nClasses I ain't pass yet, my momma oh so mad at me\nRather be with Raleigh, rolling up the finest tree\nStrokin' on some fucking keys\nOh wait, oh wait, no homo please\nThis that shit you prolly do not wanna hear, but need to hear\nNo diamonds in my hear, keep yo' vision clear\nTunnel though, twenty-twenty\n16 writing 16s that are better than niggas who 20\nName a nigga fuckin' with me\nAnd my melodies hot\nYou see the love that he got\nYou hear the tracks that he drop\nI talk in 3 p a lot\nI jam to 3 Peat a lot\nNone of this shit makes sense but you nod ya' head like, 'got damn he hot'\nWhy the fuck would he stop?\nGotta be a fool, to drop up outta school\nAin't even gotta job, don't even deliver food, but\nNow a days everybody wanna talk like they got something to say\nBut nothin' comes out when they move they lips it's just a bunch of gibberish\nAnd they move they mouth like they forgot about\nA-B-S-T-R-A-C-T\n\n[Verse 2: Dom Mclennon]\n1 time for your mind\n2 times for your spirit\n3 times for the dreamers\nWho only have goals with the chance to scare em\nHoping that isn't only I\nBut I feel its how I get by\nIf I don't aim high\nThen I can't touch skies\nSo I'm keeping the clouds level with my brow\nBig city mindstate coming from a small town\nNever had a bark so I muzzle others down\nFoot on the throttle never gonna stop now\nI'm the juggernaut bitch running straight for the crown\nCome stop me\nI'm a boutique; other niggas? Swap meets\nNaturally I'm unique, they copy\nWe accurate, competitors? Sloppy\nMusic is what we embody\nAnd RIP to S Dot\nA lot of people miss you\nBut this place of ours will succeed\nI gurantee it's no issue\nCock a pen back like a pistol\nLet it off upon the page\nOur future looks so crystal\nThey can't ever stop this wave\n\n[Bridge: Kevin Abstract]\nLook to the sky for advice, young boy"}], "artist": "Kevin Abstract"}