{"artist": "WC", "songs": [{"year": null, "lyrics": "Paper Trippin'\nWc\n(Rush Hour 2)\n\n[Wc]\nUhh, yeah! What's crackin y'all? Dub C\nStill chasin this cheese, puttin it down\nWhassup Nate?\n\n[Chorus: Nate Dogg]\nNigga I ain't rich yet, I'm still stackin G's (dem dolla dolla dollars)\nAin't afraid to bust back, paper's all I need (we rider rider riders)\nNigga I ain't rich yet, I'm still stackin G's (yeah, yeah)\nAin't afraid to bust back, paper's all I need\n\n[Wc]\nCheck it out\nWhat they hittin fo'? Look I'm sick of all this chattin\nBullshit rappin, let's really get it a-crackin\nY'all niggas ain't ready fo' a nigga that's gettin paper\nFoe scraper, dice shaker, the white, Chuck Taylors\nDark fat laces and fetti with big-ass faces\nBlue gators [?], X. O. By the cases\nThe rider ringleader with weed and my zag smashin\nYa bang ambassador, givin it up back at'cha blastin ya\nOff brand assassin-er, jackin for figures c'mon\nTotalled up a rock, with a repetitive offender\nThe purple tinter, the big spender\nThe realest nigga you know, smellin like doe doe and Pruno\nSick with the flow, swangin low-lows and Harleys\nGather the guests at my mansions and throw my parole parties\nEx criminal turned corporate; elevated my game to worldwide nation\nTippin on paper trippin nia\n\n[Chorus:]\n[Wc]\nBig beans or big wings or big screens\nBefo' y'all stands a ghetto nigga with big dreams\nI throw the dice, close my eyes and rich roll 'em\nTake my handkerchief and fold 'em, y'all know the slogan\nRiders don't worry multiply shift gears\nToss fingers in the sky, fuck hoes and stay high\nThe bigger the lick the bigger the hit to cash it all\nSo whether they ready or not I'm snatchin it all\nWood grains and chrome frames the mode is hang\nA trick that won't sang, transported dem thangs\nFuck the pain, give me a label ain't shit funny\nLook I'm tryin to touch that Rush and Lyor Cohen's money\nGet the Neville's money and blow doja with my stash on rich\nAnd get my dick licked by the baddest bitch\nFade ya, real boy major with tough shit they ain't got\nLike three-way pagers, nigga I'm paper trippin\n\n[Chorus:]\n[Nate Dogg]\nPaper is all.. (dolla dolla dolla dolla dollars)\n.. (dolla dolla dolla dolla dollars)\n.. (dolla dolla dolla dolla dollars)\n.. I need\n\n[Wc]\nTestin testin, broadcastin live\nAll day unleaded'll go fo' forty-nine\nNo garbage no cut, just the bomb pow-wow\nGots to get my hands on that new body style\nFloss all you nigga, toss liquor up\nA rugged nigga smokin on a cigarette butt\nMashin and I ain't lettin the pedal up\nCause all these songs on my radio ain't ghetto enough\nShutted 'em up with the tank in the cut, I'm sweated to bust\nDub C'zy, fo'ever, gettin 'em up\nHands down I'm the motherfuckin man\nWho else could take a gang hop and turn it to a national dance\nGivin the fans a glance of a rider saggin his pants\nWith my rag on my cane standin in a penguin stance, nigga\nWorldwidin, ridin, collidin\nFool it's sincerely yours the Ghetto Heisman, paper trippin\n\n[Chorus:]\n[Wc]\nDub C, ghetto extrordinaire, hood fabulous\nComin through with fingers in the air\nY'all know what time it is\n\n[Nate] nigga I ain't rich yet, I'm still stackin G's\n[Wc] Dem dolla dolla dollars", "image": "https://s3.amazonaws.com/rapgenius/1365792063_12686799_ori.jpg", "album": null, "title": "Paper Trippin’ (Feat. Nate Dogg)"}]}