{"artist": "The Game", "songs": [{"title": "Can a Drummer Get Some", "album": null, "year": null, "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg", "lyrics": "[Swizz Beatz]\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a, can a drummer get\nCan a, can a drummer get\nCan, can a drummer get\n(Can a drummer get some)\n\n[Game]\nBoom, guess who stepped in the room\nDressed in black diamonds like a fucking monsoon\nBack from the dead but they never found my killer\nSo I jumped up out this rave like Michael Jackson in thriller\nIller than most emcee's cause I be killin' 'em\nMost emcee's turn into ghost emcee's\nYeah, give a drummer some\nIf 32 seville when that all black Hummer run\nFace off, Nicholas Cage with a gauge\nI'm famous for killin' rappers, my style, grenade\nCook shit like Rae, the chef Raekwon\nThe beats are filet mignon without the A1\nWho walk like a pitbull, You? who bitch please\nI ate your favourite rapper's heart out with a 16\nDidn't hit the switch on something with fiends\nMake money with Ruff Ryders, homie, thats Swizz Cheese!\n\n[Swizz Beatz]\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a, can a drummer get\nCan a, can a drummer get\nCan, can a drummer get\n(Can a drummer get some)\n\n[Lil Wayne]\nBang, guess who checked in the game\nSmoke in the air like LeBron James\nRunning this shit like he run game\nPull out my dick and just pee on flames\nShe on Wayne, but she ain't what I be on\nI'm Leon, I pee on you pee-on's for eon's\nI'm in my prime like Deion\nI'mma shine like neon\nI'm a Lion like Leon\nBut I'm 'bout to go off, cause that is all I know of\n\nI don't have to show y'all, I'd rather show off\nYeah, Travis on the Drums\nTravis on the beat\nWayne got the smoke and Game got the heat\nWeezy F I'm an F'ing star\nHaha, get it? I'm an FN star\nHa, and it's the Rock you bastards\nIf I'm the rockstar, will rock you bastards\n\n[Swizz Beatz]\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a, can a drummer get\nCan a, can a drummer get\nCan, can a drummer get\n(Can a drummer get some)\n\n[Rick Ross]\n2Pac and Juice riding ? on the loose\nKing James round my neck, haters wish it was a noose\nLong Maybach and I wish it was a coupe\nKush out the jar, car smellin' like duke\nQuarter milli on the seat, yeah I know I'm a goof\nDesigner underwear she knows I'm a goose\nGot the wide body I'm a fat muthaf-cker\nIn Swahili I'm screaming \"stack muthaf-cker\"\nYa homie won't stop until I decide to\nUntil then I'm making rollie's for the homies to ride to\nSmokes on the folds, folks wanna know\nBitch I'mma boss, best foots on the blow\nKeep the hat pulled over, Big P on the front\nTravis on the drums, big weed on the blunt\nBeing Savage where I'm from, Girls manage from the jump\nDon't trap me like a punk, Travis handing me the pumps, so...\n\n[Swizz Beatz - x2]\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a drummer get some\nCan a, can a drummer get\nCan a, can a drummer get\nCan, can a drummer get\n(Can a drummer get some)"}]}