{"artist": "Gangsta Boo", "songs": [{"title": "Same Block", "album": "Both Worlds *69", "year": null, "image": "https://images.genius.com/9edd711bbac4c84ed942540e8bf7203b.450x672x1.jpg", "lyrics": "[Verse 1]\nIf you buck then say so, push a nigga off\nWith the quickness of my Glock fo sheezy, blast a nigga off!\nSmoke you like you dro', fuck a sissy hoe, since you wanted to know\nGangsta Boo ain't scared of you, I'll walk up to yo' fucking do'\nNa- Na- Na- Na- Na, you can't touch me silly trick\nWhat's the business bitch? I'm the lady of this Memphis shit\nYes I got the hollow words, secret follow words, where the dollar words\nCrazy lady yeah, millionaires, sporting Cartiers\nWhy don't you come around here, let me put you on some fuckin game\nYou bitches be lame, dope game, my game hoe!\nYes you, yes you bought, fuck what you haters be thinking or saying\nYes you, yes you bought my CD anyway\nI'm a come on out, gold and diamonds in my fucking mouth\nWhat you talking 'bout? So so scandalous stay representin the South\nRiding on them thangs, tryna dodge you player haters man\nI'm a stay the same, fuck whoever talking 'bout I done changed\n\n[Chorus: 4X]\nI be at the same block, same hood\nSame house, same sto', same folks\nLooking good bitch, I ain't changed hoe!\n\n[Verse 2]\nCan I ask you something, what you bitches tryna prove?\nActing like you buck, when really you look like a damn fool\nSee me in the streets, you try to chief, and smoke all your weed\nI don't want that babby-jazzy shit, I don't speak seeds\nNigga, nigga please I'm Miss Pimpin-Villain Gangsta Boo\nFuckin with my niggas, paper chasing tryna get this loot\nI ain't tryna take no shit, or be labled as a duck\nNever will I go out like that, you got me fucked up!\nYou bitches be talking that shit, do you think that you can handle me?\nRaised in B.H.Z., slash North Memphis Tennessee\nI don't think so, go and call yo' mother fucking crew\nI know where yo' mama stay, I'll send a bullet straight through\nStaying high, oh so, oh so high, I'm quick to lose my temper\nBitch, smack you, stomp you down bitch, it be that simple\nYou know that I be riding in fast cars, quick to hit the strip bar\nSippin on some syrup (sippin on some si-zzurp)\n\n[Chorus]\n\n[Verse 3]\nNigga come and take a ride, what you bitches know about?\nFuck you bitches, stick a mother fucking gun in yo' mouth\nHoes be hating cuz I made it rich, \"oohhh...lucky bitch!\"\nBeen down and for years, I still remain untouchable bitch!\nAlways be the one mean-mugging me, you groupie hoe\nThen after the show, you be the one on the flo'\nWhy you mad at me cuz i chose to, chose to keep it real?\nBitch get bout yo' cheese, stay about yo' hustle only for real\nNiggas wanna fuck when they see me on the B.E.T\nRiding in my truck, I pop a flick up in the DVD\nBalling through Black Haven, deep as hell in that Suburban man\nYou silly ass bitches, you wish you could see the shit that I be seeing man\nStill I stay the same, ghetto diva known as Gangsta Boo\nUndergroundin' clownin', upside downin', bitch I thought you knew\nCatch me on my corner burner undershirt, some heat\nIf you got some questions, catch me in the mother-fucking streets (Bee-yotch!)\n\n[Repeat Chorus to end]"}]}