{"songs": [{"album": null, "year": "2010-05-03", "title": "Hot 97 Freestyle on Flex 05/03/10", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Intro]\nHey, the funkmaster flex is coming\nI told myself I'd say that\nHey, hey look\n\n[Verse 1: Ice Cream]\nWake up, cuz gotta get your cake up\nIts falling from trees like leaves\nI'm bout to rake up\nMan if you ain't hungry than thats just\nMore bread for me to bake up\nMan if you ain't hungry man I'm trynna\nGet my cake up\nLook at the time, how could you think\nYour shit is sicker than mine\nAsk your homie as your girl ask your\nNigga then rhyme\nThis is andre mixed with Kanye mixed with Jigga then Nas\nCouldn't name a bug with a buzz bigger than mine\nMan I'm damn new homeless how Im picking up dimes\nBut nevermind that, look how I'm bringing these clever lines back\nNigga you whack, shoulda fired whoever signed that\nCole introduced you to death, you kept in contact\nJealous niggas, how many chances y'all blew?\nHow many times you been new?\nAll them advances y'all blew\nNow you see me on the rise and throw a tantrum or two\nLike \"Dog i'm iller than him.\" Nigga im cancer than you\nYou barely catching the flu, now who is you?\nDead summer, you bout to tell a couple niggas lose your number\nCause Cole world coming, later for them bench warmers\nBitch I get covers you don't even get covered\nNo more stunting like kenevil though, I ain't evil even though\nThe flow is hella hot my pot is steaming for a reason hoe\nHiroshima flow, napalm, used to pray to god that funk flex\nWould drop A-Bomb, man\nNow he dropping like eight bombs\nAnything possible, skinny jeans not a go\nRaps go so deep they begin to seem nautical\nGrade A, straight A, nigga go check the honor roll\nBoy, hey lemme still get\nCan I still get it flex?\nHey (On you) Hey (On you on you)\nHey (HOT 97)\n\n[Verse 2]\nI got a\nChip on my shoulder the size of a golden nugget\nThe industry overlooked me for that I'll be holding grudges\nWouldn't take a chance on me suddenly its oh you love it\nLets get a Cole feature, thats gon put you over budget now\nPicture being broke without no pot to piss in and\nSuddenly your idols is your competition\nUsed to be like god to me, slowly losing my religion as\nThese notes from my composition turn to compositions then\nPut it out and let the world sing\n(Yo hol' up hol' up hol' up)\nWe had dreams just to make it up the flagpole\nJust to find out that your heroes was some assholes, Y'all don't feel me\nMan look, hey y'all don't feel me (Lets get another one flex)\nHey y'all don't feel me\n(I told you he was gonna do something else, lets get to something else, lets get to something else?)\nYes sir, whatchu got?\nHey, hey, hey, uh, uh (Chuckles)\n\n[Verse 3: Blow tha Whistle]\nYeah, hey, New York (Oh my goodness, arrgh! arrgh!)\nHey, man, feast your eyes on a real nigga\nCould never say it too much, im a ville nigga, (NICE)\nPermission slips, if you wish I could field trip ya\nOh yeah you ill, while I heal, would you gill quicker\nTold my brother when I get a little bigger Imma whoop your ass (Ha Ha!)\nSchool of hard knocks, only outings with the class\nSo just in case a nigga trynna pull a fast one\nWhen it come to these hoes, Im trynna pull a fast one\nSo when it come to questions she don't even ask none\nI don't even remember the name of the last one\nWasn't this easy when a nigga didn't have nothing\nCould't catch a break, now a nigga need a\nFull body cast, throwing rappers into a body-bag\nI do it just for kicks like I'm in karate class\nNigga mind on money stress, like he took pilates class\nCole finna blow with his old snotty, ass (Blow the whistle?)\nBlow the whistle! (You know what is is, hot 97 Funk Flex J Cole)\nMan blow the whistle (You want another one?)\nMan whatever you got man, dog i'm ready for whatever (Let's go let's go let's go)\n\n[Verse 4]\nHey, hey, hey, hey\nYeah, yeah, man, look ok\nNow that I'm blowing up, they money is slowing up\nThem older hoes I used to know say \"Oh you blowin up?\nI remember when you was that tall\" Ok now girl I'm this tall\nAnd I'm ballin, I'm Chris Paul, they can't guard, and my whip dog\nLook y'all, to my old hoes I miss y'all, how could I ever diss y'all\nHold but never kid yall, uh, I need someone who's gone be my baby\nNot someone saying \"What have you done for me lately?\"\nI took you out, I dug you out but oh that ain't enough?\nYou want my mind, you want my time but that ain't whats up\nTime is money I can't afford that now, but girl you got the best range\nAnd a smart ass mouth, So come here (BLOW THA WHISTLE!)\nI really mean this, something like a genius\nAss so good, would have thought you made the deans list\nMan we got it Flex, thats all they get boy (Ah, just, just curse who cares!)\nHa hah ha ha ha (Just curse who cares!)\nAhhhhhhhh\n(Wait a minute, wait a minute)"}], "artist": "J. Cole"}