{"songs": [{"title": "OOOUUU", "lyrics": "[Intro]\nYo, bro, I think I had too much Hennessy, man\nThis Hennessy gettin' to me\nI ain't gonna lie, I'm a little smizz\nI'm a little drizz\nBut we in the club, man\nOOOUUU\n\n[Verse]\nYeah they hate but they broke though (But they broke though)\nAnd when it's time to pop they a no-show (Where they at?)\nYeah, I'm pretty but I'm loco (Yeah, I'm loco)\nThe loud got me movin' slow-mo\nAyo, Tweetie, where the hoes, bro? (Where the hoes, bro?)\nAyo, Keys, where the hoes though? (Yo, where the hoes though?)\nThat other nigga, he a bozo (He a bozo)\nIt's M.A, you don't know ho? (You don't know ho?)\nWe got liquor by the boatload (That Henny)\nDisrespect the Lyfe, that's a no-no (That's a no-no)\nAll my niggas dressed in that rojo (Redlyfe)\nI ride for my guys, that's the bro code (That's the bro code)\nBaby gave me head, that's a low blow (That's a low blow)\nDamn, she make me weak when she deep throat (When she deep throat)\nI need a rich bitch, not a cheap ho (Not a cheap ho)\nThey be on that hate shit, I peep though (Yeah, I peep though)\nMy brother told me, \"Fuck 'em, get that money sis!\" (Yo, fuck 'em)\nYou just keep on grindin' on your hungry shit (Uh-huh)\nIgnore the hate, ignore the fake, ignore the funny shit (Ignore the funny shit)\n'Cause if a nigga violate we got a hunnit clips (Grrrrrrrah)\nAnd we go zero to a hundred quick (Oooh)\nWe just them niggas you ain't fuckin' with (oh, no)\nPockets on a chubby chick (uh)\nAnd still go bag a thottie in some bummy shit (ooouuu)\nYerr, Eli, why they testin' me? (yo, why they, uh)\nLike I don't always keep the hammer next to me (like I don't keep that hammer)\nLike I ain't got a hitter to the left of me (like I ain't got a hitter)\nLike we ain't in these streets more than Sesame (ooh)\nIf that's your chick then why she textin' me? (yo, why she textin')\nWhy she keep callin' my phone speakin' sexually? (speakin' ooh)\nEvery time I'm out, why she stressin' me? (yo, why she stressin')\nYou call her Stephanie? (you call her huh?) I call her Headphanie (ooouuu)\nI don't open doors for a whore (no no no)\nI just want the neck, nothin' more (no nothing more)\nShawty, make it clap, make it applaud (yea, make it clap)\nWhen you tired of your man, give me a call (give me a call)\nDyke bitches talkin' out they jaw (yo, what you say?)\nNext minute, callin' for the law (ooh-ooh)\nThis 9 will have 'em callin' for the Lord (grrrrrrrah)\nThey ain't gettin' shmoney so they bored (man, they bored)\nI could never lose, what you thought? (man, what you thought?)\nM.A got it on lock, man, of course (man, of course)\nThey say I got the juice, I got the sauce (I got the sauce)\nThese haters on my body, shake 'em off (I shake 'em off)\nPussy, I'm a bully and a boss (man, I'm a boss)\nI'm killin' 'em, sorry for your loss (R.I.P.)\nI just caught a body, Randy Moss (Ra- ooh!)\nNow this year I'm really goin' off (I'm goin' off)\n\n[Outro]\nOOOUUU, OOOUUU\nThese haters on my body, shake 'em off\nOOOUUU, OOOUUU\nAh, these haters on my body, shake 'em off\nOOOUUU, OOOUUU\nThese haters on my body, shake 'em off\nI could never lose, what you thought?\nWhat they thought?\nI could never lose, what you thought?\nThis Henny got me, it got me sauced\nThis Henny got me, ooh, it got me sauced\nI could never lose, what you thought?\nM.A got it on lock, man, of course\nOOOUUU, OOO-UUU", "album": "Herstory", "year": "2016-05-12", "image": "https://images.genius.com/6697b65322ef90e9777557e902c1b3c4.1000x1000x1.jpg"}], "artist": "Young M.A"}