{"artist": "E-40", "songs": [{"title": "40 & Hiero", "image": "https://images.genius.com/7da108e257a86c75f207873e9454a951.500x500x1.jpg", "album": "The Block Brochure: Welcome to the Soil 3", "year": "2012-03-26", "lyrics": "[Intro]\nThis is a 101 percent music exclusive\n*scratched samples*\n\"E-40\"—\"40 playa partna\"\n\"Hiero-glyphics\"\n\"Ah yeah\"\n\"40...40...\"Hiero\"\n\"Heavy on the Grind Entergamement\"\n\"Ah yeah\"\n\"40...40...\"Ah yeah...\"\n\n{E-40]\nUgh, put me with the greats; don’t put me with the fakes\nMe and the 'glyphics go back like vinyl and cassette tapes\nNo female traits just OG boss shit\nIt ain't gotta to be on the radio to be a hit\nI told this broad the other day 'Bitch, what do you want?\nWanna hear some solid motherfuckers or some chumps?'\nShe said 'Water, water, I swear on my daughter\nYou the best that ever done it—I put that on my mama!'\nHit you other the head like a quarter creche\nI mean every fuckin' thing I say\nHella rhymes done got away, but still relevant to this day\nBorn and raised in the Valley J\nHooking up with my folks from the O-A-K\nRockin' the mic 'til I’m old and gray\nWhat you niggas gotta say? BIATCH!\n\n[Del]\nAverage niggas talk about other niggas' business\nGreat minds talk about ideas and dimensions\nI feel we the difference—E-40, Hieroglyphics\nYou speak on the Bay, the aforementioned\nComing up before you even finished half your sentence\nAsk, you bitches, if your ass suspicious\nWe the masters spittin', take out half your district\nInteract with wizards or in pools with rap magicians\n\n[Pep Love]\nBarnum and Bailey, the show goes on\nYou better get it on before the whole ozone gone\nI got a jones in my bones for a spliff and riff and a semi tone\nUntil you see me sitting on my throne, I’ll be on my grind\nPep Lava go hard or go home\nWhen the mic is on, and the light gets shown\nIt’s Hieroglyphics crew and Vallejo's own and on\n\n[Phesto Dee]\nYeah, we love our style, 'cause we underground\nBut the funds pile, plus the guns go blaow\nAnd we thug hoes out\nAnd always slidin' up the block with some thunderous pound\nWe just some Town veterans\nRep it with no extra effort 'cause we never left it\nBut still worldwide accepted\nName a continent where I ain't respected\nHop on Fonzie shit, start firing my weapon (BOOM!)\n\n[Scratches]\nE, E, E, E, E, E, E, E-40\nHiero, Hieroglyphics\nHeavy on the Grind, grind, grind, grind\nE, E-40\nHieroglyphics...E-40...Hieroglyphics\n\nThat’s right—rap gods\n\n[Casual]\nMy crew rocks all in the boondocks\n2Pac all in the boombox\nTwo Glocks, bankrolls in the shoebox\nYou with them stank hoes? You need a new bop\nI’m in my Hiero hoodie, Hiero jeans on\nLooking like you wouldn't swing on King Kong\nYep, gettin' my Joe Clark Lean On\nNouveau—Hiero and 4-O\n\n[Tajai]\nY'all frosty, parfait softy\nFresh off the charter plane or the chopper with the laundry Operation Dr. J, dock of the Bay\nYour style scrawny, act salty, bag off me, rap saucy, ask 40\nLaboratory all foggy\nAuditory got your paparazzi shorty soggy, call Doggy\nSatellite walkie talkie, you side higher than the hierarchy\nI'm Mani Marley off the kamikaze\n\n[Opio]\nGotta watch me, zoom like a Maserati\nDo 'em like I rock the party, this is not a hobby\nOff the Rossi, giant in the game\nTrue slang on 'em and they claim it like it's you, come anew\n\n[A-Plus]\nIt’s A-Plus, the A stands for alien\nDifferent kind of cat, no category you could say he in\nHieroglyphics and E-40, A-P off the chain again\nI be on one, people they say I’m mainey, mayne\nI be one merry elf—Molly, she got a very soft body\nTry to kick it like me, you will be carried off probably\nBeen wildin' at parties since I was barely off the potty\nWhile your fairy ass partnas be tryna scare off all the hotties\n\nThere is no competition (Repeated 6X)\nNo comp, no comp, no competition (Scratch repeated 6X)\nThere is no competition\nNo comp, no comp, no competition"}]}