{"songs": [{"image": "https://images.genius.com/fce33b3ebef1d7b319798572d640773e.1000x999x1.jpg", "album": "Hot Soup", "title": "Dance", "lyrics": "[Verse 1]\nOne, two, three to the four\nYeah I'm back on my grind\nLike you ain't know\nIt's Detroit brat, tryna get that bread\nBut I won't turn to X like Detroit Red\nI'm up early, knocking roaches off my toothbrush\nIn the spot hoodie on just like the Ku Klux\nWalk around this bitch, like I got four nuts\nSo when I wet them bitches, swing like nunchucks\nCame a long way from getting jumped by Chemp\nChopping up white like Stefan Grendt\nFlow like a champ, way ahead of my peers\nAnd again I smoke strong, like Stevie Wonder's ears\nIm in the cutty, with the money on my mind\nFinger on the trigger, hand on my nine\nSo I can't afford time\nBut I got the AP of the fruity lemon line\n\n[Hook]\nAnd I ain't too tough to dance\nLet me adjust this heater\nBulging out of my pants\nFirst I step to the left\nThen I step to the right\nThen you drop it down low\nBring it back, ight? (Hey!)\n\n[Verse 2]\nFive, six, seven to eight\n'Bout to slide on you hoes, just like home plate\nI get brain early, that mean I think first\nYou draw last, you paint a picture of a black hearse\nFuck what you think, I'm 'bout that bank\nStones like the button of your Marvis Tanks\nTop full clip, and your bitch on my dick\nCause you're broke like looses, in your pants pocket\nIt barely sit above the rim\nAnd I wore gats like bass heads pull on strings\nMe and my man, two guns like contra\nKeep your bitch, she looks like My Pet Monster\nLame nigga, got no choice but to trick\nProbably could fuck a blind ugly bitch\nI can't get enough of these hoes\nGrab my hand and walk me straight to the dance floor\n\n[Hook]\nAnd I ain't too tough to dance\nLet me adjust this heater\nBulging out of my pants\nFirst I step to the left\nThen I step to the right\nThen you drop it down low\nBring it back, ight? (Hey!)\n\n[Outro]\nY'all niggas see how easy that was?\nI don't think they know man\nLupido sounds nigga\nIt's official now\nNick's beat nigga\nIt's Danny Brown nigga, y'all know what it is\nDetroit stand up!", "year": null}], "artist": "Danny Brown"}