{"songs": [{"lyrics": "(Hook)\nI'm the greatest mc, I'm the greatest mc in the worrllld\nI'm the greatest mc, I'm the greatest mc in the worrllld\n\n(Verse 1)\nAs soon as I grab it\nI eat it up like a, savage\nAnd no I don't have it\nI get it together like a marriage\nI'm seeking all rappers\nI'm on my p's and q's and carrots\nYall don't understand? Well god damn don't yall know my status?\nI'm flowin the fattest(mmmm), that is (mmm), I'm the baddest\nNo need to explain my name, the only thing that matters\nFor suckas who bite me\nThey find I'm a bit much to swallow\nYou thinkin it's hollow\nMy rhythm is too r-rugged to follow\nIt hit you like bam, biggeda bam bam, biggeda bam... aiight?\nGod damn...\nThe kid is a wizard, I'm definitely destined to make eight digits\nMet up with g rap on the road to riches\nAs soon as I step up, nahhh, whenever I'm in the, ugh, whatever I touch whatever I clutch you know I'm gonna injure\nUgh, the nigga don't play\nUgh, the nigga'll slay\nSo wiggle away heyyy you gotta dig that nigga jayyyyy...\n\n(Hook)\n\n(Verse 2)\nI be thorough, in every borough\nMy name be ringing\nFor drug slinging\nAnd doin my thing and\nBut fuck that\nBoot-knockin\nSome lady be jockin, my money be Flippin\nI see ya peekin when I'm freakin nigga stop riffin\nI got the I-deal, skills for real\nSix digits before i had a deal son chill\nWhoo's that?\nWit a flip of the melodramatic to cruuise back,I just loves the ways I do's that\nBetter at, rippin it, Flippin it flow-in, kickin the fly shit\nFor brothers I'm givin a bit of advice like, don't even try that shit\nI got skills till its un-real, bro-ken down, I'm speedin it up to a hundred an eighty thousand trillion mills\nSo whatever is said, about a brother as bein nice as me\nYall know that shit is dead riight? That shit is dead\nJiggeda-uhh, iggeda-uh-uh, the wiggeda-uh-uh\nWhy ask why when the shit sound this fly?\n\n(Hook)\n\n(Verse 3)\nHere i,Here I,here I,here I come, agu-gu-gu-gain\nRun, up-up-up-up in\nNiggas is duh-du-duckin I boo-boo-boo-buck it, fuck it I'm wild\nBitta boo boo boo bam\nWhatchu niggas gonna do to the man?\nI see you broughtcha little crew... and?\nI'm still comin wit velocity check it out\nJid-ay, id-ay, wid-iah, zid-ee, uhuhhh\nAin't none of these clowns fuckin around\nAin't none of these clowns, standin they ground, with the crowned prince of the underground\nSounds like I'm ready to catch wreck now\nThe heat's on, sweat now\nJay z's on, be gone to the next town, punks\nJump up and get beat down\nCheck it out-check it out, check it out, ladies\nBe comin out they seats now(woooo!)\nThis kid, got, skills\nIts a pity they way I'm rippin rugged rhythm through the city like\nTunini-nunini-nunini-nu-nu-ni-diddy\nI got rhythm, I\nHit em with rhythm, I\nHit em and split em I did em I get rid of them guys\nJ-A, baby baby please, Gimme fees\nBaby baby we crazy-ees, while jay-z gets crazy G's\nI pick a pray, then I slay, never bring in my way\nI'm Cuttin your shit short, hey... aiight?\n\n(Hook×2)\n\n(Outro)\nAiight?\nJay z, 1994 and forever\nClark kent, made the tracks lovely... aiight?\nSo yall act like Bo Jackson and get hip to this aiight?\nOn the real... niggas can't fuck around, Yall niggas can't see me\nWhat? What? What? I'm out...\n\n(Scratches)\nI'm the greatest mc, I'm the greatest mc, I'm the greatest mc\nI'm the greatest mc, I'm the greatest mc, I'm the greatest mc\nI'm the greatest mc, I'm the greatest mc in the worrllld (greatest mc in the worrllld)", "title": "Greatest mc (demo)", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}