{"songs": [{"album": "Locke High", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg", "year": "2008-10-24", "title": "Bounce, Rock, Skate", "lyrics": "[Verse 1: Snoop Dogg]\nI took two nickels and made a dime out it\nI took two words and made a rhyme out it\nIt's hard to explain it, but I did it while I'm tainted\nSteady rippin' while I'm crippin', dip the shine out\nI check my rear view\nI tip it down a little, just to get a clear view\nI got the pigs on me, I got the dips on em\nSo I slide, swerve, and try to dip on em\nMake a smooth getaway, so clean\nMy windows smoke green, my endo super supreme\nWhen the lights hit the bitch that shit turns green\nBut in the daytime, that motherfucker whip cream\n\n[Hook: Terrace Martin]\nMy coup baby blue\nAye Snoop, what it do?\nAye Quik, where it's at?\nKurupt start the 'Lac\nSo we can bounce, rock, rollerskate and\nDippin' down the shore on platinum Daytons\n\n[Verse 2: Terrace Martin]\nMy eyes like a strobe light, won't stop blinking\nBrain like a stop sign, can't stop thinking\nSix shots of Patron\nFall back at the mouth, now you know it's on\nLex pass my cellphone, so I can hit Big Snoop and Quik\nStroll to the valley cause it's time to dip\nAnd the DJ didn't already play our shit\n\n[Verse 3: DJ Quik]\nA little bit of Quik is worth all you've got\nLife is like a pussy, you should your shot\nMy foot is in my pool behind my big ass crib\nCaptain Morgan Spiced Rum, no coke, Mr. Pibb\nWhen there ain't a menage on the back of my spot\nBad bitches just lounging, only bottoms, no bra\nPonytail on my neck, who do I think I am?\nReggae music is blasting, eight is down to a gram\nNow let's go to your hood, MTV playin' jams\nNiggas wearin' your couch down, wishing they were I am\nYou're the colour of money, and your weed looks like Autumn\nAnd the pockets on your jeans look like they did when you bought em\nI feel you nigga, I hate me too\nI wish you could make these bossy player moves that I do\nI'm exotic, I'm eccentric, I'm erotic relentless\nAnd if Snoop Dogg is the king then you know who the prince is\nNow crown me the Quikness\nTerrace Martin, Kurupt Young Gotti, now this is senseless\nWho in the world would've thought that we would get this?\nKnow what I think?\nI think your counterfeit rapper printer is all out of ink\nYou missed the glory days\nNot to be told when the story's phased\nCut you in the days\nChickens open up their legs and give me all their eggs\nBlame them and blame me\nAnd fuck it for that sanctity and hopin' I done pull out when I came\n\n[Hook]\n\n[Verse 4: Kurupt]\nYou call that swag? I call that jag\nSnatch off with a couple scuffles, chickens, and duffle bags\nMathematician calculating ounces and grams\nMiami the Amityville, skittles and candymen\nHigh off of all types; the vikes to the sands\nYeah, hunna stunna, demonish candyman\nWhat up? The iron in any hand\nCrush em like soda cans\nAroma or green the tan as the kush burns man\nThe bird in the hand and some urine in the bush\nFricking seeing these Vaseline bunny rappin' rabbits\nIt's a habbit\n\n[Hook]"}], "artist": "Terrace Martin"}