{"songs": [{"image": "https://images.genius.com/40642ecbe59a6559b6aed8008aa2d100.400x319x1.jpg", "title": "Too Broke To Vote", "album": null, "year": "2016-03-20", "lyrics": "[Nick Cannon]\n\nEverybody I know say they too broke to vote\nWith all this heavy slave mentality we could've broke the boat\nNobody cares about me\nNobody cares about my family\nNobody cares about my folks\nSo Nobody gets my vote\n\nNobody for President\nThat's my campaign slogan\nWe got money for wars but can't feed our homeless\nThe government is hopeless\nIt's like a reality show\n\"Real Lives of the House Liars\"\nStarring Anglo Saxon Christians\nChange the channel sound like a bunch of arguing bitches\nSwitch up, the game-show \"America's Next Top Corrupt Judicial System\"\n\nFor instance, I'm saying look at my options\nVoting for office is like picking out which gun you wanna get shot with\nThese politicians think they battle rappers and they swear they spitting that hot shit!\nGun control, abortion\nCivil liberties, extortion\nEnergy, the economy\nImmigration and global warming\nBut I ain't feeling the Bern\nAnd hell naw I'll never get Trumped\nThe Clintons had they chance with me, they the reason my cousin still locked up\nMass incarceration it's still fucked up\n3 strikes get you 25 to life, nigga good luck\nFuck yo future\nFuck yo daddy\nFuck yo rights\nFuck yo mentality\nIn actuality, the Constitution said I was just 3/5ths of a man\nWhat's stopping them from saying that again?\nThe top 3 percent\nOver the 13th amendment\nMinus the 40 acres plus the rest of my reparations\nYeah they doing that new government math\nWatergate to Whitewater, call that a government bath\n\nThe law was we couldn't even use the same bathroom\nBack then where was your government at?\nBehind our backs, ingesting crack in it up\nYup, the government lab\nBut in our face they wanna cry and sob\nAnd wonder why we shoot and Rob\nBut guess what? nothing stops a bullet, like a job\n\nAnd we can't elect without no college\nAnd don't even get me started about the Electoral College\nI mean let's be honest that's how they really choose the president and that's facts!\nThey got y'all confused with these views from Republicans and Democrats\n\nLiberals and Conservatives, man I ain't none of that\nI'm hungry, Nigga where the money at?\nCause I'm too broke to vote\nI'm too broke to cope\nI ain't trying to check no ballots, I'm trying to check this balance on these checking accounts\nY'all being careful, double checking it counts\nBut Just like Florida it's gonna be another miscount\nAnd once they get to this amount they gonna try to dismount\nFlip sides back and forth it's\nPolitical gymnastics like Olympic acrobats\nGo for the gold, cause that's who makes the rules\nAnd all this pageantry is just designed for fools\nThey gonna give you the one they choose\n\nToo big to fail, too rich to lose\nAnd I'm still to broke to vote\nSo how do we fix this shit then?\nGive her away. In the end, is where it begins\nSo I vote we return the country back to its original owners\nThe Native Americans!"}], "artist": "Nick Cannon"}