{"songs": [{"lyrics": "[Intro: Hannah Williams]\nDo I find it so hard\nWhen I know in my heart\nI'm letting you down every day\nLetting you down every day\nWhy do I keep on running away?\n\n[Verse 1: JAY-Z]\nLook, I apologize, often womanize\nTook for my child to be born, see through a woman's eyes\nTook for these natural twins to believe in miracles\nTook me too long for this song, I don't deserve you\nI harassed you out in Paris\n\"Please come back to Rome,\" you make it home\nWe talked for hours when you were on tour\n“Please pick up the phone, pick up the phone!”\nI said: “Don't embarrass me,” instead of “Be mine”\nThat was my proposal for us to go steady\nThat was your 21st birthday\nYou matured faster than me, I wasn't ready\nSo I apologize\nI seen the innocence leave your eyes\nI still mourn this death and\nI apologize for all the stillborns 'cause I wasn't present\nYour body wouldn't accept it\nI apologize to all the women whom I toyed with your emotions\n'Cause I was emotionless\nAnd I apologize 'cause at your best you are love\nAnd because I fall short of what I say I'm all about\nYour eyes leave with the soul that your body once housed\nAnd you stare blankly into space\nThinkin' of all the time, you wasted it on all this basic shit\nSo I apologize\n\n[Chorus: Kim Burrell]\nI'm never gonna treat you\nI'm never gonna treat you like I should\nOhhhhhh\n\n[Verse 2: JAY-Z]\nI apologize, our love was one for the ages and I contained us\nAnd all this ratchet shit and we more expansive\nNot meant to cry and die alone in these mansions\nOr sleep with our back turned\nWe supposed to vacay 'til our backs burn\nWe're supposed to laugh 'til our heart stops\nAnd then meet in a space where the dark stop\nAnd let love light the way\nLike the men before me, I cut off my nose to spite my face\nI never wanted another woman to know\nSomething about me that you didn't know\nI promised, I cried, I couldn't hold\nI suck at love, I think I need a do-over\nI will be emotionally available if I invited you over\nI stew over, what if you over my shit?\n\n[Chorus: Kim Burrell]\nI'm never gonna treat you\nI'm never gonna treat you like I should\nOhhhhhh\n\n[Verse 3: JAY-Z]\nAnd if my children knew\nI don't even know what I would do\nIf they ain't look at me the same\nI would prob'ly die with all the shame\n\"You did what with who?\"\nWhat good is a ménage à trois when you have a soulmate?\n\"You risked that for Blue?\"\nIf I wasn't a superhero in your face\nMy heart breaks for the day I have to explain my mistakes\nAnd the mask goes away and Santa Claus is fake\nAnd you go online and see\nFor Blue's tooth, the tooth fairy didn't pay\n\n[Chorus: Hannah Williams]\nI'm never gonna treat you like I should", "title": "4:44", "image": "https://images.genius.com/4cf5f4f88ace021acdc18cc3cefcf2f4.1000x1000x1.jpg", "year": "2017-06-30", "album": "4:44"}], "artist": "JAY-Z"}