{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Hook: R.A. The Rugged Man]\nYou ain't never been down (x3)\nI get into you\n[x2]\n\n[Verse 1: R.A. The Rugged Man]\nNow who that guy, who that guy\nThe R to the A, mad fly, I don't know why\nCheck the studio, I get moody bro\nWhen ya booty never fed up\nYa never sued me though (shut the fuck up)\n'Cuz I been known to smack a bitches nuts\nOh shit, they could cured by stitches\nBut their bodies cut up and buried in ditches\nWord up, you think I'm not butter\nSince I stutter, I bust some letters, then I cut 'em\nErick Sermon, he gets busy hittin' switches\nCrustified! And I get busy whilst I'm shittin' on bitches\nSo how you even gonna try to fuck around when you ain't never been down\n\n[Hook]\n\n[Verse 2: R.A. The Rugged Man]\nWomen ain't nuttin' but sluts when that bust it\nDon't say nuttin' and if I press it in, I press the red button\nWho's that, the smile on ya face, you better lose that\nSympathy, I never choose that\nGod didn't bless me, don't stress me, molest me\nI won't test me, I never met that a rapper that impressed me\nTo the bitches! (Suck my dick!) To the bitches? (Fuck off, fuck you!)\n'Cuz if a bitch try to cut my dick off\nI'd cut her arms off, her legs and her tongue\nAnd then I'd shove her in the toilet bowl\nMosta men act effeminate, they got their bitches\nRunning shit but they be a whore in it their blood, I'm pouring it\n\n[Hook]\n\n[Verse 3: R.A. The Rugged Man]\nI shove my hand through ya belly button\nAnd ya feel ya testis and pull ya ribs out\n'Cuz that's what the Crustified Dibbs is 'bout\nSo let's throw ya dicks through the air and let's sexually\nMolest women like we just don't care 'cuz I'll be the crusty\nSo all ya hookers that lust after me just disgust me\nI shove a spoon thru ya left nostril, some might treat it as hostile\nBut people don't make it to the hospital (WHAA!)\nSlutty bitch whore, I'm gonna spit on you\nAnd after kickin' you, I go see the other kids who got the dick in you\nWhy can't I get this anger out of me?\nI don't try to be but it lives inside of me\n\n[Hook]\n\n[Verse 4: R.A. The Rugged Man]\nYou can't stop us, don't knock us, my pop duke sports dockers\nI would like to spin doctors but I just rock the hip-hoppers\nIf you see some of the bitches, I stuck\nYou'd throw up, but, uh, uh, pussy is pussy, I don't give a fuck\nChristianity groups that I've offended, they talk shit\nBut they can't be born again when I get thru with them\nIt ticks me off they using horror flicks for gimmicks\nWhen I live it, ya label couldn't sign me, so they took the image\nSo what's with cha, you ain't never been..with it so I suggest that ya quit it\n\n[Hook]", "title": "You Ain’t Never Been Down", "image": "https://images.genius.com/0459459cdc2f6a1ba50292d192b060db.500x500x1.jpg"}]}