{"songs": [{"album": "Based on a T.R.U. Story", "image": "https://images.rapgenius.com/662aecc043e00e2024c2edca76be933a.612x612x1.jpg", "title": "Birthday Song", "year": "2012-07-24", "lyrics": "[Intro: 2 Chainz]\nYeah birthday, it's your birthday\nIf I die, bury me inside the Louis store\nHa, uh, uh\n\n[Chorus: 2 Chainz]\nThey ask me what I do and who I do it for (yeah)\nAnd how I come up with this shit up in the studio (yeah)\nAll I want for my birthday is a big booty ho (true)\nAll I want for my birthday is a big booty ho (tell 'em)\nWhen I die, bury me inside the Gucci store (tell 'em)\nWhen I die, bury me inside the Louis store (true)\nAll I want for my birthday is a big booty ho (yeah)\nAll I want for my birthday is a big booty ho (2 Chainz!)\n\n[Verse 1: 2 Chainz]\nShe got a big booty so I call her Big Booty (booty)\nSkrr, skrr, wrists movin', cookin', gettin' to it (cookin')\nI'm in the kitchen (I'm in the kitchen) yams everywhere (yams)\nJust made a juug (just made a juug) I got bands everywhere (bands)\nYou the realest nigga breathin' if I hold my breath (damn)\nReferee with a whistle, brrrt, hold this tech (baow)\nExtendo clip (extendo clip) extendo roll (extendo roll)\nWhen yo girl leave me, she need a hair salon (damn)\nHair-Hair Weave Killer goin' on a trapathon (yeah)\nSee I done had more bombs, than Pakistan (boom)\nDope bomb, dro bomb and a pill bomb (bomb)\nSee nigga, I'm ballin', you in will call (true)\nWhen I die, bury me inside the jewelry store (2 Chainz)\nWhen I die, bury me inside the Truey store (true)\nTrue to my religion, two everything, I'm too different\nSo when I die, bury me next to two bitches (two bitches)\n\n[Chorus: 2 Chainz]\nThey ask me what I do and who I do it for (yeah)\nAnd how I come up with this shit up in the studio (yeah)\nAll I want for my birthday is a big booty ho (true)\nAll I want for my birthday is a big booty ho (tell 'em)\nWhen I die, bury me inside the Gucci store (tell 'em)\nWhen I die, bury me inside the Louis store (true)\nAll I want for my birthday is a big booty ho (yeah)\nAll I want for my birthday is a big booty ho\n\n[Verse 2: Kanye West]\nAhh, Yeezy, Yeezy, how you do it, huh?\nIt's my birthday, I deserve to be greedy, huh?\nShe holdin' out, she ain't givin' to the needy, huh?\nYou go downstairs and fall asleep with the TV on\nY'all been together ten years, you deserve a ménage\n'Specially if you put that BMW in a garage\n'Specially if you paid a couple payments on her momma crib\nWent to her niece's graduation, man, I hate those kids!\nLast birthday, she got you a new sweater\nPut it on, give her a kiss, and tell her \"Do better\"\nShe said, \"How 'bout I get you jewelry from the West End?\"\nHow 'bout she hit the Westin and get her best friend?\nHa, I'm jokin', I'm just serious, I asked her\n\"Don't be actin', like no actress, if we preachin', then we practice\nDon't be reachin', don't be touchin' shit, we in Kanye West's Benz!\n'Cause I will turn you back to a pedestrian, hah!\"\n\n[Chorus: 2 Chainz]\nThey ask me what I do and who I do it for (yeah)\nAnd how I come up with this shit up in the studio (yeah)\nAll I want for my birthday is a big booty ho (true)\nAll I want for my birthday is a big booty ho (tell 'em)\nWhen I die, bury me inside the Gucci store (tell 'em)\nWhen I die, bury me inside the Louis store (true)\nAll I want for my birthday is a big booty ho (yeah)\nAll I want for my birthday is a big booty ho\n\n[Verse 3: 2 Chainz & Kanye West]\nIt's your birthday (yeah) it's your birthday (uh)\nBad bitch contest, you in first place\nYou in first place, you in first place\nBad bitch contest, you in first place\nI show up with a check to your workplace\nThen hand the valet the keys to the Merces\nTell the DJ play your song, this shit come on\nWhat I'm seeing from the back I can't front on\nThey ask me what I do and who I do it for\nWhen I die, bury me inside the booty club\nGet it, girl, get it, girl, get it, get it, girl\nI might switch it up and get your girl\n\n[Chorus: 2 Chainz]\nThey ask me what I do and who I do it for (yeah)\nAnd how I come up with this shit up in the studio (yeah)\nAll I want for my birthday is a big booty ho (true)\nAll I want for my birthday is a big booty ho (tell 'em)\nWhen I die, bury me inside the Gucci store (tell 'em)\nWhen I die, bury me inside the Louis store (true)\nAll I want for my birthday is a big booty ho (yeah)\nAll I want for my birthday is a big booty ho\n\n[Outro: 2 Chainz & Kanye West]\nDeuce and 'Ye\nWe like Snoop and Dre\nIsn't this your birthday, baby?\nYou deserve a coupe today, whoa!\nYou in first place, you in first place\nBad bitch contest, you in first place"}], "artist": "2 Chainz"}