{"songs": [{"image": "https://images.genius.com/3617c8ad676339bb832c6c1c31f91fb7.600x600x1.jpg", "title": "Affirmative Action", "album": "It Was Written", "year": "1996-07-02", "lyrics": "[Produced by Dave Atkinson & Trackmasters]\n\n[Intro: AZ]\nThis is what, this what they want, huh?\nThis is what it's all about?\nTime to take Affirmative Action, son\nThey just don't understand, you kna'mean?\nNiggas comin' sideways, thinkin' stuff is sweet, man\nNiggas don't understand the four devils\nLust, envy, hate, jealousy—wicked niggas, man\n\n[Verse 1: AZ]\nYo, sit back, relax, catch your contact\nSip your con-gi-ac\nAnd let's all wash this money through this laundromat\nSneak attack, the new cats in rap worth top dollar\nIn fact, touch mines and I'll react like a Rottweiler\nWho could relate? We play for high stakes at gunpoint\nCatch 'em and break\nUndress 'em, tie 'em with tape, no escape\nThe Corleone, fettuccine Capone\nRoam in your own zone\nOr get kidnapped and clapped in your dome\nWe got it sewn, The Firm art of war is unknown\nLower your tone, face it, homicide cases get thrown\nAristocrats, politickin' daily with diplomats\nSee me, I'm an official mack, Lex Coupe triple black\n\n[Verse 2: Cormega]\nCriminal thoughts in the blue Porsche\nMy destiny's to be the new boss\nThat nigga Paulie gotta die, he too soft\nThat nigga's dead on, a ki of heroin\nThey found his head on the couch with his dick in his mouth\nI put the hit out\nYo, the smoothest killer since Bugsy, bitches love me\nIn Queens where my drugs be, I wear Guess jeans and rugbies\nYo, my people from Medina, they will see ya when you re-up\nBring your heater, all your cream go between us\nReal shit, my Desert Eagle got an ill grip\nI chill with niggas that hit Dominican spots and steal bricks\nMy red beam made a dread scream and sprayed a fed team\nCorleone be turnin' niggas to fiends\nYukons and ninja black Lexus\n'Mega the pretty boy with mafia connections\nIt's The Firm, nigga, set it\n\n[Verse 3: Nas]\nYo, my mind is seein' through your design like Blind Fury\nI shine jewelry, sippin' on crushed grapes, we lust papes\nAnd push cakes inside the casket at Just wake\nIt's sickenin', he just finished biddin' upstate\nAnd now the projects is talkin' that somebody-gotta-die shit\nIt's logic, as long as it's nobody that's in my clique\nMy man Smoke know how to expand coke in Mr. Coffee\nFeds cost me two mill' to get the system off me\nLife's a bitch, but God forbid the bitch divorce me\nI'll be flooded with ice, so Hell fire can't scorch me\nCuban cigars, meetin' Foxy at Demars, movin' cars\nYour top papi Señor Escobar\n\n[Verse 4: Foxy Brown]\nIn the black Camaro, Firm deep\nAll my niggas hail the blackest sparrow\nWallabee's be the apparel\nThrough the darkest tunnel\nI got visions of multi millions in the biggest bundle\nIn the Lex pushed by my nigga Jungle\nE Money bags got Moët Chandon\nBundle of sixty-two\nThey ain't got a clue what we about to do\nMy whole team, we shittin' hard like Czar\nSosa, Foxy Brown, Cormega and Escobar\nI keep a fat marquess piece, laced in all the illest snake skin\nArmani sweaters, Carolina Herrera\nBe The Firm, baby, from BK to the Bridge, my nigga Wiz\nOperation Firm Biz, so what the deal is?\nI keep a phat jew-el, sippin' Cristy\nSittin' on top of fifty grand in the Nautica Van\nWe stay incogni' like all them thug niggas in Marcy\nThe gods, they praise Allah with visions of Gandhi\nBet it on my whole crew is Don Juan\nOn Cayman Island with a case of Cristal\nAnd Baba Shallah spoke\nNigga with them Cubans that snort coke\nRaw though, an ounce mixed with leak, that's pure though\nFlippin' the bigger picture\nThe bigger nigga with the cheddar was mad dripper\nHe had a fuckin' villa in Manilla\nWe got to flee to Panama, but wait, it's half-and-half\nKi's is one and two-fifth, so how we flip?\n32 grams raw, chop it in half, get 16\nDouble it times three, we got 48\nWhich mean a whole lot of cream\nDivide the profit by four\nSubtract it by eight, we back to 16\nNow add the other two that 'Mega bringin' through\nSo let's see, if we flip this other ki\nThen that's more for me, mad coke and mad leak\nPlus a five hundred cut in half is two-fifty\nNow triple that times three\nWe got three quarters of another ki\n\n[Outro: Foxy Brown]\nThe Firm, baby, Vol. 1"}], "artist": "Nas"}