{"songs": [{"lyrics": "[Verse 1]\nThe harvest appeared less plentiful than last season\nI imagine sloppy seed handling evoked a stroke of tardy planting\nAnd the crops we'd have harnessed mid-November\nHad only brushed the blossom bracket\nThen soon sacrificed lives to icicle jackets when the frost hit\nI sunk to find the warmth beneath the mosses\nWith a plan to tunnel past after the rains have run their courses\nBut alas, the portraits of these frostbit corpses tortured in the grass\nOffered this torch supporter one tall glass of nauseous\nAnd I'm asking you: Why's the spy supply hiding in strangers\nWhen they know atop the food chains I could spot biters for acres?\nNow be gracious, these minstrels turn a bully cycle civil\nBy dissolving the candy coated image down to the pixels\nThe upbringing of self-styled freedom brigade investors\nAnd their studies connecting one hit wonders with dust collectors\nPuts it down\nIt's down beneath your sappy sing-a-longs\nLet's take it further down, we'll let Dante decide which ring I'm on\nNova\nThe elders took positions and the fans marched\nParched, plain and steamed\nHawking the rain in my canteen\nNow I'm like point:\nI guess I could spare a splash for a couple of heads\nCounterpoint:\nDuring my famine I never got broke your bread\nWell, equation of intrigue, yes, yes\nLemme fence sit for a bit\nThese tense lips need soaking before I hand out tokens\nShut the fuck up\nDrama like kabuki with a heart of dirt\nSkull fucked cross bones hence my birth\nIt hurts\n\n[Hook]\nMust not sleep. Must warn others\nTrust blocks creep where the dust storm hovers\nI milk my habitat for almost everything I want\nSometimes I take it all and still can't fill this pitfall in my gut\nMust not sleep. Must warn others\nTrust blocks creep where the dust storm hovers\nI'm tryin' to walk on top of sunshine\nBut it's ridiculous at times. That's why I'm touring with this warning\n\n[Verse 2]\nCrowning the glory of our advance\nFire ants to water beetles\nThese Freemasons adjacent to pacing pins and needles\nPupil turned pedagogue, benediction to my dream\nBeaming a billion bottle rockets off the golden mezzanine\nCheck it\nI'll pluck the petals off a classic blood rose one at a time\nGripping the stem in the right; invite the thorns to dig up in my lifeline\nIt's a metaphor for nighttime\nAnti-up the slight cost of exhaustion\nTo salute the moon above paradise lost and you're a spectator, stringent\nInch by sacred inch shoveling coal into my earthworm soul\n(You should know!)\nBurrow up through the dirt with bloody digit\nLick my knuckles clean\nNoting the corporate clusters holding hands\n'round the abode of the damned\nNow what's your poison?\nStarlight in a maser with a nicotine chaser\nSip it clean, savor the taste to sit and dream later:\nThe eyelids pivot back upon the hinges\n20 miles across the glassy eyed window of wonders to passers by\nNow I'm 6 foot 4 with a 6-floor walk up just to recline\nWith no free time. The alarm storms at nine\nMy daytime's on some, 'Yes, sir. Ok, sir. Right away sir\nSir, do you mind if I breathe, sir?\nOh you do? Well excuse me, sir, fuck you.'\nI breathe slow\nI run in with these fantastic amalgams\nPainting casket-bound careers to peers gunning with classic albums\nSecurity's the javelin, catch it\nLabor\nClocked in in '76 and haven't clocked out ever since\n\n[Hook]\nMust not sleep. Must warn others\nTrust blocks creep where the dust storm hovers\nI milk my habitat for almost everything I want\nSometimes I take it all and still can't fill this pitfall in my gut\nMust not sleep. Must warn others\nTrust blocks creep where the dust storm hovers\nI'm tryin' to walk on top of sunshine\nBut it's ridiculous at times. That's why I'm touring with this warning\n\n[Outro]\nFeel it, it's like that", "title": "Commencement (at the Obedience Academy)", "album": "Float", "image": "https://i.genius.com/097177ea52f6ad0147914b68157107a588f47fb2?url=http%3A%2F%2Fwww.mushrecords.com%2Falbum_art_front%2FMH202_D.jpg", "year": "2000-09-05"}], "artist": "Aesop Rock"}