{"artist": "Bas", "songs": [{"lyrics": "[Verse 1]\nI’m looking at my receipt like \"Goddamn it, that’s my receipt?\"\nShe do it with no hands but damn it she wide receive\nSuper Mookin fiends, bitch, we the new elite\nLocally, overseas, been so well received\nThis is life like, 3 strikes of felonies\n3 times ahead of niggas, don’t know a better nigga\nI need a sweater with some SMF lettering\nA tour with 30 busses that my niggas go hammer in\nAnd we could through all the litigation, we ain't settling\nCallin' all the pots black, but we ain't kettling\nStanding at the door, won’t you let us in?\nKick it down, going places we ain't never been\nYou tryna find a torch and we just laugh at your misfortune\nStaring out the window ‘cause this life is in full motion\nMake a movie out the B roll, the action keep you focused\nFuck your token of appreciate, I need payment\nNothing say thanks like a whole bunch of O’s\nAnd some pretty little hoes when anything goes and\nI’mma shoot my shot if she open\nI said I’mma shoot my shot if she open\n\n[Verse 2]\nUh, I’ve been lookin' at you all damn night\nYou the cookie I’ve been lookin' for my whole damn life\nBitches early, this a long ass night\nShorty bust it and suck it and all that right, yeah\nShe was on that white all last night\nDid it off me, man she skied my pipe\nThat pedico make her need that diaper\nShittin' on the game, bitch I need that diaper\n\n[Verse 3]\nI’m afflicted, sick like flu though\nI’m the future like Pluto\nAll my niggas like kudos\nAll my bitches got culo\nYou can grab it and have it\nNever thirsty, I’m cool ho, she let me thrash it like Pujols\nUp at bat with a 2-0, elementary mathematics\nI need at least 2 hoes and give me at least 2 O’s\nThat’s 56 or 57, pending on your connect and how much that nigga respect it\nCause check it, to a fiend\nIt’s more than a gram, you understand?\nAin't enough snow in the sand, you understand?\nBitch don’t jump in the lake, it’s all sharks\nMy nigga, it’s money to be made, I want parts\n\n[Verse 4]\nI’m hard on hoes, call me the critic\nMy nigga call me up like, \"Bas they all could get it\"\nBut them bitches is beat, them hoes was hit\nDamn, the weatherman never know shit\nThe weatherman never know shit\nThe weatherman never know shit\nThe weatherman never know shit\nThe weatherman never know shit\nBitch", "image": "https://images.genius.com/e8444ffb238fbf0380d31f3b8d789020.500x500x1.jpg", "year": "2013-05-26", "title": "Pinball", "album": "Quarter Water Raised Me Vol. II"}]}