{"songs": [{"image": "https://images.genius.com/366878b883f76791456cd61fd70a9b6c.275x275x1.jpg", "lyrics": "[Hook]\nThey think that I'mma lose my mind out here\nAsk me where I think I'll be this time next year\nBut I don't care, I'm livin' it up, I'm livin' it up\nSaid I don't care, I'm livin' it up\n\n[Verse 1: Mac Miller]\nHey, they wonder where I'm gone be at, posted with my chief sack\nSeat back, keep this shit together like a knee cap\nHe's that, bad mothafucker with an attitude\nHaters tryin' to play him, I ain't even gettin' mad at you\nFruity Judy spittin', but he rappin' like kiwi\nI, receive better than your satellite T.V\nThree beat rhymes, that'll give 'em hebegebies\nHoes showin' titties, tryna to get a CD free\nPlease, grass stay together like its welted\nTurnin' down groupies, now they think I'm gettin' selfish\nI'm not cocky, I'm just confident\nWave you off, move along, if you not convinced\nGot way too much shit up on my shoppin' list\nWhile your broke, doin' choke, tryin' to copy Vince\nHop off the dick, let me be on my way\nI don't pay attention, stay havin' good days\nSo\n\n[Hook]\nThey think that I'mma lose my mind out here\nAsk me where I think I'll be this time next year\nBut I don't care, I'm livin' it up, I'm livin' it up\nSaid I don't care, I'm livin' it up\n\n[Verse 2: Mac Miller]\nHey, as I'm ridin' next to Tree J, speedin' down the freeway\nHeadin' to the money, no pause, no delay\nRacin' like a relay, hear me through the PA\nChief till I'm sleepin', fuck the D to the EA\nI'm in this game, no playin' for the pesos\nTry and dip into this cheese like queso\nClasses never seem to be there when they take role\nI was runnin' to my dream, tryna to make mo'\nMusic, make another song\nThey tell me they supported, they was hatin' all along\nLove greater than the hate that I was gettin' didn't phase me for a second\nSo lately I've been gettin' kinda crazy, and I mention\nTo my lady when she stressin' that I'm cakin', it's a blessin'\nI'm just tryna to get her in the right direction\nYou wanted war, then I'm comin' prepared\nMost Dope, put ya thumb in the air, mothafucker\n\n[Hook]\nThey think that I'mma lose my mind out here\nAsk me where I think I'll be this time next year\nBut I don't care, I'm livin' it up, I'm livin' it up\nSaid I don't care, I'm livin' it up\n\n[Outro]\n\"I think I'm having an overdose and so is my wife\"\n\"Overdose of what?\"\n\"Marijuana, I don't know if it had something in it, can you please send rescue?\"\n\"Did you guys have fever or anything?\"\n\"No I'm just, I think we're dying\"\n\"How much did you guys have?\"\n\"I don't know we made brownies...\"\n\"And I think we're dead, time is going by really really really really slow.\"", "year": null, "album": null, "title": "3rd Dimension"}], "artist": "Mac Miller"}