{"songs": [{"year": null, "image": "https://images.genius.com/d45c72b156862a65719161af952e83a1.300x300x1.png", "title": "Religion", "album": null, "lyrics": "[Intro: Big Syke]\n\n[Verse 1: Big Syke]\nNo suprise, the preacher got you paying tithes?\nDo you believe who you believe what he saying enlightens?\nDid Jesus rise? Days after his demise?\nYou’re the paralyzed, the term closed, the open eyes\nThey’ll may lie\nSo I ain't paying tithes no more\nEternal life is the prize, don’t cost dough\nSo the plate being passed around helping who?\nThe bills paid and the money made helping you?\nMr reverend, Mr preacher, Mr bible-teacher\nIs heaven a job the only way for god to reach you?\nSay preacher, say pastor, what you really after?\nIs it your goal to safe souls for the master?\nDizaster strikes like a thief in the night\nThe devil got us doing wrong what we think is right\nBut the light is in the scriptures that the prophets wrote\nThe false prophets will appear selling false hope\n\n[Hook: Big Syke & (?)]\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you even know? Yo' religion\n\n[Verse 2: Big Syke]\nJehovah witness, Polytheism and Buddhism\nThe Islamic, the Catholic and the Judhism\nHinduism, but wheres the wisdom in the scroll?\nThey translated so many times no one knows\nSouls lost, cuz Satan wanna challenge God\nThat’s crazy Satan got a name why don’t God?\nIs it Jahweh, Jehovah or Allah?\nDid they take it out the bible like Voila\nScholar’s writ that religion is all (?)\nBut it’s a mystery like the history of mankind\nAnd they giving out religion everywhere you look..\nJoseph Smith and his vision wrote the Mormon book\nIs your religion carrying to your lifestyle?\nYou asked for it or was it passed down as a child?\nHow in the world could you believe with no research\nSo the only place I’m going is a free church\n\n[Hook: Big Syke & (?)]\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you even know? Yo' religion\n\n[Verse 3: Big Syke]\nYou think it wasn’t Adam? You think it wasn’t Eve?\nDid you read that yourself or do you just believe?\nThe devil deceived, many say he don’t exist\nBut same inside of you if you prejedice\nCan you resist temptation, here’s the nation of the God\nThe devil trapped on the earth with a murder squad\nA fallen angel that choose to oppose the Lord\nSay you wasn’t believing nothing that they never saw\nSo some worship idols, for their soul’s survival\nSome of the priests only use pieces of the bible\nSome from the old text, some from the new text\nAnd there is even some that marry the same sex\nWe in the last days looking the evil men do\nThey say if the messiah was coming, he would’ve came through\nBut he giving the devil time to finish the crime\nSo I ain’t worried about your religon or were the Lord mind\n\n[Hook: Big Syke & (?)]\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you really even know? Yo' religion\nTell me do you even know? Yo' religion"}], "artist": "Big Syke"}