{"artist": "Problem", "songs": [{"album": null, "title": "#LitLife Freestyle", "image": "https://images.genius.com/b1712ac2b4d41fc2b06774510fca5ad3.900x900x1.jpg", "lyrics": "[Verse 1]\nHol' up, I got somethin' to say\nWouldn't none of this shit be goin' without Dre\nBut I'm the one to put his own records out\nWithout signing to a nigga from the east or the south\nBack with that bounce, the bullshit, the bull pit lit\nKillin' Cali, we're out here, where wolves get bit\nAsk around, bruh I'm kinda important\nMe and Game takin' shots with Khloe and Kourtney\nY'all ain't there cause y'all keep too many niggas around you\nGotta watch that shit, your own niggas'll down you\nYeah, left dead while your niggas surround you\nWith a unshot pistol that you bought for 'em\nMy car Nipsey Hussle with a hot lauren\nNew new, I see your new nigga, ex girl, boo boo\nNo toilet seat, ignorin' beef these days\nLet's talk this ball and Kenny Smith, EJ\n\n[Verse 2]\nI was mobbin' through the club\nMe and Nick off drugs\nSeen a rapper that don't like me\nStill he reach to give me hugs\nType of fuck shit is that?\nMan I swear you niggas coochie\nHarty at you niggas hoochie\nMan, them bandanas don't fool me\nSave that thuggin' for your mama\nShe the only one believe you\nCan't keep hidin' behind them lies\nBruh, I see you when I see you\nI got the money, I got the money\nDollar ain't shit, we set the bar\nIf you got the money, you got the money\nThen why you drivin' that nigga's car?\nYeah, why you wearin' that nigga's chain?\nWhy you fame made off that nigga's name?\nCause as soon as he don't want you to hang\nYou gon' be back suckin' my dick again\n\n[Verse 3]\nI got the proof\nI can make that pretty pussy shoot\nLike the thang aimin' at a hoop\nBaby, I'm the coach\nRich nigga smokin' 'til the roach\nCarbon bitches, y'all scared to approach\nI can admit, I'm quite intimidatin'\nI oversee your position, that's quite  an understatement\nGot 8 plus on these niggas so when I war\nSo tap it louder than that nigga that Kylie Jenner dated\nWhat, bet ya'll niggas gon' say that's a diss\nText comin', yo Prob, I reply, who this\nThem 3 dots pop up and then they go away\nGuess they upset the young king ain't got they number saved\n\n[Verse 4]\nMan, these niggas emotional as my son's mother\nJust like her they upset cause I don't love her\nAll I need is Nick, Luck, Bird, Louie and Fat\nWeez, DOG, Preez, we put the crew on the map\nYeah, go at that, I react like a zombie\nThe marijuana helpin' calm in, the demon inside me\nStill remember when I didn't have a pot to piss in\nWhen I was doin' it for the love and not the recognition\nMy buzz died and niggas couldn't get one favor\nNow I got the juice, and it just made out the fruits to my labor\nWhat, go ahead, pussies have assist\nYeah I forgive but best believe I will never forget\nMe and Wiz playin' pool, walkin' in like we brothers\nOverlookin' the city, knowin' no one's above us\nGame tradin', posse livin', that's what we be on\nLaughin' laughin' cause he check the boy for havin' Yeezys on\nIt's Sunday, Chaci might as well take him to church\nWritin' on my second story like I just finished the first\nDiamond lane, come celebrate this lithuation\nGot with Quik and it solidify my situation\nCause y'all don't believe in greatness until the masses say it\nOr until the Master say it\n\n[Verse 5]\nOn and off the court, shit\nMid 30's and I'm lookin' like I'm 25\nDon't put me in no combo with them lil niggas\nCause everythin' look real 'til the real arrive\nThey see us, get nervous, their bodies start twitchin'\nThen behind our back, tell our business to bitches\nAnd business to niggas that ain't got no business\nIn my business, for that is no no forgiveness\nAnd they know I'm with the shit, that's why they don't try me\nCause I done turn it up on everybody\nWhat, nigga west to the east, east, east\nOnly thing I turn down was a street\nWhat, put it in her deep, baby skeet when I squeeze a cheek\nFaithful as a preach, on G, man she had to cheat\nYeah, like she ain't study for a test\nProblem, most underrated out the west\nThat's the word, who had you niggas swallowin' pills?\nThey try to keep me out the loop cause I ain't signin' no deal\nNow 6 years later, yeah, I'm still right in they face\nWho else in LA got a hit without a feature from Drake? I'll wait", "year": "2016-08-10"}]}