{"songs": [{"image": "https://images.genius.com/b6b1954249340a8a91aa3595088a3bab.500x500x1.jpg", "title": "Hussla Hoodsta", "album": "Bullets Ain’t Got No Names Vol. 1", "year": "2008-09-26", "lyrics": "[News clips]\n- This is the time for us to come off of our knees and stand up to make a difference in our communities\n- I am not afraid of them, and I'm trying to instill in my neighbors, there's no need for us to be afraid\n- No matter what City Hall says and promises, people in this community, still very much intimidated by the Rolling 60s\nOne Rolling 60s hangout is just outside this grammar school, where parents are reluctant to go on camera talking about the gang or their fears of it\n- You walk down that street?\n- Nope, I don't\n- Why's that?\n- Um, well, it's too much activities going on down that street\n\n[Verse 1]\nLook, see, I was, born in the '80s and raised in the 60s\nMy pockets were full of 5s, shoe boxes were full of 50s\nSlauson, nigga, come on, follow and get with me\nSellin' dope for that Rolex chain and some fresh Dickies\nI was duckin' them choppers with burners in my stash box and\nSwallowin' rocks while runnin' from them CRASH cops\nNights, I kept it on my hip, the Johnny hot, shit\nNights I left it in my dresser, homies got chipped\nTo be kill or be killed, and I ain't talkin' poetry\nIf niggas ain't snitchin', then how the fuck they know it's me?\nCatch me breakin' nine zones down, nigga, that's a quarter ki\nAnd sellin' work to big homies, my older G's\nIn a luxury set, my chrome thang's gettin' blunted\nFuck it, I'm feeling good, I got two per set of hundred\nMoney was never nothin' 'cause these blocks was Rollin'\nAnd the spot stay poppin' 'cause my rocks was swollen\n\n[Chorus]\nYou know that I'm a hustla, so, you know\nI'ma always stay paid\nYou know that I'm a hoodsta, so, you know\nI never turn down a fade\nYou know that I'm a hustla hustla hustla\nYou know that I'm a hood, hood, hood\nYou know that I'm a hustla hustla hustla\nYou know that I'm hood, hood, hood, hood\n\n[Verse 2]\nGranny, they still shootin', I can't get no sleep\nAnd it's too late to change 'cause I'm in too deep\nNiggas gon' ride to the shit I'm sayin', that's on the real\nNiggas done died for this shit I'm claimin'\nFrom over here to Western Ave, yeah we run that\nHop out and bust a nigga head, yeah, I done that\nBut I ain't braggin', though, really, it's about capital\nAnd all this goddamn money gave me an attitude\nNo smiles like I'm mad at you\nLate night grindin', posted on the BG\nHood homies, the tiny loc and supreme team\nMeek Baby, Set Trip, if it's J. Stone\nFirst to bo, light that kush blunt for X gone\nThis for my nigga Tiny Inhead that's fresh home\nAnd Little Chopper facing life, homie, stay strong\nStay slow, baby, one shot and bolt the facts\nThe homies is here and Slauson where we posted at\n\n[Chorus]\nYou know that I'm a hustla, so, you know\nI'ma always stay paid\nYou know that I'm a hoodsta, so, you know\nI never turn down a fade\nYou know that I'm a hustla hustla hustla\nYou know that I'm a hood, hood, hood\nYou know that I'm a hustla hustla hustla\nYou know that I'm hood, hood, hood, hood"}], "artist": "Nipsey Hussle"}