{"songs": [{"year": "2010-12-13", "album": "Troubadour", "image": "https://images.genius.com/2d335571e608b43f30bd8a89e1fa6d38.1000x1000x1.jpg", "title": "Fatima", "lyrics": "[Verse 1]\nPicture the morning taste and devour\nWe rise early pace up the hour\nStreets is bustlin' hustlin' their heart out\nYou can't have the sweet with no sour\nSpices, herbs, the sweet scent of flower\nShe came out precisely the hour\nClouds disappear, the sun shows the power\nNo chance of a probable shower\nI fell in love with my neighbors' daughter\nI wanted to protect and support her\nNever mind I'm just 12 and a quarter\nI had dreams beyond our border\n\n[Hook 1]\nIs it true when they say all you need is just love? (Is it true?)\nWhat about those who I have loved?\nOnly to find that it's taken away\nAnd why do they say that the children have rights to be free? (To be free)\nWhat about those who I've known\nWhose memory still lives inside of me\n\n[Hook 2]\nFatima, what did the young man say, before he stole you away?\nOn that fateful day Fatima\nFatima, did he know your name or the plans we made?\nTo go to New York City, Fatima\n\n[Verse 2]\nAnd after school we studied the lessons\nI ask God to slow down the seconds\nHe does the opposite that's what I'm guessin'\nI better chill and count my own blessings\nFatima, Fatima what is the matter?\nHow come you ain't come up the ladder?\nSo we can be like there's no tomorrow\nDamn you gonna make me wait until tomorrow\nShe spoke Arabic and Swahili\nShe'd say \"Upendo anta habibi\"\nYou so bright, you shine like my TV\nThen one day she never came to meet me\n\n[Hook 1]\n[Hook 2] x2\n\n[Verse 3]\nIf beauty was in the eyes of beholder\nHow come everyone hushed when she walked by\nHow come girls would look just to scold her\nHow come the angel wanted to hold her?\nFatima, Fatima I'm in America\nI make rhymes and I make 'em delicate\nYou would have liked the parks in Connecticut\nYou would have said I'm working too hard again\nDamn you shooter, Damn you the building\nWhose walls hid the blood she was spillin'\nDamn you country so good at killin'\nDamn you feelin' for persevering\n\n[Hook 1]\n[Hook 2]x2\n\n[Outro]\nNow I just want to make it clear\nI don't want you to shed a tear\nCuz this here (Fatima) is a celebration\nWe're not mourning, we're celebrating\n(Fatima) Yeah\nSo baby don't cry\nPlease don't let the tears fall\n(Fatima) So don't cry"}], "artist": "K’naan"}