{"artist": "Wale", "songs": [{"title": "Clappers", "year": "2013-09-03", "lyrics": "[Intro:]\nDon't mind me baby, heh\nWe takin over summer\nYoung gettin it, haha\nLet's take it home, champ\nShawty got a big ole butt, oh yeeeeeeah\nShawty got a big ole butt, oh yeeeeeeah\nWooooooo, uh\n\n[Hook: Wale]\nClappers to the front, front, front, front\nClappers to the front, front, front, front\nShawty got a big ol' butt\nOh Yeah!!!\n\n[Verse 1: Wale]\nAy Wale! Wooooooo\nBounce, bounce, bounce, fool, I put the city on\nBounce, bounce, bounce, fool, then I put my niggas on\nBounce, bounce, bounce, fool, I ain't gotta say too much\nIt's fan participation keeping rainy in the stadium\nOoooh, rap fool, see that from a block away\nI ain't pessimistic but I dropped a couple not today\nBet she call you not today\nI told 'em all my lot is out\nI know the dame like Skylar team\nI wonder if she shot up\nI just know her favorite song is \"Started from the Bottom\"\nAnd I ain't hating mama, fact I wanna take your number\nSaid you save yo bread from Magic something happened then went voila\n\n[Hook: Wale]\nClappers to the front, front, front, front\nClappers to the front, front, front, front\nShawty got a big ol' butt\nOh Yeah!!!\n\n[Verse 2: Juicy J]\nShawty come shake that ass for me\nLet a trippy nigga see what you working with\nCan you clap that ass, do a handstand, girl\nMake your booty wiggle, do a perfect split\nShe got the fattest ass, she got the perfect tits\nI wanna get some head, come on work your lips\nI'm high in the clouds I'm not coming down\nI'm so turned up I can't find the ground (sippy)\nSippin' syrup by the gallon, smokin' kush by the pound\nMake it flood with the ones, broke bitch might drown\nJuicy got chips like Frito-Lay\nAnd I'm fucking these chicks out of D.O.A\nI'm so dopeboy fresh that you think that I'm selling blow\nTake your chick to VIP and get her pregnant in her throat\nShawty bust it open for me, I might throw this cash\nShawty throw that ass like a Hail Mary pass\nI'm fucking me a new chick every night\nMake that ass clap, I don't care about that cellulite\n\n[Hook: Wale]\nClappers to the front, front, front, front\nClappers to the front, front, front, front\nShawty got a big ol' butt\nOh Yeah!!!\n\n[Verse 3: Wale]\nClappers to the front, got a backwood full of skunk\nGot a white boy with the funnel gentrifying, that's whats up!\nLook, clappers to the front, all you niggas got the skumps\nNow she finna bust it loose, screaming rest in peace to Chuck\nIt's that DMV, we up at KOD\nAnd I can CC you these CC's\nBut don't be OC\n\n[Verse 4: Nicki Minaj]\nShout out to that cellulite\nGot a real bad bitch that will sell you white\nGot another bad bitch that will sex you right\nGot a couple hoodrats on Section 8\nMake a nigga cum, don’t procrastinate\nAss on 5-0 come crack the case\nGot ass for days, come activate\nThis ass on fire, evacuate\nThrow that ass in the air, evaporate\nWhere your money? Let a bitch evaluate\nIf you 'bout big money, elaborate\nI'mma shake this ass ‘till I graduate, nigga\n\n[Hook: Wale]\nClappers to the front, front, front, front\nClappers to the front, front, front, front\nShawty got a big ol' butt\nOh Yeah!!!\n\n[Outro]\nUh, bounce, bounce bounce bounce bounce bounce bounce\nYeah, yeah, uh, bounce bounce, look, look\nSayin rest in peace to Chuck, uh, yeah\nSayin rest in peace to Chuck, yeah uh-huh\nSayin rest in peace to Chuck, yeah, yeah\nAnd in that city I'm the one, let's go, Scotty\nE. Sreet, D. Sreet, Rosedale, Sursum Corda, Paradise, Carver Terrace, 1-5, Parkland, Garfield, Palmer Park, 2-5, Kentland, Benning Park, Simple City\nSimple City...", "album": "The Gifted", "image": "https://images.genius.com/acef12d38b074565d0f1cfe7667621e7.300x300x1.png"}]}