{"artist": "Fashawn", "songs": [{"year": "2009-09-09", "album": "The Antidote", "image": "https://images.genius.com/0c0448ad9b16fefb55596d9de67e6efd.500x500x1.jpg", "lyrics": "[Verse 1]\nOne time for the kids with no parents at home\nTwo times for single mothers raising ‘em on they own\nDaddy in jail, they already expected to fail\nGet locked, another story to tell\nWhere I come from, you either hustle or you starve, slang or play ball\nIf not, then get a job\nI hear a lot of brothers complain, but see, life is what you make it\nSo I hopped on a plane\nAnd followed my dreams, left the world that I knew\nFrom a bird’s’ eye view, I peeped it: all the shit I been through\nWould break the average man down but I’m still here\nI went from rhyming on the corner, turned it to a career\nI went from a group home to Michael Peretta’s house\nI’m thinkin’ ‘bout: What if I had taken the other route?\nI’d probably be another name on a wall\nOr a face on a shirt if I wasn’t lacing this verse\nBut who knows…this is my world\n\n[Chorus]\nIt’s your world…where are you?\nWould you share it…if it was cool?\n\n[Verse 2]\nYeah, maintain, persevere by any means\nIf you sleep, how you gonna live out your every dream?\nGame from an OG passed down to me\nSo I’m up when everybody in the town’s asleep\nStill tryna hold on and survivin’ peers\nToo many R.I.P.’s, empty bottles of beer\nSee, I come from a small town\nAnd, oh, you ain’t know, this is how we get down\nBurner in the pea coat, preferably Desert Eagles\nLet off and reload, get ready for the sequel\nIt happens every night, we from ‘round here, so we know\nNiggas hearts and half as big as they ego\nNo job so, how we ‘posed to provide the honest way?\nLook his son in his eyes, he need pay\nDespite the lack of funds, he tells him it’ll be okay\nThey cuttin’ off welfare any day\nWelcome to my world\n\n[Chorus]\nIt’s your world…where are you?\nWould you share it…if it was cool?\n\n[Outro dialogue]\nThis was, like, way before records were, I mean, even thought about being made\nThere was no such thing as a recording artist, rapper on a record, so to speak, you know\n(What do you have on now?)\nThis was a real popular record, you know, in its time\nAnd at this point here, it still is\nI would just try to, like, take it apart and put together again", "title": "What’s Your World"}]}