{"songs": [{"lyrics": "Uhh, yeah - today is Easter..\nSo what? Uhh, yeah\n\nWhen I rock the beat it sounds so incredible\nWhen I put it down it's so unforgettable\nShootin this gift is just so enjoyable\nTruth of the matter is so unavoidable\nRight over the track you can hear my flow\nBut watch, for the train, cause it doesn't move slow\nI like to gain mo', mental men blow\nI know by the symptoms, the system is malfunctioned\nBut, how can you function without any plan\nTo put it in your own hands - but I doubt it\nSee we was all put here, so you could put a foot here on my neck\nYou better bring a TEC/TECH-\n-nician cause permission was respect when I kick\nFor the mic check, and the almighty intellect\nSo let's take time to reflect, they haven't got me yet\nPlace your bets, rapps on deck\n\nWhen I rock the beat it sounds so incredible\nWhen I put it down it's so unforgettable\nShootin this gift is just so enjoyable\nTruth of the matter is so unavoidable\nMotherfuckers walk with they NOSE UP\nAnd they all-seeing third eye CLOSED UP\nAnd the green-eyed monster waitin IN THE CUT\nJust to FUCK 'EM UP, I know the streets gon' SUCK 'EM UP\nTurn on your television, check out the media\nAnd let it captivate you, follow the needier\nThere's no experience, in your interview\n30 words a minute, we won't be needin you!\nSo let your hustle guide, and don't you be afraid\nAnd if you come up sho't, that's how the game was played\nFirst it's Dr. Jekyll, and then it's Mr. Hyde\nIt was a groovy ride, now kiss yo' ass goodbye\nAnd you can make it through, and you can make away\nI'll keep on mockin you, until the break of day\nYeah, uhh - uhh yeah, rapps on deck\n\nWhen I rock the beat it sounds so incredible\nWhen I put it down it's so unforgettable\nTruth of the matter is so unavoidable\nShootin this gift is just so enjoyable\n\nUhh yeah, rapps on deck - rapps on deck\n... Happy Easter\nAlright cut it", "title": "Rapps on Deck", "album": "Hip Hop and the World We Live In", "image": "https://images.genius.com/dde48df06ccd165a12ed0bc40d9c736e.500x500x1.jpg", "year": null}], "artist": "Aceyalone"}