{"songs": [{"year": null, "title": "Going Back To Rehab", "image": "https://images.genius.com/cb391d97ea1e67f146589b798b0e7b0a.306x306x1.jpg", "lyrics": "I'm going there to give him cash, hear him laugh, bring him back\nIf I can't tear down these walls, I'll slip him through the crack\nIf that crack ain't big enough, I'm sick enough to get committed\nWhere he's been, I ain't been allowed to visit, and I miss him\nThey put me in a submission hold, got him living in a hole\nGive me the rope, pull it back, cut him slack--he's getting old\nThis cold does nothing for his bones... he's shaking\nAlways put on hold, that prison phone's always taken\nThey put me on a speaker but my voice is breaking up\nI'd like to think he caught bits and pieces before the gates got shut\nRaise it up!\nSomebody cover me, I'm going in, with razor cuts, and something ugly that I know within\nCan't afford the luxury of exposing everything, but I've been doing the best that I can. (that I can)\nI take it day by day, just one step at a time, and I don't need a sobriety test to walk the line\nWalking on this tightrope with arms open wide, hoping to find you live and well on the other side\nSo I could give you this gift as a symbol\nWhen I felt the rope loosen, I knew I missed my window\n\"He really did love you, you know\", pat, pat\nI said \"Get your fucking hand off my back\"\nThis is my passage into adulthood and I need not\nSmalltalk fingers fishing from a weak spot\nI used to dream a lot\nIn search of meaning in a sleepwalk\nThe only time I find myself having a deep talk\nAnd now I never sleep cause sleep is the cousin of debt\nOne can never rest depending on how up the drugs get\nUpset? Submit me to a blood test\nFind no trace of my words, reverting back to\n\"Wait, that wasn't what I meant\"\nMy right eye is sunrise, the left is sunset, the moonshine ain't got me drunk yet\nMy tongue's wet for the lunar eclipse, and when you're flat broke ain't nothing you won't do for a fix\nIt's a beautiful mix of Jesus-Juice on my lips\nAnd words that are stuck so I stirred 'em up with a crucifix\nAnd this is where I found a friend in Christ\nBut I also found a few spikes and I decided to use them as pegs on my bike\nSo you'd have a place to stand when I broke you out of that vice\nAnd now I'm going back to rehab. (going, going, back, back to rehab)\nI'm going back to rehab... (going, going, back, back to rehab)\nI'm going back to rehab... (going, going, back, back to rehab)\nI'm going back to rehab... (going, going, back, back to rehab)\n(going, going, back, back to rehab) (going, going, back, back to rehab)\n\nI'm going back as a Dead-Again Christian, with a medicine prescription\nYeah I'm a friend of Bill! Let-let-let me in!\nGet me outta this!\nHooked up to plugs and wires while the dogs sniff for a powdered substance\nIn a town of judgments with glass-house developments\nCookie-cutter Republican school-book intelligence\nThey ain't never considered how just one rock\nCould crack the whole facade, now they confiscate slingshots\nI will not meditate on the sermon\nHeaven's gate is burnin', so we self-medicate with bourbon\nWhile their collection plate gets turned into a purse\nI've turned into a second-rate person, but I'm not the first\nThis isn't your typical cry for help\nI tried to melt, but someone stopped the trickling with a Bible belt\nReminded me of tourniquets and heroin nods\nNow that, that right there, that's one hell of a God\nYou can't match magic with an addict that's got a mapping compass\nIn order to find a substance and matchstick that functions\nA searching and fearless immoral inventory\n'Til every person with a story begins to bore me\nI did what I had to do to get\nTo the place where your face wasn't such a blurry mess\nI packed all your favorite promises and words that we kept\nYou weren't hard to find, all it took was 13 steps\n\nAnd now I'm going back to rehab...\nI'm going back to rehab...\nI'm going back to rehab...\nI'm going back to rehab... I don't drink though\nI'm going there to give him cash, hear him laugh, bring him back\nIf I can't tear down these walls, I'll slip him through the crack\nIf that crack ain't big enough, I'm sick enough to get committed\nWhere he's been, I ain't been allowed to visit, and I miss him\nPut me in a submission hold, got him living in a hole\nGive me the rope, pull it back, cut him slack--he's getting old\nThis bitter cold does nothing for his brittle bones--he's shaking\nEternally put on hold, that prison phone's always taken\nPut me on a speaker but my voice is breaking up\nI'd like to think he caught bits and pieces before the gates got shut\nRaise it up!\nSomebody cover me, I'm going in, with razor cuts, and something ugly that I know within\nCan't afford the luxury of exposing everything, but I've been doing the best that I can\nI take it day by day, just one step at a time, and I don't need a sobriety test to walk the line", "album": "Human the Death Dance"}], "artist": "Sage Francis"}