{"artist": "ILL BILL", "songs": [{"title": "Chase Manhattan", "lyrics": "[Intro]\n{*people screaming*}\nOn the floor, now, NOW! Do it, do it\nOn the floor, now, NOW!\n\n[Raekwon]\nOh shit! It's on huh?\n(Aye yo sit your boney ass the fuck down)\n(We not fucking playing in here)\nThis is a stick up, nobody move, get on the floor\nGet on the walls, take your sneakers off, take off your drawers\nCover your dick, bitches be quiet, don't say shit\nYou move, I'mma make sure I clap you and your clique\nAll my gunnies is squeezing\nListen to me, before you die, just leave me my cheese\nI ain't playing, I'm spraying, off top, doors is locked\nFuck around, try to run around, you greasy\nDon't even dare, put your cell phone down, dear\nBefore I put my gun in your ear\nI'm not a New Jack, an Iker or a jerk with a pump\nI'm straight sober, I'mma feed my ratchet and hunt\nWe kill Willies, still hillbillies don't call us nothing else\nMight have to melt your Phillies\nYou old man, sit down, tie up his hands\nAnd yo, smack flames out him, get more and then blamp him\n\n[Interlude]\nDon't move! Don't fucking move!\nPut your hands in the air, put your hands in the air!\nGet 'em up!! Get on your knees!!\nGet on your knees!!\nGET ON YOUR KNEES!!\n\nGimme that fucking bag, man\nGimme that shit, you're my fucking wife, man\nGet the fuck out!\n\n[Ill Bill]\nThis bitch started blowing me in the safe\nHer fantasy to fuck a bank robber so I blew a load in her face\nI knew her from Canarsie, used to work at Chase Manhattan\nSmiled when I walked in waving the ratchet\nAn inside job, the best kind, the rest I rob\nStay on the ground or you'll be laid to rest by God\nI seen big face hundreds and bearer's bonds\nI also see cameras on, I'm glad I wore my ski mask camouflage\nListen to \"Lamb of God\" while I packed the bong\nWhile I studied how to disable a bank alarm\nWe got three minutes, handle the job\nI'm standing on top of the counter with the chopper barrel staring at y'all\nWhy you pussies bleeding all on my money?\nYou fucking up my hundreds\nDon't get your fucking head kicked on some dumb shit stupid\nWe the future of this bank robbing industry\nKidnap the judge and get a hundred years conspiracy\n\n[Outro]\nEverybody in the vault, get out, move!\n{*screaming*} On the floor, now, NOW, do it, do it\nOn the floor, now, NOW!\nLet's play a game Mr. President!\nIt's called spin the dial!", "image": "https://images.genius.com/166ebcd191e467f1f14c38dca418360f.500x499x1.jpg", "album": "Kill Devil Hills", "year": "2010-08-31"}]}