{"artist": "Cashisclay", "songs": [{"title": "Cashisclay vs Kayayin RapSparring Round 2", "album": null, "year": "2014-04-07", "image": "https://images.genius.com/b8be0f24882672d19d10b8cb8386b943.1000x1000x1.jpg", "lyrics": "(Intro:Cashisclay)\nDieser Kayayin hat Arme\nAber garnicht hart gepuncht\nDenn er nähert sich rhetorisch langsam Schwarznegger an\nDieser armselige Punk\n\nPart 1: Cashisclay\nIch ficke dich weg Kaya denn ich hab dich gebattlet\nWas hast du gemacht?\nScreenshots und der Welt erzählt dass mein Vater schwul ist? Krass\nIch sorg dafür dass jeder deiner Träume platzt\nDein Part ist schon gekontert weil mein Daddy eine Freundin hat\nIch war beim JBB und das soll eine Punchline sein?\nDas Löschen einer Seite ändert nichts an der Vergangenheit\nDu homophober Spast hast durchgehend den Flow verkackt\nEs tut mir Leid für dich dass du mit Mukke keine Kohle machst\nDer Jurastundent Kayayin macht im Battle auf Gangsterrapper - Straßensound\nDu willst Erfolg ??? dann zieh doch ne Maske auf du arme Sau\nWärst gerne Freunde von Niemand indem du behauptest so real und echt zu sein\nUnd definierst gleichzeitig deinen Erfolg an vom VBT stammenden Facebook Likes\nFettes Teil, doch dir fehlen Technik und Skill\nFrag dich doch selber warum kein Label dich will\nUnd dein ausgedachter Realtalk ist lange noch kein Gegnerbezug\nAch Kaya sag mal kennst du noch diesen Kex zu dem Kuhl?\n\n(Hook 1: Kex Kuhl)\nDennis Kaya was für ein lächerlicher Spast\nWieso rappst du noch, hast wohl das Semester nicht gepackt\nNein ich front dich nicht ich hatte meinen Spaß\nUnd bin nur dabei dass Tim nochmal sagt ???\nFür ein deja-vu\nDennis ist schon ätzend und schwach\nWenn mans in keinem der Turniere übers 16-tel schafft\nNenn es Zufall oder Pech\nUnd wenns im nächstem Jahr mit Comedy nicht klappt dann versuchs doch mal mit Rap\n\nPart 2: Cashisclay\nEy jetzt mal ernsthaft was soll ich bitte kontern bei dem?\nDu hast Recht manchmal rauch ich eine Sonntags um zehn\nManchmal lieg ich da auch voll verkatert noch in meiner Kotze\nMir egal nach dem aufstehn erstmal Konter Bier\nUnd das dein Realtalk erfunden ist\nDenkste echt die kriegen das nicht mit?\nWas für disrespect? wer hat hier Familie gedisst?\nEin Rapper der dein Takt nicht trifft, keiner deiner Punchlines sitzt\nBlamage denn du wirst rausgekickt von nem Typ der keine 20 ist\nKaya wittert meine Fotze aber selber hat er Männertitten\nIch schicke dich hier schon in Runde 1 auf die Bretter sowie damals Cassius Listen\nIch hab dich einmal erwähnt und ja finds lustig wie genervt du bist\nUnd mich danach gedisst also sag mir mal bitte warums da was zu klären gibt?\nIch glaube würd keiner mich kennen dann hätts dich garnicht interessiert\nAber wir beide wissen was war und wer am Ende davon profitiert\nFreu dich du Affe ich schick toys auf die matte\nUnd Liquid Walker bleibt der einzige Deutschrap Kanacke\n\n(Hook 1: Kex Kuhl)\n\nPart 3: Cashisclay\nIch blende meine Kinderfans in dieser Runde wieder nur mit Doubletime, krasser Scheiß\nDu dagegen rappst deinen Part in 20 pbm durchgehend langsam ein\nUnd dadurch schaffst du es nicht jeder deiner Hammerzeilen am Takt vorbeizuspitten\nDu bist so langweilig monoton warst du mit meiner Mama einen kiffen?\nKayayin das wars für dich, Nutte, was für Gelbsucht?\nDein Hauttyp ist Solarium, Akne und Abdeckstift\nIch cutte jede kleine Line aber manche echt damits geiler klingt\nAber spiel sie jedes Wochenende fehlerlos beim liveauftritt\nDu bist voll das One-Take Monster, geil das kommt live wirklich gut\nAber was bringt dir das wenn keiner dich bucht?\nUnd keiner kommt, wenn doch yeah\nIch bin in Bestform und ich fick das Turnier\nDu hast 2 jungs die in jeden deiner Clips den Dicken markiern\nUnd auf Autos hocken kreativ\nDann noch meine Mutter dissen und am nächsten Tag mit Seitenscheitel in der Uni sitzen\nIch schmeiße trotz dem Bitchmoves meinen Gegner raus\nUnd Ahmed schlägt dir jeden deiner frischgeputzten Zähne raus\n\n(Hook 2: Ahmed)\nKayayin spann mal deine Muskel an du Einzelkämpfer\nZeig uns wie du posen kannst du schwuchteliger kleiner Penner\nNimm mein Namen aus dem Mund versuch dich mal als tighter Rapper\nJBB, dreimal VBT und wurdest keinmal besser\nEr brauchte 2 Jahre um endlich mal den Takt zu treffen\nHab ich nicht genug zu tun als diesen dummen Spast zu plätten?\nLyrische Pumpgun die auf deine DNA zielt\nCashisclay fick dich weiter Ich geh GTA spieln"}]}