{"artist": "Phora", "songs": [{"album": "Yours Truly Forever", "title": "R U Still", "image": "https://images.genius.com/a07e15059a7a78735b1060a991ca6b0a.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYeah, look\nPops told me this life is way too short for you not to live in the moment\nMade a few mistakes in my time, but I'm still growin'\nEmbracin' all these feelings these people are scared of showin'\nI'm showin' you all my pain in my story, the book is open\nIt's real\nEvery chapter in my life is a lesson\nBut the girl I gave my heart to, we've been losin' connection\nShe ain't realize that she was a blessing\nWe just lost in a world, driftin' apart, we never had no direction\nSee, I'm losin' all my patience lately, I've been tryna pray more\nShe said, \"You always leave when I need you, I wish you'd stay more.\"\nDyin' to feel alive, you holdin' on to your pride\nI used to be the one you'd run to, what you walkin' away for?\nLook, why can't we just be real with each other?\nInstead of hatin' each other, let's start healin' each other\nAre we really scared of love or just scared that we'll never find it?\nI need you, and I'm done tryna hide it\nSo r u still—\n\n[Hook]\nR u still down for me?\nR u still down for me?\nR u still down for me?\nR u still down for me?\nOh yeah\nR u still down for me?\nR u still down for me?\nR u still down for me?\nR u still down for me?\nOh yeah\nR u still down for me?\n\nR u still down for me?\nR u still down for me?\n\n[Outro]\nWe all need someone to talk to\nDealin' with the pressure of the world, all the shit we had to go through\nShe livin' life in the fast lane, in the fast lane tryna roll through\nAye, we all feel low sometimes, we all need someone to talk to\nYeah, we all feel low sometimes, we all need someone to talk to\nDealin' with the pressure of the world, all the shit we had to go through\nShe livin' life in the fast lane, in the fast lane tryna roll through\nAye, we all feel low sometimes, we all need someone to talk to\nYeah, we all feel low sometimes", "year": "2017-08-18"}]}