{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/4fb504d5b4dda8a236c224bb1cc11e2a.800x800x1.jpg", "title": "Cudi Get", "year": "2008-07-17", "album": "A Kid Named Cudi", "lyrics": "[Chorus]\nC'mon feel the noise\nGirls grab the boys\nGet wild, wild, wild\nC'mon feel the noise\nGirls grab the boys\nGet wild, wild, wild\n\n[Verse 1]\nStep it up, let your neck snap back\nUh, saddle up baby-girl put your hair back\nHurry up, barkeep, keep the brew coming\nTryna drank 'til my back start slumping\nLike old man, live by them old rules\nFought all the steps in front of the old fools\nGot me nowhere, nigga, it's a different time\nFuck '08, niggas thinking '09\nI take a look behind, niggas can't form a line\nLike Kindergarten waitin' for the water fountain\nStandin' up, said, arms crossed, poutin'\nScott Mescudi, boy they was doubtin' him\nAnd 'til they Googled me and found that Imeem\nThey love a dooder, they love me I mean\nI can't believe how I had a dream of Martin King\nBut they ain't takin' me out on no balcony\n\n[Chorus]\nC'mon feel the noise\nGirls grab the boys\nGet wild, wild, wild\nC'mon feel the noise\nGirls grab the boys\nGet wild, wild, wild\n\n[Verse 2]\nStand up, put your arms to the ceiling man\nShow skin, baby-girl, yeah I'm a fan\nWon't do you wrong, like a pushover\nSee my Cutty ridin' through, better pull over\nLike I got blue, red lights shining 'round\nBut if I see the man, slowly put the cup down\n\"How you doin' Officer? Nice mustache\"\nDunkin Donut eatin' muthafuckas hatin', damn\nI get my speed-racer on\nPlayin' Ray Cash, get my Cleveland city on\nBrooklyn to Cali, jet-lagged and all\nThere's still enough time to hit the mall\nShit, one wish when I'm deceased\nBury me in 501's and 10 Deep\nAnd please keep the Bapes on the feet\nSo I can watch the devil ice-grill me\nHaha, yeah, how you like a nigga now?\nI'm it like the clown\nAnd Cudi get (Wild wild wild)\n\n[Outro]\nI get (Wild wild wild)\nYeah, one, uh\nBack, back up in the mix like that\nHow y'all feel? How y'all feel?\nY'all a'ight? That's right\nAnd it's like that Plain-Pat, holla at me, man\nYeah!\nOkay that's the end of my Slade song"}]}