{"songs": [{"image": "https://images.genius.com/0e1f124f48c2edf75255aa6292bdf2b5.600x600x1.jpg", "title": "F.U.B.A.R.", "album": "Die!", "year": null, "lyrics": "[Intro]\n\n- That’s later version of getting F.U.B.A.R\n\n- What’s F.U.B.A.R?\n\n- Fucked Up Beyond All Recognition\n\n[Verse 1]\nCheck it, Check it. Uhh, uhh. yo\nI’m like Schwarzkopf with a sawed-off merkin’ serplekle Berkowitz walk\nCut your hands off, now go jerk off you faggot molested, maggot infested\nShot wit a magnum, stabbed in the abdomen, intestines, body bag, next contestant!\nThe hostage- take, nostril breaker, blood loss got you nauseous, shaking\nGet destroyed like the Pink Floyd sausage maker in a larvae bed\nFaster than tarvol wit a blade carving up heads, machete\nYou’re fading to shreds like barber on meds\nYour cunt’s gun injected, your torso’s disconnected\nBitch my erection is in your pelvis section unprotected\nSpasms and seizures cut the protoplasm on your face, jet like motor razor\nNo photograph of me, the code of assassins, get yo specs gouged, blast off Tecs at yo house\nMy trigger finger’s sexually aroused, gettin’ busy wreck your division\nLike a prison, neck incision, you’re getting fucked up bitch beyond all recognition\n\n[Chorus]\nYou F.U.B.A.R! Scarred wit a gemstar, pa, you F.U.B.A.R!\nHit wit a metal bat in your car, you F.U.B.A.R!\nYou should’ve thought before you sparred, you fucked up beyond all recognition!\nFucked up beyond all recognition!\nFucked up beyond all recognition! what?!\nFucked up beyond all recognition! say it! fucked up!\n\n[Verse 2]\nYou couldn’t hurt a mouse, yet you tried to front on my cause\nJust because other word of mouth is I’ll punch you in yours\nMy get down’s viral, you’re a coward on a downward spiral of ground gyro\nA pyromaniac, burn down your firewall, shit on your pride, you should commit suicide\nI just might come to your hood and let bullets rip through the side of your eye\nYou’ll never be shit, you on some police shit\nI should unleash pits on you and let them eat your flesh, please bitch!\nStick that gun up your ass and see if it fits\nYou don’t know who you fucking with, bite me, you DIE! get left stiffin’ and sticks\nDon’t need to feel liquored so I could pull triggers\nMy hands skill’s bigger, I leave your whole fucking grill disfigured\nLooking ill after i jigged it, real despicably wicked, like gigabod sick of God kick the bucket like pickit\nFuck it you bitch better suck it and lick it or I’ll leave an icepick stuck in your head\nCut off your dick and feed you it\n\n[Chorus]"}], "artist": "Necro"}