{"artist": "C-Rayz Walz", "songs": [{"title": "Seal Killa", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Hook One: Malcolm Bix] (x3)\nMy mother kill seal\n\n[Verse 1: C-Rayz Walz]\nWhy do your bombs fall down from my sky?\nWhy, seal killer?  Why, motherfucker, why?\nI want an answer for cancer.  The plague was AIDS\nHepatitis B, ultraviolet death rays\nInsect sprays.  Bugs in your house, slugs route\nHate in your blood, fake love in your mouth\nRecycle paper, burn trees, catch the vapors\nOr the zap’s on low—smoke most space invaders\nIn a cloak and dagger, rape paradise—broken ladder\nStolen laughter, omen scatter, choke and stagger\nRunning like rōnins zoning.  Save your breath\nThe truth hurts—$7 a box—pay for death\nWith so much shame and anguish, it ain’t strange\nFrames my language.  Painkiller skiller stretch rap famous\nBetween jail and ginseng, rap and rape\nKeep jamming with secret shaman slamming gates\nBlame the monkey, frame a junky, shame the country\nHomeless bastard—I’m afraid we funky\nIgnorance is the first form of comedy\nThe others form of slattery—negativity’s anatomy\nPositively think we gotta crawl with ya songs\nI’m gone—antigravity!\nLost your marbles—had to find your scruple\n“Too much teachers, not enough pupils!”  My comments futile\nEverything I trust in has been crushed and killed\nNow I believe in dirt, disgusting filth\nRide the spice with inspire to write\n‘Cause in the end, the ribs won’t describe your life (Nope)\nAnd the chain won’t confide your wife or school your kids, right?\nHard to put jewels in your wigs\nIt’s nothing to put the tool to your ribs\n\n[Hook One: Malcolm Bix] (x3)\nMy mother kill seal\n\n[Hook Two: 4th Pyramid]\nSeal killer.  We’re iller\nFeel thriller.  Seal killer\nSeal killer.  We’re iller\nReal thriller.  Seal killer\n\n[Bridge: C-Rayz Walz and Malcolm Bix]\nThe dream gotta go?  Then we gotta go and if the\nPlants gotta go?  Then we gotta go and if the\nWater gotta go?  Then we gotta go and if the\nSeals gotta go?  Then you know we gotta go\n\n[Verse 2: 4th Pyramid]\nDon’t ignore this.  Pissing on portraits\nWith more hits, it’s morbid.  Cheers to that\nBeers and rap.  Waiting for the day\nThe owner of Sears is black (Yes, yes)\nMere mortals fearing cats.  Governments steering traps\nWho to trust?  Talk shit, you a butt\nGot a gat?  You soon to bust\nThe lot of ya consumer sluts don’t give a fuck\nWho discuss and choose the Lord?\nActing rude and stuff—you know the rudish bluff\nBeat the dick, get some dough, treat the chick\nSome dro leaves to lip.  Get off that fiendish shit\nBreathing sick.  Recite daily, “I believe I live”\nAmongst the wheels, wheels, and record deals\nThe dead earth squeals\n‘Cause it can’t get her seals—the leopard steals\nSkin to live.  Whirlwind life\nSpin and give.  Pollute world, kill the kids\nSkin the pigs.  Dolla dolla bill\nThis is it.  Pop another bottle if you feel this shit\n\n[Hook One: Malcolm Bix] (x3)\nMy mother kill seal\n\n[Hook Two: 4th Pyramid]\nSeal killer.  Feel iller\nReal thriller.  Kill killer\nSeal killer.  Real thriller\nFeel iller.  Kill killer\n\n[Outro: C-Rayz Walz and 4th Pyramid]\n[C-Rayz Walz]\nAtomic.  So radioactive\nWhen you touch me, you vomit\nAtomic.  So radioactive\nWhen you touch me, you vomit\n[4th Pyramid]\nHigher and dumb today\nRobbing for funds—I’m crazed (Crazed, crazed)"}]}