{"songs": [{"album": "Trouble Man: Heavy Is the Head", "image": "https://images.genius.com/6c270013a37f81fa5c7f0606f8824d12.300x300x1.png", "year": "2012-12-18", "title": "Addresses", "lyrics": "Ay\nAy Ay\n\n[Hook]\nAy everything ain't what it seem\nRide dirty when I'm clean\nBest check that disrespect unless you want it with the king\nPut a address on that shit, who you talm 'bout? What you mean?\nWanna see me in the street, better bring some extra magazine\nAll that flexin and that poppin you be doin' for them hoes\nI would run up with that choppa give it to you and them hoes\nI for sure stunt, keep that dough coming\nMan them suckas talkin' tough but trust me, they ain't on nothin'\nGo!\n\n[Verse 1]\nAye listen to me brah, don't bring that bullshit to me brah\nAin't no back and forth my nigga fuck with me, I'm torchin' niggas\nDon't go to war unless your money right, room full of money\nHundreds not a 1 in sight, right\nAye look I can't afford a gun fight, but I can afford a one life\nAll of that sucka shit, you broke and now you so upset\nAll that shit you kick around the city, get you no respect\nI know a rap beef what you want, that shit I peeped then\nYou such a gangsta get some money out the street then\nBeen in in the game 11 years, if I was such a ho\nNigga I done been exposed 10 years ago\nNever been robbed, never got my chain took\nNever even been hit in my face, you don't believe look!\nIf people lookin' at me back when I was trigger happy\nThere wasn't no shoutin' matches I just got to gettin' at em'\n\n[Hook]\nAye everything ain't what it seem\nRide dirty when I'm clean\nBest check that disrespect unless you want it with the king\nPut a address on that shit, who you talm 'bout? What you mean?\nWanna see me in the street, better bring some extra magazine\nAll that flexin and that poppin you be doin' for them hoes\nI would run up with that choppa give it to you and them hoes\nI for sure stunt, keep that dough coming\nMan them suckas talkin' tough but trust me, they ain't on nothin'\nGo!\n\n[Verse 2]\nI swear to God another day another fuck nigga\nThat's why I just get that paper and be like Fuck niggas\nSucka nigga, you were tough but now you done some\nI'm done talkin' push you gun wanna run some\nHate to turn yo TV on every week and see my family hustle\nAnd everbody in yo street just see your family struggle\nWhat happened brah, guess your connect just be like fuck'em dog\nNo money when I see you I see none at all\nThat cheque I'm chasin' after never mind them hater rapper\nMake they situation sticky like a now-and-later wrapper\nBeen fuckin' city's up, this shit ain't shit to us\nKeep on, I show these folks on tape how you a sittin' duck\n\n[Hook]\nAye everything ain't what it seem\nRide dirty when I'm clean\nBet y'ain't go'n disrespect unless you want it with the king\nPut a address on that shit, who he talkin' 'bout? What you mean?\nWanna see me in the street, better bring some extra magazine\nAll that flexin and that poppin you be doin' for the hoes\nI would run up with them choppa give it to you and them hoes\nI for sure stunt, keep that dough coming\nMan them suckas talkin trouble to me, I ain't know nothin'\nGo!"}], "artist": "T.I."}