{"artist": "ProfJam", "songs": [{"album": "Mixtakes", "title": "Malang Kalam", "image": "https://images.genius.com/ac43427e0930880bed1cbdb2bb1736f9.600x600x1.jpg", "lyrics": "[Verso 1: Profjam]\nLivin’ a dream, da vinha vem o meu vinho, a origem eu acarinho\nA virgem traça o destino, eu sirvo a quem eu consigo\nEgoísmo vem ao cimo\nSó quero tirar o meu sino, pastar num campo bonito\nPorque se continuo aqui vou perder o meu caminho\nEsqueci de falar com o meu pai e ele vive sozinho\nÉ estranho onde eu caminho, talvez para lá caminhe\nUma vida isolada, gasta no meu pergaminho\nSou mais um pintainho, casca quebra c'o focinho...\n‘tás ca quebra? fumo sim, tiro o cachimbo ao Saci\nE fujo dele ao pé coxinho… dread lê o meu carimbo\nVelho leu e disse assim man, sem papas na língua:\n'este puto sabe'\n'este puto sabe'\n'este puto sabe'\n'este puto sabe’\n\nDread, é rap até à cova, set à Sharapova\nNão tenho cap da moda mas dou te rap com uma nota\nPorque o meu rap é coca que te come o caco\nVira o saco…. cozinho boa droga boy no meu buraco\nDealo o meu crack com o teu clique\nMas tem cuidado pa' não te dar o cafrique\nSou um freak, mal saio à rua\nQueria bazar e aterrar na lua\nTripo até tarde apesar da madruga\nLimpo o meu lar, é cá dentro que Ele actua…\nÉ cá dentro que Ele actua…\nÉ cá dentro que Ele actua…\n\n24 anos passam num instante, cavaleiro andante\nPor cada ano uma hora - nem me lembro do lanche!\nOuvindo um grunge vindo dos grandes\nAtinjo um nirvana que nunca atingi antes\nContagiante, energia gigante\nDispo o meu manto, vejo o espírito santo\nE cada drum leva me a Malang Kalam\nE eu abanco supertramp sem breakfast americano\nDread emano luz tipo lâmpadam\nE atraio outros como tu como um mano íman imãm...\nDa teta do money mamo, sem cheta nao dá pa viver tipo que virou sangue… (blood money)\nBebo e fico drunk mas protejo o meu ser desse líquido viciante…\nMas manda vir bastante que aqui ‘tá fodido sobreviver sem guito no banco…\n\nMãos no volante, pé no pedal, tudo fará sentido na recta final\nSei onde encostar caso algo corra mal, já vou preparado po juízo final\nTenho que gostar de mim, gostar de mim, aprender aqui a gostar de mim\nEncostado a mim, apoiado em mim, aceitar o yin e abraçar o fim!\n\n[Outro]\nYeh\nMixtakes\nDo UK para o mundo\n[That's what's up?]\nLove yourselves\nLove everybody else\n[?] and pray", "year": "2016-04-01"}]}