{"songs": [{"lyrics": "Four rooms, a ceiling and a floor but there's more:\n(close to insanity)\nA desk with a subtle light, a window, and a door;\n(close to insanity)\nOne bottle of the bluest inks your iris ever saw;\n(close to insanity)\nOne child prodigy with a vision in his core\n(close to insanity)\n\n[Verse I]\n\n(yeah, yo)\nI'm frost bitten, slippin' away in titanic burden nurses\nWhere the anti-hero clergy purge their value burning service\nAnd warped was I, huddled beneath the influence of fresh\nMeshed with impressions that appear to shrink before my very breath. (Breath)\nThese tides of woe and malice and mirth initiate a wave crash\nSplashing my offspring graves prior to birth, it's looking bleak\nMalarky farce sergeant crooked and sleek emerald eyes glow;\nI'm shook in a freak side show!\nOK, I strobe effects projective when I blink\nSo I design this chorus line\nWhen linked we let our eyelids fall and pilots stall\nWith what I sing, I'll open lash light and dark clash to dim the wattage\nThen see the wide-eyed dried raisin supplied fiery Colossus\nWell, I am a hostage. Guiding, yet, pushed beneath the craze's climate\nHiding behind the levy while the stubborn rivers rise and feel this\nI wish heavenly brevity centered hate pedigrees instead of dead serenity\nGod damn. Must have remembered me\nIt clinched me, it wrenched me, tempted me to employ it\nApprehended me, and rendered me suspended in its voyage\nHow these tables have turned!\nHand to the bottle with the skull and crossbones scribbled off the label\nSip the ladle. Drank the burn. Begging for dead!\nConcerns off with a zephyr tread and leg in a web\nCaught triple-six couriers; beckon, they fled\nOK, OK, I get it...\nLet 'em shake a little, then release 'em\nLike, as if ghostly hysterics would leech on band aid completion\nOdium, patience ran his anti-death commando\nJust a litigant stretchin' to touch tranquil\nBut couldn't quite catch the angle\nI'm trained as cornerstone famine trooper\nSo my tray within a heart of hearts still belly up and parched, come on...\n\n(yeah, yeah, check it)\n\nI'm a sideline observer alerted not yet retreating\n(close to insanity)\nThe climate stubbornly hovered slightly above freezing\n(close to insanity)\nNow everybody in the populace awaited my reply:\n(close to insanity)\nI spit a billion tiny brilliant white lights into the sky\n(close to insanity)\n\n[Verse II-IV]\n\nUndeniably amused by the way the fuse burn\nBy the way the clues churn in front of my eyes...\nTo fertilize germination of concern for me, for we\nFor he who's sucked into the trench, fully dug\nI don't wanna pull the plug...\nHug on my canteen like in a dream\nCentipede leader speedin' through a meaty greed league\nI can tell by the way the needs bleed from a seed\nIf the breed should have ever been bred. 'Nuff said...\n\nWhether compared to caterpillar and cocoon\nTo emerge, or a spark's soon to bloom to a surge\nAll I need is the nourishment, the courage and the burn\nTo ascend from a number, to brave Blade Runner\nHunter, cleric, swordsman, king...\nMore like I'm walking with a broken mood ring\nMood swingin' from the mezzanine level\nHere to bevel the edge\nMy team's settled on the ledge to pledge\nIt's like that\n\nIn the summer it rains buckets of hunger pains\nIn the winter it's the same, with an added climate change\nThe remaining two quadrants balance the polar values equally for mid-range\nYet the songs of thirst remain the same\nYou could turn the whole cold reservoir to liquor\nHell, split the ocean on its seams if it boosts your esteem\nI never lend span of attention lest my brethren signal fresh\nSo do your magic, miracle worker, or I'll remain unimpressed\nFor the flux, the fix, the famine\nFor the fact that little Billy up the block obtained a lovely hand cannon\nI'd examined auto-pilot (right) when filibuster won... (yeah)\nConcluded the few we're tuned with were now targets of his movement... (oh shit)\nIt's intriguing. Yet, I guess, I knew somewhere, something was leaking\nNow I honor instinct, delinquent\nBring settler runaways, frayed boogie bastard clicks\nTo bypass glass stature, walking graft characters...\nMilitant dance split the sun and sip the filament...\nTracer. Vivisection is to lab rat primes;\nThey try to grace these sacred lips with his maze or a dirty wine\nHe knew. He brewed the substance just to mock the lesser budgets\nThen sought off all trickery, bought off the public, and screamed victory!\nTunnel through the mite infested grillage and the rig\nAs fast as Aesop and his ten little fatigued fingers could dig\nTrigger revenge, tip the goblet in the dirt, review my words\nSpit in the puddle. Peace to fame, struggle the fuck out, and duck out\n\n(yeah, check, huh, uh)\n\nNow, all hail defenders of the trash talk\n(close to insanity)\nI was hidden, yet I slid in just to rip the mask off\n(close to insanity)\nI'm seventy-six inches of all the purest sounds\n(close to insanity)\nSo y'all could dig me six feet deep my eyes would still be over ground!\n(close to insanity)\n\n(It's like that)", "title": "The Substance", "album": "Music for Earthworms", "image": "https://images.genius.com/355a2e1156bc79b1e8d0997024f4cc06.300x302x1.jpg", "year": null}], "artist": "Aesop Rock"}