{"songs": [{"year": "2019-07-08", "album": "I.C.a.B.S.", "image": "https://images.genius.com/223cb1288fedb4f41d9c1f909207de02.1000x1000x1.jpg", "title": "Deadline", "lyrics": "[Verse 1]\nWe yellin' \"9-1-1\", the paramedics ensue\nSo in this game of fake news, nigga, we know what's the truth\nCan't be misled by false prophets out here singin' the blues\nNo Billie Holidays, just modern day meteoric moves\nStuck in the groove, you choose, cruise, eventually lose\nYour point in shambles from the gambles\nSo what the fuck can you do?\nBumps and bruise's hard to handle when you built like you\nThis simple shit got niggas shook\nGot them lost and aloof\nYou could have been better\nYou could have been humble\nYou could have been smarter\nYou could have been quicker, ya bastard\nCouple of screws loose, they fell out of your picnic basket\nTell me what you do to hide the pain, I know that you mask it\nNigga would you move the way you do if you knew the truth?\n\n[Chorus]\nI pray to my God\nCan we survive?\nWhat will we do when the tides rise?\nHow can we prosper?\nHow can you see through them blind eyes?\nCNN, Fox News, sellin' all lies\nHistory repeats, these feelings like the end times\nNiggas die, shot down on the front lines\nThe prophecies bein' fulfilled as I speak now\nBefore the clock strikes twelve, hope I get mine\nPray I didn't miss the deadline\n\n[Verse 2]\nWake the fuck up, and get on your shit\nYeah, you could throw the fuckin' towel in and call this shit quits\nIt's obvious, it's in your face, how the fuck you not convinced?\nOnly so much empathy in me, I'm out of it, I'm spent\nSo go on down the dead-end like all the novices did\nSupplyin' a feelin' that's unknown, yeah, it's too real for the kids\nSo right before the bomb blows, bitch, I give you a kiss\nBein' aware is a burden, and bitch, I carry this shit\nY'all niggas awkward with y'all shit, shoot like Shawn Marion did\nJust pay attention when you step, it could be treacherous, shit\n'Cause it could be any moment, any time, my nigga, you dig?\nYour standards of livin' lowered\nLo and behold, we know what it is, eh, eh\n\n[Chorus]\nI pray to my God\nCan we survive?\nWhat will we do when the tides rise?\nHow can we prosper?\nHow can you see through them blind eyes?\nCNN, Fox News, sellin' all lies\nHistory repeats, these feelings like the end times\nNiggas die, shot down on the front lines\nThe prophecies bein' fulfilled as I speak now\nBefore the clock strikes twelve, hope I get mine\nPray I didn't miss the deadline"}], "artist": "K.A.A.N."}