{"artist": "L’A Capone", "songs": [{"title": "The Gat", "album": "Separate Myself", "year": "2013-06-24", "image": "https://images.genius.com/086ed874c1108cee242267fa19737166.500x500x1.jpg", "lyrics": "[Hook]\nI could never lack, go to sleep with the gat\nTrust none but I believe in the gat\nMe and my bitch go eat with the gat\nIt's real, but shit get deeper than that\nWhy would I lie? No reason for that\nSix-O shit got seasonal gats\nY'all know how we be with the gat\nHit a lick, kick a door then leave with the gat\nI could never lack, go to sleep with the gat\nTrust none but I believe in the gat\nMe and my bitch go eat with the gat\nIt's real, but shit get deeper than that\nWhy would I lie? No reason for that\nSix-O shit got seasonal gats\nY'all know how we be with the gat\nHit a lick, kick a door then leave with the gat\n\n[Verse 1]\nHomie like \"Bro, be easy with that\"\nI love when it bust like semen in that\nNiggas know me, I be in the trap\nLike why would I lie? No reason for that\nFuck nigga want beef, I'm squeezing the gat\nHe drop Bs, he bound to get whacked\nOn my block where cannon is at\nOn my block where animals at\nWe been drilling since white tee days\nI'll shoot a ho, gat go both ways\nBitch, we the Fam, everybody throw treys\nWe don't give a damn, everybody blow a K\nWhole city know D-Block ain't safe\nL'A Capone at the top of the race\nFufu nigga stay out of my shade\nUp a gat on a lame, give me all that cake\nCatch a body, it's a hommie, I ain't catching no case\nI don't need 30, I use that 8\nIf a nigga throw rakes, six shots to the face\nHitters don't play, they'll hit that cake\nNah, I'll never rat, keep my mouth duct-taped\nFuck what the motherfucking cops gone say\nIt ain't never too late what the clock gone say\nBut you should have known better so the Glock gone spray\nNow be real with me\nNiggas ain't really in the field with me\nAnd I ain't trying to have to go do 50\nSo I fuck with real niggas through the city\nWhen I ain't in my mood to shoot the semi\nI go to my room and pour the Remy\nGot a 100 niggas that's out to get me\n650 that's riding with me\n\n[Hook]\nI could never lack, go to sleep with the gat\nTrust none but I believe in the gat\nMe and my bitch go eat with the gat\nIt's real, but shit get deeper than that\nWhy would I lie? No reason for that\nSix-O shit got seasonal gats\nY'all know how we be with the gat\nHit a lick, kick a door then leave with the gat\nI could never lack, go to sleep with the gat\nTrust none but I believe in the gat\nMe and my bitch go eat with the gat\nIt's real, but shit get deeper than that\nWhy would I lie? No reason for that\nSix-O shit got seasonal gats\nY'all know how we be with the gat\nHit a lick, kick a door then leave with the gat\n\n[Verse 2]\nYoung hot head never gave a damn\nPrice tag on his head, he gone lose a limb\nCan't do too much, I know who he is\nCan't go nowhere, I know where he live\nTalk slick all day, he ain't on a thing\nBoys snatch his ass up and I bet he sing\nShorty thought he was slow off of 'methazine\nOne shot, head shot, it's a Kennedy scene\nAll the real niggas know I got street cred\nShe can't meet my mom, she can meet the bed\nGot a 100-shot chop where I lay my head\nTry to run up on me, now he oh so dead\nStay fucking with me, he must be off the meds\nNever wife no bitch, to the block I pledge\nBe a hitter by yourself like Lil Durk said\nBut rule number one is get that bread\nIf you a nigga getting money, I salute you boy\nI fuck her all kind of ways, Kama Sutra, boy\nAnd everyday the 25th, they ain't used to toys\nHe went bankrupt quick, he ain't used to green\nI throw my Bs to the sky, man I love my team\nPurp in the cup gave me the grandma lean\nHe in the building, they'll know when we on scene\nBut they don't want us around cause we tear up things\n\n[Hook]\nI could never lack, go to sleep with the gat\nTrust none but I believe in the gat\nMe and my bitch go eat with the gat\nIt's real, but shit get deeper than that\nWhy would I lie? No reason for that\nSix-O shit got seasonal gats\nY'all know how we be with the gat\nHit a lick, kick a door then leave with the gat\nI could never lack, go to sleep with the gat\nTrust none but I believe in the gat\nMe and my bitch go eat with the gat\nIt's real, but shit get deeper than that\nWhy would I lie? No reason for that\nSix-O shit got seasonal gats\nY'all know how we be with the gat\nHit a lick, kick a door then leave with the gat"}]}