{"artist": "ILL BILL", "songs": [{"title": "Babylon", "lyrics": "[Intro: Howard Jones]\nImagine you were given one hour\nExactly sixty minutes and zero seconds to put your entire life\nAnd the world around you in total perspective\nWhat would you say? What would it sound like?\n\n[Choir music (By The Waters of Babylon)]\nBy the waters the waters of Babylon\nWe lay down and wept and wept for Thee Zion\nWe remember we remember we remember Thee Zion\n\n[Ill Bill]\nWe've unraveled the Bible code, the rifle explodes\nDemand attention like a knife in your throat\nThey're controlling the price of your soul\nTitans of stone, psychic totalitarian\nBiotelemetric mind control experimentation is various\nNarcotics made to inflict pain and madness\nAssassins with multiple personalities\nActive with full access\nA backstage pass to cover up spectacular assassinations\nAnd arms deals across the axis\nAnother witch hunt, religious radicals with big guns\nBig plans, invisible cameras built in Japan\nCIA behaviour control scientists in the cults\nAnd formed an alliance of cult leaders, also their clients\nTech-savvy hijacker associates board planes\nTo practice, anxiously awaiting their global audience\nEnter the core, I feel this with ease\nThe ultimate reality series, loaded with cameras, angles, and theories\nNow hear me\n\n[Hook]\nA golden helmet blinded minds\nAmong ten thousand swords\nAlong the road to Babylon\nA golden thunder silenced songs\nAmong ten thousand voices\nOn the road to Babylon\n\n[Ill Bill]\nThis operation doesn't exist\nThe revolution will be classified\nLive broadcast from the abyss\nOur cities are crack spots and cardboard condominiums\nVicious and trackmarks cross minds lost in delirium\nThe towers dropped, blind fools, confusion who knew?\nNow the world watch Saddam's execution on Youtube\nPropaganda machines wage media Jihad\nA teen walking to a crowded movie theatre with bombs\nReading the Qur'an, silently obedient to God\nKnown by many different names: Hashem, Jesus, and Allah\nExploding porn, shadow government protocols\nGo to war amongst ten thousand voices on the road to Babylon\nPatriot Act, sanctioned exorcism\nIranian and North Korean-built weapon systems\nBudgets increase to payroll hundreds of creeps\nNumber of the beast, bomb London under the streets\nThe engineer was a popular peer\nHis value appeared to having nuclear weapons just shower the air\nA thin line between power and fear\nA martyr in tears, goodbye father\nNow my final hour is here, help me\n\n[Hook]", "image": "https://images.genius.com/457870257e417a35d5715090c07a987d.1000x1000x1.jpg", "album": "The Hour of Reprisal", "year": "2008-09-16"}]}