{"songs": [{"title": "Don’t Piss Me Off", "lyrics": "You what?\n\nGrunt\n\nYou what?\n\nI don't like to lose my temper but they give you no choice\nIt's like they were born irritating, even the sound of their voice, is dedicated to testing the patience of the most saintly type, elevated\nSo when they are faced with us that are basic are we supposed to be able to take it? I can't, can you?\nNo? Well then, here's what you tell them: Don't piss me off!\nIt's the tone of a pompous git when he's on your shit and he just make you wanna spit but instead you bite your top like and feel like a dickhead\n'Coz this ain't the time of place for a punch in the face but you just wanna humble a mug\nMove peaceful with abundance of love but you're not a prick and he muddled you up\nTaking him out with a straight to the mouth, sometimes that's all they understand\nTaking him out and then straighten him out so he realises he won't ever shout in the face of a grown ass man again\nAre you a little boy and your only 10? Like if you need to you won't defend? Must've confused you with him and his friend but when you blow your gasket shit gets drastic, you're not elastic snap like a matchstick and you will slap pricks, yeah\nHype as an Irish man on St. Patrick's\n\nDon't piss me off\nDon't piss me off\nDon't piss me off\nYou what, you what\nDon't piss me off\n\nDon't piss me off\nDon't piss me off\nDon't piss me off\nYou what, you what, you what, you what\nDon't piss me off\n\nI don't like to lose my temper and it don't happen that often\nSometime somebody wanna be a problem and nothing else will stop them other than knowing that physical conflict ain't off the roster\nBox an imposter. This ain't life or death, this ain't my family under a threat\nIt's just a day when a little mug gets, out of his pram 'coz he don't recollect how it could get when the left hook checks, that same mouth that spouted the mess\nYou ain't on road, you don't need to body no-one, unless they trouble your mum\nFuck doing life, over little backchat. That's what the elbow's for to attack that\n\nI ain't gonna lie, when I was a younger, shit, something in an avirex in the summer\nI got lucky lotta man doing bird, wanking no access to a bird. Over he said she said, what have you heard? My ends, your ends, shit is absurd. So here's to an old school punch up, come and have a dust up, we should be teaching the youngers\n\nYou ain't on road, you don't need to body no-one, unless they trouble your mum. We are not dumb, we know how fools are become, everyone on a knife and a gun. But we all seen too many man doing life, 50 in a cell, over the hype so let's get old school lets just fight, put up your fists and tell 'em like this!\n\nDon't piss me off\nDon't piss me off\nDon't piss me off\nYou what, you what\nDon't piss me off\n\nDon't piss me off\nDon't piss me off\nYou what, you what, you what, you what\nDon't piss me off\n\n(Akala talking)\n\nDon't piss me off\nDon't piss me off\nDon't piss me off\nYou what, you what\nDon't piss me off\n\nDon't piss me off\nDon't piss me off\nYou what, you what, you what, you what\nDon't piss me off", "year": null, "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}