{"artist": "B-Real", "songs": [{"album": "The Gunslinger Part II: Fist Full of Dollars", "title": "The Set Up", "lyrics": "[Intro: Mellow Man Ace]\nYeah!!!! [echo]\nGunslingers!!!! [echo]\nB-Real!!!! [echo]\nAnd now !!!! [echo]\nFor you backstabbers!!!! [echo]\n\n[Verse 1: B-Real]\nThey say homies last forever and that's true in some cases\nBut you gotta keep your eyes open for two faces\nI knew one homie roll wit me through thick and thin\nWe ran the streets taught the world like [ ]\nThe brother I never had, a couple crook niggas\nJust say the word and we ran out and hooked niggas\nWe had money on the mind we gun-derstood figures\nIf a robber tried to get off hey:  look, triggas!\nIt was a family thing and no one could touch us\nTil a homie turned green and that mean he don't love us\nIn back of his mind he screaming out fuckers\nUnder his breath, \"I'm gonna get you suckers\"\nSent niggas to your crib with macks and nuggets\nAnd you givin' up all your shit or you feel the slug hit\nThey took 3 heaters with the [  ] ice\nComin' to find my homies set it up nothin' nice\nFunny how they knew where all my shit was stashed\nIt wasn't a random action to get some cash\nI hand it to 'em but their little scam was ruined\nDamn I'm doing everything I can, pursuin'\nBut when your guard's down and you can't avoid these troubles\nPut your strap out, go ahead burst that bubble\nLeave 'em in a puddle of their own blood you fumble\nAnd they'll be on you like the feds [ ] tax in a bundle\nCome on\n\n[Hook: B-Real (sung)]\nNight time niggas on the grind\nAnd your homies are actin' shady (get that dough)\nTake mine and you bitches'll find\nThat your head is my 380  (you don't know)\nGet in line if you're livin' for crime\nIf you think you're fuckin' crazy (you don't know)\nNo spine there ain't nowhere to hide\nMan your ass is Swayze (you don't know)\n\n[Verse 2: Mellow Man Ace aka Willie Malo]\nI see through the shady like empty coke bottles\nOr like Star Search models\nExcept this one time I was heavily sedated\nThis nigga want a wife and knew that I was faded\nAnyways we was out cuttin' hoes\nAnd mo moes like true motherfuckin' bros\nHe says something like \"Why you cheatin'?\nWifey look good and you baby breathing.\"\nI paid no attention started fuckin' old girl\nBut little did I know the nigga wanted my girl\nAnd it seemed like everything was kosher\nTil that time I had that show in Nova Scotia\nDude show up like he want some pussy\nHorny ass a motherfucker gettin' pushy\nTold wifey this, he told wifey that\nWe had mad hoes that was Asian and black\n\"Your man a dirtbag why you wit him?\nYou know I got niggas that are gonna wet him\"\nBitch motherfuckers that's how they do\nSay shit to your girl they won't say to you\nWhen I got back in town, wifey sat me down\nShe said \"Motherfucker what's really going down?\"\nTried to lie a bit but she looked in my eyes\nShe knew right there that the nigga was a liar\nThe set-up\n\n[Hook]\nNight time niggas on the grind\nAnd your homies are actin' shady (get that dough)\nTake mine and you bitches'll find\nThat your head is my 380  (you don't know)\nGet in line if you're livin' for crime\nIf you think you're fuckin' crazy (you don't know)\nNo spine there ain't nowhere to hide\nMan your ass is Swayze (you don't know)\n\n[Verse 3: O Brown]\nCalled everybody on his phone list\nStory didn't make sense, bitch I'm pissed (yo)\nTo a park to jack and smack miss\nThey stabbed his head slashed his wrist\nJam back to your crib, to ease the pain\nSlammed H in his arm and that's what you claim?\nFalls to the floor his arm starts to shake (Damn)\nFucking whore called the medics too late\nFrom the living room floor you carry dead weight\nTo the bathtub - what for, can't relate\nHe six five over two hundred pounds\nYou a buck O-5 and lift homie off the ground? Hell no!\nThere's two sides to every story (Damn bitch u gonna see...)\nGonna dead up my homie\nMy tray 8 wants you to get to know me\nSet up that date 'cause bitch I been lonely\nHe's on the couch when they crept up behind her\nKnifed her, fail, shot dope in 'er\nI betcha her brains on this page\nThat's her name, wrote this rage\nShe set my homie up and watched him die\nSuper max tears coming out my eyes (Damn)\nHow now nigga that's full of surprise\nWon't be satisfied til your body lies\n\n[B-Real Hook]\n\n[Outro - Sample]\n\"What you want Ringo\"\n\"I want your blood\nI want your souls\nAnd I want 'em both right now.\"\n\"I don't want anymore trouble\"\n\"Well you got trouble!\nAnd It starts with you.\"", "image": "https://images.genius.com/2540fc0584f5a1a9b61f7935d71b0ba9.494x494x1.png", "year": null}]}