{"songs": [{"image": "https://images.genius.com/de4461e997db2c5b87deaef13bb98de6.1000x1000x1.jpg", "title": "Concrete Roses", "album": "The Boombox Diaries, Vol. 1 EP", "year": null, "lyrics": "[Verse 1]\n\nYeah, The Boombox Diaries\n\nYo, I inspire to inspire\nRebel with the treble cutting through the barbed wire with a fiery desire\nThey say the running out of dope, need a new supplier\nTill' I came on, yo is this thing on?\nI gotta tell the people what it took to make this EP\nHow many labels tried to cheat me for a cheap fee\nTrying to make it intimate while they just talking increments\nImpotent but fuck it I guess I got good predicaments\nI ain't a rapper, just a wordy abolitionist\nHere to free the streets and ain't no pimpin' on my instrument\nOne for the money, and two for the show\nThree for the record everybody here we go!\n\nYeah! Cause' I'm the last boombox\nHolla \"peace! peace!\" when you see me on the block\n(Boombox!)\nI know you like that knock, Nitty Scott will keep it hot until the clock don't top\n(Yeah!)\nSee we be like a breath of something fresh, generated generation power we possess\nRich is getting richer givin' less to the oppressed\nBut I'm destined for the best in the name of progress\nI tell my story for the ones who forgot you; single mothers, fallen brothers, hustlers, I got you\n\n[Bridge]\nToo late I'm on for these Marilyn Monroe's\nConcrete Roses\nGoing where the flows is\n\n[Hook]\n\nUh huh, welcome The Boombox Diaries\nWelcome to The Boombox Diaries\nUh huh, welcome The Boombox Diaries\nWelcome to The Boombox Diaries\nYou are now inside The Boombox Diaries\n\n[Verse 2]\n\nMan I don't even watch TV\nCause nobody on the TV look like me\nIf I charge black cards or an EBT\nI keep it Hip H-o-p when I MC\nAnd ain't it sad, that I would have to shit in a bag\nIf I was a co-signed white girl with swag? Dag!\nI've reached my interception\nMother of the New School Birth and Resurrection\n\nOkay, I blaze trails like a traveler does\nThey want the glow of my aura\nThey want the strength of my buzz\nAnd I'm learning that success is like a relative term\nIt brings a lot of relative looking for something to burn, but\nI live the land of the frozen I am chosen\nHomegrown flowing in zones they gobble souls in\n\n[Bridge]\n\nToo late I'm on for these Marilyn Monroe's\nConcrete Roses\nGoing where the flows is\n\n[Hook]\n\nUh huh, welcome The Boombox Diaries\nWelcome to The Boombox Diaries\nUh huh, welcome The Boombox Diaries\nYou are now inside The Boombox Diaries\n\n\n[Outro]\n\nHell yeah! Jewels!\nWe did it homie!\nHey I've been waiting to drop this project my whole fucking life!\n\nFrom Grand Rapids to Florida\nTo Brooklyn and back\nThis is all I've ever wanted to do\n\nNiggas say they had faith but ain't want to put it on paper\nWe good though, we good\n\nBoombox Family!\nWe breathing life into this shit!\nIt's just the way I was raised\n\nLet em' know that we ain't numbers, we are letters\nLetters that form stories, and speak of our glory\n\nBoombox Family, stand up!"}], "artist": "Nitty Scott"}