{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Can’t Complain", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "[Intro: Prodigy, (Big Twins)]\n[telephone ringing]\nHello... hello...\n(Yo what up, man)\nWho the fuck is this?\n(Who the fuck it sound like, man?)\nWhat the fuck you calling so early for, man. Fuck time is it man\n(It's like 3 o'clock, man, thought you was coming to get me, man!?!)\nShit, my bad son\n(Please, man, come get me man, before I choke this bitch, man!\nHurry up son, man it's like 90 man, let's get some hoes or something)\nCome on, Come on\n\nWhat up, dun\nSame ol' shit\nNo doubt, ain't nothing new...\nLet's take a little spin, dun, word up\n\n[Verse 1: Prodigy]\nYo... open my wings to a new day spread my lungs\nGet laced, jump in the whip, stash the guns\nTwist the key, shifted to D then flee\nBefore anything, get the daily dose of choke\nWe got the Benzo flooded with smoke on the float\nMy eye's burnin' from the dope killin' my throat\nLean my seat a taste, lumbar support\nOn the belt doin' 90 or more\nDebatin' on the latest rhyme wars\nWhere units don't count\nBut your rap pay add up to large amounts\nGet my thrills puttin' other nigga's skills to sleep\nCatch chills off a infamous beats\nSwing the trees doin' one-handed u'ees\nBlowin' on the ouwee cause we can't have the medicine canoein'\nThere go the boys to the right, no days and nights like that\nAy yo dunn, hold that down and turn it around\nDirty as fuck, thugs drugs and guns, D's and fatigues\nT n T hopin' out of MPV's\nSurprise all fuck out of me\nGot rubber Glocks pointed at me\nAy yo Twin, what the fuck\n\n[Verse 2: Twin Gambino]\nThey had us layed out on the ground holdin' us down\nWith gats to back of our heads was goin' down\n\"It wasn't us that held up that bitch you got\nWhere's the proof, man, let me speak to my attorney.\"\nI know the routine, don't try to throw me\nI been gettin' knocked since 12 and my moms tried to scold me\nBut all that told me to get in more shit\nAy yo P, (what up) you my co-d, we both get knocked\nWhat you did with that half'a tree? (right in my sock.)\nYo, I hope these fuckin' dicks won't find the stash spot\nDunn, you know how I get down\nYo I'm ready to bounce\nDo the 100 yard-dash and tear ass\nIf my other half was alive we woulda got killt\n'cause dunn woulda went for the guns and got ill\nPlus I got cracks on me, they found the cracks on me\nLooked at 'em, gave 'em back to me\nI could've swore they was takin' us in\nThen the lady in the car said, \"that's not them.\"\nPicked us up, told me I could keep the drugs\nThey didn't give a fuck, they was only lookin' for guns\nAnd you ain't gotta tell us twice\nWe hopped in the car and slid off\nOn our way uptown for more of that funk\nP lit the tree back up\nGot off the Triborough, hit the Henry Huds'\n\"Fuck it, let's slide through the Ruckers.\"\nRoll the windows down cuz Infamous Mobb bumpers...\n\n[Verse 3: Prodigy]\nSkip To My Lou had the crowd jumpin'\nTook a walk through the park frontin'\nDidn't even have to hurt nuttin'\nMan I love it, ain't nothin' like summer in New York\nHear Infamous Thoughts, then the Dream Team music starts\nDamn, we young black entrepreneurs\nNew York Pricks and Dicks can't stop our floss\nWe like organized crime, the fuckin' Mobb\nI'm only twenty-six playin' wit' serious cards\nDead serious cash, luxurious labs\nLearn to balance fame with pain, you can't complain\n\n[Chorus: Chinky]\nJust another day, livin' in the hood\nJust another day around the way\nFeelin' good today\nOh no we can't complain\nJust another day livin' in New York\nDealin' with the jakes and the snakes\nFeelin' good today\nWe hit 'em up cuz we here to stay", "year": "2000-11-14"}]}