{"songs": [{"lyrics": "[Verse 1]\nDum-diggy, bump Biggie\nTil the landlady holler, \"Get a haircut, hippie\"\nThe death knell generator entertain a fresh kill\nBreath quelled dressed like a bloated sack of dead cells\nShedding, purple tape, purple 'hawk, ape\nA single flower through the permafrost\nPick himself and learn to walk, in furry pants\nWar paint, circling a duralog\nBoar face, devil by his side like a service dog\nSchlock purist, watch the block burneth\nOne o'clock prophets in the parking lot at Perkins\nThe perfect politicians 30 clicks outside of Sturgis\nDoggie bag doctors, military deserters\nWho still shop surplus and can't hold jobs\nI look like I'm wearing a ghillie suit when I'm not\nRoll out ghost of Camu on the pegs\nMight pedal by the police\nTuff with two F's\n\n[Verse 2]\nAh fuck that shit look\nCan't tell if I'm a little withdrawn\nOr dead dog sent to quote/unquote \"live on a farm\"\nThe coke bottles tint film noir\nTripping out the milk bar\nPoison horchata cup\nMilf in the Zip Car\n6 arms, 6 hand-styles like ships on scrimshaw\nPart Def Jam part Dischord\nMy wig-picker threw me out of her office\nHad to cold turkey 'benzos, summer was awesome\nOnion of 'bensis\nSummer was awesome\nGot brats on the grill\nWormwood in the cauldron\nHorse hoof in the dog's mouth\nCholera in the well\nMake money periodically vomiting on himself\nI read Nat Geo, craft and crack geodes\nLift party hats out of Craft Depot\nUnleaded liar blood pumped through his neck\nCame down from the mountain\nTuff with 2 F's\n\nTUFF\nTUFF\n\n(What's so funny?\nYou, what are you laughing at?\nI said what are you laughing at?)\n\n[Verse 3]\nBefore a player ever met his omega\nThey were effectively reducing his behavior into data\nWith plans to build a dais where the\nPeople grow potatoes and cabbage\nDon't make him raise the gate between the bettas\nIn a spectacle displaying the nature of strange neighbors\nI paint caves 'til the rage campaign tapers\nAnd show a new crop how he used to moonwalk\nOut of breath like a 7-day old balloon dog\nI still hang band posters and buy black-lights\nCrib decorated like a dorm room at Brandeis\nStill pretend I'm gonna build another half-pipe\nNevermind the Ford-era christening and pants size\nMan, who could've guessed the future of abominable imagery\nWould also share a birthday with Kenny G? None\nThe 99 cent 2 cents keeps 2 arms folded\nTuff with 2 F's\n\nYeah, let's do it like that\n\n[Verse 4]\nUnh I pay a guy to lean over steepled fingers\nAnd convince me to pay him for his teas and tinctures\nThe string cheese dinner kid speak Cheech wizard\nFor the gone like Gossamer under number 3 clippers\nFree, forged in various pulp channels\nEven his prize horse rides a wolf into battle\nEven his blood and body couldn't pick him out a line up\nOr his name off the paper\nIt's Aes pronounced \"Why Us?!\"\nFirst learned the high art of eyeing a mark\nBuying nickels for a dime at the park\nI learn to rhyme in New York\nI learned to breathe underwater\nI learned to walk with a ghost\nAdidas reeking of sulfur\nA chauffeur cemetery funk\nWhen home is a bleeding ulcer\nEverything you ever stood up for is keeling over\nMoonset beautifying\nCartoon death catfish on the Foreman\nTuff with 2 F's\nYeah", "title": "TUFF", "album": "The Impossible Kid", "image": "https://images.genius.com/1d8582e283f0f4d717c0ba1fe12df744.1000x1000x1.jpg", "year": "2016-04-29"}], "artist": "Aesop Rock"}