{"songs": [{"lyrics": "[Hook]\nWho stole the uprock, who stole the paint?\nWho stole the cypher slayers, who buffed the train?\nWho stole the mixtapes, who stole the fame?\nWho stole the cypher slayers, who buffed the train?\n\n[Verse 1]\nBarnacle on the hull of show business\nVote for auto dead horse battery\nMurder perfect world Gerber Baby ecosystem\nArmy green eyes with ColecoVision bash casually\nWhile punks jump up and jeopardize my head banger reality (ah)\nGodzilla jook\nRed five minus the whiny Wookiee\nGobble gromits with a jaw that swivels backwards off the hinges\nMollasses [?] on plastic fabric with a cause\nThat riddles bastard coughs with ribbons\nNerve-wracker that pivots\nAs a dysfunctional dancer in the dark\nMy smart bomb mechanism ticks adjacent to the broke city\nArt yester-vision\nI'm mister God Bless the Mission who rose to expose your tarot\nAnd stop the ball club kids on ?stoner?\n(How about a little fire scarecrow)\nBut brainiac dumb-dumb, bust the duck hunter\nI let the fuckin' dogs out and they're breeding in big numbers\nIt sorta' irks citizen exes and vexes check collectors\nHexed by the flex of a messy pegasus\nRemarkable but unmarketable\nLeg'go my treasure chest\nIt's empty, but I use it to cradle my true confessions list\nConfession one:\nAesop was raised to the Colonel Kurtz daycare center\nFor disgruntled youths where it's brilliant to flee the sheep flock\nYou're a little teapot homie please don't feed the pigeons\nThey're tryin' to spread their peacock feathers\nAnd bleed through the system\nThis goes out to plainclothes prophets\nFree for the wisdom\nWho swore they'd never spend a night and sleep in the pigpen\nTouch the prickly outer shell of reptilian\nMinimal nighttime Z-catcher\n20,000 league mapper, and um\nMe and my primitive friends drag our knuckles\nAnd find your upright bipedal walking ugly\n(I'll be in the back evolving from a monkey)\nThanks to y'all that came to school with paint stains on your fingertips\nAnd brought a little life to those Long Island railroad city trips\nPlease, remember I can build you my friend\nAnd if I'm not happy, I'll break you the fuck down and build you again\n\n[Hook]\n\n[Verse 2]\nI drag my alligator belly to the brake light (Hi)\nAnd drag my alligator belly back to bed until I die\nYou've got a metal skull with wires through your heart and a dead air surplus\n(Ludicrous)\nLike Labor Days bootleggers on some support the movement shit\nMy practice: life inside a pitch black magic pack of rat brackets\nThat's tragic\n?Bout to head back? to out for a pack of rat bastards\nThat's an earthworm mentality, flag captured\nPeaceful: telling me that ?Aes speaks? proudly\nOn a soulful with an idle motor\nThey say decrepit\nIs where I'm at\nSinful like a brain full of bottle rockets\nNot a model, not a prophet (nope) not ?undone?\nGot a fuckload of missions here want 'em\nYou can tell your man they came to you in a daydream\nAnd I won't rally back, alley cat (Passion)\nOne tall glass (action)\nTaller glass for the (aspirin)\nBalderdash (backspin)\nBack track, back in effect, back in the clutch\nSittin' on this old '98 BFA collecting dust\nSlack-jawed, smiling like a hacksaw, that's raw\nSpit master conspirator feeder for critics to suck\nYou're off track betting on a one-trick pony\nWith pony express delivery delay effect, funny\nNo, that's not funny\nCity yard slaughtered ugly\nWith pins needles and duck-walks busted\nSitting at the movies with a large bucket of Xanax\nExtra butter and a spring water\nKamikaze Zaxxons\nFlight simulator major\nStreet pilot directly through the iris\nFuck it, freak the fader on some fly shit\n\n[Hook] X2", "title": "Train Buffer", "album": "Urban Renewal Program ", "image": "https://images.genius.com/d9eaaf8d667858440ed006bc21495cb9.430x430x1.jpg", "year": "2002-08-19"}], "artist": "Aesop Rock"}