{"artist": "Ace Hood", "songs": [{"title": "Goin’ Down", "album": "Starvation 2", "year": null, "lyrics": "[Intro]\nReal niggas came to party, Ace hood!\nReal niggas came to party\n\n[Hook: Ace Hood]\nI say, Lord have mercy all I wanted was a Beamer\nHad no pot to piss in, now I’m living, thank you Jesus\nNow my Rollie flooded, I’m not talkin bout Katrina\nKnow I run my city, couple thousands for my sneakers\nIt’s going down, it’s going down\nBurn the kush, on Ciroc, it’s going down\nIt’s going down, it’s going down\nBad bitches, bring the whips, it’s going down\n\n[Verse 1: Ace Hood]\nOk, happy birthday nigga, everyday I’m getting cake\nWhat’s today, it’s Tuesday, bitch I might blow 100k\nFuck that nigga they sleeping, it’s a must I raise the stakes\nCan’t play with a nigga no way, my drop is white as mayonaise\nHoly shit, better watch your bitch, Frito-Lay, gotta stack them chips\nKeep that tool Home Depot shit, and I keep two clips if a nigga do trip\nBoy you talk, I get money ridin around in that new 600\nWe them young niggas on the block who run it\nEvil Knievel, bro we stuntin okay\nMillionaire nigga, I got diamonds on my dick\nBoy, my swagger dope, I’m talkin 20 kilo bricks\nJust bought me an Aston and it came with a spanish bitch\nDiamonds got me froze like a PS3 glitch\n\n[Hook]\n\n[Verse 2: Meek Mill]\nOk, I go into my beast mode, rapper niggas I eat those\nI tell a bitch take a deep breath, then bend on me like a free throw\nI don’t want me no good girl cause I fell in love with these freak hoes\nIn my bedroom, I might make a movie and start me with that lead rode\nI ball hard like D-Rose, my stash on closet\nRacks all in my pockets, these racks all on deposits\nI got racks all on my conscience, money all on my mind\nI got shooters on my team, and they got bodies on their nine\nLook at that bad bitch right there, see that body on that dime\nI ain’t swimmin in no ho, you know I’m probably on that right\nAll these niggas hatin on me, but I ain’t on that type\nCause I be in that back, and I ain’t talkin bout clock, whoa!\n\n[Hook]\n\n[Verse 3: Ace Hood]\nOk, now let’s all say a prayer, since my swagger such a killer (Amen)\nMight just buy your chick and give her that dick filet for dinner (Yeah!)\nNigga don’t want no problems pistol pop you’ll get this figure\nLookin’ at all my diamonds, it ain’t hard to tell a winner\nGoin down goin down\nThat potato on the barrel, no sound (Shhh)\nYou see them foreigns?\nYou see we touring?\nMe and Meek Mill the realest niggas born\nPray!\n\n[Hook]", "image": "https://images.genius.com/a8ccf68732bfc41deafb0b2d7ab2be48.500x500x1.jpg"}]}