{"artist": "Young Thug", "songs": [{"year": "2019-03-11", "lyrics": "[Intro]\nI just (sway)\nI just, I just (slatt)\n(Lean, sway) I just\nI just (Sway, lean, hey)\nOhh, aye\nWheezy Beatz\n(Sway, sway, sway, hee)\n\n[Bridge 1]\nI just want you to\nI just want you to\nI just want you to\nI-I just want you to\nI just want you to be you (be yourself or else)\nI just, I just want you to be you (I said be yourself or else, woah)\nI just... I just, I just, I just (woo)\nI just, I just, I just\nI just, I just, I just, I just want you to be you\nI just, I just, I just, I just want you to be you\n\n[Verse 1]\nAll times, I just want you to be you (woo, sway)\nAt all times, I just want you to be you (remain yourself)\nIf you want tatas, bae, you just gotta be you (remain yourself)\nIf you want my child, bae, you gotta continue to be you\nYou gotta be you, let them other bitches just hear you\nGotta do it just like I told you to do\nYou gotta do it 'cause that's what you were supposed to do (idigg)\nYou gotta drip sauce on the whole crew (you gotta drip sauce)\nYou gotta drip sauce 'til your diamonds Fruit Loops (ya digg)\nDifferent colors, big booger, 80 pointers, yeah yeah\nAll the bitches, can't hate, and they ain't joining, yeah yeah\nMake them hoes, wash the dishes, do the laundry, yeah yeah\n\n[Bridge 2]\nAll the bitches, I just want, big assumptions\nBig assumptions, I just want, big assumptions\nI just, I just, I just want you to be you\nBig assumptions, make big assumptions\nBig assumptions, I just want you to be you\nBe be be be be be you\nBe be be be be be you\nBe be be be be be you\n\n[Verse 2]\nDon't be nobody else, just be yourself, bae\nGotta do it real real good, can save me yourself bae\nGotta oh, oh, oh, oh, I just wanna [?]\nAnd won't you style on 'em, bae, stylin'\nAnd don't play with 'em, bae, go to wylin'\nTake the whole whole family to an island\nChristopher Columbus, bae, you the [?]\nI'm on a boat, no Gilligan island\nPlay with your bae, bae get to wylin'\nNigga can't go wild loudin'\nI pay the Rolls Royce, and go get to childin'\nBe home in about two hours\nFifty-seven hunna, bae, be on the island\nDrip drip, gon' solve me wylin'\nDrip drip to the spot in Highland\nBig bags, [?]\nWoo woo, yeah [?] watchin'\nWe take a foreign, do [?]\nWe hopped inside a foreign, dropped the top, woah woah\nWe hopped inside a foreign, dropped the top, leave you stylin'\nHey, aye\n\n[Outro]\nAye, I don't wanna worry about fixing this motherfucker\nYou know what I'm sayin'?\nThat's a real freestyle right off the top, you know what I'm sayin'?\nI swear to God\nOne take, you understand what I'm sayin'?\nBake the cake, bae, bitch, eat that up\nThugger! I meant Jeffery! Yeah, udigg?\nSee, I had to go back to being myself, you know what I'm sayin'?\nFirst I was someone else, I was Young Thug\nThat's exactly who I wanted to be like\nYou know what I'm sayin'?\nNow I'm back to myself, I'm Jeffery\nFuckin' hoes, Hugh Heffley, Hugh Heffley, yeah\nJeffery, Hugh Heffley, udigg? Hahaha\nEat that up, you know what I'm sayin'?\nTimeless music! ENT!\nHah!", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Be You"}]}