{"songs": [{"year": "2010-06-22", "image": "https://images.genius.com/094639b25f790dc7c57451247197cfd7.360x360x1.jpg", "title": "Holy Shit", "album": "Gang Rags", "lyrics": "[Intro: Violent J]\n\"Holy shit!\"\n\n[Hook: Violent J]\nAll I have to do is roll up\n(Bumps beating out the truck)\nAll I have to do is show up\nAnd everybody like “Holy shit!”\n\n[Verse 1: Blaze]\nStep out the car, I’m out to the bar\nThey flock from afar like “Holy shit!”\nWalked through the door, heard a little more\nFrom folks on the dance floor “Holy shit!”\nOrder up a round for hoes in the lounge\nThrow a little money down “Holy shit!”\nI don’t play games, they all know my name\nAnd show me respect when they say “Holy shit!”\n\n[Hook]\n\n[Verse 2: Blaze]\nI fired up a blunt of that super skunk\nAnd everybody in the club like “Holy shit!”\nThey like what you smell, wanna know if it’s for sale\nI pull out the scale and they like “Holy shit!”\nBag up the dub sacks, increase the paper stacks\nBitches can’t hold back like “Holy shit!”\nTook them bitches no doubt, you know what I’m about\nLet me hear the Juggalos shout “Holy shit!”\n\n[Hook]\n\n[Bridge:]\nOh!\nOh, oh!\nOh, oh!\nOh, ohh!\nOhh!\n\n[Verse 3: Blaze]\nUp to the next spot, pull up on the block\nSystem in the truck and it’s like “Holy shit!”\nRide up on the curb and the peoples’ heads turnin’\nThe bitches steady burnin’ like “Holy shit!”\nThey like what I roll in even if it’s stolen\nThe window’s broken like “Holy shit!”\nThey love how I’m living cos it’s unforgiving\nAnd the gang rags expressing how I’m feeling “Holy shit!”\n\n[Hook:]\n\n[Bridge]\n\n[Verse 4: Blaze]\nWhen I show up, the spot will blow up\nA block party what’s up like “Holy shit!”\nThe sounds that I bump, makes everybody jump\nPsychopathic Rydas still dump like “Holy shit!”\nBitches titties shaking, got that ass breaking\nPopping non-stop like “Holy shit!”\nThey like looking for attention, they got it did I mention\nNever any tension like “Holy shit!”\nThey love what I’m saying, the shit I’m creating\nIt’s truly unmistaken like “Holy shit!”\nThe dead man no faking, unfazed by hating\nNever be replacing like “Holy shit!”\n\n[Bridge]\n\n[Hook]"}], "artist": "Blaze Ya Dead Homie"}