{"songs": [{"image": "https://images.genius.com/a771fd3e611d5c86a13b17b05dbb15f9.500x500x1.jpg", "lyrics": "Can you feel the beat within my heart?\nCan't you see my love shine through the dark?\nCan you feel the beat within my heart?\nCan't you see my love shine through the dark?\nCan't you see that you must be a part\nOf that beat in my heart? That beat in my heart\n\nAfter all that we've been through\nI can't seem to face the fact that boy I'm losing you\nI threw away your ties through those venetian blinds\nI looked and saw my heart just over ruled my mind\n\nAnd I tried not to let it show now I don't know what to do\nI tell myself I'm lying so let's just not let it go\nMy heart does double beats for you, oh\n\nNow you know my love won't grow cold\nOh this love will turn to gold if we stay in love\nOh, my love, my love, my love\n\nCan you feel the beat within my heart?\nCan't you see my love shine through the dark?\nCan you feel the beat within my heart?\nCan't you see my love shine through the dark?\nCan't you see that you must be a part\nOf that beat in my heart? That beat in my heart, that beat\n\nIt's like trying to touch the sky but overlook the sun\nThat's why reality keeps telling me that you're the one\nJust the very thought of you gets me aroused\nI can feel my heart beat right through my blouse\n\nAnd darling I tried not to show now I don't know what to do\nI tell myself that I'm lying so let's just not let it go\nMy heart does double beats for you, baby\nAnd I hope you feel the same 'cause I do know for sure, baby\nThat sure as my name oh baby I know that you're the cure\n\nNow you know my love won't grow cold\nOh this love will turn to gold if we stay in love\nOh, my love, my love, my love\n\nCan you feel the beat within my heart?\nCan't you see my love shine through the dark?\nCan't you feel the beat within my heart?\nCan't you see my love shine through the dark?\nCan't you see that you must be a part\nOf that beat in my heart? That beat in my heart, that beat\n\nThat beat, that beat, that beat, that beat\nThat beat, that beat, that beat\nCan you feel the beat?\nCan you feel the beat?\nCan you feel the beat?\n\nI can run you say I'm here and this is my idea to care\nWell I do myself care that make you feel that you're still there\nBut I want to do is just ask you, tell me can you feel the beat?\n\nCan you feel the beat?\nCan you feel the beat?\nWell, can you feel the beat?\nCan you feel the beat? Talk to me\n\nNow you know my love won't grow cold\nOh this love will turn to gold if we stay in love\nOh, my love, my love, my love\nWe've ever been to my heart, ever been to my heart, yeah\nOh my love we've ever been to my heart, ever been to my heart\nAnd love, my love, my love, my love, my love, my love, my love\n\nDon't stop, one more time\n\nNow you know my love won't grow cold\nOh this love will turn to gold if we stay in love\nOh, my love, my love, my love, my love, my love\nMy love, my love, my love, my love, my love", "title": "Can you feel the beat", "year": null, "album": null}], "artist": "Unknown Artist"}