{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/2df76f5be8e481c4a5e06d60a13adbe0.662x566x1.jpg", "title": "Fettucini", "year": "2013-12-21", "album": "Not O.K.", "lyrics": "[Verse 1: Kool A.D.]\nThis is it, what, fettucini falling to the plate\nNice mover, my files X like Malcolm\nOut the window with the Swisher Sweet\nParadise Lost like [?] tossed out\nSalad like the days where we had less\nShruggy Atlas, sleeping on a cutty mattress\nMake money money, take funny money tactics\nFlip them from the cellar to the attic\nSelling to the sellers and the addicts\nSoak game, bed wetter than a hat trick\nIf you want to send a letter better get the address\nFresher when I step into the palace\nFeathery and lavish, energy and magic\nLegwork centipede status\nHead jerk getting key tragically, hip hop into shit\nI should stop it but I don’t want to quit\nSee how we keep the marijuana lit\nI’ma get as high as I wanna get\nDon’t it seem so sweet, like the lie from a honest lip?\nWe hide from promised whips\nFreedom is a prize and an agnonishment\nOops, I mean admonishment\nKeep your eyes on the monuments\nFollow as I ride in astonishment\nStare into the sky’s wild promises\nSee how your pride slips comically\nDown to the spot where you see the shoe polish sit\nNo matter how much you get\nYou still can’t get all of it\nAnd who would even want all of that?\nEvery spot you haunt will haunt you back\nWhat you want beyond stacks? Look upon the lawns beyond that\nSee how the grass is green, mami guap mean but her ass is meaner\nWord to Victor Vazquez Sr\nSee me in the traffic saying “Bitch I really wish you would crash this Bim”\n\n[Verse 2: Amaze 88]\nYeah\nThoughts arranged by the Dangler\nSurrounded by 99 strangers, hovering over banisters\nPeering piercing eyes, watching the canister\nFilled with nuggets and gems\nDug up with the Netherlands hands\nGripped so hard, tin don’t seem so tough\nThe price is mine, or what it seems to be\nClimb out, climb up reach through to see\nCome to find out those eyes were filled with pity\nFilled with laughter that turned teary\nThose gems, those nuggets, were only worth what I gave it\nI could save it for a hundred years and still couldn't sling them\nDirt, gold, [?] gems, precious to me\nBut nothing to them, so where to go from here?\nI don’t know, but I’ll have a beer, think twice\nAnd I’ll spend two years working on something\nThat's not worth nothing more than two pairs of dirty socks\nTo mop the floor at the local grocery store\nThirty years plus more, that's what I’m headed for\nDamned if I do, damned if I don't\nWin the lottery, read Chuck Bukowski's anthology\nAnd maybe take a trip to some remote place\nWhere I can play out my childhood fantasies\nMetal detector inspector, anti-tragic tragedy\nTurned on its head to be called an epic voyage of a man that believed"}]}