{"songs": [{"image": "https://images.genius.com/8f8b1782b097d1c513ec8617640f78ec.640x640x1.jpg", "lyrics": "(Uh, What)\nDolllalala Lots Of Paper\n(Ah, Ah, What)\nDolllalala Lots Of Paper\n\n[Verse 1: Mac Dre]\n\nPreppy pimp, Crestside rider\nWork 150's and top siders\nOops upside her, head if she comes short\nBread, I'm a gunfolk, yea I'm a cut throat\nBackwood burner\nMack and murder\nI pack the squirter, when I blap the squirter\nFools gon' fall like tall timber\nKilling off the whole gang, all members\nCum in her, never magnum\nShe better have them or I'm never stabbin'\nWhatever happened to the girl from the south\nSuck a dick so good they called her pussy mouth\nPussy's foul but the heads A-plus\nIf I put her in heels and a little make up\nAnd hit Vegas, will she make us\n\n[Hook]\nDollalalala Lots Of Paper(x3)\nPut your heels on the strip see what you make us\nDollalalala lots of paper(x3)\nPut your heels on the strip see what you make us\nDollalalala lots of paper\n\n[Verse 2: KC Bobcat]\nI need a beat baby\nWhat you need to do is turn\nShe a cheap paper\nI show you how to get it\nHow to work them heels maybe\nIf you get up and you get out\nTurn corners, stick to it, dont let up\nYour toes hit the strip, bring drip, bring chedder\nChing ching, get money get dough what else can I tell you?\nBob man, he anglin, c-a-t will sell you\nThick game that I stole from a older uncle\nIts nephew ben its your nephew bubble\nBut dont get me I'm like because nephew trouble\nIf she knew better she'll do better\nLike my uncle miami says \"her mom won't let her\"\nI'mma be a west player with style forever\nWill Bobcat quit? naw I want chedder\nMake a punk rock hit the block give me a burger\n\nDollalalala lots of paper (x3)\nWith ya heels on a strip scene would ya make us?\nDollalalala lots of paper (x3)\nWith ya heels on a strip scene would ya make us?\nDollalalala lots of paper\n\n[Verse 3: Sauce]\n\nWhen my money gets low I don't kick in the door\nI just pick up a ho and make her get with the flow\nGive her the script that I want her to play\nAnd bout a day or two, fuck the dick game\nNow she wants to pay her dues\nShow her what these players do, down in Vegas\nAir force nikes, we dont need no gators\n500 benz and we're riding scrapers\nAnd any old hater catch shock from the blazer\nDollalalala lots of paper, lots of cake to\nOpen up shop, get a (?? Unclear)\nYou gots to pay us, so I'm (also unclear)\nSo if I dont see you working, and your splurging, then its hurting\nI gotta be perking when im on the strip\nMake a bitch give dome and stay on the trick\nAnd im known to dip, from frisco to vegas\nDollalalala lots of paper\n\nDollalalala lots of paper (x3)\nPut your heels on the strip see what you make us\nDollalalala lots of paper (x3)\nPut your heels on the strip see what you make us\nDollalalala lots of paper\n\nDollalalala lots of paper (x2)", "year": "2002-08-27", "album": "Thizzelle Washington", "title": "Dollalalala Lotsa Paypa"}], "artist": "Mac Dre"}