{"songs": [{"title": "I Came to Bring the Pain", "album": "U Gotta Feel Me", "year": null, "image": "https://images.genius.com/1fc0055c4256c840855a7bbf297945cd.640x640x1.jpg", "lyrics": "[Intro: Man with deep voice]\nI, I came to bring the pain, pain\nI, I came to bring the pain, pain\nI, I came to bring the pain, pain\nI, I came to bring the pain, pain\nI came to..\nI, I came to bring the pain (grrr!) (grrr!)\nI came to, I, I came to\nI came to, I came to\n\n[Hook: Lil' Flip, Tity Boi, Static]\n\n[Lil' Flip] I came to bring the pain nigga!\n[Static] And I came to bust them things nigga\n[Lil' Flip] The night'll rearrange your frame nigga\n[Lil' Flip] You scared nigga!\n[Static] You scared nigga!\n[Lil' Flip] One more time\n[Lil' Flip] I came to bring the pain nigga!\n[Tity Boi] And I came to change the game nigga\n[Lil' Flip] The night'll rearrange your frame nigga\n[Lil' Flip] You scared nigga!\n[Tity Boi] You scared nigga!\n[Lil' Flip] Oh oh!\n\n[Verse 1: Lil' Flip]\nGet out my face, get out my face! (you is a ho ho)\nYou talk behind my back, back (but I know know)\nI pack a 4-4 (and I bust bust)\nAnd I ain't leaving this mess (in hand cuffs cuffs)\nYou better put your hands up (what?)\nGet them little budget then wrap your fans up but you still won't catch up\nCause I'm connected on the East (East), I'm connected on the West (West)\nI ain't saying I'm the best (best) but I feel like I'm blessed (blessed)\nI got thirty on my neck (neck) and twenty in my mouth (mouth)\nBut if I feel disrespected, I'm a call your ass out\nThey gone haul your ass out now you crying like a bitch\nI told you not to fuck with the Screwed Up Clique\n\n[Hook: Lil' Flip, Tity Boi, Static]\n\n[Verse 2: Tity Boi]\nBring the pain, hard core, selling cane\nSun, snow, water, rain\nShorty I will flip this stuff until the task force came\nTried to rearrange the game, tried to bang, I suck at slanging\nNew slang I had to switch it up, wrap a pimp cursing on the track\nThe mack will leave you on your back, strap will leave you with a gap\nStop smiling! - glances you see visions of the past\nYou see niggas with masks, up in cars with no tags\nWhen we balling! - I'm from the apartments, started with all of it\nDifferent day same clip, so close I can't miss\nTity, Flip, Ludacris, got bricks, roosters, chicks\nSnatching bread then we dip, it's South Side - represent!\n\n[Verse 3: Ludacris]\nNow the clique is called D.T.P. so get your crew right\nWe peer pressure fools, even +Dudley+ don't +Do-Right+\nSo go on your city, it's a South rebellion\nWe putting \"foots\" in your asses, how we speak Australian?\nI'm trained in the art of whoop ass, check my accolades\nGot a knife and I'm giving out free after shaves\nPlus a new acting gig, take a look at the CLIP!\nIt's called one up in the chamber and four on the HIP!\nI snatch your girls in the club and use them as throat throttles\nThen you'll get hit with fifteen mini Moe bottles\nGot Glocks for your stocks and that thing for your chain\nAnd uh, mutual guns for your mutual funds main!\n\n[Hook: Lil' Flip, Tity Boi, Static]\n\n[Outro: Man with deep voice]\nI came to\nI, I came to bring the pain\nI came to\nI, I came to\nI came to\nI came to bring the pain\nI, I came to bring the pain"}], "artist": "Lil Flip"}