{"artist": "Canibus", "songs": [{"title": "Fait Accompli", "album": "Fait Accompli", "year": "2014-06-10", "image": "https://images.genius.com/7ab7eba445870df74c921471db434c5f.300x300x1.jpg", "lyrics": "[Verse 1: Canibus]\nType on keyboard blind, sign in, everybody say, \"Hi\"\nI'm the holy Hip Hop magi\nThem motherfuckers kicked down the door, I got excited\nWhen I realized who it was I got silent\nMorgan Freeman told the country it's all over\nDanny Glover said the same thing but slower\nNow they say he's worse than Carter\nHim and his big head daughters\nThey don't care collapse of the dollar\nThe population of a planet cries out for more\nThey are ignored and repeatedly provoked to war\nMartial Law, what you think they was hoping for?\nAll you gotta do is walk through that open door\nModern man is but a primitive hologram\nTranshuman's revolutions with pots and pans\nThe god gene is the dominant strand\nThe politics don't matter, the left, right or the communist plans\n\n[Verse 2: Canibus]\nIf you don't want beef, pipe down that inflammatory speech\nThrow you in the Goulag for weeks\nWhich Pussy Riot whore got a passport to go to Hong Kong?\nNah nigga you ain't going on tour\nThe hood die young with guns and tied tongues\nDaughters and sons smoke drugs that fry lungs\nWhen liars tell the truth, nobody believes them\nThen along comes somebody they can trust that deceives them\nOne ounce of silver, one once of copper\nThat's all I got, that ain't enough to stop 'em\nThe problem that we face is race\nEven if you ain't black, you can't escape this draconian fate\nPartnership, transpacific, free speech no longer permitted\nGuilty as charged, you will not be acquitted\nListen, you taking a piss? You better not be\nYou on the black list, everybody 'bout to get stripped\nYeah, you know what they say, it is what it is till it ain't\nSo what, you go hard in the paint\nWhatever, hurry up and wait till it's too late to change the stakes\nThe nuisance abates, the truth is you're abused by the state\nGet small, stay home and pray\nRaytheon drones strafe, no home is safe\nDon't watch the throne, watch that Nordics face\nIditarod dog race across unthawed straights\nFor the agent provocateur in all lace\nMuscle therapy Kate, Uleander in a sauna feeding me grapes\nShe pour cold champagne in the warm spring lake\nBrought her to my seed vault for the cost of freight\n\"Svalbard\" how's it feel to rule the world? Wait!\nI got one kernel of corn on my plate\nStop dreaming get back to base\nWell OK, but why the flight time shorter than the pat downs take?\nIt's because freedom is fake in a police state\nUSA constitution got shredded in '08\nAble bodied adults can't get out of the cult\nThey say it's the Luciferians fault\nAnd now Holocaust healthcare is not much better than welfare\nAssassin dress like mailman\nViolence doesn't discriminate, it's just has to intimidate\nNow you got a Zimmerman in your face\nI see the people of the world protest in vain\nWhile the Antichrist reigns through the sons of Cain\nRighteous people of the world protest in vain\nWhile the Antichrist reigns, reigns, reigns and reigns"}]}