{"songs": [{"year": null, "image": "https://images.genius.com/8bcb4f13231c32e3d05c93927a59e931.300x300x1.jpg", "title": "Camera Tricks", "album": "The Purple Tape", "lyrics": "Feat. Chaundon, Erica Thompson\n\n[Chorus]\nSmile baby, pose for the camera\nWelcome to a world girl where we all amateurs\nWe can leave the lights on, you can take your clothes off\nPress the red button just in case you wanna show off\nSmile baby, pose for the camera\nWelcome to a world girl where we all amateurs\nWe can leave the lights on, you can take your clothes off\nPress the red button just in case you wanna show off\n\n[Rapper Big Pooh]\nFreaks wanna get to the hotel room\nI presume it's because they wanna lick\nHow many times will it take 'fore the bone finally breaks?\nYou surprised when that one-eye SPITS~!\nNo need to sit in the corner, get a lil' close\nNo lie, I kinda dig shy chicks\nSo I start off a little slow, a long night to go\nMaybe kiss her while I'm feelin on her tits\nJust a few moments to the huggin, then we get to rubbin\nThen we go for kissin, me and her lickin\nNow I'm back stickin, she was so smitten\nWoke the next morning, she gone, good riddance\nAnother night, another notch\n'Fore I left for the next city, there's knocks\nOpen up the front door, now there's cops\nCan't believe that bitch said I raped her, glad that I taped her!\n\n[Chorus]\n[Chaundon]\nNever trust a big butt and a smile\nNo matter HOW the good-good feels to you, I'ma keep it real witchu\nLast year back in Germany, I felt like Ron Burgandy\nThis one hoe was throwin her pussy at me with urgency\nGave me a handjob in front of Big Pooh and 'nem\nLickin on her lips, showin me what she can do with them\nNasty lil' bitch but I'm STILL gon' fuck her doe\nCamcord the shit, son I'm NEVER gonna trust a hoe\nHidden under clothes that I wore from the night befo'\nKept the lights on, wore her out until her eyes closed\nTook the condom off and threw it in the trash can\nWent to sleep but she got up to get the condom, goddamn!\nLucky that my camcord' was on\nRecord her nasty ass tryin to steal the seed of Chaun'\nSo when the heat is on, and child service come and knock\nI'ma show the tape to get me off the hook on the spot, ah!\n\n[Chorus]\n[Outro: Erica Thompson]\nSmile baby, pose for the camera\nSmile baby, pose for the camera\nSmile baby, pose for the camera\nSmile baby, pose for the camera"}], "artist": "Rapper Big Pooh"}