{"artist": "6ix9ine", "songs": [{"year": "2018-10-05", "title": "STOOPID", "album": "DUMMY BOY", "lyrics": "[Intro: Yung Gordon & Lil Juice]\nY'all already know it be the boy Yung Gordon\nAnd you rockin' with Take Money Promotions\nAyy, Take Money Promotions\nGive 'em that new shit, no fool shit\nOh yeah, let's go\nDJ NekoLito (Rough Rider)\nTMP954WELIVE\nTake Money Promotions\nTay Keith, fuck these niggas up\n\n[Chorus: 6ix9ine]\nBitch, I'm silly\nUp them choppers, shoot your shit up, let's get busy\nDrinkin' Henny, goin' brazy, poppin' pillies\nSex Money Murda, shout-out all my blazing Billies (All my Billies)\nWe in yo' city (We in yo'—)\n\n[Verse 1: 6ix9ine]\nShoutout my apes in the fuckin' zoo (Filayo)\nFilayo, they gon' shoot\nSpin a hoop, who the fuck is you?\nWho the fuck you know, nigga? No, nigga\nNiggas killed your cousin, you want smoke, nigga? (Stupid)\nGlo nigga, rollin' up your cousin in a blunt, nigga\nBozo, bitch, are you dumb-d-dumb-dumb-dumb-d-dumb-dumb-dumb? (Stupid)\nBitch, I'm Nick Cannon with this drum-dr-drum-drum-drum\n(Brra-pum-pum)\nPull up with semis, no Lil Pump-pr-ump-Pump-pumps\n(No esskeetit)\nWe goin' dumb-d-dumb-dumb-dumb-d-dumb-dumb-dumb\nBitch I'm stupid (Bitch I'm dumb)\nI be tweakin', I be wildin', I be booted (Bitch, I be drunk)\nI be stealin', I be robbin', I be lootin' (You don't wanna die)\nYour boyfriend dumb, he get no money, bitch, he stupid (Is he dumb?)\nOh, bitch, he, oh, bitch, he stupid\nDamn, homie, in high school you was the man, homie (2012)\nWhat the fuck happened to you? (Stupid)\nI'm just sayin', homie\nNow you smokin' Black & Milds, smokin' reg, homie\n\n[Interlude: Bobby Shmurda]\nAh-ah-ahh, what's up? Shmurda on the motherfuckin' set\nNigga 6ix9ine what's poppin' cuz?\n\n[Verse 2: 6ix9ine]\nTell him shut up, suck a dick\nTell him fuck him, I'm the shit\nBitch, I'm drunk recording this\nI'm getting money, I'm the shit\nShout-out my Bloods, shout-out my Crips\nThat nigga, Ebro, he a bitch\nJust another old nigga on a young nigga dick\nBitch I'm lit on the 'Gram, a million likes, you see my shit\nA bitch DM for the dick, but I probably wouldn't hit\nVVS, Cuban hit, shout-out Jimmy for the drip\nYour baby daddy mixtape wasn't shit, he a bitch\nFree Bobby, free Rowdy, free Cueno, free the 9\nShout-out Jay Dee, shout-out Kooda, Dee Savv, those my guys\nFOA they gon' ride, GS9 they gon' slide\nWhen I woo, woo back, ah-ah, those my guys\n\n[Break: Bobby Shmurda]\nShe give me neck until I burst out\nShe use her teeth, she get cursed out\nAnd all these suckers with they fucking feelings\nAlways got these bitches with they purse out\nWe on the blast nigga bow down\nI count bricks put the word out\nYou know you like a nigga Shmoney Dance\nYou gon' love a nigga when I swerve out\n\n[Chorus: 6ix9ine]\nBitch, I'm silly\nUp them choppers, shoot your shit up, let's get busy\nDrinkin' Henny, goin' brazy, poppin' pillies\nSex Money Murda, shout-out all my blazing Billies (All my Billies)\nWe in yo' city\n\n[Outro: Bobby Shmurda]\nHold up, hold up, hold up, gang\nRun that shit back", "image": "https://images.genius.com/b9ed36e4ed1f387b763cafc54c4cf00c.1000x1000x1.jpg"}]}