{"songs": [{"title": "Final Hour", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-31", "image": "https://images.genius.com/77c8c4775e5c1d31fe5ab3d65845291d.500x500x1.jpg", "lyrics": "[Verse 1: Big Sean]\nCatch me running to the money until my feet lose feeling\nStack it wall-to-wall 'till it's leaking through the ceiling\nMan, all fucking hundreds so whats that like a zillion?\nWorking graveyard shifts cause were finna make a killin'\nWent from intern to the owner of the building\nBustin nuts counting money like: \"Oh what a feeling!\"\nTo be seeing what I'm seeing\nAfter I've seen what I've seen\nIt's like acting out a scene from a dream of my dream\nI got a dream that's worth more then my reality\nAnd pride that's worth more than a salary\nAnd a text from the girl I love I stopped calling\nQuote: \"I hope it's worth all it\"\nSometimes I feel I'm working just to work harder\nAnd then work harder then who worked the hardest\nMan the life of a work-a-holic\nYou either on your work or just working on it\n\n[Instrumental Break]\n\n[Verse 2: Big Sean]\nMan fuck it kill'em all we gonna need a ton of flowers\nAnd if you need impossible give me 'bout an hour\nIt's time to turn a Polaroid into a portrait\nRocking street clothes getting money like I'm corporate\nYoungin' getting it isn't life gorgeous?\nBet the crib on 'em and you'll end up with a fortress\nAnd Ima need that new condo, town home, brown stone\nShould I fuck with the Dow Jones?\nOr maybe I'll put money on the block instead\nThere's no need to save\nI could get change off the street next to the meter maid\nCause I need a main house with a piece of shade\nButler doing such a good job that they need a raise\nBad chick with an Angel ass and an Aalyiah face\nTryna show a little TNA\nHell yeah I'm tryna see the day\nMan, life is so bright when you don't see the grey\nThe new school appointed me to lead the way\nA real nigga to the DNA\nMe, Mike, Grace, and Dilla\nSticking to the script\nAnd what's-her-name still licking on my tip\nGo ahead and tell these bitches who they're fucking with\nMan to get where I'm at I'll make her suck a hundred dicks\nMan to get where I'm at I'll make her suck a hundred dicks\nHer mouth lookin like Dannon\nBecause of me and Cannon\nAnd to get where we at she had to suck a hundred dicks\n\n[Outro: Big Sean & Don Cannon]\nMan I got on Versace shades, Versace belt, Versace shoes\nI might've fucked around and been the freshest nigga in the world today\nYou dont understand man I came from nothing\nThis what I dreamed about, this what we dreamed about..boyyy\nB.I.G. Sean Don nigga, G.O.O.D. Music\nFinally Famous in this bitch.. Errything...Detroit what up though?\nAyo Big, Motherfuckers always askin' me like:\nWhen you gonna lend somebody else eat\nWhen you gonna pass the baton on to somebody?\nMy response is: Fuck I look like Carl Lewis?\nI feel like Usain Bolt, I got it running these streets\nWho else do it better than me?\nSo you can cut all the chit chat out right now and just know one thing:\nWe're finally famous motherfucker"}], "artist": "Big Sean"}