{"artist": "G-Eazy", "songs": [{"title": "All Facts", "album": "B-Sides", "year": "2019-08-22", "image": "https://images.genius.com/263f7ab2a86299aba9e8e6fe62706448.720x720x1.png", "lyrics": "[Intro: G-Eazy]\nReal spill is still real\nYeah\n\n[Chorus: G-Eazy]\nWhy you on the 'Gram postin' thirst traps?\nRemember, you supported all my first raps\nBefore this shit was poppin', let's reverse that\nLove don't cost a thing, this is all facts\nMissed calls from each other with no callbacks\nNow you mad and sendin' texts in all caps (Yeah)\nYou been on my head, baseball caps\nLove don't cost a thing, this is all facts\nThis is all facts\n\n[Verse 1: G-Eazy]\nThis not what I'm used to (Uh, yeah)\nWon't get petty on the 'Gram 'cause that's what you do (Yeah)\nIt's not the world's business, I'm just talkin' to you (Talkin' to you)\nThinkin' I don't pay enough attention to you\nHad the world in my palms, I gave it to you (Ayy)\nFell in love in NOLA, like she got the voodoo (Voodoo, yeah)\nShe don't wear the pants in this, remember you do (You do)\nNever thought she'd do that for the clout but who knew?\nI mean like who knew? Yeah (Wow, wow)\nNo one saw this comin' (Oh)\nMean this grew from nothin' (Oh)\nWhere it all falls down, we shoulda started runnin' (Whoa)\nBut we started somethin' (Oh), then she said herself (Oh)\n\"If you don't give it to me, I'ma get it somewhere else\" (Wow)\n\n[Chorus: G-Eazy]\nWhy you on the 'Gram postin' thirst traps? (Thirst traps)\nRemember, you supported all my first raps (My first raps)\nBefore this shit was poppin', let's reverse that (Reverse that)\nLove don't cost a thing, this is all facts (All facts)\nMissed calls from each other with no callbacks (Callbacks)\nNow you mad and sendin' texts in all caps (All caps)\nYou been on my head, baseball caps (Ball caps)\nLove don't cost a thing, this is all facts (All facts)\nThis is all facts\n\n[Verse 2: Ty Dolla $ign & G-Eazy]\nAyy, all facts\nKeep it a hunnid with me, baby, keep it a whole M\nWe done had our differences, but baby still here\nBy my side, my ride or die, girl, you my best friend\nI done told you shit I'd prolly never tell my dogs\nWe was chiefin' backstage, MTV Awards\nI admit it, first I didn't think we'd get this far\nYou said \"Promise one thing, cut them bitches off\"\nI took you to Dover Street and bought you VETEMENTS\nAll the jewlery and the money, that ain't shit to you\nI know we both booked and busy, we got shit to do\nWe used to make time, just to vibe (Oh)\nTell me you ain't switchin' sides, switchin' sides\n\n[Chorus: G-Eazy]\nWhy you on the 'Gram postin' thirst traps? (Thirst traps)\nRemember, you supported all my first raps (My first raps)\nBefore this shit was poppin', let's reverse that (Reverse that)\nLove don't cost a thing, this is all facts (All facts)\nMissed calls from each other with no callbacks (Brrr, callbacks)\nNow you mad and sendin' texts in all caps (All caps)\nYou been on my head, baseball caps (Ball caps)\nLove don't cost a thing, this is all facts (All facts)\nThis is all facts, oh, yeah\n\n[Outro: Sonder]\nPeople say I drive too fast, move too fast, live too fast\nAin't no such thing as too fast for me\nPeople say I drive too fast, move too fast, live too fast\nAin't no such thing as too fast for me"}]}