{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/59dd47cbaa2225d6f621b60362da2aa1.500x500x1.jpg", "title": "201519971800", "year": "2017-11-21", "album": "201519971800", "lyrics": "[Intro]\nCan I, baby? Can I, baby?\nCan I, baby? Can I, baby?\n\n[Verse 1]\nI hope you ain't nothing like my old friends\nOr any other women that I had\nI know I'm better than your ex-boyfriend\nOr any other niggas from the past\nCan I take you where I learned the game from?\nShow you why I act the way I act\nLately, I've been on a fucking marathon\nRunning to the motherfucking cash\nI'm liking how you make a brother laugh\nCan I come and get you in a Jag?\nThen, hit it in the backseat of the Jag\nBaby girl, I know you like my swag\n\n[Chorus]\nBefore I turn the lights out\n'Fore I turn the lights out, tell me who the fuck you want to be\n\n[Verse 2]\nI'm just so excited that I'm free\nSometimes, it be feeling like a dream\nCan a young brother get some sleep?\nLately, I've been working over 3\nMama told me, \"Son, I never hear from you\"\nCook something, you don't even eat\nMama, I'm just trying to make a mil' for you\nPut you in a condo on the beach\n\n[Chorus]\nBefore I turn the lights out\n'Fore I turn the lights out, tell me who the fuck you want to be\n\n[Verse 3]\nWhy they just can't let a nigga be?\nI've been busy, I've been doing me\nHave you thinking I've been with the Zoe pound\nMe and all my niggas come in deep\nOn the ground, young ten toes down\nI can put a nigga on his feet\nI caught the Audi, then I ran the check up\nAnd, I ain't even been out here a week\nGot my shooter playing hide and seek\nJust in case you niggas try and creep\nEverybody wanna be your friend now\nBetter watch the company you keep\nEverybody got they fucking hand out\nSee you eating now they want a piece\nOh, that's Kodak Black, I've been hearing bout'\nHe the hottest nigga in the streets\nIf you love me, love a nigga deep\nWhen you see me, what you really see?\nTo everybody else, I was a sour guy\nBut, I be treating you a little sweet\nI'm so close to showing her my real side\nShow this girl another side of me\nI think we've been getting along real fine\nYou love it when I hit it on the beach\nI've been working hard, ain't got no spare time\nI can't even party on the week\nI'm just trying to see where your head at\nWhen you grow up, what you wanna be?\nRun up on a nigga, where the bread at?\nI be going ham for the cheese\nI just wanna see all of my niggas home\nThey can't wait to get back on the streets\nI just talked to Jackboy on collect phone\nHe told me he ain't trying to take the plea\n\n[Outro]\nFor my niggas, I'll swim across the sea"}]}