{"songs": [{"year": null, "image": "https://images.genius.com/306441a47d61f6f0573172b900c3387e.350x350x1.jpg", "title": "Just a friend - single version", "album": null, "lyrics": "Have you ever met a girl that you tried to date\nBut a year to make love she wanted you to wait\nLet me tell ya a story of my situation\nI was talkin' to this girl from the U.S. nation\nThe way that I met her was on tour at a concert\nShe had long hair and a short miniskirt\nI just got on stage drippin', pourin' with sweat\nI was walkin' through the crowd and guess who I met\nI whispered in her ear, \"Come to the picture booth\nSo I can ask you some questions to see if you're hundred proof\"\nI asked her her name, she said, \"Blah-blah-blah\"\nShe had 9/10 pants and a very big bra\nI took a couple of flicks and she was enthused\nI said, \"How do you like the show?\" She said, \"I was very amused\"\nI started throwin' bass, she started throwin' back mid-range\nBut when I sprung the question, she acted kind of strange\nThen when I asked, \"Do ya have a man?\" She tried to pretend\nShe said, \"No I don't, I only have a friend\"\nCome on, I'm not even goin' for it\nThis is what I'm goin' sing\nYou, you got what I need, but you say he's just a friend\nAnd you say he's just a friend, oh baby\nYou, you got what I need, but you say he's just a friend\nBut you say he's just a friend, oh baby\nYou, you got what I need, but you say he's just a friend\nBut you say he's just a friend\nSo I took Blah-blah's word for it at this time\nI thought just havin' a friend couldn't be no crime\n'Cause I have friends and that's a fact\nLike Agnes, Agatha, Germaine and Jag\nForget about that, let's go into the story\nAbout a girl named Blah-blah-blah that adored me\nSo we started talkin', gettin' familiar\nSpendin' a lot of time so we can build a\nRelationship or some understanding\nHow it's gonna be in the future we was plannin'\nEverything sounded so dandy and sweet\nI had no idea I was in for a treat\nAfter this was established, everything was cool\nThe tour was over and she went back to school\nI called every day to see how she was doin'\nEvery time that I called her it seemed somethin' was brewin'\nI called her room, a guy picked up and then I called again\nI said, \"Yo, who was that?\" \"Oh, he's just a friend\"\nDon't gimme that, don't even gimme that, just bust this\nYou, you got what I need, but you say he's just a friend\nAnd you say he's just a friend, oh baby\nYou, got what I need, but you say he's just a friend\nBut you say he's just a friend, oh baby\nYou, got what I need, but you say he's just a friend\nBut you say he's just a friend\nSo I came to her college on a surprise visit\nTo see my girl that was so exquisite\nIt was a school day, I knew she was there\nThe first semester of the school year\nI went to a gate to ask where was her dorm\nThis guy made me fill out a visitor's form\nHe told me where it was and I was on my way\nTo see my baby doll, I was happy to say\nI arrived in front of the dormitory\nYo, could you tell me where is door three?\nThey showed me where it was for the moment\nI didn't know I was in for such an event\nSo I came to her room and opened the door\nOh, snap! Guess what I saw?\nA fella tongue-kissin' my girl in the mouth\nI was so in shock my heart went down south\nSo please listen to the message that I send\nDon't ever talk to a girl who says she just has a friend"}], "artist": "Biz Markie"}