{"songs": [{"lyrics": "[Hook]\nI'm the jack of all trades, master of one\nBlack and underpaid, blastin this mic gun\nPut it to your temple, and pop yo' pimple\nBreak you down like kempo, I'm trained in the arts\n\n[Aceyalone]\nI specify in rockin my page from the heart\nI dig down deep within my psyche\nInformation excites me, the knowledge invites me\nWhen I, throw on my Nike's and step to it nicely\nHuh, it's unlikely any man could out-mic me\nLightning, please strike me like it did when I was a child\nHit me with a hundred thousand volts and make me smile\nYou name it I can aim it, catch it and tame it, explain it\nTake it and paint it in beautiful technicolor\nDirectly from another place you could expect no other\nTo stand by these trues and break these rules\nWe defy the laws of cool and sang these blues and bring this news\n\n[Hook]\n\n[Aceyalone]\nI'm that hip-hop SPOKESman, I ain't a coke man\nA good folks man, he reached for the mic and broke his hand\nIt's not my problem, it's not my fault\nIt's not my concern, I don't give a shit about\nThem dirty fingers, reachin for the scepter\nAll up in yo' head but I'm not Dr. Lector\nOr Dr. Phil, but I still got to kill\nWhite widdle, black widdle, fat little pill\nTo take for your enjoyment, to get psychadelic\nI don't sell it I spill it out, and tell it so angelic\nMy rap gat makes your brain splat\nBlow up, everything that's holdin up your hat\nIt's firin the pistons gas, in the engines\nFuck a foot in the door, we takin off the hinges\nWhen my, dash is broken, glass is broken\nAnd class is open, and it's still left smokin\n\n[Hook]\n\n[Aceyalone]\nOkay Mr. Pick to Ten, is it sickenin?\nWhat kind of little box you thinkin in? Think again\nDraw a blank, you saw a tank\nBut didn't see my soldiers on the flank movin up another rank\nThe Hip-Hop Hall of Fame went up in flames\nWhen they, mention my name it's tension in they brains\nAn extension of the game and, I stake this claim\nAnd break these chains and this one's for the last train\n\nI'm the jack of all trades, master of one\nAnd the thing I mastered is blastin this mic gun\nPut it to your temple, and pop yo' pimple\nBreak you down like kempo, I'm trained in the arts\n\nWe got one verse left to rock this beat\nAnd seperate the good shit from the weak\nSo, get in the groove, and feel the sound\nAnd once you're inside spread yourself around\nFrom the bottom to the top, top, to the bottom\nI'm, gonna rock 'em, while, I still got 'em\nI rock this hour with style and power\nAnd this, is yo' MC hour\nI don't know if, all of you have heard\nBut it's up to YOU to rip.. {*vocals fade out*}", "title": "Jack of All Trades", "album": "Hip Hop and the World We Live In", "image": "https://images.genius.com/dde48df06ccd165a12ed0bc40d9c736e.500x500x1.jpg", "year": null}], "artist": "Aceyalone"}