{"songs": [{"image": "https://images.genius.com/67716a0c2034f5b43dd35f6c754adcf3.450x450x1.jpg", "year": "2009-04-24", "title": "Going Endless", "album": "Please, Hold", "lyrics": "Look\nI swore I wouldn't say shit\nBut diss a nigga blatant\nCame here from Squaria and then they bought spaceships\nFace it, niggas couldn't see me with lasik\nI'm Keanu in the Matrix, you in The Replacements\nNiggas outline me but nobody can trace it\nCause I ain't nobody but a kid who wore braces\nWith a comic book collection in grandma's basement\nIt's only because of her that I'm still trying to make it\nEvery single night I think, \"Damn, where the day went?\"\nAm I meant for this state or here to make a statement?\nA homebody so being nobody is flagrant\nOn my NES just wishing to save greatness\nThis talent can't be wasted watching other niggas do it\nSuper hero songs, how the fuck ain't I included?\nCause I done worked to hard to see these fuckers act stupid\nRappers who rap, saying they don't listen to rap music\nIt took four years to escape Wichita's grasp\nMe and Lil' Wayne's song helped me get on blogs fast\nFinally in the race but I let all of y'all pass\nLet the mags get you gassed, lit a match and watch you crash\nHa, I slowly drive by and just laugh\nYou Forth Of July hype, it be over in a flash\nI don't expect shit that I didn't work my fucking ass off to get\nThat's why I gotta blast off with this\nChecking my Myspace, subject line says, \"Vizzy\nKnow you get this all the time, but I hope that you read me.\"\nSo I read it\nYou know what it says?\n\"I rap and I'm the best, check my page and you'll believe it.\"\nThat's when I seen it all\nFlashback to '03, me and Bling handing out mixtapes at the mall\nThat's when I noticed that I've gotten really far\nThey didn't believe in me so how can't I believe in y'all?\nNow I'm on a level, dudes on labels on my songs\nFans write back like, \"I didn't think you would respond.\"\nNah\nI ain't high, the ground is what I'm on\nAnd where I plan to stay and plan to lay when I'm gone\nLeave my pain on the stage everyday that I perform\nAnd pray for a parade in the state that I put on\nI stay strong though they sending mixed messages\nCause when the movie ends, I'm always discredited\nBut I chill, no sedative\nI'm an acquired taste like fetishes\nI tell 'em \"hush\" while I huff and I puff\nTill I blow down the door or you could just let us in\nBut they won't cause that's too easy\nBut the hard road will make you strong though, believe me\nI just felt a blow of wind on my back\nIn a soundproof booth, I hope my grandma is back\nI need you here\nNow more than ever\nCareer is in a jigsaw, can't put it together\nLike the Molemen who never got 'em completed\nCause they didn't have the time or started losing the pieces\nSo before I lose my mind I try to get right with Jesus\nMy mom is so religious sometimes I just don't believe it\nCause I will pray for money, for gas then church had ended\nAnd I would see the ministry drive away in Benzes\nThe pictures different if you looking through the lenses\nOf a dude who's probably been bit more than a dentist\nI could go on Z\nYou can see the list is endless\nBut I'mma stop here yo, I'm finished"}], "artist": "XV"}