{"songs": [{"album": "Thrillionaire", "image": "https://images.genius.com/46e9e0e8031956b09a6f5e3db332d585.1000x1000x1.jpg", "year": "2012-07-09", "title": "Oh Shit!", "lyrics": "[Hook]\nIm that dude\nIm im that dude\nThat got your girlfriend to get my name tattooed\nName tattooed na na name tattooed\nAnd her girlfriend got the same tattoo\nIm that dude\nIm im im that dude\nThat got your girlfriend to get my name tattooed\nName tattooed na na name tattooed\nAnd her girlfriend got the same tattoo\n\n\n[Verse 1 : Pricetag]\nLook\nYour girl got my name tatted on her skin now\nTramp stamp you can see it when she bend down\nDudes hate, it ain't concerning me\nShe got me branded like she joinin the fraternity\nAnd imma star you looking for me better point far\nCombined whips call it joint calls\nTwo girls with my name call them joint stars\nBut i let your girl play the one like the point gaurds\nAnd when i call her mammi she say pappi back\nYou gettin dirty money sloppy stack\nShe got my name on her neck where they toppy that\nAnd her friend got it too i call her copy cat\nAnd i dont have to say a word cause its my game\nSo when you kissing on her neck you kissin my name\nAnd this the BOW life we dont care how he feels\nHe lookin for the one we tell em T.Mills\n\n[Hook]\n\n[Verse 2 : T. Mills]\nSpark my OG call you Lisa Leslie\nIm a mothafuckin king Wayne Gretzky\nIm a mothafuckin king Elvis Presley\nAnd my name on your body looks so fucking sexy\nSix letters wrapped around your wrist\nThese six letters got these bitches whipped\nIt T.Mills million a milli though\nYou know who i am pretend you really dont\nThats so silly girl with my name on ya\nWhats yours? But tonight your names Tanya\nHonered to be on you thats the way it looks\nLet me slam you from the cram you like a college book\nUh we some Audio Push-Ups\nGirl who wanna meet us so eager just to ink us\nDeicated gettin naked girl lets go to work\nListen while i beat her so its fuck what you heard\n\n\n[Hook]\n\n\n[Verse 3 : Oktane]\nI snatch your girl i got the game how you feel ?\nI said what's your name? I'm Oktane ? What's the deal ?\nAnd she said her name was Jane an from then i had to kill\nNow she ain't wearing nothing but my name and some heels\nTatted from shoulders down like im suppose to do\nSo when i step in i suggest you hold her close to you\nAll i do is show her how a magnum trojan do\nAnd She got my name blasted cause i told her to\nShe saw me she saw me inked down\nCaught the wave now i gotta get my sleeves now\nThey asked who made her do it\nThey tell them O did\nHer man saw my name and he said oh shiitt!\nAnd i ain't really care cause baby im that rude\nI ain't know her name i just call her mine too\nShe got my name tatted on her cause im that cool\nAnd if your man got a problem with that bomb tattoo\nTell' em\n\n[Hook]"}], "artist": "T. Mills"}