{"songs": [{"year": "1994-10-15", "title": "U Better Recognize", "image": "https://images.genius.com/91c0d38ef9d189fc23cc711c66e07ebf.600x594x1.jpg", "lyrics": "[Verse 1: Sam Sneed + (Dr. Dre)]\n(I heard Sam was goin' solo)\nHot damn, you didn't know, so?\nWell, I can blast fast or freak an ill type of slow flow\nI'm hittin' harder than Barry Bonds, so check the golden child\nThrowin' it to your ear-hole, got you goin' buck wild\nWith truck-tracks, rhymes on deck, breakin' off niggas proper\nDid dirt, dipped West 'cause I clown coppers (Yeah)\nDo hip-hop, rap, compose 'em, most 'em couldn't see me\nMad advanced in my skills, I'm all about the dollar bills\nFrom Pittsburgh to Cali, droppin' bombs like that\nWas on the D.L. with the squad, so I couldn't hold it back\nBlack, I regulate, I bust a big gate figure\nMobbin' with that ill nigga with his finger on a bigger trigger\nServin' all (saps), hittin' sevens on the (simps)\nMakin' dough, eatin' shrimps, locin' with some real pimps (Yeah)\nSo peep game, best believe I love my peeps\nThat's why I make the type of music you can pump in your jeeps\n(That's right)\nSo bust my sound, I put it down for the underground\nI got the women 'cause I'm slammin', jammin'\nGot it goin' on, it's time for this new producer to rise\nSo open your eyes, I think U Better Recognize\n\n[Hook x2: Dr. Dre]\nOnce again, it's the man with the master plan\nThey call him Sam and I think U Better Recognize\n\n[Verse 2: Sam Sneed + (Dr. Dre)]\nI remember days on the blocks\nWhere I slang slung, played punk cops\nAnd mad props 'cause I ran with hard rocks (Yeah)\nFrom 8-Balls to O-Z’s, I made G’s (Say what?)\nThen built up enough loot to buy keys\nNo gang affiliation, yo, I stood on my own two, pullin' capers\nI'm a sneaky slick nigga, I never had to pull the trigger (Right)\nI mack, on top of that, I'm used to stayin' wicked, which is 24/7\nYou can ask my ex-hooker\nBut now I'm on some new improved shit\nMakin' hits, stackin' chips, now everything's legitimate\nI flipped the script a long time ago, on the five-o\nWhen I discovered this new way to make my cash flow (Mmm)\nYes, indeedy, I wasn't greedy, got my niggas out the gutter\nNow they're rollin' with the Sam Sneezy\nHip-hop fanatic causin' static in the industry\nThese whack creators, I call 'em imitators (Uh, yeah)\nBe tryin' to see me\nBut see, I'm unexplanatory with the fame and glory\nThat's why I gotta tell my story\nWith no disguise, a lot of niggas despise me\nBecause I'm on the up-rise, so I think U Better Recognize\n\n[Hook x2: Dr. Dre]\nOnce again, it's the man with the master plan\nThey call him Sam and I think U Better Recognize\n\n[Post-Hook x2]\nUh, yeah, uh, yeah\nThink U Better Recognize\n\n[Verse 3: Sam Sneed + (Dr. Dre)]\nWell, I'm back in the mix with a bottle of Hennessy\nSo fire up a blunt, who's ever in the vicinity\nCrazy shout-outs, givin' pounds to all my niggas\nHittin' all the hookers by the dozen 'cause they dig us (Trick)\nFuck what you heard, recognize what you be seein'\nThis down-to-Earth, true-to-the-game human being\nI'm that little beige nigga tryin' to get mine, fuck a nine\n'Cause I'll incline with the mastermind\nI got my crew in my corner so I can't lose\nPlus, I'm payin' mad dues in this record biz, I don't snooze\nAnd suckers be poppin' that ol' idiotic egotistical type of flimflam\nI can't be faded, Sam-I-Am\nBlendin' with the hustlers\nNever dealin' with them knucklehead ballers\n'Cause boys play with toys, and scholars play with dollars\nI'm a mack on my own right, plus my game is tight\nBaby, get it right, I ain't the one, so take flight\nBitches give me mad rhythm, but their brains are off-tempo\nThinkin' they can get my loot, I never trip to knock the boots\nI gotta be wise when time to dip between the thighs\nAll eyes on the prize, so I think U Better Recognize\n\n[Hook x4: Dr. Dre]\nOnce again, it's the man with the master plan\nThey call him Sam and I think U Better Recognize", "album": "Murder Was the Case - The Soundtrack "}], "artist": "Sam Sneed"}