{"artist": "WC", "songs": [{"year": null, "lyrics": "\"Man, Dub, I don't even think they even believe in the Barracuda, Man!\nI think they doubting!\"\n\nBasslines affect me, niggas respect me\nCause my flows is deadly and I'm a Connect G\nAnd they know I'm ready cause my gun's directly\nRight where their neck be and I'll make the TEC breathe\n\nClimbing out of the manhole\nWith three creases in my flannel\nThe party's over, blow out the candles\n\nBitch niggas to the back\nThrow your hands up and guard yours\nCause in the front I just wanna see the hardcore\n\nNow look, ninety-nine point nine point nine per cent gonna be all on my dick\nLike I spit when I drop this shit\nThat other 1 per cent is gonna be yelling \"Boo!\"\nOn the Internet talking shit and hiding like you\n\nFaggot ass niggas\nAiming the thing, thing to leave you brainless\nSnatching bikinis off you fake gangsters\n\nSpank you, bank you lamesters all you all pranksters\nImpatiently waiting to shank you I've been so anxious\nNigga back to grip the pistol ripping a (shut your mouth!) instrumental\nStill that four fingers up two twisted in the middle\n\nRound two letting off another round fool!\nHere comes Sasquatch in a pair of blue house shoes\nWC, crashing kicking the glass, back at last\nAnd all y'all can kiss my crusty black ass\n\nI'm on some other shit\nTwo thousand and ten star child with the gauge bailing out the mother ship\nGot a gang of weed and I'm a smoke all of it\nTwenty years in the game and I ain't even started yet\n\nStocking caps, Chucks, that's the WC starter kit\nWho want to see me on this walk twenty thousand start the bid\nA double-O schizo at my own concert\nIn the bathroom ask a nigga what they hitting for\n\nAnd if I crap out then nigga clear the floor\nCause I keep a .44 down to make sure they getting low\nThe kind of nigga pumping fluid in a '64\nYelling fuck security! shooting up your disco\n\nGo broke? Shit no!\nIt's either rap or pitch dope\nThat's why every mic booth I heat it up like Crisco\nI'm in the Crips Ford XT tipping slow with your baby mama\nPulling up to the liquor store\n\nOut of South Central\nMe and CT the West coast audio two time villain like Gizmo\nWC spit the kill flow\nAsk Game ask Kurupt who the big homie that can still go\nGet with Dub? No for real Loc you got a better chance of\nStevie Wonder making a fifty yard field goal\n\nRough like Brillo, head real low\nSend my love to Cool J but ladies love me like a dildo\nDub a kill mode, sleep on me if you want\nI'm like a loaded gun with the safety off under the pillow\nRags, braids, sets in the air\nI represent all that ignorant shit you niggas scared of\n\nGot a big stack, Ds on the Cadillac\nBut fuck the brag rap I spit the brown bag rap I'm that\nDisrespectful ass nigga twisting on a zag\nWalking in the club smacking bitches on they ass\nAnd got a rusty corkscrew and broken OE bottle\nJust in case the brave nigga with her want to play Geraldo\n\nBullet tips hollow\nDub will make your head bobble\nGhetto artist draw from the hip like Picasso\nI'm Picasso in a hanky-patterned house robe\nKnown for drawing two barrels that blow like nostrils\n\nDub's out of control and got a lot of flows\nKeep the Rosé bitches __ __ __ __ __\nLooking for some cash Rat? Take your glass back\nCause over here a nigga's nasty like ass crack\n\nTurn your hearing aid up what's wrong with you?\nIf you ain't sucking of fucking tonight you got the wrong nigga\nI'm in there doing a lot of things your nigga won't do\nLike putting you on a highway with a gang of niggas on you\n\nThem other rap niggas trick a lot of loot\nI just want to fuck you and break you\nAnd treat you like a prostitute\nAnd I don't want to kiss, I just want to touch the enz\nDub the gutter kid motherfuckers know what it is\n\nThe ground pounder, Chevy scraper after the paper\nAnd in a squab' I'm good with the hands like a masturbator\nSmashing haters, cater to niggas who sag in Taylors\nGang sign translator, sucker nigga assassinator\nThe casket layer, 'hood navigator\nLook what you done gone me on Toones\nYou should have never grabbed the fader\nHarassinator, Wester with nav crusader\nLike Mayweather I'm tired of messing with you bums\nI'm moving my weight up\nI 'K you slay you spray you put your spirits in a cloud in the air\nHave your body on the ground surrounded by flares, see?\n\nIt's back to the basics, so I'm closing my book\nWith laughter, and putting a lid on the chapter\nAnd all you sentimental rappers\nTake money, take pussy, fuck all that soft shit\nI'm capping at your car Bitch, y'all niggas garbage\n\nDub the urban vet Mandingo fuck with me I'll have\nYou leaving the fight limping with your turtle neck wrinkled\n\nI know it's a couple of niggas that can swing 'em\nBut show me a nigga with muscles I show you something that can shrink 'em\nDirty ones, big ones believe me I ain't scared\nDub will pick one, any one, got 357 of 'em\n\nNah, what's really what's cracking\nI'm really with a TEC and\nReally with niggas gattin'\nDon't be talking loud but really be rapping\nReally the fact is the nine milli' I really be packing\n\nCause y'all all lights and cameras I'm ready with the action\nWhen I'm on? No this is really just a fraction\nA freestyle for the top of the year\nLike Primo I'm calling it a Premier\n\nBut don't worry the Barracuda's back taking the room\nWC and Crazy Toones motherfucker stay tuned!", "image": "https://s3.amazonaws.com/rapgenius/1365792063_12686799_ori.jpg", "album": null, "title": "Frontline"}]}