{"songs": [{"year": null, "image": "https://images.genius.com/5db6770bf253d202a73f43e8ce8e427e.800x800x1.jpg", "title": "Preface", "album": "Fat Boy Fresh, Vol. 2: Est. 1980 ", "lyrics": "[Verse 1: Rapper Big Pooh]\n\nCame to a fork in the road\nI decided to go left\nThis is gravel uncharted for me\nUntil I'm on my last breath I'mma push on\nMomma yelling be strong\nGot to provide her with fruit\nSpoils of my loot through this industry\nSearching for a way out becoming my own enemy\nThe inner me is way out of alignment\nI wasn't raised in this type of climate\nI'm okay being an outcast\nWhere these women trying to out ass\nAnd niggas trying to out cash each other\nMy goal was simply outlast\nBut I lost to many brothers\nNow I got to question if I want it\nEvery day I'm waking up\nI've arrived to the point where I do give a fuck\nCause many going to criticize what some can truly do\nI'm honored to be apart of the few\nIts Rapper\n\n[Hook: Blakksoul]\n\nTurn on the lights\nGet this chip up off of my shoulders\nTried to weigh me down never count me out\nThis game is far from over\nOpen your eyes\nKeep it moving on the same train\nNew motivation with the same lane\nThey'll never crutch me with the same cane\nOpen your eyes\n\n[Verse 2: Rapper Big Pooh]\n\nMoney running low\nConfidence lower\nI thought it got easy as I got older\nA man with pride I don't need a shoulder\nTo lean on as I'm listening to phenoms\nSeeming like I'm eons from ever shining\nGetting my just do forever grinding\nNot exactly comfortable where I am\nAnd when I finally get there I'll probably want more\nI've never been content with just trying to score\nFilling up the stat sheet\nRunning like a track meet\nWhen cats meet the humble man wins\nI guarantee you that you need him in the end\nSo now you understand the cold demeanor when you see me\nI'm a King upon the chessboard\nYes Lord\nThese niggas is trying to do their best Lord to test\nBut that bullshit don't impress me\nIt's Rapper"}], "artist": "Rapper Big Pooh"}