{"artist": "A$AP Ferg", "songs": [{"title": "40 Below", "image": "https://images.genius.com/c9440ee0b76ac4cc57b13638e1b04b1b.500x500x1.jpg", "album": null, "lyrics": "[Hook]\nIt's cold in the winter, baby\nAnd I don't know when I'm coming home\nThe moon is shine, under the sun\nLet me walk, you can run\nSomething tells me you're not the one\nMaybe you just don't understand\nSo why you wonder where I keep my gun\nIt's in my 40 Below's\n\n[Verse 1]\nI like chicks in spandex and lumberjacks\nNo hat to match, razorblade in the doobie rack\nJust in case a bitch act, she get her wig pushed back\nCatch a fucking bullet like Warren Sapp\nCause she stay with the mac, and fuck a backpack\nShe rather roll up on 5-6 and headcrack\nAnd her mom always catching fucking heart attacks\nTalking 'bout, \"Fuck D Ferg, he ain't worth splat!\"\nCause I dropped out of school and I drop slack\nMissed work, gotta get up and hear my moms yap\nJust 7.15 ain't doing it\nSeeing niggas chrome-out 6, and they doing it\nYou see the street got corners and they using it\nMomma told me not to be a fool and don't loose the shit\nIt's cold, 40 below, gun in the boot and shit\nReady start shooting shit, like I'm Bishop Juice'n it\nAnd you don't want to end up like Steve\nWith steel to your grill because you didn't wanna fucking peel\nShit is real that I kick, I'm dead broke\nCan't afford to smoke so I get high off of lead choke\n\n[Verse 2]\nHave you met Mr. Lee, oh, you gotsa meet her\nBack shots off the meter and the hair adds to her features\nShe don't wear sneakers and she don't like reefer\nClassy-ass bitch and she know when I kiss her\nLove when I pull her hair low when I beat her\nHit it from the back and she sing like Aretha\nFirst black nigga that she ever pursue\nShe loved my dick game, and chilling with the crew\nIt's true, we met back in junior high school\nBut didn't pursue to knocking boots, but she the truth\nSo I respect her, Beretta in the lever\nJust in case a bitch is getting clever, however\nShe do what I tell her, make me a grilled cheese\nShe ask, \"Babe, swiss or mozzarella?\" She 'bout tell her\nVersace hottie mami grimy with the body\nBut won't hesitate to drop a body for her papi\n\n[Hook]", "year": null}]}