{"artist": "Bow Wow", "songs": [{"album": "The Price of Fame", "title": "Bet That", "year": null, "lyrics": "Intro:DamnSay lil mama what u need to do is drop that lame and come get wit a fly nigga like meThats what I do 24 7 365 a year ya dig (ha)Verseone:Baby u ain't neva seen it done like me (bet that) im da b and I dont lie I be( comin down da block and comin comin down da block and comin comin down block in everything thats fly)(uhn)Im so fresh so clean when I walk through sceemin on da crowd for a shawty I could talk to (where she at) im wit da team and we came to spend green and we on every hot thing that came into the scene gotta bag full of money and a porche on da room a store close deal popper poppin tags on a sunday tell them other lames they'll probly catch up one day im livin for da weekend and they just gettin to monday diss boss in a rose royse two tone break ride da phantom only fromTues. to thursday dudes pointin sayin ay! dem dudes dont play! yeah yall kno what it is dats so so def way hay! ain't nuttin chamge but my age and my pay get da girls to da cribs and they always wanna stay and they know I got money but I neva gotta pay ima big boy playa all I gotta say is babyChours:U ain't neva seen it done like me (bet that)over here is where u really wanna be (bet that)I ain't wit da boom im bout my money\n\nWhen I do what I do its thursday to sunday(bet that)u ain't neva seen it done like me (bet that) im da b (b) and I dont lieI be comin down da block and comin comin down da block and comin comin down da block in every thing thats flyVersetwo:Now dis two seaters in my garage lamb is a farra dis watch wus audemar before da upgrade song (haha)I got g's in da bag wit da g's all on it gotta castle for da crib I spit cheese all on it hay! im everwhere them other dudes dont be around at da game close enough to grab rebounds im in town on a friday gone on a saturday back on a monday was home about one day who else you know is cooler than a fan that can plan get a weight trip chillin on that all black sands im gettin tans in da winter time chefs when its dinner time won't be seen around wit nuttin less than a dime I got the game on the slang in the language left in a range and came back in a vanquish I got accounts on accounts thats amounts on amounts at any different time I can bounce out (uhn)Chours:\n\nVersethree:Now what day of the week is it (I dont know)it dont even matter I dont even hear them dudes with the whispers and the chatters I be gone in that o7 starin and exceleratin jumped in da wheels and I can't keep the pedals watin celebratin ever single chance that I get to make them other girls pissed off when im wit u seen that side hate at the mall that we went to u seen what I spent boo thats a life issue I play wit it everything stay kitted got that 59 50 on that broke ass fitted it be like that man get it still black card limit when its time for some action all da girls be wit it thats my lifestyle girl im da one you wanna holla at forget yesterday im cool enough to bring tomorrow back and you can see thats why ya eyes all swole you ain't gotta front I kno you wanna roll causeChours:", "image": "https://images.genius.com/aaeccb678c5c9313bc6b49f17af6c3b4.1000x1000x1.jpg"}]}