{"songs": [{"year": "2017-07-14", "image": "https://images.genius.com/2aa8c09e7f1f4978eee0c17ea9097aac.1000x1000x1.jpg", "title": "Ballin’", "album": "Golden Era Tourtape ", "lyrics": "[Part 1: Manuellsen]\nGoldener Zeitmesser mit Schweizer Uhrwerke drin\nIch hab' schon Rapper gefickt, da war'n noch Schnurrbärte in\nDigga, M-Punkt, zeig mir Gangsterrapper und ich klatsch' sie\nDigga, ein Box, du siehst Sterne wie im Taxi\nDer Scheiß killt, Freestylerapper bücken sich zu tief\nJeder weiß, Manuellsen fickt Mütter zu Musik, yeah\nIch weiß nicht, für wen du dich hältst\nDigga, komm vorbei, die Glocks geladen wie 'ne Duracell, Nigga\n\n[Part 2: Kollegah]\nAh, yeah, sold out Gigs, yeah\nEs gibt Action, wenn wir die Halle stürm'n (aha)\nKoree ist am backen wie mein Cavalligürtel\nAlpha ist 'ne Bruderschaft wie'n Tempelritterorden (aha)\nUnd ich führ' das Imperium wie Anakin Skywalker\nIch verschenke wieder Ketten an Supporter (yeah)\nManche Groupiehoes sind stressige Stalker wie Presseteamreporter\nWollen Backstage mit dem Baller (verpisst euch)\nAm besten direkt Kettensägenmord oder Messerstich direkt in die Aorta (Bitch)\nDas Tape ist oldschool wie Kassetten im Recorder\nBitch, ich häng' rum mit M-Punkt in den Ghettostreets am Corner\nDas ist NRW, hast du hier große Fresse wie ein Orca\nIst der Manuel getrigged wie Nintendospielcontroller\nEyo, wir liefern heißen Stoff wie Jason Statham in Transporter\nAlso mach's wie meine Putzfrau, staub den Legacy-Award ab\nAch, und dieser Ferris ist so hässlich wie ein Ork\nEr kriegt jetzt Dresche in die Fresse und sieht besser aus als vorher\n\n[Outro: Koree & Kollegah]\nEy, Leute, schon wieder 'ne 500-Euro-Versage-Brille rausgehau'n oder was? Ganz ehrlich, ist übertrieben oder?\nKoree wir sind am ballin'\nUnd dann noch die Ketten, Alter, ich weiß gar nicht, wie viele Ketten du mittlerweile verschenkt hast, aber das sind echt nicht wenig! Warum? Also ...\nKoree wir sind am ballin'\nUnd dann noch die Shirts jedesmal. Bei jeder Show haben wir so viele Shirts rausgehau'n wie an Karneval Kamelle. Das ist ein bisschen too much oder?\nKoree wir sind am ballin'\nIch mein' wir sind mit zwei Nightlinern unterwegs und drei LKWs, das kostet doch alles Geld, also ... übertrieben!\nKoree wir sind am ballin'\nIch würd' einfach mal sagen, guck mal, dass du irgendwie die Kohle zusammen hältst, ja. Also Geld haben kommt nicht von Geld ausgeben! Also ... das ist einfach übertrieben, was ihr...da abgeht. Alle hauen raus, hier dies, das. Ich mein', hast du überhaupt noch Klamotten im Koffer?\nKoree wir sind am ballin'"}], "artist": "Kollegah"}