{"songs": [{"image": "https://images.genius.com/8038e26a40fa05badbbb5cfd05847daf.1000x1000x1.jpg", "title": "Mr. Me Too", "album": "Hell Hath No Fury", "year": "2006-10-01", "lyrics": "[Produced by The Neptunes]\n\n[Intro: Pharrell]\nYou know we back, right?\nClear the streets out\nCome on with it, ha-ha, Star Trak\n\n[Verse 1: Pharrell]\nNiggas is haters, I'm doin' deals like the majors\nIce Cream sneakers, I signed my first skater\nSo you can pay three and buy yourself some Bapestas\nBulletproof under t-shirts because they hate us\nDo like Snoop say step, your game up\nDouble-decker boat nigga, Meditterane up\nD-Class Asscher cuts, tuck your chain up\nLiberace fingers, niggas hit Lorraine up\nJust last week, I was out in Aspen\nMe and Puff hoppin' off the plane, both us laughin'\nA week before that, I was out in Italy\nItalian heart throbs could not get rid of me\nUp in Donatella's crib, me and like ten hoes\nCall from the cell phone, \"Gimme that Enzo\" (yessir)\nI know what you thinkin', \"Yeah, me too\"\nOkay, everybody meet Mr. Me Too\n\n[Verse 2: Pusha T]\nBeen two years, like I was paddy wagon cruisin'\nThe streets was yours, you're dunce cappin' and kazooin'\nI was just assumin' you'd keep the coke movin'\nBut I got one question, fuck y'all been doin'?\nPyrex stirs turned into Cavalli furs\nThe full length cat, when I wave, the kitty purrs (meow)\nAll my niggas caked up, sellin' gray and beige dust\nHad that money right or end up in the trunk taped up\nWe don't chase and duck, we only raise the bucks\nPeel money rolls 'til our thumbs get the paper cuts\nChill, retardo, South Beach Gallardo\nTeals started up, go brrr like it's Nardo\nWomen, if you love me, please let me know\nTie rags 'round your neck and learn the sets we throw\nThese are the days of our lives and I'm sorry to the fans\nBut them crackers weren't playin' fair at Jive\n\n[Hook: Pusha T and Malice]\nI know, I know, yep, yeah, you too\nOkay we get it, yep, yeah you too\nI know, I know, yep, yeah, you too\nOkay, everybody meet Mr. Me Too\nI know, I know, yep, yeah, you too\nOkay we get it, yep, yeah you too\nI know, I know, yep, yeah, you too\nOkay, everybody meet Mr. Me Too\n\n[Bridge: Pharrell]\nI know what you thinkin' why I call you \"Me Too?\"\nCause everythin' I say, I got you sayin', \"Me too\"\nI say I got a Benz, so you said, \"Me too\"\nYou hangin' out the window so they can see you\nBut you ain't hangin' out the window when you in that G2\nOr that G3 or G4 like we do\nStar Trak, Clipse, Malice, come on\n\n[Verse 3: Malice]\nWanna know the time? Better clock us\nNiggas bite the style from the shoes to the watches\nWe cloud hoppers, tailored suits like we mobsters\nBreak down keys into dimes and sell them like Gobstoppers\nWho gon' stop us? Not a goddamn one of you\nMean with the Re-Up, nigga, we street tumblers\nIvory white, yeah that's the same color\nOf the 'Zure, nigga, best believe it's the Mulliner\nTake no prisoners, rap niggas are whisperers\nChoke on your own spit just as soon as you mention us\nChampagne corks, kicks by Louis sports and\nKeep my hoes in Pucc' and Charles Jourdan, uh!\nCop it, chrome it, touch-screen component\nMink on the floor, make you hot, don't it?\nYou don't wanna know what the fuck I spent on it\nTomorrow ain't promised so we live for the moment\n\n[Hook: Pusha T and Malice]\nI know, I know, yep, yeah, you too\nOkay we get it, yep, yeah you too\nI know, I know, yep, yeah, you too\nOkay, everybody meet Mr. Me Too\nI know, I know, yep, yeah, you too\nOkay we get it, yep, yeah you too\nI know, I know, yep, yeah, you too\nOkay, everybody meet Mr. Me Too"}], "artist": "Clipse"}