{"artist": "R. Kelly", "songs": [{"album": "The R. in R&B Collection, Vol. 1", "year": "1995-12-11", "lyrics": "[Intro]\nDown low, down low... down low, down low\nDown low, down low... down low, down low\n\n[Verse 1]\nYou say you want me, but he needs you, baby\nTell me, what am I gonna do\nAbout this fuckin' threesome love affair?\nIf Mr. Biggs comes in and catch us, oh my goodness\nHe'll be freaked when lookin' at your pretty titties in the air\nSomething about the way you switch that ass\nWhen you're with him, looking at me\nI can't believe he trusts us like he do\nBloomingdales and all that shopping, taking trips\nWhile I was knocking, ain't no secret\nWhy I'd end up loving you\n\n[Chorus]\nDown low, down low (Keep it...)\nDown low, down low (Gotta keep it on the...)\nDown low, down low (Creepin' on the...)\nDown low, down low (Nobody has to know)\n\n[Verse 2]\nSecret lovers, undercover on the DL\nGetting busy in the back of his Mercedes every night\nAnswers the phone when he goes home\nAnd let him know that everything is A-OK\nOh baby, damn this shit is tight\nPassing blunts to one another on 3-5th Street\nAs you reminisce and tell me what he used to do for you\nYou making plans to be with me while he's at home\nMeet you at college, if you want me, baby, this is what we do\n\n[Chorus]\nDown low, down low (Gotta keep it on the...)\nDown low, down low (Creepin' on the...)\nDown low, down low (Gotta keep it on...)\nDown low, down low\n\n[Verse 3]\nDom Perignon is what we're sippin'\nWhile we're trippin' on the fact that he's not here\nIt turns us on in every way\nYou say you stashed away some money for us\nWhen you leavin', oh Lord, tell me\nWill I live to see another day? (See another day...)\nI tried my best to walk away but every time I think about\nThat sweetest love you're givin' me, I hesitate\nHe's out the front, I'm in the back\nI locks the front, he's in the back\nAnd I'll be damned, that silly bitch is screaming \"rape\"\n\n[Chorus]\nDown low, down low\n(Yeah, that's what ya get for that down low shit)\nDown low, down low\n(That's what I kept telling myself)\nDown low, down low\n(Out of every woman in the world...)\nDown low, down low\n(...you had to go and mess with Mr. Biggs' girl)\nDown low, down low\n(That's what ya get for that down low shit)\nDown low, down low (Ho, yeah)\nDown low, down low\n(Niggas, don't be thinkin' you can keep creepin')\nDown low, down low\n\nBecause what goes around comes right back on around again\nYes, it does, oh-oh-oh-oh-oh-oh-oh-oh-oh\nOh, oh-oh-oh-oh-oh-oh-oh-oh-oh (Kelly, keep it on...)\nAnd sometimes you get lonely, yeah\nYou get lonely, oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh\nAnd sometimes you wanna call somebody up and tell them to come comfort you, yeah\nOh-oh-oh-oh-oh-oh-oh-oh...\nOh-oh-oh-oh-oh-oh-oh-oh-oh-oh... (Keep it on...)\nYeah\nAnd it feels good when...(Kelly, keep it on...)\n(Down low, down low) It feels good when a woman...\n(Keep it on...) ...comes in and... (Down low, down low)\n...takes over things... (Kelly, keep it on...)\n...and says to you... (Down low, down low)\n...'Are you hungry, baby?'...", "title": "Down Low (Nobody Has To Know) (Live To Regret It Mix - Uncut)", "image": "https://images.genius.com/7a445d455857d77f8df692f98c93b2dd.800x794x1.png"}]}