{"songs": [{"image": "https://images.genius.com/b7b393f78ee77ed54e14650b402403a6.770x768x1.jpg", "lyrics": "[Verse 1: Mac Dre]\nOnce upon a time, before I had a seed\nI was on the block with rocks and hella bags of weed\nI’ve calmed down, used to live savagely\nHurt feelings, killings, a lot of tragedy\nOnce upon a time, I had everybody mad at me\nHaters wanted to see them winning, rather me\nGradually, I started having cabbage, see\nAnd only my real folks was glad to see me\nMD, doggin’ and doin’ it\nStaying true to the game, and never ruin it\nYou need nothin’ else but me on the menu\nIt’s Crest shit, Dubee, continue\n\n[Verse 2: Dubee]\nWe went from cookin’ and joogin’ that crack sack\nStrappin’ a backpack to blappers that rat-tat\nLet your boy state the pure facts\nEver since a nitwit, me and my niggas been wit’ this\nRunnin' wit' [?], marksmen don’t miss\nAnd this shit, got me to the point I can’t help but do my thang\nSlang mills, chops with the Furl, spinnin’ circles ‘round you lames\nThese cutthoat niggas came to snatch a stack of racks in flame\nSnatchin’ everything in the way, a punk rock gon’ save\nMy work knock always, scrilla grit getta, sick nigga\nBlappin’ a chop four-clip spitta, go get your clique, nigga\nI’m hollerin’ ‘yo ho ho’ with this pimp-a-lish heem\nJ. Diggs, tell these cats what I mean (What you mean?)\n\n[Verse 3: J. Diggs]\nIf you knows not who I’m kin to\nThen you knows not what I been through\nYou knows about the Romp? Then you knows what I be into\nIf you ain’t knowin’ ‘bout Dre, you probably don’t know Coolie\nChances is you ain’t knowin’ about Diggs, Dolla and Dubee\nDouble up like a doolie, I show you who my crew be\nRun off in your neighborhood, Crestsiders make a movie\nPut my gat where your ass at, face where my mask be\nGangsta ass nigga puttin’ nothin’ fuckin’ past me\nGot a question? Better not ask me\nTuck you in my backseat\nLeave you all muffled like a nigga ridin’ wit’ bad beat\nIt’s Diggs, dude, north side of the V\nAnd brought the Unda Dogg, another nigga ridin’ wit’ me\n\n[Verse 4: Coolio Da Unda Dogg]\nShit gettin’ sticky, it’s very tricky how these streets’ll lock us up in this game\nFor riches and fame, so bitches jock us, slangin’ that ‘caine\nBodies get slain, hoping the cops don’t pop us, breaking through chains\nAll in the hood, ducking helicopters, hard to maintain\nWe gettin’ chains, I keep them hater-stoppers, nickels and bows\nFor my foes, no love for baller blockers gettin’ a grip\nIf we slip, then that’s the end of it\nCrossed by a snitch, so now the Feds got wind of it\nTaking for granted nothin’ on this planet, I’m tryin’ to get paid\nLawyer fees to manage just in case the police raid\nBitches come a dime a dozen, never tripped on hoes\nYou pussy-whipped on yours, that’s why you flipped on yours, nigga", "year": "2004-07-20", "album": "The Genie of The Lamp", "title": "Crest Shit"}], "artist": "Mac Dre"}