{"songs": [{"year": "2014-07-16", "title": "Marbles", "image": "https://images.genius.com/b41ee3757a64965e45de3b27b7b6709a.500x500x1.jpg", "lyrics": "[Intro: Russell Westbrook]\nWhat?\nBro, what are you talking about man?\nBro, I’m out man, ya'll niggas trippin’\n\n[Interlude]\nAh, ah, yeah\nYou can’t get paid in a earth this big\nYou’re worthless, kid\n\n[Verse 1]\nI was taught to love the enemy that’s word sworn like a first born\nAnd that grass grow from a dirt lawn\nWhen daddy said he was leavin’, did it hurt mom?\nWait, wait who the fuck is this new nigga on her arm?\nThey call him shorty I’m a shorty damn near his height\nYou get outta the car you hitchhike, you ain’t ridin’ with us\nYou can die my nigga, I don’t care if I’m 5 my nigga\nBut everybody like you except me and you trynna accept me\nShit it would be easy if you bribed a nigga\nCartoons on Massasoit turned to a vantage point\nI just wanna see the world rotate\nFirst time I saw the moon shine never stayed up so late\nAnd we watched in a box while jumpin' in the bed in our socks\nHe pulls in the garage and he yells for Taj to come out\nI, look around and go downstairs, ‘cause even if I don’t wanna go I know that my momma wouldn’t allow it\nGuess we ridin’ around then\nHe took me to the store and told me that he got me\nAnd then I started pickin’ out shit, glass cut, inside Gold\nAnd a sphere so it rolls, it looked like a bunch of globes\n\n[Chorus]\nWe're all formless\nShapeless, flowin’\nForeign orbit\nStarlight, sparkle\nAncient fossil\nFlaws with marbles\n\n[Verse 2]\nI guess I get to see the world rotate after all\nThe big one is my shooter, like he had to ball\nShorty is the man to me now, but we had it all\nIn front of El Grand he made a nigga take his jacket off\nYou owe him money, better have it all\n‘Cause you comin' with half, let's just say that that's something he won’t have at all\nFor salary, people hustle like Cassidy\nI just got a new Casio and a karaoke machine\nNow he ain't have the law, but he just know the system\nI line my marbles up and I can see the solar system\nThey think I’m playin’ in the dirt, how naïve\nGot into my first fight, and he lost his front teeth\nShorty taught me a cool handshake and I thought we made it up\nGot to high school and realized we was just shakin' up\nI see my reflection when I look into the heavens\nMarbles in my pocket while the sun is settin', settin'\n\n[Chorus]\nWe're all formless\nShapeless, flowin’\nForeign, orbit\nStarlight, sparkle\nAncient fossil\nFlaws with marbles\n\n[Verse 3]\nYou can’t get paid in this earth this big\nYou’re worthless, kid\nTime to take action, affirmative\nNo more games like refurbishin', uh\nI’m only 9 but I’m turnin’ 10\nBump, some alternative like\nI ain't never heard of this, shorty let me burn the disk\nKeepin' his head above water like he learned to swim\nOf course that's when they tried to murder him\nBut I’m gracious, he took three, one grazed him\nWith his blood up on the pavement, he ain’t fried he just bakin’\nNever seemed like such a cake walk the walk\nMakes his way to a car, he go to pick up my mom\nLike heaven can wait\nWhen you this big planets start look like marbles\nJust pray they don't use the sun as a shooter\n\n[Chorus]\nWe're all formless\nShapeless, flowin’\nForeign, orbit\nStarlight, sparkle\nAncient fossil\nFlaws with marbles", "album": "COMFORTZone"}], "artist": "Saba"}