{"songs": [{"year": null, "title": "Crawl Before You Ball", "image": "https://images.genius.com/9841a200e7b94485d7e2a91b3dbd2520.700x700x1.jpg", "lyrics": "Intro:\nYo Saafir what's goin' on playboy?\nSaafir: What's really goin' on?\n\nHuh, you tell me baby\n\nSaafir:Hey, it's like this man\nI gotta let these motherfuckers know how to crawl man\n\nI know everybody tryin' to come up immediately\n\nSaafir:You know they don't got the motherfuckin' perseverance cause they\nAin't have it hold up though. I gotta go and do this man\n\nVerse 1:\nYou can hear the ambition mobbin' in my po position\nThe intention is to come up\nDo your grindin' pay the boss before you floss\nAnd don't lose your mind and find discipline'\nAnd stackin' your scratch\nSo it don't come up missin' in\nAs you're askin' the Lord for guidance\nWhile you ridin'\nStickin' and movin' slidin'\nIn and out the game\nUnless you realize you're sprung before you legalize your funds\nAll you track hustlers that was made for the corner\nDodgin' the coroner's office\nI'm tossin' this at you\nNow on some sermon type shit\nI'm burnin' and I gotta write this\nThe mic got me ballin'\nShot callin'\nIt's the murk one like that\nSit back but not in starship\nSo I don't tarnish or rust\nWhen I'm bustin' on the next jerk\nWho swears he's ballin' but can't network\nYou better off with sexwork\nThe way you fucked in the game\nIt's a shame\nI'm aimin' at the bathroom stall on all of y'all\nWith the H.J.s deflecting these hate rays\nUntil the sun falls\nYou acquired a dream\nCrawl before you ball\n\nHook: (x2)\nWhat you thought?\nYou was just gonna ball on the spot?\nLet's be real\nYou gotta stack dollar bills before you get a mil\nGotta handle business before you choose to chill or you fall\nCrawl before you ball\n\nVerse 2:\nAll you pompous ass marks in Babylon yawnin'\nBecomin' another nigga spawnin'\n]From the trenches\nThe stench is unknown\nI've been crawlin' like a two toed\nChameleon for so long\nWriting these songs and ridin' these thongs\nWith bracelets on they ankle bone\nThat's anxious to moan\nLike Neena Samone\nHave a trick\nSickin' thinkin'\nThat we know it's on\nYou better crawl before you ball man\nBefore you fall man\nKeep ya hoes off your payroll\nUnless they crawl with you\nAnd you know they all with you\nAnd even then they won't fall with you\nI'm like fuck 'em\nI got to\nIt's a new sheriff in town his name is Reggie Mamoo\nYa hear?\nMore like Saafir\nOn a crawl\nBy watch how daddy ball\nI'm all ears and all eyes\nRecognize\nI'm crawlin'\n\nBridge: (x2)\nBaby baby let me kick my all to y'all\nYou gotta crawl before you ball\nI've seen so many many soldiers fall\nThey didn't know you had to crawl before you ball\n\nVerse 3:\nYou see gotta put in major work in at first\nBefore you burst\nCrawl before you ball but never lose your thirst\nWhen you ballin'\nOr you gonna end up broke and butt naked with no garments on\nWhile I'm makin' more cheese than Parmesian\nLearn game at a fast rate\nApply it to my walk then stalk\nI won't fall off cause I'm a put in that work\nAnd I'm a stick to that plan\nNow I'm a stay down with my folleys\nThe team then turn and brace God gave green\nGoing, going till I'm gone\nI'm ballin'\n\nHook", "album": "The Hit List"}], "artist": "Saafir"}