{"songs": [{"title": "How U Luv Dat", "lyrics": "[Intro]\nHonorable C.N.O.T.E\n\n[Verse 1]\nRockstar, but I don't ride no motherfuckin’ bike\nI get too high for that shit so I can't play with my life (hey!)\nCaked up, so I buy whatever I think I like (yeah)\nI said I was done buying ice, nigga sike (sike!)\nParked the Rari at the crib and came back in a Bentley (what up?)\nCodeine what I'm sippin’, gelato I'm twistin'\nGot on too much ice, hard for the bitch to pay attention\nMenace just like Dennis, I got racks like Venus\nI put Yves Saint Laurent on my bitches\nBought my lil South Memphis bitch some titties\nNothin' but mula when I talk in every sentence\nNigga I treat a Demon like a Hemi\n\n[Chorus]\nUnlimited racks, bitch how you love that?\nSmokin' kush in the back of the Maybach\nHow you love that, bitch how you love that?\nUnlimited racks bitch, how you love that?\nHow you love that, bitch? How you love that?\nHow you love that, bitch? How you love that?\nHow you love that, bitch? How you love that?\nUnlimited racks bitch, how you love that?\n\n[Verse 2]\nUnlimited racks, unlimited racks\nI just got some sloppy from your girl then sent her back\nSmash her from the back, then put her out like Janet Jackson\nOn the top floor of the Trump Towers, music blastin'\nNaw I can't fuck with suckers right now because I'm fastenin’\nBig shit poppin, yeah nigga I been having it\nYeah I got more guap than all my opps put together\nBlue ice on me, in my jumper like I’m a Blue Devil\nFuck it this fall I'ma go enroll in Duke\nEvery Friday, smoke 2 pounds with the students\nHow it feel when every time you kiss your baby mom?\nBoy you kissin’ my dick, you know how she use her tongue\n\n[Chorus]\nUnlimited racks, bitch how you love that?\nSmokin' kush in the back of the Maybach\nHow you love that, bitch how you love that?\nUnlimited racks bitch, how you love that?\nHow you love that, bitch? How you love that?\nHow you love that, bitch? How you love that?\nHow you love that, bitch? How you love that?\nUnlimited racks bitch, how you love that?", "album": "Role Model", "year": "2018-09-21", "image": "https://images.genius.com/9360bfac662625c363ba3da8db2c8772.600x600x1.jpg"}], "artist": "Young Dolph"}