{"songs": [{"image": "https://images.genius.com/4bc1c73874ec40b1b4b2bd61ebd575a7.500x500x1.jpg", "album": "The Letter “O”", "title": "Misguided", "lyrics": "[Verse 1]\nI look around everybody wanna be popular\nYes men around them saying they stock is up\nDate line, they just gotta keep the gas filled\nLeast that's what I tend to see like they from Nashville\nAll them bottles is coming with a disposed lace\nLess mornings, all I want is more of the lone nights\nShort term trips and a lot of long flights\nIt's crazy to see the path that we on, yikes\nShowing off to fine women sitting next to you\nYou rich, she broke, who really finessing who\nLet it sink in don't go jump off the deep end\nAttention got way too much value so they just pretend\nAnd I ain't perfect, but recognize the circus\nWhere they hide what’s inside\nAnd trick you with what's on the surface\nYou better move 'em with a purpose, leeches in the lurkest\nBurn down your worth just to leave you when you worthless\n\n[Hook]\nYou wanna shine like LeBron\nMoney, cars and women that's all that's on your mind\nAlways in the club but you say you on your grind\nNever chase the lights, you gotta wait your time\nFolks be screaming they your friend like, \"I'm with you 'til the end!\"\nIs they really rocking from the hooptie to the benz?\nBut Lord, if they pretend, if they genuine\nIf they want you to win they be working for the ends, know I'm saying\n\n[Verse 2]\nThe wardrobe not a way to fool folks\nSee these Yeezys might get me a few strokes\nYou and many with money that's fools gold\nThat's why I've only got friends, I'm cool bro\nCopycatting and thinkin' that we [?]\nNobody gave them game so they tryin' to force the action\nLookin' for a distraction just to feel the satisfaction\nTo me that sounds backwards but it ain't the game traction\nYeah the [?], these cops are like at the baddest sight\nThey don't know they days numbered, they think [?] last night\nTurn up, even I do that occasionally\nI know my mama pray for me, I wake up get, to thinking\nThey say it's harder for a rich man to go to heaven than it is for a cow to go through a needle, damn\nI pray the Lord keep his arms around the famous ones\nFrom the folks that's aspiring to those that made a ton\n\n[Hook]\nYou wanna shine like LeBron\nMoney, cars and women that's all that's on your mind\nAlways in the club but you say you on your grind\nNever chase the lights, you gotta wait your time\nFolks be screaming they your friend like, \"I'm with you 'til the end!\"\nIs they really rocking from the hooptie to the benz?\nBut Lord, if they pretend, if they genuine\nIf they want you to win they be working for the ends, know I'm saying", "year": "2016-10-21"}], "artist": "Dame D.O.L.L.A."}