{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "Kid Capri", "lyrics": "\"Kid Capri, plays beats like this..\" (4X)\n\n[Daddy-O]\nTake tapes; everybody tapes\nEverybody buyin tapes that the DJ's make\nTwenty bucks a pop and they run non-stop\nAnd the jams are hot, to the very last drop\nPOP POP in your car or your Jeep or whatever\nSometimes people buy 'em like two and three together\nBut did you ever wonder who's the best?\nOr argue with your friends to get it off your chest?\nWell let me introduce you to Kid Capri\nHe's kind of like a favorite to me\nHe's got a real dope way, of makin them tapes\nAnd I don't mind myself spendin them papes\nI pump it in the Volvo that I ride\nMost times with my girl to the left of my side\nIn the city of New York with celebrities\nAnd a cool DJ named Kid Capri!\nShoo-wop-shoo-wop-shoo-wop-shoo-wop-POW\n\n\t\"Kid Capri, plays beats like this..\" (4X)\n\n[Daddy-O]\nI hear a beat movin in a Jeep \"Uptown, Uptown\"\nAnd I guess it's \"Kid Capri\" with the big \"dope sound\"\nSo skip to my loo, rather skip to Capri\nYou bring the skins and the ride's on me\nAnd we can parlay like peas in a pod\nGrin for the girls and give a piece to the Gods\nThe rest of the pie you can leave for my crew\nGive a toast to the fools that knew\nThat if it don't fit don't force that flow\nSo how many times I gotta let you know\nThat the Dad got a new way of runnin the show?\nJust like Shabba Ranks goin, \"Bo! Bo! Bo!\"\nCrashin all them doubts that you had befo'\nAnd friendly as a food stamp is to the po'\nBein all them things that I wants to be\nAnd slammin like a tape by Kid Capri - break it down for me!\n.. Shoo-wop-shoo-wop-shoo-wop-shoo-wop-POW\n\n\t\"Kid Capri, plays beats like this..\" (4X)\n\n[Daddy-O]\nWhether in Brooklyn, parolin with my peeps\nOr Lower Manhattan, where I shop upon the street\nThere's one thing to say (??) everyone I meet\nEverybody's fiendin for a fat funky beat\nWell here's a fat beat that'll rock your socks\nComin straight from the school that we call hard knocks\nCause it knocks you HARD upside your dome\nAnd commands like a law that's etched in stone\nWatch the Dad blow up on the solo tip\nFeet firm to the ground with the kung-fu grip\nSharp as a whip might strike your back\nChoke you up like a Winston straight from the pack\nAnd if it's them beats that'll make you ill\nKid Capri got a tape that'll fit that bill\nAnd once you get hooked you won't know how to act\nTradin tapes like baseball cards in stacks\nLookin for the mix that suits you best\nTakin care like the Doc on Empty Nest\nJust remember that the tapes don't come for free\nSo whenever you pay, pay for Kid Capri!\n\t\"Kid Capri..\" (3X)\n\n\t\"Kid Capri, plays beats like this..\" (8X)\n\n[Daddy-O]\nYo I'd like to give a shout out to all the DJ's Uptown\nI wanna let y'all know I ain't forget about you\nRon G, S&S, Chill Will, Doo Wop.. rock on, to the break of down\nLovebug Starski..", "year": null}], "artist": "Daddy-O"}