{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Intro]\nOh god, what is wrong with people man?\nThis right here is for Becca from Big Daddy Wyatt\nYeah, good luck with this dude\nMy goodness, okay, here we go, ey\n\n[Verse 1]\nBecca Boo, I love you\nI miss your eyes, like the sky they're blue\nYou left me for a punk\nSorry that I cheated on you, I was drunk\nIt was the Superbowl, what'd you expect?\nThat's a mistake, that I will correct\nYour new boyfriend gets no respect\nYeah, I got mad, and I grabbed your neck\nIf I see that faggot Dannie I'm gonna riot\nCome back to me, you know it's Big Daddy Wyatt\nI'll take you to Dairy Queen for a treat\nI miss your butt, and I miss your teets\nI know he doesn't fuck you like me\nW-Y-A to the double T\nI'm a big dog, he is a puppy\nI am a shark, he is a guppy\nI'm a Ford Truck, he is a Kia\nTell him, see ya, I wouldn't wanna be ya\nI won't smack you anymore I promise\nSorry, but that day you were being obnoxious\nI love you and your sexy strut\nI wanna put a baby in your gut\nBecca Boo, I love you\nI miss your eyes, like the sky they're blue\n\n[Interlude]\nUrgh, stop it!\nYou know I had to respond, right?\n\n[Verse 2]\nDear Becca\nI ain't never met ya, but I hope the new boyfriend, you have now respects ya\nI just got an email from Wyatt, your ex\nAll he cares about is violence and sex, I had to write this I guess\nHe sounds abusive and kind of obsessed\nWith trying to turn your whole life into a childish mess\nAnd look, I'm not your dad, I can't make your plans for you\nBut I hope your new man don't put his hands on you\nI hope that Wyatt gets the help he needs to get\n'Cause if you ask me, he's a selfish piece of shit\nDon't ever let a man grab you by the neck\nA fiance should show, love, passion, and respect\nSo just forget Wyatt, he's a loser, not a man\nI don't care if this rap makes me lose another fan\nBecause he's very mean\nAnd Becca if you email me, I'll PayPal you 200 bucks to spend at Dairy Queen\nI ain't have to hold his feet up to the firé\nHe bragged about the fact, that he's a cheater and a liar - an abuser\nHe's a monster I guess\nHonestly, I wish you and Dannie the best\nPeace\n\n[Outro]\nWyatt, unsubscribe from my YouTube channel, unfollow me and go fuck yourself!", "year": "2019-04-23", "album": "YouTube", "title": "An Abusive Boyfriend Wrote This To Win His Ex Back"}], "artist": "Mac Lethal"}