{"songs": [{"image": "https://images.genius.com/1e9d47cc7d2d89c839c4ec32d0815a5e.929x929x1.jpg", "lyrics": "[Intro]:\nExclusive! GMG! Manhood! East New York! Tuneheads!\nUncle Murda! The Invasion! Brooklyn! Awww!\n\n[Chorus]:\nTell Hova that Murda's runnin the city now!!! (I'm bringin it back!!!)\nTell Diddy that Murda's runnin the city now!!! (It's a wrap!!!)\nTell Russell that Murda's runnin the city now!!! (Aww man!!!)\nTell 50 that Murda's runnin the city now!!! (Whattup!!!)\n\n[Verse 1]:\nLook I shot many men many men fear me\nEven gangstas when I come around get leary\nLike I don't want him near me, that boy schemin\nKeep yo' hand on yo' gun be ready to start squeezin\nThis man said I knoow, let Murda try some'n\nThese kids feelin themselves they must be high or some'n\nThen I step to 'em they like what up son!\nI'm like what up mu'fucker y'all see my gun\nThen them dudes start stutterin like wh-wh-what you talkin 'bout?\nThen we rob these niggas they like wh-wh-what's this all about\nMy man heard you talkin slick yeah that's what happened\nNow we violatin y'all for actin like it can't happen\nThe jokes on y'all you see all the chicks laughin\nThen we take 'em to the back and let my little man's clap 'em\nMy little man hit him all up in his fitted cap\nTold him tell Biggie that Murda's bringin the city back (Bang nigga!!!!)\n\n[Chorus]:\nTell Flex that Murda's runnin the city now!!! (Tell 'em!!!)\nTell Angie that Murda's runnin the city now!!! (The voice of New York!!!)\nTell Enuff that Murda's runnin the city now!!! (Heavy Hitters!!!)\nYo Mister Cee, Murda's runnin the city now!!! (The Finisher!!!)\nTell Brooklyn that Murda's runnin the city now!!! (BK!!!)\nTell The Bronx that Murda's runnin the city now!!! (The Boogie Down!!!)\nTell Queens that Murda's runnin the city now!!!\nTell Harlem that Murda's runnin the city now!!!\n\n[Verse 2]:\nI know how it feels to win I know it feels to lose\nMy Gettin Money Gangstas I run with the realest crew\nI do what the killers do, so when I spit at you\nI ain't just rappin know why I get at you\nI'll hit yo' punk ass up 'fore I hit at you\nI know you heard of Murda I ain't shootin and missin dude\nThey said I'm an animal I'm uncontrollable\nI ain't like these rap cats I'll put a hole in you\nThese streets said the same thing yeah they know it to\nThat's why they embrace me they know what I'm goin through\nPeople in the hood like Murda you killin 'em\nI used to bump they shit but now I ain't feelin 'em\nI only bump yo' shit your songs more realler son\nYou should change your name to Uncle Murda The Killer son\nYou ain't like Jay you know he that drug dealer son\nYou that BK boy with that finger on the trigger son\nCause they know it that ego gettin bigger son\nBut that's aight cause right now you that nigga son\nYou that new boss you the boss of the East Coast\nWhen I go to L.A. I'm keepin my heat close\nYou see they made B.I.G. rest in peace y'all\nI think somebody reachin that ass is meatloaf\nHe finito, man, tell Biggie to tell Pac\nThat the East Coast is back Murda rollin with The ROC\n\n[Chorus]:\nTell Envy that Murda's runnin the city now!!! (Tell 'em!!!)\nTell Slay that Murda's runnin the city now!!! (Drama King!!!)\nTell self that Murda's runnin the city now!!!\nGreen already know that Murda's runnin the city now!!! (The Invasion!!!)\nTell Brooklyn that Murda's runnin the city now!!! (BK!!!)\nTell The Bronx that Murda's runnin the city now!!! (The Boogie Down!!!)\nTell Queens that Murda's runnin the city now!!!\nTell Harlem that Murda's runnin the city now!!!\n\n[Outro]:\nTell Staten Island nigga!!!! Tell Long Island nigga!!!!\nFuck outta here you bitches!!!! I'm bringin the city back!!!\nBrooklyn we did it again nigga!!!!!", "title": "Runnin the City", "year": null, "album": null}], "artist": "Uncle Murda"}