{"artist": "C-Rayz Walz", "songs": [{"title": "Street Reppin’ (Accapella)", "album": "R’Thentic / Street Reppin’", "year": "2005-04-19", "image": "https://images.genius.com/90eab1252b8d87c7c21aa2ae83f29a50.500x500x1.jpg", "lyrics": "C-Rayz Walz ft. Vordul Mega - \"Street Reppin'\"\n[Emcee(s): Vordul Mega and C-Rayz Walz]\n[Producer(s): Belief]\n\n[Intro: C-Rayz Walz and Vordul Mega]\nVordul Mega: Mmm.  We in here.  Yeah\nC-Rayz Walz: Metal Gear Yung Havok, C Walz\n\n[Verse 1: Vordul Mega]\nFrom hard\nTimes, write lines for ones we lost\nSongs stressed, full of kids with pagers and gold\nCrosses, living without a pot to piss in\nComing out of cribs to live in obstacles of hard decisions\nTired of hoping and wishing.  Witness\nBrothers make a living pushing cokes out the kitchen\nThough we suffered watching each other\nIn and out of institutions, losing our shahada\nWhile girls complaining they dudes ain’t copping\n‘Em Prada, me and mine skate dramas\nPuffing L’s late nights with hunger\nIn front of Mama Fry, munching on chicken\nAnd peach cobblers.  Times when I was in and out\nOf dungeons for dolos.  No fears of getting\nRobbed even though we know anything could\nHappen.  My folks telling me I need to make\nChanges like, “It’s best to sticks to the rapping”\nSo I’m over here, snapping my fingers\nTo keep to beats.  Flowing over instrumental\nTracks and still got love for streets\n\n[Hook: C-Rayz Walz and Vordul Mega]\nWho wanna\nJump quick?  Yo, how high?  How\nHigh?  Do or die?  Who am I?\nBrothers is doing ‘em.  Who is him?\nWe Mega, street repping.  Who wanna\nJump quick?  Yo, how high?  How\nHigh?  Do or die?  Who am I?\nBrothers is doing ‘em.  Who is him?\nWe, we Mega, street repping\n\n[Verse 2: C-Rayz Walz]\nReady to pump CDs.  Not for the\nIce—just to keep produce up in the freezer\nFire it up in the clubs.  People keep\nFilling their cups like they’re drinking for Jesus (How high?)\nBe fly ‘til I turn to a bird, same\nWay these thoughts turn into word (Justice).  I’m just\nNice, roll with brothers that’s just ice, hungry\nFor a week, deep, eating smushed rice.  Mind straight\nPull strings violent, pimp you without Ben-Ari\nA Puerto Rican Muslim, I’ve been aquí.  You could\nTake it as left wig or right hair/here.  Never fight\nFair, fresh like a new pair... got you\nStudy discipline at the master’s pace (Yo, who wanna)\n(Jump quick?).  Drops of water’ll slash your face\nThe Trinity of street humor and spiritual fact\nPolitically charged statements with rhythm on wax\n\n[Hook: C-Rayz Walz and Vordul Mega]\nWho wanna\nJump quick?  Yo, how high?  How\nHigh?  Do or die?  Who am I?\nBrothers is doing ‘em.  Who is him?\nWe Mega, street repping.  Who wanna\nJump quick?  Yo, how high?  How\nHigh?  Do or die?  Who am I?\nBrothers is doing ‘em.  Who is him?\nWe, we Mega, street repping\n\n[Verse 3: C-Rayz Walz and Vordul Mega]\n[C-Rayz Walz]\nCaught up in the cultivation, cold sensation of cul-\n-tured patience, coping to coach a nation of mad souls\nIn the Year of the Beast, I’m ten-deep in the street, repping\nHolding my head like a weapon concealed—I’m a mad soul\nNew York needs a coat this winter.  Cold-hearted pigs\nGet bacon trying to poke my ninjas.  Po-lices is\nTrifest in crisis.  We writing the slaughter, sort of\nSicker than mixing liquor with Vitamin Water\nHorror at your fetus.  Holler back if you a genius\nAyatollah sees the truth ‘cause they believe us.  In the crowd\nWith heaters, remove the shroud.  The vow-keeper\nSwitch styles.  Fouls astound seekers.  Prowl\nProfound teachers, I was eager.  I mean, I...\n[Vordul Mega]\nI learned a lot coming out of burning blocks\nTime to turn the clock forward to better ways\nOf getting paid.  Days when everything seemed\n[?].  Got to change ‘cause the grains\nOf sands accumulating quickly at the bottom\nAnd the pain is getting out of hands.  Now I\nGotta stand on my two and pay dues\n\n[Hook: C-Rayz Walz and Vordul Mega]\nWho wanna\nJump quick?  Yo, how high?  How\nHigh?  Do or die?  Who am I?\nBrothers is doing ‘em.  Who is him?\nWe Mega, street repping.  Who wanna\nJump quick?  Yo, how high?  How\nHigh?  Do or die?  Who am I?\nBrothers is doing ‘em.  Who is him?\nWe, we Mega, street repping"}]}