{"songs": [{"album": "The Summer Years", "image": "https://images.genius.com/990dd9f9db79f7821ca28c3c354bc148.600x600x1.jpg", "year": null, "title": "Parachute", "lyrics": "[Verse 1]\nShe told me that she like me\n\nShe told me that she like me, complemented on my Nikes\nI told her that she dope but me and her are so unlikely\nYou're just too gorgeous, babe, I dont need random dudes fighting me\nThey're just too jealous out here, especially when they know we out here\nI dont need that attention, your girlfriend like \"no he didn't\"\nI dont need no Martin Lawrence and Pamela rendition\nBut anyways, we can kick it, just no real commitment\nAnd I hope you in shape, if you even plan on going a distance\nKnock, knock, knock! Who is this? Oh my God, this girl is vicious\nYou look better in real life, you should end on all your pictures\nWhere you been all my life? Can't believe we are just beginners\nThis course is for advanced swimmers, we in here with fishes!\nJumpin' in the water, this ain't even what I ordered\nI'm scared to look at the price, I just hope that I can afford her\nAnd if I can't, then I guess I'll just throw her back in the water\nWhat would Jesus do?\n\n[Hook]\nI hope you packed you parachute, you fallin' for me\nWe falling from thirty thousand feet\nI hope you packed you parachute, you fallin' for me\nWe falling from thirty thousand feet\nYou better pack your parachute you fallin' for me\nWe fallin from thirty thousand feet\nI hope you packed you parachute, you fallin' for me\nWe falling from thirty thousand feet\n\nSo now we rocking steady, every month's like February\nShe got me feeling like a kid again, when girls are jellies\nI give her candies and in return shes giving up her panties\nThis romantic shit is really starting to come in handy\nI'm going deeper and deeper, baby might just need the ether\nShe going in for the kill, she just bought me my favorite Sneakers\nWhat you trying to do to me? girl, you know thats my weakness\nGot me going to my mom's and pop's, tell them who she is\nThis the one I know she is, she got to be\nGot me paranoid, I'm thinking back on how she got to me\nPlease give me some privacy to figure out this PYT\nIf she is who she says she is then she'll walk down the isle with me\nHope she dont lie to me cause I dont do apologies\nI'm getting to far ahead of me, I need to chill and let this be\nNow all my shit is catching up to me\nMy girlfriend caught me chilling with my new girl sitting next to me\n\n[Hook]\n\nThirty thousand thirty thousand thirty thousand..."}], "artist": "Tabi Bonney"}