{"songs": [{"year": null, "title": "Copper Gone Tour Press Conference (Spoof)", "image": "https://images.genius.com/272fb5e65bfaf7694e7ceb8c53b5c715.1000x891x1.jpg", "lyrics": "[Intro: Sage Francis]\n(Stop)\nWoo! Alright, Okay\n(That's my boy)\n(Murmuring from audience)\n\n[Sage Francis]\nHello ladies and gentleman, thank you for coming here, this time, as opposed to four years ago when I said I was retiring from touring. Now I'm back, fake retirement. The reason why? My accountant let me know I can't leave rap alone. The game needs me. So I created an album called \"Copper Gone\", touring the entire planet, and live a life outside of the place that I've been boarded up for the past four years. If you have any questions let me know, otherwise I'd like to get back to my shit\n\n[Reporter]\nNo love for Florida?\n\n[Sage Francis]\nUhm, I got love for Florida. I, I have family, I'm from Florida. So, I mean I'll be back, I don't know why shows weren't booked there. I told my booking agent whatever you can get I'll play. So, apparently it didn't work out\n\n[Reporter]\nYou scared of the Dirty South!\n\n[Sage Francis]\n*Sarcastically.* I'm scared of the Dirty South. Uhm, well we're playing North Carolina, we're playing Atlanta, it gets...that's dirty right? I don't know, I am kind of scared of the Dirty South\n\n[Reporter]\nAre you going to play any of the old good stuff?\n\n[Sage Francis]\nOh yeah, oh yeah. Uhm, I'll play the old good stuff, I'll play some of the old bad stuff too, if that's okay with you. But probably just...Well basically I have a new album so I'm going to perform a lot of new stuff, the new good stuff and I'll leave the new bad stuff out\n\n[Reporter}\nI love Crack Pipes!\n\n[Sage Francis]\nYou, you love Crack Pipes...\n\n[Reporter]\nBroken Wings!\n\n[Sage Francis]\nI don't believe you\n\n[Reporter]\nEpic Beard Men!\n\n[Sage Francis]\n*Shouting.* Yeah! Epic Beard Men's not a song! (Fuck out of here, out). Uhm, any other questions?\n\n[Reporter]\nOnly two shows in Canada, eh? Doesn't sound like much of a Canadian tour\n\n[Sage Francis]\nNo, well it's not a Canadian tour, it's a North American tour, so\n\n[Reporter]\nBut no Alaska!?\n\n[Sage Francis]\n*Mocking.* No, No Alaska though! Yeah because uhm, (laughing) then I'd have to drive through fucking Canada, eh, to get to you. So, I'd rather not\n\n[Reporter]\nSage, you're bringing B. Dolan on this tour, why not bring everybody?\n\n[Sage Francis]\nUhm, I don't, I didn't know I was bringing B. Dolan, that's pretty cool, I thought I was B. Dolan\n\n[Reporter]\nSage, no love for Detroit?\n\n[Sage Francis]\nNo love, that's exactly it, no love\n\n[Reporter]\nWhy don't you play my front porch?\n\n[Sage Francis]\nI don't wanna play your front porch, I don't wanna play Detroit, I don't wanna play Florida. I hate Florida. I hate this place. I hate that place. All this shit! I'm only playing the places that I love. That's it from here on out. Which means I'm not playing any place. This is it, this is it, this is...the new press conference, the purpose here, I quit! This is a new...I didn't quit. Rap game needs me. Thank you. (Walks out, teary eyed)\n\n[Reporters]\nSage...Sage...Sage...\n\n[Video ends with song Pressure Cooker by Sage Francis]", "album": "Copper Gone"}], "artist": "Sage Francis"}