{"songs": [{"album": "DiCaprio 2", "year": "2018-11-26", "title": "Mounted Up", "image": "https://images.genius.com/a24486c6e4c335d50ce79fdcf7bef5ac.1000x1000x1.jpg", "lyrics": "[Intro: DJ Drama]\nFam, take me to where the bars is at\nTake me to the street where the bars is at\nJ.I.D, DJ Drama, let's get it\n\n[Chorus]\nOkay, I'm mounted up (Huh)\nHigh off the ground, watch me count it up\nCop me a pound, burn it down with us (Uh)\nLet's hit the town, is you down or nah?\nLook at me now, I done found me some\n\n[Verse 1]\nTreasure inside the trash\nSever my hands reaching through the metal and glass\nIt's been a blast, feel the magic in the madness, give me yo' hands\nGive me passion, anything that can equal some satisfaction\nLooking for love at the end of this Henn' bottle\nLooking for pub', let me pen your next album\nCall from above, tell me kid you been allowed to\nPoint it to re-emerge, kicking lyrics in the South, no issue\nWipe that drizzle off your mouth, it's time to wake up the house\nY'all niggas been playing skins versus blouses\nI'mma keep my shirt on until some hoes come out\nAlways keep your word, homie, I don't know nothing else\nI'm your father, go get a switch or a belt\nInterrupting my method, in here making this velvet\nGrab my dick and do a thrust with my pelvis\nMy shoes suede but don't fuck with no Elvis\nI'm from the era of real shit, kill-or-be-killed shit\nKill-or-be real quick, float like butterfly\nSting like killer bee, flow worth kilograms\nYou niggas killin' me thinkin’ you ill as me\nWhat's shit to an enema, enemy?\nAnyone, get at me, I'm the epitome\n\n[Chorus]\nFuck, hey, I'm mounted up (Huh)\nHigh off the ground, watch me count it up (Look)\nCop me a pound, burn it down with us (Uh)\nLet's hit the town, is you down or nah? (Yeah)\nLook at me now I done found me a\n\n[Verse 2]\nMethod to all the madness\nCheckin' my back, checkin' my hands\nCheckin' in cash, and checkin' and balancin'\nHard work, callouses\nGripping the challenge by the cabbage\nAnd bl-bl-blackin' 'til it's no longer a factor\nMurder the, murder the game, kill it\nMetaphysical living, deranged vision\nNot a typical picture, the same limit\nBut I'm limited edition, I change prisms\nAm I trippin'? A nigga be trippin'\nI'm feelin' like most of you niggas be slippin'\nI'm giving you tips and a nigga just went with it flippant\nNot sayin' you stupid, but hella reminiscent\nOf a stupid nigga, what they do to niggas\nKill or shoot a nigga (Die!)\nWow, then recruit a nigga, boot or suit a nigga\nSend em to the other side\nIs you gon' buckle up for the ride?\nNiggas is fuckin' tough 'til its buckin' time\nBet they motherfuck, better buckle down\nCause I'm coming up nigga, hella mounted\nKnow my name cross hella counties\n(Hey J.I.D, hey) What's up shawty?\nBeen around the world, ooh yeah\nLet me tell you 'bout it\nKeep your shit cool, melancholy\nKeep your tool shit metabolic\nGet some money, niggas jealous\nSo him and his fellas come deliver hella bodies\nPost robberies, another dead nigga no problem\nYou happy 'cause we doin' your job\nI'm pulling everybody's whole card\nI never play with little boy toys\nI was busy inside of laboratories\nLookin' out the window like a labrador\nTo the bullshit I'm a matador\nIn the pulpit like God's son, not a daddy's boy\nCornered boar, carnivore, ready for any war\nSend 'em forward, fifty more, plenty more\nGimme more, see me Lord\nAfter me, no before he became\nSee me boy, see these boys\nGon' need CPR to be remorse\nFor these meteors, it's just me recording\n\n[Outro: DJ Drama]\nHahaha, DiCaprio 2\n(Gangsta! Gangsta!) Suckers"}], "artist": "JID"}