{"songs": [{"image": "https://images.genius.com/5cf926857ea50a9127019d93750f202f.642x642x1.jpg", "title": "Bless The Booth freestyle", "album": null, "year": null, "lyrics": "Hey waddup man, this is Nasty C all the way from South Africa\n\nRight now, and I came to bless the booth\n\nYea (clears throat)\n\nSeason, coolest kid in Africa\n\nEh, am from 031 when I repre-fucking-sent\n\nT don freeze like bitch don’t take another step, ehm\n\nIts not my problem that you wasn’t heaven sent, ehm\n\nBitch am blessed, ehm proof\n\nThat is a virgin set of car keys, with  Suburban little Barbie\n\nWhat that mean? Pause, that’s Ferragamie, oops I mean Ferragamo\n\nWait, activate God mode, ey, never had a barcode, ey\n\nNever broke guy code, eh story of my life bro\n\nI came up by the star hope, there was smoking light bulbs\n\nFendie with a big bitch, that is not a type o, eh\n\nI go tru a lot bro, eh, I am not your life ghost eh\n\nMy peers turn to pythons, but that’s just how the dice rolls\n\nYuh, but fuck that, what’s that?\n\nThat’s cash I be damned if I don’t go chasing\n\nAnd, you would really have to make love to my mama to replace me\n\nYe!, gimme that beat uh, jump in a hoe speed racing uh\n\nWaiting on me to fall, eh, oh then you gotta be patient!\n\nStarted off eh, winging it eh\n\nI took this serious, now I got a minute in it\n\nI got me a vision, and committed to defending it\n\nEh eh eh eh eh spitting must be in my lineage oh shit!\n\nMe and my dawg we predicted this, we spoke this shit to existence yea!\n\nEveryday, we was consistent yea!\n\nTo set it straight, we fucking magicians\n\nWhen they told us, dream of something we could live with more realistic\n\nWhat you mean? I don’t follow and I didn’t I was on one\n\nI was buzzing, I was starving, rap was calling, I responded\n\nI was certain, I had purpose, I was nervous, I was scared\n\nBut the city that I lived, said I had to represent\n\nI'm from 031 when I repre-fucking-sent\n\nT don freeze like bitch don’t take another step\n\nIts not my problem that you wasn’t heaven sent\n\nEh, blessed eh, bitch you see the cheque, tell ‘em oooo shit\n\nYou know my daddy raised me well, mm yea!\n\nTouch my lunch I ring ya bell, yea am doing better can’t you tell\n\nMm yea, am doing better can’t you tell mm\n\nNow I make you feel inferior\n\nWay  you like to bite my shit, I got malaria\n\nNow please beware, am just a don from down the area\n\nAnd I came to tear it up, came to tear burial\n\nYou wasn’t hearing us before, I know, that nature played its role\n\nA man was made and told, just take your plate and go\n\nBefore we scored, we traveled back and forth\n\nWe had to have a door slammed on all our faces boy\n\nI, wasn’t always hot I window shopped\n\nI, was under you I know you missed those time\n\nThe score don settle now and if its not a throne, I sit on tiles\n\nI took the standards ceilings and I set them high\n\nI try to deny that am the guy but who am I?\n\nI try to deny that am the one, that’s a lie\n\nAudiomack I had to drive by, coolest kid in Africa\n\nThat ain’t gon lie Nigga"}], "artist": "Nasty C"}