{"artist": "Iamsu!", "songs": [{"title": "Compound", "lyrics": "[Produced by D-Shine & Ricky Racks]\n\n[Intro]\nIamSu! the label\nHBK the gang\nHot New Hip Hop\nYeah, yeah, yeah\nYeah, yeah, yeah\n\n[Verse]\nMad rich alert\nSwag with the verse, 6 B's\nShe thought I was just an average at first\nBaby make it work for a new t-shirt\nSat it on my lap, I might just throw you in the air\nTrust me girl I did it if I said it in a rap\nI never get it out the clinic, get my weed up out the trap\nEverything I'm saying it's authentic, it's a fact\nAin't no limit how we gettin' it, Percy Miller taught me that\nYo the new fans say they miss the old me\nThink I came this far to get some cold feet?\nI'm well off, well taught by the OG's\nHe get it for the high, I'd rather get it low-key, not me\nSchool of hard knocks, play the game by the rules\nAin't too many people who can do the things I do\nPay attention dude like my women by the crews\nIf you want a verse from Su it's 5k times two\n\n[Hook]\nI've been locked down at the compound\nMama on my nerves, told me calm down\nI've been on my wave for a long time\nIn the kitchen tryna get my songs right\nBaby make it work for a new t-shirt\nSat it on my lap, I might just throw you in the air\nImma catch feelings if you do it like that\nStack it to the ceilin' but it grew it right back\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nImma catch feelings if you do it like that\nStack it to the ceilin' but it grew it right back\n\n[Verse 2]\nStep out your position lil baby imma cut you from the team\nI've been on my Diddy doing Biggie so I guess it's all a dream\nThese youngin's out here trippin' on prescriptions mixing molly with the lean\nBut me, I got a vision, I ain't slippin' so I gotta keep it clean\nRoll the red carpet, bring the cameras every time I'm on the scene\nAnd the flow bananas cause you know I keep gorillas on the team\nYou know you could look in my eyes and see I'm not tellin' no lies\nYou think you could fuck with the guy? You washed up, you wastin' your time\n\n[Hook]\nI've been locked down at the compound\nMama on my nerves, told me calm down\nI've been on my wave for a long time\nIn the kitchen tryna get my songs right\nBaby make it work for a new t-shirt\nSat it on my lap, I might just throw you in the air\nImma just catch feelings if you do it like that\nStack it to the ceilin' but it grew it right back\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nImma just catch feelings if you do it like that\nStack it to the ceilin' but it grew it right back", "image": "https://images.rapgenius.com/00837cd231fd86d86d8c6649b69387cf.950x950x1.jpg", "album": null, "year": null}]}