{"songs": [{"album": null, "image": "https://images.rapgenius.com/869799c0f092143210859338b84d3271.640x424x1.jpg", "year": "2011-10-06", "title": "Distraction (Occupy Wall Street Freestyle)", "lyrics": "Nowadays we be rocking glasses for fashion\nAnd fucking with life a fraction\nCovered in Max Factor, hustling ass-backwards\nAs sure as Hi-Tek look like Richard from Last Dragon\nYour focus on bogus rappers got you caught up in distraction\nDistraction. Who fucking who? Who cares? That's distraction\nYou wish it was you, don't you -- why you asking?\nTry to break the law of attraction\nGet a piece of my attention like a fraction of a ration\nOr a measly little morsel\nThey suck your blood and you believe in the immortals\nWe nocturnal like a sleeping disorder\nSee the water drawing away from the shore\nThis ain't no ordinary storm\nWe killing for a humanitarian cause\nBut have yet to show up in Darfur\nThe Arab Spring is what it's called\nBut it's looking at the pride before the fall\nThey say it ain't about the spoils of war\nBut turn around and tell you how much more the oil will cost\nSteal the land from the Native American and call the missiles Tomahawks\nMake him a mascot, dress up like him for sport\nAs a final assault to his beautiful culture\nScavengers, feasting on the dead like a vulture\nSnacking; how you keeping up with my rapping?\nYou barely keeping up with Kardashians\nYou caught up in distraction\nIt's the living proof -- you try to make the truth elastic as Mr. Fantastic\nWe recycling these rappers\nTruthfully, these niggas is plastic\nComing through the front door blasting\nI ain't talking bout them e-mails\nThat you always send to the masses\nThat somehow end up in my trash bin\nMy niggas got the aim of sharpshooters and the hearts of assassins\nAll this war, all this life, all this passion\nThe game is distraction\nGive a fuck if the President wear a flag pin\nRhyming is deep as holes Chilean miners are trapped in\nOr the cracks in the earth under Asia Minor causing disasters\nMy deep cuts way above your minor infractions\nTalk to rappers like children cause that's how they acting\nThey holding their hands like minors in traffic\nThe captains of industry and the lovers of status quo\nHave a deep-seeded fear of change\nFor them it's strange -- they wanna go\nBack to the 50's, they asking for a return\nBut them days is much blacker, for lack of a better term\nWe adapted to the times, but this culture we had to learn\nCame about as natural as a perm on a pachyderm\nThese fascists have had their turn\nWe packing them German burners, them Lugers\nThe next shooters waiting for Superman, they get nothing but Lex Luthor\nAmerica's nightmare, vivid as Fred Kruger\nOur heroes are dead to us\nSpirit that bled through us\nEndear us with the spirit so the flow is so foolish\nWhat you hearing is precision\nThe people so thirsty, what they seeing is mirages\nBut this passion Photoshopping and your YouTube collages\nComing through like Collossus\nExposing the false prophet\nTaught how to do the knowledge so I'm never off-topic\nA lie is like a potion\nFirst it gets you open\nThen you swallow whole straight for the truth\nFuck the chaser, skip religion and the politics\nAnd head straight to the compassion\nEverything else is a distraction"}], "artist": "Talib Kweli"}