{"artist": "Baka Not Nice", "songs": [{"lyrics": "[Intro]\nJ–j–j–just in my zone, I close my figures up\nAll your hoes chose me, nigga, calm down\n\n[Verse 1]\nLouis pouch across my body, this is not for fashion\nThis is not a playground – ain't no fist fight, bitch, I'm blastin'\nNiggas say they lookin' for me like I'm not right here, man\nIf I tatted tears, I'd be cryin' to my beard, man\nBitch, I'm tryna fuck, I've been inside for thirteen years now\nI've been on so many flights, it's like my record's clear now\nA.K.A. the man, A.K.A. I never ran\nDon't make me turn this red light on your head like you Roxanne\nOnly talk to bosses, not the second-in-command\nNiggas bringin' talks to me, you better have a plan\n'Cause they don't have a cure for all my pain\nA.K.A. it's Not Nice and I live up to my name\n\n[Chorus]\nGyah, gyah! Diss The Boy? Are you insane?\nI drink Henny when I shoot my pistol at the range\nThat way, when I'm tipsy, I still know I got my aim\nA.K.A. it's Not Nice and it's not a fuckin' game\nGyah, gyah! You and I, we're not the same\nPosted like Ibaka, got your wifey runnin' brains\nShe was there with boydem, kicked my front door off the frame\nShe say I look like Usher when I'm trappin' in the rain\nTrap, trap, trappin' in the rain\nShe say I look like Usher when I'm trappin' in the rain\nJust know I'm a shooter first and rap is not my thing\nA.k.a. it's Not Nice and I live up to my—\n\n[Verse 2]\nHidin' in the racks\nI don't pay tax, twelve on my back\nMight drive the Caddy around but I never lack\nBaka not with the shit? So yeah, who tellin' you that?\nI went to jail the day they released Men in Black\nWhen I came out, Timberlake was bringin' Sexy Back\nFacts, nigga! Facts!\nI fell in love with my strap\nNamed my son Milli 'cause I want a milli' to stack\nGyah, gyah! Go run and tell that\nYou niggas move like the cops, don't make me pepper your block\nOut the window while the whip's movin', that's a hell of a shot\nFuck all my opps, I'll put you niggas on FOX\n\n[Chorus]\nGyah, gyah! Diss The Boy? Are you insane?\nI drink Henny when I shoot my pistol at the range\nThat way, when I'm tipsy, I still know I got my aim\nA.K.A. it's Not Nice and I live up to my—", "image": "https://images.genius.com/5a427315cd15fb7bd6d97fad2ac7cb52.355x355x1.jpg", "year": "2017-05-28", "title": "Live Up to My Name", "album": "4Milli"}]}