{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/770790566878699d43ed58ab69a253ba.1000x1000x1.jpg", "title": "Déjà Vu", "year": null, "album": "Black August", "lyrics": "[Intro]\nCertain... Twilight zone\n\n[Verse]\nHe stared at me with his cold eyes, who was this old guy?\nDragged him in the building, as police drove by\nTook out my four-five, cocked it, put it to his forehead\nDugout his pockets, went in his shirt, and took his locket\nThrew him near the garbage, aimed the gun and shot it\nThen dodged quick, I dashed, so fast, felt the wind go past\nEverything went in a flash, hopped over the trash\nI ran around the corner, cut up the alley\nAnd made it to the back-door, into the lobby, then I stopped\nMy eyes was shot, all my stolen goods dropped\nMy body stood still like a rock\nI saw this kid holdin' a four-five, with the same old guy\nWith the same cold eyes, I looked out the building\nSaw the same cop car roll by\nIt woke me out the trance when I heard a shot\nSaw the old man cry, shit drop, by the garbage\nKid disappeared somewhere through the project\nSo I chased him, called his name, 'round the corner\nUp the block, through the alley\nThough the backdoor into a lobby\nWhen I came in, I saw the kid backin' up, with his gat in his clutch\nAnd floor full of stuff that he stoled from that man\nI glanced over the kid's shoulders, I seen the same old man\nAnother young dude with the gun in his hand\nPointed at the old man's head, makin' demands\nI looked out the lobby door, saw the same police man\nDrove by, it was no surprise, I said shot\nAt the same time I heard a gun pop\nLooked at the garbage, saw a man lyin' there crouchin'\nCouldn't believe what I was watchin', I walked near him\nShould I fear him, I said to myself, it's gettin' weird son\nI told to old man, stared in his cold eyes\nAt the same time I felt the ghost go by\nI looked up, saw me, holdin' the four-five\nI glanced back at him, asked him, what's happenin'\nWhat's the meaning? Am I dreaming?\nHe whispered, the locket that you stole from me\nOpen it, there's a picture\nSo I opened the locket on the silver chain\nSaw a picture of him, and he had the same initials as my name\nHope I'm not goin' insane, I can't explain, somethin' is strange\nI took off the old man's frames, put 'em on my eyes\nAt the same time, the old man died\nThen I cried, I felt like something inside me died\nIt got weird too, cause out of nowhere\nI asked myself, do I fear you?\nAnd a beard grew, I felt my face, took out a mirror\nLooked in it, my hair was silver and in terror\nMy body got cold, I broke the mirror, I felt I was old\nSo I closed the locket, put the chain over my head\nHid the picture in my shirt, like a curse\nI stood up and walked outside\nWhere a kid was waitin' for me, with a loaded four-five\nI didn't say a word, I just stared in his eyes\nSaid to myself, I know this guy\nThen he grabbed me by my shirt, then he dragged me inside\nI asked him why, but he didn't reply\nFuck it, I might be high\nHe reached in my pocket, he dug in my shirt\nThat's what I thought, damn, my locket\nWent and pointed the gun and cocked it\nThen he shot it, no, what's goin' on?...\nHe stared at me with his cold eyes, who was this old guy?\nDragged him in the building, as police drove by\nTook out my four-five, cocked it, put it..."}]}