{"songs": [{"year": "2018-12-05", "album": "Lifestyle", "image": "https://images.genius.com/8e1ccf4bffb1e69e1caeac42ff135a8b.1000x1000x1.png", "title": "Exceptional", "lyrics": "[Intro]\nOi cunt, I'm about to bring that real shit back\nShit's turned into a fashion show\nThey been missing and I been busy\n\n[Verse 1]\nI been busy on the hustle, it's the same drill\nA rush of blood, my music feelin' like cocaine feels\nThey want the technical rhymes, I'm like \"fuck that\"\nI used to have a stash pot in the bottom of my bum bag\nListen cunt, I can break a flow miraculous\nI came in an era when it wasn't 'bout the fashion bitch\n'Round the time when you really fuckin' had to spit\nI battle cunts and my mates would wanna stab 'em, shit\nMoments later, I'm a star, pop up everywhere\nThe sickest cunt and I never needed Medicare\nThey thought I left, I'm thinkin', I ain't going anywhere\nShe had a grudge, smash the box, I was getting square\nWhat we doin' with the game, where I take it now?\nSteer 'em off a cliff if they try to take the crown\nPeople ask how I make my drink change colour\nTwo-two-five, I still represent the same numbers\n\n[Hook]\nLeave this to professionals\nSelf made, self paid, I'm exceptional\nWhat you know about the rappin' game?\nI used to battle for a tenner in the alleyway\nThen I hit the big time\nLike, shit, stack it up, we gon' live life\nWhat you know about the rappin' game?\nEverybody stop and listen when I'm rappin' mane\n\n[Verse 2]\nNo certificate for school, I'm a dropout\nFirst you see the car, then the diamonds when I hop out\nI'm in the club, smokin' up, I let my chain hang\nThey see me and they attempt to do the same thing\nRollin' spliffs in Ubers, travellin' through the CBD\nGetting head off bitches, watchin' my old DVDs\nI'ma hit it up, you know me as the sickest cunt\nMy pack of smokes ain't got no ciggies, just filled up with fifty blunts\nAin’t no pressure when you're Kerser, I'm on top of shit\nA clumsy cunt 'cause I'm always fuckin' droppin' hits\nLet me walk you through the steps of meditation\nPreparation and then retaliation\nBitch, I’m still reppin' what I claim\nNo matter where I hang, it's embroidered in my brain\nBaked as and I’m sitting in my house ripped\nNew teeth, I put my money where my mouth is\n\n[Hook]\nLeave this to professionals\nSelf made, self paid, I'm exceptional\nWhat you know about the rappin' game?\nI used to battle for a tenner in the alleyway\nThen I hit the big time\nLike, shit, stack it up, we gon' live life\nWhat you know about the rappin' game?\nEverybody stop and listen when I'm rappin' mane\n\n[Bridge]\nSick of brag rap, shit I got mad raps\nSwag rap, fat rap, repellent to your back chap\nI'ma have this playing in the ghetto\nOr anybody with a mission just to get dough\nKnow the name, it's the Kerser, the shit\nYou got a spliff? This the one, you can burn it to this\nThe sickest spit on the track and I'm pumpin' my old shit\nThinking to myself, \"Well, no wonder it sold big\"\n\n[Hook]\nLeave this to professionals\nSelf made, self paid, I'm exceptional\nWhat you know about the rappin' game?\nI used to battle for a tenner in the alleyway\nThen I hit the big time\nLike, shit, stack it up, we gon' live life\nWhat you know about the rappin' game?\nEverybody stop and listen when I'm rappin' mane"}], "artist": "Kerser"}