{"songs": [{"year": null, "image": "https://images.genius.com/a51dcea6b49ee87e76d235126166aaf9.600x595x1.jpg", "title": "Make Way", "album": "5 ★ Stunna", "lyrics": "[Intro: Lil Wayne]\nHey! See me point that gun at y'all me no play!\nMe come for murder dem all the cowboy way!\nMe lick a shot sprayed from the set we make way!\nMe make way! Uhhh ohh no!\nHim 'fro so dark and him hat so low!\nMe never ever ever ask if he come solo!\nNow me head so hot, and me dreads so cold!\nMe so poor! Me come them say AYY!\nSee me point that gun at y'all me no play!\nMe come for murder dem all the cowboy way!\nMe lick a shot sprayed from the set me make way!\nMe make way! Uhh oh no!\nHim 'fro so dark and him hat so low!\nMe never ever ever ask if he come solo!\nNow me head so hot, and me dreads so cold!\nMe so poor!\n\n[Fat Joe]\nCoca bitch!\nHere is somethin you can't understand\nHow I can just kill a man~!\nShame what the mac can do, K's spit faster\nI'll make an ass of you, save the theatrics\nWatch like a quarter mill', chain like double that\nI ain't got to talk about the half up in the duffle bag\nStunna my brother, Weezy we the syndicate\nHundred Phantoms, hundred Maybachs, I guess we're nigga-rich\nI'll yellow bottle your face in, trust me\nLook at all the shit I be talkin and no one touched me\n\"Pray and pray for my downfall\"\nBig said it, so I made it rain 'til it poured\nSpeak from the heart, this emotional rap\nCatch feelings when you hear me, I'm supposed to do that\nCrack! A G what the streets done made me\nAnd the only language I speak is \"Fuck you, pay me, bitch~!\"\n\n[Hook: Lil Wayne]\nAnd when me come them say AYY!\nSee me point that gun at y'all me no play!\nMe come for murder dem all the cowboy way!\nMe lick a shot sprayed from the set me make way!\nMe make way! Uhh oh no!\nHim 'fro so dark and him hat so low!\nMe never ever ever ask if he come solo!\nNow me head so hot, and me dreads so cold!\nMe so poor!\n\n[Lil Wayne]\nSay pardon! Bad man no take pardon\nPeer gunshot army, dem make backup\nA man no fear no man, man no fear no one\nMan a real Islam, man a get down done\nA me no hear dem talk, me eat in me car\nRespect a soldier, him in a middle of war\nMe I'm Babylon gangster, Hollygrove monster\nYou no look familiar, roofers them kill ya\nGunshots I will cut then open toolbox and drill ya\nJump off body and let the mailman meal ya\nMe think I'm gon need the almighty one to heal ya\nAnd me behind the jungle with the lion and we killer\n\n[Hook]\n\n[Birdman]\nYup! Put it in the air nigga\nLight your lighters in the air\nThis for my dead homies, yeah!\n\n\"Gangsta Gangsta,\" that's what we yellin\nShoot him in his head, let his bitch go and tell 'em\nWe in the hood, getting money, we swellin\nBigger than life, you know it's the cheaper price\nBigger your stripes, you know what we doin tonight\nWe getting it right, we plan, they hit then flight\nWe know the rules nigga, live by none\nGet it by none, bitch I'll kill for my son\n\n[Lil Wayne]\nYeah! Gangsters don't live that long\nThat's why we gotta party everyday like Frank came home\nAnd it's hard for me to say that my heart ain't yearnin\nTo walk up in a church and believe the sermon\nBut instead, I spark up and relieve the burnin\nHoping that he understands my reasons for it\nNo, I ain't evil, I'm equal\nAnd nigga I ain't sweet, motherfucker I'm diesel!\n\n[Hook]"}], "artist": "Birdman"}