{"artist": "Casey Veggies", "songs": [{"title": "Networking", "album": "Customized  Greatly Vol. 2", "year": null, "image": "https://images.genius.com/1a029e524a5e116fb4512ade4b883627.756x720x1.jpg", "lyrics": "[Verse 1]\nWhere you at homie? I'm on the grind\n[?] nigga, I'm tryna shine\nWait your turn homeboy, just stand in line\nKnowing everybody at the stores and retail\nFile transfers and we sending e-mails\nAnd I ain't even trying to get into details\nWalking by myself and I leave with your female\nMy MySpace messages got a lot of fan mail\nWriting down rhymes while I'm talking on my handheld\nBut I ain't tryna give you more than I can tell\nAnd I prefer everything to be fresh\nMy slogan should be \"Clothes Where He Fresh\"\nAnd out of most of these emcees see best\nAnd I'ma give you Customized Greatly, none less\nHold on, stay calm, open your eyes\nRing all alarms, ring all alarms\n\n[Interlude]\nYeah\nI'm just tryna get my shine on, you know\nJust like everybody else\nI'm networking, you know what I mean\nI don't know why you can't understand that\nI'm just tryna do me, you feel me\nYeah, sending e-mails\nI just sent that producer a message, hope he sends me some beats or something\nI'm grinding, feel me\nJust tryna record as much as I can, that's it\nSee what you niggas talking bout, OF\nI'm out\n\n[Verse 2]\nThey ask me \"When is volume 2 gon' drop?\"\nI tell 'em \"When I think of the best shit ever\"\nGet 21 of the best songs and put them together\nThen read it to the world homie, I call it my letter\nRalph Lauren Polo is what I'm calling my sweater\nThey ask \"Are you doing this forreal?\"\nI said \"You better\"\nMe and my niggas gon' be rolling in that Benz truck, yes sir\nThe first to [?] wasn't right so I had to next her\nYou better than me, I tell 'em I can't let ya\nLooking pretty cute so I X her\nAnd on my mama, I'ma find that gold treasure\nI told my mama I'ma get my shit together\nI'm colder than the weather, I'm hotter than the sun\nI'm everything homie, just pick the best one\nYo, just pick me, I will complete the task\nAnd I'm feeling it so much that I'm [?] my swag\nI won't stop until I put that Gucci in the back\nAnd I'm walking out the store and I'm popping all the tags\nAs of right now, I'm just networking\nMight get some management\nSo we could be managing the whole industry\nI swear to God I'ma make it [?]\nMe and [?] got so much history\nCV DTA til I DC\nMan some of them sidecats can't even see me\nI'm just tryna stay clean, I ain't matching my clothes\nBut my pockets stay green\nI'm just tryna kick back\nI ain't worried bout no clubs, clubs\nAnd they call it networking cause I'm tryna get a buzz, bitch\n\n[Outro]\nLA I know you see me\nInglewood, what it do?\nCV in the place to be"}]}