{"songs": [{"album": "Special Effects", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png", "year": "2015-05-04", "title": "Anti", "lyrics": "[Prologue]\nThere's certain situations that occur throughout your life, that gives you an attitude, you know, a really bad attitude, because you've been taught by good people how to treat people with respect and you learned right and wrong. So, when shit is always wrong around you and you a mothafucka that's been taught to do right, you have a certain attitude towards those kind of mothafuckers or towards those things that are wrong and not righteous. You start getting a fuckin' attitude that might piss other people off. But you don't give a fuck, because the things that they do or the unjust shit that they do, makes you anti as fuck -- anti everything, anti everything they're about -- cause it ain't good, anti everything they fuckin' breathe or eat or whatever the fuck. You're just against everything that ain't right, why I feel like I feel. I feel like fuck the mothafuckers. I'm anti all that bullshit that they on\n\n[Verse 1: Tech N9ne]\n(Shit shit shit shit, mic check 1, 2)\nDownload this on the down low bitch\nI'mma amputate your fingers and the clown won't miss, nigga\nFuck everything that ain't righteous\nSpotify the reason the music became lifeless\n70% of a fraction of a penny is a game crisis\nMake a nigga wanna blow up they headquarters and blame ISIS\nI'm watching the riot from Michael Brown\nAnd I see a crazy nigga yell let's burn this bitch down\nWhy niggas, you fuck up the O'Reilly's\nThe BBQ spot and then the beauty supply niggas?\nDepreciating, for justice keep waiting\n'Cause you burned up everything except the police station\nI'm anti stupid shit, for ladies participating come and loot this dick\nThey been out and murdered Kendrick Johnson\nAnd covered it up, watch my sin get Compton!\nYou hate me 'cause tough and freely's the tone\nI ain't never shopped on Black Friday, nigga, leave me alone!\n\n[Bridge: Tech N9ne]\nI'm still smiling\nWhile I'm crying\n\n[Chorus: Band of Psychos]\nAnti as fuck\nAnti as fuck\nAnti as fuck\nAnti as fuck\nI'm anti as fuck\nAnti as fuck\nAnti as fuuuck!\nGo!\n\n[Verse 2:Krizz Kaliko]\nAhha! Listen!\nCOINTELPRO we livin' it out\nUsed to love turkey, devour Thanksgiving about\nJack your land from the Indians and murk 'em on it\nMake it bigger, then get the niggers to come and walk upon it\nGive 'em drugs and guns and excuses to never be\nBetter than a C-R-I-P or rep the letter B\nShow you you can YouTube it and make fights\nVatican at it again, bangin' for they gay rights\nAnd I'm supposed to follow YOU to the Promised Land?\nI ain't got no insurance, leave it in Obama's hand!\nAt 19 I slapped the shit out a cop!\nNow Ferguson had me murderin', burn down a donut shop!\nYou dumb niggas! Ooh, you'll be the only bum niggas\nGet your ass out the street 'fore I shoot me more than one nigga\nBill Cosby? WHAT THE FUCK?\nI was ridin' with you, till the 20th bitch got stuck\nI guess the Jell-O Pudding Popped her\nMy mellow, he couldn't stop\nHe would give 'em the Spanish Fly\nBut fuck it, so would I!\n\n[Bridge: Tech N9ne]\nI'm still smiling\nWhile I'm crying\n\n[Chorus: Band of Psychos]\nAnti as fuck\nAnti as fuck\nAnti as fuck\nAnti as fuck\nI'm anti as fuck\nAnti as fuck\nAnti as fuuuck!\nGo!"}], "artist": "Tech N9ne"}