{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/MV5BMTY0MDY3MjQxN15BMl5BanBnXkFtZTcwODQ2NzE1NA@@._V1._SY314_CR11,0,214,314_.jpg", "title": "Open Letter to Amanda Bynes", "album": null, "year": null, "lyrics": "As we all know I do interviews every single day about all my various projects, whether promoting AGT, Wild’N Out, my album, my stand-up special, NCredible consumer products, and various philanthropic and charitable efforts. Usually during these interviews I am consistently questioned about my wife, my kids, and my health and I happily answer them all. But as of lately I have been hit with an onslaught of questions about someone I consider family, someone I watched grow up, and someone I genuinely feel is one of the most pleasant human beings I have had the pleasure of meeting, Amanda Bynes.\n\nThe questions have ranged from, “Have you spoken to Amanda\" to “Are you working on her rap album\". Sometimes I would answer in a playful humorous manner and sometimes I would brush it off as another Pop culture topic that a reporter was trying to retrieve a sound bite for. But after recent events of Amanda being admitted under psychiatric care and reported as 5150, I see this as no laughing matter. I tweeted a few weeks about how the entertainment industry just consumes people and spits them out like flavorless bubblegum. A few chews of enjoyment then they’re under a city bus bench. Don’t get me wrong this is not a pity for the popular statement. I am always the first to say that fame and entertainment is one of the best and easiest occupations to ever have, but one must know how to navigate through the matrix or you may find yourself in a very dark hole. When a person is told all of their life that they are awesome, the best, the greatest and they are catered to every moment of the day. Imagine being the breadwinner in your household before you can even drive. Imagine you parents, teachers, and employers NEVER telling you NO. Anything you ask for or want, the world gives you, at some point you are bound to self-destruct. I call this “access to excess\". I’ve seen it happen to many of my friends and colleagues young and old. It goes back to that old saying; “Too much of anything is bad for anyone\". Whether it’s fame, money, sex, drugs, attention. It’s all a dangerous addiction. When there is no balance in your life a person will always become victim to their reality or lack thereof. The question is, when this destruction occurs, who is there to help put back the pieces. What do you do when you have no solid support system? When you feel like your friends are talking behind your back. When you feel like your co-workers are jealous and out to competitively sabotage you. When you feel your family has turned your back on you. When you feel like you parents have a conditional appreciation for you and only really love your money. You find yourself alone in that dark hole. Then you have to rely on your own devices once again in this vulnerable state. You become paranoid, frantic, manic, irrational because you can bounce your thoughts or ideas off of anyone anymore. Your reality no longer allows you to reason with the world, so you try to break through to get back to what you think is common ground. You are either trying to get back “hot\" again or just searching for that adulation that you once received daily from the masses. Then enters the media, or what I like to call the ultimate magnifier. It’s like if you have a delicate piece of tissue under the sun, that tissue is under INTENSE heat with nowhere to escape but once you place a magnifying glass over that tissue, it’s bound to instantly burn up in flames. This is what I believe happens to many people in the public eye and we all sit back and judge these people for our own entertainment. We say things like, \" I’m glad I’m not famous \", “Celebrities are Crazy\", “See what fame and money does to people\". And most of the time your assumptions and accusations maybe accurate but also inappropriate. No one on this planet needs to be judged or even has the right to judge. We are all equal and we all have our downfalls, fame or no fame. Money or no money. Life is hard for everyone in some since. And we need each other to in times of despair. No one can make it through anything alone. So I ask people who are quick to judge, tweet, report, or comment to ask yourself; what if that person was my sister? My brother? My Mother? Or me? What then would I say? In the words of the great poet and artist Bill Withers, \"Sometimes in our lives We all have pain, we all have sorrow\". We all end up alone in that dark hole at some point in our lives and if you don’t have a foundation of friends and family to help bring you up and out it makes that journey long and detrimental. So I say to my sister Amanda Bynes you’re not alone. I’m here for you. I understand. I care and I appreciate you, because that’s what family does and that’s what family is for. I also extend this to anyone else in my life, past or present that may find themselves in hard times. I’m here! Call me! Because I truly believe, the hand you’re helping up today may be the one you’re reaching for tomorrow. So not to be all cheesy and over sentimental but I got to end this with the ingenious Wither’s lyrics \"Lean on me when you’re not strong and I’ll be your friend, I’ll help you carry on. For it won’t be long until I’ll need somebody to lean on.”"}], "artist": "Nick Cannon"}