{"songs": [{"year": "1991-08-27", "image": "https://images.genius.com/40f66b653cd7b106d8dea9f33eac5a75.598x598x1.jpg", "title": "Road Block", "album": "I Need a Haircut", "lyrics": "Yo Doc, drop the beat in!\n\nThis is a incident that always occur\nWith the opposite sex, other word is her\nNo matter what nationality color or creed\nOr wherever you at, there's always a bad seed\nThey're always talkin about wantin to be alone\nYou're spendin too much time witcha friends, all night long\nI'm sayin yo what the heck, I am single\nIt's no reason why I shouldn't try to mingle\nSo I met this girl by the name of Maxine\nHer breath didn't stink she used Listerine\nShe looked crazy a-ight, and the whole nine\nBut this situation was one of a kind\nBecause I wanted her.. all to my own\nSo I called her on, my Mickey Mouse telephone\nI said, \"Hello pretty momma it's the guy you just me\nUhh what are you doin tonight?\"  She said, \"Nuttin,\" I said, \"Bet\"\nSo when I went to pick her up, I was in shock\nCause she brought her friend along for a ROAD BLOCK\n\n\t[Biz sings]\n\tAMERICAN WOMAN!  Why you do it to MEEEEEE?\n\tAMERICAN WOMAN!  Why you do it to MEEEEEE?\n\tIs it because I'm the BIZMARKIE?\n\tNo I think it's because I have the R-A-P\n\tI think you think I'm UGLY makin CASH MONEY\n\tYo I think all the girls is funny..\n\tAMERICAN WOMAN!  Why you do it to MEEEEEE?\n\tAMERICAN WOMAN!  Why you do it to MEEEEEE?\n\n(Yo Biz you know you don't usually be with things like that\nWhy you let her get away with that?)\nI thought she was buggin just to see what I'd say\nI said nuttin, let her friend come anyway\nOkay now listen what she wanted me to for her friend\n(What she want Biz?)  Expected me to pay her way in?\nIt's not like kid from stingy cheap or my name's Ebenezer\nBut I'm here to please Maxine, not to please her\nSo I still let it go by, and got her in the movie\nThank the Lord I bumped into my cousin named Cool V\nI said please Vaughn, take her friend off my hands\nSo I can be alone, and get my man\nHe said alright I'll introduce, she act like she was wit it\nBut when we try to split, she looked and said forget it\nI don't know whassup Vaughn, she must be buggin\nI thought you was in the way she was kissin and huggin\nSoon as I said - wanna make music like Sebastian Bach?\nI'm not leavin my friend with a guy but it's another road block\n\n\t[Biz sings]\n\tAMERICAN WOMAN!  Stay away from MEEEEEE!\n\tAMERICAN WOMAN!  Why you do it to MEEEEEE?\n\tIs it because I'm the BIZMARKIE?\n\tNo I think it's because I can R-A-P, no\n\tI think you think I'm UGLY makin CASH MONEY\n\tAll of this is funny..\n\tAMERICAN WOMAN!  Stay away from MEEEEEE!\n\tAMERICAN WOMAN!  Stay away from MEEEEEE!\n\nSo I was highly upset, and you would be too\nIf an icicle's in your way, stickin to you like glue\nI mean it's the end of the night, time to move on\nI'm tryin to kick ballistics so she'd come to my home\nI went to, yo bust it, call her when you get to your crib\nShe said, no and started cryin like a baby with a bib\nNow why you wanna bat me up and ruin my night?\nI coulda said no but I was bein polite\nShe tried to pull the I'm stayin over her house bit\nNot tonight baby you gon' be stayin at a Parkway Exit\nSo they went into the bathroom to get in a huddle\nIf you keep playin you're both gonna take the shuttle\nThey both came out the bathroom with a glance\nLike the bathroom they were goin to dance\nThey both approached me with the look of a rock\nI look and tell my senses ahh it's another road block.."}], "artist": "Biz Markie"}