{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Ask About Me (feat. Kid Cudi)", "year": null, "album": null, "lyrics": "Rollin' puffin' indo, roll up all my windows*\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo (Kid Cudi)\nIt's just chip tha rip and kiddo (Chip tha rip) Rollin' puffin' indo, Roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip the rip and kiddo, (yeah)\nAsk about me. [Kid Cudi:]\nDawg it's the weirdo again, I packed my bags back up in the land\nHoes talk down and then shake your hand better believe me my nigga supply and demand\nI walked that line I learned then ropes did my I prayed and hoped now I'm getting back\n? hoes wanna date put no limit just twerkin' and movin'\nI stick Pro when I get it in then I might dip fast\nIf you focused you might cash but not like rape so please fall back\nLive your life don't focus on money\nHello girl you can call me the moon man up above\nI fly fast anywhere nigga any giving time a couple lines homeboy\nI ain't gotta rhyme so nice with it\nAnd I keep that wahoo fitted flow was gravy?\nBack in high school hoes tried to diss me\nNow all I gotta do is sing for a pretty thing give me five minutes she all on my ding-a-ling\nCan't live if you ain't about something can't talk if you live life frontin'\nBoss life from invisible see a model then it's go time\nAnother hand did so I took mine didn't have a watch so I took time\nFormat it now they gotta jock it\nMy slim cut jeans haters try to knock it now them same mother fuckers keep 501's\nThen be bumpin' that slab bub. Rollin' puffin' indo, roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip tha rip and kiddo Rollin' puffin' indo, Roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip the rip and kiddo, (yeah)\nAsk about me. [Chip Tha Ripper:]\nI be on that-that monster shit\nRAWR bitch, lot's of dick if hoes get to beggin' that front door shall be their consequence\nGet up outta here bitch, cudi got some hoes comin' and when them hoes come all they talkin' cummin'\nTurn pike hustler that'll be I\nPullin' up to your city pretty high\nAnd it's all for the rent it's all for the fifth the money goes to the kush packs in the seeds\nAnd the music I do it for the hoods and the kids and the baby mamas who be in the hood with the kids\nDo shit for the money fuck a favor text the address I'll see you later\nM.I.A that's where I'll be but for now Ima g r i n d\nTill a nigga caked up ain't worried bout shit\n? time nigga better worry about shit? time nigga better worry bout? they gone be up in your ass\nIf you talkin' that shit to the wrong mother fucker from the jungle dog\nNiggas out here come and hunt you down\nDogs still be wild with a mother fucker and them 15s be jumpin dog\n? in the place,? on my face\nFresh scampy I'm loving that taste,? 12 hundred for the case\nMe and Cudi headin' out what's good\nYou done feel off like we knew you would\nNow I can show you how to be a real nigga be the? and still be true to your hood. Rollin' puffin' indo, roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip tha rip and kiddo Rollin' puffin' indo, Roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip the rip and kiddo\nAsk about me. Rollin' puffin' indo, roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip tha rip and kiddo Rollin' puffin' indo, Roll up all my windows\nWildin' with my kinfolk, for real tho'\nAye it's just chip tha rip and kiddo\nIt's just chip the rip and kiddo\nAsk about me"}]}