{"artist": "I-20", "songs": [{"title": "Can’t Be Stopped", "lyrics": "I knooooooowwwww, I know I can't be stooooopped!\n\n[Verse 1]\nYea, uh, Deala, uh, uh, uh, uh, uh...\nThe definition of trillness, outta the South\nJust that real shit, not anotha nigga runnin' his mouth\nPay attention, I'll explain why I can't be stopped\nAnd how I came to be the man on every neighborhood block\nBronson, a young fly nigga straight out the slums\nCandy paint on Monte Carlos in the decks where I'm from\nRemember when I was first back from pullin' the first grab\nOr when the crack came I was the nigga with the first slam\nWho wants the 'yours truly', y'all cannot school me\nPut so much coke on the streets, Pepsi tried to sue me\nWearin' a throwback, I dropped faces and ? crack\nAnd if I can't rap, the trap is where I'll go back\nThis just one dimension, of a nigga spittin\nYou're now welcomed to the dawnin of a new beginnin\nI'm the quarterback of crack because it's logical\nDon't want that yay, I'll switch up the plate, call me the honorable\nDeala not yo average dick ridin' bitch nigga\nI'm more like a Benz 6 ridin' sick nigga\nYou know you the ??? darkskinned, heavily tatted\n??? spark ten, heavily gatted\nC'mon dawg, you can't fuck with me, leave it alone\nI got killaz on standby, breathe and it's on\nIf this truly is a game then I'm the legend who wrote it\nAnd be careful cuz the bases ain't the only thing loaded\n\nI knooooooowwwww, I know I can't be stooooopped!\n(I can't be stopped, I can't be stopped!)\n\n[Verse 2]\nChrome wheelz on the 600, nuthin' but wood\nI-Double, DTP, we ain't nuthin' but hood\nYou still tryina get a deal, but yo time's runnin' out\nYou diarrhea in yo ass, the shit's not comin' out\nOkay, you dropped a lil' album, still got no ends\nI made more in a month doin 'Cris ad libs\nDo a background check on me, see how I live\nDon't let that Mac ground spit homey, think of yo kids\nDown hea, we for real, not just wordz and a rap\nDeala bitch! The same love in the burbs or the trap\nI can bang witchu, slang witchu, ride when I need to\nDrop somethin', cop somethin', slide when I need to\nYou don't know me and all the warz that I've fought\nIn the club, fuck the bottle, whole bar gets bought\nBronson! I'mma made man, you do the knowledge\nAll you is just middle school, see me in college\nPussy rimz are not legal, fuck a learnin' permit\nMe, I ride on grown men and the mirror's the tint\nY'all niggas not quiet Ludacris, nowhere near Shawnna\nA mill ??? Fate, and Tity some otha drama\nAnd Tit' needs to get the title let alone the respect\nOn every block I been on, not only the deck\nIt's the same shit, different day, I'm stuck in my ways\nDTP, we run the streets until I'm stuck in the grave\n\nI knooooooowwwww, I know I can't be stooooopped!\nI knooooooowwwww, I know I can't be stooooopped!\nI knooooooowwwww, I know I can't be stooooopped!\nI knooooooowwwww, I know I can't be stooooopped!", "image": "https://images.genius.com/f9a5e3eeca61ca626398c9252f456f72.300x298x1.jpg", "album": "Golden Grain", "year": "2002-09-10"}]}