{"artist": "B-Real", "songs": [{"album": "The Prescription ", "title": "Stix Stones", "lyrics": "(Verse 1 - B-Real)\nSee the meteoric rise, see we going for a ride\nYeah we never looking back, we keep our eye on the prize\nLike the harvest, cut you down to size\nPut the dab on the nail, dry 'em out, give 'em California highs\nNeed a dose? I can give it too ya, load you up on jet fuel\nFly you fuckin' outta here, fuckin' with your mental\nSee it's on, when it's on and it's on in ninety-forty packs in the trunk\nPo-po flow behind me\nI don't care, I'm the doctor, I'm silk like the shocker\nGot the bitches smoking hard, baked out like Betty Crocker\nPut my foot in your ass like I stored it in the foot locker\nRep my fucking city like the vest with the bottom rocker\n\n(Chorus/Hook - Ab-Soul & B-Real)\nSticks and stones may break my bones\nBut words can never harm me (Keep talking)\nNo sticks no seeds up in my weed\nThe prettiest penny what it cost me (Blaze it up)\nI hope you got a couple iron lungs in yo' chest because (This right here is not a test)\nI told you (This right here is not a test)\nI told you (This right here is not a test)\n\n(Verse 2 - Ab-Soul)\nEverywhere I go I'm smokin' dope\nIs my name So-High or is it Soulo?\nWhen you on top of the game they want you to throw 'em rope\nYou get hung tryna hang out\nI'm Willie Lynch in reverse\nYou show boat but should've bought a yacht first\nWhen the loud around you in the death row, like a Pac verse\nYa heard me? What the business is?\nMy niggas curry chicken in the coup like Carribeans\nAngel wings on a villains back\nThat's how I rap\nAnd when I travel I never pack without the pack\nHit Dr. Greenthumb to schedule an appointment\nHe told me smoke two zips and call him in the morning\n\n(Chorus/Hook - Ab-Soul & B-Real)\nSticks and stones may break my bones\nBut words can never harm me (Keep talking)\nNo sticks no seeds up in my weed\nThe prettiest penny what it cost me (Blaze it up)\nI hope you got a couple iron lungs in yo' chest because (This right here is not a test)\nI told you (This right here is not a test)\nI told you (This right here is not a test)\n\n(Verse 3 - B-Real)\nListen to Mike, do a hundred dabs\nGet the nail hot, bitch got the finest slabs\nThrow your flowers in the air, it's up for grabs\nNow your face is gettin' tighter, I'm cuttin' shit with dabs\nWe get 'em high like the holy ghost\nBatman smokin' kush, thinkin' holy smokes\nGot you faded out while your homies joke\nGive you the prescription, hit the loud while your homies choke\n\nHey yo Ab, keep the engine running\nLace around the weed like its the Vikings and the Indians comin'\nFunky feels on the tip, come on hit it\nTakin' out your suckers, and you don't know how I did it\n\nThrow me out a window cause I'm real stoned\nDavid slew Goliath when he threw me at his fuckin' dome (owch)\nBrick top, you get mopped tonight and guarantee\nNo one's gonna say a thing, hear a pin drop\n\n(Chorus/Hook - Ab-Soul & B-Real)\nSticks and stones may break my bones\nBut words can never harm me (Keep talking)\nNo sticks no seeds up in my weed\nThe prettiest penny what it cost me (Blaze it up)\nI hope you got a couple iron lungs in yo' chest because (This right here is not a test)\nI told you (This right here is not a test)\nI told you (This right here is not a test)", "image": "https://images.genius.com/23ff7ffb705ca053890ac1ccd9360188.500x500x1.jpg", "year": "2015-02-18"}]}