{"artist": "Ant Banks", "songs": [{"title": "Packin’ a Gun", "image": "https://s3.amazonaws.com/rapgenius/60022300iprv.jpg", "album": "Menace II Society (Original Motion Picture Soundtrack)", "lyrics": "Sample: \"Never leave the pad without packin a gun\" -] Eazy-E {*1}\n\nLet me drop it on the one, heheh\nYeah..\nReal smooth youknowhatI'msayin?\n\nChorus: unknown singers\n\nIf you think this shit is funky\nDon't be a punk, nigga, just get in the groove {*1}\nAnd if you think this shit is funky\nDon't be a punk, nigga, let it get into you\n\n[Ant Banks]\nYeah, check it\nWell let me hit it like this, fool Ant Banks is back\nStill comin way tight, straight gangsta mack\nYou see the bitches know I'm loaded, smooth as a poet\nDroppin shit like a pigeon just to let you suckers know it's\nThe grip that I clock that makes the hoes jock\nAnd niggas get to trippin, and talkin hella shit and\nDon't you know your bluffin ain't enough you see\nThat all you mark motherfuckers can't FUCK with me\nSo bring it on cause I got somethin for ya\nMac-10 strong, smoke that ass like doja\nBreak that ass off, until I leave yo' ass broke\nI'm icin like Tyson boy I ain't no joke\nA lot of niggas now think they made of steel\nToo tough to get took, and that's for real\nBut let me tell you like $hort nigga, that's your life\nCause niggas I know get took every night\nTryin to show out and look good for the hoes\nBut everybody knows how the story goes...\n\nThe bitches ain't shit cause they all into gafflin\nBreak a ho jaw, and I might start laughin\n\n*chuckles*\nThat's how it is so you better play it safe\nAnd get you a gat in a smooth ass place\nAnd you will never trip when you're tryin to have fun\nBut nigga you should {*1}\n\nChorus\n\n{*1}\n\nSlap the hand *boom boom*\nPut a cap smooth in that ass\nI want you to just slap the hand *boom*\n{*1}\n\n[Ant Banks]\nLate night trippin on a Saturday night\nHangin at the Uptown, hoes is tight\nThinkin to myself, \"Yeah I'm finsta make a come-up\"\nI'm doin the first tramp bitch that wanna run up\nSeen a little tight one, the bitch said, \"Hey!\"\nRushed that ass to the store and got the Tanqueray\nPulled over to the side, now I'm cold on the mission\nThrew the bitch in the back and put that ass in position\nBaby broke me off, OOH somethin kinda proper\nBitch was so tight, I didn't wanna stop her\nNow a nigga trippin, sippin on gin\nDrunk as fuck, and out comes her boyfriend!\nTime to call it quits, cause the fool might trip\nBut the nigga shoulda known that a bitch ain't shit\nHe reached for the do', now I got him in focus\n.380 on that ass, now his life is like hopeless\nAll over one little stupid dookie bitch\nWith a funky ass cock and some juicy ass lips\nBut I never trip when I'm tryin to have\nYeah nigga now I {*1}\n\nChorus\n\n{*1}\n\nSlap the hand *boom boom*\nPut a cap smooth in that ass\nI want you to just slap the hand *boom*\n{*1}\n\n[Ant Banks]\nYeahhhahhh, much props to the motherfuckin Dangerous Crew nigga\nYouknowhatI'msayin?\n\nChorus (1/2, - {*1})", "year": null}]}