{"songs": [{"album": "I Really Rap", "year": "2017-11-14", "title": "Losin’ It", "image": "https://images.genius.com/8c75d09384d3e2e7dd519dae8ec8c1f5.1000x1000x1.jpg", "lyrics": "[Intro]\nUh, 1 2\nBring my levels up\nThey gotta hear me\nYeah\nLive From Harlem World\nZeus Uh, Yeah, Yeah\n\n[Verse]\nNiggas tried to stick with me but they been gettin' crossed\nYou better check my history like you was insecure\nSpittin' fuckery but claim that you've been gettin' off\nHow could you fuck with me? Ya tape been gettin' menopause (men-to-pause)\nI should D-Mac but I'm plottin', where you be at?\nI'll Park you anywhere like I'm ridin' in a Fee-at\nOr Fiat, nigga relax, you 'bout to make me relapse\nKarrueche with the body pic, nobody wanna see that\nAll my tracks is a classic, I don't clash with these rappers\nAll that trash you performin', you don't match up with Cassius\nI'll have you staggerin' backwards and then its ashes to ashes\nHope you have the ray zapper, if I ever catch you in traffic\nNigga, fact is I'm fresher and you's a passive-aggressor\nPickin' who you want friction with, more like static selector (Statik Selektah)\nMe, I spaz on whoever, what's a pimp to Neutrogena?\nI'm dead cold with it, Kenneka Jenkins in a freezer\nBitch, I'm clinically crazy, y'all can't lyrically fade me\nCasey Anthony, can't you see how I'm killin' 'em, baby\nThis is bigger than KD, who can get with me lately\nI tried to picture that shit, then the picture get grainy\nMaybe you niggas just lazy or your lyrics fugazi\nIf you claim that I'm bitin', you must be livin' with rabies\nHow you think that you made me? Man you frauds need to get in tune\nMy studio is me and Duke Da God in the livin' room\nMean, I was eighteen, mobbin' with the A-Team\nLines you could never fade, I ain't usin' Beijing\nAin't nobody feelin' you, y'all ain't what the game fiend\nI had most of the city blue when I was in the state greens\nI'm God chosen, bars golden, y'all foldin'\nI studied under Lamont Coleman, heart frozen\nBig L is where the heathen got his flowin' from\nThey say I be loosin' it, Yeezy ain't the only one\nBeyond raw, want war? Get an encore\nDNA all over the place, Kendrick Lamar tour\nYeah, this is hardcore, who say they playin' hard ball?\nI cook up so much hard, I'm 'bout to send some shit to Rob Ford\nPlease believe, I'm killin' 'em with ease\nYa girl don't want for nothin' 'cause I give her what she need\nHuh, nigga please, that bitch don't get to breathe\nShe be on her knees so much they 'bout to kick her out the league (HA!)\nShit is simple, how I dip through these instrumentals\nBut tell me how you got the title when you in a rental?\nI see the skits you into, keep thinkin' it's Jimmy Kimmel\nI put this 'fif on ya mental, welcome to 50 Central\nIt's a fact, I loose friends when I rap\nFuck a label, I'm independent I want everythin' back\nNot to mention I'm crack and so much of a rap god\nYou Niggas is wack, I should mumble my last bar, Zeus"}], "artist": "J.R. Writer"}