{"artist": "G Herbo", "songs": [{"title": "Black", "album": "Humble Beast", "year": "2017-09-22", "image": "https://images.genius.com/8a402b14fb90700c3fd8c750afa7b8eb.800x800x1.jpg", "lyrics": "[Intro]\nYeah, ya know if you wonder why I ever tell y'all\nYeah or whatever I'm on, ya know what I'm saying, in the studio\nI'm just, I just gotta tell y'all my move\nWhen I'm on some boss shit, I gotta embrace my power\n\n[Chorus]\nI had to go black for a moment, no IG\nI wasn't in these streets\nMan, I couldn't tell my friends from enemies\nIt was all good, I was off them Percies, sipping lean\n'Til my mind told me stop or you ain't gon' have anything, anything\nYou ain't gon' have anything, yeah\nYou ain't gon' have anything\nMy mind told me stop or you ain't gon' have anything\n\n[Verse]\nI know for my niggas I'd do anything\nCause I love 'em, I won't take credit for anything\nI know niggas that's gon' take credit for everything\nNiggas always take from you, ain't give you anything, them your enemies\nI done so much in these streets that I been a G\nI just might kill me a nigga off Hennessy\nI think I might be too real for the industry\nAnd when I die, I just hope they remember me\nI was the flyest lil nigga in class\nI was the one who stood out in assemblies\nI seen my niggas die before my eyes\nSo I'm the last nigga to show you some sympathy\nCock my shit back, blow it 'til it's empty (bow bow bow!)\nAnd I commit murder if you would tempt me\nFuck bitches, leave 'em, make 'em resent me\nBitch, I'm a sinner, I'm not repenting\nGod forgive me for my sins, but you know just where I been\nGive a nigga the whole thirty, amen\nProbably shot a nigga and forgot, fucking with them Xans\nIf you ran, got shot in the back for playing\nShouldn't of moved, I'm just saying, that wasn't part of the plan\nBoy don't front your move, watch what you saying\nThat might be his man, running your mouth\nThen wonder why they shot up your house\nOpen your mouth, fuck nigga, you a man or a mouse?\nFamily always calling me 'cause I'm the man of the house\nIn a sense of emergency, I've got a man in route, thirty on 'em now\nI can't break a sweat, bitch, thirty on me now\nYou see what's on my neck, bitch? Thirty on me now\nDiamonds look like blaow\nGot your bitch, wanna fuck me now\nThirty hit like blaow\nArmy shit like Colin Powell\nI went to Bouchet, I ain't go to Powell\nMe and shawty fuck, we was running wild\nAnd big bro just beat two bodies\nStill ain't shit then get you bodied\nAnd I got on Chanel deodorant, I might pull up in Maserati\nI rap street shit like I'm Hov on 'em, still go fast like kamikaze\nAnd I go move to any state, keep foreign shit in my garage\nThat mean I might be me, you not, you want me, bitch? Bring my deposit\n\n[Outro]\nAy, G Herbo\nYou already know what the fuck it is, man\n\"Humble Beast\", swervo, you know?\nThis record man, I'm tryna go down in history\nIf I ain't gonna be the greatest, I don't even wanna do this shit\nFor'real, like for'real, for'real\nThat's why, ya know what, they ain't no fly by night shit\nI don't want niggas to feel like, ya know what I'm saying?\nI'ma stay as humble as possible\nI'm as humble as they come, you know?\nBut in all actuality I just want niggas to know\nYou not fuckin with me"}]}