{"songs": [{"image": "https://images.genius.com/ef1a5d9441bc333a96d37c7212da57b8.500x500x1.jpg", "title": "Intro (Road To Till The Casket Drops)", "album": "Road To Till The Casket Drops", "year": null, "lyrics": "[Intro: Pusha T]\nClipse and Re-Up Gang Records presents\nThe Play Cloths mixtape\nThe prelude to Til The Casket Drops\nThird time's a charm motherfuckers\nWe done seen it all, We done done it all\nWe done been through it all\nAin't nothing but warriors here\nYes!\nTurn my headphones up\n\n[Verse 1: Pusha T]\nThey say the third time's a charm, I say that's too long\nTo go unrecognized when you're a phenom\nClearly you can see that I'm the best like I'm in neon\nTil the Casket Drops, the greatness is reborn\nNo excuses, no more [?]\nGot a newfound love for everything that's jewish, I\nDuck the Judas and I dodged old Brutus\nThe backstabber out the way\nMotherfucker's let's do this, It's the\nHood's Obama, shovelin' McCain\nOut the project windows, the Drama's insane\nThe rap game's upside down like David Blaine\nYou fans is Times Square for following them lames\nI gave you truth, revealed my proof\nLoosened the knots from your minds I was your masseuse\nThe message got twisted, I'm just young, black and gifted\nThe theme was coke, but the line's was uplifting\nOn my road to the riches with the bitches in the cars\nIt ain't hard to tell we can't all be Nas\nThe truth really is we can't all be stars\nBut I'll be goddamned if I settle for Bronze - ever!\n\n[Interlude: Pusha T]\nHaha! Never!\nNever, motherfuckers!\nTil the Casket Drops!\nAs If you don't know!\nAll we give you is classics!\n\n[Verse 2: No Malice & Pusha T]\nDear god forgive my iniquities\nThe triple beam weighed it down like it's Mister T\nI play the keys, Beethoven had the center piece\nStayed with them bundles, a joy since they infancy\nY'all in disbelief, the coach roofless\nCruise by I smack 'em in the face like the Stooges, as if\nYou can be like me, niggas is clueless\nThe insulated doors silence the acoustics\nNothing beats a true flip I do it in the dark\nI cut it just right like when I parallel park\nMy hands in the white like on the parallel bars\nThe coke that I push is as pure as a child's heart (My God)\nI still take part, I can't even say formally\nTil The Casket Drop or cops corner me\nOyster Rollie watch, white diamonds adorning me\nYou better cry for yourself, ain't no sense in you mournin' me\n\n[Outro: Pusha T]\nNo, ain't no mourning us\nIf I die today or tomorrow I done it all\nYou tell me how you one of the best, huh?\nYou better cry for yourself !\nPresident E-motherfucking-lect!\nThis is how you start a campaign!\nTil the Casket Drops!\nYeaugh!"}], "artist": "Clipse"}