{"artist": "A$AP Ferg", "songs": [{"title": "Fuck Out My Face", "image": "https://images.genius.com/6a2f58fb40c2a44463c586658c8fc9ae.1000x1000x1.jpg", "album": "Trap Lord", "lyrics": "[Intro: A$AP Ferg]\nGet the fuck outta my face\nGet the fuck outta my face\n\n[Chorus: A$AP Ferg]\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\n\n[Verse 1: B-Real]\nWho's Dr. Greenthumb? Anybody seen him?\nNot another white bitch, time for a re-run\nNeed some green sum, seen some homie\nSend you a ton but I keep some homie\nKing of Queen, the kind you blaze\nWhole team on lean on Pisa sway\nI'm ghetto and the pump got a critter all splattered\nHave another hit but I want to hit the shatter\nDabbing all night really got me faded\nTake a hit of my shit feel upgraded\nTwist that shit like your weave got braided\nChilling in the palm trees feeling real shaded\nPass that shit like a deadly virus\nShe want to hit, that's Miley Cyrus\nHit it so hard, my god, she likes this\nChange that chick's name to Miley Cypress\n\n[Verse 2: A$AP Ferg]\nA$AP Fergie, A$AP Mobbin'\nBitches on my ballsack, want a nigga Martian\nAnd a Miss America, picking any target\nBitch give me long neck like an ostrich\nAston Matthews in an Aston Martin\nVroom, driving retarded\nSipping on that Crissy cause a nigga really ballin'\nHeaded to the telly with a bunch of Kelly Clarksons\nThey love that I'm from Harlem\nThey love to see a broad and\nAnother broad and kiss and massage 'em\nGive them booty shots might Nicki Minaj 'em\nDont let 'em get me hard then\nTell they friend give me jaws like a shark fin\nYou'll play Halle Berry in Monster Ball and\nI'll be Trap Lord Billy Bob Thornton\n\n[Verse 3: A$ton Matthews]\nOh shit, who let these Hulk Hogan hoes in with nose and chest open?\nThat water hose got us sipping, that Molly Maid got us dripping\nOkay, I get that A$AP, A$AP\nTake naps from the K clap, I'll bring it where you lay at\nGang colder than the face off, you don't want to face that\nGot these hoes dripping out the Versace, 4-4's keep the 4's off\nFour boats so the hoes drop and that rose gold keep the dome sloppy\nHaaan, molly party, molly party\nThem bitches know it's a molly party\nDodging cases cause I'm dropping bodies\nNumber one stunner, camouflage Hummer\nNose job, had to paint it white for the summer\nI'm a hit stick drummer, heavyweight\nTriple H, Hall of Fame head hunter\nMinivan gram Van Dam, hand in hand in the Trans-Am\nChoppas all test tap dance, Hammer Time Ham dance\nPut that pussy on a handstand\n\n[Chorus: A$ton Matthews]\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face\n\n[Verse 4: Fredro Starr & Sticky Fingaz]\nYeah, better get the fuck out my face with all that\nOr get a broken beat down with a baseball bat\nFerg said call a nigga A$AP back\nOh, just looking for his baseball bat\nI'm a thug with a baseball cap\nGot a bad bitch slim waist from the back\nAss ain't fat but her face all that\nOh, she like to fuck in my baseball cap\nI'm a CB-GB, Crazy Baldhead Grimy Bastard\nYou a BG-GB, Bitch that's Gonna Get Blasted\nSo don't set trip cause I love to trip\nMy niggas trip, acid\nI don't give a fuck if it's fake or real\nThose titties coulda been plastic\nOfficial Nast', my gang's official\nMad faced niggas with anger issues\nHundred mad niggas got a gang of pistols, blaow\nNow, how the fuck can a stranger miss you?\nMy whole set, ganged up\nPlay yourself get ya banged up\nSuicide, you get hanged up\nShe done fuck the crew, she got ganged up\nGet the fuck out my mothafuckin' face\nI'll pull the heat out my mothafuckin' waist\nGet the fuck out my mothafuckin' face\nI'll pull the strap out my mothafuckin' waist\n\n[Outro: B-Real]\nGet the fuck out my mothafuckin' face\nGet the fuck out my mothafuckin' face", "year": "2013-08-20"}]}