{"artist": "Ice-T", "songs": [{"title": "New Life", "lyrics": "* Styled after AZ the Visualizer from the album _Pieces Of A Man_\n\n[Intro: Ice-T talking]\nYeah, Iceberg, 2006\nBeen out the game for a minute\nYou know, just checking it out\nTo tell you the truth; most of y'all niggas sound real soft, real happy\nEveryday niggas ask me for that gangsta shit\n\n[Kryst]\nIt's a new life for me, yeah\n\n[Ice-T]\nConfessions of the ghetto nigga, cursed at birth\nI brought the guns to the Rap game, bitches and work\nHit your body with the pump shotie, watch you jerk\nL.A. Westside, nigga, now in New York\nThe berg; nothing gave out the words I say\nI'm a grown man, ain't got no fucking time to play\nStep on the game once, I recruite and parlay\nSlide out it for a minute, step right back in it\nWhy not?.. y'all niggas don't rap that good\nThe truth is.. y'all niggas ain't all that hood\nYou act like gangsters but ain't got the heart to be one\nI act so I know the fucking actor when I see one\nToo much security, too much crew\nToo much hype, nigga, not enough you\nMe!?, they call me double O.G\n\n[Chorus: Kryst]\nIt's a new life for me, yeah\nBirds flying high, you know how I feel?\nSun in the sky, you know how I feel?\nReeds drifting on by, you know how I feel?\nIt's a new dawn, it's a new day\nIt's a new life for me, yeah\n\n[Ice-T]\nSee me in the streets or bowling up in the club\nMe and Lil' Ice roll like lawn wolf and cub\nDon't worry about the clips, nigga, watch my fist\nWatch my bitch, watch my new compact disc\nYour album is garbage; filled with love songs for pussies and hoes\nI keep it gully, nigga, every one knows\nIt's all the game, til you see the flame filled the pound and\nSecurity is on their toes every club that I'm in\nCause they know I don't give a Goddamn\nNever bust techs cause them fucking shits jam\nRespect! but I don't respect that much\nI like Mobb Deep and Nore' -- some mothers like Shyne\nGame from the Westcoast, them niggas can rhyme\nKeep it hardcore, keep the shit gully and street\nAnd don't let soft R&B niggas make your beats\n\n[Chorus: Kryst]\n\n[Ice-T]\nWho's the fucking greatest MC and who cares?\nWho can fucking shit on my name and who dares?\nI straight reinvented this whole fucking game of rappin'\nI'm may not be a General, I'm damn sure a Captain\nPull your pants up, nigga, lean back\nYou're strapped, but ain't got the heart to squeeze that\nThe rap game's in the ER laying on its fucking back\n\n[Chorus: Kryst X2]\n\n[Ice-T]\nConfessions of the ghetto nigga, cursed at birth\nI brought the guns to the Rap game, bitches and work\nHit your body with the pump shotie, watch you jerk\nL.A. Westside, nigga, now in New York\nThe berg; nothing gave out the words I say\nI'm a grown man, ain't got no fucking time to play\nStep on the game once, I recruit and parley\nSlide out it for a minute, step right back in it", "image": "https://images.genius.com/44e03781386ef22a962df8d6b6e26c72.640x640x1.jpg", "album": "Gangsta Rap", "year": "2006-10-31"}]}