{"artist": "WC", "songs": [{"year": null, "lyrics": "(Intro W.C. Talking)\nDamn I mean when this shit come on right here (Dub-C)\nI mean you gotta put yo hands up (Dub) you got to (Dub-Dub-Dub-C)\nI mean Im looking around right now and I dont know whats real I mean I seein all this bullshit on TV all these weirdoes out here, I dont know whats going on but Uhh\n\n(Hook)\nIf its on then its on let me know that its on\nIf it ain't really on tell me whats going on\nIf its on then its on let me know that its on\nCuz Uh-Ohhh Its my reality show\nIf its all for the dough and its really a show\nNigga, lemme know cuz the triggers ready to blow\nIf its on then its on let me know that its on\nCuz Uh-Ohhh\n\n(Verse 1)\nMan up time to put ya hands up\nI come too far to lay down, so imma stand up\nAnd let the truth be told\nCuz majority of niggas in this rap shit ain't nothing but hoes\nWhats the Flava? ain't no greater\nThan this double-pump shaker shakin up the party with the new ankle-breaker\nSo hold on while I take the strap and reload\nAnd tune you niggas in to my reality show\nFirst up? never the least..\nI kick it off where the sun rises like yeast Imma start in the east\nThe Big Brother when hip hop\nWas just like L.A. radio done sold their sole & went pop\nI used to recognize the welcome mat\nBut now in the Cash Cab nigga I dont know where Im at\nMy nigga Slay said the other day\nI Love New York but radio done let the Projects Runaway\nI told him dont sweat it and dont stress those\nCuz over here Loc, we got it even worse on the west coast\nA gang of niggas smellin like similac on my station\nWit no respect for the foundation\nIm grabbing my flame thrower\nIts a Dirty job but radio needs an Extreme Makeover\nLook They can't bullshit Dubb\nMy pants ain't tight enough to be in their Celebrity Fit Club\nHip-hop Ultimate Fighter No pretender\nThree fifty seven south central Contender\nIm south of the ten freeway.. turn the wheels\nWhile these rap niggas scared to come down the hills\nOn the block where the Glock is kept\nThe Apprentice in the kitchen with the homie workin scales like a Top Chef\n(Yep). gotta keep another plug\nCuz staying down with this rap shit is Tough Love\nNo affection Thats why im headed in the northern direction\nPluggin wit my bay area connection\nUp north got the bomb bay to make sure the Sac pay\nThe homie E-40, Too Short & Mac Dre\nIts my reality show, and my reality is smashin\nFuck Keeping up with the Kardashians\nIm hiding from the Repo Man so get the deals nick\nKeep a roof over my kids head is real shit\nCan't sit around and wait til it comes back around\nGotta get it down south is where its at now\nWell I got that the make they lungs cough\nAnd a homegirl wit me to throw the ones off\nIt ain't a Simple Life its a grind & all the above\nIm getting a shot of hen nigga, fuck A Shot at Love\nAfter riding my stick\nMy homegirl said Chili want a square, but she need some westside dick\nI said you know I ain't right.. Ill dig her out all night\nFuck her and kick her to the curb like a Basketball Wife\nPlus she ain't down enough to be mine\nIf we get caught, The First 48 she droppin a dime\nHave a nigga in jail lookin like The Biggest Loser\nWit the receding hairline like Carlos Boozer\nSurreal Life a nigga can't play wit this\nKeisha Colell Even tell you thats The Way It Is\n\n(Hook)\nIf its on then its on let me know that its on\nIf it ain't really on tell me whats going on\nIf its on then its on let me know that its on\nCuz Uh-Ohhh Its my reality show\nIf its all for the dough and its really a show\nNigga, lemme know cuz the triggers ready to blow\nIf its on then its on let me know that its on\nCuz Uh-Ohhh Its my reality show\n(Scratching & Mixing Dubb-C fading out)", "image": "https://images.genius.com/776bb40462908854239af48b4db3c1b5.500x500x1.jpg", "album": "Revenge of the Barracuda", "title": "Reality Show"}]}