{"artist": "Pharoahe Monch", "songs": [{"album": "PTSD: Post Traumatic Stress Disorder", "title": "Time2", "image": "https://images.genius.com/686aab555fbbb698ceb705b0483ec393.1000x1000x1.jpg", "lyrics": "[Hook] (2x)\nLord, lord, lord\nWell well well well well..\nHelp me cleanse my sins\nHelp me lift this spell\n\n[Verse 1]\nWe fight demons from our past only to face new monsters\nI ask, are we comatose or unconscious?\nMy top spin's perpetual, make the connection\nYou sleep cause reality bites; inception\nProtection orders for my Post Traumatic Stress Disorder\nMolested Mexican daughters, stretch across the border\nThe streets paved in gold often fade\nWhen the paint they use to pave the streets is henna\nAnd greener is the grass on the other side\nExcept for when that other side is geno\nOr sewer (sui-cide), you smile while you sippin' a cup of Kahlua\nThat makes me wanna mainline a fucking fifth of Dewars\nI'm trying to utilize my time to shine here\nI realize we only have limited time here\nDudes on my line try'na sell me a timeshare\nThat'll be me with a nine losin' my mind in Time Square\nLike, \"Is this how you wanna treat me?\nYou know what this business was before you hired me\nA piece of shit!\nEverybody on the floor right now!\nEverybody get the fuck down!\"\n\n[Hook]\n\n[Verse 2]\nLa-la-la-last ye-ye-year they hired me\nAnd this-s-s-s we-we-we-we-week the-the-they fired me\nAnd I g-g-g-got all these b-b-b-b-bills to pay\nAnd what the f-f-f-f-fu-f-f-fuck am I supposed to say\nT-t-t-t-to my wife she's p-p-p-p-pregnant\nAnd if the kid does not go to college his life's irrelevant\nAnd my-my-my melanin-n-n-n makes me a felon\nAnd-nd I just wanna take this fuckin' c-c-crack and sell it\nTo the planet;\nPanic, I'm a manic depressive mechanic that manages to frantically do damage\nTo his brain with Xanax, and it's, like the word \"anxiety\" is branded panoramic\nTo the back of my eyelids in a variety of fonts\nAriel, Bold, Gothic\nLost it in Time Square and going home is not an option\nIs this illusion optic?\nPerhaps it's just a chemical reaction with my Zoloft and acidophilus\nThe section of my brain that forms sentences isn't operative\nDanger! Danger! Danger, Will Robinson\nA bizarre ride, Pharcyde, Fatlip, Collagen\nMy tolerance is volatile and it feels like I'm losing oxygen!\n\n[Hook]", "year": "2014-04-15"}]}