{"artist": "Prince Ital Joe", "songs": [{"album": null, "title": "Happy people", "image": "https://images.genius.com/f2365aa30b0c55326e3fbe48ff29e50b.131x131x1.jpg", "lyrics": "Happy People I want to see more happy people Happy peoples want to see more happy peoples (2X) Where are all those happy people? Stand up, stand tall And then fight for it's still going on Downstairs it needs to smash The good vibrations vibrate the past A new style, kid, a new format A new technique and you're with so all of that? Ragga raps to beats commercial Which ain't personal still write the verbo I'll let you know straight from the ghetto How much the ghetto woman made Joe Tired of living your life so sat down mitts up rapper Pretty John, John come make you pretty fire burn Live with John, John come make me a cheese devil Them belly full but with maple Pretty knees shakin' make we live our day Talkin' to the commander-in-chief of the army Mr. Bill Clinton and the bird Hillary Wrap up the war on the brutality I want to see more happy people Happy peoples want to see more happy peoples (2X) Where are all those happy people? Gotta stand up, I gotta be strong It ain't right but it's still going on Still righteous still positive I've seen enough so you I gotta give A share of taste of you believe me you kid I'm living proof that the street life may hide its propaganda You wanna get what the men will come and hand you And they'll send you a phoney drink Find happiness and then you're the chief Come and fly on your year Come and take a bite of this apple Love and unity gets a little comfortable God take this state of emergency The baby wants to live so happy and free When I was a youth I used to see happiness Now that I am a man I see my people in a stress What is it that dark must come to the light Talkin' to the nation yes we're up to your night Get it I want to see more happy people Happy peoples want to see more happy peoples (2X) Where are all those happy people? Stand up, stand tall It ain't right but it's still going on\n\nHappy People\nI want to see more happy people\nHappy peoples want to see more happy peoples (2X)\nWhere are all those happy people?\nStand up, stand tall\nAnd then fight for it's still going on\nDownstairs it needs to smash\nThe good vibrations vibrate the past\nA new style, kid, a new format\nA new technique and you're with so all of that?\nRagga raps to beats commercial\nWhich ain't personal still write the verbo\nI'll let you know straight from the ghetto\nHow much the ghetto woman made Joe\nTired of living your life so sat down mitts up rapper\nPretty John, John come make you pretty fire burn\nLive with John, John come make me a cheese devil\nThem belly full but with maple\nPretty knees shakin' make we live our day\nTalkin' to the commander-in-chief of the army\nMr. Bill Clinton and the bird Hillary\nWrap up the war on the brutality\nI want to see more happy people\nHappy peoples want to see more happy peoples (2X)\nWhere are all those happy people?\nGotta stand up, I gotta be strong\nIt ain't right but it's still going on\nStill righteous still positive\nI've seen enough so you I gotta give\nA share of taste of you believe me you kid\nI'm living proof that the street life may hide its propaganda\nYou wanna get what the men will come and hand you\nAnd they'll send you a phoney drink\nFind happiness and then you're the chief\nCome and fly on your year\nCome and take a bite of this apple\nLove and unity gets a little comfortable\nGod take this state of emergency\nThe baby wants to live so happy and free\nWhen I was a youth I used to see happiness\nNow that I am a man I see my people in a stress\nWhat is it that dark must come to the light\nTalkin' to the nation yes we're up to your night\nGet it\nI want to see more happy people\nHappy peoples want to see more happy peoples (2X)\nWhere are all those happy people?\nStand up, stand tall\nIt ain't right but it's still going on", "year": null}]}