{"songs": [{"lyrics": "[Intro]\nYes, yes YEP!\nWelcome to the.. Jay-Z extravaganza\nI'd like to introduce my band right now\nJust Blaze and the Blazettes, hehe\nRight now I want you to give the drummer some\nNo ma really, give the drummer some\nUhh\n\n[Chorus]\nTouch the untouchable, break the unbreakable\nShake the unshakeable (it's Hovi baby)\nYeah, ch-chi-uh, uh-ch-ch-uh, un-breakable\nRock the unrockable (it's Hovi baby)\n\n[Verse 1]\nFollow the flow, look\nThey say a midget standin' on the giant's shoulder can see much\nFurther than the giant.. (the giant..)\nSo I got the whole rap world on my shoulder they tryin' to see\nFurther than I am... (than I am..)\nAnd I have been tryin' to be patient with they preoccupation\nWith David and Goliath.. (Goliath..)\nBut sooner or later, that patience gonna run it's course\nAnd I'm forced to be a tyrant.. (be a tyrant..)\nBut me and Tyran, comin' through your environment\nIron mask, nigga, iron gats, nigga I am back\nWith \"The Team,\" no I in that\nR.O.C., y'all not eyein' that\nY'all don't see, clearly 'cause the rain ain't gone\n\"The Dynasty,\" no not Ming but Shawn's\nDame, Kareem, nigga it's the gangsta team\nStop your run, one of the reasons that they call us gangrene\nThe other reason, we got a gang of green\nIf there's better at gettin' cheddar that remains to be seen, nigga\n(WOOOOOOOOOOOOOOOOOOOOOOOO!!!!!) Jeah, jeah\n\n[Chorus]\nCan't touch the untouchable, break the unbreakable\nShake the unshakeable (it's Hovi baby)\nCan't see the unseeable, reach the unreachable\nDo the impossible (it's Hovi baby)\nCan't move the unmoveable, stop the unstoppable\n\n[Verse 2]\nJeah, look\nI'm so far ahead of my time, I'm 'bout to start another life\nLook behind you, I'm 'bout to pass you twice\nBack to the future, gotta slow up for the present\nI'm fast, niggas can't get pass my past\nHow they propose to deal with my perfect present?\nWhen I unwrap The Gift & The Curse in one session\nAin't no livin' person can test him\nOnly two restin' in heaven can be mentioned in the same breath as him\nSeven straight Summers, critics might not admit it\nBut nobody in rap did it, quite like I did it\nIf you did it I done it before, you get it I had it\nGot mad at it and don't want it no more\nAnd that goes for everything from flippin' that raw\nFlippin' whores, flippin' vocal chords, don't get it twisted\nGet it right, did different, did it better, did it nice\nDid the impossible then did it twice (get it right)\n\n[Chorus]\nCan't touch the untouchable, break the unbreakable\nShake the unshakeable (it's Hovi baby)\nCan't see the unseeable, reach the unreachable\nDo the impossible (it's Hovi baby)\n\n[Verse 3]\nYup! Hovi's home, the global phone\nThe world is back in order, the number one rap recorder is back\nYou cats over-felt yourself\nYou couldn't help yourself, now witness the real for real\nIn my absence cats get, absent-minded\nNow it's time to rewind and remind 'em\nWhy I'm in the position that I am\nChangin' the game, my game could nail Madonna\nWell after I'm gone, they'll honor\nHistory in the makin', Pistol Pete\nLeave competition shakin' without missin' the beat (woo!)\nChasin' the hi-hat all over the track\nThe snare is scared of the air in here, BOOM!\nAnd plus I get paper dog, don't let me forget\nThe watch face so blue like it's holdin' it's breath\nCan't see me skill for skill or check for check\nIt's the bow-tie flow dog, I bring it to your neck\nLive and direct, I will bring it to your set\nI got now, I don't care who got next\nRapper slash Exec., Kordell Stewart\nYour flow all y'all using is mine, you're all useless\nYou ain't a factor, who are you foolin'?\nYou all are faggots, you takin' us backwards (takin' it backwards)\nI'm tryin' to progress with this rap shit\nNigga, nigga your whole career's a accident\nWho was gassin' 'em? (Fuck outta here!)\n\n[Chorus]\nCan't touch the untouchable, break the unbreakable\nShake the unshakeable (it's Hovi baby)\nCan't see the unseeable, reach the unreachable\nDo the impossible (it's Hovi baby)", "title": "Hovi Baby", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}