{"artist": "Ice-T", "songs": [{"title": "New Jack Hustler (Nino’s Theme)", "lyrics": "Hustler, word, I pull the trigger long\nGrit my teeth, spray till every nigga's gone\nGot my block sewn, armored dope spots\nLast thing I sweat's a sucka punk cop\nMove like a king when I roll, hops\nYou try to flex, bang, another nigga drops\nYou gotta deal with this cause there's no way out\nWhy? Cash money ain't never gonna play out\nI got nothin to lose, much to gain\nIn my brain, I got a capitalist migraine\nI gotta get paid tonight, you muthafuckin right\n[something] my grip, check my bitch, keep my game tight\nSo many hoes on my jock, think I'm a movie star\nNineteen, I got a fifty thousand dollar car\nGo to school, I ain't goin for it\nKiss my ass, bust the cap on the Moet\nCause I don't wanna hear that crap\n\n(chorus)\nHustler\nHustler\nHustler\nH-U-S-T-L-E-R hustler\n\n(kid drop in)\nYo man you know what I'm sayin?\nYou got it goin on my man, I like how it's goin down\nYou got the fly cars, the girls, the jewels\nLook at that ring right there\nI know it's real, it's gotta be real\nMan, you the flyest nigga I seen in my life!\nYo man, I just wanna roll with you man\nHow can I be down?\n\nWhat's up? You say you wanna be down?\nEase back, or muthafucka get beat down\nOut my face, fool I'm the illest\nBulletproof, I die harder than Bruce Willis\nGot my crew in effect, I bought em new Jags\nSo much cash, gotta keep it in Hefty bags\nAll I think about is keys and Gs\nImagine that, me workin at Mickey D's (ha ha ha ha)\nThat's a joke cause I'm never gonna be broke\nWhen I die there'll be bullets and gunsmoke\nYa don't like my lifestyle? Fuck you!\nI'm rollin with the New Jack crew\nAnd I'm a hustler\n\nH-U-S-T-L-E-R hustler\nNew Jack, New Jack..........\n\nHere I come, so you better break North\nAs I stride, my gold chains glide back and forth\nI care nothing bout you, and that's evident\nAll I love's my dope and dead presidents\nSound crazy? Well it isn't\nThe ends justifies the means, that's the system\nI learned that in school then I dropped out\nHit the streets, checked a grip, and now I got clout\nI had nothing, and I wanted it\nYou had everything, and you flaunted it\nTurned the needy into the greedy\nWith cocaine, my success came speedy\nGot me twisted, jammed into a paradox\nEvery dollar I get, another brother drops\nMaybe that's the plan, and I don't understand\nBut since I don't know, and I ain't never learned\nI gotta get paid, I got money to earn\nWith my posse, out on the ave\nBump my sounds, crack a forty and laugh\nCool out and watch my new Benz gleam\nIs this a nightmare? Or the American dream?\nSo think twice if you're coming down my block\nYou wanna journey through hell? Well shit gets hot\nPregnant teens, children's screams\nLife is weighed on the scales of a triple beam\nYou don't come here much, and ya better not\nWrong move (bang), ambulance cot\nI gotta get more money than you got\nSo what, if some muthafucka gets shot?\nThat's how the game is played\nAnother brother slayed, the wound is deep\nBUT they're givin us a Band Aid\nMy education's low but I got long dough\nRaised like a pit bull, my heart pumps nitro\nSleep on silk, lie like a politician\nMy Uzi's my best friend, cold as a mortician\nLock me up, it's genocidal catastrophe\nThere'll be another one after me!\nA hustler\nHustler\nH-U-S-T-L-E-R hustler\n\nNew Jack, New Jack......", "image": "https://images.genius.com/86b9e63b9a38d5cc3e34cf27569b4d81.300x300x1.jpg", "album": null, "year": null}]}