{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/ff349502ffcbfd8f7bdac9fe013f2b15.600x601x1.jpg", "title": "NO OFFENSE!!!!", "year": null, "album": "D.A.I.S.Y. rage", "lyrics": "You're fools gold, you are cubic zirconium\nYou're hoein em, you are cubic zirconium\nYou are fool's gold\nYou fit a fool's mold, glowing like diamonds\nBut your molecules'll prove you're hoeing em\nYou're cubic zirconium you're fools gold\nYou fit a fools mold, you're a fool old man\nYou're cubic zirconium\nYou are fools gold\nYou fit a, you fit a fool's mold\n\nI had you wrapped around my finger, but er\nThere's a little green ring there now, ew\nHow will I get your residue off?\nYou're about as fraudulent as a mirage out in the desert\nBlue peacock, you're puffin out your feathers to\nBring a bunch of bitches backstage into your dressing room\nSo you can treat it like a petting zoo\nAnd get heated that I never do, why am I friends with you?\nYou say you're silver, but you're filler with a filagree\nAsk the bitches that you've been chillin with and they will agree\nSmalls, you're not hitting the balls, you're killin me\nIllegitimate like bill and I am hillary\n\nYou pillage all your image to appeal to the millions\nAlways asking \"hey kitty, you think they're feeling me?\"\nYou're a dentured grandpa tryna grill it\nYou're as authentic as a hand full of acrylics\nYou're synthetically made, you're like crab with a k\nAt the back of every china buffet\nYou're a pining away to be cool but you're a pint of the\nLame o'douls....fake...wanna be non-alcoholic whatever\n\nYou're fools gold, you are cubic zirconium\nYou're hoein em, you are cubic zirconium\nYou are fool's gold\nYou fit a fools mold, glowing like diamonds\nYour molecules'll prove you're hoeing em\nYou're cubic zirconium you're fools gold\nYou're fools gold, you're cubic zirconium\nYou're hoeing em all\nYou're cubic zirconium, you're fools gold\nYou fit a, you fit a fool's mold\n(oh my god)\n\nThis rhyme, it'll prickle like a pinecone\nBut won't stick, cuz you're fickle as a rhinestone\nYou differ like the timezones\nEvery trend you're on the dick of it, I'm really sick of it\nYou think you're hard as noreaga\nSo fake I'd find ya at a bodega\nSo babe, uh, you're a little flaker\nBut hey, at least you'll do whatever it takes, huh??\n\nYou're a Kardashian's ass\nYou're astro turf, cuz you're not actually grass\nAnd you act so perfect but you know how roses smell and your hoax is\nSo bogus, am I the only one who noticed?"}]}