{"songs": [{"title": "Money Stackin", "album": null, "year": null, "image": "https://images.genius.com/eaab8a504477a90120f3290d121961fc.500x500x1.jpg", "lyrics": "[Hook]\nGot all these bands, this money I'm stackin\nBitch I'm out here in the field, so it's team no lackin\nGot all these bands, this money I'm stackin\nBitch I'm out here in the field, so it's team no lackin\nGot all these bands, this money I'm stackin\nBitch I'm out here in the field, so it's team no lackin\nGot all these bands, this money I'm stackin\nBitch I'm out here in the field, so it's team no lackin\n\n[Verse 1: Lil Reese]\nNiggas playing games, i ain't for none what's crackin?\nAnd I'm out here in the field so it's team no lackin\nI'm off the shits, i won't stop I'm crackin\nGot all these bands, this money I'm stackin\nAin't playing games, we ain't for none what's crackin?\nWe sliding doors back and young niggas clappin\nRacing to the money I'm speeding like a rabbit\nGot a lot of money try to take what I'm having\nYou get clapped up and that's faster than a rabbit\nOn 64th, bitch we what's happening\nTry to come through, you get clapped with the Mac\n300 shit bitch i been a savage\n\n[Hook]\n\n[Verse 2: Waka Flocka Flame]\nHe reach for it that's a dead body\nElmer Fudd, double barrel shotty\nMy neck rocky and I'm off a molly\nMy bitch bad with a Buffie body\nYoung niggas shoot at anybody\nAll these bands got a nigga cocky\nStrapped in the club motherfucker\nLil Reese get him!\nMan down, let the piece hit him\nDoit broad day and police with him\nYellow tape, let the streets get him\nChalk him out, white sheet did him\nBow bow, I'm bussin' at him\nI'm balling hard, no NBA\nMy bitch a diamond, Lisa Raye\nSpend 20k at least a day\nDo it weekend nigga? Do it everyday!\nShe wit me? She go every way\nCount this money til' my fingers hurt\nWhen i hit the pussy i bet she squirt\nSelling dope, we ain't got to work\nReal nigga, no tight shirt\nMy gun don't work, i got a knife\nYou disrespect, I'm doing life\n\n[Hook]\n\n[Verse 3: Wale]\nLot of paper bring a lot of haters, capeesh?\nAnd the more you make a be the more you make, it ain't sweet\nBut i do me (fasho!)\nDo i lose sleep? (hell no!)\nIf i fall down, before they start counting I'm back on my feet\nThis that flyraq meet chiraq, no contest with that flow\nAll of my heads out, with young dreadlocks, couple real niggas from the 'go\nLike i said in one song\nLife is lame with no goals\nBarely rap about dope, whenever i don't you niggas ignore\nChop be cooking that crack, and talking hard rock, and talking that snow\nNaw, Chop a send me that track, i send that shit back in back of that hearse\nCrack ain't something i know, ain't something i did just keeping it real\nAs a matter of fact, you never moved crack\nBut knowing yall rappers a probably throw a brick, bitch\n\n[Hook]"}], "artist": "Lil Reese"}