{"songs": [{"image": "https://images.genius.com/f6add8d37159349e3c7a643f3f32abfc.750x750x1.jpg", "lyrics": "[Intro]\nTrilogy\n\n[Chorus: 50 Cent & Casanova]\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Rrr) Go get the strap (rrr) nigga, go get the strap\n\n[Post-Chorus: Casanova]\nFuck that, niggas out here active, blood (brrrat!)\nWhat's brackin'? You'll never catch us lackin', blood (never)\nYou stupid, you think we ain't packin', blood? (know I got it)\nFuck wrong with you? I don't like the way you actin', blood\n(Get up off me)\n\n[Verse 1: Uncle Murda]\nGet the grip, find an opp, give him the whole clip (bang)\nThat's his car pullin' up, shoot up the whole whip\nThat's his man, hit him too, that nigga down with him\nCheck his Gram, see who else be hangin' around with him (yeah)\nHe could get it (uh-huh) him too, nigga, go get the strap\nLoad it up, spin the block, I know where them niggas at (where?)\nWhere they at? Who they with? Them niggas gettin' smoked\nLine 'em up; they ain't hard to find, all them niggas broke (stupid!)\nO-Dog, Nino Brown, Michael Jordan, what?\nBe like Mike, yeah right, I wanted to be like Tut (woah!)\nBig Cuban, flooded Rollie, I see ya eyin' it (I see ya)\nGet ya clapped if I think you think about trying it\n\n[Verse 2: 6ix9ine]\nA'ight, so boom, first up, all y'all niggas suck my dick\nMatter of fact, suck my dick with your mother's lips (stoopid!)\nAh, ah, ah, niggas runnin' out they mouth\nY'all dead-ass like I won't punch you in your fuckin' mouth?\nMatter of fact, I'ma smack fire out you, boy\nAre you dumb? I'ma beat the brakes off you, boy\nYou some, \"Gas what I smoke, nigga\" (bang bang)\nNah, on this dick your mother choke, nigga\n\n[Chorus: 50 Cent & Casanova]\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Rrr) Go get the strap (rrr) nigga, go get the strap\n\n[Post-Chorus: Casanova]\nMan, fuck that, my niggas 'bout that action, blood\nCatch one frame, my niggas got that strap in, blood\nThey scrappin', my niggas get to clappin', blood (bo bo bo!)\nFuck wrong with you? I don't like how you actin', blood\n(Get up off me)\n\n[Verse 3: 50 Cent]\nI am not gang-gang, I do not gang bang\nDon't play me like I'm pussy, I will pull up and bang-bang\nNiggas get knocked out, then say they gon' pop out\nHop out, uwop out, and air the whole block out\nBlow the whole stock out, and I'm 'bout what I'm 'bout\nI'm a one-man band, I bring the drum out and dump it\nBend your block, one o'clock, blowin' the trumpet\nI'm with the shits, my niggas still hit the licks\nI'm stupid rich, still doin' some stupid shit\nYou niggas know the vibes, scared to come outside\nThat's the third time you've been got, second time you was shot\nYour man just ain't your man, he saw us first and fuckin' ran\nWe on a different type of time, you on some different shit\nNow nigga, don't you play with me, play with a bitch\nI ain't ran into a problem that I can't fix\nHit your ass upside the head with a full stick\n\n[Chorus: 50 Cent & Casanova]\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Rrr) Go get the strap (rrr) nigga, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Grrr-rah) Yeah, yeah, go get the strap\n(Rrr) Go get the strap (rrr) nigga, go get the strap", "title": "Get the Strap", "year": "2018-08-26", "album": "Don’t Come Outside, Vol. 2"}], "artist": "Uncle Murda"}