{"artist": "Fashawn", "songs": [{"year": "2015-02-24", "album": "The Ecology", "image": "https://images.genius.com/5ad462cd1ac1f9a505d5e0408eceecef.600x600x1.jpg", "lyrics": "[Intro]\nI said y'all wanna get higher?\nY'all know we gonna get higher\nI said y'all wanna get higher?\nY'all know we gotta get higher\n\n[Verse 1]\nBecame a prisoner of peoples expectations\nSome of my fans are doctors, even they don't have the patience\nTo wait up while I evolve creatively\nI wish there was 8 of me\n1 to deal with temptation, 1 to deal with complacency\n1 to deal with the pressure, 1 to deal with this fame\n1 to deal with the power, 1 strong enough for the pain\n1 to hold my umbrella to shelter me from the rain\n1 to be my therapist, my thoughts is crowding my brain\nI get insomnia and probably cause\nI convinced myself that I was not the one\nStruggling through my Twitter\nStupid niggas, listeners are disloyal\nBut they make you feel royal\nBut like a slave when they no longer enjoy you my nigga\nThat's not high enough, please let's take it higher\nHeadliner, shit I'm glad I even made the flyer\nThis game'll crucify ya just to make you a martyr\nSometimes I'd rather ice skate with my daughter, but\nYall don't hear me though\n\n[Hook]\nHigher, take me up, take me up\nI need you to take me higher\nI wanna reach something I can't touch, I can't touch\nSo get high, so get high\nAnd get high, and get high\nSo get high, so get high\nLet's get high, let's get high\nSo get high, so get high\nLet's get high, let's get high\nSo get high, so get high\nAnd get high, and get high\nHigher, take me up, take me up\nI need you to take me higher\nI wanna reach something I can't touch, I can't touch\nSo let's take it higher\n\n[Bridge]\nI'll tell you when it's high enough\nI'll tell you when it's high enough\n\n[Verse 2]\nY'all would rather break me down like reefer\nAnd stuff me into a paper\nTemporary reliever while you lay up like a Laker\nI'm working 24/7, wondering where the day went\nFeeling taken for granted, feeling underestimated\nDo I need the recognition when i have the reputation?\nYou're thinking entertainment, I'm thinking elevation\nIn an industry that's saturated, but I'm glad I made it\nI've seen anticipation turn to aggravation\nWhen you don't meet the demand and people think you the man\nIt's back to the factory, keep on putting comands\nMind running rapidly tryna make a classic\nAm I running out of battery? Questions you start asking yourself\nOppose to asking for help, hell I don't need it\nI thought all I had to do was beat the odds and we'd be even, damn\nBefore you know it I be back on the road\nText message from my daughter it said \"daddy come home\"\nBut y'all love me though\n\n[Hook]\n\n[Outro]\nHi daddy, I miss you and I love you. Hope you come home safely. You can take me to the park, the swimming pool and long walks and talk all day long and I can keep you all day and sleep with you, and I like your music, it's pretty and I want to give you hugs", "title": "Higher"}]}