{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": null, "lyrics": "[Intro]\nYeah, that was just Jay Z and Beanie Sigel, man\nWell-thought, that's right, hot shit\nYou know man, yo\nCome in to the stage now, it's R.A. the Rugged Man\nYou feel that? Come on, give it up\nGive it up, man, come on\n(Uhhh)\n\n[Verse 1]\nYo, ayyo, I don't care what the people say\nI'm a piece of shit, I'mma live my life that way\nI'm a total fuck up, my whole album sucks\nI spend half my advance getting coke sluts coked up\nIf the bitch won't fuck she gets choked up\nI went double platinum last month, then I woke up\nWhen I was young I was a loser, but now I'm grown up\nThere ain't shit changed on though, still broke as fuck\nOh, that there's the Rugged Man, he's a troublemaker\nIt's like work, Human Beatbox Bub will take ya\nWe double hate ya, see what these scrubs are made of\nBrought the dildo you love, the Rubbernator\nAt the Academy Awards with Angelina Jolie\nOscar, the winner is the White Trash O.G\nRugged Man, Floyd Mayweather, Shane Mosley\n(That's that dirty motherfucker) yeah, you know me\n\n[Hook]\nR.A. the Rugged Man\nRugged Man\n(You fucking suck)\nR.A. the Rugged Man\n(Boo! Die!)\nR.A. the Rugged Man\nRugged Man\nIs not a nice guy\nR.A. the Rugged Man\nIngagi, Ingagi\n\n[Verse 2]\nAyyo, some people believe I'm fucked in the head\nSome people believe I'm better off dead\nParents please don't let your kids listen to me\nThey might wig out in the school, pull they dick out\nPull the four-fifth out\nBe like \"Mister School Teacher, I ain't gotta do shit now!\"\n(Sit down, you, sit down)\nYeah, I'm mad negative, you want positivity?\nBuy a Mos Def and Talib Kweli CD\nIn the music biz, Rugged Man known for his freaks\nUsed to bring groupie bitches up to fuck Mobb Deep\nI brought Biggie Smalls to the Long Island \"Whore Pit\"\nHe boned the bitch in the bathroom and broke the toilet\nYeah, you're right, you said it, I'm a little bit strange\nI don't think rational, I got no brains\nI'm the last American hero\nReal weirdo, real zero\nReal deal, \"Die Rugged Man!\"\n\n[Hook]\n\n[Verse 3]\nI'm like Joel Rifkin, sticking Nicole Kidman\nFist fuck, stick my whole fist in, these hoes tripping\nI'm crazy but they won't listen\nGold digging hoes, coke up they nose sniffing, I'm cold pimping\nOh, I am the one that they say is crazy\nMake way, the R.A. hateway, the R.A. way\nMake sure they pay, they lay\nThey say we crazay, make way (make way)\n\n[Hook x2]", "title": "Die, Rugged Man, Die!!", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}