{"songs": [{"year": "2005-10-18", "image": "https://s3.amazonaws.com/rapgenius/black-rob-news.jpg", "title": "They Heard I Got Life", "album": null, "lyrics": "Didn't I tell you what I'm gonna do?\nHere's where I'ma tell you what I'm gonna do\n\nLights and cameras...I hear that...We love it...Bad Boy bitch fire\n\nI'm wild known in Miami\nPuff and Nelly told me\nYou ain't gotta kill nothing to win no grammy\nI keep a thing handy\nIn case a coward mistake me and think BR's a piece of candy\nI used to play the block, moving butter\nFor that Calcutta, your pockets is Chris Rock\nI make em stutter\nIce is pinky\nEyes is chinky\nHo's is kinky\nLayin on that full length minky\nThe jail stank all on my name\nIt's a fucking shame\nSo I had to reassess my game and the whole aim\n'Yo Black relax fam, show some reserve\nYou ain't a herb\nJust a kid with gust and a lot of nerve'\nI used to run up in backa you\nPut the gat to you\nMake you get on your knees and run your capital\nI had the same dope ways of gettin paid\nIt was either that\nOr risk my houses gettin raided\nYa'll about to witness the power of street knowledge\nFuck Long\nGot my PHD from a street college\nThe rap game's real\nSo it's best you play behind the scenes\nLike the ??mouse on the fifth wheel\nBut I can't do it\nSo what's the D-dot-E-Q it?\nFans rush me, it's all love ??\nSo when your dealing with dirt?\nPlay dirty\nWhat I'ma do is come through in the blue 830\nFuck a quarter to eight\nI'm on the corner of 8th\nBoxin shorty with a quarter and eighth\nGotta make sure my daughter's straight\nShe got cake for school\nAnd the bank accounts in good shape\nAny dudes trying to get this cream?\nFam, one to the stomach\nBend em over like 6:15\nShould have had my dog bite him sooner\nSoon as I heard the rumor\nHe was trying to be Scarface junior\nThe confrontation short and sweet\nUp north is weak\nI bought the heat the whole court in the street\nThere the nigga go\nSipping Clicquot frontin\nI'm low in the back\nHugged up with Miss Puerto Rico or somethin\n????? been to Brazil with Lebanese\nWhen he say don't move bitch you better freeze\nKeep thinking your cute\nWe gonna turn this shit to Beirut\nD? Holla at Absolute\nAnytime its time to get dope call\nSpecially if it ain't nothin between me and duke\nBut sheetrock walls\nIf a nigga don't like me\nHe can lick my balls\nI'm world famous for setting off ballroom brawls\nI'm out west like 'Fuck the past'\nYou out west walking around with security up the ass\nIt ain't fair niggas\nThey call me Black Night Shamalyan:\nCome through the village and I'ma scare niggas\nYou must don't love life\nYou fucking a thug's wife\nSmall timer, still living A Bug's Life\nI'm doing 80 north I'm on the turnpike\nHere light this up and tell us what that burn like\nI don't believe y'all, fuck around and leave y'all\nDuke a lame, why the fuck you let him breath for?\nIt won't stop until your teams ???\nThis the info, I gotta come and knock y'all senseless\nAaanybody over 25 fronted\nAt the end I drunk the milk like the Indy 500\nIt's Black-O the mack-O\nMa, you comin?\nYou see me\nI ain't frontin and my ice is stunnin\n'05, yo it must be the season for duck huntin\nWhen I leave here tonight B I'ma fuck somethin\nIt's mandatory that I get in some ass\nAnd shine on these faggots like I did in the past\nYou sleep?  Then I'm hittin the stash\nFam, I'm at war\nThat's why I watch reruns of M.A.S.H\nDudes scheme to hit up my physical\nAnd each one said its just hate\nMufuckas is miserable\nSo when you come attack my brothers\nWatch out: that heat\nMake niggas dance like Scatman Caruthers\nYa'll punks paid the ultimate price, I'm not nice\nMy fourth felony, Ya'll heard that I got life\n\nLife...Life...Life...Life...Life"}], "artist": "Black Rob"}