{"songs": [{"year": null, "title": "Middle Finger U", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "Fuck these niggas\n\nI don't give a fuck about nothin\nAnd you either\n\nThis is for you Tommy Tuckers, you know em, neighborhood suckers\nWe all got em, stupid motherfuckers\nWanna-be rap brothers--ruggers--, bitin ass niggas who love us\nIdolize us, eat a dick, can't touch us\nSlick nigga, far from a snitch nigga\nOr bitch nigga, quick to click on a sick nigga\nWhere it's at nigga, roam with the chrome nigga\nFat nigga, bat against your dome nigga\nI'm that nigga, one you can't even crush\nType of cat shit in your crib and don't even flush\nKind of nigga when you see him that you wantin to touch\nOn some Russell Simmons shit, but ain't in no Rush\nCause when the shit hit the fan, who the hell can you trust?\nDuckin the blow? Really? Where the fuck can you go?\nWho the fuck can you get when I'm ready to spit\nWhen you hear my name I make you hit spaghetti and shit\nSpit and aim with the fifth, if I get caught in a lie\nTen shots light you up like the 4th of July\nI don't need your help, bitch, I got support from the sky\nQuite fluid, I'm a definite, you might do it\nBitches, guns and ones, got a right to it\nFuck \"Up against the wall\" - I send your ass right through it\nTattooed like Mike did it, leave you light-headed\nSwear to God, y'all niggas better act like Christ said it\n\nHey yo yo who the hell this Sauce nigga think he talkin to, man?\nArrogant bastard\nChubby motherfucker\nYou think you alla that, man?\nI can't even stand to hear this shit no more, man\n\nHey you know what motherfuckers?  It don't stop there\nI'ma solidify my rap spot til it's not fair\nNothin to do with it, niggas say, \"I'm glad it was them\"\nSomethin to do with it, niggas gon' be glad it was them\nInspire men, or some R&B shit and fire ten\nWith Mya and, gettin' head from the way the tires spin\nMy whole circle is hot, like when the dryer spin\nYou just a cub nigga, trapped off in a lion's den\nLookin for love? Fuck you, you found hate, stupid\nI run with a 112 kids who raped Cupid\nPlus got head, see my eyes, bloodshot red\nHands where I can cee like Busta said\nI lead by example, nigga - must I led?\nLast thing you hear is shots and every cuss I said\nReal niggas walkin away, paramedics walkin your way\nCrackin jokes while I'm talkin to Jay\nGettin head from four dimes from New York in a day\nThis flow here is stainless, what you thought it was clay?\nThought it was gold?  Only thing it bought was your soul\nSplit your wig, then confuse you for that fork in the road\nI don't play with wack rappers, I slay wack rappers\nOnly aim to decay and spray wack rappers\nIf niggas wanna front, and say fuck my shit\nDon't buy my album, fuck you and suck my dick\n\nBetter forget it, just to be specific\nCause if you the one, then I'm too terrific\nBetter relax, 'fore you get it twisted\nIt's to the death now, if you make the shitlist\n\nForget your lingo, and how you primadonna niggas mingle\nI'm real money, fold up, you funny money, jingle\nNews flash, here's a hot-ass item to bring you\nHad a car, Roley, and house before my first single\nI know how y'all niggas roll, quiet as a tear\nMy album ain't even dropped, and I'm writer of the year\nI got shit, find me in your record store under 'hot shit'\nWhile you register, under 'not shit'\nI drop hits in the streets and triggers'll blow\nShow after show, watch him, big as I roll\nWe all know the rules, fool: jewels, bitches and dough\nDid you hear?  I'm the fattest, nicest nigga you know\nAnd I kill a motherfucker just to gain a buck\nConfused niggas bust guns, and aim to duck\nIf you happen to sell half weight your game is luck\nWho write for who?  Y'all sound the same, lame as fuck\nCan't control it, tried to sell it, heard it the way you told it\nWho bought it?  And if you sold it, niggas thought it was\nSomethin I might have smoked, roll it\nNever get grimy as me, I fuck a rattle snake if a nigga hold it\nI got both sides of the fence amended\nI got hits with Jay, Clark, Primo, and none of my whips is rented\nI got a smash with Puff bout to drop any minute\nI guess what I'm really trying to say is...", "album": "Middle Finger U"}], "artist": "Sauce Money"}