{"songs": [{"album": "Mas G.O.Y.A. - EP", "image": "https://images.genius.com/415b81d80a2bab077c6f5236f76922d2.1000x1000x1.jpg", "year": null, "title": "Scandalous (Remix)", "lyrics": "[Intro]\nThere's nothing familiar about the way they talk or look\nOr even the way they worship their creator\nThey may be American but they're not like you at all\nWe made a wild and wonderful record for you\nWe tell you all kinds of things to do and be and you can let your imagination go\n\n[Hook]\n\"Recognize\"\n\"The real\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\nAnd get up close and personal in front of your eyes\"\n\"Recognize\"\n\"The real scandalous\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\"\n\"When it come to money, dunn, I'm not the one to laugh with\"\n\n[Verse One: Termanology]\nYou better recognize\nI don't give a fuck about a record deal, I wreck you guys\nPlus I specialize in murking you out with special knives\nTec's and nines, next in line\nWho wanna get it, I known to spit it with the best alive\nI murder stages and murder pages like murder cases\nRip out your vertebraes and your brain with my dirty razors\nI went to thirty mages invaded 'em with my lasers\nTold 'em about it this independent gun that I'm blazing\nFuck a record deal\nFor the record I've been living wreckless\nI'll clutch your diamond necklace off your neck and I'll flex it\nThen I fled to the exit, I hope you catching the message\nI got a necklace the size of Treach's just to wreck ya flesh with\nWe straight scandalous, handing out brain damages\nCats pulling banana clips\nBats, bullets and bandages\nThe brand is Goya me partna' now you wanna cop?\nUnless you cop\nThen it's 1-800-COP-SHOT\n\n[Hook]\n\"Recognize\"\n\"The real\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\nAnd get up close and personal in front of your eyes\"\n\"Recognize\"\n\"The real scandalous\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\"\n\"When it come to money, dunn, I'm not the one to laugh with\"\n\n[Verse Two: Chris Rivers]\nAin't nothing humorous\nCrucifix ya ludicrous movement\nI'm way too lucrative, I move with this translucent improvement\nOnly the mic can pass, lightning fast\nBy the time that you wipe your ass\nNeed to calculate infinity to fathom the mic's I grasp\nYour mind relapsed\nPerhaps, from the way that I write these raps\nAttack I blaze each track with the force of a 1,000 stars collapsed\nNovas and quasars\nSoldier and eight bars\nSixteen I'm Elohim, nebulous status, I make stars\nI stay charged\nRipping the force out of black holes\nYou don't get my space reference\nSuck a corpse out an asshole\nYou dumb fuck\nI guess you should've died as a tadpole\nBut since you're here now, go hang yourself on a flagpole\nI'm joking\nI'm all about that peace and equality\nPreaching philosophy\nWord to law for reading astrology\nLeading this odyssey journey from the depths that I constantly\nTurn in hypocrisy, logically and fuck this economy\n\n[Hook]\n\"Recognize\"\n\"The real\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\nAnd get up close and personal in front of your eyes\"\n\"Recognize\"\n\"The real scandalous\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\"\n\"When it come to money, dunn, I'm not the one to laugh with\"\n\n[Verse 3: Ras Kass]\nI can't risk doing a California cop coroner, scandalous\nSpit my manifesto but I won't die in the cabin bitch\nAdvantages like battleship blasting the Vegas strip\nExplode Mazeratis, that'll kill your magic quick\nGot my Spanglish, key to my Spanish is\nTu [?] es grande, I hang with the savages\nFuck that romantic shit, I rather a ratchet bitch\nThat fuck niggas and chop your head off, praying mantises\nI'm Los Angeles street analyst\nThe green better stack\nOr I'ma turn a terrorist speaking Arabic\nLikes the Subway, foot long shit sandwiches\nThat's why I chain smoke, got more humps than a camel's clique\nI'm on Goya shit, platanos and cannabis\nRice and beans, Merengue on tracks I lean\nLike p-p-prome and that's G\nI sell red bottoms to a double amputee\nRecognize nigga"}], "artist": "Termanology"}