{"artist": "Apathy", "songs": [{"title": "Breeze Block - Radio 1 UK Freestyle", "image": "https://images.genius.com/90a78c5e81aab6cc017154aa5929c6ac.1000x985x1.jpg", "album": "It’s the Bootleg Muthafuckas! Vol. 1", "lyrics": "[Verse 1: Celph Titled]\nYo\nI hold rappers hostage\nSpit saliva that's toxic\nFrom the NYC to the FLA tropics\nAR-15 schizo, make your chest blow\nNothing to say like Greg Nice without the echo\nI'm a cross between C-4 and C-3PO\nExplosive intelligence, pack the heavy metal\nOut the window with that demo that you tried to sell me\nI'd rather listen to a Rob Base comeback LP\nIt's not healthy for you to come around here with that\nRun your mouth off like that, and get your wig pushed back like that\nI'll make you swallow the grenade\nAnd put an envelope and stamp in your hand\nAnd mail the pin to Afghanistan\nWhat I say makes sense in the mind frame I'm in\nWhile you babble on like the Mediterranean\nThrow you down the escalator just to sterilize you\nDeranged doctor, with the scalpel to slice through\nAnyone who contest, my clique hard as nails\nIt'll be a done deal like Mobb Deep on sale\nEscaped convict putting out mob hits\nYou probably a homo and shave your armpits\n\n[Verse 2: Apathy]\nWe rock on the Breeze Block\nMCs drop when hitting weak spots\nMy beats pump like shotguns and Reeboks\nYou look softer than stuffed animal Ewoks\nSo we stalk the street blocks\nAnd spit like when fat kids beatbox\nGot it locked like Ol' Dirty in detox\nWe'll never stop like cops going in donut shops\nI'd let you rap but you're probably not worthy\nAnd besides it's time to go yo, it's almost 3:30\nI give skeletal fractures like wrestling matches\nPractice on you rappers if you think that Ap is wacker\nFrom Africa to Alaska, my rap sells faster\nWhile the only distribution y'all got is through Napster\nFrom U.K. to USA we getting play\nWhile you playing everyday for an open mic to display\nYour half-ass wack raps you cats design\nY'all can never get signed\nWhat are you, out of your mind", "year": "2003-09-23"}]}