{"songs": [{"image": "https://images.genius.com/feab51577febd001d2d1ca3c23574a2d.1000x1000x1.jpg", "title": "Die for You", "album": "Suit", "year": "2004-09-13", "lyrics": "[Intro - Nelly] (Nelly's daughter)\nSo yo, today your birthday? (Yea.. yeah!)\nYou sure? (Daddy!)\nI don't think today your birthday (Then what you call me for?)\nOh, I don't know, I just called to see what you was doin\nYou sure.. what, what, what you turn today?\nWhat you turn today, 19? (No, I'm turnin 10, Daddy)\nNah you turnin, what 32, 32, you 32 today (You have been away for a long time)\nIt feel like it, don't it? (Yeah)\nYeah, but I miss you though, you miss me?\n(Yes, very much, I just wish you could be here) Word? (Yes)\nOkay, I'll be there soon, aight? (You gon' be here tonight?!)\nNaw, boo-boo, I ain't gon' be there tonight (Aww)\n\nWhoo! Mmm, uhh\nUhh, uhh, uhh, uhh, c'mon\n\n[Hook 2x - Nelly]\nYeahhhhhhhhhhh.. (yeah)\nDon't you know I'll die for you? (die for you)\nI'll lay down my life for you\nI would, die for, you (die for, you)\n\n[Nelly's daughter] I love you Daddy\n\n[Nelly]\nI remember February 27, 1994\nTryin to make it to the hospital through three inches of snow (hey)\nSomethin's goin wrong, I can tell but I don't know\nI got this feelin in my gut, this ain't how it's supposed to go\nThree pounds, two ounces and two months premature\nI tell the incubator, is she gon' make it? They ain't sure\nAutomatically I place the blame on my health\nHell, I'm her father mayne, I place the blame on myself\nWas it somethin that I smoked, did I eat or did I drink it?\nOr was it somethin I was doin that I did or did I think it?\nHuh, watchin her breathe through her holes in her nose\nWhat's this EKG machine? What's this shit on her toes?\nIt's 94, I'm 85, so I'm spooked as can be (c'mon!)\nI'm prayin and I'm askin, \"Why He do this to me?\"\nSee, I used to hold you in the palm of my hand\nAnd just to see you pull through - shit I knew you'd pull through\n\n[Hook]\n\n[Nelly]\nMarch 2-2nd, 1999\nThe year and the date I got my lil' man\nI guess I felt how my father felt and his father felt\nAnd his father musta felt to see hisself\nIt's like a lil' me in the flesh\nHe got my blood and my heart in his chest\nNeedless to say, man I love him to death\nTeach him if he disrespect me I'mma love him to death\nLeft to go out of town right after he was born\nI got a record deal, three months later Daddy was gone\nIt's like I'm tryin to raise him over the phone\nHe barely know my face when he see it but he know my tone\nI'm hopin, I'm like - \"Do he know who his Daddy is?\"\nI'm real close to sayin fuck the showbiz\nBut when I hurr him call his Daddy now\nAnd when I hurr him tell his friends, \"I'ma be just like my Daddy now\"\nHope he forgive me for the sacrifice\nSo he can have a better life - than I had\n\n[Hook 2x]"}], "artist": "Nelly"}