{"songs": [{"image": "https://images.genius.com/8a96b9fe67b15dcd69f9a476da349510.1000x563x1.jpg", "album": null, "title": "Dear Mandy", "lyrics": "[Intro]\nDear Peter Mandelson\n\n[Verse 1]\nI've been following your recent policy proposals\nSo now they've gone through, I thought I'd contribute some vocals\nThe focal point of my criticism's\nThe ridiculous decision to bring in a system where you flick a switch and\nDisconnect the internet when it's suspected\nThat intellectual infringement has been detected\nEven if the relatives they live with definitely didn't\nI think it's in your best interest to bin this, yes?\n'Cause isn't it a respected institution\nThat we're considered innocent unless different is proven?\nEr, excuse me - how can you excuse exclusion\nWhen you've not pursued a definite conclusion?\nYou're picking on the little man, the Lilliputian;\nNow there's a pain in my gulliver and it's confusing\nYou're swift to treat your citizens with such little human humour\nIt's no wonder that we're disilliusioned\n\nThis resolution's gonna end in revolution\nJust like any other governance that doesn't accept evolution\nTo be perfectly honest, m'lord, there'd be less intrusion\nIf you curtly abolished the law and left us to it\nAnd why do games require safety ratings\nBut any age can see adult-aimed plays and paintings?\nIt's state censorship, the same as Beijing;\nBut even China thinks a pirate isn't worth the time of day for chasing\nI think Chairman Mao would say the same thing\nSince you became secretary, it's like the state's your plaything\nYou made a massive sacrifice, invaded loads of privacy\nBut if I wanted to download, there'd be no hope of finding me\nI could take my mobile phone to the local library\nAnd utilise the free wireless to find the file I need\nThen what are you going to try - to disconnect their ISP?\nYou might as well just burn the books on rights to speech\n\n[Chorus]\nDear Mandy\nStay away from my family\nYours considerably angrily\nDan Bull\nDear Mandy\nStay away from my family\nYours considerably angrily\nDan Bull\n\n[Verse 2]\nWho'll profit from the Digital Economy Bill?\nNot the public, but the profiteers probably will\nWho'll profit from the Digital Economy Bill?\nNot the public, but the puppeteers probably will\nI've talked about how intellectual property kills\nAnd you're still just concerned with who's copping the bill\nIt's quite obvious you've been lobbied\nUntil the copy holders got control, and you're probably their shill\nIt's not your problem when you're positioned on top of the hill\nIn your property that probably cost a couple of mil\nBut wake up and smell the coffee, the milk is going off\nAnd you're not bothered 'cause your coffers are filled\n\nLord, it's time you took an honesty pill\nAnd acknowledged the majority aren't horribly thrilled\nSo what if I watched a torrented comedy film?\nI don't need to now my country's just become a Brazil\nYou know the truth, Orwell spoke his views\nYour House broke the news and all Hell's broken loose\nThe utopia we hoped for is overdue\nSo could you help out a little bit and don't be stupid?\nThe onus is on you to show us\nYou aren't using your throne in a way the voters don't approve\nI know you're very close to David Geffen\nSo maybe his interests have given you a hazed perception\nHey, do you reckon you'd win today's election\nConsidering you're chasing this amidst a great recession?\nDeception's the politician's favourite weapon\nBut we're already jaded from one too many painful lessons\n\n[Chorus]\nDear Mandy\nStay away from my family\nYours considerably angrily\nDan Bull\nDear Mandy\nStay away from my family\nYours considerably angrily\nDan Bull\n\n(I love you, Mandy)", "year": "2009-11-26"}], "artist": "Dan Bull"}