{"songs": [{"image": "https://images.genius.com/12050a804ab917bd775a1d975b4e6196.322x499x1.jpg", "lyrics": "The following is an exclusive excerpt from the third chapter of my new book Texts from Bennett (a novel). The book will be released on September 3rd by Simon & Schuster, and will be available wherever books are sold. Copyright © 2013 by David Sheldon.\n\nWho’s the greatest basketball player of all time?\n\nWho’s the most ferocious boxer of all time?\n\nThink of a number between one and ten. Got it? Good\n\nMichael Jordan, Mike Tyson, and the number seven are all prime examples of a single entity being such a powerful, behemoth force in their respective industries that they erase whoever came before them from memory and are used as a constant measuring tool to compare and contrast whoever comes after them\n\nNow. Think of a few famous rappers. Got ’em? Who’d you come up with? 50 Cent? Jay-Z? Kanye West? 2Pac? Biggie? LL Cool J? Lil Wayne?\n\nGood job. But what about white rappers? How many can you name? And no, Vanilla Ice doesn’t count. He was a major record label experiment gone awry. I mean famous, certifiably talented, white rappers. Who’d you conjure up? Got him?\n\nEminem\n\nEminem is an undeniable talent. He deserves every dollar and fan he has accrued over the last decade. However, the motherfucker kinda sorta casted a titanic eclipse over the hip-hop genre and type-casted every other melanin-deficient rapper as nothing more than an Eminem wannabe\n\nWell, at least on a mainstream level\n\nIf I were to tell you that there are several hardworking, but not super famous, white rappers who began their careers before Eminem even existed in the public eye, and who currently make a decent-to-great living off modern rap music, would you believe me? And I don’t mean white poseurs, drinking Moscato, throwing wads of cash around in their videos, acting like “stereotypical black rappers.” I mean rappers who rap about day-to-day things people of all races go through. Authentic rappers, with skills and rhythm and a voice worth listening to. I’m one of those rappers\n\nI’ve gone by Mac my entire life, but my legal name is David McCleary Sheldon. I’m a thirtywhatever, full-blooded American male with grandparents from Kilkenny and Cork. I inherited the classic Irish temper; a pasty, outer layer of skin; and ginger facial hair that blends with the chalky black hair my Black Irish relatives always had\n\nA NOTE ON THOSE BLUE-EYED, DRACULA-LOOKIN’ MOTHERFUCKERS:\nAs I’ve explained to Bennett on at least ten different occasions, “Black Irish” is a term used to describe descendants of immigrants from the prehistoric Iberia and Basque regions who hybridized with Irish natives in 7000 BC. It’s not referring to African American people with Irish names, e.g., my sixth-grade teacher Mrs. McCormick, and Eddie Murphy.\n\nI was born in Kansas City, Missouri, during the Leo moon to Warren and Ruth Sheldon. My dad is a hardworking, blue-collar Ohio boy who has a problem being nice to waitresses and terrible road rage. My mom was an artsy, thoughtful, Saint Louis belle, who was always very nice to waitresses and drove too slow. My parents divorced when I was five years old, so I never really saw them married, but they lived only a few blocks away from each other, so I had a solid relationship with both of them while growing up. My mom died in 2004, but I still have my dad; my two sisters, Rose and Evelyn; and their great husbands, Greg and Henry\n\nI’ve loved Brazilian jujitsu, movies, and rap music for my entire life. I spent a majority of my formative years having vivid daydreams, staring into the distance, thinking about girls, and being completely disconnected from what was going on in the classroom. I was a space cadet, fully apathetic to the idea of success or work. School was so boring. I just wanted to sleep\n\nWhat might surprise people: my Kansas City high school was a third Caucasian, a third Latino, and a third African American. There were also a few Asian and Indian kids, a band of Russians, and one Lakota kid, who came to school on hallucinogenic mushrooms at least twice a week and whose legal name was Adam Little Elk Running Over the Enemy. (What up, Adam? Call me when you see this!) There were a lot of drugs, fights, and troubled kids at my school. There was also a nursery for the girls who had babies\n\nI wasn’t necessarily a bad kid, especially compared to some. But I did have disciplinary issues. I skipped school a lot, got caught smoking pot in the parking lot a few times, and even got busted for having vodka mixed into a plastic bottle of Tropicana orange juice. I just wasn’t stimulated by the stuff my teachers were teaching\n\nI tried to get my parents to let me attend an art school of some sort, where I could develop right-brain abilities like sketching, oil painting, and creative writing -— but they declined. They didn’t have the money to send me somewhere like that. So, instead, I just sat in decay, year after year, letting public schoolteachers cover my third eye with black spray paint\n\nOne random, agonizingly boring day during sophomore year, having slept through my morning classes, I was quite refreshed after lunch and was sitting in study hall with nothing to do. Not unusual. That day, though, I borrowed a piece of paper from Letasha Tilman and wrote MC Reptile at the top of it (my first rapper alias)\n\nI still remember the verse by heart:\n\nMy name is MC Reptile\nI weave words together like textiles\nI grab the microphone and smack the sheriff off his saddle\nI battle like a rattlesnake and make you all skidaddle\nRappers fuck with me they get beaten like eggs\nYou try to kick rhymes and I’m eatin’ your legs\nI stay so fresh, cook rappers like gizzards\nBitch I’m the wizard, the Reptile lizard\n\nIt may not look like much, but the mere act of writing those eight lines permanently seared the cobwebs from my imagination and inspired me to never sleep during class again. Instead, I began nurturing my passion for rapping\n\nI’d heard the cliché: “You must spend ten thousand hours intensely practicing something to master it.” So for the next six years, I did just that. I filled countless notebooks with rap lyrics, constantly challenging myself to parent my own, unique writing style. I read dictionaries and thesauri to expand my vocabulary, memorizing all sorts of exotic words and their definitions\n\nBorborygmus: the rumbling sound of gas passing through the intestine\nFuscoferuginous: having a dark, rusty color\nQuomodocunquize: to make money by any means possible\n\nI read every book I could find by William S. Burroughs, Jack Kerouac, Vladimir Nabokov, Ernest Hemingway, Mikhail Bulgakov, Kurt Vonnegut, and Cormac McCarthy to try and learn how to write with deliberate fluidity. I devoured every rap album I could find, picking apart each rapper’s deficiencies, adopting my interpretation of their strengths. I would freestyle rap for hours in my bedroom into a handheld tape recorder, while doing jumping jacks and push-ups. This helped me simultaneously improvise new rap ideas and develop lung power, projection, verbal articulation, enunciation, and breath control\n\nI was methodical. I drilled constantly, pushing myself to improve. I never set out to be famous, or even make a living off music. I just wanted to impress kids in the high school cafeteria with my freestyle raps, while I made fun of Margot Glasscock’s last name, or rapped about sleeping with Miss Steele, the school’s foxy, thirty-two-year-old algebra teacher\n\nAfter honing my rapping skills, I set up a makeshift studio in my mom’s basement and recorded my first album, Mixed Drinks. The writing was funny, weird, and quirky. I made songs about not being able to find my car keys, and getting broken up with by a girl I didn’t like in the first place but wanting to win her back just to have bragging rights on who broke up with whom. While it was lo-fi and sounded like crap, the people I passed it out to seemed to enjoy it for what it was. So I dropped out of high school and decided to pursue being a rapper full-time. Backup plans are for pussies\n\nTouring seemed like the best way to expand my career, so I spent years networking with other independent artists, driving ten to fifteen hours every day, just to play free shows for crowds of fewer than fifty people. I passed out free tapes (and eventually CDs) that I assembled myself at Kinko’s and slept on the beer-stained apartment floors of random weirdos my crew and I would meet at shows, to avoid paying for a hotel room. I could fill an entire book with tour stories from my early years, most of them unfortunate\n\nTouring and building a fan base from scratch is immensely hard, and most people don’t even achieve moderate success doing it. Most people quit the first time they fall flat on their face. Believe me, you have to be partially nuts to endure the things that traveling, working entertainers endure\n\nOnly 1 percent become megastars. The other 99 percent of us are on a daily grind, dreaming we can one day pay off our bills from music\n\nLuckily, my dreams started to come true. After giving a passionate decade of my life to being a rapper, I started to turn a profit. My tiny, scattered, local following had enveloped into a dedicated worldwide fan base. I could play just about any part of the world, and pull at least one hundred people -- one thousand in some places\n\nI sold t-shirts, CDs, trucker hats, sweatshirts, dog bowls, backpacks, fanny packs, socks, girl panties, pint glasses, shot glasses, et cetera -- all with my logo printed on them. I was a working, self-funded, independent rap artist, selling out shows, paying the bills, and living a dream that is oft never achieved by a majority of musicians, let alone rappers\n\nFor once in my life, music was no longer a struggle. It was a highly lucrative roller-coaster ride that afforded me the ability to travel anywhere and purchase anything I wanted, which was new to me, and slightly unsettling. I knew there was no way this could last forever, so I decided to invest my money wisely while my chips were up. I found an amazing, albeit slightly gaudy, house in the Brookside area of Kansas City, Missouri, put down a giant down payment (since touring tends to lead to bad credit), and moved in\n\nI had my own home (I bought a house!), and it felt great\n\nMe: Hey fucker, guess who?\n\nBennett: ?\n\nMe: Guess who this is, you little dicked twerp\n\nBennett: ho i told u to stop texten me my girl gonna c dat shit\n\nBennett: bcide u wuz luven my big dicc in da parkin lot da otha nite lol slut\n\nMe: Lol, you think this is a girl\n\nBennett: dis is ashly duh\n\nBennett: look.. u ever seen a tigger or a lion git married?\n\nBennett: u ever seen a eagel wit a diamend ring on it”s finger?\n\nBennett: no u haven't dats bcuz men R not saposed 2 be wit 1 women. men R wild animels......i fucc alot of hoez cuz men r saposed 2 spred there seed da bibel says we gatta evolve and fucc\n\nMe: This isn’t a girl!!!!\n\nBennett: wat\n\nBennett: now u gunna try 2 say u were a guy da hole time?bitch i seen ur vaginna u a girl or u got a realy gud sex change\n\nMe: LOL, STOP. This isn’t fucking Ashley. Who’s Ashley?\n\nBennett: quit playn on my phone bitch who dis !!!\n\nMe: It’s Mac\n\nMe: Helllooooo???\n\nBennett: mac my cuz??..\n\nMe: Yes sir\n\nBennett: o shit lolz\n\nBennett: wud up G\n\nMe: Care to explain what’s happening with your mom losing her house?\n\nBennett: man.. it sux\n\nBennett: basicly da punk ass govermant niggas is kiccin us out da crib Cuz day so broke dat even my mom bustid ass house is wort takin\n\nMe: Is she not doing well? Why can’t she pay the bills?\n\nBennett: nigga my mom on Oxycotton 247365 times a day\n\nMe: Do you mean 24/7/365?\n\nBennett: ya but im gittin sum pussy right now so i ain't have time to type dat side ways / thing\n\nMe: Liar. You said “times a day” which negates a / even working. Bennett: look pussy u alweys talk shit to me when we txt.. u probaly jellice from all da COCC i sell and da $$$ i get\n\nMe: You make money selling cock?\n\nBennett: na COCC... fuccin.. cocainn\n\nNOTE FOR THOSE LOOKING TO LEARN HOW TO SPEAK FLUENT CRIP:\nMembers of the Crips do not ever put the letters C and K next to each other and just use two C’s instead. CK stands for Crip Killer, so this is a very serious typographical issue\n\nMe: I’m fucking with you. WHY is your mom on OxyContin?\n\nBennett: cuz she also sleep all day an stop payen da bills..\n\nMe: Her back is fucked up still, right? But OxyContin? Does she need OxyContin?\n\nBennett: ya she in pain alot. butt cmon playa n e 1 who take oxycotton does it for fun not bcuz they need it..nigga u ever try dat shit?it make u feel like ur 2pac in dat hot tub holden stax of cash pouren chammpane on a striperz head\n\nMe: I see. Uh. Also, who’s Tim?\n\nBennett: dats my mom BF\n\nMe: Yeah? You live with him, yeah? Why can’t he help with the bills?\n\nBennett: he wierd. he duz acid and smoke hella weed wit me but he a bum ass nigga 2.haha. he broke as fuk\n\nBennett: butt he smart like U doe.....\n\nBennett: he read sum wild ass books like U. sum crazy shit wit Da Illuminadi. he a wild ass nigga\n\nBennett: he show me a video on UTube of 911 an how da govermant planted dinamite in da billdings and blew dem up\n\nMe: Do you believe that stuff, Bennett?\n\nBennett: hell yea who doeznt.?da white house has a grave unda it wit gosts and shit\n\nBennett: i dont beleive anything on Da news\n\nMe: Right on, buddy. I’m going to call your mom. What’s her number?\n\nBennett: K hang on\n\nBennett: 913-648-****\n\nNow that I knew more of the scoop, I called Aunt Lillian and extended an invitation for them all to come stay with me for a few weeks. She was so intoxicated on painkillers that I couldn’t understand a word she said, other than, “Thank you so much!”\n\nThis was spur of the moment, but I knew it was the right thing to do. Family is family. You’re supposed to help family. Right? And all I wanted to do right then was help my aunt. Especially after hearing the pain and confusion in her voice over the phone\n\nEspecially after what she did for me in 2002.\n\nContinues...", "year": null, "album": "Texts from Bennett", "title": "Chapter 3: A Beer-Stained Letter (Texts From Bennett)"}], "artist": "Mac Lethal"}