{"artist": "Cadet", "songs": [{"title": "Gang Gang", "album": null, "year": null, "image": "https://images.genius.com/3b688522741e54212fca9edfaf14b66a.336x330x1.png", "lyrics": "[Intro]\nYo, ma' nigga\nSorry I had to rough you up like that but\nYou weren't playing nicely init (L.A. Beats)\nYou know my team, you know what we represent\nShoulda played along nicely, init\n\n[Verse 1]\nLet me tell you who I am\nI'm gonna talk; you just gotta listen\nStarted off getting bullied in school, look\nMost my life I've been a victim\nNever had a girlfriend\nGot low self-esteem but I wanna be the man\nNo, I don't like who I am\nBut when I'm older I'ma do what I can, but\nLook at me now\nHop out and run a man down\n'Cause when I was younger, I never had a voice\nMight be the reason I violate your boys, and\nAnd I even go gym\nMan it's different to when I was a kid\nA real bad man, real talk—no bluffing\nTell girls what I do and they love it\nI spent a couple months in training\nEven had me doing ten toes on pavement\nMaking sure the ends was behaving\nSee, it's so bad but I ain't complaining\nBut now I'm perfect with the aiming\nAnd a driver, been in bare car chases\nMight pull up when your bredrins are raving\nLock off the rave, nobody can say shit\nIf you knew how much food I confiscated, it would drive you crazy\nI'll grab man if he's got cash on him\nOr wrap man if he's got wraps on him\nI see man driving mad\nI pull man over like, \"Wagwarn, fam?\"\nRude boy, I don't give a damn\nCall back-up quick and just violate man\nI don't slip, I got my vest on\nBig baton and a taser are the weapons\nI could fold a man right now, with an M16 or a shotgun\nBro, it can get long\nDon't press buttons but the trigger might press one\nCall the judge—my case, I can get gone\nTake man's food, I don't care what it is, could be peng, flake or ten times stepped on\nNiggas know me, I don't care what number your gang is\nThink you're bad? We got bangers\nInterrogate man, make man have manners\nPut you in a cell for twenty-four hours\nLike, what you gonna say, brudda?\nWaste man's time 'cause I want to\nLike fuck that, what you gonna say brudda?\nPussy-hole, do your research, the system's in my favour\nFuck you up right now\nAnd I'm calm it won't make the news or the paper\nYeah, I got it patterned like that\nNo I shouldn't but, yeah, man, I'm bragging like that\nI'll say, \"You put your hands on me\"\nI know you never, but I'll say it happened like that\nNothing, no, you can't tell me nothing\nBust case all the time like it's nothing\nYou know how much shit we did?\nIt was my team that got down Mark Duggan\n\n[Verse 2]\nNext day on the force, we back, again\nGet searched, 'cause you're black again\nChoke out Rashan Charles in East London, say it's an accident\nAnd I'm this close to banning drill, and done that shit\nSomeone got stabbed at the Rated Awards\nMm, yeah, we love that shit\nYeah I know about grime, Link Up and all dat\nWhere you're so stupid; stab someone, go booth and record that\nAnd then say you're on obbo\nNo, you're just so easy to follow\nAnd I got a quota that I gotta reach\nGet two more of you lot by tomorrow\nAnd let me tell you suttin' to tell your brothers\nIt don't matter that you got a bally on now\nThere's videos before when your face ain't covered, you stupid pricks\nYou make me sick\nLike, \"Officer, I'm recording you\"\nSo? You think I give a shit?\nWitnesses say they'll complain because they see me taking the piss\nOne: they never do\nAnd two: if they do, I get a slap on the wrist\nSo, pussy-hole, let me tell you suttin'\nI can violate you for fucking nothing\nAnd get away with it, 'cause we're the judges\nStop saying, \"Gang\", we're the only gang in London, pussy\n\n[Outro]\nL.A. Beats\nCadet, Cadet!"}]}