{"songs": [{"year": "2012-09-25", "album": "No Rest For The Sickest", "image": "https://images.genius.com/722e06f99f89c33722f4da87eb198a3e.710x710x1.jpg", "title": "Nowhere To Go", "lyrics": "[Intro: Sample]\nAre you alone?\nNo one's out here\nAre you alone?\nNo one's out here\n\n[Verse 1]\nSame day, started as the last one\nNothin' changed, kind of hoping it's a fast one\nNow my mates man, I hardly ever see 'em\nI know they feel I changed but I'm feelin' like I'm dreamin'\nNow when we drink up, we reminisce and laugh\nI'm feelin' bad, I'm out it but they still stuck in the raw\nWeighin' drugs on a scale just to pay bills\nPlus the boys doing time, how do they feel\nNo matter what, I am stuck in the gutter\nMoney can't change shit, it's my brain motherfucker\nIf I had enough bills, I'd get all the crew fed\nBut I gotta feed the fam and remember you said\nYou had my back, well I'm needing the support\nTry and move but I crash, plus I'm fiendin' just to talk\nNobody want to listen so I'm walking these dead streets\nFeeling like the only thing that knows is a Nebs beat\nWhat the fuck you thinking, 'cause I got fans now\nThat I don't need your help? Fuck, I'm putting the pen down\nWait I can't do that, 'cause that's the shit right\nThis the medicine that's going to save a kid's life\nBut I talk about drugs, so now I'm no good\nShow your parents what the fuck around your own hood\nThen maybe just maybe you'll fucking understand why\nAnd hate me but rate me and the exact same time, 'cause I\n\n[Hook]\nFeel alone like there's nowhere to go\nI try to find a home but I'm back on the road\nAnother mate rang but I missed the call\nSo you can use your fuckin' brain but you ain't thinkin' at all\nAnd yeah, I feel alone like there's nowhere to go\nI try to find a home but I'm back on the road\nAnother mate rang but I missed the call\nSo you can use your fuckin' brain but you ain't thinkin' at all\n\n[Verse 2]\nI could be drug fucked, that would make sense\nYou try to hold the weight I'm holding, it would break legs\nCones that I've packed, every tab that I've popped\nOn the phone to my dad, but he don't know that I'm lost\n'Cause I play it all good, no one needs to know shit\nDon't know if I should, don't know why I wrote this\nFeeling so confused, why the fans showin' love?\nWhy I'm writing shit like this, does it mean I'm growing up?\nIf that's the fucking case, I'd rather feelin' like a kid again\nWhen we was running mucks I probably had them people listenin'\nNowadays, it's not the same, or tell me is this what the fame\nIs doing to my brain? I've gone insane, I need a doctor mate\nI got a lot at stake, I gotta stop it ayy\nThey tell me drop the pills, I end up fuckin' popping eight\nI got my girl and thank fuck for that\nI love her, need her 'cause I'm losin' all my trust in rap\nPlus she found my fucking stash and she flushed it down the toilet\nNext day, I went and scored, don't talk about it, I avoid it\nWhere to go? What to do? 'Cause I'm lost, what?\nNow these haters gonna use it as a soft spot\nBut what's not to say that you is not the same\nSomehow I'm in my right mind but I lost my brain\nThat's my heart, sittin' served up on the paper\nI fucked up and saved nothin' for later\n\n[Hook]\nFeel alone like there's nowhere to go\nI try to find a home but I'm back on the road\nAnother mate rang but I missed the call\nSo you can use your fuckin' brain but you ain't thinkin' at all\nAnd yeah, I feel alone like there's nowhere to go\nI try to find a home but I'm back on the road\nAnother mate rang but I missed the call\nSo you can use your fuckin' brain but you ain't thinkin' at all"}], "artist": "Kerser"}