{"songs": [{"title": "OOOUUU (Clinton Sparks Remix)", "lyrics": "[Intro]\nYo, bro, I think I had too much Hennessy, man\nThis Hennessy gettin' to me\nI ain't gonna lie, I'm a little smizz\nI'm a little drizz\nBut we in the club, man, OOOUUU\n\n[Verse 1]\nYeah, they hate, but they broke though\nAnd when it's time to pop they a no-show\nYeah, I'm pretty, but I'm loco\nThe loud got me movin' slow-mo\nAyo, Tweetie, where the hoes, bro?\nAyo, Keys, where the hoes though?\nThat other nigga, he a bozo\nIt's M.A, you don't know, ho?\nWe got liquor by the boatload (that Henny)\nDisrespect the Lyfe, that's a no-no\nAll my niggas dressed in that rojo (Redlyfe)\nI ride for my guys, that's the bro code\nBro code, bro code, bro code, bro code\n\n[Drop]\nThese haters on my body, shake 'em off\n\n[Verse 2]\nBaby gave me head; that's a low blow\nDamn, she make me weak when she deep throat\nI need a rich bitch, not a cheap ho\nThey be on that hate shit, I peep though\nMy brother told me: \"Fuck 'em, get that money, sis!\"\nYou just keep on grindin' on your hungry shit\nIgnore the hate, ignore the fake, ignore the funny shit\n‘Cause if a nigga violate, we got a hunnit clips (grrrrrrrah!)\nAnd we go zero to a hundred quick (ooouuu)\nWe just them niggas you ain't fuckin' with (oh no)\nPockets on a chubby chick (ah)\nAnd still go bag a thottie in some bummy shit (ooouuu)\nYerr, Eli, why they testin' me?\nLike I don't always keep the hammer next to me\nLike I ain't got a hitter to the left of me\nLike we ain't in these streets more than Sesame\nIf that's your chick, then why she textin' me?\nWhy she keep calling my phone speaking sexually?\nEvery time I'm out, why she stressin' me?\nYou call her Stephanie? I call her Headphanie (OOOUUU)\nHeadphanie, Headphanie, Headphanie, Headphanie, Headphanie, Headphanie-ie-ie-ie\n\n[Drop]\nThese haters on my body, shake 'em off\n\n[Outro]\nI could never lose, what you thought?\nWhat they thought?\nI could never lose, what you thought?\nThis Henny got me, it got me sauced\nOOOUUU, OOOUUU", "album": null, "year": "2016-11-16", "image": "https://images.genius.com/e0d8f9d955135a06a1522e82130b3e9c.1000x1000x1.jpg"}], "artist": "Young M.A"}