{"songs": [{"year": "2014-07-14", "album": "MTV1987 ", "image": "https://images.genius.com/cee8162ada8ffe30fb2fad44f0e8d4e0.1000x1000x1.png", "title": "Tame Cab", "lyrics": "[Intro]\nGive yourself a round, you don't love yourself\nThat's why you're all alone and always by yourself\nSyringe your only friend, but it won't help you now\nI can see it in your skin, your demons showing out\n\n[Verse 1]\nBlack sand, pink moon\nI'm hoping you would think soon\nIt's only three weeks before eviction, then we move\n\"Tell me you would miss me, tell me you would miss me\nOkay, Kevin, then prove it to me, uh, kiss me\nProbably be on the news tomorrow if you'd dare to diss me.\"\nThe baby mama drama that we kept inside our kitchen\nAll her friends was listening, tryna catch attention\nOh, you so cold, the truth unknown, no\n\n[Pre-Chorus]\nThe red wall, the waterfall\nAnd the red wall, wasn't ready for it at all\n\n[Chorus]\nIs it love that we're fighting for?\nDo I trust you enough with my soul? Who I\nReally am is not enough\nThis ain't love, distant love, oh\n\n[Verse 2]\nMy week's been going slow\nIt's something 'bout this hoe\nShe don't like when I call her that though\nIt's okay, you are my world, girl\nAnd not much changes, slang words just words from a nigga's\nMarriage, she don't like to kick it with us\nShe been trying not to come off too pretentious\nBut she the bomb and she know it\nHer hair bomb, and she know a nigga know it\nYeah, and she know a nigga love it\nWe be doing drugs all out in the public\nStumbling in publics, talking the rubbish and I love it\n\n[Bridge]\nThe red wall, the waterfall\nAnd the red wall, wasn't ready for it at all\n\n[Chorus]\nIs it love that we're fighting for?\nDo I trust you enough with my soul? Who I\nReally am is not enough\nThis ain't love, distant love, oh\n\n[Transition]\nIs it love that we're fighting for? (Tell me what we're fighting for)\nDo I trust you enough with my soul? Who I\nReally am is not enough\nThis ain't love, distant love, oh\nIs it love that we're fighting for? (Tell me what we're fighting for)\nDo I trust you enough with my soul? Who I\nReally am is not enough\nThis ain't love, distant love\nIs it love that we're fighting for?\nDo I trust you enough with my soul? Who I\nReally am is not enough\nThis ain't love, distant love, oh\n\n[Verse 3]\nIt's that boy from school that robbed them fools that\nMessed with that little girl, cause\nAll of em do that, you holding you back\nAddicted to the thrill, love it if it ain't real\nFuck it, that's how you feel\nMomma hate that you steal\nIt gave her body chills when she saw the thrills\nWhen she saw the pills on the kitchen counter\nAll the pain around her, all the blood surround her\nKeep her down and out, but\nWhen the lights is out, bruh, what you gonna do?\nDaddy is on the move, still bang out after school\nHang around all them fools\nOh, you think you so cool, oh, you think you so cool?\nOh you think you that dude\nOh, you think that you rule?\nThis little bubble town, think you the man around?\nYou got it figured out?\nYour brother's crying out, your sister's crying out\nYour daddy's crying loud, and I'm to blame now\n\n[Outro]\nAnd when it come, it's gon' come with a storm\nAnd when you fly, better fly to the sun\nAnd quit that crying now, boy, escape that island now, boy\nDry your eyelids young boy, the horizons sighing now, boy\nAnd when it come, it's gon' come with a storm\nAnd when you fly, better fly to the moon\nAnd quit that hiding now boy, escape that island now, boy\nDry your eyelids, young boy, the horizons dying now, boy"}], "artist": "Kevin Abstract"}