{"songs": [{"title": "UNOWHTSAYN", "album": "Professor @ Large", "year": null, "image": "https://images.genius.com/536f87313724dc89ebf225238cad36ec.600x600x1.jpg", "lyrics": "[Large Professor]\nYo\nThey say an apple a day keeps the scalpel away\nIf I'm out in NY or I'm out in LA\nX-P, Large ProTools, go deep like a boat cruise\nMy brother Nate helped me light the fuse\nSo I could detonate poems to your domes that resonate\nA million thousand years of hot devastatin\nClassics, stick to your ribs, Michael Jackson\nAll-star status, pause, stop the madness\nI'm the listenin to Sean Hann, who the catfish (???)\nDoin' backflips to the mattress, screwin\nThat chick, that's awesome, frontin, that'll cost em'\nEverybody in the place cheer for the boss dog\nGet ya boss on', this here's your song\nI perform without breathin like (???)\nRollin purp, or solemn and burp, I'm stayin\nTrue to the G-A-M-E, know what I'm sayin?\n\n[Hook]\nYou know what I'm sayin?\nYou- you- you know what I'm saying?\n(repeat 4x)\n\n[Large Professor]\nBalls burst when I drop a verse, takin hip-hop\nTo church, when I'm done you need a doctor or nurse\nCause I'm killin' it, feelin' it, pen rhymes that's brilliant\nTil' we in, really in, big shout to Jillian [Hi baby!]\nFlushing Queens on the map of New York\nWhen I drive by bumping new tracks, roof off\nThey promoting, treble exact, bass is potent\nThere's no thing, holding it back now, it's so in\nAnd poppin, I go in and losin ain't a option\nYou nod your brain to my latest concoction\nSo move out the lane while I claim it for pops and\nMoms, who got qualms, I lock arms\nFor the family, but try to live amicably\nIn the streets and I slide you a animal beat\nFrom AM to PM, I'm layin\nHardcore tracks you keep replayin, know what I'm sayin?\n\n[Hook]\n\nTurn it up on the DAW, crank the speakers loud\nThrow the beer on, pull them fresh sneakers out\nRoll or ride out, cause it's hot out\nFill me up with some beers at the hide out\nThrow a shout out to the bredren\nLiving legend Large Pro I'm out here, find out\nLook at the body count, chillin beyond a doubt\nDoing laps in the mall with the charge account\nQuick to march them out, single file\nTo the lair after we leave there, that's what I'm talking about\nThrough word of mouth, I announce it\nThen arouse the gathering from here to dirty south\nHot off the presses, with freshness\nAnd I dot all the I's and I'm crossing the S's\nWith my presence, MCing and DJing\nDay in and day out we creating, know what I'm sayin?\n\n[Hook]\n\n[Fireworks]\n\nThis is Large Professor\nLettin' y'all know\nYa got love for me\nI got love for you\nShout out to Distro-Boi and EQ (???)\nKnow what I'm sayin?"}], "artist": "Large Professor"}