{"songs": [{"image": "https://images.genius.com/0c2b6ab5b12521682ccf377202642c09.600x600x1.jpg", "album": "XXX", "title": "Party All the Time", "lyrics": "[Verse 1]\nAlways wanna go\nAlways tell her \"yes,\" never tell her \"no\"\nKnow you think you know everything, but you don't\nWanna do the right thing, but you probably won't\nSo you chase the night life, blinded by the lights\nBottom of the empty glass, where you find life\nAlways left behind, because she think she right\nThinking that she grown but always need your advice\nAnd always in a situation that she need your help\nBut wouldn't help another, only care about herself\nIn your VIP, asking where the drink at\nCalling her a groupie, you'd think she'd really think that?\nShe just wanna hear that that ass look right\nWhat you doing after this? Fuck tomorrow night\nWanna snort some blow? Pop a lot of pills?\nFucking when the sun come up, she don't feel\n\n[Hook]\nShe wanna party all the time\nParty all the time, she wanna party all the time\nShe wanna party all the time\nParty all the time, she wanna party all the time\n\n[Verse 2]\nSkip semester, classes have passed\nSay she going back, but she ain't going back\n'Cause time ain't waiting for a future on hold\nAt glass tables, on her knees, sniffing coke\nTell her get a hold, grip on life\nRather fill her cup up, liquor with no ice\nTwice had an abortion; young, dumb, misfortune\nRate that she going, she might be whorin'\nSigns she ignoring, but doesn't recognize\nBlind to what's occurring, what's going in your mind?\nSeven days a week, same shit every morning\nCalling her a cab from different nigga's apartments\nWanting her to change, but she won't, dog\nJust another number in her fucking call log\nLost in the fog, head in the smoke\nLaughing at the world 'cause her life is a joke\n\n[Hook]\nShe wanna party all the time\nParty all the time, she wanna party all the time\nShe wanna party all the time\nParty all the time, she wanna party all the time", "year": "2011-08-15"}], "artist": "Danny Brown"}