{"songs": [{"year": "2014-10-29", "title": "Kentucky", "image": "https://images.rapgenius.com/d3ae99b78c30099fe16840076e0c4f6e.400x400x1.jpg", "lyrics": "[Produced by Saba]\n\n[Intro]\nHaha, haha\nHey, fuck you John Wall, fuck you\nHey, shoutout to DJBooth.net\nFree Jimmy\n\n[Verse 1]\nMan this nigga done lost his mind\nSo? I ain't lose my chick\nTo some nappy headed nigga with a fro\nLike yo, did you lose your pick?\nFrom where you can lose your life\nWestside get crucial quick\nGood kid, keep my head to the sky\nYo I don't even look down to piss\nThey need a shoulder I'm someone that they can pull on\nI drop dynamite brewing it like I'm bull horn\nYou ain't hot to me who the fuck are you foolin'?\nWith some dynasty shit my nigga we Mulan\nAustin officers incarcerated all of my associates\nThe only thing I'm 'bout to take shit over like Napoleon\nShit smooth like petroleum jelly, felly\nMy nigga sold weed in a Pelle Pelle\nI'll take division ave until the last stop\nPivot be the team and y'all just mascot\nShe download my CD on her laptop\nNever had shit, haves and have nots\nSaba done got, a little more courage to verbally murder you\nCertainly heard of him, whether city or suburban\nShe showin' the pearly whites in the second that she see me\nTurn your ass to a ghost but my city is like a ouija\n\n[Break]\nKill on command that's when he say shoot\nVoice carry, I don't need a booth\nDrop hits that's a TKO\nAnd this is not a warning, this is just something for DJBooth\nI tried to focus on the musicality of it\nBut the reality of it is niggas still playin' it down\nWell fuck 'em, there's no more playin' around, I said fuck 'em\nI spit it like I'm sprayin' a round\n\n[Verse 2]\nThey comparing me to these new niggas, honestly I'm offended\nMy competition isn't J. Cole, but was more like John Lennon\nI'm a legend like John Coltrane, Soultrain on a rock soulfish, cocaine flow, on the grind\n'Less that or let go, what you lost your ear? Mr. Potato Head\nAin't no place that, I can't say that\nI ain't get inspired from, I put out hits like a hired gun\nSo who's the best, so many said me\nSomeone done told y'all to get a job and a plan B\nI come correct like I wrote this in red ink\nI'm rappin' the grand rapids is gradually gettin' deeper\nKeepin' mine and I'm peaceful, I'm pieceing a perfect piece\nOf an album you can be proud of, I'm just glad that they chose me", "album": null}], "artist": "Saba"}