{"songs": [{"title": "Tumblr Post", "album": null, "year": null, "image": "https://images.genius.com/4fff53f85a4f6704ecb471ac0c617cfe.446x446x1.jpg", "lyrics": "It has been reported that I signed a new record deal, and that I did this to pay taxes. Yes, I have recently entered into an agreement with Sony Worldwide Entertainment, to launch a new label, on which my new music will be released. And yes, I am working on new music.\n\nI’ve remained silent, after an extensive healing process. This has been a 10+ year battle, for a long time played out behind closed doors, but now in front of the public eye. This is an old conflict between art and commerce… free minds, and minds that are perhaps overly tethered to structure. This is about inequity, and the resulting disenfranchisement caused by it. I’ve been fighting for existential and economic freedom, which means the freedom to create and live without someone threatening, controlling, and/or manipulating the art and the artist, by tying the purse strings.\n\nIt took years for me to get out of the ‘parasitic’ dynamic of my youth, and into a deal that better reflects my true contribution as an artist, and (purportedly) gives me the control necessary to create a paradigm suitable for my needs. I have been working towards this for a long time, not just because of my current legal situation, but because I am an artist, I love to create, and I need the proper platform to do so.\n\nThe nature of my new business venture, as well as the dollar amount reported, was inaccurate, only a portion of the overall deal. Keep in mind, my past recordings have sold over 50,000,000 units worldwide, earning the label a tremendous amount of money (a fraction of which actually came to me).\n\nOnly a completely complicated set of traps, manipulations, and inequitable business arrangements could put someone who has accomplished the things that I have, financially in need of anything. I am one artist who finds value in openly discussing the dynamics within this industry that force artists to compromise or distort themselves and what they do, rather than allowing them to make the music that people need. There are volumes that could (and will) be said.\n\nMLH"}], "artist": "Lauryn Hill"}