{"songs": [{"year": null, "lyrics": "Hayley Williams\nCan we pretend that airplanes in the night sky are like shooting stars?\nI could really use a wish right now, wish right now, wish right now\nCan we pretend that airplanes in the night sky are like shooting stars?\nI could really use a wish right now, wish right now, wish right now\n\nB.o.B\nYeah\nI could use a dream or a genie or a wish\nTo go back to a place much simpler than this\n'Cause after all the partyin' and smashin' and crashin'\nAnd all the glitz and the glam and the fashion\n\nAnd all the pandemonium and all the madness\nThere comes a time where you fade to the blackness\nAnd when you're staring at that phone in your lap\nAnd you hoping but them people never call you back\n\nBut that's just how the story unfolds\nYou get another hand soon after you fold\nAnd when your plans unravel\nAnd they sayin' \"What would you wish for?\"\nIf you had one chance\n\nSo airplane, airplane\nSorry I'm late\nI'm on my way so don't close that gate\nIf I don't make that then I'll switch my flight\nAnd I'll be right back at it by the end of the night\n\nHayley Williams\nCan we pretend that airplanes in the night sky are like shooting stars?\nI could really use a wish right now, wish right now, wish right now\nCan we pretend that airplanes in the night sky are like shooting stars?\nI could really use a wish right now, wish right now, wish right now\n\nB.o.B\nYeah, yeah\nSomebody take me back to the days\nBefore this was a job, before I got paid\nBefore it ever mattered what I had in my bank\n\nYeah back when I was tryin' to get a tip at Subway\nAnd back when I was rappin' for the hell of it\nBut nowadays we rappin' to stay relevant\nI'm guessing that if we can make some wishes outta airplanes\n\nThen maybe yo maybe I'll go back to the days\nBefore the politics that we call the rap game\nAnd back when ain't nobody listened to my mixtape\nAnd back before I tried to cover up my slang\nBut this is for Decatur, what's up Bobby Ray?\n\nSo can I get a wish to end the politics\nAnd get back to the music that started this shit?\nSo here I stand and then again I say\nI'm hopin' we can make some wishes outta airplanes\n\nHayley Williams\nCan we pretend that airplanes in the night sky are like shooting stars?\nI could really use a wish right now, wish right now, wish right now\nCan we pretend that airplanes in the night sky are like shooting stars?\nI could really use a wish right now, wish right now, wish right now\n\nB.o.B\nI could really use a wish right now\nI-I-I could really use a wish right now\nLike, like, like shooting stars\nI-I-I could really use a wish right now\nA wish, a wish right now, right now", "title": "Airplanes (radio edit)", "album": null, "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}