{"songs": [{"year": "2011-10-14", "image": "https://images.genius.com/51e08c065f8aa5228164bdf2fb4e6955.1000x1000x1.jpg", "title": "2 Sexy", "album": "Bossaura", "lyrics": "[Part 1]\nDer größte Frauenmagnet auf dem blauen Planet\nIn meiner Gegenwart ist deine Lady dauererregt\nIch nehm' sie mit, mach sie zu Hause auf dem Bettlaken\nZur Sexsklavin, bis die Bitch in Ekstase die Augen verdreht\nSie liegt erschöpft da, streichelt meine kurzfrisierten Haare\nSchläft dann friedlich ein in meinen durchtrainierten Armen\nUnd sie hat eigentlich Schule, doch will nicht weg von mir\nDie Ghettobiatch macht heute blau wie ein Tätowierer\nWir schlafen aus bis mittags um 12\nIch regel Business am Handy während sie Pizza bestellt\nEy und während sie den Abwasch macht\nChill' ich auf der Couch und verpack' das Hasch\nTick' es an die Jungs aus der Nachbarschaft\n23 Uhr - Feierabend\nSie hängt am Handy, macht die Nägel - Weiberkram\nIch pack sie, zieh sie langsam aus, bei Kerzenlicht\nSag zu ihr „Wehr dich nicht!“ und sie sagt „Werd' ich nicht“\n\n[Hook]\nAuf dem Cover von den Fashion Magazines\nDefiniert der Surferkörper neu das Sexappeal\nToo sexy für mein Shirt\nToo sexy für mein Girl\nToo sexy für mein Cash\nToo sexy für den Lex!\nStatus eines Szene-Pop-Idols\nAuf der Bühne, Ladies werfen die Bikinitops hoch\nToo sexy für mein Shirt\nToo sexy für mein Girl\nToo sexy für das Game\nSo sexy es tut weh!\n\n[Part 2]\nKurz nach Mitternacht\nIch fahr' mit der Bitch im Lex zum Club\nUnd er wird einhändig gesteuert, wie das Schiff von Captain Hook\nGhetto-Chicks mit gebärfreudigen Hüften\nBewerfen mich im Club mit mehrdeutigen Blicken\nGib deine Nummer, ich bin prominent, Bitch!\nChill' im VIP-Bereich, mit drei Orient-Chicks\nMit schlanken Körpern und braunen, mandelförmigen Augen\nAber psst, sonst wollen mich ihre Angehörigen hauen\nBabe, dein Arsch ist einsame Klasse\nLass uns mit deinen zwei Freundinnen den Nightclub verlassen\nIn's Hotel mit Hoes die sich für'n Vierer mit den Maybach-Insassen\nBreitschlagen lassen, so wie Teigwarenmasse\nWir killen drei Packungen Präservative\nChicas brauchen danach drei Wochen zum Regenerieren\nUnd du könntest wie Pulverfässer explodieren\nDenn deine Bitch hat sich mein' Namen quer über die Schulterblätter tätowiert, Kollegah\n\n[Hook]\nAuf dem Cover von den Fashion Magazines\nDefiniert der Surferkörper neu das Sexappeal\nToo sexy für mein Shirt\nToo sexy für mein Girl\nToo sexy für mein Cash\nToo sexy für den Lex!\nStatus eines Szene-Pop-Idols\nAuf der Bühne, Ladies werfen die Bikinitops hoch\nToo sexy für mein Shirt\nToo sexy für mein Girl\nToo sexy für das Game\nSo sexy es tut weh!\n\n[Part 3]\nIch lenke meinen Cardillac und habe keine Toleranz\nHole Guns, tick' der Mafia H\nCheck es, streck es, pack es, tick es\nMache damit locker 'ne Million an 'nem Mittag\nBestelle in meiner Villa mit Balkon in Nizza\nPizza, Calzone, der Ozean glitzert\nTeile mir mit Baywatch Babes ein Kilogramm Yay'\nMache damit durch bis zum Vogelgezwitscher\nCruise im Ferrari zum Flughafen, steig'\nIn den Privatjet mit Kurs auf Dubai\nVerprass' dort ein Fußballerjahresgehalt\nTurbantragend im Burj al Arab mit paar Scheichs\nSchwimme dann kurz mal paar Bahnen im Kreis\nIn dem Swimmingpoolbecken und step in die Suite\nZieh von den komplett mit Rubinen besetzten Toiletten mit Desinteresse ne Linie"}], "artist": "Kollegah"}