{"songs": [{"title": "The Price", "lyrics": "-Intro:Young noble\n\nYeah\nYoung noble outlaw!\nIs like my days is my nights\nThe pain come to life\nMy wrong is my right\nThey came with a price!\n\nVerse 1:Young noble\n\nYeah\n-Life is sort of like dice you gotta shake em up\n-Wake em up, let em fly, wish em luck\n-Coin toss you never know how they gon land you can wind up the underdog or hand an upper hand\n-Control your destiny you gotta have a plan on ya\n-Destiny or fail,heaven or hell\n-I put my soul on it\n-Im fightin devil niggas daily\n-Talkin to the angels kaddafi i know you hear me!\n-Talkin to god tryna show him that i know him everybody kissin ass to go to heaven ain't goin\n-The game ain't loyal\n-And dont expect nothing from nobody thay ain gon to nothin for you\nCut them the fast money\n-Make a nigga spoil you\n-Trickin at the stripclub and can't afford a loyal\n-Shit, these niggas got the game twisted\n-Im glad when they was spittin at game i paid attention\n\nHook:Young noble\n\nIs like my days is my nights\nAnd everything i write\nVisualize so vividly the pain come to life!\nThese young niggas was caught to do wrong and so right\nAppetite for destruction they came with a price! x2\n\nVerse 2:Young noble\n\n-Yeah, my people stealin shackles is an everyday battle\n-Everything black tryna murder their own shuttle\n-My people bein hurt when ban poozoo im a true king a warrior zulu\n-My people in the matrix so gone is frightening and you mean muggin your brother but smillin at the white man\n-My people need freedom\n-Searching for black jesus\n-Too many rappers\nNot enough leaders\n-Whole lotta trappers\nVery few fathers\n-Premature funerals over a few dollars\n-My people laws\n-Dont nobody come and say anybody want swag dont nobody want substance\n-We god souljas we search the true\n-Make the earth move\n-We gorgoutating the truth\n-My people need help i ain't give a fuck how you feelin\n-If you ain't felling me who the fuck is you feeling?\n\nHook", "album": "Son of God", "year": null, "image": "https://images.genius.com/a8b66e7d335c0770df394784c6af3f27.600x600x1.jpg"}], "artist": "Young Noble"}