{"artist": "Waka Flocka Flame", "songs": [{"year": null, "lyrics": "[Verse 1]\nI sit back, thank God for everything I got (Yeah)\nAnd for giving me life again when I got shot (Yeah)\nDreamed of being the biggest dope boy on the block (Yeah)\nRocks in my socks, boxers, draws, full of weed (Flocka)\nHit me up, shawty, I got everything you need (Brr)\nYou know my game, you know my team, our flag is lime green (Squad)\nYoung niggas, seventeen, gone off ecstasy\nHeaded down the wrong path, but all I know is clockin' that\nR.I.P Trap (Trap), you know we miss you (Yeah)\nWhat's to live for? (What?) Why you judging me?\nI'ma be all I can be\nI never been the same since Rara left these streets (Damn)\nAt the car wash when a nigga tried to kill me (Bow)\nRage in my eyes now they think I'm crazy (Bow)\nWild animal, they need to cage me\nAll I need my partners keep real with me\n\n[Chorus]\nAll I need\nIs a blunt and a cup, a couple of bad bitches keep it real with me\nAll I need\nA new foreign whip, soft leather, no rims, just factory\nAll I need\nIs for God to have my back, accomplish all my goals before I die, homie\nThis is all I need (Flocka)\n\n[Verse 2]\nI just wanna know, shawty, why these niggas hating on me?\nI ain't claim to be the greatest, I'm just trying to get some money\nI got tired of not having shit, fucked up shoes and dressing bummy\nI can't sell pills, weed, and gang bang all my life\nSometimes I feel like there's no way, but I'm trying to find a way\nFor my partners run away, before they thought they throw their life away\nTrying to get some hood stripes like a referee\nWhile these many men wish death on me\nFell in love with drugs, you call my girlfriend ecstasy\nLord, get them away from me\nWhy critics keep on stressing me?\nHip hop keep neglecting me\nLearn my upbringing before you bring me down\nTrying to blackball me like I'm Bobby Brown\nBut they fell in love with Flocka songs\nMy words deep, if you ain't tall enough you might drown\nMotherfucker\nAll I need is a bad bitch, one blunt (One blunt), one cup (One cup)\n\n[Chorus]\nAll I need\nIs a blunt and a cup, a couple of bad bitches keep it real with me\nAll I need\nA new foreign whip, soft leather, no rims, just factory\nAll I need\nIs for God to have my back, accomplish all my goals before I die, homie\nThis is all I need (Flocka)\n\n[Outro]\nAll I need\nIs a blunt and a cup, a couple of bad bitches keep it real with me\nAll I need\nA new foreign whip, soft leather, no rims, just factory\nAll I need\nIs for God to have my back, accomplish all my goals before I die, homie\nThis is all I need (Flocka)\nYeah (Yeah)", "image": "https://images.genius.com/1f976de77e6fff191e84fc83536dd61f.500x500x1.jpg", "album": "Salute Me or Shoot Me 3: Hip Hop’s Outcast", "title": "All I Need"}]}