{"artist": "Anderson .Paak", "songs": [{"title": "Room In Here (DJ Jazzy Jeff PLAYLIST Remix)", "album": null, "year": "2016-03-16", "image": "https://images.genius.com/6ace9497dff2c0788f52eb3059abd6a8.268x268x1.jpg", "lyrics": "[Chorus: Anderson .Paak]\nBaby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?\n\n[Verse 1: Anderson .Paak]\nI want you by my lonesome, above this crowded space\nIt's easier to hold some, when no one's in the way\nWell if no one's in the running for the part\nI'd love to pick a day\nTo show you the main room (Whenever's a good time)\nI don't need a bouquet, I just need proper space\nHomie three blocks away, I got bottles for days\nI got tropical haze, go ahead and wave bye\nLet me help with your coat, grab a hold of my arm\nTell them niggas to move, tell your sister you fine\n\n[Chorus: Anderson .Paak]\nCause baby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?\n\n[Verse 2: Anderson .Paak]\nAs crazy as it may seem, it's not too hard to read\nIt's too many ifs and maybes, and not enough certainty\nWell if no one's putting numbers on the board\nI'd love to take a swing, might even graze you\nBut I don't mean any harm, I'm just speaking my mind\nTake a look at that moon, 'bout as bright as your eyes\nWe got plenty of space, go ahead and recline\nTake a puff of that, get a sip of this wine\nYeah, feelin' good?\n\n[Chorus: Anderson .Paak]\nCause baby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?\n\n[Verse 3: The Game]\nShe had a bright smile, big white teeth, I mean\nWhiter than her white T, remind me of wifey\nMet her at the studio, sort of like a high buyer\nShe told me she had game so we connected like the wifi\nShe had this Asian swagger ‘bout her, so I call her mai tai\nStarted followin' her, she was the only thing on my timeline\nAnd there was this one picture, her in the swimsuit\nThat made a nigga want to beat it up, and I intend to\nBut I'ma have to put in work, baby girl then drink it all\nFace like Mona Lisa, I'm just tryna be the wall to hang on\nI ain't got no patience, I can't wait long\nShe come and see me, but she don't stay long\nAnd that's the problem, she a good girl\nMaybe it's too much smoke in the room\nAnd she don't want that Mary Jane in her Vidal Sassoon\nSo I'mma take a minute, and walk her to her Uber\nGot a bullet in my heart, and she the shooter\nAy, .Paak\n\n[Chorus: Anderson .Paak]\nBaby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?"}]}