{"songs": [{"image": "https://images.genius.com/b05d503168258badad9b337231b642c2.897x897x1.jpg", "album": null, "title": "Street Starz Freestyle", "lyrics": "Brother got me thinking it's like 5pm and i'm drinking\nI might lose my mind when i'm thinking there's no iPod but I'm syncing\nIt's like calm down you're not listening\nYou're with 3 G's but i'll pitch him\nYeah few fiends they're addicted\nAnd a few shots they went missing but\nNone of you man want beef and none of you man want heat\nAnd none of you man want smoke and none of you man make P's\nNone of you none of you\nNone of you man seen cash, none of you man own straps\nNeither do I\nIf I need that I've got boys that'll bring heat would've thought I'm in Dubai, nah\nBut I still think i'm in Dubai\nNo rapper's liver than I\nSergei called like \"I want to buy\"\nFive of the brown, five of the white\nJust write that down\nGive it to my guy on the bike who gives it to my guy on the fly\nNigga I'm the guy that sells to the guy on the left and I'll probably sell to the guy on the right\nThis line's so long I could peddle white to the guy in the sky\nMaybe it's rude\nMaybe it's true, trap-lines local money tied up I've never seen the total\n'cause I've got money in halves and 'cause I've got money in q (listen)\n'cause I got money in squares  'cause I got money in shoes! Nah\nHow do you talk about trap?\nHow do you talk about rap?\nHow do you talk about smoke?\nHow do you talk about 'bans?\nHow do you talk about Pablo Escobar 'cause you watched a documentary like fam, how can you talk about that? Wanker\nHow can you stress over draws?\nWhen we used to move that for banter trust me\nRapz said \"I like this flow\" (yeah!)\nAnd I said I like it too (word!)\nAnd a couple man try do road (what?)\nBut true say road done you (done you)\nAnd a couple man try chase hoes, and true say the hoes on you\nBut, when the hoes bring beef, yeah true say the show's on you\nLook, certain times I hate road (what?) fam, it's like how can I say this?\nMy brother's lost out to the system\nIt's like how do I sit there and make this?\nBut brother's like I've got a hunger, and this hunger it can't be sated\nLike, had a chip on my shoulder, and it chip there it can't be shaken\nFuck off I've rapped to like 500 guys and all of them said that I'm hard\nI've got prison in my blood cells down to my red blood cells all them fuckers got bars\nAnd all you fucks know I'm scarred, I got bar in my blood like a Jew\nStill pebbling pebble to food, It's like peddle the pebble to youts, and they pedal the pebble to you\nWorkers gotta own SIMs and a phone for a purpose, It's a network, what's ya net worth?\nGet ya set merked, it's a setup, I'm pisces, that's wavy\nNot Poseidon fuck the trident, I'm no pirate fuck a siren\nNever will sing still a lion, I'm pisces that's real rap\nWatch icy like greenland, you can't bump me and my will fam\nYou can't dip me in my teabag\nI day drink and I day dream, Disaronno on the rocks with some Bailey's, I day drink and I day dream\nTill the ground shakes and that's Haiti\nI may think 'cause I make green\nThat I'm tactical and this is factual, I'm actually out to change\nFrom the back roads to the nits yard from the bus stop to the mains, from the main road to the cash point tell them boy 'dere I'm ashamed\nWord\nWhat you saying little nigga? Made a couple tweets like you're raking in figures? Balenciagas all bait in your picture, clear lens glasses mate you're a winner\nWell, you're a little man, probably made 5 bills off a middleman\nYou're a silly man, I'm the main man, I see silly cash\nLook, Arj said we're up right now, Juss said we're up right now (word!)\nAnd if Rappz in the cut right now, you'll be getting shut right down (boy! boy!)\nListen, this ain't no Chinese dish, you'll be getting ducked right down (ay,ay)\nListen, you'll be getting ducked right down (ay)\nLook, I'll borrow man's flow, have a little fun with it (word)\nThen rinse that zed into forty something draws then hit the mains 'till I'm done with it\nLook, I'll take man's line, take man's shine, tell 'em 'rate my grind'\nRinse out the work boy I take my time running with some gunners that will take your life\nListen, running with the makarov, wave that once have you backing off\nIt's a heavy little pistol and it packs a lot\nMy G's hang like when Price killed Makarov\nSee it with me best you backing off 'cause my boys know chunks like Kakarot\nSee it with me best you backing off 'cause my boys know chunks like Karkarot\nStreets dangerous I ain't got a stunt double still I get ghost so you niggas like a stunt double\nNo mods on my dogs but so trouble breaking down bricks till I ain't seeing no rubble\nDon't talk much, they ain't calling us down most niggas vapourise got more heat than the sun\nNo wonder they say it's peak unless it's packing some guns\nWrigley's because you're about to get wrapped that's some gum Your on fire cause you think you're the earth's core\nMy attire, look at what I work for and I earn more 'till my fund's high\nTry'na take knives out like it's lunch time\nJust remember if [?] there's remedies to beef like no point like you just missed a penalty\nYou'll remember me when I get a semi g blast off your face and leave your donny in a cemetery\nAnd there's a lot of words make sure you remember 3\nKnow your size will be floating in the overseas\nI got more 16's than a last year's secondary\nOr 16 will leave your mixtape in the cemetery\nActing hard may end up in a tragedy\nYou boys are all fools on the road and that's a travesty\nWhen it comes to riding we down just like gravity\nStaples sticks [?]\nHeadshot have him down like epson, Lescott\nHeadshot, push hairlines back like Lescott\nBest not leg shot baseball to white socks the Red Sox\nEnd of conversation best of the Uk, today, gives a fuck what you say\nDon't give a fuck what you say", "year": "2015-09-17"}], "artist": "Dave"}