{"artist": "50 Cent", "songs": [{"album": "The Lost Tape", "image": "https://images.genius.com/ec16b41f3ee318d52d31bf3312db8b9c.1000x1000x1.jpg", "title": "Complicated", "lyrics": "[Intro]\nYeah!\n\n[Bridge]\nYou see a nigga soft? - My first instinct is to lean on him! (lean on him...)\nA weak nigga eatin' in my hood? Niggas'll put a beam on 'em! (beam on him...)\nThese niggas ain't s'pposed to be eatin', yo! - They sweet as Sweet'N Low\nI'll have 'em like shit was all good just a week ago. (\"Lights oooooooon! \")\n\n[Verse 1]\nLet these fake niggas get you in the mood for looove\nI'm back to get you in the mood for the Snub and gloooves\nDope fiend, morphine, cocaine dilemma;\nCrack come to cookin' up that; boy, I'm a chemist!\nFuck pill poppin'; a strap, I pop that!\nWatch the Henchman trial, see a rat rat on a rat!\nYou got a nice gimmick goin', you've been hot a few summers\nBut I got the kinda flow that'll stop World hunger\nSK, I got nothing but energy! (energy!)\nCall me Fifty, call me \"Ferrari The Remedy\"! (Remedy!)\n\"Hi\" again in case a hater don't remember me\nI happen to be what these rap niggas here pretend to be\nHittin' you won't be enough, you gotta finish me\nOr it's Ruger time, - the SR-9!\nFragments ricochet and ya ass go blind\nTimes up, ya fucked! - Gotta learn to duck. - Whassup?\n\n[Hook]\nDon't make me, - don't make me\nDon't make me! - seem so complicated\nDon't make me, - don't make me\nDon't make me - show you wassup. - Don't make me fuck you up!\n\n[Verse 2]\nListen! Any bitch on the milk box ain't missin'\nI mean some of these hoes runnin' round with Pippen\nI'm writin' reality, it sounds haaarsh;\nShyne tried to get at me, he say I'm waaashed!\nI ain't even fire back, the shit's squuaashed\nWhat kind of shit is that? - This only happens in rap!\nThese niggas so fake, it make my skin craaawl\nHope I ain't the last real nigga up over the waaall\nIce chunks in the chain, - weight spinnin'\nCream linen. - Bulges from the Benjamin's in 'em!\nTom Ford? - Oh, Looord!\nIf I ain't know better, I think a nigga push raaaw\nIt feels like it's never gon' stop\nA nigga so hot! - I may spend forever on top!\n\"Forever ever, ever\"? - Forever in the drop\nYou can't tell I got it on lock? - Bitch!\n\n[Hook]\nDon't make me, - don't make me\nDon't make me! - seem so complicated\nDon't make me, - don't make me\nDon't make me - show you wassup. - Don't make me fuck you up!", "year": "2012-06-26"}]}