{"songs": [{"image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg", "title": "Go Hard", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Intro: Nicki Minaj]\nYo, SB, I think it's my time\nYou know why? My tears have dried\nAnd I know that no weapon formed against me will prosper\nAnd I truly believe that my haters are my motivators\nYoung Money\n\n[Hook 1: Nicki Minaj]\nIf you could, you would get rid of me\nFuck you gone do when a bitch try to go hard?\nBut I won't let you get to me\nYou should already figure I'ma go hard\nIf you was as real as me you would never\nLet another girl sit in your throne\nI done put the choke hold on now\nThey screaming , \"Nicki leave me alone!\"\nI am, I'm still the one to beat\nAin't in a rush for mainstream, I am the streets\nI am getting it in until the end I gotta go\nGo, go hard!\n\n[Verse 1: Nicki Minaj]\nCarter called, lemme get the car key,you don't want it with the Harajuku Barbie\nKeep a marquee, everything sparkly (Man down!)\nHit him on the walkie-talkie\nHit 'em, hit em, knock-knock, tell 'em let me in, my name ring bells, bitch buzz me in (BZZZZ!)\nAnd I only stop for pedestrians (Oh!) Or a real, real bad lesbian\nHit 'em with the MAC, hit 'em with the TEC-nine, hit 'em with the Ruger, by the intersect sign\nHit 'em with a Tommy, so my niggas call me Pammy\nAnd I always keep the jammy, in the trunk or in the Lamby (O-WAH!)\nPut my whole borough on my back and I'm good-a\nI don't wanna hear what you would, what you could-a\nI represent all the girls that stood up (Uhn!)\nUsed to drink water with a little bit of sugar (Oh..)\nNow I'm in the gym with my squats and my sit-ups (One, two! \"Breathes\")\nDoing the scissor-leg, on the mat, with my foot up\nYoung black pin-up, all of my bitches did up\nNow I'm telling LA Reid, to step his bid up\nAnd I'm telling President Carter, he picked a winner,bitches like Nelly and Kelly, got a dilemma\nThese birds all fly south, in the winter\nFuck I look like? Chomping on a chicken dinner?\nYou can hate me, but why knock my hustle?\nI'ma be the queen, no matter how they shuffle\nSkirts with the ruffle, Louis on the duffle\nI'm a bad bitch, no muzzle\nSinging: (Aha-uh, aha-uh, aha-uh, ah-ah-ah-ah, aha-uh, aha-uh, aha-uh)\nNo muuuuz-zlllllle, hahahaha\nBitches is softer than Al Dente,cut from a different kente\nTell em I'm the ninja, Weezy is my Sensei\nSo I call him Splinter, faster than a sprinter\nGimme my chopsticks, I'll have these rap bitches for dinner\nThis is for my gentlemen, in button-ups, and khakis\nThis is for my nigga, Seven Up, in Castaki\nThis is for my niggas, wheelying them Kawasakis\nShout out, to the Vackee's, Saltfish Ackees\nKisses to my fans, unless I'm feeling, kinda cocky\nWinter Wonderland, is on my hand, it's kind of rocky\nI am Nicki, Minaj, or Lewinski\nPump's on the clutch, right hand, on the 6-speed\nWrite my own raps, I gotta go, I gotta get me (gotta get me)\n\n[Hook 2: Nicki Minaj]\nIf you could, you would get rid of me\nFuck you gone do when a bitch try to go hard?\nBut I won't let you get to me\nYou should already figure I'ma go hard\nIf you was as real as me\nYou would never let another girl sit in your throne\nI done put the choke hold on now\nThey screaming, \"Nicki leave me alone!\"\nI am, I will, I gots to win\nI’m still looking around for my competition\nI am getting it in until the end\nI gotta go, go, go\nGo hard!\n\n[Verse 2: Lil Wayne]\nFrom slap-and-cry you start to die, so I must go harder\nGotta make these bitches know me just like Bobby know water\nBetter yet, like Bubba know shrimp, but he don't say shit when the gun on his lip\nAnd I don't say shit, put the gun on my hip\nSo I don't say shit but the gun on my hip\nIf you don't wanna drown don't come on my ship\nCheck out how them bitches just run on my dick\nAnd me, I'm still nasty as a son of a bitch\nI still got that bitch cum on my lips\nIf you ain't got money, don't come on my strip\nAnd if you got money, don't come on my strip\nI wear that metal; no Olympic, but I can still make you tumble\nAnd flip\nYou fucking with me if you fucking with Nic\nThey ain't fucking with me, they ain't fucking with Nic\nYour girlfriend her decision is split 'cause she wanna fuck me and she wanna fuck Nic\nThey wonder if he be fucking Nic, as long as she be fucking rich\nThat's why I keep my luggage 'cause I swear y'alls a fucking trip\nYoung Money dungeon bitch, my swagger is punching bitch\nAnd I shoot like I'm from overseas, so call my gun \"Gunovich\"\nWeezy F Baby and the 'F' is for a bunch of shit\nRed drank, blue pill, white dust, yes, I love my country, bitch\n(Guitar)\n\n[Hook 3: Nicki Minaj]\nWish you could get rid of Young Money\nFuck you gone do when a bitch try to go hard?\nBut I won't let you get to me\nYou should already figure I'ma go hard\nIf you was as real as me you would never\nLet another girl sit in your throne\nI done put the choke hold on now\nThey screamin', \"Nicki leave me alone\"\nI am, I will, I gots to win\nI'm still lookin' around for my competition\nI am gettin' it in until the end\nI gotta go, go, go, go hard"}], "artist": "Nicki Minaj"}