{"artist": "Vanilla Ice", "songs": [{"title": "Detonator", "year": "2001-10-23", "lyrics": "[Hook - repeat 2X]\nLettin loose its the detonator setting off a time bomb\nRing the alarm\nI'm coming through with the wickedness\nInject the fluids of the sickest and watch as I kick this\n\n[Verse 1]\nI got a nation of millions to capture\nLyrical disaster pass the Ganja\nChoppin shit like a bladerunner\nHuntin down my opponents like the predator\nReady to start my search like the hunt for Red October 31st\nDay of my birth had much pain as an adolescent\nNatural stigmata, much drama when Mom's was stressin\nThey're on my trail like the bone collector\nSelect the sense from my sixth\nInject the fluid of the wickedness\nFuck the world! Is my motto\nI just can't understand why they point the finger\nWhen they see me doing my thing\nBitches swing when they see me pass on by\nIn the GS4\nWith the Cane plates bought from my last tour\nIts Amityville Horror on haters block\nFor those that copycat my tactics trying to make it to the top\nLike in the shining when Jack Nicholson got possessed with the wickedness\nI'm true to kicking this\n\n[Hook] - repeat 2X\n\n[Verse 2]\nLike Manson dismantling MC's who oppose a threat\nYou really don't want to get into some shit that you'll regret\nCause like Samuel I hold the whole place for negotiation\nIncarcerating anyone with the temptation trying to test my faith\nIs it safe to come out and play now? Is he gone?\nMan I don't understand what kind of high this dude is trippin on\nPure I-C-E with a twist of Vanilla thriller\nCaptivating souls like the body snatchers\nIts return of the living Caucasians\nOf psychopathic mind grabbing Asiatic demonic fanatics\nCausing havoc bringing the pain\nFlaming up like in Backdraft\nFeel the wrath of the lyrical combustion\nMany aren't true to what they're busting\n(From the depths)\nI'm coming through like the Hell Raiser\nIt's the end of days there's no escape from the detonator\n\n[Hook] - repeat 4X", "album": "Bi-Polar: Bomb Tha System", "image": "https://images.genius.com/a16d4d55e67b3b23d045b99ddb30bd72.220x217x1.jpg"}]}