{"artist": "50 Cent", "songs": [{"album": "Animal Ambition: An Untamed Desire To Win", "image": "https://images.genius.com/e38c9fce2a42f96648eb8787c9618ebe.1000x1000x1.jpg", "title": "Flip on You", "lyrics": "[Intro: 50 Cent]\n50, uh\nScHoolboy Q\nHaha\n\n[Hook: 50 Cent & ScHoolboy Q]\nSmiling...?\nNigga you gon' make me Flip On You!\nYou gon' make me flip this knife out do some shit to you!\nNigga you gon' make me Flip On You!\nNigga you gon' make me-you gon' make me Flip On You!\nNigga you gon' make me Flip On You!\nYou gon make me pull the strap out, do some shit to you!\nNigga you gon' make me Flip On You!\nNigga you ain't gon' be moving when this clip is through!\n\n[Verse 1: ScHoolboy Q]\nNigga, I'm the one that bought all them bitches out\nGot a G-A-T this MVP don't run his mouth, nigga\nYou gon' make me fill this clip for you\nYou gon' make me unload then reload 'em number 2\nNigga, I've been known to get them Oxys off\nI believe in God, but cross my heart this nine go off\nNigga, I'm from the Mecca of the Groove\nThe Hoover Crip, I grew up on Figg I had to dodge them County Blues\nLive my life behind the rules\nRunning from the cops, smash the rocks up under my shoes\nSpit out the eighth that once, hid in my face\nBounce spring over the gate, didn't get caught\nI guess my escape, nigga was fate\nI love the block and all the dogs that kept me safe\nNow it's, back to adding, points to the crime rate\nGet slumped in your drive way\nYou gon' make me hurt your boy\nYou gon' make me put that work in boy\nYou gon' make me get to murkin' boy\n\n[Hook]\n\n[Verse 2: 50 Cent]\nFocus on money, I'm in and out ass fast\nShe loosen up against the wall like a NASCAR crash\nGot a bunch of enemies, I count my friends on one hand\nGhetto philosphy, watch me, I got a hundred scams\nLike we could make a few dollars, that there a hundred grams\nI got a gift, I communicate with the afterlife\nApparently, your bitch ass ain't acting right\nNiggas killed your man, you ain't gon' get him back?\nWhat? You is tired out? Why you ain't get around to that?\nYou wander, I travel, I have a destination\nI'll be a street legend new version of Pappy Mason\nMy style? It'll never die, boy I'm immortal\nYou shoot me down, I'll get back up and keep coming for you\nMan on fire, hitman for hire\nThem niggas got happy they thought I was gon' retire\nNow they bitch giving me head, I'm the man, a man admires\nWhat's up?\n\n[Hook:]", "year": "2014-05-29"}]}