{"songs": [{"year": "2005-01-01", "image": "https://images.genius.com/ab0307598c77f1fc87d54d0fa6510fed.1000x1000x1.png", "title": "Keep The Bling", "album": "Triple Play: The EP", "lyrics": "[Intro: Rapper Big Pooh]\nCheah, uh, what? What?\nIt's like, I'm like, we like, hey, Khrysis\nIt's like, I'm like, we like\nI'm like, hey yo, Murs, I really miss you on this baby\n\n[Verse 1]\nWell it's Rapper, Pooh, chill type fellow\nLike to play the cut, observe, be mellow\nNiggas want to test the boy, they want to mess with boy\nI tell 'em \"Not tonight, my nigga, hello\"\nI got a chip on my shoulder bigger than a boulder\nI swear I told you or warned you son, I'm not the one!\nWhen you see me comin to the booth\nYour best bet, just reverse pivot and run\nTop dog, I'm a son of a who, wanna run with the crew?\nTold you we the illest there is\nJ-Lizzy always handle they biz, I got no time for these kids\nWho gonna pout cause I ain't speak to him\nWhen I talk, it sound Greek to them\nCause homie I don't protest\nSo fuck you, I ain't tryna be friends\nBetter yet, I'm the realest that come\nLike hel-i-um, on the rise, bout to be the one!\n\n[Hook]\nPeople wanna stop my shine\nAnd they wanna take what's mine\nEver since I came out the gate niggas\nSuck on the kid and they wonder why I hate niggas\nNiggas see me doing my thing\nThey wanna be a part of my team\nAnd they wonder why I stay on the low\nTo avoid fake niggas tryna steal my glow\n\n[Verse 2]\nAnd this is for anybody not checking for me\nOr the cats from the League, or the state of NC\nWe put it down like, or get around like\nShock G when he playin Humpty\nAnd now these chickens getting wet to hump me\nI guess I got to go and make \"Groupies Pt. 3\"\nSo pardon me for my foul demeanour\nEver since The Listening, Pooh's got a lot meaner\nI seen her, and she ain't pretty\nThe other side of the dream when it do get gritty\nRandom niggas wanna cling to your side, and family members arise\nWho you ain't heard from since five\nI wish, you can get a closer look in my eyes\nAnd realise this is pain brewin from the inside\nBut my pride won't let me quit\nAnd I'm the man that I am just because of it, biatch!\n\n[Hook]\n\n[Outro]\nWhat up, Khrysis in the house\nMy nigga, O-Dash, in the house\nMy man, Young Chris, in the house\nUncle Joc in this bitch and we turn it out\nMy man, Phonte, in the house\nMy nigga, 9th DUB, in the house\nMy people, Big Dho, in the house\nV. Poe in this bitch and we turn it out\nYeah, it's Sleepers nigga, young Khrysis on the boards\nYoung Guru, what up\nVon Pea, what up\nBrainchild, what up\nAll y'all niggas, what up\nNicolay, what up"}], "artist": "Rapper Big Pooh"}