{"artist": "Famous Dex", "songs": [{"year": "2018-03-16", "album": "Dex Meets Dexter", "image": "https://images.genius.com/3592857fbb6a4268632b044025878a33.1000x1000x1.jpg", "lyrics": "[Intro]\nYou know what I'm sayin'\nI just- that's just how I like to do it, know what I’m sayin' (Dexter)\nMy real name is Dexter, haha\nI got a lot of more diamonds, too\nI just got new diamonds, by the way\nUh, woah\nDexter, huh\n(Uh, yeah, uh, what?)\nBaby girl, what you doing, where your man? (Uh, where your man?)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan), ayy, huh\nYou know what I'm sayin'\nI ain't doin' no playin', baby, you dig? (Dexter)\nDexter (Dexter)\nOoh, huh, wait, what\n(Uh, yeah, uh, what?)\n\n[Chorus]\nBaby girl, what you doing, where your mans? (Uh, where your man?)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan), huh\nI ain't doin' no playin', these red bottoms, not no Vans\nAnd she tellin' all her friends, I might put 'em on the 'Gram, ayy (Yeah, Dexter)\nBaby girl, what you doing, where your mans? (Where your man, baby?)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan), huh\nI ain't doin' no playin', these red bottoms, not no Vans\nAnd she tellin' all her friends (Dexter), I might put 'em on the 'Gram (Uh, yeah, Dexter)\n\n[Verse 1]\nBaby girl, what you doing, what's your name? (Baby girl, what)\nI ain't playin' no games, see these diamonds in my chain? (See these diamonds in my chain)\nSmokin' Mary Jane, yeah, I took it to the brain\nAnd she fuckin' for the fame, so I fuck her in my Range, ooh (Skr, skr)\nGet that money to the top, never stop, ooh (Dexter)\nMixin' red with Wock, used to sell that boy rerock, ooh (Yeah, Dexter)\nBut I'm the man (Huh), Cuban diamonds dance, huh\nHad to fuck her friend, I might put it on the 'Gram\n\n[Chorus]\nBaby girl, what you doing, where your mans? (Where your)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan)\nI ain't doin' no playin', these red bottoms, not no Vans\nAnd she tellin' all her friends, I might put 'em on the 'Gram, ayy (Yeah, Dexter)\nBaby girl, what you doing, where your mans? (Where your man, baby?)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan)\nI ain't doin' no playin', these red bottoms, not no Vans\nAnd she tellin' all her friends, I might put 'em on the 'Gram (Uh, yeah, Dexter, yeah, what?)\n\n[Verse 2]\nBaby, wait (Huh), hop up in this Wraith (Skr)\nNo, this not a date, this a cruise, but don't debate, wait (Baby, what?)\nIt's gettin' late (Huh), think it's past eight (What)\nTook her to my place, baby ate me like some cake, wait (Huh)\nCall Jake (Jake), think I need an eighth (I think I need a eighth)\nDopey to the face, fuck, I need to take a break, wait (What)\nDon't be cool, money stupid blue (What)\nBoyfriend is a fool, I'm tryna make you comfortable\n\n[Chorus]\nBaby girl, what you doing, where your man? (Where your man?)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan)\nI ain't doin' no playin', these red bottoms, not no Vans\nAnd she tellin' all her friends, I might put 'em on the Gram, ayy (Yeah, Dexter)\nBaby girl, what you doing, where your man? (Where your mans, baby)\nI just popped a Xan, fifty thousand in Japan (Fifty thousand in Japan)\nI ain't doin' no playin', these red bottoms, not no Vans\nAnd she tellin' all her friends, I might put 'em on the Gram (Uh, yeah, Dexter)", "title": "JAPAN"}]}