{"songs": [{"image": "https://images.genius.com/e4f501fdfa584d29ce2e2706f76e3bf6.500x500x1.jpg", "title": "Talking That Shit", "album": "For All Seasons", "year": "2000-09-19", "lyrics": "I rap for all thug cliques bloods and crips\nNiggas who hate the cameras and loving the chips\nCaught in solitude old timers taught me how to move\nFort apache Queensbridge corner athlete\nAt 6-1 170 plus\nHennyed up walk around like I could never be touched\nThe whole clique be heavily truck\nPeep the style though\nTricking house notes and whips on these foul hoes\nWild as Alpo crack crusade rap bu-ffets\nA rare site like blacks in toupees\nKeep the Rollie shinin' true players know the science\nAnd those that's behind me be the Giants\nWhile y'all are Jets\nLast place niggas minor threats\nStay on the move till it's time to rest\nAin't it bugged?\nSo take it back to the time Rickle's with Doug\nI used to fiend to hear my shit in the club\nTorchin it for the less fortunate y'all need to watch me\nBitches start to swarm like the paparazzi\nPussy and money it made me cocky\nCelebrity getting no sleep\nDrinking heavily and live the life some will never see\n\n(chorus)\nI got a fist full of dollars (and you talking that shit)\nRich rap scholar (and you talking that shit)\nWe plan to live forever (don't be talking that shit)\nYou better get your shit together (stop talking that shit)\nIt's the top of the division (still talking that shit)\nKnock'em out position (cause we talking that shit)\nAnything can happen (so don't be talking that shit)\nNow watch me go platinum (just for talking that shit)\n\n1's for the money 2's for the weed spot\nUndercover cops follow me though they need not\nIt's like I'm Rick James\nCaught in the mix rockin' thick chains\nFrom hood to hood ain't shit changed\nSupplying hits\nThe type of cat hoes eye and dip\nTricking the same loot that some'll try and flip\nWhy attempt to go against the livest clique?\nFirm knowing you'll burn soon as the fire's lit\nAnd by the time it sets in I'll be a veteran\nAiming for the waistline hit you at the midsection\nTrick questions for game shows\nCall me arrogant too thugged out who do you blame though\nPayroll the whole clique salute the rich\nMoving out of the hood kids play where we used to piss\nNiggaas is humorous it's Nature who this?\nClaiming desperado aim shoot and they miss\nBut the fact is I'm giving back to the bridge\nFrom the athletes to the hoes and blow trafficers\nI'll do anything to be the man\nFrom competing with fam\nHold guns squeeze with either hand\nIt's like I'm ambidexterous somehow stress this\nTalking about blowing knowing the family's restless\nHow many ways can you correct this?\nSo with that I exit I guees it's up to the experts\n\n(chorus)"}], "artist": "Nature"}