{"artist": "Pras", "songs": [{"album": null, "title": "Another One Bites the Dust", "image": "https://images.genius.com/5f4f397c7311486910ee54514a7ad678.1000x1000x1.jpg", "lyrics": "[Freddy Mercury]\nAre you ready?! Hey!\nAre you ready for this?!\nAre you hangin' on the edge of your seat?!\n\n[Wyclef]\nI need a break beat!\n\n[Freddy Mercury]\nAre you ready?! Hey!\nAre you ready for this?!\nAre you hangin' on the edge of your seat?!\n\n[Wyclef]\nI need a break beat!\n\n[Freddy Mercury]\nAre you ready?! Hey!\nAre you ready for this?!\nAre you hangin' on the edge of your seat?!\n\n[Wyclef]\nI need a break beat!\n\n[Freddy Mercury]\nOutta the doorway, the bullets rip!!!\nRepeat to the sound of the beat! HEY!!!\n\n[Wyclef] (Freddy Mercury in parentheses) - Chorus\n\nYo...a-for the kids in the club that's ready to get bugged!\n(Another One Bites the Dust!)\nA-for the thugs with the burners, that wanna blast off!\n(Another One Bites the Dust!)\nAnd for the kids on the blocks, shootin' at the crooked cops, BLAOW!!\n(Another One Bites the Dust!)\n(And another one down, and another one down\nAnother One Bites the Dust, Hey!)\n\nWyclef, Dirty Cash, Young Free...Freddy, where you at?\n\n(Steve walks warily down the street with the brim pulled way down low)\n\nSome cat up in Brooklyn just got robbed with a Kangol!\n(*In tune with F. Mercury*)\n\n(Are you ready?! Hey!\nAre you ready for this?!\nAre you hangin' on the edge of your seat?!\nOut of the doorway, the bullets rip!!!\nRepeat to the sound of the beat! HEY!!!\n\nMy man got shot, and the block got hot!\n(Another One Bites the Dust!)\nYo, hey yo I hear more shots, it's like Fort Knox kid!\n(Another One Bites the Dust!)\n\nYo, Hold your breath...Hold your breath...Hold your breath...Yo, CHECK IT!!!\n(And another one down, and another down, Another One Bites The Dust!)\n\n[Wyclef - Verse One]\nIf you're a soldier at ease\nMy military style is known to murder Nazi's, Brooklyn to Germany (Come on)\nMy kamikaze will blow the U2, they hire Idi Amin in Timbuktu\nWhether you indo, or do the Voodoo\nYou can't foresee this unless I bring the previews, HEY!!! HEY!!!\nYo, it's the number one rappin' band! (Come on, come on)\nYo...This review, will be critically acclaimed\nLeave you in critical pain, clinically insane\nThe name Wyclef Jean, with a yes, yes y'all!\nBetter have a vest y'all! I'll blast, and bless y'all!\n\"F\"- y'all, the mark of the beast, the triple six\nTime running out, listen to the tick!\nIf you see what I saw, then you seen what I seen, If you know what I know\nYou know what I mean!\nCommanding officer of the Navy SEAL team\nOnce I give the orders, you feel the infrared beam....BLAOW!!!\n\n[Wyclef - Chorus]\nFor all you critics, sayin' \"another remake!\"\n(Another One Bites the Dust!)\nYo, if you know the deal, this is the master reel, kid! Ha Ha!\n(Another One Bites the Dust!)\nRight! Right! Freddy Mercury, where you at yo?!\n(And another one down, and another one down, Another One Bites the Dust!)\n(HOW DO YOU THINK I'M GONNA GET ALONG\nWITHOUT YOU WHEN YOU'RE GONE!!!)\nI need a break beat!\n\nYo if you're ready for the first of the month\nFor that welfare check, come on!\n(KICKED ME OUT ON MY OWN!!!) I need a break beat!\n\n(ARE YOU HAPPY?!! ARE YOU SATISFIED?!!!\nHOW LONG CAN YOU STAND THE HEAT!!!??) I need a break beat!\n\n(OUTTA THE DOORWAY, THE BULLETS RIPPA!!!\nTO THE SOUND OF THE BEAT!)\n\nYo! Bulletproof vests, like the wild wild west\n(Another One Bites the Dust!)\nYo! This is a stickup, now take off your Rolex!\n(Another One Bites the Dust!)\nYo! Dirty money, good money, yo it's all money-money!\n(Another One Bites the Dust!)\nYo! Dirty Cash! Dirty Cash! The adventures of Dirty Cash!\n(And another one down, and another one down, Another One Bites the Dust!)\n\n[Prakazrel \"Pras\"]\nYo, for the love for the cash I'll blast you in my path!!!\nKeep my eyes on the math, you cats don't know the half!\nAs far as I'm concerned, you cats can burn in flames\nThis ain't no game!!! I'm-a start callin' names!\nSo come get me, if you know the one-fifty\nA million Refugees ready to bust wit' me!\nBloody, filthy, in this rap shhh---!\nYou gonna have to kill me, since you can't beat me!!!\nPras! Dirty! Cash! You're the greedy!\nBelieve me! God'll let me fly, like R. Kelly!\nBite another dust with my man Freddy Mercury!\nWhat height nineties got ya cash, wannabe CRAZY!!!\n\n[Free]\nPractically, I tactically destroy\nDeploy more decoys than a presidential convoy\nMy whole envoy stay camouflaged out\nAnd when I walk the street, I take the Refugee route\nThis one go out to all my thugs in the borough\nSo just stay thorough, like Kilamanjaro\nSplit it with an arrow, my girl platoon roll\nOutta control, the female mandingos!\nFree! I evolve from the egg of a seminarian\nDon't go down, 'cause I'm a vegetarian!\nAnd when I bust, it ain't in God we trust\nAnd if you bring a gun, you better bring a black tusk!\n\n[Wyclef - Chorus]\nShe looked into my eyes and said F-B-I!!!\n(Another One Bites the Dust!)\n\nShe said she loved me, she was a spy who lied!!!\n(Another One Bites the Dust!) Right!\n\nI could relate...could you relate?\n(Another One Bites the Dust!)\n\nJerry \"Wonder\", The Product (Male singer from The Product, keys a vocal note)\n{Don't you know we coming for yo?!}\nYo, Canibus, John Forte', (Another One Bites the Dust!)\nYo, Dirty Cash, and baby Free! (Another One Bites the Dust!)\nWyclef Jean, Freddy Mercury! Ha-ha! I'm out baby!\n(And another one down, and another one down, another one bites the dust!)\n\nN A V Y S E A L S!!!!!!!!\n\n(Another One Bites the Dust!)\n\n(Another One Bites the Dust!)\n\n(Another One Bites the Dust!)", "year": null}]}