{"artist": "Bobby Creekwater", "songs": [{"album": "Eminem Presents: The Re-Up", "title": "There He Is", "year": "2006-12-04", "lyrics": "[Intro: Bobby Creekwater]\nYesssss, ladies and gentlemen (yeah, man)\nBobby Creekwater, today's host\nToday's narrator, yeah\n(We do this shit every year around this time)\nToday's what-the-fuck-ever you wanna call it\nBut I need y'all to sit back, and listen\nListen, man (fuck what you write man, just go get 'em)\n\n[Verse One]\nAn executive mindframe, fuck tryin' to rap\nNiggas represent a corner, I refined the map\nArtesian water, this is flow untapped\nAnd rep for 'em like Mike on playoff night; that's if the payoff right\nThe Dream Team, Bobby Creek, Em, 50 and them\nWe run the city like Diddy and them\nThe opposition we just pityin' them, it's no chance\nPut you niggas in the Special Olympics, it's no dance\nI'm nice like a meal twice, nigga, no grands\nGet them bitches out they pants—I did it with no hands\nSee, one thing's for sure, I'm pure uncut\nPimpin', you can either stay down or get gunned up\nMr. Night Life, I can give you niggas sun up\nI just get an order, let my niggas pick the gun up\nThat's one up on ya, nigga, wake yo' punk ass up\nThis is ammonia, fuck your face up\nBitches won't even telephone ya\nI can space age pimpin, a pocket full of stone ya\nYa dig? Take the world over, that's the gig\nSell enough units, have Paul and Jimmy dancin' the jig\nRoll the Maserati through the city, me and Riggs\nBumpin' Obie Trice, shoot a bird at the pigs\nEver since a nigga got rich\nLife is still a bitch but she a high-class bitch\nI just wanna fuck with me a high-class bitch\nNigga, pitch that on some eyeglass shit\nSee I classic, enough to get the mics back right\nAnd I'm a fan of record sales, I don't like that hype\nI'm here to end it\n\n[Chorus]\nOh Lord, that nigga mean, ain't he? Yeah\nGoddamn, that nigga clean, ain't he? Yeah\nSee, he a greedy baby\nBut some people tend to call him the return of Shady\nThere he is - goddamn that nigga clean, ain't he? Yeah\nYea, oh Lord, that nigga mean, ain't he? Yeah\nSee, he a greedy baby\nBut some people tend to call him the return of Shady\nBobby Creek, Bobby Creek...\n\n[Verse Two]\nYeah, yeah\nNice like Mike right, you niggas soft as night lights\nDiamond's a tall order I'm just tryin' to get the hype right\nI'm throwed off, so hard, so soft, sold out\nBought the Coupe a color of nice weather and rolled out\nI can't hold out, hot like a fish fry\nWho the fuck is this guy? The ruler on the disc I\nHit you in your soup coolers, I'm in the Coupe cooler\nThan pigskin men, base runners, and hoop shooters\nA loose screw, band money like The Legendary Roots Crew\nThis is just the shit that I am used to\nOh nah, I don't bust a chopper but I used to\nNow I put the word out - I'm sure you niggas heard about\nYoung boss, old money, old school new paint\nBall knowin' you can't, give a fuck what you think\nMember of the mighty Shady Records, nigga, you ain't\nThink you fuckin' with me then double whatever you drink\nYou can't fathom what the bitches throwin' at him\nCouple niggas hatin' on him but the fans waitin' on him\nLike a, PlayStation 3, money for your advance\nMy vacation fee, ain't no use in hatin' me, nigga\nAnd don't shit-talk pimp, I'd rather flush\nAnyone with big enough nuts to come and fuck with us\nI bust but keep in mind, pressure bust pipes\nAnd you niggas wouldn't bust a grape in a fruit fight\nWhat the fuck? (yeah)\n\n[Chorus]\nOh Lord, that nigga mean, ain't he? Yeah\nGoddamn, that nigga clean, ain't he? Yeah\nSee, he a greedy baby\nBut some people tend to call him the return of Shady\nThere he is - goddamn, that nigga clean, ain't he? Yeah\nYea, oh Lord, that nigga mean, ain't he? Yeah\nSee, he a greedy baby\nBut some people tend to call him the return of Shady\nBobby Creek, Bobby Creek...", "image": "https://images.genius.com/86576cfe4dc7027bc0fed03da7e37e9a.900x900x1.jpg"}]}