{"artist": "Casey Veggies", "songs": [{"title": "Nobody", "album": "Customized Greatly Vol. 3", "year": "2012-04-09", "image": "https://images.genius.com/28eb51ba21c0b473fc0f5f74d662ccb2.500x500x1.jpg", "lyrics": "Verse 1/\n\nYo, them same stuck up girls gon' be ugly when they grow up\nI spent four years grinding in hopes that Ima blow up\nAnd remained humble. Get a new chain but stay with the same hustle\nYou say you love me but I can’t trust you. Man this game ugly\nI stay high just tryna stay above it\nI’m in the streets just tryna stay in touch with\nEverything that I grew up with. That’s how I make my money\nYoung nigga's on the rise and you can’t take it from me\nAnd I put that on me, keep my circle nice and small I gotta couple homies\nThat’s on my day to day. I know a lot of people but I just stay away\nCause ain’t none of them gon' get me paid\nI try to talk to god I’m tryna pray, but I just don’t know what to say\nIn life, you just gotta find your way\nWatch your back nigga and guard yo face, in hopes that one day...\n\n\n[Hook]\nLife changes, things don't stay the same\nLife changes, things don't stay the same\nLife changes, things don't stay the same\nLife changes, Life changes\n\nVerse 2/\nIt’s so hard to keep a clear mind dealing with life’s field mines\nShit blow up once you think it’s all fine\nBut Ima keep on trying, like my grandma did\nBeen in that nursing home for ten long years\nBut she forever gone stay right here, that’s in my heart\nI get attached to everything I start\nAnd resort to action when it’s time to win, cause I don’t wanna end\nGirl, I don’t want nothing if I can’t have it all\nNot insecure, that’s just how I was taught\nYou moving on? That’s what I never thought\nIn this life I just need some love, only something true\nI guess that’s why I’m tryna fuck with you. Don’t wanna be alone\nDon’t wanna argue just wanna get along\nNot in the mood, I don’t answer phones\nJust need some time i’m tryna free my dome\nGirl come over let’s get it on, and watch me never stop\nTo make up for all them other times...\n\n[Hook]\nLife changes, things don't stay the same\nLife changes, things don't stay the same\nLife changes, things don't stay the same\nLife changes, Life changes, Life changes\nLife"}]}