{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/42281596b18a280da263b6c5dbe8f23e.540x540x1.jpg", "year": "2013-03-12", "album": "Trunk Muzik Returns", "lyrics": "[Verse 1: Yelawolf]\nThere must’ve been something about my careless upbringing\nThat got me into so much trouble at school and shit\nCould’ve been the drugs at home, maybe I was just a foolish kid\nI soaked up everything that I could from the people that stayed at my house\nBiker gangs, waking up to people that I didn’t know crashed out on my couch\nReally didn’t know at the time, that I didn’t have a normal life\nAnd when I took that attitude to a new neighborhood I had to learn to fight\nAnd respect from the kids like me was immediately minority\nI guess it must’ve been that “I don’t give a fuck about none of y’all” shit that sorted me\nOut from the rest of the haves, and the have-nots took me in as kin\nOutcast, poor white trash, and that’s where I learned to make my friends\nBut I’ve always been a weirdo to my homie cause I wanted to go be an entertainer\nHe was selling rock out his window\nI was the rapper and my best friend was a...\n\n[Hook: Yelawolf]\nGangster, gangster, gangster\nAye, what we gettin’ into tonight?\nStep into the ride, lookin’ through the eyes of a motherfuckin’\nGangster, gangster\nSo, am I gonna risk my life, to ride?\nYou're motherfuckin’ right\nWhen your best friend is a gangster\n\n[Verse 2: A$AP Rocky]\nDanger, we pistol banging, another homicide\nRollin’ in the Chevy, motherfucker, ride or die\nRidin’ in the scraper low, it shake from side to side\nIf the paper low, his burner on his side, murder on his mind\nOnly 21 and still he strives to stay alive\nFeelin’ paranoia, too much pride to stay inside\nAin’t no time to wait around, find the safest place to hide\nDrop a chopper, lay you down, it’s the fastest way to God\nGrandmama tell him “Son, you gotta pray to God”\nGamble with your life and then you gotta pay the price\nPlace your bet and roll the die, thank the Lord and pray to Christ\n‘Cause you almost spent your life livin’ as a young motherfuckin’…\n\n[Hook]\n\n[Verse 3: Big Henry]\nEver look in the eyes of a G?\nCold, cold world that’s what you gon’ see\nWhen the cash slow up, masks go on\nChevy slow up, that’s what it’s gon’ be\nGame so hot that a nigga might melt\nOG stripes up under my belt\nDo it by myself, I don’t need no help\n5-9 Hoover, nigga, hat to the left\nBig Henry, bitch – nobody else\nTen toes down, march nigga, step!\nIf I pop that trunk I’mma pop me a chump\nLeave a nigga slumped with his chin in his chest\nBang, bang, bang, nigga, real G shit\nHalf of these rappers ain’t live like this\nOn behalf of the streets I live like this\nNobody really knows why it is like this\nWhen it comes to a buck, I’m a mathematician\nGo and hit the block like a car collision\nNiggas talkin’ money, you ain’t starvin’, is ya?\nYou start to lose weight like there's poison in ya\nSo go and write it down, my nigga, pardon a nigga\nFuck around and I'mma put a part in a nigga\nApplaud a nigga, straight from the block\nLord, my nigga, you know the game don’t stop, that’s…\n\n[Hook]", "title": "Gangster"}]}