{"songs": [{"image": "https://images.genius.com/727e047579481405310e18c83d10416c.1000x1000x1.jpg", "year": "2012-10-09", "title": "Crazy", "album": "Napalm", "lyrics": "[Demrick]\nWe too hungry so most games we don't play\nGet lifted like toupees 'til next Tuesday\nDick-riders are gay, known to go both ways\nYeah you lovin my shit, ohh you don't say\nThis a new meanin of dead right\nPut 'em to bed with a lead pipe, lights out, good night\nThis ain't a song that the choir sing\nThis is aviation, deader nation, devastatin e'rything\nWipe the canvas clean, life ain't a fantasy\nI get lit like kerosene and people start panicking\nAnd this the natural laws of attraction\nMy words cut through like saws and axes\nI bring the flames like the son of Sampson\nMy crew (Bring the Pain) like Wu-Tang Clan did\nCouldn't spend a day in these shoes I stand in\nTake off, no landin, the world gon' crash in\n\n[Chorus: Jelly Roll]\nHennessy and kush deadly combination\nThe only way I'm feelin safe is if I got my gun\nBodies disappearin on the daily baby\nI keep tellin myself I don't wanna die\nSo I smoke green, stay high as a motherfucker\nNo games, you be gone tryin to run up on us\nPeople die for less on the strength of nothin\nIf you ain't got your gun hidden in a close stash you crazy!\n\n[Jelly Roll] Ohh you crazy\n\n[Interlude]\nYeah, yeah we know about that new shit they got jumpin off man\nY'all better get aboard that shit\nBig Tray Deee in this motherfucker\nGive it up for my nigga\nEastside up homie\n\n[Xzibit]\nWhat you know about dyin over dumb shit? (DAMN!)\nWhat you know about runnin from the government?\nMy brigade's self-made from the ground up\nRound up the renegades, time to tear the town up\nFounding fathers arrivin in Impalas with the brains blew back\nAll dressed in black\nReact with gauges and Macs, way back when I was droppin off packs\nStreet money stack, Wall Street collapse\nI'm like, hold my calls, personally involved\nYou touch one, you fuckin with us all, it's the code\nBetter read the graffiti, we the shit, 'round here\nLeft in itty-bitty pieces in the ground somewhere\nWe the gritty shitty people fuck around, rounds clear (rounds clear)\nMan down (man down) disappear\nFor 15 to 25 years so you got your GUN\n{\"So when I'm on the streets I walk around with a bigger one!\"}\nYEAH!\n\n[Chorus]\nHennessy and kush deadly combination\nThe only way I'm feelin safe is if I got my gun\nBodies disappearin on the daily baby\nI keep tellin myself I don't wanna die\nSo I smoke green, stay high as a motherfucker\nNo games, you be gone tryin to run up on us\nPeople die for less on the strength of nothin\nIf you ain't got your gun hidden in a close stash you crazy!\n\n[B-Real]\nYou cannot trace my movements, keepin you busters silent\nI got an ill temper, disposition violent\nI have hallucinations, in need of medication\nI'm unstable like a mental patient\nI need some conversation, because I'm losin focus\nMy concentration is broken, fuck it, I'm hopeless\nI got my own agenda, breakin your head open\nSo I can see what you're thinkin, it's so thought-provokin\nYeah I'm fuckin crazy, they call me lunatic\nThe deadly viper, pied piper, and I'm soon to spit\nI got a lot of anger, pent-up aggression dude\nYou better watch who you askin the wrong question to\nYou need a lesson too, here's a confession dude\nA live stream us reckon you for a session view\nWe got a million lurkers, we overran the servers\nWe popped the burners then the preacher, the coffin, the service\n\n[Chorus]\nHennessy and kush deadly combination\nThe only way I'm feelin safe is if I got my gun\nBodies disappearin on the daily baby\nI keep tellin myself I don't wanna die\nSo I smoke green, stay high as a motherfucker\nNo games, you be gone tryin to run up on us\nPeople die for less on the strength of nothin\nIf you ain't got your gun hidden in a close stash you crazy!\n\n[Outro: Jelly Roll]\nOhh you crazy\nCrazy!\nOhh you crazy"}], "artist": "Xzibit"}