{"artist": "Philthy Rich", "songs": [{"album": "Neighborhood Supastar 4", "title": "Known Better", "image": "https://images.genius.com/f2cf1cbaa734cee0067e08fa364c0054.1000x1000x1.jpg", "lyrics": "[Intro]\nJune onna beat, June onna beat\n\n[Chorus: Trapboy Freddy]\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grass but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nIt's Philthy nigga\nCouldn't cut grass but I could cut me a nik', (uh huh)\nKnew times was hard when I had to pay rent, (look)\nShoulda known better yeah way back then, (look)\n\n[Verse 1: Philthy Rich]\nShoulda known better not to trust that bitch (that bitch)\nTell she a freak how she suck that dick (that dick)\nI was in the kitchen when I bust that brick (that brick)\nI was at the jeweler when I bust my wrist (my wrist)\nMomma always told me that them niggas wasn't shit (wasn't shit)\nBut I was hard-headed, didn't listen to shit (listen to shit)\nWhen you get money closest niggas to you switch (switch)\nS-14 bricks, Su off mitts (off mitts)\nWhat the next man eat don't make me shit (shit)\nEvery jeweler in the game wanna make my shit (my shit)\nEvery pimp in the game wanna knock my bitch (my bitch)\nWhen you got your money up you can talk like this (like this)\nI made all the dope boys wanna be pimps (be pimps)\nBishop was a dope by before he was a pimp (was a pimp)\nYou hang wit' all broke boys you'll be the tent (be the tent)\nPussy nigga insecure in his own skin (own skin)\nBitch should only wear red bottoms when she on her period (on her period)\nFeet in pussy bleeding man this shit serious (serious)\nYoung fly rich nigga no need for a mirror (for a mirror)\nHow I'm getting' money got these pussy niggas curious (niggas curious)\nMe and that nigga been locked since kids (since kids)\nWhen he was locked up I took care of his kids (his kids)\nThree way calls on the phone wit' his bitch (his bitch)\nBut when he hung up she was tryna suck dick (suck dick)\n\n[Chorus: Trapboy Freddy]\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grass but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grass but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\n\n[Verse 2: Trapboy Freddy]\nShoulda known better yeah way back then\nWe was breakin' down bigs, we was just some little kids\nJumped off the porch young at a early age\nEverybody trappin' out the 'partment no cave\nCouldn't make A's but could make me a big\nI knew I couldn't drive, I just wanted that Benz\nDon't make money then it don't make sense\nI'm tryna make money I ain't makin' no friends\nMomma told me then I'd have fake friends\nGuess back then it just didn't make sense\nKnew I wanted a Rover I ain't know I was gon' get it\nBust down a brick and I bought if off fifty's\n'Member them nights that we slept in them trenches ('member?)\n'Member them night that we busted them niggas ('member?)\n'Member them night we had worked in our dentals\n'Member that brick that we bust down to nickels\nBeen two years since they popped my nigga\nBeen two years since I called my sister\nRemember when we was broke so we took them cookies\nMade it to the 'partments and we started back joogin'\nSame clothes all month, trap house hustlin'\nSam robbed his patna so sometime he don't trust him\nShe know I'm a dog but she say that she love me\nI done so much shit sometimes I don't trust me\n\n[Chorus: Trapboy Freddy]\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grass but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big (yeah)\nCouldn't cut grass but I could cut me a nik' (yeah)\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\n\n[Verse 3: Mozzy]\nThat was my nigga since we was like eleven\nGleek 32 only hold like seven\nTold on the homie nigga still gotta eleven\nRat tendencies nigga shoulda known better\nShout out to the bitches that ain't never send a letter\n'Fore I went down, wasn't me and you together? Huh?\nBitches catted off on a fella (I said them bitches catted off on a fella)\nShoulda know better but a nigga do now\nDisloyalty get a nigga blew down\nPut some money on his head when I run through these pounds (yeah)\nThey gon' throw a whole lot of rounds (yeah)\nI be ducked off out of town\nTryna make somethin' shake\nThirty thou' on the play\nAnd if the homey get hit then it's back to the hood\n'Cause I know bruh countin' on the gang\nI ain't change up niggas know what I bang\nI don't do this shit for the fame\nI was countin' on the yeak when I landed in ya city\nNigga you ain't never bring me no thang (no than)\nAnd I still showed love to the J's (uh huh)\nAyne want a dime for the 8\nYeah I ain't even got it, here go a couple dollas\nAyne I'm just tryna make sure that you straight\n\n[Chorus: Trapboy Freddy]\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grass but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grass but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\n\n[Verse 4: Yella Beezy]\nAyy Yella mayne\nThrough all this here, I'm the same ol' Yella\nSame ol' chain, wit' the same ol' bezel\nSome of these niggas on the same ol' level\nFuck the same ol' hoes on the same ol' schedule\nYella jumped out the womb bitch a young go getta\nFuckin' with the same nigga you must don't want no betta\nYou niggas ain't tryna hustle must don't want no chedda\nAin't a hood I can't go nigga don't know Yella\nSaid I shoulda known better, to fuck that bitch\nAll the ho wanna do now is suck my dick\nLove the way the big face Rolly hug my wrist\nMy nigga just got locked, I told cuz don't trip\nBoy just sit still, I told cuz don't switch\nSaid it's just a little time, say cuz don't flip\nDamn near broke my heart to say cuz ain't stiff\nMy nigga always used to say, aye cuz ain't built\nNigga bumpin' (?) gone boss\nGet ya ass knocked out, boy I'm a top boss\nNigga hold one knee nigga just like top dog\nTryna get my rocks off, bitch blew my socks off\nMet her out in rockwall, call the bitch lockjaw\nNigga we got boil, nigga we got soft\nBoy I been havin' paper way before I popped off\nActin too gangsta nigga cut a Nike top off\n\n[Chorus: Trapboy Freddy]\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grams but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then\nShoulda known better not to hit that lick\nShoulda known better not to hit that bitch\nMe and that nigga been lock since kids\nAin't that a bitch? Why the fuck did he switch?\nCouldn't play ball but I could cook me a big\nCouldn't cut grams but I could cut me a nik'\nKnew times was hard when I had to pay rent\nShoulda known better yeah way back then", "year": "2017-06-19"}]}