{"songs": [{"lyrics": "[Intro]\n\nAnd now...\nComing to the stage...\n\n[Verse 1]\n\nSmooth but rugged display and grate the face up\nLike Big Daddy Kane, shirt is getting laced up\nPasty make-up laying in a box wet\nMe and my people stick together like a box set\nMake your bitch lift her leg up like a Rockette\nDive in, get my cock wet\nDive out, for a hot sec\nDo a spinning back flip off the top step (Yea, we doing wild gymnastics)\nGrip oak wheel, Ten stacks make the coach squeal\nLaid back eating smoked veal\nGot a young gun, all he do is hold steel\nAll these hoes want to suck me because I'm so real\nAnd I'm so ill\nLay with hoes from Brazil\nThe wine spill on the Bonneville\nNo chain and my mama real\nI'm folding your chest, I'm boldly to bless\nA class of my own and now a days I'm speaking Spanish in Rome\nMy bitches gorgeous like a classical poem\nDon't get caught up in the tactical zone\nLeave you sleeping with the Mackerel\n\n[Hook]\n\nChampagne spilling down the glass because we made it\nI know you muthafuckas hate it\nDon't judge me bitch because I faded\nI'm only trying to fuck some hoes\n\n[Verse 2]\n\nBack to me, you only half a G\nI'm in Miami fucking hoes with Mark Anthony\nLobster Cantonese\nShe had a pussy that was fishy like the Bering Sea (you know I ate it though)\nWhen you see me, star fillet the meat\nMove so much work got A.D.D\nAnd it's ABC, shifting BMW from 1983\nWith a Haitian freak\n\n[Big Body Bes Interlude]\n\nHallelujah\nIt's me Big muthafuckin' Body, man\nI'm out here in muthafuckin' Cali... the state\nAnd I'm out here living wild and I got a situation, man\nI's want muthafuckas to stop coming up to me talking about\n\"I rap, yo. I rap, Big Body, yo. I rap.\"\nMuthafucka, go wrap the belt around your neck, man (Muthafucka)\nGo fuck your father (Suffocate your dick)\n\n[Verse 3]\n\nBong Bong, muthafucka analyze the resume\nBabble on has never been a friendly way\nI'm knocking 'em out and then I'm running\nTo the mountains\nCrib with the fountain, that's where my son is\nHe getting head laying in his bed\nIn a robe, turkey in the stove\nRaise your hand if you trying to talk, the llama spark\nFind your father's testicles out in Highland park\n\n[Hook]\n\nChampagne spilling down the glass because we made it\nI know you muthafuckas hate it\nDon't judge me bitch because I faded\nI'm only trying to fuck some hoes", "title": "Drug & Cheese On a Roll Mix", "album": "Rare Chandeliers ", "image": "https://images.genius.com/20bdbefccfb30aac00800f75ffc6462d.507x507x1.jpg", "year": "2012-12-20"}], "artist": "Action Bronson"}