{"songs": [{"year": "2011-01-01", "image": "https://images.genius.com/ce9a0317f67940b823d8370135d930af.500x500x1.jpg", "title": "Are You Ready", "album": "Dirty Pretty Things", "lyrics": "[Intro]\nAre you ready?\nI wanna know is everybody ready?\n(YEAH!!)\nAlright, here we go!\n\n[Intro: Torae]\nHey yo, Pooh, nigga\nYou already know what it is, dunn\nWord up (Yeah!!)\nFuck around and turn my hat backwards or something, nahmean?\nWorkin my Chapstick, nigga\n\n[Verse One: Torae]\nUh, here we go again, back to that goin in'\nPen the repeat offender, you rap niggas know what it IS!\n\n[Rapper Big Pooh]\nOr what it was, no buzz\nIt's a million motherfuckers working just like us\n\n[Torae]\nBut they don't spit it like us, makin shit like us\nLot of copycat rappers couldn't get it like us\n\n[Rapper Big Pooh]\nAnd we don't speak like y'all, we ain't weak like y'all\nTake them training wheels off and you bound to fall\nWe down by law, y'all CB4\n\n[Torae]\nBut they don't see these bars, lot of weaklings, god\nWhenever we record, niggas see we raw\nThey know T-T raw, anything he score\nLike MJ in the fall, this shit bang in the Porsche\nMy shit, bang on the porch, the more awesome record\nIn this side of the board, this is how I destroy\nYou a coward to +Crooked I+ and any +House+ I'ma +Slaughter+\n\n[Scratch Hoook]\n\"Y'all don't want no war with us\" - Nas\n\"Y'all niggas better stop\" - Big L\n\"Stop fronting\" \"The wait is over\" \"We on the rise\"\n\"We keeps it real inside the battlefield\" - Kool G. Rap\n\"Y'all don't want no war with us\" - Nas\n\"Y'all niggas better stop frontin\" - Big L\n\"The wait is over\" \"We on the rise\"\n\"Ain't no shame in my game, we do our thing son\" - Kool G. Rap\n\n[Verse Two: Rapper Big Pooh]\nWe back, here we go again, back to the show again\nNiggas get ya levee tight, Coney Island flowin in\n\n[Torae]\nVA to Cak-a-lak, prize in the Cracker Jack\n+He-Man+ no Battle-Cat, dawg where the battles at?\n\n[Rapper Big Pooh]\nNiggas just chitty-chat, waitin for a piggy back\nInternet, blogger type, soft as a kitty cat\n\n[Torae]\nBluffin like it's pitty-pat, cards in the deck\nWe the gods of the internet, the stars of cassette\nDon't get scarred off your threats\n\n[Rapper Big Pooh]\nNaw, back to bih'ness, homie\nYou see the bih'ness, homie? This is God-given\nSelf-driven, riveting pictures I paint\nHow you livin? Witnessing something you ain't\nNo cubicle, shine more suitable\nRhyme more reputable, losers be delusional\nThe suspect's usual, egos get bruise and know\nCareers get a funeral, leave 'em looking stupid so..\nAre you ready?\n\n[Scratch Hook]"}], "artist": "Rapper Big Pooh"}