{"artist": "50 Cent", "songs": [{"album": "G-Unit Radio Part 22 - HipHop Is Dead", "image": "https://images.genius.com/59d653d7d8c9da7b5638d73a58b64adf.500x500x1.jpg", "title": "Mind Sex", "lyrics": "[Intro]\nIts 50, Yeah\nIt's time I laid back on Em'\nReal smooth yeah\n\n[Chorus: x2]\nI'm not down for the mind sex\nI'm tryin' to get some pussy and jet\nYou can burn an in-scent\nLay back and relax\nFeel the good vibrations\nAfter me fuck I don't a conversation\n\n[Verse 1]\nPardon me love that ass lookin' right\nWhat you doin' tonight\nYou should stop aight\nMy body language say it all\nSo we ain't gotta talk\nI got fly spot southside queens New York\nNow you know I wanna fuck\nNo doubt but I wanna try a different route\nDon't say a word\nUn-button your blouse\nPull that skirt down\nCome to my bed time to put it down\n\n[Chorus: x2]\nI'm not down for the mind sex\nI'm tryin' to get some pussy and jet\nYou can burn an in-scent\nLay back and relax\nFeel the good vibrations\nAfter we fuck I don't a conversation\n\n[Verse 2]\nNew princess show me your interests\nWait let me guess you like my ghetto poetry\nHere's a little something I wrote down\nIn case you ever came around\nYou hear that fly shit\nYou know it's me\nPosition after position\nI'll exploit your body\nLike an instructor for yoga or advanced Pilates\nYour working up a sweat\nYou like it how I like it?\nGo ahead go up and down\nI like it when you ride it\n\n[Chorus: x2]\nI'm not down for the mind sex\nI'm tryin' to get some pussy and jet\nYou can burn an in-scent\nLay back and relax\nFeel the good vibrations\nAfter we fuck I don't a conversation\n\n[Outro]\nMotherfuckin' right I don't want no conversation\nTalk to a bitch try to explain to her why she should give me some boyzes and the bitch slow. First she know then she don't know if she gonna give some boyzes, she slow. So I ain't supposed to be hangin' out with no mentally retarded ho, you know shit like that, you know what I'm sayin'? It's the kid man, It's the 50 man. Come on man, I'm in Taiwan man,type A, Thailand\nI got the Asian hoes man, all together man. Niggas don't even believe in me man. I gotta put this shit on tape man, 4 bitches at the same time man, there's a difference when you just got 4 bitches, there just is. You or when you got 4 bitches that are just dead, really get into it, start being there for themselves, you know what I mean? I talk A bitch into anything man. You gotta listen o me man, I'm good at this man, yous don't be listenin' man. That's why you ain't got no money man. Put your hands in your pockets right now. You know why you ain't got no money? Cause you don't listen to 50. Stupid nigga, I'm tellin' ya to pay attention man. Watch me man, hunh? Niggas know what i'm sayin'. I'm off the same curb you are. Why I got a hundred mill' and you ain't got nuttin', huh?", "year": null}]}