{"artist": "Bas", "songs": [{"lyrics": "(Verse)\nShe hit that pole in my basement, she rollin', she wasted\nShe face bout an eighth of that space shit and went ape shit\nDon’t pace it, don’t chase it\nThat's straight lick – it burn slow\nShe role play my teacher and I can’t wait to learn nigga\nI role play big turn up, Obey, that’s G shit\nWe smoking Js of that juicy fruit, that Juicy J, that 3-6\nWhite T’s, first class flights and Nike kicks, believe this\nWaves on, tsunami, she likely get seasick\nI red tail that fly boy, Michael Phelp in the cloud, boy\nIn the sea of that loud boy, altitude is all altoids\nFresh bitch like breath mints\nWhilin up in the section\nThe monkey’s roll and that kush to go\nBottles up in this section\n\n(Hook)\nShorty baby, you the chosen one for now\nHold a nigga down, hold a nigga down\nShorty baby, you the chosen one for now\nHold a nigga down, hold a nigga down\n\n(Verse)\nShe dolled up, I’m soda\nRed cup that I hold up\nBreak the milk but wait, hold up\nFuck I do with my roll up\nI want this shit and I want you too\nI know this shit sound cynical\nBut can I skip the skit and get into you?\nBaby can you strip and get in the pool?\nLife is so yummy when your problems taste like honey\nEvery day so sunny when I’m pound cakin this money\n2 hands on full grip, take this shit to the bank\nShe said boy you takin my breath away\nGirl get a oxygen tank\nDamn, caught you fallin but my feet were out of bounds\nSooner or later you gon reach some solid ground\nWho the fuck said chilvery dead?\nGirl, why you quit givin me head?\nMakin me call Lewinski\nYou fuckin up like Hilary did\n\n(Hook)\nShorty baby, you the chosen one for now\nHold a nigga down, hold a nigga down\nShorty baby, you the chosen one for now\nHold a nigga down, hold a nigga down\n\nHold a nigga down\nJust hold a nigga down\nHold a nigga down\nJust hold a nigga down\n(Outro)\nI know that I belongs to you\nI wonder if I’ll ever be found\nCaught between the life and the lights and uh\nOh maybe we can figure this out\nI figure it’s ahead of where the crown I found\nThe hardest form of troublesome\n‘Cause we always come undone, yea we always\nYea we always", "image": "https://images.genius.com/6f5338565e5f07aa4ee5c7f21ff0a167.500x500x1.jpg", "year": null, "title": "Shorty Baby", "album": null}]}