{"songs": [{"lyrics": "I meant to do that\nHa ha ha ha!\n\nI was coolin' at a jam with my boys in Nelson Park\nUp in the Bronx where the suckers get stomped\nIt was me, Reef, James, Bob, and McBoo\nHundreds plus the 64th Street crew\nWe was coolin', but I was tryin' to debate\nShould I pick up the mic but a sucker went \"Wait\"\nHe asked me if I was D-Nice the 808\nI said \"Yeah, and get the hell outta my face\"\nHe claimed he was the greatest MC and ready to throw\nHis DJ cut up a break beat and whatta ya know\nHe picked up the microphone and these\nPlayed out rhymes that went out like striped Lees, huh\nHe said \"Huh!\" and I said \"Yo\"\nTake those rhymes and give 'em back to Kurtis Blow\n'Cause these ain't the breaks and I hold the weight\nTo try and challenge me and my crew is a mistake\nYou must be...\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nBreak\n\nHa ha ha ha ha, ha ha ha\n\nSo I picked up the microphone and got live\nHe was confused and had his hand by his side\nMcBoo laughed and James knew the time\nAnd Hundreds and Reef had their hands on the nine\nThey was waitin' for his crew to approach me\nThey made a move but my crew was watching closely\nBoo said \"Yo, allow me to diss you\"\n\"Make another move and you'll be swallowin' a pistol\"\n\"What did you think, before you stepped up?\"\nHe mumbled somethin' smart and James said \"Shutup\"\nHe said \"Shutup? Who made you chief?\"\nHe laughed and Reef put the gun to his teeth\nHis crew ran and he was left alone\nBeggin' and prayin' hopin' he could go home\nNow what did he have to mess with me the 808?\nTo try and challenge me and my crew is a mistake\nYou must be...\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nNow I'm whatya call D-Nice, the 808\nI'm for real and you know I'm no fake\nI go do a show travel, from state to state\nAnd any rapper who tries me is the rapper that I'll break\nI love to have a candlelight dinner at eight\nPrefer to take a nice young lady on a date\nI may eat fish but I could never eat steak\nSo when you cook me dinner don't put it on my plate\nWhen I find a girl I'ma call her my mate\nI love to make love, but I never ever rate\nI stand alone and hold my own weight\nTo try and challenge me and my crew is a mistake\nYou must be...\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda\n\nUnder some budda\n\nUnder some budda\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda\n\nUnder some budda\n\nUnder some budda\n\nUnder some budda, be under some budda\nUnder some budda, be under it\n\nUnder some budda, be under some budda\nUnder some budda, be under it", "album": "Call Me D-Nice", "year": "1990-01-01", "title": "Under Some Budda", "image": "https://images.genius.com/eb0cb470ed0037a539adc0b84eb90ebd.432x432x1.jpg"}], "artist": "D Nice"}