{"artist": "Pimp C", "songs": [{"album": "Long Live The Pimp ", "title": "To Lose A Whore", "image": "https://images.genius.com/674567be14a7f8b6e0eee4a149f04bd4.220x220x1.jpg", "lyrics": "[Intro]\nTo lose a whore know what I'm talking about\nCold shit know what I'm talking about\nCheck it out so I can sing it better\n\n[Verse 1]\nHow does it feel to lose your bitch?\nI'm talking your main girl\nThe one that go handle shit\nAnd how does it feel to lose yo wife? uh huh\nThe bitch that had your kids\nThe one you'd laid down your life\nAnd how does it feel to lose your queen?\nHow does it feel to drop a whole pint of promethazine?\nIt's the same way with hoes and pimps\nIf she don't grind for me I don't eat steak and shrimp\n\n[Hook]\nWhen a pimp loses a whore uh huh\nHold up sometimes it's more than a man can handle\nWhen a pimp loses a whore uh hey hey\nHold up funky bitch\nHow does it feel to lose the one\nThe one that the one that had your kids\nThe one that had your son\nHow does it feel to lose your mate\nThe one you came up with\nTo help get your papers straight\nWhen a pimp loses a whore uh huh\n\nSometimes that's more than a man can handle\nYou know I find myself uh you know watching television\nTill television went off know what I'm saying\nThen I find myself riding by they house few hours later\nShit I'm wondering should I just kick the door\nShould I just take back my whore\nYou know the bitch that would open up the pussy store\nAnd sell cock galore and bring me back chains and cheese\nHow could this bitch choose this lame\nWhen I'm on top of my game\nWhen I'm getting all this fresh shit and having all these fly things\nThis bitch must have lost her brain\nTo go to another nigga after she done been down with James\nI guess she wasn't a winner all the time\nShe was nothing but a lame\nShe was nothing but a lame\nTo lose a fucking whore\nSometimes I find myself missing the bitch\nKnow what I'm saying but then I sing to myself\nYou know what I say? I say I say whoooo whoooo\nFunky bitch I'm missing you funky bitch\nWhoo whoo hey hey I'm missing you\nYeah man I hate that bitch for that\nYou know what I'm talking bout\nBut I'm a play it by the way the game go\nI'm a get me a new bitch\nYou know what I'm talking bout\nA top notch bitch that uh just take all these funky whores spot\nYou know like Pimpin' Ken said\nIt's captain slave a hoe not captain save a hoe\nPut some of these funky crackers out there to get some of that money back\nGet them slaves made for you funky white honkies\nAnd no we ain't voting cause we ain't down with neither one of you bitches\nPimps up and hoes down you bitch\nHow you gonna be a pimp and you got a pussy\nGet your mind on your paper fake ass motherfucker\nYou ain't even made your mind up\nWhether you was gonna pimp or not yet\nUntil you been in there for ten years or more motherfucker\nUntil you done lose a bitch and lost your whore motherfucker\nGet real Sweet Jones\n2002\nReally 2006 'cause I'm light years away from your bitch ass\nKnow what I'm talking bout\nGet PA bitch ain't no games in PA either fuck ass nigga\nYou heard what I said hoe yeah lets do it\nKnow what I'm talking about\nWe can pop it out\nWe can do whatever you want to do\nIt ain't no bloods ain't no crips\nAin't none of that motherfucking shit\nAin't nothing but green bitch", "year": "2015-12-04"}]}