{"artist": "Pusha T", "songs": [{"album": "King Push – Darkest Before Dawn: The Prelude", "title": "Untouchable", "image": "https://images.genius.com/29fcc9b104c738410eeb681cf1da72ee.620x620x1.jpg", "lyrics": "[Produced by Timbaland]\n\n[Hook: The Notorious B.I.G.]\nLyrically I’m, untouchable, uncrushable\nBlunted in a 600, blunted in a 600\nUntouchable, uncrushable\nBlunted in a 600, blunted in a 600\n\n[Verse 1]\nYuugh, I drops every blue moon\nTo separate myself from you kings of the YouTube\nI am more U2, I am like Bono with the Edge\nIn Mexico, fuck Donald and his pledge\nLegend has it, the wrist is magic\nThe left is Patek, Philippe's replaced by Matsuhisa\nIgnore most requests for the feature\nUnless it’s getting played on the beach in Ibiza\nWhile she fucking Nesha and she sucking shisha\nCan’t you see my Total; Pam, Kima, Keisha\nI’m aiming for the moguls, why y'all niggas aiming at the locals?\nAnd rap niggas broke like them, they’re mere hopeful\nStill wishing on a star\nThe last one to find out that Baby own the cars\nThe final trilogy of Jaws\nThe grills like, interior gauze\nIt feels like, still white\nMatching Missoni looks African on me\nThey tryin’ pin this trafficking on me like Mano and Tony\nMy thoughts spilling over\nThe soft ceiling’s open, I Cross-Fit the coca\nYuugh! It’s a different calisthenics when I do the Lennox\nHalf a million paralleled and ain’t nothin’ rented\nYeah, wearing Dri-Fit in my shit\nIt rides a little better in the cockpit\n\n[Hook: The Notorious B.I.G.]\nUntouchable, uncrushable\nBlunted in a 600, blunted in a 600\nUntouchable, uncrushable\nBlunted in a 600, blunted in a 600\n\n[Verse 2]\nMu told me to switch styles\nHe just came home from the Feds like a mistrial\nHe tells me I miss out on all that club money, I don’t bounce\nAdidas gave me a million and that don’t bounce\nThe president of G.O.O.D. Music has been announced\nA quarter million a year and that don’t bounce\nI’m in the score of these movies, I’m losing count\nMu, you knew me from thirteen hundred an ounce\nMy breakdown game bought me ‘8 Mile’ fame\nSelling Eminem to him and ‘em\nWhite to the Blacks I’m a villain in\nThe Rolls Royce, playing peek-a-boo with the emblem\nLet’s talk about it gentlemen\nMy barcode is Netflix “Narcos”\nPart on the side of my 'fro like I’m Pablo\nNo hablo, I sell blow\nLone wolf, no Tonto, head honcho\nYuugh, let’s take the scenic route\nI could show you the strange fruit\nIt’s looking like Beirut\nThey open the wash bay, I climb it like K2\nThese kilos are drought killers, I flooded the Jesús, I made use\nOf every Spanish name I done ran across\nNo matter what the weight, I done ran it off\nI’m walking on water, I took the sandals off\nTell A&E to turn the cameras off, Push\n\n[Hook: The Notorious B.I.G.]\nUntouchable, uncrushable\nBlunted in a 600, blunted in a 600\nUntouchable, uncrushable\nBlunted in a 600, blunted in a 600", "year": "2015-11-10"}]}