{"songs": [{"lyrics": "[Intro]\n(Yeah, So x4)\n(Bud, Grade-A, Bitch, Grade-A, Gun, Grade-A)\n(Bitch, Grade-A, Drugs, Grade-A)\n*Woman Screams* (Shut the fuck up bitch, if you wanna live)\n(Ayy, Grade-A, Grade-A, Grade-A)\n(Fuck the cops)\nYeah, So\nYeah, So\n(Bitch, Grade-A, Drugs, Grade-A, Guns, Grade-A)\nAs if you ain't fuckin' know\nAs if you ain't fuckin' know\n(See me, say mayday)\nYeah, So\nAyy\nYeah, So\nYeah, So\nYeah, So\n\n[Hook]\nFuck the cops, fuck the judge, fuck the DEA\nSippin' jugg, DE for a rainy day\nIf my teacher saw me now what would she say\nSame thing that the fiends say, Grade-A\nGrade-A (x17)\nFuck the cops, fuck the Judge, fuck the DEA\nYeah, So (x8)\n\n[Verse]\nBendin' corners, burnin' bridges, breakin' bitches\nAll while tryna duck a sentence too\nYoung and troubled, I'm the pinnacle\nGetting who, tre eight on the physical\nSnub turn your brain to noodle soup\nCame to show these niggas who is who\nPacks that I flew and sold in school, Grade-A\nMayday, don't fuck with no naysay, I ain't seen shit\nWalter P with the beam kit\nNeed some cut to mix the lean with\nTurn your wife into a scene bitch, all facts\nGot some niggas servin' life times cause most of y'all niggas all rats\nObserve from the top, blowin' pot, sippin' drop\nAnd I swear I ain't lonely now that my demons my homies\nI swear if they could they would clone me\nCompletin' the mission, my flow is forbidden\nI swear you too big for your britches, I'm fuckin' they bitches\nI'm from the era where you bang and you givin' out stitches You faggots wouldn't known, I'm gettin' to the dough\nAnyway I can, Moore's fatha kitchen, then we baggin' dope\nOut a fuckin' brick, doing hand-to-hands\nYou would think we playin' ring around the rose\nLondon town, a couple thousand pound a show\nBitch, don't you say that I ain't international\nEver been to places when you go to other places\nTheir customs will hassle you, trappin' for capital\nAll off of rappin', know that I'm snappin'\nYoung and I'm active\nYou try to interfere, my instinct is clappin'\nI'm true to my faction\nWe move out the tightest of regiments\nSurrounding myself with some predicates\nDestination, where the cheddar is\nSlidin' down, off the sedatives\nRidin' 'round, off the medicine\nWeapons is guns and intelligence\nSay that the Devil sent, I'm sure I ain't Heaven sent\nBut then again, yeah I'm hella bent\nYeah, I'm hella bent\nBut then again, yeah I'm hella bent\nThey say that we Devil sent\nI'm just sure I ain't Heaven sent\nThen again, yeah I'm hella bent\nHella bent, then again, yeah I'm hella bent\n\n[Hook]\nFuck the cops, fuck the Judge, fuck the DEA\nSippin' jugg, DE for a rainy day\nIf my teacher saw me now what would she say\nSame thing that the fiends say, Grade A\nGrade-A (x17)\nFuck the cops, fuck the judge, fuck the DEA\nYeah, So (x8)\n\n[Outro: Da$H & Stevie]\nNo stress, more checks, more sex. What the fuck is you talkin' 'bout?\n\nWhat you smokin' on? You smokin' on some fire?\n\nMight be some Ammi, might be some mafuckin' Cheese, it just might be some Hogs Breath. I just know I smokin' better than y'all niggas is smokin' at home\n\nAww yeah (True)\n\nAnd they gave me a school bus\n\nRight, not a green room, but a green bus\n\nNigga, I'mma professor nigga\n\nThat's life\n\nI'm professor nigga\n\nThat's progress\n\nI'm professin' nigga\n\nMy profession is; livin' like a wild mafucka and makin' y'all niggas hate y'all shit or just wanna do it like me. Cause don't front you wanna do it like me\n\nPREACH\n\nReal talk. RIP Yams, Free Mugga nigga, I don't give a fuck 'bout nothin' else. My niggas or nothin'\n\nIt's all love", "album": null, "year": "2016-11-11", "title": "Grade-A", "image": "https://images.genius.com/e70e95be73b9dab9e9bd1e9fb01766e1.800x800x1.jpg"}], "artist": "Da$H"}