{"artist": "YG", "songs": [{"image": "https://images.genius.com/dfbbfa13d3472d5562b5e6a98cca0a59.500x500x1.jpg", "year": "2013-08-13", "album": "Boss Yo Life Up Gang (Artist: Young Jeezy, YG, & DBCO)", "lyrics": "[Produced by DJ Mustard]\n\n[Intro]\nDj Drama\n\n[Verse 1:YG]\nFuck it\nI done seen it all with these two eyes\nHoes dogs like blue eyes, I mean blue nose\nWho she fucking on who knows\nBaby mamas I don't do those\nCondoms got to use those\nCause they be acting like pinche putos\nYou a bitch nigga and you know you a bitch\nWhen you get told by a bitch nigga\nThese a thousand dollar pair of shoes\nAnd you gone step on em, nigga Fuck You!\nEverytime my bitch come around you\nTry to talk her on the low how could I trust you\nOk, niggas ain't loyal, niggas ain't loyal\nBad like milk niggas will spoil\nPicture me rollin like 2Pac\nOff two pills I popped, nigga Fuck You!\n\n[Hook:YG&Jeezy]\n\nThese a thousand dollar pair of shoes\nAnd you gone step on em, nigga Fuck You!\nThey keep bringing bottles to my tables\nI see you niggas hating, nigga Fuck You!\n\nI think they mad cause I'm in my zone\nPlus I got that rollie on, nigga Fuck You!\nI got a hundred bitches at my table\nI see you niggas hating, nigga Fuck You!\n\n[Verse 2:Young Jeezy]\nThink I ain't with the shit, Know you got me fucked up\nDon't be coming at me wrong, That'll get you fucked up\nTrue to the game don't judge a book by it's cover\nAnd don't you ever, never, ever mistake a G for a sucker\nNigga fuck you and everybody who like your bitch ass\nSend them through in the chevy DT snipe your bitch ass\nFrom the back of the back in the ? got damn\nGo dougie on the pussy, thats right killa cam\nNiggas don't run shit but their motherfucking mouth\nIf I had a dollar for the hate I'd buy a billion dollar house\nGot that .40 on deck keep it with me like a spouse\nI don't even mind smoke a nigga like a house\n5 in the morning going hard in the kitchen\nT doing three my god niggas snitchin'\nI'm a speak my mind yeah you know how I do\nSo really bitch nigga Fuck You!\n\n[Hook]\n\n[Verse 3:YG]\nFuck you\nGiuseppe with them straight legs\nAnd them Ray Bands I see you niggas hating\nI know you niggas plotting\nBut I ain't even tripping\nCause I know my niggas popping\nThe club or the mall it don't matter I'm a cash out\nOn my GPS all I see is cash routes\nIn the whip don't make me pop the stash out\nI cock back like nigga Fuck You!\n\n[Hook]", "title": "Fuck You"}]}