{"songs": [{"image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg", "title": "Let’s Go", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "* iTunes bonus track\n\n[Nelly]\nYo, check\nIf I was from New York, I'd probably be from Harlem\nAn uptown nigga with a hunger for stardom\nPlayers runningback, coach I can't guard 'em\nIf you like me on your team ma, you needs a starter\nBeg your pardon, kid is actin disrespectful\nHe walks up in the club, Slick Rick with his neck full\nGoin to start a money war, what is he there for?\nStacks little paper, what he do that for?\nThrow a few thousand out the roof of my Maybach\nJust a little somethin that I got from Reebok\nWe cop, e'rything you see up in the windows\nShoppin sprees keep me hungry ma, it's time to get some {?}\nTurkey bacon, egg whites all up in my griddle\nObscene how the protein keep a nigga lean\n... Knahmean?\nIt's obscene how the protein keep a nigga lean\n\n[Hook: Nelly]\nWe got a problem in here?! HELL NO!\nWe got a problem in here?! I SAID HELL NO!\nYou niggas wanna set it off?! HELL YEAH!\nYou really wanna set it off?! H-H-HELL YEAH!\nThen let's go, let's go, let's go, let's go\nLet's go, let's go, let's go, let's go (hey!)\nLet's go, let's go, let's go, let's go\nLet's go, let's goooo (hey!)\n\n[Nelly]\nI'm just chillin in my Coupe (what?) chillin in my Coupe (what?)\nI'm chillin in my Coupe with my chick on the side\nI'm just chillin in my Coupe (what?) I'm chillin in my Coupe (what?)\nI'm chillin in my Coupe with my chick on the side\n\nI'm like a country-ass Adonis lookin for my goddess\nSame attractin apparatus around, that can find her\nPulled down the shades, clothes on your body\nShe can go behind this lame and let shorty go to work\nShow a couple thou', bet shorty go berserk\nLast night she on the pole, then this mornin she in chruch\nOn her knees in both places, man I bet that hurt\nGet you some extra funds, support ya single moms\nHeard she slangin ass so you can say she buy sex\nPlus she got a friend so I hope she bi-sex\nI park right next to her, yeah that's me\nPlus the house up on the hill, baby yeah that's me\n\n[Hook]\n\n[Nelly]\nSee I'm a U-City alumni, lookin out my one eye\nSimilar to Popeye, when I'm on that spinach\nSomebody call up the Guinness Book, it's gotta be record\nLike when I heard the beat I knew it had to be on my record\nKnow folks need it, I'm officially elected\nThe right to bear arms, I'm officially protected\nSo if I call you out, don't argue, respect it\nMatter fact, go hit the showers, you officially ejected!\nI used to slang the Jimmy Crack when I didn't care\nI seen Jimmy jack corn homie, I was there\nWhen Jimmy turned around with his devilish glare\nI showed Jimmy waistline, partner he wouldn't dare (c'mon)\nI can burn your chest like shots of Patron\nFuck a drink, I'm talkin 50-cal desert eagle holmes\n... Ah ah ah ah\nI drop down and get my 50-cal desert eagle on (boom!)\n\n[Hook] - 2X"}], "artist": "Nelly"}