{"artist": "Kokane", "songs": [{"image": "https://images.genius.com/268427375f4c15a9561d9f957fb3eb6e.1000x1000x1.png", "title": "Let’s Go", "year": "2017-07-07", "album": "It’s Kokane Not Lemonhead", "lyrics": "Well I'm an old-fashioned nigga\nWith old-fashioned ways\nRollin' the candy cutty, still listen to The Bar-Kays\nI still smoke a Zig Zag, fuck a blunt\nCuz you can't even taste the weed, I ain't gotta front\nBut enough about me, let's talk about you\nSo sophisticated, ask the question \"what you into?\"\nShe said she like poppin' tags\nSomeone to make her laugh, and goin' home with a buncha bags\nLate-night candlelight dinners\nAnd I love it when she says she's allergic to them broke niggas\nDon't fuck with squares, only thugs\nBaby me and you fit more than the O.J. glove\nFigured I'd lock you down like Fort Knox\nThat's when she put my hand on her fart box\nWe a match made in heaven, pack your bags and let's go\nYou ain't never been on a ride like this before\n\nHere we go, let's go, let's go, let's go, let's go\nI guess you never know\nHere we go, let's go, let's go, let's go, let's go\nI guess you never know\n\nAll natural, face of an angel\nGot more ass than Amber Rose and J. Lo\nHella feminine, smellin' like cinnamon\nI just wanna get to know you better so we can try to spend\nA little time over a glass of wine\nKick back, recline, it's on, we blow about a half a zone\nBody hella tight, outta mind, outta sight\nBut what's a bad chick if the toes ain't right?\nAnd if she ain't got game, she just a pretty bitch with no brains\nNow me and you been kickin' it about six months\nAnd girl I admit, you ain't pulled no stunts\nYou never know when you meet the right honey\nCuz most of these pretty bitches only in it for the money\nBut you never know\n\nHere we go, let's go, let's go, let's go, let's go\nI guess you never know\nHere we go, let's go, let's go, let's go, let's go\nI guess you never know\n\nI can make you feel alright\nBaby all through the night\nAnd when it's cold, you love it when I hold you tight\nI ain't never met a girl like you\nYou ain't never met a nigga like me\nWe got that chemistry\nLet's do what comes naturally\n\nYeah little mama\nYou ridin' with a real one\nAnd I'm surprised at myself\nYou know I go hard on a bitch\nBut you're not a bitch, you're a classy woman\n\nI guess you never know\nI guess you never know"}]}