{"songs": [{"album": "Any Given Sunday #5", "year": "2011-09-04", "title": "Heavy", "image": "https://images.genius.com/305d79b43fb5a9df37794d76ec0bb1dd.500x500x1.jpg", "lyrics": "[Chorus]\nMore liquor when we ride\nToast niggas, we alive\nGolddiggers look inside, I ain't in the back\nMe? I’m in the front seat, driving like I’m 1 deep\nIf you want to come see, you know where I’m at\nGo-getters on tha rise, toast niggas we've arrived\nOld niggas step aside, ain't no coming back\nBig thangs on my mind, switch lanes and recline\nGet brains from a dime, how you love that?\n\n[Verse 1]\nAlone in my zone, tell me don’t it sound stunning\nBeen fucked the world but she just now coming\nIf I ever fell off I would hit the ground running\nI ain't never been the one for fourth down punting\nAiming at a couple heads, bitch I’m crown hunting\nRed dots cause a nigga dread locks\nSo I lockpick just to lock shit back\nI want \"Money, Power, Respect\" since The Lox said that\nBetter stay up on ya toes, this is not tic tac\nYeah, I’m a breath of fresh air, you can place your bets here\nBalling like a Laker, you should pray for next year\nCause I’m repeating and I’m 3-peating\nAnd I’m knee-deep in the game\nIt's quick sand and I keep sinking\nThe label heat seeking, nigga ain't sign me\nWhat the fuck was he thinking?\nThey say I killed the game, that was only preseason\n\n[Bridge]\nI’m heavy\nLil' nigga I’m heavy\nI’m so heavy, I’m feeling heavy\nCarolina I’m heavy\nIn New York I’m heavy\nOut in LA I’m heavy\nI’m so heavy\n\n[Chorus]\nMore liquor when we ride\nToast niggas, we alive\nGolddiggers look inside, I ain't in the back\nMe? I’m in the front seat, driving like I’m 1 deep\nIf you want to come see, you know where I’m at\nGo-getters on tha rise, toast niggas we've arrived\nOld niggas step aside, ain't no coming back\nBig thangs on my mind, switch lanes and recline\nGet brains from a dime, how you love that?\n\n[Verse 2]\nNo album to my name and I’m already hot\nYou can say I’m pre-heated\nIf money talks, mine telling yours be seated\nCut my leg off I wouldn’t be defeated\nIllest nigga in tha game bitch and you can retweet it\nEmail that shit, make sure you CC it\nFor these fuck niggas who don’t want to believe it\nI'll be in the airport damn near barefoot\nSecurity hollering out, Cole we need it\nGetting high as fuck and I dont even be weeded\nNo point drinking I can’t even be faded\nReal recognise real like they related\nYou ain't no fucking G boy, your style G-Rated\nHatred is flattery I’m glad to be hated\nFucking bad bitches that would rather be dated\nCarolina niggas just glad that he made it\nMy money was running late now it’s happy belated\n\n[Outro]\nI'm heavy\nNigga I'm heavy\nHey, I'm so heavy, I'm feeling heavy\nLil' nigga, in New York I'm heavy\nQueens, I'm feeling heavy\nFayet-nam nigga, I'm so heavy\nI'm feeling heavy\nLil' nigga I'm heavy"}], "artist": "J. Cole"}