{"artist": "Ant Banks", "songs": [{"title": "Gotta Have Heart", "image": "https://images.genius.com/f5e3b268f1ab7a632ba28e1447e73a94.774x768x1.jpg", "album": "Derty Werk", "lyrics": "That's Ant BEEZY, nigga - off the HEEZY\nIs he my nigga? FO SHEEZY nigga!\nWhat, what? Say what, say, say what, say what?\n(Kev B in the motherfuckin house)\nSay what, say what, say what, say what?\n(Bombay all day nigga this is fo-TAY!)\n(Bombay all day punk this is FO-TAY NIGGA!)\n\n[Verse One]\nFresh up out the Testarossa\nStill buzzin off that sticky green Cali doja\nLast night had, way too many bitches jock\nMr. Player himself, gon' always keep it poppin\nAnd stoppin you and yo' ability to come tight, mack like Dolemite\nSometimes you learn the hard way, but you gon' get it right\nKeep listenin, discipline plays a strong part\nThe majority of these bitches ain't got no heart\nEnough to roll with the punches, hundred dolla bills and brunches\nComin home in somethin way tight that's scrumptious like\nSteak and lobster, dank from rastas\nAnd we don't roll with nothin but, G's and mobsters!\nZenithes, Daytons, twenty inch chrome ones\nNever know the feelin of a bitch 'til you own one!\n\nYeah we Bay riders, call us, murder for hire\nCloser, than hittin home runs than McGwire and Sosa\nWe supposed to be, killin 'em off, hittin 'em off\nWith this old ill shit, givin 'em an overdose of this so real shit\nSo feel this, way down deep up in your liver\nGive a, nig a chance for the alcohol to make you quiver\nStill a, assassin blastin any nigga who think he can outlast\nThe master splash yo' ass in a, pool of blood\nSo ask the, nigga who done rolled up and got his, dome split\n(Dome split) I don't give a fuck motherfucker wait 'til the chrome hit!\n\n[Hook: repeat 2X]\nThey say you got to have heart\nI roll with dese niggas dey mob figures and killas you niggas feel us\nThey say you got to have PAPER\nShit, cause life ain't long, nigga best to get yo' hustle on\n\n[Verse Two]\nA player's proposition got 'em wishin they was laced up\nPerfect conversation plus my new just game I make up\nTalkin bout, mash you got me bout it now I'm gettin dough\nDress in style every day, own many expensive clothes\n\nAy tell yo' potnahs they can be a part of all the benefits\nAy, pinky finger diamonds all the finest ain't no limits and\nWhat we tryin to do menage-a-trois up in the rental then\nYou can make a move you never lose with a gentleman\nAll about my paper fettucini and lucciano\nIf we keep this pimpin right we movin into condos\nBaby wanna treat to play, she wanna lace me\nDress me up from head to toe and shoppin sprees at Macy's\nAy, copped me all the flyest shit, like Tommy Hilfiger\nCalvin Klein cologne just wanna zone with a real nigga\nWe can do it live and go through all your wildest fantasies\nTell me yeah you wanna be as freaky as you wanna be\n\nNiggas is so fake and phony\nNine times out of ten they ain't Oscar Mayer beef they Lady Lee bologna\nSpeakin on shit they never did, soundin like a tweeter\nWishin they was a mid, ho you don't know you blowin out like an amp\nLickin mo' pussy than the post office lick stamps\nMoney over bitches, boy you don't remember?\nJust kick back and sautee, nigga never simmer\nOh yeah you hoes you triflin too, haha\n\n[Hook]\n\n{*ad libs to fade*}", "year": null}]}