{"songs": [{"image": "https://images.genius.com/74ceb79ff154bc11a57f940bc43fdec1.1000x1000x1.jpg", "album": "Hip Hop Hooray", "title": "Can’t Be Arsed", "lyrics": "For a long time, I grew up thinking I was lazy. But then one day, I realised: I'm not lazy. I just have really high standards. For doing stuff. Efficient\n\nCall me any nasty word: bum, slob, slacker, nerd\nI can't be arsed to come up with a comeback you haven't heard\nCan't be arsed to do my tax return, I've got cash to burn\nAnd I can't be arsed to invest the stacks I've earned\nCan't be arsed to chat, converse with you, I'm taciturn\nCan't be arsed to drive a car because I'd have to learn\nCan't be asked press the gas, I kinda like the back seat\nThank God for Uber cause I can't be asked to call a taxi\nTo take the rubbish out (well) I'd have to pick it up and put it down\nAnd my brown wheelie bin's got a funny smell\nSimple daily stuff is a battle to grapple with tasks that should be natural's too much of a hassle, I'm stuck in a shackle\nEvery kilojoule I physically exert, strenuous\nJust point me to where the desert menu is!\nCan't be arsed to hit the kitchen, not moving out this seat\nWhat food I'll have to eat\nPot Noodle, naturally\nCan't be arsed to feed the cat, little needy twat\nDon't want to peel a pack and pour it, can't you deal with that?\n\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\n\nCan't be arsed to wake up and get out of bed\nI'm the laziest from A to... Eff-it can't be arsed with the alphabet\nEffort? Eff-it!\nRetention? Forget it!\nTension? Don't stress it, getting too much? Just let it\nCan't be arsed to open the post and pay the bills\nCan't be arsed to practice rap and elevate my skills\nCan't be arsed to open my eyes or socialise\nCan't be arsed to vocalise\n[silence]\nI can't be arsed with shows and live sets, learning loads of lines\nCan't be arsed to leave the house, I'm staying home tonight\nCan't be arsed to visit mates of mine, it's a waste of time, I can play online and get my gossip through the grapevine\nCan't be arsed to shave my face or get a haircut, to trek up to the barbers just to trek back cause they're shut\nSo my hair is messed up, I can't be arsed to style it, I let myself go, and can't be arsed to fight it\nI've lost all control and can't be arsed to find it\nHa, freestyling this song, I can't be arsed to write it\nCan't be arsed to rap on beat, I rap off\nBeat\nHehe!\nCan't be arsed to even laugh properly\nCan't be arsed to try composing melodies with no luck\nI C.B.A. to write my own hook!\n\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\n\nIt doesn't matter what it is, man, I can't be arsed\nCome to think of it, I can't be arsed to not be arsed\nAnd if I can't be arsed to not be arsed, I can't be arsed to not be arsed to not be arsed\nSo I guess that means I can't be arsed to write filler\nBecause I can't be arsed to be considered anything apart from an ice-cold mic-killer\nCan't be arsed with your rap so I will write songs\nCan't be arsed with tiredness so I sleep all night long\nCan't be arsed to go on the doll so I got a full-time job\nGot a girlfriend that can't be arsed to pull my knob\nCan't be arsed to masturbate, over the past few days I've been far too busy to be arsed to procrastinate\nI stand out, can't be arsed to hang out in the background\nHit the gym cause I can't be arsed to carry all that fat round\nKeep it deep I can't be arsed to dumb the track down\nI can't be arsed to not make my mum and dad proud I\nCan't be arsed to be fat, so when I see snacks I think \"You know what? I can't be arsed to eat that.\"\nCan't be arsed to die young from heart disease\nCan't be arsed to force my blood through clogged up arteries\nCan't be arsed to be hard to please so I take it easy cause I can't be arsed to make my own life hard for me\nI'd like to say I do it for my health but I just can't be arsed to delegate I do it all myself\n\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\nEffort? Eff-it, Eff-it\n\nI used to think: \"Eff-it, I'm not doing it.\"\nBut now I think: \"Eff-it, I'm doing it!\"\nI used to think: \"Eff-it, I'm not doing it.\"\nBut now I think: \"Eff-it, I'm doing it!\"", "year": "2017-01-13"}], "artist": "Dan Bull"}