{"songs": [{"year": "2012-08-21", "image": "https://images.genius.com/ac26f16779582a2a239a425633d7dc5a.1000x1000x1.jpg", "title": "B-Boyz", "album": "Billionaire Minds", "lyrics": "[Intro 1: DJ Khaled]\nAight, this record right here is featuring the future!\nAce Hood! Kendrick Lamar!\nOne time for the West Coast! Philly, what's up?\n\n[Intro 2: DJ Khaled]\nYeah! It's We The Best! It's YMCMB!\nOne time for Top Dawg Entertainment!\n\n[Verse 1: Kendrick Lamar]\nTalk about it, make 'em talk about it\nLife to me is currency, prosperity, I got it\nAnd your life to me is lifeless like it's livin' on life support\nI license everything in my wallet\nLightest boy with the biggest heart\nNigga, play yo' part or parallel park yo' ego\nNext to me and violence\nNext to me is definitely no one, I'm one of one\nAnd I musta won that from anybody who had it\nOr, better yet, forgot it\nMack in the back of a 'Lac with a MAC in the back of a 'Lac\nWith a latch on the back of the trunk\nHit a punk in the back with a pump in the back till he's off balance\nAnd I'm back in the front of the front of the future\nWhen you are mentioning talent\nAnd I'm back in the back of the block\nWith a cop wanna cop anybody's allowance\nIraq on the block, he watch with a block or whatever\nAnd cut, no cut, mo' guns, mo' guts, fuck boy\nYou fucked up twice, you fucked considerin' you drownin'\nDie in a lake with a date with a catfish, backflip head-first smilin'\nCr—cry in the face of Jesus, we just pray we keep on stylin'\nOn you bitches, TDE, YMCMB big business, bitch!\n\n[Interlude: Ace Hood]\nAce Hood\nBirdman, what they do big dawg?\nMack Maine, what's crackin fo?\nBig money\n\n[Verse 2: Ace Hood]\nOkay nigga, riding in a May-be, and I'm probably with Baby\nDon't talk nigga, fuck you pay me, intercept your bitch like Bailey\nOkay big money on this side, 100 grand for the whip my bitch drive\nNeed a new safe money getting too high, dead presidents all in my Levis\nBoy I swear this nigga be swagging, and I'm living lavish\nMight cop me an Aston, Martin on 'em\nAnything I drive I own 'em, bad bitch and that ass ain't normal\nGotta put that pound game on her, beat it up she deep in a coma\nI'm super paid, 2 shows a day\nMy rollie gold, no time to waste\nWhat it do Berg? My fuckin' brother\nKeep that pistol by me like my lovely momma\nHot as the summer, cold as the winter\nStay on them charts, I heard that they plotting my timber\nYoung nigga, got a lot of flows\nAny nigga don't believe me, I make it look easy, easy out of control\n\n[Interlude: Birdman]\nJust like that boy\nThat fo bigs honor\nYa understand me?\nDedication, respect, fully loaded, yeah\n\n[Verse 3: Birdman]\nBox full of choppers, hand on the trigger\nUptown gangsta, get it how we get it\nThird Ward soldier, suicide rider\nMilitant minded, hundred mill on the counter\nHand-Persian rug nigga, flame on the Bugatti\nChristian Louboutin, Chanel for my models\nHigher than Bugatti nigga, fishing on the fish scales\nNose diving for them hundreds, strapped up making mail\nFr-fresher than I been before\nHigher than we even been, shining on them 24’s\nJunior doing time ho\nOn the grind ho, while he doing time ho\n\n[Interlude: Mack Maine]\nYa know!\nThe time is money and money still was made baby\nEight months ain’t stop nothing nigga\nIt’s like jail was third base and my lil’ nigga still came home, ya understand\n\n[Verse 4: Mack Maine]\nI’m from the hood where bitches hold coke in they baby diapers\nThat’s why when the babies grow up damn they be like us\nI came a long ways from rhyming up in crazy cyphers\nMan I’m so happy my lil’ brother came home from Rikers\nShout out to BP, Thugga, Flow and [Fail Boy?]\nMy flow Lucifer, I spit hell boy\nMy heart numb, ain’t no pain I can’t withstand\nAnd I hold my niggas down boy like a kickstand\nGet off my nuts, stop acting like a bitch fam\nLil’ nigga finish puberty, grow ya own dick damn\nI went from watching time fly on Earl and Red porch\nTo cruising through the streets of Miami in a red Porsche\nMe and Stunna fly, we should join the Air Force\nStand up niggas, the fuck you brought them chairs for?\nI went from making money from people with crack habits\nTo thanking God I’m in a whole ‘nother tax bracket\nAmen\n\n[Outro: DJ Khaled]\nShout out to the YMCMB bosses!\nBirdman!\nSlim!\nLil Wayne!\nMack Maine!\nOne time for that boy Cortez, aka Tez!\nThis is how we do it!\nWe ain't never gonna stop either!"}], "artist": "Birdman"}