{"artist": "G Herbo", "songs": [{"title": "Everyday in Chicago", "album": "Welcome To FazoLand", "year": "2014-04-04", "image": "https://images.genius.com/4af4495189941f1b86086adb14c093ca.300x300x1.jpg", "lyrics": "[Intro]\nEvery day in Chicago\nNeed a gun to go here, Need a gun to go there\nEvery day in Chicago\nBro 'nem tryna go slide on these bitches\nIf they ain't got that pole on 'em\nMan shit, over with I ain't even gone lie\nEvery day in Chicago\nA lot of bodies getting dropped all type of shit, man\nEvery day in Chicago (Squad!)\n\n[Verse 1]\nLook, I'ma tell you the truth\nGrowing up in the Chi, I ain't got nothing to lose\nI done seen a lot of mommas cry, I done had a lot of homies die\nYou can't walk in my shoes\nOut here in the field you don't do what I do\nMa ask me every day, \"Boy, what you gone do?\"\nI'ma get to this cake ma, we gone be straight\nBut I told her either way I ain't going to no school!\nYou can catch me on the 8 with the 8\nLil Bro got the K, either way still got that tool\nEyes open everywhere, boy, I know I can't snooze\nYou a real street nigga then I'm just like you\nBetween my squad and my family, I hate to choose\nGranny tell me all the time, “Boy, I pray for you.”\nDon’t wanna change the channel and see I made the news\nA lot of bodies getting dropped and they don’t make the news\nIf you out here in the streets then you know wassup\nEverybody wanna know why it’s so fucked up\nWonder why the young niggas don’t give no fuck\nCause we know don’t nobody give a fuck about us\nSo we shoot guns and we gangbang\nAnd we post up each and every day\nFuck the police we gone sell weight\nTill the people show us a better way\n\n[Hook]\nEvery day in Chicago\nEvery day, every day in Chicago\nEvery day in Chicago\nEvery day, every day in Chicago\nEvery day in Chicago\nEvery day, every day in Chicago\nEvery day in Chicago\nEvery day, every day in Chicago\n\n[Verse 2]\nThey got gangstas on that side, It’s savages on this side\nThem junkies on the block robbing ladies for a hit now\nNever ever ever did I give a fuck about no bitch\nI was too busy tryna' make a 100 off a flip\nBought all the choppers niggas had when lil bro coming out that dip\nThey start running, lil bro gone let off 100 out that clip\nWhy they snitching, why they snitching?\nWhy all these niggas snitching?\nWe don’t want prosecution, we execute the witness\nA nigga get whacked probably over chit chat\nHollows push his shit back\nNow his homies ride around with the tech tryna' get they lick back\nIt’s still the same shit, bitch, I roll with the same clique\nPocket full of Ben Franklin’s no change bitch\nAnd I’ll never ever change it\n\n[Hook]\nEvery day in Chicago\nEvery day, every day in Chicago\nEvery day in Chicago\nEvery day, every day in Chicago\nEvery day in Chicago\nEvery day, every day in Chicago\nEvery day in Chicago\nEvery day, every day in Chicago"}]}