{"artist": "Kilo Ali", "songs": [{"image": "https://images.genius.com/dae28a7d141c723b92db9597449e7cb5.300x300x1.jpg", "title": "Lost Y’all Minds", "year": "1997-07-29", "album": "Organized Bass", "lyrics": "[Hook]\nLost Y'all Mind\nSome of y'all done lost y'all mind\n(Oh Lord)\nSome of y'all done lost y'all mind\n(Oh God)\nAnd it made me cry, cry, cry\n(4x)\n\nAlright, once again it's me\nKilo-Ali with positivity\n?? so you got to hustle\nDrug dealers ain't nothin but trouble\nDo the crime, you gotta pay the price\nWhat you gonna tell Jesus Christ?\nHe don't smoke, and he don't get high\nWhere the kingpins go after they die?\nCause it's a sin to sell\nBrother you can go to jail, you can go to hell\nWhat about a brother be thinking he a pimp though?\nWill he call his own mother a trick ho?\nOr his cousin, or his sister, or his auntie?\nBoy, you better learn to love the ladies\nI think your slippin'\nBut you think your pimp, pimp, pimpin'\nFor a nickle and a dime, some uh y'all done lost y'all mind (2x)\n\nChorus (4x)\n\n???, they think I hate white folks\nOh man, that's gotta be a white joke\nIt ain't what I done to my country\nIt's what my country's done to me\nRed, white and blue the flag again\nI'll burn it, black American\nI gotta stand up for myself\nBrother give me freedom or give me death\nWhen I rap for the blacks\nWhite folks don't like to hear me talk like that\nBlack cop will lock me up faster\nHe'll be ?? for master\nAnd I'm looking for a brother\nHe called me a black mother (sigh)\nSo I looked him in his eyes\nAnd he made me cry, cry, cry\nI know you gotta make you a livin\nBut why you gotta hurt my feelings\nFor a nickle and a dime\nSome uh y'all done lost y'all mind (2x)\n\nChorus (4x)\n\nSee the world is a zoo\nAnd if you live in the world I'm talking 'bout you\nTry to touch somebody's hand\nTry to make the world a better place if you can\nSee, all we need to do is keep the love in our hearts\nWe all survive\nWithout God, we have nothing\nAnd with God, we have everything\nYes, that's why I always say\nI say\n\nMoney and clothes\nAnd beamers and bowls\nI'd rather go to heaven then any of those (5x)"}]}