{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Killtro / Go-Go Dub Plate", "album": "The Chalice", "lyrics": "Billy woods - “Killtro / Go-Go Dub Plate”\n[Emcee(s): billy woods]\n[Producer(s) of Instrumental 1: 007 (AKA Bond)]\n[Producer(s) of Instrumental 2: DJ Marmaduke]\n\n[Verse 1: billy woods]\nKabul to Baghdad, the emperor wears no clothes\nChoppers and foot patrols, trigger-happy eighteen year-olds\nIn the hood, we know about those\nBetter yin like the Bloods on my block\nDon’t care how they bust shots, kill anybody for props\nSick dudes, but better them than the cops\n\n[Verse 2: billy woods]\nD.C., Virginia for undercovers, make you cut raw deals\nThen fuck no-rubbers, son, don’t chill\nDevil happy than a motherfucker, duns don’t kill\nBut your man might buck your flash and steel\nAccidents happen, sucker.  Both play close like\nLovers, brothers play the house like baby mothers.  Easy\nBake Oven stuffers, windbreakers, handcuffers\nFor taillights and mufflers.  billy don’t sleep like\nTruckers.  No darts, I’m a spearchucker\nEnemy competent, licking anthrax letters to Uncle Tom\n‘Cause Powell should know better.  Ashcroft and Cheney\nLike, “That’s my nigga.”  (For real) [?]\nPull the trigger (For real), have her spinning in her grave\n‘Cause nothing’s more disgusting than happy slaves.  Lend an ear\nTo these Van Gogh skills, paint spills.  My flow\nLike, “Give me the pill.  Stand back or make the high-\n-light reel.”  This how I feel: people need hot\nMeals.  They’re spending millions spraying coca fields\nBut, in my building, niggas still deal, and\nThe price keeps dropping, so more niggas start copping, get locked\nBack to sharecropping, private prison selling stock\nOptions Rockefeller concoctions, so when the page\nCheck my mouth, grab my balls, I know they’re just shopping\nAuction-blocking.  Where the fuck is Cochran?\nWhere the fuck is Cochran?\n\n[Verse 3: billy woods]\nDie City dub plate\nF the jakes.  Been in Rome, where broken dreams\nGo, Verona Drive, youth in the street, Georgia\nAve., [?], Columbia Heights rock\nReal pipe, Indian Lane tick tock, flying\nLick different cops.  [?]\nThe forest.  Fuck the tourist on the creep\nYou Street, First Street.  E-Double got\nThe leather seats, Marmaduke cheffed it, no meat\nFalafel beats"}], "artist": "​billy woods"}