{"artist": "G Herbo", "songs": [{"title": "All Day", "album": "Humble Beast (Deluxe Edition)", "year": "2018-02-15", "image": "https://images.genius.com/8e2956fcf12a8df48395c50350e5ffbd.1000x1000x1.jpg", "lyrics": "[Intro: G Herbo]\nYoung Chop on the beat\nG Herbo\nYou know I'm a street nigga--real street nigga and that's common sense\nEverybody know you 'posed to get money, stay out the way\n\n[Verse 1: G Herbo]\nLookin' down the barrel of that hammer for my last time\nMade me slow down, look at life\nWhy I'm just gon' give you mine?\n'09 I was doin' fine\nBroke as fuck, school shirts, on the bus\nSince I been gettin' paper, shit ain't holdin' up\nI never break nigga, fold for what?\nEvery day I wake, still gotta load it up\nRoll it up\nIf you throwin' Bs, nigga, hold it up\nNiggas know what up\nIf you book me for a show, know I sold it up\nSoon as he pull up through the back of the door, got them poles wit' us\nAnd I'm froze as fuck\nOnly pick up 10K bankrolls and up\n10K, that's a backend\nPull a hunnid racks out the bank, put it back in\nBe safe if you lackin'\nHow 'bout blow the whole 30 shots and get back in?\nKeep your head up in the rack then\nYeah, okay, get whacked then\nBetter have eyes in your back then\nBetter keep the strap on your lap then\nBetter keep your homies on Essex then\nI'm just gon' put one up in yo' chest then\nBetter go invest in a vest then\nOkay, we givin' face shots, nothin' less than\nOn the block 24, no restin'\nStand over niggas, drop 10 out FNs\nI don't give a fuck, I done lost my best friend\nAll this money must be why I'm stressed then\nToo many times I was close to death in the streets\nI'ma keep gridin', keep gettin' checks in\nGotta kill by any means\nEnemy next to me\nI can't accept defeat\nPickin' up three backends every weekend, that's a least 60 racks a week, nigga\n\n[Chorus: G Herbo]\nAlleys, corners, hallways\nPlacin' orders all day\nPosted wit' them pistols out there all day\nI been wit' my niggas out there all day\nAlleys, corners, hallways\nPlacin' orders all day\nPosted wit' them pistols out there all day\nI been wit' my niggas out there all day\n\n[Verse 2: Blac Youngsta]\nEverything I gotta grind for\nYou know I work hard for mines, bro\nThey showed me love when I was broke, then they changed when I signed, bro\nEverybody turn their back on me\nSwear to God, that's a fact homie\nAt first them niggas they was black wit' me, then they went a little black on me\nThey got a little more dogs\nI got a little more smart\nI backed away from that bullshit, then I got a little more far\nI'm the most gangster nigga from my city\nI don't wanna know 'cause it ain't my business\nI don't give a fuck about her feelings\nFuck that bitch I don't want that bitch, I don't want dealings\nI was in a drug bust wit' my dope on the backseat\nGun on the front seat wit' my ankle bracelet on my feet\nI been on the block all day\nShot a nigga in the hallway\nHave you ever ran in the corner store, pulled a stickup broad day?\nShout out grandma 'cause she put me out\nShout out every nigga ever [?] me out\nSame nigga threw a cross at me, same nigga that ain't wit' me now\nSame niggas when I went to jail, they ain't make my bond\nSame bitch broke bad when I did time\nSame nigga fucked my bitch when I was on the run\n\n[Chorus: G Herbo]\nAlleys, corners, hallways\nPlacin' orders all day\nPosted wit' them pistols out there all day\nI been wit' my niggas out there all day\nAlleys, corners, hallways\nPlacin' orders all day\nPosted wit' them pistols out there all day\nI been wit' my niggas out there all day"}]}