{"songs": [{"title": "Goin’ Thru Some Shit", "album": "Good Job Larry", "year": null, "image": "https://images.genius.com/370d4ac4ef482ad0445cf73fb72bfc4f.600x600x1.jpg", "lyrics": "Wake up early in the morning grabbed my k up out the closet\nI got money, I got hoes, all that hating need to stop\nIn the trap, going hard, what you need, yeah I got it\nWhen I'm out in NYC I got P's of that sour\nBlowing racks, I'm in Sac, you a bitch, I'm a mack, rap niggas stealing swag, zombie tips in my mag\nDesigner what I'm smoking, had a drop top, Lil shawty know it, drinking on a bitch, buying pussy, give her everything\nMeet me out in Oakland, my price is lower, chi' with me, God damn, I don't gotta rhyme, I'm the realest nigga in it. You ain't got no money, we just know your song, something ain't right, you're doing something wrong, bitch I've been known, I just came back from Asia. I'm never lying to them, I'd rather flaunt to them, money conossour, fuck the constitution, 30 in the uzi, relaxin I'm just coolin, they wonder how I do it, my life like a movie, I wonder will I make it, I'm feeling like I should\n\nI'm going through some shit\nBitch ass nigga, quit calling my phone\nI'm going through some shit\nAnd this money, I gotta get it on my own\nI'm going through some shit, damn\nFuck the rap game\nI'm going through some shit\nI'm out here, I gotta get it on my own\n\nI can't lie bitch I'm in a daze, trappin' hard all 30 days, the trap sounding like a shooting range, m80 and the 12-gague. Pussy nigga you can catch a fade, purple syrup in my lemonade. I'm feeling like the last nigga left, all my niggas dead out in the field. I've been trapping since a young nigga, I was livin' in a motel, mattress smelling like a cigarette, whoever thought I'd ever make it here? I never witness bricks for the team, 20 bands and we can get it in, I'm sliding through another nigga hood, I gurantee he'll never talk again. I'll take your bitch out to dick and din', never ever tell her where I live, I got her sucking sippin' juice and gin, I don't love you bitch we only friends. She told me that she'll never love again, I told the bitch yeah I understand. Compact right above my leg, fill a pussy nigga up with lead\n\nI'm going through some shit\nBitch ass nigga, quit calling my phone\nI'm going through some shit\nAnd this money, I gotta get it on my own\nI'm going through some shit, damn\nFuck the rap game\nI'm going through some shit\nI'm out here, I gotta get it on my own"}], "artist": "Larry June"}