{"artist": "Problem", "songs": [{"album": "O.T. (Outta Town)", "title": "Hallaluah", "image": "https://images.genius.com/bfccd56b50a159db23155c1829c2b5ab.500x500x1.jpg", "lyrics": "[Hook: Trinidad Jame$]\nWoke up in that pussy, I ain't even brush my teeth yet\nGave her ass that Holy Grail, my nigga, halllelujah\nGave her ass that Holy Grail, my nigga, halllelujah\nGave her ass that Holy Grail, my nigga, halllelujah\n\n[Verse 1: Trinidad Jame$]\nBaby, get your clothes back on, it's time to get to moving\nIt's so much that I gotta do and so little time to do it\nPut my mama on the books cause I know I could trust her\nDon't see my baby sister much, I hope she know that I love her\nGot some brothers comin' to get ya, they ain't leavin' no evidence\nBetter ask about my daddy, boy, that fool was a idiot\nI'm cool as propeller bitch, haha, hungry and arrogant\nAin't got no baby mama, don't got no time for that extra shit\nYour times is up, bad luck bitch! Your time is up, bad luck bitch!\n\n[Hook]\n\n[Verse 2: Bad Lucc]\nBeefin' wit' Trinidad Jame$\nI fuck wit' nothin' but dames\nMe lucky, never no lames\nPsych ward, nigga go sane, nigga\nCall the doctor, lotta blood in here\nNot me cryin', got cuz in here\nTen six block to the onion there\nThem town, ave niggas be dumb in there\nBaby go lookin' for Gs\nD-O-G, nothin' but Gs\nB-A-D strictly bout cheese\nMy pockets p-p-p-p-please, nigga\nFresh as fuck and she know the deal\nBoosie bitch, she all fuck with field\nWindows up, we got douja here\nDiamond Lane, we got hoes in here\n\n[Hook]\n\n[Verse 3: Problem]\nAin't no one realer, I feel I'm the nigga\nYou cater like pillar, my captain'll peel ya, my action is iller\nI'm actually rappin' bout shit I done did, not shit I done seen\nYou don't know shit about packin' the thing\nJust to be havin' it, just to be havin' it\nOnly one bullet is in magazine\nSo, if I pop it, it got to be accurate\nLife is a song, check tracklist\nFact that I made it is fuckin' miraculous\nAll of these bitches, I make 'em do backflips\nFuck a few times and they become backflips, huh?\nYeah, real nigga, that's me!\nRun up on me, a real nigga gon' see! Nigga, ah!\n\n[Hook]", "year": null}]}