{"songs": [{"title": "Hannibal Interlude", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro: Lil Dicky]\nAnd now a message from Hannibal Buress\nBlaa, uh, sorry, sorry\nAnd now a message from Hannibal Buress\n\n[Interlude: Hannibal Buress]\nAye, mane, I'm fucking with this shit. It's good to listen to a professional rapper for once, but Lil Dicky is a horrible rap name. That's some weird shit; you got grown men having to call you Lil Dicky in the streets like \"Aye, what's up Lil Dicky. Bars man, you be spittin' bars\". That's real inconsiderate for you to make that your rap name and it's probably - Is that the worst rap name? I saw a dude named Hogman, The Intruder, no, I just made that up, but it's it's not the worst rap name I've heard at all, man\n\nHere's some tips if you rappers wanna be more professional:\nFirst of all, stop rappin' over your own vocals at your concert. Clear your goddamn instrumental and rap over it, I don't wanna hear you rappin' over your raps, muthafuckas. Also, stop have thirty five people on stage - who are these people?! Are you travelin' with these people or did you hire them locally? Did you pay for their travel? Get all of those muthafuckas off of the stage. It's confusing. I don't like it. You can't do that at other jobs. You can't be an accountant like \"Hey I'm about to do your taxes, here's my thirty friends just standin' around doing nothing while I do your taxes\"; fuck outta here\n\nAlso, stop talkin' 'bout the same shit. I don't think you have a fresh take on havin' money. I'm tired of hearing about it, I don't, I don't think it's interesting. These muthafuckas need to mix it up. I think I've heard every perspective on havin' money or I used to have money and I oh I got money, I didn't have money, I got more money than you'll ever get, I never thought I would get this much money, I had money now I'm getting more money. Stop getting soo many chains. You don't need that many chains - you only need one chain. Or if you're 2 Chainz, you can have two chains, but not more than that"}], "artist": "Lil Dicky"}