{"artist": "WC", "songs": [{"year": "2007-08-14", "lyrics": "Baby say she wants a ganster\nBut she dont want a nigga to dog her\nJust to beat it up harder\nSad that a nigga is a simp, his dick is limb\nThe sucker for love type and he dont fuck right\n\nFuck it, ill be the dick on the side you can ride on\nNigga you can wrap them thighs on\nLet your nigga wear the cape, i just want to undress you\nCall me captain dick to the rescue (ba baba bah!)\n\nI know your kind, bitch paid got a hair lay\nBallin ass nigga way paid\nTreat your ass right and keep you icy\nThough you toss you legs up for a nigga like me\n\nAffiliated. just the way you love it (just)\nAnd i dont need money to touch it (naah)\nMy ghetto ass ways is enough to make yo ass bend over\nEven destiny's child claims they need a soldier\n\nKnow you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nEvery girl you need a dick on the side (dick on the side)\n\nKnow you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nEvery girl you need a dick on the side (dick on the side)\n\nKnock knock who is it? the titty mangler\nDick dangler (who) the tight pussy fanger banger\nPacking his heat yall with two meat balls\nSmothered in dick sauce\nDont make me spit on your lip gloss\n\nDub gorilla P-I-M-P, S-I-M-E. anti S-I-M-P\nI know you got a situation i come with no attachments\nConsider me your walking dildo gadget\n\nYou niggas are weenie let me do my thang with it\nLet me feed you this big black hot link with a vein in it\nHave you saying Dub came with it\nIm guaranteed to make you come more than once if you can hang with it\n\nThe cock doctor, pussy popper, i leave yo clitoris vibrating\nTicking like a pop locker\nAnd when its time to creep dont sweat\nHut the ways in the cut i got a suite on deck near\n\nKnow you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nEvery girl you need a dick on the side (dick on the side)\n\nKnow you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nEvery girl you need a dick on the side (dick on the side)\n\nHarder than a dry cookie my dick is like the antidote\nCuring your unsatisfied pussy\nLook. i got you laughing and blushin\nCause with him you hugging\nBut with us it ain't nathan but fucking\n\nI know you need a dick on the side\nSo i kicks in and play my position off the bench like the sixth man\nAnd i ain't bringing feelings to be your lover\nJust Lays potato chips hot sauce and magnum rubbers\n\nMany niggas trying to holler but they out of luck\nCause like bitch niggas can't keep they mouth shut\nBut im a cool nigga like ray charles\nI play blind when you leave, your secret is mine\n\nDub C the wreckelest{most wreckless}, dick specialist\nMy back stroke will leave your head spinnin like the exorcist\nIm like the dick in the glass when your lonely like a fire estinguisher\nEmergency use only (yeah)\n\nKnow you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nEvery girl you need a dick on the side (dick on the side)\n\nKnow you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nGirl you need a dick on the side (dick on the side)\nEvery girl you need a dick on the side (dick on the side)\n\nDub gorilla P-I-M-P, S-I-M-E. anti S-I-M-P\nBlack, ashy, nasty python grab hold of his bald head snake bitch\nDub gorilla P-I-M-P, S-I-M-E. anti S-I-M-P\nBetter hide that pussy bitch\nBrrrrrr beat that muthafucka up like drumline that pussy is mine", "image": "https://images.genius.com/d4ed6bd2c7a379500fac9a01a4457d66.300x300x1.png", "album": "Guilty by Affiliation", "title": "Side Dick"}]}