{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/21bdd915768bba8a4230188219c45f1d.630x630x1.jpg", "title": "Girlfriend (Remix)", "year": "2017-08-07", "album": null, "lyrics": "[Intro: Kap G]\nWhy the fuck this bitch texting my phone?\nYou're not my girlfriend\n\n[Chorus: Kap G]\nI just took a flick with your girlfriend\nI been kickin' shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna to tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\n[Verse 1: Kid Ink]\nYou shouldn't have let her out if you don't trust your girlfriend\nShe say she roll swishas so I let that girl sit\nI don't need your bitches 'cause I got my own hoes\nPrince of my city and she [?]\nRun it up, run it, run it like Jackie Jones\nShe told me sign her titties and I never folded\nI can't lie, that ass curvy like macaroni\nI might hit you if she throw it at me, back and forth\nBy the waitress, keep on bringin' Aces by the cases\nThen it's time on the AP, pass it to her, tell her face it, that's your problem\nThis your night and she gon' never get ignored\nWhy you mad at me? I ain't even let her in\nI ain't even know that's your girlfriend\nBut I could kill the pussy like I'm Persian\nShe like the tats on my face like Birdman\nKnow I stay in my bag, nigga, Birkin\n\n[Chorus: Kap G]\nI just took a flick with your girlfriend\nI been kickin' shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna to tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\n[Verse 2: Kap G]\nGet out my lane, that's candy paint\nTook out the brain, I'm at the flame\nWe not the same, Louis V frame\nLook where I came, from Marta trains\nLook at my game, I'm like King James\nI'm making movies, just like the Wayans\nFuck what she sayin', she want a ring\nPimpin' ain't easy, Big Daddy Kane\nBaby don't even know yo name\nHundred on the dash like I'm Dame\nShe wanna take trips to Romane\nCall me David, I'm the one to blame\nI can't even do it, babe, sorry, I can't even lie\nWhy you tryna fuck with me babe? You got another guy\nShe said, \"Can I come again?\" Maybe, girl, another time\nTramp stamp on her back, what is that a butterfly?\nBlowin' on the gas from the Amoco\nI just hit yo girl in my Polo Pajamas tho\nGotta stay strapped like I'm Rambo tho\nAnd she thick and she pretty (like who?) like Amber Rose\n\n[Chorus: Kap G]\nI just took a flick with your girlfriend\nI been kickin' shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna to tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend"}]}