{"songs": [{"image": "https://images.genius.com/def92196a0e23158a8cd127e3dde6217.470x470x1.jpg", "album": "The Hybrid ", "title": "Cartier", "lyrics": "[Verse 1]\nCatch you slipping with them all white Buffies\nTake that like Puffy\nI'll leave a nigga with some shit stains\nLeave blood stains all on them wood frames\nCatch you slipping with your feet up\nNigga, fuck that, even beat your bitch up\nCatch you walking 'round North Lyn with Ye's on\nRun up on her, snatch those, now they gone\nI can get 400 for these wire frames\nFresh out the box, no scratches, mayne\nReal deal, dog, no fake shit\nTransition lens, nigga take shit\nSeen a nigga with them old school Mayfairs\nCaught a two piece, at the state fair\nSeen a nigga at the Coney with some ice in him\nNow the doctor tryna put some fucking life in him\nThat's how it is in the city of the motor\nWhere a nigga doing what he gotta do to get a quarter\nDime, nickle, penny, automatic, semi\nCatch a nigga with them Cartiers and I'm like \"Gimme!\"\nThat's why we four deep in this Regal\nBanging \"Rock Bottom\", dirty Desert Eagle\nFinna hit the club, you know what's up\nYou got some Cartiers, you getting fucked up\n\n[Hook]\nAnd we going in the party and we snatching niggas Carty's\nI say we going in the party and we snatching niggas Carty's\nWe going in the party and we snatching niggas Carty's\n\n[Verse 2]\nI seen a pair of woods, 22 hundred\nI seen a nigga with 'em, I told that nigga run it\nI leave a nigga dalmatian for them Malmaisons\nFor them Rosewoods, roses where you stood\nAnd I think them wood frames better on me\nSold 'em for six, coulda got a G\nYou think you real, G? That heater on your ass\nLose your life over Cartier glasses\nI'm where you get caved over shades\nWood on your caskets, flower on your graves\nYou think 'em wire frames shining?\nI'll be at the pawn shop before this rhyme end\nAnd I'm 'bout to get cake\nCome to find out that this nigga glasses was fake\nIt's all good, G, it's aight\nThat's why I'm 'bout to hit the club tonight", "year": "2010-03-16"}], "artist": "Danny Brown"}