{"songs": [{"year": "2017-08-29", "image": "https://images.genius.com/840a0d2a9fea5d99a34ec0557159bba0.1000x563x1.jpg", "title": "Fire in the Booth", "album": null, "lyrics": "[Intro: Roadman Shaq & Charlie Sloth]\nAre you ready for this G, yeah?\nC'mon, man, I was born ready and dat\nOkay, aight, boom\nBig Shaq, hold tight, Asznee\nScoopnum, ratnum, oosna\nHold tight the gyal dem as well, boom\n\n[Verse 1: Roadman Shaq]\nTwo plus two is four, minus one that's three, quick maths\nEveryday man's on the block, smoke trees\nSee your girl in the park, that girl is a uckers\nWhen the ting went quack-quack-quack, you man were ducking\nHold tight, Asznee, he's got the pumpy\nHold tight, my man, he's got the frisbee\nI trap, trap, trap on the road, movin' that cornflakes\nRice Krispie, hold tight, my girl Whitney (perfect)\nOn the road doin' ten toes, like my toes\nYou man thought I froze, I see a peng girl, then I pose\nIf she's not on it, I ghost, hah, look at your nose\nWhat? You dickhead! Look at your nose\nNose long like garden hose, shhh, you get me?\n\n[Interlude: Roadman Shaq & Charlie Sloth]\nBoom, man's gonna come back in (yeah, yeah)\nYou know like that? (yeah, yeah, yeah)\nYou're feelin' that? (yeah, yeah, bad, bad)\nYou dun know, I see you shiverin' and that\nDon't get shook man's here (aight)\nYou protected-ed, yeah? (aight, let's do it)\nAight, boom, let's go, boom\n\n[Verse 2: Roadman Shaq]\nHop out the four-door with the .44, it was one, two, three and four\nChillin' in the corridor, your dad is forty-four\nAnd he's still callin' man for a draw, let him know\nWhen I see him, I'm gonna spin his jaw\nTake man's Twix by force, send man shop by force\nYour girl knows I've got the sauce, no ketchup\nJust sauce, raw sauce\nBoom, yo, gah\nThe ting goes skrrrahh, pap, pap, ka-ka-ka\nSkibiki-pap-pap, and a pu-pu-pudrrrr-boom\nSkya, du-du-ku-ku-dun-dun\nPoom, poom\nYou dun know, Big Shaq, ha, yo, yeah-yeah\nAlright, fire-fire-fire in the booth\nYou get me, man's not hot\nI tell her man's not hot, hah, cot\nI tell her man's not hot\nThe girl told me, \"Take off your jacket\"\nI said, \"Babes, man's not hot\"\nYo, man can never be hot\nPerspiration ting, Lynx effect\n\n[Outro: Roadman Shaq & Charlie Sloth]\nYo, you dun know\nDun know, y-you\nYou look a bit shook, Charlie\nYou look a bit hot\nWhat's that?\nY-y-ya sweating and that again\nBrudda, man don't make jokes with me, Charlie\nAight, aight, aight, cool, yeah\nYeah, man, listen, you're-you're cool and that\nYeah, yeah, dun know\nDo you understand what I'm saying?\nYou're cool and that (yeah, yeah) but\nI know how you look ennit, (yeah) do you understand what I'm saying? (yeah)\nI don't wanna set the, you know, the goons on you\nYeah, yeah, yeah, yeah-yeah-yeah-yeah\nYou know like that? Aight, cool, don't take me for one of these boys and that, do you know what I'm sayin'?\nMan's really about it"}], "artist": "Big Shaq"}