{"artist": "Playboi Carti", "songs": [{"album": "Red", "title": "Heavy", "image": "https://images.genius.com/59ca4418e6876b3254e29bb8777967a6.318x318x1.png", "lyrics": "[Intro]\nIzzy B Productions\nAyy, man, turn me up, man\nGot my nigga in this bitch but we smoking boof all day, nigga\nBoofed up, nigga\nCarti, nigga, uh, yo\nLean (Skrrt, skrrt, skrrt)\nPlayboi Carti (Skrrt), yeah\nWhat up? Ayy, damn, oh, yeah\n\n[Verse]\nMy iPhone white and my bitch too (Hello?)\nIt's 678, who the fuck is you? Uh\nI'm all about my team, I'm all about this green\nServe a couple fiends, then we clear the scene, uh\nBaby bottle lean, your lady off a bean (A bean)\nShe laying beside the G, she trying to let me squeeze, damn\nTrue Religion jeans, my Vans say Supreme, uh\nHer head game mean, just don't touch her weave, uh (No)\nFugazi ass niggas think they own shit, uh\nI'm trying to tell these niggas, bitch, we been did it, uh (Yeah)\nFinger fuck the cunt, ten racks a month (Goddamn, yeah)\nSmoking on this blunt, I ain't stressing nothing (Goddamn, yeah)\nIf a opp pull me over, I'ma rob him up, uh (Ayy)\nOr duct tape his mouth, shut that nigga up, yeah\nThey lying about the streets, ain't seen you on the block\nKeep talking like you about it, we gon' have to mob (Mob, what?)\nLeave you boys bloody, you gon' need a mop\nShe gone ride this dick 'cause she know what I'm about (Yeah, yeah)\nI got a pint of lean, Xans by the ounce (Uh)\nI keep this shit live, they say I run the South, damn\nThey want that old Carti, fuck that old Carti (Yeah)\nBitch, I glowed up, tell my mom that I'm sorry, damn\nBitch, I'm in the 'Rari (Goddamn), my lingo retarded (Goddamn)\nShe tweaking off a molly, man, come get your shawty, damn\n\n[Pre-Chorus]\nXannies, Xannies leaning heavy\nI can't stay steady\nKush coma, why you on that reggie?\n\n[Chorus]\nXannies, Xannies\nBitch, I'm leaning heavy\nXannies, Xannies\nBitch I'm leaning heavy (Heavy)\nKush coma, kush coma, why you on that reggie? (Reggie)\nKush coma, kush coma, why you on that reggie? (Carti)\nXannies, Xannies\nBitch, I'm leaning heavy\nXannies, Xannies\nBitch, I'm leaning heavy (Playboi Carti)\nKush coma, kush coma, why you on that reggie? (Damn)\nKush coma, kush coma, why you on that reggie? (Goddamn)\nXannies, Xannies\nBitch, I'm leaning heavy (Goddamn)\nXannies, Xannies\nBitch, I'm leaning heavy (Goddamn)\nKush coma, kush coma, why you on that reggie? (Goddamn)\nKush coma, kush coma, why you on that reggie? (Carti)\n\n[Outro]\nDamn\nLean, Playboi Carti\nYeah, lean\nDamn\nSkrrt, skrrt-skrrt, skrrt-skrrt\nSkrrt, Carti, yeah, ayy", "year": "2014-02-08"}]}