{"artist": "Porta", "songs": [{"album": "Algo ha cambiado", "title": "Incansable", "image": "https://images.genius.com/f0f51bcb0fae29d805921f83eb28533d.640x640x1.jpg", "lyrics": "[Intro: Porta]\nEstoy de vuelta, decían que iba a durar poco\nQue mi futuro era incierto, que aguantar esto es cosa de locos\nHe vuelto para quedarme, os advierto\nA más de uno voy a dejar boquiabierto, lo noto\nAlgo habré hecho bien, si todavía hay quien me quiere muerto\n¿O acaso me equivoco?\n\n[Verse 1: Porta]\nYa no soy un niño, niño deja tus posturas\nVuelvo una vez más, me necesita esta cultura\nMás de la mitad de lo que se hace hoy es basura\nEstoy seguro de mi ya no necesito armadura\nTengo cicatrices, de puntos de sutura\nY es mentira eso de que todas las heridas se curan\nLos mc's no se creen ni ellos mismos lo que juran\nA putas como tu no quiero verlas ni en pintura\n¿Amor por el hip hop, o amor por el dinero?\nHablas de principios y ni a ti te eres sincero\nEn todas tus canciones dices que eres verdadero\nVas de duro con palabras, pero no eres un guerrero (ya)\nSolo mírame a los ojos, no encontraras miedo\nLucho con mi ego, es puro fuego\nOrgulloso de lo conseguido en este juego\nPero algo ha cambiado, desde luego, solo escucha como sueno\n\n[Puente: Porta]\nNunca agache la cabeza, nadie tumbo a este titán\nMe conozco todos tus golpes y se por donde vendrán\nSigo de una pieza, soy una rareza man\nY agarro el timón con firmeza, porque soy el capitán\n\n[Verse 2: Porta]\nYo, nunca dependí de nadie, solo de mi\nTu, quieres conseguir ser como yo, uno de los grandes\nSiempre tengo un plan b\nMe la suda que me llamen comercial, vengo del under\nVan de que han inventado el rap y nada más lejos\nPorque este genero es libertad y respeto\nConcreto, aprender a rapear no tiene secreto\nHe llegado arriba, yo cumplo lo que prometo\nY vuelvo, si, justo en el momento oportuno\nAlgunos pueden llamarme \"bro\", pero tu no\nYo a Mc's como vosotros me los desayuno\nVoy a escalar hasta llegar al numero uno\nY eso que vengo desde abajo\nVen, si no soportas esta presión ? La pasión se vuelve un trabajo\nVes? Bajo luces de neón ojos quieren que falle\nSé, que tu obsesión no es mas que aparentar ser de calle\nTengo la cabeza en alto en suelo los pies\nEmpecé a perder el interés\nCritícame pero no me vengas después\nY \"cuidao\" con lo que inventas, porque la vida da vueltas\nY puede ponerla tuya del revés", "year": "2014-06-10"}]}