{"artist": "Angie Martinez", "songs": [{"title": "Live At Jimmy’s”(feat. Big Pun, Cuban Link, Domingo, Sunkiss", "image": "https://images.genius.com/640767a123d7da2b7b75c5a07ab025a4.355x352x1.jpg", "album": "Up Close and Personal", "lyrics": "ANGIE MARTINEZ\nMiscellaneous\nLive At Jimmy's\"(feat. Big Pun, Cuban Link, Domingo, Sunkiss\nCorazon, (?) aiy aiy esta Angie Martinez, 'ta Cuban Link y Domingo\nUna cosita aiy que te voy a poner para los pie\nA sete bailar, tu ve el berau; va se congio, tigeraso..\n\n[Chorus]\nJimmy, \"Copa Cabana,\" in Miami, Little Habana\nAiy.. Latin Quarters, la Gran Manzana\nWe're gonna party hasta por la manjana\nAiy.. Santo Domingo - tomando Mama Guana\nGozando en Colombia, Venezuela y la Bahamas\nAiy.. Costa Rica, Perú y Ti' Juana\nVen con migo mami, porque esto nadie lo para\nAiy..\n\n[Angie Martinez - overlapping Chorus]\nUhh, uhh, uhh, yo yo, yo\nBubble heavy in the club, double Henne' in the cup\nTrouble and merengue make you move yo' butt\nGot the fella's goin' nuts, girl it's too much\nGot me four numbers already, the night's still young\nPapi work the room, 'mance 'em like WHAT!\nMami got no shoes, hair done like WHAT!\nMe, you - speed through\nYeah, yeah good to meet'cha; how you doin'?\nAfraid to be the one baby take it floor\nDon't say nuttin' dumb, maybe we could do more!\nCause it's our night and it's okay!\nWork hard - okay now we ready to play!\nAnd the J, the I, the M, the M, the Y, the J, the I, the M\nAt Jimmy's.. at Jimmy's!\n\n[Chorus]\n\n[Verse Two]\nUhh.. creep to yo' block in the black Cadillac\nYou could go wit' a grey Mac, BRRRA!\nRun, duck; son, what the fuck?\nSee my tattoo, got Pun on my gut\nBag yo' chick; give a nun a million bucks\nCurse me out, call me a bum and a slut\nCause I bust quick like a ton in a cut\nThen I broke out wit' more guns in a stro'!\n[Cuban Link]\nYo, yo..\nAin't nuttin' stoppin' us from droppin'\nAnd rockin' the whole and droppin' us\nThe lockin' this down, strait up and down\nWe too hot to miss, we got the shit to make 'em loose it\nThey can't refuse it\nCause it ain't nuttin' like hip hop music!\nNew shit! Took a merengue beat loot it\nExclusive, it died down, this shit stupid!\nWho's this? Cuban Link, no te asuste!\nDon't mean to drop the bomb, I got the fuse slit\n\n[Chorus]\n\n[Angie Martinez - overlapping Chorus]\nWhoo, whoo.. hey!\nStro' like swellin', smoke everywhere\nDance all sudden, hands in the air\nPar in the back, ballers in the rear\nFind me 'round there, bottles by the beer, yeah\nAll right cause it feels real good\nAnd good wood from a nigga in the hood\nLadies - shake it, shake it real girl should\nLet it be understood\nThat I'm wit' my friends and we ready to go\nConnects wit' (?) to Santo Domingo!\nAnd I, won't west 'til I poppin' at the show\nWatchin' all my people shoutin' \"Go, ma, go!\"\nSo get it up, get it up (uh-oh, uh-oh!)\nShake it down, shake it down (uh-oh, uh-oh!)\nIf we havin' big fun (uh-oh, uh-oh!)\nIf you rep' Big Pun (uh-oh, uh-oh!)\nC'mon..\n\n[Chorus]\n[Big Pun]\nBoriqua, morena; girl I wanna take ya back to Cuba (Cuba)\nHabana (Habana), c'mon you pretty mama\nJamaica, Puerto Rico or Santo Domingo\nWe could take it there!\nYeah, yeah; and put yourself try a player result\n\n[Chorus]\n.. and put yourself try a player result..\n.. and put yourself try a player result..\n.. and put yourself try a player result..\n.. and put yourself try a player result..", "year": null}]}