{"artist": "88-Keys", "songs": [{"album": "Adam’s Case Files - The Mixtape", "lyrics": "[Hook]\nI talk to my baby on a telephone long distance\nI never would've guessed I could miss someone so bad, yeah\nI really only met her bout a week ago\nBut, it doesn't seem to matter to my heart I know\nThat I love her\nI'm hoping that I never recover\nCause she's good\n\n[Verse 1:KiD CuDi]\nShe's so cool, shes so hot\nBut a scholar she's not\nWord, she pretty, pretty but she's dumb as a rock\nBut honestly see she's all that I got, and what not\nShe very genuine and very feminine\nBut when we on the phone I think her brain is sleepin in\nI try and tell her friends but they as dumb as her\nBirds of a feather I guess, but see that makes it worst\nI hit her up to say whattup she said \"the sky\"\nI say what's good she said \"mcdonald's apple pie\"\nI try to justify it but she ain't get the lingo\nBut then I peep she ain't sleep I date a bimbo\nWhy oh why\nWhy must she be so damn fly\nThen turn around and be so dumb\nWhere the fuck this broad come from?\nSee I don't understand\nHow it happened man\nHow did this occur the whole realtionship is blur\nI even need to quit smokin my weed\nOr make surely she got a GED\n\n[Hook: Kid Cudi and 88keys]\n(Only met about a week ago, but a little bit busy on the telephone)\nShe's so fine, see we talk all the time\nBut sometimes I think she's missin her mind\n(We only met about a week ago, but a little bit busy on the telephone)\nShe's a dime, and she's faithfully mine\nBut something wrong with her head cause she ain't the sharpest tool in the shed\n(We only met about a week ago, but a little bit busy on the telephone)\nShe's so fine, see we talk all the time\n\n[Outro: Kid Cudi]\nYou know I called her\nAnd I was just like, damn like she sounded so dumb as hell\nLike she ain't got no fuckin brain, you know what I mean?\nAnd I'm just like, your wasting my minutes and shit!", "image": "https://images.genius.com/04b97c8f6b1aebe77e0fca3a907694d7.300x300x1.jpg", "year": "2008-06-11", "title": "Wasting My Minutes"}]}