{"songs": [{"title": "Four", "lyrics": "Four chains I want four mo\n44 with a four door\nOld hoes I want four mo\nSix golds I put four mo\nJack money that 44\n34 hundred get you a four, shit I'm talkin bout a four\n(Repeat)\n\nWe sold dope, we skip court, we flip coke\nWe took trips on big boats\nI'm high as fuck behind locs\nIt ain't no acting fuck the make up\nGo losing bands\nShout out my four way for the make up\nWe takin out plugs around my way it ain't no re-up\nEverything profit niggas get snatched up out they jacobs\nEarrings and braclets, my young bruhs can taste it\nWhen Nate Dog and VL get home, we going ape shit\nPull up in a four door, with four hoes in a four way\nWhite Bronco behind me, four choppas no it ain't OJ\nPull up on they side door, when we pull that slide door\nNiggas let them , ooooohh, we letting them K's go\nI'm talkin bout a four\n\nHook(Repeat 2x)\n\nOn the low low, my benzo got four doors, got four hoes\nYou know how I do, Ashanti, no Mo Mo's\nChoppa on front seat, on front street, I'm loco\nTry him he pop you, you that sure? I know so\n2-4 thats snow low\nFour hundred that's fosho\nWhat they rapping bout that's yo life\nStreet nigga that's for life\nMy jeans and my draws and that bag that four way\nThat white chick, that tan broad, that gaga, that Norway\nFourth ward that BP, you pull up in that power 8\nAudi blue with the top off\nRed dawgs on that haterade (Whoop)\nMiddle of the block doing donuts, yeah bitch I show off\nWhat they hittin for? That 3-4\nYeah bitch that's four soft\n\nHook(Repeat 2x)\n\nGot a Benz coupe with four doors\nTrap spot with four stoves\nWhat it do? What they hittin for?\nMade a buck 20 off four shows\nGot a white bitch, and a black bitch, and a hood bitch with four golds\nI forgot one I got four hoes\nGot one child he a four year old\nRemember gettin my 1st four, remember sellin my 1st blow\nRemember buyin my 1st J's, remember hittin my 1st dro\nFour 9's in the whole thang, four real niggas in the whole game\nKnow I'm one, what it do Alley, got 3 bracelets and 4 chains\n8 watches and 10 cars, 1000 grams and 12 bars\nFor life I'm for real, you had 4 bricks and got 4 years\nYou a fuck nigga you a rat nigga, trap nigga know I'm strapped nigga\n400 bands, I bought myself out my contract nigga\n\nHook(Repeat 2x)", "album": "The Real Is Back", "year": "2011-07-26", "image": "https://images.genius.com/49ea416b94fcf582ca9877e42c2bad2b.1000x1000x1.jpg"}], "artist": "Jeezy"}