{"artist": "Post Malone", "songs": [{"album": "beerbongs & bentleys", "title": "Otherside", "image": "https://images.genius.com/5f219498aca9f4c88e221a3b63d0a773.1000x1000x1.jpg", "lyrics": "[Chorus 1]\nI been waitin', wide awake for the waves to come and take\nTake me right to you\nOne hundred bottles of the good shit couldn't even bring you back\nWhat am I to do?\nFeel like I'm circlin' a drain, all I see is the remains of an ugly truth (Of an ugly truth)\nOne hundred models I could follow all the way to hell and back, but they can't replace you (They can't replace you)\n\n[Bridge]\nOh, oh, oh, ohh\nOh, oh, oh, ohh\nOh, oh, oh, ohh, ohh\nOh, oh, oh, ohh\nOh, oh, oh, ohh\nOh, oh, oh, ohh, ohh\n\n[Verse 1]\nI was puttin' on for you like a jersey\nWhat I didn't know then couldn't hurt me\nNever thought that you'd go and do me dirty\nLeft me in the cold, but on the inside I was burnin'\nBut that's just the way it goes\nWish that I could have control\nEverybody dies alone\n(And I ain't dead yet)\n\n[Refrain]\nSay my prayers, but I lost faith a long time ago (A long time ago)\nDream nightmares\nI guess we're gettin' used to losin' hope (Guess we're losing hope)\nI don't even wonder why you don't answer when I call your name\nAre you on the other side? Will you save us?\nOr will you run away?\n\n[Chorus 2]\nI'm still waitin', wide awake for the waves to come and take\nTake me right to you (Take me right to you)\nOne hundred vials of denial, I know they won't bring you back\nWhat am I to do? (What am I to do?)\nYou’re my alibi and motive when I'm lyin' to myself, what an ugly truth (What an ugly truth)\nWe’re no strangers to the flame\nWe will never be the same if we make it through (And we can make it through)\n\n[Verse 2]\nMy back is up against the wall\nBut I used to feel invincible\nYeah, it was us against the world\nBut somehow, someway, the tables turned\nI remember back then\nPlayed my cards right you were my best hand\nStill you keep me guessin'\nWonder if I'll ever get the message\n\n[Refrain]\nSay my prayers, but I lost faith a long time ago (A long time ago)\nDream nightmares\nI guess we're gettin' used to losin' hope (Guess we're losing hope)\nI don't even wonder why you don't answer when I call your name\nAre you on the other side? Will you save us?\nOr will you run away?\n\n[Outro]\nAre you on the other side? Will you save us?\nOr will you run away?", "year": "2018-04-27"}]}