{"songs": [{"album": "You Can’t See Me", "image": "https://images.genius.com/557d437bf932b93b08ec3950a791448a.600x600x1.jpg", "year": "2005-05-10", "title": "This is How We Roll", "lyrics": "[Hook: repeat 2X]\nWheels is shinin.. deals we signin.. money's pilin..\nLow, this is how we roll\n\n[John Cena]\nCatch me in the black 'llac truck with the pickup back\nThe game weak, I'mma pick up slack\nHands high like a stick-up jack, fuck your boring rap\nThis East to West coast hittin like Warren Sapp\nI'm fully focused, I walk with a purpose\nY'all are fuckin clowns, you belong in a circus\nThis is big bid'ness, we don't stop 'til the money home\nBlock shakin more buzz than a honeycomb\nAnd I'm a savage in the booth\nI'm on some movement shit, about to rally up the youth\nNumber one seed daddy walkin through the playoffs\nYou better quit rappin 'fore I start makin layoffs\nFuck a day off, I'm movin heavy for the payoff\nYou don't ride to this? We don't need you, stay off\nHate on this? I don't care what you said\nY'all can choke on a shit sandwich with no bread\n\n[Hook]\n\n[Tha Trademarc]\nI don't smile as such, buddy, ain't much funny\nYou touchy girlie rappers claimin that you fuckin gully\nI live poor but look rich, I hit raw, you look bitch\nYou love me, that's why you got your style from me\nMost sayin Marc Predka's overconfident\nIt's only cause they jeally that my profile is prominent\nThe dominant factor is the money I'm after\nYour opinion ain't mean shit buddy - I ain't ask ya\nIt's gon' be what it's gon' be\nIt is what it is and was what it was so watch ya wordplay\nTrademarc lay you where the buzzards and birds play\nI write rhymes 'til ya boy is heard mayne\nCause alls I got, is my voice and word\nSophisticated rapper the dapper lover the don\nIt's on baby pah yeah word is bond\nCut the check and I'll rock, every word of the song - what now?\n\n[Hook]\n\n[John Cena]\nYeah, yeah... yeah\nI got that velcro flow, I'll make you stick to this\nSo many zeroes, my monetary is ridiculous\nA glass of Chardonnay doesn't whine like you\nI'm an Altered Beast with Einstein's IQ\nPlus I shine bright too and I ride right through\nIn a leaned out, old school, skylight blue\nI don't think there's a player nicer\nKeep your Cristal, I'm shoot Jagermeister\nFoot to the floor and you ain't you keep the pace\nThrow me a whore and call me Kobe cause you know that I'mma beat the case\nI buy some land, and never even see the place\nVegeterian chicks, go on givin meat a taste\nThrow away money like I hate on loot\nCopped your CD it sounds great on mute\nWords turn 'em to dust makin MC's disintergrate\nMy name get traffic like the California interstate, what?\n\n[Hook]"}], "artist": "John Cena & Tha Trademarc"}