{"songs": [{"year": "2011-02-15", "title": "And the Winner Is...", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Verse 1-Saigon:]\n[Fades in]... claim many lives with semi.9's - from guys, [crowd ovation]\nInnocent ladies, babies of any size. [crowd ovation]\nNah, I knew it wasn't the truth. - Cause they ain't have nothin' for proof!\nThey even blame you for dozens of youths in substance abuse!\nWhat kinda crap is that?\nEverybody know that crackers brought crack to a habitat - to attack the Latins and Blacks\nNever mind that fact, son; and I know it's wrong! [crowd ovation]\nYou was there when my hopeless mom put me out in the coldest storm\nEven though you did introduce me to Smoke and Tron\nAnd totin' one, [crowd ovation] - you welcomed Saigon - with open arms!\nThat's all I could focus on\nThe reason I wrote this explosive song, - to show [scratches] even the closest born! (look!)\nGet torn! (get torn!) [crowd ovation] - You tricked me all alooong\nYou had me thinkin' you was my friend; you NEVER loved Saigon! (Saigon!)\n\n[Chorus: Saigon]\nWith friends like you, who needs enemiiees? (enemies...)\nBrought a nigga bad luck like the Kennedy's! (Kennedy's...) [crowd ovation]\nYou had a nigga ASS UP in the penitentiary, [crowd ovation]\nWith friends like YOU, who needs enemiiees? (WHO?!) [x2]\n\n[Verse 2-Bun B:]\nYou was my homie! - My ace boon coon, my real roadie. (roadie!)\nCalled you my right hand, the Poot to my Bodie;\nFor sho'! - My true whodie! - We was closer than my own kin, (kin!) [crowd ovation]\nWe saw this thang come and both of us would zone in. (in!)\nThey knew when they saw you, - they saw your boy, too. [crowd ovation]\nTighter than jail dap, - would always see your boy through. [crowd ovation]\nSunup to sundown, (down!) - winnin' them fistfights\nI'm lettin' my gun sound, you was the main one round! (round!)\nWe held the corner down. (down!) - We held the wall up; (fo' sho'!)\nI knew you'd be there so I never had to call up! [crowd ovation]\nStep out on the cut, shit! - There you would be\nAt late night or broad day and didn't care who would see\nWe was day for day in the trap, (trap!) - and out on the grind, [crowd ovation]\nUp to the point where them haters (what?) - ran up from behind! [crowd ovation]\nTurn out the whole time, (time!) - that you was straight frontin', (frontin')\nCause when they shot your boy up, - you just laid there and ain't say nothin' (nothin'!)\n\n[Chorus]\n\n[1: 22 minutes instrumental, then beat stops]\n\n[Outro 1: Female]\n[Crowd ovation] And the winner for best rap performance is...\n\n[Outro 2: Prison Guard]\n[Knocking]\nINMATE 9680-549, YOU ARE HERE TO REPAY YOUR DEBT TO SOCIETY...\nNOT TO SLEEP AROUND ALL DAY!\nWHAT DO YOU THINK THIS IS? A HOTEL?!\nGET UP... NOW!\nON THE COUNT!\nEVERYBODY ELSE'S ON THE LINE WAITIN' FOR YOU!\nON THE COUNT!\nLET'S GO, MOVE IT!", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}