{"songs": [{"year": null, "album": "He’s Keith Murray", "image": "https://images.genius.com/7e796a2b47ce739fd258b02f553d744e.800x800x1.jpg", "title": "Sucka Free", "lyrics": "[Verse1]\nMeet the villain with a thousand faces\nI'll stab you up in a thousand places\nI might catch you with a blade or a rap\nCause it's always more than one way to skin a rat\nThem young boys fucking up hip hop\nWe've always been original get your own props\nI show up in boots to your black tie affair\nAnd physically put this funk up in your ear\nI got friends in all the low places that keep me high\nAnd we be up all night just like the red eye\nI never sleep like nueva york\nMiss me with all that body waste she's talking\nHit me with your best shot fire away\nI'm da super easy minded MC OK!\nI'm skin tight and knee deep shit\nSo long on you both my feet fall asleep\n\n[Chorus 2X]\nI know you know what we got to do is\nTake it to the limit with so much force\nTell dem niggas get sucka free or get lost\nI know you know what we've got to do is\nTake it to the limit with so much force tell them chicks\nGet sucka free or get lost\n\n[Verse 2]\nSo it comes as no surprise\nNigga you snooping around like a private eye\nBut idiot the victory is mine\nYa niggas can't chew gum and walk at the same time\nYou stupid but it ain't no crime\nYour third eye is blind well a aight then fine\nI will hit ya pussys and make you fart\nWith enough energy to make a car start\nI stay crispy you dissed me you pissy\nI'll stomp you out like Hannibal did in Sicily\nIt's Keith and I got to be a mighty mighty MC -c-c-c-c-c-c\nYou a savage kid you might as well run around with a pet pig\nI see a ugly chick and she's scoping\nAnd I'm like got damn who left the gate open\nMost prominent and dominant\nShittin like I'm like lactose intolerant\nMeanwhile I hopped the turnstile\nWith the L. O. D. Ichbabod Crane style\nI stepped into some shit them wiped it with my hand\nSee that's what makes me who I am, goddamn\nNo if and buts or maybes\nYo! E this shit is crazy baby\n\n[Chorus 2X]\n\n[Verse 3]\nOH! That's how it is, that's how you living\nI consider all ya as my children\nFunk like feet collardgreen and chitlens\nI stole your girl while I was in prison (no you didn't)\nYou can ask E cause he brought her up to see me\nKeith you can't smoke weed, man pass the light\nMy probation thing is gonna be aight! aight!\n\n[Chorus 3X]"}], "artist": "Keith Murray"}