{"artist": "C-Rayz Walz", "songs": [{"title": "Progression - The Dookie Def Shit", "album": "Off the Radar: Exclusive Lacerations", "year": "2003-09-25", "image": "https://images.genius.com/45bc71d58be69256a0b5f9c5f3abc51d.1000x1000x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nDJ Noise.  DJ Noise.  Exclusive.  C-Rayz Walz.  C-Rayz Walz.  C-Rayz Walz.  The Sun Cycle.  What up, Denmark?\n\n[Verse 1: C-Rayz Walz]\nI smack kids with rap tactics by the casket\nBury you backwards—you’ll be ass out, faggot\nI’m cold as ice.  Hot like your moms when she page me\nI’m a fire sign—how you gonna blaze C?\nYou look like a pussy—I should call you fuckface\nYou couldn’t dodge my punchlines if you had duct tape\nLike drugs, all I’mma do is fuck you up\nYou’re shit’s not that hot, kid.  Bless you, but\nI’mma give you a facelift and beat your ass\nTo make you walk through Brownsville with a Bill Clinton mask\nBut you a bullshit character in BC form\nTake your eyes out, put ‘em on my porch—see what I be on\nPeon, I’ve been doing this shit for eons\nBut money don’t change nothing, right?  Ask Dion\nCops be watching me like Blank Panthers in the neon\nLocked out my house for moving keys wrong (Stupid)\nYou can’t catch me, so don’t test me\nI’m the gingerbread MC who fled with jet skis\nLet’s get free before you rock ice like Gretsky\nImpress me, blaze trees on an Express D\nBy kicking a freestyle and catching a scratchie\nThe mic’s a dookie rope chain yelling, “Snatch me!  Snatch me!”\nI pad Maxis, do math in bad taxis\nSmash Fat Beats through my path like Mad Max feet\nMy style’s water—I Spring Poland.  Keep talking\nI punch you in the throat.  You can’t cope—you’ll speak swollen\nYou got flames, you got game, but seem butt enough\nTo be bitch slapped by Xena\nAnd you could cream Puff like Sean Combs’ bank accounts\nBut I seen enough shit in this rap to make me bounce (What?)\nReminisce of clear, crisp but hear this basic flow\nI put holes in the game just to lace it, yo\nA sick tool click—the whole industry screwed up\nI roll with great MCs that keep a tape queued up\nBoot butt, put your lights out, run in your sessions\nSplit blessings, steal Sharpies and whiteout\nSalute to small vinyl.  Wild like bulletproof vinyl\nStronghold alliance.  The world’s full of psychos\nC-Rayz Walz used to be 180.  Still get busy\nThis time, sixteen bars leave you dizzy\nI used to rewrite hooks.  Now I just hook right\nControlling tempo like a point guard with nice looks, aight?\nYou ain’t prepare ‘cause this is what you scared of\nI’m loud like mankind, write without the weird glove\nIt’s a must I drop the dookie def shit\nSkeptics get wrecked with my electric effort\nEnergy session, total concentration with blessings\nBassline kick with powerful impact progression"}]}