{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Bored", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1]\nMais uma batida na minha vida\nTipo uma chica que eu adoro mas nunca me liga\nSinto a vida a bater palmas, o som acabou\nTa na hora de ser real, reality show\nSinto a cam a filmar, perdi o guião\nVou ter de improvisar num filme de acçao\nSem duplos, sem takes, so esta conexão\nA uma vida que me leva de arrastão\n\n«i mean, why is that?\nI mean, is it just because people are lazy today, are they bored?\nAre we just like bored, spoiled children\nWho's just been layin in the bathtub all day, just playing\nWith their plastic duck, and now they're just thinking \"well, what can i do?\"»\n\n[Verso 2]\nNão se assustem, não! eu vou tranquiiilo\nUns cospem em vão, eu dou pa grilo\nDentro de um pinóquio que so diz «fuck you»\nTou esgotado, fora de stock, no meu spot i got you\nRapper lógico, sou filho do spock\nLive long and prosper, mic check pa que? sou bot\nFaço star tracks de hip-hop\nPosso dar as backs no bote\nPq eu locko essa shit ate parece que sou cop\nLanco misterio, hitchcock\nSmp a viajar no beat tipo trip-hop\nTriplico o meu skill smp q a minha shit dropa\nFuck vinil, sou digital, cada bit é meu tropa\nNota q'a nota vem e a nota vai\nE q'a bolota só sobe bem qd a nota sai\nE tudo ocorre a quem corre bem, mas eu só sei fly\nMas tou agarrado a uma chain e dela não saio ma nigga\n\n«we're bored, we're all bored now... but has it ever ocurred to you that the process that\nCreates this boredom we see in the world now, may very well be a self perpetuating, unconscious form of brainwashing\nCreated by a world totalitarian government based on money? and that all of this is much\nMore dangerous than one thinks? and this is not just a question of individual survival\nBut somebody who's bored is asleep, and somebody who's asleep will not say no?»", "year": "2014-06-06"}]}