{"artist": "Papoose", "songs": [{"album": "Underrated", "title": "3rd Eye", "image": "https://images.genius.com/f554df8669b07b723949bb7564bc0ace.1000x1000x1.png", "lyrics": "[Intro]\nYour smile\nStatik Selektah\nCan't disguise- 'guise- 'guise-\nPapoose, Papoose\n\n[Verse 1]\nTrump claimed Black and Latino employment is at the lowest ever\nHe can't fool the smart people 'cause we be knowin' better\nYour claim to fame is false, null and void\nHow can that be true when the young is unemployed?\nThey don't have High School diplomas, you annoyin' fool\nNot only are they unemployed, they unemployable\nKanye West said slavery was a choice\nBut he should be muzzled without a voice\nThe oppressed doesn't have a choice whether they eat shit or steak\nThe oppressor makes all the decisions on your plate\nEat shit because they shitted on entirely\nAnd they don't have any stake in society\n\n[Break]\nThey came together from the corners of the world\nCorners of the city\nCorners of the street\nThere's a difference between raisin' kids and savin' kids\n\n[Verse 2]\nGaddafi had a plan to garner the gold market\nSo the U.S. murdered him, they heartless (Damn)\nSlavery never ended in Libya\nThey only publicizin' it now 'cause they trickin' ya\nIt only ended in American 'cause we disputed (Facts)\nFought back, Civil War, Civil Rights movement\nPutin helped Trump in the elections\nSo he could lift his sanctions on his deal from Exxon\nFive hundred billion, they don't think we know?\nThe Secretary of State was a Exxon C.E.O..\nI watch people I respect (Respect) squirm for respect\nFrom people who don't even acknowledge 'em in the flesh\n\n[Break]\nAll my life, American has always taught me to raise the children and save America\nNow, we talkin' about raisin' America\n\n[Verse 3: Papoose]\nI don't care about the rhymes that you wrote wit'cha pen\n'Cause my lyrics written in stone, yeah, I molded 'em in\nWhen God made me, he broke the mold, chosen to win\nPapoose takin' over again\nThis generation is lazy, I'm tired of holdin' it in\nInstead of gettin' liposuction, why don't they just go to the gym? (Facts)\nMoney is a tool, somethin' for you to use\nA man that disagrees with that is just a fool\nYou think cash gives you authority? That's cruel\nMorals, values, and principles, that's the rules\nExperience is the best teacher you could choose\nTo have a lot of class is cool, life is a school\n\n[Outro]\nCan I get a witness here?", "year": "2019-02-15"}]}