{"songs": [{"album": "Anghellic: Reparation", "image": "https://images.genius.com/4ca3bb53fbb24607664a845e69e82102.799x800x1.jpg", "year": "2003-02-11", "title": "Breathe", "lyrics": "[Intro]\nYou know what I mean?\nShit, let the motherfucker bleed the same blood I bleed\nThis fuckin' hurt a little kid\nNiggas know what the vibe? Forever breathe\n\n[Verse 1]\nNever duck another motherfucker, repeat it\nNever duck another motherfucker, nigga better delete it\nPut the cerebellum in killer mode, for real a foe\nCan never get with what a gorilla know\nKillin' syllable, feelin' ya biblical ritual\nThis shit'll get rid of ya pain, here in your pitiful game\nThis is political pain, deep in the pit of your brain\nLet it rain with the unforgettable aim *gunshot*\nNigga lookin' for a spot to bust\n'Cause the homie that you killed meant a lot to us\nBut instead of lookin' for a cock to fuck\nKill a nigga like he was rockin' the swastika\nYou can do it, but you blew it, 'cause you're mockin' up\nGet your ride on, nigga is you rock or what?\nLots of luck, you really gonna need it, hella heated\nMotherfucker let the Glock erupt, box him up\n\n[Bridge]\nI don't wanna be the one to get a millimeter in the gut\nI wanna be the one to hit 'em with another milla\nCaught up in the middle, I'm a little sick and different\nI mean it when I said it, you remember that?\nHell motherfuckin' yeah!\nYou don't wanna get in trouble with a nigga like the Tecca N9na\nIf you looking like an enemy (Bust)\nWe don't ever stop or take a minute we (Just)\n\n[Hook]\nBreathe! Hey son, what the fuck are you duckin' from?\nBreathe! Stay calm, best to fight every fuckin' one\nBreathe! Say some, punks are bound to sell coke and guns\nBreathe! Sprayin' guns might result in you bustin' some\nBreathe!\n\n[Verse 2]\nNever let a hatin' motherfucker see you sweat\nBleed the chest, no need regret\nI fun day caper, a Sunday paper, so I can read the rest\nI can dig it, you can dig it, put a nigga in the grave\nIf you hate or penetrate a loop of love a nigga made\nIf you step up to me you will never benefit\nNigga if I start it, I'ma finish it\nRun up on a motherfucker while he fuckin' a chick\nPut a bullet in her head while she's suckin' a dick\nWasn't a bit of evidence, baby it's irrelevant\nYou got it with your nigga, that's the luck of the grit\nBring pain to everyone\nIn your face with the bane, you very some\nIt's a motherfuckin' shame we carry guns\nIf you don't, you're insane or very dumb\nTecca N9na's too rough (Too rough) Too hard (Too hard)\nToo tough (Too tough) You scarred (You scarred)\n'Cause a nigga know a motherfuckin' round will spit\nFuckin' around with a killer clown and shit\n\n[Bridge 2]\nIf you really wanna do it, nigga, we can step into it\nPut us up against some motherfuckers and we runnin' through it\nFuck a nigga, buck a nigga if he think he's a guerrilla\nMeant it when I said it, you remember that?\nHell motherfuckin' yeah!\nYou don't wanna get in trouble with a nigga like the Tecca N9na\nIf you looking like an enemy (Bust)\nWe don't ever stop or take a minute we (Just)\n\n[Hook]\nBreathe! Hey son, what the fuck are you duckin' from?\nBreathe! Stay calm, best to fight every fuckin' one\nBreathe! Say some, punks are bound to sell coke and guns\nBreathe! Sprayin' guns might result in you bustin' some\nBreathe!\n\n[Verse 3]\nGet sprayed by the TEC-9 hand gun, now I'm on the outrun\nFlowin' up again and hot, cooked, well done\nFuckin' with a crazy insane warlord\nPunks wanna trip, but they know I'm too motherfuckin' hard\nDeadly, tickin' like a time bomb\nFuckin' with me you would think you were in Vietnam\nWhen I explode ain't nothin' left but remains\nBut those who were froze fuckin' with a nigga insane\nMentally minded mad, motherfuckin' madman\nOut to attack, sinkin' punks like quicksand\nDroppin' and poppin' any punk that buck so\nBring a body bag if you wanna get fucked up\nThere it is you little bitch made nigga\nStart runnin' when I'm playin' with the trigger\nAn Uzi, a 12-gauge, it really don't matter\nMany suckers die when the shotgun scatter\nFrom block to block, hood to hood, street to street\nBoy you can't fuck with me\nSo for those who told you to jump up and talk shit\nAdmit you bitch, your little ass got lit\n\n[Bridge]\nI don't wanna be the one to get a millimeter in the gut\nI wanna be the one to hit 'em with another milla\nCaught up in the middle, I'm a little sick and different\nI mean it when I said it, you remember that?\nHell motherfuckin' yeah!\nYou don't wanna get in trouble with a nigga like the Tecca N9na\nIf you looking like an enemy (Bust)\nWe don't ever stop or take a minute we (Just)\n\n[Hook]\nBreathe! Hey son, what the fuck are you duckin' from?\nBreathe! Stay calm, best to fight every fuckin' one\nBreathe! Say some, punks are bound to sell coke and guns\nBreathe! Sprayin' guns might result in you bustin' some\nBreathe! Hey son, what the fuck are you duckin' from?\nBreathe! Stay calm, best to fight every fuckin' one\nBreathe! Say some, punks are bound to sell coke and guns\nBreathe! Sprayin' guns might result in you bustin' some\nBreathe!\n\n[Outro]\nThat's beautiful\nRonnZfromBerlin and shit, hardcore cat\nBlaze your weed to this\nThis is dedicated to my homeboy Walter Jefferson\nW.J. Weed Capone nigga\nIf I ever breathe, if I ever live\nFear no motherfucking man\nWho bleeds the same blood I bleed\nAnd still listen to you kids\nThat's real shit, nigga\nBreathe"}], "artist": "Tech N9ne"}