{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/517c9843c8a1f201140f5487e86a5366.300x300x1.jpg", "title": "Be Like That", "year": null, "album": "Jonah Part Two", "lyrics": "[Intro]\nYo\nBe like that, man to be like that\nBe like that, I ain't stressin' man I'll be right back\n\n[Verse 1]\nYo\nFirst kick the rhyme flow way back in '94\nYou can't spell OG without the letters \"G\" \"O\"\nAnywhere that He go, we go\nSee bro, lined up\nTook a shot at it like a free throw\nFirst name, Jonah\nLast name, Sorrentino\n\"Dang, that sounds like a Jewish Gambino\"\nNobody would gamble on the kid, its like Reno\nGot my shot. But I fell backwards like Neo\n\"Yep we Know, that's just what you gotta face\"\nI was on the weak ends\nYou can call it Saturdays\nGet it? Weekend\n\"Yeah, yeah\"\nAnyways\nKept on speaking with any tracks that I had to blaze\nWithout a database, I'm going that-aways\nBut I knew my Jesus not fame was what I had to chase\nI'm glad to say that everyday He always had the way\nAin't a thing changed, 'xcept my age\n\n[Chorus]\n(Back in the day, what?)\nIt be like that\nI ain't stressin' man, it be like that\nIt's a blessing when it be like that (See)\nI'as knocked down but I be right back\nI'm like \"oh?! Yup, it be like that\"\nBut I ain't stressin' when it be like that\nCause life's a blessin' when it be like that\nI'm knocked down, but I be right back\n\n[Verse 2]\nI went from using tapes there just to run the track\nTo a world of soundcloud, played is the mumble rap\nAin't saying I hate this man\nI'll just state the facts\nYou can stay the same, adapt or just fade to black\nSo all my days I remain just a humble cat\nBlast through the lines like a psychopathic running back\nStill got the hat low\nCross all up on my back!\nStill let these cats know who He is and I ain't stopping that.  (nope)\nStop and Laugh\nI see you come and go\nWrote the first rap stuck at  home with a busted nose\nI let the words fly kinda like a busted hose\nDropped a boulder on the crowd\nCrushed the show!\n\n[Pre-Chorus]\nMan I love it Bro\nI got the greatest job\nStill one love, one God that I'm bustin' on\nYou need to catch up man\nYou got the mustered sauce\nHe remains the same even when they goin' claim I'm gone. (right)\n\n[Chorus]\n(Back in the day, what?)\nIt be like that\nI ain't stressin' man, it be like that\nIt's a blessing when it be like that\nMan?\nI was knocked down, but I be right back\nI'm like \"oh?! Yup, It be like that.\"\nBut I ain't stressin' when it be like that\nCause life's a blessin' when it be like that\nKnocked down but I be right back"}]}