{"songs": [{"album": "The Seasoning", "year": null, "title": "N.J.D.", "image": "https://images.genius.com/f4f6f65df801065862f2f5cc2ad24ec5.500x500x1.jpg", "lyrics": "Jaylin man, dag man you 8 months dawg\nI remember just thinking, what you was even gonna look like before you got here man\nAnd I sat down to myself man, and I just began writing, the Lord put something on my spirit man\nIt was just a way of me speaking to you things I wanted to relate to you man\n\nThis is my, letter to Jalen\nAnd I’m praying, when you get older you comprehend what I’m saying\nMan I’m here for you, and I’m making it clear to you\nThat a Christ-like life is where I’ll be steering you\n\nAnd I know it’s rough, and obstacles will come against you\nBut you ain’t got to, go through what your daddy’s been through\nGod has sent you, with the hand of His might\nI demand you understand His whole plan for your life!\n\nPlease! Don’t abandon the light\nCause it may be years before you veer back from the land of the night\nUnderstand what is right and let no man lead you\nBe a leader, no matter what they feed you\n\nAnd I’ma teach you, that you must crawl for your walk\nIf you fall it’s a start, proceed with all of your heart\nIt’s all a part of growing up, learn from mistakes that you make\nSo when you face em again, you know what’s up\n\nAnd weigh out ya options, don’t dive in to things head first\nManage your money, spend when you breaking a little break a little bread first\nKeep you a plan, and only do what you can\nWhen you accept responsibility, your truly a man\n\n*phone rings*\n\nHey Dawan this is Jason\nHey Jason, where you at?\nOh I’m just at the studio, I was just giving you a call to let you know that I love you, you know I love you right?\nYeah, I love you too\nOkay, well I’ll be home a little bit later. I’ll see you when I get there\nJason, can we play the game when you get home?\nYeah that’s cool, we could play the game when I get there, aight? I’ll see you later\nAlright, bye\nDeJuan\n\nDeJuan, your not my son biologically\nYou have a dad, but still you have a father in me\nWhen we met, truly I was still lost in the streets\nYou were four years old, and stuttered as you were talking to me\n\nI remember clearly, you hated smoking severely\nI did it around you anyway, claimed that I loved you dearly\nIt all was a lie, and my heart was desperately wicked\nExpect that from man, when his focus ain’t Christ centered\n\nBut, for your forgiveness is what I’m asking\nI murdered the flesh, you see the old man lays in the casket\nLife everlasting, I’m trying to tell you what real is\nHell is hot, it ain’t something you wanna deal with\n\nThe world will paint this picture about, money and fashion\nCan’t take it with you, when your body returns to ashes\n(What I’m trying to say), don’t do what I did, but do what I do now\nSee Christ lives in me, I really do love you now\n\nI thank the Lord for bringing our relationship closer\nSecluding us from danger, keeping anger from boiling over\nAnd as you grow, throughout your life situations\nI’m here for you the same but know Christ is your foundation\n\nI Jason (I Jason), take ye LaWanda (take ye LaWanda), my wedded wife (my wedded wife), to have and to hold (to have and to hold), for this day forward (for this day forward), for better or for worse (for better or for worse), for richer or for poorer (for richer or for poorer), in sickness (in sickness), and in health (and in health), and to love (and to love), and to cherish (and to cherish), till death do us part (till death do us part), according to God’s holy ordinance (according to God’s holy ordinance)...\n\nI thank God for my wife, the love of my life, my heart and my soul\nWoman of Christ, more valuable than the price of gold\nI pray that it shows through affection my deepest emotions\nKeeping me open, your love flows deep as an ocean\n\nYou’re the shirt on my back, pants on my butt\nYou’re the twinkle in my eye, crutches that are standing me up\nMy love, you’re my wife, you’re my friend, my light when its dim\nMy smiles or my grins, its like your everything (from within?)\n\nI love you, and put no one but the Lord before you\nI’ll endure through the pain because I adore you\nVirtuous woman, adorably stunning, your beautiful\nYou love me and you should know that the feeling is mutual\n\nWhat more can I do for you, before I’m smothered in dirt?\nCause it’s only right for me to love you, like Christ loves the Church\nAnd He died for us, so know I’ll do whatever it takes\nThen He rose for us, so know through Him we never will break\n\nThrough heartaches, all the ups and downs, the smiles and frowns, whatever\nLong as we stay focused on God we’ll be the glory together\nHoly, matrimony, such a wonderful thing\nWith my beautiful queen, as we both serve a glorious King\n\nI thank God, for what He’s done in my life\nAnd I gotta give Him thanks for my son and my wife\nMy whole fam, I know it’s a blessing to have\nNikki, Jaylin, Duwan, through the good and the bad (X2)\n\nI thank God"}], "artist": "Json"}