{"artist": "Watsky", "songs": [{"year": "2013-03-12", "lyrics": "[Chorus]\nSend in that sunshine\nMake everything right\nTurn on your love light\nCause baby I’m coming on by\nSend in that sunshine\nMake everything right\nCause there ain’t no suffering in life\nThat don’t ease with the passage of time\n\n[Verse 1]\nIf stars died of old age\nThey wouldn’t explode, they’d burn out with a slow fade\nBut stars escape life with a gun shot\nWhich makes me think they stick a pistol in their sun spot\nBite the barrel, squeeze the trigger\nMight have cared once, but the obstacles seem bigger\nAnd they’re stuck behind a giant 8 ball\nThe milky way is star brains that are smeared across the space wall\nYou know the red giant in sector two?\nYeah, Hector, true, he was a depressing dude\nI think he thought nobody thought about him\nAnd now that I think about it, I’m liable to guess it’s true\nEverybody wants the sun to come and cure their rough moods but suns need love too\nI give out energy and don’t receive. I’m tired now, I’ll go to sleep\nAnd when this is the coldest solstice, maybe folks’ll notice me\n\n[Chorus]\nSend in that sunshine\nMake everything right\nTurn on your love light\nCause baby I’m coming on by\nSend in that sunshine\nMake everything right\nCause there ain’t no suffering in life\nThat don’t ease with the passage of time\n\n[Verse 2]\nGoodbye Maggie, Goodbye Jules\nI wish you’d stuck around, you wise fools\nCause friends they tend to come and go\nThe way the ocean ebbs and flows but there’s reminders in the tide pools\nBut when the standing water’s putrid\nWho am I to say a choice you made was stupid?\nThere’s a bunch of us who loved you\nFucking stuck here pointing fingers at ourselves for something you did\nYou you you you you packed your problems in a suitcase\nYou you you went away forever to a new place\nYou left behind a lot of blue faces and bouquets and loose ends like shoelaces\nBut my friend, it’s too late\nSo all my lightweights and barflies, let’s raise a pint each time a star dies\nAnd toast the memory of hard lives\nFiled on the interstellar hard drives and archives", "image": "https://images.genius.com/0ed2171f9fa650ff0ccb5bcecb02d6f3.1000x1000x1.jpg", "album": "Cardboard Castles", "title": "Send in the Sun"}]}