{"songs": [{"album": null, "image": "https://images.genius.com/4044a4e2bb3bded0a2513112554143c0.747x747x1.jpg", "year": null, "title": "King of My Life", "lyrics": "Glory to the King of my life\nOnly You are holy\n\nYou are the life in me\nYou are the light that shines inside of me\nAll praise and glory to Your name\nI will give to You my life\nAnd anythin' that You require, oh Lord\n\nI'm givin' all praises up to the lion of Judah\nAlpha, Omega, plus the El Shaddai\nElohim, Yahweh, Messiah, Y'shua\nWhat about the Adonai?\n\nSomethin' about the name, Jesus\nThat makes me go insane, Jesus\nSaved my soul from burnin' flames, Jesus\nAnd He broke them devils' chains, Jesus\n\nGlory, glory, how are You doin' to me, not bein' worthy?\nYou could have saved Your son, Jesus Christ\nInstead You sent him for me\nHe gave His life for a sinner like me, threw my sins in the sea\nHe died, He died, He was dead but He rose in three\n\nGlory to the King of my life\nHe is alive, He is alive\nGlory to the King of my life\nOnly You are holy\n\nSurrenderin' my will\nDesirin' You to fill me with Your love\nI live to serve my livin' King\nOnly I bow, please show my how\nTo love the world the way You love\n\nMe givin' praises and honor, glory, thanks unto the King of kings\nWhose precious blood is more than cars\nHouses and diamond rings\nGive Him praise and raise your hands\nAnd magnify Him with the song and the dance and a\n\nGive Him praise with the harp and the microphone\nTambourines, cymbals, drums and the xylophone\n\nGotta give Him praise, gotta give Him praise\nFor the things that He did when He walked onto Calvary\nAnd died on the cross, when He took my place\nHe is alive, He is alive\n\nGiving all honor and glory\nUnto the King of kings and the Lord of lords\n\nGlory to the King of my life\nHe is alive, He is alive\nGlory to the King of my life\nOnly You are holy\n\nGlory to the King of my life\nHe is alive, He is alive\nGlory to the King of my life\nOnly You are holy\n\nGiving all praise to the most high God\nThe Father, you know what I mean?"}], "artist": "T-Bone"}