{"artist": "C-Murder", "songs": [{"title": "Do You Wanna Ride", "album": "C-P-3.com", "year": null, "image": "https://images.genius.com/4dc247fc7daaf210072595f34b42edb0.194x194x1.jpg", "lyrics": "[Slay Sean]\nHow many wanna play now? It get dark wit the shades\nDown, you know Slay and Black paid now\nNiggas, see we be thugged out, 2 deep\nMuthafuckas betta stay out the way now, that foolishness\nI'm tellin you yo crew could get hit wit dem tools and clips\nFuck who you get, you and that fool you wit, gone get yo wig split\nBlack guns, me and my doggs clap guns, don't be thinkin we jus rappin\nYou saw what would happen, gun blastin\nSqueezin off til I'm the last one\n\n[hook] 2x\nYou gone ride - Take It Outside\nYou gone die - Take It Outside\nYou gone cry - Take It Outside\nTake It Outside, Take It Outside\n\n[C-Murder]\nNow if you wanna ride or die, then try\nBut let me get high so that my mind can fly\nBecause I'm just that kinda guy, people wonder why\nI'm so violent, because the N.L. move in silent\nIn other words, I creep creep, put you to sleep sleep\n187 will be yo last beep beep\nI bring that N.O. heat heat, to the streeets\nToe tag yo feet, yo feet\nI treat ya like a prostitute, and fuck ya up\nA roughneck nigga that'll ruff ya up\nLike a quick car wash, I'll touch ya up\nCause I look at ya'll like sittin ducks\nBoy don't you understand that I'm the man\nWit the plan, wit beacoup benjamins and alotta ghetto fans\nAt first you was tellin me to keep it trill\nBut now they know T-R-U is real\nOne hundred and eighty seven percent\nI remember when my pockes were full of lent\nAll my real niggas like next to kin\nSo testin me is like testin them, now what!\nI guess it's buck ya'll time\nI guess it's time for the second line\nMy last cd was \"Trapped in Crime\"\nSo you already know what's on my mind\n\n[hook]\n\n[Black Felon]\nWhat What\nSay I had 16 bars\nHow many muthafuckas can drive 16 cars\nGo up in the club, thuggin, and pull 16 broads\nTake em home, and fuck em all in 16 minutes\n(haha they don't know)\nMuthafuckas you ain't heard of me, Alotta them niggas\nFrom Desire be, on the side of N-O L-I-M-I-T\nOr T-R-U, wit Slay Sean and C, peep game dude\nWho can spit it better than me?\nEver seen a nigga chest blown (chest blown)\nEventhough he gotta vest on (vest on)\nNigga walk up to yo dogg witta dress on\nAnd start spittin some shit, that'll split you at the\nChest bone (chest bone)\nYou fuckin wit the wrong click\nWe gotta army of niggas who don't give a fuck who u\nRun wit bitch, get cha wig split\nThink it's a game, but it ain't, Black Felon, Slay\nSean, and C\nBustin on some of that T-R-U shit\n\n[hook]\n\n[Traci]\nNigga take it outside, I was born to represent\nTru niggas gotta keep it thugged to roll wit this chick\nCatch me in the cut, G' Nikes, bandana'd up\nMean mug on my grill, Like I dont give a fuck\nWho want what, they get stuck\nI don't play around, in the back akin buck wit both\nArms up, and around my hand, Tru Records wristband\nUnderstand the game cold but got colder when it met me\nI came to put it down, put ya face where ya chest be\nAnd I don't run, it's the same place where you met me\nSlay Sean, Black, and C my click, so don't sweat me\nI get up in yo face, nigga, so don't test me\nHard to get at me, but try ya luck\nI make niggas stutter and I leave em stuck\nWhen this track come on, watch em all get buck\nTraci just represented is you warin or what?\n\n[hook]"}]}