{"songs": [{"title": "Background", "album": "Rehab", "year": "2010-09-27", "image": "https://images.genius.com/dc7d6ce05b5aee3f7fd35003296d6583.540x540x1.jpg", "lyrics": "[Hook: Andy Mineo]\nI could play the background\nI could play the background\nCause I know sometimes I get in the way\nSo won't You take the lead, lead, lead?\nSo won't You take the lead, lead, lead?\nAnd I could play the background, background\nAnd you could take the lead\n\n[Verse 1: Lecrae]\nIt's evident you run the show, so let me back down\nYou take the leading role, and I'll play the background\nI know I miss my cues, know I forget my lines\nI'm sticking to your script, and I'm reading all your signs\nI don't need my name in lights, I don't need a starring role\nWhy gain the whole wide world, If I'm just gon' lose my soul?\nAnd my ways ain't purified, don't live according to Your Word\nI can't endure this life without Your wisdom being heard\nSo word to every dancer for a pop star\nCause we all play the background, but mine's a rockstar\nYeah, so if you need me I'll be stage right\nPraying the whole world will start embracing stage fright\nSo let me fall back, stop giving my suggestions\nCause when I follow my obsessions, I end up confessing\nThat I'm not that impressive, matter of fact\nI'm who I are, a trail of stardust leading to the superstar\n\n[Hook: Andy Mineo]\nI could play the background\nI could play the background\nCause I know sometimes I get in the way\nSo won't You take the lead, lead, lead?\nSo won't You take the lead, lead, lead?\nAnd I could play the background, background\nAnd you could take the lead\n\n[Verse 2: Lecrae]\nI had a dream that I was captain of my soul\nI was master of my fate, lost control, and then I sank\nSo I don't want to take the lead, cause I'm prone to make mistakes\nAll these folks who follow me, gon' end up in the wrong place\nSo let me just shadow you, let me trace your lines\nMatter of fact, just take my pen, here, you create my rhymes\nCause if I do this by myself, I'm scared that I'll succeed\nAnd no longer trust in you, cause I only trust in me\nAnd see, that's how you end up headed to destruction\nPaving a road to nowhere, pour your life out for nothing\nYou pulled my card, I'm bluffing, You know what's in my hand\nMe, I just roll and trust you, You cause the dice to land\nI'm in control of nothing, follow you at any cost\nSome call it sovereign will, all I know is You the boss\nMan, I'm so at ease, I'm so content\nI'll play the background, like it's an instrument\n\n[Hook: Andy Mineo]\nI could play the background\nI could play the background\nCause I know sometimes I get in the way\nSo won't You take the lead, lead, lead?\nSo won't You take the lead, lead, lead?\nAnd I could play the background, background\nAnd you could take the lead\n\n[Bridge: Lecrae]\nI know I'm safest when I'm in Your will, and trust Your Word\nI know I'm dangerous when I trust myself, my vision blurred\nAnd I ain't got no time to play life's foolish games\nGot plenty aims, but do they really glorify Your name?\nAnd it's a shame, the way I want to do these things for You, yet\nDon't even cling to you, take time to sit and glean from You\nSeems You were patient in my ignorance\nIf ignorance is bliss, it's cause she never heard of this\n\n[Hook: Andy Mineo]\nI could play the background\nI could play the background\nCause I know sometimes I get in the way\nSo won't You take the lead, lead, lead?\nSo won't You take the lead, lead, lead?\nAnd I could play the background, background\nAnd you could take the lead\n\n[Hook: Andy Mineo]\nI could play the background\nI could play the background\nCause I know sometimes I get in the way\nSo won't You take the lead, lead, lead?\nSo won't You take the lead, lead, lead?\nAnd I could play the background, background\nAnd you could take the lead"}], "artist": "Lecrae"}