{"artist": "Canibus", "songs": [{"title": "Cptn Cold Crush", "album": "The ‘C’ of Tranquility", "year": "2010-10-05", "image": "https://images.genius.com/bcd4d41b609a532514c5daa8d24d2bbd.600x600x1.jpg", "lyrics": "[Intro: Canibus]\nTranquility to infinity (yeah!)\nTranquility to infinity\n\n[Verse 1]\nCanibus is an animal with the mechanical mandible\nComing to damage you, spitting understandable slang at you\nI'm the all-seeing lyrical, with infinite bars of visuals\nAnd a sideways eight peripheral\nI told you I'd spit a rhyme that would melt the earth\nThen ask you in the afterlife if you felt the verse\nOn planet Earth, I searched for my tranquillity first\nI said I was the illest, but it didn't help me, it hurt!\nAnd whenever I said \"Can-I\" the crowd said \"Bus!\"\nTen years later, who am I? I still got a passionate love\nTo be the man who I was, never give up\nIrrational rush to crush every mic I clutch\nWhen I erupt, you duck or eggs clash, flash solar blast from Bus\nThen sweep you off the stage like crumbs\nGrab your tongue, shout, rip it out, then shove it back in your mouth\nNow, ten tell you to spit it out\nI spit about them lyrics my people can't live without\nBeen around since '97, I've been ripping it down\nSpit track after track after Beast From the East, I'm back\nBefore Lil' Weezy knew how to rap\nWhen T.I. was still hustling crack, I put the muscle in rap\nA 100 Bars, who fucking with that?\nA thousand bars later, I ain't heard nothing from Pap\nWhere you was at when I was giving Big Punisher dap?\nOn stage with a him at the Palladium\nYou was in a gymnasium, I was putting chainsaws to craniums\nBlazing Homo Sapiens in the atrium, ripping jaws off aliens\nPerforming Channel Zero in stadiums\nUp at Hot 97 disgracing them\nAny radio station they place me in I broke the break-beats in\nI beat her, I beat him, the beat blend, I beat them\nSpit a verse to beat Barack Obama if he win\nI'm the Beast From the East, picking meat out my teeth\nAnd as soon as the beat stop, I forget how to speak\nI release a better rhyme seven times a week\nTo beat me you gotta be better than my last release\nThe bars rip ya face off, spit bars, spit shine ya skull\nTill every rhyme you memorize is gone\nBattle you for the respect in a battle to the death\nDial zero, call the operator ask for Bis\n411 ask for RIP\n555-1212, I rip the mic to shit\nBefore the Federal Communication Commission started a new division\nWith the intention to cripple our children\nMentally deficient from television\nThis radio programming we listen to got to many elements missing\nLyricism and wisdom got overshadowed by the singing and blinging\nDeceived by a system thats media driven\nI made a vow that I would get them and bit them, then injected my venom\nAnd for that, was never forgiven my nigga\nI let the rhythm hit 'em with a chemical algorithm\nLiable to kill them if I ever get with them I rip them\nThe infinite monk, All Hail Can-I-Bus\nThen wake up to this Pure Uncut\nHow Many Emcees do I have to bust?\nI'm a Patriot with No Airplay but How Come?\nMy Block is your block, I Throw It Up\" with Doo Wop\nI'm the Enemy of the State of Hip Hop\nIndibisible, Indestructible, Canibustible\nThe Adversarial Theater of Justice judging you\nTired of you posers, I'm the rap superstar soldier on a poster\nCaptain Cold Crush\nTuck the heat before I brush the teeth\nThe athlete at the track meet with rusty cleats\nArtillery like lawn mowers with four motors and four rotors\nLook like a mom with four strollers\nCounterstrike like Black Kobra\nWith gasoline in the Super Soaker, walk over, I'll roast ya!\n\n[DJ scratched sample]\n\"Cold Crush get it crackin!\" (8x)"}]}