{"artist": "6ix9ine", "songs": [{"year": "2018-02-22", "title": "RONDO", "album": "DAY69", "lyrics": "[Intro: Tory Lanez]\nI'ma do my dance in this bih (I'ma do my dance)\nShe front on me, I throw bands at the bih\nAll up in my pants and I'm rich (Yeah)\nAll up on the couch dancing on shit, yeah\nPay me in advance, off rip (Off rip)\nTell lil' mama do the dance on the dick (On the dick)\nShooter with me got his hands on the strr (Hands)\nBrrt brrt, we ain't throwin' hands in this bitch, no (Throwin' hands)\n\n[Chorus: Tory Lanez]\nWe ain't throwin' hands in this bih (Throw a couple hands)\nThrow a couple bands in the bih (I'ma throw a couple bands)\nTell the bitches do the dance on the dick\nHandstand off the bando and she lit, lit\n\n[Verse 1: 6ix9ine]\nI ain't playin' with no wannabe tough nigga\nI ain't playin' with no wannabe thug nigga\nIn the hood, you a rat, you a dub, nigga (Fuck nigga)\nI stay with the blicky, glttt-pow, are you dumb nigga?\nIf a nigga feel froggy, let him through, let him through\nStandin' right in your face, nigga, do what you do\nBig homie look at me, like shoot, I'm like, \"Who?\"\nI got the big MAC, kick-back, blow your whole shit back\nBitch, move\nWhen I walk up in the room, bitch, move\nWho was talkin' jockin' the Xan, like boom\nBet he want static 'til they see me, like move\nBut there he go right there, boom-boom-boom!\n\n[Chorus: Tory Lanez]\nWe ain't throwin' hands in this bih (Throw a couple hands)\nThrow a couple bands in the bih (I'ma throw a couple bands)\nTell the bitches do the dance on the dick\nHandstand off the bando and she lit, lit\nWe ain't throwin' hands in this bih (Throw a couple hands)\nThrow a couple bands in the bih (I'ma throw a couple bands)\nTell the bitches do the dance on the dick\nHandstand off the bando and she lit, lit\n\n[Verse 2: Young Thug]\nWoo! I got my money and my⁠—mm\nBitch, I said I got my money and my Ritalin (Yeah)\nI got Rolls Royces, I got coupes, I paid tuitions (Skrr)\nMy diamonds 12 different colors like a sissy (Eugh)\nYeah, Patek Philippe's, I forgot to mention (Patek Philippe's)\nI got suspended, I didn't have to do the dishes (Yeah, yeah)\nI did it up and I didn't never ever listen (And what?)\n20 cars deep, we ain't worried about winnin' (Nah)\n6ix9ine (Yeah), bang red like Heinz\nI'm a snake, nigga, 6 shots in ya spine (Woo, woo, woo)\nMoney call me, I'ma pick up every time (Brrt, brrt)\nAnd I got the bands in this bitch, yeah\n\n[Chorus: Tory Lanez with Young Thug]\nWe ain't throwin' hands in this bih (Throw a couple hands)\nThrow a couple bands in the bih (I'ma throw a couple bands)\nTell the bitches do the dance on the dick\nHandstand off the bando and she lit, lit\nWe ain't throwin' hands in this bih (Throw a couple hands)\nThrow a couple bands in the bih (I'ma throw a couple bands)\nTell the bitches do the dance on the dick\nHandstand off the bando and she lit, lit\n\n[Outro: 6ix9ine]\nScum Gang!", "image": "https://images.genius.com/e83f7a16e7b52dd05ecfe3566ceb40af.840x840x1.jpg"}]}