{"songs": [{"title": "It’s Only Love", "album": "Return of the Darkman", "year": null, "image": "https://images.genius.com/ffc48cdf9440941e0fd4bf0d068c90af.400x400x1.jpg", "lyrics": "[Intro: La the Darkman]\nWord up, it's La\nIt's rough out here God, you know?\nWord up, yea..\n\n[Chorus 2X: La the Darkman]\nIt's only love, doin this thing, pa\nIt's only love that I'm givin\n\n[La the Darkman]\nYo, Earths are cryin, as they see their son's dyin\nIn the streets, bitches are burnin like the bottom of an iron\nNegativity is all that brothers see in my environment\nI don't work for the white man, cuz coccaine is hirin\nMy times is expirin, but I don't care\nAll I do is buy sneakers, new cars and beer\nWhen I need to buy estates, 'fore it get too late\nBut furnished basements, have my all crew, liftin weights\nDrinkin liquor, see the real picture, your life is too short\nWill you make that million dollars, pa, before you get caught?\nBetween stick-up kids and jakes, you got to make your own fate\nIt was another kid's beef, my son got caught by a stray\nAnd he passed on in a flash from a four-five shell\nAnd I gotta believe in Heaven cuz the ghetto is Hell\nWhat is reality, and the lifestyle of all men?\nI need a mansion, twins, Heineken's and skins\nI don't drink Gin to sin, leave that to raw-dick Kim\nCuz he too light to fight, so he shoot to win in the end\n\n[Chorus 2X]\n\n[La the Darkman]\nMadmen disappear here over the years\nAccept collect calls from my penetentiary peers\nIt's locked down for snow, I wanna live a better life\nKnow mad niggas caught by the Germans and drugs twice\nNow they behind bars, told when to eat, sleep and shit\nTransformed a three-year to a eight-year bid\nCuz he jooked a kid, peace to Mena, Big E, now Wayne\nYou'll be home son, sportin fly Air ones\nBut in the world, yea there's still shorties buggin\nOn a block at night bustin off guns for nothin\nI've done that, I'm tryin to escape that, black\nLittle Mike just came back from doin four years flat\nHe was a hostage, trapped in a four-corner room\nShipped far upstate, seen light to the moon\nNever snitched, that's why he's doin six plus six\nWhile half y'all cats'll go to court, singin like a bitch\nThese are the true facts of it, either hate it or love it\nStash your toast in my whip, in the wood grain, covered\nBut it's peace, cuz I'ma fuck up cats with no grease\nThis track is for the niggas locked down and deceased\nR.I.P., R.I.P\n\n[Chorus 4X]\n\n[Outro: La the Darkman *during Chorus*]\nWord up, Parada\nLiz, Big Gus, all my maniacs\nTracks, cousin Facts\nWord up, Mena, Slow Joe\nYou know? Word up\nAll mine, yaknowImean?\nGotti, word up\nSalasie, knowI'msayin? Word up\nYou know? My man King, Ced Demon\nKing Gunner, word up\nKnowI'msayin? Ugh!"}], "artist": "La The Darkman"}