{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/d55597aef7ddcd938a2bfc161537e7d5.1000x1000x1.jpg", "year": "2011-11-21", "album": "Radioactive", "lyrics": "[Hook]\nWhy is everything I love the most, so wrong for me?\nAnd everything I’m holding close, is so far away from me?\nThey don’t want me to lie but, they don't wanna' hear the truth\nIt never made sense to me\nWhy everything I love the most, is so wrong for me!\n\n[Verse 1]\nYeah! Problematic, I’m so problematic\nThat I’m probably a problem addict\nPop an aspirin cause my head is hurtin'\nHotel bedroom, missin' curtains\nSheets everywhere like a storm has passed\nIn fact it looks like I got into a wrestlin' match\nEmpty bottle of Jack, I could tell I did that\nI could smell it in fact, it's like death and ass\nThink for a minute if I look over and look\nTo my left is an opened book, a Bible\nTo my right is a guilty conscience and her name is Brooke, my rival\nAt least I think her name was Brooke\nShe’s asleep, and I’m givin' her the lamest look\nMove her hair back so that I could see your face\nCause it was dark and I met her at the game it took\nAbout 5 minutes to get her inside the whip\nAnother 5 minutes to get up inside the lips\nNever try really man, I really tried to slip, out\nBut it was just thighs and hips\nOK, I was high, shit\nOn alchohol and the Yelawolf ego trip\nLeave her lying in bed cause I don’t need no kiss\nAnd it’s the walk of shame again!\n\n[Hook]\nWhy is everything I love the most, so wrong for me?\nAnd everything I’m holding close, is so far away from me?\nThey don’t want me to lie but, they don't wanna' hear the truth\nIt never made sense to me\nWhy everything I love the most, is so wrong for me!\n\n[Verse 2]\nSmokin’ hot, throw it up\nKeep a fifth off in my cup\nTrying not to be a simp\nBut every time I take a sip\nI think I’m gonna fall in lust\nI'm back and forth like I'm packing a truck\nIn a house that never runs out of boxes\nKnowing that if I put on my tennis shoes\nAnd a fresh fit, I’ll end up sockless\nBy the end of the night, flip flopping\nI’ll B-Boy if you let me Hip Hop in\nAlligator skin cowgirl boots only means let’s get it crockin’\nThat mini skirt makes any man a flirt\nManicures, animal furs and a purse\nWhat could a little bit of smoke and Henny hurt?\nYou make any jerk make a penny work\nSinister with sin in her\nShe can leave a devil sitting in the church\nOn another level, not in the earth\nJessica Alba had twins at birth\nTrippin' sure, piles of E, ménage-a-trois, piles of three\nWaking up again, not proud of me\nYeah, I'm a lousy fiend\n\n[Hook x2]\nWhy is everything I love the most, so wrong for me?\nAnd everything I’m holding close, is so far away from me?\nThey don’t want me to lie but, they don't wanna' hear the truth\nIt never made sense to me\nWhy everything I love the most, is so wrong for me!\nWhy is everything I love the most, so wrong for me?\nAnd everything I’m holding close, is so far away from me?\nThey don’t want me to lie but, they don't wanna' hear the truth\nIt never made sense to me\nWhy everything I love the most, is so wrong for me!", "title": "Everything I Love the Most"}]}