{"songs": [{"lyrics": "Yeah NASA lets try this..\n\nPark your bets\nSharks or jets\nHis bark mark targets where the barnacles nest\nThey burrow deep under the carnivore's flesh\nWithout a trace\nCarnival games\nLike try to shoot the star out of his face\nCome double fist them aqua-gats lock box your past and\nSpoon up the ballooning for high noon saloony antics\nWalk off with a thumbs up\nAnd a stuffed Bullwinkle trinket\nPull twinkle out them awestruck baby sockets for a day\nYeah that's the ticket\nYeah that's the pipe dream\nThat's hater 101 bitch pigs\nLiving guilt trips for the fan base family picnic\nWho's handshake carry with it\nY'all inspire me\nIt's an honor to meet you\nNow it's randomly fantasy beef stew\nThat's panicky pre-school\nThat's Keebler signs Pikachu\nAnd he's poking pinocchi-beezer\nWhere big brother watching ain't\nHoller back Wally Cleaver\nKnobby-kneed geezer\nWhose brittle peddle boat sank\nWishing he could re-stitch the images when the kinescope cranked\nHe couldn't\nYou can't\nMy more-than-two lamp with a mongoloid loyalty clause\nAnd a done did got busy ambiance\nThat's Lazerface, Megalasaur, Scissor-tongue, Liftedly\nMoney-Murs, Ramble, Printmatic, Hangar, Blockhead and Ravipops\nAnd the fam only begins with the last two bars he dropped\nAdd the chrome fangs I'll rewrite Heavy Metal Parking Lot\nThat's why these grapevines could pop shit to me all day\nI only kick these fucking doors down to make sure the crew o.k\nLike, food on the plate\nThread on the back\nKicks on the palette\nI rock the bells without clown shoes, fried dough, tickets or mallets\nWhile the bearded ladies won goldfish from the ping-pong toss challenge\nThrew like girls and misconstrued the lucky fuck floaters for talent\nIt's sad really...\nO.k., I'm over it\nSmolder over composure models like smoke over soldier nostrils\n3d bifocal goggle broke over cat walkers\nThere must've been something up in that Long Island tap water\nGrew to mute Grinch north of Who-ville and his frisky sissy poodle pack\nOozing that hollow 'who the mac?' act Aes threw back in junior rap\nIsn't it strange how it's a fad to bite your idols\nWhen the whole reason you liked 'em was cuz their shit wasn't recycled?\nCome pigeonhole Aesop like he ain't heard it\nThat's no burden\nNeed attention?\nBetter dress them diversions like stripping nurses\nKid the cult is thick and media's the sacrificial virgin\nPurging little man behind curtain opinions\nThis is perfect\nLook I'm just like y'all\nLiving low-pro to paycheck\nAnd when the landlord hollers he hid the 'dro in the tape deck\nRocket radio\nEvery success smidgen he harnessed\nParks with risk and sick with it clicking in perfect working ratio\nNo frisky out of dodge name blame for sneaky plots\nWith elevated rung placement derived from deep-rooted jealousy issues\nHe cue the raging bull and every due is paid in full\nWith that I forget all you motherfucks that failed to pull\nWhy? Well\nWhat's really good?\nNot a cat who peddles backwards for a hacker's filthy looks\nHodge-podge menamena-Muppets available in rubber stamp form\nHogwash Harry clamp norm\nWear the space cake baker?\nOrder up\nCurb his pacemaker\nAnd vacate personal space in relation to face-raker\nBuilt an Einstein-Rosen bridge to '88 with Lincoln Logs and bobby pins\nProbably when Oz's friends slept on the poppy stems\nHorseback 60 M.P.H\nOne hand rolling tobaccy badly\nBut it burns out cavalry of concerned worms for mayor\nBut you'll find validity in a penny, right\nAnd I got a clear flick of the Loch Ness sucking off Yeti\n\nWith a knee-jerk response to his budgetary woes\nHe's hooky out the institution's huckleberry mold\nStyle leapt out a Hermann Rorschach margin mark\nStarving art smashy to slash a martyr heart\nTrashy to lap her garter belt\nThis is 6 flags Definitive Jux baby\nWe like, love it or leave it out your holler box now\nCripple a kitten if a kitten is a culprit\nYou're spilling insignificant frijoles", "title": "Frijoles", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}