{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/15f6e5c5e09f71c035331315412025ea.450x450x1.jpg", "title": "I’m Fitted", "year": "2009-07-30", "album": "Money", "lyrics": "[Intro]\nUh, Yeah\nChip tha Ripper\n(I'm Fresh)\nI'm so fresh it's crazy right now\nJP I think he did it on this one\nThis what I tell em\n\n[Hook]x2\nI'm fitted, I'm fitted, I'm fitted, I'm fitted\n(Fresh)\n\n[Verse 1]\nI done swong out imma swang\nSlab ain't no gang\nBut Everybody Know my name\nDiamonds on my piece and chain\n(uh)\nHad the game locked up from Cleveland to Lorain\nMoney got that bitch sewed up from L.A. to Maine\nPaint drip off the frameI got money in my pocket\nThe bank called and asked when you gone make a deposit\nYou think I'm fresh to death now you should see my closet\nYou see my house you'll say i lost it got Moet coming out the faucet\nEverything's real fake clothes that's a no-no\nWhen i hit the mall hoes run up taking photos\nUsed to be bonk i was broke i was dolo\nIn a chevy swimming pool with Marco and Polo\nEvisus for promo, nigga this how we do\nRed Monkey Bathing Apes somebody call the damn zoo\nGod bless me i didn't have to achoo\nI'm gone blow i got dough nigga how about you\nI step out (i'm fitted)\nAin't no doubt (i'm fitted)\nCheck my fit (i'm fitted)\nPolo tee (i'm fitted)\nLook at my jeans (i'm fitted)\nGoddammit I'm clean (i'm fitted)\nWhere in the world did he get it (i'm fitted)\nJust admit it (i'm fitted)\n\n[Hook]\n\nI'm a fly young nigga (ugh) don't you forget it\nPut some money on a mountain top I'mma go get it\nIn the summer kept the plumber, everytime I stepped out I shitted\n24s on the truck, I did it\nWhen I hopped out Im fitted\nIn my ROC fit, I get cash I'm the man hoe!\nLRG, BBC, my outfit costs a grand ho\nVisu jeans, white tee, I'm gon' do some damage\nDon't ask for an oil change if you see me in Live Mechanics\nNo need for dairy queen i am desert\nIn my ice cream shoes and my ice cream shirt\nPRPS fresh spend about a nine\nSkateboard DC's I'm on my grind\n200 for the lokes, yes\nI'm so fresh\nI got hoes? yes\nI blow the best\nTrendsetter when I step out\nI make sure nobody did it\nI'm fitted\n\nI step out, (i'm fitted)\nAin't no doubt, (i'm fitted)\nCheck my feet (i'm fitted)\nPolo tee (i'm fitted)\nLook at my jeans (i'm fitted)\nGod damnit I'm clean (i'm fitted)\nWell, where'd he get it?? (i'm fitted)\nJust admit it! (i'm fitted)\nIm fitted (i'm fitted)"}]}