{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro (Excerpt from Lethal Weapon 2)]\nI'm not going back so just shut up!\n\nOh sure don't go back, okay. Okay don't go back, that's it. That's what they want. Lemme tell-can I give you two guys a friendly piece of advice okay? Don't ever go up to the drive-thru okay? Always walk up to the counter. You know why? Ok, ok, ok, lemme' tell you, ok. They FUCK YOU at the drive-thru, okay? They FUCK YOU at the drive-thru! They know you're gonna be miles away before you find out you got FUCKED! They know you're not gonna turn around and go back, so they don't care. So who gets fucked? Ol' Leo Getz! Okay, sure! I don't give a fuck! I'm not eating this tuna, okay?\n\n[Hook x2]\nOk, ok, ok\nIf you need me to be honest\nI'm really tired of being modest\nEspecially when them cats is garbage\nFuck with me and Rittz, you swimming with piranhas\nOk, ok, ok\n\n[Verse 1: Wrekonize]\nI’ve been in the middle run around and gots to knew\nIf the bullshit you've been listening to is individual minimal\nOr is it lots the blue?\nYou know me, Benny P, I’m an Indie star\nMoving along like an indie car\nBut at least I used to motherfucking think we are\nThis is hometown funk from the bottom of the map now\nSit the motherfucker back down\nPlay the wall, play the fence, play the background\nCause I’ve been runnin on silent, know me all violence\nWent on tour to spread the name like Midas\nMet that whore, she wanna see my Tech N9ne inch nails\nShe been spitting all the same old tales\nWanna get me to buy her heels\nTake her to Zales, how unreal\nI’m like bitch get a life, get a male\nWho gonn love you and treat you well\nBut tonight, you came to the right spot\nTo get the best fucking that you ever did feel\nThis is just another summertime ale\nAnother bottle of the JD, well\nDon’t be acting like you never did fail\nNever knew jail, or never knew hell\nMe and Rittz make it lift like braille\nYou wanna blaze trails but you’re so damn frail\nThis is eminent for enemies never did we pretend to be\nThe better, we the best now, hell\n\n[Hook x2]\n\n[Verse 2: Rittz]\nThe homie Wreck just wrecked it and killed the beat\nI guess he wanted me to resurrect it, I can feel the speed\nLike a needle was full of meth injected in my neck\nBut fuck it, it help me get perspective\nA collective effort snake and bat connected\nRhyme vet mind set defective\nMy lady said I need to get my head inspected\nDomestic violence at its finest, bitch\nI told you to shut up while I'm rhyming shit\nYou as bad as the guys online that diss\nThat must have took it from behind and their vaginas itch\nAnd Rittz may not be the best looking beau in the bag\nBut I guarantee, if throat fuck a ho she would gag\nI bet ya all of friends sayin' she suck this\nI'm just lying, it's a line, I make you jealous of my success\nMaybe you should copy me and you would suck less\nYou talking shit on the internet, what you obsessed?\nThey don’t wanna slut fest, pussy wanna just flex\nThey would rather fight over Skype kinda suspect\nYou should tuck your nuts and wear a sun dress\nYou can’t fuck with us it’s not a contest\nWe already know the outcome (Outcome)\nHow come its similar to givin' us a drug test\nFuck rap, I don’t like who's in the top 5's\nKnock guys out the spot and now the spots mine\nTry to go against me its not wise\nIts deadlier than having a minaj with the mob wives\nYou ain't shit the way you spittin is hosh posh\nWrekonize and Rittz and we epitomize the rest\nWhoever did about to take it back to get the rapper drive by\nShitting on the rappers in your ipod, Ye-Yah-Uh-Yeah\n\n[Hook x2]", "title": "Leo Getz", "year": null, "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}