{"artist": "Fat Joe", "songs": [{"year": "2005-06-14", "album": "All or Nothing", "image": "https://images.genius.com/07b605de3e64892070232ced7e01e190.1000x1000x1.jpg", "lyrics": "Yo\nYou know every time you come home\nYou got to murk somethin'\n[Lil Jon]\nStop! It's the motherfucking remix!\n\n[Intro: Mase & (Lil Jon)]\nUhh! Yeah, Harlem is back (TS)\nWho in the world want a problem with that? (fo' real)\nI heard Harlem is back (You know we had to do the remix)\nWho in the world want a problem with that?\n(Yeah! Eminem nigga!)\nUhh! Yeah, Harlem is back (Lil Jon nigga!)\nWho in the world want a problem with that? (Mason Betha!)\nI heard Harlem is back (Fat Joe!)\nWho in the world want a problem with that? (Let's go!)\n\n[Hook: Fat Joe]\nSaid my niggas don't dance\nWe just pull up our pants and, do the rockaway\nNow lean back, lean back, lean back, lean back\nSaid my niggas don't dance\nWe just pull up our pants and, do the rockaway\nNow lean back, lean back, lean back, lean back\n\n[Verse 1: Mase]\nYou know it's deja vu, and the day y'all do\nIt'll be the day y'all bleed\nWrist minus 80 degrees\nKing of Harlem ain't nobody made me leave\nWho else could take 5 years off?\nCold turkey? Come back and fly lears off\nCats front leave them leaning like Smirnoff\nIf haters wanna hate then its their loss\nCome up in the Rucker with all my Jake's on\nCar grills so big you can cook a steak on\nPeople hear Mase call them wanna get their mase on\nYou hot 16, I'm a very great song\nThey beating on the DJ booth 'fore the Mase song\nYou play Clark Kent, you better have your cape on\nPlenty homes Mansion many rooms\nMy necklace, 2Xs and three Bentley bulls\nLean back, Lean back, Lean back\nCause he's back come on\nLean back, Lean back Lean back\nCause he's back come on\n\n[Lil Jon]\nEminem, what's up! Hey!\n\n[Verse 2: Eminem]\nYou don't want no problems with Harlem\nYou don't want no problems with the boogie-down Bronxster\nYou don't want no drama with the blonde bomber\nOriginal Don Dada of the blonde bottle\nThe model from White America\nThen Joe, the spokesperson for the Latino\nThen we got Mase back to re-per-e-sent\nE-ver-y-thing else in between\nIncluding the percentages of the rest we don't\nThe best from each coast, the midwest to the dirty-dirty\nEven further to Miami, all the way back to Californ-i-a\nIt'd probably be best right now if I warn Dre\nTo get on the horn and tell 'im about the storm coming all our way\nSo tell a pal, grab a gal right now, get on the floor while I wait\nShake that ass a little more my way, but baby, I don't dance\nNot that I can't, there's a pistol in my pants\nCome on\n\n[Hook]\nSaid my niggas don't dance\nWe just pull up our pants and, do the rockaway\nNow lean back, lean back, lean back, lean back, come on\nSaid my niggas don't dance\nWe just pull up our pants and, do the rockaway\nNow lean back, lean back, lean back, lean back\n\n[Verse 3: Fat Joe]\nNo Judas or cowardice or Cain's brother\nAbel is able to stop me, nigga, not me!\nGot the streets asking \"Damn, who can top P?\"\nSummer Jam? Killed it, man, they did it all with one beat\nI guess I'm bi-coastal now\nTook a down south brother to bring your boy out (What?!)\nAs the wheel keeps spinning\nI can hear niggas thinking Crack got one hit, then he out\nNope! Joey bring them semi's out\nForce you and yours to pour a little Henny out\nSo much rappers acting in the game\nI had to tell them put the mic away\nAnd run and get your Emmy's out\nLean back, motherfuckers\nThis here's a three peat we back at the Rucker\nIt's Cook Coke Crack, preach it to ya, brother\nThe mic more rap and preach you motherfuckers\n\n[Hook]\nSaid my niggas don't dance\nWe just pull up our pants and, do the rockaway\nNow lean back, lean back, lean back, lean back\nSaid my niggas don't dance\nWe just pull up our pants and, do the rockaway\nNow lean back, lean back, lean back, lean back\n\n[Outro: Lil Jon]\nSaid my niggas don't dance we just pull out our gats\nAnd say blow your back away, fuck nigga\nLean back, lean back\nLean back, lean back\nI said my niggas don't dance we just pull out our gats\nAnd say blow your back away, bitch nigga\nLean back, lean back\nLean back, lean back\nHEY!", "title": "Lean Back (Remix)"}]}