{"artist": "C-Bo", "songs": [{"title": "Money, Power, Respect", "album": "Blocc Movement", "year": "2001-08-28", "image": "https://images.genius.com/069abf7637d0c6d1c2db910fd370ca65.500x500x1.jpg", "lyrics": "C-Bo, Floss B, hehe yeah money, power, respect\nYeah yeah uh huh, uh huh West Coast uh huh West Coast uh huh\nOther side you know how we ride, uh what?\n\n[Vesre One]\nOh my god, times here are so hard\nBaby brothers in trouble and mothers got no cards\nThe oldest of the pack got to bring the food back\nI'm packin a magnum on one of the hottest corners, movin sacks\nDuckin from one-times, life in the blind got me pointin 9's\nSqueezing triggers for freedom and dimes\nMy homie Tone caught a bullet in his chest\nThey said they heard he was pullin in the west\nRetaliation is a must that we run em down\nWit fully loaded high powered rifles and gun em down\nEveryday in my city some where someone bites the dust\nIf you here hope you with a city nigga you be trust\n\n[Hook 2x]\nWe down for Money, Power, Respect\nHow much you hold on yo neck?\nHow much you roll on that Lex?\n\n[Verse Two]\nYou know it's crackin on the Southside so I hopped in my Reagle\nWith the homie Lil Stoke and ofcourse my Desert Eagles\nAnd it's like an All-Star Game I mean we 10 to 1 with business\nAnd we platinum down surrounded by killers sittin on switches\nAin't that a bitch? You set trip you bound to get set\nI'mma get my respect nigga I don't give a fuck what town it is\nCuz I'mma respect yours and you gon' respect mines\nAnd if it ain't correct I'mma check with the tech 9\nNigga I'm a Thug Lord ask my mama\nYeah these niggas got it made but they don't want no mutha fuckin mama\nNo fuckin drama, no comma\nAs I bounce in my rounce with a mirror on the trunk of my big black ass\n\n[Hook 2x]\n\n[Verse Three]\nConnect the dots I done shot through my enemies spot\nThen you can plot to get half of the stripes that I got\nMy Chuck T's tounges tucked, hung for the sprung clubs\nDuck or get struck, no luck with this young buck\nYoung truck, how the fuck I look in the sell stuck?\nDick in a man's hands gettin my nuts sucked\nI'm bossed bangin, leavin all those crossed hangin\nSlangin death at a high cost, that's nina ross hangin\nDo, re, me, fa, so, la, say hola to the misses\nBow down and kiss this pistola\nRun up wit ya gun up and get done up\nI'm one up, from sun down to sun up I ain't givin none up\n\n[Hook 4x]"}]}