{"songs": [{"year": null, "album": "The Luca Brasi Story", "image": "https://images.genius.com/9151ecd4ac089059a8ba99f7f383b502.500x500x1.jpg", "title": "Counting On Ya", "lyrics": "[Intro]\nI mean, what up?\nI mean\n\n[Hook]\nA lot is countin' on ya\nYour women sidin' with ya partners, why they plottin' on ya?\nWe might never understand, no one's there to hold your hand\nEven heaven would agree sometimes, how this road gets\nLosin' focus\nCan't depend on them, why do they depend on me?\nThey was all I had, I mean what made 'em go pretend on me?\nSpirit of the sermon, discernin' moments I see shit\nCan't look me in the eyes then it's somethin' you don't agree with\n\n[Verse 1]\nPerhaps I'm too quick off the draw from how I deal with altercations\nFrom where gangsters only talk cocaine, it ain't no other language\nAwkward interviews, discussin' my inner views, on life itself\nFigure me pretentious, evading mischief by writing hymns\nLabels shown interest, no showers are showin' interest\nBoth old ladies show resentment, resented my show of interest\nMoved out from my momma detached garage and a small apartment\nShut the door or shut the fuck up, we fussin', we always argue\nIt sucks we always arguin', but she started it\nPause, believe I grew up on the farm with no understandin'\nKevin's stupid, tell him anything, he won't understand it\nStupid ass Kevin, anything, he won't understand it\n\n[Hook]\n\n[Verse 2]\nStolen cars, open charges, matchin' blunts blowin' each other charges\nSummer '08 me and Menace in a Daytona Charger\nClub exquisite, nigga know the business, pull up in the front\nAin't no VIP, got Nook in front me pockets got the mumps\nMoney come in clumps, what I clutch might knock out your lung\nKeep that on the tuck, it go *ck* if you *uh*\nGot two people livin' in me, one a realest, one a killer\nLuca Brasi, he a sinner, Kevin tryna be a Christian\nSeems life is less fulfilling when livin' is unattended\nPerformin' rituals to whichever God that'll listen\nHad a lot of prayers answered, ain't had to sit in no buildin'\nRun your flap, get your bap for a package, I'm in the buildin'\n\n[Hook]"}], "artist": "Kevin Gates"}