{"artist": "Problem", "songs": [{"album": "Mollywood 3: The Relapse (A-Side)", "title": "Finna Bust", "image": "https://images.rapgenius.com/067f61cd9f8d4bafeaa5ff6d90c81eb8.950x950x1.jpg", "lyrics": "[Intro]\nWoman]: Tell me you like it\n[Man]: Oh, wait, hold on, hold on. Whoa...aaahhh!\n[Woman]: Oh no, don't stop\n[Man]: Aaahhh!\n[Woman]: No, don't stop\n[Man]: Aaahhh!\n[Woman]: Don't stop, aaahh!\n[Man]: Hold on, wait, wait, hold on. Wait, hey!\n[Woman]: Aaahh, aaahh!\n[Man]: Hold on, hold on. Aahh! Wait!\n[Man]: Hold on, hold on. Oh wait. Aaahh, aahh, aaah!\n[Woman]: Aaahh, aaahh!\n[Man]: Aaahhh! Wait, wait, hold on, hold on\n\n[Hook]\nSlow it down baby, said am finna bust\nSlow it down baby, said am finna bust\nSlow it down baby, said am finna bust\nAm finna bust, am finna (what!)\nSlow it down baby cause am finna bust\nSlow it down baby cause am finna bust\nSlow it down baby cause am finna bust\nSlow it down baby, said am finna bust\n\n[Verse 1]\nIt's private cause you know it's a new person\nBut it feel like am new to 'em, shit feels like it's glue to 'em\nSee it less cauce, keep going guaranteed to make my love talk\nDamn, I can't play like this, fuck it quick\nSwitch the  positions, when you stand like this\nHeard my tip on still, is real as this mic feel\nFeeling slow it down, take these sleep as nightquil\n(Pulling back) Pulling back, pulling, pulling back\nShe grab me by the balls and say longer day is at 'em\nLike who bitch, I don't think you really want that\nShit move bitch, last time I lift it in up at you\nDamn near at you like ha ha, and I was like huh uh\nYou was like aah ah, and I was like huh uh\nAnd you was like why? And I was like no\nAnd you start to cry, I still had to go so\n\n[Hook]\nSlow it down baby, said am finna bust\nSlow it down baby, said am finna bust\nSlow it down baby, said am finna bust\nAm finna bust, am finna (what!)\nSlow it down baby cause am finna bust\nSlow it down baby cause am finna bust\nSlow it down baby cause am finna bust\nSlow it down baby, said am finna bust\n\n[Verse 2]\nYeah you like that, don't you?\nYou can bet the whole thing Fabway want you\nThere's a couple a things that Fabway won't do but share\nIt's a ganger bang for Fabway gonna do\nGrab my dick and she love it, but baby get off\nPussy don't gush without the I could sell it but no\nRather keep it to myself like I hate them floss like\n(Ah aah) Hey look what I am tossed\nLook like a barbie on a care bear, rode me like a swing set\nShe ain't got no hair there\nI just kissed a pussy like I didn't have a care there\nThug in her ass, baby chill, it's a player there\nI get up on it, she like, ah hah, I  was like, huh\nBaby got that fire but we still, she like, ah hah\nFor real? She like, nope, damn you got dope\nShit\n\n[Hook]\nSlow it down baby, said am finna bust\nSlow it down baby, said am finna bust\nSlow it down baby, said am finna bust\nAm finna bust, am finna (what!)\nSlow it down baby cause am finna bust\nSlow it down baby cause am finna bust\nSlow it down baby cause am finna bust\nSlow it down baby, said am finna bust\n\n[Verse 3]\nFresh bought the curb, you can never charge me\nThey say I wasn't shake cause I had a gang a babies\nHad a gang girl, now am looking for a lady\nBut that's hard to find in the land of the shady\nFresher bought the 80's, flexin on my havy\nI heavy, they all wanna  jack you when you out a cali\nCheck it, niggas gang banging all over\nRespect, it, and tryna figure out how I reject it\nNeglect it, the whole situation\nI don't really have to, brains of a doctor\nBut got the heart to blast you, cash you\nNiggas talk shit till we catch you\nMake an example out a of you before I let you\nDo the same to me though, I'm feeling like a leader\nSomebody gonna take me out even if I keep it in the seen ok\nKnockers they want too but because they wanna protect they ego\nEgo, ego", "year": null}]}