{"songs": [{"image": "https://images.genius.com/3dfcdaab94652abd75c7788fce09ed7f.398x400x1.jpg", "year": null, "lyrics": "[Akrobtik]\nAh ah ah ah ah ah ah ah ah ah\nIt like we could do like a series of those things anyways..\nFat Shit part 2, Like Fat Shit part like 25\nI can take it wherever it go, yo, wherever it go\n\n[Mr Lif]\nWhere's it going?\n\n[Akrobatik]\nYes yes\nCome on\nSay what?\nAbout the\n\n[Hook]\nFat shit!\nEverybody bounce bounce *echoes*\nAk and Lif running shit down the line\nLadies and Gentlemen-entlemen *echoes*\nAk and Lif runnin shit down the line\n\nYo yo\nY'all know the routine\nHip Hop's dream team's back on the scene\nYou're on your toes - the tips, son\nRecognize the way that we rip, son\nThe law has been laid when Akrobatik and Lif's done\nWhat's your method of preparation for this lyrical devastation\nEducatin' with your verbal detonation\nPeep this demonstration that exposes my infatution with\nRockin' the mic, the way the people like yo\nI inform\nPlus my style's been warm\nNow I'm hot past levels ever reached by mercury\nHip Hop has a cancer and its a grave emergency\nCall in doctors Lif and Akrobatic for the surgery\nBut scratch the anesthetic and ain't nothin sterile\nWe bring it grimy plus we save the joint from its peril\nAnd you know who is brought on by the wicked\nBut my nigga Mr lif came to burn 'em yo kick it\n\n[Mr Lif]\nNow you're epidermis and dermis is like a furnace\nBlood rises to the surface\nYou erupt into a puddle of plasma\nGood to see you son, welcome to the after\nEase up! Here's no fucking **?ear in a casbah?**\nAbsorb life through every pore\nTill the essence of your being is very sore\nStretched so far you can see what's next\nI've analyzed, measured\nThe boundaries of your terror\nJacked your data then advanced to thenever\nThis is what the future holds\nMore lives bought and sold\nIn the land of the free yet controlled\nWe're innocent never parolled\nAs a courtesy the walk streets patrolled by incertainty\nChaos is created as we hunt for security\nHave our codes and bombs provided any calm?\nYou want the answer?\nSearch no further than you have to\nWatch everybody panic every natural disaster\n\n[Hook]2X\n\n[Akrobatik]\nYeah once again you work soldier and bust it\nYou take the western hemisphere\nI'll tke the eastern hemisphere\nWe'll meet halfway in eight months\nAnd we'll do part 3", "title": "The Fat Shit Pt. II", "album": "The EP"}], "artist": "Akrobatik"}