{"artist": "Andy Mineo", "songs": [{"title": "Uncomfortable", "album": "Uncomfortable", "year": "2015-09-18", "image": "https://images.rapgenius.com/e423865d9a9f579968a5d81fe1200d41.640x640x1.jpg", "lyrics": "[Intro]\nNobody told me you could die like this\nNobody told me you could die from bliss, yeah\nNobody told me, nobody told me\nWe never ever saw it comin', no, no\nLive it up, live it up\nNobody ever told us we could die like this\nLive it up, live it up\nNobody ever told us, we never saw it comin', no\nLive it up, live it up\nNobody ever told us we could die like this\nLive it up, live it up\nCorrupted by the comfort we (love, love)\n\n[Verse 1]\nGod prepare me for the war\nComfort be the thing that'll make a king fall\nEyes on the Lord, gotta grip that blade of the sword\nTell me how you plan on gettin' swole if you don't ever get sore (hold up)\nThey say, \"Andy, this ain't music for your core\"\nIf they jumpin' ship now, they was never on board\nI got enemies, man they wanna see me on the floor\nI got frenemies, couldn't even tell you who they are\nIf you're not driven by the mission, you'll be driven by the cars\nFocused on what you been gettin' more than becomin' who you are\nI tried to point 'em to the Son, but why they callin' me a star?\nWho woulda thought we set they minds free with these bars?\nIn this game, in this biz, want the fame, gon' get rich\nComfort, everybody wantin' it, never knew I could be lost in this\nThis my sophomore, gotta go hard\nWhen the show over, no encore\nI got enough but I want more, want more!\n\n[Bridge]\nNobody told me you could die like this\nNobody told me you could die from bliss, yeah\nNobody told me, nobody told me\nWe never ever saw it comin'\n\n[Verse 2]\nMy own people owned people, but they don't own that\nThey say racism dead, man our president is black\nTwo terms in the White House, that don't mean jack\nIf we still believe our present ain't affected by our past\nFirst class with a Coach bag, I forgot\nWhen you start eatin' you lose your hunger then grow fat\nI apologize for Christians with pickets sayin', \"God hates fags\"\nI promise Jesus wouldn't act like that\nHe said it's hard for a rich man to get to heaven\nWhen we feel like we don't need God, then we forget Him\nWe tell 'em that, \"If you don't make me money or make me happy\nThen I ain't makin' time for ya', so make it snappy\"\nAnd I think lately you mistake me for a cabby\nCause this drive that I got put everybody in the backseat\nSo if you wanna live a comfortable life\nMake sure you never love nobody, be selfish and never sacrifice\n\n[Interlude]\nWe got legal weed that'll keep us high\n'Round the world other people die\nWhere on earth is my wi-fi?\nOur stomachs full and our pockets fat\nI need love, there's a site for that\nI had more when I had less\n\n[Chorus]\nI think I got too comfortable, yeah\nI think I got too comfortable\nI think I got too comfortable, yeah\nI think I got, I know I got\nI think I got too comfortable\nI know I got, I think I got\nI know I got a little too comfortable\n\n[Outro]\nAndy: 'Scuse me, sorry. Uh, sorry. 'Scuse me, comin' through. Sorry, 'scuse me. No, it's cool\nTrain Dispatcher: The next stop is...\nAndy: Uptown!"}]}