{"songs": [{"album": "1UP", "image": "https://images.genius.com/3ab9cd8ed80c35830a07211df7fee9d1.1000x1000x1.png", "year": "2019-02-27", "title": "Be Your X", "lyrics": "[Intro]\nI just wanna be your ex\nBoop, boop\nBoop, boop\nBoop, boop\nI just wanna be the one that you can't forget\nBoop, boop\nBoop, boop\n\n[Verse 1]\nI just wanna be that nigga that you keep sayin ain't shit (Yuh)\nThe same nigga that provide you that dank dick (Yuh)\nThe same nigga that you ride to the bank with (Yuh)\nYour new nigga can't fuck and he can't lick, uh\nI'm the one that had you on that A-list, uh\nThink you livin' life but it ain't at all\nSaid that I was cheatin' but I can't recall\nSo it ain't my fault\n\n[Chorus]\n'Cause I just wanna be your ex, oh\nA.K.A. the best you ever had\nJust call me for sex\nI can hear my ex callin' and I answer (Yuh)\n'Cause I just wanna be your ex, oh\nA.K.A. the best you ever had\nJust call me for sex\nI can hear my ex callin' and I answer (Yuh)\n\n[Post-Chorus]\n'Cause I just want to be the one that you can't forget, yeah\nUh, I can't wait for that next call in 'cause I'll answer\nAnd I just wanna be the one that you can't forget, yeah\nI can't wait for that next call in 'cause I'll answer\n\n[Verse 2]\nI just wanna be that\nNigga that had you ridin' that Rolls Royce (Yeah)\nDoors open up for you, girl, you got no choice (Yeah)\nHad you screamin' all night, you got no voice (Yeah)\nShe walk up in the mansion, all she say is, \"Oh boy, uh\"\nCall your man and tell him that's it's over, uh\nI ain't gonna have you fuckin' with no more bums\nAll you do is call and you know I come if you want you some\n\n[Chorus]\n'Cause I just wanna be your ex, oh\nA.K.A. the best you ever had\nJust call me for sex\nI can hear my ex callin' and I answer (Yuh)\n'Cause I just wanna be your ex, oh\nA.K.A. the best you ever had\nJust call me for sex\nI can hear my ex callin' and I answer (Yuh)\n\n[Post-Chorus]\n'Cause I just want to be the one that you can't forget, yeah\n(Yeah, the one, the one, the one, woo)\nUh, I can't wait for that next call in 'cause I'll answer\n(Yeah, the one, the one, the one)\nAnd I just wanna be the one that you can't forget (Woo)\nYeah, I can't wait for that next call in 'cause I'll answer"}], "artist": "T-Pain"}