{"artist": "Ice-T", "songs": [{"title": "Drama", "lyrics": "Cruisin' for a bruisin', I'm takin' no crap\nPipe bomb in my trunk, got a nine in my lap\nI'm layin' for a sprayin', tonight there's no playin'\nMy posse's most strapped, tonight the crew's weighin'\nDust is burnin', the steering wheel's turnin'\nI'm out a week, I'm already earnin'\nSuckers crossed, tonight it's their loss\nPayback time, boy, life's the cost\nGauges out the window, one lay cross the roof\nThey all die if those suckers ain't bullet proof\nI'm rollin' death tollin', of course the car's stolen\nBut I'm blind to what's wrong, all I want is what's golden\nA fool in a fight, too dumb to know right\nFuckin' blue light, read 'em their rights\n\nDrama (x4)\n\nI copped an alias bailed out in an hour or less\nI keep a bank for that don't know about the rest\nCopped another piece, hit the dark streets\nRollin' once again, fuck the damn police\nCalled up my boy Joe, a roof job pro, 459 on his mind car stereos\nHe said the spot was sleek, he cased the joint a week\n3 a.m. on the dot inside we creep\nGot Alpines, Fishes, JVC's\nMotorola Phones, Sony Color TV's\nHad the ride packed up 'til we heard \"Freeze\"\nFuckin' blue lights, read 'em their rights\n\nDrama (x4)\n\n4 in the morning, lights in my face\nThat's the time, you know the place\nCuffed in the room with the two-way glass\nDetects in effect cold doggin' my ass\n\"What's your date of birth?\" \"What's your real name?\"\nI stuck to my alias, I know the game\nIf they don't know who you are, then they don't know what you've done\n\"You're just makin' this harder on yourself, son\"\nI know this shit by heart, I'm too clever\n\"Have you ever been arrested before?\" Nope, never\nD.A. reject all over his face\nYou see, no confession, no case\nThen my boy started illin', talkin' and tellin'\nSon of a bitch, he was a snitch\n\nDrama (x6)\n\nUnder I went, I caught a case and half\nHe dropped the mallet, then the judge laughed\nNow I'm in the penzo, chillin' like a real pro\nI can't move 'til the man says go\nA puppet of the big game, an institutional thing\nI wouldn't be here if I fed my brain\nGot knowledge from school books, instead of street crooks\nNow all I get is penitentiary hard looks\nThe joint is like an oven of caged heat\nYou're just a number, another piece of tough meat\nKillers and robbers are all you greet\nAct soft you will get beat\nOn death row they got their own hot seat\nFor those who feel that they are truly elite\nThe last thing you see's a priest\nThe lights dim, your life ends\n\nDrama", "image": "https://images.genius.com/90b363e617bc82f06e45c5cc1d830e6a.1000x1000x1.jpg", "album": "Power", "year": "1988-09-13"}]}