{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/2di5rcerbrjygst071mrs6bkg.500x500x1.jpg", "year": "2007-01-01", "album": "Ball of Flames: The Ballad of Slick Rick E. Bobby ", "lyrics": "Hey screw you man! I got nothing cause of you\nI hate you\n\nHey Ricky\nSusan? You gotta listen to me\n\n[Verse 1]\nYeah, well\nI’m feeling low\nReally low\nHow low\nI am underneath the porch of course, I’ve got it bad\nI wanna rid this feeling so I must find me a lady\nTo easy up my flus-ter-ation now!\nBut I'm losing patience like a bad doctor\nInjected with a sickness, my body ain't a lady killer\nCan I get a witness? Know I got the winning gene\nPumping in my blood line, but I'm losing lately\nI don't seem to have enough time\nTo catch a break, instead infected with this snake and all the venom that is swimming in my innards validates the way I feel about myself, baby girl I need some help\nTell me that I got you as a trophy on my shelf, sing to me\n\n[Chorus] x4\nSlick Ricky you're so fine\nYou're so fine you blow my mind\nHey Ricky (yeah) Bobby\nHey Rick (who) Bobby\n\n[Verse 2]\nAin't you just the one I need standing there looking at me\nI heard you said that I was sexy\nReally? Come prove it to me\nReally, my mood is a swinger\nAnd if you was to give it to me tonight\nYou'd have me on your finger\nBaby I've been through the wringer\nI race cars, it's not like I could ever be a singer\nWherever I linger around town\nSeems the be the common place of another problem now\nBad look so why you the one to pass up\nI don’t think if I was to house your ass up\nYou would stay, I'm vunerable[?] hey\nI’m drinkin’ steady, just to keep the thought away\nBaby, now listen closely\nYou can be the one that I take [?]\nBe real, I'm giving you a deal\nThere's my cards lying on the table\nSo are you gonna drill[?]\n\n[Chorus] x4\nSlick Ricky you're so fine\nYou're so fine you blow my mind\nHey Ricky (yeah) Bobby\nHey Rick (who) Bobby\n\n[Verse 3]\nTall, thick, raw chick where's your ball at[?]\nI can see your nipples from across the room\nHalf lit\nNow I want to smash it, no holds barrred\nNo show, no dope,[?] no bed, no car\nRight here, right now\nBet you got my pipes running\nOh, you want a table right there\nLet me show you something\nYou're the type of fish I really want to put a hook in\nRip off your shirt and throw onto the people looking\nLet’s get away, and let’s not go nowhere\nLet’s not move another inch, let me grab your hair\nLet me put my hand on bare skin, spin into a whirlwind\nTell your little girlfriend, if she wanna join in\nShe can wait 'till later\nI don’t need another way to serve a woman like you\nSave her for another time, not like she is a dime\nYou’re tellin’ me \"it's yours\", well, give me what is mine\n\n[Chorus] x4\nSlick Ricky you're so fine\nYou're so fine you blow my mind\nHey Ricky (yeah) Bobby\nHey Rick (who) Bobby", "title": "Hey Rick E. Bobby"}]}