{"songs": [{"image": "https://images.genius.com/6d9b19d023bc1a4aaf747cabf6d78531.467x467x1.jpg", "title": "I’m Good Remix", "album": null, "year": null, "lyrics": "[Hook]\nYou can find me in the streets, even in the drought\nMy mattress is full\nWhy shouldn't I be out\nHey buddy, I'm good\n(what they tell you?) I'm good\n(what they tell you?) I'm good\n(what she tell you?) I'm good\n(what you see?)\nTwo hundred dolla jeans with my favorite patch\nPullin up my ride hell yea the rims match!\nWhat they tell you? I'm good\n(what they tell you?) I'm good\n(what they tell you?) I'm good\n(what she tell you?) I'm good\n(what you see?)\n\n[Verse: Pusha T]\nThe indictment's unsealed, all the lawyers paid\nTo my players getting money, you our serenade\nIn that German Nazi, them Italian Mobsters\nTalking Benzes and Ferraris if you couldn't follow\nThey say I'm underrated, I say that's overstated\nI couldn't tell, I thought a kilo meant I finally made it\nThen came 10, 20 came quick\nWalked out the kitchen, face white as Taylor Swift's\nMe and my Louis loafers, maybe my Gucci Vans\nBeach bum kinda mortgage kicking through the sand\nStyling on em (censored), can't fade the brothers\nGI Joe, wrap my body on that Complex cover\nAutomatic starting, frames Chrome Heartin'\nAMG kitted, roof is on a milk carton, yeah!\nThis is the life, fever gone but you could still get right cause I'm good!\n\n[Hook]\n\n[Verse: Rick Ross]\nRoss!\nNever sit so it's caviar carryout\nExtended clip in the fog, ya gotta air it out\nHe's so flamboyant, put a fan on him\nI'm a blade chopper, black Land Rover\nKnow I'm looking good, got on too much ice\nOpen the sunroof, I'm living once twice\nKnow my sneakers suede\nOf course my reefer great, I got it off illegal aid\nI'm flyer than a eagle lane\nI don't need a belt, damnit cause the money fit\nI don't even tie my shoes I know I'mma trip\nI'm a stunna tho, Murcielago on money gold\nYou put her out, I put her onto my bungalow\nI'm looking good, I'm feeling better\nI made Forbes 6 point M letter\nYeah\nYeah\nYeah\nBoss!\n\n[Hook]\n\n[Verse: Malice]\nYo!\nMo' money mo' problems, that's what Big said\nBut we ain't care, we was all about that quick bread\nBuying bags for every (censored) I misled\nF430 got them caught up in the spider web\nBefore we met, baby girl was into simple tastes\nTil' I put her on that jet, told her pick a place\nCartier wristwear, let her pick a face\nDaddy money falling out the sky like it's ticker tape\nBut this is give and take, you can't call it tricking\nAs long as the car is not the kids tuition\nLouis V, double G, read the inscription\nSitting on Santa's lap, every day is Christmas\nHaters keep your distance, waving the four fever\nA twinkle of the eye, smoke em like Cohibas\nSo here's to senoritas in them superficial love affairs\nMillion dollar crib, and it's laid like baby hairs\n\n[Hook]\n\n[Outro]\nI'm looking good, I'm looking good\nI'm looking good, I'm looking good\nYeah, yeah, yeah, yeah"}], "artist": "Clipse"}