{"artist": "360", "songs": [{"album": "What You See Is What You Get", "year": "2008-03-22", "title": "Mamma Mia", "image": "https://images.genius.com/b01a68880fdf408d16b94407da51e8b8.600x598x1.jpg", "lyrics": "[Intro]\nHey, Lleyton\nI've been told a couple of times that I look like you, right?\nNow, I don't mind that\nBut, in my opinion, I deserve Bec a lot more than you do\nI've put in more ground work, I've been there a lot longer\nAnd I love work a lot more than you do\nSo, I think it's time to give her up\nPlease!\n\n[Hook]\n[?]\n[?] Mamma Mia\nNow, I don't even know what that means\nBut it sounds good so I'm gonna just sing it\n[?]\n[?] Mamma Mia\nYeah, this one's for Snuzzleberry\nThat's my pet name I gave her\n\n[Verse 1]\nYo, I remember watching this girl on Home and Away\nWouldn't miss an episode if I was home or away\nI really wanna put my little hands up in her bra\nWhile I'm glancing at her arse, watching Dancing With The Stars\nLittle Aussie queen I define, how's that?\nI really love the way you get them eyebrows waxed\nYou'll see me every year, lurking in the grandstand\nEyes locked on Bec while the rest of the fans chant\nThis whole time, I've been dreaming of a lap dance\nI'll show Lleyton the true meaning of a backhand (take that motherfucker)\nAnd, really, he should be an honest register\nAs a non-competitor that could never beat Roger Federer\nAnd I'll be honest though, Australia's hoping\nFor Lleyton to stay away from the Australian Open\n(Nah, you can't come in) He wants to slap me? He better get the stilts out\nShe was hot before, guess what?, she's a milf now\n\n[Hook]\n[?]\n[?] Mamma Mia\nNow, I don't even know what that means\nBut it sounds good so I'm gonna just sing it\n[?]\n[?] Mamma Mia\n(I see you every year at the Oz Open)\nPlease look at me next time!\n\n[Verse 2]\nYo, it's like every year at the Oz Open, I'm feeling loneliness\nSwitch up my style every time, hoping that she notices\nAnd, last year, I thought I'd go in as a chauvinist\nPull the helicopter out and yell \"Please notice this!\"\nI find pictures of her, surfing the net\nOr you'll see me on the main court, surfing a net\nAnd, everywhere she goes, you'll see be perving on Bec\nI'll lurk under steps if she's in a skirt or a dress\nI'm sorry Bec but I'm really jealous of Lleyton\nI've seen you cook breakfast, I was smelling the bacon\nI died when I found that you were marrying Lleyton\nBut I like cornflakes (that's an irrelevant statement)\nYou've got the worst voice for a TV host\nI'd still let you talk on my CD though\nEverybody can see it, even BP knows\nWe all agree, you need to break up with that peewee, yo\n\n[Hook]\n[?]\n[?] Mamma Mia\nNow, I don't even know what that means\nBut it sounds good so I'm gonna just sing it\n[?]\n[?] Mamma Mia\n(I dream about you every night\nBut you don't love me, you don't love me)\n\n[Verse 3]\nI was with Bec Cartwright in my bed last night\nThe dream was so good that I slept past nine\nBut, when it comes to really having sex, I'm fine\nI've got my Woman's Weekly magazine when I have a dream\nMamma Mia, the mother of Mia\nCould turn me from a Satan to a mother Teresa\nWe'll get food nasty, having fun with a pizza\nI'll be your only lover if you chuck me a Visa\nCheesy but true, sleasy but smooth\nI'll show you another sport that's easy to do\nYeah, so what? I use a mic and not a tennis racket\nBut you could get a real rock star like Lenny Kravitz\nYeah, it's true that I like celebrity types\nBecause the TV bimbos are what kept me alive\nAnd now, I've got my sights locked on Jennifer Kye\nWhy? 'Cause Greg Norman said the sex was all right\n\n[Hook]\n[?]\n[?] Mamma Mia\nNow, I don't even know what that means\nBut it sounds good so I'm gonna just sing it\n[?]\n[?] Mamma Mia\n\n[Outro]\nAll those celebrity females, watch out\nThat's my whole thing, that's all I'm about\nThat's the only reason I rap, is so I can get closer to you guys\nAt the awards nights\nLara Bingle, Bec Cartwright, Kerri-Anne Kennerly\nFuck yeah, you're all gonna get it\nIt's all gravy Lleyton\nDon't take offense, little boy\nCome on!"}]}