{"songs": [{"year": null, "image": "https://images.genius.com/8a1ec925ad38ad02b62e35534537e993.252x247x1.jpg", "title": "S.U.C.", "album": "Purple World", "lyrics": "[Chorus]\nOhh, yeah, believe that\nYeah, I done hoped I'd speak to you\nScrewed Up Click, my clique of G's\nAhh you got to feel that player M-O-E\nRolling with the Noke, rolling with the Noke D\nGet up out the way, for the H-A-W-K\n\n[Hawk]\nScrewed up, what, chest be looking booed up\nWith the chemistry it's brewed up tracks get chewed up\nBrighten the mood up, when I'm spitting this all\nAbove the law, coldest nigga you ever saw\nStay there, outlaw ante up the stake\nI infiltrate your chest stain and increase the death rate\nDon't hate, why? it only makes us madder\nPockets get fatter, then I only make myself fatter\nSquash all the chatter in the southern region\nI pledge of allegiance to my niggas not breathing\nWe all still breathing, screaming S.U.C\nAnd that's a screwed up Mafios, and P-A-T\nNiggas can't see me cause I'm rougher than most\nYou boys are like bread, not butter and toast\nThey can't even come close, they done already told ya\nLike the H-A-W-K and a screwed up soldier\n\n[Chorus]\nScrewed Up Click, my clique of G's\nAhh you got to feel that player M-O-E\nRolling with my clique, it's the S.U.C\nAnd they call me the Barre Baby\n\n[Big Moe]\nSee when we floss our candy rides\nScreens keep falling from the sky\nPlayers ball and we stay true\nAnd if you want to test my clique\nI pop problems what you get\nS.U.C. and we goddamn fools\nWe got that purple sticky dank\nChased with purple sticky drank\nAnd forever we gon' bang screw\nOh it's the screw in us, we gone represent with pride\nIt's the screw in us till we die\n\n[Chorus]\nScrewed Up Click, my clique of G's\nAhh you got to feel that player M-O-E\nRolling with the Po, rolling with the Pokey\nCan't forget about, the Lil' Keke\n\n[Lil' Keke]\nDevastating and motivating it's the S.U.C\nShowing and blowing up since the year 93'\nEverybody be claiming the click, they want to be down\nWait to trip, on a flip through H-Town\nLet's take it back, 'cause you know we love that\nPoppi in the gray lay with the fifth on the back of the lac\nYou know we ride chrome everyday\nHaving the ghetto dreams like my nigga P-A\nWe crossed inside and forever we glide\nAnd one thing's for sure man Southside's riding\nLet's get this cheddar, you got your wood and your leather\nSitting tall on boys pushing dubs or better\nThis a clique full of G's, so we do it with these\nKeep the block on pop and the ice on freeze\nMo yo, and Keke for real it don't stop\nS.U.C. took a mission on down to Wreckshop, come on\n\n[Chorus]\nScrewed Up Click, gon' keep it true\nR.I.P. to, that DJ Screw\nWe gone mourn you till we join you\nAnd I want to say to you, without you fool"}], "artist": "Big Moe"}