{"artist": "Cadet", "songs": [{"title": "Southside", "album": null, "year": "2017-11-09", "image": "https://images.genius.com/960526a10072004f1f8a3c3f1186f797.1000x1000x1.jpg", "lyrics": "[Intro: Geko]\nHey girl who you fucking with?\nHey girl who you fucking with?\nOneTape Records\nCadet, Cadet\n\n[Verse 1: Cadet]\nUh, look, they know me from the other side\nHead high, jeans low and an attitude\nA screwface but ain't nobody mad at you\nIt's training day for the birds, man how we clap at you\nIf you're tweeting, you better mind what you tweet\nProof-read every character in the line\nSo mind what you say if you ain't speaking from the mind\nI'll push your man up out your face and have you speaking to your mind\nI'm just a southside nigga with a pistol\nMy face looking like 'What's the issue?'\nGet kwenged for some shit that you wouldn't do now\nBut some old school shit that you did do\nAnd ain't much changed, still gully with the step\nOffside, foul niggas, I ain't fucking with the ref\nCan't take shit from pigeon niggas, gun me in the chest\nMan you fucking with the best or you fucking with Cadet?\n\n[Hook: Geko]\nYou know you be fucking with the best don't you, na na na\nDon't be fucking with the rest, don't you, na na na\nBad boy from the South and bop along\nThat's why my slang might be so crud you know\nYou know you be fucking with the best don't you, na na na\nDon't be fucking with the rest, don't you, na na na\nBad boy from the South and bop along\nThat's why my slang might be so crud you know\n\n[Verse 2: Cadet]\nLook, they know me from the other side\nThey either know me for the cruddy or the beats\nA young bully with a hoody nigga, fucking up the streets\nLike you never got to eat, have you tucking into beef\nNigga Southside, I've got my map on me\nAnd that Southside is where I'm at, know me\nNigga tryna trap with two packs on me\nBut it's hard to rap with all eyes on me\nNow I know it didn't rhyme but it's calm my nigga\nDrop a gem or punchline every bar my nigga\nSet up shop and the price about half my nigga\nCostcutters, are you really tryna spar my nigga?\nUh, I ain't think so\nAnd fucking with the kids you must think so\nMan I've been around rocks so I fling stones\nAnd I've been cold, see me and they've been froze\nNigga I'm Cadet\n\n[Hook: Geko]\nYou know you be fucking with the best don't you, na na na\nDon't be fucking with the rest, don't you, na na na\nBad boy from the South and bop along\nThat's why my slang might be so crud you know\nYou know you be fucking with the best don't you, na na na\nDon't be fucking with the rest, don't you, na na na\nBad boy from the South and bop along\nThat's why my slang might be so crud you know\n\n[Outro: Geko]\nHey girl who you fucking with?\nHey girl who you fucking with?\nHey girl who you fucking with?\nHey girl who you fucking with?"}]}