{"songs": [{"image": "https://images.genius.com/1021aef37ee8310ae6a31c1d044210e5.457x457x1.jpg", "year": "2003-12-02", "lyrics": "[Intro: Styles P]\nYeah yeah, D-Block\nTony Toca, L.O.X., Sheek Louch\n\n[Tony Touch scratching]\n(“L.O.X.”)(“Kiss”)\n(“Sheek Louch, y’all ain’t go no heart”)\n(“S.P.”)\n\n[Verse 1: Styles P]\nAyo, here’s why I’m willing to die and take no shit\nFuck the whole world and I’m willing to ride\nLike, here’s why I’m willing to slide: too many niggas phony\nShit is getting lonely, blowing my high\nAnd like, here’s why I’m willing to cry: I feel furious\nAnd I’m getting curious what Heaven is like\nAnd like, fact why I’m willing to die, ‘cause y’all not\nAnd I’ve always been the opposite for most of my life\nYou know, P’ll be the Ghost of the ciph’\nAnd understand that I’ll cut you from ear to ear to hit most of your pipe\nI’ll leave niggas D.O.A. for three whole days\n20 niggas in your projects, P don’t play\nHank niggas like the Sugar Hill\nI’m the example and the definition, so you could understand the hood is real\nYou lost your man, how would you feel?\nWe don’t give a fuck! I just told you that the hood was real\n\n[Hook: Jadakiss]\nWhat up? All y’all could get touched\nD-Block, nigga, what (D-BLOCK!)\nParking lot or in front of the store\nAsk yourself, who want war? (What up?)\n\n[Tony Touch scratching]\n(“The LOX”)(“Doing their thing”)(“Kiss”)\n(“Tony Touch”)(“We back”)\n(“Sheek Louch, y’all ain’t got no heart”)\n\n[Verse 2: Sheek Louch]\nYo, why you ice-grilling me, like your jaw won’t break?\nI put knives in like candles—piece of cake\nWhen my shit pop, it’s over—next, the wake\nYou where duck niggas be found—next to lake\nI let it off in broad day\nWith the hammer, I make movies, just like a matinee\nWe could talk but I don’t feel like it; plus I’m not psychic\nAnd I won’t know what you’ll do if I don’t hit you first\nI’ll watch your muh’fuckin’ melon burst\nI’ll put bombs underneath your hearse—fuck the funeral!\nSheek that nigga that live for beef\nHow I flow, I spit like I’m missing teeth\nI’m a problem, like the youth division in jail\nHardheaded, and my knife work, forget it, uh\nI could pack up and leave right now\nBut that’s after I cock back and gun you down, bitch\n\n[Hook: Jadakiss]\nWhat up? All y’all could get touched\nD-Block, nigga, what (D-BLOCK!)\nParking lot or in front of the store\nAsk yourself, who want war? (What up?)\n\n[Tony Touch scratching]\n(“Kiss”)\n(“Sheek, baby, my style…”)\n(“Holiday Styles, muthafucka, giving you hell…”)\n(“LOX, muh’fucka, the ox won’t…”)\n\n[Verse 3]\n[Sheek Louch]\nAyo, I split niggas like Cohibas and Dutches\nAnd cop shotguns the size of crutches\nSheek be off the hook, whatever Tony touches\nSheek and S.P. put the guns to ‘em\nAyo, Kiss, take it all off they fuckin’ wrist\nAnd let them know where we at so they could buy it back\nAnd come dolo ‘fore I hit ‘em with the fuckin’ Mac\nY’all little niggas want work? Come get a fuckin’ pack\n\n[Styles P]\nS.P. from the D-Block Gang, boss of the boss\nContract killer, plus he got ‘caine\nDon’t you ever try to front, nigga, he got aim\nHe in a 4-point-6 but he got Range\nMight hear the gun clicks then we got brains\nTell Sheek “It’s bullshit”, he could leave that chain\nPlus his head is still bleeding, so leave that lane\nRemember the last time and the police that came\n\nWhat? Fuego, muthafuckas! Tony Toca\n\n[Hook: Jadakiss]\nWhat up? All y’all could get touched\nD-Block, nigga, what (D-BLOCK!)\nParking lot or in front of the store\nAsk yourself, who want war? (What up?)\n\n[Tony Touch scratching]\n(“The LOX”)(“Doing their thing”)\n(“And y’all scared, I could tell…”)\n\nMuthafuckas, pull ya guns out…", "title": "Fuego", "album": "Insomnia: The Alchemist vs. The Cousin of Death"}], "artist": "The Alchemist"}