{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Intro]\nI wake up every day and first and foremost I thank God, nahmsayin\n'Cause a lot of people didn’t wake up, haha\nBut I did nigga\nI told my kids I love 'em too\nMost importantly, I love my motherfuckin’ team nigga\nThat boy Cass\n\n[Chorus]\nWhere they do that? Boy turn on your location\nAin’t never had nothin’, use that for motivation\nShine on them niggas, so what if they hatin'\nCan’t rush what God got for you, you got to have patience\nNever said that it would be easy\nNever give up, know you can achieve it\nIf you got kids then let them be the reason\nThat you go hard for as long as you're breathin'\n\n[Verse 1]\nI been workin' wit no days off, blind to the bullshit, baby I'm Ray Charles\nStay down Quan I promise this shit here gon' pay off\nI don't dance but I might Harlem shake the hate off\nBeen about my paper I'ma business man\nDon’t give me the fire 'cause I might hit his ass\nI had my eyes close but I was listenin'\nMight get lost on somebody island, Giligan\nTell me when them nigga turn they back what you gon' do dawg?\nSideways talkin’ 'bout the situation lose yours\nIt ain't never 'bout no money boy when you talk\nConverted to a safe ya know it used to be a shoebox\n\n[Chorus]\nWhere they do that? Boy turn on your location\nAin’t never had nothin’ use that for motivation\nShine on them niggas, so what if they hatin'\nCan’t rush what God got for you, you got to have patience\nNever said that it would be easy\nNever give up, know you can achieve it\nIf you got kids then let them be the reason\nThat you go hard for as long as you're breathin'\n\n[Verse 2]\nHurry up and give it to 'em don’t make 'em wait long\nShawty hurt my feelings had to stay strong\nBags under my eyes been up all day long\nIt’s hard to see my pain when I got shades on\nDon’t cross that gun line boy stay in the safe zone\nAccept my call if I dial out on this pay phone\nWalk in the bank, make a deposit, it won’t take long\nFor no reason I gave 'em somethin' else to hate on\nFace shown everywhere I go because I’m good nigga\nSpot off on in the hills but never go Hollywood nigga\nI ain't worried 'bout no nigga I brought my gun in this bitch\nMake sure you retire my number when I'm done wit this shit\n\n[Chorus]\nWhere they do that? Boy turn on your location\nAin’t never had nothin’, use that for motivation\nShine on them niggas, so what if they hatin'\nCan’t rush what God got for you, you got to have patience\nNever said that it would be easy\nNever give up, know you can achieve it\nIf you got kids then let them be the reason\nThat you go hard for as long as you're breathin'", "title": "Achieving", "year": "2018-03-16", "image": "https://images.genius.com/0dd33a32eaee0297ead67ef93736d016.1000x1000x1.jpg", "album": "Rich As In Spirit"}]}