{"songs": [{"year": null, "title": "Y’all Already Know", "image": "https://images.genius.com/bfaec1a0bac7ea0de2beca8ef167e036.500x500x1.jpg", "lyrics": "Yeah King of Accra\nTie! This the beginning of the end\nWo ne me nni conversation nti wony3 me friend\nMeny3 follow follow, me me formulate trend\nMemp3 s3 mo wia me style no, nti magye ho fence\nYes! Rap no me hye no s3 cigar\nThis be Obidi, I don't give a f**k who you are\nMoa mobr3 w) hit ho no, mongyae mu mma Jah\nStill aa, mey3 kiddie for the game nti woa wohw3 aa\n2012 kraa metumi a m3 touchy me flow\nMe b3 tu ak)hy3 Afghanistan Ghana fo) y3 slow\nWonni Sika dea wo reputation no y3 low\nKing of Accra Charlie Beat wei de3 ma me blow\nGina Mawe up and down, Tag no y3 Sark\nTake picture make sure s3 wo lense ny3 dark\nRap no me shorty p3 anhw3 aa, me pushi drugs\nMemp3 Smiling Face, Kato no de3 bisa Black\nSlaughter Boys no mpo believe me punch\nMe waste flow no s3 sakawa cos mew) no bunch\nM3 rapi ak)pem s3 mewu cos passion no y3 strong\nMene Rap tes3 Kabayan fo ne c**t\nI swear Walahi punch no de3, 3ba dea you go freeze\nRap no 3fa wasum tes3 Akosombo breeze\nObi b3 shiney biom aa, agye mawu ky3ke me steeze\nFlow no y3ton no dealership, forget Greece\nWhatelse? (Lets go)\n\nSo I ain't gonna rap,(Y'all ready know)\nYeah, (Y'all ready know)\nTo ma Honeys on the block (Y'all ready know)\nEverybody in the building (Y'all ready know)\nTo all ma gees (Y'all ready know)\nAll ma Hommies up in Lagos (Y'all ready know)\nNaija (Y'all ready know)\nGH, Stand up (Y'all ready know)\nAh Yeah\n\nY'all ready know\nBaby ad3n nti na you don't call me anymore\nS3 meho afono woa baby let me know\nAd3n nti na wop3 s3 woy3 any mind ni more\nWop3 rap?, okay here we go\nForget Trassaco me p3 beach me w) doe\nYes.ahh. Half a milli for show\nAd3n wo y3m ahye wo, why you think it's a throw\nWo b3 rate me cash aa, checky me deals\nMiss Ghana winners no mefa)mo tes3 pills\nSamsung, Holic ne Fan milk\nFa b) so wo wie aa, na calculate Thank You\nMo na mob u Rap, Me mefa no cheap\nMop3 s3 mema mo funny flow, anaa s3 deep\nY3de rap kotwi Lamborghini aa, wose Jeep\nMey3 smart fr3 me Abu the Thief He!\nSarkology be the ish\nBeat no ma heati na matoto no s3 fish\nSarkodie mendidi, Kasahare be ma dish\nNa s3 m3 flopi kraa, no be your f**kin Biss\nMa register me flow mo use try plate\nNti mony3 me size, 3n3 l3 High grade\nPalace na be bally, me k) high place\nAsante Hene kraa mpo Hostee me for five days\nWhatelse\nSo I ain't gonna rap (Y'all ready know)\nYeah, (Y'all ready know)\nTo ma Honeys on the block (Y'all ready know)\nEverybody in the building (Y'all ready know)\nTo all ma gees (Y'all ready know)\nAll ma Hommies up in Lagos (Y'all ready know)\nNaija (Y'all ready know)\nGH, Everywhere (Y'all ready know)", "album": null}], "artist": "Sarkodie"}