{"songs": [{"year": "2001-03-20", "image": "https://images.genius.com/ffaf26159acc9a9695a28ced3ed20945.1000x1000x1.jpg", "title": "Father", "album": "The Gift", "lyrics": "We all so scared cause its, its war everywhere, you know\nWar everywhere\n\n(Chorus)\nHow many friends will we see die? (Why we so scared cause it's war everywhere)\nHow many friends will we see cry? (It's war everywhere)\nHow many friends will we see try? (Why we so scared cause it's war everywhere)\nHow many friends will we see die? (It's war everywhere)\n\nAll we need is a little love, and someone standing for the little thugs\nAnd I see brutality all over niggas killin' niggas\nThe ghetto got them being born to be killas\nFlooded with drugs and tryin to get us, so get up\nBut don't give up, ya'll gotta sit up\nIf you last before they kill us\nAnd the guerillas, try come kill us\nPillage the village and we'll be winna\nI love it when niggas the way we took it to another level\nSo many rebels doing the best shit forever remembered\nAnd in the killing fields, everybody's locked up\nAnd good niggas getting shot up da dadan dada\nMind if I say something for mine\nCause it's about time, to get serious\nA mysterious time, blind melons\nIt ain't no telling, if the willing\nWill stop chillin', then help the children\nTurning them out, then burning them out\nLike morphine, waters getting shallow\nIt's over and over the gallow\nA president in the drop, it's on now though\nThe end of life, for now so\nI think it's the ozone, bad to the bone bone\nMother Nature be long gone\nAnd don't nobody wanna do nothing but speculate\nAnd all they worried about their own\nWrote a song for the future\nMillenium, I'm in, I'm hopeing it don't last untill we all past\nLiving in the stars, looking through grass\nAboard the enterprise, recognize this, in the course of a da-da-da-da-da-da-day\nAnd thats the way we sing, thats the way we play\nThat's the way they . . now and\n\n[Hook 2X]\n\nStill got bombs from the cold war, radioactive\nAnd the critics, they won't take action\nThey want us to repo this to your satisfaction\nBut while they build more, computers keep crashing\nWhat about felling, pestilence dammit\nHow do we manage to keep standing\nLiving in a legacy of bitterness\nWith the epitimy of vigorous trips on the ships we were crammed in, slammed in\nOther man and them, why don't we demanding our damn money\nIf we can't get forty acres and a meal, let a nigga get a range rover\nShit you got two on you, I'm still waiting on a canoe, but it will never come\nI don't even know where I come from or where I'm gonna go to\nI'm headed to the mother land, but will I be accepted by the brotha man?\nAwww me so confused, with nothing to gain and everything to lose, choose\nThe righteous and the high, look in the eyes and realize the lies\nFamily ties, but not even for the have-nots\nWho the enemy? It ain't me. It ain't even the police\nUnless they trippin', and use that authority and start flippin', flippin'\nLeaving dead bodies, and with them bitchin' hotties\nThat poppin' the collar, my god I'm horny, ride shotty\nAnd tellin' the kids that ain't the way to live properly\nGet yo monopoly and get your own property\nAnd that's the way we sing, and that's the way we play\nAnd that's the way they . . . now and\n\n[Hook 2X]\n\nOoooh and the daddies and momma forgivin' so we can live with us\nAnd all the runaways get off the bus\nKids, put the guns down, come down\nIf the rest build a bridge with us, it gotta get better than this\nIt's head of the risk, shoulda been poor, and I been rich\nLost so many friends to the war shit, caution\nWhen I get to walkin', and it's mobbin', nigga in a crypt\nLife is a fight to the street life, tonight\nI might go meet the reaper, and I will give him a hug\nAnd tell him \"Thug luv won and I'm so glad to meet ya\"\nAnd that's the way we sing, and that's the way we play\nAnd that's the way they . . . now and\n\n[Hook to fade]"}], "artist": "Bizzy Bone"}