{"artist": "R. Kelly", "songs": [{"album": "12 Play", "year": "1993-11-09", "lyrics": "[Intro]\nBaby, baby let me see you freak that body body, baby\nOh yeah, 1993 to 1994\nBaby, baby let me see you freak that body body, baby\nAnd all that, I wanna see you freaky that body, baby\nBaby, baby let me see you freak that body body, baby\nUh, I wanna see things wiggle and jiggle, you know what I'm saying?\nBaby, baby let me see you freak that body body, baby\nFrom side to side, check it out\n\n[Verse 1]\nYeah baby, let me see you freak that body\nLet your booty shake, but don't letcha back break (baby)\nBaby, you got skills\nUh, so step right up and let the R get a feel  (baby)\nI wanna see you dance to a mid-tempo\nYou can stroke your body and make it look so simple  (baby)\nYou kept the wop in style\nBy bobbing your head, while your booty goes wild  (baby)\nThree to four fellas circling all around you\nHoping they'll get the chance to freak you  (baby)\nAnd your body's steady humping\nYou make the DJ wanna keep the party jumping, baby\n\n[Chorus]\nBaby, baby let me see you freak that body body, baby (uh, freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (just freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (yeah)\n\n[Verse 2]\nI love to see your daisy dukes start the shakin'\nWin the straight contest is bringin' home the bacon (baby)\nYou got the body that the song likes to shine on\nThe kind that makes the fellas wanna put the mac on (baby)\nAnd you're not afraid to get next to\nGuys when it's time to, sex the pootang (baby)\nFreakin' me all day, freakin' me all night\nMaking the R. feel so right  (baby)\nUh, 'cause that's the way I like it baby\nYou know you make me wanna shout (baby)\nYou're driving me crazy, uh\nNow let me see you freak it, baby\n\n[Chorus]\nBaby, baby let me see you freak that body body, baby (uh, freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (just let me see you baby)\nBaby, baby let me see you freak that body body, baby (freak it baby, baby uh)\nBaby, baby let me see you freak that body body, baby (yeah)\n\n[Verse 3]\nNow here's an invitation, to a pool party\nI got drinks, just don't forget to bring your body (baby)\nI wanna see ya hips swingin' uh\nNow bend over, baby, and let me see you G-stringin' (baby)\nI can hear the music pumpin'\nThe parties jumpin' on you somethin' (baby)\nSmacking ya butt while I stroke you with my stroker\nI'm with the jimmy hats because I don't play poker (baby)\nNow how 'bout a drink on me?\nWell how 'bout my body on you? (Baby)\nWell can't we just both be alone?\nUh, let me see you freak it, baby\n\n[Chorus]\nBaby, baby let me see you freak that body body, baby (uh, freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (let me see you freak it baby uh)\nBaby, baby let me see you freak that body body, baby (just freak it baby, baby uh)\nBaby, baby let me see you freak that body body, baby (just bring it down)\nBaby, baby let me see you freak that body body, baby (freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (let me see you freak it baby uh)\nBaby, baby let me see you freak that body body, baby (just freak it baby, baby uh)\nBaby, baby let me see you freak that body body, baby (just bring it down)\nBaby, baby let me see you freak that body body, baby (freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (let me see you freak it baby uh)\nBaby, baby let me see you freak that body body, baby (just freak it baby, baby uh)\nBaby, baby let me see you freak that body body, baby (just bring it down)\nBaby, baby let me see you freak that body body, baby (freak it baby, uh)\nBaby, baby let me see you freak that body body, baby (let me see you freak it baby uh)\nBaby, baby let me see you freak that body body, baby (just freak it baby, baby uh)\nBaby, baby let me see you freak that body body, baby (just bring it down)", "title": "Freak Dat Body", "image": "https://images.genius.com/e2aad237d693571aba08114531157cc6.1000x1000x1.jpg"}]}