{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/b695c6858bd6cac18823c7d02dd8ddc4.634x634x1.jpg", "title": "Brush Me Off", "year": "2014-04-01", "album": "Miami Garden Club", "lyrics": "[Chorus: Kitty]\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off and it's so often\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off, brush me off, brush me off\n\n[Verse 1: Kitty]\nI say I wanna take you home, everybody here knows\nEverybody hears me yellin' when I'm tellin' you to come over\nBut you givin' me that cold shoulder over and over\nAnd over and over (and over and over)\nDo I embarrass you? Boy, you know I'm thirsty\nI'm never scared anymore even though you hurt me\nYou know I'm desperate, your destiny, you desert me\nAnd baby, I'll be the best and you don't deserve me\nBut I'm callin' you at 3AM (3:32) and 3:26 (3:39)\nAnd 3:45 (4:14) and you still screen 'em\n\n[Pre-Chorus: Kitty]\nPut your hands up if you get the thumbs down\nPut your hands up if you get the thumbs down\nPut your hands up if you get the thumbs down\nPut your hands up, put your hands up\n\n[Chorus: Kitty]\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off and it's so often\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off, brush me off, brush me off\n\n[Verse 2: DVS]\nNow how's a single human being\nGonna hit me with this many missed calls? Miss\nIt's a problem that I'm involved in it this far, miss\nFirst of all, we was never talking and this whole shit\nJust as this is a figment, all of it, this is yo' shit\nGirl, what the deal is right now?\nI'm just tryin' to get to the heart\nOf how you feelin' right now, you know\nStop emailin' me these pics of our kids\n'Cause we don't have any kids, I don't know who you is\nAnd now you showin' up outside of the restaurant\nWho told you you should come to the restaurant?\nWho told you I would be at the restaurant?\nGirl, what, you buggin' my phone?\nBuddy, you buggin', honey, you gotta go\nStop sendin' me letters signed with your blood\nWhinin' as fuck, drunk, settin' fire to stuff, jesus\nAnd now you breakin' in my crib with a vest and a gun\nFuck, I give up, fine, I guess we're in love\n\n[Chorus: Kitty]\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off and it's so often\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off, brush me off, brush me off\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off and it's so often\nI say I wanna take you home, but I love it when you say no\nI love it when you brush me off"}]}