{"artist": "Drake", "songs": [{"year": "2010-06-15", "album": "Thank Me Later", "image": "https://images.rapgenius.com/5e1ca6bfd15258fcb4f25384da6f5ddd.500x500x1.jpg", "title": "9AM in Dallas", "lyrics": "[Verse]\nThese are my One St. Thomas flows\nMe, my niggas and some Madonna hoes\nThat look just like virgins but trust they down to go\nDiscussing life and all our common goals\nSmart kids that smoke weed, honor roll\nLook how the champagne diamonds glow\nFine dining pour another glass when the wine is low\nI'm in the crib stacking money from here to the ceiling\nWhatever it is I got, it's clearly appealing\nThese other rappers getting that inferior feeling\nI hope you feel it in your soul, spiritual healing\nTake a look at yourself, the mirror's revealing\nIf you ain't got it, you ain't got it the theory is brilliant\nPeople ask how music is going, I heard it pays\nI just came off making two million in 30 days\nDamn, \"I guess it does\" is what the message was\nSometimes I feel I be spending my money just because\nWith Weezy I'm just out here repping us\n'til I get to shake the hand of the man that's blessing us\nYeah, I know these niggas miss the mean lyrics\nKush got the room smelling like teen spirit\nI ask kindly if no one out here would bring defeat up\nUntil I lose, for now I'm the game's single leader\nI fly private so no one tells me to bring my seat up\nAnd book a suite where me and your favorite singer meet up\nWho you like, tell me who it is\nI'mma make sure that that woman is the next one on my list\nI should call it a night, but fuck it I can't resist\nThis one is for all the niggas from my city trying to diss\nWithout a response from me you really fail to exist\nAnd I love to see you fail, that feeling there is the shit\nI swear, pussy nigga get your bread up\nEnjoy the seat that the stewardess just forced your ass to let up\nWhy your scary ass looking down, pick ya head up\nNo one told you your disguise was the most ridiculous get-up?\nWith nose-plugs in now, I can smell the set-up\nSo you just wasting your time, you only making me better, yeah\nI try to tell them don't judge me because you heard stuff\nChase N. Cash that's my brother from the Surf Club\nDamn, that nigga always kept it so hood\nBack when we would smoke good at the Oakwoods\nAnd have girls fall through like coins in the couch\nNow we just fucking all the bitches they warned us about\nScared for the first time, everything just clicked\nWhat if I don't really do the numbers they predict?\nConsidering the fact that I'm the one that they just picked\nTo write a chapter in history, this shit has got me sick\nBut if I really do it don't expect to get a split\nCause this truly is some shit I don't expect for y'all to get\nI'm nervous but I'mma kill it cause they 'bout to let the realest team in\nThrowing up in the huddle nigga, Willie Beamen\nBut still throwing touchdown passes\nIn tortoise frame glasses, hopin' that someone catch it\nPeople say that old Drake, we startin' to miss it\nBut they need to be a little more specific\nIs this what y'all want? In my best Chris Tucker impression\nDucking your questions, fuck your suggestions\nMoney gets all of my love and affection\nCars all black like the cover of Essence\nI'm allergic to coming in second but I never sneeze\nY.M.O.E. nigga, yeah\n\n[Outro]\nUh, yeah, this what yall want\nOctobers Very Own\nYoung Money\nATF\nThank me later in this bitch wasssup\nFree Weezy in this bitch wasup\nJune 15th in this bitch wasup\nNoel That’s it Ahhhhhh"}]}