{"artist": "Paul Wall", "songs": [{"album": "The People’s Champ", "title": "So Many Diamonds", "image": "https://images.genius.com/19b7a5ade7ab1480228518784ccd7fcb.500x500x1.jpg", "lyrics": "[T.I.]\nAight nigga, you already know what it is man\nA-Town, H-Town connection nigga\nT.I.P. man, you understand that?\nMy homeboy Paul Wall, extended Pimp Squad Clique\nKeep it pimpin mayne!\n\n[Hook: T.I.]\nSo many diamonds in my teeth you can't see no gold\nHundred ki's in the streets, every week no O\nCertified G, a young nigga so cold\nIt's the Pimp Squad Clique, punk bitch, we so tho'ed\n\n[T.I.]\nPimp smoke grey Cadillac, 24, imagine that\nCamera in my license plate to see you when I'm backin back\nT.I.P. be smokin on that good shit imagine that\nI'm blowin on a ho that's strong enough to kill a cataract\nBy bitch I mean fro, hell to heart and had a mack attack\nGive me a brick of blow you never seen it flip as fast as that\nAnd you can keep the beef, pussy nigga I don't battle rap\nSo that bullshit you kickin through yo' teeth a gangsta laughin at\nThat shit you hear on \"Gangsta Grillz\" is real, best chill\nBefore you wake up with some gangsters in your grill and get killed\nBy a nigga named Big Phil, tote a big steel\nGive a damn if my record never sells, I'm the shit still\n\n[Hook] - 2X\n\n[Paul Wall]\nI got the diamond ice in the grill, invisible top, glass bottom\nI'm swervin lanes on the interstate, evadin laws and playin possum\nI spin the wheel I roll the dice, I look at life in a different light\n36 of that white make you a celebrity overnight\nI shoot a kite to my potnah Project, locked up doin 45\nAnd let him know I'm still holdin, them Grit Boys is on the rise\nA hundred percent no compromise, my momma raised to be a man\nI'm not concerned with the next man, gettin money, that's my plan\nI'm on the road with that boy Unique, I'm po'n drank he roll the Sweets\nT Ferris concocted a master plan, we executed it to the T\nIt's Paul Wall and T.I.P., makin haters, R.I.P\nWe so tho'ed you can't compete, our competition is obsolete\n\n[Hook] - 2X\n\n[Paul Wall]\nI'm on the hustle 25/8, ATL to the lone star state\nOn the move I'm bleedin blocks, tryin to get this paper straight\nNo time to wait no room for error, the gameplan is crystal clear\nI'm tryin to bolt up 83's and throw some ice cubes in the air\nI'm reminiscin, on my potnah Duke that died and passed away\nI'm strapped up at all times, if you flex I'mma blast away\nLike Tom Hanks on \"Castaway,\" I'm posted up just one deep\nCause these days these hoes out here be plottin to come up on the creep\nAnd these suckers be on that reach, tryin to come up off of me\nYou need to go get it, by yourself and stand up on your own two feet\nLook at me I'm star-studded, all because I punch that clock\nBurnin straights out on the block, givin it all I got\n\n[Hook] - 2X", "year": "2005-09-13"}]}