{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "American Way- Dotan", "album": null, "year": null, "lyrics": "Yeah, check it, uh\nSpot build-rocker, lil' papa killed Hoffa\nBeard lil' longer, feel strong and I'll stop ya\nDrill sergeant, still thorough, wheelbarrows of distilled vodka\nGet me real bonkers like Will Ferrell on cat tranquilizer\nRap guys get bank and think they messiahs, but they liars\nVote fo who now? You're red, white and blue?\nI'm American too, but I ain't with the president's crew\nWhat you peddlin' and who you peddlin' to?\nYou ain't got the ghetto with you\nTry'na lead my sheep to the slaughterhouse\nTalkin 'bout +Rap the Vote+, you ain't thought about\nThe black vote mean nathan, who you gonna elect\nSatan or Satan? In the hood nothin is changin, uh\nWe ain't got no choices who to choose\nTen-years ago they were tryin to stop our voices\nAnd end Hip-Hop, they some hypocrites\nCondoleeza Rice - I don't really get this chick\nTell her if she ever really cared about poor schools\nAbout poor children, then she gotta prove that she\nAin't just another coon Uncle Tom fool\nLike these MC's, gotta give 'em the rules\nLie to the youth, Uncle Tom you confused\nMight as well give the Hip-Hop community a noose\nNeed a truce with the gangs and some food for the hungry\nOn Kerry nuts, he look at you like a monkey\nYou MC's on that old slavery path\nThe Bushs'll look at yo' ass and laugh\nSee, it's all about community, let's help ourselves\nCops brutalize us get dealt with with shells\nIt's our turn, it's 'bout time we win\nNeed somebody as the hood as my councilman, uh\n\n[Chorus: Kelis]\nYeah I think about this everyday, that's the American Way, shit\nYeah I think about this everyday, that's the American Way, shit\n([Nas:] Cause that's the American way)\nYeah I think about this everyday, that's the American Way, shit\nYeah I think about this everyday, that's the American Way\n\n[Verse 2: Nas]\nUp in the steam room chillin', exfoliating the skin\nIt's rarely men conversatin' on ends, probably businessmen\nI sense good taste, and they watch us, the spots an expensive place\nManhattan New York, I'm try'na keep steamin'\nIt's good for the lungs, had plans for the evening\nThis man leans in, his boys laughing\nNow I'm the spokesperson for Black men, this always happens\nSays, \"Since all Black women care about is who got dough\nAnd all we do is call them either bitch or a Black hoe\"\nI say first brotha you ain't gotta be that cold\nSince you ignorant, I'ma show you how the facts go\nThe biggest example in scandal of history\nWere Monica Lewinksy or Donald Trump's pimping spree\nMost woman who love Jeevanji of Gucci\nAre pretentious non-Black groupies or floozies\nBut who are we to blame, not the dames\nIt's a man-made game, in essence our woman the same\nBeautiful creatures, Black girls birthed the earth\nSo they deserve to earn man's purse\nMatter fact, I'm about to go shopping with my dime\nCatch you cowards the next time, the next rhyme, uh\n\n[Chorus: Kelis singing]\nYeah I think about this everyday, that's the American Way, shit\n([Nas:] That's the American way)\nYeah I think about this everyday, that's the American Way, shit\n([Nas:] Cause that's the American way. What up, K?)\nYeah I think about this everyday, that's the American Way, shit\n([Nas:] That's the American way)\nYeah I think about this everyday, that's the American Way, shit\n([Nas:] Ha, yeah)\n\nI don't care about the runaways\nI don't care about who's gay\nI don't care about dying of AIDS\nBut I care if I got paid\nWho even cares about the president?\nI think they're making a mistake\nI don't care about the hurricane\nAs long as my family's safe\nI don't care about the candidates\nThey burnt this country to bits\nYeah I think about this everyday, that's the American Way ([Nas:] Uh)\n\nCan we make a change\nYou know it's not overnight\nLet's start the fight (Nas: And ya don't stop, uh)\nCan we make a change\nYou know it's not overnight\nLet's start the fight (Nas: Yeah)\nYeah I think about this everyday, that's the American Way"}], "artist": "Nas"}