{"songs": [{"lyrics": "Yo Dre!!\n\n[Verse 1: Ice Cube]\nIt was once said by a man who couldn't quit\n\"Dopeman, please can I have another hit?\"\nThe dopeman said, \"Cluck, I don't give a shit\nIf your girl kneeled down, and suck my dick\"\nIt all happened and the guy tried to choke her\nNigga didn't care, she ain't nothin' but a smoker\nThat's the way goes, that's the name of the game\nYoung brother gettin' over by slangin' 'caine\nGold around his neck in 14 K heaven\nBitches clockin' on his dick twenty-four/seven\nPlus he's makin' money, keep the baseheads waitin'\nRollin' six-fo' wit the fresh ass Daytons\nLivin' in Compton, Cailfornia C-A\nHis uzi up yo' ass if he don't get paid\nNigga beggin' for credit, he's knockin' out teeth\nClockin' much dollars on the 1st and 15th\nBig wad of money nuttin' less than a twenty\nYo you want a five-oh the dopeman's got plenty\nTo be a dopeman boy you must qualify\nDon't get high off your own supply\nFrom a ki' to a G it's all about money\n10 piece for a champ, base pipe comes free\nIf people out there are not hip to the fact\nIf you see somebody gettin' money for crack\nHe's the\n\n[Chorus: N.W.A]\nDopeman, dopeman! (Ay man, give me a hit)\nDopeman, dopeman! (Yo man, fuck that shit!)\nDopeman, dopeman! (We just can't quit!)\nDopeman, dopeman! (Well suck this, bitch!)\n\n[Verse 2: Dr. Dre]\nWait a minute, wait a minute\nWho the fuck are you talkin' to?\nDo you know who the fuck I am?\nMan I can't believe this shit\nThis bitch is tryin' to gank me\nYo I oughta slap you upside yo' head\nWith nine inches of limp dick\n\n[Ice Cube]\nYou need a nigga with money so you get a dopeman\nJuice that fool for as much as you can\nShe like his car, and he get wit her\nGot a black eye cause the dopeman hit her\nLet that slide and you pay it no mind\nFind that he's slappin' you all the time\nBut that's okay, cause he's so rich\nAnd you ain't nuttin' but a dopeman's bitch\nDo what he say and you keep your mouth shut\nPoppin' that trash might get you fucked up\nWell sit and cry, if the dopeman strike you\nHe don't give a fuck he got two just like you\nThere's another girl in the dopeman's life\nNot quite a bitch but far from a wife\nShe's called \"Strawberry\" and everybody know\nStrawberry, Strawberry is the neighborhood ho\nDo anything for a hit or two\nGive the bitch a rock she fucked the whole damn crew\nIt might be your wife and it might make you sick\nCome home and see her mouth on the dopeman's dick\nStrawberry, just look and you'll see her\nBut don't fuck around she'll give you gonnorhea\nIf people out there are not hip to the fact\nStrawberry is a girl sellin' pussy for crack\nTo the\n\n[Chorus: N.W.A]\nDopeman, dopeman! (Ay man, give me a hit)\nDopeman, dopeman! (Yo man, fuck that shit!)\nDopeman, dopeman! (In yo' face)\nDopeman, dopeman! \"Yo Dre!! Kick in the bass!!\"\n\n[Verse 3: Ice Cube]\nIf you smoke 'caine, you a stupid motherfucker\nKnown around the hood as the schoolyard clucker\nDoin' that crack with all the money you got\nOn your hands and knees, searchin' for a piece of rock\nJonesin' for a hit, and you're lookin' for mo'\nDone stole the Alpine out of Eazy's six-fo'\nYou need your ass whupped cause it's out of this earth\nTo get a ten-piece need a dollar fifty work\nKnucklehead nigga, yeah you turned into a crook\nBut swear up and down boy that you ain't hooked\nYou beat your friend up, and you whupped his ass long\nCause he hit the pipe til the rock was all gone\nYou robbin' and stealin', buggin' and illin'\nWhile the dopeman's dealin', what is healin' yo' pain\nCocaine, this shit's insane\nYo E she's a berry, let's run a train\n(Man, I wouldn't touch that bitch) me neither\nHo go home and wash out your beaver\nAnd niggas out there messin' up people's health\nYo, what the fuck you gotta say for yourself?\n\n[Eazy-E]\nWell I'm the dopeman, yeah boy, I wear courderoy\nMoney up to here but unemployed\nYou keep smokin' that rock and my pockets gettin' bigger\n(Yo, got that five-oh double up nigga!)\nYeah high rollin', big money I'm foldin'\nBitch on my tip for the dick I'm holdin'\nSprung strawberry jockin' me so early\nHo you wanna hit you gotta get your knees dirty\nNow that's my life, that's how it's cut\n\"Hey dopeman!\" Bitch, shut the fuck up!\nGotta make a run, it's a big money deal\nGankers got the fake but you can get the real\nFrom the\n\n[Chorus: N.W.A]\nDopeman, dopeman! (Yeah that's me)\nDopeman, dopeman! (Yo can I get a G?)\nDopeman, dopeman! (Clock as much as he can)\nFuck this shit who am I? THE DOPEMAN!\n\n[Outro: Krazy D]\nYo Mr. Dopeman, you think you're slick\nYou sold crack to my sister, and now she's sick\nBut if she happens to die, because of your drug\nI'm puttin' in your culo, a .38 slug", "album": "Straight Outta Compton", "year": "1988-08-08", "title": "Dopeman (Remix)", "image": "https://images.genius.com/9b8612842839bb0b96c57e25809d1799.471x469x1.jpg"}], "artist": "N.W.A"}