{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Beanie Sigel]\nBear witness to the greatest, can't beat us, join us\nKeep heaters on us, with red lasers\nNow fair warning, sure shots won't graze ya\nWe hug corners, play blocks like Gators\nWith bundles on us, serve tre's like waiters\nIt's the life we chose... to hustle\nCan't stop it, can't knock it\nHalf the profit get flown out Vegas\nMe and my niggas try and break tables\nStack chips like Connect Four\nWhile you pricks try and whip try and stretch more\nCharge less for, that ain't the program\nGet ya lessons from the snow man\nLike Pillsbury I get the dough man\nI'll off ya head for a slice of bread\nI keep my word and I'm true to my peeps\nGive me a bird and my crew gon' eat\nI'm over the stove like Cuban Links\nBreaking down cash money like Baby do\nYou niggas soft like baby food\n'Round the world niggas pay me dues\nWhile you niggas sing the same old song like Sadies do\nGrown man nigga, baby who?\nI'll send you shots from the baby zoo\nOld game like Grady fool\nPropane flow flame you dudes\nNo name's don't claim ya shoes\n\nOnce again its on nigga, Sigel hard like corn liqour\nI'll take you out this world like you was born nigga\nButt naked covered in blood, gasping for air\nClinging for dear life, nigga you dead right\n\n[Jay-Z]\nSince you was a baby coward\nWe been sprinkling the world with baby powder\nSo Fresh and So Clean\nBeen an outcast since I was a teen\nBut I outlast cuz I outblast anybody you bring\nYoung, you got it the prophet I told ya'll niggas\nThen I showed ya'll niggas, you can't knock it\nDon't get carried away, you a mule nigga (mule nigga)\nWhere was you nigga? I was doing this here like Mary J\nLike everyday, and was true nigga\n\n[Beanie Sigel]\nThey can't question what we do Jigga\n\n[Jay-Z]\nOnce again it's on, Young run through you niggas\nLike a glitch in the computer nigga\nI'm the shit, I'm a sewer nigga\nThis is Jay everyday, no days off, Ferris Bueler nigga\n\n[Beanie Sigel]\nB-Sig' Fred Krueger niggas\nNightmare your medulla nigga\nYou scared cuz I grew with Jigga\nHe said \"Sig' you that nigga,\" couldn't see his vision\nBut then he drew the picture, like a compository sketch\nYeah Sig' stay honest I'll deposit you a check\nThere's a secret society, all we ask is trust\nNo G money shit all we gots is us\nTrue indeed, yes, more better, yes\nMore cheddar, S.P. chain, jeans and sweaters\nMovies, cartoons, labels, etcetera\nFill in the blanks and drop blocks like Tetris or\nGet off the block, run south with M. Betha\nFrom my block to your block, shout out to M Extra\nWho the fuck (fuck) want (want) what (what)\nNone of you niggas is B-Sig' word I'm done with you niggas\n\n[Beanie Sigel]\nOnce again it's on, fuck it we ain't through wit niggas\nTwin towers here to ruin niggas\nYou couldn't break up the towers with Tomjanovich\nOr Osama bombin' shit\nWe slay niggas wit K's, we the drama men\nGet it right young scrap don't even try it boy (boy)\nYou rather slide down the razor blade slidin' board\nI'm a live wire, hula hoop barb wire\nRun through hell with gasoline draws on\nYou can't mute me put the pause on\nMy guns shoot like fast-forward's on\nAnd dress cute when the war's off\nWhat you doing dawg, you playing wit it\nYou make your bed right you laying in it\nYou keep your shed tight you stayin' in it\nYou bringing niggas where your kids sleep\nI sing to niggas while the kids sleep\nRock-a-bye muthafucka\nI hope you high muthafucka\nReady to die muthafucka\n\nWho shot ya? Separate the weak from State Prop' the\nKids who squash beef and run them streets\n\n[Jay-Z]\nOnce again it's on nigga, bring the drama to ya lawn nigga\nTell ya mama \"bye bye\" get ready to mourn sister, it's a\nSee what you got here's a full blown twister\nYou nothing but hot air, it's not fair\nThe reason why we lead the pack, this is a marathon\nYou start off fast then you wheezing in the back\nSo even if I slack, I got enough lee-way\nTo put out The Reason by the Mac, Philadelphia Freeway\nAnd I'm back, without leaving I'm here, but you can't see him\nI gave you the Blueprint but you can't be him\nSo no matter what you been told or the records you sold\nDeep inside you know that it's only one Hov\nYoung Vito, voice of the young people\nIf my life is a movie then Sigel be the sequel\nWe bring it to your door with Bleek peeking through your peek hole\nAnd don't get scared nigga, alert ya people\n\n[Beanie Sigel]\nOnce again it's on", "image": "https://images.genius.com/48c4319dfc3c978405c6c446d03d8171.500x500x1.jpg", "year": "2005-03-29", "title": "It’s On", "album": "The B. Coming"}]}