{"songs": [{"year": "2018-05-04", "image": "https://images.genius.com/b6424d6ad1ab459f68bef7045b421240.1000x1000x1.jpg", "title": "Mamacita", "album": "SIMI", "lyrics": "[Intro]\nHah, hah, girl you know I'm a gentleman, hah, hah\nOG Parker\nYeah, I'ma hold the door for you and all that girl, you know\nOpen the door for you, open the car, you know what I'm saying?\n\n[Chorus]\nSay, that's your ho, that's my mamacita (word)\nI'm about to stick it in her like a new needle (a needle)\nThen ride off in the two-seater (two-seater)\nSquad full of animals, zookeeper (zookeeper)\nI'm about to stomp her, no beetle (no beetle)\nPost in the kitchen, them pots and the beakers (word)\nLooking for a nigga's senorita (huh?)\nGot her on her knees like she praying to a Jesus (she slurpin')\n\n[Verse]\nBaby lose your man, he jealous (he jealous)\nI just wanna wop like Fetty (like Fetty)\nYou know I bang Grape, no jelly (crip)\nWhat you need? I got it, I sell it (what you need?)\nFuck the bitch the first day I met her (I met her)\nRock and roll like heavy metal (heavy metal)\nKinda weird 'cause I let my dog pet her (he pet her)\nRock J's, no Maison Margiela (no 'gielas)\nMove pounds, y'all niggas move feathers (move feathers)\nGun you down because my niggas shoot better (do better)\nWho better? My nigga, I'm too better (huh?)\nBitch I been a king, related to Coretta\nHotspot, tether (tether), extendos on Berettas (Beretta)\nYou dance with the devil (the devil), I dance with Cinderellas (ooh)\nMy bitch bad, she got a nice ass (nice ass)\nAnd she got some class (class), I might buy her a bag (a bag)\nYour bitch, whoa (whoa), that ho need to roll (to roll)\nI'm a gentleman (huh?), you know I had to hold the door (that's on my mama)\n\n[Chorus]\nSay, that's your ho, that's my mamacita (word)\nI'm about to stick it in her like a new needle (a needle)\nThen ride off in the two-seater (two-seater)\nSquad full of animals, zookeeper (zookeeper)\nI'm about to stomp her, no beetle (no beetle)\nPost in the kitchen, them pots and the beakers (word)\nLooking for a nigga's senorita (huh?)\nGot her on her knees like she praying to a Jesus (she slurpin')"}], "artist": "BlocBoy JB"}