{"songs": [{"year": null, "title": "Narcissist", "image": "https://images.genius.com/af357ab92dde48966f2efd2335518e9f.268x268x1.jpg", "lyrics": "I don't look at myself in the mirror because I'm a narcissist\nI simply like to watch myself exist...\nNow I'm in a fog and mist...\nNow my reflection is anonymous\nPonder this!\n\nI've seen a reflection of my soul in the store window\nCaught in limbo 'cause I was dressed all in Timbo's\nHaving fantasies of playing Polo with Ralph Lauren on a Tommy Hill\nAnd my paper thin spirit was still grieving from the Versace kill in Florida\nOpened the door to the store and I walked down the corridor\nTo see they had a blow out sale on Nautica\nI've always been a Lord of the button down Flies\nBeing they were half-priced, I pass 'em on by looking for Levis\nBut Guess what? All my favorite clothing lines and hip designs\nWere being liquidized and it made me sick to my eyes\nI don't understand, when I had no ends, the price was quick to rise\nI'd buy a pair of trends even if it didn't fit my size\nPurchase a surplus of fads from merchants whose ads\nMade these cheap ass fabrics that were so worthless and sad\nJust look priceless, they used unethical devices to attack my sense of\nSelf-worth during my prepubescent crisis\nIt fed into my insecurities, so instead of being righteous\nI want everyone to see me like this\nIt's all about who looks the nicest\nIce is falling off my Rolie onto my body, shoot!\nI hope to hell it doesn't melt and ruin my Armani suit\nWhile I'm sweatin' this,some kid who doesn't got any loot\nIs buying my necklace along with my same exact khakis and army boots\nWhat?! This is blasphemous!\nSince Adidas tried changing its logo\nThere ain't been nothing as wack as this\nIt's probably a stunt being pulled by Animal Rights activists\nBecause of all that Third World country garbage but I'm a pacifist\nSo while these monkeys sweat over my name brands that exchange hands\nFrom enslaved lands, I wonder if I'm the same man\nWithout reward...for what I bought but CAN'T still afford\nThis is the type of self-realization that might have killed the Lord\nI didn't mind working free as a walking billboard\nBut now I want my money back...as the ice spilled and poured\nOnto the floor I did see a distorted reflection of my Nike hat\nI don't know how others might react\nFor me it was an unsightly act that helped me get my psyche back\nI stood 5 feet back, afraid that it might strike me like Shaclack clack!\nYa'll think I'm kidding? It's not big thing\nWhat I seen made my heart hurt, stomach turn, throat burn, teeth cringe\nSpine tingle, and ribs sting\nI noticed that the swoosh symbol was nothing but a whip in mid-swing..\n\nI don't look at myself in the mirror because I'm a narcissist\nI simply like to watch myself exist...\nI'm in a fog and mist...", "album": "The Known Unsoldier...Sick Of Waging War"}], "artist": "Sage Francis"}