{"songs": [{"title": "Confe$$ions", "album": "Gravity", "year": "2012-09-04", "image": "https://images.genius.com/2a788a1fbb97c90bc9a2a97a0fa1f794.1000x1000x1.jpg", "lyrics": "[Verse 1: Lecrae]\nI know some people with mo’ money than we’ll ever see\nEver see someone buy a private island they never see?\nEver see every sea on yo’ own personal yacht?\nTake jog around yo’ block that you bought from selling your stock?\nNot\nIn this lifetime, some of them my potna’s\nThey don't believe in karma, but they believe in commas\nAnd they believe they dollas’ for a peace o’ mind\nPut a price upon they head and they'd be fine with that fine\nCause you find when you can buy the park, you can hate the rides\nThey was fun in the beginning, now it seems they not as thrillin’\nAnd you out make a killin’, but it never feels fulfillin’\nSo, they call me tell me “Crae, this how I’m feelin’.”\n\n[Hook: EVRYWHR]\nConfessions of a millionaire, lifestyles of the famous\nThere’s nothing I can’t I have, you say it looks so amazing\nWell, I would trade it all away for my sanity\n\n[Verse 2: Lecrae]\nLook, I ain't finna pretend that car and my crib\nGive me worth and meaning ‘cuz I know they never did\nThem numbers in my bank account are no reason for livin’\nAnd sleepin’ with bad women really doesn't keep me driven\nI'm sure this man sittin’ beside me is beside himself\nTryna’ find himself\nYeah, he flyin’ first class thinkin’ everyone behind him is a peon\nGoin’ home to a model chick he prolly gon’ cheat on\nHe’ll be empty for eons; you know what I be on\nMoney don’t solve it all, man, look what happen to Dion\nI bought my dream house, but only made me wake up\nIt all falls down even if you got ya’ cake up\n\n[Hook: EVRYWHR]\nConfessions of a millionaire, lifestyles of the famous\nThere’s nothing I can’t I have, you say it looks so amazing\nWell, I would trade it all away for my sanity\n\n[Verse 3: Lecrae]\nI've flown first class, flown private jets\nRode in the foreign cars; still so unimpressed\n‘Cause after she spent all that money on her chest\nShe thought it make her life better, but she finds she still depressed\nAin't nothing wrong with havin’ it. Matter fact, go and get it\nBut if you find identity in it then go ‘n forget it\nYou gain the whole world but lost the only thing ya’ own\n‘Cause everything else is just a temporary loan\n\n[Hook]\nConfessions of a millionaire, lifestyles of the famous\nThere’s nothing I can’t I have, you say it looks so amazing\nWell, I would trade it all away for my sanity"}], "artist": "Lecrae"}