{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/0fc160efa6b9e963313301478ef55789.1000x1000x1.jpg", "title": "I’m That Nigga", "year": "2014-12-30", "album": "Heart Of The Projects", "lyrics": "[Intro 1: Kodak Black]\nAye man let me get my Rem on ice man\nLet me get that check straight hunnids\nLet me get my back in before I hit yo city, or I ain't going straight up, for real\nI'm that nigga now man, I ain't in the projects shooting dice no more\nI'm outchea doe, project baby heart of the projects man\nYou digg, mount up!\n\n[Verse 1: Kodak Black]\nExcuse me where my stylist?\nPop my collar please\nSecurity, get these bitches off of me\nPaparazzi love me I got lots of cheese\nInstagram, Kodak Black follow me\nReally I be tricking nigga Halloween\nI ate my veggies. Ma I'm healthy I smoke broccoli\nHonestly, you mad that you proud of me\nKodak oxygen I got lots of trees\nAll this gwalla be stuffed up in my my Robin jeans\nDo it with no hands, girl join my soccer team\nPhilosophy\nSection 8 democracy\nI rolled the dice and went to jail, no Monopoly\n\n[Hook: Kodak Black]\nI told them that the money train is coming, don't get left (don't get left)\nNigga should've hurried up and jumped up on my trail\nNiggas on that groupie shit, they talking me to death\nFuck that bouji bitch you ain't got nothing go to hell\nDamnit I don't know what's goin' through they fucking head\nOnce I  get the deal I swear to god you niggas dead\nOh so you that Kodak black nigga, huh?\nYou the golden one? Streets say you the chosen one\n\nI'm that nigga!\n\n[Verse 2: Kodak Black]\nLil nigga pulling up in foreigners\nJackboy right behind me where we slide they know it's us\nI was on the 4 now I'm on 5 pour it up (lean, lean, lean, lean)\nKodak black performing live you know they showing up\nYea I got lil cool right here with his 40 tucked\nI broke up with my coupe, I'm in love with rover trucks\nKodak you that nigga, I must admit, K you the man\n'Cause I got on my shit lil nigga running up the band's\nBoy I need my bread, 'bout my cheese I go ham\nI be on the mollys, I don't fuck 'round with no Xans\nBoy that work be roll come a couple I ain't playing\nBoy I make them junkies smoke that dope right out the can\n\n[Hook: Kodak Black]\nI told them that the money train is coming, don't get left (don't get left)\nNigga should've hurried up and jumped up on my trail\nNiggas on that groupie shit, they talking me to death\nFuck that boujee bitch you ain't got nothing go to hell\nDamn it I don't know what's goin' through they fucking head\nOnce I  get the deal I swear to god you niggas dead\nOh, so you that Kodak black nigga, huh?\nYou the golden one? Streets say you the chosen one\n\nI'm that nigga\n\nChosen one\n(I'm that nigga)\n\nYou the golden one?\nStreets say you the chosen one\n\nI'm that nigga"}]}