{"songs": [{"image": "https://images.genius.com/c97dc009b7b1ff0982e14799c3dd3042.375x375x1.jpg", "lyrics": "[Produced by Larry Fisherman]\n\n[Intro]\nYo, yo, yo\n\n[Verse 1]\nLook, concoction of hamentashens, launching a bottle rocket (okay)\nDone being nice, I'm here for your life and all the profits (woah)\nI'm not your conscience, you nuts? Almonds and Häagen-Dazs\nAuction off your grandfather's watch from the Holocaust\nI'm iconic, naked walking in the garden and bird watching\nAlarming all of these cardinals like I need a pope (pope)\nPuffing that white smoke (smoke), get faded and play the maestro\nI'm ice cold, bunny slippers, nice robe (probably velvet)\nSneaky bitch stole my Rollie last night, yo\nI might know some dyke hoes who can fight though (yeah)\nWalking on a tight rope, underneath a microscope\nBut close up, we all just molecules and isotopes (that's very deep)\nWhat psychic don't know the future?\nTo live life, you kids might just close your computer (go get some exercise)\nThe street lights might blind you though (blind you though)\nMake a collage and look at it through a kaleidoscope\n\n[Chorus]\nThere's a bird, in the sky\nLook at him fly, why?\nWhy, why, why, why, why, why, why, why\nWhy, why, why, why, why, why, why, why\nLet the money pile, I'll be running wild\nLife's a mothafuckin' joke so we fuck around\nFeel like I do this in my sleep\nLiterally, I do this in my sleep\n\n[Verse 2]\nIt's an impression of Bueller\nYeah, yeah, a little TV money (okay), dollars for sense of humor (yeah)\nScholar but my attendance like Bueller, so no use for a tutor\nSome cold brews in the cooler (have one)\nComing through in the wood grain PT Cruiser, stunting\nI'm pissed off like a blind person looking for a restroom (restroom)\nProbably be dead soon inhaling cigarette fumes (coughs)\nSorry for that blind people comment, that was just rude (yeah)\nAnd I was raised better, say God bless you (God bless you)\nI'm Kenny Powers, you're more of a Debbie Downer\nMy bitch taking off her trousers every time I get around her\nI'm nasty, I never shower, go sleep on a bed of flowers\nNot into this conversation, I've been in my head for hours\nI'm out\n\n[Chorus]\nThere's a bird, in the sky\nLook at him fly, why?\nWhy, why, why, why, why, why, why, why\nWhy, why, why, why, why, why, why, why\nLet the money pile, I'll be running wild\nLife's a mothafuckin' joke so we fuck around\nFeel like I do this in my sleep\nLiterally, I do this in my sleep", "year": "2013-06-18", "album": "Watching Movies With the Sound Off", "title": "Avian"}], "artist": "Mac Miller"}