{"songs": [{"image": "https://images.genius.com/88580af983438f1c5296bb2a8a2668c1.1000x1000x1.jpg", "title": "Reality Check", "album": "Telefone", "year": "2016-07-31", "lyrics": "[Verse 1: Noname]\nOpportunity knockin', a nigga was out for coffee\nInadequate like my window, the Grammys is way too lofty\nAnd I could stay here forever, I could die here\nI don't have to try here; Can I get my two sugars please?\nJesus made an album, I'm still waiting in the line for cream\nShe dream in techni-color, live black and white\nOpportunity knockin', a nigga just got her nails done\nSkeletons in my closet gon' open the door when Yale come\nThey ain't gonna wanna see my silhouette rap\nHe's fucking cognac, my smile in all black\nMississippi vagabond; Granny gon' turn up in her grave\nAnd say, \"My granny really was a slave for this?\nAll your uncompleted similes and pages ripped\nYou know they whipped us niggas; How you afraid to rap it?\nYou went to heaven after so we could free them now\nAin't no ocean floor when you can be a Yeezus now.\"\n\n[Hook: Eryn Allen Kane]\nDon't fear the light that dwells deep within\nYou are powerful beyond what you imagine\nJust let your light glow\n\n[Verse 2: Noname]\nSeventeen moments and cloudy days on my snap\nMysterious aberration, illuminated the trap\nMy telefone-calications synonymous with the sunrise\nMountains against the foreground forever me coming back\nI ain't gonna cry; the last time Ali marched Chicago\nTwenty four and a late mojo teaching me how to drive\nWhole world inside my rear view\nThis feeling, me so alive\nThis feeling, me so alive, enjoy the joyride\nOpportunity knockin', it's finally time to answer\nThe doorbell was only broken cause auntie was fighting cancer\nAnd cigarettes on my mantle keep callin me by my first name\nLoving me when I'm lonely, pretending they really Noname\n\n[Hook: Eryn Allen Kane]\nDon't fear the light that dwells deep within\nYou are powerful beyond what you imagine\nJust let your light glow\n\n[Outro: Akenya]\nAnd when that call comes (You better say hello)\nYou better say hello, no hesitation\n(You better, yeah) No hiding deep down below\nNo beg your pardon (You better stay and grow)\nYou better stay and grow your liberation\n(You better, yeah) For your lonely soul\nOr you’ll be on your own"}], "artist": "Noname"}