{"artist": "Wiz Khalifa", "songs": [{"year": null, "lyrics": "[Intro]\n\n[Verse]\nMotherfucker it's, W - I\nAct up, knuckles'll fly\nSwing somethin' that'll bubble your eye\nI've been trouble since the day I was born\nA couple mix-ups\nSo I switched up, made it a song\nPut your fists up, say to the song\nYou know the style, get wild\nLike a child I was raised in the corn...nigga\nAnd everybody wanna face-off, until they face off\nI'm like a jet when I take off\nI'm the one the grip the beat, youngin'\nNo bullshit, I spit the heat, youngin'\nHit the streets, youngin'\nYou'll hear my name ring bells\nAt your face, I aim these shells\nYoung Wiz,\"Hey pimpin\"\nPrince of the city of steel ain't trippin'\nPricks try to claim to be real, straight simpin'\nY'all niggas ain't listenin'\nHold up! Who you...\nKnow realer? Flow iller?\nMove with a team of goons and go-rillas\nBruise all the crews that choose they don't feel us\nDudes probably thought I'd lose...NO, NIGGA!\nGo figga, man I'm playin' to win\nIf a nigga act up, then I'm layin' him in\nYou can see a little change from the way that it's been\nSaid it before, I'll say it again..\nMotherfucker it's W, I (dot) Z (dot), playa!\nCowards all stuck, I'm up at the top layer\nHalf of y'all suck, it's nothin' to drop haters\nStackin' all bucks, man fuck it it's not fa-ir\nCause my team keep winnin', keep women\nKeep coming up with amounts of dollars, and keep spendin' em\nFrom the home where the hammers' shootin'\nCats all day, hand-in-hand we're moving\nThey can't swing like a fan was movin'\nGet chopped up like a jam in Houston\nIt's young Wiz, huh? Steel City, yeah!\nPittsburgh-fitted low, I'm the rookie of the year\nYeah! And I rock and roll\n'Till the kid rock Rollies, and my pockets swole\nGetting paid's not optional\nI tell chicks, C.D.C. - Cash Daddy's Checks and roll\n\n[Outro]", "image": "https://images.genius.com/22079eaff0395f48f7e1891ca05897a0.1000x1000x1.jpg", "album": "Prince of the City: Welcome to Pistolvania", "title": "40 Bars"}]}