{"artist": "360", "songs": [{"album": "Please Be Seated", "year": "2010-04-22", "title": "Electric Feel", "image": "https://images.genius.com/fcbf34bbaeea7510da3d3de60a3d77a6.720x720x1.jpg", "lyrics": "[Intro: 360]\nPeople ask why they call me \"360\"... don't\nYeah, 360, Please Be Seated\nForthwrite, uh, uh\nRockin' that Justice shit\nLet's get dirty on it, ayy\nLet's do this, babe\nYo, yeah, uh\n\n[Verse 1: 360]\nThey say the best rappers have died\nSo make way for the best rapper alive\nAnd they hate, get sent back in a line\nAnd some have come close, the rest haven't survived\nI got it yo, it's my turn up in\nPay attention and you might learn something\n360, I'm like Biggie Smalls\nThe difference is that I'm white, thin, and tall\nYo, I dominate locally\nAfter that, yo, I'll dominate globally\nI'll be patiently taking it overseas\nAnd show the world ain't got nothing over me, nah\nYo, I'm looking for some heads to kill\nStep to the 6, you can test your skill\nBring 'em all out, they get kicked in the mouth\nAnd the king's in the house so the rest should kneel\n\n[Chorus 1: MGMT]\nOoh, girl!\nShock me like an electric eel\nBaby girl\nTurn me on with your electric feel\nAll along the Eastern shore\n\n[Verse 2: 360]\nDamn, '60 getting on his techno shit\nJumpin' aboard the electro ship\nBut the beat is impressive, how the fuck\nHe gonna get any love for this metro shit?\nSince the song with Pez, no shit\nWith girls, I haven't heard the N.O. since\nHeard some on that yes-no tip\nKnow they shouldn't but they wanna like \"Yes, no... shit!\"\nHip-hop yes, yes, it'll change\nFor beats like this, I'm accepting the blame\nSent them away 'fore we left in a plane\nGettin' trapped in the sky while the rest will remain\nI been doing it since Grade 5 dude\nAnd to get here it takes time, true\nMotherfucker, I done paid my dues\nIt's game time (Hey?), so they might lose\n\n[Chorus 2: MGMT]\nOoh, girl!\nShock me like an electric eel\nBaby girl\nTurn me on with your electric feel\nDo what you\n\n[Break: 360]\nJust fuckin' stylin' on you cunts\nJust fuckin' rip off\n\n[Verse 3: 360]\nYo, to get where I'm at, yo, it took its time\nGotta keep going, never look behind\nAnd I ain't thinking that I should be fine\n'Cause I know that I will be, I'll go till it kills me\nKeep looking up inside for the rescue\nUnderstand that in time it will get you\nFuck the stars, I'm flying to Neptune\nI'll get what I want, in my mind is the menu\nNow I know that I'm finally there\nWhile you're striving and fighting for guys to respect you\nYou can tell that it might be the year\nAnd it's time, and it's rightfully mine, I can end you\n\n[Outro: 360]\nYeah\nOnce I got told that the secret of being a ninja\nIs just keep it real every time you're out, you know\nJust make sure you keep your fuckin' feet out\nHahaha\nSee, the difference is that there's other ninjas\nThat think they can just bring you down whenever they want\nBut if you don't let 'em, then you're still a real ninja\nYou just stay true to your own ninja hood\nThat's how it goes\nKeep that ninja, babe!"}]}