{"songs": [{"album": "From A Planet Called Harlem", "image": "https://images.genius.com/d8c05b527f7360b8e57ac7d6e1bef6a1.500x500x1.jpg", "year": "2009-08-16", "title": "I Get Crazy", "lyrics": "[Chorus]\nI get crazy, I-I get crazy\nI-I get crazy, I-I get crazy\n\n[Verse 1: Nicki Minaj]\nI just came out of the motherfuckin' old school\nGot my Mac Notebook with the Pro Tools\nYou bitches ain't ready for Nicki Lewinsky\nBad woof woof, flyer than a Frisbee\nSo I'm up in Mandalay, eating mangos\nKeep a couple pink toes in my sandals\nGot some bangles all over my ankles\nSuch a star, they say I'm a Star Spangle\nBa-ba-ba-ba-ba-banner, I am the rap Hannah\nMo-Mon-Montana, so fix your antenna\nI keep three hoes but don't call me Santa\nAnd I am flyer then reindeer in the winter (in the winter)\n\n[Verse 2: Teyana Taylor]\nIs it a bird or a plane?\nNo, no, Teyana is the name\nSo you say you wanna fly?\nWell, follow me and take flight, my turn\nBaby, I'm so attention, I'm a center\nNot to mention, they go crazy when I enter\nI'm a realist so they figure I'm a hipster\nBury the birds, look at the curves, I'm limper\nI'm swaggin', I'm braggin', I'm stuntin', I'm prattlin'\nI dress so dip, you're sick 'cause I'm slicker than Rick\nAnd when I heard the instrumental, told them \"gimme a clip\"\nI'm murderin' this, I must really like this, shh\nIt's me, the new generation of rap\nIt's T, lowkey, and I lay in the back\nWhat, you was waitin' for a nigga [?]  in rap?\nNah, B, but you can keep hopin' for that\n\n[Chorus]\nI get crazy, I get crazy, I get crazy, I get crazy, I get crazy\nI get crazy, I get crazy, I get crazy, I get crazy\n\n[Verse 3: Lil Wayne]\n1, 2, 3rd floor, hospital bound\nNiggas is doors and I knock niggas down\nStraightjacket crooked, I hear you lookin\nI promise I'm hard and I swear you pussy\nI ain't crazy, no, yes, I am\nRight up in the cuckoo nest I land\nI'm fly, now eat my bird shit\nYeah, I'm crazy, crazy 'bout your bitch\nWild animal on my bewildered shit\nI love brain so I'm lookin' for a nerd bitch\nIt's Nicki Minaj, the superb witch\nAnd Weezy F Baby, no, Weezy F Crazy\n\n[Chorus]\nI get crazy, I-I get crazy\nI-I get crazy, I-I get crazy"}], "artist": "Teyana Taylor"}