{"artist": "The Game", "songs": [{"title": "Breakfast with Al Pacino", "album": "OKE: Operation Kill Everything ", "year": null, "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg", "lyrics": "[Hook]\nThe other day I had breakfast with Al Pacino (politicking)\nTold him I wish he was in Casino (probably checking)\nBreathe\nFresh out the kitchen with waffles and cappuccino (hood nigga)\nEating breakfast with Al Pacino (Wass good nigga?)\nPlease\n\n[Verse 1]\nMy life a movie directed by Tarantino, my Lambo lounging the kimo\nI’m at that fork in the road like a torturous Hov\nI ain’t wanna sell blow, I was forced to that stow\nSee, I was forced to be hard, without multiple goals\nSo I multiplied and magnified that coke, till I was satisfied\nTook oath in my last supply, I kept my tenants classified\nMy momma ain’t know nah\nMy daddy and my uncles gave me bundles\nPut it on bees I made it bumble\nBred 11’s, thou should not stumble\nIn bed by eleven, that’s where she thought but I’m in a jungle\nSayin no this ain’t no training day\nI’m on that track, but I put them trains away\nAnd my enemies on this train today\nMy dreams is where them bangers lay\nThe sky is where my fingers stay\nUnless I bring the K, and choppers making rainy day\nNiggas praying to Yeezus\nRemember before we was famous Ye?\nA younger Game would say\n\n[Hook]\n\n[Verse 2]\nAnd if you must know, nobody’s perfect\nWe screw up, we make mistakes\nHave heart breaks, go through hard times\nBut you need to know that’s life\nThe world ain’t full of assholes\nBut they strategically placed\nSo that you could come across one every day\nYou know what I’m saying?\nSometimes things that happen in life are not part of a plan\nBut when that happens, don’t give up on your dreams!\nJust find another way to reach em\nJust give your food for thought, ladies and gentleman\nWorrying won’t stop the bad from happening\nBut it will stop the good from being a joy\nYes sir!"}]}