{"artist": "Yung Joc", "songs": [{"album": "Ready to Fly", "image": "https://images.genius.com/68aff5bd0c087e6a30dd674c2528326c.500x500x1.jpg", "year": "2011-05-21", "lyrics": "[Hook]\nCalm down, bow down, draw down, fire rounds\nDrip, drip, drip, drip, drip, drip...\n\n[Verse 1: Young Joc]\nLeave a hater drippin like a muthafuckin faucet\nLet it ride sideways, and bust my tool offset\nLeave these suckas leakin like a hole in a boat\nThen I turn them to a cancer patient, holes in they throat\nToss his body off the boat, let 'em float off shore\nBefore he hit the bottom, I be chillin' on the golf course\nI guess you call that hole in one\nCatch 'em at the daycare, I kill 'em holdin' his son\nIt's like a horror movie, catch it at the cinema\nPlug 'em like an enema, he drippin like chlamydia\nI see you administer IV's, I be to sinister\nGet rid of 'em, diminish 'em\nSit 'em in front of the ministers\nSo I suggest you watch your words like a teleprompter\nI got hella choppas like folks that's in helicopters\nPop 'em, Orville Redenbacher when the straps out\nNigga sees his chest drippin, watch that pussy pass out\n\n[Hook]\n\n[Verse 2: Lil Wayne]\nSuwoo to the beehive, strapped like T.I\nI keep that bitch on me, like \"The Book of Eli\"\nI just shoot 'em all, so I don't have to decide\nSplit your body up, they gotta bury your ass three times\nRun up in your house, leave your brains on the couch\nShoot up everything, fuck is aimin about?\nEmpty that clip, then that bitch slide out\nContinue that procedure till them pussy's dried out\nI'm a east side gangster, I ain't never been a buster\nNina is a cold black bitch, but I trust her\nI don't need a psychic to tell me I'm a hustler\nCause bitch, I'm all about my paper, like Usher\n\n[Hook]\n\n[Verse 3: Yo Gotti]\nI got guns like I want it\nAssassin like 100, but this ain't no fuckin movie so you pussies don't want it\nHave you sick to your stomach like a rollercoaster would\nI'mma tell you this, this adventures of the hood\nAll bull shit to the side nigga, I'll blow your ass off\nYoung nigga shit, I do it with my mask off\nCrack's dumb as shit, yea I'll fuck around and crash ya'll\nRich nigga shit, be the first nigga to run out\nOnce I bring them guns around, everything change\nPussy ass niggas start actin so lame like\n\"I don't want no problem, I won't look at ya chain\nI won't talkin bout ya dog, I don't even know ya name\"\nCall me cocky, back in the day, I'm Mr. Rubberband\nMr. cook it out the frame, true\nAnd you? Mr. You-should-be-ashamed\nAnd disrespected a G, you'll be Mr. Leakin-out-ya-brains\n\n[Hook]", "title": "Drip (Remix)"}]}