{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/21af1b75150287897aef54312f0bc97a.500x500x1.jpg", "title": "Gladiator", "year": "2010-08-01", "album": "Xerxes the God-King!", "lyrics": "[Verse 1: King Gordy]\nYou can try to fight us, you'll collide with lions\nI am likely to triumph, despite 9 of us dying\n300 of us, 3 million of them\nKeep coming, we're fucking them up, we're piercing their skin\nChop their heads off. Tear it off, chew on their limbs\nDrink blood for protein and yes we'll do it again\nYour king's a coward, don't care what you do with your men\nBut we are soldier and will die keeping it true til the end\nPut me in a arena, give me one sword to defend\nMyself against a billion, let the bloody war begin\nThen I walk out without any signs of me even being in battle, gladiator\nSomething you've never seen or could fathom\nI'm a general, put inside a pit this shit is pitiful, walking around dead animal\nCarcasses cause I slit his throat\nYou can see I'm heartless a part of this comes with getting thrown into a dungeon\nTil I kill Ceasar and get the throne\n\n[Hook: King Gordy & MJ Robinson]\nI'm a gladiator!\nI am the son of God but they try so hard to enslave me\nI'm a gladiator!\nThey can't stand my blood so they kill my wife and baby\nI'm a gladiator!\nYou can't hold me\nI'm a gladiator!\nI'm killing this poetry\nI'm a gladiator!\nI am Maximus, with an axe I'll cut you I'm crazy!\n\n[Verse 2: King Gordy]\nI ask myself time and time again, will I die fighting inside of this lion's den\nThese tyrants like it they can't hide it, they smile and grin\nI wish that I could put my knife right inside his chin!\nI'm a general not a criminal\nMen are getting done critical\nThen I'm entering in his room, Ceasar I'm here to get at you\nI'll take your life and your crown\nTake your wife and your child\nToday they're hyping the crowd\nThey may die in front of thousands\nLiving legend in your presence\nGive em less then fifty seconds\nSplit your neck then hit ya chest, blood is spit in six directions\nAspire a God-king\nInspired by all things\nThat's higher than ya'll beings, that's human at offspring\nLike Zeus or a crossbreed, an unusual live thing\nI'm brutal to the few of you who chose to not drop knees\nI'm on top and I won't stop until I conquer the whole continent\nThe dominant god they call Xerxes!\n\n[Hook: King Gordy & MJ Robinson]\n\n[Verse 3: King Gordy]\nThe mummy returns with blood in the urn to resurrect me\nA God-king is how you will address me\nDress me in golden garments\nMy flesh bleeds not a drop for I am supersonic\nI'm like Mohammed the prophet\nOh Jesus Christ, he's super nice, He's super natural\nI'll be a knight and when we fight turn to an animal\nI'll swing this knife, as mean as Slice, I'll fucking slash his throat\nHe needs to die, his meats divided, we are cannibalistic\nThe Christians insist they're against this\nWell send em the head of their messenger, this begins it\nHoly war, golden swords, broken jaws, swollen open scars\nSoldiers we are warriors, we go for ours\nWe're to control the whole world by early tomorrow\nA man infatuated by a nation calling him God\nI'm here to rule the whole universe\nI will have you and her, kneeled before I'm through with this verse\n\n[Hook: King Gordy & MJ Robinson]"}]}