{"artist": "Cage", "songs": [{"title": "Escape to 88", "album": "Movies For The Blind", "year": "2002-08-16", "image": "https://images.genius.com/a543bef5a47f37a8aeba1d69065b95ac.500x500x1.jpg", "lyrics": "[Scratches]\nWho is this? Cage?\nWith a little message\nThe illest four letter word observe while I serve!\nThat's no question\nWho is this? Cage?\nClips missin' from the gun\nCage Kennylz, back to the stage\nCause gun to forehead don't make em feel preachy\n\n[Verse 1]\nWelcome to a piece of brain tissue\nMy brain's lungs filled with octane like liquid that came from\nSome silly, set of tits sellin illy\nReally? By the jar? Pump the car full of grey jelly\nCalled her Rhonda, after I shit on the dash\nCause I can't stand hooked up Hondas\nThe three maneuver so swiftly in and out of looters\nThrough checkpoints with juice in stashed coolers\n2002, my album's played through\nID on the window like it's fucking Beirut\nToo bad no planes flew into MTV\nI'll never get a platinum plaque for MP3\nBeing blackballed by a white MC - Pause\nI guess that faggot found the right MD\nAnd I'm twisted but not like faggots that suck fame\nThis clown's insane I'm sicker with metal than Mudvayne\nI train my following like a bitch modelin\nH is like her God and it won't stop hollerin\nFuck needing a TV to be a rockstar\nPunch a hole through Mark Wahlbergs chest and dent a cop car\nPut my brain in it, I wouldn't last a minute\nScribble some shit in 30, I'm loved like gimmicks\nSluts, cynics, ducks with dipped spinach\nFuckin you up in the front row's good for image\n\n[Scratches]\n\n[Verse 2]\nI got a walked on, half-eaten heart of a gorilla\nThat lost his family and wants revenge on his killers\nClapped the poacher, fled the stomach of rap through an ulcer\nCovered in blood, eating with vultures\nOff the chain it got a hook in its back\nScalded my feet breastfeeding, moms was cooking up crack\nDrop me in a pot, cop me in the spot, pistols gleaming\nIn the sun, look son, I'm crystal fiendin\nNondescript, we're fleetin any malicious beatings\nSpecially after y'all left a couple bitches breathin\nSix is reading, bitterly gritty\nCaught a GTA charge before Liberty City\nToo bad no brains blew out no heads plenty\nI'll probably die after I Blow like Ted Demme\nThere's no conspiracy, your bitch is a forced fit\nIn the telly yelling \"Behold the pale horse dick\"\nFuck the Taliban, I'm back to Ballys, and\nKeep your little faggot brother off of Sally, man\nI can explain it \"do not cross this line\" in my brain\nFeds in the crib, but they're not finding the cane\nCause time in the game, New York is trife\nMy boy T on the lamb like a fork and knife\nThe corporate life, too fond of the blonde talker\nSo I grew a beard and switched sides like John Walker"}]}