{"artist": "Papoose", "songs": [{"album": "Hoodie Season 3", "title": "Back on My Bullshit", "image": "https://images.genius.com/b92a2f7f9726fe65091513bb501cde03.513x513x1.png", "lyrics": "[Verse 1: Papoose]\nWhere was you at when I was trying to blow?\nWaste my money on weed farms, I was trying to grow\nNiggas tried to eat on my block, I had to cock the fo'\nRan down on them and told them niggas they gotta go!\nHad the Triple FAT Goose on, it was kinda cold\nI was on the block eating Mike & Ikes and Jolly Joes\nPolice asking me questions; I told 'em \"I don't know,\"\nYou was in the precinct crying, you had the snotty nose!\nHad to run down on my connect, they playing dominoes\nBacked them niggas down for that work and told them \"adios!\"\nBrought my money up, I'm looking like King Jaffe Jo'\nI ain't make \"Panda,\" but I've been wearing Desiigner clothes!\nBack on my bullshit, Mac with the full clip, might have to just lose it\nI'm quick to use it, who you acting a fool with?  Is y'all niggas stupid?\nSmacking a few bricks, stacking a few bricks, this track is exclusive\nPacking the U-*censored,* he packing the toothpick, I'm packing the pool stick\nMad 'cause I move with .40-caliber tool grip, I'm faster to shoot shit\nRa-ta-ta-ta-ta, get madder and madder, they scared that I'll shatter the glass on your new whip\nMaggots with loose lips, they catching a cruise ship, I'm grabbin' the nuva\nBack with the movement, it's a fact you a true bitch, my status is too lit\nCats I was cool with, sat in classes at school with,  keep acting confusing\nMan I refuse it, I think you'd rather defuse it, your head, I'll have to remove it\nLacking improvement, all you rappers included, I'm Ravishing Rude Rick\nAncient pretenders with hidden agendas\n\n[Hook: Jaquae]\nThis time I ain't playing fair\nI'mma take what's mine\nI want more money, more part, goddamn, nigga, it's about that time!\nI'm back on my bullshit\nI'm back on my bullshit\nI said I'm back on my bull-shit\nI'm back on my bullshit\nHey!\n\n[Verse 2: Fat Joe]\nOn my BS, we platinum, they even doubted Jesus\nThat’s what PUN would say, killing ‘em that’s an understatement\nSame nigga used to move the blue Malibu\nSoon as a nigga get money, they get mad at you!\nSitting on a Hollywood sign, now ain’t that a view?\nAnd all my bitches is loyal, they got it tatted, too\nI’ve been getting busy playing Frisbee with the Wraith\nEverybody pissy, wanna lift me by the case\nCould've bought a boat for the price of the wristwatch\nPulling dope out the tires like a pit stop\n(Whoa! Whoa!) Duck when I come through\nI already sonned you, show your niggas what the gun do\n.45'll miss, the AK'll hit\nEverybody lit 'til they laying in shit!\nYour love is a 187\nI've been killing 'em softly, getting niggas up off me!\n\n[Hook: Jaquae]\nThis time I ain't playing fair\nI'mma take what's mine\nI want more money, more part, goddamn, nigga, it's about that time!\nI'm back on my bullshit\nI'm back on my bullshit\nI said I'm back on my bull-shit\nI'm back on my bullshit\nHey!\n\n[Outro: Fat Joe (Jaquae)]\n(Jaquae!  Jaquae!)\nCoka the Don\nDouble P!\n(Papoose, Pa-poose!)", "year": "2016-12-22"}]}