{"artist": "Astronautalis", "songs": [{"title": "Meet Me Here Later (Reprise)", "image": "https://images.genius.com/81fdfca910c475d1405c73c585bd6612.1000x1000x1.jpg", "album": "The Mighty Ocean & Nine Dark Theaters", "lyrics": "Baptized in soft skin with bitten lips\nI passed by her lost in the sketchy land\nLines of breadcrumbs retrace for the ride\nBathed in the blue light of perfect American nights\nAmerican nights\n\nFunny right lovely night song sets pace\nYoung lovers sing along through touch face\nTrue love waits in shallow waters under darkened skies\nLittle handcuffs and the solid plans and blacked out eyes\n\nWe're killing cowboys left and right again\nWith guilty little trips, recycled cans\nThat give me whiskey lips and dirty hands\nAnd everybody's got a ribbon all of a sudden and its a box newsstand\nAlright!\n\nStarry eyes, shitfaced lions, planes\nLet's call the supermodels and all of the fucking vagrant bands\nAnd ask them just exactly what they've got planned\nTo save us from our own impending doom\n\nThey were baptized with soft skin and bitten smiles, bitten smiles all lost in\nOh god how you glow, oh god how you glow\n\nMeet me here later and we'll make out\n\nThey were broke bones, paint chips with bitten smiles, bitten smiles and soft hits\nOh lord how you shine, oh lord how you shine\n\nMeet me here later and we'll make out\n\n\"You ready?\"\n\"Yeah I'm ready.\"\n\"OK, let's go.\"\n\n\"1... 2... 3...\"\n\nLast one rolls from the mall right down Third Street\nDoing donuts through front lawns, keg in the backseat\nPancake pants, pick up, make out, and bleed\n\nMr. Mouth with the largest pockets packed with popcorn\nSeems to cost me nothing\nCosts me nothing\nCosts me nothing\nCosts me\n\nAssholes all obsessed with spelling\nSweaty, out of breath from yelling\nChase him up and down the ceiling\nFuck you bleeding heart\n\nTake another 20, buddy\nAll we need is burning money\nCheck, swore I'd laugh at anything\n\nThey were baptized with soft skin bitten smiles, bitten smiles all lost in\nOh god how you glow, Oh god how you glow\n\nMeet me here later and we'll make out\n\nThey were broke bones, paint chips with bitten smiles, bitten smiles and soft hits\nOh lord how you shine, oh lord how you shine\n\nMeet me here later and we'll make out\n\nThey were baptized, soft skin with bitten smiles, bitten smiles all lost in\nOh god how you glow, oh god how you glow\n\nMeet me here later and we'll make out", "year": "2006-05-23"}]}