{"songs": [{"year": null, "image": "https://images.genius.com/bed507f93948608dd5f528d57d12a54a.500x500x1.jpg", "title": "Southern Dialect", "album": "Still Serious", "lyrics": "These niggas ain't feelin us\n\nIt's the best kept secret, baby\n\nDown south\nWe got women on the beach\nSwerve on streets\nPlayers ridin drop\nAnd the flips won't stop\n\n[Verse 1]\nNow tell me what y'all know about a player like me comin through steppin\nI'm wreckin, New Orlean'an, and in 1984 turned Texan\nLyrically flexin I made a name for myself\nGained love, not in clubs, on streets, and I dealt\nWith these playa-hatas out here among us in the game\nI had to pass em by cause it really wasn't my thing\nNow don't you wanna scream it like you mean it\nTo them fools who said I couldn't do it\nThe ones that said that if I left the group, then I'd be ruined\nKeep on doin what you're doin\nThat's what my conscience said, use your head, and you'll win\nCause them haters who I thought was my partners, wasn't really my niggas\nThey reneged, they couldn't stand to see me get big in the business\nThat's why they player-hated me\nTalkin my business to them broads like we related, gee?\nIt never faded me cause I know where my head is at\nKnow where I'm headed at, that's why I keep on makin...\n\n[Chorus]\nNow the deeper the root\nThe bigger the square of the loot\nWhen people think of the bomb shit, they think of the boon, fool\nI'm speakin the truth, partner, seek and you'll find\nSouthern dialect, I'm regulatin, that's how I gets down for mine\n\n[Verse  2]\nIt's on to the break of dawn\nSo why should I stop kickin these fly-ass rhymes\nThat's puttin these knots in my pocket? I'm\nAbout to rock until I can't no mo'\nI'm takin this here all the way to the bank for dough\nCause y'all know, as long as players turn into rappers\nAnd rappers turn into actors, all these broads'll be gettin atcha\nNow which non-believin MC wanna see what time it is?\nThe rhymin wizard's about to show you haters what southern rhymin is\nI'm bombin kids, I show no mercy on a braveheart\nPut it down in '94, and never gave thought\nCaught every ???, every ass, checks got cashed\nFools got slung like the trash, I mash\n]From the scene, never seen by no witnesses\nPartner, don't try to play dumb, look, you know what this is\nQuit the biz cause y'all ain't ready for the outcome\nNo doubt, son, I'm from the south, and never lost a bout, son\n\n[Chorus]\n\n[Verse 3]\nNow, don't step, or you'll get ruined, mayn\nI got you trippin on the way a soldier's like me over here doin things\nYou knew the game, but you blew it again\nNow the head honcho is back, so non-believers, hand over your ring\nGive it up or get broken down\nIt's goin down now, Mike Dean supplied the potent sound\nSo now you know it's a southern thing\nI'm handlin things, I bust a rhyme and do damage to any man you bring\nI'm serious, I told you that way back in '94\nThey wanna flow, it ain't no thing, just let the record go\nDidn't you know I bust from southwest to southeast?\nBlessed by the best with this platinum-plated mouthpiece\nSo I give thanks, then it's off to the bank\nProtected by forces unseen, so I ain't gettin ganked\nAs for the fakers and the haters\nSmall things ain't nothin to a player\nI'm all about my paper\nI stacks my chips and then I break\nGather up my crew to Mike-a-nize, then we go and rock another state\nForget what another say, I'm backed up by my actions\nProduce a dope hit, make a lick, and leave em askin\nWho is Big Mike? and like that I'm back atcha\nPartner, handle your businesss, I ain't mad atcha\nMillion dollar lyrics I compose leave a pattern for quality stature\n\n[Chorus]"}], "artist": "Big Mike"}