{"artist": "Cam’ron", "songs": [{"title": "Death", "album": "Confessions of Fire", "year": "1998-07-21", "image": "https://images.genius.com/3c9078c99248a02e298976d5d0e167be.600x600x1.jpg", "lyrics": "[Verse 1: Cam'Ron,  The Death ]\n\nAyo, I'm hit with at least ten, beat again\nHey Cam'Ron need a friend?\nAww man, we meet again\nHere's your suit and tie your laced with the gear\nYou the same motherfucker I been chasing for years\nDon't take you why not? Cause you rhyme now?\nListen here, motherfucker lie down\nYo yo chill, it ain't my time now\nCome on last year you had me ducking the blaze\nWhat about that bitch that you fucked with AIDS?\nAww shit come on death I ain't know that\nYou know I wouldn't of went up in that bitch kojak\nYeah, but her ass was so fat\nBut let's go back to when your ass stole cracks\nBut I was a little cat that ain't know jack\nSo I know that, but let's go black\nWhen they put you in the trunk of the gold hatch\nOh yeah, with the cold rats\nBut back then I even came back with rabies\nBut you still living that was way back in the 80's nigga\nBut yo, you tried to get me once when my house caught on fire\nSo I let you go when your girl called you a liar\nAnd choked you with your necklace\nAnd what about when your ass drove wreckless?\nWha-what in the Lexus?\nCome on now I'm thinking of Blood in the BM\nWell, I know where he at nigga yo you wanna see him?\nAyo, don't play with me nigga you'll get lead in your head\nYo shut up, nigga you bout to die you can't kill me I'm dead\nThis is how I get extortion\nI coulda got your ass when you was a portion\nMom wanted abortion\nYo, why didn't you come get me when my time was done?\nWhen I didn't have a penny and I was confined to crumbs?\nWhen I wanted to kill myself and couldn't find a gun\nOh yeah that time you was beeping me 911\nBut to me that was petty\nBut now I ain't ready\nMan, Cam hurry up I got to go get little ready\nMe and her got a little 2:00 appointment\nShe playing with wires while she eating on a ointment\nYo, but I don't wanna even join the casket crew\nToo bad motherfucker I'll be back in a few\n(Yo chill. chill chill, yo shit)\n\n[Chorous] 3x\nI swear to God I feel like death is fucking calling me\nBut nah, you wouldn't understand\n\n[Verse 2: Cam'Ron, The Death]\n\nOh, you slid up on me\nAyo Death, hurry up before they give up on me\nIt's your time, it's your time\nAyo Death I forsake you, I ain't trying to snake you\nWell, why shouldn't I take you?\nWell, I understand I stole bottles\nBut nowadays I'm the one the little grove follow\nYo I'm like a role model and my girls pregnant\nLook don't hand me the game\nYo for real I don't wanna see my family in pain\nLook, Cam, man, shut up\nBut, but\nWhat? What?\nYo man, that's fucked up\nYeah, well tough luck\nAyo just show me the light and get me through the fog\nWhat about Mr. Diggs and Jimmy and the God?\nOh, your crew after you left they got a little chest hair\nAfter hard rocks yo they'll meet you here next year\nAyo, what happened to them?\nYou know, niggas on the hill snipped them\nAyo, why they just ain't fight them?\nSee funerals I like em you see family and friends\nYeah don't forget the snitches\nWhile you looking for them man I m looking for the bitches\nAnd you don't need no ends, and nigga no friends\nI'm just gonna go wit you I ain't got no wins\nLet me get my shit man I'll go check it\nMatter fact death you got to give me one second\nBefore I lay me down to sleep\nI pray the Lord my soul to keep\nAnd if I die.....\nAyo man, cut the crap man just get your shit man and that'll be that\nMan fuck it death I'm ready to go lying in the ditch\nAw Cam yo you always fucking crying like a bitch\nI ain't gonna take you your life you can have that\nJust wanted to waste time you someone to laugh at\nAyo why you fuck with me? Just give me one answer\nAyo I see you next album with my man lung cancer\n\n[Chorous] 6x"}]}