{"artist": "Willie D", "songs": [{"year": null, "lyrics": "Feat. Jhiame\n[Opening Skit: Some Female Complaining]\nI don't wanna what I'm gonna do!\nWill, he doesn't spend time with me, he doesn't respect me\nIt seems like I'm just staying for his convenience\n\n[Verse One: Willie D]\nBaby don't cry, pull yourself together\nLet Willie D take you to that other level\nAnd love you the right way miss\nCompare to me, Johnny don't know shiiit!\nI'm in a class all by myself\nGet some of this, and you don't want nobody else\n\nSo if you plan on staying with your groom\nDon't come around my bedroom\nGet your hands off the bed poles\nMarried, went, nearly hit the most\nSee after a few times in the sack\nHomeboy, trends to get a little relax\nHe starts hanging out late with his friends\nYeah! ~ that's when I come in\nBut not into his house cause that ain't nothing but a slaughter\nWe go to my place, forget the room of Thirty Martyrs\nNow, once you get your woman alone\nIt's on like a pattern of neck bone\nAnd when I call she pretends that I'm her girlfriend\nShe might call me San or Fran but I'm the Clean Up Man\n\n[Chorus: Jhiame]\nWillie D, is the Clean Up Man\nHe will sweep your girlfriend, off her feet yeah!\nThe reason I know; so much about him\nIt's because he scooped dolls, and all the girls in my hood\n\n[Verse Two: Willie D]\nSwept her right up off her feet, and entered the Jag'\nCause you was using her face as a punching bag\nI'm not going next door myself neither\nBut if you gotta beat her, you don't need her\nIt ain't no thing, for me to be lovable\nCause after being treated like that, she is so gullible\nLike a masseur, I rub her thighs, neck and back\nAnd give her some of this Afro-dizyak\nNow, what you know about that boy?\nYou just start, you're still in Kinder Garden\nTalking about you got that whip appeal, and all that stuff\nShe told me you couldn't even fill it up\nYo, don't call me a snail\nCause if the shoe was on the other foot, you'll take my girl\nWillie D, is for real\nIf you don't take care of your business, then somebody else will\nI'ma give your girl what she really wants\nIn the mid-night hour, I'll be her confidant\nAnd when you hit her and make her cry\nI'll be there to dry her eye, I'm the Clean Up Man\n\n[Chorus]\n[Skit #2: Some Male Complaining]\nYou know that's all you do is complain\nI work, I keep the lights on, I put food on the table\nI buy you clothes, I mean I don't understand you\nWhat else do you want me to do? - (Just think of romance back, baby)\n\n[Verse Three: Willie D]\nYou was a big time money maker, yeah, work a hard work\nOr whatever the hell you wanna call it\nBut when you leave, you girl don't miss ya\nBecause the Clean Up Man is in the picture\nYou're clucking them big bills\nBut money can't buy you love, just a cheap thrill\nAnd dyke gets old and abandoned\nNow, you're looking for love and understanding\nPouring out your heart about she just had a soul mate\nToo much, too little, too late\nNow when you come home, your feelings are hurt\nCause there's a sign on the door, it says: Men At Work\nDouble overtimer's what I stack\nYou know, I'm getting the job done cause I got on my hard hack\nGetting paid, working up her sweat, no customer leaves upset\nThey're all wanna come back\nCause they know with Willie D it ain't going to be none of that\nWam, bam, thank you madam, and hit the tub\nI don't have sex baby, I make love\nI'm the Clean Up Man\n\n[Chorus]\n\n[Verse Four: Willie D]\nYou better shave up then fly straight\nCause the Clean Up Man can't wait to take you place\nHe comes in all shapes, sizes and colors\nHis lovers all your aunts, cousins, sisters and mothers\nNow, he could be your brother, or the Mailman\nYour uncle, your father, and even your best friend\nSo next time you try to show her off\nKeep an eye on the Clean Up Man, he's in the house\n\n[Chorus]\n[Outro: Jhiame]\nAnd like a fool I thought I had all to myself\nLike a fool I thought I had all to myself\nLike a fool I thought I had all to myself\nLike a fool I thought I had all to myself\nAnd he is the clean up man, he is the clean up man\nHe is the clean up man, he is the clean up man..", "image": "https://images.genius.com/99c31136e48907dfc450b10677d10058.400x397x1.jpg", "album": "I’m Goin’ Out Lika Soldier", "title": "Clean Up Man"}]}