{"songs": [{"title": "Sample the Dope Noise", "album": "Pure Righteousness", "year": "1988-06-15", "image": "https://images.genius.com/732d84201eb8ac0c8f96f482c23f88e9.600x600x1.jpg", "lyrics": "[Verse: Lakim Shabazz]\nCee's a king, a menace at making beats\nDance or prance or just take the seat\nIt's causing chaos, confusion, all types of turbulence\nHave you heard of this? 'Cause I'ma murder this\nBeat to break you down, shake the ground\nMy people party hardy, make a sound\nMake some noise if not he'll sample it\nThen come over beats the rhymes I'll handle it\nThe new rap on the block, this man will loop it\nThe 45 King of swing gets stupid\nThe super duper producer gets looser\nKeep in step 'cause he's deaf and he'll choose the right beat\nFor me to kick and make it quick of who is live and who's jive\nSo take your pick, make sure you're intelligent\nAre you a man? If the answer is yes, yo, that settles it\nDo the knowledge first before you converse\nExpress your thoughts, opinions or be cursed\nBy a lyrical prophet\nThe money I pocket is a never winning battle for you so stop it\nYou can make an attempt at the title I clench that\nYour mad and sad 'cause you went back\nTo your old ways of acting wild\nNow you gotta keep your poise or Mark'll sample the dope noise\nWe got beats and rhymes combine like cuts\nUpon the beats is Mark, on the cuts C-Just\nYou want some of this?\nWhy don't you come and get some flavor unit\nFine tuning it, you'll get dissed\nIt's time to start to [?]\nMore pushing and pulling, more power than a Mack truck\nWhat's your job slob? Do you steal or rob?\nWhy don't you tell me what's happening hobs?\nI'm Asiatic, original, rhymes are critical\nThe mathematical terms I express are dialectical\nI got gusto, I'ma make Just go get another record\nFrom the crates so it cuts the flow\nElevating, constantly straight up\nYou step in my cage I'll enrage, you get ate up\nYour falling is your fault, don't start yelling hawk\nYou sleep, let me awaken you\nMy rhymes are like smelling salt\nThe 45 King is talented and complete\nLike accent for me to give flavor to all beats\nMy Earth in fine, I know you want to [?] her\nBut she's mine, I know every square inch of her\nSo I'm telling you now you can't have none of her\nYou better step back you new jack 'cause I'm a son of a-\nGun, ready to stun, so keep your poise\nAnd let the 45 King sample the dope noise"}], "artist": "Lakim Shabazz"}