{"songs": [{"album": "Freaknik: The Musical (Soundtrack) - EP", "image": "https://images.genius.com/4e28b8f10de966fcd27680459552f825.1000x1000x1.jpg", "year": null, "title": "Ghetto Commandments", "lyrics": "[Hook:]\nFollow my ghetto commandments\nYou gonna really see the way that I handle it\nYou gon’ either buck down\nOr you gon’ get fucked up\nIt’s Kill or be killed\nGet buck or get fucked up, nigga\n1-2-3-4-5-6-7-8-9 Hit 'em one more time\nFollow my Ghetto Commandments[2x]\n[Verse 1--T-Pain]\nNigga, first of all (all)\nI’m the first and last (last)\nYou just the first to fall (fall)\nI’m just the first to blast (Blaw)\nIf you’re gonna curse us all, (all)\nThen I’m gonna have to curse yo ass\nThen leave you in the park\nUnderneath a bunch of dirt and grass (yeah)\nI’m the only me, (me)\nBut I’m the first to bust (bust)\nAnd you’re the first victim, (victim)\nQuenching my thirst for blood (Ugh)\nTrust me homie, you don’t want to go to work with us (us)\nI’ll turn you hook to ashes\nAnd turn your verse to dust\nTell me what’s the difference between love and lust?\nCause I love the love (love)\nBut I’m in love with lust (lust)\nWalk up to your bitch and tell her I would love to cut\nAnd when them devils come up\nLeave the crack in the crack of her butt (yeah)\nMake her lay down in a back of a back of a truck (truck)\nAnd when she come up like a squirrel\nShe just asking for nuts (brr)\n24s on my Caddy I’m just askin’ for putt (fore)\nSo when you come up to my trap you’re just asking for us\n\n[Hook]\n\n[Verse 2--Mack Maine]\nThey say thou shall not talk, (talk)\nThou shall not speak, (speak)\nThou shall bow in the presences of a G (g)\nI spray mace in a bad boy’s eye\nLeave his shit all puffy so\nThou shall not see (see)\nThou shall not smile\nThou shall never show his teeth\nI'll paint thou art thou, thou shall repeat\nThou shall not (Thou shall not)\nBitch I said don’t talk\nShoot you in your ass and stab your feet\nNow how you’re gonna walk?\nI’m sick in the head, I piss in the bed\nHop up out the ocean and I leave the fisherman red\nSo much blood on the set, the cops hollerin’ out “soo-woo”\nBitch I’m from New Orleans, you know I know that voodoo\nIPod blastin’, 2pac yeah hit ‘em up\nChow down, spit ‘em up\nBlack bag, get ‘em up\nCall the chef tonight, were having sinners for dinner\nAin't no wireless in the hood, so I ain't talking about Twitter\nWhen I say\n\n[Hook]\n[Verse 3--Snoop Dogg]\nThe run around, the rap around (Rap aight)\nYou talk, then you walk, me I’m shaftin’ down (sh-sh)\nSee me and the pigs, we don’t fuck around (uh-uh)\nThat snitching in the hood, lemme’ break that down (break it down)\nThey do theirs, we do ours, understand me?\nI’m blued up, crippin’ with my family\nAnd we don’t give a fuck about the\nPOs, the COs, cause we know\nIf we goes\nThen we go\nWe do time, then parole\nNow I’m back on the black at night shift\nStack on the top I’m cockin’ it\nBack in the block and you know I’m cooping it\nShoebox full of money with a sock in it\nAnd we celebrating the ghetto by popping it\nSo no champagne or crystola\nMachine guns and pistolas--\nBlaw, hood shit\nLike that? Game over (over)\nSee in my hood we crip, or dip\nSo follow me, follow me, follow me, follow me\nOn some gangsta shit,ya biotch\n\n[Hook]"}], "artist": "T-Pain"}