{"artist": "Fam-Lay", "songs": [{"year": "2005-01-01", "album": null, "image": "https://images.genius.com/c5f7178d81a6573af9aabe243082012c.600x600x1.jpg", "lyrics": "[Fam-Lay] Uh!\n\n[Pre-Hook - Fam-Lay]\nIf you hear a shot nigga, think of me!\nCause if there's a stressin there's no question I'm a ride\nJust conceal my identity!\nI'll fulfill my requests if you heard that I die\nA thousand niggas jumping, a thousand niggas bowing\nNiggas making money, a thousand niggas throwing\nThousand niggas slanging, a thousand niggas banging\nSelling that H nigga, selling that caine\n\n[Hook - Pharrell Williams] (8x)\nHere come the amalance! (woo! woo! woo! woo! woo!)\n\n[Verse - Fam-Lay]\nUh! Fam-Lay uhh! I bet you heard of me\nBut there's some cowards out there who tried to murder me\nNow they got em in ICU Surgery\nCause I burnt their ass up to the 3rd degree\nI got that H, I got that D\nAnd if you need it homie you can get a pack from me\nWord on the street is that them people after me\nBut I'm a scrambler, won't let em capture me\nI got my bag, a case of gin\nPocket full of, tattoos all in my skin\nWe got gold teeth (uh) ducking them police\nOn the corner all night getting no sleep\nThis how we do, how real is this\nI'm from Shark City, big fish eat little fish (Norfolk!)\nThis is my hood, and I'm a represent\nI've been riding round wit shotguns ever since\n\n[Pre-Hook]\n\n[Hook]\n\n[Verse - Fam-Lay]\nChicks is braiding hair, fellas out clocking\nChil'rin everywhere, old folks is out watching\nGotta be Traintogo in this harsh world\nFull of nothing but hood niggas and park girls\nWe all down to ride, for that homicide\nWe prepared to go long as the drama ride\nRun up on your roads, open your suicide door\nTake the umbrella and treat it like a 2 by 4\nWe are ignorant, we don't give a shit\nFuck who started it long as we finish it\nCome up to your club, got a thousand deep\nAll the six of us waking you out your sleep\nI don't give a fuck, let the cor'ner pick em up\nFrom what I did to em, left his corner spitting up\nWe could go to war, till the death of me\nIf you want beef, WE got the recipe\n\n[Pre-Hook]\n\n[Hook]\n\n[Verse - Fam-Lay]\nPharrell put me here, to put these streets on lock\nNow that I'm in here, we can't be stopped (Star Trak!)\nI'm a carry it raw, till the day I die\nAnd keep it street, as days go by\nI'm in erry spot, the rawest clubs\nI'm on erry block, wit all the thugs\nMy family locked up, know what this about\nGot enough couzins wit me to get you out\n\n[Pre-Hook]\n\n[Hook]", "title": "Ambulance"}]}