{"artist": "AZ", "songs": [{"title": "Bedtime Story", "image": "https://images.genius.com/f7164c7711f98cbf75acb3b0f523d851.744x728x1.jpg", "album": "A.W.O.L.", "lyrics": "[Intro: AZ & {Son}]\nAmar, Amar, c'mon\n{Yeah Dad, what?}\nHope you did your homework already\n{I did that already, c'mon Dad}\nNah, it's time to go to..\n{C'mon listen..}\nWhat happened?\n{I was at school today I said AZ's my daddy, they said, \"Jay-Z? Nas?\"}\nWhat, what?\n{Tell me the story again?}\nOk, ok\nAight, this is how it went down, here we go..\n\n[Verse One: AZ]\nWe talkin' a few years before you even appeared\nI was into my little gear\nYeah - weed and my beer\nHustlin' out of fear, fear of bein' a square\nLike them cowards with no gear\nThey just breathin' the air\nSon, clear, but didn't realize life ain't fair\nWith one drive-by, it could end your life right there\nThough I'm a fly guy, from then, tied my Nikes, like chea\nFuck the world we can fight right here, I don't scare\nFrom beer, no more nightmares here, not a tear\nI was straighter than the white man's hair\nMet Nasir, had that hype that year\nLike a kite, threw me a mic\nI took flight right there, chea\nRap wise I was nice I swear\nWent fool with the jewels, even iced my ears\nNew school, I was cool, wore righteous wears\nBut from the door they didn't like that there, I ain't care\nAs long as I left the china white right there\nAnd understood that you could change a life through prayer\nBut it's all good, police even politely stared\nIt was unreal, but still now it feels slightly weird\nI was spared, gave love, taught my peers\nThough it was rough, never gave up, fought my fears\nNow it's like \"what?\"\nI'm G'ed up, awesome glare\nEntertainer from the streets with a sportsman's flair\n\n[Outro: AZ & {Son}\nThere, that's good enough for you?\n{Dad, Dad, what's \"G'ed up?\"}\nListen man, don't worry about that now, just go to sleep\n{Ok, ok}\nI'll tell you that later on.. but you know what?\n{What, what what?}\nI got one more quick story to tell you\n{Yeah yeah yeah yeah yeah yeah}\nMaybe you could take this story, and tell your friends at school this one:\n\n[Verse Three: AZ]\nHeeeeere we go!\nOut the gate, he who hate - himself ain't straight\nHe a snake, he the type who send himself upstate\nCatch a case for a plate\nHe ain't have to take, he coulda\nPlayed it safe, said his grace and ate\nBut it's fate, when a person makes certain mistakes\nWhat a waste, how the world.. [Fades...]", "year": "2005-09-06"}]}