{"songs": [{"image": "https://images.genius.com/486619547febaeb08946852826dc66ed.1000x1000x1.jpg", "title": "Feelin’ Myself", "album": "The Leaks, Vol. 1", "year": "2010-08-12", "lyrics": "[Hook: Lloyd]\nI'm I-I feelin' myself\nI I-I I I-I I’m feelin; myself\nI-I-I-I-I’m so fresh and I can’t help it\nI’m so fresh and I can't help it\n\n[Verse 1: Nipsey Hu$$le]\nI used to wake up in the dope spot and turn my swag on\nWasn’t hopping out the bed, cause I was sleeping on the floor\nBack then y'all was sleeping on the flow\nUsed to get it on the block I had to keep it on the low\nMy cash grow like pinnochio’s nose\nBulletproof, seven series, yeah we set em on fours\nOut of every new nigga I’m the one the city chose\nNow can’t a muthafucker knock me out my zone, and that's why\n\n[Hook: Lloyd]\n\n[Bridge: Nipsey Hu$$le]\nAnd when they see me, me they like, like, like, like, like. (yeah)\nI make the girls go (Oh oo Oh) go, go, go, go\nAnd when I step in they see me they like, like, like, like. (yeah)\nI make the girls go (Oh oo Oh) go, go\n\n[Verse 2: Nipsey Hu$$le]\nYes y'all, I got the money and respect y'all\nYou seen the movie so you know what's comes next y'all\nThe women, the power, the haters tryna catch ya’ll\nThe game ain't change, just the pieces on the chess board\nHottest on the West, Dollars to invest\nEx fella, still I got your kids college on my neck\nThey said it wouldn’t work, cause I'mma rider from the set\nBut being you pays on, you should try it for yourself\nAnd that's why\n\n[Hook: Lloyd]\n\n[Bridge: Nipsey Hu$$le]\n\n[Verse 3: Nipsey Hu$$le & Lloyd]\n[Nipsey Hu$$le]\nWe’re standing on the couches, lighting up kush blunts\nI'm the type of nigga that's gon’ take it if she look once\nYou the typa nigga that she gon’ have waiting for 2 months\nFor your head first base, I done scored 2 runs\nNow ask some questions to clarify your view homes\nFirst one being: “what type of shit is you on?”\nIt ain't my fault your girl got to choose home’s\nJust blame it on the yellow gold Roley with the blue stones\n\n[Lloyd]\nSo if you don’t need no help cause your feeling yourself somebody say\nYeah yoh yeah, Yeah yoh yeah\nAnd if you know you so cool and its all about you let me hear you say\nYeah yoh yeah, Yeah yoh yeah\n\n[Nipsey repeating]\nYes Yes Y'all..\nYes Yes Y'all..\nYes Yes Y'all..\nYes Yes Y'all..\nHussle\n\n[Hook: Lloyd]"}], "artist": "Nipsey Hussle"}