{"songs": [{"title": "Az the World Turnz", "album": "Heist of the Century", "year": null, "image": "https://images.genius.com/29aed50e708381cab4e55222550f38fa.962x925x1.jpg", "lyrics": "[Intro: La The Darkman, (Raekwon)]\nWord up. La The Dark' and Chef\n(True, let's get it right.)\nAiyyo. Fourth\n(Let's get it right like white.)\nBurning that ass. Sniff it up\n(You know how we go, kid.)\nLike a hound on dope\n(Yeah. Yeah.)\nWord. Word life. La The Dark'\nBig up to my many Buck-Buck\nDon't sweat that\n(What up, son.)\nIt's all good\n(Check it. Check it.)\n\n[Raekwon]\nYo, yo, yo, yo\nAiyyo La, what's up son\nAiyyo, you read the papers\n2 Columbian niggas hit these moneymakers\nA heavy routine, Chevy, Yukon green\nHad crazy coke up in that piece by all means\n\n[La The Darkman]\nThe kids was mad flonting, Rae', it had to go down\nKillers be coming for your neck, when you wearing a crown\n4-5's and AK's, kids ready to spray\nThe cats got nine lives from around my way\nTimb boots and overlord, two techs by the door\nSo, when the po-po come, I can take them to war\n\n[Raekwon]\nSame subject, techs and royalty checks\nPlus marketing the drugs, equal mad respect\nI gotta get mine, blast mad nines on a regular\nFake competitor or player,will meet his maker\n\n[La The Darkman]\nWho's the rap mayor, it's me, I be the slayer\nThe dark's in the realm, you contemplate your prayers\nMeteorite of clips hitting in the 9-5th\nAll you yapping MC's, like pancakes you get flipped\nI got a thirty shot clip at the grip of the hip\nA mad av. warrior, young tale from the crypt, kid\n\n[Chorus: Raekwon, (La The Darkman)] (x2)\nAs the world goes round yo the same is the same\n(Same junkies on the corners shooting shit in their vein)\nBut still, black man must rise up to the top\n(Representing Darkman with this real hip hop)\n\n[Interlude: Raekwon, (La The Darkman)]\nAnd you don't stop (and you don't stop)\nYeah! (and you can't stop) and you can't stop\n(Word up! word drop that style)\n\n[La The Darkman]\nYou only live once, execute your dreams\nA third real triple beam, weighed out my scheme\nFor the cream, I sold cracks, never could relax\nNow build with Wu-Tang, spitting lyrical facts\nYoung black mad bastard from the concrete street\nAnd I never leave the land without strapping my heat\nKeep peace and don't beef, word life Tariq\nI stole the million dollar show cause I'm that dark thief\nPart Dark part spark, ready to rip you apart\nI was born with a gold shield over my heart\nSo, don't start none, it won't be none\nI'm dominating the screen, my reign just begun\nI got raw and uncut for the kids doing bids\nYou can't figure my physical like a pyramid\nI'm that wicked dark star, may La now rise\nI switch to warp space 5 like the Starship Enterprise\n\n[Chorus to fade]"}], "artist": "La The Darkman"}