{"artist": "Pastor Troy", "songs": [{"album": "Face Off Part II", "title": "Murder Man", "image": "https://images.genius.com/5577ba6e03c019a4576f271bbcf87fb4.500x500x1.jpg", "lyrics": "[Verse]\nIiiiiii'm comin, two .50 cal's in hand\nLong goat-tee nigga the Taliban\nI'm Murda Man, I'm tryna murk somethin\nThis ain't for ??? cheese I'm tryna hurt somethin\nThese niggas claimin g'z, claimin they run the South East\nHow you run the shit in that buck buck Caprice?\nAtleast, you oughta know bout my flow\nThe P the T the R the O\nThe Y nigga, I'm so fly call me jet\nJump off in the ocean still ain't wet\nI flex, I motherfuckin ball better ask em\nCatch a nigga talkin shit n motherfuckin blast em\nMurda, m-u-r-d-a\nIm pumpin gats at whoever in the way\nIm back wit gun play, don't think they undastand\nBut I don't think they wanna fuck wit the Murda Man, Murda Man\n\n[Hook]\nI don't think they wanna fuck with the Murda Man\nFuck wit the Murda Man, fuck wit the Murda Man, Well Uh-Huh\n(4x)\n\n[Verse]\nYaaaaa'll trippin, now everybody crunk\nYall niggas gon make me pop the trunk\nCuz I remember way back in the day\nWhen the ATL wasn't gettin no play\nThen I came out, dropped We Ready\nNiggas went to bouncin, ridin them box Chevy's\nBut I guess that was then, this is now\nWhen I catch ya ass in the street the gun blow, blow\nI represent the hard, I represent the angle\nI represent the real, I represent the danger\nI represent the cars, I represent the dream\nI represent respect, I'm representin my team\nIt's Mister PT aka Murda Man\nYa pistol in ya car, my pistol in my hand\nAnd you can ask Chan, I shot a nigga van\nDont think you understand, I'm the fuckin Murda Man, Murda Man and\n\n[Hook]\n\n[Verse]\nStiiiiiiiill spinnin, empty my magazine\nI jump off in my limousine and flee the scene\nThis ain't the SWAT team, this ain't Lil Scrap n them\nI rep that hard shit and fuck a platinum\nAnd Little Jon, used to by homey, used to be my Ace\nNow I wanna slap the the taste out ya mouth\nNigga down south I'm a legend\nWhen ya see me keep motherfuckin steppin\nAnd flexin, so what you gotta A at nigga\nThat don't mean shit to a south side killa\nWussup Shay? wussup Tod?\nOn that ass, Shady Park\nMurda, M-U-R-D-A\nIm bustin shots at whoever in my way\nCockin my A-K, don't think they understand\nBut I don't think they wanna fuck wit the Murda Man, Murda Man, and\n\n[Hook]", "year": null}]}