{"artist": "Fat Joe", "songs": [{"year": "2013-08-26", "album": "The Darkside Vol. 3 ", "image": "https://images.genius.com/a53228c5255a58acb80e04151cc60a17.500x500x1.jpg", "lyrics": "[Verse 1: Fat Joe]\nBoogie Down Productions was the soundtrack to my life\nI was bumpin' that while I was pumpin' crack all through the night\nCuban Links got dipped in gold, I flooded that shit out with ice\nAnd put [?], the size of [?]\nWe the ones they callin' when they need to spray the block\n'Cause I got shooters on the corner guaranteed to hit the shot\nJesus shuttles worth, you know we got it for movin' turkeys all through Christmas\nBricks, we caught 'em by the balls\nStunt on y'all, rose gold Rollie. Presidential\nHunnid racks on me, that's the bare essential\nDon't tell the Feds though, they got me for a ticket\nBut when I touch the town, I'm droppin' 50 on the strippers\n\n[Chorus: Fat Joe & Dre]\nDarkside 3\nLord. provide me With a couple real niggas that'll hold it down\nThat'll bust some rounds, yeah, yeah\nDarkside 3\nLord. provide me With a couple real bitches that'll hold it down\nThey gon' be around to lay it down, yeah\nYeah, uh\n\n[Verse 2: Fat Joe]\nI'm boardin' up Knox this bitch to the Trayvon rally\nHit 'em with conscious shit, she givin' me brain in the alley\nLeave the curtains open on purpose to let a bitch see\nIs she curious? I put her on to what the lick be\nMost of these rappers is actors buyin' they entourages\nWritin' scripts to the judge just to duck a few charges\nTom Ford suits slingin' them pies\nTry to hang me out to dry for my criminal ties, uh\nWet and yay way before I ever made the tape\nClosed caskets, a ghetto bastard's still an open case\nCrocodile tears, you niggas never bust your gun\nElementary, bitch, picture your last [?] to your son\n\n[Outro: Dre]\nDarkside 3\nLord, provide me with a couple real niggas that'll hold it down\nThat'll bust some rounds, yeah, yeah\nWith a couple real bitches that'll hold it down\nThey gon' be around to lay it down, yeah", "title": "DarkSide"}]}