{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Intro: R.A. The Rugged Man]\nI just threw up my pork rinds\nIt's the R.A. the motherfuckin' Rugged Guy\nCrustified Dibbs, nineteen ninety-four\nJive Records coming thru, Night of the Bloody Apes\nCheck it out, I'mma sing something like, awww baby now\n\n[Chorus: R.A. The Rugged Man]\nAwww baby, awww baby, awww baby now (x4)\n\n[Verse 1: R.A. The Rugged Man]\nI know why, never wonder why I never understand why?\nDo or die who the fuck am I? (Rugged Man!)\nHorror flicks are molded scripts this is the real shit\n[?] not a candy coated 'cuz I'm helplessly devoted\nSo whatchu gonna say about that\nIt wasn't down from the [?] so back the fuck up, bro\nSometimes I'll make ya microphone the deadliest they go and fed me this\nThey had to tell me thus I know that shit already\nOverthrow that bitch [?] tried to steal my 10 G's\nWith a sexual disease so bitch get on ya knees\nYou don't even try a Play Doh's\n'Cuz I'ma turn ya bodies in the fried green tomatoes\nThat's the problem with (?) when I can't stop them\nThe people rob them so by the sense I ain't got no friends\nI'm more than opposite, why?\nPeople never understand what I'm about the dirty crusty asses motto\nBut I give (TWO SHITS) about the old timers\nSenior citizens disrespecting me with Alzheimers\nThe R.A., that's my name what's my name\nI be the R, R, R, R, The R.A\nYou faggot you wanna be my manager\nBut I just don't think not qualified to roll with the Crustified\nOh baby now bullshit this fuck friendship\nWhich my (?) goes but die upon the road\nHuaaaaa-hoo I ain't got no friends\nI don't tryna help me out because I don't need anyone\n\n[Chorus (8x)]\n\n[Verse 2: R.A. The Rugged Man]\nI got the Nigga Nilez killin' beats like Lenny Kravitz\nI get digits from statutory (?) I make my demos at [?]\nSwallow like a piranha bitch without no blue collar\nI'd of stuck that fat ass and not spit a dollar\nSometimes I walk alone! I'm not impressed\nI don't care about if I'm the worse or the best bitch just go get dressed\nShe's a money hungry diver yo what's up with baby doll\n(Snorts) I hope you like saliva\nThey ain't nuttin' I'm a Rugged that ain't no accident\nDo me in the house I be in the house\nI'm not tryna close my family ties\nBut I need some thighs to make my Jimmy rise\nI'm not down to sign ya papers\nStop tryna rape us, if you tryna shape us, you can't escape us\nNever stop to think you've got a life forever.. and forever\nAin't nobody out there that discovered peace\nIf you say just broke up with me that must been another me\nDiggin' like a microphone (?)\nAw baby, now, aw baby now\nAw baby now that's how I sing my motherfucking choruses\nThe bitch provokes [?] my [?] must be (?)\nWanna see me get knocked out like Michael Gomez\nBut I don't give a fuck I'm not good enough\nYou eat the shit out my ass (word), awww baby now\n\n[Chorus (x17)]", "title": "R.A. Be Down (Awww Baby Now)", "image": "https://images.genius.com/0459459cdc2f6a1ba50292d192b060db.500x500x1.jpg"}]}