{"songs": [{"image": "https://images.genius.com/d01c19ff7173bf6238cf0b0ce2a5487f.620x620x1.jpg", "title": "Kinda Like a Big Deal", "album": "Til the Casket Drops", "year": "2009-04-20", "lyrics": "[Intro]\nTil the Casket Drops!\nThird time's the charm right? Hahaha! Come on\n\n[Verse 1: Pusha T]\nI'm kinda like a big deal, it's unbelievable\nYou see my warning gives you big chills\nThe flow running on BIG's heels\nMy life after death, BIG ain't get to see how this feels\nThird time's the charm, baby\nAfter two classics another stripe up on my arm baby\nIt's a blessing to blow a hundred thou in a recession\nWith no second guessin'\nHa-ha, we're ballin', drop tops we're floorin'\nChampagne we're pourin', Re-Up is the gang and I'm all in\nTo the powder and the flame I have fallen\nGet money, blow money is my calling\nYeah, watch a nigga burn through it\nLife's a maze, you twist and you turn through it\nThe driest of droughts, maneuvered and I earned through it\nI'm set straight like a perm do it, Push\n\n[Hook: Pusha T]\nThey whispering about us, I know you haters doubt us\nHow you count our money? We ain't even finished counting\nPardon me, I must say, I'm kinda like a big deal\n\n[Verse 2: Kanye West]\nAyo, I'm sitting on top of the, it's more than a feeling, ain't it?\nI be killing, damn it, I'm illin', I'm illin', ay-ay-ay-ay\nMeet Mr. Popular, go get your binoculars\nAnd see Penthouse 3 where a nigga be\nSpitting fire on the PJ in my PJs\nFire Marshall said I took it to the max like TJ\nY'all ain't peep, I said Marshall's, replay\nI guess I'm like the black Marshall meets Jay\nMeet 'Ye, alligator souffle, got it made\nSpecial Ed got head from a girl in special ed\nYou know the pretty ones in that dumb class\nBut she got that dumb ass\nHit high school and got pregnant dumb fast\n\"What happened, Tisha, your boyfriend come fast?\"\nTurn around, give me pound like we folks\n\"Hell no, I went raw-dog, three strokes!\"\n\n[Hook: Pusha T]\nThey whispering about us, I know you haters doubt us\nHow you count our money? We ain't even finished counting\nPardon me, I must say, I'm kinda like a big deal\n\n[Verse 3: Malice]\nLights, cameras, action!\nThe chain itself's a damn distraction\nYou claim the belt, the glory I bask in\nI'm B. Hop in the ring, niggas, you cash in, it's like\nStopping a train, nigga think he's stopping my reign\nTalk slick while dropping my name?\nI'm putting y'all to shame, diamonds in the little hand\n50 percent splits, I X out the middleman\nA far cry from a stash in the rental van\nI'm the reason the hood need a dental plan\nLadies and gentlemen, introducing\nThe C-4S with the rims protruding\nThe roof vamoose, like a magic show\nGot me looking to the heavens like a javelin throw\nY'all twiddle your thumbs like the average Joe\nBut just as you reap, so shall you sow\n\n[Hook: Pusha T]\nThey whispering about us, I know you haters doubt us\nHow you count our money? We ain't even finished counting\nPardon me, I must say, I'm kinda like a big deal"}], "artist": "Clipse"}