{"artist": "ILL BILL", "songs": [{"title": "Death Smiles at Murder", "lyrics": "[Verse 1: ILL Bill]\nOur society love murderers, love war, love bloodshed\nLove the scene of an accident when someone's dead\nWe love violence, we can't turn away: The Colosseum\nThrow ‘em in the arena and watch the lions eat 'em\nMusic and movies are the mirrors of this madness\nSome morbid mural of morticians upon the canvas\nA beautifully composed symphony of sickness, bear witness\nReality's much worse, predictions of apocalypse\nFound in the books of religious architects\nArguments hidden in forbidden documents\nConsequence, Bowling for Columbine\nAnatomy of School Shootings\nBloods and Crips of Brooklyn is no longer a new thing\nDeath is certain, we all die whether it's from natural causes or not\nNobody really knows why\nBut if there's one thing I know, Death holds a place\nIn his heart for murderers, take a look at his face\n\n[Chorus: Mr. Hyde]\nDeath smiles at murder\nPain shakes the hand of homicide\nWe all die, it's certain\nCan't change the path that's prophesied\n\n[Verse 2: ILL Bill]\nSome people murder for money\nOther people murder for hate\nSome murder for love\nA lot of people murder for drugs\nThere's really fucked up people that need a murder to cum\nAnd some of y'all motherfuckers even murder for fun\nThey might stab you up with a knife or shoot you with guns\nThat's when the black coroner van usually comes\nSome murderers are strange drifters or depraved sickos\nLike Gary Heidnik, Gein, Bundy, Berkowitz and J. Rifkin\nA lot of murderers you wouldn't suspect\nHe kept to himself, never bothered anyone, they said\nHe was a simple guy with a simple life, till he killed his wife\nGot a first taste of doing something he liked\nSome murderers are famous\nAnd they wind up in a Ford Bronco\nWith a gun in they mouth like O.J. did\nNo matter who the fuck you are, Death has a place\nIn his heart for murderers, take a look at his face\n\n[Chorus: Mr. Hyde]", "image": "https://images.genius.com/fc526dae683e1f19f37ee02105da9a7c.1000x1000x1.jpg", "album": "What’s Wrong With Bill?", "year": "2004-05-04"}]}