{"artist": "Ace Hood", "songs": [{"title": "Got Damn", "album": "Starvation 2", "year": null, "lyrics": "(Intro)\nOh yea?\nThat’s how you feel huh young niggas?\nYou gon pull up in that motherfuckin Foreign like that there\n50 grand in yo motherfuckin pocket with that bad bitch\n\n(Hook)\nGot damn, got damn\nWhy you do em like that? Got damn\n(Wutchu mean?)\nHow you pull up in the Porsche? 9-11 oh Lord\nWith a bad bitch with me and her ass so full\nGot damn, got damn\nHundred thousand for the Rollie, got damn\nAll these diamonds in my chain, 30 bottles on the way\nKOD in magic city, 50k I make it rain\nGot damn!\n\n(Verse: Ace Hood)\nSteppin out tonight I think I’m bout to make a movie\nDrop in the Phantom, whippin bumpin Lil Boosie\nBitch I gotta checkout, just went by the whole club\nTook bout 20 thousand dollars, I just call it showin love\nBig money nigga, quarter millie on the juice\nBallin like a bitch, I made the ESPN news\nHome boy, you can never play me for a fool\nKeep a Mr. Fix It with me, that’s who keep the tool\nI say now good Lord, look at shorty, there she hall ass\nBet your money she gon fuck me for that brown bag\nI said I’m too gone off that liquor, turned up - nigga you trippin\nThat P Ciroc in my system, blew 10 racks as I’m different\n\n(Hook)\nGot damn, got damn\nWhy you do em like that? Got damn\n(Wutchu mean?)\nHow you pull up in the Porsche? 9-11 oh Lord\nWith a bad bitch with me and her ass so full\nGot damn, got damn\nHundred thousand for the Rollie, got damn\nAll these diamonds in my chain, 30 bottles on the way\nKOD in magic city, 50k I make it rain\nGot damn!\n\n(Verse: Plies)\nI was in the trap, cracker kicked in the do’\nI was in the room, I was beatin a ho\nCrack a ice mean nigga where the snow\nTold them probly in Alaska, cracker where it snow?\nThis Christmas, I’mma buy 100 Chevy\nAnd gave em all away to all the young niggas\nGot a funny feeling, I’mma whack me a rapper\nGet on TV plat crazy, like oh no what happened?\nAsked me did I fuck his girlfriend, I told him I don’t remember\nNow did she suck me? That’s a strong possibility\nHit him with the 9, he got his shit wacked\n10 racks pussy and I sell your chain back\n\n(Hook)\nGot damn, got damn\nWhy you do em like that? Got damn\n(Wutchu mean?)\nHow you pull up in the Porsche? 9-11 oh Lord\nWith a bad bitch with me and her ass so full\nGot damn, got damn\nHundred thousand for the Rollie, got damn\nAll these diamonds in my chain, 30 bottles on the way\nKOD in magic city, 50k I make it rain\nGot damn!\n\n(Verse: Ace Hood)\nOkay now fat black ‘Maro, bitches call me Bruce Wayne\nCrib big it’s Wal-Mart, nigga that’s a shame\nAnd I keep a shooter, call that boy Dwayne Wade\nOnce them niggas pussy lucky, I don’t call names\nCatch me pullin up in that, Lord have mercy, thank You Jesus\nProbly with a freak, her name Tameeka, she’s a skeezer\nAudemar bottles, til tomorrow Rose\nDope boy swag, ol Rollie and some J’s\nI be wailin on you niggas, stylin on you niggas\nGo and cop a whippin, then I Instagram a picture\nWhat yo money like? What dip dope cheddar over\nMy paper long, bitch etcetera, etcetera\nGet it!\n\n(Hook)\nGot damn, got damn\nWhy you do em like that? Got damn\n(Wutchu mean?)\nHow you pull up in the Porsche? 9-11 oh Lord\nWith a bad bitch with me and her ass so full\nGot damn, got damn\nHundred thousand for the Rollie, got damn\nAll these diamonds in my chain, 30 bottles on the way\nKOD in magic city, 50k I make it rain\nGot damn!", "image": "https://images.genius.com/a8ccf68732bfc41deafb0b2d7ab2be48.500x500x1.jpg"}]}