{"songs": [{"title": "Capri-Sun", "lyrics": "[Hook: AJ Tracey]\nWalk in the stu, then I turn the Mac on\nHanded the ting to my runner like a baton\nAlways got my hood up, or I got a hat on\nSpurs v.s. anyone, man'll put a bag on\nCapri-Sun, boy, yeah, I got the juice\nYou can't war with man cuh' you'll lose\nNow I've got sponsors nicing man shoes\nMandem are next to make your man snooze\n\n[Verse 1: AJ Tracey]\nMeeting at nine, but I'm gonna sleep late\nI be spinning clubs, suttun like a DJ\nNow I'm getting dough, so I'm tryna eat great\nLeader of the gang, call a brother TJ\nRun a man down, call a brother Piqué\nStill up in the Grove, call a man CJ\nI was with Wiley stirring up a heatwave\nIf a chick's got a mad back get a replay, yeah\nBro, I'm on a mad one\nIf I'm heading up to Brum, I holla SafOne\nI got a brother who don't even have an Apple ID\nThat will hold his finger down until the Mac's done\nYeah they wanna talk loads, it's a minor\nCuh' they're stuck up in a hole like a miner\nI cut them off with an axe like a miner\nBangs having them look like a hit from Desiigner, mad\nMy man are on gangster behavior\nCouple teefs wanna run with my flavour\nIf we're doing well in West, then salute me\nI put niggas back up on the map, I'm the saviour\nBros with the razor\nLooking like COD, strapped with a lazer\nIf you had faith, ask for a favour\nDid it on my own, I ain't signed to a major\n\n[Hook: AJ Tracey]\nWalk in the stu, then I turn the Mac on\nHanded the ting to my runner like a baton\nAlways got my hood up or I got a hat on\nSpurs v.s. anyone, man'll put a bag on\nCapri-Sun, boy, yeah, I got the juice\nYou can't war with man cuh' you'll lose\nNow I've got sponsors nicing man shoes\nMandem are next to make your man snooze\n\n[Verse 2: Chip]\nA beat just came, JC put the Mac on\nAin't got a trim, I got a hoodie or a hat on\nMan might pick an MC and just snap on\nTell a boy back off, might get spat on\nAJ winged out, I took the baton\nSpin man like man just put the track on\nYeah, niggas chatting about sales, oh please (lowe it)\nOnly plaque you've got in your teeth\nK-M-T, L-O-L\nSuck your girl, go to hell\nRed or blue? Pop a pill\nYou're industry, I'm off the rails\nWord for word, truly don\nGot the juice, Rubicon\nOn the set, you be lost\nNot a shellers, who you conning?\nMad when you put me on a verse\nPut me on the beat, get it acapella, could be worse\nCuh' man get handy with the flows\nSkip on the beat then hang you with the rope (man down)\nI pull up on antics\nAlways got a pack and a bottle when I'm landing\nChipmunk stands out so they can stand him\nMe nuh give a fuck though, still getting bands in\n\n[Hook: AJ Tracey]\nWalk in the stu, then I turn the Mac on\nHanded the ting to my runner like a baton\nAlways got my hood up or I got a hat on\nSpurs v.s. anyone, man'll put a bag on\nCapri-Sun, boy, yeah, I got the juice\nYou can't war with man cuh' you'll lose\nNow I've got sponsors nicing man shoes\nMandem are next to make your man snooze\n\n[Verse 3: AJ Tracey]\nI do it for the P's and I do it for the flows\nWalk in the club, bare yats for the deal\nBare peach backs in the place doing wobble\nBut it looking like I'm cooling off of Jellyfish Fields\nTell a yat in ya face, can't pay for your meals\nFuck postcode beef, I just want bills\nGirls wanna stay round, girls wanna film\nGirls wanna brag and show friends couple stills\nAJ, I'll spin a big man for a laugh\nCause I've had more wheels than you've had hot baths\nMask on my face like I don't want SARS\nAnd I make more bread, I employ more staff\nMan's got a manager, man's got a stylist\nMan's got bare sauce but you can't buy this\nMan's got a lawyer, man's got an agent\nI make a next stack every time I close my eyelids\nTrapaholics voice drop, where did you find this?\nScrapping on a big back, man'a just whine it\nIf she ain't a 10, nah I won't dine it\nAward on my shelf, now I've gotta shine it\nYou thought that was your flow, but I designed it\nThey was catting for the EP but I timed it\n[?] better, combed on the top\nSkin fades on the sides and I just line it\n\n[Hook: AJ Tracey]\nWalk in the stu, then I turn the Mac on\nHanded the ting to my runner like a baton\nAlways got my hood up or I got a hat on\nSpurs v.s. anyone, man'll put a bag on\nCapri-Sun, boy, yeah, I got the juice\nYou can't war with man cuh' you'll lose\nNow I've got sponsors nicing man shoes\nMandem are next to make your man snooze\n\n[Outro]\nSnooze, Mac on\nTing, baton\nHood up, Hat on\nAnyone, Bag on\nJuice, Lose\nShoes, Next\nSnooze", "year": "2016-12-02", "album": "Lil Tracey", "image": "https://images.genius.com/42e247c17b91462a61395ec6a0d42490.1000x1000x1.jpg"}], "artist": "AJ Tracey"}