{"artist": "IDK", "songs": [{"title": "Sexy Bartender/Intro (Jay & Her)", "lyrics": "[Verse 1: Jay IDK]\nDamn baby, you bad\nAt least that's what I said in my mind\nAt least that's I said when I seen her\nServing margaritas as if they were subpoenas\nYou can tell that she ain't have subpoenas\nIn her good meaning, her vibe\nSaid it all, so I figured I'd set it off\nNo stoney, Frankie at all\nJust conversation of ours\nCould put me inside her bed, if I can get in her head\nBut that thing was kinda hard, so I came soft instead\nI asked about her interests and what she liked to do\nAnd right to my surprise I did the same things too\nNow is this a coincidence or am I falling victim to a player\nAKA a man-slayer, this ain't fair, but fuck it\nI'm tryna' take a risk, just like the saying\nI'm proving that ignorance is bliss, shit\nBut I would do anything just to feel those sexy lips around my dick\nI would steal bricks from Griselda Blanco's kids\nAnd drop my I.D. inside their crib just to get a kiss\nCause she was that bad and that fat and that ass\nWas in my mind, at that time I had three drinks\nHad a fourth one and shit, what do you think\nI spilled all the truth and all the rest that was left\nWas my middle name, mother's maiden name and address\nThe things that I would do to get a women's address\nWill be the same things a nigga do to cause him his death\nOh Lord\n\n[Interlude: Jay IDK]\nSo when I first started doing music, I wanted to stay in school and kinda, y'know part time it. I was like cool and I had a local buzz or whatever, y'know nothing crazy. Then I realized this was actually a passion, I started to fall in love with it and quickly after that I realized that this shit cost money, so I had to find a way to get it\n\n[Verse 2: Jay IDK]\nDamn baby, you're so beautiful\nDamn baby, you're so expensive\nDamn baby, I'm tryna buy you whatever you want\nKnow you turn me on when you flaunt\nBut I'm jealous as fuck, I'm tryna buy what you require\nWhy you fuckin it up\nYou givin' all of your attention to them other rappers\nBut they ain't half as nice as I am\nOh I get it, they got money, they twice as trap as I am\nWell fuck it, if that's what you want, I'll go and buy an onion\nIt ain't lucrative as coke, but it'll surely spike the budget\nIf my PR and my beats cost 1200\nThen this 9 to 5 cuttin' hair ain't 'bout to cut it\nSo baby, I'ma do what I gotta do to keep you\nEven if your efforts ain't guaranteed or equal\nEven if I gotta compete with other people\nI'll do what I do to prove how much I need\nYou\n\n[Hook]\nGet up, wake up\nGet up, wake up\nGet up, wake up\nGet up, wake up\nGet up, get up, get up, get up\nWake up, wake up, wake up, wake up\nGet up, get up, get up, get up\nWake up, wake up, wake up, wake up\nGet up, get up, get up, get up\nWake up, wake up, wake up, wake up\nGet up, get up, get up, get up\nWake up, wake up, wake up, wake up\n\n[Bridge]\nWhat's your addiction\nIs it base, is it lean, is it bud\nI'll make some batter, and mix, all of, the above\nWe'll call it SubTRAP\nBeware, they fall, in love\nThis what we're missing\nIf you're fiendin', I'll scratch your itchin', real soon\nWhat is you sellin'\nIs it base, is it lean, is it bud\nI'll give you all that\nAnd more, for the price, of one\nSit back and kick it\nGrab a blunt and light up your incent\nRelax and just listen\nThis the shit that the world is missing\nFor real, for real\n\n[Outro: Jay IDK]\nSo basically, to sum everything up, Subtrap is the art of trap music from another perspective. Instead of giving you one side of the fence, I'ma give you both sides with a message. Now a lot of this shit I haven't done personally, but when I was in and out of jail from 2009 to 2012, I took the time to ask questions. So a lot of the characters you're about to hear about are based off of real people that I encountered during my stay. However, if the parentheses of the back of this cover art reads \"Jay\", I'm speaking from the perspective of me. Hopefully by the next couple of songs, you'll be able to relate to myself, the plug, your everyday street hustler, your college weed lover, and maybe even your neighborhood crackhead and with that said I know ya'll tired of me talking, let's bring this music back in\n\n[Bridge]\nI know both sides and I'm gon' tell it like it is\nI'm gon' tell it like it is\nBoth sides of the fence, I'm gon' tell it like it is\nI'm gon' tell it like it is\nI know both sides and I'm gon' tell it like it is\nI'm gon' tell it like it is\nBoth sides of the fence, I'm gon' tell it like it is\nI'm gon' tell it like it is\nKick it\n\n[Hook]\nGet up, get up, get up, get up\nWake up, wake up, wake up, wake up\nGet up, get up, get up, get up\nWake up, wake up, wake up, wake up", "image": "https://images.genius.com/8e99e1b317f29d4cc517906d77c12fe3.500x500x1.jpg", "album": "SubTRAP", "year": "2015-08-25"}]}