{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/black-rob-news.jpg", "title": "Whoa! - amended version", "album": null, "lyrics": "Yo I'm gettin ready to put y'all up on somethin man\n(What's goin on yo)\nYo, when you see somethin ill (uh-huh)\nKnahmean? That shit is WHOA (that's what whoa means)\nAnything ill you see is WHOA (uh-huh)\nNigga have a big 6 at the curb that's WHOA (okay?)\nEspecially if he got the fully equipped kit on it; it's WHOA\nLike youknowhatImean? Like yo\n\nI had this bad bitch Uptown, she was WHOA!\nHad me fucked up in the head I mean WHOA!\nBought the bitch diamonds and pearls I mean WHOA!\nShoulda seen them shits shinin on her wrist, WHOA!\nNow money ain't a problem, see my dough is like WHOA!\nPulled out my bankroll on y'all niggas like WHOA!\nFloss the blue shrimp from two-tenth like WHOA!\nFaggot wanna peep my blueprints, I'm like WHOA!\nHad to hit the brakes on y'all niggas like WHOA!\nNiggas gettin pulled on my block like WHOA!\nComin home within a half an hour like WHOA!\nFrontin like they had the manpower like WHOA! More or less\nMore or so, I'll rip your torso\nI live the fast life, come through in the Porshe slow like WHOA!\nMy niggas - like dough, light 'dro\nNitro, might flow, nice clothes like WHOA!\n\nEase pain with cocaine like WHOA!\nNow I'm Doc Strange in the Range like WHOA! (They don't know me)\nHundred miles an hour, switchin lanes like WHOA!\nPlus I'm gettin brain from this chick like WHOA!\nFinger near a nigga asshole like WHOA!\nScene floss riches and bitches like WHOA!\nNine-nine Jag Benz Coupe like WHOA!\nKeep them cheese lines on youe blocks like WHOA!\nGrenade through your window bitch, like WHOA!\nLove to see me do this shit, like WHOA!\nNiggas put me through this shit, like WHOA!\nSo I'ma go toe to toe, blow for blow like WHOA!\nAnd rip your torso\nLive the fast life, come through in the Porshe slow like WHOA!\nMy niggas - like dough, light 'dro\nNitro, might flow, nice clothes like WHOA!\n\nWe bag it, then flip it like WHOA!\nCars we jack it then strip it like WHOA!\nFully equip it, front to back, like WHOA!\nSpittin on fiends that come for crack like WHOA!\nAskin for shorts and shit nigga like WHOA!\nHalf on his krunk, now nigga that's WHOA!\nFlow so properly you'll see I'm WHOA!\nAin't no stoppin me, I'm deep like WHOA!\nGuns be poppin B, we creep like WHOA!\nHear my name in these streets it's like WHOA!\nMust I pound the concrete like WHOA!\nFill his bitch ass, head to feet like WHOA!\nYour man ain't WHOA! The judge ain't WHOA!\nC.O.'s ain't WHOA! P.O.'s ain't WHOA!\nPlay y'allself I get the G.I. Joe\nD-I-C, K riders ain't WHOA!\nI'll rip your torso\nLive the fast life, come through in the Porshe slow like WHOA!\nMy niggas - like dough, light 'dro\nNitro, might flow, nice clothes like WHOA!\n\nNiggas gettin money in VA is WHOA!\nHoneys lookin right in ATL is WHOA!\nNiggas pimpin hoes in Chi-Town is WHOA!\nBitches takin paper in L.A. is WHOA!\nNiggas stacking dough in D.C. is WHOA!\nP.R. D.R. hold me down like WHOA!\nBallers in Detroit hold me down like WHOA!\nNiggas in New Orleans gettin money is WHOA!\nBoston and Jersey, muh'fuckers is WHOA!\nFlorida niggas and Philly niggas is WHOA!\nTampa and Texas, Cleveland is WHOA!\nMemphis and Lil' Rock, my niggas is WHOA!\nPanama niggas they hold me down like WHOA!\nMy New York peoples they hold me down like WHOA!\nBad Boy nigga, word is bond we WHOA!\nAlumni bitches, word is bond we WHOA!\n\nN.C, S.C., motherfuckers is WHOA!\nMy nigga Buckwild, word is bond he WHOA!\nUhh. and that's just how the story go\n\nAnd whoever I forgot on this shit is, WHOA!\nAww man, WHOA!\nEighth street, Life Stories (WHOA!)\nP.D.P.R., that nigga\nThe beat I got from big Buckwild is WHOA!\nThat nigga Black Rob on the mic is WHOA!\nMy whole fuckin flow on the mic is WHOA!"}], "artist": "Black Rob"}