{"artist": "Boogie", "songs": [{"album": "The Reach", "title": "Make Me Over", "year": "2015-06-17", "lyrics": "[Verse 1: Boogie]\nWhoa\nWe still hanging from the tree, I guess we better leaves\nThey still gon' Marshawn Lynch me if I never speak\nI see hawks that can’t see they own thoughts\nBecause they eyes was on women that can’t mind they own business\nSitting in my church, looking at my pastor\nSay he tryna find a witness, I’m like, “Nah, I ain’t snitchin',” whoa\nWhat if niggas looked at prison like a prism?\nWhile we squaring up with others, always thinking that we different\nGuess we, guess we in it\nLet it out your system\n‘Cause the system been assisting on your downfall, ah\nSee, I got lost in the truth, as I lie here just look at what I found, y'all\nLord, Lord, won’t you wrap your arms 'round my body?\nPut me in the sky, won’t you let me know you got me?\nAnd even if you drop me, I don’t really see it wrong, why?\nCuz you been holding me so long\nWhoa\n\n[Hook: D'anna Stewart]\nYou say I’ve been so strange lately\nYou can see how I done changed, baby\nLately I’ve been going through some things\nOohhh\n\n[Interlude: Boogie’s son, Darius]\nMy dear God, I ask you to bless my dad, my mom, my, my cousins, my cousin Ariana, Joshua, Tiana, Ronnie and Gregory\nAnd bless my mommy, my daddy…\n\n[Verse 2: Boogie]\nWhoa, uh, uh\nThat’s my five-year-old kid; he’s still got crayons in his cupboard\nNow how I’m ‘posed to tell him I got shot over a color?That don’t make sense, and sense ain’t too common, is it?\nThey try to blame them, they ain’t really the problem, is it?\nY'all got it twisted, and it’s fucking all my nerves up\nNigga, fuck your turn-up\nHow I’m 'posed to benefit? How that shit concern us?\nWord up, that nigga killed Tiana, now her family up in hell; he the one that’s 'posed to burn up\nGuess it ain’t my, I guess it ain’t my place\nHow I’m fighting for this race who ain’t got faith up in they face\nI can see it, I’ve been searching for myself, and I can’t even find a reason\nI got shot up in my foot, I’m never gon’ be defeated\nI promise, whoa\n\n[Bridge: Boogie]\nOkay let’s clap for them niggas\nWho turn they back on us niggas\n‘Cause they was clapping at niggas\nTo get it cracking for niggas who really hate 'em\nThey hanging from the cliff; let me see if you gon’ save ‘em\nMan, I bet not\n\n[Hook: D'anna Stewart]\n\n[Outro: Boogie’s son, Darius]\nDear God, I ask you to keep my family strong\nAnd keep my daddy out of trouble\nAmen", "image": "https://images.genius.com/329e9e692537ac6301adb12b1fef2ab9.300x300x1.jpg"}]}