{"songs": [{"image": "https://images.genius.com/9c2528fd588e5a336805a4ed4d9db564.1000x1000x1.jpg", "lyrics": "[Intro: Scotty Wotty]\nIt's the Sasquatch, the Jackpot\nThe roach killer, that's what we do\nYou know what it is, you little crawly creepy bastards\n\n[Verse 1: Scotty Wotty]\nWe ain't tripping, read the sentence\nThe Gods got it locked like up on Main in San Quentin\nYou drinking muscle milk, homey, you gon' get killed\nWalking round like Deebo, 'cause you slight built\nIt's a dirty job, we get it popping hard\nWe turn this whole shit slamming to the Mardi Gras\nAnd ain't nobody mad, it just we got it bad\nLike a body being slumped when you hail a cab\nVacuum packed, concealed, no room for breath\nI grip a mic, it's Five Fingers of Death\nSo, stomp the roach, stomp the roach, you know?\nStomp the roach, stomp the roach, you know?\nWhen I slip on, the grip-on, no clip on\nAnd on the O'Jay's like Christopher Pawns\nAnd eat with the beast, in the valley of death\nWalk on the right, but I shoot with the left\nStomp out a roach with the D-Con breath\nAll you little rat bastards, I stomp you to death\n\n[Chorus: Scotty Wotty]\nStomp the roach, stomp the roach, you know\nStomp the roach, stomp the roach, yo\n\n[Verse 2: U-God]\nFour more seconds 'fore the bomb come on\nRoach killer, you scatter when the lights come on\nYou can run on, and start ducking and dodging\nI pluck you, crush you right between the margin\nI'm the drill sergeant, I'm the boric acid\nThe black flag nigga, the bio hazard\nThe economist of the bio standard\nAnd he sprayed the mist on them flies that landed\nAnd I can be obvious or I can be candid, but\nI'm shaking roaches off my shoes and socks\nThen I, pluck roaches out my Fruit Loop box\nThen I, tell my girl to change all the locks\nThen I, throw my finger at the hip hop cops\nThen I, put on my Timbs, then I stomp the block\n'Cause I, stomp the roach, stomp the roach, you know?\n\n[Chorus: U-God]\nStomp the roach, stomp the roach, you know?\nStomp the roach, stomp the roach, you know\nStomp the roach, stomp the roach\n\n[Verse 3: GZA]\nThey known to leech off people for, years and years\nThey cause trouble by, staying up in, niggas' ears\nThey set up shops in apartments and projects\nBold enough to roll up on, any object\nGrabbing on my gear til they pull the label off\nThey fight for the crumbs that's on my table cloth\nThey keep they antennas up, the signals strong\nThey got the neighborhood bugged\nThat's how they survived so long\nImmune to combats and household raids\nLike informants that's living off, government aid\nWe leave roaches where the remain and trash lays\nIncinerate it, they spend they last days in ashtrays\nIgnored by the dogs, but, chased by the cat\nLike a sneaky ass rat that got caught in the trap\nA small time nigga, who didn't have a clue\nIt take a million of y'all just to fill up my shoe\n\n[Chorus: GZA]\nStomp the roach, stomp the roach, yeah\nStomp the roach, stomp the roach, uh-huh\nStomp the roach, stomp the roach, yeah\nStomp the roach, stomp the roach, uh-huh\nStomp the roach, stomp the roach, you know\nStomp the roach, stomp the roach, you know\n\n[Outro: 'The Godfather' sample]\nHow long till you get me off the hook?\nFor old time's sake I can't do it, Sally\nDon't ever take sides with anyone, against the family again ever", "title": "Stomp Da Roach", "year": "2009-06-23", "album": "Dopium"}], "artist": "U-God"}