{"songs": [{"image": "https://images.genius.com/b6b1954249340a8a91aa3595088a3bab.500x500x1.jpg", "title": "Dre Jackin For Beats", "album": "Bullets Ain’t Got No Names Vol. 1", "year": "2008-09-26", "lyrics": "[Intro]\nYeah, Neighborhood, tiny locs do the most\nNip Hussle in this muthafucka\nSlauson Boy, you niggas already know what it is\nHuh? Hood shit\nGive y'all a little throwback, like this\nLook, look\n\n[Verse]\nWith so much drama in the RSC\nMost of these niggas in L.A. ain't got the heart to be put on\nCome around my around my way\nYoung niggas in the back shootin' dice or on the roof with K's\nNow as I, step out my closet, put my keys in my car\nDippin' down the 'shaw, made a left on Hyde Park\nSeen some off-brand niggas lookin' shady\nThrew my hood, they start laughin' tryna play me, pssh\n6-0 degrees got me rollin' up my sleeves\nReachin' for my Ruger that's behind my AC, fa sheez\nI pull up on 'em slow, and hell nah, I ain't hesitate to squeeze\n'Cause I'm a tiny loc line presser\nYou might mess up, make the wrong turn off Slauson and learn a life lesson\nMACs with extended magazine and suppressors\nStrapped 'cause the police ain't on the streets to protect us\nTrapped in a sting, it's all a scheme to collect us\nLock us up in cages that they know ain't gon' correct us\nY'all done F'd up — you from the West, huh?\nYou got it on your mind, you should get it off you chest, cuh\nLotta speculation who gon' be the next up\nBlock money, tell these rappers get they checks up\nBefore you hit the West, charger sock kicks up\nSo when you get took for your change you could text us\nBetween Draws and the homie in the red Chucks\nIt's safe to say we got this whole shit sewed up\nWe got this whole shit sewed up\nI'm just looking for some more kush to roll up\nAlways smoking that la la la\nTo keep my brain maintainin' through drama, I'm\nNot the one, we jackin' for beats on back streets\nWith aluminum bats, toe tags, and PD\nThat's any jurisdiction, in or out the district\n7-7 division of crime scene forensic\nMy 9 blur the vision of material witness\n20/20 to blind, now she need prescriptions, look\nCut the lights out and twist up a sack\n'Cause the feds tappin' my hood, you get all that\nFrom the birds to the squad to the cameras in the back\nOf the routes by field where I handle the pack\nSee, a nigga like me just had to attack\nIn junior high, I ain't had no sack lunch, in fact\nI used to flip a quarter, get like me for change\nNow I flip quarter kilos of 'caine and cop again"}], "artist": "Nipsey Hussle"}