{"artist": "Pouya", "songs": [{"album": "South Side Slugs", "title": "Heed", "image": "https://images.genius.com/7fb8bfc4978c7618e15a2f630f97b65c.500x500x1.jpg", "lyrics": "[Verse 1: Pouya]\nYuh, yuh, yuh, yuh\nWas you fucking with me?\nWhen I had negative funds. (yuh)\nI was thinkin' about you all week, before i went to sleep (yuh)\nAnd when i woke up, still thinkin' about yo bitch ass\nThe tables have turned, you live and you learn,  you die and you burn\nBut its all good, im a new man\nYeah I fucked me a few fans, now they wanna take a picture hit 'em with the cold stance\nYuh, you 22 with a baby and a wife working at Denny's with a life\nAre you happy with your self?\nAll this hate in your heart can't be good for your health (yuh)\nNow I walk with the limp like a old man, ridin' around the city in a minivan, hitting my phone when you know i know you got a man, damn\nI'm trinity in The Matrix Reloaded you touch me imma rip your hand off, this shotgun ready to blow your dick off, these pop going in the microwave get your bitch wet\nCause you know when it come out imma go win, and i'm not here for the fuck shit  dont be mad cause your girlfriend loves this just be happy that i never wanna fuck with her (yuh)\nShe going keep poppin the pills untill she can't feel her face\nShe going keep poppin the pills untill she can't see your fate (yuh)\nBitch!\n\n[Hook x2: Alex Wiley]\nYou couldn't paid me attention no more\nCouldn't paid me attention\nWhat did it cost ya?\nPaid me attention\nWhat could it cost ya?\n\n[Verse 2:Allan Kingdom]\nCouldn't pay attention so what did it cost?\nTaken in the church like I'm Pentecostal\nCould have never been a penny that them panties off\nBet I be deep up in my feelings like I'm digging fossils\nCheese, Cheese, Cheese, Cheese\nI be smiling for some [?]\n[?]\nYou would've been grinning had you stayed by me\nI'm basquiat, turn you into my canvas but my paints drying\nPay attention to me you would profit\nYou got a sugar daddy, had a lost lover\nHad you been a writer, stick around for me\nYou would have a sugar daddy and a box cutter\n[?]\nThere is not a stroke that I cannot cover\nMade your daddy crazy in his office\nI knew we were slipping with them lost rubbers\nI know she was slipping when she snapped on me\nShe took from a baby to a block number\n[?] with mad money\n[?] cock numbers\n[?] witch my mind fascinates\nYou should never trust them based off their fashion [?]\n[?] I was shallow that's why this is happening\nYou would think [?] made you listen to me\nLiving through the pen then why don't you sing it to me?\n\n[Hook x2: Alex Wiley]\nYou couldn't paid me attention no more\nCouldn't paid me attention\nWhat did it cost ya?\nPaid me attention\nWhat could it cost ya?\n\n[Verse 3: Alex Willey]\nYoung nigga doing his thing\nWe don't give a motha fuck what people gon say\nUsed to the feeling, now its feeling so strange\nUsed to the feeling, never feeling his face\nSee he was raised in the ways of the god\nSee he was raised to observe and abolish those\nWays of the [?] to the heart\n[?] steady trynna treat him like a target though\nShe must've thought he was a goldfish or something\nShe thought that he won't remember\nAll of the times that she act like he won't gon be nothing but oh look she all on his nuts\nDamn\nShe said she ready to follow instructions\nThe voice in his head told him I do not trust it\nShe might be up with yo rival discussing\nSo pull over, put that hoe right on the bus\n\n[Hook x2: Alex Wiley ]\nYou could've paid me attention no more\nCould've paid me attention\nWhat did it cost ya?\nPaid me attention\nWhat could it cost ya?", "year": "2015-03-25"}]}