{"songs": [{"lyrics": "[Intro]\nDay turns night, day turns night\nDay turns night, day turns night\nDay turns night, day turns night\nDay turns night, day turns night\nNight Light, sucka!!!\n\n[Verse 1]\nPut one up for shackle me not clean logic procreation\nI did invent the wheel, in a previous generation\nWhile the triple sixers' lassos keep angels roped in the basement\nI locate modern halos and pass 'em out to the cavemen\nY'all catch a 30-second flash frame\nDirty cooperative med platoon\nBloom, head-trip split fantastic!\nFathom the splicing of major-league low-life\nWith anti-hero earthworm mentality – Godzilla!\nI pace my game for zero-hour completion\nSee, a cretin's still a cretin, even speakin' altered moniker\nAmerican nightmare lost in the monitor\nI'll hold the door open, so you can stagger through\nThen send berserker-bred Jukies in after you\nIt's Gutter, and I spell it with the 'G' I stole from \"Get the fuck up!\"\nNoise crutch stolen wretched refuse of my teeming dumb luck\nStill I promise: temperance towards breed still bleeding Amish\nSee, the freaks sucked out the wattage\nWhile three bears invade the cottage\nAnd I can't sleep now! Yeah, the police'll laugh\nYou won't be laughing when your covered wagons crash\nYou won't be laughing when you're hosted\nBy the ghost of Christmas past\nYou won't be laughing when your blow-up doll's got a headache and won't give up the ass\nI'ma lay my kicks to rest when I'm impressed\nSo I staple-gun 'em to my feet\nThis origami dream is beautiful: pull the tail, watch the wings flap\nBut you really can't do a thing with that\n\n[Hook]\nAll I ever wanted was to pick apart the day\nSwallow up the pieces, spit 'em at your species\nBeached in a city of lost barnacles and leeches\nNight Light got me when the daylight went to evenin'\n(Day turns night)\nNight Light, Day Light, Night Light, Day Light\nNight Light, Day Light, Night Light, Day Light\nNight Light, Day Light, Night Light, Day Light\nNight Light, sucka!!!\n\n[Verse 2]\nI'm pretty sure I got a pulse\nPlus we Shimmy cross the centerfold, and our night light engulfed\nJust let me keep the crumbs (Please!)\nWith seven deadly stains, adhere the blame to crystal conscience\nThe result's a dead-beat tryin' to make a dollar off a bomb threat\nOkay, link me to activism chain, activate wild-style Pluto orbit\nSet a course, then push the button\nI swallow spores born by the laws\nOf a morbid glutton– Alley gospel\nI can spot a duck battalion by the Charlie Chaplin waddle (gone)\nZig-zag and zig 'em again\nBefore the pig can pull a badge out for the lash out\nAnother thick installment of one night in Gotham\nLike, \"Houston, we have a problem: they're buffing the trains the same day the graffiti writers bomb 'em!\"\nWho split holiday freaks on box-cut cinema high road bellow?\nHead gripped, watch red bricks turn yellow!\nI'm tryin' to meet the wizard, but a tailgating tin-man holding a oil can won't let a hermit crab break in his new shell-toes\nLife's not a bitch: life is a beyotch\nWho keeps the villagers circling the marketplace\nOut searching for the g-spot\nMaybe she didn't feel y'all shared any similar interests\nOr maybe you're just an asshole – maybe I'm just an asshole!\nKiss the speaker wire (*kiss*)\nSammy Swashbuckler pagan threshhold\nStomach full of diner food, wingspan cast black upon views\nHere to help release the rabid hounds or pick apart your mood\nI got this friend of polar nature, and it's all peace\nYou and I seek similar stars but can't sit at the same feast\nMetal Captain, this cat is askin' if I've seen his bit of lost passion\nI told him: \"Yeah,\" and gave him one last look and smashed him\n\n[Hook]\nAll I ever wanted was to pick apart the day\nSwallow up the pieces, spit 'em at your species\nBeached in a city of lost barnacles and leeches\nNight Light got me when the daylight went to evenin'\nNight Light, Day Light, Night Light, Day Light\nNight Light, Day Light, Night Light, Day Light\nNight Light, Day Light, Night Light, Day Light\nNight Light, sucka!!!\n\n[Outro]\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nNight Light got me when the daylight went to evenin'\nDay turns night, day turns night, day turns night\nDay turns night, day turns night, day turns night", "title": "Night Light", "album": "Daylight", "image": "https://images.genius.com/db4126edfe3a18cd7b812110aa9cc5ae.1000x1000x1.jpg", "year": "2002-02-05"}], "artist": "Aesop Rock"}