{"artist": "Ace Hood", "songs": [{"title": "Promises", "album": "Starvation", "year": "2012-03-01", "lyrics": "[Verse 1: Ace Hood]\nUh, crowd full of loud fans, hope I don’t choke\nWhite girls goin’ ham, they just so stoke\nThey just think I’m kinda dope, guess I’m pure coke\nHope they love me for my drive, only lord knows\nMy daughter past couple months ago\nFeel like I’m breathing now with out a pulse\nNothing like losing what you love most\nPromises are just equivalent to False Hope\n\n[Hook: Kevin Cossom]\nPromises and promises\nYou said you will be here\nA promise is a promise yes\nAnd you said you will be here\nBut I’m all by myself\nWhen I need your help\nPromises and promises\nYou said you will be here\n\n[Verse 2: Ace Hood]\nUh, fuck man, daddy why you such a dead beat?\nWhile I’m 23 you ain’t never called me\nMomma said you was slicker than some hair grease\nYou’s a cheater, what’s the point of giving wedding rings?\nPoor man, you should be ashamed\nEver since I made it big I ain’t been the same\nFirst they love you then they hate you, it’s all in the game\nKinda funny when im out an people know my name\nAin’t life such a bitch dog?\nTook for me to get a deal now the bitch call\nFuck her once and never call get her pissed off\nI ain’t trippin’ leave me ‘lone when the dicks soft\nPromises, selling promises\nFake friends leave cause they counterfeit\nMama in the kitchen cookin’ butter grits\nOnly one who stayed around when them other’s dipped\n\nHook:\n\n\n[Verse 3: Ace Hood]\nMan, hardhead, should’ve listened when they told me\nGod the only man that could hold me\nBad bitches, all looking for a check\nAnd I’m a dope spitter looking for respect\nNiggas ain't hard, they just tryna flex\nAin’t trippin’, bring the Phantom through the projects\nYoung nigga gettin’ dumb paid\nDrop top, screaming fuck ‘em on the highway\nLater alligator, crocodile Dundee\nDoing bout a buck fifty on the one way\nLiving fast cause I never had\nMiddle finger to my ex cause you in the past\nSit alone with my pen and pad\nKeep me lifted, emotions driven, I got it bad\nI ain’t a killa but don’t tempt me\nMajority of family is so against me\nFigured since I win it big we should all eat\nI Hop on 106 and now you wanna call me\nShould’ve never left my west side\nPromises are nothing more than a great lie\n\nHook:\n\n\nI’ve been waiting on you for a long long minute\nWhen you said you’re gonna be here I thought you meant it\n\nBut I’m all by myself\nWhen I need your help\nPromises and promises\nYou said you will be here\nBe here\nBe-be here\nBe here\nBe-be here\nBe be be be", "image": "https://images.genius.com/ee1f29169e460342b88aa5c8d75ede59.500x500x1.jpg"}]}