{"songs": [{"image": "https://images.genius.com/424f7b980a8e9fdd5cd7592580e8fbfd.480x360x1.jpg", "lyrics": "[Verse]\nLemme ask you a question all about life\nDo you feel like you’re doing it right?\nDo you got a blade stuck in your heart right now?\nAre you afraid of removing the knife?\nDo you got a real friend that’ll pull it out?\nTalk to you? Ride for you? Ask who did it?\nOr is that friend the very person that walked up behind you and stabbed you with it?\nDo you know the definition of true survival?\nDo you feel like a new born/new arrival?\nAre you suicidal?\nYou could lie, but you and I both know the motherfucking truth is final\nAre you in love with a person who loves you too?\nOr do they love just to hurt you and fuck with you?\nAre you on drugs right now just for fun and games?\nAre you on drugs right now just to numb the pain?\nAre you on drugs right now?\n'Cause you don’t think you’re capable of feeling real love right now?\nDo you need me to walk through the screen that you’re looking at, grab you and give you a hug right now?\nDo you feel like you’re stuck in the upside down?\nHanging upside down?\nDo you wanna quit your job and just lie down?\nDo you wanna scream “I don’t give a fuck!” right now?\nLike I don’t give a fuck\nAll I wanna do is hit the highway in the autumn with a body in the trunk\nDo you hate the winter weather? Does it got you gettin' drunk?\nDid you pour a little whiskey in the coffee in your cup?\nCould the situation worsen?\nDid the situation worsen?\nI know that you feel like a human\nBut do you feel like a person?\nI know that you feel like a human\nBut do you feel like a person?\nI know that you feel like a human\nBut do you feel like a person?\nShould I dip this pen in your blood and sign your death certificate in cursive?\nDo you feel like shit if you’re not perfect?\nDo you feel like quitting is your purpose?\nAre you out of shape? Are you overweight?\nWhen you gonna die? Do you know the date?\nDo you wanna get up on a rocket ship\nAnd travel far from Earth and live in outer space?\nDo you wanna cut yourself and suck the fuckin' blood up out the wound 'cause you love how it tastes?\nAnd did you realize that your whole group of friends is fake?\nOr do you even care?\nDo you even know?\nAre your friends just putting powder up their nose?\nAre you poppin' pills?\nWay behind on bills?\nAre you scared to say you need some help for real?\nAre you in a fuckin' argument while driving, looking at your phone, your hand is on the wheel?\nDid she tell you that you got her pregnant right before she told you that she’s gonna have it killed?\nAhhh!\nDo you feel like life is worth it?\nAhhh!\nDo you feel like life is worth it?\nWhen you think about happiness, are the words that come to mind “I deserve it.”?\nListen, I know that you feel like a human\nBut do you feel like a person?\nI know that you feel like a human\nBut do you feel like a person?\nI know that you feel like a human\nBut do you feel like a person?\nKnow that you feel like a human\nBut do you feel like a person?\nThank you", "year": "2017-11-30", "album": "YouTube", "title": "Rapping Until I’m Screaming"}], "artist": "Mac Lethal"}