{"songs": [{"title": "Loves Me Not", "lyrics": "[Intro]\nI think I want a bitch, but…\nI don’t want a bitch, you know I want a bitch\nBut I think I want a bitch\nI don’t want no bitch, I don’t wanna fuck nigga, fuck it\n\n[Hook]\nDiamonds in my watch, I got 5 spots\nBend lil mama over and she said I hit her spot\nHollows in my Glock, extra 30 shots\nShe ask me what I like to do, I said smoke and show\nShe loves me, she loves me, she loves me not\nShe loves me, she loves me, she loves me not\nI said she loves me, she loves me, she loves me not\nBut I could give a fuck because I love my block\n\n[Verse 1]\nDiamonds in my watch but fuck that\nI had yo bitch over my nigga, house smoking, have a real cigar\nI think she sprung me ‘cause she didn’t even think about you when she on that shit\nBut she just like how I pull her hair when I’m from the back, oh I don’t trust that\nFuck that bitch, fuck that nigga\nThe Young Dolph nigga think he the shit, wuddup with that nigga?\nYou know wuddup with me\nI’m just chillin, my nigga we’re popping\nCounting money, you might have her rock n rolling\nSkinny nigga, body swollen\nRolling up this weed while I put these balls together\nFeeling like rise up tell mama we gon be rich forever\nLil mama say she loves me, she loves me not\nBut I could give a fuck because I love my block\n\n[Hook]\n\n[Verse 2]\nI’m just kickin it like hot toss\nMe myself and my Glock\nYou know how many shots I got\nNo safety, I’m fine ho\nI’m a busy man I’m like wild bucks\nNo beef on my town all my town she like\nSo all you getting, take time boss\nSliding down to yo girlfriend, she ready to ride like a tat show\nScoop her up like Basket Roberts then get her weded in a drive by\nI don’t sleep with her, she can’t spend the night\nOne eye open like Cyclops\nDollar signs all in my eyes, ain’t never needed no eye drops\nNot a day to make mo paper\nI grind harder than a pro skater\nNo friendships, just kissin niggas\nIn other words I owe no favors\nBlack guy, all black\nDarth Vader, no light saber\nThat gold peck is my life savior\nKeep mo pussy than a vibrator\n\n[Hook]\n\n[Verse 3]\nShe keep askin me what’s wrong and why my clip so long\nWhat’s in that Styrofoam and why my weed so strong\nNow she wanna know I be in the mall so much\nBut I just wanna know why she talk so much\nShe said she love me, she love me not\nPlus we just fuckin shop\nJust bout some mo ice\nYelling fuck with me ‘cause I’m high\nShe talkin, she smoking, fuckin bitches, where my pistol at?\nI just did her down, kick her out\nThink about callin her sister no\nHold on, hello! Who it is?\nCall me babe, bitch I got work\nBout to drop yo 16 off the studio but it ain’t no verse\nShawty say she want a purse, I told her sell this gangsta purp\nBuggin up surp get bangin off my way\nExtend, broken out my shirt\nNever take my high\n\n[Hook]", "album": "High Class Street Music 3 (Trappin’ Out A Mansion)", "year": "2013-05-14", "image": "https://images.genius.com/20403791e01f56a22f66273d3f249337.500x500x1.jpg"}], "artist": "Young Dolph"}