{"artist": "Drake", "songs": [{"year": "2006-02-14", "album": "Room for Improvement", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg", "title": "All This Love", "lyrics": "Southern Smoke!!!\n\n[Intro: Voyce]\nThis another one from your boy V-O\nI'm gon tell the people, that we locking this down\nThis another one from your boy V-O\nI'm gon tell the people, that we locking this down\n\n[Chrous: Voyce]\nI never dreamed that you would be so good to me and I know\nI don't deserve, All this Love (loving me)!!\nI can't believe that it's just really you and me, and I know\nI can't contain myself, All this Love (loving me)!!\n\n[Verse 1: Voyce]\nGirl, I've been thinking about the way, that you love me every day\nAnd I want to know, if You Feel The Same Way!!\nBecause I'm in and out of town, that's just how I got's to get down\nBut you understand, that's why I'm your man!!\n\n[Chrous: Voyce]\nI never dreamed that you would be so good to me and I know\nI don't deserve, All this Love (loving me)!!\nI can't believe that it's just really you and me, and I know\nI can't contain myself, All this Love (loving me)!!\n\n[Bridge: Voyce and (Drake)]\nUH, UH, UH (UH, V-O)\nUH, UH, UH (Yeah man!)\nYEAH YEAH (Haha. It's just me and you girl)\nYEAH YEAH (Keep rocking to this beat)\nUH, UH, UH (You want me to drop to this beat?)\nUH, UH, UH (HO!)\nYEAH YEAH (Let me get a little gospel on them. Yeah. Uh)\n\n[Verse 2: Drake]\nThey say he wanted the bounce back\nI can easily make them admit that the bounce back\nWithout knowing exactly where my accounts at\nYeah, you best believe\nThat I often tend to surpass what the rest achieve\nSo, they don't like me\nThey throw parties, and yet they never invite me\nI can't lie, sometime it bother me slightly\nEither way the true fans yell\nI appear calm, and it's obvious of who can't tell\nAnd no, this ain't Blu Cantrell\nThis is like perfection, though we both got the light complexion\nCouple things I do damn well\nAnd the way that I Jack son, you figure Drake knew Sam. L\nI'm for real though\nI'm from Memphis, I'm often labeled as Trill so\nThey stay kicking it with me like a field goal\nSee I'm humble, but I live fame\nFor more deals on the table than abridge game. Ahh\n\n[Chrous: Voyce]\nI never dreamed that you would be so good to me and I know\nI don't deserve, All this Love (loving me)!!\nI can't believe that it's just really you and me, and I know\nI can't explain myself, All this Love (loving me)!!\n\n[Bridge: Voyce]\nEven when the sun don't shine, I know you're my sunshine\nAnd even if the sun outside, we can anything baby\nI need to feel you next to me, You want to feel me next to you\nWe can do anything you want to do\nTell Me the Next Morn Baby!!!\n\n[Chrous: Voyce]\nI never dreamed that you would be so good to me and I know\nI don't deserve, All this Love (loving me)!!\nI can't believe that it's just really you and me, and I know\nI can't contain myself, All this Love (loving me)!!"}]}