{"artist": "Boogie", "songs": [{"album": "Thirst 48, Pt. 2", "title": "Fuck ’Em All", "year": "2016-10-14", "lyrics": "[Intro]\nWoah\nOh, man\n\n[Verse 1: Boogie]\nI hope you blessed in the city, get a vest in this city\nIf I hear you say \"who next in this city\" - oh shit\nBest believe that a semi not on me while watching\nBaby Boy screaming \"yeah, that's what I won't be\", poor Jody\nIt's more phony in your face, I've been riding on these brakes\nThey still telling me to \"wait wait\"\nHope when you say \"wait' you tryna say I should get tipped more\nHope when you say \"weight\" you tryna say I need to bench more\nTalkin' bout a wait, I been waitin' long as shit boy\nGraveyard shifts for the days I'm tryna live for\nNiggas out of shape and this that shit that they ain't fit for\nHow staying clean in this motherfucking shitstorm? *gunshots*\n\n[Hook: Boogie]\nThat's why I'm yelling \"Fuck, fuck, fuck 'em all!\"\nWe used to have options\nThen remembered that it's Compton and it's not\nSo we do it with not love involved\nSaid that I used to wanna give\nWhen it was back when we was kids and we did\nOn my momma now we want it all\nYeah, I said I used to wanna give, we was kids\nOn my momma now we want it all\nYeah, I said we want it all\n\n[Verse 2: Mozzy]\nI ain't do it for recognition, we the definition of goonbody\nIt's two bodies on this wally [?] at first\nIt's where I'm the same nigga in person to keep squirting\nAfter I seen murder my perspective is different, yeah\nReal felon, they respected my slither\nAll this slime in this Styrofoam affecting my liver\nMy little sister got her fingers in the money bag\nDo a show tomorrow, I promise the shit'll double back\nIn '05 I was high off of double stacks\nSlidin' in a '89 Buick with a hundred pack\nLose a fist fight and then run it back\nLost a couple niggas I love, this shit come with that\nYeah, taught my niggas how run a trap\nBlowin dope in a bounty, homie had to smuggle that\nThe streets love me and I love 'em back\nUsed to have love for the killer but lil' bro a rat\n\n[Hook: Boogie]\nThat's why I'm yelling \"Fuck, fuck, fuck 'em all!\"\nWe used to have options\nThen remembered that it's Compton and it's not\nSo we do it with not love involved\nSaid that I used to wanna give\nWhen it was back when we was kids and we did\nOn my momma now we want it all\nYeah, I said I used to wanna give, we was kids\nOn my momma now we want it all\nYeah, I said we want it all\n\n[Verse 3: DJ Quik]\nUp in the studio with skeleton tracks\nI’m pensive figuring out which one to finish\nTo try to stage a comeback\nI feel it for a minute or two, then I’m indecisive\nI break out over the speed limit on the 101 with no license\nI know I’m one of the nicest and I ain’t suped\nI know the difference between worthless and priceless\nI raised so much hell about them potholes on Central\nThat Hub City startin' to plug 'em now, I'm so instrumental\n\n[Hook: Boogie]\nThat's why I'm yelling \"Fuck, fuck, fuck 'em all!\"\nWe used to have options\nThen remembered that it's Compton and it's not\nSo we do it with not love involved\nSaid that I used to wanna give\nWhen it was back when we was kids and we did\nOn my momma now we want it all\nYeah, I said I used to wanna give, we was kids\nOn my momma now we want it all\nYeah, I said we want it all", "image": "https://images.genius.com/897bf6a1704e8f4822fba8ab981fa2b3.1000x1000x1.jpg"}]}