{"songs": [{"year": "2016-11-04", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "Here 2day Gone 2morro", "album": "H.O.G.", "lyrics": "[Intro: Krizz Kaliko]\nOh I know I can't be here forever\nYeah, one day I'll be gone forever\n\n[Verse 1: Big Scoob]\nTear jerking, ain't nothing else working\nPouring whiskey, I'm knowing for certain\nMy nigga's gone, he ain't coming home\nI'm left alone and I'm motherfucking hurting\nOver and over and over again\nSo many losses, when does it end?\nMy body's tired, my mind is lost\nSick of the fire, sick of the cost\nSick of these liars, sick of it, boss\nNeed to retire, go and get lost\nFar from a pussy, just mourning a loss\nFull of this liquor and needing a talk\nWho's gonna listen alone on this walk?\nAll by my lonely, the way I was taught\nContinue this run until I get off\nLive by the gun, and die by the yawk\nOne thing for certain: we all gonna die\nWe all got it coming so take it in stride\nBut this one is painful, it's hurting inside\nI miss you my nigga, I'm tryna stop crying\nNo healing with time, no needing me lying\nThey say it gets better, I'll never be fine\nI'm losing my mind a piece at a time\nIt's dark and it's lonely and nowhere to hide\n\n[Hook: Big Scoob] x4\nHere today and gone tomorrow\nLosing only's filled with sorrow\nLiving out this liquor bottle\nHow much longer 'fore I follow?\n\n[Bridge: Krizz Kaliko]\nOne day you'll look up (true) and I'll be gone (gone)\nI've been blessed to live this long\nThese city streets getting colder\nAnd I'm getting older\nGotta get my mind right, yeah\n\n[Verse 2: Bakarii]\nNiggas die every day\nStill I think about the time when it might be me next\nStill tripping on the daily\nWhen it came so real, niggas ain't been the same since\nStill I gotta find a way\nTo hide the pain that I feel, make ya wanna take a nigga face\nPut his mouth on the AK, then I let it flame, leaded pain, nigga bang 'til he thrown away\nBut I gotta think smarter\nCuz shit gets a little bit harder\nGotta be there for my son, gotta be there for the winning, gotta be the one that feeling for my daughters\nCuz we living in a way\nIf you get caught slipping, nigga, might be your last day\nSo you better think twice when you run up on a nigga with the milli that'll hit you like Pompeii\nFor this, I miss, my niggas, my sorrows I drench\nI hit the hemp, drink a fifth, while pumping my grip\nI wish that this was it, but still I persist\nWith a bunch of niggas coming from the gutter\nGot 'em running for the cover when I hit 'em with the shit\n\n[Hook: Big Scoob] x4\nHere today and gone tomorrow\nLosing only's filled with sorrow\nLiving out this liquor bottle\nHow much longer 'fore I follow?\n\n[Outro: Krizz Kaliko]\nSee there's some truth to this (life)\nDon't get too used to this (you might)\nWake up one day and everybody's gone\nWake up one day and everybody's gone"}], "artist": "Big Scoob"}