{"songs": [{"album": "Truly Yours", "year": "2013-02-12", "title": "Can I Holla At Ya", "image": "https://images.genius.com/6490c45ad4867e7a4b4248258106ac10.899x899x1.jpg", "lyrics": "[Sample: Lauryn Hill]\nOne day, you're gonna understand...\n\n[Intro: J. Cole]\nHey\nCan I holla at you?\nLet me holla at you\n\n[Verse 1: J. Cole]\nSpecial, never forget the day I met you\nWe was destined for each other like a, son to his mother, or a\nSister and brother, man this bond is deep\nWe go a couple years and don't even speak\nBut know it's love though\nCould never let 'em dirty your name\nI got the utmost respect for you\nCame back home and had to check for you\nWord round town is you locked down\nSome older nigga snatched you up gave you a rock now\nDamn, hey could it be—\nShe like, \"If you was me you wouldn't wait for me\nLiving fast and wouldn't mash the brakes for me\"\nBig city slicker nigga on a higher track\nBigger now but when she send a letter always write her back and\nTime revealed, she feels that she settled too soon\nWhile she see me go for mines and she admire that\nWe speak about time as if we could just buy it back\nIf only it was that simple, damn I miss you\n\n[Hook: J. Cole]\nCan I holla at you?\nCan I holla at you?\nAy let me holla at you!\nYeah I know it's been a while but ain't no better time than now\nCan I holla at you?\nCan I holla at you?\nAy let me holla at you!\nYeah I know it's been a while, but—\n\n[Verse 2: J. Cole]\nYou betrayed me\nThe day you played my momma you played me\nCan't believe I let you in my heart nigga\nI shoulda, followed my instincts, a stranger in my house\nOnly five years old but sensed danger in my house\nI was too young to scrap you, but damn if I ain't want to\nI'm blowing up fast and I hope these words haunt you, uh\nThirteen years, knew you more than my real pops\nPut me on to 'Pac and all the rappers that killed cops\nWho woulda thought that you'd leave my momma high and dry\nLast words to a bitch nigga \"why you lie?\"\nFeeling bitter so these words might seem jumbled\nWhen you left I watched that lady crumble\nI know by now you probably a old man\nBut I still I feel I won't be satisfied until we throw hands\nFor all the ass whoppings\nHeard you tryna talk, tell that punk don't call me\nYou ain't shit, and I'm scared it rubbed off on me\n\n[Hook: J. Cole]\nI holla at you\nI holla at you\nAy let me holla at you!\nYeah I know it's been a while but ain't no better time than now\nCan I holla at you?\nCan I holla at you?\nAy let me holla at you!\nYeah I know it's been a while, but—\n\n[Verse 3: J. Cole]\nI heard you on that shit, I hope it ain't true\nWas hard to holla at you last time I came through\nCould barely recognize you, naw nigga this ain't you\n'Cause you ain't lookin' like that nigga that I once knew\nAnd plus you act like you don't know me\nWe was homies, now you call me by my rap name\nSee me do my thing so you expected me to act strange\nAin't holla but you on my mind nigga\nI don't forget the good times nigga\nWhite tees in the club, jeans baggy as fuck\nSometimes I look back on my life, that was the happiest stuff\nWe had potential to be monumental, 'ville mentality\nYou know that old kill-or-be-killed mentality\nI look at where you at now it's a, real fatality\n'Cause where you s'posed to be is on top, close to me\nChasin' hoes like the old days, but now we overseas\nDawg, congratulations on your seed\nYo my nigga\n\n[Hook: J. Cole]\nCan I holla at you?\nCan I holla at you?\nAy let me holla at you!\nYeah I know it's been a while but ain't no better time than now\nCan I holla at you?\nCan I holla at you?\nAy let me holla at you!\nYeah I know it's been a while, but—\nHey"}], "artist": "J. Cole"}