{"artist": "YG", "songs": [{"image": "https://images.genius.com/ba2a73211e21ff3e11eba91f3f156e9d.1000x1000x1.jpg", "year": "2014-03-18", "album": "My Krazy Life", "lyrics": "[Verse 1: YG]\nFirst, you find a house and scope it out\nFind a Chinese neighborhood\n'Cause they don't believe in bank accounts\nSecond, you find a crew and a driver\nSomeone to ring the doorbell\nAnd someone that ain't scared to do what it do\nThird, you pull up at the spot\nPark, watch, ring the doorbell and knock\nFour, make sure nobody is home (knock knock)\nThey gone, okay it's on\nDon't be scared, nigga, you in now\nIf the police come you gonna find out who your friends now\nThat ain't me talking, that's your mind playing tricks on you\nYou're conscious cause you know you got 9s with 2 clips on you\nBut fuck that, motherfuck that plasma\nAnd fuck that laptop, go and get that jewelry box\nYou tryna get paid? Go take that jewelry box to the Slauson\nThey'll give you cash back in the same day\n\n[Hook: YG]\nMeet the motherfucking flockers\nMake money-money, make money-money-money\n(Make some noise if you've ever stole something in your life)\nTake money-money, take money-money-money\n(Don't be ashamed, it's okay, baby)\nMake money-money, make money-money-money\n(Make some noise if you ever stole a dollar out your mama purse)\n(When she wasn't lookin while y'all was in Church)\nTake money-money, take money-money-money\n\n[Verse 2: Tee Cee]\nNiggas don't know the history 'bout the flock\nPut the flathead in the door, pull it, make it go flock\nHit the first drawer, grab a nigga some socks\nThat nigga in the car better be listening to that box\nAy, I ain't staking out shit, nigga\nEeny, meeny, miny, moe and ding-dong-ditch\nAin't a safe I can't crack, nigga, that's on Crip\nI'm with my Pirus from Compton, we gon' pass and get rich, ayy!\n50 racks, three niggas, Sixteen-five a split\nLet some weeks go by we at the dealership\nI never took notes, nigga I need the pink slip\nHit Icey, macking up for my bullshit\nSpent about ten cash\nWe jumped into the whip and did the whole dash\nD. Loc my nigga, my nigga\nHit my first lick, pass with my niggas, ayy!", "title": "Meet the Flockers"}]}