{"songs": [{"year": null, "album": "My Life is a Movie", "image": "https://images.genius.com/5b75d54d0308abb6dc6e5d131b2b35e8.168x179x1.jpg", "title": "Voices At The Crossroads", "lyrics": "[Intro: K'naan]\nYou into it?\nAlright, well let's get into this one\nClose your eyes on this one and vibe with me\n\n[Verse 1: K'naan]\nSo\nIn the beginning there was hum\nFrom a poet whose pulse fell\nDrum drum drum!\n\nHe would perform prayers and all\nTill one day he heard a voice call\nCome come come!\n\nSuspicious he moved with vicious caution\nDismisses, he thinks it's a little off\n\nPeople get held back\nBy the voice inside them\n\nYo -\nThe voice said I'm poised to speak inside you\nRejoice and please let me invite you\nTo evil, greed and lies too\n\nYeah -\nConfused and dazed he moved in ways he soon became a kunni\nBoom boom boom\nAnd knock on his door his heart is no more\nAnd knock on his door his soul is no more\n\n[Hook: Tracy Chapman]\nAll you folks think I got my price\nAt which I'll sell all that is mine\nYou think money rules when all else fails\nGo sell your soul and keep your shell\nI'm trying to protect what I keep inside\nAll the reasons why I live my life\n\n[Verse 2: K'naan]\nSo so so -\nThe poet's got a proposal\nHe would own his soul but never know\nWhat it feels to be free\n\nHe would be the frozen imposed as the chosen on all those opposing\nBut he would be greed\nThat's got him there\nHe's power hungry and proud too\n\nPeople don't care, people just scared\nPeople don't care, people just prayer\n\n[Hook: Tracy Chapman]\nAll you folks think I got my price\nAt which I'll sell all that is mine\nYou think money rules when all else fails\nGo sell your soul and keep your shell\nI'm trying to protect what I keep inside\nAll the reasons why I live my life\n\n[Outro]\n(Interviewer)\nSo K'naan, you have a unique as far as your life goes. At the same time, it's very familiar to a lot of people on the planet. You wanna share with us?\n\n(K'naan)\nMan, that of the displaced peoples. Yeah, that's everywhere. I was born and raised in Mogdishu, Somalia. Um, spent a lot of time here and, you know, around the world traveling doing my music, my word, you know, spoken word and poetry. And that's where I groove, you know, that's how I became a full-on artist is through the word, hip-hop"}], "artist": "K’naan"}