{"artist": "Hasan Salaam", "songs": [{"album": "Music Is My Weapon", "lyrics": "[Verse 1: Hasan Salaam]\nThe melodies and harmonies stick to your ribs\nLike hominy grits in the winter you dig\nAs a kid I was raised on the sounds of Motown\nFrom Planet Rock where galactic B-boys throw down\nBreath of fresh air in the depths of despair\nNo matter how bad it get, the music gets there\nPark jams remind us of Congo Square\nAnd that feeling gets your ass up like musical chairs\nSang spirituals on the plantation for salvation\nFrom blues shaman to DJs and beat breaking\nIt's so sacred, just know the ledge\nSaid if it wasn't for the music I'd be better off dead\n\n[Hook: Baron]\nIt lifts me up\nAnd calms me down\nWhen I am lost\nIt's through the sound\nI find my inner light through music\nMusic is my life\n\n[Verse 2: Hasan Salaam]\nThe vibe that I'm giving you\nBeen the same since I was rocking James Brown tunes in Mama's Living room\nNo silver spoon, hairbrush, microphone and a boom box\nLip-syncing to M.J, moon-walking across the spot in some tube socks\nFrom the bricks to the boondocks\nHip hop got the bass bumping up higher than blue tops\nGhetto griots still spitting they oo-ops\nLike Pops on the block harmonizing his Doo-Wops\nAir guitars turn us all to rock superstars\nHear your song, sing along, no matter who you are!\n\n[Hook]\n\n[Verse 3: Hasan Salaam]\nThis is for the Godfather of Soul and Charles Parker\nBird lives in the flatted fifths we play sharper\nBob Marley them no capture fire starter\nBig and Pac, still rockin' to the Music of Martyrs\nJohn Lennon, Marvin Gaye, relevant to this day\nNo bullet could take music away!\nBurning Hollywood with P.E leading the way\nYelling fuck the police with N.W.A\nRay Charles sang with 20/20 vision\nAnd Fela's freedom got found in the rhythm\nListened to the pain of Kurt Cobain\nAnd saw God in the notes of Saint John Coltrane\nAaliyah singing proof that angels existed\nJimi Hendrix \"Purple Haze\" made sure we was lifted\nVoice for the voiceless, just gotta say Ashe\nLet's keep celebrating Billie Holiday!\n\n[Hook]", "title": "Musical Chairs", "year": null, "image": "https://images.genius.com/3ed29b432d8c745f8527ee2e4d9c242c.350x350x1.jpg"}]}