{"artist": "Boosie Badazz", "songs": [{"album": "Thrilla, Vol. 1", "title": "Empire 2", "year": null, "lyrics": "[Intro]\nMy empire, will not be denied\nMust I say it again?\nMy empire will not be denied\n\n[Verse  1]\nI'm a real street nigga, who ain't lovin' the fame\nI can't help it everywhere I go they knowin' my name\nGold teeth, gold chain, all gold everything\nCold pictures, old pictures with that Tec in my hand\nBoosie Badazz, nigga, I'm the best in the game\nHow you the best in the game?\nNo one else in my lane\nTonight I'm fuckin' you, I'm 'bout that\nSo girl get your mind right\nI'll fuck you and your girl if you don't want to fuck your girl\nYou ain't gonna find too many niggas off the chain like me\nDiamond ring, piece and chain\nBuilt hard like concrete\nLike Zoes my squad deep\nYeah, we official\nAt the club, we just want pussy\nBut boy we ain't pussy\nGon' be mad cause I'm flexin'\nDiamond I'm shinin' from Texas\nEvery girl that I'm sexin'\nI'm a real bitch, blessin'\nAnd I got money to blow, but I'm stackin' my Jacksons\nBut my squad 'bout murder\nAnd we packing the plastic\n\n[Interlude]\nThere's no stoppin' my empire\nWe finessin' now\nThere's no stoppin' my empire\nYo, B-Will get at these niggas\n\n[Verse 2]\nWhen I'm in Texas I keep my Texas phone\nWhen I'm in Memphis, hit my Memphis phone\nPull up in Emmit, won't take that long\nDon't fuck your bae at home, and I know I'm wrong\nFunny shit 'bout it, shit won't take that long\nI'm Tyrone, pimpin' on my mobile phone\nWhen I got my Rollie on\nIt's dumb shit, and precious stones\nTo you, she a bad bitch, to me she's just a sexy song\nBitch, don't treat my Lexus wrong\nWho the fuck you flexin' on?\nI bought that!\nI know these niggas hatin', nigga\nI caught that!\nI know you see me skatin', nigga\nFour-five for shady nigga\nAutomatic chopper, think I'm crazy, nigga\nAir Max and cigarettes\nI ain't met a nigga yet that spit this\nIt's winter fresh, and keeps this bitch [?]\nI could never try to turn a stripper to a [?]\nJack the Ripper slippers, red bottoms when I walk the set\n\n[Verse 3]\nYou are not the plug, bitch you just a drug addict\nEatin' every rapper boy you better check the attic\nI been on top for a minute like [?]\nWay up for a while and I do not need ladders, little nigga\nMoney so tall you could [?] to it\nEven better, ask me for it lil nigga\nFuck with the kid, cause I ball now\nBaby girl you gon' get this dick in the nighttime (nighttime)\nSince you gonna sleep on the kid\nYou don't suck dick baby girl, it's the right time (right time)\n(For real, for real)\nAnd I'm talkin' [?] status\nPaint drippin', style drippin'\nI need a [?] napkin\nI used to laugh but now they raise whenever we pass them\nThe coup has no roof so you can't imagine\nThe [?] the lime light, I see everyday\nBut you gotta remember at the end of the day\nThat man, this is my passion", "image": "https://images.rapgenius.com/d514b3d0a40963288092a2eae8121033.1000x1000x1.jpg"}]}