{"artist": "WC", "songs": [{"year": "2007-08-14", "lyrics": "(feat. Ice Cube)\n\n[Chorus:]\nGrab hold of it Baby, Let's Get It On [x3]\nYou got it mutha, Let's get it on [x3]\nGrab on it baby, Let's get it on [x3]\nYou got it mutha, Let's get it on [x3]\nGrab hold of it baby\nLook at me (god damn)  [x2]\nYa'll look at me (god damn)\nLook at me (god damn), Look at me\n\n[VERSE 1: WC]\nDub sizzle for shizzle a nigga fresh off of work and I'm clean as a whistle I keep it crackin' I got these hoes on the phone saying\n(let's get it on) (let let's get it on) Woo! Clean! baby dub sizzle lean C-walkin with a lean on my sticky green I rep it right\nSo if you want sex tonight call the original shady\n(Grab hold of it baby) got my dubs up, I'm in the club like fucked up holding my cup got the tailor made air one nikes with a twist big biting on my wrist (god damn) it's the return of the real and the 07 turnin' the wheel chrome feet with a chrome grill in a wide body some with my eyes blunted got a pocket full of hundreds now which bitch want it?\n\n[Chorus:]\nLet's get it on [x3]\nYou got it mutha, Let's get it on [x3]\nGrab hold of it baby, Let's get it on [x3]\nYou got it mutha, Let's get it on [x3]\nGrab hold of it baby, Look at me (god damn)\nLook at me (god damn)\nYa'll look at me (god damn)\nLook at me (god damn)\n\n[VERSE 2: WC]\nDRINK! in my hand on the dancefloor, PEEP! I'm off that hennessey brown with coat FREAK-IN! on this girl while I dance slow tag tood on her waist with her pants slow now I'm, REACH-IN! for that big brown carmel, SQUEEZIN! on that thick soft round tail, CREEP-IN! on the door witha door-swell I'm a have her legs in the air at the hotel, after that we will blow with ninkel keep it on the low you got a man I won't tell but when you bend over girl that thangs like BOOM! BLAM! GOD DAMN! I keep em all sweatin' and stumble and mang nang going on a whole lot-a of sex and hustle, a whole lot-a smoke and drank, and got thirty-eight hours to play ya'll I live for the day ya'll\n\n[Chorus:]\nLet's get it on [x3]\nYou got it mutha\nLet's get it on [x3]\nGrab hold of it baby Let's get it on [x3]\nYou got it mutha, Let's get it on [x3]\nGrab hold of it baby, Look at me (god damn)\nLook at me (god damn)\nYa'll look at me (god damn)\nLook at me (god damn)\nHold up, Hold up dub whatchu tryina do to me?\nGet yo ass drunk [x16]... [Barfing] You still got me to throwin' up\n\n[VERSE 3: WC]\nDon't' worry bout it baby I'm still gonna fuck yo ass hahahahaha", "image": "https://images.genius.com/d4ed6bd2c7a379500fac9a01a4457d66.300x300x1.png", "album": "Guilty by Affiliation", "title": "Look At Me"}]}