{"songs": [{"album": "Hood Hop", "year": null, "title": "U Ain’t Gotta Like Me", "image": "https://images.genius.com/dc1e313d046fcee39f7241ff6abdcee0.600x600x1.jpg", "lyrics": "[Intro - J-Kwon - talking]\nI'm gettin' sick and tired (yeah)\nI'm gettin' sick and tired\nVery sick and tired..homie (homie)\n\n[Verse - J-Kwon]\nIf I had a Coupe right now, it would be on 'E'\nSometimes I feel \"Unpretty\" than TLC\nRaise your hands motherfucker if you feel like me\nLive like me and you know what's real like me\nSpit for the cats who ain't got none and humble too\nBut damn, fuck I'm sick and humble too\nIt ain't over, it just feel like it crumble boo\nNow since you, shit I wanna rumble too\nNow if you're sick and tired, say it quick, say it proud\nIf you're sick and tired, say it now, say it loud\nFinally got the crowd to poppin', ain't afraid of coppin'\nEvery reppin' St. Louis and ain't stoppin'\nI'm sick and tired of this lame brain shit\nKwon gettin' money, nah Kwon gettin' fits\nSay whatever you say how you say it's about me\nHow can this crowd be sick and tired without me?\n\n[Hook - Big B + (J-Kwon)] - x2\nYou ain't gotta like me (I ain't gotta like you)\nAnd I ain't gotta like you (You ain't gotta like me)\nAnd you ain't gotta like me, I ain't gotta like you\nFirst time it's \"fuck me\" then nigga it's \"fuck you\"\n\n[Verse - J-Kwon]\nI've been bamboozled, too many times for fuckin' losin'\nDogg I'm sick and-I'm sick and tired of you dudes\nKeep a duece duece (Whoo!) tucked in the roof\nFuck a stash in the car, I got hash in the car\nLook at ass they chick, I got ass in they jar\nI'm tired of these hoes tryin' to tell Kwon to go and rob\nI'm a gangsta motherfucker, fuck who you are\nI told you Kwon to drink it then piss on the bar\nI don't give a damn and you niggas know it (know it)\nDerty you pussy and when you pussy, J-Kwon gon' show it\nGuns I hold it, and you don't want to get to trippin'\nOne squeeze of the trigger, errbody limpin'\nI'm from a block, where errbody Crippin'\nErrbody sniffin' and errbody pimpin'\nJ-Kwon and TrackBoyz, this is the take off\nAnd dude I'm sick and tired until this shit take off\n\n[Hook - Big B + (J-Kwon)] - x2\nYou ain't gotta like me (I ain't gotta like you)\nAnd I ain't gotta like you (You ain't gotta like me)\nAnd you ain't gotta like me, I ain't gotta like you\nFirst time it's \"fuck me\" then nigga it's \"fuck you\"\n\n[Verse - J-Kwon]\nI'm hot (Yah'mean?) summin like Jay-Z\nHow's that? cause I clap (Yah'mean?) it back (Yah'mean?)\nStrapped (Hella green) ...man you know they clap (Yah'mean?)\nKeep a stash in the dash, put out I'm rollin'\nBought or stolen, I'm Hollywood like Hulk, Hogan\nCardboard niggas they too often to start, foldin'\nDon't get mad at me cause a chick jaw, swollen\nCause I keep gettin' heaters (yeah)\nI'm like Maxamillion, I'll make you smack yourself with ya dick beaters\nYou're click's sweeter, you don't have the time niggas\nOn the block, he don't never wanna battle rhyme niggas\nPerceivin' me right huh? I shine like a light what?\nDiamonds so bright, I brought light to the night club\nFuckin' wit Kwon, you must really like slugs\nI'm the black Brad Pitt and this is the \"Fight Club\"\n\n[Hook - Big B + (J-Kwon)] - x2\nYou ain't gotta like me (I ain't gotta like you)\nAnd I ain't gotta like you (You ain't gotta like me)\nAnd you ain't gotta like me, I ain't gotta like you\nFirst time it's \"fuck me\" then nigga it's \"fuck you\"\n\n[Outro - J-Kwon]\nYa under-ya dig what I'm sayin?\nYou see what I'm sayin?\nI'm truy blessed right now, you know\nJ-Kwon nigga, I'm hot nigga\nI told y'all I was gettin' hot\nI'm wit my man Big B nigga\nIt's Show-Off nigga\nSHOW-OFF!"}], "artist": "J-Kwon"}