{"songs": [{"year": "2009-01-01", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "2DopeBoyz Freestyle", "lyrics": "[Hook: Kendrick Lamar]\nToo hot to handle, Too dope to hold\n2DopeBoyz we roll deep everybody gather\nYour seats, we going to Cloud 9 and we\nComing back in a week, and the weak good\nRiddance, only the strong permitted to ride\nOr test drive with Kendrick the Jedi, one of a\nKind like great antiques museums buy\nHaters I tell em hi, enemies I don't tell em shit\nBut booya click booya click, click\n\n[Verse 1: Kendrick Lamar]\nOoh, ya'll done stumbled on a fortune\nThe rebirth of hip hop since they got abortions\nAnd I rock like Mt. Rushmore, grab your thesaurus\nSo you can find a synonym of a nigga that been gem\nDiamond in the rough\nSheriffs wanna see me cuffed like the links of a button up\nBook em down! Fuck is up?\nMind of a Vietnam Vet when a nigga rhyme\nA nigga shine, like I'm seeing signs in a different light\nI'm on my grind, see it right? Real starving artist\nFinna blow like a Mario Game cartridge, standing on my own two\nMe and Dave like Big and Puff before shiny suits\nWelcome to the Compton Zoo, lying with a lion on Rosecrans Avenue\nA tiger on Central\nArms so soar beating up these instrumentals Sounwave give me\nMore, after that find a morgue with a mortice, because we..\n\n[Hook: Kendrick Lamar]\n\n[Verse 2: Kendrick Lamar]\nOoh, and I'm back up on my bullshit, shooting to the top with a hollow\nTip full clip\nAnalogy is like a pit bull on the pulpit, I drool I don't really\nSpit, mad dog in this bitch, foaming at the mouth, is you a man or a mouse?\nSipping Mickey's, while you looking like Mickey trapping it out\nThat's not a diss, that's really a dope line, and in order to see my vision you\nProbably would go blind\nI'm chilling with a blonde, she dumb as fuck, but she can suck a bowling ball\nThrough a straw, that make you tell your mom\nI'm just a little nigga trying to make my city proud, I used to watch Doug and wear\nMy cousins hand-me-downs\nNow I'm grown up, unemployed, sipping Henny, pissing throuh a cup, and still get\nThe job done, 2DopeBoyz I said what up, tell your listeners to have some frost\nBitten gloves cause\n\n[Hook: Kendrick Lamar]"}], "artist": "Kendrick Lamar"}