{"songs": [{"year": "2018-03-22", "image": "https://images.genius.com/fcdd7f08a74872eafd62860f3f25235d.1000x1000x1.jpg", "title": "Ride", "album": "Birdman Presents: Before Anythang (Soundtrack)", "lyrics": "[Intro: Birdman & NBA YoungBoy]\nYeah, yeah (Yeah, yeah)\nStunna man (Stunna man, brr)\n38 baby, you know? (38 baby, you know?)\nFrom the bayou (From the bayou, from the bayou)\nYou know? (You know, you know?)\nJust on some OG original shit (Just on some OG original shit, original shit)\nOriginal hot boy type shit (Original hot boy type shit, type shit)\nProject life, you know? (Ayy, baby tell me, would you ride for a nigga?)\nI remember seein' a little homie got hit up (Baby tell me, would you die for a nigga?)\nBest believe we gon' hit somethin' up (I'ma slide for my niggas)\nYou know? (On my life, I'ma slide for my niggas)\nStarted with six, ended with five, and hot boy the one still alive (I'ma ride for my niggas, on my soul, I'ma ride for my niggas)\nShit real out here, boy (I'ma die for my niggas, on my gang, I'ma die for my niggas)\nYou know? Bunch of young niggas wylin' tryna get money (Ayy, ayy)\n'Til we decided we was gon' get money, got money (Ayy, ayy)\nAin't give a fuck about nothin' (Ayy, ayy)\nBetter you than me, that's how I was taught  (Ayy, ayy)\nThis on some G shit, blood (Ayy, ayy)\n\n[Chorus: NBA YoungBoy]\nBaby tell me, would you ride for a nigga?\nBaby tell me, would you ride for a nigga? (Would you ride for a nigga?)\nBaby tell me, would you die for a nigga?\nBaby tell me, would you die for a nigga? (Would you die for a nigga?)\nBaby, come and take a ride with a nigga\nCome and see the other side with a nigga (Other side with a nigga)\nBaby, come and pass time with a nigga\nHad to tell 'em I'm a high-class nigga (I'm a high class nigga)\nAyy, let me tell you, I ain't never had nothin'\nOn the way to that money, I be runnin' (I be runnin', I be skrrt)\nI could show these niggas how to make somethin'\nEvery day, all day, we be stuntin' (All day we be stuntin')\nLivin' wrong, you ain't never seen nothin'\nPromised me you would never say nothin' (You would never say nothin')\nHad to tell baby girl I'm a stunna\nHave you ever rode through town with a gunna? (Let me tell you 'bout it)\n\n[Verse 1: NBA YoungBoy]\nI'm out the north, we youngins thuggin' and poppin'\nThe only way that we can get it, so you know we ain't stoppin'\nYou step on scene, all these bitches they be lookin' to jock\nWe sellin' drugs, the police they keep passin' and watchin'\nWe get it in to the ten, so they steady keep blockin'\nWe roadrunnin' on our ten, steady movin' them racks\nYeah, other than that, let me show you how we rockin'\nOn a brand new yacht with them bottles steady poppin' (Steady poppin')\nStunna told you ain't no love in the streets\nLotta water on my neck, so my chain gotta pee\nEvery rope on my chest cost more than a ki\nI keep fuckin' up my kidneys 'cause my stomach full of lean\nYeah, I hit a nigga with that TEC, he try to take somethin' (Brrt, brrt)\nBlac Youngsta show these niggas how to shake somethin' (Somethin')\nBitch, I'm bringin' out the boat when the flood comin'\nYoung nigga with a whole lotta fuckin' money (Ah, ah, ah)\n\n[Verse 2: Birdman]\nProject hallways, you understand me? (You understand me?)\nBlock party (Block party)\nWe trappin', but a nigga trappin' and thinkin' we slippin'\nBut they trappin', but we rappin', they trappin', but they all just slippin' (Ya heard?)\nPull up with that bullshit like we wasn't with it (Brrt, brrt)\nHit the lil' homie, though (Hit the lil' homie, though)\nYou know? They got hit six, they got you hit three\nThat lil' homie got hit twice\nWe roll for thirty days behind that shit (Ya heard?)\n'Til them pussy niggas went to hidin' (That's somethin')\nYou know?\nSuicide with it\nThen the money went to comin'\nThem big boys pulled up, fuck\nSee how G shit really get\nSnatched up a lot of niggas\nYou know we was on some fuck them boys (Fuck them boys)\nOn some G shit (Some G shit)\nNigga out of line, we gon' cross him (Make money shit)\nSimple, play the mind game, ya heard?\nLike a nigga think it's cool when you heard me (You heard?)\nGot 'em slippin' (Got 'em slippin')\nStreets where it ain't no love, blood\nLearned that the hard way\nStunna\n\n[Chorus: NBA YoungBoy]\nBaby tell me, would you ride for a nigga?\nBaby tell me, would you ride for a nigga? (Would you ride for a nigga?)\nBaby tell me, would you die for a nigga?\nBaby tell me, would you die for a nigga? (Would you die for a nigga?)\nBaby, come and take a ride with a nigga\nCome and see the other side with a nigga (Other side with a nigga)\nBaby, come and pass time with a nigga\nHad to tell 'em I'm a high-class nigga (I'm a high-class nigga)\nAyy, let me tell you, I ain't never had nothin'\nOn the way to that money, I be runnin' (I be runnin', I be skrrt)\nI could show these niggas how to make somethin'\nEvery day, all day, we be stuntin' (All day we be stuntin')\nLivin' wrong, you ain't never seen nothin'\nPromised me you would never say nothin' (You would never say nothin')\nHad to tell baby girl I'm a stunna\nHave you ever rode through town with a gunna? (Let me tell you 'bout it, let me tell you 'bout it, let me tell you 'bout it)"}], "artist": "Birdman"}