{"artist": "Wale", "songs": [{"title": "Double M Genius", "year": "2011-11-01", "lyrics": "[Intro]\nI try to tell them I'm one of the\nBest thinkers of this class I'm in\nI feel like\n\n[Verse 1]\nYeah, I'ma let the chips fall\nNiggas is Kemba Walker tryna see me pitfall\nNiggas Shyne like a synagogue: think about it\nCenterfold bitches prolly couldn't get a drink up out me\nThey say I need some guidance\nBut I think they need a stylist\nBitch you should see my wallet\nThis bitch gonna need Pilates\nAnd you can't see Folarin\nWhat the fuck are you, retarded?\nI ain't hugging the corner, but I hustle so enormous\nA modern day Goodfella, I'm Ray Liotta\nLoud smoking so pass the L like a semicolon\nThe Bentley is rented but I got many chauffers\nFoamposites if you ain't got em then you penny-loafing!\nUnderrated that's temporarily for the moment\nOnly marry your woman if mama cold as Willona\nSee, I'm second to no one\nI'm the messenger-poet\nThey slowly showin' they colors\nThey music good but they bogus\nWale\n\n[Chorus]\nThey talkin'\nTalkin' bout Folarin\n\n[Verse 2]\nVerse 2 gon be fucking with verse 1\nEspecially when you're writing shit that can never be done, Joe!\nThat Kevin Love flow\nBored of the shooters\nMy women be in the newest\nYo bitches should buy a loofah\nWhere I'm from they is ruthless\nBabies turn into shooters\nCrazy talking and foolish\nYou catch a shell like a Koopa\nAnd I don't give a fuck, see my bitches is kama sutra\nOne of them bitches is cute, the rest of them congruent\nWhy you talking my nigga? Just go and do it\nNiggas awful at dressing, they just a'ight at music\nI'm trend-setting, despite of an awful debut\nStill got me another deal big as any nigga in music\nThe remedy is get your hustle on\nFuck a broad unless you love a broad\nWell in that case, brother, then love her hard\nPut my trust in my dog\nPut my trust in my God\n'Less you Stabler and Benson, I don't fuck with the law\n\n[Chorus]\nThey talkin'\nTalkin' bout Folarin", "album": "Ambition", "image": "https://images.genius.com/c8a525cd49b75dfcb54a6a70406c05fb.1000x1000x1.jpg"}]}