{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "Forever Falling", "image": "https://images.rapgenius.com/77fac9cb635136345d2df6c14f88ad3b.1000x1000x1.jpg", "lyrics": "[Verse 1: Professor Green]\nNever needed a hand up, I did it all alone\nWith no dad to make a man of me, I did it on my own\nA victim of condition, now I'm conditioned for the cold\nEven though I know what's missing there's no filling this hole\nEscaping a whole heap of problems\nIsolating instead of facing\nI always attract the women who think that I need saving\nEven though I'm the only person I could put any faith in\nFace it, I'm jaded and happily so\nWhat would I have to hold it if I let all the anarchy go?\nCan't take the praise, I just clam up and choke\nJust know I better deal with hatred and handle it so\n\n[Hook: Haydon]\nMy back's against the wall, there's nowhere else to go\nAnd I can't hear you calling, who's gonna catch me when I fall?\nWho's gonna catch me when I fall?\nAnd I'm forever falling\nWho's gonna catch me when I fall?\n\n[Verse 2: Professor Green]\nSee what I got in this world? That's how come\nI can't sleep without popping a pill now\nFelt it come back up but I'm still down\nJust back to convincing myself that I'm ill now\nSee with me the stress manifests physically, still in me\nIs this fear of happiness and it's killing me\nI can't control it yet I worry about things that are out of my control and I'm folded\nI ain't never letting this introvert out\nIn a lonely home that could have been but isn't our house\nBut I ain't in the mood to have any visitors round\nSo I hide away, my curtains have been drawn so long\nI couldn't tell you if its night or day\nSo how I feel is the only way that I can hide the pain\nPeople try and help but I shy away\nA problem shared is a problem halved\nBut I care for you too much to make this problem ours\nWho knows where this problem starts\nCome on Stephen, get to manning up\nScared ain't something that I'm man enough to be\nOr even you get to be, how am I meant to handle what I'm seeing?\nThey just found my daddy hanging from a tree\n\n[Hook: Haydon]\n\n[Bridge: Haydon]\nTrying to find myself\nI don't know where to go from here\nLosing my strength\nSo save me again\n\n[Hook: Haydon]\n\nSo save me again\n\n[Hook: Haydon]", "year": "2011-12-17"}]}