{"artist": "Iamsu!", "songs": [{"title": "Hipster Girls", "lyrics": "[Verse 1]\nPosting pics on your blog, uh, taking rips of that bong, uh\nBout to move to Los Angeles ‘cause you sick of living at home, uh\nShop at Urban Outfitters, all your other clothes is straight vintage\nTie flannels around yo waist, wearing boots and beanies in the winter\nHit the club with all of yo club homies ‘cause your real friends can't get in\nYou will never wait in no lines, you already text the promoter man\nAnd he thirsty and he wants you, but you use him for his plug\nJust to get close with a nigga with a table, a baller, a rapper, or even sell drugs\n‘Cause you just want the plug and you got that, ‘cause you just want the light and you got that\nAnd maybe if you get a little closer they might really fuck with you, let you ride with the top back\nYou just want love and affection, but that dude's on to the next one\n‘Cause if you ain’t down for the action, you gon get yo ass kicked outcha section\nBut guess what, nigga\n\n[Pre-Hook]\nThis for all of my hipster girls\nOn Instagram straight flexin' (x3)\nI said this for all of my hipster girls\nOn Tumblr straight flexin' (x3)\n\n[Hook]\nSo go girl, do yo thing\nI hope everybody in here know your name\nI said go girl, do yo thing\nI hope everybody in here know your name\n\n[Verse 2]\nCaught up in a hype in the lime light, but tell me what’s gon happen when the hype fade?\nBut I guess you ain’t learned from yo mistakes, he was messing with a senior in the 9th grade\nAspirin' model or actress, to niggas with money, you magnet\nConstantly climbing the ladder, you swear to stay far from the stagnant\nEverybody love a girl with a few goals, you a stripper and a model playing 2 roles\nYou be paying for yo college, but you dancing\nAt the same time saving for a new home\nUh uh, like hella likes hella likes\nInstagram, that’s life, am I right?\nLooking right up in them pictures, never wrong\nWhen you caption always quota from a song\nLike some Drake shit, or some A$AP, or some André 3 Stacks\nYou don’t give a fuck about these girls’ opinions\nYou don’t push these bitches up for they feedback\nYou just stretching for the life and you need that\nGet a car and a crib, where the sea at\nWanna drink, wanna smoke, where the weed at?\nWanna champagne toast you can keep that\nBelieve that, baby\n\n[Pre-Hook]\nThis for all of my hipster girls\nOn Instagram straight flexin'\nOn Instagram straight flexin'\nOn Instagram straight flexin'\nI said this for all of my hipster girls\nOn Tumblr straight flexin'\nOn Tumblr straight flexin'\nOn Tumblr straight flexin'\n\n[Hook]\nSo go girl, do yo thing\nI hope everybody in here know your name\nI said go girl, do yo thing\nI hope everybody in here know your name\n\n[Pre-Hook]\nThis for all of my hipster girls\nOn Instagram straight flexin'\nOn Instagram straight flexin'\nOn Instagram straight flexin'\nI said this for all of my hipster girls\nOn Tumblr straight flexin'\nOn Tumblr straight flexin'\nOn Tumblr straight flexin'", "image": "https://images.genius.com/4f17798f733b204f275cb24133e9d98e.500x500x1.jpg", "album": "Kilt 2", "year": "2013-07-09"}]}