{"artist": "King Los", "songs": [{"image": "https://images.genius.com/a9bc5b4fe746b1be8d76a46edd25590e.500x500x1.jpg", "title": "Bar Mitzvah", "year": "2014-03-24", "album": "Zero Gravity 2", "lyrics": "[Intro]\nYeah... Yo\nZero! Yeah\nI got it though, King Uh!\n\n[Verse 1]\nMy flow is the equivalent to the cinnamon challenge\nYou just cinnamon, a feminine chemical imbalance\nDamn, them is bars if I play it back slow I bet men will pause to check that a chemical imbalance, is Menopause\nConnect that, nobody’s exceptional except me\nBut I don’t expect niggas to accept that\nI monopolize, you ain't been properly learned\nI run circles round squares, that’s property earned\nI’m concerned, ya ho tell me you all fake\nAnd when she bored, we hit the boardwalk to find a park place\nIf you niggas take a chance, ima son you crazy\nCause when you land where I live, it be fuck you pay me\nI spit Bar Mitzvahs, you spit that alright shit\n*what that mean*\nYou wish you had bars like this\nShit, I’m better with rhetoric please bet it\nI’m a monster all these 3-headed, monsters get be-headed\nYa be headed to heaven the head of heaven'll greet ya\nMy heads in heaven I’m preaching\nAppreciate what I’m teaching\nTeachers listen I’m talkin, you listen and talk too often\nI’m teaching you actions louder, coming for what they owe me\nI give a fuck if I’m early you see me I’m after hours\nWhen I say hours you thinking time and progression\nNigga when I say ours, I’m thinking mine and possession\nYa life’s a mind of possession, and I take ya life\nCause I don’t mind a possession\nNigga you a minor, Mind ya business, my business’ll drive ya mind in possession\nI intersect with inception and lose my mind in a session\nYou cross the line with aggression, Ima break you up\nJust like inception, falling off should wake you up\n*Tape Scratches* I still play too rough\nI'm a hop skip and a jump, from poppin\nTuckin a hot, Glock on my hip, then skip to the truck\nMy chick driving, 5-0 said I pulled a OJ\nOh well I keep a bitch in the cut\nIn addition to that, if you bitch you get cut\nI gut you like a fish then fish with ya guts\nYuck!\nThat's nasty lines, illest nigga to do it since Nasty Nas\nListen here nigga , I ain't just appear\nI'm just superior, all my peers disappear\nFuck you clowns mean, coming for my crown get you buried\nBut that don't make you a underground king\nI'm a winner and a stunna\nStuntin' every winter\nWhat the fuck, I'll fuck around and put next summer in a sling\nI break arms on all them, like tree branches that fall in the fall\nYou should leave, you ain't seasoned at all\nYa niggas slow like leaves taking a fall\nI leave you in a bag, like I'm raking the lawn\nI'm bar over bar arm-bar breaking your arm\nDisarming you, then this arm breaking your jaw\nPalming your face, taking your palm the opposite wait\nYou not in my weight, I been waiting too long\nI won't stop till I'm respected\nMy flaws are purposely injected\nTo dwell amongst you humans undetected\nIt's only 1 God, God bless liars jaws\nNiggas hard press, like they ain't know the mess I have caused\nI'm the best by a far, ain't a large debate\nI got fish so big to fry, I'm using Jaws as bait\nWait, I've mastered every element of words\nI heard yours was elephants, well mine is elephants in herds\nWord, these birds couldn't murk me yet\nThey wanna be who I are, but I reverse b s\n\"Get It?\"\nB I R reverse B S, a lowercase b is a d if you reverse it yes\nIt spells birds motherfucker, I got words in check\nOne of you bird motherfuckers say a word, get checked\nI'm more Pesci than Joe Pesci when it come to my De Niro\nI can see no nigga fucking with me...\n\n[Outro]\nZero! Point 2"}]}