{"songs": [{"year": null, "album": "The Dusty Foot Philosopher", "image": "https://images.genius.com/0939cced5a2b8162cd5d38cb17171350.640x640x1.jpg", "title": "What’s Hardcore", "lyrics": "[Verse 1]\nI put a pen to the paper\nThis time as visual as possible\nGuns blast at the hospital\nThe walls are white washed with tin rooftops\nTo show love, you lick two shots\nIt's dangerous man\nJournalists hire gunmen, there's violent women\nKids trust no one cause fire burnt them\nRefugees die in boats, headed for peace\nIs anyone scared of death here? Not in the least\nI walk by the old lady selling coconuts under the tree\nLife is cheap here, but wisdom is free\nThe beach boys hang on the side, leaning with pride\nScam artists and gangsters fiending to fight\nI walk with three kids that can't wait to meet God\nLately, that's Bucktooth, Muhammad and Crybaby\nWhat they do everyday just to eat, Lord have mercy\nStrapped with an AK and they bloodthirsty\n\n[Hook]\nSo what's hardcore?\nReally, are you hardcore? Hmm\n\n[Verse 2]\nWe begin our day by the way of the gun\nRocket propelled grenades blow you away if you front\nWe got no police ambulance or fire fighters\nWe start riots by burning car tires\nThey looting, and everybody start shooting\nBullshit politicians talking about solutions, but it's all talk\nYou can't go half a block without a road block\nYou don't pay at the road block you get your throat shot\nAnd each road block is set up by these gangsters\nAnd different gangsters go by different standards\nFor example, the evening is a no-go\nUnless you wanna wear a bullet like a logo\nIn the day you should never take the alleyway\nThe only thing that validates you is the AK\nThey chew on Jad, it's sorta like coca leafs\nAnd there ain't no police\n\n[Hook]\n\n[Verse 3]\nI'mma spit these verses cause I feel annoyed\nAnd I'm not gonna quit till I fill the void\nIf I rhyme about home and got descriptive\nI'd make 50 Cent look like Limp Bizkit\nIt's true, and don't make me rhyme about you\nI'm from where the kids is addicted to glue\nGet ready, he got a good grip on the machete\nMake rappers say they do it for love like R. Kelly\nIt's hard, harder than Harlem and Compton intertwined\nHarder than harboring Bin Laden and rewind\n(To that earlier part when I was kinda like)\nWe begin our day by the way of the gun\nRocket propelled grenades blow you away if you front\nWe got no police ambulances or fire fighters\nWe start riots by burning car tires\nThey looting, and everybody starts shooting\n\n[Hook]"}], "artist": "K’naan"}