{"artist": "WC", "songs": [{"year": null, "lyrics": "(man)\nHey, nigga, gimme some of them water and chip's, shit\n(other man)\nLock 'em up, nigga, lock 'em, bullshit\n(man)\nHey, look, nigga\nGet out there, nigga\nThese niggas ain't so briz-ight, right\nWe gon' get in and get out\n(other man)\nWe on a roll, nigga\n[Continues, indistinct]\n\n[Verse 1: WC]\nI'm a walkin dead man\nFuckin' wit deez out-a-town niggas\nGot me watchin' up on my back and strappin'\nPistol packin'\nWho ever thought dem fools would catch on\nAnd we was sellin' rock while up in the back of the broll\nSee da plan was to make a transaction to match\nThree calos, four hundred a zone, a hundred thousand cash\nYou know da deal, nigga you know da outcome\nDub C and C Mac take tha money 'n run\n\n[CJ Mac]\nWe gettin' close, hot as fuck\nBurnin' up in his drive\nTwo pace, mirror checkin' doin' sixty-five\nI seen the state patrol 5 times, swear to god\nHe make this stop, better have 9 lives\nNigga beepin\n\n[Man's Voice]\nWhere you at?\n\n[CJ Mac]\nClose nigga\nYou just have tha cash right so we can ghost, nigga\nI never tell no\nNigga when I'm comin' through his town\nSet us up, get a crew, gun us down\n\n[WC]\nFuck that, I dun dis shit befo'\nAfter we twist deez niggas, we gon twist some mo'\n\n(CJ Mac)\nOut-a-town nigga havin' a pistal in hand\nWhatcha paper, you fuckin' wit some jackers, player\nShit happens\n\n[Hook: CJ Mac]\nDon't fuck wit a niggas cash\nNiggas blast, when it come to cash\nNiggas mash, on dat ass\nDon't fuck wit a niggas cash\nNiggas mash, on dat ass\nFo' a niggas cash, niggas blast\n\n[WC second half overlaps]\n(T'is da season to be jackin falalalala lalalala)\n\n[Verse 2: CJ Mac]\nMade the exchange, it's strange, they ain't even check\nSwitched the suitcase and jet\nWe ain't stop to count da cash neither\nShit, nigga, I'mma leave it\nCause two a dem gas cans, was fulla straight ether\n\n[WC]\nFake twista, took her ass back to da piz-ad\nSent some mo crystals back to da liz-ab\nTo make some mo trick-climbin'-blatant-nigga loot [wooh!]\nCuz baby need new shoes and daddy need a coupe\n\n[CJ Mac]\nCall my nigga, Fred, yo friend\nHe set up da lick\nGave his ass ten-thousand, thanked him n' shit\nTold him 'Shut the fuck up', niggas try to sweat him\nAnd not to take his ass out there, they bound to wet him\n\n[WC]\nUh huh, two months passed, I found his ass trashed out\nCastrated on his porch, with his dick in his mouth\nWhat the fuck? I know these niggas ain't here in L.A\nI went and grabbed the AK n' called my nigga CJ\n\n{[music stops, dial tone] inside ( )= CJ Mac}\n(What's crackin'?) Look it's on wit deez niggas (what?)\nHey CJ nigga I just found this nigga Fred fucked up\n(slow down, nigga) on the porch (Fred?)\nHey nigga it's goin' down\nHey nigga meet me at cho bitch spot, nigga (what?)\nFuck that, let's bring these in hea\nFuck these niggas!\n\n[Hook x2]\n\n[Verse 3: CJ Mac]\nGoin' 110 on da 110, exit slow\nShit my stomach uptight, sumthin' ain't right (fuck that)\nHow da fuck they found where Fred stay\nThey ain't never been out there, aw Dub, what the fuck?!\n\n[WC]\nCJ, don't trip, nigga, dey just killed yo bitch\nLeft her bleedin' in the porch wit' screwdriver's in her head\nRansacked the house, took the work and the money\n\n[CJ Mac]\nI could see that shit, but why the fuck you so bloody?\n\n[WC]\nThey took the hundred thousand we stole plus two mo' (right, right)\nAnd if I know that nigga Bo he checked a in mo {motel}\n\n[CJ Mac]\nBo, aw nigga, what part of the game\nYou didn't know that motherfuckas name!\nFirst you found Fred dead, then you found my bitch wit her wig split\nNigga I ain't stupid, you did that shit\n\n[Gunshot]\nMotherfucka shot me in my shoulda\nReaches for my strap, and started dumpin' back\n{gunshots continue}\n\n[WC]\nNigga, life's a bitch and then you die\nYou only get one chance to check figures, trust no nigga\nShoulda known from the start, ain't no love in my heart\nFuck this 50-50 shit, this is where we depart\n\n[CJ Mac]\nI'll be damned if I let this nigga walk wit' da dough\nKill my homeboy, kill my ho?\nFire fo' rounds, hit him twice, hit him in his stomach\nSee me vomit blood\nNigga eat slugs!\n{gunshots continue}\n\n[WC]\nOn my knees, I'mma see da bust back, fuck that\nSomehow I managed, ta raise wit da wicked carriage\nAin't no rules to dis shit, we jackers\nAin't no love in this game, mothafucka, shit happens\n\n[Hook x2]\n\nI feel sorry, nigga\nJust like every dog has his day\nEvery loc get his nights\nI'll be back at ya, my nigga (ain't no thang)\nI can't believe yo ass did some shit like that to me, nigga\nIt ain't nothin' (hu, hu)\nIt ain't nothin'\nIt's goin' down\nI'mma get that motherfucker\nIt's on!", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "The Shadiest One"}]}