{"songs": [{"year": "2014-10-15", "image": "https://images.genius.com/3b3104658adae3c195e20d5e868f7735.600x600x1.jpg", "title": "Scum", "album": "If There’s A Hell Below", "lyrics": "[Verse 1: Black Milk]\nRandom, random, push till they fall back\nGrabbing the ball back, while I’m grabbin’ the hard hat\nHard act to follow, we the hard pill to swallow\nYou cotton that sit in an aspirin bottle\nRandom Axe smash the throttle, grew up where’s ice cold\nWhere niggas gamble with their life like a dice bowl\nThis ain’t a light show, but you see them red blues\nFlashin’ on the tittie screen, Channel 7 news\nWhere those lil dudes reach for rugers\nNever surf the internet, never own computers\nYou know the name, don’t know the face, then he the mover\nWhoever’s quietest in the room, then he the shooter\nThe old heads don’t understand, askin’ how come?\nWe don’t think like Martin, Malcolm was the outcome\nAny means nece-ssary yeah, where I’m from\nWhile I had pops, most grew up without one\nAll they had was drugs, where the street wars met\nWalkin’ out everyday, with the Devil on yo doorstep\nSittin’ on your porch in the post\nThis the city limit, where you see they have no remorse at\n\n[Hook]\nIt’s gone, gone, outta the slum\nBang bang put it in the air\nBang bang, feel it over here, over there\nBang bang, don’t nobody care what you had\n\n[Bridge]\nMeanwhile, we find Sean P on the toilet rolling a spliff\nFuck is on his mind?\n\n[Verse 2: Sean P]\nFour fifth for your face\nAnd yo faculty fuck boys, forfeit in your face\nShittin’, watchin’, you sittin’ on grapes\nPre-payed, premeditated and murdered the aim, P!\nAchin’ yo kimfolks, a.k.a. the ape in the window\nA trafficking ?\nA Budweiser African king poster\nI’m doin’ my damn thing\nThem niggas claim king but ain’t doin’ a damn thing\nThat’s my word to my moms\nI neva heard no one of ya songs: “Fuck outta here!”\nAnd I don’t dislike you\nI disliked the dude that said I disliked you\nLong kiss, long fist, bitch, goodbye\nCan’t fuck with P, new fish to fry, P!\n\n[Interlude]\nTime like here, I wasn’t playing\nThis not for declaration, ?\nIf they ain’t there with me, they gotta come right\nThe got ? something\n\n[Verse 3: Guilty Simpson]\nOnce again, it’s Mr. I-Am-Not-Yo-Friend\nFrom the city where it’s commonly a tragic end\nThey mad again, squeezin’ what they hold to leave a hole in you\nHalf ass niggas are half again\nMashin’ it, American shit, keep yo foreign cars\nThey still like they war and odds\nThey got help waitin’\nTwo pretty heaters, they named ‘em both: Dropper-Dead-Gorgeous and Breath-Takin’\nYou’d rather check Satan, inhale while he inhales powder\nSoftwhite, they put it down in the lab like Walt White\nSoft fights is what they give em\nTalkin’ workin’ on their off nights\nThe bar’s tight, they sendin’ nears off on sight, overnight\nThe fairput cats on your overbite\nSweetcats, I know your life\nBurbon cats, I know your wife\nPoet night, shake a house, no Poltergeist\nTakin’ flicks and yo stolen nights, the clip’s rollin’ right\nPaper chasin’ with this door in sight\nTakin’ ten kingpins out, they ballin’ stripes\nShow you right where they buried, right and they smoked his pipe\nIt’s medicin through a cobra’s bite\nI hold the mic with the real concern in the facts\nWait no more, return to the acts\nReturn fire\n…\nEarn a writer when I burn a squire\nSelf employed, the murder higher"}], "artist": "Black Milk"}