{"songs": [{"year": "2007-09-11", "album": "Graduation", "image": "https://images.genius.com/680d4985b1fccdf554ab887abb63a453.1000x1000x1.jpg", "title": "Champion", "lyrics": "[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Chorus]\nYes I did\nSo I packed it up and brought it back to the crib\nJust a little something, show you how we live\nEverybody want it but it ain't that serious\nMhm, that's that shit\nSo if you gon' do it, do it just like this\n\n[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Verse 1]\nYou don't see just how wild the crowd is\nYou don't see just how fly my style is\nI don't see why I need a stylist\nWhen I shop so much I can speak Italian\nI don't know, I just want it better for my kids\nAnd I ain't sayin' we was from the projects\nBut every time I wanted layaway or a deposit\nMy dad'd say \"when you see clothes, close your eyelids\"\nWe was sort of like Will Smith and his son\nIn the movie, I ain't talkin' 'bout the rich ones\nCause every summer, he'd get some\nBrand new harebrained scheme to get rich from\nAnd I don't know what he did for dough\nBut he'd send me back to school with a new wardrobe\n\n[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Chorus]\nI think he did\nWhen he packed it up and brought it back to the crib\nJust a little somethin', show you how we live\nEverything I wanted, man it seem so serious\nMhm, that's that shit\nSo if you gon' do it, do it just like this\n\n[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Verse 2]\nWhen it feel like living's harder than dyin'\nFor me givin' up's way harder than tryin'\nLauryn Hill said her heart was in Zion\nI wish her heart still was in rhymin'\n'Cause who the kids gon' listen to, huh?\nI guess me if it isn't you\nLast week I paid a visit to the institute\nThey got the dropout keepin' kids in the school\nI guess I cleaned up my act like Prince'd do\nIf not for pleasure, then at least for the principle\nThey got the CD, they got to see me\nDrop gems like I dropped out of PE\nThey used to feel invisible\nNow they know they invincible\n\n[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Bridge]\nThis is the story of a champion\nRunners on their mark and they pop their guns\nStand up stand up here he comes\nTell me what it takes to be number one\nTell me what it takes to be number one\nThis is the story of a champion\nRunners on their mark and they pop their guns\nStand up stand up here he comes\nTell me what it takes to be number one\nTell me what it takes to be number one\n\n[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Chorus]\nYes I did\nSo I packed it up and brought it back to the crib\nJust a little somethin', show you how we live\nEverybody want it, but it ain't that serious\nMhm, that's that shit\nSo if you gon' do it, do it just like this... like this\n\n[Refrain]\nDid you realize\nThat you were a champion in their eyes?\n\n[Produced by Kanye West and Brian Miller]"}], "artist": "Kanye West"}