{"artist": "Andy Mineo", "songs": [{"title": "Family Photo", "album": "I: The Arrow - EP", "year": "2018-04-27", "image": "https://images.genius.com/447187080659ba51155b0c4ea2256eea.720x720x1.jpg", "lyrics": "[Intro]\nWe're gonna dedicate this next song to my father, Joe Mineo, the legend\n\n[Verse 1]\nLook, August 23rd, how could I forget it?\nGetting ready in my suite, it's the morning of my wedding\nInvited all my legends, man, it's set to be epic\nAnd then I got that message, I was dreading\nMy momma said it, “Andy I don't think your father gon' come”\nI just laugh, said “Oh well”, and tried to be numb\nI learned to stop getting hopes up\nAs a kid, growing up, that made the letdown easier when he didn't show up\nBut, deep down I had this flicker of hope\nThis one time he pull it together, make a effort, but nope\nI'm standing at the altar, he nowhere in sight\nHow I'm thinking about him now instead of my wife?\nBest man, Ray, to my right said, “You'll be alright\nAt least you know you're gonna be smashing tonight”\nThen the doors open in the back, wearing all white\nThis the first day of the rest of our life\nHer father by her side while she came down the aisle\nShe's was looking all wow, then we exchanged vows\nLong-winded self, should've passed me a towel\nWe both said “I do”, we team Mineo now\n\n[Chorus]\nSo, everyone, everyone smile for the family photo\nBut everyone, everyone ain't really in the picture\nSo, everyone, everyone smile for the family photo\nBut everyone, everyone ain't really in the picture\n\n[Verse 2]\nNow the ceremony's done, I know it sound dumb\nBut I thought he might come 'cause the night was still young\nI could've filled his space, it's like a hunnid a plate\nI kept two just in case prayin' he'd show up late\nThen I wait...\nAnd I wait\nI looked Cris in the face and told her nothing's gonna ruin our day\nI hate the fact I still love you\nI wish that I could turn you off, take the cord to my heart and just unplug you\nDamn, man, you my dad, what I did to ya?\nTo make you not love me, mean what I should to ya?\nLook, I don't understand, I'd jump off a bridge\nI'd take a bullet to the rib before I'd hurt my kid\nYou know that Mark told me something I won't never forget\nSounded just like you, that's why I know it's legit\nHe said, “You go to Andy's football games, but not lacrosse\nWhy? “You told him you don't like that sport\nWell, do you like me? It's sad I gotta ask\nYou either cry or you try to learn to laugh\nLook, I figured I'd be past all this hurt by now\nBut after all this time it's only worse right now\n'Cause when you bury emotions, you bury them alive\nThey only come back stronger, somewhere later in your life\nAnd on the honeymoon, I got your text, but I ain't reply\nSaid “Congratulations” like, what a guy\nI ain't ask you to be perfect, man, that's only God\nI just wish you would have tried\n\n[Chorus]\nSo, everyone, everyone smile for the family photo\nBut everyone, everyone ain't really in the picture\nSo, everyone, everyone smile for the family photo\nBut everyone, everyone ain't really in the picture\n\n[Outro]\nGod, grant me the serenity\nTo accept the things that I cannot change\nCourage to change the things that I can\nAnd the wisdom to know the difference\nLiving one day at a time\nEnjoying one moment at a time\nAccepting hardships as the pathway to peace\nTaking, as Jesus did, this sinful world as it is\nNot as I would have it\nBut trusting that You will make all things right\nIf I surrender to Your Will\nSo that I may be reasonably happy in this life\nAnd supremely happy with You forever in the next\nAmen\nAmen, Amen\nAmen"}]}