{"artist": "Plies", "songs": [{"album": null, "title": "Big Ole Freak", "image": "https://images.genius.com/142f4d6c2e6ce44c7607f441746bff25.1000x1000x1.jpg", "lyrics": "[Intro]\nTell me...\nLilJuMadeDisBeat!\nTell me, is it love, is it love again? Oo-ooh\n\n[Verse 1 Plies]\n\nPlies way\nLet’s get it\nI’m the type of nigga that like phone sex, put that pussy on the phone make it talk\nGot a arch in ya back got my thumb in ya butt, cheeks spread put that pussy in my mouth\nYou gon suck this dick, you gotta wet this dick\nGot a dry mouth imma put you off\nCan’t waste this nutt, gotta catch this nutt, emm hmm, I don’t put off\nRub on this dick while I’m driving, baby\nKiss me in the mouth while you ridin’ me, baby\nTell me when you cumin’ don’t lie to me, baby\nWhen you play with that pussy that’s hi to me, baby\nOne word to describe how you taste, sweet\nOne word to describe that ass, peach\nYou say, you see a big ole freak\nI say, I say I’ma big ole skeet\nSuck on that pussy with your panties on, run red lights when your period on\nHand on your throat, hold you legs in the air\nHold your pussy open so I can put the head in there\nSlow stroke, slow stroke I’ma kill ya ass with the slow stroke\nSoon as a nigga start beating in the pussy I’ma have ya ass hittin’ high notes\nAnytime you around me, baby, no panties\nDick standing straight up right now that’s Henny\nPussy be leaking like a faucet, drippin’\nI’m tryna hit cha, put the rode in ya kidney\nI’m tryna fuck you on the beach, Miami\nMake love to ya while I’m rollin’ on a Xanax\nLet me grab yo thong and pull it to the side and watch that fat pussy fall out cha panties\n\n[Verse 1]\nAy, big ole freak, big booty, big ole treat\nI'ma make him wait for the pussy\nHit it, then he big ole skeet (Baow, baow, baow)\nFeet on the bed, I'll fuck him up in the head\nSuck it, then look in his eyes\nThen, the next day, I might leave him on read (Mwah)\nPop it, pop it, daydreaming 'bout how I rock it\nHe hit my phone with a horse\u2028So I know that mean come over and ride it\nShid, I'm on the way, ride on that dick, I'm like 'Ye (Hey!)\nUsually I like to fuck\nBut tonight, we gone make love cause you bae\nNobody know, I fuck with him on the low\nWe never show up together\nBut I text him when I'm ready to go\nAy, I had a couple of shots at the bar\nI'm finna play with that dick in the car\nI got him swervin' and breakin' the law\nThese windows tinted so nobody saw\n\n\n[Bridge]\nAin't nobody freak like me (Huh)\nGive ya what you need like me (Huh)\nAin't nobody got up on they tip-tip toes\nThen rode to the tip like me (Huh)\nI got him addicted, he fiendin'\nMy body a drug and he need it\nHe beggin' me for the treatment\nHe throw a fit when I leave him\n\n[Chorus]\nHe like \"baby, lemme rub, lemme rub on ya\nCan I get a lil love, lil love from ya?\"\nMy body addictive, it's driving him crazy\nI think I gotta run from him\nDon't know what to do without it\nHe fuckin' with you? I doubt it\nThey don't understand that I'm all in his head\nAnd there's nothin' to do about it\n\n[Hook]\nYou been fiendin' for me lately, going brazy, brazy\nI got what you need, I'm gon' give it to you, baby\nGoin' brazy, brazy, fiendin' for me lately\nI got what you need, I'ma give you what you craving\n\n\n[Verse 2]\nSee, I'm a big ole freak, I love to talk my shit\nAnd you must be a pussy, boy, if you get offended\nBitch it's Tina Snow, they love me 'cause I'm cold\nAnd you can't take no nigga from me, I got mind control\nI wanna fuck in the mirror\nI like to look at your face when you in it\nCome in the room and I'm givin' commands\u2028I am the captain and he the lieutenant\nI need that neck like a muhfuckin pendant\nNeed you to spit, make that muhfucka glisten\nTell him \"Shut up!\" make that muhfucka listen\nI bet he gon' like it, he won't do no trippin'\n\n[Bridge]\nAin't nobody freak like me (Hell nah)\nGive ya what you need like me (Hell nah)\nAin't nobody got up on they tip-tip toes\nThen rode to the tip like me (Huh)\nI got him addicted, he feenin'\nMy body a drug and he need it\nHe beggin' me for the treatment\nHe throw a fit when I leave him (Aah)\n\n[Chorus]\n\"Baby, lemme rub, lemme rub on ya\nCan I get a lil love, lil love from ya?\"\nMy body addictive, it's driving him crazy\nI think I gotta run from him\nDon't know what to do without it\nHe fuckin' with you? I doubt it\nThey don't understand that I'm all in his head\nAnd there's nothin' to do about it\n\n\n[Hook]\nYou been fiendin' for me lately, going brazy, brazy\nI got what you need, I'm gon' give it to you, baby\nGoin' brazy, brazy (Ooh, ooh)\nFiendin' for me lately (Ooh, ooh, ooh-ooh)\nI got what you need, I'ma give you what you craving\n\n[Outro]\nTell me, is it love, is it love again? Oo-ooh", "year": "2019-05-01"}]}