{"songs": [{"year": "2018-10-30", "image": "https://images.genius.com/2e8a0f1744195c85ce77fff6503f4010.1000x1000x1.jpg", "title": "Bloc", "album": "Don’t Think That", "lyrics": "[Intro]\nHey, hm, hey\nNext year I wanna make sure y'all play the whole\nI don't know how—know how many songs on this motherfucker, man\nBut I'm just sayin', look\n\nHm (Yeah), don't fuckin' think (Yeah, yeah)\nWhat the hell (Yeah), y'all niggas always doin' that shit, nigga (yeah, yeah)\nThink I just motherfuckin' this (Yeah), mm-mm-mm mm-mm mm-mm-mm (I'm that nigga, bitch)\nYou know what the fuck goin' on (I'm that nigga, ho)\nHah, hah (Yeah)\n\n[Chorus]\nWho is that fresh in that designer? Bloc (Huh?)\nHeard he got work, wanna find a block (Word)\nWhole team eatin' like a diner, Bloc (Word)\nThat nigga got bars, wanna sign him, Bloc (Word)\nNigga can't see me, I'll blind him, Bloc (Blind him)\nThat nigga sneak dissin', who gon' find him? Bloc (Find him)\nWho got that bitch from China? Bloc (Yeah)\nBitch, I'm on point like some liners, Bloc (Word)\n\n[Verse]\nBitch, I will never tell, chopper tell-tell a tale\nWe load them Dracos and put 'em to sleep\nShots in your stomach, bitch, how you gon' eat? (Word)\nI'm gettin' head while I'm brushin' my teeth\nWalk in this bitch like my name Mr. T (Yeah)\nI'm with the shits like I'm 30 deep (Huh)\n.30 on me, ain't no murkin' me (Rrrah)\nCan't save these hoes, got no church in me (Doon-doon-doon)\nBitch, I got stacks on deck\nBands, I put that shit to my neck\nSand, I'm kickin' shit with your bitch (Flex)\nYou talk it, I know with that .22 TEC (Bow)\nW-What you gon' do with it? Who gon' shoot with it?\nIs it one in the head? Is you gon' act a fool with it? (Huh?)\nThese niggas crazy, they crazy, they ludicrous (Word)\nI pull up this 30 P like I'm Ludacris (Rrrah)\n\n[Chorus]\nWho is that fresh in that designer? Bloc (Huh?)\nHeard he got work, wanna find a block (Word)\nWhole team eatin' like a diner, Bloc (Word)\nThat nigga got bars, wanna sign him, Bloc (Word)\nNigga can't see me, I'll blind him, Bloc (Blind him)\nThat nigga sneak dissin', who gon' find him? Bloc (Find him)\nWho got that bitch from China? Bloc (Yeah)\nBitch, I'm on point like some liners, Bloc (Word)\nWho is that fresh in that designer? Bloc (Huh?)\nHeard he got work, wanna find a block (Word)\nWhole team eatin' like a diner, Bloc (Word)\nThat nigga got bars, wanna sign him, Bloc (Word)\nNigga can't see me, I'll blind him, Bloc (Blind him)\nThat nigga sneak dissin', who gon' find him? Bloc (Find him)\nWho got that bitch from China? Bloc (Yeah)\nBitch, I'm on point like some liners, Bloc (Word)\n\n[Outro]\nBloc, Bloc\nBloc, Bloc..."}], "artist": "BlocBoy JB"}