{"artist": "Pras", "songs": [{"album": "Win Lose or Draw", "title": "Ghetto Politics - 37656", "image": "https://images.genius.com/e86c37e94a9221052cd1f57601afc795.500x500x1.jpg", "lyrics": "[Hook: Pras Michel]\nPine, boxes, nine, oxes\nUnidentified, flying objects\nCrime, doctors, slime, coppers\nNiggas that can't get out man they locked up\n\n[Pras Michel]\nCriminal, minded, you've been blinded\nJustice for all (c'mon) help me find it\nPlease we'll wind it, get in the hole\nAnd start to grind it, who's behind it\nBig brother got us spread like an atlas\nPowerless in fear that leads to paralysis\nNow when I speak, do your psycho-nalysis\nAnd those recordin Wonderland like Alice's\nY'all don't know about guerilla warfare\nKids in Haiti, trapped with the hardware\nWear them by the pair while playin truth or dare\nPrisoners of war worse than the terror scare\nThis is the jungle we live in, this is the concrete\nI call you pussy cause you are what you eat, homey\nIt's the art of war homes they play for keeps\nSo you still think that gangster shit is sweet?\n\n[Hook] - repeat 2X\n\n[Uncredited guest rapper]\nRemember when you had a lot, yeah it was yours for sure\nBut we fight back, and ain't takin your shit no more\nSo raw, my four-four's leave a couple bent\nThe government talk shit, hand 'em a Doublemint\nYou fuckin with me? I see you like a jewel\nWith the terrorist my nigga, diesel like the fuel\nStep up smash your team, throw matches at your head\nQuarters after we bathe it in gasoline\nOr petroleum, you think it's sugar when it's sodium\nHandcuffs ropes and chains holdin 'em\nAll in the zone, have your dough and your fame\nBut you ain't takin nuttin wit'cha, but your bones to your grave\nTo the world you're a slave, we the makers\nRevolutionary haters, as anthropologists, gynecologysts\nAstronauts and shit, I don't think y'all ready\nFor the apocalypse, so y'all better stay on top of shit\n\n[Hook] - repeat 2X\n\n[Uncredited guest #2]\nMy flow contradicted, apocalyptic\nWith plans to cop the riches, make blacks stop the snitchin\nPolitics mixed with, new statistics\nFuturistic, tell me are you a witness\nOr a soldier? Innocent, criminal minded\nI'm militant, wise to ignorant, livin with\nNo time to eat and no time to sleep, my hustle is deep\nWearin the same gear all week\nNear all heat, until I draw, it's kind of raw\nLike a war between my ances-tors and dinosaurs\nI'm on some fuck the cops shit, ask your moms\nShe don't even know, what this {?} tax is on\nProbably got another country never shown on map\nFor secret agents and the ones who faked they death live at\nWhere your kids disappear to when they get kidnapped\nStreets is white, life is black, and this shit is trapped\n\n[Hook]\n\n{*beatboxing*}\nY'all been rockin fatigues for years right?\nY'all ready to war?!\n\n[Hook]\n\n[Pras Michel]\nAlright, where you at my niggas? You in the Matrix?\nGet the fuck off the streets, y'knahmsayin?\nFuck all that gangster shit, we here\nIt's real niggas, put on your boots, man up!\nGet ready for war, ha, guerillas baby, {?}", "year": null}]}