{"songs": [{"year": "2012-10-22", "album": "good kid, m.A.A.d city (Deluxe Version)", "image": "https://images.rapgenius.com/by8dnoiat5fe4tp8eugoagwpv.300x300x1.jpg", "title": "Black Boy Fly", "lyrics": "[Produced by Rahki & Dawaun Parker]\n\n[Intro]\nSo I'm saying, \"What up? What up? Nigga, you made it\"\nSo I'm saying, \"What up? What up? Nigga, you made it\"\nSo I'm saying, \"What up? What up? Nigga, you made it\"\nSo I'm saying, \"What up? What up? Nigga, I hate it\"\nSo I'm saying, \"What up? What up? Nigga, I hate it\"\nFrustrated and I'm riding down them back streets\nMaking my conscience ask me\n\"Will I survive to make it up out this hole in time?\"\nBlack boy fly, black boy fly\nBlack, black boy fly, black boy fly\n\n[Verse 1]\nI used to be jealous of Arron Afflalo\nI used to be jealous of Arron Afflalo\nHe was the one to follow\nHe was the only leader foreseeing brighter tomorrows\nHe would live in the gym, we was living in sorrow\nTotal envy of him, he made his dream become a reality\nActually making it possible to swim\nHis way up outta Compton with further more to accomplish\nGraduate with honors, a sponsor of basketball scholars\nIt's 2004 and I'm watching him score thirty\nRemember vividly how them victory points had hurt me\n'Cause every basket was a reaction or a reminder\nThat we was just moving backwards\nThe bungalow where you find us\nThe art of us ditching classes, heading nowhere fast\nStick my head inside the study hall, he focused on math\nDetermination ambition, plus dedication and wisdom\nQualities he was given was the shit we didn't have\nDug inside of his book bag and Coach Palmer asked for his finals\nHe had his back like a spinal, meanwhile\nWe singing the same old song spinning the vinyl\nEleven graders gone wrong\nHe focused on the NBA, we focused on some Patron\nNow watch that black boy fly\n\n[Hook]\nBlack boy fly, watch that black boy fly\nBlack boy fly, watch that black boy fly\nBlack boy fly, watch that black boy fly\nBlack boy...\n\n[Verse 2]\nI used to be jealous of Jayceon\nI used to be jealous of Jayceon Taylor when I was young\nTaylor made a career out of music from writing songs\nA Buick had driven past bumping him when I mowed the lawn\nMoney laundering hustling, homies pondering up against\nSchemes to make a million even if doing you harm\nWar's the case and just in case you wasn't alarmed\nThe city had fought with firearms and many had died before dawn\nIt's 2004 and I'm hearing the people roar\nFor the name of The Game, they line in front of the store\nSwap meets, selling our mixtapes, I'm like, \"Oh shit, wait\"\nDon't wanna be another nigga stuck regretting mistakes\nMixed feelings was my opinion, I was defending my insecurities\nChillin' my conscience next to a villain\nCompton made you believe success wasn't real\nBe honest, none of us knew of a record deal\nSo as I peel through these lottery tickets\nI see a Harley Davidson truck visit the same plaza we shopped\nA tall nigga hopped out with Jordans and a white tank top\nHe was top of the rap game, we was the top of the block\nSo watch that black boy fly\n\n[Hook]\nBlack boy fly, watch that black boy fly\nBlack boy fly, watch that black boy fly\nBlack boy fly, watch that black boy fly\nBlack boy...\n\n[Verse 3]\nMy mama didn't raise me up to be jealous-hearted\nLike most of the winners call it\nRegardless of where you stay, hold your head and continue marching\nThat's what she said, but in my head I wanted to be like Jordan\nAward touring the country with money from mic recording\nThe only way out the ghetto, you know the stereotype\nShooting hoops or live on the stereo like Top 40\nAnd shortly, I got discouraged\nLike every time I walked to the corner, had them guns bursting\nNigga, I was rehearsing in repetition the phrase\nThat only one in a million will ever see better days\nEspecially when the crime waves was bigger than tsunamis\nBreak your boogie boards to pieces, you just a typical homie\nAll these niggas facetious and they all standing beside me\nThey all'll buy me a chopper if any one of you try me\nWhat am I to do when every neighborhood is an obstacle?\nWhen two niggas making it out had never sounded logical?\nThree niggas making it out? That's mission impossible\nSo I never believed the type of performance that I could do\nI wasn't jealous cause of the talents they got\nI was terrified they'd be the last black boys to fly out of Compton\nThank God...\n(Black boy fly, watch that black boy fly)"}], "artist": "Kendrick Lamar"}