{"songs": [{"year": "2005-09-13", "image": "https://images.genius.com/8f42b22ec5549467826fbd0c750ab571.450x450x1.jpg", "title": "Bang ’Em Down", "album": "Who’s Hard: Gang Starr Presents Big Shug", "lyrics": "{*\"Boom bang 'em on down\" - Jeru the Damaja*}\n{*\"Boom bang 'em... boom bang 'em on down\"*}\n{*\"There's no cure..\"*}\n{*\"Boom bang 'em on down\"*}\n{*\"Boom bang 'em... boom bang 'em on down\"*}\n{*\"Boom bang 'em...\"*}\n\n[Big Shug]\nPuff thai, I got to elevate the mind\nCome with the rough rhymes, each and every time\nThe lyrical's tight, and so is my game\nI came to hang 'em high, and some might get maimed\nDangerous, not the one to trust\nItchy be my trigger finger if I have to I bust\nOr touch, any MC who got the nerve\nTo step to Big Shug and get served, my word\nYou wanna know what I'm about?\nCome a little closer, and I'll knock your fuckin choppers out\nAnd I'll be laughin at your toothless ass\nWhen your man run up, he catch a Heineken bottle blast\nI'll be the one to take 'em down\nNiggas be tryin to play but now Shug's in town\nAnd I gots to crush 'em down\nLimb by limb, cause I'm runnin my game again\nNow I'm here... to rule again\nKickin faces in like a soccer hooligan\nAnd I'm choppin cats down that are weak in the rap game\nAfter I'm finished, the punks think I'm insane\nNo time to clown around\nLike Green Bay we +Pack+, when we come to bang 'em down\n\n{*\"Boom, bang 'em, on down\"*}\n\n[Big Shug]\nI slap up punks with a vengeance\nI got hardcore rhymes, in each and every sentence\nI mentioned, I like to box or go fencin\nI'ma do you in punk, I got to pay my rent son\nAnd I'll be crashin down on chumps\nAnd in my left kick I might have the bag of skunk\nCause niggas be cryin in this game too much\nSo it's time for Big Shug, to fuck 'em up\nStuck 'em up, for they cash and respect\nNow they lay motionless, with a broken neck\nPut punks in check, Shug's on the set\nWho'll be the next MC to wanna flex?\nI'll leave you roughed up like bedsheets after sex\nSo if you comin kid, you best come correct\nI attack yo when I'm low on dough\nBut I get paid nicely to rock fly shows\nGoes to show, there's life for dope pros\nIf Shug don't see ya, you get the elbow\nOr hear the tormenting sound\nOf wack MC, getting smashed to the ground\nI bang 'em down\n\n{*\"There's no cure..\"*}\n{*\"Boom bang 'em on down\"*}\n{*\"Boom bang 'em... boom bang 'em on down\"*}\n{*\"Boom bang 'em... boom bang 'em on down\"*}\n{*\"There's no cure..\"*}\n\n[Big Shug singing]\nYou're a mean one, you fuckin punk\nYou only talk shit when you're drunk\nYou think that you are bigger, when you drink that fuckin liquor\nYou fuckin puuuuuuuuuunk, I'll beat your assssssssss!"}], "artist": "Big Shug"}