{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/keith-murray-e1302009751237.jpg", "title": "Pay Per View", "lyrics": "* sample repeats in background from Redman's \"Cosmic Slop\" (4X)\n--] Attention passenger's we're on a non-central journey\nTo Hell and beyond\n\n[Erick Sermon]\nHahaha\nGood evening all you blunt smokers\nWelcome to the Darksides of Def Squad\nWhere you bout to hear the voices of Passione\nLBM, Kel Vicious, Keith Murray\nTakin you to the Legion of Dume, and beyond\nThis is a Pay Per View event\nSome shit you wanna hear, yaknahmsayin?\nLet's get ready to rumble, yeah..\n\n[LBM]\nWhen my, Funk's mastered like Flex\nI touch more earsets than Nynex\nLBM puts words together like Triple Yahtzee\nPerformin open heart surgeries with a hand-grip shottie\nMy creepy wisdom mixed with leaky ism splits em\nAnd attacks the rhythm like an exorcism\nBlood leaks out my ink pen, I start killin\nStinkin, bitches like ??Joe Rifkind??\n(Rifkind.. Rifkind..) YAHH!!\nI strangle angels from a Brooklyn angle\nRectangular mangle (and TANGO) incur single\n\n[E. Sermon sings like Method Man]\nP-A-S-S-I-O-N\n\n[Passion]\nAs the world goes around, I'm breakin down competitors\nLike the predator, niggas check my metaphors\n(yea, word up) Let the bullshit, ride, put the clip inside the steel\nWhen the verbal starts to peel, motherfuckers know the deal (YEAH)\nLike AC/DC (word?) I'm charged off the energy\nThe cipher is my soul psych the soul is my serenity (word up)\nTime and time again I grip the pen with a vengeance\nDisruption of your cypher niggas label me a menace\nThe villain, I'm feelin, another, lyrical combustion\nEruptin, bustin out my brain (whoo!)\nSo ignite the flame it's the lyrically insane\nI, open up the vault searchin for the buried treasure\nWith ?? in the brain, increase the measures do whatever\n\n[Keith Murray]\nWhatever.. NIGGAZ!  K-Keith Mu..\nKeith what?  Y'all niggas don't want it, I get widdit\nQuicker, than a nigga with a piss-bag done shitted\nNiggas, be like, quit it\nCause my renditions be expeditions\nFor niggas on them straight looney missions (nigga)\nFunk Lord Productions be sayin somethin (word)\nFor niggas in the street who wanna fight\nAnd press charges, I got somethin (bitch)\nThrow that, you could get the bozack\nCause I leave homicide mummified and all you hoes know that\n\n[Erick Sermon]\nRight about now, it's Kelly Kel\nKel Vicious, bout to get.. ill\n\n[Kel Vicious]\nI make a hundred crews give me enough respect\nCause my shit got the major funk effect, so check it\nSelect it, my rap style be highly respected\nChallenge Kel Vicious get burnt, expect it\nI'm twenty-one, and I'm a phe-nom-enon\nThe Def Squad, L.O.D. live on and on\nThese forty ounce drinkers, drinkers, big drug sellers\nSmellin like a blunt and if you front I'll split your melon\nWhat's your name?  Kelly Kel, where you from?  I'm from C.I\nWhat the FUCK you wanna know for punk?  You ready to die?\nYour biological clock, is tickin while I'm kickin\nForty ounce dreams of blunts and wishes for you trick-ass bitches\nThis is Mr. Kel Vicious with the ill funk flow\nKnockin punks out like my name was Riddick Bowe\n\n* sample repeats in background from Redman's \"Cosmic Slop\" (to fade)\n--] Attention passenger's we're on a non-central journey\nTo Hell and beyond\n\n[Erick Sermon]\nYo, haha, and that was just like I told ya\nWas gonna be for all them niggas\nRockin Daisy Duke and Reebok pumps\nUp in ya, ya tricks"}], "artist": "Keith Murray"}