{"songs": [{"year": "2013-10-25", "album": "S.C.O.T.", "image": "https://images.genius.com/84085e89142cb021fb85634062e40a2b.700x700x1.jpg", "title": "I Breathe Rap", "lyrics": "[Verse 1]\nCan you feel that? I call this real rap\nThe medicine for any kid who don't know where his meals at\nProbably ask him five years why you deal lad\nFlick his paper, grab the satty bag as he seals that\nCold world I'ma do my best to warm you up\nStreets are crazy on the daily, better warn a cunt\nNot political political so distant\nTo where I grew up you probably heard about the district\nCall it different, heated like a summers day\nMy rays burn, make a hater fuckin' run away\nTill my dying day, I'ma stay high mate\nRunning down a highway, find me in a driveway\nBottle of the Jack Black, who you trying to rap at?\nI'ma try get my head straight but I back track\nEvery time I think I'ma try not to sink\nDrive to the brink, high lightin' a spliff wish\nShit changed but in ways it stayed the same\nTo this day play the game, try to maintain but the fame\nDoes my fuckin' head in I ain't used to it yet\nYeah, I used to respect, you knew what I said\nBut these days I'm not sure if you relate\nIf you knew my fate true you'd be a mate\nAnyone would 'cause I'm destined for greatness\nTalking about Oz, I'm the best, I can say this\n\n[Hook]\nI live this life, this is my time\nThis is my mic right in the bright light\nEveryday I breathe rap, feedback, I don't need that\nDriving with my seat back, puffing on a weed patch\nDon't tell me how to live\nWhen there's a thousand kids, high vibed to the sound of this\nI drop this here and they feeling free\nFeel free till I die, I bet they feeling me\n\n[Verse 2]\nThis is fucked man I'm tensing it up\nCan't believe I'm halfway through and I ain't mentioned a drug\nDoes that mean I'm cleaning up? Is my life on a new road?\nSoon as I turn the mic on it's like you know\nAnd you know I'm your voice in fucking many ways\nThat's why you listen getting blazed on your wedding day\nYour girl she's a fan too she know I'm the real deal\nWalking down the street spinning out cos I feel ill\nSick of all these people acting nice cos I spit rhymes\nCan't I sit back getting high and just live life?\nNot the fans cos the fans are my whole life\nI mean the people being nice expecting I'm a goldmine\nThey ain't gonna get shit but a fuck you\nToo many people needing favours I ain't up too\nLet me get away imma do my best to relax\nAs long as when I go they remember these facts\n\n[Hook]\nI live this life, this is my time\nThis is my mic right in the bright light\nEveryday I breathe rap, feedback, I don't need that\nDriving with my seat back, puffing on a weed patch\nDon't tell me how to live\nWhen there's a thousand kids, high vibed to the sound of this\nI drop this here and they feeling free\nFeel free till I die, I bet they feeling me\n\n[Outro]\nAnother world getting cold, I'ma bring the heat\nHoping I am still here, will you even miss me?\nReal rap, straight facts and that's that\nThe king talks, you're not allowed to backchat\nAnother world getting cold, I'ma bring the heat\nHoping I am still here, will you even miss me?\nReal rap, straight facts and that's that\nThe king talks, you're not allowed to backchat"}], "artist": "Kerser"}