{"artist": "YG", "songs": [{"image": "https://images.genius.com/0234c65f6d6514702072da47412b8cc3.500x500x1.jpg", "year": "2011-05-02", "album": "Just Re’d Up", "lyrics": "[Verse 1: YG]\n\nUhh, I got this chick name Merchant(?), she my main squeeze\nGot this girl name Miesha, she my midnight creep\nI got bitches you niggas ain't fooling me\nMy boo thang Raven keep my strap in that Louis V\nGot this girl name Faye, she live across the way\nEvery time I need sex all I do is hop the gate\nI had this girl name Kate she had tats on her face\nBut when I stopped fucking with her she turned gay\nI got this chick name Bree she a lil' me\nI got this groupie girl named Takima, I let her fuck the team\nCause if you fuck with Mustard, you gotta fuck with Raymond\nIn order to fuck with me you gotta fuck the team\nAnd if you ever see me down, don't feel bad for me\nCause I got two, two bitches name Chastity\nNigga don't let her sit next to me\nCause popping ecstasy and gaming up your bitch is my specialty\n\n[Hook: YG and TY$]\n\nCause I got bitches\nI got bitches x7\nYo' girl, she like me x2\n\nX2\n\nOhh oh whoa oh x2\nYayee yayee x2\n\nX2\n\n[Verse 2: YG]\n\nUhmmm, got this girl name Renika she think I'm payin'\nAnd every time we have sex she wanna do it again\nAnd yo, I fuck with they friends, but they can't stop it\nCause I never give them dick again if they cock blocking\nGot this girl name Britney, always keep her with me\nShe always keep a couple grand stashed in her titties\nI got this girl name Shalon she with it all\nLittle did you know she like to take dick in her jaw\nAhh, it's Yung Joc Goin' Down\nTell me why yo girlfriend got me on speed dial\nGot the bitch name Roxanne she live in Bompton\nAnd she know we eating McDonalds if I'm paying\nGot this that live in Corona she use to live around the corner\nShe give me money when I put the dick on her\nOhh, It's Yung Joc Goin Down\nTell me why yo girlfriend got me on speed dial\n\n[Hook]\n\n[Bridge: DJ Mustard]\n\nOhh oh whoa oh x2\n(What's your Zodiac sign?)\nYayee yayee x2\n(What's your Zodiac sign?)\nOhh oh whoa oh x2\n(What's your Zodiac sign?)\nYayee yayee x2\n(What's your Zodiac sign?)\nCapricorn, Aquarius, Pisces oh!\nAries, Capricorns, Geminis oh!\nCancers, Leos, Virgos oh!\nLibra, Scorpio, Sagittarius\nOhh! Ohh! Ohh! Ohh!\nCause your girl she like me\nYo' girl she wanna ride me\nOh! oh! oh! oh! oh! oh! oh! oh! oh!\nYa'll know what it is right?\nIt's Pushaz Ink!\n\n[Hook]", "title": "I Got Bitches"}]}