{"songs": [{"image": "https://images.genius.com/82f7834d144f45508effe9c5138052f0.1000x1000x1.jpg", "year": "2017-01-19", "lyrics": "[Verse 1: Alex Wiley]\nBlast off (uhh baby)\nIt's the motherfucking time now\nDug a deep ditch when I quit school\nBut this rapping shit helping me climb out\nMe and Chancellor, fuck you tahm bout\nVillage shittin' on niggas in time out\nWhen im feeling this all that i rhyme 'bout\nMe and Kembe grindin' in the grind house\nAsking where I wanna go, who I wanna be\nMy life is nothing more than ripping all these beats\nAnd that's the way i want it im trippin'\nOf the weed and that im sippin' on at least you\nTipping, fuck you mean\nGotta get mine, gotta fucking win\nGotta bring the Village, I gotta represent it\nI gotta keep on pushing, gotta keep on working\nI can't stop yelling fuck though, I gotta keep on shittin'\nAll we wanna do is get money\nSeem like errbody want some shit from me\nLike put me on with this and hook me on with that\nFind your way up off my dick homie\nRemember I used to keep the sacks with me\nIn the basement, watching that Rap City\nNiggas used to say I rap shitty, funny\nNow them niggas want a track with me\n\n[Hook x2: Alex Wiley]\nIf my manager insults me again\nI will be assaulting him\nAfter I fuck the manager up\nThen I'm going to shorten the register up\nLet's go back, back to the Gap\nLook at my check, wasn't no scratch\nSo if I stole, wasn't my fault\nYeah I stole, never got caught\n\n[Interlude: GLC]\nYea, they're going to do it on purpose man\nIt's going to be haters lurking\nYou know what I'm talking about?\nWishing to see you fail\nBut at the end of the day if you got God on your side\nWhy the fuck would you believe in hell\nYou know what I'm talking about?\nHate ain't shit but the devil\nTell them motherfuckers to get up\nAnd get up on a whole 'nother motherfucking level\nIsm\n\n[Verse 2: Chance The Rapper]\nNASA, whole world wants to know what you crashed for\nJag off, what you jag for\nI'm just doing what you assholes, had asked for\nWhen we going to home?\nMy eyes hurt, my throat hurt, my soul hurt\nMy whole church know my niggas on dirt\nLil' college dropout, blame it on Ye'\nLil' Jimmy didn't grown up, he's slangin' them tapes\nSouthside, out West, South By Southwest\nDoubt my prowess, I guess 'bout now I'm fresh\nGoodness gracious\nVisionary chasing, Chance with a space and The\nThen a pronoun, and the car spacious\nAnd a spaceship for the spaceship like IGH!\n\n[Hook x2: Alex Wiley]\nIf my manager insults me again\nI will be assaulting him\nAfter I fuck the manager up\nThen I'm going to shorten the register up\nLet's go back, back to the Gap\nLook at my check, wasn't no scratch\nSo if I stole, wasn't my fault\nYeah I stole, never got caught\n\n[Verse 3: Chuck Inglish]\nEverything was right, everything was night, then I gave it light\nI was thinking about the other side, come in peace, yeah the underneath\nThe tree enormous, straight economics\nYou know the price cuz we save for college\nKnow what's right, ain't no way around it\nIt's the same thing that we do for dollars\nBad back, stay from round me\nI don't need it, I don't want it\nIt's the only thing that keep me going\nI don't even know where I'm going\nIf you see me on the sea, I be floating gravitating to the tree\nI be knowing what be really killing me\nI am a scope, and you just focus\n\n[Verse 4: Consequence]\nI remember how to take a dollar band\nYe and Dame was the hollar fam\nSo I'mma rep Queens and Hollis Ave\nTil they make me a hologram\nI told ya'll there was no days off\nTold ya'll we was gon' take off\nA&R was so proud of me\nThey didn't wanna pay me salaries\nBut now they blowing up my galaxy\nCan they come smoke loud with me\nI think back and have to say damn\nThen I gotta say Amen\nBut what I just took out of Chase\nI could probably go to outer space\nI don't have to reach the heap in the car\nAll I have to do is reach for the stars\n\n[Hook: Alex Wiley]\nIf my manager insults me again\nI will be assaulting him\nAfter I fuck the manager up\nThen I'm going to shorten the register up\nLet's go back, back to the Gap\nLook at my check, wasn't no scratch\nSo if I stole, wasn't my fault\nYeah I stole, never got caught\n\n[Outro: GLC]\nYea, always keep your ism at a magnificent level\nThat it's true, know what I'm talking about?\nI come to find out there's three type of people in the world\nThere's those that ask what happened\nThere's those that saw it happen\nAnd then there's those that made it happen\nAnd which one are you?\nCathedral-ism", "title": "Spaceship iii", "album": null}], "artist": "Alex Wiley"}