{"artist": "Bas", "songs": [{"lyrics": "[Intro: Correy C]\nI hope you figure it out\n\n[Verse 1: Bas]\nShine black man melanin gold\nI hope you never get old\nKeep your youthful spirit\nI know the world will fear it\nYou're the tip of the spear\nAnd with our dyin' breaths, I bet the world gon' hear it, look\nI been saving money for my taxes\nBassy keep on jumpin' through these brackets\nI got 20 bitches coming back to the crib\nI make sure my niggas got some racks, what you need?\nThey gon' shoot you niggas like it's practice\nI just make the money run some laps\nEvery time I pass go see the cash grow\nWe don't even act cordial, we assholes\nBitches in my lasso, is that so?\nThat's word to my last hoe, I'm that cold\nRunnin' through the town a black soul\nMy past froze twenty-nine times over\nLook I have seen more than my time\nLived 9 lives for about twenty cats over, I told ya\nEverything you've done I done overdid, I'm over it\nNigga, Dreamville the whole coast how we shouldered it?\nThem boys stale like toast when it's overdid\nI hope they quit for real\nBut if they don't I got a million joints\nI got the flow in pocket, the emoji rocket how I'm outta here\nA lot of em' sound like they in a talent show\nSo I give 'em something to remember like the Alamo\nTally-ho! A high Joker like a Spades game\nKeeping both eyes open wide rain man\nCrew high on that fuck your life drank man\nWe slide in the bucket like paint\nNever gave a fuck, fuck what you might think\nRan up in the club 'till they sent the lights in\nHad to tell the owner please let the lights dim\nFive more minutes see me a nice slim\nThick bitch with the you, me and my grin\nTell her bring the crew you me and my friends\nSee where the night end with the right guys\nTrust me and my kin, speak with the right pen\nCreep like the lightning in the night sky\nGo deep Janet Jackson, we back to back in\nBlack SUV's, black tints would you look at that?\nI'm booby-trapped in your fluid black skin\nNo groupie action, your bougie accent\nYou're truly classic, girl we outta here\n\n[Bridge: Bas]\nBas, it's Bassy\nQueens nigga with the Fiends nigga\nGot the bean waitin' in the pocket ooh\n\n[Verse 2: Bas]\nI asked P, what's poppin'?\nHe said we are nigga, trips to DR nigga\nGot the borough jumpin' like it's J.R. Smith\nKnow a couple niggas' let the A-R spit\nGot no interest what you say y'all did\nOnly where y'all live\nSmokin' blunts 'cause that's the way I live\nAnd where I live?\nNiggas dyin' front of their shorty, wives\nAnd their brother's ride on the other side\nEvery death is like a 100 lives\nFlatlined from the black nine\nI could feel the pressure multiplying\nMake you feel like ain't no hope in trying\nBut we always trying\nAll this blood I bet it float to sea and wash out\n'Cause they don't want you to see but watch out\nNigga watch out\n\n[Outro: Correy C + sample]\nSee I want you to see\nI've been through so many things\nThings ain't always what they seem\nHope you get the message\nI hope you figure it out\nNow I'm right where I belong\nHad to let it go\nAll the pain I was holding on\nNow I get the message\nI had to figure it out\nYou got to feel the music, do you understand?\nIt takes you higher and higher", "image": "https://images.genius.com/3b37d45fc94ddec028962c8f461114ea.1000x1000x1.jpg", "year": "2018-04-09", "title": "Pinball II", "album": null}]}